{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"27": "The Book of Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4254,
			"arabicnumber": "1646.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4255,
			"arabicnumber": "1646.02",
			"text": "Telah menceritakan kepadau [Abu At Thahir Ahmad bin 'Amru bin Sarh] telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahab] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [ayahnya] dia berkata; aku mendengar [Umar bin Khattab] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah Azza Wa Jalla melarang kalian bersumpah dengan menyebut nama bapak-bapak kalian.\" Selanjutnya Umar berkata, \"Demi Allah, aku tidak pernah lagi bersumpah dengan menyebut nama bapak-bapak setelah aku mendengarnya dari Rasulullah shallallahu 'alaihi wasallam, beliau melarang baik untuk orang lain atau diri sendiri.\" Dan telah menceritakan kepadaku [Abdul Malik bin Syua'ib bin Al Laits] telah menceritakan kepadaku [Bapakku] dari [kakekku] telah menceritakan kepadaku ['Uqail bin Khalid] (dalam jalur lain disebutkan) Dan telah menceritakan kepadaku [Ishaq bin Ibrahim] dan [Abd bin Humaid] keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] keduanya dari [Az Zuhri] dengan isnad seperti ini, namun dalam haditsnya 'Uqail disebutkan, \"Semenjak aku mendengar hal itu telah dilarang oleh Rasulullah shallallahu 'alaihi wasallam, maka aku tidak pernah bersumpah lagi dengan sumpah seperti itu, dan tidak pula berkata-kata dengan itu.\" Dan tidak mengatakan, \"Baik untuk diri sendiri atau orang lain.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan ['Amru An Naqid] serta [Zuhair bin Harb] mereka berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Salim] dari [Ayahnya] dia berkata, \"Nabi shallallahu 'alaihi wasallam pernah mendengar Umar yang sedang bersumpah dengan bapaknya…\" seperti riwayatnya Yunus dan Ma'mar",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4256,
			"arabicnumber": "1646.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4257,
			"arabicnumber": "1646.04",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rumh] sedangkan lafadznya dari dia, telah mengabarkan kepada kami [Laits] dari [Nafi'] dari [Abdullah] dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau pernah melihat Umar bin Khattab sedang berkendaraan, saat itu dia bersumpah dengan menyebut nama bapaknya, maka Rasulullah shallallahu 'alaihi wasallam menyeru mereka seraya bersabda: \"Ketahuilah, sesungguhnya Allah Azza Wa Jalla melarang kalian bersumpah dengan menyebut nama bapak kalian, siapa yang bersumpah hendaklah dia bersumpah dengan menyebut nama Allah atau diam.\" Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Ayahku]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Mutsanna] telah menceritakan kepada kami [Yahya] -yaitu Al Qatthan- dari [Ubaidullah]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Bisyr bin Hilal] telah menceritakan kepada kami [Abdul Warits] telah menceritakan kepada kami [Ayyub]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] dari [Al Walid bin Katsir]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Isma'il bin Umayyah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Rafi'] telah menceritakan kepada kami [Ibnu Abu Fudaik] telah mengabarkan kepada kami [Adl Dlahak] dan [Ibnu Abu Dzi`b]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Ibnu Rafi'] dari [Abdurrazaq] dari [Ibnu Juraij] telah mengabarkan kepadaku [Abdul Karim] mereka semua dari [Nafi'] dari [Ibnu Umar] seperti cerita ini, dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4258,
			"arabicnumber": "1646.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4259,
			"arabicnumber": "1646.06",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Yahya bin Ayyub] serta [Qutaibah] dan [Ibnu Hujr], [Yahya bin Yahya] berkata; telah mengabarkan kepada kami, sedangkan yang lain mengatakan; telah menceritakan kepada kami [Isma'il] -yaitu Ibnu Ja'far- dari [Abdullah bin Dinar] bahwa dia mendengar [Ibnu Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah, maka janganlah bersumpah kecuali dengan nama Allah.\" Sebab saat itu orang-orang Quraisy bersumpah dengan menyebut nama bapak mereka, oleh karena itu beliau bersabda: \"Janganlah kalian bersumpah dengan nama bapak kalian",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4260,
			"arabicnumber": "1647.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4261,
			"arabicnumber": "1647.02",
			"text": "Telah menceritakan kepadaku [Abu At Thahir] telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Humaid bin Abdurrahman bin 'Auf] bahwa [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam berabda: \"Siapa saja di antara kalian yang bersumpah dengan mengatakan dalam sumpahnya 'Demi Lata', maka hendaklah dia segera menyebut La Ilaaha Illallah. Dan barangsiapa mengajak temannya berjudi dengan mengatakan 'Mari berjudi', maka hendaknya dia bersedekah.\" Dan telah menceritakan kepadaku [Suwaid bin Sa'id] telah menceritakan kepada kami [Al Walid bin Muslim] dari [Al Auza'i]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan ['Abd bin Humaid] keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] keduanya dari [Az Zuhri] dengan isnad ini. Dan hadits Ma'mar seperti hadits Yunus, namun dalam haditsnya dia menyebutkan, \"Hendaknya dia bersedekah dengan sesuatu.\" Dan dalam hadits Auza'id disebutkan, \"Barang siapa bersumpah dengan menyebut Lata dan Uzza.\" Abu Husain Muslim berkata; perkataan 'Mari berjudi, hendaklah dia bersedekah', seperti ini tidak ada yang meriwayatkannya seorangpun selain Az Zuhri.\" Perawi berkata, \"Dan Az Zuhri juga mempunyai sekitar sembilan puluh riwayat yang dia riwayatkan dari Nabi shallallahu 'alaihi wasallam, sedangkan perawi yang lain tidak ikut serta di dalam riwayatnya dengan isnad yang kuat",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4262,
			"arabicnumber": "1648",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdul A'la] dari [Hisyam] dia berkata, dari [Hasan] dari [Abdurrahman bin samurah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian bersumpah dengan menyebut nama-nama berhala (thaghut) atau dengan menyebut bapak-bapak kalian",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4263,
			"arabicnumber": "1649.01",
			"text": "Telah menceritakan kepada kami [Khalf bin Hisyam] dan [Qutaibah bin sa'id] dan [Yahya bin Habib Al Haritsi] dan ini adalah lafadz Half, mereka berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Ghailan bin Jarir] dari [Abu Bardah] dari [Abu Musa Al Asy'ari] dia berkata, \"Aku pernah mendatangi Nabi shallallahu 'alaihi wasallam bersama dengan sekelompok orang-orang Asy'ari, untuk memohon perbelanjaan perang kepada beliau. Maka beliau bersabda: \"Demi Allah, sungguh aku tidak dapat memberikan perbelanjaan perang kepada kalian, karena aku tidak memiliki sesuatu untuk diberikan kepada kalian semua.\" Abu Musa melanjutkan, \"Setelah itu kami terdiam beberapa saat, sesuai yang dikehendaki Allah. Selang beberapa saat, ada seorang laki-laki datang dengan membawa unta kepada beliau, lalu beliau menyuruh untuk memberikannya kepada kami, yaitu tiga ekor unta berpunuk putih. Setelah kami pergi, kami saling berkata-kata sesama kami, \"Sepertinya Allah tidak memberkati kita, kita datang kepada Rasulullah shallallahu 'alaihi wasallam meminta perbelanjaan perang, lalu beliau bersumpah tidak akan menanggung perbelanjaan kita. Nyatanya kita diberikannya juga.\" Karena itu, mereka pergi menemui Rasulullah shallallahu 'alaihi wasallam dan menceritakan kepada beliau apa yang terpikir oleh mereka. Beliau bersabda: \"Memang, sesungguhnya bukan akulah yang menanggung perbelanjaan kalian, tetapi Allahlah yang menanggungnya. Demi Allah, sesungguhnya aku -Insya Allah- tidak akan mengucapkan suatu sumpah, kemudian melihat yang lebih baik dari itu kecuali aku akan membayar atas sumpahku, lalu aku akan ambil yang lebih baik",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4264,
			"arabicnumber": "1649.02",
			"text": "Telah menceritakan kepada kami [Abdullah bin Barrad Al Asy'ari] dan [Muhammad bin Al 'Ala' Al Hamdani] dan lafadznya saling berdekatan, keduanya berkata; telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] dia berkata, \"Para sahabatku pernah mengutusku menemui Rasulullah shallallahu 'alaihi wasallam untuk memintakan kepada beliau kendaraan buat membawa mereka, saat itu mereka bergabung bersama beliau dalam tentara usrah (perang dimasa sulit), yaitu perang Tabuk. Aku lalu berkata kepada beliau, \"Wahai Nabi Allah, sesungguhnya teman-temanku mengutusku menemui anda untuk memintakan bagi mereka, supaya anda dapat menanggung perlengkapan perang mereka.\" Beliau menjawab: \"Demi Allah, aku tidak dapat menanggung apa-apa buat kalian semua.\" Saat itu, aku melihat beliau dalam keadaan marah, dan aku tidak mengetahui sebabnya. Karena penolakan beliau, aku akhirnya kembali dengan perasaan sedih, sebab aku khawatir kalau beliau tidak senang kepadaku. Setelah aku bertemu dengan teman-temanku, lalu aku sampaikan jawaban Rasulullah shallallahu 'alaihi wasallam kepadaku. Tidak lama kemudian, terdengar suara Bilal yang sedang memanggilku, \"Wahai Abdullah bin Qais!\" Lalu aku jawab seruannya. Bilal berkata, \"Datanglah kepada Rasulullah shallallahu 'alaihi wasallam, sebab beliau sedang memanggilmu.\" Ketika aku sampai di hadapan Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Ambillah ini, satu untuk dua orang, satu untuk dua orang, satu untuk dua orang -sambil menunjuk kepada enam ekor unta yang habis beliau beli dari Sa'ad-. Bawalah unta ini semuanya kepada teman-temanmu, dan katakan kepada mereka, 'Sesungguhnya Allah jualah yang menanggung penyediaan kendaraan ini bagi kamu semua.' Naikilah mereka.\" Abu Musa melanjutkan, \"Unta-unta itu aku bawa semuanya kepada teman-temanku, seraya berkata, \"Rasulullah shallallahu 'alaihi wasallam menyuruh membawa kendaraan ini semuanya untuk kalian semua, tetapi demi Allah, aku tidak akan meninggalkan kalian sebelum beberapa orang di antara kalian pergi bersama-sama denganku menemui orang-orang yang mendengarkan ucapan (jawaban) Rasulullah shallallahu 'alaihi wasallam, ketika aku meminta kendaraan ini untuk kalian dan penolakan beliau di awal mulanya, namun kemudian beliau memberikannya kepadaku, supaya kalian tidak menyangka bahwa aku tidak mengada-ada apa yang telah dikatakan beliau.\" Mereka menjawab, \"Demi Allah, sesungguhnya kamu orang yang kami percayai, kendati begitu, akan kami lakukan juga apa yang kamu kehendaki.\" Lalu pergilah Abu Musa beserta beberapa orang teman-temannya, sehingga mereka bertemu dengan orang-orang yang mendengar ucapan dan penolakan Rasulullah shallallahu 'alaihi wasallam kepada mereka, tetapi kemudian beliau penuhi juga permintaan mereka. Orang-orang itu bercerita kepada mereka sebagaimana cerita Abu Musa",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4265,
			"arabicnumber": "1649.03",
			"text": "Telah menceritakan kepadaku [Abu Rabi' Al Ataki] telah menceritakan kepada kami [Hammad] -yaitu Ibnu Zaid- dari [Ayyub] dari [Abu Qilabah] dan dari [Qasim bin 'Ashim] dari [Zahdam Al Jarmi] -Ayyub berkata; dan aku lebih hafal dengan hadits Abu Qilabah- dia berkata, \"Kami berada di sisi [Abu Musa], lalu dia menyuguhkan kepadaku hidangan yang terdapat daging ayam, selang beberapa saat, ada seorang laki-laki dari Bani Taimillah berkulit merah seperti seorang budak masuk ke rumah, maka dia memanggilnya, \"Kesinilah.\" Dia pun menolaknya. Abu Musa memanggilnya lagi, \"Kesinilah, sungguh aku pernah melihat Rasulullah shallallahu 'alaihi wasallam pernah memakannya.\" Laki-laki itu mejawab, \"Sesungguhnya aku pernah melihat beliau memakan sesuatu, karena merasa jijik maka aku menjauhinya, setelah itu aku bersumpah untuk tidak memakannya lagi.\" Abu Musa menjawab, \"Kemarilah, aku akan menceritakan kepadamu mengenai hal itu, sungguh aku pernah mendatangi Rasulullah shallallahu 'alaihi wasallam beserta sekelompok orang dari Bani Asy'ariyah, untuk meminta kepada beliau kendaraan sebagai pengangkut perbekalan, lalu beliau bersabda: \"Demi Allah, aku tidak dapat membawa perbekalan kalian, dan sungguh aku tidak memiliki sesuatupun untuk dapat mengangkut perbekalan kalian.\" Kami terdiam beberapa saat -sebagaimana yang dikehendaki Allah-, tiba-tiba Rasulullah shallallahu 'alaihi wasallam diberi beberapa ekor unta, lalu beliau memanggil kami dan memerintahkan kepada kami supaya membawa lima ekor unta yang semuanya berwarna putih.\" Abu Musa melanjutkan, \"Tatkala kami berangkat, sebagian kami saling berkata kepada sebagian lainnya, 'Sepertinya Allah tidak memberkahi kita, sebab Rasulullah shallallahu 'alaihi wasallam telah menyalahi sumpahnya'.\" Lantas kami kembali menemui beliau seraya berkata, \"Wahai Rasulullah, Kami tadi menemui anda dan meminta kepadamu supaya anda dapat membawa perbekalan kami, dan anda terlanjur bersumpah bahwa anda tidak dapat membantu membawakan perbekalan kami, namun beberapa saat anda dapat membantu membawa perbekalan kami, apakah anda lupa wahai Rasulullah?\" beliau menjawab; \"Demi Allah, sungguh-Insya Allah-, tidaklah aku bersumpah lalu melihat yang lebih baik dari itu (sumpah), kecuali aku akan mengambil yang lebih baik dan akan aku bayar kafarahnya. Oleh karena itu berangkatlah kalian, sesungguhnya yang menanggung kalian adalah Allah Azza Wa Jalla.\" Dan telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Abdul Wahab At Tsaqafi] dari [Ayyub] dari [Abu Qilabah] dan [Qasim At Tamimi] dari [Zahdam Al Jarmi] dia berkata; \"Bahwa antara penduduk kampung ini yaitu dari Jarm dan Kaum Asy'ariyun masih ada ikatan kecintaan dan persaudaraan, dan saat itu kami berada di samping Abu Musa Al Asy'ari dan dia menyuguhkah kepadanya suatu hidangan yang terdapat daging ayam…\" kemudian dia menyebutkan seperti riwayat di atas. Dan telah menceritakan kepadaku [Ali bin Hujr As Sa'di] dan [Ishaq bin Ibrahim] serta [Ibnu Numair] dari [Isma'il bin 'Ulayyah] dari [Ayyub] dari [Al Qasim At Tamimi] dari [Zahdam Al Jarmi]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Abu Qilabah] dari [Zahdam Al Jarmi]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Abu Bakar bin Ishaq] telah menceritakan kepada kami [Affan bin Muslim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dan [Qasim] dari [Zahdam Al Jarmi] dia berkata; \"Kami pernah berada di samping [Abu Musa] …\" kemudian mereka menceritakan hadits-hadits yang semakna dengan hadits Hammad bin Zaid. Dan telah menceritakan kepada kami [Syaiban bin Farruh] telah menceritakan kepada kami [As Sha'q yaitu Ibnu Hazn] telah menceritakan kepada kami [Mathar Al Warraq] telah menceritakan kepada kami [Zahdam Al Jarmi] dia berkata; \"Aku pernah menemui [Abu Musa], saat itu dia sedang memakan daging ayam …\" kemudian dia melanjutkan hadits itu seperti hadits mereka, namun dia sedikit menambahkan; Beliau bersabda: \"Demi Allah, aku tidak lupa",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4266,
			"arabicnumber": "1649.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4267,
			"arabicnumber": "1649.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4268,
			"arabicnumber": "1649.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4269,
			"arabicnumber": "1649.07",
			"text": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Jarir] dari [Sulaiman At Taimi] dari [Dluraib bin Nuqair Al Qaisi] dari [Zahdam] dari [Abu Musa Al Asy'ari] dia berkata; \"Kami pernah menemui Rasulullah shallallahu 'alaihi wasallam untuk meminta supaya beliau dapat membantu membawakan perbekalan (peperangan). Maka beliau bersabda: \"Aku tidak dapat membantu membawakan perbekalan kalian, demi Allah, aku tidak dapat membantu membawa perbekalan kalian.\" Setelah beberapa saat, beliau mengutus seseorang kepada kami dengan membawa tiga ekor unta yang semuanya berwarna putih, maka kami berkata; \"Tadi kami menemui Rasulullah shallallahu 'alaihi wasallam dengan meminta bentuan supaya beliau dapat membawa perbekalan kami, lalu beliau bersumpah bahwa beliau tidak mampu membantu membawakan perbekalan kami, kemudian kami mendatangi beliau dan mengabarkan hal itu kepadanya.\" Lantas beliau bersabda: \"Sungguh, sekiranya aku terlanjur bersumpah, kemudian aku melihat ada sesuatu yang lebih baik dari sumpahku itu, maka aku akan melakukan sesuatu yang lebih baik dari sumpahku.\" Telah menceritakan kepada kami [Muhammad bin Abdul A'la At Taimi] telah menceritakan kepada kami [Al Mu'tamir] dari [ayahnya] telah menceritakan kepada kami [Abu As Salil] dari [Zahdam] bahwa dia pernah menceritakan kepadanya dari [Abu Musa] dia berkat; \"kami termasuk dari tentara yang berjalan kaki, lalu kami menemui Nabi Allah shallallahu 'alaihi wasallam dan meminta agar supaya beliau dapat membantu membawakan perbekalan kami …\" seperti hadits Jarir",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4270,
			"arabicnumber": "1649.08",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4271,
			"arabicnumber": "1650.01",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Marwan bin Mu'awiyah Al Fazari] telah mengabarkan kepada kami [Yazid bin Kaisan] dari [Abu Hazim] dari [Abu Hurairah] dia berkata, \"Seorang laki-laki berada di rumah Nabi shallallahu 'alaihi wasallam hingga larut malam, setelah itu dia pulang ke rumahnya, ternyata dia mendapati anak-anaknya lelap tertidur. Lalu isterinya datang kepadanya dengan membawa makanan, namun dia bersumpah untuk tidak makan demi anak-anaknya. Selang beberapa saat, dia berubah pikiran, akhirnya dia memakan makanan itu. Kemudian dia mendatangi Rasulullah shallallahu 'alaihi wasallam dan menceritakan hal itu kepada beliau. Maka Rasulullah shallallahu 'alaihi wasallam berkata: \"Barangsiapa bersumpah kemudian dia melihat ada sesuatu yang lebih baik daripadanya maka hendaklah dia melakukan hal itu dan membayar kafarah atas sumpahnya",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4272,
			"arabicnumber": "1650.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4273,
			"arabicnumber": "1650.03",
			"text": "Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Ibnu Abu Uwais] telah menceritakan kepadaku [Abdul Aziz bin Muthalib] dari [Suhail bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengucapkan sumpah, kemudian dia melihat ada sesuatu yang lebih baik dari yang dia ucapkan, hendaknya dia melakukan hal itu dengan membayar kafarah (denda) dari sumpahnya.\" Dan telah menceritakan kepadaku [Al Qasim bin Zakaria] telah menceritakan kepada kami [Khalid bin Mukhlad] telah menceritakan kepadaku [Sulaiman] -yaitu Ibnu Bilal- telah menceritakan kepadaku [Suhail] dengan isnad ini, dengan makna hadits Malik, yaitu; \"Hendaknya dia membayar kafarah (denda) sumpahnya, dan melaksanakan sesuatu yang lebih baik",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4274,
			"arabicnumber": "1650.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4275,
			"arabicnumber": "1651.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] dari [Abdul Aziz] -yaitu Ibnu Rufai'- dari [Tamim bin Tharafah] dia berkata, \"Seorang peminta menemui ['Adi bin Hatim], lalu dia meminta uang untuk membayar gaji pembantu -atau meminta sebagian uang untuk membayar gaji pembantu-, maka dia menjawab, \"Aku tidak memiliki sesuatupun untuk membayarkanya kecuali baju besiku dan penutup kepalanya, maka pergilah kepada keluargaku semoga dia bisa memberikan sedikit kepadamu.\" Tamim melanjutkan, \"Ternyata laki-laki itu tidak mau, akhirnya 'Adi marah sambil berkata, 'Demi Allah, sungguh aku akan memberikan sesuatu untukmu.\" Kemudian laki-laki tersebut rela, lalu Adi berkata, \"Demi Allah, sekiranya aku tidak pernah mendengar sabda Rasulullah shallallahu 'alaihi wasallam, 'Barangsiapa mengucapkan sumpah, kemudian dia melihat sesuatu yang yang lebih bisa membuatnya takwa kepada Allah, maka hendaknya dia melakukan sesuatu yang lebih bisa membuatnya takwa kepada Allah', niscaya aku tidak akan melanggar sumpahku",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4276,
			"arabicnumber": "1651.02",
			"text": "Telah menceritakan kepada kami ['Ubaidullah bin Mu'adz] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Syu'bah] dari [Abdul Aziz bin Rufai'] dari [Tamim bin Tharafah] dari ['Adi bin Hatim] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengucapkan sumpah, kemudian dia melihat sesuatu yang lebih baik dari sumpahnya itu, maka hendaknya dia melakukan sesuatu yang lebih baik itu dan meninggalkan sumpahnya",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4277,
			"arabicnumber": "1651.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4278,
			"arabicnumber": "1651.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4279,
			"arabicnumber": "1651.05",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] dari [Tamim bin Tharfah] dia berkata; aku pernah mendengar ['Adi bin Hatim] dan saat itu dia didatangi seorang laki-laki yang meminta uang seratus dirham, maka dia berkata, \"Apakah kamu meminta kepadaku seratus dirham, padahal aku adalah Ibnu Hatim?!, Demi Allah, aku tidak akan memberikan kepadamu.\" Kemudian dia berkata, \"Sekiranya aku tidak pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengucapkan sumpah, kemudian dia melihat ada sesuatu yang lebih baik dari sumpahnya, maka hendaknya dia melakukan sesuatu yang lebih baik itu.\" Telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Simak bin Harb] dia berkata; aku pernah mendengar [Tamim bin Tharafah] berkata; aku pernah mendengar ['Adi bin Hatim] bahwa suatu ketika ada seorang laki-laki yang meminta kepadanya …\", kemudian dia menyebutkan hadits seperti itu dengan menambahkan, \"Dan dari pemberianku untukmu adalah empat ratus",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4280,
			"arabicnumber": "1651.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4281,
			"arabicnumber": "1652.01",
			"text": "Telah menceritakan kepada kami [Syaiban bin Farruh] telah menceritakan kepada kami [Jarir bin Hazim] telah menceritakan kepada kami [Al Hasan] telah menceritakan kepada kami [Abdurrahman bin Samurah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah bersabda kepadaku: \"Wahai Abdurrahman bin Samurah, janganlah kamu meminta-minta jabatan, karena meminta jabatan resikonya sangatlah berat, namun jika kamu diserahi jabatan tanpa kamu minta, maka kamu akan ditolong dalam jabatanmu. Dan apabila kamu bersumpah dengan suatu sumpah, kemudian kamu melihat ada sesuatu yang lebih baik dari sumpahmu itu, maka bayarlah kafarah (denda) dari sumpahmu itu dan lakukanlah sesuatu yang lebih baik dari sumpahmu.\" Abu Ahmad Al Jaludi berkata; telah menceritakan kepada kami Abu Al abbas Al Masarjasi telah menceritakan kepada kami Syaiban bin Farruh dengan hadits ini, telah menceritakan kepadaku [Ali bin Hujr As Sa'di] telah menceritakan kepada kami [Husyaim] dari [Yunus] dan [Manshur] dan [Humaid]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Kamil Al Jahdari] telah menceritakan kepada kami [Hammad bin Zaid] dari [Simak bin 'Athiyah] dan [Yunus bin 'Ubaid] dan [Hisyam bin Hassan] dalam riwayat lain. (dalam jalur lain disebutkan) Telah menceritakan kepada kami ['Ubaidullah bin Mu'adz] telah menceritakan kepada kami [Al Mu'tamir] dari [Ayahnya]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami ['Uqbah bin Mukram Al 'Ammi] telah menceritakan kepada kami [Sa'id bin 'Amir] dari [Sa'id] dari [Qatadah] semuanya dari [Al Hasan] dari [Abdurrahman bin Samurah] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini, dan dalam hadits Mu'tamir dari ayahnya tidak di sebutkan tentang \"Jabatan (Imarah)",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4282,
			"arabicnumber": "1652.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4283,
			"arabicnumber": "1653.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dan ['Amru An Naqid], [Yahya] berkata; telah mengabarkan kepada kami [Husyaim bin Basyir] dari [Abdullah bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sumpahmu adalah sesuatu yang dapat meyakinkan sahabatmu.\" Dan 'Amru mengatakan, \"Yaitu yang dapat meyakinkan sahabatmu",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4284,
			"arabicnumber": "1653.02",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun] dari [Husyaim] dari [Abbad bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sumpah itu tergantung dengan niat orang yang mengatakan sumpah",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4285,
			"arabicnumber": "1654.01",
			"text": "Telah menceritakan kepada kami [Abu Ar Rabi' Ataki] dan [Abu Kamil Al Jahdari Fudlail bin Husain] dan ini adalah lafadz Abu Ar Rabi', keduanya berkata; telah menceritakan kepada kami [Hammad] -yaitu Ibnu Zaid- telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Abu Hurairah] dia berkata, \"Nabi Shallallahu 'Alaihi Wasalam Sulaiman mempunyai enam puluh orang isteri, lalu dia berkata, \"Malam ini aku akan menyetubuhi mereka semua, hingga masing-masing dari mereka hamil dan melahirkan seorang anak keturunan persi yang akan berperang di jalan Allah.\" Ternyata tidak ada seorangpun dari isterinya yang mengandung kecuali hanya seorang saja, yang melahirkan anak yang cacat.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya dia mengatakan Insya Allah (jika Allah berkehendak), niscaya semua isterinya akan melahirkan satu orang anak keturunan persi yang nantinya akan berperang di jalan Allah",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4286,
			"arabicnumber": "1654.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abbad] dan [Ibnu Abu Umar] dan ini adalah lafadz Ibnu Abu Umar, keduanya berkata; telah menceritakan kepada kami [Sufyan] dari [Hisyam bin Hujair] dari [Thawus] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Nabi Allah Sulaiman bin Daud pernah berkata, 'Sungguh aku akan menggilir tujuh puluh isteriku dalam satu malam, yang nantinya masing-masing mereka akan melahirkan seorang anak laki-laki yang akan berjuang di jalan Allah', lantas sahabatnya -atau Malaikat- memberi saran, 'Ucapkanlah 'Insya Allah'.' Namun dia lupa mengucapkannya. Ternyata tidak seorang pun dari isterinya yang melahirkan kecuali hanya seorang isteri yang melahirkan seorang anak yang cacat.\" Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya dia mengucapkan 'Insya Allah', tentu dia tidak akan melanggar sumpahnya, dan apa yang dihajatkannya akan terkabul.\" Dan telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Abu Az Zannad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4287,
			"arabicnumber": "1654.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4288,
			"arabicnumber": "1654.04",
			"text": "Telah menceritakan kepada kami ['Abd bin Humaid] telah mengabarkan kepada kami [Abdurrazaq bin Hammam] telah mengabarkan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [Ayahnya] dari [Abu Hurairah] dia berkata, \"Sulaiman bin Daud pernah berkata, 'Sungguh aku akan menggilir tujuh puluh isteriku dalam semalam, yang nantinya masing-masing mereka akan melahirkan anak yang akan berjuang di jalan Allah, maka dikatakan kepadanya, 'Ucapkanlah Insya Allah'. Namun dia tidak mengucapannya, dan dia tetap menggilir mereka semua. Ternyata tidak ada seorang pun dari mereka yang melahirkan kecuali satu orang yang melahirkan anak yang cacat.\" Abu Hurairah melanjutkan, \"Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya dia mengucapkan Insya Allah, maka dia tidak akan melanggar sumpahnya dan akan mendapatkan apa yang dihajatkannya",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4289,
			"arabicnumber": "1654.05",
			"text": "dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Syababah] telah menceritakan kepadaku [Warqa'] dari [Abu Az Zinnad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sulaiman bin Daud pernah berkata, 'Sungguh aku akan menggilir sembilan puluh isteriku dalam semalam, yang nantinya mereka semua melahirkan pejuang yang berjuang di jalan Allah'. Maka sahabatnya (Malaikat) berkata kepadanya, 'Ucapkanlah Insya Allah.' Namun dia tidak juga mengucapkan Insya Allah, dan dia tetap menggilir mereka semua, ternyata para isterinya tidak ada yang melahirkan kecuali seorang isteri yang melahirkan anak yang cacat. Dan demi Dzat yang jiwa Muhammad berada digenggaman-Nya, sekiranya dia mengucapkan Insya Allah niscaya dia akan mendapatkan pejuang-pejuang yang akan berjihad di jalan Allah.\" Dan telah menceritakan kepadaku [Suwaid bin Sa'id] telah menceritakan kepada kami [Hafsh bin Maisarah] dari [Musa bin 'Uqbah] dari [Abu Az Zinnad] dengan isnad seperti itu, namun dia menyebutkan, \"Setiap mereka akan melahirkan anak laki-laki yang nantinya akan berjihad di jalan Allah",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4290,
			"arabicnumber": "1654.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4291,
			"arabicnumber": "1655",
			"text": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dia berkata; ini adalah yang pernah diceritakan oleh [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, kemudian dia menyebutkan hadits yang di antaranya adalah, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Allah, sungguh, orang yang berkeras hati untuk tetap melaksanakan sumpahnya, padahal sumpah tersebut dapat membahayakan keluarganya, maka dosanya lebih besar di sisi Allah daripada dia membayar denda yang diwajibkan oleh Allah",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4292,
			"arabicnumber": "1656.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4293,
			"arabicnumber": "1656.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Abu Bakar Al Muqaddami] dan [Muhammad bin Al Mutsanna] dan [Zuhair bin Harb] sedangkan lafadznya dari Zuhair, mereka berkata; telah menceritakan kepada kami [Yahya] -yaitu Ibnu Sa'id Al Qatthan- dari ['Ubaidullah] dia berkata; telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] bahwa [Umar] berkata, \"Wahai Rasulullah, sesungguhnya ketika masih Jahiliyyah aku pernah bernadzar untuk beri'tikaf semalam di Masjidil Haram.\" Beliau bersabda: \"Tunaikanlah nadzarmu.\" Dan telah menceritakan kepada kami [Abu Sa'id Al Asyaj] telah menceritakan kepada kami [Abu Usamah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul Wahb] -yaitu At tsaqafi-. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Muhammad bin Al 'Ala'] dan [Ishaq bin Ibrahim] semuanya dari [Hafsh bin Ghiyats]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin 'Amru bin Jabalah bin Abu Rawad] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] semuanya dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar]. Dan Hafsh berkata; \"Dan di antaranya dari Umar dengan hadits seperti ini.\" Adapun dalam hadits Abu Usamah dan Ats Tsaqafi disebutkan, 'Beri'tikaf satu malam.' Sedangkan dalam hadits Syu'bah disebutkan, 'Sehari untuk beri'tikaf.' Namun dalam hadits Hafsh tidak disebutkan, 'Semalam atau sehari",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4294,
			"arabicnumber": "1656.03",
			"text": "Dan telah menceritakan kepadaku [Abu At Thahir] telah mengabarkan kepada kami [Abdullah bin Wahb] telah menceritakan kepada kami [Jarir bin Hazim] bahwa [Ayyub] telah menceritakan kepadanya bahwa [Nafi'] telah menceritakan kepadanya bahwa [Abdullah bin Umar] telah menceritakan kepadanya, bahwa [Umar bin Khattab] pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam ketika berada di Ji'ranah, sekembalinya dari Tha`if dia berkata, \"Wahai Rasulullah, sesungguhnya ketika masih Jahiliyyah aku pernah bernadzar untuk beri'tikaf sehari di Masjidil Haram, bagaimana pendapatmu?\" beliau bersabda: \"Pergilah dan beri'tikaflah sehari.\" Abdullah bin Umar melanjutkan, \"Rasulullah shallallahu 'alaihi wasallam pernah memberi seorang sahaya perempuan kepada Umar bin Khattab, yang merupakan bagian seperlima dari harta rampasan perang. Ketika Rasulullah shallallahu 'alaihi wasallam memerdekakan para tawanan perang, maka Umar bin Khattab mendengar suara mereka yang menyatakan, \"Rasulullah shallallahu 'alaihi wasallam telah memerdekakan kami.\" Umar akhirnya bertanya-tanya, \"Ada apa ini?\" mereka menjawab, \"Rasulullah shallallahu 'alaihi wasallam telah memerdekakan para tawanan perang.\" Lalu Umar berkata, 'Wahai Abdullah, pergi dan temuilah sahaya perempuan itu dan merdekakanlah dia.\" Dan telah menceritakan kepada kami ['Abd bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Sekembalinya Nabi dari perang Hunain, Umar bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai nadzar yang pernah dia nadzarkan ketika masih Jahiliyah, yaitu untuk beri'tikaf sehari…\", kemudian dia menyebutkan seperti makna hadits Jarir bin Hazim'.\" Dan telah menceritakan kepada kami [Ahmad bin 'Abdah Adl Dlabbi] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Ayyub] d ari [Nafi'] dia berkata, \"Suatu ketik, disebutkan di sisi Ibnu Umar perihal 'Umrah Rasulullah shallallahu 'alaihi wasallam dari Ji'ranah, maka dia berkata, \"Beliau belum pernah 'umrah darinya.\" Dia melanjutkan, \"Ketika itu Umar pernah bernadzar di waktu Jahiliyah untuk beri'tikaf semalam…\", kemudian dia menyebutkan seperti hadits Jarir bin Hazim dan Ma'mar dari Ayyub.\" Dan telah menceritakan kepadaku [Abdullah bin Abdurrahman Ad Darimi] telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad] dari [Ayyub]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Yahya bin Khalaf] telah menceritakan kepada kami [Abdul A'la] dari [Muhammad bin Ishaq] keduanya dari [Nafi'] dari [Ibnu Umar] dengan hadits ini, yaitu mengenai nadzar. Dan dalam hadits keduanya disebutkan, \"I'tikaf sehari",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4295,
			"arabicnumber": "1656.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4296,
			"arabicnumber": "1656.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4297,
			"arabicnumber": "1656.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4298,
			"arabicnumber": "1657.01",
			"text": "Telah menceritakan kepadaku [Abu Kamil Fudlail bin Husain Al Jahdari] telah menceritakan kepada kami [Abu 'Awanah] dari [Firas] dari [Dzakwan Abu Shalih] dari [Zadzan Abu 'Umar] dia berkata, \"Aku pernah menemui [Ibnu Umar] yang saat itu dia habis memerdekakan seorang budak.\" Zadzan melanjutkan, \"Kemudian dia mengambil dahan atau sesuatu dari atas tanah sambil berkata, \"Tidaklah aku mendapatkan pahala melainkan seimbang dengan benda ini, karena aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menampar sahayanya atau memukul sahayanya, maka kafarahnya (tebusannya) adalah memerdekakannya",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4299,
			"arabicnumber": "1657.02",
			"text": "dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] dan ini adalah lafadz Ibnu Mutanna, keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Firas] dia berkata; aku pernah mendengar [Dzakwan] menceritakan dari [Zadzan] bahwa [Ibnu Umar] pernah memanggil seorang budak miliknya, lalu dia melihat ada bekas pukulan dipunggungnya, lantas dia bertanya kepada budaknya, \"Apakah aku telah menyakitimu?\" dia menjawab, \"Tidak.\" Ibnu Umar berkata, \"Sekarang kamu telah merdeka.\" Zadzan melanjutkan, \"Kemudian dia mengambil sesuatu dari atas tanah sambil berkata, \"Dalam hal ini tidaklah aku mendapatkan pahala lebih dari ini, karena aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memukul budaknya melebihi batas atau menamprnya, maka kafarahnya (tebusannya) adalah memerdekakannya.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdurrahman] keduanya dari [Sufyan] dari [Firas] dengan sanadnya Syu'bah dan Abu 'Awanah. Adapun dalam hadits Ibnu Mahdi disebutkan, \"Ada suatu had yang belum dia tunaikannya.\" Sedangkan dalam hadits Waki' disebutkan, \"Barangsiapa menampar budaknya….\", tanpa menyebutkan, \"Ada hadnya",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4300,
			"arabicnumber": "1657.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4301,
			"arabicnumber": "1658.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Numair] dan ini adalah lafadz dari dia, telah menceritakan kepadaku [Ayahku] telah menceritakan kepada kami [Sufyan] dari [Salamah bin Kuhail] dari [Mu'awiyah bin Suwaid] dia berkata, \"Aku pernah menampar seorang bekas budak milikku, lalu aku pergi dan kembali pulang menjelang zhuhur, kemudian aku shalat di belakang ayahku. Lantas [ayahku] memanggilku dan memanggilnya (bekas budakku), lalu dia berkata, \"Tamparlah dia sebagaiamana dia menamparmu.\" Namun bekas budakku mema'afkanku hingga ayahku pun berkata, \"Kami adalah bani Muqarrin yang di masa Rasulullah shallallahu 'alaihi wasallam kami tidak memiliki pelayan kecuali hanya satu orang wanita, kemudian salah seorang dari kami menamparnya, ternyata hal itu sampai kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"Merdekakanlah dia.\" Mereka berkata, \"Kami tidak memiliki pelayan lain selain dia.\" Beliau menjawab, \"Mintalah dia supaya tetap menjadi pelayan kalian sementara waktu, kemudian biarkanlah dia bebas",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4302,
			"arabicnumber": "1658.02",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Muhammad bin Abdullah bin Numair] dan ini adalah lafadz Abu Bakar, keduanya berkata; telah menceritakan kepada kami [Ibnu Idris] dari [Hushain] dari [Hilal bin Yasaf] dia berkata, \"Ada seorang tua yang suka cepat naik pitam, kemudian dia menampar budak miliknya, maka [Suwaid bin Muqarin] berkata kepadanya, \"Apakah kamu tidak dapat menahan untuk tidak menampar wajahnya? Sungguh, aku adalah anak yang ketujuh dari keturunan Bani Muqarrin, dulunya aku tidak memiliki budak melainkan satu orang saja, kemudian saudara yang paling muda dari kami menamparnya, lantas Rasulullah shallallahu 'alaihi wasallam memerintahkan supaya kami memerdekakan dia.\" Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] keduanya berkata; telah menceritakan kepada kami [Ibnu Abu 'adi] dari [Syu'bah] dari [Hushain] dari [Hilal bin Yasaf] dia berkata, \"Kami biasa membeli perkakas rumah tangga di rumahnya [Suwaid bin Muqarrin], yaitu saudara laki-lakinya An Nu'man bin Muqarrin, tiba-tiba seorang budak perempuan keluar dan mencela seorang laki-laki dari kami hingga ia pun menampar budak tersebut, seketika itu Suwaid pun marah …\", kemudian dia menyebutkan hadits seperti riwayatnya Ibnu Idris",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4303,
			"arabicnumber": "1658.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4304,
			"arabicnumber": "1658.04",
			"text": "Telah menceritakan kepada kami [Abdul Warits bin Abdush Shamad] telah menceritakan kepadaku [Ayahku] telah menceritakan kepada kami [Syu'bah] berkata; [Muhammad bin Munkadir] bertanya kepadaku, \"Siapakah namamu?\" Aku menjawab, \"Syu'bah.\" Selanjutnya [Muhammad] berkata; telah menceritakan kepadaku [Abu Syu'bah Al 'Iraqi] dari [Suwaid bin Muqarrin], bahwa seorang budak perempuan miliknya pernah ditampar oleh seseorang, lalu Suwaid berkata kepada orang itu, \"Tahukah kamu bahwa wajah itu haram untuk ditampar?\" Suwaid berkata lagi, \"Sungguh, aku adalah anak yang ke tujuh di antara saudara-saudaraku, dan aku pernah mengalami peristiwa ini pada masa Rasulullah shallallahu 'alaihi wasallam, padahal saat itu pelayan kami hanya satu orang, lalu salah seorang dari kami ada yang sengaja menampar pelayan perempuan (budak) kami, maka Rasulullah shallallahu 'alaihi wasallam pun memerintahkan kepada kami supaya memerdekakan dia.\" Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Al Mutsanna] dari [Wahb bin Jarir] telah mengabarkan kepada kami [Syu'bah] dia berkata; [Muhammad bin Al Munkadir] pernah bertanya kepadaku, \"Siapakah namamu?\" kemudian dia menyebutkan seperti hadits Abdush Shamad",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4305,
			"arabicnumber": "1658.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4306,
			"arabicnumber": "1659.01",
			"text": "Telah menceritakan kepada kami [Abu Kamil Al Jahdari] telah menceritakan kepada kami [Abdul Wahid] -yaitu Ibnu Ziyad- telah menceritakan kepada kami [Al A'masy] dari [Ibrahim At Taimi] dari [Ayahnya] dia berkata; [Abu Mas'ud Al Badri] berkata, \"Aku pernah memukul pelayan (budak) milikku dengan cemeti, tiba-tiba aku mendengar suara dari belakangku, 'Ketahuilah wahai Abu Mas'ud! Ketahuilah wahai Abu Mas'ud! ', aku tidak memperhatikan suara tersebut karena terlalu marahnya.\" Abu Mas'ud berkata, \"Ketika telah dekat, ternyata itu adalah Rasulullah shallallahu 'alaihi wasallam. Dan beliaulah yang mengatakan, 'Ketahuilah wahai Abu Mas'ud. Ketahuilah wahai Abu Mas'ud.\" Abu Mas'ud berkata, \"Kemudian aku melemparkan cemeti dari tanganku.\" Lantas beliau bersabda: \"Ketahuilah wahai Abu Mas'ud, Sesungguhnya Allah lebih kuasa atas dirimu daripada kuasamu atas budak ini.\" Abu Mas'ud berkata lagi, \"Kemudian aku berkata, \"Aku tidak akan memukul seorang budak pun setelah itu.\" Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Jarir]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Muhammad bin Humaid] -yaitu Al Ma'mari- dari [Sufyan]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Sufyan]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Abu 'Awanah] semuanya dari [Al A'masy] dengan sanadnya Abdul Wahid, seperti haditsnya (Al A'masy). Hanya saja dalam hadits Jarir disebutan, \"Tiba-tiba cemeti tersebut terjatuh dari tanganku karena kagetnya",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4307,
			"arabicnumber": "1659.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4308,
			"arabicnumber": "1659.03",
			"text": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Ibrahim At Taimi] dari [Ayahnya] dari [Abu Mas'ud Al Anshari] dia berkata, \"Aku pernah memukul seorang budak milikku, lalu aku mendengar suara seseorang menyeru dari belakang, \"Ketahuilah wahai Abu Mas'ud, sesungguhnya Allah lebih berkuasa atas dirimu daripada kuasamu atas dia.\" Setelah aku menoleh, ternyata itu adalah Rasulullah shallallahu 'alaihi wasallam. Maka Aku pun berkata, \"Wahai Rasulullah, dia sekarang aku bebaskan karena Allah.\" Beliau bersabda: \"Seandainya kamu tidak membebaskanya, maka kamu akan dilahap oleh api neraka",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4309,
			"arabicnumber": "1659.04",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] dan ini adalah lafadz Ibnu Mutsanna, keduanya berkata; telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Syu'bah] dari [Sulaiman] dari [Ibrahim At Taimi] dari [Ayahnya] dari [Abu Mas'ud], bahwa dia pernah memukul budak miliknya, kemudian budaknya mengatakan, \"Aku berlindung kepada Allah.\" Perawi berkata, \"Kemudian dia memukulnya lagi, lalu budaknya mengatakan, \"Aku berlindung kepada Rasulullah shallallahu 'alaihi wasallam.\" Kemudian Abu Mas'ud meninggalkannya. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Demi Allah, sungguh Allah lebih berkuasa atas dirimu daripada kuasamu atas dia.\" Perawi berkata, \"Kemudian ia memerdekakannya.\" Dan telah menceritakan kepadaku [Bisyr bin Khalid] telah mengabarkan kepada kami [Muhammad] -yaitu Ibnu Ja'far- dari [Syu'bah] dengan sanad ini, namun dia tidak menyebutkan perkataannya, \"Aku berlindung kepada Allah dan aku berlindung kepada Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4310,
			"arabicnumber": "1659.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4311,
			"arabicnumber": "1660.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ibnu Numair]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Fudlail bin Ghazwan] dia berkata; aku mendengar [Abdurrahman bin Abu Nu'm] telah menceritakan kepadaku [Abu Hurairah] dia berkata, \"Abu Qasim shallallahu 'alaihi wasallam pernah bersabda: \"Barangsiapa menuduh seorang budak berbuat zina, maka dia akan dikenakan had (hukuman setimpal) pada hari Kiamat, kecuali jika tuduhannya benar.\" Dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Ishaq bin Yusuf Al Azraq] keduanya dari [Fudlail bi Ghazwan] dengan sanad ini. Dan dalam hadits keduanya disebutkan, \"Aku pernah mendengar Abu Qasim shallallahu 'alaihi wasallam, yaitu Nabi yang menyukai taubat",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4312,
			"arabicnumber": "1660.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4313,
			"arabicnumber": "1661.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Al A'masy] dari [Al Ma'rur bin Suwaid] dia berkata, \"Kami pernah melewati Abu Dzar di Rabdzah, saat itu dia mengenakan kain burdah, sebagaimana dia, budaknya juga mengenakan pakaian yang sama. Kami lalu bertanya, \"Wahai [Abu Dzar], sekiranya kamu menggabungkan dua kain burdah itu, tentu akan menjadi pakaian yang lengkap.\" Kemudian dia berkata, \"Dahulu aku pernah adu mulut dengan saudaraku (seiman), ibunya adalah orang 'Ajam (non Arab), lalu aku mengejek ibunya hingga ia pun mengadu kepada Nabi shallallahu 'alaihi wasallam. Ketika aku berjumpa dengan Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Wahai Abu Dzar, sungguh dalam dirimu masih terdapat sifat jahiliyah.\" Maka aku membantah, \"Wahai Rasulullah, barangsiapa mencela laki-laki, maka mereka (para lelaki itu) akan mencela bapak dan ibunya.\" Beliau bersabda lagi: \"Wahai Abu Dzar, sungguh dalam dirimu masih terdapat sifat Jahiliyah, mereka semua adalah saudara-saudaramu yang dijadikan Allah tunduk di bawah kekuasaanmu. Oleh karena itu, berilah mereka makan sebagaimana yang kamu makan, berilah mereka pakaian sebagaimana pakaian yang kamu kenakan, dan janganlah kamu membebani mereka di luar kemampuannya. Jika kamu memberikan beban kepada mereka, maka bantulah mereka.\" Dan telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Mu'awiyah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Isa bin Yunus] semuanya dari [Al A'masy] dengan sanad ini, namun dalam hadits Zuhair dan Abu Mu'awiyah ada tambahan setelah perkataan 'Sesungguhnya dalam dirimu masih terdapat sifat jahiliyah'. Abu Dzar berkata; lalu aku menjawab, \"Apakah karena keadaanku lebih terpandang?\" beliau menjawab: \"Ya.\" Dan dalam riwayatnya Abu Mu'awiyah disebutkan, \"Ya, karena keadaanmu lebih terpandang.\" Dan dalam hadit Isa disebutkan, \"Jika kamu membebani sesuatu yang memberatkan bagi dirinya, hendaknya kamu membantunya -tidak menggunakan lafadz yu'inhu (menolongnya) -.\" Dan selesai pada perkataannya, \"Dan janganlah kamu membenai sesuatu yang memberatkan bagi dirinya",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4314,
			"arabicnumber": "1661.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4315,
			"arabicnumber": "1661.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] dan ini adalah lafadz Ibnu Mutsanna, keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Washil Al Ahdab] dari [Ma'rur bin Suwaid] dia berkata, \"Aku pernah melihat [Abu Dzar] memakai pakaian serupa dengan sahayanya. Lalu aku bertanya perihal itu, dia mengatakan bahwa pada masa Rasulullah shallallahu 'alaihi wasallam ia pernah mencela seorang laki-laki dengan cara mencela ibunya (laki-laki tersebut). Lalu laki-laki itu mengadu kepada Nabi shallallahu 'alaihi wasallam, hingga Nabi shallallahu 'alaihi wasallam pun bersabda kepadanya: \"Sungguh, dalam dirimu masih terdapat sifat jahiliyah! Sesungguhnya mereka adalah saudaramu dan paman-pamanmu yang dititipkan Allah di bawah pengurusanmu, karena barangsiapa memiliki saudara yang masih dalam pengurusanya, hendaklah dia diberi makan sebagaimana yang dia makan, diberi pakaian sebagaimana ia mengenakan pakaian. Dan janganlah kamu bebani mereka di luar batas kemampuan mereka, dan jika kamu membebani mereka, maka bantulah mereka dalam menyelesaikan tugasnya",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4316,
			"arabicnumber": "1662",
			"text": "Dan telah menceritakan kepadaku [Abu At Thahir Ahmad bin 'Amru bin Sarh] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepada kami ['Amru bin Al Harits] bahwa [Bukair bin Al Asyaj] telah menceritakan kepadanya dari [Al 'Ajlan] bekas budak Fatimah, dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang budak itu berhak mendapatkan makan dan sandang (dari tuannya) dan janganlah dia dibebani atas suatu pekerjaan melainkan sesuai dengan kemampuannya",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4317,
			"arabicnumber": "1663",
			"text": "Telah menceritakan kepada kami [Al Qa'nabi] telah menceritakan kepada kami [Daud bin Qais] dari [Musa bin Yasar] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila budakmu membuatkan makanan untukmu, kemudian ia membawakannya ke hadapanmu dalam keadaan matang dan telah mendapatkan lelahnya, maka suruhlah dia duduk dan makan bersama. Jika makanan itu hanya sedikit, maka letakkanlah di tanganya sesuap atau dua suap",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4318,
			"arabicnumber": "1664.01",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4319,
			"arabicnumber": "1664.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; aku membacakannya di hadapan [Malik]; dari [Nafi'] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, jika seorang budak baik dalam berbakti kepada tuannya dan baik dalam beribadah kepada Allah, maka dia akan mendapatkan pahala dua kali lipat.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] dan [Muhammad bin Al Mutsanna] keduanya berkata; telah menceritakan kepada kami [Yahya] -yaitu Al Qatthan-. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Ayahku]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ibnu Numair] dan [Abu Usamah] semuanya dari ['Ubaidullah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepadaku [Usamah] semuanya dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti haditsnya Malik",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4320,
			"arabicnumber": "1665.01",
			"text": "Telah menceritakan kepadaku [Abu At Thahir] dan [Harmalah bin Yahya] keduanya berkata; telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dia berkata; aku pernah mendengar [Sa'id bin Musayyab] berkata, \" [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Bagi seorang budak yang selalu berusaha berbuat baik, maka dia akan mendapatkan pahala dua kali lipat.' Demi Dzat yang jiwa Abu Hurairah berada di tangan-Nya, seandainya tidak ada kewajiban jihad di jalan Allah, haji dan berbakti kepada ibu, tentu aku lebih senang mati dalam keadaan menjadi budak.\" Perawi berkata, \"Kami mendapat kabar bahwa Abu Hurairah tidak melakukan haji kecuali setelah ibunya meninggal dunia, karena dia harus menemani ibunya.\" [Abu At Thahir] menyebutkan dalam haditsnya, \"Seorang budak yang selalu berusaha berbuat baik.\" Dan tidak mengatakan, 'Seorang hamba sahaya'.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Abu Shafwan Al Amawi] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dengan sanad ini, tanpa menyebutkan, 'Dan telah sampai kepadaku'. Atau, 'Setelahnya",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4321,
			"arabicnumber": "1665.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4322,
			"arabicnumber": "1666.01",
			"text": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila seorang budak melaksanakan hak-hak Allah dan hak-hak walinya (tuannya), maka dia akan mendapatkan pahala dua kali lipat.\" Perawi berkata, \"Ketika hadits tersebut aku ceritakan kepada Ka'ab, maka I apun berkata, \"Baginya tidak ada hisap, tidak juga atas seorang mukmin yang zuhud.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dengan isnad ini",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4323,
			"arabicnumber": "1666.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4324,
			"arabicnumber": "1667",
			"text": "Dan telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabih] dia berkata; Ini adalah sesuatu yang pernah diceritakan oleh [Abu Hurairah] kepada kami, dari Rasulullah shallallahu 'alaihi wasallam. Kemudian dia menyebutkan beberapa hadits yang di antaranya adalah, (Abu Hurairah) berkata, \"Rasulullah shallallahu 'alaihi wasallam bersbda: \"Sebaik-baik budak adalah apabila dia wafat setelah membaguskan diri untuk beribadah kepada Allah dan berbuat baik kepada tuannya",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4325,
			"arabicnumber": "1501.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4326,
			"arabicnumber": "1501.04",
			"text": "Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Bapakku] telah menceritakan kepada kami ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memerdekakan hak kepemilikan dari seorang budak, jika dia memiliki cukup harta, hendaknya dia juga membebaskan kepemilikan semuanya, jika tidak memiliki harta yang cukup untuk memerdekakan semuanya, berarti dia telah memerdekakan sebagiannya",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4327,
			"arabicnumber": "1501.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4328,
			"arabicnumber": "1501.06",
			"text": "Telah menceritakan kepada kami [Syaiban bin Farruh] telah menceritakan kepada kami [Jarir bin Hazim] dari [Nafi'] bekas budak Abdullah bin Umar, dari [Abdullah bin Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersbda: \"Barangsiapa membebaskan bagian kepemilikan dari seorang budak, dan apabila dia memiliki cukup harta untuk membayar sisanya, maka hendaknya ia membebaskan dengan membayar sisa dari harga budak tersebut, jika tidak maka sungguh ia telah membebaskan apa yang menjadi miliknya.\" Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Muhammad bin Rumh] dari [Al Laits bin Sa'd]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul Wahab] aku telah mendengar [Yahya bin Sa'id]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Abu Ar Rabi'] dan [Abu Kamil] keduanya berkata; telah menceritakan kepada kami [Hammad] -yaitu Ibnu Zaid-. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il] -yaitu Ibnu 'Ulayyah- keduanya dari [Ayyub]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Manshur] telah mengabarkan kepada kami [Abdurrazaq] dari [Ibnu Juraij] telah mengabarkan kepadau [Isma'il bin Umayah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Ibnu Abu fudaik] dari [Ibnu Abu Dzi`b]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Harun bin Sa'id Al Aili] telah mengabarkan kepada kami [Ibnu Wahb] dia berkata, telah mengabarkan kepadaku [Usamah] -yaitu Ibnu Zaid- mereka semua dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini, namun dalam hadits mereka tidak disebutkan, \"Jika dia tidak memiliki harta, maka dia telah membebaskan bagiannya saja.\" Kecuali dalam hadits Ayyub dan Yahya bin Sa'id, karena keduanya menyebutkan kalimat tersebut dalam hadits. Keduanya berkata, \"Kami tidak tahu, apakah kalimat tersebut termasuk dalam hadits atau hanya sekedar perkataannya Nafi'.\" Dan dalam riwayatnya mereka semua juga tidak disebutkan, 'Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam …\", kecuali dalam hadits Laits bin Sa'ad",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4329,
			"arabicnumber": "1501.07",
			"text": "Telah menceritakan kepada kami ['Amru An Naqid] dan [Ibnu Abu Umar] keduanya dari [Ibnu 'Uyainah], [Ibnu Abu Umar] berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Amru] dari [Salim bin Abdullah] dari [Ayahnya], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memerdekakan seorang budak yang dimilikinya bersama orang lain, hendaknya dia membayar bagiannya kepada partnernya secara adil, tidak boleh curang dan tidak boleh berbuat zhalim, kemudian dia memerdekakan dengan hartanya, jika dia mampu",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4330,
			"arabicnumber": "1501.08",
			"text": "Dan telah menceritakan kepada kami ['Abd bin Humaid] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memerdekakan bagiannya atas seorang budak, hendaklah ia membebaskan sisa bagian yang lainnya jika ia memiliki uang yang mencukupinya (harganya)",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4331,
			"arabicnumber": "1502.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4332,
			"arabicnumber": "1503.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4333,
			"arabicnumber": "1503.05",
			"text": "Dan telah menceritakan kepadaku [Amru An Naqid] telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Abu 'Arubah] dari [Qatadah] dari [An Nadlr bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa membebaskan bagian kepemilikanya pada seorang budak, maka dialah yang menanggung biaya pemerdekakan budak tersebut, jika dia memiliki harta, sekiranya dia tidak memiliki harta (untuk dibayarkan kepada hak kepemilikan partnernya), hendaknya budak tersebut diberi kelonggaran untuk menebus pembebasannya dengan tidak diperberat.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dan [Muhammad bin Bisyr]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Ali bin Khasyram] keduanya berkata; telah mengabarkan kepada kami [Isa bin Yunus] semuanya dari [Ibnu Abu 'Arubah] dengan isnad ini. Dan dalam hadits Isa disebutkan, \"Kemudian dia diberi kelonggaran untuk menebus pembebasannya dengan tidak diperberat",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4334,
			"arabicnumber": "1503.06",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4335,
			"arabicnumber": "1668.01",
			"text": "Telah menceritakan kepada kami [Ali bin Hujr As Sa'di] dan [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] mereka berkata; telah menceritakan kepada kami [Isma'il] -yaitu Ibnu 'Ulayah- dari [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Imran bin Hushain], bahwa ada seorang laki-laki yang memerdekakan enam orang budak miliknya ketika dia akan meninggal dunia, sedangkan dia tidak memiliki yang lain selain keenam budak tersebut. Lantas Rasulullah shallallahu 'alaihi wasallam memanggil keenam budak tersebut, lalu membagi mereka ke dalam tiga kelompok kemudian mengundinya. Setelah itu beliau memerdekakan dua orang, sedangkan empat orang yang lainnya masih tetap menjadi seorang budak. Dan beliau juga menyalahkan pemilik budak tersebut.\" Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Hammad]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Ibnu Abu Umar] dari [At Tsaqafi] keduanya dari [Ayyub] dengan isnad ini. Hadits Hamamd mirip seperti riwayat Ibnu 'Ulayah, sedangkan dalam hadits At Tsaqafi disebutkan, bahwa seorang laki-laki Anshar menjelang kematiannya memberi wasiat untuk memerdekakan enam orang budak miliknya….\" Dan telah menceritakan kepada kami [Muhammad bin Minhal Adl Dlarir] dan [Ahmad bin 'Abdah] keduanya berkata; telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Hisyam bin Hasan] dari [Muhammad bin Sirin] dari ['Imran bin Hushain] dari Nabi shallallahu 'alaihi wasallam seperti hadits Ibnu 'Ulayyah dan Hammad",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4336,
			"arabicnumber": "1668.02",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4337,
			"arabicnumber": "1668.03",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4338,
			"arabicnumber": "997.03",
			"text": "Telah menceritakan kepada kami [Abu Ar Rabi' Sulaiman bin Daud Al 'Ataki] telah menceritakan kepada kami [Hammad] -yaitu Ibnu Zaid- dari ['Amru bin Dinar] dari [Jabir bin Abdullah], bahwa seorang laki-laki memerdekakan seorang budak miliknya secara dubur, padahal ia tidak memiliki harta selain budak tersebut. Ketika berita itu sampai kepada Nabi shallallahu 'alaihi wasallam, maka beliau pun bersabda: \"Siapa yang ingin membeli budak ini dariku?\" Maka Nu'ain bin Abdullah membeli budak tersebut dari beliau seharga seratus dirham, lalu uang tersebut diserahkan kepadanya (Jabir).\" ['Amru] berkata, \"Aku pernah mendengar [Jabir bin Abdullah] berkata, \"Dia adalah seorang budak Qibthi yang meninggal awal tahun (dari pemerintahannya Ibnu Zubair)",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4339,
			"arabicnumber": "997.04",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4340,
			"arabicnumber": "997.05",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4341,
			"arabicnumber": "997.06",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ishaq bin Ibrahim] dari [Ibnu 'Uyainah], [Abu Bakar] berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dia berkata; ['Amru] pernah mendengar [Jabir] berkata, \"Seorang laki-laki Anshar pernah membebaskan seorang budak miliknya dengan cara dubur, namun dia tidak memiliki harta selain budak tersebut. Lantas Rasulullah shallallahu 'alaihi wasallam menjualkan budak tersebut.\" Jabir berkata, \"Kemudian budak tersebut dibeli oleh Ibnu Nahham. Budak tersebut adalah seorang Qibthi yang meninggal di awal pemerintahan Ibnu Zubair.\" Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Ibnu Rumh] dari [Laits bin sa'd] dari ['Amru bin Dinar] telah menceritakan kepada kami [Al Mughirah] -yaitu Al Hizami- dari [Abdul Majid bin Suhail] dari ['Atha bin Abu Rabah] dari [Jabir bin Abdullah]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Abdullah bin Hasyim] telah menceritakan kepada kami [Yahya] -yaitu Ibnu Sa'id- dari [Al Husain bin Dzakwan Al Mu'allim] telah menceritakan kepadaku ['Atha] dari [Jabir]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Abu Ghassan Al Misma'i] telah menceritakan kepada kami [Mu'adz] telah menceritakan kepadaku [Ayahku] dari [Mathar] dari ['Atha bin Abu Rabah] dan [Abu Zubair] dan ['Amru bin Dinar] bahwa [Jabir bin Abdullah] pernah menceritakan kepada mereka mengenai jual beli budak mudabbar, setiap orang dari mereka berkata, dari Nabi shallallahu 'alaihi wasallam yang semakna dengan hadits Hamamd bin 'Uyainah dari 'Amru dari Jabir",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 88
			}
		}
	]
}