{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5114,
			"arabicnumber": "977.03",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Muhammad bin Al Mutsanna] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Fudlail], [Abu Bakar] berkata; dari [Abu Sinan], dan [Ibnu Al Mutsanna] berkata; dari [Dlirar bin Murrah] dari [Muharib] dari [Ibnu Buraidah] dari [ayahnya]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Muhammad bin Fudlail] telah menceritakan kepada kami [Dlirar bin Murrah Abu Sinan] dari [Muharib bin Ditsar] dari [Abdullah bin Buraidah] dari [ayahnya] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku pernah melarang kalian berziarah kubur, sekarang berziarahlah. Saya juga pernah melarang kalian makan daging kurban setelah tiga hari, sekarang simpanlah untuk keperluan kalian. Dan saya juga pernah melarang kalian meminum anggur kecuali jika dalam bejana minum, sekarang minumlah dalam semua bejana kalian, tetapi jangan sekali-kali kamu minum yang memabukkan.\" Dan telah menceritakan kepadaku [Hajjaj bin Sya'ir] telah menceritakan kepada kami [Adl Dlahak bin Makhlad] dari [Sufyan] dari ['Alqamah bin Martsad] dari [Ibnu Buraidah] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku pernah melarang kalian…kemudian ia menyebutkan hadits Abu Sinan",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5115,
			"arabicnumber": "977.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5127,
			"arabicnumber": "1979.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] telah mengabarkan kepada kami [Hajjaj bin Muhammad] dari [Ibnu Juraij] telah menceritakan kepadaku [Ibnu Syihab] dari [Ali bin Husain bin Ali] dari ayahnya [Husain bin Ali] dari [Ali bin Abu Thalib] dia berkata, \"Dahulu saya pernah mendapatkan satu ekor unta dari hasil rampasan perang Badr bersama Rasulullah shallallahu 'alaihi wasallam, lalu Rasulullah shallallahu 'alaihi wasallam menambahku lagi dengan satu ekor unta. Suatu hari saya menambatkan kedua hewan tersebut di depan pintu rumah milik orang Anshar, aku ingin membawa idzkhir dan meletakkannya di atas kedua punggung hewan tersebut untuk saya jual, sedangkan aku bersama seorang laki-laki penjual emas dari Bani Qainuqa`. Dan hasil dari penjualan itu akan aku pergunakan untuk menyelenggarakan pesta pernikahan Fatimah. Ternyata dalam rumah tersebut terdapat Hamzah bin Abdul Mutthalib sedang meminum minuman keras, dia sedang dihibur oleh seorang penyanyi perempuan yang dalam salah satu nyanyiannya terselip kata-kata, \"Wahai Hamzah, ingatlah pada unta-unta yang montok.\" Maka Hamzah pun berdiri dengan membawa pedang terhunus. Lalu dia memotong punuk kedua unta tersebut, lalu membelah perutnya dan mengambil hati yang ada di dalamnya.\" Saya lalu bertanya kepada Ibnu Syihab, \"Dan dua punuknya?\" dia menjawab, \"Dan dia telah memotong kedua punuk unta tersebut.\" Ibnu Syihab berkata, \"Ali berkata, \"Saya melihat pemandangan yang mengejutkan bagiku, lantas saya langsung mendatangi Nabi shallallahu 'alaihi wasallam, dan di samping beliau terdapat Zaid bin Haritsah. Lalu saya memberitahukan kepada beliau apa yang terjadi. Setelah itu beliau keluar bersama Zaid bin Tsabit, dan saya pun ikut bersama beliau. Kemudian beliau menemui Hamzah dan memarahinya. Ternyata Hamzah memandangi beliau sambil berkata, \"Kalian ini tidak lain hanyalah para budak bapakku.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam kembali pulang dan meninggalkan mereka.\" Dan telah menceritakan kepada kami ['Abd bin Humaid] telah mengabarkan kepadaku [Abdurrazaq] telah mengabarkan kepadaku [Ibnu Juraij] dengan isnad seperti ini",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5128,
			"arabicnumber": "1979.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5129,
			"arabicnumber": "1979.03",
			"text": "Dan telah menceritakan kepadaku [Abu Bakar bin Ishaq] telah mengabarkan kepada kami [Sa'id bin Katsir bin 'Ufair Abu Utsman Al Mishri] telah menceritakan kepada kami [Abdullah bin Wahb] telah menceritakan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] telah mengabarkan kepadaku ['Ali bin Husain bin Ali] bahwa [Husain bin Ali] mengabarkan kepadanya, bahwa [Ali] berkata, \"Dahulu saya pernah memiliki seekor unta dari hasil pembagian harta rampasan perang Badr, pada hari itu pula Rasulullah shallallahu 'alaihi wasallam memberikan seekor unta dari bagian seperlima. Ketika hendak membina rumah tangga dengan Fatimah -puteri Rasulullah shallallahu 'alaihi wasallam- saya telah mengikat janji dengan seorang tukang emas dari Bani Qainuqa' untuk pergi bersamaku sambil membawa idzkir (semacam tumbuhan) yang akan saya jual, dan uang hasil penjualan itu dapat saya pergunakan untuk penyelenggaraan pernikahan saya. Pada saat mempersiapkan barang-barang bagi keperluan kedua unta tersebut, seperti pelana, karung dan tali. Saat itu kedua unta saya terikat di samping rumah seorang Anshar, dan ternyata saya mendapati kedua unta saya -setelah mempersiapkan barang-barang yang perlu dipersiapkan- sudah terpotong punuknya, terbelah perutnya dan telah terambil hatinya. Kedua mataku tidak kuasa melihat pemandangan itu, lalu saya bertanya, \"Siapakah yang melakukan semua ini?\" orang-orang menjawab, \"Hamzah bin Abdul Mutthalib, dan dia sekarang berada di rumah ini bersama-sama dengan orang-orang Anshar yang suka meminum minuman keras. Dia dan teman-temannya sedang dihibur oleh seorang penyanyi perempuan yang dalam salah satu nyanyiannya terselip kata-kata, 'Wahai Hamzah, ingatlah pada unta-unta yang montok.' Maka Hamzah pun berdiri dengan membawa pedang terhunus. Lalu dia memotong punuk kedua unta tersebut dan ia belah perut keduanya kemudian hati keduanya di ambil.\" Ali berkata, \"Kemudian saya langsung pergi menemui Rasulullah shallallahu 'alaihi wasallam yang pada saat itu beliau sedang duduk bersama Zaid bin Haritsah.\" Ali berkata, \"Melihat raut mukaku, ternyata Rasulullah shallallahu 'alaihi wasallam tahu akan peristiwa yang terjadi.\" Maka Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apa yang terjadi denganmu?\" saya menjawab, \"Wahai Rasulullah, demi Allah belum pernah seumur hidupku melihat kejadian seperti hari ini. Hamzah telah menyerang kedua untaku, dia telah memotong punuknya dan membelah isi perutnya. Sekarang dia berada di rumah bersama teman-temannya yang suka meminum minuman keras.\" Ali berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam mengambil jubahnya. Setelah mengenakannya beliau berangkat ke rumah yang disebutkannya itu dengan berjalan kaki, sementara saya dan Zaid mengikutinya dari belakang. Sesampainya di depan pintu rumah yang di dalamnya ada Hamzah, Rasulullah shallallahu 'alaihi wasallam meminta izin masuk. Para penghuni rumah pun memberikan izin masuk. Ternyata mereka adalah para peminum minuman keras. Lalu Rasulullah shallallahu 'alaihi wasallam mulai mencela Hamzah terhadap apa yang telah diperbuatnya. Pada saat itu, kedua mata Hamzah memerah dan dia juga mulai mengamati Rasulullah shallallahu 'alaihi wasallam dari kedua lutut naik ke pusar dan akhirnya ke wajah beliau. Kemudian Hamzah berkata, \"Kalian ini tidak lain hanyalah para budak bapakku.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam mengetahui bahwa Hamzah sedang mabuk berat. Lalu beliau mundur ke belakang dan keluar. Melihat itu kami pun pergi keluar mengikuti beliau.\" Dan telah menceritakan kepadaku [Muhammad bin Abdullah Al Quhzadza] telah menceritakan kepadaku [Abdullah bin Utsman] dari [Abdullah bin Mubarak] dari [Yunus] dari [Az Zuhri] dengan sanad seperti ini",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5130,
			"arabicnumber": "1979.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5131,
			"arabicnumber": "1980.01",
			"text": "Telah menceritakan kepadaku [Abu Ar Rabi' Sulaiman bin Daud Al 'Ataki] telah menceritakan kepada kami [Hammad] -yaitu Ibnu Zaid- telah mengabarkan kepada kami [Tsabit] dari [Anas bin Malik] dia berkata, \"Saya pernah menuangkan khamer kepada sekelompok kaum di rumah Abu Thalhah ketika khamer diharamkan, dan saat itu mereka tidak minum kecuali dari Fadlih (minuman keras yang terbuat dari perasan kurma), kurma muda dan kurma masak. Tiba-tiba ada seseorang yang berseru, lantas Abu Thalhah berkata, \"Keluarlah dan lihatlah apa yang terjadi.\" Ternyata seseorang berseru, katanya, \"Tidakkah khamer telah diharamkan.\" Anas berkata, \"Kemudian berita itu tersebar ke seluruh Kota Madinah, lantas Abu Thalhah berkata kepadaku, \"Keluar dan baunglah.\" Maka saya langsung menumpahkannya. Saat itu orang-orang berkata, atau sebagian dari mereka berkata, \"Seseorang telah meninggal, sedangkan khamer tersebut masih dalam perut mereka.\" -Tsabit berkata; \"Namun saya tidak mengetahui apakah itu termasuk dari hadits Anas- Maka Allah Azza Wa Jalla berfirman: '(Tidak ada dosa bagi orang-orang yang beriman dan mengerjakan amalan shalih karena memakan makanan yang telah mereka makan dahulu, apabila mereka bertakwa dan beriman serta beramal shalih …) ' (? Qs. Al Maidah: 93)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5132,
			"arabicnumber": "1980.02",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu Ulayyah] telah mengabarkan kepada kami [Abdul Aziz bun Shuhaib] dia berkata, \"Orang-orang bertanya kepada [Anas bin Malik] mengenai minuman campuran kurma muda.\" Dia menjawab, \"Ketika itu kami tidak memiliki khamer selain minuman campuran kurma sebagaimana yang kalian namakan dengan Al Fadlikh. Ketika aku sedang menuangkan campuran kurma tersebut kepada Abu Thalhah, Abu Ayyub dan beberapa orang dari sahabat Rasulullah shallallahu 'alaihi wasallam di rumah kami, tiba-tiba seorang laki-laki datang sambil berkata, \"Apakah telah sampai kepada kalian suatu berita?\" kami menjawab, \"Belum.\" Dia berkata, \"Sesungguhnya Khamer telah diharamkan.\" Maka Abu Thalhah berkata, \"Wahai Anas, tumpahkanlah wadah ini.\" Anas berkata, \"Setelah laki-laki tersebut menyampaikan berita, maka mereka kembali dan tidak lagi bertanya-tanya lagi tentang hukumnya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5133,
			"arabicnumber": "1980.03",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu Ulayyah] dia berkata; dan telah mengabarkan kepada kami [Sulaiman At Taimi] telah menceritakan kepada kami [Anas bin Malik] dia berkata, \"Saya pernah menjadi pelayan yang bertugas menuangkan minuman kepada paman-pamanku, ketika itu saya menuangkan Fadlikh (perasan dari kurma muda) kepada mereka, saat itu aku adalah orang yang termuda di antara mereka, tiba-tiba seorang laki-laki datang sambil berkata, \"Sesungguhnya khamer telah diharamkan.\" Lantas mereka berkata, \"Wahai Anas, buanglah!\" Lalu saya menumpahkannya. Sulaiman berkata, \"Saya bertanya kepada Anas, \"Minuman apakah itu?\" Anas menjawab, \"Busyr (kurma muda) dan ruthab (kurma masak).\" Perawi berkata, \"Lalu Abu Bakar bin Anas berkata, \"Saat itu khamer mereka adalah Al Fadlih (minuman dari campuran kurma).\" [Sulaiman] berkata, \" [seorang laki-laki] menceritakan kepadaku dari [Anas bin Malik], bahwa dia berkata seperti itu juga.\" Telah menceritakan kepadaku [Muhammad bin Abdul A'la] telah menceritakan kepadaku [Al Mu'tamir] dari [ayahnya] dia berkata; [Anas] berkata, \"Saya pernah menjadi pelayan di suatu kaum untuk menuangkan minuman kepada mereka...seperti hadits Ibnu Ulayyah, hanya saja ia menyebutkan, \"Abu Bakar bin Anas mengatakan, \"Khamer mereka saat itu adalah Al Fadlikh (terbuat dari campuran kurma).\" Anas adalah orang yang saat itu menyaksikannya, maka ia pun tidak mengingkarinya.\" [Ibnu Abdul A'la] berkata; telah menceritakan kepadaku [Al Mu'tamir] dari [ayahnya] dia berkata; telah menceritakan kepadaku [sebagian orang yang bersamaku] bahwa dia pernah mendengar [Anas] berkata, \"Saat itu khamer mereka adalah Al Fadlikh",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5134,
			"arabicnumber": "1980.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5135,
			"arabicnumber": "1980.05",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu 'Ulayyah], dia berkata; dan telah mengabarkan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Anas bin Malik] dia berkata, \"Aku pernah menuangkan (minuman) untuk Abu Thalhah, Abu Dujanah dan Mu'adz bin Jabal disekumpulan orang-orang Anshar, tiba-tiba seseorang masuk menemui kami sambil berseru, \"Ada kabar baru! khamer telah diharamkan.\" Seketika itu kami langsung menumpahkannya, sedangkan khamer waktu itu terbuat dari campuran busr (kurma muda) dan tamr (kurma kering).\" [Qatadah] berkata, \" [Anas bin Malik] berkata, \"Sungguh, khamer telah diharamkan, sedangkan pada umumnya khamer waktu itu terbuat dari campuran busr dan tamr.\" Dan telah menceritakan kepada kami [Abu Ghassan Al Misma'i] dan [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] mereka berkata; telah mengabarkan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [Ayahku] dari [Qatadah] dari [Anas bin Malik] dia berkata, \"Sungguh, saya pernah menuangkan (minuman) campuran busr dan tamr kepada Abu Thalhah, Abu Dujanah dan Suhail bin Baidla` dari geriba besar....sebaimana haditsnya Sa'id",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5136,
			"arabicnumber": "1980.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5137,
			"arabicnumber": "1981",
			"text": "Dan telah menceritakan kepadaku [Abu Thahir Ahmad bin 'Amru bin Sarh] telah mengabarkan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku ['Amru bin Al Harits] bahwa [Qatadah bin Di'amah] telah menceritakan kepadanya, bahwa dia pernah mendengar [Anas bin Malik] berkata, \"Sesugguhnya Rasulullah shallallahu 'alaihi wasallam melarang minuman dengan mencapur antara kurma masak dengan kurma muda, sebab hal itu adalah awal kali khamer diharamkan",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5138,
			"arabicnumber": "1980.07",
			"text": "Dan telah menceritakan kepadaku [Abu At Thahir] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Malik bin Anas] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] bahwa dia berkata, \"Saya pernah menuangkan minuman dari Fadlikh (minuman yang terbuat dari campuran kurma muda) dan Tamr (minuman yang terbuat dari kurma) kepada Abu Ubaidah bin Jarrah, Abu Thalhah dan Ubay bin Ka'ab, tiba-tiba seseorang datang kepada mereka sambil berkata, \"Sesungguhnya khamer telah diharamkan.\" Lantas Abu Thalhah berkata, \"Wahai Anas, berdirilah! Ambil dan pecahlah bejana (khamer) ini.\" Kemudian saya mengambil gentong milik kami dan saya pukul bawahnya hingga pecah",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5139,
			"arabicnumber": "1982",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abu Bakar] -yaitu Al Hanafi- telah menceritakan kepada kami [Abdul Hamid bin Ja'far] telah menceritakan kepadaku [ayahku] bahwa dia pernah mendengar [Anas bin Malik] berkata, \"Sesungguhnya Allah telah menurunkan ayat tentang pengharaman khamer, ketika itu di Madinah tidak ada khamer kecuali yang terbuat dari tamr (kurma)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5140,
			"arabicnumber": "1983",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abdurrahman bin Mahdi]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari [As Suddi] dari [Yahya bin 'Abbad] dari [Anas], bahwa Nabi shallallahu 'alaihi wasallam pernah ditanya mengenai khamer yang dibuat cuka, maka beliau bersabda: \"Jangan",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5141,
			"arabicnumber": "1984",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] dan ini adalah lafadz Ibnu Al Mutsanna, keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] dari ['Alqamah bin Wa`il] dari ayahnya [Wa`il Al Hadlrami] bahwa Thariq bin Suwaid Al Ju'fi pernah bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai khamer, maka beliau pun melarangnya atau benci membuatnya.\" Lalu dia berkata, \"Saya membuatnya hanya untuk obat.\" Maka beliau bersabda: \"Khamer itu bukanlah obat, akan tetapi ia adalah penyakit",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5142,
			"arabicnumber": "1985.01",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il bin Ibrahim] telah mengabarkan kepada kami [Al Hajjaj bin Abu Utsman] telah menceritakan kepadaku [Yahya bin Abu Katsir] bahwa [Abu Katsir] telah menceritakan kepadanya dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Khamer itu bisa terbuat dari dua macam pohon ini; kurma dan anggur",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5143,
			"arabicnumber": "1985.02",
			"text": "Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepada kami [Abu Katsir] dia berkata; saya mendengar [Abu Hurairah] berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Khamer itu bisa terbuat dari dua macam pohon ini; kurma dan anggur",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5144,
			"arabicnumber": "1985.03",
			"text": "Dan telah menceritakan kepada kami [Zuhair bin Harb] dan [Abu Kuraib] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Al Auza'i] dan [Ikrimah bin 'Ammar] dan ['Uqbah bi At Tau`am] dari [Abu Katsir] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: Khamer itu bisa terbuat dari dua jenis pohon ini; anggur dan kurma.\" Dan dalam riwayatnya Abu Kuraib juga menyebutkan, \"Pohon anggur dan pohon kurma",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5145,
			"arabicnumber": "1986.01",
			"text": "Telah menceritakan kepada kami [Syaiban bin Farruh] telah menceritakan kepada kami [Jarir bin Hazim] saya mendengar ['Atha bin Abu Rabah] telah menceritakan kepada kami [Jabir bin Abdullah Al Anshari], bahwa Nabi shallallahu 'alaihi wasallam melarang mencampur antara anggur dengan kurma masak, kurma muda dengan kurma masak (untuk dibuat perasan)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5146,
			"arabicnumber": "1986.02",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari ['Atha bin Abu Rabah] dari [Jabir bin Abdullah Al Anshari] dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau melarang membuat perasan kurma dengan anggur menjadi satu, dan melarang membuat perasan kurma segar (matang) dengan kurma muda menjadi satu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5147,
			"arabicnumber": "1986.03",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Rafi'] dan ini adalah lafadz Ibnu Rafi', keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] dia berkata; ['Atha] pernah berkata; saya pernah mendengar [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mencampur antara perasan ruthab (kurma segar) dengan busr (kurma muda) dan antara perasan anggur dengan tamr (kurma masak)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5148,
			"arabicnumber": "1986.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5149,
			"arabicnumber": "1987.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Yazid bin Zurai'] dari [At Taimi] dari [Abu An Nadlrah] dari [Abu Sa'id], bahwa Nabi shallallahu 'alaihi wasallam melarang mencampurkan antara kurma dengan anggur dan antara tamr (kurma masak) dan busr (kurma muda) untuk dibuat perasan",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5150,
			"arabicnumber": "1987.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu Ulayyah] telah menceritakan kepada kami [Sa'id bin Zaid Abu Maslamah] dari [Abu Nadlrah] dari [Abu Sa'id] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang kami membuat perasan dengan mencampurkan antara anggur dan kurma, antara kurma muda dan kurma masak.\" Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] telah menceritakan kepada kami [Bisyr] -yaitu Ibnu Mufadlal- dari [Abu Maslamah] dengan sanad seperti ini",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5151,
			"arabicnumber": "1987.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5152,
			"arabicnumber": "1987.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5153,
			"arabicnumber": "1987.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5154,
			"arabicnumber": "1988.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu Ulayyah] telah mengabarkan kepada kami [Hisyam Ad Dastawa`i] dari [Yahya bin Abu Katsir] dari [Abdullah bin Abu Qatadah] dari [ayahnya] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian membuat perasan nabidz dengan mencampur antara kurma muda dengan kurma segar (sudah masak), atau antara anggur dengan kurma masak, tetapi hendaklah kalian buat dengan sendiri-sendiri (tidak dengan mencampurnya).\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Bisyr Al 'Abdi] dari [Hajjaj bin Abu 'Utsman] dari [Yahya bin Abu Katsir] dengan sanad seperti ini",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5155,
			"arabicnumber": "1988.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5156,
			"arabicnumber": "1988.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Ali yaitu Ibnu Mubarak] dari [Yahya] dari [Abu Salamah] dari [Abu Qatadah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian membuat perasan kurma muda dengan kurma segar (sudah masak) menjadi satu, atau kurma segar dengan anggur, akan tetapi sendirikanlah setiap perasannya sesuai dengan takarannya masing-masing.\" [Yahya] menyakini bahwa ia pernah bertemu dengan [Abdullah bin Abu Qatadah] kemudian dia menceritakan kepadanya dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini.\" Dan telah menceritakan kepadaku [Abu Bakar bin Ishaq] telah menceritakan kepada kami [Rauh bin Ubadah] telah menceritakan kepada kami [Husain Al Mu'allim] telah menceritakan kepada kami [Yahya bin Abu Katsir] dengan kedua isnad ini, namun dia menyebutkan, \"Antara kurma segar dengan kurma muda, atau kurma masak dengan anggur",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5157,
			"arabicnumber": "1988.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5158,
			"arabicnumber": "1988.05",
			"text": "Dan telah menceritakan kepadaku [Abu Bakar bin Ishaq] telah menceritakan kepada kami ['Affan bin Muslim] telah menceritakan kepada kami [Aban Al 'Athar] telah menceritakan kepada kami [Yahya bin Abu Katisr] telah menceritakan kepadaku [Abdullah bin Abu Qatadah] dari [ayahnya], bahwa Nabi Allah shallallahu 'alaihi wasallam melarang mencampurkan antara kurma masak dengan kurma muda, anggur dengan kurma masak, kurma muda dengan kurma segar (masak). Dan beliau mengatakan: \"Buatlah perasan setiap darinya secara sendiri-sendiri.\" Dan telah menceritakan kepadaku [Abu Salamah bin Abdurrahman] dari [Abu Qatadah] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5159,
			"arabicnumber": "1988.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5160,
			"arabicnumber": "1989.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5161,
			"arabicnumber": "1989.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5162,
			"arabicnumber": "1990.01",
			"text": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [As Syaibani] dari [Habib] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang (membuat perasan) dengan mencampur antara kurma masak dengan anggur, atau kurma muda dengan kurma masak. Kemudian beliau menulis surat kepada penduduk Jurasy melarang mereka mencampur kurma masak dengan anggur menjadi satu.\" Dan telah menceritakan kepadaku [Wahb bin Baqiyah] telah mengabarkan kepada kami [Khalid] -yaitu At Thahan- dari [As Syaibani] dengan sanad ini tentang (mencampur) kurma masak dengan anggur, dan ia tidak menyebutkan 'kurma muda dengan kurma masak",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5163,
			"arabicnumber": "1990.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5164,
			"arabicnumber": "1991.01",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Musa bin Uqbah] dari [Nafi'] dari [Ibnu Umar] bahwa dia berkata, \"Telah dilarang membuat perasan nabidz dengan mencampur antara kurma muda dengan kurma segar, dan kurma masak dengan anggur",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5165,
			"arabicnumber": "1991.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5166,
			"arabicnumber": "1992.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Ibnu Syihab] dari [Anas bin Malik] bahwa dia telah mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang membuat perasan dalam Ad Dubba dan Al Muzaffat",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5167,
			"arabicnumber": "1992.02",
			"text": "Dan telah menceritakan kepadaku ['Amru An Naqid] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam melarang membuat perasan dalam bejana dalam bejana dari Ad Duba dan Al Muzaffat",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5168,
			"arabicnumber": "1993.01",
			"text": "Perawi berkata; (Dan telah menceritakan kepadaku ['Amru An Naqid] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri]) dan telah mengabarkan kepadanya [Abu Salamah] bahwa dia pernah mendengar [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian membuat perasan dalam Ad Dubba dan Al Muzaffat.\" Kemudian Abu Hurairah berkata, \"Dan jauhilah oleh kalian Al Hantam",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5169,
			"arabicnumber": "1993.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5170,
			"arabicnumber": "1993.03",
			"text": "Telah menceritakan kepada kami [Nahsr bin Ali Al Jahdlami] telah mengabarkan kepada kami [Nuh bin Qais] telah menceritakan kepada kami [Ibnu 'Aun] dari [Muhammad] dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada delegasi Abdul Qais: \"Saya telah melarang kalian dari Ad Dubba, Al Hantam, An Naqir, Al Muqayyar, Al Hantam dan guci tempat penyimpanan air yang memabukkan, akan tetapi minumlah dari wadah air minum",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5171,
			"arabicnumber": "1994",
			"text": "Telah menceritakan kepada kami [Sa'id bin 'Amru Al Asy'atsi] telah mengabarkan kepada kami ['Abtsar]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Jarir]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Bisyr bin Khalid] telah mengabarkan kepada kami [Muhammad] -yaitu Ibnu Ja'far- dari [Syu'bah] semuanya dari [Al A'masy] dari [Ibrahim At Taimi] dari [Al Harits bin Suwaid] dari [Ali] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang membuat perasan dalam Ad Dubba dan Al Muzaffat.\" Ini adalah hadits riwayat Jarir, dan dalam hadits 'Abtsar dan Syu'bah disebutkan, bahwa Nabi shallallahu 'alaihi wasallam melarang dari Ad Dubba dan Al Muzaffat",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5172,
			"arabicnumber": "1995.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5173,
			"arabicnumber": "1995.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5174,
			"arabicnumber": "1995.03",
			"text": "Dan telah menceritakan kepada kami [Sa'id bin 'Amru Al Asy'atsi] telah mengabarkan kepada kami ['Abtsar] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah], bahwa Nabi shallallahu 'alaihi wasallam melarang Ad Dubba dan Al Muzaffat.\" Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Yahya yaitu Al Qathan] telah menceritakan kepada kami [Sufyan] dan [Syu'bah] keduanya berkata; telah menceritakan kepada kami [Manshur] dan [Sulaiman] dan [Hammad] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5175,
			"arabicnumber": "1995.04",
			"text": "Telah menceritakan kepada kami [Syaiban bin Farruh] telah menceritakan kepada kami [Al Qasim] -yaitu Ibnu Al Fadll- telah menceritakan kepada kami [Tsumamah bin Hazn Al Qusyairi] dia berkata, \"Saya pernah bertemu ['Aisyah], lalu saya bertanya kepadanya mengenai perasan nabidz. Lantas dia menceritakan kepadaku bahwa suatu ketika utusan Abdul Qais datang kepada Nabi shallallahu 'alaihi wasallam sambil bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai perasan nabidz, maka beliau melarang mereka membuat perasan dalam Ad Dubba, An Naqir, Al Muzaffat dan Al Hantam",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5176,
			"arabicnumber": "1995.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5177,
			"arabicnumber": "1995.06",
			"text": "Dan telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Ibnu Ulayyah] telah menceritakan kepada kami [Ishaq bin Suwaid] dari [Mu'adzah] dari ['Aisyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang Ad Duba, Al Hantam, An Naqir dan Al Muzaffat.\" Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Abdul Wahhab At Tsaqafi] telah menceritakan kepada kami [Ishaq bin Suwaid] dengan isnad ini, hanya saja lafadz Al Muzaffat menjadi Al Muqayyar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5178,
			"arabicnumber": "17.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5179,
			"arabicnumber": "17.05",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [As Syaibani] dari [Habib] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang Ad Dubba, Al Hantam, Al Muzaffat dan An Naqir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5180,
			"arabicnumber": "17.06",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Habib bin Abu 'Amrah] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dari Ad Dubba, Al Hantam, Al Muzaffat dan An Naqir. Beliau juga melarang membuat perasan dengan mencampur antara kurma muda dengan kurma masak",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5181,
			"arabicnumber": "17.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5182,
			"arabicnumber": "1996.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5183,
			"arabicnumber": "1996.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5184,
			"arabicnumber": "1996.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5185,
			"arabicnumber": "1996.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5186,
			"arabicnumber": "1997.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5187,
			"arabicnumber": "1997.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5188,
			"arabicnumber": "1997.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5189,
			"arabicnumber": "1997.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5190,
			"arabicnumber": "1997.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5191,
			"arabicnumber": "1997.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5192,
			"arabicnumber": "1997.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5193,
			"arabicnumber": "1997.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5194,
			"arabicnumber": "1997.09",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5195,
			"arabicnumber": "1997.10",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5196,
			"arabicnumber": "1997.11",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5197,
			"arabicnumber": "1997.12",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5198,
			"arabicnumber": "1997.13",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5199,
			"arabicnumber": "1997.14",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5200,
			"arabicnumber": "1997.15",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5201,
			"arabicnumber": "1997.16",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5202,
			"arabicnumber": "1998.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5203,
			"arabicnumber": "1998.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5205,
			"arabicnumber": "1999.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5206,
			"arabicnumber": "1999.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5209,
			"arabicnumber": "977.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5210,
			"arabicnumber": "2000",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5211,
			"arabicnumber": "2001.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; saya bacakan di hadapan [Malik]; dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] dari ['Aisyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam ditanya mengenai bit'u (yaitu minuman yang terbuat dari madu) maka beliau bersabda: \"Setiap minuman yang memabukkan adalah haram",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5212,
			"arabicnumber": "2001.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5213,
			"arabicnumber": "2001.03",
			"text": "Dan telah menceritakan kepada kami [Harmalah bin Yahya At Tujibi] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] bahwa dia mendengar ['Aisyah] berkata, \"Rasulullah shallallahu 'alaihi wasallam ditanya mengenai bit'u, maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"Setiap minuman yang memabukkan adalah haram.\" Telah menceritakan kepada kami [Yahya bin Yahya] dan [Sa'id bin Manshur] dan [Abu Bakar bin Abi Syaibah] dan [Amru An Naqid] dan [Zuhair bin Harb] semuanya dari [Ibnu 'Uyainah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Hasan Al Khulwani] dan ['Abd bin Humaid] dari [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [Ayahku] dari [Shalih]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Abdu bin Humaid] keduanya berkata; telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] semuanya dari [Az Zuhri] dengan sanad ini, namun dalam hadits Sufyan dan Shalih tidak disebutkan, 'Beliau ditanya mengenai bit'u', akan tetapi hal itu terdapat dalam hadits Ma'mar. Dan dalam hadits Shalih bahwa 'Aisyah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap minuman yang memabukkan adalah haram",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5215,
			"arabicnumber": "1733.06",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abbad] telah menceritakan kepada kami [Sufyan] dari ['Amru] ia mendengar dari [Sa'id bin Abu Burdah] dari [ayahnya] dari [kakeknya], bahwa Nabi shallallahu 'alaihi wasallam mengutusnya bersama Mu'adz ke negeri Yaman, lalu beliau bersabda kepada keduanya: \"Berilah kabar gembira dan mudahkanlah setiap urusannya, ajarilah dan jangan kamu membuatnya lari.\" Dan sepertinya beliau juga bersabda: \"Dan janganlah kalian berdua saling berselisih.\" Ketika Abu Musa kembali, maka dia berkata, \"Wahai Rasulullah, sesungguhnya mereka (penduduk Yaman) terbiasa membuat minuman dari madu yang direbus hingga mengental dan minuman keras yang terbuat dari tepung?\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap sesuatu yang memabukkan (menghalangi dari) shalat, maka hukumnya haram",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5216,
			"arabicnumber": "1733.07",
			"text": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Ahmad bin Abu Khalaf] sedangkan lafadznya dari Ibnu Abu Khalaf, keduanya berkata; telah menceritakan kepada kami [Zakaria bin Adi] telah menceritakan kepada kami [Ubaidullah] dia adalah Ibnu Amru, dari [Zaid bin Abu Unaisah] dari [Sa'id bin Abu Burdah] telah menceritakan kepada kami [Abu Burdah] dari [ayahnya] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku bersama Mu'adz ke negeri Yaman, beliau bersabda: \"Serulah manusia dan berilah kabar gembira, jangan kamu buat mereka lari, mudahkan semua urusan dan jangan kamu persulit.\" Ayahku berkata, \"Lalu saya berkata, \"Wahai Rasulullah, berilah fatwa kepada kami mengenai minuman yang biasa kami buat di negeri Yaman, yaitu Al Bit'u, yang terbuat dari madu dengan merendamnya hingga mengental, dan minuman keras yaitu dari perasan gandum dan tepung.\" Ayahku berkata, \"Saat itu Rasulullah shallallahu 'alaihi wasallam baru selesai mendapatkan ayat Al Qur'an, maka beliau bersabda: \"Saya melarang dari setiap sesuatu yang memabukkan dan dapat menghalangi dari shalat",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5217,
			"arabicnumber": "2002",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Aziz] -yaitu Ad Darawardi- dari ['Ummarah bin Ghaziyah] dari [Abu Az Zubair] dari [Jabir], bahwa seorang laki-laki tiba dari daerah Jaisyan, dan Jaisyan adalah daerah Yaman, lantas dia bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai minuman yang biasa mereka minum di negeri mereka, yang terbuat dari perasan tepung yang biasa disebut Mizr. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah ia memabukkan?\" dia menjawab, \"Ya.\" Rasulullah shallallahu 'alaihi wasallam lantas bersabda: \"Setiap yang memabukkan adalah haram, sesungguhnya Allah menjanjikan kepada siapa saja yang minum minuman memabukkan, maka akan memberinya minuman kepadanya Thinatul Khabal.\" Mereka bertanya, \"Wahai Rasulullah apa itu Thinatul Khabal?\" Beliau menjawab: \"Keringat penghuni neraka. atau perasan -keringat- penghuni neraka",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5218,
			"arabicnumber": "2003.01",
			"text": "Telah menceritakan kepada kami [Abu Ar Rabi' Al 'Ataki] dan [Abu Kamil] keduanya berkata; telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap yang memabukkan adalah khamer, dan setiap yang memabukkan adalah haram. Barangsiapa meminum khamer di dunia -kemudian ia mati- sedangkan ia biasa meminumnya, niscaya tidak akan diterima taubatnya dan tidak akan meminumnya di akhirat",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5219,
			"arabicnumber": "2003.02",
			"text": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Abu Bakar bin Ishaq] keduanya dari [Rauh bin Ubadah] telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap yang memabukkan adalah khamer, dan setiap yang memabukkan adalah haram.\" Dan telah menceritakan kepada kami [Shalih bin Mismar As Sulami] telah menceritakan kepada kami [Ma'an] telah menceritakan kepada kami [Abdul Aziz bin Mutthalib] dari [Musa bin 'Uqbah] dengan isnad yang seperti ini",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5220,
			"arabicnumber": "2003.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5221,
			"arabicnumber": "2003.04",
			"text": "Telah menceritakan kepada kami [Muhammad bin Mutsanna] dan [Muhammad bin Hatim] keduanya berkata; telah menceritakan kepada kami [Yahya] -yaitu Al Qatthan- dari [Ubaidullah] telah mengabarkan kepada kami [Nafi'] dari [Ibnu Umar] dia berkata -dan saya tidak mengetahuinya kecuali dari Nabi shallallahu 'alaihi wasallam-, beliau bersabda: \"Setiap yang memabukkan adalah khamer dan setiap khamer adalah haram",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 5222,
			"arabicnumber": "2003.05",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; saya bacakan di hadapan [Malik]; dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meminum khamer di dunia, maka diharamkan baginya di akhirat",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 5223,
			"arabicnumber": "2003.06",
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Barangsiapa meminum khamer di dunia dan tidak bertaubat, maka diharamkan baginya di akhirat kelak dan tidak akan diberi minum dengannya.\" Dikatakan kepada Malik, \"Apakah (riwayat ini) dimarfu'kan (bersambung sampai kepada Nabi shallallahu 'alaihi wasallam)?\" dia menjawab, \"Ya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 5224,
			"arabicnumber": "2003.07",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Ubaidullah] dari [Nafi'] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meminum khamer di dunia, maka ia tidak akan meminumnya di akhirat kecuali jika ia bertaubat.\" Dan telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Hisyam] -yaitu Ibnu Sulaiman Al Mahzumi- dari [Ibnu Juraij] telah mengabarkan kepadaku [Musa bin Uqbah] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti hadits Ubaidullah",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 5225,
			"arabicnumber": "2003.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 5226,
			"arabicnumber": "2004.01",
			"text": "Telah menceritakan kepada kami [Ubaidullah bin Mu'adz Al Anbari] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Yahya bin Ubaid Abu Umar Al Bahrani] dia berkata; saya mendengar [Ibnu Abbas] berkata, \"Rasulullah shallallahu 'alaihi wasallam dibuatkan perasan nabidz di awal malam, kemudian beliau meminumnya di pagi harinya, kemudian malam harinya, kemudian lusa dan malam harinya serta keesokan harinya lagi sampai menjelang ashar. Jika perasannya tersebut masih, beliau memerintahkan pelayannya untuk menumpahkannya, atau menyuruhnya untuk ditumpahkan",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 5227,
			"arabicnumber": "2004.02",
			"text": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Yahya Al Bahrani] dia berkata, \"Mereka menyebut-nyebut nabidz (perasan buah) di sisi [Ibnu Abbas], lantas dia berkata, \"Rasulullah shallallahu 'alaihi wasallam biasa dibuatkan perasan dalam wadah air minum -Syu'bah berkata; dari malam senin-, kemudian beliau meminumnya pada hari senin dan selasa sampai ashar, jika masih terdapat perasan yang tersisa, maka beliau menyuruh pelayannya untuk menumpahkan",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 5228,
			"arabicnumber": "2004.03",
			"text": "Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Abu Kuraib] dan [Ishaq bin Ibrahim] sedangkan lafadz dari Abu Bakar dan Abu Kuraib. Ishaq berkata; telah mengabarkan kepada kami, sedangkan yang kedua berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Umar] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam biasa dibuatkan perasan zabib (buah kismis), kemudian beliau meminumnya pada hari itu, esok hari dan lusa sampai sore di hari ketiga. Kemudian beliau menyuruh untuk membuangnya atau menumpahkannya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 5229,
			"arabicnumber": "2004.04",
			"text": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Jarir] dari [Al A'masy] dari [Yahya bin Abi Umar] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam biasa dibuatkan perasan zabib dalam wadah air minum, kemudian beliau meminumnya pada hari itu, esok harinya dan lusa, pada waktu sore di hari ketiga beliau masih menuangkan dan meminumnya, tapi jika masih juga tersisa maka beliau menumpahkannya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 5230,
			"arabicnumber": "2004.05",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Ahmad bin Abi Khalaf] telah menceritakan kepada kami [Zakaria bin Adi] telah menceritakan kepada kami ['Ubaidullah] dari [Zaid] dari [Yahya Abu Umar An Nakha'i] dia berkata, \"Suatu kaum bertanya kepada [Ibnu Abbas] tentang memperdagangkan khamer; membeli dan menjualnya lagi. Maka dia balik bertanya, \"Apakah kalian orang-orang muslim?\" Mereka menjawab, \"Ya, benar.\" Dia berkata, \"Sesungguhnya tidak boleh memperdagangkan khamer; membelinya dan menjualnya.\" Yahya berkata, \"Kemudian mereka bertanya mengenai Nabidz (minuman yang terbuat dari perasan buah), maka Ibnu Abbas berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah keluar kota kemudian beliau kembali pulang, ternyata sebagian dari para sahabat beliau sedang membuat perasan di dalam Al Khantam, An Naqir dan Ad Dubba`, maka beliau menyuruh untuk menumpahkannya. Setelah itu, beliau membuat perasan dari buah anggur dan air, lalu membiarkannya hingga malam. Keesokan harinya beliau meminum perasan tersebut, lalu malam harinya, lalu keesokan harinya lagi dan lusa hingga waktu sampai sore. Dan apabila di pagi harinya perasan tersebut masih tersisa, maka beliau memerintahkan untuk menumpahkannya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 5231,
			"arabicnumber": "2005.01",
			"text": "Telah menceritakan kepada kami [Syaiban bin Farruh] telah menceritakan kepada kami [Al Qasim] -yaitu Ibnu Fadl Al Huddani- telah menceritakan kepada kami [Tsumamah] -yaitu Ibnu Hazn Al Qusyairi- dia berkata; saya menemui ['Aisyah] dan menanyakan kepadanya mengenai nabidz, lantas 'Aisyah memanggil pelayannya dari negeri Habsyi. 'Aisyah lantas berkata, \"Tanyakanlah kepadanya, karena dialah yang biasa membuatkan perasan untuk Rasulullah shallallahu 'alaihi wasallam, lantas [pelayan dari negeri Habsyi] itu menjawab, \"Saya biasa membuatkan perasan untuk beliau dalam wadah air minum, kemudian saya mengikatnya dan menggantungkannya, lalu beliau meminumnya ketika datang waktu pagi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 5232,
			"arabicnumber": "2005.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Mutsanna Al Anazi] telah menceritakan kepada kami [Abdul Wahhab Ats Tsaqafi] dari [Yunus] dari [Al Hasan] dari [Ibunya] dari ['Aisyah] dia berkata, \"Kami biasa membuat perasan untuk Rasulullah shallallahu 'alaihi wasallam di dalam air minum yang bertali di atasnya, kami membuat rendaman di pagi hari dan meminumnya di sore hari, atau membuat rendaman di sore hari lalu meminumnya di pagi hari",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 5233,
			"arabicnumber": "2006.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Aziz] -yaitu Ibnu Abu Hazim- dari [Abu Hazim] dari [Sahal bin Sa'd] dia berkata, \"Abu Usaid As Sa'idi mengundang Rasulullah shallallahu 'alaihi wasallam di hari pernikahannya, Saat itu, isterinya membantu mereka, padahal ia adalah pengantin wanita.\" Sahl bertkata, \"Tahukah kalian minuman apa yang ia suguhkan olehnya (isterinya) kepada Rasulullah shallallahu 'alaihi wasallam?\" ia merendam kurma di dalam kuwali pada waktu malam, ketika beliau makan, ia memberikan minuman tersebut kepada beliau.\" Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ya'qub] -yaitu Ibnu Abdurrahman- dari [Abu Hazim] dia berkata; saya mendengar [Sahl] berkata, \"Abu Usaid As Sa'idi datang kepada Rasulullah shallallahu 'alaihi wasallam, lalu ia mengundang Rasulullah shallallahu 'alaihi wasallam…seperti hadits di atas, namun ia tidak menyebutkan, \"Ketika beliau makan, maka wanita itu menuangkannya kepada beliau.\" Dan telah menceritakan kepadaku [Muhammad bin Sahl At Tamimi] telah menceritakan kepada kami [Ibnu Abu Maryam] telah mengabarkan kepada kami [Muhammad] -yaitu Abu Ghassan- telah menceritakan kepadaku [Abu Hazim] dari [Sahl bin Sa'd] dengan hadits ini, ia menambahkan, \"…menuangkannya di kuwali yang terbuat dari tanah, seusai Rasulullah shallallahu 'alaihi wasallam makan, maka ia menuangkan minuman tersebut untuk beliau",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 5234,
			"arabicnumber": "2006.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 5235,
			"arabicnumber": "2006.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 5236,
			"arabicnumber": "2007",
			"text": "Telah menceritakan kepadaku [Muhammad bin Sahl At Tamimi] dan [Abu Bakar bin Ishaq], Abu Bakar berkata; telah mengabarkan kepada kami, sedangkan Ibnu Sahl berkata; telah menceritakan kepada kami [Ibnu Abu Maryam] telah mengabarkan kepada kami [Muhammad] -yaitu Ibnu Mutharif Abu Ghassan- telah mengabarkan kepadaku [Abu Hazim] dari [Sahl bin Sa'd] dia berkata, \"Ketika dituturkan kepada Rasulullah shallallahu 'alaihi wasallam tentang cerita wanita Arab kampung, maka beliau pun memerintahkan Abu Usaid untuk memanggilnya. Tidak lama kemudian wanita itu datang dan tinggal di rumah Bani Sa'idah. Kemudian Rasulullah shallallahu 'alaihi wasallam keluar dan pergi menemui wanita tersebut, ternyata wanita itu selalu menundukkan kepalanya. Pada saat Rasulullah shallallahu 'alaihi wasallam mengajaknya bicara, wanita itu justru berkata, \"Saya berlindung kepada Allah darimu.\" Beliau menjawab: \"Baiklah, saya juga melindungimu dariku.\" Setelah itu para sahabat berkata kepadanya, \"Tahukah kamu siapakah orang yang mengajakmu bicara tadi?\" wanita itu menjawab, \"Tidak.\" Para sahabat berkata, \"Orang itu adalah Rasulullah shallallahu 'alaihi wasallam, beliau datang untuk melamarmu.\" Wanita itu berkata, \"Kalau begitu, saya termasuk orang yang tidak beruntung.\" Sahl berkata, \"Pada saat itu Rasulullah shallallahu 'alaihi wasallam datang dan duduk di bangsal Bani Sa'idah bersama dengan para sahabat. Kemudian beliau bersabda kepada Sahl: \"Berilah kami minuman.\" Sahl berkata, \"Lalu saya mengeluarkan mangkuk ini untuk mereka dan memberikan minuman kepada mereka dengan menggunakan mangkuk tersebut.\" Abu Hazim berkata, \"Kemudian Sahl mengeluarkan mangkuk tersebut untuk kami dan kami langsung meminumnya.\" Abu Hazim berkata, \"Selang beberapa tahun kemudian, Umar bin Abdul Aziz meminta mangkuk itu. Lalu mangkuk itu pun akhirnya diberikan kepadanya.\" Dan dalam riwayat Abu Bakar bin Ishaq disebutkan, \"Beliau bersabda: \"Hidangkanlah minuman buat kami wahai Sahl",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 5237,
			"arabicnumber": "2008",
			"text": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] keduanya berkata; telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Anas] dia berkata, \"Sungguh saya pernah menuangkan minuman apa saja ke dalam gelasku (mangkuk) untuk Rasulullah shallallahu 'alaihi wasallam; madu, perasan nabidz (semacam arak), air dan susu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 5238,
			"arabicnumber": "2009.01",
			"text": "Telah menceritakan kepada kami ['Ubaidullah bin Mu'adz Al 'Anbari] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Al Barra`] dia berkata, \" [Abu Bakar As Shidiq] berkata, \"Ketika kami keluar bersama-sama dengan Nabi shallallahu 'alaihi wasallam dari Makkah menuju Madinah, kami melewati seorang penggembala, ketika itu Rasulullah shallallahu 'alaihi wasallam sangat kehausan.\" Abu Bakar berkata, \"Lalu saya memeraskan untuk beliau sedikit dari air susu (kambing milik pengembala), kemudian saya membawanya ke hadapan beliau lalu beliau meminumnya sampai saya merasa puas",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 5239,
			"arabicnumber": "2009.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] sedangkan lafadznya dari Ibnu Mutsanna, keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dia berkata; saya mendengar [Abu Ishaq Al Hamdani] dia berkata; saya mendengar [Al Barra`] berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam berangkat dari kota Makkah menuju Madinah, Suraqah bin Malik bin Ju'syum mengejarnya dari belakang.\" Al Barra` mengatakan, \"Lalu Rasulullah shallallahu 'alaihi wasallam mendoakannya hingga kaki kudanya terperosok ke dalam tanah, Suraqah lalu berkata, \"Mohonkanlah kepada Allah agar saya dapat terlepas dari kecelakaan ini dan saya tidak akan mengganggu anda lagi.\" Al Barra` berkata, \"Lantas beliau berdo'a kepada Allah.\" Al Barra` melanjutkan ceritanya, \"Tidak lama kemudian Rasulullah shallallahu 'alaihi wasallam merasa kehausan dan kebetulan beliau melewati seorang penggembala kambing. Maka [Abu Bakar] berkata, \"Kemudian saya mengambil mangkuk dan memerah sedikit susu untuk Rasulullah shallallahu 'alaihi wasallam, lalu saya membawanya kepada beliau dan beliau pun meminumnya hingga saya merasa puas",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 5240,
			"arabicnumber": "168.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abbas] dan [Zuhair bin Harb] dan lafazh ini milik Ibnu 'Abbas mereka berkata; Telah menceritakan kepada kami [Abu Shafwan]; Telah mengabarkan kepada kami [Yunus] dari [Zuhri] ia berkata; [Ibnu Musayyab] berkata; [Abu Hurairah] berkata; bahwa Nabi shallallahu 'alaihi wasallam pernah diberikan dua cangkir yang berisi khamer dan susu di Iliya pada malam Isra. Beliau kemudian mengambil susu. Setelah itu Jibril berkata; 'Segala puji bagi Allah yang telah menunjukimu kepada kesucian. Seandainya engkau mengambil khamer, niscaya umatmu akan sesat.' Dan telah menceritakan kepadaku [Salamah bin Syabib] telah menceritakan kepada kami [Al Hasan bin A'Yan] telah menceritakan kepada kami [Ma'qil] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] bahwa dia mendengar [Abu Hurairah] berkata; -dengan Hadits yang serupa, namun tidak menyebutkan di Iliya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 5241,
			"arabicnumber": "168.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 5242,
			"arabicnumber": "2010.01",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Al Mutsanna] dan ['Abdu bin Humaid], semuanya Dari [Abu 'Ashim], [Ibnu Al Mutsanna] berkata; Telah menceritakan kepada kami [Adh Dhahak] telah mengabarkan kepada kami [Ibnu Juraij]; Telah mengabarkan kepadaku [Abu Zubair]; Bahwa dia mendengar [Jabir bin 'Abdullah] berkata; Telah mengabarkan kepada kami [Abu Humaid As Sa'idi] ia berkata; Aku pernah mengunjungi Nabi shallallahu 'alaihi wasallam dengan membawa cangkir susu yang berisi minuman dari anggur dalam keadaan tidak tertutup, lalu beliau bersabda: \"Tidakkah engkau menutupinya walaupun hanya dengan melintangkan sepotong kayu?.\" Abu Hamid berkata; 'Minuman-minuman diperintahkan untuk diikat di waktu malam (ditutup) dan pintu-pintu ditutup. Dan telah menceritakan kepadaku [Ibrahim bin Dinar], telah menceritakan kepada kami [Rauh bin Ubadah], telah menceritakan kepada kami [Ibnu Juraij] dan [Zakaria bin Ishaq] mereka berkata; Telah mengabarkan kepada kami [Abu Zubair] bahwa dia mendengar [Jabir bin Abdullah] berkata; 'Telah mengabarkan kepadaku [Abu Humaid As Saidi], bahwa dia mendatangi Nabi shallallahu 'alaihi wasallam dengan cangkir susu -dengan Hadits yang serupa- dia berkata; Zakaria tidak menyebutkan perkataan Abu Humaid mengenai di malam hari",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 5243,
			"arabicnumber": "2010.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 5244,
			"arabicnumber": "2011.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] dan lafazh ini milik Abu Kuraib, keduanya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Jabir bin Abdullah] dia berkata; ketika kami bersama Nabi shallallahu 'alaihi wasallam tiba-tiba beliau meminta air. Lalu ada seorang laki-laki berkata; 'Maukah aku beri nabidz (minuman yang biasa terbuat dari kurma atau anggur)? Beliau menjawab: \"Ya.\" (Jabir bin Abdullah) berkata; maka laki-laki itu mencari keluar, lalu dia datang dengan membawa bejana yang berisi nabidz. Nabi shallallahu 'alaihi wasallam bersabda: \"Tidakkah engkau menutupinya? Walaupun hanya dengan membentangkan sepotong kayu.\" (Jabir bin Abdullah) berkata; kemudian (Rasulullah shallallahu 'alaihi wasallam) minum",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 5245,
			"arabicnumber": "2011.02",
			"text": "Telah menceritakan kepada kami ['Utsman bin Abu Syaibah]; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Sufyan] dan [Abu Shalih] dari [Jabir] ia berkata; seorang laki-laki yang biasa disebut Abu Humaid datang dengan membawa cangkir yang berisi susu yang sudah didinginkan, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidakkah engkau menutupinya? Walaupun hanya dengan sepotong kayu?",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 5246,
			"arabicnumber": "2012.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Laits]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepada kami [Muhammad bin Rumh]; Telah mengabarkan kepada kami [Al Laits] dari [Abu Zubair] dari [Jabir] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Tutuplah oleh kalian bejana-bejana, rapatkanlah tempat-tempat minuman, tutuplah pintu-pintu, dan matikanlah lampu, karena setan tidak dapat membuka ikatan tempat minum, pintu, dan bejana. Jika kalian tidak mendapatkan penutupnya kecuali dengan membentangkan sepotong kayu di atas bejananya dan menyebut nama Allah, maka lakukanlah. Karena tikus dapat merusak pemilik rumah dengan membakar rumahnya.\" Tapi Qutaibah dalam Haditsnya tidak menyebutkan; \"dan tutuplah pintu-pintu\". Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku membaca kitab [Malik] mengenai Hadits ini dari [Abu Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, namun dia menyebutkan; \"Dan tutupalah rapat-rapat atau tutuplah bejana-bejana.\" Dia tidak menyebutkan merentangkan kayu di atas bejana. Dan telah mengabarkan kepada kami [Ahmad bin Yunus], telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami [Abu Zubair] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tutuplah pintu-pintu, \" dan kemudian dia menyebutkan yang serupa dengan Hadist Laits, namun dia menyebutkan; \"Tutuplah bejana, \" dan berkata; \"Sesungguhnya tikus dapat merusak pemilik rumah dengan membakar pakaiannya.\" Dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna], telah menceritakan kepada kami [Abdurrahman], telah menceritakan kepada kami [Sufyan] dari [Abu Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa, dan dia berkata; 'Tikus dapat merusak pemilik rumah dengan membakar rumahnya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 5247,
			"arabicnumber": "2012.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 5248,
			"arabicnumber": "2012.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 5249,
			"arabicnumber": "2012.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 5250,
			"arabicnumber": "2012.05",
			"text": "Telah menceritakan kepadaku [Ishaq bin Manshur]; Telah mengabarkan kepada kami [Rauh bin 'Ubadah]; Telah menceritakan kepada kami [Ibnu Juraij]; Telah mengabarkan kepadaku ['Atha]; bahwa dia mendengar [Jabir bin 'Abdullah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bila hari telah senja laranglah anak-anak keluar rumah, karena ketika itu setan berkeliaran. Dan bila waktu malam tiba biarkanlah mereka. Kuncilah pintu dan sebut nama Allah, karena setan tidak dapat membuka pintu yang terkunci (dengan menyebut nama Allah). Tutup semua bejanamu dengan menyebut nama Allah, sekalipun dengan membentangkan sesuatu di atasnya, dan padamkan lampu (ketika hendak tidur).\" Telah menceritakan kepadaku [Ishaq bin Manshur]; Telah mengabarkan kepada kami [Rauh bin 'Ubadah]; Telah menceritakan kepada kami [Ibnu Juraij]; Telah mengabarkan kepadaku ['Amru bin Dinar]; dia mendengar [Jabir bin Abdullah] berkata sebagimana yang telah dikabarkan oleh 'Atha, hanya saja dia tidak menyebutkan kalimat 'Sebutlah nama Allah Azza Wa Jalla'. Dan telah menceritakan kepada kami [Ahmad bin 'Utsman An Naufali]; Telah menceritakan kepada kami [Abu 'Ashim]; Telah mengabarkan kepada kami [Ibnu Juraij] dengan Hadits ini. Dari ['Atha] dan ['Amru bin Dinar] sebagaimana riwayat Rauh",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 5251,
			"arabicnumber": "2012.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 5252,
			"arabicnumber": "2012.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 5253,
			"arabicnumber": "2013.01",
			"text": "Telah menceritakan kepada kami [Ahmad bin Yunus]; Telah menceritakan kepada kami [Zuhair]; Telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Abu Khaitsamah] dari [Abu Az Zubair] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jangan biarkan ternak dan anak-anakmu lepas berkeliaran ketika matahari terbenam sampai hilangnya cahaya senja. Karena setan keluar ketika matahari terbenam sampai hilang cahaya senja.\" Dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami ['Abdurrahman]; Telah menceritakan kepada kami [Sufyan] dari [Abu Az Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 5254,
			"arabicnumber": "2013.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 5255,
			"arabicnumber": "2014.01",
			"text": "Telah menceritakan kepada kami ['Amru An Naqid]; Telah menceritakan kepada kami [Hasyim bin Al Qasim]; Telah menceritakan kepada kami [Al Laits bin Sa'd]; Telah menceritakan kepadaku [Yazid bin 'Abdullah bin Usamah bin Al Hadi Al Laitsi] dari [Yahya bin Sa'id] dari [Ja'far bin 'Abdullah bin Al Hakam] dari [Al Qa'qa' bin Hakim] dari [Jabir bin 'Abdullah] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tutuplah bejana-bejana, dan ikatlah tempat-tempat minuman, karena di suatu malam pada setiap tahunnya akan ada wabah penyakit (berbahaya) yang akan jatuh ke dalam bejana dan ketempat-tempat air yang tidak tertutup.\" Dan telah menceritakan kepada kami [Nashr bin 'Ali Al Jahdlami]; Telah menceritakan kepadaku [Bapakku]; Telah menceritakan kepada kami [Laits bin Sa'd] dengan Hadits dan sanad yang serupa, hanya saja dia berkata dengan kalimat 'Karena di suatu hari pada setiap tahunnya akan ada wabah penyakit'. Dia juga menambahkan pada akhir Haditsnya; Al laits berkata; 'Orang-orang 'Ajam (selain orang arab) diantara kami merasa takut pada hal itu sejak bulan pertama",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 5256,
			"arabicnumber": "2014.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 5257,
			"arabicnumber": "2015",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan ['Amru An Naqid] dan [Zuhair bin Harb] mereka berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhair] dari [Salim] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Ketika kalian tidur di rumah, janganlah kalian meninggalkan api dalam keadaan menyala",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 5258,
			"arabicnumber": "2016",
			"text": "Telah menceritakan kepada kami [Sa'id bin 'Amru Al Asy'atsi] dan [Abu Bakr bin Syaibah] dan [Muhammad bin 'Abdullah bin Numair] dan [Abu 'Amir Al Asy'ari] dan [Abu Kuraib] dan lafazh ini milik Abu 'Amir, berkata; Telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] ia berkata; Pada suatu malam sebuah rumah penduduk Madinah terbakar. Ketika hal itu di ceritakan kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya api ini adalah musuh kalian, karena itu apabila kalian hendak tidur, maka padamkanlah lebih dahulu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 5259,
			"arabicnumber": "2017.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Khaitsamah] dari [Abu Hudzaifah] dari [Hudzaifah] dia berkata; Bila kami menghadiri jamuan makan bersama Rasulullah Shallallahu 'alaihi Wa Salam, kami tidak meletakkan tangan kami hingga beliau memulai meletakkan tangan beliau. ketika kami menghadiri jamuan makan bersama beliau, tiba-tiba datang seorang budak perempuan yang ingin meletakkan tangannya pada makanan itu, Rasulullah Shallallahu 'alaihi Wa Salam meraih tangannya (menyingkirkannya), kemudian seorang badui datang yang ingin meletakkan tangannya diatas makanan itu, Rasulullah Shallallahu 'Alaihi Wa Salam pun meraih tangannya. Beliau lalu bersabda: \"Sesungguhnya Setan akan mendapatkan makanan yang tidak disebut nama Allah dan ia datang bersama anak perempuan ini untuk mendapatkannya, lalu aku meraih tangannya, ia juga datang bersama orang badui ini untuk mendapatkannya lalu aku meraih tangannya. Demi Dzat Yang jiwaku berada ditanganNya, Sesungguhnya tangan setan itu berada di tanganku seperti ia ada di dalam tangan keduanya (orang badui dan budak perempuan).\" Dan telah menceritakan pula kepada kami [Ishaq bin Ibrahim Al Hanzhali], telah mengabarkan kepada kami [Isa bin Yunus], telah mengabarkan kepada kami [Al 'Amasy] dari [Khaitsamah bin Abdurrahman] dari [Abu Hudzaifah Al Arhabi] dari [Khudzaifah bin Al Yaman] dia berkata; Bila kami diundang untuk menghadiri jamuan makan bersama Rasulullah Shallallahu 'alaihi Wa Salam, - lalu dia menyebutkan Hadits yang semakna dengan Hadits Abu Mu'awiyah, dan dia berkata; dengan lafazh; 'Ka annama Yuthradu', sedangkan pada budak perempuan dengan lafazh 'Ka annama tuthradu'. Dalam Haditsnya dia mendahulukan kedatangan orang badui daripada budak perempuan. Dan di akhir Haditsnya dia menambahkan; 'Beliau menyebut nama Allah lalu makan.' Dan telah menceritakan kepadaku pula [Abu Bakr bin Nafi'], telah menceritakan kepada kami [Abdurrahman], telah menceritakan kepada kami [Sufyan] dari [Al A'Masy] dengan sanad ini. Dan dia mendahulukan datangnya budak perempuan dari pada orang badui",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 5260,
			"arabicnumber": "2017.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 5261,
			"arabicnumber": "2017.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 5262,
			"arabicnumber": "2018.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna Al 'Anazi]; Telah menceritakan kepada kami [Adl Dlahak] yaitu Abu Ashim, dari [Ibnu Juraij]; Telah mengabarkan kepadaku [Abu Zubair] dari [Jabir bin 'Abdullah]; Sesungguhnya dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seseorang menyebut nama Allah ketika hendak masuk rumahnya dan ketika hendak makan, maka setan berkata; 'Kalian (bangsa setan) tidak bisa menginap dan tidak bisa makan! ' Jika seseorang tidak menyebut nama Allah ketika hendak masuk rumahnya, maka setan berkata; 'Kalian bisa masuk dan bisa menginap.' Jika seseorang tidak menyebut nama Allah sewaktu hendak makan, maka setan berkata; 'Kalian bisa menginap dan makan malam",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 5263,
			"arabicnumber": "2018.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 5264,
			"arabicnumber": "2019",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Laits]; Demikian juga telah diriwayatkan dari jalur yang lain; dan telah menceritakan kepada kami [Muhammad bin Rumh]; Telah mengabarkan kepada kami [Al Laits] dari [Abu Zubair] dari [Jabir] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian makan dengan tangan kiri, karena setan makan dengan tangan kiri",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 5265,
			"arabicnumber": "2020.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Muhammad bin 'Abdullah bin Numair] dan [Zuhair bin Harb] dan [Ibnu Abu 'Umar]; Dan lafazh ini milik Ibnu Numair, ia berkata; Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Bakr bin 'Ubaidullah bin 'Abdullah bin 'Umar] dari kakeknya [Ibnu 'Umar]; bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seseorang diantara kalian makan, maka hendaknya dia makan dengan tangan kanannya. Jika minum maka hendaknya juga minum dengan tangan kanannya, karena setan makan dengan tangan kirinya dan minum dengan tangan kirinya pula.\" Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] yang dia bacakan kepadanya. Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami [Ibnu Numair], telah menceritakan kepada kami [bapakku]. Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami [Ibnu Al Mutsanna], telah menceritakan kepada kami [Yahya] yaitu Al Qaththan, keduanya dari [Ubaidullah], dari [Az Zuhri], dengan sanad Sufyan",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 5266,
			"arabicnumber": "2020.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 5267,
			"arabicnumber": "2020.03",
			"text": "Telah menceritakan kepadaku [Abu Ath Thahir] dan [Harmalah], Abu Ath Thahir berkata; telah mengabarkan kepada kami; sedangkan Harmalah berkata; Telah menceritakan kepada kami ['Abdullah bin Wahb]; Telah menceritakan kepadaku ['Umar bin Muhammad]; Telah menceritakan kepadaku [Al Qasim bin 'Ubaidullah bin 'Abdillah bin 'Umar]; Telah menceritakan kepadanya [Salim] dari [Bapaknya], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah sekali-kali seseorang diantara kalian makan dan minum dengan tangan kiri, karena setan makan dengan tangan kiri dan minum dengan tangan kiri pula. Perawi berkata; di dalam Hadits tersebut [Nafi'] menambahkan; 'Dan jangan pula mengambil dan memberi dengan tangan kiri.' Di dalam riwayat Abu At Thahir disebutkan, 'Janganlah sekali-kali seseorang di antara kalian…",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 5268,
			"arabicnumber": "2021",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Zaid bin Al Hubab] dari ['Ikrimah bin 'Ammar]; Telah menceritakan kepadaku [Iyas bin Salamah bin Al Akwa']; [Bapaknya] telah menceritakan kepadanya, bahwa seorang laki-laki makan di samping Rasulullah shallallahu 'alaihi wasallam dengan tangan kirinya, Lalu Rasulullah bersabda: \"Makanlah dengan tangan kananmu! Dia menjawab; 'Aku tidak bisa.' Beliau bersabda: \"Apakah kamu tidak bisa?\" -dia menolaknya karena sombong-. Setelah itu tangannya tidak bisa sampai ke mulutnya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 5269,
			"arabicnumber": "2022.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ibnu Abu 'Umar] -semuanya- dari [Sufyan]; Abu Bakr berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Al Walid bin Katsir] dari [Wahb bin Kaisan] yang dia dengar dari ['Umar bin Abu Salamah] ia berkata; Dulu aku berada di pangkuan Rasulullah shallallahu 'alaihi wasallam, lantas tanganku memegang piring, maka beliau bersabda kepadaku: \"Wahai anak, sebutlah nama Allah, dan makanlah dengan tangan kananmu, serta makanlah yang ada di hadapanmu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 5270,
			"arabicnumber": "2022.02",
			"text": "Telah menceritakan kepada kami [Al Hasan bin 'Ali Al Hulwani] dan [Abu Bakr bin Ishaq] mereka berkata; Telah menceritakan kepada kami [Ibnu Abu Maryam]; Telah mengabarkan kepada kami [Muhammad bin Ja'far]; Telah mengabarkan kepadaku [Muhammad bin 'Amru bin Halhalah] dari [Wahb bin Kaisan] dari ['Umar bin Abu Salamah], bahwa dia berkata; \"Pada suatu hari aku makan bersama Rasulullah shallallahu 'alaihi wasallam, lalu aku mengambil daging di sekitar piring-piring hidangan, maka Rasulullah shallallahu 'alaihi wasallam bersabda: 'Makanlah yang ada di hadapanmu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 5271,
			"arabicnumber": "2023.01",
			"text": "Telah menceritakan kepada kami ['Amru An Naqid]; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Ubaidillah] dari [Abu Sa'id] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang membengkokkan mulut tempat air",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 5272,
			"arabicnumber": "2023.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 5273,
			"arabicnumber": "2023.03",
			"text": "Telah menceritakan kepadaku [Harmalah bin Yahya]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari ['Ubaidillah bin 'Ubaidillah bin 'Utbah] dari [Abu Sa'id Al Khudri] dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang membengkokkan mulut tempat air agar dapat diminum.\" Dan telah menceritakan pula kepada kami [Abdu bin Humaid], telah mengabarkan kepada kami [Abdurrazaq], telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dengan sanad ini yang serupa dengannya. Namun dia menambahkan; 'Ikhtinatsuha adalah membalikkan mulut tempat air kemudian meminum darinya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 5274,
			"arabicnumber": "2024.01",
			"text": "Telah menceritakan kepada kami [Haddab bin Khalid]; Telah menceritakan kepada kami [Hammam]; Telah menceritakan kepada kami [Qatadah] dari [Anas] bahwa Nabi Shallallahu A'laihi Wa Sallam melarang minum sambil berdiri",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 5275,
			"arabicnumber": "2024.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami [Abdul A'la]; Telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau melarang seseorang minum sambil berdiri. Qatadah berkata; 'Maka kami tanyakan, bagaimana dengan makan? ' Anas menjawab: 'Apalagi makan, itu lebih buruk, atau lebih jelek.' Dan telah mengabarkannya pula [Qutaibah bin Sa'id] dan [Abu Bakr bin Abu Syaibah] keduanya berkata; Telah menceritakan kepada kami [Waki'] dari [Hisyam] dari [Qatadah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, dengan Hadits yang serupa, namun dia tidak menyebutkan ucapan Qatadah",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 5276,
			"arabicnumber": "2024.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 5277,
			"arabicnumber": "2025.01",
			"text": "Telah menceritakan kepada kami [Haddab bin Khalid]; Telah menceritakan kepada kami [Hammam]; Telah menceritakan kepada kami [Qatadah] dari [Abu 'Isa Al Uswari] dari [Abu Sa'id Al Khudri] bahwa Nabi shallallahu 'alaihi wasallam melarang minum sambil berdiri",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 5278,
			"arabicnumber": "2025.02",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Al Mutsanna] dan [Ibnu Basyar]; Dan lafazh ini milik [Zuhair] dan [Ibnu Al Mutsanna], mereka berkata; Telah menceritakan kepada kami [Yahya bin Sa'id]; Telah menceritakan kepada kami [Syu'bah]; Telah menceritakan kepada kami [Qatadah] dari [Abu 'Isa Al Uswari] dari [Abu Sa'id Al Khudri]; Bahwa Rasulullah shallallahu 'alaihi wasallam minum sambil berdiri",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 5279,
			"arabicnumber": "2026",
			"text": "Telah menceritakan kepadaku ['Abdul Jabbar bin Al 'Alaa`]; Telah menceritakan kepada kami [Marwan] yaitu Al Fazari; Telah menceritakan kepada kami ['Umar bin Hamzah]; Telah mengabarkan kepadaku [Abu Ghathafan Al Murri] bahwa dia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah sekali-kali salah seorang diantara kalian minum sambil berdiri, apabila dia lupa maka muntahkanlah",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 5280,
			"arabicnumber": "2027.01",
			"text": "Telah menceritakan kepada kami [Abu Kamil Al Jahdari]; Telah menceritakan kepada kami [Abu 'Awanah] dari [Ashim] dari [Asy Sya'bi] dari [Ibnu 'Abbas] ia berkata; \"Aku memberi minum dari Air Zam-zam kepada Rasulullah, lalu beliau minum sambil berdiri",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 5281,
			"arabicnumber": "2027.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Numair]; Telah menceritakan kepada kami [Sufyan] dari ['Ashim] dari [Asy Sya'bi] dari [Ibnu 'Abbas] bahwa Nabi shallallahu 'alaihi wasallam minum air Zam-Zam dari gayungnya sambil berdiri",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 5282,
			"arabicnumber": "2027.03",
			"text": "Telah menceritakan kepada kami [Suraij bin Yunus]; Telah menceritakan kepada kami [Husyaim]; Telah mengabarkan kepada kami ['Ashim Al Ahwal]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepadaku [Ya'qub Ad Dauraqi] dan [Isma'il bin Salim], Isma'il berkata; Telah mengabarkan kepada kami, sedangkan Ya'qub berkata; Telah menceritakan kepada kami [Husyaim]; Telah menceritakan kepada kami ['Ashim Al Ahwal] dan [Mughirah] dari [Asy Sya'biy] dari [Ibnu 'Abbas]; Bahwa Rasulullah shallallahu 'alaihi wasallam minum dari air zam-zam sambil berdiri",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 5283,
			"arabicnumber": "2027.04",
			"text": "Telah menceritakan kepadaku ['Ubaidullah bin Mu'adz]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Syu'bah] dari ['Ashim]; dia mendengar dari [Asy Sya'bi]; dia mendengar [Ibnu 'Abbas] berkata; Aku memberi minum Rasulullah shallallahu 'alaihi wasallam dari air zam-zam, lalu beliau minum sambil berdiri. Waktu itu beliau meminta air ketika beliau berada di samping baitullah (Ka'bah). Telah menceritakannya kepada kami [Muhammad bin Basyar]; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami [Wahb bin Jarir] keduanya dari [Syu'bah] dengan sanad ini. Namun dalam Hadits keduanya disebutkan kalimat; 'lalu aku membawakan gayung untuk beliau",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 5284,
			"arabicnumber": "2027.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 5285,
			"arabicnumber": "267.04",
			"text": "Telah menceritakan kepada kami [Ibnu Abu 'Umar]; Telah menceritakan kepada kami [Ats Tsaqafi] dari [Ayyub] dari [Yahya bin Abu Katsir] dari ['Abdillah bin Abu Qatadah] dari [Bapaknya]; Bahwa Nabi shallallahu 'alaihi wasallam melarang menghembuskan nafas di dalam bejana (ketika minum)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 5286,
			"arabicnumber": "2028.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu Bakr bin Abu Syaibah] mereka berkata; Telah menceritakan kepada kami [Waki'] dari ['Azrah bin Tsabit Al Anshari] dari [Tsumamah bin 'Abdillah bin Anas] dari [Anas]; Bahwa Rasulullah shallallahu 'alaihi wasallam bernafas (ketika minum) di bejana sebanyak tiga kali",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 5287,
			"arabicnumber": "2028.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami ['Abdul Warits bin Sa'id]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepada kami [Syaiban bin Farrukh]; Telah menceritakan kepada kami ['Abdul Warits] dari [Abu 'Isham] dari [Anas] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah bernafas tiga kali ketika minum. Beliau berkata: 'Itu lebih melegakan, lebih bersih, dan lebih bermanfaat.\" Kata Anas; 'Karena itu aku bernafas tiga kali setiap minum.' Dan telah menceritakannya kepada kami [Qutaibah bin Sa'id] dan [Abu Bakr bin Abu Syaibah] mereka berkata; Telah menceritakan kepada kami [Waki'] dari [Hisyam Ad Dawastai] dari [Abu 'Isham] dari [Anas] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa, dengan kalimat 'fil Inaa' (di dalam bejana)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 5288,
			"arabicnumber": "2028.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 5289,
			"arabicnumber": "2029.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata; Telah membaca kitab [Malik] dari [Ibnu Syihab] dari [Anas bin Malik]; Bahwa Rasulullah shallallahu 'alaihi wasallam diberi minum susu campur air. Di sebelah kanan beliau ada seorang Badui, sedangkan Abu Bakr berada di sebelah kiri beliau. Setelah beliau minum, beliau berikan (sisanya) kepada orang Badui. Beliau bersabda: \"Hendaknya dimulai dari sebelah kanan dahulu dan seterusnya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 5290,
			"arabicnumber": "2029.02",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan ['Amru An Naqid] dan [Zuhair bin Harb] dan [Muhammad bin 'Abdillah bin Numair]; Dan lafazh ini milik [Zuhair] ia berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Anas] ia berkata; Nabi shallallahu 'alaihi wasallam datang ke Madinah, waktu itu aku berumur sepuluh tahun. Beliau Shallallah 'Alaihi Wa Sallam wafat ketika aku berumur dua puluh tahun. Istri-istri beliau adalah ibu-ibuku, mereka selalu menganjurkanku untuk membantu beliau. Suatu hari beliau masuk ke rumah kami, lalu kami memeras susu untuk beliau dari seekor kambing ternak, dan aku campur dengan air sumur di rumah. Kemudian Rasulullah Shallallah 'Alaihi Wa Sallam meminumnya. Setelah selesai, Umar bertanya kepada beliau; 'Apakah aku berikan kepada Abu Bakar dahulu? ' (waktu itu Abu Bakr berada di sebelah kiri beliau). Namun Rasulullah Shallallah 'Alaihi Wa Sallam memberikan sisa minumnya kepada orang badui (yang berada di sebelah kanan beliau) seraya bersabda: \"Hendaknya dimulai dari sebelah kanan dan seterusnya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 5291,
			"arabicnumber": "2029.03",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] dan ['Ali bin Hujr] mereka berkata; Telah menceritakan kepada kami [Isma'il] yaitu Ibnu Ja'far, dari ['Abdullah bin 'Abdurrahman bin Ma'mar bin Hazm Abu Thuwalah Al Anshari] bahwa dia mendengar [Anas bin Malik]. Demikian juga telah diriwayatkan dari jalur yang lain, Telah menceritakan kepada kami ['Abdullah bin Maslamah bin Qa'nab]; Dan lafazh ini miliknya; Telah menceritakan kepada kami [Sulaiman] yaitu Ibnu Bilal, dari ['Abdullah bin 'Abdurrahman]; Bahwasanya dia telah mendengar [Anas bin Malik] bercerita, dia berkata; Rasulullah Shallallah 'Alaihi Wa Sallam datang ke rumah kami, lalu beliau meminta minum, maka aku peraskan untuknya air susu dari seekor kambing. Kemudian aku mencampurnya dengan air sumurku. Anas berkata; 'Aku berikan susu tersebut kepada Rasulullah Shallallah 'Alaihi Wa Sallam, lalu beliau meminumnya.' Abu Bakr pada waktu itu berada di sebelah kiri beliau, sedangkan 'Umar berada di depan beliau, dan di sebelah kanan beliau ada orang badui. Tatkala Rasulullah Shallallah 'Alaihi Wa Sallam selesai minum, Umar berkata; 'Wahai Rasulullah! Ini Abu Bakr, berikanlah minuman itu kepadanya.' Tetapi ternyata Rasulullah memberikan sisa minumnya kepada orang badui dahulu daripada Abu Bakr dan Umar. Beliau bersabda; \"Dari sebelah kanan dahulu, dari sebelah kanan dahulu, dari sebelah kanan dahulu.\" Anas berkata; 'Itulah sunnah, itulah sunnah, itulah sunnah",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 5292,
			"arabicnumber": "2030.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] yang dibacakan kepadanya, dari [Abu Hazim] dari [Sahl bin Sa'd As Sa'idi]; Bahwa Rasulullah shallallahu 'alaihi wasallam diberi air minum, lalu beliau meminumnya. Di sebelah kanan beliau ada seorang anak kecil sedangkan di sebelah kiri beliau ada beberapa orang tua. Maka beliau bertanya kepada anak kecil tersebut: \"Apakah kamu mengizinkan aku untuk memberikan air minum ini kepada mereka (orang tua) terlebih dahulu?\" Anak kecil tersebut menjawab; 'Tidak, demi Allah aku tidak akan mendahulukan seorangpun dariku untuk mendapatkan bagianku.' Lalu Rasulullah shallallahu 'alaihi wasallam memberikan kepadanya. Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami ['Abdul 'Aziz bin Abu Hazim]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakannya kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Ya'qub] yaitu Ibnu 'Abdurrahman Al Qari, keduanya dari [Abu Hazim] dari [Sahl bin Sa'd] dari Nabi shallallahu 'alaihi wasallam, dengan Hadits yang serupa, namun keduanya tidak mengatakan dengan kalimat 'Fatallahu', akan tetapi sebagaimana riwayat Ya'qub dia berkata dengan lafazh; 'Fa a'thaahu Iyyahu' (lalu beliau memberikan air minum itu kepada anak kecil)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 5293,
			"arabicnumber": "2030.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 5294,
			"arabicnumber": "2031.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah], ['Amru An Naqid], [Ishaq bin Ibrahim] dan [Ibnu Abu 'Umar], Ishaq berkata; Telah mengabarkan kepada kami, sedangkan yang lain berkata; Telah menceritakan kepada kami [Sufyan] dari [Amru] dari ['Atha] dari [Ibnu Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang diantara kalian makan, maka janganlah dia mengusap tangannya hingga menjilatinya dahulu atau dijilati",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 5295,
			"arabicnumber": "2031.02",
			"text": "Telah menceritakan kepadaku [Harun bin 'Abdullah]; Telah menceritakan kepada kami [Hajjaj bin Muhammad]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepada kami ['Abdu bin Humaid]; Telah menceritakan kepadaku [Abu 'Ashim] -seluruhnya- dari [Ibnu Juraij]; Demikian juga telah diriwayatkan dari jalur yang lain, dan telah menceritakan kepada kami [Zuhair bin Harb]; dan lafazh ini miliknya; Telah menceritakan kepada kami [Rauh bin 'Ubadah]; Telah menceritakan kepada kami [Ibnu Juraij] ia berkata; Aku mendengar [`Atha] berkata; Aku mendengar [Ibnu Abbas] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang diantara kalian makan, maka janganlah dia mengusap tangannya hingga menjilatinya dahulu atau dijilati",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 5296,
			"arabicnumber": "2032.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] dan [Muhammad bin Hatim] mereka berkata; Telah menceritakan kepada kami [Ibnu Mahdi] dari [Sufyan] dari [Sa'd bin Ibrahim] dari [Ibnu Ka'b bin Malik] dari [Bapaknya] ia berkata; \"Aku melihat Rasulullah shallallahu 'alaihi wasallam menjilati ketiga jarinya dari sisa makanan.\" Namun Ibnu Hatim tidak menyebutkan 'ketiga'. Dan Ibnu Syaibah berkata dalam meriwayatkannya; dari Abdurrahman bin Ka'ab dari Bapaknya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 5297,
			"arabicnumber": "2032.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Hisyam bin 'Urwah] dari ['Abdurrahman bin Sa'd] dari [Ibnu Ka'b bin Malik] dari [Bapaknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam makan dengan tiga jari, dan beliau menjilatinya sebelum mencuci tangannya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 5298,
			"arabicnumber": "2032.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Numair]; Telah menceritakan kepada kami [Hisyam] dari ['Abdurrahman bin Sa'd] bahwa [Abdurrahman bin Ka'b bin Malik] atau ['Abdullah bin Ka'ab] Telah mengabarkan kepadanya dari [Bapaknya] yaitu Ka'b; dia telah menceritakan kepada mereka, bahwa Rasulullah shallallahu 'alaihi wasallam makan dengan tiga jari. Apabila telah selesai makan, beliau menjilatinya. Dan Telah menceritakannya pula kepada kami [Abu Kuraib] Telah menceritakan kepada kami [Ibnu Numair]; Telah menceritakan kepada kami [Hisyam] dari ['Abdurrahman bin Sa'd] bahwa ['Abdurrahman bin Ka'ab bin Malik] dan ['Abdullah bin Ka'ab]; Telah menceritakan kepadanya, -atau salah seorang dari mereka-, dari [Bapaknya] yaitu Ka'ab bin Malik, dari Nabi shallallahu 'alaihi wasallam -dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 5299,
			"arabicnumber": "2032.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 5300,
			"arabicnumber": "2033.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Abu Az Zubair] dari [Jabir], bahwa Nabi shallallahu 'alaihi wasallam menyuruh menjilati jari jemari tangan dan piring. Beliau bersabda: \"Sesungguhnya kalian tidak mengetahui dimana letak barakahnya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 5301,
			"arabicnumber": "2033.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Numair]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Sufyan] dari [Abu Az Zubair] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila suapan makanan salah seorang diantara kalian jatuh, ambilah kembali lalu buang bagian yang kotor dan makanlah bagian yang bersih. Jangan dibiarkannya dimakan setan, dan janganlah dia sapu tangannya dengan serbet sebelum dia jilati jarinya. Karena dia tidak tahu makanan mana yang membawa berkah.\" Dan telah menceritakannya kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami [Abu Dawud Al Hafari]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakannya kepada kami [Muhammad bin Rafi']; Telah menceritakan kepada kami ['Abdur Razaq] keduanya dari [Sufyan] dengan sanad ini. Di dalam Hadits keduanya di sebutkan; 'Dan janganlah dia meyapu tangannya dengan serbet sebelum dia jilati jarinya atau di jilati",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 5302,
			"arabicnumber": "2033.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 5303,
			"arabicnumber": "2033.04",
			"text": "Telah menceritakan kepada kami ['Utsman bin Abu Syaibah]; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] ia berkata; Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya setan akan mendatangi salah seorang diantara kalian setiap saat, hingga dalam masalah makan. Apabila suapan makanan salah seorang diantara kalian jatuh, ambillah kembali lalu buang bagian yang kotor dan makanlah bagian yang bersih. Jangan dibiarkannya dimakan setan, apabila telah selesai hendaklah dia jilati jari-jemarinya. Karena dia tidak tahu makanan mana yang membawa berkah.\" Telah menceritakannya pula kepada kami [Abu Kuraib] dan [Ishaq bin Ibrahim] -secara keseluruhan- dari [Abu Mu'awiyah] dari [Al A'masy] dengan sanad ini, namun mereka tidak menyebutkan redaksi awal Hadits yang berbunyi; 'Sesungguhnya setan akan mendatangi salah seorang diantara kalian…\" dst. Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Al 'Amasy] dari [Abu Shalih] dan [Abu Sufyan] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam-mengenai menjilati jari-. Dan dari Abu Sufyan dari Jabir dari Nabi dengan menyebutkan -suapan- sebagaimana Hadist di atas",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 5304,
			"arabicnumber": "2033.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 5305,
			"arabicnumber": "2033.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 5306,
			"arabicnumber": "2034",
			"text": "Telah menceritakan kepada kami [Muhammad bin Hatim] dan [Abu Bakr bin Nafi' Al 'Abdi] mereka berkata; Telah menceritakan kepada kami [Bahz]; Telah menceritakan kepada kami [Hammad bin Salamah]; Telah menceritakan kepada kami [Tsabit] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam apabila selesai makan, dia menjilati ke tiga jari tangannya. Anas berkata; Beliau bersabda: 'Apabila suapan makanan salah seorang diantara kalian jatuh, ambillah kembali lalu buang bagian yang kotor dan makanlah bagian yang bersih. Jangan dibiarkannya dimakan setan.\" Dan beliau menyuruh kami untuk menjilati piring. Beliau bersabda: 'Karena kalian tidak tahu makanan mana yang membawa berkah",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 5307,
			"arabicnumber": "2035.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 5308,
			"arabicnumber": "2035.02",
			"text": "Telah menceritakan kepadaku [Muhammad bin Hatim]; Telah menceritakan kepada kami [Bahz]; Telah menceritakan kepada kami [Wuhaib]; Telah menceritakan kepada kami [Suhail] dari [Bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika salah seorang diantara kalian selesai makan, maka hendaklah ia menjilati jari-jemarinya, karena dia tidak tahu ada dimana berkahnya. Dan telah menceritakannya kepada kami [Abu Bakr bin Nafi']; Telah menceritakan kepada kami ['Abdurrahman] yaitu Ibnu Mahdi ia berkata; Telah menceritakan kepada kami [Hammad] dengan sanad ini, hanya saja dia berkata dengan lafazh; 'Dan hendaklah salah seorang di antara kalian menjilati piring. Juga sabda beliau: 'Kalian tidak tahu mana makanan yang ada berkahnya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 5309,
			"arabicnumber": "2036.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan ['Utsman bin Abu Syaibah] -lafazh keduanya hampir sama-; keduanya berkata; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Wail] dari [Abu Mas'ud Al Anshari] ia berkata; Ada seorang laki-laki Anshar bernama Abu Syu'aib, dia mempunyai seorang pelayan tukang daging. Pada suatu hari Abu Syu'aib melihat Rasulullah shallallahu 'alaihi wasallam. Dia tahu dari wajah beliau bahwa beliau sedang lapar. Maka Syu'aib berkata kepada pelayannya; \"Kasihan! Siapkan hidangan untuk lima orang. Aku hendak mengundang Rasulullah shallallahu 'alaihi wasallam beserta empat orang lainnya.\" Setelah hidangan tersedia, Nabi shallallahu 'alaihi wasallam pun tiba beserta empat orang lainnya dan seorang lagi mengikuti mereka. Tatkala sampai di pintu Nabi shallallahu 'alaihi wasallam berkata: 'Kawan ini mengikuti kami. Jika engkau izinkan dia turut makan, silakan. Jika tidak, biarkan dia kembali.' Jawab Abu Syu'aib; 'Jangan, tentu aku izinkan, ya Rasulullah! ' Dan telah menceritakannya pula kepada kami [Abu Bakr bin Abu Syaibah] dan [Ishaq bin Ibrahim] secara keseluruhan, dari [Abu Mu'awiyah]. Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakannya kepada kami [Nashr bin 'Ali Al Jahdlami] dan [Abu Sa'id Al Asyaj] mereka berkata; Telah menceritakan kepada kami [Abu Usamah]; Demikian juga telah diriwayatkan dari jalur yang lain, Dan telah menceritakan kepada kami ['Ubaidullah bin Mu'adz]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Syu'bah], Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepadaku ['Abdullah bin 'Abdurrahman Ad Darimi]; Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Sufyan] -seluruhnya-, Dari [Al A'masy] dari [Abu Wail] dari [Abu Mas'ud] dengan Hadits ini, dari Nabi shallallahu 'alaihi wasallam sebagaimana Hadits [Jarir]. [Nashr bin 'Ali] berkata dalam meriwayatkan Hadits ini. Telah menceritakan kepada kami [Abu Usamah]; Telah menceritakan kepada kami [Al A'masy]; Telah menceritakan kepada kami [Syaqiq bin Salamah]; Telah menceritakan kepada kami [Abu Mas'ud Al Anshari]; (Kemudian dia menyebutkan Haditsnya). Dan telah menceritakan kepadaku [Muhammad bin 'Amru bin Jabalah bin Abu Rawwad]; Telah menceritakan kepada kami [Abul Jawwab]; Telah menceritakan kepada kami ['Ammar] yaitu Ibnu Ruzaiq dari [Al A'masy] dari [Abu Sufyan] dari [Jabir]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepadaku [Salamah bin Syabib]; Telah menceritakan kepada kami [Al Hasan bin Al A'yan]; Telah menceritakan kepada kami [Zuhair]; Telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Abu Mas'ud] dari Nabi shallallahu 'alaihi wasallam. Dan dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] dengan Hadits ini",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 5310,
			"arabicnumber": "2036.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 5311,
			"arabicnumber": "2036.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 5312,
			"arabicnumber": "2037",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb]; Telah menceritakan kepada kami [Yazid bin Harun]; Telah mengabarkan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Anas radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam mempunyai tetangga seorang bangsa Persia yang pandai memasak. Pada suatu hari dia memasak hidangan untuk Rasulullah shallallahu 'alaihi wasallam. Setelah itu dia datang mengundang beliau. Beliau bertanya: \"Aisyah bagaimana?\" orang itu menjawab; 'Dia tidak! ' Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalau begitu aku juga tidak!\" Orang itu mengulangi undangannya kembali. Rasulullah shallallahu 'alaihi wasallam bertanya: \"'Aisyah bagaimana? '\" orang itu menjawab; 'Dia tidak! ' Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalau begitu aku juga tidak!\" Orang itu mengulangi undangannya pula. Nabi shallallahu 'alaihi wasallam bertanya: \"Aisyah bagaimana?\" Jawab orang itu pada ketiga kalinya; 'Ya, Aisyah juga.' Maka Rasulullah pergi bersama Aisyah ke rumah tetangga itu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 5313,
			"arabicnumber": "2038.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Khalaf bin Khalifah] dari [Yazid bin Kaisan] dari [Abu Hazim] dari [Abu Hurairah] ia berkata; Pada suatu hari atau suatu malam Rasulullah shallallahu 'alaihi wasallam pergi keluar rumah, tiba-tiba beliau bertemu dengan Abu Bakar dan 'Umar. Lalu beliau bertanya: \"Mengapa kalian keluar rumah malam-malam begini?\" Mereka menjawab; 'Kami lapar, ya Rasulullah! ' Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Allah yang jiwaku dalam Tangan-Nya, aku juga keluar karena lapar seperti kalian. Marilah!\" Mereka pergi mengikuti beliau ke rumah shahabat Anshar (Abu Haitsam bin At Taihan). Namun sayang dia sedang tidak di rumah. Tetapi tatkala istrinya melihat Rasulullah shallallahu 'alaihi wasallam datang, dia mengucapkan; \"Marhaban wa Ahlan (selamat datang).\" Maka Rasulullah shallallahu 'alaihi wasallam bertanya: \"Kemana si Fulan (Abu Haitsam)?\"' Isterinya menjawab; 'Dia sedang mengambil air tawar untuk kami.' Tiba-tiba suaminya datang dan melihat Rasulullah shallallahu 'alaihi wasallam beserta dua sahabat beliau, maka dia berkata; 'Alhamdulillah, tidak ada orang yang lebih bahagia dariku hari ini, karena kedatangan tamu yang mulia.' Lalu dia mengambil setandan kurma, di antaranya ada yang masih muda, yang mulai masak, dan yang sudah masak betul. Katanya; 'Silakan dimakan ini.' Sambil dia mengambil pisau. Nabi shallallahu 'alaihi wasallam bersabda: 'Jangan disembelih yang lagi mempunyai susu.' Maka dipotongnya seekor kambing, lalu mereka makan kambing, makan kurma setandan, dan minum. Setelah semuanya kenyang dan puas makan dan minum, Rasulullah shallallahu 'alaihi wasallam bersabda kepada Abu Bakar dan 'Umar: 'Demi Allah yang jiwaku berada dalam Tangan-Nya, kalian akan ditanya pada hari kiamat tentang nikmat yang kalian peroleh ini. Kalian keluar dari rumah karena lapar dan pulang sesudah memperoleh nikmat ini.' Telah menceritakan kepadaku [Ishaq bin Manshur]; Telah mengabarkan kepada kami [Abu Hisyam] yaitu Al Mughirah bin Salamah; Telah menceritakan kepada kami ['Abdul Wahid bin Ziyad]; Telah menceritakan kepada kami [Yazid]; Telah menceritakan kepada kami [Abu Hazim] ia berkata; Aku mendengar [Abu Hurairah] berkata; Tatkala Abu Bakr dan Umar sedang duduk-duduk, tiba-tiba Rasulullah shallallahu 'alaihi wasallam datang kepada mereka, beliau bertanya: \"Kenapa kalian duduk-duduk di sini?\" Mereka menjawab; 'Kami lapar hingga kami keluar rumah.' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Demi Allah yang jiwaku dalam Tangan-Nya, …\" kemudian dia menyebutkan Hadits yang serupa dengan Hadits Khalfa bin Khalifah",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 5314,
			"arabicnumber": "2038.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 5315,
			"arabicnumber": "2039",
			"text": "Telah menceritakan kepadaku [Hajjaj bin Asy Sya'iri]; Telah menceritakan kepadaku [Adl Dlahak bin Makhlad] dari selembar kertas yang dia perlihatkan kepadaku, kemudian dia membacakannya kepadaku, dia berkata; Telah mengabarkannya kepada kami [Handzalah bin Abu Sufyan]; Telah menceritakan kepada kami [Sa'id bin Mina] ia berkata; Aku mendengar [Jabir bin Abdullah] berkata; \"Tatkala penggalian parit pertahanan Khandaq sedang dilaksanakan, aku melihat Rasulullah shallallahu 'alaihi wasallam dalam keadaan lapar. Karena itu aku kembali kepada isteriku, menanyakan kepadanya; 'Adakah engkau mempunyai makanan? Aku melihat Rasulullah shallallahu 'alaihi wasallam sedang lapar.' Maka dikeluarkannya sebuah karung, di dalamnya terdapat satu sha' (segantang) gandum. Di samping itu kami mempunyai seekor kambing ternak. Maka aku sembelih kambing itu, sementara istriku menumbuk tepung. Ketika aku selesai menyembelih, ia pun telah selesai menumbuk. Lalu aku potong-potong kambing itu dan aku masukkan ke dalam kuali. Kemudian aku pergi kepada Rasulullah shallallahu 'alaihi wasallam (mengundangnya datang untuk makan ke rumah). Sementara itu istriku berkata kepadaku; 'Engkau jangan memalukan aku kepada Rasulullah shallallahu 'alaihi wasallam dan para sahabat beliau.' Maka aku temui beliau seraya berbisik kepadanya; 'Ya, Rasulullah! Aku menyembelih seekor kambing ternak kepunyaan kami, dan isteriku telah menumbuk satu sha' (segantang) gandum yang kami miliki. Karena itu sudilah Anda datang makan bersama-sama dengan beberapa sahabat.' Maka berteriaklah Rasulullah shallallahu 'alaihi wasallam: \"Hai orang-orang Khandaq! Jabir membuat hidangan untuk kamu semua. Marilah kita makan bersama-sama!\" Sementara itu Rasulullah shallallahu 'alaihi wasallam berkata kepada Jabir: \"Jangan kamu turunkan kualimu dan jangan dimasak dulu adonan rotimu sebelum aku datang\"' Lalu aku pulang. Tidak lama kemudian Rasulullah pun datang mendahului para sahabat. Ketika aku temui isteriku, dia menyesaliku, katanya; 'Bagaimana engkau! Bagaimana engkau! ' Jawabku; 'Aku telah lakukan apa yang engkau pesankan kepadaku.' Maka aku keluarkan adonan roti kami, lalu Rasulullah shallallahu 'alaihi wasallam meludahi adonan itu untuk memberi keberkahan. Kemudian beliau menuju kuali (tempat memasak kambing), maka beliau pun memohonkan keberkahan untuknya. Sesudah itu beliau berkata kepada isteriku: \"Panggillah tukang roti untuk membantumu memasak. Nanti isikan gulai ke mangkok langsung dari kuali dan sekali-kali jangan diturunkan kualimu itu.\" Kala itu para sahabat semuanya berjumlah seribu orang. Demi Allah, semuanya turut makan dan setelah itu mereka pergi. Tetapi kuali kami masih tetap penuh berisi seperti semula. Sedangkan adonan -sebagaimana kata Ad Dlahak- masih tersedia pula sebanyak semula",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 5316,
			"arabicnumber": "2040.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku mebaca Hadits [Malik bin Anas] dari [Ishaq bin 'Abdullah bin Abu Thalhah]; Bahwasanya dia mendengar [Anas bin Malik] berkata; Abu Thalhah berkata kepada Ummu Sulaim; \"Aku mendengar suara Rasulullah shallallahu 'alaihi wasallam sangat lemah, yang aku tahu bahwa beliau sangat lapar. Apakah kamu mempunyai sesuatu?\" Dia menjawab; 'Ya.' Kemudian dia mengeluarkan beberapa roti pipih dari gandum, lalu meraih kerudungnya. Kemudian dia menyusupkan ke bawah tanganku, dan menyelendangkan kerudungnya (yang berisi roti). Dia mengutusku kepada Rasulullah shallallahu 'alaihi wasallam. Anas berkata; 'Aku membawanya menemui Rasulullah shallallahu 'alaihi wasallam. Aku mendapati beliau sedang duduk di masjid bersama para sahabat. Aku berdiri di hadapan mereka. Rasulullah shallallahu 'alaihi wasallam bertanya: 'Apakah Abu Thalhah yang menyuruhmu? ' Anas menjawab; 'Ya', Beliau bertanya: 'Untuk membawakan makanan? ' Aku menjawab; 'Ya, ' maka Rasulullah shallallahu 'alaihi wasallam berkata kepada orang-orang yang sedang bersamanya; 'Berdirilah! ' Anas berkata; 'Beliau berangkat dan aku berada di bagian depan mereka, hingga aku menemui Abu Thalhah dan mengabarkan hal itu.' Abu Thalhah berkata; 'Wahai Ummu Sulaim, Rasulullah shallallahu 'alaihi wasallam datang bersama orang-orang, sedangkan kita tidak memiliki makanan yang cukup untuk menjamu mereka? ' Ummu Sulaim menjawab; 'Allah dan Rasul-Nya lebih mengetahui.' Anas berkata; 'Abu Thalhah menemui Rasulullah shallallahu 'alaihi wasallam. Beliau tiba dan Abu Thalhah menghampiri beliau hingga memasuki rumahnya. Rasulullah shallallahu 'alaihi wasallam bersabda: 'Kemarilah, Wahai Ummu Sulaim, apa yang kau miliki? ' Dia datang dengan membawa roti itu, kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan agar roti tersebut dilumatkan. Roti pun dilumatkan dan Ummu Sulaim menuangkan minyak samin pada wadah tersebut. Sehingga menjadi lauk. Rasulullah shallallahu 'alaihi wasallam mengucapkan beberapa kalimat lalu bersabda: 'Persilahkan sepuluh orang untuk masuk.' Abu Thalhah mempersilahkan mereka. Mereka menyantapnya hingga kenyang kemudian keluar. Beliau bersabda: 'Persilahkan sepuluh orang untuk masuk.' Abu Thalhah mempersilahkan mereka, dan mereka menyantapnya hingga kenyang kemudian keluar. Kemudian beliau bersabda: 'Persilahkan sepuluh orang untuk masuk.' Hingga mereka mereka bisa makan dan kenyang. Jumlah mereka ada tujuh puluh orang atau delapan puluh orang",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 5317,
			"arabicnumber": "2040.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 5318,
			"arabicnumber": "2040.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 5319,
			"arabicnumber": "2040.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 5320,
			"arabicnumber": "2040.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 5321,
			"arabicnumber": "2040.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 5322,
			"arabicnumber": "2040.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 5323,
			"arabicnumber": "2040.08",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah], Telah menceritakan kepada kami [Abdullah bin Numair], demikian juga diriwayatkan dari jalur lain, dan Telah menceritakan kepada kami [Ibnu Numair] lafazh ini miliknya, telah menceritakan kepada kami [Bapakku], Telah menceritakan kepada kami [Sa'd bin Sa'id], Telah menceritakan kepadaku [Anas bin Malik radliallahu 'anhu] dia berkata; \"Abu Thalhah menyuruhku mendatangi Rasulullah shallallahu 'alaihi wasallam untuk mengundang beliau makan ke rumahnya, dan Abu Thalhah telah menyediakan hidangan. Lalu aku pergi mengundang beliau. Aku dapati beliau sedang bersama orang banyak. Beliau menengok kepadaku sehingga aku malu karenanya. Lalu aku katakan; 'Abu Thalhah mengundang anda makan ke rumahnya, sudilah Anda berkenaan (memenuhinya)! ' Maka beliau berkata: 'Berdirilah semuanya! ' Kata Abu Thalhah; 'Ya, Rasulullah! Aku hanya menyediakan makanan untuk Anda seorang.' Lalu beliau menyentuh makanan yang tersedia itu dan mendoakan keberkahan bagi makanan tersebut. Kemudian beliau bersabda: 'Suruh masuk kawan-kawan itu sepuluh orang.' Kata beliau: 'Silahkan Makanlah! ' Dari sela-sela jari beliau keluar sesuatu (berupa makanan), maka makanlah mereka sampai kenyang, sesudah itu mereka keluar. Kata beliau: 'Suruh masuk sepuluh orang lagi.' Mereka makan pula sampai kenyang. Begitulah seterusnya secara bergantian mereka masuk sepuluh orang, sehingga tidak seorangpun yang ketinggalan, semuanya masuk dan makan sampai kenyang. Kemudian ternyata makanan masih tersisa sebanyak semula.\" Dan Telah menceritakan kepadaku [Said bin Yahya Al Umawi] Telah menceritakan kepadaku [Bapakku] Telah menceritakan kepada kami [Sa'd bin Sa'id] dia berkata; Aku mendengar [Anas bin Malik] berkata; Abu Thalhah mengutusku untuk mengundang Rasulullah shallallahu 'alaihi wasallam…dan seterusnya seperti Hadits yang diriwayatkan Ibnu Numair, tapi dia berkata pada akhir hadisnya; 'Kemudian beliau mengambil sisa makanan dan mengumpulkannya lalu mendo'akan keberkahan untuknya hingga makanan tersebut kembali (banyak) seperti semula, kemudian beliau bersabda: 'Yang ini bukan untuk kalian.' Dan Telah menceritakan kepadaku [Amru An Naqid], Telah menceritakan kepada kami [Abdullah bin Ja'far Ar Raqi], Telah menceritakan kepada kami [Ubaidullah bin Amru] dari [Abdul Malik bin Umair] dari [Abdurrahman bin Abu Laila], dari [Anas bin Malik] dia berkata; 'Abu Thalhah menyuruh Ummu Sulaim agar membuat makanan yang khusus untuk Rasulullah shallallahu 'alaihi wasallam saja. Kemudian dia mengutusku untuk mengundang beliau shallallahu 'alaihi wasallam…… dan seterusnya dengan Hadits yang serupa. Namun disebutkan di dalamnya, 'Lalu beliau shallallahu 'alaihi wasallam meletakan tangannya sambil menyebut nama Allah kemudian berkata; 'Persilahkan sepuluh orang masuk, lalu mereka masuk.' Beliau bersabda: 'Makanlah dan ucapkanlah basmalah.' Mereka pun kemudian makan hingga jumlah mereka mencapai tujuh puluh orang laki-laki. Setelah itu Nabi shallallahu 'alaihi wasallam dan yang menjamunya makan hingga habis. Dan Telah menceritakan kepada kami [Abbad bin Humaid] Telah menceritakan kepada kami [Abdullah bin Maslamah], Telah menceritakan kepada kami [Abdul 'Aziz bin Muhammad] dari [Amru bin Yahya] dari [Bapaknya] dari [Anas bin Malik] -dengan kisah ini- (kisah Abu Thalhah menjamu Rasulullah shallallahu 'alaihi wasallam). -Dari Nabi Shallallah 'Alaihi Wa Sallam.- Dan disebutkan di dalamnya; 'Lalu Abu Thalhah berdiri di depan pintu hingga Rasulullah shallallahu 'alaihi wasallam datang. Kemudian dia berkata; 'Wahai Rasulullah Shallallah 'Alaihi Wa Sallam, kami hanya memiliki sedikit makanan.' Rasulullah menjawab: 'Bawa kesini, sesungguhnya Allah akan memberikan keberkahan.' Dan telah menceritakan kepada kami ['Abad bin Humaid], Telah menceritakan kepada kami [Khalid bin Makhlad Al Bajali], Telah menceritakan kepadaku [Muhammad bin Musa], Telah menceritakan kepada kami [Abdullah bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam dengan Hadits ini. Dan di dalamnya disebutkan, 'Kemudian Rasulullah shallallahu 'alaihi wasallam dan tuan rumahnya makan. Namun makanan itu tetap tersisa yang dapat mencukupi untuk tetangganya.' Dan telah menceritakan kepada kami [Al Hasan bin Ali Al Hulwani], Telah menceritakan kepada kami [Wahab bin Jarir], Telah menceritakan kepada kami [Bapakku] dia berkata; 'Aku mendengar [Jarir bin Zaid] menceritakan dari ['Amru bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] dia berkata; 'Abu Thalhah melihat Rasulullah shallallahu 'alaihi wasallam dalam keadaan tidur di masjid dengan membolak-balikkan tubuhnya, kemudian Abu Thalhah menemui Ummu Sulaim dan berkata; 'Aku melihat Rasulullah Shallallah 'Alaihi Wa Sallam tidur di masjid dengan membolak-balikkan tubuhnya, sepertinya beliau sedang lapar.' -Kemudian perawi menyebutkan Hadits diatas.- Dan disebutkan di dalamnya; 'Lalu Rasulullah Shallallah 'Alaihi Wa Sallam, Abu Thalhah, Ummu Sulaim dan Anas bin Malik makan, namun makanan itu tetap tersisa. Maka kami membagikannya kepada tetangga kami.' Dan telah menceritakan kepadaku [Harmalah bin Yahya At Tujibi], Telah menceritakan kepada kami [Abdullah bin Wahab], Telah mengabarkan kepadaku [Usamah] bahwa [Ya'qub bin Abdullah bin Abu Thalhah Al Anshari] telah menceritakan kepadanya, dia mendengar [Anas bin Malik] berkata; 'Pada suatu hari aku mendatangi Rasulullah shallallahu 'alaihi wasallam. Aku mendapatkan beliau sedang duduk berbincang-bincang dengan para sahabatnya, sedangkan perut beliau dalam keadaan di ikat. Seingatku beliau mengikatkan batu pada perutnya. Lalu aku bertanya kepada para sahabatnya; 'Kenapa Rasulullahu Shallallah 'Alaihi Wa Sallam mengikat perutnya? ' Mereka menjawab; 'Beliau sedang lapar.' Akupun segara pergi menemui Abu Thalhah suami Ummu Sulaim binti Milhan, Aku katakan kepadanya; 'Wahai Bapak, Aku melihat Rasulullah shallallahu 'alaihi wasallam mengikat perutnya, lalu aku tanyakan kepada para sahabatnya, mereka menjawab; 'Beliau sedang lapar.' Abu Thalhah pun masuk menemui ibuku, dia bertanya kepadanya; 'Apakah ada makanan? ' Dia menjawab; 'Ya aku punya sepotong roti dan beberapa kurma, apabila Rasulullah shallallahu 'alaihi wasallam datang kepada kita sendirian, kita bisa membuat beliau menjadi kenyang. Namun jika ada orang lain bersama beliau, maka makanan itu tidak cukup untuk mereka.' -Kemudian perawi menyebutkan semua kisah Hadits di atas. Dan telah menceritakan kepadaku [Hajjaj bin As Syaa'ir], Telah menceritakan kepada kami [Yunus bin Muhammad] Telah menceritakan kepada kami [Harb bin Maimun] dari [An Nadhr bin Anas] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam -mengenai Abu Thalhah menjamu makanan kepada Rasulullah sebagaimana Hadits mereka",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 5324,
			"arabicnumber": "2040.09",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 5325,
			"arabicnumber": "2041.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] seperti yang telah dibacakan kepadanya, dari [Ishaq bin Abdullah bin Abu Thalhah] bahwa dia mendengar [Anas bin Malik] berkata; \"Seorang tukang jahit (pakaian) mengundang Rasulullah shallallahu 'alaihi wasallam untuk makan yang telah dibuatnya sendiri. Aku ikut pergi bersama Rasulullah Shallallah 'Alaihi Wa Sallam. Roti dari gandum dan kuah pun di hidangkan dan didekatkan kepada Rasulullah shallallahu 'alaihi wasallam, yang di dalamnya ada labu dan dendeng daging. Anas berkata; 'Aku melihat Rasulullah terus menerus mencari-cari labu yang berada di sekeliling piring besar, sehingga sejak saat itu aku menjadi senang dengan labu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 5326,
			"arabicnumber": "2041.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 5327,
			"arabicnumber": "2041.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala` Abu Kuraib], Telah menceritakan kepada kami [Abu Usamah] dari [Sulaiman bin Al Mughirah] dari [Tsabit] dari [Anas] dia berkata; \"Seseorang mengundang Rasulullah shallallahu 'alaihi wasallam, lalu aku ikut bersama beliau. Kemudian dihidangkan kepada beliau kuah yang berisi labu. Rasulullah shallallahu 'alaihi wasallam makan dengan kuah labu tersebut dan beliau menyukainya. Anas berkata; 'Ketika aku melihat demikan, aku tidak memakannya, aku berikan kepada Rasulullah shallallahu 'alaihi wasallam.' Anas berkata; 'Setelah itu aku selalu menyukai labu.' Dan Telah menceritakan kepadaku [Hajjaj bin As Syaa'ir] dan [Abad bin Humaid] -semuanya- dari [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar] dari [Tsabit Al Bunani] dan ['Ashim Al Ahwal] dari [Anas bin Malik] bahwa seorang penjahit (pakaian) mengundang Rasulullah shallallahu 'alaihi wasallam untuk makan. Di dalamnya ada tambahan, Tsabit berkata; Aku mendengar Anas berkata; 'Setelah itu, tidak dibuatkan untukku makanan yang memungkinkan ada labunya melainkan pasti dibuatkan",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 5328,
			"arabicnumber": "2042.01",
			"text": "Telah menceritakan kepadaku [Muhammad bin Al Mutsanna Al 'Anazi], Telah menceritakan kepada kami [Muhammad bin Ja'far], Telah menceritakan kepada kami [Syu'bah] dari [Yazid bin Khumair] dari [Abdullah bin Busr] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah bertamu di rumah bapakku, lalu kami hidangkan makanan dan Watbah (sejenis makanan yang terbuat dari campuran susu, kurma dan keju) kepadanya, dan beliaupun memakannya. kemudian dihidangkan kurma kepadanya, lalu beliau membuang biji (korma) dengan kedua jarinya, seraya menggabungkan antara jari telunjuk dan jari tengah. -Syu'bah berkata; 'Itulah menurut perkiraanku Insya Allah, yaitu beliau membuang bijinya di antara kedua jarinya.'- Kemudian dihidangkan air minum, beliau pun meminumnya, lalu memberikan minuman tersebut kepada orang yang ada di sebelah kanannya.\" Abdullah bin Busr berkata; Bapakku berkata seraya memegang kendali hewan tunggangannya; 'Do'akanlah kami! ' beliau berdoa: 'Ya Allah! Berilah keberkahan kepada mereka terhadap apa yang telah Engkau rizqikan kepada mereka serta ampuni dan kasihilah mereka'. Dan telah menceritakan kepada kami [Muhammad bin Basyar], Telah menceritakan kepada kami [Ibnu Abu 'Adi], demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakannya pula kepada kami [Muhammad bin Al Mutsanna], Telah menceritakan kepada kami [Yahya bin Hammad] keduanya dari [Syu'bah] dengan sanad ini. Keduanya tidak meragukan mengenai beliau membuang bijinya di antara kedua jari beliau",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 5329,
			"arabicnumber": "2042.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 5330,
			"arabicnumber": "2043",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan [Abdullah bin 'Aun Al Hilali], Yahya berkata; Telah mengabarkan kepadaku, sedang Ibnu 'Aun berkata; Telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Bapaknya] dari [Abdullah bin Ja'far] dia berkata; \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam memakan mentimun dengan ruthab (kurma basah yang baru matang)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 5331,
			"arabicnumber": "2044.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Sa'id Al Asyaj], keduanya dari [Hafs]. [Abu Bakr] berkata; Telah menceritakan kepada kami [Hafsh bin Giyats] dari [Mush'ab bin Sulaim], telah menceritakan kepada kami [Anas bin Malik] dia berkata; \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam makan kurma dalam keadaan duduk iq'a (posisi duduk tanpa kursi dengan menegakkan kedua kakinya)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 5332,
			"arabicnumber": "2044.02",
			"text": "Dan telah menceritakan kepada kami [Zuhair bin Harb] dan [Ibnu Abu Umar] -semuanya- dari [Sufyan], [Ibnu Abu Umar] berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Mush'ab bin Sulaim] dari [Anas], dia berkata; 'Nabi shallallahu 'alaihi wasallam di beri kurma, lalu beliau membelahnya (beliau dalam keadaan tidak tenang duduknya), beliau makan dengan cepat (karena lapar).' Dan di dalam riwayat Zuhair; 'Beliau makan dengan Hatsis (cepat)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 5333,
			"arabicnumber": "2045.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dia berkata; Aku mendengar [Jabalah bin Suhaim] berkata; 'Ibnu Jubair memberi kami kurma.' Jabalah berkata; \"Sementara orang-orang sedang ditimpa kesulitan, maka kami makan. Kemudian [Ibnu Umar] melewati kami yang sedang makan dan menegur; \"Jangan kalian berbuat Iqraan, karena Rasulullah Shallallahu'alaihi wasallam melarang Iqraan kecuali dengan meminta izin saudaranya.\" Syu'bah berkata: \"Tidak ada pendapatku dalam masalah idzin ini, selain itu hanyalah perkataan Ibnu Umar.\" Dan telah menceritakannya pula kepada kami ['Ubaidullah bin Mu'adz], Telah menceritakan kepada kami [Bapakku]. Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami [Muhammad bin Basyar], Telah menceritakan kepada kami [Abdurrahman bin Mahdi] keduanya dari [Syu'bah] -dengan sanad ini-, namun di dalam Hadits keduanya tidak disebutkan perkataan Syu'bah dan tidak pula perkataanya; 'Sementara orang-orang sedang ditimpa kepayahan",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 5334,
			"arabicnumber": "2045.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 5335,
			"arabicnumber": "2045.03",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Al Mutsanna] keduanya berkata; Telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari [Jabalah bin Suhaim] dia berkata; 'Aku mendengar [Ibnu Umar] berkata; 'Rasulullah Shallallah 'Alaihi Wa Sallam melarang seseorang mengambil dua butir kurma sekaligus kecuali setelah mendapat idzin dari teman-temannya",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 5336,
			"arabicnumber": "2046.01",
			"text": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman Ad Daarimi], telah mengabarkan kepada kami [Yahya bin Hassan], Telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak akan lapar penghuni rumah yang memiliki kurma",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 5337,
			"arabicnumber": "2046.02",
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nabi], Telah menceritakan kepada kami [Ya'qub bin Muhammad bin Thahlaa'] dari [Abu Rijal Muhammad bin Abdurrahman] dari [Ibunya] dari ['Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai 'Aisyah! Rumah yang di dalamnya tidak ada kurma, maka penghuninya akan lapar, Wahai 'Aisyah! Rumah yang di dalamnya tidak ada kurma, maka penghuninya akan lapar.\" Beliau mengucapkannya sebanyak dua atau tiga kali",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 5338,
			"arabicnumber": "2047.01",
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nabi] Telah menceritakan kepada kami [Sulaiman] yaitu Ibnu Bilal dari [Abdullah bin Abdurrahman] dari [Amir bin Sa'd bin Abu Waqqash] dari [Bapaknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang memakan tujuh butir kurma yang tumbuh diantara bebatuan hitam (di Madinah) pada pagi-pagi, dia tidak akan celaka oleh racun sampai petang",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 5339,
			"arabicnumber": "2047.02",
			"text": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah], Telah menceritakan kepada kami [Abu Usamah] dari [Hasyim bin Hasyim] dia berkata; Aku mendengar ' [Amir bin Sa'd bin Abu Waqqash] berkata; 'AKu mendengar [Sa'd] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang makan tujuh butir kurma 'Ajuwa pada pagi hari, maka pada hari itu dia tidak akan celaka oleh racun maupun sihir. Dan telah menceritakannya pula kepada kami [Ibnu Abu 'Umar] telah menceritakan kepada kami [Marwan Bin Mu'awiyah Al Fazari] Dan telah menceritakannya pula kepada kami [Ishaq bin Ibrahim], telah mengabarkan kepada kami [Abu Badr Syuja' bin Al Walid], keduanya dari [Hasyim bin Hasyim] dengan jalur ini, dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa, keduanya tidak mengatakan 'Aku mendengar Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 5340,
			"arabicnumber": "2047.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 5341,
			"arabicnumber": "2048",
			"text": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] dan [Yahya bin Ayyub] serta [Ibnu Hajar]. [Yahya bin Yahya] berkata; \"Telah mengabarkan kepada kami\". Sedangkan yang lain berkata; 'Telah menceritakan kepada kami'. Telah menceritakan kepada kami [Ismail] yaitu Ibnu Ja'far dari [Syarik] yaitu Ibnu Abu Namir dari [Abdullah bin Abu 'Atik] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kurma 'Ajuwa (jenis kurma yang baik yang tumbuh di dusun 'Aliyah daerah Madinah) mengandung obat, atau dia adalah penawar racun di pagi hari",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 5342,
			"arabicnumber": "2049.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Jarir]. Demikian juga diriwayatkan dari jalur lain, dan Telah menceritakan kepada kami [Ishaq bin Ibrahim], Telah mengabarkan kepada kami [Jarir] dan [Amru bin 'Ubaid] dari [Abdul Malik bin 'Umair] dari ['Amru bin Huraits] dari [Sa'id bin Zaid bin Amru bin Nufail] dia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Al Kam-at (cendawan) sejenis manna (sejenis makanan yang diturunkan Allah Ta'ala kepada Bani Israil), airnya mengandung obat bagi penyakit mata",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 5343,
			"arabicnumber": "2049.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 5344,
			"arabicnumber": "2049.03",
			"text": "Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna], Telah menceritakan kepada kami [Muhammad bin Ja'far], Telah menceritakan kepada kami [Syu'bah] dari [Abdul Malik bin 'Umair] dia berkata; 'Aku mendengar [Amru bin Huraits] berkata; 'Aku mendengar [Sa'id bin Zaid] dia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Al Kam-at (cendawan) sejenis manna (sejenis makanan yang diturunkan Allah Ta'ala kepada Bani Israil), airnya mengandung obat bagi penyakit mata.\" Dan Telah menceritakan pula kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepadaku [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dia berkata; Telah mengabarkan kepadaku [Al Hakam bin 'Utaibah] dari [Al Hasan Al 'Urani] dari ['Amru bin Huraits] dari [Sa'id bin Zaid] dari Nabi shallallahu 'alaihi wasallam. [Syu'bah] berkata; 'Tatkala Al Hakam menceritakannya kepadaku, aku tidak mengingkarinya kalau itu adalah Hadits yang diriwayatkan oleh Abdul Malik",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 5345,
			"arabicnumber": "2049.04",
			"text": "Telah menceritakan kepada kami [Sa'id bin 'Amru Al Asy 'Atsi], Telah mengabarkan kepada kami ['Abtsar] dari [Mutharrif] dari [Al Hakam] dari [Al Hasan] dari [Amru bin Huraits] dari [Sa'id bin Zaid bin Amru bin Nufail] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Al Kam-at (cendawan) adalah bagian dari sejenis manna (sejenis makanan) yang diturunkan Allah Ta'ala kepada Bani Israil, airnya mengandung obat bagi penyakit mata",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 5346,
			"arabicnumber": "2049.05",
			"text": "Dan Telah menceritakan kepada kami [Ishaq bin Ibrahim] Telah mengabarkan kepada kami [Jarir] dari [Muththarrif] dari [Al Hakam bin 'Utaibah] dari [Al Hasan Al 'Urani] dari ['Amru bin Huraits] dari [Sa'id bin Zaid] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Al Kam-at (cendawan) adalah diantara sejenis manna (sejenis makanan) yang diturunkan Allah kepada Musa, airnya mengandung obat bagi penyakit mata",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 5347,
			"arabicnumber": "2049.06",
			"text": "Telah menceritakan kepada kami [Ibnu Abu 'Umar] Telah menceritakan kepada kami [Sufyan] dari ['Abdul Malik bin 'Umair] dia berkata; 'Aku mendengar [Amru bin Huraits] berkata; 'Aku mendengar [Sa'id bin Zaid] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Al Kam-at (cendawan) adalah diantara sejenis manna (sejenis makanan) yang diturunkan Allah kepada bani Israil, airnya mengandung obat bagi penyakit mata",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 5348,
			"arabicnumber": "2049.07",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Hubib Al Haritsi] Telah menceritakan kepada kami [Hammad bin Zaid], Telah menceritakan kepada kami [Muhammad bin Syabib] dia berkata; Aku mendengarnya dari [Sahr bin Hausyab] lalu aku menanyakannya, dia menjawab; Aku mendengarnya dari ['Abdul Malik bin 'Umair] dia berkata; Aku bertemu dengan Abdul Malik dan dia menceritakan kepadaku; dari [Amru bin Huraits] dari [Sa'id bin Zaid] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Al Kam-at (cendawan) adalah diantara sejenis manna (sejenis makanan), airnya mengandung obat bagi penyakit mata",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 5349,
			"arabicnumber": "2050",
			"text": "Telah menceritakan kepadaku [Abu At Thahir], Telah mengabarkan kepada kami [Abdullah bin Wahab] dari [Yunus] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] dari [Jabir bin Abdullah] dia berkata; Kami pernah bersama Nabi shallallahu 'alaihi wasallam di Marr Zhahran dan kami memetik buah yang matang dari pohon arok maka (Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ambillah yang hitam.\" (Jabir bin Abdullah) berkata; kami bertanya: \"Wahai Rasulullah apakah anda pernah mengembala kambing?\" beliau bersabda: \"Ya, bukankah tidak ada seorang Nabi pun melainkan dia pernah mengembala kambing!\" -Atau yang serupa dengan perkataan ini",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 5350,
			"arabicnumber": "2051.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 5351,
			"arabicnumber": "2051.02",
			"text": "Telah menceritakan kepadaku [Abdullah bin Abdurrahman Ad Darimi], telah mengabarkan kepadaku [Yahya bin Hassan] telah mengabarkan kepada kami [Sulaiman bin Bilal] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik lauk pauk adalah cuka. Dan Telah menceritakannya pula kepada kami [Musa bin Quraisy bin Nafi' At Tamimi], Telah menceritakan kepada kami [Yahya bin Shalih Al Wuhazhi], Telah menceritakan kepada kami [Sulaiman bin Bilal] dengan sanad ini, dan dia berkata; 'Sebaik-baik lauk pauk -dengan tidak ada keraguan",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 5352,
			"arabicnumber": "2052.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Abu Sufyan] dari [Jabir bin Abdullah] bahwa Nabi shallallahu 'alaihi wasallam bertanya kepada istrinya-istrinya mengenai lauk, lalu mereka menjawab; \"Kita tidak punya apa-apa selain cuka.\" Beliau menyuruh diambilkan kemudian beliau makan dengan cuka tersebut sambil bersabda: 'Sebaik-baik lauk adalah cuka, sebaik-baik lauk adalah cuka",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 5353,
			"arabicnumber": "2052.02",
			"text": "Telah menceritakan kepadaku [Ya'qub bin Ibrahim Ad Dauraqi], Telah menceritakan kepada kami [Ismail] yaitu Ibnu 'Ulayyah dari [Al Mutsanna bin Sa'id], Telah menceritakan kepadaku [Thalhah bin Nafi'] bahwa dia mendengar [Jabir bin Abdullah] berkata; 'Suatu hari aku diajak Rasulullah shallallahu 'alaihi wasallam ke rumahnya, kemudian beliau mengeluarkan sepotong roti. Beliau bertanya kepada istri-istrinya: \"Apakah ada lauk pauk?\" Mereka menjawab; 'Tidak ada, kecuali sedikit cuka. Lalu beliau bersabda: 'Sesungguhnya cuka adalah sebaik-baik lauk.' Jabir berkata; 'Aku menyukai cuka sejak aku mendengarnya dari Nabiyullah shallallahu 'alaihi wasallam. Dan Thalhah berkata; Aku menyukai cuka sejak aku mendengarnya dari JabirTelah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] Telah menceritakan kepadaku [Bapaku], Telah menceritakan kepada kami [Al Mutsanna bin Sa'id] dari [Thalhah bin Nafi'], Telah menceritakan kepada kami [Jabir bin Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam, mengajak dia ke rumahnya seperti yang disebutkan pada Hadits 'Ulayyah hingga sabda beliau: 'Sebaik-baik lauk adalah cuka.' Tanpa menyebutkan kalimat lain sesudah itu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 5354,
			"arabicnumber": "2052.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 5355,
			"arabicnumber": "2052.04",
			"text": "Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah], Telah menceritakan kepada kami [Yazid bin Harun] Telah mengabarkan kepada kami [Hajjaj bin Abu Zainab], Telah menceritakan kepadaku [Abu Sufyan Thalhah bin Nafi'] dia berkata; Aku mendengar [Jabir bin 'Abdullah] radliallahu 'anhu berkata: \"Pada suatu hari aku sedang duduk di rumahku, tiba-tiba Rasulullah shallallahu 'alaihi wasallam lewat. Beliau memberi isyarat kepadaku lalu aku berdiri menemui beliau. Beliau memegang tanganku (mengajakku pergi bersama beliau). Kami berjalan hingga sampai ke rumah salah seorang isteri beliau. Beliau masuk dan mempersilahkanku pula masuk. Karena itu aku masuk sampai ruangan dalam. Beliau bertanya kepada isterinya: 'Adakah kamu sedia makanan? ' Jawab mereka; 'Ada! ' Maka dibawanya tiga buah roti lalu dihidangkannya ke hadapan Rasulullah shallallahu 'alaihi wasallam. Beliau ambil sebuah lalu di letakkannya dihadapan beliau, kemudian diambilnya sebuah lagi lalu diletakkannya di hadapanku. Sesudah itu yang ketiga dipatahkan, separuhnya diambil oleh beliau dan separuhnya lagi diletakkannya di hadapanku. Kemudian beliau bertanya: 'Apakah ada lauk pauk? ' Mereka Menjawab; 'Tidak ada apa-apa selain cuka.' Kata beliau: 'Bawalah kemari! Sebaik-baik lauk adalah cuka",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 5356,
			"arabicnumber": "2053.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] lafazh ini milik Ibnu Al Mutsanna keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far], Telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] dari [Jabir bin Samurah] dari [Abu Ayyub Al Anshari] dia berkata; Rasulullah shallallahu 'alaihi wasallam apabila diberi makanan oleh seseorang, beliau makan dan sebagian lagi diberikannya kepadaku. Pada suatu hari beliau memberikan kepadaku makanan yang tidak dimakannya karena di dalamnya ada bawang putih. Lalu kutanya; 'Apakah bawang putih itu haram? ' Jawab beliau: 'Tidak! Tetapi aku tidak suka karena baunya.' Kata Abu Ayyub; 'Kalau begitu, aku juga tidak suka apa yang Anda tidak sukai.' Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna], Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] mengenai sanad ini",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 5357,
			"arabicnumber": "2053.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 5358,
			"arabicnumber": "2053.03",
			"text": "Dan telah menceritakan kepadaku [Hajjaj bin As Syaa'ir] dan [Ahmad bin Sa'id bin Shakhr] lafazh dari keduanya hampir mirip. Keduanya berkata; Telah menceritakan kepada kami [Abu An Nu'man], Telah menceritakan kepada kami [Tsabit] dalam riwayat Hajjaj bin Yazid Abu Zaid Al Ahwal, Telah menceritakan kepada kami ['Ashim bin Abdullah bin Al Harits] dari [Aflah] -budak- Abu Ayyub dari [Abu Ayyub] bahwa Nabi Shallallah 'Alaihi Wa Sallam singgah di rumahnya. Lalu Beliau bermalam dan tinggal di bagian bawah sementara Abu Ayyub Al Anshari berada diatas. Pada suatu malam Abu Ayyub Al Anshari terbangun, ia (Abu Ayyub Al Anshari) berkata; Kami berjalan diatas kepala Rasulullah Shallallahu 'alaihi wa Salam? Lalu dia pindah dan tidur bersama keluarganya disebelahnya. Abu Ayyub Al Anshari menyebutkan hal itu kepada Nabi Shallallahu 'alaihi wa Salam lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Di bawah lebih bermanfaat bagiku.\" Abu Ayyub Al Anshari berkata: Aku tidak akan tinggal di atas loteng sementara anda berada dibawahnya.\" Lalu Abu Ayyub Al Anshari pindah ke bawah sementara Nabi shallallahu 'alaihi wasallam pindah ke atas. Abu Ayyub Al Anshari juga membuatkan makanan untuk Nabi Shallallahu 'alaihi wa Salam. Bila tempat makanan di kembalikan Abu Ayyub Al Anshari bertanya dimanakah tempat jari-jari Nabi shallallahu 'alaihi wasallam, lalu ia makan pada bekas jari-jari Nabi Shallallahu 'alaihi wa Salam. Pernah juga dia membuatkan makanan yang di dalamnya ada bawang putihnya. Tatkala bekas piring beliau di kembalikan, dia bertanya bekas jari-jari Nabi shallallahu 'alaihi wasallam, dikatakan padanya; 'Rasulullah Shallallahu 'alaihi wa Salam tidak makan.' Abu Ayyub Al Anshari kaget dan segera naik ke atas, dia bertanya: 'Apakah makanan itu haram? Nabi shallallahu 'alaihi wasallam bersabda: 'Tidak, aku cuman tidak menyukainya.' Abu Ayyub Al Anshari berkata; 'Sesungguhnya aku juga membenci yang anda benci. (Dan Nabi Shallallahu 'alaihi wa Salam pada waktu itu sering di datangi malaikat dan wahyu)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 5359,
			"arabicnumber": "2054.01",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb], Telah menceritakan kepada kami [Jarir bin Abdul Hamid] dari [Fudhail bin Ghazawan] dari [Abu Hazim Al Asyja'i] dari [Abu Hurairah] dia berkata; \"Seorang laki-laki datang kepada Rasulullah shallallahu 'alaihi wasallam lalu dia berkata: 'Aku berada dalam kesulitan (susah hidup dan lapar).' Maka beliau bawa orang itu ke rumah sebagian istri-istri beliau, menanyakan kalau-kalau mereka memiliki makanan. Para isteri beliau menjawab; 'Demi Allah yang mengutus Anda dengan kebenaran, Aku tidak sedia apa-apa selain air.' Begitulah jawaban mereka masing-masing hingga seluruh istri beliau mengatakan dengan jawaban yang sama. Lalu beliau bersabda kepada para sahabat: 'Siapa bersedia menjamu tamu malam ini niscaya dia diberi rahmat oleh Allah Ta'ala.' Maka berdirilah seorang laki-laki Anshar seraya berkata; 'Aku, ya Rasulullah! ' kemudian dibawalah orang itu ke rumahnya. Dia bertanya kepada isterinya; 'Adakah engkau sedia makanan? ' Jawab isterinya; 'Tidak ada, kecuali makanan anak-anak.' Katanya; 'Alihkan perhatian mereka dengan apa saja. Dan bila tamu kita telah datang, matikanlah lampu dan tunjukkan kepadanya bahwa kita seolah-olah ikut makan bersamanya. Caranya bila dia telah mulai makan, berdirilah ke dekat lampu lalu padamkan. Maka duduklah mereka, dan sang tamu pun makan. Setelah Subuh, sahabat tersebut bertemu dengan Nabi shallallahu 'alaihi wasallam. Lalu kata beliau: 'Sungguh Allah kagum dengan cara kamu berdua melayani tamu kalian tadi malam",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 5360,
			"arabicnumber": "2054.02",
			"text": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al 'Allaa'i], Telah menceritakan kepada kami [Waki'] dari [Fudhail bin Ghazawan] dari [Abu Hazim] dari [Abu Hurairah]; \"Seorang laki-laki Anshar kedatangan tamu dan bermalam di rumahnya. Padahal dia tidak mempunyai makanan selain makanan anak-anaknya. Maka dia berkata kepada isterinya; 'Tidurkan anak-anak dan padamkan lampu. Sesudah itu suguhkan kepada tamu kita apa adanya.' Kata Abu Hurairah; 'Karena peristiwa itu maka turunlah ayat: 'Dan mereka lebih mementingkan tamu dari diri mereka sendiri, sekalipun mereka dalam keadaan kesusahan……………' (Al Hasyr 59: 9).' Dan telah menceritakannya kepada kami [Abu Kuraib], Telah menceritakan kepada kami [Ibnu Fudhail] dari [bapaknya] dari [Ibnu Hazim] dari [Abu Hurairah] dia berkata; Seorang laki-laki datang ke rumah Rasulullah shallallahu 'alaihi wasallam hendak bertamu, namun beliau shallallahu 'alaihi wasallam tidak memiliki sesuatupun untuk menjamunya. Kemudian beliau bersabda kepada para sahabatnya: 'Siapa bersedia menjamu tamu malam ini niscaya dia diberi rahmat oleh Allah Ta'ala.' Maka berdirilah seorang laki-laki Anshar yang bernama Abu Thalhah seraya berkata; 'Aku, ya Rasulullah! ' kemudian dibawalah orang itu ke rumahnya. Kemudian dia menyebutkan Hadits yang serupa dengan Hadits Ibnu Jarir. Dan di dalamnya disebutkan mengenai turunnya ayat sebagaimana disebutkan oleh Waki",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 5361,
			"arabicnumber": "2054.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 5362,
			"arabicnumber": "2055.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Syababah bin Sawwar]; Telah menceritakan kepada kami [Sulaiman bin Al Mughirah] dari [Tsabit] dari ['Abdurrahman bin Abu Laila] dari [Al Miqdad] ia berkata; \"Saya dan dua orang teman saya datang -sedangkan pada saat itu pendengaran dan penglihatan saya sudah tidak berfungsi lagi karena sakit yang pernah saya alami.\" Al Miqdad berkata; \"Kami mulai menyerahkan diri kami (memohon bantuan) kepada para sahabat Rasulullah shallallahu 'alaihi wasallam, tapi tidak seorang pun dari mereka yang sudi menerima kami. Akhirnya, kami mendatangi Rasulullah shallallahu 'alaihi wasallam dan beliau pun mengajak pergi menuju keluarga beliau. Ternyata di rumah beliau ada tiga ekor kambing. Lalu beliau berkata: \"Perahlah susu kambing itu untuk kita minum bersama!\" Al Miqdad berkata; \"Lalu kami memerah susu kambing itu dan setiap orang dari kami pun meminum jatahnya masing-masing. Setelah itu, kami menyimpan susu jatah Rasulullah shallallahu 'alaihi wasallam. Kata Al Miqdad; \"Sebagian malam telah berlalu, kemudian Rasulullah shallallahu 'alaihi wasallam mengucapkan salam yang tidak sampai membangunkan orang tidur, tetapi dapat didengar oleh orang yang terjaga.\" Al Miqdad berkata; \"Rasulullah shallallahu 'alaihi wasallam datang ke masjid lalu beliau melaksanakan shalat. Setelah itu, beliau mendekati minumannya untuk diminum.\" Pada malam itu, ketika saya telah meminum jatah minuman saya, tiba-tiba saya tergoda oleh bisikan syetan yang selalu terngiang di telinga saya; \"Muhammad mendatangi orang-orang Anshar dan mereka pun menjamunya. Setelah itu, ia (Muhammad) mendapat jamuan di tengah mereka, hingga ia (Muhammad) tidak membutuhkan minumannya yang tersisa.\" Lalu saya dekati minuman beliau yang tersisa itu dan langsung saya meminumnya. Setelah minuman Rasulullah itu masuk ke dalam perut saya, dan tentunya tidak mungkin bagi saya untuk mengeluarkannya kembali, maka syetan membisikkan rasa penyesalan ke dalam hati saya; \"Hai celaka sekali kamu ini, \" seru syetan.\" Apa yang telah kamu lakukan? Mengapa kamu meminum habis minuman Muhammad itu? Bagaimana nanti, apabila Muhammad datang dan ia tidak mendapatkan lagi minumannya, hingga akhirnya ia mendo'akan kecelakaan bagimu dan kamu akan celaka di dunia dan akhirat?\" kebetulan pada saat itu saya tengah mengenakan jubah, yang apabila saya tutupkan sampai kedua telapak kaki saya pasti akan nampak kepala saya. Sebaliknya, apabila saya tutupkan kepala saya, maka kedua telapak kaki saya pasti akan nampak. Oleh karena itu, saya tidak dapat tidur dengan tenang. Sementara kedua teman saya, sepertinya mereka berdua dapat tidur dengan nyenyak karena mereka tidak berbuat seperti apa yang telah saya perbuat. Al Miqdad berkata; \"Tak lama kemudian Rasulullah shallallahu 'alaihi wasallam datang dan memberi salam seperti biasanya. Setelah itu, beliau pergi ke masjid untuk melaksanakan shalat. Usai melaksanakan shalat, beliau pun langsung menghampiri minumannya untuk diminumnya. Tetapi, beliau mendapatkan minuman yang ada di dalam gelas itu telah habis. Akhirnya, beliau menengadahkan wajahnya ke langit. Batin saya mengatakan; \"Mungkin Rasulullah sekarang akan mendo'akan kecelakaan untuk saya, selaku orang yang telah menghabiskan minumannya itu.\" Tetapi, ternyata beliau malah berdo'a: \"Ya Allah, berilah makan orang yang telah memberiku makan dan berilah minum orang yang telah memberiku minum.\" Al Miqdad berkata; \"Akhirnya saya singsingkan jubah saya, lalu saya ambil pisau, dan saya pergi menuju kandang kambing saya. Saya pilih kambing yang paling gemuk untuk saya sembelih sebagai makanan bagi Rasulullah shallallahu 'alaihi wasallam. Ketika saya sembelih, ternyata kambing-kambing itu mengandung susu yang sangat banyak, hingga saya segera meminjam wadah kepada keluarga Rasulullah, yang sebelumnya mereka jarang sekali mempergunakan wadah tersebut untuk memerah kambing. Akhirnya saya perah susu kambing itu hingga memenuhi wadah-wadah tersebut. Setelah itu, saya pun menghampiri Rasulullah shallallahu 'alaihi wasallam. Lalu beliau berkata: \"Apakah kalian telah meminum minuman kalian tadi malam?\" Saya berkata; \"Ya Rasulullah, silahkan Anda mencicipi susu kambing ini!\" Kemudian beliau pun meminumnya dengan senang. Setelah itu beliau minta minum lagi. Lalu saya mempersilahkan beliau untuk meminum susu tersebut. Maka beliau pun meminumnya dan setelah itu beliau masih minta lagi. Setelah saya tahu Rasulullah telah merasa lega dan saya telah dapat memenuhi permintaannya, maka saya pun merasa senang hingga saya terjatuh ke tanah. Rasulullah bertanya; \"Hai Miqdad, apakah ada salah satu perbuatanmu yang buruk?\" Saya menjawab; \"Ya, sebenarnya tadi malam saya begini dan begitu, hingga akhirnya saya telah melakukan ini dan itu.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebenarnya hal itu merupakan rahmat dari Allah. Sayangnya, mengapa kamu tidak memberitahu kepadaku hingga kita dapat membangunkan kedua teman kita dan turut serta pula minum bersama kita?\" Al Miqdad berkata; \"Demi Dzat yang telah mengutus engkau, aku tidak peduli jika engkau telah mencicipi air susu ini bersama saya, kemudian ingin bersama para sahabat lainnya lagi.\" Dan telah menceritakan kepada kami [Ishaq bin Ibrahim], telah mengabarkan kepada kami [An Nadhr bin Syumail] telah menceritakan kepada kami [Sulaiman bin Al Mughirah] dengan sanad yang serupa",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 5363,
			"arabicnumber": "2055.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 5364,
			"arabicnumber": "2056",
			"text": "Dan telah menceritakan kepada kami ['Ubaidullah bin Mu'adz Al 'Anbari] dan [Hamid bin Al Bakrawi] dan [Muhammad bin 'Abdul A'la] seluruhnya dari [Al Mu'tamir bin Sulaiman] dan lafazh ini milik Ibnu Mu'adz; Telah menceritakan kepada kami [Al Mu'tamar]; Telah menceritakan kepada kami [Bapakku] dari [Abu 'Utsman]; dan telah menceritakan kepada kami pula ['Abdurrahman bin Abu Bakr] ia berkata; \"Kami sejumlah seratus tiga puluh orang bersama Rasulullah shallallahu 'alaihi wasallam. Lalu beliau bertanya; 'Apakah salah seorang di antara kalian ada yang memiliki makanan?\" Ternyata ada seorang sahabat yang membawa satu sha' makanan atau kurang lebih satu sha'. Lalu dibuatlah adonan. Tak lama kemudian, ada seorang musyrik yang tinggi, kurus, dan berambut kusut sambil mengiring kambing. Maka Rasulullah bertanya kepadanya: 'Apakah kambing ini dijual atau dihadiahkan? ' Orang musyrik itu menjawab; 'Kambing ini dijual.' Akhirnya Rasulullah membeli kambing tersebut darinya, lalu disembelih dan beliau memerintahkan agar hati kambing itu dipanggang. Abdurrahman berkata; 'Demi Allah, setiap sahabat yang berjumlah seratus tiga puluh itu mendapat jatah dari kambing panggang Rasulullah shallallahu 'alaihi wasallam. Jika kebetulan orangnya hadir, maka Rasulullah menyimpan jatahnya. Abdurrahman berkata; 'Rasulullah shallallahu 'alaihi wasallam membagi daging kambing tersebut menjadi dua periuk dan kami semua memakannya hingga kenyang. Lebih dari itu, kami pun tidak sanggup untuk menghabiskannya. Lalu sisanya dalam dua periuk itu kami angkut dengan unta. Atau kira-kira seperti itulah yang dia ceritakan",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 5365,
			"arabicnumber": "2057.01",
			"text": "Telah menceritakan kepada kami ['Ubaidullah bin Mu'adz Al 'Anbiri] dan [Hamid bin 'Umar Al Bakrawi] dan [Muhammad bin Abdul A'la Al Qaisi] seluruhnya dari [Al Mu'tamir] dan lafazh ini miliknya Ibnu Mu'adz; Telah menceritakan kepada kami [Al Mu'tamar bin Sulaiman] ia berkata; Berkata [Bapakku]; Telah menceritakan kepada kami [Abu 'Utsman]; telah menceritakan kepadanya ['Abdurrahman bin Abu Bakr] bahwasanya kaum Shuffah, (orang-orang yang tinggal di emperan masjid Nabawi), adalah orang-orang yang fakir. Pada suatu hari, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa memiliki makanan untuk dua orang, maka makanlah dengan tiga orang. Barang siapa yang memiliki makanan untuk empat orang, maka makanlah oleh lima atau enam orang.\" Atau kira-kira demikianlah yang beliau sabdakan. Abu Bakar pernah datang bersama tiga orang, sedangkan Nabi Muhammad shallallahu 'alaihi wasallam datang bersama sepuluh orang. Sementara itu, tiga orang yang bersama Abu Bakar adalah saya, ayah saya dan ibu saya. (saya tidak tahu apakah ia menuturkan; istri saya dan pelayan di rumah kami dan rumah Abu Bakar). Abdurrahman berkata; 'Abu Bakar radliallahu 'anhu makan malam di tempat Rasulullah shallallahu 'alaihi wasallam dan ia pun belum pulang hingga usai shalat Isya. Sepertinya Rasulullah sudah mengantuk, lalu Abu Bakar pulang dan tiba di rumah setelah sebagian malam telah berlalu. Kemudian Abu Bakar ditanya istrinya; 'Wahai suamiku, mengapa kamu biarkan saja tamu-tamumu? ' Abu Bakar malah balik bertanya kepada istrinya; 'Apakah kamu belum memberi mereka makan malam? ' Istrinya menjawab; 'Mereka tidak mau makan sebelum kamu datang. Sebenarnya makanan itu telah dihidangkan, tetapi mereka tetap tidak mau makan juga.' Abdurrahman berkata; 'Lalu saya keluar untuk menyelinap.' Abu Bakar berkata; 'Hai Ghuntsar! ' Rupanya Abu Bakar berkata tidak enak (karena mencari saya) dan mempersilahkan para tamunya; 'Silahkan menikmati hidangan kami seadanya ini! ' Abu Bakar berkata; 'Demi Allah, saya tidak turut mencicipinya.' Abdurrahman berkata; 'Demi Allah, setiap kami mengambil sesuap dari makanan itu, maka makanan tersebut selalu bertambah banyak, hingga kami merasa kenyang dan makanan itu menjadi lebih banyak dari sebelumnya.' Melihat makanan yang tidak berkurang sama sekali atau bahkan bertambah banyak, maka Abu Bakar pun berkata kepada istrinya; 'Hai saudara perempuan Bani Firas, keajaiban apa ini? ' Istrinya menjawab; 'Demi buah hatiku, sungguh makanan itu bertambah banyak tiga kali lipat dari sebelumnya.' Abdurrahman berkata; \"Abu Bakar hanya mencicipi sebagian makanan itu seraya mengatakan sesuatu kepada istrinya, 'Hai istriku, sesungguhnya sumpahmu itu dari syetan.' Ternyata Abu Bakar hanya mencicipi sesuap saja dari makanan tersebut. Setelah itu, dibawanya makanan itu kepada Rasulullah shallallahu 'alaihi wasallam, hingga ia berada di sisi beliau. Abdurrahman berkata; \"Kami mempunyai perjanjian dengan suatu kaum sedangkan batas waktunya telah berlalu. Kemudian kami mempersilahkan dua belas orang untuk makan yang masing-masing disertai anak buah beberapa orang. Hanya Allahlah Yang Maha mengetahui berapa jumlah anak buah masing-masing dari dua belas orang tersebut. 'Abdurrahman berkata; \"Yang jelas, masing-masing orang disertai beberapa anak buah. Mereka kemudian makan semuanya.\" (Kira-kira demikianlah yang dia sampaikan)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 5366,
			"arabicnumber": "2057.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami [Salim bin Nuh Al 'Aththar] dari [Al Jurairi] dari [Abu 'Utsman] dari ['Abdurrahman bin Abu Bakr] ia berkata; 'Beberapa tamu kami singgah di rumah kami.' Abdurrahman berkata; 'Sedangkan pada malam itu Ayahku ada janji untuk berbincang-bincang dengan Rasulullah shallallahu 'alaihi wasallam. Maka Abu Bakr berajak pergi seraya mengatakan; 'Wahai Abdurrahman, layani tamu-tamumu dengan baik! ' Abdurrahman berkata; 'Pada sore harinya, aku melayani tamu-tamu dengan menyuguhkan hidangan untuk mereka, namun mereka menolaknya seraya berkata; 'Tunggulah, sampai tuan rumah ini datang, hingga dia bisa makan bersama kami.' Abdurrahman berkata; 'Maka aku katakan kepada mereka; 'Dia itu orangnya keras, apabila kalian tidak menyantap apa yang aku hidangkan, aku takut ayahku memarahiku. Abdurrahman berkata; 'Namun mereka tetap menolaknya.' Tatkala Abu Bakr datang, sedangkan di antara mereka belum ada yang menyentuhnya sama sekali. Abu Bakr bertanya kepada mereka; 'Apakah kalian sudah selesai menikmati hidangan kami? ' Abdurrahman berkata; maka mereka menjawab; 'Demi Allah, belum.' Abu Bakr berkata; Bukankah aku telah menyuruh Abdurrahman? Abdurrahman berkata; 'Maka akupun menjauh dari Abu Bakr, namun dia segera memanggilku; 'Wahai Abdurrahman! ' Abdurrahman berkata; 'namun aku terus menghindar darinya.' Maka Abu Bakr memanggilku; Ya Guntsar! (kalimat menghardik) 'Saya bersumpah kepadamu jika kamu mendengar suaraku, maka datanglah! Abdurrahman berkata; Maka aku pun datang seraya kukatakan; 'Demi Allah, aku tidak bersalah, mereka itu tamu Ayah, maka tanyalah mereka. Aku telah melayani dan menjamu mereka, namun mereka menolak menyantap hidangan sampai ayah datang.' Abdurrahman berkata; Maka Abu Bakr bertanya; 'Kenapa kalian tidak mau menyantap hindangan yang kami berikan kepada kalian? ' Abdurrahman berkata; Maka Abu Bakr berkata; 'Demi Allah, Aku tidak akan makan malam ini! ' Abdurrahman berkata; lalu mereka berkata; 'Demi Allah, kami tidak memakannya sampai anda memakannya.' Abu Bakr berkata; 'Aku sama sekali tidak pernah melihat keburukan seperti yang terjadi malam ini.' Celakalah kalian kenapa kalian tidak mau menerima hidangan kami? Abdurrahman berkata; kemudian Abu Bakr berkata; 'Sumpah kalian tadi itu adalah dari syetan, ayo santaplah hidangan kalian.' Maka makananpun disodorkan kepada mereka. Abu Bakr berdo'a terlebih dahulu lalu makan, kemudian mereka pun ikut makan. Abdurrahman berkata; 'Di pagi harinya Abu Bakr menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata; 'Ya Rasulullah, para tamuku telah berbuat kebaikan dengan menepati sumpahnya. Sedangkan aku telah melanggar sumpahku.Abdurrahman berkata; Abu Bakr menceritakan kejadian tadi malam kepada Rasulullah, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidak, bahkan kamu yang paling baik dan lebih utama dari mereka. Abdurrahman berkata; 'Aku tidak mendengar ada kafarah (penebus) terhadap sumpah tersebut",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 5367,
			"arabicnumber": "2058",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku membaca Hadits dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Makanan untuk dua orang cukup untuk dimakan tiga orang, dan makanan tiga orang cukup dimakan untuk empat orang",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 5368,
			"arabicnumber": "2059.01",
			"text": "Telah menceritakan kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami [Rauh 'Ubadah]; Demikian juga telah diriwayatkan dari jalur yang lain; Telah menceritakan kepadaku [Yahya bin Habib]; Telah menceritakan kepada kami [Rauh]; Telah menceritakan kepada kami [Ibnu Juraij]; Telah mengabarkan kepadaku [Abu Az Zubair]; Bahwasanya dia telah mendengar [Jabir bin 'Abdullah] berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Makanan untuk seorang cukup untuk dua orang, makanan dua orang cukup untuk empat orang, dan makanan empat orang cukup untuk delapan orang.\" Dan di dalam riwayat Ishaq, Rasulullah shallallahu 'alaihi wasallam bersabda: … (dengan tidak menyebutkan lafazh 'Aku mendengar Rasulullah shallallahu 'alaihi wasallam'..). Telah menceritakan kepada kami [Ibnu Numair], Telah menceritakan kepada kami [Bapakku], Telah menceritakan kepada kami [Sufyan]. Demikian juga diriwayatkan dari jalur lain, dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna], Telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari [Abu Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam seperti Hadits yang diriwayatkan Ibnu Juraij",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 5369,
			"arabicnumber": "2059.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 5370,
			"arabicnumber": "2059.03",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya], [Abu Bakr bin Abu Syaibah], [Abu Kuraib], dan [Ishaq bin Ibrahim]. [Abu Bakr] dan [Abu Kuraib] berkata; 'Telah menceritakan kepada kami.' Sedangkan yang lainnya berkata; 'Telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'Masy] dari [Abu Sufyan] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Makanan untuk satu orang cukup untuk dimakan dua orang, dan makanan dua orang cukup dimakan untuk empat orang",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 5371,
			"arabicnumber": "2059.04",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Utsman bin Abu Syaibah] keduanya berkata; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] dari Nabi Shallallah 'Alaihi Wa Sallam: \"Makanan untuk satu orang cukup untuk dimakan dua orang, dan makanan dua orang cukup dimakan untuk empat orang, dan makanan untuk empat orang cukup dimakan untuk delapan orang",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 5372,
			"arabicnumber": "2060.01",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb], [Muhammad bin Al Mutsanna] dan [Ubaidullah bin Sa'id] mereka berkata; telah mengabarkan kepada kami [Yahya] yaitu Al Qaththan dari [Ubaidullah] telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] dari Nabi Shallallah 'Alaihi Wa Sallam beliau bersabda: \"Orang-orang kafir makan dengan tujuh usus (perut), dan orang mukmin makan dengan satu usus (perut).\" Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair], Telah menceritakan kepada kami [Bapakku], demikian juga di riwayatkan dari jalur lain, Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah], Telah menceritakan kepada kami [Abu Usamah] dan [Ibnu Numair] keduanya berkata; Telah menceritakan kepada kami [Ubaidullah], Demikian juga telah diriwayatkan dari jalur yang lain, dan telah menceritakan kepadaku [Muhammad bin Rafi'] dan [Abad bin Humaid], dari [Abdur Razak] dia berkata; telah mengabarkan kepada kami [Ma'mar] dari [Ayyub] keduanya dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 5373,
			"arabicnumber": "2060.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 5374,
			"arabicnumber": "2060.03",
			"text": "Dan telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili]; Telah menceritakan kepada kami [Muhammad bin Jabir'far]; Telah menceritakan kepada kami [Syu'bah] dari [Waqid bin Muhammad bin Zaid] bahwa dia mendengar [Nafi'] berkata; \"Ibnu Umar melihat seorang miskin, kemudian dia menyuguhkan makanan kepadanya, lalu menyuguhkan lagi, orang itu makan dengan banyak, maka [Ibnu Umar] berkata; \"Orang ini tidak boleh datang kepadaku karena Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang kafir makan dengan tujuh usus",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 5375,
			"arabicnumber": "2061.01",
			"text": "Telah menceritakan kepadaku [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami ['Abdurrahman] dari [Sufyan] dari [Abu Zubair] dari [Jabir] dan [Ibnu 'Umar]; Bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang mukmin makan dengan satu usus (perut) sedangkan orang kafir makan dengan tujuh usus (perut).\" Dan telah menceritakan kepada kami [Ibnu Numair]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Sufyan] dari [Abu Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa, namun dia tidak menyebutkan Ibnu Umar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 5376,
			"arabicnumber": "2061.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 5377,
			"arabicnumber": "2062.01",
			"text": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al 'Ala]; Telah menceritakan kepada kami [Abu Usamah]; Telah menceritakan kepada kami [Buraid] dari [Kakeknya] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Orang mukmin makan dengan satu usus (perut) sedangkan orang kafir makan dengan tujuh usus (perut).\" Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami ['Abdul'Aziz] yaitu Ibnu Muhammad dari [Al 'Ala] dari [Bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 5378,
			"arabicnumber": "2062.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 5379,
			"arabicnumber": "2063",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Rafi']; Telah menceritakan kepada kami [Ishaq bin 'Isa]; Telah mengabarkan kepada kami [Malik] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam kedatangan tamu orang kafir. Lalu Rasulullah shallallahu 'alaihi wasallam menyuruh pembantunya memerah susu seekor kambing untuk tamu, lalu diminum habis oleh tamu tersebut. Kemudian beliau menyuguhkan lagi, dan habis pula diminumnya. Di suguhkannya lagi, ia pun masih tetap meminumnya, sehingga akhirnya dia meminum habis susu perahan tujuh ekor kambing. Beberapa waktu kemudian dia masuk Islam. Rasulullah memerintahkan supaya diperah seekor kambing untuknya. Susu itu diminumnya habis. Kemudian Nabi shallallahu 'alaihi wasallam menyuruh supaya diperah seekor lagi lalu diberikan pula kepadanya, tetapi dia tidak sanggup menghabiskannya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang mukmin minum dengan satu usus (perut), dan orang kafir minum dengan tujuh usus (perut)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 5380,
			"arabicnumber": "2064.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya], [Zuhair bin Harb] dan [Ishaq bin Ibrahim], Zuhair berkata; Telah menceritakan kepada kami dan yang lainnya berkata; 'Telah mengabarkan kepada kami [Jarir] dari [Al A'masy] dari [Abu Hazim] dari [Abu Hurairah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam sama sekali tidak pernah mencela makanan apapun. Apabila beliau menyukai suatu makanan, maka beliau memakannya, dan apabila beliau tidak menyukainya maka dibiarkannya saja.\" Telah menceritakan kepada kami [Ahmad bin Yunus], Telah menceritakan kepada kami [Zuhair], Telah menceritakan kepada kami [Sulaiman Al A'masy] dari jalur ini dengan Hadits yang serupa. Telah menceritakan kepada kami [Abad bin Humaid], telah mengabarkan kepada kami [Abdur Razak], [Abdul Malik bin Amru], dan [Umar bin Sa'd Abu Daud Al Hafari] seluruhnya dari [Sufyan] dari [Al A'masy] melalui jalur ini dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 5381,
			"arabicnumber": "2064.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 5382,
			"arabicnumber": "2064.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 5383,
			"arabicnumber": "2064.04",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah], [Abu Kuraib], [Muhammad bin Al Mutsanna], ['Amru An Naqid] dan lafazh ini miliknya Abu Kuraib ia berkata; Telah menceritakan kepada kami [Abu Mu'awiyah]; Telah menceritakan kepada kami [Al A'masy] dari [Abu Yahya] budak milik keluarga Ja'dah dari [Abu Hurairah radliallahu 'anhu] dia berkata; \"Aku tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam mencela suatu makanan. Apabila beliau menyukainya maka dimakannya dan apabila beliau tidak menyukainya maka beliau diam saja.\" Telah menceritakan kepada kami [Abu Kuraib] dan [Muhammad bin Al Mutsanna] keduanya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Hazim] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 257
			}
		}
	]
}