{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6500,
			"arabicnumber": "2548.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id bin Jamil bin Tharif Ats Tsaqafi] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Jarir] dari ['Umarah bin Al Qa'qa'] dari [Abu Zur'ah] dari [Abu Hurairah] berkata; \"Seorang laki-laki datang kepada Rasulullah shallallahu 'alaihi wasallam lalu dia bertanya, \"Siapakah orang yang paling berhak dengan kebaktianku?\" Jawab Rasulullah shallallahu 'alaihi wasallam, \"Ibumu!\" dia bertanya lagi; \"Kemudian siapa?\" beliau menjawab: \"Ibumu!\" dia bertanya lagi; \"Kemudian siapa?\" beliau menjawab: \"Kemudian Ibumu!\" dia bertanya lagi; \"Kemudian siapa?\" dijawab: \"Kemudian bapakmu!\" sedangkan di dalam Hadits Qutaibah disebutkan; 'Siapakah yang paling berhak dengan kebaktianku? -tanpa menyebutkan kalimat; 'An Nas",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6501,
			"arabicnumber": "2548.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6502,
			"arabicnumber": "2548.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6503,
			"arabicnumber": "2548.04",
			"text": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al A'laa Al Mahdani]; Telah menceritakan kepada kami [Ibnu Fudhail] dari [Bapaknya] dari ['Umarah bin Al Qa'qa'] dari [Abu Zur'ah] dari [Abu Hurairah] seorang laki-laki seraya berkata; 'Ya Rasulullah, siapakah orang yang paling berhak dengan kebaktianku? Beliau menjawab: 'Ibumu, lalu Ibumu, lalu Ibumu, kemudian bapakmu, kemudian orang yang terdekat denganmu dan seterusnya.' Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Syarik] dari ['Ammarah] dari [Ibnu Syubrumah] dari [Abu Zur'ah] dari [Abu Hurairah] dia berkata; Seseorang berkata kepada Nabi shallallahu 'alaihi wasallam -lalu Abu Hurairah menyebutkah Hadits yang serupa dengan Hadits Jarir dengan sedikit tambahan; 'beliau bersabda: 'Ya, dan bapakmu, sungguh aku akan memberitakan kepadamu.' Telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Syababah] Telah menceritakan kepada kami [Muhammad bin Thalhah] Demikian juga diriwayatkan dari jalur lainnya, Telah menceritakan kepadaku [Ahmad bin Khirasy] Telah menceritakan kepada kami [Habban] Telah menceritakan kepada kami [Wuhaib] keduanya dari [Ibnu Syubrumah] melalui jalur ini. Di dalam Hadits Wuhaib disebutkan dengan lafazh; 'Man Abarru.' (Siapakah yang paling baik). Sedangkan di dalam Hadits Muhammad bin Thalhah dengan lafazh; 'Ayyun nas ahaqqu minni bihusnis shahbah.' -lalu dia menyebutkan lafazh yang sama dengan Hadits Jarir",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6504,
			"arabicnumber": "2549.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Habib]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami [Yahya] yaitu Ibnu Sa'id Al Qaththan dari [Sufyan] dari [Syu'bah] keduanya berkata; Telah menceritakan kepada kami [Habib] dari [Abu Al 'Abbas] dari ['Abdullah bin 'Amru] dia berkata; \"Seseorang datang kepada Nabi shallallahu 'alaihi wasallam minta izin hendak ikut jihad (berperang). Lalu Nabi shallallahu 'alaihi wasallam bertanya kepadanya: \"Apakah kedua orang tuamu masih hidup?\" Jawab orang itu; \"Masih!\" Sabda beliau: \"Berbakti kepada keduanya adalah jihad.\" Telah menceritakan kepada kami [Ubaidullah bin Mu'adz] Telah menceritakan kepada kami [Bapakku] Telah menceritakan kepada kami [Syu'bah] dari [Habib] Aku mendengar [Abul Abbas], aku mendengar [Abdullah bin Amru bin Al Ash] dia berkata; Seseorang datang kepada Nabi shallallahu 'alaihi wasallam -lalu Amru menyebutkan Hadits yang serupa.- Muslim berkata; Abul Abbas adalah As Saib bin Farukh Al Makki. Telah menceritakan kepada kami [Abu Kuraib] Telah mengabarkan kepada kami [Ibnu Basyir] dari [Mis'ar] Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Mu'awiyyah bin Amru] dari [Abu Ishaq] Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Al Qasim bin Zakaria] Telah menceritakan kepada kami [Husain bin Ali Al Ju'fi] dari [Zaidah] keduanya dari [Al A'masy] seluruhnya dari [Habib] melalui jalur ini dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6507,
			"arabicnumber": "2549.04",
			"text": "Telah menceritakan kepada kami [Sa'id bin Manshur]; Telah menceritakan kepada kami ['Abdullah bin Wahb]; Telah mengabarkan kepadaku ['Amru bin Al Harits] dari [Yazid bin Abu Habib] bahwa [Na'im] -budak- Ummu Salamah menceritakan kepadannya, ['Abdullah bin 'Amru bin Al 'Ash] berkata; \"Seorang laki-laki datang menghadap Rasulullah shallallahu 'alaihi wasallam lalu dia berkata: Aku bai'at (berjanji setia) dengan Anda akan ikut hijrah dan jihad, karena aku mengingini pahala dari Allah.\" Nabi shallallahu 'alaihi wasallam bertanya: \"Apakah kedua orang tuamu masih hidup?\" Jawab orang itu; \"Bahkan keduanya masih hidup.\" Nabi shallallahu 'alaihi wasallam bertanya lagi: \"Apakah kamu mengharapkan pahala dari Allah?\" Jawabnya; \"Ya!\" Sabda Nabi shallallahu 'alaihi wasallam; \"Pulanglah kamu kepada kedua orang tuamu, lalu berbaktilah pada keduanya dengan sebaik-baiknya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6508,
			"arabicnumber": "2550.01",
			"text": "Telah menceritakan kepada kami [Syaiban bin Farrukh]; Telah menceritakan kepada kami [Sulaiman bin Al Mughirah]; Telah menceritakan kepada kami [Humaid bin Hilal] dari [Abu Rafi'] dari [Abu Hurairah] dia berkata; \"Suatu ketika Juraij beribadah di tempat ibadahnya.\" Lalu ibunya datang -Hamid berkata; Abu Rafi menggambarkan sifat Abu Hurairah ketika mencontohkan Rasulullah shallallahu 'alaihi wasallam tatkala ibunya memanggil Juraij seraya meletakkan tangannya pada bulu matanya lalu mengangkat kepalanya memanggil Juraij; 'Wahai Juraij, saya ibumu jawablah!\"Ternyata ibunya mendapati Juraij sedang shalat. Juraij pun berkata; 'Ya Allah, ibuku atau shalatku yang harus aku penuhi? ' maka Juraij memilih untuk meneruskan shalatnya. Kemudian ibunya kembali mendatanginya (di tempat shalat), dan masih mendapati Juraij sedang shalat, ia berkata; 'Wahai Juraij, aku ini ibumu, jawablah.' Juraij berkata dalam hatinya; 'Ya Allah, ibuku atau shalatku, ' maka ia tetap memilih shalatnya. Lalu ibunya mendatanginya dan mendapatinya sedang shalat, ia berkata; 'Wahai Juraij, aku ini ibumu, jawablah aku, ' Juraij berkata dalam hatinya; 'Ya Allah, ibuku atau shalatku, ' maka ia tetap memilih shalatnya. Dan akhirnya Ibunya berkata; 'Ya Allah, Juraij ini adalah anakku, aku telah mengajaknya berbicara (memanggilnya) tetapi ia tidak menjawabku, Ya Allah, janganlah Engkau matikan ia sebelum ia bertemu dengan seorang wanita pelacur.' sekiranya ia berdoa supaya Juraij mendapatkan fitnah, maka Juraij pasti akan mendapatkan fitnah itu.\" Abu Hurairah berkata; \"Ada seorang penggembala kambing yang bernaung di rumah ibadahnya, \" Abu Hurairah berkata; \"lalu wanita pelacur itu keluar dan berzina dengan penggembala kambing tersebut hingga melahirkan seorang bayi laki-laki, \" maka ditanyakan kepada wanita tersebut; 'Bayi ini anak siapa? ' wanita pelacur itu menjawab; 'Anak pemilik rumah ibadah.' lalu orang-orang pun mendatangi rumah ibadah Juraij dengan membawa kapak dan sekop mereka, mereka memanggil Juraij namun ia ternyata sedang shalat dan enggan untuk menjawabnya. Akhirnya mereka menghancurkan rumah ibadahnya. Melihat hal itu, maka turunlah Juraij menemui mereka, mereka berkata; 'Bertanyalah kepada wanita ini.'\" Abu Hurairah berkata; \"Juraij tersenyum, lalu mengusap kepala bayi itu seraya bertanya; 'Siapa bapakmu? ' maka bayi itu menjawab; 'Bapakku adalah penggembala kambing.' Setelah mendengar hal itu dengan serta merta mereka berkata; 'Wahai Juraij, kami akan membangun kembali rumah ibadahmu yang telah hancur dengan emas dan perak, ' tetapi Juraij menjawab; 'Tidak, bangunlah dengan tanah kembali, ' lalu mereka pun melakukannya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6509,
			"arabicnumber": "2550.02",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb]; Telah menceritakan kepada kami [Yazid bin Harun]; Telah mengabarkan kepada kami [Jarir bin Hazim]; Telah menceritakan kepada kami [Muhammad bin Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau telah bersabda: \"Tidak ada bayi yang dapat berbicara ketika masih berada dalam buaian kecuali tiga bayi: bayi Isa bin Maryam, dan bayi dalam perkara Juraij.\" Juraij adalah seorang laki-laki yang rajin beribadah. Ia membangun tempat peribadatan dan senantiasa beribadah di tempat itu. Ketika sedang melaksanakan shalat sunnah, tiba-tiba ibunya datang dan memanggilnya; 'Hai Juraij! ' Juraij bertanya dalam hati; 'Ya Allah, manakah yang lebih aku utamakan, melanjutkan shalatku ataukah memenuhi panggilan ibuku? ' Akhirnya ia pun meneruskan shalatnya itu hingga ibunya merasa kecewa dan beranjak darinya. Keesokan harinya, ibunya datang lagi kepadanya sedangkan Juraij sedang melakukan shalat sunnah. Kemudian ibunya memanggilnya; 'Hai Juraij! ' Kata Juraij dalam hati; 'Ya Allah, manakah yang lebih aku utamakan, memenuhi seruan ibuku ataukah shalatku? ' Lalu Juraij tetap meneruskan shalatnya hingga ibunya merasa kecewa dan beranjak darinya. Hari berikutnya, ibunya datang lagi ketika Juraij sedang melaksanakan shalat sunnah. Seperti biasa ibunya memanggil; 'Hai Juraij! ' Kata Juraij dalam hati; 'Ya Allah, manakah yang harus aku utamakan, meneruskan shalatku ataukah memenuhi seruan ibuku? ' Namun Juraij tetap meneruskan shalatnya dan mengabaikan seruan ibunya. Tentunya hal ini membuat kecewa hati ibunya. Hingga tak lama kemudian ibunya pun berdoa kepada Allah; 'Ya Allah, janganlah Engkau matikan ia sebelum ia mendapat fitnah dari perempuan pelacur! ' Kaum Bani Israil selalu memperbincangkan tentang Juraij dan ibadahnya, hingga ada seorang wanita pelacur yang cantik berkata; 'Jika kalian menginginkan popularitas Juraij hancur di mata masyarakat, maka aku dapat memfitnahnya demi kalian.' Rasulullah shallallahu 'alaihi wasallam pun meneruskan sabdanya: 'Maka mulailah pelacur itu menggoda dan membujuk Juraij, tetapi Juraij tidak mudah terpedaya dengan godaan pelacur tersebut. Kemudian pelacur itu pergi mendatangi seorang penggembala ternak yang kebetulan sering berteduh di tempat peribadatan Juraij. Ternyata wanita tersebut berhasil memperdayainya hingga laki-laki penggembala itu melakukan perzinaan dengannya sampai akhirnya hamil. Setelah melahirkan, wanita pelacur itu berkata kepada masyarakat sekitarnya bahwa; 'Bayi ini adalah hasil perbuatan aku dengan Juraij.' Mendengar pengakuan wanita itu, masyarakat pun menjadi marah dan benci kepada Juraij. Kemudian mendatangi rumah peribadatan Juraij dan bahkan menghancurkannya. Selain itu, mereka pun bersama-sama menghakimi Juraij tanpa bertanya terlebih dahulu kepadanya. Lalu Juraij bertanya kepada mereka; 'Mengapa kalian lakukan hal ini kepadaku? ' Mereka menjawab; 'Kami lakukan hal ini kepadamu karena kamu telah berbuat zina dengan pelacur ini hingga ia melahirkan bayi dari hasil perbuatanmu.' Juraij berseru; 'Dimanakah bayi itu? ' Kemudian mereka menghadirkan bayi hasil perbuatan zina itu dan menyentuh perutnya dengan jari tangannya seraya bertanya; 'Hai bayi kecil, siapakah sebenarnya ayahmu itu? ' Ajaibnya, sang bayi langsung menjawab; 'Ayah saya adalah si fulan, seorang penggembala.' Sabda Rasulullah shallallahu 'alaihi wasallam: 'Akhirnya mereka menaruh hormat kepada Juraij. Mereka menciuminya dan mengharap berkah darinya. Setelah itu mereka pun berkata; 'Kami akan membangun kembali tempat ibadahmu ini dengan bahan yang terbuat dari emas.' Namun Juraij menolak dan berkata; 'Tidak usah, tetapi kembalikan saja rumah ibadah seperti semula yang terbuat dari tanah liat.' Akhirnya mereka pun mulai melaksanakan pembangunan rumah ibadah itu seperti semula. Dan bayi ketiga, Ada seorang bayi sedang menyusu kepada ibunya, tiba-tiba ada seorang laki-laki yang gagah dan berpakaian yang bagus pula. Lalu ibu bayi tersebut berkata; 'Ya Allah ya Tuhanku, jadikanlah anakku ini seperti laki-laki yang sedang mengendarai hewan tunggangan itu! ' Ajaibnya, bayi itu berhenti dari susuannya, lalu menghadap dan memandang kepada laki-laki tersebut sambil berkata; 'Ya Allah ya Tuhanku, janganlah Engkau jadikan aku seperti laki-laki itu! ' Setelah itu, bayi tersebut langsung menyusu kembali kepada ibunya. Abu Hurairah berkata; 'Sepertinya saya melihat Rasulullah shallallahu 'alaihi wasallam menceritakan susuan bayi itu dengan memperagakan jari telunjuk beliau yang dihisap dengan mulut beliau.' Rasulullah shallallahu 'alaihi wasallam meneruskan sabdanya: 'Pada suatu ketika, ada beberapa orang yang menyeret dan memukuli seorang wanita seraya berkata; 'Kamu wanita tidak tahu diuntung. Kamu telah berzina dan mencuri.' Tetapi wanita itu tetap tegar dan berkata; 'Hanya Allah lah penolongku. Sesungguhnya Dialah sebaik-baik penolongku.' Kemudian ibu bayi itu berkata; 'Ya Allah, janganlah Engkau jadikan anakku seperti wanita itu! ' Tiba-tiba bayi tersebut berhenti dari susuan ibunya, lalu memandang wanita tersebut seraya berkata; 'Ya Allah ya Tuhanku, jadikanlah aku sepertinya! ' Demikian pernyataan ibu dan bayinya itu terus berlawanan, hingga ibu tersebut berkata kepada bayinya; 'Celaka kamu hai anakku! Tadi, ada seorang laki-laki yang gagah dan menawan lewat di depan kita, lalu kamu berdoa kepada Allah; 'Ya Allah, jadikanlah anakku seperti laki-laki itu! Namun kamu malah mengatakan; 'Ya Allah, janganlah Engkau jadikan aku seperti laki-laki itu! Kemudian tadi, ketika ada beberapa orang menyeret dan memukuli seorang wanita sambil berkata; 'Ya Allah, janganlah Engkau jadikan anakku seperti wanita itu! ' Tetapi kamu malah berkata; 'Ya Allah, jadikanlah aku seperti wanita itu! ' Mendengar pernyataan ibunya itu, sang bayi pun menjawab; 'Sesungguhnya laki-laki yang gagah itu seorang diktator hingga aku mengucapkan; 'Ya Allah, janganlah Engkau jadikan aku seperti laki-laki itu! ' Sementara wanita yang dituduh mencuri dan berzina itu tadi sebenarnya adalah seorang wanita yang shalihah, tidak pernah berzina, ataupun mencuri. Oleh karena itu, aku pun berdoa; 'Ya Allah, jadikanlah aku seperti wanita itu",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6510,
			"arabicnumber": "2551.01",
			"text": "Telah menceritakan kepada kami [Syaiban bin Farrukh]; Telah menceritakan kepada kami [Abu 'Awanah] dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Dia celaka! Dia celaka! Dia celaka!\" lalu beliau ditanya; \"Siapakah yang celaka, ya Rasulullah?\" Jawab Nabi shallallahu 'alaihi wasallam: \"Barang Siapa yang mendapati kedua orang tuanya (dalam usia lanjut), atau salah satu dari keduanya, tetapi dia tidak berusaha masuk surga (dengan berusaha berbakti kepadanya dengan sebaik-baiknya)",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6511,
			"arabicnumber": "2551.02",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb]; Telah menceritakan kepada kami [Jarir] dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Dia celaka! Dia celaka! Dia celaka!\" lalu beliau ditanya; \"Siapakah yang celaka, ya Rasulullah?\" Jawab Nabi shallallahu 'alaihi wasallam: \"Barang Siapa yang mendapati kedua orang tuanya (dalam usia lanjut), atau salah satu dari keduanya, tetapi dia tidak berusaha masuk surga (dengan berusaha berbakti kepadanya dengan sebaik-baiknya).\" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Khalid bin Makhlad] dari [Sulaiman bin Bilal]; Telah menceritakan kepadaku [Suhail] dari [Bapaknya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Dia celaka, ' sebanyak tiga kali -kemudian disebutkan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6512,
			"arabicnumber": "2551.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6513,
			"arabicnumber": "2552.01",
			"text": "Telah menceritakan kepadaku [Abu Ath Thahir Ahmad bin 'Amru bin Sarh]; Telah mengabarkan kepada kami ['Abdullah bin Wahb]; Telah mengabarkan kepadaku [Sa'id bin Abu Ayyub] dari [Al Walid bin Abu Al Walid] dari ['Abdullah bin Dinar] dari ['Abdullah bin 'Umar] dia berkata; \"Seorang laki-laki desa bertemu dengannya di salah satu jalan di kota Mekkah. Lalu 'Abdullah memberi salam kepadanya dan menaikkannya ke atas keledai yang dikendarainya, dan diberinya serban yang sedang dipakainya di kepala.\" Kata Ibnu Dinar; \"Maka kami berkata kepada 'Abdullah bin 'Umar; 'semoga Allah ta'ala membalas kebaikan Anda. Sesungguhnya orang desa itu lebih suka yang sederhana.\" Jawab 'Abdullah; \"Bapak orang ini adalah sahabat baik 'Umar bin Khaththab. Aku mendengar Rasulullah bersabda: \"Sesungguhnya kebajikan yang utama ialah apabila seorang anak melanjutkan hubungan (silaturrahim) dengan keluarga sahabat baik ayahnya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6514,
			"arabicnumber": "2552.02",
			"text": "Telah menceritakan kepadaku [Abu Ath Thahir]; Telah mengabarkan kepada kami ['Abdullah bin Wahb]; Telah mengabarkan kepadaku [Haiwah bin Syuraih] dari [Ibnu Al Hadi] dari ['Abdullah bin Dinar] dari ['Abdullah bin 'Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kebajikan yang utama ialah apabila seseorang melanjutkan hubungan (silaturrahim) dengan keluarga sahabat baik ayahnya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6515,
			"arabicnumber": "2552.03",
			"text": "Telah menceritakan kepada kami [Hasan bin 'Ali Al Hulwani]; Telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'ad]; Telah menceritakan kepada kami [Bapakku] dan [Al Laits bin Sa'ad] seluruhnya dari [Yazid bin 'Abdullah bin Usamah bin Al Hadi] dari ['Abdullah bin Dinar] dari [Ibnu 'Umar] bahwasanya apabila ia hendak ke Makkah, maka biasanya ia membawa keledainya untuk dikendarainya jika -ia sudah bosan untuk mengendarai unta, - sambil mengikatkan sorban pada kepalanya. Pada suatu hari, ketika ia sedang mengendarai keledainya, tiba-tiba ada seorang laki-laki Arab badui yang lewat, maka dia berkata; \"Bukankah kamu ini adalah fulan bin fulan?\" Orang tersebut menjawab; 'Ya, benar.' Lalu Ibnu Umar memberikan keledainya kepada orang itu sambil berkata; 'Ambillah keledai ini untuk kendaraanmu! ' Selain itu, ia juga memberikan sorbannya dengan mengatakan; 'lkatkanlah surban ini di kepalamu! ' Salah seorang sahabat berkata kepada Abdullah bin Umar; 'Semoga Allah mengampunimu hai lbnu Umar, karena kamu telah memberikan keledai yang biasa kamu jadikan kendaraanmu dan sorban yang biasa kamu ikatkan di kepalamu kepada orang Arab badui itu.' Abdullah bin Umar menjawab; 'Wahai sahabat ketahuilah bahwasanya saya pernah mendengar Rasulullah bersabda: 'Di antara bakti seseorang yang paling baik kepada orang tuanya adalah menyambung tali keluarga karib orang tuanya setelah orang tuanya meninggal dunia.' Sesungguhnya bapak orang Arab badui itu dahulu adaIah teman Umar bin Khaththab",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6516,
			"arabicnumber": "2553.01",
			"text": "Telah menceritakan kepadaku [Muhammad bin Hatim bin Maimun]; Telah menceritakan kepada kami [Ibnu Mahdi] dari [Mu'awiyah bin Shalih] dari ['Abdur Rahman bin Jubair bin Nufair] dari [Bapaknya] dari [An Nawwas bin Mis'an Al Anshari] dia berkata; \"Aku pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang arti kebajikan dan dosa. Sabda beliau: \"Kebajikan itu ialah budi pekerti yang baik. Sedangkan dosa ialah perbuatan atau tindakan yang menyesakkan dada, dan engkau sendiri benci jika perbuatanmu itu diketahui orang lain",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6517,
			"arabicnumber": "2553.02",
			"text": "Telah menceritakan kepadaku [Harun bin Sa'id Al Aili]; Telah menceritakan kepada kami ['Abdullah bin Wahb]; Telah menceritakan kepadaku [Mu'awiyah] yaitu Ibnu Shalih dari ['Abdur Rahman bin Jubair bin Nufair] dari [Bapaknya] dari [Nawwas bin Sim'an] dia berkata; \"Saya pernah tinggal bersama Rasulullah shallallahu 'alaihi wasallam selama satu tahun di Madinah. Saya tidak dapat pergi hijrah (bersama Rasulullah shallallahu 'alaihi wasallam) karena adanya suatu masalah.\" Seseorang dari kami apabila berhijrah biasanya tidak menanyakan tentang sesuatupun kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian saya bertanya kepada Rasulullah tentang kebaikan dan dosa. Lalu beliau bersabda: 'Kebaikan adalah budi pekerti yang baik, sedangkan dosa adalah apa yang terlintas/terdetik dalam dadamu dan kamu tidak suka jika hal itu diketahui orang lain",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6518,
			"arabicnumber": "2554",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id bin Jamil bin Tharif bin 'Abdullah Ats Tsaqafi] dan [Muhammad bin 'Abbad] keduanya berkata; Telah menceritakan kepada kami [Hatim] yaitu Ibnu Isma'il dari [Mu'awiyah] yaitu Ibnu Abu Muzarrid -budak- dari Bani Hasyim; Telah menceritakan kepadaku Pamanku, [Abu Al Hubab Sa'id bin Yasar] dari [Abu Hurairah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam telah bersabda: 'Setelah Allah Azza wa Jalla menciptakan semua makhluk, maka rahim pun berdiri sambil berkata; 'Inikah tempat bagi yang berlindung dari terputusnya silaturahim (Menyambung silaturahim).' Allah Subhanahu wa Ta'ala menjawab: 'Benar. Tidakkah kamu rela bahwasanya Aku akan menyambung orang yang menyambungmu dan memutuskan yang memutuskanmu? ' Rahim menjawab; 'Tentu.' Allah berfirman: 'ltulah yang kamu miliki.' Setelah itu Rasulullah shallallahu 'alaihi wasallam bersabda: 'Jika kamu mau, maka bacalah ayat berikut ini: Maka apakah kiranya jika kamu berkuasa kamu akan berbuat kerusakan di muka bumi dan memutuskan hubungan kekeluargaan? Mereka itulah orang-orang yang dilaknat oleh Allah dan ditulikan telinga mereka serta dibutakan penglihatan mereka. Maka apakah mereka tidak memperhatikan Al Qur'an ataukah hati mereka terkunci? (QS. Muhammad 22-24)",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6519,
			"arabicnumber": "2555",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] dan lafazh ini milik Abu Bakr. Dia berkata; Telah menceritakan kepada kami [Waki'] dari [Mu'awiyah bin Muzarrid] dari [Yazid bin Ruman] dari ['Urwah] dari ['Aisyah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rahim (kasih sayang) itu tergantung di 'Arasy, seraya berkata; \"Siapa yang menyambungkanku, maka Allah pun akan menyambungkannya. Dan barangsiapa yang memutuskanku, niscaya Allah pun akan memutuskannya pula",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6520,
			"arabicnumber": "2556.01",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb] dan [Ibnu Abu 'Umar] keduanya berkata; Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Muhammad bin Jubair bin Muth'im] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak masuk surga orang yang memutuskan.\" Ibnu Abu Umar berkata; Sufyan berkata; 'Yaitu yang memutuskan silaturrahmi",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6521,
			"arabicnumber": "2556.02",
			"text": "Telah menceritakan kepadaku ['Abdullah bin Muhammad bin Asma' Adh Dhaba'i]; Telah menceritakan kepada kami [Juwariyah] dari [Malik] dari [Az Zuhri] bahwa [Muhammad bin Jubair bin Muth'im]; Telah mengabarkan kepadanya bahwa [Bapaknya] mengabarkan kepadanya, sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak masuk surga orang yang memutuskan silaturrahmi.\" Telah menceritakan kepada kami [Muhammad bin Rafi'] dan [Abad bin Humaid] dari [Abdurrazak] dari [Ma'mar] dari [Az Zuhri] melalui jalur ini dengan Hadits yang serupa. Dia berkata dengan lafazh; Aku mendengar Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6522,
			"arabicnumber": "2556.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6523,
			"arabicnumber": "2557.01",
			"text": "Telah menceritakan kepadaku [Harmalah bin Yahya At Tujibi]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Anas bin Malik] dia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang ingin dilapangkan rezkinya, atau ingin dipanjangkan usianya, maka hendaklah dia menyambung silaturrahmi",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6524,
			"arabicnumber": "2557.02",
			"text": "Dan telah menceritakan kepadaku ['Abdul Malik bin Syu'aib bin Al Laits]; Telah menceritakan kepadaku [Bapakku] dari [Kakekku]; Telah menceritakan kepadaku ['Uqail bin Khalid] dia berkata; [Ibnu Syihab] berkata; Telah mengabarkan kepadaku [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang ingin dilapangkan rezkinya, dan ingin dipanjangkan usianya, maka hendaklah dia menyambung silaturrahmi",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6525,
			"arabicnumber": "2558.01",
			"text": "Telah menceritakan kepadaku [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] dan lafazh ini milik Ibnu Al Mutsanna dia berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] dia berkata; Aku mendengar [Al A'laa bin 'Abdur Rahman] bercerita dari [Bapaknya] dari [Abu Hurairah] bahwasanya seorang laki-laki pernah berkata; \"Ya Rasulullah, saya mempunyai kerabat. Saya selalu berupaya untuk menyambung silaturahim kepada mereka, tetapi mereka memutuskannya. Saya selalu berupaya untuk berbuat baik kepada mereka, tetapi mereka menyakiti saya. Saya selalu berupaya untuk lemah lembut terhadap mereka, tetapi mereka tak acuh kepada saya.\" Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: 'Jika benar seperti apa yang kamu katakan, maka kamu seperti memberi makan mereka debu yang panas, dan selama kamu berbuat demikian maka pertolongan Allah akan selalu bersamamu",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6526,
			"arabicnumber": "2558.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6530,
			"arabicnumber": "2559.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6531,
			"arabicnumber": "2559.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6532,
			"arabicnumber": "2560.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6533,
			"arabicnumber": "2560.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku membaca Hadits [Malik] dari [Ibnu Syihab] dari ['Athaa bin Yazid Al Laitsi] dari [Abu Ayyub Al Anshari] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang muslim tidak bersapaan dengan saudaranya (sesama muslim) lebih dari tiga malam. Keduanya saling bertemu, tetapi mereka saling tak acuh satu sama lain. Yang paling baik di antara keduanya ialah yang lebih dahulu memberi salam.\" Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu Bakr bin Abu Syaibah] serta [Zuhair bin Harb] mereka berkata; Telah menceritakan kepada kami [Sufyan]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Harmalah bin Yahya]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Hajib bin Al Walid]; Telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaid]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq bin Ibrahim Al Hanzhali] dan [Muhammad bin Rafi'] serta ['Abad bin Humaid] dari ['Abdur Razzaq] dari [Ma'mar] seluruhnya dari [Az Zuhri] dengan sanad Malik, dengan Hadits yang serupa. Kecuali Malik yang menggunakan lafazh: 'Fayashuddu Hadza wa yashuddu Hadza.' (keduanya saling berpaling)",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6534,
			"arabicnumber": "2561",
			"text": "Telah menceritakan kepada kami [Muhammad bin Rafi']; Telah menceritakan kepada kami [Muhammad bin Abu Fudaik]; Telah mengabarkan kepada kami [Adh Dhahak] yaitu Ibnu 'Utsman dari [Nafi'] dari ['Abdullah bin 'Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang mukmin untuk tidak bersapaan dengan saudaranya (sesama muslim) lebih dari tiga hari",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6535,
			"arabicnumber": "2562",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami ['Abdul 'Aziz] yaitu Ibnu Muhammad dari [Al A'laa] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh menghajr (mendiamkan) sesama muslim lebih dari tiga hari",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6536,
			"arabicnumber": "2563.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku membaca kitab [Malik] dari [Abu Az Ziyad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jauhilah berprasangka buruk, karena prasangka buruk adalah ucapan yang paling dusta. Janganlah mencari-cari isu; janganlah mencari-cari kesalahan; janganlah saling bersaing; janganlah saling mendengki; janganlah saling memarahi; dan janganlah saling membelakangi (memusuhi)! Tetapi, jadilah kalian hamba-hamba Allah yang bersaudara",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6537,
			"arabicnumber": "2563.02",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami ['Abdul 'Aziz] yaitu Ibnu Muhammad dari [Al A'laa] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian saling mendiamkan, saling membelakangi, dan janganlah suka mencari-cari isu (meneropong kesalahan), serta (memusuhi)! Tetapi, jadilah kalian hamba-hamba Allah yang bersaudara",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6538,
			"arabicnumber": "2563.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6539,
			"arabicnumber": "2563.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6540,
			"arabicnumber": "2563.05",
			"text": "Dan telah menceritakan kepadaku [Ahmad bin Sa'id Ad Darimi]; Telah menceritakan kepada kami [Habban]; Telah menceritakan kepada kami [Wuhaib]; Telah menceritakan kepada kami [Suhail] dari [Bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah saling memarahi, saling membelakangi, saling menyaingi. Tetapi, jadilah kalian hamba-hamba Allah yang bersaudara",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6541,
			"arabicnumber": "2564.01",
			"text": "Telah menceritakan kepada kami ['Abdullah bin Maslamah bin Qa'nab]; Telah menceritakan kepada kami [Dawud] yaitu Ibnu Qais dari [Abu Sa'id] budak 'Amir bin Kuraiz dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Janganlah kalian saling mendengki, saling memfitnah, saling membenci, dan saling memusuhi. Janganlah ada seseorang di antara kalian yang berjual beli sesuatu yang masih dalam penawaran muslim lainnya dan jadilah kalian hamba-hamba Allah yang saling bersaudara. Muslim yang satu dengan muslim yang lainnya adalah bersaudara tidak boleh menyakiti, merendahkan, ataupun menghina. Takwa itu ada di sini (Rasulullah menunjuk dadanya), Beliau mengucapkannya sebanyak tiga kali. Seseorang telah dianggap berbuat jahat apabila ia menghina saudaranya sesama muslim. Muslim yang satu dengan yang Iainnya haram darahnya. hartanya, dan kehormatannya.\" Telah menceritakan kepadaku [Abu At Thahir Ahmad bin Amru bin Sarh] Telah menceritakan kepada kami [Ibnu Wahab] dari [Usamah] yaitu Ibnu Zaid Bahwa dia mendengar [Abu Sa'id] -budak- dari Abdullah bin Amir bin Kuraiz berkata; aku mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: -kemudian perawi menyebutkan Hadits yang serupa dengan Hadits Daud, dengan sedikit penambahan dan pengurangan. Diantara tambahannya adalah; \"Sesungguhnya Allah tidak melihat kepada tubuh dan rupa kalian, akan tetapi Allah melihat kepada hati kalian. (seraya mengisyaratkan telunjuknya ke dada beliau)",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6542,
			"arabicnumber": "2564.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6543,
			"arabicnumber": "2564.03",
			"text": "Telah menceritakan kepada kami ['Amru An Naqid]; Telah menceritakan kepada kami [Katsir bin Hisyam]; Telah menceritakan kepada kami [Ja'far bin Burqan] dari [Yazid bin Al Asham] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah tidak melihat kepada rupa dan harta kalian, tetapi Allah melihat kepada hati dan amal kalian",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6546,
			"arabicnumber": "2565.03",
			"text": "Telah menceritakan kepada kami [Ibnu Abu 'Umar]; Telah menceritakan kepada kami [Sufyan] dari [Muslim bin Abu Maryam] dari [Abu Shalih]; Aku mendengar [Abu Hurairah] berkata tentang sebuah Hadits yang telah ia marfu'kan; \"Pintu surga dibuka setiap hari senin dan kamis. Maka Allah mengampuni dosa setiap hamba-Nya yang tidak musyrik, kecuali orang yang bermusuhan dengan saudaranya (sesama muslim). Maka dikatakan kepada mereka; Tunggulah dahulu kedua orang ini hingga berdamai! Tunggulah dahulu kedua orang ini hingga berdamai",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6547,
			"arabicnumber": "2565.04",
			"text": "Telah menceritakan kepada kami [Abu Ath Thahir] dan ['Amru bin Sawwad] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepada kami [Malik bin Anas] dari [Muslim bin Abu Maryam] dari [Abu Shalih] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Seluruh amal manusia dihadapkan kepada Allah Subhanahu wa ta'ala dua kali dalam sepekan. Yaitu pada hari Senin dan Kamis. Lalu Allah mengampuni dosa setiap hamba-Nya yang mukmin, kecuali orang yang bermusuhan. Maka dikatakan kepada mereka: tinggalkanlah dahulu kedua orang ini, sampai mereka berdamai",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6548,
			"arabicnumber": "2566",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] dari apa yang telah dibacakan kepadanya dari ['Abdullah bin 'Abdur Rahman bin Ma'mar] dari [Abu Al Hubab Sa'id bin Yasar] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah Ta'ala berfirman pada hari kiamat kelak: \"Mana orang-orang yang saling mencintai karena keagungan-Ku? Hari ini kunaungi mereka, di mana tidak ada naungan pada hari ini selain naungan-Ku",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6549,
			"arabicnumber": "2567.01",
			"text": "Telah menceritakan kepadaku ['Abdul A'laa bin Hammad]; Telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Abu Rafi'] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, \"Pada suatu ketika ada seorang lelaki yang mengunjungi saudaranya di desa lain. Kemudian Allah pun mengutus seorang malaikat untuk menemui orang tersebut. Ketika orang itu ditengah perjalanannya ke desa yang dituju, maka malaikat tersebut bertanya; 'Hendak pergi ke mana kamu? ' Orang itu menjawab; 'Saya akan menjenguk saudara saya yang berada di desa lain.' Malaikat itu terus bertanya kepadanya; 'Apakah kamu mempunyai satu perkara yang menguntungkan dengannya? ' Laki-laki itu menjawab; 'Tidak, saya hanya mencintainya karena Allah Azza wa Jalla.' Akhirnya malaikat itu berkata; 'Sesungguhnya aku ini adalah malaikat utusan yang diutus untuk memberitahukan kepadamu bahwasanya Allah akan senantiasa mencintaimu sebagaimana kamu mencintai saudaramu karena Allah.' Berkata Syaikh Abu Ahmad; Telah mengabarkan kepadaku Abu Bakr Muhammad bin Zanjuyah Al Qusyairi; Telah menceritakan kepada kami 'Abdul A'laa bin Hammad; Telah menceritakan kepada kami Hammad bin Salamah melalui jalur ini dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6550,
			"arabicnumber": "2567.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6551,
			"arabicnumber": "2568.01",
			"text": "Telah menceritakan kepada kami [Sa'id bin Manshur] dan [Abu Ar Rabi Az Zahrani] keduanya berkata; Telah menceritakan kepada kami [Hammad] yaitu Ibnu Zaid dari [Ayyub] dari [Abu Qilabah] dari [Abu Asma'] dari [Tsauban]. Abu Ar Rabi' Rafa'ah berkata; dia telah menyandarkan Hadits ini kepada Nabi shallallahu 'alaihi wasallam. Sedangkan di dalam Hadits Sa'id dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang mengunjungi orang sakit, maka dia senantiasa berada dalam sebuah taman surga sampai dia pulang kembali",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6552,
			"arabicnumber": "2568.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi]; Telah mengabarkan kepada kami [Husyaim] dari [Khalid] dari [Abu Qilabah] dari [Abu Asma'] dari [Tsauban] -budak- dari Rasulullah shallallahu 'alaihi wasallam dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang menjenguk orang sakit, maka dia senantiasa berada dalam sebuah taman surga sampai dia pulang kembali",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6553,
			"arabicnumber": "2568.03",
			"text": "Telah menceritakan kepada kami [Yahya bin Habib Al Haritsi]; Telah menceritakan kepada kami [Yazid bin Zurai']; Telah menceritakan kepada kami [Khalid] dari [Abu Qilabah] dari [Abu Asma' Ar Rahabi] dari [Tsauban] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Seorang muslim bila dia menjeguk saudaranya, maka dia senantiasa berada dalam sebuah taman surga sampai dia pulang kembali",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6554,
			"arabicnumber": "2568.04",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] seluruhnya dari [Yazid] dan lafazh ini milik Zuhair; Telah menceritakan kepada kami [Yazid bin Harun]; Telah mengabarkan kepada kami ['Ashim Al Ahwal] dari ['Abdullah bin Zaid] yaitu Abu Qilabah dari [Abu Al Asy'ats Ash Shan'ani] dari [Abu Asma' Ar Rahabi] dari [Tsauban] -budak- Rasulullah shallallahu 'alaihi wasallam dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Apabila seorang muslim mengunjungi saudaranya sesama muslim, maka orang itu senantiasa berada dalam sebuah taman surga. Beliau ditanya; Bagaimana taman surga itu? Beliau menjawab: 'Taman yang penuh dengan buah-buahan yang dapat dipetiknya.' Telah menceritakan kepadaku [Suwaid bin Sa'id]; Telah menceritakan kepada kami [Marwan bin Mu'awiyah] dari ['Ashim Al Ahwal] melalui jalur ini",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6555,
			"arabicnumber": "2568.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6556,
			"arabicnumber": "2569",
			"text": "Telah menceritakan kepadaku [Muhammad bin Hatim bin Maimun]; Telah menceritakan kepada kami [Bahz]; Telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Abu Rafi'] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: Hai anak Adam! Aku sakit, mengapa kamu tidak menjenguk-Ku?\" Jawab anak Adam; \"Wahai Rabbku, bagaimana mengunjungi Engkau, padahal Engkau Tuhan semesta alam?\" Allah Ta'ala berfirman: \"Apakah kamu tidak tahu bahwa hamba-Ku si Fulan sakit, mengapa kamu tidak mengunjunginya? Apakah kamu tidak tahu, seandainya kamu kunjungi dia kamu akan mendapati-Ku di sisinya?\" \"Hai, anak Adam! Aku minta makan kepadamu, mengapa kamu tidak memberi-Ku makan?\" Jawab anak Adam; \"Wahai Rabbku, Bagaimana mungkin aku memberi engkau makan, padahal Engkau Tuhan semesta alam?\" Allah Ta'ala berfirman: \"Apakah kamu tidak tahu, bahwa hamba-Ku si Fulan minta makan kepadamu tetapi kamu tidak memberinya makan. Apakah kamu tidak tahu seandainya kamu memberinya makan niscaya engkau mendapatkannya di sisi-Ku?\" \"Hai, anak Adam! Aku minta minum kepadamu, mengapa kamu tidak memberi-Ku minum?\" Jawab anak Adam; \"Wahai Tuhanku, bagaimana mungkin aku memberi Engkau minum, padahal Engkau Tuhan semesta alam?\" Allah Ta'ala menjawab: \"Hamba-Ku si Fulan minta minum kepadamu, tetapi kamu tidak memberinya minum. Ketahuilah, seandainya kamu memberinya minum, niscaya kamu mendapatkannya di sisi-Ku",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6557,
			"arabicnumber": "2570.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6558,
			"arabicnumber": "2570.02",
			"text": "Telah menceritakan kepada kami ['Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim]. [Ishaq] berkata; Telah mengabarkan kepada kami. Sedangkan ['Utsman] berkata; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Wa`il] dari [Masruq] dia berkata; ['Aisyah] berkata; \"Aku tidak pernah melihat seorangpun yang sakit melebihi sakitnya Rasulullah shallallahu 'alaihi wasallam. Di dalam riwayat Utsman disebutkan dengan lafazh; 'Makaanal Waj'i waja'an.' (tempat yang sakit). Telah menceritakan kepada kami ['Ubaidullah bin Mu'adz]; Telah mengabarkan kepadaku [Bapakku]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata; Telah menceritakan kepada kami [Ibnu Abu 'Adi]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Bisyr bin Khalid]; Telah mengabarkan kepada kami [Muhammad] yaitu Ibnu Ja'far seluruhnya dari [Syu'bah] dari [Al A'masy]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Abu Bakr bin Nafi']; Telah menceritakan kepada kami ['Abdur Rahman]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Numair]; Telah menceritakan kepada kami [Mush'ab bin Al Miqdam] keduanya dari [Sufyan] dari [Al A'masy] melalui sanad Jarir dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6559,
			"arabicnumber": "2571.01",
			"text": "Telah menceritakan kepada kami ['Utsman bin Abu Syaibah] dan [Zuhair bin Harb] serta [Ishaq bin Ibrahim]. [Ishaq] berkata; Telah mengabarkan kepada kami sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim At Tamimi] dari [Al Harits bin Suwaid] dari ['Abdullah] dia berkata; \"Aku datang mengunjungi Rasulullah shallallahu 'alaihi wasallam ketika beliau sakit, lalu kuraba beliau seraya berkata, \"Ya, Rasulullah! Demam Anda bertambah keras.\" Jawab beliau: \"Memang demamku sama dengan demam dua orang dari kalian.\" Kataku pula; \"Semoga Anda mendapat pahala berganda pula.\" Jawab beliau; \"Semoga demikian!\" Kemudian beliau bersabda: \"Tidak ada seorang muslim yang ditimpa cobaan berupa sakit dan sebagainya, melainkan dihapuskan oleh Allah Ta'ala dosa-dosanya, seperti sebatang pohon yang menggugurkan daunnya.\" Namun di dalam Hadits Zuhair tidak disebutkan 'lafazh; lalu aku meraba tubuh beliau.' Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Abu Kuraib] berkata telah menceritakan kepadaku [Abu Mu'awiyah] Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Rofi'] telah menceritakan kepadaku ['Abdur Razzaq]; Telah menceritakan kepada kami [Sufyan]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami ['Isa bin Yunus] dan [Yahya bin 'Abdul Malik bin Abu Ghaniyyah] seluruhnya dari [Al A'masy] melalui sanad Jarir dengan Hadits yang serupa. Di dalam Hadits Abu Mu'awiyah disebutkan dengan lafazh 'Na'am.' (ya), Demi jiwaku yang berada di tangan-Nya, tidaklah seorang muslim di muka bumi ini",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6560,
			"arabicnumber": "2571.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6561,
			"arabicnumber": "2572.01",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Ishaq bin Ibrahim] seluruhnya dari [Jarir]. [Zuhair] berkata; Telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari [Al Aswad] dia berkata; \"Pada suatu hari, seorang pemuda Quraisy berkunjung kepada [Aisyah], istri Rasulullah, ketika ia sedang berada di Mina. Kebetulan saat itu para sahabat sedang tertawa, hingga Aisyah merasa heran dan sekaligus bertanya; 'Mengapa kalian tertawa? ' Mereka menjawab; 'Si fulan jatuh menimpa tali kemah hingga Iehernya (atau matanya) hampir lepas.' Aisyah berkata; 'Janganlah kalian tertawa terbahak-bahak! Karena sesungguhnya aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidaklah seorang muslim tertusuk duri atau yang Iebih kecil dari itu, melainkan akan ditulis baginya satu derajat dan akan dihapus satu kesalahannya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6562,
			"arabicnumber": "2572.02",
			"text": "Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dab [Abu Kuraib] dan lafazh ini milik mereka; Dan telah menceritakan kepada kami [Ishaq Al Hanzhali]. [Ishaq] berkata; Telah mengabarkan kepada kami. Sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada satupun musibah (cobaan) yang menimpa seorang muslim berupa duri atau yang semisalnya, melainkan dengannya Allah akan mengangkat derajatnya atau menghapus kesalahannya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6563,
			"arabicnumber": "2572.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Numair]; Telah menceritakan kepada kami [Muhammad bin Bisyr]; Telah menceritakan kepada kami [Hisyam] dari [Bapaknya] dari ['Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada satupun musibah (cobaan) yang menimpa seorang muslim berupa duri atau yang semisalnya, melainkan dengannya Allah akan mengangkat menghapus kesalahannya.\" Telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Abu Mu'awiyah]; Telah menceritakan kepada kami [Hisyam] melalui jalur ini",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6564,
			"arabicnumber": "2572.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6565,
			"arabicnumber": "2572.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6566,
			"arabicnumber": "2572.06",
			"text": "Telah menceritakan kepada kami [Abu Ath Thahir]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Malik bin Anas] dari [Yazid bin Khushaifah] dari ['Urwah bin Az Zubair] dari ['Aisyah] istri Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada satupun musibah (cobaan) yang menimpa seorang muslim walaupun berupa duri, melainkan dengannya Allah akan memotong atau menghapus kesalahannya.\" Yazid tidak tahu mana diantara keduanya yang dikatakan Urwah",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6567,
			"arabicnumber": "2572.07",
			"text": "Telah menceritakan kepadaku [Harmalah bin Yahya]; Telah mengabarkan kepada kami ['Abdullah bin Wahb]; Telah mengabarkan kepada kami [Haiwah]; Telah menceritakan kepada kami [Ibnu Al Had] dari [Abu Bakr bin Hazm] dari ['Amrah] dari ['Aisyah] dia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada satupun musibah (cobaan) yang menimpa seorang mukmin walaupun berupa duri, melainkan dengannya Allah akan mencatat untuknya satu kebaikan atau menghapus satu kesalahannya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6568,
			"arabicnumber": "2573",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6569,
			"arabicnumber": "2574",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu Bakr bin Abu Syaibah] keduanya dari [Ibnu 'Uyainah] dan lafazh ini milik Qutaibah; Telah menceritakan kepada kami [Sufyan] dari [Ibnu Muhaishin] seorang syaikh dari bangsa Quraisy, dia mendengar [Muhammad bin Qais bin Makhramah] bercerita dari [Abu Hurairah] dia berkata; \"Tatkala telah turun ayat yang mengatakan: \"Ketika turun ayat Al Qur'an yang berbunyi Barang siapa berbuat kejelekan, niscaya ia akan dibalas dengan kejelekan (siksa) (Qs. An-Nisaa'(4): 123), maka kaum muslimin pun merasa prihatin. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: 'Janganlah kalian berlebihan, tempuhlah kejujuran dan perbaikilah dirimu. Sesungguhnya setiap musibah yang menimpa seorang muslim itu adalah sebagai penghapus dosa, termasuk pula jika ia terantuk batu ataupun tertusuk duri.' Muslim berkata; 'Dia adalah Umar bin Abdurrahman bin Muhshin dari penduduk Makkah",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6570,
			"arabicnumber": "2575",
			"text": "Telah menceritakan kepadaku ['Ubaidullah bin 'Umar Al Qawariri]; Telah menceritakan kepada kami [Yazid bin Zurai']; Telah menceritakan kepada kami [Al Hajjaj Ash Shawwaf]; Telah menceritakan kepadaku [Abu Az Zubair]; Telah menceritakan kepada kami [Jabir bin 'Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam datang berkunjung ke rumah Ummu Saib atau Ummu Musayyab, maka beliau bertanya: \"Sakit apa kamu sampai menggigil begitu?\" Jawab Ummu Saib; \"Demam! Yang Allah Ta'ala tidak memberi berkah dengannya.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu menyalahkan penyakit, karena penyakit itu dapat menghilangkan kesalahan (dosa-dosa) anak Adam, seperti halnya Kir (alat peniup atau penyala api) membersihkan karat-karat besi",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6571,
			"arabicnumber": "2576",
			"text": "Telah menceritakan kepada kami ['Ubaidullah bin 'Umar Al Qawariri]; Telah menceritakan kepada kami [Yahya bin Sa'id] dan [Bisyr bin Al Mufadhdhal] keduanya berkata; Telah menceritakan kepada kami ['Imran Abu Bakr]; Telah menceritakan kepadaku ['Athaa bin Abu Rabah] dia berkata; [Ibnu 'Abbas] berkata kepadaku; \"Maukah aku perlihatkan kepadamu seorang wanita yang termasuk penghuni surga? Aku menjawab; 'Ya.' Ibnu Abbas berkata; 'Ada seorang wanita hitam datang kepada Nabi shallallahu 'alaihi wasallam lalu berkata; Sesungguhnya aku terkena penderita epilepsi dan sering tersingkap auratku, maka berdoalah kepada Allah untukku. Beliau bersabda: \"Jika engkau berkenan, engkau bersabar maka bagimu surga, dan jika engkau berkenan, maka aku akan berdoa kepada Allah agar Allah menyembuhkanmu.\" Ia berkata; Tidak perlu bahkan aku akan bersabar. Namun berdoalah kepada Allah agar (auratku) tidak tersingkap atau menyingkap dariku. Maka beliau mendoakan untuknya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6572,
			"arabicnumber": "2577.01",
			"text": "Telah menceritakan kepada kami ['Abdullah bin 'Abdur Rahman bin Bahram Ad Darimi]; Telah menceritakan kepada kami [Marwan] yaitu Ibnu Muhammad Ad Dimasyqi; Telah menceritakan kepada kami [Sa'id bin 'Abdul 'Aziz] dari [Rabi'ah bin Yazid] dari [Abu Idris Al Khalwani] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam dalam meriwayatkan firman Allah Subhanahu wa Ta'ala yang berbunyi: \"Hai hamba-Ku, sesungguhnya Aku telah mengharamkan diri-Ku untuk berbuat zhalim dan perbuatan zhalim itu pun Aku haramkan diantara kamu. Oleh karena itu, janganlah kamu saling berbuat zhalim! Hai hamba-Ku, kamu sekalian berada dalam kesesatan, kecuali orang yang telah Aku beri petunjuk. Oleh karena itu, mohonlah petunjuk kepada-Ku, niscaya Aku akan memberikannya kepadamu! Hai hamba-Ku, kamu sekalian berada dalam kelaparan, kecuali orang yang telah Aku beri makan. Oleh karena itu, mintalah makan kepada-Ku, niscaya Aku akan memberimu makan! Hai hamba-Ku, kamu sekalian telanjang dan tidak mengenakan sehelai pakaian, kecuali orang yang Aku beri pakaian. Oleh karena itu, mintalah pakaian kepada-Ku, niscaya Aku akan memberimu pakaian! Hai hamba-Ku, kamu sekalian senantiasa berbuat salah pada malam dan siang hari, sementara Aku akan mengampuni segala dosa dan kesalahan. Oleh karena itu, mohonlah ampunan kepada-Ku, niscaya aku akan mengampunimu! Hai hamba-Ku, kamu sekalian tidak akan dapat menimpakan mara bahaya sedikitpun kepada-Ku, tetapi kamu merasa dapat melakukannya. Selain itu, kamu sekalian tidak akan dapat memberikan manfaat sedikitpun kepada-Ku, tetapi kamu merasa dapat melakukannya. Hai hamba-Ku, seandainya orang-orang yang terdahulu dan orang-orang yang belakangan serta manusia dan jin, semuanya berada pada tingkat ketakwaan yang paling tinggi, maka hal itu sedikit pun tidak akan menambahkan kekuasaan-Ku. Hai hamba-Ku, seandainya orang-orang yang terdahulu dan orang-orang yang belakangan serta jin dan manusia semuanya berada pada tingkat kedurhakaan yang paling buruk, maka hal itu sedikitpun tidak akan mengurangi kekuasaan-Ku. Hai hamba-Ku, seandainya orang-orang yang terdahulu dan orang-orang yang belakangan serta semua jin dan manusia berdiri di atas bukit untuk memohon kepada-Ku, kemudian masing-masing Aku penuh permintaannya, maka hal itu tidak akan mengurangi kekuasaan yang ada di sisi-Ku, melainkan hanya seperti benang yang menyerap air ketika dimasukkan ke dalam lautan. Hai hamba-Ku. sesungguhnya amal perbuatan kalian senantiasa akan Aku hisab (adakan perhitungan) untuk kalian sendiri dan kemudian Aku akan berikan balasannya. Barang siapa mendapatkan kebaikan, maka hendaklah ia memuji Allah Subhanahu wa Ta'ala. Dan barang siapa yang mendapatkan selain itu (kebaikan), maka janganlah ia mencela kecuali dirinya sendiri.\" [Said] berkata; [Abu Idris Al Khaulani] ketika menuturkan hadits ini, sambil berlutut.' Telah menceritakannya kepadaku [Abu Bakr bin Ishaq]; Telah menceritakan kepada kami [Abu Mushir]; Telah menceritakan kepada kami [Sa'id bin 'Abdul 'Aziz] melalui jalur ini. Namun Hadits Marwan lebih lengkap lagi dari keduanya. Abu Ishaq berkata; Telah menceritakan kepada kami mengenai Hadits ini, Al Hasan dan Al Husain -kedua anak- Bisyr dan Muhammad bin Yahya mereka berkata; Telah menceritakan kepada kami Abu Mushir. -lalu mereka menyebutkan Haditsnya dengan panjang lebar.- Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Al Mutsanna] keduanya dari ['Abdush Shamad bin 'Abdul Warits]; Telah menceritakan kepada kami [Hammam]; Telah menceritakan kepada kami [Qatadah] dari [Abu Qilabah] dari [Abu Asma'] dari [Abu Dzar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda dalam meriwayatkan dari Allah Tabaraka wa Ta'ala: \"Aku telah mengharamkan kezhaliman kepada diri-Ku dan hamba-Ku, maka janganlah kalian saling berbuat zhalimdan seterusnya dengan Hadits yang serupa. Namun Hadits Abu Idris yang telah kami sebutkan lebih lengkap dari ini",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6573,
			"arabicnumber": "2577.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6574,
			"arabicnumber": "2577.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6575,
			"arabicnumber": "2577.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6576,
			"arabicnumber": "2578",
			"text": "Telah menceritakan kepada kami ['Abdullah bin Maslamah bin Qa'nab]; Telah menceritakan kepada kami [Dawud] yaitu Ibnu Qais dari ['Ubaidillah bin Miqsam] dari [Jabir bin 'Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hindarilah kezhaliman, karena kezhaliman itu adalah mendatangkan kegelapan pada hari kiamat kelak! Jauhilah kekikiran, karena kekikiran itu telah mencelakakan (menghancurkan) orang-orang sebelum kalian yang menyebabkan mereka menumpahkan darah dan menghalalkan yang diharamkan",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6577,
			"arabicnumber": "2579",
			"text": "Telah menceritakan kepadaku [Muhammad bin Hatim]; Telah menceritakan kepada kami [Syababah]; Telah menceritakan kepada kami ['Abdul 'Aziz Al Majisyun] dari ['Abdullah bin Dinar] dari [Ibnu 'Umar] dia berkata; Rasulullah Shallallahu 'Alaihi Sallam bersabda: \"Sesungguhnya kezhaliman itu adalah mendatangkan kegelapan pada hari kiamat kelak",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6578,
			"arabicnumber": "2580",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Laits] dari ['Uqail] dari [Az Zuhri] dari [Salim] dari [Bapaknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang muslim dengan muslim yang lain adalah bersaudara. Ia tidak boleh berbuat zhalim dan aniaya kepada saudaranya yang muslim. Barang siapa yang membantu kebutuhan saudaranya, maka Allah akan memenuhi kebutuhannya. Barang siapa membebaskan seorang muslim dari suatu kesulitan, maka Allah akan membebaskannya dari kesulitan pada hari kiamat. Dan barang siapa menutupi aib seorang muslim, maka Allah akan menutupi aibnya pada hari kiamat kelak",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6579,
			"arabicnumber": "2581",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan ['Ali bin Hujr] keduanya berkata; Telah menceritakan kepada kami [Isma'il] yaitu Ibnu Ja'far dari [Al A'laa] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah bertanya kepada para sahabat: \"Tahukah kalian, siapakah orang yang bangkrut itu?\" Para sahabat menjawab; 'Menurut kami, orang yang bangkrut diantara kami adalah orang yang tidak memiliki uang dan harta kekayaan.' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya umatku yang bangkrut adalah orang yang pada hari kiamat datang dengan shalat, puasa, dan zakat, tetapi ia selalu mencaci-maki, menuduh, dan makan harta orang lain serta membunuh dan menyakiti orang lain. Setelah itu, pahalanya diambil untuk diberikan kepada setiap orang dari mereka hingga pahalanya habis, sementara tuntutan mereka banyak yang belum terpenuhi. Selanjutnya, sebagian dosa dari setiap orang dari mereka diambil untuk dibebankan kepada orang tersebut, hingga akhirnya ia dilemparkan ke neraka",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6580,
			"arabicnumber": "2582",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] dan [Ibnu Hujr] mereka berkata; Telah menceritakan kepada kami [Isma'il] yaitu Ibnu Ja'far dari [Al A'laa] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam: \"Semua hak itu pasti akan dipenuhi pada hari kiamat kelak, hingga kambing bertanduk pun akan dituntut untuk dibalas oleh kambing yang tidak bertanduk",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6581,
			"arabicnumber": "2583",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Numair]; Telah menceritakan kepada kami [Abu Mu'awiyah]; Telah menceritakan kepada kami [Buraid bin Abu Burdah] dari [Bapaknya] dari [Abu Musa] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah Subhanahu wa Ta 'ala akan menangguhkan siksaan bagi orang yang berbuat zhalim. Apabila Allah telah menghukumnya, maka Dia tidak akan pernah melepaskannya.\" Kemudian Rasulullah membaca ayat yang berbunyi: 'Begitulah adzab Tuhanmu, apabila Dia mengadzab penduduk negeri-negeri yang berbuat zhalim. Sesungguhnya adzab-Nya itu sangat pedih dan keras.' (Qs. Huud (11): 102",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6582,
			"arabicnumber": "2584.01",
			"text": "Telah menceritakan kepada kami [Ahmad bin 'Abdullah bin Yunus]; Telah menceritakan kepada kami [Zuhair]; Telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] dia berkata; \"Pada suatu hari, ada dua orang pemuda sedang berkelahi, masing-masing dari kaum Muhajirin dan kaum Anshar. Pemuda Muhajirin itu berteriak; 'Hai kaum Muhajirin, (berikanlah pembelaan untukku!) ' Pemuda Anshar pun berseru; 'Hai kaum Anshar, (berikanlah pembelaan untukku!) ' Mendengar itu, Rasulullah shallallahu 'alaihi wasallam keluar dan bertanya: 'Ada apa ini? Bukankah ini adalah seruan jahiliah? ' Orang-orang menjawab; 'Tidak ya Rasulullah. Sebenarnya tadi ada dua orang pemuda yang berkelahi, yang satu mendorong yang lain.' Kemudian Rasulullah bersabda: 'Baiklah. Hendaklah seseorang menolong saudaranya sesama muslim yang berbuat zhalim atau yang sedang dizhalimi. Apabila ia berbuat zhalim/aniaya, maka cegahlah ia untuk tidak berbuat kezhaliman dan itu berarti menolongnya. Dan apabila ia dizalimi/dianiaya, maka tolonglah ia",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6583,
			"arabicnumber": "2584.02",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah], [Zuhair bin Harb], [Ahmad bin 'Abdah Adh Dhabbi] dan [Ibnu Abi 'Umar], lafazh ini milik Ibnu Abu Syaibah. [Ibnu 'Abdah] berkata; Telah mengabarkan kepada kami. Sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dia berkata; dia mendengar ['Amru] [Jabir bin 'Abdullah] berkata; \"Kami pernah menyertai Rasulullah shallallahu 'alaihi wasallam dalam suatu peperangan. Tiba-tiba seorang sahabat dari kaum Muhajirin mendorong punggung seorang sahabat dari kaum Anshar. LaIu sahabat Anshar itu berseru; 'Hai orang-orang Anshar kemarilah! ' Kemudian sahabat Muhajirin itu berseru pula; 'Hai orang-orang Muhajirin, kemarilah! ' Mendengar seruan-seruan seperti itu, Rasulullah pun berkata: 'Mengapa kalian masih menggunakan cara-cara panggilan jahiliah? ' Para sahabat berkata; 'Ya Rasulullah, tadi ada seorang sahabat dari kaum Muhajirin mendorong punggung seorang sahabat dari kaum Anshar.' Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tinggalkanlah panggilan dengan cara-cara jahiliah, karena yang demikian itu akan menimbulkan efek yang buruk.' Ternyata peristiwa itu didengar oleh Abdullah bin Ubay, seorang tokoh munafik, dan berkata; 'Mereka benar-benar telah melakukannya? Sungguh apabila kita telah kembali ke Madinah, maka orang-orang yang lebih kuat akan dapat mengusir orang-orang yang lebih lemah di sana.' Mendengar pernyataan itu, Umar berkata; 'Ya Rasulullah, izinkanlah saya untuk memenggal leher orang munafik ini.' Rasulullah shallallahu 'alaihi wasallam menjawab: 'Biarkan dan lepaskanlah ia! Supaya orang-orang tidak berkata bahwasanya Muhammad membunuh sahabatnya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6584,
			"arabicnumber": "2584.03",
			"text": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Ishaq bin Manshur] serta [Muhammad bin Rafi']. [Ibnu Rafi'] berkata; Telah menceritakan kepada kami Sedangkan yang lainnya berkata; Telah mengabarkan kepada kami ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Ayyub] dari ['Amru bin Dinar] dari [Jabir bin 'Abdullah] dia berkata; Seseorang dari Muhajirin memukul punggung seseorang dari Anshar, lalu orang anshar itu datang kepada Nabi Shallallahu'alaihi wasallam menanyakan tentang bolehkah mengqishashnya? maka jawab beliau: \"Tinggalkanlah, itu hanyalah perbuatan yang sangat jelek dan keji!\" Ibnu Manshur berkata dalam meriwatkan Hadits tersebut; Amru bin Dinar berkata; 'Aku mendengar Jabir",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6585,
			"arabicnumber": "2585",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu 'Amir Al Asy'ari] keduanya berkata; Telah menceritakan kepada kami ['Abdullah bin Idris] dan [Abu Usamah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Al A'laa Abu Kuraib]; Telah menceritakan kepada kami [Ibnu Al Mubarak] dan [Ibnu Idris] serta [Abu Usamah] seluruhnya dari [Buraid] dari [Abu Burdah] dari [Abu Musa] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang mukmin yang satu dengan mukmin yang lain bagaikan satu bangunan, satu dengan yang lainnya saling mengokohkan",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6586,
			"arabicnumber": "2586.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abdillah bin Numair]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Zakaria] dari [Asy Sya'bi] dari [An Nu'man bin Bisyir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang-Orang mukmin dalam hal saling mencintai, mengasihi, dan menyayangi bagaikan satu tubuh. Apabila ada salah satu anggota tubuh yang sakit, maka seluruh tubuhnya akan ikut terjaga (tidak bisa tidur) dan panas (turut merasakan sakitnya) '\" Telah menceritakan kepada kami [Ishaq bin Al Hanzhali]; Telah mengabarkan kepada kami [Jarir] dari [Mutharrif] dari [Asy Sya'bi] dari [An Nu'man bin Bisyir] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6587,
			"arabicnumber": "2586.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6588,
			"arabicnumber": "2586.03",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Sa'id Al Asyaj] keduanya berkata; Telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Asy Syabi'] dari [An Nu'man bin Bisyir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang-orang mukmin itu bagaikan satu orang, apabila kepalanya terasa sakit, maka seluruh tubuhnya ikut sakit (tidak bisa tidur dan panas)",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6589,
			"arabicnumber": "2586.04",
			"text": "Telah menceritakan kepadaku [Muhammad bin 'Abdullah bin Numair]; Telah menceritakan kepada kami [Humaid bin 'Abdur Rahman] dari [Al A'masy] dari [Khaitsamah] dari [An Nu'man bin Bisyir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: bersabda: \"Orang-orang muslim itu, bagaikan seorang laki-laki, apabila matanya sakit, maka sakitlah seluruh tubuhnya. Dan apabila kepalanya yang sakit, maka sakit pulalah seluruhnya.\" Telah menceritakan kepada kami [Humaid bin 'Abdur Rahman] dari [Al A'masy] dari [Asy Sya'bi] dari [An Nu'man bin Bisyir] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6590,
			"arabicnumber": "2586.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6591,
			"arabicnumber": "2587",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] dan [Ibnu Hujr] mereka berkata; Telah menceritakan kepada kami [Isma'il] yaitu Ibnu Ja'far dari [Al A'laa] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila ada dua orang yang saling mencaci-maki, maka cacian yang diucapkan oleh keduanya itu, dosanya akan ditanggung oleh orang yang memulai cacian selama orang yang dizhalimi itu tidak melampaui batas",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6592,
			"arabicnumber": "2588",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] dan [Ibnu Hujr] mereka berkata; Telah menceritakan kepada kami [Isma'il] yaitu Ibnu Ja'far dari [Al A'laa] dari [Bapaknya] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sedekah itu tidak akan mengurangi harta. Tidak ada orang yang memberi maaf kepada orang lain, melainkan Allah akan menambah kemuliaannya. Dan tidak ada orang yang merendahkan diri karena Allah, melainkan Allah akan mengangkat derajatnya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6593,
			"arabicnumber": "2589",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] dan [Ibnu Hujr] mereka berkata; Telah menceritakan kepada kami [Isma'il] dari [Al A'laa] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah bertanya: \"Tahukah kamu, apakah ghibah itu?\" Para sahabat menjawab; 'Allah dan Rasul-Nya lebih tahu.' Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: 'Ghibah adalah kamu membicarakan saudaramu mengenai sesuatu yang tidak ia sukai.' Seseorang bertanya; 'Ya Rasulullah, bagaimanakah menurut engkau apabila orang yang saya bicarakan itu memang sesuai dengan yang saya ucapkan? ' Rasulullah shallallahu 'alaihi wasallam berkata: 'Apabila benar apa yang kamu bicarakan itu ada padanya, maka berarti kamu telah menggunjingnya. Dan apabila yang kamu bicarakan itu tidak ada padanya, maka berarti kamu telah membuat-buat kebohongan terhadapnya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6594,
			"arabicnumber": "2590.01",
			"text": "Telah menceritakan kepadaku [Umayyah bin Bistham Al 'Aisyi]; Telah menceritakan kepada kami [Yazid] yaitu Ibnu Zurai'; Telah menceritakan kepada kami [Rauh] dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya Allah subhanahu wata'ala tidak menutupi seorang hamba di dunia, kecuali Allah juga akan menutupinya pada hari kiamat kelak",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6595,
			"arabicnumber": "2590.02",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami ['Affan]; Telah menceritakan kepada kami [Wuhaib]; Telah menceritakan kepada kami [Suhail] dari [Bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidaklah seseorang menutupi aib orang lain di dunia, melainkan Allah akan menutupi aibnya di hari kiamat kelak",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6596,
			"arabicnumber": "2591.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu Bakr bin Abu Syaibah] dan ['Amru An Naqid] dan [Zuhair bn Harb] dan [Ibnu Numair] seluruhnya dari [Ibnu 'Uyainah] dan lafazh ini milik Zuhair dia berkata; Telah menceritakan kepada kami [Sufyan] yaitu Ibnu 'Uyainah dari [Ibnu Al Munkadir] dia mendengar ['Urwah bin Az Zubair] berkata; Telah menceritakan kepadaku ['Aisyah] bahwasanya ada seorang laki-laki meminta izin untuk masuk ke rumah dan bertemu dengan Rasulullah shallallahu 'alaihi wasallam. Kemudian Rasulullah berkata kepada para sahabat: \"Izinkanlah ia masuk, sungguh sangat buruk perangainya, atau orang yang paling jelek di kabilahnya.\" Setelah orang tersebut masuk, maka Rasulullah shallallahu 'alaihi wasallam berbicara kepadanya dengan Iunak. Aisyah berkata; 'Saya bertanya kepada Rasulullah; 'Ya Rasulullah, tadi sebelum orang tersebut masuk, engkau berkata seperti itu, tapi setelah ia masuk, maka engkau berkata kepadanya dengan lembut.' Rasulullah shallallahu 'alaihi wasallam menjawab: 'Hai Aisyah, sesungguhnya manusia yang paling buruk kedudukannya di sisi Allah pada hari kiamat adalah orang yang dihindari oleh manusia karena takut kejelekannya.' Telah menceritakan kepadaku [Muhammad bin Rafi'] dan ['Abad bin Humaid] seluruhnya dari ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Ibnu AL Munkadir] melalui jalur ini dengan Hadits yang semakna. Namun dia berkata dengan lafazh; beliau bersabda: 'Sejelek-jelek saudara suatu kaum atau seseorang dari mereka",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6597,
			"arabicnumber": "2591.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6598,
			"arabicnumber": "2592.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna]; Telah menceritakan kepadaku [Yahya bin Sa'id] dari [Sufyan]; Telah menceritakan kepada kami [Manshur] dari [Tamim bin Salamah] dari ['Abdur Rahman bin Hilal] dari [Jarir] dari Nabi shallallahu 'alaihi wasallam bersabda: 'Barang siapa dijauhkan dari sifat lemah lembut (kasih sayang), berarti ia dijauhkan dari kebaikan",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6599,
			"arabicnumber": "2592.02",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Sa'id Al Asyaj] dan [Muhammad bin 'Abdullah bin Numair] mereka berkata; Telah menceritakan kepada kami [Waki']; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Abu Mu'awiyah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Sa'id Al Asyaj]; Telah menceritakan kepada kami [Hafsh] yaitu Ibnu Ghiyats seluruhnya dari [Al A'masy] Dan telah menceritakan kepada kami [Zuhair bin Harb] dan [Ishaq bin Ibrahim] dan lafazh ini milik keduanya; [Zuhair] berkata; Telah menceritakan kepada kami dan berkata [Ishaq]; Telah mengabarkan kepada kami [Jarir] dari [Al A'masy] dari [Tamim bin Salamah] dari ['Abdur Rahman bin Hilal Al 'Absi] dia berkata; Aku mendengar [Jarir] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barang siapa dijauhkan dari sifat lemah lembut (kasih sayang), berarti ia dijauhkan dari kebaikan",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6600,
			"arabicnumber": "2592.03",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami ['Abdul Wahid bin Ziyad] dari [Muhammad bin Abu Isma'il] dari ['Abdur Rahman bin Hilal] dia berkata; Aku mendengar [Jarir bin 'Abdullah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barang siapa dijauhkan dari sifat lemah lembut (kasih sayang), berarti ia dijauhkan dari kebaikan",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6601,
			"arabicnumber": "2593",
			"text": "Telah menceritakan kepada kami [Harmalah bin Yahya At Tujibi]; Telah mengabarkan kepada kami ['Abdullah bin Wahb]; Telah mengabarkan kepadaku [Haiwah]; Telah menceritakan kepadaku [Ibnu Al Had] dari [Abu Bakr bin Hazm] dari ['Amrah] yaitu putri 'Abdur Rahman dari ['Aisyah] istri Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Hai Aisyah, sesungguhnya Allah itu Maha Lembut. Dia mencintai sikap lemah lembut. Allah akan memberikan pada sikap lemah lembut sesuatu yang tidak Dia berikan pada sikap yang keras dan juga akan memberikan apa-apa yang tidak diberikan pada sikap lainnya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6602,
			"arabicnumber": "2594.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6603,
			"arabicnumber": "2594.02",
			"text": "Telah menceritakan kepada kami ['Ubaidullah bin Mu'adz Al 'Anbari]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Syu'bah] dari [Al Miqdam] yaitu Ibnu Syuraih bin Hani dari [Bapaknya] dari ['Aisyah] istri Nabi shallallahu 'alaihi wasallam dari Nabi shallallahu 'alaihi wasallam beliau telah bersabda: \"Sesungguhnya kasih sayang itu tidak akan berada pada sesuatu melainkan ia akan menghiasinya (dengan kebaikan). Sebaliknya, jika kasih sayang itu dicabut dari sesuatu, melainkan ia akan membuatnya menjadi buruk.\" Telah menceritakannya kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] aku mendengar [Al Miqdam bin Syuraih bin Hani] melalui jalur ini. Namun di dalam Haditsnya ada tambahan; Suatu ketika Aisyah menaiki seekor unta, namun dia merasa kesulitan hingga dia menarik-narik unta itu. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: 'Hendaklah kamu berbuat lembut kepadanya, --lalu perawi menyebutkan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6604,
			"arabicnumber": "2595.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] seluruhnya dari [Ibnu 'Ulayyah]. [Zuhair] berkata; Telah menceritakan kepada kami [Isma'il bin Ibrahim]; Telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] dari ['Imran bin Hushain] dia berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, ada seorang wanita Anshar yang tengah mengendarai unta. Namun, unta yang sedang dikendarainya itu memberontak dengan tiba-tiba. Lalu dengan serta-merta wanita itu mengutuk untanya. Ketika Rasulullah mendengar ucapan wanita itu, beliau pun bersabda: 'Turunkanlah beban di atas unta dan lepaskanlah unta tersebut, karena ia telah dikutuk.' Imran berkata; 'Sepertinya saya melihat unta tersebut berjalan bersama rombongan kafilah tanpa ada seorang pun yang mengendarainya.' Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu Ar Rabi'] keduanya berkata; Telah menceritakan kepada kami [Hammad] yaitu Ibnu Zaid; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Abu 'Umar]; Telah menceritakan kepada kami [Ats Tsaqafi] keduanya dari [Ayyub] dengan sanad Isma'il yang serupa dengan Hadits tersebut. Namun di dalam Hadits Hammad, Imran berkata; 'Sepertinya aku melihat unta itu warna putihnya telah bercampur dengan warna hitam.' Sedangkan di dalam Hadits Ats Tsaqafi beliau bersabda: 'Turunkanlah beban di atas unta dan lepaskanlah unta tersebut, karena ia telah dikutuk",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6605,
			"arabicnumber": "2595.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6606,
			"arabicnumber": "2596.01",
			"text": "Telah menceritakan kepada kami [Abu Kamil Al Jahdari Fudhail bin Husain]; Telah menceritakan kepada kami [Yazid] yaitu Ibnu Zurai'; Telah menceritakan kepada kami [At Taimi] dari [Abu 'Utsman] dari [Abu Barzah Al Aslami] dia berkata; Pada suatu ketika seorang budak wanita sedang mengendarai unta dengan membawa perbekalan kaumnya. Lalu wanita tersebut melewati pegunungan yang sempit, hingga tatkala ia melihat Nabi shallallahu 'alaihi wasallam, ia berkata; Hus, Hus, Ya Allah terkutuklah unta ini! Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Kita tidak boleh menyertai unta yang terkutuk.' Telah menceritakan kepada kami [Muhammad bin 'Abdul A'laa]; Telah menceritakan kepada kami [Al Mu'tamir]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku ['Ubaidullah bin Sa'id]; Telah menceritakan kepada kami [Yahya] yaitu Ibnu Sa'id seluruhnya dari [Sulaiman At Taimi] melalui jalur ini. Di dalam Hadits Al Mu'tamir ada tambahan kalimat; 'Demi Allah, janganlah kita menyertai hewan kendaraan yang telah dikutuk oleh Allah, -atau sebagaimana yang beliau sabdakan",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6607,
			"arabicnumber": "2596.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6608,
			"arabicnumber": "2597.01",
			"text": "Telah menceritakan kepada kami [Harun bin Sa'id Al Aili]; Telah menceritakan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Sulaiman] yaitu Ibnu Bilal dari [Al A'laa bin 'Abdur Rahman]; Telah menceritakan kepadanya dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam: \"Tidak seyogyanya orang yang jujur suka melaknat.\" Telah menceritakannya kepadaku [Abu Kuraib]; Telah menceritakan kepada kami [Khalid bin Makhlad] dari [Muhammad bin Ja'far] dari [Al A'laa bin 'Abdur Rahman] melalui jalur ini dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 6609,
			"arabicnumber": "2597.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 6610,
			"arabicnumber": "2598.01",
			"text": "Telah menceritakan kepadaku [Suwaid bin Sa'id]; Telah menceritakan kepadaku [Hafsh bin Maisarah] dari [Zaid bin Aslam] bahwa suatu ketika 'Abdul Malik bin Marwan mengirim perabot rumah miliknya kepada Ummu Ad Darda. Pada suatu malam, Abdul Malik bangun dan memanggil pembantunya. Namun seakan-akan pembantu itu lambat dalam memenuhi panggilannya. Hingga Abdul Malik melaknatnya. Pada pagi harinya, [Ummu Darda] berkata kepadanya; 'Tadi malam aku mendengar kamu melaknat pembantumu ketika kamu memanggilnya.' Aku mendengar [Abu Darda`] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya para pelaknat itu tidak akan dapat menjadi syuhada' (orang-orang yang menjadi saksi) dan tidak pula dapat memberi syafa'at pada hari kiamat kelak.'\" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Ghassan Al Misma'i] serta ['Ashim bin An Nadhr At Taimi] mereka berkata; Telah menceritakan kepada kami [Mu'tamir bin Sulaiman]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami ['Abdur Razzaq] keduanya dari [Ma'mar] dari [Zaid bin Aslam] melalui jalur ini yang semakna dengan Hadits Hafsh bin Maisarah",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 6611,
			"arabicnumber": "2598.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 6612,
			"arabicnumber": "2598.03",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Mu'awiyah bin Hisyam] dari [Hisyam bin Sa'ad] dari [Zaid bin Aslam] dan [Abu Hazim] dari [Ummu Darda] dari [Abu Darda] \"Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya para pelaknat itu tidak akan dapat menjadi syuhada' (orang-orang yang menjadi saksi) dan tidak pula dapat memberi syafa'at pada hari kiamat kelak",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 6613,
			"arabicnumber": "2599",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abbad] dan [Ibnu Abu 'Umar] keduanya berkata; Telah menceritakan kepada kami [Marwan] yaitu Al Fazari dari [Yazid] yaitu Ibnu Kaisan dari [Abu Hazim] dari [Abu Hurairah] dia berkata; \"Seseorang pernah berkata; 'Ya Rasulullah, do'akanlah untuk orang-orang musyrik agar mereka celaka! ' Mendengar itu, Rasulullah shallallahu 'alaihi wasallam menjawab: 'Sesungguhnya aku diutus bukan untuk menjadi pelaknat, tetapi aku diutus sebagai rahmat",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 6614,
			"arabicnumber": "2600.01",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb]; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Adh Dhuha] dari [Masruq] dari ['Aisyah] dia berkata; 'Pada suatu hari, ada dua orang yang bertamu kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian kedua orang tersebut membicarakan sesuatu yang tidak saya ketahui kepada Rasulullah shallallahu 'alaihi wasallam, hingga membuat beliau marah. Tak lama kemudian, saya mendengar Rasulullah melaknat dan mencaci mereka. Setelah kedua laki-laki itu keluar, saya pun bertanya kepada beliau; 'Ya Rasululah, sepertinya dua orang laki-Iaki tadi tidak memperoleh kebaikan, sebagaimana yang diperoleh oleh orang lain. RasuluIIah balik bertanya: 'Apa maksudnya ya Aisyah? ' Aisyah menjawab; 'Maksud saya, engkau telah melaknat dan mencaci-maki kedua orang tersebut.' Lalu Rasulullah bersabda: 'Hai Aisyah, tidak tahukah kamu apa yang pernah saya syaratkan kepada Tuhanku? Sesungguhnya aku telah memohon: 'Ya Allah, aku hanyalah seorang manusia. Jika ada seorang muslim yang aku laknat atau aku maki, maka jadikanlah hal tersebut sebagai pelebur dosa dan pahala baginya.' Telah menceritakannya kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakannya kepada kami ['Ali bin Hujr As Sa'idi] dan [Ishaq bin Ibrahim] serta ['Ali bin Khasyram] -secara keseluruhan- dari ['Isa bin Yunus] keduanya dari [Al A'masy] melalui jalur ini yang serupa dengan Hadits Jarir dan dia berkata; di dalam Hadits 'Isa; keduanya lalu berpaling dari Rasulullah, hingga akhirnya beliau memakinya dan melaknatnya serta mengusir keduanya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 6615,
			"arabicnumber": "2600.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 6616,
			"arabicnumber": "2601.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Numair]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah saya hanya manusia, orang muslim mana saja yang aku cela, atau aku laknat atau aku cambuk, maka jadikanlah baginya sebagai penyuci atau rahmat. Dan telah menceritakan kepada kami [Ibnu Numair]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Al A'masy] dari [Abu Sufyan] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa. Hanya saja dia menggunakan lafazh; penyuci dan pahala. Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami ['Isa bin Yunus] keduanya dari [Al A'masy] dengan sanad 'Abdullah bin Numair yang serupa dengan Haditsnya. Hanya saja dia menggunakan lafazh; 'semoga dijadikan baginya sebagai pahala.' Sedangkan di dalam Hadits Abu Hurairah dan Jabir dengan menggunakan lafazh; 'semoga dijadikan baginya sebagai rahmat",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 6617,
			"arabicnumber": "2602.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 6618,
			"arabicnumber": "2602.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 6619,
			"arabicnumber": "2601.02",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Al Mughirah] yaitu Ibnu 'Abdur Rahman Al Hizami dari [Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Ya Allah, sesungguhnya aku telah membuat perjanjian dengan-Mu yang Engkau tidak akan menyelisihinya, sesungguhnya aku hanyalah seorang manusia, maka mukmin mana saja yang pernah aku sakiti, atau aku cela, atau aku cambuk, atau aku la'nat, hendaklah dengannya Engkau gantikan untuknya pahala shalat, zakat dan taqarrub yang dengannya mereka bisa mendekatkannya kepada-Mu pada hari kiamat.\" Telah menceritakannya kepada kami [Ibnu Abu 'Umar]; Telah menceritakan kepada kami [Sufyan]; Telah menceritakan kepada kami [Abu Az Zinad] melalui jalur ini dengan Hadits yang serupa. Hanya saja ia menggunakan lafazh; 'Jaladuhu.' Namun [Abu Az Zinad] berkata; 'Itu hanya bahasa Abu Hurairah saja, yang benar adalah lafazh; 'Jaladtuhu.' Telah menceritakan kepadaku [Sulaiman bin Ma'bad]; Telah menceritakan kepada kami [Sulaiman bin Harb]; Telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari ['Abdur Rahman Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 6620,
			"arabicnumber": "2601.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 6621,
			"arabicnumber": "2601.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 6622,
			"arabicnumber": "2601.05",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Laits] dari [Sa'id bin Abu Sa'id] dari [Salim] -budak- dari suku Nashr dia berkata; Aku mendengar [Abu Hurairah] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, aku hanyalah Muhammad, seorang manusia yang bisa marah sebagaimana manusia yang lain. Sesungguhnya aku telah membuat perjanjian dengan-Mu yang Engkau tidak akan menyelisihinya. Maka mukmin mana saja yang pernah aku sakiti, atau aku cela, atau aku cambuk, hendaklah hal itu Engkau gantikan untuknya sebagai penghapus dosa dan pengorbanan yang dengannya mereka bisa mendekatkan diri kepada-Mu pada hari kiamat kelak",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 6623,
			"arabicnumber": "2601.06",
			"text": "Telah menceritakan kepadaku [Harmalah bin Yahya]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab]; Telah mengabarkan kepadaku [Sa'id bin Al Musayyab] dari [Abu Hurairah] dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, mukmin mana saja yang pernah aku cela, maka jadikanlah hal itu sebagai pengorbanan baginya yang dengannya ia bertaqarrub kepada-Mu pada hari kiamat",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 6624,
			"arabicnumber": "2601.07",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb] dan ['Abad bin Humaid] keduanya berkata; [Zuhair] Telah menceritakan kepada kami [Ya'qub bin Ibrahim]; Telah menceritakan kepada kami anak saudaraku yaitu [Ibnu Syihab] dari [Pamannya]; Telah menceritakan kepadaku [Sa'id bin Al Musayyab] dari [Abu Hurairah] dia berkata; \"Ya Allah, sesungguhnya aku telah membuat perjanjian dengan-Mu yang Engkau tidak akan menyelisihinya. Maka mukmin mana saja yang pernah aku cela, atau aku cambuk, hendaklah hal itu Engkau gantikan untuknya sebagai penghapus dosa pada hari kiamat kelak",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 6627,
			"arabicnumber": "2603",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb] dan [Abu Ma'an Ar Raqasyi] dan lafazh ini milik Zuhair. Dia berkata; Telah menceritakan kepada kami ['Umar bin Yunus]; Telah menceritakan kepada kami ['Ikrimah bin 'Ammar]; Telah menceritakan kepada kami [Ishaq bin Abu Thalhah]; Telah menceritakan kepadaku [Anas bin Malik] dia berkata; \"Ummu Sulaim, yaitu ibu Anas, mempunyai seorang anak yatim perempuan. Pada suatu ketika, Rasulullah melihat anak yatim tersebut dan berkata: 'Oh kamu rupanya! Kamu memang sudah besar tapi belum dewasa.' Mendengar ucapan tersebut, anak yatim perempuan itu kembali kepada Ummu Sulaim sambil menangis. Kemudian Ummu Sulaim bertanya; 'Ada apa denganmu hai anakku? ' Anak perempuannya itu menjawab; 'Rasulullah telah mengatakan kepada saya bahwasanya saya belum dewasa dan saya tidak akan menjadi dewasa selamanya.' Mendengar pengaduan anak perempuannya itu, akhirnya Ummu Sulaim pun segera keluar dari rumah dengan mengenakan kerudungnya untuk bertemu Rasulullah. Setelah bertemu, Rasulullah shallallahu 'alaihi wasallam Iangsung bertanya: 'Ada apa denganmu ya Ummu Sulaim? ' Ummu Sulaim menjawab; 'Anak perempuan saya mengadu kepada saya bahwasanya engkau mengucapkan kata-kata yang menyedihkan hati anak perempuan saya yang yatim.' Rasulullah shallallahu 'alaihi wasallam balik bertanya: 'Apakah maksudmu hai Ummu Sulaim? ' Ummu Sulaim mulai menjelaskan; 'Kata anak perempuan saya, engkau telah mengatakan bahwasanya ia tidak akan menjadi dewasa.' Mendengar keterangan itu, Rasulullah pun tertawa dan berkata: 'Hai Ummu Sulaim, tidak tahukah kamu apa yang pernah aku syaratkan kepada Tuhanku? Sesungguhnya ada syarat yang harus aku penuhi terhadap Tuhanku. Aku berkata; 'Ya Tuhanku, aku hanyalah seorang manusia. Aku dapat bersikap ridha sebagaimana orang lain dan aku juga dapat marah, sebagaimana orang lain. Apabila ada seseorang dari umatku yang tersakiti oleh kata-kata ku yang semestinya tidak layak aku ucapkan kepadanya, maka jadikanlah hal tersebut sebagai pelebur dosa dan sebagai pahala yang dapat mendekatkannya kepada-Mu di hari kiamat kelak.' Abu Ma'an berkata; 'Lafazh yatimah yang disebutkan tiga kali dalam hadits ini seharusnya diucapkan dalam bentuk tashgir (panggilan untuk makna kecil), yaitu dengan bunyi yutaimah (si yatim kecil)",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 6628,
			"arabicnumber": "2604.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna Al 'Anazii]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Basysyar] dan lafazh ini milik Ibnu Al Mutsanna dia berkata; Telah menceritakan kepada kami [Umayyah bin Khalid]; Telah menceritakan kepada kami [Syu'bah] dari [Abu Hamzah Al Qashshab] dari [Ibnu 'Abbas] dia berkata; \"Pada suatu ketika, saya sedang bermain bersama anak-anak. Tiba-tiba Rasulullah shallallahu 'alaihi wasallam datang dan saya langsung bersembunyi di balik pintu. Kemudian beliau mendekat seraya menepuk pundak saya dari belakang dan berkata: 'Hai Abdullah, pergi dan panggil Mu'awiyah kemari! ' lbnu Abbas berkata; 'Tak lama kemudian saya datang untuk menemui beliau sambil berkata; 'Ya Rasulullah, Mu'awiyah sedang makan.' Setelah itu, Rasulullah menyuruh saya kembali sambil berkata: 'Pergi dan panggil Mu'awiyah untuk datang kemari! ' Ibnu Abbas berkata; 'Kemudian saya datang menemui Rasulullah dan berkata: 'Ya Rasulullah, Mua'wiyah sedang makan.' Lalu Rasulullah berkata: 'Semoga Allah tidak mengenyangkan perutnya.' lbnu Mutsanna berkata; 'Saya bertanya kepada Umayyah; 'Apa yang dimaksud dengan menepuk dari belakang? ' Umayyah menjawab; 'Menepuk pada bagian tengkuk dengan satu tepukan.' Telah menceritakan kepadaku [Ishaq bin Manshur]; Telah mengabarkan kepada kami [An Nadhr bin Syumail]; Telah menceritakan kepada kami [Syu'bah]; Telah mengabarkan kepada kami [Abu Hamzah] Aku mendengar [Ibnu 'Abbas] berkata; Pada suatu ketika, saya sedang bermain bersama anak-anak. Tiba-tiba Rasulullah shallallahu 'alaihi wasallam datang dan saya langsung bersembunyi. -sebagaimana Hadits di atas",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 6629,
			"arabicnumber": "2604.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 6630,
			"arabicnumber": "2526.03",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] berkata; Aku membaca Hadits [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sejelek-jelek manusia adalah orang yang bermuka dua, dia datang kesini dengan satu sikap dan bila datang ke yang lain dengan sikap yang lain",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 6631,
			"arabicnumber": "2526.04",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Laits]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Rumh]; Telah mengabarkan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari ['Irak bin Malik] dari [Abu Hurairah] bahwa dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sejelek-jelek manusia adalah orang yang bermuka dua, dia datang kesini dengan satu sikap dan bila datang ke yang lain dengan sikap yang lain",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 6632,
			"arabicnumber": "2526.05",
			"text": "Telah menceritakan kepadaku [Harmalah bin Yahya]; Telah mengabarkan kepadaku [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab]; Telah menceritakan kepadaku [Sa'id bin Al Musayyab] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Zuhair bin Harb]; Telah menceritakan kepada kami [Jarir] dari ['Umarah] dari [Abu Zur'ah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalian akan menjumpai seburuk-buruk manusia, yaitu orang yang bermuka dua, dia datang kesini dengan satu sikap dan bila datang ke yang lain dengan sikap yang lain",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 6633,
			"arabicnumber": "2605.01",
			"text": "Telah menceritakan kepadaku [Harmalah bin Yahya]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab]; Telah mengabarkan kepadaku [Humaid bin 'Abdur Rahman bin 'Auf] bahwa Ibunya [Ummu Kultsum bin 'Uqbah bin Abu Mu'aith] -dan ia termasuk perempuan yang turut hijrah dalam kelompok pertama yang berbai'at kepada Rasulullah shallallahu 'alaihi wasallam- bahwasanya ia pernah mendengar Rasulullah bersabda: \"Orang yang mendamaikan pihak-pihak yang bertikai, orang yang berkata demi kebaikan, dan orang yang membangkitkan (mengingatkan) kebaikan bukanlah termasuk pendusta.\" lbnu Syihab berkata; 'Saya tidak pernah mendengar diperbolehkannya dusta yang diucapkan oleh manusia kecuali dalam tiga hal, yaitu; dusta dalam peperangan, dusta untuk mendamaikan pihak-pihak yang bertikai, dan dusta suami terhadap istri atau istri terhadap suami (untuk meraih kebahagiaan atau menghindari keburukan). Telah menceritakan kepada kami [Amru An Naqid] Telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'ad] Telah menceritakan kepada kami [Bapakku] dari [Shalih] Telah menceritakan kepada kami [Muhammad bin Muslim bin Ubaidullah bin Abdullah bin Syihab] melalui jalur ini dengan Hadits yang serupa. Hanya saja pada Hadits Shalih disebutkan dengan lafazh; Ummu Kultsum berkata; 'Saya tidak pernah mendengar Rasulullah shallallahu 'alaihi wasallam memberikan dispensasi kedustaan yang diucapkan oleh manusia kecuali dalam tiga hal.'-sebagaimana di dalam Hadits Yunus dari perkataan Ibnu Syihab. Telah menceritakannya kepada kami ['Amru An Naqid]; Telah menceritakan kepada kami [Isma'il bin Ibrahim]; Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] melalui jalur ini hanya sampai perkataan; 'membangkitkan kebaikan'. -tanpa menyebutkan kalimat setelah itu",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 6634,
			"arabicnumber": "2605.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 6635,
			"arabicnumber": "2605.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 6636,
			"arabicnumber": "2606",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] Aku mendengar [Abu Ishaq] bercerita dari [Abu Al Ahwash] dari ['Abdullah bin Mas'ud] dia berkata; bahwa Muhammad shallallahu 'alaihi wasallam bersabda: 'Perhatikanlah, aku akan memberitahukan kepada kalian apa itu Al 'Adhu? Al 'Adhu adalah memfitnah dengan menyebarluaskan isu di tengah masyarakat.\" Rasulullah shallallahu 'alaihi wasallam juga bersabda: 'Sesungguhnya orang yang selalu berkata jujur akan dicatat sebagai seorang yang jujur dan orang yang selalu berdusta akan dicatat sebagai pendusta",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 6637,
			"arabicnumber": "2607.01",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] dan ['Utsman bin Abu Syaibah] serta [Ishaq bin Ibrahim]. [Ishaq] berkata; Telah mengabarkan kepada kami Sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Wail] dari ['Abdullah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kejujuran itu akan membimbing pada kebaikan. Dan kebaikan itu akan membimbing ke surga. Seseorang yang senantiasa berlaku jujur maka ia akan dicatat sebagai orang yang jujur. Dan sesungguhnya dusta itu akan mengantarkan pada kejahatan. Dan sesungguhnya kejahatan itu akan menggiring ke neraka. Seseorang yang memelihara kedustaan, maka ia akan dicatat sebagai pendusta",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 6638,
			"arabicnumber": "2607.02",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Hannad Bin As Sari] keduanya berkata; Telah menceritakan kepada kami [Abu Al Ahwash] dari [Manshur] dari [Abu Wail] dari ['Abdullah bin Mas'ud] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kejujuran itu adalah kebaikan. Dan kebaikan itu akan membimbing ke surga. Seseorang yang senantiasa berlaku jujur dan memelihara kejujuran, maka ia akan dicatat sebagai orang yang jujur di sisi Allah. Dan sesungguhnya dusta itu adalah kejahatan. Dan sesungguhnya kedustaan itu akan menggiring ke neraka. Seseorang yang memelihara kedustaan, maka ia akan dicatat sebagai pendusta di sisi Allah.\" Ibnu Abu Syaibah berkata dalam meriwayatkan Hadits tersebut; dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 6639,
			"arabicnumber": "2607.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Numair]; Telah menceritakan kepada kami [Abu Mu'awiyah] dan [Waki'] keduanya berkata; Telah menceritakan kepada kami [Al A'masy]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Abu Mu'awiyah]; Telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari ['Abdullah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Kalian harus berlaku jujur, karena kejujuran itu akan membimbing kepada kebaikan. Dan kebaikan itu akan membimbing ke surga. Seseorang yang senantiasa berlaku jujur dan memelihara kejujuran, maka ia akan dicatat sebagai orang yang jujur di sisi Allah. Dan hindarilah dusta, karena kedustaan itu akan menggiring kepada kejahatan dan kejahatan itu akan menjerumuskan ke neraka. Seseorang yang senantiasa berdusta dan memelihara kedustaan, maka ia akan dicatat sebagai pendusta di sisi Allah.'\" Telah menceritakan kepada kami [Minjab bin Al Harits At Tamimi]; Telah mengabarkan kepada kami [Ibnu Mushir]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq bin Ibrahim Al Hanzhali]; Telah mengabarkan kepada kami ['Isa bin Yunus] keduanya dari [Al A'masy] melalui jalur ini. Namun di dalam Hadits Isa tidak disebutkan lafazh; 'memelihara kejujuran dan memelihara kedustaan.' Sedangkan di dalam Hadits Ibnu Mushir disebutkan dengan lafazh; Hatta yuktabahullah.' (hingga Allah mencatatnya sebagai pendusta)",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 6640,
			"arabicnumber": "2607.04",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 6641,
			"arabicnumber": "2608.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan ['Utsman bin Abu Syaibah] lafazh ini milik Qutaibah. Dia berkata; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim At Taimi] dari [Al Harits bin Suwaid] dari ['Abdullah bin Mas'ud] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah bertanya kepada para sahabat: 'Menurut kalian, siapakah orang yang mandul itu? ' Abdullah bin Mas'ud berkata; 'Kami menjawab; 'Yaitu orang yang tidak mempunyai anak.' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Bukan itu yang dimaksud dengan mandul. Tetapi yang dimaksud dengan mandul adalah orang yang tidak dapat memberikan apa-apa kepada anaknya.' Kemudian Rasulullah shallallahu 'alaihi wasallam bertanya lagi: 'Siapakah orang yang kalian anggap paling kuat? ' Abdullah bin Mas'ud berkata; 'Kami menjawab; 'Yaitu orang yang tidak dapat dikalahkan oleh orang lain.'\" RasululIah berkata: 'Bukan itu yang dimaksud dengan orang yang paling kuat. Tetapi orang yang paling kuat adalah orang yang dapat menguasai dirinya ketika ia sedang marah.' Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami ['Isa bin Yunus] seluruhnya dari [Al A'masy] melalui jalur ini dengan Hadits yang semakna",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 6642,
			"arabicnumber": "2608.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 6643,
			"arabicnumber": "2609.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dan ['Abdul A'laa bin Hammad] keduanya berkata; keduanya telah aku bacakan di hadapan [Malik] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang paling kuat bukanlah orang yang tidak dapat dikalahkan oleh orang lain. Tetapi orang yang paling kuat adalah orang yang dapat menguasai dirinya ketika ia sedang marah",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 6644,
			"arabicnumber": "2609.02",
			"text": "Telah menceritakan kepada kami [Hajib bin Al Walid]; Telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri]; Telah mengabarkan kepadaku [Humaid bin 'Abdur Rahman] bahwa [Abu Hurairah] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukanlah yang disebut dengan kuat itu orang yang jago gulat.\" Para sahabat bertanya; \"Wahai Rasulullah, lalu siapakah yang disebut dengan orang yang kuat?\" Beliau menjawab: \"Yaitu orang yang mampu mengendalikan dirinya ketika marah.\" Dan telah menceritakannya kepada kami [Muhammad bin Rafi'] dan ['Abad bin Humaid] seluruhnya dari ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami ['Abdullah bin 'Abdur Rahman bin Bihram]; Telah mengabarkan kepada kami [Abu Al Yaman]; Telah mengabarkan kepada kami [Syu'aib] keduanya dari [Az Zuhri] dari [Humaid bin 'Abdur Rahman bin 'Auf] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 6645,
			"arabicnumber": "2609.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 6646,
			"arabicnumber": "2610.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Muhammad bin Al A'laa] keduanya berkata; [Yahya] Telah mengabarkan kepada kami dan berkata [Ibnu Al A'laa]; Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari ['Adi bin Tsabit] dari [Sulaiman bin Shurad] dia berkata; \"Pada suatu hari ada dua orang laki-laki yang saling mencaci maki di sisi Rasulullah shallallahu 'alaihi wasallam. Kemudian salah seorang di antara keduanya merah kedua matanya (karena marah) dan keringatnya bercucuran. Lalu Rasulullah melihatnya dan berkata: 'Sungguh aku mengetahui satu kalimat yang seandainya diucapkan, maka marahnya akan hilang. Audzu billahi minasy-syaithaainir rajiim (Aku berlindung kepada Allah dari godaan syetan yang terkutuk).' ' Orang laki-laki yang marah tersebut berkata; 'Apakah kamu menganggap saya sudah gila? Ibnu Al 'Alaa`i berkata; Apakah kamu menganggap saya sudah gila? -tanpa menyebutkan kalimat 'ar rajul",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 6647,
			"arabicnumber": "2610.02",
			"text": "Telah menceritakan kepada kami [Nashr bin 'Ali Al Jahdhami]; Telah menceritakan kepada kami [Abu Usamah] Aku mendengar [Al A'masy] berkata; Aku mendengar ['Adi bin Tsabit] berkata; Telah menceritakan kepada kami [Sulaiman bin Shurad] dia berkata; \"Pada suatu hari ada dua orang laki-laki yang saling mencaci maki di sisi Rasulullah shallallahu 'alaihi wasallam. Kemudian salah seorang di antara keduanya marah dan merah mukanva. Lalu Rasulullah melihatnya dan berkata: 'Sungguh aku mengetahui satu kalimat yang seandainya diucapkan, maka marahnya akan hilang. Audzu billahi minasy-syaithaainir rajiim (Aku berlindung kepada Allah dari godaan syetan yang terkutuk).' Setelah itu, orang yang marah itu didekati oleh seseorang yang telah mendengar ucapan Rasulullah shallallahu 'alaihi wasallam dan ia berkata kepadanya; 'Mengertikah kamu apa yang telah diucapkan Rasulullah shallallahu 'alaihi wasallam tadi? Sesungguhnya Rasulullah telah bersabda: 'Sungguh aku mengetahui satu kalimat yang seandainya diucapkan, maka nafsu amarahnya akan hilang. Aku berlindung kepada Allah dari godaan syetan yang terkutuk.' Orang laki-laki yang marah tersebut berkata; 'Apakah kamu menganggap saya sudah gila? ' Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Al A'masy] melalui jalur ini",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 6648,
			"arabicnumber": "2610.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 6649,
			"arabicnumber": "2611.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Yunus bin Muhammad] dari [Hammad bin Salamah] dari [Tsabit] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Setelah membentuk tubuh Adam alaihi salam, Allah Subhanahu wa Ta'ala pun membiarkannya di surga sesuai dengan kehendak-Nya. Tak lama kemudian, iblis datang mengitari tubuh Adam sambil mengamati. Setelah mengetahui bahwasanya tubuh Adam itu mempunyai rongga, maka lblis pun mengerti bahwasanya Adam diciptakan dalam kondisi yang tidak dapat mengendalikan dirinya sendiri.\" Telah menceritakan kepada kami [Abu Bakr bin Nafi']; Telah menceritakan kepada kami [Bahz]; Telah menceritakan kepada kami [Hammad] melalui jalur ini dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 6650,
			"arabicnumber": "2611.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 6651,
			"arabicnumber": "2612.01",
			"text": "Telah menceritakan kepada kami ['Abdullah bin Maslamah bin Qa'nab]; Telah menceritakan kepada kami [Al Mughirah] yaitu Al Hizami dari [Abu Al Zinad] dari [Al A'raj] dari [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian berkelahi dengan saudaranya maka hindarilah memukul bagian muka.\" Telah menceritakannya kepada kami ['Amru An Naqid] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Abu Az Zinad] melalui jalur ini dengan lafazh; Apabila dharaba (memukul) salah seorang dari kalian",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 6652,
			"arabicnumber": "2612.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 6653,
			"arabicnumber": "2612.03",
			"text": "Telah menceritakan kepada kami [Syaiban bin Farrukh]; Telah menceritakan kepada kami [Abu 'Awanah] dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Apabilah salah seorang dari kalian berkelahi, dengan saudaranya sesama muslim maka hindarilah dari memukul wajah",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 6654,
			"arabicnumber": "2612.04",
			"text": "Telah menceritakan kepada kami ['Ubaidullah bin Mu'adz Al 'Anbari]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dia mendengar [Abu Ayyub] bercerita dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Apabila salah seorang darimu berkelahi dengan saudaranya yang muslim, maka janganlah menampar wajah",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 6655,
			"arabicnumber": "2612.05",
			"text": "Telah menceritakan kepada kami [Nashr bin 'Ali Al Jahdhami]; Telah menceritakan kepadaku [Bapakku]; Telah menceritakan kepada kami [Al Mutsanna]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Muhammad bin Hatim]; Telah menceritakan kepada kami ['Abdur Rahman bin Mahdi] dari [Al Mutsanna bin Sa'id] dari [Qatadah] dari [Abu Ayyub] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: -sedangkan di dalam Hadits Abu Hatim disebutkan dengan lafazh 'dari Nabi shallallahu 'alaihi wasallam: -\"Apabila salah seorang darimu berkelahi dengan saudaranya yang muslim, maka hendaklah ia menghindari bagian wajah, karena Allah telah menciptakan Adam dengan rupa dan bentuk wajahnya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 6656,
			"arabicnumber": "2612.06",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna]; Telah menceritakan kepadaku ['Abdush Shamad]; Telah menceritakan kepada kami [Hammam]; Telah menceritakan kepada kami [Qatadah] dari [Yahya bin Malik Al Maraghi] yaitu Abu Ayyub dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang darimu berkelahi dengan saudaranya yang muslim, maka hindarilah dari menampar wajah",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 6657,
			"arabicnumber": "2613.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari [Hisyam bin Hakim bin Hizam] dia berkata; \"Saya pernah melewati beberapa orang di Syam yang dijemur di terik matahari sedangkan kepala mereka dituangi minyak. Kemudian Hisyam bertanya; 'Mengapa mereka ini dihukum? ' Seseorang menjawab; 'Mereka disiksa karena masalah pajak.' Hisyam berkata; 'Sesungguhnya saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya Allah akan menyiksa orang-orang yang menyiksa orang lain di dunia",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 6658,
			"arabicnumber": "2613.02",
			"text": "Telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [Bapaknya] dia berkata; [Hisyam bin Hakim bin Hizam] pernah melewati beberapa orang dari para petani di Syam yang dijemur di terik matahari. Kemudian Hisyam bertanya; 'Mengapa mereka ini dihukum? ' mereka menjawab; 'Mereka disiksa karena masalah pajak.' Hisyam berkata; Aku bersaksi'Sesungguhnya saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya Allah akan menyiksa orang-orang yang menyiksa orang lain di dunia.\" Telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Waki'] dan [Abu Mu'awiyah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami [Jarir] seluruhnya dari [Hisyam] melalui jalur ini di dalam Hadits Jarir ada tambahan; di Palestina pemimpin mereka pada waktu itu adalah Umair bin Sa'ad. Maka Hisyam menemuinya dan menyampaikan Hadits tersebut kepadanya. Akhirnya Umair menyuruh untuk membebaskan para petani tersebut",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 6659,
			"arabicnumber": "2613.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 6660,
			"arabicnumber": "2613.04",
			"text": "Telah menceritakan kepadaku [Abu Ath Thahir]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari ['Urwah bin Az Zubair] bahwa [Hisyam bin Hakim] pernah melewati orang di Syam sedang menjemur beberapa orang petani di terik matahari karena tidak membayar pajak. Kemudian Hisyam bertanya; 'Mengapa mereka ini dihukum? ' 'Sesungguhnya saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya Allah akan menyiksa orang-orang yang menyiksa orang lain di dunia",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 6661,
			"arabicnumber": "2614.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ishaq bin Ibrahim]. [Ishaq] berkata; Telah mengabarkan kepada kami. Sedangkan [Abu Bakr] berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Amru] dia mendengar [Jabir] berkata; Suatu ketika seorang laki-laki lewat di dalam masjid dengan membawa panah. Maka Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Peganglah mata panahnya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 6662,
			"arabicnumber": "2614.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Ar Rabi']; Telah menceritakan kepada kami dan berkata [Yahya]; dan lafazh ini miliknya; Telah mengabarkan kepada kami [Hammad bin Zaid] dari ['Amru bin Dinar] dari [Jabir bin 'Abdullah] bahwa suatu ketika seorang laki-laki lewat di dalam masjid dengan membawa beberapa panah dengan menampakkan mata panah-panah tersebut. Maka orang tersebut disuruh untuk memegang mata panahnya agar tidak melukai seorang muslim",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 6663,
			"arabicnumber": "2614.03",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Laits]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Rumh]; Telah mengabarkan kepada kami [Al Laits] dari [Abu Az Zubair] dari [Jabir] dari Rasulullah shallallahu 'alaihi wasallam bahwasanya beliau pernah memerintahkan kepada orang yang menyedekahkan panah di masjid agar tidak membawanya kecuali dengan memegang ujung matanya yang tajam (agar tidak mengenai orang lain yang sedang berada di masjid). Ibnu Rumh berkata dengan lafazh; 'yashaddaqu (bersedekah) dengan panah",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 6664,
			"arabicnumber": "2615.01",
			"text": "Telah menceritakan kepada kami [Haddab bin Khalid]; Telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Abu Burdah] dari [Abu Musa] bahwa Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Apabila kamu berjalan di suatu masjid atau di pasar sambil membawa panah, maka peganglah ujungnya yang tajamnya. Kemudian, peganglah pada ujungnya yang tajam. Kemudian, peganglah ujungnya yang tajam.\" Abu Musa berkata; 'Demi Allah, kami tidak ingin mati hingga sebagian kami membungkus mata panahnya agar tidak mengenai orang lain",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 6665,
			"arabicnumber": "2615.02",
			"text": "Telah menceritakan kepada kami ['Abdullah bin Barrad Al Asy'ari] dan [Muhammad bin Al A'laa] lafazh ini milik 'Abdullah keduanya berkata; Telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Apabila salah seorang dari kalian melewati masjid atau pasar dengan membawa busur panah, maka hendaklah ia memegang mata panahnya hingga tidak mengenai salah seorang dari kaum muslimin.\" Atau beliau bersabda: 'hendaklah menggenggam mata panahnya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 6666,
			"arabicnumber": "2616.01",
			"text": "Telah menceritakan kepadaku ['Amru An Naqid] dan [Ibnu Abu 'Umar], ['Amru] berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ayyub] dari [Ibnu Sirin] Aku mendengar [Abu Hurairah] berkata; Abu Qasim shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang mengacungkan senjata kepada saudaranya, maka malaikat akan melaknatinya hingga ia menurunkannya kembali. Walaupun dia saudara sebapak atau saudara seibu. Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Yazid bin Harun] dari [Ibnu 'Aun] dari [Muhammad] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 6667,
			"arabicnumber": "2616.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 6668,
			"arabicnumber": "2617",
			"text": "Telah menceritakan kepada kami [Muhammad bin Rafi']; Telah menceritakan kepada kami ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dia berkata; Inilah yang telah diceritakan [Abu Hurairah] kepada kami dari Rasulullah shallallahu 'alaihi wasallam -lalu dia menyebutkan beberapa Hadits di antaranya; Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Janganlah kamu mengacungkan senjata kepada saudaramu karena seseorang di antara kamu tidak dapat mengetahui kemungkinan syetan akan melemparkan apa yang ada ditangannya sehingga ia terjerumus ke dalam jurang neraka",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 6669,
			"arabicnumber": "1914.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku membaca Hadits [Malik] dari [Sumayya] -budak- Abu Bakr dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika seorang lelaki tengah berjalan di suatu jalan ia mendapati batang kayu yang berduri dijalan tersebut, lalu ia mengambil dan membuangnya, maka Allah 'azza wajalla berterima kasih kepadanya dan mengampuninya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 6670,
			"arabicnumber": "1914.03",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb]; Telah menceritakan kepada kami [Jarir] dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Pada suatu ketika ada seseorang yang melewati sebatang ranting pohon yang menjuntai ke jalan. Kemudian orang tersebut berkata; 'Demi Allah, saya akan menyingkirkan ranting pohon ini agar tidak mengganggu kaum muslimin yang lewat.' Akhirnya orang tersebut dimasukkan ke dalam surga",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 6671,
			"arabicnumber": "1914.04",
			"text": "Telah menceritakannya kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami ['Ubaidullah]; Telah menceritakan kepada kami [Syaiban] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sungguh aku melihat seseorang sedang berbahagia di surga dikarenakan ia telah memotong batang pohon yang menjuntai ke jalan yang mengganggu orang lewat",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 6672,
			"arabicnumber": "1914.05",
			"text": "Telah menceritakan kepadaku [Muhammad bin Hatim]; Telah menceritakan kepada kami [Bahz]; Telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Abu Rafi'] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada sebuah pohon yang menghalangi kaum muslimin lewat, lalu seseorang memotongnya. Karenanya orang tersebut masuk surga",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 6673,
			"arabicnumber": "2618.01",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb]; Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Aban bin Sham'ah]; Telah menceritakan kepadaku [Abu Al Wazi']; Telah menceritakan kepadaku [Abu Barzah] dia berkata; \"Saya pernah bertanya; 'Ya Rasulullah, ajarkanlah kepada saya sesuatu yang dapat saya ambil manfaatnya! ' Rasulullah shallallahu 'alaihi wasallam menjawab: 'Singkirkanlah gangguan dari jalan kaum muslimin",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 6674,
			"arabicnumber": "2618.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Abu Bakr bin Syu'aib bin Al Habhab] dari [Abu Al Wazi' Ar Rasibi] dari [Abu Barzah Al Aslami] bahwa Abu Barzah berkata; Aku berkata kepada Rasulullah shallallahu 'alaihi wasallam; 'Ya Rasulullah, aku tidak tahu apakah aku masih tetap hidup sepeninggalmu atau tidak, maka bekalilah aku dengan sesuatu yang dengannya Allah memberikan manfaat kepadaku. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lakukanlah ini dan itu.-Abu Bakr lupa tentang apa yang diperintahkan beliau kepadanya.- juga orang itu disuruh menyingkirkan benda berbahaya dari jalan",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 6675,
			"arabicnumber": "2242.04",
			"text": "Telah menceritakan kepadaku ['Abdullah bin Muhammad bin Asma' bin 'Ubaid Adh Dhuba'i]; Telah menceritakan kepada kami [Juwairiyah] yaitu Ibnu Asma' dari [Nafi'] dari ['Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wanita disiksa lantaran seekor kucing yang mati karena ia kurung, maka karenanya ia pun masuk neraka. Sebab ia tidak memberinya makan atau minum ketika ia mengurungnya. Juga tidak melepasnya sehingga mencari makan dari serangga bumi.\" Telah menceritakan kepadaku [Harun bin 'Abdullah] dan ['Abdullah bin Ja'far bin Yahya bin Khalid] seluruhnya dari [Ma'an bin 'Isa] dari [Malik bin Anas] dari [Nafi'] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam yang semakna dengan Hadits Juwariyah",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 6676,
			"arabicnumber": "2242.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 6677,
			"arabicnumber": "2242.06",
			"text": "Dan telah menceritakannya kepadaku [Nashr bin 'Ali Al Jahdhami]; Telah menceritakan kepada kami ['Abdul A'laa] dari ['Ubaidullah bin 'Umar] dari [Nafi'] dari [Ibnu 'Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wanita disiksa lantaran seekor kucing yang diikatnya. Ia tidak memberinya makan atau minum. Juga tidak melepasnya sehingga mencari makan dari serangga bumi.\"Telah menceritakan kepada kami [Nashr bin 'Ali Al Jahdhami]; Telah menceritakan kepada kami ['Abdul A'laa] dari ['Ubaidullah] dari [Sa'id Al Maqburi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 6678,
			"arabicnumber": "2242.07",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 6679,
			"arabicnumber": "2619",
			"text": "Telah menceritakan kepada kami [Muhammad bin Rafi']; Telah menceritakan kepada kami ['Abdur Razzaq]; Telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dia berkata; Inilah yang telah diceritakan oleh [Abu Hurairah] kepada kami. -lalu dia menyebutkan beberapa Hadits di antaranya, - Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wanita masuk neraka karena seekor kucing yang ia ikat sehingga mati, ia tidak memberinya makan atau melepasnya sehingga bisa mencari makanan dari serangga bumi",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 6680,
			"arabicnumber": "2620",
			"text": "Telah menceritakan kepada kami [Ahmad bin Yusuf Al Azdi]; Telah menceritakan kepada kami ['Umar bin Hafsh bin Ghiyats]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Al A'masy]; Telah menceritakan kepada kami [Abu Ishaq] dari [Abu Muslim Al Aghar] bahwasannya dia telah menceritakan kepadanya dari [Abu Sa'id Al Khudri] dan [Abu Hurairah] keduanya berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kemuliaan adalah sarung-Nya dan kesombongan adalah selendang-Nya. Barang siapa menentang-Ku, maka Aku akan mengadzabnya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 6681,
			"arabicnumber": "2621",
			"text": "Telah menceritakan kepada kami [Suwaid bin Sa'id] dari [Mu'tamir bin Sulaiman] dari [Bapaknya]; Telah menceritakan kepada kami [Abu 'Imran Al jauni] dari [Jundab] bahwa Rasulullah shallallahu 'alaihi wasallam telah bercerita: \"Pada suatu ketika ada seseorang yang berkata; 'Demi Allah, sesungguhnya Allah tidak akan mengampuni si fulan.' Sementara Allah berfirman: 'Siapa yang bersumpah dengan kesombongannya atas nama-Ku bahwasanya Aku tidak akan mengampuni si fulan? Ketahuilah, sesungguhnya Aku telah mengampuni si fulan dan telah memutuskan amal perbuatanmu.\" Kurang lebih begitulah sabda Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 6682,
			"arabicnumber": "2622",
			"text": "Telah menceritakan kepadaku [Suwaid bin Sa'id]; Telah menceritakan kepadaku [Hafsh bin Maisarah] dari [Al A'laa bin 'Abdur Rahman] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berapa banyak orang yang rambutnya kusut, tampak dihinakan dan di usir oleh orang-orang, namun apabila dia berdo'a kepada Allah, pasti Allah akan mengambulkannya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 6683,
			"arabicnumber": "2623.01",
			"text": "Telah menceritakan kepada kami ['Abdullah bin Maslamah bin Qa'nab]; Telah menceritakan kepada kami [Hammad bin Salamah] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku membaca Hadits [Malik] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila ada seseorang yang berkata; 'Celakalah manusia', maka sebenarnya ia sendiri yang lebih celaka dari mereka.\" Abu Ishaq berkata; 'Saya tidak tahu apakah dibaca nashab (dengan harakat fathah) yaitu ahlakahum ataukah dibaca rafa' (dengan harakat dhammah) yaitu ahlakuhum.' Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Yazid bin Zurai'] dari [Rauh bin Al Qasim]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Ahmad bin 'Utsman bin Hakim]; Telah menceritakan kepada kami [Khalid bin Makhlad] dari [Sulaiman bin Bilal] seluruhnya dari [Suhail] melalui jalur ini dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 6684,
			"arabicnumber": "2623.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 6685,
			"arabicnumber": "2624.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Qutaibah] dan [Muhammad bin Rumh] dari [Al Laits bin Sa'ad]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami ['Abdah] dan [Yazid bin Harun] seluruhnya dari [Yahya bin Sa'id]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] lafazh ini miliknya; Telah menceritakan kepada kami ['Abdul Wahhab] yaitu Ats Tsaqafi; Aku mendengar [Yahya bin Sa'id]; Telah mengabarkan kepadaku [Abu Bakr] yaitu Ibnu Muhammad bin 'Amru bin Hazm bahwa ['Amrah] Telah menceritakan kepadanya, dia mendengar [Aisyah] berkata; \"Saya pernah mendengar RasuIullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya Jibril terus-menerus berpesan kepadaku tentang tetangga, hingga aku menduga bahwasanya ia akan memberikan hak waris kepada tetangga.'\" Telah menceritakan kepadaku ['Amru An Naqid]; Telah menceritakan kepada kami ['Abdul 'Aziz bin Abu Hazim]; Telah menceritakan kepadaku [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 6686,
			"arabicnumber": "2624.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 6687,
			"arabicnumber": "2625.01",
			"text": "Telah menceritakan kepadaku ['Ubaidullah bin 'Umar Al Qawariri]; Telah menceritakan kepada kami [Yazid bin Zurai'] dari ['Umar bin Muhammad] dari [Bapaknya] dia berkata; Aku mendengar [Ibnu 'Umar] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya Jibril terus-menerus berpesan kepadaku tentang tetangga, hingga aku menduga bahwasanya ia akan memberikan hak waris kepada tetangga",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 6688,
			"arabicnumber": "2625.02",
			"text": "Telah menceritakan kepada kami [Abu Kamil Al Jahdari] dan [Ishaq bin Ibrahim] dan lafazh ini milik Ishaq dia berkata; [Abu Kamil] Telah menceritakan kepada kami dan berkata [Ishaq]; Telah mengabarkan kepada kami ['Abdul 'Aziz bin 'Abdush Shamad Al 'Ammi]; Telah menceritakan kepada kami [Abu 'Imran Al Jauni] dari ['Abdullah bin Ash Shamit] dari [Abu Dzar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Abu Dzar, Apabila kamu memasak kuah sayur, maka perbanyaklah airnya, dan berikanlah sebagiannya kepada tetanggamu",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 6689,
			"arabicnumber": "2625.03",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Ibnu Idris]; Telah mengabarkan kepada kami [Syu'bah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Ibnu Idris]; Telah mengabarkan kepada kami [Syu'bah] dari [Abu 'Imran Al Jauni] dari ['Abdullah bin Ash Shamit] dari [Abu Dzar] dia berkata; \"Kekasih saya, Rasulullah shallallahu 'alaihi wasallam pernah berpesan kepada saya: 'Apabila kamu memasak kuah sayur, maka perbanyaklah airnya, lalu lihatlah jumlah keluarga tetanggamu dan berikanlah sebagiannya kepada mereka dengan baik",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 6690,
			"arabicnumber": "2626",
			"text": "Telah menceritakan kepadaku [Abu Ghassan Al Misma'i]; Telah menceritakan kepada kami ['Utsman bin 'Umar]; Telah menceritakan kepada kami [Abu 'Amir] yaitu Al Khazzaz dari [Abu 'Imran Al Jauni] dari ['Abdullah bin Ash Shamit] dari [Abu Dzar] dia berkata; Nabi shallallahu 'alaihi wasallam berkata kepadaku: \"Janganlah kamu menganggap remeh sedikitpun terhadap kebaikan, walaupun kamu hanya bermanis muka kepada saudaramu (sesama muslim) ketika bertemu",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 6691,
			"arabicnumber": "2627",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami ['Ali bin Mushir] dan [Hafsh bin Ghiyats] dari [Buraid bin 'Abdullah] dari [Abu Burdah] dari [Abu Musa] dia berkata; \"ApabiIa seorang yang meminta suatu kebutuhan datang kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau akan menghadap kepada orang-orang yang duduk bersama beliau seraya berkata: 'Berikanlah pertolongan agar kalian saling memperoleh pahala dan semoga Allah melaksanakan apa yang disenangi-Nya melalui ucapan nabi-Nya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 6692,
			"arabicnumber": "2628",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Buraid bin 'Abdullah] dari [Kakeknya] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Al A'laa Al Mahdani] dan lafazh ini miliknya; Telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya perumpamaan teman dekat yang baik dan teman dekat yang buruk adalah seperti penjual minyak wangi dan tukang pandai besi. Seorang penjual minyak wangi terkadang mengoleskan wanginya kepada kamu dan terkadang kamu membelinya sebagian atau kamu dapat mencium semerbak harumnya minyak wangi itu. Sementara tukang pandai besi adakalanya ia membakar pakaian kamu ataupun kamu akan menciumi baunya yang tidak sedap",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 6693,
			"arabicnumber": "2629",
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Quhzadz]; Telah menceritakan kepada kami [Salamah bin Sulaiman]; Telah mengabarkan kepada kami ['Abdullah]; Telah mengabarkan kepada kami [Ma'mar] dari [Ibnu Syihab]; Telah menceritakan kepadaku ['Abdullah bin Abu Bakr bin Hazm] dari ['Urwah] dari ['Aisyah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku ['Abdullah bin 'Abdur Rahman bin Bihram] dan [Abu Bakr bin Ishaq] dan lafazh ini milik mereka berdua, keduanya berkata; Telah mengabarkan kepada kami [Abu Al Yaman]; Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri]; Telah menceritakan kepadaku ['Abdullah bin Abu Bakr] bahwa ['Urwah bin Az Zubair]; Telah mengabarkan kepadanya bahwa ['Aisyah] istri Nabi shallallahu 'alaihi wasallam berkata; \"Saya pernah dikunjungi oleh seorang wanita yang mempunyai dua orang anak perempuan. Kemudian wanita tersebut meminta makanan kepada saya. Sayangnya, pada saat itu, saya sedang tidak mempunyai makanan kecuali sebiji kurma yang langsung saya berikan kepadanya. Kemudian wanita itu menerimanya dengan senang hati dan membagikannya kepada dua orang anak perempuannya tanpa sedikitpun ia makan. Setelah itu, wanita tersebut bersama dua orang anak perempuannya pergi. Tak lama kemudian Rasulullah shallallahu 'alaihi wasallam masuk ke dalam rumah. Lalu saya menceritakan kepada beliau tentang wanita dan kedua anak perempuannya itu. Mendengar cerita saya ini, Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barang siapa diuji dalam pengasuhan anak-anak perempuan, lalu ia dapat mengasuh mereka dengan baik, maka anak perempuannya itu akan menjadi penghalangnya dari api neraka kelak",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 6694,
			"arabicnumber": "2630",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Bakr] yaitu Ibnu Mudhar dari [Ibnu Al Had] bahwa [Ziyad bin Abu Ziyad] -budak- dari Ibnu 'Ayyasy; Telah menceritakan kepadanya dari ['Irak bin Malik] Aku mendengarnya bercerita kepada 'Umar bin 'Abdul 'Aziz dari ['Aisyah] dia berkata; \"Telah datang kepadaku seorang wanita miskin yang membawa dua anak perempuan, lalu saya memberinya makan dengan tiga buah kurma, wanita tersebut memberikan kurmanya satu persatu kepada kedua anaknya, kemudian wanita tersebut mengangkat satu kurma ke mulutnya untuk dia makan. Tapi, kedua anaknya meminta kurma tersebut, akhirnya dia pun memberikan (kurma) yang ingin ia makan kepada anaknya dengan membelahnya menjadi dua. Saya sangat kagum dengan kepribadiannya. Lalu saya menceritakan apa yang diperbuat oleh wanita tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Maka beliau bersabda: \"Sesungguhnya Allah telah mewajibkan kepadanya untuk masuk surga atau membebaskannya dari neraka",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 6695,
			"arabicnumber": "2631",
			"text": "Telah menceritakan kepadaku ['Amru An Naqid]; Telah menceritakan kepada kami [Abu Ahmad Az Zubair]; Telah menceritakan kepada kami [Muhammad bin 'Abdul 'Aziz] dari ['Ubaidullah bin Abu Bakr] dari [Anas bin Malik] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barang siapa dapat mengasuh dua orang anak perempuannya hingga dewasa, maka aku akan bersamanya di hari kiamat kelak.' Beliau merapatkan kedua jarinya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 6696,
			"arabicnumber": "2632.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 6697,
			"arabicnumber": "2632.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku membaca Hadits [Malik] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidaklah tiga anak milik salah seorang dari kaum Muslimin meninggal dunia, lalu ia tersentuh api neraka, kecuali sebatas melewatinya saja, yang Allah telah bersumpah siapapun akan melewatinya.\" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan ['Amru An Naqid] serta [Zuhair bin Harb] mereka berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami ['Abad bin Humaid] dan [Ibnu Rafi'] dari ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] keduanya dari [Az Zuhri] melalui sanad Malik dengan Hadits yang semakna. Namun di dalam Hadits Sufyan disebutkan dengan lafazh; 'Fayalija' (lalu ia masuk) ke neraka, kecuali sebatas melewatinya saja, yang Allah telah bersumpah siapapun akan melewatinya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 6698,
			"arabicnumber": "2632.03",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami ['Abdul 'Aziz] yaitu Ibnu Muhammad dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada para wanita Anshar: \"Tidaklah salah seorang dari kalian ditinggal mati oleh tiga orang anaknya, lalu ia sabar dan mengharap pahala dari Allah, kecuali pasti ia akan masuk surga.\" Lalu berkatalah seorang wanita dari mereka; \"Bagimana jika dua orang saja?\" Rasulullah bersabda: \"Meskipun dua orang",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 6699,
			"arabicnumber": "2633",
			"text": "Telah menceritakan kepada kami [Abu Kamil Al Jahdari Fudhail bin Husain]; Telah menceritakan kepada kami [Abu 'Awanah] dari ['Abdur Rahman bin Al Ashbahani] dari [Abu Shalih Dzakwan] dari [Abu Sa'id Al Khudri] dia berkata; Bahwasanya para wanita datang kepada Rasulullah seraya berkata; \"Wahai Rasulullah, kaum laki-laki telah biasa mendengarkan petuah-petuahmu, maka berilah kami satu hari, sehingga kami bisa bermajlis denganmu, engkau ajarkan kepada kami dari ilmu yang telah Allah sampaikan kepadamu. Beliau bersabda: 'Baiklah, berkumpullah kalian pada hari ini dan ini.' Lalu mereka pun berkumpul pada hari yang telah ditentukan. Rasulullah shallallahu 'alaihi wasallam mengajari mereka ilmu yang telah Allah berikan kepada beliau. Kemudian beliau bersabda: \"Tidak ada seorang dari kalian yang ditinggal mati oleh tiga orang dari anaknya kecuali mereka akan menjadi hijab (penghalang) baginya dari neraka.\" Maka berkatalah salah satu dari mereka; 'Bagaimana kalau dua orang? ' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Atau dua orang.' Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami ['Ubaidullah bin Mu'adz]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Syu'bah] dari ['Abdur Rahman bin Al Ashbahani] melalui jalur ini dengan Hadits yang semakna. Namun ada tambahan; -seluruhnya- dari [Syubah] dari [Abdurrahman bin Al Ashbahani] dia berkata; Aku mendengar [Abu Hazim] bercerita dari [Abu Hurairah] dia berkata; 'Tiga anak yang belum baligh",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 6700,
			"arabicnumber": "2634",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 6703,
			"arabicnumber": "2636.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah], [Muhammad bin 'Abdullah bin Numair], [Abu Sa'id Al Asyaj] lafazh ini milik Abu Bakr dia berkata; Telah menceritakan kepada kami [Hafsh] yaitu Ibnu Ghiyats; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami ['Umar bin Hafsh bin Ghiyats]; Telah menceritakan kepada kami [Bapakku] dari Kakekku [Thalq bin Mu'awiyah] dari [Abu Zur'ah bin'Amru bin Jarir] dari [Abu Hurairah] dia berkata; \"Seorang wanita datang menemui Rasulullah shallallahu 'alaihi wasallam dengan membawa anaknya yang sedang sakit seraya berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam, do'akanlah kepada Allah kesembuhan untuknya, karena sungguh aku telah mempersembahkan tiga anak'. Beliau bertanya; \"Benarkah sudah tiga anak? Wanita itu menjawab; 'Ya.' Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh engkau telah terhalang dengan tabir yang kuat dari api neraka.\" Umar berkata; dari antara mereka, dari kakeknya. Sedangkan yang lainnya berkata; dari Thalq -tanpa menyebutkan dari kakeknya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 6704,
			"arabicnumber": "2636.02",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Jarir] dari [Thalq bin Mu'awiyah An Nakha'i Abu Ghiyats] dari [Abu Zur'ah bin 'Amru bin Jarir] dari [Abu Hurairah] dia berkata; \"Seorang wanita datang menemui Rasulullah shallallahu 'alaihi wasallam dengan membawa anaknya yang sedang sakit dan mengeluh seraya berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam, aku khawatir terhadapnya, dan sungguh aku telah mempersembahkan (mengubur) tiga anak'. maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh engkau telah terhalang dengan tabir yang kuat dari api neraka'.\" Zuhair berkata; dari Thalq -tanpa menyebutkan nama julukannya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 6705,
			"arabicnumber": "2637.01",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb]; Telah menceritakan kepada kami [Jarir] dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya apabila Allah Subhanahu wa Ta'ala mencintai seseorang, maka Dia akan memanggil malaikat Jibril alaihi salam seraya berseru: 'Hai Jibril, sesungguhnya Aku mencintai si fulan. Oleh karena itu, cintailah ia! ' Rasulullah bersabda: 'Akhirnya orang tersebut pun dicintai Jibril. Setelah itu, Jibril berseru di atas langit; 'Sesungguhnya Allah Subhanahu wa Ta'ala mencintai si fulan. OIeh karena itu, cintailah ia! ' Kemudian para penghuni langit pun mulai mencintainya pula.' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Setelah itu para penghuni bumi juga mencintainya.' Sebaliknya, apabila Allah Subhanahu wa Ta'ala membenci seseorang, maka Dia akan memanggil malaikat Jibril dan berseru kepadanya: 'Sesungguhnya Aku membenci si fulan. Oleh karena itu, bencilah ia.' Rasulullah shallallahu 'alaihi wasallam berkata: 'Lalu malaikat Jibril berseru di langit; 'Sesungguhnya Allah Subhanahu wa Ta'ala membenci si fulan. OIeh karena bencilah ia!\" Kemudian para penghuni langit membencinya. Setelah itu para penghuni dan penduduk bumi juga membencinya. Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Ya'qub] yaitu Ibnu 'Abdur Rahman Al Qari. [Qutaibah] berkata; Telah menceritakan kepada kami ['Abdul 'Aziz] yaitu Ad Darawardi; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakannya kepada kami [Sa'id bin 'Amru Al Asy'atsi]; Telah mengabarkan kepada kami ['Abtsar] dari [Al 'Alaa bin Al Musayyab]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Harun bin Sa'id Al Aili]; Telah menceritakan kepada kami [Ibnu Wahb]; Telah menceritakan kepadaku [Malik] yaitu Ibnu Anas seluruhnya dari [Suhail] melalui jalur ini. Hanya saja di dalam Hadits Al 'Alaa bin Al Musayyab tidak disebutkan tentang perkataan membenci. Telah menceritakan kepadaku ['Amru An Naqid]; Telah menceritakan kepada kami [Yazid bin Harun]; Telah mengabarkan kepada kami ['Abdul 'Aziz bin 'Abdullah bin Abu Salamah Al Majisyun] dari [Suhail bin Abu Shalih] dia berkata; Ketika kami berada di Arafah, 'Umar bin 'Abdul 'Aziz lewat di hadapan kami yang pada waktu dia sebagai pemimpin rombongan Haji. Orang-orang pun berdiri melihat kepadanya. Lalu aku berkata kepada bapakku; 'Wahai bapakku, aku kira Allah telah mencintai Umar bin Abdul Aziz. Bapakku berkata; 'Kenapa demikian? Jawabku; karena aku lihat orang-orang telah mencintainya. Lalu bapakku berkata; demi bapakmu, Akupun telah mendengar [Abu Hurairah] bercerita dari Rasulullah shallallahu 'alaihi wasallam..-kemudian dia menyebutkan Hadits yang serupa dengan Hadits Jarir dari Suhail",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 6706,
			"arabicnumber": "2637.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 6707,
			"arabicnumber": "2637.03",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 6708,
			"arabicnumber": "2638.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami ['Abdul 'Aziz] yaitu Ibnu Muhammad dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: Roh-roh itu seperti prajurit yang berkelompok-kelompok, jika saling mengenal mereka akan menjadi akrab, dan jika saling bermusuhan maka mereka akan saling berselisih",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 6709,
			"arabicnumber": "2638.02",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb]; Telah menceritakan kepada kami [Katsir bin Hisyam]; Telah menceritakan kepada kami [Ja'far bin Burqan]; Telah menceritakan kepada kami [Yazid bin Al Asham] dari [Abu Hurairah] -sebagai hadits marfu'- dia berkata; \"Sesungguhnya manusia itu seperti tambang perak dan emas. Mereka yang terhormat pada masa masa jahiliah akan terhormat pula di masa lslam, jika mereka memahami (lslam). Roh-roh itu seperti prajurit yang berkelompok-kelompok, jika saling mengenal mereka akan menjadi akrab, dan jika saling bermusuhan maka mereka akan saling berselisih",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 6710,
			"arabicnumber": "2639.01",
			"text": "Telah menceritakan kepada kami ['Abdullah bin Maslamah bin Qa'nab]; Telah menceritakan kepada kami [Malik] dari [Ishaq bin 'Abdullah bin Abu Thalhah] dari [Anas bin Malik] bahwa seorang arab badui datang kepada Nabi Shallallahu'alaihi wasallam sambil berkata; kapankah kiamat? (Beliau Shallallahu'alaihi wasallam) menjawab, \"Apa yang telah kau siapkan?\" Dia menjawab; \"Cinta Allah Azza wa Jalla dan Rasul-Nya.\" Rasulullah Shallallahu'alaihi wasallam bersabda: \"Kau bersama dengan yang kau cintai",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 6713,
			"arabicnumber": "2639.04",
			"text": "Telah menceritakan kepadaku [Abu Ar Rabi' Al 'Ataki]; Telah menceritakan kepada kami [Hammad] yaitu Ibnu Zaid; Telah menceritakan kepada kami [Tsabit Al Bunani] dari [Anas bin Malik] dia berkata; \"Pada suatu hari seorang laki-laki datang kepada Rasulullah shallallahu 'alaihi wasallam seraya bertanya; 'Ya RasululIah, kapankah kiamat itu akan datang? ' Mendengar pertanyaan laki-laki itu, Rasulullah shallallahu 'alaihi wasallam balik bertanya: 'Apa yang telah kamu siapkan untuk menghadapi kiamat? ' Laki-laki itu menjawab; 'Kecintaan kepada Allah dan Rasul-Nya.' Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya kamu akan bersama orang yang kamu cintai.' Anas berkata; 'Tidak ada yang lebih menyenangkan hati kami setelah masuk Islam selain sabda Rasulullah shallallahu 'alaihi wasallam yang berbunyi: 'Sesungguhnya kamu akan bersama orang yang kamu cintai.' Anas berkata; 'Karena saya mencintai Allah, Rasulullah, Abu Bakar, dan Umar, maka saya berharap kelak akan bersama mereka meskipun saya tidak dapat beramal seperti mereka.' Telah menceritakannya kepada kami [Muhammad bin 'Ubaid Al Ghubari]; Telah menceritakan kepada kami [Ja'far bin Sulaiman]; Telah menceritakan kepada kami [Tsabit Al Bunani] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam. Namun di dalamnya tidak disebutkan perkataan Anas",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 6714,
			"arabicnumber": "2639.05",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 6715,
			"arabicnumber": "2639.06",
			"text": "Telah menceritakan kepada kami ['Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim]. [Ishaq] berkata; Telah mengabarkan kepada kami. Dan berkata ['Utsman]; Telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Salim bin Abu Al Ja'ad]; Telah menceritakan kepada kami [Anas bin Malik] dia berkata; Ketika aku dan Rasulullah sedang keluar dari Masjid, tiba-tiba kami bertemu dengan seorang laki-laki dari balik pintu masjid seraya bertanya; ya Rasulullah, kapankah terjadi hari kiamat? Rasulullah shallallahu 'alaihi wasallam balik bertanya: \"Apa yang telah kamu siapkan untuknya? Maka seakan-akan orang tersebut merasa malu dan tunduk. Lalu dia berkata; Saya tidak mempunyai persiapan yang banyak dari shalat, puasa, atau sedekah kecuali hanya aku mencintai Allah dan RasulNya\". Rasulullah Shallallahu'alaihi wasallam bersabda: \"Kamu bersama dengan yang kau cintai\". Telah menceritakan kepadaku [Muhammad bin Yahya bin 'Abdul 'Aziz Al Yasykuri]; Telah menceritakan kepada kami ['Abdullah bin 'Utsman bin Jabalah]; Telah mengabarkan kepadaku [Bapakku] dari [Syu'bah] dari ['Amru bin Murrah] dari [Salim bin Abu Al Ja'ad] dari [Anas] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa. Telah menceritakan kepada kami [Qutaibah]; Telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] dari [Qatadah] Aku mendengar [Anas]. Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Ghassan Al Misma'i] dan [Muhammad bin Al Mutsanna] keduanya berkata; Telah menceritakan kepada kami [Mu'adz] yaitu Ibnu Hisyam; Telah menceritakan kepadaku [Bapakku] dari [Qatadah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam mengenai Hadits ini",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 6716,
			"arabicnumber": "2639.07",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 6717,
			"arabicnumber": "2639.08",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 6718,
			"arabicnumber": "2640.01",
			"text": "Telah menceritakan kepada kami ['Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim], [Ishaq] berkata; Telah mengabarkan kepada kami. Sedangkan ['Utsman] berkata; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Wail] dari ['Abdullah] dia berkata; seorang laki datang kepada Rasulullah shallallahu 'alaihi wasallam seraya bertanya; Ya Rasulullah, bagaimana menurut anda tentang seseorang yang mencintai suatu kaum namun dia tidak bisa bertemu dengan mereka? Maka jawab Rasulullah shallallahu 'alaihi wasallam: \"Seseorang itu akan bersama dengan orang yang dia cintai.\" Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata; Telah menceritakan kepada kami [Ibnu Abu 'Adi]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakannya kepadaku [Bisyr bin Khalid]; Telah mengabarkan kepada kami [Muhammad] yaitu Ibnu Ja'far keduanya dari [Syu'bah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Numair]; Telah menceritakan kepada kami [Abu Al Jawwab]; Telah menceritakan kepada kami [Sulaiman bin Qarm] -secara keseluruhan- dari [Sulaiman] dari [Abu Wail] dari ['Abdullah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa. Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Numair]; Telah menceritakan kepada kami [Abu Mu'awiyah] dan [Muhammad bin 'Ubaid] dari [Al A'masy] dari [Syaqiq] dari [Abu Musa] dia berkata; seseorang datang kepada Nabi shallallahu 'alaihi wasallam, -lalu dia menyebutkan Hadits yang serupa dengan Hadits Jarir dari Al A'masy",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 6719,
			"arabicnumber": "2640.02",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 6720,
			"arabicnumber": "2641",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 6721,
			"arabicnumber": "2642.01",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 6722,
			"arabicnumber": "2642.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan [Abu Ar Rabi'] serta [Abu Kamil Fudhail bin Husain] lafazh ini milik Yahya. [Yahya] berkata; Telah mengabarkan kepada kami dan berkata; Sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Hammad bin Zaid] dari [Abu 'Imran Al Jauni] dari ['Abdullah bin Ash Shamit] dari [Abu Dzar] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah ditanya; 'Bagaimana menurut anda tentang seseorang yang beramal kebaikan lalu orang-orang pun memuji kepadanya? ' Beliau menjawab: \"Itulah kabar gembira yang disegerakan bagi seorang Mukmin.\" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ishaq bin Ibrahim] dari [Waki']; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Basysyar]; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna]; Telah menceritakan kepadaku ['Abdush Shamad]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq]; Telah mengabarkan kepada kami [An Nadhr] seluruhnya dari [Syu'bah] dari [Abu 'Imran Al Jauni] dengan sanad Hammad bin Zaid yang serupa dengan Haditsnya. Hanya saja di dalam Haditsnya dari Syu'bah -tanpa menyebutkan dari 'Abdush Shamad- dengan lafazh; 'lalu orang-orang pun mencintainya.' Sedangkan di dalam Hadits Abdush Shamad sama dengan perkataan Hammad yaitu menggunakan lafazh; 'lalu orang-orang pun memujinya",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 217
			}
		}
	]
}