{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"56": "The Book of Commentary on the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7523,
			"arabicnumber": "3015",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7524,
			"arabicnumber": "3016",
			"text": "Telah menceritakan kepadaku [Amru bin Muhammad bin Bukair An Naqid], [Al Hasan bin Ali Al Hulwani] dan [Abdu bin Humaid] berkata Abdu: telah menceritakan kepadaku, sementara yang lain berkata: Telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'ad] telah menceritakan kepada kami [ayahku] dari [Shalih bin Kaisan] dari [Ibnu Syihab] berkata: Telah mengkhabarkan kepadaku [Anas bin Malik] bahwa Allah 'azza wajalla menyempurnakan wahyu atas Rasulullah Shallallahu 'alaihi wa Salam sebelum beliau wafat",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7525,
			"arabicnumber": "3017.01",
			"text": "Telah menceritakan kepadaku [Abu Khaitsamah bin Harb] dan [Muhammad bin Al Mutsanna], teks milik Ibnu Al Mutsanna, keduanya berkata: Telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Qais bin Muslim] dari [Thariq bin Syihab], orang-orang Yahudi berkata kepada [Umar]: Sesungguhnya kalian membaca suatu ayat yang seandainya diturunkan pada kami pasti kami jadikan hari itu sebagai hari raya: \"Sesungguhnya aku tahu saat ayat itu turun, pada hari apa ayat itu turun dan dimana Rasulullah Shallallahu 'alaihi wa Salam saat ayat itu turun. Ayat itu turun di Arafah saat Rasulullah Shallallahu 'alaihi wa Salam wuquf di Arafah. Sufyan berkata: Aku ragu apakah hari jum'at ataukah tidak, maksudnya: \"Pada hari ini telah Kusempurnakan untuk kamu agamamu dan telah Ku-cukupkan kepadamu nikmatKu.\" (Al Maa`idah: 3)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7526,
			"arabicnumber": "3017.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7527,
			"arabicnumber": "3017.03",
			"text": "Telah menceritakan kepadaku [Abdu bin Humaid] telah mengkhabarkan kepada kami [Ja'far bin Aun] telah mengkhabarkan kepada kami [Abu Umais] dari [Qais bin Muslim] dari [Thariq bin Syihab] berkata: Seorang Yahudi mendatangi [Umar] lalu berkata: Wahai Amirul Mu`minin, ada satu ayat didalam kitab kalian yang kalian baca, andai ayat itu turun pada kami kaum Yahudi, pasti kami menjadikan hari itu sebagai hari. Umar bertanya: Ayat apa? Ia menjawab: \"Pada hari Ini telah Ku-sempurnakan untuk kamu agamamu, dan telah Ku-cukupkan kepadamu nikmatKu, dan telah Ku-ridhai Islam itu jadi agama bagimu.\" (Al Maa`idah: 3) Umar berkata: Sesungguhnya aku tahu hari dan tempat ayat ini diturunkan, ayat itu turun pada Rasulullah Shallallahu 'alaihi wa Salam di Arafah pada hari jum'at",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7528,
			"arabicnumber": "3018.01",
			"text": "Telah menceritakan kepadaku [Abu Ath Thahir Ahmad bin Amru bin Sarh] dan [Harmalah bin Yahya At Tujibi] berkata Abu Ath Thahir: Telah menceritakan kepada kami, sedangkan Harmalah berkata: Telah mengkhabarkan kepada kami [Ibnu Wahab] telah mengkhabarkan kepadaku [Yunus] dari [Ibnu syihab] telah mengkhabarkan kepadaku [Urwah bin Zubair] bahwa ia bertanya kepada [Aisyah] tentang firman Allah: \"Dan jika kalian khawatir tidak berlaku adil dalam masalah anak-anak yatim maka nikahilah (wanita-wanita) yang baik bagi kalian dua, atau tiga, atau empat.\" (An Nisaa`: 3) Aisyah berkata: Wahai keponakanku, itu maksudnya adalah seorang anak wanita yatim yang berada di bawah pengawasan walinya (dan) ia ikut (dalam tanggungan) hartanya lalu ia sang wali terkagum dengan harta dan kecantikan anak yatim itu kemudian sang wali ingin menikahinya dengan (niatan) tidak adil di dalam maharnya agar ia memberikannya sesuatu yang semisal dengan apa yang diberikan kepada selain dia, lalu mereka dilarang untuk menikahi mereka kecuali untuk berlaku adil bagi mereka dan agar mereka menyampaikan mahar yang lebih tinggi dan mereka diperintahkan untuk menikahi wanita-wanita yang baik bagi mereka selain anak-anak yatim. Urwah berkata: Aisyah berkata: Kemudian orang-orang meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam setelah ayat ini tentang mereka (anak-anak yatim perempuan) lalu Allah 'azza wajalla menurunkan ayat: \"Dan mereka meminta fatwa kepadamu tentang wanita-wanita katakanlah: 'Allah yang berfatwa kepada kalian tentang mereka dan apa yang dibacakan atas kalian dalam Al Kitab tentang wanita-wanita yatim yang kalian tidak memberikan kepada mereka apa yang telah ditetapkan bagi mereka sedang kalian ingin menikahi mereka.\" (An Nisaa`: 127) Aisyah berkata: Dan yang disebutkan oleh Allah Ta'ala bahwasanya itu adalah yang dibacakan atas kalian dalam al-Qur'an pada ayat sebelumnya yang menyebutkan firman Allah: \"Dan jika kalian khawatir untuk tidak berbuat adil dalam masalah anak-anak yatim maka nikahilah wanita-wanita yang baik bagi kalian.\" (An Nisaa`: 3) Aisyah berkata: Dan firman Allah dalam ayat yang lain: \"Sedang kalian ingin menikahi mereka, \" (An Nisaa`: 127) adalah ketidaksukaan salah seorang di antara kalian terhadap wanita yatim yang berada di bawah pengawasan kalian sedang ia sedikit hartanya dan kurang cantik. Karena itu, mereka dilarang menikahi karena apa yang mereka sukai dari harta dan kecantikan wanita-wanita yatim kecuali dengan keadilan karena ketidaksukaan mereka pada wanita-wanita yatim. Telah menceritakan kepada kami [Al Hasan Al Hulwani] dan [Abdu bin Humaid] semuanya dari [Ya'qub bin Ibrahim bin Sa'ad] telah menceritakan kepada kami [ayahku] dari [Shalih] dari [Ibnu Syihab] telah mengkhabarkan kepadaku [Urwah] bahwa ia bertanya kepada [Aisyah] tentang firman Allah: \"Dan jika kalian khawatir untuk tidak berbuat adil terhadap wanita-wanita yatim, \" (An Nisaa`: 3) ia menyebutkan hadits tersebut seperti hadits Yunus dari Az Zuhri dan ia menambahkan di akhirnya: Karena ketidaksukaan mereka terhadap wanita-wanita yatim jika sedikit hartanya dan kurang cantik",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7529,
			"arabicnumber": "3018.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7530,
			"arabicnumber": "3018.03",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya bekata: Telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Hisyam] dari [ayahnya] dari [Aisyah] tentang firman Allah: \"Dan jika kalian khawatir utnuk tidak berbuat adil terhadap wanita-wanita yatim, \" (An Nisaa`: 3) Ia berkata: (Ayat ini) turun berkenaan dengan seseorang, ia memiliki seorang wanita yatim, ia walinya dan ahli warisnya. Wanita yatim itu memiliki harta, ia tidak memiliki orang lain yang menyainginya selain dia. Ia tidak menikahinya karena hartanya sehingga itu akan membahayakannya dan memperburuk perawatannya. Lalu ia berkata: \"Dan jika kalian khawatir untuk tidak berbuat adil dalam masalah anak-anak yatim maka nikahilah wanita-wanita yang baik bagi kalian.\" (An Nisaa`: 3) Ia berkata: Aku tidak menghalalkan untuk kalian dan tinggalkan wanita ini yang berbahaya karenanya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7531,
			"arabicnumber": "3018.04",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7532,
			"arabicnumber": "3018.05",
			"text": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] telah mengkhabarkan kepada kami [Hisyam] dari [ayahnya] dari [Aisyah] tentang firmanNya: \"Dan mereka minta fatwa kepadamu tentang para wanita. Katakanlah: \"Allah memberi fatwa kepadamu tentang mereka.\" (An Nisaa`: 127) Aisyah berkata: Ia wanita yatim yang ada pada seseorang, mungkin ia menyertakan lelaki itu dalam hartanya hingga dalam tandan anggur, lalu ia ingin menikahinya, ia tidak mau menikahkannya dengan lelaki lain sehingga akan disertakan dalam hartanya lalu ia menyusahkannya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7533,
			"arabicnumber": "3019.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Hisyam] dari [ayahnya] [Aisyah] tentang firmanNya: \"Dan barangsiapa yang miskin, maka bolehlah ia makan harta itu menurut yang patut.\" (An Nisaa`: 6) Aisyah berkata: (ayat ini) turun tentang wali hartanya anak yatim yang menjaganya dan memperbaikinya, ia boleh makan darinya jika membutuhkan",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7534,
			"arabicnumber": "3019.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7535,
			"arabicnumber": "3019.03",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7536,
			"arabicnumber": "3020",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Hisyam] dari [ayahnya] dari [Aisyah] tentang firman Allah 'azza wajalla: \"(yaitu) ketika mereka datang kepadamu dari atas dan dari bawahmu, dan ketika tidak tetap lagi penglihatan(mu) dan hatimu naik menyesak sampai ke tenggorokan.\" (Al Ahzaab: 10) Ia berkata: Itu adalah perang khandaq",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7537,
			"arabicnumber": "3021.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdah bin Sulaiman] telah menceritakan kepada kami [Hisyam] dari [ayahnya] dari [Aisyah]: \"Dan jika seorang wanita khawatir akan nusyuz atau sikap tidak acuh dari suaminya.\" (An Nisaa`: 128) Ia berkata: (ayat ini) turun berkenaan tentang wanita yang telah lama hidup bersama suaminya lalu ia (sang suami) ingin mencerainya, kemudian ia (sang istri) berkata: Janganlah engkau cerai daku dan pertahankan diriku dan engkau terbebas dariku, lalu turunlah ayat ini",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7538,
			"arabicnumber": "3021.02",
			"text": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Hisyam] dari [ayahnya] dari [Aisyah] tentang firman Allah 'azza wajalla: \"Dan jika seorang wanita khawatir akan nusyuz atau sikap tidak acuh dari suaminya.\" (An Nisaa`: 128) Ia berkata: (ayat ini) turun berkenaan tentang wanita yang hidup bersama suaminya, mungkin ia tidak mau memperbanyak anak darinya, lalu ia (sang suami) ingin mencerainya, ia telah lama menemaninya dan telah punya anak, ia tidak ingin suaminya mencerainya lalu berkata: Engkau terbebas dari urusanku",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7539,
			"arabicnumber": "3022.01",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7540,
			"arabicnumber": "3022.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7541,
			"arabicnumber": "3023.01",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7542,
			"arabicnumber": "3023.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7543,
			"arabicnumber": "3023.03",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7544,
			"arabicnumber": "3023.04",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7545,
			"arabicnumber": "3023.05",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7546,
			"arabicnumber": "3024.01",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7547,
			"arabicnumber": "3024.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7548,
			"arabicnumber": "3025",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7549,
			"arabicnumber": "3026",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7550,
			"arabicnumber": "3027",
			"text": "Telah menceritakan kepadaku [Yunus bin Abdula'la Ash Shadafi] telah mengkhabarkan kepada kami [Abdulah bin Wahab] telah mengkhabarkan kepadaku [Amru bin Al Harits] dari [Sa'id bin Abu Hilal] dari [Aun bin Abdullah] dari [ayahnya] bahwasanya [Ibnu Mas'ud] berkata: Tidak ada selang waktu antara Islamnya kami dan ketika Allah menegur kami dengan ayat ini: \"Belumkah datang waktunya bagi orang-orang yang beriman, untuk tunduk hati mereka mengingat Allah.\" (Al Hadiid: 16) kecuali hanya empat tahun",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7551,
			"arabicnumber": "3028",
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far]. Telah menceritakan kepadaku [Abu Bakr bin Nafi'] teks miliknya, telah menceritakan kepada kami [Syu'bah] dari [Salamah bin Kuhail] dari [Muslim Al Bathin] dari [Sa'id bin Jubair] dari [Ibnu Abbas] berkata: Dahulu wanita berthawaf di baitullah dalam keadaan telanjang lalu ia berkata: Siapa yang meminjamkan kepadaku baju yang ia kenakan di atas kemaluannya? dan saat ini ia berkata: Telah nampak sebagian atau seluruhnya, maka apa yang nampak darinya tidaklah aku menghalalkannya. Lalu turunlah ayat ini: \"Ambillah oleh kalian pakaian dan perhiasan kalian setiap memasuki masjid.\" (Al A'raaf: 31)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7552,
			"arabicnumber": "3029.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] dari [Abu Mu'awiyah], teks milik Abu Kuraib, telah menceritakan kepada kami Abu Mu'awiyuah telah menceritakan kepada kami [Al A'masy] dari [Abu Sufyan] dari [Jabir] berkata: Dahulu Abdullah bin Ubai bin Salul berkata kepada budak wanitanya: Pergilah dan melacurlah untuk kami. Maka Allah 'azza wajalla menurunkan ayat: \"Dan janganlah kamu paksa budak-budak wanitamu untuk melakukan pelacuran, sedang mereka sendiri mengingini kesucian, karena kamu hendak mencari keuntungan duniawi. dan barangsiapa yang memaksa mereka, maka sesungguhnya Allah adalah Maha Pengampun lagi Maha Penyayang (kepada mereka) sesudah mereka dipaksa itu.\" (An Nuur: 33)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7553,
			"arabicnumber": "3029.02",
			"text": "Telah menceritakan kepadaku [Abu Kamil Al Jahdari] telah menceritakan kepada kami [Abu Awanah] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir], budak wanita milik Abdullah bin Ubai bin Salul bernama Musaikah, ada juga yang menyebut Umaimah, dipaksa berzina lalu ia melaporkan hal itu kepada nabi Shallallahu 'alaihi wa Salam kemudian Allah menurunkan: \"Dan janganlah kamu paksa budak-budak wanitamu untuk melakukan pelacuran\" sampai \"Maha Pengampun lagi Maha Penyayang (kepada mereka) sesudah mereka dipaksa itu.\" (An Nuur: 33)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7554,
			"arabicnumber": "3030.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Idris] dari [Al A'masy] dari [Ibrahim] dari [Abu Ma'mar] dari [Abdullah] tentang firmanNya 'azza wajalla: \"Mereka itulah orang-orang yang selalu berdoa dan mencari kepada Rabb mereka wasilah manakah di antara mereka yang lebih dekat.\" (Al Israa`: 57) ia berkata: Segolongan jin masuk Islam dan mereka disembah, mereka yang menyembah tetap berada dalam peribadatan mereka, sementara segolongan dari jin telah masuk Islam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7556,
			"arabicnumber": "3030.04",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7558,
			"arabicnumber": "3031",
			"text": "Telah menceritakan kepadaku [Abdullah bin Muthi'] telah menceritakan kepada kami [Husyaim] dari [Abu Bisyr] dari [Sa'id bin Jubair] berkata: Saya berkata kepada [Ibnu 'Abbas]: Surat At Taubah, ia berkata: Apa At Taubah? Ia berkata: Bahkan ia adalah Al Fadhilah (yang menyibak rahasia orang-orang munafik, pent.) yang masih turun dan dari mereka dan dari mereka hingga mereka mengira tiada seorangpun dari kita yang masih tersisa kecuali telah disebutkan di dalamnya. Ia berkata: Aku berkata: Surat Al Anfaal, ia (Ibnu Abbas) berkata: Itu adalah surat perang Badar. Ia berkata: Lalu aku berkata: Surat Al Hasyr, ia (Ibnu Abbas) berkata: Ia turun berkenaan dengan Bani Nadhir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7559,
			"arabicnumber": "3032.01",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [Abu Hayyan] dari [Asy Sya'bi] dari [Ibnu Umar] berkata: [Umar] berkhutbah di atas mimbar Rasulullah shallallahu 'alaihi wasallam, ia memuja dan memuji Allah kemudian berkata: Amma ba'du, sesungguhnya khamar itu telah turun pengharamannya saat turun waktu itu dan khamar terdiri lima hal; dari gandum, tepung, kurma, anggur, dan madu, Khamar adalah segala sesuatu yang menutupi akal. Ada tiga hal yang aku ingin (sampaikan) wahai para manusia: Rasulullah shallallahu 'alaihi wasallam telah mewasiatkan kepada kita; (warisan) kakek, kalalah (orang mati yang tidak meniggalkan anak maupun orang tua) dan sekian dari beberapa pintu riba",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7560,
			"arabicnumber": "3032.02",
			"text": "Telah menceritakan kepada kami [Abu Kuraib] telah mengkhabarkan kepada kami [Ibnu Idris] telah menceritakan kepada kami [Abu Hayyan] dari [Asy Sya'bi] dari [Ibnu Umar] berkata: Aku mendengar [Umar bin Al Khaththab] berkhutbah di atas mimbar Rasulullah Shallallahu 'alaihi wa Salam, ia berkata: Amma ba'du, sesungguhnya telah turun pengharaman khamar dan khamar terdiri lima hal; anggur kurma, madu, tepung dan gandum. Khamar adalah segala sesuatu yang menutupi akal. Ada tiga hal yang aku ingin (sampaikan) wahai para manusia: Rasulullah shallallahu 'alaihi wasallam telah mewasiatkan kepada kita yang harus kita perhatikan; (warisan) kakek, kalalah (orang mati yang tidak meniggalkan anak maupun orang tua) dan sekian dari beberapa pintu riba. Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin Ulaiyah]. Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengkhabarkan kepada kami [Isa bin Yunus] keduanya dari [Abu Hayyan] dengan snad ini seperti hadits mereka berdua, hanya saja Ibnu Ulaiyah menyebutkan dalam haditsnya: Anggur. Seperti yang dikatakan oleh Ibnu Idris, dan dalam hadits Isa disebutkan: Kismis, seperti yang dikatakan Ibnu Mushir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7561,
			"arabicnumber": "3032.03",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7562,
			"arabicnumber": "3033.01",
			"text": "Telah menceritakan kepada kami [Amru bin Zurarah] telah menceritakan kepada kami [Husyaim] dari [Abu Hasyim] dari [Abu Mijlaz] dari [Qais bin Ubad] berkata: Saya telah mendengar [Abu Dzar] benar-benar bersumpah: \"Inilah dua golongan (golongan mukmin dan golongan kafir) yang bertengkar, mereka saling bertengkar mengenai Rabb mereka.\" (Al Hajj: 19) sesungguhnya ia turun berkenaan orang-orang yang berbaris di hari Badar: Hamzah, Ali, Ubaidah bin Harits, Utbah, Syaibah putra dari Rabi'ah dan Al Walid bin Utbah. Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'], dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdurrahman], semuanya dari [Sufyan] dari [Abu Hasyim] dari [Abu Majliz] dari [Qais bin Ubad] berkata: Saya telah mendengar [Abu Dzar] bersumpah, sungguh \"Inilah dua golongan (golongan mukmin dan golongan kafir) yang bertengkar.\" (Al Hajj: 19) seperti hadits Husyaim",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7563,
			"arabicnumber": "3033.02",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 40
			}
		}
	]
}