{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"8": "The Book of Prayer - Two Eids"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2044,
			"arabicnumber": "884.01",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] dan [Abdu bin Humaid] semuanya dari [Abdurrazaq] - [Ibnu Rafi'] - berkata, telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Al Hasan bin Muslim] dari [Thawus] dari [Ibnu Abbas] ia berkata; \"Saya pernah menghadiri shalat Idul Fithri bersama Rasulullah shallallahu 'alaihi wasallam, Abu Bakar, Umar dan Utsman, mereka semua shalat terlebih dahulu sebelum khutbah.\" Kemudian Ibnu Abbas mengatakan bahwa Rasulullah shallallahu 'alaihi wasallam turun dari mimbar, sepertinya aku sempat melihat beliau ketika menyuruh orang-orang lelaki duduk dengan isyarat tangan beliau lalu beliau lewat di tengah sehingga beliau mendatangi kaum wanita disertai Bilal, dan beliau membaca ayat: \"Hai nabi, apabila datang kepadamu perempuan-perempuan yang beriman untuk mengadakan janji setia, bahwa mereka tiada akan menyekutukan Allah…\" beliau membaca ayat itu hingga selesai. Setelah itu, beliau bertanya: \"Apakah kalian ingin termasuk seperti yang disebutkan ayat itu?\" seorang wanita menjawab -ketika itu tidak ada wanita lain yang menjawab-, \"Benar, wahai Nabiyullah.\" Saat itu, beliau tidak tahu siapa perempuan itu. Beliau bersabda: \"Kalau demikian, bersedekahlah.\" Lalu Bilal membentangkan kainnya, kemudian ia mengatakan, \"Ayolah! Sungguh, sedekah ini menjadi penebus kalian dari (siksa neraka).\" Akhirnya para wanita itu pun meletakkan cincinnya di atas kain yang dihamparkan Bilal",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2047,
			"arabicnumber": "885.01",
			"text": "Dan Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Rafi' bin Rafi'] Telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Atha`] dari [Jabir bin Abdullah] ia berkata, saya mendengarnya berkata; \"Sesungguhnya Nabi shallallahu 'alaihi wasallam berdiri pada hari raya Iedul Fithri, lalu beliau shalat. Beliau shalat sebelum menyampaikan khuthbah. Seusai shalat, baru beliau menyampaikan khuthbah kepada manusia. Setelah Nabi shallallahu 'alaihi wasallam berkhutbah, beliau mendatangi kaum wanita lalu mengingatkan mereka sambil bersandar pada tangan Bilal. Sedangkan Bilal membentangkan kainnya, akhirnya kaum wanita pun melemparkan sedekahnya.\" Saya bertanya kepada Atha`, \"Apakah itu merupakan Zakat Fithri?\" ia menjawab, \"Tidak, akan tetapi itu adalah sedekah yang mereka keluarkan, saat itu para wanita melemparkan cincin, sehingga yang lain pun turut melempar.\" Saya bertanya lagi kepada Atha`, \"Apakah sekarang dapat dibenarkan, bila seorang imam mendatangi kaum wanita setelah menyampaikan khutbah lalu mengingatkan mereka?\" ia menjawab, \"Wahai Amru, sesungguhnya hal itu benar-benar termasuk tindakan yang benar, apa alasan mereka untuk tidak melakukannya?",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2048,
			"arabicnumber": "885.02",
			"text": "Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Abdul Malik bin Abu Sulaiman] dari [Atha`] dari [Jabir bin Abdullah] ia berkata; Aku telah mengikuti shalat hari raya bersama Rasulullah shallallahu 'alaihi wasallam. Beliau memulainya dengan shalat sebelum menyampaikan khutbah, tanpa disertai adzan dan Iqamah. Setelah itu beliau berdiri sambil bersandar pada tangan Bilal. Kemudian beliau memerintahkan untuk selalu bertakwa kepada Allah, dan memberikan anjuran untuk selalu mentaati-nya. Beliau juga memberikan nasehat kepada manusia dan mengingatkan mereka. Setelah itu, beliau berlalu hingga sampai di tempat kaum wanita. Beliau pun memberikan nasehat dan peringatan kepada mereka. Beliau bersabda: \"Bersedekahlah kalian, karena kebanyakan kalian akan menjadi bahan bakar neraka jahannam.\" Maka berdirilah seorang wanita terbaik di antara mereka dengan wajah pucat seraya bertanya, \"Kenapa ya Rasulullah?\" beliau menjawab: \"Karena kalian lebih banyak mengadu (mengeluh) dan mengingkari kelebihan dan kebaikan suami.\" Akhirnya mereka pun menyedekahkan perhiasan yang mereka miliki dengan melemparkannya ke dalam kain yang dihamparkan Bilal, termasuk cincin dan kalung-kalung mereka",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2049,
			"arabicnumber": "886.01",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Atha`] dari [Ibnu Abbas] dan dari [Jabir bin Abdullah Al Anshari] keduanya berkata; \"Tidak pernah dikumandangkan adzan pada saat Iedul Fithri dan tidak pula pada saat shalat Iedul Adlha.\" Kemudian setelah itu, saya menanyakan hal itu kepadanya, maka ia pun mengabarkan kepadaku, ia berkata; telah menceritakan kepadaku Jabir bin Abdullah Al Anshari bahwasanya; \"Tidak ada adzan untuk shalat Iedul Fithri saat Imam keluar, atau setelah keluarnya Imam. Dan tidak ada pula Iqamah, pengumuman serta tidak ada pula yang lain, tidak ada adzan dan tidak pula Iqamah",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2050,
			"arabicnumber": "886.02",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Atha`] bahwasanya; [Ibnu Abbas] mengirim seseorang kepada Ibnu Zubiar ketika pertama kali keluar (untuk menunaikan shalat Ied), \"Bahwa shalat Ied (ditunaikan) tanpa adzan. Karena itu, jangankan kamu mengumandangkan adzan.\" Maka Ibnu Zubair pun tidak menyuruh untuk mengumandangkan adzan. Kemudian para hari itu, ia juga mengutus kepadanya, bahwa penyampaian khutbah adalah sesudah shalat. Dan bahwa hal itu sebelumnya telah dilakukan oleh Rasulullah shallallahu 'alaihi wasallam. Akhirnya Ibnu Zubair pun shalat Ied sebelum khutbah",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2051,
			"arabicnumber": "887",
			"text": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] dan [Hasan bin Rabi'] dan [Qutaibah bin Sa'id] dan [Abu Bakar bin Abu Syaibah] - [Yahya] berkata- telah mengabarkan kepada kami -sementara orang-orang yang lain berkata- telah menceritakan kepada kami [Abul Ahwash] dari [Simak] dari [Jabir bin Samurah] ia berkata; Saya telah menunaikan shalat dua hari raya bersama Rasulullah shallallahu 'alaihi wasallam lebih dua kali, yakni (beliau menunaikannya) tanpa adzan dan iqamah",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2052,
			"arabicnumber": "888",
			"text": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdah bin Sulaiman] dan [Abu Usamah] dari [Ubaidullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam, Abu Bakar dan Umar, mereka semua menunaikan shalat dua hari raya sebelum khutbah",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2053,
			"arabicnumber": "889",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] dan [Ibnu Hujr] mereka berkata, telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Dawud bin Qais] dari [Iyadl bin Abdullah bin Sa'd] dari [Abu Sa'id Al Khudri] bahwasanya Rasulullah shallallahu 'alaihi wasallam ketika keluar pada hari 'iedul Fitri dan 'iedul Adlha, beliau selalu memulainya dengan shalat. Dan jika beliau telah selesai mengerjakan shalat dan menutupnya dengan salam, beliau segera berdiri menghadap ke arah para jama'ah yang sedang duduk di tempat mereka shalat. Apabila beliau memiliki suatu keperluan seperti ingin mengutus sebuah pasukan beliau mengumumkannya kepada para jama'ah, atau beliau memiliki keperluan lain beliau menyuruh mereka agar mengerjakannya. Dan beliau selalu bersabda: \"Bersedekahlah kalian, bersedekahlah kalian, bersedekahlah kalian!.\" Dan orang yang paling banyak bersedekah adalah dari kalangan kaum wanita. Kemudian setelah itu beliau baru meninggalkan lapangan. Hal ini masih terus berlangsung sampai pada masa Marwan bin Al Hakam. Aku keluar dengan menggandeng Marwan hingga sampai di lapangan. Namun ternyata Katsir bin Ash Shalt telah membangun mimbar yang terbuat dari tanah dan batu bata. Dan tiba-tiba Marwan menarik tanganku seakan-akan ia menyuruhku naik ke mimbar dan memulainya dengan khutbah terlebih dahulu, dan akupun menyuruhnya untuk memulainya dengan shalat terlebih dahulu. Ketika aku melihat kejadian itu, aku berkata kepadanya, \"Mulailah dengan shalat!\" Namun ia menjawab, \"Tidak wahai Abu Sa'id, sesuatu yang kau ketahui itu telah ditinggalkan.\" Aku menjawab, \"Sekali-kali tidak, demi Dzat yang jiwaku berada di tanganNya, setahuku kalian tidak akan mendatangkan kebaikan sedikitpun (ia mengulangi hingga tiga kali).\" Kemudian ia pergi meninggalkan tempat itu",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2054,
			"arabicnumber": "890.01",
			"text": "Telah menceritakan kepada kami [Abu Rabi' Az Zahrani] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Ummu 'Athiyah] ia berkata; Nabi shallallahu 'alaihi wasallam memerintahkan kepada kami agar mengajak serta keluar para gadis dan wanita-wanita yang dipingit pada dua hari raya, dan beliau memerintahkan para wanita yang sedang haidl menjauh dari mushalla (tempat shalat) kaum muslimin",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2055,
			"arabicnumber": "890.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Ashim Al Ahwal] dari [Hafshah binti Sirin] dari [Ummu Athiyyah] ia berkata; Kami diperintahkan untuk turut keluar pada dua hari raya, demikian juga para para gadis. Dan para wanita yang sedang haid juga keluar, namun mereka berada di belakang jamaah dan ikut bertakbir bersama mereka",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2056,
			"arabicnumber": "890.03",
			"text": "Dan telah menceritakan kepada kami [Amru An Naqid] telah menceritakan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Hisyam] dari [Hafshah binti Sirin] dari [Ummu Athiyyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kepada kami agar mengajak serta keluar melakukan shalat idul fithri dan idul Adlha para gadis, wanita haid dan wanita yang sedang dipingit. Adapun mereka yang sedang haidl tidak ikut shalat, namun turut menyaksikan kebaikan dan menyambut seruan kaum muslimin. Saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam, \"Wahai Rasulullah, di antara kami ada yang tidak memiliki baju.\" Beliau menjawab: \"Hendaknya saudaranya yang memiliki jilbab memakaikannya",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2059,
			"arabicnumber": "891.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Dlamrah bin Sa'id Al Mazini] dari [Ubaidullah bin Abdullah] bahwasa Umar bin Al Khaththab pernah bertanya kepada [Abu Waqid Al Laitsi], \"Surat apa yang dibaca oleh Rasulullah shallallahu 'alaihi wasallam ketika mengerjakan shalat Iedul Adlha dan Iedul Fithri?\" ia menjawab, \"Beliau membaca surat 'QAAF WAL QUR`ANIL MAJIID' dan 'IQTARABATIS SAA'ATU WAN SYAQQAL QAMAR",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2060,
			"arabicnumber": "891.02",
			"text": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Abu Amir Al 'Aqadi] telah menceritakan kepada kami [Fulaih] dari [Dlamrah bin Sa'id] dari [Ubaidullah bin Abdullah bin Utbah] dari [Abu Waqid Al Laitsi] ia berkata; Umar bin Al Khathab bertanya kepadaku, \"Surat apa yang dibaca oleh Rasulullah shallallahu 'alaihi wasallam pada saat shalat Ied?\" saya menjawab, \"Yaitu, belia membaca surat, 'IQTARABATIS SAA'ATU' dan 'QAAF WAL QUR`ANIL MAJIID",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2061,
			"arabicnumber": "892.01",
			"text": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Usamah] dari [Hisyam] dari [bapaknya] dari [Aisyah] ia berkata; Abu Bakar masuk ke dalam rumahku, sementara di tempatku terdapat dua orang budak wanita Anshar sedang bernyanyi sebagaimana yang dibawakan oleh orang-orang Anshar pada hari Bu'ats. Ia berkata, \"Namun keduanya bukanlah penyanyi yang terkenal.\" Maka Abu Bakar pun bertanya, \"Apakah di tempat Rasulullah shallallahu 'alaihi wasallam terdapat nyanyian syetan?\" Pada hari itu merupakan hari raya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Abu Bakar, sesungguhnya setiap kaum itu miliki hari raya, dan hari ini merupakan hari raya untuk kita.\" Dan telah menceritakannya kepada kami [Yahya bin Yahya] dan [Abu Kuraib] semuanya dari [Abu Mu'awiyah] dari [Hisyam] dengan isnad ini. Dan di dalamnya dikatakan; Dua budak wanita yang bermain rebana",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2062,
			"arabicnumber": "892.02",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2063,
			"arabicnumber": "892.03",
			"text": "Telah menceritakan kepadaku [Harun bin Sa'id Al `Aili] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru] bahwa [Ibnu Syihab] telah menceritakan kepadanya dari [Urwah] dari [Aisyah] bahwa pada hari-hari di Mina Abu Bakar masuk ke dalam rumahnya, sementara di tempatnya terdapat dua orang budak wanita yang sedang bernyanyi dan memukul rebana, sementara Rasulullah shallallahu 'alaihi wasallam menutup diri dengan kainnya. Kemudian Abu Bakar pun menghentikan keduanya, maka Rasulullah shallallahu 'alaihi wasallam pun menyingkap kainnya dan bersabda: \"Biarkanlah keduanya, wahai Abu Bakar. Karena hari-hari ini adalah hari raya.\" Aisyah berkata; \"Saya melihat Rasulullah shallallahu 'alaihi wasallam menutupiku dengan kainnya, sementara saya sedang melihat kepada orang-orang Habasyah yang sedang bermain. Saya adalah seorang anak wanita, karena itu berilah kesempatan kepada para anak wanita untuk bermain",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2064,
			"arabicnumber": "892.04",
			"text": "Dan telah menceritakan kepadaku [Abu Thahir] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Urwah bin Zubair] ia berkata, [Aisyah] berkata; \"Saya melihat Rasulullah shallallahu 'alaihi wasallam berdiri di pintu kamarku, sementara orang-orang Habasyah sedang bermain tombak di masjid Rasulullah shallallahu 'alaihi wasallam, maka beliau menutupiku dengan kainnya agar aku dapat melihat permainan mereka. Kemudian beliau berdiri (agar aku lebih leluasa melihat), sampai saya sendiri yang berhenti (setelah bosan) melihatnya. Karena itu, berilah keleluasaan kepada anak-anak wanita untuk bermain",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2065,
			"arabicnumber": "892.05",
			"text": "Telah menceritakan kepadaku [Harun bin Sa'id Al `Aili] dan [Yunus bin Abdul A'la] -sedangkan lafazhnya dari Harun- keduanya berkata, telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepada kami [Amru] bahwa [Muhammad bin Abdur Rahman] telah menceritakan kepadanya dari ['Urwah] dari [Aisyah] ia berkata; Suatu ketika Rasulullah shallallahu 'alaihi wasallam masuk ke dalam rumahku, sementara di tempatku terdapat dua orang budak wanita yang sedang bernyanyi dengan nyanyian Bu'ats, lalu beliau langsung berbaring diatas tempat tidur dengan membalikkan wajahnya. Setelah itu, masuklah Abu Bakar dan langsung marah seraya berkata, \"Nyanyian syetan ada di sisi Rasulullah shallallahu 'alaihi wasallam?.\" Maka Rasulullah shallallahu 'alaihi wasallam pun menemuinya dan bersabda: \"Biarkanlah mereka berdua.\" Ketika ia tidak mengindahkan lagi, maka saya pun memberi isyarat pada kedua budak wanita itu sehingga keduanya pun keluar. Kemudian pada hari raya, orang-orang berkulit hitam bermain baju besi dan tombak. Kemungkinan saya yang bertanya kepada Rasulullah shallallahu 'alaihi wasallam atau pun beliau yang bertanya padaku, \"Apakah kamu ingin melihatnya?\" Saya menjawab, \"Ya.\" Maka beliau pun meletakkanku berdiri di belakangnya, pipiku menempel di pipi beliau. Dan beliau bersabda: \"Silahkan kalian bermain-main, wahai bani Arfidah (gelar bangsa Habasyah).\" Hingga apabila aku bosan, beliau bertanya, \"Cukup?\" Aku menjawab, \"Ya.\" Beliau berkata, \"Pergilah",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2066,
			"arabicnumber": "892.06",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] dari [Hisyam] dari [bapaknya] dari [Aisyah] ia berkata; Orang-orang Habasyah sedang bermain-main di Masjid pada hari raya. Maka Nabi shallallahu 'alaihi wasallam memanggilku, aku pun meletakkan kepala di atas pundaknya untuk melihat permainan mereka sampai aku sendiri yang berhenti melihat mereka. Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Yahya bin Zakariya bin Abu Za`idah] -dalam jalur lain- Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Muhammad bin Bisyr] keduanya dari [Hisyam] dengan isnad ini, namun ia tidak menyebutkan; \"Di dalam masjid",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2067,
			"arabicnumber": "892.07",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2068,
			"arabicnumber": "892.08",
			"text": "Dan telah menceritakan kepadaku [Ibrahim bin Dinar] dan [Uqbah bin Murqam Al Amiy] dan [Abdu bin Humaid] semuanya dari [Abu Ashim] -sementara lafazhnya dari Uqbah- ia berkata, Telah menceritakan kepada kami [Abu Ashim] dari [Ibnu Juraij] ia berkata, telah mengabarkan kepadaku [Atha`] telah mengabarkan kepadaku [Ubaid bin Umair] telah mengabarkan kepadaku [Aisyah] bahwa ia berkata berkenaan dengan orang sedang bermain-main, \"Saya ingin melihat mereka.\" Maka Rasulullah shallallahu 'alaihi wasallam berdiri dan saya pun ikut berdiri di atas pintu sehingga saya melihat di antara kedua telinga dan pundak beliau, sementara mereka bermain-main di masjid. Atha` bertanya; Orang-orang Faris ataukah Habasyi? Dan Ibnu 'Atiq berkata kepadaku; Bahkan mereka adalah orang-orang Habasyi",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2069,
			"arabicnumber": "893",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] dan [Abdu bin Humaid] -Abdu berkata- telah mengabarkan kepada kami -Ibnu Rafi' berkata- telah menceritakan kepada kami [Abdur Razaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ibnul Musayyab] dari [Abu Hurairah] ia berkata; Ketika orang-orang Habasyah bermain-main tombak di sisi Rasulullah shallallahu 'alaihi wasallam, tiba-tiba Umar bin Al Khathab masuk dan segera mengulurkan tangannya mengambil tombak kecil untuk melempar mereka. Namun Rasulullah shallallahu 'alaihi wasallam segera bersabda: \"Biarkanlah mereka wahai Umar",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 24
			}
		}
	]
}