{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 272,
			"arabicnumber": 272,
			"text": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا اغتسل من الجنابة غسل يديه، وتوضأ وضوءه للصلاة ثم اغتسل، ثم يخلل بيده شعره، حتى إذا ظن أن قد أروى بشرته، أفاض عليه الماء ثلاث مرات، ثم غسل سائر جسده‏.‏ وقالت كنت أغتسل أنا ورسول الله، صلى الله عليه وسلم من إناء واحد نغرف منه جميعا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 299,
			"arabicnumber": 299,
			"text": "حدثنا قبيصة، قال حدثنا سفيان، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد، كلانا جنب‏.‏ وكان يأمرني فأتزر، فيباشرني وأنا حائض‏.‏ وكان يخرج رأسه إلى وهو معتكف، فأغسله وأنا حائض‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 300,
			"arabicnumber": 300,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 329,
			"arabicnumber": 329,
			"text": "حدثنا معلى بن أسد، قال حدثنا وهيب، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، قال رخص للحائض أن تنفر، إذا حاضت‏.‏ وكان ابن عمر يقول في أول أمره إنها لا تنفر‏.‏ ثم سمعته يقول تنفر إن رسول الله صلى الله عليه وسلم رخص لهن‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 395,
			"arabicnumber": 395,
			"text": "حدثنا الحميدي، قال حدثنا سفيان، قال حدثنا عمرو بن دينار، قال سألنا ابن عمر عن رجل، طاف بالبيت العمرة، ولم يطف بين الصفا والمروة، أيأتي امرأته فقال قدم النبي صلى الله عليه وسلم فطاف بالبيت سبعا، وصلى خلف المقام ركعتين، وطاف بين الصفا والمروة، وقد كان لكم في رسول الله أسوة حسنة‏.‏ وسألنا جابر بن عبد الله فقال لا يقربنها حتى يطوف بين الصفا والمروة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 402.2,
			"arabicnumber": 402.2,
			"text": "حدثنا ابن أبي مريم، قال أخبرنا يحيى بن أيوب، قال حدثني حميد، قال سمعت أنسا، بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 408,
			"arabicnumber": 408,
			"text": "حدثنا موسى بن إسماعيل، قال أخبرنا إبراهيم بن سعد، أخبرنا ابن شهاب، عن حميد بن عبد الرحمن، أن أبا هريرة، وأبا، سعيد حدثاه أن رسول الله صلى الله عليه وسلم رأى نخامة في جدار المسجد، فتناول حصاة فحكها فقال ‏ \"‏ إذا تنخم أحدكم فلا يتنخمن قبل وجهه ولا عن يمينه، وليبصق عن يساره أو تحت قدمه اليسرى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 410,
			"arabicnumber": 410,
			"text": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، عن حميد بن عبد الرحمن، أن أبا هريرة، وأبا، سعيد أخبراه أن رسول الله صلى الله عليه وسلم رأى نخامة في حائط المسجد، فتناول رسول الله صلى الله عليه وسلم حصاة فحتها ثم قال ‏ \"‏ إذا تنخم أحدكم فلا يتنخم قبل وجهه ولا عن يمينه، وليبصق عن يساره، أو تحت قدمه اليسرى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 435,
			"arabicnumber": 435,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، أخبرني عبيد الله بن عبد الله بن عتبة، أن عائشة، وعبد الله بن عباس، قالا لما نزل برسول الله صلى الله عليه وسلم طفق يطرح خميصة له على وجهه، فإذا اغتم بها كشفها عن وجهه، فقال وهو كذلك ‏ \"‏ لعنة الله على اليهود والنصارى اتخذوا قبور أنبيائهم مساجد ‏\"‏‏.‏ يحذر ما صنعوا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 454,
			"arabicnumber": 454,
			"text": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، قالت لقد رأيت رسول الله صلى الله عليه وسلم يوما على باب حجرتي، والحبشة يلعبون في المسجد ورسول الله صلى الله عليه وسلم يسترني بردائه، أنظر إلى لعبهم‏.‏ زاد إبراهيم بن المنذر حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عروة، عن عائشة، قالت رأيت النبي صلى الله عليه وسلم والحبشة يلعبون بحرابهم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 478,
			"arabicnumber": 478,
			"text": "حدثنا حامد بن عمر، عن بشر، حدثنا عاصم، حدثنا واقد، عن أبيه، عن ابن عمر، أو ابن عمرو شبك النبي صلى الله عليه وسلم أصابعه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 521,
			"arabicnumber": 521,
			"text": "حدثنا عبد الله بن مسلمة، قال قرأت على مالك عن ابن شهاب، أن عمر بن عبد العزيز، أخر الصلاة يوما، فدخل عليه عروة بن الزبير، فأخبره أن المغيرة بن شعبة أخر الصلاة يوما وهو بالعراق، فدخل عليه أبو مسعود الأنصاري فقال ما هذا يا مغيرة أليس قد علمت أن جبريل نزل فصلى، فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم قال ‏ \"‏ بهذا أمرت ‏\"‏‏.‏ فقال عمر لعروة اعلم ما تحدث أوإن جبريل هو أقام لرسول الله صلى الله عليه وسلم وقت الصلاة‏.‏ قال عروة كذلك كان بشير بن أبي مسعود يحدث عن أبيه‏.‏ قال عروة ولقد حدثتني عائشة، أن رسول الله صلى الله عليه وسلم كان يصلي العصر، والشمس في حجرتها قبل أن تظهر‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 533,
			"arabicnumber": 533,
			"text": "حدثنا أيوب بن سليمان، قال حدثنا أبو بكر، عن سليمان، قال صالح بن كيسان حدثنا الأعرج عبد الرحمن، وغيره، عن أبي هريرة‏.‏ونافع مولى عبد الله بن عمر عن عبد الله بن عمر، أنهما حدثاه عن رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ إذا اشتد الحر فأبردوا عن الصلاة، فإن شدة الحر من فيح جهنم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 536,
			"arabicnumber": 536,
			"text": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حفظناه من الزهري عن سعيد بن المسيب، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا اشتد الحر فأبردوا بالصلاة، فإن شدة الحر من فيح جهنم ‏\"‏‏.‏ ‏\"‏ واشتكت النار إلى ربها فقالت يا رب أكل بعضي بعضا‏.‏ فأذن لها بنفسين نفس في الشتاء، ونفس في الصيف، فهو أشد ما تجدون من الحر، وأشد ما تجدون من الزمهرير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 570,
			"arabicnumber": 570,
			"text": "حدثنا محمود، قال أخبرنا عبد الرزاق، قال أخبرني ابن جريج، قال أخبرني نافع، قال حدثنا عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم شغل عنها ليلة، فأخرها حتى رقدنا في المسجد، ثم استيقظنا ثم رقدنا ثم استيقظنا، ثم خرج علينا النبي صلى الله عليه وسلم ثم قال ‏\"‏ ليس أحد من أهل الأرض ينتظر الصلاة غيركم ‏\"‏‏.‏ وكان ابن عمر لا يبالي أقدمها أم أخرها إذا كان لا يخشى أن يغلبه النوم عن وقتها، وكان يرقد قبلها‏.‏ قال ابن جريج قلت لعطاء وقال سمعت ابن عباس، يقول أعتم رسول الله صلى الله عليه وسلم ليلة بالعشاء حتى رقد الناس واستيقظوا، ورقدوا واستيقظوا، فقام عمر بن الخطاب فقال الصلاة‏.‏ قال عطاء قال ابن عباس فخرج نبي الله صلى الله عليه وسلم كأني أنظر إليه الآن، يقطر رأسه ماء، واضعا يده على رأسه فقال ‏\"‏ لولا أن أشق على أمتي لأمرتهم أن يصلوها هكذا ‏\"‏‏.‏ فاستثبت عطاء كيف وضع النبي صلى الله عليه وسلم على رأسه يده كما أنبأه ابن عباس، فبدد لي عطاء بين أصابعه شيئا من تبديد، ثم وضع أطراف أصابعه على قرن الرأس ثم ضمها، يمرها كذلك على الرأس حتى مست إبهامه طرف الأذن مما يلي الوجه على الصدغ، وناحية اللحية، لا يقصر ولا يبطش إلا كذلك وقال ‏\"‏ لولا أن أشق على أمتي لأمرتهم أن يصلوا هكذا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 582,
			"arabicnumber": 582,
			"text": "حدثنا مسدد، قال حدثنا يحيى بن سعيد، عن هشام، قال أخبرني أبي قال، أخبرني ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحروا بصلاتكم طلوع الشمس ولا غروبها ‏\"‏‏.‏ وقال حدثني ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا طلع حاجب الشمس فأخروا الصلاة حتى ترتفع، وإذا غاب حاجب الشمس فأخروا الصلاة حتى تغيب ‏\"‏‏.‏ تابعه عبدة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 622,
			"arabicnumber": 622,
			"text": "حدثنا إسحاق، قال أخبرنا أبو أسامة، قال عبيد الله حدثنا عن القاسم بن محمد، عن عائشة،‏.‏ وعن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال‏.‏ ح وحدثني يوسف بن عيسى المروزي، قال حدثنا الفضل، قال حدثنا عبيد الله بن عمر، عن القاسم بن محمد، عن عائشة، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ إن بلالا يؤذن بليل، فكلوا واشربوا حتى يؤذن ابن أم مكتوم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 652,
			"arabicnumber": 652,
			"text": "حدثنا قتيبة، عن مالك، عن سمى، مولى أبي بكر عن أبي صالح السمان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينما رجل يمشي بطريق وجد غصن شوك على الطريق فأخره، فشكر الله له، فغفر له ‏\"‏‏.‏ ثم قال ‏\"‏ الشهداء خمسة المطعون، والمبطون، والغريق، وصاحب الهدم، والشهيد في سبيل الله ‏\"‏‏.‏ وقال ‏\"‏ لو يعلم الناس ما في النداء والصف الأول ثم لم يجدوا إلا أن يستهموا لاستهموا عليه ‏\"‏‏.‏ ‏\"‏ ولو يعلمون ما في التهجير لاستبقوا إليه، ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 653,
			"arabicnumber": 653,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 655,
			"arabicnumber": 655,
			"text": "حدثنا محمد بن عبد الله بن حوشب، قال حدثنا عبد الوهاب، قال حدثنا حميد، عن أنس، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا بني سلمة ألا تحتسبون آثاركم ‏\"‏‏.‏ وقال مجاهد في قوله ‏{‏ونكتب ما قدموا وآثارهم‏}‏ قال خطاهم‏.‏ وقال ابن أبي مريم أخبرنا يحيى بن أيوب، حدثني حميد، حدثني أنس، أن بني سلمة، أرادوا أن يتحولوا، عن منازلهم، فينزلوا قريبا من النبي صلى الله عليه وسلم قال فكره رسول الله صلى الله عليه وسلم أن يعروا ‏{‏المدينة‏}‏ فقال ‏\"‏ ألا تحتسبون آثاركم ‏\"‏‏.‏ قال مجاهد خطاهم آثارهم أن يمشى في الأرض بأرجلهم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 690.2,
			"arabicnumber": 690.2,
			"text": "حدثنا أبو نعيم، عن سفيان، عن أبي إسحاق، نحوه بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 720,
			"arabicnumber": 720,
			"text": "حدثنا أبو عاصم، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ الشهداء الغرق والمطعون والمبطون والهدم ‏\"‏‏.‏ وقال ‏\"‏ ولو يعلمون ما في التهجير لاستبقوا ‏{‏إليه‏}‏ ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوا، ولو يعلمون ما في الصف المقدم لاستهموا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 774.2,
			"arabicnumber": 774.2,
			"text": "وقال عبيد الله عن ثابت، عن أنس ـ رضى الله عنه ـ كان رجل من الأنصار يؤمهم في مسجد قباء، وكان كلما افتتح سورة يقرأ بها لهم في الصلاة مما يقرأ به افتتح ب ـ ‏{‏قل هو الله أحد‏}‏ حتى يفرغ منها، ثم يقرأ سورة أخرى معها، وكان يصنع ذلك في كل ركعة، فكلمه أصحابه فقالوا إنك تفتتح بهذه السورة، ثم لا ترى أنها تجزئك حتى تقرأ بأخرى، فإما أن تقرأ بها وإما أن تدعها وتقرأ بأخرى‏.‏ فقال ما أنا بتاركها، إن أحببتم أن أؤمكم بذلك فعلت، وإن كرهتم تركتكم‏.‏ وكانوا يرون أنه من أفضلهم، وكرهوا أن يؤمهم غيره، فلما أتاهم النبي صلى الله عليه وسلم أخبروه الخبر فقال ‏\"‏ يا فلان ما يمنعك أن تفعل ما يأمرك به أصحابك وما يحملك على لزوم هذه السورة في كل ركعة ‏\"‏‏.‏ فقال إني أحبها‏.‏ فقال ‏\"‏ حبك إياها أدخلك الجنة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 818,
			"arabicnumber": 818,
			"text": "حدثنا أبو النعمان، قال حدثنا حماد، عن أيوب، عن أبي قلابة، أن مالك بن الحويرث، قال لأصحابه ألا أنبئكم صلاة رسول الله صلى الله عليه وسلم قال وذاك في غير حين صلاة، فقام، ثم ركع فكبر ثم رفع رأسه، فقام هنية، ثم سجد ثم رفع رأسه هنية، فصلى صلاة عمرو بن سلمة شيخنا هذا‏.‏ قال أيوب كان يفعل شيئا لم أرهم يفعلونه، كان يقعد في الثالثة والرابعة‏.‏ قال فأتينا النبي صلى الله عليه وسلم فأقمنا عنده فقال ‏ \"‏ لو رجعتم إلى أهليكم صلوا صلاة كذا في حين كذا، صلوا صلاة كذا في حين كذا، فإذا حضرت الصلاة فليؤذن أحدكم وليؤمكم أكبركم ‏\"‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 832,
			"arabicnumber": 832,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرنا عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم كان يدعو في الصلاة ‏\"‏ اللهم إني أعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال، وأعوذ بك من فتنة المحيا وفتنة الممات، اللهم إني أعوذ بك من المأثم والمغرم ‏\"‏‏.‏ فقال له قائل ما أكثر ما تستعيذ من المغرم فقال ‏\"‏ إن الرجل إذا غرم حدث فكذب، ووعد فأخلف ‏\"‏‏.‏ وعن الزهري، قال أخبرني عروة، أن عائشة ـ رضى الله عنها ـ قالت سمعت رسول الله صلى الله عليه وسلم يستعيذ في صلاته من فتنة الدجال",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 839,
			"arabicnumber": 839,
			"text": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا معمر، عن الزهري، قال أخبرني محمود بن الربيع،، وزعم، أنه عقل رسول الله صلى الله عليه وسلم وعقل مجة مجها من دلو كان في دارهم‏.‏ قال سمعت عتبان بن مالك الأنصاري، ثم أحد بني سالم قال كنت أصلي لقومي بني سالم، فأتيت النبي صلى الله عليه وسلم فقلت إني أنكرت بصري، وإن السيول تحول بيني وبين مسجد قومي، فلوددت أنك جئت فصليت في بيتي مكانا، حتى أتخذه مسجدا فقال ‏\"‏ أفعل إن شاء الله ‏\"‏‏.‏ فغدا على رسول الله صلى الله عليه وسلم وأبو بكر معه بعد ما اشتد النهار، فاستأذن النبي صلى الله عليه وسلم فأذنت له، فلم يجلس حتى قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ فأشار إليه من المكان الذي أحب أن يصلي فيه، فقام فصففنا خلفه ثم سلم، وسلمنا حين سلم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 849,
			"arabicnumber": 849,
			"text": "حدثنا أبو الوليد، حدثنا إبراهيم بن سعد، حدثنا الزهري، عن هند بنت الحارث، عن أم سلمة، أن النبي صلى الله عليه وسلم كان إذا سلم يمكث في مكانه يسيرا‏.‏ قال ابن شهاب فنرى ـ والله أعلم ـ لكى ينفذ من ينصرف من النساء‏.‏ وقال ابن أبي مريم أخبرنا نافع بن يزيد، قال أخبرني جعفر بن ربيعة، أن ابن شهاب، كتب إليه قال حدثتني هند بنت الحارث الفراسية، عن أم سلمة، زوج النبي صلى الله عليه وسلم وكانت من صواحباتها قالت كان يسلم فينصرف النساء، فيدخلن بيوتهن من قبل أن ينصرف رسول الله صلى الله عليه وسلم‏.‏ وقال ابن وهب عن يونس عن ابن شهاب أخبرتني هند الفراسية‏.‏ وقال عثمان بن عمر أخبرنا يونس عن الزهري حدثتني هند الفراسية‏.‏ وقال الزبيدي أخبرني الزهري أن هند بنت الحارث القرشية أخبرته، وكانت تحت معبد بن المقداد ـ وهو حليف بني زهرة ـ وكانت تدخل على أزواج النبي صلى الله عليه وسلم‏.‏ وقال شعيب عن الزهري حدثتني هند القرشية‏.‏ وقال ابن أبي عتيق عن الزهري عن هند الفراسية‏.‏ وقال الليث حدثني يحيى بن سعيد حدثه عن ابن شهاب عن امرأة من قريش حدثته عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 896,
			"arabicnumber": 896,
			"text": "حدثنا مسلم بن إبراهيم، قال حدثنا وهيب، قال حدثنا ابن طاوس، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نحن الآخرون السابقون يوم القيامة، أوتوا الكتاب من قبلنا، وأوتيناه من بعدهم، فهذا اليوم الذي اختلفوا فيه فهدانا الله، فغدا لليهود وبعد غد للنصارى ‏\"‏‏.‏ فسكت‏.‏ ثم قال ‏\"‏ حق على كل مسلم أن يغتسل في كل سبعة أيام يوما يغسل فيه رأسه وجسده ‏\"‏‏.‏\tثم قال ‏\"‏ حق على كل مسلم أن يغتسل في كل سبعة أيام يوما يغسل فيه رأسه وجسده ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 949,
			"arabicnumber": 949,
			"text": "حدثنا أحمد، قال حدثنا ابن وهب، قال أخبرنا عمرو، أن محمد بن عبد الرحمن الأسدي، حدثه عن عروة، عن عائشة، قالت دخل على رسول الله صلى الله عليه وسلم وعندي جاريتان تغنيان بغناء بعاث، فاضطجع على الفراش وحول وجهه، ودخل أبو بكر فانتهرني وقال مزمارة الشيطان عند النبي صلى الله عليه وسلم فأقبل عليه رسول الله ـ عليه السلام ـ فقال ‏\"‏ دعهما ‏\"‏ فلما غفل غمزتهما فخرجتا‏.‏ وكان يوم عيد يلعب السودان بالدرق والحراب، فإما سألت النبي صلى الله عليه وسلم وإما قال ‏\"‏ تشتهين تنظرين ‏\"‏‏.‏ فقلت نعم‏.‏ فأقامني وراءه خدي على خده، وهو يقول ‏\"‏ دونكم يا بني أرفدة ‏\"‏‏.‏ حتى إذا مللت قال ‏\"‏ حسبك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاذهبي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 958,
			"arabicnumber": 958,
			"text": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام، أن ابن جريج، أخبرهم قال أخبرني عطاء، عن جابر بن عبد الله، قال سمعته يقول إن النبي صلى الله عليه وسلم خرج يوم الفطر، فبدأ بالصلاة قبل الخطبة‏.‏ قال وأخبرني عطاء، أن ابن عباس، أرسل إلى ابن الزبير في أول ما بويع له إنه لم يكن يؤذن بالصلاة يوم الفطر، إنما الخطبة بعد الصلاة‏.‏ وأخبرني عطاء، عن ابن عباس، وعن جابر بن عبد الله، قالا لم يكن يؤذن يوم الفطر ولا يوم الأضحى‏.‏ وعن جابر بن عبد الله، قال سمعته يقول إن النبي صلى الله عليه وسلم قام فبدأ بالصلاة، ثم خطب الناس بعد، فلما فرغ نبي الله صلى الله عليه وسلم نزل فأتى النساء، فذكرهن وهو يتوكأ على يد بلال، وبلال باسط ثوبه، يلقي فيه النساء صدقة‏.‏ قلت لعطاء أترى حقا على الإمام الآن أن يأتي النساء فيذكرهن حين يفرغ قال إن ذلك لحق عليهم، وما لهم أن لا يفعلوا",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 959,
			"arabicnumber": 959,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 960,
			"arabicnumber": 960,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 987,
			"arabicnumber": 987,
			"text": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة، أن أبا بكر ـ رضى الله عنه ـ دخل عليها وعندها جاريتان في أيام منى تدففان وتضربان، والنبي صلى الله عليه وسلم متغش بثوبه، فانتهرهما أبو بكر فكشف النبي صلى الله عليه وسلم عن وجهه فقال ‏\"‏ دعهما يا أبا بكر فإنها أيام عيد ‏\"‏‏.‏ وتلك الأيام أيام منى‏.‏ وقالت عائشة رأيت النبي صلى الله عليه وسلم يسترني، وأنا أنظر إلى الحبشة وهم يلعبون في المسجد، فزجرهم عمر فقال النبي صلى الله عليه وسلم ‏\"‏ دعهم، أمنا بني أرفدة ‏\"‏‏.‏ يعني من الأمن‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1008,
			"arabicnumber": 1008,
			"text": "حدثنا عمرو بن علي، قال حدثنا أبو قتيبة، قال حدثنا عبد الرحمن بن عبد الله بن دينار، عن أبيه، قال سمعت ابن عمر، يتمثل بشعر أبي طالب وأبيض يستسقى الغمام بوجهه ثمال اليتامى عصمة للأرامل وقال عمر بن حمزة حدثنا سالم، عن أبيه، ربما ذكرت قول الشاعر وأنا أنظر، إلى وجه النبي صلى الله عليه وسلم يستسقي، فما ينزل حتى يجيش كل ميزاب‏.‏ وأبيض يستسقى الغمام بوجهه ثمال اليتامى عصمة للأرامل وهو قول أبي طالب‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1049,
			"arabicnumber": 1049,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أن يهودية جاءت تسألها فقالت لها أعاذك الله من عذاب القبر‏.‏ فسألت عائشة ـ رضى الله عنها ـ رسول الله صلى الله عليه وسلم أيعذب الناس في قبورهم فقال رسول الله صلى الله عليه وسلم عائذا بالله من ذلك‏.‏ ثم ركب رسول الله صلى الله عليه وسلم ذات غداة مركبا، فخسفت الشمس، فرجع ضحى، فمر رسول الله صلى الله عليه وسلم بين ظهرانى الحجر، ثم قام يصلي، وقام الناس وراءه، فقام قياما طويلا، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا، وهو دون القيام الأول ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم رفع فسجد، ثم قام فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم قام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم رفع فسجد وانصرف، فقال ما شاء الله أن يقول، ثم أمرهم أن يتعوذوا من عذاب القبر‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1055,
			"arabicnumber": 1055,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة ـ رضى الله عنها أن يهودية، جاءت تسألها فقالت أعاذك الله من عذاب القبر‏.‏ فسألت عائشة رسول الله صلى الله عليه وسلم أيعذب الناس في قبورهم فقال رسول الله صلى الله عليه وسلم عائذا بالله من ذلك‏.‏ ثم ركب رسول الله صلى الله عليه وسلم ذات غداة مركبا، فكسفت الشمس فرجع ضحى، فمر رسول الله صلى الله عليه وسلم بين ظهرانى الحجر، ثم قام فصلى، وقام الناس وراءه، فقام قياما طويلا، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم رفع فسجد سجودا طويلا ثم قام فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم قام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم سجد وهو دون السجود الأول، ثم انصرف فقال رسول الله صلى الله عليه وسلم ما شاء الله أن يقول، ثم أمرهم أن يتعوذوا من عذاب القبر",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1065,
			"arabicnumber": 1065,
			"text": "حدثنا محمد بن مهران، قال حدثنا الوليد، قال أخبرنا ابن نمر، سمع ابن شهاب، عن عروة، عن عائشة ـ رضى الله عنها ـ جهر النبي صلى الله عليه وسلم في صلاة الخسوف بقراءته، فإذا فرغ من قراءته كبر فركع، وإذا رفع من الركعة قال سمع الله لمن حمده، ربنا ولك الحمد‏.‏ ثم يعاود القراءة في صلاة الكسوف، أربع ركعات في ركعتين وأربع سجدات‏.‏ وقال الأوزاعي وغيره سمعت الزهري، عن عروة، عن عائشة ـ رضى الله عنها ـ أن الشمس، خسفت على عهد رسول الله صلى الله عليه وسلم فبعث مناديا بالصلاة جامعة، فتقدم فصلى أربع ركعات في ركعتين وأربع سجدات‏.‏ وأخبرني عبد الرحمن بن نمر سمع ابن شهاب مثله‏.‏ قال الزهري فقلت ما صنع أخوك ذلك، عبد الله بن الزبير ما صلى إلا ركعتين مثل الصبح إذ صلى بالمدينة‏.‏ قال أجل، إنه أخطأ السنة‏.‏ تابعه سفيان بن حسين وسليمان بن كثير عن الزهري في الجهر‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1091,
			"arabicnumber": 1091,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني سالم، عن عبد الله بن عمر ـ رضى الله عنهما ـ قال رأيت رسول الله صلى الله عليه وسلم إذا أعجله السير في السفر يؤخر المغرب حتى يجمع بينها وبين العشاء‏.‏ قال سالم وكان عبد الله يفعله إذا أعجله السير‏.‏ وزاد الليث قال حدثني يونس، عن ابن شهاب، قال سالم كان ابن عمر ـ رضى الله عنهما ـ يجمع بين المغرب والعشاء بالمزدلفة‏.‏ قال سالم وأخر ابن عمر المغرب، وكان استصرخ على امرأته صفية بنت أبي عبيد فقلت له الصلاة‏.‏ فقال سر‏.‏ فقلت الصلاة‏.‏ فقال سر‏.‏ حتى سار ميلين أو ثلاثة ثم نزل فصلى ثم قال هكذا رأيت النبي صلى الله عليه وسلم يصلي إذا أعجله السير‏.‏ وقال عبد الله رأيت النبي صلى الله عليه وسلم إذا أعجله السير يؤخر المغرب، فيصليها ثلاثا ثم يسلم، ثم قلما يلبث حتى يقيم العشاء فيصليها ركعتين ثم يسلم، ولا يسبح بعد العشاء حتى يقوم من جوف الليل‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1121,
			"arabicnumber": 1121,
			"text": "حدثنا عبد الله بن محمد، قال حدثنا هشام، قال أخبرنا معمر،‏.‏ وحدثني محمود، قال حدثنا عبد الرزاق، قال أخبرنا معمر، عن الزهري، عن سالم، عن أبيه ـ رضى الله عنه ـ قال كان الرجل في حياة النبي صلى الله عليه وسلم إذا رأى رؤيا قصها على رسول الله صلى الله عليه وسلم فتمنيت أن أرى رؤيا فأقصها على رسول الله صلى الله عليه وسلم وكنت غلاما شابا، وكنت أنام في المسجد على عهد رسول الله صلى الله عليه وسلم فرأيت في النوم كأن ملكين أخذاني فذهبا بي إلى النار فإذا هي مطوية كطى البئر، وإذا لها قرنان، وإذا فيها أناس قد عرفتهم فجعلت أقول أعوذ بالله من النار ـ قال ـ فلقينا ملك آخر فقال لي لم ترع‏.‏ فقصصتها على حفصة فقصتها حفصة على رسول الله صلى الله عليه وسلم فقال ‏ \"‏ نعم الرجل عبد الله، لو كان يصلي من الليل ‏\"‏‏.‏ فكان بعد لا ينام من الليل إلا قليلا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1132.2,
			"arabicnumber": 1132.2,
			"text": "حدثنا محمد بن سلام قال أخبرنا أبو الأحوص عن الأشعث قال إذا سمع الصارخ قام فصلى‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1156,
			"arabicnumber": 1156,
			"text": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر، رضى الله عنهما قال رأيت على عهد النبي صلى الله عليه وسلم كأن بيدي قطعة إستبرق، فكأني لا أريد مكانا من الجنة إلا طارت إليه، ورأيت كأن اثنين أتياني أرادا أن يذهبا بي إلى النار فتلقاهما ملك فقال لم ترع خليا عنه‏.‏ فقصت حفصة على النبي صلى الله عليه وسلم إحدى رؤياى فقال النبي صلى الله عليه وسلم ‏\"‏ نعم الرجل عبد الله لو كان يصلي من الليل ‏\"‏‏.‏ فكان عبد الله ـ رضى الله عنه ـ يصلي من الليل‏.‏ وكانوا لا يزالون يقصون على النبي صلى الله عليه وسلم الرؤيا أنها في الليلة السابعة من العشر الأواخر، فقال النبي صلى الله عليه وسلم ‏\"‏ أرى رؤياكم قد تواطت في العشر الأواخر، فمن كان متحريها فليتحرها من العشر الأواخر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1157,
			"arabicnumber": 1157,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1172,
			"arabicnumber": 1172,
			"text": "حدثنا مسدد، قال حدثنا يحيى بن سعيد، عن عبيد الله، قال أخبرنا نافع، عن ابن عمر ـ رضى الله عنهما ـ قال صليت مع النبي صلى الله عليه وسلم سجدتين قبل الظهر، وسجدتين بعد الظهر، وسجدتين بعد المغرب، وسجدتين بعد العشاء، وسجدتين بعد الجمعة، فأما المغرب والعشاء ففي بيته‏.‏ قال ابن أبي الزناد عن موسى بن عقبة عن نافع بعد العشاء في أهله‏.‏ تابعه كثير بن فرقد وأيوب عن نافع‏.‏ وحدثتني أختي، حفصة أن النبي صلى الله عليه وسلم كان يصلي سجدتين خفيفتين بعد ما يطلع الفجر، وكانت ساعة لا أدخل على النبي صلى الله عليه وسلم فيها‏.‏ تابعه كثير بن فرقد وأيوب عن نافع‏.‏ وقال ابن أبي الزناد عن موسى بن عقبة عن نافع بعد العشاء في أهله‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1180,
			"arabicnumber": 1180,
			"text": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال حفظت من النبي صلى الله عليه وسلم عشر ركعات ركعتين قبل الظهر، وركعتين بعدها، وركعتين بعد المغرب في بيته، وركعتين بعد العشاء في بيته، وركعتين قبل صلاة الصبح، وكانت ساعة لا يدخل على النبي صلى الله عليه وسلم فيها‏.‏ حدثتني حفصة، أنه كان إذا أذن المؤذن وطلع الفجر صلى ركعتين‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1186,
			"arabicnumber": 1186,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1191,
			"arabicnumber": 1191,
			"text": "حدثنا يعقوب بن إبراهيم ـ هو الدورقي ـ حدثنا ابن علية، أخبرنا أيوب، عن نافع، أن ابن عمر ـ رضى الله عنهما ـ كان لا يصلي من الضحى إلا في يومين يوم يقدم بمكة، فإنه كان يقدمها ضحى، فيطوف بالبيت، ثم يصلي ركعتين خلف المقام، ويوم يأتي مسجد قباء، فإنه كان يأتيه كل سبت، فإذا دخل المسجد كره أن يخرج منه حتى يصلي فيه‏.‏ قال وكان يحدث أن رسول الله صلى الله عليه وسلم كان يزوره راكبا وماشيا‏.‏ قال وكان يقول إنما أصنع كما رأيت أصحابي يصنعون، ولا أمنع أحدا أن يصلي في أى ساعة شاء من ليل أو نهار، غير أن لا تتحروا طلوع الشمس ولا غروبها‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1199.2,
			"arabicnumber": 1199.2,
			"text": "حدثنا ابن نمير، حدثنا إسحاق بن منصور، حدثنا هريم بن سفيان، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم نحوه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1228.2,
			"arabicnumber": 1228.2,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد، عن سلمة بن علقمة، قال قلت لمحمد في سجدتى السهو تشهد قال ليس في حديث أبي هريرة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1241,
			"arabicnumber": 1241,
			"text": "حدثنا بشر بن محمد، أخبرنا عبد الله، قال أخبرني معمر، ويونس، عن الزهري، قال أخبرني أبو سلمة، أن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم أخبرته قالت أقبل أبو بكر ـ رضى الله عنه ـ على فرسه من مسكنه بالسنح حتى نزل، فدخل المسجد، فلم يكلم الناس، حتى نزل فدخل على عائشة ـ رضى الله عنها ـ فتيمم النبي صلى الله عليه وسلم وهو مسجى ببرد حبرة، فكشف عن وجهه، ثم أكب عليه فقبله ثم بكى فقال بأبي أنت يا نبي الله، لا يجمع الله عليك موتتين، أما الموتة التي كتبت عليك فقد متها‏.‏ قال أبو سلمة فأخبرني ابن عباس ـ رضى الله عنهما ـ أن أبا بكر ـ رضى الله عنه ـ خرج وعمر ـ رضى الله عنه ـ يكلم الناس‏.‏ فقال اجلس‏.‏ فأبى‏.‏ فقال اجلس‏.‏ فأبى، فتشهد أبو بكر ـ رضى الله عنه ـ فمال إليه الناس، وتركوا عمر فقال أما بعد، فمن كان منكم يعبد محمدا صلى الله عليه وسلم فإن محمدا صلى الله عليه وسلم قد مات، ومن كان يعبد الله فإن الله حى لا يموت، قال الله تعالى ‏{‏وما محمد إلا رسول‏}‏ إلى ‏{‏الشاكرين‏}‏ والله لكأن الناس لم يكونوا يعلمون أن الله أنزل الآية حتى تلاها أبو بكر ـ رضى الله عنه ـ فتلقاها منه الناس، فما يسمع بشر إلا يتلوها‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1249,
			"arabicnumber": 1249,
			"text": "حدثنا مسلم، حدثنا شعبة، حدثنا عبد الرحمن بن الأصبهاني، عن ذكوان، عن أبي سعيد، رضى الله عنه أن النساء، قلن للنبي صلى الله عليه وسلم اجعل لنا يوما‏.‏ فوعظهن، وقال ‏\"‏ أيما امرأة مات لها ثلاثة من الولد كانوا حجابا من النار ‏\"‏‏.‏ قالت امرأة واثنان‏.‏ قال ‏\"‏ واثنان ‏\"‏‏.‏ وقال شريك عن ابن الأصبهاني، حدثني أبو صالح، عن أبي سعيد، وأبي، هريرة ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال أبو هريرة ‏\"‏ لم يبلغوا الحنث ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1258,
			"arabicnumber": 1258,
			"text": "حدثنا حامد بن عمر، حدثنا حماد بن زيد، عن أيوب، عن محمد، عن أم عطية، قالت توفيت إحدى بنات النبي صلى الله عليه وسلم فخرج، فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن بماء وسدر، واجعلن في الآخرة كافورا أو شيئا من كافور، فإذا فرغتن فآذنني ‏\"‏‏.‏ قالت فلما فرغنا آذناه، فألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏ وعن أيوب، عن حفصة، عن أم عطية ـ رضى الله عنهما ـ بنحوه وقالت إنه قال ‏\"‏ اغسلنها ثلاثا أو خمسا أو سبعا أو أكثر من ذلك إن رأيتن ‏\"‏‏.‏ قالت حفصة قالت أم عطية ـ رضى الله عنها ـ وجعلنا رأسها ثلاثة قرون‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1281,
			"arabicnumber": 1281,
			"text": "حدثنا إسماعيل، حدثني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب بنت أبي سلمة، أخبرته قالت، دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم فقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏ ثم دخلت على زينب بنت جحش حين توفي أخوها، فدعت بطيب فمست ثم قالت ما لي بالطيب من حاجة، غير أني سمعت رسول الله صلى الله عليه وسلم على المنبر يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1286,
			"arabicnumber": 1286,
			"text": "حدثنا عبدان، حدثنا عبد الله، أخبرنا ابن جريج، قال أخبرني عبد الله بن عبيد الله بن أبي مليكة، قال توفيت ابنة لعثمان ـ رضى الله عنه ـ بمكة وجئنا لنشهدها، وحضرها ابن عمر وابن عباس ـ رضى الله عنهم ـ وإني لجالس بينهما ـ أو قال جلست إلى أحدهما‏.‏ ثم جاء الآخر، فجلس إلى جنبي فقال عبد الله بن عمر ـ رضى الله عنهما ـ لعمرو بن عثمان ألا تنهى عن البكاء، فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الميت ليعذب ببكاء أهله عليه ‏\"‏‏.‏ فقال ابن عباس ـ رضى الله عنهما ـ قد كان عمر ـ رضى الله عنه ـ يقول بعض ذلك، ثم حدث قال صدرت مع عمر ـ رضى الله عنه ـ من مكة حتى إذا كنا بالبيداء، إذا هو بركب تحت ظل سمرة فقال اذهب، فانظر من هؤلاء الركب قال فنظرت فإذا صهيب، فأخبرته فقال ادعه لي‏.‏ فرجعت إلى صهيب فقلت ارتحل فالحق أمير المؤمنين‏.‏ فلما أصيب عمر دخل صهيب يبكي يقول واأخاه، واصاحباه‏.‏ فقال عمر ـ رضى الله عنه ـ يا صهيب أتبكي على وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الميت يعذب ببعض بكاء أهله عليه ‏\"‏‏.‏ قال ابن عباس ـ رضى الله عنهما فلما مات عمر ـ رضى الله عنه ـ ذكرت ذلك لعائشة ـ رضى الله عنها ـ فقالت رحم الله عمر، والله ما حدث رسول الله صلى الله عليه وسلم إن الله ليعذب المؤمن ببكاء أهله عليه‏.‏ ولكن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله ليزيد الكافر عذابا ببكاء أهله عليه ‏\"‏‏.‏ وقالت حسبكم القرآن ‏{‏ولا تزر وازرة وزر أخرى‏}‏‏.‏ قال ابن عباس ـ رضى الله عنهما ـ عند ذلك والله هو أضحك وأبكى‏.‏ قال ابن أبي مليكة والله ما قال ابن عمر ـ رضى الله عنهما ـ شيئا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1287,
			"arabicnumber": 1287,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": 1312,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، قال سمعت عبد الرحمن بن أبي ليلى، قال كان سهل بن حنيف وقيس بن سعد قاعدين بالقادسية، فمروا عليهما بجنازة فقاما‏.‏ فقيل لهما إنها من أهل الأرض، أى من أهل الذمة فقالا إن النبي صلى الله عليه وسلم مرت به جنازة فقام فقيل له إنها جنازة يهودي‏.‏ فقال ‏ \"‏ أليست نفسا ‏\"‏‏.‏ وقال أبو حمزة عن الأعمش، عن عمرو، عن ابن أبي ليلى، قال كنت مع قيس وسهل ـ رضى الله عنهما ـ فقالا كنا مع النبي صلى الله عليه وسلم‏.‏ وقال زكرياء عن الشعبي عن ابن أبي ليلى كان أبو مسعود وقيس يقومان للجنازة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1323,
			"arabicnumber": 1323,
			"text": "حدثنا أبو النعمان، حدثنا جرير بن حازم، قال سمعت نافعا، يقول حدث ابن عمر، أن أبا هريرة ـ رضى الله عنهم ـ يقول من تبع جنازة فله قيراط‏.‏ فقال أكثر أبو هريرة علينا‏.‏ فصدقت ـ يعني عائشة ـ أبا هريرة وقالت سمعت رسول الله صلى الله عليه وسلم يقوله‏.‏ فقال ابن عمر ـ رضى الله عنهما ـ لقد فرطنا في قراريط كثيرة‏.‏ ‏{‏فرطت‏}‏ ضيعت من أمر الله‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1327,
			"arabicnumber": 1327,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة أنهما حدثاه عن أبي هريرة ـ رضى الله عنه ـ قال نعى لنا رسول الله صلى الله عليه وسلم النجاشي صاحب الحبشة، يوم الذي مات فيه فقال ‏ \"‏ استغفروا لأخيكم ‏\"‏‏.‏ وعن ابن شهاب، قال حدثني سعيد بن المسيب، أن أبا هريرة ـ رضى الله عنه ـ قال إن النبي صلى الله عليه وسلم صف بهم بالمصلى فكبر عليه أربعا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1347,
			"arabicnumber": 1347,
			"text": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا ليث بن سعد، حدثني ابن شهاب، عن عبد الرحمن بن كعب بن مالك، عن جابر بن عبد الله ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم كان يجمع بين الرجلين من قتلى أحد في ثوب واحد ثم يقول ‏\"‏ أيهم أكثر أخذا للقرآن ‏\"‏‏.‏ فإذا أشير له إلى أحدهما قدمه في اللحد وقال ‏\"‏ أنا شهيد على هؤلاء ‏\"‏‏.‏ وأمر بدفنهم بدمائهم، ولم يصل عليهم ولم يغسلهم‏.‏ وأخبرنا الأوزاعي، عن الزهري، عن جابر بن عبد الله ـ رضى الله عنهما ـ كان رسول الله صلى الله عليه وسلم يقول لقتلى أحد ‏\"‏ أى هؤلاء أكثر أخذا للقرآن ‏\"‏‏.‏ فإذا أشير له إلى رجل قدمه في اللحد قبل صاحبه‏.‏ وقال جابر فكفن أبي وعمي في نمرة واحدة‏.‏ وقال سليمان بن كثير حدثني الزهري، حدثنا من، سمع جابرا ـ رضى الله عنه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1354,
			"arabicnumber": 1354,
			"text": "حدثنا عبدان، أخبرنا عبد الله، عن يونس، عن الزهري، قال أخبرني سالم بن عبد الله، أن ابن عمر ـ رضى الله عنهما ـ أخبره أن عمر انطلق مع النبي صلى الله عليه وسلم في رهط قبل ابن صياد، حتى وجدوه يلعب مع الصبيان عند أطم بني مغالة، وقد قارب ابن صياد الحلم فلم يشعر حتى ضرب النبي صلى الله عليه وسلم بيده ثم قال لابن صياد ‏\"‏ تشهد أني رسول الله ‏\"‏‏.‏ فنظر إليه ابن صياد فقال أشهد أنك رسول الأميين‏.‏ فقال ابن صياد للنبي صلى الله عليه وسلم أتشهد أني رسول الله فرفضه وقال آمنت بالله وبرسله‏.‏ فقال له ‏\"‏ ماذا ترى ‏\"‏‏.‏ قال ابن صياد يأتيني صادق وكاذب‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ خلط عليك الأمر ‏\"‏ ثم قال له النبي صلى الله عليه وسلم ‏\"‏ إني قد خبأت لك خبيئا ‏\"‏‏.‏ فقال ابن صياد هو الدخ‏.‏ فقال ‏\"‏ اخسأ، فلن تعدو قدرك ‏\"‏‏.‏ فقال عمر ـ رضى الله عنه ـ دعني يا رسول الله أضرب عنقه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن يكنه فلن تسلط عليه، وإن لم يكنه فلا خير لك في قتله ‏\"‏‏.‏ وقال سالم سمعت ابن عمر ـ رضى الله عنهما ـ يقول انطلق بعد ذلك رسول الله صلى الله عليه وسلم وأبى بن كعب إلى النخل التي فيها ابن صياد وهو يختل أن يسمع من ابن صياد شيئا قبل أن يراه ابن صياد فرآه النبي صلى الله عليه وسلم وهو مضطجع، يعني في قطيفة له فيها رمزة أو زمرة، فرأت أم ابن صياد رسول الله صلى الله عليه وسلم وهو يتقي بجذوع النخل فقالت لابن صياد يا صاف ـ وهو اسم ابن صياد ـ هذا محمد صلى الله عليه وسلم‏.‏ فثار ابن صياد فقال النبي صلى الله عليه وسلم ‏\"‏ لو تركته بين ‏\"‏‏.‏ وقال شعيب في حديثه فرفصه رمرمة، أو زمزمة‏.‏ وقال إسحاق الكلبي وعقيل رمرمة‏.‏ وقال معمر رمزة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1363,
			"arabicnumber": 1363,
			"text": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا خالد، عن أبي قلابة، عن ثابت بن الضحاك ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف بملة غير الإسلام كاذبا متعمدا فهو كما قال، ومن قتل نفسه بحديدة عذب به في نار جهنم ‏\"‏‏.‏ وقال حجاج بن منهال حدثنا جرير بن حازم، عن الحسن، حدثنا جندب ـ رضى الله عنه ـ في هذا المسجد فما نسينا، وما نخاف أن يكذب جندب عن النبي صلى الله عليه وسلم قال ‏\"‏ كان برجل جراح فقتل نفسه فقال الله بدرني عبدي بنفسه حرمت عليه الجنة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1390.2,
			"arabicnumber": 1390.2,
			"text": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا أبو بكر بن عياش، عن سفيان التمار، أنه حدثه أنه، رأى قبر النبي صلى الله عليه وسلم مسنما‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1390.3,
			"arabicnumber": 1390.3,
			"text": "حدثنا فروة، حدثنا علي، عن هشام بن عروة، عن أبيه، لما سقط عليهم الحائط في زمان الوليد بن عبد الملك أخذوا في بنائه، فبدت لهم قدم ففزعوا، وظنوا أنها قدم النبي صلى الله عليه وسلم فما وجدوا أحدا يعلم ذلك حتى قال لهم عروة لا والله ما هي قدم النبي صلى الله عليه وسلم ما هي إلا قدم عمر ـ رضى الله عنه ـ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1399,
			"arabicnumber": 1399,
			"text": "حدثنا أبو اليمان الحكم بن نافع، أخبرنا شعيب بن أبي حمزة، عن الزهري، حدثنا عبيد الله بن عبد الله بن عتبة بن مسعود، أن أبا هريرة ـ رضى الله عنه ـ قال لما توفي رسول الله صلى الله عليه وسلم وكان أبو بكر ـ رضى الله عنه ـ وكفر من كفر من العرب فقال عمر ـ رضى الله عنه كيف تقاتل الناس، وقد قال رسول الله صلى الله عليه وسلم ‏ \"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله‏.‏ فمن قالها فقد عصم مني ماله ونفسه إلا بحقه، وحسابه على الله ‏\"‏‏.‏ فقال والله لأقاتلن من فرق بين الصلاة والزكاة، فإن الزكاة حق المال، والله لو منعوني عناقا كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعها‏.‏ قال عمر ـ رضى الله عنه ـ فوالله ما هو إلا أن قد شرح الله صدر أبي بكر ـ رضى الله عنه ـ فعرفت أنه الحق‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1407,
			"arabicnumber": 1407,
			"text": "حدثنا عياش، حدثنا عبد الأعلى، حدثنا الجريري، عن أبي العلاء، عن الأحنف بن قيس، قال جلست‏.‏ وحدثني إسحاق بن منصور، أخبرنا عبد الصمد، قال حدثني أبي، حدثنا الجريري، حدثنا أبو العلاء بن الشخير، أن الأحنف بن قيس، حدثهم قال جلست إلى ملإ من قريش، فجاء رجل خشن الشعر والثياب والهيئة حتى قام عليهم فسلم ثم قال بشر الكانزين برضف يحمى عليه في نار جهنم، ثم يوضع على حلمة ثدى أحدهم حتى يخرج من نغض كتفه، ويوضع على نغض كتفه حتى يخرج من حلمة ثديه يتزلزل، ثم ولى فجلس إلى سارية، وتبعته وجلست إليه، وأنا لا أدري من هو فقلت له لا أرى القوم إلا قد كرهوا الذي قلت‏.‏ قال إنهم لا يعقلون شيئا‏.‏ قال لي خليلي ـ قال قلت من خليلك قال النبي صلى الله عليه وسلم ـ ‏\"‏ يا أبا ذر أتبصر أحدا ‏\"‏‏.‏ قال فنظرت إلى الشمس ما بقي من النهار وأنا أرى أن رسول الله صلى الله عليه وسلم يرسلني في حاجة له، قلت نعم‏.‏ قال ‏\"‏ ما أحب أن لي مثل أحد ذهبا أنفقه كله إلا ثلاثة دنانير ‏\"‏‏.‏ وإن هؤلاء لا يعقلون، إنما يجمعون الدنيا‏.‏ لا والله لا أسألهم دنيا، ولا أستفتيهم عن دين حتى ألقى الله‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1427,
			"arabicnumber": 1427,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا هشام، عن أبيه، عن حكيم بن حزام ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ اليد العليا خير من اليد السفلى، وابدأ بمن تعول، وخير الصدقة عن ظهر غنى، ومن يستعفف يعفه الله، ومن يستغن يغنه الله ‏\"‏‏.‏ وعن وهيب، قال أخبرنا هشام، عن أبيه، عن أبي هريرة ـ رضى الله عنه ـ بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1456,
			"arabicnumber": 1456,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح وقال الليث حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، أن أبا هريرة ـ رضى الله عنه ـ قال قال أبو بكر ـ رضى الله عنه ـ والله لو منعوني عناقا كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعها‏.‏ قال عمر ـ رضى الله عنه ـ فما هو إلا أن رأيت أن الله شرح صدر أبي بكر ـ رضى الله عنه ـ بالقتال، فعرفت أنه الحق‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1474,
			"arabicnumber": 1474,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عبيد الله بن أبي جعفر، قال سمعت حمزة بن عبد الله بن عمر، قال سمعت عبد الله بن عمر ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏\"‏ ما يزال الرجل يسأل الناس حتى يأتي يوم القيامة ليس في وجهه مزعة لحم ‏\"‏‏.‏ وقال إن الشمس تدنو يوم القيامة حتى يبلغ العرق نصف الأذن، فبينا هم كذلك استغاثوا بآدم، ثم بموسى، ثم بمحمد صلى الله عليه وسلم ‏\"‏‏.‏ وزاد عبد الله حدثني الليث حدثني ابن أبي جعفر ‏\"‏ فيشفع ليقضى بين الخلق، فيمشي حتى يأخذ بحلقة الباب، فيومئذ يبعثه الله مقاما محمودا، يحمده أهل الجمع كلهم ‏\"‏‏.‏ وقال معلى حدثنا وهيب، عن النعمان بن راشد، عن عبد الله بن مسلم، أخي الزهري عن حمزة، سمع ابن عمر ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم في المسألة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1481,
			"arabicnumber": 1481,
			"text": "حدثنا سهل بن بكار، حدثنا وهيب، عن عمرو بن يحيى، عن عباس الساعدي، عن أبي حميد الساعدي، قال غزونا مع النبي صلى الله عليه وسلم غزوة تبوك فلما جاء وادي القرى إذا امرأة في حديقة لها فقال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ اخرصوا ‏\"‏‏.‏ وخرص رسول الله صلى الله عليه وسلم عشرة أوسق فقال لها ‏\"‏ أحصي ما يخرج منها ‏\"‏‏.‏ فلما أتينا تبوك قال ‏\"‏ أما إنها ستهب الليلة ريح شديدة فلا يقومن أحد، ومن كان معه بعير فليعقله ‏\"‏‏.‏ فعقلناها وهبت ريح شديدة فقام رجل فألقته بجبل طيئ ـ وأهدى ملك أيلة للنبي صلى الله عليه وسلم بغلة بيضاء، وكساه بردا وكتب له ببحرهم ـ فلما أتى وادي القرى قال للمرأة ‏\"‏ كم جاء حديقتك ‏\"‏‏.‏ قالت عشرة أوسق خرص رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ إني متعجل إلى المدينة، فمن أراد منكم أن يتعجل معي فليتعجل ‏\"‏‏.‏ فلما ـ قال ابن بكار كلمة معناها ـ أشرف على المدينة قال ‏\"‏ هذه طابة ‏\"‏‏.‏ فلما رأى أحدا قال ‏\"‏ هذا جبيل يحبنا ونحبه، ألا أخبركم بخير دور الأنصار ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ دور بني النجار، ثم دور بني عبد الأشهل، ثم دور بني ساعدة، أو دور بني الحارث بن الخزرج، وفي كل دور الأنصار ـ يعني ـ خيرا ‏\"‏‏.‏ وقال سليمان بن بلال حدثني عمرو، ‏\"‏ ثم دار بني الحارث، ثم بني ساعدة ‏\"‏‏.‏ وقال سليمان عن سعد بن سعيد، عن عمارة بن غزية، عن عباس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ أحد جبل يحبنا ونحبه ‏\"‏‏.‏ قال أبو عبد الله كل بستان عليه حائط فهو حديقة، وما لم يكن عليه حائط لم يقل حديقة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1537,
			"arabicnumber": 1537,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، عن سعيد بن جبير، قال كان ابن عمر ـ رضى الله عنهما ـ يدهن بالزيت‏.‏ فذكرته لإبراهيم قال ما تصنع بقوله حدثني الأسود عن عائشة ـ رضى الله عنها ـ قالت كأني أنظر إلى وبيص الطيب في مفارق رسول الله صلى الله عليه وسلم وهو محرم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1543,
			"arabicnumber": 1543,
			"text": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، حدثنا أبي، عن يونس الأيلي، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس ـ رضى الله عنهما ـ أن أسامة ـ رضى الله عنه ـ كان ردف النبي صلى الله عليه وسلم من عرفة إلى المزدلفة، ثم أردف الفضل من المزدلفة إلى منى‏.‏ قال فكلاهما قال لم يزل النبي صلى الله عليه وسلم يلبي، حتى رمى جمرة العقبة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1614,
			"arabicnumber": 1614,
			"text": "حدثنا أصبغ، عن ابن وهب، أخبرني عمرو، عن محمد بن عبد الرحمن،، ذكرت لعروة، قال فأخبرتني عائشة ـ رضى الله عنها ـ أن أول، شىء بدأ به حين قدم النبي صلى الله عليه وسلم أنه توضأ، ثم طاف، ثم لم تكن عمرة، ثم حج أبو بكر وعمر ـ رضى الله عنهما ـ مثله، ثم حججت مع أبي الزبير ـ رضى الله عنه ـ فأول شىء بدأ به الطواف، ثم رأيت المهاجرين والأنصار يفعلونه، وقد أخبرتني أمي أنها أهلت هي وأختها والزبير وفلان وفلان بعمرة، فلما مسحوا الركن حلوا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1623,
			"arabicnumber": 1623,
			"text": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن عمرو، سألنا ابن عمر ـ رضى الله عنهما ـ أيقع الرجل على امرأته في العمرة قبل أن يطوف بين الصفا والمروة قال قدم رسول الله صلى الله عليه وسلم فطاف بالبيت سبعا، ثم صلى خلف المقام ركعتين، وطاف بين الصفا والمروة، وقال ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏ قال وسألت جابر بن عبد الله ـ رضى الله عنهما ـ فقال لا يقرب امرأته حتى يطوف بين الصفا والمروة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1630,
			"arabicnumber": 1630,
			"text": "حدثني الحسن بن محمد ـ هو الزعفراني ـ حدثنا عبيدة بن حميد، حدثني عبد العزيز بن رفيع، قال رأيت عبد الله بن الزبير ـ رضى الله عنهما ـ يطوف بعد الفجر، ويصلي ركعتين‏.‏ قال عبد العزيز ورأيت عبد الله بن الزبير يصلي ركعتين بعد العصر، ويخبر أن عائشة ـ رضى الله عنها ـ حدثته أن النبي صلى الله عليه وسلم لم يدخل بيتها إلا صلاهما‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1641,
			"arabicnumber": 1641,
			"text": "حدثنا أحمد بن عيسى، حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، عن محمد بن عبد الرحمن بن نوفل القرشي، أنه سأل عروة بن الزبير فقال قد حج النبي صلى الله عليه وسلم فأخبرتني عائشة ـ رضى الله عنها ـ أنه أول شىء بدأ به حين قدم أنه توضأ ثم طاف بالبيت ثم لم تكن عمرة، ثم حج أبو بكر ـ رضى الله عنه ـ فكان أول شىء بدأ به الطواف بالبيت ثم لم تكن عمرة‏.‏ ثم عمر ـ رضى الله عنه ـ مثل ذلك‏.‏ ثم حج عثمان ـ رضى الله عنه ـ فرأيته أول شىء بدأ به الطواف بالبيت ثم لم تكن عمرة، ثم معاوية وعبد الله بن عمر، ثم حججت مع أبي الزبير بن العوام، فكان أول شىء بدأ به الطواف بالبيت، ثم لم تكن عمرة، ثم رأيت المهاجرين والأنصار يفعلون ذلك، ثم لم تكن عمرة، ثم آخر من رأيت فعل ذلك ابن عمر ثم لم ينقضها عمرة، وهذا ابن عمر عندهم فلا يسألونه، ولا أحد ممن مضى، ما كانوا يبدءون بشىء حتى يضعوا أقدامهم من الطواف بالبيت، ثم لا يحلون، وقد رأيت أمي وخالتي، حين تقدمان لا تبتدئان بشىء أول من البيت، تطوفان به، ثم لا تحلان‏.‏ وقد أخبرتني أمي، أنها أهلت هي وأختها والزبير وفلان وفلان بعمرة، فلما مسحوا الركن حلوا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1645,
			"arabicnumber": 1645,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو بن دينار، قال سألنا ابن عمر ـ رضى الله عنه ـ عن رجل، طاف بالبيت في عمرة، ولم يطف بين الصفا والمروة أيأتي امرأته فقال قدم النبي صلى الله عليه وسلم فطاف بالبيت سبعا، وصلى خلف المقام ركعتين، فطاف بين الصفا والمروة سبعا ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏ وسألنا جابر بن عبد الله ـ رضى الله عنهما ـ فقال لا يقربنها حتى يطوف بين الصفا والمروة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": 1669,
			"text": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن محمد بن أبي حرملة، عن كريب، مولى ابن عباس عن أسامة بن زيد ـ رضى الله عنهما ـ أنه قال ردفت رسول الله صلى الله عليه وسلم من عرفات فلما بلغ رسول الله صلى الله عليه وسلم الشعب الأيسر الذي دون المزدلفة أناخ، فبال ثم جاء فصببت عليه الوضوء، فتوضأ وضوءا خفيفا‏.‏ فقلت الصلاة يا رسول الله‏.‏ قال ‏ \"‏ الصلاة أمامك ‏\"‏‏.‏ فركب رسول الله صلى الله عليه وسلم حتى أتى المزدلفة، فصلى ثم ردف الفضل رسول الله صلى الله عليه وسلم غداة جمع‏.‏ قال كريب فأخبرني عبد الله بن عباس ـ رضى الله عنهما ـ عن الفضل، أن رسول الله صلى الله عليه وسلم لم يزل يلبي حتى بلغ الجمرة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1687,
			"arabicnumber": 1687,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1695,
			"arabicnumber": 1695,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": 1758,
			"text": "حدثنا أبو النعمان، حدثنا حماد، عن أيوب، عن عكرمة، أن أهل المدينة، سألوا ابن عباس ـ رضى الله عنهما ـ عن امرأة، طافت ثم حاضت، قال لهم تنفر‏.‏ قالوا لا نأخذ بقولك وندع قول زيد‏.‏ قال إذا قدمتم المدينة فسلوا‏.‏ فقدموا المدينة فسألوا، فكان فيمن سألوا أم سليم، فذكرت حديث صفية‏.‏ رواه خالد وقتادة عن عكرمة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": 1760,
			"text": "حدثنا مسلم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس ـ رضى الله عنهما ـ قال رخص للحائض أن تنفر إذا أفاضت‏.‏ قال وسمعت ابن عمر، يقول إنها لا تنفر‏.‏ ثم سمعته يقول بعد إن النبي صلى الله عليه وسلم رخص لهن‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1771,
			"arabicnumber": 1771,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثني إبراهيم، عن الأسود، عن عائشة ـ رضى الله عنها ـ قالت حاضت صفية ليلة النفر، فقالت ما أراني إلا حابستكم‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ عقرى حلقى أطافت يوم النحر ‏\"‏‏.‏ قيل نعم‏.‏ قال ‏\"‏ فانفري ‏\"‏‏.‏ قال أبو عبد الله وزادني محمد حدثنا محاضر، حدثنا الأعمش، عن إبراهيم، عن الأسود، عن عائشة ـ رضى الله عنها ـ قالت خرجنا مع رسول الله صلى الله عليه وسلم لا نذكر إلا الحج، فلما قدمنا أمرنا أن نحل، فلما كانت ليلة النفر حاضت صفية بنت حيى، فقال النبي صلى الله عليه وسلم ‏\"‏ حلقى عقرى، ما أراها إلا حابستكم ‏\"‏‏.‏ ثم قال ‏\"‏ كنت طفت يوم النحر ‏\"‏‏.‏ قالت نعم‏.‏ قال ‏\"‏ فانفري ‏\"‏‏.‏ قلت يا رسول الله‏.‏ إني لم أكن حللت‏.‏ قال ‏\"‏ فاعتمري من التنعيم ‏\"‏‏.‏ فخرج معها أخوها، فلقيناه مدلجا‏.‏ فقال ‏\"‏ موعدك مكان كذا وكذا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1775,
			"arabicnumber": 1775,
			"text": "حدثنا قتيبة، حدثنا جرير، عن منصور، عن مجاهد، قال دخلت أنا وعروة بن الزبير المسجد،، فإذا عبد الله بن عمر ـ رضى الله عنهما ـ جالس إلى حجرة عائشة، وإذا ناس يصلون في المسجد صلاة الضحى‏.‏ قال فسألناه عن صلاتهم‏.‏ فقال بدعة‏.‏ ثم قال له كم اعتمر رسول الله صلى الله عليه وسلم قال أربع إحداهن في رجب، فكرهنا أن نرد عليه‏.‏ قال وسمعنا استنان، عائشة أم المؤمنين في الحجرة، فقال عروة يا أماه، يا أم المؤمنين‏.‏ ألا تسمعين ما يقول أبو عبد الرحمن‏.‏ قالت ما يقول قال يقول إن رسول الله صلى الله عليه وسلم اعتمر أربع عمرات إحداهن في رجب‏.‏ قالت يرحم الله أبا عبد الرحمن، ما اعتمر عمرة إلا وهو شاهده، وما اعتمر في رجب قط‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": 1791,
			"text": "حدثنا إسحاق بن إبراهيم، عن جرير، عن إسماعيل، عن عبد الله بن أبي أوفى، قال اعتمر رسول الله صلى الله عليه وسلم واعتمرنا معه فلما دخل مكة طاف وطفنا معه، وأتى الصفا والمروة وأتيناها معه، وكنا نستره من أهل مكة أن يرميه أحد‏.‏ فقال له صاحب لي أكان دخل الكعبة قال لا‏.‏ قال فحدثنا ما، قال لخديجة‏.‏ قال ‏ \"‏ بشروا خديجة ببيت في الجنة من قصب لا صخب فيه ولا نصب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": 1793,
			"text": "حدثنا الحميدي، حدثنا سفيان، عن عمرو بن دينار، قال سألنا ابن عمر ـ رضى الله عنهما ـ عن رجل، طاف بالبيت في عمرة، ولم يطف بين الصفا والمروة، أيأتي امرأته فقال قدم النبي صلى الله عليه وسلم فطاف بالبيت سبعا، وصلى خلف المقام ركعتين، وطاف بين الصفا والمروة سبعا، وقد كان لكم في رسول الله أسوة حسنة‏.‏ قال وسألنا جابر بن عبد الله ـ رضى الله عنهما ـ فقال لا يقربنها حتى يطوف بين الصفا والمروة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1918,
			"arabicnumber": 1918,
			"text": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر‏.‏والقاسم بن محمد عن عائشة ـ رضى الله عنها ـ أن بلالا، كان يؤذن بليل فقال رسول الله صلى الله عليه وسلم ‏ \"‏ كلوا واشربوا حتى يؤذن ابن أم مكتوم، فإنه لا يؤذن حتى يطلع الفجر ‏\"‏‏.‏ قال القاسم ولم يكن بين أذانهما إلا أن يرقى ذا وينزل ذا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1925,
			"arabicnumber": 1925,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن سمى، مولى أبي بكر بن عبد الرحمن بن الحارث بن هشام بن المغيرة أنه سمع أبا بكر بن عبد الرحمن، قال كنت أنا وأبي، حين دخلنا على عائشة وأم سلمة ح‏.‏ حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني أبو بكر بن عبد الرحمن بن الحارث بن هشام، أن أباه عبد الرحمن، أخبر مروان، أن عائشة، وأم سلمة أخبرتاه أن رسول الله صلى الله عليه وسلم كان يدركه الفجر وهو جنب من أهله، ثم يغتسل ويصوم‏.‏ وقال مروان لعبد الرحمن بن الحارث أقسم بالله لتقرعن بها أبا هريرة‏.‏ ومروان يومئذ على المدينة‏.‏ فقال أبو بكر فكره ذلك عبد الرحمن، ثم قدر لنا أن نجتمع بذي الحليفة، وكانت لأبي هريرة هنالك أرض، فقال عبد الرحمن لأبي هريرة إني ذاكر لك أمرا، ولولا مروان أقسم على فيه لم أذكره لك‏.‏ فذكر قول عائشة وأم سلمة‏.‏ فقال كذلك حدثني الفضل بن عباس، وهن أعلم، وقال همام وابن عبد الله بن عمر عن أبي هريرة كان النبي صلى الله عليه وسلم يأمر بالفطر‏.‏ والأول أسند‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1931,
			"arabicnumber": 1931,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن سمى، مولى أبي بكر بن عبد الرحمن بن الحارث بن هشام بن المغيرة أنه سمع أبا بكر بن عبد الرحمن، كنت أنا وأبي،، فذهبت معه، حتى دخلنا على عائشة ـ رضى الله عنها ـ قالت أشهد على رسول الله صلى الله عليه وسلم إن كان ليصبح جنبا من جماع غير احتلام، ثم يصومه‏.‏ ثم دخلنا على أم سلمة، فقالت مثل ذلك",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1991,
			"arabicnumber": 1991,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا عمرو بن يحيى، عن أبيه، عن أبي سعيد ـ رضى الله عنه ـ قال نهى النبي صلى الله عليه وسلم عن صوم يوم الفطر والنحر، وعن الصماء، وأن يحتبي الرجل في ثوب واحد‏.‏ وعن صلاة، بعد الصبح والعصر‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1997,
			"arabicnumber": 1997,
			"text": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، سمعت عبد الله بن عيسى، عن الزهري، عن عروة، عن عائشة،‏.‏ وعن سالم، عن ابن عمر ـ رضى الله عنهم ـ قالا لم يرخص في أيام التشريق أن يصمن، إلا لمن لم يجد الهدى‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2030,
			"arabicnumber": 2030,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، عن إبراهيم، عن الأسود، عن عائشة ـ رضى الله عنها ـ قالت كان النبي صلى الله عليه وسلم يباشرني وأنا حائض‏.‏ وكان يخرج رأسه من المسجد وهو معتكف فأغسله وأنا حائض‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2060,
			"arabicnumber": 2060,
			"text": "حدثنا أبو عاصم، عن ابن جريج، قال أخبرني عمرو بن دينار، عن أبي المنهال، قال كنت أتجر في الصرف، فسألت زيد بن أرقم ـ رضى الله عنه ـ فقال قال النبي صلى الله عليه وسلم‏.‏ وحدثني الفضل بن يعقوب، حدثنا الحجاج بن محمد، قال ابن جريج أخبرني عمرو بن دينار، وعامر بن مصعب، أنهما سمعا أبا المنهال، يقول سألت البراء بن عازب وزيد بن أرقم عن الصرف، فقالا كنا تاجرين على عهد رسول الله صلى الله عليه وسلم فسألنا رسول الله صلى الله عليه وسلم عن الصرف فقال ‏ \"‏ إن كان يدا بيد فلا بأس، وإن كان نساء فلا يصلح ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2123,
			"arabicnumber": 2123,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى، عن نافع، حدثنا ابن عمر، أنهم كانوا يشترون الطعام من الركبان على عهد النبي صلى الله عليه وسلم فيبعث عليهم من يمنعهم أن يبيعوه حيث اشتروه، حتى ينقلوه حيث يباع الطعام‏.‏ قال وحدثنا ابن عمر ـ رضى الله عنهما ـ قال نهى النبي صلى الله عليه وسلم أن يباع الطعام إذا اشتراه حتى يستوفيه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2153,
			"arabicnumber": 2153,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن عبيد الله بن عبد الله، عن أبي هريرة، وزيد بن خالد ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم سئل عن الأمة إذا زنت ولم تحصن قال ‏ \"‏ إن زنت فاجلدوها، ثم إن زنت فاجلدوها، ثم إن زنت فبيعوها ولو بضفير ‏\"‏‏.‏ قال ابن شهاب لا أدري بعد الثالثة، أو الرابعة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2172,
			"arabicnumber": 2172,
			"text": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم نهى عن المزابنة قال والمزابنة أن يبيع الثمر بكيل، إن زاد فلي وإن نقص فعلى‏.‏ قال وحدثني زيد بن ثابت، أن النبي صلى الله عليه وسلم رخص في العرايا بخرصها‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2178,
			"arabicnumber": 2178,
			"text": "حدثنا علي بن عبد الله، حدثنا الضحاك بن مخلد، حدثنا ابن جريج، قال أخبرني عمرو بن دينار، أن أبا صالح الزيات، أخبره أنه، سمع أبا سعيد الخدري ـ رضى الله عنه ـ يقول الدينار بالدينار، والدرهم بالدرهم‏.‏ فقلت له فإن ابن عباس لا يقوله‏.‏ فقال أبو سعيد سألته فقلت سمعته من النبي، صلى الله عليه وسلم، أو وجدته في كتاب الله قال كل ذلك لا أقول، وأنتم أعلم برسول الله صلى الله عليه وسلم مني، ولكنني أخبرني أسامة أن النبي صلى الله عليه وسلم قال ‏ \"‏ لا ربا إلا في النسيئة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2180,
			"arabicnumber": 2180,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني حبيب بن أبي ثابت، قال سمعت أبا المنهال، قال سألت البراء بن عازب وزيد بن أرقم ـ رضى الله عنهم ـ عن الصرف،، فكل واحد منهما يقول هذا خير مني‏.‏ فكلاهما يقول نهى رسول الله صلى الله عليه وسلم عن بيع الذهب بالورق دينا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2183,
			"arabicnumber": 2183,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، أخبرني سالم بن عبد الله، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تبيعوا الثمر حتى يبدو صلاحه، ولا تبيعوا الثمر بالتمر ‏\"‏ قال سالم وأخبرني عبد الله، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم رخص بعد ذلك في بيع العرية بالرطب أو بالتمر، ولم يرخص في غيره‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2201,
			"arabicnumber": 2201,
			"text": "حدثنا قتيبة، عن مالك، عن عبد المجيد بن سهيل بن عبد الرحمن، عن سعيد بن المسيب، عن أبي سعيد الخدري، وعن أبي هريرة ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم استعمل رجلا على خيبر، فجاءه بتمر جنيب، فقال رسول الله صلى الله عليه وسلم ‏\"‏ أكل تمر خيبر هكذا ‏\"‏‏.‏ قال لا والله يا رسول الله، إنا لنأخذ الصاع من هذا بالصاعين، والصاعين بالثلاثة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تفعل، بع الجمع بالدراهم، ثم ابتع بالدراهم جنيبا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2214.2,
			"arabicnumber": 2214.2,
			"text": "حدثنا مسدد، حدثنا عبد الواحد، بهذا وقال في كل ما لم يقسم‏.‏ تابعه هشام عن معمر‏.‏ قال عبد الرزاق في كل مال‏.‏ رواه عبد الرحمن بن إسحاق عن الزهري‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2232,
			"arabicnumber": 2232,
			"text": "حدثني زهير بن حرب، حدثنا يعقوب، حدثنا أبي، عن صالح، قال حدث ابن شهاب، أن عبيد الله، أخبره أن زيد بن خالد وأبا هريرة رضى الله عنهما أخبراه أنهما، سمعا رسول الله صلى الله عليه وسلم يسأل عن الأمة تزني ولم تحصن قال ‏ \"‏ اجلدوها، ثم إن زنت فاجلدوها، ثم بيعوها بعد الثالثة أو الرابعة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2239.2,
			"arabicnumber": 2239.2,
			"text": "حدثنا محمد، أخبرنا إسماعيل، عن ابن أبي نجيح، بهذا ‏ \"‏ في كيل معلوم ووزن معلوم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2240.2,
			"arabicnumber": 2240.2,
			"text": "حدثنا علي، حدثنا سفيان، قال حدثني ابن أبي نجيح، وقال، ‏ \"‏ فليسلف في كيل معلوم إلى أجل معلوم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2242,
			"arabicnumber": 2242,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن ابن أبي المجالد،‏.‏ وحدثنا يحيى، حدثنا وكيع، عن شعبة، عن محمد بن أبي المجالد، حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني محمد،، أو عبد الله بن أبي المجالد قال اختلف عبد الله بن شداد بن الهاد وأبو بردة في السلف، فبعثوني إلى ابن أبي أوفى ـ رضى الله عنه ـ فسألته فقال إنا كنا نسلف على عهد رسول الله صلى الله عليه وسلم وأبي بكر وعمر، في الحنطة، والشعير والزبيب، والتمر‏.‏ وسألت ابن أبزى فقال مثل ذلك‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2247,
			"arabicnumber": 2247,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن عمرو، عن أبي البختري، قال سألت ابن عمر ـ رضى الله عنهما ـ عن السلم، في النخل فقال نهي عن بيع النخل، حتى يصلح، وعن بيع الورق، نساء بناجز‏.‏ وسألت ابن عباس عن السلم، في النخل، فقال نهى النبي صلى الله عليه وسلم عن بيع النخل حتى يؤكل منه، أو يأكل منه، وحتى يوزن‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2249,
			"arabicnumber": 2249,
			"text": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عمرو، عن أبي البختري، سألت ابن عمر ـ رضى الله عنهما ـ عن السلم، في النخل فقال نهى النبي صلى الله عليه وسلم عن بيع الثمر حتى يصلح، ونهى عن الورق بالذهب نساء بناجز‏.‏ وسألت ابن عباس فقال نهى النبي صلى الله عليه وسلم عن بيع النخل حتى يأكل أو يؤكل، وحتى يوزن‏.‏ قلت وما يوزن قال رجل عنده حتى يحرز‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2254,
			"arabicnumber": 2254,
			"text": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا سفيان، عن سليمان الشيباني، عن محمد بن أبي مجالد، قال أرسلني أبو بردة وعبد الله بن شداد إلى عبد الرحمن بن أبزى وعبد الله بن أبي أوفى فسألتهما عن السلف،‏.‏ فقالا كنا نصيب المغانم مع رسول الله صلى الله عليه وسلم فكان يأتينا أنباط من أنباط الشأم فنسلفهم في الحنطة والشعير والزبيب إلى أجل مسمى‏.‏ قال قلت أكان لهم زرع، أو لم يكن لهم زرع قالا ما كنا نسألهم عن ذلك‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2265,
			"arabicnumber": 2265,
			"text": "حدثنا يعقوب بن إبراهيم، حدثنا إسماعيل ابن علية، أخبرنا ابن جريج، قال أخبرني عطاء، عن صفوان بن يعلى، عن يعلى بن أمية ـ رضى الله عنه ـ قال غزوت مع النبي صلى الله عليه وسلم جيش العسرة فكان من أوثق أعمالي في نفسي، فكان لي أجير، فقاتل إنسانا، فعض أحدهما إصبع صاحبه، فانتزع إصبعه، فأندر ثنيته فسقطت، فانطلق إلى النبي صلى الله عليه وسلم فأهدر ثنيته وقال ‏ \"‏ أفيدع إصبعه في فيك تقضمها ـ قال أحسبه قال ـ كما يقضم الفحل ‏\"‏‏.‏ قال ابن جريج وحدثني عبد الله بن أبي مليكة، عن جده، بمثل هذه الصفة أن رجلا، عض يد رجل، فأندر ثنيته، فأهدرها أبو بكر رضى الله عنه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2285,
			"arabicnumber": 2285,
			"text": "حدثنا موسى بن إسماعيل، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله ـ رضى الله عنه ـ قال أعطى رسول الله صلى الله عليه وسلم خيبر أن يعملوها ويزرعوها ولهم شطر ما يخرج منها، وأن ابن عمر حدثه أن المزارع كانت تكرى على شىء سماه نافع لا أحفظه‏.‏ وأن رافع بن خديج حدث أن النبي صلى الله عليه وسلم نهى عن كراء المزارع‏.‏ وقال عبيد الله عن نافع عن ابن عمر حتى أجلاهم عمر‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2302,
			"arabicnumber": 2302,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد المجيد بن سهيل بن عبد الرحمن بن عوف، عن سعيد بن المسيب، عن أبي سعيد الخدري، وأبي، هريرة رضى الله عنهما أن رسول الله صلى الله عليه وسلم استعمل رجلا على خيبر، فجاءهم بتمر جنيب فقال ‏\"‏ أكل تمر خيبر هكذا ‏\"‏‏.‏ فقال إنا لنأخذ الصاع من هذا بالصاعين، والصاعين بالثلاثة‏.‏ فقال ‏\"‏ لا تفعل، بع الجمع بالدراهم، ثم ابتع بالدراهم جنيبا ‏\"‏‏.‏ وقال في الميزان مثل ذلك‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2307,
			"arabicnumber": 2307,
			"text": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال وزعم عروة أن مروان بن الحكم، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قام حين جاءه وفد هوازن مسلمين، فسألوه أن يرد إليهم أموالهم وسبيهم فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ أحب الحديث إلى أصدقه‏.‏ فاختاروا إحدى الطائفتين إما السبى، وإما المال، وقد كنت استأنيت بهم ‏\"‏‏.‏ وقد كان رسول الله صلى الله عليه وسلم انتظرهم بضع عشرة ليلة، حين قفل من الطائف، فلما تبين لهم أن رسول الله صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام رسول الله صلى الله عليه وسلم في المسلمين، فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد فإن إخوانكم هؤلاء قد جاءونا تائبين، وإني قد رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب بذلك فليفعل، ومن أحب منكم أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا فليفعل ‏\"‏‏.‏ فقال الناس قد طيبنا ذلك لرسول الله صلى الله عليه وسلم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم في ذلك ممن لم يأذن، فارجعوا حتى يرفعوا إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم، ثم رجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أنهم قد طيبوا وأذنوا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2314,
			"arabicnumber": 2314,
			"text": "حدثنا أبو الوليد، أخبرنا الليث، عن ابن شهاب، عن عبيد الله، عن زيد بن خالد، وأبي، هريرة رضى الله عنهما عن النبي صلى الله عليه وسلم قال ‏ \"‏ واغد يا أنيس إلى امرأة هذا، فإن اعترفت فارجمها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2340,
			"arabicnumber": 2340,
			"text": "حدثنا عبيد الله بن موسى، أخبرنا الأوزاعي، عن عطاء، عن جابر ـ رضى الله عنه ـ قال كانوا يزرعونها بالثلث والربع والنصف فقال النبي صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها أو ليمنحها، فإن لم يفعل فليمسك أرضه ‏\"‏‏.‏ وقال الربيع بن نافع أبو توبة حدثنا معاوية، عن يحيى، عن أبي سلمة، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها أو ليمنحها أخاه، فإن أبى فليمسك أرضه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2343,
			"arabicnumber": 2343,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن نافع، أن ابن عمر ـ رضى الله عنهما ـ كان يكري مزارعه على عهد النبي صلى الله عليه وسلم وأبي بكر وعمر وعثمان وصدرا من إمارة معاوية‏.‏ ثم حدث عن رافع بن خديج، أن النبي صلى الله عليه وسلم نهى عن كراء المزارع، فذهب ابن عمر إلى رافع فذهبت معه، فسأله فقال نهى النبي صلى الله عليه وسلم عن كراء المزارع‏.‏ فقال ابن عمر قد علمت أنا كنا نكري مزارعنا على عهد رسول الله صلى الله عليه وسلم بما على الأربعاء وبشىء من التبن‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2346,
			"arabicnumber": 2346,
			"text": "حدثنا عمرو بن خالد، حدثنا الليث، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، عن رافع بن خديج، قال حدثني عماى، أنهم كانوا يكرون الأرض على عهد النبي صلى الله عليه وسلم بما ينبت على الأربعاء أو شىء يستثنيه صاحب الأرض فنهى النبي صلى الله عليه وسلم عن ذلك فقلت لرافع فكيف هي بالدينار والدرهم فقال رافع ليس بها بأس بالدينار والدرهم‏.‏ وقال الليث وكان الذي نهي عن ذلك ما لو نظر فيه ذوو الفهم بالحلال والحرام لم يجيزوه، لما فيه من المخاطرة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2356,
			"arabicnumber": 2356,
			"text": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن شقيق، عن عبد الله ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين يقتطع بها مال امرئ، هو عليها فاجر، لقي الله وهو عليه غضبان‏\"‏ فأنزل الله تعالى ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ الآية‏.‏ فجاء الأشعث فقال ما حدثكم أبو عبد الرحمن، في أنزلت هذه الآية، كانت لي بئر في أرض ابن عم لي فقال لي ‏\"‏ شهودك ‏\"‏‏.‏ قلت ما لي شهود‏.‏ قال ‏\"‏ فيمينه ‏\"‏‏.‏ قلت يا رسول الله إذا يحلف‏.‏ فذكر النبي صلى الله عليه وسلم هذا الحديث، فأنزل الله ذلك تصديقا له‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2360,
			"arabicnumber": 2360,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2384,
			"arabicnumber": 2384,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2405,
			"arabicnumber": 2405,
			"text": "حدثنا موسى، حدثنا أبو عوانة، عن مغيرة، عن عامر، عن جابر ـ رضى الله عنه ـ قال أصيب عبد الله وترك عيالا ودينا، فطلبت إلى أصحاب الدين أن يضعوا بعضا من دينه فأبوا، فأتيت النبي صلى الله عليه وسلم فاستشفعت به عليهم فأبوا، فقال ‏\"‏ صنف تمرك كل شىء منه على حدته، عذق ابن زيد على حدة، واللين على حدة، والعجوة على حدة، ثم أحضرهم حتى آتيك ‏\"‏‏.‏ ففعلت، ثم جاء صلى الله عليه وسلم فقعد عليه، وكال لكل رجل حتى استوفى، وبقي التمر كما هو كأنه لم يمس‏.‏ وغزوت مع النبي صلى الله عليه وسلم على ناضح لنا، فأزحف الجمل فتخلف على فوكزه النبي صلى الله عليه وسلم من خلفه، قال ‏\"‏ بعنيه ولك ظهره إلى المدينة ‏\"‏‏.‏ فلما دنونا استأذنت قلت يا رسول الله إني حديث عهد بعرس‏.‏ قال صلى الله عليه وسلم ‏\"‏ فما تزوجت بكرا أم ثيبا ‏\"‏‏.‏ قلت ثيبا، أصيب عبد الله وترك جواري صغارا، فتزوجت ثيبا تعلمهن وتؤدبهن، ثم قال ‏\"‏ ائت أهلك ‏\"‏‏.‏ فقدمت فأخبرت خالي ببيع الجمل فلامني، فأخبرته بإعياء الجمل، وبالذي كان من النبي صلى الله عليه وسلم ووكزه إياه، فلما قدم النبي صلى الله عليه وسلم غدوت إليه بالجمل، فأعطاني ثمن الجمل والجمل وسهمي مع القوم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2417,
			"arabicnumber": 2417,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2437.2,
			"arabicnumber": 2437.2,
			"text": "حدثنا عبدان، قال أخبرني أبي، عن شعبة، عن سلمة، بهذا قال فلقيته بعد بمكة، فقال لا أدري أثلاثة أحوال أو حولا واحدا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2497,
			"arabicnumber": 2497,
			"text": "حدثنا عمرو بن علي، حدثنا أبو عاصم، عن عثمان يعني ابن الأسود، قال أخبرني سليمان بن أبي مسلم، قال سألت أبا المنهال عن الصرف، يدا بيد فقال اشتريت أنا وشريك، لي شيئا يدا بيد ونسيئة، فجاءنا البراء بن عازب فسألناه، فقال فعلت أنا وشريكي زيد بن أرقم، وسألنا النبي صلى الله عليه وسلم عن ذلك فقال ‏ \"‏ ما كان يدا بيد فخذوه، وما كان نسيئة فذروه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2501,
			"arabicnumber": 2501,
			"text": "حدثنا أصبغ بن الفرج، قال أخبرني عبد الله بن وهب، قال أخبرني سعيد، عن زهرة بن معبد، عن جده عبد الله بن هشام ـ وكان قد أدرك النبي صلى الله عليه وسلم ـ وذهبت به أمه زينب بنت حميد إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله بايعه‏.‏ فقال ‏ \"‏ هو صغير ‏\"‏‏.‏ فمسح رأسه ودعا له‏.‏ وعن زهرة بن معبد، أنه كان يخرج به جده عبد الله بن هشام إلى السوق فيشتري الطعام فيلقاه ابن عمر وابن الزبير ـ رضى الله عنهم ـ فيقولان له أشركنا، فإن النبي صلى الله عليه وسلم قد دعا لك بالبركة فيشركهم، فربما أصاب الراحلة كما هي، فيبعث بها إلى المنزل‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2505,
			"arabicnumber": 2505,
			"text": "حدثنا أبو النعمان، حدثنا حماد بن زيد، أخبرنا عبد الملك بن جريج، عن عطاء، عن جابر‏.‏وعن طاوس، عن ابن عباس ـ رضى الله عنهم ـ قال قدم النبي صلى الله عليه وسلم صبح رابعة من ذي الحجة مهلين بالحج، لا يخلطهم شىء، فلما قدمنا أمرنا فجعلناها عمرة، وأن نحل إلى نسائنا، ففشت في ذلك القالة‏.‏ قال عطاء فقال جابر فيروح أحدنا إلى منى وذكره يقطر منيا‏.‏ فقال جابر بكفه، فبلغ النبي صلى الله عليه وسلم فقام خطيبا فقال ‏\"‏ بلغني أن أقواما يقولون كذا وكذا، والله لأنا أبر وأتقى لله منهم، ولو أني استقبلت من أمري ما استدبرت ما أهديت، ولولا أن معي الهدى لأحللت ‏\"‏‏.‏ فقام سراقة بن مالك بن جعشم فقال يا رسول الله هي لنا أو للأبد فقال ‏\"‏ لا بل للأبد ‏\"‏‏.‏ قال وجاء علي بن أبي طالب ـ فقال أحدهما يقول لبيك بما أهل به رسول الله صلى الله عليه وسلم‏.‏ وقال وقال الآخر لبيك بحجة رسول الله صلى الله عليه وسلم ـ فأمر النبي صلى الله عليه وسلم أن يقيم على إحرامه، وأشركه في الهدى‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2516,
			"arabicnumber": 2516,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2539,
			"arabicnumber": 2539,
			"text": "حدثنا ابن أبي مريم، قال أخبرني الليث، عن عقيل، عن ابن شهاب، ذكر عروة أن مروان، والمسور بن مخرمة، أخبراه أن النبي صلى الله عليه وسلم قام حين جاءه وفد هوازن، فسألوه أن يرد إليهم أموالهم وسبيهم فقال ‏\"‏ إن معي من ترون، وأحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما المال، وإما السبى، وقد كنت استأنيت بهم ‏\"‏‏.‏ وكان النبي صلى الله عليه وسلم انتظرهم بضع عشرة ليلة حين قفل من الطائف، فلما تبين لهم أن النبي صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام النبي صلى الله عليه وسلم في الناس، فأثنى على الله بما هو أهله، ثم قال ‏\"‏ أما بعد فإن إخوانكم جاءونا تائبين، وإني رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا فليفعل ‏\"‏‏.‏ فقال الناس طيبنا ذلك‏.‏ قال ‏\"‏ إنا لا ندري من أذن منكم ممن لم يأذن فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس، فكلمهم عرفاؤهم، ثم رجعوا إلى النبي صلى الله عليه وسلم فأخبروه أنهم طيبوا وأذنوا، فهذا الذي بلغنا عن سبى هوازن‏.‏ وقال أنس قال عباس للنبي صلى الله عليه وسلم فاديت نفسي، وفاديت عقيلا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2556,
			"arabicnumber": 2556,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2584,
			"arabicnumber": 2584,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2608,
			"arabicnumber": 2608,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2615,
			"arabicnumber": 2615,
			"text": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس ـ رضى الله عنه ـ قال أهدي للنبي صلى الله عليه وسلم جبة سندس، وكان ينهى عن الحرير، فعجب الناس منها فقال ‏ \"‏ والذي نفس محمد بيده لمناديل سعد بن معاذ في الجنة أحسن من هذا ‏\"‏‏.‏ وقال سعيد عن قتادة، عن أنس، إن أكيدر دومة أهدى إلى النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2667,
			"arabicnumber": 2667,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2670,
			"arabicnumber": 2670,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2677,
			"arabicnumber": 2677,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2696,
			"arabicnumber": 2696,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2711,
			"arabicnumber": 2711,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عروة بن الزبير، أنه سمع مروان، والمسور بن مخرمة، رضى الله عنهما يخبران عن أصحاب، رسول الله صلى الله عليه وسلم قال لما كاتب سهيل بن عمرو يومئذ كان فيما اشترط سهيل بن عمرو على النبي صلى الله عليه وسلم أنه لا يأتيك منا أحد وإن كان على دينك إلا رددته إلينا، وخليت بيننا وبينه‏.‏ فكره المؤمنون ذلك، وامتعضوا منه، وأبى سهيل إلا ذلك، فكاتبه النبي صلى الله عليه وسلم على ذلك، فرد يومئذ أبا جندل على أبيه سهيل بن عمرو، ولم يأته أحد من الرجال إلا رده في تلك المدة، وإن كان مسلما، وجاء المؤمنات مهاجرات، وكانت أم كلثوم بنت عقبة بن أبي معيط ممن خرج إلى رسول الله صلى الله عليه وسلم يومئذ وهى عاتق، فجاء أهلها يسألون النبي صلى الله عليه وسلم أن يرجعها إليهم، فلم يرجعها إليهم لما أنزل الله فيهن ‏{‏إذا جاءكم المؤمنات مهاجرات فامتحنوهن الله أعلم بإيمانهن‏}‏ إلى قوله ‏{‏ولا هم يحلون لهن‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2725,
			"arabicnumber": 2725,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2731,
			"arabicnumber": 2731,
			"text": "حدثني عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، قال أخبرني الزهري، قال أخبرني عروة بن الزبير، عن المسور بن مخرمة، ومروان، يصدق كل واحد منهما حديث صاحبه قال خرج رسول الله صلى الله عليه وسلم زمن الحديبية، حتى كانوا ببعض الطريق قال النبي صلى الله عليه وسلم ‏\"‏ إن خالد بن الوليد بالغميم في خيل لقريش طليعة فخذوا ذات اليمين ‏\"‏‏.‏ فوالله ما شعر بهم خالد حتى إذا هم بقترة الجيش، فانطلق يركض نذيرا لقريش، وسار النبي صلى الله عليه وسلم حتى إذا كان بالثنية التي يهبط عليهم منها، بركت به راحلته‏.‏ فقال الناس حل حل‏.‏ فألحت، فقالوا خلأت القصواء، خلأت القصواء‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ما خلأت القصواء، وما ذاك لها بخلق، ولكن حبسها حابس الفيل، ثم قال والذي نفسي بيده لا يسألوني خطة يعظمون فيها حرمات الله إلا أعطيتهم إياها ‏\"‏‏.‏ ثم زجرها فوثبت، قال فعدل عنهم حتى نزل بأقصى الحديبية، على ثمد قليل الماء يتبرضه الناس تبرضا، فلم يلبثه الناس حتى نزحوه، وشكي إلى رسول الله صلى الله عليه وسلم العطش، فانتزع سهما من كنانته، ثم أمرهم أن يجعلوه فيه، فوالله ما زال يجيش لهم بالري حتى صدروا عنه، فبينما هم كذلك، إذ جاء بديل بن ورقاء الخزاعي في نفر من قومه من خزاعة، وكانوا عيبة نصح رسول الله صلى الله عليه وسلم من أهل تهامة، فقال إني تركت كعب بن لؤى وعامر بن لؤى نزلوا أعداد مياه الحديبية، ومعهم العوذ المطافيل، وهم مقاتلوك وصادوك عن البيت‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا لم نجئ لقتال أحد، ولكنا جئنا معتمرين، وإن قريشا قد نهكتهم الحرب، وأضرت بهم، فإن شاءوا ماددتهم مدة، ويخلوا بيني وبين الناس، فإن أظهر فإن شاءوا أن يدخلوا فيما دخل فيه الناس فعلوا، وإلا فقد جموا، وإن هم أبوا فوالذي نفسي بيده، لأقاتلنهم على أمري هذا حتى تنفرد سالفتي، ولينفذن الله أمره ‏\"‏‏.‏ فقال بديل سأبلغهم ما تقول‏.‏ قال فانطلق حتى أتى قريشا قال إنا قد جئناكم من هذا الرجل، وسمعناه يقول قولا، فإن شئتم أن نعرضه عليكم فعلنا، فقال سفهاؤهم لا حاجة لنا أن تخبرنا عنه بشىء‏.‏ وقال ذوو الرأى منهم هات ما سمعته يقول‏.‏ قال سمعته يقول كذا وكذا، فحدثهم بما قال النبي صلى الله عليه وسلم‏.‏ فقام عروة بن مسعود فقال أى قوم ألستم بالوالد قالوا بلى‏.‏ قال أولست بالولد قالوا بلى‏.‏ قال فهل تتهموني‏.‏ قالوا لا‏.‏ قال ألستم تعلمون أني استنفرت أهل عكاظ، فلما بلحوا على جئتكم بأهلي وولدي ومن أطاعني قالوا بلى‏.‏ قال فإن هذا قد عرض لكم خطة رشد، اقبلوها ودعوني آته‏.‏ قالوا ائته‏.‏ فأتاه فجعل يكلم النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم نحوا من قوله لبديل، فقال عروة عند ذلك أى محمد، أرأيت إن استأصلت أمر قومك هل سمعت بأحد من العرب اجتاح أهله قبلك وإن تكن الأخرى، فإني والله لأرى وجوها، وإني لأرى أوشابا من الناس خليقا أن يفروا ويدعوك‏.‏ فقال له أبو بكر امصص بظر اللات، أنحن نفر عنه وندعه فقال من ذا قالوا أبو بكر‏.‏ قال أما والذي نفسي بيده لولا يد كانت لك عندي لم أجزك بها لأجبتك‏.‏ قال وجعل يكلم النبي صلى الله عليه وسلم فكلما تكلم أخذ بلحيته، والمغيرة بن شعبة قائم على رأس النبي صلى الله عليه وسلم ومعه السيف وعليه المغفر، فكلما أهوى عروة بيده إلى لحية النبي صلى الله عليه وسلم ضرب يده بنعل السيف، وقال له أخر يدك عن لحية رسول الله صلى الله عليه وسلم‏.‏ فرفع عروة رأسه فقال من هذا قالوا المغيرة بن شعبة‏.‏ فقال أى غدر، ألست أسعى في غدرتك وكان المغيرة صحب قوما في الجاهلية، فقتلهم، وأخذ أموالهم، ثم جاء فأسلم فقال النبي صلى الله عليه وسلم ‏\"‏ أما الإسلام فأقبل، وأما المال فلست منه في شىء ‏\"‏‏.‏ ثم إن عروة جعل يرمق أصحاب النبي صلى الله عليه وسلم بعينيه‏.‏ قال فوالله ما تنخم رسول الله صلى الله عليه وسلم نخامة إلا وقعت في كف رجل منهم فدلك بها وجهه وجلده، وإذا أمرهم ابتدروا أمره، وإذا توضأ كادوا يقتتلون على وضوئه، وإذا تكلم خفضوا أصواتهم عنده، وما يحدون إليه النظر تعظيما له، فرجع عروة إلى أصحابه، فقال أى قوم، والله لقد وفدت على الملوك، ووفدت على قيصر وكسرى والنجاشي والله إن رأيت ملكا قط، يعظمه أصحابه ما يعظم أصحاب محمد صلى الله عليه وسلم محمدا، والله إن تنخم نخامة إلا وقعت في كف رجل منهم، فدلك بها وجهه وجلده، وإذا أمرهم ابتدروا أمره وإذا توضأ كادوا يقتتلون على وضوئه، وإذا تكلم خفضوا أصواتهم عنده، وما يحدون إليه النظر تعظيما له، وإنه قد عرض عليكم خطة رشد، فاقبلوها‏.‏ فقال رجل من بني كنانة دعوني آته‏.‏ فقالوا ائته‏.‏ فلما أشرف على النبي صلى الله عليه وسلم وأصحابه، قال رسول الله صلى الله عليه وسلم ‏\"‏ هذا فلان، وهو من قوم يعظمون البدن فابعثوها له ‏\"‏‏.‏ فبعثت له واستقبله الناس يلبون، فلما رأى ذلك قال سبحان الله ما ينبغي لهؤلاء أن يصدوا عن البيت، فلما رجع إلى أصحابه قال رأيت البدن قد قلدت وأشعرت، فما أرى أن يصدوا عن البيت‏.‏ فقام رجل منهم يقال له مكرز بن حفص‏.‏ فقال دعوني آته‏.‏ فقالوا ائته‏.‏ فلما أشرف عليهم قال النبي صلى الله عليه وسلم ‏\"‏ هذا مكرز وهو رجل فاجر ‏\"‏‏.‏ فجعل يكلم النبي صلى الله عليه وسلم، فبينما هو يكلمه إذ جاء سهيل بن عمرو‏.‏ قال معمر فأخبرني أيوب عن عكرمة، أنه لما جاء سهيل بن عمرو قال النبي صلى الله عليه وسلم ‏\"‏ لقد سهل لكم من أمركم ‏\"‏‏.‏ قال معمر قال الزهري في حديثه فجاء سهيل بن عمرو فقال هات، اكتب بيننا وبينكم كتابا، فدعا النبي صلى الله عليه وسلم الكاتب، فقال النبي صلى الله عليه وسلم ‏\"‏ بسم الله الرحمن الرحيم ‏\"‏‏.‏ قال سهيل أما الرحمن فوالله ما أدري ما هو ولكن اكتب باسمك اللهم‏.‏ كما كنت تكتب‏.‏ فقال المسلمون والله لا نكتبها إلا بسم الله الرحمن الرحيم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اكتب باسمك اللهم ‏\"‏‏.‏ ثم قال ‏\"‏ هذا ما قاضى عليه محمد رسول الله ‏\"‏‏.‏ فقال سهيل والله لو كنا نعلم أنك رسول الله ما صددناك عن البيت ولا قاتلناك، ولكن اكتب محمد بن عبد الله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ والله إني لرسول الله وإن كذبتموني‏.‏ اكتب محمد بن عبد الله ‏\"‏‏.‏ قال الزهري وذلك لقوله ‏\"‏ لا يسألوني خطة يعظمون فيها حرمات الله إلا أعطيتهم إياها ‏\"‏‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ على أن تخلوا بيننا وبين البيت فنطوف به ‏\"‏‏.‏ فقال سهيل والله لا تتحدث العرب أنا أخذنا ضغطة ولكن ذلك من العام المقبل فكتب‏.‏ فقال سهيل وعلى أنه لا يأتيك منا رجل، وإن كان على دينك، إلا رددته إلينا‏.‏ قال المسلمون سبحان الله كيف يرد إلى المشركين وقد جاء مسلما فبينما هم كذلك إذ دخل أبو جندل بن سهيل بن عمرو يرسف في قيوده، وقد خرج من أسفل مكة، حتى رمى بنفسه بين أظهر المسلمين‏.‏ فقال سهيل هذا يا محمد أول ما أقاضيك عليه أن ترده إلى‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنا لم نقض الكتاب بعد ‏\"‏‏.‏ قال فوالله إذا لم أصالحك على شىء أبدا‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ فأجزه لي ‏\"‏‏.‏ قال ما أنا بمجيزه لك‏.‏ قال ‏\"‏ بلى، فافعل ‏\"‏‏.‏ قال ما أنا بفاعل‏.‏ قال مكرز بل قد أجزناه لك‏.‏ قال أبو جندل أى معشر المسلمين، أرد إلى المشركين وقد جئت مسلما ألا ترون ما قد لقيت وكان قد عذب عذابا شديدا في الله‏.‏ قال فقال عمر بن الخطاب فأتيت نبي الله صلى الله عليه وسلم فقلت ألست نبي الله حقا قال ‏\"‏ بلى ‏\"‏‏.‏ قلت ألسنا على الحق وعدونا على الباطل قال ‏\"‏ بلى ‏\"‏‏.‏ قلت فلم نعطي الدنية في ديننا إذا قال ‏\"‏ إني رسول الله، ولست أعصيه وهو ناصري ‏\"‏‏.‏ قلت أوليس كنت تحدثنا أنا سنأتي البيت فنطوف به قال ‏\"‏ بلى، فأخبرتك أنا نأتيه العام ‏\"‏‏.‏ قال قلت لا‏.‏ قال ‏\"‏ فإنك آتيه ومطوف به ‏\"‏‏.‏ قال فأتيت أبا بكر فقلت يا أبا بكر، أليس هذا نبي الله حقا قال بلى‏.‏ قلت ألسنا على الحق وعدونا على الباطل قال بلى‏.‏ قلت فلم نعطي الدنية في ديننا إذا قال أيها الرجل، إنه لرسول الله صلى الله عليه وسلم وليس يعصي ربه وهو ناصره، فاستمسك بغرزه، فوالله إنه على الحق‏.‏ قلت أليس كان يحدثنا أنا سنأتي البيت ونطوف به قال بلى، أفأخبرك أنك تأتيه العام قلت لا‏.‏ قال فإنك آتيه ومطوف به‏.‏ قال الزهري قال عمر فعملت لذلك أعمالا‏.‏ قال فلما فرغ من قضية الكتاب قال رسول الله صلى الله عليه وسلم لأصحابه ‏\"‏ قوموا فانحروا، ثم احلقوا ‏\"‏‏.‏ قال فوالله ما قام منهم رجل حتى قال ذلك ثلاث مرات، فلما لم يقم منهم أحد دخل على أم سلمة، فذكر لها ما لقي من الناس‏.‏ فقالت أم سلمة يا نبي الله، أتحب ذلك اخرج ثم لا تكلم أحدا منهم كلمة حتى تنحر بدنك، وتدعو حالقك فيحلقك‏.‏ فخرج فلم يكلم أحدا منهم، حتى فعل ذلك نحر بدنه، ودعا حالقه فحلقه‏.‏ فلما رأوا ذلك، قاموا فنحروا، وجعل بعضهم يحلق بعضا، حتى كاد بعضهم يقتل بعضا غما، ثم جاءه نسوة مؤمنات فأنزل الله تعالى ‏{‏يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن‏}‏ حتى بلغ ‏{‏بعصم الكوافر‏}‏ فطلق عمر يومئذ امرأتين كانتا له في الشرك، فتزوج إحداهما معاوية بن أبي سفيان، والأخرى صفوان بن أمية، ثم رجع النبي صلى الله عليه وسلم إلى المدينة، فجاءه أبو بصير ـ رجل من قريش ـ وهو مسلم فأرسلوا في طلبه رجلين، فقالوا العهد الذي جعلت لنا‏.‏ فدفعه إلى الرجلين، فخرجا به حتى بلغا ذا الحليفة، فنزلوا يأكلون من تمر لهم، فقال أبو بصير لأحد الرجلين والله إني لأرى سيفك هذا يا فلان جيدا‏.‏ فاستله الآخر فقال أجل، والله إنه لجيد، لقد جربت به ثم جربت‏.‏ فقال أبو بصير أرني أنظر إليه، فأمكنه منه، فضربه حتى برد، وفر الآخر، حتى أتى المدينة، فدخل المسجد يعدو‏.‏ فقال رسول الله صلى الله عليه وسلم حين رآه ‏\"‏ لقد رأى هذا ذعرا ‏\"‏‏.‏ فلما انتهى إلى النبي صلى الله عليه وسلم قال قتل والله صاحبي وإني لمقتول، فجاء أبو بصير فقال يا نبي الله، قد والله أوفى الله ذمتك، قد رددتني إليهم ثم أنجاني الله منهم‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ويل أمه مسعر حرب، لو كان له أحد ‏\"‏‏.‏ فلما سمع ذلك عرف أنه سيرده إليهم، فخرج حتى أتى سيف البحر‏.‏ قال وينفلت منهم أبو جندل بن سهيل، فلحق بأبي بصير، فجعل لا يخرج من قريش رجل قد أسلم إلا لحق بأبي بصير، حتى اجتمعت منهم عصابة، فوالله ما يسمعون بعير خرجت لقريش إلى الشأم إلا اعترضوا لها، فقتلوهم، وأخذوا أموالهم، فأرسلت قريش إلى النبي صلى الله عليه وسلم تناشده بالله والرحم لما أرسل، فمن أتاه فهو آمن، فأرسل النبي صلى الله عليه وسلم إليهم، فأنزل الله تعالى ‏{‏وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم‏}‏ حتى بلغ ‏{‏الحمية حمية الجاهلية‏}‏ وكانت حميتهم أنهم لم يقروا أنه نبي الله، ولم يقروا ببسم الله الرحمن الرحيم، وحالوا بينهم وبين البيت‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2789,
			"arabicnumber": 2789,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2800,
			"arabicnumber": 2800,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2805,
			"arabicnumber": 2805,
			"text": "حدثنا محمد بن سعيد الخزاعي، حدثنا عبد الأعلى، عن حميد، قال سألت أنسا‏.‏ حدثنا عمرو بن زرارة، حدثنا زياد، قال حدثني حميد الطويل، عن أنس ـ رضى الله عنه ـ قال غاب عمي أنس بن النضر عن قتال بدر فقال يا رسول الله، غبت عن أول قتال قاتلت المشركين، لئن الله أشهدني قتال المشركين ليرين الله ما أصنع، فلما كان يوم أحد وانكشف المسلمون قال ‏\"‏ اللهم إني أعتذر إليك مما صنع هؤلاء ـ يعني أصحابه ـ وأبرأ إليك مما صنع هؤلاء ‏\"‏ ـ يعني المشركين ـ ثم تقدم، فاستقبله سعد بن معاذ، فقال يا سعد بن معاذ، الجنة، ورب النضر إني أجد ريحها من دون أحد‏.‏ قال سعد فما استطعت يا رسول الله ما صنع‏.‏ قال أنس فوجدنا به بضعا وثمانين ضربة بالسيف أو طعنة برمح أو رمية بسهم، ووجدناه قد قتل وقد مثل به المشركون، فما عرفه أحد إلا أخته ببنانه‏.‏ قال أنس كنا نرى أو نظن أن هذه الآية نزلت فيه وفي أشباهه ‏{‏من المؤمنين رجال صدقوا ما عاهدوا الله عليه‏}‏ إلى آخر الآية‏.‏ وقال إن أخته وهى تسمى الربيع كسرت ثنية امرأة فأمر رسول الله صلى الله عليه وسلم بالقصاص، فقال أنس يا رسول الله، والذي بعثك بالحق لا تكسر ثنيتها‏.‏ فرضوا بالأرش وتركوا القصاص، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من عباد الله من لو أقسم على الله لأبره ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2878,
			"arabicnumber": 2878,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2895,
			"arabicnumber": 2895,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2906,
			"arabicnumber": 2906,
			"text": "حدثنا إسماعيل، قال حدثني ابن وهب، قال عمرو حدثني أبو الأسود، عن عروة، عن عائشة ـ رضى الله عنها ـ دخل على رسول الله صلى الله عليه وسلم وعندي جاريتان تغنيان بغناء بعاث، فاضطجع على الفراش وحول وجهه، فدخل أبو بكر فانتهرني وقال مزمارة الشيطان عند رسول الله صلى الله عليه وسلم‏.‏ فأقبل عليه رسول الله صلى الله عليه وسلم فقال ‏\"‏ دعهما ‏\"‏‏.‏ فلما غفل غمزتهما فخرجتا‏.‏ قالت وكان يوم عيد يلعب السودان بالدرق والحراب، فإما سألت رسول الله صلى الله عليه وسلم وإما قال ‏\"‏ تشتهين تنظرين ‏\"‏‏.‏ فقالت نعم‏.‏ فأقامني وراءه خدي على خده ويقول ‏\"‏ دونكم بني أرفدة ‏\"‏‏.‏ حتى إذا مللت قال ‏\"‏ حسبك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاذهبي ‏\"‏‏.‏ قال أحمد عن ابن وهب، فلما غفل‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2940,
			"arabicnumber": 2940,
			"text": "حدثنا إبراهيم بن حمزة، حدثنا إبراهيم بن سعد، عن صالح بن كيسان، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن عبد الله بن عباس ـ رضى الله عنهما ـ أنه أخبره أن رسول الله صلى الله عليه وسلم كتب إلى قيصر يدعوه إلى الإسلام، وبعث بكتابه إليه مع دحية الكلبي، وأمره رسول الله صلى الله عليه وسلم أن يدفعه إلى عظيم بصرى ليدفعه إلى قيصر، وكان قيصر لما كشف الله عنه جنود فارس مشى من حمص إلى إيلياء، شكرا لما أبلاه الله، فلما جاء قيصر كتاب رسول الله صلى الله عليه وسلم قال حين قرأه التمسوا لي ها هنا أحدا من قومه لأسألهم عن رسول الله صلى الله عليه وسلم‏.‏ قال ابن عباس فأخبرني أبو سفيان، أنه كان بالشأم في رجال من قريش، قدموا تجارا في المدة التي كانت بين رسول الله صلى الله عليه وسلم وبين كفار قريش، قال أبو سفيان فوجدنا رسول قيصر ببعض الشأم فانطلق بي وبأصحابي حتى قدمنا إيلياء، فأدخلنا عليه، فإذا هو جالس في مجلس ملكه وعليه التاج، وإذا حوله عظماء الروم فقال لترجمانه سلهم أيهم أقرب نسبا إلى هذا الرجل الذي يزعم أنه نبي قال أبو سفيان فقلت أنا أقربهم نسبا‏.‏ قال ما قرابة ما بينك وبينه فقلت هو ابن عمي، وليس في الركب يومئذ أحد من بني عبد مناف غيري‏.‏ فقال قيصر أدنوه‏.‏ وأمر بأصحابي فجعلوا خلف ظهري عند كتفي، ثم قال لترجمانه قل لأصحابه إني سائل هذا الرجل عن الذي يزعم أنه نبي، فإن كذب فكذبوه‏.‏ قال أبو سفيان والله لولا الحياء يومئذ من أن يأثر أصحابي عني الكذب لكذبته حين سألني عنه، ولكني استحييت أن يأثروا الكذب عني فصدقته، ثم قال لترجمانه قل له كيف نسب هذا الرجل فيكم قلت هو فينا ذو نسب‏.‏ قال فهل قال هذا القول أحد منكم قبله قلت لا‏.‏ فقال كنتم تتهمونه على الكذب قبل أن يقول ما قال قلت لا‏.‏ قال فهل كان من آبائه من ملك قلت لا‏.‏ قال فأشراف الناس يتبعونه أم ضعفاؤهم قلت بل ضعفاؤهم‏.‏ قال فيزيدون أو ينقصون قلت بل يزيدون‏.‏ قال فهل يرتد أحد سخطة لدينه بعد أن يدخل فيه قلت لا‏.‏ قال فهل يغدر قلت لا، ونحن الآن منه في مدة، نحن نخاف أن يغدر‏.‏ قال أبو سفيان ولم يمكني كلمة أدخل فيها شيئا أنتقصه به لا أخاف أن تؤثر عني غيرها‏.‏ قال فهل قاتلتموه أو قاتلكم قلت نعم‏.‏ قال فكيف كانت حربه وحربكم قلت كانت دولا وسجالا، يدال علينا المرة وندال عليه الأخرى‏.‏ قال فماذا يأمركم قال يأمرنا أن نعبد الله وحده لا نشرك به شيئا، وينهانا عما كان يعبد آباؤنا، ويأمرنا بالصلاة والصدقة والعفاف والوفاء بالعهد وأداء الأمانة‏.‏ فقال لترجمانه حين قلت ذلك له قل له إني سألتك عن نسبه فيكم، فزعمت أنه ذو نسب، وكذلك الرسل تبعث في نسب قومها، وسألتك هل قال أحد منكم هذا القول قبله فزعمت أن لا، فقلت لو كان أحد منكم قال هذا القول قبله قلت رجل يأتم بقول قد قيل قبله‏.‏ وسألتك هل كنتم تتهمونه بالكذب قبل أن يقول ما قال فزعمت أن لا، فعرفت أنه لم يكن ليدع الكذب على الناس ويكذب على الله، وسألتك هل كان من آبائه من ملك فزعمت أن لا، فقلت لو كان من آبائه ملك قلت يطلب ملك آبائه‏.‏ وسألتك أشراف الناس يتبعونه أم ضعفاؤهم فزعمت أن ضعفاءهم اتبعوه، وهم أتباع الرسل، وسألتك هل يزيدون أو ينقصون فزعمت أنهم يزيدون، وكذلك الإيمان حتى يتم، وسألتك هل يرتد أحد سخطة لدينه بعد أن يدخل فيه فزعمت أن لا، فكذلك الإيمان حين تخلط بشاشته القلوب لا يسخطه أحد، وسألتك هل يغدر فزعمت أن لا، وكذلك الرسل لا يغدرون‏.‏ وسألتك هل قاتلتموه وقاتلكم فزعمت أن قد فعل، وأن حربكم وحربه تكون دولا، ويدال عليكم المرة وتدالون عليه الأخرى، وكذلك الرسل تبتلى، وتكون لها العاقبة، وسألتك بماذا يأمركم فزعمت أنه يأمركم أن تعبدوا الله ولا تشركوا به شيئا، وينهاكم عما كان يعبد آباؤكم، ويأمركم بالصلاة والصدق والعفاف والوفاء بالعهد، وأداء الأمانة، قال وهذه صفة النبي، قد كنت أعلم أنه خارج، ولكن لم أظن أنه منكم، وإن يك ما قلت حقا، فيوشك أن يملك موضع قدمى هاتين، ولو أرجو أن أخلص إليه لتجشمت لقيه، ولو كنت عنده لغسلت قدميه‏.‏ قال أبو سفيان ثم دعا بكتاب رسول الله صلى الله عليه وسلم فقرئ فإذا فيه ‏\"‏ بسم الله الرحمن الرحيم من محمد عبد الله ورسوله، إلى هرقل عظيم الروم، سلام على من اتبع الهدى، أما بعد فإني أدعوك بدعاية الإسلام، أسلم تسلم، وأسلم يؤتك الله أجرك مرتين، فإن توليت فعليك إثم الأريسيين و‏{‏يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم أن لا نعبد إلا الله ولا نشرك به شيئا ولا يتخذ بعضنا بعضا أربابا من دون الله فإن تولوا فقولوا اشهدوا بأنا مسلمون‏}‏‏\"‏‏.‏ قال أبو سفيان فلما أن قضى مقالته، علت أصوات الذين حوله من عظماء الروم، وكثر لغطهم، فلا أدري ماذا قالوا، وأمر بنا فأخرجنا، فلما أن خرجت مع أصحابي وخلوت بهم قلت لهم لقد أمر أمر ابن أبي كبشة، هذا ملك بني الأصفر يخافه، قال أبو سفيان والله ما زلت ذليلا مستيقنا بأن أمره سيظهر، حتى أدخل الله قلبي الإسلام وأنا كاره‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2956,
			"arabicnumber": 2956,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، أن الأعرج، حدثه أنه، سمع أبا هريرة ـ رضى الله عنه ـ أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ نحن الآخرون السابقون ‏\"‏‏.‏ وبهذا الإسناد ‏\"‏ من أطاعني فقد أطاع الله، ومن عصاني فقد عصى الله، ومن يطع الأمير فقد أطاعني، ومن يعص الأمير فقد عصاني، وإنما الإمام جنة يقاتل من ورائه ويتقى به، فإن أمر بتقوى الله وعدل، فإن له بذلك أجرا، وإن قال بغيره، فإن عليه منه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2962,
			"arabicnumber": 2962,
			"text": "حدثنا إسحاق بن إبراهيم، سمع محمد بن فضيل، عن عاصم، عن أبي عثمان، عن مجاشع ـ رضى الله عنه ـ قال أتيت النبي صلى الله عليه وسلم أنا وأخي فقلت بايعنا على الهجرة‏.‏ فقال ‏\"‏ مضت الهجرة لأهلها ‏\"‏‏.‏ فقلت علام تبايعنا قال ‏\"‏ على الإسلام والجهاد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2965,
			"arabicnumber": 2965,
			"text": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله وكان كاتبا له قال كتب إليه عبد الله بن أبي أوفى ـ رضى الله عنهما ـ فقرأته أن رسول الله صلى الله عليه وسلم في بعض أيامه التي لقي فيها انتظر حتى مالت الشمس‏.‏ ثم قام في الناس قال ‏ \"‏ أيها الناس، لا تتمنوا لقاء العدو، وسلوا الله العافية، فإذا لقيتموهم فاصبروا، واعلموا أن الجنة تحت ظلال السيوف، ثم قال اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب، اهزمهم وانصرنا عليهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3024,
			"arabicnumber": 3024,
			"text": "حدثنا يوسف بن موسى، حدثنا عاصم بن يوسف اليربوعي، حدثنا أبو إسحاق الفزاري، عن موسى بن عقبة، قال حدثني سالم أبو النضر، مولى عمر بن عبيد الله كنت كاتبا له قال كتب إليه عبد الله بن أبي أوفى حين خرج إلى الحرورية فقرأته فإذا فيه إن رسول الله صلى الله عليه وسلم في بعض أيامه التي لقي فيها العدو انتظر حتى مالت الشمس‏.‏ ثم قام في الناس فقال ‏\"‏ أيها الناس لا تمنوا لقاء العدو وسلوا الله العافية، فإذا لقيتموهم فاصبروا واعلموا أن الجنة تحت ظلال السيوف ـ ثم قال ـ اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب اهزمهم وانصرنا عليهم ‏\"‏‏.‏ وقال موسى بن عقبة حدثني سالم أبو النضر كنت كاتبا لعمر بن عبيد الله فأتاه كتاب عبد الله بن أبي أوفى ـ رضى الله عنهما أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تمنوا لقاء العدو ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3027,
			"arabicnumber": 3027,
			"text": "حدثنا عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ هلك كسرى ثم لا يكون كسرى بعده، وقيصر ليهلكن ثم لا يكون قيصر بعده، ولتقسمن كنوزها في سبيل الله ‏\"‏‏.‏ وسمى الحرب خدعة",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3035,
			"arabicnumber": 3035,
			"text": "حدثني محمد بن عبد الله بن نمير، حدثنا ابن إدريس، عن إسماعيل، عن قيس، عن جرير ـ رضى الله عنه ـ قال ما حجبني النبي صلى الله عليه وسلم منذ أسلمت، ولا رآني إلا تبسم في وجهي‏.‏ ولقد شكوت إليه إني لا أثبت على الخيل‏.‏ فضرب بيده في صدري وقال ‏ \"‏ اللهم ثبته واجعله هاديا مهديا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3056,
			"arabicnumber": 3056,
			"text": "قال ابن عمر انطلق النبي صلى الله عليه وسلم وأبى بن كعب يأتيان النخل الذي فيه ابن صياد، حتى إذا دخل النخل طفق النبي صلى الله عليه وسلم يتقي بجذوع النخل وهو يختل ابن صياد أن يسمع من ابن صياد شيئا قبل أن يراه، وابن صياد مضطجع على فراشه في قطيفة له فيها رمزة، فرأت أم ابن صياد النبي صلى الله عليه وسلم وهو يتقي بجذوع النخل، فقالت لابن صياد أى صاف ـ وهو اسمه ـ فثار ابن صياد، فقال النبي صلى الله عليه وسلم ‏\"‏ لو تركته بين ‏\"‏‏.‏ وقال سالم قال ابن عمر ثم قام النبي صلى الله عليه وسلم في الناس فأثنى على الله بما هو أهله، ثم ذكر الدجال فقال ‏\"‏ إني أنذركموه، وما من نبي إلا قد أنذره قومه، لقد أنذره نوح قومه، ولكن سأقول لكم فيه قولا لم يقله نبي لقومه، تعلمون أنه أعور وأن الله ليس بأعور ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3078,
			"arabicnumber": 3078,
			"text": "حدثنا إبراهيم بن موسى، أخبرنا يزيد بن زريع، عن خالد، عن أبي عثمان النهدي، عن مجاشع بن مسعود، قال جاء مجاشع بأخيه مجالد بن مسعود إلى النبي صلى الله عليه وسلم فقال هذا مجالد يبايعك على الهجرة‏.‏ فقال ‏ \"‏ لا هجرة بعد فتح مكة، ولكن أبايعه على الإسلام ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3092,
			"arabicnumber": 3092,
			"text": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة أم المؤمنين ـ رضى الله عنها ـ أخبرته أن فاطمة ـ عليها السلام ـ ابنة رسول الله صلى الله عليه وسلم سألت أبا بكر الصديق بعد وفاة رسول الله صلى الله عليه وسلم أن يقسم لها ميراثها، ما ترك رسول الله صلى الله عليه وسلم مما أفاء الله عليه‏.‏ فقال لها أبو بكر إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ فغضبت فاطمة بنت رسول الله صلى الله عليه وسلم فهجرت أبا بكر، فلم تزل مهاجرته حتى توفيت وعاشت بعد رسول الله صلى الله عليه وسلم ستة أشهر‏.‏ قالت وكانت فاطمة تسأل أبا بكر نصيبها مما ترك رسول الله صلى الله عليه وسلم من خيبر وفدك وصدقته بالمدينة، فأبى أبو بكر عليها ذلك، وقال لست تاركا شيئا كان رسول الله صلى الله عليه وسلم يعمل به إلا عملت به، فإني أخشى إن تركت شيئا من أمره أن أزيغ‏.‏ فأما صدقته بالمدينة فدفعها عمر إلى علي وعباس، فأما خيبر وفدك فأمسكها عمر وقال هما صدقة رسول الله صلى الله عليه وسلم كانتا لحقوقه التي تعروه ونوائبه، وأمرهما إلى من ولي الأمر‏.‏ قال فهما على ذلك إلى اليوم‏.‏ قال أبو عبد الله اعتراك افتعلت من عروته فأصبته ومنه يعروه واعتراني",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3131,
			"arabicnumber": 3131,
			"text": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال وزعم عروة أن مروان بن الحكم، ومسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قال حين جاءه وفد هوازن مسلمين، فسألوه أن يرد إليهم أموالهم وسبيهم فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ أحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما السبى وإما المال، وقد كنت استأنيت بهم ‏\"‏‏.‏ وقد كان رسول الله صلى الله عليه وسلم انتظر آخرهم بضع عشرة ليلة، حين قفل من الطائف، فلما تبين لهم أن رسول الله صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين‏.‏ قالوا فإنا نختار سبينا، فقام رسول الله صلى الله عليه وسلم في المسلمين فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد، فإن إخوانكم هؤلاء قد جاءونا تائبين، وإني قد رأيت أن أرد إليهم سبيهم، من أحب أن يطيب فليفعل، ومن أحب منكم أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا فليفعل ‏\"‏‏.‏ فقال الناس قد طيبنا ذلك يا رسول الله لهم‏.‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم في ذلك ممن لم يأذن، فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏ فرجع الناس، فكلمهم عرفاؤهم، ثم رجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أنهم قد طيبوا فأذنوا‏.‏ فهذا الذي بلغنا عن سبى هوازن‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3156,
			"arabicnumber": 3156,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال سمعت عمرا، قال كنت جالسا مع جابر بن زيد وعمرو بن أوس، فحدثهما بجالة، سنة سبعين ـ عام حج مصعب بن الزبير بأهل البصرة ـ عند درج زمزم قال كنت كاتبا لجزء بن معاوية عم الأحنف، فأتانا كتاب عمر بن الخطاب قبل موته بسنة فرقوا بين كل ذي محرم من المجوس‏.‏ ولم يكن عمر أخذ الجزية من المجوس‏.‏ حتى شهد عبد الرحمن بن عوف أن رسول الله صلى الله عليه وسلم أخذها من مجوس هجر‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3159,
			"arabicnumber": 3159,
			"text": "حدثنا الفضل بن يعقوب، حدثنا عبد الله بن جعفر الرقي، حدثنا المعتمر بن سليمان، حدثنا سعيد بن عبيد الله الثقفي، حدثنا بكر بن عبد الله المزني، وزياد بن جبير، عن جبير بن حية، قال بعث عمر الناس في أفناء الأمصار يقاتلون المشركين، فأسلم الهرمزان فقال إني مستشيرك في مغازي هذه‏.‏ قال نعم، مثلها ومثل من فيها من الناس من عدو المسلمين مثل طائر له رأس وله جناحان وله رجلان، فإن كسر أحد الجناحين نهضت الرجلان بجناح والرأس، فإن كسر الجناح الآخر نهضت الرجلان والرأس، وإن شدخ الرأس ذهبت الرجلان والجناحان والرأس، فالرأس كسرى، والجناح قيصر، والجناح الآخر فارس، فمر المسلمين فلينفروا إلى كسرى‏.‏ وقال بكر وزياد جميعا عن جبير بن حية قال فندبنا عمر واستعمل علينا النعمان بن مقرن، حتى إذا كنا بأرض العدو، وخرج علينا عامل كسرى في أربعين ألفا، فقام ترجمان فقال ليكلمني رجل منكم‏.‏ فقال المغيرة سل عما شئت‏.‏ قال ما أنتم قال نحن أناس من العرب كنا في شقاء شديد وبلاء شديد، نمص الجلد والنوى من الجوع، ونلبس الوبر والشعر، ونعبد الشجر والحجر، فبينا نحن كذلك، إذ بعث رب السموات ورب الأرضين تعالى ذكره وجلت عظمته إلينا نبيا من أنفسنا، نعرف أباه وأمه، فأمرنا نبينا رسول ربنا صلى الله عليه وسلم أن نقاتلكم حتى تعبدوا الله وحده أو تؤدوا الجزية، وأخبرنا نبينا صلى الله عليه وسلم عن رسالة ربنا أنه من قتل منا صار إلى الجنة في نعيم لم ير مثلها قط، ومن بقي منا ملك رقابكم‏.‏ فقال النعمان ربما أشهدك الله مثلها مع النبي صلى الله عليه وسلم فلم يندمك ولم يخزك، ولكني شهدت القتال مع رسول الله صلى الله عليه وسلم كان إذا لم يقاتل في أول النهار انتظر حتى تهب الأرواح وتحضر الصلوات‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3164,
			"arabicnumber": 3164,
			"text": "حدثنا علي بن عبد الله، حدثنا إسماعيل بن إبراهيم، قال أخبرني روح بن القاسم، عن محمد بن المنكدر، عن جابر بن عبد الله ـ رضى الله عنهما ـ قال كان رسول الله صلى الله عليه وسلم قال لي ‏\"‏ لو قد جاءنا مال البحرين قد أعطيتك هكذا وهكذا وهكذا ‏\"‏‏.‏ فلما قبض رسول الله صلى الله عليه وسلم وجاء مال البحرين قال أبو بكر من كانت له عند رسول الله صلى الله عليه وسلم عدة فليأتني‏.‏ فأتيته فقلت إن رسول الله صلى الله عليه وسلم قد كان قال لي ‏\"‏ لو قد جاءنا مال البحرين لأعطيتك هكذا وهكذا وهكذا ‏\"‏‏.‏ فقال لي احثه‏.‏ فحثوت حثية فقال لي عدها‏.‏ فعددتها فإذا هي خمسمائة، فأعطاني ألفا وخمسمائة‏.‏ وقال إبراهيم بن طهمان عن عبد العزيز بن صهيب، عن أنس، أتي النبي صلى الله عليه وسلم بمال من البحرين فقال ‏\"‏ انثروه في المسجد ‏\"‏ فكان أكثر مال أتي به رسول الله صلى الله عليه وسلم إذ جاءه العباس فقال يا رسول الله، أعطني إني فاديت نفسي وفاديت عقيلا‏.‏ قال ‏\"‏ خذ ‏\"‏‏.‏ فحثا في ثوبه، ثم ذهب يقله، فلم يستطع‏.‏ فقال أمر بعضهم يرفعه إلى‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ قال فارفعه أنت على‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فنثر منه، ثم ذهب يقله فلم يرفعه‏.‏ فقال أمر بعضهم يرفعه على‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ قال فارفعه أنت على‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فنثر ثم احتمله على كاهله ثم انطلق، فما زال يتبعه بصره حتى خفي علينا عجبا من حرصه، فما قام رسول الله صلى الله عليه وسلم وثم منها درهم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3187,
			"arabicnumber": 3187,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3252,
			"arabicnumber": 3252,
			"text": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ إن في الجنة لشجرة يسير الراكب في ظلها مائة سنة، واقرءوا إن شئتم ‏{‏وظل ممدود‏}‏‏\"‏ «ولقاب قوس أحدكم في الجنة خير مما طلعت عليه الشمس أو تغرب»",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3272,
			"arabicnumber": 3272,
			"text": "حدثنا محمد، أخبرنا عبدة، عن هشام بن عروة، عن أبيه، عن ابن عمر ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا طلع حاجب الشمس فدعوا الصلاة حتى تبرز، وإذا غاب حاجب الشمس فدعوا الصلاة حتى تغيب ‏\"‏‏.‏ ‏\"‏ ولا تحينوا بصلاتكم طلوع الشمس ولا غروبها، فإنها تطلع بين قرنى شيطان ‏\"‏‏.‏ أو الشيطان‏.‏ لا أدري أى ذلك قال هشام‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3297,
			"arabicnumber": 3297,
			"text": "حدثنا عبد الله بن محمد، حدثنا هشام بن يوسف، حدثنا معمر، عن الزهري، عن سالم، عن ابن عمر ـ رضى الله عنهما ـ أنه سمع النبي صلى الله عليه وسلم يخطب على المنبر يقول ‏ \"‏ اقتلوا الحيات، واقتلوا ذا الطفيتين والأبتر، فإنهما يطمسان البصر، ويستسقطان الحبل ‏\"‏‏.‏ قال عبد الله فبينا أنا أطارد، حية لأقتلها فناداني أبو لبابة لا تقتلها‏.‏ فقلت إن رسول الله صلى الله عليه وسلم قد أمر بقتل الحيات‏.‏ قال إنه نهى بعد ذلك عن ذوات البيوت، وهى العوامر‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3310,
			"arabicnumber": 3310,
			"text": "حدثني عمرو بن علي، حدثنا ابن أبي عدي، عن أبي يونس القشيري، عن ابن أبي مليكة، أن ابن عمر، كان يقتل الحيات ثم نهى قال إن النبي صلى الله عليه وسلم هدم حائطا له، فوجد فيه سلخ حية فقال ‏\"‏ انظروا أين هو ‏\"‏‏.‏ فنظروا فقال ‏\"‏ اقتلوه ‏\"‏‏.‏ فكنت أقتلها لذلك‏.‏ فلقيت أبا لبابة فأخبرني أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقتلوا الجنان، إلا كل أبتر ذي طفيتين، فإنه يسقط الولد، ويذهب البصر، فاقتلوه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3312,
			"arabicnumber": 3312,
			"text": "حدثنا مالك بن إسماعيل، حدثنا جرير بن حازم، عن نافع، عن ابن عمر، أنه كان يقتل الحيات‏.‏ فحدثه أبو لبابة، أن النبي صلى الله عليه وسلم نهى عن قتل جنان البيوت، فأمسك عنها‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3362,
			"arabicnumber": 3362,
			"text": "حدثني أحمد بن سعيد أبو عبد الله، حدثنا وهب بن جرير، عن أبيه، عن أيوب، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ يرحم الله أم إسماعيل، لولا أنها عجلت لكان زمزم عينا معينا ‏\"‏‏.‏ قال الأنصاري حدثنا ابن جريج، أما كثير بن كثير فحدثني قال إني وعثمان بن أبي سليمان جلوس مع سعيد بن جبير، فقال ما هكذا حدثني ابن عباس، قال أقبل إبراهيم بإسماعيل وأمه عليهم السلام وهى ترضعه، معها شنة ـ لم يرفعه ـ ثم جاء بها إبراهيم وبابنها إسماعيل‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3395,
			"arabicnumber": 3395,
			"text": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قتادة، قال سمعت أبا العالية، حدثنا ابن عم، نبيكم ـ يعني ابن عباس ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ لا ينبغي لعبد أن يقول أنا خير من يونس بن متى ‏\"‏‏.‏ ونسبه إلى أبيه‏.‏ وذكر النبي صلى الله عليه وسلم ليلة أسري به فقال ‏\"‏ موسى آدم طوال كأنه من رجال شنوءة ‏\"‏‏.‏ وقال ‏\"‏ عيسى جعد مربوع ‏\"‏‏.‏ وذكر مالكا خازن النار، وذكر الدجال‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3414,
			"arabicnumber": 3414,
			"text": "حدثنا يحيى بن بكير، عن الليث، عن عبد العزيز بن أبي سلمة، عن عبد الله بن الفضل، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ قال بينما يهودي يعرض سلعته أعطي بها شيئا كرهه‏.‏ فقال لا والذي اصطفى موسى على البشر، فسمعه رجل من الأنصار فقام، فلطم وجهه، وقال تقول والذي اصطفى موسى على البشر، والنبي صلى الله عليه وسلم بين أظهرنا فذهب إليه، فقال أبا القاسم، إن لي ذمة وعهدا، فما بال فلان لطم وجهي‏.‏ فقال ‏\"‏ لم لطمت وجهه ‏\"‏‏.‏ فذكره، فغضب النبي صلى الله عليه وسلم حتى رئي في وجهه، ثم قال ‏\"‏ لا تفضلوا بين أنبياء الله، فإنه ينفخ في الصور، فيصعق من في السموات ومن في الأرض، إلا من شاء الله، ثم ينفخ فيه أخرى، فأكون أول من بعث فإذا موسى آخذ بالعرش، فلا أدري أحوسب بصعقته يوم الطور أم بعث قبلي -‏ ولا أقول إن أحدا أفضل من يونس بن متى\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3426,
			"arabicnumber": 3426,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، حدثه أنه، سمع أبا هريرة ـ رضى الله عنه ـ أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ مثلي ومثل الناس كمثل رجل استوقد نارا، فجعل الفراش وهذه الدواب تقع في النار ‏\"‏‏.‏ وقال ‏\"‏ كانت امرأتان معهما ابناهما جاء الذئب فذهب بابن إحداهما، فقالت صاحبتها إنما ذهب بابنك‏.‏ وقالت الأخرى إنما ذهب بابنك‏.‏ فتحاكمتا إلى داود، فقضى به للكبرى فخرجتا على سليمان بن داود فأخبرتاه‏.‏ فقال ائتوني بالسكين أشقه بينهما‏.‏ فقالت الصغرى لا تفعل يرحمك الله، هو ابنها‏.‏ فقضى به للصغرى ‏\"‏‏.‏ قال أبو هريرة والله إن سمعت بالسكين إلا يومئذ، وما كنا نقول إلا المدية‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3439,
			"arabicnumber": 3439,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى، عن نافع، قال عبد الله ذكر النبي صلى الله عليه وسلم يوما بين ظهرى الناس المسيح الدجال، فقال ‏\"‏ إن الله ليس بأعور، ألا إن المسيح الدجال أعور العين اليمنى، كأن عينه عنبة طافية ‏\"‏‏.‏ ‏\"‏ وأراني الليلة عند الكعبة في المنام، فإذا رجل آدم كأحسن ما يرى من أدم الرجال، تضرب لمته بين منكبيه، رجل الشعر، يقطر رأسه ماء، واضعا يديه على منكبى رجلين وهو يطوف بالبيت‏.‏ فقلت من هذا فقالوا هذا المسيح ابن مريم‏.‏ ثم رأيت رجلا وراءه جعدا قططا أعور عين اليمنى كأشبه من رأيت بابن قطن، واضعا يديه على منكبى رجل، يطوف بالبيت، فقلت من هذا قالوا المسيح الدجال ‏\"‏‏.‏ تابعه عبيد الله عن نافع‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3450,
			"arabicnumber": 3450,
			"text": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عبد الملك، عن ربعي بن حراش، قال قال عقبة بن عمرو لحذيفة ألا تحدثنا ما سمعت من رسول الله صلى الله عليه وسلم قال إني سمعته يقول ‏\"‏ إن مع الدجال إذا خرج ماء ونارا، فأما الذي يرى الناس أنها النار فماء بارد، وأما الذي يرى الناس أنه ماء بارد فنار تحرق، فمن أدرك منكم فليقع في الذي يرى أنها نار، فإنه عذب بارد ‏\"‏‏.‏ قال حذيفة وسمعته يقول ‏\"‏ إن رجلا كان فيمن كان قبلكم أتاه الملك ليقبض روحه فقيل له هل عملت من خير قال ما أعلم، قيل له انظر‏.‏ قال ما أعلم شيئا غير أني كنت أبايع الناس في الدنيا وأجازيهم، فأنظر الموسر، وأتجاوز عن المعسر‏.‏ فأدخله الله الجنة ‏\"‏‏.‏ فقال وسمعته يقول ‏\"‏ إن رجلا حضره الموت، فلما يئس من الحياة أوصى أهله إذا أنا مت فاجمعوا لي حطبا كثيرا وأوقدوا فيه نارا حتى إذا أكلت لحمي، وخلصت إلى عظمي، فامتحشت، فخذوها فاطحنوها، ثم انظروا يوما راحا فاذروه في اليم‏.‏ ففعلوا، فجمعه فقال له لم فعلت ذلك قال من خشيتك‏.‏ فغفر الله له ‏\"‏‏.‏ قال عقبة بن عمرو، وأنا سمعته يقول ذاك، وكان نباشا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3451,
			"arabicnumber": 3451,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3453,
			"arabicnumber": 3453,
			"text": "حدثني بشر بن محمد، أخبرنا عبد الله، أخبرني معمر، ويونس، عن الزهري، قال أخبرني عبيد الله بن عبد الله، أن عائشة، وابن، عباس رضى الله عنهم قالا لما نزل برسول الله صلى الله عليه وسلم طفق يطرح خميصة على وجهه، فإذا اغتم كشفها عن وجهه، فقال وهو كذلك ‏ \"‏ لعنة الله على اليهود والنصارى، اتخذوا قبور أنبيائهم مساجد ‏\"‏‏.‏ يحذر ما صنعوا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3486,
			"arabicnumber": 3486,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، قال حدثني ابن طاوس، عن أبيه، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ نحن الآخرون السابقون يوم القيامة، بيد كل أمة أوتوا الكتاب من قبلنا وأوتينا من بعدهم، فهذا اليوم الذي اختلفوا، فغدا لليهود وبعد غد للنصارى ‏\"‏‏.‏ ‏\"‏على كل مسلم فى كل سبعة أيام يوم يغسل رأسه وجسده‏\"‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3493,
			"arabicnumber": 3493,
			"text": "حدثني إسحاق بن إبراهيم، أخبرنا جرير، عن عمارة، عن أبي زرعة، عن أبي هريرة ـ رضى الله عنه ـ عن رسول الله صلى الله عليه وسلم قال ‏\"‏ تجدون الناس معادن، خيارهم في الجاهلية خيارهم في الإسلام إذا فقهوا، وتجدون خير الناس في هذا الشأن أشدهم له كراهية ‏\"‏‏.‏ ‏\"‏ وتجدون شر الناس ذا الوجهين، الذي يأتي هؤلاء بوجه، ويأتي هؤلاء بوجه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3495,
			"arabicnumber": 3495,
			"text": "حدثنا قتيبة بن سعيد، حدثنا المغيرة، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم قال ‏\"‏ الناس تبع لقريش في هذا الشأن، مسلمهم تبع لمسلمهم، وكافرهم تبع لكافرهم ‏\"‏‏.‏ \"والناس معادن، خيارهم في الجاهلية خيارهم في الإسلام إذا فقهوا، تجدون من خير الناس أشد الناس كراهية لهذا الشأن حتى يقع فيه",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3529,
			"arabicnumber": 3529,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة، أن أبا بكر ـ رضى الله عنه ـ دخل عليها وعندها جاريتان في أيام منى تدففان وتضربان، والنبي صلى الله عليه وسلم متغش بثوبه، فانتهرهما أبو بكر، فكشف النبي صلى الله عليه وسلم عن وجهه، فقال ‏\"‏ دعهما يا أبا بكر، فإنها أيام عيد، وتلك الأيام أيام منى ‏\"‏‏.‏ وقالت عائشة رأيت النبي صلى الله عليه وسلم يسترني، وأنا أنظر إلى الحبشة، وهم يلعبون في المسجد فزجرهم ‏{‏عمر‏}‏ فقال النبي صلى الله عليه وسلم ‏\"‏ دعهم أمنا بني أرفدة ‏\"‏‏.‏ يعني من الأمن‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3562.2,
			"arabicnumber": 3562.2,
			"text": "حدثني محمد بن بشار، حدثنا يحيى، وابن، مهدي قالا حدثنا شعبة، مثله وإذا كره شيئا عرف في وجهه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3567,
			"arabicnumber": 3567,
			"text": "حدثني الحسن بن صباح البزار، حدثنا سفيان، عن الزهري، عن عروة، عن عائشة ـ رضى الله عنها أن النبي صلى الله عليه وسلم كان يحدث حديثا لو عده العاد لأحصاه‏.‏ وقال الليث حدثني يونس، عن ابن شهاب، أنه قال أخبرني عروة بن الزبير، عن عائشة، أنها قالت ألا يعجبك أبو فلان جاء فجلس إلى جانب حجرتي يحدث عن رسول الله صلى الله عليه وسلم، يسمعني ذلك وكنت أسبح فقام قبل أن أقضي سبحتي، ولو أدركته لرددت عليه، إن رسول الله صلى الله عليه وسلم لم يكن يسرد الحديث كسردكم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3587,
			"arabicnumber": 3587,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى تقاتلوا قوما نعالهم الشعر، وحتى تقاتلوا الترك، صغار الأعين، حمر الوجوه، ذلف الأنوف كأن وجوههم المجان المطرقة ‏\"‏‏.‏ \"«وتجدون من خير الناس أشدهم كراهية لهذا الأمر، حتى يقع فيه، والناس معادن، خيارهم في الجاهلية خيارهم في الإسلام.\" \"وليأتين على أحدكم زمان لأن يراني أحب إليه من أن يكون له مثل أهله وماله",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3588,
			"arabicnumber": 3588,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3595.2,
			"arabicnumber": 3595.2,
			"text": "حدثني عبد الله، حدثنا أبو عاصم، أخبرنا سعدان بن بشر، حدثنا أبو مجاهد، حدثنا محل بن خليفة، سمعت عديا، كنت عند النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3601,
			"arabicnumber": 3601,
			"text": "حدثنا عبد العزيز الأويسي، حدثنا إبراهيم، عن صالح بن كيسان، عن ابن شهاب، عن ابن المسيب، وأبي، سلمة بن عبد الرحمن أن أبا هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ستكون فتن، القاعد فيها خير من القائم، والقائم فيها خير من الماشي، والماشي فيها خير من الساعي، ومن يشرف لها تستشرفه، ومن وجد ملجأ أو معاذا فليعذ به ‏\"‏‏.‏ وعن ابن شهاب، حدثني أبو بكر بن عبد الرحمن بن الحارث، عن عبد الرحمن بن مطيع بن الأسود، عن نوفل بن معاوية،، مثل حديث أبي هريرة هذا، إلا أن أبا بكر، يزيد ‏\"‏ من الصلاة صلاة من فاتته فكأنما وتر أهله وماله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3620,
			"arabicnumber": 3620,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن عبد الله بن أبي حسين، حدثنا نافع بن جبير، عن ابن عباس ـ رضى الله عنهما ـ قال قدم مسيلمة الكذاب على عهد رسول الله صلى الله عليه وسلم فجعل يقول إن جعل لي محمد الأمر من بعده تبعته‏.‏ وقدمها في بشر كثير من قومه، فأقبل إليه رسول الله صلى الله عليه وسلم ومعه ثابت بن قيس بن شماس، وفي يد رسول الله صلى الله عليه وسلم قطعة جريد، حتى وقف على مسيلمة في أصحابه فقال ‏\"‏ لو سألتني هذه القطعة ما أعطيتكها، ولن تعدو أمر الله فيك، ولئن أدبرت ليعقرنك الله، وإني لأراك الذي أريت فيك ما رأيت ‏\"‏‏.‏ فأخبرني أبو هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينما أنا نائم رأيت في يدى سوارين من ذهب، فأهمني شأنهما، فأوحي إلى في المنام أن انفخهما، فنفختهما فطارا فأولتهما كذابين يخرجان بعدي ‏\"‏‏.‏ فكان أحدهما العنسي والآخر مسيلمة الكذاب صاحب اليمامة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3623,
			"arabicnumber": 3623,
			"text": "حدثنا أبو نعيم، حدثنا زكرياء، عن فراس، عن عامر، عن مسروق، عن عائشة ـ رضى الله عنها ـ قالت أقبلت فاطمة تمشي، كأن مشيتها مشى النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ مرحبا بابنتي ‏\"‏‏.‏ ثم أجلسها عن يمينه أو عن شماله، ثم أسر إليها حديثا، فبكت فقلت لها لم تبكين ثم أسر إليها حديثا فضحكت فقلت ما رأيت كاليوم فرحا أقرب من حزن، فسألتها عما قال‏.‏ فقالت ما كنت لأفشي سر رسول الله صلى الله عليه وسلم حتى قبض النبي صلى الله عليه وسلم فسألتها فقالت أسر إلى ‏\"‏ إن جبريل كان يعارضني القرآن كل سنة مرة، وإنه عارضني العام مرتين، ولا أراه إلا حضر أجلي، وإنك أول أهل بيتي لحاقا بي ‏\"‏‏.‏ فبكيت فقال ‏\"‏ أما ترضين أن تكوني سيدة نساء أهل الجنة ـ أو نساء المؤمنين ‏\"‏‏.‏ فضحكت لذلك‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3625,
			"arabicnumber": 3625,
			"text": "حدثني يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة ـ رضى الله عنها ـ قالت دعا النبي صلى الله عليه وسلم فاطمة ابنته في شكواه الذي قبض فيه، فسارها بشىء فبكت، ثم دعاها، فسارها فضحكت، قالت فسألتها عن ذلك‏.‏ فقالت سارني النبي صلى الله عليه وسلم فأخبرني أنه يقبض في وجعه الذي توفي فيه فبكيت، ثم سارني فأخبرني أني أول أهل بيته أتبعه فضحكت‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3642,
			"arabicnumber": 3642,
			"text": "حدثنا علي بن عبد الله، أخبرنا سفيان، حدثنا شبيب بن غرقدة، قال سمعت الحى، يحدثون عن عروة، أن النبي صلى الله عليه وسلم أعطاه دينارا يشتري به شاة، فاشترى له به شاتين، فباع إحداهما بدينار وجاءه بدينار وشاة، فدعا له بالبركة في بيعه، وكان لو اشترى التراب لربح فيه‏.‏ قال سفيان كان الحسن بن عمارة جاءنا بهذا الحديث عنه، قال سمعه شبيب من عروة، فأتيته فقال شبيب إني لم أسمعه من عروة، قال سمعت الحى يخبرونه عنه‏.‏ ولكن سمعته يقول سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ الخير معقود بنواصي الخيل إلى يوم القيامة ‏\"‏‏.‏ قال وقد رأيت في داره سبعين فرسا‏.‏ قال سفيان يشتري له شاة كأنها أضحية‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3667,
			"arabicnumber": 3667,
			"text": "حدثنا إسماعيل بن عبد الله، حدثنا سليمان بن بلال، عن هشام بن عروة، عن عروة بن الزبير، عن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم مات وأبو بكر بالسنح ـ قال إسماعيل يعني بالعالية ـ فقام عمر يقول والله ما مات رسول الله صلى الله عليه وسلم‏.‏ قالت وقال عمر والله ما كان يقع في نفسي إلا ذاك وليبعثنه الله فليقطعن أيدي رجال وأرجلهم‏.‏ فجاء أبو بكر فكشف عن رسول الله صلى الله عليه وسلم فقبله قال بأبي أنت وأمي طبت حيا وميتا، والذي نفسي بيده لا يذيقك الله الموتتين أبدا‏.‏ ثم خرج فقال أيها الحالف على رسلك‏.‏ فلما تكلم أبو بكر جلس عمر‏.‏ فحمد الله أبو بكر وأثنى عليه وقال ألا من كان يعبد محمدا صلى الله عليه وسلم فإن محمدا قد مات، ومن كان يعبد الله فإن الله حى لا يموت‏.‏ وقال ‏{‏إنك ميت وإنهم ميتون‏}‏ وقال ‏{‏وما محمد إلا رسول قد خلت من قبله الرسل أفإن مات أو قتل انقلبتم على أعقابكم ومن ينقلب على عقبيه فلن يضر الله شيئا وسيجزي الله الشاكرين‏}‏ قال فنشج الناس يبكون ـ قال ـ واجتمعت الأنصار إلى سعد بن عبادة في سقيفة بني ساعدة فقالوا منا أمير ومنكم أمير، فذهب إليهم أبو بكر وعمر بن الخطاب وأبو عبيدة بن الجراح، فذهب عمر يتكلم فأسكته أبو بكر، وكان عمر يقول والله ما أردت بذلك إلا أني قد هيأت كلاما قد أعجبني خشيت أن لا يبلغه أبو بكر، ثم تكلم أبو بكر فتكلم أبلغ الناس فقال في كلامه نحن الأمراء وأنتم الوزراء‏.‏ فقال حباب بن المنذر لا والله لا نفعل، منا أمير ومنكم أمير‏.‏ فقال أبو بكر لا، ولكنا الأمراء وأنتم الوزراء هم أوسط العرب دارا، وأعربهم أحسابا فبايعوا عمر أو أبا عبيدة‏.‏ فقال عمر بل نبايعك أنت، فأنت سيدنا وخيرنا وأحبنا إلى رسول الله صلى الله عليه وسلم‏.‏ فأخذ عمر بيده فبايعه، وبايعه الناس، فقال قائل قتلتم سعد بن عبادة‏.‏ فقال عمر قتله الله‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3669,
			"arabicnumber": 3669,
			"text": "وقال عبد الله بن سالم عن الزبيدي، قال عبد الرحمن بن القاسم أخبرني القاسم، أن عائشة ـ رضى الله عنها ـ قالت شخص بصر النبي صلى الله عليه وسلم ثم قال ‏\"‏ في الرفيق الأعلى ‏\"‏‏.‏ ثلاثا، وقص الحديث، قالت فما كانت من خطبتهما من خطبة إلا نفع الله بها، لقد خوف عمر الناس وإن فيهم لنفاقا، فردهم الله بذلك‏.‏ ثم لقد بصر أبو بكر الناس الهدى وعرفهم الحق الذي عليهم وخرجوا به يتلون ‏{‏وما محمد إلا رسول قد خلت من قبله الرسل‏}‏ إلى ‏{‏الشاكرين‏}‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3711,
			"arabicnumber": 3711,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني عروة بن الزبير، عن عائشة، أن فاطمة ـ عليها السلام ـ أرسلت إلى أبي بكر تسأله ميراثها من النبي صلى الله عليه وسلم فيما أفاء الله على رسوله صلى الله عليه وسلم، تطلب صدقة النبي صلى الله عليه وسلم التي بالمدينة وفدك وما بقي من خمس خيبر‏.‏ فقال أبو بكر إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا نورث، ما تركنا فهو صدقة، إنما يأكل آل محمد من هذا المال ـ يعني مال الله ـ ليس لهم أن يزيدوا على المأكل ‏\"‏‏.‏ وإني والله لا أغير شيئا من صدقات النبي صلى الله عليه وسلم التي كانت عليها في عهد النبي صلى الله عليه وسلم، ولأعملن فيها بما عمل فيها رسول الله صلى الله عليه وسلم‏.‏ فتشهد علي، ثم قال إنا قد عرفنا يا أبا بكر فضيلتك‏.‏ وذكر قرابتهم من رسول الله صلى الله عليه وسلم وحقهم‏.‏ فتكلم أبو بكر فقال والذي نفسي بيده، لقرابة رسول الله صلى الله عليه وسلم أحب إلى أن أصل من قرابتي‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3715,
			"arabicnumber": 3715,
			"text": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة ـ رضى الله عنها ـ قالت دعا النبي صلى الله عليه وسلم فاطمة ابنته في شكواه الذي قبض فيها، فسارها بشىء فبكت، ثم دعاها فسارها فضحكت، قالت فسألتها عن ذلك‏.‏ فقالت سارني النبي صلى الله عليه وسلم فأخبرني أنه يقبض في وجعه الذي توفي فيه فبكيت، ثم سارني فأخبرني أني أول أهل بيته أتبعه فضحكت‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3723,
			"arabicnumber": 3723,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3738,
			"arabicnumber": 3738,
			"text": "حدثنا إسحاق بن نصر، حدثنا عبد الرزاق، عن معمر، عن الزهري، عن سالم، عن ابن عمر ـ رضى الله عنهما ـ قال كان الرجل في حياة النبي صلى الله عليه وسلم إذا رأى رؤيا قصها على النبي صلى الله عليه وسلم، فتمنيت أن أرى رؤيا أقصها على النبي صلى الله عليه وسلم، وكنت غلاما أعزب، وكنت أنام في المسجد على عهد النبي صلى الله عليه وسلم فرأيت في المنام كأن ملكين أخذاني فذهبا بي إلى النار، فإذا هي مطوية كطى البئر، فإذا لها قرنان كقرنى البئر، وإذا فيها ناس قد عرفتهم، فجعلت أقول أعوذ بالله من النار، أعوذ بالله من النار‏.‏ فلقيهما ملك آخر فقال لي لن تراع‏. فقصصتها على حفصة‏.‏ فقصتها حفصة على النبي صلى الله عليه وسلم فقال ‏ \"‏ نعم الرجل عبد الله، لو كان يصلي بالليل ‏\"‏‏.‏ قال سالم فكان عبد الله لا ينام من الليل إلا قليلا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3741,
			"arabicnumber": 3741,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3756.2,
			"arabicnumber": 3756.2,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، وقال، ‏ \"‏ علمه الكتاب ‏\"‏‏.‏ حدثنا موسى، حدثنا وهيب، عن خالد، مثله‏.‏ والحكمة الإصابة في غير النبوة",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3759,
			"arabicnumber": 3759,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، عن سليمان، قال سمعت أبا وائل، قال سمعت مسروقا، قال قال عبد الله بن عمرو إن رسول الله صلى الله عليه وسلم لم يكن فاحشا ولا متفحشا وقال ‏\"‏ إن من أحبكم إلى أحسنكم أخلاقا ‏\"‏‏.‏ وقال ‏\"‏ استقرئوا القرآن من أربعة من عبد الله بن مسعود، وسالم مولى أبي حذيفة، وأبى بن كعب، ومعاذ بن جبل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3939,
			"arabicnumber": 3939,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو، سمع أبا المنهال عبد الرحمن بن مطعم، قال باع شريك لي دراهم في السوق نسيئة فقلت سبحان الله أيصلح هذا فقال سبحان الله، والله لقد بعتها في السوق فما عابه أحد، فسألت البراء بن عازب فقال قدم النبي صلى الله عليه وسلم ونحن نتبايع هذا البيع، فقال ‏ \"‏ ما كان يدا بيد فليس به بأس، وما كان نسيئة فلا يصلح ‏\"‏‏.‏ والق زيد بن أرقم فاسأله فإنه كان أعظمنا تجارة، فسألت زيد بن أرقم فقال مثله‏.‏ وقال سفيان مرة فقال قدم علينا النبي صلى الله عليه وسلم المدينة ونحن نتبايع، وقال نسيئة إلى الموسم أو الحج‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3963.2,
			"arabicnumber": 3963.2,
			"text": "حدثني ابن المثنى، أخبرنا معاذ بن معاذ، حدثنا سليمان، أخبرنا أنس بن مالك، نحوه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3978,
			"arabicnumber": 3978,
			"text": "حدثني عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، قال ذكر عند عائشة ـ رضى الله عنها ـ أن ابن عمر رفع إلى النبي صلى الله عليه وسلم ‏\"‏ إن الميت يعذب في قبره ببكاء أهله ‏\"‏‏.‏ فقالت إنما قال رسول الله صلى الله عليه وسلم ‏\"‏ إنه ليعذب بخطيئته وذنبه، وإن أهله ليبكون عليه الآن ‏\"‏‏.‏ قالت وذاك مثل قوله إن رسول الله صلى الله عليه وسلم قام على القليب وفيه قتلى بدر من المشركين، فقال لهم ما قال إنهم ليسمعون ما أقول‏.‏ إنما قال ‏\"‏ إنهم الآن ليعلمون أن ما كنت أقول لهم حق ‏\"‏‏.‏ ثم قرأت ‏{‏إنك لا تسمع الموتى‏}‏ ‏{‏وما أنت بمسمع من في القبور‏}‏ تقول حين تبوءوا مقاعدهم من النار‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3980,
			"arabicnumber": 3980,
			"text": "حدثني عثمان، حدثنا عبدة، عن هشام، عن أبيه، عن ابن عمر ـ رضى الله عنهما ـ قال وقف النبي صلى الله عليه وسلم على قليب بدر فقال ‏{‏هل وجدتم ما وعد ربكم حقا ثم قال إنهم الآن يسمعون ما أقول‏}‏ فذكر لعائشة فقالت إنما قال النبي صلى الله عليه وسلم ‏\"‏ إنهم الآن ليعلمون أن الذي كنت أقول لهم هو الحق ‏\"‏‏.‏ ثم قرأت ‏{‏إنك لا تسمع الموتى‏}‏ حتى قرأت الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4012,
			"arabicnumber": 4012,
			"text": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن مالك، عن الزهري، أن سالم بن عبد الله، أخبره قال أخبر رافع بن خديج عبد الله بن عمر، أن عميه، وكانا، شهدا بدرا أخبراه أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع‏.‏ قلت لسالم فتكريها أنت قال نعم، إن رافعا أكثر على نفسه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4016,
			"arabicnumber": 4016,
			"text": "حدثنا أبو النعمان، حدثنا جرير بن حازم، عن نافع، أن ابن عمر ـ رضى الله عنهما ـ كان يقتل الحيات كلها‏.‏ حتى حدثه أبو لبابة البدري، أن النبي صلى الله عليه وسلم نهى عن قتل جنان البيوت، فأمسك عنها‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4033,
			"arabicnumber": 4033,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني مالك بن أوس بن الحدثان النصري، أن عمر بن الخطاب ـ رضى الله عنه ـ دعاه إذ جاءه حاجبه يرفا فقال هل لك في عثمان، وعبد الرحمن، والزبير وسعد يستأذنون فقال نعم، فأدخلهم‏.‏ فلبث قليلا، ثم جاء فقال هل لك في عباس وعلي يستأذنان قال نعم‏.‏ فلما دخلا قال عباس يا أمير المؤمنين، اقض بيني وبين هذا، وهما يختصمان في الذي أفاء الله على رسوله صلى الله عليه وسلم من بني النضير، فاستب علي وعباس، فقال الرهط يا أمير المؤمنين، اقض بينهما وأرح أحدهما من الآخر‏.‏ فقال عمر اتئدوا، أنشدكم بالله الذي بإذنه تقوم السماء والأرض، هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث، ما تركنا صدقة ‏\"‏‏.‏ يريد بذلك نفسه‏.‏ قالوا قد قال ذلك‏.‏ فأقبل عمر على عباس وعلي فقال أنشدكما بالله هل تعلمان أن رسول الله صلى الله عليه وسلم قد قال ذلك قالا نعم‏.‏ قال فإني أحدثكم عن هذا الأمر، إن الله سبحانه كان خص رسوله صلى الله عليه وسلم في هذا الفىء بشىء لم يعطه أحدا غيره فقال جل ذكره ‏{‏وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب‏}‏ إلى قوله ‏{‏قدير‏}‏ فكانت هذه خالصة لرسول الله صلى الله عليه وسلم، ثم والله ما احتازها دونكم، ولا استأثرها عليكم، لقد أعطاكموها وقسمها فيكم، حتى بقي هذا المال منها، فكان رسول الله صلى الله عليه وسلم ينفق على أهله نفقة سنتهم من هذا المال، ثم يأخذ ما بقي فيجعله مجعل مال الله، فعمل ذلك رسول الله صلى الله عليه وسلم حياته، ثم توفي النبي صلى الله عليه وسلم فقال أبو بكر فأنا ولي رسول الله صلى الله عليه وسلم‏.‏ فقبضه أبو بكر، فعمل فيه بما عمل به رسول الله صلى الله عليه وسلم وأنتم حينئذ‏.‏ فأقبل على علي وعباس وقال تذكران أن أبا بكر عمل فيه كما تقولان، والله يعلم إنه فيه لصادق بار راشد تابع للحق ثم توفى الله أبا بكر فقلت أنا ولي رسول الله صلى الله عليه وسلم وأبي بكر‏.‏ فقبضته سنتين من إمارتي أعمل فيه بما عمل رسول الله صلى الله عليه وسلم وأبو بكر، والله يعلم أني فيه صادق بار راشد تابع للحق، ثم جئتماني كلاكما وكلمتكما واحدة وأمركما جميع، فجئتني ـ يعني عباسا ـ فقلت لكما إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث، ما تركنا صدقة ‏\"‏‏.‏ فلما بدا لي أن أدفعه إليكما قلت إن شئتما دفعته إليكما على أن عليكما عهد الله وميثاقه لتعملان فيه بما عمل فيه رسول الله صلى الله عليه وسلم وأبو بكر، وما عملت فيه مذ وليت، وإلا فلا تكلماني، فقلتما ادفعه إلينا بذلك‏.‏ فدفعته إليكما، أفتلتمسان مني قضاء غير ذلك فوالله الذي بإذنه تقوم السماء والأرض لا أقضي فيه بقضاء غير ذلك حتى تقوم الساعة، فإن عجزتما عنه، فادفعا إلى فأنا أكفيكماه‏.‏ قال فحدثت هذا الحديث، عروة بن الزبير فقال صدق مالك بن أوس، أنا سمعت عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم تقول أرسل أزواج النبي صلى الله عليه وسلم عثمان إلى أبي بكر يسألنه ثمنهن مما أفاء الله على رسوله صلى الله عليه وسلم، فكنت أنا أردهن، فقلت لهن ألا تتقين الله، ألم تعلمن أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ لا نورث، ما تركنا صدقة ـ يريد بذلك نفسه ـ إنما يأكل آل محمد صلى الله عليه وسلم في هذا المال ‏\"‏‏.‏ فانتهى أزواج النبي صلى الله عليه وسلم إلى ما أخبرتهن‏.‏ قال فكانت هذه الصدقة بيد علي، منعها علي عباسا فغلبه عليها، ثم كان بيد حسن بن علي، ثم بيد حسين بن علي، ثم بيد علي بن حسين وحسن بن حسن، كلاهما كانا يتداولانها، ثم بيد زيد بن حسن، وهى صدقة رسول الله صلى الله عليه وسلم حقا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4035,
			"arabicnumber": 4035,
			"text": "حدثنا إبراهيم بن موسى، أخبرنا هشام، أخبرنا معمر، عن الزهري، عن عروة، عن عائشة، أن فاطمة ـ عليها السلام ـ والعباس أتيا أبا بكر يلتمسان ميراثهما، أرضه من فدك، وسهمه من خيبر‏.‏ فقال أبو بكر سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ لا نورث، ما تركنا صدقة، إنما يأكل آل محمد في هذا المال ‏\"‏‏.‏ والله لقرابة رسول الله صلى الله عليه وسلم أحب إلى أن أصل من قرابتي‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4043,
			"arabicnumber": 4043,
			"text": "حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن البراء ـ رضى الله عنه ـ قال لقينا المشركين يومئذ، وأجلس النبي صلى الله عليه وسلم جيشا من الرماة، وأمر عليهم عبد الله وقال ‏\"‏ لا تبرحوا، إن رأيتمونا ظهرنا عليهم فلا تبرحوا وإن رأيتموهم ظهروا علينا فلا تعينونا ‏\"‏‏.‏ فلما لقينا هربوا حتى رأيت النساء يشتددن في الجبل، رفعن عن سوقهن قد بدت خلاخلهن، فأخذوا يقولون الغنيمة الغنيمة‏.‏ فقال عبد الله عهد إلى النبي صلى الله عليه وسلم أن لا تبرحوا‏.‏ فأبوا، فلما أبوا صرف وجوههم، فأصيب سبعون قتيلا، وأشرف أبو سفيان فقال أفي القوم محمد فقال ‏\"‏ لا تجيبوه ‏\"‏‏.‏ فقال أفي القوم ابن أبي قحافة قال ‏\"‏ لا تجيبوه ‏\"‏‏.‏ فقال أفي القوم ابن الخطاب فقال إن هؤلاء قتلوا، فلو كانوا أحياء لأجابوا، فلم يملك عمر نفسه فقال كذبت يا عدو الله، أبقى الله عليك ما يخزيك‏.‏ قال أبو سفيان أعل هبل‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أجيبوه ‏\"‏‏.‏ قالوا ما نقول قال ‏\"‏ قولوا الله أعلى وأجل ‏\"‏‏.‏ قال أبو سفيان لنا العزى ولا عزى لكم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أجيبوه ‏\"‏‏.‏ قالوا ما نقول قال ‏\"‏ قولوا الله مولانا ولا مولى لكم ‏\"‏‏.‏ قال أبو سفيان يوم بيوم بدر، والحرب سجال، وتجدون مثلة لم آمر بها ولم تسؤني‏.‏ أخبرني عبد الله بن محمد، حدثنا سفيان، عن عمرو، عن جابر، قال اصطبح الخمر يوم أحد ناس ثم قتلوا شهداء‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4060,
			"arabicnumber": 4060,
			"text": "حدثنا موسى بن إسماعيل، عن معتمر، عن أبيه، قال زعم أبو عثمان أنه لم يبق مع النبي صلى الله عليه وسلم في بعض تلك الأيام التي يقاتل فيهن غير طلحة وسعد‏.‏ عن حديثهما‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4079,
			"arabicnumber": 4079,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن شهاب، عن عبد الرحمن بن كعب بن مالك، أن جابر بن عبد الله ـ رضى الله عنهما ـ أخبره أن رسول الله صلى الله عليه وسلم كان يجمع بين الرجلين من قتلى أحد في ثوب واحد ثم يقول ‏\"‏ أيهم أكثر أخذا للقرآن ‏\"‏‏.‏ فإذا أشير له إلى أحد، قدمه في اللحد، وقال ‏\"‏ أنا شهيد على هؤلاء يوم القيامة ‏\"‏‏.‏ وأمر بدفنهم بدمائهم، ولم يصل عليهم، ولم يغسلوا‏.‏ وقال أبو الوليد عن شعبة، عن ابن المنكدر، قال سمعت جابرا، قال لما قتل أبي جعلت أبكي وأكشف الثوب عن وجهه،، فجعل أصحاب النبي صلى الله عليه وسلم ينهوني والنبي صلى الله عليه وسلم لم ينه، وقال النبي صلى الله عليه وسلم ‏\"‏ لا تبكيه أو ما تبكيه، ما زالت الملائكة تظله بأجنحتها حتى رفع ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4157,
			"arabicnumber": 4157,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن الزهري، عن عروة، عن مروان، والمسور بن مخرمة، قالا خرج النبي صلى الله عليه وسلم عام الحديبية في بضع عشرة مائة من أصحابه، فلما كان بذي الحليفة قلد الهدى وأشعر وأحرم منها‏.‏ لا أحصي كم سمعته من سفيان حتى سمعته يقول لا أحفظ من الزهري الإشعار والتقليد، فلا أدري ـ يعني ـ موضع الإشعار والتقليد، أو الحديث كله‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4160,
			"arabicnumber": 4160,
			"text": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن زيد بن أسلم، عن أبيه، قال خرجت مع عمر بن الخطاب ـ رضى الله عنه ـ إلى السوق، فلحقت عمر امرأة شابة فقالت يا أمير المؤمنين هلك زوجي وترك صبية صغارا، والله ما ينضجون كراعا، ولا لهم زرع ولا ضرع، وخشيت أن تأكلهم الضبع، وأنا بنت خفاف بن إيماء الغفاري، وقد شهد أبي الحديبية مع النبي صلى الله عليه وسلم، فوقف معها عمر، ولم يمض، ثم قال مرحبا بنسب قريب‏.‏ ثم انصرف إلى بعير ظهير كان مربوطا في الدار، فحمل عليه غرارتين ملأهما طعاما، وحمل بينهما نفقة وثيابا، ثم ناولها بخطامه ثم قال اقتاديه فلن يفنى حتى يأتيكم الله بخير‏.‏ فقال رجل يا أمير المؤمنين أكثرت لها‏.‏ قال عمر ثكلتك أمك، والله إني لأرى أبا هذه وأخاها قد حاصرا حصنا زمانا، فافتتحاه، ثم أصبحنا نستفيء سهمانهما فيه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4178,
			"arabicnumber": 4178,
			"text": "حدثنا عبد الله بن محمد، حدثنا سفيان، قال سمعت الزهري، حين حدث هذا الحديث،، حفظت بعضه، وثبتني معمر عن عروة بن الزبير، عن المسور بن مخرمة، ومروان بن الحكم، يزيد أحدهما على صاحبه قالا خرج النبي صلى الله عليه وسلم عام الحديبية في بضع عشرة مائة من أصحابه، فلما أتى ذا الحليفة قلد الهدى، وأشعره، وأحرم منها بعمرة، وبعث عينا له من خزاعة، وسار النبي صلى الله عليه وسلم حتى كان بغدير الأشطاط، أتاه عينه قال إن قريشا جمعوا لك جموعا، وقد جمعوا لك الأحابيش، وهم مقاتلوك وصادوك عن البيت ومانعوك‏.‏ فقال ‏\"‏ أشيروا أيها الناس على، أترون أن أميل إلى عيالهم وذراري هؤلاء الذين يريدون أن يصدونا عن البيت، فإن يأتونا كان الله عز وجل قد قطع عينا من المشركين، وإلا تركناهم محروبين ‏\"‏‏.‏ قال أبو بكر يا رسول الله، خرجت عامدا لهذا البيت، لا تريد قتل أحد ولا حرب أحد، فتوجه له، فمن صدنا عنه قاتلناه‏.‏ قال ‏\"‏ امضوا على اسم الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4180,
			"arabicnumber": 4180,
			"text": "حدثني إسحاق، أخبرنا يعقوب، حدثني ابن أخي ابن شهاب، عن عمه، أخبرني عروة بن الزبير، أنه سمع مروان بن الحكم، والمسور بن مخرمة، يخبران خبرا من خبر رسول الله صلى الله عليه وسلم في عمرة الحديبية فكان فيما أخبرني عروة عنهما أنه لما كاتب رسول الله صلى الله عليه وسلم سهيل بن عمرو، يوم الحديبية على قضية المدة، وكان فيما اشترط سهيل بن عمرو أنه قال لا يأتيك منا أحد وإن كان على دينك إلا رددته إلينا، وخليت بيننا وبينه‏.‏ وأبى سهيل أن يقاضي رسول الله صلى الله عليه وسلم إلا على ذلك، فكره المؤمنون ذلك وامعضوا، فتكلموا فيه، فلما أبى سهيل أن يقاضي رسول الله صلى الله عليه وسلم إلا على ذلك، كاتبه رسول الله صلى الله عليه وسلم، فرد رسول الله صلى الله عليه وسلم أبا جندل بن سهيل يومئذ إلى أبيه سهيل بن عمرو، ولم يأت رسول الله صلى الله عليه وسلم أحد من الرجال إلا رده في تلك المدة، وإن كان مسلما، وجاءت المؤمنات مهاجرات، فكانت أم كلثوم بنت عقبة بن معيط ممن خرج إلى رسول الله صلى الله عليه وسلم وهى عاتق، فجاء أهلها يسألون رسول الله صلى الله عليه وسلم أن يرجعها إليهم، حتى أنزل الله تعالى في المؤمنات ما أنزل‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4221,
			"arabicnumber": 4221,
			"text": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عدي بن ثابت، عن البراء، وعبد الله بن أبي أوفى، رضى الله عنهم أنهم كانوا مع النبي صلى الله عليه وسلم فأصابوا حمرا فطبخوها، فنادى منادي النبي صلى الله عليه وسلم أكفئوا القدور‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4223,
			"arabicnumber": 4223,
			"text": "حدثني إسحاق، حدثنا عبد الصمد، حدثنا شعبة، حدثنا عدي بن ثابت، سمعت البراء، وابن أبي أوفى، يحدثان عن النبي صلى الله عليه وسلم أنه قال يوم خيبر وقد نصبوا القدور أكفئوا القدور‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4240,
			"arabicnumber": 4240,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة، أن فاطمة ـ عليها السلام ـ بنت النبي صلى الله عليه وسلم أرسلت إلى أبي بكر تسأله ميراثها من رسول الله صلى الله عليه وسلم مما أفاء الله عليه بالمدينة وفدك، وما بقي من خمس خيبر، فقال أبو بكر إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا نورث، ما تركنا صدقة، إنما يأكل آل محمد صلى الله عليه وسلم في هذا المال ‏\"‏‏.‏ وإني والله لا أغير شيئا من صدقة رسول الله صلى الله عليه وسلم عن حالها التي كان عليها في عهد رسول الله صلى الله عليه وسلم ولأعملن فيها بما عمل به رسول الله صلى الله عليه وسلم فأبى أبو بكر أن يدفع إلى فاطمة منها شيئا فوجدت فاطمة على أبي بكر في ذلك فهجرته، فلم تكلمه حتى توفيت، وعاشت بعد النبي صلى الله عليه وسلم ستة أشهر، فلما توفيت، دفنها زوجها علي ليلا، ولم يؤذن بها أبا بكر وصلى عليها، وكان لعلي من الناس وجه حياة فاطمة، فلما توفيت استنكر علي وجوه الناس، فالتمس مصالحة أبي بكر ومبايعته، ولم يكن يبايع تلك الأشهر، فأرسل إلى أبي بكر أن ائتنا، ولا يأتنا أحد معك، كراهية لمحضر عمر‏.‏ فقال عمر لا والله لا تدخل عليهم وحدك‏.‏ فقال أبو بكر وما عسيتهم أن يفعلوا بي، والله لآتينهم‏.‏ فدخل عليهم أبو بكر، فتشهد علي فقال إنا قد عرفنا فضلك، وما أعطاك، الله ولم ننفس عليك خيرا ساقه الله إليك، ولكنك استبددت علينا بالأمر، وكنا نرى لقرابتنا من رسول الله صلى الله عليه وسلم نصيبا‏.‏ حتى فاضت عينا أبي بكر، فلما تكلم أبو بكر قال والذي نفسي بيده لقرابة رسول الله صلى الله عليه وسلم أحب إلى أن أصل من قرابتي، وأما الذي شجر بيني وبينكم من هذه الأموال، فلم آل فيها عن الخير، ولم أترك أمرا رأيت رسول الله صلى الله عليه وسلم يصنعه فيها إلا صنعته‏.‏ فقال علي لأبي بكر موعدك العشية للبيعة‏.‏ فلما صلى أبو بكر الظهر رقي على المنبر، فتشهد وذكر شأن علي، وتخلفه عن البيعة، وعذره بالذي اعتذر إليه، ثم استغفر، وتشهد علي فعظم حق أبي بكر، وحدث أنه لم يحمله على الذي صنع نفاسة على أبي بكر، ولا إنكارا للذي فضله الله به، ولكنا نرى لنا في هذا الأمر نصيبا، فاستبد علينا، فوجدنا في أنفسنا، فسر بذلك المسلمون وقالوا أصبت‏.‏ وكان المسلمون إلى علي قريبا، حين راجع الأمر المعروف‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4244,
			"arabicnumber": 4244,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن عبد المجيد بن سهيل، عن سعيد بن المسيب، عن أبي سعيد الخدري، وأبي، هريرة ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم استعمل رجلا على خيبر، فجاءه بتمر جنيب، فقال رسول الله صلى الله عليه وسلم ‏\"‏ كل تمر خيبر هكذا ‏\"‏‏.‏ فقال لا والله يا رسول الله، إنا لنأخذ الصاع من هذا بالصاعين ‏{‏والصاعين‏}‏ بالثلاثة‏.‏ فقال ‏\"‏ لا تفعل، بع الجمع بالدراهم، ثم ابتع بالدراهم جنيبا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4246,
			"arabicnumber": 4246,
			"text": "وقال عبد العزيز بن محمد عن عبد المجيد، عن سعيد، أن أبا سعيد، وأبا، هريرة حدثاه أن النبي صلى الله عليه وسلم بعث أخا بني عدي من الأنصار إلى خيبر فأمره عليها‏.‏ وعن عبد المجيد عن أبي صالح السمان عن أبي هريرة وأبي سعيد مثله",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4253,
			"arabicnumber": 4253,
			"text": "حدثني عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن مجاهد، قال دخلت أنا وعروة بن الزبير المسجد، فإذا عبد الله بن عمر ـ رضى الله عنهما ـ جالس إلى حجرة عائشة ثم قال كم اعتمر النبي صلى الله عليه وسلم قال أربعا ‏{‏إحداهن في رجب‏}‏ ثم سمعنا استنان، عائشة قال عروة يا أم المؤمنين ألا تسمعين ما يقول أبو عبد الرحمن إن النبي صلى الله عليه وسلم اعتمر أربع عمر‏.‏ فقالت ما اعتمر النبي صلى الله عليه وسلم عمرة إلا وهو شاهده، وما اعتمر في رجب قط‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4282,
			"arabicnumber": 4282,
			"text": "حدثنا سليمان بن عبد الرحمن، حدثنا سعدان بن يحيى، حدثنا محمد بن أبي حفصة، عن الزهري، عن علي بن حسين، عن عمرو بن عثمان، عن أسامة بن زيد، أنه قال زمن الفتح يا رسول الله، أين تنزل غدا قال النبي صلى الله عليه وسلم ‏\"‏ وهل ترك لنا عقيل من منزل ‏\"‏‏.‏ ثم قال ‏\"‏ لا يرث المؤمن الكافر، ولا يرث الكافر المؤمن ‏\"‏‏.‏ قيل للزهري ومن ورث أبا طالب قال ورثه عقيل وطالب‏.‏ قال معمر عن الزهري أين تنزل غدا‏.‏ في حجته، ولم يقل يونس حجته ولا زمن الفتح‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4305,
			"arabicnumber": 4305,
			"text": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا عاصم، عن أبي عثمان، قال حدثني مجاشع، قال أتيت النبي صلى الله عليه وسلم بأخي بعد الفتح قلت يا رسول الله، جئتك بأخي لتبايعه على الهجرة‏.‏ قال ‏\"‏ ذهب أهل الهجرة بما فيها ‏\"‏‏.‏ فقلت على أى شىء تبايعه قال ‏\"‏ أبايعه على الإسلام والإيمان والجهاد‏\" فلقيت أبا معبد بعد وكان أكبرهما فسألته فقال صدق مجاشع‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4307,
			"arabicnumber": 4307,
			"text": "حدثنا محمد بن أبي بكر، حدثنا الفضيل بن سليمان، حدثنا عاصم، عن أبي عثمان النهدي، عن مجاشع بن مسعود، انطلقت بأبي معبد إلى النبي صلى الله عليه وسلم ليبايعه على الهجرة، قال ‏ \"‏ مضت الهجرة لأهلها، أبايعه على الإسلام والجهاد.\" فلقيت أبا معبد فسألته فقال صدق مجاشع‏.‏ وقال خالد عن أبي عثمان عن مجاشع أنه جاء بأخيه مجالد‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4318,
			"arabicnumber": 4318,
			"text": "حدثنا سعيد بن عفير، قال حدثني ليث، حدثني عقيل، عن ابن شهاب،‏.‏ وحدثني إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب،، قال محمد بن شهاب وزعم عروة بن الزبير أن مروان، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قام حين جاءه وفد هوازن مسلمين، فسألوه أن يرد إليهم أموالهم وسبيهم، فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ معي من ترون، وأحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما السبى، وإما المال، وقد كنت استأنيت بكم ‏\"‏‏.‏ وكان أنظرهم رسول الله صلى الله عليه وسلم بضع عشرة ليلة، حين قفل من الطائف، فلما تبين لهم أن رسول الله صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام رسول الله صلى الله عليه وسلم في المسلمين، فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد، فإن إخوانكم قد جاءونا تائبين، وإني قد رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب منكم أن يكون على حظه، حتى نعطيه إياه من أول ما يفيء الله علينا، فليفعل ‏\"‏‏.‏ فقال الناس قد طيبنا ذلك يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم في ذلك ممن لم يأذن فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم ثم رجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أنهم قد طيبوا وأذنوا‏.‏ هذا الذي بلغني عن سبى هوازن‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4326,
			"arabicnumber": 4326,
			"text": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عاصم، قال سمعت أبا عثمان، قال سمعت سعدا ـ وهو أول من رمى بسهم في سبيل الله ـ وأبا بكرة ـ وكان تسور حصن الطائف في أناس ـ فجاء إلى النبي صلى الله عليه وسلم فقالا سمعنا النبي صلى الله عليه وسلم يقول ‏ \"‏ من ادعى إلى غير أبيه وهو يعلم فالجنة عليه حرام ‏\"‏‏.‏ وقال هشام وأخبرنا معمر، عن عاصم، عن أبي العالية، أو أبي عثمان النهدي قال سمعت سعدا، وأبا، بكرة عن النبي صلى الله عليه وسلم‏.‏ قال عاصم قلت لقد شهد عندك رجلان حسبك بهما‏.‏ قال أجل أما أحدهما فأول من رمى بسهم في سبيل الله، وأما الآخر فنزل إلى النبي صلى الله عليه وسلم ثالث ثلاثة وعشرين من الطائف‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4341,
			"arabicnumber": 4341,
			"text": "حدثنا موسى، حدثنا أبو عوانة، حدثنا عبد الملك، عن أبي بردة، قال بعث رسول الله صلى الله عليه وسلم أبا موسى ومعاذ بن جبل إلى اليمن، قال وبعث كل واحد منهما على مخلاف قال واليمن مخلافان ثم قال ‏ \"‏ يسرا ولا تعسرا، وبشرا ولا تنفرا ‏\"‏‏.‏ فانطلق كل واحد منهما إلى عمله، وكان كل واحد منهما إذا سار في أرضه كان قريبا من صاحبه أحدث به عهدا، فسلم عليه، فسار معاذ في أرضه قريبا من صاحبه أبي موسى، فجاء يسير على بغلته حتى انتهى إليه، وإذا هو جالس، وقد اجتمع إليه الناس، وإذا رجل عنده قد جمعت يداه إلى عنقه فقال له معاذ يا عبد الله بن قيس، أيم هذا قال هذا رجل كفر بعد إسلامه‏.‏ قال لا أنزل حتى يقتل‏.‏ قال إنما جيء به لذلك فانزل‏.‏ قال ما أنزل حتى يقتل فأمر به فقتل ثم نزل فقال يا عبد الله، كيف تقرأ القرآن قال أتفوقه تفوقا‏.‏ قال فكيف تقرأ أنت يا معاذ قال أنام أول الليل فأقوم وقد قضيت جزئي من النوم، فأقرأ ما كتب الله لي، فأحتسب نومتي كما أحتسب قومتي‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4344,
			"arabicnumber": 4344,
			"text": "حدثنا مسلم، حدثنا شعبة، حدثنا سعيد بن أبي بردة، عن أبيه، قال بعث النبي صلى الله عليه وسلم جده أبا موسى، ومعاذا إلى اليمن فقال ‏\"‏ يسرا ولا تعسرا، وبشرا ولا تنفرا، وتطاوعا ‏\"‏‏.‏ فقال أبو موسى يا نبي الله، إن أرضنا بها شراب من الشعير المزر، وشراب من العسل البتع‏.‏ فقال ‏\"‏ كل مسكر حرام ‏\"‏‏.‏ فانطلقا فقال معاذ لأبي موسى كيف تقرأ القرآن قال قائما وقاعدا وعلى راحلته وأتفوقه تفوقا‏.‏ قال أما أنا فأنام وأقوم، فأحتسب نومتي كما أحتسب قومتي، وضرب فسطاطا، فجعلا يتزاوران، فزار معاذ أبا موسى، فإذا رجل موثق، فقال ما هذا فقال أبو موسى يهودي أسلم ثم ارتد‏.‏ فقال معاذ لأضربن عنقه‏.‏ تابعه العقدي ووهب عن شعبة‏.‏ وقال وكيع والنضر وأبو داود عن شعبة، عن سعيد، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم‏.‏ رواه جرير بن عبد الحميد عن الشيباني عن أبي بردة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4353,
			"arabicnumber": 4353,
			"text": "حدثنا مسدد، حدثنا بشر بن المفضل، عن حميد الطويل، حدثنا بكر، أنه ذكر لابن عمر أن أنسا حدثهم أن النبي صلى الله عليه وسلم أهل بعمرة وحجة، فقال أهل النبي صلى الله عليه وسلم بالحج، وأهللنا به معه، فلما قدمنا مكة قال ‏\"‏ من لم يكن معه هدى فليجعلها عمرة ‏\"‏‏.‏ وكان مع النبي صلى الله عليه وسلم هدى، فقدم علينا علي بن أبي طالب من اليمن حاجا فقال النبي صلى الله عليه وسلم ‏\"‏ بم أهللت فإن معنا أهلك ‏\"‏‏.‏ قال أهللت بما أهل به النبي صلى الله عليه وسلم‏.‏ قال ‏\"‏ فأمسك، فإن معنا هديا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4373,
			"arabicnumber": 4373,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن عبد الله بن أبي حسين، حدثنا نافع بن جبير، عن ابن عباس ـ رضى الله عنهما ـ قال قدم مسيلمة الكذاب على عهد رسول الله صلى الله عليه وسلم فجعل يقول إن جعل لي محمد من بعده تبعته‏.‏ وقدمها في بشر كثير من قومه، فأقبل إليه رسول الله صلى الله عليه وسلم ومعه ثابت بن قيس بن شماس، وفي يد رسول الله صلى الله عليه وسلم قطعة جريد حتى وقف على مسيلمة في أصحابه، فقال ‏\"‏ لو سألتني هذه القطعة ما أعطيتكها ولن تعدو أمر الله فيك، ولئن أدبرت ليعقرنك الله، وإني لأراك الذي أريت فيه ما رأيت، وهذا ثابت يجيبك عني ‏\"‏‏.‏ ثم انصرف عنه‏.‏ قال ابن عباس فسألت عن قول، رسول الله صلى الله عليه وسلم ‏\"‏ إنك أرى الذي أريت فيه ما أريت ‏\"‏‏.‏ فأخبرني أبو هريرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينا أنا نائم رأيت في يدى سوارين من ذهب، فأهمني شأنهما، فأوحي إلى في المنام أن انفخهما، فنفختهما فطارا فأولتهما كذابين يخرجان بعدي، أحدهما العنسي، والآخر مسيلمة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4376,
			"arabicnumber": 4376,
			"text": "حدثنا الصلت بن محمد، قال سمعت مهدي بن ميمون، قال سمعت أبا رجاء العطاردي، يقول كنا نعبد الحجر، فإذا وجدنا حجرا هو أخير منه ألقيناه وأخذنا الآخر، فإذا لم نجد حجرا جمعنا جثوة من تراب، ثم جئنا بالشاة فحلبناه عليه، ثم طفنا به، فإذا دخل شهر رجب قلنا منصل الأسنة‏.‏ فلا ندع رمحا فيه حديدة ولا سهما فيه حديدة إلا نزعناه وألقيناه شهر رجب‏.‏ وسمعت أبا رجاء، يقول كنت يوم بعث النبي صلى الله عليه وسلم غلاما أرعى الإبل على أهلي، فلما سمعنا بخروجه فررنا إلى النار إلى مسيلمة الكذاب‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4378,
			"arabicnumber": 4378,
			"text": "حدثنا سعيد بن محمد الجرمي، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن عبيدة بن نشيط ـ وكان في موضع آخر اسمه عبد الله ـ أن عبيد الله بن عبد الله بن عتبة قال بلغنا أن مسيلمة الكذاب قدم المدينة، فنزل في دار بنت الحارث، وكان تحته بنت الحارث بن كريز، وهى أم عبد الله بن عامر، فأتاه رسول الله صلى الله عليه وسلم ومعه ثابت بن قيس بن شماس، وهو الذي يقال له خطيب رسول الله صلى الله عليه وسلم وفي يد رسول الله صلى الله عليه وسلم قضيب، فوقف عليه فكلمه فقال له مسيلمة إن شئت خليت بيننا وبين الأمر، ثم جعلته لنا بعدك‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لو سألتني هذا القضيب ما أعطيتكه وإني لأراك الذي أريت فيه ما أريت، وهذا ثابت بن قيس وسيجيبك عني ‏\"‏‏.‏ فانصرف النبي صلى الله عليه وسلم‏.‏ قال عبيد الله بن عبد الله سألت عبد الله بن عباس عن رؤيا، رسول الله صلى الله عليه وسلم التي ذكر فقال ابن عباس ذكر لي أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينا أنا نائم أريت أنه وضع في يدى سواران من ذهب، ففظعتهما وكرهتهما، فأذن لي فنفختهما فطارا، فأولتهما كذابين يخرجان ‏\"‏‏.‏ فقال عبيد الله أحدهما العنسي الذي قتله فيروز باليمن، والآخر مسيلمة الكذاب‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4402,
			"arabicnumber": 4402,
			"text": "حدثنا يحيى بن سليمان، قال أخبرني ابن وهب، قال حدثني عمر بن محمد، أن أباه، حدثه عن ابن عمر ـ رضى الله عنهما ـ قال كنا نتحدث بحجة الوداع والنبي صلى الله عليه وسلم بين أظهرنا، ولا ندري ما حجة الوداع، فحمد الله وأثنى عليه ثم ذكر المسيح الدجال فأطنب في ذكره وقال ‏\"‏ ما بعث الله من نبي إلا أنذر أمته، أنذره نوح والنبيون من بعده، وإنه يخرج فيكم، فما خفي عليكم من شأنه فليس يخفى عليكم أن ربكم ليس على ما يخفى عليكم ثلاثا، إن ربكم ليس بأعور، وإنه أعور عين اليمنى، كأن عينه عنبة طافية ‏\"‏‏.‏ ‏\"‏ ألا إن الله حرم عليكم دماءكم وأموالكم، كحرمة يومكم هذا، في بلدكم هذا، في شهركم هذا، ألا هل بلغت ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ اللهم اشهد، ثلاثا، ويلكم، أو ويحكم، انظروا لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4433,
			"arabicnumber": 4433,
			"text": "حدثنا يسرة بن صفوان بن جميل اللخمي، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة ـ رضى الله عنها ـ قالت دعا النبي صلى الله عليه وسلم فاطمة ـ عليها السلام ـ في شكواه الذي قبض فيه، فسارها بشىء، فبكت، ثم دعاها فسارها بشىء فضحكت فسألنا عن ذلك‏.‏ فقالت سارني النبي صلى الله عليه وسلم أنه يقبض في وجعه الذي توفي فيه فبكيت، ثم سارني فأخبرني أني أول أهله يتبعه فضحكت‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4443,
			"arabicnumber": 4443,
			"text": "وأخبرني عبيد الله بن عبد الله بن عتبة، أن عائشة، وعبد الله بن عباس، رضى الله عنهم قالا لما نزل برسول الله صلى الله عليه وسلم طفق يطرح خميصة له على وجهه، فإذا اغتم كشفها عن وجهه وهو كذلك يقول ‏ \"‏ لعنة الله على اليهود والنصارى، اتخذوا قبور أنبيائهم مساجد ‏\"‏‏.‏ يحذر ما صنعوا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4452,
			"arabicnumber": 4452,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني أبو سلمة، أن عائشة، أخبرته أن أبا بكر ـ رضى الله عنه ـ أقبل على فرس من مسكنه بالسنح حتى نزل، فدخل المسجد فلم يكلم الناس حتى دخل على عائشة، فتيمم رسول الله صلى الله عليه وسلم وهو مغشى بثوب حبرة، فكشف عن وجهه ثم أكب عليه فقبله وبكى‏.‏ ثم قال بأبي أنت وأمي، والله لا يجمع الله عليك موتتين، أما الموتة التي كتبت عليك فقد متها‏.‏ قال الزهري وحدثني أبو سلمة، عن عبد الله بن عباس، أن أبا بكر، خرج وعمر يكلم الناس فقال اجلس يا عمر، فأبى عمر أن يجلس‏.‏ فأقبل الناس إليه وتركوا عمر، فقال أبو بكر أما بعد من كان منكم يعبد محمدا صلى الله عليه وسلم فإن محمدا قد مات، ومن كان منكم يعبد الله فإن الله حى لا يموت، قال الله ‏{‏وما محمد إلا رسول قد خلت من قبله الرسل‏}‏ إلى قوله ‏{‏الشاكرين‏}‏ وقال والله لكأن الناس لم يعلموا أن الله أنزل هذه الآية حتى تلاها أبو بكر، فتلقاها منه الناس كلهم فما أسمع بشرا من الناس إلا يتلوها‏.‏ فأخبرني سعيد بن المسيب أن عمر قال والله ما هو إلا أن سمعت أبا بكر تلاها فعقرت حتى ما تقلني رجلاى، وحتى أهويت إلى الأرض حين سمعته تلاها أن النبي صلى الله عليه وسلم قد مات‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4454,
			"arabicnumber": 4454,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4455,
			"arabicnumber": 4455,
			"text": "حدثني عبد الله بن أبي شيبة، حدثنا يحيى بن سعيد، عن سفيان، عن موسى بن أبي عائشة، عن عبيد الله بن عبد الله بن عتبة، عن عائشة، وابن، عباس أن أبا بكر ـ رضى الله عنه ـ قبل النبي صلى الله عليه وسلم بعد موته‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4456,
			"arabicnumber": 4456,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4464,
			"arabicnumber": 4464,
			"text": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن عائشة، وابن، عباس رضى الله عنهم أن النبي صلى الله عليه وسلم لبث بمكة عشر سنين ينزل عليه القرآن، وبالمدينة عشرا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4513,
			"arabicnumber": 4513,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الوهاب، حدثنا عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أتاه رجلان في فتنة ابن الزبير فقالا إن الناس قد ضيعوا، وأنت ابن عمر وصاحب النبي صلى الله عليه وسلم فما يمنعك أن تخرج فقال يمنعني أن الله حرم دم أخي‏.‏ فقالا ألم يقل الله ‏{‏وقاتلوهم حتى لا تكون فتنة ‏}‏ فقال قاتلنا حتى لم تكن فتنة، وكان الدين لله، وأنتم تريدون أن تقاتلوا حتى تكون فتنة، ويكون الدين لغير الله‏.‏ وزاد عثمان بن صالح عن ابن وهب، قال أخبرني فلان، وحيوة بن شريح، عن بكر بن عمرو المعافري، أن بكير بن عبد الله، حدثه عن نافع، أن رجلا، أتى ابن عمر فقال يا أبا عبد الرحمن ما حملك على أن تحج عاما وتعتمر عاما، وتترك الجهاد في سبيل الله عز وجل، وقد علمت ما رغب الله فيه قال يا ابن أخي بني الإسلام على خمس إيمان بالله ورسوله، والصلاة الخمس، وصيام رمضان، وأداء الزكاة، وحج البيت‏.‏ قال يا أبا عبد الرحمن، ألا تسمع ما ذكر الله في كتابه ‏{‏وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما‏}‏ ‏{‏إلى أمر الله‏}‏ ‏{‏قاتلوهم حتى لا تكون فتنة‏}‏ قال فعلنا على عهد رسول الله صلى الله عليه وسلم وكان الإسلام قليلا، فكان الرجل يفتن في دينه إما قتلوه، وإما يعذبوه، حتى كثر الإسلام فلم تكن فتنة‏.‏ قال فما قولك في علي وعثمان قال أما عثمان فكأن الله عفا عنه، وأما أنتم فكرهتم أن تعفوا عنه، وأما علي فابن عم رسول الله صلى الله عليه وسلم وختنه‏.‏ وأشار بيده فقال هذا بيته حيث ترون‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4514,
			"arabicnumber": 4514,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4524,
			"arabicnumber": 4524,
			"text": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن ابن جريج، قال سمعت ابن أبي مليكة، يقول قال ابن عباس ـ رضى الله عنهما ـ ‏{‏حتى إذا استيأس الرسل وظنوا أنهم قد كذبوا‏}‏ خفيفة، ذهب بها هناك، وتلا ‏{‏حتى يقول الرسول والذين آمنوا معه متى نصر الله ألا إن نصر الله قريب‏}‏ فلقيت عروة بن الزبير فذكرت له ذلك فقال قالت عائشة معاذ الله، والله ما وعد الله رسوله من شىء قط إلا علم أنه كائن قبل أن يموت، ولكن لم يزل البلاء بالرسل حتى خافوا أن يكون من معهم يكذبونهم، فكانت تقرؤها ‏{‏وظنوا أنهم قد كذبوا‏}‏ مثقلة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4526,
			"arabicnumber": 4526,
			"text": "حدثنا إسحاق، أخبرنا النضر بن شميل، أخبرنا ابن عون، عن نافع، قال كان ابن عمر ـ رضى الله عنهما ـ إذا قرأ القرآن لم يتكلم حتى يفرغ منه، فأخذت عليه يوما، فقرأ سورة البقرة حتى انتهى إلى مكان قال تدري فيما أنزلت‏.‏ قلت لا‏.‏ قال أنزلت في كذا وكذا‏.‏ ثم مضى‏.‏ وعن عبد الصمد، حدثني أبي، حدثني أيوب، عن نافع، عن ابن عمر، ‏{‏فأتوا حرثكم أنى شئتم‏}‏ قال يأتيها في‏.‏ رواه محمد بن يحيى بن سعيد عن أبيه عن عبيد الله عن نافع عن ابن عمر‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4549,
			"arabicnumber": 4549,
			"text": "حدثنا حجاج بن منهال، حدثنا أبو عوانة، عن الأعمش، عن أبي وائل، عن عبد الله بن مسعود ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف يمين صبر ليقتطع بها مال امرئ مسلم، لقي الله وهو عليه غضبان ‏\"‏‏.‏ فأنزل الله تصديق ذلك ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا أولئك لا خلاق لهم في الآخرة‏}‏ إلى آخر الآية‏.‏ قال فدخل الأشعث بن قيس وقال ما يحدثكم أبو عبد الرحمن قلنا كذا وكذا‏.‏ قال في أنزلت كانت لي بئر في أرض ابن عم لي قال النبي صلى الله عليه وسلم ‏\"‏ بينتك أو يمينه ‏\"‏ فقلت إذا يحلف يا رسول الله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ من حلف على يمين صبر يقتطع بها مال امرئ مسلم وهو فيها فاجر، لقي الله وهو عليه غضبان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4828,
			"arabicnumber": 4828,
			"text": "حدثنا أحمد، حدثنا ابن وهب، أخبرنا عمرو، أن أبا النضر، حدثه عن سليمان بن يسار، عن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم قالت ما رأيت رسول الله صلى الله عليه وسلم ضاحكا حتى أرى منه لهواته، إنما كان يتبسم‏.‏ قالت وكان إذا رأى غيما أو ريحا عرف في وجهه‏.‏ قالت يا رسول الله إن الناس إذا رأوا الغيم فرحوا، رجاء أن يكون فيه المطر، وأراك إذا رأيته عرف في وجهك الكراهية‏.‏ فقال ‏\"‏ يا عائشة ما يؤمني أن يكون فيه عذاب عذب قوم بالريح، وقد رأى قوم العذاب فقالوا ‏{‏هذا عارض ممطرنا‏}‏‏\"‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4879,
			"arabicnumber": 4879,
			"text": "حدثنا محمد بن المثنى، قال حدثني عبد العزيز بن عبد الصمد، حدثنا أبو عمران الجوني، عن أبي بكر بن عبد الله بن قيس، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن في الجنة خيمة من لؤلؤة مجوفة، عرضها ستون ميلا، في كل زاوية منها أهل، ما يرون الآخرين يطوف عليهم المؤمنون ‏\"‏‏.‏ ‏\"‏ وجنتان من فضة، آنيتهما وما فيهما، وجنتان من كذا آنيتهما، وما فيهما، وما بين القوم وبين أن ينظروا إلى ربهم إلا رداء الكبر على وجهه في جنة عدن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4931.2,
			"arabicnumber": 4931.2,
			"text": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن إبراهيم، عن الأسود، قال قال عبد الله بينا نحن مع رسول الله صلى الله عليه وسلم في غار إذ نزلت عليه والمرسلات فتلقيناها من فيه وإن فاه لرطب بها إذ خرجت حية فقال رسول الله صلى الله عليه وسلم ‏\"‏ عليكم اقتلوها ‏\"‏‏.‏ قال فابتدرناها فسبقتنا ـ قال ـ فقال ‏\"‏ وقيت شركم، كما وقيتم شرها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4945.2,
			"arabicnumber": 4945.2,
			"text": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا الأعمش، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن علي ـ رضى الله عنه ـ قال كنا قعودا عند النبي صلى الله عليه وسلم فذكر الحديث‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 4978,
			"arabicnumber": 4978,
			"text": "حدثنا عبيد الله بن موسى، عن شيبان، عن يحيى، عن أبي سلمة، قال أخبرتني عائشة، وابن، عباس رضى الله عنهم قالا لبث النبي صلى الله عليه وسلم بمكة عشر سنين ينزل عليه القرآن وبالمدينة عشر سنين",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5032.2,
			"arabicnumber": 5032.2,
			"text": "حدثنا عثمان، حدثنا جرير، عن منصور، مثله‏.‏ تابعه بشر عن ابن المبارك، عن شعبة،‏.‏ وتابعه ابن جريج عن عبدة، عن شقيق، سمعت عبد الله، سمعت النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5037.2,
			"arabicnumber": 5037.2,
			"text": "حدثنا محمد بن عبيد بن ميمون، حدثنا عيسى، عن هشام، وقال، أسقطتهن من سورة كذا‏.‏ تابعه علي بن مسهر وعبدة عن هشام‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5051.2,
			"arabicnumber": 5051.2,
			"text": "قال علي قال سفيان أخبرنا منصور، عن إبراهيم، عن عبد الرحمن بن يزيد، أخبره علقمة، عن أبي مسعود، ولقيته، وهو يطوف بالبيت فذكر قول النبي صلى الله عليه وسلم ‏ \"‏ أن من قرأ بالآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5110,
			"arabicnumber": 5110,
			"text": "حدثنا عبدان، أخبرنا عبد الله، قال أخبرني يونس، عن الزهري، قال حدثني قبيصة بن ذؤيب، أنه سمع أبا هريرة، يقول نهى النبي صلى الله عليه وسلم أن تنكح المرأة على عمتها والمرأة وخالتها‏.‏ فنرى خالة أبيها بتلك المنزلة‏.‏ لأن عروة حدثني عن عائشة، قالت حرموا من الرضاعة ما يحرم من النسب‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5117,
			"arabicnumber": 5117,
			"text": "حدثنا علي، حدثنا سفيان، قال عمرو عن الحسن بن محمد، عن جابر بن عبد الله، وسلمة بن الأكوع، قالا كنا في جيش فأتانا رسول الله صلى الله عليه وسلم فقال ‏ \"‏ إنه قد أذن لكم أن تستمتعوا فاستمتعوا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5143,
			"arabicnumber": 5143,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن جعفر بن ربيعة، عن الأعرج، قال قال أبو هريرة يأثر عن النبي صلى الله عليه وسلم قال ‏ \"‏ إياكم والظن، فإن الظن أكذب الحديث، ولا تجسسوا، ولا تحسسوا، ولا تباغضوا، وكونوا إخوانا ‏\"‏‏.‏ ولا يخطب الرجل على خطبة أخيه حتى ينكح أو يترك",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5185,
			"arabicnumber": 5185,
			"text": "حدثنا إسحاق بن نصر، حدثنا حسين الجعفي، عن زائدة، عن ميسرة، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذي جاره ‏\"‏‏.‏ واستوصوا بالنساء خيرا فإنهن خلقن من ضلع وإن أعوج شيء في الضلع أعلاه فإن ذهبت تقيمه كسرته وإن تركته لم يزل أعوج فاستوصوا بالنساء خيرا",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5208,
			"arabicnumber": 5208,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال عمرو أخبرني عطاء، سمع جابرا، رضى الله عنه قال كنا نعزل والقرآن ينزل‏.‏ وعن عمرو، عن عطاء، عن جابر، قال كنا نعزل على عهد النبي صلى الله عليه وسلم والقرآن ينزل‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5271,
			"arabicnumber": 5271,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني أبو سلمة بن عبد الرحمن، وسعيد بن المسيب، أن أبا هريرة، قال أتى رجل من أسلم رسول الله صلى الله عليه وسلم وهو في المسجد فناداه فقال يا رسول الله إن الأخر قد زنى ـ يعني نفسه ـ فأعرض عنه فتنحى لشق وجهه الذي أعرض قبله فقال يا رسول الله إن الأخر قد زنى فأعرض عنه فتنحى لشق وجهه الذي أعرض قبله فقال له ذلك فأعرض عنه فتنحى له الرابعة، فلما شهد على نفسه أربع شهادات دعاه فقال ‏\"‏ هل بك جنون ‏\"‏‏.‏ قال لا‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اذهبوا به فارجموه ‏\"‏‏.‏ وكان قد أحصن‏.‏ وعن الزهري، قال أخبرني من، سمع جابر بن عبد الله الأنصاري، قال كنت فيمن رجمه فرجمناه بالمصلى بالمدينة، فلما أذلقته الحجارة جمز حتى أدركناه بالحرة، فرجمناه حتى مات‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5321,
			"arabicnumber": 5321,
			"text": "حدثنا إسماعيل، حدثنا مالك، عن يحيى بن سعيد، عن القاسم بن محمد، أنه سمعه يذكر، أن يحيى بن سعيد بن العاص، طلق بنت عبد الرحمن بن الحكم، فانتقلها عبد الرحمن، فأرسلت عائشة أم المؤمنين إلى مروان وهو أمير المدينة اتق الله وارددها إلى بيتها‏.‏ قال مروان في حديث سليمان إن عبد الرحمن بن الحكم غلبني‏.‏ وقال القاسم بن محمد أوما بلغك شأن فاطمة بنت قيس قالت لا يضرك أن لا تذكر حديث فاطمة‏.‏ فقال مروان بن الحكم إن كان بك شر فحسبك ما بين هذين من الشر‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5323,
			"arabicnumber": 5323,
			"text": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أنها قالت ما لفاطمة ألا تتقي الله، يعني في قولها لا سكنى ولا نفقة",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5325,
			"arabicnumber": 5325,
			"text": "حدثنا عمرو بن عباس، حدثنا ابن مهدي، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، قال عروة بن الزبير لعائشة ألم ترين إلى فلانة بنت الحكم طلقها زوجها البتة فخرجت‏.‏ فقالت بئس ما صنعت‏.‏ قال ألم تسمعي في قول فاطمة قالت أما إنه ليس لها خير في ذكر هذا الحديث‏.‏ وزاد ابن أبي الزناد عن هشام، عن أبيه، عابت عائشة أشد العيب وقالت إن فاطمة كانت في مكان وحش فخيف على ناحيتها، فلذلك أرخص لها النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5327,
			"arabicnumber": 5327,
			"text": "وحدثني حبان، أخبرنا عبد الله، أخبرنا ابن جريج، عن ابن شهاب، عن عروة، أن عائشة، أنكرت ذلك على فاطمة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5441.2,
			"arabicnumber": 5441.2,
			"text": "حدثنا محمد بن الصباح، حدثنا إسماعيل بن زكرياء، عن عاصم، عن أبي عثمان، عن أبي هريرة ـ رضى الله عنه ـ قسم النبي صلى الله عليه وسلم بيننا تمرا فأصابني منه خمس أربع تمرات وحشفة، ثم رأيت الحشفة هي أشدهن لضرسي‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5470.2,
			"arabicnumber": 5470.2,
			"text": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن محمد، عن أنس، وساق الحديث،‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5525,
			"arabicnumber": 5525,
			"text": "حدثنا مسدد، حدثنا يحيى، عن شعبة، قال حدثني عدي، عن البراء، وابن أبي أوفى، رضى الله عنهم قالا نهى النبي صلى الله عليه وسلم عن لحوم الحمر‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5641,
			"arabicnumber": 5641,
			"text": "حدثني عبد الله بن محمد، حدثنا عبد الملك بن عمرو، حدثنا زهير بن محمد، عن محمد بن عمرو بن حلحلة، عن عطاء بن يسار، عن أبي سعيد الخدري، وعن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما يصيب المسلم من نصب ولا وصب ولا هم ولا حزن ولا أذى ولا غم حتى الشوكة يشاكها، إلا كفر الله بها من خطاياه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5692,
			"arabicnumber": 5692,
			"text": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، قال سمعت الزهري، عن عبيد الله، عن أم قيس بنت محصن، قالت سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ عليكم بهذا العود الهندي، فإن فيه سبعة أشفية‏.‏ يستعط به من العذرة، ويلد به من ذات الجنب ‏\"‏‏.‏ ودخلت على النبي صلى الله عليه وسلم بابن لي لم يأكل الطعام فبال عليه، فدعا بماء فرش عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5698,
			"arabicnumber": 5698,
			"text": "حدثنا إسماعيل، قال حدثني سليمان، عن علقمة، أنه سمع عبد الرحمن الأعرج، أنه سمع عبد الله ابن بحينة، يحدث أن رسول الله صلى الله عليه وسلم احتجم بلحى جمل من طريق مكة، وهو محرم، في وسط رأسه‏.‏ وقال الأنصاري أخبرنا هشام بن حسان، حدثنا عكرمة، عن ابن عباس ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم احتجم في رأسه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5700,
			"arabicnumber": 5700,
			"text": "حدثني محمد بن بشار، حدثنا ابن أبي عدي، عن هشام، عن عكرمة، عن ابن عباس، احتجم النبي صلى الله عليه وسلم في رأسه وهو محرم من وجع كان به بماء يقال له لحى جمل‏.‏ وقال محمد بن سواء أخبرنا هشام، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم احتجم وهو محرم في رأسه من شقيقة كانت به‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5709,
			"arabicnumber": 5709,
			"text": "حدثنا علي بن عبد الله، حدثنا يحيى بن سعيد، حدثنا سفيان، قال حدثني موسى بن أبي عائشة، عن عبيد الله بن عبد الله، عن ابن عباس، وعائشة، أن أبا بكر ـ رضى الله عنه ـ قبل النبي صلى الله عليه وسلم وهو ميت‏.‏ قال وقالت عائشة لددناه في مرضه، فجعل يشير إلينا، أن لا تلدوني‏.‏ فقلنا كراهية المريض للدواء‏.‏ فلما أفاق قال ‏\"‏ ألم أنهكم أن تلدوني ‏\"‏‏.‏ قلنا كراهية المريض للدواء‏.‏ فقال ‏\"‏ لا يبقى في البيت أحد إلا لد ـ وأنا أنظر ـ إلا العباس فإنه لم يشهدكم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5710,
			"arabicnumber": 5710,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5711,
			"arabicnumber": 5711,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5719,
			"arabicnumber": 5719,
			"text": "حدثنا عارم، حدثنا حماد، قال قرئ على أيوب من كتب أبي قلابة، منه ما حدث به ومنه ما قرئ عليه، وكان هذا في الكتاب عن أنس أن أبا طلحة وأنس بن النضر كوياه، وكواه أبو طلحة بيده‏.‏ وقال عباد بن منصور عن أيوب، عن أبي قلابة، عن أنس بن مالك، قال أذن رسول الله صلى الله عليه وسلم لأهل بيت من الأنصار أن يرقوا من الحمة والأذن‏.‏ قال أنس كويت من ذات الجنب ورسول الله صلى الله عليه وسلم حى، وشهدني أبو طلحة وأنس بن النضر وزيد بن ثابت، وأبو طلحة كواني‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5720,
			"arabicnumber": 5720,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5759,
			"arabicnumber": 5759,
			"text": "حدثنا قتيبة، عن مالك، عن ابن شهاب، عن أبي سلمة، عن أبي هريرة ـ رضى الله عنه ـ أن امرأتين، رمت إحداهما الأخرى بحجر فطرحت جنينها، فقضى فيه النبي صلى الله عليه وسلم بغرة عبد أو وليدة‏.‏ وعن ابن شهاب، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم قضى في الجنين يقتل في بطن أمه بغرة عبد أو وليدة‏.‏ فقال الذي قضي عليه كيف أغرم من لا أكل، ولا شرب، ولا نطق، ولا استهل، ومثل ذلك بطل فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إنما هذا من إخوان الكهان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5773,
			"arabicnumber": 5773,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني أبو سلمة بن عبد الرحمن، أن أبا هريرة، قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا عدوى ‏\"‏‏.‏ قال أبو سلمة بن عبد الرحمن سمعت أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا توردوا الممرض على المصح ‏\"‏‏.‏ وعن الزهري، قال أخبرني سنان بن أبي سنان الدؤلي، أن أبا هريرة ـ رضى الله عنه ـ قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا عدوى ‏\"‏‏.‏ فقام أعرابي فقال أرأيت الإبل تكون في الرمال أمثال الظباء فيأتيه البعير الأجرب فتجرب‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ فمن أعدى الأول ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5774,
			"arabicnumber": 5774,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5780,
			"arabicnumber": 5780,
			"text": "حدثني عبد الله بن محمد، حدثنا سفيان، عن الزهري، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، رضى الله عنه قال نهى النبي صلى الله عليه وسلم عن أكل كل ذي ناب من السبع‏.‏ قال الزهري ولم أسمعه حتى أتيت الشأم‏.‏ وزاد الليث قال حدثني يونس، عن ابن شهاب، قال وسألته هل نتوضأ أو نشرب ألبان الأتن أو مرارة السبع أو أبوال الإبل‏.‏ قال قد كان المسلمون يتداوون بها، فلا يرون بذلك بأسا، فأما ألبان الأتن فقد بلغنا أن رسول الله صلى الله عليه وسلم نهى عن لحومها، ولم يبلغنا عن ألبانها أمر ولا نهى، وأما مرارة السبع قال ابن شهاب أخبرني أبو إدريس الخولاني أن أبا ثعلبة الخشني أخبره أن رسول الله صلى الله عليه وسلم نهى عن أكل كل ذي ناب من السبع‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5815,
			"arabicnumber": 5815,
			"text": "حدثني يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله بن عتبة، أن عائشة، وعبد الله بن عباس، رضى الله عنهم قالا لما نزل برسول الله صلى الله عليه وسلم طفق يطرح خميصة له على وجهه، فإذا اغتم كشفها عن وجهه، فقال وهو كذلك ‏ \"‏ لعنة الله على اليهود والنصارى اتخذوا قبور أنبيائهم مساجد ‏\"‏‏.‏ يحذر ما صنعوا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5908,
			"arabicnumber": 5908,
			"text": "حدثني عمرو بن علي، حدثنا معاذ بن هانئ، حدثنا همام، حدثنا قتادة، عن أنس بن مالك،‏.‏ أو عن رجل، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم ضخم القدمين، حسن الوجه، لم أر بعده مثله‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5911,
			"arabicnumber": 5911,
			"text": "وقال أبو هلال حدثنا قتادة، عن أنس،‏.‏ أو جابر بن عبد الله كان النبي صلى الله عليه وسلم ضخم الكفين والقدمين، لم أر بعده شبها له‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 5944.2,
			"arabicnumber": 5944.2,
			"text": "حدثني ابن بشار، حدثنا ابن مهدي، حدثنا سفيان، قال ذكرت لعبد الرحمن بن عابس حديث منصور عن إبراهيم، عن علقمة، عن عبد الله،، فقال سمعته من أم يعقوب، عن عبد الله، مثل حديث منصور‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6026,
			"arabicnumber": 6026,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن أبي بردة، بريد بن أبي بردة قال أخبرني جدي أبو بردة، عن أبيه أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ المؤمن للمؤمن كالبنيان، يشد بعضه بعضا ‏\"‏‏.‏ ثم شبك بين أصابعه‏.‏ وكان النبي صلى الله عليه وسلم جالسا إذ جاء رجل يسأل أو طالب حاجة أقبل علينا بوجهه فقال ‏\"‏ اشفعوا فلتؤجروا، وليقض الله على لسان نبيه ما شاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6073,
			"arabicnumber": 6073,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني عوف بن مالك بن الطفيل ـ هو ابن الحارث وهو ابن أخي عائشة زوج النبي صلى الله عليه وسلم لأمها ـ أن عائشة حدثت أن عبد الله بن الزبير قال في بيع أو عطاء أعطته عائشة والله لتنتهين عائشة، أو لأحجرن عليها‏.‏ فقالت أهو قال هذا قالوا نعم‏.‏ قالت هو لله على نذر، أن لا أكلم ابن الزبير أبدا‏.‏ فاستشفع ابن الزبير إليها، حين طالت الهجرة فقالت لا والله لا أشفع فيه أبدا، ولا أتحنث إلى نذري‏.‏ فلما طال ذلك على ابن الزبير كلم المسور بن مخرمة وعبد الرحمن بن الأسود بن عبد يغوث، وهما من بني زهرة، وقال لهما أنشدكما بالله لما أدخلتماني على عائشة، فإنها لا يحل لها أن تنذر قطيعتي‏.‏ فأقبل به المسور وعبد الرحمن مشتملين بأرديتهما حتى استأذنا على عائشة فقالا السلام عليك ورحمة الله وبركاته، أندخل قالت عائشة ادخلوا‏.‏ قالوا كلنا قالت نعم ادخلوا كلكم‏.‏ ولا تعلم أن معهما ابن الزبير، فلما دخلوا دخل ابن الزبير الحجاب، فاعتنق عائشة وطفق يناشدها ويبكي، وطفق المسور وعبد الرحمن يناشدانها إلا ما كلمته وقبلت منه، ويقولان إن النبي صلى الله عليه وسلم نهى عما قد علمت من الهجرة، فإنه لا يحل لمسلم أن يهجر أخاه فوق ثلاث ليال‏.‏ فلما أكثروا على عائشة من التذكرة والتحريج طفقت تذكرهما نذرها وتبكي وتقول إني نذرت، والنذر شديد‏.‏ فلم يزالا بها حتى كلمت ابن الزبير، وأعتقت في نذرها ذلك أربعين رقبة‏.‏ وكانت تذكر نذرها بعد ذلك فتبكي، حتى تبل دموعها خمارها‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6074,
			"arabicnumber": 6074,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6089,
			"arabicnumber": 6089,
			"text": "حدثنا ابن نمير، حدثنا ابن إدريس، عن إسماعيل، عن قيس، عن جرير، قال ما حجبني النبي صلى الله عليه وسلم منذ أسلمت، ولا رآني إلا تبسم في وجهي‏.‏ ولقد شكوت إليه أني لا أثبت على الخيل، فضرب بيده في صدري وقال ‏ \"‏ اللهم ثبته واجعله هاديا مهديا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6142,
			"arabicnumber": 6142,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد، هو ابن زيد ـ عن يحيى بن سعيد، عن بشير بن يسار، مولى الأنصار عن رافع بن خديج، وسهل بن أبي حثمة، أنهما حدثاه أن عبد الله بن سهل ومحيصة بن مسعود أتيا خيبر فتفرقا في النخل، فقتل عبد الله بن سهل، فجاء عبد الرحمن بن سهل وحويصة ومحيصة ابنا مسعود إلى النبي صلى الله عليه وسلم فتكلموا في أمر صاحبهم فبدأ عبد الرحمن، وكان أصغر القوم فقال النبي صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏‏.‏ ـ قال يحيى ليلي الكلام الأكبر ـ فتكلموا في أمر صاحبهم فقال النبي صلى الله عليه وسلم ‏\"‏ أتستحقون قتيلكم ـ أو قال صاحبكم ـ بأيمان خمسين منكم ‏\"‏‏.‏ قالوا يا رسول الله أمر لم نره‏.‏ قال ‏\"‏ فتبرئكم يهود في أيمان خمسين منهم ‏\"‏‏.‏ قالوا يا رسول الله قوم كفار‏.‏ فوداهم رسول الله صلى الله عليه وسلم من قبله‏.‏ قال سهل فأدركت ناقة من تلك الإبل، فدخلت مربدا لهم فركضتني برجلها‏.‏ قال الليث حدثني يحيى، عن بشير، عن سهل، قال يحيى حسبت أنه قال مع رافع بن خديج، وقال ابن عيينة حدثنا يحيى عن بشير عن سهل وحده‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6173,
			"arabicnumber": 6173,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني سالم بن عبد الله، أن عبد الله بن عمر، أخبره أن عمر بن الخطاب انطلق مع رسول الله صلى الله عليه وسلم في رهط من أصحابه قبل ابن صياد، حتى وجده يلعب مع الغلمان في أطم بني مغالة، وقد قارب ابن صياد يومئذ الحلم، فلم يشعر حتى ضرب رسول الله صلى الله عليه وسلم ظهره بيده ثم قال ‏\"‏ أتشهد أني رسول الله ‏\"‏‏.‏ فنظر إليه فقال أشهد أنك رسول الأميين‏.‏ ثم قال ابن صياد أتشهد أني رسول الله فرضه النبي صلى الله عليه وسلم ثم قال ‏\"‏ آمنت بالله ورسله ‏\"‏‏.‏ ثم قال لابن صياد ‏\"‏ ماذا ترى ‏\"‏‏.‏ قال يأتيني صادق وكاذب‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ خلط عليك الأمر ‏\"‏‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إني خبأت لك خبيئا ‏\"‏‏.‏ قال هو الدخ‏.‏ قال ‏\"‏ اخسأ، فلن تعدو قدرك ‏\"‏‏.‏ قال عمر يا رسول الله أتأذن لي فيه أضرب عنقه‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إن يكن هو لا تسلط عليه، وإن لم يكن هو فلا خير لك في قتله ‏\"‏‏.‏ قال سالم فسمعت عبد الله بن عمر، يقول انطلق بعد ذلك رسول الله صلى الله عليه وسلم وأبى بن كعب الأنصاري يؤمان النخل التي فيها ابن صياد، حتى إذا دخل رسول الله صلى الله عليه وسلم طفق رسول الله صلى الله عليه وسلم يتقي بجذوع النخل، وهو يختل أن يسمع من ابن صياد شيئا قبل أن يراه، وابن صياد مضطجع على فراشه في قطيفة له فيها رمرمة أو زمزمة، فرأت أم ابن صياد النبي صلى الله عليه وسلم وهو يتقي بجذوع النخل، فقالت لابن صياد أى صاف ـ وهو اسمه ـ هذا محمد‏.‏ فتناهى ابن صياد‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لو تركته بين ‏\"‏‏.‏ قال سالم قال عبد الله قام رسول الله صلى الله عليه وسلم في الناس فأثنى على الله بما هو أهله، ثم ذكر الدجال فقال ‏\"‏ إني أنذركموه، وما من نبي إلا وقد أنذر قومه، لقد أنذره نوح قومه، ولكني سأقول لكم فيه قولا لم يقله نبي لقومه، تعلمون أنه أعور، وأن الله ليس بأعور ‏\"‏‏. قال أبو عبد الله خسأت الكلب بعدته خاسئين مبعدين",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6174,
			"arabicnumber": 6174,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6282,
			"arabicnumber": 6282,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك ـ رضى الله عنه ـ أنه سمعه يقول كان رسول الله صلى الله عليه وسلم إذا ذهب إلى قباء يدخل على أم حرام بنت ملحان فتطعمه، وكانت تحت عبادة بن الصامت، فدخل يوما فأطعمته، فنام رسول الله صلى الله عليه وسلم ثم استيقظ يضحك‏.‏ قالت فقلت ما يضحكك يا رسول الله فقال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله، يركبون ثبج هذا البحر، ملوكا على الأسرة ‏\"‏‏.‏ ـ أو قال ‏\"‏ مثل الملوك على الأسرة ‏\"‏‏.‏ شك إسحاق ـ قلت ادع الله أن يجعلني منهم‏.‏ فدعا ثم وضع رأسه فنام، ثم استيقظ يضحك فقلت ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على، غزاة في سبيل الله، يركبون ثبج هذا البحر، ملوكا على الأسرة ‏\"‏‏.‏ أو ‏\"‏ مثل الملوك على الأسرة ‏\"‏‏.‏ فقلت ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏‏.‏ فركبت البحر زمان معاوية، فصرعت عن دابتها حين خرجت من البحر، فهلكت‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6285,
			"arabicnumber": 6285,
			"text": "حدثنا موسى، عن أبي عوانة، حدثنا فراس، عن عامر، عن مسروق، حدثتني عائشة أم المؤمنين، قالت إنا كنا أزواج النبي صلى الله عليه وسلم عنده جميعا، لم تغادر منا واحدة، فأقبلت فاطمة ـ عليها السلام ـ تمشي، لا والله ما تخفى مشيتها من مشية رسول الله صلى الله عليه وسلم فلما رآها رحب قال ‏\"‏ مرحبا بابنتي ‏\"‏‏.‏ ثم أجلسها عن يمينه أو عن شماله، ثم سارها فبكت بكاء شديدا، فلما رأى حزنها سارها الثانية إذا هي تضحك‏.‏ فقلت لها أنا من بين نسائه خصك رسول الله صلى الله عليه وسلم بالسر من بيننا، ثم أنت تبكين، فلما قام رسول الله صلى الله عليه وسلم سألتها عما سارك قالت ما كنت لأفشي على رسول الله صلى الله عليه وسلم سره‏.‏ فلما توفي قلت لها عزمت عليك بما لي عليك من الحق لما أخبرتني‏.‏ قالت أما الآن فنعم‏.‏ فأخبرتني قالت أما حين سارني في الأمر الأول، فإنه أخبرني أن جبريل كان يعارضه بالقرآن كل سنة مرة ‏\"‏ وإنه قد عارضني به العام مرتين، ولا أرى الأجل إلا قد اقترب، فاتقي الله واصبري، فإني نعم السلف أنا لك ‏\"‏‏.‏ قالت فبكيت بكائي الذي رأيت، فلما رأى جزعي سارني الثانية قال ‏\"‏ يا فاطمة ألا ترضين أن تكوني سيدة نساء المؤمنين ـ أو ـ سيدة نساء هذه الأمة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6378,
			"arabicnumber": 6378,
			"text": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، قال سمعت قتادة، عن أنس، عن أم سليم، أنها قالت يا رسول الله أنس خادمك ادع الله له قال ‏ \"‏ اللهم أكثر ماله وولده، وبارك له فيما أعطيته ‏\"‏‏.‏ وعن هشام بن زيد، سمعت أنس بن مالك، مثله",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6380,
			"arabicnumber": 6380,
			"text": "حدثنا أبو زيد، سعيد بن الربيع حدثنا شعبة، عن قتادة، قال سمعت أنسا ـ رضى الله عنه ـ قال قالت أم سليم أنس خادمك‏.‏ قال ‏ \"‏ اللهم أكثر ماله وولده، وبارك له فيما أعطيته ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6567,
			"arabicnumber": 6567,
			"text": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس، أن أم حارثة، أتت رسول الله صلى الله عليه وسلم وقد هلك حارثة يوم بدر، أصابه غرب سهم‏.‏ فقالت يا رسول الله قد علمت موقع حارثة من قلبي، فإن كان في الجنة لم أبك عليه، وإلا سوف ترى ما أصنع‏.‏ فقال لها ‏ \"‏ هبلت، أجنة واحدة هي إنها جنان كثيرة، وإنه في الفردوس الأعلى ‏\"‏‏.‏ (وقال ‏:‏غدوة في سبيل الله أو روحة خير من الدنيا وما فيها، ولقاب قوس أحدكم أو موضع قدم من الجنة خير من الدنيا وما فيها، ولو أن امرأة من نساء أهل الجنة اطلعت إلى الأرض، لأضاءت ما بينهما، ولملأت ما بينهما ريحا، ولنصيفها ـ يعني الخمار ـ خير من الدنيا وما فيها‏)‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6599,
			"arabicnumber": 6599,
			"text": "حدثني إسحاق، أخبرنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما من مولود إلا يولد على الفطرة، فأبواه يهودانه وينصرانه، كما تنتجون البهيمة، هل تجدون فيها من جدعاء حتى تكونوا أنتم تجدعونها ‏\"‏‏.‏ قالوا يا رسول الله أفرأيت من يموت وهو صغير قال ‏{‏الله أعلم بما كانوا عاملين‏}‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6633,
			"arabicnumber": 6633,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، وزيد بن خالد، أنهما أخبراه أن رجلين اختصما إلى رسول الله صلى الله عليه وسلم فقال أحدهما اقض بيننا بكتاب الله‏.‏ وقال الآخر وهو أفقههما أجل يا رسول الله فاقض بيننا بكتاب الله، وائذن لي أن أتكلم‏.‏ قال ‏\"‏ تكلم ‏\"‏‏.‏ قال إن ابني كان عسيفا على هذا ـ قال مالك والعسيف الأجير ـ زنى بامرأته، فأخبروني أن على ابني الرجم، فافتديت منه بمائة شاة وجارية لي، ثم إني سألت أهل العلم فأخبروني أن ما على ابني جلد مائة وتغريب عام، وإنما الرجم على امرأته‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما والذي نفسي بيده لأقضين بينكما بكتاب الله، أما غنمك وجاريتك فرد عليك ‏\"‏‏.‏ وجلد ابنه مائة وغربه عاما، وأمر أنيس الأسلمي أن يأتي امرأة الآخر، فإن اعترفت رجمها، فاعترفت فرجمها‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6659,
			"arabicnumber": 6659,
			"text": "حدثني محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن سليمان، ومنصور، عن أبي وائل، عن عبد الله ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين كاذبة، ليقتطع بها مال رجل مسلم أو قال أخيه لقي الله وهو عليه غضبان ‏\"‏‏.‏ فأنزل الله تصديقه ‏{‏إن الذين يشترون بعهد الله‏}‏ قال سليمان في حديثه فمر الأشعث بن قيس فقال ما يحدثكم عبد الله قالوا له فقال الأشعث نزلت في، وفي صاحب لي، في بئر كانت بيننا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6676,
			"arabicnumber": 6676,
			"text": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن الأعمش، عن أبي وائل، عن عبد الله ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين صبر، يقتطع بها مال امرئ مسلم، لقي الله وهو عليه غضبان ‏\"‏‏.‏ فأنزل الله تصديق ذلك ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ إلى آخر الآية‏.‏ فدخل الأشعث بن قيس فقال ما حدثكم أبو عبد الرحمن، فقالوا كذا وكذا‏.‏ قال في أنزلت، كانت لي بئر في أرض ابن عم لي فأتيت رسول الله صلى الله عليه وسلم فقال ‏\"‏ بينتك أو يمينه ‏\"‏‏.‏ قلت إذا يحلف عليها يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين صبر، وهو فيها فاجر، يقتطع بها مال امرئ مسلم، لقي الله يوم القيامة، وهو عليه غضبان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6725,
			"arabicnumber": 6725,
			"text": "حدثنا عبد الله بن محمد، حدثنا هشام، أخبرنا معمر، عن الزهري، عن عروة، عن عائشة، أن فاطمة، والعباس ـ عليهما السلام ـ أتيا أبا بكر يلتمسان ميراثهما من رسول الله صلى الله عليه وسلم وهما حينئذ يطلبان أرضيهما من فدك، وسهمهما من خيبر‏.‏ فقال لهما أبو بكر سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا نورث، ما تركنا صدقة، إنما يأكل آل محمد من هذا المال ‏\"‏‏.‏ قال أبو بكر والله لا أدع أمرا رأيت رسول الله صلى الله عليه وسلم يصنعه فيه إلا صنعته‏.‏ قال فهجرته فاطمة، فلم تكلمه حتى ماتت‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6766,
			"arabicnumber": 6766,
			"text": "حدثنا مسدد، حدثنا خالد ـ هو ابن عبد الله ـ حدثنا خالد، عن أبي عثمان، عن سعد ـ رضى الله عنه ـ قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ من ادعى إلى غير أبيه، وهو يعلم أنه غير أبيه، فالجنة عليه حرام ‏\"‏‏.‏ فذكرته لأبي بكرة فقال وأنا سمعته أذناى، ووعاه، قلبي من رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6815,
			"arabicnumber": 6815,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن أبي سلمة، وسعيد بن المسيب، عن أبي هريرة ـ رضى الله عنه ـ قال أتى رجل رسول الله صلى الله عليه وسلم وهو في المسجد فناداه فقال يا رسول الله إني زنيت‏.‏ فأعرض عنه، حتى ردد عليه أربع مرات، فلما شهد على نفسه أربع شهادات، دعاه النبي صلى الله عليه وسلم فقال ‏\"‏ أبك جنون ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فهل أحصنت ‏\"‏‏.‏ قال نعم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اذهبوا به فارجموه ‏\"‏‏.‏ قال ابن شهاب فأخبرني من، سمع جابر بن عبد الله، قال فكنت فيمن رجمه فرجمناه بالمصلى، فلما أذلقته الحجارة هرب، فأدركناه بالحرة فرجمناه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6826,
			"arabicnumber": 6826,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6827,
			"arabicnumber": 6827,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال حفظناه من في الزهري قال أخبرني عبيد الله أنه سمع أبا هريرة وزيد بن خالد قالا كنا عند النبي صلى الله عليه وسلم فقام رجل فقال أنشدك الله إلا قضيت بيننا بكتاب الله‏.‏ فقام خصمه ـ وكان أفقه منه ـ فقال اقض بيننا بكتاب الله وأذن لي‏.‏ قال ‏\"‏ قل ‏\"‏‏.‏ قال إن ابني كان عسيفا على هذا، فزنى بامرأته، فافتديت منه بمائة شاة وخادم، ثم سألت رجالا من أهل العلم، فأخبروني أن على ابني جلد مائة وتغريب عام، وعلى امرأته الرجم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله جل ذكره، المائة شاة والخادم رد، وعلى ابنك جلد مائة وتغريب عام، واغد يا أنيس على امرأة هذا، فإن اعترفت فارجمها ‏\"‏‏.‏ فغدا عليها فاعترفت فرجمها‏.‏ قلت لسفيان لم يقل فأخبروني أن على ابني الرجم‏.‏ فقال أشك فيها من الزهري، فربما قلتها وربما سكت‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6831,
			"arabicnumber": 6831,
			"text": "حدثنا مالك بن إسماعيل، حدثنا عبد العزيز، أخبرنا ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن زيد بن خالد الجهني، قال سمعت النبي صلى الله عليه وسلم يأمر فيمن زنى ولم يحصن جلد مائة وتغريب عام‏.‏ قال ابن شهاب وأخبرني عروة بن الزبير، أن عمر بن الخطاب، غرب، ثم لم تزل تلك السنة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6835,
			"arabicnumber": 6835,
			"text": "حدثنا عاصم بن علي، حدثنا ابن أبي ذئب، عن الزهري، عن عبيد الله، عن أبي هريرة، وزيد بن خالد، أن رجلا، من الأعراب جاء إلى النبي صلى الله عليه وسلم وهو جالس فقال يا رسول الله اقض بكتاب الله‏.‏ فقام خصمه فقال صدق اقض له يا رسول الله بكتاب الله، إن ابني كان عسيفا على هذا فزنى بامرأته فأخبروني أن على ابني الرجم، فافتديت بمائة من الغنم ووليدة، ثم سألت أهل العلم، فزعموا أن ما على ابني جلد مائة وتغريب عام‏.‏ فقال ‏ \"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله، أما الغنم والوليدة فرد عليك، وعلى ابنك جلد مائة وتغريب عام، وأما أنت يا أنيس فاغد على امرأة هذا فارجمها ‏\"‏‏.‏ فغدا أنيس فرجمها‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6837,
			"arabicnumber": 6837,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عبيد الله بن عبد الله، عن أبي هريرة، وزيد بن خالد، رضى الله عنهما أن رسول الله صلى الله عليه وسلم سئل عن الأمة إذا زنت ولم تحصن قال ‏ \"‏ إذا زنت فاجلدوها، ثم إن زنت فاجلدوها، ثم إن زنت فاجلدوها، ثم بيعوها ولو بضفير ‏\"‏‏.‏ قال ابن شهاب لا أدري بعد الثالثة أو الرابعة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6842,
			"arabicnumber": 6842,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، وزيد بن خالد، أنهما أخبراه أن رجلين اختصما إلى رسول الله صلى الله عليه وسلم فقال أحدهما اقض بيننا بكتاب الله‏.‏ وقال الآخر وهو أفقههما أجل يا رسول الله فاقض بيننا بكتاب الله، وأذن لي أن أتكلم‏.‏ قال ‏\"‏ تكلم ‏\"‏‏.‏ قال إن ابني كان عسيفا على هذا ـ قال مالك والعسيف الأجير ـ فزنى بامرأته، فأخبروني أن على ابني الرجم، فافتديت منه بمائة شاة وبجارية لي، ثم إني سألت أهل العلم فأخبروني أن ما على ابني جلد مائة وتغريب عام، وإنما الرجم على امرأته‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما والذي نفسي بيده لأقضين بينكما بكتاب الله، أما غنمك وجاريتك فرد عليك ‏\"‏‏.‏ وجلد ابنه مائة وغربه عاما، وأمر أنيسا الأسلمي أن يأتي امرأة الآخر، فإن اعترفت فارجمها، فاعترفت فرجمها‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6859,
			"arabicnumber": 6859,
			"text": "حدثنا محمد بن يوسف، حدثنا ابن عيينة، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، وزيد بن خالد الجهني، قالا جاء رجل إلى النبي صلى الله عليه وسلم فقال أنشدك الله إلا قضيت بيننا بكتاب الله‏.‏ فقام خصمه وكان أفقه منه فقال صدق، اقض بيننا بكتاب الله، وأذن لي يا رسول الله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قل ‏\"‏‏.‏ فقال إن ابني كان عسيفا في أهل، هذا فزنى بامرأته، فافتديت منه بمائة شاة وخادم وإني سألت رجالا من أهل العلم فأخبروني أن على ابني جلد مائة وتغريب عام، وأن على امرأة هذا الرجم‏.‏ فقال ‏\"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله، المائة والخادم رد عليك، وعلى ابنك جلد مائة وتغريب عام، ويا أنيس اغد على امرأة هذا فسلها، فإن اعترفت فارجمها ‏\"‏‏.‏ فاعترفت فرجمها‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6865,
			"arabicnumber": 6865,
			"text": "حدثنا عبدان، حدثنا عبد الله، حدثنا يونس، عن الزهري، حدثنا عطاء بن يزيد، أن عبيد الله بن عدي، حدثه أن المقداد بن عمرو الكندي حليف بني زهرة حدثه وكان، شهد بدرا مع النبي صلى الله عليه وسلم أنه قال يا رسول الله إن لقيت كافرا فاقتتلنا، فضرب يدي بالسيف فقطعها، ثم لاذ بشجرة وقال أسلمت لله‏.‏ آقتله بعد أن قالها قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله ‏\"‏‏.‏ قال يا رسول الله فإنه طرح إحدى يدى، ثم قال بعد ما قطعها، آقتله قال ‏\"‏ لا تقتله، فإن قتلته فإنه بمنزلتك قبل أن تقتله، وأنت بمنزلته قبل أن يقول كلمته التي قال ‏\"‏‏.‏ وقال حبيب بن أبي عمرة عن سعيد، عن ابن عباس، قال قال النبي صلى الله عليه وسلم للمقداد ‏\"‏ إذا كان رجل مؤمن يخفي إيمانه مع قوم كفار، فأظهر إيمانه، فقتلته، فكذلك كنت أنت تخفي إيمانك بمكة من قبل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6887,
			"arabicnumber": 6887,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، أن الأعرج، حدثه أنه، سمع أبا هريرة، يقول إنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ نحن الآخرون السابقون يوم القيامة ‏\"‏‏.‏ وبإسناده ‏\"‏ لو اطلع في بيتك أحد ولم تأذن له، خذفته بحصاة ففقأت عينه، ما كان عليك من جناح ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6895.2,
			"arabicnumber": 6895.2,
			"text": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن قتادة، عن عكرمة، عن ابن عباس، قال سمعت النبي صلى الله عليه وسلم نحوه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6905,
			"arabicnumber": 6905,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا هشام، عن أبيه، عن المغيرة بن شعبة، عن عمر ـ رضى الله عنه ـ أنه استشارهم في إملاص المرأة فقال المغيرة قضى النبي صلى الله عليه وسلم بالغرة عبد أو أمة‏.‏ فقال ائت من يشهد معك، فشهد محمد بن مسلمة أنه شهد النبي صلى الله عليه وسلم قضى به‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6907,
			"arabicnumber": 6907,
			"text": "حدثنا عبيد الله بن موسى، عن هشام، عن أبيه، أن عمر، نشد الناس من سمع النبي صلى الله عليه وسلم قضى في السقط وقال المغيرة أنا سمعته قضى فيه بغرة عبد أو أمة‏.‏ قال ائت من يشهد معك على هذا فقال محمد بن مسلمة أنا أشهد على النبي صلى الله عليه وسلم بمثل هذا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6908.2,
			"arabicnumber": 6908.2,
			"text": "حدثني محمد بن عبد الله، حدثنا محمد بن سابق، حدثنا زائدة، حدثنا هشام بن عروة، عن أبيه، أنه سمع المغيرة بن شعبة، يحدث عن عمر، أنه استشارهم في إملاص المرأة مثله‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6924,
			"arabicnumber": 6924,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، أخبرني عبيد الله بن عبد الله بن عتبة، أن أبا هريرة، قال لما توفي النبي صلى الله عليه وسلم واستخلف أبو بكر، وكفر من كفر من العرب، قال عمر يا أبا بكر، كيف تقاتل الناس، وقد قال رسول الله صلى الله عليه وسلم ‏ \"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله‏.‏ فمن قال لا إله إلا الله‏.‏ عصم مني ماله ونفسه، إلا بحقه، وحسابه على الله ‏\"‏‏.‏ قال أبو بكر والله لأقاتلن من فرق بين الصلاة والزكاة، فإن الزكاة حق المال، والله لو منعوني عناقا كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعها‏.‏ قال عمر فوالله ما هو إلا أن رأيت أن قد شرح الله صدر أبي بكر للقتال فعرفت أنه الحق‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 6957,
			"arabicnumber": 6957,
			"text": "حدثني إسحاق، حدثنا عبد الرزاق، حدثنا معمر، عن همام، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يكون كنز أحدكم يوم القيامة شجاعا أقرع، يفر منه صاحبه فيطلبه ويقول أنا كنزك‏.‏ قال والله لن يزال يطلبه حتى يبسط يده فيلقمها فاه ‏\"‏‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ما رب النعم لم يعط حقها، تسلط عليه يوم القيامة، تخبط وجهه بأخفافها ‏\"‏‏.‏ وقال بعض الناس في رجل له إبل، فخاف أن تجب عليه الصدقة، فباعها بإبل مثلها، أو بغنم، أو ببقر، أو بدراهم، فرارا من الصدقة بيوم، احتيالا فلا بأس عليه، وهو يقول إن زكى إبله قبل أن يحول الحول بيوم أو بسنة، جازت عنه‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7001,
			"arabicnumber": 7001,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يدخل على أم حرام بنت ملحان، وكانت تحت عبادة بن الصامت، فدخل عليها يوما فأطعمته، وجعلت تفلي رأسه، فنام رسول الله صلى الله عليه وسلم ثم استيقظ وهو يضحك‏.‏ قالت فقلت ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على، غزاة في سبيل الله، يركبون ثبج هذا البحر، ملوكا على الأسرة أو مثل الملوك على الأسرة ‏\"‏‏.‏ شك إسحاق‏.‏ قالت فقلت يا رسول الله ادع الله أن يجعلني منهم، فدعا لها رسول الله صلى الله عليه وسلم ثم وضع رأسه ثم استيقظ وهو يضحك‏.‏ فقلت ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على، غزاة في سبيل الله ‏\"‏‏.‏ كما قال في الأولى‏.‏ قالت فقلت يا رسول الله ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏‏.‏ فركبت البحر في زمان معاوية بن أبي سفيان فصرعت عن دابتها حين خرجت من البحر، فهلكت‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7015,
			"arabicnumber": 7015,
			"text": "حدثنا معلى بن أسد، حدثنا وهيب، عن أيوب، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال رأيت في المنام كأن في يدي سرقة من حرير لا أهوي بها إلى مكان في الجنة إلا طارت بي إليه، فقصصتها على حفصة‏.‏ فقصتها حفصة على النبي صلى الله عليه وسلم فقال ‏\"‏ إن أخاك رجل صالح ‏\"‏‏.‏ أو قال ‏\"‏ إن عبد الله رجل صالح ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7028,
			"arabicnumber": 7028,
			"text": "حدثني عبيد الله بن سعيد، حدثنا عفان بن مسلم، حدثنا صخر بن جويرية، حدثنا نافع، أن ابن عمر، قال إن رجالا من أصحاب رسول الله صلى الله عليه وسلم كانوا يرون الرؤيا على عهد رسول الله صلى الله عليه وسلم فيقصونها على رسول الله صلى الله عليه وسلم فيقول فيها رسول الله صلى الله عليه وسلم ما شاء الله، وأنا غلام حديث السن وبيتي المسجد قبل أن أنكح، فقلت في نفسي لو كان فيك خير لرأيت مثل ما يرى هؤلاء‏.‏ فلما اضطجعت ليلة قلت اللهم إن كنت تعلم في خيرا فأرني رؤيا‏.‏ فبينما أنا كذلك إذ جاءني ملكان في يد كل واحد منهما مقمعة من حديد، يقبلا بي إلى جهنم، وأنا بينهما أدعو الله اللهم أعوذ بك من جهنم‏.‏ ثم أراني لقيني ملك في يده مقمعة من حديد فقال لن تراع، نعم الرجل أنت لو تكثر الصلاة‏.‏ فانطلقوا بي حتى وقفوا بي على شفير جهنم فإذا هي مطوية كطى البئر، له قرون كقرن البئر، بين كل قرنين ملك بيده مقمعة من حديد، وأرى فيها رجالا معلقين بالسلاسل، رءوسهم أسفلهم، عرفت فيها رجالا من قريش، فانصرفوا بي عن ذات اليمين‏.‏ فقصصتها على حفصة فقصتها حفصة على رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إن عبد الله رجل صالح ‏\"‏‏.‏ فقال نافع لم يزل بعد ذلك يكثر الصلاة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7030,
			"arabicnumber": 7030,
			"text": "حدثني عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن سالم، عن ابن عمر، قال كنت غلاما شابا عزبا في عهد النبي صلى الله عليه وسلم وكنت أبيت في المسجد، وكان من رأى مناما قصه على النبي صلى الله عليه وسلم فقلت اللهم إن كان لي عندك خير فأرني مناما يعبره لي رسول الله صلى الله عليه وسلم، فنمت فرأيت ملكين أتياني فانطلقا بي، فلقيهما ملك آخر فقال لي لن تراع، إنك رجل صالح، فانطلقا بي إلى النار، فإذا هي مطوية كطى البئر، وإذا فيها ناس قد عرفت بعضهم، فأخذا بي ذات اليمين، فلما أصبحت ذكرت ذلك لحفصة‏.‏ فزعمت حفصة أنها قصتها على النبي صلى الله عليه وسلم فقال ‏ \"‏ إن عبد الله رجل صالح لو كان يكثر الصلاة من الليل ‏\"‏‏.‏ قال الزهري وكان عبد الله بعد ذلك يكثر الصلاة من الليل‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7036,
			"arabicnumber": 7036,
			"text": "حدثني إسحاق بن إبراهيم الحنظلي، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا به أبو هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ نحن الآخرون السابقون ‏\"‏‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ بينا أنا نائم إذ أوتيت خزائن الأرض، فوضع في يدى سواران من ذهب، فكبرا على وأهماني، فأوحي إلى أن انفخهما، فنفختهما فطارا، فأولتهما الكذابين اللذين أنا بينهما صاحب صنعاء وصاحب اليمامة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7055,
			"arabicnumber": 7055,
			"text": "حدثنا إسماعيل، حدثني ابن وهب، عن عمرو، عن بكير، عن بسر بن سعيد، عن جنادة بن أبي أمية، قال دخلنا على عبادة بن الصامت وهو مريض قلنا أصلحك الله حدث بحديث، ينفعك الله به سمعته من النبي، صلى الله عليه وسلم‏.‏ قال دعانا النبي صلى الله عليه وسلم فبايعناه فقال فيما أخذ علينا أن بايعنا على السمع والطاعة، في منشطنا ومكرهنا، وعسرنا، ويسرنا، وأثرة علينا، وأن لا ننازع الأمر أهله، إلا أن تروا كفرا بواحا، عندكم من الله فيه برهان‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7062,
			"arabicnumber": 7062,
			"text": "حدثنا عبيد الله بن موسى، عن الأعمش، عن شقيق، قال كنت مع عبد الله وأبي موسى فقالا قال النبي صلى الله عليه وسلم ‏ \"‏ إن بين يدى الساعة لأياما ينزل فيها الجهل، ويرفع فيها العلم، ويكثر فيها الهرج، والهرج القتل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7102,
			"arabicnumber": 7102,
			"text": "حدثنا بدل بن المحبر، حدثنا شعبة، أخبرني عمرو، سمعت أبا وائل، يقول دخل أبو موسى وأبو مسعود على عمار حيث بعثه علي إلى أهل الكوفة يستنفرهم فقالا ما رأيناك أتيت أمرا أكره عندنا من إسراعك في هذا الأمر منذ أسلمت‏.‏ فقال عمار ما رأيت منكما منذ أسلمتما أمرا أكره عندي من إبطائكما عن هذا الأمر‏.‏ وكساهما حلة حلة، ثم راحوا إلى المسجد‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7103,
			"arabicnumber": 7103,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7105,
			"arabicnumber": 7105,
			"text": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن شقيق بن سلمة، كنت جالسا مع أبي مسعود وأبي موسى وعمار فقال أبو مسعود ما من أصحابك أحد إلا لو شئت لقلت فيه غيرك، وما رأيت منك شيئا منذ صحبت النبي صلى الله عليه وسلم أعيب عندي من استسراعك في هذا الأمر‏.‏ قال عمار يا أبا مسعود وما رأيت منك ولا من صاحبك هذا شيئا منذ صحبتما النبي صلى الله عليه وسلم أعيب عندي من إبطائكما في هذا الأمر‏.‏ فقال أبو مسعود وكان موسرا يا غلام هات حلتين‏.‏ فأعطى إحداهما أبا موسى والأخرى عمارا وقال روحا فيه إلى الجمعة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7106,
			"arabicnumber": 7106,
			"text": "",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7176,
			"arabicnumber": 7176,
			"text": "حدثنا إسماعيل بن أبي أويس، حدثني إسماعيل بن إبراهيم، عن عمه، موسى بن عقبة قال ابن شهاب حدثني عروة بن الزبير، أن مروان بن الحكم، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قال حين أذن لهم المسلمون في عتق سبى هوازن ‏ \"‏ إني لا أدري من أذن منكم ممن لم يأذن، فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم، فرجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أن الناس قد طيبوا وأذنوا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7183,
			"arabicnumber": 7183,
			"text": "حدثنا إسحاق بن نصر، حدثنا عبد الرزاق، أخبرنا سفيان، عن منصور، والأعمش، عن أبي وائل، قال قال عبد الله قال النبي صلى الله عليه وسلم ‏\"‏ لا يحلف على يمين صبر، يقتطع مالا وهو فيها فاجر، إلا لقي الله وهو عليه غضبان ‏\"‏‏.‏ فأنزل الله ‏{‏إن الذين يشترون بعهد الله‏}‏ الآية‏.‏ فجاء الأشعث وعبد الله يحدثهم فقال في نزلت وفي رجل خاصمته في بئر فقال النبي صلى الله عليه وسلم ‏\"‏ ألك بينة ‏\"‏‏.‏ قلت لا‏.‏ قال ‏\"‏ فليحلف ‏\"‏‏.‏ قلت إذا يحلف‏.‏ فنزلت ‏{‏إن الذين يشترون بعهد الله‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7193,
			"arabicnumber": 7193,
			"text": "حدثنا آدم، حدثنا ابن أبي ذئب، حدثنا الزهري، عن عبيد الله بن عبد الله، عن أبي هريرة، وزيد بن خالد الجهني، قالا جاء أعرابي فقال يا رسول الله اقض بيننا بكتاب الله فقام خصمه فقال صدق فاقض بيننا بكتاب الله‏.‏ فقال الأعرابي إن ابني كان عسيفا على هذا فزنى بامرأته، فقالوا لي على ابنك الرجم‏.‏ ففديت ابني منه بمائة من الغنم ووليدة، ثم سألت أهل العلم فقالوا إنما على ابنك جلد مائة وتغريب عام‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ لأقضين بينكما بكتاب الله، أما الوليدة والغنم فرد عليك، وعلى ابنك جلد مائة وتغريب عام، وأما أنت يا أنيس ـ لرجل ـ فاغد على امرأة هذا فارجمها ‏\"‏‏.‏ فغدا عليها أنيس فرجمها‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7199,
			"arabicnumber": 7199,
			"text": "حدثنا إسماعيل، حدثني مالك، عن يحيى بن سعيد، قال أخبرني عبادة بن الوليد، أخبرني أبي، عن عبادة بن الصامت، قال \"بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في المنشط والمكره‏.‏ ‏‏وأن لا ننازع الأمر أهله، وأن نقوم ـ أو نقول ـ بالحق حيثما كنا لا نخاف في الله لومة لائم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7222,
			"arabicnumber": 7222,
			"text": "حدثني محمد بن المثنى، حدثنا غندر، حدثنا شعبة، عن عبد الملك، سمعت جابر بن سمرة، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ يكون اثنا عشر أميرا ـ فقال كلمة لم أسمعها فقال أبي إنه قال ـ كلهم من قريش ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7258,
			"arabicnumber": 7258,
			"text": "حدثنا زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، أن عبيد الله بن عبد الله، أخبره أن أبا هريرة وزيد بن خالد أخبراه أن رجلين اختصما إلى النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7278,
			"arabicnumber": 7278,
			"text": "حدثنا مسدد، حدثنا سفيان، حدثنا الزهري، عن عبيد الله، عن أبي هريرة، وزيد بن خالد، قالا كنا عند النبي صلى الله عليه وسلم فقال ‏ \"‏ لأقضين بينكما بكتاب الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7284,
			"arabicnumber": 7284,
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن عقيل، عن الزهري، أخبرني عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، قال لما توفي رسول الله صلى الله عليه وسلم واستخلف أبو بكر بعده، وكفر من كفر من العرب قال عمر لأبي بكر كيف تقاتل الناس، وقد قال رسول الله صلى الله عليه وسلم ‏ \"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله‏.‏ فمن قال لا إله إلا الله‏.‏ عصم مني ماله ونفسه، إلا بحقه، وحسابه على الله ‏\"‏‏.‏ فقال والله لأقاتلن من فرق بين الصلاة والزكاة، فإن الزكاة حق المال، والله لو منعوني عقالا كانوا يؤدونه إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعه‏.‏ فقال عمر فوالله ما هو إلا أن رأيت الله قد شرح صدر أبي بكر للقتال فعرفت أنه الحق‏.‏ قال ابن بكير وعبد الله عن الليث عناقا‏.‏ وهو أصح‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7317,
			"arabicnumber": 7317,
			"text": "حدثنا محمد، أخبرنا أبو معاوية، حدثنا هشام، عن أبيه، عن المغيرة بن شعبة، قال سأل عمر بن الخطاب عن إملاص المرأة ـ هي التي يضرب بطنها فتلقي جنينا ـ فقال أيكم سمع من النبي صلى الله عليه وسلم فيه شيئا فقلت أنا‏.‏ فقال ما هو قلت سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ فيه غرة عبد أو أمة ‏\"‏‏.‏ فقال لا تبرح حتى تجيئني بالمخرج فيما قلت‏.فخرجت فوجدت محمد بن مسلمة فجئت به، فشهد معي أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ فيه غرة عبد أو أمة ‏\"‏‏.‏ تابعه ابن أبي الزناد عن أبيه عن عروة عن المغيرة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7327,
			"arabicnumber": 7327,
			"text": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، قالت لعبد الله بن الزبير ادفني مع صواحبي ولا تدفني مع النبي صلى الله عليه وسلم في البيت، فإني أكره أن أزكى‏.‏ وعن هشام، عن أبيه، أن عمر، أرسل إلى عائشة ائذني لي أن أدفن مع صاحبى فقالت إي والله‏.‏ قال وكان الرجل إذا أرسل إليها من الصحابة قالت لا والله لا أوثرهم بأحد أبدا‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7340,
			"arabicnumber": 7340,
			"text": "حدثنا مسدد، حدثنا عباد بن عباد، حدثنا عاصم الأحول، عن أنس، قال حالف النبي صلى الله عليه وسلم بين الأنصار وقريش في داري التي بالمدينة‏.‏ وقنت شهرا يدعو على أحياء من بني سليم",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7350,
			"arabicnumber": 7350,
			"text": "حدثنا إسماعيل، عن أخيه، عن سليمان بن بلال، عن عبد المجيد بن سهيل بن عبد الرحمن بن عوف، أنه سمع سعيد بن المسيب، يحدث أن أبا سعيد الخدري، وأبا، هريرة حدثاه أن رسول الله صلى الله عليه وسلم بعث أخا بني عدي الأنصاري واستعمله على خيبر، فقدم بتمر جنيب فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أكل تمر خيبر هكذا ‏\"‏‏.‏ قال لا والله يا رسول الله إنا لنشتري الصاع بالصاعين من الجمع‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تفعلوا، ولكن مثلا بمثل، أو بيعوا هذا واشتروا بثمنه من هذا وكذلك الميزان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7387,
			"arabicnumber": 7387,
			"text": "حدثنا يحيى بن سليمان، حدثني ابن وهب، أخبرني عمرو، عن يزيد، عن أبي الخير، سمع عبد الله بن عمرو، أن أبا بكر الصديق ـ رضى الله عنه ـ قال للنبي صلى الله عليه وسلم يا رسول الله علمني دعاء أدعو به في صلاتي‏.‏ قال ‏ \"‏ قل اللهم إني ظلمت نفسي ظلما كثيرا، ولا يغفر الذنوب إلا أنت، فاغفر لي من عندك مغفرة، إنك أنت الغفور الرحيم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7412,
			"arabicnumber": 7412,
			"text": "حدثنا مقدم بن محمد، قال حدثني عمي القاسم بن يحيى، عن عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إن الله يقبض يوم القيامة الأرض وتكون السموات بيمينه ثم يقول أنا الملك ‏\"‏‏.‏ رواه سعيد عن مالك‏.‏ وقال عمر بن حمزة سمعت سالما سمعت ابن عمر عن النبي صلى الله عليه وسلم بهذا‏.‏ وقال أبو اليمان أخبرنا شعيب، عن الزهري، أخبرني أبو سلمة، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يقبض الله الأرض ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7427,
			"arabicnumber": 7427,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال النبي صلى الله عليه وسلم ‏\"‏ الناس يصعقون يوم القيامة فإذا أنا بموسى آخذ بقائمة من قوائم العرش ‏\"‏‏.‏ وقال الماجشون عن عبد الله بن الفضل، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ فأكون أول من بعث فإذا موسى آخذ بالعرش ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7437,
			"arabicnumber": 7437,
			"text": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن عطاء بن يزيد الليثي، عن أبي هريرة، أن الناس، قالوا يا رسول الله هل نرى ربنا يوم القيامة فقال رسول الله صلى الله عليه وسلم ‏\"‏ هل تضارون في القمر ليلة البدر ‏\"‏‏.‏ قالوا لا يا رسول الله‏.‏ قال ‏\"‏ فهل تضارون في الشمس ليس دونها سحاب ‏\"‏‏.‏ قالوا لا يا رسول الله‏.‏ قال ‏\"‏ فإنكم ترونه كذلك، يجمع الله الناس يوم القيامة فيقول من كان يعبد شيئا فليتبعه‏.‏ فيتبع من كان يعبد الشمس الشمس، ويتبع من كان يعبد القمر القمر، ويتبع من كان يعبد الطواغيت الطواغيت، وتبقى هذه الأمة فيها شافعوها ـ أو منافقوها شك إبراهيم ـ فيأتيهم الله فيقول أنا ربكم‏.‏ فيقولون هذا مكاننا حتى يأتينا ربنا فإذا جاءنا ربنا عرفناه فيأتيهم الله في صورته التي يعرفون فيقول أنا ربكم‏.‏ فيقولون أنت ربنا‏.‏ فيتبعونه ويضرب الصراط بين ظهرى جهنم، فأكون أنا وأمتي أول من يجيزها، ولا يتكلم يومئذ إلا الرسل، ودعوى الرسل يومئذ اللهم سلم سلم‏.‏ وفي جهنم كلاليب مثل شوك السعدان، هل رأيتم السعدان ‏\"‏‏.‏ قالوا نعم يا رسول الله‏.‏ قال ‏\"‏ فإنها مثل شوك السعدان، غير أنه لا يعلم ما قدر عظمها إلا الله، تخطف الناس بأعمالهم، فمنهم الموبق بقي بعمله، أو الموثق بعمله، ومنهم المخردل أو المجازى أو نحوه، ثم يتجلى حتى إذا فرغ الله من القضاء بين العباد وأراد أن يخرج برحمته من أراد من أهل النار أمر الملائكة أن يخرجوا من النار من كان لا يشرك بالله شيئا، ممن أراد الله أن يرحمه ممن يشهد أن لا إله إلا الله، فيعرفونهم في النار بأثر السجود، تأكل النار ابن آدم إلا أثر السجود، حرم الله على النار أن تأكل أثر السجود، فيخرجون من النار قد امتحشوا، فيصب عليهم ماء الحياة فينبتون تحته كما تنبت الحبة في حميل السيل، ثم يفرغ الله من القضاء بين العباد، ويبقى رجل مقبل بوجهه على النار هو آخر أهل النار دخولا الجنة فيقول أى رب اصرف وجهي عن النار، فإنه قد قشبني ريحها وأحرقني ذكاؤها‏.‏ فيدعو الله بما شاء أن يدعوه ثم يقول الله هل عسيت إن أعطيت ذلك أن تسألني غيره‏.‏ فيقول لا وعزتك لا أسألك غيره، ويعطي ربه من عهود ومواثيق ما شاء، فيصرف الله وجهه عن النار، فإذا أقبل على الجنة ورآها سكت ما شاء الله أن يسكت ثم يقول أى رب قدمني إلى باب الجنة‏.‏ فيقول الله له ألست قد أعطيت عهودك ومواثيقك أن لا تسألني غير الذي أعطيت أبدا، ويلك يا ابن آدم ما أغدرك‏.‏ فيقول أى رب‏.‏ ويدعو الله حتى يقول هل عسيت إن أعطيت ذلك أن تسأل غيره‏.‏ فيقول لا وعزتك لا أسألك غيره، ويعطي ما شاء من عهود ومواثيق، فيقدمه إلى باب الجنة، فإذا قام إلى باب الجنة انفهقت له الجنة فرأى ما فيها من الحبرة والسرور، فيسكت ما شاء الله أن يسكت ثم يقول أى رب أدخلني الجنة‏.‏ فيقول الله ألست قد أعطيت عهودك ومواثيقك أن لا تسأل غير ما أعطيت ـ فيقول ـ ويلك يا ابن آدم ما أغدرك‏.‏ فيقول أى رب لا أكونن أشقى خلقك فلا يزال يدعو حتى يضحك الله منه فإذا ضحك منه قال له ادخل الجنة‏.‏ فإذا دخلها قال الله له تمنه‏.‏ فسأل ربه وتمنى حتى إن الله ليذكره يقول كذا وكذا، حتى انقطعت به الأماني قال الله ذلك لك ومثله معه ‏\"‏‏.‏ قال عطاء بن يزيد وأبو سعيد الخدري مع أبي هريرة لا يرد عليه من حديثه شيئا حتى إذا حدث أبو هريرة أن الله تبارك وتعالى قال ‏\"‏ ذلك لك ومثله معه ‏\"‏‏.‏ قال أبو سعيد الخدري ‏\"‏ وعشرة أمثاله معه ‏\"‏‏.‏ يا أبا هريرة‏.‏ قال أبو هريرة ما حفظت إلا قوله ‏\"‏ ذلك لك ومثله معه ‏\"‏‏.‏ قال أبو سعيد الخدري أشهد أني حفظت من رسول الله صلى الله عليه وسلم قوله ‏\"‏ ذلك لك وعشرة أمثاله ‏\"‏‏.‏ قال أبو هريرة فذلك الرجل آخر أهل الجنة دخولا الجنة‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 7495,
			"arabicnumber": 7495,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، أن الأعرج، حدثه أنه، سمع أبا هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ نحن الآخرون السابقون يوم القيامة ‏\"‏‏.‏ وبهذا الإسناد ‏\"‏ قال الله أنفق أنفق عليك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}