{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"11": "Friday Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 876,
			"arabicnumber": 876,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، قال حدثنا أبو الزناد، أن عبد الرحمن بن هرمز الأعرج، مولى ربيعة بن الحارث حدثه أنه، سمع أبا هريرة ـ رضى الله عنه ـ أنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ نحن الآخرون السابقون يوم القيامة، بيد أنهم أوتوا الكتاب من قبلنا، ثم هذا يومهم الذي فرض عليهم فاختلفوا فيه، فهدانا الله، فالناس لنا فيه تبع، اليهود غدا والنصارى بعد غد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 877,
			"arabicnumber": 877,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا جاء أحدكم الجمعة فليغتسل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 878,
			"arabicnumber": 878,
			"text": "حدثنا عبد الله بن محمد بن أسماء، قال أخبرنا جويرية، عن مالك، عن الزهري، عن سالم بن عبد الله بن عمر، عن ابن عمر ـ رضى الله عنهما ـ أن عمر بن الخطاب، بينما هو قائم في الخطبة يوم الجمعة إذ دخل رجل من المهاجرين الأولين من أصحاب النبي صلى الله عليه وسلم فناداه عمر أية ساعة هذه قال إني شغلت فلم أنقلب إلى أهلي حتى سمعت التأذين، فلم أزد أن توضأت‏.‏ فقال والوضوء أيضا وقد علمت أن رسول الله صلى الله عليه وسلم كان يأمر بالغسل‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 879,
			"arabicnumber": 879,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 880,
			"arabicnumber": 880,
			"text": "حدثنا علي، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن أبي بكر بن المنكدر، قال حدثني عمرو بن سليم الأنصاري، قال أشهد على أبي سعيد قال أشهد على رسول الله صلى الله عليه وسلم قال ‏ \"‏ الغسل يوم الجمعة واجب على كل محتلم، وأن يستن وأن يمس طيبا إن وجد ‏\"‏‏.‏ قال عمرو أما الغسل فأشهد أنه واجب، وأما الاستنان والطيب فالله أعلم أواجب هو أم لا، ولكن هكذا في الحديث‏.‏ قال أبو عبد الله هو أخو محمد بن المنكدر ولم يسم أبو بكر هذا‏.‏ رواه عنه بكير بن الأشج وسعيد بن أبي هلال وعدة‏.‏ وكان محمد بن المنكدر يكنى بأبي بكر وأبي عبد الله‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 881,
			"arabicnumber": 881,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن سمى، مولى أبي بكر بن عبد الرحمن عن أبي صالح السمان، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من اغتسل يوم الجمعة غسل الجنابة ثم راح فكأنما قرب بدنة، ومن راح في الساعة الثانية فكأنما قرب بقرة، ومن راح في الساعة الثالثة فكأنما قرب كبشا أقرن، ومن راح في الساعة الرابعة فكأنما قرب دجاجة، ومن راح في الساعة الخامسة فكأنما قرب بيضة، فإذا خرج الإمام حضرت الملائكة يستمعون الذكر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 882,
			"arabicnumber": 882,
			"text": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، أن عمر ـ رضى الله عنه ـ بينما هو يخطب يوم الجمعة إذ دخل رجل فقال عمر لم تحتبسون عن الصلاة فقال الرجل ما هو إلا سمعت النداء توضأت‏.‏ فقال ألم تسمعوا النبي صلى الله عليه وسلم قال ‏ \"‏ إذا راح أحدكم إلى الجمعة فليغتسل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 883,
			"arabicnumber": 883,
			"text": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن سعيد المقبري، قال أخبرني أبي، عن ابن وديعة، عن سلمان الفارسي، قال قال النبي صلى الله عليه وسلم ‏ \"‏ لا يغتسل رجل يوم الجمعة، ويتطهر ما استطاع من طهر، ويدهن من دهنه، أو يمس من طيب بيته ثم يخرج، فلا يفرق بين اثنين، ثم يصلي ما كتب له، ثم ينصت إذا تكلم الإمام، إلا غفر له ما بينه وبين الجمعة الأخرى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 884,
			"arabicnumber": 884,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال طاوس قلت لابن عباس ذكروا أن النبي صلى الله عليه وسلم قال ‏ \"‏ اغتسلوا يوم الجمعة واغسلوا رءوسكم وإن لم تكونوا جنبا، وأصيبوا من الطيب ‏\"‏‏.‏ قال ابن عباس أما الغسل فنعم، وأما الطيب فلا أدري‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 885,
			"arabicnumber": 885,
			"text": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام، أن ابن جريج، أخبرهم قال أخبرني إبراهيم بن ميسرة، عن طاوس، عن ابن عباس ـ رضى الله عنهما ـ أنه ذكر قول النبي صلى الله عليه وسلم في الغسل يوم الجمعة فقلت لابن عباس أيمس طيبا أو دهنا إن كان عند أهله فقال لا أعلمه‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 886,
			"arabicnumber": 886,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن عبد الله بن عمر، أن عمر بن الخطاب، رأى حلة سيراء عند باب المسجد فقال يا رسول الله، لو اشتريت هذه فلبستها يوم الجمعة وللوفد إذا قدموا عليك‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما يلبس هذه من لا خلاق له في الآخرة ‏\"‏‏.‏ ثم جاءت رسول الله صلى الله عليه وسلم منها حلل، فأعطى عمر بن الخطاب ـ رضى الله عنه ـ منها حلة فقال عمر يا رسول الله، كسوتنيها وقد قلت في حلة عطارد ما قلت قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لم أكسكها لتلبسها ‏\"‏‏.‏ فكساها عمر بن الخطاب ـ رضى الله عنه ـ أخا له بمكة مشركا‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 887,
			"arabicnumber": 887,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لولا أن أشق على أمتي ـ أو على الناس ـ لأمرتهم بالسواك مع كل صلاة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 888,
			"arabicnumber": 888,
			"text": "حدثنا أبو معمر، قال حدثنا عبد الوارث، قال حدثنا شعيب بن الحبحاب، حدثنا أنس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أكثرت عليكم في السواك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 889,
			"arabicnumber": 889,
			"text": "حدثنا محمد بن كثير، قال أخبرنا سفيان، عن منصور، وحصين، عن أبي وائل، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا قام من الليل يشوص فاه‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 890,
			"arabicnumber": 890,
			"text": "حدثنا إسماعيل، قال حدثني سليمان بن بلال، قال قال هشام بن عروة أخبرني أبي، عن عائشة ـ رضى الله عنها ـ قالت دخل عبد الرحمن بن أبي بكر، ومعه سواك يستن به، فنظر إليه رسول الله صلى الله عليه وسلم فقلت له أعطني هذا السواك يا عبد الرحمن‏.‏ فأعطانيه فقصمته ثم مضغته، فأعطيته رسول الله صلى الله عليه وسلم فاستن به وهو مستسند إلى صدري‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 891,
			"arabicnumber": 891,
			"text": "حدثنا أبو نعيم، قال حدثنا سفيان، عن سعد بن إبراهيم، عن عبد الرحمن ـ هو ابن هرمز ـ عن أبي هريرة ـ رضى الله عنه ـ قال كان النبي صلى الله عليه وسلم يقرأ في الجمعة في صلاة الفجر ‏{‏الم * تنزيل‏}‏ السجدة و‏{‏هل أتى على الإنسان‏}‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 892,
			"arabicnumber": 892,
			"text": "حدثنا محمد بن المثنى، قال حدثنا أبو عامر العقدي، قال حدثنا إبراهيم بن طهمان، عن أبي جمرة الضبعي، عن ابن عباس، أنه قال إن أول جمعة جمعت بعد جمعة في مسجد رسول الله صلى الله عليه وسلم في مسجد عبد القيس بجواثى من البحرين‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 893,
			"arabicnumber": 893,
			"text": "حدثنا بشر بن محمد، قال أخبرنا عبد الله، قال أخبرنا يونس، عن الزهري، قال أخبرنا سالم بن عبد الله، عن ابن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم يقول ‏\"‏ كلكم راع ‏\"‏‏.‏ وزاد الليث قال يونس كتب رزيق بن حكيم إلى ابن شهاب ـ وأنا معه يومئذ بوادي القرى ـ هل ترى أن أجمع‏.‏ ورزيق عامل على أرض يعملها، وفيها جماعة من السودان وغيرهم، ورزيق يومئذ على أيلة، فكتب ابن شهاب ـ وأنا أسمع ـ يأمره أن يجمع، يخبره أن سالما حدثه أن عبد الله بن عمر يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كلكم راع، وكلكم مسئول عن رعيته، الإمام راع ومسئول عن رعيته، والرجل راع في أهله وهو مسئول عن رعيته، والمرأة راعية في بيت زوجها ومسئولة عن رعيتها، والخادم راع في مال سيده ومسئول عن رعيته ـ قال وحسبت أن قد قال ـ والرجل راع في مال أبيه ومسئول عن رعيته وكلكم راع ومسئول عن رعيته ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 894,
			"arabicnumber": 894,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال حدثني سالم بن عبد الله، أنه سمع عبد الله بن عمر ـ رضى الله عنهما ـ يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من جاء منكم الجمعة فليغتسل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 895,
			"arabicnumber": 895,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 897,
			"arabicnumber": 897,
			"text": "",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 898,
			"arabicnumber": 898,
			"text": "رواه أبان بن صالح عن مجاهد، عن طاوس، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏ \"‏ لله تعالى على كل مسلم حق أن يغتسل في كل سبعة أيام يوما ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 899,
			"arabicnumber": 899,
			"text": "حدثنا عبد الله بن محمد، حدثنا شبابة، حدثنا ورقاء، عن عمرو بن دينار، عن مجاهد، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ائذنوا للنساء بالليل إلى المساجد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 900,
			"arabicnumber": 900,
			"text": "حدثنا يوسف بن موسى، حدثنا أبو أسامة، حدثنا عبيد الله بن عمر، عن نافع، عن ابن عمر، قال كانت امرأة لعمر تشهد صلاة الصبح والعشاء في الجماعة في المسجد، فقيل لها لم تخرجين وقد تعلمين أن عمر يكره ذلك ويغار قالت وما يمنعه أن ينهاني قال يمنعه قول رسول الله صلى الله عليه وسلم ‏ \"‏ لا تمنعوا إماء الله مساجد الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 901,
			"arabicnumber": 901,
			"text": "حدثنا مسدد، قال حدثنا إسماعيل، قال أخبرني عبد الحميد، صاحب الزيادي قال حدثنا عبد الله بن الحارث ابن عم، محمد بن سيرين قال ابن عباس لمؤذنه في يوم مطير إذا قلت أشهد أن محمدا رسول الله‏.‏ فلا تقل حى على الصلاة‏.‏ قل صلوا في بيوتكم‏.‏ فكأن الناس استنكروا، قال فعله من هو خير مني، إن الجمعة عزمة، وإني كرهت أن أخرجكم، فتمشون في الطين والدحض‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 902,
			"arabicnumber": 902,
			"text": "حدثنا أحمد، قال حدثنا عبد الله بن وهب، قال أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، أن محمد بن جعفر بن الزبير، حدثه عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم قالت كان الناس ينتابون يوم الجمعة من منازلهم والعوالي، فيأتون في الغبار، يصيبهم الغبار والعرق، فيخرج منهم العرق، فأتى رسول الله صلى الله عليه وسلم إنسان منهم وهو عندي، فقال النبي صلى الله عليه وسلم ‏ \"‏ لو أنكم تطهرتم ليومكم هذا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 903,
			"arabicnumber": 903,
			"text": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا يحيى بن سعيد، أنه سأل عمرة عن الغسل، يوم الجمعة فقالت قالت عائشة ـ رضى الله عنها ـ كان الناس مهنة أنفسهم، وكانوا إذا راحوا إلى الجمعة راحوا في هيئتهم فقيل لهم لو اغتسلتم‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 904,
			"arabicnumber": 904,
			"text": "حدثنا سريج بن النعمان، قال حدثنا فليح بن سليمان، عن عثمان بن عبد الرحمن بن عثمان التيمي، عن أنس بن مالك، رضى الله عنه أن النبي صلى الله عليه وسلم كان يصلي الجمعة حين تميل الشمس‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 905,
			"arabicnumber": 905,
			"text": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا حميد، عن أنس، قال كنا نبكر بالجمعة، ونقيل بعد الجمعة‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 906,
			"arabicnumber": 906,
			"text": "حدثنا محمد بن أبي بكر المقدمي، قال حدثنا حرمي بن عمارة، قال حدثنا أبو خلدة ـ هو خالد بن دينار ـ قال سمعت أنس بن مالك، يقول كان النبي صلى الله عليه وسلم إذا اشتد البرد بكر بالصلاة، وإذا اشتد الحر أبرد بالصلاة، يعني الجمعة‏.‏ قال يونس بن بكير أخبرنا أبو خلدة فقال بالصلاة، ولم يذكر الجمعة‏.‏ وقال بشر بن ثابت حدثنا أبو خلدة قال صلى بنا أمير الجمعة ثم قال لأنس ـ رضى الله عنه ـ كيف كان النبي صلى الله عليه وسلم يصلي الظهر",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 907,
			"arabicnumber": 907,
			"text": "حدثنا علي بن عبد الله، قال حدثنا الوليد بن مسلم، قال حدثنا يزيد بن أبي مريم، قال حدثنا عباية بن رفاعة، قال أدركني أبو عبس وأنا أذهب، إلى الجمعة فقال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ من اغبرت قدماه في سبيل الله حرمه الله على النار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 908,
			"arabicnumber": 908,
			"text": "حدثنا آدم، قال حدثنا ابن أبي ذئب، قال الزهري عن سعيد، وأبي، سلمة عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم‏.‏ وحدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني أبو سلمة بن عبد الرحمن، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إذا أقيمت الصلاة فلا تأتوها تسعون، وأتوها تمشون عليكم السكينة، فما أدركتم فصلوا، وما فاتكم فأتموا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 909,
			"arabicnumber": 909,
			"text": "حدثنا عمرو بن علي، قال حدثني أبو قتيبة، قال حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة ـ لا أعلمه إلا عن أبيه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا تقوموا حتى تروني، وعليكم السكينة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 910,
			"arabicnumber": 910,
			"text": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا ابن أبي ذئب، عن سعيد المقبري، عن أبيه، عن ابن وديعة، عن سلمان الفارسي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من اغتسل يوم الجمعة، وتطهر بما استطاع من طهر، ثم ادهن أو مس من طيب، ثم راح فلم يفرق بين اثنين، فصلى ما كتب له، ثم إذا خرج الإمام أنصت، غفر له ما بينه وبين الجمعة الأخرى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 911,
			"arabicnumber": 911,
			"text": "حدثنا محمد، قال أخبرنا مخلد بن يزيد، قال أخبرنا ابن جريج، قال سمعت نافعا، يقول سمعت ابن عمر ـ رضى الله عنهما ـ يقول نهى النبي صلى الله عليه وسلم أن يقيم الرجل أخاه من مقعده ويجلس فيه‏.‏ قلت لنافع الجمعة قال الجمعة وغيرها‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 912,
			"arabicnumber": 912,
			"text": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن الزهري، عن السائب بن يزيد، قال كان النداء يوم الجمعة أوله إذا جلس الإمام على المنبر على عهد النبي صلى الله عليه وسلم وأبي بكر وعمر ـ رضى الله عنهما ـ فلما كان عثمان ـ رضى الله عنه ـ وكثر الناس زاد النداء الثالث على الزوراء‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 913,
			"arabicnumber": 913,
			"text": "حدثنا أبو نعيم، قال حدثنا عبد العزيز بن أبي سلمة الماجشون، عن الزهري، عن السائب بن يزيد، أن الذي، زاد التأذين الثالث يوم الجمعة عثمان بن عفان ـ رضى الله عنه ـ حين كثر أهل المدينة، ولم يكن للنبي صلى الله عليه وسلم مؤذن غير واحد، وكان التأذين يوم الجمعة حين يجلس الإمام، يعني على المنبر‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 914,
			"arabicnumber": 914,
			"text": "حدثنا ابن مقاتل، قال أخبرنا عبد الله، قال أخبرنا أبو بكر بن عثمان بن سهل بن حنيف، عن أبي أمامة بن سهل بن حنيف، قال سمعت معاوية بن أبي سفيان،، وهو جالس على المنبر، أذن المؤذن قال الله أكبر الله أكبر‏.‏ قال معاوية الله أكبر الله أكبر‏.‏ قال أشهد أن لا إله إلا الله‏.‏ فقال معاوية وأنا‏.‏ فقال أشهد أن محمدا رسول الله‏.‏ فقال معاوية وأنا‏.‏ فلما أن قضى التأذين قال يا أيها الناس إني سمعت رسول الله صلى الله عليه وسلم على هذا المجلس حين أذن المؤذن يقول ما سمعتم مني من مقالتي‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 915,
			"arabicnumber": 915,
			"text": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، أن السائب بن يزيد، أخبره أن التأذين الثاني يوم الجمعة أمر به عثمان حين كثر أهل المسجد، وكان التأذين يوم الجمعة حين يجلس الإمام‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 916,
			"arabicnumber": 916,
			"text": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله، قال أخبرنا يونس، عن الزهري، قال سمعت السائب بن يزيد، يقول إن الأذان يوم الجمعة كان أوله حين يجلس الإمام يوم الجمعة على المنبر في عهد رسول الله صلى الله عليه وسلم وأبي بكر وعمر ـ رضى الله عنهما ـ فلما كان في خلافة عثمان ـ رضى الله عنه ـ وكثروا، أمر عثمان يوم الجمعة بالأذان الثالث، فأذن به على الزوراء، فثبت الأمر على ذلك‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 917,
			"arabicnumber": 917,
			"text": "حدثنا قتيبة بن سعيد، قال حدثنا يعقوب بن عبد الرحمن بن محمد بن عبد الله بن عبد القاري القرشي الإسكندراني، قال حدثنا أبو حازم بن دينار، أن رجالا، أتوا سهل بن سعد الساعدي، وقد امتروا في المنبر مم عوده فسألوه عن ذلك فقال والله إني لأعرف مما هو، ولقد رأيته أول يوم وضع، وأول يوم جلس عليه رسول الله صلى الله عليه وسلم أرسل رسول الله صلى الله عليه وسلم إلى فلانة ـ امرأة قد سماها سهل ـ ‏\"‏ مري غلامك النجار أن يعمل لي أعوادا أجلس عليهن إذا كلمت الناس ‏\"‏‏.‏ فأمرته فعملها من طرفاء الغابة ثم جاء بها، فأرسلت إلى رسول الله صلى الله عليه وسلم فأمر بها فوضعت ها هنا، ثم رأيت رسول الله صلى الله عليه وسلم صلى عليها، وكبر وهو عليها، ثم ركع وهو عليها، ثم نزل القهقرى فسجد في أصل المنبر ثم عاد، فلما فرغ أقبل على الناس فقال ‏\"‏ أيها الناس إنما صنعت هذا لتأتموا ولتعلموا صلاتي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 918,
			"arabicnumber": 918,
			"text": "حدثنا سعيد بن أبي مريم، قال حدثنا محمد بن جعفر، قال أخبرني يحيى بن سعيد، قال أخبرني ابن أنس، أنه سمع جابر بن عبد الله، قال كان جذع يقوم إليه النبي صلى الله عليه وسلم فلما وضع له المنبر سمعنا للجذع مثل أصوات العشار حتى نزل النبي صلى الله عليه وسلم فوضع يده عليه‏.‏ قال سليمان عن يحيى أخبرني حفص بن عبيد الله بن أنس أنه سمع جابرا‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 919,
			"arabicnumber": 919,
			"text": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن الزهري، عن سالم، عن أبيه، قال سمعت النبي صلى الله عليه وسلم يخطب على المنبر فقال ‏ \"‏ من جاء إلى الجمعة فليغتسل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 920,
			"arabicnumber": 920,
			"text": "حدثنا عبيد الله بن عمر القواريري، قال حدثنا خالد بن الحارث، قال حدثنا عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال كان النبي صلى الله عليه وسلم يخطب قائما ثم يقعد ثم يقوم، كما تفعلون الآن‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 921,
			"arabicnumber": 921,
			"text": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن هلال بن أبي ميمونة، حدثنا عطاء بن يسار، أنه سمع أبا سعيد الخدري، قال إن النبي صلى الله عليه وسلم جلس ذات يوم على المنبر وجلسنا حوله‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 922,
			"arabicnumber": 922,
			"text": "وقال محمود حدثنا أبو أسامة، قال حدثنا هشام بن عروة، قال أخبرتني فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت دخلت على عائشة ـ رضى الله عنها ـ والناس يصلون قلت ما شأن الناس فأشارت برأسها إلى السماء‏.‏ فقلت آية فأشارت برأسها أى نعم‏.‏ قالت فأطال رسول الله صلى الله عليه وسلم جدا حتى تجلاني الغشى وإلى جنبي قربة فيها ماء ففتحتها فجعلت أصب منها على رأسي، فانصرف رسول الله صلى الله عليه وسلم وقد تجلت الشمس، فخطب الناس، وحمد الله بما هو أهله ثم قال ‏\"‏ أما بعد ‏\"‏‏.‏ قالت ولغط نسوة من الأنصار، فانكفأت إليهن لأسكتهن فقلت لعائشة ما قال قالت قال ‏\"‏ ما من شىء لم أكن أريته إلا قد رأيته في مقامي هذا حتى الجنة والنار، وإنه قد أوحي إلى أنكم تفتنون في القبور مثل ـ أو قريب من ـ فتنة المسيح الدجال، يؤتى أحدكم، فيقال له ما علمك بهذا الرجل فأما المؤمن ـ أو قال الموقن شك هشام ـ فيقول هو رسول الله، هو محمد صلى الله عليه وسلم جاءنا بالبينات والهدى فآمنا وأجبنا واتبعنا وصدقنا‏.‏ فيقال له نم صالحا، قد كنا نعلم إن كنت لتؤمن به‏.‏ وأما المنافق ـ أو قال المرتاب شك هشام ـ فيقال له ما علمك بهذا الرجل فيقول لا أدري، سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏ قال هشام فلقد قالت لي فاطمة فأوعيته، غير أنها ذكرت ما يغلظ عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 923,
			"arabicnumber": 923,
			"text": "حدثنا محمد بن معمر، قال حدثنا أبو عاصم، عن جرير بن حازم، قال سمعت الحسن، يقول حدثنا عمرو بن تغلب، أن رسول الله صلى الله عليه وسلم أتي بمال أو سبى فقسمه، فأعطى رجالا وترك رجالا فبلغه أن الذين ترك عتبوا، فحمد الله ثم أثنى عليه، ثم قال ‏ \"‏ أما بعد، فوالله إني لأعطي الرجل، وأدع الرجل، والذي أدع أحب إلى من الذي أعطي ولكن أعطي أقواما لما أرى في قلوبهم من الجزع والهلع، وأكل أقواما إلى ما جعل الله في قلوبهم من الغنى والخير، فيهم عمرو بن تغلب ‏\"‏‏.‏ فوالله ما أحب أن لي بكلمة رسول الله صلى الله عليه وسلم حمر النعم‏.‏ تابعه يونس‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 924,
			"arabicnumber": 924,
			"text": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عروة، أن عائشة، أخبرته أن رسول الله صلى الله عليه وسلم خرج ذات ليلة من جوف الليل، فصلى في المسجد، فصلى رجال بصلاته فأصبح الناس فتحدثوا، فاجتمع أكثر منهم فصلوا معه، فأصبح الناس فتحدثوا فكثر أهل المسجد من الليلة الثالثة، فخرج رسول الله صلى الله عليه وسلم فصلوا بصلاته، فلما كانت الليلة الرابعة عجز المسجد عن أهله حتى خرج لصلاة الصبح، فلما قضى الفجر أقبل على الناس، فتشهد ثم قال ‏ \"‏ أما بعد فإنه لم يخف على مكانكم، لكني خشيت أن تفرض عليكم فتعجزوا عنها ‏\"‏‏.‏ تابعه يونس‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 925,
			"arabicnumber": 925,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني عروة، عن أبي حميد الساعدي، أنه أخبره أن رسول الله صلى الله عليه وسلم قام عشية بعد الصلاة، فتشهد وأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد ‏\"‏‏.‏ تابعه أبو معاوية وأبو أسامة عن هشام عن أبيه عن أبي حميد عن النبي صلى الله عليه وسلم قال ‏\"‏ أما بعد ‏\"‏‏.‏ تابعه العدني عن سفيان في أما بعد‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 926,
			"arabicnumber": 926,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال حدثني علي بن حسين، عن المسور بن مخرمة، قال قام رسول الله صلى الله عليه وسلم فسمعته حين تشهد يقول ‏ \"‏ أما بعد ‏\"‏‏.‏ تابعه الزبيدي عن الزهري‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 927,
			"arabicnumber": 927,
			"text": "حدثنا إسماعيل بن أبان، قال حدثنا ابن الغسيل، قال حدثنا عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال صعد النبي صلى الله عليه وسلم المنبر وكان آخر مجلس جلسه متعطفا ملحفة على منكبيه، قد عصب رأسه بعصابة دسمة، فحمد الله وأثنى عليه ثم قال ‏\"‏ أيها الناس إلى ‏\"‏‏.‏ فثابوا إليه ثم قال ‏\"‏ أما بعد، فإن هذا الحى من الأنصار يقلون، ويكثر الناس، فمن ولي شيئا من أمة محمد صلى الله عليه وسلم فاستطاع أن يضر فيه أحدا أو ينفع فيه أحدا، فليقبل من محسنهم، ويتجاوز عن مسيهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 928,
			"arabicnumber": 928,
			"text": "حدثنا مسدد، قال حدثنا بشر بن المفضل، قال حدثنا عبيد الله، عن نافع، عن عبد الله، قال كان النبي صلى الله عليه وسلم يخطب خطبتين يقعد بينهما‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 929,
			"arabicnumber": 929,
			"text": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن الزهري، عن أبي عبد الله الأغر، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏ \"‏ إذا كان يوم الجمعة، وقفت الملائكة على باب المسجد يكتبون الأول فالأول، ومثل المهجر كمثل الذي يهدي بدنة، ثم كالذي يهدي بقرة، ثم كبشا، ثم دجاجة، ثم بيضة، فإذا خرج الإمام طووا صحفهم، ويستمعون الذكر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 930,
			"arabicnumber": 930,
			"text": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن عبد الله، قال جاء رجل والنبي صلى الله عليه وسلم يخطب الناس يوم الجمعة فقال ‏\"‏ أصليت يا فلان ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ قم فاركع ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 931,
			"arabicnumber": 931,
			"text": "حدثنا علي بن عبد الله، قال حدثنا سفيان، عن عمرو، سمع جابرا، قال دخل رجل يوم الجمعة والنبي صلى الله عليه وسلم يخطب فقال ‏\"‏ أصليت ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فصل ركعتين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 932,
			"arabicnumber": 932,
			"text": "حدثنا مسدد، قال حدثنا حماد بن زيد، عن عبد العزيز، عن أنس،‏.‏ وعن يونس، عن ثابت، عن أنس، قال بينما النبي صلى الله عليه وسلم يخطب يوم الجمعة إذ قام رجل فقال يا رسول الله، هلك الكراع، وهلك الشاء، فادع الله أن يسقينا‏.‏ فمد يديه ودعا‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 933,
			"arabicnumber": 933,
			"text": "حدثنا إبراهيم بن المنذر، قال حدثنا الوليد، قال حدثنا أبو عمرو، قال حدثني إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال أصابت الناس سنة على عهد النبي صلى الله عليه وسلم فبينا النبي صلى الله عليه وسلم يخطب في يوم جمعة قام أعرابي فقال يا رسول الله هلك المال وجاع العيال، فادع الله لنا‏.‏ فرفع يديه، وما نرى في السماء قزعة، فوالذي نفسي بيده ما وضعها حتى ثار السحاب أمثال الجبال، ثم لم ينزل عن منبره حتى رأيت المطر يتحادر على لحيته صلى الله عليه وسلم فمطرنا يومنا ذلك، ومن الغد، وبعد الغد والذي يليه، حتى الجمعة الأخرى، وقام ذلك الأعرابي ـ أو قال غيره ـ فقال يا رسول الله، تهدم البناء وغرق المال، فادع الله لنا‏.‏ فرفع يديه، فقال ‏ \"‏ اللهم حوالينا، ولا علينا ‏\"‏‏.‏ فما يشير بيده إلى ناحية من السحاب إلا انفرجت، وصارت المدينة مثل الجوبة، وسال الوادي قناة شهرا، ولم يجئ أحد من ناحية إلا حدث بالجود‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 934,
			"arabicnumber": 934,
			"text": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني سعيد بن المسيب، أن أبا هريرة، أخبره أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا قلت لصاحبك يوم الجمعة أنصت‏.‏ والإمام يخطب فقد لغوت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 935,
			"arabicnumber": 935,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم ذكر يوم الجمعة فقال ‏ \"‏ فيه ساعة لا يوافقها عبد مسلم، وهو قائم يصلي، يسأل الله تعالى شيئا إلا أعطاه إياه ‏\"‏‏.‏ وأشار بيده يقللها‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 936,
			"arabicnumber": 936,
			"text": "حدثنا معاوية بن عمرو، قال حدثنا زائدة، عن حصين، عن سالم بن أبي الجعد، قال حدثنا جابر بن عبد الله، قال بينما نحن نصلي مع النبي صلى الله عليه وسلم إذ أقبلت عير تحمل طعاما، فالتفتوا إليها حتى ما بقي مع النبي صلى الله عليه وسلم إلا اثنا عشر رجلا، فنزلت هذه الآية ‏{‏وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما‏}‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 937,
			"arabicnumber": 937,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم كان يصلي قبل الظهر ركعتين، وبعدها ركعتين، وبعد المغرب ركعتين في بيته، وبعد العشاء ركعتين وكان لا يصلي بعد الجمعة حتى ينصرف فيصلي ركعتين‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 938,
			"arabicnumber": 938,
			"text": "حدثنا سعيد بن أبي مريم، قال حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، قال كانت فينا امرأة تجعل على أربعاء في مزرعة لها سلقا، فكانت إذا كان يوم جمعة تنزع أصول السلق فتجعله في قدر، ثم تجعل عليه قبضة من شعير تطحنها، فتكون أصول السلق عرقه، وكنا ننصرف من صلاة الجمعة فنسلم عليها، فتقرب ذلك الطعام إلينا فنلعقه، وكنا نتمنى يوم الجمعة لطعامها ذلك‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 939,
			"arabicnumber": 939,
			"text": "حدثنا عبد الله بن مسلمة، قال حدثنا ابن أبي حازم، عن أبيه، عن سهل، بهذا وقال ما كنا نقيل ولا نتغدى إلا بعد الجمعة‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 940,
			"arabicnumber": 940,
			"text": "حدثنا محمد بن عقبة الشيباني، قال حدثنا أبو إسحاق الفزاري، عن حميد، قال سمعت أنسا، يقول كنا نبكر إلى الجمعة ثم نقيل‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 941,
			"arabicnumber": 941,
			"text": "حدثنا سعيد بن أبي مريم، قال حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، قال كنا نصلي مع النبي صلى الله عليه وسلم الجمعة ثم تكون القائلة‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		}
	]
}