{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"13": "The Two Festivals (Eids)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 948,
			"arabicnumber": 948,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني سالم بن عبد الله، أن عبد الله بن عمر، قال أخذ عمر جبة من إستبرق تباع في السوق، فأخذها فأتى رسول الله صلى الله عليه وسلم فقال يا رسول الله ابتع هذه تجمل بها للعيد والوفود‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ إنما هذه لباس من لا خلاق له ‏\"‏‏.‏ فلبث عمر ما شاء الله أن يلبث، ثم أرسل إليه رسول الله صلى الله عليه وسلم بجبة ديباج، فأقبل بها عمر، فأتى بها رسول الله صلى الله عليه وسلم فقال يا رسول الله إنك قلت ‏\"‏ إنما هذه لباس من لا خلاق له ‏\"‏‏.‏ وأرسلت إلى بهذه الجبة فقال له رسول الله صلى الله عليه وسلم ‏\"‏ تبيعها أو تصيب بها حاجتك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 950,
			"arabicnumber": 950,
			"text": "",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 951,
			"arabicnumber": 951,
			"text": "حدثنا حجاج، قال حدثنا شعبة، قال أخبرني زبيد، قال سمعت الشعبي، عن البراء، قال سمعت النبي صلى الله عليه وسلم يخطب فقال ‏ \"‏ إن أول ما نبدأ من يومنا هذا أن نصلي، ثم نرجع فننحر، فمن فعل فقد أصاب سنتنا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 952,
			"arabicnumber": 952,
			"text": "حدثنا عبيد بن إسماعيل، قال حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت دخل أبو بكر وعندي جاريتان من جواري الأنصار تغنيان بما تقاولت الأنصار يوم بعاث ـ قالت وليستا بمغنيتين ـ فقال أبو بكر أمزامير الشيطان في بيت رسول الله صلى الله عليه وسلم وذلك في يوم عيد‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ يا أبا بكر إن لكل قوم عيدا، وهذا عيدنا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 953,
			"arabicnumber": 953,
			"text": "حدثنا محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، قال حدثنا هشيم، قال أخبرنا عبيد الله بن أبي بكر بن أنس، عن أنس، قال كان رسول الله صلى الله عليه وسلم لا يغدو يوم الفطر حتى يأكل تمرات‏.‏ وقال مرجى بن رجاء حدثني عبيد الله قال حدثني أنس عن النبي صلى الله عليه وسلم ويأكلهن وترا‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 954,
			"arabicnumber": 954,
			"text": "حدثنا مسدد، قال حدثنا إسماعيل، عن أيوب، عن محمد، عن أنس، قال قال النبي صلى الله عليه وسلم ‏ \"‏ من ذبح قبل الصلاة فليعد ‏\"‏‏.‏ فقام رجل فقال هذا يوم يشتهى فيه اللحم‏.‏ وذكر من جيرانه فكأن النبي صلى الله عليه وسلم صدقه، قال وعندي جذعة أحب إلى من شاتى لحم، فرخص له النبي صلى الله عليه وسلم فلا أدري أبلغت الرخصة من سواه أم لا‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 955,
			"arabicnumber": 955,
			"text": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن الشعبي، عن البراء بن عازب ـ رضى الله عنهما ـ قال خطبنا النبي صلى الله عليه وسلم يوم الأضحى بعد الصلاة فقال ‏\"‏ من صلى صلاتنا ونسك نسكنا فقد أصاب النسك، ومن نسك قبل الصلاة فإنه قبل الصلاة، ولا نسك له ‏\"‏‏.‏ فقال أبو بردة بن نيار خال البراء يا رسول الله، فإني نسكت شاتي قبل الصلاة، وعرفت أن اليوم يوم أكل وشرب، وأحببت أن تكون شاتي أول ما يذبح في بيتي، فذبحت شاتي وتغديت قبل أن آتي الصلاة‏.‏ قال ‏\"‏ شاتك شاة لحم ‏\"‏‏.‏ قال يا رسول الله، فإن عندنا عناقا لنا جذعة هي أحب إلى من شاتين، أفتجزي عني قال ‏\"‏ نعم، ولن تجزي عن أحد بعدك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 956,
			"arabicnumber": 956,
			"text": "حدثنا سعيد بن أبي مريم، قال حدثنا محمد بن جعفر، قال أخبرني زيد، عن عياض بن عبد الله بن أبي سرح، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم يخرج يوم الفطر والأضحى إلى المصلى، فأول شىء يبدأ به الصلاة ثم ينصرف، فيقوم مقابل الناس، والناس جلوس على صفوفهم، فيعظهم ويوصيهم ويأمرهم، فإن كان يريد أن يقطع بعثا قطعه، أو يأمر بشىء أمر به، ثم ينصرف‏.‏ قال أبو سعيد فلم يزل الناس على ذلك حتى خرجت مع مروان وهو أمير المدينة في أضحى أو فطر، فلما أتينا المصلى إذا منبر بناه كثير بن الصلت، فإذا مروان يريد أن يرتقيه قبل أن يصلي، فجبذت بثوبه فجبذني فارتفع، فخطب قبل الصلاة، فقلت له غيرتم والله‏.‏ فقال أبا سعيد، قد ذهب ما تعلم‏.‏ فقلت ما أعلم والله خير مما لا أعلم‏.‏ فقال إن الناس لم يكونوا يجلسون لنا بعد الصلاة فجعلتها قبل الصلاة‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 957,
			"arabicnumber": 957,
			"text": "حدثنا إبراهيم بن المنذر، قال حدثنا أنس، عن عبيد الله، عن نافع، عن عبد الله بن عمر،‏.‏ أن رسول الله صلى الله عليه وسلم كان يصلي في الأضحى والفطر، ثم يخطب بعد الصلاة‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 961,
			"arabicnumber": 961,
			"text": "",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 962,
			"arabicnumber": 962,
			"text": "حدثنا أبو عاصم، قال أخبرنا ابن جريج، قال أخبرني الحسن بن مسلم، عن طاوس، عن ابن عباس، قال شهدت العيد مع رسول الله صلى الله عليه وسلم وأبي بكر وعمر وعثمان ـ رضى الله عنهم ـ فكلهم كانوا يصلون قبل الخطبة‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 963,
			"arabicnumber": 963,
			"text": "حدثنا يعقوب بن إبراهيم، قال حدثنا أبو أسامة، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم وأبو بكر وعمر ـ رضى الله عنهما ـ يصلون العيدين قبل الخطبة‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 964,
			"arabicnumber": 964,
			"text": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن عدي بن ثابت، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم صلى يوم الفطر ركعتين، لم يصل قبلها ولا بعدها، ثم أتى النساء ومعه بلال، فأمرهن بالصدقة، فجعلن يلقين، تلقي المرأة خرصها وسخابها‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 965,
			"arabicnumber": 965,
			"text": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا زبيد، قال سمعت الشعبي، عن البراء بن عازب، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن أول ما نبدأ في يومنا هذا أن نصلي، ثم نرجع فننحر، فمن فعل ذلك فقد أصاب سنتنا، ومن نحر قبل الصلاة فإنما هو لحم قدمه لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقال رجل من الأنصار يقال له أبو بردة بن نيار يا رسول الله، ذبحت وعندي جذعة خير من مسنة‏.‏ فقال ‏\"‏ اجعله مكانه، ولن توفي أو تجزي عن أحد بعدك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 966,
			"arabicnumber": 966,
			"text": "حدثنا زكرياء بن يحيى أبو السكين، قال حدثنا المحاربي، قال حدثنا محمد بن سوقة، عن سعيد بن جبير، قال كنت مع ابن عمر حين أصابه سنان الرمح في أخمص قدمه، فلزقت قدمه بالركاب، فنزلت فنزعتها وذلك بمنى، فبلغ الحجاج فجعل يعوده فقال الحجاج لو نعلم من أصابك‏.‏ فقال ابن عمر أنت أصبتني‏.‏ قال وكيف قال حملت السلاح في يوم لم يكن يحمل فيه، وأدخلت السلاح الحرم ولم يكن السلاح يدخل الحرم‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 967,
			"arabicnumber": 967,
			"text": "حدثنا أحمد بن يعقوب، قال حدثني إسحاق بن سعيد بن عمرو بن سعيد بن العاص، عن أبيه، قال دخل الحجاج على ابن عمر وأنا عنده، فقال كيف هو فقال صالح‏.‏ فقال من أصابك قال أصابني من أمر بحمل السلاح في يوم لا يحل فيه حمله، يعني الحجاج‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 968,
			"arabicnumber": 968,
			"text": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن زبيد، عن الشعبي، عن البراء، قال خطبنا النبي صلى الله عليه وسلم يوم النحر قال ‏\"‏ إن أول ما نبدأ به في يومنا هذا أن نصلي ثم نرجع فننحر، فمن فعل ذلك فقد أصاب سنتنا، ومن ذبح قبل أن يصلي فإنما هو لحم عجله لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقام خالي أبو بردة بن نيار فقال يا رسول الله، أنا ذبحت قبل أن أصلي وعندي جذعة خير من مسنة‏.‏ قال ‏\"‏ اجعلها مكانها ـ أو قال اذبحها ـ ولن تجزي جذعة عن أحد بعدك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 969,
			"arabicnumber": 969,
			"text": "حدثنا محمد بن عرعرة، قال حدثنا شعبة، عن سليمان، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ ما العمل في أيام العشر أفضل من العمل في هذه ‏\"‏‏.‏ قالوا ولا الجهاد قال ‏\"‏ ولا الجهاد، إلا رجل خرج يخاطر بنفسه وماله فلم يرجع بشىء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 970,
			"arabicnumber": 970,
			"text": "حدثنا أبو نعيم، قال حدثنا مالك بن أنس، قال حدثني محمد بن أبي بكر الثقفي، قال سألت أنسا ونحن غاديان من منى إلى عرفات عن التلبية كيف كنتم تصنعون مع النبي صلى الله عليه وسلم قال كان يلبي الملبي لا ينكر عليه، ويكبر المكبر فلا ينكر عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 971,
			"arabicnumber": 971,
			"text": "حدثنا محمد، حدثنا عمر بن حفص، قال حدثنا أبي، عن عاصم، عن حفصة، عن أم عطية، قالت كنا نؤمر أن نخرج يوم العيد، حتى نخرج البكر من خدرها، حتى نخرج الحيض فيكن خلف الناس، فيكبرن بتكبيرهم، ويدعون بدعائهم يرجون بركة ذلك اليوم وطهرته‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 972,
			"arabicnumber": 972,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الوهاب، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان تركز الحربة قدامه يوم الفطر والنحر ثم يصلي‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 973,
			"arabicnumber": 973,
			"text": "حدثنا إبراهيم بن المنذر، قال حدثنا الوليد، قال حدثنا أبو عمرو، قال أخبرني نافع، عن ابن عمر، قال كان النبي صلى الله عليه وسلم يغدو إلى المصلى، والعنزة بين يديه، تحمل وتنصب بالمصلى بين يديه فيصلي إليها‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 974,
			"arabicnumber": 974,
			"text": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد، عن أيوب، عن محمد، عن أم عطية، قالت أمرنا أن نخرج، العواتق وذوات الخدور‏.‏ وعن أيوب عن حفصة بنحوه‏.‏ وزاد في حديث حفصة قال أو قالت العواتق وذوات الخدور، ويعتزلن الحيض المصلى‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 975,
			"arabicnumber": 975,
			"text": "حدثنا عمرو بن عباس، قال حدثنا عبد الرحمن، حدثنا سفيان، عن عبد الرحمن، قال سمعت ابن عباس، قال خرجت مع النبي صلى الله عليه وسلم يوم فطر أو أضحى، فصلى ثم خطب، ثم أتى النساء فوعظهن وذكرهن، وأمرهن بالصدقة‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 976,
			"arabicnumber": 976,
			"text": "حدثنا أبو نعيم، قال حدثنا محمد بن طلحة، عن زبيد، عن الشعبي، عن البراء، قال خرج النبي صلى الله عليه وسلم يوم أضحى إلى البقيع فصلى ركعتين، ثم أقبل علينا بوجهه وقال ‏\"‏ إن أول نسكنا في يومنا هذا أن نبدأ بالصلاة، ثم نرجع فننحر، فمن فعل ذلك فقد وافق سنتنا، ومن ذبح قبل ذلك فإنما هو شىء عجله لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقام رجل فقال يا رسول الله، إني ذبحت وعندي جذعة خير من مسنة‏.‏ قال ‏\"‏ اذبحها، ولا تفي عن أحد بعدك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 977,
			"arabicnumber": 977,
			"text": "حدثنا مسدد، قال حدثنا يحيى، عن سفيان، قال حدثني عبد الرحمن بن عابس، قال سمعت ابن عباس، قيل له أشهدت العيد مع النبي صلى الله عليه وسلم قال نعم، ولولا مكاني من الصغر ما شهدته، حتى أتى العلم الذي عند دار كثير بن الصلت فصلى ثم خطب ثم أتى النساء، ومعه بلال، فوعظهن وذكرهن، وأمرهن بالصدقة، فرأيتهن يهوين بأيديهن يقذفنه في ثوب بلال، ثم انطلق هو وبلال إلى بيته‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 978,
			"arabicnumber": 978,
			"text": "حدثني إسحاق بن إبراهيم بن نصر، قال حدثنا عبد الرزاق، قال حدثنا ابن جريج، قال أخبرني عطاء، عن جابر بن عبد الله، قال سمعته يقول قام النبي صلى الله عليه وسلم يوم الفطر، فصلى فبدأ بالصلاة ثم خطب، فلما فرغ نزل فأتى النساء، فذكرهن وهو يتوكأ على يد بلال وبلال باسط ثوبه، يلقي فيه النساء الصدقة‏.‏ قلت لعطاء زكاة يوم الفطر قال لا ولكن صدقة يتصدقن حينئذ، تلقي فتخها ويلقين‏.‏ قلت أترى حقا على الإمام ذلك ويذكرهن قال إنه لحق عليهم، وما لهم لا يفعلونه",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 979,
			"arabicnumber": 979,
			"text": "قال ابن جريج وأخبرني الحسن بن مسلم، عن طاوس، عن ابن عباس ـ رضى الله عنهما ـ قال شهدت الفطر مع النبي صلى الله عليه وسلم وأبي بكر وعمر وعثمان ـ رضى الله عنهم ـ يصلونها قبل الخطبة، ثم يخطب بعد، خرج النبي صلى الله عليه وسلم كأني أنظر إليه حين يجلس بيده، ثم أقبل يشقهم حتى جاء النساء معه بلال فقال ‏{‏يا أيها النبي إذا جاءك المؤمنات يبايعنك‏}‏ الآية ثم قال حين فرغ منها ‏\"‏ آنتن على ذلك ‏\"‏‏.‏ قالت امرأة واحدة منهن لم يجبه غيرها نعم‏.‏ لا يدري حسن من هي‏.‏ قال ‏\"‏ فتصدقن ‏\"‏ فبسط بلال ثوبه ثم قال هلم لكن فداء أبي وأمي، فيلقين الفتخ والخواتيم في ثوب بلال‏.‏ قال عبد الرزاق الفتخ الخواتيم العظام كانت في الجاهلية‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 980,
			"arabicnumber": 980,
			"text": "حدثنا أبو معمر، قال حدثنا عبد الوارث، قال حدثنا أيوب، عن حفصة بنت سيرين، قالت كنا نمنع جوارينا أن يخرجن يوم العيد، فجاءت امرأة فنزلت قصر بني خلف فأتيتها فحدثت أن زوج أختها غزا مع النبي صلى الله عليه وسلم ثنتى عشرة غزوة فكانت أختها معه في ست غزوات‏.‏ فقالت فكنا نقوم على المرضى ونداوي الكلمى، فقالت يا رسول الله، على إحدانا بأس إذا لم يكن لها جلباب أن لا تخرج فقال ‏\"‏ لتلبسها صاحبتها من جلبابها فليشهدن الخير ودعوة المؤمنين ‏\"‏‏.‏ قالت حفصة فلما قدمت أم عطية أتيتها، فسألتها أسمعت في كذا وكذا قالت نعم، بأبي ـ وقلما ذكرت النبي صلى الله عليه وسلم إلا قالت بأبي ـ قال ‏\"‏ ليخرج العواتق ذوات الخدور ـ أو قال العواتق وذوات الخدور شك أيوب ـ والحيض، ويعتزل الحيض المصلى، وليشهدن الخير ودعوة المؤمنين ‏\"‏‏.‏ قالت فقلت لها آلحيض قالت نعم، أليس الحائض تشهد عرفات وتشهد كذا وتشهد كذا",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 981,
			"arabicnumber": 981,
			"text": "حدثنا محمد بن المثنى، قال حدثنا ابن أبي عدي، عن ابن عون، عن محمد، قال قالت أم عطية أمرنا أن نخرج فنخرج الحيض والعواتق وذوات الخدور‏.‏ قال ابن عون أو العواتق ذوات الخدور، فأما الحيض فيشهدن جماعة المسلمين ودعوتهم، ويعتزلن مصلاهم‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 982,
			"arabicnumber": 982,
			"text": "حدثنا عبد الله بن يوسف، قال حدثنا الليث، قال حدثني كثير بن فرقد، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان ينحر أو يذبح بالمصلى‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 983,
			"arabicnumber": 983,
			"text": "حدثنا مسدد، قال حدثنا أبو الأحوص، قال حدثنا منصور بن المعتمر، عن الشعبي، عن البراء بن عازب، قال خطبنا رسول الله صلى الله عليه وسلم يوم النحر بعد الصلاة فقال ‏\"‏ من صلى صلاتنا ونسك نسكنا فقد أصاب النسك، ومن نسك قبل الصلاة فتلك شاة لحم ‏\"‏‏.‏ فقام أبو بردة بن نيار فقال يا رسول الله والله لقد نسكت قبل أن أخرج إلى الصلاة، وعرفت أن اليوم يوم أكل وشرب فتعجلت وأكلت وأطعمت أهلي وجيراني‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ تلك شاة لحم ‏\"‏‏.‏ قال فإن عندي عناق جذعة، هي خير من شاتى لحم، فهل تجزي عني قال ‏\"‏ نعم، ولن تجزي عن أحد بعدك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 984,
			"arabicnumber": 984,
			"text": "حدثنا حامد بن عمر، عن حماد بن زيد، عن أيوب، عن محمد، أن أنس بن مالك، قال إن رسول الله صلى الله عليه وسلم صلى يوم النحر، ثم خطب فأمر من ذبح قبل الصلاة أن يعيد ذبحه فقام رجل من الأنصار فقال يا رسول الله، جيران لي ـ إما قال بهم خصاصة، وإما قال بهم فقر ـ وإني ذبحت قبل الصلاة وعندي عناق لي أحب إلى من شاتى لحم‏.‏ فرخص له فيها‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 985,
			"arabicnumber": 985,
			"text": "حدثنا مسلم، قال حدثنا شعبة، عن الأسود، عن جندب، قال صلى النبي صلى الله عليه وسلم يوم النحر ثم خطب، ثم ذبح فقال ‏ \"‏ من ذبح قبل أن يصلي فليذبح أخرى مكانها، ومن لم يذبح فليذبح باسم الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 986,
			"arabicnumber": 986,
			"text": "حدثنا محمد، قال أخبرنا أبو تميلة، يحيى بن واضح عن فليح بن سليمان، عن سعيد بن الحارث، عن جابر، قال كان النبي صلى الله عليه وسلم إذا كان يوم عيد خالف الطريق‏.‏ تابعه يونس بن محمد عن فليح‏.‏ وحديث جابر أصح‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 988,
			"arabicnumber": 988,
			"text": "",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 989,
			"arabicnumber": 989,
			"text": "حدثنا أبو الوليد، قال حدثنا شعبة، قال حدثني عدي بن ثابت، قال سمعت سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم خرج يوم الفطر، فصلى ركعتين لم يصل قبلها ولا بعدها ومعه بلال‏.‏",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 37
			}
		}
	]
}