{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"16": "Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1040,
			"arabicnumber": 1040,
			"text": "حدثنا عمرو بن عون، قال حدثنا خالد، عن يونس، عن الحسن، عن أبي بكرة، قال كنا عند رسول الله صلى الله عليه وسلم فانكسفت الشمس، فقام النبي صلى الله عليه وسلم يجر رداءه حتى دخل المسجد، فدخلنا فصلى بنا ركعتين، حتى انجلت الشمس فقال صلى الله عليه وسلم ‏ \"‏ إن الشمس والقمر لا ينكسفان لموت أحد، فإذا رأيتموهما فصلوا، وادعوا، حتى يكشف ما بكم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1041,
			"arabicnumber": 1041,
			"text": "حدثنا شهاب بن عباد، حدثنا إبراهيم بن حميد، عن إسماعيل، عن قيس، قال سمعت أبا مسعود، يقول قال النبي صلى الله عليه وسلم ‏ \"‏ إن الشمس والقمر لا ينكسفان لموت أحد من الناس، ولكنهما آيتان من آيات الله، فإذا رأيتموهما فقوموا فصلوا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1042,
			"arabicnumber": 1042,
			"text": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن ابن عمر ـ رضى الله عنهما ـ أنه كان يخبر عن النبي صلى الله عليه وسلم‏.‏ ‏ \"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموها فصلوا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1043,
			"arabicnumber": 1043,
			"text": "حدثنا عبد الله بن محمد، قال حدثنا هاشم بن القاسم، قال حدثنا شيبان أبو معاوية، عن زياد بن علاقة، عن المغيرة بن شعبة، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم يوم مات إبراهيم، فقال الناس كسفت الشمس لموت إبراهيم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الشمس والقمر لا ينكسفان لموت أحد ولا لحياته، فإذا رأيتم فصلوا وادعوا الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1044,
			"arabicnumber": 1044,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام بن عروة، عن أبيه، عن عائشة، أنها قالت خسفت الشمس في عهد رسول الله صلى الله عليه وسلم فصلى رسول الله صلى الله عليه وسلم بالناس، فقام فأطال القيام، ثم ركع فأطال الركوع، ثم قام فأطال القيام وهو دون القيام الأول، ثم ركع فأطال الركوع، وهو دون الركوع الأول، ثم سجد فأطال السجود، ثم فعل في الركعة الثانية مثل ما فعل في الأولى، ثم انصرف وقد انجلت الشمس، فخطب الناس، فحمد الله، وأثنى عليه ثم قال ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا ينخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فادعوا الله وكبروا، وصلوا وتصدقوا ‏\"‏‏.‏ ثم قال ‏\"‏ يا أمة محمد، والله ما من أحد أغير من الله أن يزني عبده أو تزني أمته، يا أمة محمد، والله لو تعلمون ما أعلم لضحكتم قليلا ولبكيتم كثيرا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1045,
			"arabicnumber": 1045,
			"text": "حدثنا إسحاق، قال أخبرنا يحيى بن صالح، قال حدثنا معاوية بن سلام بن أبي سلام الحبشي الدمشقي، قال حدثنا يحيى بن أبي كثير، قال أخبرني أبو سلمة بن عبد الرحمن بن عوف الزهري، عن عبد الله بن عمرو ـ رضى الله عنهما ـ قال لما كسفت الشمس على عهد رسول الله صلى الله عليه وسلم نودي إن الصلاة جامعة‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1046,
			"arabicnumber": 1046,
			"text": "حدثنا يحيى بن بكير، قال حدثني الليث، عن عقيل، عن ابن شهاب، ح وحدثني أحمد بن صالح، قال حدثنا عنبسة، قال حدثنا يونس، عن ابن شهاب، حدثني عروة، عن عائشة، زوج النبي صلى الله عليه وسلم قالت خسفت الشمس في حياة النبي صلى الله عليه وسلم فخرج إلى المسجد فصف الناس وراءه، فكبر فاقترأ رسول الله صلى الله عليه وسلم قراءة طويلة، ثم كبر فركع ركوعا طويلا، ثم قال سمع الله لمن حمده‏.‏ فقام ولم يسجد، وقرأ قراءة طويلة، هي أدنى من القراءة الأولى، ثم كبر وركع ركوعا طويلا، وهو أدنى من الركوع الأول، ثم قال سمع الله لمن حمده، ربنا ولك الحمد‏.‏ ثم سجد، ثم قال في الركعة الآخرة مثل ذلك، فاستكمل أربع ركعات في أربع سجدات، وانجلت الشمس قبل أن ينصرف، ثم قام فأثنى على الله بما هو أهله ثم قال ‏ \"‏ هما آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتموهما فافزعوا إلى الصلاة ‏\"‏‏.‏ وكان يحدث كثير بن عباس أن عبد الله بن عباس ـ رضى الله عنهما ـ كان يحدث يوم خسفت الشمس بمثل حديث عروة عن عائشة‏.‏ فقلت لعروة إن أخاك يوم خسفت بالمدينة لم يزد على ركعتين مثل الصبح‏.‏ قال أجل لأنه أخطأ السنة‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1047,
			"arabicnumber": 1047,
			"text": "حدثنا سعيد بن عفير، قال حدثنا الليث، حدثني عقيل، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته‏.‏ أن رسول الله صلى الله عليه وسلم صلى يوم خسفت الشمس، فقام فكبر، فقرأ قراءة طويلة، ثم ركع ركوعا طويلا، ثم رفع رأسه، فقال سمع الله لمن حمده‏.‏ وقام كما هو، ثم قرأ قراءة طويلة، وهى أدنى من القراءة الأولى، ثم ركع ركوعا طويلا، وهى أدنى من الركعة الأولى، ثم سجد سجودا طويلا، ثم فعل في الركعة الآخرة مثل ذلك، ثم سلم وقد تجلت الشمس، فخطب الناس، فقال في كسوف الشمس والقمر ‏ \"‏ إنهما آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتموهما فافزعوا إلى الصلاة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1048,
			"arabicnumber": 1048,
			"text": "حدثنا قتيبة بن سعيد، قال حدثنا حماد بن زيد، عن يونس، عن الحسن، عن أبي بكرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا ينكسفان لموت أحد، ولكن الله تعالى يخوف بها عباده ‏\"‏‏.‏ وقال أبو عبد الله لم يذكر عبد الوارث وشعبة وخالد بن عبد الله وحماد بن سلمة عن يونس ‏\"‏ يخوف بها عباده ‏\"‏‏.‏ وتابعه موسى عن مبارك عن الحسن قال أخبرني أبو بكرة عن النبي صلى الله عليه وسلم‏.‏ ‏\"‏ إن الله تعالى يخوف بهما عباده ‏\"‏‏.‏ وتابعه أشعث عن الحسن‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1050,
			"arabicnumber": 1050,
			"text": "",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1051,
			"arabicnumber": 1051,
			"text": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن عبد الله بن عمرو، أنه قال لما كسفت الشمس على عهد رسول الله صلى الله عليه وسلم نودي إن الصلاة جامعة فركع النبي صلى الله عليه وسلم ركعتين في سجدة ثم قام فركع ركعتين في سجدة، ثم جلس، ثم جلي عن الشمس‏.‏ قال وقالت عائشة ـ رضى الله عنها ـ ما سجدت سجودا قط كان أطول منها‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، قال انخسفت الشمس على عهد رسول الله صلى الله عليه وسلم، فصلى رسول الله صلى الله عليه وسلم، فقام قياما طويلا نحوا من قراءة سورة البقرة، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم سجد، ثم قام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم رفع فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم سجد، ثم انصرف وقد تجلت الشمس، فقال صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فاذكروا الله ‏\"‏‏.‏ قالوا يا رسول الله، رأيناك تناولت شيئا في مقامك، ثم رأيناك كعكعت‏.‏ قال صلى الله عليه وسلم ‏\"‏ إني رأيت الجنة، فتناولت عنقودا، ولو أصبته لأكلتم منه ما بقيت الدنيا، وأريت النار، فلم أر منظرا كاليوم قط أفظع، ورأيت أكثر أهلها النساء ‏\"‏‏.‏ قالوا بم يا رسول الله قال ‏\"‏ بكفرهن ‏\"‏‏.‏ قيل يكفرن بالله قال ‏\"‏ يكفرن العشير، ويكفرن الإحسان، لو أحسنت إلى إحداهن الدهر كله، ثم رأت منك شيئا قالت ما رأيت منك خيرا قط ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن امرأته، فاطمة بنت المنذر عن أسماء بنت أبي بكر ـ رضى الله عنهما ـ أنها قالت أتيت عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم حين خسفت الشمس، فإذا الناس قيام يصلون، وإذا هي قائمة تصلي فقلت ما للناس فأشارت بيدها إلى السماء، وقالت سبحان الله‏.‏ فقلت آية فأشارت أى نعم‏.‏ قالت فقمت حتى تجلاني الغشى، فجعلت أصب فوق رأسي الماء، فلما انصرف رسول الله صلى الله عليه وسلم حمد الله وأثنى عليه ثم قال ‏ \"‏ ما من شىء كنت لم أره إلا قد رأيته في مقامي هذا حتى الجنة والنار، ولقد أوحي إلى أنكم تفتنون في القبور مثل ـ أو قريبا من ـ فتنة الدجال ـ لا أدري أيتهما قالت أسماء ـ يؤتى أحدكم فيقال له ما علمك بهذا الرجل فأما المؤمن ـ أو الموقن لا أدري أى ذلك قالت أسماء ـ فيقول محمد رسول الله صلى الله عليه وسلم جاءنا بالبينات والهدى، فأجبنا وآمنا واتبعنا‏.‏ فيقال له نم صالحا، فقد علمنا إن كنت لموقنا‏.‏ وأما المنافق ـ أو المرتاب لا أدري أيتهما قالت أسماء ـ فيقول لا أدري، سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1054,
			"arabicnumber": 1054,
			"text": "حدثنا ربيع بن يحيى، قال حدثنا زائدة، عن هشام، عن فاطمة، عن أسماء، قالت لقد أمر النبي صلى الله عليه وسلم بالعتاقة في كسوف الشمس‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1056,
			"arabicnumber": 1056,
			"text": "",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1057,
			"arabicnumber": 1057,
			"text": "حدثنا مسدد، قال حدثنا يحيى، عن إسماعيل، قال حدثني قيس، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الشمس والقمر لا ينكسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموهما فصلوا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1058,
			"arabicnumber": 1058,
			"text": "حدثنا عبد الله بن محمد، قال حدثنا هشام، أخبرنا معمر، عن الزهري، وهشام بن عروة، عن عروة، عن عائشة ـ رضى الله عنها ـ قالت كسفت الشمس على عهد رسول الله صلى الله عليه وسلم فقام النبي صلى الله عليه وسلم فصلى بالناس، فأطال القراءة، ثم ركع فأطال الركوع، ثم رفع رأسه فأطال القراءة، وهى دون قراءته الأولى، ثم ركع فأطال الركوع دون ركوعه الأول، ثم رفع رأسه فسجد سجدتين، ثم قام فصنع في الركعة الثانية مثل ذلك، ثم قام فقال ‏ \"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله يريهما عباده، فإذا رأيتم ذلك فافزعوا إلى الصلاة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1059,
			"arabicnumber": 1059,
			"text": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال خسفت الشمس، فقام النبي صلى الله عليه وسلم فزعا، يخشى أن تكون الساعة، فأتى المسجد، فصلى بأطول قيام وركوع وسجود رأيته قط يفعله وقال ‏ \"‏ هذه الآيات التي يرسل الله لا تكون لموت أحد ولا لحياته، ولكن يخوف الله به عباده، فإذا رأيتم شيئا من ذلك فافزعوا إلى ذكره ودعائه واستغفاره ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1060,
			"arabicnumber": 1060,
			"text": "حدثنا أبو الوليد، قال حدثنا زائدة، قال حدثنا زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول انكسفت الشمس يوم مات إبراهيم، فقال الناس انكسفت لموت إبراهيم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الشمس والقمر آيتان من آيات الله، لا ينكسفان لموت أحد ولا لحياته، فإذا رأيتموهما فادعوا الله وصلوا حتى ينجلي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"text": "وقال أبو أسامة حدثنا هشام، قال أخبرتني فاطمة بنت المنذر، عن أسماء، قالت فانصرف رسول الله صلى الله عليه وسلم وقد تجلت الشمس فخطب، فحمد الله بما هو أهله ثم قال ‏ \"‏ أما بعد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1062,
			"arabicnumber": 1062,
			"text": "حدثنا محمود، قال حدثنا سعيد بن عامر، عن شعبة، عن يونس، عن الحسن، عن أبي بكرة ـ رضى الله عنه ـ قال انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم فصلى ركعتين‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1063,
			"arabicnumber": 1063,
			"text": "حدثنا أبو معمر، قال حدثنا عبد الوارث، قال حدثنا يونس، عن الحسن، عن أبي بكرة، قال خسفت الشمس على عهد رسول الله صلى الله عليه وسلم فخرج يجر رداءه حتى انتهى إلى المسجد، وثاب الناس إليه فصلى بهم ركعتين، فانجلت الشمس فقال ‏ \"‏ إن الشمس والقمر آيتان من آيات الله، وإنهما لا يخسفان لموت أحد، وإذا كان ذاك فصلوا وادعوا حتى يكشف ما بكم ‏\"‏‏.‏ وذاك أن ابنا للنبي صلى الله عليه وسلم مات، يقال له إبراهيم، فقال الناس في ذاك‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "حدثنا محمود، قال حدثنا أبو أحمد، قال حدثنا سفيان، عن يحيى، عن عمرة، عن عائشة ـ رضى الله عنها أن النبي صلى الله عليه وسلم صلى بهم في كسوف الشمس أربع ركعات في سجدتين، الأول الأول أطول‏.‏",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1066,
			"arabicnumber": 1066,
			"text": "",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 24
			}
		}
	]
}