{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"19": "Prayer at Night (Tahajjud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"text": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حدثنا سليمان بن أبي مسلم، عن طاوس، سمع ابن عباس ـ رضى الله عنهما ـ قال كان النبي صلى الله عليه وسلم إذا قام من الليل يتهجد قال ‏\"‏ اللهم لك الحمد أنت قيم السموات والأرض ومن فيهن ولك الحمد، لك ملك السموات والأرض ومن فيهن، ولك الحمد أنت نور السموات والأرض، ولك الحمد أنت الحق، ووعدك الحق، ولقاؤك حق، وقولك حق، والجنة حق، والنار حق، والنبيون حق، ومحمد صلى الله عليه وسلم حق، والساعة حق، اللهم لك أسلمت، وبك آمنت وعليك توكلت، وإليك أنبت، وبك خاصمت، وإليك حاكمت، فاغفر لي ما قدمت وما أخرت، وما أسررت وما أعلنت، أنت المقدم وأنت المؤخر، لا إله إلا أنت ـ أو لا إله غيرك ـ ‏\"‏‏.‏ قال سفيان وزاد عبد الكريم أبو أمية ‏\"‏ ولا حول ولا قوة إلا بالله ‏\"‏‏.‏ قال سفيان قال سليمان بن أبي مسلم سمعه من طاوس عن ابن عباس ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1122,
			"arabicnumber": 1122,
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1123,
			"arabicnumber": 1123,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني عروة، أن عائشة ـ رضى الله عنها ـ أخبرته أن رسول الله صلى الله عليه وسلم كان يصلي إحدى عشرة ركعة، كانت تلك صلاته، يسجد السجدة من ذلك قدر ما يقرأ أحدكم خمسين آية قبل أن يرفع رأسه، ويركع ركعتين قبل صلاة الفجر، ثم يضطجع على شقه الأيمن حتى يأتيه المنادي للصلاة‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1124,
			"arabicnumber": 1124,
			"text": "حدثنا أبو نعيم، قال حدثنا سفيان، عن الأسود، قال سمعت جندبا، يقول اشتكى النبي صلى الله عليه وسلم فلم يقم ليلة أو ليلتين‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1125,
			"arabicnumber": 1125,
			"text": "حدثنا محمد بن كثير، قال أخبرنا سفيان، عن الأسود بن قيس، عن جندب بن عبد الله ـ رضى الله عنه ـ قال احتبس جبريل صلى الله عليه وسلم على النبي صلى الله عليه وسلم فقالت امرأة من قريش أبطأ عليه شيطانه‏.‏ فنزلت ‏{‏والضحى * والليل إذا سجى * ما ودعك ربك وما قلى‏}‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1126,
			"arabicnumber": 1126,
			"text": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن هند بنت الحارث، عن أم سلمة ـ رضى الله عنها ـ أن النبي صلى الله عليه وسلم استيقظ ليلة فقال ‏ \"‏ سبحان الله ماذا أنزل الليلة من الفتنة، ماذا أنزل من الخزائن من يوقظ صواحب الحجرات، يا رب كاسية في الدنيا عارية في الآخرة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1127,
			"arabicnumber": 1127,
			"text": "{حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني علي بن حسين، أن حسين بن علي، أخبره أن علي بن أبي طالب أخبره أن رسول الله صلى الله عليه وسلم طرقه وفاطمة بنت النبي ـ عليه السلام ـ ليلة فقال ‏\"‏ ألا تصليان ‏\"‏‏.‏ فقلت يا رسول الله، أنفسنا بيد الله، فإذا شاء أن يبعثنا بعثنا‏.‏ فانصرف حين قلنا ذلك ولم يرجع إلى شيئا‏.‏ ثم سمعته وهو مول يضرب فخذه وهو يقول ‏\"‏وكان الإنسان أكثر شىء جدلا‏}‏‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1128,
			"arabicnumber": 1128,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن ابن شهاب، عن عروة، عن عائشة ـ رضى الله عنها ـ قالت إن كان رسول الله صلى الله عليه وسلم ليدع العمل وهو يحب أن يعمل به خشية أن يعمل به الناس فيفرض عليهم، وما سبح رسول الله صلى الله عليه وسلم سبحة الضحى قط، وإني لأسبحها‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1129,
			"arabicnumber": 1129,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن ابن شهاب، عن عروة بن الزبير، عن عائشة أم المؤمنين ـ رضى الله عنها أن رسول الله صلى الله عليه وسلم صلى ذات ليلة في المسجد فصلى بصلاته ناس، ثم صلى من القابلة فكثر الناس، ثم اجتمعوا من الليلة الثالثة أو الرابعة، فلم يخرج إليهم رسول الله صلى الله عليه وسلم، فلما أصبح قال ‏ \"‏ قد رأيت الذي صنعتم ولم يمنعني من الخروج إليكم إلا أني خشيت أن تفرض عليكم ‏\"‏، وذلك في رمضان‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1130,
			"arabicnumber": 1130,
			"text": "حدثنا أبو نعيم، قال حدثنا مسعر، عن زياد، قال سمعت المغيرة ـ رضى الله عنه ـ يقول إن كان النبي صلى الله عليه وسلم ليقوم ليصلي حتى ترم قدماه أو ساقاه، فيقال له فيقول ‏ \"‏ أفلا أكون عبدا شكورا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1131,
			"arabicnumber": 1131,
			"text": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حدثنا عمرو بن دينار، أن عمرو بن أوس، أخبره أن عبد الله بن عمرو بن العاص ـ رضى الله عنهما ـ أخبره أن رسول الله صلى الله عليه وسلم قال له ‏ \"‏ أحب الصلاة إلى الله صلاة داود ـ عليه السلام ـ وأحب الصيام إلى الله صيام داود، وكان ينام نصف الليل ويقوم ثلثه وينام سدسه، ويصوم يوما ويفطر يوما ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1132,
			"arabicnumber": 1132,
			"text": "حدثني عبدان، قال أخبرني أبي، عن شعبة، عن أشعث، سمعت أبي قال، سمعت مسروقا، قال سألت عائشة ـ رضى الله عنها ـ أى العمل كان أحب إلى النبي صلى الله عليه وسلم قالت الدائم‏.‏ قلت متى كان يقوم قالت يقوم إذا سمع الصارخ‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1133,
			"arabicnumber": 1133,
			"text": "حدثنا موسى بن إسماعيل، قال حدثنا إبراهيم بن سعد، قال ذكر أبي عن أبي سلمة، عن عائشة ـ رضى الله عنها ـ قالت ما ألفاه السحر عندي إلا نائما‏.‏ تعني النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1134,
			"arabicnumber": 1134,
			"text": "حدثنا يعقوب بن إبراهيم، قال حدثنا روح، قال حدثنا سعيد، عن قتادة، عن أنس بن مالك ـ رضى الله عنه ـ أن نبي الله صلى الله عليه وسلم وزيد بن ثابت ـ رضى الله عنه ـ تسحرا، فلما فرغا من سحورهما قام نبي الله صلى الله عليه وسلم إلى الصلاة فصلى‏.‏ قلنا لأنس كم كان بين فراغهما من سحورهما ودخولهما في الصلاة قال كقدر ما يقرأ الرجل خمسين آية‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"text": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الأعمش، عن أبي وائل، عن عبد الله ـ رضى الله عنه ـ قال صليت مع النبي صلى الله عليه وسلم ليلة، فلم يزل قائما حتى هممت بأمر سوء‏.‏ قلنا وما هممت قال هممت أن أقعد وأذر النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "حدثنا حفص بن عمر، قال حدثنا خالد بن عبد الله، عن حصين، عن أبي وائل، عن حذيفة ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم كان إذا قام للتهجد من الليل يشوص فاه بالسواك‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1137,
			"arabicnumber": 1137,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني سالم بن عبد الله، أن عبد الله بن عمر ـ رضى الله عنهما ـ قال إن رجلا قال يا رسول الله، كيف صلاة الليل قال ‏ \"‏ مثنى مثنى، فإذا خفت الصبح فأوتر بواحدة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1138,
			"arabicnumber": 1138,
			"text": "حدثنا مسدد، قال حدثنا يحيى، عن شعبة، قال حدثني أبو جمرة، عن ابن عباس ـ رضى الله عنهما ـ قال كان صلاة النبي صلى الله عليه وسلم ثلاث عشرة ركعة‏.‏ يعني بالليل‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1139,
			"arabicnumber": 1139,
			"text": "حدثنا إسحاق، قال حدثنا عبيد الله، قال أخبرنا إسرائيل، عن أبي حصين، عن يحيى بن وثاب، عن مسروق، قال سألت عائشة ـ رضى الله عنها ـ عن صلاة رسول الله صلى الله عليه وسلم بالليل‏.‏ فقالت سبع وتسع وإحدى عشرة سوى ركعتى الفجر‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1140,
			"arabicnumber": 1140,
			"text": "حدثنا عبيد الله بن موسى، قال أخبرنا حنظلة، عن القاسم بن محمد، عن عائشة ـ رضى الله عنها ـ قالت كان النبي صلى الله عليه وسلم يصلي من الليل ثلاث عشرة ركعة منها الوتر وركعتا الفجر‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1141,
			"arabicnumber": 1141,
			"text": "حدثنا عبد العزيز بن عبد الله، قال حدثني محمد بن جعفر، عن حميد، أنه سمع أنسا ـ رضى الله عنه ـ يقول كان رسول الله صلى الله عليه وسلم يفطر من الشهر حتى نظن أن لا يصوم منه، ويصوم حتى نظن أن لا يفطر منه شيئا، وكان لا تشاء أن تراه من الليل مصليا إلا رأيته ولا نائما إلا رأيته‏.‏ تابعه سليمان وأبو خالد الأحمر عن حميد‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1142,
			"arabicnumber": 1142,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يعقد الشيطان على قافية رأس أحدكم إذا هو نام ثلاث عقد، يضرب كل عقدة عليك ليل طويل فارقد، فإن استيقظ فذكر الله انحلت عقدة، فإن توضأ انحلت عقدة، فإن صلى انحلت عقدة فأصبح نشيطا طيب النفس، وإلا أصبح خبيث النفس كسلان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1143,
			"arabicnumber": 1143,
			"text": "حدثنا مؤمل بن هشام، قال حدثنا إسماعيل، قال حدثنا عوف، قال حدثنا أبو رجاء، قال حدثنا سمرة بن جندب ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم في الرؤيا قال ‏ \"‏ أما الذي يثلغ رأسه بالحجر فإنه يأخذ القرآن فيرفضه وينام عن الصلاة المكتوبة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1144,
			"arabicnumber": 1144,
			"text": "حدثنا مسدد، قال حدثنا أبو الأحوص، قال حدثنا منصور، عن أبي وائل، عن عبد الله ـ رضى الله عنه ـ قال ذكر عند النبي صلى الله عليه وسلم رجل فقيل ما زال نائما حتى أصبح ما قام إلى الصلاة‏.‏ فقال ‏ \"‏ بال الشيطان في أذنه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1145,
			"arabicnumber": 1145,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن أبي سلمة، وأبي عبد الله الأغر، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ينزل ربنا تبارك وتعالى كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر يقول من يدعوني فأستجيب له من يسألني فأعطيه من يستغفرني فأغفر له ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1146,
			"arabicnumber": 1146,
			"text": "حدثنا أبو الوليد، حدثنا شعبة،‏.‏ وحدثني سليمان، قال حدثنا شعبة، عن أبي إسحاق، عن الأسود، قال سألت عائشة ـ رضى الله عنها ـ كيف صلاة النبي صلى الله عليه وسلم بالليل قالت كان ينام أوله ويقوم آخره، فيصلي ثم يرجع إلى فراشه، فإذا أذن المؤذن وثب، فإن كان به حاجة اغتسل، وإلا توضأ وخرج‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن سعيد بن أبي سعيد المقبري، عن أبي سلمة بن عبد الرحمن، أنه أخبره أنه، سأل عائشة ـ رضى الله عنها ـ كيف كانت صلاة رسول الله صلى الله عليه وسلم في رمضان فقالت ما كان رسول الله صلى الله عليه وسلم يزيد في رمضان ولا في غيره على إحدى عشرة ركعة، يصلي أربعا فلا تسل عن حسنهن وطولهن، ثم يصلي أربعا فلا تسل عن حسنهن وطولهن، ثم يصلي ثلاثا، قالت عائشة فقلت يا رسول الله أتنام قبل أن توتر‏.‏ فقال ‏ \"‏ يا عائشة، إن عينى تنامان ولا ينام قلبي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1148,
			"arabicnumber": 1148,
			"text": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، عن هشام، قال أخبرني أبي، عن عائشة ـ رضى الله عنها ـ قالت ما رأيت النبي صلى الله عليه وسلم يقرأ في شىء من صلاة الليل جالسا، حتى إذا كبر قرأ جالسا، فإذا بقي عليه من السورة ثلاثون أو أربعون آية قام فقرأهن ثم ركع‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1149,
			"arabicnumber": 1149,
			"text": "حدثنا إسحاق بن نصر، حدثنا أبو أسامة، عن أبي حيان، عن أبي زرعة، عن أبي هريرة ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم قال لبلال عند صلاة الفجر ‏ \"‏ يا بلال حدثني بأرجى عمل عملته في الإسلام، فإني سمعت دف نعليك بين يدى في الجنة ‏\"‏‏.‏ قال ما عملت عملا أرجى عندي أني لم أتطهر طهورا في ساعة ليل أو نهار إلا صليت بذلك الطهور ما كتب لي أن أصلي‏.‏ قال أبو عبد الله دف نعليك يعني تحريك‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1150,
			"arabicnumber": 1150,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، عن عبد العزيز بن صهيب، عن أنس بن مالك ـ رضى الله عنه ـ قال دخل النبي صلى الله عليه وسلم فإذا حبل ممدود بين الساريتين فقال ‏\"‏ ما هذا الحبل ‏\"‏‏.‏ قالوا هذا حبل لزينب فإذا فترت تعلقت‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا، حلوه، ليصل أحدكم نشاطه، فإذا فتر فليقعد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1151,
			"arabicnumber": 1151,
			"text": "قال وقال عبد الله بن مسلمة عن مالك، عن هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت كانت عندي امرأة من بني أسد فدخل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ من هذه ‏\"‏‏.‏ قلت فلانة لا تنام بالليل‏.‏ فذكر من صلاتها فقال ‏\"‏ مه عليكم ما تطيقون من الأعمال، فإن الله لا يمل حتى تملوا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1152,
			"arabicnumber": 1152,
			"text": "حدثنا عباس بن الحسين، حدثنا مبشر، عن الأوزاعي،‏.‏ وحدثني محمد بن مقاتل أبو الحسن، قال أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثني عبد الله بن عمرو بن العاص ـ رضى الله عنهما ـ قال قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ يا عبد الله، لا تكن مثل فلان، كان يقوم الليل فترك قيام الليل ‏\"‏‏.‏ وقال هشام حدثنا ابن أبي العشرين، حدثنا الأوزاعي، قال حدثني يحيى، عن عمر بن الحكم بن ثوبان، قال حدثني أبو سلمة، مثله‏.‏ وتابعه عمرو بن أبي سلمة عن الأوزاعي،‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1153,
			"arabicnumber": 1153,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو، عن أبي العباس، قال سمعت عبد الله بن عمرو ـ رضى الله عنهما ـ قال لي النبي صلى الله عليه وسلم ‏\"‏ ألم أخبر أنك تقوم الليل وتصوم النهار ‏\"‏ قلت إني أفعل ذلك‏.‏ قال ‏\"‏ فإنك إذا فعلت ذلك هجمت عينك ونفهت نفسك، وإن لنفسك حق، ولأهلك حق، فصم وأفطر، وقم ونم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1154,
			"arabicnumber": 1154,
			"text": "حدثنا صدقة بن الفضل، أخبرنا الوليد، عن الأوزاعي، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثني عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من تعار من الليل فقال لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شىء قدير‏.‏ الحمد لله، وسبحان الله، ولا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله‏.‏ ثم قال اللهم اغفر لي‏.‏ أو دعا استجيب، فإن توضأ وصلى قبلت صلاته ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1155,
			"arabicnumber": 1155,
			"text": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن يونس، عن ابن شهاب، أخبرني الهيثم بن أبي سنان، أنه سمع أبا هريرة ـ رضى الله عنه ـ وهو يقصص في قصصه وهو يذكر رسول الله صلى الله عليه وسلم إن أخا لكم لا يقول الرفث‏.‏ يعني بذلك عبد الله بن رواحة وفينا رسول الله يتلو كتابه إذا انشق معروف من الفجر ساطع أرانا الهدى بعد العمى فقلوبنا به موقنات أن ما قال واقع يبيت يجافي جنبه عن فراشه إذا استثقلت بالمشركين المضاجع تابعه عقيل‏.‏ وقال الزبيدي أخبرني الزهري عن سعيد والأعرج عن أبي هريرة ـ رضى الله عنه‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1158,
			"arabicnumber": 1158,
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1159,
			"arabicnumber": 1159,
			"text": "حدثنا عبد الله بن يزيد، حدثنا سعيد ـ هو ابن أبي أيوب ـ قال حدثني جعفر بن ربيعة، عن عراك بن مالك، عن أبي سلمة، عن عائشة ـ رضى الله عنها ـ قالت صلى النبي صلى الله عليه وسلم العشاء ثم صلى ثمان ركعات وركعتين جالسا وركعتين بين النداءين، ولم يكن يدعهما أبدا‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1160,
			"arabicnumber": 1160,
			"text": "حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، قال حدثني أبو الأسود، عن عروة بن الزبير، عن عائشة ـ رضى الله عنها ـ قالت كان النبي صلى الله عليه وسلم إذا صلى ركعتى الفجر اضطجع على شقه الأيمن‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1161,
			"arabicnumber": 1161,
			"text": "حدثنا بشر بن الحكم، حدثنا سفيان، قال حدثني سالم أبو النضر، عن أبي سلمة، عن عائشة ـ رضى الله عنها ـ أن النبي صلى الله عليه وسلم كان إذا صلى ‏{‏سنة الفجر‏}‏ فإن كنت مستيقظة حدثني وإلا اضطجع حتى يؤذن بالصلاة‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1162,
			"arabicnumber": 1162,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال أبو النضر عن أبي سلمة، عن عائشة ـ رضى الله عنها ـ أن النبي صلى الله عليه وسلم كان يصلي ركعتين فإن كنت مستيقظة حدثني وإلا اضطجع‏.‏ قلت لسفيان فإن بعضهم يرويه ركعتى الفجر‏.‏ قال سفيان هو ذاك‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1163,
			"arabicnumber": 1163,
			"text": "حدثنا بيان بن عمرو، حدثنا يحيى بن سعيد، حدثنا ابن جريج، عن عطاء، عن عبيد بن عمير، عن عائشة ـ رضى الله عنها ـ قالت لم يكن النبي صلى الله عليه وسلم على شىء من النوافل أشد منه تعاهدا على ركعتى الفجر‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1164,
			"arabicnumber": 1164,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت كان رسول الله صلى الله عليه وسلم يصلي بالليل ثلاث عشرة ركعة، ثم يصلي إذا سمع النداء بالصبح ركعتين خفيفتين‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1165,
			"arabicnumber": 1165,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، حدثنا شعبة، عن محمد بن عبد الرحمن، عن عمته، عمرة عن عائشة ـ رضى الله عنها ـ قالت كان النبي صلى الله عليه وسلم ح وحدثنا أحمد بن يونس حدثنا زهير حدثنا يحيى ـ هو ابن سعيد ـ عن محمد بن عبد الرحمن عن عمرة عن عائشة ـ رضى الله عنها ـ قالت كان النبي صلى الله عليه وسلم يخفف الركعتين اللتين قبل صلاة الصبح حتى إني لأقول هل قرأ بأم الكتاب",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1166,
			"arabicnumber": 1166,
			"text": "حدثنا قتيبة، قال حدثنا عبد الرحمن بن أبي الموالي، عن محمد بن المنكدر، عن جابر بن عبد الله ـ رضى الله عنهما ـ قال كان رسول الله صلى الله عليه وسلم يعلمنا الاستخارة في الأمور كما يعلمنا السورة من القرآن يقول ‏ \"‏ إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ثم ليقل اللهم إني أستخيرك بعلمك وأستقدرك بقدرتك، وأسألك من فضلك العظيم، فإنك تقدر ولا أقدر وتعلم ولا أعلم وأنت علام الغيوب، اللهم إن كنت تعلم أن هذا الأمر خير لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجل أمري وآجله ـ فاقدره لي ويسره لي ثم بارك لي فيه، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري ـ أو قال في عاجل أمري وآجله ـ فاصرفه عني واصرفني عنه، واقدر لي الخير حيث كان ثم أرضني به ـ قال ـ ويسمي حاجته ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1167,
			"arabicnumber": 1167,
			"text": "حدثنا المكي بن إبراهيم، عن عبد الله بن سعيد، عن عامر بن عبد الله بن الزبير، عن عمرو بن سليم الزرقي، سمع أبا قتادة بن ربعي الأنصاري ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ إذا دخل أحدكم المسجد فلا يجلس حتى يصلي ركعتين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1168,
			"arabicnumber": 1168,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك ـ رضى الله عنه ـ قال صلى لنا رسول الله صلى الله عليه وسلم ركعتين ثم انصرف‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1169,
			"arabicnumber": 1169,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني سالم، عن عبد الله بن عمر ـ رضى الله عنهما ـ قال صليت مع رسول الله صلى الله عليه وسلم ركعتين قبل الظهر، وركعتين بعد الظهر، وركعتين بعد الجمعة، وركعتين بعد المغرب، وركعتين بعد العشاء‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1170,
			"arabicnumber": 1170,
			"text": "حدثنا آدم، قال أخبرنا شعبة، أخبرنا عمرو بن دينار، قال سمعت جابر بن عبد الله ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم وهو يخطب ‏ \"‏ إذا جاء أحدكم والإمام يخطب ـ أو قد خرج ـ فليصل ركعتين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1171,
			"arabicnumber": 1171,
			"text": "حدثنا أبو نعيم، قال حدثنا سيف بن سليمان المكي، سمعت مجاهدا، يقول أتي ابن عمر ـ رضى الله عنهما ـ في منزله فقيل له هذا رسول الله صلى الله عليه وسلم قد دخل الكعبة قال فأقبلت فأجد رسول الله صلى الله عليه وسلم قد خرج، وأجد بلالا عند الباب قائما فقلت يا بلال، صلى رسول الله صلى الله عليه وسلم في الكعبة قال نعم‏.‏ قلت فأين قال بين هاتين الأسطوانتين‏.‏ ثم خرج فصلى ركعتين في وجه الكعبة‏.‏ قال أبو عبد الله قال أبو هريرة ـ رضى الله عنه ـ أوصاني النبي صلى الله عليه وسلم بركعتى الضحى‏.‏ وقال عتبان غدا على رسول الله صلى الله عليه وسلم وأبو بكر ـ رضى الله عنه ـ بعد ما امتد النهار وصففنا وراءه فركع ركعتين‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1173,
			"arabicnumber": 1173,
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1174,
			"arabicnumber": 1174,
			"text": "حدثنا علي بن عبد الله، قال حدثنا سفيان، عن عمرو، قال سمعت أبا الشعثاء، جابرا قال سمعت ابن عباس ـ رضى الله عنه ـ قال صليت مع رسول الله صلى الله عليه وسلم ثمانيا جميعا وسبعا جميعا‏.‏ قلت يا أبا الشعثاء أظنه أخر الظهر وعجل العصر وعجل العشاء وأخر المغرب‏.‏ قال وأنا أظنه‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1175,
			"arabicnumber": 1175,
			"text": "حدثنا مسدد، قال حدثنا يحيى، عن شعبة، عن توبة، عن مورق، قال قلت لابن عمر ـ رضى الله عنهما ـ أتصلي الضحى قال لا‏.‏ قلت فعمر‏.‏ قال لا‏.‏ قلت فأبو بكر‏.‏ قال لا‏.‏ قلت فالنبي صلى الله عليه وسلم قال لا إخاله‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1176,
			"arabicnumber": 1176,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، قال سمعت عبد الرحمن بن أبي ليلى، يقول ما حدثنا أحد، أنه رأى النبي صلى الله عليه وسلم يصلي الضحى غير أم هانئ فإنها قالت إن النبي صلى الله عليه وسلم دخل بيتها يوم فتح مكة فاغتسل وصلى ثماني ركعات فلم أر صلاة قط أخف منها، غير أنه يتم الركوع والسجود‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1177,
			"arabicnumber": 1177,
			"text": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن الزهري، عن عروة، عن عائشة ـ رضى الله عنها ـ قالت ما رأيت رسول الله صلى الله عليه وسلم سبح سبحة الضحى، وإني لأسبحها‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1178,
			"arabicnumber": 1178,
			"text": "حدثنا مسلم بن إبراهيم، أخبرنا شعبة، حدثنا عباس الجريري ـ هو ابن فروخ ـ عن أبي عثمان النهدي، عن أبي هريرة، رضى الله عنه قال أوصاني خليلي بثلاث لا أدعهن حتى أموت صوم ثلاثة أيام من كل شهر، وصلاة الضحى، ونوم على وتر‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1179,
			"arabicnumber": 1179,
			"text": "حدثنا علي بن الجعد، أخبرنا شعبة، عن أنس بن سيرين، قال سمعت أنس بن مالك الأنصاري، قال قال رجل من الأنصار ـ وكان ضخما ـ للنبي صلى الله عليه وسلم إني لا أستطيع الصلاة معك‏.‏ فصنع للنبي صلى الله عليه وسلم طعاما، فدعاه إلى بيته، ونضح له طرف حصير بماء فصلى عليه ركعتين‏.‏ وقال فلان بن فلان بن جارود لأنس ـ رضى الله عنه ـ أكان النبي صلى الله عليه وسلم يصلي الضحى فقال ما رأيته صلى غير ذلك اليوم‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1181,
			"arabicnumber": 1181,
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1182,
			"arabicnumber": 1182,
			"text": "حدثنا مسدد، قال حدثنا يحيى، عن شعبة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن عائشة ـ رضى الله عنها ـ أن النبي صلى الله عليه وسلم كان لا يدع أربعا قبل الظهر وركعتين قبل الغداة‏.‏ تابعه ابن أبي عدي وعمرو عن شعبة‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1183,
			"arabicnumber": 1183,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن ابن بريدة، قال حدثني عبد الله المزني، عن النبي صلى الله عليه وسلم قال ‏ \"‏ صلوا قبل صلاة المغرب ‏\"‏‏.‏ ـ قال في الثالثة ـ لمن شاء كراهية أن يتخذها الناس سنة‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1184,
			"arabicnumber": 1184,
			"text": "حدثنا عبد الله بن يزيد، قال حدثنا سعيد بن أبي أيوب، قال حدثني يزيد بن أبي حبيب، قال سمعت مرثد بن عبد الله اليزني، قال أتيت عقبة بن عامر الجهني فقلت ألا أعجبك من أبي تميم يركع ركعتين قبل صلاة المغرب‏.‏ فقال عقبة إنا كنا نفعله على عهد رسول الله صلى الله عليه وسلم‏.‏ قلت فما يمنعك الآن قال الشغل‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1185,
			"arabicnumber": 1185,
			"text": "حدثني إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن شهاب، قال أخبرني محمود بن الربيع الأنصاري، أنه عقل رسول الله صلى الله عليه وسلم، وعقل مجة مجها في وجهه من بئر كانت في دارهم‏.‏ فزعم محمود أنه سمع عتبان بن مالك الأنصاري ـ رضى الله عنه ـ وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم يقول كنت أصلي لقومي ببني سالم، وكان يحول بيني وبينهم واد إذا جاءت الأمطار فيشق على اجتيازه قبل مسجدهم، فجئت رسول الله صلى الله عليه وسلم فقلت له إني أنكرت بصري، وإن الوادي الذي بيني وبين قومي يسيل إذا جاءت الأمطار فيشق على اجتيازه، فوددت أنك تأتي فتصلي من بيتي مكانا أتخذه مصلى‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سأفعل ‏\"‏‏.‏ فغدا على رسول الله صلى الله عليه وسلم وأبو بكر ـ رضى الله عنه ـ بعد ما اشتد النهار فاستأذن رسول الله صلى الله عليه وسلم فأذنت له فلم يجلس حتى قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ فأشرت له إلى المكان الذي أحب أن أصلي فيه، فقام رسول الله صلى الله عليه وسلم فكبر وصففنا وراءه، فصلى ركعتين، ثم سلم وسلمنا حين سلم، فحبسته على خزير يصنع له فسمع أهل الدار رسول الله صلى الله عليه وسلم في بيتي فثاب رجال منهم حتى كثر الرجال في البيت‏.‏ فقال رجل منهم ما فعل مالك لا أراه‏.‏ فقال رجل منهم ذاك منافق لا يحب الله ورسوله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقل ذاك ألا تراه قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ فقال الله ورسوله أعلم‏.‏ أما نحن فوالله لا نرى وده ولا حديثه إلا إلى المنافقين‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فإن الله قد حرم على النار من قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ قال محمود فحدثتها قوما فيهم أبو أيوب صاحب رسول الله صلى الله عليه وسلم في غزوته التي توفي فيها ويزيد بن معاوية عليهم بأرض الروم، فأنكرها على أبو أيوب قال والله ما أظن رسول الله صلى الله عليه وسلم قال ما قلت قط‏.‏ فكبر ذلك على فجعلت لله على إن سلمني حتى أقفل من غزوتي أن أسأل عنها عتبان بن مالك ـ رضى الله عنه ـ إن وجدته حيا في مسجد قومه، فقفلت فأهللت بحجة أو بعمرة، ثم سرت حتى قدمت المدينة فأتيت بني سالم، فإذا عتبان شيخ أعمى يصلي لقومه فلما سلم من الصلاة سلمت عليه وأخبرته من أنا، ثم سألته عن ذلك الحديث فحدثنيه كما حدثنيه أول مرة‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1187,
			"arabicnumber": 1187,
			"text": "حدثنا عبد الأعلى بن حماد، حدثنا وهيب، عن أيوب، وعبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ اجعلوا فى بيوتكم من صلاتكم ولا تتخذوها قبورا ‏\"‏‏.‏ تابعه عبد الوهاب عن أيوب‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 63
			}
		}
	]
}