{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"20": "Virtues of Prayer at Masjid Makkah and Madinah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1188,
			"arabicnumber": 1188,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني عبد الملك بن عمير، عن قزعة، قال سمعت أبا سعيد ـ رضى الله عنه ـ أربعا قال سمعت من النبي، صلى الله عليه وسلم وكان غزا مع النبي صلى الله عليه وسلم ثنتى عشرة غزوة ح‏.‏",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1189,
			"arabicnumber": 1189,
			"text": "حدثنا علي، حدثنا سفيان، عن الزهري، عن سعيد، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا تشد الرحال إلا إلى ثلاثة مساجد المسجد الحرام، ومسجد الرسول صلى الله عليه وسلم ومسجد الأقصى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1190,
			"arabicnumber": 1190,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن زيد بن رباح، وعبيد الله بن أبي عبد الله الأغر، عن أبي عبد الله الأغر، عن أبي هريرة ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم قال ‏ \"‏ صلاة في مسجدي هذا خير من ألف صلاة فيما سواه إلا المسجد الحرام ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1192,
			"arabicnumber": 1192,
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1193,
			"arabicnumber": 1193,
			"text": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، عن عبد الله بن دينار، عن ابن عمر ـ رضى الله عنهما ـ قال كان النبي صلى الله عليه وسلم يأتي مسجد قباء كل سبت ماشيا وراكبا‏.‏ وكان عبد الله ـ رضى الله عنهما ـ يفعله‏.‏",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1194,
			"arabicnumber": 1194,
			"text": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، قال حدثني نافع، عن ابن عمر ـ رضى الله عنهما ـ قال كان النبي صلى الله عليه وسلم يأتي قباء راكبا وماشيا‏.‏ زاد ابن نمير حدثنا عبيد الله عن نافع فيصلي فيه ركعتين‏.‏",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1195,
			"arabicnumber": 1195,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر، عن عباد بن تميم، عن عبد الله بن زيد المازني ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ما بين بيتي ومنبري روضة من رياض الجنة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1196,
			"arabicnumber": 1196,
			"text": "حدثنا مسدد، عن يحيى، عن عبيد الله، قال حدثني خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما بين بيتي ومنبري روضة من رياض الجنة، ومنبري على حوضي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1197,
			"arabicnumber": 1197,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن عبد الملك، سمعت قزعة، مولى زياد قال سمعت أبا سعيد الخدري ـ رضى الله عنه ـ يحدث بأربع عن النبي صلى الله عليه وسلم فأعجبنني وآنقنني قال ‏ \"‏ لا تسافر المرأة يومين إلا معها زوجها أو ذو محرم‏.‏ ولا صوم في يومين الفطر والأضحى، ولا صلاة بعد صلاتين بعد الصبح حتى تطلع الشمس، وبعد العصر حتى تغرب، ولا تشد الرحال إلا إلى ثلاثة مساجد مسجد الحرام ومسجد الأقصى ومسجدي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		}
	]
}