{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"23": "Funerals (Al-Janaa'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1237,
			"arabicnumber": 1237,
			"text": "حدثنا موسى بن إسماعيل، حدثنا مهدي بن ميمون، حدثنا واصل الأحدب، عن المعرور بن سويد، عن أبي ذر ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاني آت من ربي فأخبرني ـ أو قال بشرني ـ أنه من مات من أمتي لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1238,
			"arabicnumber": 1238,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا شقيق، عن عبد الله ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من مات يشرك بالله شيئا دخل النار ‏\"‏‏.‏ وقلت أنا من مات لا يشرك بالله شيئا دخل الجنة‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1239,
			"arabicnumber": 1239,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن الأشعث، قال سمعت معاوية بن سويد بن مقرن، عن البراء ـ رضى الله عنه ـ قال أمرنا النبي صلى الله عليه وسلم بسبع، ونهانا عن سبع أمرنا باتباع الجنائز، وعيادة المريض، وإجابة الداعي، ونصر المظلوم، وإبرار القسم، ورد السلام، وتشميت العاطس‏.‏ ونهانا عن آنية الفضة، وخاتم الذهب، والحرير، والديباج، والقسي، والإستبرق‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1240,
			"arabicnumber": 1240,
			"text": "حدثنا محمد، حدثنا عمرو بن أبي سلمة، عن الأوزاعي، قال أخبرني ابن شهاب، قال أخبرني سعيد بن المسيب، أن أبا هريرة ـ رضى الله عنه ـ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ حق المسلم على المسلم خمس رد السلام، وعيادة المريض، واتباع الجنائز، وإجابة الدعوة، وتشميت العاطس ‏\"‏‏.‏ تابعه عبد الرزاق قال أخبرنا معمر‏.‏ ورواه سلامة عن عقيل‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1242,
			"arabicnumber": 1242,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1243,
			"arabicnumber": 1243,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني خارجة بن زيد بن ثابت، أن أم العلاء ـ امرأة من الأنصار ـ بايعت النبي صلى الله عليه وسلم أخبرته أنه اقتسم المهاجرون قرعة فطار لنا عثمان بن مظعون، فأنزلناه في أبياتنا، فوجع وجعه الذي توفي فيه، فلما توفي وغسل وكفن في أثوابه، دخل رسول الله صلى الله عليه وسلم فقلت رحمة الله عليك أبا السائب، فشهادتي عليك لقد أكرمك الله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ وما يدريك أن الله قد أكرمه ‏\"‏‏.‏ فقلت بأبي أنت يا رسول الله فمن يكرمه الله فقال ‏\"‏ أما هو فقد جاءه اليقين، والله إني لأرجو له الخير، والله ما أدري ـ وأنا رسول الله ـ ما يفعل بي ‏\"‏‏.‏ قالت فوالله لا أزكي أحدا بعده أبدا‏.‏ حدثنا سعيد بن عفير، حدثنا الليث، مثله‏.‏ وقال نافع بن يزيد عن عقيل، ما يفعل به وتابعه شعيب وعمرو بن دينار ومعمر‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1244,
			"arabicnumber": 1244,
			"text": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، قال سمعت محمد بن المنكدر، قال سمعت جابر بن عبد الله ـ رضى الله عنهما ـ قال لما قتل أبي جعلت أكشف الثوب عن وجهه أبكي، وينهوني عنه والنبي صلى الله عليه وسلم لا ينهاني، فجعلت عمتي فاطمة تبكي، فقال النبي صلى الله عليه وسلم ‏ \"‏ تبكين أو لا تبكين، ما زالت الملائكة تظله بأجنحتها حتى رفعتموه ‏\"‏‏.‏ تابعه ابن جريج أخبرني ابن المنكدر سمع جابرا ـ رضى الله عنه ـ‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1245,
			"arabicnumber": 1245,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم نعى النجاشي في اليوم الذي مات فيه، خرج إلى المصلى، فصف بهم وكبر أربعا‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1246,
			"arabicnumber": 1246,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا أيوب، عن حميد بن هلال، عن أنس بن مالك ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ أخذ الراية زيد فأصيب، ثم أخذها جعفر فأصيب، ثم أخذها عبد الله بن رواحة فأصيب ـ وإن عينى رسول الله صلى الله عليه وسلم لتذرفان ـ ثم أخذها خالد بن الوليد من غير إمرة ففتح له ‏\"‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1247,
			"arabicnumber": 1247,
			"text": "حدثنا محمد، أخبرنا أبو معاوية، عن أبي إسحاق الشيباني، عن الشعبي، عن ابن عباس ـ رضى الله عنهما ـ قال مات إنسان كان رسول الله صلى الله عليه وسلم يعوده فمات بالليل فدفنوه ليلا، فلما أصبح أخبروه فقال ‏ \"‏ ما منعكم أن تعلموني ‏\"‏‏.‏ قالوا كان الليل فكرهنا ـ وكانت ظلمة ـ أن نشق عليك‏.‏ فأتى قبره فصلى عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1248,
			"arabicnumber": 1248,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز، عن أنس ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ ما من الناس من مسلم يتوفى له ثلاث لم يبلغوا الحنث، إلا أدخله الله الجنة بفضل رحمته إياهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1250,
			"arabicnumber": 1250,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1251,
			"arabicnumber": 1251,
			"text": "حدثنا علي، حدثنا سفيان، قال سمعت الزهري، عن سعيد بن المسيب، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يموت لمسلم ثلاثة من الولد، فيلج النار إلا تحلة القسم ‏\"‏‏.‏ قال أبو عبد الله ‏{‏وإن منكم إلا واردها‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1252,
			"arabicnumber": 1252,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا ثابت، عن أنس بن مالك ـ رضى الله عنه ـ قال مر النبي صلى الله عليه وسلم بامرأة عند قبر وهي تبكي فقال ‏ \"‏ اتقي الله واصبري ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1253,
			"arabicnumber": 1253,
			"text": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن أيوب السختياني، عن محمد بن سيرين، عن أم عطية الأنصارية ـ رضى الله عنها ـ قالت دخل علينا رسول الله صلى الله عليه وسلم حين توفيت ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك بماء وسدر، واجعلن في الآخرة كافورا أو شيئا من كافور، فإذا فرغتن فآذنني ‏\"‏‏.‏ فلما فرغنا آذناه فأعطانا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏ تعني إزاره‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1254,
			"arabicnumber": 1254,
			"text": "حدثنا محمد، حدثنا عبد الوهاب الثقفي، عن أيوب، عن محمد، عن أم عطية ـ رضى الله عنها ـ قالت دخل علينا رسول الله صلى الله عليه وسلم ونحن نغسل ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك بماء وسدر، واجعلن في الآخرة كافورا، فإذا فرغتن فآذنني ‏\"‏‏.‏ فلما فرغنا آذناه، فألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏ فقال أيوب وحدثتني حفصة بمثل حديث محمد وكان في حديث حفصة ‏\"‏ اغسلنها وترا ‏\"‏‏.‏ وكان فيه ‏:‏ ‏\"‏ ثلاثا أو خمسا أو سبعا ‏\"‏‏.‏ وكان فيه أنه قال ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏‏.‏ وكان فيه أن أم عطية قالت ومشطناها ثلاثة قرون‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1255,
			"arabicnumber": 1255,
			"text": "حدثنا علي بن عبد الله، حدثنا إسماعيل بن إبراهيم، حدثنا خالد، عن حفصة بنت سيرين، عن أم عطية ـ رضى الله عنها ـ قالت قال رسول الله صلى الله عليه وسلم في غسل ابنته ‏ \"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1256,
			"arabicnumber": 1256,
			"text": "حدثنا يحيى بن موسى، حدثنا وكيع، عن سفيان، عن خالد الحذاء، عن حفصة بنت سيرين، عن أم عطية ـ رضى الله عنها ـ قالت لما غسلنا بنت النبي صلى الله عليه وسلم قال لنا ونحن نغسلها ‏ \"‏ ابدأن بميامنها ومواضع الوضوء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1257,
			"arabicnumber": 1257,
			"text": "حدثنا عبد الرحمن بن حماد، أخبرنا ابن عون، عن محمد، عن أم عطية، قالت توفيت بنت النبي صلى الله عليه وسلم فقال لنا ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن، فإذا فرغتن فآذنني ‏\"‏‏.‏ فلما فرغنا آذناه فنزع من حقوه إزاره وقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1259,
			"arabicnumber": 1259,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1260,
			"arabicnumber": 1260,
			"text": "حدثنا أحمد، حدثنا عبد الله بن وهب، أخبرنا ابن جريج، قال أيوب وسمعت حفصة بنت سيرين، قالت حدثتنا أم عطية ـ رضى الله عنها ـ أنهن جعلن رأس بنت رسول الله صلى الله عليه وسلم ثلاثة قرون نقضنه ثم غسلنه ثم جعلنه ثلاثة قرون‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1261,
			"arabicnumber": 1261,
			"text": "حدثنا أحمد، حدثنا عبد الله بن وهب، أخبرنا ابن جريج، أن أيوب، أخبره قال سمعت ابن سيرين، يقول جاءت أم عطية ـ رضى الله عنها ـ امرأة من الأنصار من اللاتي بايعن، قدمت البصرة، تبادر ابنا لها فلم تدركه ـ فحدثتنا قالت دخل علينا النبي صلى الله عليه وسلم ونحن نغسل ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك بماء وسدر، واجعلن في الآخرة كافورا، فإذا فرغتن فآذنني ‏\"‏‏.‏ قالت فلما فرغنا ألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏ ولم يزد على ذلك، ولا أدري أى بناته‏.‏ وزعم أن الإشعار الففنها فيه، وكذلك كان ابن سيرين يأمر بالمرأة أن تشعر ولا تؤزر‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1262,
			"arabicnumber": 1262,
			"text": "حدثنا قبيصة، حدثنا سفيان، عن هشام، عن أم الهذيل، عن أم عطية ـ رضى الله عنها ـ قالت ضفرنا شعر بنت النبي صلى الله عليه وسلم‏.‏ تعني ثلاثة قرون‏.‏ وقال وكيع قال سفيان ناصيتها وقرنيها‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1263,
			"arabicnumber": 1263,
			"text": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن هشام بن حسان، قال حدثتنا حفصة، عن أم عطية ـ رضى الله عنها ـ قالت توفيت إحدى بنات النبي صلى الله عليه وسلم فأتانا النبي صلى الله عليه وسلم فقال ‏ \"‏ اغسلنها بالسدر وترا ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك، واجعلن في الآخرة كافورا أو شيئا من كافور، فإذا فرغتن فآذنني ‏\"‏‏.‏ فلما فرغنا آذناه، فألقى إلينا حقوه، فضفرنا شعرها ثلاثة قرون وألقيناها خلفها‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1264,
			"arabicnumber": 1264,
			"text": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ أن رسول الله صلى الله عليه وسلم كفن في ثلاثة أثواب يمانية بيض سحولية من كرسف، ليس فيهن قميص ولا عمامة‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1265,
			"arabicnumber": 1265,
			"text": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهم ـ قال بينما رجل واقف بعرفة إذ وقع عن راحلته فوقصته ـ أو قال فأوقصته ـ قال النبي صلى الله عليه وسلم ‏ \"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تحنطوه ولا تخمروا رأسه، فإنه يبعث يوم القيامة ملبيا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1266,
			"arabicnumber": 1266,
			"text": "حدثنا قتيبة، حدثنا حماد، عن أيوب، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهما ـ قال بينما رجل واقف مع رسول الله صلى الله عليه وسلم بعرفة إذ وقع من راحلته فأقصعته ـ أو قال فأقعصته ـ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تحنطوه ولا تخمروا رأسه، فإن الله يبعثه يوم القيامة ملبيا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1267,
			"arabicnumber": 1267,
			"text": "حدثنا أبو النعمان، أخبرنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهم ـ أن رجلا، وقصه بعيره، ونحن مع النبي صلى الله عليه وسلم وهو محرم فقال النبي صلى الله عليه وسلم ‏ \"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تمسوه طيبا، ولا تخمروا رأسه، فإن الله يبعثه يوم القيامة ملبدا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1268,
			"arabicnumber": 1268,
			"text": "حدثنا مسدد، حدثنا حماد بن زيد، عن عمرو، وأيوب، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهم ـ قال كان رجل واقف مع النبي صلى الله عليه وسلم بعرفة فوقع عن راحلته ـ قال أيوب فوقصته، وقال عمرو فأقصعته ـ فمات فقال ‏ \"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تحنطوه ولا تخمروا رأسه، فإنه يبعث يوم القيامة ـ قال أيوب يلبي، وقال عمرو ـ ملبيا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1269,
			"arabicnumber": 1269,
			"text": "حدثنا مسدد، قال حدثنا يحيى بن سعيد، عن عبيد الله، قال حدثني نافع، عن ابن عمر ـ رضى الله عنهما ـ أن عبد، الله بن أبى لما توفي جاء ابنه إلى النبي صلى الله عليه وسلم فقال يا رسول الله أعطني قميصك أكفنه فيه، وصل عليه واستغفر له، فأعطاه النبي صلى الله عليه وسلم قميصه فقال ‏\"‏ آذني أصلي عليه ‏\"‏‏.‏ فآذنه، فلما أراد أن يصلي عليه جذبه عمر ـ رضى الله عنه ـ فقال أليس الله نهاك أن تصلي على المنافقين فقال ‏\"‏ أنا بين خيرتين قال ‏{‏استغفر لهم أو لا تستغفر لهم إن تستغفر لهم سبعين مرة فلن يغفر الله لهم‏}‏ ‏\"‏‏.‏ فصلى عليه فنزلت ‏{‏ولا تصل على أحد منهم مات أبدا‏}‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1270,
			"arabicnumber": 1270,
			"text": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، عن عمرو، سمع جابرا ـ رضى الله عنه ـ قال أتى النبي صلى الله عليه وسلم عبد الله بن أبى بعد ما دفن فأخرجه، فنفث فيه من ريقه وألبسه قميصه‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1271,
			"arabicnumber": 1271,
			"text": "حدثنا أبو نعيم، حدثنا سفيان، عن هشام، عن عروة، عن عائشة ـ رضى الله عنها ـ قالت كفن النبي صلى الله عليه وسلم في ثلاثة أثواب سحول كرسف، ليس فيها قميص ولا عمامة‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1272,
			"arabicnumber": 1272,
			"text": "حدثنا مسدد، حدثنا يحيى، عن هشام، حدثني أبي، عن عائشة ـ رضى الله عنها ـ أن رسول الله صلى الله عليه وسلم كفن في ثلاثة أثواب، ليس فيها قميص ولا عمامة‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1273,
			"arabicnumber": 1273,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ أن رسول الله صلى الله عليه وسلم كفن في ثلاثة أثواب بيض سحولية، ليس فيها قميص ولا عمامة‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1274,
			"arabicnumber": 1274,
			"text": "حدثنا أحمد بن محمد المكي، حدثنا إبراهيم بن سعد، عن سعد، عن أبيه، قال أتي عبد الرحمن بن عوف ـ رضى الله عنه ـ يوما بطعامه فقال قتل مصعب بن عمير ـ وكان خيرا مني ـ فلم يوجد له ما يكفن فيه إلا بردة، وقتل حمزة أو رجل آخر خير مني فلم يوجد له ما يكفن فيه إلا بردة، لقد خشيت أن يكون قد عجلت لنا طيباتنا في حياتنا الدنيا، ثم جعل يبكي‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1275,
			"arabicnumber": 1275,
			"text": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا شعبة، عن سعد بن إبراهيم، عن أبيه، إبراهيم أن عبد الرحمن بن عوف ـ رضى الله عنه ـ أتي بطعام وكان صائما فقال قتل مصعب بن عمير وهو خير مني، كفن في بردة، إن غطي رأسه بدت رجلاه، وإن غطي رجلاه بدا رأسه ـ وأراه قال ـ وقتل حمزة وهو خير مني، ثم بسط لنا من الدنيا ما بسط ـ أو قال أعطينا من الدنيا ما أعطينا ـ وقد خشينا أن تكون حسناتنا عجلت لنا، ثم جعل يبكي حتى ترك الطعام‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1276,
			"arabicnumber": 1276,
			"text": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا شقيق، حدثنا خباب ـ رضى الله عنه ـ قال هاجرنا مع النبي صلى الله عليه وسلم نلتمس وجه الله، فوقع أجرنا على الله، فمنا من مات لم يأكل من أجره شيئا منهم مصعب بن عمير، ومنا من أينعت له ثمرته فهو يهدبها‏.‏ قتل يوم أحد، فلم نجد ما نكفنه إلا بردة إذا غطينا بها رأسه خرجت رجلاه، وإذا غطينا رجليه خرج رأسه، فأمرنا النبي صلى الله عليه وسلم أن نغطي رأسه، وأن نجعل على رجليه من الإذخر‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1277,
			"arabicnumber": 1277,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا ابن أبي حازم، عن أبيه، عن سهل ـ رضى الله عنه ـ أن امرأة، جاءت النبي صلى الله عليه وسلم ببردة منسوجة فيها حاشيتها ـ أتدرون ما البردة قالوا الشملة‏.‏ قال نعم‏.‏ قالت نسجتها بيدي، فجئت لأكسوكها‏.‏ فأخذها النبي صلى الله عليه وسلم محتاجا إليها، فخرج إلينا وإنها إزاره، فحسنها فلان فقال اكسنيها، ما أحسنها‏.‏ قال القوم ما أحسنت، لبسها النبي صلى الله عليه وسلم محتاجا إليها، ثم سألته وعلمت أنه لا يرد‏.‏ قال إني والله ما سألته لألبسها إنما سألته لتكون كفني‏.‏ قال سهل فكانت كفنه‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1278,
			"arabicnumber": 1278,
			"text": "حدثنا قبيصة بن عقبة، حدثنا سفيان، عن خالد الحذاء، عن أم الهذيل، عن أم عطية ـ رضى الله عنها ـ قالت نهينا عن اتباع الجنائز، ولم يعزم علينا‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1279,
			"arabicnumber": 1279,
			"text": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا سلمة بن علقمة، عن محمد بن سيرين، قال توفي ابن لأم عطية ـ رضى الله عنها ـ فلما كان اليوم الثالث دعت بصفرة، فتمسحت به وقالت نهينا أن نحد أكثر من ثلاث إلا بزوج‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1280,
			"arabicnumber": 1280,
			"text": "حدثنا الحميدي، حدثنا سفيان، حدثنا أيوب بن موسى، قال أخبرني حميد بن نافع، عن زينب ابنة أبي سلمة، قالت لما جاء نعى أبي سفيان من الشأم دعت أم حبيبة ـ رضى الله عنها ـ بصفرة في اليوم الثالث، فمسحت عارضيها وذراعيها وقالت إني كنت عن هذا لغنية، لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث، إلا على زوج، فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1282,
			"arabicnumber": 1282,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1283,
			"arabicnumber": 1283,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا ثابت، عن أنس بن مالك ـ رضى الله عنه ـ قال مر النبي صلى الله عليه وسلم بامرأة تبكي عند قبر فقال ‏\"‏ اتقي الله واصبري ‏\"‏‏.‏ قالت إليك عني، فإنك لم تصب بمصيبتي، ولم تعرفه‏.‏ فقيل لها إنه النبي صلى الله عليه وسلم‏.‏ فأتت باب النبي صلى الله عليه وسلم فلم تجد عنده بوابين فقالت لم أعرفك‏.‏ فقال ‏\"‏ إنما الصبر عند الصدمة الأولى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1284,
			"arabicnumber": 1284,
			"text": "حدثنا عبدان، ومحمد، قالا أخبرنا عبد الله، أخبرنا عاصم بن سليمان، عن أبي عثمان، قال حدثني أسامة بن زيد ـ رضى الله عنهما ـ قال أرسلت ابنة النبي صلى الله عليه وسلم إليه إن ابنا لي قبض فائتنا‏.‏ فأرسل يقرئ السلام ويقول ‏\"‏ إن لله ما أخذ وله ما أعطى وكل عنده بأجل مسمى، فلتصبر ولتحتسب ‏\"‏‏.‏ فأرسلت إليه تقسم عليه ليأتينها، فقام ومعه سعد بن عبادة ومعاذ بن جبل وأبى بن كعب وزيد بن ثابت ورجال، فرفع إلى رسول الله صلى الله عليه وسلم الصبي ونفسه تتقعقع ـ قال حسبته أنه قال ـ كأنها شن‏.‏ ففاضت عيناه‏.‏ فقال سعد يا رسول الله ما هذا فقال ‏\"‏ هذه رحمة جعلها الله في قلوب عباده، وإنما يرحم الله من عباده الرحماء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1285,
			"arabicnumber": 1285,
			"text": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح بن سليمان، عن هلال بن علي، عن أنس بن مالك ـ رضى الله عنه ـ قال شهدنا بنتا لرسول الله صلى الله عليه وسلم قال ورسول الله صلى الله عليه وسلم جالس على القبر ـ قال فرأيت عينيه تدمعان قال ـ فقال ‏\"‏ هل منكم رجل لم يقارف الليلة ‏\"‏‏.‏ فقال أبو طلحة أنا‏.‏ قال ‏\"‏ فانزل ‏\"‏‏.‏ قال فنزل في قبرها‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1288,
			"arabicnumber": 1288,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1289,
			"arabicnumber": 1289,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر، عن أبيه، عن عمرة بنت عبد الرحمن، أنها أخبرته أنها، سمعت عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم قالت إنما مر رسول الله صلى الله عليه وسلم على يهودية يبكي عليها أهلها فقال ‏ \"‏ إنهم ليبكون عليها، وإنها لتعذب في قبرها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "حدثنا إسماعيل بن خليل، حدثنا علي بن مسهر، حدثنا أبو إسحاق ـ وهو الشيباني ـ عن أبي بردة، عن أبيه، قال لما أصيب عمر ـ رضى الله عنه ـ جعل صهيب يقول واأخاه‏.‏ فقال عمر أما علمت أن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الميت ليعذب ببكاء الحى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": 1291,
			"text": "حدثنا أبو نعيم، حدثنا سعيد بن عبيد، عن علي بن ربيعة، عن المغيرة ـ رضى الله عنه ـ قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن كذبا على ليس ككذب على أحد، من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏‏.‏ سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من نيح عليه يعذب بما نيح عليه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": 1292,
			"text": "حدثنا عبدان، قال أخبرني أبي، عن شعبة، عن قتادة، عن سعيد بن المسيب، عن ابن عمر، عن أبيه ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ الميت يعذب في قبره بما نيح عليه ‏\"‏‏.‏ تابعه عبد الأعلى حدثنا يزيد بن زريع حدثنا سعيد حدثنا قتادة‏.‏ وقال آدم عن شعبة ‏\"‏ الميت يعذب ببكاء الحى عليه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا ابن المنكدر، قال سمعت جابر بن عبد الله ـ رضى الله عنهما ـ قال جيء بأبي يوم أحد، قد مثل به حتى وضع بين يدى رسول الله صلى الله عليه وسلم وقد سجي ثوبا فذهبت أريد أن أكشف عنه فنهاني قومي، ثم ذهبت أكشف عنه فنهاني قومي، فأمر رسول الله صلى الله عليه وسلم فرفع فسمع صوت صائحة فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقالوا ابنة عمرو أو أخت عمرو‏.‏ قال ‏\"‏ فلم تبكي أو لا تبكي فما زالت الملائكة تظله بأجنحتها حتى رفع ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": 1294,
			"text": "حدثنا أبو نعيم، حدثنا سفيان، حدثنا زبيد اليامي، عن إبراهيم، عن مسروق، عن عبد الله ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ ليس منا من لطم الخدود، وشق الجيوب، ودعا بدعوى الجاهلية ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عامر بن سعد بن أبي وقاص، عن أبيه ـ رضى الله عنه ـ قال كان رسول الله صلى الله عليه وسلم يعودني عام حجة الوداع من وجع اشتد بي فقلت إني قد بلغ بي من الوجع وأنا ذو مال، ولا يرثني إلا ابنة، أفأتصدق بثلثى مالي قال ‏\"‏ لا ‏\"‏‏.‏ فقلت بالشطر فقال ‏\"‏ لا ‏\"‏ ثم قال ‏\"‏ الثلث والثلث كبير ـ أو كثير ـ إنك أن تذر ورثتك أغنياء خير من أن تذرهم عالة يتكففون الناس، وإنك لن تنفق نفقة تبتغي بها وجه الله إلا أجرت بها، حتى ما تجعل في في امرأتك ‏\"‏‏.‏ فقلت يا رسول الله، أخلف بعد أصحابي قال ‏\"‏ إنك لن تخلف فتعمل عملا صالحا إلا ازددت به درجة ورفعة، ثم لعلك أن تخلف حتى ينتفع بك أقوام ويضر بك آخرون، اللهم أمض لأصحابي هجرتهم، ولا تردهم على أعقابهم، لكن البائس سعد ابن خولة، يرثي له رسول الله صلى الله عليه وسلم أن مات بمكة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": 1296,
			"text": "وقال الحكم بن موسى حدثنا يحيى بن حمزة، عن عبد الرحمن بن جابر، أن القاسم بن مخيمرة، حدثه قال حدثني أبو بردة بن أبي موسى ـ رضى الله عنه ـ قال وجع أبو موسى وجعا فغشي عليه، ورأسه في حجر امرأة من أهله، فلم يستطع أن يرد عليها شيئا، فلما أفاق قال أنا بريء ممن برئ منه رسول الله صلى الله عليه وسلم، إن رسول الله صلى الله عليه وسلم برئ من الصالقة والحالقة والشاقة‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": 1297,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس منا من ضرب الخدود، وشق الجيوب، ودعا بدعوى الجاهلية ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ ليس منا من ضرب الخدود، وشق الجيوب، ودعا بدعوى الجاهلية ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": 1299,
			"text": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى، قال أخبرتني عمرة، قالت سمعت عائشة ـ رضى الله عنها ـ قالت لما جاء النبي صلى الله عليه وسلم قتل ابن حارثة وجعفر وابن رواحة جلس يعرف فيه الحزن، وأنا أنظر من صائر الباب ـ شق الباب ـ فأتاه رجل، فقال إن نساء جعفر، وذكر بكاءهن، فأمره أن ينهاهن، فذهب ثم أتاه الثانية، لم يطعنه فقال انههن‏.‏ فأتاه الثالثة قال والله غلبننا يا رسول الله فزعمت أنه قال ‏ \"‏ فاحث في أفواههن التراب ‏\"‏‏.‏ فقلت أرغم الله أنفك، لم تفعل ما أمرك رسول الله صلى الله عليه وسلم ولم تترك رسول الله صلى الله عليه وسلم من العناء‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": 1300,
			"text": "حدثنا عمرو بن علي، حدثنا محمد بن فضيل، حدثنا عاصم الأحول، عن أنس ـ رضى الله عنه ـ قال قنت رسول الله صلى الله عليه وسلم شهرا حين قتل القراء، فما رأيت رسول الله صلى الله عليه وسلم حزن حزنا قط أشد منه‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": 1301,
			"text": "حدثنا بشر بن الحكم، حدثنا سفيان بن عيينة، أخبرنا إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك ـ رضى الله عنه ـ يقول اشتكى ابن لأبي طلحة ـ قال ـ فمات وأبو طلحة خارج، فلما رأت امرأته أنه قد مات هيأت شيئا ونحته في جانب البيت، فلما جاء أبو طلحة قال كيف الغلام قالت قد هدأت نفسه، وأرجو أن يكون قد استراح‏.‏ وظن أبو طلحة أنها صادقة، قال فبات، فلما أصبح اغتسل، فلما أراد أن يخرج، أعلمته أنه قد مات، فصلى مع النبي صلى الله عليه وسلم ثم أخبر النبي صلى الله عليه وسلم بما كان منهما، فقال رسول الله صلى الله عليه وسلم ‏ \"‏ لعل الله أن يبارك لكما في ليلتكما ‏\"‏‏.‏ قال سفيان فقال رجل من الأنصار فرأيت لهما تسعة أولاد كلهم قد قرأ القرآن‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": 1302,
			"text": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن ثابت، قال سمعت أنسا ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ الصبر عند الصدمة الأولى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "حدثنا الحسن بن عبد العزيز، حدثنا يحيى بن حسان، حدثنا قريش ـ هو ابن حيان ـ عن ثابت، عن أنس بن مالك ـ رضى الله عنه ـ قال دخلنا مع رسول الله صلى الله عليه وسلم على أبي سيف القين ـ وكان ظئرا لإبراهيم ـ عليه السلام ـ فأخذ رسول الله صلى الله عليه وسلم إبراهيم فقبله وشمه، ثم دخلنا عليه بعد ذلك، وإبراهيم يجود بنفسه، فجعلت عينا رسول الله صلى الله عليه وسلم تذرفان‏.‏ فقال له عبد الرحمن بن عوف ـ رضى الله عنه ـ وأنت يا رسول الله فقال ‏\"‏ يا ابن عوف إنها رحمة ‏\"‏‏.‏ ثم أتبعها بأخرى فقال صلى الله عليه وسلم ‏\"‏ إن العين تدمع، والقلب يحزن، ولا نقول إلا ما يرضى ربنا، وإنا بفراقك يا إبراهيم لمحزونون ‏\"‏‏.‏ رواه موسى عن سليمان بن المغيرة عن ثابت عن أنس ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": 1304,
			"text": "حدثنا أصبغ، عن ابن وهب، قال أخبرني عمرو، عن سعيد بن الحارث الأنصاري، عن عبد الله بن عمر ـ رضى الله عنهما ـ قال اشتكى سعد بن عبادة شكوى له فأتاه النبي صلى الله عليه وسلم يعوده مع عبد الرحمن بن عوف وسعد بن أبي وقاص وعبد الله بن مسعود ـ رضى الله عنهم ـ فلما دخل عليه فوجده في غاشية أهله فقال ‏\"‏ قد قضى ‏\"‏‏.‏ قالوا لا يا رسول الله‏.‏ فبكى النبي صلى الله عليه وسلم فلما رأى القوم بكاء النبي صلى الله عليه وسلم بكوا فقال ‏\"‏ ألا تسمعون إن الله لا يعذب بدمع العين، ولا بحزن القلب، ولكن يعذب بهذا ـ وأشار إلى لسانه ـ أو يرحم وإن الميت يعذب ببكاء أهله عليه ‏\"‏‏.‏ وكان عمر ـ رضى الله عنه ـ يضرب فيه بالعصا، ويرمي بالحجارة ويحثي بالتراب‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "حدثنا محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا يحيى بن سعيد، قال أخبرتني عمرة، قالت سمعت عائشة ـ رضى الله عنها ـ تقول لما جاء قتل زيد بن حارثة وجعفر وعبد الله بن رواحة، جلس النبي صلى الله عليه وسلم يعرف فيه الحزن، وأنا أطلع من شق الباب، فأتاه رجل فقال يا رسول الله إن نساء جعفر وذكر بكاءهن فأمره بأن ينهاهن، فذهب الرجل ثم أتى فقال قد نهيتهن، وذكر أنهن لم يطعنه، فأمره الثانية أن ينهاهن، فذهب، ثم أتى، فقال والله لقد غلبنني أو غلبننا الشك من محمد بن حوشب ـ فزعمت أن النبي صلى الله عليه وسلم قال ‏ \"‏ فاحث في أفواههن التراب ‏\"‏‏.‏ فقلت أرغم الله أنفك، فوالله ما أنت بفاعل وما تركت رسول الله صلى الله عليه وسلم من العناء‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد بن زيد، حدثنا أيوب، عن محمد، عن أم عطية ـ رضى الله عنها ـ قالت أخذ علينا النبي صلى الله عليه وسلم عند البيعة أن لا ننوح، فما وفت منا امرأة غير خمس نسوة أم سليم وأم العلاء وابنة أبي سبرة امرأة معاذ وامرأتين أو ابنة أبي سبرة وامرأة معاذ وامرأة أخرى‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": 1307,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا الزهري، عن سالم، عن أبيه، عن عامر بن ربيعة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا رأيتم الجنازة فقوموا حتى تخلفكم ‏\"‏‏.‏ قال سفيان قال الزهري أخبرني سالم عن أبيه قال أخبرنا عامر بن ربيعة عن النبي صلى الله عليه وسلم‏.‏ زاد الحميدي ‏\"‏ حتى تخلفكم أو توضع ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": 1308,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ عن عامر بن ربيعة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا رأى أحدكم جنازة فإن لم يكن ماشيا معها فليقم حتى يخلفها، أو تخلفه أو توضع من قبل أن تخلفه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": 1309,
			"text": "حدثنا أحمد بن يونس، حدثنا ابن أبي ذئب، عن سعيد المقبري، عن أبيه، قال كنا في جنازة فأخذ أبو هريرة ـ رضى الله عنه ـ بيد مروان فجلسا قبل أن توضع، فجاء أبو سعيد ـ رضى الله عنه ـ فأخذ بيد مروان فقال قم فوالله لقد علم هذا أن النبي صلى الله عليه وسلم نهانا عن ذلك‏.‏ فقال أبو هريرة صدق‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": 1310,
			"text": "حدثنا مسلم ـ يعني ابن إبراهيم ـ حدثنا هشام، حدثنا يحيى، عن أبي سلمة، عن أبي سعيد الخدري ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا رأيتم الجنازة فقوموا، فمن تبعها فلا يقعد حتى توضع ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": 1311,
			"text": "حدثنا معاذ بن فضالة، حدثنا هشام، عن يحيى، عن عبيد الله بن مقسم، عن جابر بن عبد الله ـ رضى الله عنهما ـ قال مر بنا جنازة فقام لها النبي صلى الله عليه وسلم وقمنا به‏.‏ فقلنا يا رسول الله، إنها جنازة يهودي‏.‏ قال ‏ \"‏ إذا رأيتم الجنازة فقوموا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": 1313,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": 1314,
			"text": "حدثنا عبد العزيز بن عبد الله، حدثنا الليث، عن سعيد المقبري، عن أبيه، أنه سمع أبا سعيد الخدري ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا وضعت الجنازة واحتملها الرجال على أعناقهم، فإن كانت صالحة قالت قدموني‏.‏ وإن كانت غير صالحة قالت يا ويلها أين يذهبون بها يسمع صوتها كل شىء إلا الإنسان، ولو سمعه صعق ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال حفظناه من الزهري عن سعيد بن المسيب، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ أسرعوا بالجنازة، فإن تك صالحة فخير تقدمونها ‏{‏إليه‏}‏، وإن يك سوى ذلك فشر تضعونه عن رقابكم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": 1316,
			"text": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثنا سعيد، عن أبيه، أنه سمع أبا سعيد الخدري ـ رضى الله عنه ـ قال كان النبي صلى الله عليه وسلم يقول ‏ \"‏ إذا وضعت الجنازة فاحتملها الرجال على أعناقهم، فإن كانت صالحة قالت قدموني‏.‏ وإن كانت غير صالحة قالت لأهلها يا ويلها أين يذهبون بها يسمع صوتها كل شىء إلا الإنسان، ولو سمع الإنسان لصعق ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": 1317,
			"text": "حدثنا مسدد، عن أبي عوانة، عن قتادة، عن عطاء، عن جابر بن عبد الله ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم صلى على النجاشي، فكنت في الصف الثاني أو الثالث‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": 1318,
			"text": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا معمر، عن الزهري، عن سعيد، عن أبي هريرة ـ رضى الله عنه ـ قال نعى النبي صلى الله عليه وسلم إلى أصحابه النجاشي، ثم تقدم فصفوا خلفه فكبر أربعا‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": 1319,
			"text": "حدثنا مسلم، حدثنا شعبة، حدثنا الشيباني، عن الشعبي، قال أخبرني من، شهد النبي صلى الله عليه وسلم أنه أتى على قبر منبوذ فصفهم وكبر أربعا‏.‏ قلت من حدثك قال ابن عباس رضى الله عنهما‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": 1320,
			"text": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني عطاء، أنه سمع جابر بن عبد الله ـ رضى الله عنهما ـ يقول قال النبي صلى الله عليه وسلم ‏ \"‏ قد توفي اليوم رجل صالح من الحبش فهلم فصلوا عليه ‏\"‏‏.‏ قال فصففنا فصلى النبي صلى الله عليه وسلم عليه ونحن صفوف‏.‏ قال أبو الزبير عن جابر كنت في الصف الثاني‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": 1321,
			"text": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الشيباني، عن عامر، عن ابن عباس ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم مر بقبر قد دفن ليلا فقال ‏\"‏ متى دفن هذا ‏\"‏‏.‏ قالوا البارحة‏.‏ قال ‏\"‏ أفلا آذنتموني ‏\"‏‏.‏ قالوا دفناه في ظلمة الليل فكرهنا أن نوقظك‏.‏ فقام فصففنا خلفه‏.‏ قال ابن عباس وأنا فيهم فصلى عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1322,
			"arabicnumber": 1322,
			"text": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الشيباني، عن الشعبي، قال أخبرني من، مر مع نبيكم صلى الله عليه وسلم على قبر منبوذ فأمنا فصففنا خلفه‏.‏ فقلنا يا أبا عمرو من حدثك قال ابن عباس رضى الله عنهما‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1324,
			"arabicnumber": 1324,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1325,
			"arabicnumber": 1325,
			"text": "حدثنا عبد الله بن مسلمة، قال قرأت على ابن أبي ذئب عن سعيد بن أبي سعيد المقبري، عن أبيه، أنه سأل أبا هريرة ـ رضى الله عنه ـ فقال سمعت النبي صلى الله عليه وسلم‏.‏ حدثنا أحمد بن شبيب بن سعيد، قال حدثني أبي، حدثنا يونس، قال ابن شهاب وحدثني عبد الرحمن الأعرج، أن أبا هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من شهد الجنازة حتى يصلي عليها فله قيراط، ومن شهد حتى تدفن كان له قيراطان ‏\"‏‏.‏ قيل وما القيراطان قال ‏\"‏ مثل الجبلين العظيمين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1326,
			"arabicnumber": 1326,
			"text": "حدثنا يعقوب بن إبراهيم، حدثنا يحيى بن أبي بكير، حدثنا زائدة، حدثنا أبو إسحاق الشيباني، عن عامر، عن ابن عباس ـ رضى الله عنهما ـ قال أتى رسول الله صلى الله عليه وسلم قبرا، فقالوا هذا دفن، أو دفنت البارحة‏.‏ قال ابن عباس ـ رضى الله عنهما ـ فصفنا خلفه ثم صلى عليها‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1328,
			"arabicnumber": 1328,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1329,
			"arabicnumber": 1329,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن اليهود، جاءوا إلى النبي صلى الله عليه وسلم برجل منهم وامرأة زنيا، فأمر بهما فرجما قريبا من موضع الجنائز عند المسجد‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1330,
			"arabicnumber": 1330,
			"text": "حدثنا عبيد الله بن موسى، عن شيبان، عن هلال ـ هو الوزان ـ عن عروة، عن عائشة ـ رضى الله عنها ـ عن النبي صلى الله عليه وسلم قال في مرضه الذي مات فيه ‏ \"‏ لعن الله اليهود والنصارى، اتخذوا قبور أنبيائهم مسجدا ‏\"‏‏.‏ قالت ولولا ذلك لأبرزوا قبره غير أني أخشى أن يتخذ مسجدا‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1331,
			"arabicnumber": 1331,
			"text": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا حسين، حدثنا عبد الله بن بريدة، عن سمرة ـ رضى الله عنه ـ قال صليت وراء النبي صلى الله عليه وسلم على امرأة ماتت في نفاسها، فقام عليها وسطها‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1332,
			"arabicnumber": 1332,
			"text": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا حسين، عن ابن بريدة، حدثنا سمرة بن جندب ـ رضى الله عنه ـ قال صليت وراء النبي صلى الله عليه وسلم على امرأة ماتت في نفاسها فقام عليها وسطها‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1333,
			"arabicnumber": 1333,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم نعى النجاشي في اليوم الذي مات فيه، وخرج بهم إلى المصلى فصف بهم، وكبر عليه أربع تكبيرات‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1334,
			"arabicnumber": 1334,
			"text": "حدثنا محمد بن سنان، حدثنا سليم بن حيان، حدثنا سعيد بن ميناء، عن جابر ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم صلى على أصحمة النجاشي فكبر أربعا‏.‏ وقال يزيد بن هارون وعبد الصمد عن سليم أصحمة‏.‏ وتابعه عبد الصمد‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1335,
			"arabicnumber": 1335,
			"text": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، عن طلحة، قال صليت خلف ابن عباس ـ رضى الله عنهما ـ‏.‏ حدثنا محمد بن كثير، أخبرنا سفيان، عن سعد بن إبراهيم، عن طلحة بن عبد الله بن عوف، قال صليت خلف ابن عباس ـ رضى الله عنهما ـ على جنازة فقرأ بفاتحة الكتاب قال ليعلموا أنها سنة‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1336,
			"arabicnumber": 1336,
			"text": "حدثنا حجاج بن منهال، حدثنا شعبة، قال حدثني سليمان الشيباني، قال سمعت الشعبي، قال أخبرني من، مر مع النبي صلى الله عليه وسلم على قبر منبوذ فأمهم وصلوا خلفه‏.‏ قلت من حدثك هذا يا أبا عمرو قال ابن عباس ـ رضى الله عنهما ـ‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1337,
			"arabicnumber": 1337,
			"text": "حدثنا محمد بن الفضل، حدثنا حماد بن زيد، عن ثابت، عن أبي رافع، عن أبي هريرة ـ رضى الله عنه ـ أن أسود ـ رجلا أو امرأة ـ كان يقم المسجد فمات، ولم يعلم النبي صلى الله عليه وسلم بموته فذكره ذات يوم فقال ‏\"‏ ما فعل ذلك الإنسان ‏\"‏‏.‏ قالوا مات يا رسول الله‏.‏ قال ‏\"‏ أفلا آذنتموني ‏\"‏‏.‏ فقالوا إنه كان كذا وكذا قصته‏.‏ قال فحقروا شأنه‏.‏ قال ‏\"‏ فدلوني على قبره ‏\"‏‏.‏ فأتى قبره فصلى عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1338,
			"arabicnumber": 1338,
			"text": "حدثنا عياش، حدثنا عبد الأعلى، حدثنا سعيد، قال وقال لي خليفة حدثنا ابن زريع، حدثنا سعيد، عن قتادة، عن أنس ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ العبد إذا وضع في قبره، وتولي وذهب أصحابه حتى إنه ليسمع قرع نعالهم، أتاه ملكان فأقعداه فيقولان له ما كنت تقول في هذا الرجل محمد صلى الله عليه وسلم فيقول أشهد أنه عبد الله ورسوله‏.‏ فيقال انظر إلى مقعدك من النار، أبدلك الله به مقعدا من الجنة ـ قال النبي صلى الله عليه وسلم فيراهما جميعا ـ وأما الكافر ـ أو المنافق ـ فيقول لا أدري، كنت أقول ما يقول الناس‏.‏ فيقال لا دريت ولا تليت‏.‏ ثم يضرب بمطرقة من حديد ضربة بين أذنيه، فيصيح صيحة يسمعها من يليه إلا الثقلين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1339,
			"arabicnumber": 1339,
			"text": "حدثنا محمود، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة ـ رضى الله عنه ـ قال ‏\"‏ أرسل ملك الموت إلى موسى ـ عليهما السلام ـ فلما جاءه صكه فرجع إلى ربه فقال أرسلتني إلى عبد لا يريد الموت‏.‏ فرد الله عليه عينه وقال ارجع فقل له يضع يده على متن ثور، فله بكل ما غطت به يده بكل شعرة سنة‏.‏ قال أى رب، ثم ماذا قال ثم الموت‏.‏ قال فالآن‏.‏ فسأل الله أن يدنيه من الأرض المقدسة رمية بحجر ‏\"‏‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فلو كنت ثم لأريتكم قبره إلى جانب الطريق عند الكثيب الأحمر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1340,
			"arabicnumber": 1340,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الشيباني، عن الشعبي، عن ابن عباس ـ رضى الله عنهما ـ قال صلى النبي صلى الله عليه وسلم على رجل بعد ما دفن بليلة قام هو وأصحابه، وكان سأل عنه فقال ‏ \"‏ من هذا ‏\"‏‏.‏ فقالوا فلان، دفن البارحة‏.‏ فصلوا عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1341,
			"arabicnumber": 1341,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت لما اشتكى النبي صلى الله عليه وسلم ذكرت بعض نسائه كنيسة رأينها بأرض الحبشة، يقال لها مارية، وكانت أم سلمة وأم حبيبة ـ رضى الله عنهما ـ أتتا أرض الحبشة، فذكرتا من حسنها وتصاوير فيها، فرفع رأسه فقال ‏ \"‏ أولئك إذا مات منهم الرجل الصالح بنوا على قبره مسجدا، ثم صوروا فيه تلك الصورة، أولئك شرار الخلق عند الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن أنس ـ رضى الله عنه ـ قال شهدنا بنت رسول الله صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم جالس على القبر، فرأيت عينيه تدمعان فقال ‏\"‏ هل فيكم من أحد لم يقارف الليلة ‏\"‏‏.‏ فقال أبو طلحة أنا‏.‏ قال ‏\"‏ فانزل في قبرها ‏\"‏‏.‏ فنزل في قبرها فقبرها‏.‏ قال ابن المبارك قال فليح أراه يعني الذنب‏.‏ قال أبو عبد الله ‏{‏ليقترفوا‏}‏ أى ليكتسبوا‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1343,
			"arabicnumber": 1343,
			"text": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني ابن شهاب، عن عبد الرحمن بن كعب بن مالك، عن جابر بن عبد الله ـ رضى الله عنهما ـ قال كان النبي صلى الله عليه وسلم يجمع بين الرجلين من قتلى أحد في ثوب واحد ثم يقول ‏\"‏ أيهم أكثر أخذا للقرآن ‏\"‏‏.‏ فإذا أشير له إلى أحدهما قدمه في اللحد وقال ‏\"‏ أنا شهيد على هؤلاء يوم القيامة ‏\"‏‏.‏ وأمر بدفنهم في دمائهم، ولم يغسلوا ولم يصل عليهم‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر فقال ‏ \"‏ إني فرط لكم، وأنا شهيد عليكم، وإني والله لأنظر إلى حوضي الآن، وإني أعطيت مفاتيح خزائن الأرض ـ أو مفاتيح الأرض ـ وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكن أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1345,
			"arabicnumber": 1345,
			"text": "حدثنا سعيد بن سليمان، حدثنا الليث، حدثنا ابن شهاب، عن عبد الرحمن بن كعب، أن جابر بن عبد الله ـ رضى الله عنهما ـ أخبره أن النبي صلى الله عليه وسلم كان يجمع بين الرجلين من قتلى أحد‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1346,
			"arabicnumber": 1346,
			"text": "حدثنا أبو الوليد، حدثنا ليث، عن ابن شهاب، عن عبد الرحمن بن كعب، عن جابر، قال قال النبي صلى الله عليه وسلم ‏ \"‏ ادفنوهم في دمائهم ‏\"‏‏.‏ ـ يعني يوم أحد ـ ولم يغسلهم‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1348,
			"arabicnumber": 1348,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1349,
			"arabicnumber": 1349,
			"text": "حدثنا محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ حرم الله مكة، فلم تحل لأحد قبلي ولا لأحد بعدي، أحلت لي ساعة من نهار، لا يختلى خلاها، ولا يعضد شجرها، ولا ينفر صيدها، ولا تلتقط لقطتها إلا لمعرف ‏\"‏‏.‏ فقال العباس ـ رضى الله عنه ـ إلا الإذخر لصاغتنا وقبورنا‏.‏ فقال ‏\"‏ إلا الإذخر ‏\"‏‏.‏ وقال أبو هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم ‏\"‏ لقبورنا وبيوتنا ‏\"‏‏.‏ وقال أبان بن صالح عن الحسن بن مسلم، عن صفية بنت شيبة، سمعت النبي صلى الله عليه وسلم مثله‏.‏ وقال مجاهد عن طاوس عن ابن عباس ـ رضى الله عنهما ـ لقينهم وبيوتهم‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1350,
			"arabicnumber": 1350,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال عمرو سمعت جابر بن عبد الله ـ رضى الله عنهما ـ قال أتى رسول الله صلى الله عليه وسلم عبد الله بن أبى بعد ما أدخل حفرته فأمر به فأخرج، فوضعه على ركبتيه، ونفث عليه من ريقه، وألبسه قميصه، فالله أعلم، وكان كسا عباسا قميصا‏.‏ قال سفيان وقال أبو هارون وكان على رسول الله صلى الله عليه وسلم قميصان، فقال له ابن عبد الله يا رسول الله، ألبس أبي قميصك الذي يلي جلدك‏.‏ قال سفيان فيرون أن النبي صلى الله عليه وسلم ألبس عبد الله قميصه مكافأة لما صنع‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1351,
			"arabicnumber": 1351,
			"text": "حدثنا مسدد، أخبرنا بشر بن المفضل، حدثنا حسين المعلم، عن عطاء، عن جابر ـ رضى الله عنه ـ قال لما حضر أحد دعاني أبي من الليل فقال ما أراني إلا مقتولا في أول من يقتل من أصحاب النبي صلى الله عليه وسلم، وإني لا أترك بعدي أعز على منك، غير نفس رسول الله صلى الله عليه وسلم، فإن على دينا فاقض، واستوص بأخواتك خيرا‏.‏ فأصبحنا فكان أول قتيل، ودفن معه آخر في قبر، ثم لم تطب نفسي أن أتركه مع الآخر فاستخرجته بعد ستة أشهر، فإذا هو كيوم وضعته هنية غير أذنه‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1352,
			"arabicnumber": 1352,
			"text": "حدثنا علي بن عبد الله، حدثنا سعيد بن عامر، عن شعبة، عن ابن أبي نجيح، عن عطاء، عن جابر ـ رضى الله عنه ـ قال دفن مع أبي رجل فلم تطب نفسي حتى أخرجته فجعلته في قبر على حدة‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1353,
			"arabicnumber": 1353,
			"text": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا الليث بن سعد، قال حدثني ابن شهاب، عن عبد الرحمن بن كعب بن مالك، عن جابر بن عبد الله ـ رضى الله عنهما ـ قال كان النبي صلى الله عليه وسلم يجمع بين رجلين من قتلى أحد ثم يقول ‏\"‏ أيهم أكثر أخذا للقرآن ‏\"‏‏.‏ فإذا أشير له إلى أحدهما قدمه في اللحد فقال ‏\"‏ أنا شهيد على هؤلاء يوم القيامة ‏\"‏‏.‏ فأمر بدفنهم بدمائهم ولم يغسلهم‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1355,
			"arabicnumber": 1355,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1356,
			"arabicnumber": 1356,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد ـ وهو ابن زيد ـ عن ثابت، عن أنس ـ رضى الله عنه ـ قال كان غلام يهودي يخدم النبي صلى الله عليه وسلم فمرض، فأتاه النبي صلى الله عليه وسلم يعوده، فقعد عند رأسه فقال له ‏\"‏ أسلم ‏\"‏‏.‏ فنظر إلى أبيه وهو عنده فقال له أطع أبا القاسم صلى الله عليه وسلم‏.‏ فأسلم، فخرج النبي صلى الله عليه وسلم وهو يقول ‏\"‏ الحمد لله الذي أنقذه من النار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1357,
			"arabicnumber": 1357,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال قال عبيد الله سمعت ابن عباس ـ رضى الله عنهما ـ يقول كنت أنا وأمي، من المستضعفين أنا من الولدان، وأمي، من النساء‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، قال ابن شهاب يصلى على كل مولود متوفى وإن كان لغية، من أجل أنه ولد على فطرة الإسلام، يدعي أبواه الإسلام أو أبوه خاصة، وإن كانت أمه على غير الإسلام، إذا استهل صارخا صلي عليه، ولا يصلى على من لا يستهل من أجل أنه سقط، فإن أبا هريرة ـ رضى الله عنه ـ كان يحدث قال النبي صلى الله عليه وسلم ‏\"‏ ما من مولود إلا يولد على الفطرة، فأبواه يهودانه أو ينصرانه أو يمجسانه، كما تنتج البهيمة بهيمة جمعاء هل تحسون فيها من جدعاء ‏\"‏‏.‏ ثم يقول أبو هريرة ـ رضى الله عنه – ‏{‏فطرة الله التي فطر الناس عليها‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1359,
			"arabicnumber": 1359,
			"text": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، أخبرني أبو سلمة بن عبد الرحمن، أن أبا هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مولود إلا يولد على الفطرة، فأبواه يهودانه أو ينصرانه أو يمجسانه، كما تنتج البهيمة بهيمة جمعاء، هل تحسون فيها من جدعاء ‏\"‏‏.‏ ثم يقول أبو هريرة ـ رضى الله عنه ‏{‏فطرة الله التي فطر الناس عليها لا تبديل لخلق الله ذلك الدين القيم‏}‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1360,
			"arabicnumber": 1360,
			"text": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، قال حدثني أبي، عن صالح، عن ابن شهاب، قال أخبرني سعيد بن المسيب، عن أبيه، أنه أخبره أنه، لما حضرت أبا طالب الوفاة جاءه رسول الله صلى الله عليه وسلم فوجد عنده أبا جهل بن هشام، وعبد الله بن أبي أمية بن المغيرة، قال رسول الله صلى الله عليه وسلم لأبي طالب ‏\"‏ يا عم، قل لا إله إلا الله، كلمة أشهد لك بها عند الله ‏\"‏‏.‏ فقال أبو جهل وعبد الله بن أبي أمية يا أبا طالب، أترغب عن ملة عبد المطلب فلم يزل رسول الله صلى الله عليه وسلم يعرضها عليه، ويعودان بتلك المقالة، حتى قال أبو طالب آخر ما كلمهم هو على ملة عبد المطلب، وأبى أن يقول لا إله إلا الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما والله لأستغفرن لك، ما لم أنه عنك ‏\"‏‏.‏ فأنزل الله تعالى فيه ‏{‏ما كان للنبي‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1361,
			"arabicnumber": 1361,
			"text": "حدثنا يحيى، حدثنا أبو معاوية، عن الأعمش، عن مجاهد، عن طاوس، عن ابن عباس ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم أنه مر بقبرين يعذبان فقال ‏\"‏ إنهما ليعذبان وما يعذبان في كبير أما أحدهما فكان لا يستتر من البول، وأما الآخر فكان يمشي بالنميمة ‏\"‏‏.‏ ثم أخذ جريدة رطبة فشقها بنصفين، ثم غرز في كل قبر واحدة‏.‏ فقالوا يا رسول الله، لم صنعت هذا فقال ‏\"‏ لعله أن يخفف عنهما ما لم ييبسا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1362,
			"arabicnumber": 1362,
			"text": "حدثنا عثمان، قال حدثني جرير، عن منصور، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن علي ـ رضى الله عنه ـ قال كنا في جنازة في بقيع الغرقد، فأتانا النبي صلى الله عليه وسلم فقعد وقعدنا حوله، ومعه مخصرة فنكس، فجعل ينكت بمخصرته ثم قال ‏\"‏ ما منكم من أحد، ما من نفس منفوسة إلا كتب مكانها من الجنة والنار، وإلا قد كتب شقية أو سعيدة ‏\"‏‏.‏ فقال رجل يا رسول الله، أفلا نتكل على كتابنا وندع العمل، فمن كان منا من أهل السعادة فسيصير إلى عمل أهل السعادة، وأما من كان منا من أهل الشقاوة فسيصير إلى عمل أهل الشقاوة قال ‏\"‏ أما أهل السعادة فييسرون لعمل السعادة، وأما أهل الشقاوة فييسرون لعمل الشقاوة ‏\"‏، ثم قرأ ‏{‏فأما من أعطى واتقى‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1364,
			"arabicnumber": 1364,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1365,
			"arabicnumber": 1365,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ الذي يخنق نفسه يخنقها في النار، والذي يطعنها يطعنها في النار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1366,
			"arabicnumber": 1366,
			"text": "حدثنا يحيى بن بكير، حدثني الليث، عن عقيل، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس، عن عمر بن الخطاب ـ رضى الله عنهم ـ أنه قال لما مات عبد الله بن أبى ابن سلول دعي له رسول الله صلى الله عليه وسلم ليصلي عليه، فلما قام رسول الله صلى الله عليه وسلم وثبت إليه فقلت يا رسول الله، أتصلي على ابن أبى وقد قال يوم كذا وكذا كذا وكذا ـ أعدد عليه قوله ـ فتبسم رسول الله صلى الله عليه وسلم وقال ‏\"‏ أخر عني يا عمر ‏\"‏‏.‏ فلما أكثرت عليه قال ‏\"‏ إني خيرت فاخترت، لو أعلم أني إن زدت على السبعين فغفر له لزدت عليها ‏\"‏‏.‏ قال فصلى عليه رسول الله صلى الله عليه وسلم ثم انصرف، فلم يمكث إلا يسيرا حتى نزلت الآيتان من ‏{‏براءة‏}‏ ‏{‏ولا تصل على أحد منهم مات أبدا‏}‏ إلى ‏{‏وهم فاسقون‏}‏ قال فعجبت بعد من جرأتي على رسول الله صلى الله عليه وسلم يومئذ، والله ورسوله أعلم‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1367,
			"arabicnumber": 1367,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا عبد العزيز بن صهيب، قال سمعت أنس بن مالك ـ رضى الله عنه ـ يقول مروا بجنازة فأثنوا عليها خيرا، فقال النبي صلى الله عليه وسلم ‏\"‏ وجبت ‏\"‏‏.‏ ثم مروا بأخرى فأثنوا عليها شرا فقال ‏\"‏ وجبت ‏\"‏‏.‏ فقال عمر بن الخطاب ـ رضى الله عنه ـ ما وجبت قال ‏\"‏ هذا أثنيتم عليه خيرا فوجبت له الجنة، وهذا أثنيتم عليه شرا فوجبت له النار، أنتم شهداء الله في الأرض ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1368,
			"arabicnumber": 1368,
			"text": "حدثنا عفان بن مسلم، حدثنا داود بن أبي الفرات، عن عبد الله بن بريدة، عن أبي الأسود، قال قدمت المدينة وقد وقع بها مرض، فجلست إلى عمر بن الخطاب ـ رضى الله عنه ـ فمرت بهم جنازة فأثني على صاحبها خيرا فقال عمر ـ رضى الله عنه ـ وجبت‏.‏ ثم مر بأخرى فأثني على صاحبها خيرا، فقال عمر ـ رضى الله عنه ـ وجبت‏.‏ ثم مر بالثالثة، فأثني على صاحبها شرا فقال وجبت‏.‏ فقال أبو الأسود فقلت وما وجبت يا أمير المؤمنين قال قلت كما قال النبي صلى الله عليه وسلم ‏\"‏ أيما مسلم شهد له أربعة بخير أدخله الله الجنة ‏\"‏‏.‏ فقلنا وثلاثة قال ‏\"‏ وثلاثة ‏\"‏‏.‏ فقلنا واثنان قال ‏\"‏ واثنان ‏\"‏‏.‏ ثم لم نسأله عن الواحد‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1369,
			"arabicnumber": 1369,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، عن علقمة بن مرثد، عن سعد بن عبيدة، عن البراء بن عازب ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أقعد المؤمن في قبره أتي، ثم شهد أن لا إله إلا الله، وأن محمدا رسول الله، فذلك قوله ‏{‏يثبت الله الذين آمنوا بالقول الثابت‏}‏ ‏\"‏‏.‏ حدثنا محمد بن بشار حدثنا غندر حدثنا شعبة بهذا وزاد ‏{‏يثبت الله الذين آمنوا‏}‏ نزلت في عذاب القبر‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "حدثنا علي بن عبد الله، حدثنا يعقوب بن إبراهيم، حدثني أبي، عن صالح، حدثني نافع، أن ابن عمر ـ رضى الله عنهما ـ أخبره قال اطلع النبي صلى الله عليه وسلم على أهل القليب فقال ‏\"‏ وجدتم ما وعد ربكم حقا ‏\"‏‏.‏ فقيل له تدعو أمواتا فقال ‏\"‏ ما أنتم بأسمع منهم ولكن لا يجيبون ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1371,
			"arabicnumber": 1371,
			"text": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت إنما قال النبي صلى الله عليه وسلم ‏\"‏ إنهم ليعلمون الآن أن ما كنت أقول حق وقد قال الله تعالى ‏{‏إنك لا تسمع الموتى‏}‏‏\"‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1372,
			"arabicnumber": 1372,
			"text": "حدثنا عبدان، أخبرني أبي، عن شعبة، سمعت الأشعث، عن أبيه، عن مسروق، عن عائشة ـ رضى الله عنها ـ أن يهودية، دخلت عليها، فذكرت عذاب القبر، فقالت لها أعاذك الله من عذاب القبر‏.‏ فسألت عائشة رسول الله صلى الله عليه وسلم عن عذاب القبر فقال ‏\"‏ نعم عذاب القبر ‏\"‏‏.‏ قالت عائشة ـ رضى الله عنها ـ فما رأيت رسول الله صلى الله عليه وسلم بعد صلى صلاة إلا تعوذ من عذاب القبر‏.‏ زاد غندر ‏\"‏ عذاب القبر حق ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1373,
			"arabicnumber": 1373,
			"text": "حدثنا يحيى بن سليمان، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، أخبرني عروة بن الزبير، أنه سمع أسماء بنت أبي بكر ـ رضى الله عنهما ـ تقول قام رسول الله صلى الله عليه وسلم خطيبا فذكر فتنة القبر التي يفتتن فيها المرء، فلما ذكر ذلك ضج المسلمون ضجة‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1374,
			"arabicnumber": 1374,
			"text": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن أنس بن مالك ـ رضى الله عنه ـ أنه حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن العبد إذا وضع في قبره، وتولى عنه أصحابه، وإنه ليسمع قرع نعالهم، أتاه ملكان فيقعدانه فيقولان ما كنت تقول في الرجل لمحمد صلى الله عليه وسلم‏.‏ فأما المؤمن فيقول أشهد أنه عبد الله ورسوله‏.‏ فيقال له انظر إلى مقعدك من النار، قد أبدلك الله به مقعدا من الجنة، فيراهما جميعا ‏\"‏‏.‏ قال قتادة وذكر لنا أنه يفسح في قبره‏.‏ ثم رجع إلى حديث أنس قال ‏\"‏ وأما المنافق والكافر فيقال له ما كنت تقول في هذا الرجل فيقول لا أدري، كنت أقول ما يقول الناس‏.‏ فيقال لا دريت ولا تليت‏.‏ ويضرب بمطارق من حديد ضربة، فيصيح صيحة يسمعها من يليه، غير الثقلين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1375,
			"arabicnumber": 1375,
			"text": "حدثنا محمد بن المثنى، حدثنا يحيى، حدثنا شعبة، قال حدثني عون بن أبي جحيفة، عن أبيه، عن البراء بن عازب، عن أبي أيوب ـ رضى الله عنهم ـ قال خرج النبي صلى الله عليه وسلم وقد وجبت الشمس، فسمع صوتا فقال ‏ \"‏ يهود تعذب في قبورها ‏\"‏‏.‏ وقال النضر أخبرنا شعبة، حدثنا عون، سمعت أبي، سمعت البراء، عن أبي أيوب ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1376,
			"arabicnumber": 1376,
			"text": "حدثنا معلى، حدثنا وهيب، عن موسى بن عقبة، قال حدثتني ابنة خالد بن سعيد بن العاص، أنها سمعت النبي صلى الله عليه وسلم وهو يتعوذ من عذاب القبر‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1377,
			"arabicnumber": 1377,
			"text": "حدثنا مسلم بن إبراهيم، حدثنا هشام، حدثنا يحيى، عن أبي سلمة، عن أبي هريرة ـ رضى الله عنه ـ قال كان رسول الله صلى الله عليه وسلم يدعو ‏ \"‏ اللهم إني أعوذ بك من عذاب القبر، ومن عذاب النار، ومن فتنة المحيا والممات، ومن فتنة المسيح الدجال ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1378,
			"arabicnumber": 1378,
			"text": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن مجاهد، عن طاوس، قال ابن عباس ـ رضى الله عنهما ـ مر النبي صلى الله عليه وسلم على قبرين فقال ‏\"‏ إنهما ليعذبان، وما يعذبان من كبير ـ ثم قال ـ بلى أما أحدهما فكان يسعى بالنميمة، وأما أحدهما فكان لا يستتر من بوله ‏\"‏‏.‏ قال ثم أخذ عودا رطبا فكسره باثنتين ثم غرز كل واحد منهما على قبر، ثم قال ‏\"‏ لعله يخفف عنهما ما لم ييبسا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1379,
			"arabicnumber": 1379,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن أحدكم إذا مات عرض عليه مقعده بالغداة والعشي، إن كان من أهل الجنة فمن أهل الجنة، وإن كان من أهل النار فمن أهل النار، فيقال هذا مقعدك حتى يبعثك الله يوم القيامة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1380,
			"arabicnumber": 1380,
			"text": "حدثنا قتيبة، حدثنا الليث، عن سعيد بن أبي سعيد، عن أبيه، أنه سمع أبا سعيد الخدري ـ رضى الله عنه ـ يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا وضعت الجنازة فاحتملها الرجال على أعناقهم، فإن كانت صالحة قالت قدموني قدموني‏.‏ وإن كانت غير صالحة قالت يا ويلها أين يذهبون بها‏.‏ يسمع صوتها كل شىء إلا الإنسان، ولو سمعها الإنسان لصعق ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1381,
			"arabicnumber": 1381,
			"text": "حدثنا يعقوب بن إبراهيم، حدثنا ابن علية، حدثنا عبد العزيز بن صهيب، عن أنس بن مالك ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما من الناس مسلم يموت له ثلاثة من الولد لم يبلغوا الحنث إلا أدخله الله الجنة بفضل رحمته إياهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1382,
			"arabicnumber": 1382,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن عدي بن ثابت، أنه سمع البراء ـ رضى الله عنه ـ قال لما توفي إبراهيم ـ عليه السلام ـ قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن له مرضعا في الجنة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1383,
			"arabicnumber": 1383,
			"text": "حدثنا حبان، أخبرنا عبد الله، أخبرنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهم ـ قال سئل رسول الله صلى الله عليه وسلم عن أولاد المشركين فقال ‏ \"‏ الله إذ خلقهم أعلم بما كانوا عاملين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1384,
			"arabicnumber": 1384,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني عطاء بن يزيد الليثي، أنه سمع أبا هريرة ـ رضى الله عنه ـ يقول سئل النبي صلى الله عليه وسلم عن ذراري المشركين فقال ‏ \"‏ الله أعلم بما كانوا عاملين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1385,
			"arabicnumber": 1385,
			"text": "حدثنا آدم، حدثنا ابن أبي ذئب، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ كل مولود يولد على الفطرة، فأبواه يهودانه أو ينصرانه أو يمجسانه، كمثل البهيمة تنتج البهيمة، هل ترى فيها جدعاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1386,
			"arabicnumber": 1386,
			"text": "حدثنا موسى بن إسماعيل، حدثنا جرير بن حازم، حدثنا أبو رجاء، عن سمرة بن جندب، قال كان النبي صلى الله عليه وسلم إذا صلى صلاة أقبل علينا بوجهه فقال ‏\"‏ من رأى منكم الليلة رؤيا ‏\"‏‏.‏ قال فإن رأى أحد قصها، فيقول ما شاء الله، فسألنا يوما، فقال ‏\"‏ هل رأى أحد منكم رؤيا ‏\"‏‏.‏ قلنا لا‏.‏ قال ‏\"‏ لكني رأيت الليلة رجلين أتياني فأخذا بيدي، فأخرجاني إلى الأرض المقدسة، فإذا رجل جالس، ورجل قائم بيده كلوب من حديد ـ قال بعض أصحابنا عن موسى إنه ـ يدخل ذلك الكلوب في شدقه، حتى يبلغ قفاه، ثم يفعل بشدقه الآخر مثل ذلك، ويلتئم شدقه هذا، فيعود فيصنع مثله‏.‏ قلت ما هذا قالا انطلق‏.‏ فانطلقنا حتى أتينا على رجل مضطجع على قفاه، ورجل قائم على رأسه بفهر أو صخرة، فيشدخ به رأسه، فإذا ضربه تدهده الحجر، فانطلق إليه ليأخذه، فلا يرجع إلى هذا حتى يلتئم رأسه، وعاد رأسه كما هو، فعاد إليه فضربه، قلت من هذا قالا انطلق‏.‏ فانطلقنا إلى ثقب مثل التنور، أعلاه ضيق وأسفله واسع، يتوقد تحته نارا، فإذا اقترب ارتفعوا حتى كاد أن يخرجوا، فإذا خمدت رجعوا فيها، وفيها رجال ونساء عراة‏.‏ فقلت من هذا قالا انطلق‏.‏ فانطلقنا حتى أتينا على نهر من دم، فيه رجل قائم على وسط النهر رجل بين يديه حجارة، فأقبل الرجل الذي في النهر، فإذا أراد أن يخرج رمى الرجل بحجر في فيه، فرده حيث كان، فجعل كلما جاء ليخرج رمى في فيه بحجر، فيرجع كما كان‏.‏ فقلت ما هذا قالا انطلق‏.‏ فانطلقنا حتى انتهينا إلى روضة خضراء، فيها شجرة عظيمة، وفي أصلها شيخ وصبيان، وإذا رجل قريب من الشجرة بين يديه نار يوقدها، فصعدا بي في الشجرة، وأدخلاني دارا لم أر قط أحسن منها، فيها رجال شيوخ وشباب، ونساء وصبيان، ثم أخرجاني منها فصعدا بي الشجرة فأدخلاني دارا هي أحسن وأفضل، فيها شيوخ وشباب‏.‏ قلت طوفتماني الليلة، فأخبراني عما رأيت‏.‏ قالا نعم، أما الذي رأيته يشق شدقه فكذاب يحدث بالكذبة، فتحمل عنه حتى تبلغ الآفاق، فيصنع به إلى يوم القيامة‏.‏ والذي رأيته يشدخ رأسه فرجل علمه الله القرآن، فنام عنه بالليل، ولم يعمل فيه بالنهار، يفعل به إلى يوم القيامة‏.‏ والذي رأيته في الثقب فهم الزناة‏.‏ والذي رأيته في النهر آكلو الربا‏.‏ والشيخ في أصل الشجرة إبراهيم ـ عليه السلام ـ والصبيان حوله فأولاد الناس، والذي يوقد النار مالك خازن النار‏.‏ والدار الأولى التي دخلت دار عامة المؤمنين، وأما هذه الدار فدار الشهداء، وأنا جبريل، وهذا ميكائيل، فارفع رأسك، فرفعت رأسي فإذا فوقي مثل السحاب‏.‏ قالا ذاك منزلك‏.‏ قلت دعاني أدخل منزلي‏.‏ قالا إنه بقي لك عمر لم تستكمله، فلو استكملت أتيت منزلك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1387,
			"arabicnumber": 1387,
			"text": "حدثنا معلى بن أسد، حدثنا وهيب، عن هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت دخلت على أبي بكر ـ رضى الله عنه ـ فقال في كم كفنتم النبي صلى الله عليه وسلم قالت في ثلاثة أثواب بيض سحولية، ليس فيها قميص ولا عمامة‏.‏ وقال لها في أى يوم توفي رسول الله صلى الله عليه وسلم قالت يوم الاثنين‏.‏ قال فأى يوم هذا قالت يوم الاثنين‏.‏ قال أرجو فيما بيني وبين الليل‏.‏ فنظر إلى ثوب عليه كان يمرض فيه، به ردع من زعفران فقال اغسلوا ثوبي هذا، وزيدوا عليه ثوبين فكفنوني فيها‏.‏ قلت إن هذا خلق‏.‏ قال إن الحى أحق بالجديد من الميت، إنما هو للمهلة‏.‏ فلم يتوف حتى أمسى من ليلة الثلاثاء ودفن قبل أن يصبح‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1388,
			"arabicnumber": 1388,
			"text": "حدثنا سعيد بن أبي مريم، حدثنا محمد بن جعفر، قال أخبرني هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ‏.‏ أن رجلا، قال للنبي صلى الله عليه وسلم إن أمي افتلتت نفسها، وأظنها لو تكلمت تصدقت، فهل لها أجر إن تصدقت عنها قال ‏ \"‏ نعم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1389,
			"arabicnumber": 1389,
			"text": "حدثنا إسماعيل، حدثني سليمان، عن هشام، وحدثني محمد بن حرب، حدثنا أبو مروان، يحيى بن أبي زكرياء عن هشام، عن عروة، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليتعذر في مرضه ‏ \"‏ أين أنا اليوم أين أنا غدا ‏\"‏ استبطاء ليوم عائشة، فلما كان يومي قبضه الله بين سحري ونحري، ودفن في بيتي‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1390,
			"arabicnumber": 1390,
			"text": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن هلال، عن عروة، عن عائشة ـ رضى الله عنها ـ قالت قال رسول الله صلى الله عليه وسلم في مرضه الذي لم يقم منه ‏ \"‏ لعن الله اليهود والنصارى، اتخذوا قبور أنبيائهم مساجد ‏\"‏‏.‏ لولا ذلك أبرز قبره، غير أنه خشي أو خشي أن يتخذ مسجدا‏.‏ وعن هلال قال كناني عروة بن الزبير ولم يولد لي‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1391,
			"arabicnumber": 1391,
			"text": "وعن هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ أنها أوصت عبد الله بن الزبير ـ رضى الله عنهما ـ لا تدفني معهم وادفني مع صواحبي بالبقيع، لا أزكى به أبدا‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1392,
			"arabicnumber": 1392,
			"text": "حدثنا قتيبة، حدثنا جرير بن عبد الحميد، حدثنا حصين بن عبد الرحمن، عن عمرو بن ميمون الأودي، قال رأيت عمر بن الخطاب ـ رضى الله عنه ـ قال يا عبد الله بن عمر، اذهب إلى أم المؤمنين عائشة ـ رضى الله عنها ـ فقل يقرأ عمر بن الخطاب عليك السلام، ثم سلها أن أدفن مع صاحبى‏.‏ قالت كنت أريده لنفسي، فلأوثرنه اليوم على نفسي‏.‏ فلما أقبل قال له ما لديك قال أذنت لك يا أمير المؤمنين‏.‏ قال ما كان شىء أهم إلى من ذلك المضجع، فإذا قبضت فاحملوني ثم سلموا ثم قل يستأذن عمر بن الخطاب‏.‏ فإن أذنت لي فادفنوني، وإلا فردوني إلى مقابر المسلمين، إني لا أعلم أحدا أحق بهذا الأمر من هؤلاء النفر الذين توفي رسول الله صلى الله عليه وسلم وهو عنهم راض، فمن استخلفوا بعدي فهو الخليفة، فاسمعوا له وأطيعوا‏.‏ فسمى عثمان وعليا وطلحة والزبير وعبد الرحمن بن عوف وسعد بن أبي وقاص، وولج عليه شاب من الأنصار فقال أبشر يا أمير المؤمنين ببشرى الله، كان لك من القدم في الإسلام ما قد علمت، ثم استخلفت فعدلت، ثم الشهادة بعد هذا كله‏.‏ فقال ليتني يا ابن أخي وذلك كفافا لا على ولا لي أوصي الخليفة من بعدي بالمهاجرين الأولين خيرا، أن يعرف لهم حقهم، وأن يحفظ لهم حرمتهم، وأوصيه بالأنصار خيرا الذين تبوءوا الدار والإيمان أن يقبل من محسنهم، ويعفى عن مسيئهم، وأوصيه بذمة الله وذمة رسوله صلى الله عليه وسلم أن يوفى لهم بعهدهم، وأن يقاتل من ورائهم، وأن لا يكلفوا فوق طاقتهم‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1393,
			"arabicnumber": 1393,
			"text": "حدثنا آدم، حدثنا شعبة، عن الأعمش، عن مجاهد، عن عائشة ـ رضى الله عنها ـ قالت قال النبي صلى الله عليه وسلم ‏ \"‏ لا تسبوا الأموات فإنهم قد أفضوا إلى ما قدموا ‏\"‏‏.‏ ورواه عبد الله بن عبد القدوس عن الأعمش، ومحمد بن أنس عن الأعمش‏.‏ تابعه علي بن الجعد وابن عرعرة وابن أبي عدي عن شعبة‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1394,
			"arabicnumber": 1394,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثني عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهما ـ قال قال أبو لهب ـ عليه لعنة الله ـ للنبي صلى الله عليه وسلم تبا لك سائر اليوم‏.‏ فنزلت ‏{‏تبت يدا أبي لهب وتب‏}‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 148
			}
		}
	]
}