{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"24": "Obligatory Charity Tax (Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1395,
			"arabicnumber": 1395,
			"text": "حدثنا أبو عاصم الضحاك بن مخلد، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم بعث معاذا ـ رضى الله عنه ـ إلى اليمن فقال ‏ \"‏ ادعهم إلى شهادة أن لا إله إلا الله، وأني رسول الله، فإن هم أطاعوا لذلك فأعلمهم أن الله قد افترض عليهم خمس صلوات في كل يوم وليلة، فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم، تؤخذ من أغنيائهم وترد على فقرائهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1396,
			"arabicnumber": 1396,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، عن ابن عثمان بن عبد الله بن موهب، عن موسى بن طلحة، عن أبي أيوب، رضى الله عنه أن رجلا، قال للنبي صلى الله عليه وسلم أخبرني بعمل يدخلني الجنة‏.‏ قال ما له ما له وقال النبي صلى الله عليه وسلم ‏ \"‏ أرب ماله، تعبد الله، ولا تشرك به شيئا، وتقيم الصلاة، وتؤتي الزكاة، وتصل الرحم ‏\"‏‏.‏ وقال بهز حدثنا شعبة، حدثنا محمد بن عثمان، وأبوه، عثمان بن عبد الله أنهما سمعا موسى بن طلحة، عن أبي أيوب، بهذا‏.‏ قال أبو عبد الله أخشى أن يكون، محمد غير محفوظ إنما هو عمرو‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1397,
			"arabicnumber": 1397,
			"text": "حدثني محمد بن عبد الرحيم، حدثنا عفان بن مسلم، حدثنا وهيب، عن يحيى بن سعيد بن حيان، عن أبي زرعة، عن أبي هريرة ـ رضى الله عنه ـ أن أعرابيا، أتى النبي صلى الله عليه وسلم فقال دلني على عمل إذا عملته دخلت الجنة‏.‏ قال ‏\"‏ تعبد الله لا تشرك به شيئا، وتقيم الصلاة المكتوبة، وتؤدي الزكاة المفروضة، وتصوم رمضان ‏\"‏‏.‏ قال والذي نفسي بيده لا أزيد على هذا‏.‏ فلما ولى قال النبي صلى الله عليه وسلم ‏\"‏ من سره أن ينظر إلى رجل من أهل الجنة فلينظر إلى هذا ‏\"‏‏.‏ حدثنا مسدد، عن يحيى، عن أبي حيان، قال أخبرني أبو زرعة، عن النبي صلى الله عليه وسلم بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1398,
			"arabicnumber": 1398,
			"text": "حدثنا حجاج، حدثنا حماد بن زيد، حدثنا أبو جمرة، قال سمعت ابن عباس ـ رضى الله عنهما ـ يقول قدم وفد عبد القيس على النبي صلى الله عليه وسلم فقالوا يا رسول الله إن هذا الحى من ربيعة قد حالت بيننا وبينك كفار مضر، ولسنا نخلص إليك إلا في الشهر الحرام، فمرنا بشىء نأخذه عنك، وندعو إليه من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع، وأنهاكم عن أربع الإيمان بالله وشهادة أن لا إله إلا الله ـ وعقد بيده هكذا ـ وإقام الصلاة، وإيتاء الزكاة، وأن تؤدوا خمس ما غنمتم، وأنهاكم عن الدباء والحنتم والنقير والمزفت ‏\"‏‏.‏ وقال سليمان وأبو النعمان عن حماد ‏\"‏ الإيمان بالله شهادة أن لا إله إلا الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1400,
			"arabicnumber": 1400,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1401,
			"arabicnumber": 1401,
			"text": "حدثنا ابن نمير، قال حدثني أبي، حدثنا إسماعيل، عن قيس، قال قال جرير بن عبد الله بايعت النبي صلى الله عليه وسلم على إقام الصلاة، وإيتاء الزكاة، والنصح لكل مسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1402,
			"arabicnumber": 1402,
			"text": "حدثنا الحكم بن نافع، أخبرنا شعيب، حدثنا أبو الزناد، أن عبد الرحمن بن هرمز الأعرج، حدثه أنه، سمع أبا هريرة ـ رضى الله عنه ـ يقول قال النبي صلى الله عليه وسلم ‏\"‏ تأتي الإبل على صاحبها، على خير ما كانت، إذا هو لم يعط فيها حقها، تطؤه بأخفافها، وتأتي الغنم على صاحبها على خير ما كانت، إذا لم يعط فيها حقها، تطؤه بأظلافها، وتنطحه بقرونها ‏\"‏‏.‏ وقال ‏\"‏ ومن حقها أن تحلب على الماء ‏\"‏‏.‏ قال ‏\"‏ ولا يأتي أحدكم يوم القيامة بشاة يحملها على رقبته لها يعار، فيقول يا محمد‏.‏ فأقول لا أملك لك شيئا قد بلغت‏.‏ ولا يأتي ببعير، يحمله على رقبته له رغاء، فيقول يا محمد‏.‏ فأقول لا أملك لك شيئا قد بلغت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1403,
			"arabicnumber": 1403,
			"text": "حدثنا علي بن عبد الله، حدثنا هاشم بن القاسم، حدثنا عبد الرحمن بن عبد الله بن دينار، عن أبيه، عن أبي صالح السمان، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من آتاه الله مالا، فلم يؤد زكاته مثل له يوم القيامة شجاعا أقرع، له زبيبتان، يطوقه يوم القيامة، ثم يأخذ بلهزمتيه ـ يعني شدقيه ـ ثم يقول أنا مالك، أنا كنزك ‏\"‏ ثم تلا ‏{‏لا يحسبن الذين يبخلون‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1404,
			"arabicnumber": 1404,
			"text": "وقال أحمد بن شبيب بن سعيد حدثنا أبي، عن يونس، عن ابن شهاب، عن خالد بن أسلم، قال خرجنا مع عبد الله بن عمر ـ رضى الله عنهما ـ فقال أعرابي أخبرني قول الله، ‏{‏والذين يكنزون الذهب والفضة ولا ينفقونها في سبيل الله‏}‏ قال ابن عمر ـ رضى الله عنهما ـ من كنزها فلم يؤد زكاتها فويل له، إنما كان هذا قبل أن تنزل الزكاة فلما أنزلت جعلها الله طهرا للأموال‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1405,
			"arabicnumber": 1405,
			"text": "حدثنا إسحاق بن يزيد، أخبرنا شعيب بن إسحاق، قال الأوزاعي أخبرني يحيى بن أبي كثير، أن عمرو بن يحيى بن عمارة، أخبره عن أبيه، يحيى بن عمارة بن أبي الحسن أنه سمع أبا سعيد ـ رضى الله عنه ـ يقول قال النبي صلى الله عليه وسلم ‏ \"‏ ليس فيما دون خمس أواق صدقة، وليس فيما دون خمس ذود صدقة، وليس فيما دون خمس أوسق صدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1406,
			"arabicnumber": 1406,
			"text": "حدثنا علي، سمع هشيما، أخبرنا حصين، عن زيد بن وهب، قال مررت بالربذة فإذا أنا بأبي، ذر ـ رضى الله عنه ـ فقلت له ما أنزلك منزلك هذا قال كنت بالشأم، فاختلفت أنا ومعاوية في الذين يكنزون الذهب والفضة ولا ينفقونها في سبيل الله‏.‏ قال معاوية نزلت في أهل الكتاب‏.‏ فقلت نزلت فينا وفيهم‏.‏ فكان بيني وبينه في ذاك، وكتب إلى عثمان ـ رضى الله عنه ـ يشكوني، فكتب إلى عثمان أن اقدم المدينة‏.‏ فقدمتها فكثر على الناس حتى كأنهم لم يروني قبل ذلك، فذكرت ذاك لعثمان فقال لي إن شئت تنحيت فكنت قريبا‏.‏ فذاك الذي أنزلني هذا المنزل، ولو أمروا على حبشيا لسمعت وأطعت‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1408,
			"arabicnumber": 1408,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1409,
			"arabicnumber": 1409,
			"text": "حدثنا محمد بن المثنى، حدثنا يحيى، عن إسماعيل، قال حدثني قيس، عن ابن مسعود ـ رضى الله عنه ـ قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ لا حسد إلا في اثنتين رجل آتاه الله مالا فسلطه على هلكته في الحق، ورجل آتاه الله حكمة فهو يقضي بها ويعلمها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1410,
			"arabicnumber": 1410,
			"text": "حدثنا عبد الله بن منير، سمع أبا النضر، حدثنا عبد الرحمن ـ هو ابن عبد الله بن دينار ـ عن أبيه، عن أبي صالح، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من تصدق بعدل تمرة من كسب طيب ـ ولا يقبل الله إلا الطيب ـ وإن الله يتقبلها بيمينه، ثم يربيها لصاحبه كما يربي أحدكم فلوه حتى تكون مثل الجبل ‏\"‏‏.‏ تابعه سليمان عن ابن دينار‏.‏ وقال ورقاء عن ابن دينار، عن سعيد بن يسار، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم‏.‏ ورواه مسلم بن أبي مريم وزيد بن أسلم وسهيل عن أبي صالح عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1411,
			"arabicnumber": 1411,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا معبد بن خالد، قال سمعت حارثة بن وهب، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ تصدقوا فإنه يأتي عليكم زمان يمشي الرجل بصدقته، فلا يجد من يقبلها يقول الرجل لو جئت بها بالأمس لقبلتها، فأما اليوم فلا حاجة لي بها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1412,
			"arabicnumber": 1412,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ لا تقوم الساعة حتى يكثر فيكم المال فيفيض، حتى يهم رب المال من يقبل صدقته، وحتى يعرضه فيقول الذي يعرضه عليه لا أرب لي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1413,
			"arabicnumber": 1413,
			"text": "حدثنا عبد الله بن محمد، حدثنا أبو عاصم النبيل، أخبرنا سعدان بن بشر، حدثنا أبو مجاهد، حدثنا محل بن خليفة الطائي، قال سمعت عدي بن حاتم ـ رضى الله عنه ـ يقول كنت عند رسول الله صلى الله عليه وسلم فجاءه رجلان أحدهما يشكو العيلة، والآخر يشكو قطع السبيل، فقال رسول الله صلى الله عليه وسلم ‏ \"‏ أما قطع السبيل فإنه لا يأتي عليك إلا قليل حتى تخرج العير إلى مكة بغير خفير، وأما العيلة فإن الساعة لا تقوم حتى يطوف أحدكم بصدقته لا يجد من يقبلها منه، ثم ليقفن أحدكم بين يدى الله ليس بينه وبينه حجاب ولا ترجمان يترجم له، ثم ليقولن له ألم أوتك مالا فليقولن بلى‏.‏ ثم ليقولن ألم أرسل إليك رسولا فليقولن بلى‏.‏ فينظر عن يمينه فلا يرى إلا النار، ثم ينظر عن شماله فلا يرى إلا النار، فليتقين أحدكم النار ولو بشق تمرة، فإن لم يجد فبكلمة طيبة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1414,
			"arabicnumber": 1414,
			"text": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليأتين على الناس زمان يطوف الرجل فيه بالصدقة من الذهب ثم لا يجد أحدا يأخذها منه، ويرى الرجل الواحد يتبعه أربعون امرأة، يلذن به من قلة الرجال وكثرة النساء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1415,
			"arabicnumber": 1415,
			"text": "حدثنا عبيد الله بن سعيد، حدثنا أبو النعمان الحكم ـ هو ابن عبد الله البصري ـ حدثنا شعبة، عن سليمان، عن أبي وائل، عن أبي مسعود ـ رضى الله عنه ـ قال لما نزلت آية الصدقة كنا نحامل، فجاء رجل فتصدق بشىء كثير فقالوا مرائي‏.‏ وجاء رجل فتصدق بصاع فقالوا إن الله لغني عن صاع هذا‏.‏ فنزلت ‏{‏الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1416,
			"arabicnumber": 1416,
			"text": "حدثنا سعيد بن يحيى، حدثنا أبي، حدثنا الأعمش، عن شقيق، عن أبي مسعود الأنصاري ـ رضى الله عنه ـ قال كان رسول الله صلى الله عليه وسلم إذا أمرنا بالصدقة انطلق أحدنا إلى السوق فتحامل فيصيب المد، وإن لبعضهم اليوم لمائة ألف‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": 1417,
			"text": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي إسحاق، قال سمعت عبد الله بن معقل، قال سمعت عدي بن حاتم ـ رضى الله عنه ـ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ اتقوا النار ولو بشق تمرة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": 1418,
			"text": "حدثنا بشر بن محمد، قال أخبرنا عبد الله، أخبرنا معمر، عن الزهري، قال حدثني عبد الله بن أبي بكر بن حزم، عن عروة، عن عائشة ـ رضى الله عنها ـ قالت دخلت امرأة معها ابنتان لها تسأل، فلم تجد عندي شيئا غير تمرة فأعطيتها إياها، فقسمتها بين ابنتيها ولم تأكل منها، ثم قامت فخرجت، فدخل النبي صلى الله عليه وسلم علينا، فأخبرته فقال ‏ \"‏ من ابتلي من هذه البنات بشىء كن له سترا من النار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": 1419,
			"text": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا عمارة بن القعقاع، حدثنا أبو زرعة، حدثنا أبو هريرة ـ رضى الله عنه ـ قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله أى الصدقة أعظم أجرا قال ‏ \"‏ أن تصدق وأنت صحيح شحيح، تخشى الفقر وتأمل الغنى، ولا تمهل حتى إذا بلغت الحلقوم قلت لفلان كذا، ولفلان كذا، وقد كان لفلان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": 1420,
			"text": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن فراس، عن الشعبي، عن مسروق، عن عائشة، رضى الله عنها أن بعض، أزواج النبي صلى الله عليه وسلم قلن للنبي صلى الله عليه وسلم أينا أسرع بك لحوقا قال ‏ \"‏ أطولكن يدا ‏\"‏‏.‏ فأخذوا قصبة يذرعونها، فكانت سودة أطولهن يدا، فعلمنا بعد أنما كانت طول يدها الصدقة، وكانت أسرعنا لحوقا به وكانت تحب الصدقة‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": 1421,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ قال رجل لأتصدقن بصدقة‏.‏ فخرج بصدقته فوضعها في يد سارق فأصبحوا يتحدثون تصدق على سارق‏.‏ فقال اللهم لك الحمد لأتصدقن بصدقة‏.‏ فخرج بصدقته فوضعها في يدى زانية، فأصبحوا يتحدثون تصدق الليلة على زانية‏.‏ فقال اللهم لك الحمد على زانية، لأتصدقن بصدقة‏.‏ فخرج بصدقته فوضعها في يدى غني فأصبحوا يتحدثون تصدق على غني فقال اللهم لك الحمد، على سارق وعلى زانية وعلى غني‏.‏ فأتي فقيل له أما صدقتك على سارق فلعله أن يستعف عن سرقته، وأما الزانية فلعلها أن تستعف عن زناها، وأما الغني فلعله يعتبر فينفق مما أعطاه الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": 1422,
			"text": "حدثنا محمد بن يوسف، حدثنا إسرائيل، حدثنا أبو الجويرية، أن معن بن يزيد ـ رضى الله عنه ـ حدثه قال بايعت رسول الله صلى الله عليه وسلم أنا وأبي وجدي وخطب على فأنكحني وخاصمت إليه ـ وـ كان أبي يزيد أخرج دنانير يتصدق بها فوضعها عند رجل في المسجد، فجئت فأخذتها فأتيته بها فقال والله ما إياك أردت‏.‏ فخاصمته إلى رسول الله صلى الله عليه وسلم فقال ‏ \"‏ لك ما نويت يا يزيد، ولك ما أخذت يا معن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1423,
			"arabicnumber": 1423,
			"text": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، قال حدثني خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ سبعة يظلهم الله تعالى في ظله يوم لا ظل إلا ظله إمام عدل، وشاب نشأ في عبادة الله، ورجل قلبه معلق في المساجد، ورجلان تحابا في الله اجتمعا عليه وتفرقا عليه، ورجل دعته امرأة ذات منصب وجمال فقال إني أخاف الله، ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما تنفق يمينه، ورجل ذكر الله خاليا ففاضت عيناه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1424,
			"arabicnumber": 1424,
			"text": "حدثنا علي بن الجعد، أخبرنا شعبة، قال أخبرني معبد بن خالد، قال سمعت حارثة بن وهب الخزاعي ـ رضى الله عنه ـ يقول سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ تصدقوا، فسيأتي عليكم زمان يمشي الرجل بصدقته فيقول الرجل لو جئت بها بالأمس لقبلتها منك، فأما اليوم فلا حاجة لي فيها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1425,
			"arabicnumber": 1425,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن شقيق، عن مسروق، عن عائشة ـ رضى الله عنها ـ قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا أنفقت المرأة من طعام بيتها غير مفسدة كان لها أجرها بما أنفقت ولزوجها أجره بما كسب، وللخازن مثل ذلك، لا ينقص بعضهم أجر بعض شيئا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1426,
			"arabicnumber": 1426,
			"text": "حدثنا عبدان، أخبرنا عبد الله، عن يونس، عن الزهري، قال أخبرني سعيد بن المسيب، أنه سمع أبا هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ خير الصدقة ما كان عن ظهر غنى، وابدأ بمن تعول ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1428,
			"arabicnumber": 1428,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1429,
			"arabicnumber": 1429,
			"text": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال سمعت النبي صلى الله عليه وسلم ح‏.‏ وحدثنا عبد الله بن مسلمة، عن مالك، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال وهو على المنبر، وذكر الصدقة والتعفف والمسألة ‏ \"‏ اليد العليا خير من اليد السفلى، فاليد العليا هي المنفقة، والسفلى هي السائلة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1430,
			"arabicnumber": 1430,
			"text": "حدثنا أبو عاصم، عن عمر بن سعيد، عن ابن أبي مليكة، أن عقبة بن الحارث ـ رضى الله عنه ـ حدثه قال صلى بنا النبي صلى الله عليه وسلم العصر، فأسرع ثم دخل البيت، فلم يلبث أن خرج، فقلت أو قيل له فقال ‏ \"‏ كنت خلفت في البيت تبرا من الصدقة، فكرهت أن أبيته فقسمته ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1431,
			"arabicnumber": 1431,
			"text": "حدثنا مسلم، حدثنا شعبة، حدثنا عدي، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهما ـ قال خرج النبي صلى الله عليه وسلم يوم عيد فصلى ركعتين لم يصل قبل ولا بعد، ثم مال على النساء ومعه بلال، فوعظهن وأمرهن أن يتصدقن، فجعلت المرأة تلقي القلب والخرص‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1432,
			"arabicnumber": 1432,
			"text": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا أبو بردة بن عبد الله بن أبي بردة، حدثنا أبو بردة بن أبي موسى، عن أبيه ـ رضى الله عنه ـ قال كان رسول الله صلى الله عليه وسلم إذا جاءه السائل، أو طلبت إليه حاجة قال ‏ \"‏ اشفعوا تؤجروا، ويقضي الله على لسان نبيه صلى الله عليه وسلم ما شاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1433,
			"arabicnumber": 1433,
			"text": "حدثنا صدقة بن الفضل، أخبرنا عبدة، عن هشام، عن فاطمة، عن أسماء ـ رضى الله عنها ـ قالت قال لي النبي صلى الله عليه وسلم ‏\"‏ لا توكي فيوكى عليك ‏\"‏‏.‏ حدثنا عثمان بن أبي شيبة، عن عبدة، وقال، ‏\"‏ لا تحصي فيحصي الله عليك ‏\"‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1434,
			"arabicnumber": 1434,
			"text": "حدثنا أبو عاصم، عن ابن جريج، وحدثني محمد بن عبد الرحيم، عن حجاج بن محمد، عن ابن جريج، قال أخبرني ابن أبي مليكة، عن عباد بن عبد الله بن الزبير، أخبره عن أسماء بنت أبي بكر ـ رضى الله عنهما ـ أنها جاءت إلى النبي صلى الله عليه وسلم فقال ‏ \"‏ لا توعي فيوعي الله عليك، ارضخي ما استطعت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1435,
			"arabicnumber": 1435,
			"text": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن أبي وائل، عن حذيفة ـ رضى الله عنه ـ قال قال عمر ـ رضى الله عنه ـ أيكم يحفظ حديث رسول الله صلى الله عليه وسلم عن الفتنة قال قلت أنا أحفظه كما قال‏.‏ قال إنك عليه لجريء فكيف قال قلت فتنة الرجل في أهله وولده وجاره تكفرها الصلاة والصدقة والمعروف‏.‏ قال سليمان قد كان يقول ‏ \"‏ الصلاة والصدقة، والأمر بالمعروف والنهى عن المنكر ‏\"‏‏.‏ قال ليس هذه أريد، ولكني أريد التي تموج كموج البحر‏.‏ قال قلت ليس عليك بها يا أمير المؤمنين بأس، بينك وبينها باب مغلق‏.‏ قال فيكسر الباب أو يفتح‏.‏ قال قلت لا‏.‏ بل يكسر‏.‏ قال فإنه إذا كسر لم يغلق أبدا‏.‏ قال قلت أجل‏.‏ فهبنا أن نسأله من الباب فقلنا لمسروق سله‏.‏ قال فسأله‏.‏ فقال عمر ـ رضى الله عنه ـ‏.‏ قال قلنا فعلم عمر من تعني قال نعم، كما أن دون غد ليلة، وذلك أني حدثته حديثا ليس بالأغاليط‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1436,
			"arabicnumber": 1436,
			"text": "حدثنا عبد الله بن محمد، حدثنا هشام، حدثنا معمر، عن الزهري، عن عروة، عن حكيم بن حزام ـ رضى الله عنه ـ قال قلت يا رسول الله أرأيت أشياء كنت أتحنث بها في الجاهلية من صدقة أو عتاقة وصلة رحم فهل فيها من أجر فقال النبي صلى الله عليه وسلم ‏ \"‏ أسلمت على ما سلف من خير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1437,
			"arabicnumber": 1437,
			"text": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن الأعمش، عن أبي وائل، عن مسروق، عن عائشة ـ رضى الله عنها ـ قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا تصدقت المرأة من طعام زوجها غير مفسدة كان لها أجرها، ولزوجها بما كسب، وللخازن مثل ذلك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1438,
			"arabicnumber": 1438,
			"text": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الخازن المسلم الأمين الذي ينفذ ـ وربما قال يعطي ـ ما أمر به كاملا موفرا طيب به نفسه، فيدفعه إلى الذي أمر له به، أحد المتصدقين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1439,
			"arabicnumber": 1439,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا منصور، والأعمش، عن أبي وائل، عن مسروق، عن عائشة ـ رضى الله عنها ـ عن النبي صلى الله عليه وسلم تعني إذا تصدقت المرأة من بيت زوجها‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1440,
			"arabicnumber": 1440,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن شقيق، عن مسروق، عن عائشة ـ رضى الله عنها ـ قالت قال النبي صلى الله عليه وسلم ‏ \"‏ إذا أطعمت المرأة من بيت زوجها غير مفسدة، لها أجرها، وله مثله، وللخازن مثل ذلك، له بما اكتسب، ولها بما أنفقت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1441,
			"arabicnumber": 1441,
			"text": "حدثنا يحيى بن يحيى، أخبرنا جرير، عن منصور، عن شقيق، عن مسروق، عن عائشة ـ رضى الله عنها ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا أنفقت المرأة من طعام بيتها غير مفسدة فلها أجرها، وللزوج بما اكتسب، وللخازن مثل ذلك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1442,
			"arabicnumber": 1442,
			"text": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن معاوية بن أبي مزرد، عن أبي الحباب، عن أبي هريرة ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم قال ‏ \"‏ ما من يوم يصبح العباد فيه إلا ملكان ينزلان فيقول أحدهما اللهم أعط منفقا خلفا، ويقول الآخر اللهم أعط ممسكا تلفا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1443,
			"arabicnumber": 1443,
			"text": "حدثنا موسى، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن أبي هريرة ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏\"‏ مثل البخيل والمتصدق كمثل رجلين، عليهما جبتان من حديد ‏\"‏‏.‏ وحدثنا أبو اليمان أخبرنا شعيب حدثنا أبو الزناد أن عبد الرحمن حدثه أنه سمع أبا هريرة ـ رضى الله عنه ـ أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ مثل البخيل والمنفق كمثل رجلين، عليهما جبتان من حديد، من ثديهما إلى تراقيهما، فأما المنفق فلا ينفق إلا سبغت ـ أو وفرت ـ على جلده حتى تخفي بنانه وتعفو أثره، وأما البخيل فلا يريد أن ينفق شيئا إلا لزقت كل حلقة مكانها، فهو يوسعها ولا تتسع ‏\"‏‏.‏ تابعه الحسن بن مسلم عن طاوس في الجبتين‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1444,
			"arabicnumber": 1444,
			"text": "وقال حنظلة عن طاوس، ‏\"‏ جنتان ‏\"‏‏.‏ وقال الليث حدثني جعفر، عن ابن هرمز، سمعت أبا هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم ‏\"‏ جنتان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1445,
			"arabicnumber": 1445,
			"text": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، حدثنا سعيد بن أبي بردة، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ على كل مسلم صدقة ‏\"‏‏.‏ فقالوا يا نبي الله فمن لم يجد قال ‏\"‏ يعمل بيده فينفع نفسه ويتصدق ‏\"‏‏.‏ قالوا فإن لم يجد قال ‏\"‏ يعين ذا الحاجة الملهوف ‏\"‏‏.‏ قالوا فإن لم يجد‏.‏ قال ‏\"‏ فليعمل بالمعروف، وليمسك عن الشر فإنها له صدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1446,
			"arabicnumber": 1446,
			"text": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن خالد الحذاء، عن حفصة بنت سيرين، عن أم عطية ـ رضى الله عنها ـ قالت بعث إلى نسيبة الأنصارية بشاة فأرسلت إلى عائشة ـ رضى الله عنها ـ منها فقال النبي صلى الله عليه وسلم ‏\"‏ عندكم شىء ‏\"‏‏.‏ فقلت لا إلا ما أرسلت به نسيبة من تلك الشاة فقال ‏\"‏ هات فقد بلغت محلها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1447,
			"arabicnumber": 1447,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عمرو بن يحيى المازني، عن أبيه، قال سمعت أبا سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس فيما دون خمس ذود صدقة من الإبل، وليس فيما دون خمس أواق صدقة، وليس فيما دون خمسة أوسق صدقة ‏\"‏‏.‏ حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال حدثني يحيى بن سعيد، قال أخبرني عمرو، سمع أباه، عن أبي سعيد ـ رضى الله عنه ـ سمعت النبي صلى الله عليه وسلم بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1448,
			"arabicnumber": 1448,
			"text": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا ـ رضى الله عنه ـ حدثه أن أبا بكر ـ رضى الله عنه ـ كتب له التي أمر الله رسوله صلى الله عليه وسلم ‏ \"‏ ومن بلغت صدقته بنت مخاض وليست عنده وعنده بنت لبون فإنها تقبل منه، ويعطيه المصدق عشرين درهما أو شاتين، فإن لم يكن عنده بنت مخاض على وجهها، وعنده ابن لبون فإنه يقبل منه وليس معه شىء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1449,
			"arabicnumber": 1449,
			"text": "حدثنا مؤمل، حدثنا إسماعيل، عن أيوب، عن عطاء بن أبي رباح، قال قال ابن عباس ـ رضى الله عنهما ـ أشهد على رسول الله صلى الله عليه وسلم لصلى قبل الخطبة، فرأى أنه لم يسمع النساء، فأتاهن ومعه بلال ناشر ثوبه فوعظهن، وأمرهن أن يتصدقن، فجعلت المرأة تلقي، وأشار أيوب إلى أذنه وإلى حلقه‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1450,
			"arabicnumber": 1450,
			"text": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي قال، حدثني ثمامة، أن أنسا ـ رضى الله عنه ـ حدثه أن أبا بكر ـ رضى الله عنه ـ كتب له التي فرض رسول الله صلى الله عليه وسلم ‏ \"‏ ولا يجمع بين متفرق، ولا يفرق بين مجتمع، خشية الصدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1451,
			"arabicnumber": 1451,
			"text": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا، حدثه أن أبا بكر ـ رضى الله عنه ـ كتب له التي فرض رسول الله صلى الله عليه وسلم ‏ \"‏ وما كان من خليطين فإنهما يتراجعان بينهما بالسوية ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1452,
			"arabicnumber": 1452,
			"text": "حدثنا علي بن عبد الله، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، قال حدثني ابن شهاب، عن عطاء بن يزيد، عن أبي سعيد الخدري ـ رضى الله عنه ـ أن أعرابيا سأل رسول الله صلى الله عليه وسلم عن الهجرة فقال ‏\"‏ ويحك، إن شأنها شديد، فهل لك من إبل تؤدي صدقتها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فاعمل من وراء البحار فإن الله لن يترك من عملك شيئا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1453,
			"arabicnumber": 1453,
			"text": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا ـ رضى الله عنه ـ حدثه أن أبا بكر ـ رضى الله عنه ـ كتب له فريضة الصدقة التي أمر الله رسوله صلى الله عليه وسلم ‏ \"‏ من بلغت عنده من الإبل صدقة الجذعة، وليست عنده جذعة وعنده حقة، فإنها تقبل منه الحقة ويجعل معها شاتين إن استيسرتا له أو عشرين درهما، ومن بلغت عنده صدقة الحقة وليست عنده الحقة وعنده الجذعة، فإنها تقبل منه الجذعة، ويعطيه المصدق عشرين درهما أو شاتين، ومن بلغت عنده صدقة الحقة وليست عنده إلا بنت لبون فإنها تقبل منه بنت لبون، ويعطي شاتين أو عشرين درهما، ومن بلغت صدقته بنت لبون وعنده حقة فإنها تقبل منه الحقة ويعطيه المصدق عشرين درهما أو شاتين، ومن بلغت صدقته بنت لبون وليست عنده وعنده بنت مخاض، فإنها تقبل منه بنت مخاض ويعطي معها عشرين درهما أو شاتين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1454,
			"arabicnumber": 1454,
			"text": "حدثنا محمد بن عبد الله بن المثنى الأنصاري، قال حدثني أبي قال، حدثني ثمامة بن عبد الله بن أنس، أن أنسا، حدثه أن أبا بكر ـ رضى الله عنه ـ كتب له هذا الكتاب لما وجهه إلى البحرين بسم الله الرحمن الرحيم ‏ \"‏ هذه فريضة الصدقة التي فرض رسول الله صلى الله عليه وسلم على المسلمين، والتي أمر الله بها رسوله، فمن سئلها من المسلمين على وجهها فليعطها، ومن سئل فوقها فلا يعط في أربع وعشرين من الإبل فما دونها من الغنم من كل خمس شاة، إذا بلغت خمسا وعشرين إلى خمس وثلاثين ففيها بنت مخاض أنثى، فإذا بلغت ستا وثلاثين إلى خمس وأربعين ففيها بنت لبون أنثى، فإذا بلغت ستا وأربعين إلى ستين ففيها حقة طروقة الجمل، فإذا بلغت واحدة وستين إلى خمس وسبعين ففيها جذعة، فإذا بلغت ـ يعني ـ ستا وسبعين إلى تسعين ففيها بنتا لبون، فإذا بلغت إحدى وتسعين إلى عشرين ومائة ففيها حقتان طروقتا الجمل، فإذا زادت على عشرين ومائة ففي كل أربعين بنت لبون، وفي كل خمسين حقة، ومن لم يكن معه إلا أربع من الإبل فليس فيها صدقة، إلا أن يشاء ربها، فإذا بلغت خمسا من الإبل ففيها شاة، وفي صدقة الغنم في سائمتها إذا كانت أربعين إلى عشرين ومائة شاة، فإذا زادت على عشرين ومائة إلى مائتين شاتان، فإذا زادت على مائتين إلى ثلاثمائة ففيها ثلاث، فإذا زادت على ثلاثمائة ففي كل مائة شاة، فإذا كانت سائمة الرجل ناقصة من أربعين شاة واحدة فليس فيها صدقة، إلا أن يشاء ربها، وفي الرقة ربع العشر، فإن لم تكن إلا تسعين ومائة فليس فيها شىء، إلا أن يشاء ربها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1455,
			"arabicnumber": 1455,
			"text": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا ـ رضى الله عنه ـ حدثه أن أبا بكر ـ رضى الله عنه ـ كتب له ‏{‏الصدقة‏}‏ التي أمر الله رسوله صلى الله عليه وسلم ‏ \"‏ ولا يخرج في الصدقة هرمة، ولا ذات عوار، ولا تيس، إلا ما شاء المصدق ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1457,
			"arabicnumber": 1457,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1458,
			"arabicnumber": 1458,
			"text": "حدثنا أمية بن بسطام، حدثنا يزيد بن زريع، حدثنا روح بن القاسم، عن إسماعيل بن أمية، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس ـ رضى الله عنهما أن رسول الله صلى الله عليه وسلم لما بعث معاذا ـ رضى الله عنه ـ على اليمن قال ‏ \"‏ إنك تقدم على قوم أهل كتاب، فليكن أول ما تدعوهم إليه عبادة الله، فإذا عرفوا الله فأخبرهم أن الله قد فرض عليهم خمس صلوات في يومهم وليلتهم، فإذا فعلوا، فأخبرهم أن الله فرض عليهم زكاة ‏{‏تؤخذ‏}‏ من أموالهم وترد على فقرائهم، فإذا أطاعوا بها فخذ منهم، وتوق كرائم أموال الناس ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1459,
			"arabicnumber": 1459,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن عبد الرحمن بن أبي صعصعة المازني، عن أبيه، عن أبي سعيد الخدري ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ليس فيما دون خمسة أوسق من التمر صدقة، وليس فيما دون خمس أواق من الورق صدقة، وليس فيما دون خمس ذود من الإبل صدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1460,
			"arabicnumber": 1460,
			"text": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، عن المعرور بن سويد، عن أبي ذر ـ رضى الله عنه ـ قال انتهيت إلى النبي صلى الله عليه وسلم قال ‏ \"‏ والذي نفسي بيده ـ أو والذي لا إله غيره، أو كما حلف ـ ما من رجل تكون له إبل أو بقر أو غنم لا يؤدي حقها إلا أتي بها يوم القيامة أعظم ما تكون وأسمنه، تطؤه بأخفافها، وتنطحه بقرونها، كلما جازت أخراها ردت عليه أولاها، حتى يقضى بين الناس ‏\"‏‏.‏ رواه بكير عن أبي صالح عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1461,
			"arabicnumber": 1461,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك ـ رضى الله عنه ـ يقول كان أبو طلحة أكثر الأنصار بالمدينة مالا من نخل، وكان أحب أمواله إليه بيرحاء وكانت مستقبلة المسجد، وكان رسول الله صلى الله عليه وسلم يدخلها ويشرب من ماء فيها طيب قال أنس فلما أنزلت هذه الآية ‏{‏لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ قام أبو طلحة إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله‏.‏ إن الله تبارك وتعالى يقول ‏{‏لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ وإن أحب أموالي إلى بيرحاء، وإنها صدقة لله أرجو برها وذخرها عند الله، فضعها يا رسول الله حيث أراك الله‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ بخ، ذلك مال رابح، ذلك مال رابح، وقد سمعت ما قلت وإني أرى أن تجعلها في الأقربين ‏\"‏‏.‏ فقال أبو طلحة أفعل يا رسول الله‏.‏ فقسمها أبو طلحة في أقاربه وبني عمه‏.‏ تابعه روح‏.‏ وقال يحيى بن يحيى وإسماعيل عن مالك رايح‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1462,
			"arabicnumber": 1462,
			"text": "حدثنا ابن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد، عن عياض بن عبد الله، عن أبي سعيد الخدري ـ رضى الله عنه ـ خرج رسول الله صلى الله عليه وسلم في أضحى أو فطر إلى المصلى ثم انصرف فوعظ الناس وأمرهم بالصدقة فقال ‏\"‏ أيها الناس تصدقوا ‏\"‏‏.‏ فمر على النساء فقال ‏\"‏ يا معشر النساء تصدقن، فإني رأيتكن أكثر أهل النار ‏\"‏‏.‏ فقلن وبم ذلك يا رسول الله قال ‏\"‏ تكثرن اللعن وتكفرن العشير، ما رأيت من ناقصات عقل ودين أذهب للب الرجل الحازم من إحداكن يا معشر النساء ‏\"‏‏.‏ ثم انصرف فلما صار إلى منزله جاءت زينب امرأة ابن مسعود تستأذن عليه فقيل يا رسول الله هذه زينب فقال ‏\"‏ أى الزيانب ‏\"‏‏.‏ فقيل امرأة ابن مسعود‏.‏ قال ‏\"‏ نعم ائذنوا لها ‏\"‏‏.‏ فأذن لها قالت يا نبي الله إنك أمرت اليوم بالصدقة، وكان عندي حلي لي، فأردت أن أتصدق به، فزعم ابن مسعود أنه وولده أحق من تصدقت به عليهم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ابن مسعود، زوجك وولدك أحق من تصدقت به عليهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1463,
			"arabicnumber": 1463,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا عبد الله بن دينار، قال سمعت سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ ليس على المسلم في فرسه وغلامه صدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1464,
			"arabicnumber": 1464,
			"text": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن خثيم بن عراك، قال حدثني أبي، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم‏.‏ حدثنا سليمان بن حرب، حدثنا وهيب بن خالد، حدثنا خثيم بن عراك بن مالك، عن أبيه، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس على المسلم صدقة في عبده ولا في فرسه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"text": "حدثنا معاذ بن فضالة، حدثنا هشام، عن يحيى، عن هلال بن أبي ميمونة، حدثنا عطاء بن يسار، أنه سمع أبا سعيد الخدري ـ رضى الله عنه ـ يحدث أن النبي صلى الله عليه وسلم جلس ذات يوم على المنبر وجلسنا حوله فقال ‏\"‏ إني مما أخاف عليكم من بعدي ما يفتح عليكم من زهرة الدنيا وزينتها ‏\"‏‏.‏ فقال رجل يا رسول الله أويأتي الخير بالشر فسكت النبي صلى الله عليه وسلم فقيل له ما شأنك تكلم النبي صلى الله عليه وسلم ولا يكلمك فرأينا أنه ينزل عليه‏.‏ قال ـ فمسح عنه الرحضاء فقال ‏\"‏ أين السائل ‏\"‏ وكأنه حمده‏.‏ فقال ‏\"‏ إنه لا يأتي الخير بالشر، وإن مما ينبت الربيع يقتل أو يلم إلا آكلة الخضراء، أكلت حتى إذا امتدت خاصرتاها استقبلت عين الشمس، فثلطت وبالت ورتعت، وإن هذا المال خضرة حلوة، فنعم صاحب المسلم ما أعطى منه المسكين واليتيم وابن السبيل ـ أو كما قال النبي صلى الله عليه وسلم ـ وإنه من يأخذه بغير حقه كالذي يأكل ولا يشبع، ويكون شهيدا عليه يوم القيامة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": 1466,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني شقيق، عن عمرو بن الحارث، عن زينب، امرأة عبد الله ـ رضى الله عنهما ـ قال فذكرته لإبراهيم فحدثني إبراهيم عن أبي عبيدة عن عمرو بن الحارث عن زينب امرأة عبد الله بمثله سواء، قالت كنت في المسجد فرأيت النبي صلى الله عليه وسلم فقال ‏\"‏ تصدقن ولو من حليكن ‏\"‏‏.‏ وكانت زينب تنفق على عبد الله وأيتام في حجرها، قال فقالت لعبد الله سل رسول الله صلى الله عليه وسلم أيجزي عني أن أنفق عليك وعلى أيتامي في حجري من الصدقة فقال سلي أنت رسول الله صلى الله عليه وسلم‏.‏ فانطلقت إلى النبي صلى الله عليه وسلم‏.‏ فوجدت امرأة من الأنصار على الباب، حاجتها مثل حاجتي، فمر علينا بلال فقلنا سل النبي صلى الله عليه وسلم أيجزي عني أن أنفق على زوجي وأيتام لي في حجري وقلنا لا تخبر بنا‏.‏ فدخل فسأله فقال ‏\"‏ من هما ‏\"‏‏.‏ قال زينب قال ‏\"‏ أى الزيانب ‏\"‏‏.‏ قال امرأة عبد الله‏.‏ قال ‏\"‏ نعم لها أجران أجر القرابة وأجر الصدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": 1467,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام، عن أبيه، عن زينب ابنة أم سلمة، ‏{‏عن أم سلمة،‏}‏ قالت قلت يا رسول الله ألي أجر أن أنفق على بني أبي سلمة إنما هم بني‏.‏ فقال ‏ \"‏ أنفقي عليهم، فلك أجر ما أنفقت عليهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": 1468,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ قال أمر رسول الله صلى الله عليه وسلم بالصدقة فقيل منع ابن جميل وخالد بن الوليد وعباس بن عبد المطلب‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ ما ينقم ابن جميل إلا أنه كان فقيرا فأغناه الله ورسوله، وأما خالد فإنكم تظلمون خالدا، قد احتبس أدراعه وأعتده في سبيل الله، وأما العباس بن عبد المطلب فعم رسول الله صلى الله عليه وسلم فهى عليه صدقة ومثلها معها ‏\"‏‏.‏ تابعه ابن أبي الزناد عن أبيه‏.‏ وقال ابن إسحاق عن أبي الزناد هي عليه ومثلها معها‏.‏ وقال ابن جريج حدثت عن الأعرج بمثله‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": 1469,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عطاء بن يزيد الليثي، عن أبي سعيد الخدري ـ رضى الله عنه ـ أن ناسا من الأنصار سألوا رسول الله صلى الله عليه وسلم فأعطاهم، ثم سألوه فأعطاهم، حتى نفد ما عنده فقال ‏ \"‏ ما يكون عندي من خير فلن أدخره عنكم، ومن يستعفف يعفه الله، ومن يستغن يغنه الله، ومن يتصبر يصبره الله، وما أعطي أحد عطاء خيرا وأوسع من الصبر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": 1470,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ والذي نفسي بيده لأن يأخذ أحدكم حبله فيحتطب على ظهره خير له من أن يأتي رجلا، فيسأله، أعطاه أو منعه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": 1471,
			"text": "حدثنا موسى، حدثنا وهيب، حدثنا هشام، عن أبيه، عن الزبير بن العوام ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ لأن يأخذ أحدكم حبله فيأتي بحزمة الحطب على ظهره فيبيعها فيكف الله بها وجهه، خير له من أن يسأل الناس أعطوه أو منعوه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": 1472,
			"text": "وحدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، عن عروة بن الزبير، وسعيد بن المسيب، أن حكيم بن حزام ـ رضى الله عنه ـ قال سألت رسول الله صلى الله عليه وسلم فأعطاني، ثم سألته فأعطاني، ثم سألته فأعطاني ثم قال ‏ \"‏ يا حكيم إن هذا المال خضرة حلوة، فمن أخذه بسخاوة نفس بورك له فيه، ومن أخذه بإشراف نفس لم يبارك له فيه كالذي يأكل ولا يشبع، اليد العليا خير من اليد السفلى ‏\"‏‏.‏ قال حكيم فقلت يا رسول الله والذي بعثك بالحق لا أرزأ أحدا بعدك شيئا حتى أفارق الدنيا، فكان أبو بكر ـ رضى الله عنه ـ يدعو حكيما إلى العطاء فيأبى أن يقبله منه، ثم إن عمر ـ رضى الله عنه ـ دعاه ليعطيه فأبى أن يقبل منه شيئا‏.‏ فقال عمر إني أشهدكم يا معشر المسلمين على حكيم، أني أعرض عليه حقه من هذا الفىء فيأبى أن يأخذه‏.‏ فلم يرزأ حكيم أحدا من الناس بعد رسول الله صلى الله عليه وسلم حتى توفي‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": 1473,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن يونس، عن الزهري، عن سالم، أن عبد الله بن عمر ـ رضى الله عنهما ـ قال سمعت عمر، يقول كان رسول الله صلى الله عليه وسلم يعطيني العطاء فأقول أعطه من هو أفقر إليه مني فقال ‏ \"‏ خذه، إذا جاءك من هذا المال شىء، وأنت غير مشرف ولا سائل، فخذه، وما لا فلا تتبعه نفسك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": 1475,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": 1476,
			"text": "حدثنا حجاج بن منهال، حدثنا شعبة، أخبرني محمد بن زياد، قال سمعت أبا هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس المسكين الذي ترده الأكلة والأكلتان، ولكن المسكين الذي ليس له غنى ويستحيي أو لا يسأل الناس إلحافا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": 1477,
			"text": "حدثنا يعقوب بن إبراهيم، حدثنا إسماعيل ابن علية، حدثنا خالد الحذاء، عن ابن أشوع، عن الشعبي، حدثني كاتب المغيرة بن شعبة، قال كتب معاوية إلى المغيرة بن شعبة أن اكتب، إلى بشىء سمعته من النبي، صلى الله عليه وسلم‏.‏ فكتب إليه سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ إن الله كره لكم ثلاثا قيل وقال، وإضاعة المال، وكثرة السؤال ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": 1478,
			"text": "حدثنا محمد بن غرير الزهري، حدثنا يعقوب بن إبراهيم، عن أبيه، عن صالح بن كيسان، عن ابن شهاب، قال أخبرني عامر بن سعد، عن أبيه، قال أعطى رسول الله صلى الله عليه وسلم رهطا وأنا جالس فيهم قال فترك رسول الله صلى الله عليه وسلم منهم رجلا لم يعطه، وهو أعجبهم إلى، فقمت إلى رسول الله صلى الله عليه وسلم فساررته فقلت ما لك عن فلان والله إني لأراه مؤمنا‏.‏ قال ‏\"‏ أو مسلما ‏\"‏ قال فسكت قليلا ثم غلبني ما أعلم فيه فقلت يا رسول الله‏.‏ ما لك عن فلان والله إني لأراه مؤمنا‏.‏ قال ‏\"‏ أو مسلما ‏\"‏‏.‏ قال فسكت قليلا ثم غلبني ما أعلم فيه فقلت يا رسول الله ما لك عن فلان والله إني لأراه مؤمنا‏.‏ قال ‏\"‏ أو مسلما ـ يعني فقال ـ إني لأعطي الرجل وغيره أحب إلى منه، خشية أن يكب في النار على وجهه ‏\"‏‏.‏ وعن أبيه عن صالح عن إسماعيل بن محمد أنه قال سمعت أبي يحدث هذا فقال في حديثه فضرب رسول الله صلى الله عليه وسلم بيده فجمع بين عنقي وكتفي ثم قال ‏\"‏ أقبل أى سعد إني لأعطي الرجل ‏\"‏‏.‏ قال أبو عبد الله ‏{‏فكبكبوا‏}‏ قلبوا ‏{‏مكبا‏}‏ أكب الرجل إذا كان فعله غير واقع على أحد، فإذا وقع الفعل قلت كبه الله لوجهه، وكببته أنا‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": 1479,
			"text": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ليس المسكين الذي يطوف على الناس ترده اللقمة واللقمتان والتمرة والتمرتان، ولكن المسكين الذي لا يجد غنى يغنيه، ولا يفطن به فيتصدق عليه، ولا يقوم فيسأل الناس ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": 1480,
			"text": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لأن يأخذ أحدكم حبله، ثم يغدو ـ أحسبه قال ـ إلى الجبل فيحتطب، فيبيع فيأكل ويتصدق خير له من أن يسأل الناس ‏\"‏‏.‏ قال أبو عبد الله صالح بن كيسان أكبر من الزهري، وهو قد أدرك ابن عمر‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": 1482,
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": 1483,
			"text": "حدثنا سعيد بن أبي مريم، حدثنا عبد الله بن وهب، قال أخبرني يونس بن يزيد، عن الزهري، عن سالم بن عبد الله، عن أبيه ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ فيما سقت السماء والعيون أو كان عثريا العشر، وما سقي بالنضح نصف العشر ‏\"‏‏.‏ قال أبو عبد الله هذا تفسير الأول لأنه لم يوقت في الأول ـ يعني حديث ابن عمر ـ وفيما سقت السماء العشر وبين في هذا ووقت، والزيادة مقبولة، والمفسر يقضي على المبهم إذا رواه أهل الثبت، كما روى الفضل بن عباس أن النبي صلى الله عليه وسلم لم يصل في الكعبة‏.‏ وقال بلال قد صلى‏.‏ فأخذ بقول بلال وترك قول الفضل‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "حدثنا مسدد، حدثنا يحيى، حدثنا مالك، قال حدثني محمد بن عبد الله بن عبد الرحمن بن أبي صعصعة، عن أبيه، عن أبي سعيد الخدري ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس فيما أقل من خمسة أوسق صدقة، ولا في أقل من خمسة من الإبل الذود صدقة، ولا في أقل من خمس أواق من الورق صدقة ‏\"‏‏.‏ قال أبو عبد الله هذا تفسير الأول إذا قال ‏\"‏ ليس فيما دون خمسة أوسق صدقة ‏\"‏‏.‏ ويؤخذ أبدا في العلم بما زاد أهل الثبت أو بينوا‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": 1485,
			"text": "حدثنا عمر بن محمد بن الحسن الأسدي، حدثنا أبي، حدثنا إبراهيم بن طهمان، عن محمد بن زياد، عن أبي هريرة ـ رضى الله عنه ـ قال كان رسول الله صلى الله عليه وسلم يؤتى بالتمر عند صرام النخل فيجيء هذا بتمره وهذا من تمره حتى يصير عنده كوما من تمر، فجعل الحسن والحسين ـ رضى الله عنهما ـ يلعبان بذلك التمر، فأخذ أحدهما تمرة، فجعلها في فيه، فنظر إليه رسول الله صلى الله عليه وسلم فأخرجها من فيه فقال ‏ \"‏ أما علمت أن آل محمد صلى الله عليه وسلم لا يأكلون الصدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": 1486,
			"text": "حدثنا حجاج، حدثنا شعبة، أخبرني عبد الله بن دينار، سمعت ابن عمر ـ رضى الله عنهما ـ نهى النبي صلى الله عليه وسلم عن بيع الثمرة حتى يبدو صلاحها‏.‏ وكان إذا سئل عن صلاحها قال حتى تذهب عاهته‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": 1487,
			"text": "حدثنا عبد الله بن يوسف، حدثني الليث، حدثني خالد بن يزيد، عن عطاء بن أبي رباح، عن جابر بن عبد الله ـ رضى الله عنهما ـ‏.‏ نهى النبي صلى الله عليه وسلم عن بيع الثمار حتى يبدو صلاحها‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": 1488,
			"text": "حدثنا قتيبة، عن مالك، عن حميد، عن أنس بن مالك ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمار حتى تزهي، قال حتى تحمار‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1489,
			"arabicnumber": 1489,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن سالم، أن عبد الله بن عمر ـ رضى الله عنهما ـ كان يحدث أن عمر بن الخطاب تصدق بفرس في سبيل الله فوجده يباع، فأراد أن يشتريه، ثم أتى النبي صلى الله عليه وسلم فاستأمره فقال ‏ \"‏ لا تعد في صدقتك ‏\"‏ فبذلك كان ابن عمر ـ رضى الله عنهما ـ لا يترك أن يبتاع شيئا تصدق به إلا جعله صدقة‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1490,
			"arabicnumber": 1490,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك بن أنس، عن زيد بن أسلم، عن أبيه، قال سمعت عمر ـ رضى الله عنه ـ يقول حملت على فرس في سبيل الله، فأضاعه الذي كان عنده، فأردت أن أشتريه، وظننت أنه يبيعه برخص، فسألت النبي صلى الله عليه وسلم فقال ‏ \"‏ لا تشتر ولا تعد في صدقتك، وإن أعطاكه بدرهم، فإن العائد في صدقته كالعائد في قيئه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1491,
			"arabicnumber": 1491,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا محمد بن زياد، قال سمعت أبا هريرة ـ رضى الله عنه ـ قال أخذ الحسن بن علي ـ رضى الله عنهما ـ تمرة من تمر الصدقة، فجعلها في فيه، فقال النبي صلى الله عليه وسلم ‏ \"‏ كخ كخ ـ ليطرحها ثم قال ـ أما شعرت أنا لا نأكل الصدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1492,
			"arabicnumber": 1492,
			"text": "حدثنا سعيد بن عفير، حدثنا ابن وهب، عن يونس، عن ابن شهاب، حدثني عبيد الله بن عبد الله، عن ابن عباس ـ رضى الله عنهما ـ قال وجد النبي صلى الله عليه وسلم شاة ميتة أعطيتها مولاة لميمونة من الصدقة، قال النبي صلى الله عليه وسلم ‏\"‏ هلا انتفعتم بجلدها ‏\"‏‏.‏ قالوا إنها ميتة‏.‏ قال ‏\"‏ إنما حرم أكلها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1493,
			"arabicnumber": 1493,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا الحكم، عن إبراهيم، عن الأسود، عن عائشة ـ رضى الله عنها ـ أنها أرادت أن تشتري بريرة للعتق، وأراد مواليها أن يشترطوا ولاءها، فذكرت عائشة للنبي صلى الله عليه وسلم فقال لها النبي صلى الله عليه وسلم ‏\"‏ اشتريها، فإنما الولاء لمن أعتق ‏\"‏‏.‏ قالت وأتي النبي صلى الله عليه وسلم بلحم فقلت هذا ما تصدق به على بريرة فقال ‏\"‏ هو لها صدقة، ولنا هدية ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1494,
			"arabicnumber": 1494,
			"text": "حدثنا علي بن عبد الله، حدثنا يزيد بن زريع، حدثنا خالد، عن حفصة بنت سيرين، عن أم عطية الأنصارية ـ رضى الله عنها ـ قالت دخل النبي صلى الله عليه وسلم على عائشة ـ رضى الله عنها ـ فقال ‏\"‏ هل عندكم شىء ‏\"‏‏.‏ فقالت لا‏.‏ إلا شىء بعثت به إلينا نسيبة من الشاة التي بعثت بها من الصدقة‏.‏ فقال ‏\"‏ إنها قد بلغت محلها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1495,
			"arabicnumber": 1495,
			"text": "حدثنا يحيى بن موسى، حدثنا وكيع، حدثنا شعبة، عن قتادة، عن أنس ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم أتي بلحم تصدق به على بريرة فقال ‏ \"‏ هو عليها صدقة، وهو لنا هدية ‏\"‏‏.‏ وقال أبو داود أنبأنا شعبة، عن قتادة، سمع أنسا، عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1496,
			"arabicnumber": 1496,
			"text": "حدثنا محمد، أخبرنا عبد الله، أخبرنا زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، مولى ابن عباس عن ابن عباس ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم لمعاذ بن جبل حين بعثه إلى اليمن ‏ \"‏ إنك ستأتي قوما أهل كتاب، فإذا جئتهم فادعهم إلى أن يشهدوا أن لا إله إلا الله وأن محمدا رسول الله، فإن هم أطاعوا لك بذلك، فأخبرهم أن الله قد فرض عليهم خمس صلوات في كل يوم وليلة، فإن هم أطاعوا لك بذلك فأخبرهم أن الله قد فرض عليهم صدقة تؤخذ من أغنيائهم فترد على فقرائهم، فإن هم أطاعوا لك بذلك فإياك وكرائم أموالهم، واتق دعوة المظلوم، فإنه ليس بينه وبين الله حجاب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1497,
			"arabicnumber": 1497,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، عن عمرو، عن عبد الله بن أبي أوفى، قال كان النبي صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال ‏\"‏ اللهم صل على آل فلان ‏\"‏‏.‏ فأتاه أبي بصدقته، فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1498,
			"arabicnumber": 1498,
			"text": "وقال الليث حدثني جعفر بن ربيعة، عن عبد الرحمن بن هرمز، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم ‏ \"‏ أن رجلا من بني إسرائيل سأل بعض بني إسرائيل بأن يسلفه ألف دينار، فدفعها إليه، فخرج في البحر، فلم يجد مركبا، فأخذ خشبة فنقرها فأدخل فيها ألف دينار، فرمى بها في البحر، فخرج الرجل الذي كان أسلفه، فإذا بالخشبة فأخذها لأهله حطبا ـ فذكر الحديث ـ فلما نشرها وجد المال ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1499,
			"arabicnumber": 1499,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن سعيد بن المسيب، وعن أبي سلمة بن عبد الرحمن، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ العجماء جبار، والبئر جبار، والمعدن جبار، وفي الركاز الخمس ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1500,
			"arabicnumber": 1500,
			"text": "حدثنا يوسف بن موسى، حدثنا أبو أسامة، أخبرنا هشام بن عروة، عن أبيه، عن أبي حميد الساعدي ـ رضى الله عنه ـ قال استعمل رسول الله صلى الله عليه وسلم رجلا من الأسد على صدقات بني سليم يدعى ابن اللتبية، فلما جاء حاسبه‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": 1501,
			"text": "حدثنا مسدد، حدثنا يحيى، عن شعبة، حدثنا قتادة، عن أنس ـ رضى الله عنه ـ أن ناسا، من عرينة اجتووا المدينة، فرخص لهم رسول الله صلى الله عليه وسلم أن يأتوا إبل الصدقة فيشربوا من ألبانها وأبوالها، فقتلوا الراعي واستاقوا الذود، فأرسل رسول الله صلى الله عليه وسلم فأتي بهم، فقطع أيديهم وأرجلهم وسمر أعينهم، وتركهم بالحرة يعضون الحجارة‏.‏ تابعه أبو قلابة وحميد وثابت عن أنس‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": 1502,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا الوليد، حدثنا أبو عمرو الأوزاعي، حدثني إسحاق بن عبد الله بن أبي طلحة، حدثني أنس بن مالك ـ رضى الله عنه ـ قال غدوت إلى رسول الله صلى الله عليه وسلم بعبد الله بن أبي طلحة ليحنكه، فوافيته في يده الميسم يسم إبل الصدقة‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": 1503,
			"text": "حدثنا يحيى بن محمد بن السكن، حدثنا محمد بن جهضم، حدثنا إسماعيل بن جعفر، عن عمر بن نافع، عن أبيه، عن ابن عمر ـ رضى الله عنهما ـ قال فرض رسول الله صلى الله عليه وسلم زكاة الفطر صاعا من تمر، أو صاعا من شعير على العبد والحر، والذكر والأنثى، والصغير والكبير من المسلمين، وأمر بها أن تؤدى قبل خروج الناس إلى الصلاة‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": 1504,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم فرض زكاة الفطر صاعا من تمر، أو صاعا من شعير، على كل حر أو عبد، ذكر أو أنثى، من المسلمين‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": 1505,
			"text": "حدثنا قبيصة، حدثنا سفيان، عن زيد بن أسلم، عن عياض بن عبد الله، عن أبي سعيد ـ رضى الله عنه ـ قال كنا نطعم الصدقة صاعا من شعير‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": 1506,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن زيد بن أسلم، عن عياض بن عبد الله بن سعد بن أبي سرح العامري، أنه سمع أبا سعيد الخدري ـ رضى الله عنه ـ يقول كنا نخرج زكاة الفطر صاعا من طعام، أو صاعا من شعير، أو صاعا من تمر، أو صاعا من أقط، أو صاعا من زبيب‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": 1507,
			"text": "حدثنا أحمد بن يونس، حدثنا الليث، عن نافع، أن عبد الله، قال أمر النبي صلى الله عليه وسلم بزكاة الفطر، صاعا من تمر، أو صاعا من شعير‏.‏ قال عبد الله ـ رضى الله عنه ـ فجعل الناس عدله مدين من حنطة‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": 1508,
			"text": "حدثنا عبد الله بن منير، سمع يزيد العدني، حدثنا سفيان، عن زيد بن أسلم، قال حدثني عياض بن عبد الله بن أبي سرح، عن أبي سعيد الخدري ـ رضى الله عنه ـ قال كنا نعطيها في زمان النبي صلى الله عليه وسلم صاعا من طعام، أو صاعا من تمر، أو صاعا من شعير، أو صاعا من زبيب، فلما جاء معاوية وجاءت السمراء قال أرى مدا من هذا يعدل مدين‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": 1509,
			"text": "حدثنا آدم، حدثنا حفص بن ميسرة، حدثنا موسى بن عقبة، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم أمر بزكاة الفطر قبل خروج الناس إلى الصلاة‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": 1510,
			"text": "حدثنا معاذ بن فضالة، حدثنا أبو عمر، عن زيد، عن عياض بن عبد الله بن سعد، عن أبي سعيد الخدري ـ رضى الله عنه ـ قال كنا نخرج في عهد رسول الله صلى الله عليه وسلم يوم الفطر صاعا من طعام‏.‏ وقال أبو سعيد وكان طعامنا الشعير والزبيب والأقط والتمر‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": 1511,
			"text": "حدثنا أبو النعمان، حدثنا حماد بن زيد، حدثنا أيوب، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال فرض النبي صلى الله عليه وسلم صدقة الفطر ـ أو قال رمضان ـ على الذكر والأنثى، والحر والمملوك، صاعا من تمر أو صاعا من شعير، فعدل الناس به نصف صاع من بر‏.‏ فكان ابن عمر ـ رضى الله عنهما ـ يعطي التمر، فأعوز أهل المدينة من التمر فأعطى شعيرا، فكان ابن عمر يعطي عن الصغير والكبير، حتى إن كان يعطي عن بني، وكان ابن عمر ـ رضى الله عنهما ـ يعطيها الذين يقبلونها، وكانوا يعطون قبل الفطر بيوم أو يومين‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": 1512,
			"text": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، قال حدثني نافع، عن ابن عمر ـ رضى الله عنه ـ قال فرض رسول الله صلى الله عليه وسلم صدقة الفطر صاعا من شعير، أو صاعا من تمر على الصغير والكبير والحر والمملوك‏.‏",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 112
			}
		}
	]
}