{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1513,
			"arabicnumber": 1513,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن سليمان بن يسار، عن عبد الله بن عباس ـ رضى الله عنهما ـ قال كان الفضل رديف رسول الله صلى الله عليه وسلم فجاءت امرأة من خثعم، فجعل الفضل ينظر إليها وتنظر إليه، وجعل النبي صلى الله عليه وسلم يصرف وجه الفضل إلى الشق الآخر فقالت يا رسول الله إن فريضة الله على عباده في الحج أدركت أبي شيخا كبيرا، لا يثبت على الراحلة، أفأحج عنه قال ‏ \"‏ نعم ‏\"‏‏.‏ وذلك في حجة الوداع‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": 1514,
			"text": "حدثنا أحمد بن عيسى، حدثنا ابن وهب، عن يونس، عن ابن شهاب، أن سالم بن عبد الله، أخبره أن ابن عمر ـ رضى الله عنهما ـ قال رأيت رسول الله صلى الله عليه وسلم يركب راحلته بذي الحليفة ثم يهل حتى تستوي به قائمة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": 1515,
			"text": "حدثنا إبراهيم، أخبرنا الوليد، حدثنا الأوزاعي، سمع عطاء، يحدث عن جابر بن عبد الله ـ رضى الله عنهما ـ أن إهلال رسول الله صلى الله عليه وسلم من ذي الحليفة حين استوت به راحلته‏.‏ رواه أنس وابن عباس رضى الله عنهم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": 1516,
			"text": "وقال أبان حدثنا مالك بن دينار، عن القاسم بن محمد، عن عائشة، رضى الله عنها أن النبي صلى الله عليه وسلم بعث معها أخاها عبد الرحمن، فأعمرها من التنعيم، وحملها على قتب‏.‏ وقال عمر ـ رضى الله عنه ـ شدوا الرحال في الحج، فإنه أحد الجهادين‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": 1517,
			"text": "وحدثنا محمد بن أبي بكر، حدثنا يزيد بن زريع، حدثنا عزرة بن ثابت، عن ثمامة بن عبد الله بن أنس، قال حج أنس على رحل، ولم يكن شحيحا، وحدث أن رسول الله صلى الله عليه وسلم حج على رحل وكانت زاملته‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": 1518,
			"text": "حدثنا عمرو بن علي، حدثنا أبو عاصم، حدثنا أيمن بن نابل، حدثنا القاسم بن محمد، عن عائشة ـ رضى الله عنها ـ أنها قالت يا رسول الله، اعتمرتم ولم أعتمر‏.‏ فقال ‏ \"‏ يا عبد الرحمن اذهب بأختك فأعمرها من التنعيم ‏\"‏‏.‏ فأحقبها على ناقة فاعتمرت‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1519,
			"arabicnumber": 1519,
			"text": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة ـ رضى الله عنه ـ قال سئل النبي صلى الله عليه وسلم أى الأعمال أفضل قال ‏\"‏ إيمان بالله ورسوله ‏\"‏‏.‏ قيل ثم ماذا قال ‏\"‏ جهاد في سبيل الله ‏\"‏‏.‏ قيل ثم ماذا قال ‏\"‏ حج مبرور ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": 1520,
			"text": "حدثنا عبد الرحمن بن المبارك، حدثنا خالد، أخبرنا حبيب بن أبي عمرة، عن عائشة بنت طلحة، عن عائشة أم المؤمنين ـ رضى الله عنها ـ أنها قالت يا رسول الله، نرى الجهاد أفضل العمل، أفلا نجاهد قال ‏ \"‏ لا، لكن أفضل الجهاد حج مبرور ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": 1521,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا سيار أبو الحكم، قال سمعت أبا حازم، قال سمعت أبا هريرة ـ رضى الله عنه ـ قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ من حج لله فلم يرفث ولم يفسق رجع كيوم ولدته أمه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": 1522,
			"text": "حدثنا مالك بن إسماعيل، حدثنا زهير، قال حدثني زيد بن جبير، أنه أتى عبد الله بن عمر ـ رضى الله عنهما ـ في منزله وله فسطاط وسرادق، فسألته من أين يجوز أن أعتمر قال فرضها رسول الله صلى الله عليه وسلم لأهل نجد قرنا، ولأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": 1523,
			"text": "حدثنا يحيى بن بشر، حدثنا شبابة، عن ورقاء، عن عمرو بن دينار، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال كان أهل اليمن يحجون ولا يتزودون ويقولون نحن المتوكلون، فإذا قدموا مكة سألوا الناس، فأنزل الله تعالى ‏{‏وتزودوا فإن خير الزاد التقوى‏}‏‏.‏ رواه ابن عيينة عن عمرو عن عكرمة مرسلا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس، قال إن النبي صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة، ولأهل نجد قرن المنازل، ولأهل اليمن يلملم، هن لهن ولمن أتى عليهن من غيرهن، ممن أراد الحج والعمرة، ومن كان دون ذلك فمن حيث أنشأ، حتى أهل مكة من مكة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يهل أهل المدينة من ذي الحليفة، وأهل الشأم من الجحفة، وأهل نجد من قرن ‏\"‏‏.‏ قال عبد الله وبلغني أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ويهل أهل اليمن من يلملم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "حدثنا مسدد، حدثنا حماد، عن عمرو بن دينار، عن طاوس، عن ابن عباس ـ رضى الله عنهما ـ قال وقت رسول الله صلى الله عليه وسلم لأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة، ولأهل نجد قرن المنازل، ولأهل اليمن يلملم، فهن لهن ولمن أتى عليهن من غير أهلهن، لمن كان يريد الحج والعمرة، فمن كان دونهن فمهله من أهله، وكذاك حتى أهل مكة يهلون منها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "حدثنا علي، حدثنا سفيان، حفظناه من الزهري عن سالم، عن أبيه، وقت النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1528,
			"arabicnumber": 1528,
			"text": "حدثنا أحمد، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه ـ رضى الله عنه ـ سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ مهل أهل المدينة ذو الحليفة، ومهل أهل الشأم مهيعة وهي الجحفة، وأهل نجد قرن ‏\"‏‏.‏ قال ابن عمر ـ رضى الله عنهما ـ زعموا أن النبي صلى الله عليه وسلم قال ولم أسمعه ‏\"‏ ومهل أهل اليمن يلملم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "حدثنا قتيبة، حدثنا حماد، عن عمرو، عن طاوس، عن ابن عباس ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة، ولأهل اليمن يلملم، ولأهل نجد قرنا، فهن لهن ولمن أتى عليهن من غير أهلهن، ممن كان يريد الحج والعمرة فمن كان دونهن فمن أهله حتى إن أهل مكة يهلون منها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "حدثنا معلى بن أسد، حدثنا وهيب، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، رضى الله عنهما أن النبي صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة، ولأهل نجد قرن المنازل، ولأهل اليمن يلملم، هن لأهلهن ولكل آت أتى عليهن من غيرهم ممن أراد الحج والعمرة فمن كان دون ذلك، فمن حيث أنشأ حتى أهل مكة من مكة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "حدثني علي بن مسلم، حدثنا عبد الله بن نمير، حدثنا عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال لما فتح هذان المصران أتوا عمر فقالوا يا أمير المؤمنين، إن رسول الله صلى الله عليه وسلم حد لأهل نجد قرنا، وهو جور عن طريقنا، وإنا إن أردنا قرنا شق علينا‏.‏ قال فانظروا حذوها من طريقكم‏.‏ فحد لهم ذات عرق‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم أناخ بالبطحاء بذي الحليفة فصلى بها‏.‏ وكان عبد الله بن عمر ـ رضى الله عنهما ـ يفعل ذلك‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم كان يخرج من طريق الشجرة، ويدخل من طريق المعرس، وأن رسول الله صلى الله عليه وسلم كان إذا خرج إلى مكة يصلي في مسجد الشجرة، وإذا رجع صلى بذي الحليفة ببطن الوادي، وبات حتى يصبح‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "حدثنا الحميدي، حدثنا الوليد، وبشر بن بكر التنيسي، قالا حدثنا الأوزاعي، قال حدثني يحيى، قال حدثني عكرمة، أنه سمع ابن عباس ـ رضى الله عنهما ـ يقول إنه سمع عمر ـ رضى الله عنه ـ يقول سمعت النبي صلى الله عليه وسلم بوادي العقيق يقول ‏ \"‏ أتاني الليلة آت من ربي فقال صل في هذا الوادي المبارك وقل عمرة في حجة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، قال حدثني سالم بن عبد الله، عن أبيه ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم أنه رئي وهو في معرس بذي الحليفة ببطن الوادي قيل له إنك ببطحاء مباركة‏.‏ وقد أناخ بنا سالم، يتوخى بالمناخ الذي كان عبد الله ينيخ، يتحرى معرس رسول الله صلى الله عليه وسلم وهو أسفل من المسجد الذي ببطن الوادي، بينهم وبين الطريق وسط من ذلك‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "قال أبو عاصم أخبرنا ابن جريج، أخبرني عطاء، أن صفوان بن يعلى، أخبره أن يعلى قال لعمر ـ رضى الله عنه ـ أرني النبي صلى الله عليه وسلم حين يوحى إليه قال فبينما النبي صلى الله عليه وسلم بالجعرانة، ومعه نفر من أصحابه، جاءه رجل فقال يا رسول الله كيف ترى في رجل أحرم بعمرة، وهو متضمخ بطيب فسكت النبي صلى الله عليه وسلم ساعة فجاءه الوحى، فأشار عمر ـ رضى الله عنه ـ إلى يعلى، فجاء يعلى، وعلى رسول الله صلى الله عليه وسلم ثوب قد أظل به فأدخل رأسه، فإذا رسول الله صلى الله عليه وسلم محمر الوجه، وهو يغط ثم سري عنه فقال ‏\"‏ أين الذي سأل عن العمرة ‏\"‏ فأتي برجل فقال ‏\"‏ اغسل الطيب الذي بك ثلاث مرات، وانزع عنك الجبة، واصنع في عمرتك كما تصنع في حجتك ‏\"‏‏.‏ قلت لعطاء أراد الإنقاء حين أمره أن يغسل ثلاث مرات قال نعم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": 1538,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": 1539,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم قالت كنت أطيب رسول الله صلى الله عليه وسلم لإحرامه حين يحرم، ولحله قبل أن يطوف بالبيت‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": 1540,
			"text": "حدثنا أصبغ، أخبرنا ابن وهب، عن يونس، عن ابن شهاب، عن سالم، عن أبيه ـ رضى الله عنه ـ قال سمعت رسول الله صلى الله عليه وسلم يهل ملبدا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": 1541,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا موسى بن عقبة، سمعت سالم بن عبد الله، قال سمعت ابن عمر ـ رضى الله عنهما ـ‏.‏ وحدثنا عبد الله بن مسلمة، عن مالك، عن موسى بن عقبة، عن سالم بن عبد الله، أنه سمع أباه، يقول ما أهل رسول الله صلى الله عليه وسلم إلا من عند المسجد يعني مسجد ذي الحليفة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": 1542,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رجلا، قال يا رسول الله ما يلبس المحرم من الثياب قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يلبس القمص ولا العمائم ولا السراويلات ولا البرانس ولا الخفاف، إلا أحد لا يجد نعلين فليلبس خفين، وليقطعهما أسفل من الكعبين، ولا تلبسوا من الثياب شيئا مسه الزعفران أو ورس ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": 1544,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، قال حدثني موسى بن عقبة، قال أخبرني كريب، عن عبد الله بن عباس ـ رضى الله عنهما ـ قال انطلق النبي صلى الله عليه وسلم من المدينة، بعد ما ترجل وادهن ولبس إزاره ورداءه، هو وأصحابه، فلم ينه عن شىء من الأردية والأزر تلبس إلا المزعفرة التي تردع على الجلد، فأصبح بذي الحليفة، ركب راحلته حتى استوى على البيداء، أهل هو وأصحابه وقلد بدنته، وذلك لخمس بقين من ذي القعدة، فقدم مكة لأربع ليال خلون من ذي الحجة، فطاف بالبيت وسعى بين الصفا والمروة، ولم يحل من أجل بدنه لأنه قلدها، ثم نزل بأعلى مكة عند الحجون، وهو مهل بالحج، ولم يقرب الكعبة بعد طوافه بها حتى رجع من عرفة، وأمر أصحابه أن يطوفوا بالبيت وبين الصفا والمروة، ثم يقصروا من رءوسهم ثم يحلوا، وذلك لمن لم يكن معه بدنة قلدها، ومن كانت معه امرأته فهي له حلال، والطيب والثياب‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": 1546,
			"text": "حدثني عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا ابن جريج، حدثنا محمد بن المنكدر، عن أنس بن مالك ـ رضى الله عنه ـ قال صلى النبي صلى الله عليه وسلم بالمدينة أربعا، وبذي الحليفة ركعتين، ثم بات حتى أصبح بذي الحليفة، فلما ركب راحلته واستوت به أهل‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": 1547,
			"text": "حدثنا قتيبة، حدثنا عبد الوهاب، حدثنا أيوب، عن أبي قلابة، عن أنس بن مالك ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم صلى الظهر بالمدينة أربعا، وصلى العصر بذي الحليفة ركعتين، قال وأحسبه بات بها حتى أصبح‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1548,
			"arabicnumber": 1548,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أنس ـ رضى الله عنه ـ قال صلى النبي صلى الله عليه وسلم بالمدينة الظهر أربعا، والعصر بذي الحليفة ركعتين، وسمعتهم يصرخون بهما جميعا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1549,
			"arabicnumber": 1549,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن تلبية، رسول الله صلى الله عليه وسلم لبيك اللهم لبيك، لبيك لا شريك لك لبيك، إن الحمد والنعمة لك والملك، لا شريك لك‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1550,
			"arabicnumber": 1550,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن عمارة، عن أبي عطية، عن عائشة ـ رضى الله عنها ـ قالت إني لأعلم كيف كان النبي صلى الله عليه وسلم يلبي لبيك اللهم لبيك، لبيك لا شريك لك لبيك، إن الحمد والنعمة لك‏.‏ تابعه أبو معاوية عن الأعمش‏.‏ وقال شعبة أخبرنا سليمان، سمعت خيثمة، عن أبي عطية، سمعت عائشة ـ رضى الله عنها ـ‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1551,
			"arabicnumber": 1551,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا أيوب، عن أبي قلابة، عن أنس ـ رضى الله عنه ـ قال صلى رسول الله صلى الله عليه وسلم ونحن معه بالمدينة الظهر أربعا، والعصر بذي الحليفة ركعتين، ثم بات بها حتى أصبح، ثم ركب حتى استوت به على البيداء، حمد الله وسبح وكبر، ثم أهل بحج وعمرة، وأهل الناس بهما، فلما قدمنا أمر الناس فحلوا، حتى كان يوم التروية أهلوا بالحج قال ونحر النبي صلى الله عليه وسلم بدنات بيده قياما، وذبح رسول الله صلى الله عليه وسلم بالمدينة كبشين أملحين‏.‏ قال أبو عبد الله قال بعضهم هذا عن أيوب عن رجل عن أنس‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1552,
			"arabicnumber": 1552,
			"text": "حدثنا أبو عاصم، أخبرنا ابن جريج، قال أخبرني صالح بن كيسان، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال أهل النبي صلى الله عليه وسلم حين استوت به راحلته قائمة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1553,
			"arabicnumber": 1553,
			"text": "وقال أبو معمر حدثنا عبد الوارث، حدثنا أيوب، عن نافع، قال كان ابن عمر ـ رضى الله عنهما ـ إذا صلى بالغداة بذي الحليفة أمر براحلته فرحلت ثم ركب، فإذا استوت به استقبل القبلة قائما، ثم يلبي حتى يبلغ المحرم، ثم يمسك حتى إذا جاء ذا طوى بات به حتى يصبح، فإذا صلى الغداة اغتسل، وزعم أن رسول الله صلى الله عليه وسلم فعل ذلك‏.‏ تابعه إسماعيل عن أيوب في الغسل‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1554,
			"arabicnumber": 1554,
			"text": "حدثنا سليمان بن داود أبو الربيع، حدثنا فليح، عن نافع، قال كان ابن عمر ـ رضى الله عنهما ـ إذا أراد الخروج إلى مكة ادهن بدهن ليس له رائحة طيبة، ثم يأتي مسجد الحليفة فيصلي ثم يركب، وإذا استوت به راحلته قائمة أحرم، ثم قال هكذا رأيت النبي صلى الله عليه وسلم يفعل‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1555,
			"arabicnumber": 1555,
			"text": "حدثنا محمد بن المثنى، قال حدثني ابن أبي عدي، عن ابن عون، عن مجاهد، قال كنا عند ابن عباس ـ رضى الله عنهما ـ فذكروا الدجال أنه قال ‏\"‏ مكتوب بين عينيه كافر ‏\"‏‏.‏ فقال ابن عباس لم أسمعه ولكنه قال ‏\"‏ أما موسى كأني أنظر إليه إذ انحدر في الوادي يلبي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1556,
			"arabicnumber": 1556,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن ابن شهاب، عن عروة بن الزبير، عن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم قالت خرجنا مع النبي صلى الله عليه وسلم في حجة الوداع، فأهللنا بعمرة ثم قال النبي صلى الله عليه وسلم ‏\"‏ من كان معه هدى فليهل بالحج مع العمرة، ثم لا يحل حتى يحل منهما جميعا ‏\"‏ فقدمت مكة وأنا حائض، ولم أطف بالبيت ولا بين الصفا والمروة، فشكوت ذلك إلى النبي صلى الله عليه وسلم فقال ‏\"‏ انقضي رأسك وامتشطي، وأهلي بالحج، ودعي العمرة ‏\"‏‏.‏ ففعلت فلما قضينا الحج أرسلني النبي صلى الله عليه وسلم مع عبد الرحمن بن أبي بكر إلى التنعيم فاعتمرت فقال ‏\"‏ هذه مكان عمرتك ‏\"‏‏.‏ قالت فطاف الذين كانوا أهلوا بالعمرة بالبيت وبين الصفا والمروة، ثم حلوا، ثم طافوا طوافا واحدا بعد أن رجعوا من منى، وأما الذين جمعوا الحج والعمرة فإنما طافوا طوافا واحدا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": 1557,
			"text": "حدثنا المكي بن إبراهيم، عن ابن جريج، قال عطاء قال جابر ـ رضى الله عنه ـ أمر النبي صلى الله عليه وسلم عليا ـ رضى الله عنه ـ أن يقيم على إحرامه، وذكر قول سراقة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "حدثنا الحسن بن علي الخلال الهذلي، حدثنا عبد الصمد، حدثنا سليم بن حيان، قال سمعت مروان الأصفر، عن أنس بن مالك ـ رضى الله عنه ـ قال قدم علي ـ رضى الله عنه ـ على النبي صلى الله عليه وسلم من اليمن فقال ‏\"‏ بما أهللت ‏\"‏‏.‏ قال بما أهل به النبي صلى الله عليه وسلم‏.‏ فقال ‏\"‏ لولا أن معي الهدى لأحللت ‏\"‏‏.‏ وزاد محمد بن بكر عن ابن جريج قال له النبي صلى الله عليه وسلم ‏\"‏ بما أهللت يا علي ‏\"‏‏.‏ قال بما أهل به النبي صلى الله عليه وسلم قال ‏\"‏ فأهد وامكث حراما كما أنت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": 1559,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى ـ رضى الله عنه ـ قال بعثني النبي صلى الله عليه وسلم إلى قوم باليمن فجئت وهو بالبطحاء فقال ‏\"‏ بما أهللت ‏\"‏‏.‏ قلت أهللت كإهلال النبي صلى الله عليه وسلم قال ‏\"‏ هل معك من هدى ‏\"‏‏.‏ قلت لا‏.‏ فأمرني فطفت بالبيت وبالصفا والمروة ثم أمرني فأحللت فأتيت امرأة من قومي فمشطتني، أو غسلت رأسي، فقدم عمر ـ رضى الله عنه ـ فقال إن نأخذ بكتاب الله فإنه يأمرنا بالتمام قال الله ‏{‏وأتموا الحج والعمرة‏}‏ وإن نأخذ بسنة النبي صلى الله عليه وسلم فإنه لم يحل حتى نحر الهدى‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "حدثنا محمد بن بشار، قال حدثني أبو بكر الحنفي، حدثنا أفلح بن حميد، سمعت القاسم بن محمد، عن عائشة ـ رضى الله عنها ـ قالت خرجنا مع رسول الله صلى الله عليه وسلم في أشهر الحج، وليالي الحج وحرم الحج، فنزلنا بسرف قالت فخرج إلى أصحابه فقال ‏\"‏ من لم يكن منكم معه هدى فأحب أن يجعلها عمرة فليفعل، ومن كان معه الهدى فلا ‏\"‏‏.‏ قالت فالآخذ بها والتارك لها من أصحابه قالت فأما رسول الله صلى الله عليه وسلم ورجال من أصحابه فكانوا أهل قوة، وكان معهم الهدى، فلم يقدروا على العمرة قالت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك يا هنتاه ‏\"‏‏.‏ قلت سمعت قولك لأصحابك فمنعت العمرة‏.‏ قال ‏\"‏ وما شأنك ‏\"‏‏.‏ قلت لا أصلي‏.‏ قال ‏\"‏ فلا يضيرك، إنما أنت امرأة من بنات آدم كتب الله عليك ما كتب عليهن، فكوني في حجتك، فعسى الله أن يرزقكيها ‏\"‏‏.‏ قالت فخرجنا في حجته حتى قدمنا منى فطهرت، ثم خرجت من منى فأفضت بالبيت قالت ثم خرجت معه في النفر الآخر حتى نزل المحصب، ونزلنا معه فدعا عبد الرحمن بن أبي بكر فقال ‏\"‏ اخرج بأختك من الحرم، فلتهل بعمرة ثم افرغا، ثم ائتيا ها هنا، فإني أنظركما حتى تأتياني ‏\"‏‏.‏ ـ قالت ـ فخرجنا حتى إذا فرغت، وفرغت من الطواف ثم جئته بسحر فقال ‏\"‏ هل فرغتم ‏\"‏‏.‏ فقلت نعم‏.‏ فآذن بالرحيل في أصحابه، فارتحل الناس فمر متوجها إلى المدينة‏.‏ ضير من ضار يضير ضيرا، ويقال ضار يضور ضورا وضر يضر ضرا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": 1561,
			"text": "حدثنا عثمان، حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة ـ رضى الله عنها ـ خرجنا مع النبي صلى الله عليه وسلم ولا نرى إلا أنه الحج، فلما قدمنا تطوفنا بالبيت، فأمر النبي صلى الله عليه وسلم من لم يكن ساق الهدى أن يحل، فحل من لم يكن ساق الهدى، ونساؤه لم يسقن فأحللن، قالت عائشة ـ رضى الله عنها ـ فحضت فلم أطف بالبيت، فلما كانت ليلة الحصبة قالت يا رسول الله، يرجع الناس بعمرة وحجة وأرجع أنا بحجة قال ‏\"‏ وما طفت ليالي قدمنا مكة ‏\"‏‏.‏ قلت لا‏.‏ قال ‏\"‏ فاذهبي مع أخيك إلى التنعيم، فأهلي بعمرة ثم موعدك كذا وكذا ‏\"‏‏.‏ قالت صفية ما أراني إلا حابستهم‏.‏ قال ‏\"‏ عقرى حلقى، أوما طفت يوم النحر ‏\"‏‏.‏ قالت قلت بلى‏.‏ قال ‏\"‏ لا بأس، انفري ‏\"‏‏.‏ قالت عائشة ـ رضى الله عنها ـ فلقيني النبي صلى الله عليه وسلم وهو مصعد من مكة، وأنا منهبطة عليها، أو أنا مصعدة وهو منهبط منها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": 1562,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الأسود، محمد بن عبد الرحمن بن نوفل عن عروة بن الزبير، عن عائشة ـ رضى الله عنها ـ أنها قالت خرجنا مع رسول الله صلى الله عليه وسلم عام حجة الوداع، فمنا من أهل بعمرة، ومنا من أهل بحجة وعمرة، ومنا من أهل بالحج وأهل رسول الله صلى الله عليه وسلم بالحج، فأما من أهل بالحج أو جمع الحج والعمرة لم يحلوا حتى كان يوم النحر‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن الحكم، عن علي بن حسين، عن مروان بن الحكم، قال شهدت عثمان وعليا ـ رضى الله عنهما ـ وعثمان ينهى عن المتعة وأن يجمع بينهما‏.‏ فلما رأى علي، أهل بهما لبيك بعمرة وحجة قال ما كنت لأدع سنة النبي صلى الله عليه وسلم لقول أحد‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": 1564,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس ـ رضى الله عنهما ـ قال كانوا يرون أن العمرة في أشهر الحج من أفجر الفجور في الأرض، ويجعلون المحرم صفرا ويقولون إذا برأ الدبر، وعفا الأثر، وانسلخ صفر، حلت العمرة لمن اعتمر‏.‏ قدم النبي صلى الله عليه وسلم وأصحابه صبيحة رابعة مهلين بالحج، فأمرهم أن يجعلوها عمرة فتعاظم ذلك عندهم فقالوا يا رسول الله أى الحل قال ‏ \"‏ حل كله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": 1565,
			"text": "حدثنا محمد بن المثنى، حدثنا غندر، حدثنا شعبة، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى ـ رضى الله عنه ـ قال قدمت على النبي صلى الله عليه وسلم‏.‏ فأمره بالحل‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": 1566,
			"text": "حدثنا إسماعيل، قال حدثني مالك،‏.‏ وحدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن ابن عمر، عن حفصة ـ رضى الله عنهم ـ زوج النبي صلى الله عليه وسلم أنها قالت يا رسول الله، ما شأن الناس حلوا بعمرة ولم تحلل أنت من عمرتك قال ‏ \"‏ إني لبدت رأسي، وقلدت هديي فلا أحل حتى أنحر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "حدثنا آدم، حدثنا شعبة، أخبرنا أبو جمرة، نصر بن عمران الضبعي قال تمتعت فنهاني ناس، فسألت ابن عباس ـ رضى الله عنهما ـ فأمرني، فرأيت في المنام كأن رجلا يقول لي حج مبرور وعمرة متقبلة، فأخبرت ابن عباس فقال سنة النبي صلى الله عليه وسلم فقال لي أقم عندي، فأجعل لك سهما من مالي‏.‏ قال شعبة فقلت لم فقال للرؤيا التي رأيت‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "حدثنا أبو نعيم، حدثنا أبو شهاب، قال قدمت متمتعا مكة بعمرة فدخلنا قبل التروية بثلاثة أيام، فقال لي أناس من أهل مكة تصير الآن حجتك مكية‏.‏ فدخلت على عطاء أستفتيه فقال حدثني جابر بن عبد الله ـ رضى الله عنهما ـ أنه حج مع النبي صلى الله عليه وسلم يوم ساق البدن معه، وقد أهلوا بالحج مفردا، فقال لهم ‏\"‏ أحلوا من إحرامكم بطواف البيت وبين الصفا والمروة، وقصروا ثم أقيموا حلالا، حتى إذا كان يوم التروية فأهلوا بالحج، واجعلوا التي قدمتم بها متعة ‏\"‏‏.‏ فقالوا كيف نجعلها متعة وقد سمينا الحج فقال ‏\"‏ افعلوا ما أمرتكم، فلولا أني سقت الهدى لفعلت مثل الذي أمرتكم، ولكن لا يحل مني حرام حتى يبلغ الهدى محله ‏\"‏‏.‏ ففعلوا‏.‏ قال أبو عبد الله أبو شهاب ليس له مسند إلا هذا",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": 1569,
			"text": "حدثنا قتيبة بن سعيد، حدثنا حجاج بن محمد الأعور، عن شعبة، عن عمرو بن مرة، عن سعيد بن المسيب، قال اختلف علي وعثمان ـ رضى الله عنهما ـ وهما بعسفان في المتعة، فقال علي ما تريد إلا أن تنهى عن أمر فعله النبي صلى الله عليه وسلم‏.‏ فلما رأى ذلك علي أهل بهما جميعا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1570,
			"arabicnumber": 1570,
			"text": "حدثنا مسدد، حدثنا حماد بن زيد، عن أيوب، قال سمعت مجاهدا، يقول حدثنا جابر بن عبد الله ـ رضى الله عنهما ـ قدمنا مع رسول الله صلى الله عليه وسلم ونحن نقول لبيك اللهم لبيك بالحج‏.‏ فأمرنا رسول الله صلى الله عليه وسلم فجعلناها عمرة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": 1571,
			"text": "حدثنا موسى بن إسماعيل، حدثنا همام، عن قتادة، قال حدثني مطرف، عن عمران ـ رضى الله عنه ـ قال تمتعنا على عهد رسول الله صلى الله عليه وسلم فنزل القرآن قال رجل برأيه ما شاء‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "وقال أبو كامل فضيل بن حسين البصري حدثنا أبو معشر، حدثنا عثمان بن غياث، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ أنه سئل عن متعة الحج، فقال أهل المهاجرون والأنصار وأزواج النبي صلى الله عليه وسلم في حجة الوداع وأهللنا، فلما قدمنا مكة قال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلوا إهلالكم بالحج عمرة إلا من قلد الهدى ‏\"‏‏.‏ فطفنا بالبيت وبالصفا والمروة وأتينا النساء، ولبسنا الثياب وقال ‏\"‏ من قلد الهدى فإنه لا يحل له حتى يبلغ الهدى محله ‏\"‏‏.‏ ثم أمرنا عشية التروية أن نهل بالحج، فإذا فرغنا من المناسك جئنا فطفنا بالبيت وبالصفا والمروة فقد تم حجنا، وعلينا الهدى كما قال الله تعالى ‏{‏فما استيسر من الهدى فمن لم يجد فصيام ثلاثة أيام في الحج وسبعة إذا رجعتم‏}‏ إلى أمصاركم‏.‏ الشاة تجزي، فجمعوا نسكين في عام بين الحج والعمرة، فإن الله تعالى أنزله في كتابه وسنه نبيه صلى الله عليه وسلم وأباحه للناس غير أهل مكة، قال الله ‏{‏ذلك لمن لم يكن أهله حاضري المسجد الحرام‏}‏ وأشهر الحج التي ذكر الله تعالى شوال وذو القعدة وذو الحجة، فمن تمتع في هذه الأشهر فعليه دم أو صوم، والرفث الجماع، والفسوق المعاصي، والجدال المراء‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": 1573,
			"text": "حدثني يعقوب بن إبراهيم، حدثنا ابن علية، أخبرنا أيوب، عن نافع، قال كان ابن عمر ـ رضى الله عنهما ـ إذا دخل أدنى الحرم أمسك عن التلبية، ثم يبيت بذي طوى، ثم يصلي به الصبح ويغتسل، ويحدث أن نبي الله صلى الله عليه وسلم كان يفعل ذلك‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": 1574,
			"text": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، قال حدثني نافع، عن ابن عمر ـ رضى الله عنهما ـ قال بات النبي صلى الله عليه وسلم بذي طوى حتى أصبح ثم دخل مكة‏.‏ وكان ابن عمر ـ رضى الله عنهما ـ يفعله‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": 1575,
			"text": "حدثنا إبراهيم بن المنذر، قال حدثني معن، قال حدثني مالك، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال كان رسول الله صلى الله عليه وسلم يدخل من الثنية العليا، ويخرج من الثنية السفلى‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": 1576,
			"text": "حدثنا مسدد بن مسرهد البصري، حدثنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم دخل مكة من كداء من الثنية العليا التي بالبطحاء، ويخرج من الثنية السفلى‏.‏ قال أبو عبد الله كان يقال هو مسدد كاسمه‏.‏ قال أبو عبد الله سمعت يحيى بن معين يقول سمعت يحيى بن سعيد يقول لو أن مسددا أتيته في بيته فحدثته لاستحق ذلك، وما أبالي كتبي كانت عندي أو عند مسدد‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": 1577,
			"text": "حدثنا الحميدي، ومحمد بن المثنى، قالا حدثنا سفيان بن عيينة، عن هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ أن النبي صلى الله عليه وسلم لما جاء إلى مكة دخل من أعلاها وخرج من أسفلها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": 1578,
			"text": "حدثنا محمود بن غيلان المروزي، حدثنا أبو أسامة، حدثنا هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ أن النبي صلى الله عليه وسلم دخل عام الفتح من كداء، وخرج من كدا من أعلى مكة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": 1579,
			"text": "حدثنا أحمد، حدثنا ابن وهب، أخبرنا عمرو، عن هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ أن النبي صلى الله عليه وسلم دخل عام الفتح من كداء أعلى مكة‏.‏ قال هشام وكان عروة يدخل على كلتيهما من كداء وكدا، وأكثر ما يدخل من كداء، وكانت أقربهما إلى منزله‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": 1580,
			"text": "حدثنا عبد الله بن عبد الوهاب، حدثنا حاتم، عن هشام، عن عروة، دخل النبي صلى الله عليه وسلم عام الفتح من كداء من أعلى مكة‏.‏ وكان عروة أكثر ما يدخل من كداء وكان أقربهما إلى منزله‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": 1581,
			"text": "حدثنا موسى، حدثنا وهيب، حدثنا هشام، عن أبيه، دخل النبي صلى الله عليه وسلم عام الفتح من كداء‏.‏ وكان عروة يدخل منهما كليهما وأكثر ما يدخل من كداء أقربهما إلى منزله‏.‏ قال أبو عبد الله كداء وكدا موضعان‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "حدثنا عبد الله بن محمد، حدثنا أبو عاصم، قال أخبرني ابن جريج، قال أخبرني عمرو بن دينار، قال سمعت جابر بن عبد الله ـ رضى الله عنهما ـ قال لما بنيت الكعبة ذهب النبي صلى الله عليه وسلم وعباس ينقلان الحجارة فقال العباس للنبي صلى الله عليه وسلم اجعل إزارك على رقبتك‏.‏ فخر إلى الأرض، وطمحت عيناه إلى السماء فقال ‏ \"‏ أرني إزاري ‏\"‏‏.‏ فشده عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1583,
			"arabicnumber": 1583,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن محمد بن أبي بكر، أخبر عبد الله بن عمر، عن عائشة ـ رضى الله عنهم ـ زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال لها ‏\"‏ ألم ترى أن قومك لما بنوا الكعبة اقتصروا عن قواعد إبراهيم ‏\"‏‏.‏ فقلت يا رسول الله ألا تردها على قواعد إبراهيم‏.‏ قال ‏\"‏ لولا حدثان قومك بالكفر لفعلت ‏\"‏‏.‏ فقال عبد الله ـ رضى الله عنه ـ لئن كانت عائشة ـ رضى الله عنها ـ سمعت هذا من رسول الله صلى الله عليه وسلم ما أرى رسول الله صلى الله عليه وسلم ترك استلام الركنين اللذين يليان الحجر، إلا أن البيت لم يتمم على قواعد إبراهيم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": 1584,
			"text": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا أشعث، عن الأسود بن يزيد، عن عائشة ـ رضى الله عنها ـ قالت سألت النبي صلى الله عليه وسلم عن الجدر أمن البيت هو قال ‏\"‏ نعم ‏\"‏‏.‏ قلت فما لهم لم يدخلوه في البيت قال ‏\"‏ إن قومك قصرت بهم النفقة ‏\"‏‏.‏ قلت فما شأن بابه مرتفعا قال ‏\"‏ فعل ذلك قومك ليدخلوا من شاءوا ويمنعوا من شاءوا، ولولا أن قومك حديث عهدهم بالجاهلية فأخاف أن تنكر قلوبهم أن أدخل الجدر في البيت وأن ألصق بابه بالأرض ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": 1585,
			"text": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ لولا حداثة قومك بالكفر لنقضت البيت ثم لبنيته على أساس إبراهيم ـ عليه السلام ـ فإن قريشا استقصرت بناءه ـ وجعلت له خلفا ‏\"‏‏.‏ قال أبو معاوية حدثنا هشام خلفا يعني بابا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": 1586,
			"text": "حدثنا بيان بن عمرو، حدثنا يزيد، حدثنا جرير بن حازم، حدثنا يزيد بن رومان، عن عروة، عن عائشة ـ رضى الله عنها ـ أن النبي صلى الله عليه وسلم قال لها ‏ \"‏ يا عائشة لولا أن قومك حديث عهد بجاهلية لأمرت بالبيت فهدم، فأدخلت فيه ما أخرج منه وألزقته بالأرض، وجعلت له بابين بابا شرقيا وبابا غربيا، فبلغت به أساس إبراهيم ‏\"‏‏.‏ فذلك الذي حمل ابن الزبير ـ رضى الله عنهما ـ على هدمه‏.‏ قال يزيد وشهدت ابن الزبير حين هدمه وبناه وأدخل فيه من الحجر، وقد رأيت أساس إبراهيم حجارة كأسنمة الإبل‏.‏ قال جرير فقلت له أين موضعه قال أريكه الآن‏.‏ فدخلت معه الحجر فأشار إلى مكان فقال ها هنا‏.‏ قال جرير فحزرت من الحجر ستة أذرع أو نحوها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": 1587,
			"text": "حدثنا علي بن عبد الله، حدثنا جرير بن عبد الحميد، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم يوم فتح مكة ‏ \"‏ إن هذا البلد حرمه الله، لا يعضد شوكه، ولا ينفر صيده، ولا يلتقط لقطته إلا من عرفها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": 1588,
			"text": "حدثنا أصبغ، قال أخبرني ابن وهب، عن يونس، عن ابن شهاب، عن علي بن حسين، عن عمرو بن عثمان، عن أسامة بن زيد ـ رضى الله عنهما ـ أنه قال يا رسول الله، أين تنزل في دارك بمكة‏.‏ فقال ‏\"‏ وهل ترك عقيل من رباع أو دور ‏\"‏‏.‏ وكان عقيل ورث أبا طالب هو وطالب ولم يرثه جعفر ولا علي ـ رضى الله عنهما ـ شيئا لأنهما كانا مسلمين، وكان عقيل وطالب كافرين، فكان عمر بن الخطاب ـ رضى الله عنه ـ يقول لا يرث المؤمن الكافر‏.‏ قال ابن شهاب وكانوا يتأولون قول الله تعالى ‏{‏إن الذين آمنوا وهاجروا وجاهدوا بأموالهم وأنفسهم في سبيل الله والذين آووا ونصروا أولئك بعضهم أولياء بعض‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": 1589,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني أبو سلمة، أن أبا هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم حين أراد قدوم مكة ‏ \"‏ منزلنا غدا إن شاء الله بخيف بني كنانة حيث تقاسموا على الكفر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": 1590,
			"text": "حدثنا الحميدي، حدثنا الوليد، حدثنا الأوزاعي، قال حدثني الزهري، عن أبي سلمة، عن أبي هريرة ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم من الغد يوم النحر وهو بمنى ‏ \"‏ نحن نازلون غدا بخيف بني كنانة حيث تقاسموا على الكفر ‏\"‏‏.‏ يعني ذلك المحصب، وذلك أن قريشا وكنانة تحالفت على بني هاشم وبني عبد المطلب، أو بني المطلب أن لا يناكحوهم، ولا يبايعوهم حتى يسلموا إليهم النبي صلى الله عليه وسلم‏.‏ وقال سلامة عن عقيل ويحيى بن الضحاك عن الأوزاعي أخبرني ابن شهاب وقالا بني هاشم وبني المطلب‏.‏ قال أبو عبد الله بني المطلب أشبه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": 1591,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا زياد بن سعد، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ يخرب الكعبة ذو السويقتين من الحبشة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": 1592,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة ـ رضى الله عنها ـ‏.‏ وحدثني محمد بن مقاتل، قال أخبرني عبد الله ـ هو ابن المبارك ـ قال أخبرنا محمد بن أبي حفصة، عن الزهري، عن عروة، عن عائشة ـ رضى الله عنها ـ قالت كانوا يصومون عاشوراء قبل أن يفرض رمضان، وكان يوما تستر فيه الكعبة، فلما فرض الله رمضان قال رسول الله صلى الله عليه وسلم ‏ \"‏ من شاء أن يصومه فليصمه، ومن شاء أن يتركه فليتركه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": 1593,
			"text": "حدثنا أحمد، حدثنا أبي، حدثنا إبراهيم، عن الحجاج بن حجاج، عن قتادة، عن عبد الله بن أبي عتبة، عن أبي سعيد الخدري ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ ليحجن البيت وليعتمرن بعد خروج يأجوج ومأجوج ‏\"‏‏.‏ تابعه أبان وعمران عن قتادة‏.‏ وقال عبد الرحمن عن شعبة قال ‏\"‏ لا تقوم الساعة حتى لا يحج البيت ‏\"‏‏.‏ والأول أكثر، سمع قتادة عبد الله وعبد الله أبا سعيد‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": 1594,
			"text": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا سفيان، حدثنا واصل الأحدب، عن أبي وائل، قال جئت إلى شيبة‏.‏ وحدثنا قبيصة، حدثنا سفيان، عن واصل، عن أبي وائل، قال جلست مع شيبة على الكرسي في الكعبة فقال لقد جلس هذا المجلس عمر ـ رضى الله عنه ـ فقال لقد هممت أن لا أدع فيها صفراء ولا بيضاء إلا قسمته‏.‏ قلت إن صاحبيك لم يفعلا‏.‏ قال هما المرآن أقتدي بهما‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": 1595,
			"text": "حدثنا عمرو بن علي، حدثنا يحيى بن سعيد، حدثنا عبيد الله بن الأخنس، حدثني ابن أبي مليكة، عن ابن عباس ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ كأني به أسود أفحج، يقلعها حجرا حجرا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1596,
			"arabicnumber": 1596,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن يونس، عن ابن شهاب، عن سعيد بن المسيب، أن أبا هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يخرب الكعبة ذو السويقتين من الحبشة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1597,
			"arabicnumber": 1597,
			"text": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن إبراهيم، عن عابس بن ربيعة، عن عمر ـ رضى الله عنه ـ أنه جاء إلى الحجر الأسود فقبله، فقال إني أعلم أنك حجر لا تضر ولا تنفع، ولولا أني رأيت النبي صلى الله عليه وسلم يقبلك ما قبلتك‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1598,
			"arabicnumber": 1598,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن شهاب، عن سالم، عن أبيه، أنه قال دخل رسول الله صلى الله عليه وسلم البيت هو وأسامة بن زيد، وبلال، وعثمان بن طلحة، فأغلقوا عليهم فلما فتحوا، كنت أول من ولج، فلقيت بلالا فسألته هل صلى فيه رسول الله صلى الله عليه وسلم قال نعم، بين العمودين اليمانيين‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": 1599,
			"text": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا موسى بن عقبة، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أنه كان إذا دخل الكعبة مشى قبل الوجه حين يدخل، ويجعل الباب قبل الظهر، يمشي حتى يكون بينه وبين الجدار الذي قبل وجهه قريبا من ثلاث أذرع، فيصلي يتوخى المكان الذي أخبره بلال أن رسول الله صلى الله عليه وسلم صلى فيه، وليس على أحد بأس أن يصلي في أى نواحي البيت شاء‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": 1600,
			"text": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا إسماعيل بن أبي خالد، عن عبد الله بن أبي أوفى، قال اعتمر رسول الله صلى الله عليه وسلم فطاف بالبيت وصلى خلف المقام ركعتين، ومعه من يستره من الناس فقال له رجل أدخل رسول الله صلى الله عليه وسلم الكعبة قال لا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا أيوب، حدثنا عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال إن رسول الله صلى الله عليه وسلم لما قدم أبى أن يدخل البيت وفيه الآلهة فأمر بها فأخرجت فأخرجوا صورة إبراهيم وإسماعيل في أيديهما الأزلام فقال رسول الله صلى الله عليه وسلم ‏ \"‏ قاتلهم الله أما والله قد علموا أنهما لم يستقسما بها قط ‏\"‏‏.‏ فدخل البيت، فكبر في نواحيه، ولم يصل فيه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": 1602,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد ـ هو ابن زيد ـ عن أيوب، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهما ـ قال قدم رسول الله صلى الله عليه وسلم وأصحابه فقال المشركون إنه يقدم عليكم، وقد وهنهم حمى يثرب‏.‏ فأمرهم النبي صلى الله عليه وسلم أن يرملوا الأشواط الثلاثة، وأن يمشوا ما بين الركنين، ولم يمنعه أن يأمرهم أن يرملوا الأشواط كلها إلا الإبقاء عليهم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": 1603,
			"text": "حدثنا أصبغ بن الفرج، أخبرني ابن وهب، عن يونس، عن ابن شهاب، عن سالم، عن أبيه ـ رضى الله عنه ـ قال رأيت رسول الله صلى الله عليه وسلم حين يقدم مكة، إذا استلم الركن الأسود أول ما يطوف يخب ثلاثة أطواف من السبع‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": 1604,
			"text": "حدثني محمد، حدثنا سريج بن النعمان، حدثنا فليح، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال سعى النبي صلى الله عليه وسلم ثلاثة أشواط ومشى أربعة في الحج والعمرة‏.‏ تابعه الليث قال حدثني كثير بن فرقد، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": 1605,
			"text": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد بن أسلم، عن أبيه، أن عمر بن الخطاب ـ رضى الله عنه ـ قال للركن أما والله إني لأعلم أنك حجر لا تضر ولا تنفع، ولولا أني رأيت النبي صلى الله عليه وسلم استلمك ما استلمتك‏.‏ فاستلمه، ثم قال فما لنا وللرمل إنما كنا راءينا به المشركين، وقد أهلكهم الله‏.‏ ثم قال شىء صنعه النبي صلى الله عليه وسلم فلا نحب أن نتركه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": 1606,
			"text": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال ما تركت استلام هذين الركنين في شدة ولا رخاء، منذ رأيت النبي صلى الله عليه وسلم يستلمهما‏.‏ قلت لنافع أكان ابن عمر يمشي بين الركنين قال إنما كان يمشي ليكون أيسر لاستلامه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": 1607,
			"text": "حدثنا أحمد بن صالح، ويحيى بن سليمان، قالا حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس ـ رضى الله عنهما ـ قال طاف النبي صلى الله عليه وسلم في حجة الوداع على بعير، يستلم الركن بمحجن‏.‏ تابعه الدراوردي عن ابن أخي الزهري عن عمه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": 1608,
			"text": "وقال محمد بن بكر أخبرنا ابن جريج، أخبرني عمرو بن دينار، عن أبي الشعثاء، أنه قال ومن يتقي شيئا من البيت، وكان معاوية يستلم الأركان، فقال له ابن عباس ـ رضى الله عنهما ـ إنه لا يستلم هذان الركنان‏.‏ فقال ليس شىء من البيت مهجورا، وكان ابن الزبير ـ رضى الله عنهما ـ يستلمهن كلهن‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": 1609,
			"text": "حدثنا أبو الوليد، حدثنا ليث، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه ـ رضى الله عنهما ـ قال لم أر النبي صلى الله عليه وسلم يستلم من البيت إلا الركنين اليمانيين‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": 1610,
			"text": "حدثنا أحمد بن سنان، حدثنا يزيد بن هارون، أخبرنا ورقاء، أخبرنا زيد بن أسلم، عن أبيه، قال رأيت عمر بن الخطاب ـ رضى الله عنه ـ قبل الحجر وقال لولا أني رأيت رسول الله صلى الله عليه وسلم قبلك ما قبلتك‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": 1611,
			"text": "حدثنا مسدد، حدثنا حماد، عن الزبير بن عربي، قال سأل رجل ابن عمر ـ رضى الله عنهما ـ عن استلام الحجر،‏.‏ فقال رأيت رسول الله صلى الله عليه وسلم يستلمه ويقبله‏.‏ قال قلت أرأيت إن زحمت أرأيت إن غلبت قال اجعل أرأيت باليمن، رأيت رسول الله صلى الله عليه وسلم يستلمه ويقبله‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": 1612,
			"text": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال طاف النبي صلى الله عليه وسلم بالبيت على بعير، كلما أتى على الركن أشار إليه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": 1613,
			"text": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا خالد الحذاء، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال طاف النبي صلى الله عليه وسلم بالبيت على بعير، كلما أتى الركن أشار إليه بشىء كان عنده وكبر‏.‏ تابعه إبراهيم بن طهمان عن خالد الحذاء‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": 1615,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": 1616,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، أنس حدثنا موسى بن عقبة، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم كان إذا طاف في الحج أو العمرة أول ما يقدم سعى ثلاثة أطواف، ومشى أربعة، ثم سجد سجدتين، ثم يطوف بين الصفا والمروة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": 1617,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم كان إذا طاف بالبيت الطواف الأول يخب ثلاثة أطواف، ويمشي أربعة، وأنه كان يسعى بطن المسيل إذا طاف بين الصفا والمروة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "وقال لي عمرو بن علي حدثنا أبو عاصم، قال ابن جريج أخبرنا قال أخبرني عطاء، إذ منع ابن هشام النساء الطواف مع الرجال قال كيف يمنعهن، وقد طاف نساء النبي صلى الله عليه وسلم مع الرجال قلت أبعد الحجاب أو قبل قال إي لعمري لقد أدركته بعد الحجاب‏.‏ قلت كيف يخالطن الرجال قال لم يكن يخالطن كانت عائشة ـ رضى الله عنها ـ تطوف حجرة من الرجال لا تخالطهم، فقالت امرأة انطلقي نستلم يا أم المؤمنين‏.‏ قالت ‏{‏انطلقي‏}‏ عنك‏.‏ وأبت‏.‏ ‏{‏وكن‏}‏ يخرجن متنكرات بالليل، فيطفن مع الرجال، ولكنهن كن إذا دخلن البيت قمن حتى يدخلن وأخرج الرجال، وكنت آتي عائشة أنا وعبيد بن عمير وهي مجاورة في جوف ثبير‏.‏ قلت وما حجابها قال هي في قبة تركية لها غشاء، وما بيننا وبينها غير ذلك، ورأيت عليها درعا موردا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": 1619,
			"text": "حدثنا إسماعيل، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة بن الزبير، عن زينب بنت أبي سلمة، عن أم سلمة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس، وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت، وهو يقرأ ‏{‏والطور * وكتاب مسطور‏}‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": 1620,
			"text": "حدثنا إبراهيم بن موسى، حدثنا هشام، أن ابن جريج، أخبرهم قال أخبرني سليمان الأحول، أن طاوسا، أخبره عن ابن عباس ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم مر وهو يطوف بالكعبة بإنسان ربط يده إلى إنسان بسير، أو بخيط، أو بشىء غير ذلك، فقطعه النبي صلى الله عليه وسلم بيده، ثم قال ‏ \"‏ قده بيده ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": 1621,
			"text": "حدثنا أبو عاصم، عن ابن جريج، عن سليمان الأحول، عن طاوس، عن ابن عباس ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم رأى رجلا يطوف بالكعبة بزمام أو غيره فقطعه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": 1622,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، قال يونس قال ابن شهاب حدثني حميد بن عبد الرحمن، أن أبا هريرة، أخبره أن أبا بكر الصديق ـ رضى الله عنه ـ بعثه في الحجة التي أمره عليه رسول الله صلى الله عليه وسلم قبل حجة الوداع يوم النحر في رهط يؤذن في الناس ‏ \"‏ ألا لا يحج بعد العام مشرك، ولا يطوف بالبيت عريان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": 1624,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": 1625,
			"text": "حدثنا محمد بن أبي بكر، حدثنا فضيل، حدثنا موسى بن عقبة، أخبرني كريب، عن عبد الله بن عباس ـ رضى الله عنهما ـ قال قدم النبي صلى الله عليه وسلم مكة، فطاف وسعى بين الصفا والمروة، ولم يقرب الكعبة بعد طوافه بها حتى رجع من عرفة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": 1626,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن عبد الرحمن، عن عروة، عن زينب، عن أم سلمة ـ رضى الله عنها ـ شكوت إلى رسول الله صلى الله عليه وسلم‏.‏ وحدثني محمد بن حرب حدثنا أبو مروان يحيى بن أبي زكرياء الغساني عن هشام عن عروة عن أم سلمة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال وهو بمكة، وأراد الخروج، ولم تكن أم سلمة طافت بالبيت وأرادت الخروج، فقال لها رسول الله صلى الله عليه وسلم ‏ \"‏ إذا أقيمت صلاة الصبح فطوفي على بعيرك، والناس يصلون ‏\"‏‏.‏ ففعلت ذلك، فلم تصل حتى خرجت‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": 1627,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن دينار، قال سمعت ابن عمر ـ رضى الله عنهما ـ يقول قدم النبي صلى الله عليه وسلم فطاف بالبيت سبعا وصلى خلف المقام ركعتين، ثم خرج إلى الصفا، وقد قال الله تعالى ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "حدثنا الحسن بن عمر البصري، حدثنا يزيد بن زريع، عن حبيب، عن عطاء، عن عروة، عن عائشة ـ رضى الله عنها ـ أن ناسا، طافوا بالبيت بعد صلاة الصبح، ثم قعدوا إلى المذكر، حتى إذا طلعت الشمس قاموا يصلون فقالت عائشة ـ رضى الله عنها ـ قعدوا حتى إذا كانت الساعة التي تكره فيها الصلاة قاموا يصلون‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": 1629,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، أن عبد الله ـ رضى الله عنه ـ قال سمعت النبي صلى الله عليه وسلم ينهى عن الصلاة عند طلوع الشمس وعند غروبها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": 1631,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": 1632,
			"text": "حدثني إسحاق الواسطي، حدثنا خالد، عن خالد الحذاء، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم طاف بالبيت، وهو على بعير، كلما أتى على الركن أشار إليه بشىء في يده وكبر‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1633,
			"arabicnumber": 1633,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب ابنة أم سلمة، عن أم سلمة ـ رضى الله عنها ـ قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏ \"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، وهو يقرأ بالطور وكتاب مسطور‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": 1634,
			"text": "حدثنا عبد الله بن أبي الأسود، حدثنا أبو ضمرة، حدثنا عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال استأذن العباس بن عبد المطلب ـ رضى الله عنه ـ رسول الله صلى الله عليه وسلم أن يبيت بمكة ليالي منى من أجل سقايته، فأذن له‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": 1635,
			"text": "حدثنا إسحاق، حدثنا خالد، عن خالد الحذاء، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم جاء إلى السقاية، فاستسقى، فقال العباس يا فضل اذهب إلى أمك، فأت رسول الله صلى الله عليه وسلم بشراب من عندها‏.‏ فقال ‏\"‏ اسقني ‏\"‏‏.‏ قال يا رسول الله إنهم يجعلون أيديهم فيه‏.‏ قال ‏\"‏ اسقني ‏\"‏‏.‏ فشرب منه، ثم أتى زمزم، وهم يسقون ويعملون فيها، فقال ‏\"‏ اعملوا، فإنكم على عمل صالح ـ ثم قال ـ لولا أن تغلبوا لنزلت حتى أضع الحبل على هذه ‏\"‏‏.‏ ـ يعني عاتقه ـ وأشار إلى عاتقه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": 1636,
			"text": "وقال عبدان أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أنس بن مالك كان أبو ذر ـ رضى الله عنه ـ يحدث أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ فرج سقفي وأنا بمكة، فنزل جبريل ـ عليه السلام ـ ففرج صدري، ثم غسله بماء زمزم، ثم جاء بطست من ذهب ممتلئ حكمة وإيمانا، فأفرغها في صدري، ثم أطبقه، ثم أخذ بيدي فعرج إلى السماء الدنيا‏.‏ قال جبريل لخازن السماء الدنيا افتح‏.‏ قال من هذا قال جبريل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": 1637,
			"text": "حدثنا محمد ـ هو ابن سلام ـ أخبرنا الفزاري، عن عاصم، عن الشعبي، أن ابن عباس ـ رضى الله عنهما ـ حدثه قال سقيت رسول الله صلى الله عليه وسلم من زمزم فشرب وهو قائم‏.‏ قال عاصم فحلف عكرمة ما كان يومئذ إلا على بعير‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": 1638,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عروة، عن عائشة ـ رضى الله عنها ـ خرجنا مع رسول الله صلى الله عليه وسلم في حجة الوداع، فأهللنا بعمرة، ثم قال ‏\"‏ من كان معه هدى فليهل بالحج والعمرة ثم لا يحل حتى يحل منهما ‏\"‏‏.‏ فقدمت مكة، وأنا حائض، فلما قضينا حجنا أرسلني مع عبد الرحمن إلى التنعيم، فاعتمرت، فقال صلى الله عليه وسلم ‏\"‏ هذه مكان عمرتك ‏\"‏‏.‏ فطاف الذين أهلوا بالعمرة، ثم حلوا، ثم طافوا طوافا آخر، بعد أن رجعوا من منى، وأما الذين جمعوا بين الحج والعمرة طافوا طوافا واحدا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": 1639,
			"text": "حدثنا يعقوب بن إبراهيم، حدثنا ابن علية، عن أيوب، عن نافع، أن ابن عمر ـ رضى الله عنهما ـ دخل ابنه عبد الله بن عبد الله، وظهره في الدار، فقال إني لا آمن أن يكون العام بين الناس قتال، فيصدوك عن البيت، فلو أقمت‏.‏ فقال قد خرج رسول الله صلى الله عليه وسلم فحال كفار قريش بينه وبين البيت، فإن حيل بيني وبينه أفعل كما فعل رسول الله صلى الله عليه وسلم ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏ ثم قال أشهدكم أني قد أوجبت مع عمرتي حجا‏.‏ قال ثم قدم فطاف لهما طوافا واحدا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": 1640,
			"text": "حدثنا قتيبة، حدثنا الليث، عن نافع، أن ابن عمر ـ رضى الله عنهما ـ أراد الحج عام نزل الحجاج بابن الزبير‏.‏ فقيل له إن الناس كائن بينهم قتال، وإنا نخاف أن يصدوك‏.‏ فقال ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏ إذا أصنع كما صنع رسول الله صلى الله عليه وسلم، إني أشهدكم أني قد أوجبت عمرة‏.‏ ثم خرج حتى إذا كان بظاهر البيداء قال ما شأن الحج والعمرة إلا واحد، أشهدكم أني قد أوجبت حجا مع عمرتي‏.‏ وأهدى هديا اشتراه بقديد ولم يزد على ذلك، فلم ينحر، ولم يحل من شىء حرم منه، ولم يحلق ولم يقصر حتى كان يوم النحر، فنحر وحلق، ورأى أن قد قضى طواف الحج، والعمرة بطوافه الأول‏.‏ وقال ابن عمر ـ رضى الله عنهما ـ كذلك فعل رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": 1642,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال عروة سألت عائشة ـ رضى الله عنها ـ فقلت لها أرأيت قول الله تعالى ‏{‏إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما‏}‏ فوالله ما على أحد جناح أن لا يطوف بالصفا والمروة‏.‏ قالت بئس ما قلت يا ابن أختي إن هذه لو كانت كما أولتها عليه كانت لا جناح عليه أن لا يتطوف بهما، ولكنها أنزلت في الأنصار، كانوا قبل أن يسلموا يهلون لمناة الطاغية التي كانوا يعبدونها عند المشلل، فكان من أهل يتحرج أن يطوف بالصفا والمروة، فلما أسلموا سألوا رسول الله صلى الله عليه وسلم عن ذلك قالوا يا رسول الله، إنا كنا نتحرج أن نطوف بين الصفا والمروة، فأنزل الله تعالى ‏{‏إن الصفا والمروة من شعائر الله‏}‏ الآية‏.‏ قالت عائشة ـ رضى الله عنها ـ وقد سن رسول الله صلى الله عليه وسلم الطواف بينهما، فليس لأحد أن يترك الطواف بينهما‏.‏ ثم أخبرت أبا بكر بن عبد الرحمن، فقال إن هذا لعلم ما كنت سمعته، ولقد سمعت رجالا من أهل العلم، يذكرون أن الناس إلا من ذكرت عائشة ممن كان يهل بمناة، كانوا يطوفون كلهم بالصفا والمروة، فلما ذكر الله تعالى الطواف بالبيت، ولم يذكر الصفا والمروة في القرآن قالوا يا رسول الله كنا نطوف بالصفا والمروة، وإن الله أنزل الطواف بالبيت، فلم يذكر الصفا فهل علينا من حرج أن نطوف بالصفا والمروة فأنزل الله تعالى ‏{‏إن الصفا والمروة من شعائر الله‏}‏ الآية‏.‏ قال أبو بكر فأسمع هذه الآية نزلت في الفريقين كليهما في الذين كانوا يتحرجون أن يطوفوا بالجاهلية بالصفا والمروة، والذين يطوفون ثم تحرجوا أن يطوفوا بهما في الإسلام من أجل أن الله تعالى أمر بالطواف بالبيت، ولم يذكر الصفا حتى ذكر ذلك بعد ما ذكر الطواف بالبيت‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": 1644,
			"text": "حدثنا محمد بن عبيد بن ميمون، حدثنا عيسى بن يونس، عن عبيد الله بن عمر، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال كان رسول الله صلى الله عليه وسلم إذا طاف الطواف الأول خب ثلاثا ومشى أربعا، وكان يسعى بطن المسيل إذا طاف بين الصفا والمروة‏.‏ فقلت لنافع أكان عبد الله يمشي إذا بلغ الركن اليماني قال لا‏.‏ إلا أن يزاحم على الركن فإنه كان لا يدعه حتى يستلمه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": 1646,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": 1647,
			"text": "حدثنا المكي بن إبراهيم، عن ابن جريج، قال أخبرني عمرو بن دينار، قال سمعت ابن عمر ـ رضى الله عنهما ـ قال قدم النبي صلى الله عليه وسلم مكة، فطاف بالبيت، ثم صلى ركعتين، ثم سعى بين الصفا والمروة، ثم تلا ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1648,
			"arabicnumber": 1648,
			"text": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا عاصم، قال قلت لأنس بن مالك ـ رضى الله عنه ـ أكنتم تكرهون السعى بين الصفا والمروة قال نعم‏.‏ لأنها كانت من شعائر الجاهلية، حتى أنزل الله ‏{‏إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": 1649,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو بن دينار، عن عطاء، عن ابن عباس ـ رضى الله عنهما ـ قال إنما سعى رسول الله صلى الله عليه وسلم بالبيت وبين الصفا والمروة ليري المشركين قوته‏.‏ زاد الحميدي حدثنا سفيان، حدثنا عمرو، سمعت عطاء، عن ابن عباس، مثله‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": 1650,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة ـ رضى الله عنها ـ أنها قالت قدمت مكة وأنا حائض، ولم أطف بالبيت، ولا بين الصفا والمروة، قالت فشكوت ذلك إلى رسول الله صلى الله عليه وسلم قال ‏ \"‏ افعلي كما يفعل الحاج غير أن لا تطوفي بالبيت حتى تطهري ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب،‏.‏ قال وقال لي خليفة حدثنا عبد الوهاب، حدثنا حبيب المعلم، عن عطاء، عن جابر بن عبد الله ـ رضى الله عنهما ـ قال أهل النبي صلى الله عليه وسلم هو وأصحابه بالحج، وليس مع أحد منهم هدى، غير النبي صلى الله عليه وسلم وطلحة، وقدم علي من اليمن، ومعه هدى فقال أهللت بما أهل به النبي صلى الله عليه وسلم‏.‏ فأمر النبي صلى الله عليه وسلم أصحابه أن يجعلوها عمرة، ويطوفوا، ثم يقصروا ويحلوا، إلا من كان معه الهدى، فقالوا ننطلق إلى منى، وذكر أحدنا يقطر، فبلغ النبي صلى الله عليه وسلم فقال ‏ \"‏ لو استقبلت من أمري ما استدبرت ما أهديت، ولولا أن معي الهدى لأحللت ‏\"‏‏.‏ وحاضت عائشة ـ رضى الله عنها ـ فنسكت المناسك كلها، غير أنها لم تطف بالبيت، فلما طهرت طافت بالبيت‏.‏ قالت يا رسول الله تنطلقون بحجة وعمرة، وأنطلق بحج فأمر عبد الرحمن بن أبي بكر أن يخرج معها إلى التنعيم، فاعتمرت بعد الحج‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن أيوب، عن حفصة، قالت كنا نمنع عواتقنا أن يخرجن، فقدمت امرأة فنزلت قصر بني خلف، فحدثت أن أختها كانت تحت رجل من أصحاب رسول الله صلى الله عليه وسلم قد غزا مع رسول الله صلى الله عليه وسلم ثنتى عشرة غزوة، وكانت أختي معه في ست غزوات، قالت كنا نداوي الكلمى ونقوم على المرضى‏.‏ فسألت أختي رسول الله صلى الله عليه وسلم فقالت هل على إحدانا بأس إن لم يكن لها جلباب أن لا تخرج قال ‏\"‏ لتلبسها صاحبتها من جلبابها، ولتشهد الخير، ودعوة المؤمنين ‏\"‏‏.‏ فلما قدمت أم عطية ـ رضى الله عنها ـ سألنها ـ أو قالت سألناها ـ فقالت وكانت لا تذكر رسول الله صلى الله عليه وسلم إلا قالت بأبي‏.‏ فقلنا أسمعت رسول الله صلى الله عليه وسلم يقول كذا وكذا قالت نعم بأبي‏.‏ فقال ‏\"‏ لتخرج العواتق ذوات الخدور ـ أو العواتق وذوات الخدور ـ والحيض، فيشهدن الخير، ودعوة المسلمين، ويعتزل الحيض المصلى ‏\"‏‏.‏ فقلت الحائض‏.‏ فقالت أو ليس تشهد عرفة، وتشهد كذا وتشهد كذا",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "حدثني عبد الله بن محمد، حدثنا إسحاق الأزرق، حدثنا سفيان، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك ـ رضى الله عنه ـ قلت أخبرني بشىء، عقلته عن النبي صلى الله عليه وسلم أين صلى الظهر والعصر يوم التروية قال بمنى‏.‏ قلت فأين صلى العصر يوم النفر قال بالأبطح‏.‏ ثم قال افعل كما يفعل أمراؤك‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "حدثنا علي، سمع أبا بكر بن عياش، حدثنا عبد العزيز، لقيت أنسا‏.‏ وحدثني إسماعيل بن أبان، حدثنا أبو بكر، عن عبد العزيز، قال خرجت إلى منى يوم التروية فلقيت أنسا ـ رضى الله عنه ـ ذاهبا على حمار فقلت أين صلى النبي صلى الله عليه وسلم هذا اليوم الظهر فقال انظر حيث يصلي أمراؤك فصل‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله بن عمر، عن أبيه، قال صلى رسول الله صلى الله عليه وسلم بمنى ركعتين، وأبو بكر وعمر وعثمان صدرا من خلافته‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "حدثنا آدم، حدثنا شعبة، عن أبي إسحاق الهمداني، عن حارثة بن وهب الخزاعي ـ رضى الله عنه ـ قال صلى بنا النبي صلى الله عليه وسلم ونحن أكثر ما كنا قط وآمنه بمنى ركعتين‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "حدثنا قبيصة بن عقبة، حدثنا سفيان، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن عبد الله ـ رضى الله عنه ـ قال صليت مع النبي صلى الله عليه وسلم ركعتين، ومع أبي بكر ـ رضى الله عنه ـ ركعتين ومع عمر ـ رضى الله عنه ـ ركعتين، ثم تفرقت بكم الطرق، فيا ليت حظي من أربع ركعتان متقبلتان‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن الزهري، حدثنا سالم، قال سمعت عميرا، مولى أم الفضل عن أم الفضل، شك الناس يوم عرفة في صوم النبي صلى الله عليه وسلم فبعثت إلى النبي صلى الله عليه وسلم بشراب فشربه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن أبي بكر الثقفي، أنه سأل أنس بن مالك وهما غاديان من منى إلى عرفة كيف كنتم تصنعون في هذا اليوم مع رسول الله صلى الله عليه وسلم فقال كان يهل منا المهل فلا ينكر عليه، ويكبر منا المكبر فلا ينكر عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن سالم، قال كتب عبد الملك إلى الحجاج أن لا يخالف ابن عمر في الحج، فجاء ابن عمر ـ رضى الله عنه ـ وأنا معه يوم عرفة حين زالت الشمس، فصاح عند سرادق الحجاج، فخرج وعليه ملحفة معصفرة فقال ما لك يا أبا عبد الرحمن فقال الرواح إن كنت تريد السنة‏.‏ قال هذه الساعة قال نعم‏.‏ قال فأنظرني حتى أفيض على رأسي ثم أخرج‏.‏ فنزل حتى خرج الحجاج، فسار بيني وبين أبي، فقلت إن كنت تريد السنة فاقصر الخطبة وعجل الوقوف‏.‏ فجعل ينظر إلى عبد الله، فلما رأى ذلك عبد الله قال صدق‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، عن عمير، مولى عبد الله بن العباس عن أم الفضل بنت الحارث، أن ناسا، اختلفوا عندها يوم عرفة في صوم النبي صلى الله عليه وسلم فقال بعضهم هو صائم‏.‏ وقال بعضهم ليس بصائم‏.‏ فأرسلت إليه بقدح لبن وهو واقف على بعيره فشربه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "وقال الليث حدثني عقيل، عن ابن شهاب، قال أخبرني سالم، أن الحجاج بن يوسف، عام نزل بابن الزبير ـ رضى الله عنهما ـ سأل عبد الله ـ رضى الله عنه ـ كيف تصنع في الموقف يوم عرفة فقال سالم إن كنت تريد السنة فهجر بالصلاة يوم عرفة‏.‏ فقال عبد الله بن عمر صدق‏.‏ إنهم كانوا يجمعون بين الظهر والعصر في السنة‏.‏ فقلت لسالم أفعل ذلك رسول الله صلى الله عليه وسلم فقال سالم وهل تتبعون في ذلك إلا سنته",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "حدثنا عبد الله بن مسلمة، أخبرنا مالك، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الملك بن مروان، كتب إلى الحجاج أن يأتم، بعبد الله بن عمر في الحج، فلما كان يوم عرفة جاء ابن عمر ـ رضى الله عنهما ـ وأنا معه حين زاغت الشمس أو زالت، فصاح عند فسطاطه أين هذا فخرح إليه فقال ابن عمر الرواح‏.‏ فقال الآن قال نعم‏.‏ قال أنظرني أفيض على ماء‏.‏ فنزل ابن عمر ـ رضى الله عنهما ـ حتى خرج، فسار بيني وبين أبي‏.‏ فقلت إن كنت تريد أن تصيب السنة اليوم فاقصر الخطبة وعجل الوقوف‏.‏ فقال ابن عمر صدق‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عمرو، حدثنا محمد بن جبير بن مطعم، عن أبيه، كنت أطلب بعيرا لي‏.‏ وحدثنا مسدد، حدثنا سفيان، عن عمرو، سمع محمد بن جبير، عن أبيه، جبير بن مطعم قال أضللت بعيرا لي، فذهبت أطلبه يوم عرفة، فرأيت النبي صلى الله عليه وسلم واقفا بعرفة، فقلت هذا والله من الحمس فما شأنه ها هنا",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "حدثنا فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام بن عروة، قال عروة كان الناس يطوفون في الجاهلية عراة إلا الحمس، والحمس قريش وما ولدت، وكانت الحمس يحتسبون على الناس يعطي الرجل الرجل الثياب يطوف فيها، وتعطي المرأة المرأة الثياب تطوف فيها، فمن لم يعطه الحمس طاف بالبيت عريانا، وكان يفيض جماعة الناس من عرفات، ويفيض الحمس من جمع‏.‏ قال وأخبرني أبي عن عائشة ـ رضى الله عنها ـ أن هذه الآية نزلت في الحمس ‏{‏ثم أفيضوا من حيث أفاض الناس‏}‏ قال كانوا يفيضون من جمع فدفعوا إلى عرفات‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن هشام بن عروة، عن أبيه، أنه قال سئل أسامة وأنا جالس، كيف كان رسول الله صلى الله عليه وسلم يسير في حجة الوداع حين دفع قال كان يسير العنق، فإذا وجد فجوة نص‏.‏ قال هشام والنص فوق العنق‏.‏ قال أبو عبد الله فجوة متسع، والجميع فجوات وفجاء، وكذلك ركوة وركاء‏.‏ مناص ليس حين فرار‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "حدثنا مسدد، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن موسى بن عقبة، عن كريب، مولى ابن عباس عن أسامة بن زيد ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم حيث أفاض من عرفة مال إلى الشعب فقضى حاجته فتوضأ فقلت يا رسول الله أتصلي فقال ‏ \"‏ الصلاة أمامك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، قال كان عبد الله بن عمر ـ رضى الله عنهما ـ يجمع بين المغرب والعشاء بجمع، غير أنه يمر بالشعب الذي أخذه رسول الله صلى الله عليه وسلم فيدخل فينتفض ويتوضأ، ولا يصلي حتى يصلي بجمع‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1671,
			"arabicnumber": 1671,
			"text": "حدثنا سعيد بن أبي مريم، حدثنا إبراهيم بن سويد، حدثني عمرو بن أبي عمرو، مولى المطلب أخبرني سعيد بن جبير، مولى والبة الكوفي حدثني ابن عباس ـ رضى الله عنهما ـ أنه دفع مع النبي صلى الله عليه وسلم يوم عرفة فسمع النبي صلى الله عليه وسلم وراءه زجرا شديدا وضربا وصوتا للإبل فأشار بسوطه إليهم وقال ‏ \"‏ أيها الناس عليكم بالسكينة، فإن البر ليس بالإيضاع ‏\"‏‏.‏ أوضعوا أسرعوا‏.‏ خلالكم من التخلل بينكم، وفجرنا خلالهما‏.‏ بينهما‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": 1672,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن موسى بن عقبة، عن كريب، عن أسامة بن زيد ـ رضى الله عنهما ـ أنه سمعه يقول دفع رسول الله صلى الله عليه وسلم من عرفة، فنزل الشعب، فبال ثم توضأ، ولم يسبغ الوضوء‏.‏ فقلت له الصلاة‏.‏ فقال ‏ \"‏ الصلاة أمامك ‏\"‏‏.‏ فجاء المزدلفة، فتوضأ، فأسبغ، ثم أقيمت الصلاة، فصلى المغرب، ثم أناخ كل إنسان بعيره في منزله، ثم أقيمت الصلاة فصلى، ولم يصل بينهما‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": 1673,
			"text": "حدثنا آدم، حدثنا ابن أبي ذئب، عن الزهري، عن سالم بن عبد الله، عن ابن عمر ـ رضى الله عنهما ـ قال جمع النبي صلى الله عليه وسلم بين المغرب والعشاء بجمع، كل واحدة منهما بإقامة، ولم يسبح بينهما ولا على إثر كل واحدة منهما‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": 1674,
			"text": "حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، حدثنا يحيى بن سعيد، قال أخبرني عدي بن ثابت، قال حدثني عبد الله بن يزيد الخطمي، قال حدثني أبو أيوب الأنصاري، أن رسول الله صلى الله عليه وسلم جمع في حجة الوداع المغرب والعشاء بالمزدلفة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": 1675,
			"text": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت عبد الرحمن بن يزيد، يقول حج عبد الله ـ رضى الله عنه ـ فأتينا المزدلفة حين الأذان بالعتمة، أو قريبا من ذلك، فأمر رجلا فأذن وأقام، ثم صلى المغرب، وصلى بعدها ركعتين، ثم دعا بعشائه فتعشى، ثم أمر ـ أرى رجلا ـ فأذن وأقام ـ قال عمرو لا أعلم الشك إلا من زهير ـ ثم صلى العشاء ركعتين، فلما طلع الفجر قال إن النبي صلى الله عليه وسلم كان لا يصلي هذه الساعة إلا هذه الصلاة، في هذا المكان، من هذا اليوم‏.‏ قال عبد الله هما صلاتان تحولان عن وقتهما صلاة المغرب بعد ما يأتي الناس المزدلفة، والفجر حين يبزغ الفجر‏.‏ قال رأيت النبي صلى الله عليه وسلم يفعله‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": 1676,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن يونس، عن ابن شهاب، قال سالم وكان عبد الله بن عمر ـ رضى الله عنهما ـ يقدم ضعفة أهله، فيقفون عند المشعر الحرام بالمزدلفة بليل، فيذكرون الله ما بدا لهم، ثم يرجعون قبل أن يقف الإمام، وقبل أن يدفع، فمنهم من يقدم منى لصلاة الفجر، ومنهم من يقدم بعد ذلك، فإذا قدموا رموا الجمرة، وكان ابن عمر ـ رضى الله عنهما ـ يقول أرخص في أولئك رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": 1677,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال بعثني رسول الله صلى الله عليه وسلم من جمع بليل‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": 1678,
			"text": "حدثنا علي، حدثنا سفيان، قال أخبرني عبيد الله بن أبي يزيد، سمع ابن عباس ـ رضى الله عنهما ـ يقول أنا ممن، قدم النبي صلى الله عليه وسلم ليلة المزدلفة في ضعفة أهله‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": 1679,
			"text": "حدثنا مسدد، عن يحيى، عن ابن جريج، قال حدثني عبد الله، مولى أسماء عن أسماء، أنها نزلت ليلة جمع عند المزدلفة، فقامت تصلي، فصلت ساعة، ثم قالت يا بنى هل غاب القمر قلت لا‏.‏ فصلت ساعة، ثم قالت هل غاب القمر قلت نعم‏.‏ قالت فارتحلوا‏.‏ فارتحلنا، ومضينا حتى رمت الجمرة، ثم رجعت فصلت الصبح في منزلها‏.‏ فقلت لها يا هنتاه ما أرانا إلا قد غلسنا‏.‏ قالت يا بنى، إن رسول الله صلى الله عليه وسلم أذن للظعن‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": 1680,
			"text": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا عبد الرحمن ـ هو ابن القاسم ـ عن القاسم، عن عائشة ـ رضى الله عنها ـ قالت استأذنت سودة النبي صلى الله عليه وسلم ليلة جمع وكانت ثقيلة ثبطة فأذن لها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": 1681,
			"text": "حدثنا أبو نعيم، حدثنا أفلح بن حميد، عن القاسم بن محمد، عن عائشة ـ رضى الله عنها ـ قالت نزلنا المزدلفة فاستأذنت النبي صلى الله عليه وسلم سودة أن تدفع قبل حطمة الناس، وكانت امرأة بطيئة، فأذن لها، فدفعت قبل حطمة الناس، وأقمنا حتى أصبحنا نحن، ثم دفعنا بدفعه، فلأن أكون استأذنت رسول الله صلى الله عليه وسلم كما استأذنت سودة أحب إلى من مفروح به‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": 1682,
			"text": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني عمارة، عن عبد الرحمن، عن عبد الله ـ رضى الله عنه ـ قال ما رأيت النبي صلى الله عليه وسلم صلى صلاة بغير ميقاتها إلا صلاتين جمع بين المغرب والعشاء، وصلى الفجر قبل ميقاتها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": 1683,
			"text": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن يزيد، قال خرجنا مع عبد الله ـ رضى الله عنه ـ إلى مكة، ثم قدمنا جمعا، فصلى الصلاتين، كل صلاة وحدها بأذان وإقامة، والعشاء بينهما، ثم صلى الفجر حين طلع الفجر، قائل يقول طلع الفجر‏.‏ وقائل يقول لم يطلع الفجر‏.‏ ثم قال إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن هاتين الصلاتين حولتا عن وقتهما في هذا المكان المغرب والعشاء، فلا يقدم الناس جمعا حتى يعتموا، وصلاة الفجر هذه الساعة ‏\"‏‏.‏ ثم وقف حتى أسفر، ثم قال لو أن أمير المؤمنين أفاض الآن أصاب السنة‏.‏ فما أدري أقوله كان أسرع أم دفع عثمان ـ رضى الله عنه ـ فلم يزل يلبي حتى رمى جمرة العقبة يوم النحر‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": 1684,
			"text": "حدثنا حجاج بن منهال، حدثنا شعبة، عن أبي إسحاق، سمعت عمرو بن ميمون، يقول شهدت عمر ـ رضى الله عنه ـ صلى بجمع الصبح، ثم وقف فقال إن المشركين كانوا لا يفيضون حتى تطلع الشمس، ويقولون أشرق ثبير‏.‏ وأن النبي صلى الله عليه وسلم خالفهم، ثم أفاض قبل أن تطلع الشمس‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": 1685,
			"text": "حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا ابن جريج، عن عطاء، عن ابن عباس ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم أردف الفضل، فأخبر الفضل أنه لم يزل يلبي حتى رمى الجمرة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": 1686,
			"text": "حدثنا زهير بن حرب، حدثنا وهب بن جرير، حدثنا أبي، عن يونس الأيلي، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس ـ رضى الله عنهما ـ أن أسامة بن زيد ـ رضى الله عنهما ـ كان ردف النبي صلى الله عليه وسلم من عرفة إلى المزدلفة، ثم أردف الفضل من المزدلفة إلى منى ـ قال ـ فكلاهما قالا لم يزل النبي صلى الله عليه وسلم يلبي حتى رمى جمرة العقبة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": 1688,
			"text": "حدثنا إسحاق بن منصور، أخبرنا النضر، أخبرنا شعبة، حدثنا أبو جمرة، قال سألت ابن عباس ـ رضى الله عنهما ـ عن المتعة، فأمرني بها، وسألته عن الهدى، فقال فيها جزور أو بقرة أو شاة أو شرك في دم قال وكأن ناسا كرهوها، فنمت فرأيت في المنام كأن إنسانا ينادي حج مبرور، ومتعة متقبلة‏.‏ فأتيت ابن عباس ـ رضى الله عنهما ـ فحدثته فقال الله أكبر سنة أبي القاسم صلى الله عليه وسلم قال وقال آدم ووهب بن جرير وغندر عن شعبة عمرة متقبلة، وحج مبرور‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم رأى رجلا يسوق بدنة فقال ‏\"‏ اركبها ‏\"‏‏.‏ فقال إنها بدنة‏.‏ فقال ‏\"‏ اركبها ‏\"‏‏.‏ قال إنها بدنة‏.‏ قال ‏\"‏ اركبها، ويلك ‏\"‏‏.‏ في الثالثة أو في الثانية‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": 1690,
			"text": "حدثنا مسلم بن إبراهيم، حدثنا هشام، وشعبة، قالا حدثنا قتادة، عن أنس ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم رأى رجلا يسوق بدنة، فقال ‏\"‏ اركبها ‏\"‏‏.‏ قال إنها بدنة‏.‏ قال ‏\"‏ اركبها ‏\"‏‏.‏ قال إنها بدنة‏.‏ قال ‏\"‏ اركبها ‏\"‏‏.‏ ثلاثا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": 1691,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن سالم بن عبد الله، أن ابن عمر ـ رضى الله عنهما ـ قال تمتع رسول الله صلى الله عليه وسلم في حجة الوداع بالعمرة إلى الحج، وأهدى فساق معه الهدى من ذي الحليفة، وبدأ رسول الله صلى الله عليه وسلم فأهل بالعمرة، ثم أهل بالحج، فتمتع الناس مع النبي صلى الله عليه وسلم بالعمرة إلى الحج، فكان من الناس من أهدى فساق الهدى، ومنهم من لم يهد، فلما قدم النبي صلى الله عليه وسلم مكة، قال للناس ‏ \"‏ من كان منكم أهدى فإنه لا يحل لشىء حرم منه حتى يقضي حجه، ومن لم يكن منكم أهدى فليطف بالبيت، وبالصفا والمروة، وليقصر، وليحلل، ثم ليهل بالحج، فمن لم يجد هديا فليصم ثلاثة أيام في الحج وسبعة إذا رجع إلى أهله ‏\"‏‏.‏ فطاف حين قدم مكة، واستلم الركن أول شىء، ثم خب ثلاثة أطواف، ومشى أربعا، فركع حين قضى طوافه بالبيت عند المقام ركعتين، ثم سلم، فانصرف فأتى الصفا فطاف بالصفا والمروة سبعة أطواف، ثم لم يحلل من شىء حرم منه حتى قضى حجه ونحر هديه يوم النحر، وأفاض فطاف بالبيت، ثم حل من كل شىء حرم منه، وفعل مثل ما فعل رسول الله صلى الله عليه وسلم من أهدى وساق الهدى من الناس‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": 1692,
			"text": "وعن عروة، أن عائشة ـ رضى الله عنها ـ أخبرته عن النبي صلى الله عليه وسلم في تمتعه بالعمرة إلى الحج فتمتع الناس معه بمثل الذي أخبرني سالم عن ابن عمر ـ رضى الله عنهما ـ عن رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": 1693,
			"text": "حدثنا أبو النعمان، حدثنا حماد، عن أيوب، عن نافع، قال قال عبد الله بن عبد الله بن عمر ـ رضى الله عنهم ـ لأبيه أقم، فإني لا آمنها أن ستصد عن البيت‏.‏ قال إذا أفعل كما فعل رسول الله صلى الله عليه وسلم وقد قال الله ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏ فأنا أشهدكم أني قد أوجبت على نفسي العمرة‏.‏ فأهل بالعمرة، قال ثم خرج حتى إذا كان بالبيداء أهل بالحج والعمرة، وقال ما شأن الحج والعمرة إلا واحد‏.‏ ثم اشترى الهدى من قديد، ثم قدم فطاف لهما طوافا واحدا، فلم يحل حتى حل منهما جميعا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": 1694,
			"text": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن عروة بن الزبير، عن المسور بن مخرمة، ومروان، قالا خرج النبي صلى الله عليه وسلم من المدينة زمن الحديبية في بضع عشرة مائة من أصحابه، حتى إذا كانوا بذي الحليفة قلد النبي صلى الله عليه وسلم الهدى وأشعر وأحرم بالعمرة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": 1696,
			"text": "حدثنا أبو نعيم، حدثنا أفلح، عن القاسم، عن عائشة ـ رضى الله عنها ـ قالت فتلت قلائد بدن النبي صلى الله عليه وسلم بيدى، ثم قلدها وأشعرها وأهداها، فما حرم عليه شىء كان أحل له‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": 1697,
			"text": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، عن حفصة، رضى الله عنهم قالت قلت يا رسول الله ما شأن الناس حلوا ولم تحلل أنت قال ‏ \"‏ إني لبدت رأسي، وقلدت هديي، فلا أحل حتى أحل من الحج ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": 1698,
			"text": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثنا ابن شهاب، عن عروة، وعن عمرة بنت عبد الرحمن، أن عائشة ـ رضى الله عنها ـ قالت كان رسول الله صلى الله عليه وسلم يهدي من المدينة، فأفتل قلائد هديه، ثم لا يجتنب شيئا مما يجتنبه المحرم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": 1699,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا أفلح بن حميد، عن القاسم، عن عائشة ـ رضى الله عنها ـ قالت فتلت قلائد هدى النبي صلى الله عليه وسلم ثم أشعرها وقلدها ـ أو قلدتها ـ ثم بعث بها إلى البيت، وأقام بالمدينة، فما حرم عليه شىء كان له حل‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": 1700,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر بن عمرو بن حزم، عن عمرة بنت عبد الرحمن، أنها أخبرته أن زياد بن أبي سفيان كتب إلى عائشة ـ رضى الله عنها ـ إن عبد الله بن عباس ـ رضى الله عنهما ـ قال من أهدى هديا حرم عليه ما يحرم على الحاج حتى ينحر هديه‏.‏ قالت عمرة فقالت عائشة ـ رضى الله عنها ـ ليس كما قال ابن عباس، أنا فتلت قلائد هدى رسول الله صلى الله عليه وسلم بيدى، ثم قلدها رسول الله صلى الله عليه وسلم بيديه، ثم بعث بها مع أبي فلم يحرم على رسول الله صلى الله عليه وسلم شىء أحله الله حتى نحر الهدى‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1701,
			"arabicnumber": 1701,
			"text": "حدثنا أبو نعيم، حدثنا الأعمش، عن إبراهيم، عن الأسود، عن عائشة ـ رضى الله عنها ـ قالت أهدى النبي صلى الله عليه وسلم مرة غنما‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1702,
			"arabicnumber": 1702,
			"text": "حدثنا أبو النعمان، حدثنا عبد الواحد، حدثنا الأعمش، حدثنا إبراهيم، عن الأسود، عن عائشة ـ رضى الله عنها ـ قالت كنت أفتل القلائد للنبي صلى الله عليه وسلم فيقلد الغنم، ويقيم في أهله حلالا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1703,
			"arabicnumber": 1703,
			"text": "حدثنا أبو النعمان، حدثنا حماد، حدثنا منصور بن المعتمر،‏.‏ وحدثنا محمد بن كثير، أخبرنا سفيان، عن منصور، عن إبراهيم، عن الأسود، عن عائشة ـ رضى الله عنها ـ قالت كنت أفتل قلائد الغنم للنبي صلى الله عليه وسلم فيبعث بها، ثم يمكث حلالا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1704,
			"arabicnumber": 1704,
			"text": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، عن مسروق، عن عائشة ـ رضى الله عنها ـ قالت فتلت لهدى النبي صلى الله عليه وسلم ـ تعني القلائد ـ قبل أن يحرم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 1705,
			"arabicnumber": 1705,
			"text": "حدثنا عمرو بن علي، حدثنا معاذ بن معاذ، حدثنا ابن عون، عن القاسم، عن أم المؤمنين ـ رضى الله عنها ـ قالت فتلت قلائدها من عهن كان عندي‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 1706,
			"arabicnumber": 1706,
			"text": "حدثنا محمد، أخبرنا عبد الأعلى بن عبد الأعلى، عن معمر، عن يحيى بن أبي كثير، عن عكرمة، عن أبي هريرة ـ رضى الله عنه ـ أن نبي الله صلى الله عليه وسلم رأى رجلا يسوق بدنة، قال ‏\"‏ اركبها ‏\"‏‏.‏ قال إنها بدنة‏.‏ قال ‏\"‏ اركبها ‏\"‏‏.‏ قال فلقد رأيته راكبها يساير النبي صلى الله عليه وسلم والنعل في عنقها‏.‏ تابعه محمد بن بشار حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى، عن عكرمة، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 1707,
			"arabicnumber": 1707,
			"text": "حدثنا قبيصة، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي ـ رضى الله عنه ـ قال أمرني رسول الله صلى الله عليه وسلم أن أتصدق بجلال البدن التي نحرت وبجلودها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 1708,
			"arabicnumber": 1708,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، قال أراد ابن عمر ـ رضى الله عنهما ـ الحج عام حجة الحرورية في عهد ابن الزبير ـ رضى الله عنهما ـ فقيل له إن الناس كائن بينهم قتال، ونخاف أن يصدوك‏.‏ فقال ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏ إذا أصنع كما صنع، أشهدكم أني أوجبت عمرة‏.‏ حتى كان بظاهر البيداء قال ما شأن الحج والعمرة إلا واحد، أشهدكم أني جمعت حجة مع عمرة‏.‏ وأهدى هديا مقلدا اشتراه حتى قدم، فطاف بالبيت وبالصفا، ولم يزد على ذلك، ولم يحلل من شىء حرم منه حتى يوم النحر، فحلق ونحر ورأى أن قد قضى طوافه الحج والعمرة بطوافه الأول، ثم قال كذلك صنع النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 1709,
			"arabicnumber": 1709,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، قالت سمعت عائشة ـ رضى الله عنها ـ تقول خرجنا مع رسول الله صلى الله عليه وسلم لخمس بقين من ذي القعدة، لا نرى إلا الحج، فلما دنونا من مكة أمر رسول الله صلى الله عليه وسلم من لم يكن معه هدى، إذا طاف وسعى بين الصفا والمروة أن يحل، قالت فدخل علينا يوم النحر بلحم بقر‏.‏ فقلت ما هذا قال نحر رسول الله صلى الله عليه وسلم عن أزواجه‏.‏ قال يحيى فذكرته للقاسم، فقال أتتك بالحديث على وجهه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 1710,
			"arabicnumber": 1710,
			"text": "حدثنا إسحاق بن إبراهيم، سمع خالد بن الحارث، حدثنا عبيد الله بن عمر، عن نافع، أن عبد الله ـ رضى الله عنه ـ كان ينحر في المنحر‏.‏ قال عبيد الله منحر رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، حدثنا موسى بن عقبة، عن نافع، أن ابن عمر ـ رضى الله عنهما ـ كان يبعث بهديه من جمع من آخر الليل، حتى يدخل به منحر النبي صلى الله عليه وسلم مع حجاج فيهم الحر والمملوك‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "حدثنا سهل بن بكار، حدثنا وهيب، عن أيوب، عن أبي قلابة، عن أنس ـ وذكر الحديث ـ قال ونحر النبي صلى الله عليه وسلم بيده سبع بدن قياما، وضحى بالمدينة كبشين أملحين أقرنين‏.‏ مختصرا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا يزيد بن زريع، عن يونس، عن زياد بن جبير، قال رأيت ابن عمر ـ رضى الله عنهما ـ أتى على رجل، قد أناخ بدنته ينحرها، قال ابعثها قياما مقيدة، سنة محمد صلى الله عليه وسلم‏.‏ وقال شعبة عن يونس أخبرني زياد‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "حدثنا سهل بن بكار، حدثنا وهيب، عن أيوب، عن أبي قلابة، عن أنس ـ رضى الله عنه ـ قال صلى النبي صلى الله عليه وسلم الظهر بالمدينة أربعا، والعصر بذي الحليفة ركعتين، فبات بها، فلما أصبح ركب راحلته، فجعل يهلل ويسبح، فلما علا على البيداء لبى بهما جميعا، فلما دخل مكة أمرهم أن يحلوا‏.‏ ونحر النبي صلى الله عليه وسلم بيده سبع بدن قياما، وضحى بالمدينة كبشين أملحين أقرنين‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "حدثنا مسدد، حدثنا إسماعيل، عن أيوب، عن أبي قلابة، عن أنس بن مالك ـ رضى الله عنه ـ قال صلى النبي صلى الله عليه وسلم الظهر بالمدينة أربعا، والعصر بذي الحليفة ركعتين‏.‏ وعن أيوب عن رجل عن أنس ـ رضى الله عنه ـ ثم بات حتى أصبح، فصلى الصبح، ثم ركب راحلته حتى إذا استوت به البيداء أهل بعمرة وحجة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "حدثنا محمد بن كثير، أخبرنا سفيان، قال أخبرني ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي ـ رضى الله عنه ـ قال بعثني النبي صلى الله عليه وسلم فقمت على البدن، فأمرني فقسمت لحومها، ثم أمرني فقسمت جلالها وجلودها‏.‏ قال سفيان وحدثني عبد الكريم، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي ـ رضى الله عنه ـ قال أمرني النبي صلى الله عليه وسلم أن أقوم على البدن، ولا أعطي عليها شيئا في جزارتها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "حدثنا مسدد، حدثنا يحيى، عن ابن جريج، قال أخبرني الحسن بن مسلم، وعبد الكريم الجزري، أن مجاهدا، أخبرهما أن عبد الرحمن بن أبي ليلى أخبره أن عليا ـ رضى الله عنه ـ أخبره أن النبي صلى الله عليه وسلم أمره أن يقوم على بدنه، وأن يقسم بدنه كلها، لحومها وجلودها وجلالها، ولا يعطي في جزارتها شيئا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "حدثنا أبو نعيم، حدثنا سيف بن أبي سليمان، قال سمعت مجاهدا، يقول حدثني ابن أبي ليلى، أن عليا ـ رضى الله عنه ـ حدثه قال أهدى النبي صلى الله عليه وسلم مائة بدنة، فأمرني بلحومها فقسمتها، ثم أمرني بجلالها فقسمتها، ثم بجلودها فقسمتها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "حدثنا مسدد، حدثنا يحيى، عن ابن جريج، حدثنا عطاء، سمع جابر بن عبد الله ـ رضى الله عنهما ـ يقول كنا لا نأكل من لحوم بدننا فوق ثلاث منى، فرخص لنا النبي صلى الله عليه وسلم فقال ‏ \"‏ كلوا وتزودوا ‏\"‏‏.‏ فأكلنا وتزودنا‏.‏ قلت لعطاء أقال حتى جئنا المدينة قال لا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني يحيى، قال حدثتني عمرة، قالت سمعت عائشة ـ رضى الله عنها ـ تقول خرجنا مع رسول الله صلى الله عليه وسلم لخمس بقين من ذي القعدة، ولا نرى إلا الحج، حتى إذا دنونا من مكة أمر رسول الله صلى الله عليه وسلم من لم يكن معه هدى إذا طاف بالبيت ثم يحل‏.‏ قالت عائشة ـ رضى الله عنها ـ فدخل علينا يوم النحر بلحم بقر فقلت ما هذا فقيل ذبح النبي صلى الله عليه وسلم عن أزواجه‏.‏ قال يحيى فذكرت هذا الحديث للقاسم‏.‏ فقال أتتك بالحديث على وجهه‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "حدثنا محمد بن عبد الله بن حوشب، حدثنا هشيم، أخبرنا منصور، عن عطاء، عن ابن عباس ـ رضى الله عنهما ـ قال سئل النبي صلى الله عليه وسلم عمن حلق قبل أن يذبح ونحوه‏.‏ فقال ‏ \"‏ لا حرج، لا حرج ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "حدثنا أحمد بن يونس، أخبرنا أبو بكر، عن عبد العزيز بن رفيع، عن عطاء، عن ابن عباس ـ رضى الله عنهما ـ قال رجل للنبي صلى الله عليه وسلم زرت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال حلقت قبل أن أذبح‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال ذبحت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ وقال عبد الرحيم الرازي عن ابن خثيم أخبرني عطاء عن ابن عباس ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم‏.‏ وقال القاسم بن يحيى حدثني ابن خثيم عن عطاء عن ابن عباس ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم‏.‏ وقال عفان أراه عن وهيب، حدثنا ابن خثيم، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم‏.‏ وقال حماد عن قيس بن سعد وعباد بن منصور عن عطاء عن جابر ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "حدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا خالد، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال سئل النبي صلى الله عليه وسلم فقال رميت بعد ما أمسيت‏.‏ فقال ‏\"‏ لا حرج ‏\"‏‏.‏ قال حلقت قبل أن أنحر‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "حدثنا عبدان، قال أخبرني أبي، عن شعبة، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى ـ رضى الله عنه ـ قال قدمت على رسول الله صلى الله عليه وسلم وهو بالبطحاء‏.‏ فقال ‏\"‏ أحججت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ بما أهللت ‏\"‏‏.‏ قلت لبيك بإهلال كإهلال النبي صلى الله عليه وسلم‏.‏ قال ‏\"‏ أحسنت، انطلق فطف بالبيت وبالصفا والمروة ‏\"‏‏.‏ ثم أتيت امرأة من نساء بني قيس، ففلت رأسي، ثم أهللت بالحج، فكنت أفتي به الناس، حتى خلافة عمر ـ رضى الله عنه ـ فذكرته له‏.‏ فقال إن نأخذ بكتاب الله فإنه يأمرنا بالتمام، وإن نأخذ بسنة رسول الله صلى الله عليه وسلم فإن رسول الله صلى الله عليه وسلم لم يحل حتى بلغ الهدى محله‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن ابن عمر، عن حفصة ـ رضى الله عنهم ـ أنها قالت يا رسول الله، ما شأن الناس حلوا بعمرة ولم تحلل أنت من عمرتك قال ‏ \"‏ إني لبدت رأسي، وقلدت هديي، فلا أحل حتى أنحر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب بن أبي حمزة، قال نافع كان ابن عمر ـ رضى الله عنهما ـ يقول حلق رسول الله صلى الله عليه وسلم في حجته‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم ارحم المحلقين ‏\"‏‏.‏ قالوا والمقصرين يا رسول الله قال ‏\"‏ اللهم ارحم المحلقين ‏\"‏‏.‏ قالوا والمقصرين يا رسول الله قال ‏\"‏ والمقصرين ‏\"‏‏.‏ وقال الليث حدثني نافع ‏\"‏ رحم الله المحلقين ‏\"‏ مرة أو مرتين‏.‏ قال وقال عبيد الله حدثني نافع وقال في الرابعة ‏\"‏ والمقصرين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "حدثنا عياش بن الوليد، حدثنا محمد بن فضيل، حدثنا عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اغفر للمحلقين ‏\"‏‏.‏ قالوا وللمقصرين‏.‏ قال ‏\"‏ اللهم اغفر للمحلقين ‏\"‏‏.‏ قالوا وللمقصرين‏.‏ قالها ثلاثا‏.‏ قال ‏\"‏ وللمقصرين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية بن أسماء، عن نافع، أن عبد الله، قال حلق النبي صلى الله عليه وسلم وطائفة من أصحابه، وقصر بعضهم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 1730,
			"arabicnumber": 1730,
			"text": "حدثنا أبو عاصم، عن ابن جريج، عن الحسن بن مسلم، عن طاوس، عن ابن عباس، عن معاوية ـ رضى الله عنهم ـ قال قصرت عن رسول الله صلى الله عليه وسلم بمشقص‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": 1731,
			"text": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني كريب، عن ابن عباس ـ رضى الله عنهما ـ قال لما قدم النبي صلى الله عليه وسلم مكة أمر أصحابه أن يطوفوا بالبيت، وبالصفا والمروة، ثم يحلوا، ويحلقوا أو يقصروا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": 1732,
			"text": "وقال لنا أبو نعيم حدثنا سفيان، عن عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أنه طاف طوافا واحدا، ثم يقيل ثم يأتي منى ـ يعني يوم النحر ـ‏.‏ ورفعه عبد الرزاق أخبرنا عبيد الله‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": 1733,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن جعفر بن ربيعة، عن الأعرج، قال حدثني أبو سلمة بن عبد الرحمن، أن عائشة ـ رضى الله عنها ـ قالت حججنا مع النبي صلى الله عليه وسلم فأفضنا يوم النحر، فحاضت صفية، فأراد النبي صلى الله عليه وسلم منها ما يريد الرجل من أهله‏.‏ فقلت يا رسول الله إنها حائض‏.‏ قال ‏\"‏ حابستنا هي ‏\"‏‏.‏ قالوا يا رسول الله، أفاضت يوم النحر‏.‏ قال ‏\"‏ اخرجوا ‏\"‏‏.‏ ويذكر عن القاسم وعروة والأسود عن عائشة ـ رضى الله عنها ـ أفاضت صفية يوم النحر‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": 1734,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم قيل له في الذبح والحلق والرمى والتقديم والتأخير فقال ‏ \"‏ لا حرج ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": 1735,
			"text": "حدثنا علي بن عبد الله، حدثنا يزيد بن زريع، حدثنا خالد، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال كان النبي صلى الله عليه وسلم يسأل يوم النحر بمنى، فيقول ‏\"‏ لا حرج ‏\"‏‏.‏ فسأله رجل، فقال حلقت قبل أن أذبح‏.‏ قال ‏\"‏ اذبح، ولا حرج ‏\"‏‏.‏ وقال رميت بعد ما أمسيت‏.‏ فقال ‏\"‏ لا حرج ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": 1736,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عيسى بن طلحة، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم وقف في حجة الوداع، فجعلوا يسألونه، فقال رجل لم أشعر فحلقت قبل أن أذبح‏.‏ قال ‏\"‏ اذبح ولا حرج ‏\"‏‏.‏ فجاء آخر فقال لم أشعر فنحرت قبل أن أرمي‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏‏.‏ فما سئل يومئذ عن شىء قدم ولا أخر إلا قال افعل ولا حرج‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": 1737,
			"text": "حدثنا سعيد بن يحيى بن سعيد، حدثنا أبي، حدثنا ابن جريج، حدثني الزهري، عن عيسى بن طلحة، عن عبد الله بن عمرو بن العاص ـ رضى الله عنه ـ حدثه أنه، شهد النبي صلى الله عليه وسلم يخطب يوم النحر، فقام إليه رجل، فقال كنت أحسب أن كذا قبل كذا‏.‏ ثم قام آخر فقال كنت أحسب أن كذا قبل كذا حلقت قبل أن أنحر، نحرت قبل أن أرمي‏.‏ وأشباه ذلك‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ افعل ولا حرج ‏\"‏‏.‏ لهن كلهن، فما سئل يومئذ عن شىء إلا قال افعل ولا حرج‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": 1738,
			"text": "حدثنا إسحاق، قال أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، حدثني عيسى بن طلحة بن عبيد الله، أنه سمع عبد الله بن عمرو بن العاص ـ رضى الله عنهما ـ قال وقف رسول الله صلى الله عليه وسلم على ناقته‏.‏ فذكر الحديث‏.‏ تابعه معمر عن الزهري‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": 1739,
			"text": "حدثنا علي بن عبد الله، حدثني يحيى بن سعيد، حدثنا فضيل بن غزوان، حدثنا عكرمة، عن ابن عباس ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم خطب الناس يوم النحر فقال ‏\"‏ يا أيها الناس‏.‏ أى يوم هذا ‏\"‏‏.‏ قالوا يوم حرام‏.‏ قال ‏\"‏ فأى بلد هذا ‏\"‏‏.‏ قالوا بلد حرام‏.‏ قال ‏\"‏ فأى شهر هذا ‏\"‏‏.‏ قالوا شهر حرام‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم عليكم حرام، كحرمة يومكم هذا، في بلدكم هذا في شهركم هذا ‏\"‏‏.‏ فأعادها مرارا، ثم رفع رأسه فقال ‏\"‏ اللهم هل بلغت اللهم هل بلغت ‏\"‏‏.‏ قال ابن عباس ـ رضى الله عنهما ـ فوالذي نفسي بيده إنها لوصيته إلى أمته ـ ‏\"‏ فليبلغ الشاهد الغائب، لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": 1740,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني عمرو، قال سمعت جابر بن زيد، قال سمعت ابن عباس ـ رضى الله عنهما ـ قال سمعت النبي صلى الله عليه وسلم يخطب بعرفات‏.‏ تابعه ابن عيينة عن عمرو‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": 1741,
			"text": "حدثني عبد الله بن محمد، حدثنا أبو عامر، حدثنا قرة، عن محمد بن سيرين، قال أخبرني عبد الرحمن بن أبي بكرة، عن أبي بكرة،، ورجل، أفضل في نفسي من عبد الرحمن حميد بن عبد الرحمن عن أبي بكرة ـ رضى الله عنه ـ قال خطبنا النبي صلى الله عليه وسلم يوم النحر، قال ‏\"‏ أتدرون أى يوم هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى شهر هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ فقال ‏\"‏ أليس ذو الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى بلد هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليست بالبلدة الحرام ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم عليكم حرام، كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا، إلى يوم تلقون ربكم‏.‏ ألا هل بلغت ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ اللهم اشهد، فليبلغ الشاهد الغائب، فرب مبلغ أوعى من سامع، فلا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": 1742,
			"text": "حدثنا محمد بن المثنى، حدثنا يزيد بن هارون، أخبرنا عاصم بن محمد بن زيد، عن أبيه، عن ابن عمر ـ رضى الله عنهما ـ قال قال النبي صلى الله عليه وسلم بمنى ‏\"‏ أتدرون أى يوم هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ فقال ‏\"‏ فإن هذا يوم حرام، أفتدرون أى بلد هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ بلد حرام، أفتدرون أى شهر هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ شهر حرام ـ قال ـ فإن الله حرم عليكم دماءكم وأموالكم وأعراضكم، كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا ‏\"‏‏.‏ وقال هشام بن الغاز أخبرني نافع عن ابن عمر ـ رضى الله عنهما ـ وقف النبي صلى الله عليه وسلم يوم النحر بين الجمرات في الحجة التي حج بهذا، وقال ‏\"‏ هذا يوم الحج الأكبر ‏\"‏، فطفق النبي صلى الله عليه وسلم يقول ‏\"‏ اللهم اشهد ‏\"‏‏.‏ وودع الناس‏.‏ فقالوا هذه حجة الوداع‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": 1743,
			"text": "حدثنا محمد بن عبيد بن ميمون، حدثنا عيسى بن يونس، عن عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ رخص النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": 1744,
			"text": "حدثنا يحيى بن موسى، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم أذن‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": 1745,
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبيد الله، قال حدثني نافع، عن ابن عمر ـ رضى الله عنهما ـ أن العباس ـ رضى الله عنه ـ استأذن النبي صلى الله عليه وسلم ليبيت بمكة ليالي منى، من أجل سقايته، فأذن له‏.‏ تابعه أبو أسامة وعقبة بن خالد وأبو ضمرة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": 1746,
			"text": "حدثنا أبو نعيم، حدثنا مسعر، عن وبرة، قال سألت ابن عمر ـ رضى الله عنهما ـ متى أرمي الجمار قال إذا رمى إمامك فارمه‏.‏ فأعدت عليه المسألة، قال كنا نتحين، فإذا زالت الشمس رمينا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 1747,
			"arabicnumber": 1747,
			"text": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، قال رمى عبد الله من بطن الوادي، فقلت يا أبا عبد الرحمن، إن ناسا يرمونها من فوقها، فقال والذي لا إله غيره هذا مقام الذي أنزلت عليه سورة البقرة صلى الله عليه وسلم‏.‏ وقال عبد الله بن الوليد حدثنا سفيان حدثنا الأعمش بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 1748,
			"arabicnumber": 1748,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، عن الحكم، عن إبراهيم، عن عبد الرحمن بن يزيد، عن ع��د الله ـ رضى الله عنه ـ أنه انتهى إلى الجمرة الكبرى جعل البيت عن يساره، ومنى عن يمينه، ورمى بسبع، وقال هكذا رمى الذي أنزلت عليه سورة البقرة صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 1749,
			"arabicnumber": 1749,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا الحكم، عن إبراهيم، عن عبد الرحمن بن يزيد، أنه حج مع ابن مسعود ـ رضى الله عنه ـ فرآه يرمي الجمرة الكبرى بسبع حصيات، فجعل البيت عن يساره، ومنى عن يمينه، ثم قال هذا مقام الذي أنزلت عليه سورة البقرة‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 1750,
			"arabicnumber": 1750,
			"text": "حدثنا مسدد، عن عبد الواحد، حدثنا الأعمش، قال سمعت الحجاج، يقول على المنبر السورة التي يذكر فيها البقرة، والسورة التي يذكر فيها آل عمران، والسورة التي يذكر فيها النساء‏.‏ قال فذكرت ذلك لإبراهيم، فقال حدثني عبد الرحمن بن يزيد أنه كان مع ابن مسعود ـ رضى الله عنه ـ حين رمى جمرة العقبة، فاستبطن الوادي، حتى إذا حاذى بالشجرة اعترضها، فرمى بسبع حصيات، يكبر مع كل حصاة، ثم قال من ها هنا والذي لا إله غيره قام الذي أنزلت عليه سورة البقرة صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 1751,
			"arabicnumber": 1751,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا طلحة بن يحيى، حدثنا يونس، عن الزهري، عن سالم، عن ابن عمر ـ رضى الله عنهما ـ أنه كان يرمي الجمرة الدنيا بسبع حصيات، يكبر على إثر كل حصاة، ثم يتقدم حتى يسهل فيقوم مستقبل القبلة فيقوم طويلا، ويدعو ويرفع يديه، ثم يرمي الوسطى، ثم يأخذ ذات الشمال فيستهل ويقوم مستقبل القبلة فيقوم طويلا ويدعو ويرفع يديه، ويقوم طويلا، ثم يرمي جمرة ذات العقبة من بطن الوادي، ولا يقف عندها ثم ينصرف فيقول هكذا رأيت النبي صلى الله عليه وسلم يفعله‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 1752,
			"arabicnumber": 1752,
			"text": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن يونس بن يزيد، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن عمر ـ رضى الله عنهما ـ كان يرمي الجمرة الدنيا بسبع حصيات، ثم يكبر على إثر كل حصاة، ثم يتقدم فيسهل، فيقوم مستقبل القبلة قياما طويلا، فيدعو ويرفع يديه، ثم يرمي الجمرة الوسطى كذلك، فيأخذ ذات الشمال فيسهل، ويقوم مستقبل القبلة قياما طويلا، فيدعو ويرفع يديه، ثم يرمي الجمرة ذات العقبة من بطن الوادي، ولا يقف عندها، ويقول هكذا رأيت رسول الله صلى الله عليه وسلم يفعل‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 1753,
			"arabicnumber": 1753,
			"text": "وقال محمد حدثنا عثمان بن عمر، أخبرنا يونس، عن الزهري، أن رسول الله صلى الله عليه وسلم كان إذا رمى الجمرة التي تلي مسجد منى يرميها بسبع حصيات، يكبر كلما رمى بحصاة، ثم تقدم أمامها فوقف مستقبل القبلة رافعا يديه يدعو، وكان يطيل الوقوف، ثم يأتي الجمرة الثانية، فيرميها بسبع حصيات، يكبر كلما رمى بحصاة، ثم ينحدر ذات اليسار مما يلي الوادي، فيقف مستقبل القبلة رافعا يديه يدعو، ثم يأتي الجمرة التي عند العقبة فيرميها بسبع حصيات، يكبر عند كل حصاة، ثم ينصرف ولا يقف عندها‏.‏ قال الزهري سمعت سالم بن عبد الله يحدث مثل هذا عن أبيه عن النبي صلى الله عليه وسلم وكان ابن عمر يفعله‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 1754,
			"arabicnumber": 1754,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عبد الرحمن بن القاسم، أنه سمع أباه ـ وكان أفضل أهل زمانه ـ يقول سمعت عائشة ـ رضى الله عنها ـ تقول طيبت رسول الله صلى الله عليه وسلم بيدى هاتين حين أحرم، ولحله حين أحل، قبل أن يطوف‏.‏ وبسطت يديها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 1755,
			"arabicnumber": 1755,
			"text": "حدثنا مسدد، حدثنا سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس ـ رضى الله عنهما ـ قال أمر الناس أن يكون آخر عهدهم بالبيت، إلا أنه خفف عن الحائض‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "حدثنا أصبغ بن الفرج، أخبرنا ابن وهب، عن عمرو بن الحارث، عن قتادة، أن أنس بن مالك ـ رضى الله عنه ـ حدثه أن النبي صلى الله عليه وسلم صلى الظهر والعصر، والمغرب والعشاء، ثم رقد رقدة بالمحصب، ثم ركب إلى البيت فطاف به‏.‏ تابعه الليث حدثني خالد، عن سعيد، عن قتادة، أن أنس بن مالك ـ رضى الله عنه ـ حدثه عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة ـ رضى الله عنها ـ أن صفية بنت حيى، زوج النبي صلى الله عليه وسلم حاضت، فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ أحابستنا هي ‏\"‏‏.‏ قالوا إنها قد أفاضت‏.‏ قال ‏\"‏ فلا إذا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"text": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن منصور، عن إبراهيم، عن الأسود، عن عائشة ـ رضى الله عنها ـ قالت خرجنا مع النبي صلى الله عليه وسلم ولا نرى إلا الحج، فقدم النبي صلى الله عليه وسلم فطاف بالبيت وبين الصفا والمروة، ولم يحل وكان معه الهدى، فطاف من كان معه من نسائه وأصحابه، وحل منهم من لم يكن معه الهدى، فحاضت هي، فنسكنا مناسكنا من حجنا، فلما كان ليلة الحصبة ليلة النفر، قالت يا رسول الله كل أصحابك يرجع بحج وعمرة غيري‏.‏ قال ‏\"‏ ما كنت تطوفي بالبيت ليالي قدمنا ‏\"‏‏.‏ قلت لا‏.‏ قال ‏\"‏ فاخرجي مع أخيك إلى التنعيم فأهلي بعمرة، وموعدك مكان كذا وكذا ‏\"‏‏.‏ فخرجت مع عبد الرحمن إلى التنعيم، فأهللت بعمرة، وحاضت صفية بنت حيى، فقال النبي صلى الله عليه وسلم ‏\"‏ عقرى حلقى، إنك لحابستنا، أما كنت طفت يوم النحر ‏\"‏‏.‏ قالت بلى‏.‏ قال ‏\"‏ فلا بأس‏.‏ انفري ‏\"‏‏.‏ فلقيته مصعدا على أهل مكة، وأنا منهبطة، أو أنا مصعدة، وهو منهبط‏.‏ وقال مسدد قلت لا‏.‏ تابعه جرير عن منصور في قوله لا‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 1763,
			"arabicnumber": 1763,
			"text": "حدثنا محمد بن المثنى، حدثنا إسحاق بن يوسف، حدثنا سفيان الثوري، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك أخبرني بشىء، عقلته عن النبي صلى الله عليه وسلم أين صلى الظهر يوم التروية قال بمنى‏.‏ قلت فأين صلى العصر يوم النفر قال بالأبطح‏.‏ افعل كما يفعل أمراؤك‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": 1764,
			"text": "حدثنا عبد المتعال بن طالب، حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، أن قتادة، حدثه عن أنس بن مالك ـ رضى الله عنه ـ حدثه عن النبي صلى الله عليه وسلم أنه صلى الظهر والعصر، والمغرب والعشاء، ورقد رقدة بالمحصب، ثم ركب إلى البيت فطاف به‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": 1765,
			"text": "حدثنا أبو نعيم، حدثنا سفيان، عن هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت إنما كان منزل ينزله النبي صلى الله عليه وسلم ليكون أسمح لخروجه‏.‏ يعني بالأبطح‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": 1766,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال عمرو عن عطاء، عن ابن عباس ـ رضى الله عنهما ـ ليس التحصيب بشىء، إنما هو منزل نزله رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": 1767,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، أن ابن عمر ـ رضى الله عنهما ـ كان يبيت بذي طوى بين الثنيتين، ثم يدخل من الثنية التي بأعلى مكة، وكان إذا قدم مكة حاجا أو معتمرا لم ينخ ناقته إلا عند باب المسجد، ثم يدخل فيأتي الركن الأسود فيبدأ به، ثم يطوف سبعا ثلاثا سعيا، وأربعا مشيا، ثم ينصرف فيصلي سجدتين، ثم ينطلق قبل أن يرجع إلى منزله، فيطوف بين الصفا والمروة، وكان إذا صدر عن الحج أو العمرة أناخ بالبطحاء التي بذي الحليفة التي كان النبي صلى الله عليه وسلم ينيخ بها‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": 1768,
			"text": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، قال سئل عبيد الله عن المحصب، فحدثنا عبيد الله، عن نافع،، قال نزل بها رسول الله صلى الله عليه وسلم وعمر وابن عمر‏.‏ وعن نافع أن ابن عمر ـ رضى الله عنهما ـ كان يصلي بها ـ يعني المحصب ـ الظهر والعصر ـ أحسبه قال والمغرب‏.‏ قال خالد لا أشك في العشاء، ويهجع هجعة، ويذكر ذلك عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": 1769,
			"text": "وقال محمد بن عيسى حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أنه كان إذا أقبل بات بذي طوى، حتى إذا أصبح دخل، وإذا نفر مر بذي طوى وبات بها حتى يصبح، وكان يذكر أن النبي صلى الله عليه وسلم كان يفعل ذلك‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": 1770,
			"text": "حدثنا عثمان بن الهيثم، أخبرنا ابن جريج، قال عمرو بن دينار قال ابن عباس ـ رضى الله عنهما ـ كان ذو المجاز وعكاظ متجر الناس في الجاهلية، فلما جاء الإسلام كأنهم كرهوا ذلك حتى نزلت ‏{‏ليس عليكم جناح أن تبتغوا فضلا من ربكم‏}‏ في مواسم الحج‏.‏",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": 1772,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 247
			}
		}
	]
}