{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"26": "`Umrah (Minor pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1773,
			"arabicnumber": 1773,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن سمى، مولى أبي بكر بن عبد الرحمن عن أبي صالح السمان، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ العمرة إلى العمرة كفارة لما بينهما، والحج المبرور ليس له جزاء إلا الجنة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": 1774,
			"text": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا ابن جريج، أن عكرمة بن خالد، سأل ابن عمر ـ رضى الله عنهما ـ عن العمرة، قبل الحج فقال لا بأس‏.‏ قال عكرمة قال ابن عمر اعتمر النبي صلى الله عليه وسلم قبل أن يحج‏.‏ وقال إبراهيم بن سعد عن ابن إسحاق حدثني عكرمة بن خالد سألت ابن عمر مثله‏.‏ حدثنا عمرو بن علي، حدثنا أبو عاصم، أخبرنا ابن جريج، قال عكرمة بن خالد سألت ابن عمر ـ رضى الله عنه ـ مثله‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": 1776,
			"text": "",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": 1777,
			"text": "حدثنا أبو عاصم، أخبرنا ابن جريج، قال أخبرني عطاء، عن عروة بن الزبير، قال سألت عائشة ـ رضى الله عنها ـ قالت ما اعتمر رسول الله صلى الله عليه وسلم في رجب‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1778,
			"arabicnumber": 1778,
			"text": "حدثنا حسان بن حسان، حدثنا همام، عن قتادة، سألت أنسا ـ رضى الله عنه ـ كم اعتمر النبي صلى الله عليه وسلم قال أربع عمرة الحديبية في ذي القعدة، حيث صده المشركون، وعمرة من العام المقبل في ذي القعدة، حيث صالحهم، وعمرة الجعرانة إذ قسم غنيمة أراه حنين‏.‏ قلت كم حج قال واحدة‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": 1779,
			"text": "حدثنا أبو الوليد، هشام بن عبد الملك حدثنا همام، عن قتادة، قال سألت أنسا ـ رضى الله عنه ـ فقال اعتمر النبي صلى الله عليه وسلم حيث ردوه، ومن القابل عمرة الحديبية، وعمرة في ذي القعدة وعمرة مع حجته‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": 1780,
			"text": "حدثنا هدبة، حدثنا همام، وقال، اعتمر أربع عمر في ذي القعدة إلا التي اعتمر مع حجته عمرته من الحديبية، ومن العام المقبل، ومن الجعرانة، حيث قسم غنائم حنين، وعمرة مع حجته‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": 1781,
			"text": "حدثنا أحمد بن عثمان، حدثنا شريح بن مسلمة، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، قال سألت مسروقا وعطاء ومجاهدا‏.‏ فقالوا اعتمر رسول الله صلى الله عليه وسلم في ذي القعدة قبل أن يحج‏.‏ وقال سمعت البراء بن عازب ـ رضى الله عنهما ـ يقول اعتمر رسول الله صلى الله عليه وسلم في ذي القعدة، قبل أن يحج مرتين‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": 1782,
			"text": "حدثنا مسدد، حدثنا يحيى، عن ابن جريج، عن عطاء، قال سمعت ابن عباس ـ رضى الله عنهما ـ يخبرنا يقول قال رسول الله صلى الله عليه وسلم لامرأة من الأنصار سماها ابن عباس، فنسيت اسمها ‏\"‏ ما منعك أن تحجي معنا ‏\"‏‏.‏ قالت كان لنا ناضح فركبه أبو فلان وابنه ـ لزوجها وابنها ـ وترك ناضحا ننضح عليه قال ‏\"‏ فإذا كان رمضان اعتمري فيه فإن عمرة في رمضان حجة ‏\"‏‏.‏ أو نحوا مما قال‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "حدثنا محمد بن سلام، أخبرنا أبو معاوية، حدثنا هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ خرجنا مع رسول الله صلى الله عليه وسلم موافين لهلال ذي الحجة فقال لنا ‏\"‏ من أحب منكم أن يهل بالحج فليهل ومن أحب أن يهل بعمرة فليهل بعمرة، فلولا أني أهديت لأهللت بعمرة ‏\"‏‏.‏ قالت فمنا من أهل بعمرة، ومنا من أهل بحج، وكنت ممن أهل بعمرة، فأظلني يوم عرفة، وأنا حائض، فشكوت إلى النبي صلى الله عليه وسلم فقال ‏\"‏ ارفضي عمرتك، وانقضي رأسك وامتشطي، وأهلي بالحج ‏\"‏‏.‏ فلما كان ليلة الحصبة أرسل معي عبد الرحمن إلى التنعيم، فأهللت بعمرة مكان عمرتي‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو، سمع عمرو بن أوس، أن عبد الرحمن بن أبي بكر ـ رضى الله عنهما ـ أخبره أن النبي صلى الله عليه وسلم أمره أن يردف عائشة، ويعمرها من التنعيم‏.‏ قال سفيان مرة سمعت عمرا، كم سمعته من عمرو‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب بن عبد المجيد، عن حبيب المعلم، عن عطاء، حدثني جابر بن عبد الله ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم أهل وأصحابه بالحج وليس مع أحد منهم هدى، غير النبي صلى الله عليه وسلم وطلحة، وكان علي قدم من اليمن، ومعه الهدى فقال أهللت بما أهل به رسول الله صلى الله عليه وسلم‏.‏ وإن النبي صلى الله عليه وسلم أذن لأصحابه أن يجعلوها عمرة، يطوفوا بالبيت، ثم يقصروا ويحلوا، إلا من معه الهدى، فقالوا ننطلق إلى منى وذكر أحدنا يقطر فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ لو استقبلت من أمري ما استدبرت ما أهديت، ولولا أن معي الهدى لأحللت ‏\"‏‏.‏ وأن عائشة حاضت فنسكت المناسك كلها، غير أنها لم تطف بالبيت قال فلما طهرت وطافت، قالت يا رسول الله أتنطلقون بعمرة وحجة، وأنطلق بالحج فأمر عبد الرحمن بن أبي بكر أن يخرج معها إلى التنعيم، فاعتمرت بعد الحج في ذي الحجة، وأن سراقة بن مالك بن جعشم لقي النبي صلى الله عليه وسلم وهو بالعقبة، وهو يرميها، فقال ألكم هذه خاصة، يا رسول الله قال ‏\"‏ لا، بل للأبد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "حدثنا محمد بن المثنى، حدثنا يحيى، حدثنا هشام، قال أخبرني أبي قال، أخبرتني عائشة ـ رضى الله عنها ـ قالت خرجنا مع رسول الله صلى الله عليه وسلم موافين لهلال ذي الحجة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب أن يهل بعمرة فليهل، ومن أحب أن يهل بحجة فليهل، ولولا أني أهديت لأهللت بعمرة ‏\"‏‏.‏ فمنهم من أهل بعمرة، ومنهم من أهل بحجة، وكنت ممن أهل بعمرة، فحضت قبل أن أدخل مكة، فأدركني يوم عرفة، وأنا حائض، فشكوت إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ دعي عمرتك، وانقضي رأسك وامتشطي، وأهلي بالحج ‏\"‏‏.‏ ففعلت، فلما كانت ليلة الحصبة أرسل معي عبد الرحمن إلى التنعيم، فأردفها، فأهلت بعمرة مكان عمرتها، فقضى الله حجها وعمرتها، ولم يكن في شىء من ذلك هدى، ولا صدقة، ولا صوم‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا ابن عون، عن القاسم بن محمد، وعن ابن عون، عن إبراهيم، عن الأسود، قالا قالت عائشة ـ رضى الله عنها ـ يا رسول الله يصدر الناس بنسكين وأصدر بنسك فقيل لها ‏ \"‏ انتظري، فإذا طهرت فاخرجي إلى التنعيم، فأهلي ثم ائتينا بمكان كذا، ولكنها على قدر نفقتك، أو نصبك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "حدثنا أبو نعيم، حدثنا أفلح بن حميد، عن القاسم، عن عائشة ـ رضى الله عنها ـ قالت خرجنا مهلين بالحج في أشهر الحج، وحرم الحج، فنزلنا سرف، فقال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ من لم يكن معه هدى، فأحب أن يجعلها عمرة، فليفعل ومن كان معه هدى فلا ‏\"‏‏.‏ وكان مع النبي صلى الله عليه وسلم ورجال من أصحابه ذوي قوة الهدى، فلم تكن لهم عمرة، فدخل على النبي صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك ‏\"‏‏.‏ قلت سمعتك تقول لأصحابك ما قلت فمنعت العمرة‏.‏ قال ‏\"‏ وما شأنك ‏\"‏‏.‏ قلت لا أصلي‏.‏ قال ‏\"‏ فلا يضرك أنت من بنات آدم، كتب عليك ما كتب عليهن، فكوني في حجتك عسى الله أن يرزقكها ‏\"‏‏.‏ قالت فكنت حتى نفرنا من منى، فنزلنا المحصب فدعا عبد الرحمن، فقال ‏\"‏ اخرج بأختك الحرم، فلتهل بعمرة، ثم افرغا من طوافكما، أنتظركما ها هنا ‏\"‏‏.‏ فأتينا في جوف الليل‏.‏ فقال ‏\"‏ فرغتما ‏\"‏‏.‏ قلت نعم‏.‏ فنادى بالرحيل في أصحابه، فارتحل الناس، ومن طاف بالبيت، قبل صلاة الصبح، ثم خرج موجها إلى المدينة‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "حدثنا أبو نعيم، حدثنا همام، حدثنا عطاء، قال حدثني صفوان بن يعلى بن أمية يعني، عن أبيه، أن رجلا، أتى النبي صلى الله عليه وسلم وهو بالجعرانة وعليه جبة وعليه أثر الخلوق أو قال صفرة فقال كيف تأمرني أن أصنع في عمرتي فأنزل الله على النبي صلى الله عليه وسلم، فستر بثوب ووددت أني قد رأيت النبي صلى الله عليه وسلم وقد أنزل عليه الوحى‏.‏ فقال عمر تعال أيسرك أن تنظر إلى النبي صلى الله عليه وسلم وقد أنزل الله الوحى قلت نعم‏.‏ فرفع طرف الثوب، فنظرت إليه له غطيط وأحسبه قال كغطيط البكر‏.‏ فلما سري عنه قال ‏ \"‏ أين السائل عن العمرة اخلع عنك الجبة واغسل أثر الخلوق عنك، وأنق الصفرة، واصنع في عمرتك كما تصنع في حجك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن هشام بن عروة، عن أبيه، أنه قال قلت لعائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم وأنا يومئذ حديث السن أرأيت قول الله تبارك وتعالى ‏{‏إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما‏}‏ فلا أرى على أحد شيئا أن لا يطوف بهما‏.‏ فقالت عائشة كلا، لو كانت كما تقول كانت فلا جناح عليه أن لا يطوف بهما‏.‏ إنما أنزلت هذه الآية في الأنصار كانوا يهلون لمناة، وكانت مناة حذو قديد، وكانوا يتحرجون أن يطوفوا بين الصفا والمروة، فلما جاء الإسلام سألوا رسول الله صلى الله عليه وسلم عن ذلك، فأنزل الله تعالى ‏{‏إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما‏}‏‏.‏ زاد سفيان وأبو معاوية عن هشام ما أتم الله حج امرئ ولا عمرته لم يطف بين الصفا والمروة‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى الأشعري ـ رضى الله عنه ـ قال قدمت على النبي صلى الله عليه وسلم بالبطحاء وهو منيخ فقال ‏\"‏ أحججت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ بما أهللت ‏\"‏‏.‏ قلت لبيك بإهلال كإهلال النبي صلى الله عليه وسلم قال ‏\"‏ أحسنت‏.‏ طف بالبيت وبالصفا والمروة ثم أحل ‏\"‏‏.‏ فطفت بالبيت، وبالصفا والمروة، ثم أتيت امرأة من قيس، ففلت رأسي، ثم أهللت بالحج‏.‏ فكنت أفتي به، حتى كان في خلافة عمر فقال إن أخذنا بكتاب الله فإنه يأمرنا بالتمام، وإن أخذنا بقول النبي صلى الله عليه وسلم فإنه لم يحل حتى يبلغ الهدى محله‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "حدثنا أحمد بن عيسى، حدثنا ابن وهب، أخبرنا عمرو، عن أبي الأسود، أن عبد الله، مولى أسماء بنت أبي بكر حدثه أنه، كان يسمع أسماء تقول كلما مرت بالحجون صلى الله على محمد لقد نزلنا معه ها هنا، ونحن يومئذ خفاف، قليل ظهرنا، قليلة أزوادنا، فاعتمرت أنا وأختي عائشة والزبير وفلان وفلان، فلما مسحنا البيت أحللنا، ثم أهللنا من العشي بالحج‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم كان إذا قفل من غزو أو حج أو عمرة يكبر على كل شرف من الأرض ثلاث تكبيرات، ثم يقول ‏ \"‏ لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شىء قدير، آيبون تائبون عابدون ساجدون لربنا حامدون، صدق الله وعده ونصر عبده وهزم الأحزاب وحده ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "حدثنا معلى بن أسد، حدثنا يزيد بن زريع، حدثنا خالد، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال لما قدم النبي صلى الله عليه وسلم مكة استقبلته أغيلمة بني عبد المطلب، فحمل واحدا بين يديه وآخر خلفه‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "حدثنا أحمد بن الحجاج، حدثنا أنس بن عياض، عن عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم كان إذا خرج إلى مكة يصلي في مسجد الشجرة، وإذا رجع صلى بذي الحليفة ببطن الوادي وبات حتى يصبح‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "حدثنا موسى بن إسماعيل، حدثنا همام، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس ـ رضى الله عنه ـ قال كان النبي صلى الله عليه وسلم لا يطرق أهله، كان لا يدخل إلا غدوة أو عشية‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن محارب، عن جابر ـ رضى الله عنه ـ قال نهى النبي صلى الله عليه وسلم أن يطرق أهله ليلا‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني حميد، أنه سمع أنسا ـ رضى الله عنه ـ يقول كان رسول الله صلى الله عليه وسلم إذا قدم من سفر، فأبصر درجات المدينة أوضع ناقته، وإن كانت دابة حركها‏.‏ قال أبو عبد الله زاد الحارث بن عمير عن حميد حركها من حبها‏.‏ حدثنا قتيبة، حدثنا إسماعيل، عن حميد، عن أنس، قال جدرات‏.‏ تابعه الحارث بن عمير‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء ـ رضى الله عنه ـ يقول نزلت هذه الآية فينا، كانت الأنصار إذا حجوا فجاءوا لم يدخلوا من قبل أبواب بيوتهم، ولكن من ظهورها، فجاء رجل من الأنصار، فدخل من قبل بابه، فكأنه عير بذلك، فنزلت ‏{‏وليس البر بأن تأتوا البيوت من ظهورها ولكن البر من اتقى وأتوا البيوت من أبوابها‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ السفر قطعة من العذاب، يمنع أحدكم طعامه وشرابه ونومه، فإذا قضى نهمته فليعجل إلى أهله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد بن أسلم، عن أبيه، قال كنت مع عبد الله بن عمر ـ رضى الله عنهما ـ بطريق مكة، فبلغه عن صفية بنت أبي عبيد شدة وجع فأسرع السير، حتى كان بعد غروب الشفق نزل، فصلى المغرب والعتمة، جمع بينهما، ثم قال إني رأيت النبي صلى الله عليه وسلم إذا جد به السير أخر المغرب، وجمع بينهما‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 30
			}
		}
	]
}