{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"29": "Virtues of Madinah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1867,
			"arabicnumber": 1867,
			"text": "حدثنا أبو النعمان، حدثنا ثابت بن يزيد، حدثنا عاصم أبو عبد الرحمن الأحول، عن أنس ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ المدينة حرم، من كذا إلى كذا، لا يقطع شجرها، ولا يحدث فيها حدث، من أحدث حدثا فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1868,
			"arabicnumber": 1868,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، عن أبي التياح، عن أنس ـ رضى الله عنه ـ قدم النبي صلى الله عليه وسلم المدينة فأمر ببناء المسجد فقال ‏ \"‏ يا بني النجار ثامنوني ‏\"‏‏.‏ فقالوا لا نطلب ثمنه إلا إلى الله‏.‏ فأمر بقبور المشركين، فنبشت، ثم بالخرب فسويت، وبالنخل فقطع، فصفوا النخل قبلة المسجد‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1869,
			"arabicnumber": 1869,
			"text": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن عبيد الله، عن سعيد المقبري، عن أبي هريرة ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم قال ‏\"‏ حرم ما بين لابتى المدينة على لساني ‏\"‏‏.‏ قال وأتى النبي صلى الله عليه وسلم بني حارثة فقال ‏\"‏ أراكم يا بني حارثة قد خرجتم من الحرم ‏\"‏‏.‏ ثم التفت، فقال ‏\"‏ بل أنتم فيه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1870,
			"arabicnumber": 1870,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن علي ـ رضى الله عنه ـ قال ما عندنا شىء إلا كتاب الله، وهذه الصحيفة عن النبي صلى الله عليه وسلم ‏\"‏ المدينة حرم، ما بين عائر إلى كذا، من أحدث فيها حدثا، أو آوى محدثا، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل ‏\"‏‏.‏ وقال ‏\"‏ ذمة المسلمين واحدة، فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل، ومن تولى قوما بغير إذن مواليه، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1871,
			"arabicnumber": 1871,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، قال سمعت أبا الحباب، سعيد بن يسار يقول سمعت أبا هريرة ـ رضى الله عنه ـ يقول قال رسول الله صلى الله عليه وسلم‏.‏ ‏ \"‏ أمرت بقرية تأكل القرى يقولون يثرب‏.‏ وهى المدينة، تنفي الناس كما ينفي الكير خبث الحديد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1872,
			"arabicnumber": 1872,
			"text": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني عمرو بن يحيى، عن عباس بن سهل بن سعد، عن أبي حميد ـ رضى الله عنه ـ أقبلنا مع النبي صلى الله عليه وسلم من تبوك حتى أشرفنا على المدينة فقال ‏ \"‏ هذه طابة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1873,
			"arabicnumber": 1873,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة ـ رضى الله عنه ـ أنه كان يقول لو رأيت الظباء بالمدينة ترتع ما ذعرتها، قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما بين لابتيها حرام ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1874,
			"arabicnumber": 1874,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني سعيد بن المسيب، أن أبا هريرة ـ رضى الله عنه ـ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ يتركون المدينة على خير ما كانت، لا يغشاها إلا العواف ـ يريد عوافي السباع والطير ـ وآخر من يحشر راعيان من مزينة، يريدان المدينة ينعقان بغنمهما، فيجدانها وحشا، حتى إذا بلغا ثنية الوداع خرا على وجوههما ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1875,
			"arabicnumber": 1875,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن عبد الله بن الزبير، عن سفيان بن أبي زهير ـ رضى الله عنه ـ أنه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ تفتح اليمن فيأتي قوم يبسون، فيتحملون بأهليهم ومن أطاعهم، والمدينة خير لهم لو كانوا يعلمون، وتفتح الشأم، فيأتي قوم يبسون فيتحملون بأهليهم ومن أطاعهم، والمدينة خير لهم لو كانوا يعلمون، وتفتح العراق، فيأتي قوم يبسون فيتحملون بأهليهم ومن أطاعهم‏.‏ والمدينة خير لهم لو كانوا يعلمون ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1876,
			"arabicnumber": 1876,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، قال حدثني عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الإيمان ليأرز إلى المدينة كما تأرز الحية إلى جحرها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1877,
			"arabicnumber": 1877,
			"text": "حدثنا حسين بن حريث، أخبرنا الفضل، عن جعيد، عن عائشة، قالت سمعت سعدا ـ رضى الله عنه ـ قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ لا يكيد أهل المدينة أحد إلا انماع كما ينماع الملح في الماء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1878,
			"arabicnumber": 1878,
			"text": "حدثنا علي، حدثنا سفيان، حدثنا ابن شهاب، قال أخبرني عروة، سمعت أسامة ـ رضى الله عنه ـ قال أشرف النبي صلى الله عليه وسلم على أطم من آطام المدينة فقال ‏ \"‏ هل ترون ما أرى إني لأرى مواقع الفتن خلال بيوتكم كمواقع القطر ‏\"‏‏.‏ تابعه معمر وسليمان بن كثير عن الزهري‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1879,
			"arabicnumber": 1879,
			"text": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، عن جده، عن أبي بكرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يدخل المدينة رعب المسيح الدجال، لها يومئذ سبعة أبواب، على كل باب ملكان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1880,
			"arabicnumber": 1880,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن نعيم بن عبد الله المجمر، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم‏.‏ ‏ \"‏ على أنقاب المدينة ملائكة، لا يدخلها الطاعون ولا الدجال ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1881,
			"arabicnumber": 1881,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا الوليد، حدثنا أبو عمرو، حدثنا إسحاق، حدثني أنس بن مالك ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس من بلد إلا سيطؤه الدجال، إلا مكة والمدينة، ليس له من نقابها نقب إلا عليه الملائكة صافين، يحرسونها، ثم ترجف المدينة بأهلها ثلاث رجفات، فيخرج الله كل كافر ومنافق ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1882,
			"arabicnumber": 1882,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله بن عتبة، أن أبا سعيد الخدري ـ رضى الله عنه ـ قال حدثنا رسول الله صلى الله عليه وسلم حديثا طويلا عن الدجال، فكان فيما حدثنا به أن قال ‏ \"‏ يأتي الدجال ـ وهو محرم عليه أن يدخل نقاب المدينة ـ بعض السباخ التي بالمدينة، فيخرج إليه يومئذ رجل، هو خير الناس ـ أو من خير الناس ـ فيقول أشهد أنك الدجال، الذي حدثنا عنك رسول الله صلى الله عليه وسلم حديثه، فيقول الدجال أرأيت إن قتلت هذا ثم أحييته، هل تشكون في الأمر فيقولون لا‏.‏ فيقتله، ثم يحييه فيقول حين يحييه والله ما كنت قط أشد بصيرة مني اليوم، فيقول الدجال أقتله فلا أسلط عليه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1883,
			"arabicnumber": 1883,
			"text": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن محمد بن المنكدر، عن جابر ـ رضى الله عنه ـ جاء أعرابي النبي صلى الله عليه وسلم فبايعه على الإسلام، فجاء من الغد محموما، فقال أقلني، فأبى ثلاث مرار، فقال ‏ \"‏ المدينة كالكير، تنفي خبثها، وينصع طيبها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1884,
			"arabicnumber": 1884,
			"text": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عدي بن ثابت، عن عبد الله بن يزيد، قال سمعت زيد بن ثابت ـ رضى الله عنه ـ يقول لما خرج النبي صلى الله عليه وسلم إلى أحد رجع ناس من أصحابه فقالت فرقة نقتلهم‏.‏ وقالت فرقة لا نقتلهم‏.‏ فنزلت ‏{‏فما لكم في المنافقين فئتين‏}‏ وقال النبي صلى الله عليه وسلم ‏\"‏ إنها تنفي الرجال كما تنفي النار خبث الحديد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1885,
			"arabicnumber": 1885,
			"text": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، حدثنا أبي، سمعت يونس، عن ابن شهاب، عن أنس ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ اللهم اجعل بالمدينة ضعفى ما جعلت بمكة من البركة ‏\"‏‏.‏ تابعه عثمان بن عمر عن يونس‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1886,
			"arabicnumber": 1886,
			"text": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم كان إذا قدم من سفر، فنظر إلى جدرات المدينة أوضع راحلته، وإن كان على دابة، حركها من حبها‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1887,
			"arabicnumber": 1887,
			"text": "حدثنا ابن سلام، أخبرنا الفزاري، عن حميد الطويل، عن أنس ـ رضى الله عنه ـ قال أراد بنو سلمة أن يتحولوا، إلى قرب المسجد، فكره رسول الله صلى الله عليه وسلم أن تعرى المدينة، وقال ‏ \"‏ يا بني سلمة‏.‏ ألا تحتسبون آثاركم ‏\"‏‏.‏ فأقاموا‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1888,
			"arabicnumber": 1888,
			"text": "حدثنا مسدد، عن يحيى، عن عبيد الله بن عمر، قال حدثني خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما بين بيتي ومنبري روضة من رياض الجنة، ومنبري على حوضي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1889,
			"arabicnumber": 1889,
			"text": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت لما قدم رسول الله صلى الله عليه وسلم المدينة وعك أبو بكر وبلال، فكان أبو بكر إذا أخذته الحمى يقول كل امرئ مصبح في أهله والموت أدنى من شراك نعله وكان بلال إذا أقلع عنه الحمى يرفع عقيرته يقول ألا ليت شعري هل أبيتن ليلة بواد وحولي إذخر وجليل وهل أردن يوما مياه مجنة وهل يبدون لي شامة وطفيل قال اللهم العن شيبة بن ربيعة، وعتبة بن ربيعة، وأمية بن خلف، كما أخرجونا من أرضنا إلى أرض الوباء ثم قال رسول الله صلى الله عليه وسلم ‏ \"‏ اللهم حبب إلينا المدينة كحبنا مكة أو أشد، اللهم بارك لنا في صاعنا، وفي مدنا، وصححها لنا وانقل حماها إلى الجحفة ‏\"‏‏.‏ قالت وقدمنا المدينة، وهى أوبأ أرض الله‏.‏ قالت فكان بطحان يجري نجلا‏.‏ تعني ماء آجنا‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1890,
			"arabicnumber": 1890,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن أبيه، عن عمر ـ رضى الله عنه ـ قال اللهم ارزقني شهادة في سبيلك، واجعل موتي في بلد رسولك صلى الله عليه وسلم‏.‏ وقال ابن زريع عن روح بن القاسم، عن زيد بن أسلم، عن أمه، عن حفصة بنت عمر ـ رضى الله عنهما ـ قالت سمعت عمر، نحوه‏.‏ وقال هشام عن زيد، عن أبيه، عن حفصة، سمعت عمر، رضى الله عنه‏.‏",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 24
			}
		}
	]
}