{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"32": "Virtues of the Night of Qadr"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2014,
			"arabicnumber": 2014,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال حفظناه وإنما حفظ من الزهري عن أبي سلمة عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ من صام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه، ومن قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏‏.‏ تابعه سليمان بن كثير عن الزهري‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2015,
			"arabicnumber": 2015,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أن رجالا، من أصحاب النبي صلى الله عليه وسلم أروا ليلة القدر في المنام في السبع الأواخر، فقال رسول الله صلى الله عليه وسلم ‏ \"‏ أرى رؤياكم قد تواطأت في السبع الأواخر، فمن كان متحريها فليتحرها في السبع الأواخر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2016,
			"arabicnumber": 2016,
			"text": "حدثنا معاذ بن فضالة، حدثنا هشام، عن يحيى، عن أبي سلمة، قال سألت أبا سعيد وكان لي صديقا فقال اعتكفنا مع النبي صلى الله عليه وسلم العشر الأوسط من رمضان، فخرج صبيحة عشرين، فخطبنا وقال ‏ \"‏ إني أريت ليلة القدر، ثم أنسيتها أو نسيتها، فالتمسوها في العشر الأواخر في الوتر، وإني رأيت أني أسجد في ماء وطين، فمن كان اعتكف مع رسول الله صلى الله عليه وسلم فليرجع ‏\"‏‏.‏ فرجعنا وما نرى في السماء قزعة، فجاءت سحابة فمطرت حتى سال سقف المسجد وكان من جريد النخل، وأقيمت الصلاة، فرأيت رسول الله صلى الله عليه وسلم يسجد في الماء والطين، حتى رأيت أثر الطين في جبهته‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2017,
			"arabicnumber": 2017,
			"text": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، حدثنا أبو سهيل، عن أبيه، عن عائشة ـ رضى الله عنها ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ تحروا ليلة القدر في الوتر من العشر الأواخر من رمضان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2018,
			"arabicnumber": 2018,
			"text": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي سعيد الخدري ـ رضى الله عنه ـ‏.‏ كان رسول الله صلى الله عليه وسلم يجاور في رمضان العشر التي في وسط الشهر، فإذا كان حين يمسي من عشرين ليلة تمضي، ويستقبل إحدى وعشرين، رجع إلى مسكنه ورجع من كان يجاور معه‏.‏ وأنه أقام في شهر جاور فيه الليلة التي كان يرجع فيها، فخطب الناس، فأمرهم ما شاء الله، ثم قال ‏ \"‏ كنت أجاور هذه العشر، ثم قد بدا لي أن أجاور هذه العشر الأواخر، فمن كان اعتكف معي فليثبت في معتكفه، وقد أريت هذه الليلة ثم أنسيتها فابتغوها في العشر الأواخر وابتغوها في كل وتر، وقد رأيتني أسجد في ماء وطين ‏\"‏‏.‏ فاستهلت السماء في تلك الليلة، فأمطرت، فوكف المسجد في مصلى النبي صلى الله عليه وسلم ليلة إحدى وعشرين، فبصرت عيني رسول الله صلى الله عليه وسلم ونظرت إليه انصرف من الصبح، ووجهه ممتلئ طينا وماء‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2019,
			"arabicnumber": 2019,
			"text": "حدثنا محمد بن المثنى، حدثنا يحيى، عن هشام، قال أخبرني أبي، عن عائشة ـ رضى الله عنها ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ التمسوا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2020,
			"arabicnumber": 2020,
			"text": "حدثني محمد، أخبرنا عبدة، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يجاور في العشر الأواخر من رمضان، ويقول ‏ \"‏ تحروا ليلة القدر في العشر الأواخر من رمضان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2021,
			"arabicnumber": 2021,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا أيوب، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم قال ‏ \"‏ التمسوها في العشر الأواخر من رمضان ليلة القدر في تاسعة تبقى، في سابعة تبقى، في خامسة تبقى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2022,
			"arabicnumber": 2022,
			"text": "حدثنا عبد الله بن أبي الأسود، حدثنا عبد الواحد، حدثنا عاصم، عن أبي مجلز، وعكرمة، قال ابن عباس ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ هي في العشر، هي في تسع يمضين أو في سبع يبقين ‏\"‏‏.‏ يعني ليلة القدر‏.‏ قال عبد الوهاب عن أيوب‏.‏ وعن خالد عن عكرمة عن ابن عباس التمسوا في أربع وعشرين‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2023,
			"arabicnumber": 2023,
			"text": "حدثنا محمد بن المثنى، حدثنا خالد بن الحارث، حدثنا حميد، حدثنا أنس، عن عبادة بن الصامت، قال خرج النبي صلى الله عليه وسلم ليخبرنا بليلة القدر، فتلاحى رجلان من المسلمين، فقال ‏ \"‏ خرجت لأخبركم بليلة القدر، فتلاحى فلان وفلان، فرفعت، وعسى أن يكون خيرا لكم، فالتمسوها في التاسعة والسابعة والخامسة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2024,
			"arabicnumber": 2024,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن أبي يعفور، عن أبي الضحى، عن مسروق، عن عائشة ـ رضى الله عنها ـ قالت كان النبي صلى الله عليه وسلم إذا دخل العشر شد مئزره، وأحيا ليله، وأيقظ أهله‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 11
			}
		}
	]
}