{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"44": "Khusoomaat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2410,
			"arabicnumber": 2410,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، قال عبد الملك بن ميسرة أخبرني قال سمعت النزال، سمعت عبد الله، يقول سمعت رجلا، قرأ آية سمعت من النبي، صلى الله عليه وسلم خلافها، فأخذت بيده، فأتيت به رسول الله صلى الله عليه وسلم فقال ‏\"‏ كلاكما محسن ‏\"‏‏.‏ قال شعبة أظنه قال ‏\"‏ لا تختلفوا فإن من كان قبلكم اختلفوا فهلكوا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2411,
			"arabicnumber": 2411,
			"text": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن أبي سلمة، وعبد الرحمن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ قال استب رجلان رجل من المسلمين ورجل من اليهود، قال المسلم والذي اصطفى محمدا على العالمين، فقال اليهودي والذي اصطفى موسى على العالمين‏.‏ فرفع المسلم يده عند ذلك فلطم وجه اليهودي، فذهب اليهودي إلى النبي صلى الله عليه وسلم فأخبره بما كان من أمره وأمر المسلم، فدعا النبي صلى الله عليه وسلم المسلم فسأله عن ذلك، فأخبره فقال النبي صلى الله عليه وسلم ‏ \"‏ لا تخيروني على موسى، فإن الناس يصعقون يوم القيامة، فأصعق معهم، فأكون أول من يفيق، فإذا موسى باطش جانب العرش، فلا أدري أكان فيمن صعق فأفاق قبلي، أو كان ممن استثنى الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2412,
			"arabicnumber": 2412,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري ـ رضى الله عنه ـ قال بينما رسول الله صلى الله عليه وسلم جالس جاء يهودي، فقال يا أبا القاسم ضرب وجهي رجل من أصحابك‏.‏ فقال ‏\"‏ من ‏\"‏‏.‏ قال رجل من الأنصار‏.‏ قال ‏\"‏ ادعوه ‏\"‏‏.‏ فقال ‏\"‏ أضربته ‏\"‏‏.‏ قال سمعته بالسوق يحلف والذي اصطفى موسى على البشر‏.‏ قلت أى خبيث، على محمد صلى الله عليه وسلم فأخذتني غضبة ضربت وجهه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا تخيروا بين الأنبياء، فإن الناس يصعقون يوم القيامة، فأكون أول من تنشق عنه الأرض، فإذا أنا بموسى آخذ بقائمة من قوائم العرش، فلا أدري أكان فيمن صعق، أم حوسب بصعقة الأولى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2413,
			"arabicnumber": 2413,
			"text": "حدثنا موسى، حدثنا همام، عن قتادة، عن أنس ـ رضى الله عنه ـ أن يهوديا، رض رأس جارية بين حجرين، قيل من فعل هذا بك أفلان، أفلان حتى سمي اليهودي فأومت برأسها، فأخذ اليهودي فاعترف، فأمر به النبي صلى الله عليه وسلم فرض رأسه بين حجرين‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2414,
			"arabicnumber": 2414,
			"text": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، قال سمعت ابن عمر ـ رضى الله عنهما ـ قال كان رجل يخدع في البيع فقال له النبي صلى الله عليه وسلم ‏ \"‏ إذا بايعت فقل لا خلابة ‏\"‏‏.‏ فكان يقوله‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2415,
			"arabicnumber": 2415,
			"text": "حدثنا عاصم بن علي، حدثنا ابن أبي ذئب، عن محمد بن المنكدر، عن جابر ـ رضى الله عنه ـ أن رجلا، أعتق عبدا له، ليس له مال غيره، فرده النبي صلى الله عليه وسلم، فابتاعه منه نعيم بن النحام‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2416,
			"arabicnumber": 2416,
			"text": "حدثنا محمد، أخبرنا أبو معاوية، عن الأعمش، عن شقيق، عن عبد الله ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين وهو فيها فاجر ليقتطع بها مال امرئ مسلم لقي الله وهو عليه غضبان ‏\"‏‏.‏ قال فقال الأشعث في والله كان ذلك، كان بيني وبين رجل من اليهود أرض فجحدني، فقدمته إلى النبي صلى الله عليه وسلم فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألك بينة ‏\"‏‏.‏ قلت لا‏.‏ قال فقال لليهودي ‏\"‏ احلف ‏\"‏‏.‏ قال قلت يا رسول الله إذا يحلف، ويذهب بمالي، فأنزل الله تعالى ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ إلى آخر الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2418,
			"arabicnumber": 2418,
			"text": "حدثنا عبد الله بن محمد، حدثنا عثمان بن عمر، أخبرنا يونس، عن الزهري، عن عبد الله بن كعب بن مالك، عن كعب ـ رضى الله عنه ـ أنه تقاضى ابن أبي حدرد دينا كان له عليه في المسجد، فارتفعت أصواتهما حتى سمعها رسول الله صلى الله عليه وسلم وهو في بيته، فخرج إليهما، حتى كشف سجف حجرته فنادى ‏\"‏ يا كعب ‏\"‏‏.‏ قال لبيك يا رسول الله‏.‏ قال ‏\"‏ ضع من دينك هذا ‏\"‏‏.‏ فأومأ إليه، أى الشطر‏.‏ قال لقد فعلت يا رسول الله‏.‏ قال ‏\"‏ قم فاقضه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2419,
			"arabicnumber": 2419,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عروة بن الزبير، عن عبد الرحمن بن عبد القاري، أنه قال سمعت عمر بن الخطاب ـ رضى الله عنه ـ يقول سمعت هشام بن حكيم بن حزام، يقرأ سورة الفرقان على غير ما أقرؤها، وكان رسول الله صلى الله عليه وسلم أقرأنيها، وكدت أن أعجل عليه، ثم أمهلته حتى انصرف، ثم لببته بردائه فجئت به رسول الله صلى الله عليه وسلم فقلت إني سمعت هذا يقرأ على غير ما أقرأتنيها، فقال لي ‏\"‏ أرسله ‏\"‏‏.‏ ثم قال له ‏\"‏ اقرأ ‏\"‏‏.‏ فقرأ‏.‏ قال ‏\"‏ هكذا أنزلت ‏\"‏‏.‏ ثم قال لي ‏\"‏ اقرأ ‏\"‏‏.‏ فقرأت فقال ‏\"‏ هكذا أنزلت‏.‏ إن القرآن أنزل على سبعة أحرف فاقرءوا منه ما تيسر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2420,
			"arabicnumber": 2420,
			"text": "حدثنا محمد بن بشار حدثنا محمد بن أبي عدي، عن شعبة، عن سعد بن إبراهيم، عن حميد بن عبد الرحمن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لقد هممت أن آمر بالصلاة فتقام ثم أخالف إلى منازل قوم لا يشهدون الصلاة فأحرق عليهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2421,
			"arabicnumber": 2421,
			"text": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن الزهري، عن عروة، عن عائشة ـ رضى الله عنها ـ أن عبد بن زمعة، وسعد بن أبي وقاص، اختصما إلى النبي صلى الله عليه وسلم في ابن أمة زمعة فقال سعد يا رسول الله أوصاني أخي إذا قدمت أن أنظر ابن أمة زمعة فأقبضه، فإنه ابني‏.‏ وقال عبد بن زمعة أخي وابن أمة أبي، ولد على فراش أبي‏.‏ فرأى النبي صلى الله عليه وسلم شبها بينا فقال ‏ \"‏ هو لك يا عبد بن زمعة، الولد للفراش، واحتجبي منه يا سودة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2422,
			"arabicnumber": 2422,
			"text": "حدثنا قتيبة، حدثنا الليث، عن سعيد بن أبي سعيد، أنه سمع أبا هريرة ـ رضى الله عنهما ـ يقول بعث رسول الله صلى الله عليه وسلم خيلا قبل نجد، فجاءت برجل من بني حنيفة يقال له ثمامة بن أثال سيد أهل اليمامة، فربطوه بسارية من سواري المسجد، فخرج إليه رسول الله صلى الله عليه وسلم قال ‏\"‏ ما عندك يا ثمامة ‏\"‏‏.‏ قال عندي يا محمد خير‏.‏ فذكر الحديث قال ‏\"‏ أطلقوا ثمامة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2423,
			"arabicnumber": 2423,
			"text": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني سعيد بن أبي سعيد، سمع أبا هريرة ـ رضى الله عنه ـ قال بعث النبي صلى الله عليه وسلم خيلا قبل نجد، فجاءت برجل من بني حنيفة يقال له ثمامة بن أثال فربطوه بسارية من سواري المسجد‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2424,
			"arabicnumber": 2424,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، حدثنا جعفر بن ربيعة،‏.‏ وقال غيره حدثني الليث، قال حدثني جعفر بن ربيعة، عن عبد الرحمن بن هرمز، عن عبد الله بن كعب بن مالك الأنصاري، عن كعب بن مالك ـ رضى الله عنه ـ أنه كان له على عبد الله بن أبي حدرد الأسلمي دين، فلقيه فلزمه، فتكلما حتى ارتفعت أصواتهما، فمر بهما النبي صلى الله عليه وسلم فقال ‏ \"‏ يا كعب ‏\"‏‏.‏ وأشار بيده كأنه يقول النصف، فأخذ نصف ما عليه وترك نصفا‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2425,
			"arabicnumber": 2425,
			"text": "حدثنا إسحاق، حدثنا وهب بن جرير بن حازم، أخبرنا شعبة، عن الأعمش، عن أبي الضحى، عن مسروق، عن خباب، قال كنت قينا في الجاهلية وكان لي على العاص بن وائل دراهم، فأتيته أتقاضاه فقال لا أقضيك حتى تكفر بمحمد، فقلت لا والله لا أكفر بمحمد صلى الله عليه وسلم حتى يميتك الله ثم يبعثك‏.‏ قال فدعني حتى أموت ثم أبعث فأوتى مالا وولدا، ثم أقضيك‏.‏ فنزلت ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 15
			}
		}
	]
}