{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"46": "Oppressions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2440,
			"arabicnumber": 2440,
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي المتوكل الناجي، عن أبي سعيد الخدري ـ رضى الله عنه ـ عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا خلص المؤمنون من النار حبسوا بقنطرة بين الجنة والنار، فيتقاصون مظالم كانت بينهم في الدنيا، حتى إذا نقوا وهذبوا أذن لهم بدخول الجنة، فوالذي نفس محمد صلى الله عليه وسلم بيده لأحدهم بمسكنه في الجنة أدل بمنزله كان في الدنيا ‏\"‏‏.‏ وقال يونس بن محمد حدثنا شيبان عن قتادة حدثنا أبو المتوكل‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2441,
			"arabicnumber": 2441,
			"text": "حدثنا موسى بن إسماعيل، حدثنا همام، قال أخبرني قتادة، عن صفوان بن محرز المازني، قال بينما أنا أمشي، مع ابن عمر ـ رضى الله عنهما ـ آخذ بيده إذ عرض رجل، فقال كيف سمعت رسول الله صلى الله عليه وسلم في النجوى فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن الله يدني المؤمن فيضع عليه كنفه، ويستره فيقول أتعرف ذنب كذا أتعرف ذنب كذا فيقول نعم أى رب‏.‏ حتى إذا قرره بذنوبه ورأى في نفسه أنه هلك قال سترتها عليك في الدنيا، وأنا أغفرها لك اليوم‏.‏ فيعطى كتاب حسناته، وأما الكافر والمنافقون فيقول الأشهاد هؤلاء الذين كذبوا على ربهم، ألا لعنة الله على الظالمين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2442,
			"arabicnumber": 2442,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، أن سالما، أخبره أن عبد الله بن عمر ـ رضى الله عنهما ـ أخبره أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ المسلم أخو المسلم، لا يظلمه ولا يسلمه، ومن كان في حاجة أخيه كان الله في حاجته، ومن فرج عن مسلم كربة فرج الله عنه كربة من كربات يوم القيامة، ومن ستر مسلما ستره الله يوم القيامة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2443,
			"arabicnumber": 2443,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا هشيم، أخبرنا عبيد الله بن أبي بكر بن أنس، وحميد الطويل، سمعا أنس بن مالك ـ رضى الله عنه ـ يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ انصر أخاك ظالما أو مظلوما ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2444,
			"arabicnumber": 2444,
			"text": "حدثنا مسدد، حدثنا معتمر، عن حميد، عن أنس ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ انصر أخاك ظالما أو مظلوما ‏\"‏‏.‏ قالوا يا رسول الله هذا ننصره مظلوما، فكيف ننصره ظالما قال ‏\"‏ تأخذ فوق يديه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2445,
			"arabicnumber": 2445,
			"text": "حدثنا سعيد بن الربيع، حدثنا شعبة، عن الأشعث بن سليم، قال سمعت معاوية بن سويد، سمعت البراء بن عازب ـ رضى الله عنهما ـ قال أمرنا النبي صلى الله عليه وسلم بسبع، ونهانا عن سبع‏.‏ فذكر عيادة المريض، واتباع الجنائز، وتشميت العاطس، ورد السلام، ونصر المظلوم، وإجابة الداعي، وإبرار المقسم‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2446,
			"arabicnumber": 2446,
			"text": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ المؤمن للمؤمن كالبنيان يشد بعضه بعضا ‏\"‏‏.‏ وشبك بين أصابعه‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2447,
			"arabicnumber": 2447,
			"text": "حدثنا أحمد بن يونس، حدثنا عبد العزيز الماجشون، أخبرنا عبد الله بن دينار، عن عبد الله بن عمر ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ الظلم ظلمات يوم القيامة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2448,
			"arabicnumber": 2448,
			"text": "حدثنا يحيى بن موسى، حدثنا وكيع، حدثنا زكرياء بن إسحاق المكي، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، مولى ابن عباس عن ابن عباس ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن، فقال ‏ \"‏ اتق دعوة المظلوم، فإنها ليس بينها وبين الله حجاب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2449,
			"arabicnumber": 2449,
			"text": "حدثنا آدم بن أبي إياس، حدثنا ابن أبي ذئب، حدثنا سعيد المقبري، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من كانت له مظلمة لأحد من عرضه أو شىء فليتحلله منه اليوم، قبل أن لا يكون دينار ولا درهم، إن كان له عمل صالح أخذ منه بقدر مظلمته، وإن لم تكن له حسنات أخذ من سيئات صاحبه فحمل عليه ‏\"‏‏.‏ قال أبو عبد الله قال إسماعيل بن أبي أويس إنما سمي المقبري لأنه كان نزل ناحية المقابر‏.‏ قال أبو عبد الله وسعيد المقبري هو مولى بني ليث، وهو سعيد بن أبي سعيد، واسم أبي سعيد كيسان‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2450,
			"arabicnumber": 2450,
			"text": "حدثنا محمد، أخبرنا عبد الله، أخبرنا هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها – ‏{‏وإن امرأة خافت من بعلها نشوزا أو إعراضا‏}‏ قالت الرجل تكون عنده المرأة، ليس بمستكثر منها، يريد أن يفارقها، فتقول أجعلك من شأني في حل‏.‏ فنزلت هذه الآية في ذلك‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2451,
			"arabicnumber": 2451,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي حازم بن دينار، عن سهل بن سعد الساعدي ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم أتي بشراب، فشرب منه وعن يمينه غلام وعن يساره الأشياخ، فقال للغلام ‏ \"‏ أتأذن لي أن أعطي هؤلاء ‏\"‏‏.‏ فقال الغلام لا والله يا رسول الله لا أوثر بنصيبي منك أحدا‏.‏ قال فتله رسول الله صلى الله عليه وسلم في يده‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2452,
			"arabicnumber": 2452,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني طلحة بن عبد الله، أن عبد الرحمن بن عمرو بن سهل، أخبره أن سعيد بن زيد ـ رضى الله عنه ـ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من ظلم من الأرض شيئا طوقه من سبع أرضين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2453,
			"arabicnumber": 2453,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا حسين، عن يحيى بن أبي كثير، قال حدثني محمد بن إبراهيم، أن أبا سلمة، حدثه أنه، كانت بينه وبين أناس خصومة، فذكر لعائشة ـ رضى الله عنها ـ فقالت يا أبا سلمة اجتنب الأرض، فإن النبي صلى الله عليه وسلم قال ‏ \"‏ من ظلم قيد شبر من الأرض طوقه من سبع أرضين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2454,
			"arabicnumber": 2454,
			"text": "حدثنا مسلم بن إبراهيم، حدثنا عبد الله بن المبارك، حدثنا موسى بن عقبة، عن سالم، عن أبيه ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ من أخذ من الأرض شيئا بغير حقه خسف به يوم القيامة إلى سبع أرضين ‏\"‏‏.‏ قال أبو عبد الله هذا الحديث ليس بخراسان في كتاب ابن المبارك، أملاه عليهم بالبصرة‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2455,
			"arabicnumber": 2455,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، عن جبلة، كنا بالمدينة في بعض أهل العراق، فأصابنا سنة، فكان ابن الزبير يرزقنا التمر، فكان ابن عمر ـ رضى الله عنهما ـ يمر بنا فيقول إن رسول الله صلى الله عليه وسلم نهى عن الإقران، إلا أن يستأذن الرجل منكم أخاه‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2456,
			"arabicnumber": 2456,
			"text": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن الأعمش، عن أبي وائل، عن أبي مسعود، أن رجلا، من الأنصار يقال له أبو شعيب كان له غلام لحام فقال له أبو شعيب اصنع لي طعام خمسة لعلي أدعو النبي صلى الله عليه وسلم خامس خمسة‏.‏ وأبصر في وجه النبي صلى الله عليه وسلم الجوع ـ فدعاه، فتبعهم رجل لم يدع فقال النبي صلى الله عليه وسلم ‏ \"‏ إن هذا قد اتبعنا أتأذن له ‏\"‏‏.‏ قال نعم‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2457,
			"arabicnumber": 2457,
			"text": "حدثنا أبو عاصم، عن ابن جريج، عن ابن أبي مليكة، عن عائشة ـ رضى الله عنها ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن أبغض الرجال إلى الله الألد الخصم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2458,
			"arabicnumber": 2458,
			"text": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن زينب بنت أم سلمة، أخبرته أن أمها أم سلمة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم أخبرتها عن رسول الله صلى الله عليه وسلم أنه سمع خصومة بباب حجرته، فخرج إليهم، فقال ‏ \"‏ إنما أنا بشر وإنه يأتيني الخصم، فلعل بعضكم أن يكون أبلغ من بعض، فأحسب أنه صدق، فأقضي له بذلك، فمن قضيت له بحق مسلم فإنما هي قطعة من النار، فليأخذها أو فليتركها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2459,
			"arabicnumber": 2459,
			"text": "حدثنا بشر بن خالد، أخبرنا محمد، عن شعبة، عن سليمان، عن عبد الله بن مرة، عن مسروق، عن عبد الله بن عمرو ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ أربع من كن فيه كان منافقا، أو كانت فيه خصلة من أربعة كانت فيه خصلة من النفاق، حتى يدعها إذا حدث كذب، وإذا وعد أخلف، وإذا عاهد غدر، وإذا خاصم فجر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2460,
			"arabicnumber": 2460,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثني عروة، أن عائشة ـ رضى الله عنها ـ قالت جاءت هند بنت عتبة بن ربيعة، فقالت يا رسول الله إن أبا سفيان رجل مسيك، فهل على حرج أن أطعم من الذي له عيالنا فقال ‏ \"‏ لا حرج عليك أن تطعميهم بالمعروف ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2461,
			"arabicnumber": 2461,
			"text": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني يزيد، عن أبي الخير، عن عقبة بن عامر، قال قلنا للنبي صلى الله عليه وسلم إنك تبعثنا فننزل بقوم لا يقرونا فما ترى فيه فقال لنا ‏ \"‏ إن نزلتم بقوم، فأمر لكم بما ينبغي للضيف فاقبلوا، فإن لم يفعلوا فخذوا منهم حق الضيف ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2462,
			"arabicnumber": 2462,
			"text": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني مالك،‏.‏ وأخبرني يونس، عن ابن شهاب، أخبرني عبيد الله بن عبد الله بن عتبة، أن ابن عباس، أخبره عن عمر ـ رضى الله عنهم ـ قال حين توفى الله نبيه صلى الله عليه وسلم إن الأنصار اجتمعوا في سقيفة بني ساعدة، فقلت لأبي بكر انطلق بنا‏.‏ فجئناهم في سقيفة بني ساعدة‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2463,
			"arabicnumber": 2463,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن الأعرج، عن أبي هريرة، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يمنع جار جاره أن يغرز خشبه في جداره ‏\"‏‏.‏ ثم يقول أبو هريرة ما لي أراكم عنها معرضين والله لأرمين بها بين أكتافكم‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2464,
			"arabicnumber": 2464,
			"text": "حدثنا محمد بن عبد الرحيم أبو يحيى، أخبرنا عفان، حدثنا حماد بن زيد، حدثنا ثابت، عن أنس ـ رضى الله عنه ـ كنت ساقي القوم في منزل أبي طلحة، وكان خمرهم يومئذ الفضيخ، فأمر رسول الله صلى الله عليه وسلم مناديا ينادي ‏\"‏ ألا إن الخمر قد حرمت ‏\"‏‏.‏ قال فقال لي أبو طلحة اخرج فأهرقها، فخرجت فهرقتها، فجرت في سكك المدينة فقال بعض القوم قد قتل قوم وهى في بطونهم‏.‏ فأنزل الله ‏{‏ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2465,
			"arabicnumber": 2465,
			"text": "حدثنا معاذ بن فضالة، حدثنا أبو عمر، حفص بن ميسرة عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والجلوس على الطرقات ‏\"‏‏.‏ فقالوا ما لنا بد، إنما هي مجالسنا نتحدث فيها‏.‏ قال ‏\"‏ فإذا أبيتم إلا المجالس فأعطوا الطريق حقها ‏\"‏ قالوا وما حق الطريق قال ‏\"‏ غض البصر، وكف الأذى، ورد السلام، وأمر بالمعروف، ونهى عن المنكر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2466,
			"arabicnumber": 2466,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن سمى، مولى أبي بكر عن أبي صالح السمان، عن أبي هريرة ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم قال ‏\"‏ بينا رجل بطريق، اشتد عليه العطش فوجد بئرا فنزل فيها فشرب، ثم خرج، فإذا كلب يلهث يأكل الثرى من العطش، فقال الرجل لقد بلغ هذا الكلب من العطش مثل الذي كان بلغ مني، فنزل البئر، فملأ خفه ماء، فسقى الكلب، فشكر الله له، فغفر له ‏\"‏‏.‏ قالوا يا رسول الله وإن لنا في البهائم لأجرا فقال ‏\"‏ في كل ذات كبد رطبة أجر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2467,
			"arabicnumber": 2467,
			"text": "حدثنا عبد الله بن محمد، حدثنا ابن عيينة، عن الزهري، عن عروة، عن أسامة بن زيد ـ رضى الله عنهما ـ قال أشرف النبي صلى الله عليه وسلم على أطم من آطام المدينة ثم قال ‏ \"‏ هل ترون ما أرى إني أرى مواقع الفتن خلال بيوتكم كمواقع القطر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2468,
			"arabicnumber": 2468,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله بن أبي ثور، عن عبد الله بن عباس ـ رضى الله عنهما ـ قال لم أزل حريصا على أن أسأل عمر ـ رضى الله عنه ـ عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين قال الله لهما ‏{‏إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ فحججت معه فعدل وعدلت معه بالإداوة، فتبرز حتى جاء، فسكبت على يديه من الإداوة، فتوضأ فقلت يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال لهما ‏{‏إن تتوبا إلى الله‏}‏ فقال واعجبي لك يا ابن عباس عائشة وحفصة، ثم استقبل عمر الحديث يسوقه، فقال إني كنت وجار لي من الأنصار في بني أمية بن زيد، وهى من عوالي المدينة، وكنا نتناوب النزول على النبي صلى الله عليه وسلم فينزل يوما وأنزل يوما، فإذا نزلت جئته من خبر ذلك اليوم من الأمر وغيره، وإذا نزل فعل مثله، وكنا معشر قريش نغلب النساء، فلما قدمنا على الأنصار إذا هم قوم تغلبهم نساؤهم، فطفق نساؤنا يأخذن من أدب نساء الأنصار، فصحت على امرأتي، فراجعتني، فأنكرت أن تراجعني، فقالت ولم تنكر أن أراجعك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه، وإن إحداهن لتهجره اليوم حتى الليل‏.‏ فأفزعني، فقلت خابت من فعل منهن بعظيم‏.‏ ثم جمعت على ثيابي، فدخلت على حفصة فقلت أى حفصة، أتغاضب إحداكن رسول الله صلى الله عليه وسلم اليوم حتى الليل فقالت نعم‏.‏ فقلت خابت وخسرت، أفتأمن أن يغضب الله لغضب رسوله صلى الله عليه وسلم فتهلكين لا تستكثري على رسول الله صلى الله عليه وسلم ولا تراجعيه في شىء ولا تهجريه، واسأليني ما بدا لك، ولا يغرنك أن كانت جارتك هي أوضأ منك وأحب إلى رسول الله صلى الله عليه وسلم ـ يريد عائشة ـ وكنا تحدثنا أن غسان تنعل النعال لغزونا، فنزل صاحبي يوم نوبته فرجع عشاء، فضرب بابي ضربا شديدا، وقال أنائم هو ففزعت فخرجت إليه‏.‏ وقال حدث أمر عظيم‏.‏ قلت ما هو أجاءت غسان قال لا، بل أعظم منه وأطول، طلق رسول الله صلى الله عليه وسلم نساءه‏.‏ قال قد خابت حفصة وخسرت، كنت أظن أن هذا يوشك أن يكون، فجمعت على ثيابي، فصليت صلاة الفجر مع النبي صلى الله عليه وسلم فدخل مشربة له فاعتزل فيها، فدخلت على حفصة، فإذا هي تبكي‏.‏ قلت ما يبكيك أولم أكن حذرتك أطلقكن رسول الله صلى الله عليه وسلم قالت لا أدري هو ذا في المشربة‏.‏ فخرجت، فجئت المنبر، فإذا حوله رهط يبكي بعضهم، فجلست معهم قليلا ثم غلبني ما أجد، فجئت المشربة التي هو فيها فقلت لغلام له أسود استأذن لعمر‏.‏ فدخل، فكلم النبي صلى الله عليه وسلم ثم خرج، فقال ذكرتك له، فصمت، فانصرفت حتى جلست مع الرهط الذين عند المنبر، ثم غلبني ما أجد فجئت، فذكر مثله، فجلست مع الرهط الذين عند المنبر، ثم غلبني ما أجد فجئت الغلام‏.‏ فقلت استأذن لعمر‏.‏ فذكر مثله، فلما وليت منصرفا، فإذا الغلام يدعوني قال أذن لك رسول الله صلى الله عليه وسلم‏.‏ فدخلت عليه، فإذا هو مضطجع على رمال حصير ليس بينه وبينه فراش، قد أثر الرمال بجنبه، متكئ على وسادة من أدم حشوها ليف، فسلمت عليه، ثم قلت وأنا قائم طلقت نساءك فرفع بصره إلى، فقال ‏\"‏ لا ‏\"‏‏.‏ ثم قلت ـ وأنا قائم أستأنس يا رسول الله، لو رأيتني، وكنا معشر قريش نغلب النساء، فلما قدمنا على قوم تغلبهم نساؤهم، فذكره، فتبسم النبي صلى الله عليه وسلم، ثم قلت لو رأيتني، ودخلت على حفصة، فقلت لا يغرنك أن كانت جارتك هي أوضأ منك وأحب إلى النبي صلى الله عليه وسلم ـ يريد عائشة ـ فتبسم أخرى، فجلست حين رأيته تبسم، ثم رفعت بصري في بيته، فوالله ما رأيت فيه شيئا يرد البصر غير أهبة ثلاثة‏.‏ فقلت ادع الله فليوسع على أمتك، فإن فارس والروم وسع عليهم وأعطوا الدنيا، وهم لا يعبدون الله، وكان متكئا‏.‏ فقال ‏\"‏ أوفي شك أنت يا ابن الخطاب أولئك قوم عجلت لهم طيباتهم في الحياة الدنيا ‏\"‏‏.‏ فقلت يا رسول الله استغفر لي‏.‏ فاعتزل النبي صلى الله عليه وسلم من أجل ذلك الحديث حين أفشته حفصة إلى عائشة، وكان قد قال ‏\"‏ ما أنا بداخل عليهن شهرا ‏\"‏‏.‏ من شدة موجدته عليهن حين عاتبه الله‏.‏ فلما مضت تسع وعشرون دخل على عائشة فبدأ بها، فقالت له عائشة إنك أقسمت أن لا تدخل علينا شهرا، وإنا أصبحنا لتسع وعشرين ليلة، أعدها عدا‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ الشهر تسع وعشرون ‏\"‏‏.‏ وكان ذلك الشهر تسع وعشرون‏.‏ قالت عائشة فأنزلت آية التخيير فبدأ بي أول امرأة، فقال ‏\"‏ إني ذاكر لك أمرا، ولا عليك أن لا تعجلي حتى تستأمري أبويك ‏\"‏‏.‏ قالت قد أعلم أن أبوى لم يكونا يأمراني بفراقك‏.‏ ثم قال ‏\"‏ إن الله قال ‏{‏يا أيها النبي قل لأزواجك‏}‏ إلى قوله ‏{‏ عظيما‏}‏ ‏\"‏‏.‏ قلت أفي هذا أستأمر أبوى فإني أريد الله ورسوله والدار الآخرة‏.‏ ثم خير نساءه، فقلن مثل ما قالت عائشة‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2469,
			"arabicnumber": 2469,
			"text": "حدثنا ابن سلام، حدثنا الفزاري، عن حميد الطويل، عن أنس ـ رضى الله عنه ـ قال آلى رسول الله صلى الله عليه وسلم من نسائه شهرا، وكانت انفكت قدمه فجلس في علية له، فجاء عمر، فقال أطلقت نساءك قال ‏ \"‏ لا، ولكني آليت منهن شهرا ‏\"‏‏.‏ فمكث تسعا وعشرين، ثم نزل، فدخل على نسائه‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2470,
			"arabicnumber": 2470,
			"text": "حدثنا مسلم، حدثنا أبو عقيل، حدثنا أبو المتوكل الناجي، قال أتيت جابر بن عبد الله ـ رضى الله عنهما ـ قال دخل النبي صلى الله عليه وسلم المسجد، فدخلت إليه، وعقلت الجمل في ناحية البلاط فقلت هذا جملك‏.‏ فخرج فجعل يطيف بالجمل قال ‏ \"‏ الثمن والجمل لك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2471,
			"arabicnumber": 2471,
			"text": "حدثنا سليمان بن حرب، عن شعبة، عن منصور، عن أبي وائل، عن حذيفة ـ رضى الله عنه ـ قال لقد رأيت رسول الله صلى الله عليه وسلم، أو قال لقد أتى النبي صلى الله عليه وسلم سباطة قوم فبال قائما‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2472,
			"arabicnumber": 2472,
			"text": "حدثنا عبد الله، أخبرنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ بينما رجل يمشي بطريق، وجد غصن شوك فأخذه، فشكر الله له، فغفر له ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2473,
			"arabicnumber": 2473,
			"text": "حدثنا موسى بن إسماعيل، حدثنا جرير بن حازم، عن الزبير بن خريت، عن عكرمة، سمعت أبا هريرة ـ رضى الله عنه ـ قال قضى النبي صلى الله عليه وسلم إذا تشاجروا في الطريق بسبعة أذرع‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2474,
			"arabicnumber": 2474,
			"text": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا عدي بن ثابت، سمعت عبد الله بن يزيد الأنصاري ـ وهو جده أبو أمه ـ قال نهى النبي صلى الله عليه وسلم عن النهبى والمثلة‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2475,
			"arabicnumber": 2475,
			"text": "حدثنا سعيد بن عفير، قال حدثني الليث، حدثنا عقيل، عن ابن شهاب، عن أبي بكر بن عبد الرحمن، عن أبي هريرة ـ رضى الله عنه ـ قال النبي صلى الله عليه وسلم ‏ \"‏ لا يزني الزاني حين يزني وهو مؤمن، ولا يشرب الخمر حين يشرب وهو مؤمن، ولا يسرق حين يسرق وهو مؤمن، ولا ينتهب نهبة يرفع الناس إليه فيها أبصارهم حين ينتهبها وهو مؤمن ‏\"‏‏.‏ وعن سعيد وأبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم مثله إلا النهبة‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2476,
			"arabicnumber": 2476,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا الزهري، قال أخبرني سعيد بن المسيب، سمع أبا هريرة ـ رضى الله عنه ـ عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تقوم الساعة حتى ينزل فيكم ابن مريم حكما مقسطا، فيكسر الصليب، ويقتل الخنزير، ويضع الجزية، ويفيض المال حتى لا يقبله أحد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2477,
			"arabicnumber": 2477,
			"text": "حدثنا أبو عاصم الضحاك بن مخلد، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم رأى نيرانا توقد يوم خيبر‏.‏ قال ‏\"‏ على ما توقد هذه النيران ‏\"‏‏.‏ قالوا على الحمر الإنسية‏.‏ قال ‏\"‏ اكسروها، وأهرقوها ‏\"‏‏.‏ قالوا ألا نهريقها ونغسلها قال ‏\"‏ اغسلوا ‏\"‏‏.‏ قال أبو عبد الله كان ابن أبي أويس يقول الحمر الأنسية بنصب الألف والنون",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2478,
			"arabicnumber": 2478,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله بن مسعود ـ رضى الله عنه ـ قال دخل النبي صلى الله عليه وسلم مكة، وحول الكعبة ثلاثمائة وستون نصبا فجعل يطعنها بعود في يده وجعل يقول ‏{‏جاء الحق وزهق الباطل‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2479,
			"arabicnumber": 2479,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن عبد الرحمن بن القاسم، عن أبيه القاسم، عن عائشة ـ رضى الله عنها ـ أنها كانت اتخذت على سهوة لها سترا فيه تماثيل، فهتكه النبي صلى الله عليه وسلم، فاتخذت منه نمرقتين، فكانتا في البيت يجلس عليهما‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2480,
			"arabicnumber": 2480,
			"text": "حدثنا عبد الله بن يزيد، حدثنا سعيد ـ هو ابن أبي أيوب ـ قال حدثني أبو الأسود، عن عكرمة، عن عبد الله بن عمرو ـ رضى الله عنهما ـ قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ من قتل دون ماله فهو شهيد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2481,
			"arabicnumber": 2481,
			"text": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن حميد، عن أنس ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم كان عند بعض نسائه، فأرسلت إحدى أمهات المؤمنين مع خادم بقصعة فيها طعام فضربت بيدها، فكسرت القصعة، فضمها، وجعل فيها الطعام وقال ‏ \"‏ كلوا ‏\"‏‏.‏ وحبس الرسول والقصعة حتى فرغوا، فدفع القصعة الصحيحة وحبس المكسورة‏.‏ وقال ابن أبي مريم أخبرنا يحيى بن أيوب، حدثنا حميد، حدثنا أنس، عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2482,
			"arabicnumber": 2482,
			"text": "حدثنا مسلم بن إبراهيم، حدثنا جرير بن حازم، عن محمد بن سيرين، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ كان رجل في بني إسرائيل، يقال له جريج، يصلي، فجاءته أمه فدعته، فأبى أن يجيبها، فقال أجيبها أو أصلي ثم أتته، فقالت اللهم لا تمته حتى تريه المومسات‏.‏ وكان جريج في صومعته، فقالت امرأة لأفتنن جريجا‏.‏ فتعرضت له فكلمته فأبى، فأتت راعيا، فأمكنته من نفسها فولدت غلاما، فقالت هو من جريج‏.‏ فأتوه، وكسروا صومعته فأنزلوه وسبوه، فتوضأ وصلى ثم أتى الغلام، فقال من أبوك يا غلام قال الراعي‏.‏ قالوا نبني صومعتك من ذهب‏.‏ قال لا إلا من طين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 43
			}
		}
	]
}