{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"5": "Bathing (Ghusl)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 248,
			"arabicnumber": 248,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام، عن أبيه، عن عائشة، زوج النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم كان إذا اغتسل من الجنابة بدأ فغسل يديه، ثم يتوضأ كما يتوضأ للصلاة، ثم يدخل أصابعه في الماء، فيخلل بها أصول شعره ثم يصب على رأسه ثلاث غرف بيديه، ثم يفيض الماء على جلده كله‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 249,
			"arabicnumber": 249,
			"text": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، زوج النبي صلى الله عليه وسلم قالت توضأ رسول الله صلى الله عليه وسلم وضوءه للصلاة غير رجليه، وغسل فرجه، وما أصابه من الأذى، ثم أفاض عليه الماء، ثم نحى رجليه فغسلهما، هذه غسله من الجنابة‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 250,
			"arabicnumber": 250,
			"text": "حدثنا آدم بن أبي إياس، قال حدثنا ابن أبي ذئب، عن الزهري، عن عروة، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد من قدح يقال له الفرق‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 251,
			"arabicnumber": 251,
			"text": "حدثنا عبد الله بن محمد، قال حدثني عبد الصمد، قال حدثني شعبة، قال حدثني أبو بكر بن حفص، قال سمعت أبا سلمة، يقول دخلت أنا وأخو، عائشة على عائشة فسألها أخوها عن غسل النبي، صلى الله عليه وسلم فدعت بإناء نحوا من صاع، فاغتسلت وأفاضت على رأسها، وبيننا وبينها حجاب‏.‏ قال أبو عبد الله قال يزيد بن هارون وبهز والجدي عن شعبة قدر صاع‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 252,
			"arabicnumber": 252,
			"text": "حدثنا عبد الله بن محمد، قال حدثنا يحيى بن آدم، قال حدثنا زهير، عن أبي إسحاق، قال حدثنا أبو جعفر، أنه كان عند جابر بن عبد الله هو وأبوه، وعنده قوم فسألوه عن الغسل،‏.‏ فقال يكفيك صاع‏.‏ فقال رجل ما يكفيني‏.‏ فقال جابر كان يكفي من هو أوفى منك شعرا، وخير منك، ثم أمنا في ثوب‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 253,
			"arabicnumber": 253,
			"text": "حدثنا أبو نعيم، قال حدثنا ابن عيينة، عن عمرو، عن جابر بن زيد، عن ابن عباس، أن النبي صلى الله عليه وسلم وميمونة كانا يغتسلان من إناء واحد‏.‏ قال أبو عبد الله كان ابن عيينة يقول أخيرا عن ابن عباس عن ميمونة، والصحيح ما روى أبو نعيم‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 254,
			"arabicnumber": 254,
			"text": "حدثنا أبو نعيم، قال حدثنا زهير، عن أبي إسحاق، قال حدثني سليمان بن صرد، قال حدثني جبير بن مطعم، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أما أنا فأفيض على رأسي ثلاثا ‏\"‏‏.‏ وأشار بيديه كلتيهما‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 255,
			"arabicnumber": 255,
			"text": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن مخول بن راشد، عن محمد بن علي، عن جابر بن عبد الله، قال كان النبي صلى الله عليه وسلم يفرغ على رأسه ثلاثا‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 256,
			"arabicnumber": 256,
			"text": "حدثنا أبو نعيم، قال حدثنا معمر بن يحيى بن سام، حدثني أبو جعفر، قال قال لي جابر أتاني ابن عمك يعرض بالحسن بن محمد ابن الحنفية قال كيف الغسل من الجنابة فقلت كان النبي صلى الله عليه وسلم يأخذ ثلاثة أكف ويفيضها على رأسه، ثم يفيض على سائر جسده‏.‏ فقال لي الحسن إني رجل كثير الشعر‏.‏ فقلت كان النبي صلى الله عليه وسلم أكثر منك شعرا‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 257,
			"arabicnumber": 257,
			"text": "حدثنا موسى، قال حدثنا عبد الواحد، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال قالت ميمونة وضعت للنبي صلى الله عليه وسلم ماء للغسل، فغسل يديه مرتين أو ثلاثا، ثم أفرغ على شماله فغسل مذاكيره، ثم مسح يده بالأرض، ثم مضمض واستنشق وغسل وجهه ويديه، ثم أفاض على جسده، ثم تحول من مكانه فغسل قدميه‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 258,
			"arabicnumber": 258,
			"text": "حدثنا محمد بن المثنى، قال حدثنا أبو عاصم، عن حنظلة، عن القاسم، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا اغتسل من الجنابة دعا بشىء نحو الحلاب، فأخذ بكفه، فبدأ بشق رأسه الأيمن ثم الأيسر، فقال بهما على رأسه‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 259,
			"arabicnumber": 259,
			"text": "حدثنا عمر بن حفص بن غياث، قال حدثنا أبي، حدثنا الأعمش، قال حدثني سالم، عن كريب، عن ابن عباس، قال حدثتنا ميمونة، قالت صببت للنبي صلى الله عليه وسلم غسلا، فأفرغ بيمينه على يساره فغسلهما، ثم غسل فرجه، ثم قال بيده الأرض فمسحها بالتراب، ثم غسلها، ثم تمضمض واستنشق، ثم غسل وجهه، وأفاض على رأسه، ثم تنحى فغسل قدميه، ثم أتي بمنديل، فلم ينفض بها‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 260,
			"arabicnumber": 260,
			"text": "حدثنا الحميدي، قال حدثنا سفيان، قال حدثنا الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، أن النبي صلى الله عليه وسلم اغتسل من الجنابة، فغسل فرجه بيده، ثم دلك بها الحائط ثم غسلها، ثم توضأ وضوءه للصلاة، فلما فرغ من غسله غسل رجليه‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 261,
			"arabicnumber": 261,
			"text": "حدثنا عبد الله بن مسلمة، أخبرنا أفلح، عن القاسم، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد تختلف أيدينا فيه‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 262,
			"arabicnumber": 262,
			"text": "حدثنا مسدد، قال حدثنا حماد، عن هشام، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا اغتسل من الجنابة غسل يده‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 263,
			"arabicnumber": 263,
			"text": "حدثنا أبو الوليد، قال حدثنا شعبة، عن أبي بكر بن حفص، عن عروة، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد من جنابة‏.‏ وعن عبد الرحمن بن القاسم عن أبيه عن عائشة مثله‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 264,
			"arabicnumber": 264,
			"text": "حدثنا أبو الوليد، قال حدثنا شعبة، عن عبد الله بن عبد الله بن جبر، قال سمعت أنس بن مالك، يقول كان النبي صلى الله عليه وسلم والمرأة من نسائه يغتسلان من إناء واحد‏.‏ زاد مسلم ووهب عن شعبة من الجنابة‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 265,
			"arabicnumber": 265,
			"text": "حدثنا محمد بن محبوب، قال حدثنا عبد الواحد، قال حدثنا الأعمش، عن سالم بن أبي الجعد، عن كريب، مولى ابن عباس عن ابن عباس، قال قالت ميمونة وضعت لرسول الله صلى الله عليه وسلم ماء يغتسل به، فأفرغ على يديه، فغسلهما مرتين مرتين أو ثلاثا، ثم أفرغ بيمينه على شماله، فغسل مذاكيره، ثم دلك يده بالأرض، ثم مضمض واستنشق، ثم غسل وجهه ويديه ثم غسل رأسه ثلاثا، ثم أفرغ على جسده، ثم تنحى من مقامه فغسل قدميه‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 266,
			"arabicnumber": 266,
			"text": "حدثنا موسى بن إسماعيل، قال حدثنا أبو عوانة، حدثنا الأعمش، عن سالم بن أبي الجعد، عن كريب، مولى ابن عباس عن ابن عباس، عن ميمونة بنت الحارث، قالت وضعت لرسول الله صلى الله عليه وسلم غسلا وسترته، فصب على يده، فغسلها مرة أو مرتين ـ قال سليمان لا أدري أذكر الثالثة أم لا ـ ثم أفرغ بيمينه على شماله، فغسل فرجه، ثم دلك يده بالأرض أو بالحائط، ثم تمضمض واستنشق، وغسل وجهه ويديه، وغسل رأسه، ثم صب على جسده، ثم تنحى فغسل قدميه، فناولته خرقة، فقال بيده هكذا، ولم يردها‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 267,
			"arabicnumber": 267,
			"text": "حدثنا محمد بن بشار، قال حدثنا ابن أبي عدي، ويحيى بن سعيد، عن شعبة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال ذكرته لعائشة فقالت يرحم الله أبا عبد الرحمن، كنت أطيب رسول الله صلى الله عليه وسلم، فيطوف على نسائه، ثم يصبح محرما ينضخ طيبا‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 268,
			"arabicnumber": 268,
			"text": "حدثنا محمد بن بشار، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، قال حدثنا أنس بن مالك، قال كان النبي صلى الله عليه وسلم يدور على نسائه في الساعة الواحدة من الليل والنهار، وهن إحدى عشرة‏.‏ قال قلت لأنس أوكان يطيقه قال كنا نتحدث أنه أعطي قوة ثلاثين‏.‏ وقال سعيد عن قتادة إن أنسا حدثهم تسع نسوة‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 269,
			"arabicnumber": 269,
			"text": "حدثنا أبو الوليد، قال حدثنا زائدة، عن أبي حصين، عن أبي عبد الرحمن، عن علي، قال كنت رجلا مذاء فأمرت رجلا أن يسأل النبي صلى الله عليه وسلم لمكان ابنته فسأل فقال ‏ \"‏ توضأ واغسل ذكرك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 270,
			"arabicnumber": 270,
			"text": "حدثنا أبو النعمان، قال حدثنا أبو عوانة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال سألت عائشة فذكرت لها قول ابن عمر ما أحب أن أصبح، محرما أنضخ طيبا‏.‏ فقالت عائشة أنا طيبت رسول الله صلى الله عليه وسلم ثم طاف في نسائه ثم أصبح محرما‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 271,
			"arabicnumber": 271,
			"text": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا الحكم، عن إبراهيم، عن الأسود، عن عائشة، قالت كأني أنظر إلى وبيص الطيب في مفرق النبي صلى الله عليه وسلم وهو محرم‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 273,
			"arabicnumber": 273,
			"text": "",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 274,
			"arabicnumber": 274,
			"text": "حدثنا يوسف بن عيسى، قال أخبرنا الفضل بن موسى، قال أخبرنا الأعمش، عن سالم، عن كريب، مولى ابن عباس عن ابن عباس، عن ميمونة، قالت وضع رسول الله صلى الله عليه وسلم وضوءا لجنابة فأكفأ بيمينه على شماله مرتين، أو ثلاثا، ثم غسل فرجه، ثم ضرب يده بالأرض ـ أو الحائط ـ مرتين أو ثلاثا، ثم مضمض واستنشق، وغسل وجهه وذراعيه، ثم أفاض على رأسه الماء، ثم غسل جسده، ثم تنحى فغسل رجليه‏.‏ قالت فأتيته بخرقة، فلم يردها، فجعل ينفض بيده‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 275,
			"arabicnumber": 275,
			"text": "حدثنا عبد الله بن محمد، قال حدثنا عثمان بن عمر، قال أخبرنا يونس، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال أقيمت الصلاة، وعدلت الصفوف قياما، فخرج إلينا رسول الله صلى الله عليه وسلم فلما قام في مصلاه ذكر أنه جنب فقال لنا ‏:‏ ‏ \"‏ مكانكم ‏\"‏‏.‏ ثم رجع فاغتسل، ثم خرج إلينا ورأسه يقطر، فكبر فصلينا معه‏.‏ تابعه عبد الأعلى عن معمر عن الزهري‏.‏ ورواه الأوزاعي عن الزهري‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 276,
			"arabicnumber": 276,
			"text": "حدثنا عبدان، قال أخبرنا أبو حمزة، قال سمعت الأعمش، عن سالم، عن كريب، عن ابن عباس، قال قالت ميمونة وضعت للنبي صلى الله عليه وسلم غسلا، فسترته بثوب، وصب على يديه فغسلهما، ثم صب بيمينه على شماله، فغسل فرجه، فضرب بيده الأرض فمسحها، ثم غسلها فمضمض، واستنشق، وغسل وجهه وذراعيه، ثم صب على رأسه، وأفاض على جسده، ثم تنحى فغسل قدميه، فناولته ثوبا فلم يأخذه، فانطلق وهو ينفض يديه‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 277,
			"arabicnumber": 277,
			"text": "حدثنا خلاد بن يحيى، قال حدثنا إبراهيم بن نافع، عن الحسن بن مسلم، عن صفية بنت شيبة، عن عائشة، قالت كنا إذا أصابت إحدانا جنابة، أخذت بيديها ثلاثا فوق رأسها، ثم تأخذ بيدها على شقها الأيمن، وبيدها الأخرى على شقها الأيسر‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 278,
			"arabicnumber": 278,
			"text": "حدثنا إسحاق بن نصر، قال حدثنا عبد الرزاق، عن معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ كانت بنو إسرائيل يغتسلون عراة، ينظر بعضهم إلى بعض، وكان موسى يغتسل وحده، فقالوا والله ما يمنع موسى أن يغتسل معنا إلا أنه آدر، فذهب مرة يغتسل، فوضع ثوبه على حجر، ففر الحجر بثوبه، فخرج موسى في إثره يقول ثوبي يا حجر‏.‏ حتى نظرت بنو إسرائيل إلى موسى، فقالوا والله ما بموسى من بأس‏.‏ وأخذ ثوبه، فطفق بالحجر ضربا ‏\"‏‏.‏ فقال أبو هريرة والله إنه لندب بالحجر ستة أو سبعة ضربا بالحجر‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 279,
			"arabicnumber": 279,
			"text": "وعن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بينا أيوب يغتسل عريانا فخر عليه جراد من ذهب، فجعل أيوب يحتثي في ثوبه، فناداه ربه يا أيوب، ألم أكن أغنيتك عما ترى قال بلى وعزتك ولكن لا غنى بي عن بركتك ‏\"‏‏.‏ ورواه إبراهيم عن موسى بن عقبة عن صفوان عن عطاء بن يسار عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ بينا أيوب يغتسل عريانا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 280,
			"arabicnumber": 280,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح، فوجدته يغتسل وفاطمة تستره فقال ‏ \"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 281,
			"arabicnumber": 281,
			"text": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا سفيان، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، قالت سترت النبي صلى الله عليه وسلم وهو يغتسل من الجنابة، فغسل يديه ثم صب بيمينه على شماله، فغسل فرجه، وما أصابه، ثم مسح بيده على الحائط أو الأرض، ثم توضأ وضوءه للصلاة، غير رجليه، ثم أفاض على جسده الماء، ثم تنحى فغسل قدميه‏.‏ تابعه أبو عوانة وابن فضيل في الستر‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 282,
			"arabicnumber": 282,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة أم المؤمنين، أنها قالت جاءت أم سليم امرأة أبي طلحة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله، إن الله لا يستحيي من الحق، هل على المرأة من غسل إذا هي احتلمت فقال رسول الله صلى الله عليه وسلم ‏ \"‏ نعم إذا رأت الماء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 283,
			"arabicnumber": 283,
			"text": "حدثنا علي بن عبد الله، قال حدثنا يحيى، قال حدثنا حميد، قال حدثنا بكر، عن أبي رافع، عن أبي هريرة، أن النبي صلى الله عليه وسلم لقيه في بعض طريق المدينة وهو جنب، فانخنست منه، فذهب فاغتسل، ثم جاء فقال ‏\"‏ أين كنت يا أبا هريرة ‏\"‏‏.‏ قال كنت جنبا، فكرهت أن أجالسك وأنا على غير طهارة‏.‏ فقال ‏\"‏ سبحان الله، إن المؤمن لا ينجس ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 284,
			"arabicnumber": 284,
			"text": "حدثنا عبد الأعلى بن حماد، قال حدثنا يزيد بن زريع، قال حدثنا سعيد، عن قتادة، أن أنس بن مالك، حدثهم أن نبي الله صلى الله عليه وسلم كان يطوف على نسائه في الليلة الواحدة، وله يومئذ تسع نسوة‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 285,
			"arabicnumber": 285,
			"text": "حدثنا عياش، قال حدثنا عبد الأعلى، حدثنا حميد، عن بكر، عن أبي رافع، عن أبي هريرة، قال لقيني رسول الله صلى الله عليه وسلم وأنا جنب، فأخذ بيدي، فمشيت معه حتى قعد فانسللت، فأتيت الرحل، فاغتسلت ثم جئت وهو قاعد فقال ‏\"‏ أين كنت يا أبا هر ‏\"‏ فقلت له‏.‏ فقال ‏\"‏ سبحان الله يا أبا هر إن المؤمن لا ينجس ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 286,
			"arabicnumber": 286,
			"text": "حدثنا أبو نعيم، قال حدثنا هشام، وشيبان، عن يحيى، عن أبي سلمة، قال سألت عائشة أكان النبي صلى الله عليه وسلم يرقد وهو جنب قالت نعم ويتوضأ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 287,
			"arabicnumber": 287,
			"text": "حدثنا قتيبة، قال حدثنا الليث، عن نافع، عن ابن عمر، أن عمر بن الخطاب، سأل رسول الله صلى الله عليه وسلم أيرقد أحدنا وهو جنب قال ‏ \"‏ نعم إذا توضأ أحدكم فليرقد وهو جنب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 288,
			"arabicnumber": 288,
			"text": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عبيد الله بن أبي جعفر، عن محمد بن عبد الرحمن، عن عروة، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا أراد أن ينام وهو جنب، غسل فرجه، وتوضأ للصلاة‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 289,
			"arabicnumber": 289,
			"text": "حدثنا موسى بن إسماعيل، قال حدثنا جويرية، عن نافع، عن عبد الله، قال استفتى عمر النبي صلى الله عليه وسلم أينام أحدنا وهو جنب قال ‏ \"‏ نعم، إذا توضأ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 290,
			"arabicnumber": 290,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه قال ذكر عمر بن الخطاب لرسول الله صلى الله عليه وسلم أنه تصيبه الجنابة من الليل، فقال له رسول الله صلى الله عليه وسلم ‏ \"‏ توضأ واغسل ذكرك ثم نم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 291,
			"arabicnumber": 291,
			"text": "حدثنا معاذ بن فضالة، قال حدثنا هشام، ح وحدثنا أبو نعيم، عن هشام، عن قتادة، عن الحسن، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا جلس بين شعبها الأربع ثم جهدها، فقد وجب الغسل ‏\"‏‏.‏ تابعه عمرو بن مرزوق عن شعبة مثله‏.‏ وقال موسى حدثنا أبان قال حدثنا قتادة أخبرنا الحسن مثله‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 292,
			"arabicnumber": 292,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، قال يحيى وأخبرني أبو سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد الجهني أخبره أنه، سأل عثمان بن عفان فقال أرأيت إذا جامع الرجل امرأته فلم يمن‏.‏ قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك علي بن أبي طالب والزبير بن العوام وطلحة بن عبيد الله وأبى بن كعب ـ رضى الله عنهم ـ فأمروه بذلك‏.‏ قال يحيى وأخبرني أبو سلمة أن عروة بن الزبير أخبره أن أبا أيوب أخبره أنه سمع ذلك من رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 293,
			"arabicnumber": 293,
			"text": "حدثنا مسدد، حدثنا يحيى، عن هشام بن عروة، قال أخبرني أبي قال، أخبرني أبو أيوب، قال أخبرني أبى بن كعب، أنه قال يا رسول الله إذا جامع الرجل المرأة فلم ينزل قال ‏ \"‏ يغسل ما مس المرأة منه، ثم يتوضأ ويصلي ‏\"‏‏.‏ قال أبو عبد الله الغسل أحوط، وذاك الآخر، وإنما بينا لاختلافهم‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 45
			}
		}
	]
}