{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"54": "Conditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2712,
			"arabicnumber": 2712,
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2713,
			"arabicnumber": 2713,
			"text": "قال عروة فأخبرتني عائشة، أن رسول الله صلى الله عليه وسلم كان يمتحنهن بهذه الآية ‏{‏يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن ‏}‏ إلى ‏{‏غفور رحيم‏}‏‏.‏ قال عروة قالت عائشة فمن أقر بهذا الشرط منهن قال لها رسول الله صلى الله عليه وسلم ‏\"‏ قد بايعتك ‏\"‏‏.‏ كلاما يكلمها به، والله ما مست يده يد امرأة قط في المبايعة، وما بايعهن إلا بقوله‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2714,
			"arabicnumber": 2714,
			"text": "حدثنا أبو نعيم، حدثنا سفيان، عن زياد بن علاقة، قال سمعت جريرا ـ رضى الله عنه ـ يقول بايعت رسول الله صلى الله عليه وسلم فاشترط على والنصح لكل مسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2715,
			"arabicnumber": 2715,
			"text": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل، قال حدثني قيس بن أبي حازم، عن جرير بن عبد الله ـ رضى الله عنه ـ قال بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة وإيتاء الزكاة والنصح لكل مسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2716,
			"arabicnumber": 2716,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من باع نخلا قد أبرت فثمرتها للبائع إلا أن يشترط المبتاع ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2717,
			"arabicnumber": 2717,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا الليث، عن ابن شهاب، عن عروة، أن عائشة،ـ رضى الله عنها ـ أخبرته أن بريرة جاءت عائشة تستعينها في كتابتها، ولم تكن قضت من كتابتها شيئا، قالت لها عائشة ارجعي إلى أهلك، فإن أحبوا أن أقضي عنك كتابتك، ويكون ولاؤك لي فعلت‏.‏ فذكرت ذلك بريرة إلى أهلها فأبوا وقالوا إن شاءت أن تحتسب عليك فلتفعل، ويكون لنا ولاؤك‏.‏ فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال لها ‏ \"‏ ابتاعي فأعتقي، فإنما الولاء لمن أعتق ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2718,
			"arabicnumber": 2718,
			"text": "حدثنا أبو نعيم، حدثنا زكرياء، قال سمعت عامرا، يقول حدثني جابر ـ رضى الله عنه أنه كان يسير على جمل له قد أعيا، فمر النبي صلى الله عليه وسلم فضربه، فدعا له، فسار بسير ليس يسير مثله ثم قال ‏\"‏ بعنيه بوقية ‏\"‏‏.‏ قلت لا‏.‏ ثم قال ‏\"‏ بعنيه بوقية ‏\"‏‏.‏ فبعته فاستثنيت حملانه إلى أهلي، فلما قدمنا أتيته بالجمل، ونقدني ثمنه، ثم انصرفت، فأرسل على إثري، قال ‏\"‏ ما كنت لآخذ جملك، فخذ جملك ذلك فهو مالك ‏\"‏‏.‏ قال شعبة عن مغيرة عن عامر عن جابر أفقرني رسول الله صلى الله عليه وسلم ظهره إلى المدينة‏.‏ وقال إسحاق عن جرير عن مغيرة فبعته على أن لي فقار ظهره حتى أبلغ المدينة‏.‏ وقال عطاء وغيره لك ظهره إلى المدينة، وقال محمد بن المنكدر عن جابر شرط ظهره إلى المدينة‏.‏ وقال زيد بن أسلم عن جابر ولك ظهره حتى ترجع‏.‏ وقال أبو الزبير عن جابر أفقرناك ظهره إلى المدينة‏.‏ وقال الأعمش عن سالم عن جابر تبلغ عليه إلى أهلك‏.‏ وقال عبيد الله وابن إسحاق عن وهب عن جابر اشتراه النبي صلى الله عليه وسلم بوقية‏.‏ وتابعه زيد بن أسلم عن جابر‏.‏ وقال ابن جريج عن عطاء وغيره عن جابر أخذته بأربعة دنانير‏.‏ وهذا يكون وقية على حساب الدينار بعشرة دراهم‏.‏ ولم يبين الثمن مغيرة عن الشعبي عن جابر، وابن المنكدر وأبو الزبير عن جابر‏.‏ وقال الأعمش عن سالم عن جابر وقية ذهب‏.‏ وقال أبو إسحاق عن سالم عن جابر بمائتى درهم‏.‏ وقال داود بن قيس عن عبيد الله بن مقسم عن جابر اشتراه بطريق تبوك، أحسبه قال بأربع أواق‏.‏ وقال أبو نضرة عن جابر اشتراه بعشرين دينارا‏.‏ وقول الشعبي بوقية أكثر‏.‏ الاشتراط أكثر وأصح عندي‏.‏ قاله أبو عبد الله‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2719,
			"arabicnumber": 2719,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ قال قالت الأنصار للنبي صلى الله عليه وسلم اقسم بيننا وبين إخواننا النخيل‏.‏ قال ‏ \"‏ لا ‏\"‏‏.‏ فقال تكفونا المئونة ونشرككم في الثمرة‏.‏ قالوا سمعنا وأطعنا‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2720,
			"arabicnumber": 2720,
			"text": "حدثنا موسى، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله ـ رضى الله عنه ـ قال أعطى رسول الله صلى الله عليه وسلم خيبر اليهود أن يعملوها ويزرعوها، ولهم شطر ما يخرج منها‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2721,
			"arabicnumber": 2721,
			"text": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أحق الشروط أن توفوا به ما استحللتم به الفروج ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2722,
			"arabicnumber": 2722,
			"text": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، حدثنا يحيى بن سعيد، قال سمعت حنظلة الزرقي، قال سمعت رافع بن خديج ـ رضى الله عنه ـ يقول كنا أكثر الأنصار حقلا، فكنا نكري الأرض، فربما أخرجت هذه ولم تخرج ذه، فنهينا عن ذلك، ولم ننه عن الورق‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2723,
			"arabicnumber": 2723,
			"text": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا معمر، عن الزهري، عن سعيد، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يبيع حاضر لباد، ولا تناجشوا، ولا يزيدن على بيع أخيه، ولا يخطبن على خطبته، ولا تسأل المرأة طلاق أختها لتستكفئ إناءها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2724,
			"arabicnumber": 2724,
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، وزيد بن خالد الجهني، رضى الله عنهم أنهما قالا إن رجلا من الأعراب أتى رسول الله صلى الله عليه وسلم فقال رسول الله أنشدك الله إلا قضيت لي بكتاب الله‏.‏ فقال الخصم الآخر وهو أفقه منه نعم فاقض بيننا بكتاب الله، وائذن لي‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قل ‏\"‏‏.‏ قال إن ابني كان عسيفا على هذا، فزنى بامرأته، وإني أخبرت أن على ابني الرجم، فافتديت منه بمائة شاة ووليدة، فسألت أهل العلم فأخبروني أنما على ابني جلد مائة، وتغريب عام، وأن على امرأة هذا الرجم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله، الوليدة والغنم رد، وعلى ابنك جلد مائة وتغريب عام، اغد يا أنيس إلى امرأة هذا فإن اعترفت فارجمها ‏\"‏‏.‏ قال فغدا عليها فاعترفت، فأمر بها رسول الله صلى الله عليه وسلم فرجمت‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2726,
			"arabicnumber": 2726,
			"text": "حدثنا خلاد بن يحيى، حدثنا عبد الواحد بن أيمن المكي، عن أبيه، قال دخلت على عائشة ـ رضى الله عنها ـ قالت دخلت على بريرة وهى مكاتبة، فقالت يا أم المؤمنين اشتريني فإن أهلي يبيعوني فأعتقيني قالت نعم‏.‏ قالت إن أهلي لا يبيعوني حتى يشترطوا ولائي‏.‏ قالت لا حاجة لي فيك‏.‏ فسمع ذلك النبي صلى الله عليه وسلم أو بلغه، فقال ‏\"‏ ما شأن بريرة فقال اشتريها فأعتقيها وليشترطوا ما شاءوا ‏\"‏‏.‏ قالت فاشتريتها فأعتقتها، واشترط أهلها ولاءها، فقال النبي صلى الله عليه وسلم ‏\"‏ الولاء لمن أعتق، وإن اشترطوا مائة شرط ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2727,
			"arabicnumber": 2727,
			"text": "حدثنا محمد بن عرعرة، حدثنا شعبة، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة ـ رضى الله عنه ـ قال نهى رسول الله صلى الله عليه وسلم عن التلقي، وأن يبتاع المهاجر للأعرابي، وأن تشترط المرأة طلاق أختها، وأن يستام الرجل على سوم أخيه، ونهى عن النجش، وعن التصرية‏.‏ تابعه معاذ وعبد الصمد عن شعبة‏.‏ وقال غندر وعبد الرحمن نهي‏.‏ وقال آدم نهينا‏.‏ وقال النضر وحجاج بن منهال نهى‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2728,
			"arabicnumber": 2728,
			"text": "حدثنا إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبره قال أخبرني يعلى بن مسلم، وعمرو بن دينار، عن سعيد بن جبير، يزيد أحدهما على صاحبه وغيرهما قد سمعته يحدثه عن سعيد بن جبير قال إنا لعند ابن عباس ـ رضى الله عنهما ـ قال حدثني أبى بن كعب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ موسى رسول الله ‏\"‏ فذكر الحديث ‏{‏قال ألم أقل إنك لن تستطيع معي صبرا‏}‏ كانت الأولى نسيانا، والوسطى شرطا، والثالثة عمدا ‏{‏قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا‏}‏‏.‏ ‏{‏لقيا غلاما فقتله‏}‏ فانطلقا فوجدا جدارا يريد أن ينقض فأقامه‏.‏ قرأها ابن عباس أمامهم ملك‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2729,
			"arabicnumber": 2729,
			"text": "حدثنا إسماعيل، حدثنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة، قالت جاءتني بريرة فقالت كاتبت أهلي على تسع أواق في كل عام أوقية، فأعينيني‏.‏ فقالت إن أحبوا أن أعدها لهم، ويكون ولاؤك لي فعلت‏.‏ فذهبت بريرة إلى أهلها، فقالت لهم، فأبوا عليها، فجاءت من عندهم ورسول الله صلى الله عليه وسلم جالس، فقالت إني قد عرضت ذلك عليهم فأبوا إلا أن يكون الولاء لهم‏.‏ فسمع النبي صلى الله عليه وسلم فأخبرت عائشة النبي صلى الله عليه وسلم فقال ‏\"‏ خذيها واشترطي لهم الولاء، فإنما الولاء لمن أعتق ‏\"‏‏.‏ ففعلت عائشة، ثم قام رسول الله صلى الله عليه وسلم في الناس، فحمد الله وأثنى عليه، ثم قال ‏\"‏ ما بال رجال يشترطون شروطا ليست في كتاب الله ما كان من شرط ليس في كتاب الله فهو باطل، وإن كان مائة شرط، قضاء الله أحق، وشرط الله أوثق، وإنما الولاء لمن أعتق ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2730,
			"arabicnumber": 2730,
			"text": "حدثنا أبو أحمد، حدثنا محمد بن يحيى أبو غسان الكناني، أخبرنا مالك، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال لما فدع أهل خيبر عبد الله بن عمر، قام عمر خطيبا فقال إن رسول الله صلى الله عليه وسلم كان عامل يهود خيبر على أموالهم، وقال ‏\"‏ نقركم ما أقركم الله ‏\"‏‏.‏ وإن عبد الله بن عمر خرج إلى ماله هناك فعدي عليه من الليل، ففدعت يداه ورجلاه، وليس لنا هناك عدو غيرهم، هم عدونا وتهمتنا، وقد رأيت إجلاءهم، فلما أجمع عمر على ذلك أتاه أحد بني أبي الحقيق، فقال يا أمير المؤمنين، أتخرجنا وقد أقرنا محمد صلى الله عليه وسلم وعاملنا على الأموال، وشرط ذلك لنا فقال عمر أظننت أني نسيت قول رسول الله صلى الله عليه وسلم ‏\"‏ كيف بك إذا أخرجت من خيبر تعدو بك قلوصك، ليلة بعد ليلة ‏\"‏‏.‏ فقال كانت هذه هزيلة من أبي القاسم‏.‏ قال كذبت يا عدو الله‏.‏ فأجلاهم عمر وأعطاهم قيمة ما كان لهم من الثمر مالا وإبلا وعروضا، من أقتاب وحبال وغير ذلك‏.‏ رواه حماد بن سلمة عن عبيد الله، أحسبه عن نافع، عن ابن عمر، عن عمر، عن النبي صلى الله عليه وسلم، اختصره‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2732,
			"arabicnumber": 2732,
			"text": "",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2733,
			"arabicnumber": 2733,
			"text": "وقال عقيل عن الزهري، قال عروة فأخبرتني عائشة، أن رسول الله صلى الله عليه وسلم كان يمتحنهن، وبلغنا أنه لما أنزل الله تعالى أن يردوا إلى المشركين ما أنفقوا على من هاجر من أزواجهم، وحكم على المسلمين، أن لا يمسكوا بعصم الكوافر، أن عمر طلق امرأتين قريبة بنت أبي أمية، وابنة جرول الخزاعي، فتزوج قريبة معاوية، وتزوج الأخرى أبو جهم، فلما أبى الكفار أن يقروا بأداء ما أنفق المسلمون على أزواجهم، أنزل الله تعالى ‏{‏وإن فاتكم شىء من أزواجكم إلى الكفار فعاقبتم‏}‏ والعقب ما يؤدي المسلمون إلى من هاجرت امرأته من الكفار، فأمر أن يعطى من ذهب له زوج من المسلمين ما أنفق من صداق نساء الكفار اللائي هاجرن، وما نعلم أحدا من المهاجرات ارتدت بعد إيمانها‏.‏ وبلغنا أن أبا بصير بن أسيد الثقفي قدم على النبي صلى الله عليه وسلم مؤمنا مهاجرا في المدة، فكتب الأخنس بن شريق إلى النبي صلى الله عليه وسلم يسأله أبا بصير، فذكر الحديث‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2734,
			"arabicnumber": 2734,
			"text": "وقال الليث حدثني جعفر بن ربيعة، عن عبد الرحمن بن هرمز، عن أبي هريرة، رضى الله عنه عن رسول الله صلى الله عليه وسلم أنه ذكر رجلا سأل بعض بني إسرائيل أن يسلفه ألف دينار، فدفعها إليه إلى أجل مسمى‏.‏ وقال ابن عمر ـ رضى الله عنهما ـ وعطاء إذا أجله في القرض جاز‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2735,
			"arabicnumber": 2735,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن يحيى، عن عمرة، عن عائشة ـ رضى الله عنها ـ قالت أتتها بريرة تسألها في كتابتها، فقالت إن شئت أعطيت أهلك ويكون الولاء لي‏.‏ فلما جاء رسول الله صلى الله عليه وسلم ذكرته ذلك قال النبي صلى الله عليه وسلم ‏\"‏ ابتاعيها فأعتقيها، فإنما الولاء لمن أعتق ‏\"‏‏.‏ ثم قام رسول الله صلى الله عليه وسلم على المنبر فقال ‏\"‏ ما بال أقوام يشترطون شروطا ليست في كتاب الله من اشترط شرطا ليس في كتاب الله فليس له، وإن اشترط مائة شرط ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2736,
			"arabicnumber": 2736,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن لله تسعة وتسعين اسما مائة إلا واحدا من أحصاها دخل الجنة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2737,
			"arabicnumber": 2737,
			"text": "حدثنا قتيبة بن سعيد، حدثنا محمد بن عبد الله الأنصاري، حدثنا ابن عون، قال أنبأني نافع، عن ابن عمر ـ رضى الله عنهما ـ أن عمر بن الخطاب، أصاب أرضا بخيبر، فأتى النبي صلى الله عليه وسلم يستأمره فيها، فقال يا رسول الله، إني أصبت أرضا بخيبر، لم أصب مالا قط أنفس عندي منه، فما تأمر به قال ‏ \"‏ إن شئت حبست أصلها، وتصدقت بها ‏\"‏‏.‏ قال فتصدق بها عمر أنه لا يباع ولا يوهب ولا يورث، وتصدق بها في الفقراء وفي القربى، وفي الرقاب، وفي سبيل الله، وابن السبيل، والضيف، لا جناح على من وليها أن يأكل منها بالمعروف، ويطعم غير متمول‏.‏ قال فحدثت به ابن سيرين فقال غير متأثل مالا‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 24
			}
		}
	]
}