{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3091,
			"arabicnumber": 3091,
			"text": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أخبرني علي بن الحسين، أن حسين بن علي، عليهما السلام أخبره أن عليا قال كانت لي شارف من نصيبي من المغنم يوم بدر، وكان النبي صلى الله عليه وسلم أعطاني شارفا من الخمس، فلما أردت أن أبتني بفاطمة بنت رسول الله صلى الله عليه وسلم واعدت رجلا صواغا من بني قينقاع، أن يرتحل معي فنأتي بإذخر أردت أن أبيعه الصواغين، وأستعين به في وليمة عرسي، فبينا أنا أجمع لشارفى متاعا من الأقتاب والغرائر والحبال، وشارفاى مناخان إلى جنب حجرة رجل من الأنصار، رجعت حين جمعت ما جمعت، فإذا شارفاى قد اجتب أسنمتهما وبقرت خواصرهما، وأخذ من أكبادهما، فلم أملك عينى حين رأيت ذلك المنظر منهما، فقلت من فعل هذا فقالوا فعل حمزة بن عبد المطلب، وهو في هذا البيت في شرب من الأنصار‏.‏ فانطلقت حتى أدخل على النبي صلى الله عليه وسلم وعنده زيد بن حارثة، فعرف النبي صلى الله عليه وسلم في وجهي الذي لقيت، فقال النبي صلى الله عليه وسلم ‏ \"‏ ما لك ‏\"‏ فقلت يا رسول الله، ما رأيت كاليوم قط، عدا حمزة على ناقتى، فأجب أسنمتهما وبقر خواصرهما، وها هو ذا في بيت معه شرب‏.‏ فدعا النبي صلى الله عليه وسلم بردائه فارتدى ثم انطلق يمشي، واتبعته أنا وزيد بن حارثة حتى جاء البيت الذي فيه حمزة، فاستأذن فأذنوا لهم فإذا هم شرب، فطفق رسول الله صلى الله عليه وسلم يلوم حمزة فيما فعل، فإذا حمزة قد ثمل محمرة عيناه، فنظر حمزة إلى رسول الله صلى الله عليه وسلم، ثم صعد النظر فنظر إلى ركبته، ثم صعد النظر فنظر إلى سرته، ثم صعد النظر فنظر إلى وجهه ثم قال حمزة هل أنتم إلا عبيد لأبي فعرف رسول الله صلى الله عليه وسلم أنه قد ثمل، فنكص رسول الله صلى الله عليه وسلم على عقبيه القهقرى وخرجنا معه‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3093,
			"arabicnumber": 3093,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3094,
			"arabicnumber": 3094,
			"text": "حدثنا إسحاق بن محمد الفروي، حدثنا مالك بن أنس، عن ابن شهاب، عن مالك بن أوس بن الحدثان،، وكان، محمد بن جبير ذكر لي ذكرا من حديثه ذلك، فانطلقت حتى أدخل على مالك بن أوس، فسألته عن ذلك الحديث فقال مالك بينا أنا جالس في أهلي حين متع النهار، إذا رسول عمر بن الخطاب يأتيني فقال أجب أمير المؤمنين‏.‏ فانطلقت معه حتى أدخل على عمر، فإذا هو جالس على رمال سرير، ليس بينه وبينه فراش متكئ على وسادة من أدم، فسلمت عليه ثم جلست فقال يا مال، إنه قدم علينا من قومك أهل أبيات، وقد أمرت فيهم برضخ فاقبضه فاقسمه بينهم‏.‏ فقلت يا أمير المؤمنين، لو أمرت به غيري‏.‏ قال اقبضه أيها المرء‏.‏ فبينا أنا جالس عنده أتاه حاجبه يرفا فقال هل لك في عثمان وعبد الرحمن بن عوف والزبير وسعد بن أبي وقاص يستأذنون قال نعم‏.‏ فأذن لهم فدخلوا فسلموا وجلسوا، ثم جلس يرفا يسيرا ثم قال هل لك في علي وعباس قال نعم‏.‏ فأذن لهما، فدخلا فسلما فجلسا، فقال عباس يا أمير المؤمنين، اقض بيني وبين هذا‏.‏ وهما يختصمان فيما أفاء الله على رسوله صلى الله عليه وسلم من بني النضير‏.‏ فقال الرهط عثمان وأصحابه يا أمير المؤمنين، اقض بينهما وأرح أحدهما من الآخر‏.‏ قال عمر تيدكم، أنشدكم بالله الذي بإذنه تقوم السماء والأرض، هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ يريد رسول الله صلى الله عليه وسلم نفسه‏.‏ قال الرهط قد قال ذلك‏.‏ فأقبل عمر على علي وعباس فقال أنشدكما الله، أتعلمان أن رسول الله صلى الله عليه وسلم قد قال ذلك قالا قد قال ذلك‏.‏ قال عمر فإني أحدثكم عن هذا الأمر، إن الله قد خص رسوله صلى الله عليه وسلم في هذا الفىء بشىء لم يعطه أحدا غيره ـ ثم قرأ ‏{‏وما أفاء الله على رسوله منهم‏}‏ إلى قوله ‏{‏قدير‏}‏ ـ فكانت هذه خالصة لرسول الله صلى الله عليه وسلم‏.‏ والله ما احتازها دونكم، ولا استأثر بها عليكم قد أعطاكموه، وبثها فيكم حتى بقي منها هذا المال، فكان رسول الله صلى الله عليه وسلم ينفق على أهله نفقة سنتهم من هذا المال، ثم يأخذ ما بقي فيجعله مجعل مال الله، فعمل رسول الله صلى الله عليه وسلم بذلك حياته، أنشدكم بالله هل تعلمون ذلك قالوا نعم‏.‏ ثم قال لعلي وعباس أنشدكما بالله هل تعلمان ذلك قال عمر ثم توفى الله نبيه صلى الله عليه وسلم فقال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم‏.‏ فقبضها أبو بكر، فعمل فيها بما عمل رسول الله صلى الله عليه وسلم، والله يعلم إنه فيها لصادق بار راشد تابع للحق، ثم توفى الله أبا بكر، فكنت أنا ولي أبي بكر، فقبضتها سنتين من إمارتي، أعمل فيها بما عمل رسول الله صلى الله عليه وسلم وما عمل فيها أبو بكر، والله يعلم إني فيها لصادق بار راشد تابع للحق، ثم جئتماني تكلماني وكلمتكما واحدة، وأمركما واحد، جئتني يا عباس تسألني نصيبك من ابن أخيك، وجاءني هذا ـ يريد عليا ـ يريد نصيب امرأته من أبيها، فقلت لكما إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ فلما بدا لي أن أدفعه إليكما قلت إن شئتما دفعتها إليكما على أن عليكما عهد الله وميثاقه لتعملان فيها بما عمل فيها رسول الله صلى الله عليه وسلم، وبما عمل فيها أبو بكر، وبما عملت فيها منذ وليتها، فقلتما ادفعها إلينا‏.‏ فبذلك دفعتها إليكما، فأنشدكم بالله، هل دفعتها إليهما بذلك قال الرهط نعم‏.‏ ثم أقبل على علي وعباس فقال أنشدكما بالله هل دفعتها إليكما بذلك قالا نعم‏.‏ قال فتلتمسان مني قضاء غير ذلك فوالله الذي بإذنه تقوم السماء والأرض، لا أقضي فيها قضاء غير ذلك، فإن عجزتما عنها فادفعاها إلى، فإني أكفيكماها‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3095,
			"arabicnumber": 3095,
			"text": "حدثنا أبو النعمان، حدثنا حماد، عن أبي حمزة الضبعي، قال سمعت ابن عباس ـ رضى الله عنهما ـ يقول قدم وفد عبد القيس فقالوا يا رسول الله، إنا هذا الحى من ربيعة، بيننا وبينك كفار مضر، فلسنا نصل إليك إلا في الشهر الحرام، فمرنا بأمر نأخذ منه وندعو إليه من وراءنا‏.‏ قال ‏ \"‏ آمركم بأربع، وأنهاكم عن أربع، الإيمان بالله شهادة أن لا إله إلا الله ـ وعقد بيده ـ وإقام الصلاة وإيتاء الزكاة وصيام رمضان، وأن تؤدوا لله خمس ما غنمتم، وأنهاكم عن الدباء والنقير والحنتم والمزفت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3096,
			"arabicnumber": 3096,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يقتسم ورثتي دينارا، ما تركت بعد نفقة نسائي ومئونة عاملي فهو صدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3097,
			"arabicnumber": 3097,
			"text": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو أسامة، حدثنا هشام، عن أبيه، عن عائشة، قالت توفي رسول الله صلى الله عليه وسلم وما في بيتي من شىء يأكله ذو كبد، إلا شطر شعير في رف لي، فأكلت منه حتى طال على، فكلته ففني‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3098,
			"arabicnumber": 3098,
			"text": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني أبو إسحاق، قال سمعت عمرو بن الحارث، قال ما ترك النبي صلى الله عليه وسلم إلا سلاحه وبغلته البيضاء، وأرضا تركها صدقة‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3099,
			"arabicnumber": 3099,
			"text": "حدثنا حبان بن موسى، ومحمد، قالا أخبرنا عبد الله، أخبرنا معمر، ويونس، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم قالت لما ثقل رسول الله صلى الله عليه وسلم استأذن أزواجه أن يمرض في بيتي فأذن له‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3100,
			"arabicnumber": 3100,
			"text": "حدثنا ابن أبي مريم، حدثنا نافع، سمعت ابن أبي مليكة، قال قالت عائشة ـ رضى الله عنها توفي النبي صلى الله عليه وسلم في بيتي، وفي نوبتي، وبين سحري ونحري، وجمع الله بين ريقي وريقه‏.‏ قالت دخل عبد الرحمن بسواك، فضعف النبي صلى الله عليه وسلم عنه، فأخذته فمضغته ثم سننته به‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3101,
			"arabicnumber": 3101,
			"text": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن علي بن حسين، أن صفية، زوج النبي صلى الله عليه وسلم أخبرته أنها جاءت رسول الله صلى الله عليه وسلم تزوره، وهو معتكف في المسجد في العشر الأواخر من رمضان ثم قامت تنقلب فقام معها رسول الله صلى الله عليه وسلم حتى إذا بلغ قريبا من باب المسجد عند باب أم سلمة زوج النبي صلى الله عليه وسلم مر بهما رجلان من الأنصار، فسلما على رسول الله صلى الله عليه وسلم، ثم نفذا فقال لهما رسول الله صلى الله عليه وسلم ‏\"‏ على رسلكما ‏\"‏‏.‏ قالا سبحان الله يا رسول الله‏.‏ وكبر عليهما ذلك‏.‏ فقال ‏\"‏ إن الشيطان يبلغ من الإنسان مبلغ الدم، وإني خشيت أن يقذف في قلوبكما شيئا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3102,
			"arabicnumber": 3102,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن محمد بن يحيى بن حبان، عن واسع بن حبان، عن عبد الله بن عمر ـ رضى الله عنهما ـ قال ارتقيت فوق بيت حفصة، فرأيت النبي صلى الله عليه وسلم يقضي حاجته، مستدبر القبلة، مستقبل الشأم‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3103,
			"arabicnumber": 3103,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن هشام، عن أبيه، أن عائشة ـ رضى الله عنها ـ قالت كان رسول الله صلى الله عليه وسلم يصلي العصر والشمس لم تخرج من حجرتها‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3104,
			"arabicnumber": 3104,
			"text": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله ـ رضى الله عنه ـ قال قام النبي صلى الله عليه وسلم خطيبا فأشار نحو مسكن عائشة فقال ‏ \"‏ هنا الفتنة ـ ثلاثا ـ من حيث يطلع قرن الشيطان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3105,
			"arabicnumber": 3105,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر، عن عمرة ابنة عبد الرحمن، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرتها أن رسول الله صلى الله عليه وسلم كان عندها، وأنها سمعت صوت إنسان يستأذن في بيت حفصة فقلت يا رسول الله، هذا رجل يستأذن في بيتك‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ أراه فلانا، لعم حفصة من الرضاعة، الرضاعة تحرم ما تحرم الولادة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3106,
			"arabicnumber": 3106,
			"text": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أبا بكر ـ رضى الله عنه ـ لما استخلف بعثه إلى البحرين، وكتب له هذا الكتاب وختمه، وكان نقش الخاتم ثلاثة أسطر محمد سطر، ورسول سطر، والله سطر‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3107,
			"arabicnumber": 3107,
			"text": "حدثني عبد الله بن محمد، حدثنا محمد بن عبد الله الأسدي، حدثنا عيسى بن طهمان، قال أخرج إلينا أنس نعلين جرداوين لهما قبالان، فحدثني ثابت البناني بعد عن أنس أنهما نعلا النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3108,
			"arabicnumber": 3108,
			"text": "حدثني محمد بن بشار، حدثنا عبد الوهاب، حدثنا أيوب، عن حميد بن هلال، عن أبي بردة، قال أخرجت إلينا عائشة ـ رضى الله عنها ـ كساء ملبدا وقالت في هذا نزع روح النبي صلى الله عليه وسلم‏.‏ وزاد سليمان عن حميد عن أبي بردة قال أخرجت إلينا عائشة إزارا غليظا مما يصنع باليمن، وكساء من هذه التي يدعونها الملبدة‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3109,
			"arabicnumber": 3109,
			"text": "حدثنا عبدان، عن أبي حمزة، عن عاصم، عن ابن سيرين، عن أنس بن مالك ـ رضى الله عنه ـ أن قدح، النبي صلى الله عليه وسلم انكسر، فاتخذ مكان الشعب سلسلة من فضة‏.‏ قال عاصم رأيت القدح وشربت فيه‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3110,
			"arabicnumber": 3110,
			"text": "حدثنا سعيد بن محمد الجرمي، حدثنا يعقوب بن إبراهيم، حدثنا أبي أن الوليد بن كثير، حدثه عن محمد بن عمرو بن حلحلة الدؤلي، حدثه أن ابن شهاب حدثه أن علي بن حسين حدثه أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل حسين بن علي رحمة الله عليه لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها فقلت له لا‏.‏ فقال له فهل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه، وايم الله، لئن أعطيتنيه لا يخلص إليهم أبدا حتى تبلغ نفسي، إن علي بن أبي طالب خطب ابنة أبي جهل على فاطمة ـ عليها السلام ـ فسمعت رسول الله صلى الله عليه وسلم يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني، وأنا أتخوف أن تفتن في دينها ‏\"‏‏.‏ ثم ذكر صهرا له من بني عبد شمس، فأثنى عليه في مصاهرته إياه قال ‏\"‏ حدثني فصدقني، ووعدني فوفى لي، وإني لست أحرم حلالا ولا أحل حراما، ولكن والله لا تجتمع بنت رسول الله صلى الله عليه وسلم وبنت عدو الله أبدا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3111,
			"arabicnumber": 3111,
			"text": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن محمد بن سوقة، عن منذر، عن ابن الحنفية، قال لو كان علي ـ رضى الله عنه ـ ذاكرا عثمان ـ رضى الله عنه ـ ذكره يوم جاءه ناس فشكوا سعاة عثمان، فقال لي علي اذهب إلى عثمان فأخبره أنها صدقة رسول الله صلى الله عليه وسلم، فمر سعاتك يعملون فيها‏.‏ فأتيته بها فقال أغنها عنا‏.‏ فأتيت بها عليا فأخبرته فقال ضعها حيث أخذتها‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3112,
			"arabicnumber": 3112,
			"text": "قال الحميدي حدثنا سفيان، حدثنا محمد بن سوقة، قال سمعت منذرا الثوري، عن ابن الحنفية، قال أرسلني أبي، خذ هذا الكتاب فاذهب به إلى عثمان، فإن فيه أمر النبي صلى الله عليه وسلم في الصدقة‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3113,
			"arabicnumber": 3113,
			"text": "حدثنا بدل بن المحبر، أخبرنا شعبة، قال أخبرني الحكم، قال سمعت ابن أبي ليلى، حدثنا علي، أن فاطمة ـ عليها السلام ـ اشتكت ما تلقى من الرحى مما تطحن، فبلغها أن رسول الله صلى الله عليه وسلم أتي بسبى، فأتته تسأله خادما فلم توافقه، فذكرت لعائشة، فجاء النبي صلى الله عليه وسلم فذكرت ذلك عائشة له، فأتانا وقد دخلنا مضاجعنا، فذهبنا لنقوم فقال ‏\"‏ على مكانكما ‏\"‏ حتى وجدت برد قدميه على صدري فقال ‏\"‏ ألا أدلكما على خير مما سألتماه، إذا أخذتما مضاجعكما فكبرا الله أربعا وثلاثين، واحمدا ثلاثا وثلاثين، وسبحا ثلاثا وثلاثين، فإن ذلك خير لكما مما سألتماه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3114,
			"arabicnumber": 3114,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن سليمان، ومنصور، وقتادة، سمعوا سالم بن أبي الجعد، عن جابر بن عبد الله ـ رضى الله عنهما ـ قال ولد لرجل منا من الأنصار غلام، فأراد أن يسميه محمدا ـ قال شعبة في حديث منصور إن الأنصاري قال حملته على عنقي فأتيت به النبي صلى الله عليه وسلم‏.‏ وفي حديث سليمان ولد له غلام، فأراد أن يسميه محمدا ـ قال ‏\"‏ سموا باسمي، ولا تكنوا بكنيتي، فإني إنما جعلت قاسما أقسم بينكم ‏\"‏‏.‏ وقال حصين ‏\"‏ بعثت قاسما أقسم بينكم ‏\"‏‏.‏ قال عمرو أخبرنا شعبة عن قتادة قال سمعت سالما عن جابر أراد أن يسميه القاسم فقال النبي صلى الله عليه وسلم ‏\"‏ سموا باسمي ولا تكتنوا بكنيتي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3115,
			"arabicnumber": 3115,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن سالم بن أبي الجعد، عن جابر بن عبد الله الأنصاري، قال ولد لرجل منا غلام فسماه القاسم فقالت الأنصار لا نكنيك أبا القاسم ولا ننعمك عينا، فأتى النبي صلى الله عليه وسلم فقال يا رسول الله ولد لي غلام، فسميته القاسم فقالت الأنصار لا نكنيك أبا القاسم ولا ننعمك عينا‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ أحسنت الأنصار، سموا باسمي، ولا تكنوا بكنيتي، فإنما أنا قاسم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3116,
			"arabicnumber": 3116,
			"text": "حدثنا حبان، أخبرنا عبد الله، عن يونس، عن الزهري، عن حميد بن عبد الرحمن، أنه سمع معاوية، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من يرد الله به خيرا يفقهه في الدين، والله المعطي وأنا القاسم، ولا تزال هذه الأمة ظاهرين على من خالفهم حتى يأتي أمر الله وهم ظاهرون ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3117,
			"arabicnumber": 3117,
			"text": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ما أعطيكم ولا أمنعكم، أنا قاسم أضع حيث أمرت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3118,
			"arabicnumber": 3118,
			"text": "حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، قال حدثني أبو الأسود، عن ابن أبي عياش ـ واسمه نعمان ـ عن خولة الأنصارية ـ رضى الله عنها ـ قالت سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ إن رجالا يتخوضون في مال الله بغير حق، فلهم النار يوم القيامة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3119,
			"arabicnumber": 3119,
			"text": "حدثنا مسدد، حدثنا خالد، حدثنا حصين، عن عامر، عن عروة البارقي ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ الخيل معقود في نواصيها الخير الأجر والمغنم إلى يوم القيامة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3120,
			"arabicnumber": 3120,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا هلك كسرى فلا كسرى بعده، وإذا هلك قيصر فلا قيصر بعده، والذي نفسي بيده، لتنفقن كنوزهما في سبيل الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3121,
			"arabicnumber": 3121,
			"text": "حدثنا إسحاق، سمع جريرا، عن عبد الملك، عن جابر بن سمرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا هلك كسرى فلا كسرى بعده، وإذا هلك قيصر فلا قيصر بعده، والذي نفسي بيده، لتنفقن كنوزهما في سبيل الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3122,
			"arabicnumber": 3122,
			"text": "حدثنا محمد بن سنان، حدثنا هشيم، أخبرنا سيار، حدثنا يزيد الفقير، حدثنا جابر بن عبد الله ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أحلت لي الغنائم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3123,
			"arabicnumber": 3123,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ تكفل الله لمن جاهد في سبيله، لا يخرجه إلا الجهاد في سبيله وتصديق كلماته، بأن يدخله الجنة، أو يرجعه إلى مسكنه الذي خرج منه ‏{‏مع ما نال‏}‏ من أجر أو غنيمة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3124,
			"arabicnumber": 3124,
			"text": "حدثنا محمد بن العلاء، حدثنا ابن المبارك، عن معمر، عن همام بن منبه، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ غزا نبي من الأنبياء فقال لقومه لا يتبعني رجل ملك بضع امرأة وهو يريد أن يبني بها ولما يبن بها، ولا أحد بنى بيوتا ولم يرفع سقوفها، ولا أحد اشترى غنما أو خلفات وهو ينتظر ولادها‏.‏ فغزا فدنا من القرية صلاة العصر أو قريبا من ذلك فقال للشمس إنك مأمورة وأنا مأمور، اللهم احبسها علينا‏.‏ فحبست، حتى فتح الله عليه، فجمع الغنائم، فجاءت ـ يعني النار ـ لتأكلها، فلم تطعمها، فقال إن فيكم غلولا، فليبايعني من كل قبيلة رجل‏.‏ فلزقت يد رجل بيده فقال فيكم الغلول‏.‏ فلتبايعني قبيلتك، فلزقت يد رجلين أو ثلاثة بيده فقال فيكم الغلول، فجاءوا برأس مثل رأس بقرة من الذهب فوضعوها، فجاءت النار فأكلتها، ثم أحل الله لنا الغنائم، رأى ضعفنا وعجزنا فأحلها لنا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3125,
			"arabicnumber": 3125,
			"text": "حدثنا صدقة، أخبرنا عبد الرحمن، عن مالك، عن زيد بن أسلم، عن أبيه، قال قال عمر ـ رضى الله عنه لولا آخر المسلمين ما فتحت قرية إلا قسمتها بين أهلها كما قسم النبي صلى الله عليه وسلم خيبر‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3126,
			"arabicnumber": 3126,
			"text": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عمرو، قال سمعت أبا وائل، قال حدثنا أبو موسى الأشعري ـ رضى الله عنه ـ قال قال أعرابي للنبي صلى الله عليه وسلم الرجل يقاتل للمغنم، والرجل يقاتل ليذكر، ويقاتل ليرى مكانه، من في سبيل الله فقال ‏ \"‏ من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3127,
			"arabicnumber": 3127,
			"text": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد بن زيد، عن أيوب، عن عبد الله بن أبي مليكة، أن النبي صلى الله عليه وسلم أهديت له أقبية من ديباج مزررة بالذهب، فقسمها في ناس من أصحابه، وعزل منها واحدا لمخرمة بن نوفل، فجاء ومعه ابنه المسور بن مخرمة، فقام على الباب فقال ادعه لي‏.‏ فسمع النبي صلى الله عليه وسلم صوته فأخذ قباء فتلقاه به واستقبله بأزراره فقال ‏ \"‏ يا أبا المسور، خبأت هذا لك، يا أبا المسور، خبأت هذا لك ‏\"‏‏.‏ وكان في خلقه شدة‏.‏ ورواه ابن علية عن أيوب‏.‏ قال حاتم بن وردان حدثنا أيوب عن ابن أبي مليكة عن المسور قدمت على النبي صلى الله عليه وسلم أقبية‏.‏ تابعه الليث عن ابن أبي مليكة‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3128,
			"arabicnumber": 3128,
			"text": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، عن أبيه، قال سمعت أنس بن مالك ـ رضى الله عنه ـ يقول كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، فكان بعد ذلك يرد عليهم‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3129,
			"arabicnumber": 3129,
			"text": "حدثنا إسحاق بن إبراهيم، قال قلت لأبي أسامة أحدثكم هشام بن عروة عن أبيه عن عبد الله بن الزبير قال لما وقف الزبير يوم الجمل دعاني، فقمت إلى جنبه فقال يا بنى، إنه لا يقتل اليوم إلا ظالم أو مظلوم، وإني لا أراني إلا سأقتل اليوم مظلوما، وإن من أكبر همي لديني، أفترى يبقي ديننا من مالنا شيئا فقال يا بنى بع مالنا فاقض ديني‏.‏ وأوصى بالثلث، وثلثه لبنيه، يعني عبد الله بن الزبير يقول ثلث الثلث، فإن فضل من مالنا فضل بعد قضاء الدين شىء فثلثه لولدك‏.‏ قال هشام وكان بعض ولد عبد الله قد وازى بعض بني الزبير خبيب وعباد، وله يومئذ تسعة بنين وتسع بنات‏.‏ قال عبد الله فجعل يوصيني بدينه ويقول يا بنى، إن عجزت عنه في شىء فاستعن عليه مولاى‏.‏ قال فوالله ما دريت ما أراد حتى قلت يا أبت من مولاك قال الله‏.‏ قال فوالله ما وقعت في كربة من دينه إلا قلت يا مولى الزبير، اقض عنه دينه‏.‏ فيقضيه، فقتل الزبير ـ رضى الله عنه ـ ولم يدع دينارا ولا درهما، إلا أرضين منها الغابة، وإحدى عشرة دارا بالمدينة، ودارين بالبصرة، ودارا بالكوفة، ودارا بمصر‏.‏ قال وإنما كان دينه الذي عليه أن الرجل كان يأتيه بالمال فيستودعه إياه فيقول الزبير لا ولكنه سلف، فإني أخشى عليه الضيعة، وما ولي إمارة قط ولا جباية خراج ولا شيئا، إلا أن يكون في غزوة مع النبي صلى الله عليه وسلم أو مع أبي بكر وعمر وعثمان ـ رضى الله عنهم ـ قال عبد الله بن الزبير فحسبت ما عليه من الدين فوجدته ألفى ألف ومائتى ألف قال فلقي حكيم بن حزام عبد الله بن الزبير فقال يا ابن أخي، كم على أخي من الدين فكتمه‏.‏ فقال مائة ألف‏.‏ فقال حكيم والله ما أرى أموالكم تسع لهذه‏.‏ فقال له عبد الله أفرأيتك إن كانت ألفى ألف ومائتى ألف قال ما أراكم تطيقون هذا، فإن عجزتم عن شىء منه فاستعينوا بي‏.‏ قال وكان الزبير اشترى الغابة بسبعين ومائة ألف، فباعها عبد الله بألف ألف وستمائة ألف ثم قام فقال من كان له على الزبير حق فليوافنا بالغابة، فأتاه عبد الله بن جعفر، وكان له على الزبير أربعمائة ألف فقال لعبد الله إن شئتم تركتها لكم‏.‏ قال عبد الله لا‏.‏ قال فإن شئتم جعلتموها فيما تؤخرون إن أخرتم‏.‏ فقال عبد الله لا‏.‏ قال قال فاقطعوا لي قطعة‏.‏ فقال عبد الله لك من ها هنا إلى ها هنا‏.‏ قال فباع منها فقضى دينه فأوفاه، وبقي منها أربعة أسهم ونصف، فقدم على معاوية وعنده عمرو بن عثمان والمنذر بن الزبير وابن زمعة فقال له معاوية كم قومت الغابة قال كل سهم مائة ألف‏.‏ قال كم بقي قال أربعة أسهم ونصف‏.‏ قال المنذر بن الزبير قد أخذت سهما بمائة ألف‏.‏ قال عمرو بن عثمان قد أخذت سهما بمائة ألف‏.‏ وقال ابن زمعة قد أخذت سهما بمائة ألف‏.‏ فقال معاوية كم بقي فقال سهم ونصف‏.‏ قال أخذته بخمسين ومائة ألف‏.‏ قال وباع عبد الله بن جعفر نصيبه من معاوية بستمائة ألف، فلما فرغ ابن الزبير من قضاء دينه قال بنو الزبير اقسم بيننا ميراثنا‏.‏ قال لا، والله لا أقسم بينكم حتى أنادي بالموسم أربع سنين ألا من كان له على الزبير دين فليأتنا فلنقضه‏.‏ قال فجعل كل سنة ينادي بالموسم، فلما مضى أربع سنين قسم بينهم قال فكان للزبير أربع نسوة، ورفع الثلث، فأصاب كل امرأة ألف ألف ومائتا ألف، فجميع ماله خمسون ألف ألف ومائتا ألف‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3130,
			"arabicnumber": 3130,
			"text": "حدثنا موسى، حدثنا أبو عوانة، حدثنا عثمان بن موهب، عن ابن عمر ـ رضى الله عنهما ـ قال إنما تغيب عثمان عن بدر، فإنه كانت تحته بنت رسول الله صلى الله عليه وسلم وكانت مريضة‏.‏ فقال له النبي صلى الله عليه وسلم ‏ \"‏ إن لك أجر رجل ممن شهد بدرا وسهمه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3132,
			"arabicnumber": 3132,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3133,
			"arabicnumber": 3133,
			"text": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد، حدثنا أيوب، عن أبي قلابة، قال وحدثني القاسم بن عاصم الكليبي ـ وأنا لحديث القاسم، أحفظ ـ عن زهدم، قال كنا عند أبي موسى، فأتي ذكر دجاجة وعنده رجل من بني تيم الله أحمر كأنه من الموالي، فدعاه للطعام فقال إني رأيته يأكل شيئا، فقذرته، فحلفت لا آكل‏.‏ فقال هلم فلأحدثكم عن ذاك، إني أتيت النبي صلى الله عليه وسلم في نفر من الأشعريين نستحمله فقال ‏\"‏ والله لا أحملكم، وما عندي ما أحملكم ‏\"‏‏.‏ وأتي رسول الله صلى الله عليه وسلم بنهب إبل، فسأل عنا فقال ‏\"‏ أين النفر الأشعريون ‏\"‏‏.‏ فأمر لنا بخمس ذود غر الذرى، فلما انطلقنا قلنا ما صنعنا لا يبارك لنا، فرجعنا إليه فقلنا إنا سألناك أن تحملنا، فحلفت أن لا تحملنا أفنسيت قال ‏\"‏ لست أنا حملتكم، ولكن الله حملكم، وإني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها إلا أتيت الذي هو خير وتحللتها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3134,
			"arabicnumber": 3134,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن ابن عمر ـ رضى الله عنهما أن رسول الله صلى الله عليه وسلم بعث سرية فيها عبد الله قبل نجد، فغنموا إبلا كثيرا، فكانت سهامهم اثنى عشر بعيرا أو أحد عشر بعيرا، ونفلوا بعيرا بعيرا‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3135,
			"arabicnumber": 3135,
			"text": "حدثنا يحيى بن بكير، أخبرنا الليث، عن عقيل، عن ابن شهاب، عن سالم، عن ابن عمر ـ رضى الله عنهما أن رسول الله صلى الله عليه وسلم كان ينفل بعض من يبعث من السرايا لأنفسهم خاصة سوى قسم عامة الجيش‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3136,
			"arabicnumber": 3136,
			"text": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، حدثنا بريد بن عبد الله، عن أبي بردة، عن أبي موسى ـ رضى الله عنه ـ قال بلغنا مخرج النبي صلى الله عليه وسلم ونحن باليمن فخرجنا مهاجرين إليه، أنا وأخوان لي، أنا أصغرهم، أحدهما أبو بردة والآخر أبو رهم، إما قال في بضع، وإما قال في ثلاثة وخمسين أو اثنين وخمسين رجلا من قومي فركبنا سفينة، فألقتنا سفينتنا إلى النجاشي بالحبشة، ووافقنا جعفر بن أبي طالب وأصحابه عنده فقال جعفر إن رسول الله صلى الله عليه وسلم بعثنا ها هنا، وأمرنا بالإقامة فأقيموا معنا‏.‏ فأقمنا معه، حتى قدمنا جميعا، فوافقنا النبي صلى الله عليه وسلم حين افتتح خيبر، فأسهم لنا‏.‏ أو قال فأعطانا منها‏.‏ وما قسم لأحد غاب عن فتح خيبر منها شيئا، إلا لمن شهد معه، إلا أصحاب سفينتنا مع جعفر وأصحابه، قسم لهم معهم‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3137,
			"arabicnumber": 3137,
			"text": "حدثنا علي، حدثنا سفيان، حدثنا محمد بن المنكدر، سمع جابرا ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لو قد جاءني مال البحرين لقد أعطيتك هكذا وهكذا وهكذا ‏\"‏‏.‏ فلم يجئ حتى قبض النبي صلى الله عليه وسلم، فلما جاء مال البحرين أمر أبو بكر مناديا فنادى من كان له عند رسول الله صلى الله عليه وسلم دين أو عدة فليأتنا‏.‏ فأتيته فقلت إن رسول الله صلى الله عليه وسلم قال لي كذا وكذا‏.‏ فحثا لي ثلاثا ـ وجعل سفيان يحثو بكفيه جميعا، ثم قال لنا هكذا قال لنا ابن المنكدر ـ وقال مرة فأتيت أبا بكر فسألت فلم يعطني، ثم أتيته فلم يعطني، ثم أتيته الثالثة فقلت سألتك فلم تعطني، ثم سألتك فلم تعطني، ثم سألتك فلم تعطني، فإما أن تعطيني، وإما أن تبخل عني‏.‏ قال قلت تبخل على ما منعتك من مرة إلا وأنا أريد أن أعطيك‏.‏ قال سفيان وحدثنا عمرو عن محمد بن علي عن جابر فحثا لي حثية وقال عدها‏.‏ فوجدتها خمسمائة قال فخذ مثلها مرتين‏.‏ وقال يعني ابن المنكدر وأى داء أدوأ من البخل",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3138,
			"arabicnumber": 3138,
			"text": "حدثنا مسلم بن إبراهيم، حدثنا قرة، حدثنا عمرو بن دينار، عن جابر بن عبد الله ـ رضى الله عنهما ـ قال بينما رسول الله صلى الله عليه وسلم يقسم غنيمة بالجعرانة إذ قال له رجل اعدل‏.‏ فقال له ‏ \"‏ شقيت إن لم أعدل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3139,
			"arabicnumber": 3139,
			"text": "حدثنا إسحاق بن منصور، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن محمد بن جبير، عن أبيه ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم قال في أسارى بدر ‏ \"‏ لو كان المطعم بن عدي حيا، ثم كلمني في هؤلاء النتنى، لتركتهم له ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3140,
			"arabicnumber": 3140,
			"text": "حدثنا عبد الله بن يوسف، حدثنا الليث، عن عقيل، عن ابن شهاب، عن ابن المسيب، عن جبير بن مطعم، قال مشيت أنا وعثمان بن عفان، إلى رسول الله صلى الله عليه وسلم فقلنا يا رسول الله، أعطيت بني المطلب وتركتنا، ونحن وهم منك بمنزلة واحدة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إنما بنو المطلب وبنو هاشم شىء واحد ‏\"‏‏.‏ قال الليث حدثني يونس وزاد قال جبير ولم يقسم النبي صلى الله عليه وسلم لبني عبد شمس ولا لبني نوفل‏.‏ وقال ابن إسحاق عبد شمس وهاشم والمطلب إخوة لأم، وأمهم عاتكة بنت مرة، وكان نوفل أخاهم لأبيهم‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3141,
			"arabicnumber": 3141,
			"text": "حدثنا مسدد، حدثنا يوسف بن الماجشون، عن صالح بن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، عن جده، قال بينا أنا واقف، في الصف يوم بدر فنظرت عن يميني، وشمالي، فإذا أنا بغلامين، من الأنصار حديثة أسنانهما، تمنيت أن أكون بين أضلع منهما، فغمزني أحدهما فقال يا عم، هل تعرف أبا جهل قلت نعم، ما حاجتك إليه يا ابن أخي قال أخبرت أنه يسب رسول الله صلى الله عليه وسلم، والذي نفسي بيده لئن رأيته لا يفارق سوادي سواده حتى يموت الأعجل منا‏.‏ فتعجبت لذلك، فغمزني الآخر فقال لي مثلها، فلم أنشب أن نظرت إلى أبي جهل يجول في الناس، قلت ألا إن هذا صاحبكما الذي سألتماني‏.‏ فابتدراه بسيفيهما فضرباه حتى قتلاه، ثم انصرفا إلى رسول الله صلى الله عليه وسلم فأخبراه فقال ‏\"‏ أيكما قتله ‏\"‏‏.‏ قال كل واحد منهما أنا قتلته‏.‏ فقال ‏\"‏ هل مسحتما سيفيكما ‏\"‏‏.‏ قالا لا‏.‏ فنظر في السيفين فقال ‏\"‏ كلاكما قتله ‏\"‏‏.‏ سلبه لمعاذ بن عمرو بن الجموح‏.‏ وكانا معاذ ابن عفراء ومعاذ بن عمرو بن الجموح‏.‏ قال محمد سمع يوسف صالحا وإبراهيم أباه (عبد الرحمن بن عوف)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3142,
			"arabicnumber": 3142,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن ابن أفلح، عن أبي محمد، مولى أبي قتادة عن أبي قتادة ـ رضى الله عنه ـ قال خرجنا مع رسول الله صلى الله عليه وسلم عام حنين، فلما التقينا كانت للمسلمين جولة، فرأيت رجلا من المشركين علا رجلا من المسلمين، فاستدرت حتى أتيته من ورائه حتى ضربته بالسيف على حبل عاتقه، فأقبل على فضمني ضمة وجدت منها ريح الموت، ثم أدركه الموت فأرسلني، فلحقت عمر بن الخطاب فقلت ما بال الناس قال أمر الله، ثم إن الناس رجعوا، وجلس النبي صلى الله عليه وسلم فقال ‏\"‏ من قتل قتيلا له عليه بينة فله سلبه ‏\"‏‏.‏ فقمت فقلت من يشهد لي ثم جلست ثم قال ‏\"‏ من قتل قتيلا له عليه بينة فله سلبه ‏\"‏ فقمت فقلت من يشهد لي ثم جلست، ثم قال الثالثة مثله فقال رجل صدق يا رسول الله، وسلبه عندي فأرضه عني‏.‏ فقال أبو بكر الصديق ـ رضى الله عنه لاها الله إذا يعمد إلى أسد من أسد الله يقاتل عن الله ورسوله صلى الله عليه وسلم يعطيك سلبه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ‏\"‏‏.‏ فأعطاه فبعت الدرع، فابتعت به مخرفا في بني سلمة، فإنه لأول مال تأثلته في الإسلام‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3143,
			"arabicnumber": 3143,
			"text": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، عن الزهري، عن سعيد بن المسيب، وعروة بن الزبير، أن حكيم بن حزام ـ رضى الله عنه ـ قال سألت رسول الله صلى الله عليه وسلم فأعطاني، ثم سألته فأعطاني، ثم قال لي ‏ \"‏ يا حكيم، إن هذا المال خضر حلو، فمن أخذه بسخاوة نفس بورك له فيه، ومن أخذه بإشراف نفس لم يبارك له فيه، وكان كالذي يأكل ولا يشبع، واليد العليا خير من اليد السفلى ‏\"‏‏.‏ قال حكيم فقلت يا رسول الله، والذي بعثك بالحق لا أرزأ أحدا بعدك شيئا حتى أفارق الدنيا‏.‏ فكان أبو بكر يدعو حكيما ليعطيه العطاء، فيأبى أن يقبل منه شيئا، ثم إن عمر دعاه ليعطيه فأبى أن يقبل فقال يا معشر المسلمين، إني أعرض عليه حقه الذي قسم الله له من هذا الفىء، فيأبى أن يأخذه‏.‏ فلم يرزأ حكيم أحدا من الناس بعد النبي صلى الله عليه وسلم حتى توفي‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3144,
			"arabicnumber": 3144,
			"text": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن نافع، أن عمر بن الخطاب ـ رضى الله عنه ـ قال يا رسول الله إنه كان على اعتكاف يوم في الجاهلية، فأمره أن يفي به‏.‏ قال وأصاب عمر جاريتين من سبى حنين، فوضعهما في بعض بيوت مكة ـ قال ـ فمن رسول الله صلى الله عليه وسلم على سبى حنين، فجعلوا يسعون في السكك فقال عمر يا عبد الله، انظر ما هذا فقال من رسول الله صلى الله عليه وسلم على السبى‏.‏ قال اذهب فأرسل الجاريتين‏.‏ قال نافع ولم يعتمر رسول الله صلى الله عليه وسلم من الجعرانة ولو اعتمر لم يخف على عبد الله‏.‏ وزاد جرير بن حازم عن أيوب عن نافع عن ابن عمر قال من الخمس‏.‏ ورواه معمر عن أيوب عن نافع عن ابن عمر في النذر ولم يقل يوم‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3145,
			"arabicnumber": 3145,
			"text": "حدثنا موسى بن إسماعيل، حدثنا جرير بن حازم، حدثنا الحسن، قال حدثني عمرو بن تغلب ـ رضى الله عنه ـ قال أعطى رسول الله صلى الله عليه وسلم قوما ومنع آخرين، فكأنهم عتبوا عليه فقال ‏ \"‏ إني أعطي قوما أخاف ظلعهم وجزعهم، وأكل أقواما إلى ما جعل الله في قلوبهم من الخير والغنى، منهم عمرو بن تغلب ‏\"‏‏.‏ فقال عمرو بن تغلب ما أحب أن لي بكلمة رسول الله صلى الله عليه وسلم حمر النعم‏.‏ وزاد أبو عاصم عن جرير قال سمعت الحسن يقول حدثنا عمرو بن تغلب أن رسول الله صلى الله عليه وسلم أتي بمال أو بسبى فقسمه‏.‏ بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3146,
			"arabicnumber": 3146,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن قتادة، عن أنس ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ إني أعطي قريشا أتألفهم، لأنهم حديث عهد بجاهلية ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3147,
			"arabicnumber": 3147,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا الزهري، قال أخبرني أنس بن مالك، أن ناسا، من الأنصار قالوا لرسول الله صلى الله عليه وسلم حين أفاء الله على رسوله صلى الله عليه وسلم من أموال هوازن ما أفاء، فطفق يعطي رجالا من قريش المائة من الإبل فقالوا يغفر الله لرسول الله صلى الله عليه وسلم يعطي قريشا ويدعنا، وسيوفنا تقطر من دمائهم قال أنس فحدث رسول الله بمقالتهم، فأرسل إلى الأنصار، فجمعهم في قبة من أدم، ولم يدع معهم أحدا غيرهم، فلما اجتمعوا جاءهم رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما كان حديث بلغني عنكم ‏\"‏‏.‏ قال له فقهاؤهم أما ذوو آرائنا يا رسول الله فلم يقولوا شيئا، وأما أناس منا حديثة أسنانهم فقالوا يغفر الله لرسول الله صلى الله عليه وسلم يعطي قريشا ويترك الأنصار، وسيوفنا تقطر من دمائهم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني أعطي رجالا حديث عهدهم بكفر، أما ترضون أن يذهب الناس بالأموال وترجعون إلى رحالكم برسول الله صلى الله عليه وسلم، فوالله ما تنقلبون به خير مما ينقلبون به ‏\"‏‏.‏ قالوا بلى يا رسول الله قد رضينا‏.‏ فقال لهم ‏\"‏ إنكم سترون بعدي أثرة شديدة، فاصبروا حتى تلقوا الله ورسوله صلى الله عليه وسلم على الحوض ‏\"‏‏.‏ قال أنس فلم نصبر‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3148,
			"arabicnumber": 3148,
			"text": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عمر بن محمد بن جبير بن مطعم، أن محمد بن جبير، قال أخبرني جبير بن مطعم، أنه بينا هو مع رسول الله صلى الله عليه وسلم ومعه الناس مقبلا من حنين علقت رسول الله صلى الله عليه وسلم الأعراب يسألونه حتى اضطروه إلى سمرة، فخطفت رداءه، فوقف رسول الله صلى الله عليه وسلم فقال ‏ \"‏ أعطوني ردائي، فلو كان عدد هذه العضاه نعما لقسمته بينكم، ثم لا تجدوني بخيلا ولا كذوبا ولا جبانا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3149,
			"arabicnumber": 3149,
			"text": "حدثنا يحيى بن بكير، حدثنا مالك، عن إسحاق بن عبد الله، عن أنس بن مالك ـ رضى الله عنه قال كنت أمشي مع النبي صلى الله عليه وسلم وعليه برد نجراني غليظ الحاشية، فأدركه أعرابي فجذبه جذبة شديدة، حتى نظرت إلى صفحة عاتق النبي صلى الله عليه وسلم قد أثرت به حاشية الرداء من شدة جذبته، ثم قال مر لي من مال الله الذي عندك‏.‏ فالتفت إليه، فضحك ثم أمر له بعطاء‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3150,
			"arabicnumber": 3150,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله ـ رضى الله عنه ـ قال لما كان يوم حنين آثر النبي صلى الله عليه وسلم أناسا في القسمة، فأعطى الأقرع بن حابس مائة من الإبل، وأعطى عيينة مثل ذلك، وأعطى أناسا من أشراف العرب، فآثرهم يومئذ في القسمة‏.‏ قال رجل والله إن هذه القسمة ما عدل فيها، وما أريد بها وجه الله‏.‏ فقلت والله لأخبرن النبي صلى الله عليه وسلم‏.‏ فأتيته فأخبرته فقال ‏ \"‏ فمن يعدل إذا لم يعدل الله ورسوله رحم الله موسى قد أوذي بأكثر من هذا فصبر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3151,
			"arabicnumber": 3151,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو أسامة، حدثنا هشام، قال أخبرني أبي، عن أسماء ابنة أبي بكر ـ رضى الله عنهما ـ قالت كنت أنقل النوى من أرض الزبير التي أقطعه رسول الله صلى الله عليه وسلم على رأسي، وهى مني على ثلثى فرسخ‏.‏ وقال أبو ضمرة عن هشام عن أبيه أن النبي صلى الله عليه وسلم أقطع الزبير أرضا من أموال بني النضير‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3152,
			"arabicnumber": 3152,
			"text": "حدثني أحمد بن المقدام، حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، قال أخبرني نافع، عن ابن عمر ـ رضى الله عنهما أن عمر بن الخطاب، أجلى اليهود والنصارى من أرض الحجاز، وكان رسول الله صلى الله عليه وسلم لما ظهر على أهل خيبر أراد أن يخرج اليهود منها، وكانت الأرض لما ظهر عليها لليهود وللرسول وللمسلمين، فسأل اليهود رسول الله صلى الله عليه وسلم أن يتركهم على أن يكفوا العمل، ولهم نصف الثمر فقال رسول الله صلى الله عليه وسلم ‏ \"‏ نقركم على ذلك ما شئنا ‏\"‏‏.‏ فأقروا حتى أجلاهم عمر في إمارته إلى تيماء وأريحا‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3153,
			"arabicnumber": 3153,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن حميد بن هلال، عن عبد الله بن مغفل ـ رضى الله عنه ـ قال كنا محاصرين قصر خيبر، فرمى إنسان بجراب فيه شحم، فنزوت لآخذه، فالتفت فإذا النبي صلى الله عليه وسلم فاستحييت منه‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3154,
			"arabicnumber": 3154,
			"text": "حدثنا مسدد، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال كنا نصيب في مغازينا العسل والعنب فنأكله ولا نرفعه‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3155,
			"arabicnumber": 3155,
			"text": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الشيباني، قال سمعت ابن أبي أوفى ـ رضى الله عنهما ـ يقول أصابتنا مجاعة ليالي خيبر، فلما كان يوم خيبر وقعنا في الحمر الأهلية، فانتحرناها فلما غلت القدور، نادى منادي رسول الله صلى الله عليه وسلم اكفئوا القدور، فلا تطعموا من لحوم الحمر شيئا‏.‏ قال عبد الله فقلنا إنما نهى النبي صلى الله عليه وسلم لأنها لم تخمس‏.‏ قال وقال آخرون حرمها البتة‏.‏ وسألت سعيد بن جبير فقال حرمها البتة‏.‏",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 63
			}
		}
	]
}