{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5783,
			"arabicnumber": 5783,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن نافع، وعبد الله بن دينار، وزيد بن أسلم، يخبرونه عن ابن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا ينظر الله إلى من جر ثوبه خيلاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5784,
			"arabicnumber": 5784,
			"text": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا موسى بن عقبة، عن سالم بن عبد الله، عن أبيه ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ من جر ثوبه خيلاء لم ينظر الله إليه يوم القيامة ‏\"‏‏.‏ قال أبو بكر يا رسول الله إن أحد شقى إزاري يسترخي، إلا أن أتعاهد ذلك منه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لست ممن يصنعه خيلاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5785,
			"arabicnumber": 5785,
			"text": "حدثني محمد، أخبرنا عبد الأعلى، عن يونس، عن الحسن، عن أبي بكرة ـ رضى الله عنه ـ قال خسفت الشمس ونحن عند النبي صلى الله عليه وسلم فقام يجر ثوبه مستعجلا، حتى أتى المسجد وثاب الناس فصلى ركعتين، فجلي عنها، ثم أقبل علينا وقال ‏ \"‏ إن الشمس والقمر آيتان من آيات الله، فإذا رأيتم منها شيئا فصلوا وادعوا الله حتى يكشفها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5786,
			"arabicnumber": 5786,
			"text": "حدثني إسحاق، أخبرنا ابن شميل، أخبرنا عمر بن أبي زائدة، أخبرنا عون بن أبي جحيفة، عن أبيه أبي جحيفة، قال فرأيت بلالا جاء بعنزة فركزها، ثم أقام الصلاة، فرأيت رسول الله صلى الله عليه وسلم خرج في حلة مشمرا، فصلى ركعتين إلى العنزة، ورأيت الناس والدواب يمرون بين يديه من وراء العنزة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5787,
			"arabicnumber": 5787,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا سعيد بن أبي سعيد المقبري، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما أسفل من الكعبين من الإزار ففي النار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5788,
			"arabicnumber": 5788,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا ينظر الله يوم القيامة إلى من جر إزاره بطرا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5789,
			"arabicnumber": 5789,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا محمد بن زياد، قال سمعت أبا هريرة، يقول قال النبي ـ أو قال أبو القاسم ـ صلى الله عليه وسلم ‏ \"‏ بينما رجل يمشي في حلة، تعجبه نفسه مرجل جمته، إذ خسف الله به، فهو يتجلل إلى يوم القيامة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5790,
			"arabicnumber": 5790,
			"text": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن سالم بن عبد الله، أن أباه، حدثه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ بينا رجل يجر إزاره، خسف به، فهو يتجلل في الأرض إلى يوم القيامة ‏\"‏‏.‏ تابعه يونس عن الزهري‏.‏ ولم يرفعه شعيب عن الزهري‏.‏ حدثني عبد الله بن محمد، حدثنا وهب بن جرير، أخبرنا أبي، عن عمه، جرير بن زيد قال كنت مع سالم بن عبد الله بن عمر على باب داره فقال سمعت أبا هريرة، سمع النبي صلى الله عليه وسلم نحوه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5791,
			"arabicnumber": 5791,
			"text": "حدثنا مطر بن الفضل، حدثنا شبابة، حدثنا شعبة، قال لقيت محارب بن دثار على فرس وهو يأتي مكانه الذي يقضي فيه فسألته عن هذا الحديث فحدثني فقال سمعت عبد الله بن عمر ـ رضى الله عنهما ـ يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من جر ثوبه مخيلة، لم ينظر الله إليه يوم القيامة ‏\"‏‏.‏ فقلت لمحارب أذكر إزاره قال ما خص إزارا ولا قميصا‏.‏ تابعه جبلة بن سحيم وزيد بن أسلم وزيد بن عبد الله عن ابن عمر عن النبي صلى الله عليه وسلم‏.‏ وقال الليث عن نافع عن ابن عمر مثله‏.‏ وتابعه موسى بن عقبة وعمر بن محمد وقدامة بن موسى عن سالم عن ابن عمر عن النبي صلى الله عليه وسلم ‏\"‏ من جر ثوبه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5792,
			"arabicnumber": 5792,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، أخبرني عروة بن الزبير، أن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم قالت جاءت امرأة رفاعة القرظي رسول الله صلى الله عليه وسلم وأنا جالسة وعنده أبو بكر فقالت يا رسول الله إني كنت تحت رفاعة فطلقني فبت طلاقي، فتزوجت بعده عبد الرحمن بن الزبير، وإنه والله ما معه يا رسول الله إلا مثل هذه الهدبة‏.‏ وأخذت هدبة من جلبابها، فسمع خالد بن سعيد قولها وهو بالباب لم يؤذن له، قالت فقال خالد يا أبا بكر ألا تنهى هذه عما تجهر به عند رسول الله صلى الله عليه وسلم فلا والله ما يزيد رسول الله صلى الله عليه وسلم على التبسم، فقال لها رسول الله صلى الله عليه وسلم ‏ \"‏ لعلك تريدين أن ترجعي إلى رفاعة، لا، حتى يذوق عسيلتك وتذوقي عسيلته ‏\"‏‏.‏ فصار سنة بعد‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5793,
			"arabicnumber": 5793,
			"text": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، أخبرني علي بن حسين، أن حسين بن علي، أخبره أن عليا ـ رضى الله عنه ـ قال فدعا النبي صلى الله عليه وسلم بردائه، ثم انطلق يمشي، واتبعته أنا وزيد بن حارثة، حتى جاء البيت الذي فيه حمزة، فاستأذن فأذنوا لهم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5794,
			"arabicnumber": 5794,
			"text": "حدثنا قتيبة، حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أن رجلا، قال يا رسول الله ما يلبس المحرم من الثياب فقال النبي صلى الله عليه وسلم ‏ \"‏ لا يلبس المحرم القميص، ولا السراويل، ولا البرنس، ولا الخفين، إلا أن لا يجد النعلين، فليلبس ما هو أسفل من الكعبين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5795,
			"arabicnumber": 5795,
			"text": "حدثنا عبد الله بن محمد، أخبرنا ابن عيينة، عن عمرو، سمع جابر بن عبد الله ـ رضى الله عنهما ـ قال أتى النبي صلى الله عليه وسلم عبد الله بن أبى بعد ما أدخل قبره، فأمر به فأخرج، ووضع على ركبتيه، ونفث عليه من ريقه، وألبسه قميصه، والله أعلم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5796,
			"arabicnumber": 5796,
			"text": "حدثنا صدقة، أخبرنا يحيى بن سعيد، عن عبيد الله، قال أخبرني نافع، عن عبد الله، قال لما توفي عبد الله بن أبى جاء ابنه إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله أعطني قميصك أكفنه فيه، وصل عليه، واستغفر له، فأعطاه قميصه، وقال ‏\"‏ إذا فرغت فآذنا ‏\"‏‏.‏ فلما فرغ آذنه، فجاء ليصلي عليه، فجذبه عمر فقال أليس قد نهاك الله أن تصلي على المنافقين فقال ‏{‏استغفر لهم أو لا تستغفر لهم إن تستغفر لهم سبعين مرة فلن يغفر الله لهم‏}‏‏.‏ فنزلت ‏{‏ولا تصل على أحد منهم مات أبدا‏}‏ فترك الصلاة عليهم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5797,
			"arabicnumber": 5797,
			"text": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا إبراهيم بن نافع، عن الحسن، عن طاوس، عن أبي هريرة، قال ضرب رسول الله صلى الله عليه وسلم مثل البخيل والمتصدق، كمثل رجلين عليهما جبتان من حديد، قد اضطرت أيديهما إلى ثديهما وتراقيهما، فجعل المتصدق كلما تصدق بصدقة انبسطت عنه حتى تغشى أنامله وتعفو أثره، وجعل البخيل كلما هم بصدقة قلصت، وأخذت كل حلقة بمكانها‏.‏ قال أبو هريرة فأنا رأيت رسول الله صلى الله عليه وسلم يقول بإصبعه هكذا في جيبه، فلو رأيته يوسعها ولا تتوسع‏.‏ تابعه ابن طاوس عن أبيه وأبو الزناد عن الأعرج في الجبتين‏.‏ وقال حنظلة سمعت طاوسا سمعت أبا هريرة يقول جبتان‏.‏ وقال جعفر عن الأعرج جبتان‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5798,
			"arabicnumber": 5798,
			"text": "حدثنا قيس بن حفص، حدثنا عبد الواحد، حدثنا الأعمش، قال حدثني أبو الضحى، قال حدثني مسروق، قال حدثني المغيرة بن شعبة، قال انطلق النبي صلى الله عليه وسلم لحاجته ثم أقبل، فتلقيته بماء، فتوضأ وعليه جبة شأمية، فمضمض واستنشق وغسل وجهه، فذهب يخرج يديه من كميه فكانا ضيقين، فأخرج يديه من تحت الجبة، فغسلهما ومسح برأسه وعلى خفيه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5799,
			"arabicnumber": 5799,
			"text": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، عن عروة بن المغيرة، عن أبيه ـ رضى الله عنه ـ قال كنت مع النبي صلى الله عليه وسلم ذات ليلة في سفر فقال ‏\"‏ أمعك ماء ‏\"‏‏.‏ قلت نعم‏.‏ فنزل عن راحلته، فمشى حتى توارى عني في سواد الليل، ثم جاء فأفرغت عليه الإداوة، فغسل وجهه ويديه، وعليه جبة من صوف، فلم يستطع أن يخرج ذراعيه منها حتى أخرجهما من أسفل الجبة، فغسل ذراعيه، ثم مسح برأسه، ثم أهويت لأنزع خفيه فقال ‏\"‏ دعهما، فإني أدخلتهما طاهرتين، فمسح عليهما ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5800,
			"arabicnumber": 5800,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن أبي مليكة، عن المسور بن مخرمة، قال قسم رسول الله صلى الله عليه وسلم أقبية، ولم يعط مخرمة شيئا فقال مخرمة يا بنى انطلق بنا إلى رسول الله صلى الله عليه وسلم فانطلقت معه فقال ادخل فادعه لي‏.‏ قال فدعوته له، فخرج إليه وعليه قباء منها فقال ‏ \"‏ خبأت هذا لك ‏\"‏‏.‏ قال فنظر إليه فقال رضي مخرمة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5801,
			"arabicnumber": 5801,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر ـ رضى الله عنه ـ أنه قال أهدي لرسول الله صلى الله عليه وسلم فروج حرير، فلبسه، ثم صلى فيه، ثم انصرف فنزعه نزعا شديدا كالكاره له ثم قال ‏ \"‏ لا ينبغي هذا للمتقين ‏\"‏‏.‏ تابعه عبد الله بن يوسف عن الليث، وقال غيره فروج حرير‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5802,
			"arabicnumber": 5802,
			"text": "وقال لي مسدد حدثنا معتمر، سمعت أبي قال، رأيت على أنس برنسا أصفر من خز‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5803,
			"arabicnumber": 5803,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن نافع، عن عبد الله بن عمر، أن رجلا، قال يا رسول الله ما يلبس المحرم من الثياب قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تلبسوا القمص، ولا العمائم، ولا السراويلات، ولا البرانس، ولا الخفاف، إلا أحد لا يجد النعلين، فليلبس خفين، وليقطعهما أسفل من الكعبين، ولا تلبسوا من الثياب شيئا مسه زعفران ولا الورس ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5804,
			"arabicnumber": 5804,
			"text": "حدثنا أبو نعيم، حدثنا سفيان، عن عمرو، عن جابر بن زيد، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من لم يجد إزارا فليلبس سراويل، ومن لم يجد نعلين فليلبس خفين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5805,
			"arabicnumber": 5805,
			"text": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله، قال قام رجل فقال يا رسول الله ما تأمرنا أن نلبس إذا أحرمنا‏.‏ قال ‏ \"‏ لا تلبسوا القميص، والسراويل، والعمائم والبرانس، والخفاف، إلا أن يكون رجل ليس له نعلان، فليلبس الخفين أسفل من الكعبين، ولا تلبسوا شيئا من الثياب مسه زعفران ولا ورس ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5806,
			"arabicnumber": 5806,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال سمعت الزهري، قال أخبرني سالم، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يلبس المحرم القميص، ولا العمامة، ولا السراويل، ولا البرنس، ولا ثوبا مسه زعفران، ولا ورس، ولا الخفين، إلا لمن لم يجد النعلين، فإن لم يجدهما فليقطعهما أسفل من الكعبين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5807,
			"arabicnumber": 5807,
			"text": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن الزهري، عن عروة، عن عائشة ـ رضى الله عنها ـ قالت هاجر إلى الحبشة ناس من المسلمين، وتجهز أبو بكر مهاجرا، فقال النبي صلى الله عليه وسلم ‏\"‏ على رسلك، فإني أرجو أن يؤذن لي ‏\"‏‏.‏ فقال أبو بكر أو ترجوه بأبي أنت قال ‏\"‏ نعم ‏\"‏‏.‏ فحبس أبو بكر نفسه على النبي صلى الله عليه وسلم لصحبته، وعلف راحلتين كانتا عنده ورق السمر أربعة أشهر‏.‏ قال عروة قالت عائشة فبينا نحن يوما جلوس في بيتنا في نحر الظهيرة فقال قائل لأبي بكر هذا رسول الله صلى الله عليه وسلم مقبلا متقنعا، في ساعة لم يكن يأتينا فيها‏.‏ قال أبو بكر فدا له بأبي وأمي، والله إن جاء به في هذه الساعة إلا لأمر‏.‏ فجاء النبي صلى الله عليه وسلم فاستأذن، فأذن له فدخل، فقال حين دخل لأبي بكر ‏\"‏ أخرج من عندك ‏\"‏‏.‏ قال إنما هم أهلك بأبي أنت يا رسول الله‏.‏ قال ‏\"‏ فإني قد أذن لي في الخروج ‏\"‏‏.‏ قال فالصحبة بأبي أنت يا رسول الله‏.‏ قال ‏\"‏ نعم ‏\"‏‏.‏ قال فخذ بأبي أنت يا رسول الله إحدى راحلتى هاتين‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ بالثمن ‏\"‏‏.‏ قالت فجهزناهما أحث الجهاز، وضعنا لهما سفرة في جراب، فقطعت أسماء بنت أبي بكر قطعة من نطاقها، فأوكت به الجراب، ولذلك كانت تسمى ذات النطاق، ثم لحق النبي صلى الله عليه وسلم وأبو بكر بغار في جبل يقال له ثور، فمكث فيه ثلاث ليال يبيت عندهما عبد الله بن أبي بكر، وهو غلام شاب لقن ثقف، فيرحل من عندهما سحرا، فيصبح مع قريش بمكة كبائت، فلا يسمع أمرا يكادان به إلا وعاه، حتى يأتيهما بخبر ذلك حين يختلط الظلام، ويرعى عليهما عامر بن فهيرة مولى أبي بكر منحة من غنم، فيريحها عليهما حين تذهب ساعة من العشاء، فيبيتان في رسلها حتى ينعق بها عامر بن فهيرة بغلس، يفعل ذلك كل ليلة من تلك الليالي الثلاث‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5808,
			"arabicnumber": 5808,
			"text": "حدثنا أبو الوليد، حدثنا مالك، عن الزهري، عن أنس ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم دخل مكة عام الفتح وعلى رأسه المغفر‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5809,
			"arabicnumber": 5809,
			"text": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنت أمشي مع رسول الله صلى الله عليه وسلم وعليه برد نجراني غليظ الحاشية، فأدركه أعرابي فجبذه بردائه جبذة شديدة، حتى نظرت إلى صفحة عاتق رسول الله صلى الله عليه وسلم قد أثرت بها حاشية البرد من شدة جبذته، ثم قال يا محمد مر لي من مال الله الذي عندك‏.‏ فالتفت إليه رسول الله صلى الله عليه وسلم ثم ضحك ثم أمر له بعطاء‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5810,
			"arabicnumber": 5810,
			"text": "حدثنا قتيبة بن سعيد، حدثنا يعقوب بن عبد الرحمن، عن أبي حازم، عن سهل بن سعد، قال جاءت امرأة ببردة ـ قال سهل هل تدري ما البردة قال نعم هي الشملة، منسوج في حاشيتها ـ قالت يا رسول الله إني نسجت هذه بيدي أكسوكها‏.‏ فأخذها رسول الله صلى الله عليه وسلم محتاجا إليها، فخرج إلينا وإنها لإزاره، فجسها رجل من القوم فقال يا رسول الله اكسنيها‏.‏ قال ‏ \"‏ نعم ‏\"‏‏.‏ فجلس ما شاء الله في المجلس، ثم رجع، فطواها ثم أرسل بها إليه‏.‏ فقال له القوم ما أحسنت، سألتها إياه وقد عرفت أنه لا يرد سائلا‏.‏ فقال الرجل والله ما سألتها إلا لتكون كفني يوم أموت‏.‏ قال سهل فكانت كفنه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5811,
			"arabicnumber": 5811,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني سعيد بن المسيب، أن أبا هريرة ـ رضى الله عنه ـ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يدخل الجنة من أمتي زمرة هي سبعون ألفا، تضيء وجوههم إضاءة القمر ‏\"‏‏.‏ فقام عكاشة بن محصن الأسدي يرفع نمرة عليه قال ادع الله لي يا رسول الله أن يجعلني منهم‏.‏ فقال ‏\"‏ اللهم اجعله منهم ‏\"‏‏.‏ ثم قام رجل من الأنصار فقال يا رسول الله ادع الله أن يجعلني منهم‏.‏ فقال رسول الله ‏\"‏ سبقك عكاشة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5812,
			"arabicnumber": 5812,
			"text": "حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، عن أنس، قال قلت له أى الثياب كان أحب إلى النبي صلى الله عليه وسلم قال الحبرة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5813,
			"arabicnumber": 5813,
			"text": "حدثني عبد الله بن أبي الأسود، حدثنا معاذ، قال حدثني أبي، عن قتادة، عن أنس بن مالك، رضى الله عنه ـ قال كان أحب الثياب إلى النبي صلى الله عليه وسلم أن يلبسها الحبرة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5814,
			"arabicnumber": 5814,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني أبو سلمة بن عبد الرحمن بن عوف، أن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم حين توفي سجي ببرد حبرة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5816,
			"arabicnumber": 5816,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5817,
			"arabicnumber": 5817,
			"text": "حدثنا موسى بن إسماعيل، حدثنا إبراهيم بن سعد، حدثنا ابن شهاب، عن عروة، عن عائشة، قالت صلى رسول الله صلى الله عليه وسلم في خميصة له لها أعلام، فنظر إلى أعلامها نظرة، فلما سلم قال ‏ \"‏ اذهبوا بخميصتي هذه إلى أبي جهم، فإنها ألهتني آنفا عن صلاتي، وائتوني بأنبجانية أبي جهم بن حذيفة بن غانم من بني عدي بن كعب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5818,
			"arabicnumber": 5818,
			"text": "حدثنا مسدد، حدثنا إسماعيل، حدثنا أيوب، عن حميد بن هلال، عن أبي بردة، قال أخرجت إلينا عائشة كساء وإزارا غليظا فقالت قبض روح النبي صلى الله عليه وسلم في هذين‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5819,
			"arabicnumber": 5819,
			"text": "حدثني محمد بن بشار، حدثنا عبد الوهاب، حدثنا عبيد الله، عن خبيب، عن حفص بن عاصم، عن أبي هريرة ـ رضى الله عنه ـ قال نهى النبي صلى الله عليه وسلم عن الملامسة، والمنابذة، وعن صلاتين بعد الفجر حتى ترتفع الشمس، وبعد العصر حتى تغيب، وأن يحتبي بالثوب الواحد، ليس على فرجه منه شىء بينه وبين السماء، وأن يشتمل الصماء‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5820,
			"arabicnumber": 5820,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن يونس، عن ابن شهاب، قال أخبرني عامر بن سعد، أن أبا سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم عن لبستين وعن بيعتين، نهى عن الملامسة والمنابذة في البيع، والملامسة لمس الرجل ثوب الآخر بيده بالليل أو بالنهار، ولا يقلبه إلا بذلك، والمنابذة أن ينبذ الرجل إلى الرجل بثوبه، وينبذ الآخر ثوبه، ويكون ذلك بيعهما، عن غير نظر ولا تراض، واللبستين اشتمال الصماء، والصماء أن يجعل ثوبه على أحد عاتقيه، فيبدو أحد شقيه ليس عليه ثوب، واللبسة الأخرى احتباؤه بثوبه وهو جالس، ليس على فرجه منه شىء‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5821,
			"arabicnumber": 5821,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ قال نهى رسول الله صلى الله عليه وسلم عن لبستين أن يحتبي الرجل في الثوب الواحد ليس على فرجه منه شىء، وأن يشتمل بالثوب الواحد، ليس على أحد شقيه، وعن الملامسة والمنابذة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5822,
			"arabicnumber": 5822,
			"text": "حدثني محمد، قال أخبرني مخلد، أخبرنا ابن جريج، قال أخبرني ابن شهاب، عن عبيد الله بن عبد الله، عن أبي سعيد الخدري ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم نهى عن اشتمال الصماء، وأن يحتبي الرجل في ثوب واحد، ليس على فرجه منه شىء‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5823,
			"arabicnumber": 5823,
			"text": "حدثنا أبو نعيم، حدثنا إسحاق بن سعيد، عن أبيه، سعيد بن فلان ـ هو عمرو بن سعيد بن العاص ـ عن أم خالد بنت خالد، أتي النبي صلى الله عليه وسلم بثياب فيها خميصة سوداء صغيرة فقال ‏\"‏ من ترون نكسو هذه ‏\"‏‏.‏ فسكت القوم قال ‏\"‏ ائتوني بأم خالد ‏\"‏‏.‏ فأتي بها تحمل فأخذ الخميصة بيده فألبسها وقال ‏\"‏ أبلي وأخلقي ‏\"‏‏.‏ وكان فيها علم أخضر أو أصفر فقال ‏\"‏ يا أم خالد هذا سناه ‏\"‏‏.‏ وسناه بالحبشية حسن‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5824,
			"arabicnumber": 5824,
			"text": "حدثني محمد بن المثنى، قال حدثني ابن أبي عدي، عن ابن عون، عن محمد، عن أنس ـ رضى الله عنه ـ قال لما ولدت أم سليم قالت لي يا أنس انظر هذا الغلام فلا يصيبن شيئا حتى تغدو به إلى النبي صلى الله عليه وسلم يحنكه‏.‏ فغدوت به، فإذا هو في حائط وعليه خميصة حريثية، وهو يسم الظهر الذي قدم عليه في الفتح‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5825,
			"arabicnumber": 5825,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الوهاب، أخبرنا أيوب، عن عكرمة، أن رفاعة، طلق امرأته، فتزوجها عبد الرحمن بن الزبير القرظي، قالت عائشة وعليها خمار أخضر‏.‏ فشكت إليها، وأرتها خضرة بجلدها، فلما جاء رسول الله صلى الله عليه وسلم والنساء ينصر بعضهن بعضا قالت عائشة ما رأيت مثل ما يلقى المؤمنات، لجلدها أشد خضرة من ثوبها‏.‏ قال وسمع أنها قد أتت رسول الله صلى الله عليه وسلم فجاء ومعه ابنان له من غيرها‏.‏ قالت والله ما لي إليه من ذنب، إلا أن ما معه ليس بأغنى عني من هذه‏.‏ وأخذت هدبة من ثوبها، فقال كذبت والله يا رسول الله، إني لأنفضها نفض الأديم، ولكنها ناشز تريد رفاعة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فإن كان ذلك لم تحلي له ـ أو لم تصلحي له ـ حتى يذوق من عسيلتك ‏\"‏‏.‏ قال وأبصر معه ابنين فقال ‏\"‏ بنوك هؤلاء ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ هذا الذي تزعمين ما تزعمين، فوالله لهم أشبه به من الغراب بالغراب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5826,
			"arabicnumber": 5826,
			"text": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا محمد بن بشر، حدثنا مسعر، عن سعد بن إبراهيم، عن أبيه، عن سعد، قال رأيت بشمال النبي صلى الله عليه وسلم وبيمينه رجلين عليهما ثياب بيض يوم أحد، ما رأيتهما قبل ولا بعد‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5827,
			"arabicnumber": 5827,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن عبد الله بن بريدة، عن يحيى بن يعمر، حدثه أن أبا الأسود الديلي حدثه أن أبا ذر ـ رضى الله عنه ـ حدثه قال أتيت النبي صلى الله عليه وسلم وعليه ثوب أبيض وهو نائم، ثم أتيته وقد استيقظ فقال ‏\"‏ ما من عبد قال لا إله إلا الله‏.‏ ثم مات على ذلك، إلا دخل الجنة ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق على رغم أنف أبي ذر ‏\"‏‏.‏ وكان أبو ذر إذا حدث بهذا قال وإن رغم أنف أبي ذر‏.‏ قال أبو عبد الله هذا عند الموت أو قبله، إذا تاب وندم وقال لا إله إلا الله‏.‏ غفر له‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5828,
			"arabicnumber": 5828,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا قتادة، قال سمعت أبا عثمان النهدي، أتانا كتاب عمر ونحن مع عتبة بن فرقد بأذربيجان أن رسول الله صلى الله عليه وسلم نهى عن الحرير، إلا هكذا، وأشار بإصبعيه اللتين تليان الإبهام قال فيما علمنا أنه يعني الأعلام‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5829,
			"arabicnumber": 5829,
			"text": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا عاصم، عن أبي عثمان، قال كتب إلينا عمر ونحن بأذربيجان أن النبي صلى الله عليه وسلم نهى عن لبس الحرير إلا هكذا، وصف لنا النبي صلى الله عليه وسلم إصبعيه‏.‏ ورفع زهير الوسطى والسبابة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5830,
			"arabicnumber": 5830,
			"text": "حدثنا مسدد، حدثنا يحيى، عن التيمي، عن أبي عثمان، قال كنا مع عتبة فكتب إليه عمر ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يلبس الحرير في الدنيا، إلا لم يلبس في الآخرة منه ‏\"‏‏.‏ حدثنا الحسن بن عمر، حدثنا معتمر، حدثنا أبي، حدثنا أبو عثمان،، وأشار أبو عثمان، بإصبعيه المسبحة والوسطى‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5831,
			"arabicnumber": 5831,
			"text": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، قال كان حذيفة بالمداين فاستسقى، فأتاه دهقان بماء في إناء من فضة فرماه به وقال إني لم أرمه إلا أني نهيته فلم ينته قال رسول الله صلى الله عليه وسلم ‏ \"‏ الذهب والفضة والحرير والديباج هي لهم في الدنيا، ولكم في الآخرة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5832,
			"arabicnumber": 5832,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا عبد العزيز بن صهيب، قال سمعت أنس بن مالك ـ قال شعبة فقلت أعن النبي صلى الله عليه وسلم فقال شديدا عن النبي صلى الله عليه وسلم ـ فقال ‏ \"‏ من لبس الحرير في الدنيا فلن يلبسه في الآخرة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5833,
			"arabicnumber": 5833,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، قال سمعت ابن الزبير، يخطب يقول قال محمد صلى الله عليه وسلم ‏ \"‏ من لبس الحرير في الدنيا لم يلبسه في الآخرة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5834,
			"arabicnumber": 5834,
			"text": "حدثنا علي بن الجعد، أخبرنا شعبة، عن أبي ذبيان، خليفة بن كعب قال سمعت ابن الزبير، يقول سمعت عمر، يقول قال النبي صلى الله عليه وسلم ‏ \"‏ من لبس الحرير في الدنيا لم يلبسه في الآخرة ‏\"‏‏.‏ وقال لنا أبو معمر حدثنا عبد الوارث، عن يزيد، قالت معاذة أخبرتني أم عمرو بنت عبد الله، سمعت عبد الله بن الزبير، سمع عمر، سمع النبي صلى الله عليه وسلم‏ نحوه",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5835,
			"arabicnumber": 5835,
			"text": "حدثني محمد بن بشار، حدثنا عثمان بن عمر، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن عمران بن حطان، قال سألت عائشة عن الحرير، فقالت ائت ابن عباس فسله‏.‏ قال فسألته فقال سل ابن عمر‏.‏ قال فسألت ابن عمر فقال أخبرني أبو حفص ـ يعني عمر بن الخطاب ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إنما يلبس الحرير في الدنيا من لا خلاق له في الآخرة ‏\"‏‏.‏ فقلت صدق وما كذب أبو حفص على رسول الله صلى الله عليه وسلم‏.‏ وقال عبد الله بن رجاء حدثنا حرب عن يحيى حدثني عمران‏.‏ وقص الحديث‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5836,
			"arabicnumber": 5836,
			"text": "حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن البراء ـ رضى الله عنه ـ قال أهدي للنبي صلى الله عليه وسلم ثوب حرير، فجعلنا نلمسه، ونتعجب منه، فقال النبي صلى الله عليه وسلم ‏\"‏ أتعجبون من هذا ‏\"‏‏.‏ قلنا نعم‏.‏ قال ‏\"‏ مناديل سعد بن معاذ في الجنة خير من هذا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5837,
			"arabicnumber": 5837,
			"text": "حدثنا علي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت ابن أبي نجيح، عن مجاهد، عن ابن أبي ليلى، عن حذيفة ـ رضى الله عنه ـ قال نهانا النبي صلى الله عليه وسلم أن نشرب في آنية الذهب والفضة، وأن نأكل فيها، وعن لبس الحرير والديباج، وأن نجلس عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5838,
			"arabicnumber": 5838,
			"text": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا سفيان، عن أشعث بن أبي الشعثاء، حدثنا معاوية بن سويد بن مقرن، عن ابن عازب، قال نهانا النبي صلى الله عليه وسلم عن المياثر الحمر والقسي‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5839,
			"arabicnumber": 5839,
			"text": "حدثني محمد، أخبرنا وكيع، أخبرنا شعبة، عن قتادة، عن أنس، قال رخص النبي صلى الله عليه وسلم للزبير وعبد الرحمن في لبس الحرير لحكة بهما‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5840,
			"arabicnumber": 5840,
			"text": "حدثنا سليمان بن حرب، حدثنا شعبة، ح وحدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عبد الملك بن ميسرة، عن زيد بن وهب، عن علي ـ رضى الله عنه ـ قال كساني النبي صلى الله عليه وسلم حلة سيراء، فخرجت فيها، فرأيت الغضب في وجهه، فشققتها بين نسائي‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5841,
			"arabicnumber": 5841,
			"text": "حدثنا موسى بن إسماعيل، قال حدثني جويرية، عن نافع، عن عبد الله، أن عمر ـ رضى الله عنه ـ رأى حلة سيراء تباع فقال يا رسول الله لو ابتعتها، تلبسها للوفد إذا أتوك والجمعة‏.‏ قال ‏\"‏ إنما يلبس هذه من لا خلاق له ‏\"‏‏.‏ وأن النبي صلى الله عليه وسلم بعث بعد ذلك إلى عمر حلة سيراء حرير، كساها إياه فقال عمر كسوتنيها وقد سمعتك تقول فيها ما قلت فقال ‏\"‏ إنما بعثت إليك لتبيعها أو تكسوها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5842,
			"arabicnumber": 5842,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني أنس بن مالك، أنه رأى على أم كلثوم ـ عليها السلام ـ بنت رسول الله صلى الله عليه وسلم برد حرير سيراء‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5843,
			"arabicnumber": 5843,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن عبيد بن حنين، عن ابن عباس ـ رضى الله عنهما ـ قال لبثت سنة وأنا أريد أن أسأل عمر عن المرأتين اللتين تظاهرتا على النبي صلى الله عليه وسلم فجعلت أهابه، فنزل يوما منزلا فدخل الأراك، فلما خرج سألته فقال عائشة وحفصة ـ ثم قال ـ كنا في الجاهلية لا نعد النساء شيئا، فلما جاء الإسلام وذكرهن الله، رأينا لهن بذلك علينا حقا، من غير أن ندخلهن في شىء من أمورنا، وكان بيني وبين امرأتي كلام فأغلظت لي فقلت لها وإنك لهناك‏.‏ قالت تقول هذا لي وابنتك تؤذي النبي صلى الله عليه وسلم فأتيت حفصة فقلت لها إني أحذرك أن تعصي الله ورسوله‏.‏ وتقدمت إليها في أذاه، فأتيت أم سلمة فقلت لها‏.‏ فقالت أعجب منك يا عمر قد دخلت في أمورنا، فلم يبق إلا أن تدخل بين رسول الله صلى الله عليه وسلم وأزواجه، فرددت، وكان رجل من الأنصار إذا غاب عن رسول الله صلى الله عليه وسلم وشهدته أتيته بما يكون، وإذا غبت عن رسول الله صلى الله عليه وسلم وشهد أتاني بما يكون من رسول الله صلى الله عليه وسلم وكان من حول رسول الله صلى الله عليه وسلم قد استقام له، فلم يبق إلا ملك غسان بالشأم، كنا نخاف أن يأتينا، فما شعرت إلا بالأنصاري وهو يقول إنه قد حدث أمر‏.‏ قلت له وما هو أجاء الغساني قال أعظم من ذاك، طلق رسول الله صلى الله عليه وسلم نساءه‏.‏ فجئت فإذا البكاء من حجرها كلها، وإذا النبي صلى الله عليه وسلم قد صعد في مشربة له، وعلى باب المشربة وصيف فأتيته فقلت استأذن لي‏.‏ فدخلت فإذا النبي صلى الله عليه وسلم على حصير قد أثر في جنبه، وتحت رأسه مرفقة من أدم، حشوها ليف، وإذا أهب معلقة وقرظ، فذكرت الذي قلت لحفصة وأم سلمة، والذي ردت على أم سلمة، فضحك رسول الله صلى الله عليه وسلم فلبث تسعا وعشرين ليلة، ثم نزل‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5844,
			"arabicnumber": 5844,
			"text": "حدثنا عبد الله بن محمد، حدثنا هشام، أخبرنا معمر، عن الزهري، أخبرتني هند بنت الحارث، عن أم سلمة، قالت استيقظ النبي صلى الله عليه وسلم من الليل وهو يقول ‏ \"‏ لا إله إلا الله، ماذا أنزل الليلة من الفتنة، ماذا أنزل من الخزائن، من يوقظ صواحب الحجرات، كم من كاسية في الدنيا عارية يوم القيامة ‏\"‏‏.‏ قال الزهري وكانت هند لها أزرار في كميها بين أصابعها‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5845,
			"arabicnumber": 5845,
			"text": "حدثنا أبو الوليد، حدثنا إسحاق بن سعيد بن عمرو بن سعيد بن العاص، قال حدثني أبي قال، حدثتني أم خالد بنت خالد، قالت أتي رسول الله صلى الله عليه وسلم بثياب فيها خميصة سوداء قال ‏\"‏ من ترون نكسوها هذه الخميصة ‏\"‏‏.‏ فأسكت القوم‏.‏ قال ‏\"‏ ائتوني بأم خالد ‏\"‏‏.‏ فأتي بي النبي صلى الله عليه وسلم فألبسها بيده وقال ‏\"‏ أبلي وأخلقي ‏\"‏‏.‏ مرتين فجعل ينظر إلى علم الخميصة، ويشير بيده إلى ويقول ‏\"‏ يا أم خالد هذا سنا ‏\"‏‏.‏ والسنا بلسان الحبشية الحسن‏.‏ قال إسحاق حدثتني امرأة من أهلي أنها رأته على أم خالد‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5846,
			"arabicnumber": 5846,
			"text": "حدثنا مسدد، حدثنا عبد الوارث، عن عبد العزيز، عن أنس، قال نهى النبي صلى الله عليه وسلم أن يتزعفر الرجل‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5847,
			"arabicnumber": 5847,
			"text": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر ـ رضى الله عنهما ـ قال نهى النبي صلى الله عليه وسلم أن يلبس المحرم ثوبا مصبوغا بورس أو بزعفران‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5848,
			"arabicnumber": 5848,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن أبي إسحاق، سمع البراء ـ رضى الله عنه ـ يقول كان النبي صلى الله عليه وسلم مربوعا، وقد رأيته في حلة حمراء ما رأيت شيئا أحسن منه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5849,
			"arabicnumber": 5849,
			"text": "حدثنا قبيصة، حدثنا سفيان، عن أشعث، عن معاوية بن سويد بن مقرن، عن البراء ـ رضى الله عنه ـ قال أمرنا النبي صلى الله عليه وسلم بسبع عيادة المريض، واتباع الجنائز، وتشميت العاطس، ونهانا عن لبس الحرير، والديباج، والقسي، والإستبرق، ومياثر الحمر‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5850,
			"arabicnumber": 5850,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد، عن سعيد أبي مسلمة، قال سألت أنسا أكان النبي صلى الله عليه وسلم يصلي في نعليه قال نعم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5851,
			"arabicnumber": 5851,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن سعيد المقبري، عن عبيد بن جريج، أنه قال لعبد الله بن عمر ـ رضى الله عنهما ـ رأيتك تصنع أربعا لم أر أحدا من أصحابك يصنعها‏.‏ قال ما هي يا ابن جريج قال رأيتك لا تمس من الأركان إلا اليمانيين، ورأيتك تلبس النعال السبتية، ورأيتك تصبغ بالصفرة، ورأيتك إذا كنت بمكة أهل الناس إذا رأوا الهلال، ولم تهل أنت حتى كان يوم التروية‏.‏ فقال له عبد الله بن عمر أما الأركان فإني لم أر رسول الله صلى الله عليه وسلم يمس إلا اليمانيين، وأما النعال السبتية فإني رأيت رسول الله صلى الله عليه وسلم يلبس النعال التي ليس فيها شعر ويتوضأ فيها فأنا أحب أن ألبسها، وأما الصفرة فإني رأيت رسول الله صلى الله عليه وسلم يصبغ بها، فأنا أحب أن أصبغ بها وأما الإهلال فإني لم أر رسول الله صلى الله عليه وسلم يهل حتى تنبعث به راحلته‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5852,
			"arabicnumber": 5852,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن دينار، عن ابن عمر ـ رضى الله عنهما ـ قال نهى رسول الله صلى الله عليه وسلم أن يلبس المحرم ثوبا مصبوغا بزعفران أو ورس، وقال ‏ \"‏ من لم يجد نعلين فليلبس خفين، وليقطعهما أسفل من الكعبين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5853,
			"arabicnumber": 5853,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس ـ رضى الله عنهما ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ من لم يكن له إزار فليلبس السراويل، ومن لم يكن له نعلان فليلبس خفين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5854,
			"arabicnumber": 5854,
			"text": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني أشعث بن سليم، سمعت أبي يحدث، عن مسروق، عن عائشة ـ رضى الله عنها ـ قالت كان النبي صلى الله عليه وسلم يحب التيمن في طهوره وترجله وتنعله‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5855,
			"arabicnumber": 5855,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا انتعل أحدكم فليبدأ باليمين وإذا نزع فليبدأ بالشمال، لتكن اليمنى أولهما تنعل وآخرهما تنزع ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5856,
			"arabicnumber": 5856,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يمشي أحدكم في نعل واحدة ليحفهما جميعا، أو لينعلهما جميعا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5857,
			"arabicnumber": 5857,
			"text": "حدثنا حجاج بن منهال، حدثنا همام، عن قتادة، حدثنا أنس ـ رضى الله عنه ـ أن نعل، النبي صلى الله عليه وسلم كان لها قبالان‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5858,
			"arabicnumber": 5858,
			"text": "حدثني محمد، أخبرنا عبد الله، أخبرنا عيسى بن طهمان، قال خرج إلينا أنس بن مالك بنعلين لهما قبالان، فقال ثابت البناني هذه نعل النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5859,
			"arabicnumber": 5859,
			"text": "حدثنا محمد بن عرعرة، قال حدثني عمر بن أبي زائدة، عن عون بن أبي جحيفة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم وهو في قبة حمراء من أدم، ورأيت بلالا أخذ وضوء النبي صلى الله عليه وسلم والناس يبتدرون الوضوء، فمن أصاب منه شيئا تمسح به، ومن لم يصب منه شيئا أخذ من بلل يد صاحبه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5860,
			"arabicnumber": 5860,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، أخبرني أنس بن مالك، ح وقال الليث حدثني يونس، عن ابن شهاب، قال أخبرني أنس بن مالك ـ رضى الله عنه ـ قال أرسل النبي صلى الله عليه وسلم إلى الأنصار، وجمعهم في قبة من أدم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5861,
			"arabicnumber": 5861,
			"text": "حدثني محمد بن أبي بكر، حدثنا معتمر، عن عبيد الله، عن سعيد بن أبي سعيد، عن أبي سلمة بن عبد الرحمن، عن عائشة ـ رضى الله عنها ـ أن النبي صلى الله عليه وسلم كان يحتجر حصيرا بالليل فيصلي، ويبسطه بالنهار فيجلس عليه، فجعل الناس يثوبون إلى النبي صلى الله عليه وسلم فيصلون بصلاته حتى كثروا فأقبل فقال ‏ \"‏ يا أيها الناس خذوا من الأعمال ما تطيقون، فإن الله لا يمل حتى تملوا، وإن أحب الأعمال إلى الله ما دام وإن قل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5862,
			"arabicnumber": 5862,
			"text": "وقال الليث حدثني ابن أبي مليكة، عن المسور بن مخرمة، أن أباه، مخرمة قال له يا بنى إنه بلغني أن النبي صلى الله عليه وسلم قدمت عليه أقبية فهو يقسمها، فاذهب بنا إليه، فذهبنا فوجدنا النبي صلى الله عليه وسلم في منزله، فقال لي يا بنى ادع لي النبي صلى الله عليه وسلم فأعظمت ذلك‏.‏ فقلت أدعو لك رسول الله صلى الله عليه وسلم فقال يا بنى إنه ليس بجبار‏.‏ فدعوته فخرج وعليه قباء من ديباج مزرر بالذهب، فقال ‏ \"‏ يا مخرمة هذا خبأناه لك ‏\"‏‏.‏ فأعطاه إياه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5863,
			"arabicnumber": 5863,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا أشعث بن سليم، قال سمعت معاوية بن سويد بن مقرن، قال سمعت البراء بن عازب ـ رضى الله عنهما ـ يقول نهانا النبي صلى الله عليه وسلم عن سبع نهى عن خاتم الذهب ـ أو قال حلقة الذهب ـ وعن الحرير، والإستبرق، والديباج، والميثرة الحمراء، والقسي، وآنية الفضة، وأمرنا بسبع بعيادة المريض، واتباع الجنائز، وتشميت العاطس، ورد السلام، وإجابة الداعي، وإبرار المقسم، ونصر المظلوم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5864,
			"arabicnumber": 5864,
			"text": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم أنه نهى عن خاتم الذهب‏.‏ وقال عمرو أخبرنا شعبة عن قتادة سمع النضر سمع بشيرا مثله‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5865,
			"arabicnumber": 5865,
			"text": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، قال حدثني نافع، عن عبد الله ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم اتخذ خاتما من ذهب، وجعل فصه مما يلي كفه، فاتخذه الناس، فرمى به، واتخذ خاتما من ورق أو فضة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5866,
			"arabicnumber": 5866,
			"text": "حدثنا يوسف بن موسى، حدثنا أبو أسامة، حدثنا عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما أن رسول الله صلى الله عليه وسلم اتخذ خاتما من ذهب أو فضة، وجعل فصه مما يلي كفه، ونقش فيه محمد رسول الله‏.‏ فاتخذ الناس مثله، فلما رآهم قد اتخذوها رمى به، وقال ‏ \"‏ لا ألبسه أبدا ‏\"‏‏.‏ ثم اتخذ خاتما من فضة، فاتخذ الناس خواتيم الفضة‏.‏ قال ابن عمر فلبس الخاتم بعد النبي صلى الله عليه وسلم أبو بكر ثم عمر ثم عثمان، حتى وقع من عثمان في بئر أريس‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5867,
			"arabicnumber": 5867,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الله بن دينار، عن عبد الله بن عمر ـ رضى الله عنهما ـ قال كان رسول الله صلى الله عليه وسلم يلبس خاتما من ذهب فنبذه فقال ‏ \"‏ لا ألبسه أبدا ‏\"‏‏.‏ فنبذ الناس خواتيمهم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5868,
			"arabicnumber": 5868,
			"text": "حدثني يحيى بن بكير، حدثنا الليث، عن يونس، عن ابن شهاب، قال حدثني أنس بن مالك ـ رضى الله عنه ـ أنه رأى في يد رسول الله صلى الله عليه وسلم خاتما من ورق يوما واحدا، ثم إن الناس اصطنعوا الخواتيم من ورق ولبسوها، فطرح رسول الله صلى الله عليه وسلم خاتمه، فطرح الناس خواتيمهم‏.‏ تابعه إبراهيم بن سعد وزياد وشعيب عن الزهري‏.‏ وقال ابن مسافر عن الزهري أرى خاتما من ورق‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5869,
			"arabicnumber": 5869,
			"text": "حدثنا عبدان، أخبرنا يزيد بن زريع، أخبرنا حميد، قال سئل أنس هل اتخذ النبي صلى الله عليه وسلم خاتما قال أخر ليلة صلاة العشاء إلى شطر الليل، ثم أقبل علينا بوجهه، فكأني أنظر إلى وبيص خاتمه‏.‏ قال ‏ \"‏ إن الناس قد صلوا وناموا، وإنكم لم تزالوا في صلاة ما انتظرتموها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5870,
			"arabicnumber": 5870,
			"text": "حدثنا إسحاق، أخبرنا معتمر، قال سمعت حميدا، يحدث عن أنس ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم كان خاتمه من فضة وكان فصه منه‏.‏ وقال يحيى بن أيوب حدثني حميد سمع أنسا عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5871,
			"arabicnumber": 5871,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز بن أبي حازم، عن أبيه، أنه سمع سهلا، يقول جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت جئت أهب نفسي‏.‏ فقامت طويلا فنظر وصوب، فلما طال مقامها فقال رجل زوجنيها، إن لم تكن لك بها حاجة‏.‏ قال ‏\"‏ عندك شىء تصدقها ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ انظر ‏\"‏‏.‏ فذهب ثم رجع فقال والله إن وجدت شيئا‏.‏ قال ‏\"‏ اذهب فالتمس ولو خاتما من حديد ‏\"‏‏.‏ فذهب ثم رجع قال لا والله ولا خاتما من حديد‏.‏ وعليه إزار ما عليه رداء‏.‏ فقال أصدقها إزاري فقال النبي صلى الله عليه وسلم ‏\"‏ إزارك إن لبسته لم يكن عليك منه شىء، وإن لبسته لم يكن عليها منه شىء ‏\"‏‏.‏ فتنحى الرجل فجلس فرآه النبي صلى الله عليه وسلم موليا فأمر به فدعي فقال ‏\"‏ ما معك من القرآن ‏\"‏‏.‏ قال سورة كذا وكذا لسور عددها‏.‏ قال ‏\"‏ قد ملكتكها بما معك من القرآن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 5872,
			"arabicnumber": 5872,
			"text": "حدثنا عبد الأعلى، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس بن مالك ـ رضى الله عنه ـ أن نبي الله صلى الله عليه وسلم أراد أن يكتب إلى رهط أو أناس من الأعاجم، فقيل له إنهم لا يقبلون كتابا إلا عليه خاتم، فاتخذ النبي صلى الله عليه وسلم خاتما من فضة نقشه محمد رسول الله فكأني بوبيص أو ببصيص الخاتم في إصبع النبي صلى الله عليه وسلم أو في كفه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5873,
			"arabicnumber": 5873,
			"text": "حدثني محمد بن سلام، أخبرنا عبد الله بن نمير، عن عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال اتخذ رسول الله صلى الله عليه وسلم خاتما من ورق، وكان في يده، ثم كان بعد في يد أبي بكر، ثم كان بعد في يد عمر، ثم كان بعد في يد عثمان، حتى وقع بعد في بئر أريس، نقشه محمد رسول الله‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5874,
			"arabicnumber": 5874,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز بن صهيب، عن أنس ـ رضى الله عنه ـ قال صنع النبي صلى الله عليه وسلم خاتما قال ‏ \"‏ إنا اتخذنا خاتما، ونقشنا فيه نقشا، فلا ينقش عليه أحد ‏\"‏‏.‏ قال فإني لأرى بريقه في خنصره‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5875,
			"arabicnumber": 5875,
			"text": "حدثنا آدم بن أبي إياس، حدثنا شعبة، عن قتادة، عن أنس بن مالك ـ رضى الله عنه ـ قال لما أراد النبي صلى الله عليه وسلم أن يكتب إلى الروم قيل له إنهم لن يقرءوا كتابك إذا لم يكن مختوما‏.‏ فاتخذ خاتما من فضة، ونقشه محمد رسول الله‏.‏ فكأنما أنظر إلى بياضه في يده‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5876,
			"arabicnumber": 5876,
			"text": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، أن عبد الله، حدثه أن النبي صلى الله عليه وسلم اصطنع خاتما من ذهب، جعل فصه في بطن كفه إذا لبسه، فاصطنع الناس خواتيم من ذهب، فرقي المنبر، فحمد الله وأثنى عليه فقال ‏ \"‏ إني كنت اصطنعته، وإني لا ألبسه ‏\"‏‏.‏ فنبذه فنبذ الناس‏.‏ قال جويرية ولا أحسبه إلا قال في يده اليمنى‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5877,
			"arabicnumber": 5877,
			"text": "حدثنا مسدد، حدثنا حماد، عن عبد العزيز بن صهيب، عن أنس بن مالك ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم اتخذ خاتما من فضة، ونقش فيه، محمد رسول الله‏.‏ وقال ‏ \"‏ إني اتخذت خاتما من ورق، ونقشت فيه، محمد رسول الله‏.‏ فلا ينقشن أحد على نقشه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5878,
			"arabicnumber": 5878,
			"text": "حدثني محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أبا بكر ـ رضى الله عنه ـ لما استخلف كتب له، وكان نقش الخاتم ثلاثة أسطر‏.‏ محمد سطر، ورسول سطر، والله سطر‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 5879,
			"arabicnumber": 5879,
			"text": "وزادني أحمد حدثنا الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، قال كان خاتم النبي صلى الله عليه وسلم في يده، وفي يد أبي بكر بعده، وفي يد عمر بعد أبي بكر، فلما كان عثمان جلس على بئر أريس ـ قال ـ فأخرج الخاتم، فجعل يعبث به فسقط قال فاختلفنا ثلاثة أيام مع عثمان فننزح البئر فلم نجده‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 5880,
			"arabicnumber": 5880,
			"text": "حدثنا أبو عاصم، أخبرنا ابن جريج، أخبرنا الحسن بن مسلم، عن طاوس، عن ابن عباس ـ رضى الله عنهما ـ شهدت العيد مع النبي صلى الله عليه وسلم فصلى قبل الخطبة‏.‏ وزاد ابن وهب عن ابن جريج فأتى النساء فجعلن يلقين الفتخ والخواتيم في ثوب بلال‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 5881,
			"arabicnumber": 5881,
			"text": "حدثنا محمد بن عرعرة، حدثنا شعبة، عن عدي بن ثابت، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهما ـ قال خرج النبي صلى الله عليه وسلم يوم عيد فصلى ركعتين، لم يصل قبل ولا بعد، ثم أتى النساء فأمرهن بالصدقة، فجعلت المرأة تصدق بخرصها وسخابها‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 5882,
			"arabicnumber": 5882,
			"text": "حدثنا إسحاق بن إبراهيم، حدثنا عبدة، حدثنا هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت هلكت قلادة لأسماء، فبعث النبي صلى الله عليه وسلم في طلبها رجالا، فحضرت الصلاة وليسوا على وضوء ولم يجدوا ماء، فصلوا وهم على غير وضوء، فذكروا ذلك للنبي صلى الله عليه وسلم فأنزل الله آية التيمم‏.‏ زاد ابن نمير عن هشام عن أبيه عن عائشة استعارت من أسماء‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 5883,
			"arabicnumber": 5883,
			"text": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عدي، قال سمعت سعيدا، عن ابن عباس ـ رضى الله عنهما أن النبي صلى الله عليه وسلم صلى يوم العيد ركعتين، لم يصل قبلها ولا بعدها ثم أتى النساء ومعه بلال فأمرهن بالصدقة، فجعلت المرأة تلقي قرطها‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 5884,
			"arabicnumber": 5884,
			"text": "حدثني إسحاق بن إبراهيم الحنظلي، أخبرنا يحيى بن آدم، حدثنا ورقاء بن عمر، عن عبيد الله بن أبي يزيد، عن نافع بن جبير، عن أبي هريرة ـ رضى الله عنه ـ قال كنت مع رسول الله صلى الله عليه وسلم في سوق من أسواق المدينة فانصرف فانصرفت فقال ‏\"‏ أين لكع ـ ثلاثا ـ ادع الحسن بن علي ‏\"‏‏.‏ فقام الحسن بن علي يمشي وفي عنقه السخاب، فقال النبي صلى الله عليه وسلم بيده هكذا، فقال الحسن بيده، هكذا فالتزمه فقال ‏\"‏ اللهم إني أحبه، فأحبه، وأحب من يحبه ‏\"‏‏.‏ قال أبو هريرة فما كان أحد أحب إلى من الحسن بن علي بعد ما قال رسول الله صلى الله عليه وسلم ما قال‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 5885,
			"arabicnumber": 5885,
			"text": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قتادة، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال لعن رسول الله صلى الله عليه وسلم المتشبهين من الرجال بالنساء، والمتشبهات من النساء بالرجال‏.‏ تابعه عمرو أخبرنا شعبة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 5886,
			"arabicnumber": 5886,
			"text": "حدثنا معاذ بن فضالة، حدثنا هشام، عن يحيى، عن عكرمة، عن ابن عباس، قال لعن النبي صلى الله عليه وسلم المخنثين من الرجال، والمترجلات من النساء وقال ‏ \"‏ أخرجوهم من بيوتكم ‏\"‏‏.‏ قال فأخرج النبي صلى الله عليه وسلم فلانا، وأخرج عمر فلانا‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 5887,
			"arabicnumber": 5887,
			"text": "حدثنا مالك بن إسماعيل، حدثنا زهير، حدثنا هشام بن عروة، أن عروة، أخبره أن زينب ابنة أبي سلمة أخبرته أن أم سلمة أخبرتها أن النبي صلى الله عليه وسلم كان عندها وفي البيت مخنث، فقال لعبد الله أخي أم سلمة يا عبد الله إن فتح لكم غدا الطائف، فإني أدلك على بنت غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ لا يدخلن هؤلاء عليكن ‏\"‏‏.‏ قال أبو عبد الله تقبل بأربع وتدبر بثمان يعني أربع عكن بطنها، فهى تقبل بهن، وقوله وتدبر بثمان‏.‏ يعني أطراف هذه العكن الأربع، لأنها محيطة بالجنبين حتى لحقت وإنما قال بثمان‏.‏ ولم يقل بثمانية‏.‏ وواحد الأطراف وهو ذكر، لأنه لم يقل ثمانية أطراف‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 5888,
			"arabicnumber": 5888,
			"text": "حدثنا المكي بن إبراهيم، عن حنظلة، عن نافع، قال أصحابنا عن المكي، عن ابن عمر ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ من الفطرة قص الشارب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 5889,
			"arabicnumber": 5889,
			"text": "حدثنا علي، حدثنا سفيان، قال الزهري حدثنا عن سعيد بن المسيب، عن أبي هريرة، رواية ‏ \"‏ الفطرة خمس ـ أو خمس من الفطرة ـ الختان، والاستحداد، ونتف الإبط، وتقليم الأظفار، وقص الشارب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 5890,
			"arabicnumber": 5890,
			"text": "حدثنا أحمد بن أبي رجاء، حدثنا إسحاق بن سليمان، قال سمعت حنظلة، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من الفطرة حلق العانة، وتقليم الأظفار، وقص الشارب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 5891,
			"arabicnumber": 5891,
			"text": "حدثنا أحمد بن يونس، حدثنا إبراهيم بن سعد، حدثنا ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة ـ رضى الله عنه ـ سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ الفطرة خمس الختان، والاستحداد، وقص الشارب، وتقليم الأظفار، ونتف الآباط ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 5892,
			"arabicnumber": 5892,
			"text": "حدثنا محمد بن منهال، حدثنا يزيد بن زريع، حدثنا عمر بن محمد بن زيد، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ خالفوا المشركين، وفروا اللحى، وأحفوا الشوارب ‏\"‏‏.‏ وكان ابن عمر إذا حج أو اعتمر قبض على لحيته، فما فضل أخذه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 5893,
			"arabicnumber": 5893,
			"text": "حدثني محمد، أخبرنا عبدة، أخبرنا عبيد الله بن عمر، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ انهكوا الشوارب، وأعفوا اللحى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 5894,
			"arabicnumber": 5894,
			"text": "حدثنا معلى بن أسد، حدثنا وهيب، عن أيوب، عن محمد بن سيرين، قال سألت أنسا أخضب النبي صلى الله عليه وسلم قال لم يبلغ الشيب إلا قليلا‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 5895,
			"arabicnumber": 5895,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، قال سئل أنس عن خضاب النبي، صلى الله عليه وسلم فقال إنه لم يبلغ ما يخضب، لو شئت أن أعد شمطاته في لحيته‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 5896,
			"arabicnumber": 5896,
			"text": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن عثمان بن عبد الله بن موهب، قال أرسلني أهلي إلى أم سلمة بقدح من ماء ـ وقبض إسرائيل ثلاث أصابع ـ من فضة فيه شعر من شعر النبي صلى الله عليه وسلم وكان إذا أصاب الإنسان عين أو شىء بعث إليها مخضبه، فاطلعت في الجلجل فرأيت شعرات حمرا‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 5897,
			"arabicnumber": 5897,
			"text": "حدثنا موسى بن إسماعيل، حدثنا سلام، عن عثمان بن عبد الله بن موهب، قال دخلت على أم سلمة فأخرجت إلينا شعرا من شعر النبي صلى الله عليه وسلم مخضوبا‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 5898,
			"arabicnumber": 5898,
			"text": "وقال لنا أبو نعيم حدثنا نصير بن أبي الأشعث، عن ابن موهب، أن أم سلمة، أرته شعر النبي صلى الله عليه وسلم أحمر‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 5899,
			"arabicnumber": 5899,
			"text": "حدثنا الحميدي، حدثنا سفيان، حدثنا الزهري، عن أبي سلمة، وسليمان بن يسار، عن أبي هريرة ـ رضى الله عنه ـ قال النبي صلى الله عليه وسلم ‏ \"‏ إن اليهود والنصارى لا يصبغون فخالفوهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 5900,
			"arabicnumber": 5900,
			"text": "حدثنا إسماعيل، قال حدثني مالك بن أنس، عن ربيعة بن أبي عبد الرحمن، عن أنس بن مالك ـ رضى الله عنه ـ أنه سمعه يقول كان رسول الله صلى الله عليه وسلم ليس بالطويل البائن، ولا بالقصير، وليس بالأبيض الأمهق، وليس بالآدم، وليس بالجعد القطط، ولا بالسبط، بعثه الله على رأس أربعين سنة، فأقام بمكة عشر سنين، وبالمدينة عشر سنين، وتوفاه الله على رأس ستين سنة، وليس في رأسه ولحيته عشرون شعرة بيضاء‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 5901,
			"arabicnumber": 5901,
			"text": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن أبي إسحاق، سمعت البراء، يقول ما رأيت أحدا أحسن في حلة حمراء من النبي صلى الله عليه وسلم‏.‏ قال بعض أصحابي عن مالك إن جمته لتضرب قريبا من منكبيه‏.‏ قال أبو إسحاق سمعته يحدثه غير مرة، ما حدث به قط إلا ضحك‏.‏ تابعه شعبة شعره يبلغ شحمة أذنيه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 5902,
			"arabicnumber": 5902,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أراني الليلة عند الكعبة، فرأيت رجلا آدم كأحسن ما أنت راء من أدم الرجال، له لمة كأحسن ما أنت راء من اللمم، قد رجلها، فهى تقطر ماء متكئا على رجلين، أو على عواتق رجلين، يطوف بالبيت فسألت من هذا فقيل المسيح ابن مريم‏.‏ وإذا أنا برجل جعد، قطط، أعور العين اليمنى كأنها عنبة طافية، فسألت من هذا فقيل المسيح الدجال ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 5903,
			"arabicnumber": 5903,
			"text": "حدثنا إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس، أن النبي صلى الله عليه وسلم كان يضرب شعره منكبيه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 5904,
			"arabicnumber": 5904,
			"text": "حدثنا موسى بن إسماعيل، حدثنا همام، عن قتادة، عن أنس، كان يضرب شعر النبي صلى الله عليه وسلم منكبيه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 5905,
			"arabicnumber": 5905,
			"text": "حدثني عمرو بن علي، حدثنا وهب بن جرير، قال حدثني أبي، عن قتادة، قال سألت أنس بن مالك ـ رضى الله عنه ـ عن شعر، رسول الله صلى الله عليه وسلم فقال كان شعر رسول الله صلى الله عليه وسلم رجلا، ليس بالسبط، ولا الجعد، بين أذنيه وعاتقه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 5906,
			"arabicnumber": 5906,
			"text": "حدثنا مسلم، حدثنا جرير، عن قتادة، عن أنس، قال كان النبي صلى الله عليه وسلم ضخم اليدين، لم أر بعده مثله، وكان شعر النبي صلى الله عليه وسلم رجلا، لا جعد، ولا سبط‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 5907,
			"arabicnumber": 5907,
			"text": "حدثنا أبو النعمان، حدثنا جرير بن حازم، عن قتادة، عن أنس ـ رضى الله عنه ـ قال كان النبي صلى الله عليه وسلم ضخم اليدين والقدمين حسن الوجه، لم أر بعده ولا قبله مثله، وكان بسط الكفين‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 5909,
			"arabicnumber": 5909,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 5910,
			"arabicnumber": 5910,
			"text": "وقال هشام عن معمر، عن قتادة، عن أنس، كان النبي صلى الله عليه وسلم شثن القدمين والكفين‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 5912,
			"arabicnumber": 5912,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 5913,
			"arabicnumber": 5913,
			"text": "حدثنا محمد بن المثنى، قال حدثني ابن أبي عدي، عن ابن عون، عن مجاهد، قال كنا عند ابن عباس ـ رضى الله عنهما ـ فذكروا الدجال فقال إنه مكتوب بين عينيه كافر‏.‏ وقال ابن عباس لم أسمعه قال ذاك ولكنه قال ‏ \"‏ أما إبراهيم فانظروا إلى صاحبكم، وأما موسى فرجل آدم جعد، على جمل أحمر مخطوم بخلبة، كأني أنظر إليه إذ انحدر في الوادي يلبي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 5914,
			"arabicnumber": 5914,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني سالم بن عبد الله، أن عبد الله بن عمر، قال سمعت عمر ـ رضى الله عنه ـ يقول من ضفر فليحلق، ولا تشبهوا بالتلبيد‏.‏ وكان ابن عمر يقول لقد رأيت رسول الله صلى الله عليه وسلم ملبدا‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 5915,
			"arabicnumber": 5915,
			"text": "حدثني حبان بن موسى، وأحمد بن محمد، قالا أخبرنا عبد الله، أخبرنا يونس، عن الزهري، عن سالم، عن ابن عمر ـ رضى الله عنهما ـ قال سمعت رسول الله صلى الله عليه وسلم يهل ملبدا يقول ‏ \"‏ لبيك اللهم لبيك، لبيك لا شريك لك لبيك، إن الحمد والنعمة لك والملك لا شريك لك ‏\"‏‏.‏ لا يزيد على هؤلاء الكلمات‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 5916,
			"arabicnumber": 5916,
			"text": "حدثني إسماعيل، قال حدثني مالك، عن نافع، عن عبد الله بن عمر، عن حفصة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم قالت قلت يا رسول الله ما شأن الناس حلوا بعمرة، ولم تحلل أنت من عمرتك قال ‏ \"‏ إني لبدت رأسي، وقلدت هديي، فلا أحل حتى أنحر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 5917,
			"arabicnumber": 5917,
			"text": "حدثنا أحمد بن يونس، حدثنا إبراهيم بن سعد، حدثنا ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس ـ رضى الله عنهما ـ قال كان النبي صلى الله عليه وسلم يحب موافقة أهل الكتاب فيما لم يؤمر فيه، وكان أهل الكتاب يسدلون أشعارهم، وكان المشركون يفرقون رءوسهم، فسدل النبي صلى الله عليه وسلم ناصيته، ثم فرق بعد‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 5918,
			"arabicnumber": 5918,
			"text": "حدثنا أبو الوليد، وعبد الله بن رجاء، قالا حدثنا شعبة، عن الحكم، عن إبراهيم، عن الأسود، عن عائشة ـ رضى الله عنها ـ قالت كأني أنظر إلى وبيص الطيب في مفارق النبي صلى الله عليه وسلم وهو محرم‏.‏ قال عبد الله في مفرق النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 5919,
			"arabicnumber": 5919,
			"text": "حدثنا علي بن عبد الله، حدثنا الفضل بن عنبسة، أخبرنا هشيم، أخبرنا أبو بشر، ح وحدثنا قتيبة، حدثنا هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهما ـ قال بت ليلة عند ميمونة بنت الحارث خالتي، وكان رسول الله صلى الله عليه وسلم عندها في ليلتها ـ قال ـ فقام رسول الله صلى الله عليه وسلم يصلي من الليل، فقمت عن يساره ـ قال ـ فأخذ بذؤابتي فجعلني عن يمينه‏.‏ حدثنا عمرو بن محمد، حدثنا هشيم، أخبرنا أبو بشر، بهذا، وقال بذؤابتي أو برأسي‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 5920,
			"arabicnumber": 5920,
			"text": "حدثني محمد، قال أخبرني مخلد، قال أخبرني ابن جريج، قال أخبرني عبيد الله بن حفص، أن عمر بن نافع، أخبره عن نافع، مولى عبد الله أنه سمع ابن عمر ـ رضى الله عنهما ـ يقول سمعت رسول الله صلى الله عليه وسلم ينهى عن القزع‏.‏ قال عبيد الله قلت وما القزع فأشار لنا عبيد الله قال إذا حلق الصبي وترك ها هنا شعرة وها هنا وها هنا‏.‏ فأشار لنا عبيد الله إلى ناصيته وجانبى رأسه‏.‏ قيل لعبيد الله فالجارية والغلام قال لا أدري هكذا قال الصبي‏.‏ قال عبيد الله وعاودته فقال أما القصة والقفا للغلام فلا بأس بهما ولكن القزع أن يترك بناصيته شعر، وليس في رأسه غيره، وكذلك شق رأسه هذا وهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 5921,
			"arabicnumber": 5921,
			"text": "حدثنا مسلم بن إبراهيم، حدثنا عبد الله بن المثنى بن عبد الله بن أنس بن مالك، حدثنا عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن القزع‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 5922,
			"arabicnumber": 5922,
			"text": "حدثني أحمد بن محمد، أخبرنا عبد الله، أخبرنا يحيى بن سعيد، أخبرنا عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت طيبت النبي صلى الله عليه وسلم بيدي لحرمه، وطيبته بمنى قبل أن يفيض‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 5923,
			"arabicnumber": 5923,
			"text": "حدثنا إسحاق بن نصر، حدثنا يحيى بن آدم، حدثنا إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كنت أطيب النبي صلى الله عليه وسلم بأطيب ما يجد، حتى أجد وبيص الطيب في رأسه ولحيته‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 5924,
			"arabicnumber": 5924,
			"text": "حدثنا آدم بن أبي إياس، حدثنا ابن أبي ذئب، عن الزهري، عن سهل بن سعد، أن رجلا، اطلع من جحر في دار النبي صلى الله عليه وسلم والنبي صلى الله عليه وسلم يحك رأسه بالمدرى فقال ‏ \"‏ لو علمت أنك تنظر لطعنت بها في عينك، إنما جعل الإذن من قبل الأبصار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 5925,
			"arabicnumber": 5925,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عروة بن الزبير، عن عائشة ـ رضى الله عنها ـ قالت كنت أرجل رأس رسول الله صلى الله عليه وسلم وأنا حائض‏.‏ حدثنا عبد الله بن يوسف، أخبرنا مالك، عن هشام، عن أبيه، عن عائشة، مثله‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 5926,
			"arabicnumber": 5926,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن أشعث بن سليم، عن أبيه، عن مسروق، عن عائشة، عن النبي صلى الله عليه وسلم أنه كان يعجبه التيمن ما استطاع في ترجله ووضوئه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 5927,
			"arabicnumber": 5927,
			"text": "حدثني عبد الله بن محمد، حدثنا هشام، أخبرنا معمر، عن الزهري، عن ابن المسيب، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ كل عمل ابن آدم له، إلا الصوم فإنه لي، وأنا أجزي به، ولخلوف فم الصائم أطيب عند الله من ريح المسك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 5928,
			"arabicnumber": 5928,
			"text": "حدثنا موسى، حدثنا وهيب، حدثنا هشام، عن عثمان بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت كنت أطيب النبي صلى الله عليه وسلم عند إحرامه بأطيب ما أجد‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 5929,
			"arabicnumber": 5929,
			"text": "حدثنا أبو نعيم، حدثنا عزرة بن ثابت الأنصاري، قال حدثني ثمامة بن عبد الله، عن أنس ـ رضى الله عنه ـ أنه كان لا يرد الطيب، وزعم أن النبي صلى الله عليه وسلم كان لا يرد الطيب‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 5930,
			"arabicnumber": 5930,
			"text": "حدثنا عثمان بن الهيثم، أو محمد عنه عن ابن جريج، أخبرني عمر بن عبد الله بن عروة، سمع عروة، والقاسم، يخبران عن عائشة، قالت طيبت رسول الله صلى الله عليه وسلم بيدى بذريرة في حجة الوداع، للحل والإحرام‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 5931,
			"arabicnumber": 5931,
			"text": "حدثنا عثمان، حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، لعن الله الواشمات، والمستوشمات، والمتنمصات والمتفلجات للحسن، المغيرات خلق الله تعالى، مالي لا ألعن من لعن النبي صلى الله عليه وسلم وهو في كتاب الله ‏{‏وما آتاكم الرسول فخذوه‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 5932,
			"arabicnumber": 5932,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن حميد بن عبد الرحمن بن عوف، أنه سمع معاوية بن أبي سفيان، عام حج وهو على المنبر، وهو يقول ـ وتناول قصة من شعر كانت بيد حرسي ـ أين علماؤكم سمعت رسول الله صلى الله عليه وسلم ينهى عن مثل هذه ويقول ‏ \"‏ إنما هلكت بنو إسرائيل حين اتخذ هذه نساؤهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 5933,
			"arabicnumber": 5933,
			"text": "وقال ابن أبي شيبة حدثنا يونس بن محمد، حدثنا فليح، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ لعن الله الواصلة والمستوصلة، والواشمة والمستوشمة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 5934,
			"arabicnumber": 5934,
			"text": "حدثنا آدم، حدثنا شعبة، عن عمرو بن مرة، قال سمعت الحسن بن مسلم بن يناق، يحدث عن صفية بنت شيبة، عن عائشة ـ رضى الله عنها ـ أن جارية، من الأنصار تزوجت، وأنها مرضت فتمعط شعرها، فأرادوا أن يصلوها فسألوا النبي صلى الله عليه وسلم فقال ‏ \"‏ لعن الله الواصلة والمستوصلة ‏\"‏‏.‏ تابعه ابن إسحاق عن أبان بن صالح عن الحسن عن صفية عن عائشة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 5935,
			"arabicnumber": 5935,
			"text": "حدثني أحمد بن المقدام، حدثنا فضيل بن سليمان، حدثنا منصور بن عبد الرحمن، قال حدثتني أمي، عن أسماء بنت أبي بكر ـ رضى الله عنهما ـ أن امرأة، جاءت إلى رسول الله صلى الله عليه وسلم فقالت إني أنكحت ابنتي، ثم أصابها شكوى فتمرق رأسها، وزوجها يستحثني بها أفأصل رأسها فسب رسول الله صلى الله عليه وسلم الواصلة والمستوصلة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 5936,
			"arabicnumber": 5936,
			"text": "حدثنا آدم، حدثنا شعبة، عن هشام بن عروة، عن امرأته، فاطمة عن أسماء بنت أبي بكر، قالت لعن النبي صلى الله عليه وسلم الواصلة والمستوصلة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 5937,
			"arabicnumber": 5937,
			"text": "حدثني محمد بن مقاتل، أخبرنا عبد الله، أخبرنا عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لعن الله الواصلة والمستوصلة، والواشمة والمستوشمة ‏\"‏‏.‏ قال نافع الوشم في اللثة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 5938,
			"arabicnumber": 5938,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، سمعت سعيد بن المسيب، قال قدم معاوية المدينة آخر قدمة قدمها، فخطبنا فأخرج كبة من شعر قال ما كنت أرى أحدا يفعل هذا غير اليهود، إن النبي صلى الله عليه وسلم سماه الزور‏.‏ يعني الواصلة في الشعر‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 5939,
			"arabicnumber": 5939,
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن منصور، عن إبراهيم، عن علقمة، قال لعن عبد الله الواشمات، والمتنمصات، والمتفلجات للحسن، المغيرات خلق الله‏.‏ فقالت أم يعقوب ما هذا قال عبد الله وما لي لا ألعن من لعن رسول الله، وفي كتاب الله‏.‏ قالت والله لقد قرأت ما بين اللوحين فما وجدته‏.‏ قال والله لئن قرأتيه لقد وجدتيه ‏{‏وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 5940,
			"arabicnumber": 5940,
			"text": "حدثني محمد، حدثنا عبدة، عن عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال لعن النبي صلى الله عليه وسلم الواصلة والمستوصلة، والواشمة والمستوشمة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 5941,
			"arabicnumber": 5941,
			"text": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام، أنه سمع فاطمة بنت المنذر، تقول سمعت أسماء، قالت سألت امرأة النبي صلى الله عليه وسلم فقالت يا رسول الله إن ابنتي أصابتها الحصبة، فامرق شعرها، وإني زوجتها أفأصل فيه فقال ‏ \"‏ لعن الله الواصلة والموصولة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 5942,
			"arabicnumber": 5942,
			"text": "حدثني يوسف بن موسى، حدثنا الفضل بن دكين، حدثنا صخر بن جويرية، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ سمعت النبي صلى الله عليه وسلم أو قال النبي صلى الله عليه وسلم ‏ \"‏ الواشمة والموتشمة، والواصلة والمستوصلة ‏\"‏‏.‏ يعني لعن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 5943,
			"arabicnumber": 5943,
			"text": "حدثني محمد بن مقاتل، أخبرنا عبد الله، أخبرنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن ابن مسعود ـ رضى الله عنه ـ قال لعن الله الواشمات، والمستوشمات، والمتنمصات والمتفلجات للحسن، المغيرات خلق الله، ما لي لا ألعن من لعنه رسول الله صلى الله عليه وسلم وهو في كتاب الله‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 5944,
			"arabicnumber": 5944,
			"text": "حدثني يحيى، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ العين حق ‏\"‏‏.‏ ونهى عن الوشم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 5945,
			"arabicnumber": 5945,
			"text": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عون بن أبي جحيفة، قال رأيت أبي فقال إن النبي صلى الله عليه وسلم نهى عن ثمن الدم، وثمن الكلب، وآكل الربا وموكله، والواشمة والمستوشمة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 5946,
			"arabicnumber": 5946,
			"text": "حدثنا زهير بن حرب، حدثنا جرير، عن عمارة، عن أبي زرعة، عن أبي هريرة، قال أتي عمر بامرأة تشم فقام فقال أنشدكم بالله من سمع من النبي صلى الله عليه وسلم في الوشم فقال أبو هريرة فقمت فقلت يا أمير المؤمنين أنا سمعت‏.‏ قال ما سمعت قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ لا تشمن ولا تستوشمن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 5947,
			"arabicnumber": 5947,
			"text": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن عبيد الله، أخبرني نافع، عن ابن عمر، قال لعن النبي صلى الله عليه وسلم الواصلة والمستوصلة، والواشمة والمستوشمة‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 5948,
			"arabicnumber": 5948,
			"text": "حدثنا محمد بن المثنى، حدثنا عبد الرحمن، عن سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله ـ رضى الله عنه ـ لعن الله الواشمات والمستوشمات، والمتنمصات والمتفلجات للحسن، المغيرات خلق الله‏.‏ ما لي لا ألعن من لعن رسول الله صلى الله عليه وسلم وهو في كتاب الله‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 5949,
			"arabicnumber": 5949,
			"text": "حدثنا آدم، حدثنا ابن أبي ذئب، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، عن أبي طلحة ـ رضى الله عنهم ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ لا تدخل الملائكة بيتا فيه كلب ولا تصاوير ‏\"‏‏.‏ وقال الليث حدثني يونس، عن ابن شهاب، أخبرني عبيد الله، سمع ابن عباس، سمعت أبا طلحة، سمعت النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 5950,
			"arabicnumber": 5950,
			"text": "حدثنا الحميدي، حدثنا سفيان، حدثنا الأعمش، عن مسلم، قال كنا مع مسروق في دار يسار بن نمير، فرأى في صفته تماثيل فقال سمعت عبد الله قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ إن أشد الناس عذابا عند الله يوم القيامة المصورون ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 5951,
			"arabicnumber": 5951,
			"text": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن نافع، أن عبد الله بن عمر ـ رضى الله عنهما ـ أخبره أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الذين يصنعون هذه الصور يعذبون يوم القيامة يقال لهم أحيوا ما خلقتم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 5952,
			"arabicnumber": 5952,
			"text": "حدثنا معاذ بن فضالة، حدثنا هشام، عن يحيى، عن عمران بن حطان، أن عائشة ـ رضى الله عنها ـ حدثته أن النبي صلى الله عليه وسلم لم يكن يترك في بيته شيئا فيه تصاليب إلا نقضه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 5953,
			"arabicnumber": 5953,
			"text": "حدثنا موسى، حدثنا عبد الواحد، حدثنا عمارة، حدثنا أبو زرعة، قال دخلت مع أبي هريرة دارا بالمدينة فرأى أعلاها مصورا يصور، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ومن أظلم ممن ذهب يخلق كخلقي، فليخلقوا حبة، وليخلقوا ذرة ‏\"‏‏.‏ ثم دعا بتور من ماء فغسل يديه حتى بلغ إبطه فقلت يا أبا هريرة أشىء سمعته من رسول الله صلى الله عليه وسلم قال منتهى الحلية‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 5954,
			"arabicnumber": 5954,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال سمعت عبد الرحمن بن القاسم ـ وما بالمدينة يومئذ أفضل منه ـ قال سمعت أبي قال سمعت عائشة ـ رضى الله عنها ـ قدم رسول الله صلى الله عليه وسلم من سفر وقد سترت بقرام لي على سهوة لي فيها تماثيل، فلما رآه رسول الله صلى الله عليه وسلم هتكه وقال ‏ \"‏ أشد الناس عذابا يوم القيامة الذين يضاهون بخلق الله ‏\"‏‏.‏ قالت فجعلناه وسادة أو وسادتين‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 5955,
			"arabicnumber": 5955,
			"text": "حدثنا مسدد، حدثنا عبد الله بن داود، عن هشام، عن أبيه، عن عائشة، قالت قدم النبي صلى الله عليه وسلم من سفر، وعلقت درنوكا فيه تماثيل، فأمرني أن أنزعه، فنزعته‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 5956,
			"arabicnumber": 5956,
			"text": "وكنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 5957,
			"arabicnumber": 5957,
			"text": "حدثنا حجاج بن منهال، حدثنا جويرية، عن نافع، عن القاسم، عن عائشة ـ رضى الله عنها ـ أنها اشترت نمرقة فيها تصاوير، فقام النبي صلى الله عليه وسلم بالباب فلم يدخل‏.‏ فقلت أتوب إلى الله مما أذنبت‏.‏ قال ‏\"‏ ما هذه النمرقة ‏\"‏‏.‏ قلت لتجلس عليها وتوسدها‏.‏ قال ‏\"‏ إن أصحاب هذه الصور يعذبون يوم القيامة، يقال لهم أحيوا ما خلقتم‏.‏ وإن الملائكة لا تدخل بيتا فيه الصورة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 5958,
			"arabicnumber": 5958,
			"text": "حدثنا قتيبة، حدثنا الليث، عن بكير، عن بسر بن سعيد، عن زيد بن خالد، عن أبي طلحة، صاحب رسول الله صلى الله عليه وسلم قال إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الملائكة لا تدخل بيتا فيه الصورة ‏\"‏‏.‏ قال بسر ثم اشتكى زيد فعدناه، فإذا على بابه ستر فيه صورة فقلت لعبيد الله ربيب ميمونة زوج النبي صلى الله عليه وسلم ألم يخبرنا زيد عن الصور يوم الأول‏.‏ فقال عبيد الله ألم تسمعه حين قال إلا رقما في ثوب‏.‏ وقال ابن وهب أخبرنا عمرو ـ هو ابن الحارث ـ حدثه بكير، حدثه بسر، حدثه زيد، حدثه أبو طلحة، عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 5959,
			"arabicnumber": 5959,
			"text": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا عبد العزيز بن صهيب، عن أنس ـ رضى الله عنه ـ قال كان قرام لعائشة سترت به جانب بيتها، فقال لها النبي صلى الله عليه وسلم ‏ \"‏ أميطي عني، فإنه لا تزال تصاويره تعرض لي في صلاتي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 5960,
			"arabicnumber": 5960,
			"text": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر ـ هو ابن محمد ـ عن سالم، عن أبيه، قال وعد النبي صلى الله عليه وسلم جبريل فراث عليه حتى اشتد على النبي صلى الله عليه وسلم فخرج النبي صلى الله عليه وسلم فلقيه، فشكا إليه ما وجد، فقال له ‏ \"‏ إنا لا ندخل بيتا فيه صورة ولا كلب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 5961,
			"arabicnumber": 5961,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن نافع، عن القاسم بن محمد، عن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم أنها أخبرته أنها اشترت نمرقة فيها تصاوير، فلما رآها رسول الله صلى الله عليه وسلم قام على الباب فلم يدخل، فعرفت في وجهه الكراهية قالت يا رسول الله أتوب إلى الله وإلى رسوله، ماذا أذنبت قال ‏\"‏ ما بال هذه النمرقة ‏\"‏‏.‏ فقالت اشتريتها لتقعد عليها وتوسدها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن أصحاب هذه الصور يعذبون يوم القيامة، ويقال لهم أحيوا ما خلقتم ـ وقال ـ إن البيت الذي فيه الصور لا تدخله الملائكة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 5962,
			"arabicnumber": 5962,
			"text": "حدثنا محمد بن المثنى، قال حدثني غندر، حدثنا شعبة، عن عون بن أبي جحيفة، عن أبيه، أنه اشترى غلاما حجاما فقال إن النبي صلى الله عليه وسلم نهى عن ثمن الدم، وثمن الكلب، وكسب البغي، ولعن آكل الربا وموكله والواشمة والمستوشمة والمصور‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 5963,
			"arabicnumber": 5963,
			"text": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا سعيد، قال سمعت النضر بن أنس بن مالك، يحدث قتادة قال كنت عند ابن عباس وهم يسألونه ولا يذكر النبي صلى الله عليه وسلم حتى سئل فقال سمعت محمدا صلى الله عليه وسلم يقول ‏ \"‏ من صور صورة في الدنيا كلف يوم القيامة أن ينفخ فيها الروح، وليس بنافخ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 5964,
			"arabicnumber": 5964,
			"text": "حدثنا قتيبة، حدثنا أبو صفوان، عن يونس بن يزيد، عن ابن شهاب، عن عروة، عن أسامة بن زيد ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم ركب على حمار، على إكاف عليه قطيفة فدكية، وأردف أسامة وراءه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 5965,
			"arabicnumber": 5965,
			"text": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا خالد، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال لما قدم النبي صلى الله عليه وسلم مكة استقبله أغيلمة بني عبد المطلب، فحمل واحدا بين يديه والآخر خلفه‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 5966,
			"arabicnumber": 5966,
			"text": "حدثني محمد بن بشار، حدثنا عبد الوهاب، حدثنا أيوب، ذكر الأشر الثلاثة عند عكرمة فقال قال ابن عباس أتى رسول الله صلى الله عليه وسلم وقد حمل قثم بين يديه، والفضل خلفه، أو قثم خلفه، والفضل بين يديه، فأيهم شر أو أيهم خير‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 5967,
			"arabicnumber": 5967,
			"text": "حدثنا هدبة بن خالد، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، عن معاذ بن جبل ـ رضى الله عنه ـ قال بينا أنا رديف النبي، صلى الله عليه وسلم ليس بيني وبينه إلا أخرة الرحل فقال ‏\"‏ يا معاذ ‏\"‏‏.‏ قلت لبيك رسول الله وسعديك‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ ‏\"‏‏.‏ قلت لبيك رسول الله وسعديك‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ ‏\"‏‏.‏ قلت لبيك رسول الله وسعديك‏.‏ قال ‏\"‏ هل تدري ما حق الله على عباده ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ حق الله على عباده أن يعبدوه ولا يشركوا به شيئا ‏\"‏‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ بن جبل ‏\"‏‏.‏ قلت لبيك رسول الله وسعديك‏.‏ فقال ‏\"‏ هل تدري ما حق العباد على الله إذا فعلوه ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ حق العباد على الله أن لا يعذبهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 5968,
			"arabicnumber": 5968,
			"text": "حدثنا الحسن بن محمد بن صباح، حدثنا يحيى بن عباد، حدثنا شعبة، أخبرني يحيى بن أبي إسحاق، قال سمعت أنس بن مالك ـ رضى الله عنه ـ قال أقبلنا مع رسول الله صلى الله عليه وسلم من خيبر، وإني لرديف أبي طلحة وهو يسير وبعض نساء رسول الله صلى الله عليه وسلم رديف رسول الله صلى الله عليه وسلم إذ عثرت الناقة فقلت المرأة‏.‏ فنزلت‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها أمكم ‏\"‏‏.‏ فشددت الرحل وركب رسول الله صلى الله عليه وسلم فلما دنا أو رأى المدينة قال ‏\"‏ آيبون تائبون، عابدون لربنا، حامدون ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 5969,
			"arabicnumber": 5969,
			"text": "حدثنا أحمد بن يونس، حدثنا إبراهيم بن سعد، حدثنا ابن شهاب، عن عباد بن تميم، عن عمه، أنه أبصر النبي صلى الله عليه وسلم يضطجع في المسجد، رافعا إحدى رجليه على الأخرى‏.‏",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 185
			}
		}
	]
}