{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5970,
			"arabicnumber": 5970,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، قال الوليد بن عيزار أخبرني قال سمعت أبا عمرو الشيباني، يقول أخبرنا صاحب، هذه الدار ـ وأومأ بيده إلى دار عبد الله ـ قال سألت النبي صلى الله عليه وسلم أى العمل أحب إلى الله قال ‏\"‏ الصلاة على وقتها ‏\"‏‏.‏ قال ثم أى قال ‏\"‏ ثم بر الوالدين ‏\"‏‏.‏ قال ثم أى قال ‏\"‏ الجهاد في سبيل الله ‏\"‏‏.‏ قال حدثني بهن ولو استزدته لزادني‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5971,
			"arabicnumber": 5971,
			"text": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عمارة بن القعقاع بن شبرمة، عن أبي زرعة، عن أبي هريرة ـ رضى الله عنه ـ قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله من أحق بحسن صحابتي قال ‏\"‏ أمك ‏\"‏‏.‏ قال ثم من قال ‏\"‏ أمك ‏\"‏‏.‏ قال ثم من قال ‏\"‏ أمك ‏\"‏‏.‏ قال ثم من قال ‏\"‏ ثم أبوك ‏\"‏‏.‏ وقال ابن شبرمة ويحيى بن أيوب حدثنا أبو زرعة مثله‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5972,
			"arabicnumber": 5972,
			"text": "حدثنا مسدد، حدثنا يحيى، عن سفيان، وشعبة، قالا حدثنا حبيب، ح قال وحدثنا محمد بن كثير، أخبرنا سفيان، عن حبيب، عن أبي العباس، عن عبد الله بن عمرو، قال قال رجل للنبي صلى الله عليه وسلم أجاهد‏.‏ قال ‏\"‏ لك أبوان ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ ففيهما فجاهد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5973,
			"arabicnumber": 5973,
			"text": "حدثنا أحمد بن يونس، حدثنا إبراهيم بن سعد، عن أبيه، عن حميد بن عبد الرحمن، عن عبد الله بن عمرو ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أكبر الكبائر أن يلعن الرجل والديه ‏\"‏‏.‏ قيل يا رسول الله وكيف يلعن الرجل والديه قال ‏\"‏ يسب الرجل أبا الرجل، فيسب أباه، ويسب أمه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5974,
			"arabicnumber": 5974,
			"text": "حدثنا سعيد بن أبي مريم، حدثنا إسماعيل بن إبراهيم بن عقبة، قال أخبرني نافع، عن ابن عمر ـ رضى الله عنهما ـ عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ بينما ثلاثة نفر يتماشون أخذهم المطر، فمالوا إلى غار في الجبل، فانحطت على فم غارهم صخرة من الجبل، فأطبقت عليهم، فقال بعضهم لبعض انظروا أعمالا عملتموها لله صالحة، فادعوا الله بها لعله يفرجها‏.‏ فقال أحدهم اللهم إنه كان لي والدان شيخان كبيران، ولي صبية صغار كنت أرعى عليهم، فإذا رحت عليهم فحلبت بدأت بوالدى أسقيهما قبل ولدي، وإنه ناء بي الشجر فما أتيت حتى أمسيت، فوجدتهما قد ناما، فحلبت كما كنت أحلب، فجئت بالحلاب فقمت عند رءوسهما، أكره أن أوقظهما من نومهما، وأكره أن أبدأ بالصبية قبلهما، والصبية يتضاغون عند قدمى، فلم يزل ذلك دأبي ودأبهم حتى طلع الفجر، فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك، فافرج لنا فرجة نرى منها السماء، ففرج الله لهم فرجة حتى يرون منها السماء‏.‏ وقال الثاني اللهم إنه كانت لي ابنة عم، أحبها كأشد ما يحب الرجال النساء، فطلبت إليها نفسها، فأبت حتى آتيها بمائة دينار، فسعيت حتى جمعت مائة دينار، فلقيتها بها، فلما قعدت بين رجليها قالت يا عبد الله اتق الله، ولا تفتح الخاتم‏.‏ فقمت عنها، اللهم فإن كنت تعلم أني قد فعلت ذلك ابتغاء وجهك فافرج لنا منها ففرج لهم فرجة‏.‏ وقال الآخر اللهم إني كنت استأجرت أجيرا بفرق أرز فلما قضى عمله قال أعطني حقي‏.‏ فعرضت عليه حقه، فتركه ورغب عنه، فلم أزل أزرعه حتى جمعت منه بقرا وراعيها، فجاءني فقال اتق الله ولا تظلمني، وأعطني حقي‏.‏ فقلت اذهب إلى ذلك البقر وراعيها‏.‏ فقال اتق الله ولا تهزأ بي‏.‏ فقلت إني لا أهزأ بك، فخذ ذلك البقر وراعيها‏.‏ فأخذه فانطلق بها، فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك، فافرج ما بقي، ففرج الله عنهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5975,
			"arabicnumber": 5975,
			"text": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن المسيب، عن وراد، عن المغيرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الله حرم عليكم عقوق الأمهات، ومنع وهات، ووأد البنات، وكره لكم قيل وقال، وكثرة السؤال، وإضاعة المال ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5976,
			"arabicnumber": 5976,
			"text": "حدثني إسحاق، حدثنا خالد الواسطي، عن الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أنبئكم بأكبر الكبائر ‏\"‏‏.‏ قلنا بلى يا رسول الله‏.‏ قال ‏\"‏ الإشراك بالله، وعقوق الوالدين ‏\"‏‏.‏ وكان متكئا فجلس فقال ‏\"‏ ألا وقول الزور وشهادة الزور، ألا وقول الزور وشهادة الزور ‏\"‏‏.‏ فما زال يقولها حتى قلت لا يسكت‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5977,
			"arabicnumber": 5977,
			"text": "حدثني محمد بن الوليد، حدثنا محمد بن جعفر، حدثنا شعبة، قال حدثني عبيد الله بن أبي بكر، قال سمعت أنس بن مالك ـ رضى الله عنه ـ قال ذكر رسول الله صلى الله عليه وسلم الكبائر، أو سئل عن الكبائر فقال ‏\"‏ الشرك بالله، وقتل النفس، وعقوق الوالدين ‏\"‏‏.‏ فقال ‏\"‏ ألا أنبئكم بأكبر الكبائر ـ قال ـ قول الزور ـ أو قال ـ شهادة الزور ‏\"‏‏.‏ قال شعبة وأكثر ظني أنه قال ‏\"‏ شهادة الزور ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5978,
			"arabicnumber": 5978,
			"text": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام بن عروة، أخبرني أبي، أخبرتني أسماء ابنة أبي بكر ـ رضى الله عنهما ـ قالت أتتني أمي راغبة في عهد النبي صلى الله عليه وسلم فسألت النبي صلى الله عليه وسلم آصلها قال ‏\"‏ نعم ‏\"‏‏.‏ قال ابن عيينة فأنزل الله تعالى فيها ‏{‏لا ينهاكم الله عن الذين لم يقاتلوكم في الدين‏}‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5979,
			"arabicnumber": 5979,
			"text": "وقال الليث حدثني هشام، عن عروة، عن أسماء، قالت قدمت أمي وهى مشركة في عهد قريش ومدتهم، إذ عاهدوا النبي صلى الله عليه وسلم مع أبيها، فاستفتيت النبي صلى الله عليه وسلم فقلت إن أمي قدمت وهى راغبة ‏{‏أفأصلها‏}‏ قال ‏ \"‏ نعم صلي أمك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5980,
			"arabicnumber": 5980,
			"text": "حدثنا يحيى، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عبيد الله بن عبد الله، أن عبد الله بن عباس، أخبره أن أبا سفيان أخبره أن هرقل أرسل إليه فقال يعني النبي صلى الله عليه وسلم يأمرنا بالصلاة والصدقة والعفاف والصلة‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5981,
			"arabicnumber": 5981,
			"text": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، قال سمعت ابن عمر ـ رضى الله عنهما ـ يقول رأى عمر حلة سيراء تباع فقال يا رسول الله ابتع هذه، والبسها يوم الجمعة، وإذا جاءك الوفود‏.‏ قال ‏\"‏ إنما يلبس هذه من لا خلاق له ‏\"‏‏.‏ فأتي النبي صلى الله عليه وسلم منها بحلل، فأرسل إلى عمر بحلة فقال كيف ألبسها وقد قلت فيها ما قلت قال ‏\"‏ إني لم أعطكها لتلبسها، ولكن تبيعها أو تكسوها ‏\"‏‏.‏ فأرسل بها عمر إلى أخ له من أهل مكة قبل أن يسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5982,
			"arabicnumber": 5982,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، قال أخبرني ابن عثمان، قال سمعت موسى بن طلحة، عن أبي أيوب، قال قيل يا رسول الله، أخبرني بعمل، يدخلني الجنة‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5983,
			"arabicnumber": 5983,
			"text": "حدثني عبد الرحمن، حدثنا بهز، حدثنا شعبة، حدثنا ابن عثمان بن عبد الله بن موهب، وأبوه، عثمان بن عبد الله أنهما سمعا موسى بن طلحة، عن أبي أيوب الأنصاري ـ رضى الله عنه أن رجلا قال يا رسول الله أخبرني بعمل يدخلني الجنة‏.‏ فقال القوم ماله ماله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرب ماله ‏\"‏‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ تعبد الله لا تشرك به شيئا، وتقيم الصلاة، وتؤتي الزكاة، وتصل الرحم، ذرها ‏\"‏‏.‏ قال كأنه كان على راحلته‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5984,
			"arabicnumber": 5984,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، أن محمد بن جبير بن مطعم، قال إن جبير بن مطعم أخبره أنه، سمع النبي صلى الله عليه وسلم يقول ‏ \"‏ لا يدخل الجنة قاطع ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5985,
			"arabicnumber": 5985,
			"text": "حدثني إبراهيم بن المنذر، حدثنا محمد بن معن، قال حدثني أبي، عن سعيد بن أبي سعيد، عن أبي هريرة ـ رضى الله عنه ـ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من سره أن يبسط له في رزقه، وأن ينسأ له في أثره، فليصل رحمه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5986,
			"arabicnumber": 5986,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أحب أن يبسط له في رزقه، وينسأ له في أثره، فليصل رحمه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5987,
			"arabicnumber": 5987,
			"text": "حدثني بشر بن محمد، أخبرنا عبد الله، أخبرنا معاوية بن أبي مزرد، قال سمعت عمي، سعيد بن يسار يحدث عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله خلق الخلق حتى إذا فرغ من خلقه، قالت الرحم هذا مقام العائذ بك من القطيعة‏.‏ قال نعم أما ترضين أن أصل من وصلك‏.‏ وأقطع من قطعك‏.‏ قالت بلى يا رب‏.‏ قال فهو لك ‏\"‏‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فاقرءوا إن شئتم ‏{‏فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم‏}‏‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5988,
			"arabicnumber": 5988,
			"text": "حدثنا خالد بن مخلد، حدثنا سليمان، حدثنا عبد الله بن دينار، عن أبي صالح، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الرحم سجنة من الرحمن، فقال الله من وصلك وصلته، ومن قطعك قطعته ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5989,
			"arabicnumber": 5989,
			"text": "حدثنا سعيد بن أبي مريم، حدثنا سليمان بن بلال، قال أخبرني معاوية بن أبي مزرد، عن يزيد بن رومان، عن عروة، عن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال ‏ \"‏ الرحم شجنة، فمن وصلها وصلته، ومن قطعها قطعته ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5990,
			"arabicnumber": 5990,
			"text": "حدثنا عمرو بن عباس، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، أن عمرو بن العاص، قال سمعت النبي صلى الله عليه وسلم جهارا غير سر يقول ‏\"‏ إن آل أبي ‏\"‏ ـ قال عمرو في كتاب محمد بن جعفر بياض ـ ليسوا بأوليائي، إنما وليي الله وصالح المؤمنين‏.‏ زاد عنبسة بن عبد الواحد عن بيان عن قيس عن عمرو بن العاص قال سمعت النبي صلى الله عليه وسلم ‏\"‏ ولكن لهم رحم أبلها ببلالها ‏\"‏‏.‏ يعني أصلها بصلتها‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5991,
			"arabicnumber": 5991,
			"text": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، والحسن بن عمرو، وفطر، عن مجاهد، عن عبد الله بن عمرو ـ وقال سفيان لم يرفعه الأعمش إلى النبي صلى الله عليه وسلم ورفعه حسن وفطر ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس الواصل بالمكافئ، ولكن الواصل الذي إذا قطعت رحمه وصلها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5992,
			"arabicnumber": 5992,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني عروة بن الزبير، أن حكيم بن حزام، أخبره أنه، قال يا رسول الله أرأيت أمورا كنت أتحنث بها في الجاهلية من صلة وعتاقة وصدقة، هل لي فيها من أجر‏.‏ قال حكيم قال رسول الله صلى الله عليه وسلم ‏ \"‏ أسلمت على ما سلف من خير ‏\"‏‏.‏ ويقال أيضا عن أبي اليمان أتحنث‏.‏ وقال معمر وصالح وابن المسافر أتحنث‏.‏ وقال ابن إسحاق التحنث التبرر، وتابعهم هشام عن أبيه‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5993,
			"arabicnumber": 5993,
			"text": "حدثنا حبان، أخبرنا عبد الله، عن خالد بن سعيد، عن أبيه، عن أم خالد بنت خالد بن سعيد، قالت أتيت رسول الله صلى الله عليه وسلم مع أبي وعلى قميص أصفر، قال رسول الله صلى الله عليه وسلم ‏\"‏ سنه سنه ‏\"‏‏.‏ قال عبد الله وهى بالحبشية حسنة‏.‏ قالت فذهبت ألعب بخاتم النبوة، فزجرني أبي‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ دعها ‏\"‏‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ أبلي وأخلقي، ثم أبلي وأخلقي، ثم أبلي وأخلقي ‏\"‏‏.‏ قال عبد الله فبقيت حتى ذكر‏.‏ يعني من بقائها‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5994,
			"arabicnumber": 5994,
			"text": "حدثنا موسى بن إسماعيل، حدثنا مهدي، حدثنا ابن أبي يعقوب، عن ابن أبي نعم، قال كنت شاهدا لابن عمر وسأله رجل عن دم البعوض‏.‏ فقال ممن أنت فقال من أهل العراق‏.‏ قال انظروا إلى هذا، يسألني عن دم البعوض وقد قتلوا ابن النبي صلى الله عليه وسلم وسمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ هما ريحانتاى من الدنيا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5995,
			"arabicnumber": 5995,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني عبد الله بن أبي بكر، أن عروة بن الزبير، أخبره أن عائشة زوج النبي صلى الله عليه وسلم حدثته قالت جاءتني امرأة معها ابنتان تسألني، فلم تجد عندي غير تمرة واحدة، فأعطيتها، فقسمتها بين ابنتيها، ثم قامت فخرجت، فدخل النبي صلى الله عليه وسلم فحدثته فقال ‏ \"‏ من يلي من هذه البنات شيئا فأحسن إليهن كن له سترا من النار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5996,
			"arabicnumber": 5996,
			"text": "حدثنا أبو الوليد، حدثنا الليث، حدثنا سعيد المقبري، حدثنا عمرو بن سليم، حدثنا أبو قتادة، قال خرج علينا النبي صلى الله عليه وسلم وأمامة بنت أبي العاص على عاتقه، فصلى فإذا ركع وضعها، وإذا رفع رفعها‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5997,
			"arabicnumber": 5997,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثنا أبو سلمة بن عبد الرحمن، أن أبا هريرة ـ رضى الله عنه ـ قال قبل رسول الله صلى الله عليه وسلم الحسن بن علي وعنده الأقرع بن حابس التميمي جالسا‏.‏ فقال الأقرع إن لي عشرة من الولد ما قبلت منهم أحدا‏.‏ فنظر إليه رسول الله صلى الله عليه وسلم ثم قال ‏ \"‏ من لا يرحم لا يرحم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5998,
			"arabicnumber": 5998,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن هشام، عن عروة، عن عائشة ـ رضى الله عنها ـ قالت جاء أعرابي إلى النبي صلى الله عليه وسلم فقال تقبلون الصبيان فما نقبلهم‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ أو أملك لك أن نزع الله من قلبك الرحمة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5999,
			"arabicnumber": 5999,
			"text": "حدثنا ابن أبي مريم، حدثنا أبو غسان، قال حدثني زيد بن أسلم، عن أبيه، عن عمر بن الخطاب ـ رضى الله عنه ـ قدم على النبي صلى الله عليه وسلم سبى، فإذا امرأة من السبى قد تحلب ثديها تسقي، إذا وجدت صبيا في السبى أخذته فألصقته ببطنها وأرضعته، فقال لنا النبي صلى الله عليه وسلم ‏\"‏ أترون هذه طارحة ولدها في النار ‏\"‏‏.‏ قلنا لا وهى تقدر على أن لا تطرحه‏.‏ فقال ‏\"‏ الله أرحم بعباده من هذه بولدها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6000,
			"arabicnumber": 6000,
			"text": "حدثنا الحكم بن نافع، أخبرنا شعيب، عن الزهري، أخبرنا سعيد بن المسيب، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ جعل الله الرحمة مائة جزء، فأمسك عنده تسعة وتسعين جزءا، وأنزل في الأرض جزءا واحدا، فمن ذلك الجزء يتراحم الخلق، حتى ترفع الفرس حافرها عن ولدها خشية أن تصيبه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6001,
			"arabicnumber": 6001,
			"text": "حدثنا محمد بن كثير، أخبرنا سفيان، عن منصور، عن أبي وائل، عن عمرو بن شرحبيل، عن عبد الله، قال قلت يا رسول الله أى الذنب أعظم قال ‏\"‏ أن تجعل لله ندا وهو خلقك ‏\"‏‏.‏ ثم قال أى قال ‏\"‏ أن تقتل ولدك خشية أن يأكل معك ‏\"‏‏.‏ قال ثم أى قال ‏\"‏ أن تزاني حليلة جارك ‏\"‏‏.‏ وأنزل الله تصديق قول النبي صلى الله عليه وسلم ‏{‏والذين لا يدعون مع الله إلها آخر‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6002,
			"arabicnumber": 6002,
			"text": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، عن هشام، قال أخبرني أبي، عن عائشة، أن النبي صلى الله عليه وسلم وضع صبيا في حجره يحنكه، فبال عليه، فدعا بماء فأتبعه‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6003,
			"arabicnumber": 6003,
			"text": "حدثنا عبد الله بن محمد، حدثنا عارم، حدثنا المعتمر بن سليمان، يحدث عن أبيه، قال سمعت أبا تميمة، يحدث عن أبي عثمان النهدي، يحدثه أبو عثمان عن أسامة بن زيد ـ رضى الله عنهما كان رسول الله صلى الله عليه وسلم يأخذني فيقعدني على فخذه، ويقعد الحسن على فخذه الأخرى، ثم يضمهما ثم يقول ‏ \"‏ اللهم ارحمهما فإني أرحمهما ‏\"‏‏.‏ وعن علي، قال حدثنا يحيى، حدثنا سليمان، عن أبي عثمان، قال التيمي فوقع في قلبي منه شىء، قلت حدثت به كذا وكذا، فلم أسمعه من أبي عثمان، فنظرت فوجدته عندي مكتوبا فيما سمعت‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6004,
			"arabicnumber": 6004,
			"text": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت ما غرت على امرأة ما غرت على خديجة، ولقد هلكت قبل أن يتزوجني بثلاث سنين، لما كنت أسمعه يذكرها، ولقد أمره ربه أن يبشرها ببيت في الجنة من قصب، وإن كان ليذبح الشاة ثم يهدي في خلتها منها‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6005,
			"arabicnumber": 6005,
			"text": "حدثنا عبد الله بن عبد الوهاب، قال حدثني عبد العزيز بن أبي حازم، قال حدثني أبي قال، سمعت سهل بن سعد، عن النبي صلى الله عليه وسلم قال ‏ \"‏ أنا وكافل اليتيم، في الجنة هكذا ‏\"‏‏.‏ وقال بإصبعيه السبابة والوسطى‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6006,
			"arabicnumber": 6006,
			"text": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن صفوان بن سليم، يرفعه إلى النبي صلى الله عليه وسلم قال ‏ \"‏ الساعي على الأرملة والمسكين كالمجاهد في سبيل الله، أو كالذي يصوم النهار ويقوم الليل ‏\"‏‏.‏ حدثنا إسماعيل، قال حدثني مالك، عن ثور بن زيد الديلي، عن أبي الغيث، مولى ابن مطيع عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6007,
			"arabicnumber": 6007,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الساعي على الأرملة والمسكين كالمجاهد في سبيل الله ـ وأحسبه قال، يشك القعنبي ـ كالقائم لا يفتر، وكالصائم لا يفطر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6008,
			"arabicnumber": 6008,
			"text": "حدثنا مسدد، حدثنا إسماعيل، حدثنا أيوب، عن أبي قلابة، عن أبي سليمان، مالك بن الحويرث قال أتينا النبي صلى الله عليه وسلم ونحن شببة متقاربون، فأقمنا عنده عشرين ليلة، فظن أنا اشتقنا أهلنا، وسألنا عمن تركنا في أهلنا، فأخبرناه، وكان رفيقا رحيما فقال ‏ \"‏ ارجعوا إلى أهليكم فعلموهم ومروهم، وصلوا كما رأيتموني أصلي، وإذا حضرت الصلاة فليؤذن لكم أحدكم، ثم ليؤمكم أكبركم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6009,
			"arabicnumber": 6009,
			"text": "حدثنا إسماعيل، حدثني مالك، عن سمى، مولى أبي بكر عن أبي صالح السمان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينما رجل يمشي بطريق اشتد عليه العطش، فوجد بئرا فنزل فيها فشرب ثم خرج، فإذا كلب يلهث يأكل الثرى من العطش فقال الرجل لقد بلغ هذا الكلب من العطش مثل الذي كان بلغ بي، فنزل البئر فملأ خفه، ثم أمسكه بفيه، فسقى الكلب، فشكر الله له فغفر له ‏\"‏‏.‏ قالوا يا رسول الله وإن لنا في البهائم أجرا‏.‏ فقال ‏\"‏ في كل ذات كبد رطبة أجر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6010,
			"arabicnumber": 6010,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني أبو سلمة بن عبد الرحمن، أن أبا هريرة، قال قام رسول الله صلى الله عليه وسلم في صلاة وقمنا معه، فقال أعرابي وهو في الصلاة اللهم ارحمني ومحمدا، ولا ترحم معنا أحدا‏.‏ فلما سلم النبي صلى الله عليه وسلم قال للأعرابي ‏ \"‏ لقد حجرت واسعا ‏\"‏‏.‏ يريد رحمة الله‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6011,
			"arabicnumber": 6011,
			"text": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، قال سمعته يقول سمعت النعمان بن بشير، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ ترى المؤمنين في تراحمهم وتوادهم وتعاطفهم كمثل الجسد إذا اشتكى عضوا تداعى له سائر جسده بالسهر والحمى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6012,
			"arabicnumber": 6012,
			"text": "حدثنا أبو الوليد، حدثنا أبو عوانة، عن قتادة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما من مسلم غرس غرسا فأكل منه إنسان أو دابة إلا كان له صدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6013,
			"arabicnumber": 6013,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني زيد بن وهب، قال سمعت جرير بن عبد الله، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من لا يرحم لا يرحم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6014,
			"arabicnumber": 6014,
			"text": "حدثنا إسماعيل بن أبي أويس، قال حدثني مالك، عن يحيى بن سعيد، قال أخبرني أبو بكر بن محمد، عن عمرة، عن عائشة ـ رضى الله عنها ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما زال يوصيني جبريل بالجار حتى ظننت أنه سيورثه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6015,
			"arabicnumber": 6015,
			"text": "حدثنا محمد بن منهال، حدثنا يزيد بن زريع، حدثنا عمر بن محمد، عن أبيه، عن ابن عمر ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6016,
			"arabicnumber": 6016,
			"text": "حدثنا عاصم بن علي، حدثنا ابن أبي ذئب، عن سعيد، عن أبي شريح، أن النبي صلى الله عليه وسلم قال ‏\"‏ والله لا يؤمن، والله لا يؤمن، والله لا يؤمن ‏\"‏‏.‏ قيل ومن يا رسول الله قال ‏\"‏ الذي لا يأمن جاره بوايقه ‏\"‏‏.‏ تابعه شبابة وأسد بن موسى‏.‏ وقال حميد بن الأسود وعثمان بن عمر وأبو بكر بن عياش وشعيب بن إسحاق عن ابن أبي ذئب، عن المقبري، عن أبي هريرة،‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6017,
			"arabicnumber": 6017,
			"text": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثنا سعيد ـ هو المقبري ـ عن أبيه، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم يقول ‏ \"‏ يا نساء المسلمات لا تحقرن جارة لجارتها ولو فرسن شاة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6018,
			"arabicnumber": 6018,
			"text": "حدثنا قتيبة بن سعيد، حدثنا أبو الأحوص، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذ جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه، ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6019,
			"arabicnumber": 6019,
			"text": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني سعيد المقبري، عن أبي شريح العدوي، قال سمعت أذناى، وأبصرت، عيناى حين تكلم النبي صلى الله عليه وسلم فقال ‏\"‏ من كان يؤمن بالله واليوم الآخر فليكرم جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه جائزته ‏\"‏‏.‏ قال وما جائزته يا رسول الله قال ‏\"‏ يوم وليلة والضيافة ثلاثة أيام، فما كان وراء ذلك فهو صدقة عليه، ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6020,
			"arabicnumber": 6020,
			"text": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني أبو عمران، قال سمعت طلحة، عن عائشة، قالت قلت يا رسول الله إن لي جارين فإلى أيهما أهدي قال ‏ \"‏ إلى أقربهما منك بابا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6021,
			"arabicnumber": 6021,
			"text": "حدثنا علي بن عياش، حدثنا أبو غسان، قال حدثني محمد بن المنكدر، عن جابر بن عبد الله ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ كل معروف صدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6022,
			"arabicnumber": 6022,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا سعيد بن أبي بردة بن أبي موسى الأشعري، عن أبيه، عن جده، قال قال النبي صلى الله عليه وسلم ‏\"‏ على كل مسلم صدقة ‏\"‏‏.‏ قالوا فإن لم يجد قال ‏\"‏ فيعمل بيديه فينفع نفسه ويتصدق ‏\"‏‏.‏ قالوا فإن لم يستطع أو لم يفعل قال ‏\"‏ فيعين ذا الحاجة الملهوف ‏\"‏‏.‏ قالوا فإن لم يفعل قال ‏\"‏ فيأمر بالخير ‏\"‏‏.‏ أو قال ‏\"‏ بالمعروف ‏\"‏‏.‏ قال فإن لم يفعل قال ‏\"‏ فيمسك عن الشر، فإنه له صدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6023,
			"arabicnumber": 6023,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، قال أخبرني عمرو، عن خيثمة، عن عدي بن حاتم، قال ذكر النبي صلى الله عليه وسلم النار، فتعوذ منها وأشاح بوجهه، ثم ذكر النار، فتعوذ منها، وأشاح بوجهه ـ قال شعبة أما مرتين فلا أشك ـ ثم قال ‏ \"‏ اتقوا النار ولو بشق تمرة، فإن لم تجد فبكلمة طيبة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6024,
			"arabicnumber": 6024,
			"text": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، عن عروة بن الزبير، أن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم قالت دخل رهط من اليهود على رسول الله صلى الله عليه وسلم فقالوا السام عليكم‏.‏ قالت عائشة ففهمتها فقلت وعليكم السام واللعنة‏.‏ قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ مهلا يا عائشة، إن الله يحب الرفق في الأمر كله ‏\"‏‏.‏ فقلت يا رسول الله ولم تسمع ما قالوا قال رسول الله صلى الله عليه وسلم ‏\"‏ قد قلت وعليكم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6025,
			"arabicnumber": 6025,
			"text": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد بن زيد، عن ثابت، عن أنس بن مالك، أن أعرابيا، بال في المسجد، فقاموا إليه، فقال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تزرموه ‏\"‏‏.‏ ثم دعا بدلو من ماء فصب عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6027,
			"arabicnumber": 6027,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6028,
			"arabicnumber": 6028,
			"text": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم أنه كان إذا أتاه السائل أو صاحب الحاجة قال ‏ \"‏ اشفعوا فلتؤجروا، وليقض الله على لسان رسوله ما شاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6029,
			"arabicnumber": 6029,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، عن سليمان، سمعت أبا وائل، سمعت مسروقا، قال قال عبد الله بن عمرو‏.‏ حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن شقيق بن سلمة، عن مسروق، قال دخلنا على عبد الله بن عمرو حين قدم مع معاوية إلى الكوفة فذكر رسول الله صلى الله عليه وسلم فقال لم يكن فاحشا ولا متفحشا، وقال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن من أخيركم أحسنكم خلقا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6030,
			"arabicnumber": 6030,
			"text": "حدثنا محمد بن سلام، أخبرنا عبد الوهاب، عن أيوب، عن عبد الله بن أبي مليكة، عن عائشة ـ رضى الله عنها أن يهود، أتوا النبي صلى الله عليه وسلم فقالوا السام عليكم‏.‏ فقالت عائشة عليكم، ولعنكم الله، وغضب الله عليكم‏.‏ قال ‏\"‏ مهلا يا عائشة، عليك بالرفق، وإياك والعنف والفحش ‏\"‏‏.‏ قالت أولم تسمع ما قالوا قال ‏\"‏ أولم تسمعي ما قلت رددت عليهم، فيستجاب لي فيهم، ولا يستجاب لهم في ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6031,
			"arabicnumber": 6031,
			"text": "حدثنا أصبغ، قال أخبرني ابن وهب، أخبرنا أبو يحيى، هو فليح بن سليمان عن هلال بن أسامة، عن أنس بن مالك ـ رضى الله عنه ـ قال لم يكن النبي صلى الله عليه وسلم سبابا ولا فحاشا ولا لعانا، كان يقول لأحدنا عند المعتبة ‏ \"‏ ما له، ترب جبينه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6032,
			"arabicnumber": 6032,
			"text": "حدثنا عمرو بن عيسى، حدثنا محمد بن سواء، حدثنا روح بن القاسم، عن محمد بن المنكدر، عن عروة، عن عائشة، أن رجلا، استأذن على النبي صلى الله عليه وسلم فلما رآه قال ‏\"‏ بئس أخو العشيرة، وبئس ابن العشيرة ‏\"‏‏.‏ فلما جلس تطلق النبي صلى الله عليه وسلم في وجهه وانبسط إليه، فلما انطلق الرجل قالت له عائشة يا رسول الله حين رأيت الرجل قلت له كذا وكذا، ثم تطلقت في وجهه وانبسطت إليه فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عائشة متى عهدتني فحاشا، إن شر الناس عند الله منزلة يوم القيامة من تركه الناس اتقاء شره ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6033,
			"arabicnumber": 6033,
			"text": "حدثنا عمرو بن عون، حدثنا حماد ـ هو ابن زيد ـ عن ثابت، عن أنس، قال كان النبي صلى الله عليه وسلم أحسن الناس وأجود الناس وأشجع الناس، ولقد فزع أهل المدينة ذات ليلة فانطلق الناس قبل الصوت، فاستقبلهم النبي صلى الله عليه وسلم قد سبق الناس إلى الصوت وهو يقول ‏\"‏ لن تراعوا، لن تراعوا ‏\"‏‏.‏ وهو على فرس لأبي طلحة عرى ما عليه سرج، في عنقه سيف فقال ‏\"‏ لقد وجدته بحرا ‏\"‏‏.‏ أو ‏\"‏ إنه لبحر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6034,
			"arabicnumber": 6034,
			"text": "حدثنا محمد بن كثير، أخبرنا سفيان، عن ابن المنكدر، قال سمعت جابرا ـ رضى الله عنه ـ يقول ما سئل النبي صلى الله عليه وسلم عن شىء قط فقال لا‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6035,
			"arabicnumber": 6035,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني شقيق، عن مسروق، قال كنا جلوسا مع عبد الله بن عمرو يحدثنا إذ قال لم يكن رسول الله صلى الله عليه وسلم فاحشا ولا متفحشا، وإنه كان يقول ‏ \"‏ إن خياركم أحاسنكم أخلاقا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6036,
			"arabicnumber": 6036,
			"text": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد، قال جاءت امرأة إلى النبي صلى الله عليه وسلم ببردة‏.‏ فقال سهل للقوم أتدرون ما البردة فقال القوم هي شملة‏.‏ فقال سهل هي شملة منسوجة فيها حاشيتها ـ فقالت يا رسول الله أكسوك هذه‏.‏ فأخذها النبي صلى الله عليه وسلم محتاجا إليها، فلبسها، فرآها عليه رجل من الصحابة فقال يا رسول الله ما أحسن هذه فاكسنيها‏.‏ فقال ‏ \"‏ نعم ‏\"‏‏.‏ فلما قام النبي صلى الله عليه وسلم لامه أصحابه قالوا ما أحسنت حين رأيت النبي صلى الله عليه وسلم أخذها محتاجا إليها، ثم سألته إياها، وقد عرفت أنه لا يسأل شيئا فيمنعه‏.‏ فقال رجوت بركتها حين لبسها النبي صلى الله عليه وسلم لعلي أكفن فيها‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6037,
			"arabicnumber": 6037,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني حميد بن عبد الرحمن، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يتقارب الزمان وينقص العمل، ويلقى الشح ويكثر الهرج ‏\"‏‏.‏ قالوا وما الهرج قال ‏\"‏ القتل، القتل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6038,
			"arabicnumber": 6038,
			"text": "حدثنا موسى بن إسماعيل، سمع سلام بن مسكين، قال سمعت ثابتا، يقول حدثنا أنس ـ رضى الله عنه ـ قال خدمت النبي صلى الله عليه وسلم عشر سنين، فما قال لي أف‏.‏ ولا لم صنعت ولا ألا صنعت‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6039,
			"arabicnumber": 6039,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، عن الحكم، عن إبراهيم، عن الأسود، قال سألت عائشة ما كان النبي صلى الله عليه وسلم يصنع في أهله قالت كان في مهنة أهله، فإذا حضرت الصلاة قام إلى الصلاة‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6040,
			"arabicnumber": 6040,
			"text": "حدثنا عمرو بن علي، حدثنا أبو عاصم، عن ابن جريج، قال أخبرني موسى بن عقبة، عن نافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا أحب الله عبدا نادى جبريل إن الله يحب فلانا، فأحبه‏.‏ فيحبه جبريل، فينادي جبريل في أهل السماء إن الله يحب فلانا، فأحبوه‏.‏ فيحبه أهل السماء، ثم يوضع له القبول في أهل الأرض ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6041,
			"arabicnumber": 6041,
			"text": "حدثنا آدم، حدثنا شعبة، عن قتادة، عن أنس بن مالك ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ لا يجد أحد حلاوة الإيمان حتى يحب المرء، لا يحبه إلا لله، وحتى أن يقذف في النار أحب إليه من أن يرجع إلى الكفر، بعد إذ أنقذه الله، وحتى يكون الله ورسوله أحب إليه مما سواهما ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6042,
			"arabicnumber": 6042,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن هشام، عن أبيه، عن عبد الله بن زمعة، قال نهى النبي صلى الله عليه وسلم أن يضحك الرجل مما يخرج من الأنفس وقال ‏\"‏ بم يضرب أحدكم امرأته ضرب الفحل، ثم لعله يعانقها ‏\"‏‏.‏ وقال الثوري ووهيب وأبو معاوية عن هشام ‏\"‏ جلد العبد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6043,
			"arabicnumber": 6043,
			"text": "حدثني محمد بن المثنى، حدثنا يزيد بن هارون، أخبرنا عاصم بن محمد بن زيد، عن أبيه، عن ابن عمر، رضى الله عنهما قال قال النبي صلى الله عليه وسلم بمنى ‏\"‏ أتدرون أى يوم هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ فإن هذا يوم حرام، أفتدرون أى بلد هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ بلد حرام، أتدرون أى شهر هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ شهر حرام ‏\"‏‏.‏ قال ‏\"‏ فإن الله حرم عليكم دماءكم وأموالكم وأعراضكم، كحرمة يومكم هذا في شهركم هذا في بلدكم هذا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6044,
			"arabicnumber": 6044,
			"text": "حدثنا سليمان بن حرب، حدثنا شعبة، عن منصور، قال سمعت أبا وائل، يحدث عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ سباب المسلم فسوق، وقتاله كفر ‏\"‏‏.‏ تابعه غندر عن شعبة‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6045,
			"arabicnumber": 6045,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن عبد الله بن بريدة، حدثني يحيى بن يعمر، أن أبا الأسود الديلي، حدثه عن أبي ذر ـ رضى الله عنه ـ أنه سمع النبي صلى الله عليه وسلم يقول ‏ \"‏ لا يرمي رجل رجلا بالفسوق، ولا يرميه بالكفر، إلا ارتدت عليه، إن لم يكن صاحبه كذلك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6046,
			"arabicnumber": 6046,
			"text": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن أنس، قال لم يكن رسول الله صلى الله عليه وسلم فاحشا ولا لعانا ولا سبابا، كان يقول عند المعتبة ‏ \"‏ ما له، ترب جبينه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6047,
			"arabicnumber": 6047,
			"text": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي قلابة، أن ثابت بن الضحاك، وكان، من أصحاب الشجرة حدثه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من حلف على ملة غير الإسلام فهو كما قال، وليس على ابن آدم نذر فيما لا يملك، ومن قتل نفسه بشىء في الدنيا عذب به يوم القيامة، ومن لعن مؤمنا فهو كقتله، ومن قذف مؤمنا بكفر فهو كقتله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6048,
			"arabicnumber": 6048,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني عدي بن ثابت، قال سمعت سليمان بن صرد، رجلا من أصحاب النبي صلى الله عليه وسلم قال استب رجلان عند النبي صلى الله عليه وسلم فغضب أحدهما، فاشتد غضبه حتى انتفخ وجهه وتغير، فقال النبي صلى الله عليه وسلم ‏ \"‏ إني لأعلم كلمة لو قالها لذهب عنه الذي يجد ‏\"‏‏.‏ فانطلق إليه الرجل فأخبره بقول النبي صلى الله عليه وسلم وقال تعوذ بالله من الشيطان‏.‏ فقال أترى بي بأس أمجنون أنا اذهب‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6049,
			"arabicnumber": 6049,
			"text": "حدثنا مسدد، حدثنا بشر بن المفضل، عن حميد، قال قال أنس حدثني عبادة بن الصامت، قال خرج رسول الله صلى الله عليه وسلم ليخبر الناس بليلة القدر، فتلاحى رجلان من المسلمين، قال النبي صلى الله عليه وسلم ‏ \"‏ خرجت لأخبركم، فتلاحى فلان وفلان وإنها رفعت، وعسى أن يكون خيرا لكم، فالتمسوها في التاسعة والسابعة والخامسة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6050,
			"arabicnumber": 6050,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن المعرور، عن أبي ذر، قال رأيت عليه بردا وعلى غلامه بردا فقلت لو أخذت هذا فلبسته كانت حلة، وأعطيته ثوبا آخر‏.‏ فقال كان بيني وبين رجل كلام، وكانت أمه أعجمية، فنلت منها فذكرني إلى النبي صلى الله عليه وسلم فقال لي ‏\"‏ أساببت فلانا ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ أفنلت من أمه ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ إنك امرؤ فيك جاهلية ‏\"‏‏.‏ قلت على حين ساعتي هذه من كبر السن قال ‏\"‏ نعم، هم إخوانكم، جعلهم الله تحت أيديكم، فمن جعل الله أخاه تحت يده فليطعمه مما يأكل، وليلبسه مما يلبس، ولا يكلفه من العمل ما يغلبه، فإن كلفه ما يغلبه فليعنه عليه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6051,
			"arabicnumber": 6051,
			"text": "حدثنا حفص بن عمر، حدثنا يزيد بن إبراهيم، حدثنا محمد، عن أبي هريرة، صلى بنا النبي صلى الله عليه وسلم الظهر ركعتين، ثم سلم، ثم قام إلى خشبة في مقدم المسجد، ووضع يده عليها، وفي القوم يومئذ أبو بكر وعمر، فهابا أن يكلماه، وخرج سرعان الناس فقالوا قصرت الصلاة‏.‏ وفي القوم رجل كان النبي صلى الله عليه وسلم يدعوه ذا اليدين فقال يا نبي الله أنسيت أم قصرت‏.‏ فقال ‏\"‏ لم أنس ولم تقصر ‏\"‏‏.‏ قالوا بل نسيت يا رسول الله‏.‏ قال ‏\"‏ صدق ذو اليدين ‏\"‏‏.‏ فقام فصلى ركعتين ثم سلم، ثم كبر، فسجد مثل سجوده أو أطول، ثم رفع رأسه وكبر، ثم وضع مثل سجوده أو أطول، ثم رفع رأسه وكبر‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6052,
			"arabicnumber": 6052,
			"text": "حدثنا يحيى، حدثنا وكيع، عن الأعمش، قال سمعت مجاهدا، يحدث عن طاوس، عن ابن عباس ـ رضى الله عنهما ـ قال مر رسول الله صلى الله عليه وسلم على قبرين فقال ‏\"‏ إنهما ليعذبان، وما يعذبان في كبير، أما هذا فكان لا يستتر من بوله، وأما هذا فكان يمشي بالنميمة ‏\"‏‏.‏ ثم دعا بعسيب رطب، فشقه باثنين، فغرس على هذا واحدا وعلى هذا واحدا ثم قال ‏\"‏ لعله يخفف عنهما، ما لم ييبسا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6053,
			"arabicnumber": 6053,
			"text": "حدثنا قبيصة، حدثنا سفيان، عن أبي الزناد، عن أبي سلمة، عن أبي أسيد الساعدي، قال قال النبي صلى الله عليه وسلم ‏ \"‏ خير دور الأنصار بنو النجار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6054,
			"arabicnumber": 6054,
			"text": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، سمعت ابن المنكدر، سمع عروة بن الزبير، أن عائشة ـ رضى الله عنها ـ أخبرته قالت، استأذن رجل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ ائذنوا له بئس، أخو العشيرة أو ابن العشيرة ‏\"‏‏.‏ فلما دخل ألان له الكلام قلت يا رسول الله قلت الذي قلت، ثم ألنت له الكلام قال ‏\"‏ أى عائشة، إن شر الناس من تركه الناس ـ أو ودعه الناس ـ اتقاء فحشه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6055,
			"arabicnumber": 6055,
			"text": "حدثنا ابن سلام، أخبرنا عبيدة بن حميد أبو عبد الرحمن، عن منصور، عن مجاهد، عن ابن عباس، قال خرج النبي صلى الله عليه وسلم من بعض حيطان المدينة، فسمع صوت إنسانين يعذبان في قبورهما فقال ‏\"‏ يعذبان، وما يعذبان في كبيرة، وإنه لكبير، كان أحدهما لا يستتر من البول، وكان الآخر يمشي بالنميمة ‏\"‏‏.‏ ثم دعا بجريدة فكسرها بكسرتين أو ثنتين، فجعل كسرة في قبر هذا، وكسرة في قبر هذا، فقال ‏\"‏ لعله يخفف عنهما ما لم ييبسا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6056,
			"arabicnumber": 6056,
			"text": "حدثنا أبو نعيم، حدثنا سفيان، عن منصور، عن إبراهيم، عن همام، قال كنا مع حذيفة فقيل له إن رجلا يرفع الحديث إلى عثمان‏.‏ فقال حذيفة سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ لا يدخل الجنة قتات ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6057,
			"arabicnumber": 6057,
			"text": "حدثنا أحمد بن يونس، حدثنا ابن أبي ذئب، عن المقبري، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من لم يدع قول الزور والعمل به والجهل فليس لله حاجة أن يدع طعامه وشرابه ‏\"‏‏.‏ قال أحمد أفهمني رجل إسناده‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6058,
			"arabicnumber": 6058,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي هريرة ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ تجد من شر الناس يوم القيامة عند الله ذا الوجهين، الذي يأتي هؤلاء بوجه وهؤلاء بوجه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6059,
			"arabicnumber": 6059,
			"text": "حدثنا محمد بن يوسف، أخبرنا سفيان، عن الأعمش، عن أبي وائل، عن ابن مسعود ـ رضى الله عنه ـ قال قسم رسول الله صلى الله عليه وسلم قسمة، فقال رجل من الأنصار والله ما أراد محمد بهذا وجه الله‏.‏ فأتيت رسول الله صلى الله عليه وسلم فأخبرته، فتمعر وجهه وقال ‏ \"‏ رحم الله موسى، لقد أوذي بأكثر من هذا فصبر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6060,
			"arabicnumber": 6060,
			"text": "حدثنا محمد بن صباح، حدثنا إسماعيل بن زكرياء، حدثنا بريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى، قال سمع النبي صلى الله عليه وسلم رجلا يثني على رجل ويطريه في المدحة فقال ‏ \"‏ أهلكتم ـ أو قطعتم ـ ظهر الرجل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6061,
			"arabicnumber": 6061,
			"text": "حدثنا آدم، حدثنا شعبة، عن خالد، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رجلا، ذكر عند النبي صلى الله عليه وسلم فأثنى عليه رجل خيرا، فقال النبي صلى الله عليه وسلم ‏\"‏ ويحك قطعت عنق صاحبك ـ يقوله مرارا ـ إن كان أحدكم مادحا لا محالة فليقل أحسب كذا وكذا‏.‏ إن كان يرى أنه كذلك، وحسيبه الله، ولا يزكي على الله أحدا ‏\"‏‏.‏ قال وهيب عن خالد ‏\"‏ ويلك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6062,
			"arabicnumber": 6062,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا موسى بن عقبة، عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم حين ذكر في الإزار ما ذكر، قال أبو بكر يا رسول الله إن إزاري يسقط من أحد شقيه‏.‏ قال ‏ \"‏ إنك لست منهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6063,
			"arabicnumber": 6063,
			"text": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت مكث النبي صلى الله عليه وسلم كذا وكذا يخيل إليه أنه يأتي أهله ولا يأتي، قالت عائشة فقال لي ذات يوم ‏\"‏ يا عائشة إن الله أفتاني في أمر استفتيته فيه، أتاني رجلان، فجلس أحدهما عند رجلى والآخر عند رأسي، فقال الذي عند رجلى للذي عند رأسي ما بال الرجل قال مطبوب‏.‏ يعني مسحورا‏.‏ قال ومن طبه قال لبيد بن أعصم‏.‏ قال وفيم قال في جف طلعة ذكر في مشط ومشاقة، تحت رعوفة في بئر ذروان ‏\"‏‏.‏ فجاء النبي صلى الله عليه وسلم فقال ‏\"‏ هذه البئر التي أريتها كأن رءوس نخلها رءوس الشياطين، وكأن ماءها نقاعة الحناء ‏\"‏‏.‏ فأمر به النبي صلى الله عليه وسلم فأخرج‏.‏ قالت عائشة فقلت يا رسول الله فهلا ـ تعني ـ تنشرت فقال النبي صلى الله عليه وسلم ‏\"‏ أما الله فقد شفاني، وأما أنا فأكره أن أثير على الناس شرا ‏\"‏‏.‏ قالت ولبيد بن أعصم رجل من بني زريق حليف ليهود‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6064,
			"arabicnumber": 6064,
			"text": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إياكم والظن، فإن الظن أكذب الحديث، ولا تحسسوا، ولا تجسسوا، ولا تحاسدوا، ولا تدابروا، ولا تباغضوا، وكونوا عباد الله إخوانا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6065,
			"arabicnumber": 6065,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني أنس بن مالك ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تباغضوا، ولا تحاسدوا، ولا تدابروا، وكونوا عباد الله إخوانا، ولا يحل لمسلم أن يهجر أخاه فوق ثلاثة أيام ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6066,
			"arabicnumber": 6066,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إياكم والظن، فإن الظن أكذب الحديث، ولا تحسسوا، ولا تجسسوا، ولا تناجشوا، ولا تحاسدوا، ولا تباغضوا، ولا تدابروا، وكونوا عباد الله إخوانا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6067,
			"arabicnumber": 6067,
			"text": "حدثنا سعيد بن عفير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة، قالت قال النبي صلى الله عليه وسلم ‏ \"‏ ما أظن فلانا وفلانا يعرفان من ديننا شيئا ‏\"‏‏.‏ قال الليث كانا رجلين من المنافقين‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6068,
			"arabicnumber": 6068,
			"text": "حدثنا ابن بكير، حدثنا الليث، بهذا وقالت دخل على النبي صلى الله عليه وسلم يوما وقال ‏ \"‏ يا عائشة ما أظن فلانا وفلانا يعرفان ديننا الذي نحن عليه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6069,
			"arabicnumber": 6069,
			"text": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن أخي ابن شهاب، عن ابن شهاب، عن سالم بن عبد الله، قال سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ كل أمتي معافى إلا المجاهرين، وإن من المجانة أن يعمل الرجل بالليل عملا، ثم يصبح وقد ستره الله، فيقول يا فلان عملت البارحة كذا وكذا، وقد بات يستره ربه ويصبح يكشف ستر الله عنه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6070,
			"arabicnumber": 6070,
			"text": "حدثنا مسدد، حدثنا أبو عوانة، عن قتادة، عن صفوان بن محرز، أن رجلا، سأل ابن عمر كيف سمعت رسول الله صلى الله عليه وسلم يقول في النجوى قال ‏ \"‏ يدنو أحدكم من ربه حتى يضع كنفه عليه فيقول عملت كذا وكذا‏.‏ فيقول نعم‏.‏ ويقول عملت كذا وكذا‏.‏ فيقول نعم‏.‏ فيقرره ثم يقول إني سترت عليك في الدنيا، فأنا أغفرها لك اليوم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6071,
			"arabicnumber": 6071,
			"text": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا معبد بن خالد القيسي، عن حارثة بن وهب الخزاعي، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ألا أخبركم بأهل الجنة، كل ضعيف متضاعف، لو أقسم على الله لأبره، ألا أخبركم بأهل النار كل عتل جواظ مستكبر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6072,
			"arabicnumber": 6072,
			"text": "وقال محمد بن عيسى حدثنا هشيم، أخبرنا حميد الطويل، حدثنا أنس بن مالك، قال كانت الأمة من إماء أهل المدينة لتأخذ بيد رسول الله صلى الله عليه وسلم فتنطلق به حيث شاءت‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6075,
			"arabicnumber": 6075,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6076,
			"arabicnumber": 6076,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تباغضوا، ولا تحاسدوا، ولا تدابروا، وكونوا عباد الله إخوانا، ولا يحل لمسلم أن يهجر أخاه فوق ثلاث ليال ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6077,
			"arabicnumber": 6077,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عطاء بن يزيد الليثي، عن أبي أيوب الأنصاري، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يحل لرجل أن يهجر أخاه فوق ثلاث ليال، يلتقيان فيعرض هذا ويعرض هذا، وخيرهما الذي يبدأ بالسلام ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6078,
			"arabicnumber": 6078,
			"text": "حدثنا محمد، أخبرنا عبدة، عن هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأعرف غضبك ورضاك ‏\"‏‏.‏ قالت قلت وكيف تعرف ذاك يا رسول الله قال ‏\"‏ إنك إذا كنت راضية قلت بلى ورب محمد‏.‏ وإذا كنت ساخطة قلت لا ورب إبراهيم ‏\"‏‏.‏ قالت قلت أجل لست أهاجر إلا اسمك‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 6079,
			"arabicnumber": 6079,
			"text": "حدثنا إبراهيم، أخبرنا هشام، عن معمر،‏.‏ وقال الليث حدثني عقيل، قال ابن شهاب فأخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم قالت لم أعقل أبوى إلا وهما يدينان الدين، ولم يمر عليهما يوم إلا يأتينا فيه رسول الله صلى الله عليه وسلم طرفى النهار بكرة وعشية، فبينما نحن جلوس في بيت أبي بكر في نحر الظهيرة قال قائل هذا رسول الله صلى الله عليه وسلم في ساعة لم يكن يأتينا فيها‏.‏ قال أبو بكر ما جاء به في هذه الساعة إلا أمر‏.‏ قال ‏ \"‏ إني قد أذن لي بالخروج ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 6080,
			"arabicnumber": 6080,
			"text": "حدثنا محمد بن سلام، أخبرنا عبد الوهاب، عن خالد الحذاء، عن أنس بن سيرين، عن أنس بن مالك ـ رضى الله عنه أن رسول الله صلى الله عليه وسلم زار أهل بيت في الأنصار فطعم عندهم طعاما، فلما أراد أن يخرج أمر بمكان من البيت، فنضح له على بساط، فصلى عليه، ودعا لهم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 6081,
			"arabicnumber": 6081,
			"text": "حدثنا عبد الله بن محمد، حدثنا عبد الصمد، قال حدثني أبي قال، حدثني يحيى بن أبي إسحاق، قال قال لي سالم بن عبد الله ما الإستبرق قلت ما غلظ من الديباج وخشن منه‏.‏ قال سمعت عبد الله يقول رأى عمر على رجل حلة من إستبرق فأتى بها النبي صلى الله عليه وسلم فقال يا رسول الله اشتر هذه فالبسها لوفد الناس إذا قدموا عليك‏.‏ فقال ‏\"‏ إنما يلبس الحرير من لا خلاق له ‏\"‏‏.‏ فمضى في ذلك ما مضى، ثم إن النبي صلى الله عليه وسلم بعث إليه بحلة فأتى بها النبي صلى الله عليه وسلم فقال بعثت إلى بهذه، وقد قلت في مثلها ما قلت قال ‏\"‏ إنما بعثت إليك لتصيب بها مالا ‏\"‏‏.‏ فكان ابن عمر يكره العلم في الثوب لهذا الحديث‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 6082,
			"arabicnumber": 6082,
			"text": "حدثنا مسدد، حدثنا يحيى، عن حميد، عن أنس، قال لما قدم علينا عبد الرحمن فآخى النبي صلى الله عليه وسلم بينه وبين سعد بن الربيع فقال النبي صلى الله عليه وسلم ‏ \"‏ أولم ولو بشاة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 6083,
			"arabicnumber": 6083,
			"text": "حدثنا محمد بن صباح، حدثنا إسماعيل بن زكرياء، حدثنا عاصم، قال قلت لأنس بن مالك أبلغك أن النبي صلى الله عليه وسلم قال ‏ \"‏ لا حلف في الإسلام ‏\"‏‏.‏ فقال قد حالف النبي صلى الله عليه وسلم بين قريش والأنصار في داري‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 6084,
			"arabicnumber": 6084,
			"text": "حدثنا حبان بن موسى، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن عروة، عن عائشة ـ رضى الله عنها ـ أن رفاعة، القرظي طلق امرأته فبت طلاقها، فتزوجها بعده عبد الرحمن بن الزبير، فجاءت النبي صلى الله عليه وسلم فقالت يا رسول الله إنها كانت عند رفاعة فطلقها آخر ثلاث تطليقات، فتزوجها بعده عبد الرحمن بن الزبير، وإنه والله ما معه يا رسول الله إلا مثل هذه الهدبة، لهدبة أخذتها من جلبابها‏.‏ قال وأبو بكر جالس عند النبي صلى الله عليه وسلم وابن سعيد بن العاص جالس بباب الحجرة ليؤذن له، فطفق خالد ينادي أبا بكر، يا أبا بكر ألا تزجر هذه عما تجهر به عند رسول الله صلى الله عليه وسلم وما يزيد رسول الله صلى الله عليه وسلم على التبسم ثم قال ‏ \"‏ لعلك تريدين أن ترجعي إلى رفاعة، لا، حتى تذوقي عسيلته، ويذوق عسيلتك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 6085,
			"arabicnumber": 6085,
			"text": "حدثنا إسماعيل، حدثنا إبراهيم، عن صالح بن كيسان، عن ابن شهاب، عن عبد الحميد بن عبد الرحمن بن زيد بن الخطاب، عن محمد بن سعد، عن أبيه، قال استأذن عمر بن الخطاب ـ رضى الله عنه ـ على رسول الله صلى الله عليه وسلم وعنده نسوة من قريش يسألنه ويستكثرنه، عالية أصواتهن على صوته، فلما استأذن عمر تبادرن الحجاب، فأذن له النبي صلى الله عليه وسلم فدخل والنبي صلى الله عليه وسلم يضحك فقال أضحك الله سنك يا رسول الله بأبي أنت وأمي فقال ‏\"‏ عجبت من هؤلاء اللاتي كن عندي، لما سمعن صوتك تبادرن الحجاب ‏\"‏‏.‏ فقال أنت أحق أن يهبن يا رسول الله‏.‏ ثم أقبل عليهن فقال يا عدوات أنفسهن أتهبنني ولم تهبن رسول الله صلى الله عليه وسلم فقلن إنك أفظ وأغلظ من رسول الله صلى الله عليه وسلم‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إيه يا ابن الخطاب، والذي نفسي بيده ما لقيك الشيطان سالكا فجا إلا سلك فجا غير فجك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 6086,
			"arabicnumber": 6086,
			"text": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن عمرو، عن أبي العباس، عن عبد الله بن عمرو، قال لما كان رسول الله صلى الله عليه وسلم بالطائف قال ‏\"‏ إنا قافلون غدا إن شاء الله ‏\"‏‏.‏ فقال ناس من أصحاب رسول الله صلى الله عليه وسلم لا نبرح أو نفتحها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فاغدوا على القتال ‏\"‏‏.‏ قال فغدوا فقاتلوهم قتالا شديدا وكثر فيهم الجراحات فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا قافلون غدا إن شاء الله ‏\"‏‏.‏ قال فسكتوا فضحك رسول الله صلى الله عليه وسلم‏.‏ قال الحميدي حدثنا سفيان بالخبر‏ كله.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 6087,
			"arabicnumber": 6087,
			"text": "حدثنا موسى، حدثنا إبراهيم، أخبرنا ابن شهاب، عن حميد بن عبد الرحمن، أن أبا هريرة ـ رضى الله عنه ـ قال أتى رجل النبي صلى الله عليه وسلم فقال هلكت وقعت على أهلي في رمضان‏.‏ قال ‏\"‏ أعتق رقبة ‏\"‏‏.‏ قال ليس لي‏.‏ قال ‏\"‏ فصم شهرين متتابعين ‏\"‏‏.‏ قال لا أستطيع‏.‏ قال ‏\"‏ فأطعم ستين مسكينا ‏\"‏‏.‏ قال لا أجد‏.‏ فأتي بعرق فيه تمر ـ قال إبراهيم العرق المكتل فقال ‏\"‏ أين السائل تصدق بها ‏\"‏‏.‏ قال على أفقر مني والله ما بين لابتيها أهل بيت أفقر منا‏.‏ فضحك النبي صلى الله عليه وسلم حتى بدت نواجذه‏.‏ قال ‏\"‏ فأنتم إذا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 6088,
			"arabicnumber": 6088,
			"text": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنت أمشي مع رسول الله صلى الله عليه وسلم وعليه برد نجراني غليظ الحاشية، فأدركه أعرابي فجبذ بردائه جبذة شديدة ـ قال أنس فنظرت إلى صفحة عاتق النبي صلى الله عليه وسلم وقد أثرت بها حاشية الرداء من شدة جبذته ـ ثم قال يا محمد مر لي من مال الله الذي عندك‏.‏ فالتفت إليه فضحك، ثم أمر له بعطاء‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 6090,
			"arabicnumber": 6090,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 6091,
			"arabicnumber": 6091,
			"text": "حدثنا محمد بن المثنى، حدثنا يحيى، عن هشام، قال أخبرني أبي، عن زينب بنت أم سلمة، عن أم سلمة، أن أم سليم، قالت يا رسول الله إن الله لا يستحي من الحق، هل على المرأة غسل إذا احتلمت قال ‏\"‏ نعم إذا رأت الماء ‏\"‏‏.‏ فضحكت أم سلمة فقالت أتحتلم المرأة فقال النبي صلى الله عليه وسلم ‏\"‏ فبم شبه الولد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 6092,
			"arabicnumber": 6092,
			"text": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، أخبرنا عمرو، أن أبا النضر، حدثه عن سليمان بن يسار، عن عائشة ـ رضى الله عنها ـ قالت ما رأيت النبي صلى الله عليه وسلم مستجمعا قط ضاحكا حتى أرى منه لهواته، إنما كان يتبسم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 6093,
			"arabicnumber": 6093,
			"text": "حدثنا محمد بن محبوب، حدثنا أبو عوانة، عن قتادة، عن أنس،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس ـ رضى الله عنه أن رجلا، جاء إلى النبي صلى الله عليه وسلم يوم الجمعة وهو يخطب بالمدينة فقال قحط المطر فاستسق ربك، فنظر إلى السماء وما نرى من سحاب، فاستسقى فنشأ السحاب بعضه إلى بعض، ثم مطروا حتى سالت مثاعب المدينة، فما زالت إلى الجمعة المقبلة ما تقلع، ثم قام ذلك الرجل أو غيره والنبي صلى الله عليه وسلم يخطب فقال غرقنا فادع ربك يحبسها عنا‏.‏ فضحك ثم قال ‏ \"‏ اللهم حوالينا ولا علينا ‏\"‏‏.‏ مرتين أو ثلاثا‏.‏ فجعل السحاب يتصدع عن المدينة يمينا وشمالا، يمطر ما حوالينا، ولا يمطر منها شىء، يريهم الله كرامة نبيه صلى الله عليه وسلم وإجابة دعوته‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 6094,
			"arabicnumber": 6094,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الصدق يهدي إلى البر، وإن البر يهدي إلى الجنة، وإن الرجل ليصدق حتى يكون صديقا، وإن الكذب يهدي إلى الفجور، وإن الفجور يهدي إلى النار، وإن الرجل ليكذب، حتى يكتب عند الله كذابا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 6095,
			"arabicnumber": 6095,
			"text": "حدثنا ابن سلام، حدثنا إسماعيل بن جعفر، عن أبي سهيل، نافع بن مالك بن أبي عامر عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ آية المنافق ثلاث إذا حدث كذب، وإذا وعد أخلف، وإذا اؤتمن خان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 6096,
			"arabicnumber": 6096,
			"text": "حدثنا موسى بن إسماعيل، حدثنا جرير، حدثنا أبو رجاء، عن سمرة بن جندب ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ رأيت رجلين أتياني قالا الذي رأيته يشق شدقه فكذاب يكذب بالكذبة تحمل عنه حتى تبلغ الآفاق فيصنع به إلى يوم القيامة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 6097,
			"arabicnumber": 6097,
			"text": "حدثنا إسحاق بن إبراهيم، قال قلت لأبي أسامة حدثكم الأعمش، سمعت شقيقا، قال سمعت حذيفة، يقول إن أشبه الناس دلا وسمتا وهديا برسول الله صلى الله عليه وسلم لابن أم عبد، من حين يخرج من بيته إلى أن يرجع إليه، لا ندري ما يصنع في أهله إذا خلا‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 6098,
			"arabicnumber": 6098,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن مخارق، سمعت طارقا، قال قال عبد الله إن أحسن الحديث كتاب الله، وأحسن الهدى هدى محمد صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 6099,
			"arabicnumber": 6099,
			"text": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن سفيان، قال حدثني الأعمش، عن سعيد بن جبير، عن أبي عبد الرحمن السلمي، عن أبي موسى ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس أحد ـ أو ليس شىء ـ أصبر على أذى سمعه من الله، إنهم ليدعون له ولدا، وإنه ليعافيهم ويرزقهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 6100,
			"arabicnumber": 6100,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال سمعت شقيقا، يقول قال عبد الله قسم النبي صلى الله عليه وسلم قسمة كبعض ما كان يقسم، فقال رجل من الأنصار والله إنها لقسمة ما أريد بها وجه الله‏.‏ قلت أما أنا لأقولن للنبي صلى الله عليه وسلم فأتيته وهو في أصحابه فساررته فشق ذلك على النبي صلى الله عليه وسلم وتغير وجهه وغضب، حتى وددت أني لم أكن أخبرته ثم قال ‏ \"‏ قد أوذي موسى بأكثر من ذلك فصبر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 6101,
			"arabicnumber": 6101,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا مسلم، عن مسروق، قالت عائشة صنع النبي صلى الله عليه وسلم شيئا فرخص فيه فتنزه عنه قوم فبلغ ذلك النبي صلى الله عليه وسلم فخطب فحمد الله ثم قال ‏ \"‏ ما بال أقوام يتنزهون عن الشىء أصنعه، فوالله إني لأعلمهم بالله وأشدهم له خشية ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 6102,
			"arabicnumber": 6102,
			"text": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا شعبة، عن قتادة، سمعت عبد الله ـ هو ابن أبي عتبة مولى أنس ـ عن أبي سعيد الخدري، قال كان النبي صلى الله عليه وسلم أشد حياء من العذراء في خدرها، فإذا رأى شيئا يكرهه عرفناه في وجهه‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 6103,
			"arabicnumber": 6103,
			"text": "حدثنا محمد، وأحمد بن سعيد، قالا حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا قال الرجل لأخيه يا كافر فقد باء به أحدهما ‏\"‏‏.‏ وقال عكرمة بن عمار عن يحيى، عن عبد الله بن يزيد، سمع أبا سلمة، سمع أبا هريرة، عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 6104,
			"arabicnumber": 6104,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أيما رجل قال لأخيه يا كافر‏.‏ فقد باء بها أحدهما ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 6105,
			"arabicnumber": 6105,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا أيوب، عن أبي قلابة، عن ثابت بن الضحاك، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من حلف بملة غير الإسلام كاذبا فهو كما قال، ومن قتل نفسه بشىء عذب به في نار جهنم، ولعن المؤمن كقتله، ومن رمى مؤمنا بكفر فهو كقتله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 6106,
			"arabicnumber": 6106,
			"text": "حدثنا محمد بن عبادة، أخبرنا يزيد، أخبرنا سليم، حدثنا عمرو بن دينار، حدثنا جابر بن عبد الله، أن معاذ بن جبل ـ رضى الله عنه ـ كان يصلي مع النبي صلى الله عليه وسلم ثم يأتي قومه فيصلي بهم الصلاة، فقرأ بهم البقرة ـ قال ـ فتجوز رجل فصلى صلاة خفيفة، فبلغ ذلك معاذا فقال إنه منافق‏.‏ فبلغ ذلك الرجل، فأتى النبي صلى الله عليه وسلم فقال يا رسول الله إنا قوم نعمل بأيدينا، ونسقي بنواضحنا، وإن معاذا صلى بنا البارحة، فقرأ البقرة فتجوزت، فزعم أني منافق‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ يا معاذ أفتان أنت ـ ثلاثا ـ اقرأ ‏{‏والشمس وضحاها‏}‏ و‏{‏سبح اسم ربك الأعلى‏}‏ ونحوها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 6107,
			"arabicnumber": 6107,
			"text": "حدثني إسحاق، أخبرنا أبو المغيرة، حدثنا الأوزاعي، حدثنا الزهري، عن حميد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من حلف منكم فقال في حلفه باللات والعزى‏.‏ فليقل لا إله إلا الله‏.‏ ومن قال لصاحبه تعال أقامرك، فليتصدق ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 6108,
			"arabicnumber": 6108,
			"text": "حدثنا قتيبة، حدثنا ليث، عن نافع، عن ابن عمر ـ رضى الله عنهما أنه أدرك عمر بن الخطاب في ركب وهو يحلف بأبيه، فناداهم رسول الله صلى الله عليه وسلم ‏ \"‏ ألا إن الله ينهاكم أن تحلفوا بآبائكم، فمن كان حالفا فليحلف بالله، وإلا فليصمت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 6109,
			"arabicnumber": 6109,
			"text": "حدثنا يسرة بن صفوان، حدثنا إبراهيم، عن الزهري، عن القاسم، عن عائشة ـ رضى الله عنها ـ قالت دخل على النبي صلى الله عليه وسلم وفي البيت قرام فيه صور، فتلون وجهه، ثم تناول الستر فهتكه، وقالت قال النبي صلى الله عليه وسلم ‏ \"‏ من أشد الناس عذابا يوم القيامة الذين يصورون هذه الصور ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 6110,
			"arabicnumber": 6110,
			"text": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل بن أبي خالد، حدثنا قيس بن أبي حازم، عن أبي مسعود ـ رضى الله عنه ـ قال أتى رجل النبي صلى الله عليه وسلم فقال إني لأتأخر عن صلاة الغداة من أجل فلان مما يطيل بنا قال فما رأيت رسول الله صلى الله عليه وسلم قط أشد غضبا في موعظة منه يومئذ قال فقال ‏ \"‏ يا أيها الناس إن منكم منفرين، فأيكم ما صلى بالناس فليتجوز، فإن فيهم المريض والكبير وذا الحاجة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 6111,
			"arabicnumber": 6111,
			"text": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله ـ رضى الله عنه ـ قال بينا النبي صلى الله عليه وسلم يصلي رأى في قبلة المسجد نخامة، فحكها بيده، فتغيظ ثم قال ‏ \"‏ إن أحدكم إذا كان في الصلاة فإن الله حيال وجهه، فلا يتنخمن حيال وجهه في الصلاة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 6112,
			"arabicnumber": 6112,
			"text": "حدثنا محمد، حدثنا إسماعيل بن جعفر، أخبرنا ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة، ثم اعرف وكاءها وعفاصها، ثم استنفق بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قال يا رسول الله فضالة الغنم قال ‏\"‏ خذها، فإنما هي لك، أو لأخيك، أو للذئب ‏\"‏‏.‏ قال يا رسول الله فضالة الإبل قال فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه ـ أو احمر وجهه ـ ثم قال ‏\"‏ مالك ولها، معها حذاؤها وسقاؤها، حتى يلقاها ربها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 6113,
			"arabicnumber": 6113,
			"text": "وقال المكي حدثنا عبد الله بن سعيد،‏.‏ وحدثني محمد بن زياد، حدثنا محمد بن جعفر، حدثنا عبد الله بن سعيد، قال حدثني سالم أبو النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، عن زيد بن ثابت ـ رضى الله عنه ـ قال احتجر رسول الله صلى الله عليه وسلم حجيرة مخصفة أو حصيرا، فخرج رسول الله صلى الله عليه وسلم يصلي فيها، فتتبع إليه رجال وجاءوا يصلون بصلاته، ثم جاءوا ليلة فحضروا وأبطأ رسول الله صلى الله عليه وسلم عنهم، فلم يخرج إليهم فرفعوا أصواتهم وحصبوا الباب، فخرج إليهم مغضبا فقال لهم رسول الله صلى الله عليه وسلم ‏ \"‏ ما زال بكم صنيعكم حتى ظننت أنه سيكتب عليكم، فعليكم بالصلاة في بيوتكم، فإن خير صلاة المرء في بيته، إلا الصلاة المكتوبة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 6114,
			"arabicnumber": 6114,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ليس الشديد بالصرعة، إنما الشديد الذي يملك نفسه عند الغضب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 6115,
			"arabicnumber": 6115,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن عدي بن ثابت، حدثنا سليمان بن صرد، قال استب رجلان عند النبي صلى الله عليه وسلم ونحن عنده جلوس، وأحدهما يسب صاحبه مغضبا قد احمر وجهه فقال النبي صلى الله عليه وسلم ‏ \"‏ إني لأعلم كلمة لو قالها لذهب عنه ما يجد لو قال أعوذ بالله من الشيطان الرجيم ‏\"‏‏.‏ فقالوا للرجل ألا تسمع ما يقول النبي صلى الله عليه وسلم قال إني لست بمجنون‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 6116,
			"arabicnumber": 6116,
			"text": "حدثني يحيى بن يوسف، أخبرنا أبو بكر ـ هو ابن عياش ـ عن أبي حصين، عن أبي صالح، عن أبي هريرة ـ رضى الله عنه ـ أن رجلا، قال للنبي صلى الله عليه وسلم أوصني‏.‏ قال ‏\"‏ لا تغضب ‏\"‏‏.‏ فردد مرارا، قال ‏\"‏ لا تغضب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 6117,
			"arabicnumber": 6117,
			"text": "حدثنا آدم، حدثنا شعبة، عن قتادة، عن أبي السوار العدوي، قال سمعت عمران بن حصين، قال قال النبي صلى الله عليه وسلم ‏ \"‏ الحياء لا يأتي إلا بخير ‏\"‏‏.‏ فقال بشير بن كعب مكتوب في الحكمة إن من الحياء وقارا، وإن من الحياء سكينة‏.‏ فقال له عمران أحدثك عن رسول الله صلى الله عليه وسلم وتحدثني عن صحيفتك‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 6118,
			"arabicnumber": 6118,
			"text": "حدثنا أحمد بن يونس، حدثنا عبد العزيز بن أبي سلمة، حدثنا ابن شهاب، عن سالم، عن عبد الله بن عمر ـ رضى الله عنهما مر النبي صلى الله عليه وسلم على رجل وهو يعاتب في الحياء يقول إنك لتستحيي‏.‏ حتى كأنه يقول قد أضر بك‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ دعه فإن الحياء من الإيمان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 6119,
			"arabicnumber": 6119,
			"text": "حدثنا علي بن الجعد، أخبرنا شعبة، عن قتادة، عن مولى، أنس ـ قال أبو عبد الله اسمه عبد الله بن أبي عتبة ـ سمعت أبا سعيد، يقول كان النبي صلى الله عليه وسلم أشد حياء من العذراء في خدرها‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 6120,
			"arabicnumber": 6120,
			"text": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا منصور، عن ربعي بن حراش، حدثنا أبو مسعود، قال قال النبي صلى الله عليه وسلم ‏ \"‏ إن مما أدرك الناس من كلام النبوة الأولى إذا لم تستحي فاصنع ما شئت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 6121,
			"arabicnumber": 6121,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن هشام بن عروة، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة ـ رضى الله عنها ـ قالت جاءت أم سليم إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحي من الحق، فهل على المرأة غسل إذا احتلمت فقال ‏ \"‏ نعم إذا رأت الماء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 6122,
			"arabicnumber": 6122,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا محارب بن دثار، قال سمعت ابن عمر، يقول قال النبي صلى الله عليه وسلم ‏\"‏ مثل المؤمن كمثل شجرة خضراء، لا يسقط ورقها، ولا يتحات ‏\"‏‏.‏ فقال القوم هي شجرة كذا‏.‏ هي شجرة كذا، فأردت أن أقول هي النخلة‏.‏ وأنا غلام شاب فاستحييت، فقال ‏\"‏ هي النخلة ‏\"‏‏.‏ وعن شعبة حدثنا خبيب بن عبد الرحمن عن حفص بن عاصم عن ابن عمر مثله وزاد فحدثت به عمر فقال لو كنت قلتها لكان أحب إلى من كذا وكذا‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 6123,
			"arabicnumber": 6123,
			"text": "حدثنا مسدد، حدثنا مرحوم، سمعت ثابتا، أنه سمع أنسا ـ رضى الله عنه ـ يقول جاءت امرأة إلى النبي صلى الله عليه وسلم تعرض عليه نفسها فقالت هل لك حاجة في فقالت ابنته ما أقل حياءها‏.‏ فقال هي خير منك، عرضت على رسول الله صلى الله عليه وسلم نفسها‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 6124,
			"arabicnumber": 6124,
			"text": "حدثني إسحاق، حدثنا النضر، أخبرنا شعبة، عن سعيد بن أبي بردة، عن أبيه، عن جده، قال لما بعثه رسول الله صلى الله عليه وسلم ومعاذ بن جبل قال لهما ‏\"‏ يسرا ولا تعسرا، وبشرا ولا تنفرا، وتطاوعا ‏\"‏‏.‏ قال أبو موسى يا رسول الله إنا بأرض يصنع فيها شراب من العسل، يقال له البتع، وشراب من الشعير، يقال له المزر‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر حرام ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 6125,
			"arabicnumber": 6125,
			"text": "حدثنا آدم، حدثنا شعبة، عن أبي التياح، قال سمعت أنس بن مالك ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ يسروا ولا تعسروا، وسكنوا ولا تنفروا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 6126,
			"arabicnumber": 6126,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن عروة، عن عائشة ـ رضى الله عنها ـ أنها قالت ما خير رسول الله صلى الله عليه وسلم بين أمرين قط إلا أخذ أيسرهما، ما لم يكن إثما، فإن كان إثما كان أبعد الناس منه، وما انتقم رسول الله صلى الله عليه وسلم لنفسه في شىء قط، إلا أن تنتهك حرمة الله، فينتقم بها لله‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 6127,
			"arabicnumber": 6127,
			"text": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن الأزرق بن قيس، قال كنا على شاطئ نهر بالأهواز قد نضب عنه الماء، فجاء أبو برزة الأسلمي على فرس، فصلى وخلى فرسه، فانطلقت الفرس، فترك صلاته وتبعها حتى أدركها، فأخذها ثم جاء فقضى صلاته، وفينا رجل له رأى، فأقبل يقول انظروا إلى هذا الشيخ ترك صلاته من أجل فرس‏.‏ فأقبل فقال ما عنفني أحد منذ فارقت رسول الله صلى الله عليه وسلم وقال إن منزلي متراخ فلو صليت وتركت لم آت أهلي إلى الليل‏.‏ وذكر أنه صحب النبي صلى الله عليه وسلم فرأى من تيسيره‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 6128,
			"arabicnumber": 6128,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح وقال الليث حدثني يونس، عن ابن شهاب، أخبرني عبيد الله بن عبد الله بن عتبة، أن أبا هريرة، أخبره أن أعرابيا بال في المسجد، فثار إليه الناس ليقعوا به فقال لهم رسول الله صلى الله عليه وسلم ‏ \"‏ دعوه، وأهريقوا على بوله ذنوبا من ماء ـ أو سجلا من ماء ـ فإنما بعثتم ميسرين، ولم تبعثوا معسرين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 6129,
			"arabicnumber": 6129,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا أبو التياح، قال سمعت أنس بن مالك ـ رضى الله عنه ـ يقول إن كان النبي صلى الله عليه وسلم ليخالطنا حتى يقول لأخ لي صغير ‏ \"‏ يا أبا عمير ما فعل النغير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 6130,
			"arabicnumber": 6130,
			"text": "حدثنا محمد، أخبرنا أبو معاوية، حدثنا هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت كنت ألعب بالبنات عند النبي صلى الله عليه وسلم وكان لي صواحب يلعبن معي، فكان رسول الله صلى الله عليه وسلم إذا دخل يتقمعن منه، فيسربهن إلى فيلعبن معي‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 6131,
			"arabicnumber": 6131,
			"text": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن ابن المنكدر، حدثه عروة بن الزبير، أن عائشة، أخبرته‏.‏ أنه، استأذن على النبي صلى الله عليه وسلم رجل فقال ‏\"‏ ائذنوا له فبئس ابن العشيرة ‏\"‏‏.‏ أو ‏\"‏ بئس أخو العشيرة ‏\"‏‏.‏ فلما دخل ألان له الكلام‏.‏ فقلت له يا رسول الله قلت ما قلت، ثم ألنت له في القول‏.‏ فقال ‏\"‏ أى عائشة، إن شر الناس منزلة عند الله من تركه ـ أو ودعه ـ الناس اتقاء فحشه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 6132,
			"arabicnumber": 6132,
			"text": "حدثنا عبد الله بن عبد الوهاب، أخبرنا ابن علية، أخبرنا أيوب، عن عبد الله بن أبي مليكة، أن النبي صلى الله عليه وسلم أهديت له أقبية من ديباج مزررة بالذهب، فقسمها في ناس من أصحابه وعزل منها واحدا لمخرمة، فلما جاء قال ‏ \"‏ خبأت هذا لك ‏\"‏‏.‏ قال أيوب بثوبه أنه يريه إياه، وكان في خلقه شىء‏.‏ رواه حماد بن زيد عن أيوب وقال حاتم بن وردان حدثنا أيوب، عن ابن أبي مليكة، عن المسور، قدمت على النبي صلى الله عليه وسلم أقبية‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 6133,
			"arabicnumber": 6133,
			"text": "حدثنا قتيبة، حدثنا الليث، عن عقيل، عن الزهري، عن ابن المسيب، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ لا يلدغ المؤمن من جحر واحد مرتين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 6134,
			"arabicnumber": 6134,
			"text": "حدثنا إسحاق بن منصور، حدثنا روح بن عبادة، حدثنا حسين، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمرو، قال دخل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألم أخبر أنك تقوم الليل وتصوم النهار ‏\"‏‏.‏ قلت بلى‏.‏ قال ‏\"‏ فلا تفعل، قم ونم، وصم وأفطر، فإن لجسدك عليك حقا، وإن لعينك عليك حقا، وإن لزورك عليك حقا، وإن لزوجك عليك حقا، وإنك عسى أن يطول بك عمر، وإن من حسبك أن تصوم من كل شهر ثلاثة أيام، فإن بكل حسنة عشر أمثالها فذلك الدهر كله ‏\"‏‏.‏ قال فشددت فشدد على فقلت فإني أطيق غير ذلك‏.‏ قال ‏\"‏ فصم من كل جمعة ثلاثة أيام ‏\"‏‏.‏ قال فشددت فشدد على قلت أطيق غير ذلك‏.‏ قال ‏\"‏ فصم صوم نبي الله داود ‏\"‏‏.‏ قلت وما صوم نبي الله داود قال ‏\"‏ نصف الدهر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 6135,
			"arabicnumber": 6135,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن سعيد بن أبي سعيد المقبري، عن أبي شريح الكعبي، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فليكرم ضيفه، جائزته يوم وليلة، والضيافة ثلاثة أيام، فما بعد ذلك فهو صدقة، ولا يحل له أن يثوي عنده حتى يحرجه ‏\"‏‏.‏ حدثنا إسماعيل، قال حدثني مالك، مثله وزاد ‏\"‏ من كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 6136,
			"arabicnumber": 6136,
			"text": "حدثنا عبد الله بن محمد، حدثنا ابن مهدي، حدثنا سفيان، عن أبي حصين، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذ جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه، ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 6137,
			"arabicnumber": 6137,
			"text": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر ـ رضى الله عنه ـ أنه قال قلنا يا رسول الله إنك تبعثنا فننزل بقوم فلا يقروننا فما ترى، فقال لنا رسول الله صلى الله عليه وسلم ‏ \"‏ إن نزلتم بقوم فأمروا لكم بما ينبغي للضيف فاقبلوا، فإن لم يفعلوا فخذوا منهم حق الضيف الذي ينبغي لهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 6138,
			"arabicnumber": 6138,
			"text": "حدثنا عبد الله بن محمد، حدثنا هشام، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ من كان يؤمن بالله واليوم الآخر فليكرم ضيفه، ومن كان يؤمن بالله واليوم الآخر فليصل رحمه، ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 6139,
			"arabicnumber": 6139,
			"text": "حدثنا محمد بن بشار، حدثنا جعفر بن عون، حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال آخى النبي صلى الله عليه وسلم بين سلمان وأبي الدرداء‏.‏ فزار سلمان أبا الدرداء فرأى أم الدرداء متبذلة فقال لها ما شأنك قالت أخوك أبو الدرداء ليس له حاجة في الدنيا‏.‏ فجاء أبو الدرداء فصنع له طعاما فقال كل فإني صائم‏.‏ قال ما أنا بآكل حتى تأكل‏.‏ فأكل، فلما كان الليل ذهب أبو الدرداء يقوم فقال نم‏.‏ فنام، ثم ذهب يقوم فقال نم‏.‏ فلما كان آخر الليل قال سلمان قم الآن‏.‏ قال فصليا فقال له سلمان إن لربك عليك حقا، ولنفسك عليك حقا، ولأهلك عليك حقا، فأعط كل ذي حق حقه‏.‏ فأتى النبي صلى الله عليه وسلم فذكر ذلك له‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ صدق سلمان ‏\"‏‏.‏ أبو جحيفة وهب السوائي، يقال وهب الخير‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 6140,
			"arabicnumber": 6140,
			"text": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا سعيد الجريري، عن أبي عثمان، عن عبد الرحمن بن أبي بكر ـ رضى الله عنهما أن أبا بكر، تضيف رهطا فقال لعبد الرحمن دونك أضيافك فإني منطلق إلى النبي صلى الله عليه وسلم فافرغ من قراهم قبل أن أجيء‏.‏ فانطلق عبد الرحمن فأتاهم بما عنده فقال اطعموا‏.‏ فقالوا أين رب منزلنا قال اطعموا‏.‏ قالوا ما نحن بآكلين حتى يجيء رب منزلنا‏.‏ قال اقبلوا عنا قراكم، فإنه إن جاء ولم تطعموا لنلقين منه‏.‏ فأبوا فعرفت أنه يجد على، فلما جاء تنحيت عنه فقال ما صنعتم فأخبروه فقال يا عبد الرحمن‏.‏ فسكت ثم قال يا عبد الرحمن‏.‏ فسكت فقال يا غنثر أقسمت عليك إن كنت تسمع صوتي لما جئت‏.‏ فخرجت فقلت سل أضيافك‏.‏ فقالوا صدق أتانا به‏.‏ قال فإنما انتظرتموني، والله لا أطعمه الليلة‏.‏ فقال الآخرون والله لا نطعمه حتى تطعمه‏.‏ قال لم أر في الشر كالليلة، ويلكم ما أنتم لم لا تقبلون عنا قراكم هات طعامك‏.‏ فجاءه فوضع يده فقال باسم الله، الأولى للشيطان‏.‏ فأكل وأكلوا‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 6141,
			"arabicnumber": 6141,
			"text": "حدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن سليمان، عن أبي عثمان، قال عبد الرحمن بن أبي بكر ـ رضى الله عنهما جاء أبو بكر بضيف له أو بأضياف له، فأمسى عند النبي صلى الله عليه وسلم فلما جاء قالت أمي احتبست عن ضيفك ـ أو أضيافك ـ الليلة‏.‏ قال ما عشيتهم فقالت عرضنا عليه ـ أو عليهم فأبوا أو ـ فأبى، فغضب أبو بكر فسب وجدع وحلف لا يطعمه، فاختبأت أنا فقال يا غنثر‏.‏ فحلفت المرأة لا تطعمه حتى يطعمه، فحلف الضيف ـ أو الأضياف ـ أن لا يطعمه أو يطعموه حتى يطعمه، فقال أبو بكر كأن هذه من الشيطان فدعا بالطعام فأكل وأكلوا فجعلوا لا يرفعون لقمة إلا ربا من أسفلها أكثر منها، فقال يا أخت بني فراس ما هذا فقالت وقرة عيني إنها الآن لأكثر قبل أن نأكل فأكلوا وبعث بها إلى النبي صلى الله عليه وسلم فذكر أنه أكل منها‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 6143,
			"arabicnumber": 6143,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 6144,
			"arabicnumber": 6144,
			"text": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، حدثني نافع، عن ابن عمر ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أخبروني بشجرة مثلها مثل المسلم، تؤتي أكلها كل حين بإذن ربها، ولا تحت ورقها ‏\"‏‏.‏ فوقع في نفسي أنها النخلة، فكرهت أن أتكلم وثم أبو بكر وعمر، فلما لم يتكلما قال النبي صلى الله عليه وسلم ‏\"‏ هي النخلة ‏\"‏‏.‏ فلما خرجت مع أبي قلت يا أبتاه وقع في نفسي أنها النخلة‏.‏ قال ما منعك أن تقولها لو كنت قلتها كان أحب إلى من كذا وكذا‏.‏ قال ما منعني إلا أني لم أرك ولا أبا بكر تكلمتما، فكرهت‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 6145,
			"arabicnumber": 6145,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني أبو بكر بن عبد الرحمن، أن مروان بن الحكم، أخبره أن عبد الرحمن بن الأسود بن عبد يغوث أخبره أن أبى بن كعب أخبره أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن من الشعر حكمة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 6146,
			"arabicnumber": 6146,
			"text": "حدثنا أبو نعيم، حدثنا سفيان، عن الأسود بن قيس، سمعت جندبا، يقول بينما النبي صلى الله عليه وسلم يمشي إذ أصابه حجر فعثر فدميت إصبعه فقال ‏ \"‏ هل أنت إلا إصبع دميت وفي سبيل الله ما لقيت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 6147,
			"arabicnumber": 6147,
			"text": "حدثنا ابن بشار، حدثنا ابن مهدي، حدثنا سفيان، عن عبد الملك، حدثنا أبو سلمة، عن أبي هريرة ـ رضى الله عنه ـ قال النبي صلى الله عليه وسلم ‏ \"‏ أصدق كلمة قالها الشاعر كلمة لبيد ألا كل شىء ما خلا الله باطل ‏\"‏‏.‏ وكاد أمية بن أبي الصلت أن يسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 6148,
			"arabicnumber": 6148,
			"text": "حدثنا قتيبة بن سعيد، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر فسرنا ليلا، فقال رجل من القوم لعامر بن الأكوع ألا تسمعنا من هنيهاتك، قال وكان عامر رجلا شاعرا، فنزل يحدو بالقوم يقول اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فاغفر فداء لك ما اقتفينا وثبت الأقدام إن لاقينا وألقين سكينة علينا إنا إذا صيح بنا أتينا وبالصياح عولوا علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا السائق ‏\"‏‏.‏ قالوا عامر بن الأكوع‏.‏ فقال ‏\"‏ يرحمه الله ‏\"‏‏.‏ فقال رجل من القوم وجبت يا نبي الله، لو أمتعتنا به‏.‏ قال فأتينا خيبر فحاصرناهم حتى أصابتنا مخمصة شديدة، ثم إن الله فتحها عليهم، فلما أمسى الناس اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما هذه النيران، على أى شىء توقدون ‏\"‏‏.‏ قالوا على لحم‏.‏ قال ‏\"‏ على أى لحم ‏\"‏‏.‏ قالوا على لحم حمر إنسية‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أهرقوها واكسروها ‏\"‏‏.‏ فقال رجل يا رسول الله أو نهريقها ونغسلها قال ‏\"‏ أو ذاك ‏\"‏‏.‏ فلما تصاف القوم كان سيف عامر فيه قصر، فتناول به يهوديا ليضربه، ويرجع ذباب سيفه فأصاب ركبة عامر فمات منه، فلما قفلوا قال سلمة رآني رسول الله صلى الله عليه وسلم شاحبا‏.‏ فقال لي ‏\"‏ ما لك ‏\"‏‏.‏ فقلت فدى لك أبي وأمي زعموا أن عامرا حبط عمله‏.‏ قال ‏\"‏ من قاله ‏\"‏‏.‏ قلت قاله فلان وفلان وفلان وأسيد بن الحضير الأنصاري‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذب من قاله، إن له لأجرين ـ وجمع بين إصبعيه ـ إنه لجاهد مجاهد، قل عربي نشأ بها مثله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 6149,
			"arabicnumber": 6149,
			"text": "حدثنا مسدد، حدثنا إسماعيل، حدثنا أيوب، عن أبي قلابة، عن أنس بن مالك ـ رضى الله عنه ـ قال أتى النبي صلى الله عليه وسلم على بعض نسائه ومعهن أم سليم فقال ‏\"‏ ويحك يا أنجشة، رويدك سوقا بالقوارير ‏\"‏‏.‏ قال أبو قلابة فتكلم النبي صلى الله عليه وسلم بكلمة، لو تكلم بعضكم لعبتموها عليه قوله ‏\"‏ سوقك بالقوارير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 6150,
			"arabicnumber": 6150,
			"text": "حدثنا محمد، حدثنا عبدة، أخبرنا هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت استأذن حسان بن ثابت رسول الله صلى الله عليه وسلم في هجاء المشركين فقال رسول الله صلى الله عليه وسلم ‏ \"‏ فكيف بنسبي ‏\"‏‏.‏ فقال حسان لأسلنك منهم كما تسل الشعرة من العجين‏.‏ وعن هشام بن عروة عن أبيه قال ذهبت أسب حسان عند عائشة فقالت لا تسبه فإنه كان ينافح عن رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 6151,
			"arabicnumber": 6151,
			"text": "حدثنا أصبغ، قال أخبرني عبد الله بن وهب، قال أخبرني يونس، عن ابن شهاب، أن الهيثم بن أبي سنان، أخبره أنه، سمع أبا هريرة، في قصصه يذكر النبي صلى الله عليه وسلم يقول ‏ \"‏ إن أخا لكم لا يقول الرفث ‏\"‏‏.‏ يعني بذاك ابن رواحة قال فينا رسول الله يتلو كتابه إذا انشق معروف من الفجر ساطع أرانا الهدى بعد العمى فقلوبنا به موقنات أن ما قال واقع يبيت يجافي جنبه عن فراشه إذا استثقلت بالكافرين المضاجع تابعه عقيل عن الزهري‏.‏ وقال الزبيدي عن الزهري عن سعيد والأعرج عن أبي هريرة‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 6152,
			"arabicnumber": 6152,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وحدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن بن عوف، أنه سمع حسان بن ثابت الأنصاري، يستشهد أبا هريرة فيقول يا أبا هريرة نشدتك بالله هل سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ يا حسان أجب عن رسول الله، اللهم أيده بروح القدس ‏\"‏‏.‏ قال أبو هريرة نعم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 6153,
			"arabicnumber": 6153,
			"text": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عدي بن ثابت، عن البراء ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم قال لحسان ‏ \"‏ اهجهم ـ أو قال هاجهم ـ وجبريل معك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 6154,
			"arabicnumber": 6154,
			"text": "حدثنا عبيد الله بن موسى، أخبرنا حنظلة، عن سالم، عن ابن عمر ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ لأن يمتلئ جوف أحدكم قيحا خير له من أن يمتلئ شعرا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 6155,
			"arabicnumber": 6155,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال سمعت أبا صالح، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لأن يمتلئ جوف رجل قيحا يريه خير من أن يمتلئ شعرا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 6156,
			"arabicnumber": 6156,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة، قالت إن أفلح أخا أبي القعيس استأذن على بعد ما نزل الحجاب فقلت والله لا آذن له حتى أستأذن رسول الله صلى الله عليه وسلم فإن أخا أبي القعيس ليس هو أرضعني، ولكن أرضعتني امرأة أبي القعيس‏.‏ فدخل على رسول الله صلى الله عليه وسلم فقلت يا رسول الله إن الرجل ليس هو أرضعني، ولكن أرضعتني امرأته‏.‏ قال ‏ \"‏ ائذني له، فإنه عمك، تربت يمينك ‏\"‏‏.‏ قال عروة فبذلك كانت عائشة تقول حرموا من الرضاعة ما يحرم من النسب‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 6157,
			"arabicnumber": 6157,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا الحكم، عن إبراهيم، عن الأسود، عن عائشة ـ رضى الله عنها ـ قالت أراد النبي صلى الله عليه وسلم أن ينفر فرأى صفية على باب خبائها كئيبة حزينة لأنها حاضت فقال ‏\"‏ عقرى حلقى ـ لغة قريش ـ إنك لحابستنا ‏\"‏ ثم قال ‏\"‏ أكنت أفضت يوم النحر ‏\"‏‏.‏ يعني الطواف قالت نعم‏.‏ قال ‏\"‏ فانفري إذا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 6158,
			"arabicnumber": 6158,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل، وفاطمة ابنته تستره، فسلمت عليه، فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ بنت أبي طالب‏.‏ فقال ‏\"‏ مرحبا بأم هانئ ‏\"‏‏.‏ فلما فرغ من غسله قام فصلى ثماني ركعات، ملتحفا في ثوب واحد، فلما انصرف قلت يا رسول الله زعم ابن أمي أنه قاتل رجلا قد أجرته فلان بن هبيرة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أجرنا من أجرت يا أم هانئ ‏\"‏‏.‏ قالت أم هانئ وذاك ضحى‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 6159,
			"arabicnumber": 6159,
			"text": "حدثنا موسى بن إسماعيل، حدثنا همام، عن قتادة، عن أنس ـ رضى الله عنه أن النبي صلى الله عليه وسلم رأى رجلا يسوق بدنة فقال ‏\"‏ اركبها ‏\"‏‏.‏ قال إنها بدنة‏.‏ قال ‏\"‏ اركبها ‏\"‏‏.‏ قال إنها بدنة‏.‏ قال ‏\"‏ اركبها ويلك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 6160,
			"arabicnumber": 6160,
			"text": "حدثنا قتيبة بن سعيد، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم رأى رجلا يسوق بدنة فقال له ‏\"‏ اركبها ‏\"‏‏.‏ قال يا رسول الله إنها بدنة‏.‏ قال ‏\"‏ اركبها ويلك ‏\"‏‏.‏ في الثانية أو في الثالثة‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 6161,
			"arabicnumber": 6161,
			"text": "حدثنا مسدد، حدثنا حماد، عن ثابت البناني، عن أنس بن مالك،‏.‏ وأيوب عن أبي قلابة، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم في سفر، وكان معه غلام له أسود، يقال له أنجشة، يحدو، فقال له رسول الله صلى الله عليه وسلم ‏ \"‏ ويحك يا أنجشة رويدك بالقوارير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 6162,
			"arabicnumber": 6162,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن خالد، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال أثنى رجل على رجل عند النبي صلى الله عليه وسلم فقال ‏ \"‏ ويلك قطعت عنق أخيك ـ ثلاثا ـ من كان منكم مادحا لا محالة فليقل أحسب فلانا ـ والله حسيبه ـ ولا أزكي على الله أحدا‏.‏ إن كان يعلم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 6163,
			"arabicnumber": 6163,
			"text": "حدثني عبد الرحمن بن إبراهيم، حدثنا الوليد، عن الأوزاعي، عن الزهري، عن أبي سلمة، والضحاك، عن أبي سعيد الخدري، قال بينا النبي صلى الله عليه وسلم يقسم ذات يوم قسما فقال ذو الخويصرة ـ رجل من بني تميم ـ يا رسول الله اعدل‏.‏ قال ‏\"‏ ويلك من يعدل إذا لم أعدل ‏\"‏‏.‏ فقال عمر ائذن لي فلأضرب عنقه‏.‏ قال ‏\"‏ لا، إن له أصحابا يحقر أحدكم صلاته مع صلاتهم، وصيامه مع صيامهم، يمرقون من الدين كمروق السهم من الرمية، ينظر إلى نصله فلا يوجد فيه شىء، ثم ينظر إلى رصافه فلا يوجد فيه شىء، ثم ينظر إلى نضيه فلا يوجد فيه شىء، ثم ينظر إلى قذذه فلا يوجد فيه شىء، سبق الفرث والدم، يخرجون على حين فرقة من الناس، آيتهم رجل إحدى يديه مثل ثدى المرأة، أو مثل البضعة تدردر ‏\"‏‏.‏ قال أبو سعيد أشهد لسمعته من النبي صلى الله عليه وسلم وأشهد أني كنت مع علي حين قاتلهم، فالتمس في القتلى، فأتي به على النعت الذي نعت النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 6164,
			"arabicnumber": 6164,
			"text": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة ـ رضى الله عنه أن رجلا، أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله هلكت‏.‏ قال ‏\"‏ ويحك ‏\"‏‏.‏ قال وقعت على أهلي في رمضان‏.‏ قال ‏\"‏ أعتق رقبة ‏\"‏‏.‏ قال ما أجدها‏.‏ قال ‏\"‏ فصم شهرين متتابعين ‏\"‏‏.‏ قال لا أستطيع‏.‏ قال ‏\"‏ فأطعم ستين مسكينا ‏\"‏‏.‏ قال ما أجد‏.‏ فأتي بعرق فقال ‏\"‏ خذه فتصدق به ‏\"‏‏.‏ فقال يا رسول الله أعلى غير أهلي فوالذي نفسي بيده ما بين طنبى المدينة أحوج مني‏.‏ فضحك النبي صلى الله عليه وسلم حتى بدت أنيابه قال ‏\"‏ خذه ‏\"‏‏.‏ تابعه يونس عن الزهري‏.‏ وقال عبد الرحمن بن خالد عن الزهري ويلك‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 6165,
			"arabicnumber": 6165,
			"text": "حدثنا سليمان بن عبد الرحمن، حدثنا الوليد، حدثنا أبو عمرو الأوزاعي، قال حدثني ابن شهاب الزهري، عن عطاء بن يزيد الليثي، عن أبي سعيد الخدري ـ رضى الله عنه أن أعرابيا قال يا رسول الله أخبرني عن الهجرة‏.‏ فقال ‏\"‏ ويحك إن شأن الهجرة شديد، فهل لك من إبل ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فهل تؤدي صدقتها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فاعمل من وراء البحار، فإن الله لن يترك من عملك شيئا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 6166,
			"arabicnumber": 6166,
			"text": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا شعبة، عن واقد بن محمد بن زيد، سمعت أبي، عن ابن عمر ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ويلكم ـ أو ويحكم قال شعبة شك هو ـ لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏ وقال النضر عن شعبة ويحكم‏.‏ وقال عمر بن محمد عن أبيه ويلكم أو ويحكم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 6167,
			"arabicnumber": 6167,
			"text": "حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، عن أنس، أن رجلا، من أهل البادية أتى النبي صلى الله عليه وسلم فقال يا رسول الله متى الساعة قائمة قال ‏\"‏ ويلك وما أعددت لها ‏\"‏‏.‏ قال ما أعددت لها إلا أني أحب الله ورسوله‏.‏ قال ‏\"‏ إنك مع من أحببت ‏\"‏‏.‏ فقلنا ونحن كذلك‏.‏ قال ‏\"‏ نعم ‏\"‏‏.‏ ففرحنا يومئذ فرحا شديدا، فمر غلام للمغيرة وكان من أقراني فقال ‏\"‏ إن أخر هذا فلن يدركه الهرم حتى تقوم الساعة ‏\"‏‏.‏ واختصره شعبة عن قتادة سمعت أنسا عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 6168,
			"arabicnumber": 6168,
			"text": "حدثنا بشر بن خالد، حدثنا محمد بن جعفر، عن شعبة، عن سليمان، عن أبي وائل، عن عبد الله، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ المرء مع من أحب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 6169,
			"arabicnumber": 6169,
			"text": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن الأعمش، عن أبي وائل، قال قال عبد الله بن مسعود ـ رضى الله عنه جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله كيف تقول في رجل أحب قوما ولم يلحق بهم فقال رسول الله صلى الله عليه وسلم ‏ \"‏ المرء مع من أحب ‏\"‏‏.‏ تابعه جرير بن حازم وسليمان بن قرم وأبو عوانة عن الأعمش عن أبي وائل عن عبد الله عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 6170,
			"arabicnumber": 6170,
			"text": "حدثنا أبو نعيم، حدثنا سفيان، عن الأعمش، عن أبي وائل، عن أبي موسى، قال قيل للنبي صلى الله عليه وسلم الرجل يحب القوم ولما يلحق بهم قال ‏ \"‏ المرء مع من أحب ‏\"‏‏.‏ تابعه أبو معاوية ومحمد بن عبيد‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 6171,
			"arabicnumber": 6171,
			"text": "حدثنا عبدان، أخبرنا أبي، عن شعبة، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن أنس بن مالك، أن رجلا، سأل النبي صلى الله عليه وسلم متى الساعة يا رسول الله قال ‏\"‏ ما أعددت لها ‏\"‏‏.‏ قال ما أعددت لها من كثير صلاة ولا صوم ولا صدقة، ولكني أحب الله ورسوله‏.‏ قال ‏\"‏ أنت مع من أحببت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 6172,
			"arabicnumber": 6172,
			"text": "حدثنا أبو الوليد، حدثنا سلم بن زرير، سمعت أبا رجاء، سمعت ابن عباس ـ رضى الله عنهما ـ قال رسول الله صلى الله عليه وسلم لابن صائد ‏\"‏ قد خبأت لك خبيئا فما هو ‏\"‏‏.‏ قال الدخ‏.‏ قال ‏\"‏ اخسأ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 6175,
			"arabicnumber": 6175,
			"text": "",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 6176,
			"arabicnumber": 6176,
			"text": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا أبو التياح، عن أبي جمرة، عن ابن عباس ـ رضى الله عنهما ـ قال لما قدم وفد عبد القيس على النبي صلى الله عليه وسلم قال ‏\"‏ مرحبا بالوفد الذين جاءوا غير خزايا ولا ندامى ‏\"‏‏.‏ فقالوا يا رسول الله إنا حى من ربيعة وبيننا وبينك مضر، وإنا لا نصل إليك إلا في الشهر الحرام، فمرنا بأمر فصل ندخل به الجنة، وندعو به من وراءنا‏.‏ فقال ‏\"‏ أربع وأربع أقيموا الصلاة، وآتوا الزكاة، وصوم رمضان، وأعطوا خمس ما غنمتم، ولا تشربوا في الدباء، والحنتم، والنقير، والمزفت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 6177,
			"arabicnumber": 6177,
			"text": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ الغادر يرفع له لواء يوم القيامة، يقال هذه غدرة فلان بن فلان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 6178,
			"arabicnumber": 6178,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الغادر ينصب له لواء يوم القيامة، فيقال هذه غدرة فلان بن فلان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 6179,
			"arabicnumber": 6179,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يقولن أحدكم خبثت نفسي‏.‏ ولكن ليقل لقست نفسي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 6180,
			"arabicnumber": 6180,
			"text": "حدثنا عبدان، أخبرنا عبد الله، عن يونس، عن الزهري، عن أبي أمامة بن سهل، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يقولن أحدكم خبثت نفسي، ولكن ليقل لقست نفسي ‏\"‏‏.‏ تابعه عقيل‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 6181,
			"arabicnumber": 6181,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن يونس، عن ابن شهاب، أخبرني أبو سلمة، قال قال أبو هريرة ـ رضى الله عنه ـ قال رسول الله صلى الله عليه وسلم ‏ \"‏ قال الله يسب بنو آدم الدهر، وأنا الدهر، بيدي الليل والنهار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 6182,
			"arabicnumber": 6182,
			"text": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا تسموا العنب الكرم، ولا تقولوا خيبة الدهر‏.‏ فإن الله هو الدهر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 6183,
			"arabicnumber": 6183,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ويقولون الكرم، إنما الكرم قلب المؤمن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 6184,
			"arabicnumber": 6184,
			"text": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثني سعد بن إبراهيم، عن عبد الله بن شداد، عن علي ـ رضى الله عنه ـ قال ما سمعت رسول الله صلى الله عليه وسلم يفدي أحدا غير سعد، سمعته يقول ‏ \"‏ ارم فداك أبي وأمي ‏\"‏‏.‏ أظنه يوم أحد‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 6185,
			"arabicnumber": 6185,
			"text": "حدثنا علي بن عبد الله، حدثنا بشر بن المفضل، حدثنا يحيى بن أبي إسحاق، عن أنس بن مالك، أنه أقبل هو وأبو طلحة مع النبي صلى الله عليه وسلم ومع النبي صلى الله عليه وسلم صفية، مردفها على راحلته، فلما كانوا ببعض الطريق عثرت الناقة، فصرع النبي صلى الله عليه وسلم والمرأة، وأن أبا طلحة ـ قال أحسب ـ اقتحم عن بعيره، فأتى رسول الله صلى الله عليه وسلم فقال يا نبي الله جعلني الله فداك، هل أصابك من شىء‏.‏ قال ‏\"‏ لا ولكن عليك بالمرأة ‏\"‏‏.‏ فألقى أبو طلحة ثوبه على وجهه فقصد قصدها، فألقى ثوبه عليها فقامت المرأة، فشد لهما على راحلتهما فركبا، فساروا حتى إذا كانوا بظهر المدينة ـ أو قال أشرفوا على المدينة ـ قال النبي صلى الله عليه وسلم ‏\"‏ آيبون تائبون، عابدون لربنا حامدون ‏\"‏‏.‏ فلم يزل يقولها حتى دخل المدينة‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 6186,
			"arabicnumber": 6186,
			"text": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، حدثنا ابن المنكدر، عن جابر ـ رضى الله عنه ـ قال ولد لرجل منا غلام فسماه القاسم فقلنا لا نكنيك أبا القاسم ولا كرامة‏.‏ فأخبر النبي صلى الله عليه وسلم فقال ‏ \"‏ سم ابنك عبد الرحمن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 6187,
			"arabicnumber": 6187,
			"text": "حدثنا مسدد، حدثنا خالد، حدثنا حصين، عن سالم، عن جابر ـ رضى الله عنه ـ قال ولد لرجل منا غلام فسماه القاسم فقالوا لا نكنيه حتى نسأل النبي صلى الله عليه وسلم فقال ‏ \"‏ سموا باسمي، ولا تكتنوا بكنيتي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 6188,
			"arabicnumber": 6188,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن أيوب، عن ابن سيرين، سمعت أبا هريرة، قال أبو القاسم صلى الله عليه وسلم ‏ \"‏ سموا باسمي، ولا تكتنوا بكنيتي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 6189,
			"arabicnumber": 6189,
			"text": "حدثنا عبد الله بن محمد، حدثنا سفيان، قال سمعت ابن المنكدر، قال سمعت جابر بن عبد الله ـ رضى الله عنهما ولد لرجل منا غلام فسماه القاسم فقالوا لا نكنيك بأبي القاسم، ولا ننعمك عينا‏.‏ فأتى النبي صلى الله عليه وسلم فذكر ذلك له فقال ‏ \"‏ أسم ابنك عبد الرحمن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 6190,
			"arabicnumber": 6190,
			"text": "حدثنا إسحاق بن نصر، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن ابن المسيب، عن أبيه، أن أباه، جاء إلى النبي صلى الله عليه وسلم فقال ‏\"‏ ما اسمك ‏\"‏‏.‏ قال حزن‏.‏ قال ‏\"‏ أنت سهل ‏\"‏‏.‏ قال لا أغير اسما سمانيه أبي‏.‏ قال ابن المسيب فما زالت الحزونة فينا بعد‏.‏ حدثنا علي بن عبد الله، ومحمود، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن ابن المسيب، عن أبيه، عن جده، بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 6191,
			"arabicnumber": 6191,
			"text": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، قال أتي بالمنذر بن أبي أسيد إلى النبي صلى الله عليه وسلم حين ولد، فوضعه على فخذه وأبو أسيد جالس، فلها النبي صلى الله عليه وسلم بشىء بين يديه، فأمر أبو أسيد بابنه فاحتمل من فخذ النبي صلى الله عليه وسلم فاستفاق النبي صلى الله عليه وسلم فقال ‏\"‏ أين الصبي ‏\"‏‏.‏ فقال أبو أسيد قلبناه يا رسول الله‏.‏ قال ‏\"‏ ما اسمه ‏\"‏‏.‏ قال فلان‏.‏ قال ‏\"‏ ولكن أسمه المنذر ‏\"‏‏.‏ فسماه يومئذ المنذر‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 6192,
			"arabicnumber": 6192,
			"text": "حدثنا صدقة بن الفضل، أخبرنا محمد بن جعفر، عن شعبة، عن عطاء بن أبي ميمونة، عن أبي رافع، عن أبي هريرة، أن زينب، كان اسمها برة، فقيل تزكي نفسها‏.‏ فسماها رسول الله صلى الله عليه وسلم زينب‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 6193,
			"arabicnumber": 6193,
			"text": "حدثنا إبراهيم بن موسى، حدثنا هشام، أن ابن جريج، أخبرهم قال أخبرني عبد الحميد بن جبير بن شيبة، قال جلست إلى سعيد بن المسيب فحدثني أن جده حزنا قدم على النبي صلى الله عليه وسلم‏.‏ فقال ‏\"‏ ما اسمك ‏\"‏‏.‏ قال اسمي حزن‏.‏ قال ‏\"‏ بل أنت سهل ‏\"‏‏.‏ قال ما أنا بمغير اسما سمانيه أبي‏.‏ قال ابن المسيب فما زالت فينا الحزونة بعد‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 6194,
			"arabicnumber": 6194,
			"text": "حدثنا ابن نمير، حدثنا محمد بن بشر، حدثنا إسماعيل، قلت لابن أبي أوفى رأيت إبراهيم ابن النبي صلى الله عليه وسلم قال مات صغيرا، ولو قضي أن يكون بعد محمد صلى الله عليه وسلم نبي عاش ابنه، ولكن لا نبي بعده‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 6195,
			"arabicnumber": 6195,
			"text": "حدثنا سليمان بن حرب، أخبرنا شعبة، عن عدي بن ثابت، قال سمعت البراء، قال لما مات إبراهيم ـ عليه السلام ـ قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن له مرضعا في الجنة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 6196,
			"arabicnumber": 6196,
			"text": "حدثنا آدم، حدثنا شعبة، عن حصين بن عبد الرحمن، عن سالم بن أبي الجعد، عن جابر بن عبد الله الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ سموا باسمي، ولا تكتنوا بكنيتي، فإنما أنا قاسم أقسم بينكم ‏\"‏‏.‏ ورواه أنس عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 6197,
			"arabicnumber": 6197,
			"text": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا أبو حصين، عن أبي صالح، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ سموا باسمي ولا تكتنوا بكنيتي، ومن رآني في المنام فقد رآني، فإن الشيطان لا يتمثل صورتي، ومن كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 6198,
			"arabicnumber": 6198,
			"text": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى، قال ولد لي غلام، فأتيت به النبي صلى الله عليه وسلم فسماه إبراهيم، فحنكه بتمرة، ودعا له بالبركة، ودفعه إلى، وكان أكبر ولد أبي موسى‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 6199,
			"arabicnumber": 6199,
			"text": "حدثنا أبو الوليد، حدثنا زائدة، حدثنا زياد بن علاقة، سمعت المغيرة بن شعبة، قال انكسفت الشمس يوم مات إبراهيم‏.‏ رواه أبو بكرة عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 6200,
			"arabicnumber": 6200,
			"text": "أخبرنا أبو نعيم الفضل بن دكين، حدثنا ابن عيينة، عن الزهري، عن سعيد، عن أبي هريرة، قال لما رفع النبي صلى الله عليه وسلم رأسه من الركعة قال ‏ \"‏ اللهم أنج الوليد بن الوليد، وسلمة بن هشام، وعياش بن أبي ربيعة، والمستضعفين بمكة، اللهم اشدد وطأتك على مضر، اللهم اجعلها عليهم سنين كسني يوسف ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 6201,
			"arabicnumber": 6201,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني أبو سلمة بن عبد الرحمن، أن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ يا عائش هذا جبريل يقرئك السلام ‏\"‏‏.‏ قلت وعليه السلام ورحمة الله‏.‏ قالت وهو يرى ما لا نرى‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 6202,
			"arabicnumber": 6202,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا أيوب، عن أبي قلابة، عن أنس ـ رضى الله عنه ـ قال كانت أم سليم في الثقل وأنجشة غلام النبي صلى الله عليه وسلم يسوق بهن، فقال النبي صلى الله عليه وسلم ‏ \"‏ يا أنجش، رويدك، سوقك بالقوارير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 6203,
			"arabicnumber": 6203,
			"text": "حدثنا مسدد، حدثنا عبد الوارث، عن أبي التياح، عن أنس، قال كان النبي صلى الله عليه وسلم أحسن الناس خلقا، وكان لي أخ يقال له أبو عمير ـ قال أحسبه فطيم ـ وكان إذا جاء قال ‏ \"‏ يا أبا عمير ما فعل النغير ‏\"‏‏.‏ نغر كان يلعب به، فربما حضر الصلاة وهو في بيتنا، فيأمر بالبساط الذي تحته فيكنس وينضح، ثم يقوم ونقوم خلفه فيصلي بنا‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 6204,
			"arabicnumber": 6204,
			"text": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني أبو حازم، عن سهل بن سعد، قال إن كانت أحب أسماء علي ـ رضى الله عنه ـ إليه لأبو تراب، وإن كان ليفرح أن يدعى بها، وما سماه أبو تراب إلا النبي صلى الله عليه وسلم غاضب يوما فاطمة فخرج فاضطجع إلى الجدار إلى المسجد، فجاءه النبي صلى الله عليه وسلم يتبعه، فقال هو ذا مضطجع في الجدار فجاءه النبي صلى الله عليه وسلم وامتلأ ظهره ترابا، فجعل النبي صلى الله عليه وسلم يمسح التراب عن ظهره يقول ‏ \"‏ اجلس يا أبا تراب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 6205,
			"arabicnumber": 6205,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أخنى الأسماء يوم القيامة عند الله رجل تسمى ملك الأملاك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 6206,
			"arabicnumber": 6206,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، رواية قال ‏ \"‏ أخنع اسم عند الله ـ وقال سفيان غير مرة أخنع الأسماء عند الله ـ رجل تسمى بملك الأملاك ‏\"‏‏.‏ قال سفيان يقول غيره تفسيره شاهان شاه‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 6207,
			"arabicnumber": 6207,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عروة بن الزبير، أن أسامة بن زيد ـ رضى الله عنهما ـ أخبره أن رسول الله صلى الله عليه وسلم ركب على حمار عليه قطيفة فدكية وأسامة وراءه، يعود سعد بن عبادة في بني حارث بن الخزرج قبل وقعة بدر، فسارا حتى مرا بمجلس فيه عبد الله بن أبى ابن سلول، وذلك قبل أن يسلم عبد الله بن أبى، فإذا في المجلس أخلاط من المسلمين والمشركين عبدة الأوثان واليهود، وفي المسلمين عبد الله بن رواحة، فلما غشيت المجلس عجاجة الدابة خمر ابن أبى أنفه بردائه وقال لا تغبروا علينا‏.‏ فسلم رسول الله صلى الله عليه وسلم عليهم، ثم وقف فنزل فدعاهم إلى الله وقرأ عليهم القرآن، فقال له عبد الله بن أبى ابن سلول أيها المرء لا أحسن مما تقول إن كان حقا، فلا تؤذنا به في مجالسنا، فمن جاءك فاقصص عليه‏.‏ قال عبد الله بن رواحة بلى يا رسول الله فاغشنا في مجالسنا فإنا نحب ذلك‏.‏ فاستب المسلمون والمشركون واليهود حتى كادوا يتثاورون فلم يزل رسول الله صلى الله عليه وسلم يخفضهم حتى سكتوا، ثم ركب رسول الله صلى الله عليه وسلم دابته فسار حتى دخل على سعد بن عبادة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ أى سعد ألم تسمع ما قال أبو حباب ـ يريد عبد الله بن أبى ـ قال كذا وكذا ‏\"‏‏.‏ فقال سعد بن عبادة أى رسول الله بأبي أنت، اعف عنه واصفح، فوالذي أنزل عليك الكتاب لقد جاء الله بالحق الذي أنزل عليك، ولقد اصطلح أهل هذه البحرة على أن يتوجوه ويعصبوه بالعصابة، فلما رد الله ذلك بالحق الذي أعطاك شرق بذلك فذلك فعل به ما رأيت‏.‏ فعفا عنه رسول الله صلى الله عليه وسلم وكان رسول الله صلى الله عليه وسلم وأصحابه يعفون عن المشركين وأهل الكتاب كما أمرهم الله، ويصبرون على الأذى، قال الله تعالى ‏{‏ولتسمعن من الذين أوتوا الكتاب‏}‏ الآية، وقال ‏{‏ود كثير من أهل الكتاب‏}‏ فكان رسول الله صلى الله عليه وسلم يتأول في العفو عنهم ما أمره الله به حتى أذن له فيهم، فلما غزا رسول الله صلى الله عليه وسلم بدرا، فقتل الله بها من قتل من صناديد الكفار، وسادة قريش، فقفل رسول الله صلى الله عليه وسلم وأصحابه منصورين غانمين معهم أسارى من صناديد الكفار وسادة قريش قال ابن أبى ابن سلول، ومن معه من المشركين عبدة الأوثان هذا أمر قد توجه فبايعوا رسول الله صلى الله عليه وسلم على الإسلام فأسلموا‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 6208,
			"arabicnumber": 6208,
			"text": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عبد الملك، عن عبد الله بن الحارث بن نوفل، عن عباس بن عبد المطلب، قال يا رسول الله هل نفعت أبا طالب بشىء، فإنه كان يحوطك ويغضب لك قال ‏ \"‏ نعم هو في ضحضاح من نار، لولا أنا لكان في الدرك الأسفل من النار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 6209,
			"arabicnumber": 6209,
			"text": "حدثنا آدم، حدثنا شعبة، عن ثابت البناني، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم في مسير له فحدا الحادي، فقال النبي صلى الله عليه وسلم ‏ \"‏ ارفق يا أنجشة، ويحك، بالقوارير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 6210,
			"arabicnumber": 6210,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد، عن ثابت، عن أنس، وأيوب، عن أبي قلابة، عن أنس ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم كان في سفر، وكان غلام يحدو بهن يقال له أنجشة، فقال النبي صلى الله عليه وسلم ‏ \"‏ رويدك يا أنجشة، سوقك بالقوارير ‏\"‏‏.‏ قال أبو قلابة يعني النساء‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 6211,
			"arabicnumber": 6211,
			"text": "حدثنا إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، قال كان للنبي صلى الله عليه وسلم حاد يقال له أنجشة، وكان حسن الصوت، فقال له النبي صلى الله عليه وسلم ‏ \"‏ رويدك يا أنجشة، لا تكسر القوارير ‏\"‏‏.‏ قال قتادة يعني ضعفة النساء‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 6212,
			"arabicnumber": 6212,
			"text": "حدثنا مسدد، حدثنا يحيى، عن شعبة، قال حدثني قتادة، عن أنس بن مالك، قال كان بالمدينة فزع فركب رسول الله صلى الله عليه وسلم فرسا لأبي طلحة فقال ‏ \"‏ ما رأينا من شىء، وإن وجدناه لبحرا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 6213,
			"arabicnumber": 6213,
			"text": "حدثنا محمد بن سلام، أخبرنا مخلد بن يزيد، أخبرنا ابن جريج، قال ابن شهاب أخبرني يحيى بن عروة، أنه سمع عروة، يقول قالت عائشة سأل أناس رسول الله صلى الله عليه وسلم عن الكهان فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ليسوا بشىء ‏\"‏‏.‏ قالوا يا رسول الله فإنهم يحدثون أحيانا بالشىء يكون حقا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ تلك الكلمة من الحق يخطفها الجني، فيقرها في أذن وليه قر الدجاجة، فيخلطون فيها أكثر من مائة كذبة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 6214,
			"arabicnumber": 6214,
			"text": "حدثنا ابن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال سمعت أبا سلمة بن عبد الرحمن، يقول أخبرني جابر بن عبد الله، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ثم فتر عني الوحى، فبينا أنا أمشي سمعت صوتا من السماء، فرفعت بصري إلى السماء فإذا الملك الذي جاءني بحراء قاعد على كرسي بين السماء والأرض ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 6215,
			"arabicnumber": 6215,
			"text": "حدثنا ابن أبي مريم، حدثنا محمد بن جعفر، قال أخبرني شريك، عن كريب، عن ابن عباس ـ رضى الله عنهما ـ قال بت في بيت ميمونة والنبي صلى الله عليه وسلم عندها، فلما كان ثلث الليل الآخر أو بعضه قعد فنظر إلى السماء فقرأ ‏{‏إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 6216,
			"arabicnumber": 6216,
			"text": "حدثنا مسدد، حدثنا يحيى، عن عثمان بن غياث، حدثنا أبو عثمان، عن أبي موسى، أنه كان مع النبي صلى الله عليه وسلم في حائط من حيطان المدينة، وفي يد النبي صلى الله عليه وسلم عود يضرب به بين الماء والطين، فجاء رجل يستفتح، فقال النبي صلى الله عليه وسلم ‏\"‏ افتح له وبشره بالجنة ‏\"‏‏.‏ فذهبت فإذا أبو بكر، ففتحت له وبشرته بالجنة، ثم استفتح رجل آخر فقال ‏\"‏ افتح له وبشره بالجنة ‏\"‏‏.‏ فإذا عمر، ففتحت له وبشرته بالجنة، ثم استفتح رجل آخر، وكان متكئا فجلس فقال ‏\"‏ افتح ‏{‏له‏}‏ وبشره بالجنة، على بلوى تصيبه أو تكون ‏\"‏‏.‏ فذهبت فإذا عثمان، ففتحت له، وبشرته بالجنة، فأخبرته بالذي قال‏.‏ قال الله المستعان‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 6217,
			"arabicnumber": 6217,
			"text": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن سليمان، ومنصور، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، عن علي ـ رضى الله عنه ـ قال كنا مع النبي صلى الله عليه وسلم في جنازة فجعل ينكت الأرض بعود، فقال ‏\"‏ ليس منكم من أحد إلا وقد فرغ من مقعده من الجنة والنار ‏\"‏‏.‏ فقالوا أفلا نتكل قال ‏\"‏ اعملوا فكل ميسر ‏\"‏‏.‏ ‏{‏فأما من أعطى واتقى‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 6218,
			"arabicnumber": 6218,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثتني هند بنت الحارث، أن أم سلمة ـ رضى الله عنها ـ قالت استيقظ النبي صلى الله عليه وسلم فقال ‏\"‏ سبحان الله ماذا أنزل من الخزائن، وماذا أنزل من الفتن، من يوقظ صواحب الحجر ـ يريد به أزواجه ـ حتى يصلين، رب كاسية في الدنيا، عارية في الآخرة ‏\"‏‏.‏ وقال ابن أبي ثور عن ابن عباس، عن عمر، قال قلت للنبي صلى الله عليه وسلم طلقت نساءك قال ‏\"‏ لا ‏\"‏‏.‏ قلت الله أكبر‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 6219,
			"arabicnumber": 6219,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وحدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن علي بن الحسين، أن صفية بنت حيى، زوج النبي صلى الله عليه وسلم أخبرته أنها جاءت رسول الله صلى الله عليه وسلم تزوره وهو معتكف في المسجد في العشر الغوابر من رمضان، فتحدثت عنده ساعة من العشاء ثم قامت تنقلب، فقام معها النبي صلى الله عليه وسلم يقلبها حتى إذا بلغت باب المسجد الذي عند مسكن أم سلمة زوج النبي صلى الله عليه وسلم مر بهما رجلان من الأنصار فسلما على رسول الله صلى الله عليه وسلم ثم نفذا، فقال لهما رسول الله صلى الله عليه وسلم ‏\"‏ على رسلكما، إنما هي صفية بنت حيى ‏\"‏‏.‏ قالا سبحان الله يا رسول الله‏.‏ وكبر عليهما‏.‏ قال ‏\"‏ إن الشيطان يجري من ابن آدم مبلغ الدم، وإني خشيت أن يقذف في قلوبكما ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 6220,
			"arabicnumber": 6220,
			"text": "حدثنا آدم، حدثنا شعبة، عن قتادة، قال سمعت عقبة بن صهبان الأزدي، يحدث عن عبد الله بن مغفل المزني، قال نهى النبي صلى الله عليه وسلم عن الخذف وقال ‏ \"‏ إنه لا يقتل الصيد، ولا ينكأ العدو، وإنه يفقأ العين، ويكسر السن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 6221,
			"arabicnumber": 6221,
			"text": "حدثنا محمد بن كثير، حدثنا سفيان، حدثنا سليمان، عن أنس بن مالك ـ رضى الله عنه ـ قال عطس رجلان عند النبي صلى الله عليه وسلم فشمت أحدهما ولم يشمت الآخر، فقيل له فقال ‏ \"‏ هذا حمد الله، وهذا لم يحمد الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 6222,
			"arabicnumber": 6222,
			"text": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الأشعث بن سليم، قال سمعت معاوية بن سويد بن مقرن، عن البراء ـ رضى الله عنه ـ قال أمرنا النبي صلى الله عليه وسلم بسبع، ونهانا عن سبع، أمرنا بعيادة المريض، واتباع الجنازة، وتشميت العاطس، وإجابة الداعي، ورد السلام، ونصر المظلوم، وإبرار المقسم، ونهانا عن سبع، عن خاتم الذهب ـ أو قال حلقة الذهب ـ وعن لبس الحرير، والديباج، والسندس، والمياثر‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 6223,
			"arabicnumber": 6223,
			"text": "حدثنا آدم بن أبي إياس، حدثنا ابن أبي ذئب، حدثنا سعيد المقبري، عن أبيه، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم ‏ \"‏ إن الله يحب العطاس، ويكره التثاؤب، فإذا عطس فحمد الله، فحق على كل مسلم سمعه أن يشمته، وأما التثاوب فإنما هو من الشيطان، فليرده ما استطاع، فإذا قال ها‏.‏ ضحك منه الشيطان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 6224,
			"arabicnumber": 6224,
			"text": "حدثنا مالك بن إسماعيل، حدثنا عبد العزيز بن أبي سلمة، أخبرنا عبد الله بن دينار، عن أبي صالح، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا عطس أحدكم فليقل الحمد لله‏.‏ وليقل له أخوه أو صاحبه يرحمك الله‏.‏ فإذا قال له يرحمك الله‏.‏ فليقل يهديكم الله ويصلح بالكم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 6225,
			"arabicnumber": 6225,
			"text": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا سليمان التيمي، قال سمعت أنسا ـ رضى الله عنه ـ يقول عطس رجلان عند النبي صلى الله عليه وسلم فشمت أحدهما ولم يشمت الآخر‏.‏ فقال الرجل يا رسول الله شمت هذا ولم تشمتني‏.‏ قال ‏ \"‏ إن هذا حمد الله، ولم تحمد الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 6226,
			"arabicnumber": 6226,
			"text": "حدثنا عاصم بن علي، حدثنا ابن أبي ذئب، عن سعيد المقبري، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الله يحب العطاس ويكره التثاؤب، فإذا عطس أحدكم وحمد الله كان حقا على كل مسلم سمعه أن يقول له يرحمك الله‏.‏ وأما التثاؤب فإنما هو من الشيطان، فإذا تثاوب أحدكم فليرده ما استطاع، فإن أحدكم إذا تثاءب ضحك منه الشيطان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 250
			}
		}
	]
}