{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6227,
			"arabicnumber": 6227,
			"text": "حدثنا يحيى بن جعفر، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ خلق الله آدم على صورته، طوله ستون ذراعا، فلما خلقه قال اذهب فسلم على أولئك النفر من الملائكة جلوس، فاستمع ما يحيونك، فإنها تحيتك وتحية ذريتك‏.‏ فقال السلام عليكم‏.‏ فقالوا السلام عليك ورحمة الله‏.‏ فزادوه ورحمة الله، فكل من يدخل الجنة على صورة آدم، فلم يزل الخلق ينقص بعد حتى الآن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6228,
			"arabicnumber": 6228,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني سليمان بن يسار، أخبرني عبد الله بن عباس ـ رضى الله عنهما ـ قال أردف رسول الله صلى الله عليه وسلم الفضل بن عباس يوم النحر خلفه على عجز راحلته، وكان الفضل رجلا وضيئا، فوقف النبي صلى الله عليه وسلم للناس يفتيهم، وأقبلت امرأة من خثعم وضيئة تستفتي رسول الله صلى الله عليه وسلم فطفق الفضل ينظر إليها، وأعجبه حسنها، فالتفت النبي صلى الله عليه وسلم ينظر إليها، فأخلف بيده فأخذ بذقن الفضل، فعدل وجهه عن النظر إليها، فقالت يا رسول الله إن فريضة الله في الحج على عباده أدركت أبي شيخا كبيرا، لا يستطيع أن يستوي على الراحلة، فهل يقضي عنه أن أحج عنه قال ‏ \"‏ نعم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6229,
			"arabicnumber": 6229,
			"text": "حدثنا عبد الله بن محمد، أخبرنا أبو عامر، حدثنا زهير، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري ـ رضى الله عنه أن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والجلوس بالطرقات ‏\"‏‏.‏ فقالوا يا رسول الله ما لنا من مجالسنا بد نتحدث فيها‏.‏ فقال ‏\"‏ إذا أبيتم إلا المجلس فأعطوا الطريق حقه ‏\"‏‏.‏ قالوا وما حق الطريق يا رسول الله قال ‏\"‏ غض البصر، وكف الأذى، ورد السلام، والأمر بالمعروف والنهى عن المنكر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6230,
			"arabicnumber": 6230,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني شقيق، عن عبد الله، قال كنا إذا صلينا مع النبي صلى الله عليه وسلم قلنا السلام على الله قبل عباده، السلام على جبريل، السلام على ميكائيل، السلام على فلان، فلما انصرف النبي صلى الله عليه وسلم أقبل علينا بوجهه فقال ‏ \"‏ إن الله هو السلام، فإذا جلس أحدكم في الصلاة فليقل التحيات لله، والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين‏.‏ فإنه إذا قال ذلك أصاب كل عبد صالح في السماء والأرض، أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله‏.‏ ثم يتخير بعد من الكلام ما شاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6231,
			"arabicnumber": 6231,
			"text": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ يسلم الصغير على الكبير، والمار على القاعد، والقليل على الكثير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6232,
			"arabicnumber": 6232,
			"text": "حدثنا محمد، أخبرنا مخلد، أخبرنا ابن جريج، قال أخبرني زياد، أنه سمع ثابتا، مولى عبد الرحمن بن زيد أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ يسلم الراكب على الماشي، والماشي على القاعد، والقليل على الكثير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6233,
			"arabicnumber": 6233,
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا روح بن عبادة، حدثنا ابن جريج، قال أخبرني زياد، أن ثابتا، أخبره ـ وهو، مولى عبد الرحمن بن زيد ـ عن أبي هريرة ـ رضى الله عنه ـ عن رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ يسلم الراكب على الماشي والماشي على القاعد، والقليل على الكثير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6234,
			"arabicnumber": 6234,
			"text": "وقال إبراهيم عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يسلم الصغير على الكبير، والمار على القاعد، والقليل على الكثير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6235,
			"arabicnumber": 6235,
			"text": "حدثنا قتيبة، حدثنا جرير، عن الشيباني، عن أشعث بن أبي الشعثاء، عن معاوية بن سويد بن مقرن، عن البراء بن عازب ـ رضى الله عنهما ـ قال أمرنا رسول الله صلى الله عليه وسلم بسبع بعيادة المريض، واتباع الجنائز، وتشميت العاطس، ونصر الضعيف، وعون المظلوم، وإفشاء السلام، وإبرار المقسم، ونهى عن الشرب في الفضة، ونهانا عن تختم الذهب، وعن ركوب المياثر، وعن لبس الحرير، والديباج، والقسي، والإستبرق‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6236,
			"arabicnumber": 6236,
			"text": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني يزيد، عن أبي الخير، عن عبد الله بن عمرو، أن رجلا، سأل النبي صلى الله عليه وسلم أى الإسلام خير قال ‏ \"‏ تطعم الطعام، وتقرأ السلام على من عرفت، وعلى من لم تعرف ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6237,
			"arabicnumber": 6237,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن الزهري، عن عطاء بن يزيد الليثي، عن أبي أيوب ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يحل لمسلم أن يهجر أخاه فوق ثلاث، يلتقيان فيصد هذا، ويصد هذا، وخيرهما الذي يبدأ بالسلام ‏\"‏‏.‏ وذكر سفيان أنه سمعه منه ثلاث مرات‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6238,
			"arabicnumber": 6238,
			"text": "حدثنا يحيى بن سليمان، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني أنس بن مالك، أنه كان ابن عشر سنين مقدم رسول الله صلى الله عليه وسلم المدينة، فخدمت رسول الله صلى الله عليه وسلم عشرا حياته، وكنت أعلم الناس بشأن الحجاب حين أنزل، وقد كان أبى بن كعب يسألني عنه، وكان أول ما نزل في مبتنى رسول الله صلى الله عليه وسلم بزينب ابنة جحش، أصبح النبي صلى الله عليه وسلم بها عروسا فدعا القوم، فأصابوا من الطعام ثم خرجوا، وبقي منهم رهط عند رسول الله صلى الله عليه وسلم فأطالوا المكث فقام رسول الله صلى الله عليه وسلم فخرج وخرجت معه كى يخرجوا، فمشى رسول الله صلى الله عليه وسلم ومشيت معه حتى جاء عتبة حجرة عائشة، ثم ظن رسول الله صلى الله عليه وسلم أنهم خرجوا فرجع ورجعت معه، حتى دخل على زينب فإذا هم جلوس لم يتفرقوا، فرجع رسول الله صلى الله عليه وسلم ورجعت معه، حتى بلغ عتبة حجرة عائشة، فظن أن قد خرجوا، فرجع ورجعت معه، فإذا هم قد خرجوا، فأنزل آية الحجاب، فضرب بيني وبينه سترا‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6239,
			"arabicnumber": 6239,
			"text": "حدثنا أبو النعمان، حدثنا معتمر، قال أبي حدثنا أبو مجلز، عن أنس ـ رضى الله عنه ـ قال لما تزوج النبي صلى الله عليه وسلم زينب دخل القوم فطعموا، ثم جلسوا يتحدثون فأخذ كأنه يتهيأ للقيام فلم يقوموا، فلما رأى ذلك قام، فلما قام قام من قام من القوم وقعد بقية القوم، وإن النبي صلى الله عليه وسلم جاء ليدخل، فإذا القوم جلوس، ثم إنهم قاموا فانطلقوا فأخبرت النبي صلى الله عليه وسلم فجاء حتى دخل، فذهبت أدخل فألقى الحجاب بيني وبينه، وأنزل الله تعالى ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي‏}‏ الآية‏.‏ قال أبو عبد الله فيه من الفقه أنه لم يستأذنهم حين قام وخرج وفيه أنه تهيأ للقيام وهو يريد أن يقوموا",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6240,
			"arabicnumber": 6240,
			"text": "حدثنا إسحاق، أخبرنا يعقوب، حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة ـ رضى الله عنها ـ زوج النبي صلى الله عليه وسلم قالت كان عمر بن الخطاب يقول لرسول الله صلى الله عليه وسلم احجب نساءك‏.‏ قالت فلم يفعل، وكان أزواج النبي صلى الله عليه وسلم يخرجن ليلا إلى ليل قبل المناصع، خرجت سودة بنت زمعة، وكانت امرأة طويلة فرآها عمر بن الخطاب وهو في المجلس فقال عرفتك يا سودة‏.‏ حرصا على أن ينزل الحجاب‏.‏ قالت فأنزل الله عز وجل آية الحجاب‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6241,
			"arabicnumber": 6241,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال الزهري حفظته كما أنك ها هنا عن سهل بن سعد قال اطلع رجل من جحر في حجر النبي صلى الله عليه وسلم ومع النبي صلى الله عليه وسلم مدرى يحك به رأسه فقال ‏ \"‏ لو أعلم أنك تنظر لطعنت به في عينك، إنما جعل الاستئذان من أجل البصر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6242,
			"arabicnumber": 6242,
			"text": "حدثنا مسدد، حدثنا حماد بن زيد، عن عبيد الله بن أبي بكر، عن أنس بن مالك، أن رجلا، اطلع من بعض حجر النبي صلى الله عليه وسلم فقام إليه النبي صلى الله عليه وسلم بمشقص ـ أو بمشاقص ـ فكأني أنظر إليه يختل الرجل ليطعنه‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6243,
			"arabicnumber": 6243,
			"text": "حدثنا الحميدي، حدثنا سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس ـ رضى الله عنهما ـ قال لم أر شيئا أشبه باللمم من قول أبي هريرة‏.‏ حدثني محمود أخبرنا عبد الرزاق أخبرنا معمر عن ابن طاوس عن أبيه عن ابن عباس قال ما رأيت شيئا أشبه باللمم مما قال أبو هريرة عن النبي صلى الله عليه وسلم ‏ \"‏ إن الله كتب على ابن آدم حظه من الزنا، أدرك ذلك لا محالة، فزنا العين النظر، وزنا اللسان المنطق، والنفس تمنى وتشتهي، والفرج يصدق ذلك كله ويكذبه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6244,
			"arabicnumber": 6244,
			"text": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا عبد الله بن المثنى، حدثنا ثمامة بن عبد الله، عن أنس ـ رضى الله عنه أن رسول الله صلى الله عليه وسلم كان إذا سلم سلم ثلاثا، وإذا تكلم بكلمة أعادها ثلاثا‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6245,
			"arabicnumber": 6245,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا يزيد بن خصيفة، عن بسر بن سعيد، عن أبي سعيد الخدري، قال كنت في مجلس من مجالس الأنصار إذ جاء أبو موسى كأنه مذعور فقال استأذنت على عمر ثلاثا، فلم يؤذن لي فرجعت فقال ما منعك قلت استأذنت ثلاثا، فلم يؤذن لي فرجعت، وقال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا استأذن أحدكم ثلاثا فلم يؤذن له، فليرجع ‏\"‏‏.‏ فقال والله لتقيمن عليه ببينة‏.‏ أمنكم أحد سمعه من النبي صلى الله عليه وسلم فقال أبى بن كعب والله لا يقوم معك إلا أصغر القوم، فكنت أصغر القوم، فقمت معه فأخبرت عمر أن النبي صلى الله عليه وسلم قال ذلك‏.‏ وقال ابن المبارك أخبرني ابن عيينة حدثني يزيد عن بسر سمعت أبا سعيد بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6246,
			"arabicnumber": 6246,
			"text": "حدثنا أبو نعيم، حدثنا عمر بن ذر،‏.‏ وحدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا عمر بن ذر، أخبرنا مجاهد، عن أبي هريرة ـ رضى الله عنه ـ قال دخلت مع رسول الله صلى الله عليه وسلم فوجد لبنا في قدح فقال ‏ \"‏ أبا هر الحق أهل الصفة فادعهم إلى ‏\"‏‏.‏ قال فأتيتهم فدعوتهم، فأقبلوا فاستأذنوا فأذن لهم، فدخلوا‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6247,
			"arabicnumber": 6247,
			"text": "حدثنا علي بن الجعد، أخبرنا شعبة، عن سيار، عن ثابت البناني، عن أنس بن مالك ـ رضى الله عنه أنه مر على صبيان فسلم عليهم وقال كان النبي صلى الله عليه وسلم يفعله‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6248,
			"arabicnumber": 6248,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا ابن أبي حازم، عن أبيه، عن سهل، قال كنا نفرح يوم الجمعة‏.‏ قلت ولم قال كانت لنا عجوز ترسل إلى بضاعة ـ قال ابن مسلمة نخل بالمدينة ـ فتأخذ من أصول السلق فتطرحه في قدر، وتكركر حبات من شعير، فإذا صلينا الجمعة انصرفنا ونسلم عليها فتقدمه إلينا، فنفرح من أجله، وما كنا نقيل ولا نتغدى إلا بعد الجمعة‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6249,
			"arabicnumber": 6249,
			"text": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن عائشة ـ رضى الله عنها ـ قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ يا عائشة هذا جبريل يقرأ عليك السلام ‏\"‏‏.‏ قالت قلت وعليه السلام ورحمة الله، ترى ما لا نرى‏.‏ تريد رسول الله صلى الله عليه وسلم‏.‏ تابعه شعيب‏.‏ وقال يونس والنعمان عن الزهري وبركاته‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6250,
			"arabicnumber": 6250,
			"text": "حدثنا أبو الوليد، هشام بن عبد الملك حدثنا شعبة، عن محمد بن المنكدر، قال سمعت جابرا ـ رضى الله عنه ـ يقول أتيت النبي صلى الله عليه وسلم في دين كان على أبي فدققت الباب فقال ‏\"‏ من ذا ‏\"‏‏.‏ فقلت أنا‏.‏ فقال ‏\"‏ أنا أنا ‏\"‏‏.‏ كأنه كرهها‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6251,
			"arabicnumber": 6251,
			"text": "حدثنا إسحاق بن منصور، أخبرنا عبد الله بن نمير، حدثنا عبيد الله، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة ـ رضى الله عنه أن رجلا، دخل المسجد ورسول الله صلى الله عليه وسلم جالس في ناحية المسجد فصلى، ثم جاء فسلم عليه فقال له رسول الله صلى الله عليه وسلم ‏\"‏ وعليك السلام ارجع فصل فإنك لم تصل ‏\"‏‏.‏ فرجع فصلى، ثم جاء فسلم‏.‏ فقال ‏\"‏ وعليك السلام فارجع فصل، فإنك لم تصل ‏\"‏‏.‏ فقال في الثانية أو في التي بعدها علمني يا رسول الله‏.‏ فقال ‏\"‏ إذا قمت إلى الصلاة فأسبغ الوضوء، ثم استقبل القبلة فكبر، ثم اقرأ بما تيسر معك من القرآن، ثم اركع حتى تطمئن راكعا، ثم ارفع حتى تستوي قائما، ثم اسجد حتى تطمئن ساجدا، ثم ارفع حتى تطمئن جالسا، ثم اسجد حتى تطمئن ساجدا، ثم ارفع حتى تطمئن جالسا، ثم افعل ذلك في صلاتك كلها ‏\"‏‏.‏ وقال أبو أسامة في الأخير ‏\"‏ حتى تستوي قائما ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6252,
			"arabicnumber": 6252,
			"text": "حدثنا ابن بشار، قال حدثني يحيى، عن عبيد الله، حدثني سعيد، عن أبيه، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏ \"‏ ثم ارفع حتى تطمئن جالسا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6253,
			"arabicnumber": 6253,
			"text": "حدثنا أبو نعيم، حدثنا زكرياء، قال سمعت عامرا، يقول حدثني أبو سلمة بن عبد الرحمن، أن عائشة ـ رضى الله عنها ـ حدثته أن النبي صلى الله عليه وسلم قال لها ‏ \"‏ إن جبريل يقرئك السلام ‏\"‏‏.‏ قالت وعليه السلام ورحمة الله‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6254,
			"arabicnumber": 6254,
			"text": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن الزهري، عن عروة بن الزبير، قال أخبرني أسامة بن زيد، أن النبي صلى الله عليه وسلم ركب حمارا عليه إكاف، تحته قطيفة فدكية، وأردف وراءه أسامة بن زيد وهو يعود سعد بن عبادة في بني الحارث بن الخزرج، وذلك قبل وقعة بدر حتى مر في مجلس فيه أخلاط من المسلمين والمشركين عبدة الأوثان واليهود، وفيهم عبد الله بن أبى ابن سلول، وفي المجلس عبد الله بن رواحة، فلما غشيت المجلس عجاجة الدابة خمر عبد الله بن أبى أنفه بردائه ثم قال لا تغبروا علينا‏.‏ فسلم عليهم النبي صلى الله عليه وسلم ثم وقف فنزل، فدعاهم إلى الله وقرأ عليهم القرآن فقال عبد الله بن أبى ابن سلول أيها المرء لا أحسن من هذا، إن كان ما تقول حقا، فلا تؤذنا في مجالسنا، وارجع إلى رحلك، فمن جاءك منا فاقصص عليه‏.‏ قال ابن رواحة اغشنا في مجالسنا، فإنا نحب ذلك‏.‏ فاستب المسلمون والمشركون واليهود حتى هموا أن يتواثبوا، فلم يزل النبي صلى الله عليه وسلم يخفضهم، ثم ركب دابته حتى دخل على سعد بن عبادة فقال ‏ \"‏ أى سعد ألم تسمع ما قال أبو حباب ‏\"‏‏.‏ يريد عبد الله بن أبى قال كذا وكذا قال اعف عنه يا رسول الله واصفح فوالله لقد أعطاك الله الذي أعطاك، ولقد اصطلح أهل هذه البحرة على أن يتوجوه فيعصبونه بالعصابة، فلما رد الله ذلك بالحق الذي أعطاك شرق بذلك، فذلك فعل به ما رأيت، فعفا عنه النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6255,
			"arabicnumber": 6255,
			"text": "حدثنا ابن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عبد الرحمن بن عبد الله، أن عبد الله بن كعب، قال سمعت كعب بن مالك، يحدث حين تخلف عن تبوك، ونهى، رسول الله صلى الله عليه وسلم عن كلامنا، وآتي رسول الله صلى الله عليه وسلم فأسلم عليه، فأقول في نفسي هل حرك شفتيه برد السلام أم لا حتى كملت خمسون ليلة، وآذن النبي صلى الله عليه وسلم بتوبة الله علينا حين صلى الفجر‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6256,
			"arabicnumber": 6256,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني عروة، أن عائشة ـ رضى الله عنها ـ قالت دخل رهط من اليهود على رسول الله صلى الله عليه وسلم فقالوا السام عليك‏.‏ ففهمتها فقلت عليكم السام واللعنة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ مهلا يا عائشة، فإن الله يحب الرفق في الأمر كله ‏\"‏‏.‏ فقلت يا رسول الله أولم تسمع ما قالوا قال رسول الله صلى الله عليه وسلم ‏\"‏ فقد قلت وعليكم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6257,
			"arabicnumber": 6257,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا سلم عليكم اليهود فإنما يقول أحدهم السام عليك‏.‏ فقل وعليك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6258,
			"arabicnumber": 6258,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا هشيم، أخبرنا عبيد الله بن أبي بكر بن أنس، حدثنا أنس بن مالك ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ إذا سلم عليكم أهل الكتاب فقولوا وعليكم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6259,
			"arabicnumber": 6259,
			"text": "حدثنا يوسف بن بهلول، حدثنا ابن إدريس، قال حدثني حصين بن عبد الرحمن، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، عن علي ـ رضى الله عنه ـ قال بعثني رسول الله صلى الله عليه وسلم والزبير بن العوام وأبا مرثد الغنوي وكلنا فارس فقال ‏\"‏ انطلقوا حتى تأتوا روضة خاخ، فإن بها امرأة من المشركين معها صحيفة من حاطب بن أبي بلتعة إلى المشركين ‏\"‏‏.‏ قال فأدركناها تسير على جمل لها حيث قال لنا رسول الله صلى الله عليه وسلم قال قلنا أين الكتاب الذي معك قالت ما معي كتاب‏.‏ فأنخنا بها، فابتغينا في رحلها فما وجدنا شيئا، قال صاحباى ما نرى كتابا‏.‏ قال قلت لقد علمت ما كذب رسول الله صلى الله عليه وسلم والذي يحلف به لتخرجن الكتاب أو لأجردنك‏.‏ قال فلما رأت الجد مني أهوت بيدها إلى حجزتها وهى محتجزة بكساء فأخرجت الكتاب ـ قال ـ فانطلقنا به إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما حملك يا حاطب على ما صنعت ‏\"‏‏.‏ قال ما بي إلا أن أكون مؤمنا بالله ورسوله، وما غيرت ولا بدلت، أردت أن تكون لي عند القوم يد يدفع الله بها عن أهلي ومالي، وليس من أصحابك هناك إلا وله من يدفع الله به عن أهله وماله‏.‏ قال ‏\"‏ صدق فلا تقولوا له إلا خيرا ‏\"‏‏.‏ قال فقال عمر بن الخطاب إنه قد خان الله ورسوله والمؤمنين، فدعني فأضرب عنقه‏.‏ قال فقال ‏\"‏ يا عمر وما يدريك لعل الله قد اطلع على أهل بدر فقال اعملوا ما شئتم فقد وجبت لكم الجنة ‏\"‏‏.‏ قال فدمعت عينا عمر وقال الله ورسوله أعلم‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6260,
			"arabicnumber": 6260,
			"text": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن عتبة، أن ابن عباس، أخبره أن أبا سفيان بن حرب أخبره أن هرقل أرسل إليه في نفر من قريش وكانوا تجارا بالشأم، فأتوه فذكر الحديث قال ثم دعا بكتاب رسول الله صلى الله عليه وسلم فقرئ فإذا فيه ‏ \"‏ بسم الله الرحمن الرحيم، من محمد عبد الله ورسوله إلى هرقل عظيم الروم، السلام على من اتبع الهدى، أما بعد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6261,
			"arabicnumber": 6261,
			"text": "وقال الليث حدثني جعفر بن ربيعة، عن عبد الرحمن بن هرمز، عن أبي هريرة ـ رضى الله عنه ـ عن رسول الله صلى الله عليه وسلم أنه ذكر رجلا من بني إسرائيل أخذ خشبة فنقرها، فأدخل فيها ألف دينار وصحيفة منه إلى صاحبه‏.‏ وقال عمر بن أبي سلمة عن أبيه سمع أبا هريرة قال النبي صلى الله عليه وسلم ‏ \"‏ نجر خشبة، فجعل المال في جوفها، وكتب إليه صحيفة من فلان إلى فلان ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6262,
			"arabicnumber": 6262,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي أمامة بن سهل بن حنيف، عن أبي سعيد، أن أهل، قريظة نزلوا على حكم سعد فأرسل النبي صلى الله عليه وسلم إليه فجاء فقال ‏\"‏ قوموا إلى سيدكم ‏\"‏‏.‏ أو قال ‏\"‏ خيركم ‏\"‏‏.‏ فقعد عند النبي صلى الله عليه وسلم فقال ‏\"‏ هؤلاء نزلوا على حكمك ‏\"‏‏.‏ قال فإني أحكم أن تقتل مقاتلتهم، وتسبى ذراريهم‏.‏ فقال ‏\"‏ لقد حكمت بما حكم به الملك ‏\"‏‏.‏ قال أبو عبد الله أفهمني بعض أصحابي عن أبي الوليد من قول أبي سعيد إلى حكمك‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6263,
			"arabicnumber": 6263,
			"text": "حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، قال قلت لأنس أكانت المصافحة في أصحاب النبي صلى الله عليه وسلم قال نعم‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6264,
			"arabicnumber": 6264,
			"text": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني حيوة، قال حدثني أبو عقيل، زهرة بن معبد سمع جده عبد الله بن هشام، قال كنا مع النبي صلى الله عليه وسلم وهو آخذ بيد عمر بن الخطاب‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6265,
			"arabicnumber": 6265,
			"text": "حدثنا أبو نعيم، حدثنا سيف، قال سمعت مجاهدا، يقول حدثني عبد الله بن سخبرة أبو معمر، قال سمعت ابن مسعود، يقول علمني رسول الله صلى الله عليه وسلم وكفي بين كفيه التشهد، كما يعلمني السورة من القرآن التحيات لله والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله‏.‏ وهو بين ظهرانينا، فلما قبض قلنا السلام‏.‏ يعني على النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6266,
			"arabicnumber": 6266,
			"text": "حدثنا إسحاق، أخبرنا بشر بن شعيب، حدثني أبي، عن الزهري، قال أخبرني عبد الله بن كعب، أن عبد الله بن عباس، أخبره أن عليا ـ يعني ابن أبي طالب ـ خرج من عند النبي صلى الله عليه وسلم وحدثنا أحمد بن صالح حدثنا عنبسة حدثنا يونس عن ابن شهاب قال أخبرني عبد الله بن كعب بن مالك أن عبد الله بن عباس أخبره أن علي بن أبي طالب ـ رضى الله عنه ـ خرج من عند النبي صلى الله عليه وسلم في وجعه الذي توفي فيه فقال الناس يا أبا حسن كيف أصبح رسول الله صلى الله عليه وسلم قال أصبح بحمد الله بارئا فأخذ بيده العباس فقال ألا تراه أنت والله بعد الثلاث عبد العصا والله إني لأرى رسول الله صلى الله عليه وسلم سيتوفى في وجعه، وإني لأعرف في وجوه بني عبد المطلب الموت، فاذهب بنا إلى رسول الله صلى الله عليه وسلم فنسأله فيمن يكون الأمر فإن كان فينا علمنا ذلك، وإن كان في غيرنا أمرناه فأوصى بنا‏.‏ قال علي والله لئن سألناها رسول الله صلى الله عليه وسلم فيمنعنا لا يعطيناها الناس أبدا، وإني لا أسألها رسول الله صلى الله عليه وسلم أبدا‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6267,
			"arabicnumber": 6267,
			"text": "حدثنا موسى بن إسماعيل، حدثنا همام، عن قتادة، عن أنس، عن معاذ، قال أنا رديف النبي، صلى الله عليه وسلم فقال ‏\"‏ يا معاذ ‏\"‏‏.‏ قلت لبيك وسعديك‏.‏ ثم قال مثله ثلاثا ‏\"‏ هل تدري ما حق الله على العباد أن يعبدوه ولا يشركوا به شيئا ‏\"‏‏.‏ ثم سار ساعة فقال ‏\"‏ يا معاذ ‏\"‏‏.‏ قلت لبيك وسعديك‏.‏ قال ‏\"‏ هل تدري ما حق العباد على الله إذا فعلوا ذلك أن لا يعذبهم ‏\"‏‏.‏ حدثنا هدبة، حدثنا همام، حدثنا قتادة، عن أنس، عن معاذ، بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6268,
			"arabicnumber": 6268,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا زيد بن وهب، حدثنا والله أبو ذر، بالربذة كنت أمشي مع النبي صلى الله عليه وسلم في حرة المدينة عشاء استقبلنا أحد فقال ‏\"‏ يا أبا ذر ما أحب أن أحدا لي ذهبا يأتي على ليلة أو ثلاث عندي منه دينار، إلا أرصده لدين، إلا أن أقول به في عباد الله هكذا وهكذا وهكذا ‏\"‏‏.‏ وأرانا بيده‏.‏ ثم قال ‏\"‏ يا أبا ذر ‏\"‏‏.‏ قلت لبيك وسعديك يا رسول الله‏.‏ قال ‏\"‏ الأكثرون هم الأقلون إلا من قال هكذا وهكذا ‏\"‏‏.‏ ثم قال لي ‏\"‏ مكانك لا تبرح يا أبا ذر حتى أرجع ‏\"‏‏.‏ فانطلق حتى غاب عني، فسمعت صوتا فخشيت أن يكون عرض لرسول الله صلى الله عليه وسلم فأردت أن أذهب، ثم ذكرت قول رسول الله صلى الله عليه وسلم ‏\"‏ لا تبرح ‏\"‏‏.‏ فمكثت قلت يا رسول الله سمعت صوتا خشيت أن يكون عرض لك، ثم ذكرت قولك فقمت‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ذاك جبريل أتاني، فأخبرني أنه من مات من أمتي لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت يا رسول الله وإن زنى وإن سرق‏.‏ قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏ قلت لزيد إنه بلغني أنه أبو الدرداء‏.‏ فقال أشهد لحدثنيه أبو ذر بالربذة‏.‏ قال الأعمش وحدثني أبو صالح عن أبي الدرداء نحوه‏.‏ وقال أبو شهاب عن الأعمش ‏\"‏ يمكث عندي فوق ثلاث ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6269,
			"arabicnumber": 6269,
			"text": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يقيم الرجل الرجل من مجلسه، ثم يجلس فيه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6270,
			"arabicnumber": 6270,
			"text": "حدثنا خلاد بن يحيى، حدثنا سفيان، عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم أنه نهى أن يقام الرجل من مجلسه ويجلس فيه آخر، ولكن تفسحوا وتوسعوا‏.‏ وكان ابن عمر يكره أن يقوم الرجل من مجلسه، ثم يجلس مكانه‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6271,
			"arabicnumber": 6271,
			"text": "حدثنا الحسن بن عمر، حدثنا معتمر، سمعت أبي يذكر، عن أبي مجلز، عن أنس بن مالك ـ رضى الله عنه ـ قال لما تزوج رسول الله صلى الله عليه وسلم زينب ابنة جحش دعا الناس طعموا ثم جلسوا يتحدثون ـ قال ـ فأخذ كأنه يتهيأ للقيام فلم يقوموا، فلما رأى ذلك قام، فلما قام قام من قام معه من الناس، وبقي ثلاثة، وإن النبي صلى الله عليه وسلم جاء ليدخل فإذا القوم جلوس، ثم إنهم قاموا فانطلقوا ـ قال ـ فجئت فأخبرت النبي صلى الله عليه وسلم أنهم قد انطلقوا، فجاء حتى دخل فذهبت أدخل، فأرخى الحجاب بيني وبينه، وأنزل الله تعالى ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم‏}‏ إلى قوله ‏{‏إن ذلكم كان عند الله عظيما‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6272,
			"arabicnumber": 6272,
			"text": "حدثنا محمد بن أبي غالب، أخبرنا إبراهيم بن المنذر الحزامي، حدثنا محمد بن فليح، عن أبيه، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال رأيت رسول الله صلى الله عليه وسلم بفناء الكعبة محتبيا بيده هكذا‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6273,
			"arabicnumber": 6273,
			"text": "حدثنا علي بن عبد الله، حدثنا بشر بن المفضل، حدثنا الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم بأكبر الكبائر ‏\"‏‏.‏ قالوا بلى يا رسول الله‏.‏ قال ‏\"‏ الإشراك بالله، وعقوق الوالدين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6274,
			"arabicnumber": 6274,
			"text": "حدثنا مسدد، حدثنا بشر، مثله، وكان متكئا فجلس فقال ‏ \"‏ ألا وقول الزور ‏\"‏‏.‏ فما زال يكررها حتى قلنا ليته سكت‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6275,
			"arabicnumber": 6275,
			"text": "حدثنا أبو عاصم، عن عمر بن سعيد، عن ابن أبي مليكة، أن عقبة بن الحارث، حدثه قال صلى النبي صلى الله عليه وسلم العصر، فأسرع، ثم دخل البيت‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6276,
			"arabicnumber": 6276,
			"text": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة ـ رضى الله عنها ـ قالت كان رسول الله صلى الله عليه وسلم يصلي وسط السرير، وأنا مضطجعة بينه وبين القبلة تكون لي الحاجة، فأكره أن أقوم فأستقبله فأنسل انسلالا‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6277,
			"arabicnumber": 6277,
			"text": "حدثنا إسحاق، حدثنا خالد،‏.‏ وحدثني عبد الله بن محمد، حدثنا عمرو بن عون، حدثنا خالد، عن خالد، عن أبي قلابة، قال أخبرني أبو المليح، قال دخلت مع أبيك زيد على عبد الله بن عمرو فحدثنا أن النبي صلى الله عليه وسلم ذكر له صومي، فدخل على، فألقيت له وسادة من أدم حشوها ليف، فجلس على الأرض، وصارت الوسادة بيني وبينه، فقال لي ‏\"‏ أما يكفيك من كل شهر ثلاثة أيام ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ خمسا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ سبعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ تسعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ إحدى عشرة ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ لا صوم فوق صوم داود، شطر الدهر، صيام يوم، وإفطار يوم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6278,
			"arabicnumber": 6278,
			"text": "حدثنا يحيى بن جعفر، حدثنا يزيد، عن شعبة، عن مغيرة، عن إبراهيم، عن علقمة، أنه قدم الشأم‏.‏ وحدثنا أبو الوليد، حدثنا شعبة، عن مغيرة، عن إبراهيم، قال ذهب علقمة إلى الشأم، فأتى المسجد فصلى ركعتين فقال اللهم ارزقني جليسا‏.‏ فقعد إلى أبي الدرداء فقال ممن أنت قال من أهل الكوفة‏.‏ قال أليس فيكم صاحب السر الذي كان لا يعلمه غيره ـ يعني حذيفة ـ أليس فيكم ـ أو كان فيكم ـ الذي أجاره الله على لسان رسوله صلى الله عليه وسلم من الشيطان ـ يعني عمارا ـ أوليس فيكم صاحب السواك والوساد ـ يعني ابن مسعود ـ كيف كان عبد الله يقرأ ‏{‏والليل إذا يغشى‏}‏‏.‏ قال ‏{‏والذكر والأنثى‏}‏‏.‏ فقال ما زال هؤلاء حتى كادوا يشككوني، وقد سمعتها من رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6279,
			"arabicnumber": 6279,
			"text": "حدثنا محمد بن كثير، حدثنا سفيان، عن أبي حازم، عن سهل بن سعد، قال كنا نقيل ونتغدى بعد الجمعة‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6280,
			"arabicnumber": 6280,
			"text": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز بن أبي حازم، عن أبي حازم، عن سهل بن سعد، قال ما كان لعلي اسم أحب إليه من أبي تراب، وإن كان ليفرح به إذا دعي بها، جاء رسول الله صلى الله عليه وسلم بيت فاطمة ـ عليها السلام ـ فلم يجد عليا في البيت فقال ‏\"‏ أين ابن عمك ‏\"‏‏.‏ فقالت كان بيني وبينه شىء، فغاضبني فخرج فلم يقل عندي‏.‏ فقال رسول الله صلى الله عليه وسلم لإنسان ‏\"‏ انظر أين هو ‏\"‏ فجاء فقال يا رسول الله هو في المسجد راقد‏.‏ فجاء رسول الله صلى الله عليه وسلم وهو مضطجع، قد سقط رداؤه عن شقه، فأصابه تراب، فجعل رسول الله صلى الله عليه وسلم يمسحه عنه ـ وهو يقول ‏\"‏ قم أبا تراب، قم أبا تراب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6281,
			"arabicnumber": 6281,
			"text": "حدثنا قتيبة بن سعيد، حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أم سليم، كانت تبسط للنبي صلى الله عليه وسلم نطعا فيقيل عندها على ذلك النطع ـ قال ـ فإذا نام النبي صلى الله عليه وسلم أخذت من عرقه وشعره، فجمعته في قارورة، ثم جمعته في سك ـ قال ـ فلما حضر أنس بن مالك الوفاة أوصى أن يجعل في حنوطه من ذلك السك ـ قال ـ فجعل في حنوطه‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6283,
			"arabicnumber": 6283,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6284,
			"arabicnumber": 6284,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن الزهري، عن عطاء بن يزيد الليثي، عن أبي سعيد الخدري ـ رضى الله عنه ـ قال نهى النبي صلى الله عليه وسلم عن لبستين، وعن بيعتين اشتمال الصماء، والاحتباء في ثوب واحد، ليس على فرج الإنسان منه شىء، والملامسة، والمنابذة‏.‏ تابعه معمر ومحمد بن أبي حفصة وعبد الله بن بديل عن الزهري‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6286,
			"arabicnumber": 6286,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6287,
			"arabicnumber": 6287,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا الزهري، قال أخبرني عباد بن تميم، عن عمه، قال رأيت رسول الله صلى الله عليه وسلم في المسجد مستلقيا، واضعا إحدى رجليه على الأخرى‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6288,
			"arabicnumber": 6288,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك،‏.‏ وحدثنا إسماعيل، قال حدثني مالك، عن نافع، عن عبد الله، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا كانوا ثلاثة فلا يتناجى اثنان دون الثالث ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6289,
			"arabicnumber": 6289,
			"text": "حدثنا عبد الله بن صباح، حدثنا معتمر بن سليمان، قال سمعت أبي قال، سمعت أنس بن مالك، أسر إلى النبي صلى الله عليه وسلم سرا فما أخبرت به أحدا بعده، ولقد سألتني أم سليم فما أخبرتها به‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6290,
			"arabicnumber": 6290,
			"text": "حدثنا عثمان، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله ـ رضى الله عنه ـ قال النبي صلى الله عليه وسلم ‏{‏إذا كنتم ثلاثة فلا يتناجى رجلان دون الآخر، حتى تختلطوا بالناس، أجل أن يحزنه‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6291,
			"arabicnumber": 6291,
			"text": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن شقيق، عن عبد الله، قال قسم النبي صلى الله عليه وسلم يوما قسمة فقال رجل من الأنصار إن هذه لقسمة ما أريد بها وجه الله‏.‏ قلت أما والله لآتين النبي صلى الله عليه وسلم فأتيته وهو في ملأ، فساررته فغضب حتى احمر وجهه، ثم قال ‏ \"‏ رحمة الله على موسى، أوذي بأكثر من هذا فصبر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6292,
			"arabicnumber": 6292,
			"text": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد العزيز، عن أنس ـ رضى الله عنه ـ قال أقيمت الصلاة ورجل يناجي رسول الله صلى الله عليه وسلم فما زال يناجيه حتى نام أصحابه، ثم قام فصلى‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6293,
			"arabicnumber": 6293,
			"text": "حدثنا أبو نعيم، حدثنا ابن عيينة، عن الزهري، عن سالم، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏{‏لا تتركوا النار في بيوتكم حين تنامون‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6294,
			"arabicnumber": 6294,
			"text": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى ـ رضى الله عنه ـ قال احترق بيت بالمدينة على أهله من الليل، فحدث بشأنهم النبي صلى الله عليه وسلم قال ‏ \"‏ إن هذه النار إنما هي عدو لكم، فإذا نمتم فأطفئوها عنكم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6295,
			"arabicnumber": 6295,
			"text": "حدثنا قتيبة، حدثنا حماد، عن كثير، عن عطاء، عن جابر بن عبد الله ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ خمروا الآنية وأجيفوا الأبواب، وأطفئوا المصابيح، فإن الفويسقة ربما جرت الفتيلة فأحرقت أهل البيت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6296,
			"arabicnumber": 6296,
			"text": "حدثنا حسان بن أبي عباد، حدثنا همام، عن عطاء، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أطفئوا المصابيح بالليل إذا رقدتم، وغلقوا الأبواب، وأوكوا الأسقية، وخمروا الطعام والشراب ‏\"‏‏.‏ ـ قال همام وأحسبه قال ـ ‏\"‏ولو بعود يعرضه",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6297,
			"arabicnumber": 6297,
			"text": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ الفطرة خمس الختان، والاستحداد، ونتف الإبط، وقص الشارب، وتقليم الأظفار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6298,
			"arabicnumber": 6298,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب بن أبي حمزة، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اختتن إبراهيم بعد ثمانين سنة، واختتن بالقدوم ‏\"‏‏.‏ مخففة‏.‏ حدثنا قتيبة حدثنا المغيرة عن أبي الزناد وقال ‏\"‏بالقدوم\"‏‏ وهو موضع مشدد",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6299,
			"arabicnumber": 6299,
			"text": "حدثنا محمد بن عبد الرحيم، أخبرنا عباد بن موسى، حدثنا إسماعيل بن جعفر، عن إسرائيل، عن أبي إسحاق، عن سعيد بن جبير، قال سئل ابن عباس مثل من أنت حين قبض النبي صلى الله عليه وسلم قال أنا يومئذ مختون‏.‏ قال وكانوا لا يختنون الرجل حتى يدرك‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6300,
			"arabicnumber": 6300,
			"text": "وقال ابن إدريس عن أبيه، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، قبض النبي صلى الله عليه وسلم وأنا ختين‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6301,
			"arabicnumber": 6301,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني حميد بن عبد الرحمن، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من حلف منكم فقال في حلفه باللات والعزى‏.‏ فليقل لا إله إلا الله‏.‏ ومن قال لصاحبه تعال أقامرك‏.‏ فليتصدق ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6302,
			"arabicnumber": 6302,
			"text": "حدثنا أبو نعيم، حدثنا إسحاق ـ هو ابن سعيد ـ عن سعيد، عن ابن عمر ـ رضى الله عنهما ـ قال رأيتني مع النبي صلى الله عليه وسلم بنيت بيدي بيتا، يكنني من المطر، ويظلني من الشمس، ما أعانني عليه أحد من خلق الله‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6303,
			"arabicnumber": 6303,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال عمرو قال ابن عمر والله ما وضعت لبنة على لبنة، ولا غرست نخلة، منذ قبض النبي صلى الله عليه وسلم‏.‏ قال سفيان فذكرته لبعض أهله قال والله لقد بنى بيتا‏.‏ قال سفيان قلت فلعله قال قبل أن يبني‏.‏",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 75
			}
		}
	]
}