{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"83": "Oaths and Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6621,
			"arabicnumber": 6621,
			"text": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا هشام بن عروة، عن أبيه، عن عائشة، أن أبا بكر ـ رضى الله عنه ـ لم يكن يحنث في يمين قط، حتى أنزل الله كفارة اليمين وقال لا أحلف على يمين فرأيت غيرها خيرا منها، إلا أتيت الذي هو خير، وكفرت عن يميني‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6622,
			"arabicnumber": 6622,
			"text": "حدثنا أبو النعمان، محمد بن الفضل حدثنا جرير بن حازم، حدثنا الحسن، حدثنا عبد الرحمن بن سمرة، قال قال النبي صلى الله عليه وسلم ‏ \"‏ يا عبد الرحمن بن سمرة لا تسأل الإمارة، فإنك إن أوتيتها عن مسألة وكلت إليها، وإن أوتيتها من غير مسألة أعنت عليها، وإذا حلفت على يمين فرأيت غيرها خيرا منها، فكفر عن يمينك، وأت الذي هو خير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6623,
			"arabicnumber": 6623,
			"text": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن غيلان بن جرير، عن أبي بردة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم في رهط من الأشعريين أستحمله فقال ‏\"‏ والله لا أحملكم، وما عندي ما أحملكم عليه ‏\"‏‏.‏ قال ثم لبثنا ما شاء الله أن نلبث، ثم أتي بثلاث ذود غر الذرى فحملنا عليها فلما انطلقنا قلنا أو قال بعضنا والله لا يبارك لنا، أتينا النبي صلى الله عليه وسلم نستحمله، فحلف أن لا يحملنا ثم حملنا، فارجعوا بنا إلى النبي صلى الله عليه وسلم فنذكره، فأتيناه فقال ‏\"‏ ما أنا حملتكم، بل الله حملكم، وإني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها، إلا كفرت عن يميني، وأتيت الذي هو خير ‏\"‏‏.‏ أو ‏\"‏ أتيت الذي هو خير وكفرت عن يميني ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6624,
			"arabicnumber": 6624,
			"text": "حدثني إسحاق بن إبراهيم، أخبرنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ نحن الآخرون السابقون يوم القيامة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6625,
			"arabicnumber": 6625,
			"text": "فقال رسول الله صلى الله عليه وسلم ‏ \"‏ والله لأن يلج أحدكم بيمينه في أهله آثم له عند الله من أن يعطي كفارته التي افترض الله عليه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6626,
			"arabicnumber": 6626,
			"text": "حدثني إسحاق يعني ابن إبراهيم، حدثنا يحيى بن صالح، حدثنا معاوية، عن يحيى، عن عكرمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من استلج في أهله بيمين فهو أعظم إثما، ليبر ‏\"‏‏.‏ يعني الكفارة‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6627,
			"arabicnumber": 6627,
			"text": "حدثنا قتيبة بن سعيد، عن إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر ـ رضى الله عنهما ـ قال بعث رسول الله صلى الله عليه وسلم بعثا وأمر عليهم أسامة بن زيد، فطعن بعض الناس في إمرته فقام رسول الله صلى الله عليه وسلم فقال ‏ \"‏ إن كنتم تطعنون في إمرته فقد كنتم تطعنون، في إمرة أبيه من قبل، وايم الله إن كان لخليقا للإمارة، وإن كان لمن أحب الناس إلى، وإن هذا لمن أحب الناس إلى بعده ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6628,
			"arabicnumber": 6628,
			"text": "حدثنا محمد بن يوسف، عن سفيان، عن موسى بن عقبة، عن سالم، عن ابن عمر، قال كانت يمين النبي صلى الله عليه وسلم ‏ \"‏ لا ومقلب القلوب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6629,
			"arabicnumber": 6629,
			"text": "حدثنا موسى، حدثنا أبو عوانة، عن عبد الملك، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا هلك قيصر فلا قيصر بعده، وإذا هلك كسرى فلا كسرى بعده، والذي نفسي بيده لتنفقن كنوزهما في سبيل الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6630,
			"arabicnumber": 6630,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، أخبرني سعيد بن المسيب، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا هلك كسرى فلا كسرى بعده، وإذا هلك قيصر فلا قيصر بعده، والذي نفس محمد بيده لتنفقن كنوزهما في سبيل الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6631,
			"arabicnumber": 6631,
			"text": "حدثني محمد، أخبرنا عبدة، عن هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ يا أمة محمد والله لو تعلمون ما أعلم لبكيتم كثيرا، ولضحكتم قليلا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6632,
			"arabicnumber": 6632,
			"text": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني حيوة، قال حدثني أبو عقيل، زهرة بن معبد أنه سمع جده عبد الله بن هشام، قال كنا مع النبي صلى الله عليه وسلم وهو آخذ بيد عمر بن الخطاب فقال له عمر يا رسول الله لأنت أحب إلى من كل شىء إلا من نفسي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا والذي نفسي بيده حتى أكون أحب إليك من نفسك ‏\"‏‏.‏ فقال له عمر فإنه الآن والله لأنت أحب إلى من نفسي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ الآن يا عمر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6634,
			"arabicnumber": 6634,
			"text": "",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6635,
			"arabicnumber": 6635,
			"text": "حدثني عبد الله بن محمد، حدثنا وهب، حدثنا شعبة، عن محمد بن أبي يعقوب، عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ أرأيتم إن كان أسلم وغفار ومزينة وجهينة خيرا من تميم وعامر بن صعصعة وغطفان وأسد، خابوا وخسروا ‏\"‏‏.‏ قالوا نعم‏.‏ فقال ‏\"‏ والذي نفسي بيده إنهم خير منهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6636,
			"arabicnumber": 6636,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني عروة، عن أبي حميد الساعدي، أنه أخبره أن رسول الله صلى الله عليه وسلم استعمل عاملا فجاءه العامل حين فرغ من عمله فقال يا رسول الله هذا لكم، وهذا أهدي لي‏.‏ فقال له ‏\"‏ أفلا قعدت في بيت أبيك وأمك فنظرت أيهدى لك أم لا ‏\"‏‏.‏ ثم قام رسول الله صلى الله عليه وسلم عشية بعد الصلاة فتشهد وأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد، فما بال العامل نستعمله، فيأتينا فيقول هذا من عملكم، وهذا أهدي لي‏.‏ أفلا قعد في بيت أبيه وأمه فنظر هل يهدى له أم لا، فوالذي نفس محمد بيده لا يغل أحدكم منها شيئا، إلا جاء به يوم القيامة يحمله على عنقه، إن كان بعيرا جاء به له رغاء، وإن كانت بقرة جاء بها لها خوار، وإن كانت شاة جاء بها تيعر، فقد بلغت ‏\"‏‏.‏ فقال أبو حميد ثم رفع رسول الله صلى الله عليه وسلم يده حتى إنا لننظر إلى عفرة إبطيه‏.‏ قال أبو حميد وقد سمع ذلك معي زيد بن ثابت من النبي صلى الله عليه وسلم فسلوه‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6637,
			"arabicnumber": 6637,
			"text": "حدثني إبراهيم بن موسى، أخبرنا هشام ـ هو ابن يوسف ـ عن معمر، عن همام، عن أبي هريرة، قال قال أبو القاسم صلى الله عليه وسلم ‏ \"‏ والذي نفس محمد بيده لو تعلمون ما أعلم لبكيتم كثيرا، ولضحكتم قليلا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6638,
			"arabicnumber": 6638,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن المعرور، عن أبي ذر، قال انتهيت إليه وهو يقول في ظل الكعبة ‏\"‏ هم الأخسرون ورب الكعبة، هم الأخسرون ورب الكعبة ‏\"‏ قلت ما شأني أيرى في شىء ما شأني فجلست إليه وهو يقول، فما استطعت أن أسكت، وتغشاني ما شاء الله، فقلت من هم بأبي أنت وأمي يا رسول الله قال ‏\"‏ الأكثرون أموالا، إلا من قال هكذا وهكذا وهكذا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6639,
			"arabicnumber": 6639,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن الأعرج، عن أبي هريرة، قال رسول الله صلى الله عليه وسلم ‏ \"‏ قال سليمان لأطوفن الليلة على تسعين امرأة، كلهن تأتي بفارس يجاهد في سبيل الله‏.‏ فقال له صاحبه إن شاء الله‏.‏ فلم يقل إن شاء الله‏.‏ فطاف عليهن جميعا، فلم تحمل منهن إلا امرأة واحدة، جاءت بشق رجل، وايم الذي نفس محمد بيده لو قال إن شاء الله‏.‏ لجاهدوا في سبيل الله فرسانا أجمعون ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6640,
			"arabicnumber": 6640,
			"text": "حدثنا محمد، حدثنا أبو الأحوص، عن أبي إسحاق، عن البراء بن عازب، قال أهدي إلى النبي صلى الله عليه وسلم سرقة من حرير، فجعل الناس يتداولونها بينهم، ويعجبون من حسنها ولينها، فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتعجبون منها ‏\"‏‏.‏ قالوا نعم يا رسول الله‏.‏ قال ‏\"‏ والذي نفسي بيده لمناديل سعد في الجنة خير منها ‏\"‏‏.‏ لم يقل شعبة وإسرائيل عن أبي إسحاق ‏\"‏ والذي نفسي بيده ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6641,
			"arabicnumber": 6641,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن يونس، عن ابن شهاب، حدثني عروة بن الزبير، أن عائشة ـ رضى الله عنها ـ قالت إن هند بنت عتبة بن ربيعة قالت يا رسول الله ما كان مما على ظهر الأرض أهل أخباء ـ أو خباء ـ أحب إلى أن يذلوا من أهل أخبائك ـ أو خبائك، شك يحيى ـ ثم ما أصبح اليوم أهل أخباء ـ أو خباء ـ أحب إلى من أن يعزوا من أهل أخبائك أو خبائك‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ وأيضا والذي نفس محمد بيده ‏\"‏‏.‏ قالت يا رسول الله إن أبا سفيان رجل مسيك، فهل على حرج أن أطعم من الذي له قال ‏\"‏ لا إلا بالمعروف ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6642,
			"arabicnumber": 6642,
			"text": "حدثني أحمد بن عثمان، حدثنا شريح بن مسلمة، حدثنا إبراهيم، عن أبيه، عن أبي إسحاق، سمعت عمرو بن ميمون، قال حدثني عبد الله بن مسعود ـ رضى الله عنه ـ قال بينما رسول الله صلى الله عليه وسلم مضيف ظهره إلى قبة من أدم يمان إذ قال لأصحابه ‏\"‏ أترضون أن تكونوا ربع أهل الجنة ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ أفلم ترضوا أن تكونوا ثلث أهل الجنة ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ فوالذي نفس محمد بيده، إني لأرجو أن تكونوا نصف أهل الجنة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6643,
			"arabicnumber": 6643,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الرحمن بن عبد الله بن عبد الرحمن، عن أبيه، عن أبي سعيد، أن رجلا، سمع رجلا، يقرأ ‏{‏قل هو الله أحد‏}‏ يرددها، فلما أصبح جاء إلى رسول الله صلى الله عليه وسلم فذكر ذلك له، وكأن الرجل يتقالها فقال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده إنها لتعدل ثلث القرآن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6644,
			"arabicnumber": 6644,
			"text": "حدثني إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك ـ رضى الله عنه ـ أنه سمع النبي صلى الله عليه وسلم يقول ‏ \"‏ أتموا الركوع والسجود، فوالذي نفسي بيده إني لأراكم من بعد ظهري إذا ما ركعتم وإذا ما سجدتم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6645,
			"arabicnumber": 6645,
			"text": "حدثنا إسحاق، حدثنا وهب بن جرير، أخبرنا شعبة، عن هشام بن زيد، عن أنس بن مالك، أن امرأة، من الأنصار أتت النبي صلى الله عليه وسلم معها أولاد لها فقال النبي صلى الله عليه وسلم ‏ \"‏ والذي نفسي بيده إنكم لأحب الناس إلى ‏\"‏‏.‏ قالها ثلاث مرار‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6646,
			"arabicnumber": 6646,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن نافع، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم أدرك عمر بن الخطاب وهو يسير في ركب يحلف بأبيه فقال ‏ \"‏ ألا إن الله ينهاكم أن تحلفوا بآبائكم، من كان حالفا فليحلف بالله، أو ليصمت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6647,
			"arabicnumber": 6647,
			"text": "حدثنا سعيد بن عفير، حدثنا ابن وهب، عن يونس، عن ابن شهاب، قال قال سالم قال ابن عمر سمعت عمر، يقول قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إن الله ينهاكم أن تحلفوا بآبائكم ‏\"‏‏.‏ قال عمر فوالله ما حلفت بها منذ سمعت النبي صلى الله عليه وسلم ذاكرا ولا آثرا‏.‏ قال مجاهد ‏{‏أو أثرة من علم‏}‏ يأثر علما‏.‏ تابعه عقيل والزبيدي وإسحاق الكلبي عن الزهري‏.‏ وقال ابن عيينة ومعمر عن الزهري عن سالم عن ابن عمر سمع النبي صلى الله عليه وسلم عمر‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6648,
			"arabicnumber": 6648,
			"text": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، قال سمعت عبد الله بن عمر ـ رضى الله عنهما ـ يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تحلفوا بآبائكم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6649,
			"arabicnumber": 6649,
			"text": "حدثنا قتيبة، حدثنا عبد الوهاب، عن أيوب، عن أبي قلابة، والقاسم التميمي، عن زهدم، قال كان بين هذا الحى من جرم وبين الأشعريين ود وإخاء، فكنا عند أبي موسى الأشعري، فقرب إليه طعام فيه لحم دجاج وعنده رجل من بني تيم الله أحمر كأنه من الموالي، فدعاه إلى الطعام فقال إني رأيته يأكل شيئا فقذرته، فحلفت أن لا آكله‏.‏ فقال قم فلأحدثنك عن ذاك، إني أتيت رسول الله صلى الله عليه وسلم في نفر من الأشعريين نستحمله فقال ‏\"‏ والله لا أحملكم، وما عندي ما أحملكم ‏\"‏‏.‏ فأتي رسول الله صلى الله عليه وسلم بنهب إبل فسأل عنا‏.‏ فقال ‏\"‏ أين النفر الأشعريون ‏\"‏‏.‏ فأمر لنا بخمس ذود غر الذرى، فلما انطلقنا قلنا ما صنعنا حلف رسول الله صلى الله عليه وسلم لا يحملنا وما عنده ما يحملنا ثم حملنا، تغفلنا رسول الله صلى الله عليه وسلم يمينه، والله لا نفلح أبدا، فرجعنا إليه فقلنا له إنا أتيناك لتحملنا فحلفت أن لا تحملنا، وما عندك ما تحملنا‏.‏ فقال ‏\"‏ إني لست أنا حملتكم، ولكن الله حملكم، والله لا أحلف على يمين فأرى غيرها خيرا منها، إلا أتيت الذي هو خير وتحللتها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6650,
			"arabicnumber": 6650,
			"text": "حدثني عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ من حلف فقال في حلفه باللات والعزى‏.‏ فليقل لا إله إلا الله‏.‏ ومن قال لصاحبه تعال أقامرك‏.‏ فليتصدق ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6651,
			"arabicnumber": 6651,
			"text": "حدثنا قتيبة، حدثنا الليث، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم اصطنع خاتما من ذهب وكان يلبسه، فيجعل فصه في باطن كفه، فصنع الناس خواتيم ثم إنه جلس على المنبر فنزعه، فقال ‏\"‏ إني كنت ألبس هذا الخاتم وأجعل فصه من داخل ‏\"‏‏.‏ فرمى به ثم قال ‏\"‏ والله لا ألبسه أبدا ‏\"‏‏.‏ فنبذ الناس خواتيمهم‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6652,
			"arabicnumber": 6652,
			"text": "حدثنا معلى بن أسد، حدثنا وهيب، عن أيوب، عن أبي قلابة، عن ثابت بن الضحاك، قال قال النبي صلى الله عليه وسلم ‏ \"‏ من حلف بغير ملة الإسلام فهو كما قال ـ قال ـ ومن قتل نفسه بشىء عذب به في نار جهنم، ولعن المؤمن كقتله، ومن رمى مؤمنا بكفر فهو كقتله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6653,
			"arabicnumber": 6653,
			"text": "وقال عمرو بن عاصم حدثنا همام، حدثنا إسحاق بن عبد الله، حدثنا عبد الرحمن بن أبي عمرة، أن أبا هريرة، حدثه أنه، سمع النبي صلى الله عليه وسلم يقول ‏ \"‏ إن ثلاثة في بني إسرائيل أراد الله أن يبتليهم، فبعث ملكا فأتى الأبرص فقال تقطعت بي الحبال، فلا بلاغ لي إلا بالله، ثم بك ‏\"‏‏.‏ فذكر الحديث‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6654,
			"arabicnumber": 6654,
			"text": "حدثنا قبيصة، حدثنا سفيان، عن أشعث، عن معاوية بن سويد بن مقرن، عن البراء، عن النبي صلى الله عليه وسلم‏.‏ وحدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أشعث، عن معاوية بن سويد بن مقرن، عن البراء ـ رضى الله عنه ـ قال أمرنا النبي صلى الله عليه وسلم بإبرار المقسم‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6655,
			"arabicnumber": 6655,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، أخبرنا عاصم الأحول، سمعت أبا عثمان، يحدث عن أسامة، أن ابنة لرسول الله، صلى الله عليه وسلم أرسلت إليه ومع رسول الله صلى الله عليه وسلم أسامة بن زيد وسعد وأبى أن ابني قد احتضر فاشهدنا‏.‏ فأرسل يقرأ السلام ويقول ‏\"‏ إن لله ما أخذ وما أعطى وكل شىء عنده مسمى فلتصبر وتحتسب ‏\"‏‏.‏ فأرسلت إليه تقسم عليه، فقام وقمنا معه، فلما قعد رفع إليه، فأقعده في حجره ونفس الصبي تقعقع، ففاضت عينا رسول الله صلى الله عليه وسلم فقال سعد ما هذا يا رسول الله قال ‏\"‏ هذا رحمة يضعها الله في قلوب من يشاء من عباده، وإنما يرحم الله من عباده الرحماء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6656,
			"arabicnumber": 6656,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن ابن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يموت لأحد من المسلمين ثلاثة من الولد، تمسه النار، إلا تحلة القسم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6657,
			"arabicnumber": 6657,
			"text": "حدثنا محمد بن المثنى، حدثني غندر، حدثنا شعبة، عن معبد بن خالد، سمعت حارثة بن وهب، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ ألا أدلكم على أهل الجنة، كل ضعيف متضعف، لو أقسم على الله لأبره، وأهل النار كل جواظ عتل مستكبر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6658,
			"arabicnumber": 6658,
			"text": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله، قال سئل النبي صلى الله عليه وسلم أى الناس خير قال ‏ \"‏ قرني، ثم الذين يلونهم، ثم الذين يلونهم، ثم يجيء قوم تسبق شهادة أحدهم يمينه، ويمينه شهادته ‏\"‏‏.‏ قال إبراهيم وكان أصحابنا ينهونا ونحن غلمان أن نحلف بالشهادة والعهد‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6660,
			"arabicnumber": 6660,
			"text": "",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6661,
			"arabicnumber": 6661,
			"text": "حدثنا آدم، حدثنا شيبان، حدثنا قتادة، عن أنس بن مالك، قال النبي صلى الله عليه وسلم ‏ \"‏ لا تزال جهنم تقول هل من مزيد حتى يضع رب العزة فيها قدمه فتقول قط قط وعزتك‏.‏ ويزوى بعضها إلى بعض ‏\"‏‏.‏ رواه شعبة عن قتادة‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6662,
			"arabicnumber": 6662,
			"text": "حدثنا الأويسي، حدثنا إبراهيم، عن صالح، عن ابن شهاب، ح وحدثنا حجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله، وكل حدثني طائفة من الحديث ـ فقام النبي صلى الله عليه وسلم فاستعذر من عبد الله بن أبى، فقام أسيد بن حضير فقال لسعد بن عبادة لعمر الله لنقتلنه‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6663,
			"arabicnumber": 6663,
			"text": "حدثني محمد بن المثنى، حدثنا يحيى، عن هشام، قال أخبرني أبي، عن عائشة ـ رضى الله عنها ‏{‏لا يؤاخذكم الله باللغو‏}‏ قال قالت أنزلت في قوله لا، والله بلى والله‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6664,
			"arabicnumber": 6664,
			"text": "حدثنا خلاد بن يحيى، حدثنا مسعر، حدثنا قتادة، حدثنا زرارة بن أوفى، عن أبي هريرة، يرفعه قال ‏ \"‏ إن الله تجاوز لأمتي عما وسوست أو حدثت به أنفسها، ما لم تعمل به أو تكلم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6665,
			"arabicnumber": 6665,
			"text": "حدثنا عثمان بن الهيثم، أو محمد عنه عن ابن جريج، قال سمعت ابن شهاب، يقول حدثني عيسى بن طلحة، أن عبد الله بن عمرو بن العاص، حدثه أن النبي صلى الله عليه وسلم بينما هو يخطب يوم النحر إذ قام إليه رجل فقال كنت أحسب يا رسول الله كذا وكذا قبل كذا وكذا‏.‏ ثم قام آخر فقال يا رسول الله كنت أحسب كذا وكذا لهؤلاء الثلاث‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ افعل ولا حرج ‏\"‏ لهن كلهن يومئذ، فما سئل يومئذ عن شىء إلا قال ‏\"‏ افعل ولا حرج ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6666,
			"arabicnumber": 6666,
			"text": "حدثنا أحمد بن يونس، حدثنا أبو بكر، عن عبد العزيز بن رفيع، عن عطاء، عن ابن عباس ـ رضى الله عنهما ـ قال قال رجل للنبي صلى الله عليه وسلم زرت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال آخر حلقت قبل أن أذبح‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال آخر ذبحت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6667,
			"arabicnumber": 6667,
			"text": "حدثني إسحاق بن منصور، حدثنا أبو أسامة، حدثنا عبيد الله بن عمر، عن سعيد بن أبي سعيد، عن أبي هريرة، أن رجلا، دخل المسجد يصلي ورسول الله صلى الله عليه وسلم في ناحية المسجد، فجاء فسلم عليه فقال له ‏\"‏ ارجع فصل، فإنك لم تصل ‏\"‏‏.‏ فرجع فصلى، ثم سلم فقال ‏\"‏ وعليك، ارجع فصل، فإنك لم تصل ‏\"‏‏.‏ قال في الثالثة فأعلمني‏.‏ قال ‏\"‏ إذا قمت إلى الصلاة فأسبغ الوضوء، ثم استقبل القبلة فكبر، واقرأ بما تيسر معك من القرآن، ثم اركع حتى تطمئن راكعا، ثم ارفع رأسك حتى تعتدل قائما، ثم اسجد حتى تطمئن، ساجدا ثم ارفع حتى تستوي وتطمئن جالسا، ثم اسجد حتى تطمئن ساجدا، ثم ارفع حتى تستوي قائما، ثم افعل ذلك في صلاتك كلها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6668,
			"arabicnumber": 6668,
			"text": "حدثنا فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت هزم المشركون يوم أحد هزيمة تعرف فيهم، فصرخ إبليس أى عباد الله أخراكم، فرجعت أولاهم فاجتلدت هي وأخراهم، فنظر حذيفة بن اليمان فإذا هو بأبيه فقال أبي أبي‏.‏ قالت فوالله ما انحجزوا حتى قتلوه، فقال حذيفة غفر الله لكم‏.‏ قال عروة فوالله ما زالت في حذيفة منها بقية حتى لقي الله‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6669,
			"arabicnumber": 6669,
			"text": "حدثني يوسف بن موسى، حدثنا أبو أسامة، قال حدثني عوف، عن خلاس، ومحمد، عن أبي هريرة ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ من أكل ناسيا وهو صائم فليتم صومه، فإنما أطعمه الله وسقاه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6670,
			"arabicnumber": 6670,
			"text": "حدثنا آدم بن أبي إياس، حدثنا ابن أبي ذئب، عن الزهري، عن الأعرج، عن عبد الله ابن بحينة، قال صلى بنا النبي صلى الله عليه وسلم فقام في الركعتين الأوليين قبل أن يجلس، فمضى في صلاته، فلما قضى صلاته انتظر الناس تسليمه، وسجد قبل أن يسلم، ثم رفع رأسه، ثم كبر وسجد، ثم رفع رأسه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6671,
			"arabicnumber": 6671,
			"text": "حدثني إسحاق بن إبراهيم، سمع عبد العزيز بن عبد الصمد، حدثنا منصور، عن إبراهيم، عن علقمة، عن ابن مسعود ـ رضى الله عنه أن نبي الله صلى الله عليه وسلم صلى بهم صلاة الظهر، فزاد أو نقص منها ـ قال منصور لا أدري إبراهيم وهم أم علقمة ـ قال قيل يا رسول الله أقصرت الصلاة أم نسيت قال ‏\"‏ وما ذاك ‏\"‏‏.‏ قالوا صليت كذا وكذا‏.‏ قال فسجد بهم سجدتين ثم قال ‏\"‏ هاتان السجدتان لمن لا يدري، زاد في صلاته أم نقص، فيتحرى الصواب، فيتم ما بقي، ثم يسجد سجدتين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6672,
			"arabicnumber": 6672,
			"text": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو بن دينار، أخبرني سعيد بن جبير، قال قلت لابن عباس فقال حدثنا أبى بن كعب، أنه سمع رسول الله صلى الله عليه وسلم ‏{‏لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا‏}‏ قال ‏\"‏ كانت الأولى من موسى نسيانا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6673,
			"arabicnumber": 6673,
			"text": "قال أبو عبد الله كتب إلى محمد بن بشار حدثنا معاذ بن معاذ، حدثنا ابن عون، عن الشعبي، قال قال البراء بن عازب وكان عندهم ضيف لهم فأمر أهله أن يذبحوا قبل أن يرجع، ليأكل ضيفهم، فذبحوا قبل الصلاة، فذكروا ذلك للنبي صلى الله عليه وسلم فأمره أن يعيد الذبح‏.‏ فقال يا رسول الله عندي عناق جذع، عناق لبن هي خير من شاتى لحم‏.‏ فكان ابن عون يقف في هذا المكان عن حديث الشعبي، ويحدث عن محمد بن سيرين بمثل هذا الحديث، ويقف في هذا المكان ويقول لا أدري أبلغت الرخصة غيره أم لا‏.‏ رواه أيوب عن ابن سيرين عن أنس عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6674,
			"arabicnumber": 6674,
			"text": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الأسود بن قيس، قال سمعت جندبا، قال شهدت النبي صلى الله عليه وسلم صلى يوم عيد ثم خطب ثم قال ‏ \"‏ من ذبح فليبدل مكانها، ومن لم يكن ذبح فليذبح باسم الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6675,
			"arabicnumber": 6675,
			"text": "حدثنا محمد بن مقاتل، أخبرنا النضر، أخبرنا شعبة، حدثنا فراس، قال سمعت الشعبي، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الكبائر الإشراك بالله، وعقوق الوالدين، وقتل النفس، واليمين الغموس ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6677,
			"arabicnumber": 6677,
			"text": "",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6678,
			"arabicnumber": 6678,
			"text": "حدثني محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال أرسلني أصحابي إلى النبي صلى الله عليه وسلم أسأله الحملان فقال ‏\"‏ والله لا أحملكم على شىء ‏\"‏‏.‏ ووافقته وهو غضبان فلما أتيته قال ‏\"‏ انطلق إلى أصحابك فقل إن الله ـ أو إن رسول الله صلى الله عليه وسلم ـ يحملكم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6679,
			"arabicnumber": 6679,
			"text": "حدثنا عبد العزيز، حدثنا إبراهيم، عن صالح، عن ابن شهاب، ح وحدثنا الحجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله بن عتبة، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله مما قالوا ـ كل حدثني طائفة من الحديث ـ فأنزل الله ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات كلها في براءتي‏.‏ فقال أبو بكر الصديق ـ وكان ينفق على مسطح لقرابته منه ـ والله لا أنفق على مسطح شيئا أبدا، بعد الذي قال لعائشة‏.‏ فأنزل الله ‏{‏ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى‏}‏ الآية‏.‏ قال أبو بكر بلى والله إني لأحب أن يغفر الله لي‏.‏ فرجع إلى مسطح النفقة التي كان ينفق عليه وقال والله لا أنزعها عنه أبدا‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6680,
			"arabicnumber": 6680,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا أيوب، عن القاسم، عن زهدم، قال كنا عند أبي موسى الأشعري قال أتيت رسول الله صلى الله عليه وسلم في نفر من الأشعريين، فوافقته وهو غضبان فاستحملناه، فحلف أن لا يحملنا ثم قال ‏ \"‏ والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها، إلا أتيت الذي هو خير وتحللتها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6681,
			"arabicnumber": 6681,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني سعيد بن المسيب، عن أبيه، قال لما حضرت أبا طالب الوفاة جاءه رسول الله صلى الله عليه وسلم فقال ‏ \"‏ قل لا إله إلا الله كلمة‏.‏ أحاج لك بها عند الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6682,
			"arabicnumber": 6682,
			"text": "حدثنا قتيبة بن سعيد، حدثنا محمد بن فضيل، حدثنا عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن سبحان الله وبحمده، سبحان الله العظيم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6683,
			"arabicnumber": 6683,
			"text": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الأعمش، عن شقيق، عن عبد الله ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم كلمة وقلت أخرى ‏ \"‏ من مات يجعل لله ندا أدخل النار ‏\"‏‏.‏ وقلت أخرى من مات لا يجعل لله ندا أدخل الجنة‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6684,
			"arabicnumber": 6684,
			"text": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان بن بلال، عن حميد، عن أنس، قال آلى رسول الله صلى الله عليه وسلم من نسائه، وكانت انفكت رجله، فأقام في مشربة تسعا وعشرين ليلة، ثم نزل فقالوا يا رسول الله آليت شهرا‏.‏ فقال ‏{‏إن الشهر يكون تسعا وعشرين‏}‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6685,
			"arabicnumber": 6685,
			"text": "حدثني علي، سمع عبد العزيز بن أبي حازم، أخبرني أبي، عن سهل بن سعد، أن أبا أسيد، صاحب النبي صلى الله عليه وسلم أعرس فدعا النبي صلى الله عليه وسلم لعرسه، فكانت العروس خادمهم‏.‏ فقال سهل للقوم هل تدرون ما سقته قال أنقعت له تمرا في تور من الليل، حتى أصبح عليه فسقته إياه‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6686,
			"arabicnumber": 6686,
			"text": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا إسماعيل بن أبي خالد، عن الشعبي، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ عن سودة، زوج النبي صلى الله عليه وسلم قالت ماتت لنا شاة فدبغنا مسكها ثم ما زلنا ننبذ فيه حتى صارت شنا‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6687,
			"arabicnumber": 6687,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عبد الرحمن بن عابس، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت ما شبع آل محمد صلى الله عليه وسلم من خبز بر مأدوم ثلاثة أيام حتى لحق بالله‏.‏ وقال ابن كثير أخبرنا سفيان، حدثنا عبد الرحمن، عن أبيه، أنه قال لعائشة بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6688,
			"arabicnumber": 6688,
			"text": "حدثنا قتيبة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، قال قال أبو طلحة لأم سليم لقد سمعت صوت، رسول الله صلى الله عليه وسلم ضعيفا أعرف فيه الجوع، فهل عندك من شىء فقالت نعم‏.‏ فأخرجت أقراصا من شعير، ثم أخذت خمارا لها، فلفت الخبز ببعضه، ثم أرسلتني إلى رسول الله صلى الله عليه وسلم فذهبت فوجدت رسول الله صلى الله عليه وسلم في المسجد ومعه الناس، فقمت عليهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسلك أبو طلحة ‏\"‏‏.‏ فقلت نعم‏.‏ فقال رسول الله صلى الله عليه وسلم لمن معه ‏\"‏ قوموا ‏\"‏‏.‏ فانطلقوا، وانطلقت بين أيديهم حتى جئت أبا طلحة فأخبرته‏.‏ فقال أبو طلحة يا أم سليم قد جاء رسول الله صلى الله عليه وسلم وليس عندنا من الطعام ما نطعمهم‏.‏ فقالت الله ورسوله أعلم‏.‏ فانطلق أبو طلحة حتى لقي رسول الله صلى الله عليه وسلم فأقبل رسول الله صلى الله عليه وسلم وأبو طلحة حتى دخلا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ هلمي يا أم سليم ما عندك ‏\"‏‏.‏ فأتت بذلك الخبز ـ قال ـ فأمر رسول الله صلى الله عليه وسلم بذلك الخبز ففت، وعصرت أم سليم عكة لها فأدمته، ثم قال فيه رسول الله صلى الله عليه وسلم ما شاء الله أن يقول، ثم قال ‏\"‏ ائذن لعشرة ‏\"‏‏.‏ فأذن لهم فأكلوا حتى شبعوا، ثم خرجوا، ثم قال ‏\"‏ ائذن لعشرة ‏\"‏‏.‏ فأذن لهم، فأكل القوم كلهم وشبعوا، والقوم سبعون أو ثمانون رجلا‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6689,
			"arabicnumber": 6689,
			"text": "حدثنا قتيبة بن سعيد، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، يقول أخبرني محمد بن إبراهيم، أنه سمع علقمة بن وقاص الليثي، يقول سمعت عمر بن الخطاب ـ رضى الله عنه ـ يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إنما الأعمال بالنية، وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته إلى دنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6690,
			"arabicnumber": 6690,
			"text": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبد الرحمن، عن عبد الله بن كعب بن مالك، وكان، قائد كعب من بنيه حين عمي ـ قال سمعت كعب بن مالك، في حديثه ‏{‏على الثلاثة الذين خلفوا‏}‏ قال في آخر حديثه إن من توبتي أني أنخلع من مالي صدقة إلى الله ورسوله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6691,
			"arabicnumber": 6691,
			"text": "حدثنا الحسن بن محمد، حدثنا الحجاج، عن ابن جريج، قال زعم عطاء أنه سمع عبيد بن عمير، يقول سمعت عائشة، تزعم أن النبي صلى الله عليه وسلم كان يمكث عند زينب بنت جحش، ويشرب عندها عسلا، فتواصيت أنا وحفصة أن أيتنا دخل عليها النبي صلى الله عليه وسلم فلتقل إني أجد منك ريح مغافير، أكلت مغافير فدخل على إحداهما فقالت ذلك له‏.‏ فقال ‏\"‏ لا بل شربت عسلا عند زينب بنت جحش، ولن أعود له ‏\"‏‏.‏ فنزلت ‏{‏يا أيها النبي لم تحرم ما أحل الله لك‏}‏، ‏{‏إن تتوبا إلى الله‏}‏، لعائشة وحفصة، ‏{‏وإذ أسر النبي إلى بعض أزواجه حديثا‏}‏ لقوله ‏\"‏ بل شربت عسلا ‏\"‏‏.‏ وقال لي إبراهيم بن موسى عن هشام، ‏\"‏ ولن أعود له، وقد حلفت، فلا تخبري بذلك أحدا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6692,
			"arabicnumber": 6692,
			"text": "حدثنا يحيى بن صالح، حدثنا فليح بن سليمان، حدثنا سعيد بن الحارث، أنه سمع ابن عمر ـ رضى الله عنهما ـ يقول أولم ينهوا عن النذر إن النبي صلى الله عليه وسلم قال ‏ \"‏ إن النذر لا يقدم شيئا، ولا يؤخر، وإنما يستخرج بالنذر من البخيل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6693,
			"arabicnumber": 6693,
			"text": "حدثنا خلاد بن يحيى، حدثنا سفيان، عن منصور، أخبرنا عبد الله بن مرة، عن عبد الله بن عمر، نهى النبي صلى الله عليه وسلم عن النذر وقال ‏ \"‏ إنه لا يرد شيئا، ولكنه يستخرج به من البخيل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6694,
			"arabicnumber": 6694,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏ \"‏ لا يأتي ابن آدم النذر بشىء لم يكن قدر له، ولكن يلقيه النذر إلى القدر قد قدر له، فيستخرج الله به من البخيل، فيؤتي عليه ما لم يكن يؤتي عليه من قبل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6695,
			"arabicnumber": 6695,
			"text": "حدثنا مسدد، عن يحيى، عن شعبة، قال حدثني أبو جمرة، حدثنا زهدم بن مضرب، قال سمعت عمران بن حصين، يحدث عن النبي صلى الله عليه وسلم قال ‏ \"‏ خيركم قرني، ثم الذين يلونهم، ثم الذين يلونهم ـ قال عمران لا أدري ذكر ثنتين أو ثلاثا بعد قرنه ـ ثم يجيء قوم ينذرون ولا يفون، ويخونون ولا يؤتمنون، ويشهدون ولا يستشهدون، ويظهر فيهم السمن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6696,
			"arabicnumber": 6696,
			"text": "حدثنا أبو نعيم، حدثنا مالك، عن طلحة بن عبد الملك، عن القاسم، عن عائشة ـ رضى الله عنها ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ من نذر أن يطيع الله فليطعه، ومن نذر أن يعصيه فلا يعصه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6697,
			"arabicnumber": 6697,
			"text": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا عبيد الله بن عمر، عن نافع، عن ابن عمر، أن عمر، قال يا رسول الله إني نذرت في الجاهلية أن أعتكف ليلة في المسجد الحرام‏.‏ قال ‏ \"‏ أوف بنذرك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6698,
			"arabicnumber": 6698,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني عبيد الله بن عبد الله، أن عبد الله بن عباس، أخبره أن سعد بن عبادة الأنصاري استفتى النبي صلى الله عليه وسلم في نذر كان على أمه، فتوفيت قبل أن تقضيه‏.‏ فأفتاه أن يقضيه عنها، فكانت سنة بعد‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6699,
			"arabicnumber": 6699,
			"text": "حدثنا آدم، حدثنا شعبة، عن أبي بشر، قال سمعت سعيد بن جبير، عن ابن عباس ـ رضى الله عنهما ـ قال أتى رجل النبي صلى الله عليه وسلم فقال له إن أختي نذرت أن تحج وإنها ماتت‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لو كان عليها دين أكنت قاضيه ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فاقض الله، فهو أحق بالقضاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6700,
			"arabicnumber": 6700,
			"text": "حدثنا أبو عاصم، عن مالك، عن طلحة بن عبد الملك، عن القاسم، عن عائشة ـ رضى الله عنها ـ قالت قال النبي صلى الله عليه وسلم ‏ \"‏ من نذر أن يطيع الله فليطعه، ومن نذر أن يعصيه فلا يعصه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6701,
			"arabicnumber": 6701,
			"text": "حدثنا مسدد، حدثنا يحيى، عن حميد، عن ثابت، عن أنس، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الله لغني عن تعذيب هذا نفسه ‏\"‏‏.‏ ورآه يمشي بين ابنيه‏.‏ وقال الفزاري عن حميد حدثني ثابت عن أنس",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6702,
			"arabicnumber": 6702,
			"text": "حدثنا أبو عاصم، عن ابن جريج، عن سليمان الأحول، عن طاوس، عن ابن عباس، أن النبي صلى الله عليه وسلم رأى رجلا يطوف بالكعبة بزمام أو غيره، فقطعه‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6703,
			"arabicnumber": 6703,
			"text": "حدثنا إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبرهم قال أخبرني سليمان الأحول، أن طاوسا، أخبره عن ابن عباس ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم مر وهو يطوف بالكعبة بإنسان يقود إنسانا بخزامة في أنفه، فقطعها النبي صلى الله عليه وسلم بيده، ثم أمره أن يقوده بيده",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6704,
			"arabicnumber": 6704,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا أيوب، عن عكرمة، عن ابن عباس، قال بينا النبي صلى الله عليه وسلم يخطب إذا هو برجل قائم فسأل عنه فقالوا أبو إسرائيل نذر أن يقوم ولا يقعد ولا يستظل ولا يتكلم ويصوم‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ مره فليتكلم وليستظل وليقعد وليتم صومه ‏\"‏‏.‏ قال عبد الوهاب حدثنا أيوب، عن عكرمة، عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6705,
			"arabicnumber": 6705,
			"text": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، حدثنا حكيم بن أبي حرة الأسلمي، أنه سمع عبد الله بن عمر ـ رضى الله عنهما ـ سئل عن رجل، نذر أن لا، يأتي عليه يوم إلا صام، فوافق يوم أضحى أو فطر‏.‏ فقال لقد كان لكم في رسول الله أسوة حسنة، لم يكن يصوم يوم الأضحى والفطر، ولا يرى صيامهما‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6706,
			"arabicnumber": 6706,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا يزيد بن زريع، عن يونس، عن زياد بن جبير، قال كنت مع ابن عمر فسأله رجل فقال نذرت أن أصوم كل يوم ثلاثاء أو أربعاء ما عشت، فوافقت هذا اليوم يوم النحر‏.‏ فقال أمر الله بوفاء النذر، ونهينا أن نصوم يوم النحر‏.‏ فأعاد عليه فقال مثله، لا يزيد عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6707,
			"arabicnumber": 6707,
			"text": "حدثنا إسماعيل، قال حدثني مالك، عن ثور بن زيد الديلي، عن أبي الغيث، مولى ابن مطيع عن أبي هريرة، قال خرجنا مع رسول الله صلى الله عليه وسلم يوم خيبر فلم نغنم ذهبا ولا فضة إلا الأموال والثياب والمتاع، فأهدى رجل من بني الضبيب يقال له رفاعة بن زيد لرسول الله صلى الله عليه وسلم غلاما يقال له مدعم، فوجه رسول الله صلى الله عليه وسلم إلى وادي القرى حتى إذا كان بوادي القرى بينما مدعم يحط رحلا لرسول الله صلى الله عليه وسلم إذا سهم عائر فقتله، فقال الناس هنيئا له الجنة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلا والذي نفسي بيده إن الشملة التي أخذها يوم خيبر من المغانم، لم تصبها المقاسم، لتشتعل عليه نارا ‏\"‏‏.‏ فلما سمع ذلك الناس جاء رجل بشراك أو شراكين إلى النبي صلى الله عليه وسلم فقال ‏\"‏ شراك من نار ـ أو ـ شراكان من نار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 84
			}
		}
	]
}