{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"9": "Times of the Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 522,
			"arabicnumber": 522,
			"text": "",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 523,
			"arabicnumber": 523,
			"text": "حدثنا قتيبة بن سعيد، قال حدثنا عباد ـ هو ابن عباد ـ عن أبي جمرة، عن ابن عباس، قال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا إنا من هذا الحى من ربيعة، ولسنا نصل إليك إلا في الشهر الحرام، فمرنا بشىء نأخذه عنك، وندعو إليه من وراءنا‏.‏ فقال ‏ \"‏ آمركم بأربع، وأنهاكم عن أربع الإيمان بالله ـ ثم فسرها لهم شهادة أن لا إله إلا الله، وأني رسول الله، وإقام الصلاة، وإيتاء الزكاة، وأن تؤدوا إلى خمس ما غنمتم، وأنهى عن الدباء والحنتم والمقير والنقير ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 524,
			"arabicnumber": 524,
			"text": "حدثنا محمد بن المثنى، قال حدثنا يحيى، قال حدثنا إسماعيل، قال حدثنا قيس، عن جرير بن عبد الله، قال بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة، وإيتاء الزكاة، والنصح لكل مسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 525,
			"arabicnumber": 525,
			"text": "حدثنا مسدد، قال حدثنا يحيى، عن الأعمش، قال حدثني شقيق، قال سمعت حذيفة، قال كنا جلوسا عند عمر ـ رضى الله عنه ـ فقال أيكم يحفظ قول رسول الله صلى الله عليه وسلم في الفتنة قلت أنا، كما قاله‏.‏ قال إنك عليه ـ أو عليها ـ لجريء‏.‏ قلت ‏ \"‏ فتنة الرجل في أهله وماله وولده وجاره تكفرها الصلاة والصوم والصدقة والأمر والنهى ‏\"‏‏.‏ قال ليس هذا أريد، ولكن الفتنة التي تموج كما يموج البحر‏.‏ قال ليس عليك منها بأس يا أمير المؤمنين، إن بينك وبينها بابا مغلقا‏.‏ قال أيكسر أم يفتح قال يكسر‏.‏ قال إذا لا يغلق أبدا‏.‏ قلنا أكان عمر يعلم الباب قال نعم، كما أن دون الغد الليلة، إني حدثته بحديث ليس بالأغاليط‏.‏ فهبنا أن نسأل حذيفة، فأمرنا مسروقا فسأله فقال الباب عمر‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 526,
			"arabicnumber": 526,
			"text": "حدثنا قتيبة، قال حدثنا يزيد بن زريع، عن سليمان التيمي، عن أبي عثمان النهدي، عن ابن مسعود، أن رجلا، أصاب من امرأة قبلة، فأتى النبي صلى الله عليه وسلم فأخبره، فأنزل الله ‏{‏أقم الصلاة طرفى النهار وزلفا من الليل إن الحسنات يذهبن السيئات‏}‏‏.‏ فقال الرجل يا رسول الله ألي هذا قال ‏\"‏ لجميع أمتي كلهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 527,
			"arabicnumber": 527,
			"text": "حدثنا أبو الوليد، هشام بن عبد الملك قال حدثنا شعبة، قال الوليد بن العيزار أخبرني قال سمعت أبا عمرو الشيباني، يقول حدثنا صاحب، هذه الدار وأشار إلى دار عبد الله قال سألت النبي صلى الله عليه وسلم أى العمل أحب إلى الله قال ‏\"‏ الصلاة على وقتها ‏\"‏‏.‏ قال ثم أى قال ‏\"‏ ثم بر الوالدين ‏\"‏‏.‏ قال ثم أى قال ‏\"‏ الجهاد في سبيل الله ‏\"‏‏.‏ قال حدثني بهن ولو استزدته لزادني‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 528,
			"arabicnumber": 528,
			"text": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم، يغتسل فيه كل يوم خمسا، ما تقول ذلك يبقي من درنه ‏\"‏‏.‏ قالوا لا يبقي من درنه شيئا‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس، يمحو الله بها الخطايا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 529,
			"arabicnumber": 529,
			"text": "حدثنا موسى بن إسماعيل، قال حدثنا مهدي، عن غيلان، عن أنس، قال ما أعرف شيئا مما كان على عهد النبي صلى الله عليه وسلم‏.‏ قيل الصلاة‏.‏ قال أليس ضيعتم ما ضيعتم فيها‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 530,
			"arabicnumber": 530,
			"text": "حدثنا عمرو بن زرارة، قال أخبرنا عبد الواحد بن واصل أبو عبيدة الحداد، عن عثمان بن أبي رواد، أخي عبد العزيز قال سمعت الزهري، يقول دخلت على أنس بن مالك بدمشق وهو يبكي فقلت ما يبكيك فقال لا أعرف شيئا مما أدركت إلا هذه الصلاة، وهذه الصلاة قد ضيعت‏.‏ وقال بكر حدثنا محمد بن بكر البرساني أخبرنا عثمان بن أبي رواد نحوه‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 531,
			"arabicnumber": 531,
			"text": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، عن قتادة، عن أنس، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن أحدكم إذا صلى يناجي ربه فلا يتفلن عن يمينه، ولكن تحت قدمه اليسرى ‏\"‏‏.‏ وقال سعيد عن قتادة لا يتفل قدامه أو بين يديه، ولكن عن يساره أو تحت قدميه‏.‏ وقال شعبة لا يبزق بين يديه ولا عن يمينه، ولكن عن يساره أو تحت قدمه‏.‏ وقال حميد عن أنس عن النبي صلى الله عليه وسلم ‏\"‏ لا يبزق في القبلة ولا عن يمينه، ولكن عن يساره أو تحت قدمه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 532,
			"arabicnumber": 532,
			"text": "حدثنا حفص بن عمر، قال حدثنا يزيد بن إبراهيم، قال حدثنا قتادة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏ \"‏ اعتدلوا في السجود، ولا يبسط ذراعيه كالكلب، وإذا بزق فلا يبزقن بين يديه ولا عن يمينه، فإنه يناجي ربه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 534,
			"arabicnumber": 534,
			"text": "",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 535,
			"arabicnumber": 535,
			"text": "حدثنا ابن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن المهاجر أبي الحسن، سمع زيد بن وهب، عن أبي ذر، قال أذن مؤذن النبي صلى الله عليه وسلم الظهر فقال ‏\"‏ أبرد أبرد ـ أو قال ـ انتظر انتظر ‏\"‏‏.‏ وقال ‏\"‏ شدة الحر من فيح جهنم، فإذا اشتد الحر فأبردوا عن الصلاة ‏\"‏‏.‏ حتى رأينا فىء التلول‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 537,
			"arabicnumber": 537,
			"text": "",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 538,
			"arabicnumber": 538,
			"text": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أبردوا بالظهر، فإن شدة الحر من فيح جهنم ‏\"‏‏.‏ تابعه سفيان ويحيى وأبو عوانة عن الأعمش‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 539,
			"arabicnumber": 539,
			"text": "حدثنا آدم بن أبي إياس، قال حدثنا شعبة، قال حدثنا مهاجر أبو الحسن، مولى لبني تيم الله قال سمعت زيد بن وهب، عن أبي ذر الغفاري، قال كنا مع النبي صلى الله عليه وسلم في سفر، فأراد المؤذن أن يؤذن للظهر فقال النبي صلى الله عليه وسلم ‏\"‏ أبرد ‏\"‏‏.‏ ثم أراد أن يؤذن فقال له ‏\"‏ أبرد ‏\"‏‏.‏ حتى رأينا فىء التلول، فقال النبي صلى الله عليه وسلم ‏\"‏ إن شدة الحر من فيح جهنم، فإذا اشتد الحر فأبردوا بالصلاة ‏\"‏‏.‏ وقال ابن عباس تتفيأ تتميل‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 540,
			"arabicnumber": 540,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني أنس بن مالك، أن رسول الله صلى الله عليه وسلم خرج حين زاغت الشمس فصلى الظهر، فقام على المنبر، فذكر الساعة، فذكر أن فيها أمورا عظاما ثم قال ‏\"‏ من أحب أن يسأل عن شىء فليسأل، فلا تسألوني عن شىء إلا أخبرتكم ما دمت في مقامي هذا ‏\"‏‏.‏ فأكثر الناس في البكاء، وأكثر أن يقول ‏\"‏ سلوني ‏\"‏‏.‏ فقام عبد الله بن حذافة السهمي فقال من أبي قال ‏\"‏ أبوك حذافة ‏\"‏‏.‏ ثم أكثر أن يقول ‏\"‏ سلوني ‏\"‏‏.‏ فبرك عمر على ركبتيه فقال رضينا بالله ربا، وبالإسلام دينا، وبمحمد نبيا‏.‏ فسكت ثم قال ‏\"‏ عرضت على الجنة والنار آنفا في عرض هذا الحائط فلم أر كالخير والشر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 541,
			"arabicnumber": 541,
			"text": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن أبي المنهال، عن أبي برزة، كان النبي صلى الله عليه وسلم يصلي الصبح وأحدنا يعرف جليسه، ويقرأ فيها ما بين الستين إلى المائة، ويصلي الظهر إذا زالت الشمس، والعصر وأحدنا يذهب إلى أقصى المدينة ثم يرجع والشمس حية، ونسيت ما قال في المغرب، ولا يبالي بتأخير العشاء إلى ثلث الليل‏.‏ ثم قال إلى شطر الليل‏.‏ وقال معاذ قال شعبة ثم لقيته مرة فقال أو ثلث الليل‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 542,
			"arabicnumber": 542,
			"text": "حدثنا محمد ـ يعني ابن مقاتل ـ قال أخبرنا عبد الله، قال أخبرنا خالد بن عبد الرحمن، حدثني غالب القطان، عن بكر بن عبد الله المزني، عن أنس بن مالك، قال كنا إذا صلينا خلف رسول الله صلى الله عليه وسلم بالظهائر فسجدنا على ثيابنا اتقاء الحر‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 543,
			"arabicnumber": 543,
			"text": "حدثنا أبو النعمان، قال حدثنا حماد ـ هو ابن زيد ـ عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، أن النبي صلى الله عليه وسلم صلى بالمدينة سبعا وثمانيا الظهر والعصر، والمغرب والعشاء‏.‏ فقال أيوب لعله في ليلة مطيرة‏.‏ قال عسى‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 544,
			"arabicnumber": 544,
			"text": "حدثنا إبراهيم بن المنذر، قال حدثنا أنس بن عياض، عن هشام، عن أبيه، أن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي العصر والشمس لم تخرج من حجرتها‏.‏ وقال أبو أسامة عن هشام من قعر حجرتها‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 545,
			"arabicnumber": 545,
			"text": "حدثنا قتيبة، قال حدثنا الليث، عن ابن شهاب، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم صلى العصر والشمس في حجرتها، لم يظهر الفىء من حجرتها‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 546,
			"arabicnumber": 546,
			"text": "حدثنا أبو نعيم، قال أخبرنا ابن عيينة، عن الزهري، عن عروة، عن عائشة، قالت كان النبي صلى الله عليه وسلم يصلي صلاة العصر والشمس طالعة في حجرتي لم يظهر الفىء بعد‏.‏ وقال مالك ويحيى بن سعيد وشعيب وابن أبي حفصة والشمس قبل أن تظهر‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 547,
			"arabicnumber": 547,
			"text": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله، قال أخبرنا عوف، عن سيار بن سلامة، قال دخلت أنا وأبي، على أبي برزة الأسلمي، فقال له أبي كيف كان رسول الله صلى الله عليه وسلم يصلي المكتوبة فقال كان يصلي الهجير التي تدعونها الأولى حين تدحض الشمس، ويصلي العصر، ثم يرجع أحدنا إلى رحله في أقصى المدينة والشمس حية ـ ونسيت ما قال في المغرب ـ وكان يستحب أن يؤخر العشاء التي تدعونها العتمة، وكان يكره النوم قبلها والحديث بعدها، وكان ينفتل من صلاة الغداة حين يعرف الرجل جليسه، ويقرأ بالستين إلى المائة‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 548,
			"arabicnumber": 548,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنا نصلي العصر ثم يخرج الإنسان إلى بني عمرو بن عوف فنجدهم يصلون العصر‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 549,
			"arabicnumber": 549,
			"text": "حدثنا ابن مقاتل، قال أخبرنا عبد الله، قال أخبرنا أبو بكر بن عثمان بن سهل بن حنيف، قال سمعت أبا أمامة، يقول صلينا مع عمر بن عبد العزيز الظهر، ثم خرجنا حتى دخلنا على أنس بن مالك فوجدناه يصلي العصر فقلت يا عم، ما هذه الصلاة التي صليت قال العصر، وهذه صلاة رسول الله صلى الله عليه وسلم التي كنا نصلي معه‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 550,
			"arabicnumber": 550,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال حدثني أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم يصلي العصر والشمس مرتفعة حية، فيذهب الذاهب إلى العوالي فيأتيهم والشمس مرتفعة، وبعض العوالي من المدينة على أربعة أميال أو نحوه‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 551,
			"arabicnumber": 551,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن ابن شهاب، عن أنس بن مالك، قال كنا نصلي العصر ثم يذهب الذاهب منا إلى قباء، فيأتيهم والشمس مرتفعة‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 552,
			"arabicnumber": 552,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الذي تفوته صلاة العصر كأنما وتر أهله وماله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 553,
			"arabicnumber": 553,
			"text": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، قال حدثنا يحيى بن أبي كثير، عن أبي قلابة، عن أبي المليح، قال كنا مع بريدة في غزوة في يوم ذي غيم فقال بكروا بصلاة العصر فإن النبي صلى الله عليه وسلم قال ‏ \"‏ من ترك صلاة العصر فقد حبط عمله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 554,
			"arabicnumber": 554,
			"text": "حدثنا الحميدي، قال حدثنا مروان بن معاوية، قال حدثنا إسماعيل، عن قيس، عن جرير، قال كنا عند النبي صلى الله عليه وسلم فنظر إلى القمر ليلة ـ يعني البدر ـ فقال ‏\"‏ إنكم سترون ربكم كما ترون هذا القمر لا تضامون في رؤيته، فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وقبل غروبها فافعلوا ‏\"‏‏.‏ ثم قرأ ‏{‏وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب‏}‏‏.‏ قال إسماعيل افعلوا لا تفوتنكم‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 555,
			"arabicnumber": 555,
			"text": "حدثنا عبد الله بن يوسف، قال حدثنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يتعاقبون فيكم ملائكة بالليل وملائكة بالنهار، ويجتمعون في صلاة الفجر وصلاة العصر، ثم يعرج الذين باتوا فيكم، فيسألهم وهو أعلم بهم كيف تركتم عبادي فيقولون تركناهم وهم يصلون، وأتيناهم وهم يصلون ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 556,
			"arabicnumber": 556,
			"text": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا أدرك أحدكم سجدة من صلاة العصر قبل أن تغرب الشمس فليتم صلاته، وإذا أدرك سجدة من صلاة الصبح قبل أن تطلع الشمس فليتم صلاته ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 557,
			"arabicnumber": 557,
			"text": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أنه أخبره أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إنما بقاؤكم فيما سلف قبلكم من الأمم كما بين صلاة العصر إلى غروب الشمس، أوتي أهل التوراة التوراة فعملوا حتى إذا انتصف النهار عجزوا، فأعطوا قيراطا قيراطا، ثم أوتي أهل الإنجيل الإنجيل فعملوا إلى صلاة العصر، ثم عجزوا، فأعطوا قيراطا قيراطا، ثم أوتينا القرآن فعملنا إلى غروب الشمس، فأعطينا قيراطين قيراطين، فقال أهل الكتابين أى ربنا أعطيت هؤلاء قيراطين قيراطين، وأعطيتنا قيراطا قيراطا، ونحن كنا أكثر عملا، قال قال الله عز وجل هل ظلمتكم من أجركم من شىء قالوا لا، قال فهو فضلي أوتيه من أشاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 558,
			"arabicnumber": 558,
			"text": "حدثنا أبو كريب، قال حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم ‏ \"‏ مثل المسلمين واليهود والنصارى كمثل رجل استأجر قوما يعملون له عملا إلى الليل، فعملوا إلى نصف النهار، فقالوا لا حاجة لنا إلى أجرك، فاستأجر آخرين فقال أكملوا بقية يومكم، ولكم الذي شرطت، فعملوا حتى إذا كان حين صلاة العصر قالوا لك ما عملنا‏.‏ فاستأجر قوما فعملوا بقية يومهم حتى غابت الشمس، واستكملوا أجر الفريقين ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 559,
			"arabicnumber": 559,
			"text": "حدثنا محمد بن مهران، قال حدثنا الوليد، قال حدثنا الأوزاعي، قال حدثنا أبو النجاشي، صهيب مولى رافع بن خديج قال سمعت رافع بن خديج، يقول كنا نصلي المغرب مع النبي صلى الله عليه وسلم فينصرف أحدنا وإنه ليبصر مواقع نبله‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 560,
			"arabicnumber": 560,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن سعد، عن محمد بن عمرو بن الحسن بن علي، قال قدم الحجاج فسألنا جابر بن عبد الله فقال كان النبي صلى الله عليه وسلم يصلي الظهر بالهاجرة، والعصر والشمس نقية، والمغرب إذا وجبت، والعشاء أحيانا وأحيانا، إذا رآهم اجتمعوا عجل، وإذا رآهم أبطوا أخر، والصبح كانوا ـ أو كان النبي صلى الله عليه وسلم يصليها بغلس‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 561,
			"arabicnumber": 561,
			"text": "حدثنا المكي بن إبراهيم، قال حدثنا يزيد بن أبي عبيد، عن سلمة، قال كنا نصلي مع النبي صلى الله عليه وسلم المغرب إذا توارت بالحجاب‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 562,
			"arabicnumber": 562,
			"text": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا عمرو بن دينار، قال سمعت جابر بن زيد، عن ابن عباس، قال صلى النبي صلى الله عليه وسلم سبعا جميعا وثمانيا جميعا‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 563,
			"arabicnumber": 563,
			"text": "حدثنا أبو معمر ـ هو عبد الله بن عمرو ـ قال حدثنا عبد الوارث، عن الحسين، قال حدثنا عبد الله بن بريدة، قال حدثني عبد الله المزني، أن النبي صلى الله عليه وسلم قال ‏ \"‏ لا تغلبنكم الأعراب على اسم صلاتكم المغرب ‏\"‏‏.‏ قال الأعراب وتقول هي العشاء‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 564,
			"arabicnumber": 564,
			"text": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا يونس، عن الزهري، قال سالم أخبرني عبد الله، قال صلى لنا رسول الله صلى الله عليه وسلم ليلة صلاة العشاء ـ وهى التي يدعو الناس العتمة ـ ثم انصرف فأقبل علينا فقال ‏ \"‏ أرأيتم ليلتكم هذه فإن رأس مائة سنة منها لا يبقى ممن هو على ظهر الأرض أحد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 565,
			"arabicnumber": 565,
			"text": "حدثنا مسلم بن إبراهيم، قال حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو ـ هو ابن الحسن بن علي ـ قال سألنا جابر بن عبد الله عن صلاة النبي، صلى الله عليه وسلم فقال كان يصلي الظهر بالهاجرة، والعصر والشمس حية، والمغرب إذا وجبت، والعشاء إذا كثر الناس عجل، وإذا قلوا أخر، والصبح بغلس‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 566,
			"arabicnumber": 566,
			"text": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة، أن عائشة، أخبرته قالت، أعتم رسول الله صلى الله عليه وسلم ليلة بالعشاء، وذلك قبل أن يفشو الإسلام، فلم يخرج حتى قال عمر نام النساء والصبيان‏.‏ فخرج فقال لأهل المسجد ‏ \"‏ ما ينتظرها أحد من أهل الأرض غيركم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 567,
			"arabicnumber": 567,
			"text": "حدثنا محمد بن العلاء، قال أخبرنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال كنت أنا وأصحابي الذين، قدموا معي في السفينة نزولا في بقيع بطحان، والنبي صلى الله عليه وسلم بالمدينة، فكان يتناوب النبي صلى الله عليه وسلم عند صلاة العشاء كل ليلة نفر منهم، فوافقنا النبي ـ عليه السلام ـ أنا وأصحابي وله بعض الشغل في بعض أمره فأعتم بالصلاة حتى ابهار الليل، ثم خرج النبي صلى الله عليه وسلم فصلى بهم، فلما قضى صلاته قال لمن حضره ‏\"‏ على رسلكم، أبشروا إن من نعمة الله عليكم أنه ليس أحد من الناس يصلي هذه الساعة غيركم ‏\"‏‏.‏ أو قال ‏\"‏ ما صلى هذه الساعة أحد غيركم ‏\"‏‏.‏ لا يدري أى الكلمتين قال‏.‏ قال أبو موسى فرجعنا ففرحنا بما سمعنا من رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 568,
			"arabicnumber": 568,
			"text": "حدثنا محمد بن سلام، قال أخبرنا عبد الوهاب الثقفي، قال حدثنا خالد الحذاء، عن أبي المنهال، عن أبي برزة، أن رسول الله صلى الله عليه وسلم كان يكره النوم قبل العشاء والحديث بعدها‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 569,
			"arabicnumber": 569,
			"text": "حدثنا أيوب بن سليمان، قال حدثني أبو بكر، عن سليمان، قال صالح بن كيسان أخبرني ابن شهاب، عن عروة، أن عائشة، قالت أعتم رسول الله صلى الله عليه وسلم بالعشاء حتى ناداه عمر الصلاة، نام النساء والصبيان‏.‏ فخرج فقال ‏ \"‏ ما ينتظرها أحد من أهل الأرض غيركم ‏\"‏‏.‏ قال ولا يصلى يومئذ إلا بالمدينة، وكانوا يصلون فيما بين أن يغيب الشفق إلى ثلث الليل الأول‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 571,
			"arabicnumber": 571,
			"text": "",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 572,
			"arabicnumber": 572,
			"text": "حدثنا عبد الرحيم المحاربي، قال حدثنا زائدة، عن حميد الطويل، عن أنس، قال أخر النبي صلى الله عليه وسلم صلاة العشاء إلى نصف الليل، ثم صلى ثم قال ‏ \"‏ قد صلى الناس وناموا، أما إنكم في صلاة ما انتظرتموها ‏\"‏‏.‏ وزاد ابن أبي مريم أخبرنا يحيى بن أيوب حدثني حميد سمع أنسا كأني أنظر إلى وبيص خاتمه ليلتئذ‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 573,
			"arabicnumber": 573,
			"text": "حدثنا مسدد، قال حدثنا يحيى، عن إسماعيل، حدثنا قيس، قال لي جرير بن عبد الله كنا عند النبي صلى الله عليه وسلم إذ نظر إلى القمر ليلة البدر فقال ‏\"‏ أما إنكم سترون ربكم كما ترون هذا، لا تضامون ـ أو لا تضاهون ـ في رؤيته، فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس، وقبل غروبها فافعلوا ‏\"‏‏.‏ ثم قال ‏\"‏ فسبح بحمد ربك قبل طلوع الشمس وقبل غروبها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 574,
			"arabicnumber": 574,
			"text": "حدثنا هدبة بن خالد، قال حدثنا همام، حدثني أبو جمرة، عن أبي بكر بن أبي موسى، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من صلى البردين دخل الجنة ‏\"‏‏.‏ وقال ابن رجاء حدثنا همام عن أبي جمرة أن أبا بكر بن عبد الله بن قيس أخبره بهذا‏.‏ حدثنا إسحاق، عن حبان، حدثنا همام، حدثنا أبو جمرة، عن أبي بكر بن عبد الله، عن أبيه، عن النبي صلى الله عليه وسلم مثله‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 575,
			"arabicnumber": 575,
			"text": "حدثنا عمرو بن عاصم، قال حدثنا همام، عن قتادة، عن أنس، أن زيد بن ثابت، حدثه أنهم، تسحروا مع النبي صلى الله عليه وسلم ثم قاموا إلى الصلاة‏.‏ قلت كم بينهما قال قدر خمسين أو ستين ـ يعني آية ـ ح‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 576,
			"arabicnumber": 576,
			"text": "حدثنا حسن بن صباح، سمع روحا، حدثنا سعيد، عن قتادة، عن أنس بن مالك، أن نبي الله صلى الله عليه وسلم وزيد بن ثابت تسحرا، فلما فرغا من سحورهما قام نبي الله صلى الله عليه وسلم إلى الصلاة فصلى‏.‏ قلنا لأنس كم كان بين فراغهما من سحورهما ودخولهما في الصلاة قال قدر ما يقرأ الرجل خمسين آية‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 577,
			"arabicnumber": 577,
			"text": "حدثنا إسماعيل بن أبي أويس، عن أخيه، عن سليمان، عن أبي حازم، أنه سمع سهل بن سعد، يقول كنت أتسحر في أهلي ثم يكون سرعة بي أن أدرك صلاة الفجر مع رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 578,
			"arabicnumber": 578,
			"text": "حدثنا يحيى بن بكير، قال أخبرنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، أخبرته قالت، كن نساء المؤمنات يشهدن مع رسول الله صلى الله عليه وسلم صلاة الفجر متلفعات بمروطهن، ثم ينقلبن إلى بيوتهن حين يقضين الصلاة، لا يعرفهن أحد من الغلس‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 579,
			"arabicnumber": 579,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، يحدثونه عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أدرك من الصبح ركعة قبل أن تطلع الشمس فقد أدرك الصبح، ومن أدرك ركعة من العصر قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 580,
			"arabicnumber": 580,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أدرك ركعة من الصلاة فقد أدرك الصلاة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 581,
			"arabicnumber": 581,
			"text": "حدثنا حفص بن عمر، قال حدثنا هشام، عن قتادة، عن أبي العالية، عن ابن عباس، قال شهد عندي رجال مرضيون وأرضاهم عندي عمر أن النبي صلى الله عليه وسلم نهى عن الصلاة بعد الصبح حتى تشرق الشمس، وبعد العصر حتى تغرب‏.‏ حدثنا مسدد، قال حدثنا يحيى، عن شعبة، عن قتادة، سمعت أبا العالية، عن ابن عباس، قال حدثني ناس، بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 583,
			"arabicnumber": 583,
			"text": "",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 584,
			"arabicnumber": 584,
			"text": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن بيعتين وعن لبستين وعن صلاتين نهى عن الصلاة بعد الفجر حتى تطلع الشمس، وبعد العصر حتى تغرب الشمس، وعن اشتمال الصماء وعن الاحتباء في ثوب واحد يفضي بفرجه إلى السماء، وعن المنابذة والملامسة‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 585,
			"arabicnumber": 585,
			"text": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يتحرى أحدكم فيصلي عند طلوع الشمس ولا عند غروبها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 586,
			"arabicnumber": 586,
			"text": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عطاء بن يزيد الجندعي، أنه سمع أبا سعيد الخدري، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا صلاة بعد الصبح حتى ترتفع الشمس، ولا صلاة بعد العصر حتى تغيب الشمس ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 587,
			"arabicnumber": 587,
			"text": "حدثنا محمد بن أبان، قال حدثنا غندر، قال حدثنا شعبة، عن أبي التياح، قال سمعت حمران بن أبان، يحدث عن معاوية، قال إنكم لتصلون صلاة، لقد صحبنا رسول الله صلى الله عليه وسلم فما رأيناه يصليها، ولقد نهى عنهما، يعني الركعتين بعد العصر‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 588,
			"arabicnumber": 588,
			"text": "حدثنا محمد بن سلام، قال حدثنا عبدة، عن عبيد الله، عن خبيب، عن حفص بن عاصم، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن صلاتين بعد الفجر حتى تطلع الشمس، وبعد العصر حتى تغرب الشمس‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 589,
			"arabicnumber": 589,
			"text": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر، قال أصلي كما رأيت أصحابي يصلون، لا أنهى أحدا يصلي بليل ولا نهار ما شاء، غير أن لا تحروا طلوع الشمس ولا غروبها‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 590,
			"arabicnumber": 590,
			"text": "حدثنا أبو نعيم، قال حدثنا عبد الواحد بن أيمن، قال حدثني أبي أنه، سمع عائشة، قالت والذي ذهب به ما تركهما حتى لقي الله، وما لقي الله تعالى حتى ثقل عن الصلاة، وكان يصلي كثيرا من صلاته قاعدا ـ تعني الركعتين بعد العصر ـ وكان النبي صلى الله عليه وسلم يصليهما، ولا يصليهما في المسجد مخافة أن يثقل على أمته، وكان يحب ما يخفف عنهم‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 591,
			"arabicnumber": 591,
			"text": "حدثنا مسدد، قال حدثنا يحيى، قال حدثنا هشام، قال أخبرني أبي قالت، عائشة ابن أختي ما ترك النبي صلى الله عليه وسلم السجدتين بعد العصر عندي قط‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 592,
			"arabicnumber": 592,
			"text": "حدثنا موسى بن إسماعيل، قال حدثنا عبد الواحد، قال حدثنا الشيباني، قال حدثنا عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت ركعتان لم يكن رسول الله صلى الله عليه وسلم يدعهما سرا ولا علانية ركعتان قبل صلاة الصبح، وركعتان بعد العصر‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 593,
			"arabicnumber": 593,
			"text": "حدثنا محمد بن عرعرة، قال حدثنا شعبة، عن أبي إسحاق، قال رأيت الأسود ومسروقا شهدا على عائشة قالت ما كان النبي صلى الله عليه وسلم يأتيني في يوم بعد العصر إلا صلى ركعتين‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 594,
			"arabicnumber": 594,
			"text": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى ـ هو ابن أبي كثير ـ عن أبي قلابة، أن أبا المليح، حدثه قال كنا مع بريدة في يوم ذي غيم فقال بكروا بالصلاة فإن النبي صلى الله عليه وسلم قال ‏ \"‏ من ترك صلاة العصر حبط عمله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 595,
			"arabicnumber": 595,
			"text": "حدثنا عمران بن ميسرة، قال حدثنا محمد بن فضيل، قال حدثنا حصين، عن عبد الله بن أبي قتادة، عن أبيه، قال سرنا مع النبي صلى الله عليه وسلم ليلة فقال بعض القوم لو عرست بنا يا رسول الله‏.‏ قال ‏\"‏ أخاف أن تناموا عن الصلاة ‏\"‏‏.‏ قال بلال أنا أوقظكم‏.‏ فاضطجعوا وأسند بلال ظهره إلى راحلته، فغلبته عيناه فنام، فاستيقظ النبي صلى الله عليه وسلم وقد طلع حاجب الشمس فقال ‏\"‏ يا بلال أين ما قلت ‏\"‏‏.‏ قال ما ألقيت على نومة مثلها قط‏.‏ قال ‏\"‏ إن الله قبض أرواحكم حين شاء، وردها عليكم حين شاء، يا بلال قم فأذن بالناس بالصلاة ‏\"‏‏.‏ فتوضأ فلما ارتفعت الشمس وابياضت قام فصلى‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 596,
			"arabicnumber": 596,
			"text": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن أبي سلمة، عن جابر بن عبد الله، أن عمر بن الخطاب، جاء يوم الخندق بعد ما غربت الشمس، فجعل يسب كفار قريش قال يا رسول الله ما كدت أصلي العصر حتى كادت الشمس تغرب‏.‏ قال النبي صلى الله عليه وسلم ‏ \"‏ والله ما صليتها ‏\"‏‏.‏ فقمنا إلى بطحان، فتوضأ للصلاة، وتوضأنا لها فصلى العصر بعد ما غربت الشمس، ثم صلى بعدها المغرب‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 597,
			"arabicnumber": 597,
			"text": "حدثنا أبو نعيم، وموسى بن إسماعيل، قالا حدثنا همام، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من نسي صلاة فليصل إذا ذكرها، لا كفارة لها إلا ذلك ‏\"‏‏.‏ ‏{‏وأقم الصلاة لذكري‏}‏ قال موسى قال همام سمعته يقول بعد ‏{‏وأقم الصلاة لذكري‏}‏‏.‏وقال حبان حدثنا همام، حدثنا قتادة، حدثنا أنس، عن النبي صلى الله عليه وسلم نحوه‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 598,
			"arabicnumber": 598,
			"text": "حدثنا مسدد، قال حدثنا يحيى، عن هشام، قال حدثنا يحيى ـ هو ابن أبي كثير ـ عن أبي سلمة، عن جابر، قال جعل عمر يوم الخندق يسب كفارهم وقال ما كدت أصلي العصر حتى غربت‏.‏ قال فنزلنا بطحان، فصلى بعد ما غربت الشمس، ثم صلى المغرب‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 599,
			"arabicnumber": 599,
			"text": "حدثنا مسدد، قال حدثنا يحيى، قال حدثنا عوف، قال حدثنا أبو المنهال، قال انطلقت مع أبي إلى أبي برزة الأسلمي فقال له أبي حدثنا كيف، كان رسول الله صلى الله عليه وسلم يصلي المكتوبة قال كان يصلي الهجير وهى التي تدعونها الأولى حين تدحض الشمس، ويصلي العصر، ثم يرجع أحدنا إلى أهله في أقصى المدينة والشمس حية، ونسيت ما قال في المغرب‏.‏ قال وكان يستحب أن يؤخر العشاء‏.‏ قال وكان يكره النوم قبلها والحديث بعدها، وكان ينفتل من صلاة الغداة حين يعرف أحدنا جليسه، ويقرأ من الستين إلى المائة‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 600,
			"arabicnumber": 600,
			"text": "حدثنا عبد الله بن الصباح، قال حدثنا أبو علي الحنفي، حدثنا قرة بن خالد، قال انتظرنا الحسن وراث علينا حتى قربنا من وقت قيامه، فجاء فقال دعانا جيراننا هؤلاء‏.‏ ثم قال قال أنس نظرنا النبي صلى الله عليه وسلم ذات ليلة حتى كان شطر الليل يبلغه، فجاء فصلى لنا، ثم خطبنا فقال ‏ \"‏ ألا إن الناس قد صلوا ثم رقدوا، وإنكم لم تزالوا في صلاة ما انتظرتم الصلاة ‏\"‏‏.‏ قال الحسن وإن القوم لا يزالون بخير ما انتظروا الخير‏.‏ قال قرة هو من حديث أنس عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 601,
			"arabicnumber": 601,
			"text": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال حدثني سالم بن عبد الله بن عمر، وأبو بكر بن أبي حثمة أن عبد الله بن عمر، قال صلى النبي صلى الله عليه وسلم صلاة العشاء في آخر حياته، فلما سلم قام النبي صلى الله عليه وسلم فقال ‏\"‏ أرأيتكم ليلتكم هذه فإن رأس مائة لا يبقى ممن هو اليوم على ظهر الأرض أحد ‏\"‏‏.‏ فوهل الناس في مقالة رسول الله ـ عليه السلام ـ إلى ما يتحدثون من هذه الأحاديث عن مائة سنة، وإنما قال النبي صلى الله عليه وسلم ‏\"‏ لا يبقى ممن هو اليوم على ظهر الأرض ‏\"‏ يريد بذلك أنها تخرم ذلك القرن‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 602,
			"arabicnumber": 602,
			"text": "حدثنا أبو النعمان، قال حدثنا معتمر بن سليمان، قال حدثنا أبي، حدثنا أبو عثمان، عن عبد الرحمن بن أبي بكر، أن أصحاب الصفة، كانوا أناسا فقراء، وأن النبي صلى الله عليه وسلم قال ‏ \"‏ من كان عنده طعام اثنين فليذهب بثالث، وإن أربع فخامس أو سادس ‏\"‏‏.‏ وأن أبا بكر جاء بثلاثة فانطلق النبي صلى الله عليه وسلم بعشرة، قال فهو أنا وأبي وأمي، فلا أدري قال وامرأتي وخادم بيننا وبين بيت أبي بكر‏.‏ وإن أبا بكر تعشى عند النبي صلى الله عليه وسلم ثم لبث حيث صليت العشاء، ثم رجع فلبث حتى تعشى النبي صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله، قالت له امرأته وما حبسك عن أضيافك ـ أو قالت ضيفك ـ قال أوما عشيتيهم قالت أبوا حتى تجيء، قد عرضوا فأبوا‏.‏ قال فذهبت أنا فاختبأت فقال يا غنثر، فجدع وسب، وقال كلوا لا هنيئا‏.‏ فقال والله لا أطعمه أبدا، وايم الله ما كنا نأخذ من لقمة إلا ربا من أسفلها أكثر منها‏.‏ قال يعني حتى شبعوا وصارت أكثر مما كانت قبل ذلك، فنظر إليها أبو بكر فإذا هي كما هي أو أكثر منها‏.‏ فقال لامرأته يا أخت بني فراس ما هذا قالت لا وقرة عيني لهي الآن أكثر منها قبل ذلك بثلاث مرات‏.‏ فأكل منها أبو بكر وقال إنما كان ذلك من الشيطان ـ يعني يمينه ـ ثم أكل منها لقمة، ثم حملها إلى النبي صلى الله عليه وسلم فأصبحت عنده، وكان بيننا وبين قوم عقد، فمضى الأجل، ففرقنا اثنا عشر رجلا، مع كل رجل منهم أناس، الله أعلم كم مع كل رجل فأكلوا منها أجمعون، أو كما قال‏.‏",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 77
			}
		}
	]
}