{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"90": "Tricks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6953,
			"arabicnumber": 6953,
			"text": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، قال سمعت عمر بن الخطاب ـ رضى الله عنه ـ يخطب قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ يا أيها الناس إنما الأعمال بالنية وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن هاجر إلى دنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6954,
			"arabicnumber": 6954,
			"text": "حدثني إسحاق، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يقبل الله صلاة أحدكم إذا أحدث حتى يتوضأ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6955,
			"arabicnumber": 6955,
			"text": "حدثنا محمد بن عبد الله الأنصاري، حدثنا أبي، حدثنا ثمامة بن عبد الله بن أنس، أن أنسا، حدثه أن أبا بكر كتب له فريضة الصدقة التي فرض رسول الله صلى الله عليه وسلم ‏ \"‏ ولا يجمع بين متفرق ولا يفرق بين مجتمع خشية الصدقة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6956,
			"arabicnumber": 6956,
			"text": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن أبي سهيل، عن أبيه، عن طلحة بن عبيد الله، أن أعرابيا، جاء إلى رسول الله صلى الله عليه وسلم ثائر الرأس فقال يا رسول الله أخبرني ماذا فرض الله على من الصلاة فقال ‏\"‏ الصلوات الخمس، إلا أن تطوع شيئا ‏\"‏‏.‏ فقال أخبرني بما فرض الله على من الصيام قال ‏\"‏ شهر رمضان، إلا أن تطوع شيئا ‏\"‏‏.‏ قال أخبرني بما فرض الله على من الزكاة قال فأخبره رسول الله صلى الله عليه وسلم شرائع الإسلام‏.‏ قال والذي أكرمك لا أتطوع شيئا ولا أنقص مما فرض الله على شيئا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق ‏\"‏‏.‏ أو ‏\"‏ دخل الجنة إن صدق ‏\"‏‏.‏ وقال بعض الناس في عشرين ومائة بعير حقتان‏.‏ فإن أهلكها متعمدا، أو وهبها أو احتال فيها فرارا من الزكاة، فلا شىء عليه‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6958,
			"arabicnumber": 6958,
			"text": "",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6959,
			"arabicnumber": 6959,
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، أنه قال استفتى سعد بن عبادة الأنصاري رسول الله صلى الله عليه وسلم في نذر كان على أمه، توفيت قبل أن تقضيه، فقال رسول الله صلى الله عليه وسلم ‏ \"‏ اقضه عنها ‏\"‏‏.‏ وقال بعض الناس إذا بلغت الإبل عشرين، ففيها أربع شياه، فإن وهبها قبل الحول أو باعها، فرارا واحتيالا لإسقاط الزكاة، فلا شىء عليه، وكذلك إن أتلفها فمات، فلا شىء في ماله‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6960,
			"arabicnumber": 6960,
			"text": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن عبيد الله، قال حدثني نافع، عن عبد الله ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم نهى عن الشغار‏.‏ قلت لنافع ما الشغار قال ينكح ابنة الرجل وينكحه ابنته بغير صداق، وينكح أخت الرجل وينكحه أخته بغير صداق‏.‏ وقال بعض الناس إن احتال حتى تزوج على الشغار، فهو جائز، والشرط باطل‏.‏ وقال في المتعة النكاح فاسد، والشرط باطل‏.‏ وقال بعضهم المتعة والشغار جائز، والشرط باطل‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6961,
			"arabicnumber": 6961,
			"text": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله بن عمر، حدثنا الزهري، عن الحسن، وعبد الله، ابنى محمد بن علي عن أبيهما، أن عليا ـ رضى الله عنه ـ قيل له إن ابن عباس لا يرى بمتعة النساء بأسا‏.‏ فقال إن رسول الله صلى الله عليه وسلم نهى عنها يوم خيبر، وعن لحوم الحمر الإنسية‏.‏ وقال بعض الناس إن احتال حتى تمتع، فالنكاح فاسد‏.‏ وقال بعضهم النكاح جائز والشرط باطل‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6962,
			"arabicnumber": 6962,
			"text": "حدثنا إسماعيل، حدثنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يمنع فضل الماء ليمنع به فضل الكلإ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6963,
			"arabicnumber": 6963,
			"text": "حدثنا قتيبة بن سعيد، عن مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن النجش‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6964,
			"arabicnumber": 6964,
			"text": "حدثنا إسماعيل، حدثنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر ـ رضى الله عنهما ـ أن رجلا، ذكر للنبي صلى الله عليه وسلم أنه يخدع في البيوع فقال ‏ \"‏ إذا بايعت فقل لا خلابة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6965,
			"arabicnumber": 6965,
			"text": "حدثنا أبو اليمان، حدثنا شعيب، عن الزهري، قال كان عروة يحدث أنه سأل عائشة ‏{‏وإن خفتم أن لا تقسطوا في اليتامى فانكحوا ما طاب لكم من النساء‏}‏‏.‏ قالت هي اليتيمة في حجر وليها، فيرغب في مالها وجمالها، فيريد أن يتزوجها بأدنى من سنة نسائها، فنهوا عن نكاحهن، إلا أن يقسطوا لهن في إكمال الصداق، ثم استفتى الناس رسول الله صلى الله عليه وسلم بعد فأنزل الله ‏{‏ويستفتونك في النساء‏}‏ فذكر الحديث‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6966,
			"arabicnumber": 6966,
			"text": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الله بن دينار، عن عبد الله بن عمر ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم ‏ \"‏ لكل غادر لواء يوم القيامة يعرف به ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6967,
			"arabicnumber": 6967,
			"text": "حدثنا محمد بن كثير، عن سفيان، عن هشام، عن عروة، عن زينب ابنة أم سلمة، عن أم سلمة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إنما أنا بشر، وإنكم تختصمون، ولعل بعضكم أن يكون ألحن بحجته من بعض، وأقضي له على نحو ما أسمع، فمن قضيت له من حق أخيه شيئا، فلا يأخذ، فإنما أقطع له قطعة من النار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6968,
			"arabicnumber": 6968,
			"text": "حدثنا مسلم بن إبراهيم، حدثنا هشام، حدثنا يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تنكح البكر حتى تستأذن، ولا الثيب حتى تستأمر ‏\"‏‏.‏ فقيل يا رسول الله كيف إذنها قال ‏\"‏ إذا سكتت ‏\"‏‏.‏ وقال بعض الناس إن لم تستأذن البكر ولم تزوج‏.‏ فاحتال رجل فأقام شاهدى زور أنه تزوجها برضاها، فأثبت القاضي نكاحها، والزوج يعلم أن الشهادة باطلة، فلا بأس أن يطأها، وهو تزويج صحيح‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6969,
			"arabicnumber": 6969,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا يحيى بن سعيد، عن القاسم، أن امرأة، من ولد جعفر تخوفت أن يزوجها وليها وهى كارهة فأرسلت إلى شيخين من الأنصار عبد الرحمن ومجمع ابنى جارية قالا فلا تخشين، فإن خنساء بنت خذام أنكحها أبوها وهى كارهة، فرد النبي صلى الله عليه وسلم ذلك‏.‏ قال سفيان وأما عبد الرحمن فسمعته يقول عن أبيه إن خنساء‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6970,
			"arabicnumber": 6970,
			"text": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنكح الأيم حتى تستأمر، ولا تنكح البكر حتى تستأذن ‏\"‏‏.‏ قالوا كيف إذنها قال ‏\"‏ أن تسكت ‏\"‏‏.‏ وقال بعض الناس إن احتال إنسان بشاهدى زور على تزويج امرأة ثيب بأمرها، فأثبت القاضي نكاحها إياه، والزوج يعلم أنه لم يتزوجها قط، فإنه يسعه هذا النكاح، ولا بأس بالمقام له معها‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6971,
			"arabicnumber": 6971,
			"text": "حدثنا أبو عاصم، عن ابن جريج، عن ابن أبي مليكة، عن ذكوان، عن عائشة ـ رضى الله عنها ـ قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ البكر تستأذن ‏\"‏‏.‏ قلت إن البكر تستحيي قال ‏\"‏ إذنها صماتها ‏\"‏‏.‏ وقال بعض الناس إن هوي رجل جارية يتيمة أو بكرا، فأبت فاحتال فجاء بشاهدى زور على أنه تزوجها، فأدركت فرضيت اليتيمة، فقبل القاضي شهادة الزور، والزوج يعلم ببطلان ذلك، حل له الوطء‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6972,
			"arabicnumber": 6972,
			"text": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يحب الحلواء، ويحب العسل، وكان إذا صلى العصر أجاز على نسائه فيدنو منهن، فدخل على حفصة، فاحتبس عندها أكثر مما كان يحتبس، فسألت عن ذلك فقيل لي أهدت امرأة من قومها عكة عسل، فسقت رسول الله صلى الله عليه وسلم منه شربة‏.‏ فقلت أما والله لنحتالن له‏.‏ فذكرت ذلك لسودة قلت إذا دخل عليك فإنه سيدنو منك فقولي له يا رسول الله أكلت مغافير فإنه سيقول لا‏.‏ فقولي له ما هذه الريح وكان رسول الله صلى الله عليه وسلم يشتد عليه أن توجد منه الريح، فإنه سيقول سقتني حفصة شربة عسل‏.‏ فقولي له جرست نحله العرفط‏.‏ وسأقول ذلك، وقوليه أنت يا صفية‏.‏ فلما دخل على سودة، قلت تقول سودة والذي لا إله إلا هو لقد كدت أن أبادره بالذي قلت لي، وإنه لعلى الباب فرقا منك، فلما دنا رسول الله صلى الله عليه وسلم قلت يا رسول الله أكلت مغافير قال ‏\"‏ لا ‏\"‏‏.‏ قلت فما هذه الريح قال ‏\"‏ سقتني حفصة شربة عسل ‏\"‏‏.‏ قلت جرست نحله العرفط‏.‏ فلما دخل على قلت له مثل ذلك‏.‏ ودخل على صفية فقالت له مثل ذلك‏.‏ فلما دخل على حفصة قالت له يا رسول الله ألا أسقيك منه قال ‏\"‏ لا حاجة لي به ‏\"‏‏.‏ قالت تقول سودة سبحان الله لقد حرمناه‏.‏ قالت قلت لها اسكتي‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6973,
			"arabicnumber": 6973,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن عبد الله بن عامر بن ربيعة، أن عمر بن الخطاب ـ رضى الله عنه ـ خرج إلى الشأم، فلما جاء بسرغ بلغه أن الوباء وقع بالشأم فأخبره عبد الرحمن بن عوف أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا سمعتم بأرض فلا تقدموا عليه، وإذا وقع بأرض وأنتم بها فلا تخرجوا فرارا منه ‏\"‏‏.‏ فرجع عمر من سرغ‏.‏ وعن ابن شهاب عن سالم بن عبد الله أن عمر إنما انصرف من حديث عبد الرحمن‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6974,
			"arabicnumber": 6974,
			"text": "حدثنا أبو اليمان، حدثنا شعيب، عن الزهري، حدثنا عامر بن سعد بن أبي وقاص، أنه سمع أسامة بن زيد، يحدث سعدا أن رسول الله صلى الله عليه وسلم ذكر الوجع فقال ‏ \"‏ رجز ـ أو عذاب ـ عذب به بعض الأمم، ثم بقي منه بقية، فيذهب المرة ويأتي الأخرى، فمن سمع به بأرض فلا يقدمن عليه، ومن كان بأرض وقع بها فلا يخرج فرارا منه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6975,
			"arabicnumber": 6975,
			"text": "حدثنا أبو نعيم، حدثنا سفيان، عن أيوب السختياني، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ العائد في هبته كالكلب يعود في قيئه، ليس لنا مثل السوء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6976,
			"arabicnumber": 6976,
			"text": "حدثنا عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن جابر بن عبد الله، قال إنما جعل النبي صلى الله عليه وسلم الشفعة في كل ما لم يقسم، فإذا وقعت الحدود وصرفت الطرق فلا شفعة‏.‏ وقال بعض الناس الشفعة للجوار‏.‏ ثم عمد إلى ما شدده فأبطله، وقال إن اشترى دارا فخاف أن يأخذ الجار بالشفعة، فاشترى سهما من مائة سهم، ثم اشترى الباقي، وكان للجار الشفعة في السهم الأول، ولا شفعة له في باقي الدار، وله أن يحتال في ذلك‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6977,
			"arabicnumber": 6977,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن إبراهيم بن ميسرة، سمعت عمرو بن الشريد، قال جاء المسور بن مخرمة فوضع يده على منكبي، فانطلقت معه إلى سعد فقال أبو رافع للمسور ألا تأمر هذا أن يشتري مني بيتي الذي في داري‏.‏ فقال لا أزيده على أربعمائة، إما مقطعة وإما منجمة‏.‏ قال أعطيت خمسمائة نقدا، فمنعته، ولولا أني سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ الجار أحق بصقبه ‏\"‏‏.‏ ما بعتكه أو قال ما أعطيتكه‏.‏ قلت لسفيان إن معمرا لم يقل هكذا‏.‏ قال لكنه قال لي هكذا‏.‏ وقال بعض الناس إذا أراد أن يبيع الشفعة فله أن يحتال حتى يبطل الشفعة فيهب البائع للمشتري الدار، ويحدها ويدفعها إليه، ويعوضه المشتري ألف درهم، فلا يكون للشفيع فيها شفعة‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6978,
			"arabicnumber": 6978,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، أن سعدا، ساومه بيتا بأربعمائة مثقال فقال لولا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ الجار أحق بصقبه ‏\"‏‏.‏ لما أعطيتك‏.‏ وقال بعض الناس إن اشترى نصيب دار، فأراد أن يبطل الشفعة، وهب لابنه الصغير ولا يكون عليه يمين‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6979,
			"arabicnumber": 6979,
			"text": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن أبي حميد الساعدي، قال استعمل رسول الله صلى الله عليه وسلم رجلا على صدقات بني سليم يدعى ابن اللتبية، فلما جاء حاسبه قال هذا مالكم وهذا هدية‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فهلا جلست في بيت أبيك وأمك، حتى تأتيك هديتك إن كنت صادقا ‏\"‏‏.‏ ثم خطبنا فحمد الله وأثنى عليه ثم قال ‏\"‏ أما بعد، فإني أستعمل الرجل منكم على العمل مما ولاني الله، فيأتي فيقول هذا مالكم وهذا هدية أهديت لي‏.‏ أفلا جلس في بيت أبيه وأمه حتى تأتيه هديته، والله لا يأخذ أحد منكم شيئا بغير حقه، إلا لقي الله يحمله يوم القيامة، فلأعرفن أحدا منكم لقي الله يحمل بعيرا له رغاء، أو بقرة لها خوار، أو شاة تيعر ‏\"‏‏.‏ ثم رفع يده حتى رئي بياض إبطه يقول ‏\"‏ اللهم هل بلغت ‏\"‏‏.‏ بصر عيني وسمع أذني‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6980,
			"arabicnumber": 6980,
			"text": "حدثنا أبو نعيم، حدثنا سفيان، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، قال قال النبي صلى الله عليه وسلم ‏\"‏ الجار أحق بصقبه ‏\"‏‏.‏ وقال بعض الناس إن اشترى دارا بعشرين ألف درهم، فلا بأس أن يحتال حتى يشتري الدار بعشرين ألف درهم، وينقده تسعة آلاف درهم وتسعمائة درهم وتسعة وتسعين، وينقده دينارا بما بقي من العشرين الألف، فإن طلب الشفيع أخذها بعشرين ألف درهم، وإلا فلا سبيل له على الدار، فإن استحقت الدار، رجع المشتري على البائع بما دفع إليه، وهو تسعة آلاف درهم وتسعمائة وتسعة وتسعون درهما ودينار، لأن البيع حين استحق انتقض الصرف في الدينار، فإن وجد بهذه الدار عيبا ولم تستحق، فإنه يردها عليه بعشرين ألف درهم‏.‏ قال فأجاز هذا الخداع بين المسلمين وقال النبي صلى الله عليه وسلم ‏\"‏ لا داء ولا خبثة ولا غائلة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6981,
			"arabicnumber": 6981,
			"text": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني إبراهيم بن ميسرة، عن عمرو بن الشريد، أن أبا رافع، ساوم سعد بن مالك بيتا بأربعمائة مثقال وقال لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ الجار أحق بصقبه ‏\"‏‏.‏ ما أعطيتك‏.‏",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 28
			}
		}
	]
}