{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"94": "Wishes"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7226,
			"arabicnumber": 7226,
			"text": "حدثنا سعيد بن عفير، حدثني الليث، حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن أبي سلمة، وسعيد بن المسيب، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ والذي نفسي بيده لولا أن رجالا يكرهون أن يتخلفوا بعدي ولا أجد ما أحملهم ما تخلفت، لوددت أني أقتل في سبيل الله، ثم أحيا ثم أقتل، ثم أحيا ثم أقتل، ثم أحيا ثم أقتل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7227,
			"arabicnumber": 7227,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ والذي نفسي بيده وددت أني لأقاتل في سبيل الله فأقتل ثم أحيا ثم أقتل، ثم أحيا، ثم أقتل، ثم أحيا، ثم أقتل، ثم أحيا ‏\"‏‏.‏ فكان أبو هريرة يقولهن ثلاثا أشهد بالله‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7228,
			"arabicnumber": 7228,
			"text": "حدثنا إسحاق بن نصر، حدثنا عبد الرزاق، عن معمر، عن همام، سمع أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لو كان عندي أحد ذهبا، لأحببت أن لا يأتي ثلاث وعندي منه دينار، ليس شىء أرصده في دين على أجد من يقبله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7229,
			"arabicnumber": 7229,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، حدثني عروة، أن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ لو استقبلت من أمري ما استدبرت ما سقت الهدى، ولحللت مع الناس حين حلوا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7230,
			"arabicnumber": 7230,
			"text": "حدثنا الحسن بن عمر، حدثنا يزيد، عن حبيب، عن عطاء، عن جابر بن عبد الله، قال كنا مع رسول الله صلى الله عليه وسلم فلبينا بالحج وقدمنا مكة لأربع خلون من ذي الحجة، فأمرنا النبي صلى الله عليه وسلم أن نطوف بالبيت وبالصفا والمروة، وأن نجعلها عمرة ولنحل، إلا من كان معه هدى قال ولم يكن مع أحد منا هدى غير النبي صلى الله عليه وسلم وطلحة، وجاء علي من اليمن معه الهدى فقال أهللت بما أهل به رسول الله صلى الله عليه وسلم فقالوا ننطلق إلى منى وذكر أحدنا يقطر قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لو استقبلت من أمري ما استدبرت ما أهديت، ولولا أن معي الهدى لحللت ‏\"‏‏.‏ قال ولقيه سراقة وهو يرمي جمرة العقبة فقال يا رسول الله ألنا هذه خاصة قال ‏\"‏ لا بل لأبد ‏\"‏‏.‏ قال وكانت عائشة قدمت مكة وهى حائض، فأمرها النبي صلى الله عليه وسلم أن تنسك المناسك كلها، غير أنها لا تطوف ولا تصلي حتى تطهر، فلما نزلوا البطحاء قالت عائشة يا رسول الله أتنطلقون بحجة وعمرة وأنطلق بحجة‏.‏ قال ثم أمر عبد الرحمن بن أبي بكر الصديق أن ينطلق معها إلى التنعيم، فاعتمرت عمرة في ذي الحجة بعد أيام الحج‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7231,
			"arabicnumber": 7231,
			"text": "حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، حدثني يحيى بن سعيد، سمعت عبد الله بن عامر بن ربيعة، قال قالت عائشة أرق النبي صلى الله عليه وسلم ذات ليلة فقال ‏\"‏ ليت رجلا صالحا من أصحابي يحرسني الليلة ‏\"‏‏.‏ إذ سمعنا صوت السلاح قال ‏\"‏ من هذا ‏\"‏‏.‏ قيل سعد يا رسول الله جئت أحرسك‏.‏ فنام النبي صلى الله عليه وسلم حتى سمعنا غطيطه‏.‏ قال أبو عبد الله وقالت عائشة قال بلال ألا ليت شعري هل أبيتن ليلة بواد وحولي إذخر وجليل فأخبرت النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7232,
			"arabicnumber": 7232,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تحاسد إلا في اثنتين رجل آتاه الله القرآن، فهو يتلوه آناء الليل والنهار يقول لو أوتيت مثل ما أوتي هذا لفعلت كما يفعل، ورجل آتاه الله مالا ينفقه في حقه فيقول لو أوتيت مثل ما أوتي لفعلت كما يفعل ‏\"‏‏.‏ حدثنا قتيبة، حدثنا جرير، بهذا‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7233,
			"arabicnumber": 7233,
			"text": "حدثنا حسن بن الربيع، حدثنا أبو الأحوص، عن عاصم، عن النضر بن أنس، قال قال أنس ـ رضى الله عنه ـ لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ لا تتمنوا الموت ‏\"‏ لتمنيت‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7234,
			"arabicnumber": 7234,
			"text": "حدثنا محمد، حدثنا عبدة، عن ابن أبي خالد، عن قيس، قال أتينا خباب بن الأرت نعوده وقد اكتوى سبعا فقال لولا أن رسول الله صلى الله عليه وسلم نهانا أن ندعو بالموت لدعوت به‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7235,
			"arabicnumber": 7235,
			"text": "حدثنا عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن أبي عبيد ـ اسمه سعد بن عبيد مولى عبد الرحمن بن أزهر ـ عن أبي هريرة ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يتمنى أحدكم الموت إما محسنا فلعله يزداد، وإما مسيئا فلعله يستعتب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7236,
			"arabicnumber": 7236,
			"text": "حدثنا عبدان، أخبرني أبي، عن شعبة، حدثنا أبو إسحاق، عن البراء بن عازب، قال كان النبي صلى الله عليه وسلم ينقل معنا التراب يوم الأحزاب، ولقد رأيته وارى التراب بياض بطنه يقول ‏ \"‏ لولا أنت ما اهتدينا نحن، ولا تصدقنا ولا صلينا، فأنزلن سكينة علينا، إن الألى وربما قال الملا قد بغوا علينا، إذا أرادوا فتنة أبينا ‏\"‏ أبينا يرفع بها صوته‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7237,
			"arabicnumber": 7237,
			"text": "حدثني عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله ـ وكان كاتبا له ـ قال كتب إليه عبد الله بن أبي أوفى فقرأته فإذا فيه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تتمنوا لقاء العدو، وسلوا الله العافية ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7238,
			"arabicnumber": 7238,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا أبو الزناد، عن القاسم بن محمد، قال ذكر ابن عباس المتلاعنين فقال عبد الله بن شداد أهي التي قال رسول الله صلى الله عليه وسلم ‏ \"‏ لو كنت راجما امرأة من غير بينة ‏\"‏‏.‏ قال لا، تلك امرأة أعلنت‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7239,
			"arabicnumber": 7239,
			"text": "حدثنا علي، حدثنا سفيان، قال عمرو حدثنا عطاء، قال أعتم النبي صلى الله عليه وسلم بالعشاء فخرج عمر فقال الصلاة يا رسول الله، رقد النساء والصبيان، فخرج ورأسه يقطر يقول ‏\"‏ لولا أن أشق على أمتي ـ أو على الناس، وقال سفيان أيضا، على أمتي ـ لأمرتهم بالصلاة هذه الساعة ‏\"‏‏.‏ قال ابن جريج عن عطاء عن ابن عباس أخر النبي صلى الله عليه وسلم هذه الصلاة فجاء عمر فقال يا رسول الله رقد النساء والولدان‏.‏ فخرج وهو يمسح الماء عن شقه يقول ‏\"‏ إنه للوقت، لولا أن أشق على أمتي ‏\"‏‏.‏ وقال عمرو حدثنا عطاء ليس فيه ابن عباس أما عمرو فقال رأسه يقطر‏.‏ وقال ابن جريج يمسح الماء عن شقه‏.‏ وقال عمرو لولا أن أشق على أمتي‏.‏ وقال ابن جريج إنه للوقت، لولا أن أشق على أمتي‏.‏ وقال إبراهيم بن المنذر حدثنا معن، حدثني محمد بن مسلم، عن عمرو، عن عطاء، عن ابن عباس، عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7240,
			"arabicnumber": 7240,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن جعفر بن ربيعة، عن عبد الرحمن، سمعت أبا هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لولا أن أشق على أمتي لأمرتهم بالسواك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7241,
			"arabicnumber": 7241,
			"text": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا حميد، عن ثابت، عن أنس، رضى الله عنه قال واصل النبي صلى الله عليه وسلم آخر الشهر، وواصل أناس، من الناس فبلغ النبي صلى الله عليه وسلم فقال ‏ \"‏ لو مد بي الشهر لواصلت وصالا يدع المتعمقون تعمقهم، إني لست مثلكم، إني أظل يطعمني ربي ويسقين ‏\"‏‏.‏ تابعه سليمان بن مغيرة عن ثابت عن أنس عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7242,
			"arabicnumber": 7242,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، وقال الليث، حدثني عبد الرحمن بن خالد، عن ابن شهاب، أن سعيد بن المسيب، أخبره أن أبا هريرة قال نهى رسول الله صلى الله عليه وسلم عن الوصال، قالوا فإنك تواصل‏.‏ قال ‏\"‏ أيكم مثلي، إني أبيت يطعمني ربي ويسقين ‏\"‏‏.‏ فلما أبوا أن ينتهوا واصل بهم يوما ثم يوما ثم رأوا الهلال فقال ‏\"‏ لو تأخر لزدتكم ‏\"‏‏.‏ كالمنكل لهم‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7243,
			"arabicnumber": 7243,
			"text": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا أشعث، عن الأسود بن يزيد، عن عائشة، قالت سألت النبي صلى الله عليه وسلم عن الجدر أمن البيت هو قال ‏\"‏ نعم ‏\"‏‏.‏ قلت فما لهم لم يدخلوه في البيت قال ‏\"‏ إن قومك قصرت بهم النفقة ‏\"‏‏.‏ قلت فما شأن بابه مرتفعا قال ‏\"‏ فعل ذاك قومك، ليدخلوا من شاءوا، ويمنعوا من شاءوا، لولا أن قومك حديث عهدهم بالجاهلية، فأخاف أن تنكر قلوبهم أن أدخل الجدر في البيت، وأن ألصق بابه في الأرض ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7244,
			"arabicnumber": 7244,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لولا الهجرة لكنت امرأ من الأنصار، ولو سلك الناس واديا وسلكت الأنصار واديا ـ أو شعبا ـ لسلكت وادي الأنصار أو شعب الأنصار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7245,
			"arabicnumber": 7245,
			"text": "حدثنا موسى، حدثنا وهيب، عن عمرو بن يحيى، عن عباد بن تميم، عن عبد الله بن زيد، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لولا الهجرة لكنت امرأ من الأنصار، ولو سلك الناس واديا أو شعبا، لسلكت وادي الأنصار وشعبها ‏\"‏‏.‏ تابعه أبو التياح عن أنس عن النبي صلى الله عليه وسلم في الشعب‏.‏",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 20
			}
		}
	]
}