{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7371,
			"arabicnumber": 7371,
			"text": "حدثنا أبو عاصم، حدثنا زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، رضى الله عنهما أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7372,
			"arabicnumber": 7372,
			"text": "وحدثني عبد الله بن أبي الأسود، حدثنا الفضل بن العلاء، حدثنا إسماعيل بن أمية، عن يحيى بن عبد الله بن محمد بن صيفي، أنه سمع أبا معبد، مولى ابن عباس يقول سمعت ابن عباس، يقول لما بعث النبي صلى الله عليه وسلم معاذا نحو اليمن قال له ‏ \"‏ إنك تقدم على قوم من أهل الكتاب فليكن أول ما تدعوهم إلى أن يوحدوا الله تعالى فإذا عرفوا ذلك فأخبرهم أن الله فرض عليهم خمس صلوات في يومهم وليلتهم، فإذا صلوا فأخبرهم أن الله افترض عليهم زكاة في أموالهم تؤخذ من غنيهم فترد على فقيرهم، فإذا أقروا بذلك فخذ منهم وتوق كرائم أموال الناس ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7373,
			"arabicnumber": 7373,
			"text": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي حصين، والأشعث بن سليم، سمعا الأسود بن هلال، عن معاذ بن جبل، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا معاذ أتدري ما حق الله على العباد ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال ‏\"‏ أن يعبدوه ولا يشركوا به شيئا، أتدري ما حقهم عليه ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7374,
			"arabicnumber": 7374,
			"text": "حدثنا إسماعيل، حدثني مالك، عن عبد الرحمن بن عبد الله بن عبد الرحمن بن أبي صعصعة، عن أبيه، عن أبي سعيد الخدري، أن رجلا، سمع رجلا، يقرأ ‏{‏قل هو الله أحد‏}‏ يرددها، فلما أصبح جاء إلى النبي صلى الله عليه وسلم فذكر له ذلك، وكأن الرجل يتقالها فقال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده إنها لتعدل ثلث القرآن ‏\"‏‏.‏ زاد إسماعيل بن جعفر عن مالك، عن عبد الرحمن، عن أبيه، عن أبي سعيد، أخبرني أخي، قتادة بن النعمان عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7375,
			"arabicnumber": 7375,
			"text": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا عمرو، عن ابن أبي هلال، أن أبا الرجال، محمد بن عبد الرحمن حدثه عن أمه، عمرة بنت عبد الرحمن وكانت في حجر عائشة زوج النبي صلى الله عليه وسلم عن عائشة أن النبي صلى الله عليه وسلم بعث رجلا على سرية، وكان يقرأ لأصحابه في صلاته فيختم ب ـ ‏{‏قل هو الله أحد‏}‏ فلما رجعوا ذكروا ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ سلوه لأى شىء يصنع ذلك ‏\"‏‏.‏ فسألوه فقال لأنها صفة الرحمن، وأنا أحب أن أقرأ بها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أخبروه أن الله يحبه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7376,
			"arabicnumber": 7376,
			"text": "حدثنا محمد، أخبرنا أبو معاوية، عن الأعمش، عن زيد بن وهب، وأبي، ظبيان عن جرير بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يرحم الله من لا يرحم الناس ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7377,
			"arabicnumber": 7377,
			"text": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن عاصم الأحول، عن أبي عثمان النهدي، عن أسامة بن زيد، قال كنا عند النبي صلى الله عليه وسلم إذ جاءه رسول إحدى بناته يدعوه إلى ابنها في الموت فقال النبي صلى الله عليه وسلم ‏\"‏ ارجع فأخبرها أن لله ما أخذ، وله ما أعطى، وكل شىء عنده بأجل مسمى، فمرها فلتصبر ولتحتسب ‏\"‏‏.‏ فأعادت الرسول أنها أقسمت لتأتينها، فقام النبي صلى الله عليه وسلم وقام معه سعد بن عبادة ومعاذ بن جبل، فدفع الصبي إليه ونفسه تقعقع كأنها في شن ففاضت عيناه فقال له سعد يا رسول الله‏.‏ قال ‏\"‏ هذه رحمة جعلها الله في قلوب عباده، وإنما يرحم الله من عباده الرحماء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7378,
			"arabicnumber": 7378,
			"text": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن سعيد بن جبير، عن أبي عبد الرحمن السلمي، عن أبي موسى الأشعري، قال قال النبي صلى الله عليه وسلم ‏ \"‏ ما أحد أصبر على أذى سمعه من الله، يدعون له الولد، ثم يعافيهم ويرزقهم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7379,
			"arabicnumber": 7379,
			"text": "حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، حدثني عبد الله بن دينار، عن ابن عمر ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ مفاتيح الغيب خمس لا يعلمها إلا الله، لا يعلم ما تغيض الأرحام إلا الله، ولا يعلم ما في غد إلا الله، ولا يعلم متى يأتي المطر أحد إلا الله، ولا تدري نفس بأى أرض تموت إلا الله، ولا يعلم متى تقوم الساعة إلا الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7380,
			"arabicnumber": 7380,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن إسماعيل، عن الشعبي، عن مسروق، عن عائشة ـ رضى الله عنها ـ قالت من حدثك أن محمدا صلى الله عليه وسلم رأى ربه فقد كذب وهو يقول ‏{‏لا تدركه الأبصار‏}‏ ومن حدثك أنه يعلم الغيب فقد كذب، وهو يقول لا يعلم الغيب إلا الله‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7381,
			"arabicnumber": 7381,
			"text": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا مغيرة، حدثنا شقيق بن سلمة، قال قال عبد الله كنا نصلي خلف النبي صلى الله عليه وسلم فنقول السلام على الله‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ إن الله هو السلام ولكن قولوا التحيات لله والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7382,
			"arabicnumber": 7382,
			"text": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ يقبض الله الأرض يوم القيامة، ويطوي السماء بيمينه ثم يقول أنا الملك أين ملوك الأرض ‏\"‏‏.‏ وقال شعيب والزبيدي وابن مسافر وإسحاق بن يحيى عن الزهري عن أبي سلمة‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7383,
			"arabicnumber": 7383,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا حسين المعلم، حدثني عبد الله بن بريدة، عن يحيى بن يعمر، عن ابن عباس، أن النبي صلى الله عليه وسلم كان يقول ‏ \"‏ أعوذ بعزتك الذي لا إله إلا أنت، الذي لا يموت والجن والإنس يموتون ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7384,
			"arabicnumber": 7384,
			"text": "حدثنا ابن أبي الأسود، حدثنا حرمي، حدثنا شعبة، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ يلقى في النار ‏\"‏‏.‏ وقال لي خليفة حدثنا يزيد بن زريع حدثنا سعيد عن قتادة عن أنس‏.‏ وعن معتمر سمعت أبي عن قتادة عن أنس عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزال يلقى فيها وتقول هل من مزيد‏.‏ حتى يضع فيها رب العالمين قدمه فينزوي بعضها إلى بعض، ثم تقول قد قد بعزتك وكرمك‏.‏ ولا تزال الجنة تفضل حتى ينشئ الله لها خلقا فيسكنهم فضل الجنة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7385,
			"arabicnumber": 7385,
			"text": "حدثنا قبيصة، حدثنا سفيان، عن ابن جريج، عن سليمان، عن طاوس، عن ابن عباس ـ رضى الله عنهما ـ قال كان النبي صلى الله عليه وسلم يدعو من الليل ‏ \"‏ اللهم لك الحمد أنت رب السموات والأرض، لك الحمد أنت قيم السموات والأرض ومن فيهن، لك الحمد أنت نور السموات والأرض، قولك الحق، ووعدك الحق، ولقاؤك حق، والجنة حق، والنار حق، والساعة حق، اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك أنبت، وبك خاصمت، وإليك حاكمت، فاغفر لي ما قدمت وما أخرت، وأسررت وأعلنت، أنت إلهي لا إله لي غيرك ‏\"‏‏.‏ حدثنا ثابت بن محمد حدثنا سفيان بهذا وقال أنت الحق وقولك الحق‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7386,
			"arabicnumber": 7386,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي عثمان، عن أبي موسى، قال كنا مع النبي صلى الله عليه وسلم في سفر فكنا إذا علونا كبرنا فقال ‏\"‏ اربعوا على أنفسكم، فإنكم لا تدعون أصم ولا غائبا، تدعون سميعا بصيرا قريبا ‏\"‏‏.‏ ثم أتى على وأنا أقول في نفسي لا حول ولا قوة إلا بالله‏.‏ فقال لي ‏\"‏ يا عبد الله بن قيس قل لا حول ولا قوة إلا بالله‏.‏ فإنها كنز من كنوز الجنة ‏\"‏‏.‏ أو قال ألا أدلك به‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7388,
			"arabicnumber": 7388,
			"text": "",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7389,
			"arabicnumber": 7389,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، حدثني عروة، أن عائشة ـ رضى الله عنها ـ حدثته قال النبي صلى الله عليه وسلم ‏ \"‏ إن جبريل عليه السلام ناداني قال إن الله قد سمع قول قومك وما ردوا عليك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7390,
			"arabicnumber": 7390,
			"text": "حدثني إبراهيم بن المنذر، حدثنا معن بن عيسى، حدثني عبد الرحمن بن أبي الموالي، قال سمعت محمد بن المنكدر، يحدث عبد الله بن الحسن يقول أخبرني جابر بن عبد الله السلمي، قال كان رسول الله صلى الله عليه وسلم يعلم أصحابه الاستخارة في الأمور كلها، كما يعلم السورة من القرآن يقول ‏ \"‏ إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ثم ليقل اللهم إني أستخيرك بعلمك، وأستقدرك بقدرتك، وأسألك من فضلك، فإنك تقدر ولا أقدر، وتعلم ولا أعلم، وأنت علام الغيوب، اللهم فإن كنت تعلم هذا الأمر ـ ثم تسميه بعينه ـ خيرا لي في عاجل أمري وآجله ـ قال أو في ديني ومعاشي وعاقبة أمري ـ فاقدره لي، ويسره لي، ثم بارك لي فيه، اللهم وإن كنت تعلم أنه شر لي في ديني ومعاشي وعاقبة أمري ـ أو قال في عاجل أمري وآجله ـ فاصرفني عنه، واقدر لي الخير حيث كان، ثم رضني به ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7391,
			"arabicnumber": 7391,
			"text": "حدثني سعيد بن سليمان، عن ابن المبارك، عن موسى بن عقبة، عن سالم، عن عبد الله، قال أكثر ما كان النبي صلى الله عليه وسلم يحلف ‏ \"‏ لا ومقلب القلوب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7392,
			"arabicnumber": 7392,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن لله تسعة وتسعين اسما مائة إلا واحدا، من أحصاها دخل الجنة ‏\"‏‏.‏ ‏{‏أحصيناه‏}‏ حفظناه‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7393,
			"arabicnumber": 7393,
			"text": "حدثنا عبد العزيز بن عبد الله، حدثني مالك، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا جاء أحدكم فراشه فلينفضه بصنفة ثوبه ثلاث مرات، وليقل باسمك رب وضعت جنبي وبك أرفعه، إن أمسكت نفسي فاغفر لها، وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين ‏\"‏‏.‏ تابعه يحيى وبشر بن المفضل عن عبيد الله عن سعيد عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏ وزاد زهير وأبو ضمرة وإسماعيل بن زكرياء عن عبيد الله عن سعيد عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏ ورواه ابن عجلان عن سعيد عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7394,
			"arabicnumber": 7394,
			"text": "حدثنا مسلم، حدثنا شعبة، عن عبد الملك، عن ربعي، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا أوى إلى فراشه قال ‏\"‏ اللهم باسمك أحيا وأموت ‏\"‏‏.‏ وإذا أصبح قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7395,
			"arabicnumber": 7395,
			"text": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن ربعي بن حراش، عن خرشة بن الحر، عن أبي ذر، قال كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل قال ‏ \"‏ باسمك نموت ونحيا، فإذا استيقظ قال الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7396,
			"arabicnumber": 7396,
			"text": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن منصور، عن سالم، عن كريب، عن ابن عباس ـ رضى الله عنهما ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لو أن أحدكم إذا أراد أن يأتي أهله فقال باسم الله، اللهم جنبنا الشيطان، وجنب الشيطان ما رزقتنا‏.‏ فإنه إن يقدر بينهما ولد في ذلك لم يضره شيطان أبدا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7397,
			"arabicnumber": 7397,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا فضيل، عن منصور، عن إبراهيم، عن همام، عن عدي بن حاتم، قال سألت النبي صلى الله عليه وسلم قلت أرسل كلابي المعلمة‏.‏ قال ‏ \"‏ إذا أرسلت كلابك المعلمة وذكرت اسم الله فأمسكن فكل، وإذا رميت بالمعراض فخزق فكل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7398,
			"arabicnumber": 7398,
			"text": "حدثنا يوسف بن موسى، حدثنا أبو خالد الأحمر، قال سمعت هشام بن عروة، يحدث عن أبيه، عن عائشة، قالت قالوا يا رسول الله إن هنا أقواما حديثا عهدهم بشرك، يأتونا بلحمان لا ندري يذكرون اسم الله عليها أم لا‏.‏ قال ‏ \"‏ اذكروا أنتم اسم الله وكلوا ‏\"‏‏.‏ تابعه محمد بن عبد الرحمن والدراوردي وأسامة بن حفص‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7399,
			"arabicnumber": 7399,
			"text": "حدثنا حفص بن عمر، حدثنا هشام، عن قتادة، عن أنس، قال ضحى النبي صلى الله عليه وسلم بكبشين، يسمي ويكبر‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7400,
			"arabicnumber": 7400,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، عن الأسود بن قيس، عن جندب، أنه شهد النبي صلى الله عليه وسلم يوم النحر صلى ثم خطب فقال ‏ \"‏ من ذبح قبل أن يصلي فليذبح مكانها أخرى، ومن لم يذبح فليذبح باسم الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7401,
			"arabicnumber": 7401,
			"text": "حدثنا أبو نعيم، حدثنا ورقاء، عن عبد الله بن دينار، عن ابن عمر ـ رضى الله عنهما ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ لا تحلفوا بآبائكم، ومن كان حالفا فليحلف بالله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7402,
			"arabicnumber": 7402,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، أخبرني عمرو بن أبي سفيان بن أسيد بن جارية الثقفي ـ حليف لبني زهرة وكان من أصحاب أبي هريرة ـ أن أبا هريرة قال بعث رسول الله صلى الله عليه وسلم عشرة منهم خبيب الأنصاري، فأخبرني عبيد الله بن عياض أن ابنة الحارث أخبرته أنهم حين اجتمعوا استعار منها موسى يستحد بها، فلما خرجوا من الحرم ليقتلوه قال خبيب الأنصاري ولست أبالي حين أقتل مسلما ** على أي شق كان لله مصرعي وذلك في ذات الإله وإن يشأ ** يبارك على أوصال شلو ممزع فقتله ابن الحارث فأخبر النبي صلى الله عليه وسلم أصحابه خبرهم يوم أصيبوا‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7403,
			"arabicnumber": 7403,
			"text": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، عن شقيق، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما من أحد أغير من الله، من أجل ذلك حرم الفواحش، وما أحد أحب إليه المدح من الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7404,
			"arabicnumber": 7404,
			"text": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لما خلق الله الخلق كتب في كتابه ـ هو يكتب على نفسه، وهو وضع عنده على العرش ـ إن رحمتي تغلب غضبي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7405,
			"arabicnumber": 7405,
			"text": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، سمعت أبا صالح، عن أبي هريرة ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ يقول الله تعالى أنا عند ظن عبدي بي، وأنا معه إذا ذكرني، فإن ذكرني في نفسه ذكرته في نفسي، وإن ذكرني في ملأ ذكرته في ملأ خير منهم، وإن تقرب إلى بشبر تقربت إليه ذراعا، وإن تقرب إلى ذراعا تقربت إليه باعا، وإن أتاني يمشي أتيته هرولة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7406,
			"arabicnumber": 7406,
			"text": "حدثنا قتيبة بن سعيد، حدثنا حماد، عن عمرو، عن جابر بن عبد الله، قال لما نزلت هذه الآية ‏{‏قل هو القادر على أن يبعث عليكم عذابا من فوقكم‏}‏ قال النبي صلى الله عليه وسلم ‏\"‏ أعوذ بوجهك ‏\"‏‏.‏ فقال ‏{‏أو من تحت أرجلكم‏}‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أعوذ بوجهك ‏\"‏‏.‏ قال ‏{‏أو يلبسكم شيعا‏}‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هذا أيسر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7407,
			"arabicnumber": 7407,
			"text": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله، قال ذكر الدجال عند النبي صلى الله عليه وسلم فقال ‏ \"‏ إن الله لا يخفى عليكم، إن الله ليس بأعور ـ وأشار بيده إلى عينه ـ وإن المسيح الدجال أعور العين اليمنى كأن عينه عنبة طافية ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7408,
			"arabicnumber": 7408,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، أخبرنا قتادة، قال سمعت أنسا ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما بعث الله من نبي إلا أنذر قومه الأعور الكذاب، إنه أعور، وإن ربكم ليس بأعور، مكتوب بين عينيه كافر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7409,
			"arabicnumber": 7409,
			"text": "حدثنا إسحاق، حدثنا عفان، حدثنا وهيب، حدثنا موسى ـ هو ابن عقبة ـ حدثني محمد بن يحيى بن حبان، عن ابن محيريز، عن أبي سعيد الخدري، في غزوة بني المصطلق أنهم أصابوا سبايا فأرادوا أن يستمتعوا بهن ولا يحملن فسألوا النبي صلى الله عليه وسلم عن العزل فقال ‏\"‏ ما عليكم أن لا تفعلوا، فإن الله قد كتب من هو خالق إلى يوم القيامة ‏\"‏‏.‏ وقال مجاهد عن قزعة سمعت أبا سعيد فقال قال النبي صلى الله عليه وسلم ‏\"‏ ليست نفس مخلوقة إلا الله خالقها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7410,
			"arabicnumber": 7410,
			"text": "حدثني معاذ بن فضالة، حدثنا هشام، عن قتادة، عن أنس، أن النبي صلى الله عليه وسلم قال ‏\"‏ يجمع الله المؤمنين يوم القيامة كذلك فيقولون لو استشفعنا إلى ربنا حتى يريحنا من مكاننا هذا‏.‏ فيأتون آدم فيقولون يا آدم أما ترى الناس خلقك الله بيده وأسجد لك ملائكته وعلمك أسماء كل شىء، شفع لنا إلى ربنا حتى يريحنا من مكاننا هذا‏.‏ فيقول لست هناك ـ ويذكر لهم خطيئته التي أصاب ـ ولكن ائتوا نوحا، فإنه أول رسول بعثه الله إلى أهل الأرض‏.‏ فيأتون نوحا فيقول لست هناكم ـ ويذكر خطيئته التي أصاب ـ ولكن ائتوا إبراهيم خليل الرحمن‏.‏ فيأتون إبراهيم فيقول لست هناكم ـ ويذكر لهم خطاياه التي أصابها ـ ولكن ائتوا موسى عبدا أتاه الله التوراة وكلمه تكليما ـ فيأتون موسى فيقول لست هناكم ـ ويذكر لهم خطيئته التي أصاب ـ ولكن ائتوا عيسى عبد الله ورسوله وكلمته وروحه‏.‏ فيأتون عيسى فيقول لست هناكم ولكن ائتوا محمدا صلى الله عليه وسلم عبدا غفر له ما تقدم من ذنبه وما تأخر‏.‏ فيأتوني فأنطلق فأستأذن على ربي فيؤذن لي عليه، فإذا رأيت ربي وقعت له ساجدا فيدعني ما شاء الله أن يدعني ثم يقال لي ارفع محمد، وقل يسمع، وسل تعطه، واشفع تشفع‏.‏ فأحمد ربي بمحامد علمنيها، ثم أشفع فيحد لي حدا فأدخلهم الجنة، ثم أرجع فإذا رأيت ربي وقعت ساجدا، فيدعني ما شاء الله أن يدعني ثم يقال ارفع محمد، وقل يسمع، وسل تعطه، واشفع تشفع، فأحمد ربي بمحامد علمنيها ربي ثم أشفع فيحد لي حدا فأدخلهم الجنة، ثم أرجع فإذا رأيت ربي وقعت ساجدا، فيدعني ما شاء الله أن يدعني ثم يقال ارفع محمد، قل يسمع، وسل تعطه، واشفع تشفع، فأحمد ربي بمحامد علمنيها، ثم أشفع فيحد لي حدا فأدخلهم الجنة، ثم أرجع فأقول يا رب ما بقي في النار إلا من حبسه القرآن ووجب عليه الخلود ‏\"‏‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ يخرج من النار من قال لا إله إلا الله‏.‏ وكان في قلبه من الخير ما يزن شعيرة، ثم يخرج من النار من قال لا إله إلا الله‏.‏ وكان في قلبه من الخير ما يزن برة، ثم يخرج من النار من قال لا إله إلا الله‏.‏ وكان في قلبه ما يزن من الخير ذرة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7411,
			"arabicnumber": 7411,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يد الله ملأى لا يغيضها نفقة، سحاء الليل والنهار ـ وقال ـ أرأيتم ما أنفق منذ خلق السموات والأرض، فإنه لم يغض ما في يده ـ وقال ـ عرشه على الماء وبيده الأخرى الميزان يخفض ويرفع ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7413,
			"arabicnumber": 7413,
			"text": "",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7414,
			"arabicnumber": 7414,
			"text": "حدثنا مسدد، سمع يحيى بن سعيد، عن سفيان، حدثني منصور، وسليمان، عن إبراهيم، عن عبيدة، عن عبد الله، أن يهوديا، جاء إلى النبي صلى الله عليه وسلم فقال يا محمد إن الله يمسك السموات على إصبع والأرضين على إصبع، والجبال على إصبع، والشجر على إصبع، والخلائق على إصبع، ثم يقول أنا الملك‏.‏ فضحك رسول الله صلى الله عليه وسلم حتى بدت نواجذه ثم قرأ ‏{‏وما قدروا الله حق قدره‏}‏‏.‏ قال يحيى بن سعيد وزاد فيه فضيل بن عياض عن منصور عن إبراهيم عن عبيدة عن عبد الله فضحك رسول الله صلى الله عليه وسلم تعجبا وتصديقا له‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7415,
			"arabicnumber": 7415,
			"text": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، سمعت إبراهيم، قال سمعت علقمة، يقول قال عبد الله جاء رجل إلى النبي صلى الله عليه وسلم من أهل الكتاب فقال يا أبا القاسم إن الله يمسك السموات على إصبع، والأرضين على إصبع، والشجر والثرى على إصبع، والخلائق على إصبع، ثم يقول أنا الملك أنا الملك‏.‏ فرأيت النبي صلى الله عليه وسلم ضحك حتى بدت نواجذه ثم قرأ ‏{‏وما قدروا الله حق قدره‏}‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7416,
			"arabicnumber": 7416,
			"text": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عبد الملك، عن وراد، كاتب المغيرة عن المغيرة، قال قال سعد بن عبادة لو رأيت رجلا مع امرأتي لضربته بالسيف غير مصفح‏.‏ فبلغ ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ تعجبون من غيرة سعد، والله لأنا أغير منه، والله أغير مني، ومن أجل غيرة الله حرم الفواحش ما ظهر منها وما بطن، ولا أحد أحب إليه العذر من الله، ومن أجل ذلك بعث المبشرين والمنذرين ولا أحد أحب إليه المدحة من الله ومن أجل ذلك وعد الله الجنة ‏\"‏‏.‏ وقال عبيد الله بن عمرو عن عبد الملك ‏\"‏ لا شخص أغير من الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7417,
			"arabicnumber": 7417,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي حازم، عن سهل بن سعد، قال النبي صلى الله عليه وسلم لرجل ‏ \"‏ أمعك من القرآن شىء ‏\"‏‏.‏ قال نعم سورة كذا وسورة كذا‏.‏ لسور سماها‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7418,
			"arabicnumber": 7418,
			"text": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن جامع بن شداد، عن صفوان بن محرز، عن عمران بن حصين، قال إني عند النبي صلى الله عليه وسلم إذ جاءه قوم من بني تميم فقال ‏\"‏ اقبلوا البشرى يا بني تميم ‏\"‏‏.‏ قالوا بشرتنا فأعطنا‏.‏ فدخل ناس من أهل اليمن فقال ‏\"‏ اقبلوا البشرى يا أهل اليمن إذ لم يقبلها بنو تميم ‏\"‏‏.‏ قالوا قبلنا‏.‏ جئناك لنتفقه في الدين ولنسألك عن أول هذا الأمر ما كان‏.‏ قال ‏\"‏ كان الله ولم يكن شىء قبله، وكان عرشه على الماء، ثم خلق السموات والأرض، وكتب في الذكر كل شىء ‏\"‏‏.‏ ثم أتاني رجل فقال يا عمران أدرك ناقتك فقد ذهبت فانطلقت أطلبها، فإذا السراب ينقطع دونها، وايم الله لوددت أنها قد ذهبت ولم أقم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7419,
			"arabicnumber": 7419,
			"text": "حدثنا علي بن عبد الله، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، حدثنا أبو هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن يمين الله ملأى لا يغيضها نفقة سحاء الليل والنهار، أرأيتم ما أنفق منذ خلق السموات والأرض فإنه لم ينقص ما في يمينه، وعرشه على الماء وبيده الأخرى الفيض ـ أو القبض ـ يرفع ويخفض ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7420,
			"arabicnumber": 7420,
			"text": "حدثنا أحمد، حدثنا محمد بن أبي بكر المقدمي، حدثنا حماد بن زيد، عن ثابت، عن أنس، قال جاء زيد بن حارثة يشكو فجعل النبي صلى الله عليه وسلم يقول ‏\"‏ اتق الله، وأمسك عليك زوجك ‏\"‏‏.‏ قالت عائشة لو كان رسول الله صلى الله عليه وسلم كاتما شيئا لكتم هذه‏.‏ قال فكانت زينب تفخر على أزواج النبي صلى الله عليه وسلم تقول زوجكن أهاليكن، وزوجني الله تعالى من فوق سبع سموات‏.‏ وعن ثابت ‏{‏وتخفي في نفسك ما الله مبديه وتخشى الناس‏}‏ نزلت في شأن زينب وزيد بن حارثة‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7421,
			"arabicnumber": 7421,
			"text": "حدثنا خلاد بن يحيى، حدثنا عيسى بن طهمان، قال سمعت أنس بن مالك ـ رضى الله عنه ـ يقول نزلت آية الحجاب في زينب بنت جحش وأطعم عليها يومئذ خبزا ولحما وكانت تفخر على نساء النبي صلى الله عليه وسلم وكانت تقول إن الله أنكحني في السماء‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7422,
			"arabicnumber": 7422,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الله لما قضى الخلق كتب عنده فوق عرشه إن رحمتي سبقت غضبي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7423,
			"arabicnumber": 7423,
			"text": "حدثنا إبراهيم بن المنذر، حدثني محمد بن فليح، قال حدثني أبي، حدثني هلال، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من آمن بالله ورسوله، وأقام الصلاة، وصام رمضان، كان حقا على الله أن يدخله الجنة هاجر، في سبيل الله، أو جلس في أرضه التي ولد فيها ‏\"‏‏.‏ قالوا يا رسول الله أفلا ننبئ الناس بذلك‏.‏ قال ‏\"‏ إن في الجنة مائة درجة أعدها الله للمجاهدين في سبيله، كل درجتين ما بينهما كما بين السماء والأرض، فإذا سألتم الله فسلوه الفردوس، فإنه أوسط الجنة وأعلى الجنة، وفوقه عرش الرحمن، ومنه تفجر أنهار الجنة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7424,
			"arabicnumber": 7424,
			"text": "حدثنا يحيى بن جعفر، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم ـ هو التيمي ـ عن أبيه، عن أبي ذر، قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس، فلما غربت الشمس قال ‏\"‏ يا أبا ذر هل تدري أين تذهب هذه ‏\"‏‏.‏ قال قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإنها تذهب تستأذن في السجود فيؤذن لها، وكأنها قد قيل لها ارجعي من حيث جئت‏.‏ فتطلع من مغربها ‏\"‏‏.‏ ثم قرأ ‏{‏ذلك مستقر لها‏}‏ في قراءة عبد الله‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7425,
			"arabicnumber": 7425,
			"text": "حدثنا موسى، عن إبراهيم، حدثنا ابن شهاب، عن عبيد بن السباق، أن زيد بن ثابت،‏.‏ وقال الليث حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن ابن السباق، أن زيد بن ثابت، حدثه قال أرسل إلى أبو بكر فتتبعت القرآن حتى وجدت آخر سورة التوبة مع أبي خزيمة الأنصاري لم أجدها مع أحد غيره ‏{‏لقد جاءكم رسول من أنفسكم‏}‏ حتى خاتمة براءة‏.‏ حدثنا يحيى بن بكير، حدثنا الليث، عن يونس، بهذا وقال مع أبي خزيمة الأنصاري‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7426,
			"arabicnumber": 7426,
			"text": "حدثنا معلى بن أسد، حدثنا وهيب، عن سعيد، عن قتادة، عن أبي العالية، عن ابن عباس ـ رضى الله عنهما ـ قال كان النبي صلى الله عليه وسلم يقول عند الكرب ‏ \"‏ لا إله إلا الله العليم الحليم لا إله إلا الله رب العرش العظيم لا إله إلا الله رب السموات ورب الأرض رب العرش الكريم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7428,
			"arabicnumber": 7428,
			"text": "",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7429,
			"arabicnumber": 7429,
			"text": "حدثنا إسماعيل، حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يتعاقبون فيكم ملائكة بالليل وملائكة بالنهار، ويجتمعون في صلاة العصر وصلاة الفجر، ثم يعرج الذين باتوا فيكم فيسألهم وهو أعلم بكم فيقول كيف تركتم عبادي فيقولون تركناهم وهم يصلون وأتيناهم وهم يصلون ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7430,
			"arabicnumber": 7430,
			"text": "وقال خالد بن مخلد حدثنا سليمان، حدثني عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تصدق بعدل تمرة من كسب طيب، ولا يصعد إلى الله إلا الطيب، فإن الله يتقبلها بيمينه، ثم يربيها لصاحبه كما يربي أحدكم فلوه، حتى تكون مثل الجبل ‏\"‏‏.‏ ورواه ورقاء عن عبد الله بن دينار عن سعيد بن يسار عن أبي هريرة عن النبي صلى الله عليه وسلم ‏\"‏ ولا يصعد إلى الله إلا الطيب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7431,
			"arabicnumber": 7431,
			"text": "حدثنا عبد الأعلى بن حماد، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أبي العالية، عن ابن عباس، أن نبي الله صلى الله عليه وسلم كان يدعو بهن عند الكرب ‏ \"‏ لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السموات ورب العرش الكريم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7432,
			"arabicnumber": 7432,
			"text": "حدثنا قبيصة، حدثنا سفيان، عن أبيه، عن ابن أبي نعم ـ أو أبي نعم شك قبيصة ـ عن أبي سعيد، قال بعث إلى النبي صلى الله عليه وسلم بذهيبة فقسمها بين أربعة‏.‏ وحدثني إسحاق بن نصر حدثنا عبد الرزاق أخبرنا سفيان عن أبيه عن ابن أبي نعم عن أبي سعيد الخدري قال بعث علي وهو باليمن إلى النبي صلى الله عليه وسلم بذهيبة في تربتها، فقسمها بين الأقرع بن حابس الحنظلي ثم أحد بني مجاشع، وبين عيينة بن بدر الفزاري، وبين علقمة بن علاثة العامري ثم أحد بني كلاب، وبين زيد الخيل الطائي ثم أحد بني نبهان، فتغضبت قريش والأنصار فقالوا يعطيه صناديد أهل نجد ويدعنا قال ‏\"‏ إنما أتألفهم ‏\"‏‏.‏ فأقبل رجل غائر العينين، ناتئ الجبين، كث اللحية، مشرف الوجنتين، محلوق الرأس فقال يا محمد اتق الله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فمن يطيع الله إذا عصيته فيأمني على أهل الأرض، ولا تأمنوني ‏\"‏‏.‏ فسأل رجل من القوم ـ قتله أراه خالد بن الوليد ـ فمنعه النبي صلى الله عليه وسلم فلما ولى قال النبي صلى الله عليه وسلم ‏\"‏ إن من ضئضئ هذا قوما يقرءون القرآن لا يجاوز حناجرهم، يمرقون من الإسلام مروق السهم من الرمية، يقتلون أهل الإسلام ويدعون أهل الأوثان، لئن أدركتهم لأقتلنهم قتل عاد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7433,
			"arabicnumber": 7433,
			"text": "حدثنا عياش بن الوليد، حدثنا وكيع، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال سألت النبي صلى الله عليه وسلم عن قوله ‏{‏والشمس تجري لمستقر لها‏}‏ قال ‏\"‏ مستقرها تحت العرش ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7434,
			"arabicnumber": 7434,
			"text": "حدثنا عمرو بن عون، حدثنا خالد، وهشيم، عن إسماعيل، عن قيس، عن جرير، قال كنا جلوسا عند النبي صلى الله عليه وسلم إذ نظر إلى القمر ليلة البدر قال ‏ \"‏ إنكم سترون ربكم كما ترون هذا القمر لا تضامون في رؤيته، فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وصلاة قبل غروب الشمس، فافعلوا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7435,
			"arabicnumber": 7435,
			"text": "حدثنا يوسف بن موسى، حدثنا عاصم بن يوسف اليربوعي، حدثنا أبو شهاب، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير بن عبد الله، قال قال النبي صلى الله عليه وسلم ‏ \"‏ إنكم سترون ربكم عيانا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7436,
			"arabicnumber": 7436,
			"text": "حدثنا عبدة بن عبد الله، حدثنا حسين الجعفي، عن زائدة، حدثنا بيان بن بشر، عن قيس بن أبي حازم، حدثنا جرير، قال خرج علينا رسول الله صلى الله عليه وسلم ليلة البدر فقال ‏ \"‏ إنكم سترون ربكم يوم القيامة كما ترون هذا، لا تضامون في رؤيته ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7438,
			"arabicnumber": 7438,
			"text": "",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7439,
			"arabicnumber": 7439,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قلنا يا رسول الله هل نرى ربنا يوم القيامة قال ‏\"‏ هل تضارون في رؤية الشمس والقمر إذا كانت صحوا ‏\"‏‏.‏ قلنا لا‏.‏ قال ‏\"‏ فإنكم لا تضارون في رؤية ربكم يومئذ، إلا كما تضارون في رؤيتهما ـ ثم قال ـ ينادي مناد ليذهب كل قوم إلى ما كانوا يعبدون‏.‏ فيذهب أصحاب الصليب مع صليبهم، وأصحاب الأوثان مع أوثانهم، وأصحاب كل آلهة مع آلهتهم حتى يبقى من كان يعبد الله من بر أو فاجر، وغبرات من أهل الكتاب، ثم يؤتى بجهنم تعرض كأنها سراب فيقال لليهود ما كنتم تعبدون قالوا كنا نعبد عزير ابن الله‏.‏ فيقال كذبتم لم يكن لله صاحبة ولا ولد فما تريدون قالوا نريد أن تسقينا، فيقال اشربوا فيتساقطون في جهنم ثم يقال للنصارى ما كنتم تعبدون فيقولون كنا نعبد المسيح ابن الله‏.‏ فيقال كذبتم لم يكن لله صاحبة ولا ولد، فما تريدون فيقولون نريد أن تسقينا‏.‏ فيقال اشربوا‏.‏ فيتساقطون حتى يبقى من كان يعبد الله من بر أو فاجر فيقال لهم ما يحبسكم وقد ذهب الناس فيقولون فارقناهم ونحن أحوج منا إليه اليوم وإنا سمعنا مناديا ينادي ليلحق كل قوم بما كانوا يعبدون‏.‏ وإنما ننتظر ربنا ـ قال ـ فيأتيهم الجبار‏.‏ فيقول أنا ربكم‏.‏ فيقولون أنت ربنا‏.‏ فلا يكلمه إلا الأنبياء فيقول هل بينكم وبينه آية تعرفونه فيقولون الساق‏.‏ فيكشف عن ساقه فيسجد له كل مؤمن، ويبقى من كان يسجد لله رياء وسمعة، فيذهب كيما يسجد فيعود ظهره طبقا واحدا، ثم يؤتى بالجسر فيجعل بين ظهرى جهنم ‏\"‏‏.‏ قلنا يا رسول الله وما الجسر قال ‏\"‏ مدحضة مزلة، عليه خطاطيف وكلاليب وحسكة مفلطحة، لها شوكة عقيفاء تكون بنجد يقال لها السعدان، المؤمن عليها كالطرف وكالبرق وكالريح وكأجاويد الخيل والركاب، فناج مسلم وناج مخدوش ومكدوس في نار جهنم، حتى يمر آخرهم يسحب سحبا، فما أنتم بأشد لي مناشدة في الحق، قد تبين لكم من المؤمن يومئذ للجبار، وإذا رأوا أنهم قد نجوا في إخوانهم يقولون ربنا إخواننا كانوا يصلون معنا ويصومون معنا ويعملون معنا‏.‏ فيقول الله تعالى اذهبوا فمن وجدتم في قلبه مثقال دينار من إيمان فأخرجوه‏.‏ ويحرم الله صورهم على النار، فيأتونهم وبعضهم قد غاب في النار إلى قدمه وإلى أنصاف ساقيه، فيخرجون من عرفوا، ثم يعودون فيقول اذهبوا فمن وجدتم في قلبه مثقال نصف دينار فأخرجوه‏.‏ فيخرجون من عرفوا، ثم يعودون فيقول اذهبوا فمن وجدتم في قلبه مثقال ذرة من إيمان فأخرجوه‏.‏ فيخرجون من عرفوا ‏\"‏‏.‏ قال أبو سعيد فإن لم تصدقوني فاقرءوا ‏{‏إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها‏}‏ ‏\"‏ فيشفع النبيون والملائكة والمؤمنون فيقول الجبار بقيت شفاعتي‏.‏ فيقبض قبضة من النار فيخرج أقواما قد امتحشوا، فيلقون في نهر بأفواه الجنة يقال له ماء الحياة، فينبتون في حافتيه كما تنبت الحبة في حميل السيل، قد رأيتموها إلى جانب الصخرة إلى جانب الشجرة، فما كان إلى الشمس منها كان أخضر، وما كان منها إلى الظل كان أبيض، فيخرجون كأنهم اللؤلؤ، فيجعل في رقابهم الخواتيم فيدخلون الجنة فيقول أهل الجنة هؤلاء عتقاء الرحمن أدخلهم الجنة بغير عمل عملوه ولا خير قدموه‏.‏ فيقال لهم لكم ما رأيتم ومثله معه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7440,
			"arabicnumber": 7440,
			"text": "وقال حجاج بن منهال حدثنا همام بن يحيى، حدثنا قتادة، عن أنس ـ رضى الله عنه ـ أن النبي صلى الله عليه وسلم قال ‏\"‏ يحبس المؤمنون يوم القيامة حتى يهموا بذلك فيقولون لو استشفعنا إلى ربنا فيريحنا من مكاننا‏.‏ فيأتون آدم فيقولون أنت آدم أبو الناس خلقك الله بيده وأسكنك جنته، وأسجد لك ملائكته، وعلمك أسماء كل شىء، لتشفع لنا عند ربك حتى يريحنا من مكاننا هذا، قال فيقول لست هناكم ـ قال ويذكر خطيئته التي أصاب أكله من الشجرة وقد نهي عنها ـ ولكن ائتوا نوحا أول نبي بعثه الله إلى أهل الأرض‏.‏ فيأتون نوحا فيقول لست هناكم ـ ويذكر خطيئته التي أصاب سؤاله ربه بغير علم ـ ولكن ائتوا إبراهيم خليل الرحمن‏.‏ قال فيأتون إبراهيم فيقول إني لست هناكم ـ ويذكر ثلاث كلمات كذبهن ـ ولكن ائتوا موسى عبدا آتاه الله التوراة وكلمه وقربه نجيا‏.‏ قال فيأتون موسى فيقول إني لست هناكم ـ ويذكر خطيئته التي أصاب قتله النفس ـ ولكن ائتوا عيسى عبد الله ورسوله وروح الله وكلمته‏.‏ قال فيأتون عيسى فيقول لست هناكم ولكن ائتوا محمدا صلى الله عليه وسلم عبدا غفر الله له ما تقدم من ذنبه وما تأخر‏.‏ فيأتوني فأستأذن على ربي في داره فيؤذن لي عليه، فإذا رأيته وقعت ساجدا فيدعني ما شاء الله أن يدعني فيقول ارفع محمد، وقل يسمع، واشفع تشفع، وسل تعط ـ قال ـ فأرفع رأسي فأثني على ربي بثناء وتحميد يعلمنيه، فيحد لي حدا فأخرج فأدخلهم الجنة ‏\"‏‏.‏ قال قتادة وسمعته أيضا يقول ‏\"‏ فأخرج فأخرجهم من النار وأدخلهم الجنة، ثم أعود فأستأذن على ربي في داره فيؤذن لي عليه، فإذا رأيته وقعت ساجدا فيدعني ما شاء الله أن يدعني ثم يقول ارفع محمد، وقل يسمع، واشفع تشفع، وسل تعط ـ قال ـ فأرفع رأسي فأثني على ربي بثناء وتحميد يعلمنيه ـ قال ـ ثم أشفع فيحد لي حدا فأخرج فأدخلهم الجنة ‏\"‏‏.‏ قال قتادة وسمعته يقول ‏\"‏ فأخرج فأخرجهم من النار وأدخلهم الجنة، ثم أعود الثالثة فأستأذن على ربي في داره فيؤذن لي عليه، فإذا رأيته وقعت ساجدا فيدعني ما شاء الله أن يدعني ثم يقول ارفع محمد، وقل يسمع، واشفع تشفع، وسل تعطه ـ قال ـ فأرفع رأسي فأثني على ربي بثناء وتحميد يعلمنيه ـ قال ـ ثم أشفع فيحد لي حدا فأخرج فأدخلهم الجنة ‏\"‏‏.‏ قال قتادة وقد سمعته يقول ‏\"‏ فأخرج فأخرجهم من النار وأدخلهم الجنة، حتى ما يبقى في النار إلا من حبسه القرآن أى وجب عليه الخلود ـ قال ـ ثم تلا هذه الآية ‏{‏عسى أن يبعثك ربك مقاما محمودا‏}‏ قال وهذا المقام المحمود الذي وعده نبيكم صلى الله عليه وسلم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7441,
			"arabicnumber": 7441,
			"text": "حدثنا عبيد الله بن سعد بن إبراهيم، حدثني عمي، حدثنا أبي، عن صالح، عن ابن شهاب، قال حدثني أنس بن مالك، أن رسول الله صلى الله عليه وسلم أرسل إلى الأنصار فجمعهم في قبة وقال لهم ‏ \"‏ اصبروا حتى تلقوا الله ورسوله، فإني على الحوض ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7442,
			"arabicnumber": 7442,
			"text": "حدثني ثابت بن محمد، حدثنا سفيان، عن ابن جريج، عن سليمان الأحول، عن طاوس، عن ابن عباس ـ رضى الله عنهما ـ قال كان النبي صلى الله عليه وسلم إذا تهجد من الليل قال ‏ \"‏ اللهم ربنا لك الحمد، أنت قيم السموات والأرض، ولك الحمد أنت رب السموات والأرض ومن فيهن، ولك الحمد أنت نور السموات والأرض ومن فيهن، أنت الحق، وقولك الحق، ووعدك الحق، ولقاؤك الحق، والجنة حق، والنار حق، والساعة حق، اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك خاصمت، وبك حاكمت، فاغفر لي ما قدمت وما أخرت، وأسررت وأعلنت، وما أنت أعلم به مني، لا إله إلا أنت ‏\"‏‏.‏ قال أبو عبد الله قال قيس بن سعد وأبو الزبير عن طاوس قيام‏.‏ وقال مجاهد القيوم القائم على كل شىء‏.‏ وقرأ عمر القيام، وكلاهما مدح‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7443,
			"arabicnumber": 7443,
			"text": "حدثنا يوسف بن موسى، حدثنا أبو أسامة، حدثني الأعمش، عن خيثمة، عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما منكم من أحد إلا سيكلمه ربه، ليس بينه وبينه ترجمان ولا حجاب يحجبه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7444,
			"arabicnumber": 7444,
			"text": "حدثنا علي بن عبد الله، حدثنا عبد العزيز بن عبد الصمد، عن أبي عمران، عن أبي بكر بن عبد الله بن قيس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏ \"‏ جنتان من فضة آنيتهما وما فيهما، وجنتان من ذهب آنيتهما وما فيهما، وما بين القوم وبين أن ينظروا إلى ربهم إلا رداء الكبر على وجهه في جنة عدن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7445,
			"arabicnumber": 7445,
			"text": "حدثنا الحميدي، حدثنا سفيان، حدثنا عبد الملك بن أعين، وجامع بن أبي راشد، عن أبي وائل، عن عبد الله ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اقتطع مال امرئ مسلم بيمين كاذبة، لقي الله وهو عليه غضبان ‏\"‏‏.‏ قال عبد الله ثم قرأ رسول الله صلى الله عليه وسلم مصداقه من كتاب الله جل ذكره ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا أولئك لا خلاق لهم في الآخرة ولا يكلمهم الله‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7446,
			"arabicnumber": 7446,
			"text": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن عمرو، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم رجل حلف على سلعة لقد أعطى بها أكثر مما أعطى وهو كاذب، ورجل حلف على يمين كاذبة بعد العصر ليقتطع بها مال امرئ مسلم، ورجل منع فضل ماء فيقول الله يوم القيامة، اليوم أمنعك فضلي، كما منعت فضل ما لم تعمل يداك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7447,
			"arabicnumber": 7447,
			"text": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، حدثنا أيوب، عن محمد، عن ابن أبي بكرة، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الزمان قد استدار كهيئته يوم خلق الله السموات والأرض، السنة اثنا عشر شهرا، منها أربعة حرم ثلاث متواليات ذو القعدة وذو الحجة والمحرم، ورجب مضر الذي بين جمادى وشعبان، أى شهر هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم فسكت حتى ظننا أنه يسميه بغير اسمه قال ‏\"‏ أليس ذا الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى بلد هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه قال ‏\"‏ أليس البلدة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فأى يوم هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم فسكت حتى ظننا أنه سيسميه بغير اسمه قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم ـ قال محمد وأحسبه قال وأعراضكم ـ عليكم حرام، كحرمة يومكم هذا في بلدكم هذا في شهركم هذا، وستلقون ربكم فيسألكم عن أعمالكم، ألا فلا ترجعوا بعدي ضلالا، يضرب بعضكم رقاب بعض، ألا ليبلغ الشاهد الغائب، فلعل بعض من يبلغه أن يكون أوعى من بعض من سمعه ‏\"‏‏.‏ فكان محمد إذا ذكره قال صدق النبي صلى الله عليه وسلم ثم قال ‏\"‏ ألا هل بلغت ألا هل بلغت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7448,
			"arabicnumber": 7448,
			"text": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا عاصم، عن أبي عثمان، عن أسامة، قال كان ابن لبعض بنات النبي صلى الله عليه وسلم يقضي، فأرسلت إليه أن يأتيها فأرسل ‏\"‏ إن لله ما أخذ، وله ما أعطى، وكل إلى أجل مسمى، فلتصبر ولتحتسب ‏\"‏‏.‏ فأرسلت إليه فأقسمت عليه فقام رسول الله صلى الله عليه وسلم وقمت معه ومعاذ بن جبل وأبى بن كعب وعبادة بن الصامت، فلما دخلنا ناولوا رسول الله صلى الله عليه وسلم الصبي ونفسه تقلقل في صدره ـ حسبته قال ـ كأنها شنة، فبكى رسول الله صلى الله عليه وسلم فقال سعد بن عبادة أتبكي فقال ‏\"‏ إنما يرحم الله من عباده الرحماء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7449,
			"arabicnumber": 7449,
			"text": "حدثنا عبيد الله بن سعد بن إبراهيم، حدثنا يعقوب، حدثنا أبي، عن صالح بن كيسان، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ اختصمت الجنة والنار إلى ربهما فقالت الجنة يا رب ما لها لا يدخلها إلا ضعفاء الناس وسقطهم‏.‏ وقالت النار ـ يعني ـ أوثرت بالمتكبرين‏.‏ فقال الله تعالى للجنة أنت رحمتي‏.‏ وقال للنار أنت عذابي أصيب بك من أشاء، ولكل واحدة منكما ملؤها ـ قال ـ فأما الجنة فإن الله لا يظلم من خلقه أحدا، وإنه ينشئ للنار من يشاء فيلقون فيها فتقول هل من مزيد‏.‏ ثلاثا، حتى يضع فيها قدمه فتمتلئ ويرد بعضها إلى بعض وتقول قط قط قط ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7450,
			"arabicnumber": 7450,
			"text": "حدثنا حفص بن عمر، حدثنا هشام، عن قتادة، عن أنس ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليصيبن أقواما سفع من النار بذنوب أصابوها عقوبة، ثم يدخلهم الله الجنة بفضل رحمته يقال لهم الجهنميون ‏\"‏‏.‏ وقال همام حدثنا قتادة حدثنا أنس عن النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7451,
			"arabicnumber": 7451,
			"text": "حدثنا موسى، حدثنا أبو عوانة، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال جاء حبر إلى رسول الله صلى الله عليه وسلم فقال يا محمد إن الله يضع السماء على إصبع، والأرض على إصبع، والجبال على إصبع، والشجر والأنهار على إصبع، وسائر الخلق على إصبع، ثم يقول بيده أنا الملك فضحك رسول الله صلى الله عليه وسلم وقال ‏\"‏ ‏{‏وما قدروا الله حق قدره‏}‏‏\"‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7452,
			"arabicnumber": 7452,
			"text": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، أخبرني شريك بن عبد الله بن أبي نمر، عن كريب، عن ابن عباس، قال بت في بيت ميمونة ليلة والنبي صلى الله عليه وسلم عندها لأنظر كيف صلاة رسول الله صلى الله عليه وسلم بالليل، فتحدث رسول الله صلى الله عليه وسلم مع أهله ساعة ثم رقد، فلما كان ثلث الليل الآخر أو بعضه قعد فنظر إلى السماء فقرأ ‏{‏إن في خلق السموات والأرض‏}‏ إلى قوله ‏{‏لأولي الألباب‏}‏ ثم قام فتوضأ واستن، ثم صلى إحدى عشرة ركعة، ثم أذن بلال بالصلاة فصلى ركعتين، ثم خرج فصلى للناس الصبح‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7453,
			"arabicnumber": 7453,
			"text": "حدثنا إسماعيل، حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لما قضى الله الخلق كتب عنده فوق عرشه، إن رحمتي سبقت غضبي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7454,
			"arabicnumber": 7454,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا الأعمش، سمعت زيد بن وهب، سمعت عبد الله بن مسعود ـ رضى الله عنه ـ حدثنا رسول الله صلى الله عليه وسلم وهو الصادق المصدوق ‏ \"‏ إن خلق أحدكم يجمع في بطن أمه أربعين يوما وأربعين ليلة، ثم يكون علقة مثله، ثم يكون مضغة مثله، ثم يبعث إليه الملك فيؤذن بأربع كلمات، فيكتب رزقه وأجله وعمله وشقي أم سعيد ثم ينفخ فيه الروح، فإن أحدكم ليعمل بعمل أهل الجنة، حتى لا يكون بينها وبينه إلا ذراع، فيسبق عليه الكتاب، فيعمل بعمل أهل النار فيدخل النار، وإن أحدكم ليعمل بعمل أهل النار، حتى ما يكون بينها وبينه إلا ذراع فيسبق عليه الكتاب، فيعمل عمل أهل الجنة فيدخلها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7455,
			"arabicnumber": 7455,
			"text": "حدثنا خلاد بن يحيى، حدثنا عمر بن ذر، سمعت أبي يحدث، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهما ـ أن النبي صلى الله عليه وسلم قال ‏\"‏ يا جبريل ما يمنعك أن تزورنا أكثر مما تزورنا ‏\"‏‏.‏ فنزلت ‏{‏وما نتنزل إلا بأمر ربك له ما بين أيدينا وما خلفنا‏}‏ إلى آخر الآية‏.‏ قال هذا كان الجواب لمحمد صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7456,
			"arabicnumber": 7456,
			"text": "حدثنا يحيى، حدثنا وكيع، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنت أمشي مع رسول الله صلى الله عليه وسلم في حرث بالمدينة وهو متكئ على عسيب، فمر بقوم من اليهود فقال بعضهم لبعض سلوه عن الروح‏.‏ وقال بعضهم لا تسألوه عن الروح‏.‏ فسألوه فقام متوكئا على العسيب وأنا خلفه، فظننت أنه يوحى إليه فقال ‏{‏ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا‏}‏ فقال بعضهم لبعض قد قلنا لكم لا تسألوه‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7457,
			"arabicnumber": 7457,
			"text": "حدثنا إسماعيل، حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ تكفل الله لمن جاهد في سبيله، لا يخرجه إلا الجهاد في سبيله، وتصديق كلماته، بأن يدخله الجنة، أو يرجعه إلى مسكنه الذي خرج منه، مع ما نال من أجر أو غنيمة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7458,
			"arabicnumber": 7458,
			"text": "حدثنا محمد بن كثير، حدثنا سفيان، عن الأعمش، عن أبي وائل، عن أبي موسى، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال الرجل يقاتل حمية ويقاتل شجاعة ويقاتل رياء، فأى ذلك في سبيل الله قال ‏ \"‏ من قاتل لتكون كلمة الله هي العليا، فهو في سبيل الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7459,
			"arabicnumber": 7459,
			"text": "حدثنا شهاب بن عباد، حدثنا إبراهيم بن حميد، عن إسماعيل، عن قيس، عن المغيرة بن شعبة، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ لا يزال من أمتي قوم ظاهرين على الناس، حتى يأتيهم أمر الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 7460,
			"arabicnumber": 7460,
			"text": "حدثنا الحميدي، حدثنا الوليد بن مسلم، حدثنا ابن جابر، حدثني عمير بن هانئ، أنه سمع معاوية، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ لا يزال من أمتي أمة قائمة بأمر الله، ما يضرهم من كذبهم، ولا من خالفهم، حتى يأتي أمر الله وهم على ذلك ‏\"‏‏.‏ فقال مالك بن يخامر سمعت معاذا يقول وهم بالشأم‏.‏ فقال معاوية هذا مالك يزعم أنه سمع معاذا يقول وهم بالشأم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7461,
			"arabicnumber": 7461,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن عبد الله بن أبي حسين، حدثنا نافع بن جبير، عن ابن عباس، قال وقف النبي صلى الله عليه وسلم على مسيلمة في أصحابه فقال ‏ \"‏ لو سألتني هذه القطعة ما أعطيتكها، ولن تعدو أمر الله فيك، ولئن أدبرت ليعقرنك الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7462,
			"arabicnumber": 7462,
			"text": "حدثنا موسى بن إسماعيل، عن عبد الواحد، عن الأعمش، عن إبراهيم، عن علقمة، عن ابن مسعود، قال بينا أنا أمشي، مع النبي صلى الله عليه وسلم في بعض حرث المدينة وهو يتوكأ على عسيب معه، فمررنا على نفر من اليهود فقال بعضهم لبعض سلوه عن الروح‏.‏ فقال بعضهم لا تسألوه أن يجيء فيه بشىء تكرهونه‏.‏ فقال بعضهم لنسألنه‏.‏ فقام إليه رجل منهم فقال يا أبا القاسم ما الروح فسكت عنه النبي صلى الله عليه وسلم فعلمت أنه يوحى إليه فقال ‏{‏ويسألونك عن الروح قل الروح من أمر ربي وما أوتوا من العلم إلا قليلا‏}‏‏.‏ قال الأعمش هكذا في قراءتنا‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7463,
			"arabicnumber": 7463,
			"text": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ تكفل الله لمن جاهد في سبيله، لا يخرجه من بيته إلا الجهاد في سبيله، وتصديق كلمته أن يدخله الجنة، أو يرده إلى مسكنه بما نال من أجر أو غنيمة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7464,
			"arabicnumber": 7464,
			"text": "حدثنا مسدد، حدثنا عبد الوارث، عن عبد العزيز، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا دعوتم الله فاعزموا في الدعاء، ولا يقولن أحدكم إن شئت فأعطني، فإن الله لا مستكره له ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7465,
			"arabicnumber": 7465,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وحدثنا إسماعيل، حدثني أخي عبد الحميد، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن علي بن حسين، أن حسين بن علي ـ عليهما السلام ـ أخبره أن علي بن أبي طالب أخبره أن رسول الله صلى الله عليه وسلم طرقه وفاطمة بنت رسول الله صلى الله عليه وسلم ليلة فقال لهم ‏\"‏ ألا تصلون ‏\"‏‏.‏ قال علي فقلت يا رسول الله إنما أنفسنا بيد الله، فإذا شاء أن يبعثنا بعثنا، فانصرف رسول الله صلى الله عليه وسلم حين قلت ذلك، ولم يرجع إلى شيئا، ثم سمعته وهو مدبر يضرب فخذه ويقول ‏\"‏ ‏{‏وكان الإنسان أكثر شىء جدلا‏}‏‏\"‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7466,
			"arabicnumber": 7466,
			"text": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال بن علي، عن عطاء بن يسار، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ مثل المؤمن كمثل خامة الزرع، يفيء ورقه من حيث أتتها الريح تكفئها، فإذا سكنت اعتدلت، وكذلك المؤمن يكفأ بالبلاء، ومثل الكافر كمثل الأرزة صماء معتدلة حتى يقصمها الله إذا شاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7467,
			"arabicnumber": 7467,
			"text": "حدثنا الحكم بن نافع، أخبرنا شعيب، عن الزهري، أخبرني سالم بن عبد الله، أن عبد الله بن عمر ـ رضى الله عنهما ـ قال سمعت رسول الله صلى الله عليه وسلم وهو قائم على المنبر ‏ \"‏ إنما بقاؤكم فيما سلف قبلكم من الأمم، كما بين صلاة العصر إلى غروب الشمس، أعطي أهل التوراة التوراة، فعملوا بها حتى انتصف النهار، ثم عجزوا، فأعطوا قيراطا قيراطا، ثم أعطي أهل الإنجيل الإنجيل، فعملوا به حتى صلاة العصر، ثم عجزوا، فأعطوا قيراطا قيراطا، ثم أعطيتم القرآن فعملتم به حتى غروب الشمس، فأعطيتم قيراطين قيراطين، قال أهل التوراة ربنا هؤلاء أقل عملا وأكثر أجرا‏.‏ قال هل ظلمتكم من أجركم من شىء قالوا لا‏.‏ فقال فذلك فضلي أوتيه من أشاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7468,
			"arabicnumber": 7468,
			"text": "حدثنا عبد الله المسندي، حدثنا هشام، أخبرنا معمر، عن الزهري، عن أبي إدريس، عن عبادة بن الصامت، قال بايعت رسول الله صلى الله عليه وسلم في رهط فقال ‏ \"‏ أبايعكم على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تزنوا، ولا تقتلوا أولادكم، ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم ولا تعصوني في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فأخذ به في الدنيا فهو له كفارة وطهور، ومن ستره الله فذلك إلى الله إن شاء عذبه وإن شاء غفر له ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 7469,
			"arabicnumber": 7469,
			"text": "حدثنا معلى بن أسد، حدثنا وهيب، عن أيوب، عن محمد، عن أبي هريرة، أن نبي الله سليمان ـ عليه السلام ـ كان له ستون امرأة فقال لأطوفن الليلة على نسائي، فلتحملن كل امرأة ولتلدن فارسا يقاتل في سبيل الله، فطاف على نسائه، فما ولدت منهن إلا امرأة ولدت شق غلام‏.‏ قال نبي الله صلى الله عليه وسلم ‏ \"‏ لو كان سليمان استثنى لحملت كل امرأة منهن، فولدت فارسا يقاتل في سبيل الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 7470,
			"arabicnumber": 7470,
			"text": "حدثنا محمد، حدثنا عبد الوهاب الثقفي، حدثنا خالد الحذاء، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم دخل على أعرابي يعوده فقال ‏\"‏ لا بأس عليك طهور، إن شاء الله ‏\"‏‏.‏ قال قال الأعرابي طهور، بل هي حمى تفور على شيخ كبير، تزيره القبور‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ فنعم إذا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 7471,
			"arabicnumber": 7471,
			"text": "حدثنا ابن سلام، أخبرنا هشيم، عن حصين، عن عبد الله بن أبي قتادة، عن أبيه، حين ناموا عن الصلاة، قال النبي صلى الله عليه وسلم ‏ \"‏ إن الله قبض أرواحكم حين شاء، وردها حين شاء ‏\"‏‏.‏ فقضوا حوائجهم وتوضئوا إلى أن طلعت الشمس وابيضت فقام فصلى‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 7472,
			"arabicnumber": 7472,
			"text": "حدثنا يحيى بن قزعة، حدثنا إبراهيم، عن ابن شهاب، عن أبي سلمة، والأعرج،‏.‏ وحدثنا إسماعيل، حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، وسعيد بن المسيب، أن أبا هريرة، قال استب رجل من المسلمين ورجل من اليهود فقال المسلم والذي اصطفى محمدا على العالمين في قسم يقسم به، فقال اليهودي والذي اصطفى موسى على العالمين، فرفع المسلم يده عند ذلك فلطم اليهودي، فذهب اليهودي إلى رسول الله صلى الله عليه وسلم فأخبره بالذي كان من أمره وأمر المسلم، فقال النبي صلى الله عليه وسلم ‏ \"‏ لا تخيروني على موسى، فإن الناس يصعقون يوم القيامة فأكون أول من يفيق، فإذا موسى باطش بجانب العرش، فلا أدري أكان فيمن صعق فأفاق قبلي أو كان ممن استثنى الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 7473,
			"arabicnumber": 7473,
			"text": "حدثنا إسحاق بن أبي عيسى، أخبرنا يزيد بن هارون، أخبرنا شعبة، عن قتادة، عن أنس بن مالك ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ المدينة يأتيها الدجال فيجد الملائكة يحرسونها فلا يقربها الدجال ولا الطاعون إن شاء الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 7474,
			"arabicnumber": 7474,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثني أبو سلمة بن عبد الرحمن، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لكل نبي دعوة، فأريد إن شاء الله أن أختبي دعوتي شفاعة لأمتي يوم القيامة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 7475,
			"arabicnumber": 7475,
			"text": "حدثنا يسرة بن صفوان بن جميل اللخمي، حدثنا إبراهيم بن سعد، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ بينا أنا نائم رأيتني على قليب فنزعت ما شاء الله أن أنزع، ثم أخذها ابن أبي قحافة فنزع ذنوبا أو ذنوبين وفي نزعه ضعف، والله يغفر له، ثم أخذها عمر فاستحالت غربا، فلم أر عبقريا من الناس يفري فريه، حتى ضرب الناس حوله بعطن ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 7476,
			"arabicnumber": 7476,
			"text": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال كان النبي صلى الله عليه وسلم إذا أتاه السائل ـ وربما قال جاءه السائل ـ أو صاحب الحاجة قال ‏ \"‏ اشفعوا فلتؤجروا، ويقضي الله على لسان رسوله ما شاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 7477,
			"arabicnumber": 7477,
			"text": "حدثنا يحيى، حدثنا عبد الرزاق، عن معمر، عن همام، سمع أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يقل أحدكم اللهم اغفر لي إن شئت، ارحمني إن شئت، ارزقني إن شئت، وليعزم مسألته، إنه يفعل ما يشاء، لا مكره له ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 7478,
			"arabicnumber": 7478,
			"text": "حدثنا عبد الله بن محمد، حدثنا أبو حفص، عمرو حدثنا الأوزاعي، حدثني ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن ابن عباس ـ رضى الله عنهما ـ أنه تمارى هو والحر بن قيس بن حصن الفزاري في صاحب موسى أهو خضر، فمر بهما أبى بن كعب الأنصاري، فدعاه ابن عباس فقال إني تماريت أنا وصاحبي هذا في صاحب موسى الذي سأل السبيل إلى لقيه، هل سمعت رسول الله صلى الله عليه وسلم يذكر شأنه قال نعم إني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ بينا موسى في ملإ بني إسرائيل إذ جاءه رجل فقال هل تعلم أحدا أعلم منك فقال موسى لا‏.‏ فأوحي إلى موسى بلى عبدنا خضر‏.‏ فسأل موسى السبيل إلى لقيه، فجعل الله له الحوت آية وقيل له إذا فقدت الحوت فارجع فإنك ستلقاه‏.‏ فكان موسى يتبع أثر الحوت في البحر فقال فتى موسى لموسى أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره، قال موسى ذلك ما كنا نبغي، فارتدا على آثارهما قصصا فوجدا خضرا، وكان من شأنهما ما قص الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 7479,
			"arabicnumber": 7479,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وقال أحمد بن صالح حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ننزل غدا إن شاء الله بخيف بني كنانة حيث تقاسموا على الكفر ‏\"‏‏.‏ يريد المحصب‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 7480,
			"arabicnumber": 7480,
			"text": "حدثنا عبد الله بن محمد، حدثنا ابن عيينة، عن عمرو، عن أبي العباس، عن عبد الله بن عمر، قال حاصر النبي صلى الله عليه وسلم أهل الطائف فلم يفتحها فقال ‏\"‏ إنا قافلون إن شاء الله ‏\"‏‏.‏ فقال المسلمون نقفل ولم نفتح‏.‏ قال ‏\"‏ فاغدوا على القتال ‏\"‏‏.‏ فغدوا فأصابتهم جراحات‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ إنا قافلون غدا إن شاء الله ‏\"‏، فكأن ذلك أعجبهم فتبسم رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 7481,
			"arabicnumber": 7481,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو، عن عكرمة، عن أبي هريرة، يبلغ به النبي صلى الله عليه وسلم قال ‏ \"‏ إذا قضى الله الأمر في السماء ضربت الملائكة بأجنحتها خضعانا لقوله، كأنه سلسلة على صفوان ـ قال علي وقال غيره صفوان ـ ينفذهم ذلك، فإذا فزع عن قلوبهم قالوا ماذا قال ربكم قالوا الحق وهو العلي الكبير ‏\"‏‏.‏ قال علي وحدثنا سفيان، حدثنا عمرو، عن عكرمة، عن أبي هريرة، بهذا‏.‏ قال سفيان قال عمرو سمعت عكرمة، حدثنا أبو هريرة،‏.‏ قال علي قلت لسفيان قال سمعت عكرمة، قال سمعت أبا هريرة، قال نعم‏.‏ قلت لسفيان إن إنسانا روى عن عمرو عن عكرمة عن أبي هريرة يرفعه أنه قرأ فزع‏.‏ قال سفيان هكذا قرأ عمرو فلا أدري سمعه هكذا أم لا، قال سفيان وهى قراءتنا‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 7482,
			"arabicnumber": 7482,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، أخبرني أبو سلمة بن عبد الرحمن، عن أبي هريرة، أنه كان يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما أذن الله لشىء ما أذن للنبي صلى الله عليه وسلم يتغنى بالقرآن ‏\"‏‏.‏ وقال صاحب له يريد أن يجهر به‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 7483,
			"arabicnumber": 7483,
			"text": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد الخدري ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ يقول الله يا آدم‏.‏ فيقول لبيك وسعديك‏.‏ فينادى بصوت إن الله يأمرك أن تخرج من ذريتك بعثا إلى النار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 7484,
			"arabicnumber": 7484,
			"text": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت ما غرت على امرأة ما غرت على خديجة، ولقد أمره ربه أن يبشرها ببيت في الجنة‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 7485,
			"arabicnumber": 7485,
			"text": "حدثني إسحاق، حدثنا عبد الصمد، حدثنا عبد الرحمن ـ هو ابن عبد الله بن دينار ـ عن أبيه، عن أبي صالح، عن أبي هريرة ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله تبارك وتعالى إذا أحب عبدا نادى جبريل إن الله قد أحب فلانا فأحبه فيحبه جبريل، ثم ينادي جبريل في السماء إن الله قد أحب فلانا فأحبوه، فيحبه أهل السماء ويوضع له القبول في أهل الأرض ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 7486,
			"arabicnumber": 7486,
			"text": "حدثنا قتيبة بن سعيد، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يتعاقبون فيكم ملائكة بالليل وملائكة بالنهار، ويجتمعون في صلاة العصر وصلاة الفجر، ثم يعرج الذين باتوا فيكم فيسألهم وهو أعلم كيف تركتم عبادي فيقولون تركناهم وهم يصلون، وأتيناهم وهم يصلون ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 7487,
			"arabicnumber": 7487,
			"text": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن واصل، عن المعرور، قال سمعت أبا ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أتاني جبريل فبشرني أنه من مات لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت وإن سرق وإن زنى قال ‏\"‏ وإن سرق وإن زنى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 7488,
			"arabicnumber": 7488,
			"text": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا أبو إسحاق الهمداني، عن البراء بن عازب، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يا فلان إذا أويت إلى فراشك فقل اللهم أسلمت نفسي إليك، ووجهت وجهي إليك وفوضت أمري إليك، وألجأت ظهري إليك، رغبة ورهبة إليك، لا ملجأ ولا منجا منك إلا إليك، آمنت بكتابك الذي أنزلت، وبنبيك الذي أرسلت‏.‏ فإنك إن مت في ليلتك مت على الفطرة، وإن أصبحت أصبت أجرا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 7489,
			"arabicnumber": 7489,
			"text": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن إسماعيل بن أبي خالد، عن عبد الله بن أبي أوفى، قال قال رسول الله صلى الله عليه وسلم يوم الأحزاب ‏ \"‏ اللهم منزل الكتاب، سريع الحساب، اهزم الأحزاب وزلزل بهم ‏\"‏‏.‏ زاد الحميدي حدثنا سفيان، حدثنا ابن أبي خالد، سمعت عبد الله، سمعت النبي صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 7490,
			"arabicnumber": 7490,
			"text": "حدثنا مسدد، عن هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهما ـ ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ قال أنزلت ورسول الله صلى الله عليه وسلم متوار بمكة، فكان إذا رفع صوته سمع المشركون فسبوا القرآن ومن أنزله ومن جاء به‏.‏ وقال الله تعالى ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ لا تجهر بصلاتك حتى يسمع المشركون، ولا تخافت بها عن أصحابك فلا تسمعهم ‏{‏وابتغ بين ذلك سبيلا‏}‏ أسمعهم ولا تجهر حتى يأخذوا عنك القرآن‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 7491,
			"arabicnumber": 7491,
			"text": "حدثنا الحميدي، حدثنا سفيان، حدثنا الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏ \"‏ قال الله تعالى يؤذيني ابن آدم، يسب الدهر وأنا الدهر، بيدي الأمر، أقلب الليل والنهار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 7492,
			"arabicnumber": 7492,
			"text": "حدثنا أبو نعيم، حدثنا الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ يقول الله عز وجل الصوم لي وأنا أجزي به يدع شهوته وأكله وشربه من أجلي، والصوم جنة، وللصائم فرحتان فرحة حين يفطر وفرحة حين يلقى ربه، ولخلوف فم الصائم أطيب عند الله من ريح المسك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 7493,
			"arabicnumber": 7493,
			"text": "حدثنا عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ بينما أيوب يغتسل عريانا خر عليه رجل جراد من ذهب فجعل يحثي في ثوبه، فنادى ربه يا أيوب ألم أكن أغنيتك عما ترى قال بلى يا رب ولكن لا غنى بي عن بركتك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 7494,
			"arabicnumber": 7494,
			"text": "حدثنا إسماعيل، حدثني مالك، عن ابن شهاب، عن أبي عبد الله الأغر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يتنزل ربنا تبارك وتعالى كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر فيقول من يدعوني فأستجيب له، من يسألني فأعطيه، من يستغفرني فأغفر له ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 7496,
			"arabicnumber": 7496,
			"text": "",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 7497,
			"arabicnumber": 7497,
			"text": "حدثنا زهير بن حرب، حدثنا ابن فضيل، عن عمارة، عن أبي زرعة، عن أبي هريرة، فقال ‏ \"‏ هذه خديجة أتتك بإناء فيه طعام أو إناء فيه شراب فأقرئها من ربها السلام وبشرها ببيت من قصب لا صخب فيه ولا نصب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 7498,
			"arabicnumber": 7498,
			"text": "حدثنا معاذ بن أسد، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ قال الله أعددت لعبادي الصالحين ما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 7499,
			"arabicnumber": 7499,
			"text": "حدثنا محمود، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني سليمان الأحول، أن طاوسا، أخبره أنه، سمع ابن عباس، يقول كان النبي صلى الله عليه وسلم إذا تهجد من الليل قال ‏ \"‏ اللهم لك الحمد أنت نور السموات والأرض، ولك الحمد أنت قيم السموات والأرض، ولك الحمد أنت رب السموات والأرض، ومن فيهن أنت الحق، ووعدك الحق وقولك الحق، ولقاؤك الحق، والجنة حق، والنار حق، والنبيون حق، والساعة حق، اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك أنبت، وبك خاصمت، وإليك حاكمت، فاغفر لي ما قدمت وما أخرت، وما أسررت وما أعلنت، أنت إلهي، لا إله إلا أنت ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 7500,
			"arabicnumber": 7500,
			"text": "حدثنا حجاج بن منهال، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فبرأها الله مما قالوا ـ وكل حدثني طائفة من الحديث الذي حدثني ـ عن عائشة قالت ولكن والله ما كنت أظن أن الله ينزل في براءتي وحيا يتلى، ولشأني في نفسي كان أحقر من أن يتكلم الله في بأمر يتلى، ولكني كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله بها فأنزل الله تعالى ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 7501,
			"arabicnumber": 7501,
			"text": "حدثنا قتيبة بن سعيد، حدثنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يقول الله إذا أراد عبدي أن يعمل سيئة فلا تكتبوها عليه حتى يعملها، فإن عملها فاكتبوها بمثلها وإن تركها من أجلي فاكتبوها له حسنة وإذا أراد أن يعمل حسنة فلم يعملها فاكتبوها له حسنة، فإن عملها فاكتبوها له بعشر أمثالها إلى سبعمائة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 7502,
			"arabicnumber": 7502,
			"text": "حدثنا إسماعيل بن عبد الله، حدثني سليمان بن بلال، عن معاوية بن أبي مزرد، عن سعيد بن يسار، عن أبي هريرة ـ رضى الله عنه ـ أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خلق الله الخلق فلما فرغ منه قامت الرحم فقال مه‏.‏ قالت هذا مقام العائذ بك من القطيعة‏.‏ فقال ألا ترضين أن أصل من وصلك، وأقطع من قطعك قالت بلى يا رب‏.‏ قال فذلك لك ‏\"‏‏.‏ ثم قال أبو هريرة ‏{‏فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم‏}‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 7503,
			"arabicnumber": 7503,
			"text": "حدثنا مسدد، حدثنا سفيان، عن صالح، عن عبيد الله، عن زيد بن خالد، قال مطر النبي صلى الله عليه وسلم فقال ‏ \"‏ قال الله أصبح من عبادي كافر بي ومؤمن بي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 7504,
			"arabicnumber": 7504,
			"text": "حدثنا إسماعيل، حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ قال الله إذا أحب عبدي لقائي أحببت لقاءه، وإذا كره لقائي كرهت لقاءه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 7505,
			"arabicnumber": 7505,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ قال الله أنا عند ظن عبدي بي ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 7506,
			"arabicnumber": 7506,
			"text": "حدثنا إسماعيل، حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ قال رجل لم يعمل خيرا قط، فإذا مات فحرقوه واذروا نصفه في البر ونصفه في البحر فوالله لئن قدر الله عليه ليعذبنه عذابا لا يعذبه أحدا من العالمين، فأمر الله البحر فجمع ما فيه، وأمر البر فجمع ما فيه ثم قال لم فعلت قال من خشيتك، وأنت أعلم، فغفر له ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 7507,
			"arabicnumber": 7507,
			"text": "حدثنا أحمد بن إسحاق، حدثنا عمرو بن عاصم، حدثنا همام، حدثنا إسحاق بن عبد الله، سمعت عبد الرحمن بن أبي عمرة، قال سمعت أبا هريرة، قال سمعت النبي صلى الله عليه وسلم قال ‏ \"‏ إن عبدا أصاب ذنبا ـ وربما قال أذنب ذنبا ـ فقال رب أذنبت ـ وربما قال أصبت ـ فاغفر لي فقال ربه أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي‏.‏ ثم مكث ما شاء الله، ثم أصاب ذنبا أو أذنب ذنبا، فقال رب أذنبت ـ أو أصبت ـ آخر فاغفره‏.‏ فقال أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي، ثم مكث ما شاء الله ثم أذنب ذنبا ـ وربما قال أصاب ذنبا ـ قال قال رب أصبت ـ أو أذنبت ـ آخر فاغفره لي‏.‏ فقال أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي ـ ثلاثا ـ فليعمل ما شاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 7508,
			"arabicnumber": 7508,
			"text": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، سمعت أبي، حدثنا قتادة، عن عقبة بن عبد الغافر، عن أبي سعيد، عن النبي صلى الله عليه وسلم ‏\"‏ أنه ذكر رجلا فيمن سلف ـ أو فيمن كان قبلكم قال كلمة يعني ـ أعطاه الله مالا وولدا ـ فلما حضرت الوفاة قال لبنيه أى أب كنت لكم قالوا خير أب‏.‏ قال فإنه لم يبتئر ـ أو لم يبتئز ـ عند الله خيرا، وإن يقدر الله عليه يعذبه، فانظروا إذا مت فأحرقوني حتى إذا صرت فحما فاسحقوني ـ أو قال فاسحكوني ـ فإذا كان يوم ريح عاصف فأذروني فيها ‏\"‏ فقال نبي الله صلى الله عليه وسلم ‏\"‏ فأخذ مواثيقهم على ذلك وربي، ففعلوا ثم أذروه في يوم عاصف، فقال الله عز وجل كن‏.‏ فإذا هو رجل قائم‏.‏ قال الله أى عبدي ما حملك على أن فعلت ما فعلت قال مخافتك أو فرق منك قال فما تلافاه أن رحمه عندها ـ وقال مرة أخرى فما تلافاه غيرها ـ ‏\"‏‏.‏ فحدثت به أبا عثمان فقال سمعت هذا من سلمان غير أنه زاد فيه أذروني في البحر‏.‏ أو كما حدث‏.‏ حدثنا موسى، حدثنا معتمر، وقال، لم يبتئر‏.‏ وقال خليفة حدثنا معتمر، وقال، لم يبتئز‏.‏ فسره قتادة لم يدخر‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 7509,
			"arabicnumber": 7509,
			"text": "حدثنا يوسف بن راشد، حدثنا أحمد بن عبد الله، حدثنا أبو بكر بن عياش، عن حميد، قال سمعت أنسا ـ رضى الله عنه ـ قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ إذا كان يوم القيامة شفعت، فقلت يا رب أدخل الجنة من كان في قلبه خردلة‏.‏ فيدخلون، ثم أقول أدخل الجنة من كان في قلبه أدنى شىء ‏\"‏‏.‏ فقال أنس كأني أنظر إلى أصابع رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 7510,
			"arabicnumber": 7510,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، حدثنا معبد بن هلال العنزي، قال اجتمعنا ناس من أهل البصرة فذهبنا إلى أنس بن مالك وذهبنا معنا بثابت إليه يسأله لنا عن حديث الشفاعة، فإذا هو في قصره فوافقناه يصلي الضحى، فاستأذنا، فأذن لنا وهو قاعد على فراشه فقلنا لثابت لا تسأله عن شىء أول من حديث الشفاعة فقال يا أبا حمزة هؤلاء إخوانك من أهل البصرة جاءوك يسألونك عن حديث الشفاعة‏.‏ فقال حدثنا محمد صلى الله عليه وسلم قال ‏\"‏ إذا كان يوم القيامة ماج الناس بعضهم في بعض فيأتون آدم فيقولون اشفع لنا إلى ربك‏.‏ فيقول لست لها ولكن عليكم بإبراهيم فإنه خليل الرحمن‏.‏ فيأتون إبراهيم فيقول لست لها ولكن عليكم بموسى فإنه كليم الله‏.‏ فيأتون موسى فيقول لست لها ولكن عليكم بعيسى فإنه روح الله وكلمته‏.‏ فيأتون عيسى فيقول لست لها ولكن عليكم بمحمد صلى الله عليه وسلم فيأتوني فأقول أنا لها‏.‏ فأستأذن على ربي فيؤذن لي ويلهمني محامد أحمده بها لا تحضرني الآن، فأحمده بتلك المحامد وأخر له ساجدا فيقال يا محمد ارفع رأسك، وقل يسمع لك، وسل تعط، واشفع تشفع‏.‏ فأقول يا رب أمتي أمتي‏.‏ فيقال انطلق فأخرج من كان في قلبه مثقال شعيرة من إيمان‏.‏ فأنطلق فأفعل ثم أعود فأحمده بتلك المحامد، ثم أخر له ساجدا فيقال يا محمد ارفع رأسك، وقل يسمع لك، وسل تعط، واشفع تشفع، فأقول يا رب أمتي أمتي‏.‏ فيقال انطلق فأخرج منها من كان في قلبه مثقال ذرة أو خردلة من إيمان‏.‏ فأنطلق فأفعل ثم أعود فأحمده بتلك المحامد، ثم أخر له ساجدا فيقال يا محمد ارفع رأسك، وقل يسمع لك، وسل تعط، واشفع تشفع‏.‏ فأقول يا رب أمتي أمتي‏.‏ فيقول انطلق فأخرج من كان في قلبه أدنى أدنى أدنى مثقال حبة خردل من إيمان، فأخرجه من النار‏.‏ فأنطلق فأفعل ‏\"‏‏.‏ فلما خرجنا من عند أنس قلت لبعض أصحابنا لو مررنا بالحسن وهو متوار في منزل أبي خليفة فحدثنا بما حدثنا أنس بن مالك، فأتيناه فسلمنا عليه فأذن لنا فقلنا له يا أبا سعيد جئناك من عند أخيك أنس بن مالك فلم نر مثل ما حدثنا في الشفاعة، فقال هيه، فحدثناه بالحديث فانتهى إلى هذا الموضع فقال هيه، فقلنا لم يزد لنا على هذا‏.‏ فقال لقد حدثني وهو جميع منذ عشرين سنة فلا أدري أنسي أم كره أن تتكلوا‏.‏ قلنا يا أبا سعيد فحدثنا، فضحك وقال خلق الإنسان عجولا ما ذكرته إلا وأنا أريد أن أحدثكم حدثني كما حدثكم به قال ‏\"‏ ثم أعود الرابعة فأحمده بتلك، ثم أخر له ساجدا فيقال يا محمد ارفع رأسك وقل يسمع، وسل تعطه، واشفع تشفع‏.‏ فأقول يا رب ائذن لي فيمن قال لا إله إلا الله‏.‏ فيقول وعزتي وجلالي وكبريائي وعظمتي لأخرجن منها من قال لا إله إلا الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 7511,
			"arabicnumber": 7511,
			"text": "حدثنا محمد بن خالد، حدثنا عبيد الله بن موسى، عن إسرائيل، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن آخر أهل الجنة دخولا الجنة، وآخر أهل النار خروجا من النار رجل يخرج حبوا فيقول له ربه ادخل الجنة‏.‏ فيقول رب الجنة ملأى‏.‏ فيقول له ذلك ثلاث مرات فكل ذلك يعيد عليه الجنة ملأى‏.‏ فيقول إن لك مثل الدنيا عشر مرار ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 7512,
			"arabicnumber": 7512,
			"text": "حدثنا علي بن حجر، أخبرنا عيسى بن يونس، عن الأعمش، عن خيثمة، عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما منكم أحد إلا سيكلمه ربه، ليس بينه وبينه ترجمان، فينظر أيمن منه فلا يرى إلا ما قدم من عمله، وينظر أشأم منه فلا يرى إلا ما قدم، وينظر بين يديه فلا يرى إلا النار تلقاء وجهه، فاتقوا النار ولو بشق تمرة ‏\"‏‏.‏ قال الأعمش وحدثني عمرو بن مرة عن خيثمة مثله وزاد فيه ‏\"‏ ولو بكلمة طيبة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 7513,
			"arabicnumber": 7513,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله ـ رضى الله عنه ـ قال جاء حبر من اليهود فقال إنه إذا كان يوم القيامة جعل الله السموات على إصبع، والأرضين على إصبع، والماء والثرى على إصبع، والخلائق على إصبع، ثم يهزهن ثم يقول أنا الملك أنا الملك‏.‏ فلقد رأيت النبي صلى الله عليه وسلم يضحك حتى بدت نواجذه تعجبا وتصديقا، لقوله ثم قال النبي صلى الله عليه وسلم ‏{‏وما قدروا الله حق قدره‏}‏ إلى قوله ‏{‏يشركون‏}‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 7514,
			"arabicnumber": 7514,
			"text": "حدثنا مسدد، حدثنا أبو عوانة، عن قتادة، عن صفوان بن محرز، أن رجلا، سأل ابن عمر كيف سمعت رسول الله صلى الله عليه وسلم يقول في النجوى قال ‏ \"‏ يدنو أحدكم من ربه حتى يضع كنفه عليه فيقول أعملت كذا وكذا فيقول نعم‏.‏ ويقول عملت كذا وكذا فيقول نعم‏.‏ فيقرره، ثم يقول إني سترت عليك في الدنيا، وأنا أغفرها لك اليوم ‏\"‏‏.‏ وقال آدم حدثنا شيبان، حدثنا قتادة، حدثنا صفوان، عن ابن عمر، سمعت النبي صلى الله عليه وسلم",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 7515,
			"arabicnumber": 7515,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، حدثنا عقيل، عن ابن شهاب، حدثنا حميد بن عبد الرحمن، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ احتج آدم وموسى، فقال موسى أنت آدم الذي أخرجت ذريتك من الجنة‏.‏ قال آدم أنت موسى الذي اصطفاك الله برسالاته وكلامه، ثم تلومني على أمر قد قدر على قبل أن أخلق‏.‏ فحج آدم موسى ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 7516,
			"arabicnumber": 7516,
			"text": "حدثنا مسلم بن إبراهيم، حدثنا هشام، حدثنا قتادة، عن أنس ـ رضى الله عنه ـ قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يجمع المؤمنون يوم القيامة فيقولون لو استشفعنا إلى ربنا، فيريحنا من مكاننا هذا‏.‏ فيأتون آدم فيقولون له أنت آدم أبو البشر خلقك الله بيده وأسجد لك الملائكة وعلمك أسماء كل شىء، فاشفع لنا إلى ربنا حتى يريحنا‏.‏ فيقول لهم لست هناكم‏.‏ فيذكر لهم خطيئته التي أصاب ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 7517,
			"arabicnumber": 7517,
			"text": "حدثنا عبد العزيز بن عبد الله، حدثني سليمان، عن شريك بن عبد الله، أنه قال سمعت ابن مالك، يقول ليلة أسري برسول الله صلى الله عليه وسلم من مسجد الكعبة أنه جاءه ثلاثة نفر قبل أن يوحى إليه وهو نائم في المسجد الحرام، فقال أولهم أيهم هو فقال أوسطهم هو خيرهم‏.‏ فقال آخرهم خذوا خيرهم‏.‏ فكانت تلك الليلة، فلم يرهم حتى أتوه ليلة أخرى فيما يرى قلبه، وتنام عينه ولا ينام قلبه وكذلك الأنبياء تنام أعينهم ولا تنام قلوبهم، فلم يكلموه حتى احتملوه فوضعوه عند بئر زمزم فتولاه منهم جبريل فشق جبريل ما بين نحره إلى لبته حتى فرغ من صدره وجوفه، فغسله من ماء زمزم بيده، حتى أنقى جوفه، ثم أتي بطست من ذهب فيه تور من ذهب محشوا إيمانا وحكمة، فحشا به صدره ولغاديده ـ يعني عروق حلقه ـ ثم أطبقه ثم عرج به إلى السماء الدنيا فضرب بابا من أبوابها فناداه أهل السماء من هذا فقال جبريل‏.‏ قالوا ومن معك قال معي محمد‏.‏ قال وقد بعث قال نعم‏.‏ قالوا فمرحبا به وأهلا‏.‏ فيستبشر به أهل السماء، لا يعلم أهل السماء بما يريد الله به في الأرض حتى يعلمهم، فوجد في السماء الدنيا آدم فقال له جبريل هذا أبوك فسلم عليه‏.‏ فسلم عليه ورد عليه آدم وقال مرحبا وأهلا بابني، نعم الابن أنت‏.‏ فإذا هو في السماء الدنيا بنهرين يطردان فقال ما هذان النهران يا جبريل قال هذا النيل والفرات عنصرهما‏.‏ ثم مضى به في السماء فإذا هو بنهر آخر عليه قصر من لؤلؤ وزبرجد فضرب يده فإذا هو مسك قال ما هذا يا جبريل قال هذا الكوثر الذي خبأ لك ربك‏.‏ ثم عرج إلى السماء الثانية فقالت الملائكة له مثل ما قالت له الأولى من هذا قال جبريل‏.‏ قالوا ومن معك قال محمد صلى الله عليه وسلم‏.‏ قالوا وقد بعث إليه قال نعم‏.‏ قالوا مرحبا به وأهلا‏.‏ ثم عرج به إلى السماء الثالثة وقالوا له مثل ما قالت الأولى والثانية، ثم عرج به إلى الرابعة فقالوا له مثل ذلك، ثم عرج به إلى السماء الخامسة فقالوا مثل ذلك، ثم عرج به إلى السماء السادسة فقالوا له مثل ذلك، ثم عرج به إلى السماء السابعة فقالوا له مثل ذلك، كل سماء فيها أنبياء قد سماهم فأوعيت منهم إدريس في الثانية، وهارون في الرابعة، وآخر في الخامسة لم أحفظ اسمه، وإبراهيم في السادسة، وموسى في السابعة بتفضيل كلام الله، فقال موسى رب لم أظن أن يرفع على أحد‏.‏ ثم علا به فوق ذلك بما لا يعلمه إلا الله، حتى جاء سدرة المنتهى ودنا الجبار رب العزة فتدلى حتى كان منه قاب قوسين أو أدنى فأوحى الله فيما أوحى إليه خمسين صلاة على أمتك كل يوم وليلة‏.‏ ثم هبط حتى بلغ موسى فاحتبسه موسى فقال يا محمد ماذا عهد إليك ربك قال عهد إلى خمسين صلاة كل يوم وليلة‏.‏ قال إن أمتك لا تستطيع ذلك فارجع فليخفف عنك ربك وعنهم‏.‏ فالتفت النبي صلى الله عليه وسلم إلى جبريل كأنه يستشيره في ذلك، فأشار إليه جبريل أن نعم إن شئت‏.‏ فعلا به إلى الجبار فقال وهو مكانه يا رب خفف عنا، فإن أمتي لا تستطيع هذا‏.‏ فوضع عنه عشر صلوات ثم رجع إلى موسى فاحتبسه، فلم يزل يردده موسى إلى ربه حتى صارت إلى خمس صلوات، ثم احتبسه موسى عند الخمس فقال يا محمد والله لقد راودت بني إسرائيل قومي على أدنى من هذا فضعفوا فتركوه فأمتك أضعف أجسادا وقلوبا وأبدانا وأبصارا وأسماعا، فارجع فليخفف عنك ربك، كل ذلك يلتفت النبي صلى الله عليه وسلم إلى جبريل ليشير عليه ولا يكره ذلك جبريل، فرفعه عند الخامسة فقال يا رب إن أمتي ضعفاء أجسادهم وقلوبهم وأسماعهم وأبدانهم فخفف عنا فقال الجبار يا محمد‏.‏ قال لبيك وسعديك‏.‏ قال إنه لا يبدل القول لدى، كما فرضت عليك في أم الكتاب ـ قال ـ فكل حسنة بعشر أمثالها، فهى خمسون في أم الكتاب وهى خمس عليك‏.‏ فرجع إلى موسى فقال كيف فعلت فقال خفف عنا أعطانا بكل حسنة عشر أمثالها‏.‏ قال موسى قد والله راودت بني إسرائيل على أدنى من ذلك فتركوه، ارجع إلى ربك فليخفف عنك أيضا‏.‏ قال رسول الله صلى الله عليه وسلم يا موسى قد والله استحييت من ربي مما اختلفت إليه‏.‏ قال فاهبط باسم الله‏.‏ قال واستيقظ وهو في مسجد الحرام‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 7518,
			"arabicnumber": 7518,
			"text": "حدثنا يحيى بن سليمان، حدثني ابن وهب، قال حدثني مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ إن الله يقول لأهل الجنة يا أهل الجنة‏.‏ فيقولون لبيك ربنا وسعديك والخير في يديك‏.‏ فيقول هل رضيتم فيقولون وما لنا لا نرضى يا رب وقد أعطيتنا ما لم تعط أحدا من خلقك‏.‏ فيقول ألا أعطيكم أفضل من ذلك‏.‏ فيقولون يا رب وأى شىء أفضل من ذلك فيقول أحل عليكم رضواني فلا أسخط عليكم بعده أبدا ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 7519,
			"arabicnumber": 7519,
			"text": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عطاء بن يسار، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يوما يحدث وعنده رجل من أهل البادية ‏ \"‏ أن رجلا من أهل الجنة استأذن ربه في الزرع فقال أو لست فيما شئت‏.‏ قال بلى ولكني أحب أن أزرع‏.‏ فأسرع وبذر فتبادر الطرف نباته واستواؤه واستحصاده وتكويره أمثال الجبال فيقول الله تعالى دونك يا ابن آدم فإنه لا يشبعك شىء ‏\"‏‏.‏ فقال الأعرابي يا رسول الله لا تجد هذا إلا قرشيا أو أنصاريا فإنهم أصحاب زرع، فأما نحن فلسنا بأصحاب زرع‏.‏ فضحك رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 7520,
			"arabicnumber": 7520,
			"text": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن منصور، عن أبي وائل، عن عمرو بن شرحبيل، عن عبد الله، قال سألت النبي صلى الله عليه وسلم أى الذنب أعظم عند الله قال ‏\"‏ أن تجعل لله ندا وهو خلقك ‏\"‏‏.‏ قلت إن ذلك لعظيم‏.‏ قلت ثم أى قال ‏\"‏ ثم أن تقتل ولدك تخاف أن يطعم معك ‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ ثم أن تزاني بحليلة جارك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 7521,
			"arabicnumber": 7521,
			"text": "حدثنا الحميدي، حدثنا سفيان، حدثنا منصور، عن مجاهد، عن أبي معمر، عن عبد الله ـ رضى الله عنه ـ قال اجتمع عند البيت ثقفيان وقرشي، أو قرشيان وثقفي، كثيرة شحم بطونهم قليلة فقه قلوبهم فقال أحدهم أترون أن الله يسمع ما نقول قال الآخر يسمع إن جهرنا ولا يسمع إن أخفينا وقال الآخر إن كان يسمع إذا جهرنا فإنه يسمع إذا أخفينا‏.‏ فأنزل الله تعالى ‏{‏وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 7522,
			"arabicnumber": 7522,
			"text": "حدثنا علي بن عبد الله، حدثنا حاتم بن وردان، حدثنا أيوب، عن عكرمة، عن ابن عباس ـ رضى الله عنهما ـ قال كيف تسألون أهل الكتاب عن كتبهم وعندكم كتاب الله أقرب الكتب عهدا بالله، تقرءونه محضا لم يشب",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 7523,
			"arabicnumber": 7523,
			"text": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، أخبرني عبيد الله بن عبد الله، أن عبد الله بن عباس، قال يا معشر المسلمين كيف تسألون أهل الكتاب عن شىء وكتابكم الذي أنزل الله على نبيكم صلى الله عليه وسلم أحدث الأخبار بالله محضا لم يشب وقد حدثكم الله أن أهل الكتاب قد بدلوا من كتب الله وغيروا فكتبوا بأيديهم، قالوا هو من عند الله‏.‏ ليشتروا بذلك ثمنا قليلا، أو لا ينهاكم ما جاءكم من العلم عن مسألتهم، فلا والله ما رأينا رجلا منهم يسألكم عن الذي أنزل عليكم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 7524,
			"arabicnumber": 7524,
			"text": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن موسى بن أبي عائشة، عن سعيد بن جبير، عن ابن عباس، في قوله تعالى ‏{‏لا تحرك به لسانك‏}‏ قال كان النبي صلى الله عليه وسلم يعالج من التنزيل شدة، وكان يحرك شفتيه ـ فقال لي ابن عباس أحركهما لك كما كان رسول الله صلى الله عليه وسلم يحركهما فقال سعيد أنا أحركهما كما كان ابن عباس يحركهما فحرك شفتيه ـ فأنزل الله عز وجل ‏{‏لا تحرك به لسانك لتعجل به * إن علينا جمعه وقرآنه‏}‏ قال جمعه في صدرك ثم تقرؤه‏.‏ ‏{‏فإذا قرأناه فاتبع قرآنه‏}‏ قال فاستمع له وأنصت ثم إن علينا أن تقرأه‏.‏ قال فكان رسول الله صلى الله عليه وسلم إذا أتاه جبريل ـ عليه السلام ـ استمع فإذا انطلق جبريل قرأه النبي صلى الله عليه وسلم كما أقرأه‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 7525,
			"arabicnumber": 7525,
			"text": "حدثني عمرو بن زرارة، عن هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهما ـ في قوله تعالى ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ قال نزلت ورسول الله صلى الله عليه وسلم مختف بمكة، فكان إذا صلى بأصحابه رفع صوته بالقرآن، فإذا سمعه المشركون سبوا القرآن ومن أنزله ومن جاء به، فقال الله لنبيه صلى الله عليه وسلم ‏{‏ولا تجهر بصلاتك‏}‏ أى بقراءتك، فيسمع المشركون، فيسبوا القرآن ‏{‏ولا تخافت بها‏}‏ عن أصحابك فلا تسمعهم ‏{‏وابتغ بين ذلك سبيلا‏}‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 7526,
			"arabicnumber": 7526,
			"text": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة ـ رضى الله عنها ـ قالت نزلت هذه الآية ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ في الدعاء‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 7527,
			"arabicnumber": 7527,
			"text": "حدثنا إسحاق، حدثنا أبو عاصم، أخبرنا ابن جريج، أخبرنا ابن شهاب، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من لم يتغن بالقرآن ‏\"‏‏.‏ وزاد غيره ‏\"‏ يجهر به ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 7528,
			"arabicnumber": 7528,
			"text": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تحاسد إلا في اثنتين رجل آتاه الله القرآن فهو يتلوه آناء الليل وآناء النهار، فهو يقول لو أوتيت مثل ما أوتي هذا، لفعلت كما يفعل‏.‏ ورجل آتاه الله مالا فهو ينفقه في حقه فيقول لو أوتيت مثل ما أوتي عملت فيه مثل ما يعمل ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 7529,
			"arabicnumber": 7529,
			"text": "حدثنا علي بن عبد الله، حدثنا سفيان، قال الزهري عن سالم، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا حسد إلا في اثنتين رجل آتاه الله القرآن فهو يتلوه آناء الليل وآناء النهار، ورجل آتاه الله مالا فهو ينفقه آناء الليل وآناء النهار ‏\"‏‏.‏ سمعت سفيان مرارا لم أسمعه يذكر الخبر وهو من صحيح حديثه‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 7530,
			"arabicnumber": 7530,
			"text": "حدثنا الفضل بن يعقوب، حدثنا عبد الله بن جعفر الرقي، حدثنا المعتمر بن سليمان، حدثنا سعيد بن عبيد الله الثقفي، حدثنا بكر بن عبد الله المزني، وزياد بن جبير بن حية، عن جبير بن حية، قال المغيرة أخبرنا نبينا، صلى الله عليه وسلم عن رسالة، ربنا ‏ \"‏ أنه من قتل منا صار إلى الجنة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 7531,
			"arabicnumber": 7531,
			"text": "حدثنا محمد بن يوسف، حدثنا سفيان، عن إسماعيل، عن الشعبي، عن مسروق، عن عائشة ـ رضى الله عنها ـ قالت من حدثك أن محمدا صلى الله عليه وسلم كتم شيئا وقال محمد حدثنا أبو عامر العقدي حدثنا شعبة عن إسماعيل بن أبي خالد عن الشعبي عن مسروق عن عائشة قالت من حدثك أن النبي صلى الله عليه وسلم كتم شيئا من الوحى، فلا تصدقه، إن الله تعالى يقول ‏{‏يا أيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته‏}‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 7532,
			"arabicnumber": 7532,
			"text": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن الأعمش، عن أبي وائل، عن عمرو بن شرحبيل، قال قال عبد الله قال رجل يا رسول الله أى الذنب أكبر عند الله قال ‏\"‏ أن تدعو لله ندا، وهو خلقك ‏\"‏‏.‏ قال ثم أى قال ‏\"‏ ثم أن تقتل ولدك، أن يطعم معك ‏\"‏‏.‏ قال ثم أى قال ‏\"‏ أن تزاني حليلة جارك ‏\"‏‏.‏ فأنزل الله تصديقها ‏{‏والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك‏}‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 7533,
			"arabicnumber": 7533,
			"text": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، أخبرني سالم، عن ابن عمر ـ رضى الله عنهما ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إنما بقاؤكم فيمن سلف من الأمم كما بين صلاة العصر إلى غروب الشمس، أوتي أهل التوراة التوراة فعملوا بها حتى انتصف النهار، ثم عجزوا فأعطوا قيراطا قيراطا، ثم أوتي أهل الإنجيل الإنجيل فعملوا به حتى صليت العصر، ثم عجزوا فأعطوا قيراطا قيراطا، ثم أوتيتم القرآن فعملتم به حتى غربت الشمس، فأعطيتم قيراطين قيراطين، فقال أهل الكتاب هؤلاء أقل منا عملا وأكثر أجرا‏.‏ قال الله هل ظلمتكم من حقكم شيئا قالوا لا‏.‏ قال فهو فضلي أوتيه من أشاء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 7534,
			"arabicnumber": 7534,
			"text": "حدثني سليمان، حدثنا شعبة، عن الوليد،‏.‏ وحدثني عباد بن يعقوب الأسدي، أخبرنا عباد بن العوام، عن الشيباني، عن الوليد بن العيزار، عن أبي عمرو الشيباني، عن ابن مسعود ـ رضى الله عنه ـ أن رجلا، سأل النبي صلى الله عليه وسلم أى الأعمال أفضل قال ‏ \"‏ الصلاة لوقتها، وبر الوالدين، ثم الجهاد في سبيل الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 7535,
			"arabicnumber": 7535,
			"text": "حدثنا أبو النعمان، حدثنا جرير بن حازم، عن الحسن، حدثنا عمرو بن تغلب، قال أتى النبي صلى الله عليه وسلم مال فأعطى قوما ومنع آخرين فبلغه أنهم عتبوا فقال ‏ \"‏ إني أعطي الرجل وأدع الرجل، والذي أدع أحب إلى من الذي أعطي، أعطي أقواما لما في قلوبهم من الجزع والهلع، وأكل أقواما إلى ما جعل الله في قلوبهم من الغنى والخير منهم عمرو بن تغلب ‏\"‏‏.‏ فقال عمرو ما أحب أن لي بكلمة رسول الله صلى الله عليه وسلم حمر النعم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 7536,
			"arabicnumber": 7536,
			"text": "حدثني محمد بن عبد الرحيم، حدثنا أبو زيد، سعيد بن الربيع الهروي حدثنا شعبة، عن قتادة، عن أنس ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم يرويه عن ربه، قال ‏ \"‏ إذا تقرب العبد إلى شبرا تقربت إليه ذراعا، وإذا تقرب مني ذراعا تقربت منه باعا، وإذا أتاني مشيا أتيته هرولة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 7537,
			"arabicnumber": 7537,
			"text": "حدثنا مسدد، عن يحيى، عن التيمي، عن أنس بن مالك، عن أبي هريرة، قال ـ ربما ذكر النبي صلى الله عليه وسلم ـ قال ‏ \"‏ إذا تقرب العبد مني شبرا تقربت منه ذراعا وإذا تقرب مني ذراعا تقربت منه باعا أو بوعا ‏\"‏‏.‏ وقال معتمر سمعت أبي، سمعت أنسا، ‏{‏عن أبي هريرة،‏}‏ عن النبي صلى الله عليه وسلم يرويه عن ربه، عز وجل‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 7538,
			"arabicnumber": 7538,
			"text": "حدثنا آدم، حدثنا شعبة، حدثنا محمد بن زياد، قال سمعت أبا هريرة، عن النبي صلى الله عليه وسلم يرويه عن ربكم، قال ‏ \"‏ لكل عمل كفارة، والصوم لي وأنا أجزي به، ولخلوف فم الصائم أطيب عند الله من ريح المسك ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 7539,
			"arabicnumber": 7539,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، عن قتادة،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، عن سعيد، عن قتادة، عن أبي العالية، عن ابن عباس ـ رضى الله عنهما ـ عن النبي صلى الله عليه وسلم فيما يرويه عن ربه قال ‏ \"‏ لا ينبغي لعبد أن يقول إنه خير من يونس بن متى ‏\"‏‏.‏ ونسبه إلى أبيه‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 7540,
			"arabicnumber": 7540,
			"text": "حدثنا أحمد بن أبي سريج، أخبرنا شبابة، حدثنا شعبة، عن معاوية بن قرة، عن عبد الله بن مغفل المزني، قال رأيت رسول الله صلى الله عليه وسلم يوم الفتح على ناقة له يقرأ سورة الفتح، أو من سورة الفتح ـ قال ـ فرجع فيها ـ قال ـ ثم قرأ معاوية يحكي قراءة ابن مغفل وقال ‏ \"‏ لولا أن يجتمع الناس عليكم لرجعت كما رجع ابن مغفل ‏\"‏‏.‏ يحكي النبي صلى الله عليه وسلم فقلت لمعاوية كيف كان ترجيعه قال آ آ آ ثلاث مرات‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 7541,
			"arabicnumber": 7541,
			"text": "وقال ابن عباس أخبرني أبو سفيان بن حرب، أن هرقل، دعا ترجمانه، ثم دعا بكتاب النبي صلى الله عليه وسلم فقرأه ‏\"‏ بسم الله الرحمن الرحيم من محمد عبد الله ورسوله إلى هرقل، و‏{‏يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم ‏}‏‏\"‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 7542,
			"arabicnumber": 7542,
			"text": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال كان أهل الكتاب يقرءون التوراة بالعبرانية، ويفسرونها بالعربية لأهل الإسلام فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تصدقوا أهل الكتاب، ولا تكذبوهم و‏{‏قولوا آمنا بالله وما أنزل‏}‏ الآية ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 7543,
			"arabicnumber": 7543,
			"text": "حدثنا مسدد، حدثنا إسماعيل، عن أيوب، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال أتي النبي صلى الله عليه وسلم برجل وامرأة من اليهود قد زنيا فقال لليهود ‏\"‏ ما تصنعون بهما ‏\"‏‏.‏ قالوا نسخم وجوههما ونخزيهما‏.‏ قال ‏\"‏ ‏{‏فأتوا بالتوراة فاتلوها إن كنتم صادقين‏}‏ ‏\"‏‏.‏ فجاءوا فقالوا لرجل ممن يرضون يا أعور اقرأ‏.‏ فقرأ حتى انتهى على موضع منها فوضع يده عليه‏.‏ قال ‏\"‏ ارفع يدك ‏\"‏‏.‏ فرفع يده فإذا فيه آية الرجم تلوح فقال يا محمد إن عليهما الرجم‏.‏ ولكنا نكاتمه بيننا‏.‏ فأمر بهما فرجما، فرأيته يجانئ عليها الحجارة‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 7544,
			"arabicnumber": 7544,
			"text": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع النبي صلى الله عليه وسلم يقول ‏ \"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت بالقرآن يجهر به ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 7545,
			"arabicnumber": 7545,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن يونس، عن ابن شهاب، أخبرني عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة حين قال لها أهل الإفك ما قالوا ـ وكل حدثني طائفة من الحديث ـ قالت فاضطجعت على فراشي، وأنا حينئذ أعلم أني بريئة وأن الله يبرئني، ولكن والله ما كنت أظن أن الله ينزل في شأني وحيا يتلى، ولشأني في نفسي كان أحقر من أن يتكلم الله في بأمر يتلى، وأنزل الله عز وجل ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات كلها‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 7546,
			"arabicnumber": 7546,
			"text": "حدثنا أبو نعيم، حدثنا مسعر، عن عدي بن ثابت، أراه عن البراء، قال سمعت النبي صلى الله عليه وسلم يقرأ في العشاء ‏{‏والتين والزيتون‏}‏ فما سمعت أحدا أحسن صوتا أو قراءة منه‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 7547,
			"arabicnumber": 7547,
			"text": "حدثنا حجاج بن منهال، حدثنا هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس ـ رضى الله عنهما ـ قال كان النبي صلى الله عليه وسلم متواريا بمكة، وكان يرفع صوته، فإذا سمع المشركون سبوا القرآن ومن جاء به، فقال الله عز وجل لنبيه صلى الله عليه وسلم ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 7548,
			"arabicnumber": 7548,
			"text": "حدثنا إسماعيل، حدثني مالك، عن عبد الرحمن بن عبد الله بن عبد الرحمن بن أبي صعصعة، عن أبيه، أنه أخبره أن أبا سعيد الخدري ـ رضى الله عنه ـ قال له ‏ \"‏ إني أراك تحب الغنم والبادية، فإذا كنت في غنمك أو باديتك فأذنت للصلاة فارفع صوتك بالنداء، فإنه لا يسمع مدى صوت المؤذن جن ولا إنس ولا شىء، إلا شهد له يوم القيامة ‏\"‏‏.‏ قال أبو سعيد سمعته من رسول الله صلى الله عليه وسلم‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 7549,
			"arabicnumber": 7549,
			"text": "حدثنا قبيصة، حدثنا سفيان، عن منصور، عن أمه، عن عائشة، قالت كان النبي صلى الله عليه وسلم يقرأ القرآن ورأسه في حجري وأنا حائض‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 7550,
			"arabicnumber": 7550,
			"text": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، حدثني عروة، أن المسور بن مخرمة، وعبد الرحمن بن عبد القاري، حدثاه أنهما، سمعا عمر بن الخطاب، يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان في حياة رسول الله صلى الله عليه وسلم فاستمعت لقراءته، فإذا هو يقرأ على حروف كثيرة لم يقرئنيها رسول الله صلى الله عليه وسلم، فكدت أساوره في الصلاة، فتصبرت حتى سلم، فلببته بردائه فقلت من أقرأك هذه السورة التي سمعتك تقرأ قال أقرأنيها رسول الله صلى الله عليه وسلم فقلت كذبت، أقرأنيها على غير ما قرأت‏.‏ فانطلقت به أقوده إلى رسول الله صلى الله عليه وسلم فقلت إني سمعت هذا يقرأ سورة الفرقان على حروف لم تقرئنيها‏.‏ فقال ‏\"‏ أرسله، اقرأ يا هشام ‏\"‏‏.‏ فقرأ القراءة التي سمعته‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذلك أنزلت ‏\"‏‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ يا عمر ‏\"‏‏.‏ فقرأت التي أقرأني فقال ‏\"‏ كذلك أنزلت، إن هذا القرآن أنزل على سبعة أحرف فاقرءوا ما تيسر منه ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 7551,
			"arabicnumber": 7551,
			"text": "حدثنا أبو معمر، حدثنا عبد الوارث، قال يزيد حدثني مطرف بن عبد الله، عن عمران، قال قلت يا رسول الله فيما يعمل العاملون قال ‏ \"‏ كل ميسر لما خلق له ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 7552,
			"arabicnumber": 7552,
			"text": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن منصور، والأعمش، سمعا سعد بن عبيدة، عن أبي عبد الرحمن، عن علي ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم أنه كان في جنازة فأخذ عودا فجعل ينكت في الأرض فقال ‏\"‏ ما منكم من أحد إلا كتب مقعده من النار أو من الجنة ‏\"‏‏.‏ قالوا ألا نتكل‏.‏ قال ‏\"‏ اعملوا فكل ميسر ‏{‏فأما من أعطى واتقى‏}‏ ‏\"‏‏.‏ الآية‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 7553,
			"arabicnumber": 7553,
			"text": "وقال لي خليفة بن خياط حدثنا معتمر، سمعت أبي، عن قتادة، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لما قضى الله الخلق كتب كتابا عنده غلبت ـ أو قال سبقت ـ رحمتي غضبي‏.‏ فهو عنده فوق العرش ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 7554,
			"arabicnumber": 7554,
			"text": "حدثني محمد بن أبي غالب، حدثنا محمد بن إسماعيل، حدثنا معتمر، سمعت أبي يقول، حدثنا قتادة، أن أبا رافع، حدثه أنه، سمع أبا هريرة ـ رضى الله عنه ـ يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن الله كتب كتابا قبل أن يخلق الخلق إن رحمتي سبقت غضبي‏.‏ فهو مكتوب عنده فوق العرش ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 7555,
			"arabicnumber": 7555,
			"text": "حدثنا عبد الله بن عبد الوهاب، حدثنا عبد الوهاب، حدثنا أيوب، عن أبي قلابة، والقاسم التميمي، عن زهدم، قال كان بين هذا الحى من جرم وبين الأشعريين ود وإخاء، فكنا عند أبي موسى الأشعري فقرب إليه الطعام فيه لحم دجاج، وعنده رجل من بني تيم الله كأنه من الموالي، فدعاه إليه فقال إني رأيته يأكل شيئا ف��قذرته، فحلفت لا آكله‏.‏ فقال هلم فلأحدثك عن ذاك، إني أتيت النبي صلى الله عليه وسلم في نفر من الأشعريين نستحمله قال ‏\"‏ والله لا أحملكم وما عندي ما أحملكم ‏\"‏‏.‏ فأتي النبي صلى الله عليه وسلم بنهب إبل فسأل عنا فقال ‏\"‏ أين النفر الأشعريون ‏\"‏‏.‏ فأمر لنا بخمس ذود غر الذرى، ثم انطلقنا قلنا ما صنعنا حلف رسول الله صلى الله عليه وسلم لا يحملنا، وما عنده ما يحملنا، ثم حملنا، تغفلنا رسول الله صلى الله عليه وسلم يمينه، والله لا نفلح أبدا، فرجعنا إليه فقلنا له فقال ‏\"‏ لست أنا أحملكم، ولكن الله حملكم، إني والله لا أحلف على يمين فأرى غيرها خيرا منها، إلا أتيت الذي هو خير منه، وتحللتها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 7556,
			"arabicnumber": 7556,
			"text": "حدثنا عمرو بن علي، حدثنا أبو عاصم، حدثنا قرة بن خالد، حدثنا أبو جمرة الضبعي، قلت لابن عباس فقال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا إن بيننا وبينك المشركين من مضر، وإنا لا نصل إليك إلا في أشهر حرم، فمرنا بجمل من الأمر، إن عملنا به دخلنا الجنة، وندعو إليها من وراءنا‏.‏ قال ‏ \"‏ آمركم بأربع وأنهاكم عن أربع، آمركم بالإيمان بالله، وهل تدرون ما الإيمان بالله شهادة أن لا إله إلا الله، وإقام الصلاة، وإيتاء الزكاة، وتعطوا من المغنم الخمس، وأنهاكم عن أربع لا تشربوا في الدباء، والنقير، والظروف المزفتة، والحنتمة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 7557,
			"arabicnumber": 7557,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن نافع، عن القاسم بن محمد، عن عائشة ـ رضى الله عنها ـ أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن أصحاب هذه الصور يعذبون يوم القيامة، ويقال لهم أحيوا ما خلقتم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 7558,
			"arabicnumber": 7558,
			"text": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر ـ رضى الله عنهما ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ إن أصحاب هذه الصور يعذبون يوم القيامة، ويقال لهم أحيوا ما خلقتم ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 7559,
			"arabicnumber": 7559,
			"text": "حدثنا محمد بن العلاء، حدثنا ابن فضيل، عن عمارة، عن أبي زرعة، سمع أبا هريرة ـ رضى الله عنه ـ قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ قال الله عز وجل ومن أظلم ممن ذهب يخلق كخلقي، فليخلقوا ذرة، أو ليخلقوا حبة أو شعيرة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 7560,
			"arabicnumber": 7560,
			"text": "حدثنا هدبة بن خالد، حدثنا همام، حدثنا قتادة، حدثنا أنس، عن أبي موسى ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏ \"‏ مثل المؤمن الذي يقرأ القرآن كالأترجة، طعمها طيب وريحها طيب، والذي لا يقرأ كالتمرة، طعمها طيب ولا ريح لها، ومثل الفاجر الذي يقرأ القرآن كمثل الريحانة، ريحها طيب وطعمها مر، ومثل الفاجر الذي لا يقرأ القرآن كمثل الحنظلة، طعمها مر ولا ريح لها ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 7561,
			"arabicnumber": 7561,
			"text": "حدثنا علي، حدثنا هشام، أخبرنا معمر، عن الزهري، ح وحدثني أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرني يحيى بن عروة بن الزبير، أنه سمع عروة بن الزبير، قالت عائشة ـ رضى الله عنها ـ سأل أناس النبي صلى الله عليه وسلم عن الكهان فقال ‏\"‏ إنهم ليسوا بشىء ‏\"‏‏.‏ فقالوا يا رسول الله فإنهم يحدثون بالشىء يكون حقا‏.‏ قال فقال النبي صلى الله عليه وسلم ‏\"‏ تلك الكلمة من الحق يخطفها الجني فيقرقرها في أذن وليه كقرقرة الدجاجة، فيخلطون فيه أكثر من مائة كذبة ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 7562,
			"arabicnumber": 7562,
			"text": "حدثنا أبو النعمان، حدثنا مهدي بن ميمون، سمعت محمد بن سيرين، يحدث عن معبد بن سيرين، عن أبي سعيد الخدري ـ رضى الله عنه ـ عن النبي صلى الله عليه وسلم قال ‏\"‏ يخرج ناس من قبل المشرق ويقرءون القرآن لا يجاوز تراقيهم، يمرقون من الدين كما يمرق السهم من الرمية، ثم لا يعودون فيه حتى يعود السهم إلى فوقه ‏\"‏‏.‏ قيل ما سيماهم‏.‏ قال ‏\"‏ سيماهم التحليق ‏\"‏‏.‏ أو قال ‏\"‏ التسبيد ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 7563,
			"arabicnumber": 7563,
			"text": "حدثني أحمد بن إشكاب، حدثنا محمد بن فضيل، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة ـ رضى الله عنه ـ قال قال النبي صلى الله عليه وسلم ‏ \"‏ كلمتان حبيبتان إلى الرحمن، خفيفتان على اللسان، ثقيلتان في الميزان سبحان الله وبحمده، سبحان الله العظيم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 188
			}
		}
	]
}