{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"1": "The Times of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1,
			"arabicnumber": 1,
			"text": "İbni Şihab (Ez-Zührî)'den: rivayet edildiğine göre: Ömer b. Abdülaziz bir gün (ikindi) namazını geciktirdi. O sırada huzuruna giren Urve b. Zübeyr (onu uyarmak için) şu hadisi nakletti: «— Kufe'de bir gün Muğire b. Şube (ikindi) namazını geciktirmişti. O sırada yanına girmiş olan Ebu Mes'ud el-Ensârî: — Bunu neden yaptın Muğire? Hatırlamıyor musun, bir gün Cebrail (A.S.) gelmişti de öğle namazını kılmıştı. Sonra Resulullah Sallallahu Aleyhi ve Sellem de kılmıştı. Sonra (ikindi) namazını kıldı, Resûlullah da kıldı. Sonra (akşam) namazım kıldı, Resûlullah da kıldı, daha sonra (yatsı) namazını kıldı, Resûlullah da kıldı. Daha sonra da sabah namazını kıldı, Resûlullah da kıldı. Ondan sonra da (Cibril): «Bunlarla emrolundun, buyurdu.» demişti. Bunun üzerine Ömer b. Abdülazız: «— Urve, ne dediğini iyi düşün; Resulullah (s.a.v.)'e namaz vakitlerini bildiren Cibril mi idi?» diye sordu. Urve de: «— Beşir b. Ebî Mes'ud, babasından böyle rivayet etti» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2,
			"arabicnumber": 2,
			"text": "Urve der ki: Âişe (r.anha) bana: «Resulullah Sallallahu Aleyhi ve Sellem ikindi namazım, güneş henüz odamın duvarında yükselmeden kılardı.» dedi. Diğer tahric edenler: Buhari, Mevakitu's-Sâlat, 9/1; Müslim, Mesâcid, 5/167; Şeybanî, 3",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3,
			"arabicnumber": 3,
			"text": "Ata b. Yesar anlatıyor: Bir adam Resulullah Sallallahu Aleyhi ve Sellem'in huzuruna gelerek, sabah namazının vaktini sordu. Resulallah Sallallahu Aleyhi ve Sellem cevap vermedi. Ertesi gün sabah namazını şafak atınca kıldı; Bir gün sonra da, ortalık ağarınca kıldı. Daha sonra da: «— (Sabah) namazının vaktini soran nerede?» buyurdu. Adam: «— Benim Ya Resulallah» deyince; <r— Bu iki vaktin arasındaki zamandır.» buyurdu>",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4,
			"arabicnumber": 4,
			"text": "Aişe (r.anha) der ki: Resulullah Sallallahu Aleyhi ve Sellem sabah namazım kıldıktan sonra kadınlar, örtülerine bürünmüş olarak evlerine dönerlerken henüz karanlıktan tanınmıyorlardı",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5,
			"arabicnumber": 5,
			"text": "Ebu Hureyre (r.a.), Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu riva­yet etti: «Güneş doğmadan sabah namazının bir rek'atma yetişebilen kimse, sabah namazını kendi vaktinde kılmış olur. Güneş batmadan da ikindi namazının bir rek'atına yetişebilen ikindiyi kendi vaktinde kılmış olur.» Diğer tahric: Buharî, Mevakîtu's-Salat; Müslim, Mesacid",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6,
			"arabicnumber": 6,
			"text": "Abdullah b. Ömer'in azadlısı Nafi der ki: Ömer b; el-Hattab r.a. valilerine şunu yazdı: «Bana göre en önemli vazifeniz namazdır. Kim onu —devam ederek— vaktinde kılarsa, dinini korumuş olur. Kim de namazlarını ihmal ederse, diğer vazifelerini haliyle daha çok ihmal eder.» Daha sonra da şunları yazdı: «Öğle namazını, bir şeyin gölgesi fey-i zevalin dışında bir arşın oluşundan itibaren, gölgeniz bir misli oluncaya kadar kılın. İkindi namazını, henüz güneş yüksekte, beyazken kılın. Namazdan sonra, güneş batmadan önce bir atlının iki veya üç fersah gidebileceği kadar bir zaman olsun. Akşamı, güneş batınca kılın. Yatsıyı, kırmızılığın (akşam şafağının) [12] kaybolmasından itibaren gecenin üçte birine kadar kılın. Yatsıyı kılmadan yatanların gözüne uyku girmesin .Yatsıyı kılmadan yatanların. gözüne uyku girmesin. Yatsıyı kılmadan yatanların gözüne uyku girmesin. Sabah namazını, yıldızlar batmadan parlakken kılın.» Bu Hadis Sadece Muvatta da var",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7,
			"arabicnumber": 7,
			"text": "Ebu Süheyl r.a.'in babasından rivayete göre: Ömer (r.a.) Ebu Musa el-Eş'ari'ye şöyle yazdı: Öğle namazını, güneş tepeden dönünce (zeval vaktini müteakip), ikindiyi güneş parlakken, sararmadan, akşamı güneş batınca kıl. Yatsıyı yatıncaya kadar geciktir. Sabah namazını yıldızlar henüz azalmadan parlakken kıl ve sabah namazında, Mufassal surelerden iki sure oku.[14] Bu Hadis Sadece Muvatta da var. Mufassal sureler, Hucurat'dan Abese'ye kadar olan, surelerdir. Bakara'dan Tevbe'ye kadar, «Tıval» (uzun sureler) «Tekvîr»'den «Nas»a kadar olanlara da «kısar» yani kısa sureler denir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 8,
			"arabicnumber": 8,
			"text": "Urve de şöyle rivayet eder: Ömer b. el-Hattab, Ebu Musa el-Eşari'ye şöyle yazdı: İkindi namazını güneş beyaz ve parlakken, yani bir atlının akşama kadar üç fersah gidebileceği kadar bir vakit varken kıl. Yatsıyı gecenin üçte birine kadar, hatta gece yarısına kadar geciktirebilirsin. Ancak, sakın gafillerden olmayasın. Bu Hadis Sadece Muvatta da var",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 9,
			"arabicnumber": 9,
			"text": "Abdullah b. Rafi, Ebu Hureyre'ye namaz vakitlerini sordu. O da «Sana söyleyeyim: Öğle namazını, gölgen boyunca olduğunda, ikindiyi, gölgen boyunun iki misli olduğunda, akşamı güneş batınca, yatsıyı akşamla gecenin üçte biri arasında, sabah namazını da henüz karanlıkken kıl» dedi. Bu Hadis Sadece Muvatta da var. Ebu Hanife'ye göre, ikindinin vakti, gölge boyun iki misli olunca başlar. Şeybanî, 1",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 10,
			"arabicnumber": 10,
			"text": "Enes b. Malik (r.a.) der ki: İkindi namazını kılardık, cemaat'ten bazısı Amr b. Avf oğullarının yurduna gider, henüz onların ikindi namazı kılmakta olduklarını görürdü.[16] Diğer tahric: Buhari, Mevakitu's-Salat,; Müslim",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 11,
			"arabicnumber": 11,
			"text": "Enes b. Malik (r.a.) der ki: İkindi namazını kıldıktan sonra Kuba'ya giden kimse oraya vardığında güneş hala yüksekte bulunurdu.[17] Diğer tahric: Buhari, Mevakîtu's-Salat,; Müslim, Mesacid, «Kuba», Medine'ye Üç mil uzaktadır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 12,
			"arabicnumber": 12,
			"text": "(Tabiinden) Kasım b. Muhammed der ki: Ashab'a yetiştim. Onlar öğle namazını hava biraz serinleyince kılıyorlardı. Bu Hadis Sadece Muvatta da var",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 13,
			"arabicnumber": 13,
			"text": "Ebu Süheyl, babası Malik'ten rivayet eder: Cum'a günü Akil b. Ebî Talib'in keçesi (hasırı) mescidin batı duvarının dibine konuyordu. Duvarın gölgesi keçeyi tamamen kaplayınca, Ömer (r.a.) gelip Cum'a namazını kıldırıyordu. Ebu Süheyl'in babası Malik devam ederek der ki: Cum'a namazından sonra gidip Kaylule (Öğle uykusuna) yatıyorduk. Bu Hadis Sadece Muvatta da var",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 14,
			"arabicnumber": 14,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 15,
			"arabicnumber": 15,
			"text": "Ebu Hureyre'den: Resulullah Sallallahu Aleyhi ve Sellem: «Namazın bir rek'atına yetişen, cemaata yetişmiş olur» buyurdu. Diğer tahric edenler: Buhari, Mevakîtu's-Salat,; Müslim, Mesacid",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 16,
			"arabicnumber": 16,
			"text": "Abdullah b. Ömer şöyle derdi: (İmamla) rukua yetişemezsen, secdeye de (dolayısıyle o rekat'a) yetişememiş olursun. Bu Hadis Sadece Muvatta da var",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 17,
			"arabicnumber": 17,
			"text": "Abdullah b. Ömer ve Zeyd b. Sabit: «Kim imamla rukua yetişirse secdeye, (dolayısıyle o rekata) yetişmiş olur.» derlerdi. Bu Hadis Sadece Muvatta da var",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 18,
			"arabicnumber": 18,
			"text": "Ebu Hureyre der ki: Bir rek'ata yetişen secdeye (namaza) yetişmiş olur. Fatiha'yı kaçıran kimse ise, birçok hayrı kaçırmış olur. Bu Hadis Sadece Muvatta da var",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 19,
			"arabicnumber": 19,
			"text": "Abdullah b. Ömer der ki: «Güneşin dönmesi, batıya doğru yönelmesidir.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 20,
			"arabicnumber": 20,
			"text": "Abdullah b. Abbas (r.a.) der ki: «Güneşin dönmesi,» gölgenin batı'dan güneye dönmesidir. Gecenin karanlığı, gece'nin başlaması ve karanlığın tamamen basmasıdır.[22] Bu Hadis Sadece Muvatta da var. Abdullah (r.a.) bu sözü ile, îsra suresinin 78.ayetini kastediyor. Bu ayeti kerîme işaret yolu ile beş vakit namazı ifade etmektedir: Güneşin meyli, öğle ve ikindi namazlarına; karanlığın basması, akşam ve yatsı namazlarına; Fecr Kur'an'ı (Kur'ane'l-Fecr) da, sabah namazına işarettir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 21,
			"arabicnumber": 21,
			"text": "Abdullah b. Ömer r.a.'in rivayetine göre, Resuîullah Sallallahu Aleyhi ve Sellem: «ikindi namazını kaçıran kimse, ailesini ve malını zayi etmiş gibidir» buyurdu. Diğer tahric edenler: Buhari, Mevakitu's-Salat; Müslim, Mesacid; Şeyban-î, 222",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 22,
			"arabicnumber": 22,
			"text": "Yahya b. Saîd rivayet eder: Ömer b. El-Hattab (r.a.) ikindi namazından dönerken, namaz'a gelmeyen birine rastladı ve: «İkindi namazına niçin gelmedin?» dedi. Adam özür beyan etti. Bunun üzerine Hz. Ömer de: «Ziyandasın!» dedi. Yahya der ki: imam Malik, \"Ziyandasın\" ifadesini açıklamak üzere şöyle der: \"Her şeyin bir karşılığı ve ziyanı vardır, denir.\" Bu Hadis Sadece Muvatta da var",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 23,
			"arabicnumber": 23,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 24,
			"arabicnumber": 24,
			"text": "İmam Malik der ki: Kanaatime göre -Allah bilir- bütün vakit baygın kalmıştır. Yoksa namaz vakti çıkmadan ayılan kimse mutlaka namazını kılmalıdır. Bu Hadis Sadece Muvatta da var",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 25,
			"arabicnumber": 25,
			"text": "Saîd b. el-Museyyeb rivayet eder: Resulullah Sallallahu Aleyhi ve Sellem, Hayber fethinden dönüşünde gece yola devam etti. Gece'nin yarısından çoğu geçince biraz uyuyup dinlenmek için konakladı. Bilal'e: «—Uyuma, bizi sabah namazına kaldır» buyurdu ve uyudu. Ashab da uyudu. Bilal bir süre bekledikten sonra —sabaha karşı— devesine dayandı, gözleri uykuya daldı. Güneş doğup yüzlerine vuruncaya kadar ne Resulullah Sallallahu Aleyhi ve Sellem, ne Bilal, ne de Ashab uyandı. Resulü Ekrem birden heyecanla uyanınca, Bilal: «— Ya Resulallah; Seni uyutan (Allah) beni de uyuttu.» dedi. Bunun üzerine Resulullah hareket emri verdi. Savaşçılar develerini kaldırıp yola düştüler. Biraz gittikten sonra Resulullah Sallallahu Aleyhi ve Sellem Bilal'e emretti. Bilal kamet etti. Resulü Ekrem cemaate sabah namazım kıldırdı.[26] Namazdan sonra da: «Namazı unutup kılamayan onu hatırlayınca kılsın. Çünkü Allah Teala kitabmda *Beni hatırlayınca namazı kıl [Taha 14] buyurur» dedi.[28] Bu hadis, mürseldir; Müslim mesacid'de mevsul olarak yer almaktadır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 26,
			"arabicnumber": 26,
			"text": "Zeyd b. Eslem rivayet eder: Resulullah bir gece Mekke yolunda konakladı. Kendilerini namaza kaldırması için de Bilal'i vazifelendirdi ve uyudu. Ashab da uyudu. (Bir süre sonra) Bilal da uyudu. Ancak güneş doğunca uyanabildiler. Uyanıp telaşa düşünce Resulullah Sallallahu Aleyhi ve Sellem hemen bineklerine binmelerini, o vadiden çıkmalarını emretti, ve: «Bu vadide şeytan vardır» buyurdu. (Develerine ve atlarına) bindiler. Vadiyi geçtikten sonra, Resulullah Sallallahu Aleyhi ve Sellem inmelerini ve abdest almalarını emretti. Bilal'e de ezan okumasını veya kamet getirmesini söyledi. Resulullah namazı kıldırdı, cemaate döndü. Korku ve heyecanlarını görünce onlara: «Ey insanlar! Şüphesiz ruhumuzu Allah aldı (Bizi Allah uyuttu). Dileseydi ruhumuzu bize başka bir zamanda iade ederdi. Bizi daha erken uyandırırdı. Sizden kim uyuya-kalır, yahut unutur da namazı kılanı azsa uyanınca, nama­zını vaktinde kıldığı gibi kılsın» dedikten sonra, Ebu Bekr'e dönerek: «Bilal namaz kılıyordu, şeytan geldi onu yatırdı, ninni ile uyutulan çocuk gibi onu uyuttu.» dedi. Daha sonra Hz. Nebi Bilal'i çağırdı. Bilal, Resulullah'ın (daha önceden) Ebu Bekr'e haber verdiği şeylerin aynısını kendisine anlatınca, Ebu Bekr «Gerçekten senin Allah'ın Resulü olduğuna şahadet ederim» dedi. Bu Hadis Sadece Muvatta da var. Bütün Muvatta ravîlerinin ittifakiyle hadis mürseldir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 27,
			"arabicnumber": 27,
			"text": "Ata b. Yesar'dan: Resulullah Sallallahu Aleyhi ve Sellem: «Sıcağın şiddeti, cehennemin nefesindendir.. Sıcak şiddetlenince namazı (biraz te'hir edip) hava biraz serinleyince kılın» dedi ve devam etti: «Cehennem Rabbine şikayet ederek: Yarabbi! Ateşim birbirini yedi, dedi. Rabbi de ona senede iki nefes alma izni verdi: Bir nefes yazın, bir nefes kışın.» Bu Hadis Sadece Muvatta da var. İzah Hadis mürseldir. Ebu Ömer'in dediğine göre İmam Malik ve başkalarının bir çok yolla rivayet etmiş oldukları muttasıl hadisler bunu takviye eder. Buhari, Mevakitu's-Salat; Müslim, Mesacid «Sıcağın şiddeti, cehennemin nefesindendir» sözü sıcakların şiddetinden kinayedir. Asr-ı Saadette mescidin büyük kısmının üzeri açıktı. Namazı da kızgın kumun üzerinde kılıyorlardı. Bunlara bir de gölgede 40-50 dereceyi bulan Hicaz'ın sıcaklarını eklersek, güneş tepede iken öğle namazının ne kadar zor kılınacağını düşünebiliriz. Böyle zamanlarda öğle namazını biraz geciktirmek (mekruh vakte bırakmamak şartıyla) müstehabtır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 28,
			"arabicnumber": 28,
			"text": "وَذَكَرَ : « أَنَّ النَّارَ اشْتَكَتْ إِلَى رَبِّهَا، فَأَذِنَ لَهَا فِي كُلِّ عَامٍ بِنَفَسَيْنِ، نَفَسٍ فِي الشِّتَاءِ وَنَفَسٍ فِي الصَّيْفِ »(26). Ebu Hureyre'den: Resulullah Sallallahu Aleyhi ve Sellem: «Sıcak şiddetli olunca (öğle) namazını biraz te'hir edin; serin vakte bırakın, zira sıcağın şiddeti, cehennemin nefesindendir.» buyurdu. Sonra şu hadisi zikretti: «Cehennem, Rabbine şikayette bulundu. O da, senede iki nefes izin verdi: Bir ne­fes kışın, bir nefes de yazın.» Buhari, Mevakitu's-Saîat; Müslim, Mesacid; Şeybanî, 183",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 29,
			"arabicnumber": 29,
			"text": "Ebu Hureyre'den: Resulullah Sallallahu Aleyhi ve Sellem buyurdular ki: «Çok sıcakta namazı biraz te'hir edin. Zira sıcaklığın şiddeti, cehennemin nefesindendir.»33 Hadis mürseldir. Müslim, (Mesacid de muttasıl olarak rivayet etmiştir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 30,
			"arabicnumber": 30,
			"text": "Said b. El Müseyyeb'den: Resulullah Sallallahu aleyhi ve Sellem buyurdular ki: «Şu bitkiden (sarmısaktan) yiyen mescitlerimize girip bizi sarmısak kokusuyla rahatsız etmesin.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 31,
			"arabicnumber": 31,
			"text": "İmam Malik, Abdurrahman bin Mücebber'dan rivayet eder: «Salim b. Abdullah namazda ağzını bir atkıyla kapatan birini görünce, ağzını kapatan bu atkıyı sertçe çekip, açardı.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 31
			}
		}
	]
}