{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"13": "Asking for Rain"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 449,
			"arabicnumber": 449,
			"text": "Abdullah b. Ebu Bekir b. Amr b. Hazm (r.a) Abbad b. Temim'i şöyle derken işitmiştir: \"Abdullah b. Zeyd el-Mazini'den işittim şöyle diyordu: \"Rasuluilah Sallallahu Aleyhi ve Sellem namazgaha çıkarak yağmur yağması için dua etti, kıbleye döndü ve elbisesini ters çevirdi.\" Diğer tahric: Buhari, İstiska; Müslim, İstiska",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 449
			}
		},
		{
			"hadithnumber": 450,
			"arabicnumber": 450,
			"text": "Amr b. Şuayb (r.a)'dan rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem yağmur duasında şöyle dua ederdi: \"Allah'ım! Kullarına ve diğer canlı ve hayvanlara yağmur ver, rahmetini etrafa saç ve ölü arazileri dirilt.\" Diğer tahric: Ebu Davud, İstiska",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 450
			}
		},
		{
			"hadithnumber": 451,
			"arabicnumber": 451,
			"text": "Enes b. Malik (r.a)'den rivayete göre, şöyle demiştir: \"Bir kimse Raslilullah Sallallahu Aleyhi ve Sellem'a gelerek: \"Ey Allah'ın Raslilü! Tüm hayvanlar helak oldu (kuraklıktan dolayı gelip giden kalmadı) yollar kesildi. Allah'a dua edin de yağmur yağsın\" dedi. Bunun üzerine Raslilullah Sallallahu Aleyhi ve Sellem de dua etti de bir sonraki cumaya kadar yağmur yağdı. Yine bir kimse gelerek şöyle dedi: \"Ey Allah'ın Raslilü! Yağan yağmurdan evler yıkılacak hale geldi, yollar yürünmez hale geldi (hayvanlar otlaklara gidemedikleri için) açlıktan yok olup gidecekler.\" Bunun üzerine Raslilullah Sallallahu Aleyhi ve Sellem: \"Allah'ım! Yağmuru dağların tepelerine, ormanıara, vadilerin otlarına sevk et\" diye dua etti. Yağmur vücuttan elbisenin çıkarılışı gibi Medine'den çekilip gitti.\" Diğer tahric: Buhari, İstiska; Müslim, İstiska",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 451
			}
		},
		{
			"hadithnumber": 452,
			"arabicnumber": 452,
			"text": "Zeyd b. Halid el Cüheni (r.a)'den rivayete göre, şöyle demiştir: \"Rasulullah Sallallahu Aleyhi ve Sellem bize Hudeybiye'de yağmur yağması akabinde gecenin sonunda bize sabah namazı kıldırdı. Namazını bitirince cemaate dönerek: \"Biliyor musunuz Rabbiniz ne buyurdu?\" diye sordu. Ashab ta: \"Allah ve Rasulü daha iyi bilir\" dediler. Bunun üzerine Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Allah şöyle buyurdu: \"Kullarımdan bir kısmı bana iman ederek, bir kısmı da beni inkar ederek sabahladılar. Allah'ın lütfu ve rahmetiyle bize yağmur verildi diyenler bana iman etmişler ve yıldızları inkar etmişlerdir. Falan veya filan yıldızlar bize yağmur yağdırdı diyenler ise beni inkar edip yıldızlara inanmışlardır.\" Diğer tahric: Buharı, Ezan; Müslim, İman",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 452
			}
		},
		{
			"hadithnumber": 453,
			"arabicnumber": 453,
			"text": "Malik (r.a.) diyor ki: \"Bana ulaştığına göre Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Deniz tarafından bir bulut ortaya çıkar, Şam tarafına doğru yol alırsa o bulutun yağmuru çok olur.\" Bu haber: Sadece İmam-ı Malik'in Muvatta'mda geçmektedir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 453
			}
		},
		{
			"hadithnumber": 454,
			"arabicnumber": 454,
			"text": "Malik (r.a) diyor ki: \"Bana ulaştığına göre, Ebu Hureyre şöyle dermiş: \"Sabahleyin kalktığımızda yağmur yağmışsa Allah'ın lütfuyla bize yağmur yağmış der ve Fatır suresi 2. ayetini okurdu: \"Allah'ın insanlar için açacağı rahmet kapısını kimse kapatamaz ve O'nun kapattığını da kimse açamaz. Çünkü o güçlüdür, O'nun gücüne hiçbir güç erişemez ve O yaptığı her şeyi yerli yerince yapandır.\" Bu Haber Sadece İmam-ı Malik'in Muvatta'mda geçmektedir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 454
			}
		}
	]
}