{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"14": "The Qibla"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 455,
			"arabicnumber": 455,
			"text": "Resulullah'ın Sallallahu Aleyhi ve Sellem arkadaşı Ebu Eyyub el-Ensari Mısır'da iken şöyle derdi: «İnanın ki şu helaları ne yapacağımı bilmiyorum! Çünkü Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştu: «Sizden bi­ri büyük veya küçük su dökmeye gittiği zaman önünü veya arkasını kıbleye karşı döndürmesin.» Diğer tahric: Buharî, Vudu; Müslim, Taharet",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 455
			}
		},
		{
			"hadithnumber": 456,
			"arabicnumber": 456,
			"text": "Nafi’, Ensardan bir adam'dan naklediyor: Resulullah, Sallallahu Aleyhi ve Sellem büyük ya da küçük su dökerken kıbleye karşı dönmeyi yasaklamıştır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 456
			}
		},
		{
			"hadithnumber": 457,
			"arabicnumber": 457,
			"text": "Abdullah b. Ömer'den: Diyorlar ki: «Def-i hacet'e oturduğunuz zaman kıbleye ve Beytü'l-makdis'e karşı dönmeyiniz.» Ben bir defasında evimin damına çıkmıştım, Resulullah Sallallahu Aleyhi ve Sellem'in iki kerpiç üzerine çıktığını ve Beytü'l-makdis'e karşı da dönmüş olarak def-i hacet yaptığını gördüm. Daha sonra: «Her halde sen de uylukları üzerine yatarak na­maz kılanlardansın.» dedi. Ben de: «Vallahi bilemiyorum.» diye karşılık verdim. İmam Malik, uylukları üzerine yatarak namaz kılmayı, secdeye varıldığı zaman dizler yerde iken vücudu uyluklardan ayırmadan tamamen yere ve uyluklar üzerine yapıştırmak şeklinde tarif etmiştir. Diğer tahric: Buhari, Vudu; Müslim, Taharet; Şafiî, Risale, no: 812",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 457
			}
		},
		{
			"hadithnumber": 458,
			"arabicnumber": 458,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 458
			}
		},
		{
			"hadithnumber": 459,
			"arabicnumber": 459,
			"text": "Süleyman b. Yesar'dan: Ebû Eyyüb el-Ensari hacca gitmek için yola çıktı. Mekke yolu üzerindeki Nazîye'ye gelince bineğini kaybetti. Bayram günü Ömer b. Hattab'ın huzuruna çıktı, olanları anlattı. Ömer (radıyallahü anh) ona: Umre yapan nasıl yaparsa, sen de öyle yap ve ihramdan çık. Ertesi sene hac zamanı gelince tekrar haccet ve kolayına gelenden bir de kurban kes» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 459
			}
		},
		{
			"hadithnumber": 460,
			"arabicnumber": 460,
			"text": "Abdullah b. Ömer anlatıyor: Halk sabah namazında Kuba mescidinde iken biri gelerek: «— Bu gece Resulullah Sallallahu Aleyhi ve Sellem'e bir ayet gelmiş, bundan sonra Ka*be'ye dönmesi emredilmiş, siz de oraya yönelin dedi. O sırada Şam'a (Kudüs'e) yönelmişlerdir. Bunun üzerine hemen yönlerini Kabe'ye doğru döndüler. Diğer tahric: Buharî, Salat; Müslim, Mesacid; Şafiî, Risale, no: 365",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 460
			}
		},
		{
			"hadithnumber": 461,
			"arabicnumber": 461,
			"text": "Saîd b. Müseyyeb'den: Resulullah Sallallahu Aleyhi ve Sellem, Medine'ye hicret ettikten sonra altı ay kadar namazı Beytü'l-Makdis'e (Kudüs'e) doğru dönerek kıldı. Daha sonra Bedir harbinden iki ay kadar ön­ce kıble Ka'beye çevrildi. et-Temhîd'de denir ki: Muvatta'da mürseldir. el-Bera' hadisiyle manaca müsned gelmiştir. Buharî, Salat; Müslim, Mesacid; Şafiî, Risale, no: 366",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 461
			}
		},
		{
			"hadithnumber": 462,
			"arabicnumber": 462,
			"text": "Ömer b. Hattab'dan: «Yüzünü Beytullah'a karşı dönmek şartıyla doğu ile batı arası hep kıbledir.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 462
			}
		},
		{
			"hadithnumber": 463,
			"arabicnumber": 463,
			"text": "Ebu Hureyre r.a.'den: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: «Benim bu mescidimde kılınan bir rekat namaz, Mescid-i Haram hariç diğer bütün mescitlerde kılınan bin rekat namazdan daha efdaldir. Diğer tahric: Buharî, Salat fî Mescidi Mekke ve'l-Medîne; Müslim, Hacc",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 463
			}
		},
		{
			"hadithnumber": 464,
			"arabicnumber": 464,
			"text": "Ebu Hureyre r.a.'den veya Ebu Saîd el-Hudrî'den: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: «Evimle minberim arası cennet bahçelerinden bir bahçedir. Minberim ise Havz'ımın üzerindedir.» İbn Abdilber der ki: \"Muvatta ravileri, bu şekilde ravi adını şüpheli olarak rivayet etmişlerdir.\" Buhari (Salat fî Mescidi Mekke ve'l-medîne) ve Müslim Hacc); Ebu Hureyre'den rivayet etmişlerdir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 464
			}
		},
		{
			"hadithnumber": 465,
			"arabicnumber": 465,
			"text": "Abdullah b. Zeyd el-Mazini'den: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: «Evimle minberimin arası, cennet bahçelerinden bir bahçedir,» Diğer tahric: Buharî, Salat fî Mescidi Mekke ve'1-Medîne, 20/5; Müslim, Hacc, 15/501",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 465
			}
		},
		{
			"hadithnumber": 466,
			"arabicnumber": 466,
			"text": "Abdullah b. Ömer'den: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: «Allah'ın cariyelerinin, Allah'ın mescitlerine gitmelerine engel olmayınız.» Diğer tahric: Buharî, Cum'a; Müslim, Salat Mahir: Erkek: köle, kadın Cariye olduğuna ve köle'nin diğer söylenişi 'kul' olduğuna göre Allah'ın kadın kullarına Allah'ın Cariyeleri denir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 466
			}
		},
		{
			"hadithnumber": 467,
			"arabicnumber": 467,
			"text": "Busr b. Saîd'den: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: «Bir kadın yatsı namazına giderken güzel kokular sürünmesin.» Bu, mürseldir. Abdullah'ın zevcesi Zeyneb r.anha, mevsul yapmıştır. Müslim, Salat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 467
			}
		},
		{
			"hadithnumber": 468,
			"arabicnumber": 468,
			"text": "Amr b. Nufeyl'in Zeyd'den olan torunu Ömer b. Hattab'ın hanımı Atike'den: Ömer b. Hattab'dan mescide gitmek için izin istedim. Hiç cevap vermeden sustu. Ben kendi kendime: «Vallahi gitme deyinceye kadar gideceğim.» dedim. O da «gitme» demedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 468
			}
		},
		{
			"hadithnumber": 469,
			"arabicnumber": 469,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 469
			}
		}
	]
}