{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"21": "Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 959,
			"arabicnumber": 959,
			"text": "İmâm-ı Mâlik der ki: Kısmen hür, kısmen köle olan bir kişinin şahsi malı kendi yanında muhafaza edilir. Ancak bu maldan yemesine ve giymesine harcıyabilir. Bu köle ölürse, malı kısmen kölesi olduğu efendisine kalır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 959
			}
		},
		{
			"hadithnumber": 960,
			"arabicnumber": 960,
			"text": "İmâm-ı Mâlik der ki: Bizce hüküm şöyledir. Baba isterse çocuğunun malı da varsa, malı olduğu günden itibaren çocuğa harcadığı nakit veya eşyayı hesap eder (ve malından alabilir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 960
			}
		},
		{
			"hadithnumber": 961,
			"arabicnumber": 961,
			"text": "İmâm-ı Mâlik der ki: Bizce kölelerin işlemiş olduğu suçlarda şöyle amel edilir: Köle birini yaralamış veya bir şeyi gizlice almış veya muhafaza altında olan bir şeyi çalmış veya dalda asılı bir meyvayı koparmış veya hasar vermiş veya elinin kesilmesini gerektirmeyen bir hırsızlık yapmışsa, bütün bunlarda ceza olarak kölenin kendisi alınır, bundan daha ileriye gidilmez. Yapmış olduğu suç az olsun, çok olsun. Yalnız kölenin efendisi, kölesinin aldığı veya hasar verdiği şeyin kıymetini veya yaraladığı şeyin diyetini vermek isterse verebilir. Kölesi kendinde kalır. Kölenin kendisini vermek isterse verebilir. Bunun dışında efendinin bir şey vermesi gerekmez. Bu konuda efendi muhayyerdir, dilediği yolu seçer",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 961
			}
		},
		{
			"hadithnumber": 962,
			"arabicnumber": 962,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 962
			}
		},
		{
			"hadithnumber": 963,
			"arabicnumber": 963,
			"text": "Said b. el-Müseyyeb'den: Osman b. Affan (radıyallahü anh) şöyle dedi: Bir kimse kendisine yapılan bağışa sahip olacak çağa gelmemiş küçük oğluna bir bağışta bulunur, bunu duyurur, şahitlerle pekiştirirse, bu bağış, babasının gözetiminde ise geçerlidir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 963
			}
		},
		{
			"hadithnumber": 964,
			"arabicnumber": 964,
			"text": "İmâm-ı Mâlik der ki: Bir kimse küçük oğluna altın ya da gümüş bağışladıktan sonra —bağışladığı henüz kendi elindeyken— ölse, çocuk bundan birşey alamaz. Ancak babası bu bağışı tayin ederek ayırır veya onu oğlu adına başka birinin yanına koyarsa bu bağış oğlu için geçerlidir; oğlunun olur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 964
			}
		},
		{
			"hadithnumber": 965,
			"arabicnumber": 965,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 965
			}
		},
		{
			"hadithnumber": 966,
			"arabicnumber": 966,
			"text": "Abdullah b. Ömer (radıyallahü anh)'den: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: «Bir köledeki hissesini azat eden kimsenin kölenin geri kalan hisselerini azat edebilecek miktara ulaşan malı varsa, köleye adil bir şekilde değer biçilir, diğer ortakların hisselerine düşen parayı verir ve köle azat olunur. O kimsenin malı yoksa, kendi hissesiyle ilgili yaptığı azat geçerlidir.» Buhârî, Itk, 49/4; Müslim, Itk, 20, no:1",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 966
			}
		},
		{
			"hadithnumber": 967,
			"arabicnumber": 967,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 967
			}
		},
		{
			"hadithnumber": 968,
			"arabicnumber": 968,
			"text": "İmâm-ı Mâlik der ki: Bizce ittifakla amel şöyledir: Efendi, ölümünden sonra köledeki üçte bir veya dörtte bir veya yarı ya da her hangi bir hissesini azat etmiş olsun, ancak bu kölenin efendinin beyan edip azat ettiği hisse kadarı azat olur. Bu hüküm, o hissenin azadının vacip olması, efendinin ölümünden sonra yürürlüğe girmesi ve efendinin de yaşadığı müddetçe muhayyer olması sebebiyledir. Kölenin azat olması, vasiyet eden efendi adına gerçekleşirse, efendinin malından (ölünce) aldığı kadarı azat olur. Geri kalan azat olmaz. Çünkü efendinin malı, başkalarının olur. Azat edilmeyen kısmı başkaları adına nasıl azat olur!? Kölenin bir kısmını azat eden onlar olmadığı gibi, velası da kendilerine ait değildir. Azat eden, ölen şahısdır. Vela da onun hakkıdır. Bu, başkalarının malına yüklenemez. Ancak Efendi kölenin geri kalan kısmının malından azat olmasını vasiyet etmiş ise, bu vasiyet hem vereseleri, hem de diğer ortakları bağlayıcıdır. Ortakların bunu kabul etmeme hakları yoktur. Bu vasiyet ölenin üçte bir malında geçerlidir. Çünkü üçte bir malda vereselere bir zarar yoktur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 968
			}
		},
		{
			"hadithnumber": 969,
			"arabicnumber": 969,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 969
			}
		},
		{
			"hadithnumber": 970,
			"arabicnumber": 970,
			"text": "İmâm-ı Mâlik der ki; Bir kimse hasta iken kölesinin üçte birini o anda kesin olarak azat etse, malının üçte birinden kölenin tamamı azat olur. Çünkü hasta iken kesin olarak kölesinin üçte birini azat edenle, (vasiyet yoluyla) ölümünden sonra kölesinin üçte birini azat eden kişi arasında fark vardır. Ölümünden sonra kölesinin üçte birini azat eden yaşasa, azat etmeden vazgeçebilir ve azat yürürlükten kalkar. Ama hastalığında kölesinin üçte birini kesin olarak azat eden efendi yaşasa, kölenin tamamı kendi adına azat olur. Ölünce de malının üçte birinden azat olur. Çünkü sağlığında beyanı, malının tamamında geçerli olduğu gibi, ölümünde de beyanı malının üçte birinde geçerlidir. Şeybanî, 840",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 970
			}
		},
		{
			"hadithnumber": 971,
			"arabicnumber": 971,
			"text": "İbn Şihab der ki: Köle azat edilince, malı da kendinin olur. Tatbikat böyledir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 971
			}
		},
		{
			"hadithnumber": 972,
			"arabicnumber": 972,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 972
			}
		},
		{
			"hadithnumber": 973,
			"arabicnumber": 973,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 973
			}
		},
		{
			"hadithnumber": 974,
			"arabicnumber": 974,
			"text": "Rabia b. Ebi Abdurrahman'dan: Ebân b. Osman'ın valiliğinde bir adam, kölelerin hepsini azat etti. Bunlardan başka malı da yoktu. Ebân'ın emri üzerine, bu köleler üç bölük yapıldı. Hangi gurubun ölenin malının üçte biri sayılıp azat olacağını öğrenmek için kura çektirdi. Bu üç bölükten birine kura isabet etti ve kuranın isabet ettiği köleler hürriyetlerine kavuştu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 974
			}
		},
		{
			"hadithnumber": 975,
			"arabicnumber": 975,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 975
			}
		},
		{
			"hadithnumber": 976,
			"arabicnumber": 976,
			"text": "Abdullah b. Ömer (radıyallahü anh)'den: Ömer b. el-Hattab şöyle dedi: «Bir cariye efendisinden çocuk doğurursa, efendisi onu satamaz, bağışlayamaz ve ona miras bırakamaz. Ondan faydalanır. Efendi ölünce cariye hür olur.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 976
			}
		},
		{
			"hadithnumber": 977,
			"arabicnumber": 977,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 977
			}
		},
		{
			"hadithnumber": 978,
			"arabicnumber": 978,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 978
			}
		},
		{
			"hadithnumber": 979,
			"arabicnumber": 979,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 979
			}
		},
		{
			"hadithnumber": 980,
			"arabicnumber": 980,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 980
			}
		},
		{
			"hadithnumber": 981,
			"arabicnumber": 981,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 981
			}
		},
		{
			"hadithnumber": 982,
			"arabicnumber": 982,
			"text": "İmâm-ı Mâlik'e şöyle Rivâyet edildi: Ensardan Fedâle b. Ubeyd (radıyallahü anh) Resûlüllah (sallallahü aleyhi ve sellem)'in ashabındandı. Ona: «Bir köle azat etmesi gereken bir şahıs, zinadan doğan bir çocuğu azat etse caiz midir?» diye soruldu. O da: Evet, caizdir» diye cevap verdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 982
			}
		},
		{
			"hadithnumber": 983,
			"arabicnumber": 983,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 983
			}
		},
		{
			"hadithnumber": 984,
			"arabicnumber": 984,
			"text": "İmâm-ı Mâlik'e şöyle Rivâyet olundu: Abdullah b. Ömer (radıyallahü anh)'e «Bir köle azat etmesi gereken bir adam, azat edeceğini şart koşarak köle satın alabilir mi?» diye soruldu. O da: Hayır» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 984
			}
		},
		{
			"hadithnumber": 985,
			"arabicnumber": 985,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 985
			}
		},
		{
			"hadithnumber": 986,
			"arabicnumber": 986,
			"text": "İmâm-ı Mâlik der ki: Azat edilmesi gereken köleler konusunda duyduklarımın en güzeli şudur: Bir köle azat etmesi gereken bir kimse azat edeceğini şart koşarak satın alamaz. Çünkü bunu yapması halinde azat ettiği tam bir köle sayılmaz. Zira satıcı, azat edeceğini şart koşan kişiye düşük fiattan verir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 986
			}
		},
		{
			"hadithnumber": 987,
			"arabicnumber": 987,
			"text": "İmâm-ı Mâlik der ki: Nafile olarak bir köle azat edecek olan bir kişinin azat edeceğini şart koşarak bir köle satın almasında bir mahzur yoktur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 987
			}
		},
		{
			"hadithnumber": 988,
			"arabicnumber": 988,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 988
			}
		},
		{
			"hadithnumber": 989,
			"arabicnumber": 989,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 989
			}
		},
		{
			"hadithnumber": 990,
			"arabicnumber": 990,
			"text": "İmâm-ı Mâlik der ki: Mutlaka azat edilmesi gereken köleler hakkında duyulanların en güzeli şudur: Böyle bir köleye bedel hıristiyan bir köle veya yahudi bir köle azat etmek caiz değildir. Aynı şekilde mukatep (bedelli azat sözleşmesi yapmış köle), mudebber (efendinin ölümünde azad olacak köle) , Ümmü Veled (efendisinden çocuk doğuran köle), bir müddete kadar azat edilmiş köle ve kör köleyi de azat edilmesi gereken kölenin yerine azat etmek caiz değildir. Nafile olarak bir köle azat etmek istenirse Hıristiyan, Yahudi ve Mecusi köle azat edilebilir. Çünkü yüce Allah kitabı Kur'an-ı Kerim'de şöyle buyurmuştur. (Ya fidye almadan serbest bırakın, ya da fidye alarak) Muhammed sûresi, 4. âyet",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 990
			}
		},
		{
			"hadithnumber": 991,
			"arabicnumber": 991,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 991
			}
		},
		{
			"hadithnumber": 992,
			"arabicnumber": 992,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 992
			}
		},
		{
			"hadithnumber": 993,
			"arabicnumber": 993,
			"text": "Abdurrahman b. Ebi Amre el-Ensari şöyle dedi: Annem bir vasiyet etmek istedi, sonra sabaha bıraktı ve öldü. Köle azat etmeye niyetlenmişti. b. Muhammed (radıyallahü anh)'e: Annemin yerine köle azat etsem ona faydası olur mu?» dedim. Kasım b. Muhammed (radıyallahü anh) şöyle dedi: Sa'd b. Ubade (radıyallahü anh), Resûlüllah (sallallahü aleyhi ve sellem)'a: Annem öldü onun adına köle azat etmenin ona yararı olur mu?» diye sordu. (sallallahü aleyhi ve sellem): Evet» diye cevap verdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 993
			}
		},
		{
			"hadithnumber": 994,
			"arabicnumber": 994,
			"text": "Yahya b. Said dedi ki: Bir gün Ebû Bekir'in oğlu uyurken öldü. Onun adına Hazret-i Peygamber'in hanımı Hazret-i Aişe bir çok köle azat etti. Mâlik der ki: Bu konuda duyduğumun en güzeli budur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 994
			}
		},
		{
			"hadithnumber": 995,
			"arabicnumber": 995,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 995
			}
		},
		{
			"hadithnumber": 996,
			"arabicnumber": 996,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 996
			}
		},
		{
			"hadithnumber": 997,
			"arabicnumber": 997,
			"text": "Hişam b. Urve babasından şöyle Rivâyet etti: Hazret-i Aişe dedi ki: Bana, Berire adlı cariye gelerek: Ben efendimle mukatebe anlaşması yaptım. Her sene bir ûkıye Ukiye: 12 dirhem (memleketlere göre değişen ağırlık ölçüsü). olmak üzere toplam dokuz ukiye vereceğim. Bana yardım et» deyince, ona şöyle dedim; Velân Velâ: azat eden efendi ile azat ettiği kölesi arasındaki bir akrabalık bağı olup, köle hürriyetlerine kavuştuktan sonra kendi varisleri olmadan ölürse mirası efendisine ya da varislerine kalır. bana ait olmak şartıyla, efendilerin senin yerine benim peşin olarak vermeme razı olurlarsa, derhal verir (ve seni azat eder)im» Bunun üzerine Berire, efendilerinin yanına gitti. Onların yanından dönünce bana şöyle dedi. Resûlüllah (sallallahü aleyhi ve sellem) da yanımda oturuyordu: Bana söylediğini efendilerime anlattım. Velâ kendilerine ait olmaksızın teklifini kabul etmediler. (sallallahü aleyhi ve sellem) konuşmamızı duydu ve meseleyi sordu. Ben de kendilerine, olanları genişçe anlattım. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) bana şöyle dedi: O cariyeyi satın al, alırken de velânın kendilerine ait olmasını şart koş. Nasıl olsa velâ azat edenindir.» de öyle yaptım. Sonra Resûlüllah (sallallahü aleyhi ve sellem) Cemaatin içersinde ayağa kalkarak Allah'a hamdü sena etti, şöyle buyurdu: «Ne oluyor bazı kişilere! Allah'ın kitabında olmayan şartları ileri sürüyorlar? Allah'ın kitabında olmayan şart yüz tane de olsa hükümsüzdür. Allah'ın koyduğu hüküm uyulmaya daha lâyıktır. Allah'ın koyduğu şart daha güvenilirdir. Velâ, sadece azat edene aittir,» Buharî, Buyu, 34/73; Müslim, Itk, 20/2, no:8",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 997
			}
		},
		{
			"hadithnumber": 998,
			"arabicnumber": 998,
			"text": "Abdullah b. Ömer (radıyallahü anh)'den: Resûlüllah (sallallahü aleyhi ve sellem), velâyı satmayı ve bağışlamayı yasak etti. Buharî, Itk, 49/10; Müslim, Itk, 20/3. no:16",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 998
			}
		},
		{
			"hadithnumber": 999,
			"arabicnumber": 999,
			"text": "Rebîa b. Abdurrahman (radıyallahü anh)'dan: Zübeyr b. Avvam bir köle satın alarak azat etti. Bu kölenin hür bir kadından olma erkek çocukları vardı. Zübeyr köleyi azat edince: Çocukların veîâsı bana aittir» dedi. Çocukların annesini daha önce azat eden efendiler: Hayır onların velâsı bize ait» dediler. Hazret-i Osman b. Affan (radıyallahü anh)'a götürdüler. O da çocukların velâlarının Hazret-i Zübeyr'e ait olduğuna hükmetti",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 999
			}
		},
		{
			"hadithnumber": 1000,
			"arabicnumber": 1000,
			"text": "İmâm-ı Mâlik'e şöyle Rivâyet edildi: Said b. el-Müseyyeb (radıyallahü anh)'e: «Hür bir kadından doğma çocukları olan kölenin çocuklarının velâsı kime aittir?» diye soruldu. Said (radıyallahü anh) de şöyle cevap verdi: «Çocukların babası azat edilmeden köle olarak ölürse, çocukların velâsı annelerini daha önce azat eden efendilere aittir.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1000
			}
		},
		{
			"hadithnumber": 1001,
			"arabicnumber": 1001,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1001
			}
		},
		{
			"hadithnumber": 1002,
			"arabicnumber": 1002,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1002
			}
		},
		{
			"hadithnumber": 1003,
			"arabicnumber": 1003,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1003
			}
		},
		{
			"hadithnumber": 1004,
			"arabicnumber": 1004,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1004
			}
		},
		{
			"hadithnumber": 1005,
			"arabicnumber": 1005,
			"text": "Ebû Musa el-Eşari (radıyallahü anh)'den: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: «Tavla oynayan kimse Allah'a ve Resulüne âsî olmuş olur.» Ebu Davud, Edeb, 40/56. Hakim der ki: Buhârî ve Müslim'in şartları üzere sahihtir. Zehrebî de bunu kabul etmiştir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1005
			}
		},
		{
			"hadithnumber": 1006,
			"arabicnumber": 1006,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1006
			}
		},
		{
			"hadithnumber": 1007,
			"arabicnumber": 1007,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1007
			}
		},
		{
			"hadithnumber": 1008,
			"arabicnumber": 1008,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1008
			}
		}
	]
}