{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"22": "Vows and Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1009,
			"arabicnumber": 1009,
			"text": "Abdullah b. Abbas'dan: Sa'd b. Ubade, Resulullah Sallallahu Aleyhi ve Sellem'den fetva isteyerek; «— Annem nezir borcu varken vefat etti, adağını yerine getiremedi.» dedi. Resulullah Sallallahu Aleyhi ve Sellem da; «— Öyleyse onun yerine adağını sen yerine getir»» buyurdu. Diğer tahric: Buhari, Vesaya; Müslim, Nezr",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1009
			}
		},
		{
			"hadithnumber": 1010,
			"arabicnumber": 1010,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1010
			}
		},
		{
			"hadithnumber": 1011,
			"arabicnumber": 1011,
			"text": "Abdullah b. Ebî Habibe'den: Henüz gençtim. Bir adama: «— Beytullah'a kadar yürüyeceğim, desem de Beytullah'a kadar yürümek bana nezir olsun demesem ne lazım gelir?» diye sordum. Adamın biri de bana elindeki küçük bir salatalığı göstererek: «— Beytullah'a kadar yürüyeceğim dersen bunu sana vereceğim» dedi. Ben de: «— Evet, Beytullah'a kadar yürüyeceğim» dedim. Henüz o zamanlar gençtim. Biraz bekledikten sonra durumu anladım. Bana: «—Yürümen lazım» denildi. Ben hemen Said b. Müseyyeb'e gelerek durumu arzettim, o da bana: «— Yürümen lazım.» deyince, ben de yürüdüm. İmam Malik der ki: Bu konuda durum biz Medine'liler ara­sında da aynıdır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1011
			}
		},
		{
			"hadithnumber": 1012,
			"arabicnumber": 1012,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1012
			}
		},
		{
			"hadithnumber": 1014,
			"arabicnumber": 1014,
			"text": "İmâm-ı Mâlik der ki: Köleleri kendilerinden önce müslüman olan, Yahudi ve Hıristiyanın müslüman çocuğu bu köleye varis olur. Şayet köleleri (kendilerinden sonra), azad edilirken müslüman olmuş ise, daha önce müslüman olan Yahudi ve Hıristiyan bir kişinin çocuğunun bu müslüman kölenin velâsından hiçbir hakkı yoktur. Çünkü ne Yahudi ne de Hıristiyanın velâ hakkı olmaz. Bu müslüman kölenin velâsı, müslüman cemaate aittir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1014
			}
		},
		{
			"hadithnumber": 1015,
			"arabicnumber": 1015,
			"text": "Nafi'den: Abdullah b. Ömer şöyle derdi: Mükateb, yapmış olduğu mükatebe Kitabet, kölenin, efendisi ile anlaşarak azat bedelini ödeyince hür olmak üzere azat bedelini kazanması için serbest bırakılmasıdır. Mükateb, efendisi ile arasında kitabet akdi olan köleye denir. Köle, çalışıp kazanarak azat bedelini efendisine getirdiği zaman Kür olur. Mükateb, kazancına efendisinin sahip oluşu dışında, köle hükümlerine tabidir. anlaşmasından üzerinde bir miktar borç kaldıkça köledir. Amr b. Şuayb -babası- dedesi senediyle merfu olarak gelmiştir. Ebu Davud, Itk, 28/1; İbn Mace, Itk, 19/3; Şeybanî, 857",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1015
			}
		},
		{
			"hadithnumber": 1016,
			"arabicnumber": 1016,
			"text": "Kasım b. Muhammed'den: Abdullah b. Abbas'a bir kadın gelerek: «— Oğlumu kurban kesmeyi nezrettim» dedi. îbn Abbas: «— Oğlunu kesme, yemin kefareti ver.» dedi. Bu sırada İbn Abbas'ın yanında oturan bir ihtiyar söze karışarak: «— Bu konuda kefaret nasıl olur?» dedi. İbn Abbas da: «— Zıhar yapan gibi öder» diyerek şu ayeti kerimeyi okudu: «içinizden zıhar yapanların karıları onların anaları değildir. Anaları kendilerini doğuranlardan başkası de­ğildir... Kadınlarından zıhar ile ayrılmak isteyip de sonra sözlerini geri alanlar birbirleriyle temas etmeden Önce bir köle azat etmeleri gerekir. İşte size bununla Öğüt veriliyor. Allah, ne yaparsanız hakkıyla haberdardır. Fakat kim (bunu) bulamazsa yine birbirleriyle temas etmeden önce aralıksız iki ay oruç (tutsun). Buna da güç yetiremezse, alt­mış yoksul doyursun.»[Mücadele 2-4]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1016
			}
		},
		{
			"hadithnumber": 1017,
			"arabicnumber": 1017,
			"text": "Hz. Aişe, Resulullah Sallallahu Aleyhi ve Sellem'ın şöyle buyurduğunu naklediyor: «Kim Allah'a itaat etmeye nezrederse ona itaat etsin, kim de Allah'a isyana nezir ederse Allah'a asi olmasın.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1017
			}
		},
		{
			"hadithnumber": 1018,
			"arabicnumber": 1018,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1018
			}
		},
		{
			"hadithnumber": 1019,
			"arabicnumber": 1019,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1019
			}
		},
		{
			"hadithnumber": 1020,
			"arabicnumber": 1020,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1020
			}
		},
		{
			"hadithnumber": 1021,
			"arabicnumber": 1021,
			"text": "Abdullah b. Ömer'den: Bir kimse yemini tevkid yapar (bir şey hakkında defalarca yemin eder), sonra da yeminini bozarsa, ya bir köle azad eder, ya da on fakiri giydirir. Kim tevkidsiz yemin ederse, sonra da yeminini bozarsa on fakiri doyurması lazımdır. Her fakire bir müd buğday verilir. Eğer bunu bulamazsa üç gün oruç tutar",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1021
			}
		},
		{
			"hadithnumber": 1022,
			"arabicnumber": 1022,
			"text": "Nafî', Abdullah b. Ömer'in yemin kefareti olarak her fakire birer müd buğday vermek suretiyle on fakiri de doyurduğunu, yemin-i tevkid yaparsa birkaç tane köle azad ettiğini nakleder",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1022
			}
		},
		{
			"hadithnumber": 1023,
			"arabicnumber": 1023,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1023
			}
		},
		{
			"hadithnumber": 1024,
			"arabicnumber": 1024,
			"text": "Abdullah b. Ömer'den: Resulullah Sallallahu Aleyhi ve Sellem, Ömer b. Hattab'a bir binek üzerinde babası adına yemin ederken yetişti. «Babalarınız adına yemin etmenizi Allah yasakladı. Kim yemin ederse Allah adına yemin etsin, ya da sussun» buyurdu. Diğer tahric: Buhari, Eyman ve'n-Nuzur; Müslim, Eyman",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1024
			}
		},
		{
			"hadithnumber": 1025,
			"arabicnumber": 1025,
			"text": "İmanı Malik'ten: Resulullah Sallallahu Aleyhi ve Sellem şöyle yemin etti: «Hayır! Kalbleri çeviren Allah'a yemin ederim.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1025
			}
		},
		{
			"hadithnumber": 1026,
			"arabicnumber": 1026,
			"text": "İbn Şihab'dan: Bana gelen rivayetlere göre Ebu Lübabe b. Abdulmünzir'in tevbesini Allah kabul ettiği zaman Nebi s.a.v.'e gelerek: «— Ya Resulallah! Günaha duçar olduğum kabilemin ülkesinden hicret ediyorum, sana komşu olacağım. Allah ve Resulü uğruna mallarımın hepsini tasadduk ederek onlardan vazgeçiyorum» dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem ona: «— Hepsini değil de üçte birini tasadduk etmen yeterlidir» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1026
			}
		},
		{
			"hadithnumber": 1027,
			"arabicnumber": 1027,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1027
			}
		}
	]
}