{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"27": "Fara'id"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1074,
			"arabicnumber": 1074,
			"text": "Yahya b. Said'e rivayet edildiğine göre Ebu Süfyan oğlu Mu-aviye, Zeyd b. Sabit'e mektup yazarak dedenin mirasdaki payını sordu. Zeyd b. Sabit de ona şöyle cevap yazdı: «Bana yazdığın mektupta benden dedenin mirasını soruyor­sun. En doğrusunu Allah bilir. Bu mesele, Halifelere kadar hakkında hüküm verilmemiş bir meseledir. Senden önce iki halifenin yanında bulundum. Onlar bir erkek kardeşle bulunursa dedeye terekenin yarısını, iki erkek kardeşle bulunursa üçte birini veriyorlardı. Kardeşler daha fazla olurlarsa, dedenin üçte bir hissesi­ni azaltmıyorlardı.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1074
			}
		},
		{
			"hadithnumber": 1075,
			"arabicnumber": 1075,
			"text": "Züeyb oğlu Kabîsa'dan şöyle rivayet edildi: Ömer b. el-Hattab, dedeye bugün müslümanlarm vermekte olduğu hisseyi verirdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1075
			}
		},
		{
			"hadithnumber": 1076,
			"arabicnumber": 1076,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1076
			}
		},
		{
			"hadithnumber": 1077,
			"arabicnumber": 1077,
			"text": "Züeyb oğlu Kabîsa (r.a.) der ki: Bir nine (ananın anası) alacağı mirası sormak amacıyla Ebu Bekir es-Sıddîk (r.a.)'a geldi. Ebu Bekir (r.a.) ona şöyle cevap verdi: «— Senin hakkında Allah'ın kitabında hiçbir hüküm bulun­mamaktadır. Resulullah'm sünnetinde de herhangi bir şey olup olmadığını bilmiyorum. Sen evine dön. Ben bu meseleyi müslü-manlara sorayım da, öyle sana cevap vereyim.» Ebu Bekir müslümanlara sorunca, Mugîre b. Şu'be ona şöyle dedi: «— Ben Resulullah (s.a.v.)'ın yanında bulundum, nineye altıda bir verdi.» Ebu Bekir: «—Yanında başkaları var mıydı?» diye sorunca Muhammed b. Mesleme el-Ensarî de kalkarak Muğire'ninkine benzer bir ko­nuşma yaptı. Bunun üzerine Ebu Bekir es-Sıddık da nineye bunu uyguladı. Sonra öbür nine (babanın annesi) mirasını sormak maksadiyle Hz.Ömer'e geldi. Bunun üzerine Ömer (r.a.) ona şöyle dedi: «— Senin hakkında Allah'ın kitabında bir hüküm bulunma­maktadır. Şimdiye kadar verilmiş olan hükümler içerisinde de se­nin meselen yok. Bana gelince ben feraize (miras paylarına) kendimden birşey ilave edecek değilim. Fakat bu miras, annenin annesine verilen şu altıda bir olması gerekir. Her ikiniz birlikte varis olduğunuzda, bu altıda bir hisseyi taksim edersiniz. Hanginiz yal­nız başına varis oluyorsa, bu altıda birin tamamını alır. Diğer tahric: Ebu Davud, Feraid; Tirmizî, Feraid; tbn Mace, Feraid",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1077
			}
		},
		{
			"hadithnumber": 1078,
			"arabicnumber": 1078,
			"text": "Kasım b. Muhammed der ki: iki nine mirasları konusunda Ebu Bekir es-Sıddîk'a baş vur­duklarında, Ebu Bekir altıda bir hisseyi annenin annesine ver­mek isteyince ensardan bir zat ona şöyle dedi: «— Dikkat et. Senin mirastan mahrum etmek istediğin nine ölmüş, miras bırakan sağ kalmış olsaydı nineye varis olacaktı.» Bu söz üzerine Hz. Ebu Bekir, altıda bir hisseyi iki nine ara­sında taksim etti",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1078
			}
		},
		{
			"hadithnumber": 1079,
			"arabicnumber": 1079,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1079
			}
		},
		{
			"hadithnumber": 1080,
			"arabicnumber": 1080,
			"text": "Zeyd b. Eslem der ki: Ömer b. el-Hattab, Resulullah Sallallahu Aleyhi ve Sellem'e kelale'nin (mirasçısız ölenin) mirasım sordu. Resulullah Sallallahu Aleyhi ve Sellem de şöyle cevap verdi: «— Sana bu konuda, yazın indirilen Nisa suresinin son ayeti yeterlidir.» Diğer tahric: Müslim, Feraid",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1080
			}
		},
		{
			"hadithnumber": 1081,
			"arabicnumber": 1081,
			"text": "ibn Mirsa (r.a.) der ki: Ben, Ömer b. el-Hattab (r.a.)'ın yanında oturuyordum. Öğle namazını kılınca şöyle dedi: «— Ya Yerfa! Şu yazıyı getir.» Hz. Ömer, bu sözü hala hakkın­da yazmış olduğu yazı için söyledi: Biz de halanın mirası hakkında soru soruyor ve öğrenmek istiyorduk. Yerfa yazıyı Hz. Ömer'e getirince içinde su bulunan bir testi (veya bir bardak) istedi ve bu yazıyı bu suyla sildi, sonra şöyle dedi: «— Senin varis olmana Allah razı olsaydı varis olduğunu belirtirdi. Evet, Allah senin varis olmana razı olsaydı, hiç kuşku­suz varis olduğunu belirtirdi.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1081
			}
		},
		{
			"hadithnumber": 1082,
			"arabicnumber": 1082,
			"text": "Ebu Bekir b. Hazm der ki: Ömer b. el-Hattab: «Hala'nın durumu hayrete değer. Zira varis olmadığı halde kendisine varis olunuyor.» derdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1082
			}
		},
		{
			"hadithnumber": 1083,
			"arabicnumber": 1083,
			"text": "Usame b. Zeyd (r.a.) der ki: Resulullah (s.a.v.): «Müslüman kafire varis olamaz» buyurdu. Diğer tahric: Müslim, Feraid",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1083
			}
		},
		{
			"hadithnumber": 1084,
			"arabicnumber": 1084,
			"text": "Ali b. Ebî Talib, îbn Şihab'a şöyle haber verdi: Ebu Talib'e sadece Akıl ve Talib varis oldular. Ben varis olmadım. Hz. Ali (r.a.) şöyle dedi: «—Bundan dolayı Şı'b denilen evdeki hissemizi almadık.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1084
			}
		},
		{
			"hadithnumber": 1085,
			"arabicnumber": 1085,
			"text": "Muhammed b. el-Eş'as, Süleyman b. Yesar'a şöyle rivayet etti: Yahudi halam öldü. Ben de bu durumu Ömer b. el-Hattab'a anlatarak şöyle dedim: «— Ona kim varis olacak?» Hz. Ömer (r.a.) şöyle cevap verdi: «— Ona kendi dininden olanlar varis olur.» Sonra Osman b. Affan'a gelerek konuyu ona da sorunca, o da bana şöyle cevap verdi: «— Ömer b. Hattab'ın sana söylediğini unuttuğumu mu sanıyorsun? Ona kendi dininden olanlar varis olurlar.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1085
			}
		},
		{
			"hadithnumber": 1086,
			"arabicnumber": 1086,
			"text": "İsmail b. Ebî Hakem der ki: Ömer b. Abdülaziz'in azat ettiği bir hıristiyan öldü. Ömer b. Abdülaziz malını hazineye koymamı bana emretti",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1086
			}
		},
		{
			"hadithnumber": 1087,
			"arabicnumber": 1087,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1087
			}
		},
		{
			"hadithnumber": 1088,
			"arabicnumber": 1088,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1088
			}
		},
		{
			"hadithnumber": 1089,
			"arabicnumber": 1089,
			"text": "İmam Malik'e şöyle rivayet edildi: Urve b. Zübeyr, anne ve babası mülaane yoluyla boşanmış çocuk ile zinadan doğma çocukların mirası hakkında şöyle derdi: Bu çocuklar öldüklerinde anneleri azatlı cariye idiyseler, an­neleri ile anne bir kardeşler, Yüce Allah'ın kitabında belirlediği haklarına varis olurlar. Geri kalan mala da, annesini azat eden efendileri varis olurlar. Şayet anneleri hürse anneleri haklarını, ana bir kardeşleri de haklarını alırlar. Geri kalan da müslümanla-rın (hazinenin) olur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1089
			}
		}
	]
}