{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"28": "Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1091,
			"arabicnumber": 1091,
			"text": "Ebu Hureyre (r.a.)'den: Resulullah Sallallahu Aleyhi ve Sellem: «Hiçbiriniz, (müslüman) kardeşinin evlilik teklif ettiği kadına evlilik teklif etmez» buyurdu. Diğer tahric: Buhari, Nikah; Şafiî, Risale, no: 847",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1091
			}
		},
		{
			"hadithnumber": 1092,
			"arabicnumber": 1092,
			"text": "İmâm-ı Mâlik der ki: Hamile bir kadın, bir erkek veya kadını kasden öldürse, buna doğum yapıncaya kadar kısas cezası uygulanmaz. Kasden veya hataen öldürülen kadın hamile olsa, öldüren kadının ceninine bir şey gerekmez. Şayet kadın kasden öldürülmüş ise, onu öldüren kadın kısasen öldürülür. Cenine diyet gerekmez. Şayet hataen öldürülmüşse, diyetini onu öldüren kadının akılesi öder. Cenine diyet gerekmez",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1092
			}
		},
		{
			"hadithnumber": 1093,
			"arabicnumber": 1093,
			"text": "Abdurrahman b. Kasım, babasından rivayeten Allah Teala'nm (kocası öien ve bekleme müddetinde olan kadınlar hakkında) «(Bu müddeti bekleyen) kadınlara kinaye ile hissettirmenizde veya onları almak için içinizde bir arzu beslemenizde günah yoktur. Allah sizin onları anacağınızı biliyor. Lakin onlara gizli vaadlerde bulunmayın. Ancak on­lara meşru ve örfe uygun şeyler söyleyin» [Bakara, 235] kavli şerifinin tef­sirinde der ki: Böyle bir kadınla evlenmek isteyen kimse ona ölen kocasının vefatından sonra bekleme müddetinde iken «Benim yanımda sen çok kıymetlisin. Gerçekten sana yakınlık duyuyorum. Allah sana mal ve bol rızık verecek» gibi sözler söyleyebilir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1093
			}
		},
		{
			"hadithnumber": 1094,
			"arabicnumber": 1094,
			"text": "Abdullah b. Abbas (r.a.) dan: Resulullah Sallallahu Aleyhi ve Sellem (Evlenme hususunda): «Dul kadının rıza ve müsaadesi, velisinden daha önemlidir. Bakire kızların da müsaadesi alınır, onların sükutu müsaade sayılır» buyurdu. Diğer tahric: Müslim, Nikah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1094
			}
		},
		{
			"hadithnumber": 1095,
			"arabicnumber": 1095,
			"text": "Ömer b. Hattab (r.a.) der ki: Kadınlar, velisinin veya ailesinden söz sahibinin veyahut Sultan'ın (mülki amirin) müsaadesi olmadan evlenemez",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1095
			}
		},
		{
			"hadithnumber": 1096,
			"arabicnumber": 1096,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1096
			}
		},
		{
			"hadithnumber": 1097,
			"arabicnumber": 1097,
			"text": "İmam Malik'e rivayet edildiğine göre, Kasım b. Muhammed, Salim b. Abdullah ve Süleyman b. Yesar bakire hakkında şöyle derlerdi. Onu müsaadesini almadan babası evlendirir, bu da onun için bağlayıcı olur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1097
			}
		},
		{
			"hadithnumber": 1098,
			"arabicnumber": 1098,
			"text": "Sehl b. Sa'd es Saidi (r.a.)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem'e bir kadın gelerek: \"Ey Allah'ın Rasulü! Ben kendimi sana hibe ettim\" dedi ve bir süre ayakta bekledi. Bunun üzerine bir kimse kalkarak: \"Ey Allah'ın Rasulü! Eğer sana ihtiyaç değilse onu bana nikahlayıver\" dedi. Bunun üzerine Rasulullah (s.a.v.) o kimseye: \"Ona mihir olarak vereceğin bir şeyin var mı?\" buyurdu. O kimse de: \"Elbisemden başka bir şeyim yok\" dedi. Rasulullah (s.a.v.) ona: \"Eğer elbiseni ona verirsen elbisesiz kalırsın, başka bir şey varsa onları araştır\" buyurdu. O da: \"Hiçbir şey bulamıyorum\" dedi. Bunun üzerine Rasulullah (s.a.v.): \"Araştır bakalım demirden bir yüzük de mi bulamazsın?\" buyurunca o kimse araştırdı fakat hiçbir şey bulamadı. Bunun üzerine Rasulullah Sallallahu Aleyhi ve Sellem ona: \"Kur'an'dan bir şeyler biliyor musun?\" dedi. O da: \"Ezberimde falan falan sureler vardır diyerek isimlerini saydı. Bunun üzerine Rasulullah (s.a.v.): \"Bildiğin o sureleri hanımın olacak bu kimseye öğretmen şartıyla onu sana nikahladım\" buyurdu. Diğer tahric: Buharı, Nikah; Müslim, Nikah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1098
			}
		},
		{
			"hadithnumber": 1099,
			"arabicnumber": 1099,
			"text": "Ömer b. Hattab (r.a.) der ki: Bir adam, kendisinde delilik, cüzzam veya alaca hastalığı olan bir kadınla evlense ve onunla temasta bulunsa, onun mehrini tamamen vermesi gerekir, kadının velisi ise (aldatan durumda olduğu için) mehrin tamamını kocaya öder, İmam Malik der ki: Eğer adı geçen kadını nikahlayan velisi, babası, yahut kardeşi veyahut kusurunu bilen biri olursa mehrin tamamını kocaya öder. Ama nikahlayan veli, amcasıoğlu, yahut mevlası (kendisini azat eden efendisi), yahut da kusurunu bilmeyen yakın kimselerden ise mehri ödemez, kadının kendisi mehirden aldığını iade eder, koca da bir kısmını tazminat olarak kadı­na bırakır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1099
			}
		},
		{
			"hadithnumber": 1100,
			"arabicnumber": 1100,
			"text": "Nafi’ anlatıyor: Ubeydullah b. Ömer'in kızının annesi, Zeyd b. Hattab'ın kızıdır. Abdullah b. Ömer'in oğlu ile evlenmişti. Henüz onunla gerdeğe girmeden oğlan Öldü. Mehri de tayin etmemişti. Anası kızının mehrini istedi. Abdullah b. Ömer (r.a.): «Ona mehr gerekmez. Eğer mehr gerekse idi elbette verirdik. Ona haksızlık etmezdik» dediyse de anası kabul etmedi. Bunun üzerine aralarında Zeyd b. Sabit (r.a.)'i hakem tayin ettiler. Zeyd b. Sabit (r.a.): Mehirin düşmediğine, kocasının mirasını almasına fetva verdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1100
			}
		},
		{
			"hadithnumber": 1101,
			"arabicnumber": 1101,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1101
			}
		},
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"text": "Ömer (r.a.), zifaf odasına girip başbaşa kalan eşler hakkında mehir vaciptir diye hüküm verdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1102
			}
		},
		{
			"hadithnumber": 1103,
			"arabicnumber": 1103,
			"text": "Zeyd b. Sabit der ki: Bir kişi zevcesiyle zifaf odasına girip perde indirilince mehir farz olur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1103
			}
		},
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "İmâm-ı Mâlik der ki: Bize göre kesici, öğütücü ve sivri dişlerin diyeti eşittir. Çünkü Resûlüllah (sallallahü aleyhi ve sellem): «Dişin diyeti beş devedir» buyurdu, öğütücü diş de bu dişlerden biridir. Bunlardan bir kısmı diğerine üstün olmaz. Şeybanî, 668",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1104
			}
		},
		{
			"hadithnumber": 1105,
			"arabicnumber": 1105,
			"text": "Ebu Bekir b. Abdurrahman el-Mahzumî (r.a.) den şöyle rivayet olundu: Resulullah Sallallahu Aleyhi ve Sellem Ümmü Seleme ile evlendiğinde ona: «—Yanımda her zaman kıymetli olacaksın. İstersen senin yanında yedi gece kalayım, yedi gece de diğer zevcelerimin yanında kalayım, istersen üç gece senin yanında kaldıktan sonra öbürlerinin yanına gideyim, üç gün sonra tekrar geleyim.» deyince Ümmü Seleme: «— Üç gece kal» dedi. Diğer tahric: Müslim, Rada",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1105
			}
		},
		{
			"hadithnumber": 1106,
			"arabicnumber": 1106,
			"text": "Enes b. Malik (r.a.) der ki: (Yeni evlenen kadınlara tanınan özel hak) bakire kız için yedi gece, dul kadın için üç gecedir. Diğer tahric: Buhari, Nikah; Müslim, Rada",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1106
			}
		},
		{
			"hadithnumber": 1107,
			"arabicnumber": 1107,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1107
			}
		},
		{
			"hadithnumber": 1108,
			"arabicnumber": 1108,
			"text": "Abdurrahman b. Zebiyr'in oğlu Zebiyr anlatıyor: Simval oğlu Rifaa —Resulullah zamanında— zevcesi Vehb kızı Temime'yi üç talak ile boşadıktan sonra Temime Zebiyr oğlu Abdurrah­man'la evlendi. Abdurrahman, cinsî kudretinin zayıflığından do­layı Temime ile cinsî münasebette bulunamadı. Temime'yi boşa­dı. Onu daha önce boşamış olan ilk kocası Rifaa Temime'yi tekrar nikahlamak istedi. Bunu Resulullah Sallallahu Aleyhi ve Sellem'a sorduğunda Resuî-i Ekrem Sallallahu Aleyhi ve Sellem bu evliliğe razı olmadı ve: «Temime ikinci koca­sıyla fiilen münasebette bulunmadıkça sana helal olmaz. (Yani onunla evlenemezsin)» buyurdu. Diğer tahric: Buhari, Libas; Müslim, Nikah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1108
			}
		},
		{
			"hadithnumber": 1109,
			"arabicnumber": 1109,
			"text": "Muhammed oğlu Kasım, Hz. Aişe'den rivayet ediyor: Aişe (r.anha)'ya sordular: «Bir adam karısını bir daha alamıyacak şekilde (üç defa) boşadıktan sonra bu kadını başka bir adam nikahladı, kadına dokunmadan boşadı. îlk kocası bu kadını tekrar alabilir mi?» Aişe (r.a.): «Hayır. îkinci kocası onunla fiilen cinsî münase­bette bulunmadan alamaz,» diye cevap verdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1109
			}
		},
		{
			"hadithnumber": 1110,
			"arabicnumber": 1110,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1110
			}
		},
		{
			"hadithnumber": 1111,
			"arabicnumber": 1111,
			"text": "Ebu Hureyre'den: Resulullah Sallallahu Aleyhi ve Sellem buyurdu ki: «Bir kadın bir adam'ın nikahında halasıyla ve teyzesiyle bir arada bulunamaz.» Diğer tahric: Buhari, Nikah; Müslim, Nikah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1111
			}
		},
		{
			"hadithnumber": 1112,
			"arabicnumber": 1112,
			"text": "Said b. Müseyyeb'den: Bir kadın, halasının yahut teyzesinin üzerine nikahlanamaz. Bir erkek de bir başkasından hamile olan cariyesiyle münasebette bulunamaz",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1112
			}
		},
		{
			"hadithnumber": 1113,
			"arabicnumber": 1113,
			"text": "Yahya b. Said rivayet eder: Zeyd b. Sabit'e sordular: «— Bir adam bir kadınla evlendikten sonra, yaklaşmadan onu boşadı. Bu adama boşadığı kadının anası helal olur mu?» Zeyd (r.a.): «— Hayır, asla caiz olmaz. Bu hususta hiç bir şart yoktur. Şart yalnız «Rebaib» (Üvey kızlar) hakkındadır. dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1113
			}
		},
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1114
			}
		},
		{
			"hadithnumber": 1115,
			"arabicnumber": 1115,
			"text": "Abdullah b. Ömer'den: Resulullah Sallallahu Aleyhi ve Sellem «şiğar» usulü nikahı yasakladı. Şiğar: Karşılıklı mehir vermeden, iki kişinin birbirlerinin kızları ile evlenmeleridir. Diğer tahric: Buharı, Nikah; Müslim, Nikah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1115
			}
		},
		{
			"hadithnumber": 1116,
			"arabicnumber": 1116,
			"text": "Ensardan Hıdam kızı Hansa anlatıyor: Duldum. Babam —istemediğim halde— beni birine nikahladı. Resulullah Sallallahu Aleyhi ve Sellem'e gidip bunu anlatınca Nebi Sallallahu Aleyhi ve Sellem nikahı bozdu. Diğer tahric: Buhari, Nikah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1116
			}
		},
		{
			"hadithnumber": 1117,
			"arabicnumber": 1117,
			"text": "Ebu'z-Zübeyr el-Mekkî anlatıyor: Ömer b. Hattab (r.a.)'ın huzuruna bir erkek ve bir kadının şahitliği ile kıyılan bir nikah davası getirildiğinde: «Bu gizli nikahtır. Caiz kılmam. Eğer benden öncekilerden gorseydim, böyle nikahla evlenenleri «Recm» ederdim» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1117
			}
		},
		{
			"hadithnumber": 1118,
			"arabicnumber": 1118,
			"text": "Said b. el-Müseyyeb ve Süleyman b. Yesar'dan: Esed Kabilesinden Tuleyha, Sakif kabilesinden Rüşeyd'in nikahlı karısı idi, onu boşadı. O da iddeti (bekleme süresi) bitmeden (başka biriyle) evlendi. Bunu duyan Hz. Ömer (r.a.) (iddeti bitmeden evlendiği için) Tuleyha'yı ve evlendiği kocasını kırbaçladı. Birbirinden ayırdı. Daha sonra şöyle dedi: Hangi kadın iddeti bitmeden evlenirse evlendiği kocası henüz ona yaklaşmamışsa birbirlerinden ayrılırlar. Sonra ilk kocasından bekleme süresini bitirdikten sonra bekleme süresinde evlenip ayrıldığı adam başkaları gibi kendisine evlenme teklifi yapabilir. Eğer evlendiği adamla münasebette bulunmuşsa nikah fesh edilip (bozulup) ayrılınca, önce ilk kocasının bekleme süresini bitirir, sonra da diğer kocasından dolayı iddeti bitinceye kadar bekler, bir daha da biraraya gelmezler, (yani birbirlerine yabancı olurlar)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1118
			}
		},
		{
			"hadithnumber": 1119,
			"arabicnumber": 1119,
			"text": "Abdullah b. Abbas ve Abdullah b. Ömer'e bir adamın hür karısının üzerine cariye almak istediği sorulunca, o ikisini bir araya getirmeyi hoş görmediler",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1119
			}
		},
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1120
			}
		},
		{
			"hadithnumber": 1121,
			"arabicnumber": 1121,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1121
			}
		},
		{
			"hadithnumber": 1122,
			"arabicnumber": 1122,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1122
			}
		},
		{
			"hadithnumber": 1123,
			"arabicnumber": 1123,
			"text": "Ebu Hasme oğlu Sehl'den: Kabilemin büyüklerinden bir kısım adamlar bana şöyle haber verdi: Sehl oğlu Abdullah ile Muhayyisa, maruz kaldıkları fakirlikten dolayı (hurma satın almak için) Hayber'e gittiler. Orada Muhayyısa'ya gelinerek Sehl oğlu Abdullah'ın öldürülüp bir kuyuya atıldığı haber verildi. O da Yahudiler'e gidip: Vallahi onu siz öldürdünüz» dedi. Onlar da: Vallahi onu biz öldürmedik» dediler. Bunun üzerine Muhayyısa geri döndü. (Medine'ye) kavminin yanına gelerek durumu onlara haber verdi. Sonra Muhayyısa, büyük kardeşi Huveyyısa Muhayyısa ve Huveyyısa ensardan Abdullah b. Mesud'un oğullarıdır. Maktul Abdullah ile kardeşi Abdurrahman da bunların kardeşi Sehl'in oğullarıdır. ve (maktulün kardeşi) Abdurrahman, Resûlüllah (sallallahü aleyhi ve sellem)'a geldiler. Hayber'den gelen Muhayyısa konuşmak isteyince, Resûlüllah (sallallahü aleyhi ve sellem) yaşlı ağabeysini kasdederek, Söz hakkını büyüğe ver, büyüğün konuşsun» dedi. Bunun üzerine önce Huveyyısa, sonra da Muhayyısa konuştu. Daha sonra Resûlüllah (sallallahü aleyhi ve sellem): (Yahudiler) ya maktulün diyetini öderler ya da bize harp ilân etmiş olurlar» dedi. zaman müslumanlarla Hayber Yahudileri arasında sulh anlaşması vardı ve Hayber Yahudilerine bu hususu yazıyla bildirdi. Onlar da: Vallahi onu biz öldürmedik» diye cevap yazınca, Resûlüllah (sallallahü aleyhi ve sellem) Huveyyısa, Muhayyısa ve Abdurrahman'a: Adamınızın kan bedeline hak kazanmak için (onu Yahudilerden birinin öldürdüğüne) yemin eder misiniz?» dedi. Onlar; Hayır» deyince, Resûlüllah (sallallahü aleyhi ve sellem): Yahudiler sizin iddianızı red için yemin etsinler mi?» dedi. Onlar da: Yahudiler müslüman değil ki (yeminlerine inanalım)» deyince, Resûlüllah (sallallahü aleyhi ve sellem) maktulün diyetini kendi yanından vermeyi kabullendi ve yüz dişi deve gönderdi. Hatta develer onların evine kadar götürüldü. Davacılar yemin etmekten kaçındıkları için, Resûlüllah (sallallahü aleyhi ve sellem) bu defa davacılara yemin teklif edip etmeyeceklerini sormuştur ki Şafii ve Malikiler'e göre de tatbikat böyledir. Davacılar onların yeminlerini de kabul etmek istemeyince, Resûlüllah (sallallahü aleyhi ve sellem) olayın daha fazla sürüncemede kalmasını önlemek ve bu sebeple Yahudilerle ölü sahipleri arasında çıkacak ihtilafı önlemek için maktulün diyetini kendi malından veya devlet hazinesinden ödemiştir. . Ayrıca burada gayri müslimlerin yeminlerinin geçerli olduğunu öğreniyoruz. Şayet onların yeminleri muteber olmasaydı, Resûlüllah (sallallahü aleyhi ve sellem) onlara yemin teklifinde bulunmazdı. Ölü sahipleri onlara düşmanlık ve kızgınlıklarından dolayı yeminlerini kabul etmemiştir. der ki: «Bunlardan kırmızı bir dişi deve beni tepti». \", Ahkâm, 93/38; Müslim, 28/1, no: 6; Şeybanî, 681 Malik der ki: Hadisteki fakir kelimesi, kuyu demektir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1123
			}
		},
		{
			"hadithnumber": 1124,
			"arabicnumber": 1124,
			"text": "Hz. Ömer'e: «Anası ile kızını cariye olarak mülkiyetine geçiren kimse bunlardan biri ile birleştikten sonra öbürüne yaklaşabilir mi?» diye sordular. O da: «İkisiyle birden birleşmeyi doğru bulmam» diye cevap verdi ve hem ana hem de kızı ile karı koca hayatı yaşamayı yasakladı",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1124
			}
		},
		{
			"hadithnumber": 1125,
			"arabicnumber": 1125,
			"text": "Kabısa b. Züeyb rivayet eder: Bir adam Osman b. Affan'a (r.a.) sordu: «— Cariye olan iki kız kardeşle, efendisi karı koca hayatı yaşı-yabilir mi?» Osman b. Affan (r.a.) şöyle cevap verdi; «— iki kız kardeş cariye ile karı-koca hayatı yaşamayı bir ayet helal kıldı, başka bir ayet haram kıldı. Ben bunu caiz görmem» dedi. Kabîsa devam ederek der ki: Adam, Hz. Osman'ın yanından çıkınca Resulullah'ın Sallallahu Aleyhi ve Sellem ashabından birine rastladı, aynı me­seleyi ona da sorunca: «— Eğer benim selahiyetim olsa da bunu yapanı (iki kız kar­deşle evleneni) bulsam ağır ceza veririm» diye cevap verdi. İbn Şihab: Bu sahabinin Ali b. Ebî Talib olduğunu sanıyorum, dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1125
			}
		},
		{
			"hadithnumber": 1126,
			"arabicnumber": 1126,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1126
			}
		},
		{
			"hadithnumber": 1127,
			"arabicnumber": 1127,
			"text": "imam Malik'e şöyle rivayet olundu: Ömer b. Hattab (r.a.) oğluna bir cariye hibe etti ve kendisine: «Ona dokunma. Avret ma­halline baktım, (sana helal olmaz)» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1127
			}
		},
		{
			"hadithnumber": 1128,
			"arabicnumber": 1128,
			"text": "Malik (r.a.), Abdurrahman b. el-Mücebber'den rivayet eder: Salim b. Abdullah oğluna bir cariye hibe eder ve ona der ki: «Ona yaklaşma. Çünkü onunla temas etmek istedim. Fakat vücudunu gördükten sonra vaz geçtim",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1128
			}
		},
		{
			"hadithnumber": 1129,
			"arabicnumber": 1129,
			"text": "Esved oğlu Ebu Nehşel, Sa'id oğlu Yahya'ya şöyle anlattı: «Muhammed oğlu Kasım'a: Ay ışığında cariyemi çıplak gördüm. Hemen ona, bir erkeğin karısına yaklaştığı gibi yaklaştım. Bunun üzerine cariyem: «Bana yaklaşma, adet halindeyim» dedi. Ben de hemen kalkıp ondan uzaklaştım. Şimdi onu oğluma hibe etsem onunla cinsî münasebette bulunabilir mi?» dedim. O da onu oğluma vermeme müsaade etmedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1129
			}
		},
		{
			"hadithnumber": 1130,
			"arabicnumber": 1130,
			"text": "Mervan oğlu Abdulmelik arkadaşına bir cariye hibe eder. Bir süre sonra arkadaşına: «— Cariyeden ne haber?» der. O da: «— Onu oğluma hibe etmek istiyorum. Onunla karı koca hayatı yaşıyacak» deyince, Abdulmelik: «— Mervan (babam) senden daha muttaki imiş. Oğluna (bana) bir cariye hibe etti, sonra da, ona cariyenin bacaklarını açık olarak gördüğünü ve ona yaklaşmamasını tenbih etti» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1130
			}
		},
		{
			"hadithnumber": 1131,
			"arabicnumber": 1131,
			"text": "Saîd b. el-Müseyyeb der ki: Kadınlardan muhsana olanlar, kocası olan evli kadınlardır. Bunlarla da evlenmek caiz değildir. Evlenince nikah batıldır, zina sayılır. Zinayı ise Allah haram kılmıştır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1131
			}
		},
		{
			"hadithnumber": 1132,
			"arabicnumber": 1132,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1132
			}
		},
		{
			"hadithnumber": 1133,
			"arabicnumber": 1133,
			"text": "Ali (r.a.)'den rivayet olundu: Resulullah Sallallahu Aleyhi ve Sellem Hayber savaşı günü Muta' nikahını ve ehlî merkep etinin yenilmesini yasakladı",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1133
			}
		},
		{
			"hadithnumber": 1134,
			"arabicnumber": 1134,
			"text": "Urve b. Zübeyr anlatıyor: Hakîm kızı Havle, Hz. Ömer'in huzuruna girerek: «— Ümeyye oğlu Rebîa bir kadınla Muta' usulü birleşti, kadın hamile kaldı» deyince, Hz. Ömer kızdı, hırkasını sürükleyerek çıkarken şöyle söyledi: «— Bu müt'adir. Önceden hükmü bana bırakılsa idi, bunu yapanları recm ederdim.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1134
			}
		},
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1135
			}
		},
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "İbn Şihab'dan şöyle rivayet olundu: Resulullah Sallallahu Aleyhi ve Sellem'in zamanında kocaları henüz kafir olan bazı kadınlar hicret etmeksi­zin müslüman olmuşlardır. Onlardan biri de Mugıyra oğlu Velid'in kızıdır ki Ümeyye oğlu Safvan'm karısı idi. Mekke'nin fet­hi günü müslüman oldu. Kocası Safvan İslama girmedi ve kaçtı. Resulullah Sallallahu Aleyhi ve Sellem Safvan'a, amcası Ümeyy oğlu Vehb'i —güven altında olduğuna işaret olmak üzere hırkasını vererek— peşinden gönderdi ve islam'a davet etti. Vehb'e şöyle talimat verdi. Safvan razı olursa İslam'ı kabul edecek, gelmek istemezse ona iki ay müd­det tanınmıştır. Safvan, elinde hırka ile Resulullah Sallallahu Aleyhi ve Sellem'in yanına gelince cemaat arasında: «— Ya Muhammed! İşte şu Umeyr oğlu Vehb, hırkanı bana ge­tirerek beni çağırdığım, razı olursam îslama gireceğimi, olmazsam bana iki ay süre tanıyacağını söyledi» deyince Resul-i Ekrem Sallallahu Aleyhi ve Sellem: «— Ey Ebu Vehb! Bineğinden inebilirsin.» buyurdu. Safvan: «— Hayır. Bana kararını açıklamadan vallahi inmem» deyin­ce Resulullah Sallallahu Aleyhi ve Sellem: «— Sana dört ay süre tanıdım» buyurdu. Bunun üzerine Resuluîlah Sallallahu Aleyhi ve Sellem Hevazin kabilesini Islama davet etmek üzere Huneyn'e hareket etti. Orada Safvan'a haber göndererek emanet olmak üzere silah ve bazı malzeme getirmesi­ni söyledi. Safvan gelince: «— Bunları kendi rızamla mı vereceğim, yoksa zorla mı ala­caksın?» dedi. Resulullah Sallallahu Aleyhi ve Sellem'da: «—Kendi rızanla» buyurunca, yanındaki silah ve malzeme­yi verdi. Daha sonra Safvan —kendisi kafir, karısı müslüman olarak— Resulullah ile birlikte Huneyn ve Taif savaşlarına katıl­dı. Müslüman oluncaya kadar da Resuî-i Ekrem Sallallahu Aleyhi ve Sellem karısını ondan ayırmadı. İslam'a girdikten sonra eski nikahlarıyla hayat­larını sürdürdüler. İbn Abdilber der ki: Sahih bir yoldan muttasıl olduğunu bilmiyorum. Bu, siyer bilginlerince bilinen bir hadistir. Îbn Şihab, bu bilginlerin imamıdır. Bu hadisin şöhreti, isnadından daha güçlüdür",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1136
			}
		},
		{
			"hadithnumber": 1137,
			"arabicnumber": 1137,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1137
			}
		},
		{
			"hadithnumber": 1138,
			"arabicnumber": 1138,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1138
			}
		},
		{
			"hadithnumber": 1139,
			"arabicnumber": 1139,
			"text": "Enes b. Malik (r.a.) anlatıyor: Abdurrahman b. Avf (r.a.) Resulullah Sallallahu Aleyhi ve Sellem'in huzuruna geldi, üzerinde evlilik belirtisi vardı. Resul-i Ekrem sorunca evlendiğini söyledi. Resulullah Sallallahu Aleyhi ve Sellem ne kadar mehir verdiğini sordu, o da: «— Bir hurma çekirdeği ağırlığında altın verdim» dedi. Bunun üzerine Nebi s.a.v.: «— Bir koyun da olsa kes, düğün yap» buyurdu. Diğer tahric: Buhari, Nikah; Müslim, Nikah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1139
			}
		},
		{
			"hadithnumber": 1140,
			"arabicnumber": 1140,
			"text": "Yahya bin Said'den şöyle rivayet edildi: «— Bana nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem düğüne gelenlere et ve ekmek yedirirdi. îbn Mace (Nikah), mevsul olarak rivayet eder",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1140
			}
		},
		{
			"hadithnumber": 1141,
			"arabicnumber": 1141,
			"text": "Abdullah b. Ömer, Resulullah Sallallahu Aleyhi ve Sellem'in şöyle dediğini rivayet etti: «—Herhangi biriniz düğüne davet edilirse, gitsin.» Diğer tahric: Buharî, Nikah; Müslim, Nikah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1141
			}
		},
		{
			"hadithnumber": 1142,
			"arabicnumber": 1142,
			"text": "Ebu Hureyre'nin şöyle dediği rivayet olundu: «— En kötü sofra fakirlerin çağırılmayıp sadece zenginlerin davet edildiği düğün yemeğidir. Kim davet edilir de gitmezse, Allah'a ve Resulüne asi olmuş olur.» Diğer tahric: Buharî, Nikah; Müslim, Nikah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1142
			}
		},
		{
			"hadithnumber": 1143,
			"arabicnumber": 1143,
			"text": "Enes b. Malik anlatıyor: Bir terzi Resuluîlalı Sallallahu Aleyhi ve Sellem'ı, hazırladığı bir yemeğe davet etti. Ben de beraber gittim. Ev sahibi arpa ekmeği ve kabak çorbası çıkardı. Yerken Resulüllah Sallallahu Aleyhi ve Sellem'in çorbadaki kabaklan topladığını gördüm. O günden sonra kabağı sevmeye başladım. Diğer tahric: Buhari Et'ime; Müslim, Eşribe",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1143
			}
		},
		{
			"hadithnumber": 1144,
			"arabicnumber": 1144,
			"text": "Zeyd b. Eslem'den Resulullah Sallallahu Aleyhi ve Sellemin şöyle dediği ri­vayet olundu: «— Sizden biriniz bir kadınla evlenir veya bir cariye satın alırsa, perçeminden tutsun. Uğurlu ve bereketli olması için dua etsin. Deve satın aınca da elini hörgücüne koysun, şeytan'ın şerrinden Allah'a sığınsın.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1144
			}
		},
		{
			"hadithnumber": 1145,
			"arabicnumber": 1145,
			"text": "Ebu Zübeyr el-Mekkî der ki: Bir adam birinin kız kardeşini istedi. Kardeşi de bacısının zina ettiğini söyledi. Bunu işiten Hz. Ömer (r.a.) neden unutulmuş hadiseyi söyledin diye kızın kardeşini dövdü",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1145
			}
		},
		{
			"hadithnumber": 1146,
			"arabicnumber": 1146,
			"text": "Rebia b. Ebi Abdurrahman'dan şöyle rivayet edildi: Kasım b. Muhammed ve Urve b. Zübeyr şöyle derlerdi: Dört karısı olan bir adam zevcelerinden birini boşasa, istediği takdirde evlenebilir. Onun iddetinin bitmesini beklemesi gerekmez",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1146
			}
		},
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"text": "Kasım b. Muhammed ile Urve b. Zübeyr yukardaki fetvayı, Medine'ye geldiği sene Velid b. Abdülmelik hakkında vermişlerdi. Şu kadar var ki, Kasım b. Muhammed: «Velîd karısını muhtelif meclislerde boşadı» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1147
			}
		},
		{
			"hadithnumber": 1148,
			"arabicnumber": 1148,
			"text": "Said b. Müseyyeb der ki: Üç şeyle oynanmaz, şaka yapılmaz: Nikah, talak ve köle azad etmek. Diğer tahric: Ebu Davud, Talak; Tirmizi, Talak; İbn Mace, Talak",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1148
			}
		},
		{
			"hadithnumber": 1149,
			"arabicnumber": 1149,
			"text": "Rafi' b. Hadîc anlatıyor: Ensardan Muhammed b. Mesleme'nin kızıyla evlendim. Yaşlanınca üzerine genç bir kızla evlendim. Genç karıma daha fazla önem veriyordum, ilk karım ayrılmak istedi, onu bir talak ile boşadım. Iddeti bitmek üzereyken onunla tekrar birleştim. Sonra yine genç karıma yakınlık gösterince tekrar ayrılmak istedi, onu bir talak daha boşadım. Iddeti bitmeden onunla tekrar birleştim. Daha sonra genç karıma yakınlık ve iltifatım devam edince yine boşanmak istedi. Bunun üzerine ona: «— Ne diyorsun? iyi düşün. Bir talak kaldı. Genç hanımdan daha az iltifat görerek yaşamaya razıysan evliliğimiz devam etsin. Buna razı olmazsan bir daha birleşmemek üzere seni üçüncü kez boşayacağım» dedim. O da: «— Ben bu hale razıyım, evliliğimiz devam etsin» dedi, ben de onu bir daha bırakmadım. Bu hale razı olduğunu söyleyince ben de bunda bir vebal görmedim",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1149
			}
		}
	]
}