{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"28": "Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1091,
			"arabicnumber": 1091,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1091
			}
		},
		{
			"hadithnumber": 1092,
			"arabicnumber": 1092,
			"text": "İmâm-ı Mâlik der ki: Hamile bir kadın, bir erkek veya kadını kasden öldürse, buna doğum yapıncaya kadar kısas cezası uygulanmaz. Kasden veya hataen öldürülen kadın hamile olsa, öldüren kadının ceninine bir şey gerekmez. Şayet kadın kasden öldürülmüş ise, onu öldüren kadın kısasen öldürülür. Cenine diyet gerekmez. Şayet hataen öldürülmüşse, diyetini onu öldüren kadının akılesi öder. Cenine diyet gerekmez",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1092
			}
		},
		{
			"hadithnumber": 1093,
			"arabicnumber": 1093,
			"text": "Yahya der ki: Malik'e Yahudi ve Hıristiyan kadının karın ve benzeri yerine vurulması suretiyle düşürdüğü ceninin hükmü sorulunca: «Anasının diyetinin onda biri gerektiği kanaatindeyim» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1093
			}
		},
		{
			"hadithnumber": 1094,
			"arabicnumber": 1094,
			"text": "Said b. Museyyeb'in şöyle dediği Rivâyet edildi: İki dudak için tam diyet gerekir. Alt dudak kesilirse, diyeti, tam diyetin üçte ikisidir. İmâm-ı Mâlik'e göre yarım diyettir. Hanefiler'e göre de yarım diyettir. Çünkü kaide olarak çift uzvun diyeti tam, bunlardan birinin diyeti ise yarımdır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1094
			}
		},
		{
			"hadithnumber": 1095,
			"arabicnumber": 1095,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1095
			}
		},
		{
			"hadithnumber": 1096,
			"arabicnumber": 1096,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1096
			}
		},
		{
			"hadithnumber": 1097,
			"arabicnumber": 1097,
			"text": "İmâm-ı Mâlik'e şöyle Rivâyet edildi: İnsanin çift azalarının, dilin, dibinden kesilsin veya kesilmesin, işitme duygusunu gideren iki kulağın, erkeğin tenasül (cinsî) organının ve iki husyesinin (yumurtasının) diyeti tam diyettir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1097
			}
		},
		{
			"hadithnumber": 1098,
			"arabicnumber": 1098,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1098
			}
		},
		{
			"hadithnumber": 1099,
			"arabicnumber": 1099,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1099
			}
		},
		{
			"hadithnumber": 1100,
			"arabicnumber": 1100,
			"text": "Abdurrahman oğlu Rabia'dan: Said b. Müseyyeb'e: « Kadının bir parmağının diyeti ne kadardır?» diye sorduğumda: On devedir» diye cevap verdi. Ben: iki parmağın diyete ne kadardır?» deyince O: Yirmi deve» dedi. Üç parmağın diyeti ne kadar?» dedim. Otuz deve» dedi. Bu defa ben: Dört parmağın diyeti ne kadar?» diye sorunca: Yirmi deve» dedi Maliki mezhebine göre, kadının uzuvlarının diyeti, tam diyetin üçte birine kadar erkeğin uzevlarının diyetine eşit olduğunu, üçte birine ulaşınca erkeğinkinin yarısı kadar olacağını belirtmiştik. Erkeğin dört parmağının diyeti kırk devedir ki bu tam diyet olan yüz devenin üçte birinden fazladır. Bu sebeple, kadının dört parmağının diyeti, erkeğin dört parmağının diyetinin yarısına düşmüştür. Bunun üzerine ben: yarası büyüyüp acısı şiddetlenince diyeti azalıyor mu?» deyince» Said: Sen Iraklı mısın?» dedi. Ben de: Ben tedbirli davranan bir alimim, ya da öğrenmek isteyen bir cahilim» deyince, Said: ben hadislere dayanarak konuşuyorum» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1100
			}
		},
		{
			"hadithnumber": 1101,
			"arabicnumber": 1101,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1101
			}
		},
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1102
			}
		},
		{
			"hadithnumber": 1103,
			"arabicnumber": 1103,
			"text": "Urve'nin diyet hususunda dişleri eşit tuttuğu, bir kısmım diğerlerine üstün tutmadığı Rivâyet edildi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1103
			}
		},
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "İmâm-ı Mâlik der ki: Bize göre kesici, öğütücü ve sivri dişlerin diyeti eşittir. Çünkü Resûlüllah (sallallahü aleyhi ve sellem): «Dişin diyeti beş devedir» buyurdu, öğütücü diş de bu dişlerden biridir. Bunlardan bir kısmı diğerine üstün olmaz. Şeybanî, 668",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1104
			}
		},
		{
			"hadithnumber": 1105,
			"arabicnumber": 1105,
			"text": "İmâm-ı Mâlik'e Rivâyet edildiğine göre, Said b. Müseyyeb ve Süleyman b. Yesar: «Kölenin yüz ve başındaki kemiğe kadar işleyen yaranın diyeti, kendi değerinin yirmide biri kadardır» derlerdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1105
			}
		},
		{
			"hadithnumber": 1106,
			"arabicnumber": 1106,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1106
			}
		},
		{
			"hadithnumber": 1107,
			"arabicnumber": 1107,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1107
			}
		},
		{
			"hadithnumber": 1108,
			"arabicnumber": 1108,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1108
			}
		},
		{
			"hadithnumber": 1109,
			"arabicnumber": 1109,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1109
			}
		},
		{
			"hadithnumber": 1110,
			"arabicnumber": 1110,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1110
			}
		},
		{
			"hadithnumber": 1111,
			"arabicnumber": 1111,
			"text": "Said oğlu Yahya'dan: Yesar oğlu Süleyman «Mecûsî'nin (ateşe tapanın) diyeti sekiz yüz dirhemdir» derdi. Mâlik der ki: «Bize göre de durum böyledir» Hanefîler'e göre, mecusinin diyeti, aynen müslümanın diyeti gibidir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1111
			}
		},
		{
			"hadithnumber": 1112,
			"arabicnumber": 1112,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1112
			}
		},
		{
			"hadithnumber": 1113,
			"arabicnumber": 1113,
			"text": "Yesâr oğlu Büşeyr anlattı: Sehl oğlu Abdullah el-Ensârî ve Mesud oğlu Muhayyısa, Hayber'e gittiler. Oraya varınca işlerini takip etmek üzere ayrıldılar. Sehl oğlu Abdullah öldürüldü. Muhayyısa, Medine'ye geldi. Daha sonra kendisi, kardeşi Huveyyısa ve Sehl oğlu Abdurrahman, Resûlüllah (sallallahü aleyhi ve sellem)'e geldiler. Ölünün kardeşi olduğu için Abdurrahman konuşmak isteyince Resûlüllah (sallallahü aleyhi ve sellem): büyüğe bırak, Önce büyüğün konuşsun» buyurdu. Böylece Huveyyisa ile Muhayyisa konuşup Sehl oğlu Abdullah'ın öldürülmesini anlattılar. Resûlüllah (sallallahü aleyhi ve sellem) de kendilerine: kan bedelinin size verilmesi için elli yemin eder misiniz?» deyince onlar: Öldürüldüğünü görmedik ve yanında değildik» dediler. Resûlüllah (sallallahü aleyhi ve sellem): O halde elli yemin ederek Yahudiler sizin iddianızdan kurtulur» Bu hadise istinaden İmâm-ı Mâlik, Şafii ve Ahmed b. Hanbel böyle faili meçhul katil hadiselerinde elli yemin maktulün velilerine yani davacılarına ettirilir, derler. Hanefiler ise, Peygamber Efendimiz (sallallahü aleyhi ve sellem)'in « Delil getirmek davacıya, yemin etmek de inkâr edene, (başka bir Rivâyette) davalıya aittir.» hadisi şerifini alarak, yemin maktulün bulunduğu yerden davacıların seçeceği elli davalıya ettirilir, derler buyurunca, onlar: Ya Resûlallah kâfir kavmin yeminlerini nasıl kabul ederiz» dediler. Ebu Ömer der ki: Bu hadisin mürsel oluşunda Malik'e muhalefet yoktur. Sahihayn ve başkalarında, Beşir-Sehl b. ebi Hayseme-Râfî b. Hadîc yoluyla mevsuldür: Buhârî, Diyât, 87/22; Müslim, Kasame, 28/1, no:2. oğlu Yahya der ki: Yesar oğlu Büşeyr, maktulün diyetini Resûlüllah (sallallahü aleyhi ve sellem) kendi verdi, dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1113
			}
		},
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1114
			}
		},
		{
			"hadithnumber": 1115,
			"arabicnumber": 1115,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1115
			}
		},
		{
			"hadithnumber": 1116,
			"arabicnumber": 1116,
			"text": "İmâm-ı Mâlik der ki: Bize göre, tam diyetin üçte birinden az miktarlarını cinayeti işleyen kendi malından öder. Fakat diyet miktarı tam diyetin en az üçte birine ulaşınca o zaman âkılesi öder. Sağ ise kendisine, ölmüşse mirasçılarına âkılesi diyet vermez",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1116
			}
		},
		{
			"hadithnumber": 1117,
			"arabicnumber": 1117,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1117
			}
		},
		{
			"hadithnumber": 1118,
			"arabicnumber": 1118,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1118
			}
		},
		{
			"hadithnumber": 1119,
			"arabicnumber": 1119,
			"text": "İmâm-ı Mâlik der ki: Hata yoluyla adam öldürmede kan davacıları yemin ederler ve yeminleriyle kana hak kazanırlar. Bunlar elli yemin ederler. Yeminlerinin sayısı, diyetteki hisseleri oranında olur. Elli yemin davacılara taksim edilince, eksik kalan yemin taksimde kendisine en çok yemin düşene yaptırılır. Mâlik der ki: Öldürülenin kadınlardan başka varisleri yoksa, yemini bunlar ederler ve diyeti alırlar. Sadece bir erkek varisi varsa, elli yemin eder ve diyeti alır. Bu hüküm, kasden öldürmede değil, hata yoluyla öldürmededir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1119
			}
		},
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1120
			}
		},
		{
			"hadithnumber": 1121,
			"arabicnumber": 1121,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1121
			}
		},
		{
			"hadithnumber": 1122,
			"arabicnumber": 1122,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1122
			}
		},
		{
			"hadithnumber": 1123,
			"arabicnumber": 1123,
			"text": "Ebu Hasme oğlu Sehl'den: Kabilemin büyüklerinden bir kısım adamlar bana şöyle haber verdi: Sehl oğlu Abdullah ile Muhayyisa, maruz kaldıkları fakirlikten dolayı (hurma satın almak için) Hayber'e gittiler. Orada Muhayyısa'ya gelinerek Sehl oğlu Abdullah'ın öldürülüp bir kuyuya atıldığı haber verildi. O da Yahudiler'e gidip: Vallahi onu siz öldürdünüz» dedi. Onlar da: Vallahi onu biz öldürmedik» dediler. Bunun üzerine Muhayyısa geri döndü. (Medine'ye) kavminin yanına gelerek durumu onlara haber verdi. Sonra Muhayyısa, büyük kardeşi Huveyyısa Muhayyısa ve Huveyyısa ensardan Abdullah b. Mesud'un oğullarıdır. Maktul Abdullah ile kardeşi Abdurrahman da bunların kardeşi Sehl'in oğullarıdır. ve (maktulün kardeşi) Abdurrahman, Resûlüllah (sallallahü aleyhi ve sellem)'a geldiler. Hayber'den gelen Muhayyısa konuşmak isteyince, Resûlüllah (sallallahü aleyhi ve sellem) yaşlı ağabeysini kasdederek, Söz hakkını büyüğe ver, büyüğün konuşsun» dedi. Bunun üzerine önce Huveyyısa, sonra da Muhayyısa konuştu. Daha sonra Resûlüllah (sallallahü aleyhi ve sellem): (Yahudiler) ya maktulün diyetini öderler ya da bize harp ilân etmiş olurlar» dedi. zaman müslumanlarla Hayber Yahudileri arasında sulh anlaşması vardı ve Hayber Yahudilerine bu hususu yazıyla bildirdi. Onlar da: Vallahi onu biz öldürmedik» diye cevap yazınca, Resûlüllah (sallallahü aleyhi ve sellem) Huveyyısa, Muhayyısa ve Abdurrahman'a: Adamınızın kan bedeline hak kazanmak için (onu Yahudilerden birinin öldürdüğüne) yemin eder misiniz?» dedi. Onlar; Hayır» deyince, Resûlüllah (sallallahü aleyhi ve sellem): Yahudiler sizin iddianızı red için yemin etsinler mi?» dedi. Onlar da: Yahudiler müslüman değil ki (yeminlerine inanalım)» deyince, Resûlüllah (sallallahü aleyhi ve sellem) maktulün diyetini kendi yanından vermeyi kabullendi ve yüz dişi deve gönderdi. Hatta develer onların evine kadar götürüldü. Davacılar yemin etmekten kaçındıkları için, Resûlüllah (sallallahü aleyhi ve sellem) bu defa davacılara yemin teklif edip etmeyeceklerini sormuştur ki Şafii ve Malikiler'e göre de tatbikat böyledir. Davacılar onların yeminlerini de kabul etmek istemeyince, Resûlüllah (sallallahü aleyhi ve sellem) olayın daha fazla sürüncemede kalmasını önlemek ve bu sebeple Yahudilerle ölü sahipleri arasında çıkacak ihtilafı önlemek için maktulün diyetini kendi malından veya devlet hazinesinden ödemiştir. . Ayrıca burada gayri müslimlerin yeminlerinin geçerli olduğunu öğreniyoruz. Şayet onların yeminleri muteber olmasaydı, Resûlüllah (sallallahü aleyhi ve sellem) onlara yemin teklifinde bulunmazdı. Ölü sahipleri onlara düşmanlık ve kızgınlıklarından dolayı yeminlerini kabul etmemiştir. der ki: «Bunlardan kırmızı bir dişi deve beni tepti». \", Ahkâm, 93/38; Müslim, 28/1, no: 6; Şeybanî, 681 Malik der ki: Hadisteki fakir kelimesi, kuyu demektir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1123
			}
		},
		{
			"hadithnumber": 1124,
			"arabicnumber": 1124,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1124
			}
		},
		{
			"hadithnumber": 1125,
			"arabicnumber": 1125,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1125
			}
		},
		{
			"hadithnumber": 1126,
			"arabicnumber": 1126,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1126
			}
		},
		{
			"hadithnumber": 1127,
			"arabicnumber": 1127,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1127
			}
		},
		{
			"hadithnumber": 1128,
			"arabicnumber": 1128,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1128
			}
		},
		{
			"hadithnumber": 1129,
			"arabicnumber": 1129,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1129
			}
		},
		{
			"hadithnumber": 1130,
			"arabicnumber": 1130,
			"text": "İmâm-ı Mâlik der ki: Bize göre, kölelerin durumu şöyledir; Köle kasden veya hata yoluyla öldürülür, sonra efendisi (bunu falan öldürdü diye) bir şahit getirirse, şahitle beraber kendisi de bir yemin ettikten sonra öldürülenin bedelini alır. Hataen ve kasden öldürülen kölelerde kasame (elli yemin) yoktur. Kasame gerekir diyen hiç bir ilim sahibini işitmedim",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1130
			}
		},
		{
			"hadithnumber": 1131,
			"arabicnumber": 1131,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1131
			}
		},
		{
			"hadithnumber": 1132,
			"arabicnumber": 1132,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1132
			}
		},
		{
			"hadithnumber": 1133,
			"arabicnumber": 1133,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1133
			}
		},
		{
			"hadithnumber": 1134,
			"arabicnumber": 1134,
			"text": "Ebû Eyyüb el-Ensârî (radıyallahü anh)'den: «Bir grup çocuğun bir tilkiyi avlamak için Medine'nin bir köşesine sıkıştırdıklarını görünce onları kovdum tilkiyi kurtardım» dedi. İmâm-ı Mâlik der ki: Ebû Eyyüb el-Ensârî, çocuklara: Resûlüllah (sallallahü aleyhi ve sellem)'in hareminde bu yapılır mı?» demiştir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1134
			}
		},
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1135
			}
		},
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1136
			}
		},
		{
			"hadithnumber": 1137,
			"arabicnumber": 1137,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1137
			}
		},
		{
			"hadithnumber": 1138,
			"arabicnumber": 1138,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1138
			}
		},
		{
			"hadithnumber": 1139,
			"arabicnumber": 1139,
			"text": "İmâm-ı Mâlik'e şöyle denildiği Rivâyet edildi: Hiç bir kimse rızkını tamamlamadan ölmez. O halde rızkınızı helal yoldan arayınız. Cabir'den manaca merfu olarak gelmiştir: İbn Mace Ticarat, 12/2",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1139
			}
		},
		{
			"hadithnumber": 1140,
			"arabicnumber": 1140,
			"text": "Peygamber Efendimiz (sallallahü aleyhi ve sellem)'in zevcesi Hazret-i Aişe (radıyallahü anh)'dan: Ben Resûlüllah (sallallahü aleyhi ve sellem) ile beraber iken, bir adam huzuruna girmek için izin istedi. Resûlüllah (sallallahü aleyhi ve sellem): «O, kabilenin en kötü oğludur» dedi. Sonra ona izin verdi. Aradan fazla zaman geçmeden Resûlüllah (sallallahü aleyhi ve sellem)'in onunla beraber güldüğünü işittim. Adam çıkınca: Resûlallah! Biraz önce sen o adam hakkında söyleyeceğini söyledin. Sonra aradan zaman geçmeden onunla beraber güldün» dediğimde, Resûlüllah (sallallahü aleyhi ve sellem): İnsanların en kötüsü, şerrinden dolayı insanların kendisinden korunduğu kimsedir» buyurdu. Süfyan b. Uyeyne - Muhammed b. Munkedır - Urve - Aişe senediyle Rivâyet edilmiştir: Buhârî, Edeb, 78/8; Müslim, Edeb, 45/22, no:73",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1140
			}
		},
		{
			"hadithnumber": 1141,
			"arabicnumber": 1141,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1141
			}
		},
		{
			"hadithnumber": 1142,
			"arabicnumber": 1142,
			"text": "Yahya b. Said'den: Said b. Müseyyeb'i işittim: «Size çok namaz kılıp sadaka vermekten daha üstün bir şeyi haber vereyim mi?» dedi. Evet, haber ver.» dediler. İki kişinin arasını düzeltip, dargınları barıştırmaktır. Bir de çok buğz etmekden kaçınınız. Çünkü buğz (iyi huyları) kökünden yok eder» dedi. Malik'in bütün ravilerine mevkuftur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1142
			}
		},
		{
			"hadithnumber": 1143,
			"arabicnumber": 1143,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1143
			}
		},
		{
			"hadithnumber": 1144,
			"arabicnumber": 1144,
			"text": "Ebû Müslim oğlu Ata Abdullah el-Horasânî'den: Resûlüllah (sallallahü aleyhi ve sellem): «Musafaha ediniz (tokalaşınız), aranızdaki kin gider. Birbirinize hediye veriniz ki, sevişirsiniz ve aranızdaki düşmanlık gider» buyurdu. İbn Abdilber der ki: Bu hadis çeşitli yollarla muttasıldır ve hepsi de basendir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1144
			}
		},
		{
			"hadithnumber": 1145,
			"arabicnumber": 1145,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1145
			}
		},
		{
			"hadithnumber": 1146,
			"arabicnumber": 1146,
			"text": "İbni Sirin'den: Ömer b. Hattab (radıyallahü anh) şöyle dedi: «Allah size bol verince siz de kendinize iyi bakınız (temiz giyiniz). Herkes giyimine önem versin.» Bu, Buhari'nin, Hammad b. Zeyd - Eyyub - Muhammed b. Şîrîn - Ebu Hureyre senediyle gelen hadisin bir bölümüdür: Buharî, Salat, 8/9. Her müslümanın, avret mahallerini örtecek, vücudunu sıcak ve soğuktan koruyacak şekilde elbise giymesi farzdır. Müslüman her konuda olduğu gibi elbise giymede de orta yolu tutmalıdır. Elbisesi ne son derece kötü, âdi ve ne de son derece lüks olmayıp ikisi arasında olmalıdır. Çünkü Resûlüllah (sallallahü aleyhi ve sellem): «Giyimde sadelik imandandır» buyurmuştur. Allahu Teâlâ'nın kendisine vermiş olduğu nimeti belirtmek için, çok güzel elbise giymesi de müstehabdır. Çünkü Peygamber Efendimiz (sallallahü aleyhi ve sellem): «Allahü Teâlâ sana lütuf ve ihsanda bulunduğu gibi, sen de kendi nefsine lütuf ve iyilikte bulun», «Allahü Teâlâ vermiş olduğu nimetinin belirtisini kulunun üzerinde görmeyi sever» buyurmuştur. Bilhassa Cuma ve bayramlar gibi önemli günlerde ve toplantılarda güzel ve temiz elbiseler giyilmelidir. Yüce Allah, Araf sûresinin 31 ve 32'nci âyetlerinde şöyle buyurmuştur: «Ey Adem oğulları! Her mescide güzel elbiselerinizi giyinerek gidin, yiyin, için, fakat israf etmeyin. Çünkü Allah israf edenleri sevmez. De ki: Allah'ın kulları için yarattığı zineti, temiz ve hoş rızıkları kim haram etmiş? De ki: O (onlar), dünya hayatında iman edenler içindir. Kıyamet günü ise yalnız onlara mahsustur.» Aynı sûrenin 26'ncı âyet-i kerimesinde ise şöyle buyurulur: Âdem oğulları! Size avret mahallerinizi örten ve sizi süsleyen elbise indirdik. Takva elbisesi ise daha hayırlıdır.» Şu halde, elbise giymekten maksat, sadece vücudu örtmek değildir. Aynı zamanda vücuda yakışması gerekir. Ebû Hüreyre (radıyallahü anh)'ın Rivâyet ettiği bir hadisde güzel giyinen bir sahabi Resûlüllah (sallallahü aleyhi ve sellem)'ın huzuruna gelerek: Resûlallah! Ben güzelliğe aşık biriyim. Bana gördüğün güzellik verilmiştir. Ayakkabılarımın bağının güzelliğinde bile kimsenin beni geçmesini istemiyorum, bu kibir midir?» deyince, Resûlüllah (sallallahü aleyhi ve sellem): « Hayır bu, kibir değildir. Kibir benlikten dolayı hakkı inkâr etmek ve insanları küçük göstermektir.» buyurdu. Ebû Davud, K. el-Libas, B. macâe fü-Kibri",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1146
			}
		},
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1147
			}
		},
		{
			"hadithnumber": 1148,
			"arabicnumber": 1148,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1148
			}
		},
		{
			"hadithnumber": 1149,
			"arabicnumber": 1149,
			"text": "Kasım b. Muhammed şöyle derdi: Yapmadıkları bir şeyi konuşmayı sevmeyen insanlarla yaşadım. (Sahabeleri kast ediyor) Mâlik der ki: Kasım, bununla ameli kast etmiştir. Zira kişinin sözüne değil ameline bakılır. Nitekim Kur'an-ı Kerim'de şöyle buyurulmuştur: «Ey iman edenler! Niçin yapmıyacağınız şeyi söylüyorsunuz? Allah yanında en kötü şey, yapmıyacağınız şeyi söylemektir.» (Saff, 2-3)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1149
			}
		}
	]
}