{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"37": "Wills and Testaments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1455,
			"arabicnumber": 1455,
			"text": "Abdullah b. Ömer (r.a)'den rivayete göre, Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Vasiyet edilebilecek bir mal'a sahip olan Müslüman kişinin yanında vasiyeti yazılı olmadan iki gece geçirmesi doğru değildir.\" Diğer tahric: Buharı, Vesaya; Müslim, Vasiyet",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1455
			}
		},
		{
			"hadithnumber": 1456,
			"arabicnumber": 1456,
			"text": "Amr b. Süleym ez Züraki (r.a)'ın haber verdiğine göre, Ömer b. Hattab'a şöyle denildi: \"Burada akıl baliğ olmamış Gassanlı zengin bir çocuk var. Varisleri ise Şam'dadır. Burada yalnız bir amca kızı var, ne yapılması gerekir?\" Ömer b. Hattab şöyle dedi: \"Amcasının kızına vasiyette bulunsun, bu çocukta amca kızına Bi'r-i Cüşem denilen yeri vasiyet etti. Amr b. Süleym dedi ki: \"Bu malotuzbin dirheme satıldı, vasiyet ettiği amca kızı ise Ümmü Amr b. Süleym ez Züraki'dir.\" (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1456
			}
		},
		{
			"hadithnumber": 1457,
			"arabicnumber": 1457,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1457
			}
		},
		{
			"hadithnumber": 1458,
			"arabicnumber": 1458,
			"text": "Amir b. Sa'd b. ebi Vakkas (r.a.)'nın babasından rivayetle şöyle demiştir: \"Veda haccı senesi hastalığım ın artması üzerine Rasulullah Sallallahu Aleyhi ve Sellem beni ziyarete gelmişti. Ona: \"Ey Allah'ın Rasulü! Gördüğün gibi hastalığım çok şiddetlendi. Ben mal mülk sahibi biriyim. Kızımdan başka da varisim yok. Malımın üçte ikisini ona verebilir miyim?\" Rasulullah Sallallahu Aleyhi ve Sellem: \"Hayır\" dedi. Ben de: \"Peki yarısını verebilir miyim?\" dedim Yine: \"Hayır\" buyurdu. Sonra Rasulullah Sallallahu Aleyhi ve Sellem: \"Üçte birini verebilirsin; o da çoktur ama varislerini zengin bırakman, başkalarına el açacak durumda bırakmandan hayırlıdır. Allah'ın rızasını kazanmak için yapacağın her harcamadan dolayı ecir alırsın. Hatta hanımının ağzına koyduğun her lokmada bile ... \" Sa'd dedi ki: \"Ey Allah'ın Rasulü! Arkadaşlarım seninle Medine'ye gidecekler, ben burada kalacak mıyım?\" dedim. Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Hayır sen burada kalıp ölmeyeceksin, iyi ameller işleyeceksin, derecen yükselecek, Müslümanlar senden faydalanıp kafirler zarar görünceye kadar yaşayacaksın. Allah'ım! Ashabırnın hicretini tamamla onları gerisin geriye çevirme, fakat gerçekten üzülmesi gereken Sa'd b. Havle'dir.\" Rasulullah Sallallahu Aleyhi ve Sellem onun Mekke'de ölmesine üzüldü.\" Diğer tahric: Buharı, Cenaiz; Müslim, Vasiyyet",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1458
			}
		},
		{
			"hadithnumber": 1459,
			"arabicnumber": 1459,
			"text": "Hişam b. Urve (r.a)'ın babasından rivayete göre, kadınlaşmış ve erkekliği kalmamış bir kişi Nebi Sallallahu Aleyhi ve Sellem'in hanımı Ümmü Selerne'nin yanında iken Rasulullah Sallallahu Aleyhi ve Sellem o kimsenin şöyle dediğini duyuyordu: \"Ey Abdullah! Allah size Taif şehrini fethetmeyi nasib ederse Gaylan'ın kızına git, o kadın o kadar semiz ki önden bakınca dört kat, arkadan bakınca sekiz kat görünüyor.\" Bunun üzerine Rasulullah Sallallahu Aleyhi ve Sellem: \"Artık bunlar sizin yanınıza girmesinier\" buyurdu. Diğer tahric: Buhari, Meğazi; Müslim, Selam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1459
			}
		},
		{
			"hadithnumber": 1460,
			"arabicnumber": 1460,
			"text": "Yahya b. Said (r.a)'den rivayete göre, şöyle demiştir: \"Kasım b. Muhammed' den işittim şöyle diyordu: \"Ömer b. Hattab ensardan bir kadınla evliydi. Ondan Asım isminde bir oğlu oldu. Sonra ondan ayrıldı. Ömer Kuba'ya geldiğinde oğlu Asım'ı mescidin avlusunda oynarken gördü. Onu kucakladı. Hayvanının önüne onu oturttu. Bunun üzerine nenesi yetişti, çocuğu Ömer'den almak istedi. Oda vermedi, münakaşa ettiler. İkisi birlikte Ebu Bekir'in yanına geldiler. Ömer: \"Bu çocuk benim oğlum\" dedi. Kadında: \"Torunum\" dedi. Ebu Bekir ise Ömer' e: \"Çocukla ninesinin arasına girme\" dedi. Ravi diyor ki: \"Ömer bu işin üzerine düşmedi.\" * Yahya dedi ki: \"Malik'den işittim şöyle diyordu: \"Benimde uygulamam aynen böyledir.\" (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1460
			}
		},
		{
			"hadithnumber": 1461,
			"arabicnumber": 1461,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1461
			}
		},
		{
			"hadithnumber": 1462,
			"arabicnumber": 1462,
			"text": "Ömer b. Abdurrahman b. Delaf el Müzeni (r.a) babasından rivayet ederek şöyle demiştir: \"Cüheyne kabilesinden bir adam hacıları yarışmada geçer ve develeri onların ellerinden satın alır ve bu develerden kar sağlardı. Sonra yine yarış eder hacıları geçerdi. Daha sonraları bu kişi iflas etti. Durum Ömer b. Hattab'a aktarıldı. O da şöyle dedi: \"Bundan sonra ey insanlar Üseyfia, Cüheyne kabilesinin Üseyfiası dindar ve güvenilir olmak yerine hacıları geçti diye övülmesini isteyen bir kişidir. Şimdi bu şahıs borç alarak alışveriş yapmış borcunu ödemeye yaklaşmamıştır. Borcu bütün malını götürecek hale gelmiştir. Kim onda alacağı varsa yarın bize gelsin, malını alacaklılar arasında taksim edeceğiz. Borçlanmaktan sakının borcun önü üzüntü sonu da malın elinden alınmasıdır.\" (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1462
			}
		},
		{
			"hadithnumber": 1463,
			"arabicnumber": 1463,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1463
			}
		}
	]
}