{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"38": "Setting Free and Wala'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1464,
			"arabicnumber": 1464,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1464
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"text": "Muhammed b. Sirin (r.a.)'dan rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem zamanında bir adam ölürken altı kölesini azad etti. Rasulullah Sallallahu Aleyhi ve Sellem köleler arasında kura çekerek bu kölelerden üçte biri olan ikisinin azadını kabul etti. (Sadece İmam-! Malik'in Muvatla'ında geçmektedir.) * Malik der ki: \"Bu adamın kölelerden başka malı yoktu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1465
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": 1466,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1466
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": 1467,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1467
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": 1468,
			"text": "Abdullah b. Ömer (r.al'den rivayete göre, Ömer b. Hattab şöyle demiştir: \"Bir cariye efendisinden çocuk doğurursa efendisi onu satamaz. Bağışlayamaz ve miras olarak bırakamaz. Ondan faydalanır, efendi ölünce cariye hür olmuş olur.\" (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1468
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": 1469,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1469
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": 1470,
			"text": "Ömer b. Hakem (r.a)'den rivayete göre, şöyle demiştir: \"Rasulullah Sallallahu Aleyhi ve Sellem'e geldim ve şöyle dedim: \"Ey Allah'ın Rasulü, cariyem koyunlar güderdi. Yanıma geldiğinde koyunlardan biri kaybolmuştu, bu koyunu cariyeme sormuştum. O da kurt yedi dedi. Koyunu kurdun yemesine üzüldüm. Bende ademoğluyum, onun yüzüne tokat vurdum. Benim sadece bir cariyem var; onu azad edecek miyim? Rasulullah Sallallahu Aleyhi ve Sellem de cariyeme: \"Allah nerededir?\" dedi. O da: \"Göktedir\" dedi. Rasulullah Sallallahu Aleyhi ve Sellem: \"Ben kimim\" dedi. Cariye de: \"Sen Allah'ın Rasulüsün\" dedi. Bunun üzerine Rasulullah Sallallahu Aleyhi ve Sellem: \"Onu azad et\" buyurdu. (Sadece İmam-ı Malik'in Muvatta'mda geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1470
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": 1471,
			"text": "Ubeydullah b. Abdullah b. Utbe b. Mes'ud (r.a)'dan rivayete göre, ensardan bir adam siyah cariyesini Rasulullah Sallallahu Aleyhi ve Sellem'e getirerek şöyle dedi: \"Ey Allah'ın Rasulü! Benim bir mu'min cariyem var. Eğer bu cariyenin imanlı olduğu kanaatindeysen onu azad edeceğim.\" Rasulullah Sallallahu Aleyhi ve Sellem cariyeme: \"Allah'dan başka ilah olmadığına şahitlik ediyor musun?\" diye sordu. O da: \"Evet\" dedi. Rasulullah Sallallahu Aleyhi ve Sellem: \"Muhammed'in Allah'ın Rasulü olduğuna şahitlik ediyor musun?\" diye sordu. O da: \"Evet\" dedi. Rasulullah Sallallahu Aleyhi ve Sellem: \"Öldükten sonra dirilmeye inanıyor musun?\" diye sordu. O da: \"Evet\" diye cevap verdi. Bunun üzerine Rasulullah Sallallahu Aleyhi ve Sellem: \"Onu azad et\" buyurdu. (Sadece İmam-! Malik'in Muvatta'mda geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1471
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": 1472,
			"text": "Makburiy (r.a.)'den rivayete göre, şöyle demiştir: \"Ebu Hureyre'ye, bir köle: Azad etmesi gereken bir adam zina neticesi doğan bir çocuğu azad etse caiz olur mu?\" diye sordu. Ebu Hureyre'de: \"Evet caiz olur\" dedi. (Sadece İmam-! Malik'in Muvatta'mda geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1472
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": 1473,
			"text": "Malik (r.a.l'e ulaşan bilgilere göre ensardan Fedale b. Ubeyd Rasulullah Sallallahu Aleyhi ve Sellem'in ashabındandı. Ona bir köle: \"Azad etmesi gereken bir şahıs zinadan doğan çocuğu azad etse caiz midir?\" diye sordu. O da: \"Evet\" diye cevap verdi. (Sadece İmam-! Malik'in Muvatta'mda geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1473
			}
		},
		{
			"hadithnumber": 1474,
			"arabicnumber": 1474,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1474
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": 1475,
			"text": "Abdurrahman b. ebı Amre el EnsarI (r.a}'den rivayete göre, şöyle demiştir: \"Annem bir vasiyet etmek istedi ve bu işi sabaha bıraktı. Sabah olmadan da öldü. Köle azad etmeye niyetlenmişti. Abdurrahman dedi ki: Kasım b. Muhammed'e şöyle dedim: \"Annemin yerine köle azad etsem ona faydası olur mu?\" Kasım dedi ki: \"Sa'd b. Ubade Rasulullah Sallallahu Aleyhi ve Sellem'e şöyle demiştir: \"Annem öldü, onun adına köle azad etmenin ona faydası olur mu?\" diye sordu. Rasulullah Sallallahu Aleyhi ve Sellem de: \"Evet\" diye cevap verdi.\" (Sadece İmam-ı Malik'in Muvatla'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1475
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": 1476,
			"text": "Yahya b. Said (r.a)'den rivayete göre, şöyle demiştir: \"Abdurrahman b. ebı Bekir'in oğlu uykudayken öldü. Nebi Sallallahu Aleyhi ve Sellem'in hanımı Aişe (r.anha) onun adına bir çok köle azad etti.\" (Sadece İmam-! Malik'in Muvatta'ında geçmektedir.) * Malik der ki: \"Bu konuda duyduğum un en güzeli buduL",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1476
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": 1477,
			"text": "Nebi Sallallahu Aleyhi ve Sellem'in hanımı Aişe (Lanha)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem'a: \"Hangi köleyi azad etmek faziletlidir?\" diye soruldu. Rasulullah Sallallahu Aleyhi ve Sellem da: \"En pahalısı ve sahibinin yanında en kıymetli olanı\" diye cevap verdi. Diğer tahric: Buhari, Itk; Müslim, İman",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1477
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": 1478,
			"text": "Abdullah b. Ömer (r.a.)'den rivayete göre, bizzat kendisi zinadan olan çocuğu annesiyle birlikte azad etti. (Sadece İmam-! Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1478
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": 1479,
			"text": "Nebi Sallallahu Aleyhi ve Sellem'in hanımlarından Aişe (r.anha)'den rivayete göre, şöyle demiştir: \"Berire adlı cariye Aişe'ye gelerek şöyle dedi: \"Ben efendimle mükatebe anlaşması yaptım. Her sene bir ukiyye vermek üzere toplam dokuz ukiyye vereceğim. Bana yardım et. Bunun üzerine Aişe şöyle dedi: \"Vela hakkın bana ait olmak şartıyla efendilerin senin yerine benim peşin olarak vermeme razı olurlarsa sana para verir ve seni azad ederim. Bunun üzerine Berire efendilerinin yanına gitti. Onların yanından gelince bana şöyle dedi: \"RasuluIlah Sallallahu Aleyhi ve Sellem da benim yanımda oturuyordu ve şöyle dedi: \"Bana söylediğini efendilerime anlattım. Velanın sana ait olmasını kabul etmediler. RasuluIlah Sallallahu Aleyhi ve Sellem konuşmamızı duydu ve meseleyi sordu. Bende ona anlattım. Bunun üzerine Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"O cariyeyi satın al ve velasının sana aid olmasını şart koş. Çünkü vela azad eden kimseye aittir.\" Aişe aynen yaptı, sonra RasuluIlah Sallallahu Aleyhi ve Sellem cemaat içinde ayağa kalkarak hamdü sena etti ve şöyle buyurdu: \"Ne oluyor bu insanlara Allah'ın Kitabı'nda olmayan her şart yüz tane de olsa hükümsüzdür. Allah'ın koyduğu hüküm daha layıktır ve en güvenilen şart Allah'ın koyduğu şarttır. Vela hakkı sadece azad edene aittir.\" Diğer tahric: Buhari, Buyu'; Müslim, ltk",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1479
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": 1480,
			"text": "Abdullah İbn-i Ömer (r.a)'den rivayete göre, mu'minlerin annesi Aişe bir cariye satın alıp azad etmek istedi. Cariyenin efendileri şöyle dediler: \"Vela hakkı bize ait olmak üzere satabiliriz. Aişe durumu RasuluIlah Sallallahu Aleyhi ve Sellem'a anlattı. O da şöyle buyurdu: \"Bu şart koşmak vela hakkının sana ait olmasına engelolmaz; çünkü vela hakkı azad edene aittir.\" Diğer tahric: Buhari, Buyu'; Müslim, ltk",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1480
			}
		},
		{
			"hadithnumber": 1481,
			"arabicnumber": 1481,
			"text": "Amre binti Abdurrahman (r.a)'dan rivayete göre, Berire mu'minlerin annesi Aişe'ye yardım istemeye geldi. Aişe de ona şöyle dedi: \"Eğer efendilerin bedelini bir defada verip seni azad etmemi kabul ederlerse seni azad edeyim.\" Berire durumu efendilerine anlattı. Onlarda şöyle dediler: \"Vela hakkın bize ait olmazsa kabul etmeyiz.\" * Yahya dedi ki: \"Hadisi rivayet eden Amre şöyle aktardı: \"Sanıyorum ki Aişe bu meseleyi RasuluIlah Sallallahu Aleyhi ve Sellem'a anlattı. RasuluIlah Sallallahu Aleyhi ve Sellem de şöyle buyurdu: \"Onu satın al ve azad et; çünkü vela hakkı azad edene aittir.\" Diğer tahric: Buhaıi, Mukateb",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1481
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": 1482,
			"text": "Abdullah b. Ömer (r.a)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem vela hakkını satmayı ve bağışlamayı yasakladı. Diğer tahric: Buhari, Itk; Müs!im, Itk",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1482
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": 1483,
			"text": "Rebia b. Abdurrahman {r.a)'dan rivayete göre, Zübeyr b. Awam bir köle satın alarak azad etti. Bu kölenin de hür bir kadından olma erkek çocukları vardı. Zübeyr köleyi azad edince: \"Çocukların vela hakkı bana aittir\" dedi. Çocukların annesini daha önce azad eden efendiler: \"Hayır onların hakkı bize aittir\" dediler. Bunun üzerine Osman b. Affan'a götürdüler. Osman'da çocukların vela hakkının Zübeyr' e ait olduğuna hükmetti.\" (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1483
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1484
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": 1485,
			"text": "Abdurrahman b. Haris b. Hişam (r.a)'ın babasından naklettiğine göre Asi' b. Hişam öldü ve geride üç oğlunu bıraktı. Bunların ikisi anne baba bir diğeri baba bir kardeşti. Anne baba bir kardeşlerden biri öldü ve geride mal ve azad edilmiş köleler bıraktı. Anne baba bir kardeşi bu mala ve azad edilmiş kölelerin vela hakkına varis oldu. Sonra bu çocuk öldü, geride bir oğlu, bir baba ve bir kardeşini bıraktı. Oğlu şöyle dedi: \"Babamın hissesine düşen mal ve azad edilmiş kölelerin vela hakkı benim hisseme düşmüştür.\" Kardeşi de: \"Hayır öyle değil, senin hissene sadece mal düşmüştür. Azadlı kölelerin vela hakkı sana düşmemiştir. Kardeşim bugün ölseydi ben ona varis olamaz mıydım? Kendi aralarında anlaşamayınca Osman b. Affan'ın huzurunda mahkeme oldular. O da azadlı kölelerin velasının kardeşine düştüğüne karar verdi.\" (Sadece İmam-ı Maıik'in Muvatla'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1485
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": 1486,
			"text": "Abdullah b. ebi Bekir b. Hazm (r.a)'ın haber verdiğine göre, babası Eban b. Osman'ın yanında otururken Cüheyne kabilesinden bir grup insanla Haris b. Hazreç oğullarından bir grup insan mahkeme oldular. Cüheyneli bir kadın Haris b. Hazreçoğullarından İbrahim b. Küleyb adlı bir adamla evli idi ve kadın ölmüş geride mal ve azad edilmiş köleler bırakmış ve bu kadına oğul ile kocası varis olmuşlardı. Bu çocuk ölünce varisler şöyle dediler: \"Bu çocuğa annesinden düşmüş olan kölelerin ve la hakkı bizimdir. Cüheyne kabilesinden olanlar ise o azadlı köleler bizim kızımızındır. çocuğu ölünce onların velası bizim olur. Onlara biz varis oluruz.\" Eban ise azadlı kölelerin velasımn Cüheyne kabilesinden olanlara ait olduğuna karar verdi. (Sadece İmam-ı Malik'in Muvatla'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1486
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": 1487,
			"text": "Malik (r.a)'den aktarıldığma göre, Said b. Müseyyeb şöyle demiştir: \"Bir adam ölür, geride üç oğlunu ve azad etmiş olduğu kölelerin vela hakkını bırakır. Sonra oğullarından ikisi ölür geride çocuklarım bırakır. Bu üç çocuktan hayatta kalan azadlı kölelerin vela hakkına var is olur. O ölünce de kendi çocukları ile kardeşinin çocukları vela hakkına varis olurlar.\" (Sadece İmam-ı Malik'in Muvatla'ında geçmektediL)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1487
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": 1488,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1488
			}
		}
	]
}