{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"42": "Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1537,
			"arabicnumber": 1537,
			"text": "Yezid oğlu Saib şöyle rivayet etti: Ömer b. Hattab (r.a.) yanımıza gelerek: «Falan kimsede içki kokusu buldum. Bunun kaynatılmış üzüm şırası olduğunu iddia ediyor. İçtiği şeyi sorup araştıracağım. Şayet sarhoş ediyorsa onu kırbaçhyacağım» dedi. Bunu araştırdı, içki olduğunu öğrenince ona seksen kırbaç vurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1537
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": 1538,
			"text": "Sevr oğlu Zeyd ed-Dîlî'den: Ömer b. Hattab kişinin içtiği hamr (içki) konusunda insanların fikrini sorunca Hz. Ali (r.a.): «Ona seksen kırbaç vurma görüşündeyiz. Çünkü bu adam içince sarhoş olur; sarhoş olunca da saçmalamaya başlar; saçmalayınca ise iftira eder.» Bunun üzerine Ömer (r.a.)'de içki içenlere seksen kırbaç vurmaya başladı",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1538
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": 1539,
			"text": "İbn Şihab'dan: Benden hamr (içki) içen köleye verilecek ceza sorulunca: «Bana rivayet edildiğine göre, hür kimsenin cezasının yarısı verilir. Ömer b. Hattab, Osman b. Affan ve Abdullah b. Ömer, içki içen kölelerine, içki içen hür kimselerin cezasının yarısı kadar kırbaç vururlardı» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1539
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": 1540,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1540
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": 1541,
			"text": "Abdullah b. Ömer'den: Resulullah Sallallahu Aleyhi ve Sellem, gazvelerinin birinde insanlara hitabede bulundu. Ben de süratle kendisine doğru gittim. Fakat ben yanına varmadan hutbesini bitirdi. Oradakilere Nebi s.a.v. ne söyledi diye sorduğumda: Kabak ve ziftli kab içerisinde şıra bırakılmasını yasakladı, denildi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1541
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": 1542,
			"text": "Ebu Hureyre (r.a.)'den: «Resulullah Sallallahu Aleyhi ve Sellem kabak ve ziftli kab içerisinde şıra bırakılmasını yasakladı»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1542
			}
		},
		{
			"hadithnumber": 1543,
			"arabicnumber": 1543,
			"text": "Ata b. Yesar'dan: «Resulullah Sallallahu Aleyhi ve Sellem koruk hurma ile olgunlaşmış taze hurmanın ve kuru hurma ile kuru üzümün aynı kabda şıra yapılmasını yasakladı.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1543
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": 1544,
			"text": "Ebu Katade el-Ensarî'den: «Resulullah Sallallahu Aleyhi ve Sellem kuru hurma şırası ile kuru üzüm şırasının ve taze hurma şırası ile alacalı ko­ruk hurma şırasının kanştırılarakiçilmesini yasakladı.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1544
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "Nebi s.a.v.'in zevcesi Aişe r.anha'dan: Resulullah Sallallahu Aleyhi ve Sellem'e Bid’ (bal şerbeti) nin hükmü sorulunca: «Sarhoş edici her içki haramdır» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1545
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": 1546,
			"text": "Ata b. Yesar'dan: Resulullah Sallallahu Aleyhi ve Sellem'e ğubeyra’ (darı şırası) nın hükmü sorulunca: «Onda hayır yoktur» dedi ve içilmesini yasakladı. İmam Malik der ki: Zeyd b. Eslem'e: «— Gubeyra' nedir?» diye sordum da: «— Uskerke (Habeşlilerin darıdan yaptıkları bir çeşit şarap)» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1546
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": 1547,
			"text": "Abdullah b. Ömer (r.a.)'den: Resulullah Sallallahu Aleyhi ve Sellem: «Kim bu dünyada içki içer de tevbe etmezse, ahirette cennet şarabından mahrum olur» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1547
			}
		},
		{
			"hadithnumber": 1548,
			"arabicnumber": 1548,
			"text": "İbni Vale el-Mısrî'den: Abdullah b. Abbas (r.a.) üzümden sıkılan şıranın hükmünü sorduğumda şunları anlattı. «Bir adam Resulullah Sallallahu Aleyhi ve Sellem'e içi şarap dolu bir kırba hediye edince, Resulullah Sallallahu Aleyhi ve Sellem: «—Bunu Allah'ın haram kıldığını bilmiyor musun?» buyurdu. Adam: «— Hayır» deyince, yanında bulunan biri ona gizlice bir şey söyledi. Resulullah Sallallahu Aleyhi ve Sellem: «— Onunla gizlice ne konuştun?» buyurdu. Adam: «— Şarabı satmasını söyledim» dedi. Bunun üzerine Resulul­lah Sallallahu Aleyhi ve Sellem ona: «— İçilmesini haram kılan Allah, satılmasını da haram kıldı» buyurunca, adam şarap dolu iki kırbanın ağzını açtı, içlerindeki şarabın hepsi aktı gitti",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1548
			}
		},
		{
			"hadithnumber": 1549,
			"arabicnumber": 1549,
			"text": "Enes b. Malik (r.a.)'den: Ebu Ubeyde b. el-Cerrah'a, Ebu Talha el-Ensarî'ye ve Ubey b. Ka'b (r.a.)'e hurma koruğu ile kuru hurmadan yapılmış içki dağıtıyordum. O sırada biri gelip: «— Şarap haram kılındı» deyince, Ebu Talha: «— Ey Enes! Kalk şu şarap testisini kır» dedi. Hemen kalktım, havanı aldım, şarap testisine vurdum. Testi param parça oldu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1549
			}
		},
		{
			"hadithnumber": 1550,
			"arabicnumber": 1550,
			"text": "Lebid oğlu Mahmud el-Ensarî'den: Ömer b. Hattab, Şam'a gelince, Şam halkı oranın havasının ağırlığından ve veba hastalığından şikayet ederek: «Bizi ancak şu içki iyileştiriyor» dediler. Ömer (r.a.): «— Şu bal şerbetini için» deyince, onlar: «— Bal bizi iyileştirmiyor» dediler, içlerinden biri de Hz. Ömer (r.a.)'e: «— Sen bu bal'dan sarhoş etmeyen bir şarap mı yapmamızı istiyorsun?» deyince, Hz. Ömer: «-— Evet» dedi. Onlar da üçte ikisi gidip biri kalıncaya kadar bal kaynatıp Hz. Ömer (r.a.)'e getirdiler Ömer (r.a.) parmağını şerbete batınp çıkarınca şerbet sünmeye başladı. Bunun üzerine Ömer (r.a.): «— Bu kaynatılmış üzüm şırası gibidir. Develere sürülen katran gibi katılaşmış» dedi ve bunu içmelerine müsaade etti. Ubade b. Samit, Ömer (r.a.)'e:» «— Vallahu bunu sen helal kıldın» deyince, Hz. Ömer (r.a.): «— Hayır! Vallahi» dedi. (ve şöyle dua etti): «Ey Allah'ım senin bunlara haram kıldığın hiçbir şeyi ben helal kılmıyorum. Senin helal kıldığın hiçbir şeyi de bunlara haram kılmıyorum.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1550
			}
		},
		{
			"hadithnumber": 1551,
			"arabicnumber": 1551,
			"text": "Abdullah b. Ömer (r.a.)'dan: Irak halkından bir grup insan bana: «— Ya Eba Abdurrahman, biz üzüm ve hurma alıp bunu şarap yaparak satıyoruz» dediler. Ben de: «— Size Allah'ı, meleklerini, insanları ve cinleri şahit tutuyorum ki bunu alıp satnrınızı. şarap yapmanızı, içmenizi, sakalık .yapmanızı size emretmiyorum. Çünkü bu şeytan işi, iğrenç bir şeyedir.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1551
			}
		}
	]
}