{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1552,
			"arabicnumber": 1552,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1552
			}
		},
		{
			"hadithnumber": 1553,
			"arabicnumber": 1553,
			"text": "Malik'e şöyle rivayet edildi: Ömer b. Hattab (r.a.) diyeti köylülerin durumuna göre takdir etti; altın sahibine bin dinar, gümüş sahibine ise oniki bin dirhem diyet vermeye hükmetti. İmam Malik der ki: Altın sahibi Şam ve Mısır halkı, gümüş sahibi ise Irak halkıdır. Diyet üç veya dört sene içerisinde taksit taksit ödenir. Üç sene içerisinde ödenmesi bana göre daha iyidir. Köy ve kasabalarda yaşayanlardan diyet olarak deve, göçebeler­den de altın ve gümüş alınmaz. Yine böylece altın sahibinden gü­müş, gümüş sahibinden de altın alınmaz",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1553
			}
		},
		{
			"hadithnumber": 1554,
			"arabicnumber": 1554,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1554
			}
		},
		{
			"hadithnumber": 1555,
			"arabicnumber": 1555,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1555
			}
		},
		{
			"hadithnumber": 1556,
			"arabicnumber": 1556,
			"text": "Malik oğlu Irak ve Süleyman b. Yesar'dan: Sa'd b. Leys oğullarından bir adam atını koşturdu. Cüheyne kabilesinden bir adam'ın parmağına bastı, yaraladı. Kan kaybından adam öldü. Mesele Hz. Ömer (r.a.)'e arzedilince, Ömer (r.a.) at sahibinin yakınlarına: «— Adamın parmağının kanamasından ölmediğine dair elli yemin eder misiniz?» deyince, onlar yemin edip günaha girmekten kaçındılar. Sonra ölenin yakınlarına: «— Siz kan kaybından öldüğüne yemin eder misiniz?» dedi. Onlar da yeminden çekindiler. Bunun üzerine Hz. Ömer (r.a.) Sa'dilerin yarım diyet vermesine hükmetti. İmam Malik der ki: Tatbikat böyle değildir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1556
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": 1557,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1557
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "Said b. Museyyeb'den şöyle rivayet edildi: Diyetin üçte biri miktarına ulaşıncaya kadar kadının azalarının diyeti erkeğinki gibidir. Kadının parmağının diyeti, erkeğin parmağı, dişi, erkeğin dişi, baş ve yüzdeki kemiğe kadar işleyen yaralarda ve kemiklerde arıza yapan yaralamalarda da kadın erkek gibidir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1558
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": 1559,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1559
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1560
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": 1561,
			"text": "Ebu Hureyre (r.a.)'den: Huzeyl kabilesinden iki kadın (dövüştüler). Bunlardan biri diğerine bir taş atıp vurdu. O da karnındaki cenini (ölü olarak) düşürdü. Resulullah Sallallahu Aleyhi ve Sellem, bu ceninin diyeti hakkında, bir köle veya cariye (gurre) verilmesine hükmetti",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1561
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": 1562,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1562
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1563
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": 1564,
			"text": "Said b. Museyyeb'in şöyle dediği rivayet edildi: îki dudak için tam diyet gerekir. Alt dudak kesilirse, diyeti, tanı diyetin üçte ikisidir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1564
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": 1565,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1565
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": 1566,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1566
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "Yesar oğlu Süleyman'dan: Kemiğe kadar işleyen yüzdeki ya­ralamanın diyeti, baş kemiğine kadar ulaşan yaralama diyeti gi­bidir. Ancak yara yüzde kusur bırakırsa, o zaman yüzün diyetine başdaki yaranın diyetinin yarısı kadar daha ilave edilir. Böylece diyetin miktarı, yetmişbeş dinar olur. İmam Malik der ki: Beyne kadar ulaşmıyan yaralama halle­rinde diyet onbeş devedir. Eti kemikten alan ve beyne kadar ulaş­mayan yara, başta ve yüzde olur. îmam Malik der ki: Beyne ve karın boşluğuna ulaşan yarala­mada kısas gerekmez. Nitekim tbn Şihab da, «beyne kadar ulaşan yaralamada kısas yoktur» demiştir. îmam Malik der ki: Kemiği kırıp beyne ulaşan yaralama an­cak kafada olur. îmam Malik der ki: Baş ve yüzdeki kemiği meydana çıkarma­yan ufak yaralamalarda diyet yoktur. Diyet kemiğe kadar işleyen ve daha büyük yaralamalarda vardır. Çünkü peygamber efendi­miz (s.a.v.) Amr b. Hazm'a diyetlerle ilgili yazdığı fermanda en son olarak kemiğe kadar işleyen yaralamayı zikretmiş ve diyetini beş deve takdir etmiştir. Ne eski ve ne de yeni hiçbir halife kemiğe kadar işlemeyen küçük yaralar için diyete hükmetmemişlerdir. Said b. Müseyyeb: «İnsanın herhangi bir uzvunda açılan yara için o uzvun diyetinin üçte biri gerekir» dedi. îmam Malik der ki; İbn Şihab böyle ufak yaralamalarda diyet gerekmeyeceği görüşünde idi. Bana göre de, bu gibi hallerde üze­rinde ittifak edilmiş belirli bir diyet yoktur. Fakat hakimin diyet takdir edebileceği görüşündeyim. İmam Malik der ki: Bize göre, beyne kadar ulaşan yaralama, yüz ve baş kemiklerinin yaralanması, yaranın eti sıyırarak kemi­ğin meydana çıkması başta ve yüzde olunca belirtilen diyet vardır. Vücudun diğer yerlerindeki yaralamalarda hüküm, hakimin tak­dirine bırakılır. imam Malik der ki: Alt çene kemiği ile burun kemiği başdan değildir. Müstakil iki ayrı kemikdirler. Bunların yaralanma­sında diyet olmadığı görüşündeyim. Baş kemiği bunların dışında müstakildir. Ebu Abdurrahman oğlu Rabia'dan «Abdulah b. Zübeyr baş ke­miğinin yaralanmasında kısas yaptı",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1567
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1568
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": 1569,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1569
			}
		},
		{
			"hadithnumber": 1570,
			"arabicnumber": 1570,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1570
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": 1571,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1571
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "Ömer b. Hattab'm azadlı kölesi Eslem'den: Ömer b. Hattab öğütücü dişe, köprücük kemiğine ve kaburga kemiklerine diyet olarak birer deve takdir etti",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1572
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": 1573,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1573
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": 1574,
			"text": "Said b. Müseyyeb'den; Ömer b. Hattab öğütücü dişler (azı diş­leri) için birer deve ve Muaviye b. Ebi Süfyan beşer deve diyete hükmederdi. Diyet, Ömer b. Hattab'ın hükmüne göre az, Muavi-ye'nin hükmüne göre ise çok oluyor. Ben hüküm verecek olsaydım, öğütücü dişlerin her biri için ikişer deve takdir ederdim. Her icti-had eden sevap kazanır.Said b. Müseyyeb'in şöyle dediği rivayet edildi: «Dişe vurulup simsiyah kesilir (iş görmeyecek hale gelirse), tam diyeti gerekir. Siyahlaştıktan sonra çıkarsa, o zaman yine bir tam diyeti daha ge­rekir.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1574
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": 1575,
			"text": "Tarîf oğlu Ebu Gatafan el-Mürrî'den: Mervan b. Hakem beni (hataen çıkarılan) öğütücü dişlerin diyetini sormam için Abdullah b. Abbas'a gönderdi. (Ben de gidip sorunca) Abdullah b. Abbas (r.a.) «— Öğütücü dişin diyeti beş devedir» dedi. (Hükmü Mervan b. Hakem'e ilettiğimde) beni tekrar Abdullah b. Abbas'a gönderip ona Mervan'ın: «— Sen öndeki kesici dişleri öğütücü dişler gibi mi sayıyor­sun?» sözünü iletince, îbn Abbas: «— Bunu parmaklara kıyas etmen gerekir. (Yaptıkları iş fark­lı olsa da) diyetleri eşittir» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1575
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": 1576,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1576
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": 1577,
			"text": "îmam Malik'e rivayet edildiğine göre, Said b. Müseyyeb ve Sü­leyman b. Yesar: «Kölenin yüz ve başındaki kemiğe kadar işleyen yaranın diyeti, kendi değerinin yirmide biri kadardır» derlerdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1577
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": 1578,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1578
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": 1579,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1579
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": 1580,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1580
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": 1581,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1581
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1582
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": 1584,
			"text": "İmâm-ı Mâlik der ki: Bir arazide müsakat, —akit esnasında— bulunduğu durum üzerine yapılır. sahibi eğer orada hizmet gören kölelerden birini çıkarmayı istiyorsa, onu müsakat anlaşmasından önce yapsın. Bundan sonra dilerse müsakat anlaşması yapsın. biri ölür, kaybolur veya hastalanırsa, mal sahibinin onun yerine başkasını getirmesi gerekir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1584
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": 1585,
			"text": "İbn Şihab anlatıyor: Ömer b. Hattab (r.a,), Mina'da, insanlardan kim diyetle ilgili bir şey biliyorsa, kendisine haber vermesini isteyince, Süfyan oğlu Dahhak el-Kilabî kalkıp: «Resulullah Sallallahu Aleyhi ve Sellem bana Eşyem ed-Dıbabî'nin karısını kocasının diyetinden mirasçı kılmamı yazdı» dedi. Bunun üzerine Hz. Ömer (r.a.): «Çadıra gir, gelip seninle görüşeceğim» dedi. Dahhak çadıra girdi. Hz. Ömer (r.a.) yanına gelince Dahhak bildiğini ona haber verdi. Hz. Ömer (r.a.)'da buna göre hükmetti (kocalarının diyetine kadınları mirasçı kıldı). İbn Şihab: «Eşyem, hata yoluyla öldürülmüştü» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1585
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": 1586,
			"text": "Amr b. Şuayb (r.a)'dan riviıyete göre, Müdlic oğullarından Katade isimli bir adam kılıcını atınca oğlunun bacağına isabet etti ve fazla kan kaybından öldü. Süraka b. Cüşum Ömer' e gelip durumu arzetti. Ömer de ona: \"Git ben yanına gelinceye kadar Kudeys suyunun başındaki develerden yüz yirmi tane say dedi. Süraka gidip saydı. Ömer oraya gelince bu develerden otuz tane dört yaşına, otuz tane beş yaşına basmış dişi deve ile kırk adet gebe deveyi ayırıp şöyle dedi: \"Ölünün kardeşi nerede?\" Orada bulunan ölünün kardeşi: \"İşte buradayım\" deyince Ömer: \"Bu develeri al çünkü Rasulullah Sallallahu Aleyhi ve Sellem: \"Oğlunu öldüren adamın diyet vermesi gerekmez\" dedi. (Sadece İmam-! Malik'in Muvatla'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1586
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": 1587,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1587
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": 1588,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1588
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": 1589,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1589
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": 1590,
			"text": "Said b. Museyyeb'den: Ömer b. Hattab (r.a.) bir adamı pusu kurup tuzağa düşürerek öldüren beş veya yedi kişiyi öldürdü ve: «Bütün San'a halkı bu suça iştirak etmiş olsaydı hepsini öldürürdüm» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1590
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": 1591,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1591
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": 1592,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1592
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": 1593,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1593
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": 1594,
			"text": "Malik der ki: Bize göre ittifakla kabul edilen hüküm şu­dur: Kasden birinin el ve ayağını kıran kimsenin cezası diyet değil kısastır. Malik der ki: Yaraladığı kimsenin yarası iyileşinceye kadar hiç bir kimseye kısas yapılmaz. Yara iyileşince kısas yapı­lır. Kısas yapılan kimsenin yarası iyileşince, yaraladığı kimsenin yarası gibi olursa bu kısasdır. Fakat kısas yapılanın yarası daha fazla olur veya ölürse, önce yaralanıp kısas talep edene bir şey ge­rekmez. Kısas yapılan kimsenin yarası iyileşir de yaraladığı kim­se çolak kalır veya yarasının yerinde iz ve kusur kalırsa, ikinci de­fa kısas yapılmaz. Malik der ki: Fakat ona, elinin ilk halinden yaranın meydana getirdiği noksanlık kadar diyet verilir (tazminat öde­nir). Vücuttaki yaraların durumu da böyledir. Malik der ki; Bir kimse kasden vurup karısının gözünü çakarsa, yahut kolunu kusa, ya da parmağını kesse veya buna benzer şeyler yapsa kısas yapılır. Fakat koca karısına kasden iple veya çubukla vursa da arzu etmediği bir yaralama meydana gelse diyetini verir, kısas yapılmaz. Malik'e rivayet edildiğine göre Hazm oğlu Amr oğlu Muhammed oğlu Ebu Bekir uyluğun kırılmasında kısas yaptı",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1594
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": 1595,
			"text": "Süleyman b. Yesar'dan: Hacılardan birinin azad ettiği köle aiz oğullarından bir adam'ın oğlunu Öldürdü. Maktul'ün babası, oğlunun diyetini istemek için Ömer b. Hattab'a şikayete gidince, Ömer b. Hattab: «— Ona diyet gerekmez» dedi. Adam: «— Oğlum onu öldürseydi neye hükmederdin?» deyince, Hz. Ömer: «— O zaman diyetini verirdiniz» dedi. Bunun üzerine adam: «— O halde bu yılan gibidir, onu bırakırsan sokar, öldürürsen intikam alır» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1595
			}
		}
	]
}