{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"50": "The Evil Eye"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "Sehl b. Huneyf'in torunu Muhammed b. Ebi Ümame'den: Babamın şöyle dediğini duydum: «— Babam, Sehl b. Huneyf, Harrar'da gusül yaptı. Üzerindeki cübbesini çıkarmıştı. Amir b. Rebîa da bakıyordu. Sehl, cildi güzel, beyaz bir adamdı.» Ebu Ümame devamla diyor ki, amir b. Rebia ona: «— Bakirelerin cildi bile bugün gördüğüm gibi değildir.» de­yince Sehl olduğu yere yıkıldı, elem ve acıları şiddetlendi. Resulullah Sallallahu Aleyhi ve Sellem'e: «— Sehl rahatsızlandı, seninle gidemiyecek.» dediler. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem Sehl'in yanına gidince ona amir'in kendine bakışını ve dediklerini anlattı.» Resulullah Sallallahu Aleyhi ve Sellem de (amire hitaben): «— Siz'den biri kardeşini neden öldürüyor? Allah mubarek kılsın demeliydin! Göz değmesi vakidir; onun için (Sehl için) abdest al.» dedi. Amir de onun (iyileşmesi) için abdest alınca Sehl Resulullah Sallallahu Aleyhi ve Sellem ile beraber gitti, hiçbir şikayeti kalmadı, rahatladı",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1711
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "Sehl b. Huneyf'in oğlu Ebu Ümame'den: amir b. Rebia, Sehl b. Huneyf i gusül yaparken gördü ve: «— Hiç güneş görmeyen ciltler bile bugünki gördüğüm gibi de­ğildir, demesiyle Sehl yıkıldı. Resulullah Sallallahu Aleyhi ve Sellem'e gelerek: «— Ya Resulullah, Sehl b. Huneyf hakkında yapacak bir şeyin var mı? Vallahi başını kaldıramıyor.» dediler. Resulullah Sallallahu Aleyhi ve Sellem: «— (Ona nazar eden) birini itham ediyor musunuz?» diye sorduğunda: «— Amir b. Rehia'yı itham ediyoruz.» dediler. Resulullah Sallallahu Aleyhi ve Sellem Amir'i çağırarak kızdı ve: «— Sizden biri kardeşini neden (gözle) öldürüyor? Ona bereketle dua etseydin ya! Şimdi onun için yıkan.» dedi. Amir de yüzünü, ellerini, dirsek ve dizlerini, ayak topuklarını ve böğürlerini bir kab içersinde yıkadı. Sonra (O su) Sehl'in üzerine döküldü. Sehl de iyileşerek oradakilerle beraber gitti, hiç bir şikayeti kalmadı. BU HADİS’İN İBN-İ HİBBAN’DAKİ RİVAYETİ VE ABDEST TARİFİ İÇİN BURAYA TIKLAYIN",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1712
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "Humeyd b. Kays'dan: Cafer b. Ebi Talib'in iki oğlu Resulullah Sallallahu Aleyhi ve Sellem'in huzuruna getirildiğinde onların bakıcılarına (dadılarına): «— Bunları zayıf görüyorum, neden?» diye sordu. O da: «— Ya Resulullah, onlara göz değiyor. Uygun görüp görmüyeceğini bilmediğimiz için onları okutmadık.» deyince Resulullah Sallallahu Aleyhi ve Sellem: «— Onları okutunuz, çünkü eğer kaderin önüne birşey geçecek olsaydı bu, nazar olurdu.» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1713
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "Urve b. Zübeyr (r.a.) den: Resulullah Sallallahu Aleyhi ve Sellem hanımı Ümmü Seleme'nin evine girdi. Orada bir çocuk ağlıyordu. Ona göz değdiğini söylediklerinde Resuîullah Sallallahu Aleyhi ve Sellem: «— Ona göz değmesinden (korunmak) için okutsaydınız.» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1714
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "Ata’ b. Yesar'dan: Resuluîlah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Kul hastalandığı zaman Allah Teala ona iki melek gönderir ve der ki: «— Bakınız, ziyaretçilerine ne söylüyor?» Eğer hasta, ziyaretçiler geldiğinde Allah'a hamdü sena ediyorsa melekler bunu her şeyi iyi bilen Aziz ve Celil olan Allah'a ulaştırırlar. Bunun üzerine Allah da şöyle buyurur: «— Eğer o kulumu öldürürsem cennete koyarım. Şifa verir iyileştirirsem ona hastalığından dolayı zayi ettiği etinden ve kanından daha hayırlısını halk ederim, günahlarını da bağışlarım.» İbn Abdilber, Abbad b. Kesir el-Mekkî yoluyla mevsul rivayet etmiştir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1715
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "Urve b. Zübeyr der ki: Resuluîlah Sallallahu Aleyhi ve Sellem'in hanımı Aişe r.anha'nın şöyle dediğini işittim: Resuluîlah Sallallahu Aleyhi ve Sellem: «Bir diken batması bile olsa mu'min uğradığı bütün musibetlerin mükafaatını görür,» yahut da «karşılaştığı sıkıntılar hatalarına keffaret olur.» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1716
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "Ebu Hureyre (r.a.) den: Resuluîlah Sallallahu Aleyhi ve Sellem şöyle buyurdu: «Allah kimin hayırlı olmasını isterse, onu musibete uğratır.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1717
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "Yahya b. Said'den: Resuluîlah Sallallahu Aleyhi ve Sellem zamanına ölen bir zat hakkında birisi: «— Ne mutlu ona! Bir hastalığa tutulmadan vefat etti.» dediğinde, Resuluîlah Sallallahu Aleyhi ve Sellem: «— Vah yazık! Bilmiyorsun ki eğer Allah onu bir hastalığa müptela kılsaydı, onu günahlarına kefaret kılardı.» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1718
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "Osman b. Ebİ'l-As (r.a.) şöyle anlatır: Resulullah Sallallahu Aleyhi ve Sellem'e geldim. Ağrımdan kıvranıyordum. Bu halimi gören Resulullah Sallallahu Aleyhi ve Sellem: «Duyduğum ağrının şerrinden Allah Teala'nın kudret ve azametine sığınıyorum, diyerek ağrıyan yeri yedi kere sıvazla» buyurdu. Ben de böyle yaptım. Allah hastalığımı giderdi. O günden beri aileme ve başkalarına öyle (yapmalarını) tavsiye ediyorum",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1719
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "Aişe r.anha'dan: Resulullah Sallallahu Aleyhi ve Sellem hastalandığı zaman kendi kendisine muavvizeteyn -felak ve nas surelerini- okur ve üflerdi. Ağrısı şiddetlendiği zaman da ona ben okur, bereketini umarak kendisinin sağ eliyle ağrının üzerine meshederdim",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1720
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "Abdurrahman'ın kızı Amr'e (r.a.) şöyle rivayet etti: Ebu Bekr (r.a.), Hz. Aişe r.anha'nın huzuruna girdi. O hastaydı. Bir yahudi kadını da ona okuyordu. Ebu Bekr (r.a.): «— Ona, Allah'ın kitabından oku» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1721
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "Zeyd b. Eslem şunları anlattı: Resululîah Sallallahu Aleyhi ve Sellem zamanında bir İçişi yaralandı ve çok kan kaybetti. Bu adam, Enmar oğullarından kendisine bakacak iki kişi çağırdı. Bunların anlattığına göre, Resuluîlah Sallallahu Aleyhi ve Sellem kendilerine: «— Tıbbı hanginiz daha iyi biliyor?» diye sorduğunda onlar da: «— Tıb'da (tıbbî müdahalere) bir fayda var mı, ya Resulallah?» dediler. (Bunun üzerine) Zeyd'in ifadesine göre, Resululîah Sallallahu Aleyhi ve Sellem: «— Hastalıkları indiren, deva ve çarelerini de indirmiştir.» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Isnaad Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1722
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "Yahya b. Said der ki: Bana Resululîah Sallallahu Aleyhi ve Sellem zamanında, Sa'd b. Zürare'nin boğazmdaki iltihab bağlamasından öldüğü rivayet edildi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1723
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "Nafi der ki: Abdullah b. Ömer (r.a.) yüz felcini dağladı ve akrep (sokmasına) karşı okundu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1724
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "Münzir'in kızı Fatıma der ki: Ebu Bekir'in kızı Esma'ya sıtmaya yakalanıp çaresini arayan bir kadın getirildiğinde, biraz su alır, boynundan göğsüne doğru döker ve: «— Resulullah Sallallahu Aleyhi ve Sellem bize sıtmanın hararetini, suyla düşürmemizi emrederdi.» derdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1725
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "Hişam, babası Urve'den şöyle rivayet etti: Resulullah Sallallahu Aleyhi ve Sellem: «Humma hastalığı, cehennemin şiddetli hararetinden bir parçadır. Onun hararetini su ile düşürünüz» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1726
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"text": "İbn Ömer'den gelen bir rivayette de Resulullah Sallallahu Aleyhi ve Sellem: «Humma, cehennemin şiddetli hararetinden bir parçadır. Siz onu su ile söndürünüz.» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1727
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "Cabir b. Abdullah (r.a.) Resulullah Sallallahu Aleyhi ve Sellem'in buyurduğu­nu rivayet etti: «Bir kimse, hasta ziyaretine gidince, ilahi rahmetin içine dalmış olur. Hastanın yanında oturunca da onun hakkında rahmet şahit olur.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1728
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "İbn Atiyye, Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu riva­yet etti; «Hastalık bulaşması yoktur. Baykuş uğursuzluğu yoktur. Karın kurdu (veya safer ayı haram aylardan sayılmaz). Hastalıklı hayvanlar sağlam hayvanların arasına karışmasın. Sağlam hayvanlar ise istediği yerde dolaşıp otlayabilir.» «— Bu neden böyle oluyor ya Resulallah?» diye sorduklarında, Resulullah Sallallahu Aleyhi ve Sellem: «— Çünkü hastaları sağlamlarına karıştırmak, zarar getirir.» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1729
			}
		}
	]
}