{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"51": "Hair"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1730,
			"arabicnumber": 1730,
			"text": "Abdullah b. Ömer (r.a.)'den: Resulullah Sallallahu Aleyhi ve Sellem bıyıkları kısaltıp sakalları uzatmayı emretti",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1730
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": 1731,
			"text": "Abdurrahman b. Avf in oğlu Humeyd'den: Muaviye b. Ebî Süfyan (r.a.)'in hacc ettiği yıl minberin üzerindeyken muhafızlarından birinin elindeki bir bölük saçı alarak şöyle dediğini duydum: «— Ey Medineliler! Alimleriniz nerede? Resulullah Sallallahu Aleyhi ve Sellem'in böyle şeyleri yasakladığını ve İsrail oğullan ancak kadınları bunu adet edindiği zaman helak oldular, buyurduğunu duydum» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1731
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": 1732,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1732
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": 1733,
			"text": "Nafî'den: Abdullah b. Ömer (r.a.) yumurtaları çıkarıp burması (hadım yapmayı) hoş karşılamaz ve «yaratılışının tamam olması onun kalmasıyle olur» derdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1733
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": 1734,
			"text": "Süleym oğlu Safvan'a şöyle rivayet edildi: Resulullah Sallallahu Aleyhi ve Sellem: «Kendisinin ya da başkasının yetimine bakıp işlerini yürüten kimse, haksızlıktan sakındığı takdirde, cennette benimle şöyledır.» dedi ve işaret parmağı ile orta parmağını gösterdi. Malik'in bu konuda, Müslim'de yer alan başka bir senedi daha var: Müslim'de yer alan başka bir senedi daha var: Müslim, Zühd",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1734
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": 1735,
			"text": "Yahya b. Said'den: Ebu Katade el-Ensari (r.a.) Resulullah Sallallahu Aleyhi ve Sellem'e: «— Benim saçlarım omuzlarıma kadar uzanıyor. Onları tarıyayım mı?» diye sorduğunda, Resulullah Sallallahu Aleyhi ve Sellem: «— Evet, aynı zamanda onlara iyi bak» diye cevap verdi. Resulullah Sallallahu Aleyhi ve Sellem kendisine «onlara iyi bak» dediği için Ebu Katade bazan saçlarını günde iki defa yağlardı",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1735
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": 1736,
			"text": "Ata b. Yesar şunları anlattı: Resulullah Sallallahu Aleyhi ve Sellem mescidde idi. îçeri saçı sakalı dağınık bir adam girdi. Resulullah Sallallahu Aleyhi ve Sellem eliyle ona: «Çık» diye işaret etti. Sanki saçını ve sakalını düzeltmesini kast ediyordu. Adam da saçını sakalını düzelttikten sonra gelince, Resulullah Sallallahu Aleyhi ve Sellem (onu göstererek): «—Herhangi birinizin şeytan gibi saçı başı dağınık bir halde gelmesinden böyle gelmesi daha iyi değil mi?» buyurdu. Ebu Ömer der ki: Mürselliğinde Malik'ten ihtilaf yoktur. Cabir ve başkalarından manaca mevsul olarak gelmiştir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1736
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": 1737,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1737
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": 1738,
			"text": "Yahya b. Said şöyle rivayet eder: Halid b.Velid (r.a.), Resu­lullah Sallallahu Aleyhi ve Sellem'e «— Rüyamda korkuyorum.» dedi. Resulullah Sallallahu Aleyhi ve Sellem'de şunla­rı oku buyurdu:",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1738
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": 1739,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1739
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": 1740,
			"text": "Ebu Hureyre (r.a.) der ki: Eslem kabilesinden bir adam: «— Ben bu gece uyumadım.» dedi. Resulullah Sallallahu Aleyhi ve Sellem: «— Neden?» diye sorunca: «— Beni bir akrep soktu.» diye cevap verdi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem: «— Eğer akşamleyin: أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ ‘Auzu bi kelimatillahi taammati min şerri ma halak’ deseydin sana zarar veremezdi.» buyurdu. Dua’nın meali: Yarattığı şeylerin şerrinden, Allah'ın noksanlıktan uzak, tam ve üstün kelimelerine sığınırım",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1740
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": 1741,
			"text": "Ka'ka b. Hakîm'den: Ka'bul-Ahbar «Eğer söylediğim bir kaç kelime olmasaydı, yahudiler beni merkep yapacaklardı.» dedi. Kendisine: «— O kelimeler nedir?» diye sorulduğunda, şöyle dedi: «— Yaratıp çoğalttığı şeylerin şerrinden, kendisinden daha büyük bir şey olmayan Allah'a, hiçbir iyinin ve kötünün ulaşamayacağı noksanlıktan uzak, tam ve üstün kelimelerine, Allah'ın bildiğim ve bilmediğim bütün güzel isimlerine sığınırım.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1741
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": 1742,
			"text": "Ebu Hureyre (r.a.)'den: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: «Allah Teala kıyamet günü şöyle buyurur: «— Nerede benim rızam için birbirini sevenler? Benim gölgemden başka hiçbir gölgenin bulunmadığı bu günde onları kendi gölgemde gölgelendireceğim.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1742
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": 1743,
			"text": "Ebu Hureyre (r.a.)'den Resulullah Sallallahu Aleyhi ve Sellem'm şöyle buyurduğu rivayet edildi: «Kendi gölgesinden başka hiç bir gölgenin bulunmadığı günde Allah yedi kişiyi kendi gölgesinde gölgelendirir: 1) Adil devlet başkanı, 2) Allah'a ibadetle yetişen genç, 3) Mescidden çıktığı zaman tekrar dönünceye kadarkalbi oraya bağlı olan adam, 4) Allah yolunda birbirini seven, bu sevgiyle bir araya gelen ve bu sevgiyle ayrılan iki kişi, 5) Allah Teala'yı tenha bir yerde zikredip gözlerinden yaş akıtarak ağlayan adam. 6) Güzelce soylu bir kadın kendisini da'vet ettiğinde: «Ben Allah'tan korkarım» diyen kimse 7) Sadaka verdiğinde sağ elinin verdiğini sol eli bilme­yecek şekilde onu gizleyen kimse.»13",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1743
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": 1744,
			"text": "Ebu Hureyre'den (r.a.) Resulullah Sallallahu Aleyhi ve Sellem'm şöyle buyurduğu rivayet edildi: «Allah bir kulunu sevdiği zaman, Cebrail'e: «— Ben filan kimseyi sevdim, onu sen de sev.» buyurur. Onu Cebrail de sever, sonra gök halkına seslenerek: «— Allah filan kimseyi sevdi siz de seviniz.» der. Onu gök halkı da sever. Sonra onun sevgisi yeryüzünde halk arasında da yayılır.» İmam Malik diyor ki: Allah bir kula buğz edince, buğz etme hususunda da böyle söylediğini zannediyorum",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1744
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": 1745,
			"text": "Ebu îdris el-Havlanî'den; Dımaşk camime (Şam Ümeyye camiine) girdim, bir de baktım ki dişleri parlak, güzel yüzlü bir genç ve etrafında insanlar toplanmış, bir şey hakkında ihtilaf edince ona müracaat ediyorlar ve onun sözünü kabul ediyorlardı. Onun kim olduğunu sorduğumda: «—Bu, Muaz b. Cebel» dediler. Ertesi gün erkenden gittim. Onu bulduğumda benden daha erken gelmiş namaz kılıyordu. Namazını bitirinceye kadar onu bekledim. Sonra huzuruna gittim, selam verdim ve dedim ki: «—Vallahi ben seni Allah rızası için seviyorum.» «— Vallahi mi?» dedi. «—Vallahi!» dedim. Tekrar: «—Vallahi mi?» dedi. «— Vallahi!» dedim Yine: «—Vallahi mi?» dedi. «—Vallahi!» dedim. Bunun üzerine abamdan tuttu, beni yanına çekti ve dedi ki: «— Sana müjdeler olsun: Ben Resulullah Sallallahu Aleyhi ve Sellem'in «Allah Teala buyuruyor ki: benim rızam için birbirini seven, benim rızam için bir arada oturan, benim rızam için birbirini ziyaret eden ve kendilerini benim rızama adayan kimselere benim muhabbetim vaciptir.» buyurduğunu duydum",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1745
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": 1746,
			"text": "İmam Malike Abdullah b. Abbas (r.a.)'ın şu hadisi rivayet edildi: İşlerde iktisatlı olmak, yumuşak davranmak, güzel bir yol tutmak Nübüvvetin yirmi beşte biridir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1746
			}
		}
	]
}