{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"53": "Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "Zeyd b. Eslem'den: Resuîullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: «Binekli olan yaya'ya selam verir. Bir topluluktan birisi selam verince diğerlerine de kafi gelir.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1756
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "Yahya b. Saîd'den: Cabir b. Abdullah et yüklenmiş giderken, ona Hazret-i Ömer b. el-Hattab yetişti ve: Bu ne?» diye sordu. Bunun üzerine Cabir: Ey mü'minlerin emiri, canım et yemeyi çok istedi. Bir dirhem karşılığında et satın aldım.» deyince Hazret-i Ömer: Sizden biri, komşusunu ve amca oğlunu artan yemekten yararlandırmak için karnını biraz az doyurmayı istemez mi? Şu ayeti kerimeyi unuttun mu? (neden onu gözönünde bulundur muyorsunuz?) «(Kıyamet gününde onlara şöyle denilir): Siz bütün güzel ve helal olan lezzetlerden dünya hayatınızda nasibinizi aldınız ve onu tükettiniz. (Onlarla arzularınıza uyup günah işlediniz.)» Ahkaf sûresi, 20",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1757
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": 1758,
			"text": "Abdullah b. Ömer (r.a.)'dan: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: «Yahudilerden biri size selam verdiğinde: «Essamu aleykum = Ölüm sizin üzerinize olsun.» der. Siz de: «Aleyke= senin üzerine olsun» diye karşılık veriniz.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1758
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "Ebu Vakid el-Leysî (r.a.)'den: Resulullah Sallallahu Aleyhi ve Sellem mescidde ashabıyla otururken üç kişi geldi. îkisi Resululîah'a doğru yöneldi, biriside gitti. Bu iki kişi, Resuluîlah Sallallahu Aleyhi ve Sellem'İn meclisinde durup selam verdiler. Onlardan biri halkada bir boş yer gördü ve oraya oturdu. Diğeri de oradakilerin arkasına oturdu. Üçüncüye gelince dönüp gitti. Resulullah Sallallahu Aleyhi ve Sellem (sözünü) bitirince şöyle buyurdu: «Şu üç kişinin durumunu size haber vereyim. Onlardan biri Allah'a sığındı, Allah da onu himayesine aldı. Diğeri çekindi, Allah da ona azab etmekten çekindi, öbürü ise yüz çevirdi. Allah da ondan yüz çevirdi.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1759
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": 1760,
			"text": "Enes. b. Malik (r.a.)'den: Ömer b. Hattab (r.a.)'ı dinledim. Bir adam ona selam verdi. O da selamını aldı. Sonra adama: «— Nasılsın?» diye sorunca adam: «— Allah'a hamdolsun» diye karşılık verdi. Ömer (r.a.): «— Senden istediğim işte budur.» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1760
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "Abdullah b. Ebi Talha'dan: Ubey b. Ka'b'ın oğlu Tufeyl bana Abdullah b. Ömer (r.a.)'e geldiğini ve beraberce çarşıya gittiklerini haber vererek şöyle dedi: Çarşıya gittiğimizde Abdullah b. Ömer (r.a.), uğradığı satıcılara, ticaret erbabına, fakirlere ve herkese mutlaka selam verirdi. Bir gün yine Abdullah b. Ömer (r.a.)'e gittim. Kendisiyle beraber çarşıya çıkmamı istedi. Ben de ona: «— Çarşıda ne yapacaksın? Sen satıcıların yanında durmazsın. Bir mal sormazsın, bir şey almazsın ve çarşıdaki meclislerde de oturmazsın. Ben diyorum ki, burada bizimle otur, konuşalım.» dediğimde bana: «— Ey şişman! Biz selam için gideceğiz, karşılaştığımız kimselere selam veririz.» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1761
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1762
			}
		}
	]
}