{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"54": "General Subjects"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1763,
			"arabicnumber": 1763,
			"text": "Ata' b. Yesar (r.a)'den rivayete göre, Resulullah Sallallahu Aleyhi ve Sellem'e bir kişi: \"Ey Allah'ın Resulü! Annemin yanına girmek için izin isteyecek miyim?\" diye sordu. O da: \"Evet\" buyurdu. Adam: \"Ben evde onunla beraber oturuyorum\" deyince Resulullah Sallallahu Aleyhi ve Sellem: \"Ondan izin iste\" buyurdu. Adam: \"Ben ona hizmet ediyorum\" dediğinde Resulullah Sallallahu Aleyhi ve Sellem yine: \"Ondan izin iste; onu çıplak olarak görmek ister misin?\" buyurdu. Adam da: \"Hayır\" deyince Resulullah Sallallahu Aleyhi ve Sellem: \"O halde izin almadan yanına girme\" buyurdu. (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1763
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": 1764,
			"text": "Ebu Musa el Eş'ari (r.a)'den rivayete göre, Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İzin isternek üç seferdir. İzin verilirse gir; yoksa geri dön.\" (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1764
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": 1765,
			"text": "Rabia b. ebı Abdurrahman (r.a) ve diğer bazı alimlerden şöyle rivayet edildi: \"Ebu Musa el Eş'ari, Ömer b. Hattab'ın huzuruna girmek için izin istedi ve üç sefer izin istediğini tekrarladı. Sonra geri dönüp gitti. Ömer arkasından adam göndererek çağırttı ve niçin girmedin?\" diye sordu. Ebu Musa'da: \"Resuluilah Sallallahu Aleyhi ve Sellem'den işittim: \"İzin üç defa istenir, izin verilirse girersin, yoksa dönersin\" buyuruyordu. Bunun üzerine Ömer: \"Bunu senden başka kim biliyor? Eğer bana bunu bilen birisini getirmezsen sana şöyle veya böyle yaparım\" dedi. Ebu Musa çıktı mescitteki ensardan meydana gelen bir gruba uğradı ve onlara ben Ömer b. Hattab'a Resulullah Sallallahu Aleyhi ve Sellem'dan işittiğim: \"İzin isternek üçtür; eğer izin verirse girersin, değilse dönüp gidersin\" buyurduğunu işittiğimi haber verdim. O da: \"Eğer bana bunu bilen başka birini getirmezsen sana şöyle böyle yaparım\" dedi. Eğer aranızda bunu işiten varsa benimle gelsin deyince onlar Ebu Saıd el Hudrl'ye kalk onunla git dediler. O da gidip Ömer'e aynı hadisi aktarınca Ömer Musa'ya: \"Ben seni itham etmiyorum. Fakat insanların Resulullah Sallallahu Aleyhi ve Sellem adına hadis uydurmalarından korkuyorum\" dedi. Diğer tahric: Buhari, Buyu'; Müslim, Adab",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1765
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": 1766,
			"text": "Abdullah b. ebi Bekir (r.a)'in babasından rivayete göre, Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Biri aksırırsa yerhamukallah (Allah sana rahmet eylesin) diye hayır ve bereketle dua et. Sonra yine aksırırsa yine aynısını söyle yine aksırırsa yine aynı karşılığı ver, yine aksırarsa: \"Sen nezle olmuşsun\" de.\" Abdullah b. ebi Bekir: \"Bunu üçüncüden sonra mı yoksa dördüncüden sonra mı söylediğini bilmiyorum\" dedi. Diğer tahric: Ebu Davud, Edeb",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1766
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": 1767,
			"text": "Nafi' (r.a)'den rivayete göre, Abdullah b. Ömer aksırdığı zaman ona yerhamukallah denilince o da Allah size de, bize de rahmet eyleyip affetsin derdi. (Sadece İmam-ı Malik'in Muvatla'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1767
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": 1768,
			"text": "Abdullah b. ebi Talha (r.a.)'ın oğlu İshak'dan rivayete göre, Şifa'nın azadlı kölesi İshak şöyle haber vermiştir: \"Abdullah b. ebı Talha ile beraber Ebu Saıd el Hudri'nin hastalığında ziyarete gittik. Ebu Saıd bize dedi ki: \"RasuluIlah Sallallahu Aleyhi ve Sellem şöyle haber vermiştir: \"İçerisinde heykel veya resim bulunan eve melekler girmez.\" (Sadece İmam-ı Malik'in Muvatla'ında geçmektedir. ) * Ravi İshak, Ebu Said'in resim ve heykelden hangisini söylediği konusunda şüphe etti",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1768
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": 1769,
			"text": "Ubeydullah b. Abdullah b. Utbe b. Mes'ud (r.a.) Ebu Talha el Ensari'yi hastalığında ziyaret etti. Yanına vardığımda Sehl b. Huneyf'de orada idi. Ebu Talha bir adam çağırdı, altındaki sergiyi çıkarttırdı. Sehl b. Huneyf kendisine: \"Onu neden çıkarıyorsun?\" diye sordu. O da: \"Çünkü onda resimler var, onlar hakkında da Rasulullah Sallallahu Aleyhi ve Sellem'in ne söylediğini biliyorsun.\" Sehl de: \"RasuluIlah Sallallahu Aleyhi ve Sellem kumaşlardaki nakış ve süslemeler hariç dememiş miydi?\" deyince Ebu Talha: \"Evet, ama çıkartmak kalbime daha hoş geldi\" diye cevap verdi. (Sadece İmam-ı Malik'in Muvatla'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1769
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": 1770,
			"text": "Nebi Sallallahu Aleyhi ve Sellem'in hanımlarından Aişe (r.anha)'den rivayete göre, o üzerinde resimler bulunan bir yastık satın aldı. Rasulullah Sallallahu Aleyhi ve Sellem onu görünce kapının önünde durdu, içeri girmedi. Aişe onun yüzündeki hoşnutsuzluğu anladı ve şöyle dedi: \"Ey Allah'ın Rasulü! Yaptığım hatadan Allah'a ve onun Rasulüne dönüyorum. Ne suç işledim ki diye sordu. Rasulullah Sallallahu Aleyhi ve Sellem: \"Bu resimli yastıkta ne oluyor?\" dedi. Aişe de: \"Onu Senin için satın aldım, üzerine oturursun veya yaslanırsın\" deyince Rasulullah Sallallahu Aleyhi ve Sellem: \"Bu resimleri yapanlar kıyamet günü azab çekecekler, onlara: \"Yaptığınız bu resimlere can veriniz\" denilecek\" buyurdu. Sonra da devam ederek: \"İçerisinde resim bulunan eve melekler girmez\" buyurdu. Diğer tahric: Buhari, Buyu'; Müslim, Libas ve Zi'ne",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1770
			}
		},
		{
			"hadithnumber": 1771,
			"arabicnumber": 1771,
			"text": "Süleyman b. Yesar (r.a)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem yanında Abdullah b. Abbas ve Halid b. Velid olduğu halde Haris'in kızı Meymune'nin evine girdi. Orada beyaz kelerler görünce: \"Bunlar size nereden geldi?\" diye sordu. O da kardeşim Haris kızı Hüzeyle hediye etti diye cevap verince Rasulullah Sallallahu Aleyhi ve Sellem Abdullah b. Abbas ve Halid b. Velid'e: \"Yiyiniz\" buyurdu. O ikisi de: \"Sen yemez misin ey Allah'ın Rasulü!\" dediler. Rasulullah Sallallahu Aleyhi ve Sellem da: \"Bana Allah tarafından bir melek topluluğu geliyor o yüzden meşgulüm\" dedi. Meymune de: \"Ey Allah'ın Rasulü! Sana içmen için yanımızda bulunan sütten verelim mi?\" deyince Rasulullah Sallallahu Aleyhi ve Sellem: \"Verin\" dedi ve sütü içince: \"Bu nereden geldi?\" diye sordu. Ben de: \"Onu bana kız kardeşim Huzeyle hediye etti\" dedim. Bunun üzerine Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Benden hürriyete kavuşması için izin istediğin cariye hakkında ne dersin? Onu kız kardeşine ver ve onunla bakmakla görevli olduğun kardeşine sılai rahimde bulun. Bu senin için daha hayırlıdır.\" (Sadece İmam-! Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1771
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": 1772,
			"text": "Halid b. Velid b. Muğıre (r.a.) RasuluIlah Sallallahu Aleyhi ve Sellem ile beraber RasuluIlah Sallallahu Aleyhi ve Sellem'in hanımı Meymune'nin evine girdiğinde yanlarına kızartılmış keler getirildi. RasuluIlah Sallallahu Aleyhi ve Sellem ona elini uzatınca Meymune'nin yanında bulunan kadınlar şöyle dediler: \"RasuluIlah Sallallahu Aleyhi ve Sellem'ın yiyeceği şeyin ne olduğunu ona bildirin. Bunun üzerine: \"O kelerdir ey Allah' ın Raslilü\" deyince Rasulullah Sallallahu Aleyhi ve Sellem elini çekti. Bende: \"Yoksa bu haram mı? Ey Allah'ın Rasulü\" diye sordum. Bunun üzerine RasuluIlah Sallallahu Aleyhi ve Sellem: \"Hayır, fakat o benim memleketimde bulunmaz. Bu yüzden onu canım çekmedi\" buyurdu. Halid der ki: \"Onu önüme çektim ve RasuluIlah Sallallahu Aleyhi ve Sellem'ın gözü önünde yedim.\" Diğer tahric: Buhari, Zebaih; Müs!im, Sayd",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1772
			}
		},
		{
			"hadithnumber": 1773,
			"arabicnumber": 1773,
			"text": "Abdullah b. Ömer (r.a.)'den rivayete göre, bir kimse RasliluIlah Sallallahu Aleyhi ve Sellem'e seslenerek şöyle sordu: \"Ey Allah'ın Rasulü! Keler hakkında ne buyurursun?\" RasliluIlah Sallallahu Aleyhi ve Sellem de: \"Onu ne yer ne de haram ederim\" buyurdu. Diğer tahric: Tirmizı, Et'ıme",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1773
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": 1774,
			"text": "RasuluIlah Sallallahu Aleyhi ve Sellem'İn ashabından Ezdi Şenlie' (r.a.)'den bir adam mescidin kapısında insanlara hadis rivayet ederek şöyle dedi: \"Resulullah Sallallahu Aleyhi ve Sellem'dan işittim şöyle buyurdu: \"Bir kimse bahçesini veya hayvanlarını korumak için değil de süs için köpek edinirse o köpek o kişinin amelinden her gün bir ölçek sevap eksiltir.\" Hadisin ravisi: \"Sen bunu RasuluIlah Sallallahu Aleyhi ve Sellem'dan bizzat işittin mi?\" diye sorunca: \"Mescidin Rabbine yemin ederim ki evet\" diye cevap verdi. Diğer tahric: Buhari, Hars ve Müzaarea; Müs!im, Müsakat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1774
			}
		},
		{
			"hadithnumber": 1775,
			"arabicnumber": 1775,
			"text": "Abdullah b. Ömer (r.a.)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kim av köpeği veya koyun köpeği dışında köpek beslerse bu köpek o kişinin sevabından her gün iki ölçek eksiltir.\" Diğer tahric: Buhari, Zebaih; Müslim, Müsakat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1775
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": 1776,
			"text": "Abdullah b. Ömer (r.a.)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem vazifesiz köpeklerin öldürülmesini emretti. Diğer tahric: Buhari, Bed-il Halk; Müslim, Müsakat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1776
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": 1777,
			"text": "Ebu Hureyre (r.a)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Küfrün başı doğu tarafındadır. Büyüklük iddiası ve başkasını küçük görmek deve ve at sahiplerindedir. Vakar ve alçak gönüllülük koyun sahiplerindedir.\" Diğer tahric: Buhari, Bed-il Halk; Müslim, İman",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1777
			}
		},
		{
			"hadithnumber": 1778,
			"arabicnumber": 1778,
			"text": "Ebu Said el Hudri (r.a.)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Müslüman'ın en hayırlı malı dağ başlarında ve vadilerde arkasından dolaştığı koyunları olacaktır. O dinine bağlılığı sebebiyle fitnelerden kaçacaktır.\" Diğer tahric: Buhari, Bed-il Halk",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1778
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": 1779,
			"text": "İbn-i Ömer (r.a)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Hiçbir kimse diğerinin davalarını izni olmaksızın sağmasın. Sizden biri odasının kendine verilmesini ve deposunun kırılıp yiyeceğinin, alınmasını ister mi? Bunun gibi davarların memeleri de onların yiyeceklerini depo eder; o halde hiçbir kimse diğerinin davarını izni olmaksızın sağmasın.\" Diğer tahric: Buhari, Lukata; Müslim, Lukata",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1779
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": 1780,
			"text": "Malik'e ulaşan bilgilere göre, Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Koyun gütmemiş hiçbir peygamber yoktur.\" \"Sende mi ya Rasulallah\" deyince: \"Bende\" buyurdu. Diğer tahric: Buhari, İcara",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1780
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": 1781,
			"text": "Nafi' (r.a)'den rivayete göre, İbn-i Ömer'e akşam yemeği getirilir, bu arada evinde iken imarnın okumasını işitir. Yemeğini yiyinceye kadar acele etmezdi. (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1781
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": 1782,
			"text": "Peygamber Sallallahu Aleyhi ve Sellem'in hanımı Meymune (r.anha)'dan rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem yağ içerisine düşen farenin durumu sorulunca: \"Fareyi ve etrafında bulunan yağı atınız\" buyurdu. Diğer tahric: Buhari, Zebaih ve Sayd",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1782
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "Sehl b. Sa'd es-Saidi (r.a)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Uğursuzluk varsa atta, kadında ve evde olabilir.\" Diğer tahric: Buhari, Cihad ve Siyer; Müslim, Selam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1783
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "Abdullah b. Ömer (r.a.)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Uğursuzluk varsa atta, kadında ve evde olur.\" Diğer tahric: Buhari, Nikah; Müslim, Selam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1784
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "Yahya b. Said (r.a)'den rivayete göre, şöyle demiştir: \"Bir kadın Resulullah Sallallahu Aleyhi ve Sellem'e gelerek: \"Ey Allah'ın Raslilü! Oturduğumuz bir ev var. Nüfusumuz kalabalık malımızda çoktu. Şimdi nüfusumuz azaldı. Malımız da yok oldu\" deyince Resulullah Sallallahu Aleyhi ve Sellem: \"O kötü evi terk ediniz\" buyurdu. Diğer tahric: Ebu Davud, Tıb",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1785
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "Yahya b. Said (r.a)'den rivayete göre, Resulullah Sallallahu Aleyhi ve Sellem sağılır bir deve hakkında: \"Bunu kim sağacak?\" diye sorması üzerine bir kimse kalktı. Resulullah Sallallahu Aleyhi ve Sellem de ona: \"ismin nedir?\" diye sordu. Adam: \"Murre\" deyince Resulullah Sallallahu Aleyhi ve Sellem: \"Otur\" dedi. Sonra: \"Bunu kim sağacak?\" diye sordu. Başka biri kalktı. Resulullah Sallallahu Aleyhi ve Sellem ona da: \"ismin ne?\" dedi. O da: \"Harb\" diye cevap verdi. Resulullah Sallallahu Aleyhi ve Sellem ona: \"Otur\" dedi. Sonra yine: \"Bunu kim sağacak?\" diye sordu. Başka biri kalktı: \"Adın ne?\" diye sordu. Adam da: \"Yeiş\" diye cevap verdi. Resulullah Sallallahu Aleyhi ve Sellem da ona: \"Sen sağ\" buyurdu. (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1786
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "Yahya b. Said (r.a)'den rivayete göre, Ömer b. Hattab bir kimseye: \"Adın ne?\" diye sordu. O da: \"Cemre\" diye cevap verdi. Ömer: \"Kimin oğlusun?\" diye sordu. \"Şihab'ın oğluyum\" dedi. \"Kimlerdensin?\" diye sordu. \"Hurakadanım diye\" cevap verdi. \"Evin nerededir?\" diye sorunca \"Harratünnar'da\" diye cevap verdi. Ömer: \"Hangisi?\" diye sorunca adam: \"Alevlisi\" diye cevap verdi. Ömer öyleyse ailene yetiş yandılar\" dedi. Adam: \"Ömer b. Hattab'ın dediği gibi oldu\" dedi. (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1787
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "Enes b. Malik r.a.'den rivayete göre, şöyle demiştir: \"Rasulullah Sallallahu Aleyhi ve Sellem kan aldırdı, kanını Ebu Taybe isimli birisi aldı. Rasulullah Sallallahu Aleyhi ve Sellem ona ücret olarak bir ölçek hurma verilmesini emretti. Memurlarına da onun vergisini hafifletmelerini söyledi.\" Diğer tahric: Buhan, Buyu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1788
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "Malik (r.a)'e ulaşan bilgilere göre, Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İlaç nasıl hastalığı tedavi ederse; kan vermekte öylece tedavi eder.\" (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1789
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "Harise oğullarından biri olan ensardan İbn-i Muhayyise kan alan bir kişiyi ücretle çalıştırmak konusunda Rasulullah Sallallahu Aleyhi ve Sellem'dan izin istedi. Rasulullah Sallallahu Aleyhi ve Sellem'de bundan yasakladı. O kimse Rasulullah Sallallahu Aleyhi ve Sellem'e: \"O ücreti kölelerine yedir\" deyinceye kadar izin istemeye devam etti. Diğer tahric: Tirmizı, Buyu'; İbn-i Mace, Ticarat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1790
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": 1791,
			"text": "Abdullah b. Ömer r.a.'den rivayete göre, şöyle demiştir: Rasulullah Sallallahu Aleyhi ve Sellem'ı doğuya işaret ederek şöyle dediğini gördüm: \"İşte fitne buradadır. Şeytan'ın boynuzunun çıktığı yerde\" buyurdu. Diğer tahric: Buhari, Bed-il Halk; Müslim, Fiten",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1791
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "Malik r.a.'e ulaşan bilgilere göre, Ömer b. Hattab Irak'a gitmek isteyince Kab'ul Ahbar ona: \"Ey Mu'minlerin emiri! Irak'a gitme; zira sihrin onda dokuzu orada; cinlerin fasıkları orada ve devasız dertlerde oradadır\" dedi. (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1792
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": 1793,
			"text": "Ebu Lübabe (r.a)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem evlerdeki yılanları öldürmeyi yasakladı. (Sadece İmam-! Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1793
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "Aişe (r.anha)'nın azadlı cariyesi Saibe (r.anha)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem evlerdeki küçük yılanları öldürmeyi yasakladı. Ancak kuyruğu kısa ve sırtında iki beyaz çizgisi olanlar hariç çünkü bu iki çeşit yılan gözün nurunu giderir ve kadınların çocuk düşürmesine sebep olur.\" Diğer tahric: Buhari, Bed-il Halk; Müslim, Selam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1794
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "Hişam b. Zühre r.a.'den rivayete göre, şöyle demiştir: \"Ebu Said el Hudrl'nin yanına girdim. Onu namaz kılarken buldum. Namazını bitirinceye kadar onu bekledim. Onun evinde divanın altında bir hareket hissettim. Birde baktım ki bir yılan; onu öldürmek için ayağa kalktım. Ebu Said \"otur\" diye işaret etti. Namazı bitirince evdeki bir adayı göstererek dedi ki: \"Şu odayı görüyor musun?\" Ben de: \"Evet\" dedim. O da şöyle söyledi: \"Orada yeni gerdeğe girmiş bir genç vardı. Bu genç Rasulullah Sallallahu Aleyhi ve Sellem ile birlikte Hendek savaşına katıldı. Rasulullah Sallallahu Aleyhi ve Sellem Hendekte iken bu genç gelerek izin istedi ve şöyle dedi: \"Ey Allah'ın Resulü, ben yeni evliyim bana izin ver\" Resulullah Sallallahu Aleyhi ve Sellem ona izin verdi ve şöyle emretti: \"Silahını yanına al, zira Beni Kureyza'nın sana bir şey yapmalarından korkuyorum.\" Genç evine gittiğinde hanımını iki kapı arasında ayakta dururken gördü. Ona vurmak için mızrağa elini uzattı ve kıskançlığı galip geldi. Bunun üzerine hanım: \"Evine girip içerdekini görmeden acele etme\" dedi. Genç te eve girdi. Yatağının üzerine kıvrılmış bir yılan gördü ve mızrağını ona sapladı. Sonra onu dışarıya çıkarıp mızrağını eve dikti. Mızrağın ucunda yılan titredi ve gençte yere yıkıldı. Genç mi yılan mı önce öldü bilinmiyar. Bu durum Resulullah Sallallahu Aleyhi ve Sellem'e anlatılınca şöyle buyurdu: \"Medine'de Müslüman olmuş cinler vardır. Onlardan birini görürseniz onlara üç gün süre verin eğer yine orada dururlarsa o zaman onu öldürün, çünkü o şeytandır.\" Diğer tahric: Müslim, Selam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1795
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "Malik (r.a)'e ulaşan bilgilere göre, Resulullah Sallallahu Aleyhi ve Sellem yolculuğa çıkmak istediğinde ayağını bineğinin üzengisine koyunca şöyle derdi: \"Allah'ın adıyla bu yolculuğa başlıyorum. Allah'ım yolculukta da sahip olan Sensin. Ailem hakkında vekil olan Sensin. Allah'ım, yeryüzünü bizim için dür ve yolculuğu bize kolaylaştır. Allah'ım yolculuğun şiddet ve eziyetIerinden; yolculukta üzüntü verici bir şeye uğramaktan, mal ve çoluk çocuk bakımından kötü bir manzara ile karşılaşmaktan Sana sığınırım.\" Diğer tahric: Müslim, Hac",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1796
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "Havle binti Hakim (r.a)'den rivayete göre, Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bir yerde konaklayan kimse şöyle desin: \"Yarattığı şeylerin şerrinden Allah'ın tam ve noksansız kelimelerine sığınırım\" kişi böyle derse ona hiçbir şey zarar vermez.\" Diğer tahric: Müslim, Zikir ve Dua",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1797
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "Amr b. Şuayb r.a. babasından ve dedesinden rivayetle Rasulullah Sallallahu Aleyhi ve Sellem'ın şöyle dediğini aktarmıştır: \"Tek başına yolculuk yapana şeytan musallat olur. Çift kişi olarak yolculuk yapan kimseye yine şeytan musallat olur. Üç kişi yolculuk yaparsa bu bir cemaattir.\" Diğer tahric: Ebu Davud, Cihad; Tirmizı, Cihad",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1798
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "Said b. Müseyyeb r.a.'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Şeytan bir ve iki yolcuya musallat olur; yolcu sayısı üç olunca onlar şeytana galip gelirler.\" (Sadece İmam-ı Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1799
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "Ebu Hureyre r.a.'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Allah'a ve ahiret gününe inanan bir kadın için yanında mahremi olmadan bir gün ve bir gecelik mesafeye yolculuk yapması caiz olmaz.\" Diğer tahric: Buhari, Taksirus-Salat; Müslim, Hac",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1800
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "Halid b. Ma'dan r.a. Rasulullah Sallallahu Aleyhi ve Sellem'den merfu olarak şöyle rivayet etmiştir: \"Allah her işi kolay eder, kolaylığı sever. Ondan hoşlanır, şiddet ve meşakkate karşı yardım göstermez. Siz dilsiz hayvanlara bindiğinizde onları konak yerlerinde dinlendiriniz. Eğer geçtiğiniz yer kurak ise oradan süratlice geçiniz. Gece yolculuğunu tercih ediniz. Çünkü geceleyin yol dürütür. Gündüz alınamayan yol gece alınır. Yollar üzerine konaklarnaktan sakınınız. Çünkü yollar hayvanların gelip geçeceği yerler ve yılanların sığınacağı yerlerdir.\" Diğer tahric: Müslim, Imara",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1801
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "Ebu Hureyre (r.a)'den rivayete göre, Raslilullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Yolculuk azabtan bir parçad!f. Birinizin uyumasına yeme ve içmesine engel olur. Herhang!biriniz yolculukta işini bitirince hemen ailesinin yanına dönsün.\" (Buharl, Umre; Müslim, Imara)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1802
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "Ebu Hureyre (r.a)'den rivayete göre, Raslilullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Normal şekilde kölelerin yedirilip içirilmesi onların hakkıdır. Onlara gücünün yetmeyeceği iş yaptırılmaz.\" Diğer tahric: Müslim, iman",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1803
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "Malik (r.a)'e ulaşan bilgilere göre, Ömer b. Hattab her cumartesi günü Medine'nin kenar mahallelerine gider, bir kölenin gücü yetmeyeceği bir işte çalıştırıldığını görürse ona o işi yaptırmazdı. (Sadece İmam-! Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1804
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "Ebu Süheyl b. Malik (r.a)'in babasından rivayete göre, kendisi Osman b. Affan'ı hutbe okurken dinledi. O şöyle diyordu: \"Sanatı olmayan cariyeyi kazanç sağlamaya zorlamayın. Siz onu zorlarsanız namusunu satar. Küçükleri de kazanç sağlamaya zorlamayın; çünkü bulamazsa çalar. Onlara kolay işleri veriniz ve helalolan yiyecekler kazanmasını temin ediniz.\" (Sadece imam-! Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1805
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "Abdullah b. Ömer (r.a)'den rivayete göre, Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Köle efendisine iyi davranırsa Allah'a karşı ibadetini de güzel yaparsa ona iki kat sevap verilir.\" Diğer tahric: Buhari, Itk; Müslim, İman",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1806
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "Malik (r.a)'e ulaşan bilgilere göre, Ömer b. Hattab oğlu Abdullah'ın cariyesinin hür kadınlar gibi giyindiğini görünce kızı Hafsa'nın yanına gelerek: \"Kardeşinin cariyesinin hür kadınların şekline bürünerek insanlar arasında dolaştığını görmeyeyim\" dedi ve bunu hoş karşılamadı.\" (Sadece İmam-! Malik'in Muvatta'ında geçmektedir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1807
			}
		}
	]
}