{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"55": "The Oath of Allegiance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"text": "Abdullah b. Ömer (r.a.)'den: Biz Resulullah Sallallahu Aleyhi ve Sellem'e (Emir ve yasaklarını) duyduğumuza ve (Allah'a, Resulüne ve ululemre) itaat edeceğimize dair bey'at ettiğimizde bize: «— Gücünüzün yettiği hususlarda!» diye buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 55,
				"hadith": 1808
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"text": "Rukayka'nın kızı Ümeyme (r.a.) der ki: İslam üzere Resulullah Sallallahu Aleyhi ve Sellem'e bey'at eden kadınlar arasında ben de geldim. Onlar şöyle dediler: «— Ya Resulullah, Allah'a hiç bir ortak koşmayacağımıza, hırsızlık yapmayacağımıza, zina etmeyeceğimize, çocuklarımızı Öl­dürmeyeceğimize, kendi tarafımızdan yapılmış bir iftirada bulun­mayacağımıza, iyiliklerde sana karşı gelmeyeceğimize dair sana söz veriyoruz.» Bunun üzerine Resulullah (s.a.v.): <«— Gücünüzün yettiği hususlarda!» buyurdu. Onlar: «— Allah ve Resulü bize, bizden daha merhametlidir. Ya Resulallah, gel sana bey'at edelim» dediklerinde Resulullah Sallallahu Aleyhi ve Sellem: «— Ben kadınlarla tokalaşmam, benim yüz kadına söy­lediğim söz, bir kadına söylediğim söz gibidir.» buyurdu>",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 55,
				"hadith": 1809
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "Abdullah b. Dinar şöyle rivayet eder: Abdullah b. Ömer (r.a.) Abdülmelik b. Mervan'a bey'at ettiğini bildiren mektubunda şöyle yazdı: «— Rahman ve rallim olan Allah'ın adıyla! İmdi, Allah'ın kulu, mu'minlerin emin Abdülmelik'e: Sana selam olsun. Ben senin için kendisinden başka ilah olmayan Allah'a hamd ederim. Allah ve Resulünün emirleri üzerine gücüm yettiği kadar seni dinleyip itaat edeceğime söz veriyorum.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 55,
				"hadith": 1810
			}
		}
	]
}