{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"56": "Speech"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "Abdullah b. Ömer (r.a.)'den Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet edildi: «Bir kimse, müslüman kardeşine: \"Ey kafir\" derse ikisinden birisi bu söze duçar olur.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1811
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "Ebu Hureyre (r.a.)'den Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurdu­ğu rivayet edildi: «Bir kişinin \"insanlar kahrolsun\" dediğini işittiğinde (bil ki) o kişi onlardan en çabuk helake uğrayanı olur.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1812
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "Ebu Hureyre (r.a.)'den Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurdu­ğu rivayet edildi: «Sizden hiç kimse: \"Zamanın kötülüğü!\" demesin. Zira zamana nisbet edilen şeyi yapan Alkıh'dır.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1813
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "Yalıya b. Said der ki, Meryem oğlu Isa (Hz. îsa) yolda bir domuzla karşılaşınca ona: «— Emniyetle git» dedi. isa'ya: «— Bu sözü domuza mı söylüyorsun? diye sordular. Isa şöyle cevap verdi: «— Ben dilimi kötü söz söylemeye alıştıracağımdan korkuyorum.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1814
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "Bilal b. Haris el-Müzenî şunları rivayet etti: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: «Bir adam Allah'ın razı olacağı bir söz söyler, o sözün ulaşacağı yere ulaşmadığını zanneder. Allah kıyamet gününe kadar bu söz sebebiyle ondan razı olduğunu yazar. Bir kimse de, Allah'ın gazabını mucip bir söz söyler, o sözün ulaşacağı yere ulaşmadığını zanneder. Bu söz sebebiyle, kıyamet gününe kadar Allah o kişiye gazab ettiğini yazar.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1815
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "Ebu Hureyre (r.a.) der ki: Bir kişi bir söz söyler de o sözden dolayı cehennem ateşine düşeceği hatırına gelmez. Bir kimse de bir söz söyler, bu sözden dolayı Allah'ın kendisini cennete koyacağı aklına gelmez. Bu hadis mevkuftur. Abdurrahman b. Abdillah b. Dinar -babası- Ebu Salih Ebu Hureyre yoluyla merfu olarak rivayet edilir: Buharı, Rıkak",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1816
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "Abdullah b. Ömer (r.a.) der ki: Doğudan iki kişi gelerek hitabede bulundular. Açıklamaları halkın hoşuna gidince Resulullah Sallallahu Aleyhi ve Sellem: «Beyanda sihir vardır» veya «Bazı beyanlar sihirdir» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1817
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": 1818,
			"text": "İmam Malik'e şöyle rivayet edildi: Meryem oğlu îsa şöyle derdi: Allah'ı anmaksızın çok konuşmayın. Sonra kalbleriniz katılaşır. Katı kalb ise, Allah'dan uzaktır, fakat siz bilemezsiniz. Siz tanrılarmışcasına insanların günahlarına bakmayınız. Kullar gibi kendi günahlarınıza bakınız. Zira insanlar (günahlara) duçar olur ve ondan kurtulabilir. Belaya uğrayanlara acıyın. Afiyetten dolayı da Allah'a hamd edin",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1818
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": 1819,
			"text": "İmam Malik'e şöyle rivayet edildi: Nebi s.a.v.'in hanımı Aişe.(r.anha) yatsıdan sonra ailesinden bazılarına haber göndererek: «Katip meleklere istirahat vermez misiniz?» derdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1819
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": 1820,
			"text": "Mahzum kabilesinden Abdullah b. Hattab'ın oğlu Muttalib derki: Bir zat Resulullah Sallallahu Aleyhi ve Sellem'e: «— Ğıybet nedir?» diye sorunca Resulullah Sallallahu Aleyhi ve Sellem: «— Bir kişinin duyduğu zaman hoşlanmayacağı şeyleri anlatmandır.» buyurdu. Adam: «—Ya Resulallah gerçek olursa da mı?» diye sordu. Resulul­lah Sallallahu Aleyhi ve Sellem: «— Asılsız bir şey söylersen bu iftira olur.» buyurdu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1820
			}
		},
		{
			"hadithnumber": 1821,
			"arabicnumber": 1821,
			"text": "Ata b. Yesar, Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu rivayet etti: «Allah bir kimseyi iki şeyin şerrinden korursa, o kişi cennete girer.» Bunun üzerine bir zat: «— Ya Resulallah (bunları) bize söyleme» deyince Resulullah Sallallahu Aleyhi ve Sellem da sustu. Sonra dönerek, birinci sözünü aynen tekrar etti. Adam yine ona: «— (Onları) bize haber verme Ya Resulallah» dedi. Resulullah Sallallahu Aleyhi ve Sellem yine sustu. Sonra aynı sözünü tekrarladı. Bunun üzerine adam: «— (Onları) bize haber verme ya Resulallah!» dedi. Sonra Resulullah Sallallahu Aleyhi ve Sellem yine aynı sözünü tekrarladı. Adam da ilk sözünü söyleme cihetine gidince.yanmdaki bir zat onu susturdu. Resulullah Sallallahu Aleyhi ve Sellem bunun üzerine şöyle buyurdu: «Allah bir kimseyi iki şey'in şerrinden korursa, o kişi cennete girer: Dilinin ve cinsî organlarının! Dilinin ve cinsî organlarının!..» Ebu Ömer derki; Malik'ten, bildiğim kadarıyla ihtilafsız mürseldir. Buhari, Sehl b. Sa'd'den mevsul olarak rivayet eder: Rikak",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1821
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": 1822,
			"text": "Zeyd'in babası Eslem şöyle rivayet etti: Ömer b. Hattab, Ebu Bekir dilini çekerken onun yanına girdi ve ona: «Allah seni bağışlasın, yapma!» deyince Ebu Bekir (r.a,): «— Bu, beni tehlikeye düşürdü» dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1822
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": 1823,
			"text": "Abdullah b. Dinar der ki: Ben ve Abdullah b. Ömer (r.a.), Utbe oğlu Halid'in çarşıdaki evinde idik. Bir kişi gelerek Abdullah, ile gizli konuşmak istedi. Orada Abdullah ile gizli konuşmak isteyen adamdan ve benden başka kimse yoktu. Abdullah dört kişi olmamız için bir adam daha çağırdı. Bana ve çağırdığı adama şöyle dedi: Biraz bekleyin. Ben Resulullah Sallallahu Aleyhi ve Sellem'i şöyle derken işit­tim: «Bir kişinin yanında, iki kişi gizli konuşmasın»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1823
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": 1824,
			"text": "Abdullah b. Ömer (r.a.)'den Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet edildi: «Üç kişi birarada bulunduğunda ikisi gizli konuşmasın.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1824
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": 1825,
			"text": "Safvan b. Süleym şöyle rivayet etti: Bir zat Resulullah Sallallahu Aleyhi ve Sellem'e: «— Hanımıma yalan söyleyebilir miyim ya Resulallah?» diye sordu. Resulullah Sallallahu Aleyhi ve Sellem: «— Yalanda hayır yoktur.» buyurdu. O zat: «— Ona bir takım vaadlerde bulunup kendisine söyleyebilir miyim?» diye sorunca, Resulullah Sallallahu Aleyhi ve Sellem: «— Bunda bir günah yoktur.» buyurdu. Bu hadis Mürseldir. Ebu Ömer der ki: Hiçbir yoldan müsned olduğunu bilmiyorum",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1825
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": 1826,
			"text": "İmam Malik'e rivayet edildiğine göre Abdullah b. Mesud şöyle derdi: Doğru söz'den ayrılmayın. Çünkü doğruyu söylemek birr'e, (hayırlı işlere) birr de cennete götürür. Yalandan sakının. Çünkü yalan fucur'a götürür. fucur ise ateş'e (cehenneme) götürür. Nitekim: «Doğru konuştu, iyi amel işledi; yalan konuştu, günaha girdi» sözü meşhurdur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1826
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": 1827,
			"text": "İmam Malik'e şöyle rivayet edildi: Lokman'a ondaki fazileti kast ederek: «— Gördüğümüz bu fazilete seni ulaştıran nedir? diye sorulduğunda, Lokman: «Doğru konuşmak, emaneti yerine getirmek ve gereksiz işleri terk etmek» diye cevap verdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1827
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": 1828,
			"text": "İmam Malik'in rivayet ettiğine göre Abdullah b. Mesud (r.a.) şöyle derdi: Kul yalan konuşmaya devam ettikçe, Allah katında yalancılardan yazılıncaya ve kalbinin tamamı karanncaya kadar kalbinde siyah bir leke belirir. Mevkuftur, hükmü merfudur. Çünkü bu konuda içtihada yer yoktur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1828
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": 1829,
			"text": "Safvan b. Süleym der ki: Resulullah Sallallahu Aleyhi ve Sellem'e: «— Mu'min korkak olur mu?» diye sorulduğunda: «— Evet» diye cevap verdi. «— Mu'min yalancı olur mu?» diye sorulunca da: «— Hayır» buyurdu. Mürsel veya mu'daldır, ebu Ömer derki: Sağlam bir yoldan müsned olarak bilmiyorum. Hasen-mürsel bir hadistir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1829
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": 1830,
			"text": "Ebu Hureyre (r.a.)'den Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet edildi: «Allah sizden üç hususta razı olur ve üç hususta da size gazap eder. Sizin kendisine ibadet edip ona hiçbir ortak koşmamanıza; toptan Kur*an-ı Kerim'e yapışmanıza ve Allah'ın başınıza geçirdiği kişilere itaat etmenize razı olur. Dedikodu yapmanıza, malınızı gereksiz yerlere harcamanıza ve çok soru sormanıza da gazab eder.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1830
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": 1831,
			"text": "Ebu Hureyre (r.a.)'den Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet edildi: İnsanların en kötüsü, şunlara bir yüzünü, bunlara da başka bir yüzünü gösteren iki yüzlü kimselerdir.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1831
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": 1832,
			"text": "imam Malik'e şöyle rivayet edildi: Nebi s.a.v.'in hanımı Ümmü Seleme; «— içimizde salih kimseler varken biz helak olur muyuz ya Resulallah?» dediğinde, Resululîah Sallallahu Aleyhi ve Sellem: «— Evet, kötülük çoğalınca helak olursunuz» diye cevap verdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1832
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": 1833,
			"text": "Ömer b. Abdülaziz, şöyle bir söz söylenirdi, dedi: «Yüce Allah bir kişinin günahından dolayı topluma azab etmez, fakat bir kötülük açık olarak işlenirse toplumun hepsi azaba duçar olurlar.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1833
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": 1834,
			"text": "Enes b. Malik (r.a.) der ki: Ömer b. Hattab (r.a.) ile beraber çıkmıştık. O, bahçeye girdi, aramızda bir duvar vardı. Onun şöyle dediğini işittim: «— Ömer b. Hattab mu'minleınn emiri! Bak, bak!.. Allah'a yemin ederim ki, ya Allah'dan korkarsın veya sana azab eder.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1834
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": 1835,
			"text": "Kasım b. Muhammed şöyle derdi: Yapmadıkları bir şeyi konuşmayı sevmeyen insanlarla yaşadım. (Sahabeleri kast ediyor) İmam Malik der ki: Kasım, bununla ameli kast etmiştir. Zira kişinin sözüne değil ameline bakılır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1835
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": 1836,
			"text": "Abdullah b. Zübeyr'in oğlu Amir, gök gürültüsünü duyduğu zaman konuşmayı bırakır ve şöyle derdi: «Gök gürlemesi hamd ile, melekler de korku ile onu tesbih eder.»[Rad, 13] Bundan sonra da: «Bu, elbette ki yeryüzündekilere şiddetli bir tehdittir» derdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1836
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": 1837,
			"text": "Mu'minlerin annesi Aişe r.anha'dan rivayet edildiğine göre, Resulullah Sallallahu Aleyhi ve Sellem vefat edince, hanımları Osman b. Affan (r.a.)'ı, Ebu Bekir (r.a.)'e gönderip Resulullah Sallallahu Aleyhi ve Sellem'dan kendilerine düşen mirası ondan istemesini söylediler. Bunun üzerine Hz. Aişe (r.a.) onlara; Resulullah Sallallahu Aleyhi ve Sellem: «— Biz miras bırakmayız; bizim bıraktığımız sadakadır.» buyurmamış mıydı? dedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1837
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": 1838,
			"text": "Ebu Hureyre (r.a.)'den: Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet edildi: «Benim varislerim altın paraları bölüşmez. Hanımlarımın nafakasından ve işçimin masrafından başka bıraktıklarım sadakadır.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1838
			}
		}
	]
}