{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"6": "Prayer in Ramadan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 246,
			"arabicnumber": 246,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 247,
			"arabicnumber": 247,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 248,
			"arabicnumber": 248,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 249,
			"arabicnumber": 249,
			"text": "İbn Şihab, A'rac'dan naklediyor: Ömer b. Hattab «Ve'n-necmi iza heva» sûresini okudu ve tilavet secdesi yaptı. Sonra kalkarak diğer sûreyi de okudu. Şeybanî, 268",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 250,
			"arabicnumber": 250,
			"text": "Avfın torunu Humeyd b. Abdurrahman'dan: İhlâs sûresi Kur'ân'ın üçte birinin faziletine denktir. 'Tebarekellezi bi yedihilmülk, sûresi ise kıyamet günü, dünyada iken onu çok çok okuyanın tarafında yer alır ve Allahü teâlâ'nın gazabının önlenmesi için çalışır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Munqar"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 251,
			"arabicnumber": 251,
			"text": "Ebû Hüreyre anlatıyor: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: «Kim günde yüz defa, Allah'tan başka ilah yoktur, onun eşi ve benzeri de yoktur. Mülk onundur, hamd ona mahsustur. O her şeye kadirdir, derse on tane köle azat etmiş kadar sevap alır, defterine yüz iyilik yazılır, yüz tane de kötülüğü silinir. Bu dua kıyamet günü onu şeytanlardan koruyan bir sığınak olur. Bu duayı günde o kişiden daha fazla okuyanlar hariç hiçkimse bundan daha üstün bir amelle kıyamet yerine gelemez.» Buhârî, Bedu’l-Halk, 59/11; Müslim, ez-Zikr ve'd-Dua, 48/28",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 252,
			"arabicnumber": 252,
			"text": "Ziyad b. Ebî Ziyad'dan: Ebüdderdâ': Size amellerinizin en hayırlısını, derecelerinizi en fazla ükseltecek olanını, Allah katında en temiz olanım ve sizin için altın ve gümüş infak etmekten, düşmanınızla muharebe meydanında karşılaşıp boyunlarını vurmanızdan ve onların da sizin boyunlarınızı vurmasından daha hayırlı amelleri haber vereyim mi?» dedi. Ashab: Evet.» deyince: teâlâ'yı zikretmektir,» dedi. babası Muaz b. Cebel: «Adem oğlunun Allah'ı zikirden başka yapacağı hiç bir amel onu Allah'ın azabından kurtaramaz.» dedi. Tirmizî, Da'avât, 45/6 (merfu olarak); İbn Mace, Ebed, 33/53",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 253,
			"arabicnumber": 253,
			"text": "Rifaa b. Kafi’ anlatıyor: Resûlüllah’ın (sallallahü aleyhi ve sellem) ardında namaz kılıyorduk. Resûlüllah (sallallahü aleyhi ve sellem) rükûdan kalkınca «semiallahü limen hamideh» dedi. Arkadan başka bir adam da «Rabbena Velekel hamd, hamden kesîren, tayyiben, mübareken fîhi = Ey bizim rabbimiz bol bol, riyadan arınmış ve mübarek hamd sana mahsustur,» dedi. Namazdan sonra Resûlüllah (sallallahü aleyhi ve sellem): Biraz önce onu söyleyen kimdi?» diye sordu. Adam: Bendim Ya Resûlallah! dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: «Otuz küsur melek gördüm, hepsi de bunu önce yazabilmek için koşuşuyorlardı.» Buharî. Ezan 10/126",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 253
			}
		}
	]
}