{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"8": "Prayer in Congregation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 287,
			"arabicnumber": 287,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 288,
			"arabicnumber": 288,
			"text": "Amr b. Nüfeyl'in Zeyd'den olan torunu Ömer b. Hattab'ın hanımı Âtike'den: Ömer b. Hattab'dan mescide gitmek için izin istedim. Hiç cevap vermeden sustu. Ben kendi kendime: «Vallahi gitme deyinceye kadar gideceğim.» dedim. O da «gitme» demedi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 289,
			"arabicnumber": 289,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 290,
			"arabicnumber": 290,
			"text": "İmâm-ı Mâlik'ten: Biz Medine'illere göre toplanan zekât ancak Valinin takdirine göre taksim edilir. Bakılır: Zekat verilebilen sınıflar içerisinde hangi sınıf daha muhtaç ve sayısı daha fazla ise miktarını Valinin takdir ettiği oranda tercihan o sınıfa verilir. Bir, iki veya senelerce sonra bu sınıf bırakılıp muhtaç ve sayıca daha fazla bir başka sınıfa geçilebilir. Tanıdığım alimlerin böyle yaptığına şahit oldum. memurunun topladığı zekâttan alacağı belli bir hissesi yoktur, vali ona ne takdir ederse onu alır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 291,
			"arabicnumber": 291,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 292,
			"arabicnumber": 292,
			"text": "Bir kişinin çeşitli yerlerde malları olsa ya da çeşitli mallara ortak olsa, bunlar ayrı ayrı nisaba ulaşmıyor, toplandığı zaman nisabı dolduruyorsa hepsini toplar ve zekâtını verir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 293,
			"arabicnumber": 293,
			"text": "İmâm-ı Mâlik der ki: Biz Medine'liler arasındaki geleneğe göre buğday, hurma, üzüm ve diğer tahıllar elde edilince zekâtları da verilir. Zekâtını verdiği malı sahibi senelerce yanında alıkoyup sonra da satabilir. Satınca elde ettiği paraya üzerinden bir yıl geçmedikçe zekât düşmez. mallar gelir veya başka yolla kazanılmış olup ticarî amaçlı değilse yiyecek, tahıl ve eşya mesabesinde olup, kişi bunları kazanır, senelerce elinde tutar, sonra altın ve gümüş karşılığında satarsa, sattığı günden itibaren parasının üzerinden bir yıl geçmeden zekât gerekmez. Şayet bu mallar ticaret eşyası olur da sahibi zekâtını verdiği mal karşılığında bu malları satın almış ve o günden itibaren bir sene elinde tutmuş ise, sattığı anda zekâtınıvermesi gerekir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 294,
			"arabicnumber": 294,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 294
			}
		},
		{
			"hadithnumber": 295,
			"arabicnumber": 295,
			"text": "Yoncaya ve sebzelere de zekât düşmez. Bunlar satıldıkları takdirde, paraları sahibinin eline geçtikten bir sene sonra zekâtı verilir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 295
			}
		},
		{
			"hadithnumber": 296,
			"arabicnumber": 296,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 296
			}
		},
		{
			"hadithnumber": 297,
			"arabicnumber": 297,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 297
			}
		},
		{
			"hadithnumber": 298,
			"arabicnumber": 298,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 298
			}
		},
		{
			"hadithnumber": 299,
			"arabicnumber": 299,
			"text": "İmâm-ı Mâlik'den; Said b. Cübeyr'in buna benzer bir fetvasını duymuştum",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 299
			}
		},
		{
			"hadithnumber": 300,
			"arabicnumber": 300,
			"text": "İbn Şihab'dan: Duyduğuma göre Rasûlüllah (sallallahü aleyhi ve sellem), Bahreyn mecusilerinden cizye almıştır. Buhari, Cizye, 57/1. b. Hattab îran mecusilerinden, Osman b. Affan da Berberî'lerden cizye almıştır. , Siyer, 19/31, Ayrıca bkz. Şeybanî, 332",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 300
			}
		},
		{
			"hadithnumber": 301,
			"arabicnumber": 301,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 301
			}
		},
		{
			"hadithnumber": 302,
			"arabicnumber": 302,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 302
			}
		},
		{
			"hadithnumber": 303,
			"arabicnumber": 303,
			"text": "Ömer b. Hattab'ın azatlısı Esleme'den: Ömer b. Hattab, Mısır ve Şam gayri müslimlerine dörder dinar, Irak gayri müslimlerine de kırkar dirhem cizye tarh etti. Ayrıca müslümanlara yardımı ve misafirlik hakkının üç gün olması kuralını da koydu. Şeybanî, 333",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 303
			}
		},
		{
			"hadithnumber": 304,
			"arabicnumber": 304,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 304
			}
		},
		{
			"hadithnumber": 305,
			"arabicnumber": 305,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 305
			}
		},
		{
			"hadithnumber": 306,
			"arabicnumber": 306,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 306
			}
		},
		{
			"hadithnumber": 307,
			"arabicnumber": 307,
			"text": "Zeyd b. Eşlem babasından naklediyor: Ömer b. Hattab'a: Zekâtlıklar arasında kör bir deve var» dedim. Birini verin de işini görsün!» diye karşılık verdi. O kör!» dedim. Ömer (radıyallahü anh): Katara katınca yürür.» dedi. Peki, nasıl otlayacak?» dedim. Bunun üzerine Hazret-i Ömer: o cizye malı mı, yoksa zekâttan mı?» diye sordu. Cizye malı.» dedim. Ömer (radıyallahü anh): Anladım, siz onu yemek istiyorsunuz!» deyince ben: Üzerinde cizye malı olduğuna dair işaret var.» dedim. Hazret-i Ömer'in emri üzerine deve kesildi. Ömer'in (radıyallahü anh) yanında dokuz tabak vardı. Meyve ve hoşa giden yiyecekler olduğu zaman mutlaka bu tabaklara koyar, Resûlüllah'ın (sallallahü aleyhi ve sellem) hanımlarına gönderirdi. Bu arada kızı Hafsa da Hazret-i Peygamberin hanımı olduğu için ona da gönderir, fakat en son gönderirdi. Şayet yetişmezse, kızıma yetişmesin diye düşünürdü. Bu sefer de kesilen devenin etlerini bu tabaklara koydu. Resûlüllah'ın (sallallahü aleyhi ve sellem) hanımlarına gönderdi. Kalanının da yemek yapılmasını emrederek, ensarla muhacirin bazılarını davet etti",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 307
			}
		},
		{
			"hadithnumber": 308,
			"arabicnumber": 308,
			"text": "İmâm-ı Mâlik şöyle demiştir: Kendilerinden cizye alınanlardan, başka bir vergi alınmasını ben uygun görmüyorum",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 308
			}
		},
		{
			"hadithnumber": 309,
			"arabicnumber": 309,
			"text": "İmâm-ı Mâlik'den; Duyduğuma göre Ömer b. Abdülaziz zekât tahsildarlarına «Kendilerinden cizye alınanlar müslüman olurlarsa cizyelerini almamalarını» bir fermanla bildirdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 309
			}
		},
		{
			"hadithnumber": 310,
			"arabicnumber": 310,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 310
			}
		},
		{
			"hadithnumber": 311,
			"arabicnumber": 311,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 311
			}
		},
		{
			"hadithnumber": 312,
			"arabicnumber": 312,
			"text": "Cizyeyle ilgili olarak İmâm-ı Mâlik şöyle der: Şimdiye kadar geçen tatbikata göre cizye, ehl-i kitabın kadın ve çocuklarından alınmaz. Sadece akıl baliğ olmuş erkeklerinden alınır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 312
			}
		},
		{
			"hadithnumber": 313,
			"arabicnumber": 313,
			"text": "Zimmilerin ve mecusilerin hurmalarından elde ettikleri üzümlerinden, zirai ürünlerinden, küçük ve büyük baş hayvanlarından zekât alınmaz. Çünkü zekât, müslümanları temizlemek ve fakirlerini gözetmek için yine müslümanlar için farz kılınmıştır. Cizye ise ehl-i kitabı küçültmek için konmuştur. Onların anlaşarak içinde yaşadıkları ülkede kendilerinden cizye dışında vergi alınmaz. Yalnız ticaret yaparlar da bu vesileyle müslüman memleketlere girip çıkarlarsa ticaret mallarından onda bir vergi alınır. Cizye, sadece müslüman bir ülkede yaşamak ve onları düşmanlarına karşı korumak üzere taraflarca yapılan bir anlaşma neticesinde alınmaktadır. Ticaret maksadiyle başka bir memlekete giden zimmiden gümrük (öşür) alınır. Yine ticaret maksadıyla Mısır'dan Şam'a, Şamlı olan Irak'a, Iraklı olan Medine'ye veya Yemene veyahut da başka bir memlekete gitse yine gümrük (öşür) verir. Ehl-i kitap ve mecusilerin ne mallarına, ne meyvelerine, ne de zirai ürünlerine zekât yoktur. Şimdiye kadar uygulama böyle olmuştur. Onlar dinlerine tabidir, hangi dindelerse onda devam ederler. Ticaret için bir yıl içinde bir memlekete birkaç defa girip çıksalar, her defasında onda bir gümrüklerini verirler. Çünkü cizye anlaşması şartlarının içerisinde ticaret yapmak yoktur. Kendilerine yetişmiş olduğum Medine âlimleri de bu şekilde hüküm vermişlerdir. İmam Şafii ile İmam Ebu Hanife, ehl-i Kitab'dan bunun senede ancak bir kere alınabileceğini söylemişlerdir. (Zürkanî Şerhi, 1/190)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 313
			}
		},
		{
			"hadithnumber": 314,
			"arabicnumber": 314,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 314
			}
		},
		{
			"hadithnumber": 315,
			"arabicnumber": 315,
			"text": "Salim b. Abdullah babasından naklediyor: Ömer b. Hattab, hristiyan tüccarların buğday ve zeytinlerinden yirmide bir gümrük vergisi alırdı. Onun bu vergiyi düşük almasının sebebi, Medine'ye bu malların çok gelmesini sağlamak içindi. Halbuki baklagillerden onda bir vergi alırdı. Şeybanî,331",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 315
			}
		},
		{
			"hadithnumber": 316,
			"arabicnumber": 316,
			"text": "Saib b. Yezid anlatıyor: Ömer b. Hattab zamanında Abdullah b. Utbe b. Mes'ud'la birlikte Medine çarşılarında vergi memuru olarak çalışıyordum. O zaman biz Hıristiyan tüccarlardan onda bir vergi alıyorduk",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 316
			}
		},
		{
			"hadithnumber": 317,
			"arabicnumber": 317,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 317
			}
		},
		{
			"hadithnumber": 318,
			"arabicnumber": 318,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 318
			}
		},
		{
			"hadithnumber": 319,
			"arabicnumber": 319,
			"text": "Ömer b. Hattab anlatıyor: İyi bir at alıp Allah rızası için birine verdim. Adam ata iyi bakmıyordu. Onun için atı satın almak istedim. Zannedersem ucuz da alabilecektim. Durumu Resûlüllah'a (sallallahü aleyhi ve sellem) sordum. Resûlüllah (sallallahü aleyhi ve sellem): Bir dirheme de verse alma, çünkü verdiği sadakadan dönen kustuğunu yiyen köpek gibidir» buyurdu. Buhârî, Zekât, 24/59; Müslim, Hibât, 24/1",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 319
			}
		},
		{
			"hadithnumber": 320,
			"arabicnumber": 320,
			"text": "Abdullah b. Ömer'den: Ömer b. Hattab, Allah rızası için bir at bağışladı. Sonra da onu satın almak istedi. Resûlüllah'a (sallallahü aleyhi ve sellem) durumu arzedince peygamberimiz şöyie buyurdu: «Onu ne satın al, ne de sadakandan geri dön.» Buhârî, Zekât, 24/59; Müslim, Hibât, 24/3",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 320
			}
		},
		{
			"hadithnumber": 321,
			"arabicnumber": 321,
			"text": "İmâm-ı Mâlik'e: « Birine sadaka veren bir adam verdiği sadakanın başka biri tarafından satıldığını görse, onu satın alabilir mi?» diye soruldu. Mâlik: kalırsa olmaması daha iyidir» cevabını verdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 321
			}
		},
		{
			"hadithnumber": 322,
			"arabicnumber": 322,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 322
			}
		},
		{
			"hadithnumber": 323,
			"arabicnumber": 323,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 323
			}
		},
		{
			"hadithnumber": 324,
			"arabicnumber": 324,
			"text": "Abdullah b. Ömer'den: Resûlüllah (sallallahü aleyhi ve sellem) Ramazanda fitreyi, kadın, erkek, hür ve köle her müslüman bir sa' (2.176 gr.) hurma veya bir sa' arpa olarak takdir etti. Buharî, Zekât, 24/70; Müslim, Zekât, 12/12",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 324
			}
		},
		{
			"hadithnumber": 325,
			"arabicnumber": 325,
			"text": "Nafi'den: Abdullah b. Ömer, bayramdan iki üç gün önce fitreyi toplayan kimseye fitresini gönderirdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 325
			}
		}
	]
}