{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"9": "Shortening the Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 326,
			"arabicnumber": 326,
			"text": "İmâm-ı Mâlik'den: Benim gördüğüme göre, bayram günü şafak atınca, namazdan önce fitrenin verilmesini âlimler iyi görürlerdi. Buharî, Zekât, 24/76 (İbn Ömer'den merfu olarak); Müslim, Zekât, 12/2223",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 326
			}
		},
		{
			"hadithnumber": 327,
			"arabicnumber": 327,
			"text": "İmâm-ı Mâlik der ki: İnşaallah fitreyi verme süresi bayram günü namazdan önce ve sonra devam eder. Şeybanî, 344",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 327
			}
		},
		{
			"hadithnumber": 328,
			"arabicnumber": 328,
			"text": "Ebû Saîd el-Hudrî anlatıyor: Biz fitreyi bir sâ' yemek, bir sa' arpa, bir sa' hurma, bir sa' keş (keş peyniri, kuru yoğurt) veya bir sa' kuru üzümden verirdik. Bu sa', Resûlüllah'ın (sallallahü aleyhi ve sellem) tesbit ettiği ölçü idi. Buharî, Zekât, 24/73; Müslim, Zekât, 12/17",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 328
			}
		},
		{
			"hadithnumber": 329,
			"arabicnumber": 329,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 329
			}
		},
		{
			"hadithnumber": 330,
			"arabicnumber": 330,
			"text": "İmâm-ı Mâlik şöyle demiştir; Zıhar hariç bütün keffaretler, fitre ve öşür, müdd-i Nebi ile küçük müdle (bir müd, yarım kg.dır) ölçülür. Zıhar keffareti ise, en büyük müd olan Hişam müddü ile ölçülür",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 330
			}
		},
		{
			"hadithnumber": 331,
			"arabicnumber": 331,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 331
			}
		},
		{
			"hadithnumber": 332,
			"arabicnumber": 332,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 332
			}
		},
		{
			"hadithnumber": 333,
			"arabicnumber": 333,
			"text": "İmâm-ı Mâlik'ten: Kişinin kölesinin kölesi, işçisi, karısının kölesi için fitre vermesi gerekmez. Yalnız bunlardan kendisine hizmet edenler varsa ve mutlaka kendisine lâzım iseler, o zaman bunların da fitresini verir. İster ticaret maksadıyla alınsın, ister başka maksatla alınsın müslüman olmayan köleye müslüman olmadıkça fitre düşmez",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 333
			}
		},
		{
			"hadithnumber": 334,
			"arabicnumber": 334,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 334
			}
		},
		{
			"hadithnumber": 335,
			"arabicnumber": 335,
			"text": "Abdullah b. Ömer'den: Resûlüllah (sallallahü aleyhi ve sellem), sözü Ramazana getirerek: «Hilâli görmeden oruca başlamayın, yine hilâli görmeden bayram yapmayın. Şayet hava bulutlu olursa ayı otuz güne tamamlayın.» buyurdu. Buhârî, Savm, 30/11; Müslim, Sıyâm, 13/3. Ayrıca bkz. Şeybanî, 346",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 335
			}
		},
		{
			"hadithnumber": 336,
			"arabicnumber": 336,
			"text": "Abdullah b. Ömer'den: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: «Ay yirmi dokuz çekebilir, hilâli görmeden oruca başlamayın, hilâli görmeden bayram da yapmayın. Şayet Ramazanın son günü hava bulutlu olursa ayı otuz güne tamamlayın.» Buhârî, Savm, 30/11; Müslim, Siyam, 13/9. «İHTİLAF-I METALİ»a itibar eden, fıkhı görüş açısından konuya bakıldığı zaman, bu konudaki ayrılığı tabiî karşılamak mümkündür. Ancak, hemen ifade etmeliyiz ki, bugün bu konuda görülen ayrılık, «İHTİLAF-I METALİ»a itibar etmekten meydana gelmemektedir. Hilâlin tesbitinde uygulanan farklı metotların meydana getirdiği bir ayrılıktır. Ancak, kabule mecburuz ki, «İHTİLAF-I METALİ»a itibardan dolayı meydana gelmiş de olsa, günümüz müslumanlarının ayrılığa tahammülü yoktur. Çünkü, biraz önce de belirttiğimiz gibi, dünyamız küçülmüş, mesafeler kısalmıştır. Çok seri haberleşme ve ulaşım imkânları sayesinde, dünyanın herhangi bir noktasında meydana gelen bir olay, bu noktaya en uzak köşesinde bile, anında duyulabilmektedir. Bir İslâm Ülkesinde bayram yapılırken, bir başka İslâm Ülkesinde oruca devam edilmesi, «İHTİLAF-I METALİ»a itibar eden fikhî görüşe dayanılmış da olsa, müslüman toplumları izahı mümkün olmayan bir sonuçla karşı karşıya getirmektedir. Aslında, çok iyi bildiğimiz gibi; Hanefî, Maliki ve Hanbelî Mezheplerinin cumhur-ı fukahası «İHTİLAF-I METALÎ»a itibar edilmemesi, hilâlin bir yerde sübutu halinde bütün İslâm Dünyasının bu sübuta göre amel etmesi görüşündedir. Şafiî mezhebinde de aynı görüşü benimseyen fakihler vardır. O halde, bu ayrılığı ortadan kaldırmak hepimiz için önemli bir görev olmaktadır. konuda özellikle Avrupa ülkelerinde çalışan ve değişik İslâm Ülkelerine mensup bulunan müslümanlar, daha güç durumdadır. Bunların bir kısmı, kendi ülkelerine uymakta, diğer bir kısmı, başka ülkelerin ilânına itibar etmekte, böylece aynı şehirde yaşayan, aynı dine, hatta aynı millete mensup olan müslümanlar, ayrı günlerde oruca başlamakta ve bayram yapmaktadır. Bunlar içinde kırıcı ithamlarda bulunanlar ve farkında olmadan fitneye yol açanlar da pek çoktur. Bu halin onları, gayr-ı müslimler karşısında güç bir duruma sokmuş olması da ayrı bir gerçek ve ayrı bir acıdır. ülkelerde çalışan müslüman işçisi, kendisine müslüman olmayanlar tarafından sorulan «Siz hepiniz aynı dinin mensupları değil misiniz? Niçin aynı günde bayram yapmıyorsunuz?» sorusuyla karşı karşıya gelmekten kurtarılmalıdır. Bu konuda en yakın geçmişteki, Ramazan, Şevval ve Zilhicce hilâllerinin tesbitini örnek olarak ele almak istiyorum. malûmları olduğu üzere, 1398 H. -1978 M. yılı Ramazan orucuna bazı İslâm Ülkelerinde (Meselâ: Türkiye, Afganistan, Fas ve Nijerya'da) 6 Ağustos 1978 Pazar günü başlanmışken, diğer bazıları (meselâ: Mısır, Suudî Arabistan, Lübnan, Suriye gibi ülkelerde) oruca 5 Ağustos Cumartesi günü girilmiştir. İslâm Ülkelerinin büyük çoğunluğu 5 veya 6 Ağustos günlerinde bölünerek oruca başlarken, 4 ve 7 Ağustos günleri Ramazan'a giren ülkeler de vardır. Büyükelçiliklerden aldığımız bilgiler bizi yanıltıcı nitelikte değilse, Irak ve Kuveyt'deki müslümalar, 4 Ağustosta oruca niyyet etmişler, Pakistan'daki müslüman kardeşlerimiz ise, oruç tutmağa 7 Ağustos günü başlamışlardır. «İHTİLAF-I METALÎ»a itibar eden fıkhî görüş savunulsa bile, bu tablo karşısında İslâm Dünyasının hazin durumunu görmemek mümkün değildir. 1398 H. /1978 M. yılı Şevval hilâline gelince: hazin sonuç, bu hilâlin ilanı konusunda da ortaya çıkmıştır. Şöyle ki: Bazı ülkelerde 2 Eylül akşamı Şevval hilâli görülmüş gibi, 3 Eylülde bayram yapılmış, diğer bazı ülkelerde ise, aynı gün oruca devam edilerek, bayrama bir gün sonra (4 Eylülde) girilmiştir. Kesin tesbitlerimiz olmamakla beraber, Ramazan'a girişlerine bakarak, bazı ülkelerde de 2 ve 5 Eylül günlerinde bayram yapıldığım söylemek mümkündür. Yine bu yıl, Zilhicce hilalinin tesbitinde ve kurban bayramının ilânında karşılaşılan sonuç, Ramazan ve Şevval hilâllerinin durumundan farklı olmamıştır. Bazı İslâm ülkelerinde 31 Ekim akşamı Zilhicce hilâli görülmüş gibi 1 Kasım tarihi 1 Zilhicce olarak ilân edilirken, diğer bazılarında 2 Kasım günü 1 Zilhicce olarak kabul ve ilân edilmiştir. kanaatimiz olur ki, bu ayrılık, «İHTİLAF-I METALİ»'dan doğan bir ayrılık değildir. Bu ülkelerde hilâl gözlenmesi ve tesbitinin yol açtığı bir ayrılık da değildir. Şu veya bu ülkelerin hilâli bizzat gözleyerek ve sadece bu gözlem olarak ilân ettiklerini, diğerlerinin ise, bunu yapmadıkları için yanlış yolda olduklarını iddia etmek de imkânsızdır. İhtilâfın temelinde, İslâm ülkelerinde uygulanan farklı metotlar yatmaktadır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 336
			}
		},
		{
			"hadithnumber": 337,
			"arabicnumber": 337,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 337
			}
		},
		{
			"hadithnumber": 338,
			"arabicnumber": 338,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 338
			}
		},
		{
			"hadithnumber": 339,
			"arabicnumber": 339,
			"text": "İmâm-ı Mâlik; der ki: Bahçeye bakan kimsenin, mal sahibine, orada müsakat anlaşması esnasında bulunmayan kölelerin bahçede çalışmalarını şart koşması caiz değildir. Zira bu, müsâkât şartlan üzerine bir ziyadelik olur ki, bu da doğru değildir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 339
			}
		},
		{
			"hadithnumber": 340,
			"arabicnumber": 340,
			"text": "Kehl b. Sa'd es-Saidi'den: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: «Müslümanlar iftarda acele ettikleri sürece hayırda daim olurlar.» Buhârî, Savm, 30/45; Müslim, Siyam, 13/9",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 340
			}
		},
		{
			"hadithnumber": 341,
			"arabicnumber": 341,
			"text": "Humeyd b. Abdurrahman'dan: Ömer b. Hattab ve Osman b. Aftan, akşam namazlarını kılar, namazdan sonra hava kararınca Ramazan oruçlarını açarlardı. Şeybanî, 365",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 341
			}
		},
		{
			"hadithnumber": 342,
			"arabicnumber": 342,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 342
			}
		},
		{
			"hadithnumber": 343,
			"arabicnumber": 343,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 343
			}
		},
		{
			"hadithnumber": 344,
			"arabicnumber": 344,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 344
			}
		},
		{
			"hadithnumber": 345,
			"arabicnumber": 345,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 345
			}
		},
		{
			"hadithnumber": 346,
			"arabicnumber": 346,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 346
			}
		},
		{
			"hadithnumber": 347,
			"arabicnumber": 347,
			"text": "İmâm-ı Mâlik'den: Ramazanda yolculuğa çıkmış olan bir kimse içinde bulunduğu günün sabahı tan yeri ağardıktan sonra eve döneceğini bilse oruca niyetlenir. Mâlik der ki: Bir kimse Ramazanda yolculuğa çıkmak istese, henüz daha memleketinden ayrılmadan şafak sökse, o gün akşama kadar orucunu tutar",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 347
			}
		},
		{
			"hadithnumber": 348,
			"arabicnumber": 348,
			"text": "Ebû Hüreyre'den: Adamın biri Ramazanda orucunu bozmuştu. Resûlüllah (sallallahü aleyhi ve sellem) ona ya bir köle azat ederek, ya iki ay devamlı oruç tutarak, ya da altmış fakiri doyurarak kefaret vermesini emretti. Adam: Bulamam.» deyince Resûlüllah'a (sallallahü aleyhi ve sellem) bir sele hurma getirilmişti: bunu tasadduk et.» buyurdu. Adam: Resûlallah! Benden daha muhtaç kimse yok.» deyince Resûlüllah (sallallahü aleyhi ve sellem) yan dişleri görülecek şekilde güldü ve: Onu ye!» buyurdu. Buhârî, Savm, 30/30; Müslim, Sıyâm, 13/81. Ayrıca bkz. Şeybanî, 349. Hanefi Mezhebine göre, kasten yemek, içmek ve cinsî birleşme sonucunda oruç bozmanın cezası bir gün kaza, iki kameri ay oruç tutmak, gücü yetmezse altmış fakiri doyurmaktır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 348
			}
		},
		{
			"hadithnumber": 349,
			"arabicnumber": 349,
			"text": "İmâm-ı Mâlik'den: Alimlerin şöyle dediklerini işittim; Ramazanın kazasını yaparken, gündüz veya başka bir vakitte hanımıyla cinsi münasebette bulunan kimseye, Resûlüllah (sallallahü aleyhi ve sellem) tarafından Ramazanda gündüz cinsi münasebette bulunan kimseye verileceği bildirilen kefaret gerekmez. Sadece orucun kazası gerekir. Mâlik şöyle demiştir: Bu konuda duyduğum en güzel hüküm budur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 349
			}
		},
		{
			"hadithnumber": 350,
			"arabicnumber": 350,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 350
			}
		},
		{
			"hadithnumber": 351,
			"arabicnumber": 351,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 351
			}
		},
		{
			"hadithnumber": 352,
			"arabicnumber": 352,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 352
			}
		},
		{
			"hadithnumber": 353,
			"arabicnumber": 353,
			"text": "İmâm-ı Mâlik'ten: Alimlerden şöyle duydum: Bir kimse hastalansa, hastalığından dolayı oruç tutmak onu yorsa ve bir hayli güç duruma soksa orucunu bozabilir. Namazda ayakta durması zor olan ve bu yüzden güç durumda kalan kimse de oturarak namazını kılabilir. Allah, kulunun özrünü daha iyi bilir. Allah'ın dini kolaydır. teâlâ seferde oruç tutmamaya müsaade etmiştir, halbuki Seferde olan oruca hastadan daha iyi dayanır. Kur'an-ı Kerim'de «Sizden hasta olanlar veya seferî olanlar tutmadıkları günler kadar başka günlerde tutarlar...» buyurulmaktadır. en güzel Rivâyet budur. Bu konuda ittifak vardır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 353
			}
		},
		{
			"hadithnumber": 354,
			"arabicnumber": 354,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 354
			}
		},
		{
			"hadithnumber": 355,
			"arabicnumber": 355,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 355
			}
		},
		{
			"hadithnumber": 356,
			"arabicnumber": 356,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 356
			}
		},
		{
			"hadithnumber": 357,
			"arabicnumber": 357,
			"text": "İmâm-ı Mâlik'ten: Kazaya kalan Ramazan oruçlarını aralıklı olarak tutana tekrar kaza etmek gerekmez. Çeşitli günlerde tutmuş olması, borcunu ödemeye yeterlidir. Ama bana kalırsa, en iyisi hepsini peş peşe ara vermeden tutmaktır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 357
			}
		},
		{
			"hadithnumber": 358,
			"arabicnumber": 358,
			"text": "Nafî'den: Abdullah b. Ömer aile çevresinde Mücebber diye bilinen biriyle karşılaştı. Ziyaret tavafinı yapmış, fakat ne traş olmuş ne de saçlarını kısaltmıştı. Böyle yapacağını bilmiyordu. Bunun üzerine Abdullah ona geri dönüp tıraş olmasını ya da saçlarını kısaltmasını, daha sonra da Beytullah'ı tavaf edip dönmesini söyledi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 358
			}
		},
		{
			"hadithnumber": 359,
			"arabicnumber": 359,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 359
			}
		},
		{
			"hadithnumber": 360,
			"arabicnumber": 360,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 360
			}
		},
		{
			"hadithnumber": 361,
			"arabicnumber": 361,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 361
			}
		},
		{
			"hadithnumber": 362,
			"arabicnumber": 362,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 362
			}
		},
		{
			"hadithnumber": 363,
			"arabicnumber": 363,
			"text": "Humeyd b. Kays el-Mekkî'den: Mücahit, Beytullah'ı tavaf ederken ben de yanında idim. Biri kendisine gelerek: Kefaret oruçları peş peşe mi, yoksa aralıklı olarak mı tutulacak?» diye sordu. Bunun üzerine ben hemen: Evet, isterse aralıklarla tutabilir.» diye cevap verdim. Mücahit ise: Hayır, kesintisiz olarak tutar. Çünkü Übey b. Kab kıraatında, peşpeşe üç gün, denilmektedir.» diye itiraz etti",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 363
			}
		},
		{
			"hadithnumber": 364,
			"arabicnumber": 364,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 364
			}
		},
		{
			"hadithnumber": 365,
			"arabicnumber": 365,
			"text": "İmâm-ı Mâlik'e şöyle bir soru soruldu: «Kadının biri Ramazanda sabahleyin oruçlu olarak kalktı. Ay hali olmadığı halde birden bire saf bir kan boşandı. Tekrar gelir diye akşama kadar bekledi, fakat gelmedi. Ertesi gün tekrar yine bir kan daha geldi, fakat bu seferki ilk gününkinden azdı. Daha sonra bu kan aybaşı günlerinden önce kesildi. Bu durumdaki kadın namazını, orucunu ne yapar? İmâm-ı Mâlik şu cevabı verdi: «Bu hayız kanıdır. Görünce hemen orucunu bozsun, sonradan kaza eder. Kan kesilince gusletsin ve orucunu tutsun.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 365
			}
		},
		{
			"hadithnumber": 366,
			"arabicnumber": 366,
			"text": "İmâm-ı Mâlik'ten: Bana kalırsa Cenabı Allah'ın Kur'anda tayin ettiğinin «peşpeşe tutulur» olmasıdır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 366
			}
		},
		{
			"hadithnumber": 367,
			"arabicnumber": 367,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 367
			}
		},
		{
			"hadithnumber": 368,
			"arabicnumber": 368,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 368
			}
		},
		{
			"hadithnumber": 369,
			"arabicnumber": 369,
			"text": "İmâm-ı Mâlik der ki: Cenab-ı Allah'ın ayeti kerimedeki: «Sizden biri hastalanır veya bir yolculuğa çıkarsa tutmadığı günleri kaza eder» emrine dayanarak, ana karnındaki çocuk için duyulan korkunun da bir nevi hastalık olduğunu ve bu sebeple hamile kadının tutmadığı oruçları kaza etmesi gerektiğini savunurlar",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 369
			}
		},
		{
			"hadithnumber": 370,
			"arabicnumber": 370,
			"text": "Abdurrahman'ın babası Kasım'dan: Her kim kazaya kalan Ramazan orucunu sıhhatine kavuştuğu ve ertesi yılki Ramazan da geldiği halde hâlâ kaza edememişse, kazaya kalan her oruç için bir fakire bir müd buğday verir, ayrıca oruçlarını da kaza eder",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 370
			}
		},
		{
			"hadithnumber": 371,
			"arabicnumber": 371,
			"text": "İmâm-ı Mâlik'den; Said b. Cübeyr'in buna benzer bir fetvasını duymuştum",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 371
			}
		},
		{
			"hadithnumber": 372,
			"arabicnumber": 372,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 372
			}
		},
		{
			"hadithnumber": 373,
			"arabicnumber": 373,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 373
			}
		},
		{
			"hadithnumber": 374,
			"arabicnumber": 374,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 374
			}
		},
		{
			"hadithnumber": 375,
			"arabicnumber": 375,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 375
			}
		},
		{
			"hadithnumber": 376,
			"arabicnumber": 376,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 376
			}
		},
		{
			"hadithnumber": 377,
			"arabicnumber": 377,
			"text": "İmâm-ı Mâlik'ten: İbn Şihab'a, Îtikâfta bulunan kimse def-i hacet için tavan altına girebilir mi?» diye sordum. Evet, bir mahzur yok!» cevabını verdi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 377
			}
		},
		{
			"hadithnumber": 378,
			"arabicnumber": 378,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 378
			}
		},
		{
			"hadithnumber": 379,
			"arabicnumber": 379,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 379
			}
		},
		{
			"hadithnumber": 380,
			"arabicnumber": 380,
			"text": "Hazret-i Aişe'den: Resûlüllah (sallallahü aleyhi ve sellem) itikâfa girmek istemişti. Itikâfa gireceği yere varınca baktı ki Hazret-i Aişe'nin, Hafsa'nın ve Âişe (radıyallahü anha)'in çadırları orada kurulu. Onları görünce sordu. Kendisine: Aişe'nin, Hafsa'nın ve Âişe (radıyallahü anha)'in çadırları!» dendi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu; İyilik mi yaptık sanıyorsunuz?» sonra da itikâfa girmeden döndü gitti. Bunun yerine Şevval ayında on gün itikâf yaptı. Buharî, itikâf, 33/7; Müslim, İtikâf, 14/6",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 380
			}
		},
		{
			"hadithnumber": 381,
			"arabicnumber": 381,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 381
			}
		},
		{
			"hadithnumber": 382,
			"arabicnumber": 382,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 382
			}
		},
		{
			"hadithnumber": 383,
			"arabicnumber": 383,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 383
			}
		},
		{
			"hadithnumber": 384,
			"arabicnumber": 384,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 384
			}
		},
		{
			"hadithnumber": 385,
			"arabicnumber": 385,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 385
			}
		},
		{
			"hadithnumber": 386,
			"arabicnumber": 386,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 386
			}
		},
		{
			"hadithnumber": 387,
			"arabicnumber": 387,
			"text": "Ömer b. Hattab'ın azatlısı Eşlem, Abdullah b. Ömer'e anlatıyor: Ömer b. Hattab, ihramda olan Talha b. Ubeydullah'ın üzerinde boyalı bir elbise gördü. Ömer (radıyallahü anh): Talha, bu boyalı elbise de ne?» dedi. Talha: Mü’minlerin emiri, o kerpiç boyasıdır.» dedi. Bunun üzerine Hazret-i Ömer: Siz ey halkın kendilerini lider kabul edip uyduğu kimseler! Eğer bilmiyen bir adam bu elbiseyi görse, muhakkak der ki; Talha b. Ubeydullah ihramlı iken boyalı elbise giyiyordu. Onun için ey ileri gelenler! Böyle boyalı elbise cinsinden bir şey giymeyiniz.» dedi. Şeybanî, 425",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 387
			}
		},
		{
			"hadithnumber": 388,
			"arabicnumber": 388,
			"text": "Furâfisa b. Umeyr el-Hanefî'den: Osman b. Affan'ı (Medine'ye üç konak mesafede bulunan) Arc'da ihramlı iken gördüm, yüzünü kapatıyordu. Şeybanî, 417",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 388
			}
		},
		{
			"hadithnumber": 389,
			"arabicnumber": 389,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 389
			}
		},
		{
			"hadithnumber": 390,
			"arabicnumber": 390,
			"text": "Ata b. Ebî Rebah'tan: Resûlüllah (sallallahü aleyhi ve sellem) Huneyn'de iken kendisine bir Arap geldi. Üzerindeki gömlekte sarı boya izi vardı. Ya Resûlallah! Ben umre için ihrama girdim, neleri yapmamı emrediyorsunuz?» dedi. Resûlüllah (sallallahü aleyhi ve sellem): Gömleğini çıkar, şu sarı lekeyi temizle, ondan sonra da hacda ne yaparsan umrede de onu yap.» buyurdu. Buhârî, Hacc, 25/17; Müslim, Hacc, 15/6",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 390
			}
		},
		{
			"hadithnumber": 391,
			"arabicnumber": 391,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 391
			}
		},
		{
			"hadithnumber": 392,
			"arabicnumber": 392,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 392
			}
		},
		{
			"hadithnumber": 393,
			"arabicnumber": 393,
			"text": "İmâm-ı Mâlik'ten: Alimlerin şöyle dediklerini duydum: Kadınlar telbiyede, seslerini sadece kendileri duyacak kadar yükseltirler",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 393
			}
		},
		{
			"hadithnumber": 394,
			"arabicnumber": 394,
			"text": "İmâm-ı Mâlik'ten: kimse cemaatle bulunduğu zaman sesini yükseltmez, kendisi ve yanındaki duysun yeter. Ancak Mescid-i Haram ve Mescid-i Mina 'da seslerini yükseltirler",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 394
			}
		},
		{
			"hadithnumber": 395,
			"arabicnumber": 395,
			"text": "Hazret-i Aişe'den: Veda haccında Resûlüllah (sallallahü aleyhi ve sellem)'la yola çıktığımızda bazımız umre için, bazımız hac ve umre için, bazımız da sadece hac için ihrama girmişti. Resûlüllah (sallallahü aleyhi ve sellem) da sadece hac için ihrama girmişti. Umre için ihrama girenler ihramdan çıktı, fakat sırf hac için ve hacla umre için ihrama girmiş bulunanlar bayramın birinci gününe kadar ihramdan çıkmadılar. Buharî, Hacc, 25/34; Müslim, Hacc, 15/118",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 395
			}
		},
		{
			"hadithnumber": 396,
			"arabicnumber": 396,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 396
			}
		},
		{
			"hadithnumber": 397,
			"arabicnumber": 397,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 397
			}
		},
		{
			"hadithnumber": 398,
			"arabicnumber": 398,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 398
			}
		},
		{
			"hadithnumber": 399,
			"arabicnumber": 399,
			"text": "İmâm-ı Mâlik'e: Medineli veya başka bir memleketli olup da Mekke'den hac için Zilhicce ayının başlarında ihrama giren kimse tavafi nasıl yapar?» diye sordular. Şu cevabı verdi: Safa ile Merve arasında yapılan sa'ya bitişik (yani farz) olan tavafı ertelesin. Bu arada istediği tavafi yapsın. Her yedi şavt tavaftan sonra iki rekât namaz kılsın. Çünkü ashaptan hac için ihrama girenler de bu şekilde Kabe'yi tavafı ve sa'yı Mina'dan dönünceye kadar ertelemişlerdi. Abdullah b. Ömer de Zilhiccenin başlarında Mekke'den hac için ihrama girer, Mina'dan dönünceye kadar tavaf ile sa'yı ertelerdi.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 399
			}
		},
		{
			"hadithnumber": 400,
			"arabicnumber": 400,
			"text": "Abdurrahman’ın kızı Amre anlatıyor: Ziyad b. Ebî Süfyan, Hazret-i Aişe'ye bir mektup yazarak: «Abdullah b. Abbas, kurbanlık hayvanını gönderen kimseye, kurban kesilinceye kadar hac yapanlara haram olanlar haramdır, dedi. Ben de kurbanlığımı gönderdim. Bana emrini yaz veya kurbanın sahibine bildir.» dedi. Hazret-i Aişe de ona şu cevabı verdi: «İbn Abbas'ın dediği gibi değildir. Ben Resûlüllah'ın (sallallahü aleyhi ve sellem) kurbanlığının nişanını kendi ellerimle büktüm, sonra da Resûlüllah (sallallahü aleyhi ve sellem) onu kendi eliyle hayvana takarak babamla gönderdi. Bu arada Hazret-i Peygamber, kurban kesilinceye kadar Allahü teâlâ'nın kendisine helâl kıldığı hiç bir şeyden mahrum kalmadı.» , Hacc, 25/109; Müslim, Hacc, 15/369, Ayrıca bkz. Şeybanî, 398",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 400
			}
		},
		{
			"hadithnumber": 401,
			"arabicnumber": 401,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 401
			}
		},
		{
			"hadithnumber": 402,
			"arabicnumber": 402,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 402
			}
		},
		{
			"hadithnumber": 403,
			"arabicnumber": 403,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 403
			}
		},
		{
			"hadithnumber": 404,
			"arabicnumber": 404,
			"text": "Nevfel b. Abdulmuttalib'in torunu, Abdullah b. Haris'in oğlu Muhammed anlatıyor: Sa'd b. Ebî Vakkas'la Dahhak b. Kays, Muaviye b. Ebî Süfyan’ın hac ettiği sene, temettü haccından bahsediyorlardı. Dahhak b. Kays: Temettü haccını sadece aziz ve celil olan Allah’ın emrini bilmeyen cahiller yapar» dedi. Bunun üzerine Sa'd: Yeğenim iyi söylemedin!» deyince Dahhak: Ömer b. Hattab temettü haccını yasakladı.» diye karşılık verdi. Sa'd da cevaben: Resûlüllah (sallallahü aleyhi ve sellem) haccı temettuu yaptı, biz de onunla beraber yaptık» dedi. Ömer'in temettü haccım yasakladığı şu kitaplarda yer alır: Buharî, Hacc, 25/125 (Ebu Musa'dan); Müslim, Hacc, 15/154",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 404
			}
		},
		{
			"hadithnumber": 405,
			"arabicnumber": 405,
			"text": "Abdullah b. Ömer'den: Kim hac ayları ile Şevval, Zilkade ve Zilhicce aylarında hacdan önce umre yapar, sonra da Mekke'de kalarak hac zamanı haccını yaparsa, bu kimse temettü haccı yapmış olur. Onun için kolayına gelen cinsten bir kurban kesmesi, bulamazsa hacda üç gün ve dönünce de yedi gün oruç tutması lâzımdır. Mâlik der ki: «Yukarıdaki durum, şayet umreden sonra hac zamanına kadar Mekke'de ikamet edilir ve aynı yıl hac yapılırsa, geçerlidir.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 405
			}
		},
		{
			"hadithnumber": 406,
			"arabicnumber": 406,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 406
			}
		},
		{
			"hadithnumber": 407,
			"arabicnumber": 407,
			"text": "Ebû Bekr b. Abdurrahmandan: Resûlüllah'a (sallallahü aleyhi ve sellem) bir kadın gelerek: Hac için hazırlanmıştım, bir engel çıktı!» dedi. Resûlüllah (sallallahü aleyhi ve sellem) ona: Ramazan'da umre yap, çünkü o da hac gibidir» buyurdu. Ebu Davud, Hacc, 11/79; Tirmizî, Hacc, 7/95; Nesaî, Sıyâm, 24/6; İbn Mace, Hacc (menâsik), 25/45. Ayrıca bkz. Şeybanî, 450",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 407
			}
		},
		{
			"hadithnumber": 408,
			"arabicnumber": 408,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 408
			}
		},
		{
			"hadithnumber": 409,
			"arabicnumber": 409,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 409
			}
		},
		{
			"hadithnumber": 410,
			"arabicnumber": 410,
			"text": "İmâm-ı Mâlik'ten: Sa'd b. Müseyyeb; Salim b. Abdillah ve Süleyman b. Yesar'â «İhramda bulunan kimsenin nikahlanma veya nikâh kıyma durumuyla ilgili» bir soru soruldu. Onlar şu cevabı verdiler: İhramda bulunan ne kendisi için nikâh kıydırabilir, ne de başkası için nikâh kıyabilir.»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 410
			}
		},
		{
			"hadithnumber": 411,
			"arabicnumber": 411,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 411
			}
		},
		{
			"hadithnumber": 412,
			"arabicnumber": 412,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 412
			}
		},
		{
			"hadithnumber": 413,
			"arabicnumber": 413,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 413
			}
		},
		{
			"hadithnumber": 414,
			"arabicnumber": 414,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 414
			}
		},
		{
			"hadithnumber": 415,
			"arabicnumber": 415,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 415
			}
		},
		{
			"hadithnumber": 416,
			"arabicnumber": 416,
			"text": "Eyyüb b. Musa'dan: Abdullah b. Ömer ihramlı iken gözündeki bir ağrıdan dolayı aynaya baktı",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 416
			}
		},
		{
			"hadithnumber": 417,
			"arabicnumber": 417,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 417
			}
		},
		{
			"hadithnumber": 418,
			"arabicnumber": 418,
			"text": "Nafî' anlatıyor: Abdullah b. Ömer siyasi karışıklıkların (fitne) zuhur ettiği zaman Mekke'ye doğru yola çıkınca şöyle dedi: «Şayet Beytullah'ı tavaf etmemize engel olunursa, Resûlüllah'ın (sallallahü aleyhi ve sellem) sağlığında beraber yaptığımız gibi yaparız.» Daha sonra Resûlüllah (sallallahü aleyhi ve sellem)'ın Hudeybiye'de Umre için ihrama girdiği gibi o da Umre için ihrama girdi. Bilahare Abdullah duruma bakarak: «Hac da umre de aynı şeydir.» diyerek arkadaşlarına döndü ve: «ikisi de aynıdır, şahidim olun ki hacla umreye beraber niyet ediyorum» diyerek sözlerini tamamladı. Daha sonra Beytullah'a kadar gelerek tek bir tavaf yaptı, bunu kâfi görerek kurbanını gönderdi. Buharî, Megâzî, 64/35; Müslim, Hacc, 15/180",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 418
			}
		},
		{
			"hadithnumber": 419,
			"arabicnumber": 419,
			"text": "Hazret-i Aişe'den: İhramlı kimse Beytullah'ı tavaf etmedikçe ihramdan çıkamaz",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 419
			}
		},
		{
			"hadithnumber": 420,
			"arabicnumber": 420,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 420
			}
		},
		{
			"hadithnumber": 421,
			"arabicnumber": 421,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 421
			}
		},
		{
			"hadithnumber": 422,
			"arabicnumber": 422,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 422
			}
		},
		{
			"hadithnumber": 423,
			"arabicnumber": 423,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 423
			}
		},
		{
			"hadithnumber": 424,
			"arabicnumber": 424,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 424
			}
		},
		{
			"hadithnumber": 425,
			"arabicnumber": 425,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 425
			}
		},
		{
			"hadithnumber": 426,
			"arabicnumber": 426,
			"text": "Sa'y yaparken abdesti bozulursa, sa'yi kesmesi gerekmez. Sa'ye ancak abdestli olarak başlanır",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 426
			}
		},
		{
			"hadithnumber": 427,
			"arabicnumber": 427,
			"text": "Yahya b. Saîd'den: Ömer b. Hattab, Beytullah'a veda tavafı yapmadan ayrılan bir adamı Merruz Zahran'dan geri çevirip veda tavafı yaptırdı. Merruz Zahran: Mekke yakınlarında bir vadinin ismi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 427
			}
		}
	]
}