{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1059,
			"arabicnumber": "471.03",
			"text": "{….} Bize Muhammedü'bnü Müsennâ ile ibn-i Beşşâr rivayet ettiler. Dediler ki; Bize Muhammed b. Câ'fer rivayet etti. (Dediki): Bize Şu'be, Hakem'den naklen rivayet ettiki: Matar b. Naciye Kufe'yi raptedince Ebu Ubeyde'ye halka namaz kıldırmasını emretmiş... Ve hadisi rivayet etmiştir. İzah Bu hadîsi Buhârî-Ezan» ve «Namaz» bahislerinde, Ebu Dâvud, Tirmizî ve Nesaî de «Namaz» bahsinde tahrîc etmişlerdir. Hadîs, namazda kıraat ve teşehhüdün hafif, rüku, sücut ve onlardan doğrulurken tume'nîneti, yâni azanın sükunet bulacağı kadar durmayı uzunca tutmaya delildir. Hadîsin ikinci rivayetinde Takriben birbirine müsavi idi,» denilmesi, bazı fiillerin diğerlerinden biraz daha uzun olduğunu gösterir. Bu da kıyam hâline mahsustur. Teşehhüdde dahî mümkündür. Nevevî’nin beyânına göre bu hadîs bazı ahvâle hamledilmiştir. Yoksa buraya kadar geçen hadîslerden Resulullah (Sallallahu Aleyhi veSellem)'in kıyamı uzatırdığı anlaşılmıştır. Hattâ sabah namazında altmışdan yüze kadar âyet, öğle namazında sure-i secdeyi okurdu. O namaza durduğu vakit cemâatdan biri «Bakî'» tarafına kazâyi hacete gider; sonra evine dönerek abdest alır, mescide gider ve ilk rek'âta yetişebilirdi. Resulullah (Sallallahu Aleyhi ve Sellem)'in akşam namazında «Tur» ve «Mürselât» surelerini, Buharî'nin rivayetinde «Arâf» ve ona benzer sureler okuduğu beyân edilmiştir. Bunlar gösteriyor ki: Resulullah (Sallallahu Aleyhive Sellem)'in zaman zaman kıraati uzattığı olurmuş. Binâenaleyh babımız hadîsleri bâzı vakitler mânâsına hamledilmiştir. «Selâm vermekle, kalkıp gitme arasındaki oturuşunu takriben müsâvî buldum.» cümlesi Resulullah (Sallallahu Aleyhi ve Sellem)'in namazdan selâm verdikten sonra orada bir parça oturduğuna delildir. Kufe'yi zapteden zâtın ismi hadîsin birinci rivayetinde tasrîh edilmemiş ise de, ikinci rivayette bunun Matar b. Naciye olduğu bildirilmiştir Ebu Ubeyde Hz. İbni Mes'ud'un oğludur",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 221
			}
		}
	]
}