{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1082,
			"arabicnumber": "481",
			"text": "(Bana Amr b. Ali de rivâyet etti. ki): Bize Muhammed b. Câ'fer rivâyet etti. ki): Bize Şu'be, Ebû Bekir b. Hafs’dan, o da Abdullah b. Huneyn'den, o da İbn Abbâs'dan naklen rivâyet etti ki: İbn Abbâs: «Rükû halinde bulunduğum zaman Kur'ân okumaktan nehyolundum.» demiş. isnâtda Alî'yi zikretmemişdir. rivâyetlerin mecmuu rükû ve secdelerde Kur'ân okumanın memnu olduğunu bildirmektedirler. Ulemâya göre bundaki hikmet şudur: Rükû ve sücûd halleri kulun tevâzûunu ifade eder. Onun için bu haller zikre tahsîs edilmişlerdir. Binâenaleyh aynı halde Kelâmullah ile mahlûkun sözleri müsavi tutularak beraberce zikredilmeleri mekruh görülmüştür. Resûlüllah (sallallahü aleyhi ve sellem): müjdecilerinden muslumanın göreceği sâlih ru'yâdan başka bir şey kalmamıştır.» buyurarak kendilerinin vefatıyla nübüvvet alâmetlerinin sona ereceğine işaret etmiştir. Sâlih rü'yâdan muradı mutlaka gerçek rü'yâ değil, mülayim ve muvafık olan rü'yâdır. Çünkü sâdık rü'yâ bazen elem verici olabilir. Halbuki müjde arzu edilen bir şey vücut bulduğu zaman yapılır. Böyle bir rü'yânın müslümana taksîs edilmesi müslümanın sadık rü'yâ görmesi hususundaki hâli Peygamber (sallallahü aleyhi ve sellem)’in haline uyduğu içindir. (sallallahü aleyhi ve sellem) Efendimizin: secde veya rükû hallerinde Kur'ân okumaktan nehyolundum» zahirde hitabın kendisine mahsus olduğunu gösteriyorsa da, hakîkatta bu hitâb bütün ümmete şâmildir. Çünkü Resûl-i Ekrem (sallallahü aleyhi ve sellem) ancak kendisine tâbi olunmak için gönderilmiştir. Nehyin ona mahsus olmadığına, rükû hâlinde Allah'ı tazîm, secdede ise duâ etmelerini ashabına emretmesi de göstermektedir. Bu hallerdeki ta'zîra ve duaların ne şekilde yapılacağı ve ulemânın bu bâbdaki sözleri inşaallah bundan sonraki bâbda görülecektir. Ali (radıyallahü anh)’ın: Resûlüllah (sallallahü aleyhi ve sellem) rükû ve sücûd hâlinde Kur'ân okuraakdan beni nehyetti. Sizi nehyetti demiyorum.» şeklindeki ifâdesi nehyin ona mahsus olduğunu anlatmak için değil, Resûlüllah (sallallahü aleyhi ve sellem)’den işittiği gibi naklettiğini göstermek içindir. Binâenaleyh hüküm bütün ümmete şâmildir. bir rivâyetinde senedden İbn Abbâs Hazretleri iskât edilmiştir. Bu rivâyet daha mahfuzdur. Bâzı rivâyetlerde İbn Abbâs hazretlerinin zikredilmesi, bazılarında edilmemesi hadîsin sıhhatına tesîr etmez. Çünkü râvînin hadîsi bir defa İbn Abbâs vasıtasıyla Hazret-i Alî'den, başka bir defa da bizzat Ali (radıyallahü anh)’dan işitmiş olması mümkündür. Şerif, rükû ve sücûd hallerinde Kur'ân okumanın memnu olduğuna delildir. Rükûda yapılacak vazîfe teşbih, sücûdda ise tesbih ve duadır. göre namazın bir rüknünde namaz fiilleri cinsinden bir şey ziyâde etmek secde-i sehiv îcâbeder. göre rükû ve sücûdda fatihadan başka bir sûre veya âyet okumak mekrûhdur. Fakat namaz bozulmaz. Fatiha okumaya gelince, bu hususta şâfîîlerden iki kavil rivâyet olunur. Birinci kavle göre fatiha ile başka sûre arasında fark yoktur. Binâenaleyh fatiha okumak da mekruh-dur. Yalnız namazı bozmaz. îkinci kavle göre fatihayı kasden okumak haramdır, namazı bozar. Sehven okumak mekruh değildir. Fakat, gerek kasden, gerekse sehven okunduğu takdirde İmâm Şâfiîye göre secde-i sehiv lâzım gelir",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 244
			}
		}
	]
}