{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1092,
			"arabicnumber": "487.02",
			"text": "Bize Muhammed b. El-Müsennâ rivâyet etti. (Dedi ki) Bize Ebû Dâvûd rivâyet etti. ki): Bize Şu'be rivâyet etti. ki): Bana Katâde haber verdi. ki: Mutarrif b. Abdillâfa b. Şıhhîr'den dinledim. Dâvûd: «Bana da Hişâm, Katâdeden, o da Mutarrif den, o Âişe'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadisi rivâyet etti.» demiş. rivâyetler Peygamber (sallallahü aleyhi ve sellem)’in rükû m sücûdda okuduğu tesbih ve duaları göstermektedirler. Âişe hadîsini Buhârî «Kitâbü'l-Ezân», «Kitâbül-Megazî», «Kitâbü's-Salât» ve «Kitâbü't-Tefsîr» de, Ebû Dâvûd, Nesâî ve İbn Mâce dahi «Kitâbü's-Salât» da tahrîc etmişlerdir. Bu bâbda daha başka rivâyetler de vardır. Allahü teâlâ'ya yakınlığından murad, onun rahmetine yaku olmasıdır. Resûlüllah (sallallahü aleyhi ve sellem)’in duaya teşvik buyurması da bundandır. Fahri Kâinat (sallallahü aleyhi ve sellem) Efendimizin hiç bir günâhı olmadığı halde bütün günahlarının azını çoğunu, evvelini âhirini, aşikârını ve sırrım tasrih buyurmak suretiyle affını istemesi onun kemâli ubudiyetinden ve dâima Allahü teâlâ'ya muhtaç olduğunu îtiraf kabüindendendir. Nitekim: karşı senayı bitiremem, sen kendini nasıl sena ettinse öylecesin» buyurması da onun tarafından bir i'tirafı aczdir. Yani: «Yârabbi ben sana ne kadar sena etsem lâyık olduğun senayı yapmaya kudretim yetmez,» diyerek senanın adet ve mikdârını tâyine gücü yetmiyeceğini itiraf ile tafsilâtını ilmi her şeyi muhit olan Allâhu zülcelâle havale etmiştir. Zira Teâlâ hazretlerinin sıfatlarına nihayet olmadığı gibi, ona yapılacak senanın da sonu yoktur. Çünkü sena Allah'ın sıfatlarına tâbidir. Kul hamdü sena hususunda ne kadar takat sarfederek mübalâğa gösterse de Allah'ın azamet ve şanı, sıfatları, fadlü ihsanı onun senasından yine daha vâsi' ve çoktur. İmâm Mâlik'e göre; bunun manâsı: Yâ Rabb ben ne kadar çalışsam yine senin nimetlerini ve ihsanlarını sayıp bitiremem; demektir. mânâsı: Allahü teâlâ'yı her türlü noksanlıklardan tenzih demek olduğunu yukarıda görmüştük. hamdine bürünerek fesbîh eylerim» cümlesinin mânâsı: Yârab seni kendi gücüm ve kudretimle değil, ancak bana ihsan buyurduğun hidâyet ve fazlınla tenzih ederim; demektir. Sâlihînden Bazıları: «Senden mağfiret diler, sana tevbe ederim» gibi sözlerin caiz olmadığını, çünkü bunları söyliyen kulun icaplarını yapamıyarak yalancı çıkmak ihtimâli karşısında bulunduğunu, binâenaleyh kulun: «Yârabbi beni affet; tevbemi kabul buyur!» demesi îcâ-bettiğini söylemişlerse de hadîsin bütün rivâyetleri bunların aleyhine de-lîl olup «Senden mağfiret diler; sana tevbe ederim» demenin caiz hattâ müstehab olduğunu göstermektedir. sana sığınırım» cümlesinin mânâsı hakkında Hattâbî şunları söylemiştir: «Bu sözde lâtif bir mânâ vardır, şöyle ki: Resûlüllah (sallallahü aleyhi ve sellem) Allahü teâlâ’nın gadabından yine onun rızâsına, azabından afvü keremine sığınmıştır. Rızâ ile gazap ve keza azapla af birbirine tekabül eden zıt kelimelerdir. Mesele zıddı olmıyan Allahü teâlâ'ya varınca aynı mukabeleyi şeklen devam ettirerek Allah'dan Allah'a sığınmıştır. Bunun mânâsı ona karşı yaptığı ibâdet ve senalarda vâkî olan kusurlarından dolayı Allah'dan af dilemektir. ve Kuddüs kelimeleri Sebbûh ve kaddûs şeklinde de okuna-bilirse de birinci şekilde okunuşları daha fasîh ve bu şekilde rivâyetleri daha çoktur. Ulemâdan bâzılarına göre bunlar Allah'ın birer sıfatıdır. Bir takımları Allah'ın ismi olduklarını söylemişlerdir. Sübbûhun mânâsı: her türlü noksanlıklardan ve Allahü teâlâ'ya lâyık olmayan şeylerle şerik ve nazîrden münezzeh demektir. Kuddûs dahi: Allah'a lâyık olmayan her şeyden temizlenmiş mânasına gelir. Bâzılarına göre Kuddûs mübarek demektir. murâd: bâzılarına göre büyük bir melektir. Bir takımları bundan muradın Cibrîl (aleyhisselâm) olmasını muhtemel görmüşlerdir. «Ruh: Meleklerin de göremedikleri bir takım mahlûkattır.» diyenler de olmuştur. (radıyallahü anhâ) «Annem babam sana feda olsun! Ben ne hal peşindeyim, sen ne hâldesin.» demekle «Ben kıskançlık peşindeyim; sen ise dünya umurunu arkaya atmış; Allahü teâlâ'ya yönelmiş bir hâldesin.» demek istemiştir. (sallallahü aleyhi ve sellem)’in ümmeti hakkında göreceği alâmetten muradı, Sultânül müfessirîn İbn Abbâs hazretlerine göre ecelinin yaklaşmasıdır. Hattâ Hazret-i Ömer (radıyallahü anh) «Nasr» sûresinin son âyetlerini tefsir etmesini istediği zaman, bunların Resûlüllah (sallallahü aleyhi ve sellem)’in eceli yaklaştığına işaret ettik-lerini söylemişti",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 254
			}
		}
	]
}