{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1131,
			"arabicnumber": "506.02",
			"text": "(Bana İshâk b. İbrahim rivâyet etti. ki) Bize Ebû Bekir El-Hanefî haber verdi. ki): Bize Dahhâk b. Osman rivâyet etti. ki): Bize Sadakatü'bnü Yesâr rivâyet etti. ki: Ben İbn Ömer'i: «Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu...» diyerek bu hadîsin mislini rivâyet ederken dinledim. Saîd hadîsini Buhârî «Namaz», «Bed-i Halk» ve «Sı-fat-ı İblîs» bahislerinde, Ebû Dâvûd ile Nesâî dahi -Namaz» bahsinde tahric etmişlerdir. Ebî Muayt kabilesinden geldiği bildirilen genç adamın ismi bir rivâyette Velîd b. Ukbe diye tasrîh edilmiştir. İbnİ Ebî Şeybe'nin «Mûsannef» inde bu zâtın Abdurrahman b. Haris olduğu bildiriliyor. Abdürrezzâk'ın rivâyetinde ise Dâvûd b. Mervân nâmında bir zât olduğu görülüyor. Bu rivâyetlerin arasını bulmak için en güzel çâre vak'anın ayrı ayrı şahıslarla mü-teaddid defalar vukûbulduğuna kail olmaktır. murâd: Emevî hanedanından Mervân b. Haltem'dir. Bu zâtın Peygamber (sallallahü aleyhi ve sellem)’i gördüğü rivâyet olunur. Vâkıdî'nin beyânına göre Resûlüllah (sallallahü aleyhi ve sellem)’in vefatında Mervân sekiz yaşında çocukmuş. Ondan hadîs rivâyet edememiştir. Mervân o gün Medine'de Vali bulunuyordu. Hazret-i Ebû Saîde: «Kardeşin oğlu ile ne alıp veremiyorsun?» diyerek hâdisenin hakikatini anlamak istemiş ve bütün mü'minlerin kardeş olmasına bakarak din kardeşi yerine «Kardeşin oğlu» tâbirini kut-lanmışdır. Bu cümle: «Hazret-i Saîd'in önünden geçen genç Velîd b. Ukbe değildi.» diyenlerin sözünü te'yîd eder. Çünkü Velî d'in babası Ukbe kâfir olarak öldürülmüştür. Binâenaleyh onun oğlu hakkında «Kardeşin oğlu» denilemez. beyânına göre, namaz kılarken önünden geçen kimse işaretle ve hoş bir muameleyle geçmekden menedilir. Fakat hadisin zahirinden anlaşılıyor ki geçmek isleyen kimse işaret vb. den anlamaz da kendisini menetmek için döğüşmekten başka çâre kalmazsa nihayet ona da başvurulur. Çünkü bu derece inatlık gösteren kimse olsa olsa bir şeytândır. Resûlüllah (sallallahü aleyhi ve sellem) burada işaretten almayan inatçıyı bir teşbih-i belîg ile şeytâna benzetmiştir. Bâzılarına göre şeytandan murâd Resûlüllah (sallallahü aleyhi ve sellem)’in Önünden geçen kimsedir. Böyle inatçı kimselere lisanımızda dahi şeytân denir. Bazıları cümleye bir muzâf takdir ederek: «Bu ancak şeytânın yapacağı iştir.» şeklinde mânâ vermişlerdir",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 293
			}
		}
	]
}