{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1160,
			"arabicnumber": "519.02",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe ile Ebû Küreyb rivâyet ettiler. Dediler ki: Bize Ebû Muâviye rivâyet etti. H. bu hadîs'i Süveyd b. Saîd dahi rivâyet etti. ki): Bize Alî b. Müshir rivâyet etti. Bunların ikisi de A'meş'den bu isnâdla rivâyetde bulunmuşlardır. Küreyb'in rivâyetinde: «Elbisenin iki ucunu omuzları üzerine koyarak.» Ebû Bekir ile Süveyd'in rivâyetlerinde ise: «Elbiseyi boynuna dolamış olarak» ifâdeleri vardır. hadîsi Buhârî «Kitâbü's-Salât»'ın muhtelif yerlerinde: Ebû Hüreyre, Ömer b. Seleme ve Câbir b. Abdillâh (radıyallahü anhûm)’den tahrîc ettiği gibi Tirmizî Nesâî ve İbn Mâce. dahi ayni bahisde muhtelif râvîlerden rivâyet etmişlerdir. Elbise demektir. Kelimenin asıl mânası; dokunmuş bez, keten, ipek ve yün gibi şeylerdir. O zamanlar tam takım elbise biri izâr, diğeri ridâ olmak üzere iki sevb'den ibaretti. îzâr; bele bağlanır; ridâ da omuza alınırdı. Bunların ikisi bir hülle ederdi. Burada Sevb'den murâd ridâdır. Ridâ'nın giyiniş tarzı: Sağ omuzuna attığı ucu, sol omuzunun altından geçirerek; sol omuzuna attığını da sol kolunun altından çıkararak iki ucunu ya göğüs üzerinde, yahut sırt tarafından bağlamakla olur, Bu şekil giyinişe: Teveşşüh, iltifat ve istimal adları da verilir. BUf^ giyinişde elbisenin bir parsasını boyuna dolayıp bağlamanın meti, rükû' ederken elbisenin düşmemesi ve namaz kılan kimsenin kendi avret mahallini görmemesidir. bir elbise içinde namaz kılmanın caiz olduğuna ittifak etmişlerdir. Yalnız İbn Mes'ud (radıyallahü anh) buna kail olamamış; Tâvûs, İbrâhîm Nehaî, bir rivâyetde İmâm Ahmed b. Hanbel, Mâlikîler'den Abdullah b. Vehb, İbn Cerîr-i Taberî de bir tek elbise içinde namaz kılmanın mekruh olduğunu söylemişlerdir. Onlara göre bir elbiseden başka giyecek şey bulamayan kimsenin o elbiseye sarınarak namaz kılması yine mekrûhdur. Sünnet vecihle kılmış olmak için onu giymiş olması îcab eder. Delilleri Tahâvî'nin rivâyet ettiği İbn Ömer hadîs'idir. Mezkûr hadîs'de Resûlüllah (sallallahü aleyhi ve sellem): namaz kıldığı vakit iki elbisesini de giysin: Zîrâ huzuruna ziy-nefli çıkmaya en lâyık olan zât Allâh'dır. İki elbisesi olmayan kimse namaz kılarken elbisesini giysin. Yahûdiler gibi namaz kılarken ona sarınmasın!» Hadîsi Beyhakî dahi rivâyet etmiştir. Kiram ile Tâbiî'nin ulemâsı bir tek elbise içinde namaz kılınabileceğine kail olmuşlardır. Ashâb'dan buna kail olanlar: İbn Abbâs, Ebû Hüreyre, Ebû Saîd-i Hudrî, Ali b. Ebû Tâlib', Muâviyetü'bnü Ebî Süfyân, Enes b. Mâlik, Hâlîd b. Velîd, Câbir b. Abdillâh, Amma b. Yâsir, Übey b. Kâ'b, Âişe, Esma’ve Ümmü Hânî (radıyallahü anhûm); de Hasan-ı Basrî, Muhammed b. Şîrîn, Şâ'bî, Saîd b. El-Müseyyeb, Ebû Selemete'bnü Abdirrahmân, Muhammed b. Hanefiyye, Atâ' b. Ebî Rabâh, İkrime ve Ebû Hanîfe hazerâtı ile fukahâ'dan Ebû Yûsuf, Muhammed, İmâm Mâlik, İmâm Şâfiî, bir rivâyet de İmâm Ahmed b. Hanbel, İshâh b. Râhuye ve pek çok zevât'dır. Bunlar Bâbımız hadîsleri ile istidlal etmişlerdir. Hattâ Tahâvî; «Başka elbise bulduğu hâlde bir tek etbiseye sarınarak namaz kılmanın caiz olduğunu bildiren hadîsler tevatür derecesini bulmuşdur.» demiş ve bu bâbda 11 sahabeden rivâyetler serdetmiştir. Bundan maada bu bab'da Ebû Hüreyre, Câbir, Selemetübnü Ekvâ', Enes, Amr b. Ebî Esed, Ebû Saîd-i Hudrî, İbn Abbâs, Âişe, Ümmü Hânî, Ammâr b. Yâsir, Talk b. Alî, Ubâdetü'bnü Sâmit, Huzeyfe, Alî' b. Ebî Tâlip, Muâz b. Cebel, Muâviyetü'bnü Ebî Süfyân, Ebû Ümâme, Ümmü Habîbe, Ümmü Fadıl ve daha birçok ashâb-i kirâm (radıyallahü anhûm) hazerâtından rivâyetler vardır. Bütün bu hadîslerden anlaşıldığına göre bir tek elbise içinde namaz kılmakdan nehy tahrîm için değil, tenzih içindir. (sallallahü aleyhi ve sellem)'in hasır üzerinde, namaz kılması yere bir şey yayarak üzerinde namaz kılınabileceğine delildir. Cumhûr-u Ulemâya göre hasır gibi nebatî, yahut seccade gibi yün veya yapağıdan dokuma şeyler üzerinde namaz kılmak mekruh değildir. Bu husûsda Kâdi Iyâz şunları söylemig'dir: «Yerden yetişen ne-bâtât'dan yapma seccade üzerinde namaz kılmakda hiç bir kerahet yok-dur. Nebatî olmayan yaygı, keçe vb. gibi şeyler üzerinde dahi bilicmâ namaz sahîh'dir. Lâkin sıcak ve soğuk gibi ihtiyâçlar müstesna, yer hepsinden efdaldir. Çünkü namazın sırrı Allah'a tevazu' ve hudû'dur.»",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 322
			}
		}
	]
}