{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1175,
			"arabicnumber": "524.03",
			"text": "(Bize bu hadîsi Yahya b. Yahya da rivâyet etti. ki): Bize Hâlid (yani İbni-Hâris) rivâyet etti. ki) Bize Şu'be, Ebû't-Tey-yâh'dan rivâyet etti. Ebû't-Teyyâh: Resûlüllah (sallallahü aleyhi ve sellem) şöyle yapardı diyerek yukarki hadîsin mislini söylerken işitdim» demiş. hadîsi Buhârî «Namaz» «Hacc» «Büyü ve «Hicret» bahislerinde; Ebû Dâvûd, Nesâî ve İbn Mâce dahi «Namaz» bahislerinde muhtelif râvîlerden tahrîc etmişlerdir. şerîf Peygamber (sallallahü aleyhi ve sellem)’in Medine'deki mescidlerinden bahsetmektedir. Yine bu hadîsde işaret edildiğine göre Fahr-i Kâinat (sallallahü aleyhi ve sellem) Efendimiz Mekke'den Medine'ye hicret ederken «Aliye» denilen yerde yani «Küba» da on dört gün kalmış orada ensânn ileri gelenlerinden Benî Amr b. Avf kabilesine misafir olmuşdu. İşte Resûlüllah (sallallahü aleyhi ve sellem) ilk mescidini buraya kurmuşdur. Küba, Medine'ye iki veya üç mil mesafede bir köydür. Muhammed b. Mûsâ El-Harzemî'nin beyânına göre Resûlüllah (sallallahü aleyhi ve sellem)’in oraya gelişi milâdî (623) târihine tesadüf eder. Peygamber (sallallahü aleyhi ve sellem)'in Küba'da yirmidört gün kaldığını, bir takımları da onsekiz gün olurduğunu söylerlerse de ekseri rivâyetler burada olduğu gibi ondört gün kaldığını bildirmektedir. Bundan sonra Resûlüllah (sallallahü aleyhi ve sellem) dayıları olan Benî Neccâr kabilesinin ileri gelenlerine haber göndermiş, onlar da kılınçlannı kuşanarak hemen kendisini istikbâle çıkmışlardı. Zâten o günlerde Resûlüllah (sallallahü aleyhi ve sellem)'in Medine'ye geleceği beklendiği için bütün Medîne halkı sokaklara yol boylarına diziliyor Resûlüllah (sallallahü aleyhi ve sellem)'i misafir etmek için hasretle yolunu bekliyorlardı. Peygamber (sallallahü aleyhi ve sellem)’in Küba'dan Medine'ye hareketi bir cum'â gününe tesadüf eder. O gün Peygamber (sallallahü aleyhi ve sellem) Efendimiz cum'â namazını Küba ile Medîne arasında «Rânûnâ» denilen yerde oturan Benî Salim b. Avf kabilesinin yanında kılmış; Medine'ye namazdan sonra girmişdir. zahirine bakılırsa Medine'ye girerken Resûlüllah (sallallahü aleyhi ve sellem) devesinin üzerinde, Ebû Bekir (radıyallahü anh) da terkisindeymiş. Rivâyetlerden anlaşıldığına göre Hazret-i Ebû Bekir'in de devesi varmış. Şu halde Ebû Bekir (radıyallahü anh) Resûl-i Ekrem (sallallahü aleyhi ve sellem)'in terkisinde bulunmak şerefine nail olmak için kendi devesinden inmiş de Resûlüllah (sallallahü aleyhi ve sellem)’in devesine binmişdir. Yahut kendi devesinden, inmemiş fakat Peygamber Efendimiz hemen peşinden geldiği için terkisindeydi, denilmiştir. bir rivâyetinde cum'â namazından sonra Resûlüllah (sallallahü aleyhi ve sellem)'e Benî Sâlim'den bâzı zevat gelerek bir kaç zaman yanlarında misafir kalmasını rica ettikleri, fakat o bu ricayı kabul etmeyip yolunu serbest bırakın! Çünkü o me'murdur» dediği bil-dirliyor. Ayni rivâyete nazaran Peygamber (sallallahü aleyhi ve sellem) devesinin yularım tamâmiyle serbest bırakmış; hayvan istediği tarafa, istediği şekilde yürümek suretiyle ensârdan yedi kabilenin yanından geçmiş, hiç birinin yanına sapmamış. Kabileler hayvanı kendi taraflarına almak istedikçe Resûlüllah (sallallahü aleyhi ve sellem) aynı sözü tekrarlar yani: «Hayvanın yolunu serbest bırakın! Çünkü o memurdur.» dermiş. Bu suretle şimdiki Mescid-î Nebevî'nin kapısı yanına gelmişler. Deve orada çökmüş. Mescid-i Nebevî'nin yeri o zaman Beni Neccâr kabilesinden iki yetime âit harman yeri gibi bir boşlukmuş Resûlüllah (sallallahü aleyhi ve sellem) orada deveden inmemiş. Sonra deve kalkarak biraz yürümüş Peygamber (sallallahü aleyhi ve sellem) yularını yine serbest bırakmış. Hayvan biraz gittikden sonra arkasına bakmış ve tekrar geriye dönerek ilk defa çöktüğü yere çökmüş ve hırçınlık göstermiş. ResûM Ekrem (sallallahü aleyhi ve sellem) de üzerinden inmiş. Hazret-i Ebû Eyyûb eşyasını alarak onu evine misafir etmiş. Ebû Eyyûb'unismi Hâlid b. Zeyd El-Ensârî'dir. Rivâyete nazaran Resûlüllah (sallallahü aleyhi ve sellem)’in devesi Hazret-i Hâlid'in kapısı önünde çökünce Ensâr-ı Kirâm'dan Cebbar b. Sahır (radıyallahü anh) deveyi dürterek kaldırmağa ve kendi evine götürmeğe çalışmış. Hazret-i Hâlid bunu görünce: «Tâ Cebbar! Ona benim evimden mi kaldırmağa çalışıyorsun? Bana bak Peygamberi bak dinle gönderen Allah'a yemin ederim ki arada islâmiyet olmasaydı senin boynunu mutlaka kılınçla vururdum.» demiş. b. Sahır Bedir'de ve Akabe Beyâtında hâzır bulunmuş büyük bir sahâbîdir. Bazıları isminin Câbir b. Sahır olduğunu söylemişlerse de doğrusu Câbir değil Cebbar'dır. b. İshâk (?-151)'ın beyânına göre Yemen hükümdarlarından Tübba' İbn Hassan, Peygamber (sallallahü aleyhi ve sellem) dünyâya gelmezden bin sene önce Mekke'ye gelmiş, oradan da Medine'ye gitmiş. Yanında hukemâdan dört yüz kişi bulunuyormuş. Bu zevat kendi aralarında Medine'den çıkmamaya karar vermişler. Tübba' bunun sebebini sorunca: «Efendim biz kitaplarımızda Muhammed isminde bir Peygamber geleceğini, burası onun hicret di-yân olacağını görüyoruz. Onun işin burada kalmak isliyoruz. Olur ki onunla görüşürüz.» demişler. Bunun üzerine Tübbâ'da onlarla beraber Medine'de kalmaya niyet etmiş. Yanında bulunan hukemânm her birine Medine'de bir ev yapmış. Cariyeler satın alarak onları adamla-rıyle evlendirmiş. Hukemânm her birine bol bol paralar vermiş; bir de vasiyetname yazarak müslüman olduğunu onda tesbît etmiş. Vasiyetnameyi altın yazıyla bitirerek yamdaki hukemânm en büyüğüne teslim etmiş ve şayet Muhammed (sallallahü aleyhi ve sellem)'e yetişirse bu vasiyetnameyi ona vermesini, yetişmezse şocuklarından ona yetişecek olanın vermesi şartı ile sülâlesinin bu vasiyetnameyi muhafaza etmesini rica etmiş. Ayrıca Peygamber (sallallahü aleyhi ve sellem) Medine'ye Hicret ettiği zaman otursun diye ona bir de ev yaptırmış. Fakat Za-manla o ev bir çok sahipler değiştirmiş. Nihayet Hazret-i Ebû Eyyûb Hâlid b. Zeyd (radıyallahü anh)'a intikâl etmiş. İşte Hazret-i Ebü Eyyûb Yemen hükümdarının vasiyetnamesini teslim alan âlimin sülâlesindenmiş. Şâir Medine halkı ise Yemen hükümdarının maiyetinde bulunan dört yüz âlimin neslindenmişler. Resûlüllah (sallallahü aleyhi ve sellem) Medine'ye hicret edince Medîneliler Yemen hükümdarından kalan mektubu Ebû Leylâ isminde bir zât ile kendisine göndermişler. Resûlüllah (sallallahü aleyhi ve sellem) onu görünce: Ebû Leylâ'sın! Yanındada ilk Yemen hükümdarının mektubu var!» Ebû Leylâ bu sözlerin karşısında şaşırmış kalmış. Kendisi ile konuşanın iki cihan serveri Muhammed Mustafa (sallallahü aleyhi ve sellem) olduğunu fark edemiyerek: kimsin? Ben senin yüzünde sihir eseri göremiyorum.» demiş ve onun bir sihirbaz olduğunu tahmin etmiş. Bunun' üzerine Resûlüllah (sallallahü aleyhi ve sellem): Muhammed'im. Ver sen şu mektubu!» buyurarak mektubu açmış. Okuyunca üş defa «Salih kardeşim Tübba' Merhaba» demiş. kitaplarda Tübbâ'ın Zebur'a îmân ettiği bildirilir. Bâzı hadîslerde de ona sövülmemesi emir buyurulmuşdur. Sa'leb î'nin Sehl b. Sad (radıyallahü anh)'dan rivâyet ettiği bir hadîsde Hazret-i Sehl: «Resûlüllah (sallallahü aleyhi ve sellem)'i: sövmeyin! Çünkü o müslüman olmuşdu, buyururken işittim.» demişdir. Yemen krallarına verilen lakabdır. Acem krallarına Kisrâ, Roma imparatorlarına Kayser denildiği gibi eski Yemen hükümdarlarına da Tübba' lâkabı verilirmiş. mezkûr Tübbâ'ın Kabe'ye Kisve giydirdiğim ve yüz otuz bin süvari ile yüz onüç bin piyade askeri maiyetinde Medine'ye geldiğini kaydederler. (sallallahü aleyhi ve sellem) Medine-i Münevvere'ye yerleşince bu günkü Mescid-i Nebevî'nin yerini satın almak istemiş. Bunun Sehl ve Süheyl isimlerinde iki yetime âid olduğu söylenmiş. Resûlüllah (sallallahü aleyhi ve sellem) kendilerini çağırarak o yeri mescid yapmak işin satın almak istediğini ve buna ne isteyeceklerini sormuş. Yetimler: -Biz para istemeyiz Ya Resûlallah! Bu yeri sana hibe ediyoruz.» demişler. Fakat Resûlüllah (sallallahü aleyhi ve sellem) parasız kabul etmiyerek yeri on altına satın almış parasını da Ebû Bekir (radıyallahü anh) ödemiş. Bâzı rivâyetlerde yerin Hazret-i Ebû Eyyûb tarafından satın alındığı bildirilmektedir. binasına gelince: Sahîh rivâyetlerde bildirildiğine göre duvarları kerpiçden, tavanı hurma dallarından, direkleri de hurma kütüklerinden idi. Binâenaleyh bu hadîs'de bahsedilen kıbleden murâd cihet olsa gerektir. Çünkü Mescid-i Nebevî yapılırken kıble henüz Kabe değildi. Bir rivâyete göre mescid murabba şeklinde olup her duvarının uzunluğu yüz arşın mikdârındaymış. Başka bir rivâyete göre yüzden biraz azmış. Mescid'in temel duvarları üç arşına yakın genişlikde taşdan örülmüş, sonra üzerine kerpiç işlenmiş. Mescid yapılırken Peygamber (sallallahü aleyhi ve sellem) ashabı ile birlikte taş ve kerpiç taşımış. Mescid'in kıblesi Kudüs'e doğru çevrilmiş. Duvarlarının yüksekliği bir adam boyu imiş. Mescid'in üç kapısı varmış. îşte Mescid-i Nebevî, Resûlüllah (sallallahü aleyhi ve sellem) ile Ebû Bekir (radıyallahü anh) zamanlarında bu şekilde kalmış. Hazret-i Ömer ona biraz ilâve yapmış. Hazret-i Osman birçok ziyâdeler ilâve etmiş. Bu meyânda duvarları ile direklerini taşdan, tavanını da abanozdan yapmışdır. Ondan sonra Mescid-i Nebevî birçok zevat tarafından yenilenmişdir. hadîsde ashâb-ı Kiramın recez okudukları, Peygamber (sallallahü aleyhi ve sellem)’in de onlara iştirak ettiği bildirilmektedir. şiirin bir nev'idir. Fakat şiir olup olmadığı ihtilaflıdır. Ekseriyetle aruz ve edebiyat ulemâsı onu şiirden saymazlar. Resûlüllah (sallallahü aleyhi ve sellem)’in onu okuması da şiir olmadığına hamledilir. Çünkü şiir okumak ona nass-ı Kur'ân ile haram kılınmışdır. Kurtubî, Recezin şiirden sayıldığını söylemiş ve: «Onu şiirden saymayanlar Peygamber (sallallahü aleyhi ve sellem)'in okumasını müşkil addettikleri için böyle hareket etmişler; recez şiir olsaydı onu Peygamber (sallallahü aleyhi ve sellem) öğrenmezdi... demişlerse de bu sözün bir kıymeti yokdur. Çünkü az mikdârda şiir okuyan veya söyleyen yahut nadiren şiirden misal veren kimse şâir denilmeye hak kazanamaz. Onun ne şiir bildiği söylenebilir, ne de şiire nisbet olunur.» demişdir. Tîn ise bilâkis receze şiir denemiyeceğini iddia etmişdir. Çünkü Recez söyleyene şâir değil «Râciz» derler. «Peygamber (sallallahü aleyhi ve sellem)'e şiirin haram olmasından murâd şairliği sanat edinmesidir. Başkalarının şiirlerini okumak ona memnu değildir.» demişlerdir",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 15
			}
		}
	]
}