{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1198,
			"arabicnumber": "536",
			"text": "(Bze İshâk b. İbrahim rivâyet etti. ki): Bize Muhammed b. Bekr haber verdi. H. ki: Bize Hasanü'l-Hulvânî dahi rivâyet etti. ki): Bize Abdürrezzâk rivâyet etti. İkisinin lâfızları da birbirine yakındır. Demişler ki: Bize İbn Cüreyc haber verdi. ki): Bana Ebû'z-Zübeyr haber verdi ki Tâvûs'u şöyle derken işitmiş: «İbn Abbâs'a ayakların üzerine çömelme hakkında söz etdik. İbn Abbâs: «O sünnetdir.» dedi. Biz kendisine: biz onu insana cefâ görüyoruz.» dedik. Bunun' üzerine İbn Abbâs: «Bilâkis o senin Peygamberin (sallallahü aleyhi ve sellem)’in sünnetidir.- dedi. hadîs «İk'â» denilen oturuş şeklinin namazda sünnet olduğunu bildirmektedir. Bu husûsda Resûlüllah (sallallahü aleyhi ve sellem)’den yalnız iki hadîs vârid olmuşdur. Tirmizî ve diğer hadîs İmâmlarının rivâyet ettikleri ikinci hadîsde «ik'â» menedilmektedir. Mezkûr hadîs birkaç yoldan rivâyet edilmişse de senedlerinin hepsi zayıfdır. «ik'â» in hükmü ve şekli hususunda ihtilâf etmişlerdir. diyor ki: «Doğrusu «ik'â» iki nevidir. Birisi mak'adım yere yayarak dizlerini dikmek, elleriylede yere dayanarak köpek oturuşuna benzer bir şekilde oturmakdır. Lügat ulemâsı dahi «ik'â» yi bu şekilde tefsir etmişlerdir. Nehy edilen ve mekruh olan «ik'â» da budur. Hattâ Mâlikîler'e göre bu şekil oturuş haramdır. Yalnız namazı bozmaz. Onlara göre mekruh olan şekil ayak parmaklarının hepsini yere dikerek ökçelerinin üzerine oturmak yahut ayakların sırtını yere getirmek suretiyle üzerlerine oturmakdır. ikinci nev'î: Secdeler arasında mak'adını topuklarının üzerine döşeyerek oturmakdır. İbn Abbâs (-radiyallahü anh),in; «Peygamberinizin sünnetidir» sözü ile kasdettiği ik'â budur...» Hanefîlere göre namazda sünnet vecihle oturuş erkeklerin sol ayaklarını yere döşeyerek, üzerlerine oturmaları, sağ ayaklarını da dikerek parmaklarını kıbleye çevirmeleridir. Kadınlar ise sol çantı üzerine oturarak ayaklarını sağ ta-rafdan çıkaracaklardır. bâzı rivâyetlerinde metnindeki «Racül» kelimesi «Ricl» şeklinde zaptedilmişdir. Bu takdirde ma'nâ: «Biz bunu ayağa cefâ görüyoruz.» demek olur. Hattâ İbn Abdil Berr (368-463) «Racül» rivâyetinin hatâ' olduğunu iddi'â etmişdir. Fakat Cumhûr-u Ulemâ onun iddi'asını reddetmiş, doğrusunun «Racül» olduğunu; cefâ'yı izafe etmek için ayağın değil insanın daha lâyık bulunduğunu söylemişlerdir",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 38
			}
		}
	]
}