{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1211,
			"arabicnumber": "542",
			"text": "(Bize Muhammed b. Selemete'l-Murâdî rivâyet etti ki) Bize Abdullah b. Vehb, Muâviyetü'bnü Sâlih’den rivâyet etti. ki: Bana Rabîa'tü'bnü Yezîd, Ebû İdrîs El - Havlânî'den, o da Ebû'd - Der-dâ'dan naklen rivâyet etti. ki: Resûlüllah (sallallahü aleyhi ve sellem) ayağa kalktı. Biz o'nu: «Senden Allah'a sığınının.» derken (kulağımızla) işitdik. Sonra üç defa: «Seni Allah'ın lânetiyle lanetlerim.» dedi. Ve sanki bir şey alacakmış gibi elini uzattı. Namazdan çıkdıktan sonra biz: Resûlallah gerçekden namazda Öyle bir şeyler söylediğini işittik ki bundan önce bunları söylediğini duymamışdık; hem senin elini uzatdığını gördük.» dediki Resûlüllah (sallallahü aleyhi ve sellem): Allah'ın düşmanı İblîs yüzüme çarpmak için bir ateş parçası ile (karşıma) geldi. Bunun üzerine ben üç def'â: Senden Allah'a sığınırım; dedim. Sonra yine üç defa: Seni Allah'ın tam lânetiyle lanetlerim; dedim. Fakat o yine geri çekilmedi. Sonra kendisini yakalamak istedim. Vallahi eğer kardeşimiz Süleyman'ın duası olmasaydı, İblîs muhakkak bağlı olarak sabahı boylayacak; Medine halkının çocukları onunla oynıyacaklardı.» buyurdular. Hüreyre Hadîsini Buhârî «Namaz» «Tefsir», «Ehâdîsü'l - Enbiyâ» ve «Sıfat-ı İblîs» bahislerinde; Nesâî dahi «Tefsir» bahsinde tahrîc etmişlerdir. Habîs ve Münker demekdir. Zeccâc’ın beyânına göre ise ifrit bir işe mubâlegah sûretde nüfuz eden ve onda pislik ve belâ husule getiren ma'nâsınadır. münâsebetle yukarılarda da arz ettiğimiz vecihle Cin: Bir nevî mahlukâtdır. Ulemâ mevcudatı şöyle taksim ederler: Mümkinâtdan olan bir mevcûd kâinat boşluğundan yer tutmaz, yer işgal edenlerede sıfat olmazsa ona rûh denilir. Ruhlar süflî ve ulvî olmak üzere iki kısma ayrılırlar. Süfli kısım dahi hayırlı, hayırsız olmak üzere iki kısım olur. İşte süflî ervâhın hayırlı olanlarına cinlerin sulehâsı; kötü olanlarına şeytanlar de-nilmişdir. Ulvî ruhları dahi cisimlere taalluk etmeleri ve etmemeleri noktayı nazarından taksimata ta'bî tutarlar. Mevzûumuzun onlarla alâkası bulunmadığı için sözü yalnız cinlere münhasır bırakacağız. Cin kelimesinin esâsında örtünmek, gizlenmek ma'nâları vardır. Hattâ ana karnındaki çocuğa cenîn denilmesi dışarıdan bakıldığı zaman görülmediği içindir. Cinler de ekseriyetle görülmedikleri için kendilerine bu isim veril-mişdir. Abdürrezzâk’ın rivâyetinde Peygamber (sallallahü aleyhi ve sellem)'e gelen ifritin kedi suretinde göründüğü bildirilmiştir. hakkında Buhârî Mütercimi Ahmed Naîm Bey merhum şunları söylemişdir: münâsebetle şunu arz etmek îcab ederki Allah'ın hayat sahibi mahlûkâtı yalnız maddî âlemdeki insan ile —Nevilerini saymakla bitiremediğimiz—» hayvanlardan ibaret değildir: ordularını kendisinden başka kimse bilmez.\" Müddessir sûresi âyet 31 mantû-kunca Allah'ın ordularını, mahlûkâtın nevilerini ve cinslerini ancak Allah bilir. Onlardan akıl sahibi olarak Resûlüllah (sallallahü aleyhi ve sellem)'in haber vermesi ile bilebildiğimiz iki takım vardırki onlar da meleklerle cinlerdir. Meleklerin hepsi ulvî ve mukaddes ruhlar olup emri ilâhîye itaatten zerre kadar sapmazlar. Durakları ulvî semâlar olduğu hâlde bir takımları Allah'ın emri ile meskenimiz olan yere kadar iner ve yine çıkarlar. denilen mahlûkaat taifesi ise bizimle beraber yeryüzünde sakindirler. Bunların da insan gibi mü'mini, kâfiri vardır. Kâfirlerine şeytan ismi verilir. Meleklerin de, cinlerinde varlıkları Resûlüllah (sallallahü aleyhi ve sellem)’in haber vermesi ile ve Kur'ân'ın Nassı ile malûm olduğundan «Bu türlü mahlûkaat yokdur.» demek Peygamber'! inkâra varır ve küfürdür. «Sahih müsbet ilimlerin bunlardan haberi yokdur. Biz nasıl tasdik edelim?» diyenlere cevâbımız pek basîtdir: Müsbet ilimlerin bilmediği daha neler var! Müsbet ilimlerin gayesinin kemâli hakikatleri aragtırmakdır. Bildikleri, bilmediklerine nisbetle pek küçükdür. Müsbet ilim her şeyi bilirim dediği gün yöneldiği gayeden ayrılmış; ilimden çıkarak cehle inkı-lâb etmiş olur. timin kemâli, pek az bildiğini ikrar, cehlini itiraf eylemektedir. Fennin müsbet olarak kabul ettiklerini kabul, onların sükût ettiği şeyler hakkında hüküm vermekde tevakkuf ederim.» diyerek âlim tavrı takınanlar da ötekilerden daha bahtiyar sayılamazlar. Acaba fennin susmuş olduğu şeylere inanmak onun söylediklerine itikadı ihlâlmi edi-yorki tasdik hükmünü vermekden çekiniyorlar Bu sükût, tasdik etmemek demek olunca hakîkatta Resûlüllah (sallallahü aleyhi ve sellem)'i tekzip için ihtiyar edilmiş olur. Bu, hakkı kabul etmemek için sahayı nazarı değiçtir-mekden başka bir şey değildir. Fennin hükmüne, kabul ve inkâr etmediği husûsda uymak, hakkı araştırmak aşkından ileri geliyorsa —hakdan yüz çevirmek istemiyene göre — akıl ve naklin kaahir te'yîdâtı İle müberhen olan Muhammed (sallallahü aleyhi ve sellem)’in nübüvvetine müstenid sa-hîh haberlerin asîmi araştırmamak neden? Herhalde hakla araştırmaya âşık olan kimse bu sahaya da biraz yüzünü çevirip aramaya çalışsa doğru yolu bulur. Bahusus mevzubahis olan mevzuun yeni yeni delileri de zihinleri meşgul edip durmakdadır. Alafranga cincilik, bizim eski ıstılahımızda huddâmcılık mukaddimesinden başka bir ad veremiyeceğizn metapsişik acîp hâdiselerin tedkîki Avrupa ve Amerika'da hayli ilerlemişdir. H metapsişiklerin ıstılâhınca cazibe, hararet, elektrik gibi malûm olan tabiat kuvvetlerinin tesiri altında olmıyarak bir cismin kendi kendine harekete gelmesine deniyor. Medyum denilen ve beş duygunun hâricinde bir his alma hâssası gösteren kimselerin huzuru ile yapılan tecrübeler esnasında sandalyalarm ve oda içindeki diğer ağır eşyanın insan eli dokunmaksızın yerlerinden oynaması, cazibe kânununu istihfaf ile havaya kalkıp dolaşması ve bu harikulade hareketlerin, hâzır olanların arzularına tat>î olması, zevil'ukûl'den görülmeyen bir şahsın varlığını pek âlâ hissettiriyor. beraber biz cinnin'de, meleklerin'de varlığına istidlal için bu zevatın yarım yamalak tetebbuâtma, kalın esrar perdesi arkasından ve duygular kabilinden sezdikleri zayıf ma'lumâta ihtiyâç duymuyoruz. Bu tecrübeleri yapan âlimlerin nazarî bilgileri daha doğrusu ilmî vasfına hak kazanmamış faraziyeleri pek iptidâi olduğu için rûh gıdası olacak ve kalbe itminan verecek kuvveti hâiz olmadığından zanniyât kabilinden söyledikleri şeyleri ihtiyat ile telakki ediyoruz. Bizim bu- bâbda itimâdımız bu nevî mahlûkâtı bilfiil müşahede etmiş Peygamberimizin beyanâtıdır; ve bu hükümlerimiz o sâdık beyanâtın hududu ile tahdîd edilmişdir. Oradan nasıl telakki etmiş isek öylece kabul eder ona kendiliğimizden bir şey katmayız. Avrupalı ve Amerikalı ilim sahiplerinden bahsedişimiz —onların bu bâbdaki fikir ve nazariyeleri bize uysun uymasın — yalnız vahy'i inkâr edenlere malûmat sahalarının henüz pek dar olduğunu, hakîkatları kendilerince meçhul olan her şey'i ulu orta düşünmeden inkâra kalkışmanın hakikat nâmına tehlikeli ve ilim nâmına küfr-ü ilhâd olduğunu anlatmak içindir.» Abdillâh Mâzirî (453-536): «Cinler rûhânî bir takım lâtîf cisimler olup bağlanacak sûretde şekillere girmeye kabiliyetleri vardır...» demişdir. Bazıları cinlerin aslî suretleri ile görünmeleri Peygamberlerden başka kimseye mümkin olmadığını iddia etmişler; insanların onları kendi suretlerinden başka şekilde gördüklerini söylemişlerdir. Ancak Nevevî'nin dediği gibi bu mücerred bir dâvadır, sahih senedi yoksa reddolunur. Resûlüllah (sallallahü aleyhi ve sellem) in: kardeşim Süleyman'ın sözünü hatırladım...» ifadesinden murâd, Kâdı Beyzâvi'ye göre: Cinler üzerinde tasarrufun Süleyman (aleyhisselâm)'a mahsûs oluşudur. Tuttuğu cinnîyi bağlamaması bundan dolayıdır. Yahut tevâzuan ve teeddüben bağlamakdan vazgeçmişdir. (sallallahü aleyhi ve sellem) ile Süleyman (aleyhisselâm) arasındaki kardeşlik esâsât-ı diniye itibârı ile yahut şeriatları arasındaki benzeyiş ciheti iledir",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 51
			}
		}
	]
}