{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1215,
			"arabicnumber": "543.04",
			"text": "(Bize Kuteybetü'bnü Saîd rivâyet etti. ki) Bize Leys rivâyet etti. H. ki): Bize Muhammed b. El - Müsennâ'da rivâyet etti. ki) Bize Ebî Bekir El - Hanefî rivâyet etti. ki) Bize Abdülhamîd b. Ca'fer rivâyet etti. Bunlar topdan Saîd-i Makburî'den, o da Amr b. Süleym Ez-Zürakî'den naklen rivâyet etmişlerdir. Amr, Ebû Katâde'yi: defa biz mescidde oturuyorken yanuniza Resûlüllah (sallallahü aleyhi ve sellem) çıkageldi.- diyerek yukarkilerin badîs'i tarzında rivâyet ederken işitmiş. Yalnız o namazda Resûlüllah (sallallahü aleyhi ve sellem)’in İmâm olduğunu söylememiştir. hadîsi Buhârî «Namaz» ve «Edeb» bahislerinde; Ebû Dâvûd ile Nesâî dahi «Namaz» bahsinde muhtelif râvîlerden tahrîc etmişlerdir. Ümâme, Peygamber (sallallahü aleyhi ve sellem)'in en büyük kerîmesi Zeyneb (radıyallahü anha) nın kızı idi. (sallallahü aleyhi ve sellem) Efendimizin Hazret-i îbrâhimden ma'dâ bütün çocukları ilk zevcesi Hadîcetü’l-Kübrâ (radıyallahü anha)'dan dünyâya gelmişlerdir. İbrahim ise Mâriye-i Kiptîye'den doğmuşdur. Bazıları evlendiği zaman Peygamber (sallallahü aleyhi ve sellem)’in yirmibir yaşında olduğunu; birtakımları yirmibeş, daha başkalanda otuz yaşlarında olduğunu söylerler. Hazret-i Hadîce'nin dahi evlendiği zaman kırk ve kırkbeş yaşlarında olduğunu söyleyenler vardır. Fahr-i Kâinat (sallallahü aleyhi ve sellem) Efendimizin Hazret-i Hatice'den Zeyneb, Rukîye, Ümmü Gülsüm ve Fâtıme isminde dört kızı ile Kasim ve Tâhir isimlerinde iki oğlu dünyâya gelmişdir. Peygamber (sallallahü aleyhi ve sellem)’in künyesi Kâsım'in ismi ile Ebû’l-Kâsım'dir. Hadîs-i şerîfde ismi geçen Ümâme Resûlüllah (sallallahü aleyhi ve sellem)’in torunu ve en büyük kerimesi Zeyneb'in kızıdır. Ümâme'nin babası Ebû'l-Âs b. Rabî'dir. Bu zât'ın ismi ihtilaflıdır. Bazıları Yâsir, Bazıları Lakît; bir takınılanda Kâsım olduğunu söylerler. Hazret-i Ebû'l-Âs, Hadîcetü'l-Kübrâ (radıyallahü anha)'nın kızkardeşi oğludur. Ebû’l-As (radıyallahü anh) mal, emânet ve ticâret hususunda Mekke'nin sayılı eş-râfındandı. Kızını onunla evlendirmek isteyen, Hazret-i Hadîce olmuş; Peygamber (sallallahü aleyhi ve sellem) de bu işe rizâ göstermişdir. Hazret-i Zeyneb'in evlenmesi islâmiyetden öncedir. Ebû'l-Âs (radıyallahü anh) Mekke'nin fethinden Önce müslüman olmuşdur. Bedir gazasında henüz müşrikler tarafında idi; hattâ onlarla beraber esir düşmüşdü. Mekke müşrikleri esirlerini kurtarmak için Resûlüllah (sallallahü aleyhi ve sellem) efendimize onların fidyelerini göndermişlerdir. Bu meyanda Zeyneb binti Resûlüllah (sallallahü aleyhi ve sellem) de zevci'E bû'l-Âs'ı malla kurtarmak için bir gerdanlık göndermişdi. Bu gerdanlığı kendisine annesi Hadîce (radıyallahü anha) izdivaç hediyesi olmak üzere zifaf gecesi takmışdı. Resûlüllah (sallallahü aleyhi ve sellem) gelen fidyeler arasında bu gerdanlığı görünce son derece rikkata gelmiş ve kendini tutamıyarak ağlamışdı. Fahr-i Kâinat (sallallahü aleyhi ve sellem) Efendimizin o anda neler hatırladığını ve ne derece teessür ve heyecan içinde kaldığını bizim kalemimizle tasvire imkân yoktur. Yalnız şunu arzedelim-ki bir yâd -1 hazinin en sarîh ifâdesi olan mübarek gözyaşları bütün Ashâb-ı Kiramı teessüre garketmiş; onlarda ağlamışlardı. Neticede Ashâb-ı Kiramı ile bu husûsda istişare ederek münâsip görürlerse damadını serbest bırakmalarını onun nâmına fidye gönderilen bir anne yadigârının da gerisi geriye sahibine iade edilmesini teklif etti. Ashâb-ı Kiram bir ağızdan razı olduklarını ifâde ettiler ve Ebû’l-As'ı serbest bıraktılar. Gerdanlığı da iade ettiler. Yalnız Hazret-i Zeyneb (radıyallahü anh) müslüman olduğu için Resûlüllah (sallallahü aleyhi ve sellem) Efendimiz Medine'ye hicretine müsâde etmesini şart koşmuştu. Ebû'l-Âs bu; şartı kabul ve ifâ etti. Ebû'l-As, Hazret-i Zeyneb'i Medine'ye babasının yanına gönderdikten sonra bir sene kadar bir müddet Mekke'de müşrik olarak yaşadı. Nihayet o da Müslüman olarak Medîne-i Mûnev-vere'ye geldi. Fahr-i Kâinat (sallallahü aleyhi ve sellem) efendimiz zevcesini tekrar ona iade etti. bu hadîsin hükmü hakkında bir hayli söz etmişlerdir. Nevevî şöyle demektedir: hadîs Şafiî 'nin mezhebi ile ona muvafakat edenlere delîldir. Onlarca gerek erkek ve kız çocuklaum, gerekse hayvanlardan bâzılarını farz veya nafile namazlarda üzerinde bulundurmak caizdir. Bu husûsda İmâm, cemâat ve yalnız kılan müsavidir.» gelince: «El-bedâyı» sahibinin âmel-i kesir bâbında beyân ettiğine göre âmel-i kesîr iki eli kullanmaya ihtiyâç mess eden şeydir. İki eli kullanmaya hacet olmayan şey'e amel-i kalîl derler. Amel-i kesîr namazı bozar. Amel-i kalîl ise bozmaz. «Bedayı'» sahibi bü husûsda misaller verdikten sonra şunları söyler: «Keza bir kadın çocuğunu kucağına alsa da emzirse namaz bozulur. Çünkü bunda amel-i kesîr vardır. Ama emzirmeden çocuğu kucağına almak namazın bozulmasını îcab etmez, «Bedâyi'» sahibi ondan sonra buradaki hadîsi rivâyet etmiş ve: «Resûlüllah (sallallahü aleyhi ve sellem)’in böyle yapması mekruh değildir. Çünkü çocuğu muhafaza edecek başka kimse bulunmadığı için o böyle hareket etmeye mecburdu. Yahut bunun meşru' olduğunu; namazı bozmadığını fiilen göstermek için öyle yapmıştır. Böyle bir hareket bizim zamanımız-dada ihtiyâcdan dolayı yapılıyorsa mekruh değildir. Fakat hacet olmaksızın yapılırsa mekrûhdur.» demişdir. İmâm-ı Mâlik'den rivâyetine göre Resûlüllah (sallallahü aleyhi ve sellem)’in kıldığı bu namaz nafile idi. Farz namazda böyle bir şey caiz olamaz. diyor ki: «Bu te'vîl fasittir. Çünkü (cemaata İmâmdı) sözü farz namaz kıldırdığı hususunda sarih yahut sarih gibidir.» Nevevî'nin bu sözü Resûlüllah (sallallahü aleyhi ve sellem)’in ekseriyetle farz namazlarda İmâm olduğuna bakarak söylenmişdir. Nitekim Ebû Dâvûd'un Hazret-i Ebû Katâde'den rivâyet ettiği bir hadîs'de bunu te'yîd etmektedir. Mezkûr hadîsde Ebû Katâde: «Bir defa biz öğlede veya ikindide namaz için Resûlüllah (sallallahü aleyhi ve sellem)'i bekliyorduk. Bilâl kendisini namaza davet de etmişdi. Anîden yanımıza çıktı. Ebûl-Âs'ın kızı Ümâme ya'nî kızının kızı boynunda idi, O hâlde Resûlüllah (sallallahü aleyhi ve sellem) mihraba geçti; bizde arkasında saff olduk. İlah...» denilmektedir. Ancak Neyevl'nin beyânına göre Mâ-Hkîler'den Bazıları bunun nıensûh olduğunu söylemiglersede neshe imkân yokdur. İmâm Mâlik'den bir rivâyete göre Resûlüllah (sallallahü aleyhi ve sellem)'in namazda üzerinde çocuk bulundurması zarûretden dolayı idi. Hattâ Mâlikîler'den Bazıları onun Peygamber (sallallahü aleyhi ve sellem)’e mahsûs olduğunu bile söylemişlerdir. «Bu dâvaların hepsi bâtıl ve merdûdtur. Çünkü hiç birinin delili yokdur. Bunlara bir zaruret de bulunmamaktadır. Bilâkis hadîs sahîhdir ve namazda çocuk taşımanın caiz olduğu da sarîhdir. Sonra bunda şeriat kaidelerine muhalif bir şey de yokdur. Çünkü insan temizdir. Karnındaki necaset ise. mâdeninde yânî yerinde bulunduğu için hükümsüzdür. Çocukların elbise ve vücûtları temizdir. Bu gibi fiiller az olursa yahut ara vererek yapılırsa namazı bozmıyacağma şeriatın delilleri çokdur. Resûlüllah (sallallahü aleyhi ve sellem) de bunu caiz olduğunu bildirmek için yapmışdır...» diyor. bu izahatına mukabil Aynî de şunları söylemişdir: «Ulemâdan bâzısı böyle bir şey yapanın namazı yeniden kılması îcâb etmiyeceğini söylemiş ve bu hadisle istidlal etmişdir. Ma'mâfih namazda böyle bir şey yapılmasını hoş görmediğini de sözlerine ilâve etmişdir.» İmâm-ı Ahmed b. Hanbel bunu caiz görürmüş. Hattâbî: «Peygamber (sallallahü aleyhi ve sellem) bu işi kasden yapmamışa benziyor. Gâlibâ çocuk namaz hâricinde ona alıştığı için namazda İlçende kendisine takılmış ve boynuna sarmaşmış o da onu defetmemişdir. Çocuk omurunda İken secde etmek ist edimi onu yere koymuş; kalkmak istediği zaman ravru yine üzerine tırmanmış; Resûl-i Ekrem (sallallahü aleyhi ve sellem) de »na manî olmomışdır. Bence hadîsin vechi budur. Resûlüllah (sallallahü aleyhi ve sellem)’in namazda defâatle tutup kapması, kucağına alması hemen hemen ihtimâl verilecek bir şey değildir. Zîrâ bu husûsdaki amel çok olur ve tekerrür eder. Sonra bu hâl namaz kılanı namazından da alıkor. Fahri Kâinat (sallallahü aleyhi ve sellem) efendimizi çizgili bir seccade namazında meşgul eder de başkasını değiştirirse bu keyfîyetde bir iş onu nasıl meşgul etmez...» diyor. Hattâbî'nin bu sözünü hulâsa ettikden sonra onun için dahi: Bâtıl ve mücerred bir da'vâdır...» demişdir. O seccade meselesi ile Ümâme'nin kucağa alınması arasında fark görmekde ve: Seccadenin hiçbir faydası olmaksızın kalbi meşgul ettiğini, çocuğu taşımanın ise birçok fâideleri mütezammin olduğunu; bu suretle aralarında fark bulunduğunu söylemekde ve: «Doğrusu bu hadîs namazda çocuk yüklenmenin caiz olduğunu beyân için vârid olmuşdur.» demektedir. Bazıları: «Resûlüllah (sallallahü aleyhi ve sellem) çocuğu yere bıraksa ağlar; ve bu suretle onu kucağına almakdan daha ziyade meşgul ederdi.» demişlerdir. Bazıları bu husûsda farz ile nafile namazlar arasında fark görmüşlerdir. Ekseri ulemâ ise bu işin tevali etmediğini, çünkü namaz erkânı arasında tume'nînet bulunduğunu söylemişlerdir. diyor ki: Resûlüllah (sallallahü aleyhi ve sellem)’in Ümâme'yi namazda kucağında bulundurmasının sırn araplarm kız çocuklarına karşı gösterdikleri haşîn muameleyi reddetmekdir. Onlara bu husûsda son derece muhalif olduğunu göstermek için namazda bile kız çocuğunu bağrına basınışdır.»",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 55
			}
		}
	]
}