{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1237,
			"arabicnumber": "555.02",
			"text": "(Bize Ebû'r - Rabî' Ez-Zehrânî rivâyet etti. ki) Bize Abbad b. Avvâm rivâyet etti. ki) Bize Saîd b. Yezîd Ebû Mesleme rivâyet etti: «Ben Enes'e sordum» dedi ve yukarki hadis gibi rivâyetde bulundu. hadîs'i Buhârî, Tirmizî ve Nesâî «Namaz» bahsinde tahrîc etmişlerdir. İbn Battal (— 444) diyorki: «Ulemâya göre bu hadîs'in ma'nâsı şudur: Ayakkabılarında pislik yoksa» onlarla namaz kılmakda da bir beis yokdur. Pislik varsa ayakkabılarını siler ve yine onlarla namazını kılabilir. pisliklerden nasıl temizleneceği ihtilaflıdır., Ulem dan bir taife: Bir kimse yaş pisliğin üzerine bastımı ayakkablarını toprağa silmesi kâfidir. Onlarla namaz kılabilir; demişlerdir. Mâlik ile Ebû Hanîfe yaş necasetin ancak su ile temizleneceğine kâil olmuşlardır. Necaset kuru olursa onlara görede ovalamak kâfidir. Şâfiî'ye göre gerek ayakkabına, gerekse mestlere bulaşan bütün pislikler mutlak sûrede »u ile temizlenirler. Dakiki Saîd (625 - 702): «Ayakkabı ile namaz kü-mak müstehâb olan şeylerden değil ruhsatlardandır. Çünkü bu, namazdan matlûb olan ma'nâya dâhil değildir.» diyorsa da Allâme Aynî bu mutâleâyı kabul etmemekde ve ayakkabı ile namaz kılmanın müstehab, hattâ sünnet olması gerektiğini söylemektedir. Aynî'nin delili Ebû Dâvûd'un «Sünen» inde rivâyet ettiği Kuteybetü'bnü Saîd hadîsidir. Mezkûr hadîsde Resûlüllah (sallallahü aleyhi ve sellem): muhalefet edin! Çünkü onlar ayakkabları ile ve mestleri ile namaz kılmazlar.» buyurmuşdur. Ayni hadîs'i Hâkim de rivâyet etmişdir. Binaenaleyh Yahûdilere muhalefet maksadı ile ayakkabını çıkarmadan namaz kılmak müstehab olur. Ama ayakkabı ile namaz kılmak sünnetdir, denilemez; çünkü ayakkabı ile namaz kılmak maksûd bizzat değildir. Yine Ebû Dâvûd'un tahrîc ettiği bir hadisde Resûlüllah (sallallahü aleyhi ve sellem)’in hem ayakkabları ile hem de yalınayak namaz kıldığı bildirilmektedir. Bu, her iki vechinde caiz olduğuna delildir. Gazali «İhyau'l - Ulûm» nâm eserinde bâzı ulemâ'dan ayakkabı ile namaz kılmanın efdal olduğunu nakletmişdir. Übbî: «Ayakkabı ile namaz kılmak caiz ise de bunu yapmamalı, bilhassa büyük camilerde bundan kaçınmalıdır; çünkü daha büyük mefsedetlere yol açar,» diyor. hadîs temiz olmak şartı ile ayakkabı ile mescide girilebileceğine de delildir",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 75
			}
		}
	]
}