{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 124,
			"arabicnumber": "20",
			"text": "(Bize Kuteybetü'bnü Said rivâyet etti, ki): Bize Leys b. Sa'd, Ukayl'den, o da Zühri'den naklen rivâyet etti. Zühri ki: Bana Ubeydullah b. Abdillâh b. Utbete'bni Mer'ud Ebû Hüreyre'den naklen haber verdi. Ebû Hüreyre şöyle dedi: (sallallahü aleyhi ve sellem) dünyadan gidin de ondan sonra Ebû Bekir halife seçildiği ve araplardan küfredenler küfrettiği zaman Ömerü'bnü'l-Hattâb, Ebû Bekre: şunları söyledi: Resûlüllah (sallallahü aleyhi ve sellem): İnsanlar: Allahdan başka ilâh yoktur deyinceye kadar (onlarla) çarpışmaya me'mur oldum; imdi her kim Allahdan başka ilâh yoktur, derse malını ve canını benden korumuş olur. Ancak hakkiyle olursa müstesna! Onun da hesabı Allaha kalmıştır, buyurduğu halde sen nasıl oluyor da insanlarla harb ediyorsun? Bekir: namazla zekâtın arasını ayıranlarla mutlaka harb edeceğim. Çünkü zekât, malın hakkıdır. Vallahi Resûlüllah (sallallahü aleyhi ve sellem)’e vere geldikleri yularları bana vermezlerse, vermediklerinden dolayı onlarla behemehal harb ederim.» dedi. Bunun üzerine Ömerü'bnü’l-Hattâb: iyi anladım ki Allah azze ve celle Ebû Bekr'in kalbine kıtal için fütuhat vermiş. Ve anladım ki bu kıtal bakmış» dedi. hadîsi Müslim (rahimehüllah) Ebû Hüreyre, Câbir, Abdullah b. Ömer ve Târik (radıyallahu anhüm) hazeratından tahric ettiği gibi Buhârî (rahimehüllah) dahi Ebû Hüreyre, Abdullah b. Ömer ve Enes (radıyallahu anhüm)'den namaz ve zekât bahislerinde rivâyet eylemiştir. Hadîs diğer sahih kitaplarda da mevcuddur. (sallallahü aleyhi ve sellem) dünyadan gidip de ondan sonra Ebû Bekir halife seçildiği ve araplardan küfredenler küfrettiği zaman...» ifadesini uzun uzadıya ve güzel bir şekilde şerh etmiş; Nevevî'de bunu beğenerek Müslim şerhine almıştır. Hulâsası şudur: Resûlüllah (sallallahü aleyhi ve sellem)'in irtihalinden sonra dinden dönenler iki sınıftır: Bunların biri tamamiyle dinden irtidâd edefek küfre dönmüştür. Hazret-i Ebû Hüreyre (radıyallahü anh)’ın anlatmak istediği işte bunlardır ki, iki taifeye ayrılırlar: taife Müseylemetü'l-Kezzâb'ın Peygamberlik iddiasını tasdik eden Benî Hanîfe ile onlara tâbi' olanlar; Ve el-Esvedü’l-Ans î'nin peşinden giden Yeme h'lilerle onlara tâbi olanlardır. Bu fırkaya mensub olanların cümlesi Hazret-i Muhammec Mustafa (sallallahü aleyhi ve sellem)'in peygamberliğini inkâr ediyorlardı. Hazret-i Ebû Bekir bunlarla harbetti. Binnetice Müseyleme'yi Yemame'de, El- Ansî'yi de Sanâ'da tepeletti ve onlara tâbi' olanların ekserisini helâk etti. Kurtulabilenler de dağılıp kaçtılar. taife dinden dönerek şeriatın bütün ahkâmını inkâr ve namaz, zekât gibi bütün ibâdetleri terkedenlerdir. Bunlar tamamiyle cahiliyyet devrindeki hallerine dönmüşlerdi. Bu sebeple Mekke, Medine mescidleriyle el-Bahreyn'deki Abdülkays mescidinden başka ibâdete açık mescid hemen hemen kalmamış gibi idi. Müslümanlar, Allah’ın yardımı yetişinceye kadar bir hayli sıkıntı çektiler. sınıf mürtedler namazla zekâtı birbirinden ayıranlardır. Bunlar namazın farz olduğunu kabul ediyor, fakat zekâtı tanımıyorlardı. Ha-kikatta mürted değil bâgi idiler. Ancak mürtedler arasına karıştıkları için onlara da mürted denilmiştir. Zekât vermeyenlerin içinde onu vermek isteyenler bile vardı. Yalnız reisleri buna mani' olduğundan veremiyorlar-dı. Benî Yerbû' kabilesi bunlardandır. Mezkûr kabile kendi aralarında zekâtlarım toplamış; tam Hazret-i Ebû Bekir (radıyallahü anh)'a göndermek üzere iken Mâlik b. Nüveyre buna mani' olmuş; ve toplanan zekât mallarım kabileye dağıtmıştır. Hazret-i Ömer (radıyallahü anh)'ın Ebû Bekir (radıyallahü anh)'a ı'tıraz eüeıch münakaşaya girişmesi bunlar hakkındadır. Hazret-i Ömer (radıyallahü anh)'ın i'tirazı hadîsin zahirine baktığı ve üzerinde fazla durmadığı içindir. Ebû Bekir (radıyallahü anh) ise şartları ifa edildiği takdirde meselenin mal ve can dokunulmazlığını tazammun ettiğini kasd-ederek: malın hakkıdır.» demişti. Hasılı Hazret-i Ebû Bekir, namaz kılmaktan imtina' edenlerle harb edileceğine ashâb-ı kirâmın icmaı bulunduğunu bildiği için zekât meselesini namaza kıyas etmiş; Hazret-i Ömer ise hadîsin umumu ile ihticacta bulunmuştu. Bu hâdise âmmın kıyasla tahsis edilebileceğine ve bir hüküm hakkında vârid olan emrin tazammun ettiği bütün şart ve istisnaların o hükmün sahih olabilmesi için muteber sayılacağına delildir. Hazret-i Ömer, Ebû Bekir (radıyallahü anh)'in haklı olduğunu, gösterdiği delilden anlayarak kabul edince, harbin lüzumu hususunda ona tâbi' olmuştur. fırkalarından Râfiziler Hazret-i Ebû Bekir'in, müslüman-ları esir eden ilk hükümdar olduğunu söyleyerek ona ta'n ederler. Akıllarınca Ebû Bekir (radıyallahü anh)’ın esir aldığı âsiler mürted değil, müteevvil müslümanlarmış. Çünkü Teâlâ hazretlerinin: mallarından, kendilerini temiz pak edeceğin bir zekât al...» âyet-i kerîmesi ve emsali hitablar Peygamber (sallallahü aleyhi ve sellem)'e hâsmış. Zira zekât sahibini hiç bir kimse Resûlüllah (sallallahü aleyhi ve sellem) kadar temiz pak edemezmiş. Böyle bir şüphe karşısında ise zekâtlarını vermeyen mürtedler ma'zur görülerek öldürülmemek icâbeder-miş,.. Bu sözlerle Râfiziler Hazret-i Ebû Bekir (radıyallahü anh)'a zulüm isnad etmeye çalışırlar. Hattâbî: dinden nasipleri olmayan bir kavimdir. Sermayeleri yalnız yalan ve iftira, bir de selef-i salihîne atıp tutmaktır...» diyerek Râfizilerin kimler olduğunu güzel bir şekilde beyân etmiştir. bir değil bir kaç sınıf olduğunu az yukarıda gördük. Bunların içinden namazı, zekâtı ve bütün dinî ahkâmı inkâr edenlerine ashâb-ı kirâm kâfir hükmünü vermişlerdi. Onun için Ebû Bekir (radıyallahü anh) onları esir etmiş; sahabenin ekserisi de ona yardım etmişti. Hatta Hazret-i Ali (radıyallahü anh), Benî Hanîfe kabilesinden esir edilen bir câriye almış. Muhammedü'bnü'l.Hanefiyye ismindeki oğlu bu cariyeden doğmuştur. Ancak sonraları ashab, mürteddin esir alınamayacağına ittifak etmişlerdir. zekât almayı emreden âyeti Resûlüllah (sallallahü aleyhi ve sellem)'e mahsusmuş gibi göstermeye çalışmaları bir mugaletadır. Âyet-i kerîme bütün müslümanlara âmm ve şamildir. Filvaki' Kur'ân-ı Kerîm'-de Peygamber (sallallahü aleyhi ve sellem)'e hâss emirler vardır. Fakat bunların ona mahsus olduğu hiç bir şüpheye mahal bırakmayacak şekilde beyan edilmiştir. «Gecenin bir kısmında o Kur'anla, sana mahsus bir ziyade farz olmak üzere namaz kıl.» — İsrâ: 79 mealindeki âyet-i kerime bunlardandır. Hulâsa: Kur'ân-ı Kerîm'in. hitabları üç kısımdır:",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 32
			}
		}
	]
}