{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1296,
			"arabicnumber": "575.02",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe rivâyet etti. ki): Bize Muhammed b. Bişr rivâyet etti. ki): Bize Ubeydullah b. Ömer, Nâfi'den, o da İbn Ömer'den naklen rivâyet etti. ki: Çok defa Resûlüllah (sallallahü aleyhi ve sellem) Kur'ân'ı okur. Secde âyetine tesadüf ettiği zaman bize de secde ettirirdi. Biz onun yanına o kadar tişüşür-dtik ki namazda olmadığı hâlde birimiz secde edecek yer bulamazdı. hadîsi Buhârî «Sucûdü'l - Kur'ân» bahsinde; Ebû Dâvûd da «Namaz» bahsinde muhtelif râvîlerden tahrîc etmişlerdir. Hadîs-i şerif secde-i tilâvetin meşru olduğuna delildir. Secde-i tilâvetin meşru olduğunda bütün ulemâ müttefikdir. Ancak sıfatı hususunda ihtilaf vardır. Hanefîler'e göre secde âyetini okuyana da, dinleyene de secde etmek vâcipdir. Secde etmezlerse günahkâr olurlar. Sonra bu vûcûb bazen mühletli bazan mühletsiz olur. Namaz hâricinde okuyan ve dinleyenlere secde etmek «müvessa'» yani mühletle vâcibdir. Bunlar Ömürlerinin sonlarına kadar o secdeyi geciktirmekle günahkâr olmazlarsa da secdeyi âyetin okunduğu zamandan fazla geciktirmek tenzîhen mekrûhdur. âyeti namazda okunmuşsa secdenin «mudayyak» yani mühletsiz yapılması vacip olunur. Bu takdirde okunan secde âyeti ile yapılacak secde arasında üç âyetden daha fazla âyet okuyacak kadar vakit geçmemek lâzımdır. secde âyeti sûrenin ortasında ise efdal olan, onu okur okumaz secde etmek, sonra kalkarak sûreyi tamamlamak ve arkasından namazın rükû'unu sücûdunu yapmakdır. öyle yapmaz da secde âyetini okuduS-dan sonra üç âyet okuyacak kadar zaman geçmeden rükû' eder ve bu rükû' ile secde-i tilâvetin edasını niyet eylerse bu da kâfidir. Namaz içinde âyeti ile secde arasında üç âyet okuyacak kadar veya daha fazla vakit geçerse artık bu secde namaz içindeki rükû' ve secdeleri ile edâ olunma-yıp yine namaz içinde ayrıca secde etmek sureti ile kaza olunur. Namaz içinde kaza edilmediği takdirde namazdan sonra da kaza edilemez. Çünkü artık vakti geçmişdir. Ancak namazdan selam verdikten sonra henüz namaza münâft bir fiilde bulunmadan derhâl kaza ederse caiz olur. âyeti sûrenin sonunda bulunuyorsa secde fçin namazın rükû’-unda niyet etmek ve rükû'un zınınında o secdeyi de edâ etmek efdal olur. Böyle yapmaz da secde âyeti için ayrıca secde ederse ayağa kalktığı zaman o sûreden sonra gelen sûreden bir kaç âyet okuduktan sonra namazın rükû' ve sücûduna gitmek efdal olur. başka bütün ulemâya göre secde-i tilâvet sünnetdir. ile Şâfîîler'e göre secde için âyetin kasden dinlenmesi şart değildir. Rast gele işidenlere de, secde etmek gerekir. Yalnız Şâfiîler'e göre rast gele işiden bir kimseye, secde etmek kasden dinleyene olduğu kadar kuvvetle sünnet değil, müstehâbdır. Battal (—444)'e göre bu hadîs hayır ve hasenat yapmak için harîs olmaya delildir. Ayrıca Peygamber (sallallahü aleyhi ve sellem) Efendimizin fiillerine tabî olmanın lüzumuna da delâlet etmektedir. beyânına göre secde âyetini okuyanla, dinleyen kimse namaz hâricinde iseler her ikisinin beraberce secde etmeleri şart değildir. Biri diğerinden evvel veya sonra, uzun veya kısa secde edebilir. Hattâ âyeti okuyan hiç secde etmese bile dinleyen secde edebilir. Bu bâbda okuyan kimsenin abdestli veya abdestsiz, erkek, kadın veya çocuk olmaları hüküm itibârı ile müsavidir. Şâfiîler'den zayıf bir rivâyete göre secde âyetini çocuk, kâfir veya abdestsiz bir kimse okursa işitenlere secde etmek müstehâb olmaz ise de sahîh olan kavil birincisidir",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 134
			}
		}
	]
}