{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 132,
			"arabicnumber": "24.01",
			"text": "(Bana Harmeletü'bnü Yahya et-Tücîbî rivâyet etti. ki): Bize Abdullah b. Vehb haber verdi. ki: Bana Yûnus, , İbn Şihâb'dan naklen rivâyet etti. ki: Bana Said b. el-Müseyyeb, babasından naklen rivâyet eyledi. Babası Şöyle dedi: Tâlib'in ölümü yaklaşınca (sallallahü aleyhi ve sellem) ona geldi. Ve yanında Ebû Cehil ile Abdullah b. Ebu Ümeyyete'bni'l-Mugirâ'yı buldu. Müteakiben Resûlüllah (sallallahü aleyhi ve sellem): «Ey amca! Allah'dan başka ilâh yoktur de. Bu kelimeyi söyle ki, onun sebebiyle huzur-u İlâhide senin lehine şehâdet eyleyeyim.» dedi. Bunun üzerine Ebû Cehil ile Abdullah b. Ebi Ümeyye: «Yâ Ebâ Tâlib, Abdulmuttalib'in dîninden dönmek mi istiyorsun?» dediler. Resûlüllah (sallallahü aleyhi ve sellem) o sözü amcasına arz etti, durdu. Nihayet Ebû Tâlib onlara son söz olarak kendisinin Abdülmuttalib'in dîni üzere bulunduğunu söyledi, ve «Allah'dan başka ilâh yoktur» demekten imtina' etti, Resûlüllah (sallallahü aleyhi ve sellem): de: «İyi bil, vallahi senin hakkında niyaz etmekden nehyolunmadığım müddetçe senin için mutlaka istiğfara devam edeceğim; dedi. arkasından da Allah azze ve celle şu âyet-i kerîmeyi indirdi: «Müşriklerin cehennemlik oldukları kendilerince anlaşıldıktan sonra akraba hile olsalar Peygambere de mü'minlere de onlar için istiğfar etmek gerekmez,» teâlâ Ebû Tâlib hakkında dahi âyet indirerek Resûlü (sallallahü aleyhi ve sellem)'e: «Şüphesiz ki sen sevdiğine hidâyet veremezsin; ama Allah dilediğine hidâyet verir. Hem o hidayete erecekleri daha iyi bilir.» buyurdu. hadîsi Buhârî Müslim ittifakla Said b. el-Müseyyeb'ten tahric etmişlerdir. Hadîsi Said babasından rivâyet etmiştir. cümlesinin asıl mânası: Tâlib'e ölüm geldiği zaman...» demek ise de burda: Ölümü yaklaştığı, ölüm alâmetleri görülmeye başladığı zaman kastedilmiştir. Çünkü ölüm ânına hai-i intizâr derler ki, o anda imân etmenin bir faydası yoktur. Bazıları bu ifâdeden hakikaten ihtizarı yani koma halini anlamış; ve: halde Peygamber (sallallahü aleyhi ve sellem) kendisinin orada bulunması bereketine amcasının rahmet-i İlahiyye'ye nail olacağım ümid etmişti\" demişlerse de bu mütâlea doğru görülmemektedir. Zira Teâlâ Hazretleri: kötülükleri işleyip de \"içlerinden\" birine ölüm geldiği vakit: Şimdi ben tevbe etdim diyen o kimseler için tövbe yoktur.\" buyurarak can çekiştirmekte olan bir kimsenin imâm kabul edilmeyeceğini saraheten bildirmiştir. Binaenaleyh Resûlüllah (sallallahü aleyhi ve sellem) o halde bulunan bir kimseye iman teklif etmez. Anlaşılıyor ki bu konuşma esnasında amcası henüz koma hâlinde değilmiş. Zaten Ebû Tâlib'in Peygamber (sallallahü aleyhi ve sellem)'le konuşması da koma hâlinde olmadığım gösterir. Kâinat (sallallahü aleyhi ve sellem) Efendimiz, amcası Ebû Tâlib'in imân etmesini son derece arzu ediyordu. Çünkü kendilerini bir baba şefkatiyle büyüten, her badirede imdadına koşan onu öz evladından daha ziyâde bağrına basan o idi. Resûlüllah (sallallahü aleyhi ve sellem) doğmadan babası, altı yaşında iken de annesi vefat etmişti. Bunun üzerine O'na dedesi Abdülmuttalib baktı. Onun vefatından sonra Peygamberimiz Muharamed Mustafa (sallallahü aleyhi ve sellem) amcası Ebû Tâlib'e kaldı. Ebû Tâlib, Resûlüllah (sallallahü aleyhi ve sellem)'i kendi çocuklarından ziyâde severdi. Bu hâl kendisine peygamberlik gelinceye kadar böyle gittiği gibi Peygamber olduktan sonra da devam etti. Kureyş'in nice düşmanlıklarından Onu amcası Ebû Tâlib korumuş; bu uğurda ölümle tehdid olunduğu halde Resûlüllah (sallallahü aleyhi ve sellem)'i onlara teslim etmemişti. Nihayet başta yine Ebû Tâlib olmak üzere Peygamber (sallallahü aleyhi ve sellem)'in mensûb bulunduğu Benî Hâşim Kabilesi Kureyş'in müdhiş bir boykotuna ma'ruz kaldılar. Kureyş, Benî Hâşim'le olan bütün alâkalarını kesmişti. Onlarla alış veriş yapmıyor, kız alıp vermiyor, kendilerine en küçük bir insanlığı reva görmüyordu. Bu hal tâ Benî Hâşim, Resûlüllah (sallallahü aleyhi ve sellem)'i kendilerine teslim edinceye kadar devam edecekti. Hatta bu hususta bir de misâk yazılarak Kabe'nin kapısına asılmıştı. Beni Hâşim çok müşkül vaziyette kalmıştı, bilmecburiye kendilerine aid bir vadiden ibaret olan « Şi'b» a sığındılar. Ve burada tam üç sene mahsur kaldılar. Bu üç sene zarfında müslümanların ve dolayısiyle Ebû Tâlib'in çekmediği zahmet ve mihnetler kalmadı. Hatta ağaç yapraklan yemeye mecbur kaldılar. Fakat Ebû Tâlib cam gibi sevdiği birader zadesi Resûlüllah (sallallahü aleyhi ve sellem)'i düşmanlarına teslimi bir an hatırına bile getirmedi. Nihayet Kureyş, ahidnameyi kendileri yırtarak boykotu kaldırdılar. Ancak «Şi'b» daki mahsur hayattan kurtulduktan bir kaç gün sonra Ebû Tâlib vefat etti. Ondan üç gün sonra da ümmül mü'minin Hazret-i Hadice (radıyallahü anh) dünyadan gitmişti. Onun için Resûlüllah (sallallahü aleyhi ve sellem) o seneye «Âmü’l-Hüzn» (keder yılı) namını vermişti. O zaman Peygamber (sallallahü aleyhi ve sellem)'in yaşı elliyi doldurmak üzere idi. İşte Resûlüllah (sallallahü aleyhi ve sellem), üzerinde bu derece emek ve hakkı bulunan amcasının ebedî seâdete ermesini istiyordu. Bunun için ise müslüman olmak şarttı. Resûlüllah (sallallahü aleyhi ve sellem)’in amcasını görür görmez şehadet tavsiyesinde bulunması bundandır. Mûsa b. Ubeyde'den tahric ettiği bir rivâyete göre: Ebû Tâlib Ölüm döşeğine düşünce Kureyş: oğluna haber gönder de sana şu söylediği cennetten şifâbahş olacak bir şeyler yollasın!» demişler. O da Resûlüllah (sallallahü aleyhi ve sellem)’e haber yollamış, Peygamber efendimiz: ki Allah o cennetin yiyecek ve içeceklerini kâfirlere haram kılmıştır.» buyurmuş. Ebû Tâlib'in yanına giderek ona islâmı arzetmiştir. Ebû Tâlib şu cevabı vermiş: bu şehâdet sebebiyle ta'yib edilerek: amcan ölümden korktu, denilmese bu şehâdeti getirerek seni mutlaka memnun ederdim.» rivâyetine göre Resûlü Ekrem (sallallahü aleyhi ve sellem) Ebû Tâlib'e: amca! Muhakkak üzerimde en çok hakkı olan ve bana en büyük minnet ihsan eden insan, sensin. Hiç şüphe yok ki üzerimde babamdan da ziyade hakkı olan sensin. İmdi bir kelime söyle ki, kıyâmet gününde onun sebebiyle şefaatim sana vâcib olsun!» demiştir. (sallallahü aleyhi ve sellem)’in amcasından:. başka ilâh yoktur» demesini istemesi kinaye yolu ile kendisinin de Resûlüllah olduğunu istemektir. Çünkü bu iki şehâdeti yapmadıkça bir kimseye müslüman hükmü verilemez. Yalnız tevhidi istemiş olmasıda ihtimal dahilindedir. Çünkü Ebû Tâlib, Peygamber (sallallahü aleyhi ve sellem)’in hak Peygamber olduğunu biliyordu. ifadesi bütün asıl nüshalarda bu şekilde rivâyet edilmiştir; Ve: Tâlib Peygamber (sallallahü aleyhi ve sellem)'e o sözü tekrarlıyordu» ma'nasina gelir. Ancak Kâdi Iyaz bir nüshada » şeklinde gördüğünü ve bu rivâyetin daha muvafık olduğunu söylemiştir. Bu takdirde ma'na: Cehil ile İbn Ebî Ümeyye söylediklerini tekrarlayıp durdular. demek olur. Ebû Tâlib onlara son söz olarak kendisinin Abdülmuttalib'ir dîni üzre bulunduğunu söyledi» ifâdesi en güzel âdâb ve konuşma! usullerinden sayılır. Yani başkasının nahoş bir sözünü nakleden, burada olduğu gibi gaib zamiri kullanmalıdır. Burada mezkûr adaba riâyet edilmese:«Ben Abülmuttalib'in dîni üzereyim dedi.» ifadesini kullanmak gerekirdi. Çünkü Ebû Tâlib'in ağzından çıkan söz bu idi. ki sen sevdiğine hidayet veremezsin...» âyet-i kerimesinin Ebû Tâlib hakkında nâzil olduğunda bütün müfessirler müttefiktirler. Keza hidâyet ve dalâlet ancak Allah'a mahsus olduğunda dahi bütün ulemâ ittifak halindedirler",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 39
			}
		}
	]
}