{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1322,
			"arabicnumber": "586.02",
			"text": "(Bize Hennâd b. Serîy rivâyet etti. ki): Bize Ebû'l-Ahvas, Eş'as’dan, o da babasından o da Mesrûk'dan, o da Âişe'den bu hadîsi rivâyet etti. Bu hadîsde: Bundan sonra Resûlüllah (sallallahü aleyhi ve sellem) hiç bir namaz kılmadı ki (o namazda) kendisini kabir azabından Allah'a sığınırken işitmiş olmıyayım: dedi» ibaresi de vardır. hadîsi Buhârî «Kitâbül - Cenâiz» ve «Kitâbü't - Deavât» da; Nesâî «Namaz» bahsinde muhtelif râvîlerden tahrîc etmişlerdir. beyânına göre vak'a iki defa geçmişdir. Birincide Resûlüllah (sallallahü aleyhi ve sellem) Yahûdi karısının sözüne karşı: fitneye ancak ve ancak Yahûdiler duçar olacaklardır.» buyurmuş. İkincide ayni Yahûdi karısı bir arkadaşı ile gelerek Hazret-i Âişe'ye yine kabirin fitne ve azabından bahsetmiş; Âişe (radıyallahü anha) yine kabul etmemiş; sonra Resûlüllah (sallallahü aleyhi ve sellem)’e gelerek kendisine bu bâbda vahy nâzil olduğunu ve kabir azabının vâkî bir hakîkat olduğu bildirildiğini söylemiştir. vak'âdan önce Peygamber (sallallahü aleyhi ve sellem) ümmeti için kabir azabı olup olmadığım bilmezdi. Bunu İmâm Ahmed'in «Müsned» inde Buhârî'nin şartı üzre sahîh bir isnâdla rivâyet ettiği Hazret-i Âişe hadîsinden anlıyoruz. Saîd b. Amr b. Saîd El-Emevî tarîki ile rivâyet olunan mezkûr hadîsin ifâde ettiği hakikat şudur: «Bir Yahûdi kadını Âişe (radıyallahü anha)'ya hizmet edermiş. Hazret-i Âişe bu kadına her ne zaman bir iyilikde bulunursa kadın kendisine (Allah seni kabir azabından korusun!) diye dua edermiş. Nihayet Âişe (radıyallahü anha); Yâ Resûlallah! Kabirde azâb var mıdır? diye sormuş. Resûlüllah (sallallahü aleyhi ve sellem): Yahûdiler yalan söylemişlerdir. Kıyâmet gününden önce hiçbir azâb yokdur! buyurmuş. Bu vak'anın üzerinden Allah'ın dilediği mikdar zaman geçtikten sonra Resûlüllah (sallallahü aleyhi ve sellem) bir gün öğle zamanı dışarıya çıkarak alabildiğine yüksek sesle: Ey insanlarl Kabir azabından Allah'a sığının! Çünkü kabir azabı hak'dir; diye nida etmiş.» ki Resûlüllah (sallallahü aleyhi ve sellem) Efendimiz mü'minler hakkındaki kabir azabını son zamanlarda Medîne-i Münevvere'de öğrenmiş; ve bundan son derece korunmaları lâzım geldiğini ümmetine talîm buyurmuşdur. Lugatda imtihan etmek, denemek, dalâlet, küfür, rezalet, azâb, ibret ve mihnet gibi birçok mânâlara gelir. Kabir fitnesinden murâd: kabir hayâtı ve oradaki meleklerin suâli ve kabir azabıdır. Bu bâbda bir çok hadîsler vârîd olmuşdur",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 160
			}
		}
	]
}