{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1337,
			"arabicnumber": "592.03",
			"text": "(Bize Abdülvâris b. Abdissamed rivâyet etti. ki): Bana babam rivâyet etti. ki): Bize Şu'be, Asım'dan, o da Abdullah b. Hâris'den bir de Hâlid'den, o da Abdullah b. Hâris'den rivâyet etti, bunların ikisi de Âişe'den, Peygamber (sallallahü aleyhi ve sellem)'in yukarki hadisin mislini söylediğini rivâyet ettiler. Şu kadar var ki Resûlüllah (sallallahü aleyhi ve sellem) diyormuş. (sallallahü aleyhi ve sellem)’in namazından çıkmasından murâd selâm vermesidir. Anlaşılıyorki selâm verdikden sonra yine bu hadîsde beyân edildiği vecîhle üç defa istiğfar eder, sonra «Allâhümme Ente's-Selâmu ilâh...» dermiş. mânası: Bütün kusurlardan ve hudûs alâmetlerinden salim olan; demekdir. Ve Allah'ın isimlerinden biridir. Selâmetle vasıflanmak ancak kendisine zarar gelebilmesi melhuz olan hadis şeylerde yani mahlûkâtda mütesavver olduğundan Teâlâ Hazretleri onlardan daha mümtaz bir şekilde selâmla tavsif edilmiş: «Yâ Rab bizzat selâm sensin, mahlûkâ-tin vasıflandığı selâmet de senden sâdır olur.» denilerek Allahü teâlâ hazretlerinin bütün mahlûkâtdan müstağni olduğu; selâmeti o verdiği ve neticede yine ona râci' olduğu makâm-ı ihtiram da beyân olunmuşdur. bundan sonraki Hazret-i Âişe hadîsi ile istidlal ederek namazda selâm verdikden sonra İmâmın bir parça yer değiştirmesini müstehab görmüşlerdir. Bunun hikmeti ihtilaflıdır. Bâzılarına göre İmâm iken durduğu yer pek faziletli bir yerdir; orada durmak ancak İmâmlık sebebi ile hak edilir. İmâmlık bitince artık İmâmın orada durmaya hakkı kalmaz. takımları: «îmamın yer değiştirmesi onun selâmını işitmeyenler, kendisini görsün diye müstehab olmuşdur.» derler. îmamın namazdan sonra sağ tarafa çekilmesi müstehabdır. Çünkü şerîatda her işe sağdan başlamak müstehabdır. bâzılarına göre: İmâmın yer değiştirmesi o namazdan sonra sünneti müekkede olarak devamlı nafile namaz bulunduğuna göredir. Namazdan sonra sünnet namaz yoksa yer değiştirmek müstehab değildir. Çünkü Resûlüllah (sallallahü aleyhi ve sellem)’in sabah namazını kıl-dıkdan sonra güneş doğuncaya kadar yerinde oturduğu rivâyet olunmuşdur",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 174
			}
		}
	]
}