{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1347,
			"arabicnumber": "595.01",
			"text": "(Bize Asım b. Nadir Et - Teymî rivâyet etti. ki): Bize El- Mu'temir rivâyet etti. ki): Bize Ubeydullâh rivâyet etti. H. ki: Bize Kuteybetü'bnü Saîd de rivâyet etti. ki): Bize Leys, İbn Adân'dan rivâyet etti. Bunların ikisi de Sümey'den, o da Ebû Sâlih'den, o da Ebû Hüreyre'den naklen rivâyet ettiler. (Bu hadîs Küteybe'nindir.) ki: Muhacirlerin fakirleri Resûlüllah (sallallahü aleyhi ve sellem)’e gelerek: Varlık sahipleri yüksek dereceleri ve daimî nimetleri alıp gittiler, demişler. Resûlüllah (sallallahü aleyhi ve sellem): o?» diye sormuş. Muhacirler: (Ne olacak) onlar da bizim kıldığımız gibi namaz kılıyor; bizim tuttuğumuz gibi oruç tutuyor, (amma) onlar sadaka veriyor; biz veremiyoruz; onlar köle azâd ediyor, biz edemiyoruz» demişler. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): size bir şey öğreteyim mi? Onunla sizi geçenlere yetişir; sizden sonrakileri de geçersiniz. Hem hiç bir kimse sizden daha faziletli olamaz; meğer ki sizin yaptığınız gibi yapmış olsun?» buyurmuş. Muhacirler: Hay hay Yâ Resûlüllah!.. demişler. Resûlüllah (sallallahü aleyhi ve sellem): namazdan sonra otuzüç kere tesbîh, tekbîr ve tahmîd edersiniz.» Ebû Salih ki: «Bunun üzerine fakir muhacirler Resûlüllah (sallallahü aleyhi ve sellem)’e dönerek; mülk sahibi din kardeşlerimiz bizim yaptığımızı işitmiş; bnaun mislini onlar da yaptılar!» demişler. Resûlüllah (sallallahü aleyhi ve sellem): (Ne yapalım) Bu, Allah'ın bir fadl-u keremidir; onu dilediğine verir.» buyurmuşlar. başkaları bu hadîsde Leys'den, o da İbn Aclân'dan naklen şunu da ziyâde etmişlerdir: Sümey dedi ki: Ben bu hadîsi yakınlarımdan birine söyledimde: Yanılıyorsun! Resûlüllah (sallallahü aleyhi ve sellem) ancak: «Otuz üç kere tesbîh çeker; otuz üç kere tahmîd eder; otuz üç kere de tekbîr eylersin!» buyurmuşdur; dedi. Bunun üzerine Ebû Salih'e dönerek bu mes'eleyî ona da söyledim. Ebû Salih elimden tutarak şunları söyledi: Allâhû Ekber, Sübhânallah, Elhamdüllillâh; Allâhu Ekber, Sübhânallah, Elhamdülillah... (diye diye) bunların hepsinden otuz üçe varacaksın-» dedi. Aclân ki: «Ben bu hadisi Recâ' b. Hayve'ye rivâyet ettim; o da onun mislini Ebû Sâlih'den, o da Ebû Hüreyre'den, o da Resûlüllah (sallallahü aleyhi ve sellem)’den naklen rivâyet etti.»",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 184
			}
		}
	]
}