{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1347,
			"arabicnumber": "595.01",
			"text": "Bize Asım b. Nadir Et-Teymî rivayet etti. (Dediki): Bize El-Mutemir rivayet etti. (Dediki): Bize Ubeydullâh rivayet etti. H. Bize Kuteybetü'bnü Saîd de rivayet etti. (Dediki): Bize Leys, İbni Adân'dan rivayet etti. Bunların ikisi de Sümey'den, o da Ebu Sâlih'den, o da Ebu Hureyre'den naklen rivayet ettiler. (Bu hadîs Küteybe'nindir.)ki: Muhacirlerin fakirleri Resulullah (Sallallahu Aleyhi ve Sellem)'e gelerek: Varlık sahipleri yüksek dereceleri ve daimî nimetleri alıp gittiler, demişler. Resulullah (Sallallahu Aleyhi ve Sellem) : «Neymiş o?» diye sormuş. Muhacirler : — (Ne olacak) onlar da bizim kıldığımız gibi namaz kılıyor; bizim tuttuğumuz gibi oruç tutuyor, (amma) onlar sadaka veriyor; biz veremiyoruz; onlar köle azâd ediyor, biz edemiyoruz» demişler. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Ben size bir şey öğreteyim mi? Onunla sizi geçenlere yetişir; sizden sonrakileri de geçersiniz. Hem hiç bir kimse sizden daha faziletli olamaz; meğer ki sizin yaptığınız gibi yapmış olsun» buyurmuş. Muhacirler: — Hay hay Yâ Resülâllah! demişler. Resulullah (Sallallahu Aleyhi ve Sellem): «Her namazdan sonra otuzüç kere tesbîh, tekbîr ve tahmîd edersiniz.» Ebu Salih demiş ki: «Bunun üzerine fakir muhacirler Resulullah (Sallallahu Aleyhi ve Sellem)'e dönerek; «Mal, mülk sahibi din kardeşlerimiz bizim yaptığımızı işitmiş; bunun mislini onlar da yaptılar!» demişler. Resulullah (Sallallahu Aleyhi ve Sellem) : «(Ne yapalım) Bu, Allah'ın bir fadl-u keremidir; onu dilediğine verir.» buyurmuşlar. Kuteybe'den başkaları bu hadîsde Leys'den, o da ibni Aclân'dan naklen şunu da ziyâde etmişlerdir: Sümey Dediki: Ben bu hadîsi yakınlarımdan birine söyledimde: — Yanılıyorsun! Resulullah (Sallallahu Aleyhi ve Sellem) ancak: «Otuz uç kere tesbîh çeker; otuz üç kere tahmîd eder; otuz uç kere de tekbîr eylersin!» buyurmuşdur; dedi. Bunun üzerine Ebu Salih'e dönerek bu mes'eleyî ona da söyledim. Ebu Salih elimden tutarak şunları söyledi: — Allâhû Ekber, Sübhânallah, Elhamdüllillâh; Allâhu Ekber, Sübhânallah, Elhamdulillah... (diye diye) bunların hepsinden otuz üçe varacaksın-» dedi. İbni Aclân demiş ki: «Ben bu hadisi Recâ' b. Hayve'ye rivayet ettim; o da onun mislini Ebu Sâlih'den, o da Ebu Hureyre'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti.»",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 184
			}
		}
	]
}