{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1360,
			"arabicnumber": "602.02",
			"text": "(Bize Kuteybetü'bnü Saîd rivâyet etti. ki): Bize Fudayl (yani İbn Iyâz) Hişâm'dan rivâyet etti. H. Züheyr b. Harb'da rivâyet etti. Lâfız onundur. ki): Bize İsmail b. İbrahim rivâyet etti. ki): Bize Hişâm b. Hassan, Muhammed b. Sîrin'den, o da Ebû Hüreyre'den naklen rivâyet etti. Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): ikaamet getirildiği vakit ona hiç biriniz koşmasın! lâkin sükûnet ve vak'ârı muhafaza ederek yürüsün. Erişebildiğini. (İmâmla) kıl, yetişemediğini de kaza et!» buyurdular. hadîsi Buhârî «Ezan» ve «Cum'â» bahislerinde tahrîc etmişdir. Hadîs Tirmizî'nin «Siraen»inde dahi mevcûddur. ikaamet getirilirken koşarak ona yetişmeye çalıgmakdan ne-hî buyurulması, şâir hâllerde koşarak gitmenin evleviyyetle memnu' olduğunu bildirmek içindir. Çünkü ikaamet getirilirken koşmak namazın bir kısmına yetişememek endîşesi mevcûd olduğu hâlde yasak edilirice böyle bir endîşe melhuz olmadığı zaman evleviyyetle menınÛ' olur. Bunun hikmeti hakkında ulemâ şunu söylemişlerdir: \"Namaza ikaamet getirilirken koşarak giden kimse yorularak kesilir. Ve namaza bu hâlle girer. Böyle yorgun ve bitkin bir hâlde kılınan namazda ise beklenilen huşu' hâsıl olamaz. Fakat namaza vaktinde vakar ve sükûnetle giden kimse mescide ikaametden önce varacağı için bir parça istirahat bile eder. Bu suretle hiç bir telâş ve yorgunluk bulunmadan kılınan namaz elbetde huşu' ve huzû' itibârı ile daha mükemmel olur. ile vakar kelimeleri bâzılarına göre ayni mânâyadır. Fakat Nevevî'ye göre sekînet hareketlerinde ağır başlı davranmak, abes sayılan şeylerden kaçınmakdır. Vakaar ise hey'ette olur. Meselâ: bakınma-mak, bağıra bağıra konuşmamak vakardan ma'dûddurlar. rivâyetlerin hepsinde mescide koşa koşa gitmek yasak edilmektedir. Hâlbuki Teâlâ Hazretleri Cum'â namazı hakkında «Allah'ın zikrine koşun...» buyurmuştur. Ancak hadîs ile âyetteki koşmak tâbirleri ayrı ayrı mânâlarda kullanılmışdır. Âyetdeki koşmakdan murâd yürümek ve gitmekdir. Kasd etmek mânâsına da gelebilir. Hadîsdeki koşmakdan murâd ise kelimenin hakîkî mânâsıdır. Çünkü koşa koşa gitmek az yukarıda arzettiğimiz vecîhle namazın huşu' ile kılınmasına mâni' olur. Binâenaleyh âyetle hadîs arasında mânâ'itibariyle bir birine mühâfât yoktur. Mü'mine yaraşan islâmî terbiye ve âdaba dikkat etmek, en mükemmel ve mu'teber olan hâlde bulunmakdır. (sallallahü aleyhi ve sellem)’in: sizden biriniz namaz maksadiyle yola çıkarsa artık namazda sayılır.» sözü bütün vakitlere şâmildir. Gerek bu cümle gerekse: (İmâmla) kılın; yetişemediğinizi de (kendiniz) tamamlayın!» ifadesiyle Resûlüllah (sallallahü aleyhi ve sellem) namaza koşa koşa gitmenin doğru olmadığını te'kîd suretiyle tenbîh buyurmuş; koşarak gitmenin yalnız namaza yetişenlere değil, yetişemeyenlere de memnu' olduğunu beyân etmiştir",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 195
			}
		}
	]
}