{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1400,
			"arabicnumber": "616",
			"text": "(Bana Muhammed b. El-Müsennâ rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be rivâyet etti. ki): Ben Muhacir Ebû’l - Hasen'i, Zeyd b. Vehb'den, o da Ebû Zerr'den işitmiş olarak rivâyet ederken dinledim. Ebû Zerr Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem)’in müezzini öğle ezanını okumak istedi de, Peygamber (sallallahü aleyhi ve sellem): bırak, serinliğe bırak!» yahut: «Bekle, bekle! Çünkü sıcağın şiddeti, cehennemin kükremesindendir. Sıcak şiddetlendi mi, namazı serinliğe bırakın!» buyurdular. Zerr: «Tâ biz tepeciklerin gölgelerini görünceye kadar (bekledi.) »demiş. hadîsin bâzı rivâyetlerini Buhârî Mevâkîtü's - Salât» ve «Sıfatü'n-Nar» bahislerinde; Ebû Dâvûd ile Tirmizî «Namaz» bahsinde muhtelif râvîlerden tahrîc etmişlerdir. beyânına göre «tbrâd»ın hakikati soğuğa girmek demekdir. Maksad namazı soğukda îfâ etmek. Yani namazı soğuk zamanda kılmak demekdir. Soğuk zamandan murâd dahi, sıcağın şiddetinin kırıldığı hissedilen zamandır. Zîrâ sıcağın şiddeti, namazda huşû'a mâni olur. Hallâbî diyor ki: «İbrâd: Sıcağın öğle zamanındaki şiddetinin kırılmasıdır. Çünkü öğle zamanındaki kaynar sıcağa izafetle sıcağın biraz kırılması soğumak sayılır. Yoksa serinlik zamanına bırakmakdan murâd, namazı günün sonuna; akşam serinliğine bırakmak değildir. Zİrfi bunda bütün İmâmların kavillerinden hârice çıkmak vardır.» namazını serinliğe bırakmanın hikmeti hususunda ihtilâf edik mişdir. Bâzılarına göre bu geciktirme meşekkati def etmek içindir. Çünkü sıcağın şiddeti huşû'u giderir. takımları zeval vakti, cehennem kükrediği için namazın geri bırakıldığını söylemişlerdir. şöyle bir suâl hatıra gelebilir: «Namaz rahmete sebepdir. Oriu kılmak dahi azabın define vesile olur. Binâenaleyh nasıl olmuşda Resûlüllah (sallallahü aleyhi ve sellem) o hâlde namazın terkini emretmişdir?» suâle iki dürlü cevap verilmişdir. Ya'merî'ye göre, ta'lîl şeriat sahibi tarafından gelirse mânâsı anlaşılmasa bile kabulü îcâb eder. Ehl-i Hikmet'e göre, zeval zamanı gadab-ı ilâhînin zuhur ettiği zamandır. Binâenaleyh o zamanda talepde bulunmanın hiç bir faydası yokdur. Bundan yalnız izinliler müstesnadır. Nitekim şefaat hadîsinde beyân edildiği vecîhle kıyâmet gününde şefaat hususunda bütün Peygamberler, ümmetlerinden özür dileyecek yânı şefaat edemiyecekler, bizim Peygamberimiz Muhammed Mustafa (sallallahü aleyhi ve sellem) ise hiç bir i'tizârda bulunmıyacak zîrâ şefaat için kendisine izin verilecekdir. «Cehennemin kükremesi bir teşbih ve temsildir; yânî öğle zamanının sıcağı, cehennemin kükremesi gibi şiddetli olur, ma'nâsınadır.» derler. Bazıları bu sözün hakikat olduğunu söylemişlerdir. Bu takdirde öğle zamanındaki şiddetli sıcak hakîkaten cehennemin kükremesi te'sîri ile olur. şerifde zikri geçen müezzîn'den murâd: Hazret-i Bilâl (radıyallahü anh)'dır. Zîra hadîsin bâzı tarîklerinde ismi sarahaten zikredîlmişdir. murâd; kum yahut toprak tepeleridir. Eşyanın öğleden sonraki gölgesidir. Sabahki gölgesine «zil» denir",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 234
			}
		}
	]
}