{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1411,
			"arabicnumber": "621.04",
			"text": "Bize yine Yahya b. Yahya rivâyet etti. ki: Mâlik'e İshâk b. Abdillah b. Ebi Talhâ'dan dinlediğim, onun da Enes b. Mâlik'den rivâyet ettiği şu hadîsi okudum. Enes şöyle dedi: Biz ikindiyi kılardık, sonra insan Benî Amr b. Avf kabilesine gider de onları ikindiyi kılarken bulurdu.» hadîsi Buhârî «Mevâkitü's - Salât» bahsinin müteaddid yerlerinde; Ebû Dâvûd, Nesâî ve İbn Mâce «Namaz» bahsinde rivâyet etmişlerdir. Âliye'nin cem'idir. Yükseklikler yaylalar mânâsına gelir. Bundan murâd: Medine'nin Necid tarafına düşen köyleridir. Tihâme tarafındaki köylere «Sâfile» derler. Zührî'nin beyânına göre Avâlî denilen köyler, Medine'ye iki, üç mil mesafededirler. hadîsi Ebû Avâne «Sahîh»inde, Zührî'den rivâyet etmişdir. Onun rivâyetinde: «Avâlî, Medîneye üç mil mesafededir.» de-nilmişdir. Leys tarîki ile Zührî'den rivâyetinde mezkûr mesafenin üç dört mil; Dâre Kutnî'nin rivâyetinde altı mil, Abdurrezzâk'ın, Zührî'den rivâyetinde iki üç mil denilmişdir. Kâdî îy âz bunların en uzak olanlarının Medine'ye sekiz mil mesafede bulunduğunu söyler. ihtilâflardan anlaşılıyor ki Avâlî denilen köylerin Medine'ye en yakını iki mil, en uzağı da sekiz mildir. Üç, dört ve altı mil ta’bîrleri muhtelif köylerin, Medine'ye uzaklığına göredir. Rivâyetlerin arası bu şekilde bulunur. mil, dört bin arşındır, yani fersahın üçte biridir. Bir arşının uzunluğu yirmidört parmak yani cümlelerinin ihtiva ettiği harfler sayısınca olup aşağı yukarı bir adım demekdir. Bu hesapça bir mil dört bin adım demekdir. Bazıları mil'i üçbinbeşyüzden, dörtbin arşına kadar olan mesafe diye tefsir etmişlerdir. «El-Yenâbi» nâm eserde: «Mil fersahın üçte biri olup; dörtbin adım mesafedir. Her adım âmme arşını ile bir buçuk arşındır. Âmme arşını yirmidört parmak uzunluğundadır.» denilmişdir. Medine'ye üç mil kadar uzakta bulunan bir yerin ismidir. Amr Vavı kabilesinin bulunduğu yer Medine'ye iki mil mesafededir. diyor ki: «Güneşin dipdiri olmasından murâd: Renginin sâfîliği yani sararmamış ve değişmemiş hâlidir.» Yine Hattâbi ile diğer bâzı ulemâya göre güneşin diriliği, sıcaklığının mevcûd olmasıdır. Bâbın hadîslerinden murâd, ikindiyi vakti girer girmez kılmaya şitâb etmekdir. Çünkü ikindiyi kıldıkdan sonra iki veya üç mil mesafede bulunan bir yere güneş sararmadan ve rengi bozulmadan varabilmek ancak ikindiyi vaktinin evvelinde kılmakla mümkün olabilir. Hattâ Nevevî’nin beyânına göre bu iş hemen hemen yalnız uzun günlerde mümkün olabilir. Amr b. Avf'ın yaşadığı yerler, Medine'ye iki mil mesafede bulunduğuna göre Resûlüllah (sallallahü aleyhi ve sellem) ikindiyi kılmak hususunda son derece acele ediyormuş; demekdir. Anlaşılıyor ki Benî Amr ikindi namazını vaktin ortasında kılarlarmış. Çünkü böyle olmasa hadîs hüccet teşkil edemez. İhtimâl ki mezkûr kabile ziraatları ile bağ ve bahçeleri ile meşgul olurken ikindiyi bir parça geciktirirlermiş. Enes (radıyallahü anh) bu hadîsi «Resûlüllah (sallallahü aleyhi ve sellem) kılardı., «Biz kılardık.» tâbirleri ile rivâyet etmişdir. Sahâbi'nin bu gibi sözlerle rivâyet ettiği hadîsin müsned mi yoksa mevkuf mu sayılacağı ulemâ arasında ihtilaflıdır. Bazıları müsned sayılacağına kaail olmuşlardır. Hâkim (321-405) bu kavli tercih etmiştir. Daveviye Kutnî (306 - 385) ve başkaları bu gibi hadîslerin mevkuf sayılacağını söylemişlerdir. diyor ki: «Doğrusu böyle hadîslere lâfzan mevkuf, hükmen merfu' demelidir. Çünkü sahâbî o hadîsi ihticâc makamında rivâyet etmişdir. Binaenaleyh Resûlüllah (sallallahü aleyhi ve sellem) zamanında olduğunu anlatmak istediğine hamledilir.» Nevevî'ye göre bu Bâbın hadîsleri ikindinin her şey'in gölgesi bir misli olduğu zaman girdiğine kaail olan İmâm Mâlik, İmâm Şafiî, İmâm Ahmed ve Cumhûr-u ulemâya delildirler İmâm A'zam: «İkindinin vakti her şey'in gölgesi iki misli olduğu zaman girer.» demişdir. Bu hadîsler onun aleyhine delâlet etmektedir. Aynî bu mütâleaya îtirâz etmiş; Enes hadîsinin mevkuf veya müsned sayılacağı hususundaki ihtilâfı hatırlatarak: «Şayet Enes hadîsi kat'î sûretde merfû' olsaydı o zaman onların dediklerine hüccet olurdu. Hâlbuki hadîsin mevkuf mu, müsned mi sayılacağı ihti lâflıdır.» demişdir",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 245
			}
		}
	]
}