{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 142,
			"arabicnumber": "29",
			"text": "Bize Kuteybetü'bnü Said rivâyet etti. ki: Bize Leys, İbn Aclân'dan,. o da Muhammed b. Yahya b. Habbân'dan, o da İbn Muhayriz’den, o da Sunâbihi' den, o da Ubâdetü'b-nü's-Sâmit'den naklen rivâyet etti. Sunâbihî Şöyle dedi: Ubâdetü'bnü's-Sâmitîn yanına girdim. Kendisi Ölüra hâlinde idi. (Bunu görünce) ağladım. Dur bakalım, niçin ağlıyorsun? Vallahi benden şahidlik istense senin için mutlaka şahidlik ederim. Bana şefaat hakkı verilse senin için mutlaka şefaatte bulunurum. Gücüm yetse sana mutlaka faydalı olurum, dedi. Sonra şunları söyledi: Vallahi Resûlüllah (sallallahü aleyhi ve sellem)'den, içinde sizin için hayır bulunan hiç bir hadîs işitmemişimdir ki onu sizlere rivâyet etmiş olmayayım. Yalnız bir tek hadîs müstesna! Onu da sizlere bu gün, son demimi yaşarken söyleyeceğim. Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: kim Allah'dan başka ilâh olmadığına ve Muhammed'in Resûlüllah olduğuna şehâdet getirirse Allah o kimseye cehennemi haram kılar.» buyururken işittim. Sunabihi'nin ağlaması ya gördüğü Ölüm ızdırabına yahud bundan sonra Ubâde (radıyallahü anh)'dan istifâde edemeyeceğine hamledilirse de en münasibi, huzur-ı ilâhiye çıkılacağını hatırladığı için ağlamış olmasıdır. Bana mühlet ver; müsaade buyur; manâsında kullanılan ve fiilinin yerini tutan bir masdardır. Müfred, tesniye ve cem'i ile müzekker ve müennes halleri hep ayni şekilde kullanılır. sizin için hayır bulunan hiç bir hadîs işitmemişimdir ki onu sizlere rivâyet etmiş olmayayım.» ifâdesinin mefhumu muhalifinden anlaşılan mâna —ki içinde hayır bulunmayan hadîslerdir— muhataplara nis-betledir. Yoksa her hadîsde hayır vardır. şerifin bu cümlesinden pek âlâ anlaşılıyor ki rivâyeti gizlenen hadîslerin teklif yani emir ve nehiy ifade eden, delillerden olmamaları icabeder. Bu bâbta Kâdi Iyâz şunları söylemektedir: hadisde Ubâdetü'bnü'-s-Sâmit'in zarar ve fitneye sebeb olacağından korktuğu ve her aklın kaldıramayacağı bir şeyi gizlediğine delil vardır. Bu gizleme amel icâbetmeyen ve içinde hudud-i şeriy-yeden bir hadd bulunmayan hadisde olur. Bunun gibi bir amel icâbetmeyen, zaruriyyattan da olmayan yahud avammın, akılları kavrayamayan veya râvisine yahud dinleyene bir zararı dokunacağından korkulan hadîsleri, bâ husus münafıklara veya amirliği ve iyi nâmları olmayan bir kavve Ebû Said-i Hudrî (radıyallahü anhüm) gibi birçok sahabe-i kirâma yetişmiştir. Aslen Mekkeli ise de Beyti Makdis'de yaşamış; Ömer b. Abdilaziz'in hilâfeti zamanında vefat etmiştirmin kim olduklarını tayine; diğerlerini zem ve tel'ine mütaallik haberleri ashâb-ı kirâmın terkettikleri çoktur. esas itibariyle: kuşatıldı» demek ise de onunla: yaklaştı; hayattan ümidimi kestim; son demimi yaşıyorum» kasdedilir. Esasen bu söz düşmanları tarafından her tarafı sımsıkı çevrilen ve kurtuluş ümidi kalmayan kimsenin söyleyeceği sözdür",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 49
			}
		}
	]
}