{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1429,
			"text": "Müslim der ki: Bu hadîsi Eşcaî dahi, Süfyân-ı Sevr i'den, o da Esved b. Kays'dan, o da Şakîk b. Ukbe'den, o da Berâ' b. Azib'den naklen rivâyet etti. Berâ': «Biz o âyeti, Peygamber (sallallahü aleyhi ve sellem) ile birlikde bir zaman okuduk» diyerek, Fudayl b. Merzûk'un hadîsi gibi rivâyetde bulunmuş. rivâyetlerin her biri, orta namazın ikindi olduğuna delâlet etmektedir. Yalnız Hazret-i. Âişe hadîsinde ikindi namazı orta namaz üzerine atfedilmişdir. Ma'tûf ile ma'tûfun aleyhin başka başka şeyler olmaı lâzım geldiğine bakarak Şâfiîyye ulemâsından Bazıları: «Orta namaz ikindi değildir.» demişlerse de, «Şazz kırâetle ihticâc edilemez; ona Resûlüllah (sallallahü aleyhi ve sellem)'in hadîsi hükmü de verilemez. Çünkü bu kırâeti nakleden, onu Kur'ân diye nakletmişdir. Kur'ân ise ancak biricmâ' tevatürle sabit olur. Mezkûr kıraatin Kur'ân olduğu sübût bulmayınca hadîsliği de sabit olmaz.» diyerek Şafiî mezhebinin bunu kabul etmediğini beyân etmişdir. Vüstâ» yani orta namazdan murâd ne olduğu taa ashâb-ı kirâm zamanından beri ulemâ arasında ihtilaflı bir mes'eledir. Ashâb-ı kirâmdan Alîyyü'bnü Ebî Tâlib, İbn Mes'ûd, Ebû Eyyûb El-Ensârî, Abdullah b. Ömer, Abdullah b. Abbâs, Ebû Saîd-i Hudrîve Ebû Hüreyre (radıyallahü anhûm) hazerâtı ile Tabiînden Hasan-ı Basrî, İbrâhîm Nehaî, Katâde, Dahhâk, Kelbî ve Mukaatil, mezhep İmâmlarından Ebû Hanîfe, Ahmed b. Hanbel, Dâvûd-u Zahirî, İbnü'l-Münzir ve daha başkaları: «Orta namaz ikindidir.» demişlerdir. Tirmizî, sahabe ve onlardan sonra gelen ulemânın ekserisinin buna kaail olduğunu söyler. Mârûdî: «İmâm Şafiî'nin mezhebi de budur. Çünkü bu bâbdaki hadîsler sahîhdir. Şafiî'nin orta namaz sabah namazıdır; demesi ikindi hakkındaki sahîh hadisleri duymadığı içindir. Onu mezhebi hadîse tâbi olmakdır.» diyor. bir cemaata göre orta namazdan murâd sabah namazıdır. Bu kavil ashâb-ı kirâmdan Ömerü'bnü-'l-Hattâb, Muâz b. Cebel, Abdullah b. Abbâs, Abdullah b. Ömer ve Câbir (radıyallahü anhûm) ile Tabiînden Atâ', İkerime, Mücâhid, Rabî' b. Enes ve mezhep İmâmlarından Mâlik b. Enes ile İmâm Şafiî ve diğer Şafiîyye ulemâsından naklolunmuşdur. Yine ulemâdan bir taifeye göre; orta namazdan murâd öğledir. Onlar bu kavli Zeyd b. Sabit, Üsâme-tü'bnü Zeyd, Ebû Saîd-i Hudrî, Âişe ve Abdullah b. Şeddâd (radıyallahü anhûm) hazerâtından nakil etmişlerdir. Bir rivâyetde Ebû Hanîfe (rahimehüllah)'ın kavli de budur. Züeyb: «Orta namazdan murâd, akşamdır.» demiş, daha başkaları yatsı olduğunu söylemiş; bir takımları müphem olarak beş vakit namazdan biridir; demişlerdir. Hattâ Kâdi İyâz'in rivâyetine göre: «Orta namazdan murâd beş vaktin hepsidir.» diyenler olmuşdur. Cum'â namazı olduğunu iddia edenler de vardır. diyor ki: «Bu kavillerin içersinde sahîh iki kavil vardır. Onlar da ikindi ile sabandır. En sahih kavil, orta namazdan murâd ikindi ile sabahdır. En sahih kavil, orta namazdan murâd ikindi olduğunu bildiren rivâyetdir. Çünkü bu bâbdaki hadîsler sahîhdir...»",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}