{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1431,
			"arabicnumber": "631.02",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile İshâk b. İbrahim rivâyet ettiler. Ebû Bekir (Bize rivâyet etti) tâbirini kullandı. İshâk ise: Bize Veki', Ali b. Mübârek'den, o da Yahya b. Ebî Kesîr'den naklen bu isnâdda, bu hadîsin mislini haber verdi; dedi. hadîsi Buhârî «Mevâkîtü's - Salât» ile «Salâtül - Havf» bahislerinde; Tirmizî ile Nesâî de «Kitâbü's - Salât» da tahric etmişlerdir. beyânına göre, Hazret-i Ömerin küffâr'a sövmesi hendek kazmakla meşgul olurken, ikindi namazını geciktirdikleri, buna da küf-fâr sebeb oldukları içindir. fi'linin ma'nâsı hakkında, ulemâ muhtelif mutâlealar beyân etmişlerdir. Aynî bu mütâleaları sadra şifâ görmeyerek mes'eleyi şöyle tahkik ve hulâsa etmişdir: fiilinin üzerine nefiy edatı girerse, ifâde edeceği ma'nâ hususunda üç mezheb vardır. Kâde, diğer fiiller gibi başında nefiy edatı bulunmadan kullanılırsa isbât ma'nâsı ifâde eder. Başında nefiy edatı bulunursa ma'nâsı da menfî olur. Çünkü «Zeyd az daha kalkıyordu.» cümlesinin ma'nâsı, kalkmayı değil, onun yakın olduğunu anlatmakdır. Kâde fiilinin başında nefiy edatı bulunursa isbât ma'nâsı ifâde eder. Kâde'nin başında nefiy edatı bulunduğu zaman fiilin mâzî veya müstakbel olması nazar-ı dikkate alınır. Eğer mâzî ise isbat ma'nâsı ifade eder. Müstakbel olarak kullanılmışsa şâir fiiller hükmündedir. bu ciheti hülâsa ettikten sonra şu hükme varıyor: «Bu üç kavlin içersinde esah olan, birincisidir. İbn Hâcib bunu nassan bildirmişdir. Mes'ele böylece anlaşıldıkdan sonra şunu da bilmeli ki burada Kâde'nin başında nefiy edatı vardır. Binâenaleyh ma'nâsı, nefiy yani namazın yakınlığını nefiy olmuşdur. Namazın yakınlığı nefiy edilince, namazın nefiy edileceği evleviyyet tarîki ile sabit olur...» bu izahından anlaşılıyor ki, Hazret-i Ömer güneş kavuşuncaya kadar ikindiyi kılamamış; onu kazaya bırakmışdır. Ulemâdan Bazıları buradaki Kâde fi'linden Hazret-i Ömer'in güneş kavuşmaya yakın ikindiyi kıldığı ma'nâsını anlamışlardır. (sallallahü aleyhi ve sellem)’in yemin ederek: «Vallahi onu ben de kılmadım» buyurması, Ömer (radıyallahü anh) ikindiyi kazaya bırakmıştır diyenlerin sözünü te'yîd eder. Çünkü bununla Peygamber (sallallahü aleyhi ve sellem) son derece üzgün bulunan Hazret-i Ömer'in gönlünü almak istemişdi. Medine'de bir vadidir. Bu kelimeyi «Batıhân» şeklinde okuyanlar da olmuşdur. Hattâ lisan uleması Buthân okunmasını caiz görmemişlerdir. Ömer'in: «Resûlüllah (sallallahü aleyhi ve sellem) ikindiyi güneş battıkdan sonra kıldı; arkasından da akşam namazını kıldı.» sözünün zahiri, bu namazları cemaatla kıldığını göstermektedir",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 264
			}
		}
	]
}