{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1437,
			"arabicnumber": "634.02",
			"text": "(Bana Ya'kûb b. İbrahim Ed - Devrakî de rivâyet etti. ki): Bize Yahya b. Ebî Bükeyr rivâyet etti. ki): Bize Şeytân, Abdülmelik b. Umeyr'den, o da İbn Umârate'bni Rueybe'den, o da tabasından naklen rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): doğmasından ve batmasından önce namaz kılan kimse cehenneme girmez.» buyurdular. Rueyb'in yanında Basralılardan biri varmış. Rueyb'e: Bunu Peygamber (sallallahü aleyhi ve sellem)’den sen mi işittin? demiş. Rueyb: Evet! Bununla onun aleyhine şehâdet ederim... cevâbını vermiş. Basralı zât: Ben de şehâdet ederim. Vallahi Peygamber (sallallahü aleyhi ve sellem)'i bunu senin kendisinden dinlediğin yerde söylerken dinledim, demiş. hadisini Buhârî «Mevâkitü's - Salât», «Tefsir» ve «Tevhîd» bahislerinde; Ebû Dâvûd, Nesâî ve İbn Mâce «Sünnet» bahsinde muhtelif râvîlerden tahrîc etmişlerdir. şeklinde de rivâyet edilmişdir. Birinci rivâyete göre mânâsı «Sıkışınlyocaksınız.» demektir, ikinci rivâyete göre: sıkıştırmıyacaksınız.» mânâsına gelir. Bu kelimeyi şeklinde okuyanlar da olmuşdur. O kıraate göre mânâsı: göreyim de başkası görmesin diye biribirinizi Hip kakmıyacak-sınız.» demek olur. Hattâ İbn'l-Cevzî, ekseriyetle râvilerin hadîsi bu şekilde rivâyet ettiklerini söylemişdir. Mezkûr cümlenin daha başka şekilde rivâyetleri de vardır. Bunlardan birisi rivâyetidir. Mânâsı: zarar vermezsiniz.» demekdir. galebe çaldırmamak elinizden geliyorsa bunu yapın i» ifâdesi namaza gelmekden kinayedir. Galebe çalacak şeylerden murâd da uyku ve dünya işi ile meşguliyet gibi namaza mâni olan şeylerdir. bir çok rivâyetlerinde: «Sonra okudu.» denilmiş, âyeti kim okuduğu bildirilmemişdir. Bu yüzden ulemâ ihtilâfa düşmüş; Bazıları âyeti Peygamber (sallallahü aleyhi ve sellem) okuduğunu, bir takımları da Cerîr okuduğunu iddia etmişlerdir. Bâbımızın Cerîr rivâyeti okuyanın Cerîr olduğunu sarahaten beyân etmekle bu ihtilâflara son vermişdir. âyetteki tesbîhden murâd; namazdır. kıyâmetde, Allahü teâlâyı göreceklerini bildiren bu hadîsin bir çok muhtelif rivâyetleri vardır. diyor ki: sizler Rabbinize arz olunacak ve onu şu ay'ı gördüğünüz gibi göreceksiniz...» ifâdesinden murâd: Allah'ı şek'siz, şüphesiz ve hiç bir meşakkatsiz; muhakkak sûret-de göreceksiniz. Netekim şu ay'ı da hiç bir meşakkat çökmeden muhakkak sûretde görmektesiniz...» demekdir. Binâenaleyh buradaki teşbih görülen iki şey'i birbirine benzetmek değil; görmeyi görmeye benzetmekdir. Allah'ı görmek mü'minlere mahsûsdur. Küffâr, onu göremiyeceklerdir. Bazıları Allah'ı bu ümmetin münafıkları da gorecekdir; demişlerse de bu kavil zayıfdır. Sahih olan ehl-i sünnetin cumhûrunun kavlidir M şâir küffâr gibi münafıklar da Allahü teâlâ hazretlerini göremiyeceklerdir...»",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 270
			}
		}
	]
}