{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 145,
			"arabicnumber": "30.03",
			"text": "Bize Muhammed b. el-Müsenna ve İbn Beşşar tahdis etti. İbnu'l-Müsenna dedi ki: Bize Muhammed b. Cafer tahdis etti. Bize Şube, Ebu Huseyn'den ve el-Eş'as b. Suleym'den tahdis etti. Her ikisi Esved b. Hilal'i (1/59a) Mua.z b. Cebel'den şöyle dedi, diye tahdis ederken dinlediler: Rasulullah (Sallallahu aleyhi ve Sellem) şöyle buyurdu: \"Ey Muaz, Allah'ın kulları üzerindeki hakkı nedir bilir misin?\" O: Allah ve Rasulü en iyi bilir dedi. O: \"Allah'a ibadet edilmesi ve ona hiçbir şeyin ortak koşulmamasıdır\" buyurdu. Sonra: \"Eğer bunu yapacak olurlarsa onun üzerindeki haklarının ne olduğunu bilir misin\" buyurdu. Muaz: Allah ve Rasulü en iyi bilir, dedi. Allah Rasulü: \"On/arı azap/andırmamasıdır\" buyurdu. Diğer tahric: Buhari, 7373; Tuhfetu'l-Eşraf, 11306 NEVEVİ ŞERHİ: \"Ebu Husayn\"in adı Asım'dır. Buna dair açıklama kitabın Mukaddimesinin baş taraflarında (1/232) geçmiş bulunmaktadır. Muhammed b. el-Müsenna ile İbn Beşşar'ın rivayet ettikleri bu hadiste Nebi (Sallallahu aleyhi ve Sellem)'in: \"Allah'a ona hiçbir şeyortak koşulmaksızın ibadet edilmesi\" ibaresinde \"ibadet edilmesi\" anlamındaki lafzı bu şekilde ye harfi ötreli (edilgen bir mı olarak) \"şey\" anlamındaki lafzı da merfu (edilgen fiilin sözde öznesi olarak) tespit etmişizdir. Bunun açıklaması açıktır. Şeyh Ebu Amr (rahimehullah) dedi ki: Asıl yazmalarda \"şey\" lafzı nasb ile de kaydedilmiştir. Bu da \"(....) Allah'a ibadet edilmesi ve ona hiçbir şeyin ortak koşulmaması\" ifadesindeki üç ayrı vechin sözkonusu olmasına göre sahihtir. Birincisi eril üçüncü şahıs için kullanılmış bir mı olarak kulun Allah'a ibadet etmesi ve ona hiçbir şeyi ortak koşmaması demek olur. Bu, bu husustaki şekillerin en uygun alanıdır. 2- Fiilin özellikle Muaz'a hitap olmak üzere ikinci tekil şahıs olmak üzere te harfinin fethalı okunmasıdır çünkü muhatap odur. Böylelikle de ondan başkasına da dikkat çekilmiş olmaktadır. 3- Fiilin edilgen bir mı olarak ye harfinin ötreli okunmasıdır. Bu durumda \"şey\" lafzı mef'ulün bih'ten kinaye değil, mastardan (mef'ul-i mutlak mastarından) kinaye olması sözkonusudur. Yani Allah'a hiçbir şekilde ortak koşmasın. (İbnu's-Salah) dedi ki: Eğer rivayet bu şekillerden herhangi birisini tayin etmemiş ise bizden bu hadisi rivayet eden kimsenin bunların hepsini biri diğerinin arkasında telaffuz etmesi görevidir. Böylelikle bizzat söylenmiş olan lafzı kesin olarak zikretmiş olacaktır. Allah en iyi bilendir. Şeyh İbnu's-Salah'ın ifadeleri bunlardır. Bizim ilk sözünü ettiğimiz okuyuş ise hem rivayet, hem mana bakımından sahihtir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 52
			}
		}
	]
}