{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1459,
			"arabicnumber": "645.03",
			"text": "Bize Nasr b. Aliy El-Cehdamî ile İshâk b. Mûse'I - Ensârî rivayet ettiler. Dedilerki: Bize Ma'n, Mâlik'den, o da Yahya b. Saîd'den, o da Amre'den, o da Aişe'den naklen rivayet etti. Aişe şöyle demiş: «Resûlullah (Sallallahu Aleyhi ve Sellem) sabah namazını kılardı da kadınlar Çarşaflarına sarınarak dağılırlar; alaca karanlıkdan dolayı tanınmazlardı.» Ensârî kendi rivayetinde müteleffifât» tâbirini kullandı. İzah Bu hadîsi Buhari «Namaz» bahsinin bir iki yerinde; Ebu Dâvûd, Tirmizî, Nesâî ve İbni Mâce dahî «Namaz» bahsinde tahrîc etmişlerdir. Müteleffiât; tâbiri «Mü teleffif ât» şeklinde de rivayet edilmişdir. Ekseri rivayetler müteleffiât kelimesi ile vârid olmuşlardır. Her iki kelimenin mânâları «Bürünerek» demekse de aralarında fark vardır. Esmaî'nin beyânına göre, müteleffiât: Hiç bir tarafı görünmemek şartı ile âdeta çul ile sarınır gibi sarınanlardır. Bâzılarına göre kadınların bu şekilde sarındıkları örtüye «Lifâ» derler. El-Muvatta» şerhinde şöyle denilmişdir: «Teleffu': Elbiseyi başın üzerine koyarak; onunla sarınmakdır. iltifâ'; ancak başı Örtmekle olur. (İltifâ', istimal gibidir, yânî gelişi güzel sannmakdan ibarettir.) deyenler hatâ etmişdir. Teleffüf ise başını örtmekle olduğu gibi açmakla da tehakkuk eder.» Mirt: Kazzâz'in beyânına göre çarşaf demekdir. Bâzıları mırt'ın ipek, yün veya ketenden yapma bir örtü olduğunu söylerler. Bir takımları, bunun yeşil elbise demek olduğunu; diğerleri de siyah kıl'dan yapma elbise olduğunu söylemişlerdir. Mırt'ın çizgili elbiseler demek olduğunu söyleyenler hattâ gömleğe mırt denildiğini ileri sürenler de olmuştur. Bunu kadınların giymediği söylenirse de «El-Muvatta» şârihi Abdülmelik: «Mırt ince yünden yapılmış dört köşeli hafif elbisedir. O zamanın kadınları bununla örtünürlerdi.» demişdir. Kadınların tanınmaması yâ karanlık devam ettiği için yahut sımsıkı sarınıp büründüklerindendir. Aynî bu cümleyi îzâh ederken: «En iyisi onların kadın mı, erkek mi olduklarını kimse tanımaz. Görenlerin gözüne yalnız bir karaltı görünürdü; demekdir,» şeklinde mutâlea beyân etmişdir",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 292
			}
		}
	]
}