{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1495,
			"arabicnumber": "657.03",
			"text": "(Bize Ebû Bekir b. Ebî Şey be de rivâyet etti. ki): Bize Te-zîd b. Hârûn, Dâvûd b. Ebi Hind'den, o da el-Hasen'den, o da Cündeb b. Süfyan dan, o da Peygamber (sallallahü aleyhi ve sellem)’den bu isnadîm rivâyet etti. Ama Cündeb: cehennem ateşine tepesi öttü atmasın!» cümlesini söylememişdir. birinci hadîsinde Hazret-i Osmân'in, yanına oturan Abdurrahmân'a hemen Resûlüllah (sallallahü aleyhi ve sellem)’den hadîs riayet etmesi, Übbînin beyânına- göre yâ onun mescidden gideceğini anladığı yahut da namaza geç geldiği için olsa gerekdir. kim yatsıyı cemaatla kılana gecenin yansını namazla geçirmiş gibi olur.» ifâdesinden raaksad: «Kim yatsıyı cemaatla kılarsa kazanacağı sevap, yatsıyı cemaatla kılmadığı zaman gece yarısına kadar namaz kılmakla kazanacağı sevâb müsavidir.» demekdir. ikinci ve üçüncü hadîslerinde zikri geçen Cündeb b. Abdillâh ile Cündeb b. Süfyân aynı zâtdır. îsmi Cündeb b. Abdillâh b. Sûfyân'dır. Bâzı hadîslerde babasına; diğerlerinde dedesine nisbet edildiği için ayn ayrı iki şahısmış gibi görünür. zimmeti: burada Allah'ın kefalet ve te'mînâtı manasınadır. Bazıları «Allah'ın emniyeti.» mânâsına geldiğini söylemişlerdir. Allah zimmetine âid bir şey hususunda sizi talep etmesini»» cümlesinin mânâsı: «Böyle bir talepde bulunduracak isler yapmayın!» demekdir. Nitekim bu mânâda türkçemizde küçükleri bir şey'den men'etmek için: «Sakın bir daha seni bu işi yaparken görmiyeyim!» deriz. Binnetîce mânâ şöyle olur: «Bir kimse sabah namazını cemaatla kılarsa o kimse Allah'ın kefalet ve te'mînâtı altına girmiş olur. Binâenaleyh siz Allah'a karşı gitmeyin! Şayet onun rızâsına karşı bir amelde bulunursanız Allah size yetişir de cezanızı verir ve bu ceza da tepesi üstü cehenneme atılmak olur.» tâbirindeki zamîr, Allah'a da, bir kimseye de râci' olabilir. şerif ezan okunduktan sonra farz namazını kılmadan camiden çıkmanın mekruh olduğuna delildir. Bu hükümden yalnız ma'zûr olan kimse müstesnadır. «Namaz» bahsinde Allah ve Resûlü'nün zimmetlerine temas eden bir hadîs rivâyet etmişdir. Mezkûr hadîsde: «Resûlüllah (sallallahü aleyhi ve sellem): «Her kim bizim namazımızı kılar, kıblemize döner, kestiğimizi de yerse işte Allah ve Resûlünün zimmetlerini kazanan müslüman odur. Binâenaleyh siz zimmeti hususunda Allah'a verdiğiniz ahd-u peymân'ı bozmayın!» denilmişdir. Hadis Enes (radıyallahü anh)'dan rivâyet olunmuşdur",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 328
			}
		}
	]
}