{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 150,
			"arabicnumber": "33.02",
			"text": "Bana Ebu Bekr b. Nafi el-Abdi tahdis etti. (Dedi ki): Bize Behz rivayet etti. (Dedi ki): Bize Hammad rivayet etti. (Dedi ki): Bize Sabit, Enes'den naklen rivayet eyledi. Enes dedi ki: Bana İtban b. Malik tahdis ettiğine göre gözleri kör olmuştu. Bu sebeple Rasulullah (Sallallahu aleyhi ve Sellem)'e haber gönderip: Gel de benim için bir mesdt yeri tayin et, dedi. Rasulullah (Sallallahu aleyhi ve Sellem) geldi. Onunla birlikte kavmi (ashabı) da geldi. Onlardan Malik b. ed-Ouhşum denilen bir adamın niteliklerinden söz edildi sonra hadisi Süleyman b. el-Muğire'nin hadisine yakın olarak zikretti. Tahric bilgisi 148 nolu hadis ile aynıdır. NEVEVİ ŞERHİ: \"Bana bir mesdt yeri göster\" yani orayı mesdt edinmek üzere bir yeri bana alametlendirerek tespit et. Bu da senin eserini bereket bilerek orada namaz kılacağı m bir yer bana göster demektir. Bu hadiste türlü bilgiler vardır ki, bunların pek çoğu daha önce geçti. Bu Hadisten Çıkartılan Hükümler: 1- Salihlerin eserleri ile teberrük caizdir. 2- Aıimleri, fazilet sahiplerini ve büyük kimseleri onlara uyan kişilerin ziyaret etmeleri, onları tebrik etmeleri caizdir. 3- Ortaya çıkan bir masıahat sebebiyle fazileti daha az olanın, daha faziletli olanı davet etmesi, çağırması caizdir. 4- Nafile namazın cemaatle kılınması caizdir. 5- Gündüzün kılınan nafile namazıarda sünnet olan gece gibi ikişer ikişer rekat olarak kılınmalarıdır. 6- Namaz kılanların yanında onları uğraştırmadığı ve namazıarını karıştırmalarına ve benzeri hallere sebep olmadığı sürece konuşmak ve bir şeylerden söz etmek caizdir. 7- Ziyaret eden bir kimsenin ziyaret edilene rızası ile imamlık yapması caizdir. 8- Hakkında şüphe bulunup, zan altında kalmış olan ya da benzeri hallerde bulunan bir kimseden yöneticilerin önünde ve diğerleri önünde -onun tehlikelerinden korunulması için- söz etmek. 9- Hadisi ve diğer şer' i ilimIeri yazmak caizdir. Çünkü Enes oğluna: Bunu yaz, demiştir. Hatta bu hallerde yazmak müstehaptır. Hadiste ise hadisin yazılmasının yasaklandığı da sözkonusudur, yazılmasına izin verdiği de zikredilmiştir. Bu da şöyle açıklanmıştır (1/244): Yasak yalnızca yazdığına bel bağlayıp, imkanı bulunduğu halde hıfz etmekte kusurlu hareket edeceğinden korkulan kimseler içindi. İzin ise hıfz etme imkanı bulunmayan kimselere verilmişti. Hadislerin ilk olarak yazılmasının yasaklanış sebebi Kur'an-ı Kerim'e karıştırılma korkusundan dolayı idi. Ondan sonra yazmaya izin verilmesi ise bu hususta emin olunmasından sonra idi. Ashab ve tabiinden olan selef arasında hadis yazmanın caiz olup olmadığı hususunda görüş ayrılığı vardır. Sonra ümmet bunun caiz ve müstehap olduğu üzerinde icma etti. Allah en iyi bilendir. Yine hadiste işleri önem sırasına göre koyup, daha önemlisinden başlamaya delil vardır. Çünkü Nebi (Sallallahu aleyhi ve Sellem) burada zikrettiğimiz İtban hadisinde, gelir gelmez ilk olarak namaz kılmakla başlamış sonra yemek yemiştir. Um Suleym' e yaptığı ziyareti ile ilgili hadiste ise önce yemek yemiş sonra namaz kılmıştır çünkü İtban'ın hadisinde önemli olan namaz idi, çünkü onu namaz kılması için davet etmişti. Um Suleym'in hadisinde ise onu yemek yemeye davet etmişti. Her iki hadiste de belirtildiği üzere ne için davet olunmuşsa onunla başladığı görülmektedir. Allah en iyi bilendir. İmamın ve alim kimsenin bir ziyarete, bir ziyafete ya da benzeri bir işe giderken arkadaşlarını yanına alması caizdir. Bu hadisten daha önce sözünü ettiğimiz daha başka hükümler ile yazmadığımız başka hükümler de anlaşılmaktadır. Doğruyu en iyi bilen Allah'tır. Hamd ona mahsustur, nimet, lütuf ondandır, minnet onadır, başarı ondandır, hatadan koruyan yalnız odur",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 57
			}
		}
	]
}