{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1534,
			"arabicnumber": "673.03",
			"text": "Bize Muhammed b. El - Müsennâ ile İbn Beşşâr rivâyet ettiler. İbnül - Müsennâ dedi ki: Bize Muhammed b. Ca'fer, Şu'be'den, o da İsmail b. Recâ'dan naklen rivâyet etti. ki: Ben, Evs b. Dam'ac'ı şöyle derken işitdim: Ben Ebû Mes'ûd'u şunu söylerken dinledim: Bize (sallallahü aleyhi ve sellem): Allah'ın kitabını en iyi okuyanları ve okuma hususunda en kıdemlileri İmâm olur. Eğer okumaları müsavi ise, onlara hicret hususunda en kıdemlileri, İmâm olsun! Hicret hususunda da müsavi iseler yaş'ça en büyükleri İmâm olsun! Sakın bir kimseye evinde ve idaresi altında bulunan yerde İmâmlık yapma! Onun evinde yaygısı üzerine de oturma! Ancak sana izin verirse yahut onun izni ile oturursan, o başka!»buyurdular. hadîsi Buhârî'den mâda bütün Kütüb-i Sitte sahihleri «İmâmet» bahsinde tahrîc etmişlerdir. Onu İbn Hıbban ile Hâlemim dahi rivâyet etmişlerdir. Yalnız Hâkim «Sünneti en iyî bilenleri» yerine «En fakîh olanları.» demişdir, Fakîh tâbiri lâfız itibârı ile ga-rîb ise de isnadı sahihdir., göre, bir cemâatin içinde İmâmlığa en lâyık olanlar, sünneti en iyi bilenleridir. Eğer bu husûsda müsavi olurlarsa Allah'ın kitâ-Dinı en iyi okuyanları; bunda da müsâvî olurlarsa en ziyâde vera've takva sahibi olanları; bunda da müsâvî olurlarsa en yaşlı olanları İmâm olur. hadîsde ilk aranacak vasfın en iyi okumak olduğuna işaret buyurulmuşsa da ashâb-ı kirâm zamanında en iyi Kur'ân okuyanlar ayni zamanda dînin ahkâmını en iyi bilenlerdi. Sonraları hâl değişmişdir. Onun için Hanefîyye ulemâsı sünneti yânı ahkâmı en iyi bilenin İmâmlığa en lâyık olduğunu söylemişlerdir. Bununla beraber İmâm. Ebû Yûsuf-cîan bir rivâyete göre en iyi Kur'ân okuyan İmâmlığa en lâyık olan. kimsedir. Mâlîkîler'e göre hükümdar veya onun naibi olan vâlî vb. gibi kimselerin onlardan daha erbâbı bulunduğu hâlde İmâm olmaları mendûbdur. Ondan sonra sıra maaşlı İmâma gelir; o da yoksa ev sahibine gelir; o da lâyık değilse cemâat aralarından en fakîh olanını seçerler. Çünkü namazda lâzım olan kıraat mikdârı ma'lûm ve mazbûtdur. Onu herkes bilir. Fıkıh mes'eleleri ise her kesin bileceği şekilde mazbut değildir. Bazen namazda Öyle hâl arız olur ki, o hâl karşısında doğru yolu ancak şer'î mesaili iyi bilen kimse bulabilir. Bundan dolayıdır ki, Peygamber (sallallahü aleyhi ve sellem) namazda İmâm olmak üzere ashabı arasından Ebû Bekir (radıyallahü anh)’ı seçmişdir. Hâlbuki ashâb içersinde Hazret-i Ebû Bekir'den daha. güzel Kur'ân-ı Kerîm okuyanlar bulunduğunu bizzat Resûlüllah (sallallahü aleyhi ve sellem) beyân etmişti. beyânına göre Şâfiiler'den Bazıları veya' sahibini fakih ile en iyi Kur'ân okuyana tercih etmişlerdir. Çünkü İmâmlıkdan. maksad, herkesden ziyâde vera' ve takva sahibi kimselerle hâsıl olur. ile takva arasında fark vardır. Takva: Haram olan şeylerden sakınmakdır. Vera' ise, haramdan mâda şüpheli olan şeylerden bile sakınmakdır. göre İmâmlığa en lâyık olan, fıkhı en iyi bilen ve Kur'ân'ı en iyi okuyandır. Bu husûsda müsâvî olurlarsa Kur'ân'ı en iyi okuyan tercih edilir. (sallallahü aleyhi ve sellem) İmâm seçilecek kimselerin, sünnet ilmi hususunda da müsâvî olurlarsa hicret hususunda kıdemli olanı geçirileceğini beyân etmişdir. ulemâya göre hicret kıyâmete kadar devam edecekdir. Gerçi bir hadîs-i şerifde: «Mekke'nin fethinden sonra hicret yokdur.» buyurulmuşdur. Fakat bundan nıurâd bilumum her yer'den hicret değil «Mekke'den hicret yokdur.» demekdir. Çünkü fetihden sonra Mekke de-islâm diyarı arasına katılmışdır. Yahut bu hadîsdea murâd: «Mekke'nin fethinden önceki hicret gibi faziletli hiç bir hicret yokdur.» demekdir. îş-te İmâm seçilecek kimseler hicret hususunda da müsavi olurlar meselâ biri eski muhacirlerin oğullarından, diğeri yani muhacirlerden olursa, eski muhacirlerin oğlu tercih edilir. husûsda da müsâvî iseler, hadîsin bir rivâyetine göre islamıyeti kabulde en kıdemli; diğer rivâyetine göre yaş'ça en büyük olan tercih edilir. bir rivâyetinde: birinin hâkim olduğu yerde, başka biri ona İmâm olmasın!..», rivâyetinde: bir kimseye evinde ve idaresi altında bulunan yerde İmâmlık etme!..» buyurulmuşdur. Ulemâ bu husûsda şunları söylemişlerdir: «Ev sahibi, bir meclîsin hâkimi ve mescidin İmâmı, İmâmlık hususunda başkalarından evlâdırlar. Velev ki başkaları fıkıh, kıraat, vera' vb. hususunda onlardan evlâ olsun. sahibi isterse İmâm olur; dilerse İmâmete başkasını geçirir. Bu husûsda söz onundur. Bazıları: «Hükümdar veya onun yerini tutan vali vb. gibi biri geldiği zaman ev sahibine ve mahalle İmâmı gibi kimselere tercih edilir. Çünkü onun vilâyeti umûmidir. Ev sahibinin kendinden daha faziletli birine izin vererek onu İmâmete geçirmesi müstehâbdır.» demişlerdir. döşekT minder, posteki ve emsali yaygılardan ev sahibine tahsis edilenidir. kimin tercih edileceği hususunda her mezhebin, kendine göre tafsilâtı vardır. Bunlar fıkıh kitaplarından öğrenilebilir",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 367
			}
		}
	]
}