{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1563,
			"arabicnumber": "682.01",
			"text": "Bize Ahmed b. Saîd b. Sahr Ed-Dârimî rivayet etti. (Dediki): Bize Ubeydullah b. Abdilmecîd rivayet etti. (Dediki): Bize Selm b. Zerîr El-Urâridî rivayet etti. Dediki: Ben Ebu Raca' El-Utâridî'yi, Imrân b. Husayn'dan naklen rivayet ederken dinledim. İmrân, şöyle demiş: «Bir yolculuğunda Nebi (Sallallahu Aleyhi ve Sellem) ile beraber idim. Bütün gece yürüdük. Sabah yaklaşınca biraz mola verdik. Derken tâ güneş doğuncaya kadar uyuya kalmışız. İçimizden ilk uyanan, Ebu Bekir oldu. Nebi (Sallallahu Aleyhi ve Sellem) uyuduğu vakit, kendiliğinden uyanmadıkça, biz kendisini uyandırmazdık. Sonra Ömer uyandı ve Nebi (Sallallahu Aleyhi ve Sellem)'in yanında durarak yüksek sesle tekbîr almaya başladı. Nihayet Resulullah (Sallallahu Aleyhi ve Sellem) uyandı. Başını kaldırarak, güneşin doğmuş olduğunu görünce : «Yola revân olun!» buyurdu. Ve bizi hareket ettirdi. Güneş, beyazlaşınca, konakladı ve bize sabah namazını kıldırdı. Bu sırada cemâatdan, bir adam ayrılarak bizimle beraber namaz kılmadı. Namazdan çıkınca Resulullah (Sallallahu Aleyhi ve Sellem) ona: «Yâ Fülan! Bizimle beraber namaz kılmakdan seni ne men etti?» diye sordu. O zât: — Yâ Nebîyyallah! Cünub olmuşum, dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) ona (teyemmümü) emretti, o da toprakla teyemüm ederek namazını kıldı. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) beni yanındaki birkaç kişilik kafileyle beraber acele su aramaya gönderdi. Adamakıllı susamişdık. Yolda giderken birdenbire, (devesi üzerinde) ayaklarını iki su tulumu arasına salarak oturmuş bir kadına rastladık. Ve ona: su nerede? diye sorduk. Kadın : — Heyhat!.. Heyhât!.. Size, su yok!., dedi. — Senin ailen ile suyun arasında ne kadar mesafe var? dedik. — Bir gün bir gecelik yol!..» cevâbını verdi. Biz: — Yürü bakalım Resulullah (Sallallahu Aleyhi ve Sellem)'in huzuruna!., dedik. Kadın : — Resulullah, kim oluyor? dedi. Biz, kadını kendi hâline bırakmıyarak götürdük ve Resulullah (Sallallahu Aleyhi ve Sellem)'in huzuruna çıkardık. Efendimiz, ona sordu. Kadın bize haber verdiği gibi ona da haber verdi. Kendisinin yetim sahibi olduğunu; birkaç yetim çocuğu bulunduğunu da söyledi. Derken Resulullah (Sallallahu Aleyhi ve Sellem) onun devesinin çöktürülmesini emir buyurdu. Hemen deveyi çökerttiler. Peygamber (Sallallahu Aleyhi ve Sellem) tulumların üst kısımlarındaki ağızlarına su püskürdü; sonra kadının devesini kaldırdı. Biz kanıncaya kadar su içtik. Topumuz, kırk susamış adamdık. Yanımızdaki bütün tulum ve su kaplarını doldurduk; (cünup olan) arkadaşımızı da yıkadık. Ancak hiç bir deveye su vermedik. Halbuki onlar (yâni kadının su tulumları) patlayacak derecede su ile doluydular. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) ashabına : «Yanınızda ne varsa getirin!» buyurdular. Artık kadına kimi (ekmek) parça (sı) kimi kuru hurma (olmak üzere bir hayli yiyecek) topladık. Resulullah (Sallallahu Aleyhi ve Sellem) kadına verlimek üzere bunları, bir bohçaya sardı. Ve ona : «Haydi git de bunları çoluğuna çocuğuna yedir! Bilmiş ol kî biz, senin suyundan hiçbir şey eksiltmedik.» dedi. Kadın ailesi nezdine varınca şunları söylemiş: — Vallahi ben insanların en sihirbazına rastladım. Yahut da o zât hakîkaten dediği gibi Nebidir. Şöyle ve şöyle işler yaptı...» İşte bu kadın sebebi ile Allah onun obasına hidâyet vermiş. Hem kadın hem de kabilesi Müslüman olmuşlardır",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 396
			}
		}
	]
}