{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1567,
			"arabicnumber": "684.02",
			"text": "(Bana Alîyyü'bnü Haşrem dahi rivâyet etti. ki) ; Bize İbn Uyeyne, Zührî'den, o da Urve'den, o da Âişe'den naklen haber verdi ki, namaz İlk farz kılındığı zaman iki rek'ât olarak farz olmuş. Sonra sefer namazı olduğu gibi bırakılmış. Hazar namazı ise tamamlanmış. ki: « Urve'ye sordum: Âişe'ye ne oluyor ki seferde iken kendisi namazı tam kılıyor? dedim. Urve: Âişe, Osmân’ın te'vîl ettiği gibi te'vîlde bulünmuşdur; cevâbını verdi.» hadîsi Buhârî «namaz» ve «Hicret» bahislerinde; Ebû Dâvûd ile Nesâî dahi «namaz» bahsinde tahrîc etmişlerdir. . kelimesi, lûgatda takdir mânâsına gelir. Buradaki namazdan murâd da dört rek'âtlı farzlardır. Çünkü üç rek'âtlı olan akşam namazı; gündüzün vitri'dir. Binaenaleyh olduğu gibi bırakılmışdır. Şu hâlde hadîsden murâd: Allahü teâlâ dört rek'âtlı farz namazları ilk defa ikişer rek'ât üzerinden takdir buyurmuş, sonra hazar'da kılınanlara ikişer rek'ât daha ilâve ederek, onları dörder rek'âta çıkarmış. Bundan yalnız akşam namazını istisna etmiş; demekdir. beyânına göre, akşam namazına da bir rek'ât ziyâde edilmişdir. Yani ona göre evvel emirde akşam namazı da iki rek'ât olarak farz kılınmış; sonra bir rek'ât daha ilâve edilerek üç'e çıkarılmışdır. bir rivâyetinden anlaşıldığına göre namazlara ikişer rek'ât ilâve, hicret'den bir sene sonra yapılmışdır. Âişe'nin bu hadisi, mürseldir. Çünkü o, bu vak'aya yetişme-mişdir. Fakat böyle mikdâr bildiren yerlerde rey ve içtihada mecal olmadığı için hadîs yine merfû ve muttasıl hükmündedir. Âişe (radıyallahü anha) onu yâ bizzat Peygamber (sallallahü aleyhi ve sellem)’den yahut bir sahâbîden işitmişdir. Hadîs herhalde huccetdir. ziyâde mes'elesi ihtilaflıdır. Ebû İshâk-ı Harbî ile Yâhyâ b. Selâm'a göre hazarda; yani evinde yerinde oturanlara namazın tamamlanmasından murâd, namazın sayısıdır. Zîrâ Isrâ hâdisesinden önce, namaz, biri güneş kavuşmazdan önce, diğeri doğmazdan önce olmak üzere iki vakitden ibaretti. Hazret-i Âişe'nin, bu hadîsi mezkûr iki vakte üç vakit daha ilâve edilerek; namazların beş vakte çıkarıldığını gösterir. bâzılarına göre Âişe (radıyallahü anha) hadîsinden murâd; İsrâ gecesi beş vakit namaz farz kılınırken, evvelâ ikişer rekât takdir bu-yurulduğunu, sonra hazarda (yani evinde yerinde) olanlar için ikişer rek'ât ilâve edildiğini anlatmakdır. Bu takdirde yapılan ziyâde namaz vakitlerine değil, namazın rek'âtlarına âiddir. takımları: «Namaz, iki rek'ât olarak farz kılınmışdır. Yani yolcu dilerse namazını iki rek'ât kılabilir; isterse dört kılmaya da hakkı vardır» şeklinde tefsirde bulunmuşlardır. tefsiri de şu'dur: İki rek'ât kılmak isteyenler için, namaz ikişer rek'ât farz olmuşdur. Sonra evinde yerinde olanlara mahsus olmak üzere iki rek'ât daha ilâve edilmişdir. Sefer namazı ise iki rek'ât kılmak dahi caiz olmak üzere bırakılmışdır. Hazret-i Âişe'nin bu hadîsi ile istidlal ederek: «Seferde dört rek'âtlı namazları ikişer kılmak ruhsat değil; azimettir. Binaenaleyh yolcunun dört rek'âtlı namazlarını tam kılması isâet olur.» demişlerdir. ulemâsı bundan mâda Taberânî'nin «Mu'-cem» inde rivâyet ettiği bir hadîsle ve Nesâî ile İbn Mâce'nin rivâyet ettikleri Ömer (radıyallahü anh) hadîsi ile de istidlal ederler. Hazret-i Ömer hadîsinde şöyle denilmektedir: namazı ilci rek'ât; kuşluk namazı iki rek'âf; bayram namazı iki rek'ât; cum'a namazı dahi iki rek'âfdır. Bunlar Peygamberiniz Muhammed Resûlüllah (sallallahü aleyhi ve sellem)’in dilinden hiç noksansız; tamam olarak böyledir.» Şafiî, İmâm Mâlik ve İmâm Ahmed b. Hanbel'e göre, yolcunun dört rek'âtlı namazları, ikişer rek'ât kılması, bir ruhsattır. Binaenaleyh onları isterse dört isterse iki rek'ât kılar. Yalnız iki rek'ât olarak kılması efdaldır. Şâfiîlerden, bir rivâyete göre, dört re'ât kılmak efdal; diğer bir rivâyete göre her ikisi müsavidir. Sahîh ve meşhur olan kavil iki rek'ât kılmanın efdal olmasıdır. delilleri az sonra göreceğimiz Hazret-i Ömer hadîsi ile Dârakutnî'nin tahrîc ettiği Hazret-i Âişe hadîsidir. Ömer hadîsinde şöyle deniliyor: «Ömer b. Hattâ b'a dedim ki: Halk'ın bu gün namazı kısaltmalarına şaşarım. Allah' Teâlâ (Kâfirlerin, sizi fitneye düçâr edeceğinden korkarsanız...) buyurarak, namazın ancak fitne zamanında lasaltılabileceğini; beyân etmişdir. Şimdi böyle bir korkulu gün yokdur? Senin şaştığın şey'e, ben de şaştım da Peygamber (sallallahü aleyhi ve sellem)’e söyledim. Resûlüllah (sallallahü aleyhi ve sellem): Allah'ın, size tesadduk eylediği bir sadakadır. Binaenaleyh siz, onun sadakasını kab'ûl edin!» buyurdu; dedi. hadîsinde dahi: Resûlüllah' (sallallahü aleyhi ve sellem) namazı bazen kısa kılar; bazen tamamlar; kimi gün oruç tutar; kimi gün de tutmazdı.» denilmektedir. Bu hadîsin isnadı için Dârakutnî: «Sahîhdir.» demişdir. Ayni hadîsi Beyhakî: Tâlhatü'bnü Amr İbn Salih ve Mu ğîratü'bnü Ziyâd tarîki ile Hazret-i Âişe'den rivâyet etmişdir ki, bu zevatın üçü de zayıfdırlar. ulemâsı, Şâfiîlerin bu delillerine şöyle cevap vermişlerdir:",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 400
			}
		}
	]
}