{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 159,
			"arabicnumber": "38",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe ile Ebû Küreyb rivâyet ettiler. Dediler ki: Bize İbn Nümeyr rivâyet etti. H. Kuteybetü'bnü Said ile İshâk b. İbrahim dahi hep birden Cerir'den rivâyet ettiler. H. Bize Ebû Küreyb rivâyet etti. ki): Bize Ebû Üsâme rivâyet eyledi. Bunların hepsi Hişâm b. Urve'den o da babasından, o da Süfyan b. Abdillahi's-Sekafi'den naklen rivâyet etti Süfyân Şöyle dedi: Dedim ki Ya Resûlüllah! İslâm hakkında bana öyle bir söz söyle ki, onu senden sonra hiç bir kimseye sormayayım. Ebû Üsâme hadîsinde: senden başkasına (sormayayım) şeklindedir. Resûlüllah (sallallahü aleyhi ve sellem): îman ettim de, ve dosdoğru ol!» buyurdular. hadîs hakkında Kâdî Iyâz şunları söylemiştir. hadîs Peygamber (sallallahü aleyhi ve sellem)’in Cevamiil-kelim (az sözle çok ma'na ifâde eden) sözlerindendir. Hadîs, Teâlâ Hazretlerinin Allah'dır, dedikten sonra istikamet yolunu tutanlar...\" yani Allah'ı tevhid ile ona iman ettikten sonra istikamet yolunu tutan, ve ölünceye kadar Teâlâ Hazretlerine tââtı iltizam ederek tevhidden sapmayanlar... Fussilet: 30 âyet-i kerimesine uygundur. Ashâb-ı kirâmın ekseri müfessirleri ile onlardan sonraki müfessirler zikrettiğimiz bu kavli iltizâm etmişlerdir. Hadîsin ma'nası da inşAllahü teâlâ budur. İbn Abbâs (radıyallahü anh) hemen emrolunduğun vecihle müstakim ol.\" Hûd: 112: âyet-i kerimesi hakkında şöyle dediler: Resûlüllah (sallallahü aleyhi ve sellem)’e bütün Kur'ân'da, bu âyetten daha şiddetli ve meşakkatli bir âyet daha nâzil olmamıştır. Bundan dolayıdır ki, ashâb-ı kirâm: (sana ihtiyarlık çabuk geldi.) dedikleri vakit. Peygamber (sallallahü aleyhi ve sellem): Beni hûd süresiyle arkadaşları ihtiyarlattı.» buyurmuşlardı. Ebû'l-Kâsım el-Kuşeyri, risalesinde istikameti şöyle ta'rif etmiştir: İstikâmet bir derece olup, her şeyin kemâli ve tamamı onunladır. Hayır ve hasenatın husul bulması ve nizamı onun vücuduna bağlıdır. Hâl-ü tavrında müstakim olmayan kimsenin çalışıp çabalaması boşunadır. Derler ki: istikâmet sahibi olmaya ancak büyükler takat getirebilirler. Çünkü istikâmet ma'hud harc-ı âlem şeylerin dışına çıkmak, rusûm ve âdetlerden ayrılarak doğruluğun hakikati ile Allahü teâlâ’nın divânına durmaktır. Bundan dolayıdır ki Peygamber (sallallahü aleyhi ve sellem); «İstikâmet sahibi olun ama onu layıkiyle beceremezsiniz.» buyurmuştur. Bu hadîsi Tirmizî de rivâyet etmiştir. Onda şu ziyade de vardır. Resûlallah! Benim için en ziyade korktuğun şey nedir? dedim.» Resûlüllah (sallallahü aleyhi ve sellem) dilini tutarak: buyurdular. hadîs-i şerif Kâdı îyâz (rahimehüllah)’ın dediği gibi cevâmi'u'l-kelimdendir. Çünkü Resûlüllah (sallallahü aleyhi ve sellem) 23 senede bütün tafsilatıyla anlattıklarım bunda hulâsa etmiştir. İstikâmetin iman üzerine sümme ile atfedilmesi onun derecesinin ikrar derecesinden uzak olduğuna işaret içindir. Ancak buradaki uzaklık zaman itibariyle değil rütbe farkı itibariyledir; ve istikâmetin rütbesi daha yüksektir. Zira istikâmet, taatlere ve sadâkata devamdır. buradaki uzaklığı zamana hamlederek kâfirlerin fürü-i imanla yani amellerle muhatab olmadıkları hükmünü çıkarırlar. Çünkü hadîsde evvelâ iman sonra istikâmet emredilmiştir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 66
			}
		}
	]
}