{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1648,
			"text": "(Bize Hasenü’l-Hulvânî de rivâyet etti. ki): Bize Yezîd b. Harun rivâyet etti. ki): Bize, Hammâd b. Zeyd, Eyyûb'dan, o da Amr b. Dînâr'dan, o da Atâ' b. Yesâr'dan, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen bu hadîsin mislini haber verdi. «Sonra ben Amra tesadüf ettim de, bu hadîsi bana rivâyette bulundu; Ama ref etmedi.» demiş. hadîs farz namaza ikaamet getirüdikden sonra, nafile namaza niyetlenmenin, memnu' olduğuna delildir. Bu hususta Revâtib denilen \"beş vaktin sünnetleri ile sair nafile namazlar arasında fark yoktur. Cumhûr-u ulemâ ile Şafiî'nin mezhebi budur. Hazret-i Ömer (radıyallahü anh) ikaamet getirildikten sonra sünnet kılanları dövermiş. göre, sabah namazının sünnetini kılmayan bir kimse farzın ikinci rek'âtma yetişeceğini aklı keserse ikaarnetden sonra evvelâ sünneti kılar. İmâm Mâlik'den bir rivâyete göre sabah namazının sünnetini kılmayan kimse farzın ilk rek'âtma yetişeceğine; diğer rivâyette ikinci rek'âtma yetişeceğine aklı keserse sünneti mescid hâricinde kılar. Başka br rivâyete göre İmâm Mâlik bu meselede Şafiî ile beraberdir. Sevrîye göre farzın ilk rek'âtma yetişeceğini aklı keserse ikaametden sonra sünneti kılar. Bazıları sünnetin mescid hâricinde bir yerde kılınacağını, ikaamet getirildikten sonra mescidin içinde kümamıyacağını söylemişlerdir. râvîlerinden Hammâd'm: «Sonra Amr'a rastladım da bu hadîsi bana rivâyette bulundu; ama ref etmedi.» sözü, hadîsin sıh-hatına ve merfû' oluşuna zarar vermez. Çünkü râvîlerin ekserisi, onu merfû' olarak rivâyet etmişlerdir. «Bu hadîsin merfû' olan rivâyeti daha sahîhdir.» demişdir. başında gördüğümüz vecihle bir hadîsin merfû' olan rivâyeti, mevkuf rivâyetine tercih edilir. Velev ki merfû' olarak rivâyet edenlerin sayısı daha az olsun. Sahîh olan mezhep budur. Hammâd hadîsinde ise merfû' olarak rivâyet edenlerin sayısı daha çoktur. Binâenaleyh merfû' rivâyetin kabul edilmesi evleviyyette kalır. (sallallahü aleyhi ve sellem)’in: ikaamet getirildimi artık farz namazdan başka namaz yoktur.» sözünden murâd: namazın kemâli yani sevabı yokdur; demekdir. Yoksa kılman namaz sahîhdir, Çünkü böyle bir namazın kazasını emret-memişdir",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}