{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1675,
			"arabicnumber": "722",
			"text": "Bana, Hârûn b. Abdîllâh ile Muhamnıed b. Râfî'de rivayet ettiler. Dedilerki: Bize, İbni Ebi Füdeyk, Dahhâk b. Osman'dan, o da İbrahim b. Abdillâh b. Huneyn'den, o da Ümmü Hânî'nin âzâdlısı Ebû Mürra'dan, o da Ebû'd-Derdâ'dan nalken rivayet etti. Ebû'd-Derdâ şöyle demiş : «Habîbim (Sallallahu Aleyhi ve Sellem), bana üç şey vasiyyet etti. Ben, bunları yaşadığım müddetçe asla terk edemem! Her aydan üç gün oruç tutmayı, kuşluk namazını ve bir de vitr namazını kılmadan uyumamamı. (vasiyet buyurdular.) » İzah Ebû Hureyre hadîsini Buhâri «Kitâbü't-Teheccüd» ile «Kitâbü's-Sevm» de; Nesâî dahî «Namaz» bahsinde muhtelif râvîIerden tahric etmişlerdir. Halil: Yakın dost; demekdir. Vakıa Nebi (Sallallahu Aleyhi ve Sellem) Efendimiz: «Ben, halîl edinecek olsam, Ebû Bekr'i kendime halîl yapardım.» buyurmuşdur. Fakat Hz. Ebû Hureyre'nin sözü, bu hadise muhalif değildir. Çünkü mümteni olan şey, Nebi (Sallallahu Aleyhi ve Sellem)'in, ashabından birini halil; ittihâz etmesidir. Ashâbın, onu halil ittihâz etmesi, mümteni' değildir. Ebû'd-Derdâ' hadîsinde, halîl yerine habîb kelimesi kullanılmışdır. Bâzıları, bu iki kelime arasında fark bulmuş; diğer bâzıları aralarında fark olmadığını söylemişlerdir. Hz. Ebû'd-Derdâ' hadîsinin tamâmiyle benzeri bir hadîsi Ebû Zerr (Radiyallahu anh) da rivayet etmişdir. Resûlullah (Sallallahu Aleyhi ve Sellem)'in bu hadîslerde zikredilen üç şeyi vasiyyet etmesindeki hikmet şudur: Her ay üç gün oruç tutmak, nefsi oruca alıştırır. Kuşluk namazını kılmak da namaza alıştırır. Uyumadan vitir namazını kılmak ise vitr namazına bu şekilde devam etmek lâzım geldiğine işarettir. Bu hadîsde vitir namazının vâcib olduğuna, vaktinin uyku ve gaflet zamanı olduğuna dahî işaret vardjr. Resûlullah (Sallallahu Aleyhi ve Sellem)'in, bu vasiyyeti Ebû Hureyre, Ebû'd-Derdâ, ve Ebû Zerr (Radiyallahû anhûma) hazerâtına tahsis buyurarak başkalarına yapmaması, bunlar fakîr oldukları içindir. Oruç ile namaz, bedenî ibâdetlerin en şereflilerindendir. Anlaşılıyor ki, Resûlullah (Sallallahu Aleyhi ve Sellem) onlara hâllerine en lâyık olan şeyi vasiyet etmişdir",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 105
			}
		}
	]
}