{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1698,
			"arabicnumber": "729",
			"text": "(Bize, Ebû Bekir b. Ebî Şeybe dahi rivâyet etti. ki): Bize, Ebû Üsâme rivâyet etti. ki): Bize, Ubeydullah, Nâfi'den, o da İbn Ömer'den naklen rivâyet etti. İbn Ömer Şöyle dedi: «Ben, Resûlüllah (sallallahü aleyhi ve sellem) ile birlikde öğleden evvel iki secde, öğleden sonra da iki secde, akşam namazından sonra iki secde, yatsıdan sonra iki secde, cum'a namazından sonra iki secde namaz kıldım. Akşam, yatsı ve cum'a namazlarını (in sünnetlerini) Peygamber (sallallahü aleyhi ve sellem) ile, onun evinde kıldım.» hadîsi Buhârî «Ebvâbü't - Tetavvu» un bir kaç yerinde ve «Cum'a» bahsinde tahrîc ettiği gibi; diğer sahîh sahipleri de rivâyet etmişlerdir. Ömer (radıyallahü anh)’in burada bahsettiği beraberlik, mücerred rek'ât sayısına âiddir. Yoksa nafile namazları da cemaatla kıldık demek istememişdir. Onları herkes yalnız kılmışdır. İbn Ömer (radıyallahü anh)’in bahsettiği ikişer secdeden murâd, ikişer rek'âtdır. Hadîsin sonunda İbn Ömer (radıyallahü anh) akşam, yatsı ve cum'a namazlarının sünnetlerini Peygamber (sallallahü aleyhi ve sellem) ile birlikde, onun evinde kıldıklarını bildiriyor. Geri kalan sünnetleri ise mescidde kılmışlardır. Ömer'in bir rivâyetinde: Ekrem (sallallahü aleyhi ve sellem): cum'a namazından sonra mescidde nafile kılmaz, oradan ayrılarak iki rek'ât nafileyi başka yerde kılardı.» denilmiş; burada ise cum'a'dan sonra mescidde iki rek'ât sünnet kıldığı bildirilmişdir. Bu suretle iki rivâyet arasında zahiren tezâd görülürse de, Aynî'nin beyânına göre «İnsirâfc» dan murâd, eve gitmeye de şâmil olan umûmî bir mânâdır. Hadîsler arasında tezâd bulunduğunu, teslim etsek bile buradaki muhtelif ,rek'âtlı sünnetler her iki şıkkın caiz olduğunu göstermek için böyle kılınmışlardır. rivâyetinde, bu hadîsin sonunda: «Bana, kız kardeşim Hafsa (radıyallahü anha)'nin anlattığına göre, Peygamber (sallallahü aleyhi ve sellem): doğdukdan sonra hafif iki rek'ât namaz kılarmış. (Hafsa şöyle dedi): «Bu, öyle bir saat idi ki, o saatte ben Peygamber (sallallahü aleyhi ve sellem)’in yanına girmezdim.» ibaresi vardır. Mü'minîn'den, Hafsa (radıyallahü anha) Hazret-i Ömer'in kızı olduğuna göre, İbn Ömer (radıyallahü anh)'ın hakîki kız kardeşidir . öyle bir saatti ki, o saatde ben, Peygamber (sallallahü aleyhi ve sellem)’in yanına girmezdim.» ifâdesi, İbn Ömer (radıyallahü anhüm)’ün. O saatte Fahr-i Kâinat (sallallahü aleyhi ve sellem) Efendimizin, yanına girmemesi, onu meşgul etmemek içindir. Çünkü Resûlüllah (sallallahü aleyhi ve sellem) o saatte başkaları ile meşgul olur, kimi kendisine müracaat edenlerin dâvalarını hall-ü fasl eder; kimi de teblîğ ve ir-şâd için îcâb eden yerlere giderdi",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 128
			}
		}
	]
}