{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 170,
			"arabicnumber": "45.01",
			"text": "(Bize Muhammed b. el-Müsennâ ile İbn Beşşar rivâyet ettiler. Dediler ki: Bize Muhammed b. Câ'fer rivâyet etti. ki): Bize Şu' be rivâyet etti. ki: Katâde'yi Enes b. Mâlik'den, o da Nebiy (sallallahü aleyhi ve sellem)'den işitmiş olarak rivâyet ederken dinledim. Peygamber (sallallahü aleyhi ve sellem): hiç biriniz kendi nefsi için dilediğini (dinî kardeşi için de — Yahut komşusu için de — dilemedikçe (tam) îman etmiş olamaz.» buyurmuşlar. hadis Sahih-i Müslim ile Abd b. Humeyd’in «Müsned»in-de ve Nesai'nin bir rivâyetinde şek ile tesbit edilmiş; ve «Din kardeşi için de yahud komşusu içinde dilemedikçe...» denilmiştir. Başka muhad-disler onu seksiz olarak; (Din kardeşi içinde) şeklinde rivâyet ederler. Buhârî Tirmizî Nesai Abd b. Humeyd, Ebû Bekir İsmâîli, İbn Mendeh ve İbrii Hibbân dahi tahric etmişlerdir. Kiramın beyanına göre hadîsin manası: Kendisi için dilediğini din kardeşi için de dilemedikçe tam îman etmiş olamaz, demektir. Yoksa asl-ı îmân' kendinde bu sıfat bulunmayanda da vardır. Maksad; din kardeşi için tâat ve mubah olan şeyleri dilemektir. Nitekim Nesai’ nin rivâyetinde bu cihet tasrih edilmiştir. Amr İbn Salâh diyor ki: için dilediğini din kardeşi için de dilemek adetâ imkânsız derecede güç sayılan şeylerdendir. Halbuki mesele öyle değildir. Çünkü hadîsin ma'nası; İslâmda sizden biriniz kendisi için dilediği şeyin (aynini değil) mislini din kardeşi için de dilemedikçe tanı îman etmiş olmaz demektir. Bunu yapmak, kendine verilen ni'metten hiç bir şey noksan kalmamak ve kendine verilene dokunmamak şartı ile din kardeşine de böyle bir nimetin verilmesini istemekle olur. Bu kalb-i selim sahibi olan bir kimse için kolaydır. Yalnız bozuk kalbli olana güç gelir. Allah bize ve bilcümle din kardeşlerimize afiyetler versin.» Salah’ın imkânsız derecede güç saydığı şey; kendisi için dilediği bir şeyin aynısını din kardeşi için de dilemektir. Bu ister hissî ister ma'nevi şeylerde olsun hemen'hemen imkânsızdır. Çünkü bir insan kendine nasib olan bir ni'metin kendinden alınarak başkasına verilmesini kolay kolay istemez. Ayni ni'metin hem kendinde kalmasına hem başkasının olmasına ise imkân yoktur. Zira bir cevher veya arazın ayni zamanda iki yerde bulunması imkânsızdır. şerifde bahsedilen îmandan murâd, iman-ı kâmil olduğuna göre şöyle bir suâl vârid olmaktadır; Şu halde kendisi için dilediği şeyleri din kardeşi için de dileyen kimse dînin sair erkânım yapmasa bile mü' min-i kâmil olmak icâbeder. Cevap: Bu söz bir mübâlegadir. Onun için burada dilek sanki imanın en büyük rüknü imiş gibi gösterilmiştir. Ya-hud bu dilek imânın diğer rükünlerini de istilzam eder. îman sahibi olmak için kendine dilediği şeylerin mislini din kardeşine dilemek lâzım geldiği gibi bunun zıddı yani kendisi için kötü gördüğü şeyleri din kardeşi için de kötü görmek imanın kemâlindendir. Ancak dilemekle kötü görmek birbirinin zıddı oldukları ve biri zikredilince derhal öteki de hatıra geleceği için hadisde iki zıddan birinin zikriy-le iktifa edilmiştir. Abdillâh el-Übbî, bu hadîsin dünya umuru hakkında vârid olduğunu, âhiret umuru hakkında ise Teâlâ hazretlerinin hususta yarışçılar müsabaka yapsın! 26)» buyurduğunu söylerken âhiret hususunda din kardeşinden daha üstün mertebe dilemenin caiz olduğuna işaret etmiştir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 77
			}
		}
	]
}