{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1714,
			"arabicnumber": "734",
			"text": "Bize, Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize, Ubeydullah b. Mûsâ, Hasan b. Sâlih'den, o da Simâk'den, naklen rivayet etti. Şöyle demiş: Bana, Câbir b. Semura haber verdiki, Nebi (Sallallahu Aleyhi ve Sellem) oturarak namaz kılmadan vefat etmemiş. İzah Bu hadîsler dahî nafile namazını oturarak kılmanın caiz olduğunu göstermektedirler. Hafsa hadîsini Tirmizî dahî rivayet etmiş ve: «Bu hadîs hasen sahîhdir.» demişdir. Zahire bakılırsa Hz. Âişe hadîsi ile Hafsa (Radiyallahu anh) hadîsi arasında münâfât var gibi görünürse de hakîkatta aralarında hiç bir münâfât ve muâraza yokdur. Çünkü Âişe (Radiyallahu anha) 'nm: «Resûlullah (Sallallahu Aleyhi ve Sellem) namazını oturarak kılıyordu.» demesinden, «Resûlullah (Sallallahu Aleyhi ve Sellem) vefatından bir seneden fazla zaman önce namazını oturarak kılıyordu.» mânâsı çıkmaz. Zâten bir yardımcı fiil olan «Kâne» devam değil, Usûl-ü fıkıh ulemâsının bir kavline göre tekrar bile iktiza etmez. Resûlullah (Sallallahu Aleyhi ve Sellem)'in vefatından bir seneden fazla önceleri nafile namazını oturarak kıldığı kabul edilse bile iki hadîs arasında yine münâfât yokdur. Zîra Hafsa (Radiyallahu anh) ancak görmediğini bildirmişdir. O, görmeden Resûl-ü Ekrem (Sallallahu Aleyhi ve Sellem) Efendimiz oturarak kılmış olabilir. Bu bâbda Ümmü Seleme (Radiyallahu anha) 'dan da rivayet vardır. Nesâî ile İbni Mâce'nin tahrîc ettikleri bu rivayette Ümmü Seleme (Radiyallahu anha) : «Nefsim, Kabza-i kudretinde olan Allah'a yemin ederim ki, Resûlullah (Sallallahu Aleyhi ve Sellem) -farz namazlar müstesna- geri kalan namazların ekserisini oturarak kılmadan dünyâdan gitmedi.» demektedir. Yine bu bâbda Enes b. Mâlik ile Abdullah b. Şihhîr (Radiyallahu anhûma) 'dan da rivayetler vardır",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 144
			}
		}
	]
}