{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1717,
			"arabicnumber": "736.01",
			"text": "(Bana, Bu hadîsi Harmele de rivâyet etti. ki): Bize, İbn Vehb haber verdi. ki): Bana, Yûnus, İbn Şihâb'dan bu isnâdla haber verdi. bu hadîsi yukarki gibi rivâyet etti. Yalnız: «Sabahın olduğunu iyice anladığı ve kendisine müezin geldiği vakit...» cümlelerini söy-lemed. İkaameti de anmadı. Hadîsin, geri kalan kısmı tamâmı ile Amr hadîsi gibidir. hadîsi Buhârî «Sabah namazının sünnetinden sonra sağ tarafa yaslanma» Bâbında tahrîc etmişdir. Onun rivâyetinde, gece namazına ve keza vitr'e dâir söz yokdur. Müslim'in buradaki rivâyetinde, Hazret-i Âişe (radıyallahü anha) Peygamber (sallallahü aleyhi ve sellem)’in geceleri onbir rek'ât namaz kıldığı, bunların bir tanesi ile vitr yaptığı, ondan sonra sabah namazı için müezzin gelinceye kadar sağ tarafına yaslandığı bildirilmektedir. diyor ki: «Hazret-i Âişe'nin (Bu namazların bir rek'âtı ile vitr yapardı.) sözü, vitr namazının en az bir rek'ât kılınacağına ve keza bir rek'ât namaz kılmanın caiz olduğuna delildir. Bizim mezhebimizle cumhûr-u ulemânın mezhebi de budur. Ebû Hanîfe: Bir rek'âtla vitr yapmak sahîh değildir. Bir rek'ât namaz asla namaz değildir; demişse de sahîh hadîsler, onun bu kavlini reddetmektedir.» Ebû Hanîfe'nin delilleri tedkîk edilirse görülür ki, Hazret-i İmâm vitir namazı bir selâmla üç rek'ât olarak kılınır; demekde haklıdır. Hâkim'in, Buhârî ile Müslim'in şartlarına' uygun olarak rivâyet ettiği bir hadîsde, Hazret-i Âişe (radıyallahü anha): (sallallahü aleyhi ve sellem) , üç rek'ât ile vitr yapar, bunların yalnız sonunda sefam verirdi.» demişdir. Nesâî'nin yine Âişe (radıyallahü anha)'dan rivâyet ettiği bir hadîsde, Hazret-i Âişe: (sallallahü aleyhi ve sellem) Vitr'in iki rek'âtında selâm vermezdi.» demektedir. İbn Abbâs (radıyallahü anhûma)'dan tahrîc ettiği bir hadîsde: «Resûlüllah (sallallahü aleyhi ve sellem) üç rek'âtla vitr yapar; birincide (Sebbih) sûresini okurdu ilâh...» den ilmi şdir. Bu hadîs «Sünen-i Erbea» ile İbn Hibbân'in -Sahîh»inde ve Hâkim'-in «MÜstedrek» inde rivâyet olunan Hazret-i Âişe hadîsine uymaktadır. Âişe (radıyallahü anha) hadisinde: (sallallahü aleyhi ve sellem) Vitr'in ilk rek'âtında (Fâtiha) ile (A'lâ) sûresini, ikincide (Kâfirûn) ve üçüncüde (İhlâs) ile (Muazzizeteyn) i; okurdu.» buyurulmuşdur. Bu hadîsin zahiri üç rek'âti birden kıldığını gösterir. Çünkü Âişe (radıyallahü anha) mezkûr namazın ilk rek'âtım vitir'den saymışdır. Eğer vitir namazı, bir selâmla, üç rek'ât birden kılınmasaydı, Hazret-i Âişe, ona vitr demez; ayrıca bir rek'ât da vitir namazı kıldı; derdi. Gerçi rivâyetlerin birinde Âişe (radıyallahü anha): (sallallahü aleyhi ve sellem)’in gece namazı on rek'ât idi; bir rek'âria da vitr yavardı.» demiş. Burada dahi gece namazını onbir rek'ât kılardığını, bunların bir tanesi ile vitr yapardığını; söylemiş hattâ ikinci rivâyetde her iki rek'âtda bir selâm verirdiğini; bir rek'âtla da vitr yapardığını tasrîh etmiş ise de, bunların hiç birinde mezkûr bir rek'âtın ayrı niyetle ayrıca kılınan bir namaz olduğuna delâlet yokdur. Binâenaleyh vitr'in ayrıca bir rek'ât olarak kılınmış olması, mücerred bir ihtimâlden öteye geçemez. Hâl böyle olunca da Hanefîlerin istidlal ettikleri sarih hadîsler muârazadan salim kalırlar. Ashâb-ı kirâm'ın ekserisi vitr'in bir selâmla üç rek'ât olarak kılındığım bildirmişlerdir, Tahâvî (238 .-321) nin rivâyet ettiği bir hadîsde râvîlerden Ebû Hâlid: «Ebû'l-Aliyeye vitr'i sordum: Resûlüllah (sallallahü aleyhi ve sellem)’in ashabı, vitr'in akşam namazı gibi olduğunu öğrettiler. Bu gecenin vitr'i; o da gündüzün vitr'idir; cevâbını verdi.» demişdir. A’zam'ın «Müsned»inde rivâyet ettiği Âişe (radıyallahü anha) hadîsinde (Muavvizeteyn) kaydı yokdur. Hadîsin lâfzı şöyledir: (sallallahü aleyhi ve sellem), üç rek'ât ile vitr yapar; ilk rek'âtda (A'lâ) sûresini, ikincide (Kâfirûn)'u, üçüncüde de (İhlâs) sûresini okurdu.» bir selâmla üç rek'ât kılındığı fukahâ-i seb'a denilen yedi fakîh'den yani Saîdü'bnü'l - Müseyyeb, Urvetü'bnü'z Zübeyr, Kâsım b. Muhammed, Ebû Bekir b. Abdirrahmân, Hâricetü'bnü Zeyd, Ubeydullah b. Abdillâh ve Süleyman b. Yesâr hazerâtından da rivâyet edilmişdir. namazından sonra sağ tarafa uzanma mes'elesine gelince: Buhârî şârihi Aynî, bu bâbda birkaç nev'î söz olduğunu bildiriyor. Şöyle ki:",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 147
			}
		}
	]
}