{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 173,
			"arabicnumber": "47.01",
			"text": "(Bana Harmeletü'bnü Yahya rivâyet etti. ki): Bize İbn Vehb anlattı. ki: Bana Yunus, İbn Şihâb'dan , o da Ebû Selemete'bni Abdirrahman'dan , o da Ebû Hüreyre'den, o da Resûlüllah (sallallahü aleyhi ve sellem)’den naklen haber verdi. Resûlü Ekrem (sallallahü aleyhi ve sellem) kim Allah'a ve son güne iman ediyorsa ya hayır söylesin yahud sussun! Her kim Allaha ve son güne iman ediyorsa komşusuna ikram etsin, her kim Allah'a ve son güne îmân ediyorsa müsafîrine ikram etsin!» buyurmuşlar. hadisi İmâm Buhari Edeb ve Rikaak bahislerinde, Müslim Muhtasaran Ahkâm bahsinde, Ebû Dâvud Et'ime'de, Tirmizî Birr Bâbında, Nesai Rikaak'da, İbn Mâce Edeb bahsinde tahriç etmişlerdir... arasında az çok değişiklik vardır. bir rivâyetde: ikram etsin.» diğerinde: eziyyet vermesin.» başka bir rivâyette: iyilik etsin.» buyurulmuştur. Bunların hepsi komşu hakkının büyüklüğüne râci'dir. Iyâz (rahimehüllah) bu hadis hakkında şunları söylemiştir: «Hadîsin ma'nası şudur: Islâmın şeriatlerini benimseyen bir kimseye komşusu ile misafirine ikram ve ihsan gerekir. Bunların her biri komşunun hakkını tanıtmak ve o hakkı korumaya teşviktir. Allahü teâlâ hazretleri dahi kitabı kerîminde ona iyilikde bulunmayı tavsiye buyurmuştur. Peygamber (sallallahü aleyhi ve sellem) (aleyhisselâm) bana komşuyu o kadar tavsiye etti durdu ki sonunda onu bana mirasçı yapacak sandım.» buyurmuştur. yani misafir ağırlamak İslâm âdabından, peygamberlerle sülehânın ahlâkındandır. Leys, ziyafeti bir geceliğine vâcib saymıştır. Delili: «Misafir gecesi her müslüman üzerine vâcib olan bir haktır.» mealindeki hadis-i şerif ile: bir kavme misafir olur da sizin için misafirin hakkını emrederlerse hemen kabul edin; bunu yapmazlarsa kendilerine lâyık olan misafir hakkını onlardan siz alın!» mealindeki Ukbe hadîsidir. fukahaya göre misafirperverlik güzel ahlâktan ma'dûd-dur. Delilleri Peygamber (sallallahü aleyhi ve sellem)'in: «Onun caizesi bir günle bir gecedir...» hadîsidir. Caize: Bahşiş, ihsan, armağan demektir. Ve ancak ihtiyarî olur. Resûlüllah (sallallahü aleyhi ve sellem)’in «İkram etsin; ihsan eylesin!» buyurması da bunu gösterir. Çünkü böyle bir ta'bir vâcib ma'nasında kullanılmaz. Üstelik burada komşuya yapılacak olan ikram ve ihsan izafe edilmiştir. Komşuya ikram ve ihsan ise vâcib değildir. Fukaha, bu babtaki hadisleri: «Sadr-ı İslâmda vârid olmuşlardır» diye te'vil etmişlerdir. Çünkü sadr-ı İslâmda yardım vâcib idi. Ziyafeti vâcib görenler onun hem şehirli hem köylüye mi yoksa yalnız köylüye mi vâcib olduğunda ihtilâf etmişlerdir. Safi ile Muhammed b. el-Hakem, her ikisine de vâcib olduğuna kaildirler. İmâm Mâlik ile Suhnûn, yalnız kır ahalisine vâcib olduğunu söylemişlerdir. Zira misafir, şehirde otellerde ve hanlarda yer, çarşılarda satın alacak yiyecek bulabilir. Filvaki' bir hadisde: «Ziyafet hayme nişînlere (çadırda yaşayanlara) vâcibdir. Şehirlilere vâcib değildir.» denilmiştir. Lâkin bu hadis ulemaya göre mevzu'dur. olarak yollara düşen kimsenin telef olacağından korkulursa onu misafir etmek farz-ı ayın olduğu gibi zimmilere misafir ağırlamak şart koşulursa onların da misafir kabul etmeleri icâbeder. Kâdi Iyaz’ın sözü burada sona erdi. hayır söylesin yahud sussun...» ifâdesinden murad şudur: Bir - kimse konuşmak isterse evvelâ düşünmeli, eğer konuşacağı şey muhakkak hayır ve ister vâcib ister mendûb olsun sevabı mûcib bir iş ise onu söylemelidir. Şayed hayırlı değilse haram da olsa, mekruh ve mübâh da olsa onu söylenıemelidir. Şu halde, harama veya mekruha vardıracağından korkulursa, mubah sözü dahi konuşmamak mendub olur. Âdetde böyle sözler pek çoktur. Hattâ ekseriyeti teşkil ederler. Halbuki Teâlâ Hazretleri: \"İnsan her ne söylerse (onu yazmak için) yanında mutlaka hazır bir murakıb vardır\" buyurmuştur. konuştuğu her şeyin ve bu arada mubah olan sözlerinin dahi yazılıp yazılmayacağı meselesi selef ve halef ulemâ arasında ihtilaflıdır. İbni Abbâs (radıyallahü anh) ile bir takım ulemaya göre yazılan sözler sevab veya ikaab icâbedenlerdir. Bu takdirde âyet-i kerîme tahsis edilmiş olur; ve: «Sevâb yahud ikaab icâbedecek her ne söylerse (onu yazmak için) yanında mutlaka hazır bir murakıb vardır.» mânâsına gelir. Haram veya mekruha vardırmasın diye şeriat bir çok mubahlardan vaz geçmeyi de emretmiştir. îkrime'ye göre kulun söylediği her söz mutlak surette yazılır. Şafiî bu hadisin ma'nâsıyla amel etmiş; ve: «Konuşmak isteyen bir kimse evvelâ düşünmeli, eğer söyleyeceklerinden kendisine bir zarar gelmeyecekse konuşmalı; zarar gelecekse yahud zarar şüphesi varsa vaz geçmelidir.» demiştir. zamanının İmâmı sayılan Mâlikî ulemasından Ebû Muhammed Abdullah b. Ebî Zeyd şunları söylemiştir: «Bütün hayır âdabı şu dört hadisden çıkar:",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 80
			}
		}
	]
}