{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1731,
			"arabicnumber": "742",
			"text": "(Bize, Ebû Küreyb rivâyet etti. ki): Bize, İbn Bişr, Mis'ar'dan, o da Sa'd'dan, o da Ebû Seleme'den, ö da Âişede'den naklen haber verdi, Şöyle dedi: vaktinin sonu, Resûlüllah (sallallahü aleyhi ve sellem)'i benim evimde yahut yanımda ancak uykuda bulurdu.» hadîsi Buhârî «Kitâbu't-Teheccûd» de; Ebû Dâvûd ile İbn Mâce «Kitâbü's Salât» da muhtelif râvîlerden tahrîc etmişlerdir. Âişe, bu sözleri Ebû Seleme'nin suâline cevap olarak soylemişdir. Hazret-i Ebû Seleme, Resûlüllah (sallallahü aleyhi ve sellem)'in sabah namazının sünnetinden sonra seher vaktinde uyuyup uyumadığını sormuşdu. vakti, lügat ulemâsına göre, tanyeri ağırmazdan önceki zamandır. Sehûr da, bundan alınmadır. Buna bakarak Bazıları: (sallallahü aleyhi ve sellem)’in uyuması, horoz öttükden sonra başlamışdır.» demişlerse de Aynî'ye göre bu uykudan murâd, sabah namazının iki rek'ât sünnetinden sonra sağ tarafına uzanmasıdır. Ebî Dâvûd» şerhinde Hazret-i Âişe'nin: «Son seher vakti Resûlüllah (sallallahü aleyhi ve sellem) benim evimde ancak uyurken bulmuşdur.» sözü «Seher vakti geldikde Resûlüllah (sallallahü aleyhi ve sellem) ancak uykuda bulunurdu.» şeklinde tefsir edilmişdir. Şu hâlde Resûlüllah (sallallahü aleyhi ve sellem)’in uykusu geceleyin olduğu gibi, ibâdeti de sehere kadar devam etmiş demekdif- hadîsde mevzû-i bahis olan uykunun Dâvûd (aleyhisselâm)’ın uykusu olduğu söylenir. Dâvûd (aleyhisselâm) gecenin evvelinde uyur, sonra Allahü teâlâ hazretlerinin: «Benden bir dileği olan var mı?» diye nida buyurduğu vakitte kalkar, ibâdet eder, sonra tekrar yatarak gece nâmazının yorgunluğunu giderirmiş. îşte seher vaktindeki uykudan murâd budur. Battal (-444) Resûlüllah (sallallahü aleyhi ve sellem)’in seher vaktinde uyumasının ramazandan gayrı uzun gecelere mahsûs olduğunu söyler",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 160
			}
		}
	]
}