{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1739,
			"arabicnumber": "746.01",
			"text": "Bize, Muhammedi'bnü'l-Müsennâ El-Anezî rivayet etti. (Dediki): Bize, Muhammedü'bnü Ebi Adîyy, Saîd'den; o da Katâde'den, o da Zürâra'dan naklen rivayet ettiki, Sa'dü'bnü Hişâm b. Âmir, Allah yolunda gazaya niyet ederek Medine'ye gelmiş ve Medine'de kendine âid bulunan bir akâr'ı satarak, bedeli ile silâh ve at satın almak, böylece ölünceye kadar Bizanslılara karşı cihâdda bulunmak istemiş. Medine'ye gelince, Medîne'lîlerden bâzı kimselere tesadüf etmiş. Onlar kendisini bu işden nehy etmişler ve ona Nebiyyullah (Sallallahu Aleyhi ve Sellem)'in hayâtında altı kişilik bir cemâatin bunu yapmak istediğini fakat Nebiyyullah (Sallallahu Aleyhi ve Sellem)'in, onları bundan nehyettiğini ve kendilerine: «Benim şahsımda sizin için güzel bir örnek yokmudur?» buyurduğunu haber vermişler. Onlar, bunu söyleyince Sa'd evvelce boşadiğı karısına ric'at etmiş ve ric'at ettiğine şâhid de getirmiş. Müteakiben ibni Abbâs'a gelerek, ona Resûlullah (Sallallahu Aleyhi ve Sellem)'in vitir namazını sormuş. İbni Abbâs: — Ben, sana Resûlullah (Sallallahu Aleyhi ve Sellem)'in vitr'ini yeryüzünde yaşıyanların en iyi bilenini göstereyim mi? demiş; Sa'd : — Kimdir o? diye sormuş. İbni Abbâs : — Âişe'dir. Hemen ona git de sor. Sonra gel de sana verdiği cevâbı bana haber ver!, demiş. (Sâd diyor ki) : — Bunun üzerine ben, Âişe'ye gitmek üzere yola çıktım ve Hakîm b. Eflâh'a vararak Âişe'ye beraber gitmek üzere, onu yanıma almak istedim. Hakîm : — Ben, ona yaklaşmam. Çünkü ben, onu şu iki fırka hakkında bir şey soylemekden nehyettim de o, buna razı olmayarak bildiğini işledi... dedi. Ben, Hakim'e yeminle ısrar ettim. Bunun üzerine (Benimle) geldi. Beraberce Âişe'ye gittik. Ve yanına girmek için izin istedik. Âişe, bize izin verdi; Yanına girdik. Hakîm'i (görünce onu} tanıyarak : — Sen, Hakîm misin? dedi. Hakîm : — Evet. cevâbını verdi. Âişe : — Yanındaki kimdir? dedi; Hakîm : — Sa'dü'bnü Hişâm'dır cevâbını verdi. Âişe : — Hangi Hişâm? dedi. Hakîm ; — Âmir'in oğlu!, dedi. Bunun üzerine Âişe, ona rahmet okudu ve : — Hayırdır inşallah!, dedi. (Râvî Katâde : Hişâm, Uhud harbinde vurulmuşdu; demişdir.) (Sa'd diyorki:) Bunun arkacığından ben : — Ey Mü'minlerin annesi! Bana, Resûlullah (Sallallahu Aleyhi ve Sellem)'in ahlâkını anlat!, dedim. Âişe: — Sen, Kur'ân okuyorsun değil mi? dedi. — Evet okuyorum!, dedim. — İşte Nebiyyullah (Sallallahu Aleyhi ve Sellem)'in ahlâkı Kur'ân idi. dedi. Bunun üzerine ben kalkmaya davrandım. Ve (bundan sonra) ölünceye kadar kimseye bir şey sormamaya niyet ettim. Sonra aklıma geldi de; — Bana, Resûlullah (Sallallahu Aleyhi ve Sellem)'in gece namazını anlat! dedim; Âişe : — Sen Müzemmil sûresini okuyorsun değilmi? dedi. — Evet okurum! cevâbını verdim; Âİşe : — İşte Allah Azze ve Celle bu sûrenin başında gece namazını farz kıldı. Bunun üzerine Nebiyyullah (Sallallahu Aleyhi ve Sellem) ile ashabı bir sene gece namazına kalktılar. Allah, bu sûrenin sonunu oniki ay semada tuttu. Nihayet bu sûrenin sonunda tahfifi indirdi de artık gece namazı farzdan sonra kılınan bir nafile oldu... dedi. Ben : — Ey Mü'minlerin annesi! Bana, Resûlullah (Sallallahu Aleyhi ve Sellem)'in vit'rinden haber ver; dedim; Âişe : — Biz, onu misvâkini ve abdest suyunu hazırlardık. Allah da, onu geceleyin ne zaman uyandırmak dilerse, uyandırırdı. Bunu müteâkib misvak tutunur; abdest alır ve dokuz rek'ât namaz kılardı. Bu rekâtların yalnız sekizincisinde oturur da, Allah'ı zikreder; ona hamd eyler ve duada bulunurdu. Sonra selâm vermeden ayağa kalkar, dokuzuncu rek'âtı da kılardı. Sonra oturarak Allah'ı zikreder, ona hamdeyler ve duada bulunurdu Sonra bize işittirecek derecede selâm verirdi. Selâm verdikten sonra oturduğu yerden iki rek'ât namaz kılardı. İşte yavrum bu namaz onbir rek'âtdır. Nebiyyullah (Sallallahu Aleyhi ve Sellem) yaşlanıp et tutunca vitri yedi rek'ât kılmaya başladı. Bu iki rek'âtı yine eskiden kıldığı gibi kıldı. Böylece bu da dokuz rek'ât oldu yavrucuğum! Nebiyyullah (Sallallahu Aleyhi ve Sellem) bir namazı kıldımı, artık ona devam etmeyi severdi. Şayet kendisine uyku veya bîr sızı galebe çalar da, gece namazını kılamazsa (onun yerine) gündüzün oniki rek'ât namaz kılardı Nebiyyullah (Sallallahu Aleyhi ve Sellem)'in bütün Kur'ânı bir gecede okuduğunu, bütün bir gece sabaha kadar namaz kıldığını ve Ramazandan başka tam bir ay oruç tuttuğunu bilmiyorum... dedi. Bunun üzerine Ben, İbni Abbâs'a giderek Âişe'nin söylediklerini ona anlattım. İbni Abbâs: — Âişe doğru söylemiş! Ona yaklaşır olsam yahut yanına girip çıkar olsam mutlaka onun yanına gider, bunları onun ağzından dinlerdim, dedi. Ben: — Senin, onun yanına girmezdiğini bilseydim, onun hadîsini sana söylemezdim., dedim",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 168
			}
		}
	]
}