{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1778,
			"text": "(Bize, bu hadîsi Muhammedü'bnü’l-Müsennâ ile İbn Beşşâr dahi rivâyet ettiler. Dediler ki: Bize, Muhammed b. Ca'fer rivâyet etti. ki): Bize, Şu'be, Ebû Ishâk'dan bu isnâdla rivâyet etti. Şu kadar var ki, Mansûr'un hadîsi daha tamam ve daha uzundur. hadîsi Buhârî «Kitâbu't-Teheccüd» ile «Kitâbu't-Tevhîd» de; Ebû Dâvûd «Namaz» ve «Sünnet» bahislerinde, Tirmizî «Namaz» bahsinde; Nesâî «Kitâbu’l-Nuût» da; İbn Mâce de «Namaz» bahsinde tahrîc etmişlerdir. «Ebû Hüreyre hadîsi sahîh bir hadîsdir.» de-mişdir. buradaki rivâyetlerinden do anlaşılacağı vechle Teâlâ Hazretlerinin alt semâya nüzulü muhtelif şekillerde ifâde olunmuşdur. Birinci rivâyetde bunun gecenin son üçte biri kaldığı zaman, ikincide ilk üçte biri geçtiği zaman, üçüncüde yansı veya üçte ikisi geçtiği zaman, dördüncüde yarısında yahut son üçte birinde, beşincide ilk üçte biri geçtiği zaman vuku' bulduğu bildirilmektedir. Biribirine muarız görünen bu rivâyetlerin arası şöyle bulunmuşdur. Muhaddisinden Tirmizî gibi bazıları birinci rivâyeti tercih etmiş; ve bu rivâyet için esah tâbirini kullanmışdır. Rivâyetlerden biri esâh olunca, diğerleri sahih olarak kalır. Binâenaleyh hepsi doğrudur. İyâz tercih ettiği rivâyet hakkında: «Sahih» tâbirini kullanmışdır. Bu tâbir, geri kalan rivâyetlerin zayıf olmasını iktizâ eder. Ancak Nevevî (631-676) hadîsin muhtelif rivâyetlerini İmâm Müslim'in sahih senedlerle tahrîc ettiğini söyliyerek Kâdı’nın sözünü reddetmişdir. Nevevî'ye göre Resûlüllah (sallallahü aleyhi ve sellem)’in bu rivâyetlerdeki vakitlerin birini bir def â, diğerini de başka bir def'â söylemiş olmasını; Ebû Hüreyre'nin bunların hepsini işiterek nakletmiş olmasını muhtemel görmektedir. bu hadîsi tahrîc ettikden sonra bu bâbda Alîyü'-bnü Ebî Tâlib, Ebû Saîd-i Hudrî, Rifâatü'l-Cühenî, Cübeyrü'bnü Mut'im, İbn Mes'ûd, Ebû'd-Derdâ' ve Osman b. Ebî'l-Âs bunlardan maada Câbir b. Abdi İlâh, Ubâdetü'bnü's- Sâmit, Ukbetü'bnü Âmir, Amru'bnü Anbese, Ebû'l-Hattâb, Ebû Bekr-i Sıddîk, Enes b. Mâlik, Ebû Mûse'l-Eş'arî, Muâz b. Cebel, Ebû Sa'lebe, Âige, ,İbn Abbâs ve diğer ashâb-ı kirâm'dan da rivâyetler bulunduğunu söylemiş, bunların hadîslerini şöyle sıralamışdır:",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}