{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1787,
			"arabicnumber": "762.03",
			"text": "(Bana, Ubeydullah b. Muâz rivâyet etti. ki): Bana, babam rivâyet etti. ki): Bize, Şu'be bu îsnâdla, bu hadîsin benzerini rivâyet etti. Yalnız râvî: «Ancak Şu'be şekketmişdir...» cümlesi ile ondan sonrasını zikretmemişdir. hadîs Kadir gecesini, o gecenin zamanını ve alâmetini bildirmektedir. mezkûr gece hakkında ihtilâf etmişlerdir. Bâbımız hadîsine göre «Kadir» gecesi, ramazanın yirmiyedinci gecesidir. Buna kaail olanlar bulunduğu gibi ramazan’ın ilk gecesi, yirmibir, yirmiüç, yirmibeş, yir-midokuzuncu gecesi olduğunu söyleyenler hattâ ramazanın son gecesidir diyenler de bulunmuşdur.' Bazıları sayılan bu tek adedlerin çiftlerinde, bir takımları bütün senede; Bazıları da bütün ramazanda olduğunu söylemişlerdir. A’zam'a göre «Kadir» gecesi ramazandadır. Yalnız bâzı sene daha evvel, bâzı sene sonra gelebilir. İmâm Ebû Yûsuf'la Muhammed'e göre «Kadir» gecesi yer değiştirmez. Lâkin ne zaman olduğu belli değildir. Bazıları «İmâm Ebû Yûsuf'la Muhammed'e göre «Kadir» gecesi ramazanın yarısından sonra gelir.» demişlerdir. Şâfiîye göre bu gece ramazanın son on günü içersindedir. Yer değiştirmez ve kıyâmete kadar devam edecekdir. Bekr-i Râzî: Kadir gecesi aylardan birine mahsûs değildir.» demiş; Hanef ilerin de buna kaail olduğunu söylemiş-dir. Filhakika Kâdıhân: «Ebû Hanîfe'nin meşhur kavline göre «Kadir» gecesi bütün senenin içinde döner. Ve bazen ramazana, bâzan da başka aylara rastlar.» demiştir. kirâmdan İbn Mes'ûd ile İbn Abbâs (radıyallahü anhûma)'nm; Tabiînden îkrime ve başkalarının kavileri de budur. kirâmdan Abdullah b. Zübeyr'e göre «Kadir gecesi ramazanın onyedinci gecesinde, Ebû Saîd-i Hudrî (radıyallahü anh)'a göre yirmibirinci gecesindedir. İmâm Şafiî'nin mezhebi de budur. gecesinin Şaban ayının yarısında olduğunu söyliyenler bulunduğu gibi Şîî'ler onun kaldırıldığını iddia etmişlerdir. Bu kavli Ha-nef îler'e nisbet eden olmuşsa da doğru değildir. nazaran Abdullah b. Hanbes şöyle dedi: «Ebû Hüreyre'ye: Halk, «Kadir» gecesinin kaldırıldığını söylüyorlar? dedim: Ebû Hüreyre: Onu söyliyen yalan yapmış; cevâbını verdi.» gecesinin Peygamber (sallallahü aleyhi ve sellem) zamanında yalnız bir sene olduğunu söyliyenler de bulunmuşdur. «Kadir» gecesinin yalnız bu ümmete mahsûs olduğunu, başka ümmetlerde böyle bir gece bulunmadığını söylemişlerdir. Mâlikî-lerden İbn Habib ile başkaları bu kavli kat'î olarak kabul etmişlerdir. Ayni kavli Cumhûr-u ulemâya nisbet edenler de vardır. «Kadir» gecesi hakkında kırkbeş kadar kavil vardır. Bununla beraber mefhûm-u aded sahîh bir delîl olmadığı için ona itibar yokdur. Binâenaleyh hadîsler arasında münâfaat bulunmamaktadır. rivâyete göre İmâm Şâfiî: «Bence Peygamber (sallallahü aleyhi ve sellem) kendisine nasıl sorulursa; Öyle cevap verirdi. «Kadir» gecesini filân gecede arayalım mı? diyenlere: Onu filân gecede arayın derdi.» demişdir. Ulemânın ekserisi onun yirmiyedinci ramazan gecesi olduğnu söylemişlerdir. «Kadir» gecesinin sabahında güneşin zıyasız olarak doğmasından murâd - Tybî'nin beyanına göre- güneş doğarken insanın gözüne gelen iplik gibi ince ziyaların görülmemesidir. Bazıları: «Buna sebeb, o gece yeryüzüne ineri sayısız meleklerin kanatları ile güneşin ziyasını örtmeleridir.» demişlerdir. Fakat: «O gecenin nuru güneşin ziyasına galebe çalmışdır.» demeyi daha münasib görenler de vardır. Kadir gecesine âid hadîslerin mühim bir kısmı oruç bahsinde gelecekdir",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 215
			}
		}
	]
}