{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 179,
			"arabicnumber": "50.01",
			"text": "Bana Amru'n-Nakıd ile Ebu Bekir b. en-Nadr ve Abd b. Humeyd rivayet ettiler. Bu lafız Abd (b. Humeyd) indir. Dedilerki: Bize Yakub b. İbrahim b. Sa'd rivayet etti. Dedi ki: Bana babam, Salih b. Keysan'dan, o da el-Haris'den, o da Ca'fer b. AbdiIIah b. el-Hakem den, o da Abdurrahman b. el-Misver'den, o da Ebu Rafi'den o da Abdullah b. Mes'ud'dan rivayete etti ki: Rasulullah (Sallallahu aleyhi ve Sellem) (1/69b) şöyle buyurdu: ''Allah benden önce hangi ümmete ne kadar nebi gönderdiyse mutlaka o nebinin ümmeti arasından havarileri ve ashabı olmuştur. Bunlar onun sünnetini uyguluyor, emrine uyuyorlardı. Sonra bunların arkasından kötü halefler gelir, yapmadıklarını söyler, emrolunmadıklarını yaparlar. Bunlara karşı eliyle cihad eden mümindir. Onlara karşı diliyle cihad eden de mümindir, onlarla kalbiyle cihad eden de mümindir. Ama bunun ötesinde hardal tanesi dahi olsa iman diye bir şey yoktur. \" Ebu Rafi' dedi ki: Ben Abdullah b. Ömer'e (bu hadisi) naklettim, o bunu kabul etmedi. Sonra İbn Mes'ud gelerek (Medine'nin) Kanat vadisinde konakladı. Abdullah b. Ömer onu hasta ziyaretine giderken benim de arkasından gelmemi istedi. Ben de onunla birlikte gittim. Oturduktan sonra İbn Mes'ud'a bu hadisi sordum, o da ben onu İbn Ömer'e tahdis ettiğim şekilde o hadisi bana nakletti. Salih dedi ki: Ebu Rafi'den de buna yakın bir hadis rivayet edilmiştir. Bunu yalnız Müslim rivayet etmiştir; Tuhfetu'l-Eşraf, 9602 AHMED D. AÇIKLAMASI AŞAĞIDA NEVEVİ ŞERHİ: \"Salih b. Keysan ... Hardal tanesi (kadar) dahi imandan eser yoktur. .. Salih dedi ki. .. Ebu Rafi' den tahdis edildi.\" Senette geçen Haris, İbn Fudayl el-Ensari el-Hatmi Ebu Abdullah el-Medeni' dir. Sahabi Abdurrahman b. Ebu Kurab'dan nakletmiştir. Yahya b. Main o sika birisidir demiştir. Ebu Rafi ise Rasulullah (Sallallahu aleyhi ve Sellem)'in azatlısıdır. En sahihi adının Eslem olduğudur. İbrahim olduğu, Hürmüz olduğu söylendiği gibi, Sabit olduğu, Yezid olduğu da söylenmiştir. Ancak adının Yezid olduğu gariptir, bunu İbnu'l-Cevzi \"Camiu'l-Mesanid\" adlı eserinde nakletmektedir. Bu isnatta bir incelik vardır ki o da biri diğerinden rivayeti nakleden tabiinden dört kişinin bir arada bulunmasıdır. Bunlar Salih, Haris, Cafer ve Abdurrahman' dır. Benzeri bir senet daha önceden de geçmişti. Ben bu hususta -yüce Allah'a hamdolsun ki- çeşitli rubaiyat hadislerini bir arada ihtiva eden bir cüz derlemiş bulunmaktayım. Bu rubaiyat arasında biri diğerinden rivayet nakleden dört sahabi yine biri diğerinden rivayet nakleden dört tabiinin rivayetleri de vardır. Müslim'in: \"Salih dedi ki: Ebu Rafi'den buna yakın rivayet tahdis edildi\" ifadesi hakkında Kadı lyaz (rahimehullah) dedi ki: Bunun anlamı şu ki, Salih b. Keysan dedi ki: Bu hadis Ebu Rafi'den, o Nebi (Sallallahu aleyhi ve Sellem)'den diye senedinde İbn Mesud zikredilmeksizin de rivayet edilmiştir. Nitekim bunu Buhari bu şekilde et-Tarih' inde muhtasar olarak Ebu Rafi'den, o Nebi (Sallallahu aleyhi ve Sellem)'den diye zikretmiş bulunmaktadır. Ebu Ali el-Ceyyanı de Ahmed b. Hanbel (rahimehullah)'den şöyle dediğini nakletmektedir: Bu hadis mahfuz değildir. Ayrıca bu sözler İbn Mesud'un sözlerine benzememektedir. İbn Mesud benimle karşılaşacağınız vakte kadar sabrediniz, der. -Bu ifadeler Kadı lyaz (rahimehullah)'ın ifadeleridir.- Şeyh Ebu Amr İbnu's-Salah da şöyle diyor: Ahmed b. Hanbel (rahimehullah) bu hadisi kabul etmemiştir. Halbuki burada adı geçen Haris'ten sika bir topluluk hadis rivayet etmiştir. Bununla birlikte onun zayıf raviler ile ilgili kitaplarda sb~konusu edildiğini de görmedik. İbn Ebu Hatim'in kitabında Yahya b. Main' den onun sika olduğunu söylediği nakledilmektedir. Diğer taraftan Haris bu hadisi tek başına (münferiden) rivayet etmiş de değildir. Aksine Salih b. Keysan'ın zikredilen sözünden de anlaşıldığı gibi ona mutabaatta bulunulmuştur. İmam Darakutni (rahimehullah) el-İlel adlı kitabında bu hadisin daha başka vecihlerden de rivayet edildiğini belirtmektedir. Bunlardan birisi Ebu Vakid el-leysl'nin, İbn Mesud'dan, o Nebi (Sallallahu aleyhi ve Sellem)'den diye naklettiği rivayettir. Onun: \"Bana kavuşuncaya kadar sabredin\" buyruğuna gelince, bu iyiliği emredip, kötülükten alıkoymaktan ötürü kan dökmeyi ya da fitneleri uyandırmayı yahut benzeri bir hali gerektirmeyen durumlarda sözkonusudur. Hadiste zikredilen batıl işleyenlere karşı elle ve dil ile cihadın teşvikine gelince, bu da ayrıca bir fitneyi körüklemeyi gerektirmeyen hallerde sözkonusudur. Bununla birlikte bu hadis geçmiş ümmetler hakkında zikredilmiştir. Bu hadisin lafızlarında bu ümmetten söz edilmemektedir. Şeyh Ebu amr b. es-Salah'ın sözleri burada sona ermektedir. Dediği gibi bu husus açıkça ortadadır. Bununla birlikte İmam Ahmed (rahimehullah)'ın bu husustaki tenkidi gerçekten şaşılacak bir husustur. Allah en iyi bilendir. (Hadiste) sözkonusu edilen \"havariler\"e gelince, onların hakkında ihtilaf edilmiştir. el-Ezheri ve başkaları havariler nebilerin en has yakınları ve seçkinleridir. Her türlü ayıptan arındırılmış halis kimselerdir. Başkaları ise: Nebilerin yardımcılarıdır derken, mücahidler oldukları, ondan sonra halife olabilmeye elverişli kimseler oldukları da söylenmiştir. Nebi (Sallallahu aleyhi ve Sellem)'in: \"Sonra onların arkasından birtakım (kötü) halefler gelir\" buyruğunda geçen ve \"sonradan gelenler\" anlamındaki \"el-huluf\" kelimesi kötü bir şekilde halef olan kimse demek olan \"half\"in çoğuludur. Lam harfi fethalı olursa hayırlı bir şekilde halef olan kişi demek olur. Daha meşhur olan anlam ve telaffuz şekli budur. Dilcilerden aralarında Ebu Zeyd'in de bulunduğu birtopluluk hatta topluluklar şöyle demektedir: Bunların her birisi için half denilebilir. Kimileri ise half kullanımını şer için caiz kabul ederken, hayır halef için ise \"half\" denilmesini caiz kabul etmen:ıişlerdir. \"Kanate indi.\" Tahkik edilmiş bazı asıl nüshalarda bu şekilde \"kanat\" şeklindedir. (2/28) Bu kelime alem (özel isim) ve müennes olduğundan dolayı munsarıf değildir. Ebu Abdullah el-Humeydi, el-Cem' beyne's-Sahihayn adlı eserinde bunu böylece zikretmiştir. çoğu asıllarda ve Müslim kitabını rivayet edenlerin çoğunluğu bu kelimeyi \"(.s~): Avlusunda\" diye rivayet etmişlerdir ki bu da evlerin ve meskenlerin arasındaki (boş) yere denilir. Ebu Avane elİsferaini de bunu böylece rivayet etmiştir. Kadı Iyaz ise es-Semerkandi'nin rivayetinde \"kanat\" şeklindedir, doğrusu budur. Kanaat ise Medine mallarından bir malın bulunduğu vadilerden bir vadidir demektedir. Cumhurun (.s~) avlusunda şekildeki rivayeti ise hatadır ve tashifdir. \"Onun hidayetine uyar\" buyruğu, onun yolunu ve gidişini izlerler, demektir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 86
			}
		}
	]
}