{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1802,
			"arabicnumber": "763.15",
			"text": "(Bize, İbn Nümeyr rivâyet etti. ki): Bize, babam rivâyet etti, ki): Bize, Abdülmelik, Atâ'dan, o da. İbn Abbâs'dan naklen rivâyet etti. İbn Abbâs, İbn Cüreyc ve Ka'b. Sa'd rivâyetlerinde olduğu gibi: «Ben, teyzem Meymûne'nin yanında geceledim...» demiş. ki İbn Abbâs (radıyallahü anhûma)'dan muhtelif yollarla rivâyet edilen bu hadîs, Peygamber (sallallahü aleyhi ve sellem)’in gece namazını ve bu namazı kaç rekat kıldığını, namaz esnasında okuduğu duaları bildirmektedir. Müslim'in Vâsi' b. Abdil'a'lâ tarîki ile rivâyet ettiği (191 numaralı) hadîs, diğer rivâyetlere muhalif düşmüşdür. Çünkü bu rivâyette hem rek'ât adedi altı olarak gösterilmiş hem de Resûlüllah (sallallahü aleyhi ve sellem)'ı ikişer rek'ât namaz kıldıkça uyuduğu bildirilmişdir. Hâlbuki diğe rivâyetlerde namaz arasında uykudan bahsedilmediği gibi; gece namazının rek'ât sayısı da onüç olarak tesbit edilmişdir. İyâz diyor ki: «Husayn b. Abdirrahmân'in, Habib b. Ebî Sabit'den rivâyeti, Dârakutnî'nin Müslim'e karşı itiraz ve istidrâk yaptığı husûsâtdan biridir. Çünkü bu rivâyet muzrarib, râvileri de muhtelifdir. Dârakutnî hadîsin Habîb’den yedi şekilde rivâyet edildiğini, Habîb'in bu hadîsde Cumhûr'a muhâlefe ettiğini söylemişdir.» Fakat Nevevî bu itirazın İmâm Müslim'e karşı vârid olamayacağını çünkü Müslim'in mezkûr rivâyeti müstakillen değil mutâbaat için zikrettiğini, mutataatda ise asıl hadîslerde caiz görülmeyen bâzı husûsâtın kabul edildiğini söylemişdir. Kâdî İyâz: «İhtimâl ki İbn Abbâs (radıyallahü anh) Resûlüllah (sallallahü aleyhi ve sellem)’in gece namazına başlarken kıldığı hafif iki rek'ât namazı saymamışdır. Onun için de uzun iki rek'ât namaz kıldığından bahsetmişdir. Bu gösteriyor ki evvelâ iki rek'ât hafif namazı kılmış, sonra iki rek'ât uzun. sonra da hadîsde zikri geçen altı rek'âtı kılmış; en sonunda da üç rek'âtla vitir yapmışdır. Bu suretle kılınan namazların mecmû'u, sair rivâyetlerde olduğu gibi yine onüç rek'ât eder.» demişdir. Aliyyı cöre İbn Abbâs (radıyallahü anh) bilmediği için Peygamber (sallallahü aleyhi ve sellem)’in sol tarafına durmuştur. Çünkü yaşı küçüktü. Kendisi hicretten üç sene evvel doğmuştu. Mâmâfîh sağ tarafına darmanın hılâf-ı edep olduğunu zannetmiş olması da mümkündir",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 230
			}
		}
	]
}