{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1810,
			"arabicnumber": "769.03",
			"text": "(Bize, Şeybân b. Ferrûh rivâyet etti. ki): Bize, Mehdî (yani İbn Meymûn) rivâyet etti. ki): Bize, Imrânü'l-Kasîr, Kays b. Sa'd'dan, o da Tâvûs'dan, o da İbn Abbâs'dan, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen bu hadîsi rivâyet etti. Lâfzı yukarkilerin lâfızlarına yakındır. hadîsi Buhârî «Kitâbü't - Teheccüd», «Kitâbü'd-Deavât» ve «Kitâbü't-Tevhîd» de; Nesâî «Kitâbü's-Salât» ve «Kitâbü'n-Nüûd» da; İbn Mâce dahi «Kitâbü's-Salât» da muhtelif râvîlerden tahrîc etmişlerdir. zahirinden anlaşıldığına göre Fahr-i Âlem (sallallahü aleyhi ve sellem) Efendimiz, bu duayı namaza kalktığı vakit okurmuş. yerin nûr'u sensin!...» cümlesinin mânâsı: «Onları nûrlandıran yani göklerle yerin nûr'unu halk eden sensin.» demekdir. Ubeyd'e göre mânâ: Yer ve gök ehli senin nûr'unla hidâyet bulur; demekdir. (319-388), Teâlâ Hazretlerinin nur ismini tefsir ederken: «Bu kelimenin mânâsı: Görmeyen, onun nûr'u ile görür; yolunu sapıtan, onun hidâyeti ile yol bulur; demekdir. Allah, semâvâtm nûr'udur: Tâbiri de bundan alınmadır. Yani göklerle yerin nûr'u da Allah'dandir; demekdir. Bu kelimenin nûr sahibi mânâsına gelmesi de muhtemeldir. Yalnız nûr Allah'ın zâtına sıfat olamaz. O, fiil sıfatıdır.» demişdir. takım ulemâya göre «Göklerle yerin nuru...» cümlesinden mu-râd: onların güneşini, ay'mı ve yıldızlarını tedbîr edendir. kayyâm ve kayyûm kelimeleri, bir mânâya kullanılırlar. Bundan murâd mahlûkaatmı daimî sûretde tedbîr eyleyen, onlara kıvamını bulduran şey'i veren yahut kendi kendine kâim olup başkasını da ikaame eden, daha doğrusu varlığı kendinden olup, başkasını vâr edendir. «Kayyâm, mubaleğalı ism-i faildir; mahlûkaatm muhtaç olduğu her şey'i hazırlayan mânâsına gelir.» demişlerdir. takımları da kayyim'in yaradan ve tutan, mânâsına geldiğini söylemişlerdir. Bunlara göre göklerle yerin kayyimi, onların yaradanı demekdir. beyânına göre Rabb’ın lûgatda üç mânâsı vardır. İtaat edilen ulu; b) Islah eden; c) Sahip ve Mâlik. «Eğer Rabb kelimesi itaat edilen büyük mânâsına gelirse, merbûbun yani o Rabb'a itaat edenin akıllılardan olması şarttır.» derler. Hattâbî: «Seyyidü'l- Cibâl denilemez.» sözü ile buna işaret etmişdir. Fakat Kâdi İyâz buna itiraz etmiş ve: «Bu şart, fâsiddir. Bilâkis her şey Allahü teâlâ'ya mutî'dir...» demişdir. ulemânın beyânına göre Allahü teâlâ’nın isimlerinden biri olan Hakk'ın mânâsı, mevcudiyeti muhakkak; demekdir. Vücûdu tehakkuk eden her şey Hak'dır. kelimesi dahi Hak'dan alınmışdır. Ve: hiç şüphesiz olacak; mânâsına gelir. Bu fadîsdeki Hak'ların hepsi bu mânâyadır. Yani: «Senin va'din, sözün, sana kavuşmak, cennet, cehennem ve kıyâmet mutlaka tehakkuk edecekdir; bunların olacağında asla şüphe yokdur» demekdir. bunu: «Senin haberin hak ve doğrudur.» mânâsına almış, bir takımları: «Hak'dan murâd, hak sahibi demekdir.» mutâleasında bulunmuşlardır. murâd, onu yerine getirendir.» diyenler de vardır. «Sana kavuşmak hakdır.» cümlesinden murâd, öldükden sonra diril-mekdir. Rabb! Sana teslim oldum...» cümlesinden murâd, emir ve nehiylerine râm oldum; ne buyurursan onu yapmağa hazırım; demekdir. sana rücû ettim»: Sana itaat ettim, senin ibâdetine yöneldim; demekdir. Bazıları bundan murâd, Her tedbirimde sana rücû ettim yani umurumu sana havale ettim; demekdir... derler. muhâsama ettim» bana verdiğin kuvvet ve delillerle, sana küfür edenlere karşı muhâsama ettim ve onları hüccetle, kılınçla mağlûp ettim; demekdir. aramızdaki muhâsamada senin hakemliğine müracaat ettim»: Yani hakkı inkâr edenlere karşı yalnız senî hakem tanıdım; Küffâr'ın yaptıkları gibi putları, kâhinleri, ateşi, şeytanı vb. yi değil, ben ancak senin hükmüne razı olurum; senden başka hiç bir kimsenin hükmüne i'timâd edemem; demekdir. (sallallahü aleyhi ve sellem) Efendimizin bütün mütesavver günahları affedilmiş olduğu hâlde bu hadîsin sonunda yine: benim gelmiş geçmiş bütün günahlarımı affet...» demesi, iki vecihden dolayıdır. Bunlardan biri tevazu göstermek ve Allahü teâlâ'ya ta'zîmde bulunmak içindir. Diğeri duâ hususunda kendisine tabî olmaları için ümmetine tâ'lİmdir. beyânına göre Resûlüllah (sallallahü aleyhi ve sellem) hakkında gufran, geçmiş ve gelecek bütün fiillerine şâmildir. ve aşikâr bütün yaptıklarımı affet.» cümlesinden murâd, gönülden geçen ve dilin söylediği şeyler olabilir. «Bu hadîs cevâmiû'l-Kelim'dendir.» demişdir. (Cevâmiû'l - Kelim: Az sözle çok mânâ ifâde eden hadîslerdir. Bir hadîsde beyân edildiği vecihle bu şekilde ifâde yalnız Peygamber (sallallahü aleyhi ve sellem) Efendimize verilen hasâistandır",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 238
			}
		}
	]
}