{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1811,
			"arabicnumber": "770",
			"text": "(Bize, Muhammedü'bnü'l-Müsenna ile Muhammed b. Hatim, Abd b. Humeyd ve Ebî Ma'ni'r-Rakaaşî rivâyet ettiler. Dediler ki: Bize, Ömer b. Yûnus rivâyet etti. ki): Bize, îkrimetü'bnü Ammâr rivâyet etti. ki): Bize Yahya b. Ebî Kesîr rivâyet etti. ki): Bana Ebû Selemete'bnü Abrîirrahmân İbn Avf rivâyet etti. ki: Ümmü’l-Mü'minîn Âişe'ye sordum: Nebiyyullah (sallallahü aleyhi ve sellem) geceleyin kalktığı vakit namazına ne ile başlardı? dedim. Âişe: Geceleyin kalktığı vakit namazına: «Allah'ım! Ey Cebrail, Mîkâîl ve İsrafil'in Rabbi! Gökler'le yerin yaradam; hâzırı ve gâîbi bilen Allah'ım! Kullarının ihtilâf ettikleri şeylerde, onların aralarında ancak sen hükmedersin. İhtilâf edilen hakka izninle beni hidâyet eyle! Çünkü dilediğini doğru yola ancak sen hidâyet eylersin!» duası ile başlardı... dedi. Kur'ân-ı Kerîm'de gerekse Resûlüllah (sallallahü aleyhi ve sellem)’in sünnetinde tekarrur etmişdir ki, Allahü teâlâ hazretleri mah-lûkaatmın şân ve mertebesine izafe edilerek anılır. Küçük ve hakir olanlara izafe edilmez. Meselâ göklerle yerin Rabbi, Arş-ı Âlâ'nın Rabbi, Me-lâike ile rûh'un Rabbi, maşrikle mağrib'in Rabbi, insanların Rabbi, insanların Mâlik'i, insanların ilâhı, âlemlerin Rabbi, Peygamberlerin Rabbi, göklerle yerin hâliki, göklerle yerin fâtırı ilâh... denilir. Bütün bunlar Allah Zülcelâl'i azamet, kudret ve mülk delilleri ile tevsîf demekdir. Onun için küçük ve hakîr olan şeylerde kullanılmamışdır. Meselâ: Haşerâtın Rabbi, maymun ve hınzır'ların hâlik'i denilmez. Bunlar şâir mahlûkatın umûmunda dâhil olmak üzere ifâde edilirler. Meselâ bütün mahlûkatın Rabbi, Her şey'in hâlik'ı denilir. Resûlüllah (sallallahü aleyhi ve sellem)'in duasında: (Cebrail, Mîkâîl ve İsrafil'in Rabbi! Göklerle yerin yaradanı olan Allah'ım.) diyerek bütün mahlûkaat arasından yalnız bunları zikretmesinin vechi budur",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 239
			}
		}
	]
}