{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1812,
			"arabicnumber": "771.01",
			"text": "Bize, Muhammed b. Ebî Bekr El-Mukaddemi rivayet etti. (Dediki): Bize, Yûsufu'l-Mâcişûn rivayet etti. (Dediki): Bana, babam, Abdurrahmân El-A'rac'dan o da Ubeydullah b. Ebî Râfi'den, o da Alî b. Ebî Tâlib'den, o da Resûlullah {Sallallahu Aleyhi ve Sellem)'den naklen rivayet ettiki, namaza kalktığı vakit: «Yüzümü hak dîne meylederek, göklerle yeri yaradana çevirdim. Ben müşriklerden değilim. Şüphesiz ki benim namazım, ibâdetlerim, hayâtım ve memâtım âlemlerin rabbi olan Allah'a âiddir. Onun hiç bir şeriki yoktur. Ben, bununla emrolundum; ve ben müslümanlardanım. Allah'ım melik ancak sensin! senden başka hiç bir ilâh yokdur. Sen, benim Rabbimsin. Ben de senin kulun!... Nefsime zulmettim. Günâhımı da îtirâf eyledim. Binâenaleyh bütün günahlarımı bana bağışla! Çünkü günahları senden başka affedecek yokdur. Beni ahlâkın en güzeline hidâyet buyur! Onun en güzeline senden başka hidâyet eyleyecek yokdur. Kötü ahlâkı benden def eyle! Onu senden başka benden def edecek yokdur. Senin emrine tekrar tekrar icabet eder; dînine tekrar tekrar tâbi' olurum! Bütün hayırlar senin yed-i kudretindedir. Şerr sana âid değildir. Varlığım seninledir; sonu da sana müntehidir. Mübareksin, yücesin senden mağfiret diler; sana tevbe eylerim!» duasını okur, rüku'a vardığında: «Allah'ım ancak sana rüku ettim; sana îmân eyledim; ve ancak sana teslim oldum. Kulağım, gözüm, iliğim, kemiğim ve sinirim hep sana itaat etmektedir.» der, başını rükû'dan kaldırdırınca : «Allah'ım! Ey Rabbimiz! Gökler dolusu, yer dolusu, göklerle yer arası dolusun, onlardan başka dilediğin her şey dolusu hamd ancak sana mahsûsdur.» duasını okur. Secde ettiği zaman: «Allahım ancak sana secde ettim ve yalnız sana îmân eyledim; sana teslim oldum. Yüzüm, kendisini yaratıp şekillendiren, gözünü ve kulağını yaradan Allahına secde etti. Halikların en güzeli olan Allah pek yücedir.» dermiş. Sonra teşehhüdle selâm arasında en son sözü şu olurmuş: «Allahım! Evvel ve âhir, gîzli ve aşikâr işlediğim bütün günahları ve yaptığım bütün israflarımı ve senin benden daha iyi bildiğin kusurlarımı bana bağışla! İlerleten ancak sen! gerileten de ancak sensin! Senden başka hiç bir ilâh yokdur!»",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 240
			}
		}
	]
}