{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1812,
			"arabicnumber": "771.01",
			"text": "(Bize, Muhammed b. Ebî Bekr El-Mukaddemi rivâyet etti. ki): Bize, Yûsufu'l-Mâcişûn rivâyet etti. ki): Bana, babam, Abdurrahmân El-A'rac'dan o da Ubeydullah b. Ebî Râfi'den, o da Alîyü'bnü Ebî Tâlib'den, o da Resûlüllah (sallallahü aleyhi ve sellem)’den naklen rivâyet etti ki, namaza kalktığı vakit: hak dîne meylederek, göklerle yeri yaradana çevirdim. Ben müşriklerden değilim. Şüphesiz ki benim namazım, ibâdetlerim, hayâtım ve memâtım âlemlerin rabbi olan Allaha âiddir. Onun hiç bir şeriki yoktur. Ben, bununla emrolundum; ve ben müslümanlardanım. Allah'ım melik ancak sensin! senden başka hiç bir ilâh yokdur. Sen, benim Rabbimsin. Ben de senin kulun!... Nefsime zulmettim. Günâhımı da îtirâf eyledim. Binâenaleyh bütün günahlarımı bana bağışla! Çünkü günahları senden başka affedecek yokdur. Beni ahlâkın en güzeline hidâyet buyur! Onun en güzeline senden başka hidâyet eyleyecek yokdur. Kötü ahlâkı benden def eyle! Onu senden başka benden def edecek yokdur. Senin emrine tekrar tekrar icabet eder; dînine tekrar tekrar tâbi' olurum! hayırlar senin yed-i kudretindedir. Şerr sana âid değildir. Varlığım seninledir; sonu da sana müntehidir. Mübareksin, yücesin senden mağfiret diler; sana tevbe eylerim!» duasını okur, rüku'a vardığında: ancak sana rükû’ ettim; sana îmân eyledim; ve ancak sana teslim oldum. Kulağım, gözüm, iliğim, kemiğim ve sinirim hep sana itaat etmektedir.» der, başını rükû'dan kaldırdıkda: Ey Rabbimiz! Gökler dolusu, yer dolusu, göklerle yer arası dolusun, onlardan maâdâ dilediğin her şey dolusu hamd ancak sana mah-sûsdur.» duasını okur. Secde ettiği zaman: ancak sana secde ettim ve yalnız sana îmân eyledim; sana teslim oldum. Yüzüm, kendisini yaratıp şekillendiren, gözünü ve kulağını yaradan Allahına secde etti. Halikların en güzeli olan Allah pek yücedir.» dermiş. Sonra teşehhüdle selâm arasında en son sözü şu olurmuş: Evvel ve âhir, gîzli ve aşikâr işlediğim bütün günahları ve yaptığım bütün israflarımı ve senin benden daha iyi bildiğin kusurlarımı bana bağışla! İlerleten ancak sen! gerileten de ancak sensin! Senden başka hiç bir ilâh yokdur!»",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 240
			}
		}
	]
}