{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1834,
			"arabicnumber": "785.02",
			"text": "(Bize, Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb rivâyet ettiler. Dediler ki: Bize, Ebû Üsâme, Hişâm b. Urve'den rivâyet etti. H. Züheyr b. Harb dahi rivâyet etti. Lâfız onundur. ki): Bize, Yahya b. Saîd, Hişâm'dan naklen rivâyet etti. ki: Bana, babam, Âişe'den naklen haber verdi. Âişe şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) yanıma girdi. Benim yanımda bir kadın vardı. Resûlüllah (sallallahü aleyhi ve sellem): kadın kimdir?» diye sordu, Ben: Uyumayan (daimî sûretde) namaz kılan bir kadın! dedim. taakat getirebileceğiniz işleri yapın! Vallahi siz usanmadıkça Allah usanma (muamelesi yapmaz).» buyurdular. ki: «Resûlüllah (sallallahü aleyhi ve sellem)'in en sevdiği ibâdet sahibinin devam üzere yaptığı ibâdet idi.» Üsâme hadîsinde, o kadının Benî Esed kabilesinden olduğu zikredilmişdir. hadîsi Buhârî «Kitabü'l-iman» ile «Kitabü's-Salât» da; İmâm Mâlik «El-Muvatta» da; Nesâî dahi «Kitâbü’l-iman» ile «Kitabü's-Salât» da tahrîc etmişlerdir. bâzısında Hazret-i Âişe'nin yanında bir kadın bulunduğu. diğerlerinde ise Havla’ isminde bir kadın olduğu zikredilmişdir. Binâenaleyh vak'anın bir olması da, müteaddid olması da ihtimâl dâhilindedir. Zahire bakılırsa kıssa yalnız Havla' vak'asından ibâretdir. Rivâyete nazaran Hazret-i Havla’ muhacirlerden olup pek dindar ve sâliha bir kadınmış. dîn'den murâd: tâatdır. hadîsde muhâtab kadınlar olduğu hâlde, kendilerine erkeklere mahsûs olan cemi' sığası ile: tâakat getirebileceğiniz işlere bakın!» buyurulmuşdur. Bunun sebebi hükmün bütün ümmete teşmil edilmesi istenmesidir. Onun için de tağlîb tarîki ile müzekker sîgası kullanümışdır. ve bıkmak gibi kelimelerin hakîkatlârı Allahü teâlâ'ya nis-betle muhaldir. Binâenaleyh bu gibi kelimelerin te'vîl edildiklerini az yukarıda görmüşdük. Böyle kelimelerin bu gibi yerlerde zikredilmeleri muşâkele ve îzdivâc tarîki iledir. Yani lâfızlar biribirine uysa da, mânâları başka başkadır",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 262
			}
		}
	]
}