{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1840,
			"arabicnumber": "789.02",
			"text": "Bize, Züheyr b. Harb ile Muhammedü'bnü’l-Müsennâ ve Ubeydullah b. Saîd rivâyet ettiler. Dediler ki: Bize, Yahya (yani El-Kat-tân) rivâyet etti. H. Ebû Bekr b. Ebî Şeybe dahi rivâyet etti. ki): Bize, Ebû Hâlid-i Ahmar rivâyet etti. H. İbn Nümeyr de rivâyet etti. ki): Bize, baham rivâyet etti. Bunların hepsi Ubeydullah'dan rivâyet etmişlerdir. H. İbn Ebî Ömer dahi rivâyet etti. ki): Bize, Abdürrazzâk rivâyet etti. ki): Bize, Ma'mer, Eyyûb'dan naklen haber verdi. H, Kuteybetü'bnü Saîd de rivâyet etti. ki): Bize, Ya'kûb (yânî İbn Abdirrahmân) rivâyet eyledi. H. Muhammed b. İshâk El - Müseyyebî de rivâyet etti. ki): Bize, Enes (yani İbn Iyâz) rivâyet etti. Bunların hepsi Mûsâ b. Ukbe'den ve yine bunların hepsi Nâfi'den, o da İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)’den Mâlik'in hadîsi mânâsında rivâyette bulunmuşlardır. Mûsâ b. Ukbe hadîsinde: Kur'ân kalkar da, gece ve gündüz okursa Kur'ân'ı ezberinde tutar. Üzerine olmazsa, onu unutur.» ziyâdesi vardır. hadîsi Buhârî «Kitâbu Fedâili'l-Kur'ân» da; Nesâî dahi «Kitâbü'l-Fedâil» ile «Kitâbu's-Salât» da tahrîc etmişlerdir. Ikaal ile bağlı demekdir. Ikaal, devenin dizini bağladıkları ipdir. şerîfde Kur'ân'ı okumak ve tilâvetine devam etmek, kaçacağından korkulan deveyi bağlamaya benzetilmişdir. Deve nezâret altında bulunduruldukça, nasıl ipini çözüp kaçamazsa; Kur'ân da devamlı okunursa öylece hatırlardan kaçamaz; ezberde kalır. İshak b. Rahaveyh: «Kur'ân okumadan bir kimsenin üzerinden kırk gün geçmesi mekruhtur.» demiştir. için hayvanlar arasından devenin tahsis buyurulması, ev hayvanları içinde en ziyâde kaçmaya teşebbüs eden ve kaçtıkdan sonra da on derece güçlükle tutulan hayvan, o olduğu içindir. şerif Kur'ân'ı ezberlemeye ve okumaya teşviki; unutmakdan tahzîri tezammun etmektedir. Kur'ân'dan murâd: hafızlar ve onu çok okuyanlardır",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 268
			}
		}
	]
}