{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1861,
			"arabicnumber": "797.02",
			"text": "(Bize Heddâb b. Hâlid rivâyet etti. ki): Bize Hemmâm rivâyet etti. H. Muhammedü'bnü’l-Müsennâ da rivâyet etti. ki): Bize Yahya b. Saîd Şu'be'den naklen rivâyet etti. Bu râvîlerin ikisi de Katâde'den, bu isnâdla, bu hadîsin mislini rivâyet etmişlerdir. Şu kadar var ki Henı-ı mâm'in rivâyetinde «münafık» yerine «câcir» kaydı vardır. hadisi ,Buhârî «Kitâbu Fedâilü'l-Kur'ân» ın bir kaç yerinde, «Kitâbü'l-Et'ıme» ve «Kitâbu't-Tevhîd» de: Ebû Dâvûd ile «Fedâilü'l-Kur'ân» da tahrîc ettikleri gibi İbn Mâce dahi rivâyet et-mişdir. hadîs hakkında Ayni şunları söylemektedir: «Malûmun olsun ki, bu teşbih ve temsil hakîkatta sırf mâkûl bir mânâya şâmil olan bir va-sıfdır. Bu mânâyı, ancak görülen ve hissedilen bir şeyle tasvir meydana çıkarabilir. Sonra hiç şüphe yok ki, Kelâmullah'm, kulun bâtınına ve zahirine te'sîri vardır. Bu husûsda kullar biribirlerinden farklıdırlar. Bâzılarının bu tanzîrden bol bol nasipleri vardır. Bunlar Kur'ân okuyan mü'minlerdir. Bâzılarının ise hiç nasipleri yokdur. Bunlar hakîki münafıklardır. Bir takımlarının yalnız zahirleri te'sîr altında kalır: bâtınlarına Kur'ân te'sîr etmez. Bunlar murâîlerdir. Bir kısmı da bunun aksinedir, (üâni Kur'ân bâtınına te'sîr eder: zahirine te'sîr etmez.) Bunlar da Kur'ân'ı okumayan mü'minlerdir. mânâların hissi şeylerle tasvir edilerek gösterilmesi hadîs-i şerîfde zikredildiği gibi olur. Resûlüllah (sallallahü aleyhi ve sellem)’in bu mânâları ifâde için hadîs-i şerîfde zikrettiğinden daha muvafık, münâsip, akla yakın, daha güzel ve daha cem'iyyetli tâbîr bulunamaz! Zira müşeb-behlerle, müşebbehünbihler (yani benzeyen insanlarla, benzedikleri şeyler.) buradaki taksime tamamen uymaktadırlar. Çünkü insanlar ya mü'min yahut gayr-i mü'min olurlar. Gayr-i mü'min de yâ hâlis münâfıkdır: Yahut hükmen ona ilhak edilir. Mü'minler ya Kur'ân okumaya devam ederler yahut etmezler. Buna göre sen müşebbehünbihin neticelerini kıyâs eyler! temsillerde vech-i sebeh, mahsûs olan iki şeyden yani tad-la kokudan mürekkebdir. Peygamber (sallallahü aleyhi ve sellem) misâlini yerden biten ve ağaçdan meydana gelen şeylerle vermişdir. Çünkü bunlarla insanların amelleri arasında benzerlik vardır. Ameller nefislerin meyveleridir. Resûlüllah (sallallahü aleyhi ve sellem) ağaçdan meydana gelen portakalla hurmayı mü'mine tahsis buyurmuş: yerden biten Ebû Cehil karpuzu ile fesleğeni de münafığa bırakmişdır. Bu suretle mü'minin şanının ulviyyetine ilminin yüksekliğine ve devamına: münafığın da sânının alçaklığına, amelinin hiçliğine ve faydasızlığıa tenbîh buyurmuştur. Kerîm'i okuyanlarla okumayanlar hakkında fi'l-i muzâri' sîgası kullanması, devam ve istimrar mânâsını kasdettiği İçindir. Yani portakala benzetilen mü'minler, Kur'ân-ı Kerîm'i devam üzere okuyanlar: hurmaya benzetilenler de devam üzere okumayanlardır. (Bittabi bundan, hiç okumayanlar: mânâsı çıkmaz.)... okuyan mü'nıini portakala benzetmesi, onun bütün memleketlerde yetişen en faydalı ve en iyi bir yemiş olmasındandır...» şerîf, Kur'ân-ı Kerîm'i ezberleyip hafız olmanın faziletine ve bir maksadı anlatmak için misâl getirmenin müstehab olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 289
			}
		}
	]
}