{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1877,
			"arabicnumber": "806",
			"text": "Bize Hasanü'bnü Rabî' İle Ahmed b. Cevvâs El-Hanefi rivâyet ettiler. Dediler ki: Bize Ebû'l-Ahvas, Ammâr b. Ruzeyk'den, o da Abdullah b. Îsâ'dan, o da Saîd b. Cübeyr'den, o da İbni Abbâs'dan naklen rivâyet etti. ki: Cibrîl, Peygamber (sallallahü aleyhi ve sellem)’in yanında otururken, Efendimiz üzerinden kapı sesine benzer tir ses işitti. Ve başını kaldırdı. Cibrîl bu şimdiye dek asla açılmayıp; yalnız bugün açılan bir gök kapısıdır; dedi. Müteakiben o kapıdan bir melek indi. Cibrîl: bu, yeryüzüne (ancak şimdi) inen bir melekdir. Bu güne kadar yere hiç inmemişdir; dedi. Melek selâm verdi ve Resûlüllah (sallallahü aleyhi ve sellem): Müjde!. Sana, senden önce hiç bir Peygambere verilmeyen iki nûr verildi. Fâtiha-ı Kifâp ve sûre-i Bakara'nın son âyetleri!... Bunlardan okuyacağın her harfe mukaabil mutlaka sana, o harfin tezammun ettiği sevap verilecekdir; dedi. zahirine bakılırsa Hazret-i İbn Abbâs onu Resûlüllah (sallallahü aleyhi ve sellem)’den işitmişdir. Bununla beraber o anda Peygamber (sallallahü aleyhi ve sellem):’in yanında bulunarak hâdiseye bizzat şâhid olması, meleği görüp Cebrail (aleyhisselâm)'ın sözlerini işitmesi de ihtimâlden uzak değildir. hadîsdeki «işitti, kaldırdı,» fiillerindeki zamirler, Peygamber (sallallahü aleyhi ve sellem)'e; «dedi» fiilinin zamiri ise Cebrail (aleyhisselâm)’a râci'dir. Çünkü semâdan işitilen sese hayret eden Resûlüllah (sallallahü aleyhi ve sellem) onun ne olduğunu izah eden de Cebrail (aleyhisselâm) dır. buradaki bütün zamirlerin Cebrail (aleyhisselâm)'a.; bir takımları da bil'akis Resûlüllah (sallallahü aleyhi ve sellem) ıe aid olduğunu söylemişlerdir. Doğrusu arz ettiğimizdir. Zira zamirler Cebrail'e irca' edilirse, gökyüzünden gelen sese hayret eden de; sonra onun ne olduğunu anlatan da Cebrail (aleyhisselâm) olmak iktizâ eder. Zamirler Resûlüllah (sallallahü aleyhi ve sellem)’e iıcâ' edildiği takdirde dahi, sesi işitenin, başını kaldıranın ve hayret ederek îzahda bulunanın hep kendileri olması iktizâ eder ki, bu iki şıkkın ikisi de hilâf-ı zahirdir. Zahir olan mânâya göre, sesi işitip; hayrete düşen Resûlüllah (sallallahü aleyhi ve sellem) bu sesin ne olduğunu îzâh eden de Cibrîl (aleyhisselâm) dır. okuyacağın her harfe mukaabil .» cümlesindeki «harf» den murâd, hurûf-i hicâ denilen elif-bâ harfleri ise mânâ: «her harfe karşı muhakkak on sevap verilecek» demekdir. Fakat bu takdirde mezkûr iki sûrenin bir hususiyeti kalmaz; çünkü diğer sûrelerin harfleri de böyledir. Bazıları; «harfden murâd; tarafdır. Bununla cümleden kinaye yapilmışdır. Yani: Eğer bu iki sûreden birer cümle okursan, o cümlelerin tezammun ettiği şey mutlaka sana verilir; demekdir.» şeklinde mütâlâa da bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 305
			}
		}
	]
}