{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1904,
			"arabicnumber": "820.01",
			"text": "(Bize Muhammed b. Abdillah b. Nüraeyr rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize İsmail b. Ebî Hâlid, Abdullah b. Îsâ b. Abdirrahmân b. Ebî Leylâ'dan, o da dedesinden, o da Übeyyü'bnü Kâ'b'dan naklen rivâyet etti. Übey Şöyle dedi: Mescidde İdim. Birisi içeri girip namaza durdu. Ve tanımadığım bir kıraat okudu. Sonra başka biri girdi. O da arkadaşının okuduğundan başka bir kıraat okudu. Namazı bitirdiğimiz vakit hep birden Resûlüllah (sallallahü aleyhi ve sellem)’in yanına girdik. Ben: Bu zât (namazda) benim tanımadığım bir kıraat okudu. Sonra Öteki girdi; o da arkadaşının okuduğundan başka bir kıraat okudu; dedim. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) onlara okumalarım emir buyurdu. Onlar da okudular. Peygamber (sallallahü aleyhi ve sellem) onların ikisinin de okuyuşlarım beğendi. Bunun üzerine içime Peygamber (sallallahü aleyhi ve sellem)'i Öyle bir tekzîb etmek geldi ki, böylesi câhiliyet devrinde bile aklıma esmemişdir. Resûlüllah (sallallahü aleyhi ve sellem) beni kaplayan bu hâli görünce göğsüme vurdu. Bunun üzerine benden bir ter boşandı. Sanki korkudan Allah (azze ve celle) yi görüyor gibi idim. Resûlüllah (sallallahü aleyhi ve sellem) bana: Ubeyy! Bana bir harf üzere oku diye (Cibrîl) gönderildi. Ben, ona: Ümmetime (vazifesini) hafiflet diye mürâcaatda bulundum; o da bana ikincide: Onu iki harf üzere oku! diye cevap verdi. Ben tekrar ümmetime (vazifesini) hafiflet diye müracaat ettim. Üçüncüde bana: Onu yedi harf üzere oku! Hem sana verdiğim her cevapla birlikde benden isteyeceğin bir isteğin de verilecekdir» dedi. Bunun üzerine ben: Yâ Rabb! Ümmetimi afvü mağfiret et! Yâ Rabb, Ümmetini mağfiret et! dedim, üçüncü isteğimi de bütün mahlûkaatın hattâ ibrahim (sallallahü aleyhi ve sellem)'in beni dileyecekleri güne bıraktım.» buyurdular",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 332
			}
		}
	]
}