{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1907,
			"arabicnumber": "821.02",
			"text": "(Bize bu hadîsi Ubeydullah b. Muâz da rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Şu'be bu isnâdla bu hadîsin mislini rivâyet etti. beyânına göre Übeyy (radıyallahü anh) ashâb-ı kirâmın en ziyâde vera' ve takva sahiplerinden biri idi. Böyle olmakla beraber o anda Peygamber (sallallahü aleyhi ve sellem)’in —hâşâ— yalancı olduğu hatırından geçirecek kadar vesveseye düşmesi, şeytanın tel-vîs'indendir. Übeyy'in kendi ifâdesinden anlaşılıyor ki, câhiliyyet devrinde Resûlüllah (sallallahü aleyhi ve sellem)’in hak Peygamber olduğunu kabul hususunda gaflet ve şüphe içinde bulunuyormuş. Fakat bu defa şeytan şüpheyi de geride bırakarak, Peygamber (sallallahü aleyhi ve sellem)'i kat'î sûretde yalanlamayı ona vesvese sureti ile emretmiş. İyâz: «Hatırdan geçen bu gibi şeyler, üzerinde durul-madıkça muâhazeyi mucip değildirler.» diyor. Filhakika Mâzirî'nin beyânına göre Hazret-i Übeyy'e şeytan tarafından o dakika ilkaa edilen vesvese, Peygamber (sallallahü aleyhi ve sellem)'in tenbîhi yani göğüsüne çarpması ile derhâl zail olmuşdur. Zâten Resûlüllah (sallallahü aleyhi ve sellem)'in dokunması, onun kalbi ne kötü kötü şeyler geldiğini anladığı içindir. (radıyallahü anh) bu tenbîh darbesi ile kendine gelmiş ve yaptığından dolayı son derece utanç ve pişmanlık duyarak ter dökmüşdür. bu rivâyetinde Hazret-i Cibrîl'in, Kur'ân-ı Kerîm'i evvelâ bir vecih üzere indirdiği; sonra Resûlüllah (sallallahü aleyhi ve sellem)’in ricası'üzerine iki veçhe çıkardığı; sonra tekrar ricası üzerine yedi harf üzerine okuttuğu bildiriliyor. Hâlbuki bundan sonraki rivâyetde üçüncü defada üç; dördüncüde yedi vecihle okuttuğu beyân edilmektedir. Bu suretle iki hadîs arasında zahiren bir münâfât göze çarpıyor. Ulemâ bu iki rivâyetin arasını bulmuşlar ve: «Birinci rivâyetdeki (üçüncü defa) tâbirinden; murâd, sonuncu defadır. Netekim sonraki rivâyetde onun yerine (dördüncü) tâbirini kullanmışdır. Dördüncü defadan murâd, Hazret-i Cibrîl'in son gelişidir.» demişlerdir. rivâyetden Cebrail (aleyhisselâm)’in gelişlerinin biri hazfedilmiş de olabilir. Cibrîl'in bu mes'elede —her gelişinde— Teâlâ Hazretlerinin bir istek vermeyi va'd buyurduğunu söylemesi, isteğin kat'î sûretde verileceğini beyân içindir. Şâir istekler ise kat'î sûretde müstecâb değildirler. İçlerinden kabul edilenleri bulunduğu gibi; kabul edilmeyenler.! de vardır. son hadisinde: «Ümmetin, Kur'ân'ı hangi harfle okurlarsa; matlûba isabet etmiş olurlar.» bu vurulmakta dır. Bu cümleden murâd: «Ümmetin bu yedi vecihden biri ile okumakda serbestdir. Fakat yedi vecihden öteye geçemezler. Bunu böylece bilip; kendilerinden sonra gelenlere böylece nakletmeleri gerekir.» demekdir. ki yedi harf den muradın ne olduğu ulemâ arasında pek ihtilaflı bir mes'eledir. İmâm Süyûtî (849-911) «El-itkaan» nâm eserinde bu bâbdaki kavilleri kırkbire, Keşraîri ise kırkbeşe çıkar-mışdır. Ancak mezkûr kavillerin bir çoğu zayıfdır",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 335
			}
		}
	]
}