{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1930,
			"arabicnumber": "832",
			"text": "Bize Ahmed b. Ca'fer El-Ma'kırî rivayet etti. (Dediki): Bize Nadru'bnü Muhammed rivayet etti. (Dediki): Bize İkrimetü'bnü Ammâr rivayet etti. (Dediki): Bize Şeddâd b. Abdillâh Ebû Ammâr ile Yahya b. Ebî Kesir, Ebû Umâme'den naklen rivayet ettiler. (İkrime: Şeddâd, Ebû Umâme ve Vasile ile görüşmüş. Enes'Ie de Şam'a kadar sohbet etmiş; Enes kendisini hayır ve faziletle senada bulunmuşdur; demiş.) Şeddâd, Ebû Umâme'den rivayet etmiş. Ebû Umâme demiş ki: Anıru'bnü Abesete's-Sülemî şunları söyledi: «Ben câhiliyyet devrinde iken bütün insanların dalâletde bulunduğunu ve hiç bir doğru yolda olmadıklarını biliyordum. (Çünkü) insanlar putlara taparlardı. Derken işittim ki Mekke'de bir zât (çıkmış) bir takım haberler veriyormuş. Hemen devemin üzerine atlayarak ona geldim. Bir de baktım Resûlullah (Sallallahu Aleyhi ve Sellem) gizlenmiş, kavmi onun aleyhinde cür'etkâr bir vazîyetde... Bunun üzerine kalbim yumuşadı ve Mekke'de onun yanına girerek, kendisine : — Sen nesin? dedim. «Ben, Nebi'yim.» cevâbını verdi. — Nebi ne demekdir? dedim. Resûlullah (Sallallahu Aleyhi ve Sellem) : «Beni Allah gönderdi? buyurdular. — Seni ne ile gönderdi? dedim; «Allah beni akrabaya yardım edilmesi, putların kırılması, Allah'ın bir tanınması, ona hiç bir şey'in şerîk koşulmaması (vazifesi) ile gönderdi» dedi. Ben, kendisine: — O hâlde bu husûsda sana yardım etmek üzere yanında kimler var? dedim; «Bir hür ile bir köle!» cevâbını verdi. (O gün yanında kendisine îmân edenlerden yalnız Ebû Bekir ile Bilâl vardı.) Ben : — Sâna ben de tâbi oluyorum; dedim. — «Sen şu gününde bunu yapamazsın.Benim hâlimi ve ortalığın hâlini görmüyormusun? Lâkin şimdi sen ailen nezdine dön! Ne vakit benim meydana çıktığımı duyarsan; hemen yanıma gel!» buyurdular. Ben de ailemin yanına gittim. Resûlullah (Sallallahu Aleyhi ve Sellem) Medine'ye geldi. Ben hâlâ ailemin yanında bulunuyordum. Ama o, Medine'ye geleli kendisini soruşturmağa ve haberlerini almaya başladım. Nihayet yanıma Yesriplilerden yânî Medînelilerden bir kaç kişi geldi. (Onlara) : — Medine'ye gelen o zât ne yaptı? dedim. — Halk sür'atle onun tarafına koşuyor; kavmi onu öldürmek istemiş; ama buna muvaffak olamamışlar; dediler. Bunun üzerine hemen Medîne’ye gelerek onun yanına girdim. Ve : — Yâ Resûlâllah! Beni tamyormusun? dedim. «Evet! Mekke'de benimle görüşen sen değilmisin? buyurdular. — Evet, ben'im; dedim. Ve şunu ilâve ettim: — Yâ Nebiyyallah! Bana Allah'ın sana öğrettikleri ve benim bilmediğim şeylerden haber ver! Bana, namazı haber ver!.. Resûlullah (Sallallahu Aleyhi ve Sellem): «Sabah namazını kıl! Sonra güneş doğup; yükselinceye kadar namazı kes! Çünkü güneş, şeytanın iki boynuzu arasından doğar. Küffâr da ona, o zaman secde ederler. Sonra namaz kıl! Çünkü namaz isbâtlı, şâhidlidir... Onu mızrağın gölge: dimdik duruncaya kadar kılmağa devam et! Sonra namazı kes! Çünkü o zaman cehennem kızdırılır. Gölge döndüğü zaman yine namaz kıl! Çünkü namaz, ısbatlı şâhidlidİr. Onu tâ ikindiye kadar kılmağa devam et! (ikindiyi kıldıkdan sonra namazı kes! Tâ güneş kavuşuncaya kadar (namaz kılma.) Çünkü güneş şeytanın İki boynuzu arasında batar. O zaman kâfirler güneşe secde ederler.» buyurdu. Ben : — Yâ Nebiyyallah! Gelelim abdeste; bana ondan da söz et! dedim. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) : «Sizden hiç bir kimse yokdur ki, abdest suyunu hazırlayarak mazmaza ve İstinşâk yapsın burnunu atsın da, yüzünün, ağzının ve burnunun günahları dökülmesin! Sonra Allah'ın emrettiği gibi yüzünü yıkasın da, yüzünün günahları su ile birlikde sakalının etrafından dökülmesin! Sonra ellerini, dirsekleri ile beraber yıkasın da, su ile birlikde, ellerinin günahları parmak uçlarından dökülmesin! Sonra başına meshetsin de, başının günahları su ile birlikde saçlarının kenarlarından dökülmesin! Sonra ayaklarını topukları ile beraber yıkasın da, ayaklarının günahları su ile birlikde parmak uçlarından dökülmesin! Eğer bu adam kalkar da, namaz kılar; Allah'a hamd-ü senâ'da bulunur; onu lâyık olduğu şekilde temcîd eyler ve kalbini sırf Allah için (başka şeylerden) fariğ eylerse, günahlarından annesinin doğurduğu günkü hey'etinde arınmış olur; buyurdular. Amru'bnü Abese bu hadîsi Resûlullah (Sallallahu Aleyhi ve Sellem)'in sahâbîsi Ebû Umâme'ye anlatmış: Ebû Umâme : — Yâ Amra'bnü Abese! Bu zât'a verilen bir makam hakkında söylediklerini iyi düşün! demiş. Amr şu mukabelede bulunmuş : — Yâ Ebâ Umâme! Vallahi artık yaşım İlerledi. Kemiklerim zayıfladı; ecelim yaklaştı! Ne Allah'a karşı yalan söylemeğe bir ihtiyâcım var; ne de Resûlullah'a!.. Ben, bunu Resûlullah (Sallallahu Aleyhi ve Sellem)'den yalnız bir veya iki yahut üç (yedi defaya kadar saymış.) defa işitmiş olsaydım, onu ebediyyen rivayet etmezdim. Lâkin ben onu, bundan daha çok fazla defalar Resûlullah (Sallallahu Aleyhi ve Sellem)'den işittim.»",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 358
			}
		}
	]
}