{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 195,
			"arabicnumber": "54.02",
			"text": "Bana Zuheyr b. Harb tahdis etti. Bize Cerir, A'meş'ten bu isnatla tahdis edip dedi ki: Rasulullah (Sallallahu aleyhi ve Sellem) şöyle buyurdu: \"Nefsim elinde olana yemin ederim ki iman etmeden cennete giremezsiniz\" diyerek, hadisi (bir önceki) Ebu Muaviye ve Veki\"in rivayet ettiği hadis ile aynen zikretti. Yalnız Müslim rivayet etmiştir; Tuhfetu'l-Eşraf, 12349 NEVEVİ ŞERHİ: Rastılullah (salIalIahu aleyhi ve sellem): \"İman etmedikçe cennete giremezsiniz ... Selamı yaygınlaştırınız\" buyurmaktadır. Diğer rivayette de: \"Nefsim elinde olana yemin ederim ki iman etmedikçe (2/35) cennete giremezsiniz\" buyurmaktadır. Hadis bütün asıl nüshalarda ve rivayetlerde bu şekildedir. Yine \"(...): iman etmiş olamazsınız\" buyruğunda da sonundaki nun harfi düşmüş olarak yazılmıştır. Bu da bilinen sahih bir kullanımdır. Hadisin anlamına gelince, Rasülullah (Sallallahu aleyhi ve Sellem)'in: \"Birbirinizi sevmedikçe iman etmiş olmazsınız\" buyruğu, imanınız kemale ermez ve birbirinizi sevmedikçe imandaki haliniz dosdoğru olmaz, anlamındadır. \"İman etmedikçe cennete giremeyeceksiniz\" buyruğu da, zahirinden anlaşılan mutlak manası iledir. Gerçekten de -imanı kamil olmasa dahi- mümin olarak ölen kimseler dışında cennete giren olmayacaktır. İşte hadisten zahir olan anlam budur. Şeyh Ebu Amr (rahimehullah) dedi ki: Hadisin anlamı: Birbirinizi sevmeden imanınız kemale eremez ve eğer siz böyle olmazsanız cennetlikler oraya girecekleri vakit siz girmeyeceksiniz, demektir. Onun bu söylediği anlam ihtimal içerisindedir. Allah en iyi bilendir. \"Aranızda selamlaşmayı yaygınlaştırınız\" buyruğunda selamın yaygınlaştırılması ve tanıdık tanımadık herkese, cömertçe bütün Müslümanlara selam verilmesi büyük çapta teşvik edilmektedir. Az önceki hadiste geçtiği gibi. Selam, kaynaşmanın ilk sebebi, sevgiyi kazanmanın anahtarıdır. Selamın yaygınlaştırılması Müslümanların birbirleri ile kaynaşmasına bir imkandır. Ayrıca onları diğer din sahiplerinden ayırteden önemli şiarlarını açığa vurmalarıdı~. Bununla birlikte selamlaşmak ile nefis eğitilir, alçak gönüllülük ve Müslümanların çiğnenmesi yasak olan haklarının tazimi süreklilik kazanır. Buhari (rahimehullah) Sahihinde Ammar b. Yasir (r.a.)'dan şöyle dediğini nakletmektedir: Üç hasleti kendisinde toplayan imanı toplamış olur. Kendine adaletin uygulanmasına imkan tanımak, aleme cömertçe selam vermek ve az olandan infakta bulunmak. Buhari'den başkaları ise bu sözü, Nebi (Sallallahu aleyhi ve Sellem)'e ait merfu bir hadis olarak rivayet etmişlerdir. Aleme cömertçe selam vermek ve tanıdığın tanımadığın herkese selam vermek ve selamın yaygınlaştırılması tabirleri hepsi aynı anlamdadır. Selamlaşmanın bir inceliği daha vardır ki o da ilişkileri koparmayı, dargınhğı, kini ve günahları tıraş edici özellikteki araların bozuluşunu ortadan kaldırmayı.ihtivc;ı etmesidir. Diğer taraftan kişi selamını Allah için verir, bu hususta hevasının peşinden gitmez, özelolarak kendi arkadaşlarına ve sevdiklerine selam vermekle kalmaz. Şanı yüce Allah doğruyu en iyi bilendir. (2/36)",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 102
			}
		}
	]
}