{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"7": "The Book of Prayer - Friday"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1956,
			"arabicnumber": "845.02",
			"text": "Bize İshâk b. İbrahim rivâyet etti. ki: Bize Velîd b. Müslim, Evzâî'den rivâyet etti. ki: Bana Yahya b. Ebî Kesir rivâyet etti. ki: Bana Ebû Selemete'bnü Abdirrahmân rivâyet etti. ki: Bana Ebû Hüreyre rivâyet etti. ki: Bir cuma günü Ömeru'-bnü’l-Hattâb cemaata hutbe okurken Osman b. Affân mescide giriverdi. Ömer ona ta'rîzde bulunarak: Bâzı kimselere ne oluyor ki ezan okundukdan sonraya gecikiyorlar? dedi. Bunun üzerine Osman: Yâ Emîre'l-Mü'minîn ezam işittikden sonra abdest almakdan fazla bir şey yapamadım; sonra buraya geldim! dedi. Ömer: Abdest de öyle! Siz Resûlüllah (sallallahü aleyhi ve sellem)'i: «Biriniz Cumâ'ya gelecek mi, yıkansın!» buyururken işitmedinizmi? Ömer hadîsini Buhârî «Kitâbu’l-Cumua» da; Tirmizî dahi «Kitâbü's-Salât» da tahrîc etmişlerdir. hadîsde, mescide giren zâtın ismi tasrîh edilmemişse de, sonraki rivâyetde onun Hazret-i Osman b. Affân olduğu bildirilmişdir. rivâyetinde gelen zâtın ilk muhacirlerden olduğu kaydedilmektedir. Şa'bî'nin beyânına göre ilk muhacirlerden murâd: Bey'at-ı Ridvân'da bulunan zevâtdır. göre bunlar: Her iki kıbleye (yani hem Kudüse hem de Kâbe'ye) doğru namaz kılanlardır. , «Tefsir» inde ilk muhacirlerden murâd Bedir gazileri olduğunu söylemişdir. Ömer'in: «Bu saat, hangi saatdır?» diye sorması, sitem ve tevbîh içindir. Bu sözle: «Sen neiçin bu saate kadar geciktin?» demek istemişdir. Maksadı: mescide erken gidilmesine tenbîhdir. Çünkü mescide gidilmesi tavsiye buyuruları saatler geçtikden sonra melekler defterlerini dürer; bir daha gelenleri yazmaz olurlar. Bu cihet, hadîs-i şerifle sâbitdir. Osman (radıyallahü anh) Ömer (radıyallahü anh)'ın ne demek istediğini derhâl anlamış ve geciktiği için özür düemişdir. Bir rivâyetde: pazara gittiği için geç kaldığını tasrîh etmişdir. de öyle!.,» cümlesinden murâd; «Abdestle kanâ'at etmen de senin İçin ayrı bir fazilet kaybıdır.» demekdir. Çünkü Hazret-i Ömer'in: «Bu saat, hangi saatdır?» diyerek yaptığı ta'rîz ve inkârın mânâsı: «Sana vakti geciktirmek suretiyle kaybettiğin faziletin zararı yetmiyor mu ki, buna bir de yıkanmamak ve sâde abdestle kanâat etmek suçunu ilâve ettin?» demekdir. ki Hazret-i Ömer iki kelimelik bir cümle ile iki satırlık mânâ ifâde etmişdir. cümleyi buradaki gibi atıf sureti ile rivâyet edenler olduğu gibi (vâv) in. hazfi ile rivâyet edenler de vardır. göre (vâv) la rivâyet hemze'den ivaz olur. (Vâv) haz-fedilirse kelime yâ müptedâ haber olmak üzere merfû' yahut mahzûf bir fiilin mef ûlü olmak üzere mansûb okunur. Hazret-i Ömer'in: ki Resûlüllah (sallallahü aleyhi ve sellem) cuma günü yıkanmayı emrederdi.» sözü, cuma günü yıkanmanın farz olmadığına delâlet eder. Çünkü yıkanmak farz olsaydı Hazret-i Osman’ın mescide girmesine kat'iyyen müsâde etmez; yıkanmak için onu mutlakaa geri çevirirdi",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 6
			}
		}
	]
}