{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"7": "The Book of Prayer - Friday"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1964,
			"arabicnumber": "850.01",
			"text": "Bize Kuteybetü'bü Saîd, Mâlik b. Enesden, ona da Ebû Bekir'in âzâdlısı Sümeyy'den naklen okunan; Sümeyy'in de Ebû Salih Es-Semmân'dan, onun da Ebû Hüreyre'den naklen rivâyet ettiği hadîsler cümlesinden olmak üzere şu hadîsi rivâyet etti: Resûlüllah (sallallahü aleyhi ve sellem): kimse cuma günü cünüplükden yıkanır gibi yıkanır da sonra (cuma namazına) giderse bir deve tesadduk etmiş gibi olur; ikinci saatde giderse bir sığır tesadduk etmiş gibi; üçüncü saatde giderse boynuzlu bir koç tesadduk etmiş gibi; dördüncü saatde giderse bir tavuk tesadduk etmiş gibi; beşinci saatde giderse bir yumurta tesadduk etmiş gibi (sevaba nâil) olur. İmâm minbere çıktımı artık melekler hutbeyi dinlemeye gelirler.» buyurmuşlar. Ebû Hüreyre'nin buradaki iki hadîsinden birincisini Buhârî. «Kitâbü'l-Cumua» ile «Benî İsrail» bahislerinde; Nesâî dahi «cuma» bahsinde tahrîc etmişlerdir. bu hadîs, başka bir hadîsin sonunda zikredilmektedir. Hadîsin tamâmı şöyledir: Resûlüllah (sallallahü aleyhi ve sellem): kıyâmet gününde, bizden önce kendilerine kitap verilenleri geçecek olan sonra gelenleriz. Hem bize onlardan sonra kitap verilmişdir. İşte bu gün onların, hakkında ihtilâfa düştükleri gündür. Bize ise Allah hidâyet vermişdir. Yârın Yahûdiler İçin, yarından sonraki gün de Hıristiyanlar içindir.» buyurdu. Sonra «Öyle İse her yedi günde bir gusül ederek başını ve bedenini yıkamak her müslümanın boynuna borçdur.» buyurdular. hıristiyanların, hakkında ihtilâf ettikleri gün: Kıyâmet günüdür. yahudiler içindir...» cümlesinden murâd: cumartesi günü, ondan sonraki hıristiyanların toplanmasına âid olan gün de: pazardır. Resûlüllah (sallallahü aleyhi ve sellem) bu sözleri ile dünyâda cumartesi günü Yahûdilerin; pazar günü de hıristiyanlarm toplantı günü olduğu gibi, âhirette de herkes kendi gününde hesaba çekilecek demek istemiş olsa gerekdir. hadîsi Buhârî yine «Kitâbü'l-Cumua» da; Ebû Dâvûd ile Tirmizî «Kİtâbu's-Salât» da; Nesâî «Melâike» bahsinde tahrîc etmişlerdir. bir rivâyetinde hadîsin lâfzı şöyledir: mescidlerin kapıları başında oturarak (cemaata gelen) insanları derecelerine göre yazarlar. Bu husûsda cemâatin kimisi bir deve, kimisi inek, kimisi koyun, kimisi tavuk, kimisi serçe; bâzısı da bir yumurta tesadduk etmiş gibidir.» İbn Mâce dahi rivâyet etmişdir. ilk gelenlerle onlardan sonra peyderpey gelenlerin kazanacakları sevaplar muhtelif rivâyetlerde az çok farklarla temsil büyurul-muşdur. Bütün rivâyetlerin ittifak ettiği husus, hatîb minbere çıktıkdan sonra defterlerin kapanması ve sevap yazan meleklerin hutbeyi dinlemek için câmi'e girmiş olmasıdır. Cezvî'nin «Kitâbü't - Tergîb» nâm eserinde Hazret-i İbn Abbâs'dan şu hadîs rivâyet olunmuşdur: günü geldimi meleklere homd sancakları verilerek kılınan mescidlere gönderilirler. Cebrail Aleyhisselâm da Mescid-i Harâm'a gelir. Her Meleğin yanında bir kitap vardır. Meleklerin yüzleri Bedir gecesindeki ay gibidir. Beraberlerinde gümüşden kalemler ve gümüşden kâğıtlar vardır. Gelen cemâati derecelerine göre yazarlar, İmâmdan önce câmi'e gelen sâbikînden (evvel gelenlerden) yazılır. İmâm minbere çıktık-dan sonra gelen, hutbeye yetişti, namaz kılınırken gelen cum'âya yetişti... diye yazılır. İmâm selâm verdikden sonra melekler cemâatin yüzlerini, gözden geçirirler. İçlerinden eskiden câmi'e ilk gelenlerden birinin gelmediğini görürlerse: (Yâ Rabb! Filancayı göremedik. Bu gün ne sebeple gelmediğini bilmiyoruz. Eğer ruhunu kabzettinse, ona rahmet eyle! Hasta ise, şifâ ver! Yolcu ise, kendisine iyi arkadaşlar nasibet!) derler. Beraberindeki diğer yazıcı melekler de (Âmin!) derler. hadîsin umûmunda erkek, kadın, hür ve köle olmak üzere kendilerinden ibâdet beklenilen herkes dâhildir. Bazıları «cünüplükden yıkanır gibi...» tâbirinden, hakikat mânâsı kasdedildiğini söylemişlerdir. Onlara göre nefsi teskin etmek ve gözü harama bakmakdan korumak için cima ederek yıkanmak müs-tehabdır. Bu husûsda müdde alarmı isbât için Hazret-i Evs-i Şekafî'nin rivâyet ettiği bir hadîsle de istidlal ederler. Evs hadîsini Tirmizî beğenmiş ve hakkında «Hasendir» tâbirini kullanmışdir. ulemâya göre ise hadîsdeki teşbih: hüküm için değil; keyfiyet itibârı ile yapılmışdır. hadîsdeki saatleri İmâm Mâlik «lâtîf lâhzalar» diye tefsîr etmişdir. Bâzılarına göre, zevalden sonra bir yere gitmekdir. Kâdî Hüseyin ile imâmü'l-Harameyn'in kavilleri budur. Onlar mezkûr kelimenin lûgatda bu mânâya geldiğini iddia ederler. Fakat cumhûr-u ulemâya göre revâh'dan murâd: Zevâl'den evvel, erken gitmek manasınadır. İmâm Şafiî ile Mâlikîler'den İbn Habîb dahi buna kaaildirler. Onlara göre hadîsde zikri geçen saatlerden murâd: Günün evvelidir. Revâh ise: Günün evvelinde ve âhirinde bir yere gitmek demekdir. «Arap dilinde revâh: Gitmek mânâsına gelir. Günün evveli ile âhiri hattâ gece bu hussûda müsavidir.» demişdir. Doğrusu da budur. cumhûr-u ulemâ hadîsde zikri geçen saatleri şâir günlerde olduğu gibi zaman saati mânâsına hamletmişlerdir. rivâyet ettiği bir hadîsde dahi saatler bu mânâya alınarak: «Cuma günü oniki saatdir.» buyurulmuşdur. mîkaat âlimleri ise «gündüzün saatlerini gündüzün başlangıcı mânâsına almışlardır. rivâyetde Şafiî'lerin kavli de budur. Başka bir kavle göre Şafiî'ler bu mes'elede İmâm Mâlik ile beraberdirler. Şâfiîler'den rivâyet olunan dördüncü bir kavle göre saatden murâd; Güneşin yükselmesidir. «Saatlerden murâd: Gün ile gecenin taksim edildiği yir-midört parça değildir. Maksad: Dereceleri tertibe koymak ve en Öne gelenin, diğerleri üzerine fazileti olduğunu bildirmekdir.» diyor. mes'elesine gelince: buradaki tekarrubdan murâd: Tasadduk'dur. Yani cuma namazına erken giden kimse bir deve tasadduk etmiş gibi; ondan sonra giden bir sığır tasadduk etmiş gibi... ilâh... olur; demekdir. bunu: «Cumâ'ya erken gidene, kendisine kurban meşru olan bir kimsenin deve kurban etmekden kazandığı sevap kadar sevap vardır.» diye tefsir etmişlerdir. Onlar: «Çünkü bu ümmete kurban kesmek, eski ümmetlere meşru olduğu keyfiyyetde emrolunmamışdır.» derler. takımları da: «Bu hadîsden murâd: Cumâ'ya erken gidenlerin sevap itibârı ile bîribirlerinden farklı olduklarını, cami'e ikinci olarak varanın birinciye nisbeti kıymet itibârı ile sığırın, deveye nisbeti gibidir.» demişlerdir, kasdedilmişdir. Çünkü mukaabilinde sığır zikredilmektedir. «deve» ve «sığır» demek ise de burada ondan bil'ittifâk deve kasedilmiştir. Çünkü mukabilinde sığır zikredilmiştir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 14
			}
		}
	]
}