{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"7": "The Book of Prayer - Friday"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1975,
			"arabicnumber": "853",
			"text": "(Bana Ebû't-Tâhir ile Alîyyü'bnü Haşrem rivâyet ettiler. Dediler ki: Bize İbn Vehb, Mahrametü'bnü Bükeyr'den naklen haber verdi. H. Hârûn b. Saîd El-Eyîî ile Ahmed b. Îsâ da rivâyet ettiler. Dediler ki: Bize Vehb rivâyet etti. ki): Bize Mahrame, babasından, o da Ebû Bürdete'bnü Ebû Mûse'l-Eş'arî'den naklen haber verdi. Şöyle dedi: Bana, Abdullah b. Ömer: «Babanın cuma saati hakkında Resûlüllah (sallallahü aleyhi ve sellem)’den hadîs rivâyet ettiğini işittin mi?» dedi. Ben: Evet, babamı şöyle derken işittim dedim: Resûlüllah (sallallahü aleyhi ve sellem)'i: saati, İmâmın (minber üzerinde) oturması ile namazın edâ edilmesi arasındadır.» buyururken işittim. hadîs hakkında Dârakutnî İmâm Müslim'e istid-râkde bulunmuş ve şunları söylemişdir: «Bu hadîsi Mahrame'nin babasından, onun da Ebû Bürde'den rivâyet etmesi suretiyle yaptığı müsned rivâyetden başka, müsned olarak rivâyet eden yokdur. Onu bir cemâat Ebû Bürde'den kendi kavli olmak üzere -rivâyet etmişlerdir. Bazıları, senedi Ebû Mûsâ'ya kadar götürmüş fakat hadîsi Resûlüllah (sallallahü aleyhi ve sellem)’e ref etmemişdir. Doğrusu Hadîs Ebû Bürde'nin sözüdür. Onu Yahya El-Kattân dahi Sevrî'den, o da Ebû İshâk'dan, oda Ebû Bürde’den naklen bu şekilde rivâyet etmişidr. Vâsıl-\"ı Ahdeb ile Muhalid dahi Yahyâ'ya tâbi olarak onu Ebû Bürde'nin sözü olmak üzere rivâyet etmişlerdir. Nu'man b. Abdisselâm, Sevrî'den, o da Ebû İshâk'dan naklen: Ebû Bürde'nin, babasından rivâyeti mevkûfdur. (Babasından) sözü sabit değildir; demişdir. b. Hanbel, Hammâd b. Hâlid'in Mahreme'ye: Sen babandan bir şey işittin mi? dedim. Hayır cevâbını verdi.. dediğini söyler.» diyor ki: «Dârakutnî'nin yaptığı bu istidrâk kendince ve ekseri muhaddisînce ma'rûf olan bir kaaideye binâendir. Mezkûr kaaideye göre bir hadîsin iki rivâyeti biribirîne tearuz eder; meselâ biri merfû' biri mevkuf olursa mevkuf olduğuna hükmedilir. Ancak bu kaaide zayıfdır. Sahîh olan, usûl-i fıkıh ulemâsı ile fukahânın ve Buhârî ile Müslim gibi Muhakkik hadîs âlimlerinin tarîkidir. Bu tarika göre o hadîsin merfû' olduğuna hükmedilir. Çünkü hadîsde mevsuk râvînin ziyâdesi vardır. Böyle bir ziyâde makbuldür. Bu mes'ele kitabımızın mukaddimesinde görülmüşdü. «Sünen» inde Ahmedü'bnü Seleme'nin şöyle dediği rivâyet olunuyor: «Mahrame'nin rivâyet ettiği bu hadîsi Müslim b. Haccâc ile müzâkere ettim; Müslim: Bu hadîs cuma saatini beyân hususunda en güzel ve en doğru bir hadîsdir; dedi.»",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 25
			}
		}
	]
}