{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"7": "The Book of Prayer - Friday"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1977,
			"arabicnumber": "854.02",
			"text": "(Bize Kuteybetü'bnü Saîd rivâyet etti. ki): Bize Mugîra (yani El - Nizamî) Ebû'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hüreyre'den naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem): güneş doğan en hayırlı gün cuma günüdür. Âdem o gün yaratı İdi; o gün cennete konuldu ve o gün cennetden çıkarıldı. Kıyâmet de ancak cuma günü kopacakdır.» buyurmuşlar. gününün en hayırlı gün olması: Haftanın şâir günlerine nis-betledir. beyânına göre, senenin günlerine nisbetle en hayırlı gün arafe günüdür. Bazıları cum'anm arafe gününden efdal olduğuna bu hadîsle istidlal etmişlerse de esah kavle göre arafe daha faziletlidir. Aliyyü’l-Kaarî: «Cuma günü arafeye tesadüf ederse mutlak surette günlerin en faziletlisi olur. O günde işlenen amel de en faziletli ve makbul olur, Hacc-ı ekber bundandır.» diyor. Iyâz bu hadîs hakkında şunları söylemişdir: «Zahire bakılırsa bu hadîsde zikri geçen kazıyyeler Hazret-i Âdem'in faziletini beyan için değildirler. Çünkü Âdem (aleyhisselâm)'ı cennetden çıkarmak ve kıyâmeti ncumâ günü kopması fazilet sayılamaz. Bunlar o gün vâki olacak büyük hâdisâtdır. Tâ ki kul, sâlih ameller işleyerek Allah'ın rahmetine nâü olmaya, gazabını defe hazırlansın...» Bekir İbn'l -Arabi dahi: «Bütün bu faziletler ve Hazret-i Âdem'in cennetden çıkarılması zürriyetinin ve bu büyük neslin, enbiyâ, mürselîn, sâlihîn ve evliyâ’nın vücûduna sebepdir. Hazret-i Âdem cennetden- kovulduğu için çıkarılmış değil, bâzı vazifeler görerek sonra tekrar oraya dönmek İçin çıkarılmışdır. Kıyâmetin kopması, enbiyânın, sıddîkin ile evliyanın şeref ve kerametlerini göstermek ve mükâfatlarını acele vermek İçin bir sebebdir.» demişdir. Hazret-i Âdem'in cennetten çıkarılması ihanet için değil, halifelik makamı içindir. Bu izlâl değil, ikmâldir. şerif cuma gününün fazilet ve meziyyetine delildir. «Bu hadîs Hazret-i Âdem'in cennette değil, dışarıda yaratılarak sonra cennete konulduğuna delildir.» demektedir. vî diyor ki: «Bu hadîs garîb ve güzel bir mes'eleye de delildir. Mes'ele şudur: Bir adam, karışma (sen günlerin en faziletlisinde boşsun) dese, ulemâmıza göre bu mes'elede iki vecih vardır. Esah olan veçhe göre: Kadın arafe günü'boş olur. veçhe göre: Cuma günü boş düşer. Delili de bu hadîsdir. Yalnız bu kaviller o adamın niyeti olmadığına göredir. Şayet bu sözü ile senenin en faziletli gününü niyet ederse, o zaman kadın alettâyîn arafe günü ,boş olur. Hafta günlerinin efdalini murâd etmişse, boş düşmek için cuma günü teayyün eder. adam «gün» yerine «gece» tâbirini kullanarak (sen en hayırlı gecede boşsun) derse, kadın alettâyîn Kadir gecesi boş olur. ile cumhûr'a göre Kadir gecesi Ramazan ayının son on gecesi içersindedir. Eğer bu söz Ramazandan. kalan on gecenin birincisinde söylenmişse, kadın son gecenin ilk cüz'üde boş olur. Şayet Ramazan’dan kalan on gecenin biri yahut bir gecenin ekserisi geçtikden sonra söylenmişse, gelecek senenin o gecesinin o cüz'ünde boş olur. (Leyle-i Kadir her sene başka başka gecelerde olur) deyenlere göre, bu sözle kadın o ayın son gecesinin ilk cüz'ünde boş olur.»",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 27
			}
		}
	]
}