{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"7": "The Book of Prayer - Friday"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1986,
			"arabicnumber": "850.04",
			"text": "(Bize Kuteybetü'bnü Saîd rivâyet etti. ki): Bize Yakûb (yânî İbn Abdirrahmân) Süheyl'den, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem): her kapısının üzerinde, evvel beevvel gelenleri yazan bir melek vardır. (Resûlüllah sallallahü aleyhi ve sellem) evvelâ deve kurban etmekle temsil yapmış. Sonra gelenlerin derecelerini indire İndire yumurta kadar küçültmüş). İmâm minber üzerine oturunca sahîfeler dürülör ve melekler hutbe dinlemeğe gelirler.» buyurmuşlar. hadîsde: «İmâm minbere oturduğu vakit, buyuruluyor. Başka bir hadîsde ise «İmâm minbere çıktığı vakit...» denilmişdir. Zahiren iki hadîs arasında tearuz var gibi görünüyorsa da, hakîkatda tearuz yokdur. Çünkü hadîslerin arası bulunarak «Melekler, hatîb minbere çıkarken içeri girerler; minbere oturduğu zaman sahîfelerini dürerler.» denilebilir. İmâm Halîl b. Ahmed ile diğer bir takım lügat ulemâsına göre erken gitmek, erken davranmak mânâsına gelir. Resûlüllah (sallallahü aleyhi ve sellem)’in: «Tehcirde neler olduğunu bilseler, onun için müsabaka yaparlardı.» hadîs-i şerifi bu mânâya tefsir edilmişdir. Yani hadîsden murâd: «Her namaza erken gitmekde ne derece sevab olduğunu bilseler, her kes evvelâ mescide ben varayım diye acele eder, bu husûsda âdeta müsabaka yaparlardı.» demekdir. tehcîr'in, hâcirede (yânî güneş semânın ortasına dikildiği zaman) yürümek mânâsına geldiği rivâyet olunmuşdur. Iyâz: «Burada sahîh olan, erken gitmek mânâsına gelmesidir.» diyor. zikri geçen deve, inek ve koç gibi hayvanlar kurbanlıklar cinsindendirler. Tavukla yumurta kurbanlık cinsinden değildirler. Bununla beraber onlara da «kurban» denilmesi, müşâkele kabîlindendir, Maksad tavuk ve yumurta tesadduk eden gibidir; demekdir. şerîf hatîb minbere çıktığı zaman ezan okununcaya kadar o-turmasının müstehab olduğuna delildir. Mâlik ile İmâm Şafiî'nin ve Cumhûr-u ulemânın mezhepleri budur. A'zam ile bir rivâyetde İmâm Mâlik'e göre hatîbin burada oturması müstehab değildir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 36
			}
		}
	]
}