{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"8": "The Book of Prayer - Two Eids"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2060,
			"arabicnumber": "891.02",
			"text": "(Bize, İshak b. İbrâhim rivâyet etti. ki) Bize, Ebû Amiri Akadî haber verdi, ki) Bize Füleyh, Damratü'bnu Said' den, o da Ubeydullah b. Abdillâh b. Utbe'den, o da Ebû Vâkıd-ı Leysi'den naklen rivâyet etti. Ebû Vâkıd Şöyle dedi: bana Resûlüllah (sallallahü aleyhi ve sellem) bayram namazında neyi okuduğunu sordu; ben de.- «Sûre-i Inşikaak İle Süre-i Kaaf'ı dedim.» hadîsin birinci rivâyeti zahiren muttasıl değil gibi görünüyor. Ubeydullah b. Abdillâh, Hazret-i Ömer'in Ebû Vâkıd-ı Leysî'ye suâl sorduğunu bildiriyor. Hâlbuki kendisi Hazret-i Ömer'e yetişmemişdir. Ancak, zahiren mürsel gibi görünen bu senet hakîkatda muttasıldır. Nitekim hadîsin ikinci rivâyetinde muttasıl olarak zikredilmişdir. Binâenaleyh hadis hiç şüphe götürmeyecek derecede.1 sahîh ve muttasıl olduğundan burada İmâm Müslim'e itiraz edilemez. kirâm’ın beyânına göre Hazret-i Ömer'in Ebû Vâkıd-ı Leysî'ye sorması, bu husûsda tereddüte düştüğü içindir. Yani Resûlüllah (sallallahü aleyhi ve sellem)'in bayram namazında hangi sûreleri okuduğunda şüpheye düşmüş, bu husûsdaki şüphesini gidermek için mes'eleyi Ebû Vâkıd-ı Leysî'ye sormuşdur. Maamâfih ne okuduğunu kendisi bildiği hâlde cemaata bildirmek maksadı ile sormuş olması ihtimâli de vardır. Hakîkatda Ömer (radıyallahü Anh)'ın bunu bilmemesine imkan yokdur. Çünkü bir çok defalar bayram namazını Resûlüllah (sallallahü aleyhi ve sellem)'in bilmemesine imkân yokdur. Çünkü bir çok defalar bayram namazını arkasında kılmışdır. şerif: «Bayram namazlarında înşikaak ve Kaaf sûrelerir' okumak sünnetdir.» diyenlerin delilidir. Bunları okumakdaki hikmet; Geçmiş ümmetlere âid haberleri, Peygamberleri yalanlıyanları ihlâk, cemâatin bayram namazına çıkışlarını mahşer yerine toplanmaya benzetme vesâir ahkâmı ihtiva etmeleridir, Bazıları, bayram namazlarında sûre-i A'lâ ile Ve'ş-Şemsi sûresini okumak müstahabdır. şerif, bayram namazlarında kıraatin aşikâr yapılacağına da delildir",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		}
	]
}