{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"10": "The Book of Prayer - Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2091,
			"arabicnumber": "901.03",
			"text": "(Bana Harmeletü'bnü Yahya rivâyet etti. ki): Bana İbn Vehb haber verdi. ki): Bana Yûnus haber verdi. H. Ebû't - Tâhir ile Muhammedü'bnü Selemete'l - Muradı de rivâyet ettiler. Dediler ki: Bize İbn Vehb, Yûnus'dan, o da İbn Şihâb' dan naklen rivâyet etti. ki: Bana Urvetü'bnü'z - Zübeyr, Peygamber (sallallahü aleyhi ve sellem)'in zecvesi Âişe'den naklen haber verdi. Âişe şöyle dedi: (sallallahü aleyhi ve sellem)'in hayâtında güneş tutuldu da, Resûlüllah (sallallahü aleyhi ve sellem) mescide çıktı ve namaza durarak tekbîr aldı. Cemâat da onun arkasına saff oldular. Derken Resûlüllah (sallallahü aleyhi ve sellem) uzun bir kıraat tutturdu. Sonra tekbîr alarak uzun bir rükû' yaptı. Sonra başını kaldırarak: Allah, kendisine hamd edenin hamdini içilir. Ey Rabbimiz! Hamd de sana mahsûsdur, dedi. (ikinci rek'ata) kalkarak uzun bir kırâat tutturdu. (Yalnız) bu kıraat birinciden daha kısaydı. Sonra tekbîr alarak uzun bir rükû’ yaptı. (Fakat) bu rükû' birinciden daha kısaydı. Sonra (yine): Allah, kendisine hamd edenin hamdini işidir. Ey Rabbimiz! Hamd de sana mahsûsdur, dedi; sonra secde etti. (Ebû't - Tâhir: Sonra secde etti, cümlesini zikretmedi.) Sonra ikinci rek'atta da bu minval üzere hareket etti. Böylece dört rükû' ile dört secdeyi tamamladı. O, namazdan çıkmadan güneş de açıldı. Sonra kalkıp cemâate hutbe okudu. Allah'a lâyık olduğu vecihle senada bulunduktan sonra: Şüphesiz ki güneşle ay Allah'ın âyetlerinden iki âyettirler. Bunlar, Bunlar, hiç bir kimsenin hayâtı veya mematı için tutulmazlar. Onları (tutulmuş) görürseniz hemen namaza İltica edin, buyurdular. Şunu da ilâve ettiler: Binâenaleyh, Allah bu hâli sizden giderinceye kadar namaz kılın. de Resûlüllah (sallallahü aleyhi ve sellem)' Şu makaamımda ben size vaadedilen her şey'i gördüm. Hattâ ilerlediğimi gördüğünüz zaman ben cennetten bir salkım almak İstediğimi görüyordum. Vallahi benim gerilediğimi gördüğünüz zaman ben cehennemin bazı süzlerinin birbirini taarumar ettiğini görüyorum. Cehennemde İbn Lühayy'i de gördüm. Putlar için hayvanları serbest bırakan adam budur buyurdular.» «Ukaddimu» yerine «Etekaddemu» fiilini kullandı.) Ebû't-Tâhir'in hadisi: «Hemen namaza iltica edin...» cümle sinde sona erer. O, bundan sonrasını zikretmedi",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 3
			}
		}
	]
}