{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"10": "The Book of Prayer - Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2109,
			"arabicnumber": "907.01",
			"text": "Bize Süveyd b. Saîd rivayet etti. (Dediki): Bize Hafs b. Meysera rivayet etti. (Dediki): Bana Zeydü'bnü Eslem, Atâ b. Yesâr'dan, o da İbni Abbâs'dan naklen rivayet etti. İbni Abbâs şöyle demiş: «Resulullah (Sallallahu Aleyhi ve Sellem) zamanında güneş tutuldu. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) cemaatla birlikte namaza durdu. Ama Bakara sûresini okuyacak kadar uzun bir kıyam yaptı. Sonra uzun bir rükû' yaptı, sonra başını rükû'dan kaldırdı ve uzun uzadıya ayakta durdu. Yalnız bu kıyam birinciden daha kısaydı. Sonra uzun bir rükû' yaptı fakat bu da birinci rükû'dan daha kısaydı. Sonra secde etti, sonra (tekrar) uzun bir kıyam yaptı fakat bu da birinci kıyamdan aşağı idi. Sonra uzun bir rükû' yaptı ama bu da birinci rükû'dan aşağı idi. Sonra başını kaldırarak uzun bir kıyama durdu. Bu da birinci kıyamdan aşağı idi. Sonra uzun bir rükû' yaptı: Bu da birinci rükû'dan aşağı idi. Sonra secde etti, sonra namazdan çıktı. Gerçekten güneş açılmıştı. Müteakiben şunları söylediler; — Şüphesiz ki güneş ile ay Allah'ın âyetlerinden iki âyettirler. Bunlar bir kimsenin hayâtı veya memâtı için tutulmazlar. Siz böyle bir gördünüzmü hemen Allah'a zikredin. Ashâb: — Ya Resulullah! Şu makaammda seni bir şey almak için uzanırken gördük, sonra bundan vazgeçtiğini müşâhade ettik, dediler. Resûlullah (Sallallahu Aleyhi ve Sellem): — Ben, cenneti gördüm de, ondan bir salkım üzüm koparmaya el uzattım. Eğer ben o salkımı almış olsaydım, dünyâ durdukça siz ondan yerdiniz. Ben cehennemi de gördüm; Bugünkü gördüğüm manzara gibi (şimdiye kadar) hiç bir manzara görmüş değilim. Ekseriyetle cehennemliklerin kadınlar olduğunu da gördüm, buyurdular. Ashâb: — Ne sebeple yâ Resulullah? diye sordular: — Küfretmeleri sebebi ile cevâbını verdi. — Kadınlar Allah'a küfreder mi? diyenler oldu; — Evet, onlar kocalarına karşı nankörlük ederler, iyiliğe karşı küfrânda bulunurlar, onlardan birine ilelebet iyilik etsen, sonra senden bir şey görse hemen: Senden hiç bir hayır görmedim; der, buyurdu.»",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 18
			}
		}
	]
}