{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"10": "The Book of Prayer - Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2117,
			"arabicnumber": "912",
			"text": "Bize Ebû Âmir El-Eş'ari Abdullah b. Berrâd ile Muhammedü'bnü'l - Ala rivâyet ettiler. Dediler ki. Bize Ebû Üsâme, Bü-reyd'den, o da Ebû Bürde'den, o da Ebû Mûsa'dan naklen rivâyet etti. Ebû Mûsâ Şöyle dedi: (sallallahü aleyhi ve sellem) zamanında güneş tutuldu. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) kıyâmetin kopmasından korkarak telâşla yerinden kalktı ve mescide geldi. Hiç bir namazda yaptığını görmediğim en uzun kıyam rükû' ve sücûd ile namaz kıldı. Sonra şöyle buyurdu: Şüphesiz ki Allah'ın gönderdiği bu alâmetler hiç bir kimsenin hayâtı ve memötı için meydana gelemez. Lâkin, Allah onları kullarını korkutmak İçin gönderir. Şu hâlde siz bu alâmetlerden bir şey görürseniz hemen Allah'ın zikrine, Allah'a duâ ve İstiğfâr'a şitâb edin. - Alâ'nın rivâyetinde «Kesefet» fiili kullanıldı. O, (bihâ zamiri de kullanmayarak) «yuhavvihü ibâdehu» dedi. hadisi Buhârî «Küsûf» bahsinde; Nesâî dahi ayni ba-hisde tahrîc etmişlerdir. (sallallahü aleyhi ve sellem)'in korkması mes'elesini Kirmânî şöyle izah etmiştir: «Bu söz râvi tarafından yapılan bir temsildir. Ve kıyâmetin kopmasından korkan bir kimse gibi telâşlı yerinden kalktı, demiş gibidir. Yoksa Peygamber (sallallahü aleyhi ve sellem) kendisi ashabının arasında iken kıyâmetin kopmıyacağını bildirdi. Allahü teâlâ, ona dinini bütün dînlerden daha fazla yükselteceğini vaad buyurmuştu. Bu vaad henüz yerini bulmamıştır.» dahi kıyâmetten önce güneşin batıdan doğması, dâb-betü’l-Arz, deccal vb. gibi mutlaka zuhur edecek bir çok mukaddimeleri olmasına bakarak bu hadisi müşkül görmüş: «Bu alâmetler zuhur etmedikçe kıyâmetin kopacağından nasıl korkulabilir?» demiştir. Buna: «îhtimâl ki o günkü güneş tutulması Peygamber (sallallahü aleyhi ve sellem)'in mezkûr alâmetleri öğrenmesinden öncedir; yahut Resûlüllah (sallallahü aleyhi ve sellem) kıyâmetin büyük alâmetlerinden bâzısı zuhur edecek diye korkmuştur.» diye cevap verilmiştir. râvi Peygamber (sallallahü aleyhi ve sellem)’in kıyâmet kopuyor diye korktuğunu zannetmiştir. Râvinin öyle zannetmesinden Resûlüllah (sallallahü aleyhi ve sellem)'in hakikaten korkmuş olması lâzım gelmez. Olabilir... Ümmetine bir azâb vukûbulacağından korkmuştur.» diyenler de vardır. bu cevapların hiç birini İtirazdan hâli görmemekte ve Kirmanı'nin sözünü beğenmektedir. gönderdiği bu âyetler...» buyurmakla Resûlüllah (sallallahü aleyhi ve sellem): Husuf, Kusûf, Zelzele, şiddetli rüzgâr vb. gibi şeylere işaret etmiştir. Çünkü bunların her biri ile Allahü teâlâ kullarını korkutur. Bundan da anlaşılır ki: Zikir, duâ ve namaz gibi tâatlara iltica etmek, yalnız ay ve güneş tutulduğu zamana mahsûs değildir. Hanefiiler'in mezhebi de budur. «Bu rivâyette namaz zikredilmemiştir, binâenaleyh bu hadîsle her korkunç hâdise karşısında namaz kılmayı müstahab görenlere delil yoktur.» demişlerse de, bu bâbda hüccet, yalnız bu hadîs değildir. Başka rivâyetlerde ise: «Allah'ın zikrine icabet edin.» buyurulmuştur ki, bunda namazı müstahab görenlere delil vardır. Çünkü namaza: Zikir, denilir. Namazda zikrullah’ın envâı vardır",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 26
			}
		}
	]
}