{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2162,
			"arabicnumber": "935.02",
			"text": "(Bize, bu hadisi Ebü Bekir b. Ebî Şeybe de rivâyet etti. ki): Bize Abdullah b. Nümeyr rivâyet etti. H. Ebû't-Tâhir dahi rivâyet etti. ki): Bize Abdullah b. Vehb, Muâviyetü'bnü Sâlih'den naklen haber verdi. H. Ahmedü'bnü İbrahim Ed-Devrakî rivâyet etti. ki): Bize Abdüssamed rivâyet etti. ki): Bize Abdülaziz yani İbn Müslim rivâyet etti. Bunların hepsi Yahya b. Said'den bu isnâdla, bu hadisin benzerini rivâyet etmişlerdir. Abdülazîz'in hadîsinde: «Ne de Resûlüllah (sallallahü aleyhi ve sellem)’i derdiyle başbaşa bıraktın ... denilmiştir. hadîsi Buhârî «Cenâiz» bahsinin bir iki yerinde; Ebû Dâvûd ile Nesâî dahi ayni bahiste muhtelif râvilerden tan-ric etmişlerdir. şehid edildiği bildirilen İbn Harise'den murâd: Resûlüllah (sallallahü aleyhi ve sellem)’in azatlısı Zeydü'brıü Harise (radıyallahü anh)'dıc. Hazret-i Zeyd küçüklüğünde annesi ile beraber akrabasını ziyâreye gittiğinde Beni Kays kabilesinden birtakım atlıların hücumuna uğramış, onların eline esîr düşmüştü. Kendisini Hakim b. Hizam, halası Hatice binti Huveylid için satm almıştı. Resûlüllah (sallallahü aleyhi ve Sel-km)'in zevcesi olan Hatice (radıyallahü anha), onu Peygamber-i Zîşân. (sallallahü aleyhi ve sellem) Efendimize hibe etti. Bil'âhara Hazret-i Zeyd'in babası yakınlarından birkaç kişi ile birlikte Mekke'ye geldi. Oğlunun orada köle olarak satıldığını işitmişti. Zeyd'in babası para mukaabilinde oğlunu almak isteyince Resûlüllah (sallallahü aleyhi ve sellem), Hazret-i Zeyd'i çağırtarak, gelenlerin babası ile sair akrabası olduklarını bildirmiş ve kendisini meccânen babasına gitmekle Mekke'de Resûlüllah (sallallahü aleyhi ve sellem)'ixı yanında kalmak arasında muhayyer bırakmıştı. Hazret-i Zeyd Resûlüllah (sallallahü aleyhi ve sellem)'in hâne-i saadetinde kalmayı tercih etti. O da kendisini azâd ederek oğulluk edindi. Artık ona herkes Zey-dü'bnü Muhammed diyorlardı. Resûlüllah (sallallahü aleyhi ve sellem) kendisini pek seviyordu. Onu azatlı cariyesi Ümmü Eymen'le evlendirdi. Bu izdivâcdan: Üsâmetü'bnü Zeyd dünyâya geldi. Âişe'den rivâyet olunduğuna göre: Resûlüllah (sallallahü aleyhi ve sellem) bir seriyye ile Hazret-i Zeyd‘i de gönderirse o seriyyeye mutlaka kendisini kumandan tâyin edermiş. Hattâ Âişe (radıyallahü anha): «Zeyd Resûlüllah (sallallahü aleyhi ve sellem)' den sonra hayâtta kalsaydı onu mutlaka Halîfe ta'yîn ederdi.» dermiş. hadîsi imâm Ahmed ile Nesâî ve İbn Ebî Şeybe rivâyet etmişlerdir. Sahih ve garîb bir hadistir. edilen Ca'fer (radıyallahü anh)'a gelince: Resûlüllah (sallallahü aleyhi ve sellem)'m. amıcası Ebû Tâlib'in oğlu olup, kardeşi Hazret-i Alî'den on yaş büyüktür. Eskiden Müslüman olmuş ve Habeşistan'a hicret etmişti. «Ca'fer-i Tayyar» demekle meşhurdur. Hazret-i Ca'fer'in şehîd olacağını bizzat Resûl-i Ekrem (sallallahü aleyhi ve sellem) Efendimiz haber vennişdir. Ca'fer (radıyallahü anh) cennetle müjdelenen bahtiyarlardandır. edilen üçüncü zât Abdullah b. Ravâha'dır. Künyesi Ebû Muhammed veya Ebû Revâha olan bu zât dahi eskiden Müslüman olmuş, Akabe, Bedir, Uhud, Hendek, Hudeybiye ve Hayber gibi bir çok vak'alarda hâzır bulunmuştur. Onun dahi şehîd olacağını ve cennete gireceğini bizzat Fahr-i Alem (sallallahü aleyhi ve sellem) Efendimiz müjdelemiştir. Bu üç zâtın şehid edilmeleri şöyle olmuştur: Resûlüllah (sallallahü aleyhi ve sellem) üç bin kişilik bir ordu ile Hicret'in 8. yılında şam taraflarına harbe göndermiş, Hazret-i Zeyd'i orduya kumandan tâyin etmişti. Resûl-i Ekrem (sallallahü aleyhi ve sellem) kendilerine bâzı tavsiyelerde bulunmuş, bu meyânda: Şayet Zeyd vurulursa yerine Ca'fer'in geçmesini; o da vurulursa yerine Abdullah b. Ravâha'nın kumandan olmasını emir buyurmuştu. Ordu yola revân olurken Resûlüllah (sallallahü aleyhi ve sellem) de teşyî'a çıkmıştı; böylece hareket ederek «Ma'ân- taraflarına vardılar. Orada Bizans İmparatoru Hırakl'in, Belkaa' taraflarına yüzbin kişilik bir Roma ordusu ile geldiğini ve kendilerine o taraflardan da yüz bin kişi katıldığını; bu suretle İkiyüz bin kişilik bir ordu teşkil ettiklerini haber aldılar. Müslümanlar bu vaziyet karşısında Mûte denilen bir yere çekildiler. Sonra düşmanla karşılaştılar, Hazret-i Zeyd şehid oluncaya kadar Resûlüllah (sallallahü aleyhi ve sellem)'in sancağı elinde olduğu hâlde düşmanla çarpıştı ve nihayet şehîd düştü. Arkasından sancağı Ca'fer aldı; o da şehîd düşünceye kadar düşmanla çarpıştı. Nihayet sancağı Abdullah b. Revâha aldı. Enes (radıyallahü anh)’ın beyânına göre Resûlüllah (sallallahü aleyhi ve sellem) bu üç zâtın şehîd düştüğünü haber verirken gözlerinden yaşlar boşanmış. Sonra: Allah'ın kılıçlarından bir kılıç aldı.» buyurmuş. Bu kılıç: Meşhur İslâm kumandanı Hâlidü'bnü Velid (radıyallahü anh) Hazretleri'dir. Allahü teâlâ, Hazret-i Hâlid kumandasında Müslümanlara fütuhat nasîb etmişti. Rivâyete nazaran Hazret-i Hâlid: «Gerçekten Mûte Harbinde benim elimde dokuz kılıç kırıldı. Nihayet elimde bir Yemen kılıcından başka bir şey kalmadı.» demiştir. Mûte Harbinde Müslümanlardan oniki kişi şehîd olmuştur. Mûte harbi, târihin eşini kaydetmediği muharebelerden biridir. Biribirine din düşmanı olup; Biri hak yolunda cihâd eden fakat sayısı «üç bin»i geçmeyen; diğeri kâfir olup ikiyüz bin kişilik bir orduya Mâlik bulunan iki ordunun birbiri ile çarpışması akıllara durgunluk verecek derecede büyük bir iştir. Sonunda bir avuç mü'minîn koskoca ikiyüz bin kişilik küfür ordusuna galebe çalması şüphesiz ki Allah'ın mü' mîn kullarına lütfettiği bir mûcizesidir. tahminine göre: Resûlüllah (sallallahü aleyhi ve sellem), Mûte Harbinde üç kumandanının arka arkaya şehit düştüğü haberini alınca cidden mahzun olmuş. Bunu ne kadar gizlemeğe çalışmışsa da, fıtrat-ı beşeriyye iktizâsı yine yüzünden belli olmuştur. kan ağladığı bir sırada Peygamber (sallallahü aleyhi ve sellem) Efendimize gelerek Hazret-i Ca'fer'in evinde kıyâmetler koptuğunu, aile efradının feryâd-ü figân ettiklerini bildiren zatın kim olduğu malum değildir. İhtimâl Hazret-i Âişe kendisine kırıldığı için ismini tasrîh etmemiştir. (radıyallahü anh)'in kadınlarından murâd: Zevcesi Esma binti Umeys ile onun yanında bulunan kendi akrabası ve Hazret-i Ca'fer'in akrabası kadınlardır. Burada cümlede hazf vardır. Âişe (radıyallahü anha) cümleden delâleti hâl karinesi ile «Inne» nin haberini hazfetmiştir. Mânâ şudur: «Resûlüllah (sallallahü aleyhi ve sellem)'e gelen zât: Ca'fer'in kadınları bağıra çağıra ağlamak ve feryâd-ü figânda bulunmak gibi şer'an memnu olan işler yaptılar; dedi.» diyor ki: «Resûlüllah (sallallahü aleyhi ve sellem)'in: (Kadınların ağzına toprak saç.) enirini vermesi: Kadınların yüksek sesle ağladıklarına delildir. Bundan vazgeçmeyince ağızlarını toprakla tıkamayı emir buyurmuştur.» îyâz'a göre ise: Bu cümleden murâd: Ta'cizdir. Yani bu kadınlar ağızları tıkanmazsa susmazlar. Ağızlarını da ancak toprakla doldurmak suretiyle tıkayabilirsin, demektir. Kurtubi'nin beyânın göre, kadınların söz dinlememesi, bu emrin Peygamber (sallallahü aleyhi ve sellem)'den geldiğini söylemediği için olabilir. Bu sözü kendiliğinden söylediğini zannettikleri için o zâta itaat etmemişlerdir. Yahut emrin Resûlüllah (sallallahü aleyhi ve sellem)'den geldiğini anlamışlar fakat musibetin şiddetinden kendilerine Mâlik olamamışlardır. Kurtubî'nin bu mütâlâasını yerinde bulmakta ve: «Sahâbî kadınlara lâyık olan budur. Çünkü haram bir şeyden tekrar tekrar nehyolunduktan sonra ondan vazgeçmeyip, devam etmeleri ihtimâlden uzaktır.» demektedir. «Allah burnunu toprakta süründürsün» mânâsına gelir. Bu cümlenin mânâsı hakkında evvelce söz geçmişti. Burada ondan murâd: Bedduadır. Çünkü Hazret-i Âişe'nin kanaatine göre o zât, kendisine verilen emrî yerine getirememiş; kadınları nehyedip susturamamıştı. İkide bir gelerek kadınların itaat etmediklerini söylemekle Resûlüllah (sallallahü aleyhi ve sellem)'i derdiyle başbaşa dahi bırakmamıştı. Kirmânî şöyle diyor: «Eğer (o zât Resûlüllah (sallallahü aleyhi ve sellem)'in emrini yerine getirdi ama kadınlar itaat etmedi) dersen; ben de derim ki: Onun bu fiiline imtisal eden olmadığı için hakikatte onu yapmamış gibidir. Yahut hakikaten toprak serpmemiştir.» Âişe'nin sözüne Nevevî şöyle mânâ. vermiştir: «Sen, beceriksizsin! Onun için de aldığın emri yerine getirip kadınları susturamıyorsun. Bunu yapamadığını Peygamber (sallallahü aleyhi ve sellem)'e haber de vermiyorsun ki, başkasını göndersin de, üzüntüden kurtulsun.»",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		}
	]
}