{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2167,
			"arabicnumber": "938.02",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe rivâyet etti. ki): Bize Ebû Üsâme rivâyet etti. H. İshâk b. İbrâhîm de rivâyet etti. ki): Bize Îsâ b. Yûnus haber verdi. Bu râvîlerin ikisi de Hişâm'dan, o da Hafsa'dan, o da Ümmü Atıyye'den naklen rivâyet etmişlerdir. Ümmü Atıyye: «Biz cenazelerin arkasında yürümekten nehyolunduk. Ama bu mes'ele üzerimize kat'iyyetle haram kılınmadı.» demiş. hadisi Buhârî «Kitâbü’l-Hayz- ile «Kitâbü'l-Cenâiz»'de tahric etmişdir. hadisde, kadınların cenaze arkasından gitmelerinin yasak edildiği meçhul sigası ile ifâde olunmuştur. Buhârî'nin rivâyeti dahi öyledir. Fakat îsmâîli'nin rivâyetinde bu hüküm malûm sigası ile ifâde olunmuş ve: «Resûlüllah (sallallahü aleyhi ve sellem) bizi cenaze arkasından gitmekten nehiy buyurdu.» denilmiştir. Binâenaleyh «bu hadis hüccet olamaz.» şeklinde bir itiraz vârid değildir. emir buyurdu, nehyetti...» gibi sîgaların hükmü ulemâ arasında ihtilaflıdır. Cumhûr'a göre: Bu gibi sığalarla rivâyet olunan hadisler merfû hükmündedirler. rivâyet ettiği bir hadisde Hazret-i Ümmü Atıyye şunları söylemiştir: «Resûlüllah (sallallahü aleyhi ve sellem), Medine'ye girince bütün kadınları bir eve topladı. Sonra bize Ömer (radıyallahü anh)'i gönderdi; Ömer: Ben size Resûlüllah (sallallahü aleyhi ve sellem)’in Resûlüyüm, beni sizinle çalmayacağınıza... ilâh... dâir mubâyea yapmaya gönderdi, dedi...» hadîsin sonunda; «Bize bayramda perdenişin tazeleri çıkarmamızı emreyledi; cenazeye çıkmayı bize yasak etti.» denilmektedir. Mezkûr hadîs Bâbımız rivâyetinin mürsel olduğuna delâlet eder. cümlesi «Bize cenazeye çıkmamak, şâir memnu' şeylerde olduğu gibi te'kid ve teşdit edilmedi. Yani haram kılınmadı.» de-mekdir. Şu hâlde bu söz «Cenazelerin arkasından gitmek bize haram değil, mekruh kılındı.» mânâsındadır. «Bu hadîsin zahiri nehyin tenzih için olduğunu gösterir. Ulemânın cumhûru da buna kaaildir.» demiştir. «Bize, İbn Mes'ud ile İbn Ömer'in Âişe ve Ebû Ümâme'nin kadınlar için mekruh görürdükleri rivâyet olundu.» demiştir. cenaze arkasından yürümelerini İbrahim Nehai, Hasan-ı Basri, Mesrûk, İbn Şirin, Evzâi, İmâm Ahmed b. Hanbel ve İshâk da kerih görmüşlerdir. Sevrî: «Kadınların cenaze arkasından gitmeleri bid'attır.» demiş; Ebû Hanîfe kadınlara böyle bir şey'in yakışmıyacağını söylemiştir. Abbâs (radıyallahü anh) ile Kâsım, Salim, Zührî, Eabîa ve Ebû'z-Zinâd: Kadınların cenaze arkasından gitmelerine cevaz vermişlerdir. İmâm Mâlik dahi caiz görmüş ise de, genç kadınlara bunu mekruh addetmiştir. Şafiî'ye göre Kadınların cenaze arkasından gitmesi haram değil; mekruhtur. rivâyetine göre: Kadınların cenaze arkasından gitmesi mekruhdur. Yalnız ölen kimse kadının çocuğu veya babası yahut kocası olur da, kadın da bu gibi zevatın cenazelerine çıkacak yaşta bulunursa, o zaman çıkması mekruh değildir. hususta İbn Hazm-i Zahiri dahi şunları söyler: «Kadınlar cenaze arkasında gitmekten men olunmazlar. Bunu nehyeden eserler sahih değillerdir. Çünkü bu gibi eserler ya meçhul bir râvi tarafnıdan yâhud mürsel olarak yahut da hadisi ile ihticâc olunamıyan kimseler tarafından rivâyet olunmuşlardır. Bu husûsda en ziyâde bir şeye benziyen rivâyet Bâbımızın hadîsidir. Hâlbuki o da müsned değildir. Çünkü nehyedenin kim olduğunu biz bilmiyoruz. Belki de sahabeden biridir. Fakat sahih ve müsned bile olsa bu ha-disde yine hüccet yoktur. O, ancak kerahete delâlet eder. Bu hadîsin hilafı sabit olmuştur. İbn Ebî Şeybe, Ebû Hüreyre (radıyallahü anh)'dan şu hadîsi tahric etmiştir: (sallallahü aleyhi ve sellem) bir cenazede bulunuyordu. Bir ara Ömer (radıyallahü anh) bir kadın görerek ona seslendi; Resûlüllah (sallallahü aleyhi ve sellem), Ömer'e: (Bırak onu yâ Ömer! Zîra göz yaşarır, nefis dertlidir. Bu iç yakında olmuştur.) buyurmuştur.» hadîsi Hakim tahric etmiş ve onun Buhârî ile Müslim'in şartlarına göre sahih olduğunu söylemişse de, bu iddia söz götürür. Çünkü Beyhaki bu hadîsin munkatı' olduğunu bildirmiştir. Senedinde Selemetü'bnü Ezrak vardır. İbn'l-Kattan: «Bu Seleme'nin hâli malûm değildir. Hadîs ricali hususunda kitap yazanlardan hiç birinin onu andığını bilmiyorum.» demiştir. göre Hazret-i Ümmü Atıyye'nin: «Cenaze arkasında yürümekten nehyolunduk.» sözünün mânâsı: «Kabristana varıncaya kadar gitmek bize yasak edildi.» demektir. Ona göre: «Ama bize azimet kılınmadı.» sözünün mânâsı: «Biz cenazenin arkasından yürümedikçe cenazenin evine taziyede bulunmak ve başsağlığı dilemek için davet olunmadık.» demektir. «İhtimâl bu cümleden murâd: Erkeklere cenazenin arkasından gitmeleri teşvik edildiği gibi, bize teşvik edilmedi, demektir.» mütâlâasını ileri sürmüşlerdir. için en doğru hareket: Cenazenin arkasından gitmemektir. şöyle diyor: «Cenaze arkasından gitmeye gelince: Bu hususta kadınlara ruhsat yoktur. Yezîd b. Habib'den rivâyet olunduğuna göre: Resûlüllah (sallallahü aleyhi ve sellem)-. zâtın cenazesinde bulunmuş, tam cenaze namazı kılınacağı sırada bir kadın görmüş; (Bu kimdir?) diye sorunca; ölen zâtın (kız kardeşi) olduğunu söylemişler. Peygamber (sallallahü aleyhi ve sellem), ona evine dönmesini emretmiş ve taa kadın görünmez oluncaya kadar cenaze namazını kılmamış. Başka bir kadına da: (Geri dön; yoksa ben dönerim!) buyurmuşlar.»",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		}
	]
}