{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2182,
			"arabicnumber": "941.04",
			"text": "Bana İbni Ebî Ömer rivayet etti. (dediki): Bize Abdülazîz, Yezîd'den, o da Muhammed b. İbrahim'den, o da Ebû Seleme'den naklen rivayet etti ki, Ebû Seleme şöyle demiş: «Ben, Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Âişe'ye sordum; — Resulullah (Sallallahu Aleyhi ve Sellem) kaç elbise içinde kefenlendi? dedim. Âişe: — Üç sehûl elbisesi içine; cevâbım verdi. İzah Bu hadîsi Buhârî «Cenaiz» bahsinin bir iki yerinde; Ebû Dâvûd, Nesâî ve İbni Mâce «Cenâiz» bahsinde muhtelif râvilerden tahric etmişlerdir. Resulullah (Sallallahu Aleyhi ve Sellem)'in kaç parça elbise içine kefenlendiği ihtilaflıdır. Hadîslerin bâzılarında üç parça beyan Yemen bezi ile; diğerlerinde evvelâ bir hülleye, sonra o çıkarılarak üç parça beyaz Yemen bezine sarıldığı bildiriliyor. Hülle: Bir cinsten olmak üzere izâr ve ridâ' yani üst ve alt elbise, demektir. Bu elbise Yemen kumaşlarından yapılır. Sehûl veya Suhûl: Pamuklu elbise, demektir. Ebû Dâvûd'un «Sünen» inde rivayet ettiği bir hadisde Resûlullah {Sallallahu Aleyhi ve SelIem)'in «Hibera- denilen bir nev'i Yemen kumaşi ile kefenlendiği, sonra o elbise çıkarıldığı bildiriliyor. Yine Ebû Davud'un «Sünen»inde buradaki rivayet bulunduğu gibi İbni Abbâs' dan nakledilen başka bir rivayette üç Necrân elbisesi ile yâni iki elbiseden ibaret bir hülle ve içinde vefat ettiği gömleği ile kefenlendiği bildiriliyor. Osman b. Ebî Şeybe: Resulullah (Sallallahu Aleyhi ve Sellem) üç elbise ile yâni kırmızı hülle ve bir de içinde vefat ettiği gömlekle kefenlenmiştir, diyor. Bezzâr'in rivayet ettiği bir hadîse göre: Resulullah tSallallahu Aleyhi ve Sellem) yedi parça kumaşla kefenlenmiştir. Bunların üçü sehûl bezindendir. Bunlarla beraber gömlek, sarık, don ve altına yazılan bir de kadife vardır. İbni Adiyy'in rivayet ettiği bir hadîste İbni Abbas {Radiyallahu anh) Nebi (Sallallahu Aleyhi ve Sellem) iki beyaz sehûl kumaşı ile kefenlendi, demiştir. Tirmiizî diyor ki: «Nebi (Sallallahu Aleyhi ve Sellem)'in kefeni hakkında muhtelif rivayetler vardır. Bunların içinde en sahih olanı Hz. Aişe hadîsidir» Lügat ulemâsından Ezherî'ye göre; Sehûliyye: Yemen de bir yerin ismidir. Orada kumaş dokunur. Sûhûliyye ise: Beyaz kumaş, demektir. Bâzıları «Sehûliyye» kelimesinin Yemen'de bir yere mahsûs ism-i mensûb olduğunu; Suhûliyye ise: Pamuklu kumaş, mânâsına geldiğini söylemişlerdir. Hattâ «Sehûl: Yemen'de bir kabiledir. Yemen elbiseleri bu kabileye nisbet edilir; Sahi: Beyaz elbise, demektir, cem'i suhûl gelir.» diyenler de olmuştur. Daha başka tefsirler yapanlar da vardır",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		}
	]
}