{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2210,
			"arabicnumber": "953",
			"text": "(Bana Züheyr b. Harb ile Aliyyu'bnü Hucr rivâyet ettiler. Dediler ki: Bize İsmail rivâyet etti. H. Yahya b. Eyyûb da rivâyet etti. ki): Bize İbn Uleyye, Eyyûb'dan, o da Ebû Kılâbe'den, o da Ebû’l -Mühelleb'den, o da İm-rân b. Husayn'dan naklen rivâyet etti. İmrân Şöyle dedi. Resûlüllah (sallallahü aleyhi ve sellem) Necâşî'yi kastederek: din kardeşiniz vefat etmiştir. Binâenaleyh kalkın onun cenaze namazını kılın.» buyurdular. rivâyetinde yerine buyurmuştur. hadîsi bütün kütüb-i sitte sahipleri «Cenaze» bahsinde muhtelif râvîlerden tahric etmişlerdir. Bir kimsenin öldüğünü haber vermektir. ki: Resûlüllah (sallallahü aleyhi ve sellem) bir mucize olmak üzere Necâşî'nin vefatını günü gününe haber vermiştir. veya Nicâşi: Habeş İmparatoru demektir. Nitekim Roma İmparatoruna Kayser, Türk hükümdarına Hakan denilir. bu kelimeyi «yâ»nın şeddesi ile «Necâşiyy» şeklinde okumuşsa da, doğrusu şeddesiz okumaktır, ismi, hadisin bir rivâyetinde tasrîh buyurulduğu vecîhle «Azhame»' dir. bunun «Azmaha» okunacağını söylemişlerdir. Ma-amâfih şerek Necâşi'nin gerekse babasının isimleri hakkında muhtelif kaviller ileri sürenler olmuştur. Müslümanlığı kabulü hakkında İbn Sa'd -Tabakaat»'ında şunları kaydetmiştir. Resûlüllah (sallallahü aleyhi ve sellem)'ı Hudeybiye'den döndâğü vakit 7. yılda Amr b. Ümeyye'yi, Necâşî'ye elçi gönderdi. Necâşi, Peygamber (sallallahü aleyhi ve sellem)'in mektubunu alarak, yüzüne gözüne sürdü ve tahtından aşağı inerek, tevazu' göstermek için yere oturdu. Sonra Müslüman oldu ve Müslümanlığı kabul ettiğini Peygamber (sallallahü aleyhi ve sellem)'e yazdı. Necâşî, Hazret-i Câfer b. Ebi Tâlib (radıyallahü anh)’ın delâleti ile Müslüman olmuşdur.» bir rivâyette: -Peygamber (sallallahü aleyhi ve sellem), Necşî'ye mektup yazdı. Bu Necâşi cenaze namazını kıldığı Necâşi'den başkadır...» deniliyorsa da, Aynî bu sözün bâzı râvîler tarafından vehm eseri söylenmiş olduğu ihtimâli üzeninde durulduğunu yahut Müslüman olan Necâşî vefat ettikten sonra onun yerine geçen Necâşî'ye de bir mektup yazmış olması muhtemel bulunduğunu söylemiştir",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 88
			}
		}
	]
}