{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2241,
			"arabicnumber": "967",
			"text": "(Bana Ebû't - Tâhir Ahmed b. Amr rivâyet etti. ki): Bize İbn Vehb rivâyet etti. ki): Bana Amru'bnü Haris haber verdi. H. Hârûn b. Saîd el-Leylî dahi rivâyet etti. (Ded ki): Bize İbn Vehb rivâyet etti. ki) Bana Amrü'bnü Haris rivâyet etti. —Ebû't-Tâhîr rivâyetinde (ona da Ebû Alîyy-i Hemdânî (47), Hârûn rivâyetinde ise: Sümâmetü'bnü Süfeyy rivâyet etmiş) denilmektedir. ki: Fadâletü'bnü Ubeyd (48) ile Rum diyarında, Rodos'ta bulunuyorduk. Derken bir arkadaşımız vefat etti. Bunun üzerine Fadâletü'bnü Ubeyd emir vererek kabrini düz yaptırdı. Sonra şunu söyledi: Resûlüllah (sallallahü aleyhi ve sellem)’i kabirlerin yerle bir yapılmasını emir buyururken işittim.» Aliy El-Hemdânî ile Sümâmetü'b-nü Süfeyy ayni zâttır. İmâm Müslim her iki râvîden hadîsi hangi lâfızlarla işittiyse, öylece rivâyet etmiştir. Ebû Aliy, Sümâme'nin künyesidir. İyâz diyor ki: « Müslim (rahimehüllah), Peygamber (sallallahü aleyhi ve sellem)'in kefenlenmesini ve defnini anlattı. Fakat yıkandığını ve namazının kılındığını söylemedi. Resûlüllah (sallallahü aleyhi ve sellem)’in yıkandığında hilaf yoktur. Fakat namazının kılınıp kılınmadığı ihtilaflıdır. Bazıları: Onun cenaze namazını kimse kılmamıştır. Halk yanına girip duâ ediyor ve dönüp gidiyorlardı; demişlerdir. Bunlar namazın niçin kılınmadığında ihtilâf etmişlerdir. Bir takımları faziletinden dolayı kılınmadığını söylemiş: O, kendisine cenaze namazı Kılınmaktan müstağnidir, demiş; diğerleri: Hayır, namazının kılınmaması, bu sebepten dolayı değil; İmâm bulunmadığı içindir, demişlerdir. Bu kavil yalnıştır. Çünkü farz namazlar için İmâmlık muattal ve münhal kalmamıştır. Bir de Hazret-i Ebû Bekirle Resûlüllah (sallallahü aleyhi ve sellem)'in defninden Önce bey'at edilmiştir. hususta sahih olan kavil cumhûrun sözüdür. Onlara göre halk Resûlüllah (sallallahü aleyhi ve sellem)'in cenaze namazını teker teker kılmışlardır. Evvelâ bir gurup onun yanına girer ve herkes yalnız başına cenaze namazını kıldıktan sonra çıkarlar: yerlerine başka gurup girerdi. Böylece erkekler kıldıktan sonra kadınlar ve onlardan sonra çocuklar girerek cenaze namazını kılmışlardır. Resûlüllah (sallallahü aleyhi ve sellem) Pazartesi günü vefat ettiği hâlde Çarşamba gecesine yânı Salı gününün akşamına kadar- defnedilmemesi, Müslümanların bey'at mes'eleleri ile meşgul oldukları içindir.» (Resûlüllah sallallahü aleyhi ve sellem)’in teçhiz ve defni hususunda ihtilâfa düşerlerse müracaat edecekleri bir İmâmları bulunsun, niza' ve ihtilâfa meydan verümiyerek herkes onun emrine itaat etsin, diye evvelâ İmâm seçimine ehemmiyet vermişlerdir. Filvaki en mühim iş de o idi",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 118
			}
		}
	]
}