{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2277,
			"arabicnumber": "983",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Alîyyü'bnü Hafs rivâyet etti. ki): Bize Verkaa', Ebû'z - Zinâd' dan, o da A'rac'dan, o da Ebû Hüreyre'den naklen rivâyet etti. Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem), Ömer'i sadaka toplamaya gönderdi. İbn Cemîl ile Hâlidü'bnü Velîd ve Resûlüllah (sallallahü aleyhi ve sellem)'in amcası Abbâs zekât vermedi, denildi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): Cemî! zekât vermekten İmtina etmez şu kadar var ki o fakir İdi. Allah, kendisini zengin yaptı; Hâlid'e gelince: Siz, Hâlid'e zulmediyorsunuz. O bütün zırhlarını ve harp âletlerini Allah yolunda hapsetmiştir. Abbâs'ın zekâtı ise bir misl'r de beraberinde olmak üzere benim üzerimdedir.» buyurdu, sonra (sözüne devamla): Ömer! Sen, bir kimsenin amcasını babasının aslından olduğunu bilmez misin?» dedi. hadisi Buhârî «Zekât» bahsinde az çok lâfız değişiklikleri ile tahrîc etmiştir. murâd. Zekâtdir. Bu kelime farz olan zekât ile farz olmıyan tetavvû' mânâlarında kullanılır. cumhûr-u ulemânın onu bu hadîsde farz olan zekât mânâsına aldıklarını söyler. Maamâfih ulemâdan Bazıları tetavvû' sadakası mânâsına geldiğini söylemişlerdir. hadîsi Abdürrazzâk da rivâyet etmiştir. Onun rivâyetinde: «Resûlüllah (sallallahü aleyhi ve sellem) insanları sadaka vermeye teşvik etti...» denilmektedir. Kassâr: «Sadaka mânâsı bu kıssaya daha lâyıktır. Çünkü biz Ashâb-ı Kiram' dan hiç birini farz olan zekâtı vermediklerini zannetmeyiz.» demiştir. takdirde Hazret-i Hâlid'in vermemekte mâzûr olduğu kendiliğinden anlaşılır. Çünkü Hâlid (radıyallahü anh) bütün malını hak yolunda vakfetmişti. Sevabına sadaka vermek için elinde bir şey kalmamıştı. İbn Cemil nafile sadaka verme hususunda cimrilik gösterdiği için Resûlüllah (sallallahü aleyhi ve sellem) kendisini takdir etmiş, Hazret-i Abbâs için: sadakası bir misli de beraberinde olmak üzere benim üzerimdedir.» yani, o, kendisinden sadaka isıenildiği zaman bundan imtina «tmez; buyurmuştur. Mâlikî' lerden İbn Kassâr hadisi bu suretle te'vil etmiştir. Fakat Kâdı ty âz bu mutâbâayı kabul etmemiş, Resûlüllah (sallallahü aleyhi ve sellem)'in Hazret-i Ömer'i sadaka toplamaya gönderdiğini bildiren sahîheyn hadîslerini zahiri mânâlarına hamlederek: «Sadaka toplamak için adam göndermek yalnız farz olan zekâtlara mahsûsdu» demiştir. dahi: «Sahih ve meşhur kavle göre bu mes'ele sadaka değil, zekât hakkındadır.» diyor ve şunları ilâve cdivor: Bum, binâen gerek bizim ulemâmıza gerekse başkalarına göre Resûlüllah (sallallahü aleyhi ve sellem)'in: Abbâs'in sarakası bir misli de beraberinde olmak şartıyla benim üzerimdedir; buyurması: Ben, ondan iki senelik zekatı peşin aldım; manasınadır. Zekâtın vakti gelmeden verümesini caiz görmeyenler Resûlüllah (sallallahü aleyhi ve sellem)'in du sözünü (Abbâs’ın zekâtını, onun nâmına ben veririm.) diye te'vîl etmişlerdir. Bir takımları: «Bu sözün mânâsı; O zaman Hazret-i Abbâs muhtaç vaziyette olduğu için Peygamber (sallallahü aleyhi ve sellem) onun zekâtını vakti hâli iyileşinceye kadar te'hîr etmiştir.» mütâlâasında bulunmuşlardır. Fakat doğrusu Resûlüllah (sallallahü aleyhi ve sellem)’in sözü: «Ben, Abbâsin sadakasını peşinen aldım mânâsına gelir. Nitekim Müslim'in rivâyet ettiği başka bir hadîste: Abbâs'dan iki senelik sadakasını peşîn aldık.» buyurulmuştur.» İbn Cemil ile arkadaşlarının sadaka vermediklerini söyliyen zât bizzat Hazret-i Ömer' dir. İbn Cemil’in ismi bâzılarına göre Abdullah, bir takımlarına göre Humeyddir. İbn Cüreyc rivâyetinde İbn Cemîl yerine Ebû Cehm b. Huzeyfe zikredilmişse de, yanlıştır. Bütün ulemâ sadaka vermeyen bu zâtın İbn Cemil olduğunda müttefiktir. Zira İbn Cemil: Ensârdandır. Ebû Cehm ise Kureyş kabîlesine mensûbdur. (sallallahü aleyhi ve sellem)'in: Cemîl zekât vermekten İmtina etmez, şu kadar var ki o fakir İdi. Allah kendisini zengin yaptı.» sözünden muradı: Nimetin karşılığı bu değildir, o zekâtını vermelidir.» demektir. Bu söz de beyân ulemâsının «Medhi, zemme benzeyen bir sözle; zemmi de medhe benzeyen bir sözle te'kîd.» dedikleri san'at vardır. zemme benzeyen bir sözle te'kide misâl Şâir'in; «Onların hiç bir kusuru yoktur. Ancak kılıçlarında müfrezelerle çarpışmadan mütevel-lik çentikler vardır.» beytidir. şerif zemmi, medhe benzeyen bir sözle te'kide misâldir. Yani İbn Cemil' in sadaka vermemesine Allah'ın kendisini zengin etmesinden başka bir sebep yoktur. Bu ise zekât vermemeyi îcâb edecek bir sebep değildir. Binâenaleyh küfrân-ı nîmet etmiyerek Allah'ın verdiği maldan sadaka vermesi îcâb eder. Mühelleb'in beyânına göre İbn Cemîl münâfıkmış, zekât'ı bundan dolayı vermemiş. Bunun üzerine Teâlâ Hazretleri zekât vermekten ancak Allah ve Resûlü kendilerini fadl-ı İlâhî ile zengin kıldıkları için imtina ettiler. Ama tevbe ederlerse kendileri için hayırlı olur.» âyet-i kerimesini indirmiş. İbn Cemil de «Rab-bını beni tevbeye davet etti.» diyerek tevbe ve islah-ı hâl etmiştir. Hazret-i Hâlid kıssasının bir kaç vecîhle te'vîî edildiğini söyler, şöyle ki: Resûlüllah (sallallahü aleyhi ve sellem), Hazret-i Hâlid'in mâzûr olduğunu çünkü ibâdet niyeti ile bütün mallarını hak yolunda vakfettiğini bildirmiştir. Hak yolunda bütün malını vakfetmek farz değilken infâk eden bir zât, farz olan zekâtdan elbet de imtina etmez. Onun imtina etmesi elinde avucunda bir şey kalmadığı içindir. Zekât me'mûru Hâlid (radıyallahü anh)'dan zırhlarının kıymeti üzerinden zekât istemiştir. Çünkü onları ticâret mah zannetmiştir. Peygamber (sallallahü aleyhi ve sellem) de bunların ticâret malı değil, vakf olduğunu binâenaleyh zekât lâzım geldiğini haber vermiştir. Resûlüllah (sallallahü aleyhi ve sellem), Hazret-i Hâlid' in hak yolunda vakfettiği mallarını zekât saymasını caiz görmüştür. Zira zekâtın sarfedüeceği yerlerden biri (sebîlullah)'dır. Bundan murâd: Hak yolunda çarpışan mücâhîdlerdir. Mallarını peşinen onlara vakfetmesi, zamanı gelince zekât vermesi gibidir. Dir'in cem'idir. Dir': Zırh, demektir. Silâh ve hayvan gibi harâletleri mânâsına gelir. Müfredi: atâd'dır. Ated diyenler de vardır. şerifte Resûlüllah (sallallahü aleyhi ve sellem) amcası Hazret-i Abbâs b. Abdilmuttalib'in kendi babasının aslından olduğunu haber vermiş: Bu meyânda onun hakkında «sini» tâbirini kullanmıştır. Bir kökten biten hurma ağaçları, mânâsına gelir. Resûlüllah (sallallahü aleyhi ve sellem) bununla Hazret-i Abbâs ve kendi babası Abdullah’ın öz kardeş olduklarına işaret buyurmuştur. Hakem b. Uteybe'den rivâyet olunan bir hadîste: «Peygamber (sallallahü aleyhi ve sellem), Ömerü'bnü'l - Hattâb zekât toplamaya gönderdi de, Abbâs kendisini Peygamber (sallallahü aleyhi ve sellem)'e şikâyet etti. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) Hattâb oğlu! Bilmez misin ki bir İnsanın amcası, babasının mislidir. Biz, onun zekâtını geçen sene peşin aldık.» buyurdu.» denilmektedir. şerifin Abbâs (radıyallahü anh)’ın sadakası hususundaki cümlesi muhtelif şekillerde rivâyet olunmuştur. Müslim'de; Buhâride başka bir rivâyettedir. Buhârî’nin rivâyetine göre mânâ: «Bu sadaka onun farz olan zekâtı borcudur. Ama onu bir misli ile beraber vakti gelmeden edâ etmiştir. Üçüncü rivâyetin mânâsı da Buhârî rivâyeti gibidir. Çünkü ulemâdan Bazıları «aleyhi» ile «lehû» kelimelerinin ayni mânâya geldiklerini söylemişlerdir. Maamâfih mezkûr rivâyetin: Abbâs'in sadakası onun nâmına benim üzerimdedir.» mânâsına gelmesi de muhtemeldir. rivâyetinden murâd: « Abbâs'in sadakasını ben üzerime alıyorum, onun nâmına ben ödeyeceğim.» demektir",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 15
			}
		}
	]
}