{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2290,
			"arabicnumber": "987.01",
			"text": "Bana Süveyd b. Saîd rivayet etti. (Dediki): Bize Hafs yâni İbni Meysarete's-San'ânî, Zeyd b. Eslem'den rivayet etti, ona da Ebû Sâlih-i Zekvân haber vermiş. Kendisi Ebû Hureyre'yi şöyle derken işitmiş: Resulullah (Sallallahu Aleyhi ve Sellem) Şöyle buyurdular: «Altınla gümüşün haklarını vermeyen hiçbir altın ve gümüş sahibi yoktur ki, kıyamet gününde bunlar ateşten levhalar haline getirilip de, cehennem ateşinde kızdırılarak onlarla sahibinin yanları alnı ve sırtı dağlanmasın... Bu levhalar soğudukça miktarı 50.000 sene olan bir günde kullar arasında verilecek hüküm bitinceye kadar sahibine azâb için tekrar (kızdırılarak) iade olunacaklardır. Nihayet kendisine ya cennet'e ya cehennem'e doğru (giden yolu) gösterilecektir.» — «Yâ Resulullah! Yâ (zekâtı verilmeyen) develer ne olacak?» denildi; Resulullah (Sallallahu Aleyhi ve Sellem): — «Hiç bir deve sahibi de yoktur ki, —bu hayvanların hakkı su başlarına geldikleri gün sağılıp, muhtaçlara vermek iken— onların hakkını vermesin de, kıyamet gününde o develerin altına alabildiğine düz ve geniş bir sahaya yatırılarak develerden bir tek yavru bile hâriç kalmamak şartı ile onu ayakları ile ezmesin ve dişleri ite ısırmasınlar. Deve sürüsünün baş tarafı üzerinden (çiğneyip) geçtikçe son tarafı onun üzerine iade edilir. Bu ameliye miktarı 50.000 sene olan bir günde kullar arasında verilecek hüküm bitinceye kadar (devam eder.) Nihayet ya cennet'e yahut cehennem'e (giden) yolu kendisine gösterilir.» —-Yâ Resulullah! Sığırlarla koyunlar ne olacak?» dediler. Resûlullah {Sallallahu Aleyhi ve Sellem), — «Hiç bir sığır ve koyun sahibi yoktur ki, onların hakkını vermesin de, kıyamet günü geldiğinde düz ve geniş bir yerde onların altına serilerek, mezkûr hayvanlardan hiç biri hâriç kalmamak ve içlerinde çarpık boynuzlu, boynuzsuz, kırık boynuzlu bulunmamak şartı ile onu boynuzları ile süsmesin; tırnakları ile ezmesinler. Bu hayvanların önde bulunanları, üzerinden (çiğneyip) geçtikçe sondakller onun üzerine tekrar iade edilirler. (Bu miktarı 50.000) sene olan bir günde tâ kullar arasında verilecek hüküm bitinceye kadar (devam eder.) Nihayet ya cennete veya cehenneme (giden) yolu kendisine gösterilir.» buyurdu. Ashabdan: — «Yâ Resulullah! Ya atlar ne olacak?» diyenler oldu. Resulullah (Sallallahu Aleyhi ve Sellem)'- — «Atlar üç kısımdır; bir kısmı sahibi için bir yük; bir kısmı sahibi için örtü; bir kısmı da sahibi için ecirdir. Atı kendisine yük olan adama gelince: Bir kimsenin öğünmek, riya ve Müslümanlara düşmanlık için bağlayıp beslediği attır. Bu at ona bir yüktür. Gelelim sahibine örtü olan at'a: Bu, bir kimsenin Allah yolunda bağlayıp beslediği; sonra onun sırtında ve boynunda Allah'ın hakkı olduğunu unutmadığı attır. Bu at, onun için bir örtüdür. Sahibine ecir olan at ise: Bir kimsenin Allah yolunda Müslümanlar için çayır ve bahçede bağlayıp beslediği attır. At bu çayırdan veya bahçeden ne yerse, yediği şeyler adedince sahibine hasenat yazılır. Ona atın pislikleri ile bevlleri sayısınca dahî hasenat yazılır. At, ipini koparır da bir veya iki tur atarsa, sahibine onun izleri ve pislikleri miktârınca hasenat yazılır. Yahut sahibi onu bir nehir kenarından geçirirken sulamağa niyeti olmadığı hâlde o nehirden su içerse Allah, sahibine onun içtiği su yudumları miktârınca hasenat yazar.» buyurdular. (Ashâbdan): — «Yâ Resulullah! Ya eşekler ne olacak?» diyenler oldu, Resûlullah (Sallallahu Aleyhi ve Sellem): — «Eşekler hakkında bana şu bir tek cem'iyyetli âyetten başka bir şey indirilmedi: Her kim zerre miktarı bir hayır işlerse, onu(n mükâfatını) görür. Zerre miktarı kötülük işleyen de, onu(n mücâzâtını) görür.»[ Zilzal 7 - 8 ] buyurdular",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		}
	]
}