{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2292,
			"arabicnumber": "987.03",
			"text": "Bana Muhammed b. Abdilmelik El - Emevî rivayet etti. (Dediki): Bize Abdûlazîz b. Muhtar rivayet etti. (Dediki); Bize Süheyl b. Ebî Salih, babasından, o da Ebû Hureyre'den naklen rivayet etti. Ebû Hureyre şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Hiç bir hazîne sahibi yoktur ki, onun zekâtını vermesin de, o hazîne cehennem ateşinde kızdırılarak levhalar hâline getirilmesin ve onunla tâ Allah 50.000 sene miktarındaki bir günde kulları arasında hükmedinceye kadar yanları alnı dağlanmasın, sonra ya cennete veya cehenneme (giden) yolu kendisine gösterilir. Yine hiç bir deve sahibi yoktur ki, onların zekâtını vermesin de, kendisi alabildiğine çok olan develerin altına düz ve geniş bir yere yatırılarak develer üzerinden geçirilmesin. Develerin son taraftakileri üzerinden geçtikçe, ön taraftakileri tekrar onun üzerine iade olunur. (Bu) tâ Allah miktarı 50.000 sene olan bir günde kulları arasında hükmedinceye kadar (böyle devam eder.) Sonra ya cennete veya cehenneme (giden) yolu kendisine gösterilir. «Hiç bir koyun sahibi de yoktur ki, onların zekâtını vermesin de, kendisi alabildiğine çok koyunların altına düz ve geniş bir yere yatıralarak, koyunlar onu tırnakları ile ezmesin; İçlerinde yamuk boynuzlu ve boynuzsuz koyun bulunmamak şartıyla onu boynuzlarıyla süsmesinler. Son tarafta bulunan koyunlar üzerinden geçtikçe ön taraftakiler tekrar onun üzerine iade olunurlar. (Bu) tâ Allah kullarının arasında miktarı sizin senelerinizle 50.000 sene olan bir günde hükmedinceye kadar (böyle devam eder.) Sonra ya cennete veya cehenneme (giden) yolu kendisine gösterilir.» buyurdular. (Râvi Süheyl: «Sığırı zikretti mi, etmedi, bilmiyorum.» demiş.) Ashâb: — «Atlar ne olacak Yâ Resulallah? dediler. ResûluIIah (Sallallahu Aleyhi ve Sellem), — «Atların alınlarında kıyamete kadar hayır vardır. Yahut atların alınIraında kıyamete kadar hayır düğümlenmiştir. —Süheyl: Öyle mi dedi, böyle mi şüphe ediyorum; demiş.— Atlar üç kısımdır. Bir kısmı sâhlbine ecir, bir kısmı sahibine örtü, bir kısmı da sahibine yüktür. Sahibine ecir olan at: Sahibinin, Allah yolunda edindiği ve Allah yoluna hazırladığı attır. Böyle bir atın karnına attığı her şey mukabilinde Allah, sahibine bir ecir yazar. Velev ki atı çayırda gütmüş olsun.. At, her ne yerse Allah ona mukaabil sahibine bir ecir yazar. At'ı nehirden sularsa karnına attığı her damla mukaabilinde sahibine bir ecir vardır. — Resulullah İSallallahu Aleyhi ve Selîem) atın bevli ile pislikleri mukaabilinde bile ecir olduğunu söyledi ve sözüne devamla: — Bir veya İki tur koşmuş olsa attığı her adım mukaabilinde sahibine ecir yazılır. Sahibine örtü olan ata gelince: (Bu da): Bir kimsenin sırf cömertlik ve güzellik için edindiği attır. Ama onun sırtında ve karnında gerek darlık, gerekse varlık içinde olsun (ödemesi gereken) bir hak olduğunu unutmaz. Sahibine yük olan at ise: Sahibinin sırf böbürlenmek, şımarmak ve öğünmek, âleme, riya için edindiği attır. İşte at, kendisine yük olacak olan kimse budur.» buyurdu. Ashâb: — Ya eşekler ne olacak yâ Resûlallâh?» diye sordular. Resulullah (Sallallahu Aleyhi ve Sellem}-- — «Allah, onlar hakkında bana şu bir tek cemiyyetIi âyetten başka bir şey indirmedi: Her kim zerre miktarı bir hayır işlerse onu(n mükâfaatını görür zerre miktarı kötülük işleyen de onun (mücâzatını) görür. [ Zilzal 7 - 8]» buyurdular",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 30
			}
		}
	]
}