{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2296,
			"arabicnumber": "988.01",
			"text": "(Bize İshâk b. İbrâhîm rivâyet etti. ki): Bize Abdürrazzâk haber verdi. H. Muhammed b. Râfi'de rivâyet etti. Lâfız onundur. ki): Bize Abdürrazzak rivâyet etti. Dedi ki: Bize İbn Cüreyc haber verdi. ki): Bana Ebû'z-Zübeyr haber verdi; o da Câbir b. Abdillâh El-Ensârî'yi şunları söylerken işitmiş: Ben, Resûlüllah (sallallahü aleyhi ve sellem)’i şöyle buyururken dinledim: hakkını vermeyen hiç bir deve sahibi yoktur ki, o develer kıyâmet gününde olduklarından daha çok gelerek, kendisi onların altına geniş ve düz bir yerde oturmasın ve develer bacakları İle ayakları ile onun üzerinden geçmesinler. hakkını vermiyen hiç bir sığır sahibi yoktur ki, kıyâmet gününde bu hayvanlar olduklarından daha çok gelerek; kendisi düz ve geniş bir yerde onların altına oturmasın! Bu hayvanlar onu boynuzlan İle sürecek ve ayakları İle ezecektir. hakkını vermeyen hiç bir koyun sahibi yoktur, ki, kıyâmet gününde bu hayvanlar olduklarından daha çok bir hâlde gelerek; kendisi de düz ve geniş bir yerde tınların altına oturmasın! Koyunlar, onu süsecek ve tırnaklarıyla ezecek; İçlerinde boynuzsuz veya boynuzu kırık koyun bulunmayacaktır. hakkını vermiyen hiç bir hazîne sahibi yoktur ki, kıyâmet gününde hazînesi dazlak başlı bir yılan olarak gelmesin! Bu yılan ağzını açarak onu kovalıyacaktır; yılan yaklaştıkça o kaçacak. Bunun üzerine yılan: Al şu sakladığın hazîneni, ben ondan müstağniyim; diyecek. (Beriki) kurtuluşa çâre olmadığını görünce elini yılanın ağzına sokacak, yılan da onu aygırın (yem) kıydığı gibi kıyı verecek.» ki: «Ben, Ubeyd b. Umeyr'i bu sözü söylerken işittim. Sonra bunu Câbir b. Abdillâh'a sorduk; o da Ubeyd b. Umeyr' in dediği gibi söyledi.» Ebû'z-Zübeyr ki: «Ben, Ubeyd b. Umeyr'i dinledim; şunları söylüyordu: Bir adam: Ya Resûlallah! Devenin hakkı nedir? diye sordu; Resûlüllah (sallallahü aleyhi ve sellem) Onu su başında sağmak, süt kovalarını emânet vermek, erkek develeri emânet vermek, develeri menîha olarak vermek ve Allah yolunda üzerlerinde yük taşımaktadır; buyurdular.»",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 33
			}
		}
	]
}