{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2296,
			"arabicnumber": "988.01",
			"text": "Bize İshâk b. İbrâhîm rivayet etti. (Dediki): Bize Abdürrazzâk haber verdi. H. Bana Muhammed b. Râfi' de rivayet etti. Lâfız onundur. (Dediki): Bize Abdürrazzak rivayet etti. (Dediki: Bize İbni Cüreyc haber verdi. (Dediki): Bana Ebû'z-Zübeyr haber verdi; o da Câbir b. Abdillâh El-Ensârî'yi şunları söylerken işitmiş: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken dinledim: «Develerin hakkını vermyeen hiç bir deve sahibi yoktur ki, o develer kıyamet gününde olduklarından daha çok gelerek, kendisi onların altına geniş ve düz bir yerde oturmasın ve develer bacakları İle ayakları ile onun üzerinden geçmesinler. Sığırın hakkını vermiyen hiç bir sığır sahibi yoktur ki, kıyamet gününde bu hayvanlar olduklarından daha çok gelerek; kendisi düz ve geniş bir yerde onların altına oturmasın! Bu hayvanlar onu boynuzlan İle sürecek ve ayakları İle ezecektir. Koyunun hakkını vermeyen hiç bir koyun sahibi yoktur, ki, kıyamet gününde bu hayvanlar olduklarından daha çok bir hâlde gelerek; kendisi de düz ve geniş bir yerde onların altına oturmasın! Koyunlar, onu süsecek ve tırnaklarıyla ezecek; İçlerinde boynuzsuz veya boynuzu kırık koyun bulunmayacaktır. Hazînenin hakkını vermiyen hiç bir hazîne sahibi yoktur ki, kıyamet gününde hazînesi dazlak başlı bir yılan olarak gelmesin! Bu yılan ağzını açarak onu kovalıyacaktır; yılan yaklaştıkça o kaçacak. Bunun üzerine yılan: Al şu sakladığın hazîneni, ben ondan müstağniyim; diyecek. (Beriki) kurtuluşa çâre olmadığını görünce elini yılanın ağzına sokacak, yılan da onu aygırın (yem) kıydığı gibi kıyı verecek.» Ebû'z-Zübeyr Demişki: «Ben, Ubeyd b. Umeyr'i bu sözü söylerken işittim. Sonra bunu Câbir b. Abdillâh'a sorduk; o da Ubeyd b. Umeyr' in dediği gibi söyledi.» Yine Ebû'z-Zübeyr Demişki: «Ben, Ubeyd b. Umeyr'i dinledim; şunları söylüyordu: Bir adam: — Yâ Resûlallah! Devenin hakkı nedir? diye sordu; Resulullah (Sallallahu Aleyhi ve Sellem) — Onu su başında sağmak, süt kovalarını emânet vermek, erkek develeri emânet vermek, develeri menîha olarak vermek ve Allah yolunda üzerlerinde yük taşımaktadır; buyurdular.»",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 33
			}
		}
	]
}