{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2304,
			"arabicnumber": "94.03",
			"text": "Bize Yahya b. Yahya ile Ebû Bekir b. Ebî Şeybe İbn Nümeyr ve Ebû Cüreyb hep birden Ebû Muâviye'den rivâyet ettiler. Yahya dedi ki: Bize Ebû Muâviye, A'meş'den, o da Zeyd b. Vehb'den, o da Ebû Zerr'den naklen haber verdi. Ebû Zerr Şöyle dedi: Peygamber (sallallahü aleyhi ve sellem) ile Medine'nin Harra'sında yatsı zamanı hem yürüyor hem Uhut dağına bakıyorduk. (Bir ara) Resûlüllah (sallallahü aleyhi ve sellem) bana: «Yâ Ebâ Zerr!» dedi; ben: «Lebbeyk, ya Resûlallah!» cevâbını verdim. «Şu Uhud dağı altın olarak elime geçse üçüncü Ur geceyi ondan bende bir dinar bulunduğu hâlde geçirmemi istemem. Yalnız borç İçin hazırladığım dînâr müstesna olur. —Önüne, sağına ve soluna birer avuç saçma işareti yaparak— onu Allah'ın kullarına şöyle, şöyle ve şöyle dağıtmak isterim» buyurdu. Sonra (biraz) yürüdük. Yinet «Yâ Ebâ Zerr!» dedi. Ben: «Lebbeyk, ya Resûlallah!» dedim; «Hiç şüphe yok ki malı çok olanlar kıyâmet günü sevabı en az olanlardır. Yalnız şöyle, şöyle ve şöyle yapanlar müstesna...» buyurdu. Ve ilk defâki gibi işarette bulundu. Sonra bir az daha yürüdük. İYine): «Yâ Ebâ Zerr! Ben gelinceye kadar olduğun yerde dur.» buyurdu. Ve oradan ayrılarak gözümden kayboldu gitti. Ben bir gürültü ve bir ses İşittim. (Kendi kendime): «Gâlibâ Resûlüllah (sallallahü aleyhi ve sellem)’e cinler musallat oldu.» diyerek arkasından gitmeyi düşündüm. Sonradan onun (bana): gelinceye kadar buradan ayrılma.» dediğini hatırlayarak kendisini bekledim. Geldiğinde işittiğim şeyleri ona anlattım. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem)-. Şöyle buyurdu: «O, Cibrîl İdi! Bana geldi de: (Ümmetinden her kim Allah'a şirk koşmayarak ölürse cennete girecektir.) dedi.» Bent «Zina etse de, hırsızlık yapsa da mı?» dedim. (Evet) zina etse de, hırsızlık yapsa da buyurdular",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 41
			}
		}
	]
}