{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2309,
			"arabicnumber": "993.02",
			"text": "(Bize Muhammed b. Rafi’ rivâyet etti. ki): Bize Abdurrazzâk b. Hemmân rivâyet etti. ki): Bize Ma'mer b. Râ-şid, Vehb b. Münebbih'in kardeşi Hemmâm b. Münebbih'den naklen rivâyet etti. Hemmâm: Bize Ebû Hüreyre'nin Resûlüllah (sallallahü aleyhi ve sellem)'den rivâyeti şudur... diyerek bir takım hadîsler nakletmiş, ezcümle Ebû Hüreyre dedi ki: Resûlüllah (sallallahü aleyhi ve sellem) bana: infâk et ki, ben de sana infâk edeyim; dedi.» buyurdular. Resûlüllah (sallallahü aleyhi ve sellem) yemînî doludur. Onu gece ile gündüzün sehâveti azaltamaz. Gökle yeri yaradalı beri neler înfâk ettiğini söyleyin. Şüphesiz ki Allah'ın yemînindeki hiç bir şey eksilmemiştir. Onun arşı suyun üzerindedir, kabzı da diğer yed'indedir. O, kâh yükseltir kâh alçaltın» buyurdu. hadîsi Buhârî «Tefsir» ve «Tevhîd» bahislerinde; Nesâî bir kısmını «Tefsir» bahsinde rivâyet etmiştir. şerif, kutsî hadislerdendir. Kitabımızın başında da arzet-tiğimiz vecihle hadîs-i kutsi: Mânâsı Allah'dan, lâfzı Peygamber (sallallahü aleyhi ve sellem)'den sâdır olan hadîslerdir. Hazretleri'nin: et ki, ben de sana infâk edeyim.» Buyurması, müşâkele tari-kiyledir. Çünkü Allahü teâlâ'nın infâkı, hazinelerinden hiç bir şey azaltmaz. yemini sehâvetle doludur...» cümlesi Allah'ın bitmez tükenmez ihsan ve ikram hazînelerinden kinayedir. Hakikatte yemim Sağ el, sağ taraf gibi mânâlara gelirse de, bunlar Teâlâ Hazretleri hakkında imkânsızdır. Çünkü tahdîd ve cisimleştirmeyi tezammun ederler. Cenâb-ı Hak ise bir hâdîe hudutlandırmaktan ve cisim olmaktan münezzehtir. şerif müteşâbihâttandır. Onun için îmmam Mâziri: «Bu hadîs te'vîli gereken hadîslerdendir.» demiştir. Ehli sünnet İmâmlarına göre müteşâbihin hükmü hak olduğuna îti-kâd ile hakiki mânâsını Allahü teâla'ya havale etmektir. Maamafih Müteehhirîn ulemâ, ehl-i fesadın fitnelerine meydan vermemek için müteşâbihâtı şer-i şerife muvafık surette te'vîl etmişlerdir. «Bu hadîs, te'vîli gereken hadîslerdendir.» sözü ile buna işaret etmiştir. (sallallahü aleyhi ve sellem), Ashâb-ı Kiram’ına anlıyacakları şekilde hitâb etmiş ve Allahü teâlâ'nın nimetlerinin infâkla bitip tükenmiyeceğini: yemini doludur; onu gece ile gündüzün sehâveti azaltamaz.» cümlesi ile ifâde buyurmuştur. Bu mânâyı sağ el mânasına gelen «yemin» kelimesi ile ifâde buyurması: İnsanların bir şey'i tutup kapmakta ve nafaka vermekte dâima sağ ellerini kullandıkları içindir. Mezkûr cümleden: «Allahü teâlâ'nın kudreti eşyayı bir seviyede idare eder. Kuvvet ve zaaf ittibârı ile fark göstermez. Yarattığı şeyler de ayni minval üzere vâkî olur. İnsanlarda hâl böyle değildir. Onların sağ elleri ile yaptıkları şeyler, sol elleri ile yaptıklarından farklıdır.» mânâsına da gelebilir. Kelimesi İbn Nümeyr'in rivâyetinde mel'ân şeklinde rivâyet olunmuşsa da, ulemâ bunun hatâ olduğunu bildirmişlerdir. Doğrusu: «Mel'â» dır. kelimesi: «Sahhan» şeklinde de rivâyet olunmuştur. Hatta meş'hûr olan rivâyeti budur. Yalnız sahîh-i Müslim' in elde mevcut nüshalarında «Sahhâ'» diye zaptolunmuştur. Dâimi surette dökmek mânâsına gelir. «kabz» kelimesi şeklinde rivâyet olunmuştur. Kâdi İyâz'ın beyânına göre meşhur olan rivâyeti «Kabz»'dır. Mânâsı: Ölüm, demektir. Bu takdirde cümleden murâd: «Ölüm Allah'ın yed-i kudretindedir. Rızkı azaltıp çoğaltmak dahi ona aittir. Dilediğine az, dilediğine çok verir.» demek olur. mânâsı: İhsan ve bol nzıkdır. Bu takdire göre cümlenin tefsire ihtiyâcı yoktur. feyz'in de «ölüm» mânâsına geldiğini söylemiştir. rivâyetinde: Allah'ın yed-i kudretindedir. Kimi alcaltır kimi yükseltir.» buyurulmuştur. «Burada mizandan murâd: Bir temsildir. Bu cümle ile Allah'ın kullarına rızıklarım adaletle taksim ettiği ifâde olunmuştur.» diyor. cümle ile Allah'ın adetâ mizanla tartar gibi fızıkları bâzı kullarına boz bâzılarına az takdir buyurması da ifâde edilmiş olabilir. Bütün cisimlen ihata eden nürâni ve pek büyük bir cisimdir. Mahlükaat içersinde ilk yaratılanın bu olduğu söylenir. Hakikatini Allah'dan başka bilen yoktur",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 46
			}
		}
	]
}