{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2312,
			"arabicnumber": "996",
			"text": "Bize Saîd b. Muhammed El-Cermî rivayet etti. (Dediki): Bize Abdurrahmân b. Abdilmelik b. Ebcer El-Kinâni, babasından, o da Tâlhatü'bnu Musarrif'den, o da Hayseme'den naklen rivayet etti. Şöyle demiş: Abdullah b. Amr ile birlikte oturuyorduk. Anîden ona bir vekîl-i harcı gelerek içeri girdi, Abdullah ona: — «Kölelerin yiyeceklerini verdin mi?» diye sordu. Vekil: — «Hayır.» cevâbını verdi. Abdullah: — Öyle ise git de onlara yiyeceklerini ver; (zîrâ) Resulullah (Sallallahu Aleyhi ve Sellem) «Bir kimseye günah nâmına sahibi bulunduğu kimselerin yiyeceğini vermemesi yeter.» buyurdular-, dedi. İzah Birinci hadîs-i şerîfde zikri geçen Allah yolundan murâd: Cihad'dır. Iyal: Bir kimsenin nafakaları kendine Ait olan çoluk, çocuğu annesi, babası, karısı ve hizmetçisidir. Kahraman: Bir kimsenin işlerine bakan vekil-i harcı, demektir. Kelime fârisiden alınmadır. Nevevî diyor ki: «Bu bâbdan murâd: Çoluk çocuğun ve diğer aile efradının nafakalarını vermeye teşvik ile bu husustaki sevabın büyüklüğünü beyândır. Çünkü aile efradından bazılarının nafakasını vermek karabet dolayısiyle vâcip, bâzılarının nafakası da mendûbdur. Böylelerine nafaka vermek sadaka vesile olur. Bâzılarının nafakası da nikâh yahut mülk-ü yemin sebebiyle vâcib olur. Bunların hepsi faziletli ve şeriat tarafından teşvik edilen şeylerdir. Aile efradına nafaka vermek nafile sadakadan efdaldır. Onun için İbni Ebî Şeybe' nin rivayetinde Resulullah (Sallallahu Aleyhi ve Sellem)' «Sevap itibâri ile bunların en büyüğü ailene sarfettiğindir.» buyurmuştur. Hâlbuki bâbımızın birinci hadisinde Allah yolunda ve köle azadı hakkında sarfedüen dinarın faziletini beyân buyurmuştu. Arzettiğimiz sebepten dolayı aile efradına verilen nafakayı bunların hepsine tercih buyurmuş, son hadisde: «Bir kimseye, mâlik olduğu kölelerinin nafakasını vermemek günah nâmına yeter.» diyerek bu ciheti bir daha te'kid eylemiştir.» Kaadı îyâz'ın beyânına göre bu nafaka vâcib olduğu için başkalarından efdaldır. Çünkü vacibin sevabı, nafilenin sevabından çok olur. Müslim sarihlerinden El-Übbi burada şunları söylemiştir: «Hadîs-i şerif nafakadan muradın zaruriyyât olduğunu gösteriyor. Zira verilmesi farz olan nafaka zarurî ihtiyâçlara aittir. Aile efradının ihtiyâçları yokken onlara nafaka vermek, farz değil; mendûbdur. Anlaşılan şudur ki: Sadaka vermek ihtiyâcı olmayan âile efrâdına nafaka vermekten efdaldır. Meselâ bir adamın elinde iki dinar parası olup bunlardan biri aile efradının zarurî ihtiyâçlarına kâfi gelse, diğerini sadaka olarak başkalarına vermesi efdal olur. Nafaka hususunda çoluk çocuğun küçük olmaları şart değildir. Ebû Kılâbe' nin: Küçük çocuklar, tâbirini kullanması, bir kayd-ı ihtirâzi değil, ekseriyetle vâki olanı beyândır. Çünkü ekseriya nafakaya muhtaç olanlar küçük çocuklardır. Eyyûb-u Sahtiyanı' nin arkadaşlarından biri şunları söylemiş: Eyyûb'Ia birlikte filân dağın üzerinde idik; Susamıştım. Ona susuzluğumdan şikâyet ettim: — Beni giydirirsen seni sularım, dedi. — Giydiririm, dedim; — Yemin etmedikçe inanmam, dedi. Ben de yemîn ettim. Bunun üzerine Eyyûb ayağı ile bir kayanın üzerine vurdu. Ve: — Ey kaya! Allah'ın izni ile bizi sula, dedi. Arkacığından kayadan bir kaynak fışkırdı. Ben, Eyyüb'un pek büyük ibâdet yaptığını bilmiyordum. Yalnız çoluğunun çocuğunun nafakasını güzelce verirdi.»",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 49
			}
		}
	]
}