{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2323,
			"arabicnumber": "1002.02",
			"text": "(Bize, yine bu hadîsi Muhammedü'bnü Beşşâr ile Ebû Bekir b. Nâfi' ikisi birden Muhammed b. Ca'fer'den rivâyet ettiler. H. bu hadîsi Ebû Küreyb dahi rivâyet etti. ki): Bize Vekî' rivâyet etti. Bu râvîler hep birden Şu'beden bu isnâdla rivâyette bulunmuşlardır. hadîsi Buhârî «Nafakaat» ile «îmân» bahislerinde tahrîc etmiştir. murâd: Bir kimsenin karısı ve çocukları ile nafakası kendisine ait olan diğer aile efradıdır. Nafakasını verdiği kardeş, kız kardeş, amca, amca oğlu veya ecnebi bir çocuk bu mânâda dâhildirler. göre: Bir kimsenin ehli, kendine hâs olan insanlardır. «ehil» kelimesinin zevce ile akrabaya şâmil olduğunu muhtemel görürler. Hattâ bu kelimenin yalnız zevceye mahsûs olması, şâir aile efradının evleviyyet tarikiyle zevce hükmünde olmaları ihtimâlinden de bahsedilmiştir. Zîrâ nafakası vâcib olan zevcesi hakkında bir kimseye sevap verilirse, nafakası vâcib olmayanlara baktığından dolayı sevap yazılması evleviyette kalır. şöyle bir suâl hatıra gelebilir: «Bir kimsenin ailesi efradına nafaka vermesi farz olduğu hâlde buna nasıl sadaka denilebilir?» şudur: Allahü teâlâ sadakayı farz ve nafile nevîlerine ayırmıştır. İşte nafaka veren kimse bu hususta maksadına göre mükafaat görecektir. Nafakanın farz olması ile, ona «sadaka» adı verilmesi birbirine münâfii değildir. Ulemâdan bâzılarına göre: Allahü teâla Hazretlerinin farz olan nafakaya «sadaka» nâmını vermesi, kullar ifâ ettikleri farzdan dolayı sevap verilmiyeceğini zannetmesinler divedir. Aile efradı ile çoluk çocuğa nafaka vermek bil'icmâ' farzdır.» demiştir. dahi küçük çocuklara nafaka vermenin, babalarına farz olduğunu söylemiş ve: «Nafakasını verdiklerinden başka...» hadîsi ile istidlal etmiştir. Çünkü çocuk küçük olduğu müddetçe babasının iyâli sayılır. beyânına göre ulemâ malı ve kazancı olmayan buluğa ermiş çocuklar hakkında ihtilâf etmişlerdir. Bâzılarına göre: Bir baba kendi oğullarına buluğa erinceye kadar kızlarına kocaya gidinceye kadar nafaka vermekle mükelleftir. Hattâ nikâhlı bir kız zifaftan önce boşanırsa nafakası babasına aittir. Zifaftan sonra boşanır veya kocası ölürse artık babasına nafaka farz değildir. torunlarına nafaka vermesi İmâm Mâlik'e göre farz değildir. göre ise: Muhtaç ve âciz olmak şaicıyla bir kimsenin kardeşlerine, kız kardeşlerine, amcalarına, halalarına, dayılarına ve teyzelerine nafaka vermesi farzdır. ve hala oğullarına nafaka vermek cumhûr-u ulemâya göre farz değildir. Bu hususta cumhûr'a muhalefet eden yalnız İbn Ebi Leylâ olmuştur",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 60
			}
		}
	]
}