{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2325,
			"arabicnumber": "1003.02",
			"text": "(Bize Ebû Küreyb Muhammed b. Alâ' rivâyet etti. ki): Bize Ebû Üsâme, Hişâm'dan, o da babasından, o da Esma' binti Ebi Bekir'den naklen rivâyet etti; Şöyle dedi: «Annem yanıma geldi, kendisi Kureyş devrinde Resûlüllah (sallallahü aleyhi ve sellem)'în onlarla muahede yaptığı zaman henüz müşrike İdi. Ben, Resûlüllah (sallallahü aleyhi ve sellem)’den fetva isteyerek. «Ya Resûlallah! Annem bana rağbet göstererek, yanıma geldi. Kendisine yardımda bulunayım mı? dedim. Resûlüllah (sallallahü aleyhi ve sellem) Evet. Annene yardımda bulun... buyurdular. hadîsi Buhârî «Hîbe», «Cizye» ve «Edeb» bahislerinde; Ebû Dâvûd «Kitâbu'z-Zekât» da muhtelif râvîlerden tahrîc etmişlerdir. «Rağibe» mi yoksa «Rahibe» mi denildiğinde râvînin şekkettiği görülüyor. İstekli; «Rahibe: îstemiyerek, mânâlarına gelir. kadının neyi isteyip istemediği ulemâ arasında ihtilaflıdır. müslüman olmayı istediğini yahut istemediğini söylemiş; bir takımları bu kelimenin: «Benim vereceğim şeylere tama' ederek geldi.» mânâsına kullanıldığını ileri sürmüşlerdir. Dâvûd'un bir rivâyetinde.- «Kureyş zamanında annem müşrik olarak ve islâmı kerih görerek yardım ümidi ile benim yanıma geldi.» denilmiştir. Hacer-i Askalânî (773-852)'nin beyânına göre Kureyş zamanından murâd: Hudeybiye musâlâhası ile Mekke'nin fethi arasında geçen zamandır. bir rivâyetinde: «Annem oğlu ile birlikde geldi.» denilmiştir. Oğlunun ismi: Haris olduğu söylenir. Esma'nın annesinin kim olduğu ihtilaflıdır. Bazıları üvey annesi, bir takımları süt annesi olduğunu söylemişlerdir. annesi olduğunu söyliyenler de vardır. Aynî: «Esah olan da budur.» diyor: Sa'd Ebû Dâvûd-u Tayâlisî ve Hâkim'in rivâyet ettikleri Abdullah b. Zübeyr hadisini buna delîl gösteriyor. hadîsde: Kuteyle, kızı Esma binti Ebî Bekîr'in yanına Medîne'ye geldi. Kendisini Ebû Bekir câhiliyet devrinde boşamıştı. Kızma kuru üzüm, yağ ve selem ağacı yaprağından hediyeler getirdi. Fakat Esma' onun hediyelerini kabul etmekten yahut onu evine almaktan imtina etti. Ve Âişe'ye haber göndererek Resûlüllah (sallallahü aleyhi ve sellem)'e sormasını istedi. Peygamber (sallallahü aleyhi ve sellem)--«Onu evine alsın...» buyurdular. kadının ismi dahi ihtilaflıdır. Bazıları Kuteyle olduğunu söylerler. Bâzılarına göre Katleldir. Ümmü Bekir olduğunu söylemiştir. Lâkin İbn Tîn: «İhtimâl Ümmü Bekir onun künyesi olacaktır.» diyor. nin sahîh olarak kabul ettiği: Kutey le olmasıdır. Kuteyle'nin müslümanlığı kabul edip etmediğinde dahi ihtilâf etmişlerdir. «Ekser-i ulemâya göre bu kadın müşrik olarak öl müştür.» diyor. ise onu müslümanlığı geç kabul eden sahabe meyânında zikretmiştir. Ancak Ebû Mûse'l-Medini buna itirazla «Hiç bir hadisde müslümanlığı kabul ettiğine dâir ka-yıd yoktur.» demiştir",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 62
			}
		}
	]
}