{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2350,
			"arabicnumber": "1016.04",
			"text": "Bize Muhammedü'bnüTMüsenhâ ile İbn Beşşâr rivâyet ettiler. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be, Amr b. Murra'dan, o da Hayseme'den, o da Adiyy b. Hâ-tim'den, o da Resûlüllah (sallallahü aleyhi ve sellem)'den naklen rivâyet etti ki, Efendimiz üç defa cehennemi anarak, ondan (Allah'a) sığınmış. Yüzü ile de sakınmış. Sonra: hurma ile bile olsa cehennemden korunun onu da bulamazsanız (hiç ofmazsa) güzel bir sözle (cehennemden sakının.)» buyurmuşlar. hadîsi Buhârî «Zekât» bahsinin bir-iki yerinde ve “Kitâbu'r-Rukaak»'da tahrîc ettiği gibi İmâm Ahmed, İbn Huzeyme ve İbn Ebî'd-Dünyâ dahi muhtelif râvîlerden tahric etmişlerdir. geçen «Tercüman» kelimesi «Tercüman» şeklinde de okunmuştur. Başkasının sözünü tefsir ve îzâh eden kimsedir. diyor ki: «Resûlüllah (sallallahü aleyhi ve sellem)'in: bakacak; Ahirete gönderdiği şeylerden başka bir şey göremiye-cek... ilâh... buyurması: Temsil kabilin dendir. Çünkü insan başı dara geldiği vakit sağına soluna bakmarak yardımcı arar.» Bundan murâd: Kaçacak yol araması olabilir. Cehennemi gören kimse ondan kurtulmak için kaçacak bir yol arar fakat Allah'ın takdir buyurduğu cehennem yolundan başka bir şey göremez.» demişlerdir. kelimesinin mânâsı hakkında bir çok sözler söylenmiştir. İmâm Halil b. Ahmed ile diğer bir takım ulemâya göre bu kelime: Uzaklaştırdı, çevirdi; mânâlarına gelir. Ekser-i ulemâya göre: Korundu ve bir işte ciddiyet gösterdi, demektir. gelen; diğer Bazıları: Kaçan, mânsına geldiğini; bir takımları da: Arkasındakine mâni olarak, sana doğru gelen, demek olduğunu söylemişlerdir. göre: Burada bu manâların hepsi kastedilmiş olabilir. Yani Resûlüllah (sallallahü aleyhi ve sellem) sanki cehennemi görüyormuş gibi korunmuş yahut cidden îzâha çalışmış veya konuşarak muhatabına yönelmiş yahut kaçan kimse gibi çekinerek cehennemden korunmayı tavsiyede bulunmuştur. sözden murâd: Nasihat ve tâlim gibi şer'an tâat sayılan sözlerdir",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 87
			}
		}
	]
}