{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2351,
			"arabicnumber": "1017.01",
			"text": "(Bana Muhammedü'bnü'l-Müsennâ El-Anezî rivâyet etti. ki): Bize Muhammed b. Ca'fer haber verdi. ki) -. Bize Şu'be, Avn b. Ebî Cuhayfe'den, o da Münzir b. Cerir'den o da babasından naklen rivâyet etti. Cerîr Şöyle dedi: Biz gündüzün ortasında Resûlüllah (sallallahü aleyhi ve sellem)’in yanında bulunuyorduk. Derken yalın ayak kaplan postu rengindeki gömleklerini veya abalarım başlarına geçirmiş, kılıçlarını çekmiş; ekserisi hattâ hepsi Mudar kabilesine mensup çıplak bir takım adamlar Peygamber (sallallahü aleyhi ve sellem)’e geldiler. Onların muhtaç hâlini görünce Resûlüllah (sallallahü aleyhi ve sellem)’in yüzü değişti. îçeri girip çıktıktan sonra Bilâl'e emir buyurdu, Bilâl ezanı okuyarak kaamet getirdi. Resûlüllah (sallallahü aleyhi ve sellem)’de namazı kıldırdı. Sonra hutbe okudu ve: insanlar! Sizi bir kişiden yaratan Rabbinizden korkun... \"Sûre-i Nîsa âyet âyet-i kerimesini sonuna (yani) \"Şüphesiz ki Allah sizin üzerinizde gözcüdür\" âyetine kadar ve Haşr süresindeki \"Allah'dan korkun. Her nefis yârın (Âhiret) için ne gönderdiğine bir baksın. Allah’tan korkun... Sûre-i Haşr âyet 18 \" âyet-i kerimesini okudu. devamla) «Bir adam dinarından, dirheminden, elbisesinden, bir sâ' buğdayından, bir sâ' kuru hurmasından sadaka vermelidir. Velev ki yarım hurma olsun» buyurdu. Ensâr'dan bir zât hemen hemen elinin taşıyamıyacağı kadar hattâ elinin taşımaktan âciz kaldığı bir kese getirdi. Sonra bir biri ardınca herkes bir şeyler getirdiler. Netice'de yiyecek ve elbiseden müteşekkil iki yığın gördüm. Resûlüllah (sallallahü aleyhi ve sellem)’in (mübarek) yüzünde altınla yaldızlanmış gibi parladiğını gördüm. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) kim İslâm'da güzel bir çığır açarsa, o çığırın ecri ile kendisinden sonra o çığırla amel edenlerin ecirlerinden hiç bir şey noksan edilmemek şartıyla sevapları kendine aittir. Ve her kim İslâm'da kötü bir çığır açarsa o çığırın vebalı ile kendisinden sonra onunla amel edenlerin vebalı hiç bir noksanları olmamak üzere ona aittir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 88
			}
		}
	]
}