{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2354,
			"arabicnumber": "1017.04",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Cerir, A'meş'den, o da Mûsâ b. Abdîllâh b' Yezîd ile Ebû'd-Duhâ’dan, onlar da Abdurrahmân b. Hilâl El Absi'den, o da Cerir b. Abdillâh'dan naklen rivâyet etti. Cerîr Şöyle dedi: «Bedevilerden bir takım İnsanlar Resûlüllah (sallallahü aleyhi ve sellem)'e geldiler, üzerlerindeki giyimleri yapağıdandı. Resûlüllah (sallallahü aleyhi ve sellem) onların bu kötü hâlini gördü; muhtaç vaziyette idiler...» hadîsi yukarıdakilerin hadisleri mânâsında rivâyette bulundu. Nemre'nin cem'idir. Yapağından dokunan çizgili kumaştır. Siyah beyaz çizgileri hâvi olduğu için kaplan postuna benzetilerek, kumaşa bu ismin verilmiş olması muhtemeldir. Nîmâr» tâbiri: yapağıdan dokuma örtülerini ortadan yararak başlarına geçirmişler, mânâsına gelir. veya kevm: Yığın, demektir. Esâs ittibâriyle bu kelime «Râ-biye» gibi tep eve yüksek yer, mânâsına gelir. Sonradan mecazen her şey'in yığın hâlinde çok olan miktarına «Kûm» denilmiştir. kelimesi «Müdhüne» şeklinde de rivâyet olunmuşsa da Kâdi Iyâz ile diğer hadîs İmâmlarının beyânına göre bu rivâyet tasniftir. tefsiri hakkında Kâdı îyâz iki vecih beyân etmiştir; veçhe göre: Bu kelimenin mânâsı: Altınla yaldızlanmış gümüş, demektir. Yüzün güzelliğini ve nurunu ifâde hususunda bu mânâ daha beliğdir. veçhe göre: Râvî Peygamber (sallallahü aleyhi ve sellem)'in güzelliğini ve nurunu altın yaldızlı derilere benzetmiştir. deriden yaptıkları bâzı eşyanın üzerine altın çizgiler çizerlerdi. Kâinat (sallallahü aleyhi ve sellem) Efendimizin sevinmesine sebep: Müslümanların kendi emrine imtisâlen tâatullah'a koşmalarını ve gelen muhtaç insanların başlarını çözmelerini gözleriyle görmesidir. birbirlerine gösterdikleri şefkat ve yardım, kendilerini son derece memnun etmiştir",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 91
			}
		}
	]
}