{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2378,
			"arabicnumber": "1029.04",
			"text": "Bana Muhammed b. Hatim İle Hârûn b. Abdillâh rivâyet ettiler. (Dediler ki): Bize Haccâc b. Muhammed rivâyet etti. ki): İbn Cüreyc şunu söyledi: Bana İbn Ebî Müleyke haber verdi, ona da Abbâd b. Abdillâh b. Zübeyr, Esma’ binti Ebi Bekir'den naklen haber vermiş ki, Esma', Peygamber (sallallahü aleyhi ve sellem)’e gelerek: «Yâ Nebiyullah! Zübeyr'in bana getirdiği şeylerden başka hiç bir şeyim yok. Onun bana getirdiklerinden bir parça infâk etsem bana bir günah var mıdır?» demiş, Resûlüllah (sallallahü aleyhi ve sellem): «Gücünün yettiği kadar infâkta bulun. Malının fazlasını saklama ki Allah da sana fazl-u ihsanını kesmesin.» buyurmuşlar. hadîsi Buhârî Kitâbul-Hîbe»'de tahrîc etmiştir. şerif Ebû Dâvûd, Tirmizî Nesâî’ nin «Sahih»'lerinde ide mevcuttur. onun sahih olduğunu söylemiştir. Esma, Resûlüllah (sallallahü aleyhi ve sellem)'in kendisine «Enfikî» mi, yoksa «indahî» veya «infahiy» mi? buyurduğunda şekketmiştir. Bu kelimelerden birincisinin mânâsı: Başkasına nafaka ver; ikincinin mânâsı: Atıyye ve bahşiş ver; demektir. Suyu dökmek, mânâsına gelir. Burada ondan bu mânâ kastedilmiş olması muhtemeldir. dahi: Atıyye ve bahşiş, mânâsına geldiğinden «Nadh»‘ın ondan daha beliğ olmak üzere su döker gibi harcamak mânâsına kullanılmış olması ibareye daha münâsibdir. Bir şey'i hatalı şekilde sayıp dökmektir. Burada ondan murad: Geriye bırakmak ve biriktirmek için saymak, Allah yolunda sarfetmemektir. cümlesinin asıl mânâsı: «Fazla malını biriktirme ki Allah da sana fazlını biriktirmesin.» demekse de, biriktirmenin ve sayıp tutmanın hakikati Allahü teâlâ'ya nisbetle muhal olduğundan -Allah da sana olan nimetlerini esirgemesin.» şeklinde te'vil edilmiştir. bu cümle gerekse müteakip rivâyetteki cümlesi mukaabele ve teçhiz kabilinden mecazdırlar. şeyi kap içinde saklama.» demektir. Burada ondan murâd: Fazla malını muhtaçlara vermeyi esirgeme demektir. Az bir şey vermek, demektir. «Bu hadîsin mânâsı: Tâat hususunda mal sarfına teşvik, malı elinde tutarak cimrilik göstermekten ve malı kapta biriktirmekten nehiydir.» diyor. Esma «Zübeyr'in bana getirdiği şeylerden başka hiç bir şeyim yok.» demekle kocasının kendisine mülk olarak verdiği şeyleri anlatmak istemiştir. Resûlüllah (sallallahü aleyhi ve sellem) ise sadaka vermesini emir buyurmuş, kocasından izin istemesine lüzum görmemiştir. diyor ki: (sallallahü aleyhi ve sellem)’m, Hazret-i Esmâ'ya (Gücünün yettiği kadar infâkta bulun.) buyurması Zübeyr’in razı olacağı miktarda infâk et manasınadır. Bu cümlenin takdiri şudur: Şenin için azar azar infâk hususunda birbirinden farklı mubah olan dereceler vardır. Zübeyr bunların hepsine razı olur. Binâenaleyh sen bu derecelerin en yükseğini yap yahut kendi mülkünden infâkta bulun",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 115
			}
		}
	]
}