{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2392,
			"arabicnumber": "1037.02",
			"text": "(Bana Harmeletü'bnü Yahya rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihâb'dan naklen haber verdi; ki): Bana Humeyd b. Abdirrahmân b. Avf rivâyet etti. ki): Muâviyetü'bnü Ebî Süfyân'ı hutbe okurken dinledim; şöyle diyordu: Ben, Resûlüllah (sallallahü aleyhi ve sellem) kim Allah çok hayır vermek murâd ederse onu dînde fakîh kılar. Ben, ancak taksimciyim, veren ise Allahdır.» buyururken işittim. hadîsini Buhârî «İlim» bahsinde tahric -etmiştir. Onu Nesâî dahi rivâyet eder. rivâyetinde şu cümle de vardır: «Bu ümmet Allah'ın emri gelinceye kadar muhalifleri tarafından bir zarar görmeden Allah'ın emri üzere tâata devam edecektir.» ve üçüncü hadîslerdeki «hayır»'dan murâd: Ya bütün hayırlar yahut çok hayırdır. Bu kelimenin nekîre olarak zikredilmesi, umûm ifâde etsin diyedir. Çünkü şart siyakında vârid olan nekîreler, siyâk-ı nefîde vârid olanlar gibi umûm ifâde ederler. Kelimenin ne-kire olarak zikrinden ta'zîm kastedilmiş de olabilir. Bir şey'i bilmek veya hakkıyla bilmek, demektir. Şeriat İstılahında ise şeriatın fer'î hükümlerini tafsili delillerden istidlal yoluyla çıkararak bilmektir. Burada münâsıb olan birinsi mânâdır. Zîrâ dîn ilimlerinin hepsine şâmildir. ilmi ile meşgul olan âlime «Fakîh» derler. Basrî: «Fakîh: dünyâdan el çeken ve âhi-rete rağbet gösteren, dîn işlerinde basiretle hareket eden Allah'ına ibâdet eden kimsedir.» demiştir. (sallallahü aleyhi ve sellem) bir rivâyette: «Ben, ancak hazinedarım...»; diğer rivâyette: «Ben, ancak taksimciyim; veren İse Allah'dır.» buyurmakla kendisinin getirdiği vahyi hiç bir kimseye hassaten tebliğ etmediğini bil'akis umûmi olarak herkese tebliğde bulunduğunu, hakikatte her şey'i veren de alan da Allahü teâlâ olduğunu, irâdesine göre akıl ve idrâki insanlara o bahşettiğini anlatmak istemiştir. Ashâb-ı kiram'ın hadîs ve âyetlerden mânâ anlayışları bir seviyede değildi. Bazıları bir hadis veya âyetin yalnızca açık olan zahirî mânâsını anlar; diğer Bazıları ise onların inceliklerine nüfuz ederlerdi. kirâm'ın hâlleri böyle olunca, ümmetin diğer efradının da anlayış dereceleri bir olmayacağı evleviyetle sabit olur. Çünkü ashâb nûr-u nübüvvetten kana kana içen bahtiyarlardır. Sair ümmet efradı bu şerefe nail olamamışlardır. Ancak onların arasında da şer'i mes'eleleri delillerinden çıkaracak kudreti hâiz müc-tehidler yetişmiş şer'i mes'elerleri hallederek bütün ümmetin enzâr-ı itlaına arzetmişlerdir. Şüphesiz ki bu, Allah'ın büyük bir fadl-u ihsanıdır. Teâlâ Hazretleri onu dilediği kullarına verir. şöyle bir suâl hatıra gelebilir: «Resûlüllah (sallallahü aleyhi ve sellem)'in Resul, mübeşşir ve nezir gibi nice sıfatları varken burada neden kendisine (Ben ancak bir hazinedarım!) yahut (Ben, ancak bir taksimciyim.) buyurarak hasr yapmıştır?» Buradaki hasr, muhatabın itîkaadına göredir. Muhâtab onun hem taksimci hem de verici olduğuna îtîkaad ediyordu. İşte kendisinin verici değil yalnız bir taksimciden ibaret olduğunu anlatmak için (Ben, ancak bir taksimciyim.) diyerek kasr-ı ifrat yapmıştır. Bu sözün mânâsı: «Benim vazifem yalnız sizin aranızda taksim yapmaktan ibarettir, dilediği miktarda akıl, fikir ve anlayış ihsan eden ise Allahü teâlâ'dır.» demektir. cümleyi şeyh Kutbuddin şöyle izah etmiştir: «Resûlüllah (sallallahü aleyhi ve sellem) Allah'ın ihsan ettiği maldan kendine hiç bir şey ayırmamıştır. O, ganimetler hakkında: sizden fazla olarak verdiği ganimetlerden benim malın yalnız beşte birdir; o da sîzin olsun.) buyurmuştur. Burada (Ben ancak taksimciyim.) demesi, ashâb-ı kirâmmın gönüllerini almak içindir. Çünkü kendisine ashabından fazla ganimet tahsis edilmiştir. Mânâ şudur: Mal da Allah'ın, kullar da Allah'ındır. Ben, Allah'ın izniyle sâdece bir taksimciyim...» Ayni bu İzahatla hadîsin zahiri arasında büyük fark olduğunu söylemekte ve şöyle demektedir: «Çünkü Resûlüllah (sallallahü aleyhi ve sellem)'in birinci hadisi vahyin tebliği ve şeriatın beyânı hususundaki taksimi bildirmektedir. Şeyh Kutbuddîn' in rivâyet ettiği hadis ise mal taksimi hakkında sarahat arzetmektedir. Her iki hadîsin ayrı ayrı tevcihleri vardır. Birinci hadîs İslâm dîninde fakih olmakdan bahseder... hadîsin zahiri ise mal taksimini göstermektedir. Lâkin burada şöyle bir suâl vârid olur: «Burada bu sözün münâsebeti nedir?» Suâle şöyle cevap verilir. Mal, hadîsi ganimetler taksim edilirken vârid olmuştur. Resûlüllah (sallallahü aleyhi ve sellem) hikmet icâbı ashâbdan bâzılarına fazla verince ashâb bunun hikmetini anlayamamış hattâ içlerinden bu hususta ileri geri lâf edenler olmuş, bunun tizerme Peygamber (sallallahü aleyhi ve sellem)'- kime Allah büyük hayır vermek dilerse onu dînde fakîh kılar.) buyurarak bu işin hikmetini ancak Allah'ın fazla akıl, fikir ve şiriat umurunda anlayış ihsan ettiği kimselerin anlayabileceğini, anlamı-yanların işe karışmamaları gerektiğini zîrâ hakîkatta bütün umur Allah'ın yed-i kudretinde olduğunu, almak, vermek, arttırmak, eksiltmek hep ona âit şeyler olduğunu, kendisinin yalnız taksim vazifesi gördüğünü binâenaleyh fazla veya noksan vermenin kendisine değil Allah'a nisbet edileceğini beyân ederek bu hususta lâf edenlere red cevâbı vermiştir. diyor ki: Resûlüllah (sallallahü aleyhi ve sellem)’in: (Ben, ancak taksimciyim; veren Allah'dır.) sözü, verdiklerini vahye Hazret-i Muâviye' nin çok hadis rivâyet etmekten menede-rek bundan yalnız Hazret-i Ömer devrinde rivâyet olunan hadisleri müstesna tutması, onun zamanında gayr-i müslimlerden ve onların kitaplarından rivâyette bulunanlar çoğaldığı içindir. Bu sebeple hadîs râvilerinin nazar-ı dikkatlerini Hazret-i Ömer zamanına celbetmiştir. Çünkü Ömer (radıyallahü anh) hadis hususunda pek ziyâde dikkat ve şiddet gösterir, gelişigüzel, hadîs diye rivâyet edilen her sözü kabul etmez, söylenen sözün hadîs olduğunu isbât için iki şahit isterdi. Hadis ilmi bu suretle istikrar kespetmiş ve rivâyet olunan hadisler şöhret bulmuştur",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 129
			}
		}
	]
}