{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2407,
			"arabicnumber": "1045.03",
			"text": "(Bana Ebû't-Tâhir rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Âmir şunları söyledi: Bana da İbn Şihâb bu hadîsin mislini de Sâib b. Yezîd'den, o da Abdullah b. Sadi'den, o da Ömerû'bnu'l - Hattâb (radıyallahü anh)'dan, oda Resûlüllah (sallallahü aleyhi ve sellem)'den naklen rivâyet etti. Müslim' in hatâ ettiğini söyleyenler olmuştur. Ez cümle Ebû Aliy İbn's-Seken (294 - 353) Sâib b. Yezid ile Abdullah b. Sa'dî arasında Huveytib b. Abdiluzzâ adında bir râvi daha bulunduğunu bildirmiş; Nesâî: «Bu hadîsi Sâ'ib, İbn Sa'di'den işitmemiş, oun İbn Sa’di'den Huveytib vasıtası ile rivâyet etmiştir...» Daha başka hadis İmâmları da buna benzer sözler söylemişlerdir. (631 - 676) bunu te'yîd eden bâzı rivâyetlerin sened-lerini naklettikten sonra şunları söylüyor: «Abdülkaadir ki: bu hadisi Nu'mân b. Râşid, Zühri' den rivâyet etmiş; Huveytib'ı senedden ıskaat etmiştir. Ma'mer de Zühri' den rivâyet etmiştir. Ma'mer'den rivâyet edenler ise Huveytib hakkında ihtilâfa düşmüş; Süfyân b. Uyeyne, Zühri' den rivâyet eden cemâat gibi nakleylemiş; İbn Mübarek, Huveytib'ı senedden düşürmüştür. Ma'mer'den Abdürrezzâk dahi rivâyette bulunmuş fakat Huveytib ile İbn Sa'di'yi senedden ıskaat etmiştir. Abdülkaadir bütün rivâyetlerin tarîklerini böylece anlattıktan sonra: bu hadîsin tarikleri böylece sona ermektedir. Sahîh olan tarik cemâatin ittifak ettiği yani Zühri' nin, Sâib’den, onun da Huveytib’den, onun da İbn Sa'di'den, onun da Hazret-i Ömer' den naklettiği rivâyettir.» hâlde bu hadisi dört şahabı bir birinden rivâyet etmiş demektir. Bunlar: Sâib b. Yezid , Huveytib b. Abdiluzzâ, Abdullah b. Sa'di ve Ömer (radıyallahü anhüma) hazerâtıdır. rivâyetin senedindeki «Saldı» hakkında İmâm Nevevî: «Ulemâ bunu kabul etmemişlerdir; doğrusu (Sa'dî)' dir; nitekim Cumhûr da onu böyle rivâyet etmişlerdir.» demiştir",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 144
			}
		}
	]
}