{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 243,
			"arabicnumber": "80.01",
			"text": "Bana Hasen b. Aliy el-Hulvânî ile Ebu Bekir b. İshâk rivayet etttler, dediler ki: Bize İbni Ebi Meryem rivayet etti. (Dedi ki): Bize Muhammed b. Ca'fer haber verdi. Dedi ki: Bana Zeyd b. Eşlem, Iyâd b. Abdİllâh'dan, o da Ebu Said-i Hudrî'den, o da Nebiy (Sallallahu Aleyhi e Sellem)''den naklen haber verdi. H. Bize Yahya b. Eyyub ile Kuteybe ve İbni Hücr rivayet ettiler. Dediler ki: Bize İsmail —kî İbni Ca'ferdir— Amr b. Ebî Amr'dan, o da el-Makburî'den o da Ebu Hureyre'den, o da Nebiy (Sallallahu Aleyhi ve Sellem) 'den naklen, İbni Ömer'in Nebi {Sallallahu aleyhi ve Selleml'den diye naklettiği (238 nolu) hadis ile aynı manada rivayet etti. Diğer tahric: Ebu Hureyre'nin rivayetini yalnızca Müslim rivayet etmiştir; Tuhfetu'l-Eşraf, 13006. Ebu Said el-Hudri'nin rivayetini de Buhari, 298 -uzunca-, 913 -uzunca-, 1393, 1850 -muhtasar olarak-, 2515; Müs!im, 2050; Nesai, 1575, 1578, 1288; Tuhfetu'lEşraf, 4271 DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın NEVEVİ ŞERHİ: \"Ey kadınlar topluluğu sadaka verin ... (2/65) İşte bu da din eksikliğidir.\" Dilciler, ma' şer (topluluk), aynı durumdaki yani ortak vasıftaki topluluk demektir, diye açıklamışlardır. Mesela, insanlar bir ma'şer, cinler bir ma'şer, nebiler bir ma' şer, kadınlar vs. birer ma' şerdir. Çoğul u \"meaşir\" gelir. Rasulullah (Sallallahu aleyhi ve Sellem)'in: \"Sizin cehennem ehlinin çoğunluğunu teşkil ettiğinizi gördüm\" buyruğuna karşılık kadınlardan: \"Biz neden cehennemliklerin çoğunluğuyuı\" diyen birisi \"cezle\" diye nitelendirilmiştir ki akıl ve görüş sahibi kadın demektir. İbn Bureyd dedi ki: Cezalet, akıl ve vakar demektir. el-Aşir: Aslında bir kimse ile kayıtsız ve şartsız olarak muaşereti (birlikteliği) olan kimse hakkında kullanılır ise de burada kastedilen kocadır. Lubb: Akıl demek olup, aklın kemali kastolunur. Allah Rasulünün: \"İşte aklın noksanlığı budur\" buyruğu, aklın noksanlığının belirtisi budur, demektir. \"Günlerce namaz kılmadan kalır\" yani ay hali sebebiyle günler boyunca namaz kılamaz. Yine ay hali sebebiyle ramazan ayının birkaç gününde oruç tutmaz. Hadisten Çıkartılan Hükümler Hadisteki hükümlere gelince: 1- Bu hadiste birtakım bilgiler yer almaktadır: Sadakanın, iyilik olan işlerin yapılması, çokça mağfiret dilemek vs. itaatlerin yapılmasının teşvik edilmesi bunlar arasındadır. 2- Aziz ve celil Allah'ın buyurduğu gibi: \"Muhakkak iyilikler kötülükleri giderir. \" (Hud, 114) 3- Kocaya ve iyiliğe karşı nankörlük büyük günahlardandır çünkü cehennem ateşi tehdidi masiyetin büyük olduğunun alametleri arasındadır. Nitekim bunu yüce Allah'ın izniyle biraz sonra açıklayacağız. 4- Lanet okumak da aynı şekilde oldukça çirkin masiyetlerdendir fakat hadisten onun büyük bir günah olduğu anlamı çıkmamaktadır çünkü Rasulullah (Sallallahu aleyhi ve Sellem): \"Çokça lanet okursunuz\" buyurmuştur ama küçük günah çokça işlenecek olursa sonunda büyük bir günah olur. Rasulullah (Sallallahu aleyhi ve Sellem) ayrıca: \"Mümine lanet etmek, onu öldürmek gibidir\" buyurmuştur. İlim adamları da lanet okumanın haram olduğunu ittifakla kabul etmişlerdir. Sözlükte lanet, uzaklaştırmak ve kovmak demektir. Şer' i bir terim olarak yüce Allah'ın rahmetinden uzaklaştırmaktır. Durumu ve son nefesinde dünyadan nasıl ayrıldığı kesin olarak bilinmeyen bir kimsenin yüce Allah'ın rahmetinden uzak olduğunu ifade etmek ise caiz değildir. Bundan dolayı ilim adamları şöyle demişlerdir: \"Şer' i bir nas ile onun küfür üzere öldüğünü yahut küfür üzere öleceğini bildiğimiz -Ebu Cehil ve İblis gibi- kimseler dışında Müslüman olsun, kafir olsun, herhangi bir canlı olsun muayyen bir kimsenin lanetlenmesi caiz değildir. Bir niteliğe bağlı olarak lanetlemek ise haram değildir. Saçına saç ekleyen, saç ekleten, döğme yapan ve yaptıranın lanetlenmesi, faiz yiyen, yediren, suret yapanların, zalimlerin, fasıkların, kafirlerin lanetlenmesi, arazinin sınırlarının belirtilerini değiştiren kimselerin lanetlenmesi, gerçek efendilerinden başkalarına ait olduğunu söyleyenlerin, babasından başkasının nesebinden geldiğini ileri sürenlerin, İslam'da olmadık bir işi ortaya çıkartanın yahut büyük bir günah işlemiş kimseyi barındıranın lan etle nmesi ve buna benzer şer'i naslarda muayyen kimseler için değil de niteliklere bağlı olarak lanetlenenlerin lanetlenmesi buna örnektir. Allah en iyi bilendir. 5- Küfür hükmünün kocaya nankörlük, iyiliklerin, nimetin ve hakkın nankörlüğü gibi yüce Allah'ın inkfm dışındaki haller için de kullanılması. İşte buradan bundan önce geçmiş hadislerde zikredilen \"küfür\" ile ilgili yaptığımız yoru~un/tevilin doğruluğu da anlaşılmaktadır. 6- İmanın arttığı ve eksildiği açıklanmaktadır. 7- İmam, çeşitli makam ve mevkilerdeki yöneticiler ve insanlar ileri gelenler, reayalarına öğüt vermeli, onları İslam'ın buyruklarına aykırı hareket etmekten sakındırıp, itaatleri işlemeye teşvik etmelidirler. 8- Öğrencinin, aıime uyanın uyduğu kimseye söylediğinin anlamını kavrayamadığı hallerde soru sorması. Buradaki aklı başında kadının (r.anha) soru sorması gibi. 9- \"Ramazan\" ismini \"ay\"a izafe etmeksizin kullanmak -asıl tercih edilen aya izafetle kullanılması olmakla birlikte- caizdir. Allah en iyi bilendir. İmam Ebu Abdullah el-Mazeri (rahimehullah) dedi ki: Resulullah (Sallallahu aleyhi ve Sellem)'in: ''Aklın eksikliği iki kadının şahitliğinin bir erkeğin şahitliğine denk olmasıdır\" buyruğu ile, bunun arka planına dikkat çekmektedir. Bu da yüce Allah'ın kitab-ı keriminde: \"Biri unutursa diğerine hatırlatsın diye\" (Bakara, 282) buyruğu ile dikkat çektiği husustur. Yani onların belleyişleri azdır. (2/67) (el-Mazeri devamla) dedi ki: İnsanlar aklın mahiyeti hususunda ihtilaf etmişlerdir. İlim olduğu söylendiği gibi, zorunlu birtakım bilgiler olduğu da söylenilmiştir. Bilinenlerin gerçekleri arasında ayırım gözeten güçtür diye de açıklanmıştır. -el-Mazeri'nin sözleri burada bitmektedir.- Derim ki: Aklın gerçek mahiyeti ve kısımları ile ilgili görüş ayrılığı pek çoktur ve bilinen bir husustur. Bunları açıklayarak burada sözü uzatmamıza ihtiyaç yoktur. Aklın yeri hususunda da ihtilaf etmişlerdir. Bizim (mezhebimize mensup) kelamcılar kalptedir demişlerdir. Bazı ilim adamları ise o baştadır demiştir. Allah en iyi bilendir. Hadiste Kadınlar İle İlgili Nitelemelerin Anlamı Nebi (Sallallahu aleyhi ve Sellem)'in kadınları namazı ve orucu ay hali zamanlarında terk etmeleri sebebiyle dinlerinin eksik olmasıyla nitelendirmesinin anlaşılmasında zorlukla karşı karşıya kalınabilir ama bunun anlaşılması zor değil, aksine gayet açıktır. Şüphesiz ki dil, iman ve İslam daha önce birkaç yerde açıkladığımız gibi bir anlamda ortaklıkları vardır. Yine birkaç yerde açıkladığımız gibi itaatlere de iman ve din denilir. Bu husus sabit olduğuna göre ibadeti çok olanın imanının ve dininin de artış göstereceği, az olanın da dininin eksileceği sabit olmaktadır. Diğer taraftan din eksikliği bazen kişinin günaha girmesine sebep olabilir. Namazı, orucu ya da diğer farz ibadetleri mazeretsiz terk etmek gibi. Bazen de günahı gerektirmeyen bir şekilde sözkonusu olabilir. Cumayı, gazaya çıkmayı ya da daha başka farz olan ibadetleri mazereti sebebiyle terkedenin durumu gibi. Bazı hallerde de bu terk kendisinin bununla mükellef olduğu şekilde sözkonusu olabilir. Ay hali kadının namazı ve orucu terk etmesi gibi. Şöyle bir soru sorulabilir: Kadın ay hali iken namazı ve orucu eda etmemekte mazur görüldüğüne göre, ay hali süresince -onun kazasını yapmasa dahi- namaz sevabını alır mı? Hasta ve yolcu kimsenin sağlıklı iken ve ikamet halinde iken kıldığı nafile namazıarının aynısı, yolculuğunda ve hastalığında hasta ve yolcuya sevap olarak yazıldığı gibi yazılır mı? Cevap: Bu hadisin zahirine göre ay hali olan kadına bunların sevabı yazılmaz. Aradaki fark şudur: Hasta ve yolcu bu nafile ibadetleri bunları eda etme ehliyeti ile birlikte sürekli olarak yapmak niyetiyle yerine getiriyordu. Ay hali olan kadının durumu ise böyle değildir. Aksine o kadının niyeti ay hali zamanlarında namazı terk etmektir. Hatta ay halinde iken namaz kılmaya niyet etmesi ona haramdır. Nafile namazıarını onları devamlı kılmak niyetini taşımaksızın bazen kılıp, bazen kılmayan yolcu yahut hastanın hali de buna benzemektedir. Böyle bir kimsBye nafile namaz kılmadığı zamanlardaki yolculuğu ve hastalığı esnasında ona (nafilelerini kılmış gibi) sevap yazılmaz. Allah en iyi bilendir. Baptaki Hadislerin Senetleri İbnu'l-Had: Adı Yezid b. Abdullah b. Usame'dir. Usame, \"el-Had\"ın kendisidir çünkü o misafirlerin ve yoldan geçenlerin ona doğru yol bulmaları için ateş yakardı. Bu lafzı muhaddisler bu şekilde \"el-Had\" diye telaffuz ederler, bir söyleyişe göre sahihtir ama Arapça' da tercih edilen sonuna ye getirmek suretiyle \"el-Hadi\" denilmesidir. Bu hususları kitabın mukaddimesinde ve başka yerlerde sözkonusu etmiştik. Allah en iyi bilendir. Ebu Bekr b. İshak'ın adı Muhammed'dir. İbn Ebu Meryem ise (2/68) Said b. Hakem b. Muhammed b. Ebu Meryem el-Cumahi Ebu Muhammed el-Mısri' dir. Pek değerli, üstün, fakihtir. Amr b. Ebu Amr, el-Makburi' den rivayetinde geçen buradaki \"elMakburi\"nin kim olduğu hakkında ihtilaf edilmiştir. Acaba bu Ebu Said elMakburi midir yoksa onun oğlu Said midir? Çünkü bunların her birisine -asıl el-Makburi Ebu Said olmakla birlikte- el-Makburi denilir. Hafız Ebu Ali elGassani el-Ceyyani, Ebu Mesud es-Sekafi' den şöyle dediğini nakletmektedir: Burada kasıt Ebu Said' dir. Ebu Ali dedi ki: Bu husus ise ancak İsmail b. Cafer'in, Amr b. Ebu Amr'dan diye naklettiği rivayetindedir. Darakutni dedi ki: Ona Süleyman b. Bilal muhalefette bulunarak bu hadisi Amr'dan, o Said el-Makburi'den diye rivayet etmiştir. Darakutni dedi ki: Süleyman b. Bilal'in sözü ise daha sahihtir. Şeyh Ebu Amr b. es-Salah (rahimehullah) dedi ki: Bunu Ebu Nuaym elAsbahani, el-Muharrac ala Sahih-i Müslim adlı eserinde razı olunan çeşitli yollardan İsmail b. Cafer'den, o Amr b. Ebu Amr'dan, o Said b. Ebu Said el-Makburi' den diye bu şekilde açık seçik bir şekilde rivayet etmiş bulunmaktadır ama biz bu hadisi Müslim'in Sahihine muharrec özelliğindeki Ebu Avane'nin Müsnedinde İsmail b. Cafer, Ebu Said yoluyla, Süleyman b. Bilal de Ebu Said yoluyla -az önce Darakutni'den geçtiği gibi- rivayet etmiş bulunmaktayız. O halde buna itimat edilmelidir. İbnu's-Salah'ın açıklamaları buraya kadardır. \"el-Makburi\" nispeti be harfi ötreli ve fethalı (el-Makberi) şeklinde de söylenir. Bu hususta meşhur iki okuyuştur. Bu da (kabristan demek olan) makbure'ye nispettir. Bunun da be harfi ötreli, fethalı ve kesreli olmak üzere üç söyleyişi vardır ki üçüncüsü gariptir. İbrahim el-Harbi ve başkaları der ki: Ebu Said kabirlere inerdi. Bundan dolayı ona el-Makburi denildi. Evinin kabristanın yakınında olduğu (ve bundan dolayı ona bu nispetin verildiği de) söylenmiştir. Yine denildiği üzere Ömer b. el-Hattab (radıyalliıhu anh) onu kabirlerin kazılmasının işinin başına tayin etmişti. Bundan dolayı ona el-Makburi denildi. Nuaym'ı ise mescit1erin kokulandırılmasından sorumlu olarak görevlendirmişti. Bundan dolayı da ona Nuaym el-Müeemmir (tütsüleyid, buhurlayıeı Nuaym) denilmiştir. Ebu Said'in adı Keysan (nispeti el-leysi) el-Medeni'dir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 149
			}
		}
	]
}