{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2452,
			"arabicnumber": "1064.02",
			"text": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Abdülvahid, Umaratü'bnü Ka'kaa'dan rivayet etti. (Demişki): Bize Abdurrahman b. Ebİ Nu'm rivayet etti. (Dediki): Ebû Saîdi Hudri'yi şunu söylerken dinledim: Alîyyü'bnü Ebî Talib, Yemen'den Resulullah (Sallallahu Aleyhi ve Sellem)'e tabaklanmış bir meşin torba içinde henüz toprağından tasfiye edilmemiş altın külçesi gönderdi. O da, bunu dört kişi (yani) Uyeynetü'bnu Hısn Akra' b. Habis, Zeydü'l-Hayl —dördüncüsü de ya Alkametü'bnu Ulase yahut Amiru'bnü Tufeyl olacak— arasında taksim etti. Bunun üzerine Ashabından biri: — «Biz, bu altına bunlardan daha layık idik.» dedi. Bu söz Nebi (Sallallahu Aleyhi ve Sellem)'in kulağına vardı da: «Ben, semadakller nezdinde emîn olduğum akşam sabah bana semadan haber geldiği halde sîz bana emniyet etmiyor musunuz?» buyurdu. Derken çukur gözlü, çıkık şakaklı, geniş alınlı, gür sakallı, başı tıraşlı ve gömleği yukarıya çekik bir adam kalkarak: — «Ya Resûlallah! Allah'tan kork.» dedi. Resulullah (Sallallahu Aleyhi ve Sellem)' «Yazık sana. Ben yeryüzündeki insanların Allah'tan korkmaya en layık olanı değilniyim?» buyurdu. Sonra adam dönüp gitti. Arkasından Halidü'bnu Velîd: «Ya Resûlallah! Şunun boynunu vuruvereyim mi?- dedi. Resûlullah (Sallallahu Aleyhi ve Sellem): — «Hayır, belki ileride namaz kılan bir kimse olur. buyurdu. Halid: — «Nice namaz kılan var ki: Kalbinde olmayanı dili ile söylüyor.» dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) — «Ben, ne İnsanların kalplerini açmaya me'mûrum ne de karınlarını yarmaya!» buyurdu. Sonra gitmekte olan o adama bakarak: — «Muhakkak bu adamın sülalesinden öyle bir kavim zuhur edecek ki, Allah'ın kitabını kolaycacık okuyacaklar, (fakat) okudukları gırtlaklarını geçmiyecek; dinden ok'un avı delip geçtiği gibi çıkacaklar.» buyurdular. Ravî: «Zannederim: Ben, onlara yetişsem kendilerini mutlaka Semûd kavminin tepelendiği gibi tepelerdim; buyurdu.» demiş",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 189
			}
		}
	]
}