{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2481,
			"arabicnumber": "1072.01",
			"text": "Bana Abdullah b. Muhammed b. Esma' Ed-Dubai rivayet etti. (Dediki): Bize Cüveyriye, Mâlik'den, o da Zühri'den naklen rivayet etti; Zührî'ye de Abdullah b. Abdullah b. Nevfel b. Haris b. Abdilmuttalib rivayet etmiş, ona da Abdülmuttalib b. Rabîate'bni Haris rivayet eylemiş; Demişki: Rabîatü'bnu Haris ile Abbâs b. Abdilmuttalib bir yere gelerek: — «Vallahi şu iki oğlanı —bunu ben ile Fadl b. Abbâs için söylediler.— Resulullah (Sallallahu Aleyhi ve Sellem)'e göndersek de, onunla konuşsalar. Kendilerini bu sadakalar üzerine me'mûr tâyin etse onlar da başka me'mûrların gördükleri vazifeyi eda etse ve onların aldığı maaştan bunlar da alsa (çok iyi olur.)» dediler. Onlar, bu sözleri konuşurken Alîyyu'bnü Ebî Tâlib geldi ve yanlarında durdu. Mes'eleyi ona da söylediler, Alîyyu'bnü Ebî Tâlib: — -Vazgeçin! Vallahi Nebi (Sallallahu Aleyhi ve Sellem) bunu yapmaz.» dedi. Rabîatü'bnü Haris hemen itiraz ederek: — -Vallahi sen, bunu ancak bize hasedinden dolayı yapıyorsun. Vallahi Resûlullah (Sallallahu Aleyhi ve Sellem)'in dâmâdlığına nail oldun da biz yine sana hased etmedik.» dedi. Alî: — «(Pek Ala) onları gönderin!» dedi. Gönderilen gençler gittiler, Alî de biraz uzandı. Resulullah (Sallallahu Aleyhi ve Sellem) öğleyi kılınca ondan önce odasına giderek orada bekledik; Resulullah (Sallallahu Aleyhi ve Sellem) geldi ve bizim kulaklarımızı çektikten sonra: — «Gönlünüzde olanları çıkarın bakalım;» buyurdu. Sonra içeri girdi, biz de yanına girdik. O gün kendisi Zeyneb binti Cahş'ın yanında bulunuyordu. Biz sözü birbirimize havale ettik sonra birimiz konuştu; Dediki: — «Ya Resûlallah! Sen insanların en iyisi ve en yardım severisin. Biz artık buluğ çağına ermiş bulunuyoruz. Şu sadaka işlerinin, bâzısına bizi me'mûr tâyin etmen için geldik. (Edersen) biz de sair me'murlar gibi vazifemizi ifâ eder, onlar gibi maaş alırız.» Resulullah (Sallallahu Aleyhi ve Sellem) uzun bir sükûta daldı hattâ kendisiyle konuşmak istedik. Zeyneb bize perdenin arkasından: — «Ona söz etmeyin.» diye işaret etmeye başladı. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdular: — «Şüphesiz ki sadaka Âl-i Muhammed'e lâyık değildir. O, ancak insanların kirleridir. Siz, bana Mahmîye ile Nevfel b. Haris b. Abdilmuttalib'i çağırın!» Mahmîye ganimetlerin beşte biri üzerine me'mûrdu. Bunlar (çağrılıp) geldiler. Resulullah (Sallallahu Aleyhi ve Sellem) Mahmîye'ye: — «Bu gence kızını ver!» diyerek Fadl b. Abbâs'ı gösterdi. Mahmîye de kızını ona nikahladı. Nevfel b, Hâris'e dahî: — «Şu gence kızını ver.» buyurarak bana işaret etti; o da kızını bana nikahladı. Mahmîye'ye: — «Her iki kıza ganimetlerin beşte birinden şu kadar ve şu kadar mehir ver.» buyurdular. Zührî: «Abdullah, bana mehîrin miktarını söylemedi.» demiştir",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 218
			}
		}
	]
}