{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 256,
			"arabicnumber": "85.05",
			"text": "Bize Osman b. Ebu Şeybe rivayet etti. (Dediki): Bize Cerir, el-Hasen b. Ubeydillâh'dan, o da Ebu Amr eş-Şeybânî'den, o da Abdullah'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen onun : \"Amellerin -yahut amel türünün- en faziletIisi vaktinde kılınan namaz ve anne babaya iyiliktir. \" 244 – 252 DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın NEVEVİ ŞERHİ (244-252 numaralı hadisler): Bu baptaki hadisler: \"Ebu Hureyre (224, 245), Ebu Zerr (246, 247) ve Abdullah b. Mesud (248-252) (r.a.um)'dan rivayet edilmiştir. (Sahabi) dedi ki: Resulullah (Sallallahu aleyhi ve Sellem)' e: \"Amellerin en faziletlisi hangisidir\" diye soruldu. O: ''Allah'a imandır\" buyurdu. Sonra hangisidir diye soruldu. O: ''Allah yolunda cihaddır\" buyurdu. Sonra hangisidir soruldu. O: \"Mebrur bir hacdır\" buyurdu. Bir başka rivayette, Nlah'a ve Resulüne imandır. Bir diğer rivayette, Nlah'a iman ve onun yolunda cihaddır, şeklindedir. \"(Hürriyetine kavuşturmak için) en faziletli köle hangisidir, dedim. O: \"Sahiplerine göre daha nefis olanları ve daha pahalı olanları\" buyurdu. Ben: Yapamayacak olursam dedim. O: \"Bir iş yapan bir kimseye yardımcı olursun ya da yapamayan yerine sen yaparsın\" buyurdu ... \"Çünkü bu senin kendine bir sadakandır\" buyurdu. ez-Zührl'nin rivayetinde ise (elif, lam ile) \"iş yapana yardım edersin yahut yapamayan adına yaparsın\" şeklindedir. Bir başka rivayette: En faziletli am el hangisidir, sorusuna: \"Vaktinde kılınan namazdır\" buyurdu. Sonra hangisidir, dedim. O: ''Anne babaya iyiliktir\" buyurdu. Sonra hangisidir dedim. O: \"Allah yolunda cihaddır\" dedi. (2/73) Ona daha fazla soru sormayı ona acıdığım için bıraktım. Diğer rivayette: Ona daha fazlasını sorsaydım, o da bana daha fazlasını söyleyecekti, denilmektedir. Bir başka rivayette: Cennete daha çok yakın{laştırıcı) amel hangisidir. Allah Rasulü: Vakitlerinde kılınan namazdır buyurdu. Sonra hangisidir dedim. O, anne babaya iyiliktir buyurdu. Sonra hangisidir dedim. O, Allah yolunda cihaddır buyurdu. Diğer rivayette de: Amellerin en faziletlisi vaktinde kılınan namaz ve anne babaya iyilik yapmaktır, şeklindedir. Bunlar hadis metinlerinin lafızlarıdır. Rical isimlerine gelince, bu başlıkta Ebu Hureyre, Ebu Zerr, Mansur b. Ebu Müzahim, İbn Şihab, Said b. el-Müseyyeb, Ebu'r-Rabi' ez-Zehranı, Ebu Muravih ve eş-Şeybani'den, o Velid b. el-Ayzar'dan, o Sa'd b. Iyas Ebu Amr eş-Şeybani'den ve ayrıca Ebu Ya'fur geçmektedir. Hadislerin Lafızları İle İlgili Açıklamalar: \"Mebrur hac\" Kadı lyaz (rahimehullah) dedi ki: Şemir dedi ki: Bu hiçbir günahın kendisine karışmadığı hacdır. Yeminini bozmayacak olursa, aynı şekilde satışında aldatmayacak olursa da bu kök kullanılır. Mebrurun kabul edilen anlamında olduğu da söylenmiştir. el-Harbi dedi ki: Be harfi ötreli olarak: \"Cr. ~) Haccın mebrur olsun\" denilir. Be harfi fethalı olarak da: \"(~ .uı\\..r.) Haccını Allah mebrur kılsın\" denilir. Haccın makbul ve ecir kazanmış olarak dönmüş olasın (anlamında bir dua)dır. Hadis-i şerifte de: \"Mebrur hac, yemek yedirmek ve güzel söz söylemektir\" buyurulmuştur. Buna göre bu da güzel iş yapmak demek olan am el türündendir. Anne babaya ve müminlere bin ile (iyilikle) davranmak da buradan gelmektedir. Mebrurun yüce Allah için ihlasla ve doğrulukla yapılan amel anlamında olması da mümkündür. Kadı lyaz'ın açıklamaları burada sona ermektedir. Mebrur hac Kabul edilen hacdır, diyenlerin açıklamaları bir amelin kabul olduğu bilinemez gerekçesi ile açıklanması zor görülebilir. Bunun cevabı da hacdan sonra daha çok hayır yapması kabulün alametlerindendir, diye verilmiştir. \"Sahiplerine göre en değerli olanları\" daha üstün ve daha iyi kabul edilenleri demektir. Esmaı \"nefis bir mal\" ifadesi beğenilen mal demektir. Allah Rasulünün: \"Bir iş yapan kimseye yardım yapamayana sen yaparsın\" buyruğunda geçen \"el-ahrak: bir iş beceremeyen, bir sanat sahibi olmayan, iş yapamayan\" demektir. Herhangi bir sanatı olmayan bir erkek için \"ahrak\", kadın için de \"harka\" denilir. Eğer adam maharetli bir sanatkar ise \"raculün sana''', kadın için de \"imraatun sanna\" denilir. Rivayetlerin birinde \"bir iş yapan\" anlamındaki lafız elif, lam'sız geldiği halde diğerinde elif, lam'lı olarak \"sa'na': iş yapan\" şeklinde gelmiştir. Her iki rivayette sanattan gelmek üzere sad harfi ile rivayet edildiği gibi, kaybolmak demek olan (t..~I)'den gelen bir kelime olarak \"daı\" olarak da rivayet edilmiştir. Ancak alimlere göre sahih olan sad harfi ile rivayetidir fakat dat ile rivayet daha çoktur. Kadı Iyaz (rahimehullah) dedi ki: Bu lafızda bizim Hişam yoluyla rivayetimiz ilk olarak dat harfi iledir. Dolayısıyla bu lafız muayyen olarak (WW) kaybolmuş lafzıdır. Diğer rivayette de bu şekildedir. Buna göre bizim Müslim'den bize kadar ulaşan bütün rivayet yollarımızda Hişam ve ez-Zührı yoluyla gelen hadis muayyen olarak bu lafızia gelmiş bulunmaktadır. Ancak Ebu'l-Feth eşŞaşi'nin, Abdulgafir el-Farisi'den rivayeti müstesnadır. Hocamız Ebu Bahr bize kendisinden her iki yerde de sad harfi ile tahdis etmiştir. Bir iş yapamayan anlamındaki \"el-ahrak\"ın karşıtı olması bakımından doğru ifade bu olmalıdır. Anlam itibariyle kaybolmuş birisine yardımcı olmak doğru olsa bile burada rivayet Hişam'dan sad harfi ile (sani': iş yapan şeklinde) sahih olarak gelmiştir. Biz bunu Buhari'nin Sahihinde de böylece rivayet etmişizdir. İbnu'l-Medini dedi ki: ez-Zühri de bunu sanat sahibi anlamında sad harfi ile \"es- sani'\" diye rivayet etmektedir. Alimlerin görüşlerine göre bu kelimeyi dat harfi ile kaybolmuş anlamında tashif yapıp değiştiren Hişam'dır. Darakutni de Ma'mer'den naklen dedi ki: ez-Zührı, Hişam tashif yapmıştır, derdi. Darakutni dedi ki: Hişam'ın rivayetinde: \"Bir iş yapana yardım edersin\" lafzı sad ve nun iledir. İki hafız Ebu Amir el-Abderi ile Ebu'l-Kasım b. Asakir' in asıllarında da böyledir. Esasında sahih olan da budur fakat Hişam b. Urve'nin rivayetinde böyle değildir. Onun rivayetinde bu kelime (iş yapan anlamındaki sani' kelimesi) dat iledir. Müslim'in bundan başka yoldan gelen rivayetinde Hişam'ın bu rivayeti bu şekilde kaydedilmiştir. ez-Zührl'den gelen diğer rivayette ise \"iş yapana yardım edersin\" rivayeti ise sad iledir, bu da aynı şekilde ez-Zühri'den mahfuz olarak gelmiştir. Hişam'ın da tashif yaptığını ifade ederdi. (İbnu's-Salah devamla) dedi ki: Kadı Iyaz da (2/75) bunun Müslim'in kitabını rivayet edenlerin naklettiği üzere ez-Zührl'nin rivayetinde dat ile olduğunu, bundan tek istisnanın Ebu'l-Feth es-Semerkandi'nin ki olduğunu zikretmektedir. (İbnu's-Salah) dedi ki: Fakat durum bizim Müslim'in kitabı ile ilgili asıllarımızın rivayetinde onun naklettiği şekilde değildir. Hepsinde ez-Zühd'nin rivayetinde sad ile kayıtlı bulunmaktadır. Allah en iyi bilendir. ''Ana babaya iyilik\" onlara iyilikte bulunmak, onlara güzel davranmak, onları memnun edecek işler yapmak demektir. Sahih hadiste belirtildiği üzer~ onların arkadaşlarına iyilik yapmak da bunun kapsamı içerisindedir: \"Şüphesiz ki bir kimsenin babasının sevdiği kimseleri gözetmesi, iyiliğin en iyilerindendir. \" Birr (iyilik)in zıttı ise 'ukuk (kötü davranmak) dur. Yüce Allah'ın izniyle biraz sonra bunun da açıklaması gelecektir. Dilciler der ki: Birr ile davranan iyi kimseye \"berr ve barr\" denilir. Berr'in çoğulu da ebrar, barr'ın çoğulu ise berere diye gelir. \"Ona acıdığım için daha fazla sormayı bıraktım.\" Onu daha çok yormamak için, ona ağır gelmemesi için, ona şefkatimden böyle yaptım, demektir. Allah en iyi bilendir. Ricalinin isimlerine gelince, Ebu Hureyre'nin adı sahih olan görüşe göre Abdurrahman b. Sahr'dır. Açıklaması daha önce geçti. Ebu Zerr'in adı hakkında ihtilaf edilmiştir, daha meşhur olan Cündüb (Cündeb de söylenebilir) b. Cunade olduğudur. Adının Bureyr olduğu da söylenmiştir. Mansur b. Ebu Muzahim'in isminde \"Muzahim\" ze ve ha iledir. Buhari ve Müslim'in Sahihlerinde bu surette bulunan bütün isimler bu şekilde za ve ha ile \"Muzahim\" şeklindedir. İsim olarak re ve cim ile \"Muracim\" ismi de geçmektedir ki el-Avvam b. Muracim bunlardan birisidir. Burada geçen Mansur'un babasının künyesi olan Ebu Muzahim'in adı ise Beşir'dir. İbn Şihab daha önce birkaç defa geçmişti. Adı Muhammed b. Müslim b. Ubeydullah b. Abdullah b. Şihab'dır. İbnu'l-Museyyeb de aynı şekilde birkaç defa geçmişti. Meşhur olanın Müseyyeb'in ye harfinin fethalı olduğudur. Kesreli okunduğu da söylenmiştir. Ebu'r-Rabi ez-Zehranl'nin adı daha önce geçtiği gibi Süleyman b. Davud'dur. Ebu Muravih' e gelince, İbn Abdilberr dedi ki: Sika olduğunu icma ile kabul etmişlerdir ama ismine vakıf olunmamıştır. İsmi künyesidir. Şu kadar var ki Müslim b. el-Haccac onu et-Tabakat'ında sözkonusu etmiş ve adı Sad'dır demiştir. Künyeler arasında onu sözkonusu ettiğinde ise adını zikretmemiştir. Nispeti itibariyle el-Gıfari olduğu söylendiği gibi, el-leysi olduğu da söylenir. Ebu Ali el-Gass2mi ise el-Gıfari sonra el-leysi nispetlidir. Velid b. el-Ayzar'dan rivayet nakleden eş-Şeybani'ye gelince, bu da Ebu İshak Süleyman b. FeyrCız el-KCui'dir. Ebu Ya'fur'un adı Abdurrahman b. Ubeyd b. Nistas es-Sa'lebi eı-Amiri elBekkari' dir. el-Bikari diye de söylenir. el- Bekkari el-KCıf! de söylenir. \"Nistas\" ismi munsarıf değildir. Burada geçen Ebu Ya'fur, \"el-Asğar\" vasıflıdır. Yine Müslim bunu aynı şekilde RükCıda tatbik babında da zikretmiş bulunmaktadır. Diğer kaynakların ravileri arasında ise Ebu Ya'fur el-Ekber el-Abdi el-KCıfi vardır. Tabiindendir, adı Vakid'dir (2/76). Vakdan olduğu da söylenmiştir. Müslim de bunu aynı zamanda Vitir namazı babında zikretmiş, isminin Vakid, lakabının da Vakdan olduğunu belirtmiştir. Yine kaynaklarda Ebu Ya'fur diye anılan üçüncü bir şahıs daha vardır ki bunun da adı Abdurrahman b. Ya'fur el-Cu'f! el-Basri' dir. Kendisinden Kuteybe, Yahya b. Yahya ve daha başkaları rivayet nakleder. Burada Ya'fur'un adı geçen üç babası da sikadır. Velid b. el-Ayzar'ın adı ise ayn harfi elif'ten önce ze sonrasında da re iledir. Müslim (rahimehullah)'ın (247): \"Bize Ma'mer, ez-Zühri'den haber verdi... Ebu Muravih'den, o Ebu Zerr'den\" senedinde isnad inceliklerinden bir incelik bulunmaktadır. O da bu senette tabiinden biri diğerinden rivayet nakleden dört tabiinin bir arada bulunmasıdır. Bu dört kişi de ez-Zühri, Habib, Urve ve Ebu Muravih' dir. Bunlardan ez-Zühri, Urve ve Ebu Muravih tanınan tabiin şahsiyetlerdir. Urve'nin azatlısı Habib'e gelince o da Ebu Bekr es-Sıddık (r.a.)'ın kızı Esma (r.anha)'dan rivayet nakletmiştir. Muhammed b. Sa'd dedi ki: Urve'nin azatlısı olan bu Habib Umeyye oğulları yönetiminin son zamanlarında vefat etmiştir. Dolayısıyla bununla birlikte Esma' dan da rivayet nakletmiş olmasının zahirinden anlaşıldığı üzere o hem Esma'ya yetişmiştir, hem de ondan başka diğer sahabilere de yetişmiştir. Böylelikle tabiinden olur. Allah en iyi bilendir. Hadislerin Anlamları ve Fıkhi Hükümleri Bu hadislerin bu anlamda gelmiş diğer hadislerle birlikte anlaşılmaları zor gelebilir çünkü Ebu Hureyre'nin rivayet ettiği hadiste en faziletli amelin, Allah'a iman sonra cihad sonra hac; Ebu Zerr'in rivayetinde iman ve Cihad, İbn Mesud'un rivayetinde namaz sonra anne babaya iyilik sonra cihad olduğunu sözkonusu etmiştir. Daha önce Abdullah b. Amr'ın rivayet ettiği hadiste de: \"İslam'ın hangi ameli hayırlıdır\" sorusuna Allah Rasulü: \"Yemeği yedirmen, tanıdığın ve tanımadığın herkese selam vermendir\" buyurduğu geçmişti. Ebu Musa ve Abdullah b. Amr'ın rivayet ettikleri hadiste: Müslümanların hangisi hayırlıdır sorusuna da: \"Müslümanlann dilinden ve elinden esen kaldığı kimsedir\" buyurmuştur. Osman (r.a.)'dan rivayet edilen sahih hadiste de: \"En hayırlınız Kur'an'ı öğrenen ve onu öğretendir\" ve buna benzer sahihte pek çok hadis daha vardır. İlim adamları bu hadislerin bir arada nasıl anlaşılacağı hususunda ihtilaf etmişlerdir. Pek büyük imam Ebu Abdullah el-Halim! eş-Şafii, hocası imam ve büyük ilim adamı sağlam dirayetli Ebu Bekr el-Kaffal el-Şaşi el-Kebir' den -ki bu bizim mezhebimize mensup Horasanlı müteahhir alimlerimizin kitaplarında adı geçen el-Kaffal es-Sağir el-Mervezi'den başka birisidir- naklederek el-Halimi şunları söylemektedir: el-Kaffal benim çağının alimleri arasında karşılaştığım en alim kişidir. O bu gibi hadisleri iki şekilde anlamıştır: 1- Bu durumların ve kişilerin farklılıklarına göre verilen farklı cevaplardan ibarettir. Çünkü eşyanın en hayırlı olanı budur, denilmekle birlikte bütün yönlerden, bütün durumlarda ve şahıslar için her şeyin en hayırlısının o olduğu kastedilmeyebilir. Aksine bu hayırlılık kimi halde ve durumda böyle olsa da başkalarında böyle değildir. Buna da çeşitli rivayetleri tanık olarak göstermiştir. Bunlardan birisi İbn Abbas (r.a.)'ın rivayet ettiği Rasulullah (Sallallahu aleyhi ve Sellem)'in şu buyruğudur: \"Hac etmemiş kimse için bir defa hac etmek kırk gazaya katılmaktan üstündür. Hac etmiş kimse için de bir gazaya katılmak kırk defa hac etmekten üstündür.\" 2- Bundan amellerin en faziletlilerinden birisi yahut en hayırlılarından birisi yahut sizin en hayırlılarınızdan birisi şunu yapandır demek olabilir. Burada kastedilmekle birlikte \"kişi\" lafzı hazfedilmiştir. Nitekim filan kimse insanların en akıllı ve en faziletli olanlarıdır. (2/77) denilmekle birlikte en akıllılarından ve en faziletlilerinden olan kimse kastedilir. İşte Rasulullah (Sallallahu aleyhi ve Sellem)'in: \"En hayırlınız ailesine en hayırlı olanınızdır\" buyruğu da bu türdendir. Böyle bir kimsenin kayıtsız ve şartsız olarak insanların en hayırlısı olamayacağı bilinen bir husustur. Alim bir kimseye insanlar arasında en az rağbet gösterenler onun komşularıdır, sözleri de bu türdendir. Halbuki başkaları arasında kendisine alimden daha da az rağbet gösterenler de olabilir. el-Kaffal (rahimehullah)'ın sözleri burada sona ermektedir. Bu ikinci açıklamaya göre iman kayıtsız ve şartsız olarak amellerin en faziletlisi olur, diğerleri ise amellerin ve hallerin en faziletlileri arasında olmak bakımından birbirlerine eşit olurlar. Bundan sonra ise birinin diğerine üstünlüğü buna delil olan delaletlerle anlaşılır ve durumların ve şahısların farklılığına göre de farklılık gösterir. Soru: Bu rivayetlerin bazılarında en faziletlileri şudur sonra şudur denilerek \"sonra\" lafzı getirilmiştir. Bu laflZ ise sıralamayı bildirmek için kullanılır. Cevap: Burada \"sonra\" lafzı sözkonusu edilişIerindeki bir sıralama içindir. Yüce Allah'ın: \"O sarp yokuşun ne olduğunu sen nereden bileceksin? O kul azad etmektir yahut açlığın çok olduğu bir günde yemek yedirmektir. Akrabalığı olan bir yetime yahut topraklara düşmüş bir yoksula. Bundan sonra da iman edenlerden ... olmasıdır.\" (el-Beled, 12-17) Bilindiği gibi burada \"sonra\" iman fiilinin sırasını anlatmak için değildir. Nitekim yüce Allah bir başka yerde şöyle buyurmaktadır: \"Deki: Gelin, Rabbinizin size neleri haram kıldığını okuyayım: Ona hiçbir şeyi ortak koşmayın, anaya babaya iyilik edin, yoksulluk endişesinden dolayı çocuklarınızı öldürmeyin ... \" (En'am, 151-153) buyurduktan sonra: \"Sonra biz Musa'ya kitabı verdik.\" (En' am, 154) buyurmaktadır. Yüce Rabbimizin: '1\\ndolsun ki sizi yarattık, sonra size şekil verdik sonra da meleklere: Adem'e secde edin dedik.\" (!\\raf, 11) buyruğu da böyledir. Bunun benzerleri pek çoktur. Yine bu hususta şu beyiti de örnek gösterirler: \"Sen efendi ve baş olana sonra babası baş olana Sonra bundan önce dedesi de baş olana deki:\" Kadı Iyaz da bu gibi hadislerin bir arada iki türlü anlaşılabileceğini sözkonusu etmiştir: 1- Bunların biri az önce naklettiğimiz iki yoldan birincisine yakın bir açıklamadır. Şöyle diyor: Durumların değişmesi dolayısıyla verilen cevap da farklılık göstermiştir, diye açıklanmıştır. Bu sebeple o her bir gruba kendileri için ihtiyaç olan şekilde cevap vermiştir yahut henüz tamamlamadıkları ve ona dair bilginin kendilerine ulaşmadığı hususları söylemiştir. 2- Cihadı haccın önüne geçirmesinin sebebi İslam'ın ilk dönemlerinde İslam düşmanları ile savaşıldığı ve İslam'ın üstün gelmesi için gayret gösterilmesi gerektiği bir zamanda bulunulmasından dolayı idi. et-Tahrir sahibi bu ikinci açıklamayı sözkonusu etmiş, ayrıca bir başka açıklama daha dile getirerek \"sonra\" bir sıralamayı gerektirir fakat bu Arap dilbilginleri ve usul alimleri nezdinde şaz bir görüştür, demiştir. Sonra et-Tahrir sahibi şunları söyler: Doğrusu bunun, savaşa mecbur eden bir halolan düşmanın saldırması ve umumi seferberlik zamanındaki cihad hakkında yorumlanmasıdır. İşte böyle bir zamanda cihad herkese farzdır. Durum böyle olduğuna göre elbette hacca göre cihadın öne alınması ve daha çok teşvik edilmesi gerekir çünkü cihadda Müslümanların genel masIahatı vardır. Ayrıca böyle bir durumda cihad hacdan farklı olarak farz-ı ayndır ve yapılması gereken zamanı da sınırlıdır. Allah en iyi bilendir. (244) \"Ona, hangi am el daha faziletlidir, diye sorulunca, O: ''Allah'a ve Rasulüne imandır\" buyurdu.\" Bu cevapla amelin iman hakkında kullanılacağını ve amel ile imanın kastedilebileceğini açıkça ifade etmektedir. Allah en iyi bilendir. Burada sözü edilen iman kendisiyle İslam dinine girilen imandır. Bu ise kalbiyle tasdik ve şaha.det kelimelerini söylemektir. Tasdik etmek kalbin amelidir, söylemek ise dilin amelidir. Burada diğer organlarla yapılan ameller imanın kapsamına girmez. Oruç, namaz, hac, cihad ve benzeri ameller gibi. (2/78) Çünkü cihadı ve haccı da ayrıca sözkonusu etmiş bulunmaktadır. Ayrıca Resulullah (Sallallahu aleyhi ve Sellem)'de: ''Allah'a ve Rasulüne imandır\" diye cevap vermiştir. Ameller ile ilgili olarak ise bu söylenemez. Bununla beraber böyle olması sözü geçen am ellere iman adının verilmesine de engel değildir, bunun delillerini de daha önceden açıklamış bulunmaktayız. (246) Köleler ile ilgili olarak \"sahiplerine göre en değerlileri ve en pahalı olanları\" buyruğundan kasıt -Allah en iyi bilendir- şudur: Eğer tek bir köleyi hürriyetine kavuşturmak istiyorsa bu böyledir fakat mesela bin dirhemi bulunup, onunla daha az değerli iki köle de alabilir, değerli tek bir köle de alabilir. Bu durumda iki köle -kurbanlıktakinin aksine- daha faziletlidir çünkü semiz bir koyunu kurban etmek ondan daha az semiz iki koyun kurban etmekten daha faziletlidir. Mezhep alimlerimizden Beğavi (rahimehullah) et-Tehzib'de bu iki meseleyi benim de kaydettiğim şekilde zikrettikten sonra şöyle söylemektedir: Şafii (r.a.) kurbanlık hakkında şöyle demiştir: Sayıca az olmakla birlikte, değerin çokluğunu, değeri az olmakla birlikte, sayının çokluğundan daha çok severim. Köleyi hürriyetine kavuşturmakta ise değerin azlığı ile birlikte sayının çok olmasını, sayının azlığı ile birlikte değerin çokluğundan daha çok severim çünkü kurbanlıkta kasıt ettir, semiz olanın eti daha bol ve daha hoştur, köleyi hürriyetine kavuşturmaktan maksat ise kişinin durumunu, eksikliğini giderip kemale erdirmek ve onu köleliğin zilletinden kurtarmaktır. Bir topluluğu bu şekilde kurtarmak, tek bir kişiyi kurtarmaktan daha faziletlidir. Allah en iyi bilendir. Hadisten Anlaşılan Hükümler Hadisten çıkartılacak hükümlere gelince: 1- Namazın vaktinde kılınmasına dikkat ve özen gösterilmesine teşvik vardır. 2- Namaz adına ihtiyat ve vaktinde kılınması için eli çabuk tutmak özelliğinden ötürü namazın ilk vaktinde kılınmasının müstehap olduğu buradan çıkartılabilir. 3- Soru sorarken güzel bir üslup kullanmak gerekir. 4- Müftü ve öğretmen kendisinden fetva soran yahut öğrettiği kimseye karşı sabırlı olmalı, onun çokça soru sormasına ve açıklama istemesine tahammül göstermelidir. 5- Öğrenci hocasına yumuşak davranmalı, onun maslahatlarını göz önünde bulundurmalı, ona şefkat göstermelidir çünkü (Abdullah b. Mesud): Ona daha fazla sormayışımın sebebi ona şefkat göstermemdi, demiştir. 6- \"Lev: Eğer\" lafzını kullanmak caizdir çünkü \"ona daha fazla sorsaydım, o da bana daha fazlasını söyleyecekti\" demiştir. 7 - Bir kimsenin meydana gelmemiş bir olay hakkında eğer olsaydı şöyle olurdu diye haber vermesi caizdir çünkü Abdullah b. Mesud: Ona daha fazlasını sorsaydım, o da bana daha fazlasını söyleyecekti, demiştir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 162
			}
		}
	]
}