{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"13": "The Book of Fasting "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2572,
			"arabicnumber": "1105",
			"text": "Bize İshâk b. İbrahim ile Osman b. Ebî Şeybe hep birden Abde'den rivayet ettiler, İshâk (Dediki) Bize Abdetü'bnü Süleyman, Hişam b. Urve'den, o da babasından, o da Âişe (Radiyallahu anha)'dan naklen haber verdi. Âişe şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem) ümmetine acıdığı için kendilerini visal orucundan nehiy buyurdu. Ashâb : — «Ama sen de visal yapıyorsun.» dediler. Resulullah (Sallallahu Aleyhi ve Sellem): — «Ben, sizin gibi değilim. Çünkü beni Rabbim doyurur sular.» buyurdu. İzah Enes hadîsini Buhâri «Kitâbu't-Temenni» de ve biraz lafız farkıyla «Kitâbu's-Savm» da, Âişe hadîsini «Kitâbu's-Savm» da tahrîc ettiği gibi Âişe hadîsini Nesâi dahi «Kitâbu's-savm» da rivayet etmiştir. İbnü'l-Arabî diyorki: «Resulullah (Sallallahu Aleyhi ve Sellem)'in ashabına visal orucu tutmak için müsaade buyurması, onlara bir cezadır. Ceza tarikiyle verilen müsaade ise şeriattan değildir.» Teammuk: Teklif edilmeyen bir şeyi yapmağa çalışmak, bir şey'in derinliğine dalmaktır. Bu rivayetler dahi mânâ ve hüküm itibârı ile yukarkiler gibidir. Enes (R.A.) hadisinde: «Resulullah (Sallallahu Aleyhi ve Sellem) ramazanın başında visâl orucu tuttu.» denilmiştir. Müslim'in ekser-i nüshalarında rivayet bu şekildedir. Kaadî İyâz dahi ekser-i nüshalardan bu hadisi aynı şekilde nakletmiş fakat bunun râvi tarafından bir vehim olduğunu söylemiştir. Doğrusu Ramazan ayının sonunda visal yapmış olmasıdır Müslim'in bâzı râvileri onu bu şekilde de rivayet etmişlerdir. Nitekim bundan önceki rivayetlerle sair hadîslerde de hal böyledir. «Zaile» fiili: bir şey'i gündüz yapmak mânâsında kullanılır. Bunun zıddı «Bate» yani «gece yaptı» fiilidir. Fiil bu mânâya alındığı takdirde hadîs-i şerif: «Rabbim bana gündüzün yemiş içmiş gibi kudret ve tâkat verir.» mânâsına te'vil olunur ki Nevevî: «Sahih olan mezheb de budur.» diyor. Ancak bu keilmeden «olmak» mânası da kastedilmiş olabilir. Bu takdirde mâna «Ben Rabbimin beni doyurup suladığı halde olurum:» demektir",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 78
			}
		}
	]
}