{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 262,
			"arabicnumber": "89",
			"text": "(Bana Harun b. Said el-Eyli rivâyet etti. ki): Bize İbn Vehb rivâyet etti. ki: Bana Süleyman b. Bilâl, Sevr b. Zeyd den, o da Ebû'l-Gays'dan o da Ebû Hüreyre'den Resûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu rivâyet eyledi: mühlik şeyden kaçının!» Bunlar nedir yâ Resûlüllah? diye sorulunca: şirk koşmak, sihir yapmak, Allah'ın haram kıldığı bir kimseyi haksız yere öldürmek, yetim malı yemek, faiz yemek, düşmana hücum anında harpden kaçmak, namuslu, kendi halinde mü'min kadınlara zina iftirası atmaktır.» buyurdular. hadisi İmâm Buhârî Ebû Dâvud ve Nesâî «Vasâyâ» bahsinde rivâyet etmişlerdir. «Mûbikaat» muhlikât yani helâk edici şeyler demektir. Sâ'lebi ile başkalarına göre bir şeyi güzel göstermek ve dinleyenlere onu bulunduğu hâlin zıddiyle tavsif etmektir ki: yalanı hak-mış gibi gösterdiği için bâtıl bir tezvirdir. burada namuslu kadınlar ma'nasına cemi'dir. Müfredi «Muhsane»dir. ise; hür, âkil baliğ ve müslüman olup hâlen sahih nikâhla evli yahud başından sahih nikâh geçmiş bulunan erkeğe «muhsan»; kadına da «Muhsane» denir. zinadan ve zina iftirasına uğradıklarından haberleri bile olmayan kendi halinde kadınlardır. başında: «Yedi mühlik şeyden kaçının!» buyurulmuştur ki; bu ifade «Bunları terk edin» demekten daha beliğdir. Nitekim Kur' Kerim'de de: «Zinaya yaklaşmayın!» buyurulmuşdur Budam etmeyin» demekden daha beliğdir. Kaçınılması icâbeden yedi şeyin birincisi; Allah'a şirk koşmak yânî ondan başka bir ilâh tanımaktır. Bundan daha büyük bir mühlîk İmadığı ma'lûmdur. Çünkü müşrik ebedî olarak cehennemde yanacak- sihirdir. lügatte: bir şeyin yönünü değiştirmektir. Cevheri: «Sihir: Efsûndur; Me'haz ve menşei lâtif ve gizli olan her şey sihirdir.» demiştir; aldatmak ma'nasınada gelir. Abdillah Râzî sihri sekiz, kısma ayırmıştır. Şöyle ki: Yalancıların ve yedi yıldıza tapanların sihri. Bunlar taptıkları yeli seyyarenin bu âlemi idare ettiğine, hayır ve şerrin onlardan geldiğine İnanırlar. Hazret-i İbrahim (aleyhisselâm) bu kavme gönderilmişdi. Evham sahibleriyîe kuvvetli ruh sahiblerinin sihri, Cinlerin yardımile yapılan sihir. Buna azâim ve teshir denir. Tahayyül, göz boyacılık ve el çabukluğu ile yapılan sihir. Bazı mfessirlerin beyanına göre fir'avna yapılan sihir bu kabildendi. Bir takım mürekkeb aletlerle yapılan acaip fiiller. Bir takım devaların yani yiyecek ve yağların hâssalarından bilistifade yapılan sihir. Kalbin taallûku ile yapılan sihir. Bunda sihirbaz îsm-i azamı bildiğini ve ekseri işlerde cinlerin kendisine mut'i ve ram olduklarını iddia eder. El altından koğuculuk yapmak suretiyle meydana gelen sihirdir. Halk arasında şayi' olan sihir budur. sihrin hakikati var mıdır? Bu suâle Ebû'l-Muzaffer Yahya b. Muhammed şu cevabı vermiştir: «Ulema sihrin hakikati olduğuna ittifak etmişlerdir. Bundan yalnız Ebû Hanife müstesna kalmış; ve sihrin hakikat olmadığına kail olmuştur.» Kurtubi dahi: «Bizce sihir sabittir. Allahü teâla'nın dilediğini yaratmasiyle onun hakikati vardır. Bu babta mu'tezile ile şafiilerden Ebû İshâk el-Esferaini muhalefet etmiş; ve sihrin bir tahayyül ve gözü aldatma olduğunu söylemişlerdir.» demiş ve sihrin: şa'baze (el çabukluğu), Esma-i ilâhiyyeden bazılariyle ezber edilen bir takım sözler, şeytani ta'iiraat, yiyecek ve saire ile yapılan kısımları olduğunu bildirmiştir. Râzî tefsirinde mu'tezile taifesi için: «Bunlar sihrin mevcudiyetini inkâr eder: ve ona inananların küfrüne kail olurlar. Ama ehl-i sünnet, sihirbazın hevâda uçmasını, insanı eşeğe, eşeği insana kalbetmesini caiz görürler. Ancak sihirbaz muayyen efsun ve kelimeleri söylerken vücûda gelen şeyleri halk eden Allah'dır; derler. Onlar felsefecilerle müneccimler ve yıldız perestler gibi felek veya yıldızların müessir olduğuna kail değillerdir.» diyor. Râzi sihrin vâki' olduğunu ve onunla meydana gelen te'siri Allah halk ettiğine; Allahın izni olmaksızın o Sihirle hiç bir kimseye zarar veremezler.. âyet-i kerimesile ve Peygamber (sallallahü aleyhi ve sellem)'e yapılan sihrin te'sir ettiğini bildiren hadislerle istidlal eder. Sihri öğrenme meselesine gelince: Râzi bu babda şunları söylemiştir; «Sihri öğrenmek ne çirkin ne de memnu'dur. Muhakkikin ulemâ buna ittifak etmişlerdir. Çünkü ilim zâtı i'tibâriyle şereflidir. Bir de şu var ki; eğer sihir bilinmezse onunla mucizenin farkını yapmak da mümkün olmaz. Mu'cizin âciz bırakan ma'nasına geldiğini bilmek vaciptir. Vacibin tevakkuf ettiği şeyde vaciptir. Bu ise sihri öğrenmenin vâcib olmasını iktiza eyler. Vacib olan bir şey nasıl haram ve çirkin olabilir?..» Sahih-i Buhârî sarihlerinden Bedrüddin Aynî Râzî nin bu sözüne bir kaç vecihle i'tiraz ederek demiştir ki:",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 168
			}
		}
	]
}