{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"13": "The Book of Fasting "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2629,
			"arabicnumber": "1121.05",
			"text": "Bana Ebu't-Tâhir ile Harun b. Saîd El-Eyli rivayet ettiler. Harun (Haddesenâ), Ebu't-Tâhir (Ahberanâ) tâbirlerini kullandılar. Ebu't-Tâhir (Dediki) Bize İbni Vehb haber verdi. (Dediki). Bana Amr b. Haris, Ebu'l-Esved'den, o da Urvetübnu'z-Zübeyr'den, o da Ebû Muravih'den, o da Hamzatü'bnü Amr El-Eslemî (Radiyallahu anh)'dan naklen haber verdi ki, şöyle demiş: — «Ya Resulullah, Bn seferde oruç tutmaya kendimde kuvvet buluyorum. Acaba (tutsam) bana bir günah var mıdır?» Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): — «Bu Allah'dan bir ruhsattır. Her kim onunla amel ederse ne ala, kim oruç tutmak isterse ona da bir günah yoktur.» buyurmuşlar. Harun kendi rivayetinde: «O, bir ruhsattır.» dedi, «Aliah'dan- ifâdesini söylemedi. İzah Bu hadîsi Buhâri «Kitâbu's-Savm» in bir-iki yerinde tahrîc etmiştir. Esrüdü: Devam üzere tutuyorum, manasınadır. Resulullah (Sallallahu Aleyhi ve Sellem) devam üzere oruç tutan Hamzatü'bnü Amr (Radiyallahu anh) Hazretlerini seferde oruç tutmak için muhayyer bırakmış : «İstersen tut istersen tutma.» buyurmuştur. Halbuki Abdullah b. Amrü'bnu'l-Âs (Radiyallahu anh)'a devamlı oruç için müsaade etmemiş: «Bir. gün oruç tut, bir gün tutma.» buyurmuştu. îki hadîs arasında münâfaat yoktur. Çünkü Resulullah (Sallallahu Aleyhi ve Sellem)'in Abdullah b. Amr'a müsâade etmemesi vücutça zayıf düşeceğini bildiği içindir. Nitekim öyle de olmuş. Hz. Abdullah âhır ömründe zayıf düşmüş, Resulullah (Sallallahu Aleyhi ve Sellem)'in sözünü hatırladıkça: «Ah keşke Resulullah (Sallallahu Aleyhi ve Sellem)'in ruhsatını kabul etseydim.» diye hayıflanmıştır. Hz. Hamza oruç için kendinde kuvvet olduğunu söyleyince ona müsaade buyurmuştur. Şâfiiler'de El-mütevelli, Abdullah hadîsini zahirî mânâsına almış ve bir gün ara ile oruç tutmanın devamlı oruç tutmaktan efdal olduğunu söylemiştir. Fakat buna kaail olmayanlar kendisine cevap vermiş: «Gün aşırı oruç tutmak efdal olsa Resulullah (Sallallahu Aleyhi ve Sellem) onu Hz. Hamzatü'bnü Amr'a da bildirirdi. Zîra beyânın hacet zamanından te'vili câiz değildir.», demişlerdir. Hadîsin bir rivayetinde: «Bu, Allah'dan bir ruhsattır. Onunla kim amel ederse ne ala. Kim oruç tutmak isterse ona da bir günah yoktur.» buyurulmaktadır ki, «Seferde oruç tutmamak efdaldır.» diyenler bununla istidlal etmişlerdir. Zira Nebi (Sallallahu Aleyhi ve Sellem) oruç tutmayanlar hakkında «Ne ala.» yani iyi bir iş yapmış olur, buyurmuş, tutan için «günah yoktur.» tabirini kullanmıştır. Halbuki «günah yoktur» tâbiri «bana bir günah var mıdır?» suâlinin cevabıdır. Bu tabir oruç tutmanın iyi olmadığına delâlet etmez. Kaldı ki rivayetlerin birinde Nebi (Sallallahu Aleyhi ve Sellem) oruç tutmanın da tutmamanın da güzel olduğunu söylemiştir. Übbî. diyor ki : «Günah yoktur.» tabirinin oruç güzel değildir manasına gelmemesi, bu tâbirin «Vücûb, nedib, ibâha ve kerahet yoktur.» mânâlarına amm ve şâmil olmasındandır",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 135
			}
		}
	]
}