{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 264,
			"arabicnumber": "90.02",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe ile Muhammed b. el-Müsennâ ve İbn Beşşâr toptan Muhammed b. Ca'fer'den, o da şu’be'den naklen rivâyet eyledi. H. Muhammed b. Hatim de rivâyet etti. ki): Bize Yâhyâ b. Said rivâyet etti. ki): Bize Süfyân rivâyet etti. (Şu'be ile Süfyan'ın) her ikisi Sa'd b. İbrahim'den bu isnâdla bu hadisin mislini rivâyet etmişler. hadisi Buhârî ile Ebû Dâvud «Edeb» bahsinde, Tirmizî'de, «Kitabü'l*bi ^s» de tahriç etmişlerdir.. «Hiç insan ebeveynine söğer mi?» diye mukabelede bulunmaları, bu işin vukuunu uzak gördüklerindendir. Çünkü tab-ı selim bundan nefret eder. Resûlü Ekrem (sallallahü aleyhi ve sellem) de cevaben, bu işi bir kimsenin ekseriyetle doğrudan doğruya değil de sebeb olmak sureti ile yaptığını beyan buyurmuştur. Anaya babaya sövmeğe sebeb olmak büyük günahlardan sayılınca onlara sarahaten söğmek şüphesiz ki en büyük günahlardan olur. beş yüz otuz üç yıl evvel yaşamış olan Buhârî şârihi Ayni bu babda şunları söylemiştir: «Bu zamanda Öyle insanlar var ki ebeveynine söğen kimseye ziyafet verir. Anasını babasını döğenler bile vardır. Bir çok kimseler ebeveyn âsisi mücrimlerin bu işi yaptıklarına şâhid olmuşlardır. Hattâ babasını kesenler olurmuş. Bu musibetin Mısır'da çok vuku' bulduğunu bana bir cemaat haber verdi. Allah’dan afvü afiyet dileriz.» (rahimehüllah) üstadı Zeynüddin'in merfu' ve mevkuf hadislerden alınan büyük günah sayısının kırka baliğ olduğunu söylediğine işaret ettikden sonra onun söylemediği büyük günahları sıralamıştır. Bunlardan bazıları şunlardır: Bir kimsenin babasından başkasını babamdır diye iddia etmesi, küçük günahı işlemeye İsrarla devam, müslümana bühtanda bulunmak, kin tutmak, zina, livâta, hırsızlık, kabahatsiz bir kimseyi koğuculukla öldürtmek, gıybet etmek, Kur'ân'dan bir sure veya âyet unutmak, nemmamlık etmek, ramazan gününde özürsüz orucu terk etme!.. Ölçü ve tartıda hıyanet etmek, özürsüz namazı vaktinden evvel veya sonra kılmak, haksız yere bir müslümani döğmek, ashâb-ı kirâma söğmek, rüşvet almak, deyyusluk etmek, emr-i’il ma'ruf, nehy-i ani'l münkeri muktedir olduğu halde terk etmek, hayvanı yakmak, sebeb-siz olarak kadının kocasına itaat etmemesi, ulema ile ehl-i Kur'ân'ı gıybet etmek, özürsüz domuz eti veya iaşe yemek ve hayz hâlinde cima\", etmek Çalgı dinlemek ve ipek elbise giymek yahud ipek yaygı üzerine oturma;-gibi şeylerin büyük günah olup olmadığı ihtilaflıdır. İmâmü'l-Haremeyn Cüvevni ;ye göre bunlarda büyük günahlardandır. Râfiî ise sahih kavle göre küçük günah olduklarını beyan etmiştir. Battal bu hadisin sedd-i zerâyi' Bâbında bir temel kaide olduğunu söylemiştir. Harama götüren yolun da haram olduğu bundan, alınır. Hadisin aslı: başkasına; dua edenlere söğmeyîn.» âyet-i kerîmesidir. Usul uleması, putperest kâfirler Allah'a söğer diye puta söğmek gibi şeylerde sedd-i zerayi'in vücubuna kail olmuşlardır. di ipek giyeceği maTum olan bir erkeğe ipek satmayı, keza şarap yapacak bir kimseye şıra satmayı bu hadise istinaden men'etmiştir. göre ise şarap yapan kimseye şıra satmak caizdir. Çünkü ma'siy et işlenirken şıranın ayni değişmiş yani şarap olmuştur. Düşmana silâh satmak ise yasaktır; zira ma'siyet, satılan âletin ayniyle işlenecek, onunla müslümanlar öldürülecektir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 170
			}
		}
	]
}