{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"13": "The Book of Fasting "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2671,
			"arabicnumber": "1137",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki) Malik'e, İbaî Şihab'dan dinlediğim, onun da İbni Ezher'in azatlısı Ebû Ubeyd'den naklen rivayet ettiği şu hadîsi okudum: «Ebu Ubeyd Demişki: Ömeru'bnül Hattâb (Radiyallahû anh) ile beraber bayramda bulundum. Ömer gelerek bayram namazını kıldırdı. Sonra namazdan çıkıp cemaâata hutbe okudu ve : Kurbanlarınızdan yediğiniz iki gündür. Resulullah (Sallallahu Aleyhi ve Sellem) bu iki günde oruç tutmaktan nehiy buyurmuştur, dedi.» İzah Bu hadisi Müslim «Kitâbul-Edâhi» de dahi tahric ettiği gibi Buhâri «Kitâbu«'s-Savm» ve -Kitâbu'l-Edâhi» de. Ebû Dâvud, Tirmizî, Nesaî ve îbni Mâce «Kitâbu's-Savm» da muhtelif râvilerden tahrîc etmişlerdir. Hadîsin bir rivayetinde Hz. Ebû Ubeyd'in Ömer (Radiyâllahû anh) ile beraber bulunduğu namazın Kurban bayramı namazı olduğu bildirilmiştir. Hz. Ömer'in iki günü vasıflarıyla bildirmesi, o günlerde niçin oruç tutulmadığına işaret içindir. Yâni Ramazan bayramında iftar vâcib olur, Kurban bayramında ise Kurban eti yenir ve yedirilir. O gün, Allah'ın kullarına ziyafet günü olduğu için oruç tutmak menedilmiştir. Bayram günlerinde oruç tutmak bütün ulemâya göre memnudur. Yalnız Hanefiiler'e göre bir kimse Ramazan bayramı günü oruç tutmayı nezir etse bu nezir sahihdir, o gün oruç tutmaz başka bir günü onu kaza eder. Bu kavil İmam Mâlik ile Evzâî'den de rivayet olunmuştur. Hanefiiler'e göre bayram günü oruçtan nehiy buyrulması asıl orucun meşruiyetine münâfi değildir. Ekseri fukahaya göre nehyin fesâd icab etmediğini «El-Mahsûl» sahibi nakletmiştir. Râzi bu hususta uzun beyanâtda bulunmuştur. Buharî'nin rivayet ettiği Ziyâd b. Cübeyr hadisi de Hanefiiler'in kavlini te'yid eder. Mezkûr hadîsde: «Bir adam İbni Ömer'e gelerek: —Birisi pazartesi günü oruç tutacağım, diye nezretse de, o gün bayram'a tesadüf etse hüküm nedir ? diye sordu. İbni Ömer: — Allah nezri İfa etmeyi emir buyurmuştur, ama Resulullah (Sallallahu Aleyhi ve Sellem) de bu günde oruç tutmayı yasak etti, diyerek fetva hususunda bir şey söylemedi.» denilmektedir. Ulemadan İbni Abdilmelik: «Eğer o adamın orucu alettayin menedilmiş olsaydı îbni Ömer tevakkuf etmezdi.» demiştir. îmam Şafiî, İmam Züfer ve îmam Ahmed b. Hanbel'e göre bayram günlerinde oruç tutmak ve o günlerde oruç tutmayı nezir etmek sahih değildir. Bu kavil tmam A'zam ile İmam A'zam'dan bir rivayete göre Kurban bayramı günü oruç tutmayı nezir etmek sahih değildir, fakat bir kimse: «Yarın oruç tutacağım» diye nezretse de, ertesi günü Kurban Bayramı olsa nezri sahihdir. Hadis-i şerif, bayram namazının hutbeden Önce kılınacağına da delildir",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 177
			}
		}
	]
}