{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"13": "The Book of Fasting "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2676,
			"arabicnumber": "1140",
			"text": "(Bize İbn Nümeyr rivâyet etti. ki): Bize Sa'd b. Saîd rivâyet etti. ki): Bana Amra, Âişe (radıyallahü anha)’dan naklen haber verdi. Âişe: (sallallahü aleyhi ve sellem) iki oruçtan yani: Ramazan bayramı ile Kurban bayramı gönleri oruç tutmaktan nehiy buyurdular.» demiş. Saîd hadisini Buhârî «Fadlu's-Salâti fi mescidi Mekkede ve'l-Medinetî» bahsinde, İbn Ömer hadisini de Kitabü's-Sıyâm» da tahric etmiştir. Abdullah İbn Ömer: «Allahü teâlâ nezrin ifasını emir buyurmuştur.» sözü ile «Nezirlerini ifa etsinler» âyet-i kerîmesine işaret etmiştir. İbn Ömer (radıyallahü anh)'ya sual soran zâtın ismi malum değildir. Yalnız bazı rivâyetlerde bu zâtın Mîna'da iken İbn Ömer'in yanına geldiği ve bir rivâyette: «Zannederim pazartesi günü. dedi.» ifadesini kullandığı bildirilmektedir. hadisine göre oruç nezir eden zât, soranın kendisidir. Fakat Zannederim pazartesi günü, dedi.» ifâdesini kullanan mes'eleyi kendisi için değil, başkası nâmına sormuştur. Kıssanın iki defa ayrı ayrı geçmiş olması muhtemeldir. İbn Öm er'in bu suâl karşısında tevakkuf ederek kafi bir cevap vermemesi, kanaatine göre iki delil tearuz ettiği içindir. Sonra zâta ihtiyaten o günü kaza etmesi lâzım geldiğine işaret için cevap vermemesi de bir ihtimaldir. Zîra bu suretle iki delille de amel olur. iki delilden murâd: «nezirlerin ifâsına emreden âye't-i kerîme ile bayram günü oruç tutmayı yasak eden hadîs-i şerifdir. rivâyetler bayram günleri oruç tutmanın memnu olduğuna delildirler. Bu günlerde orucun niçin nehyedildiğini az yukarıda ki Hazret-i Ömer hadîsinde görmüştük. Ömer (radıyallahü anh) hadîsini hü-\"ji Kütübü sitte sahihleri tahric etmişlerdir. Hadîsin bir rivâyetinde Hazret-i Ömer: Bayramına gelince, o sizin iftar gününüzdür» diyerek nehyin illetine işaret etmiştir. Yani ramazan bayramı günü oruçla iftar günlerini birbirlerinden ayıran hadd-i fasıldır. O gün bayram olması nehyin ikinci illetidir. Kurban Bayramı günü orucun yasak edilmesi, Allah'ın kullarına bir ziyafet günü olduğu içindir. O gün oruç tutmak Allah'ın ziyafetine iştirak etmemek olur. Ömer'in «Kurbanlarınızdan yediğiniz gündür.» sözü kurban etlerini kesenlerin de yiyebileceğine işarettir. kesen kimsenin kurbanından yemesi' bütün ulemâya göre müstehabdır. Hattâ vâcib ©lduğunu söyliyenler bulunmuştur. günlerinde oruç tutmak ulemânın ittifakı ile haramdır. Yalnız İmâm A'zam'dan bir rivâyete göre bayram günlerinde oruç tutmayı nezir eden bir kimse o günlerde oruç tutabilir, denilmişse de, bu rivâyet doğru değildir. İmâm A'zam'a göre bayram günü oruç tutmayı nezeden kimse o gün oruç tutmaz, onu kaza eder",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 182
			}
		}
	]
}