{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"13": "The Book of Fasting "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2710,
			"arabicnumber": "1152",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bu Hâlid b. Mahled yani Katavâni, Süleyman b. Bilâl'den rivâyet etti. (Demiş ki) Bana Ebû Hâzim, Sehl b. Sa'd (radıyallahü anh)'dan. naklen rivâyet eyledi. Sehl Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): bir kapı vardır ki ona Reyyân derler. Kıyâmet gününde bu kapıdan oruçlular girecekler, onlarla birlikte başka hiç biri girmiyecektir. Oruçlular nerede denilecek. Müteakiben bu kapıdan gireceklerdir Oruçluların sonu girdi mi kapı kapanacak bir daha ondan hiç bir kimse gîremi-ycçektir.» buyurdular. hadîsi Buhârî dahi «Kitâbu's-Savm» da tahric etmiştir. cennetin dışında olduğu halde «Cennete açılan bir kapı» denilmeyip: bir kapı vardır ki...» buyurulması Cennette olan nimetlerle rahatın kapıda da bulunduğunu anlatmak içindir. Bu suretle o kapıdan girmeye daha beliğ bir surette teşvik buyurulmuştur. gere «Cennette açılan bir kapı» denilmemesi bu kapının, Cennetin sekiz kapısından maada olduğuna işaret içindir. Cennetin sekiz kapısından maada namaz kapısı, cihad kapısı, sadaka kapısı ve rahmet kapısı gibi birçok kapıları bulunduğu sahih hadîslerle rivâyet olunmuş-tur. Ancak ulemânın beyanına göre bu kapılar cennetin sekiz büyük kapısında dahildirler. Zira büyük kapıların iki kanadı arasında beşyüz yıllık mesafe bulunduğu rivâyet olunmuştur. bazı nüshalarında: «Oruçluların önde olanları girdi mi kapı kapanır.» denilmişse de bu rivâyet yanlıştır. Bâzı Müslim sarihleri onun bir vehimden ibaret olduğunu söylemişlerdir. Üstadı Zeyn'ün-Din'den naklen ulemâdan bâzılarının bu hadisle Müslüm'in tahric ettiği Hazret-i Ömer Hadisinin aralarını bulmakta müşkilât çektiklerini söylüyor. Hazret-i Ömer hadisinde Peygamber (sallallahü aleyhi ve sellem): biriniz mübalegali bir şekilde yahut tertemiz abdest alır da sonra Allah'dan başka ilâh olmadığına, Muhammed'in onun kulu ve resulü olduğuna şehâdet ederim derse o kimseye cennetin sekiz kapısı birden açılır. Onların hangisinden isterse girer.» buyurmuştur. zevata göre Peygamber (sallallahü aleyhi ve sellem) abdest alıp şehâdet getiren kimsenin cennet kapılarının hangisinden isterse girebileceğini haber vermiştir. Bu sıfatta olan bir kimse oruca ehliyet kazanmadan, meselâ: Oruç ayına erişmeden ölmüş yahut nafile oruç tutmamış olabilir. Şu halde Bâbımız hadîsinde beyân buyrulan Reyyân kapısının oruçlulara tahsisi müşkıldir ? bu zavata iki vecihle cevâb verildiğini söylüyor. Şöyle ki: Abdest alıp şehâdet getiren kimseye oruç kapısından girmekden sarf-ı nazar ettirilir de ondan girmek istemez, diğer kapıların hangisinden isterse girer. ümer (radıyallahü anh) hadisinin lâfızlarında ihtilâf vardır, Tirmizî'nin rivâyetinde: kimse için cennetten sekiz kapı açılır. Bu kapıların hangisinden dilerse girer.» buyurulmuştur. Mezkûr rivâyet Cennet kapılarının sekizden çok olduğunu göstermektedir. Oruç kapısı bu sekizde dâhil olmayabilir. Bu takdirde iki hadîs arasında hiç bir muâraza yoktur. şerif orucun ve oruç tutanların tazîletine delildir",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 216
			}
		}
	]
}