{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"13": "The Book of Fasting "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2716,
			"arabicnumber": "1155",
			"text": "(Bana Amr b. Muhammed En-Nâkıd rivâyet etti. ki) ; Bize İsmail b. İbrahim, Hişâmi Kurdusî'den, o da Muhammed b. Sırin'den o da Ebû Hüreyre (radıyallahü anh)'dan naklen rivâyet etti. Ebû Hüreyre şöyle dedi Resûlüllah (sallallahü aleyhi ve sellem): kim oruçlu iken unutur da, yiyip İçerse orucunu tamamlasın. Zira onun ancak Allah doyurmuş ve sulamıştır.» buyurdular. hadîsi bütün Kütüb-i Sitte sahipleri ile İbn Hibban az çok lafız farkıyla tahrîc etmişlerdir. bu babda Ebû Saîd ile Ümmü İshâk dan da rivâyetler bulunduğunu kaydetmiştir. Saîd hadîsini Dârakutni tahric etmiştir. Metni şöyledir kim Ramazanda unutarak orucunu bozarsa, ona kaza yoktur. Çünkü onu Allah doyurmuş, sulam ıştır.» İshak hadîsini İmâm Ahmed rivâyet etmiştir. Bu hadîs-i şerifde şöyle denilmektedir İshak, Resûlüllah (sallallahü aleyhi ve sellem)’in yanındaydı Peygamber (sallallahü aleyhi ve sellem)’e bir kap tirit getirdiler. Onunla beraber Ümmü İshâk da tiritten yedi. Resûlüllah (sallallahü aleyhi ve sellem)'in yanında Zülyedeyn de vardı. Resûlüllah (sallallahü aleyhi ve sellem) Ümmü İshâk'a etli bir kemik verdi. Zülyedeyn: Yâ Ümmü İshak bundan ye, dedi. (Ümmü İshak Dedi ki): Ben o anda oruçlu olduğumu hatırladım. Âdeta elim tutuldu. Elimi ne uzatabiliyor ne de çekebiliyordum. Bunun üzerine Peygamber Sana ne oldu? diye sordu. Ben oruçlu idim, unuttum, dedim. Zülyedeyn: sonra şimdi mi aklına geliyor? dedi. Resûlüllah (sallallahü aleyhi ve sellem) (Bana): Orucunu tamamladı. Bu ancak Allah'ın sana gönderdiği bir rızıktır,» buyurdular. (sallallahü aleyhi ve sellem)’in: ancak Allah doyurmuş, sulamıştır.» buyurması, unutarak yeyip içen kimsenin niçin orucu bozulmadığını ta'lildir. Zira' rızkı veren Allah'dır, bu babda kula bir şey nisbet edilmez. yiyip içmekte kulun bir te'siri yoktur . muhalifi delil kabul edenler bu hadîsle istidlal ederek harama rızık denilemeyeceğine kaail olmuşlardır. Mu'tezile'nin mezhebi budur. Mes'ele usûl-i fıkıh ilminde münâkaşa edilmiştir. şerif unutarak yeyîp içmenin ve cima' etmenin orucu bozmadığına kaail olan ekseri ulemânın delilidir. A'zam, İmâm Şafiî ve Dâvûd- Zahiri'-nîn mezhepleri de budur. ile İmâm Mâlik'e göre unutarak yiyip içmek orucu bozar. Böylesine keffâret lâzım gelmezse de kaza icap eder. Evzaî ve Leys. cima'da kaza lâzım geleceğine, unutarak yemek bir şey icab etmediğine kaail olmuşlardır. Ahmed b. Hanbel'e göre unutarak cima' edene hem kaza hem keffâret lâzımdır. Unutarak yiyene bir şey lâzım gelmez",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 222
			}
		}
	]
}