{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 273,
			"arabicnumber": "94.02",
			"text": "Bana Züheyr b. Harb ile Ahmed b. Hırâş (495) rivâyet ettiler. Dediler hi: Bize Abdüssamed b. Abdilvâris rivâyet etti. ki): Büze babam rivâyet etti. ki: Bana Hüseyn el-Muallim, İbn Büreyde'den rivâyet etti. Ona da Yahya b. Ya'mer rivâyet eylemiş. Yahya'ya da Ebû’l-Esved-i Dilî, ona da Ebû Zerr rivâyet etmiş. ki: Peygamber (sallallahü aleyhi ve sellem)’e geldim. Üzerinde beyaz bir elbise olduğu hal-de uyuyordu. (Döndüm) sonra (yine) geldim. Bir de baktım yine uyuyor, (Döndüm) Sonra yine geldim. (Bu sefer) uyanmıştı. Hemen yanına oturdum. Müteakiben: başka îlâh yoktur diyen ve bu ikrar üzerine ölen hiç bir kul yoktur ki, cennete girmesin» buyurdu. Ben: Zina etse de hırsızlık yapsa da Öyle mı? dedim. Resûlüllah (sallallahü aleyhi ve sellem): zina etse de hırsızlık yapsa da!» buyurdu. Ben (tekrar): Zina etse de hırsızlık yapsa da mı? dedim. zina etse de hırsızlık yapsa da!» buyurdular. (Bu suâl cevap) üç defa tekrarlandı. Nihayet dördüncüde: Zerr patlasa da (öyle)» buyurdular. Ravî Ebû'l-Esved diyor ki: «Ebû Zerr (Oradan) çıkarken: «Ebû Zerr patlasa da (öyle)» diyordu. hadisi İmâm Buhari Cenaiz, Tevhid, Bed'ül-Halk, İsti'zân ve Rukaak bahislerinde ve Nesâî «El-Yevm ve’l-Leyle» de tahriç ettiği gibi, Ebû Davûd ile Tirmizî dahi rivâyet etmişlerdir. Tirmizî: «bu hadis hasen sahihtir» demiştir. Müslim onu zekât bahsinde de rivâyet etmiştir. bâbda Hazret-i Ebû'd-Derdâ' (radıyallahü anh)'dan da bir hadis vardır. Mezkûr hadisi Müsedded b. Müserhed Müsned'in. de şu lâfızlarla rivâyet eder: (sallallahü aleyhi ve sellem): bir kimse Allahdan başka ilâh olmadığına şehâdet getirir de Allaha hiç bir şeyi şerik koşmayarak ölürse cennete girer yahud cehenneme girmez.» buyurdu. Ben: Zina etse de hırsızlık yapsa da böyle mi? dedim. Peygamber (sallallahü aleyhi ve sellem): zina etse de hırsızlık yapsa da (öyle)» buyurdular. Horasanlı olup Bağdad'da yaşamıştır. hadisi iman Ahmed b. Hanbel'den Müsned'inde rivâyet etmiştir. Cibrîl'in Peygamber (sallallahü aleyhi ve sellem)’e buradaki gelişi rü'ya halinde olmuştur. Nitekim Ebû'l-Esved rivâyetinde Ebû Zerr (radıyallahü anh)’in Peygamber (sallallahü aleyhi ve sellem) Üzerinde beyaz bir elbise olduğu halde uyuyordu» demesi buna delildir. (sallallahü aleyhi ve sellem)’in ümmeti: ümmet-i icabet ve ümmeti da'vet namlariyle iki kısma ayrıldığına göre buradaki ümmetten murâd: ümmet-i icabet yani ona iman edenlerdir. Maamâfih ümmet-i davetin kasdediîmiş elması da muhtemeldir. Çünkü imân ettikten sonra onlar da ümmet-i icabetten olurlar. olmayarak ölen ümmetin cennete gireceği haberi Hazret-i Ebû Zerr'in son derece merakını mucîb olmuş; meğer imanını kurtarabilenlere Allah'in ne büyük rahmeti varmış diye şaşarak: etse de hırsızlık yapsa da (Öyle mi?)» demiştir. Anlaşılan Hazret-i Ebû Zerr'in o anda hatırına: zinâ ederken mü'mîn olarak zina etmez...» hadisi gelmiş; onun için bu müjdeyi yadırgamiştır. Ebû Zerr (radıyallahü anh) âdeta, söyle demiş gibidir: zina etmeyen ve hırsızlık yapmayan için bir diyeceğim yok. Ama zina etse de hırsızlık yapsa da yine cennete girecek mi? Resûlüllah (sallallahü aleyhi ve sellem) Hazret-i Ebû Zerr'in pek büyük gördüğü bu işi isbât sadedinde Evet, zina etse de, hırsızlık yapsada (yine cennete girecek) buyurarak cevaplandırmıştır. günahların yalnız bu iki nev'ini zikretmesi: bir hak ya Allah'a yahud kullarına aid olduğu içindir. Bunlardan zina ile Allahü teâlâ'nın hakkına' hırsızlıkla da kulların haklarına işaret buyurmuştur. Hatta zina evli bir kadınla yapılırsa onunla hem Allah hakkı hem de kul hakkı temsil edilebilir. Çünkü böyle bir zina ile kocanın da hakkı yenmiş olur. şeriat kaidelerine göre sırf imanla ölmek kul haklarım ıskat etmez ama Resûlüllah (sallallahü aleyhi ve sellem)’in bu cevabı o kaideleri bozmaz. Zira kul haklarının ölümle sakıt olmamasından Allahın onları tekeffül etmemesi lâzım gelmez. Peygamber (sallallahü aleyhi ve sellem)’in Hazret-i Ebû Zerr'in bu işe imkânsız nazar ile bakmasını reddetmesi işte bundandır. «Zina etse de, hırsızlık yapsa da cennete girer» sözünden mu-râd: netice itibariyle cennete girer demektir. Bu da ya doğrudan doğruya yahud günahına göre hak ettiği azabı çektikden sonra olur. Binaenaleyh bazılarının Ebû Zerr hadisi hakkında ileri geri söz ederek: »Ebû Zerr hadisi bazı cahillerin kendisine i'timad ederek günah irtikâbına cesaret göstermelerine sebeb olan ümid bahş hadislerdendir.» şeklinde nıü-tâleada bulunmaları yersizdir. Çünkü görüldüğü veçhile hadisden murâd, zahirî ma'nası değildir. asıl ma'nası: Ebû Zerr'in burnu topraklansın demektir. Çünkü (rağime) fi'ili, toprak ma'nasına gelen (rağmen) dan alınmıştır. Bu ta'bir, zelîl ve hakir olsun ma'nasında kullanılır. Bazılarına göre ise «hoşlanmasa da» ma'nasına gelir. Buhârî'nin rivâyetinde: «Ebû Zerr bu hadisi rivâyet ettikçe daima: «Ebû Zerr patiasa da, derdi» Kaydı vardır. (sallallahü aleyhi ve sellem)’in Hazret-i Ebû Zerr'e bunu söylemesi, zânî ile hırsızın affını ihtimalden uzak gördüğü içindir. Ebû Zerr' (radıyallahü anh) hakîkatde bu afva karşı değildi. Ancak günahdan ve onu işleyenlerden son derece nefret ettiği için hürmeti ayaklar altına alan zânî ile hırsızın affolunmalarını pek büyük bir hâdise te-lakkî etmiş ve şaşmıştı",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 179
			}
		}
	]
}