{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"13": "The Book of Fasting "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2779,
			"arabicnumber": "1170",
			"text": "Bize Muhammed Abbâd ile İbn Ebî Ömer rivâyet ettiler. (Dediler ki): Bize Mervan yani Fezâri, Yezîd yani İbn Key-sân'dan, o da Ebû Hâzim'den, o da Ebû Hüreyre (radıyallahü anh)'dan naklen rivâyet eyledi. Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem)’in yanında Kadir Gecesini ı;azâkere ettik de: Ay doğduğu vakit onun çanak yarısı gibi-olduğunu hanginiz hatırlar? buyurdu. yemin'den murâd: İnşaallah demeden yapılan yemindir. Ubeyy'in bu kat'î yemini Kadir Gecesini, alâmetinden bildiği içindir. Bu alâmet güneş şuâsız doğmasıdır. beyânına göre güneşin ziyâsız doğmasına sebep: O gece yeryüzüne inen sayısız meleklerin semâyı kaplamaları olabilir. İyaz'a göre ayın çanak kırığı gibi doğması, Kadir Gecesinin Ramazan sonlarında olduğuna işarettir. Çünkü ay yeni doğduğu sıralarda böyle görünmez. Gecesinin alâmetleri hakkında muhtelif hadîsler vârid olmuştur. Bezzâr’ın «Müsned-inde Hazret-i Câbir b. Semû-r a'dan tahrîc ettiği bir hadisde: Gecesini Ramazanın son on gecesinde arayın. Zîra onu, ben gördüm, fakat unuttum. O, yağmurlu ve rüzgârlı bir gecedir.» buyurulmuştur. Hibbân'ın «Sahîh»inde Hazret-i Câbir b. Abdillâh'dan tahrîc ettiği bir hadîs dahi mânâ itibarı ile buna yakındır. Mezkûr hadîsde Kadir Gecesinin fazla sıcak ve soğuk olmayıp, mutedil aylı ve yıldızlı bir gece olduğu bildirilmiştir. Ebî Şeybe'nin rivâyet ettiği Abdullah b. Mes'ûd (radıyallahü anh) hadîsinde: her gûrt şeytânın iki boynuzu arasından doğar. Bundan yalnız Kadir Gecesinin sabahı müstesnadır.» deniliyor. Huzeyme'nin Hazret-i Ebû Hüreyre'den merfû olarak tahric ettiği bir hadîsde: gece yere inen meleklerin adedi, çakıl tadarının adedinden daha çoktur.» buyuruluyor. Ebî Hâtim'in Mücâhid tarikiyle rivâyet ettiği bir hadîsde o gece yeryüzüne şeytan salınmadiği, belâ gönderilmediği bildirilmekte, Dahlıâk tarikiyle rivâyet ettiği hadîste ise o gece tevbe eden herkesin tevbesi kabul edildiği, gök kapılarının açıldığı, Kadir Gecesinin güneş kavuştuktan, ertesi sabah tekrar doğuncaya kadar devam ettiği beyan olunmuştur. Daha başka rivâyetler de vardır. diyor ki: «Kadir Gecesi mevcuttur, onu her sene Ramazan'da Benî Âdem'den Allah'ın dilediklerin görürler. Nitekim geçen hadîsler de bunu göstermektedir. Sulehadan, onu gördüklerini haber verenlerin adetleri sayılmayacak kadar çoktur. Übeyy hadîsinde de işaret olunduğu vecihle bu gecenin kullardan gizlenmesi, ona güvenip de şâir ibâdet ve tâatlara karşı gevşeklik göstermesinler, bilâkis ona tesadüf etmek tamamıyla birçok geceleri ibâdetle ihya etsinler diyedir. günündeki icabet saatinin, Kur'ân-ı Kerîm'deki ism-i a'zam'ın gizlenmesi gibi şeyler hep bu hikmete mebnîdir",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 285
			}
		}
	]
}