{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 279,
			"arabicnumber": "97",
			"text": "Bize Ahmed b. Hasen b. Hiraş tahdis etti. Bize Amr b. Asım tahdis etti. Bize Mu'temir tahdis etti. Babamı şöyle tahdis ederken dinledim: Safvan b. Muhriz'in kardeşinin oğlu Halid el-Esbec, Safvan b. Muhriz'den şunları söylediğini tahdis etti: Cundeb b. Abdullah el-Becel!, İbn ez-Zubeyr fitnesi zamanında As'as b. Selame'ye (birisini) gönderip şöyle dedi: Benim için kardeşlerinden (yakın arkadaşlarından) birkaç kişi topla da onlara hadis nakledeyim. O da onlara bir haberci gönderdi. Bir araya gelip, toplandıktan sonra Cundeb de üzerinde sarı bir bornoz olduğu halde geldi. Ne konuşuyor idiyseniz, onu konuşmaya devam edin, dedi. Nihayet söz döndü, dolaştı. Söz söyleme sırası kendisine gelince başından bornozu açarak dedi ki: Ben sizin yanınıza nebinizden size haber vermek isteyerek gelmedim. Resulullah (Sallallahu aleyhi ve Sellem) Müslümanlardan bir birliği müşriklerden bir kavim üzerine göndermişti. Bunlar birbirleriyle karşılaştılar. Müşriklerden bir adam vardı ki Müslümanlardan birisine kastetmek istedi mi onun üzerine gidip onu öldürebiliyordu. Müslümanlardan bir adam da bu kişinin gafil bir zamanını yakaladı. Bize anlatıldığına göre bu kişi Usame b. Zeyd imiş. Usame ona kılıcını kaldırınca adam, la ilahe illallah dediği halde onu öldürmüştü. Müjdeci Nebi (Sallallahu aleyhi ve Sellem)'e geldi (ona zafer müjdesini verdikten sonra Allah Resulü) ona sordu. O da kendisine (olanları) haber verdi. Nihayet ona o adamın nasıl bir iş yaptığını da haber verdi. Allah Resulü onu (Usame'yi) çağırıp ona: \"O adamı niçin öldürdün\" diye sordu. Usame: Ey Allah'ın Resulü, Müslümanlar arasında çok can yaktı, filanı ve filanı öldürdü deyip, birkaç kişinin adını verdi. Ben de ona bir hamle yaptım, kılıcı görünce, la ilahe illallah dedi. Resulullah (Sallallahu aleyhi ve Sellem): \"Onu öldürdün mü yoksa\" buyurdu. Usame: Evet deyince, Allah Resulü: \"Kıyamet gününde la ilahe illailah gelecek olursa, sen ona karşı ne yapacaksın?\" buyurdu. Usame: Ey Allah'ın Resulü, benim için mağfiret dile, dedi. Allah Resulü: \"Kıyamet gününde la ilahe illailah gelecek olursa, ona karşı ne yapabileceksin?\" buyurdu. (Ravi) dedi ki: Resulullah (Sallallahu aleyhi ve Sellem) ona: \"Kıyamet gününde la ilahe illailah ile geleceğinde ona karşı ne yapabileceksin\" sözünden fazla bir şey söylemiyordu. Yalnız Müslim rivayet etmiştir; Tuhfetu'l-Eşraf, 3258 NEVEVİ ŞERHİ (270-275 numaralı hadisler): Bu bapta (270) Mikdad b. el-Esved (r.a.)'ın rivayet ettiği şu hadis vardır: \"O dedi ki: Ey Allah'ın Resulüne dersin, kafirlerden bir adam ile karşılaşsam ... O sözünü söylemeden önceki durumuna sen düşersin.\" (2/98) Bu baptaki diğer bir hadis (273) Usame b. Zeyd (r.a.)'ın rivayet ettiği hadistir: \"Dedi ki: Resulullah (Sallallahu aleyhi ve Sellem) bizleri bir seriye ile birlikte gönderdi. .. Sen ve arkadaşların ise fitne olsun diye savaşmak istiyorsunuz.\" (2/99) (274) diğer rivayet yolunda da: \"Mızrağımı ona sapladım ... O günden önce Müslüman olmasaydım diye temenni ettim.\" (275) diğer rivayet yolunda belirtildiği üzere (2/100) \"Nebi (Sallallahu aleyhi ve Sellem) Usame'yi çağırıp ona: Onu neden öldürdün diye sordu ... Kıyamet gününde la ilahe illallah ile geldiği vakit, sen ona karşı nasıl yapacaksın?\" denilmektedir. Bu Bapta Geçen Ravi İsimleri Bapta geçen isimlere gelince, \"Mikdad b. el-Esved\" ilk hadisin ravisidir. (272) diğer rivayette de: \"Bana Ata'nın tahdis ettiğine göre Ubeydullah b. Adiyy b. el-Hiyar kendisine şunu haber vermiştir: Zühre oğulları ile antlaşmalı olan ve Resulullah (Sallallahu aleyhi ve Sellem) ile birlikte Bedir' e katılmışlardan birisi olan -Mikdad b. Amr b. el-Esved el-Kindi kendisine şöyle dediğini haber verdi: Ey Allah'ın Resulü ... \" Burada sözü edilen Mikdad b. Amr b. Salebe b. Malik b. Rabia'dır. Onun gerçek nesebi işte budur. Esved b. Abd Yeğus b. Vehb b. Abdi Menaf (2/101) b. Zuhre onu cahiliye döneminde evlatlık edindiğinden ona nispet edilmiş ve böylelikle ona nispetiyle daha çok tanınmış ve bilinir olmuştur. İkinci olarak şunu belirtelim ki, Mikdad b. Amr b. el-Esved'in adının harekelenmesi ve okunuşunda hata edilebilir. Doğru okuyuş \"Amr\" isminin mecrur ve tenvinli okunmasıdır. İbnu'l-Esved ise İbn'deki nun harfi nasb ile okunmalı ve be' den önce elif ile yazılmalıdır. Çünkü bu Mikdad'ın bir sıfatıdır ve burada da mansub olduğundan nasb edilmelidir. Burada \"ibn\" lafzı biri diğerinin neslinden olan iki özel isim arasında yer almamaktadır. Bundan dolayı buradaki \"ibn\" lafzının muayyen olarak elif ile yazıldığını söyledik. Eğer \"İbn el-Esved\" ibaresinde \"ibn\" lafzı mecrur olarak okunacak olursa mana bozulur ve Amr, el-Esved'in oğlu olur. Bu ise apaçık bir hatadır. Bu ismin daha başka benzerleri de vardır. Abdullah b. Amr İbn Um Mektum bunlardan birisidir. Bunu Müslim (rahimehullah) kitabın sonlarında Cessase hadisinde böylece rivayet etmiştir. Abdullah b. Ubeyy İbn Selul, Abdullah b. Malik İbn Buhayne, Muhammed b. Ali İbnu'l-Hanefiyye, İsmail b. İbrahim İbn Uleyye, İshak b. İbrahim İbn Rahuye, Muhammed b. Yezid İbn Mace de bu tür benzerlerind~ndir. Bütün bunlarda baba ismi kendisinden sonra gelen ismin oğlu olmadığından muayyen olarak \"ibn\" lafzı elif ile yazılır ve ilk olarak adı geçen oğul anlamındaki \"ibn, bin, b.\" lafzının irabı ile irablanır. Um Mektum, Amr'ın zevcesidir. Selul, Ubeyy'in zevcesidir. Yüce Allah'ın izniyle yeri gelince sözkonusu edeceğimiz gibi daha başka açıklamalar da yapılmıştır. Buhayne, Malik'in zevcesi ve Abdullah'ın annesidir. Aynı şekilde elHanefiyye, Ali (r.a.)'ın zevcesidir. Uleyye de İbrahim'in zevcesidir. Rahuye ise İshak'ın babası İbrahim'in kendisidir. Aynı şekilde Mace de Yezid'in kendisidir. Çünkü bunlar (Rahuye ve Mace) iki lakaptır. Allah en iyi bilendir. Bütün bu isimleri bu şekilde zikretmekten maksatları ise, kişiyi tam tanımlamış olmak için her iki niteliği ile tanıtmaktır. Çünkü bir kimse bu kişinin iki vasfından sadece birisini bilebilir. Herkes tarafından tam olarak tanınması için her iki sıfatı bir arada sözkonusu ederler. Burada onun (Mikdad'ın) Amr'a nispetini el-Esved' e nispetinden öne almıştır. Çünkü Amr asılolandır. İşte bu da oldukça nefis ve güzel uygulamalardan birisidir. Allah en iyi bilendir. Mikdad (r.a.) ilk Müslüman olanlardan birisidir. Abdullah b. Mesud (r.a.) dedi ki: Mekke'de İslam'ı ilk açığa vuran yedi kişidir. Mikdad bunlardan birisi idi. Habeşistan'a hicret etti. Ebu'l-Esved künyeli idi. Ebu Amr ve Ebu Mabed künyeli olduğu da söylenmiştir. Allah en iyi bilendir. \"Zühre oğulları ile antlaşmalı\" ifadesine gelince, kendisi Esved b. Abd Yeğus ez-Zühri ile antlaşma yapmış idi. İbn Abdilberr ve başkalarının zikrettiklerine göre el-Esved de ayrıca onu evlatlık edinmekle birlikte antlaşma da hilf denilen (birbirlerini koruma taahhüdü) yapmış idi. Onun \"el-Kindı\" nispetine gelince, bunun açıklanması bir dereceye kadar zordur. Çünkü nesep bilginleri onun Behrani olup, Behra b. el-Haf b. Kuzaa'nın sulbünden geldiğini söylemişlerdir. Bu hususta aralarında herhangi bir görüş ayrılığı da yoktur. Hatta bu hususta icma olduğunu nakledenler arasında Kadı Iyaz ve başkaları da vardır. Bunun cevabı şudur: el-leys b. Sa'd (rahimehul1ah)'ın katibi Hafız İmam Ahmed b. Salih el-Mısri şöyle diyor: Mikdad'ın babası Kindelilerle anlaşma yaptığından onlara nispet edilmişti. Bizler İbn Şemase'den, o Süfyan'dan, o Suhabe el-Muhri'den şöyle dediğini rivayet etmekteyiz: Cahiliye döneminde Mikdad b. Esved'in arkadaşı idim. Kendisi Behralı bir zat idi. (2/102) Onlardan birisinin kanını dökünce kaçıp Kindelilere sığınarak onlarla antl2.şma yaptı. Sonra onlardan da birisinin kanını döktü. Bu sefer kaçıp Mekke'ye gitti ve Esved b. Abd Yeğus ile hilf (karşılıklı himaye) antlaşması yaptı. Buna göre aslen Behralı olması itibariyle Behrani nispeti sahihtir. Kuzaalılara nispeti de aynı şekildedir. Kendisinin ya da babasının antlaşmasından ötürü Kindelilere nispeti de sahihtir. Esved ile antlaşmasından ötürü Zührelilere nispeti de sahihtir. Allah en iyi bilendir. (272) \"Mikdad b. Amr b. el-Esved ... 0, ey Allah'ın Resulü, dedi\" rivayetinde (...;1) lafzının yeniden tekrar edilmesi, araya giren ifadeleri n uzamasından dolayıdır. Eğer ravi bunu zikretmemiş olsaydı yine sahih olurdu. Daha doğrusu asılolan budur. Fakat söz uzayınca onu zikretmek caiz ya da hasen olmuştur. Arap dilinde benzeri kullanımlar çoktur. Bunun benzeri Kur'an-ı Azimuşşan'da da hadis-i şeriflerde de geçmektedir. Kur'an-ı Kerim'de bu türden buyruklardan birisi de yüce Allah'ın kafirlerin söylediklerini naklettiği: '~caba siz ölüp toprak ve kemik olduktan sonra (evet) siz muhakkak çıkartılacaksınız diye sizi tehdit mi ediyor?\" (Mu'minun, 35) buyruğunda, araya giren uzunca lafızlardan ötürü: \"(~I): Siz\" lafzını iki d~fa zikretmiş bulunmaktadır. Yüce Allah'ın şu buyruğu da bunun gibidir: \"Onceden kendisi vasztası ile kafirlere karşı zafer istedikleri ve ellerindekini doğrulayıcı bir kitap onlara Allah tarafından gönderilince işte o tanıdıkları kendilerine gelince onu inkar ettiler.\" (Bakara, 89) Bu buyrukta da: \"(r\"\\.:::- k\\.j): Kendilerine gönderilince, kendile':':ne gelince\" buyruğunu tekrar etmiş bulunmaktadır. Bu meselenin bir benzerini daha önce de sözkonusu etmiştik. Allah en iyi bilendir. Adiyy b. el-Hiyar' ın babasının adında hı harfi kesrelidir. Ata b. Yezid elleysı sonra da el-Cundaı, dal harfi ötreli olarak \"el-Cundu1\" şeklinde de nispet edilir, iki ayrı söyleyiştir. Cunda' ise leys oğullarının bir koludur. Bundan dolayı el-leysı sonra el-Cundaı diyerek önce umumi olan leysli olduğunu sonra da özelolarak Cunda'lı olduğunu belirtti. Eğer bunun aksini zikredip el-Cundai, el-leysı demiş olsaydı el-Cundai dedikten sonra el-leysı demenin anlamsız olduğundan ötürü hata olurdu. Ayrıca bu Leys'in Cunda'ın bir kolu olmasını gerektirirdi. Bu da bir hatadır. Allah en iyi bilendir. İsnatta daha önce benzerleri geçmiş bir incelik vardır. Bu da senedinde biri diğerinden rivayet nakleden üç tane tabii bulunmasıdır. Bunlar da İbn Şihab, Ata ve Ubeydullah b. Adiyy b. el-Hiyar' dır. Ebu Zabyan isminde zı harfi fethalı ve kesreli (Zibyan) olarak da okunur. Dilciler bunu fethalı okur ve kesreli okuyanların hata ettiklerini söylerler. Hadis alimleri ise bunu kesreli okurlar. İbn MakCıla ve başkaları da böyle kaydetmişlerdir. Ebu Zabyan'ın adı Husayn b. Cundub b. Amr'dır. Kufelidir, 90 yılında vefat etmiştir. el-Hurekat ha harfi ötreli ve ra harfi fethalıdır. ed-Devraki nispeti de daha önce defalarca geçmiş bulunmaktadır. Aynı şekilde Ahmed b. Hiraş'ın da hı harfi kesreli okunur. Halid el-Esbec' e gelince, dilciler şu açıklamayı yaparlar: el-Esbec sırt tarafı, omuz araları geniş olan kimseye denilir. Safvan b. Muhriz isminde hı harfi sakindir. Cundub isminde dal harfi ötreli ve fethalı okunabilir. As'as b. Selame ismi iki ayn ve iki sin iledir. Ayn harfleri fethalı, aralarındaki sin ise sakindir. Ebu Ömer b. Abdilberr (2/103) el-İstiab adlı eserinde şöyle diyor: O Basralıdır, Nebi (Sallallahu aleyhi ve Sellem)'den rivayet nakletmiştir. Onun rivayet ettiği hadislerin mürselolduğu ve Nebi (Sallallahu aleyhi ve Sellem)'den bizzat hadis dinlemediği söylenir. Buhari de et-Tarih' inde bu şekilde hadisi mürseldir, demiştir. İbn Ebu Hatim ve başkaları da aynı şekilde onu tabiin arasında zikretmişlerdir. Buhari ve başkaları As'as'ın künyesi Ebu Sufra olup, Temimli ve Basralıdır. Benzeri bilinmeyen müfred (bu şekliyle tek) isimlerdendir. Allah en iyi bilendir. Açıklanması Gereken Lafızlar Babın baş tarafında: \"Ey Allah'ın Resulü, ne dersin eğer kafirlerden bir adamla karşılaşırsam ... \" ibare çoğu muteber asıllarda bu şekildedir. Bazılarında ise ne dersin, karşılaştım şeklinde (eğer anlamındaki) (ı:.ıD'in hazfi (zikredilmemesi) sureti iledir. Ancak doğrusu olan birinci şekildir. \"Benden korunmak için\" yani kendisini benden korumak için \"bir ağaca sığınırsa.\" \"Ama o bu sözü kendisini korumak için\" yani kendisini (bana karşı) korumak amacıyla \"söylemişti.\" (271) \"el-Evzaı ve İbn Cureyc hadislerinde\" sözleri asıl nüshaların çoğunda bu şekilde \"fi\" harfi tek fe iledir ama çoğu asıllarda ise iki fe'li olarak \"fe fi\" şeklindedir. Asılolan ve güzelolan budur. Bununla birlikte birinci şekil de caizdir çünkü \"emma\" edatının cevabında \"fe\" harfinin getirilmesi -cevabın söylemek (kavl) olması hali dışında- zikredilmelidir. Fakat kavl (söz) hazfedilecek olursa fe'nin de hazfedilmesi caiz olur. Bu da o kabildendir. Buna göre ifade: \"(......): el-Evzaı ve İbn Cureyc ise hadislerinde şöyle dediler ... \" takdirindedir. Kur'an-ı azimuşşan' da da, Arapların dilinde de bu kullanımın benzerleri pek çoktur. Kur' an-ı Kerim' deki yüce Allah'ın: \"Yüzleri kararanlara: İmanınızdan sonra kafir oldunuz ha ... \" (Al-i İmran, 106) buyruğu buna bir örnektir. Yani onlara: Kafir oldunuz ha, denilir. Aynı şekilde yüce Allah'ın: \"Kafir olanlara gelince: Ayetlerim sizlere oku nmadı ml. .. (denecek)\" (Casiye, 31) buyruğu da buna örnektir. Allah en iyi bilendir. (273) Resulullah (Sallallahu aleyhi ve Sellem)'in: \"O sözü söyleyip söylemediğini öğrenmen için neden onun kalbini açıp bakmadın\" cümlesindeki söyleme fiilinin öznesi kalptir. Yani sen ancak zahire göre ve dilin söylediği ile am el etmekle yükümıüsün. Kalbin içinde ne olduğunu bilmeye imkan bulamazsın. Böylelikle Nebi (Sallallahu aleyhi ve Sellem) onun dil ile açığa vurulan gereğince amel etmeyişine tepki göstererek kalp bu sözü söyleyip, ona inandı mı, bu söz kalbinde yer etmiş miydi, etmemiş miydi yoksa sadece bu söz dilinden dökülmekle mi kaldı, görmen için neden kalbini açıp bakmadın, buyurdu. Bu da senin buna gücün yetmez, bu sebeple yalnızca dilin söylediği ile yetin, başka bir şeyi arama, demektir. Usame (r.a.)'ın: \"Öyle ki keşke o gün Müslüman olsaydım diye temenni ettim\" sözü de şu demektir: Keşke daha önce Müslüman olmamış olsaydım. Şu anda İslam'a girmiş olsaydım da geçmiş günahlarımı böylece silmiş olsaydı. Onun bu sözü söylemesinin sebebi içine düştüğü halin büyüklüğünden ileri idi. \"Sa' d dedi ki: Ben de Allah'a yemin ederim ki hiçbir müslümanı -şu büyük göbekli kişi onu öldürmedikçe- öldürmem\" sözlerine gelince, kastettiği kişi Vsame'dir. Sa'd ise Sa'd b. Ebu Vakkas (r.a.)'dır. Küçültme ismi olarak \"zul butayn\" okuyuşu hakkında Kadı Iyaz (rahimehullah) şunları söylemektedir: Ona böyle deniliş sebebi büyük bir karnının bulunması idi. (275) \"Başından bornozu açıp şöyle dedi: Ben size nebinizden haber vermek isteği ile yanınıza gelmedim. Resulullah (Sallallahu aleyhi ve Sellem) bir askeri birlik göndermişti. .. \" (2/104) Bornoz kelimesinde be ve nun harfleri ötreli olarak okunur. Dilcilerin söyledikleri üzere ister kaftan, ister cübbe, ister başka bir giyecek olsun, başlığı gövdesine bitişik olan her elbiseye denilir. \"Size haber vermek istemediğim halde yanınıza geldim.\" Bütün asıllarda bu şekildedir. Ancak hadisin baş tarafında: \"As'as'e haber göndererek bana arkadaşlarından birkaç kişi topla da onlara hadis nakledeyim\" dedikten sonra: \"Size haber vermek istememekle birlikte yanınıza geldim\" demesi açıklanması zor ifadelerdir. Çünkü bu sözler iki anlama gelebilir. 1- Olumsuzluk anlamı veren \"la\" zaid olabilir. Yüce Allah'ın: \"(~i ~ )\\;J ,-;-,\\:501): Ta ki kitap ehli. .. bilsinler.\" (Hadid, 29); \"('i 0i ~ lo ~): Seni secde etmekten alıkoyan nedir?\" (A'raf, 12) buyruklarında olduğu gibi zaiddir. 2- Zahiri üzere, ben size nebinizden (Sallallahu aleyhi ve Sellem) haber vermek isteği ile değil de, size kendime ait sözlerle öğüt verip, sizinle konuşmak için geldim. Ama şu anda ben size niyet ettiğimden daha fazlasını söyleyerek, size Resulullah (Sallallahu aleyhi ve Selleml'in bir askeri birlik gönderdiğini. .. haber vereyim deyip, hadisi nakletti. Allah en iyi bilendir. \"Kılıç onun üzerine dönünce\" Güvenilir bazı asıl nüshalarda bu şekilde (döndü fiili ile) \"recea\" şeklindedir. Bazı asıllarda ise fe ile: \"rafea: kaldırdı\" diye kaydedilmiştir. Her ikisi de doğrudur. Her iki rivayete göre de kılıç anlamındaki lafız nasb iledir. Yüce Allah'ın: \"Eğer Allah seni bir kesimin yanına geri döndürürse\" (Tevbe, 83) buyruğu ile: \"Onları kafirlere geri döndürmeyin\" (Mumtehine, 10) buyrukları da bu türdendir. Allah en iyi bilendir. Hadisin Senedine Yapılmış Bazı İtirazlar ve Cevapları Bilelim ki bu hadisin bazı rivayetlerindeki isnada Darakutni ve başkalarının itirazları vardır. Bu itiraz Müslim'in (271 numaralı hadisteki): \"Bize İshak b. İbrahim ve Abd b. Humeyd tahdis edip dediler ki. .. Hepsi ez-Zührl'den bu isnad ile\" sözleri ile ilgilidir. Evet, bu isnad Culı1dl'nin rivayetinde bu şekildedir. Kadı Iyaz dedi ki: Fakat bu isnad İbn Mahan'da -yani el-Culı1dl'nin arkadaşında- görülmemektedir. Kadı Iyaz dedi ki: Ebu Mesud ed-Dımeşkı dedi ki: Bu Velid'den bu isnad ile yani Ata b. Yezid'den, o Ubeydullah'tan diye bilinmemektedir. Bu isnatta Velid' e de, el-Evzai'ye de muhalefet edilmiştir. Darakutni, el-İlel adlı eserinde bu husustaki ihtilafı açıklamış ve el-Evzai' nin bunu İbrahim b. Murre'den rivayet ettiğini ayrıca ona muhalefet ederek bunu Ebu İshak elFezari, Muhammed b. Şuayb, Muhammed b. Humeyd ve Velid b. Mezyed'in el-Evza1'den, o İbrahim b. Murre'den, o ez-Zühri'den, o Ubeydullah b. elHiyar'dan, o Mikdad'dan diye rivayet etmiş, bunlar senette Ata b. Yezid'i zikretmemiştir. Velid b. Müslim'den de farklı rivayet ile gelerek bunu Velid el-Kuraşi, Velid'den, o el-Evzal'den diye. el-leys b. Sa'd da ez-Zührı'den, o Ubeydullah b. el-Hiyar'dan, o Mikdad'dan diye rivayet etmiş, senette Ata'yı sözkonusu etmemiş (2/105) ve İbrahim b. Murre'yi de düşürmüştür. İsa b. Musavir de ona muhalefet edip, bunu Velid' den, o el-Evzaı' den, o Humeyd b. Abdurrahman'dan, o Ubeydullah b. el-Hiyar'dan, o Mikdad'dan diye rivayet etmiş, senette İbrahim b. Murre'yi zikretmemiş, Ata b. Yezid'in yerine Humeyd b. Abdurrahman'ı koymuştur. Bunu el-Firyabi de el-Evzal'den, o İbrahim b. Murre'den, o ez-Zührı'den, Mikdad'dan mürselolarak rivayet etmiştir. Ebu Ali el-Ceyani dedi ki: Bu hadisin isnadında sahih olan Müslim'in ilk olarak zikrettiği leys, Ma'mer, Yunus ve İbn Cureyc'in rivayetidir. Salih b. Keysan da onlara mutabaat etmiştir. Kadı Iyaz (rahimehullah)'ın sözleri burada sona ermektedir. Derim ki: Bu farklılığın ve ızdırabın neticesi Velid b. Müslim'in, elEvza1'den rivayeti hakkındadır. Leys, Ma'mer, Yunus ve İbn Cureyc'in rivayetlerinin sıhhatinde ise hiçbir şüphe yoktur. Bu rivayetler gereğince am el edilecek müstakil rivayetlerdir ve onlara itimat edilir. el-Evzaı'nin rivayetini ise Müslim mutabaat olmak üzere sözkonusu etmiştir. Hadis alimleri nezdinde kabul edildiği üzere mutabaat rivayetlerde bir tür zayıflık bulunması katlanılabilir bir husustur. Çünkü mutabaat itimat olunan, dayanak alınan bir rivayet değildir, mutabaat sadece istinas (destekleyici özelliği) içindir. Velhasıl Velid'in, el-Evza1'den rivayetindeki bu ızdırap hadisin aslının sıhhatine herhangi bir zarar vermemektedir. Çünkü onun sahih oluşunda bir ihtilaf yoktur. Darakutni'nin yaptığı istidraklerin çoğunlukla bu türden olduğunu da ve bunun asıl metinlerin sıhhatini etkilemediğini daha önceden belirttiğimiz gibi yazdığımız fasıllarda Müslim (rahimehullah)'ın bu tür rivayetlerde asıl dayanak aldığı rivayetler onlar olmadığından ötürü mazur görülmesi gerektiğini de belirtmiştik. HADİSLERİN ANLAMI VE FIHİ HÜKÜMLER Hadislerin anlamları ve fıkhi hükümlerine gelince, Resulullah (Sallallahu aleyhi ve Sellem)'in (270) la ilah e illailah diyen kimse hakkında: \"Onu öldürme. Şayet onu öldürürsen, senin onu öldürmeden önceki konumunda o olur. Sen de O'nun söylediği sözden önceki konumunda olursun\" buyruğunun anlamı hakkında farklı açıklamalar yapılmıştır. Bu hususta yapılmış açıklamaların en iyisi ve en güçlü olanı İmam Şafii, İbnu'l-Kassar el-Maliki ve başkalarının yaptığı şu açıklamadır: Böyle bir kimse la ilahe illailah sözünü söyledikten sonra sen onu öldürmeden önceki halinde olduğun gibi kanı koruma altındadır, öldürülmesi haramdır. Sen ise la ilahe illailah diyen kişiyi öldürdükten sonra artık kanın koruma altında değildir ve öldürülmen de haram değildir. Tıpkı onun la ilahe illailah demeden önceki durumu gibi. İbnu'l-Kassar dedi ki: Bu da, senin üzerinden kısası düşüren tevil ile mazur görülme n olmasaydı durumun bu olacaktı, demektir. Kadı Iyaz dedi ki: Anlamının şöyle olduğu da söylenmiştir: Hakta muhalefet ve günahı işlemek bakımından sen de onun gibisin. Muhalefetin ve günahın türü farklı olsa dahi onun günahının adı küfür, senin günahının adı ise masiyet ve fısktır. Rasülullah (Sallallahu aleyhi ve Sellem)'in Usame'ye kısas uygulanmasını, diyet ve kefaret ödemesini vacip görmemesi de bütün bunların (böyle bir sebeple) düşürüldüğüne delil gösterilebilir. Ama şüpheden ötürü kısas düşmekle birlikte, kefaret vaciptir. Çünkü Usame onu kafir olarak zannetmiş, onun açıktan böyle bir durumda tevhid kelimesini söylemesinin onu Müslüman yapmayacağını sanmıştı. Böyle bir durumda diyetin gerekip gerekmediği hususunda Şafii'nin iki görüşü vardır. Bunların her birisini birtakım ilim adamları benimsemiştir. Kefaretin sözkonusu edilmeyişine de, kefaretin fevren (derhal) ödenmesi gereken bir şeyolmayıp zaman içerisinde ödenebilme özelliği gerekçe gösterilebilir. Diğer taraftan usul alimleri nezdinde sahih kabul edilen kanaate göre, beyanın ihtiyaç duyulan vakitten sonraya bırakılması da caizdir, diye de cevap verilebilir. (2/106) Diyetin (bu gibi durumlarda) vacip olduğunu kabul edenlerin görüşüne göre ise, Usame'nin o zamanlarda böyle bir diyeti ödeyebilecek maddi imkana sahip olmadığından, onu kolaylıkla ödeyebileceği bir zamana ertelenmiş olması ihtimali vardır, diye cevap verilebilir. Cundub b. Abdullah (r.a.)'ın insanları toplayıp, onlara öğüt vermesi şeklindeki uygulamasına gelince, buradan alim kişinin ve kendisine itaat olunan büyük ve meşhur bir zatın fitne zamanlarında insanları teskin etmesi, onlara öğüt verip, onlara delilleri açıklaması gerektiği hükmü anlaşılmaktadır. Resulullah (sallallahu a1eyhi ve sellem)'in: \"Neden kalbini açıp bakmadm\" buyruğunda ise, fıkıh ve usul-u fıkıh'ta bilinen kaideye dair bir delil vardır. O kaide de: Ahkam ile ilgili hususlarda zahirlere göre amel edilir. Gizli haller ise Allah'a havale edilir. Birinci rivayette Usame'nin: \"Ben de ona mlZrağıml sapladım fakat bundan dolayı içimde bir rahatsızlık hissettim, onu Nebi (Sallallahu aleyhi ve Sellem)'e söyledim\" denildiği halde, diğer rivayette: \"Medine'ye vardığımlZda bu husus Nebi (Sallallahu aleyhi ve Sellem)'e ulaştı ve bana: Ey Usame, onu öldürdün mü, dedi.\" Öbür rivayette ise: \"Müjdeci Nebi (Sallallahu aleyhi ve Sellem)'e gelip, ona adamın durumunu haber verince, O' da onu çağırdı.\" Yani Usame'yi çağırıp ona sordu. Muhtemelen bu rivayetlerin arası şöyle ce telif edilebilir: Usame o kişiyi öldürdükten sonra içinde bir rahatsızlık hissetti ve durumunu Nebi (Sallallahu aleyhi ve Sellem)'e sormayı içinden niyet etti. Müjdeci de gelip, Usame daha Medine'ye varmadan durumu haber verdi, onlar (askeri birlik) Medine'ye henüz varmadan da durum Nebi (Sallallahu aleyhi ve Sellem)'e ulaştı. Usame'nin: \"Ben bunu söyledim\" sözünde ise bu hususu Nebi (Sallallahu aleyhi ve Sellem) olayı bilmeden önce ilk olarak kendisinin ona anlattığını ortaya koyan bir delil bulunmamaktadır. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 185
			}
		}
	]
}