{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2802,
			"arabicnumber": "1180.05",
			"text": "(Bana İshak b. Mansûr rivâyet etti. ki): Bize Ebû Ali Ubeydullah b. Abdilmecîd haber verdi. ki): Bize Rabâh b. Ebî Maruf rivâyet etti. ki): Atâ'yı şunu söylerken işittim: Bana Safvân b. Yâ'lâ, babası (radıyallahü anh)'dan naklen haber verdi. Babası Şöyle dedi: (sallallahü aleyhi ve sellem)’in maiyyetinde bulunuyorduk, yanına cübbe giymiş bir adam geldi, Cübbenin üzerinde halûk (denilen esans) eseri vardı. Bu zât: «Ya Resûlüllah! Ben, ömreye niyet ettim. Ne yapmalıyım?» diye sordu. Resûlüllah (sallallahü aleyhi ve sellem) sükût buyurdu, ona cevap vermedi. Kendisine vahiy indirildiği zaman Ömer onu örter, gölgelendirirdi. Ömer (radıyallahü anh)'a dedim ki: «Ben, Resûlüllah (sallallahü aleyhi ve sellem)'e vahiy indirildiği vakit başımı onunla beraber elbisenin altına sokmak isterim.» (sallallahü aleyhi ve sellem)’e vahiy nâzil olunca Ömer (radıyallahü anh) onu elbiseyle örttü. Ben de yanına gelerek başını onunla birlikte elbisenin altına soktum. Ve Resûlüllah (sallallahü aleyhi ve sellem)'e baktım. Açıldığı vakit: «Demin ömreyi soran zât nerede kaldı?» diye sordu. O zât kalkarak Resûlüllah (sallallahü aleyhi ve sellem)’in yanına geldi. Peygamber (sallallahü aleyhi ve sellem): «Sırtından cübbeni çıkar, özerinde bulunan halûk eserini de yıka, Haccetmiş olsan ne yapacaksan ömrende de onu yap. buyurdular. hadîsi Buhârî «Kitâbu’l-Hacc» ile «Kitâbu Fedâiü’l-Kur'ân»ın bir-iki yerinde ve «Kitâbü'l-Meğazi»de, Ebû Dâvud, Tirmizî ve Nesâî «Kitâbu’l-Hacc »da ayrıca Nesâî «Kitâbu Fedâili'l-Kur'ân»da muhtelif râvilerden tahric etmişlerdir. Tâif'le Mekke arasında bir yerdir. Mekke'ye daha yakındır. Bu kelimeyi «Ciirrane» şeklinde okuyanlar da olmuştur. birinci kiraatı daha fasih ve meşhurdur. (sallallahü aleyhi ve sellem)'e gelen zatın ismi malum değildir. Buhârî'nin bir rivâyetinde bir bedevi olduğu kaydedilmiştir. Tartuşi tefsirinden bu zâtın Atâ' b. Ümeyye olduğunu nakletmişlerdir. Bu takdirde hadîsi rivâyet eden Hazret-i Yâ'lâ b. Ümeyye'nin kardeşi demek olur. sahibi: «Bu zâtın Amr b. Sevvâd olması caizdir. Çünkü Kâdı îyâz'ın (Kitâbu'ş-Şifâ) adlı eserinde Hazret-i Amr 'dan rivâyet ettiği bir hadîste Amr (radıyallahü anh): Peygamber (sallallahü aleyhi ve sellem)’in yanına halûk sürünerek geldim de: «Alaçehre alaçehre, kokuyorsun, at bunu at, buyurdu. Elindeki bir kamışla karnımı dürttü. Canımı acıttı... ilâh...» demektedir. Lâkin bu Amr mezkûr kıssaya yetişmiş olamaz. Çünkü kendisi İbn Vehb'in arkadaşıdır.» diyor. «Tevdîh» sahibinin bu tahmininin doğru olmadığı anlaşılmıştır. Zîra şifâ hadîsindeki râvînin ismi Amr b. Sevvâd değil, Sevvâd b. Amr'dır. Safran vb. den mürekkep bir nev'i esansdır. Küçük hacc demektir ki, tavafla saiden ibarettir. Senenin her mevsiminde yapılabilir. Yalnız Arafe ile onu takib eden dört gün zarfında ömre yapmak mekruhtur. Çünkü o günler hacc günleridir. Biçilmiş kaftan ve cübbe demektir. Bedene göre biçilmiş olması kelimenin mânâsında dâhildir. zâtın kokuya bulanmış olması, elbisesiyle bedenine şâmildir. Bulanmak tâbirinden de anlaşılıyor'ki, süründüğü koku çokmuş. Resûlüllah (sallallahü aleyhi ve sellem)’in: olsan ne yapacaksan, örn rende de onu yap.» buyurması, ashâb-ı kirâm'in hacc fiillerini daha evvelden bildiklerini gösterir. diyor ki: «Galiba Araplar câhîliyet devrinde haccettikleri vakit elbiselerini çıkarır, ihram halinde koku sürünmekten kaçınırlar, fakat ömre yaparken bu hususta daha müsamahalı davramr-larmış. (sallallahü aleyhi ve sellem) hacc'la ömrenin bu babda bir olduklarını haber vermiştir. Battal'e göre Resûlüllah (sallallahü aleyhi ve sellem): «Haccederken ne gibi dualar okur, zikirler yaparsan, Umrede de ayni şekilde hareket et. Zîra bu hususta hacc ile ömre müşterektir.» demek istemiştir. Nevevî'nin kanaati da budur. Ya’lâ'nin Resûlüllah (sallallahü aleyhi ve sellem)'i vahiy halinde görmek isteyerek başını onun örtüsünün altına sokması ve Hazret-i Ömer'in buna müsaade etmesi, Peygamber (sallallahü aleyhi ve sellem)’in bu gibi şeylere müsaade buyurduğunu bildiklerine hamlolunur. Zira vahiy halini müşahade eden kimsenin imanı artar. (sallallahü aleyhi ve sellem)’in vahiy halinde kızarması ve horuldaması, vahiyin şiddet ve sıkletinden dir. Hattâ vahyin şiddetinden bazen avazının çıktığı kadar seslendiği rivâyet olunmuştur",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 12
			}
		}
	]
}