{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2815,
			"arabicnumber": "1185",
			"text": "(Bana Abbâs b. Abdilaziz El-Anberl rivâyet etti. ki): Bize Nadr b. Muhammed El-Yemâmi rivâyet etti. ki): Bize İkrime yani İbn Ammar rivâyet etti. ki): Bize Ebû Zümeyl, İbn Abbâs (radıyallahü anhüma)'dan naklen rivâyet etti. Şöyle dedi: Müşrikler «Tekrar icabet sana. Senin şerikin yoktur.» derlerdi. Resûlüllah (sallallahü aleyhi ve sellem) de: size, «Yeter yeter.» buyurur, bunun üzerine müşrikler: «Yalnız bir şerik müstesna, o senin şerikindir, sen, ona ve onun Mâlik olduğu her şey'e Mâliksin.» derlerdi. Onlar, bunu Kabe'yi tavaf ederken söylerlerdi. Iyâz'ın beyânına göre «Sadd, kadd» kelimeleri «kadın, kadın» şeklinde de rivâyet olunmuştur. Bunun mânâsı: «Bu söz size yeter. Fazla konuşmayın.» demektir. (sallallahü aleyhi ve sellem)’in sözü de burada sona erer. Hadîsin geri kalan sözleri râvinin naklidir. Anlaşılıyor ki Peygamber (sallallahü aleyhi ve sellem) müşriklerin sonunda şirk koşacaklarını bildiği için sözlerini oraya vardırmadan kesmek istemiştir. Yani: «Sadece, tekrar icabet sana. Senin şerikin yoktur.» sözüyle iktifa etmelerini emir buyurmakla kendilerini tevhide davet buyurmuştur. değiştikçe telbiyeyi tazelemek müstehabdır. Meselâ sabah ve akşam olurken, yokuş çıkarken, aşağı inerken, oturup kalkarken, va'sı-taya binip inerken, namaz sonlarında ve arkadaşlarla bir yere geldikte fazla telbiyede bulunmalıdır. bir defada en az üç kere söylemek, araya insan sözü katmamak dahi müstehabdır. (631-676) diyor ki: «Telbiyeden sonra Peygamber (sallallahü aleyhi ve sellem)’e salâvat getirmeli ve Allah'dan gerek kendisi gerekse dilediği müslümanlar için istekte bulunmalıdır. Dileğin efdalı ridvânı ve cenneti istemek, cehennemden Allah'a sığınmaktır. Hoşa giden bir şey görüldüğü zaman: Lebbeyk, hakîki hayat, âhiret hayâtıdır, demelidir...»",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 25
			}
		}
	]
}