{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 282,
			"arabicnumber": "100",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Abdullah b. Berrad el-Eş'arî ve Ebû Küreyb rivayet ettiler. Dedilerki: Bize Ebû Usame, Büreyd'den, o da Ebû Bürde’den, o da Ebu Musa'dan, o da Nebi (Sallallahu Aleyhi ve Sellem) den naklen rivayet etti. Nebi (Sallallahu aleyhi ve Sellem): \"Bize karşı silah taşıyan bizden değildir\" buyurdu. Diğer tahric: Buhari, 6660; Tirmizi, 1459; İbn Mace, 2577; Tuhfetu'l-Eşraf, 9042 NEVEVİ ŞERHİ AŞAĞIDA DAVUDOĞLU AÇIKLAMA: Hadisin ma'nası: Haksız yere müslümanlarla harb etmek ve onları öldürmek için silah taşıyan kimse bizim yolumuzda değildir. Demektir. Çünkü bir müslünıanın din kardeşi üzerindeki hakkı, ona karşı silahlanarak öldürmeye çalışması ve bu suretle onu korkutması değil bilakis ona yardım etmesi ve onun namına düşmanlariyle çarpışmasıdır. Kirmanî «Bizden değildir» cümlesini «Bizim sünnetimize tabi olanlardan ve yolumuzda gidenlerden değildir» şeklinde tefsir etmiştir. Yoksa böylelerin dinden çıktığı kasdedllmemiştir. Ancak Süfyan b. Uyeyne «Bizden değildir.» sözünü «Bizim yolumuzda gidenlerden değildir.» şeklinde tefsir etmekten hoşlanmaz, «Bu söz ne çirkin.» dermiş, Zira o cümleyi hiç te'vil etmemeyi daha müessir bulurmuş. Kirmanı: «Biri mütecaviz olan iki taifeye ne buyurursun?» diye bir sual irad etmiş; buna yine kendisi: «Mütecaviz olan taifa Nebi (Sallallahu Aleyhi ve Sellem)'in sünnetine tabî* olmamıştır.» cevabını vermiştir. Bittabi haksız yere müsîüman öldürmeyi helal i'tikad eden kafir olur. Buhari'nin «Kitabü'l-İnıan» ile «Kitabü'ıntk» da, Müslim 'inde «Kitabu'I-Fiten» de ittifakla tahric ettikleri Ahnef b. Kays hadisinde Resulullah (Sallallahu Aleyhi ve Sellem): «iki müsliman kılıçlariyle karşılaşırlar da biri diğerini öldürürse hem kaatil hem maktul cehennemi boylarlar...» buyurmuştur. Hadisin tamamı, yeri gelince görülecektir. NEVEVİ ŞERHİ (276-278 numaralı hadisler): Nebi (Sallallahu aleyhi ve Sellem)'in: \"Bize karşı silah taşıyan bizden değildir\" (2/107) buyruğunu İbn Ömer, Seleme ve Ebu Musa rivayet etmiştir. Seleme'nin rivayetinde: \"Bize karşı kılıç çeken\" şeklindedir. Ebu Musa'nın isnadında (278) bir incelik vardır. O da bu rivayetin isnadındaki bütün raviler Kufelidir. Bunlar: \"Ebu Bekr b. Ebi Şeybe, Ubeydullah b. Berrad ve Ebu Kureyb dediler ki: Bize Ebu Usame, Bureyd' den tahdis etti. O Ebu Burde' den, o Ebu Musa'dan\" senedinde zikredilenlerdir. Berrad isminde re harfi şeddelidir. Ebu Kureyb'in adı Muhammed b. el-Ala' dır. Ebu Usame'nin adı Hammad b. Usame'dir. Bureyd isminde be harfi ötrelidir. Ebu Burde'nin adı Amir'dir, Haris olduğu da söylenmi~tir. Ebu Musa'nın adı ise Abdullah b. Kays'dır. Hadisin anlamı: Kitabın baş taraflarında geçtiği üzere ehl-i sünnetin ve fukahanın kaidesi şudur: Haksız yere herhangi bir tevilde bulunmaksızın ve helal da kabul etmemekle birlikte Müslümanlara karşı silah taşıyan bir kimse asidir, bundan dolayı kafir olmaz. Eğer helal kabul ederse kafir olur. Hadisin teviline gelince; bunun herhangi bir tevil yapmaksızın böyle bir işi helal kabul eden kişi hakkında olduğu kabul edilir. Böyle bir kişi kafir olur ve dinden çıkar. Bunun, böyle bir kimse bizim tam ve eksiksiz uygulamalarımız ve hidayet yolumuz üzere değildir anlamında olduğu da söylenmiştir. Süfyan b. Uyeyne (rahimehullah), böyle bir kişi bizim yolumuz üzere değildir, diye açıklayanların bu açıklamasını hoş görmez ve bu söz ne kötüdür, derdi. Yani bu söz nefisleri daha bir etkilesin, böyle bir işe kalkışmaktan daha ileri derecede alıkoysun, diye onu tevil etmezdi, demektir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 188
			}
		}
	]
}