{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2822,
			"arabicnumber": "1187.05",
			"text": "(Bana Harmeletü'bnü Yahya rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihâb'dan naklen haber verdi. Ona da Salim b. Abdillah, Salim'e de Abdullah b. Ömer (radıyallahu anhüma) haber vermiş. ki: Resûlüllah (sallallahü aleyhi ve sellem)'i Zü’l-Huleyfe'de hayvanına binerken gördüm. S«nr« hayvanı kendisini kaldırarak doğrulttuğu vakit telbiye getirdi.» Hadisi Buhârî «Kitâbul-Vudu'» ve « Kitâbu’l-Libas »da, Ebû Dâvud «Kitabu'l-Hacc»da, Tirmizî «Şemail» de, Nesâî «Kitâbul-Tahâra»da muhtelif râvilerden tahric etmişlerdir. Rüknü Yemâni:Kabe'nin köşelerinden Hacer-i Esvea'in bulunduğu köşedir. Bu köşe Irak tarafına baktığı için ona «RÜkn-ü Irâki» dahi derler. göre Rüknü Yemânı, Hacer-i Esved'in bulunduğu köşeden evvelki köşedir. Yemen tarafına baktığı için ona «Rükn-ü Yemâni» denilmiştir. Bu iki köşeye Yemâniyyan» derler. kalan iki köşeye de «Şamiyyan» denilmiştir. Ulemânın beyanına göre «Yemâni» denilen köşeler Hazret-i İbrâhim (aleyhisselâm)’ın attığı temel üzerinde kalmışlardır. Sami denilenlerin yeri değiştirilmiştir. Bundan dolayıdır ki, «Rükn-ü Şâmi» denilen iki köşeye- istilâm yapılmaz. İstilâm Yemâni denilen köşelere yapılır. Hacer-i Esved'e elle dokunmak yahut öpmekdir. yapamayanlar sopa gibi bir şeyle dokunarak, dokundukları şeyi öperler. denilen ayakkabılarından murâd: Tabanlanmış sığır derisinden yapılan ayakkabıdır. göre septiyye: Derisi üzerinde kıl bulunmayan ayakkabıdır. Arapların âdeti deriyi tabaklamadan kılları ile ayakkabı yapmakmış. Tabaklanmış deriler Tâif gibi yerlerde yapılır, bunlardan yapılan ayakkabıları zenginler giyermiş. Şerîf'deki sarıya boyanma tâbiri ile elbisenin boyanması ifâde olunmuştur. abdest almakdan murâd: Abdest aldıktan sonra onları yaş ayakla giymektir. Zi’l- Hicce'nin 8. günüdür. Bu güne ne için «Terviye» denildiği ihtilaflıdır. Bâzılarına göre Mina ile Araf at'da su bulunmadığından o gün insanlar zemzemden kana kana su içtikleri ve su tedarik ettikleri için bu isim verilmiştir. bir kavle göre: Âdem (aleyhisselâm), Hazret-i Havva'yı o gün gördüğü için, başka bir kavle göre Cibrîl (aleyhisselâm) hacc ibâdetlerinin nasıl yapılacağını Hazret-i İbrahim'eo gün gösterdiği için terbiye denilmiştir. Abbâs (radıyallahü anh)'dan rivâyet olunan bir hadîse göre İbrahim (aleyhisselâm)'a oğlunu kesmesi iğin uyku hâlinde iken vahy gelmiş, ertesi gün bu rüyanın şeytânı mi, yoksa rahmanı mi olduğunu düşündüğü için o güne terviye denilmiştir. İbrahim ertesi akşam rûyâyı tekrar görünce rahmânî olduğunu anlamış, bu sebeple ertesi güne de «Arafe» denilmiştir. Abbâs (radıyallahü anh) hadîsini Beyhakî «Fedail-i Evkaat» bahsinde rivâyet etmiştir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 32
			}
		}
	]
}