{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 292,
			"arabicnumber": "105.03",
			"text": "Bize Ebu Bekr b. Ebî Şeybe rivayet etti. (Dedi ki) Bize Ebu Muaviye ile Vekî', A'meş'den rivayet ettiler. H. Bize Mincab b. el-Haris et-Temîmî de rivayet etti. Bu lafız onundur. (Dedi ki): Bize İbni Müshir, A'meş'den, o da İbrahim'den o da Hemmam b. el-Haris'den naklen haber verdi. Demiş ki: Mescitte Huzeyfe ile birlikte oturuyorduk. Bir adam gelip yanımıza oturdu. Huzeyfe'ye: Bu kişi sultana bazı şeyleri götürüyor, denildi. Huzeyfe ona işittirmek maksadıyla dedi ki: Resulullah (Sallallahu aleyhi ve Sellem)'i: \"Kattat (laf taşıyıcı) hiçbir kimse cennete girmeyecektir\" buyururken dinledim. DAVUDOĞLU İZAHI İÇİN buraya tıklayın NEVEVİ ŞERHİ (286-288 numaralı hadisler): Bir rivayette: \"Cennete koğuculuk yapan (nemmam) girmeyecektir\" denilirken diğerinde \"kattat\" denilmektedir ki bu da birincisinin aynısıdır. Çünkü kattat ile nemmam aynı anlamdadır (koğucu demektir). Cevheri ve başkaları da yaptıkları açıklamalarda bu iki kelimenin aynı anlamda olduklarını ifade etmişlerdir. İlim adamları der ki: Nemime (denilen koğuculuk) insanların sözlerini aralarını bozmak maksadıyla birinden diğerine aktarmaktır. İmam Ebu Hamid el-Gazzali (rahimehullah) el-İhya adlı eserinde şöyle diyor: Şunu bil ki, koğuculuk çoğunlukla başkasının söylediği sözleri hakkında söylediği kimseye taşımaktır. Filan kişi senin hakkında böyle konuşuyor demek gibi, ama koğucu luk sadece bu hale ait değildir. (2/112) Aksine nemime (koğuculuk) açığa çıkartılması hoş olmayan şeyleri açıklamak diye tanımlanır. Sözü başkasına aktarılan kişi yahut kendisine aktarılan şahıs ya da üçüncü bir kişi bundan ister hoşlansın, ister hoşlanmasın, açığa çıkartılan bu husus ister kötülemek kastıyla, ister işaret yoluyla, ister ima yoluyla yapılsın yine fark etmez. Çünkü koğuculuğun gerçek anlamı açığa çıkartılmasından hoşlanılmayan gizli saklı şey üzerindeki perdeyi kaldırıp, sırrı ifşa etmektir. Birisi, bir kimsenin kendisine ait bir malı sakladığını görse, sonra bunu başkasına söylese, bu dahi koğuculuktur. Kendisine söz taşınıp da filan kimse senin için şöyle diyor yahut senin aleyhine şunu yapıyor denilen bir kişinin şu üç hususa dikkat etmesi onun görevidir. 1- Onun doğru söylediğini kabul etmeyecek. Çünkü bu kişi koğuculuk yapan (nemmam) fasık birisidir. 2- Ona bu işi yapmamasını söylemeli, ona öğüt vermeli, ona yaptığı işin çirkin olduğunu bildirmelidir. 3- Allah için ona buğz etmelidir. Çünkü böyle bir kişi Allah tarafından buğzedilen birisidir, yüce Allah'ın buğz ettiği kimseye de buğz etmek icap eder. 4- Hazır bulunmayan kardeşi hakkında kötü düşünce beslememetidir. 5- Kendisine aktarılanlar onu tecessüste bulunmaya ve söylenip söylenmediğini araştırmaya itmemelidir. 6- Koğuculuk yapana yasakladığı işi kendisi için uygun görmemelidir. Dolayısıyla kendisine koğuculuk yoluyla aktarılan hakkındaki sözü kendisi aktarıp, filan kişi bunu anlattı, diyerek bu yolla kendisi koğuculuk yapan birisi olmamalı ve yasakladığını işleyen kişi durumuna düşmemelidir. -Gazzali (r.a.)'ın açıklamaları burada bitmektedir.- Koğuculuk hakkında sözü edilen bütün bu hususlar eğer bunda şer'i bir masıahat yoksa sözkonusudur. Şayet ihtiyaç başkasının sözünü aktarmayı gerektirecek ise yasak değildir. Bir kimsenin diğerine bir insan seni yahut aileni öldürmek istiyor ya da malına zarar vermek istiyor diye haber vermesi yahut imama veya kamu görevlisi bir yetkiliye bir kimse şu işi yapıyor ve bir kötülük işliyor diye haber vermesi gibi. Bu durumda yetkilinin bu hali açığa çıkarması ve ortadan kaldırması gerekir. Bütün bunlar ve benzerleri haram değildir. Hatta duruma göre bunun bir kısmı vacip, bir kısmı müstehab da olabilir. İsnatta \"Ferruh\" ismi geçmektedir ki munsarıf değildir. Daha önce birkaç defa da geçti. Son senette: \"Bize Ebu Bekr b. Ebi Şeybe tahdis etti. .. \" Senedindeki ravilerin hepsi Kufelidir. Huzeyfe b. el-Yeman müstesnadır çünkü o Medain' i yurt edinmişti. Resulullah (Sallallahu aleyhi ve Selleml'in: \"Koğucu bir kimse cennete giremez\" buyruğu hakkında da daha önce benzerleri ile ilgili sözkonusu edilen iki türlü tevil (açıklama) sözkonusudur. Birincisi bu haram olduğunu bilmekle birlikte herhangi bir tevilde bulunmaksızın bu işi helal kabul eden kişi hakkında yorumlanmasıdır. İkincisi ise böyle bir kişi umduklarını elde edenlerin cennete girmeleri gibi cennete giremeyecektir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 198
			}
		}
	]
}