{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2935,
			"arabicnumber": "1211.26",
			"text": "(Bize Yahya b. Habib El-Hârisi rivâyet etti. ki): Bize Hâlid b. Haris rivâyet etti. ki): Bize Kurre rîvâyet etti. ki): Bize Abdülhamîd b. Cübeyr b. Şeybe rivâyet etti. ki): Bize Safiyye binti Şeybe rivâyet eyledi. ki: Âişe (radıyallahü anha) Yâ Resûlallah! Başkaları iki ecirle dönerken ben bir ecirle ini döneceğim? dedi. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) Abdurrahmân b. Ebi Bekr'e onu Ten'îm'e götürmesini emir buyurdu. (radıyallahü anha) bunu şöyle anlattı: «Kardeşim beni devesinin üzerinde terkisine aldı. Ben baş örtümü kaldırarak boynumu açmağa başladım. Abdurrahmân deveyi sürdüğü çubukla ayağıma vurdu. Ona: (Burada) bir kimse görüyor musun? dedim. Hâsılı ömreye niyetlendim. Sonra dönüp geldik. Resûlüllah (sallallahü aleyhi ve sellem) cl-Muhassab'da iken yanına vardık. ki, bütün bu rivâyetler aynı hâdiseye aiddir. Şimdi bunları birer birer gözden geçirerek bâzı cümlelerini izah edelim: Bekr b. Ebî Şeybe rivâyetinde Hazret-i Âişe: hacc edilecek sanıyorduk» demiştir. Bunun sebebi Ashâb-ı Kiram'in hacc aylarında Ömre yapılamaz zannetmeleridir, Yahut bu sözle ashabın ekseriyetle hacca niyet ettiklerini, bir ihtimâle göre de Peygamber (sallallahü aleyhi ve sellem)’in hâlini anlatmak istemiştir. Âişe (radıyallahü anha) ömreye niyetlenmişti. Mekke'ye sekiz-on mil mesafede bulunan bir yerdir. Oraya vardıkları zaman Hazret-i Âişe hayz görmüş ve hacedan mahrum kalıyorum endişesîle ağlamıştır. Bu sırada Resûlüllah (sallallahü aleyhi ve sellem) onun yanına girmiş; niçin ağladığını anlayınca onu teselli için: Allah'ın Âdem kızlarına takdir ettiği bir şeydir» buyurmuştur. Yâ. ni: «Bu iş sâde senin başında değildir; o bütün benât-ı Âdem'in başına gelen bir hâldir; nitekim bevl ve kazurat gibi şeyler bütün insanlara âmm ve şâmildir.» bu hadîsle istidlal ederek hayzın bütün benât-ı Âdem'e şâmil olduğunu söylemiş; onu ilk defa Benî İsrail kadınlarının gördüğünü iddia edenlere red cevâbı vermiştir. Hakem'in sahih bir isnâdla Hazret-i İbn Abbâs’dan rivâyet ettiği bir hadîsde: Havva (Aleykisselâm) cennetten çıkarıldıktan sonra onunla başlamıştır.» denilmiştir. b. Ubeydillâh rivâyetindeki «Hasbe gecesinden murâd: hacıların Mina'dan dönüşde geceledikleri «el-Muhassab»dır. Bu yer Mekke ile Mina arasındadır. Teşrik günlerini müteâkıb orada bir gece kalmışlardı. b. Abdîllâh b. Nümeyr rivâyetindeki: «Ömre de duydum» cümlesi Kâdı İvaz'ın beyânına göre Müslîmin ekseri râvîleri tarafından ba şekilde tesbît edilmiştir. Mezkûr cümleyi ; «Halbuki ben ömreden mahrumum» diye rivâyet edenler de olmuştur ki, doğrusu da budur. (sallallahü aleyhi ve sellem)’in: «Nen var?» suâline Hazret-i Âişe'nin: «Namaz kılamıyorum» diye cevab vermesi hayzm en güzel kinayelerinden biridir. Bekr b. Ebî Şeybe rivâyetindeki: «İki ibâdetden murâd: hacc ile ömre, «bir ibâdet» ise yalnız hacctır. Netekim müteâkıb rivâyette bu cihet tasrîh olunmuştur. senin nafakana göredir» cümlesindeki «yahut» kelimesi Resûlüllah (sallallahü aleyhi ve sellem)’in sözüdür; ve tenvî için kullanılmıştır; yahut râvînindir. Bu takdirde «meşakkate» mi, yoksa «nafakana göre» mi buyurduğunda râvi şekketmiş demektir. b. Harb rivâyetindeki «Safiyye: zannederim sizi ancak ben alıkoyacağım dedi.» cümlesiyle, ümmül-müminîn Hazret-i Safiyye (radıyallahü anh) nın veda tavafından evvel hayz gördüğüne işaret olunmuştur. Hazret-i Safiyye bu sözü Peygamber (sallallahü aleyhi ve sellem) Medine'ye dönmek istediği zaman söylemiş; ve hayzından temizlenerek veda' tavafını yapması için kafileyi bekleteceğinden dolayı Özür beyân etmiştir. Resûlüllah (sallallahü aleyhi ve sellem) kendisine: hayrını versin...» mukaabelesinde bulunmuştur. Fahri Kâinat (sallallahü aleyhi ve sellem) Efendimiz bu mânâda «akrâ» ve\"«halkaa» kelimelerini kullanmıştır. Allah vücudunu yaralasın; «halkaa» traş etmek suretiyle elem versin, yahut boğazını acıtsın, mânâlarına gelir. Ebû Ubeyd: «Hadîs uleması bunu (akrâ, halkaa) diye rivâyet ederlerse de doğrusu (akran halkan) dır. Vukuunu dilemedikleri bir şeye duâ etmekde Arapların âdeti budur.» demiştir. Kendisine: Bu kelimenin «akrâ» şeklinde okunmasını niçin caiz görmüyorsun? denilince: Çünkü «fa'lâ» vezni sıfat olarak kullanılır: duada kullanılmaz» cevâbını vermiştir. sahibi «akraa»nın burada masdar olduğunu söylüyor. Bâzılarına göre bu cümleden murâd: «Safiyye uğursuzluğundan dolayı kavmini yaralar; onları traş eder» demek olduğunu söylemişlerdir. «Akrâ»nın hayız gören mânâsına geldiğini iddia edenler de vardır. (631-676) diyor ki: «Akra'nın: Allah onu kısır bıraksın! halkaanın ailesi için uğursuz yapsın! mânâlarına geldikleri de söylenir. Bu kavillerin her birine göre cümlenin asıl mânâsı, anlattığımız şekildedir. Sonraları Araplar mânâyı genişleterek onun hakikatini kas-d'etmez olmuşlardır. Netekim (elleri topraklansın!) ve (Allah belâsını versin, ne cesurmuş; ne de şâirmiş!) sözleri dahi bu kabildendir.» Ekrem (sallallahü aleyhi ve sellem)'in Hazret-i Safiyye'ye: «Zarcın yok, dön!» buyurması: «Minâ’dan veda' tavafını yapmadan Medine'ye dön!» manasınadır. Bir yere giren, münhebit yahud mütehebbit: bir yerden çıkan demektir. Müennesleri: münhebita ve mühebbita gelir. Bekr b. Ebî Şeybe'nin ikinci rivâyetinde: «Resûlüllah (sallallahü aleyhi ve sellem) öfkeli bir hâlde gelerek yanıma girdi.» deniliyor. Buna sebeb, verdiği emre karşı ashabının tereddüd göstermeleridir. Zîrâ Peygamber (sallallahü aleyhi ve sellem) onlara traş olarak ihramdan çıkmalarını emir buyurmuş; onlar bu hususda mütereddid davranmışlardı. Bunun üzerine: bıraktığım şu vak'a tekrar karşıma çıksa yanımda hedy getirmez; onu satın alırdım; sonra bunların çıktığı gibi ihramdan çıkardım» buyurdular. Resûlüllah (sallallahü aleyhi ve sellem)'in bundan muradı: «Ashabınıdan müşahede ettiğim bu tereddüdü ihrama girmeden bilmiş olsaydım, ben de ömreye niyet eder; yanımda hedy getirmez, onu Mekke'ye vardığımda satın alır; ömreden sonra ihramdan çıkardım.» demektir. b. Hatim rivâyetindeki «rîcfr günü»nden murâd: Hacıların Mina'dan çekildikleri gündür. rivâyetteki: «Safa ile Merve arasında tavaf «Safa ile Merve arasında yapılan say»den ibarettir. b. Habîb rivâyetinde Hazret-i Âişe'nin başörtüsünü boynundan açtığı, kardeşi Abdurrahman'ında deveyi sürdüğü çubukla onun ayağına vurduğu bildiriliyor. Biradan anlaşılıyor ki Âişe (radıyallahü anha) oralarda kimse olmadığını görerek, sıcaktan biraz nefes almak için başörtüsünü aralamış, kardeşi ise tesettüre riâyet etmediği için ayağına vurmuştur. Hazret-i Âişe «Burada hiç bir kimse görüyor musun?» demekle kendilerinin insandan hâlî bir yerde bulunduklarına, karşılarında kendisinden kaçmak îcâb edecek ecnebi bir kimse bulunmadığına işaret etmiştir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 144
			}
		}
	]
}