{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2937,
			"arabicnumber": "1213.01",
			"text": "Bize Kuteybetu'bnü Saîd ile Muhammed b. Rumh hep birden Leys b. Sa'd'dan rivayet ettiler. Kuteybe (Dediki): Bize Leys, Ebû'z-Zübeyir'den, o da Câbir (Radiyallahu anh)'dan naklen rivayet eyledi. Câbir şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) ile birlikte biz haec-ı ifrâda; Âişe (Radiyallahü anha) ise Umreye niyet ederek (Mekke'ye) geldik. Şerife vardığımızda Âişe hayzını gördü. Mekke'ye gelince biz, Kabe'yi ve Safa ile Merve arasını tavaf ettik. Resulullah ((Sallallahu Aleyhi ve Sellem), yanında Hedy bulunmayanlarımıza ihramdan çıkmamızı emir buyurdu. — «Bize ne helâl olacak?» dedik; Resulullah (Sallallahu Aleyhi ve Sellem): — «Ihrâmlıya haram olan her şey!» buyurdular. Bunun üzerine kadınlarla cima' ettik, güzel kokular süründük ve elbisemizi giydik. Arafe günüyle aramızda ancak dört gece vardı. Senra terviye günü tekrar hacca niyet ettik. Bundan sonra Resulullah (Sallallahu Aleyhi ve Sellem), Âişe (Radiyallahu anha)'nın yanına girdi. Âişe ağlıyordu. Ona: — «Hâlin nedir?» diye sordu. Âişe: — «Hâlim hayız görmüş olmamdır; başkaları ihramdan çıktı, ben çıkamadım; beyti de tavaf edemedim. Âlem şimdi hacca gidiyorlar.» dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem). — Bu, Allah'ın, Âdem kızlarına tekdir buyurduğu bîr şeydir. Yıkan sonra hacca niyet et!» buyurdular. Âişe de öyle yaptı. Ve bütün vakfe yerlerinde durdu. Temizlendiği vakit Kabe'yi ve Safa ile Merve'yi tavaf etti. Sonra Nebi (Sallallahu Aleyhi ve Sellem) : — «Haccınla Umrenin ikisinden beraberce hille çıktın.»buyurdu. Âişe: — «Yâ Resûlullah! Ben, içimden hacca gidip, beyti tavaf etmediğimi hissediyorum» dedi. Nebi — «Öyle ise yâ Abdirrahmân! Bunu götür de Ten'îmden Umre yaptır!» buyurdular. Bu vak'a Hasbe gecesi olmuştu",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 146
			}
		}
	]
}