{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3041,
			"arabicnumber": "1257.02",
			"text": "Bana bu hadîsi Züheyr b. Harb ile Muhammedu'bnü'l-Müsennâ dahi rivâyet ettiler. (Dediler ki): Bize Yahya yani El-Kattan, Ubeydul-lah'dan bu isnadla rivâyet etti. Züheyr'in rivâyetinde: «Bathâ'daki yukarki yoldan...» demiş. hadîsi Buhârî, Ebû Dâvûd ve Nesâî hacc bahsinde muhtelif râvilerden tahrîc etmişlerdir. murâd Zülhuleyfe mescidinin yanındaki ağaçtır. Medine'ye altı mil mesafede bulunan bir yerdir. Aslında her dağın sarp yeri yahut yüksek yoludur. Burada ondan murad Mekke'nin El-Muallât denilen meşhur kabristanının yukarsındaki yoldur. Bu yol vaktiyle çıkılması güç, sarp bir yermiş. Sonra Hazret-i Muâviye tarafından düzeltilmiş. Daha sonra Abdul Melik ve Mehdi zamanlarında ve sekizyüz onbir tarihlerinde mevziî tamirler yapılmış. Mısır Sultanı El-Müeyyed zamanında kamilen tamir olunmuştur. Mekke'ye girilen yukarki yola Kedâ , çıkılan alt yola da Kiidâ derler. dan girip aşağıki yoldan çıkmasının hikmeti ibrahim (aleyhisselâm)’in nidası yüksek, yerden yapıldığı içindir. Bir de maksada yüksek yerden girmek ve alçak yerden çıkmak daha münâsiptir. Bâzılarına göre Mekke'ye üst yoldan girilirse Kabe-i Muazzama karşısına geldiği için girerken bu yol tercih edilmiştir. Münafıklara İslâmiyetin kuvvet ve şevketini göstererek onları kızdırmak için bu yoldan girdiğini söyleyenler olduğu gibi bu hususta başka kaviller de vardır. (sallallahü aleyhi ve sellem) Medine'den Mekke'ye gitmek istediği zaman Zülhuleyfe yolunu tutar, geceyi Zül-huleyfe'de geçirdikten sonra yoluna devam edermiş. Dönüşte yine burada gecelermiş Teymî'ye göre bu hadîsden murâd Resûlüllah (sallallahü aleyhi ve sellem)’in Mekke'den çıkarken Zülhuleyfe yolundan, Mekke'ye girerken ise El-Muarras yolundan girmiş olmasıdır. Fakat Buhârî'nin rivâyeti bu izahın aksine yani bizim izah ettiğimiz şekildedir. İbn Battal Resûlüllah (sallallahü aleyhi ve sellem)'n bu seferleri ayrı ayrı yollardan yapmasını bayram namazlarına başka yoldan gidip başka yoldan dönmesine benzetmiştir. Bazıları ayrı ayrı yollardan gidip gelmenin kasdî değil bir tesadüf eseri olduğunu söylemişlerse de bu iddia doğru değildir. Resûlüllah (sallallahü aleyhi ve sellem) bunu tefâülen yahut gidip geldiği yollar kendisine şahit olsunlar diye yapmış olur. Nitekim buna kail olanlar da vardır",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 247
			}
		}
	]
}