{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3054,
			"arabicnumber": "1263.02",
			"text": "(Bana Ebû't-Tâhir rivâyet etti. ki): Bize Abdullah b. Vehb haber verdi. ki): Bana Mâlik ile İbn Cüreyc, Ca'fer b. Muhammed'den, o da babasından, o da Câbir b. Abdillah'dan naklen haber verdi ki, Resûlüllah (sallallahü aleyhi ve sellem) üç tavaf da hacerden hâcere ramel yapmış. Bu hadîsi Buhârî hacc bahsinde tahrîc etmiştir. de görüldüğü vecihle ramel sık sık adımlarla hızlıca yürümek ve yürürken omuzları sallamaktır. Habeb dahi bu mânâya gelir. Yedi tavafın ilk üçünde ramel ile yürümek müstehabdır. tavaftan murâd arkasından Safa ile Merve arasında sa'y yapılan tavâfdır. Bu da tavâf-ı kudüm ile tavâf-ı ifâza'da mütesav-verdir. Tavâf-ı vedâda sa'y yoktur. Ramel bir defaya mahsus olmak üzere meşru' kılınmıştır. Kadınlara tavaf ve sa'y esnasında ramel meşru' değildir. Bu hususta ulemâ müttefiktir. Sâfâ ile Merve arasındaki Mİ çukurudur. Buradan geçerken hızlıca yürümek bilittifâk müstehabdır. Hadîs-i şerîfd Safa ile Merve arasındaki sa'ye de mecazen tavaf denilmişdir. Çünkü sıfatları başka başka olsa da tavafla sa'yin her ikisinde hızlı yürüme vardır. secdeden murâd iki rek'ât namazdır. Bu namazın ulemâdan bâzılarına göre vacip, bâzılarına göre sünnet olduğunu yukarıda görmüştük. Hadîs-i şerîfde tavafla sa'y arasında tertîb vâcib olduğuna delîl vardır. Yani evvelâ tavaf sonra sa'y yapılacaktır. Cumhûru ulemâ'ya göre evvelâ sa'yi yapıp sonra tavaf etmek caiz değildir. Nevevî bu hususta seleften bâzılarının zayıf bir hilafı bulunduğunu kaydediyor. Esved'den murâd Kabe'nin bir köşesinde bulunan Hacer-i Esved'dir. Tavafa başlarken bu taşı istilâm etmek biliîtifâk tavafın sünnetlerindendir. Ramel dahi bu taştan başlıyarak yine onda bitirmek suretiyle yapılır. Rivâyetlerin bazılarındaki «Hacerden hacere» tâbirinden murâd budur",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 260
			}
		}
	]
}