{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3065,
			"arabicnumber": "1268.02",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile İbn Nümeyir hep birden Ebû Hâlid'den rivâyet ettiler. Ebû Bekir dedi ki: Bize Ebû Hâlid-i Ahmar, Ubeydullah'dan, o da Nâfi'den naklen rivâyet etti. Nâfi' şöyte demiş: Ömer'in eliyle Hacer-i Esved'i istilâmda bulunduğunu gördüm. Sonra elini öptü ve: Ben, bunu Resûlüllah (sallallahü aleyhi ve sellem)’in yaptığını gördüm göreli terk etmedim! dedi.» hadîsi Buhârî ile Nesâî «Hac» bahsinde tahrîc etmişlerdir. Rükn-ü Yemânî'den murâd: Hacer-i Esved'in bulunduğu köşe ile ondan sonra gelen köşedir. Esved: Kâbe-i Muazzama'nın şarkında ve kapısının yanındaki köşededir. Asıl rükn-ü Yemânî , ondan sonraki köşenin ismidir. Araplar, tağlîb tarikiyle anne ile babaya ebeveyn; güneşle aya: Kamereyn, dedikleri gibi, bu iki rükne de «Yemâniyeyn» adını vermişlerdir. iki rüknüne de Şâmiyyeyn adı verilmiştir. Esved'in bulunduğu rükne: Rükn-ü Esved de derler. de beyân olunduğu vecîhle Rükn-ü Esved'in iki fazilet ve meziyeti vardır. Bunlardan biri mezkûr köşenin Hazret-i İbrâhim (aleyhisselâm)’ın kurduğu temel üzerinde bulunması, diğeri de Haceri’l Esved'in kurduğu temel üzerinde bulunması, diğeri de Hacerü’l- Esved'in bu köşede olmasıdır. Yemânî'nin bir fazileti vardır. O da İbrahim (radıyallahü anh)’in kurduğu temel üzerinde bulunmasıdır. rükünlerde bu meziyetler yoktur. sebepledir ki Hacer-i Esved istilâm ve öpülmek husûsiyetleriyle temayüz etmişdir. Rükn-ü Yemânî'de bir fazilet olduğu için, o yalnız istilâm olunur. iki rükünde husûsî fazilet bulunmadığı sebeple, onlar ne istilâm olunur, ne de öpülürler. diyor ki: «İki Rükn-ü Yemânî'yi istilâm etmenin müstehab olduğunda ümmetin bütün ulemâsı müttefiktir. Öteki rükünlere istilâm yapılamıyacağma da cumhûr-u ulemâ ittifak etmişlerdir. selefden Bazıları, onlara istilâmı da müstehab saymışlardır. Hasan ve Hüseyin ile Abdullah b. Zübe-yir, Câbir b. Abdillâh, Enes b. Mâlik, Urvetü'bnü ez-Zübeyir ve Ebû'ş-Şa'sâ Câbir b. Zeyd (radıyallahü anhüm) hazerâtı bunlar meyânindadır. Ebû Tayyib'in beyânına göre şehirler İmâmlarıyla fukahâ, geri kalan iki rüknün istilâm edilmiyeceğine bilittifâk kaail olmuşlardır. bâbda sahabe ile Tabiîn arasında bir gûnâ hilaf vâkî olmuşsa da onlardan sonra hilaf kalmamış ve bütün ulemâ mezkûr iki rüknün istilâm edilmiyeceğine ittifak eylemişlerdir.» meshetmekten murâd: İstilâmdır. şiddetde ne de serbest zamanda istilâmı terketmedim.» cümlesinden murâd: «Tavaf esnasında kalabalık olsun obuasın istilâmı terketemedim.» demektir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 271
			}
		}
	]
}