{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3073,
			"arabicnumber": "1272",
			"text": "Bana Ebû't-Tâhir ile Harmeletü'bnu Yahya rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihâb'dan, o da Ubeydullah b. Abdillâh b. Utbe'den, o da İbn Abbâs'dan naklen haber verdi ki, Resûlüllah (sallallahü aleyhi ve sellem) veda haccında rüknü bir baston ile istilâm ederek, deve üzerinde tavaf eylemiş. hadîsi Buhârî, Ebû Dâvûd ve İbn Mâce «Hacc» bahsinde tahrîc etmişlerdir. Ucu kıvrık sopa yani «Baston» demektir. üzerinde giden bir kimse bununla yere düşen eşyasını kaldırır. Battal (? — 444): Resûlüllah (sallallahü aleyhi ve sellem)’in hayvan üzerinde tavaf ederek bastonla istilâmda bulunması, rahatsızlığından dolayı olabilir» diyor. Ebû Dâvûd'un rivâyetinde «Peygamber (sallallahü aleyhi ve sellem) rahatsız olarak Mekke'ye geldi de hayvanı üzerinde tavaf etti. Rükne vardığı zaman onu bastonla istilâm etti. Tavafını bitirdikte hayvanını çöktürdü ve iki Tek'ât namaz kıldı.» denilmektedir. beyânına göre Şâfiîler'ce tavafı yürüyerek yapmak efdaldır. Hayvan üzerinde tavaf, ancak hastalık gibi bir özür sebebiyle yahut cevazını beyân için yapılır. hayvan üzerinde tavaf etmekte kerahet yoksa da evlânın hilâfınadır. İmâmü'l-Haremeyn (419-478): «Bir kimse mescidi pisleyeceğinden emin olmadığı hayvanı mescide sokar da pisletmemek imkânı bulursa bu caizdir. Aksi takdirde o hayvanı mescide sokmak mekruhtur-» demiştir. üzerinde tavaf hususunda erkekle kadın müsavidir. Omuzlar üzerinde taşınarak tavaf ettirilen kimse dahi hayvana binmiş hükmündedir. İmâm Ahmed ile Pâvûd-u Zahirî ve İbn Münzir'in kavilleri de budur. A'zam'la İmâm Mâlik'e göre bir Özürden dolayı hayvan üzerinde tavaf etmek caizdir. Özürsüz olursa kurban kesmek îcâb eder. A'zam'a. göre Mikke'de bulunduğu müddetçe tavafı iade eder. Yürümeye kudreti varken sürünerek tavaf etmek sahih olmakla beraber mekruhtur. yürümekle sürünmek arasında fark görmemişlerdir. Peygamber (sallallahü aleyhi ve sellem)’in hayvan üzerinde yaptığı tavafın, ya kalabalık sebebiyle yahut caiz olduğunu göstermek için veya hastalığından dolayı bir özüre mebnî olduğunu söylerler. bu hadîsle istidlal ederek devenin bevli temiz olduğunu söylemişlerdir. A'zam, İmâm Şafiî ve diğer ulemâya göre devenin bevli necistir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 279
			}
		}
	]
}