{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3081,
			"arabicnumber": "1277.03",
			"text": "Bize Amru'n-Nâkıd ile İbni Ebi Ömer hep birden İbni Uyeyne'den rivayet ettiler, İbni Ebî Ömer (Dediki): Bize Süfyân rivayet etti. (Dediki): Zührî yi Urvetü'bnü'z-Zübeyr'den naklen rivayet ederken dinledim. Urve şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Âişe'ye : — Ben, Safa ile Merve arasında sa'y yapmayan bir kimseye bir şey lazım geldiğini zannetmiyorum. Onların arasında sa'y yapmamış olmama da aldırış etmiyorum! dedim. Âişe: — Ne çirkin söz söyledin, ey kız kardeşim oğlu! Resulullah (Sallallahu Aleyhi ve Sellem) sa'y yapmış, Müslümanlar da bunu îfâ etmişlerdir. Binâenaleyh bu, bir sünnet olmuştur. Safa ile Merve arasında sn'y yapmayanlar ancak Müşellel'deki azgın Menâta telbiye getirenlerdir. islâmiyet gelince biz, bunu Nebi (Sallallahu Aleyhi ve Sellem)'e sorduk. Bunun üzerine Allah (Azze ve celle)-, (Şüphesiz ki Safa ile Merve, Allah'ın şeâirindendir. İmdi her kim Beyti hacceder yahut Umre yaparsa, bunların arasında sa'y yapmasından beis yoktur.) âyet-i kerîmesini indirdi. Eğer dediğin gibi olsaydı, âyet-i kerîme: (O kimseye sa'y yapmamakta bir beîs yoktur.) şeklinde inerdi; dedi.» Zühri demişki: «Ben, bunu Ebu Bekir b. Abdirrahman b. Haris b. Hişam'a söyledimde onun hoşuna gitti ve şöyle dedi: — İşte ilim budur! Vallahi ben, ulemâdan bir takım kimseleri şunu söylerken işittim: Araplardan Safa ile Merve arasında sa'y yapmayanlar: (Bizim, bu iki taş arasındaki sa'yimiz câhiliyet devrinden kalma bir âdettir.) derlerdi. Ensar'dan diğer bir takım Araplar : (Biz ancak beyti tavaf etmeye memur olduk. Safa ile Merve arasında sa'y yapmakla me'mûr değiliz!) diyorlardı. Bunun üzerine Allah (Azze ve Ceîle): (Şüphesiz kî Safa ile Merve, Allah'ın şeâirindendir.) âyet-i kerîmesini indirdi.» Ebû Bekir b. Abdirrahmân: «Zannederim bu âyet her iki fırka hakkında nazil olmuşdur.» dedi",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 287
			}
		}
	]
}