{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 312,
			"arabicnumber": "117",
			"text": "(Bize Ahmed b. Ahdete'd-Dabbî rivâyet etti. ki): Bize Abdülâziz b. Muhammed ile Ebû Alkamete'l-Fervî rivâyet ettiler. Dediler ki; Bize Safyân b. Süleym, Abdullah b. Selmandan o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti. ki: Resûlüllah (sallallahü aleyhi ve sellem): Allah Yemen'den, ipekden daha yumuşak bir rüzgâr gönderecek; bu rüzgâr kalbinde (Ebû Alkâme'nin rivâyetine göre) (bir dâne ağırlığında) (Abdülâzizin rivâyetine göre) (zerre mikdârı) imân bulunan hiç bir kimseyi sağ bırakmayacaktır.» buyurdular. mâ'nada bir çok hadiseler vârid olmuştur. Ezcümle: Allah Allah diyen kalmadıkça, kıyâmet kopmaz.», «Kıyâmet Allah Allah diyen hiç bir kimsenin üzerine kopmaz», «Kıyâmet ancak halkın kötüleri üzerine kopacaktır.» buyuruimuştur. Nevevî bu hadislerin hepsinin zahiri ma'naları üzere bırakıldığını yânî te'vile lüzum olmadığını söylüyor. Vakıa bir hadisde: bir taife kıyâmet gününe kadar hakka müzahir olmakta devam edeceklerdir.» Buyurulmuşsa da bu hadis yukarıda zikredilen hadislere muhalif değildir. ma'nası: «bu ümmetin bâzı ferdleri kıyâmet alâmetleri zuhur edinceye kadar hak dine yardımcı olacaklar,» demektir; hadisde Kıyâmete kadar» denilmiş olsa da maksad onun alâmetleridir. Binaenaleyhi bu babtaki hadislerin hepsi ma'nen müttehiddir; ve hepsinden murad: Kıyâmet yaklaşdığı, alâmetleri zuhur ettiği zaman demektir. Şerifdeki: «bir dâne ağırlığı yahud zerre mikdârı» ifadesi; «İmân artar, eksilir.» diyenlere delildir. «sahih olan mezheb budur.» diyor. Yemen'den, ipekten daha yumuşak bir rüzgâr gönderecek...» ibaresinden «mü'min kullara ikram için onların ruhları rifku mu-lâyeınetle kabzolunacak» ma'nasını çıkarıyorsa da Müslim sarihlerinden Muhammed el-Übbi Nevevî'nin bu sözünü mutlak olarak kabul etmeyerek şunları söylüyor: «Bu ma'na sözün gelişinden anlaşılmaktadır. Yoksa ne kolaylık göstermek ikrama delil olabilir; ne de güçlük göstermek şikâavete; Zira meşakkate duçar olmuş nice said kullar ve suhulete nail olmuş nice şakiler vardır. Meselâ: Zeyd b. Eslem'in babasından rivâyet ettiği bir hadisde: üzerinde, amelile eremediği bir derece kalırsa, ölüm ıztıra-bîle âhiretteki derecesini tamamlasın diye Allahü teâlâ ona ölümü şiddetli verir. Kâfirin de dünyada karşılığı verilmeyen bir eyiliğî olursa önada ölümü asan eyler.» buyuruimuştur. göre Âişe (radıyallahu anhâ): Resûlüllah (sallallahü aleyhi ve sellem)’in ne derece şiddetli ölüm ıztırabı çektiğini gördükten sonra ben hiç bir kimsenin kolay ölümüne imrenmem. Elini bir bardağın içine daldırıyor; yüzünü siliyor ve: bana ölümü asan eyle! zira ölümün sekerâtı vardır;» diyordu. zaman Fatıme: ab senin ıztırabm bana pek girân geliyor,» demiş; Resûlüllah (sallallahü aleyhi ve sellem): günden sonra babanın hiç iztırabi olmayacak, buyurmuştu., demiştir.» hadisde rüzgârın Yemen'den geleceği bildirilmiştir. Müslim'in kitabın sonunda, Deccâl hadislerinin akibinde tahriç ettiği bir hadisde bu rüzgârın Şam tarafından geleceği bildirilmektedir. İmâm Nevevî buna iki vecihle cevap vermiştir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 219
			}
		}
	]
}