{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 313,
			"arabicnumber": "118",
			"text": "Bana Yahya b. Eyyub, Kuteybe ve İbn Hucr hep birlikte İsmail b. Cafer'den tahdis etti. İbn Eyyub dedi ki: Bize İsmail tahdis etti, bana el-Ala babasından haber verdi, onun Ebu Hureyre' den rivayet ettiğine göre Resulullah (Sallallahu aleyhi ve Sellem) şöyle buyurdu: \"Kapkaranlık gecenin parçaları gibi fitneler ortaya çıkmadan önce (salih) ameller işlemekte elinizi çabuk tutunuz. (O zamanda) adam mümin olarak sabahlayacak, kafir olarak akşama varacak yahut mümin olarak akşama varacak, kafir olarak sabahlayacak. Dinini bir miktar dünya malı karşılığında satacak. \" Yalnız Müslim rivayet etmiştir; Tuhfetu'l-Eşraf, 13990 NEVEVİ ŞERHİ: Bu bapta Raswullah (Sallallahu aleyhi ve SellemI'in: \"Karanlık gecelerin parçaları gibi fitnelerden önce (salih) amel işlemekte elinizi çabuk tutun\" hadisi yer almaktadır. Hadisin anlamı ise salih am el işlemek imkansız hale gelmeden ve ayın göründüğü bir gece değil de karanlık bir gecenin karanlıklarının üst üste yığılması gibi pek çok ve oldukça uğraştırıcı fitneler ortaya çıkıp onlarla uğraşmak zorunda kalmadan salih amel işlemek için eli çabuk tutmaya bir teşviktir. Nebi (Sallallahu aleyhi ve Sellem) bu fitnelerin zorluk ve sıkıntılarının bir tür niteliğini zikretmektedir. O da kişinin mümin olarak akşama vardığı halde daha sonra kafir olarak sabahı etmesi hali yahut bunun aksidir. Burada ravi şüphe etmiştir. Bunun böyle olacak olması ise fitnelerin muazzamlığından dolayıdır. İnsan tek bir günde böyle büyük bir değişime uğrayacaktır. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Hadisin ma'nası: gece karanlıkları gibi yığın yığın fitneler zuhur edip iş işten geçmeden amel ve ibâdetlere teşviktir. Çünkü bu fitneler o kadar büyük ve korkunç olacak ki, onların şerrinden kimse ibâdet ve amellere vakit bulamayacaktır. Resulullah (Sallalhhu Aleyhi ve Sellem) bunların şiddetini: «kişi mu'min olarak sabahlayacak, kâfir olarak akşamlayacaktır.» buyurarak ifâde etmiştir. Yânı fitnenin dehşetinden insan bir günde bu derece muazzam tehavvüller geçirecek; günü gününe, saati saatine uymayacaktır. Hadisin sonunda râvî şek ederek: «Yahud; mu'min olarak sabahlar.» buyurdu, demiştir. kâfir olarak akşamlar; Resulullah (Sallallahu Aleyhi ve Sellem)'in bu ma'nada bir çok hadisleri vardır: «Beş şeyi beş şeyden önce ganimet bil: 1 - İhtiyarlamadan önce gençliğini, 2 - Hastalanmadan önce sağlamlığını, 3 - Meşgul olmadan önce boş zamanını, 4 - Fakirlemeden önce zenginliğinin, 5 - Ölmeden önce hayâtının.» «Her kim (akıbetten) korkarsa erken yola çıkar. Ve her kim erken yola çıkarsa menzil-i maksuda ulaşır» hadisleri bunlardandır. Bu babda selef-i sâlihînden de bir çok eserler vardır. «O fitneler zuhur ettiği vakit kişi mu'min olarak sabahlayacak, kâfir olarak akşamlayacaktır.» ifadesini te'vile lüzum yoktur. Çünkü fitneler çoğaldığı zaman kalpler bozulur; imân safiyeti kalmaz. Kalplere gaflet ve fisku fücur dolar. Bunlar da bir insanın şekaveti için kâfî sebeblerdir. Nitekim kominizm felâketine ma'ruz kalan yerlerde bir çok müslümanların —el-iyazu billahi— irtidâd ettiklerini gözümüzle gördük. Fahr-ı Kâinat (Sallallahu Aleyhi ve Sellem) Efendimiz: «dinini bir dünya metâı mukabilinde satacaktır.» buyurarak dünya mefsedetleri karşısında dîne sarılmanın lüzumuna işaret etmektedir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 220
			}
		}
	]
}