{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3217,
			"arabicnumber": "1325.02",
			"text": "(Bize Muhammed b. Râfi' rivâyet etti. ki): Bize Abdürrezzâk rivâyet etti. ki): Bize Ma'mer, Hemmâm b. Münebbih'ten rivâyet etti. Hemmâm: Bize Ebû Hüreyre'nin Resûlüllah (sallallahü aleyhi ve sellem)’den rivâyet ettikleri şunlardır diyerek bir takım hadîsler söylemiş, ezcümle şöyle deditir: defa bir adam nişanlı bir dişi deveyi sürerken Resûlüllah (sallallahü aleyhi ve sellem) kendisine: Yazık sana! Bin ona! buyurmuş. O zât: Bu bedenedir yâ Resûlallah! demiş. Resûlüllah (sallallahü aleyhi ve sellem); Yazık sana! Bİn ona; yazık sana! Bin ona! buyurmuşlar.» hadîsi Buhârî «Hacc», «Vasâyâ» ve «Edeb» bahislerinde; Ebû Dâvûd ile Nesâî «Hacc» bahsinde muhtelif râvilerden tahrîc etmişlerdir. süren zâtın kim olduğu malûm değildir. Bu zât: «Yâ Resûlallah! Bu bedenedir.» demekle, devenin kurban edilmek üzere Mekke'ye gönderilmekte olduğunu anlatmak istemiştir. Rivâyetlerin bâzılarından anlaşıldığına göre devenin boynunda kurbanlık alâmeti bulunuyormuş. Binâenaleyh Resûlüllah (sallallahü aleyhi ve sellem)'in onu görül dört ay kadına yaklaşmıyacağma yemîn etmek şer'an ilâ sayılmaz. Mutlaka dört aydan fazla bir müddet söylemek îcâb eder. Mâlik, dört ay üzerine bir gün ziyâde edilmesini şart koşmuştur. Fakat îlâ âyeti bu zevatın aleyhlerine delildir. hükmü: Müddet içinde kadına yaklaşıldığı taktirde keffâret îcâb etmektir. Basrî'ye göre keffâret lâzım değildir; îlâ sakıt olur. yapan kimse dört ay içinde karısına yaklaşmazsa, bir talâk boş olur. Ashâb-ı kirâm'dan İbn Mes'ûd, İbn Ömer, İbn Abbâs, Osman ve Alî (radıyallahü anhûm) hazerâtının kavilleri bu olduğu gibi cumhûr-u Tabiîn'in mezhepleri de budur. hakkında filan kitaplarında tafsilât vardır. bütün rivâyetlerinde bir ay'in yirmidokuz günden ibaret olduğu bildirilmektedir. Iyâz diyor ki: «Bütün bu rivâyetlerin mânâsı: Resûlüllah (sallallahü aleyhi ve sellem) yirmidokuz günü tamam ettikten sonra döndü, demektir. Buna delîl: Hadîsin bir rivâyetinde: gün geçtikten sonra); diğer rivâyette: sabahında) yani (yirmidokuzdan sonra gelen gecenin sabahında) buyurulmuş olmasıdır. O sabah ise otuzuncu günün sabahıdır. (Ay yirmi dokuzdur.) sözünün mânâsı: bazen yirmidokuz çeker, demektir. Nitekim bâzı rivâyetlerde bu şekilde tasrîh buyurulmuştur.» (sallallahü aleyhi ve sellem)’in yemîni zevcelerine güvendiği içindi. Müfessirler Sûre-i Tahrîm'in tefsirinde bu yeminin sebebini beyân etmişlerdir. Görmek isteyenler oraya bakabilirler. göre binmek ve sütünü içmek hayvana bir noksanlık getirirse noksanlığın kıymetini ödemek lâzım geldiğini kaydetmiştir. İmâm Mâlik'e göre dahi sütü içilmezse de içildiği takdirde ödemek îcâb etmez. tecviz edenler kurbanlık deve üzerinde yük taşınıp taşı-namıyacağı hususunda ihtilâf etmişlerdir. İmâm Mâlik bunun caiz olmadığını söylemiş cumhûr ise tecviz etmişlerdir. dişisinden de erkeğinden de hedy kurbanı olur. Hanefiîler'le İmâm Mâlik'in mezhepleri budur. Mezkûr kavl birçok ashâb-ı kirâm'dan nakledilmiştir. İbn Tin, hed-yin yalnız dişi deveden olacağını söylemiş ve bu kavli İmâm Şâfii'den nakletmiştir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 421
			}
		}
	]
}