{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 322,
			"arabicnumber": "122",
			"text": "Bana Muhammed b. Hatim b. Meymun ve İbrahim b. Dinar -lafız İbrahim'in olmak üzere- (2/33b) tahdis etti, bize Haccac -b. Muhammed'dir- İbn Cureyc'den tahdis etti. Bana Ya'la. b. Müs!im'in haber verdiğine göre o Said b. Cubeyr'i, İbn Abbas'tan şunu tahdis ederken dinledi: Müşriklerden birtakım kimseler çokça adam öldürmüş, çokça zina etmişlerdi. Sonra Muhammed (Sallallahu aleyhi ve Sellem)'e gelerek dediler ki: Gerçekten söylediklerin ve kendisine davet ettiklerin çok güzeldir. Bir de bize yaptığımız amellerimize kefaretin bulunduğunu bir söylesen, dediler. Bunun üzerine: \"Onlar ki Allah ile birlikte başka bir ilaha ibadet etmezler. Hak ile olması dışında Al/ah'ın öldürülmesini haram kıldığı nefsi de öldürmezler, zina da etmezler. Kim bunları işlerse o günah (ları) ile karşılaşır.\" (Furkan, 68) buyruğu ile; \"Ey nefisleri aleyhine ileri giden kullarım, Allah'ın rahmetinden ümit kesmeyin\" (Zümer, 53) s.yeti nazil oldu. Diğer tahric: Buhari, 4532; Ebu Davud, 4274'te -muhtasar olarak-; Nesai, 4015; Tuhfetu'I-Eşraf, 5652 NEVEVİ ŞERHİ: Müslim (rahimehullah)'ın, İbn Abbas (r.a.)'ın rivayet ettiği bu hadisi zikretmekten maksadı Kur'an-ı Azimuşşanın sünnetin de getirmiş olduğu \"İslam kendisinden önceki/eri yıkar\" hükmünü de ifade etmiş olduğunu göstermektir. Hadisteki: \" ... Bir de bize yaptıklarımızın bir kefaretinin bulunduğunu söylesen ... ayeti nazil oldu\" ibaresinde \"lev: se, sa\"nın cevabı hazfedilmiştir. (2/139) Yani bize bunu haber verecek olursan elbette Müslüman oluruz. Kur'an-ı Azimuşşan'da ve Arap dilinde bunun hazfedildiği haller çokça görülür: \"Zalimleri bir görsen ... \" (En'am, 93) buyruğunda ve benzerlerinde olduğu gibi. \"O günah (ları) ile karşılaşır\" (Furkan, 68) buyruğunun bir ceza ile karşılaşır anlamında olduğu söylendiği gibi, bunun (günah diye meali verilen esam) cehennemde bir vadi olduğu, bir kuyu olduğu da söylenmiştir, günahının cezasını görür diye de açıklanmıştır. DAVUDOĞLU AÇIKLAMA: «Bize yaptıklarımıza kaffaret olacak bir şey haber verirsen...» İfadesi bir şart cümlesi olup cevabı muhzuftur. Yani; bize haber verirsen bizde müslüman oluruz demektir. İbareden cevap cümlesinin hazfedilmesine arapçada ve Kur'an-ı Kerîm'de çok tesadüf edilir. «Esâm : Bazılarına göre azap dernektir. Bazıları cehennemde bir vadi olduğunu söylemiş diğerleri cehennemde bir kuyu olduğunu beyan etmiştir. Günahın cezasıdır» diyenlerde olmuştur. Hadisde zikri geçen ikinci âyet Kur'an-ı Kerîm'in en ümidbahş âyeti olduğu bildirilmektedir. Bu âyet müşriklerin Rasul-i Ekrem (Sallallahu Aleyhi ve Sellem)'den yaptıklarına keffaret olup olmadığını sordukları zaman nazil olduğuna göre müslüman olduktan sonra eski günahlarının affedileceğine işaret etmekledir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 229
			}
		}
	]
}