{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3245,
			"arabicnumber": "1333.06",
			"text": "Bize Hennâd b. Seriyy rivayet etti, (Dediki): Bize İbni Ebî Zaide rivayet etti. (Dediki): Bana İbni Ebî Süleyman Atâ'dan naklen haber verdi. Atâ' şöyle demiş: «Yezîd b. Muâviye zamanında Şamlılar Mekke'ye hücum ederek Beyt-i Şerif yandığı ve olan olduğu vakit İbni Zübeyr, taa hacc mevsiminde halk gelinceye kadar onu hâli üzere bıraktı. (Bununla) halkı Şamlılar üzerine teşcî' yahut harbe sevketmek istiyordu. Halk haccdan dağılınca İbni Zübeyr: — Ey cemaat! Kabe hakkında bana re'yinîzi söyleyin. Onu yıkıp da yeniden mi bina edeyim? Yoksa harâb olan yerlerini tamir mi eyliyeyim? İbni Abbâs: — Bana bu bâbda bir fikir zahir oldu. Harâbolan yerlerini tamir etmeni ve halkın müslüman oldukları vakit buldukları bir beyti, müslüman oldukları vakit buldukları taşları, Nebi (Sallallahu Aleyhi ve Sellem)'in de Nebi gönderildiği vakit bulduğu bu şeyleri hâli üzere bırakmanı muvafık görüyorum, dedi. Bunun üzerine İbni Zübeyr şunları söyledi: — Sizden birinizin evi yansa onu yenilemedikçe gönlü razı olmaz. Şu halde Rabbinizin Beytine nasıl razı olabiliyorsunuz? Ben Rabbime üç defa istiharede bulunacağım. Sonra yapacağım işe niyet edeceğim.» Üç gece geçtikten sonra Kabe'yi yıkmaya karar verdi. Halk Kabe'nin üzerine çıkan ilk insanın başına gökten bir belâ iner korkusuyla onu bu işten vazgeçirmeye çalıştılar. Nihayet Beyt-i Şerifin üzerine bir adam çıkarak ondan bir taş attı. Halk onun başına bir şey gelmediğini görünce hep birden İbni Zübeyr'e tabî oldular ve Beyt-i Şerifi yıkarak yere kadar indirdiler. İbni Zübeyr Kâ'be'nin binası yükselinceye kadar (kıble vazifesi görmek üzere) bir takım direkler diktirdi. Ve üzerlerine perdeler çektirdi. İbni Zübeyr demiş ki: «Ben Âişe'yi şöyle derken işittim. Nebi (Sallallahu Aleyhi ve Sellem) : «Halk küfürden yeni kurtulmuş olmasaydı ben mutlaka Kâ'be'ye Hicr'den beş arşın yer katar ve ona İnsanların gireceği bir kapı ile çıkacakları bir kapı açardım. Ama bende Kâ'be'nîn binasına yetecek nafaka yoktur.» buyurdu. İşte bugün ben sarfedecek nafaka buluyorum. İnsanlardan da korkacak değilim.» Ata' (sözüne devamla) şöyle demiş: «İbni Zübeyr Kabe'ye Hicr'den beş arşın yer kattı. Hattâ bir temel açarak halka gösterdi. Halk ona baktılar da binayı onun üzerine kurdu. Kâ'be'nin uzunluğu onsekiz arşındı. îbni Zübeyr ilâveyi yapınca bunu kısa görerek uzunluğuna on arşın kattı. Beyt-i Şerife iki kapı yaptı. Bunların birinden girilir, diğerinden çıkılırdı. İbni Zübeyr katledilince Haccâc, Mervân'a mektup yazarak bunu ve îbni Zübeyr'in Kabe'yi Mekkelilerden âdil bir takım kimselerin gördükleri bir temel üzerine bina ettiğini haber verdi. Abdül Melik de ona : — Biz İbni Zübeyr'in berbâd ettiği bir şeyde yokuz. Uzunluğuna yaptığı ilâveyi olduğu gibi bırak, fakat Hicr'den yaptığı ilâveyi eskiden bina edildiği şekle çevir. Açtığı kapıyı da kapa! diye cevap yazdı. Bunun üzerine Haccâc binayı yıkarak eski şekline iade etti",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 449
			}
		}
	]
}