{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3246,
			"arabicnumber": "1333.07",
			"text": "Bana Muhammedu'bnu Hatim rivayet etti. (Dediki): Bize Muhammed b. Bekr rivayet etti. (Dediki): Bize İbni Cüreyc haber verdi. (Dediki): Ben Abdullah b. Ubeyd b. Unıeyr iie Velid b. Atâ'yı Haris b. Abdillâh b. Ebî Rebîa'dan naklen ribâyet ederlerken dinledim. Abdullah b. Ubeyd dediki: Haris b. Abdillâh, Abdülmelik b. Mervân'ın hilâfeti zamanında onun yanına geldi. Abdülmelik İbni Zübeyr'i kasdederek ; — Ben Ebû Hubeybin Âişe'den işittiğini söylediği şeyleri ondan işittiğini zannetmiyorum, dedi. Haris: — Bilâkis (Bunları ondan ben işittim mukaabelesinde bulundu.) Abdül-Melik : — Aişe'yi ne derken işittin? diye sordu. Haris : — Dedikî Resûlullah (Sallallahu Aleyhi ve Sellem): Senin kavmin Beyt-i şerifin binasını noksanlaştırdılar. Eğer şirkten yeni kurtulmuş olmasalardı onların bıraktığını yerine iade ederdim. Şeyet benden sonra kavmin Ka'be'yi yeniden bina etmeyi düşünürlerse gel onların bıraktığı yeri sana göstereyim, buyurdu. Müteakiben Resulullah (Sallallahu Aleyhi ve Sellem): Âişe'ye yedi arşına yakın bir yer göstermiş. Bu hadîs Abdullah b. Ubeyd'indir. Velîd b. Ata' ona şunları da ziyâde etti: «Nebi (Sallallahu Aleyhi ve Sellem) : — Kâ'be'ye doğu ve batı tarafından yerden yapma iki kapı koyardım. Kavminin Kâ'be kapısını niçin yükseğe kaldırdığını bilirmisin? buyurdu. Ben : — Hayır! dedim. — Oraya dilediklerinden başka kimse girmesin diye şerefini muhafaza içîn (yükselttiler). Bir adam Kâ'be'ye girmek istedi mi onun kapıya çıkmasına müsaade ederler. Tam girmek üzere bulunduğu sırada adamı iterler de düşerdi; buyurdu. Abdülmelîk Hâris'e: «Âişe'nin bunu söylediğini sen işittin ha?» dedi. Haris : — Evet! cevâbını verdi. Bunun üzerine Abdülmelik sopasıyla bir müddet eşeledikten sonra : — Keşke Ebû'z-Zübeyr'i üzerine aldığı şeyle başbaşa bıraksaydım dedi",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 450
			}
		}
	]
}