{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 326,
			"arabicnumber": "123.04",
			"text": "Bize Ebu Bekr b. Ebi Şeybe tahdis etti. Bize Abdullah b. Numeyr, Hişam b. Urve'den tahdis etti. O babasından rivayet ettiğine göre Hakim b. Hizam cahiliye döneminde yüz köleyi hürriyetine kavuşturdu, yüz deve yükünü tasadduk etti sonra da İslam (dönemin)de de yüz köleyi hürriyetine kavuşturdu ve yüz deve yükünü de tasadduk etti. Sonra Nebi (Sallallahu aleyhi ve Sellem)'e geldi ve diğerlerinin hadisine yakın olarak hadisi zikretti. Diğer tahric: Buhari, 1369, 2107, 2401, 5646; Tuhfetu'I-Eşraf, 3432 DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın NEVEVİ ŞERHİ: (319-322 numaralı hadisler:) Bu babta Hakim b. Hizam (r.a.)'ın rivayet ettiği hadiste Resulullah (Sallallahu aleyhi ve Sellem)'e: \"Cahiliye döneminde ibadet kastıyla yaptığım birtakım hususlar hakkında ne dersin ... Sen daha önce yaptığın hayırla Müslüman oldun.\" Hadiste geçen \"tehannüs\" yine hadiste tefsir edildiği gibi, teabbud etmek, ibadet etmek demektir. (321) Diğer rivayette ise bunu (Hişam) teberrur yani itaat ve iyilik olan işler diye tefsir etmiştir. Dilbilginleri der ki: Tehannüs aslında bir kimsenin kendisiyle günahtan çıkıp, kurtulduğu bir iş yapması demektir. Çünkü hıns günah demektir. Teessum, teharruc ve teheccüd de aynı anlamdadır. Yani bir kimsenin günahtan, harecden ve hücliddan (günahtan) kurtulabildiği bir iş yapması anlamındadır. Hasulullah (Sallallahu aleyhi ve Sellem}'in: \"Sen geçmişte yaptığın hayırlarla Müslüman oldun\" buyruğunun anlamı ile ilgili farklı açıklamalar yapılmıştır. İmam Ebu Abdullah el-Mazeri der ki: Bunun zahiri, konu ile ilgili asıl kaidelerin gerektirdiği hükme muhalifiir, çünkü kMirin yüce Allah'a yakınlaştırıcı bir amelde bulunması sahih değildir. Yaptığı itaat dolayısıyla ona sevap verilmez. Bununla birlikte -benzeri halde imanda olduğu gibi- Allah'a yakınlaşması sözkonusu olmaksızın itaat edici olması sahihtir. Çünkü o emre uygun olması bakımından bu işinde itaat etmiş olur. Bize göre de itaat emre uygunluktur fakat bu amelleriyle Allah'a yakınlaşmış olmaz. Çünkü AIlah'a yakınlaşacak kimsede aranan şartIardan birisi de kendisine yakınlaşacağı zatı bilip, tanıyan birisi olmasıdır. Fakat o bu işleri yaptığı sırada henüz yüce Allah hakkında sahip olması gereken bilgiyi elde etmiş değildi. Durum böyle olduğuna göre hadisin tevil edilmesi gereken bir hadis olduğu anlaşılmaktadır. Bu tevilin de birkaç şekilde olma ihtimali vardır: 1- Sen güzel birtakım karakterler kazandın ve sen İslam'a girdikten sonra da bu karakterlerden yararlanacaksın. Alıştığın bu adetIerin senin için (Müslüman olduktan sonra) hayır işlemene bir hazırlık ve bir yardımcı olacaktır anlamında olması. 2- Sen bu yolla güzel bir ün kazandın (2/140). Müslüman olduktan sonra da bu güzel namın kalmaya devam edecektir. 3- Daha önce işlemiş olduğu güzel fiilleri sebebiyle İslam'da yapmış olduğu hasenatının arttırılması ve ecrinin çoğalması da uzak bir ihtimal değildir. İlim adamları eğer hayırları işleyen birisi ise, kMir hakkında bundan dolayı cezasının hafifletileceğini söylediklerine göre bu amellerinin ecrinin arttırılması da uzak bir ihtimal değildir. el-Maziri (rahimehullah}'ın sözleri burada bitiyor. Kadı Iyaz (rahimehullah) dedi ki: Bunun, senin daha önce yapmış olduğun hayırların bereketiyle yüce Allah sana İslam'a hidayet vermiştir anlamında olduğu da söylenmiştir. işinin baş taraflarında kendisinden bir hayır zuhur eden bir kimsenin bu hali sonrasının da mutIu olacağına, akıbetinin de güzelliğine bir delildir. Bu da Kadı iyaz' ın ifadeleridir. ibn Battal ve daha başka muhakkiklerin kanaatine göre hadis zahiri üzeredir. KMir Müslüman olup da İslam üzere ölürse küfrü halinde yapmış olduğu hayırları karşılığında da ona sevap verilir. Bu kanaatierine Ebu Said el-Hudri (r.a.)' ın rivayet ettiği şu hadisi delil gösterirler: Hasulullah (sallallahu aleyhi ve sellem} şöyle buyurdu: \"Katir Müslüman olup, İslam'a güzel bir şekilde bağlanırsa yüce Allah ona ondan önceki her iyiliğini yazar ve ondan önceki her kötülüğünü de siler. Bu iyilikten sonraki ameli de ona on mislinden itibaren yedi yüz katına varıncaya kadar sevap yazılır. Günah ise ancak misli ile yazılır. Aziz ve celil olan Allah'ın onu affetmesi hali de müstesnadır.\" Bu hadisi Darakutni, İmam Malik' in garip hadisleri arasında zikretmiştir. Ayrıca bunu kendisinden dokuz ayrı yoldan rivayet etmiştir. Bu rivayet yollarının hepsinde de katirin İslam'a güzel bir şekilde bağlanması halinde müşrik iken işlemiş olduğu her bir hasenenin Müslüman oluşu halinde kendisine yazılacağını ifade etmektedirler. (2/141) İbn Battal (rahimehullah) hadisi zikrettikten sonra şunları söyler: Allah-u Teala kullarına dilediği şekilde lütuf etmek hakkına sahiptir. Hiç kimsenin ona itiraz etme yetkisi yoktur. Bu da Resulullah (sallall€ı.hu aleyhi ve sellem} 'in Hakim b. Hizam (radıyall€ı.hu anh)'a: \"Sen geçmişte işlemiş olduğun hayırlar ile birlikte Müslüman oldun\" demesine benzer. Allah en iyi bilendir. Fukahanın; katirin hiçbir ibadeti sahih değildir, eğer Müslüman olsa onun o ibadetlerinin değeri yoktur, sözlerinden maksatları ise, dünya ahkamı bakımından bunların onun lehine sayılmayacağından ibarettir. Yoksa bu sözlerinde ahiret sevabıyla alakah bir husus yoktur. Bir kimse bu hususta açık ifade kullanmaya kalkışarak, eğer Müslüman olursa ahirette onun bu amellerine sevap verilmez, diyecek olursa bu sahih sünnetle onun dediği reddedilir. Diğer taraftan dünya ahkamı bakımından da kafirlerin birtakım fiilleri değerlendirilebilir. Fakihler şöyle der: Kafirin zihar yahut başka bir kefareti yerine getirmesi icab edip de kafir iken bu kefarette bulunmuşsa, bu onun için yeterlidir. Müslüman olması halinde bunu tekrar yerine getirmesi vacip değildir. Fakat Şafii mezhebi alimleri -Allah'ın rahmeti onlara olsun- kafir iken cünüp olup, guslederse sonra da Müslüman olursa o guslünü yeniden yapması icap eder mi etmez mi meselesinde ihtilaf etmişlerdir. Bazı mezhep alimlerimiz aşırıya kaçarak katir her kimsenin gusül, abdest ve teyemmüm gibi her türlü taharet işlemi caizdir. Müslüman olması halinde de onlarla namaz kılabilir. Allah en iyi bilendir. Babtaki lafızlarla ilgili açıklamalara gelince \"yüz köleyi hürriyetine kavuşturdu ve yüz deve yükünü tasadduk etti\" sözlerinin manası bunları sadaka verdiğidir. (320) Hadisin senedinde Salih, İbn Şihab'dan, o Urve'den rivayeti sözkonusu edilmektedir. Bunların üçü de birbirinden rivayet nakleden tabiidir. Bunun benzerlerini daha önceden de zikretmiştik. Senette sahabi Hakım b. Hizam (r.a.) vardır. Kabe'nin içinde dünyaya gelmiş olması onun menkıbelerindendir. Bazı ilim adamları: Bu hususta bir başkasının onun gibiolduğu bilinmemektedir. Alimler der ki: Onunla ilgili haberlerin ilginç olanlarından birisi de şudur: O cahiliye döneminde altmış yıl, İslam'da da altmış yıl yaşadı. Mekke'nin fethedildiği yıl Müslüman oldu, Medine'de 54 yılında vefat etti. Böylelikle İslam'dan maksat İslam'ın ortaya çıkıp, yayılması zamanından itibaren demek olur (2/132). Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 233
			}
		}
	]
}