{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 326,
			"arabicnumber": "123.04",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe rivâyet etti. ki): Bize Abdullah b. Nümeyr, Hişâm b. Urve'den, o da Babasından naklen rivâyet etti, ki Hakim b. Hizam cahiliyet devrinde yüz köle âzâd; yüz deve yükü de mal tesadduk etmiş. Bilâhare İslâmda dahi yüz köle âzâd ve yüz deve yükü mâl tesadduk eylemiş. Sonra Peygamber (sallallahü aleyhi ve sellem)'e gelmiş... babası, Ötekilerin hadisi gibi rivâyet etmiş. muttefekun aleyhtir. Buhârî onu zekât, Buyu' Rehin ve Edeb bahislerinde tahric etmiştir. haber ver demektir. kelimesi bazı rivâyetlerde şeklinde zabtedebilmiştir. Ancak rivâyet sahîh olmakla beraber ma'na itibarile bu kelime yanlıştır. Buhârî'nin üstadlarından biri burada vehmetmiştir deniliyor. İbn fin: «Bu kelimenin etehan-netü şeklinde okunduğu takdirde bir vechi olup olmadığını bilmiyorum.» demiştir. îsmâili ise; Buhârînin onu şeklinde rivâyet ettiğini söyledikten sonra şöyle deditir:, rivâyeti tashifdir; doğrusut dür. Bu kelime (hıns) dan alınmıştır. Hıns günah demektir. Hakim: «Bunlarla ben günaha sokacak şeylerden korunuyordum» demek istemiş olacaktır!» kelimesine ma'na vermeye çalışmış; ve bunun meyhane ma'nasına gelen (hânût) dan alınmış olması ihtimalinden bahsetmişlerdir. Bu takdirde ma'nanın ne olacağı zikredilmemişse de meyhane yerine bu işlerle meşgul oluyordum. Benim meyhanem bunlardı.» ma'na-sı kadedilmiş olması muhtemeldir. Nevevî'nin beyanına göre «tehannüs: teabbüddür. Nitekim hadisde de Müslim onu bu ma'na ile tefsir etmiştir. Diğer rivâyette onu: Teberrür diye izah eder. Teberrür, birr, yani tâat yapmaktır. Lügat uleması; Tehannüsün aslı günahdan çıkacak bir iş yapmaktır; demişlerdir... geçmişte yaptığın hayırlarla müslüman oldun,» ifadesinden mu-rad: o hayırların hesaba katılması veya kabul olunmasıdır. Zira kâfir müslüman olur da ölürse hasenatının kabul edileceği yahud hesaba katılacağı; kâfir olarak ölürse amellerinin bâtıl olacağı rivâyet edilmiştir. hadisin bu cümlesi üzerinde ulemânın ihtilâf ettiğini söyledikten sonra şöyle eliyor: «Bu cümlenin zahiri usûlün iktizâ ettiği ma'-naya muhaliftir. Çünkü kâfirin ibâdeti sahih değildir ki yaptığı tâattan dolayı sevaba nail olsun. Ama ibâdet değil de itaat göstermiş olması sahihtir. Yukarıdaki izahattan anlaşılıyor ki hadîs te'vîl edilmiştir. Te'vîlinin de bir kaç veçhe ihtimâli vardır. Şöyle ki:",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 233
			}
		}
	]
}