{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 329,
			"arabicnumber": "125",
			"text": "Bana Muhammedi b. Minhâl ed-Darîr ile Ümeyyetü'bnü Bistâm el-Ayşî rivayet ettilea:. Lâfız Ümeyye'nindir. Dediler ki: Bize Yezil b. Zürey' rivayet etti. (Dedi ki): Bize Ravh —ki Îbnü'l-Kaasım'dır—, Alâ'dan, o da babasından, o da Ebu Hureyre'den işitmiş olmak üzere rivayet etti. Ebu Hureyre (r.a.) dedi ki: Resulullah (Sallallahu aleyhi ve Sellem)'e: \"Göklerde ne var, yerde ne varsa Allah'ındır. İçinizdekini açıklasanız da, gizleseniz de Allah onunla sizi hesaba çeker. Kimi dilerse bağışlar, kimi dilerse azaplandırır. Allah her şeye gücü yetendir. \" (Bakara, 284) ayeti nazil olunca bu Resulullah (Sallallahu aleyhi ve Sellem)'in ashabına ağır geldi. Bunun üzerine Resulullah (Sallallahu aleyhi ve Sellem)'e gittiler. Sonra huzurunda dizleri üzere çöktüler ve: Ey Allah'ın Resulü, namaz, oruç, cihad, sadaka gibi gücümüz yeten amellerle mükellef kılındık. Fakat üzerine şu ayet nazil oldu, ona gücümüz yetmiyor, dediler. - Resulullah (Sallallahu aleyhi ve Sellem) şöyle buyurdu: \"Sizden önceki iki kitap ehlinin söylediği gibi dinledik ve isyan ettik mi diyorsunuz? Hayır, siz: Dinledik, itaat ettik, bize mağfiret buyur Rabbimiz, dönüş yalnız sanadır, deyiniz\" buyurdu. Onlar da: Dinledik, itaat ettik, bize mağfiret buyur. Rabbimiz, dönüş yalnız sanadır, dediler. Onlar bunu okuyunca dilleri de ona yatıştı, bunun akabinde Allah Teala: \"O Resul kendisine Rabbinden indirilene iman etti, müminler de. Onların her biri Allah'a, onun meleklerine, kitaplarına, Resullerine inandı. Resullerinden hiçbirini diğerinden ayırmayız ve: Dinledik, itaat ettik. Rabbimiz senden mağfiret dileriz ve dönüş ancak sanadır dediler.\" (Bakara, 285) Onlar bu işi yapınca Aziz ve Celil Allah da onu nesh etti, sonra Aziz ve Celil Allah: \"Allah hiçbir kimseye gücünün yeteceğinden başkasını yüklemez. (Herkesin) kazandığı (iyilik) kendisine yaptığı (kötülük) de onun aleyhinedir. Rabbimiz unuttuk yahut yanıldıysak bizi sorguya çekme.\" buyruklarını indirdi. (Onlar böyle dua edince, O da): Peki, buyurdu. \"Rabbimiz bizden öncekilere yüklediğin gibi üzerimize ağır yükler yükleme.\" (diye yalvardılar), Allah: Peki, buyurdu. \"Rabbimiz güç yetiremeyeceğimiz şeyi bize yükleme.\" (diye yalvardılar), Allah: Peki, buyurdu. \"Bizi affet ve bize mağfiret buyur. Sen bizim mevlamızsın. Kafirler topluluğuna karşı da bize yardım et. \" (Bakara, 286) (diye yalvardılar), Rabbimiz: Peki buyurdu. Yalnız Müslim rivayet etmiştir; Tuhfetu'I-Eşraf, 14014 DAVUDOĞLU ŞERHİ 126.sayfada. NEVEVİ ŞERHİ 131. sayfa’da 337 nolu hadiste",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 236
			}
		}
	]
}