{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 330,
			"arabicnumber": "126",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Ebû Küreyb ve İshâk b. İbrahim rivâyet ettiler. Lâfız Ebû Bekir'indir. İshâk (Bize haber verdi) tâbirini kullandı. Ötekiler: Bize Vekî, Süfyan'dan, o da Hâlid'in âzadlısı Âdem b. Süleyman'dan, naklen rivâyet etti; dediler. Âdem Şöyle dedi: Said b. Cübeyr'i, İbn Abbâs'dan naklen rivâyet ederken dinledim, ki: \"Siz gönüllerinizdekini açsanızda gizlesenizde Allah onunla sîzi hesaba çeker...\" âyeti nâzil olunca ashabın kalplerine başka hiç bir şeyden girmeyen bir endişe girdi. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem): dinledik, itaat ettik ve teslim ettik deyin» buyurdular. Müteakiben Allah imânı onların kalplerine yerleştirdi. Ve şu âyet-i kerîmeyi inzal buyurdu: hiç bir kimseye takat getiremeyeceği bir şey teklif etmez. Herkesin kazandığı kendine irtikâbettiği de (yine) kendi aleyhinedir. Ey rabbimîz! Unutur veya hata edersek bizi muâhaza buyurma!\" Peygamber (sallallahü aleyhi ve sellem) bu duaları okudukça (Allahü teâlâ hazretleri) Pekiyi (yaptım) buyurmuştur. Rabbîmiz! Hem bize, bizden öncekilere yüklediğin gibi ağır yük yükleme.» teâlâ hazretleri pekiyi buyurmuş). affet! Bize merhamet eyle! (Çünkü) Bizim mevlamız ancak sensin.) teâlâ hazretleri pekiyi buyurmuş) Sûrei Bakara, âyet: 284, müttefakun aleytir, Buhârî onu tef siru'l-Kur'ân bahsinde tahric etmiştir. Kirama âyet-i kerîmenin şiddetli gelmesi gönülden geçen şey lerden, korunmakla memur olduklarını zannettikleri içindir. Böyle bi teklif insan takatinin üstündedir. Çünkü gönülden geçen şeyleri defetme! kimsenin elinde değildir. âyetten murad bu ise bu hadis-i şerif müslümanlara takat geti remiyecekleri şeylerin emredildiğine delâlet eder. Buna hususî tabiri il teklif-i mâla yutak derler ki caiz olup olmadığı ulemâ arasında ihtilâflıdır. beyanına göre buna takat getiremiyeceklerini Peygambe (sallallahü aleyhi ve sellem)’e arz eden ashab Ebû Bekir, Ömer Abdurahman b. Avf, Muâz b. Cebeî ve Ensarda birkaç kişi imiş: «Ya Resûlüllah! Bize şimdiye kadar ondan daha şu detli bir âyet inmedi, demişler» Resûlüllah (sallallahü aleyhi ve sellem) kendilerine: yapalım âyet böyle indirildi sizde dinledik ve itaat ettik deyiverir buyurmuşlar. bir sene geçmiş. Ondan sonra Teâlâ hazretleri: \"Allah bir kimseye gücünün yetmeyeceği bir şey teklif etmez.\" âyetini indirerc ashabı rahata kavuşturmuş ve bu âyetle üst tarafındaki şiddet âyeti: nesh etmiş. Resûlüllah (sallallahü aleyhi ve sellem) de: «Şüphesizi-Allah ümmetimin gönlünden geçirdikleri şeyleri fiiliyat sahasına çıka madikça yahut söylemedikçe af buyurmuştur.» demiştir. şer'i bir hükümün kendinden evvel gelen şer'i bir hükmü kaldırmasıdır. Âyet-i kerimenin, üst tarafındaki şiddet âyetini neshedip etmediği ihtilaflıdır. İbn Abbâs (radıyallahü anhüma)'nın bu âyet neshedilmiştir.» dediği rivâyet olunur. Bunun vechi: âyetin haber c maşıdır. Haberlerde nâsih mensuh aranmaz filvaki buna kail olanlar ve şada kendilerine cevap verilmiş ve: «Âyet-i kerime her ne kadar habe dair isede hüküm de tazammun etmektedir. Hüküm ihtiva eden haber ise; sair ahkâm gibi neshi kabul eder. Nesh kabul etmeyen haberlerî hüküm ihtiva etmeyen maziye ait haberlerdir.» denilmiştir. Bazıları: «Buradaki neshden murad tahsis olabilir. Çünkü eskiden ulema çok defa tahsise nesh derlerdi.» demişlerdir. Yine İbn Abbâs (radıyallahü anh)’dan rivâyet edildiğine göre: Bu âyet neshedilmemiştir. Lâkin Allahü teâlâ îiyamet gününde kullarını haşr ettiği zaman «Ben size meleklerimin vakıf olamadığı gönül sınırlarınızı haber vereceğim» diyecek. Mü'minlerin sırlarını söyledikten sonra onları affedecek şüphecilere ise; yaptıkları tek- hareketini haber verecektir. İbn Abbâs: İşte «Allah dilediğini af, dilediğini de azap eder» âyet-i kerîmesinin manası budur.» demiştir. diyor ki: «Buna nesh demek bir meseledir. Çünkü nesh iki âyetin arası bulunamadığı zaman olur. Halbuki Teâlâ hazretlerinin: kalplerinizden geçeni açığa vurursanızda gizlersenizde ilâh...» âyet-i kerimesi âmm'dır. Bunun gönülden geçen şeylerin önüne geçmesi mümkün olmayanlarına değil mümkün olanlarına şamil olması ihtimali vardır. Binaenaleyh Ferah âyeti şiddet âyetini tahsis etmiş olur. Ancak sahabe umum manâsını hal karinesi ile anladılarsa o başka, o zaman nesh olur. Çünkü nesh sabit ve müstekâr olan bir hükmü kaldırmaktır.» Fakat Übbî Maziri'nin bu mutâleasına iştirak etmemiş ve: «Bu takdirde nesih olur. Çünkü nesih ile tahsisin her biri sözün delâlet ettiği ma'nanın hilafını gösterir. Ayrıldıkları yer: tahisin sübutu şüpheli olan bir hükmü neshin ise sübutu muhakkak olan hükmü kaldırmasıdır. Ashab bunu karîne ile anladılarsa —ki karine ilim ifade eder— sübutu muhakkak olanın hükmünü kaldırmaya râcî' olur; bu nesihdir.» demiştir. îyâz şöyle diyor: «Bu meselede neshi uzak görmeğe imkân yoktur. Çünkü hâdiseyi anlatan râvî bu hadisede nesh olduğunu lâf-zan ve manen rivâyet etmektedir. Peygamber (sallallahü aleyhi ve sellem) şiddet âyeti- inince; ashabına itaat etmelerim emir buyurmuştur. Bu emir Allahü teâlâ gönülden geçen şeylerden dolayı muahaza buyuracağım bildirdiği içindir. Sahabe taat ve teslimiyet arzedince Allahü teâlâ İmâm kalplerine yerleştirmiş, dilleri de arz-ı teslimiyet ederek dinledik ve itaat ettik demeye yatışmıştır. Nitekim Nass-ı hadis kendilerinden güçlüğün kaldırıldığım ve bu teklifin nesh edildiği bildirilmektedir, Nesh ancak haber vermekle yahut tarih göstermekle bilinir. Bu âyette bunların ikiside vardır. Mâzîrî'nin dedikleri nesih vaki olduğuna delil bulunmayan yerde doğrudur. Delil bulunursa; biz o delilin üzerinde dururuz. Lâkin usul ulemâsı şahabının: «Sununla neshedildi» demesinin neshi iptal eder bir. hüccet olup olamayacağı hususunda ihtilâf etmişlerdir. Çünkü sâhâbi'-nih sözü kendi içtihad ve te'vili de olabilir. Bu nesh değildir. Ulema bu âyet hakkında da ihtilâf etmişlerdir. Ashâb-ı kirâmın ve onlardan sonra gelen müfessirlerin ekserisine göre âyette nesh vardır. Müteehhirin ulemadan biri neshi inkâr etmiş ve «bu âyet haberdir, haberlere nesh dahil olamaz» demiştir. Ama mesele bu muteehhir alimin dediği gibi değildir. Çünkü âyet haber de olsa, bir teklifi ve kalplerde gizlenen sırdan dolayı muahaza olunacağını; Peygamberimiz (sallallahü aleyhi ve sellem)'in emrettiği şekilde dinledik ve itaat ettik diyerek teabbüdte bulunmaları lüzumunu haber vermektedir. Bunferın bazısı kavil yani lisanın ameli, bazısı da kalbin amelidir. Bilahere kendilerinden güçlük ve muâhaze kaldırılmak suretile bu hüküm neshedilmiştir. müfessirlerden rivâyet olunduğuna göre; buradaki neshin ma'nâ-sı, ashabın kalblerindeki endişe ve korkuyu gidermektir. Bu endişe ve korku sonra nâzil olan âyetle giderilmiş; ve gönülleri rahat olmuştur. Bu kavle zâhib olanlarca ashâb-ı kirâma güçleri yetmeyecek teklifler vâkî' olmamış; yalnız korunması kendilerine meşakkatli görünen gönül tasavvurlarından korunmaları ve derûnî bir ihlâsa sahip olmaları emrolunmuştur. Ashab da bunu görünce takat getiremeyecekleri şeylerin kendilerine em-redilmesinden korkmuştur. Binnetice korkuları giderilmiş; ve ancak tâ-katları nisbetinde mükellef oldukları beyan buyurulmuştur. Bu takdirde âyette, kulun gücü yetmeyeceği şeylerin teklif olunabileceğine delil yoktur. Çünkü âyette teklife dair bir söz yoktur. mezkûr teklifin caiz olduğuna Teâlâ hazretlerinin: «Bize takat getiremeyeceğimiz şeyleri yükleme...» âyetile istidlal etmiş; ve: «Eğer böyle bir teklif caiz olmasa ashâb bundan Allah'a iltica etmezlerdi.» demişlersede kendilerine: «Ashabın: takat getirenleyiz demelerinin ma'-nası, güç hâlle yapabilirsiniz, demektir» şeklinde cevap verilmiştir. takımları da mü'minlerle kâfirlerin gerek yakınen gerekse şek ve şüphe ile inandıkları şeyleri gizleme hususunda âyetin muhkem olduğunu; mü'minler affolunacağını, kâfirler ise azâb göreceğini söylerler.» Kâdî Iyaz’ın sözü burada bitiyor. «Âyet mü'minlerle kâfirler hakkında muhkemdir...» kavli hakkında: «Muhakkikin ulemânın mezhebi de budur.» diyor. Hazret-i Abdullah b. Ömer (radıyallahü anh) dan rivâyet ettiği bir hadisde ise İbn Ömer (radıyallahü anh) «Siz gönüllerinizdekini açsanız da gizlesenizde... âyeti muhakkak nesh edilmiştir.» demiştir. nesih meselesi ihtilaflıdır. Görülüyor ki, Sûre-i Bakara'nın son âyetleri-bu münasebetle nâzil olmuştur. Ayni diyor ki: «Teâlâ Hazretleri: Peygamber, kendisine indirilenlere iman attı; mü'minler de her bîri Allah'a imân etti...» buyurdu. Acaba neden Peygamber (sallallahü aleyhi ve sellem) hakkında «Allah'a imân etti» buyurulmanuştır? dersen ben derim ki: Peygamber (sallallahü aleyhi ve sellem) hakkında küfür imkânsızdır. Fakat mü'minler hakkında imkânsız değildir. Bu sebeble onların Allah'a imân ettiklerini tasriha lüzum vardır. Resûlüllah (sallallahü aleyhi ve sellem)’in Allâha iman ettiğini beyâna hacet yoktur. «diniedik» ta'birinden murâd: icabet ettik demektir. burada kesb fi'li, biri sülâsi-i mücerrep diğeri sülâsî-i mezid olmak üzere iki defa zikredilmiş; ve kelimelerdeki bina ziyadesi ma'nâların ziyadeliğine delâlet ettiği cihetle (kesebe) fi'li ha-yır kazanmak ma'nasında (iktesebe) ise kötülükte kullanılmıştır. Çünkü iktisabda didinerek çalışma ve kasid manası vardır. nisyandan murâd: yanılmaktır. Bazıları, terk ve ihmâl ma'nası-na geldiğini söylemişlerdir. muradın kasıdlı iş olduğunu söyleyenler bulunduğu gibi, bilmemek ve yanılmak ma'nasına geldiğini' ileri sürenler de vardır. İbn Zeyd'e göre bu cümlenin ma'nası: «Şayed bize farz kıldığın şeylerden birini unutur; yahud haram kıldığın şeylerden birinde hata edersek, bizi cezalandırma ya Rabbî!» demektir. beyanına göre Beni İsmail, Allah’ın kendilerine emrettiği bir şey hususunda hata ve nisyanda bulunurlarsa derhâl cezalan verilir; günahına göre yiyecekleri içecekleri kesilirmiş. İşte bu âyetle Teâlâ Hazretleri mü'rninlerin bu gibi hâllerden dolayı azâb olunmama-maları niyazında bulunmalarını Peygamber (sallallahü aleyhi ve sellem)’c emir buyurmuştur. şöyle bir suâl vârid olabilir. Hatâ ve nisyanin hükmü bu ümmete bağışlanmıştır. O halde bunlardan dolayı muâhaze olunmamak niyazında bulunmanın ne faydası vardır? Duadan murad: muaheze olunmamanın bir defaya mahsus bırakılmayıp devam etmesini, hiç bir nisyan ve hatadan dolayı azâb görmemelerini istemektir. Nitekim Fatiha Süresindeki: bizi doğru yola ilet...» âyet-i kerimesinden murad da doğru yolda dâim kılmaktır Rabbimiz! Hem bize, bizden öncekilere yüklediğin gibi ağır yük yükleme!...» Buradaki (ısr)ı, Sultanu'l-müfessirin İbn Abbâs (radıyallahü anhüma) altından kalkamayacağımız «ahdu peymân» diye tefsir etmiştir. Zemahşeri: taşıyanın belini çökerten ağır yüktür» demiştir. Bazılarına göre (ısr) tevbesi ve keffâreti olmayan günahtır. kavimlerden murâd Yahûdilerdir. Rivâyete göre Allahü teâlâ Yahûdilere günde elli vakit namaz kılmalarını ve mallarının dörtte birini zekât olarak vermelerini emretmiş. Kim bir günah işlerse sabahleyin günahının kapısına yazıldığını görürmüş. îşte bazı âyetlerde zikri geçen (isr-u ağlâl) dan murad bunlardır. gücümüzün yetmeyeceği şeyi de yükleme!...» Allâme Aynî bu âyetin ma'nası hususunda yedi kavil olduğunu söylüyor. Bu yedi kavil şunlardır:",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 237
			}
		}
	]
}