{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3308,
			"arabicnumber": "1357",
			"text": "Bize Abdullah b. Meslemete'l Ka'nebî ile Yahya b. Yahya ve Kuteybetü'bnü Saîd rivâyet ettiler. Ka'nebî: (Mâlik b. Enes'e okudum); Kuteybe ise: (Bize Mâlik rivâyet etti) dediler. Yahya —ki bu lâfız onundur— Mâlik'e: Sana İbn Şihâb, Enes b. Mâlik'ten naklen: «Peygamber (sallallahü aleyhi ve sellem) fetih yılında Mekke'ye başında bir miğfer olduğu halde girdi. Onu çıkardığı vakit yanına bir adam gelerek: İbn Hatal Kabe'nin örtüsüne yapışmıştır, dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): Onu öldürün! buyurdular, dediğini rivâyet etti mi? diye sordum. Mâlik: Evet! cevâbını verdi.» hadîsi Buhârî «Hacc», «Libâs», «Cihâd»' ve «Meğâzî» bahislerinde; Ebû Dâvûd «Cihâd»da; Tirmizî «Cihâd» ve «Şetraâil»de; Nesâî «Hacc» ile «Siyer»de; İbn Mâce «Cihâd» bahsinde muhtelif râvîlerden tahrîc etmişlerdir. şerîf İmâm Mâlik'in yalnız basına rivâyet ettiği hadîslerden sayılır. Zîra başkalarının rivâyetlerinde «başında miğfer» yerine «siyah bir sarık» denilmiştir. Dârekutnî (306-385): «Ben bu hadîsi İmâm Mâlik'den rivâyet edenleri bir cüz hâlinde topladım; yüz yirmiden fazla oldular. İki Süfyân ile İbn Cüreyc ve Ezâî de bunlar arasındadır.» diyor. Ömer İbn Abdilberr (368-463) dahi: «Bu hadîsi yalnız İmâm Mâlik rivâyet etmiştir; başkasından rivâyet edildiği bilinmiyor; onu İbn Şihâb'dan sahih senedle Mâlik’den başka rivâyet eden olmamıştır.» demiştir. Gerçi İbn Şihâb’ın kardeşi oğlu da amcası vasıtasîle Hazret-i Enes'den aynı hadîsi rivâyet etmişse de onun rivâyeti hemen hemen sahîh değildir; deniliyor. hadîsini rivâyet edenler arasında Bişr b. Imrân ile Mansûr b. Selemete’l Huzâîde vardır. Bunlar miğferin demirden olduğunu söylemişlerdir; ve ikisi de mu'temed zevattır. Aynı şekilde rivâyette bulunan birçok râvîler daha varsa da onlar derecesinde şâyan-ı i'timâd değillerdir. b. Ubâde'nin aynı isnâdla rivâyet ettiği hadîsde: «Üzerinde miğfer olduğu halde tavaf etti» ziyâdesi vardır. Bu ziyâde başkalarının rivâyetlerinde yoktur. Abdullah b. Ca'fer El- Medînî'nin İmâm Mâlik'den, onun da Zührî'den, onun da Enes (radıyallahü anhûm)'den naklen rivâyet ettiği hadîsde: «Resûlüllah (sallallahü aleyhi ve sellem) Mekke'nin fethi günü, başında miğfer olduğu hâlde Hareme girdi de Hacer-i Esved'i bastonla istilâm buyurdu.» denilmektedir ki, bunu da Abdullah'dan başka İmâm Mâlik'den rivâyet eden olmamıştır. Bir rivâyette Resûlüllah (sallallahü aleyhi ve sellem)’in fetih yılının ramazânında Harem'e girdiği ve oruçlu olmadığı bildirilmiştir. Fakat hadîsi bu isnâd ve bu lâfızla İmâm Mâlik'in rivâyet ettiğini bilen yoktur. Yalnız Süveyd b. Saîd’in İmâm Mâlik'den onun da İbn Şihâb'dan, onun da Enes (radıyallahu anh)'dan naklen rivâyet ettiği hadîsde: (sallallahü aleyhi ve sellem) fetih yılında Mekke'ye ihrâm-sız olarak girdi» denilmiştir. «Bu hadîsi İmâm Mâlik'den başka rivâyet eden olmamıştır» denildiği vakit: «Ben onu Mâlik, tarîkından başka on üç tarîkdan rivâyet etmişimdir.» mukaabelesinde bulunmuştur. Ulemâ onu bu husûsda itham etmiş; ve ölçüsüz konuştuğunu söylemişlerse de Aynî kendilerine şu cevabı vermiştir: «Bu meselede ulemâ hatâ etmişlerdir; zira bu bâbda bilgileri az; ve İbn'l -Arabî'nin bildiklerine vâkıf değillerdir. Üstadımız Zeynüddîn (rahimehullah)'e: Bu hadîsi Zührî'den yalnız İmâm Mâlik rivâyet etmiştir; deniîdikde; onun Zührî'nin kardeşi oğlu ile Ebû Üveys, Ma'mer ve Ezâî tarîklerinden de rivâyet olunduğunu; Zührî'nin kardeş oğlu rivâyetini Bezzâr, Ebû Üveys rivâyetini İbn Sa'd ile İbn Adiy, Ma'mer rivâyetini İbn Adiy, Evzâî rivâyetini Mizzî tahrîc ettiklerini söylemişti. Mamafih (bunu yalnız Mâlik rivâyet etmiştir) sözünün (sahih olmak şartîle) mânâsına hamledilebileceğini söyleyenler de olmuştur. Çünkü başka tarîklerde sahih şartlan yoktur.» Bâzılarına göre başa giyilen çelik telden örme zırhtır. Bir takımları başa giyilen tas şeklindeki mahfazanın saçakları mânâsına geldiğini söylemişlerdir. İbn Abdilberr: «Miğfer, başı silâhtan koruyan tas ve benzeri şeylerdir; demirden de başka şeylerden de yapılabilir» diyor. (sallallahü aleyhi ve sellem)'e gelen zât Ebû Berze-te'l-Eslemî (radıyallahü anh) idi. Hata!'in ismi ihtilaflıdır. Bazıları Abdullah, diğer Bazıları Hilâl olduğunu söylemişlerdir. Fakat Kelbî'nin beyânına göre Hilâl olması doğru değildir. Hilâl onun kardeşinin ismidir. Esah kavle göre cahiliyet devrinde ismi Abdü’l-Uzzâ imiş; müslümanlığı kabul edince kendisine Abdullah denilmiş. Bunun Abdullah b. Hilâl olduğunu söyleyenler olduğu gibi, Gâlib b. Abdillâh b. Hatal adını taşıdığını iddia edenler de vardır. Hatal'i kimin öldürdüğü dahi ihtilaflıdır. Bu meyanda Ebû Berze, Saîd b. Hureys el-Mahzûmî, Zübeyr b. Avvâm ve Ammâr b. Yâsir (radıyallahü anh) hazerâtının isimleri geçmektedir. Bir rivâyete göre onu öldürmek için Saîd b. Hureys ile Ammâr b. Yâsir koşmuşlar; Saîd daha genç olduğu için Ammar'ı geçmiş ve öldürmüştür. Fakat esah olan rivâyete göre İbn Hatal’i Hazret-i Ebû Lerzete'l-Eslemî öldürmüştür. Diğer zevat da öldürmek için koşmuş; ancak bu işi fi'len Ebû Berae icra etmiştir. (130-207)'nin beyanına göre Resûlüllah (sallallahü aleyhi ve sellem) o gün on kişiye emâ'n vermemiş; onların öldürülmesini emir buyurmuştur. Bunların altısı erkek, dördü kadındır. yukarıda işaret ettiğimiz vecihle İbn Hatal'in öldürülmesine sebep, irtidâd etmesidir. Bu adam evvelce müslümandı. Resûlüllah (sallallahü aleyhi ve sellem) kendisini zekât toplamağa me'mûr etmiş; yanına da Ensâr'dan birini vermişti. İbn Hatali'n bir de müslüman hizmetçisi vardı. Bir yerde konakladılar. İbn Hata! hizmetçiye, bir teke keserek kendisine yemek hazırlamasını emretti; ve uykuya yattı. Uyandığı zaman emrinin yerine getirilmediğini görünce üzerine hücum ederek hizmetçiyi öldürdü. Sonra kendisi de irtidâd etti; ve müşrik oldu. İbnİ Hatal'in iki cariyesi vardı. Bunlar Resûlüllah (sallallahü aleyhi ve sellem)'i hicvederek şarkılar söylerlerdi. Abdilberr'in beyanına göre Peygamber (sallallahü aleyhi ve sellem) Ensâriyi bu kâfileye emir ta'yîn etmişti. Yolda giderken İbn Hatal onun üzerine hücum ederek öldürdü; ve malını alarak kaçtı. Rivâyete nazaran İbn Hatal vahi kâtiblerindenmiş. Fakat âyeti nâzil oldu mu onu şeklinde takdim ve te'hîrli yazar; diğer âyetlerde de aynı şekilde hareket edermiş. Kendisine «iki kalpli» derlermiş. hiç bir kimsenin içinde iki kalb yaratmamıştır. .\" Âyet-i kerîme âyet-i kerîmesi onun hakkında nâzil olmuş. hadîsi —burada olduğu gibi— talebe hocasına okur da hocası dinler ve anlar da ses çıkarmazsa bâzı Şâfiîler'le Zahirîler'e göre «evet» demedikçe bu semâ' sahîh değildir. Cumhûru ulemâ ve muhaddisîne göre ise «evet» demek şart değil sâdece müstehabdır. Zâhir-i hâl ile iktifa ederek üstadın sükûtu kâfi görülür. Çünkü bir mükellefin böyle bir hâlde hatayı ikrar etmesi caiz değildir. Kâdî Iyâz: «Bütün ulemânın mezhepleri budur. Selefden (evet) diyenler bunu şart olduğu için değil, te'kîd ve ihtiyat olmak üzere söylemişlerdir.» diyor",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 512
			}
		}
	]
}