{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3319,
			"arabicnumber": "1363.02",
			"text": "(Bize İbn Ebî Ömer rivâyet etti. ki): Bize Mervân b. Muâviye rivâyet etti. ki): Bize Osman b. Hakîm el-Ensârî rivâyet etti. ki): Bana Âmir b. Sa'd b. Ebî Vakkas, babasından naklen haber verdi ki: « Resûlüllah (sallallahü aleyhi ve sellem) buyurdu» demiş; sonra İbn Nümeyr hadîsi gibi rivâyette bulunmuş. O bu hadîsde şunu da ziyâde etmiş: Medînelilere bîri bir kötülük etmek isterse Allah onu cehennemde kurşun eritir gibi yahud suda tuz eritir gibi eritir.» Büyük ve dikenli ağaç demektir. Müfredi idâhe, idahe, ıdah gelir. Şiddet ve açlık demektir. Meşakkattir. Iyâz diyor ki: «Vaktiyle bana bu hadîsin mânâsını sordular ve: Peygamber Efendimizin şefaati umûmî iken burada niçin Medîneli'lere tahsis edilmiştir? dediler. Ben bu suâle birkaç kâğıt dolduran kanaatbahş ve kâfî bir cevap verdim. Doğruluğunu her okuyan itiraf etti. Burada ondan makama lâyık olan bazı kısımlarını söyliyeceğim. Üstadlarınızdan biri bu hadîsdeki (ev) kelimesinin şekk mânâsına geldiğini söylemiştir. Bize göre şekk mânâsına olmaması daha zahirdir. Çünkü bu hadîsi Câbir b. Abdillâh, Sa'd b. Ebî Vakkâs, Abdullah b. Ömer, Ebû Saîd-i Hudrî, Ebû Hüreyre, Esma binti Umeys ve Safiyye binti Ebî Ubeyde Peygamber (sallallahü aleyhi ve sellem)’den bu lâfızla rivâyet etmişlerdir. Bunların yahut onlardan rivâyet eden râvîlerin hepsinin hadîste şekketmesi ve hadîsi aynı sîga ile rivâyette ittifak etmeleri ihtimâlden uzaktır. En doğrusu Resûlüllah (sallallahü aleyhi ve sellem) bunu böyle söylemiştir demektir. Peygamber (sallallahü aleyhi ve sellem) bu cümleyi ya böylece bildirmiş yahut cümledeki (ev) kelimesi taksim için kullanılmıştır. Bu takdirde kendisi kıyâmet gününde Medîne'lilerin bâzısına şahit, diğerlerine şefaatçi olacak demektir. Yahut âsîlere şefaatçi, mutîlere şahit veya Resûlü Ekrem (sallallahü aleyhi ve sellem) zamanında vefat edenlere şahit, ondan sonra ölenlere şefaatçi olacaktır. şefaat, Resûlüllah (sallallahü aleyhi ve sellem)’in kıyâmette bütün âlemlere ve günahkârlara yapacağı şefaat ve şahadetten başka bir hususiyet arzetmektedir. Resûlüllah (sallallahü aleyhi ve sellem) Uhud şehitleri hakkında da; bunlara şahit olacağım) buyurmuştur. Binâenaleyh bu gibi tahsisler o zevat için derece ve mertebe ziyâdeliği ifâde eder. (ev) (vav) mânâsına da olabilir. Bu takdirde Resûlüllah (sallallahü aleyhi ve sellem) Medîneliler için hem şefaatçi, hem şahit olacaktır demektir. hocalarımızın dediği gibi (ev) kelimesini şekk mânâsına alırsak Şehît rivâyeti sahîh farzedildiği takdirde itiraz kalmaz. Çünkü şehâdet bütün ümmete saklanan şefâattan fazladır. Şefî' lâfzı sahîh kabul edilirse Medine'lilerin bu şefaatla imtiyazı, ya derecelerini yükseltmek yahut hesaplarını hafifletmek veyahut kıyâmet gününde arş-ı âlâsının gölgesinde sığındırmak, minberler üzerinde neşretmek, Cennet'e acele kavuşturmak vesaire gibi çeşitli kerametlerle onlara ikramda bulunmaktır.» Kâdî Iyâz’ın beyânına göre Resûlüllah (sallallahü aleyhi ve sellem)’in: kimse Medine'den yüz çevirerek onu terkederse, Allah onun yerine oraya daha hayırlısını getirir.» sözü üzerinde ihtilâf edilmiştir. Bazıları bunun Peygamber (sallallahü aleyhi ve sellem)’in hayâtına mahsûs olduğunu; umûmî ve ebedî olduğunu iddia etmişlerdir. Kâdî Iyâz bu ikinci mânânın daha sahîh olduğunu söylemiştir. bir kötülük yapmak isteyen kimseyi Allah'ın kurşun eritir gibi Cehennem'de eriteceğini beyân eden cümle hakkında Kâdî Iyâz şunları söylüyor: « (Cehennem'de) kaydı, bu kayıt olmaksızın rivâyet edilen hadîslerdeki işkâli kaldırmakta ve hükmün Âhiret'e mahsûs olduğunu beyân etmektedir. Mamafih bu cümleden murâd Medîneliler'e Peygamber (sallallahü aleyhi ve sellem)'in hayatında kötülük etmek isteyenlere müslümanların kâfi geleceği ve onları kurşunun ateşte dağıldığı gibi mahv-u muzmahil edecekleri mânâsı da kasdedilmiş olabilir. Hattâ cümlede takdim te'hîr yapılmış olmak ihtimâli bile vardır. Bu takdirde: «Allah böylelerini ateşte kurşun eritir gibi eritir» mânâsına gelir. Bu ceza da Dünyâ'da verilir. Nitekim Benî Ümeyye zamanında Medînelüer'le muharebe eden Müslim b. Ukbe gibilerin akıbetleri bu olmuştur. Müslim, Medîne'den dönerken helâk olmuş, onun arkasından kendisini gönderen Yezîd b. Muâviye vb. gitmişlerdir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 523
			}
		}
	]
}