{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3320,
			"arabicnumber": "1364",
			"text": "(Bize İshâk b. İbrahim ile Abd b. Humeyd hep birden Akaâî'den rivâyet ettiler. Abd dedi ki: Bize Abdülmelik b. Amr haber verdi. ki): Bize Abdullah b. Ca'fer, İsmail b. Muhammed'den, o da Âmir b. Sa'd'dan naklen rivâyet etti ki, Sa'd (hayvanına) binerek Akîk'daki köşküne gitmiş. (Orada) Ağaç kesen yahut yapraklarını silken bir köle bulmuş ve köleyi soymuş. Sa'd döndüğü vakit kölenin sahipleri gelerek kölelerinden aldığı şeyleri ona yahut kendilerine iade etmesi hususunda kendisiyle konuşmuşlar. Sa'd: . Resûlüllah (sallallahü aleyhi ve sellem)’in bana ganimetten ziyâde olarak ihsan buyurduğu bir şeyi geri çevirmekten Allah'a sığınırım» diyerek aldığı şeyleri onlara iade etmekten çekinmiş. Sa'd'in köleyi soyması bir daha böyle iş yapmasın diyedir. Kölenin üzerindeki elbiseyi almış, yalnız avret mahallini örtecek mikdâ-rını bırakmıştır. Nevevî'nin beyânına göre bu hadîs İmâm Şâfiî'nin eski kavline delildir. Bu kavle göre Medine'nin hareminde avlanan veya ağaç kesen kimsenin üzerindeki eşyası alınır. Hazret-i Sa'd b. Ebî Vakkas (radıyallahü anh) ile Ashâb-ı Kiram'dan bir cemaatın kavilleri de budur. Fakat Kâdî Iyâz sahabeden sonra buna yalnız İmâm Şafiî'nin eski mezhebinde iken kaail olduğunu ve bütün şehirler ulemâsına muhalefet ettiğini söylemiştir. Nevevî, İmâm Şafiî'yi müdâfaa sadedinde şunları söylemiştir: «Sünnet İmâm Şafiî ile beraber olunca onun bütün ulemâya muhalefeti zarar etmez. Muhtar olan. kavil Şafiî'nin bu eski kavlidir. Çünkü bu bâbda hadîs sabit olmuş, sahabe de bu hadîs mucibince amel etmişlerdir. Hadîsi def edecek bir delil sabit olmamıştır. Ulemâmız diyor ki: İmâm Şafiî'nin eski kavli ile amel edersek ödetmenin keyfiyeti hususunda iki suret vardır. Birinci surete göre av, kesilen ağaç ve ot Mekke'nin hareminde olduğu gibi ödettirilir. Esah olan kavle göre avcının, ağaç ve öt kimsenin eşyası soyulur. Bu takdirde soyulacak eşyadan murâd ne olduğu hususunda iki kavil vardır. Birinci kavle göre yalnız elbisesi alınır. Esah olan ve cumhûrun kat'iyyetle ele aldıkları ikinci kavle göre burada ahnacakh şeyler küffârdan öldürülen bir kimsenin üzerinden alınan şeyler gibidir. Binâenaleyh atı, silâhı ve nafakası hep alınır. şeylerin nereye sarfedileceği hususunda ulemâmızdan üç kavil rivâyet olunur. Bunların esah olanına göre alınan şeyler alanın mülkü olur. Hazret-i Sa'd hadîsine muvafık olan da budur, İkinci kavle göre alına şeyler Medîne'nin fıkarâsma; üçüncü kavle göre beyt'ül-mâl'e verilir. Haremde cinayet işleyen kimse soyulurken avret mahallini örtecek mikdârı müstesna olmak üzere üzerinde bulunan bütün eşyası alınır. Hattâ Bazıları avret mahallini örten elbisesinin dahi alınacağını söylemişlerdir. Ulemâmız avı öldürsün öldürmesin mücerred avlanmakla bir kimsenin soyulacağına kaail olmuşlardır.»",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 524
			}
		}
	]
}