{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 333,
			"arabicnumber": "127.03",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Vekî' rivâyet etti. ki): Bize Mis'ar'la Hişâm rivâyet etti. H. İshâk b. Mansûr da rivâyet etti. ki): Bize Hüseyn b. Aliy Zâide'den, o da şeybân'dan ve bunlar toptan Katâde'den bu isnâdla bu hadisin mislini haber verdiler. hadisi Buhârî »Kitabü’l-Itk», «Kitabü't-Talâk» ve «Kitâbü'l-Eymân ve'n-Nüzûr» da, Ebû Davûd, Tirmizî Nesâî ve İbn Mâce «Kitâbü't-Talâk» da tahric etmişlerdir. rivâyetlerde: yerine denilmiştir. Aynî o rivâyeti daha güzel bulmaktadır. bâzı rivâyetlerde şeklinde merfu'dur. Bazıları lisân âlimlerinin bunu merfu' okuduklarını söylemişse de Aynî iki vechin de caiz olduğunu söylemektedir. Kelime mansub okunursa ma'nası: «nefislerine söyledikleri şey», merfû okunursa «nefislerinin kendilerine söylediği şey » olur. Yani birinci takdire göre (enfüs) kelimesi mef'ul, ikinciye göre faildir. Bu kelimenin yerine hadisin bâzı rivâyetlerinde: verdiği vesveseyi...» denilmiş hatta Nesâî'nin rivâyetinde: verdiği vesvese ile gönüllerinden geçen şeyleri...» buyurulmak suretüe kelimelerin ikisi birden zikredilmiştir. nefisde yer etmeyip tereddüd halinde bulunan şeydir. Gönülden geçen şeyler diye terceme ettiğimiz «hadis'ün-nefs» de öyledir. Bunlar kuvveden fi'le çıkmadıkça muâhazeyi icâb etmezler. Şu var ki; vesvese ve gönülden geçen şeylerin cezayi istilzam etmemesi için onların kalbden gelip geçmeleri şarttır. Bunları yapmağa niyet edilir de kalbde yer eder kalırsa azabı müstelzim olurlar. Iyâz şöyle diyor: «Kalbte geçen şey, orada yer edip karar kılmadan gelip geçerse buna «hemra» derler. Şayed devam eder de kalbe yerleşirse «azim» olur. Azim sebebile ise inşân yâ muâhaze olunur yahud sevab kazanır. «Yani bir haramı irtikâba azmeden azaba, hayır yapmaya azmeden de sevaba lâyık olur demek istiyor. diyor ki: «Kâdi Iyaz'ın kavli bilumûm selef uleması ile fukahanın, muhaddislerin ve ilm-i kelâm âlimlerinin mezhebidir. Bu hususta onlara muhalefet ederek: «İnsanın kalbinden geçen şeyler orada yer etsin etmesin hiç bir muâhazeyi icâb etmez.» diyenlerin sözüne bakılmaz. Tealâ Hazretlerinin: gerçekten ona niyeti kurmuştu. Rabbinin burhanım görmemiş olsa o da ona niyeti kurmuş gitmişti...\" Sure-i Yusuf, âyet: 24. âyet-i kerimesile ve bu hadisle Resûlüllah (sallallahü aleyhi ve sellem)’in: «Fi'len yapmadıkça yahud söylemedîkçe» buyurmuş olmasile bir de kötülük etmeye azmetmişken yapmayan ve söylemeyene ceza verilmemesile istidlal ederlerse de âyetle istidlallerine verilecek cevab: Âyetteki gönüden geçen şeylerdir. Fakat bazıları da kalbde yer etmeyen düşüncelerdir ki, bunlardan dolayı azâb yoktur. Nitekim bu hadisde buna şahittir...» de şunları söylemiştir: «Ulemâ diyor ki: Bir kimse velev 25 sene sonra bir vacibi terk yahud bir haramı irtikâb edeceğine az-meylese derhâl âsî olur.» Hatırdan geçen şeylerden murâd: niyet derecesine varmayan şeylerdir. Niyet derecesine varan kuruntulardan dolayı kul muâhaze edilecektir. «Hadisdeki (konuşmadıkça) tabirinden murad: gönülden geçen şeydir. Çünkü ası! kelâm, ilme muvafık olan kalbteki sözdür; dil onun tercemarudır; demişse de bu söz reddedilmiştir. Zira kaîb-den geçen şeyler söz yerine geçse, bunların namazı da bozması icâbederdi. Halbuki konuşmak namazı bozduğu halde gönülden geçen şeylerin namazı bozduğuna kail olan bulunmamıştır. Hazret-i Ömer (radıyallahu anh): «Ben ordumu namazda iken hazırlarım.» demiştir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 240
			}
		}
	]
}