{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3336,
			"arabicnumber": "1374.01",
			"text": "Bize Hammâd b. İsmâîl b. Uleyye rivayet etti. (Dediki): Bize babam, Vüheyb'ten, o da Yabyâ b. Ebî îshâk'dan naklen rivayet etti, O da Mehrî'nin azadlısı Ebû Saîd'den rivayet etmişki, Medine'de başları sıkılmış, meşakkat çekmişler. Ebû Saîd, Hz. Ebû Saîd-i Hudri'ye gelerek : «Ben çoluk çocuğu kalaba bir adamım. Meşakkata düçâr olduk. Binâenaleyh çocuklarımı köylerden birine nakletmek istiyorum» demiş. Hz. Ebû Saîd şu mukabelede bulunmuş : — «Bunu yapma! Medine'de kal! Çünkü biz Nebiyyullah (Sallallahu Aleyhi ve Sellem) ile yola çıktık —zannederim şöyle dedi— Usfân'a geldiğimiz vakit orada birkaç gece kaldı. Cemâat: — Vallahi burada bizim bir işimiz yok. Çoluk çocuğumuz kimsesizdir. Onlar namına emin değiliz, dediler. Nebi (Sallallahu Aleyhi ve Sellem) bunu duydu ve : «Konuştuklarınızdan bu kulağıma gelenler nedir? —nasıl dediğini bilemiyorum — Kendisine yemin ettiğim Allah hakkı için yahut nefsim yed-i kudretinde olan Allah'a yemin ederim ki gönlümden geçti yâhuf dilerseniz —bunların hangisini dediğini bilemiyorum — devemin semerlenmesini emreder sonra Medine'ye varıncaya kadar onun bir düğümünü çözmem buyurdu ve şöyle devam etti : — Allah'ım! Şüphesiz kî Ibrâhîm Mekke'yi haram kılarak onu harem yaptı. Ben de Medine'yi, onun iki dağı arasını iyiden iyiye haram kıldım. Orada kan dökülmemeli, harb için silâh taşınmamalı, ağacından yaprak düşürülmemeli. Yalnız hayvanı alaflandırmak için düşürülen müstesna! Allah'ım! Bize Medine'miz hakkında bereket ihsan eyle! Allah'ım! Bize sâ'ımız hakkında bereket ihsan eyle! Allah'ım! Bize müddümüz hakkında bereket ihsan eyle! Allah'ım bize sâ'ımız hakkında bereket ihsan eyle! Allah'ım! Bize müddümüz hakkında bereket ihsan eyle! Allah'ım! Bize Medine'miz hakkında bereket ihsan eyle! Allah'ım! Bir bereketin yanısıra iki bereket ihsan eylei Nefsim yed-i kudretinde olan Allah'a yemin ederimki, Medine'nin her dağ yolu ve geçidinde iki melek vardır. Onu siz varıncaya kadar korurlar.» Sonra cemaata : «Yollanın!» buyurdu. Biz de yola revân olduk ve Medine'ye geldik. Kendisine yemin ettiğimiz yahut kendisine yemin olunan —buradaki şekk râvî Hammâd'dandir— Allah hakkı için Medine'ye girdiğimiz vakit henüz semerlerimizi indirmemiştik ki, Benî Abdillâh b. Gatafân kabilesi üzerimize baskın yaptılar. Halbuki bundan önce onları harekete geçirecek bir sebep yoktu",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 540
			}
		}
	]
}