{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3343,
			"arabicnumber": "1376.02",
			"text": "(Bize Ebû Küreyb rivâyet etti. ki): Bize Ebû Üsâme ile İbn Nümeyr Hişâm b. Urvefden bu isnâdla bu hadîsin mislini rivâyet etti. hadîsi Buhârî «Hacc» bahsinin sonlarında ve «Kitâbu'd-DeâvâUda tahrîc etmiştir. Onun Hacc bahsindeki rivâyeti daha mufassaldır. Mezkûr rivâyette Medine'ye gelince Hazret-i Ebû Bekr ile Bilâl (radıyallahü anh)'ın sıtmaya tutuldukları ve Mekke'ye hasret çekerek şiirler okudukları hattâ Hazret-i Bilâl'in kendilerini yurtlarından eden Şeybetü'bnü Rabia. Utbetü'bnü Rabîa ve Ümeyyetü'bnü Halef'e lanet okuduğu bildirilmektedir. Resûlüllah (sallallahü aleyhi ve sellem)'in duası bu münâsebettedir. Hastalığın Medine'den Cuhfe'ye havalesini istemesi o gün Cuhfe şirk diyân olduğu içindir. Hattâbî o zaman Cuhfe'de Yahûdilerin yaşadığını söyler. Resûlüllah (sallallahü aleyhi ve sellem)’in duası müstecâb olmuş. Cuhfe o günden bugüne sıtmalı bir yer olarak devam etmiştir. «Bu hadîsde Peygamber (sallallahü aleyhi ve sellem)’in mucizelerinden biri vardır. Zira Cuhfe o gündenberi herkesin kaçındığı bir yer olmuştur. Onun suyundan kim içerse sıtmaya tutulur.» diyor. Ayni Resûlüllah (sallallahü aleyhi ve sellem)’in: «Medine'ye tâûn giremez» hadîs-i şerifinin bu sırra mebni vârid olması ihtimâlinden bahsetmiştir. Çünkü tâûn, vebadır. Resûlüllah (sallallahü aleyhi ve sellem) vebanın Medîne'den Cuhfe'ye naklini nîyâz etmiş. Allahü teâlâ da duasını kıyâmete kadar kabul buyurmuştur. şöyle bir suâl hatıra gelebilir: Sahih bir hadîsde vebalı bir yere girmek yasak edildiği halde acaba muhâcirîn-i kirâm Medine’ye nasıl girebilmişlerdir? Bu suâle Kâdî Iyâz iki vecihle cevap vermiştir: Birinci veçhe göre ashabın hicretleri vebalı yere girmek yasak edilmezden Öncedir. Vebâh yere girmek Medine'ye yerleştikten sonra yasak edilmiştir. İkinci veçhe göre yasak edilen şey, sür'atle bulaşan veba ve taunun bulunduğu yere girmektir. Medine'deki hastalıksa bu kabilden değil iklim değişikliği dolayısiyle ekseriya yabancılara arız olan beden bozukluğundan ibaretti",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 547
			}
		}
	]
}