{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3386,
			"arabicnumber": "1397.03",
			"text": "(Bize Hârûn b. Saîd el-Eylî rivâyet etti. ki): Bize İbn Vehb rivâyet etti. ki): Bana Abdülhamîd b. Ca'fer rivâyet etti. Ona da Imrân b. Ebî Enes, ona da Selmân-ı Egarr rivâyet etmiş, Selmân da Ebû Hüreyre'yi haber verirken dinlemiş ki, Resûlüllah (sallallahü aleyhi ve sellem): ancak üç mescide yapılır: Mescid-i Kâ'be'ye, benim mescidime ve Mescid-i lliyâ'ya.» buyurmuşlar. hadîsi Buhârî ile Nesâî «Namaz» bahsinde; Ebû Dâvûd «Hacc» bahsinde muhtelif râvilerden tahric etmişlerdir. babda Hazret-i Ebû Hüreyre'den mâada Busrâ, Ebû-busra ve Abdullah b. Amr (radıyallahü anh) Hazerâtından da hadîsler rivâyet olunmuştur. Hazret-i Ebû Hüreyre'den rivâyet ettiği bir hadîste: «Sefer ancak üç mescide yapılır. Bunlar Mescid-i Hayf, Mescid-i Haram ve benim şu mescidimdir.» buyrulmuştur. Taberânî, Mescid-i Hayf’ın yalnız bu hadîste zikredildiğini söyler. Haram'dan murâd; Kâbe-i Şerif'edir. Mescid-i Aksa Kudüs'deki mesciddir. Bu mescid Kabe’den ya mesafe yâhud zaman itibariyle uzak olduğu için ona en uzak mânâsına gelen Aksa ismi verilmiştir. Bir hadîste Kâbe'yi de Mescid-i Aksa'nın kuruluşları arasında kırk yıllık zaman bulunduğu bildirilmiştir. Hazret-i Âdem ile Dâvûd (Aleyhisselarn) arasında bundan kat kat fazla zaman geçmiş olmasına bakarak bazıları bu hadîsi müşkil görmüşlerse de kendilerine şöyle cevap verilmiştir: Her iki mescidin temellerini melekler atmıştır. İki temel atma arasında kırk yıllık zaman vardır. Sonra Hazret-i Dâvûd ile Süleyman (aleyhisselâm) Mescid-i Aksa'nın binasını yapmışlardır. Nitekim İbrahim (aleyhisselâm) da Kâbe'yi bina etmiştir. Bazıları bu mescide, Mescid-i Aksa denilmesi Medîne mescidine uzak olduğu içindir demişlerdir. Zira Medîne-Mekke'ye uzaktır. Kudüs ise daha da uzakta bulunmaktadır. İşte Aksa isminin verilmesinin vech: budur. Yerinin yüksekliğine bakarak bu ismin verildiğini de söyli-yenler vardır. Hayf , Mina'dadır. Cümlesinin asıl mânâsı; semerler bağlanmaz, demektir. Bu söz yola çıkmaktan kinayedir. Çünkü sefere çıkmak için binilecek hayvana semer vurmak lâzım gelir. Maksad herhalde sefer olduğu için muhtelif vâsıtalara binmekle yürüyerek gitmek arasında mânâca fark yoktur",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 590
			}
		}
	]
}