{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3402,
			"arabicnumber": "1400.05",
			"text": "(Bana Abdullah b. Saîd El-Eşecc rivâyet etti. ki): Bize Vekî rivâyet etti. ki): Bize Â'meş, Umâretû'bnû Umeyr'den, o da Abdûrrahman b. Yezid'den, o da Abdûllah’dan naklen rivâyet etti. Abdullah Şöyle dedi: «İbn Mesûd'un yanına girdik. Ben girenlerin en genci idim...» Râvi yukardakilerin hadîsi gibi rivâyette bulunmuş. Fakat: «Artık durmayıp evlendim» cümlesini söylememiştir. hadîsi Buhârî ile Nesâî «Oruç» ve «Nikâh» bahislerinde, Ebû Dâvûd ile İbn Mâce «Nikâh» bahsinde muhtelif râvilerden tahric etmişlerdir. . Abdirrahman, Hazret-i İbn Mes'ûdun künyesidir. Bazıları buradaki Ebû Abdirrahman’ın «Hazret-i Abdullah b. Ömer olduğunu iddia etmiş ve Ebû Abdırrahman’ın onun meşhur olan künyesidir» demişlerse de doğru değildir. Bu kıssada Abdullah b. Ömer (radıyallahü anh)'ın dahli yoktur. ki, nefsinden kaybettiğin bazı şeyler sana döner» cümlesinden murad gençliğindeki neşât ve kuvvetidir, Bazıları: «İhtimal ki Hazret-i Osman İbn Mesûd (radıyallahü anh)’ın hâlinde pejmürdelik görmüş; bunu evlenmemiş olmasına hamletmiştir derler. yâ Alkameî» diyen Kirmânî'ye göre Hazret-i Abdullah İbn Mesûd'dur. Ayni bu sözü Hazret-i Osman’ın söylemiş olmasını muktezâyı hale daha muvafık görmüşse de bizce hadîsin Buhârî'deki ibaresi dahi Kirmânî’nin haklı olduğunu göstermektedir. Zira Buhârî'de yâ Ebâ Abdirrahman! Benim sana söyleyecek bir hacetim var, dedi. Ve'bir kenara çekildiler. Osman: Ya Ebâ Abdirrahman! Seni bir kızla evlendirmemize razı mısın? Sana kaybettiğin gençlik kuvvetini hatırlatır, demiş. Abdullah (radıyallahü anh) onun bundan başka söyliyecek bir haceti olmadığını görünce bana işaret ederek; gel ya Alkame! dedi » buyrulmaktadır. Bir sıfatın hepsine şâmil olduğu taifedir. Binâenaleyh gençler bir ma'şer, ihtiyarlar dahi bir ma'şerdir. Lisânımızda bunlara cemâat denir. Şâabbın cemidir. Gençler demektir. Şâabb kelimesi Sebebe ve Şubbann şekillerinde de cemilenir. Nevevî Şâfiîler'e göre otuz yaşım geçmeyen âkil baliğ kimselere «Şâabb» denildiğini söylüyor. Kurtubî ise onaltı yaşma kadar bir çocuğa «hades», onaîtı yaşından otuz iki yaşma kadar «şâabb», otuz ikiden yukarı olanlara «Keh'iİ» denildiğini bildirmiştir. Zemahşerî’nin kavli de budur. Bazıları otuz ikiden kırk yaşma kadar olanlara Kehil denileceğini söylemişlerdir. Resûlüllah (sallallahü aleyhi ve sellem) Efendimizin hassaten gençlere hitab buyurması, kadınlara karşı şehvet daha ziyâde onlardan beklendiği içindir. kelimesinden murâd ne olduğu ulemâ arasında ihtilaflıdır. Bir kavle göre bundan murâd nikâh masrafları, ikinci kavle göre cimâ'dır. Ulemâ ikinci kavli daha sahih bulmuşlardır. Mamafih her iki kavil netice itibariyle aynı mânâya gelirler. Cümlenin takdiri şudur: «Sizden kimin mâlî kudreti bulunmak suretiyle cinsî münasebete gücü yeterse hemen evlensin. Mâlî kudreti bulunmamak suretiyle cimaa gücü yetmeyen de oruç tutsun, bu suretle âdeta hayaları çıkarılmış gibi şehvetini kessin.» kelimesi, Bâat, Bâa' ve Bâhe şekillerinde de okunmuştur. Fakat meşhur kıraati Bâae'dir. Bu kelimenin lûgatta asıl mânâsı cinsî münasebettir. Sonra nikâh akdine de bâae denilmiştir. Hayaların çıkarılmasıdır. Bâzılarına göre Vicâ' hayaları burmaktır Onları çıkarıp atmaya iksâ' denilir. Resûlüllah (sallallahü aleyhi ve sellem) oruca teşvik suretiyle bu ismi vermiştir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		}
	]
}