{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3412,
			"arabicnumber": "1404.03",
			"text": "(Bİzc Ebû Bekir b. Ebû Şeybe rivâyet etti. ki): Bize Vekî' İsmail'den bu isnâdla rivâyetle bulundu. «Biz genç olduğumuz haldeydik ve yâ Resûlallah! Hayalarımızı çıkaralım mı diye sorduk?» dedi. «Kaza ediyorduk demedi.» hadîsi Buhârî «Nikâh» ve «Tefsir» bahislerinde, Nesâî «Tefsir» bahsinde muhtelif râvilerden tahric etmişlerdir. Görülüyor ki ashâb-ı kiram'dan Bazıları şehvetlerini kırmak ve şeytanın vesvesesinden kurtulmak için hayalarını çıkarmak istemişler. Fakat Resûlüllah (sallallahü aleyhi ve sellem) onları bundan nehi buyurmuştur. Çünkü bu iş Allah'ın halk ettiği şekli değiştirmek, neslin önünü kesmek ve canlıya eziyet gibi bir takım memnu' fiilleri tazammun etmektedir. Resûlü Ekrem (sallallahü aleyhi ve sellem) bunun yerine ashâb-ı kirâm'ma müfa denilen bir nevi muvaffak nikâha ruhsat vermiştir. Hadîs-i şerifte: bize elbise mukabilinde bir kadını bir müddet nikâh etmeye ruhsat verdi» cümlesinden murâd budur. Müt'a'nın mutlaka bir elbise mukabilinde olması şart değildir. İki tarafın razı olacakları herhangi bir şeyle müt'a yapılır. Nikâh-ı müt'a: Temettü' lâfzîle yapılan muvakkat nikâhtır. Bunda şahit lâzım değildir. râvisi Hazret-i Abdullah b. Mesud'dur. Okuduğu âyet-i kerîme İbn Abbâs (radıyallahü anh)’ın beyânına göre ashâb-ı kiram'dan üç kişi hakkında nâzil olmuştur. Bu zevat kendi aralarında: «Tenasül âletlerimizi keselim de dünya şehvetlerinden vaz geçelim. Biz de Râhiblerin yaptıkları gibi yeryüzünde seyahat edelim.» diye konuştukları vakit nâzil olmuştur. Resûlüllah (sallallahü aleyhi ve sellem). bunu haber aldığı vakit kendilerini çağırtarak böyle bir şey konuşup konuşmadıklarını sormuş; onlar da evet diyerek tasdik etmişlerdi. Bunun üzerine onlara: ben hem oruç tutarım, hem tutmam. Hem namaz kılarım, hem uyurum; kadınlarla da evlenirim. İmdi her kim benim sünnetimle amel ederse bendendir; kim benim sünnetimle amel etmezse o benden değildir.» buyurdular. Bu hadîsin mislini İbn Merdeveyh Hazret-i İbn Abbâs'dan rivâyet etmiştir. diyor ki ; «Bâbımız hadîsinde Hazret-i Abdullah b. Mes'ud'un İbn Abbâs (radıyallahü anh) gibi nikâhı müt'a'nın mubah olduğunu itikat ettiğine işaret vardır. Herhalde onlar bunun nesh edildiğini, duymamışlardır.» Iyâz müt'a'nın mubah olduğuna dair ashâb-ı kirâm’dan bir cemaatın hadîs rivâyet ettiklerini söyler. Nitekim Bâbımızda görülecek. Câbir b. Abdillah ile Selemetü'bnü Ekvâ', Sebratü'bnü Ma'bed ve İbn Abbâs (radıyallahü anh) hadîslerinden de nikâhı müt'a'ya ruhsat verildiği anlaşılmaktadır. Yalnız bu hadîslerde evlerinde mukim olanlara müt'a'nın mubah kılındığına dair bir kayıt yoktur. Bilâkis müt'a için sefer ve gazalarda zaruret icabı ruhsat verildiği bildirilmektedir. Çünkü memleket sıcak, ashabın kadınlara karşı sabırları azdı. Ömer (radıyallahü anh) hadîsinde mût'anm muztar kalmak şartıyla îslâm’ın ilk devirlerinde bir ruhsat olmak üzere tecviz edildiği bildirilmektedir. Böyle bir rivâyet İbn Abbâs (radıyallahü anh) dan da nakledilmiştir. Mâziri: «Nikâhı mût'anm İslâm'ın ilk devirlerinde caiz olduğu sabittir. Sonra nesh edildiği dahi sahih hadîslerle sübüt bulmuş; ve haram olduğuna icmâ'ı ümmet inikaad eylemiştir. Bu hususta ehl-i bid'atdan bir taife müstesna olmak üzere muhalefet eden bulunmamıştır. Ehl-i bid'at, mensuh hadîslerle istidlale teşebbüs etmişlerse de bu hadîslerde onlara bir delil yoktur.» demektedir. mût'a hakkında gereken izahat aşağıdaki rivâyetlerde sırası geldikçe verilecektir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		}
	]
}