{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3453,
			"arabicnumber": "1411",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Yahya b. Âdem rivâyet etti. ki): Bize Cerîr b. Hâzim rivâyet etti. ki): Bize Ebû Fezâre, Yezid b. Esam'dan naklen rivâyet eyledi. ki) ; Bana Meymûne binti Haris anlattı ki, Resûlüllah (sallallahü aleyhi ve sellem) kendisi ihrâmsızken onunla evlenmiş. «Meymûne benim ve İbnî Abbâs'ın teyzemizdi.» demiş. hadîsi muhtelif râvilerden bütün Kütübü Sitte sahibleri tahric etmişlerdir. Tirmizî: «Bu hadîs Hasen şahindir.» demiştir. Bu babda İbn Hibbân Sahih'inde, Beyhakî Sünen'inde Hazret-i Âişe'den Tahavî dahi Hazret-i Ebû Hüreyre’den hadîs rivâyet etmişlerdir. Abbâs (radıyallahü anh) hadîsiyle İbrahim Nehaî, Sevrî, Ata' b. Ebî Rabâh, Hâkim b. Uteybe, Hammâd b. Ebî Süleyman, İkrime, Mesrûk, Ebû Hanîfe, Ebû Yûsuf ve İmâmı Muhammed istidlal etmiş: «İhrâmlı bir kimsenin nikâh yapmasında beis yoktur. Lâkin ihramdan çıkmadıkça cinsî münasebette bulunamaz» demişlerdir. Sahabe-i kirâmdan İbn Abbâs ile İbn Mes'ûd (radıyallahü anh) Hazerâtının kavilleri de budur. b. El-Müseyyeb, Salim, Kâsım, Süleyman b. Yesâr, Leys, Evzaî, İmâmı Mâlik, İmâmı Şafiî, İmâmı Ahmed ve İshâk ihrâmlı bir kimsenin nikâhlanamıyacağma, başkalarım da nikâh edemeyeceğine kaail olmuşlardır. Onlara göre ihrâmlının nikâhı batıldır. Sahabeden Hazret-i Ömer ile Alî (radıyallahü anh)'nın kavilleri de budur. nikâhına cevaz vermeyenler Bâbımızın Ebân b. Osman hadîsiyle istidlal ederler. Mezkûr hadîsi Ebû Dâvud dâhi tahric etmiştir. Hadîs-i şerîf ihrâmlı bir kimsenin kendisine veya başkasına nikâh yapamayacağını, dünür bile gönderemeyeceğini ifâde etmektedir. Zira dünür göndermekte nikâha arzu ve niyet vardır. Sahabeden Ebû Rafi' ile Ümmül Mü'minin Meymûne (radıyallahü anha) Peygamber (sallallahü aleyhi ve sellem)’in ihrâmsız olduğu halde evlendiğini söylemişler. Râfi' hadîsini Tirmizî rivâyet etmiştir. Hadîs şudur: Kuteybe rivâyet etti. ki): Bize Hammâd b. Zeyd, Matar El-Varrâk'dan, o da Rabîatû'bnû Ebi Abdirrahman'dan, o da Süleyman b. Yesâr'dan, o da Ebü Rafi'den naklen rivâyet etti. Ebû Kafi' Şöyle dedi: «Resûlüllah (sallallahü aleyhi ve sellem) Meymûne ile ihrâmsız olduğu halde evlendi. Aralarında elçilik eden ben idim.» hadîsi Bâbımızın sonundaki hadîsdir. Bunu Tirmizîde tahric etmiş, sonunda: ihramla çıktıktan sonra zîfâfa girdi. Meymûne Şerifte vefat etti. Resûlüllah (sallallahü aleyhi ve sellem) onu Şerifte yaptığı türbeye defnetti.» demiştir. nikâhma cevaz verenler muhaliflerinin delillerini zayıf bulmuşlardır. Çünkü Ebû Rafi' hadîsinin râvilerinden Matar El-Marrak zayıftır. Hadîsiyle ihticâc edilemez. Bu sebeble aynı hadîsi rivâyet eden İmâmdı Mâlik onu hadîsin senedinden düşürmüş, hadîsi, mürsel olarak rivâyet etmiştir. Aynı hadîs Süleyman b. Bilâl’in rivâyetinde dahi mürseldir. Abdilberr diyor ki: «Bu babda İmâm-ı Rabî'a'dan rivâyet ettiği hadîs muttasıl değildir. Onu muttasıl olarak Matar rivâyet etmiştir. Hadîsi Hammad b. Zeyd, Matar El-Varrâk'dan, o da Rabiatû'bnü Ebî Abdirrahman'dan; o da Süleyman b. Yesâr'dan, o da Ebû Rafi'den naklen rivâyet etmiştir ki, bence Matar hakkında bu sened yanlıştır. Çünkü Süleyman b. Yesâr otuzdört. tarihinde doğmuştur. Yirmi dokuz tarihinde doğduğunu söyliyenler de vardır. Ebû Rafi' ise Hazret-i Osman’ın şehâdetinden az sonra Medine'de vefat etmiştir. Osman (radıyallahü anh)'ın şehâdeti otuzbeş tarihindedir. Binâenaleyh Süleyman’ın Ebû Rafi'den hadîs dinlemiş olması caiz ve mümkün değildir. Şu haîde Matar’ın rivâyetinin bir mânâsı yoktur. İmâm-ı Mâlik rivâyeti daha şayanı kabuldür. Beyhâki'ye şaşarım. Bu hadîs hakkındaki şu malûmatı bildiği halde ses çıkarmıyor da üstelik: Matar b. Ta'man El-Verrâk ile Müslim, ihticac etmiştir, diyor.» ki, Matar, Hazret-i İbn Abbâs'dan rivâyet edenler derecesinde bir râvi değildir. Onun hakkında Nesâî: «Matar kavi değildir» demiş, İmâm-ı Ahmed'in dahi belleyişinde noksan olduğunu söylediği rivâyet olunmuştur. Meymûne hadîsine gelince: Amr b. Dinar bu hadîsin senedindeki Yezîd b. Esam'mı zayıf bulmuş. Bu hususta Zührî ile aralarında geçen bir konuşmada, Zührî bu iddiayı red edememiştir. Halbuki Hazret-i Meymûnenin ihram hâlinde nikahlandı ğmı rivâyet eden Saîd b. Cübeyr, Ata', Tavus, Mücâhid , İkrime ve Câbir b. Zeyd hazerâtı bunun aksini rivâyet edenlerden daha mûtemed ve makbuldürler. Onun ihram dışında nikâhlandığmı rivâyet eden Meymûn b. Mihrân, Habîb b. Şehir ve emsali bunların yanından bile geçemez Üstelik İbn Ebî Şeybe'nin, İsâ b. Yûnus’dan, onun da İbn Cüreyc'den, onun da Ata'dan naklen rivâyet ettiği bir hadîsde dahi: (sallallahü aleyhi ve sellem) Meymûne ile ihram halinde evlendi» denildiği gibi, İbn Sa'd’ın Tabakât'ında Ebû Nuaym'den, onun da Cafer b. Burkan'dan, onun da Meymun b. Mihram'dan naklen rivâyet ettiği bir hadîste Meymûn şöyle demektedir ; «Ata'nın yanında oturuyordum. Bir adam ona ihrâmlının nikâh edip edemeyeceğini sordu. Ata' ona şu cevabı verdi: Allah nikâhı helâl kıldıktan sonra bir daha haram etmemiştir. Ben kendisine Yezîd b. Esam’ın hadisini yani Peygamber (sallallahü aleyhi ve sellem)'nin Hazret-i Meymûne ile ihrâmsızken evlendiğini söyledim. Atâ: bunu ancak Meymûne'den almışızdır. Ve keza Resûlüllah (sallallahü aleyhi ve sellem)’in ihram halinde evlendiğini işitmîşizdir. dedi.» (sallallahü aleyhi ve sellem)’in Hazret-i Meymûne ile ihram halinde iken evlendiğini bildiren başka rivâyetler de vardır. İbn Hazm ihram halinde nikâhın caiz olmadığım iltizam etmiş; bu babdaki müddeasını isbat için sözü bir hayli uzatmış ise de Buhârî sarihi Aynî bütün iddialarına birer birer cevap vererek hepsini çürütmüştür, bazıları ihram halinde evlenmenin Peygamber (sallallahü aleyhi ve sellem)'e mahsus olduğunu söylemişlerdir. Fakat Aynî bunlara da cevap vermiş ve: «Tahsis iddiası delile muhtaçtır.» demiştir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 56
			}
		}
	]
}