{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3471,
			"arabicnumber": "1417",
			"text": "(Bize Yahya b. Eyyûb rivâyet etti. ki): Bize Hüşeym rivâyet etti. H. İbn Nümeyr de rivâyet etti, ki): Bize Ve rivâyet etti. H. Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Ebû Hâlid El-Ahmer rivâyet etti. H. Muhammed b. El-Müsennâ dahi rivâyet etti. ki): Bize Yahya yani El-Kattân, Abdûlhamid b. Ca'fer'den, o da Yezid b. Ebî Habib'den, o da Mersed b. Abdillah El-Yezeni'den, o da Ukbetü'bnû Âmir’den naklen rivâyet eyledi. Ukbe şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): ki, en ziyade ifâsı gereken şart, kendisi ile kadınları helâl yaptığınız nıehirdiı» buyurdular. Bekir ve İbn'l-Müsennâ hadîsinin lâfzı budur. Yalnız İbn'J.-Müsennâ (şart yerine) şurut dedi. hadîsi Buhârî «Nikâh» ve «Şurût» bahislerinde; diğer Kü-tübü Sitte sahiblerİ «Nikâh» bahsinde muhtelif râvilerden tahric etmişlerdir. ulemâ: «En ziyade ifası gereken» tâbirim' ilzam, değil evlâ mânâsına almışlardır. Bu takdirde mânâ şöyle olur: «İfası evlâ olan şartlar kendileri ile kadınları helâl yaptığınız mehirlerdir.» bu tâbiri ilzam ve vücût mânâsına almışlardır. gereken şartlar umûmî midir yoksa mubah olan şartlar mıdır. Yahut nikâha tealluk eden mehir ve iddet gibi şeyler midir yahut sadece mehrin vücûbu mudur? Bu hususta ulemâ ihtilâf etmişlerdir. Şübhesiz ki caiz olmıyan şartlarla akd'în mucebine zıd olan kadını boşamak veya nafakasını vermemek gibi şartlar bu bahsin haricindedir. Onların ifâsı gerekmez. Ebî Şeybe «El-Mûsannef» adlı eserinde Şa'bi'nin: «Bir adam karışma ev temin edeceğini şart koşarsa bu şart o kadını helâl eden şartlardandır.» dediğini rivâyet etmiştir. İmâmı Şafiî ile ekseri ulemânın buradaki şartları nikâhın mekasıt ve muktezâsına uygun olan iyi geçinmek, nafaka, elbise ve meskenini mâruf vecihîe vermek gibi şartlar mânâsına hamlettiklerini söylüyor. Nikâhın müktezasına muhalif düşen nafaka vermemek, adalete riâyet etmemek, sefere götürmemek gibi şartları ifâ gerekmez. Bunlar lâğvdır. göre kızın velisi kendisi için mehirden maada irşâd der-meyan ederse damadın bu şartı ifâsı gerekir. Tavus, Atâ' ve Zührî şart koşulan şeyin kadına verileceğine kaail olmuşlardır. Ömer b. Abdilazîz dahi bu şekilde hüküm vermiştir. Sevrî ile Ebû Ubeyd'in kavilleri de budur. b. Hüseyin ile Mesrûka göre velinin şart koştuğu şey onun hakkıdır. İkrime: «Nikâhı yapan bizzat veli ise şart koştuğu şey onundur.» demiş bir takımları bu hakkın veliler arasında yalnız babaya mahsus olduğunu söylemişlerdir. b. El-Müseyyeb ile Urvetü'bnû Zübeyr şartın nikâh kıyılmadan önce yapıîmasiyle nikâhtan sonraya bırakılması arasında fark görmüş ve: «Eğer kadın nikâh edilmezden önce mehir veya ailesi için başka bir şey şart koşulmuşsa bunlar kadına verilir. Nikâhtan sonra ailesi için şart koşulan şeyler ailesinin olur.» demişlerdir. İmâm Mâlik'in dahi: «Eğer bu şart akd halinde yapılmışsa meşrut olan şey kadının; akd'den sonra yapılmışsa şartta bildirilen kimsenin olur.» dediği rivâyet edilir. İmâm Şafiî'nin eski mezhebi de budur. Kitâbus'sadâk'da ise «Bu mehir fâsitdir. Kadına mehri misil vermek icâb eder.» demişdir. Şâfiîyye ulemâsının sahîh olarak kabul ettikleri kavl budur. «Peygamber (sallallahü aleyhi ve sellem)'nin ashabından bazı ulemâ Hazret-i Ukbe hadîsi ile amel etmişlerdir. Ömerü'bnûl-Hattâb bunlardandır.» dedikden sonra sözüne şöyle devam etmiştir: «-Bir adam bir kadınla evlenir de onu bulunduğu şehirden çıkarmamayı şart koşarsa kadını şehirden çıkaramaz.» Ulemâdan bazılarının kavilleri budur. İmâm Şafiî. İmâm Ahmed ve İshâk dahi buna kâail olmuşlardır. Hazret-i Ali (radıyallahü anh): «Allah'ın şartı kadının şartından öncedir.» demiştir ki, bununla her nekadar şart bulunsa da kocası karısını yine bulunduğu şehirden çıkarabilir. Demek istediği sanılmaktadır. Süfyân-ı Sevrî ile bazı Küfe ulemâsının kavilleri de budur",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 73
			}
		}
	]
}