{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3497,
			"arabicnumber": "1365.03",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize ismail yâni ibni Uleyye, Abdülaziz'den, o da Enes'den naklen rivayet etti ki. Resulullah (Sailallahu Aleyhi've Sellem) Hayber gazasını yapmış. Enes demiş ki: Sabah namazını alaca karanlıkta Hayber'de kıldık. Müteakiben Peygamber (Sallallahu Aleyhi ve Sellem) ile Ebu Talha hayvanlarına bindiler. Ben Ebu Talha'nın terkisinde idim. Derken Nebiyyullah (Sallallahu Aleyhi ve. Sellem) hayvanını Hayber yoluna doğru sürdü. Benim dizim Nebiyyullâh (Sallallahu Aleyhi ve Sellem)'in uyluğuna dokunuyordu. Uyluğundan elbisesi açıldı. Ben Nebiyyullah (Sallallahu Aleyhi ve Sellem)'în uyluğunun beyazını iyiden iyiye gördüm. Şehre girdiği vakit : — «Allah her şeyden büyüktür. Hayber harabdır. Biz bir kavmin beldesine indik mi tehdid edilenlerin sabahı kötü olur, buyurdu. Bunu üç defa tekrarladı. Ahâli işlerine çıkmışlardı. (Bizi görünce) : — Vallahi Muhammed, dediler. Râvi Abdülâziz: «Arkadaşlarımızdan bâzıları da ordu ile Muhammed dediler.» şeklinde rivayet etmiştir. Enes (Radiyallalıu anh) (sözüne devamla) şunları söylemiş: «Hayber'i kahren aldık. Esirler toplandı, derken Dihye gelerek: Ya Resulallah! Bana esirlerden bir carîye ver, dedi. Resulullah (Sallallahu Aleyhi ve Sellem): — «Git bir carîye al!» buyurdu. O da Safiyye b. Huyeyy'i aldı. Bunun üzerine Nebiyyullah (Sallallahu Aleyhi ve Sellem)'e bir adam gelerek: — Yâ Nebiyyaüah! Dihye'ye Kurayza ile Nâdîr'in reisi Huyeyy'in kızı Safiyye'yi mi verdin? O ancak sana yaraşır; dedi. ResuIullah (Sallallahu Aleyhi ve Sellem): — «Onu Safiye iie birlikte çağırın!» buyurdu. Müteakiben Dihye Safiyye'yi getirdi. Nebi (Sallallahu Aleyhi ve Sellem) Safiyye'yi görünce : — «Sen esirlerden bundan başka bir cariye al! buyurdu. Ve Safiyye'yi âzad ederek onunla evlendi. Sâbit. Enes'e : Ey Ebu Hamza! Resulullah (Sallallahu Aleyhi ve Sellem) ona mehir olarak ne verdi? diye sormuş. Enes (Radiyallahu anh} şu cevâbı vermiş : — Safiyye'nin nefsini (verdi) onu azâd etti. Ve kendisi ile evlendi. Hattâ yolda giderken Safiyye'yi Resulullah (Sallallahu Aleyhi ve Sellem)'e (annem) Ünımü Süleym hazırladı ve geceleyin ona zifaf eyledi. Böylece Nebi (Sallallahu Aleyhi ve Sellem) damad olarak sabahladı. Sonra: — «Kimin yanında bir şey varsa onu getirsin!» buyurdu. Ve yere deriden bir yaygı serdi. Artık öteki kuru süt, beriki kuru hurma, kimisi yağ getiriyordu. Derken hurma karıştırması yaptılar. Bu da ResuluIIah (Sallallahu Aleyhi ve Sellem)'in düğün daveti oldu",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 99
			}
		}
	]
}