{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3503,
			"arabicnumber": "1428.02",
			"text": "Bize Muhammed b. Hatim b. Meyraun rivayet etti. (Dediki): Bize Behz rivayet etti. H. Bana Muhammed b. Rafi' de rivayet etti. (Dediki): Bize Ebu'n-Nadr Hâşim b. Kasım rivayet eyledi. Behz ile Hâşim ikisi birden demişlerki : Bize Süleyman b. Muğira, Sabit'ten, o da Enes'den naklen rivayet eyledi. Bu hadîs Behz'indir. (Demişki): Zeyneb'in iddeti bitince Resulullah (Sallallahu Aleyhi ve Sellem) Zeyd'e : «Onu bana iste!» buyurmuş. Zeyd gitmiş. Zeyneb'e vardığında onu hamurunu mayalarken bulmuş. Zeyd şöyle demiş: Zeyneb'i görünce kalbimde büyüdü. Hattâ Resulullah (Sallallahu Aleyhi ve Sellem) kendisini istedi diye yüzüne bile bakamadım da ona sırtımı çevirdim. Ve ters döndüm. Sonra : — Yâ Zeyneb! (Beni) Resulullah (Sallallahu Aleyhi ve Sellem) seni istemeye gönderdi, dedim. Zeyneb : — Rabbimden emir almadıkça ben bir şey yapamam, diyerek kalktı namazgahına gitti ve Kur'ân indi. Resulullah (Sallallahu Aleyhi ve Sellem) gelerek Zeyneb'in yanına izinsiz girdi. Vallahi öyle halimizi gördüm ki, Resulullah (Sallallahu Aleyhi ve Sellem) güneş yükseldiği zaman bîze ekmek ve et yedirdi. Müteakiben halk dışarı çıktı. Yemekten sonra evde birkaç kişi kalmış konuşuyorlardı. Derken Resulullah (Sallallahu Aleyhi ve Sellem) de çıktı. Ben kendisini takib ettim. Kadınlarının hücrelerini dolaşarak onlara selâm veriyor, onlar da kendisine : — Yâ Resulallah! Aileni nasıl buldun? diye soruyorlardı. Bilmiyorum cemâatin evden çıktıklarını ben mi ona haber verdim; yoksa o mu bana haber verdi. Bunun üzerine giderek eve girdi. Ben de onunla beraber girmek üzere gittim. Ama benimle kendi arasına perde çekti ve tesettür âyeti indi. Halka (bu âyetlerde) alabildiğine vaz edildi. ibni Râfi' kendi hadîsinde: «Allah hakkı söylemekten utanmaz» âyet-i kerîmesine kadar şu âyeti ziyade etti: «Nebiin hanelerine girmeyin! Meğerki size pişmesini beklememek şartıyla yemeğe kalmaya izin verilmiş ola.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 105
			}
		}
	]
}