{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3532,
			"arabicnumber": "1433.07",
			"text": "(Bize bu hadîsi Muhammed b. Abdillah b. Nümeyr de rivâyet etti. ki): Bize babam rivâyet eyledi. H. bu hadisi Muhammed b. El-Müsennâ dahi rivâyet etti. ki): Bize Yahya yani İbn Saîd rivâyet etti. Bunlar hep birden Ubeydûllah'dan bu isnadla yukarki hadisin mislini rivâyet etmişlerdir. Ubeydûllah'dan rivâyet ettiği hadîste: «Bize Kasım, Âişe'den rivâyet etti.» cümlesi vardır. hadîsi Buhârî «Kitabû'ş-Şehâdât» ile «Kitabû't-Talâk»da Tirmizî «Nikâh» bahsinde. Nesâî «Nikâh» ve «Talâk»da; İbn Mâce dahi «Nikâh» bahsinde muhtelif râvilerden tahric etmişlerdir. karası Temime binti Vehb'dir. ki Temime ikinci kocası Abdûrrahman'ı cimaa karşı gevşek bulmuş, onun metâmı elbisenin saçağına benzetmiştir. Asele'nin ismi tasgiri olup balçağız mânâsına gelir. Bu kelime cinsî münasebetten kinayedir. Yani cimanın lezzeti bala benzetilmiştir. dışardan işiten Hâlid b. Said , Hazret-i Ebû B'ekr'den sonra üçüncü veya dördüncü olarak İslâmiyeli kabul eden zâttır. Bazıları Ebû Bekr (radıyallahü anh) ile beraber müslüman olduğunu söylerler. Kadını sesinden tanıyarak açık saçık konuşmasını ayıplamış, onu susturması için Hazret-i Ebû Bekr’e müracaat etmiştir. umumundan anlaşıldığına göre Hazret-i Rifâa karısını üç defa boşamıştır. Bir rivâyette: «Derken İbn Zübeyr beraberinde başka kadından iki oğlu ile geldi. Kadın: Vallahi onun bir kabahatinden bir şikâyetim yok; ancak onun metâi bana şundan daha faydalı değildir, diyerek elbisesinden bir saçak teli kopardı. Bunun üzerine İbn Zübeyr: Yalan söyledi ya Resûlallah! Ben onu tabaklanmış deri silker gibi silkiyorum. Ama o itaatsizlik ediyor, Rifâa'yı istiyor, dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) kadına: «Eğer dediğin gibi ise İbn Zübeyr senin balcağızından tatmadikça Rifâa'ya helâl olamazsın yahut ona yaramazsın, buyurdular.» denilmektedir. babda Nesâî ile İbn Mâce Abdullah b. Ömer’den; Beyhakî , Hazret-i Enes'ten Taberâni , Hazret-i Âişeden hadîsler rivâyet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 134
			}
		}
	]
}