{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 359,
			"arabicnumber": "139.02",
			"text": "Bana Züheyr b. Harb ile îshak b. İbrahim de hep birden Ebu'l-Velid'den rivayet ettiler. Züheyr dedi ki: Bize Hişam b. Abdilmelik rivayet etti. (Dedi kî): Bize Ebu Avane, Abdülmelik b. Umeyr'den, o da Alkametü'bnü Vaîl'den, o da Vail b, Hucr'dan naklen rivayet etti. Demiş ki: Resulullah (Sallallahu aleyhi ve Sellemi'in huzurunda idim. Yanına bir arazi hakkında birbirinden davacı olan iki adam geldi. Onlardan biri: Ey Allah'ın Resulü, bu adam cahiliye döneminde bana ait olan bir arazimi gasp etmişti, dedi. -Bu kişi İmriu'I-Kays b. Abis el-Kind! idi. Davacı olduğu kişi de Rabia b. İbdan'dı.- Resulullah (Sallallahu aleyhi ve Sellem): \"Beyyinen var mı\" buyurdu. O: Beyyinem yok dedi. Allah Resulü: \"O halde o yemin edecek\" buyurdu. İmriu'I-Kays: O zaman arazimi alır gider dedi. Allah Resulü (Sallallahu aleyhi ve Sellem): \"Senin bundan başka bir hakkın yok\" buyurdu. (Vail) dedi ki: Hasmı yemin etmek üzere kalkınca Resulullah (Sallallahu aleyhi ve Sellem): \"Her kim haksızca bir araziyi kesip alırsa, Allah'ın huzuruna O kendisine gazap etmiş olduğu halde çıkar\" buyurdu. İshak rivayetinde (Rabia b. İbdan yerine) Rabia b. Aydan demiştir. Diğer tahric: Ebu Davud, 3245, 3623; Tirmizi, 1340; Tuhfetu'l-Eşraf, 11768 DAVUDOĞLU ŞERHİ İÇİN burayı tıklayın NEVEVİ ŞERHİ (351-357 numaralı hadisler): Bu babta (351) Nebi (Sallallahu aleyhi ve Sellemi'in: \"Her kim yeminiyle Müslüman bir kimsenin hakkını kesip alırsa, .. isterse erak ağacından bir çubuk olsun\" buyurmaktadır. Diğer rivayette (353) (2/157) \"Her kim ... sabr yemini ederse ... Allah'ın huzuruna çıkar.\" (353) Diğer rivayetinde: \"el-Eş'as b. Kays'tan rivayete göre benimle bir başka adam arasında ... huzuruna Çıkar\" denilmekte; öbür rivayette (356) (2/158): \"Hadramevt'ten bir adam ve Kinde' den bir adam ... geldi. .. huzuruna çıkacaktır.\" denilmektedir. Babta Geçen İsimler ve Lafızlar Babta geçen isim ve lafızlara gelince (351) \"el-Huraka'nın azatlısı\" elHuraka, Cuheyne' den bir koldur. Daha önce birkaç defa açıklanmıştı. Aynı hadiste geçen Mabed b. Ka'b es-Selemi Ensar'dan Selime oğullarına mensuptur. Onlara nispet yapıldığı takdirde Arap dilbilginleri arasında ve diğerlerine göre meşhur olduğu üzere lam harfi fethalı olarak nispet yapılır. Nispet yapılırken lam harfinin de kesreli söylenmesinin caiz olduğu da söylenmiştir. Aynı hadiste Abdullah b. Ka'b b. Ebu Umame el-Harisı de vardır. Diğer rivayette ise: \"Abdullah b. Ka'b'ı tahdis ederken dinledim: Ebu Umame elHarisı kendisine tahdis etti\" denilmektedir. Şunu bilelim ki burada zikredilen Ebu Umame meşhur Ebu Umame el-Bahill Suday b. Aclan değildir. Bu ondan başkasıdır. Bunun adı Iyas b. Salebe el-Ensari el-Harisı olup el-Haris b. el-Hazrec oğullarındandır. Onun Belevi (Belli oğullarından) olup, Harise oğullarıyla antlaşmalı olduğu da söylenir. Kendisi Ebu Burde b. Niyar'ın kızkardeşinin oğludur. İsmi ile ilgili meşhur olan budur. Ebu Hatim er-Razi dedi ki: Adı Abdullah b. Salebe'dir. Salebe b. Abdullah olduğu da söylenir. Yine şunu bilmeli ki, burada mutlaka dikkat çekilmesi gereken bir incelik vardır. O da şudur: Ashab (radıyallShu an hum) isimlerine dair eser yazanların birçoğu burada geçen Ebu Umame el-Harisı (radıyallShu anh)'ın Uhud dönüşünde vefat edip, Nebi (sallallShu aleyhi ve sellem)'in de cenaze namazını kıldırdığını söylemişlerdir. Bu tarihin gereği olarak Müslim'in rivayet ettiği bu hadis munkatı olur; çünkü Abdullah b. Ka'b tabiindendir. Hicretin üçüncü yılında Uhud gazasının cereyan ettiği senede vefat etmiş birisinden nasıl hadis dinlemiş olabilir? Fakat Ebu Umame'nin vefatı hakkındaki bu nakil sahih değildir çünkü Abdullah b. Ka'b'dan Müslim'in ikinci rivayette zikrettiği gibi: \"Bana Ebu Umame tahdis etti\" dediği sahih olarak sabittir. İşte bu tabiinden olan Abdullah b. Ka'b'ın ondan hadis dinlediğine dair açık bir ifadedir. Böylelikle onun vefatı ile ilgili söylenen sözler de batıl olur. Şayet onun vefatı ile ilgili söylenen o tarih sahih olsaydı Müslim onun hadisini tahriç etmezdi. Gerçekten de İbnu'l-Esir diye tanınan İmam Ebu'l-Berekat el-Cezeri \"Marifetu'sSahabe\" adlı eserinde vefatı ile ilgili bu görüşü reddederken çok güzel bir iş yapmıştır. Allah en iyi bilendir. Hadisteki: \"İsterse erak ağacından bir çubuk olsun\" ibaresindeki \"çubuk\" anlamındaki (~) lafzı bazı asıl nüshalarda ya da çoğunluğunda bu şekildedir. Birçoğunda ise (~) şekilde hazfedilmiş \"kane\"nin haberi olarak elifli gelmiştir yahut \"isterse bir çubuk kesmiş olsun\" anlamında takdiri yapılan hazfedilmiş bir fiilin mefulü de olabilir. \"Sabr yemini\" ibaresinde yemin sabra izafe edilmiştir. Sabr yemini ise yemin edenin o yemini yapmak üzere kendisini tutan, alıkoyan kimsenin yaptığı yemindir. Buna dair açıklama insanın kendi kendisini öldürmenin ağır haram olduğu babında geçmiş idi. Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Her kim yalan yere bir sabr yemini ederse\" ibaresi kasten yalan yemin ederse demektir. Bu yemine ğamus yemini adı verilir. (354) Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Senin iki şahidin yahut onun yemini\" buyruğu şu demektir: Senin getireceğin iki şahidin yapacağı şahitlik yahut onun yeminini istemek hakkın vardır. Yine bu babta (357) Müslim'in: Bana Zuheyr b. Harb ve İshak b. İbrahim hep birlikte Ebu'l-Velid'den tahdis etti. Zuheyr dedi ki: \"Bize Hişam b. Abdulmelik tahdis etti.\" Burada zikredilen Hişam, Ebu'l-Velid'in kendisidir. Aynı hadiste \"cahiliye döneminde haksızca arazimi almıştı\" yani oraya galip gelip, istila etmişti. Cahiliye dönemi ise nübüwetten önceki dönemdir. Cehaletlerinin çokluğundan ötürü bu isim verilmiştir. Aynı hadiste geçen \"İmriu'l-Kays b. Abis ve Rabia b. Aydan (hadisin metninde İbdan)\"e gelince, Aydan ismini -Müslim'in zikrettiği üzere- Zuheyr ve İshak tespit etmekte ihtilaf etmişlerdir. Kadı lyaz ise bu isimle ilgili görüşleri ve ravilerin ihtilaflarını zikrederek şunları söylemiştir: Bu isim fethalı ayn ve alttan iki noktalı ye iledir (Aydan). İşte doğrusu budur. İshak'ın rivayetinde de böyledir. Zuheyr'in rivayetinde ise ayn harfi kesreli ve tek noktalı be ile \"İbdan\" şeklindedir. Kadı İyaz: Biz bu ismibu iki şekilde hocalarımlZdan böylece zaptetmiş bulunmaktayız. Ancak İbnu'l-Hazza' da bizim zaptımlZın aksi sabittir. Zuheyr'in rivayetinde ayn harfi fethalı ve iki noktalı ye ile (Aydan şeklinde), İshak'ın rivayetinde ise ayn harfi kesreli ve tek noktalı be ile (İbdan olarak) sabittir. el-Ceyyani dedi ki: el-Culudi' den nakledilen asılda da bu şekildedir. Kadı dedi ki: Bizim ilk olarak doğru olduğunu söylediğimiz Darakutni, Abdulgani b. Said ve Ebu Nasr b. Makula'nın görüşüdür. İbn Yunus da et-Tarih'te böyle demiştir. Kadı İyaz'ın açıklamaları bunlardır. Aralarında HaflZ Ebu'l-Kasım b. Asakir ed-Dimeşki'nin de bulunduğu bir grup hafız bunu \"İbdan\" şeklinde ayn harfi kesreli, be ve şeddeli dal ile zaptetmişlerdir. Allah en iyi bilendir. Bu Babtaki Hadislerin İhtiva Ettiği Hükümler: Nebi (Sallallahu aleyhi ve Sellem)'in (351): \"Kim yeminiyle haksızca Müslüman bir kimsenin hakkını alırsa\" buyruğunda bir incelik vardır. Bu da \"Müslüman kimsenin hakkı\" ifadesindedir ki, bunun kapsamına maldan başka meyte hayvanın derisi, gübre ve bunun dışında kendilerinden yararlanılan necasetler de girer. Aynı şekilde kazf haddi, zevcenin kocası tarafından kendisine gün payedilmesi ve bunun dışında malolmayan diğer hakları da kapsar. Yine Resulullah (Sallallahu aleyhi ve Sellem)'in (351): \"Yüce Allah ona cehennemi vacip kılar, cenneti de ona haram eder.\" Bunun hakkında da benzerleri için daha önce tekrar edilen iki cevap sözkonusudur. Birincisi bunun böyle bir işi helal kabul eden kişi hakkında yorumlanacağıdır. Bu hali üzere ölecek olursa o kafir olur ve cehennemde ebedi kalır. İkincisine göre anlamı böyle bir kişi cehennem ateşini hak etmiş olur ama affedilmesi de caizdir. (2/161) Yüce Allah ayrıca ona ateşten kurtulup, umdukları cennet nimetlerine nail olan kimselerle birlikte ilk anda cennete girmesi ona haram edilmiştir. Haksızlığa uğrayan kimse için Resulullah (Sallallahu aleyhi ve Sellem)'in \"Müslüman\" kaydını getirmesi zimminin hakkının haram olmadığının delili değildir. Bu yüce Allah'ın huzuruna kendisine gazap etmiş olarak çıkacağı şeklindeki ağır tehdidin müslümanın hakkını haksızca alan kimse için sözkonusu olduğu anlamındadır. Zimminin hakkını almak ise haramdır fakat bundan dolayı sözü geçen bu iki büyük cezanın verilmesi gerekli değildir. Bütün bu açıklamalar \"mefhumun delaleti\"ni kabul edenlerin görüşüne göredir. Bunu kabul etmeyenlerin ise ayrıca tevile ihtiyaçları yoktur. Kadı İyaz (rahimehullah) dedi ki: Özelolarak müslümanın sözkonusu edilmesi muhatapların ve şeriata göre hareket edenlerin genellikle kendilerinin olmasından dolayıdır yoksa Müslüman olmayanların hükmü bunun hilafına olduğu için değildir. Aksine Müslüman olmayanın hükmü de bu hususta aynıdır. Allah en iyi bilendir. Ayrıca bu ceza müslümanın hakkını alıp, tövbe etmeden önce ölen kimse hakkında sözkonusudur. Tövbe edip, yaptığına pişman olarak hakkını sahibine geri veren, ondan helallik dileyen ve bir daha böyle bir iş yapmamaya kesin karar veren kimseden ise günahı düşmüş olur. Allah en iyi bilendir. Ayrıca bu hadiste -Ebu Hanife (rahimehullah)'ın içtihadına muhalif olan fakat Malik, Şafii, Ahmed ve çoğunluğun kanaati olan hakimin hükmü kişiye kendisine ait olmayan bir hakkı mubah kılmaz, şeklindeki görüşün lehine bir delalet bulunmaktadır. Hadiste ayrıca: 1- Müslümanların haklarını çiğnemek büyük bir haramdır. 2- Çiğnenen hakkın az ya da çok olması arasında fark yoktur çünkü Nebi (Sallallahu aleyhi ve Sellem): \"İsterse erak ağacından bir çubuk olsun\" buyurmuştur. Resulullah (Sallallahu aleyhi ve Sellem)'in \"yalan söylediği halde kim bir yemin ederse\" buyruğunda \"yalan söylemek\" kaydı zorunludur. Haksız olduğunu bilerek ve kasten böyle bir yemin yapmadıkça günahkar olmaz. Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Yüce Allah kendisine gazap ederek onun huzuruna çıkar.\" Diğer rivayette (356) ise: \"Ondan yüz çevirmiş olduğu halde\" buyurulmaktadır. İlim adamları der ki: Yüce Allah'ın yüz çevirmesi, gazabı, öfkesi, onun kendisine gazap edilen kimseyi rahmetinden uzaklaştırmayı, onu azaplandırmayı, yaptığı fiili reddedip yermeyi dilemesi, irade etmesi demektir, demişlerdir. Allah en iyi bilendir. el-Hadramı ve el-Kindı ile ilgili hadise gelince (356, 357) çeşitli bilgiler bulunmaktadır: 1- Zilyed (yani bir malı elinde bulunduran kişi) o malın kendisinin olduğunu iddia eden yabancı bir kimseye göre öncelikli hak sahibidir. 2- Davalı (üzerindeki hakkı) ikrar etmiyorsa yemin etmek zorundadır. 3- Beyyine (iki şahidin şehadeti) zilyedliğe göre önceliklidir ve yemine gerek olmaksızın beyyine sahibi lehine hüküm verilir. 4- Davalı olan günahkar kimsenin yemini, tıpkı adaletli kimsenin yemini gibi kabul edilir ve bu yemini sebebiyle ondan hak istemek sakıt olur. 5- Davacılardan birisi diğerine o bir zalimdir yahut bir facirdir ve buna benzer nitelemeleri davalaşma esnasında dile getirecek olursa (2/162) bu sözlerine katlanılır. 6- Mirasçı bir kimse kendisine miras bırakan kimseye ait olan bir şeyi iddia edecek olursa, hakim de ona miras bırakan kimsenin ölüp de bu davacı dışında bir mirasçısının olduğunu bilmiyorsa, buna dayanarak onun lehine hüküm vermesi caiz olur ve dava halinde buna dair ayrıca beyyine getirmekle onu yükümlü tutmaz. Bu hükmün delili davacının \"bana galip gelerek babama ait olan bir araziyi aldı\" demiş olmasıdır. O bu sözleriyle bu arazinin babasına ait olduğunu ikrar etmiş oldu. Eğer Nebi (Sallallahu aleyhi ve Sellem) onun o araziye tek başına mirasçı olduğunu bilmemiş olsaydı, kendisinin mirasçı olduğuna dair bir beyyine getirmesini isterdi. Bundan sonra da kendisinden bu davasında davalısı aleyhine hak sahibi olduğuna dair ikinci bir beyyine daha isterdi. Bir kimse: Nebi (Sallallahu aleyhi ve Sellem)'in: \"Senin iki şahidin\" ifadesi onun hak ettiği şeyi senden haksızca aldığına dair iki şahit getir, demektir. Bu da iki şahidin bu kişinin tek başına mirasçı olup, bu evi miras aldığına dair şahadet etmeleriyle olur diyecek olursa ona: Bu iddia zahirden anlaşılana aykırıdır. Bununla birlikte böyle bir şeyin kastedilmiş olması da mümkündür diye cevap verilir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 266
			}
		}
	]
}