{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"17": "The Book of Suckling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3612,
			"arabicnumber": "1456.05",
			"text": "Bana (yine) Yahya b. Habîb rivâyet etti. ki): Bîze Hâlid yani İbn'l-Hâris rivâyet etti. ki): Bize Saîd, Katâde'den bu isnâdla bu hadîsin benzerini rivâyet etti. birçok nüshalarında bu hadisin üçüncü rivâyetinde Ebû'l-Halil ile Hazret-i Ebû Saîd-i Hudrî- arasında Ebû Alkame zikredilmemiştir. Yalnız İbn'l-Hazzâ' nüshasında arada Ebû Alkame vardır. Bu sebeple Gassâni: «Doğrusunun hangisi olduğunu bilmiyorum» demiştir. Kâdi Iyâz, Gassâni'den başkalarının: «Doğrusu Ebû Alkame'yi zikretmektir» dediklerini söylemektedir. İmâm Nevevî'ye göre ise her iki rivâyetin doğru olması muhtemeldir. Çünkü Ebû’l-Halîl’ın hadîsi iki vecihle işitmiş olması ve işittiği şekillerde rivâyet etmesi mümkündür. Tâifde bir yerin ismidir. Hadîsin rivâyetlerinden de anlaşılacağı vecihle bu yerde müslümanlarla müşrikler arasında harb olmuş; neticede müslümanlar gâlib gelerek birçok esirler almışlardır. Ancak alınan kadınların kocaları olduğunu düşünen bâzı ashâb günah olur endişesi ile onlara yakınlık etmekten çekinmişlerdir. Zira evli bir kadın, kocasından başka kimseye helâl olmaz. Bunun üzerine âyet inerek esîr alınan evli kadınların, istibrâ yapılmak şartı ile müslümanlara helâl oldukları bildirilmiştir. Kerîme'deki «muhsane»lerden murâd, evli kadınlardır. İddetten maksad da istibrâdir. Kadının hâmile ise doğurması, değilse cima' olunmadan bir hayız müddeti beklemesidir. aslı olan ihsan kelimesi gerek lügatte gerekse Kur'ân-ı Kerîm'de: İslâm, hürriyyet, evlenmek ve iffet mânâlarında kullanılmıştır. Bu mânâlar muvacehesinde âyet-i kerîmedeki «muhsaneler»den murâd ne olduğunu anlamak Âlûsî'nin dediği gibi müşkildir. Hattâ Mücâhid: âyeti kimin tefsir ettiğini bilsem ona deve ile giderdim.» demiştir, İbn Ebî Şeybe'nin Ebû's-Sevdâ'dan tahrîc ettiği bir rivâyette Ebû's- Sevdâ'nın: bu âyetin mânâsını sordum da: bilmiyorum; cevâbını verdi.» dediği bildiriliyor. Âlûsi'nin beyânına göre bu âyet hakkında mütekaddimîn ulemâdan dört kavil rivâyet olunmuştur:",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 45
			}
		}
	]
}