{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"17": "The Book of Suckling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3620,
			"arabicnumber": "1459.04",
			"text": "(Bana Harmeletübnü Yahya rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus haber verdi. H. Abd b. Humeyd de rivâyet etti. ki): Bize Abdürrezzak haber verdi. ki): Bize Ma'mer ile İbnü Cüreyc haber verdiler. râvilerin' hepsi Zührî'den bu isnâdla yukarıkilerin hadîsi mânasında rivâyette bulunmuşlardır. Yûnus hadîsinde: «Mücezziz kâif idi» ziyâdesi vardır. hadîsi Buhârî «Ferâiz» bahsinde; Ebû Dâvûd ile Nesâî «Talâk»da; Tirmizî «Velâ'»da tahrîc etmişlerdir. Kıyafet ve eserden anlayan demektir. Fukaha bu kelimeyi benzerliği bilen, eserleri birbirinden ayıran kimse mânâsında kullanmışlardır. devrinde Araplar Hazret-i Üsame'nin nesebine ta'n ederlerdi. Çünkü babası Zeyd (radıyallahü anh) beyaz tenli olduğu halde Üsâme son derece siyah idi. Renk itibariyle o babasına değil, annesi Ümmü Eymen'e benziyordu. İşte kâif Hazret-i Zeyd ile Üsâme'nin baba-oğul olduklarım söylemekle âdeta ta'n edenlere cevap vermiş, onları susturmuş olduğu için Resûlüllah (sallallahü aleyhi ve sellem) buna sevinmiştir. Çünkü Araplar kâiflerin sözüne inanırlardı. Müceziz b. A'ver , Benî Müdlic kabilesine mensub bir sahâbîdir. Mısır’ın fethine iştirak ettiği söylenir. Araplar Benî Müdlic ile Benî Esed kabilelerinin kıyafet ilmindeki maharetlerini i'tirâf ederlerdi. Maamafih bu san'at onlara mahsus değildi. Kureyş kabilesine mensûb olan Hazret-i Ömer'in de kıyafet ilmini bildiği rivâyet edilmiştir. asıl mânâsı «Görmedin mi?» demek ise de burada ondan murâd bir şeyi haber vermek veya bildirmek olduğu için biz onu «Baksan a!» diye terceme ettik. şerîf kâifin sözü ile bir hüküm isbât edilebileceğine delildir. Ashâb-ı kirâmdan Enes b. Mâlik ile esah rivâyete göre Ömer (radıyallahü anhûma)’nın kavilleri budur. Cumhûr-u ulemâ ile Atâ' , Evzâî, Leys, İmâm Şafiî, İmâm Ahmed ve Ebû Sevr'in mezhepleri de budur. İmâm Mâlik'den meşhur olan rivâyete göre cariyeler hakkında kâifin sözü delil ise de, hür kadınlar hakkında delil olamaz. Bir rivâyette o da cumhûrla beraberdir. ulemâsı ile İshâk . Sevri ve Hanefî'ler kıyafetle verile» hükmün bâtıl olduğuna kaildirler. Çünkü bu bir zan ve tahminden ibarettir: şerîatte onunla amel câız değildir, hadîsinde kıyafetle hüküm İsbât ediîdiğne delil yoktur. Zira Üsâme (radıyallahü anh)’ın daha önceden nesebi sabit bulunuyordu. Resûlüllah (sallallahü aleyhi ve sellem) de kâifin sözü ile istidlal etmiş değil, sadece Mücezziz'in hakka isabetine şaşmıştır. Bununla hüküm vâcib olmaz. ameli caiz görenlerce kâifin âdil, tecrübeli ve anlayışlı olması şarttır. Aded meselesinde ihtilâf etmişlerdi:. Şâfiîlerin esah kavline göre bir kâifin sözü ile amel olunur. İmâm Mâlik ile bâzı Şâfiîler kâifin iki olmasını şart koşmuşlardır. kavli ile ancak iki muhterem cimâ'dan doğan çocuk hakkında amel edilir. Meselâ; bir kimse cariyesi ile cinsî münasebette bulunduktan sonra onu satar; müşteri de istibrâ yapmadan cimâ'da bulunur da câriye müşterinin cimâ'mdan altı ay sonra, sahibinin cimâ'mdan ise dört sene geçmeden doğurursa çocuğun nesebi hakkında kâife müracaat edilir. Kâif çocuğun nesebini hangisine ilhak ederse çocuk onun olur. Hiç birine ilhak edemez ve çocuğun bunların ikisinden de olmadığını söylerse, çocuk büyüyünceye kadar bırakılır. O zaman hangisine meyl ederse ona verilir. Şayet kâif çocuğu ikisine birden ilhak ederse Hazret-i Ömer (radıyallahü anh) ile İmâm Şafiî ve Mâlik'e göre çocuk yine büyüyünceye kadar bırakılır; sonra hangisine meyi ederse ona verilir. Ebû Sevr ile Suhnun'a göre çocuk ikisinin müşterek evlâdı olur. Mâlikîler'den Maceşû ile Muhammed b. Mesleme çocuğun daha fazla kime benzerse ona verileceğine kail olmuşlardır. delil kabul etmeyenler arasında dahi münâzealı çocuk hakkında ihtilâf vardır. îrnam A'zam'a göre münâzea edenler erkek olsun kadın olsun çocuğun nesebi her ikisine müştereken ilhak olunur. İmâm Ebû Yûsuf'la İmâm Muhammed münâzea edenlerin kadın oldukları takdirde çocuğun onlardan yalnız birine ilhak edilebileceğine; İshâk ise aralarında kur'a çekileceğine kail olmuşlardır",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 53
			}
		}
	]
}