{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"18": "The Book of Divorce "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3652,
			"arabicnumber": "1471.01",
			"text": "(Bize Muhammet) b. Râfi' rivâyet etti. ki): Bize Abdürrezzâk rivâyet etti. ki): Bize Ma'mer, Hemmam b. Münebbih'den naklen haber verdi. Hemmam: Bize Ebû Hüreyre'nin Resûlüllah (sallallahü aleyhi ve sellem)’den rivâyeti budur, diyerek bir takım hadîsler zikretmiştir. Onlardan biri de şudur: (sallallahü aleyhi ve sellem): Benî İsrail olmasa idi yemek bozulmayacak, et de kokmayacaktı. Havva olmasa hiç bir kadın ebediyyen kocasına hıyanet etmezdi.» buyurdular. hadîsi Buhârî «Ehâdîsü'l-Enbiyâ» bahsinde tahrîc etmiştir. beyânına göre Hazret-i Havva' hadîsinden murâd: Cennette Âdem (aleyhisselâm)'ı memnu' olan ağaçtan yemeğe da'vet etmesidir. Bu suretle Havva' (aleyhisselâm) kocasının hatasına sebep olmuş; sair kadınların kocalarına hıyanetleri de ondan kalmıştır. Hazret-i Havvâ'ya neden bu isim verildiği ve nerede yaratıldığı ulemâ arasında ihtilaflıdır. İbn Abbâs (radıyallahü anh)'ya göre Hazret-i Havvâ' her canlının anası olduğu için kendisine bu isim verilmiştir. Bazıları canlı olan Hazret-i Âdem'den yaratıldığı için kendisine Havva' denildiğini söylerler. Her iki kavle göre de kelimenin dirilik mânâsına gelen (hayât) dan alındığına işaret vardır. (aleyhisselâm) bâzılarına göre Hazret-i Âdem cennete girmezden evvel yaratılmıştır. Cennette yaratıldığını söyleyenler de vardır. cennetteki memnu' ağacın buğday olduğunu söylemiştir. Bir takımları bunun incir, daha başkaları kâfur hattâ üzüm olduğunu bildirmişlerdir. «Bu ağaç huld ağacı idi; meyvesinden melekler yerdi.» diyenler bile olmuştur. İsrail meselesine gelince: Onlara her gün sabahtan akşama kadar gökten bıldırcın kuşu ve kudret helvası yağardı. Kendilerine verilen emir mucibince bunlardan yalnız günlük ihtiyaçlarını alır, cuma ile cumartesi günlerinin nafakasını da biriktirirlerdi; fazla bir şey biriktirirlerse bozulur, kokardı. İşte yiyeceklerin bozulup kokması bundan kalmıştır. Bu rivâyet Katâde'den nakledilmiştir. Nuaym «El-Hılye» nâm eserinde Vehb b. Münebbih'den şunları nakleder: «Bâzı kitaplarda Allahü teâlâ'nın şöyle buyurduğunu gördüm: Eğer ölenin çürüyüp bitmesine hüküm etmese idim onu ailesi evlerinde hapsederler; yiyeceğe bozulmayı takdir etmesem onu da zenginler fakirlerden gizlerlerdi.»",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 1
			}
		}
	]
}