{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 367,
			"arabicnumber": "143.01",
			"text": "Bize Ebu Bekr b. Ebi Şeybe tahdis etti. Bize Ebu Muaviye ve Veki' tahdis etti (H). Bunu bize Ebu Kureyb de tahdis etti. Bize Ebu Muaviye, A'meş'ten tahdis etti. O Zeyd b. Vehb'den, o Huzeyfe'den (şöyle dediğini) nakletti: Bize Resulullah (Sallallahu aleyhi ve Sellem) iki hadis söyledi. Bunlardan birisini (gerçekleştiğini) gördüm, diğerini de beklemekteyim. Bize: \"Emanetin adamların kalplerinin köküne indiğini, sonra da Kur'an'ın indiğini, onların Kur'an'dan ve sünnetten bir şeyler öğrendiklerini\" söyledi. Sonra bize emanetin kaldırılacağını anlatarak şöyle buyurdu: \"Kişi uykuya dalar ve emanet de kalbinden alınıverir, onun etkisi kabarcık gibi kalır, sonra yine uyur, emanet kalbinden alınır, onun etkisi ayağının üzerine bir kor yuvarlanıp da bir kabarcık hasılolup, sen de onu içinde bir şey bulunmadığı halde kabarmış olarak gördüğün gibi bir kabarcık benzeri bir izi kalır. -Sonra da bir çakıl taşı alıp, onu ayağının üzerine yuvarladl.- İnsanlar birbiriyle alışveriş yapacaklar, hemen hemen emaneti eksiksiz yerine getiren hiç kimse kalmaz. Öyle ki: Filan oğulları arasında güvenilir bir adam var, denilecek hale gelinir, hatta kalbinde iman adına bir hardal tanesi ağırlığınca hiçbir şey bulunmayan kişi hakkında: Ne sağlam ve gayretli, ne zarif, ne akıllı adam denilir. \" Andalsun ben öyle bir zaman geçirdim ki, hanginizle alışveriş yaptığıma aldırmazdım. Eğer (alışveriş yaptığım) kişi Müslüman birisi ise onun dini(ne bağlılığı dolayısıyla) bana (varsa hakkımı) geri çevirirdi. Şayet hristiyan ya da Yahudi ise onun amiri (ondaki hakkımı) bana geri verirdi ama bugün aranızdan ancak filan ve filan kişi ile alışveriş yapabilirim. Diğer tahric: Buhari, 6497, 7086, 7276'da muhtasar olarak; Tirmizi, 2179; İbn Mace, 4053; Tuhfetu'lEşraf, 3328",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 274
			}
		}
	]
}