{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"18": "The Book of Divorce "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3690,
			"arabicnumber": "1478",
			"text": "(Bize Züheyr b. Harb rivâyet etti. ki): Bize Ravh b. Ubâde rivâyet etti. ki): Bize Zekeriyyâ b. İshâk rivâyet etti. ki): Bize Ebû'z-Zübeyr, Câbir b. Abdillâh'dan naklen rivâyette bulundu. Câbir Şöyle dedi: Bekr, Resûlüllah (sallallahü aleyhi ve sellem)'in yanına girmek için izin istemeye girdi; fakat birçok kimseleri kapıda otururlarken buldu. Bunların hiç birine izin verilmemişti. Müteakiben Ebû Bekr'e izin verilerek içeri girdi. Sonra Ömer gelerek izin istedi. Ona da izin verildi. Ömer Peygamber (sallallahü aleyhi ve sellem)'i, etrafında kadınları olduğu halde kederli kederli susmuş otururken bulmuş. Bunun üzerine (kendi kendine): Mutlaka bir şey söyleyip Peygamber (sallallahü aleyhi ve sellem)'i güldürmeliyim; diyerek şunu söylemiş: Yâ Resûlallah! Hârice'nin kızmı bir görseydin! Benden nafaka istedi, Ben de kalktım onun boğazını sıktım. üzerine Resûlüllah (sallallahü aleyhi ve sellem) gülmüş; ve: da etrafımda gördüğün gibi, benden nafaka istiyorlar.» buyurmuş. Ebû Bekr Âişe'nin boğazını, Ömer de Hafsa'nın boğazmı sıkmağa kalkmışlar. İkisi de: Siz Resûlüllah (sallallahü aleyhi ve sellem)'den onda olmayan bir şeyi istiyorsunuz ha? diyorlarmış. Âişe ile Hafsa: Vallahi Resûlüllah (sallallahü aleyhi ve sellem)'âe olmayan bir şeyi ebediyyen istemiyeceğiz; demişler. Sonra Peygamber (sallallahü aleyhi ve sellem) onlardan bir ay yahud yirmi dokuz gün uzaklaştı. Bilâhare kendisine şu âyet indi: Peygamber! Zevcelerine söyle...» âyet tâ: sizlerin İyi hareketlerde bulunanlarınıza pek büyük ecir hazırladı...» kavl-i kerîmine kadar varıyordu. üzerine Peygamber (sallallahü aleyhi ve sellem) Âişe'den başlıyarak: Âişe, ben sana bir şey arzetmek isterim; (ama) ebeveyninle istişare etmeden cevap hususunda acele etmemeni dilerim.» demiş. Âişe: Nedir o yâ Resûlallah? diye sormuş. O da kendisine bu âyeti okumuş. Âişe: Ebeveynimle senin hakkında mı istişare edecekmişim yâ Resûlallah! Hayır, ben Allah ile Resûlünü ve dar-ı âhireti iltizâm ederim. Ama benim bu söylediğimi kadınlarından hiç birine haber vermemeni isterim; demiş. Resûlüllah (sallallahü aleyhi ve sellem): biri bana sormaya görsün; hemen kendisine haber veririm. Çünkü Allah beni zorlaştırıcı ve şaşırtıcı değil, lâkin öğretici ve kolaylaştırıcı olarak gönderdi.» buyurmuşlar. Konuşamayacak derecede kederli demektir. Zorlaştırıcı; insanlara meşakkatli işleri yaptıran; mütean-nit de, hatâ etmelerim isteyendir. şerîf mânâ itibariyle Bâbımızın ilk rivâyeti gibidir. Fazla olarak bu rivâyet insanın arkadaş veya dostunu kederli gördüğü zaman onun gönlünü alacak, güldürüp meşgul edecek sözler söylemesinin müstehab olduğuna, Hazret-i Ebû Bekr'le Ömer (radıyallahü anh)'ın faziletlerine delildir",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 39
			}
		}
	]
}