{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"18": "The Book of Divorce "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3697,
			"arabicnumber": "1480.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlik'e, Esved b. Süfyan’ın âzadlısı Abdullah b. Yezîd'den dinlediğim, onun da Ebû Seleme b. Abdirrahman'dan, o da Fâtime binti Kays'dan naklen rivâyet ettiği şu hadîsi okudum: Amr b. Hafs Fatıme'yi gıyaben talâkı hâinle boşamış da vekili ona arpa göndermiş. Fâtıme buna razı olmamış. Fakat Ebû Amr'ın vekili; Vallahi seni bizde bir hakkın yoktur; demiş. Bunun üzerine Fâtıme, Resûlüllah (sallallahü aleyhi ve sellem)'e gelerek bu meseleyi ona anlatmış. Peygamber (sallallahü aleyhi ve sellem): onda nafaka hakkın yoktur.» buyurmuş ve iddetini Ümmü Şerîk'in evinde geçirmesini emretmiş. Sonra: Şerik ashabının daima ziyaretine gittikleri bir kadındır. Sen İbn Ummi Mektûm'un yanında iddet bekle, çünkü o a'mâ bir adamdır. (Yanında) çarşafını atabilirsin! (Nikâh için) helâl olduğun zaman bana bildir!» buyurmuşlar. Fâtıme şunları söylemiş: (Nikâha) helâl olduğum vakit kendilerine, Muâviye b. Ebî Süfyân ile Ebû Cehm'in beni istediklerini söyledim. Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular: Cehm sopasını boynundan bırakmaz; Muâviye'ye gelince; o da yoksuldur; hiç malı yoktur. Sen Üsâme b. Zeyd İle evlen!» Ben buna razı olmadım. Sonra (tekrar): Usame b. Zeyd ile evlen!» buyurdular. Bunun üzerine onunla evlendim. Allah onda hayır halketti; ben de gıbta ettim! hadîsin bazı rivâyetlerini Buhârî, Ebû Dâvûd ve Nesâî «Talâk» bahsinde tahrîc etmişlerdir. diyor ki: «Kocasının Fâtime'yi üç talâkla mı yoksa talâk-ı bâinle veya üç talâkın sonuncusu ile mi boşadığı hususunda lâfızları muhtelif olmakla beraber hafızların rivâyet ettiği ve mu'temed râvilerin ittifak halinde bulundukları sahih ve meşhur olan hadîs budur.» binti Kays hadîsini Tahâvî on altı sahih tarîkten rivâyet etmiştir. Fâtıme (radıyallahü anh) Dahhâk b. Kays’ın kız kardeşidir. Ondan on yaş büyük olduğu söylenir. Kendisi ilk muhacirlerdendir. Güzelliği, aklı, kemali ve asaleti meşhurdur. Hazret-i Ömer şehîd edildiği zaman ashâb-ı şûra onun evinde toplanmıştı. (radıyallahü anh) Ebû Amr b. Hafs ile evlenmişti. Bu zâtın ismi ihtilaflıdır. Ekser-i ulemâya göre Abdülhamid'dir. Nesâî, Ahmed olduğunu söylemiş; Bazıları isminin künyesinden ibaret olduğunu iddia etmişlerdir. bâzısında Hazret-i Fâtıme'nin üç talâkla, bâzılarında talâk-i bâinle boşandığı bildirildiği gibi, bir rivâyette üç talâkın sonuncusu, başka bir rivâyette: Kalan bir talâk ile boşandığı ifade olunmaktadır. Hattâ mutlak olarak: «boşadı» şeklinde dahi rivâyet olunmuştur. rivâyetlerin arası şöyle bulunmuştur ; Kocası Hazret-i Fâtıme'yi daha evvel iki defa boşamıştır. Son defa boşamakla talâk adedi üç olmuştur. İşte üç talâkla boşadığını söyleyenlerle «bir talâk», «üç talâkın sonuncusu» gibi tâbirler kullananların ve keza mutlak olarak: «boşadı» diyenlerin muradları budur. «Talâk-ı bâinle boşadı» ifâdesinden de aynı mânâ kasdedilmiştir. Çünkü üç defa boşamak talâkı bâindir. Fâtıme (radıyallahü anha)’ya vekili vasıtasiyle bir mikdar nafaka göndermişse de, Fâtıme bunu ya arpa olduğu için yahud az bulduğundan kabul etmeyerek hâlini Resûlüllah (sallallahü aleyhi ve sellem)'e arzeylemiş; fakat o da nafaka hakkı olmadığını söylemiş; ve iddetini Ümmü Şerik'in evinde geçirmesini emir buyurmuştur. Şerik bir rivâyette Kureyşden, diğer rivâyete göre Ensârdan salâh ve takvası ile meşhur bir kadındı. İsmi Guzeyye yâhud Güzeyle binti Dâvûd’dur. Bâzı ulemâya göre Peygamber (sallallahü aleyhi ve sellem)'e kendini hibe eden kadın budur. Resûlüllah (sallallahü aleyhi ve sellem) ashabının bu kadını anneleri gibi hürmet göstererek \"sık sık ziyaret ettiklerini, bunun ise kaç-göç işlerinde müşkilât doğuracağını düşünerek sonradan bu tavsiyeden vaz geçmiş; ve Fâtime (radıyallahü anha)’ya Abdullah b. Ümmü Mektum'un evinde iddet beklemesini emir buyurmuştur. Çünkü Abdullah (radıyallahü anh) âmâ idi. Kendisini göremeyeceği gibi, evine de fazla gelen giden yoktu. Bu sebeple erkeklerden tesettür meşakkati de olmayacaktı. talâkla boşanan bir kadına nafaka ve mesken verilip verilmeyeceği hususunda ulemâ ihtilâf etmişlerdir. Abbâ's (radıyallahü anh) ile Hasan-ı Basrî, Amr b. Dinar, Tâvûs, Ata' b. Ebî Rabâh. İkrime, Şa'bî, İmâm Ahmed, İshâk, bir rivâyette İbrahim Nehaî ve Zahirîler bu hadîslerle istidlal ederek: «Üç talâkla boşanan kadın hâmile değilse kendisine nafaka ve mesken vermek vâcib değildir.» demişlerdir. Kâdî Şureyh, İbrahim Nehaî, Sevrî, İbn Ebî Leylâ, İbn Şubrume, Hasan b. Salih, Ebû Hanîfe, İmâm Ebû Yûsuf ve îmam Muhammed'e göre böyle bir kadına hâmile olsun olmasın nafaka ve mesken verilir. Bu kavil ashâb-ı kirâmdan Ömer b. Hattâb ile İbn Mes'ud (radıyallahü anh) hazeratının mezhebleridir. Delilleri; evlerinden çıkarmayın, kendileri de çıkmasınlar; ancak aşikâr bir kötülük işlerlerse o başka...\" Sûre-i Talâk, âyet: 1, âyet-i kerîmesi ile Hazret-i Ömer'in Fâtıme binti Kays hadîsi için söylediği şu sözdür: «Biz bellediğini veya unuttuğunu bilmediğimiz bir kadının sözü ile ne Rabbimizin kitabını bırakırız, ne de Peygamberimizin sünnetini!..» binti Kays hadîsini Hazret-i Ömer'den maada Âişe ile Üsâme b. Zeyd (radıyallahü anh) ve başkaları da kabul etmemişlerdir. Mâlik, İmâm Şafiî, Abdurrahman b. Mehdî ve Ebû Ubeyde'ye göre bu kadına herhalde mesken verilirse de nafaka yalnız hâmile olduğu takdirde verilir. Bunlar mesken hususunda: « kendi oturduğunuz evlerde iskân edin!\" Sûre-i Talâk, âyet: 6. âyet-i kerimesi ile; nafaka îcâb etmediğine de Fâtıme hadîsinin zahiri ile istidlal etmişlerdir. ric'î ile boşanan kadına bilittifâk nafaka ve mesken verilir. Kocası ölen kadına bilittifâk nafaka yoktur. bâinle boşanan kadın Âişe ile İbn Mes'ûd (radıyallahü anh)'a göre iddeti içinde evinden çıkamaz. Saîd b. Müseyyeb, Kaasım, Salim, Ebû Bekr b. Abdirrahmân, Hârice b. Zeyd ve Süleyman b. Yesârin kavilleri de budur! Onlara göre kadın iddetini boşandığı evde bekler. Ebû Ubeyd bu kavli İmâm Mâlik ile Sevrî'den ve Küfe ulemâsından da rivâyet etmiştir. Abbâs, Câbir (radıyallahü anh), Ata', Tâvûs, Hasan-ı Basrî ve İkrime'den bir rivâyete göre talâk-ı bâinle boşanan kadın iddetini dilediği yerde geçirebilir. Mâlik: «O kocası ölen kadın yatsıdan sonra insanlar uykuya yatıncaya kadar ziyaret için dışarıda kalabilir. Sonra evine döner.» dermiş. Leys, Şafiî ve İmâm Ahmed'in kavilleri de budur. A'zam'a göre kocası ölen kadın gündüzleri dışarı çıkar; fakat geceyi mutlaka evinde geçirmesi îcâb eder. Boşanan kadın ise gece gündüz evinden çıkamaz. İmâm Muhammed boşanan ve kocası ölen kadınların gece gündüz evlerinden çıkamayacaklarına kail olmuştur. Peygamber (sallallahü aleyhi ve sellem)'in Hazret-i Fâtıma'ya iddetini beklemek için İbn Ümmi Mektûm (radıyallahü anh)'un evine göndermesi ile istidlal ederek: «Kadın ecnebi erkeğe bakabilir; fakat erkek kadına bakamaz.» demişlerse de bu kavil doğru değildir. Sahîh olan kavle göre kadının da yabancı bir erkeğe bakması haramdır. Ekser-i sahabe ile cumhûru ulemanın mezhepleri budur. Çünkü Teâlâ Hazretleri erkekler için söyle gözlerine sahip olsunlar.\" Sûre-i Nûr, âyet: 30. kadınlar hakkında dahi de söyle; onlar da gözlerine sahip olsunlar!..\" Sûre-i Nûr, âyet: 31. buyurmuştur. Bir de fitne erkekle kadın arasında müşterektir. Erkekten geleceğinden ne kadar endişe edilirse, kadından gelmesinden de o kadar korkulur. Nitekim Ebû Dâvud ile Tirmizî'nin rivâyet ettikleri bir hadîste beyân olunduğuna göre Ümmü Seleme ile Meymûne (radıyallahü anh) Peygamber (sallallahü aleyhi ve sellem)’in yanında bulundukları bir sırada İbn Ümmi Mektûm gelmiş. Peygamber (sallallahü aleyhi ve sellem) ; yanında örtünün!» buyurmuş. Kadınlar: «O âmâdır, görmez.» demişler. Fakat Resûlüllah (sallallahü aleyhi ve sellem) kendilerine: de mi âmâsınız, onu görmüyor musunuz?» mukabelesinde bulunmuştur. Tirmizî bu hadîsin hasen olduğunu söylemiştir. binti Kays hadîsinde onun İbn Ümmi Mektûm'a bakabileceğine dair söz yoktur. O yalnız Fâtıme (radıyallahü anh)’nın başkalarının kendisini görmesinden emîn olacağını bildirmektedir. Kendisi erkeklere bakmamakla me'murdur. Cehm'in sopasını boynundan bırakmaması iki suretle te'vîl olunur: Birinci te'vîle göre bu cümlenin, mânâsı, çok sefer eder demektir. İkinci te'vîle göre maksat kadınları çok döğmesidir. Bu te'vîl daha sahih görülmüştür; çünkü hadîsin bir rivâyetinde Ebû Cehm'in kadınları çok döğdüğü bildirilmiştir. Ebî Cehm, Encâbiyye hadîsinde ismi geçen Ebû Cehm b. Huzeyfete'l Kuraşî'dir. Teyemmüm bahsinde ve namaz kılan kimsenin Önünden geçme Bâbında bir de Ebû’l -Cüheym'den bahsedilmektedir ki, o başka bir zâttır. Hazret-i Ebû Cehm'in sopasını boynundan bırakmaması gerekse Muâviye (radıyallahü anh)’ın hiç bir malı olmayan yoksul olması birer mecazdır. Zira Ebû Cehm uyku ve yemek gibi hallerde elbette sopasını boynundan bırakırdı. Hazret-i Muâviye'nin de giyecek elbisesi, yiyecek ekmeği vardı. Fakat ekseriyetle hâlleri hadis-i şerîfde beyan buyurulduğu şekilde birinin sopa taşıması, diğerinin pek az mala sahip olması idi. şerîf Fâtıme (radıyallahü anh)'yı isteyen Muâviye'nin Muâviye b. Ebî Süfyân olduğunu tasrîh etmekle onun başka bir Muâviye olduğunu iddia edenlere de cevâbı vermektedir. (sallallahü aleyhi ve sellem)’in Hazret-i Fâtıme'ye Üsâme b. Zeyd'le evlenmesini ısrarla tavsiye buyurması onun dînen ve ahlâkan pek büyük bir fazilete sahip olduğunu bildiği içindir. Fâtıme (radıyallahü anh) ise Hazret-i Üsâme'nin âzadlı köle ve bir de cildinin pek siyah olmasına bakarak evvelâ bu işe razı olmamış; fakat onunla evlenerek ne derece hayırlı bir zât olduğunu görünce ona gıbta etmiştir. Gıbta etmek: İmrenmek demektir. Bunu hasedle karıştırmamalıdır. Zira hased: Bir kimsenin elinden bir şeyin gitmesini istemek, gıbta ise kendisinin de o kimse gibi olmasını dilemektir. Hüküm itibariyle de birbirlerinden ayrılırlar; hased haram, gıbta caizdir",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 45
			}
		}
	]
}