{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 372,
			"arabicnumber": "145",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Abdullah b. Ntimeyr ile Ebû Üsâme, Ubeydullah b. Ömer'den rivâyet ettiler. H. İbn Nümeyr de rivâyet etti. ki): Bize Babam rivâyet etti. ki): Bize Ubeydullah, Hubeyb b. Abdirrahman'dan, o da Hafs b. Âsım'dan, o da Ebû Hüreyre'den naklen rivâyet etti, ki Resûlüllah (sallallahü aleyhi ve sellem) iman yılanın deliğine çekildiği gibi Medine'ye Çekilecektir.» buyurmuşlar. müttefekun aleyhtir. Buhârî onu «Bâbu Fedâili'l-Medine» de tahriç etmiştir. sarihlerinden. Kurtubî'nin beyânına göre bazı hadis âlimleri bu hadisin başındaki «bede'e» fi'lini hemzesiz olarak «bedâ» şeklinde okumuşlardır. Çünkü «başladı» mânasına gelen «bede'e» fi'li mütead-dîdir; mef'ul ister, halbuki hadisde mef'ul zikredilmemiştir. Rivâyet «bede'e» şeklinde hemze ile gelmişse de müşkildir. Hatta ulemadan bazıları bu rivâyeti kabul etmiyerek kelimenin «zuhur etti» mânasına gelen «bedâ» şeklinde okunacağım iddia etmişlerdir. «Bedâ» kelimesi lâzım fi'l olduğu için mef ule zaten hacet yoktur. Bu suretle hadis hem manen hem de lâf-zan sahih olmuş olur. Ancak Kurtubî bu sözleri naklettikten sonra, hadisin «bede'e» lâfzile rivâyet edildiğini söyleyerek bunu kabul etmemenin yersiz olacağını, «bede'e» lâfzile dahi mânanın sahih olduğunu bildirmiş; ve «çünkü hadisden maksat: İslâmın az kimseler arasında intişare başladığını; sonra yine az kimselerde kalacağım haber vermektir. «Zuhur etti» mânasına gelen «bedâ» ise onu bu maksattan uzaklaştırır.» demiştir. masdarından alınmıştır. «Tîb» güzellik, temizlik, lezzet ve gönül hoşluğu mânalarına gelir. İşte «fuİâ» veznindeki «tubâ» bu asıldan alınmış; «ta» nın harekesi zamme olduğu için kelimenin «ya» si «vav» a çevrilmiştir. «tubâ» yi iki şekilde kullanırlar ve: «tûbâke» yahut «tûbâ leke» derler. kelimenin mânası hususunda müfessirler ihtilâf etmişlerdir. Sul-tanülmüfessirin İbn Abbâ'ya göre ferah ve göz aydınlığı manasınadır. îkrime'ye göre «sana verilen ne güzel şeydir» Dahhâk'a göre: «sana gıbta ederim», Katâdeye göre: «hayı-ra isabet ettin.» demektir. Bazıları: «Tûbâdan murâd; cennettir.» demiş; bir takımları da cennette bir ağaç olduğunu söylemişlerdir. Nevevî ha-disdeki Tûbânın bu mânaların her birine ihtimâli olduğunu söylüyor. Türkçemizde bu makamda: «müjdeler olsun» «ne mutlu» gibi ta'biler kullanılır. garibin cem'idir. Esas itibarile gurbet: uzaklık demektir. Onun için de vatanından uzak düşenlere garib denilir. Yine bu mânadan alınarak sürgüne tağrib denilmiştir. ikinci rivâyetinde; İslâmın, deliğine çekilen yılan gibi. iki mescidin araşma çekilip toplanacağı bildiriliyor. Bu mescitlerden murad Mekke ile Medine mescitleridir. mânası hakkında Elmalılı Muhammed Hamdi Yazır merhum «Hak dini Kur'ân dili» nâm eserinde Nemlı sûresinin son âyetlerini Tefsir ederken şunları söylemiştir: «Bu âyetin işaretine nazaran İslâmın istikbali gece değil gündüzdür. Sönük değil parlaktır. Ara-sira basan gece zulmetleri onu dinlendirip tekrar uyandırmak içindir. Bu mâna mâruf bir Hadis-i şerif ile şöyle beyan buyurulmuştur: hadisdeki «Seyeûdû» fiilini ekseri kimseler «seyesîru» mânasına fi'li nakıs telâkki ederek: «İslâm garip olarak başladı (yahut zuhuretti) yine başladığı gibi garip olacak» diye yalnız inzar suretinde anlamış, bundan ise hep yeis, teammünı etmiştir. Halbuki Kanıus'ta gösterildiği üzere «Âde» de olduğu gibi; dönüp yeniden başlamak mânasına da gelir. hadis de böyledir. Yani «islâm garip olarak başladı (veya zuhur etti) ileride yine başladığı gibi garip olarak tekrar başlayacak (yahut yeniden zuhur edecek) ne mutlu o gariplere» demektir. Hadisin âhirin-deki Fetûba onun inzar için değil, tebşir için sevk buyrulduğunu gösterir, gerçi, bunda da dönüp garip olmak inzarı yok değil, lâkin dönmeyip yeniden başlaması tebşiri vardır, İşte «Fetûbâ lilgurebâ» müjdeside bunun içindir. Çünkü onlar sâbikun-i evvelûn gibidirler. Binaen aleyh hadis de ye'si değil müjdeyi nâtıktır. merhumun izahatı burada bitti şimdi diğer İslâm ulemasının izahlarım görelim: Kâdi Iyâz diyor ki: «İbn Ebî Üveys'in İmâm Malik (rahimehüllah)'dan rivâyetine göre bu hadisin mânası Medine'de İslâmiyet garip olarak başlamış ve (günün birinde) yine oraya dönecektir. Hadisin zahiri umum bildirmektedir. İslâmiyet bir kaç kişi arasında başlamış sonra yayılarak meydana çıkmıştır. Daha sonra ona noksanlık ve bozuntu arız olacak ve yine başladığı gibi bir kaç kişiden ibaret kimselerde kalacaktır. tefsiri bir hadiste varid olmuştur. Resûlüllah (sallallahü aleyhi ve sellem)'e: «Gurebâ kimlerdir ya Resûlüllah?» diye sorulmuş. «Her kabilenin nezİ'leridir.» cevabını vermiştir. yahut nâzî: Ailesinden uzak düşen manasınadır. Bununla Peygamber (sallallahü aleyhi ve sellem) Allah ve Resûlüllah aşkına ailelerinden uzak düşen muhacirleri kastetmiştir. Resûlüllah (sallallahü aleyhi ve sellem) in. «islâmiyet Medine'ye çekilir» buyurmasının mânası imanın evvel ve âhır bu sıfatta kalmasıdır. Çünkü İslâmiyetin başında imanı halis ve İslâmı sağlam olan herkes ya yerleşmek üzere muhacir olarak yahut Resûlüllah (sallallahü aleyhi ve sellem)'i görmek, ondan bir şeyler öğrenmek ve ona yakın olmak aşkı ile Medine'ye gelirdi. Ondan sonra Hulâfâ-i Raşidin zamanında dahi onlardan adalet numunesi almak, cumhûru sahabe (rıdvanullahi aleyhim) hazaratiyle onlardan sonra gelen ulemaya uymak, intişar eden sünneti onlardan almak için bu minval üzere devam ettiler. İman kalbine yer eden her müslüman Medineye gelirdi. Bu iş tâ zamanımıza kadar devam ede gelmiştir. Maksat Peygamber (sallallahü aleyhi ve sellem)’in kabrini ziyaret etmek onun gezdiği yerlerle, eserleriyle ve ashâb-ı kirâmın eserleriyle teberruk etmektir. Binaenaleyh Medineye ancak mümin olanlar gelir. «Kâdı îyâz’ın izahı da burada bitti. şöyle diyor: «Bu mesele Peygamber (sallallahü aleyhi ve sellem) devriyle ondan sonra gelen sahabe ve daha sonra gelen tabiîn devirlerine mahsustur. Çünkü o devirlerde vaziyet dürüst idi.» «Bu hadisde o devirler müslümanlarının doğru yolda ve bid'atlardan uzak olduklarına, onların fi'llerinin bizim, için hüccet teşkil ettiğine tenbih vardır. Nitekim İmâm Malik'in mezhebi de budur.» diyor. sarihi Aynî de şunları söylüyor: «Bu hâl Peygamber (sallallahü aleyhi ve sellem) ile sahabe, tabiîn ve tebe-i tabiîn devirlerine mahsustur, ki bu müddet doksan seneden ibarettir. Ondan sonra haller değişmiş, bâ husus zamanımızda bid'atlar çoğalmıştır.» Kiramın kavillerinden bu kadarcığını gördükten sonra, şunu da arz etmek isterim ki; bence hadisi şerif kıyâmete yakın müslümanlığm başladığı devre döneciğini yani müslümanlarm azalacağını ve meşakkatlere mâruz kalacaklarını takrir etmektedir. Nitekim bundan sonra göreceğimiz hadiste de kıyâmete yakın, «Allah Allah» diyen kimse kalmıyacağı bildirilmektedir. Dünya müslümanlannın bu günkü hali nazarı dikkate alınırsa bu hadislerin geleceği haber veren birer mucize olduğundan şüphe etmemek gerekir. Kanaati acizânemce bu hadisde inzâr veya tebşir diye bir şey yok sadece vukua gelecek hakikati ihbar vardır. Ulemânın: «İslâinın dalgah devirleri tebe-i tabiîn ile sona erer demelerine bakılarsa İslâmm tekrar eski satvet ve şevketine dönmesi hayli şüphe götürür. Allah'ın lütfü inayetinden hiç bir zaman ümidimizi kesmemekle beraber bu hadisi zahirî mânası üzerine bırakmak bence eslimi tariktir. Allah'ü âlem.»",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 279
			}
		}
	]
}