{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"18": "The Book of Divorce "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3742,
			"arabicnumber": "938.05",
			"text": "(Bana Ebû'r-Rabî'ez-Zehrânî de rivâyet etti. ki): Bize Hammâd rivâyet etti. ki): Bize Eyyûb, Hafsa'dan, o da Ümmü Atiyye'den naklen rivâyet eyledi. (Şöyle dedi): Ölüye üç günden fazla yas tutmaktan nehyolunuyorduk; yalnız koca için dört ay on gün müstesna idi. O esnada sürme çekinmez; koku sürünmez; boyalı elbise giymezdik. Ama bir hangimiz hayzından yıkandı mı temizliği müddetinde kust ve ezfârdau bir parçacık kullanmasına ruhsat verilmişti. ki, bu rivâyetlerin hepsi aynı mânâda olup birbirlerini az çok tefsir etmektedirler. Hazret-i Ümmü Atıyye rivâyetini Buhârî «Hayz», «Talâk» ve «İddet» bahislerinde; Ebû Dâvûd, Nesâî ve İbn Mâce «Talâk» bahsinde muhtelif râvilerden tahrîc etmişlerdir, Hılsın cem'idir. Hıls: Lügatte hah ve diğer kıymetli yaygıların altına döşenen ve hayvanın semeri altına konan kıl veya yünden yapma palastır. Burada ondan murâd: Kötü elbisedir. Resûlüllah (sallallahü aleyhi ve sellem)’in zevcelerinden Ümmü Habîbe (radıyallahü anhâ) Ebû Süfyân'ın kızı ve Muâviye'nin kız kardeşidir. İsmi Ramle'dir. ezvâc-ı tâhirattan Ümmü Atıyye (radıyallahü anha)’nın ismi Nüseybe binti Kâ'b'dır. Nüseybe binti Haris el-Ensâriyye olduğunu söyleyenler de vardır. Bir nevi' Yemen kumaşıdır. Bu kumaşın ipliği toplanarak sımsıkı bağlanır, ondan sonra boyanırmış. Bu suretle bâzı yerlerine boya işlemeyen iplikten alaca bir kumaş meydana gelirmiş. Kazzâz: «Hükümdarlara elbise bu kumaştan yapılırdı.» demiştir. Bazıları asbın, çizgili kumaş olduğunu söylemişlerdir. veya Küst yahud Küşt: Bedevilerin kullandığı bir nevi' buhurdur. İbn Baytar buna isin dahi denildiğini söyler. dahi bir nevi' siyah buhurdur. Parçası tırnağa benzermiş. Nevevî'nin beyânına göre kust ile ezfâr koku sürünmek maksadı ile değil de hayzdan sonra kanın eseri olan pis kokuyu gidermek için kadınların kullanmasına ruhsat verilen birer nevi' mâruf buhurdur. Battal: «Hayızlı kadına gerek iddet içinde gerekse iddet dışında hayzından yıkandığı zaman kanın kokusunu gidermek için kust ile buhurlanmağa ruhsat verilmiştir. Bunu namaza durmak ve kanın pis kokusu ile meleklere ezâ etmemek için yapar.» diyor. bu Bâbın rivâyetleri: İddet hâlinde olmayan kadınların ölü İçin üç günden fazla yas tutamayacaklarına, yas tutan kadına zaruret yokken sürme, koku ve zînetli elbise gibi şeyler haram kılındığına, buhurların bunlarda dahil olmadığına delildirler. bir hadîste: «Resûlüllah (sallallahü aleyhi ve sellem) kadına kocası için iddeti geçinceye kadar; babası için yedi gün; başkaları için üç gün matem tutmağa ruhsat verildi.» denilmişse de Buhârî sârini Aynî bu hadîsin sahîh olmadığını bildirmiş; Hazret-i Ümmü Habibe'nin, babası vefat ettikten üç gün sonra koku sürünmesini ve diğer hadîslerin umumunu müddeâsına de! il göstermiştir. Hadîsi Ebû Dâvûd «Kitâbü'l-MerâsiNinde mu'dal olarak rivâyet etmiştir; binâenaleyh onunla ihticâc edilemez",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 87
			}
		}
	]
}