{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 375,
			"arabicnumber": "148.01",
			"text": "Bize Ebû Bekr b. Ebû Şeybe ile Muhammed b. Abdillâh b. Nümeyr ve Ebû Küreyb rivâyet ettiler. Lâfız Ebû Kureyb'indir. Dediler ki: Bize Ebû Muâviye, A'meş'den, o da Şakîk'den, o da Huzeyfe'den naklen rivâyet etti. Şöyle dedi: (sallallahü aleyhi ve sellem)’le beraber bulunuyorduk. (Bize hitaben): kelimesini söyleyenlerin adedi kaçtır. Sayın bana!» dedi. Bizde: «Ya Resûlüllah, adedimiz altı yüzle yedi yüz arasında olduğu halde bize bir kötülük ederler diye mi korkuyorsun?» dedik. bilmezsiniz; belki ibtilâ olunursunuz.» buyurdular. Huzeyfe az sonra ibtilâ olunduk. O derecede ki bizden birimiz namazını bile ancak gizli kılmağa başladı.» demiş. hadisi Buhârî ile Nesâî «Kitâbü's-Siyer» de, İbn Mâce-de «Kitâbü'l-Fiten» de tahriç etmişlerdir. Buhârî'de hadisin metni şöyledir: (sallallahü aleyhi ve sellem): diyenleri bana yazın!» buyurdular. üzerine biz de kendilerine 1500 kişi yazdık. Ve: Biz 1500 kişi olduğumuz halde daha korkuyor muyuz? dedik. diyor ki: (zaman oldu) öyle bir ibtilâ olunduğumuzu gördüm ki, insan (evinde) yalnız başına namaz kılarken bile korkuyordu.» şerifin mevzuu harbe iştirak için asker yazmaktır. Bu konuşmanın nerede geçtiği ihtilaflıdır. İbn Tîn Hendek vakasında hendeğin kazıldığı sırada yapıldığına cezmen kail olmuştur. Bazıları Uhud gazasına çıkarken, bir takımları da Hudeybiye'de cereyan ettiğini söylerler. Ashâb-ı kirâm bu kadar kalabalık olduğumuz halde neden korkuyoruz, diye şaşmışlar; fakat Resûlüllah (sallallahü aleyhi ve sellem)’in irtihâlin-den sonra şaştıkları korku başlarına gelmiş. O derecede ki, korkudan cemaata devam edemez olmuşlar. Namazlarını evlerinde kılarken bile kor-kuyorlarmış. Iyaz diyor ki: «İhtimâl Huzeyfe'nin bu sözü Peygamber (sallallahü aleyhi ve sellem)'in vefatından sonra müslümanlarm Mekke'de bulundukları devirde müşriklerin namaza mânı oldukları hengâma âiddir. Ama hadisin siyak ve lâfzına nisbetle bu ihtimâl uzaktır. Çünkü «ibtilâ» cümlesi, üst tarafına «fa» ile atfolunmuştur. «Fa» tertip ve takibe delâlet eder. Binaenaleyh ibtilânın mezkûr konuşmadan az sonra vâki olması icabeder. İbtilânın Hazret-i Osman fitnesinde olması da muhtemeldir. Ancak bu sözden kelimenin eam mânası, yanî din düşmanlarile ibtilâ kasdedilirse o başka.» Nevevî de şunları söylemiştir: «İhtimâl Huzeyfe (radıyallahü anh) bu sözü ile Resûlüllah (sallallahü aleyhi ve sellem)’den sonra cereyan eden bazı fitneleri kasdetmiş olacaktır, o fitnelerde ashabın bazıları gizleniyor; namazım gizlice kılıyor, meydana çıkarak fitne ve harbe iştirak etmekten korkuyordu. birinde: «Altı yüzle yedi yüz arasındayız» diğerinde: «1500 kişi yazdık» denilmesine bakarak Dâvudi: «Olabilir bu asker yazma işi muhtelif yerlerde bir kaç defa vukuu bulmuştur.» demiştir. Bazıları iki rivâyetin arasını bulmak için: «1500 den murâd: erkek, kadın, köle ve çocuk, bütün müslümanlardır. Altı yüzle yedi yüz arasından ise hassaten erkekler kasdedilmiştir.» diyorlar. Hatta hadisin bir rivâyetinde 1500 yerine sadece «500 kişi» denilmiştir. Bu da harbe iştirak edenler diye te'vil olunuyor. bu te'villeri sıraladıktan sonra şöyle diyor: «Bu te'vîller bâtıldır. Çünkü hadisin diğer rivâyetinde, 1500 adam yazdık diyerek bunların hepsinin erkek olduğu tasrih edilmiştir. Sahih te'vil şudur: Sayıları altı yüzle yedi yüz arasında olanlar, hasseten Medine'dendir.. 1500 adedi bunlarla birlikte etraftan gelen müslümanlarm mecmu'udur.» «Müslümanları müdafaa icabettiği zaman hükümdarın asker yazması sünnettir. Vatan tehlikeye düşünce eli silâh tutan herkese cihâd farzolur.» diyor. Şerif bir şeyi vukuundan önce haber veren mucizelerdendir. Çoklukla övünmenin ilâhî cezayı nıüstelzim olduğu bu hadîs-i şeriften çıkarılan hükümlerdendir.»",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 282
			}
		}
	]
}