{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"19": "The Book of Invoking Curses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3754,
			"arabicnumber": "1494.03",
			"text": "Bize bu hadîsi Muhammed b. Müsennâ ile Ubeydullah b. Saîd de rivâyet ettiler. (Dediler ki): Bize Yahya yani el-Kattân, Ubeydullâh’dan bu isnadla rivâyette bulundu. rivâyeti Buhârî «Talâk» ve «Ferâiz» bahislerinde; Ebû Dâvûd, Nesâî ve İbn Mâce «Talâk»da; Tirmizî «Nikâh» bahsinde tahric etmişlerdir. Buhârî şârihi Aynî'ye göre Ensâr'dan liân yapan zât Hilâl b. Ümeyye'dir. Bu zâta âid rivâyet, Bâbımızda az sonra görülecektir. Abbâs (radıyallahü anh)'dan rivâyet olunan bir hadîste: b. Ümeyye karısına zinâ isnadında bulununca kendisine: Val-üi (sallallahü aleyhi ve sellem) sana seksen dayak vurur; deümü biliyor; cevabını verdi. Bunun üzerine mübâane âyeti nâzil oldu.» denilmiştir. Mamafih bu rivâyet Uveymir-i Aclânîye âid de olabilir; çünkü o da Ensârdandır. şerif «liân ancak hâkimin kan kocayı birbirinden ayırma-siyle tamam olur.» diyen Hanefîler'e kuvvetli bir delildir. Bu bâbtaki ihtilâfı az yukarıda görmüştük. Bundan maada liânın meşruiyetine ve doğacak çocuğun nesebinin annesinden sabit olacağına da delildir. Erkek karısının hamli için: «Bu benden değildir.» dedi mi artık çocuğun nesebi ondan sabit olmaz; annesine nisbet edilir. Mîras dahi anne ile oğlu arasında cereyan eder. Mezhep İmâmları ile cumhûrun kavilleri bu olduğunu dahi yukarıda görmüştük. «Bir takım ulemâ: Erkek karısının çocuğunu nefî etmekle çocuk onun olmaktan çıkmaz; bundan dolayı kendisine liân da yapılmaz; demişlerdir.» diyor. işaret ettiği zevat; «Şa'bî ile Muhammed b. Ebî Zi'b ve bâzı Medine ulemâsıdır. Burada ikinci bir ihtilâf daha vardır. göre çocuk hakkındaki kazif doğum esnasında yahut doğumdan bir iki gün sonra yani âdet vecihle çocuğun tebrik edildiği ve onun ihtiyacâtı için öte beri satın alındığı günlerde yapılırsa sahihtir. Ondan sonra yapılan nefye itibâr yoktur. İmâm A'zam bu' hususta vakit ta'yin etmemiştir. Yalnız bir rivâyete göre yedi gün ta'yîn ettiği söylenir. İmâm Ebû Yûsuf ile İmâm Muhammed'e göre çocuk kırk gün zarfında nefî edilebilir. İmâm Şafiî: «Çocuk doğar doğmaz nefî edilirse sahihtir; daha sonra nefî caiz olmaz.» demiştir",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 12
			}
		}
	]
}