{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"19": "The Book of Invoking Curses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3755,
			"arabicnumber": "1495.01",
			"text": "Bize Züheyr b. Harb ile Osman b. Ebî Şeybe ve İshâk b. İbrahim rivayet ettiler. Lâfız Züheyr'indir. İshâk (Bize haber verdi) ifâdesini kullandı. Ötekiler: Bize Cerîr. Âmeş'den, o da İbrahim'den, o da Alkame'den, o da Abdullah'dan naklen rivayet etti; dediler. Abdullah şöyle demiş: Bir cuma gecesi mescidde idik. Ansızın Ensârdan bir adam çıkageldi ve: — Şayet bir adam karısının yanında birini bulur da lâf söylerse ona dayak vurur; öldürürse siz de kendisini (kısâsen) öldürür müsünüz? Yoksa susarsa pür gazab mı susar? Vallahi ben bunu mutlaka Resûlullah (Sallallahu Aleyhi ve Sellem)'e soracağım! dedi. Ertesi gün Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek sordu; ve: — Şayet bir adam karısının yanında birini bulur da lâf söylerse ona dayak vurur; öldürürse siz de kendisini (kısasen) öldürür müsünüz; yoksa susarsa pür gazab mı susar? dedi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Allahım, beyân buyur!» dedi. (Böylece) dua etmeğe başladı. Nihayet liân âyeti (yâni) : Karılarına İftira atıp da kendilerinden başka sahidleri olmayanlar...\" [Nur 6-7]âyetleri indi. Müteakiben halk arasında bu iş o adamın başına geldi de; hem kendisi hem karısı Resûlullah (Sallallahu Aleyhi ve Sellem) gelerek lânetleştiler. (Evvelâ) erkek : Kendinin hakikaten doğru söyleyenlerden olduğuna Allah'a dört defa şehâdette bulundu. Sonra beşincide : Eğer yalancılardansa Allah'ın laneti kendi üzerine olması lanetini yaptı. Arkasından kadın liân yapmağa kalktı. Resûlullah (Sallallahu Aleyhi ve Sellem) ona : «Vaz geç!» buyurdu. Fakat kadın razı olmadı; ve liân yaptı. Onlar dönüp gittikten sonra Nebi (Sallallahu Aleyhi ve Sellem) . «Umulur ki bu kadın kara, cılız bir çocuk doğurur.» buyurdular. Müteakiben kadın kara, cıIız bir çocuk doğurdu",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 13
			}
		}
	]
}