{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"19": "The Book of Invoking Curses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3757,
			"arabicnumber": "1496",
			"text": "(Bize Muhammed b. Müsemıâ rivâyet etti. ki): Bize Abdülâlâ rivâyet etti, ki): Bize Hişâm, Muhammed'den naklen rivâyette bulundu. ki): işten malûmatı olduğunu zannederek Enes b. Mâlik'e sordum da şunu söyledi. Hilâl b. Ümeyye karısına şerik b. Sehmâ ile zinâ isnadında bulundu. Şerik, Berâ' b. Mâlik'in anne bir kardeşi olup İslâm'da ilk liân yapan adamdı. Hilâl karısı ile lânetleşti. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): gözetleyin! Eğer beyaz (tenli), düz saçlı, bozuk gözlü bir çocuk doğurursa, çocuk Hilâl b. Umeyye'ye; sürmeli gözlü, cılız, İnce baldırlı doğurursa şerik b. Sehma'ya âirtir.» buyurdu. Bilâhare haber aidim ki, kadın sürmeli gözlü, cıliz, ince baldırlı bir çocuk doğurmuş. b. Ümeyye hadisini Hazret-i İbn Abbâs'dan, Buhârî: «Tefsir», «Talâk» ve «Şehâdât» bahislerinde; Ebû Dâvûd «Talâk»da; Tirmizî «Tefsîr» ve «Talâk» bahislerinde muhtelif lâfızlarla Muhammed b. Beşşâr'dan tahric etmişlerdir Hilâl Ensârdandır. Evvelce müslürnan olmuş; Bedir ve Uhud gazalarına iştirak etmiştir. Tebûk gazasına gitmeyen, fakat sonra da afva mazhar olan üç kişiden biridir. beyânına göre karısının ismi Havle binti Kays fdır. Havle binti Âsim olduğunu söyleyenler de vardır. O da Ensârdandır. b. Sehmâ: Sahabeden olup Âsim b. Adiyy'in amcası oğlu ve Berâ'b. Mâlik'in anne bir kardeşidir. Ensârın müttefiklerindendi. Sehmâ annesinin lâkabıdır. İsmi Leb îbe binti Abdiilah'dır. Babasının adı da Abede b. Muattib'dir. Yahûdi olduğunu söyleyenler de bulunmuşsa da Kâdî îyâz bu iddianın bâtıl olduğunu bildirmiştir. hadîsi Ebû Dâvûd, biri Muhammed b. Beş-şar. diğeri Hasan b. Alî'den olmak üzere iki tarîkten rivâyet etmiştir. Bu bâbtakî rivâyetlerin mecmuundan anlaşıldığına göre Hilâl b. Ümeyye kıssası şöyle cereyan etmiştir: Hilâl tarlasından yatsı zamanı evine dönmüş; ve karısını Şerîk ile zina ederken gözü ile görmüş; kulağı ile işitmiş. Fakat ses çıkarmamış. Sabah olunca Resûlüllah (sallallahü aleyhi ve SeîkmS'e giderek hâdiseyi anlatmış. Peygamber (sallallahü aleyhi ve sellem) bu haberden hoşlanmamış. Hilâl'e: beyyîne getirirsin yahut sırtına dayak vurulur!» demiş. Hilâl buna mukabeleten: Seni hak dinle gönderen Allah'a yemîn ederim ki, ben doğruyu söyledim. Allah elbette benim sırtımı dayaktan kurtaracak bir hüküm indirecektir; demiş. Bunun üzerine Cebrail (aleyhisselâm) inerek lîân âyetlerini getirmiş. Resûlüllah (sallallahü aleyhi ve sellem)’den vakî Kâîe geçince Hazret-i Hilâl'e: yâ Hilâl! Allah sana ferahlık ve akar yol halk etti.» buyurarak inen âyetleri kendisine okumuş. Hilâl: Ben zâten Rabbimden bunu bekliyordum; demiş. Sonra Hilâî'in karısına haber göndermişler. Kadın gelince Resûlüllah (sallallahü aleyhi ve sellem) âyetleri ona da okumuş; ve âhîret azabının dünya azabından daha şiddetli olduğu ikisine de hatırlatarak nasihatlerde bulunmuş. Hilâl: Vallahi bu kadın hakkında ben doğruyu söyledim; demiş. Kadın ise kocasının yalan söylediğini iddia etmiş. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): arasında liân yapın!» buyurmuşlar. Evvelâ Hilâl'den şehâ-det istenmiş. Hilâl doğru söylediğine dört defa şehâdette bulunmuş. Be Şİnciye sıra gelince; Hüâl'e: Yâ Hilâl! Allah'dan kork, çünkü dünya azâbı âhiret azabından ehvendir; bu şehâdet sana azabı icâb eder; demişler. Hilâl: Vallahi bundan dolayı Allah bana hadd vurdurmadığı gibi, beni azâb da etmez; diyerek beşinci şehâdetini de yapmış. Arkasından kadına: Sen de şehâdet getir; demişler. O da kocasının yalancı olduğuna dört defa şehâdette bulunmuş. Beşinciye sıra gelince, ona da kocasına yapılan telkînât yapılmış. Kadın bir an durakladıktan sonra: Vallahi ben kavmimi kepaze edemem; diyerek beşinci şehâdetini getirmiş. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) onları birbirlerinden ayırmış; ve çocuğun bundan böyle baba adı ile çağırlmamasına, kadına ve çocuğuna kimsenin dil uzatıp isnâdda bulunmamasına; bu gibi hareketlerde bulunanlara hadd vurulacağına, kan koca boşanmadan birbirinden ayrıldıkları için kadına mesken ve nafaka verilemeyeceğine hüküm buyurmuş. Çocuk sarışın, çantıları çıkık, kanbur ve ince baldirlı doğarsa Hilâl'e; esmer, kıvırcık saçlı, dolgun vücutlu, kalın baldırlı, düzgün çantılı doğarsa maznuna yani Şerîk'e âid olacağını bildirmiş. Neticede kadın Şerîk'e benzeyen bir çocuk doğurmuş. Resûlüllah (sallallahü aleyhi ve sellem) bunu haber alınca: şu yeminler olmasaydı ben bu kadına yapacağımı bilirdim.» demiş. İkrime'nin beyanına göre doğan çocuk sonra Mısır'a vâlî olmuş. âyetlerinin sebeb-i nüzulü'hakkında ulemâ ihtilâf etmişlerdir. Bazıları Uveymir-i Aclânî hakkında nâzil olduğunu söylemişlerdir. Delilleri: (sallallahü aleyhi ve sellem)’in Hazret-i Uveymir'e daha önceden: refikan hakkında Allah âyet indirdi.» buyurmasıdır. Cumhûru ulemâya göre liân âyetleri Hilâl b. Ümeyye kıssası için nâzil olmuştur. Çünkü Bâbımız hadîsinde Hazret-i Hilâl için: «İslâmda ilk liân yapan adamdı.» denilmiştir. Şâfiîler'den Mârûdî: «Bu iki zât hakkında nakiller birbirine benzer ve karışıktır» demiş; İbn Sabbâğ ise Hilâl kıssasının âyetin onun hakkında indiğine delâlet ettiğini söyledikten sonra: «Peygamber (sallallahü aleyhi ve sellem)’in Uveymîr'e: refikan hakkında Allah âyet İndirdi.» buyurmasının mânâsı: Hilâl kıssası için indirilen âyetler demektir. Zîra bunların hükümleri bütün müslümanlara âmm ve şâmildir. Nevevî'ye göre her ikisi için birden inmiş olabilir. İkisi de aynı meseleyi Peygamber (sallallahü aleyhi ve sellem)'e yakın zamanlarda sormuşlardır. Evvelâ Hilâ1 sormuşsa da aralan yakın olduğu için âyetler ikisi hakkında nâzil olmuştur, denilebilir. Hüküm itibariyle bu rivâyet de yukarıkiler gibidir",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 15
			}
		}
	]
}