{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"20": "The Book of Emancipating Slaves"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3789,
			"arabicnumber": "1506.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Züheyr b. Harb rivâyet ettiler. (Dediler ki): Bize İbn Uyeyne rivâyet etti. H. Yabyâ b. Eyyûb ile Kuteybe ve İbn Hucr da rivâyet ettiler. (Dediler ki): Bize İsmail b. Ca'fer rivâyet etti. H. İbn Nümeyr dahi rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Süfyân b. Saîd rivâyet etti. H. İbn Müsennâ da rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be rivâyet etti. H. yine İbn Müsennâ rivâyet etti. ki): Bize Abdülvehhâb rivâyet etti. ki): Bize Ubeydullah rivâyet etti. H. İbn Râfi' de rivâyet etti. ki): Bize İbn Ebî Füdeyk rivâyet etti. ki): Bize Dahhâk yani İbn Osman haber verdi. râvilerin hepsi Abdullah b. Dinar'dan, o da İbn Ömer'den, o da Veygamber (sallallahü aleyhi ve sellem)’den bu hadîsin mislini rivâyet etmişlerdir. Yalnız (Abdülvehhâb) Sekafî'nin, Ubeydullah'dan rivâyetinde yalnız satış vardır. O hibeyi zikretmemiştir. hadîsi Buhârî «Itk» bahsinde; Ebû Dâvûd «Ferâiz» de tahrîc etmişlerdir. Nesâî onu Muhammed b. Abdil-melik'den rivâyet eylemiştir. velâ'dan murâd: Velâ-i atâkadır. Velâ-i atâkanın sebebi âzâd etmek değil, kölenin âzâd olmasıdır. Çünkü bir kimse yakın akrabasından bir köleye miras yolu ile sahip olursa köle âzâd olur; velâ hakkı da sahibine verilir. Eğer velâ'nın sebebi âzâd etmek olsaydı sahibine verilmemesi îcâb ederdi; çünkü sahibi onu âzâd etmemişti. olan köle ölürse onu âzâd eden kimse yahut vârisleri köleye mirasçı olurlar. Araplar bu hakkı kimi satar, kimi birine hibe ederlerdi. Resûlüllah (sallallahü aleyhi ve sellem) bunu men'etti. Zîra velâ' hakkı neseb gibidir; değiştirmekle değişmez, Hicaz ve Irak ulemâsı velâ'nın satılıp hibe edilemeyeceğinde müttefiktirler. Ancak İbn Münzir burada ikinci bir kavil olduğunu söylemiştir. Mezkûr kavle göre Meymûne binti Haris (radıyallahü anh) âzâd ettiği kölelerinin velâ hakkını Hazret-i Abbâs'a hibe etmiş; Urve de Tahinân’ın velâsını Mus'ab b. Zübeyr'in mirasçıları için satın almıştır. Atâ'nın dahi: «Sahibi kölesine dilediği kimse ile velâ' akdi yapmak için izin verebilir.» dediği rivâyet olunur ki, bu da velânın hibe edilmesi demektir. Nevevî; «İhtimâl bu zevat bu hadîsi duymamışlardır » diyor. ulemâya göre velâ ne satılır; ne de hibe edilir. Çünkü Peygamber (sallallahü aleyhi ve sellem): neseb karabeti gibi bir karabettir.» buyurmuştur. Bunu Hazret-i İbn Ömer merfû1 olarak rivâyet etmiştir. Hadîs İbn Huzeyme, İbn Hibbân ve Hâkim'e göre sahihtir. Yalnız Beyhakî onun illetli olduğunu söylemiştir. Aynı hadîsi İbn Ömer (radıyallahü anh)'dan İbn Battal da merfû' olarak başka bir tarîkle rivâyet etmiştir. neseb gibi olduğuna göre değiştirilmesine imkân yoktur. Çünkü nesebin değiştirilemeyeceğine icmâ' mün'akid olmuştur. Neseb değiştirmek mümkün olmadığı içindir ki, Teâlâ Hazretleri evlâdlıklara mîrâs vermeyi neshetmiş; ve onları babalarının adlan ile çağırmayı emir bu-vurmuştur. Resûlü Ekrem (sallallahü aleyhi ve sellem)'i de babasından başkasına intisab edenlere lanet eylemiştir",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 20
			}
		}
	]
}