{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"20": "The Book of Emancipating Slaves"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3794,
			"arabicnumber": "1370.04",
			"text": "(Bize Ebû Küreyb rivâyet etti. ki): Bize Ebû Muâviye rivâyet etti. ki): Bize A'meş, İbrâhîm-i Teymî'den, o da babasından naklen rivâyet etti. ki): Bize Alî b. Ebî Tâlib hutbe îrâd etti de şunları söyledi: kim bizde Allah'ın kitabı ile —kılıcının kılıfında asılı bir sahî-feye işaret ederek— şu sahîfeden başka okuduğumuz bir şey bulunduğunu söylerse muhakkak yalancıdır. Bu sahîfede develerin yaşlan ile yaralara âid bâzı şeyler vardır. Yine bu sahîfede şu hadîs de vardır: Peygamber (sallallahü aleyhi ve sellem) buyurdular ki: Ayr ile Sevr (dağları) arası haremdir. Binâenaleyh bir kimse orada bir bid'at işler yahud bid'atçıyı barındırırsa Allah'ın, meleklerin ve bütün insanların laneti onun üzerine olsun! Allah kıyâmet gününde onun farz veya nafile hiç bir ibâdetini kabul etmeyecektir. Müslümanların zimmeti birdir. Onun uğrunda en aşağı (mertebede olan) dan dahi gayret gösterir. Her kim babasından başkasının oğlu olduğunu iddia eder; yahud (bir köle) sahiplerinden başkasına intisâb ederse Allah'ın, meleklerin ve bütün insanların laneti onun da üzerine olsun! Kıyâmet gününde Allah onun farz veya nâfile hiç bir ibâdetini kabul etmeyecektir.» hadîsi Buhârî: «Hacc» ve «İ'tîsâm» bahislerinde tahrîc etmiştir. Kitabımızın «Hacc» bahsinde «Medine'nin fazileti» Bâbında dahi geçmişti. Şerhi için oraya bakmalıdır. Burada yalnız bâzı cümlelerini îzâhla iktifa edeceğiz. murâd: Diyet olarak verilenlerdir. Hazret-i Alî'nin sahîfesinde bunların kaçar yaşında olmaları lâzım geldiği bildiriliyormuş. Gazab ve reddetmek; hayırdan uzaklaştırmaktır. Fakat burada ondan maksad, Medîne'de günah işleyen bir müslümanın ebediyyen cennet yüzü görmemesi değil, cennete doğrudan doğruya gireme-yip bir müddet âzâb olunmasıdır. Yani bu lanet kâfirler hakkında vârid olan lanetle aynı mânâda değildir. Onlar rahmet-i İlâhiyyeden tamamen mahrum kalacak ve ebediyyen cennet yüzü görmeyeceklerdir. Farz olan ibâdettir. Adl'den murâd ise nafiledir. Bunun aksini iddia edenler de olmuştur. Esmaî'ye göre sarf: Tevbe; adi de fidye mânâsına gelir. Bazıları: «Allah hiç bir ibâdetini kabul etmez.» demek onun ibâdetini rizâsiyle kabul etmez manasınadır; yoksa ibâdetiyle hak ettiği mükâfatını verir.» demişlerdir. Bu iki kelimenin mânâları hakkında daha başka birçok sözler söylenmiştir. zimmeti kâfirleri koruyacaklarına dâir verdikleri sözdür. Buna emân vermek denir. Bir müslüman, kâfirin birine emân verirse bütün müslümanların bu söze riâyet etmeleri gerekir; artık o kâfire hiç bir müslüman tasallut edemez",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 24
			}
		}
	]
}