{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"21": "The Book of Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3835,
			"arabicnumber": "1524.06",
			"text": "(Bize Muhammed b. Râfi\" rivâyet etti. ki): Bize Abdürrezzâk rivâyet etti. ki): Bize Ma'mer, Hemmâm b. Münebbih’den rivâyet etti. Hemmâm: Ebû Hüreyre'nin Resûlüllah (sallallahü aleyhi ve sellem)’den bize rivâyet ettiği şudur, diyerek bir takım hadîsler zikretmiş ezcümle şunu söylemiştir: Ebû Hüreyre dedi ki: Resûlüllah (sallallahü aleyhi ve sellem): memesinde sütü biriktirilen yeni doğurmuş bir deve yahut sütü biriktirilen bir koyun satın alırsa, onu sağdıktan sonra iki görüş arasında muhayyerdir. Ya hayvanı alsın yahut onu bir ölçek kuru hurma ile birlikte iade ersin!» buyurdu. hadîsini bütün «Kütüb-ü Sitte» sahipleri muhtelif lâfızlarla muhtelif râvilerden tahrîc etmişlerdir. Şafiî'nin tefsirine göre musarrât: Müşteriyi aldatmak için satıştan önce memeleri bağlanarak birkaç gün sağılmayan, bu suretle sütü biriktirilerek müşteriye sütlüymüş gibi gösterilen hayvandır. Bu kelimenin toplamak mânâsına gelen (sarer)’den mi yoksa aynı mânâda kullanılan (tasriye)’den mi alındığı hususunda ihtilâf vardır. Buhârî (tasriye)’den alındığına işaret etmiş; Buhârî sârini Aynî: «Sahîh olan da budur.» demiştir. Yeni doğurmuş iki veya üç aylık sütlü devedir. hadîs etrafında çok sözler söylenmiş; her taife kendi mezhebini haklı göstermeğe çalışmıştır. Şâfiîyye ulemâsından İmâm Nevevî şu îzâhâtı vermektedir: bir hayvanı satın alan müşterinin aldatıldığını anladığı zaman, hayvanı derhal mi yoksa üç gün müddetle mi İade hususunda muhayyer bırakıldığında ulemâmız ihtilâf etmişlerdir. Bazıları bu hadîslerin zahirlerine bakarak üç gün muhayyer bırakılacağını söylemişlerse de esah olan kavle göre muhayyerlik fevrî yani o ana mahsustur. Ulemâ bazı rivâyetlerdeki üç gün kaydını müşterinin o hayvanın musarrât olduğunu ancak üç gün içinde anlaması hâline hamlederler. Çünkü bu iş ekseriyetle üç günden az bir müddette anlaşılmaz. Hayvanın sütü ikinci gün bir parça azalırsa bu o gün az otlamak gibi bir arızadan ileri gelebilir; fakat üç gün aynı şekilde devam edince musarrâf olduğu anlaşılır. Bir de müşteri hayvanı sağdıktan sonra sahibine iade etmek isterse sağdığı süt az olsun çok olsun, hayvan ister deve, ister koyun veya sığır olsun onunla birlikte bir ölçek de kuru hurma verir. Bizim mezhebimiz budur. İmâm Mâlik ile Leys, İbn Ebî Leylâ, îmanı Ebû Yûsuf, Ebû Sevr ve muhaddislerin fukahâsı dahi buna kaildirler. Sahîh ve sünnete muvafık olan da budur. Ulemâmızdan Bazıları verilecek bir ölçek zahirenin hurmaya mahsus olmadığını, o yerde geçen zahireden bir ölçek verileceğini söylemişlerdir. Hanîfe, Irak ulemâsından bir taife, Mâlikîler'den Bazıları ve garîb bir rivâyete göre İmâm Mâlik hayvan iade edilirken bir ölçek hurma verilmeyeceğine kail olmuşlardır. Zira bir kimsenin malı telef edildiği zaman kaide şudur: Telef edilen mal mis-Üyâttan ise sahibine o malm misli; değilse kıymeti verilir. Bunlardan başka mallar bu kaideye muhaliftir. buna cevap vermiş ve: Bir mesele hakkında sünnet vârid oldu mu ona makûl ile i'tirâz olunamaz; demişlerdir. ölçek hurma ile takyîd buyurulmasınm hikmetine gelince: O zaman müslümanların ekseriyetle yiyecekleri bu olduğu içindir. Bir daha da şerîatin hükmü bu şekilde devam etmiştir. Sütün misli veya kıymeti değil de azma çoğuna bir ölçek hurma ile mukabele edilmesi, müracaat için bir merci' olsun ve bununla muhasamat ortadan kalksın di-yedir. Peygamber (sallallahü aleyhi ve sellem) muhasamatı kaldırmağa ve buna sebep olan şeyleri menetmeye çalışırdı. Bâzan memesinde süt biriktirilen hayvan bâdiye ve köylerde, bâzan da kıymet bilen mûtemed kimse bulunmadığı yerlerde satılabilir. Süt telef edilir; az mı çok mu olduğunda niza' çıkabilir. İşte şeriat müslümanlara münâkaşa götürmeyen bir esas vaz' etmiştir ki, o da bir Ölçek kuru hurmadır. Bunun nazırı diyet meselesidir. Diyet yüz devedir. Niza' kesmek için bu sayı Öldürülen kimsenin hâline göre değişmez...» izahatından sonra Hanefiyye ulemâsından Buhârî şârihî Aynî'nin bu hadîs hakkındaki bâzı sözlerini görelim. Aynî şöyle diyor: hadîsle ameli terk etmenin en kuvvetli vechi onun sekiz suretle kaidelere muhalif olmasıdır. Şöyle ki:",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 35
			}
		}
	]
}