{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"21": "The Book of Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3876,
			"arabicnumber": "1539.01",
			"text": "Bana Ebû't-Tâhir ile Harmele rivâyet ettiler. Lâfız Harmele'nindir. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihâb'dan naklen haber verdi. ki): Bana Saîd b. Müseyyeb ile Ebû Seleme b. Abdirrahmân rivâyet ettiler ki, Ebû Hüreyre şunları söylemiş: Resûlüllah (sallallahü aleyhi ve sellem): zahir oluncaya kadar meyveyi satın almayın! Kuru hurma mukabilinde yaş hurmayı da satın almayın!» buyurdular. Şihâb: «Bana Salim b. Abdillâh b. Ömer dahi babasından, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin tamamiyle mislini rivâyet etti.» demiş. Bâbın hadîslerinden Abdullah b. Ömer ile Câbir (radıyallahü anh) rivâyetlerini Buhârî ile Ebû Dâvûd «Kitâbü’l-Buyû'»da; ayrıca Câbir (radıyallahü anh) rivâyetini İbn Mâce «Ticâret»de; İbn Abbâs (radıyallahü anh) rivâyetini Buhârî «Buyû'»da tahrîc etmişlerdir. Bu hususta başka ashâb-ı kirâmdan da rivâyetler vardır. hepsi meyveyi kemâle gelmeden satmanın memnu' olduğunu göstermektedir. Kemâle gelmekten murâd: Sarı renkli meyvelerin sararması, kırmızı olanların kızarması, hububat ve sebzelerin de faydalanılır hâle gelmesidir. Bununla beraber mesele selef ulemâ arasında ihtilaflıdır. İmâm Leys ile Mâlikîler'e göre kemâle gelmekten maksat: Meyvelerin cinsidir. Şu halde bir beldenin bahçelerinden birinde meselâ; kirazlar kızarsa, o beldenin bütün meyve cinslerini —henüz kemâle gelmemiş olsalar bile— satmak caizdir. Yalnız Mâli kîler meyvelerin birbiri ardından olgunlaşmasını şart koşmuşlardır. Ahmed b. Hanbel meyvelerin ayrı ayrı her bahçede hattâ bir rivâyete göre her ağaçta müstakillen kemâle gelmesi lâzım geldiğini söylemiştir. her cins meyve ayn ayrı nazar-ı i'tibâra alınır. Hanef iler bu tafsilâta lüzum görmemişlerdir. meyvelerin satışı hususunda şâfiîler'den İmâm Nevevî şunları söylüyor: «Bir kimse meyveyi, derhal toplamak şartiyle henüz kemâle gelmeden satsa, satış bilittifak sahihtir. Ulemâmız diyorlar ki: Meyveyi toplamayı şart koşsa da sonra toplamasa satış sahihtir. Satıcı müşteriye o meyveyi toplatır. Alanla satanın meyveyi ağaçta bırakmak hususunda anlaşmaları da caizdir. Meyveyi ağaçta bırakmak şartiyle satmak icmâan bâtıldır. Zira çok zaman meyve kemâle gelmeden telef olur. Bu takdirde satıcı, dîn kardeşinin malını haksız yere yemiş olur. Lâkin meyveyi derhal toplamayı şart koşarsa bu zarar ortadan kalkar. Toplamayı şart koşmayıp mutlak olarak satarsa bizim mezhebimizle cumhûra göre satış bâtıldır. İmâm Mâlik'in kavli de budur. Ebû Hanîfe meyveyi toplama şartının vâcib olduğunu söylemiştir.» Aynî İmâm Nevevî'nin icmâ' iddiasını kabul etmemiş; bu meselede ulema arasında kuvvetli ihtilâf olduğunu kaydettikten sonra şunları söylemiştir: «İbn Ebî Leylâ ile Sevrî meyveyi olgunlaşmadan satmanın mutlak surette caiz olamayacağına kaildirler; bu babta icmâ' nakleden zât vehme kapılmıştır. Yezîd b. Ebî Habîb ise bu satışın mutlak surette hatta meyveyi ağaçta bırakmak şartiyle dahi caiz olduğunu söylemiştir; bu hususta icmâ' nakleden de vehmetmiştir.» bâbtaki tafsilât şöyledir: Sevrî. İbn Ebî Leylâ, İmâm Şafiî, İmâm Mâlik, İmâm Ahmed ve İshâk: Kızarmadıkça yahut sararmadıkça ağaç üzerindeki meyveyi satmak caiz değildir; demişlerdir. İmâm A'zam, İmâm Ebû Yûsuf ve İmâm Muhammed'e göre ise ağaçta meyve zuhur ettikten sonra olgunlaşmadan satmak caizdir. İmâm Mâlik ile İmâm Ahmed'in birer kavilleri de budur. Hanefîler'inbu bâbtaki delili Buhârî'nin Hazret-i Abdullah b. Ömer'den rivâyet ettiği bir hadîstir. Mezkûr hadîste Peygamber (sallallahü aleyhi ve sellem): kim tohumladığı bir hurmayı satarsa, o hurmanın meyvesi satana aiddir; meğer ki müşteri şart koşmuş ola.» buyurmuşlardır. ,hadîsin Tirmizî rivâyetinde şu ziyâde de vardır: «Ve her kim bir köle satar; kölenin de malı bulunursa onun malı salana aiddir; meğer ki, müşteri şart koşmuş ola!» «Bu hadîs hasen sahihtir.» demiştir. vechine gelince: Hadîs-i şerîf olgunlaşmadan meyve satmanın mubah olduğunu gösteriyor. Çünkü satışa şart koşulmaksızın dahil olmayan birşeyin şart koşulursa satılabileceğine delâlet ediyor. Burada şart koşulmadan satışa dâhil olmayan şey olgunlaşmamış meyvedir. Bâbımız hadîslerinden murâd: Ağacın meyvesini henüz meyve haline gelmeden satmaktır. Bu takdirde satıcı elinde mevcut olmayan bir şeyi satmış olur ki, Resûlüllah (sallallahü aleyhi ve sellem) buna men' etmiştir. beyanına göre ulemâdan bir cemaat bu hadîslerdeki nehyin tahrîm için değil, bir meşveret ve nasihat kabilinden olduğunu söylemişlerdir. Ashâb-ı kirâmdan bazıları hurmalarım kemâle gelmeden satar; sonra bir âfet dolayısiyle hurma olmayınca Peygamber (sallallahü aleyhi ve sellem)’in huzurunda birbirlerinden hak dâva ederlerdi. Bu hususta Buhârî, Nesâî ve Beyhakî Hazret-i Zeyd b. Sabit'den bir hadîs rivâyet etmişlerdir. Mezkûr hadîste Zeyd (radıyallahü anh) Şöyle demiştir: (sallallahü aleyhi ve sellem) devrinde halk kemâle gelmeden meyve satarlardı. Meyveler devşirilip hesaplaşma zamanı gelince müşteri: Yemişlere çürüme, küf ve balsıra arız oldu derdi. Yani bir takım afetler sayarak bunlarla ihticâc ederlerdi. Bu hususta huzuru risâlet penahilerinde dâvalar çoğalınca Peygamber (sallallahü aleyhi ve sellem) meşveret kabilinden: Meyvenin olgunluğu anlaşılmadan satış yapmayın! buyurdular.» İbn Ömer'in bir rivâyetinde (arâyâ) satışına ruhsat verildiğinden bahsedilmektedir. Arâyâ: Ariyyenin cem'idir. Satışı haram kılınanlardan hâriç kalan hurma demektir. Bunu şöyle îzâh ederler: Müzâbene yani ağaç üzerindeki hurmayı kuru hurma mukabilinde satmak yasak edilince bu meyanda ariyyeye müsaade buyurulmuştur. Ariyye, hurma ağacı ve parası olmayan ihtiyaç sahibi bir kimsenin çoluğuna çocuğuna taze hurma tattırmak maksadiyle elindeki kuru hurmayı verip göz kararı ile ağaçtaki taze hurmadan o miktar hurma satın almaktır. Esîr «En-Nihâye» adlı eserinde beş vesk (kile)’den az olmak şartiyle buna ruhsat verildiğini söyler. \"Nitekim bundan sonraki bâbda ariyye meselesi delilleriyle görülecektir. İbn Ömer'in bir rivâyetinde zikri geçen başak satışı hakkında Nevevî şunları söylüyor: «Bu hadîste İmâm Mâlik ile Kûfeliler'e ve ekser-i ulemâya delil vardır. Onlara göre daneleri katılaşan başağı satmak caizdir. Bizim mezhebe gelince: Bu hususta mezhebimizde tafsilât vardır. Başak arpa ve mısır gibi daneleri görünen hububattan ise satılması caizdir. Buğday gibi daneleri kavuzlu olup döğülmek suretiyle temizlenenlerden ise bu hususta şafiî'nin iki kavli vardır. Yeni mezhebine göre caiz değildir, ki esah olan da budur. Eski mezhebine göre caizdir. katılaşmadan hububatı satmak caiz değildir; meğer ki derhal biçmek şartiyle satıla. danesi katılaşmadan tarla İle birlikte şartsız olarak satmak —tarlaya tebean— caizdir. Olgunlaşmadan meyveyi ağacına tebean şartsız satmak da caizdir. Sebzelerin hükmü de böyledir. Onları da tarladan ayrı olarak satmak ancak kaldırmak suretiyle caiz olur. Olgunlaşmadan karpuz ve emsali şeyleri satmak dahi aynı hükme tâbidir. Bu meselenin feri'leri çoktur.»",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 75
			}
		}
	]
}