{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"21": "The Book of Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3960,
			"arabicnumber": "1550.04",
			"text": "(Bize Abdullah b. Abdirrahman Ed-Dârimî rivâyet etti. ki): Bize Abdullah b. Ca'fer er-Rakkî haber verdi. ki): Bize Ubeydullah b. Amr, Zeyd b. Ebî Üneyse'den, o da Abdülmelik b. Zeyd'den, o da Tâvûs'dan, o da İbn Abbâs'dan, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen rivâyet etti ki: kimsenin arazîsi olursa, şüphesiz onu dîn kardeşine menîha olarak vermesi daha hayırlıdır.» buyurmuşlar. hadîsi Buhârî ile Nesâî «Müzârea» bahsinde; Ebû Dâvûd «Buyû'»da; Tirmizî ile İbn Mâce «Ahkâm »da muhtelif râvilerden tahrîc etmişlerdir. Bir müddet sütünden ve yününden istifade ederek sonra tekrar sahibine iade şartiyle bir kimseye verilen koyun veya devedir. Kazzâz'in nakline göre menîha yalnız koyunla deveden olur. Ebû Ubeyd Araplar arasında menîhanm iki suretle yapıldığını söyler. Birinci surete göre menîha: Bir malı birine bağışlamaktır. İkinci surete göre ise bir deve veya koyunu bir müddet istifade için birine verip sonra tekrar geri almaktır. Bu kelimenin asıl mânâsı bağıştır. Burada da yeri başkasına muvakkaten bağışlamak; ücretsiz vermek mânâsına kullanılmıştır. şerifte muhabere kelimesi müzârea mânâsında kullanılmıştır. Nitekim Tirmizî'nin rivâyetinde muhabere yerine müzârea denilmiştir. Zâten bunların Hanefîler'ce aynı mânâya geldiklerini yukarıda görmüştük. rivâyette Tâvûs'un (onlar) diye işaret ettiği ashâbtan mu-râd: Râfi' b. Hadîc, amcaları ve Sabit b. Dahhâk, Câbir b. Abdillâh ile onlardan rivâyet edenlerdir. ki, ashâb-ı kirâmdan Bazıları Peygamber (sallallahü aleyhi ve sellem)’in muhabereyi yasak ettiğini rivâyet etmişler; buna mukabil İbn Abbâs (radıyallahü anh) yasak etmediğini söylemiştir. Zahiren bu iki rivâyet birbirine zıd ise de hakikatte aralarında zıddiyet yoktur. Çünkü yasak edilen muhabere fâsid şartlarla yapılandır. Fâsid şartlarla yapılmayan muhabere yasak değildir. İbn Abbâs (radıyallahü anh) am anlatmak istediği de budur. Bâzılarına göre «muhabereyi yasak etti» rivâyetiyle kerâhet-i tenzîhiyye, «yasak etmedi» rivâyetiyle de bu işin haram olmadığı kastedilmiştir. bu rivâyetlerdeki nehî, muhabere haram olduğu için değil, müslümanlar araşma fitne fesad girmesini önlemek içindir. Resûlüllah (sallallahü aleyhi ve sellem) tarlaların ücretsiz olarak emaneten verilmesini bunun için emir buyurmuştur. Zira ashâb arasında tarla ücreti yüzünden anlaşmazlıklar çıkardı. Hattâ kavga edip döğüşenler olmuştu. Tahâvî'nin Hazret-i Zeyd b. Sabit'ten rivâyet ettiği bir hadîste şöyle deniliyor: Dedi ki; Allah Râfi' b. Hadîc'i affetsin! Vallahi ben hadîsi onlardan dahi iyi biliyordum. Mesele şundan ibaretti: Ensârdan iki zât Resûlüllah (sallallahü aleyhi ve sellem)’e geldiler. Bunlar döğüşmüşlerdi. (sallallahü aleyhi ve sellem) de: ki hâliniz budur; öyleyse ekinlikleri kiraya vermeyin.» buyurdular. Râfi' (yalnız) «Ekinlikleri kiraya vermeyin» dediğini işitmiş. hadîs hakkında Tahâvî şunları söylemiştir: «işte Zeyd b. Sabit!.. Haber veriyor ki, Râfi'in işittiği (ekinlikleri kiraya vermeyin) hadîsindeki nehî bu işn haram olduğunu beyân için değil, ashabın aralarına şer girmesinden çekindiği içinmiş.» Zeyd b. Safait (radıyallahü anh) hadîsini Ebû Dâvûd, Nesâî ve İbn Mâce de tahrîc etmişlerdir",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 159
			}
		}
	]
}