{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3983,
			"arabicnumber": "1557",
			"text": "Bana arkadaşlarımızdan birçok kimseler rivâyet ettiler. (Dediler ki): Bize İsmâîl b. Ebî Üveys rivâyet etti. ki): Bana kardeşim, Süleyman yani İbn Bilâl'den, o da Yahya b. Saîd'den, o da Ebû'r-Ricâl Muhammed b. Abdirrahmâıvdan naklen rivâyet etti ki, annesi Amra binti Abdirrahmân şunları söylemiş: Ben Âişe'yi şöyle derken işittim: (sallallahü aleyhi ve sellem) kapıda yüksek sesle konuşan davacı sesleri işitti. Bir de baktı ki, biri diğerinden borcunu indirmesini istiyor; ondan bir şey hakkında hoş muamele rica ediyordu. O da: Vallahi yapamam, diyordu. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) yanlarına çıkarak: o iyilik yapmayacağına Allah'a yemin veren?» diye sordu. O zât: Benim yâ Resûlallah! (Borç indirimi ile hoş muameleden) hangisini dilerse onun olsun! dedi. hadîs İmâm Müslim'in «Sahîh»inde maktu' olarak rivâyet ettiği on iki hadisten biridir. Kâdî Iyâz bu hususta şunları söylemiştir: «Râvi (Bana birçok kimseler rivâyet etti) yahut (bana sika bir zat rivâyet etti) veya (bana arkadaşlarımızdan bâzısı rivâyet etti) derse o hadis, bu fennin ulemasınca ne maktû'dur; ne de mürsel veya mu'dal; belki meçhul bir kimseden rivâyet kabîlindendir.» Kâdî'nin sözünü tasdik ettikten sonra: «Lâkin ne olursa olsun bu hadîs başka bir tarîkten sabit olmasa bu metinde bu rivâyetle ihticâc olunamazdı. Ama başka tarikten sabit olmuştur. Buhârî onu «Sahîh»mde İsmâîl b. Ebî Üveys'den rivâyet etmiştir. İhtimâl Müslim (birçok kimseler) sözü ile Buhârî ve başkalarım kasdetmiştir. Müslim bu İsmâîl'den «Hacc» bahsinde ve «Cihâd»m sonunda vasıtasız olarak rivâyette bulunmuştur. ..» diyor. Hadîsi Nesâî dahi rivâyet etmiştir. gibi rivâyetlere Bazıları «munkati'» Bazıları «muallâk» demiş; Ebû Dâvûd ise onları «mürsel» saymıştır",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 22
			}
		}
	]
}