{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3992,
			"arabicnumber": "1559.06",
			"text": "Bana Muhammed b. Ahmed b. Ebî Halef ile Haccâc b. Şâir de rivâyet ettiler. (Dediler ki): Bize Ebû Selemete’l-Huzâî rivâyet etti. (Haccâc: Mansûr b. Seleme, dedi.) ki): Bize Süleyman b. Bilâl, Huseym b. Irâk'dan, o da babasından, o da Ebû Hüreyre'den naklen haber verdi ki, Resûlüllah (sallallahü aleyhi ve sellem): kimse iflâs eder de, biri malını onun elinde aynen bulursa, o mal (ı almay) o (başkasından) daha haklıdır.» buyurmuşlar. hadîsi Buhârî «Kitâbül-istikrâz»da; Ebû Dâvûd, Tirmizî ve Nesâî «Buyû'»da; İbn Mâce «Ahkâm»da muhtelif râvilerden tahrîc etmişlerdir. şerif Şâfiiler'e göre satış; Hanefîler'ce ise gasb, emanet ve emsali hakkında; vârid olmuştur. Bu bâbta: İbn Huzeyme, İbn Hibbân ve İmâm Mâlik dahi hadisler rivâyet etmişlerdir. Bir mal satın alıp da iflâs eden yahut Ödemeden ölen ve aldığı mal olduğu gibi durduğu halde başka malı olmayan bir kimse hakkında ulema ihtilâf etmişlerdir. b. Ebî Rabâh, Urvetü'bnü Zübeyr, Tâvûs, Şa'bî, Evzâî, Ubeydullah b. Hasen, İmâm Mâlik, Şafiî, Ahmed b. Hanbel, İshâk ve Dâvûd-u Zahirî bu hadisin zahiri ile istidlal ederek: «Bir adam iflâs eder de elinde satın aldığı bir maî bulunursa, o malı satan şahıs malını almaya diğer alacaklılardan daha haklıdır.» demişlerdir. Ebû Ömer İbn Abdilberr, Hicaz fuka-hâsı île muhadişlerin, bâzı feri' meselelerinde ihtilâf etmekle beraber bu hadisin umumu ile istidlal hususunda ittifak hâlinde olduklarını kaydettikten sonra şunları söylemiştir: «Sattığı malı olduğu gibi müflisin elinde bulan bir kimse malını geri almak ister de diğer alacaklılar buna razı olmaz, ona malının parasını ceplerinden vererek o malı kendileri almak ister; alırken fazlasına da el koyarlarsa caiz olur mu olmaz mı meselesinde Mâlik Me Şafiî ihtilâf etmişlerdir. İmâm Mâlik: Alacaklıların buna hakkı vardır; onlar malın parasını verirlerse mal sahibi malını geri alamaz, demiş; Şafiî ise bu hususta alacaklılara söz hakkı olmadığını söylemiş ve ; Bu malı müflis ile mirasçılarının almaya haklan yoksa alacaklıların hiç de olmaz; burada ancak malı satana muhayyerlik vardır, isterse malını ahr; dilerse almaz da diğer alacaklılarla birlikte o mala ortak olur; çünkü Peygamber (sallallahü aleyhi ve sellem) o malda sahibine, alacaklılardan daha fazla hak tanımıştır; demiştir. Ebû Sevr ile İmâm Ahmed'in ve bir cemaatin kavilleri de budur. Şafiî, mal sahibi parasının bir kısmını alırsa ne hüküm verileceğinde de ihtilâf etmişlerdir. İbn Vehb ile başkalarının Mâlik'den rivâyetlerine göre mal sahibi dilerse'aldığı meblağı iade ederek malını alabilir. Şafiî Şöyle deditir: Satılan mal bir köle olur da yarı parasını aldıktan sonra iflâs vuku' bulursa, kölenin yansı sahibinin olur; zîra para kölenin aynına mukabildir. Kalan yansım da alacaklılar nâmına satar. Aldığı paradan bir şey iade edemez; çünkü alacağını almıştır. İmâm Ahmed'in kavli de budur. tevkif edilmeden ve mahkemece iflâsına hüküm verilmeden ölmesi hâlinde dahi ihtilâf etmişlerdir. İmâm Mâlik, müflisin ölü hükmünde olmadığını, ölüm hâlinde mal sahibi malını aynen bulduğu takdirde diğer alacaklılarla beraber olacağın;, iflâs halininse böyle olmadığını söylemiştir. İmâm Ahmed'in kavli de budur. nâm eserde: Hadîsin muktezâsı, mal sahibinin dönebil-mesidir; ister paranın bir kısmım almış olsun; çünkü hadîs mutlaktır; deniliyor. Şafiî'nin yeni kavli budur. Eski kavlinde buna muhalefet etmiş, sadece paranın kalan kısmında alacaklılarla ortak olacağını söylemiştir.» hadîsin: «Bir kimse malını olduğu gibi bulursa...» cümlesiyle istidlal ederek mal sahibinin malını alabilmesi için onu olduğu gibi, hiç değişmemiş bulmasını şart koşmuşlardır. Mal azalmak gibi zâtında yahut sıfatlarından birinde değişikliğe uğramışsa, sahibi diğer alacaklılarla beraber olur. Buhârî şârihi Aynî, Şâfiîler’den birinin bu bâbta uzun tafsilât verdiğini söylemiş ve bu tafsilâtı kitabında nakletmiştir. Nehâî. Hasan-ı Basrî, bir rivâyette Şa'bî, Vekî' b. Cerrah, Abdullah b. Şubrume , Ebû Hanîfe, Ebû Yûsuf, Muhammed b. Hasen ve Züfer'e göre malı satan kimse sair alacaklılar gibidir, Ömer b. Abdilâzîz'den sahih senetle rivâyet olunmuştur ki: kimse sattığı malın parasından bir miktarını alır da sonra müşteri iflâs ederse, satanla diğer alacaklılar müsavî olur.» demiştir. Zührî'nin kavli de budur. Böyle bir kavil Hazret-i Alî'den de rivâyet olunmuştur. Katâde'nin Ha1Iâs b. Amr vasıtasiyle Ali (radıyallahü anh) dan tahrîc ettiği bu rivâyette: satan onu olduğu gibi bulursa, alacaklılarla beraber olur.» denilmektedir. Hazret-i Ali'nin bu sözü: «Bu hususta sahabeden Osman'ın kavline muhalefet eden bilmiyoruz.» diyen İbn Münzir'in kavlini reddeder. Hazret-i Osmanin kavli şudur: Bir kimse birindeki alacağını aldıktan sonra hâkim borçluyu müflis ilân etse, artık o kimsenin aldığı kendinindir. Çünkü hassaten alacaklıların o mala karışma, haklan yoktur. Kim hak isbât ederse o alır. Fakat sattığı malı aynen müflisin elinde bulan onu almaya diğer alacaklılardan daha haklıdır. İşte İmâm Mâlik, Şafiî ve Ahmed b. Hanbel bu kaville amel etmişlerdir, ler'den Tahâvî Bâbımız hadîsi hakkında şunları söylemiştir: «Bu hadîste bir kimsenin aynen kendi malını bulmasından bahsediliyor; halbuki satılmış mal artık satanın kendi malı değildir; bu mal satmazdan önce onun idi. Bir adamın kendi malı ancak ondan gasber dilen yahut ödünç veya emaneten verdiği şeylerdir. Bu gibi mallarda o kimse diğer alacaklılardan daha haklı olur. Hadîs-i şerîf işte bu mânâda vârid olmuştur. Nitekim Hazret-i Semuratü'bnü Cündeb'den rivâyet olunan bir hadîs de buna delâlet etmektedir. Hadîs şudur: Resûlüllah \" (sallallahü aleyhi ve sellem) ; kimsenin eşyası çalınır yahut kaybolur da, onu bir adamın elîn-de olduğu gibi bulursa, o kimse aynen o eşyayı almaya en ziyade hak sahibidir. Müşteri parasını satıcıdan geri alır.» buyurdular.) hadîsi Taberân'î dahi tahrîc etmiştir. Hadîs-i şerif, Ebû Hüreyre hadîsinden murâd: Emânet, ödünç ve mağsub gibi mallar olduğunu beyan ediyor; böyle bir malı sahibi, olduğu gibi bir kimsenin elinde bulursa almağa hakkı vardır. Diğer alacaklıların onda hakkı yoktur; zîra sahibinin miîkinde bakîdir; gâsıbm ve keza hırsızın elinde bulunması zulüm ve tecâvüz yolu ile olduğu için milkiyet ifâde etmez. Ama malı satarak müşteriye'teslim etmek böyle değildir. Satış, malı sahibinin milkinden çıkarır velev ki parasını almamış olsun.» Hazret-i Semûra hadîsinin râvilerinden Haccâc b. Ertat hakkında söz edenler olmuşsa da yersizdir. Ondan İmâm A'zam, Sevrî, Şu'be ve İbn Mübarek gibi büyükler hadîs rivâyet etmiş; Iclî , Ebû Zür'a, İbn Hibbân ve Hatîb gibi birçok hadis uleması onun sika. sadûk, fakîh ve hafız olduğunu söylemişlerdir. beyânına göre kendilerinde teassub eseri görülen bâzı zevat Hane filer hakkında âdaba aykırı sözler söylemişlerdir. Meselâ: Kurtubî; «Hanef iler'den Bazıları bu hadisi hiç bir esasa dayanmayan bir takım te'vîllerce tefsire kalkışmışlardır.» demiş; «Hanefîler onu zaif ve merdûd bir takım te'vîllerle tefsir ettiler.» mütâleasında bulunmuş: İbn Battal: Hanefîler satıcının alacaklılarla müsavi olduğunu söylerler. Tefsir hadîsini kıyâsla reddederek: Satılan mal müşterinindir; parası da onun zimmetindedir, derler.» şeklinde söze başlayarak Hanefîler'e cevaplar vermiş; hattâ «Tevdîh» sahibi: «Ebû Hanîfe bu hadisi, içinde satış zikredilmemiştir bahanesiyle gasb ve emânete hamletmiş; onu zaif, merdûd te'vîllerle tefsir etmiş; Alî ile İbn Mes'ûd'dan rivâyet olunan sübût bulmamış bir şeye takılmış kalmıştır..,» diyecek kadar ileri gitmiştir. Hanefîler tarafından bu zevatın her birine ilmî ve rcmknf cevaplar vermiştir. Bunlar «Umdetül-Kaarî»nin «İstikraz» bahsinde görülebilir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 31
			}
		}
	]
}