{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4015,
			"arabicnumber": "1569",
			"text": "(Bana Seleme b. Şehîb rivâyet etti. ki): Bize Hasen b. A'yen rivâyet etti. ki): Bize Ma'kil, Ebû'z-Zübeyr'den rivâyet etti. ki): Cabir'e (satılan) köpekle kedinin paralarını sordum: (sallallahü aleyhi ve sellem) bundan menetti.» dedi. hadîsin Ebû Mes'ûd-u Ensâri rivâyetini Buhârî «Büyü'», «İcâre», «Talâk» ve «Tıbb» bahislerinde; Ebû Dâvûd «Kitâbü'l-Buyû'»da; Tirmizî «Büyü'» ile «Nikâh» bahislerinde; Nesâî «Nikâh» ve «Sayd»da; İbn Mâce «Ticârât»da muhtelif râvilerden tahrîc etmişlerdir. Tirmizî bu bâbda: Ömer, Ali, İbn Mes'ûd, Câbir, Ebû Hüreyre, İbn Abbâs, İbn Ömer ve Abdullah b. Ca'fer (radıyallahü anhûm) hazerâtından da hadîsler rivâyet olunduğunu söyle-. miş; kendisi Bâbımız rivâyetlerinden Sâib b. Yezîd'in Râfi' b. Hadîc'den naklettiği hadîsi de tahrîc etmiştir. Mezkûr hadîsi Ebû Dâvud, Nesâî ve İbn Mâce dahi rivâyet etmişlerdir: sarihi Aynî, Tirmizî'nin işaret ettiği zevatın hadîslerini ve bu hadîsleri kimlerin tahrîc ettiğini göstermiş; bu bâbda: Ebû Cuheyfe, Abdullah b. Amr, Enes b. Mâlik, Sâib b. Yezîd ve Meymûne binti Sa'di (radıyallahü anhüm)'dan da hadîsler rivâyet olunduğunu söylemiştir. Hülâsası şudur: Ömer hadîsini Taberânî «El-Kebîr»inde; Ali (radıyallahü anh) hadîsini İbn Adiy «El-Kâmil» adlı eserinde tahrîc etmişlerdir. İbn Mes'ûd hadîsini kimin tahrîc ettiği beyan edilmemiştir. (radıyallahü anh) hadîsini Müslim,- Ebû Dâvûd ve Tirmizî tahrîc etmişlerdir. Bâbımızın son rivâyeti bu hadîstir. Hüreyre hadîsini Ebû Dâvûd, Nesâî, İbn Mâce ve Hâkim; İbn Abbâs (radıyallahü anh) hadîsini Ebû Dâvûd ile Nesâî; İbn Ömer hadî'sini İbn Ebî Hatim tahrîc etmişlerdir. Fakat İbn Ömer rivâyeti hakkında: «Bu hadîs münkerdîr.» denilmiştir. b. Ca'fer hadîsini İbn Ebî Adiy «El-Kâmil» nâm eserinde rivâyet etmiştir; bu hadîs de zaîftir. Cuheyfe hadîsini Buhârî, Abdullah b. Amr hadîsini Hâkim «El-Müstedrek» adlı eserinde; Enes (radıyallahü anh) hadîsini İbn Adiy; Sâib b. Yezîd hadîsini Nesâî, Meymûne hadîsini de Taberâhî tahrîc etmişlerdir. Bu rivâyetlerin bâzılarında az çok ziyadeler vardır. Fakat köpek satmanın, fahişe mehrinin, kâhin ücretinin ve haccâmın kazancının yasak edilmesi hususunda hemen hepsi müttefiktir. mehrinden murâd: zinâ mukabilinde yahut haram olan nikâh karşılığında ona verilen paradır. Buna mehir denilmesi şeklen benzediği içindir. Hattâbî'nin beyânına göre kâhin: Gelecekte olacak şeyleri ve sırlan bildiğini iddia eden kimsedir. Çalınan şeyleri ve bunları kimin çalıp nereye götürdüğünü bilmekle meşgul olanlara «Arrâf» denir. Araplar arasında birçok kâhinler vardı. Bunların Bazıları gaibten kendilerine haber getiren cinnî arkadaşları olduğunu söyler; bir takımları gaib İşlerini anlamak için kendilerine hâs bir anlayışa sahip olduklarını iddia ederlerdi. Müneccimlere kâhin, tabîblere arrâf ve kâhin diyenler de vardır. Bunlar nehîde dâhil değillerdir. Bahşiş, rüşvet mânâlarına gelir. Burada maksat, kâhine verilen ücrettir. Bu kelime: Kızının mehrinden babasının kendine pay ayırması mânâsında da kullanılır",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 54
			}
		}
	]
}