{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 403,
			"arabicnumber": "160.01",
			"text": "Bana Ebu't-Tahir Ahmed b. Amr b. Abdullah b. Amr b. Serh tahdis etti. Bize İbn Vehb haber verdi. Bana Yunus, İbn Şihab'dan haber verdi. Bize Urve b. Zubeyr'in tahdis ettiğine göre Nebi (Sallallahu aleyhi ve Sellem)'in zevcesi Aişe kendisine haber vererek dedi ki: - Resulullah (Sallallahu aleyhi ve Sellem)'e vahyin ilk başlangıcı, uykuda gördüğü sadık rüya olmuştu. Gördüğü her bir rüya mutlaka sabahın aydınlığı gibi çıkardı. Sonra ona tenhada yalnız kalmak sevdirildi. Bundan dolayı Hira mağarasında yalnız başına aile halkının yanına dönmeden önce birkaç gece tahannüs ederdi -ki o taabbud demektir.- Bunun için yanına azık da alırdı, sonra Hatice'nin yanına döner yine o kadarlık bir süre için azık alırdı. Nihayet o Hira mağarasında iken ansızın hak karşısına çıkıverdi. Melek ona gelerek: Oku dedi. O: \"Ben okuma bilmem\" dedi. (Allah Resulü) dedi ki: \"Melek beni aldı ve takatim kesilinceye kadar sıkıştırdı sonra da beni bırakarak: Oku, dedi. (Allah ResuIü) dedi ki: Ben: Ben okuma bilmem, dedim. Bunun üzerine Melek yine beni aldı, ikinci defa takatim kesilinceye kadar sıkıtı sonra salıverip, oku dedi. Ben: Ben okuma bilmem, dedim. Yine beni tutup, takatim kesilinceye kadar üçüncü defa sıktı sonra beni salıvererek şöyle dedi: \"Yaratan Rabbinin adıyla oku. O insanı (sülük gibi yapışan) bir kan pıhtısından yarattı. Oku, Rabbin en kerim olandır. O (kalemle) yazmayı öğretendir. İnsana bilmediğini öğretti.\" (Alak, 1-5) Resulullah (Sallallahu aleyhi ve Sellem), onlarla boyun etleri titreyerek geri döndü ve nihayet Hatice'nin yanına girerek: \"Beni örtün, beni örtün\" buyurdu. Onu örttüler. Sonunda üzerindeki korku gitti, sonra Hatice'ye: \"Ey Hatice bana ne oluyor\" deyip, ona olup biteni haber verdi ve: \"Kendim için korktum\" dedi. Hatice ona şöyle dedi: Asla! Sevin, Allah'a yemin ederim ki, Allah seni hiçbir zaman mahcup etmeyecektir. Allah'a yemin ederim ki sen akrabalık bağını gözetirsin, doğru konuşursun. Aciz kimselerin işlerini kendin yüklenirsin. Fakire verir, ona kazandınrsın, misafiri ağırlar ona ikram edersin, hak yolda çıkan musibetlere karşı yardımcı olursun. Sonra Hatice onu alıp Varaka b. Nevfel b. Esed b. Abduluzza'nın yanına götürdü. Varaka, Hatice'nin babasının kardeşi olan kendi amcasının oğlu idi. Cahiliye döneminde hristiyan olmuş bir kimse idi. Arapça yazı yazmayı bilir ve İncil'i de Allah'ın yazmasını dilediği kadar Arapça olarak yazardı. Oldukça yaşlı ve gözleri görmez bir ihtiyar idi. Hatice ona: Amcacığım, kardeşinin oğlunu bir dinle, dedi. Varaka b. Nevfel: Kardeşimin oğlu neler görüyorsun, dedi. Resulullah (Sallallahu aleyhi ve Sellem) kendisine neler gördüğünü haber verdi. Varaka ona: Bu Musa (aleyhisselam)'a indirilen namusdur. Keşke o zamanlarda gücü, kuvveti yerinde bir genç olsaydım, keşke kavmin seni çıkaracağı zaman hayatta olsaydım, dedi. Resulullah (Sallallahu aleyhi ve Sellem): \"Onlar beni çıkartacaklar mı ki\" buyurdu. Varaka: Evet, senin getirdiklerini getirip de kendisine düşmanlık edilmemiş hiçbir adam yoktur. Şayet senin o gününe yetişecek olursam sana bütün gücümle olabildiği kadar yardım ederdim, dedi. Diğer tahric: Buhari, 4953; Tuhfetu'I-Eşraf, 16706",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 308
			}
		}
	]
}