{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4079,
			"arabicnumber": "1591.05",
			"text": "(Bana Ebû't-Tâhir rivâyet etti. ki): Bize İbn Vehb, Kurre b. Abdirrahman El-Ma'âfirî ile Amr b. El-Hâris ve başkalarından naklen haber verdi; onlara da Âmir b. Yahya El-Ma'âfirî, Haneş'den naklen haber vermiş ki, Haneş Şöyle dedi: gazada Fadâle b. Ubeyd ile beraber bulunuyorduk. Derken bana ve arkadaşlarıma içinde altın, gümüş ve cevher bulunan bir gerdanlık isabet etti. Ben bunu satm almak isteyerek Fadâle b. Ubeyd'e sordum. Şu cevabı verdi: Bunun altınını çıkar da bir kefeye koy, kendi altınını da bir kefeye koy. Sonra sakın misli mislinden fazla bir şey alma! Zira ben Resûlüllah (sallallahü aleyhi ve sellem)'i: kim Allah'a ve âhiret gününe îmân ediyorsa sakın misti mislinden fazla bir şey almasın!» buyururken işittim. Müslim'in mu'temed nüshalarında gerdanlık ifadesiyle beyân olunmuştur. Birçok nüshalarda ise denilmiştir. Hatta Kâdî Iyâz ekseri üstadlannin nüshalarında bu şekilde zikredildiğini, fakat Ebû Alî El-Gasiânî'nin arkadaşında bu ifadenin kitabımızdaki şekilde tashih edilmiş gördüğünü, doğrusunun da bu olduğunu söyler. Fadâle (radıyallahü anh) hadîsiyle istidlal ederek: Başka bir şeyle karışık olan altın, gümüş az olsun çok olsun ayrılmadıkça satılamaz; ayrıldıkta altın tartısı tartısına yani kendi ağırlığınca; gümüş dahi aynı şekilde satılır; buğday ve tuz gibi sair ribâ mallarının hükmü de budur; derler. Bu kavil ashâb-ı kirâmdan Hazret-i Ömer (radıyallahü anh) ile oğlundan nakledilmiştir. Selef ulemâsından bir cemaat ile İmâm Ahmed, İshâk ve Mâlikîler'den Muhammed b. El-Hakem'in mezhepleri budur. A'zam'a göre başka madenle karışık bulunan altım, miktarca ondan daha fazla altın mukabilinde satmak caizdir. Bu'fazlalık altınla karışık bulunan diğer maden veya taşa mukabil verilir. Satılan karışık altınla safî altın birbirlerine müsâvî olursa akid caiz değildir. Safî altın karışıktan az olduğu takdirde dahi hüküm budur. Sevrî ile Hasen b. Salih bu meselede İmâm A'zam'la beraberdirler. diğer bir takım ulema karışık altın üçte bir veya daha az nisbette olmak şartiyle hâlis altın mukabilinde satılabilir; bu tekdirde satılan madendeki karışık altın o madene tâbi' olur; derler. Mâlikîler'den Hammâd b. Ebî Süleyman: «Karışık altını safî altın mukabilinde mutlak surette satmak caizdir; safî altının az veya çok yahut karışık olana müsavi olması hükmen müsavidir.» demiş ise de bu kavil hadîsin sarahati karşısında hatâ sayılmıştır",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 118
			}
		}
	]
}