{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 410,
			"arabicnumber": "161.05",
			"text": "Bize Muhammed b. el-Müsenna da tahdis etti. Bize Osman b. Ömer tahdis etti. Bize Ali b. el-Mübarek, Yahya b. Ebi Kesir'den bu isnat ile haber verdi ve (Allah Resulü): \"Onun yer i/e gök arasında arşın üzerinde oturmakta olduğunu görüverdim\" (buyurdu), dedi. Tahric bilgisi 404 ile aynı. DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın NEVEVİ ŞERHİ (401-408 numaralı hadisler): Bu babta bilinen meşhur hadisler yer almaktadır. Yüce Allah'ın izniyle sırasıyla lafızlarını ve manalarını ele alacağız. Senette (401): \"Ebu't-Tahir b. Ebu's-Serh\" vardır ki \"Serh\" isminin sin harfi fethalıdır. Aynı hadiste \"Aişe (r.anha) dedi ki ... sadık rüyadır.\" Bu hadis ashab-ı kiramın (r.a.um) mürsel rivayetlerindendir; çünkü Aişe (r.anha) bu olaya yetişmemiştir. Dolayısıyla o bunu ya Nebi (Sallallahu aleyhi ve Sellem)'den yahuı: bir sahabiden dinlemiştir. Daha önce fasıllarda sahabenin mürsel rivayetinin bütün alimler tarafından delil kabul edildiğini ancak bu hususta üstad Ebu İshak el-İsferayini'nin tek başına benimsediği kanaatin bir istisna teşkil ettiğini söylemiş idik. Allah en iyi bilendir. Aişe (r.anha}'nın \"sadık rüya\" ifadesi Buhari (rahimehullah)'ın rivayetinde \"salih rüya\" şeklinde olup, her ikisi de aynı anlamdadır. Aişe (r.anha}'nın: \"Gördüğü her bir rüya mutlaka sabah aydınlığı gibi çıkardı\" sözleri ile ilgili olarak dilbilginleri (sabah aydınlığı diye çevirdiğimiz) \"felakussubh\" ile \"ferakussubh\"ın sabah aydınlığı demek olduğunu söylemişlerdir. Bu tabir ise apaçık ve besbelli şey hakkında kullanılır. Kadı (rahimehullah) ve diğer ilim adamları şöyle demişlerdir: Resulullah (Sallallahu aleyhi ve Sellem}'e önce böyle bir rüyanın gösterilmekle başlanması melek ile karşılaşmasının çok ani olmaması, açık ve kesin nübüwetin ona ansızın gelmemesi içindi. (2/197) Çünkü beşeriyetin güçleri ona katlanamaz. Bundan dolayı nübüwetin özelliklerinin ilki ve ikram ve lütuf müjdelerinin birincisi olan sadık rüya ile diğer hadislerde geçen ışık görmek, taşların ve ağaçların ona nübuwetini zikrederek selam verdiklerini ifade eden seslerini işitmesi ile başladı. Aişe (r.anha}'nın: \"Sonra ona yalnızlık sevdirildi. .. ta ki aniden hak ile karşılaşıncaya kadar.\" Halvet (yalnız kalmak), salihlerin ve Allah'a çokça ibadet eden ariflerin bir halidir. Ebu Süleyman el-Hattabi (rahimehullah) dedi ki: Resulullah (Sallallahu aleyhi ve Sellem)'e uzletin (insanlardan ayrılmanın) sevdirilmesi bu hal ile kalbin başka meşguliyetlerden kurtulmasından ve bu halin düşünmeye, tefekküre yardımcı olmasından dolayıdır. Uzlet sayesinde insanlığın alışkanlıklarından uzaklaşır ve kalbi huşu duyar. Allah en iyi bilindir. Mağara: Dağdaki bir oyuktur. Çoğulu \"ğıran\" diye gelir. Meğar ve meğara ile ğar aynı anlamdadır. Küçültme ismi \"ğuveyr\" olarak gelir. Hira ise hı harfi kesreli, şeddesiz re ve sonu med iledir. Munsarıf ve müzekker isimdir, sahih olan budur. Kadı İyaz der ki: Bu lafız müzekker ve müennes de kullanılır ama müzekker kullanımı daha çoktur. Onu müzekker kabul eden aynı zamanda munsarıf olarak değerlendirir. Müennes görene göre ise munsarıf değildir. O takdirde de dağın bulunduğu bölgeyi veya ciheti kastetmiş olur. Yine Kadı İyaz dedi ki: Bazıları bu kelimeyi fethalı ha ve maksur elif ile: Hara diye söylemiş ise de bunun hiçbir kıymeti yoktur. Saleb'in öğrencisi Ebu Ömer ez-Zahid, Ebu Süleyman el-Hattabi ve başkaları der ki: Hadis alimleri ile avam \"hira\" isminde üç yerde hata ederler: Ha harfi kesreli olduğu halde fethalı telaffuz ederler, yine ra harfi fethalı olduğu halde kesreli telaffuz ederler, memdud olduğu halde elif'i kasr ile okurlar. Hira Mekke' den Mina'ya gidenin sol tarafında kalan Mekke' den yaklaşık üç mil uzaklıktaki bir dağdır. Tehannus: Hadiste teabbud olarak açıklanmıştır ve bu doğru bir açıklamadır. \"el-Hıns\" aslında günah anlamındadır. Tehannüs ediyor ise, hıns denilen günahtan uzak duruyor demek olur, sanki o yaptığı ibadet ile kendisini hıns (günah}den alıkoymuş olur. Teharruc ve teessüm de tehannüse benzer yani harec ve ism (vebal}den uzak durmak demektir. Aişe (r.anha)' nın: \"Belli sayıdaki geceler\" ifadesi taabbud ile değil tahannüs ile alakalıdır. Yani belli sayıdaki geceler tahannüs ederdi (ibadet ederdi). Eğer bu taabbud ile alakalı kabul edilirse mana bozulur. (2/198) Çünkü tehannüs için birkaç gece olma şartı aranmaz, aksine az ve çok süre hakkında kullanılır. Taabbud diye yapılan açıklaması ise Aişe (r.anha)'nın sözü arasına girmiş bir açıklamadır. Onun sözleri ise: \"Orada belli sayıda geceler de tehannüs ederdi\" şeklindedir. Allah en iyi bilendir. \"Aniden ona hak gelince\" aniden ona vahiy gelince demektir. Çünkü kendisi vahyin gelmesini beklemiyordu. Resulullah (Sallallahu aleyhi ve Sellem): \"Ben okuma bilmem\" sözü ben güzel okumayı beceremiyorum demektir. Buradaki \"ma\" olumsuzluk içindir, doğrusu budur. Kadı İyaz (rahimehullah) bununla ilgili olarak ilim adamları arasında görüş ayrılığından bahsetmektedir. Bazı ilim adamları bunu olumsuz (nafiye) olarak kabul ederken, bazıları bunu soru edatı (istifhamiye) diye kabul etmiştir. Halbuki haberin başına be harfinin gelmesi ile bu açıklama zayıf görülmüştür. Kadı İyaz der ki: Bunu \"(i ji lo): Ne okuyayım\" diye rivayet edenlerin bu rivayeti, buradaki ma'nın soru edatı olduğunu söyleyenlerin görüşünün sahih olduğunu ortaya koyar. Bununla birlikte bu edatın bu rivayette de olumsuzluk (nefy) edatı olması mümkündür. Allah en iyi bilendir. Resulullah (Sallallahu aleyhi ve Sellem) \"takatim kesilinceye kadar beni SIkıştırdı, sonra beni bıraktı\" buyruğuda, beni sıkıştırdı ve beni kucakladı, demektir. Gatta (tı ile) Gette (te ile) asara, halaka ve gameze fiilleri de hep aynı anlamdadır. (\"Takat\" anlamını verdiğimiz) \"el-cuhd\" kelimesinde cim harfi hem fethalı, hem ötreli söylenebilir. Bu da ileri derecede meşakkat ve zorluk demektir. \"el-Cuhd (takat)\" kelimesinin son harfi olan dal harfi nasb ile de ref ile de okunabilir. Nasb ile okunursa Cebrail beni takatim kesilinceye kadar sıkıştırdı anlamına gelir, ref ile okunursa (o beni sıkıştırınca) benim takatim adeta kesildi demek olur. Bu şekildeki iki okuyuşu zikredenler arasında et-Tahrir sahibi ve başkalan da vardır. \"Beni bıraktı.\" Beni salıverdi (sıkıştırmasını bitirdi) demektir. İlim adamları dedi ki: Bu sıkıştırmaktaki hikmet başka şeylere yönelmekten onu alıkoyup, ona söyleyecekleri ile kalbinin tam anlamıyla ve ileri derecede huzur ile ilgilenmesini sağlamaktır. Bu sıkıştırmanın üç defa tekrar edilmesi de dikkatini toplaması için bir mübalağadır. Bundan da ilim öğreten hocanın öğrencisinin dikkatini toplamasını sağlamakta ihtiyatlı olması ve ona kalbini uyanık tutmasını emretmesi gerektiği anlaşılmaktadır. Allah en iyi bilendir. Resulullah {sallallahu a1eyhi ve sellem)'in: \"Sonra beni bıraktı ve yaratan Rabbinin adıyla oku, dedi.\" Bu Kur'an-ı Kerim'den ilk inen buyrukların \"oku ... \" olduğunun apaçık delilidir. Selef ve haleften büyük çoğunlukların benimsedikleri doğru kanaat de budur. İlk indirilen buyrukların \"ey örtünüp bürünen\" (Müddessir, I) olduğu söylenmiş ise de bunun bir kıymeti yoktur. (2/199) Bunu bu babta bu hadisten sonra yeri gelince yüce Allah'ın izniyle sözkonusu edeceğiz. \"Bismillahirrahmanirrahim\" surelerin başında Kur'an-ı Kerim'den değildir diyen bazı kimseler de bu hadisi delil göstermişlerdir; çünkü burada bismillahirrahmanirrahim sözkonusu edilmemiştir. Surelerin başında bir ayet olduğunu kabul edenler ise besmele'nin ilk olarak nazil olmadığını ama surenin geri kalan kısmının başka bir zamanda indiği gibi, besmelenin de başka bir zamanda indiğini söyleyerek cevap vermişlerdir. Aişe {r.anha)'nın: \"Boyun etleri titriyordu\" sözlerinde titriyor, oynayıp duruyordu, demektir. Ebu Ubeyd ve diğer dilbilginleri ile Garibu'lHadis alimleri derler ki \"bevadir\" omuz ile boyun arasındaki ete denir. İnsan korktuğu zaman bunlar hareket eder, oynar. Raswullah {sallallahu a1eyhi ve sellem)'in: \"Zemmiluni zemmiluni\" demesi rivayetlerde bu şekilde iki defa tekrar edilmiştir. Beni elbiselerle örtün, elbiselerle beni sann, demektir. \"Kendim için korktum\" buyruğu ile ilgili olarak Kadı İyaz (rahimehullah) şöyle diyor: Bu kendisine yüce Allah'tan gelen (vahiy) hakkında şüphe ettiği anlamında değildir. O bu işi taşıyabilecek gücü bulamamaktan korkmuş ve vahyin yüklerini kaldıramayıp, öleceğinden çekinmiş olabilir. Yahut bu sözleri gerek uykuda, gerek uyanıkken gördüğü ilk müjde halleri ile melek ile karşılaşmadan ve Rabbinin risaletinin kendisine geldiğinden muhakkak olarak emin olmadan önce işittiği sesler ile ilgili olabilir. Böylelikle o bu halin kovulmuş şeytandan da olabileceğinden korkmuş olmaktadır. Ama melek kendisine şanı yüce Rabbinin risaletini getirdikten sonra, bu hususta onun şüphe etmiş olması asla mümkün değildir. Şeytanın ona baskı yapıp, etkilemiş olacağından asla korkulmaz. İşte peygamber olarak gönderilmesi ile ilgili hadiste bu türden varid olmuş bütün rivayetlerin bu yolla yorumlanması, anlaşılması gerekir. Kadı İyaz (rahimehullah)'ın Sahih-i Müslim şerhindeki sözleri bunlardır. O eş-Şifa adlı kitabında da bu iki ihtimali geniş açıklamalarla sözkonusu etmiştir ama bu ikinci ihtimal zayıftır. Çünkü hadisin açık ifadelerine aykırıdır. Zira bu hali meleğin onu kucaklayıp, sıkıştırmasından ve kendisine \"yaratan Rabbinin adı ile oku\" diye başlayan vahyi getirmesinden sonra olmuştu. Allah en iyi bilendir. Aişe (r.anha)'nın: \"Hatice ona: Asla, sana müjde ... dedi.\" Onun \"kella: asla\" sözü burada nefy ve uzaklaştırmak manasındadır. (2/200) Bu da bu edatın anlamlarından birisidir. Bazen gerçekten, bazen uyarmak için kullanılan \"ela\" anlamında kullanılır, bazen onunla söze başlanılır. Kur'an-ı Azimuşşan'da da birkaç türlü kullanılmıştır. İmam Ebu Bekr b. el-Enbari, elVakf ve'l-İbtida adlı eserinin bir babında bu edatın kısımlarını ve kullanıldığı yerleri bir arada zikretmiş bulunmaktadır. \"(......): Seni mahçup etmez\" ibaresinde ye harfi ötrelidir. Bu kelime (401 numaralı) Yunus'un ve (403 numaralı) Ukayl'in rivayetinde bu şekilde olmakla birlikte Ma'mer rivayetinde:\" (d; ~ '1): Seni üzmeyecektir\" anlamındadır. Diğer rivayet rezil olmak ve değerinin düşürülmesi anlamını ifade eder. \"S ıla-i rahim: akrabalık bağını gözetmek\" Akrabalara gözeten ve gözetilenin durumuna göre iyilik yapmak demektir. Bu bazen mal ile bazen hizmette bulunmakla, bazen ziyaretle, selam vermekle ve başka yollarla olur. \"el-Kell: Aciz\"in asıl anlamı ağırlıktır. Yüce Allah'ın: \"Kendisi de efendisine yük olan \"kell\" (Nahı, 76) buyruğu da bunun gibidir. Aciz olanın yükünün taşınmasının kapsamına zayıfa, yetime, aile halkına ve daha başkalarına infakta bulunmak da girer. Bu da bitkin düşmek demek olan \"el-keıaı\"den gelmektedir. \"Fakire, bir şeyi olmayana kazandırırsın\" ibaresinde fiilin te harfi fethalıdır, meşhur ve sahih olan budur. Kadı İyaz bunu çoğunluğun rivayeti olarak nakletmekte ve şunları söylemektedir: Bazıları ise bu harfi ötreli olarak rivayet etmişlerdir. Ebu'l-Abbas, Saleb ve Ebu Süleyman el-Hattabi ile dilbilginlerinden bir topluluk da \"kesebe\" ve \"eksebe\" fiillerinin aynı anlamda iki ayrı söyleyiş olmakla birlikte hepsinin ittifakı ile elifsiz olarak \"kesebe\" şeklinin olduğunu söylemişlerdir. \"Bir şeyi olmayana kazandırırsın\" ibaresinin anlamına gelince, te harfini ötreli olarak rivayet edenlere göre, sen bir şeyi olmayan senden başkasına mal kazandırırsın, kazanmasını sağlarsın, demek olur. Bu da senin malı o kimseye bağış olarak vermen anlamındadır. Bunun sen insanlara senden başka kimsede bulamayacakları oldukça nefis faydalı şeyler ve üstün ahlaki değerler verirsin anlamında olduğu da söylenmiştir. Te harfinin fethalı rivayeti ile ilgili olarak da anlamının ötreli okunuşu ile aynı olduğu söylendiği gibi, sen olmayan malı kazanır ve başkasının kazanmaktan, elde etmekten aciz olduğu kadarını sen elde edersin, demek olduğu da söylenmiştir. Çünkü Araplar özellikle de Kureyşliler olmayan malı kazanmakla birbirlerine karşı övünürlerdi. Nebi (Sallallahu aleyhi ve Sellem)'de ticaretinde oldukça kısmetli idi. Bu açıklamayı da Kadı İyaz, ed-Delail sahibi Sabit'ten nakletmektedir. Ancak bu açıklama zayıf yahut yanlıştır. Böyle bir yerde bu açıklamanın ne anlamı olur ki? Ancak ona bazı laflZlar ekleyerek doğru bir açıklama haline getirilmesi de mümkündür. Bu durumda da anlamı şöyle olur: Sen, senden başkasının kazanamayacağı kadar çok miktarda mal kazanır, sonra bunu çeşitli hayır yollarında ve faziletli alanlarda cömertçe harcarsın. Nitekim kendisi de aciz olanı taşıması, akrabalık bağını gözetmesi, misafire ikramda bulunması hak yolda karşılaşılan musibetlere yardımcı olması gibi sözünü ettiği faziletli haller buna benzer. Evet, bu kelime ile ilgili doğru açıklama budur (2/201). et-Tahrir sahibi der ki: Burada \"yoksul\" kazanmaktan aciz, hiçbir şeyi bulunmayan, muhtaç adam demektir. Ona yoksul (ma' düm) adının verilmesi ölmüş ve yok olmuş kişi gibi oluşundan dolayıdır; çünkü başkasının tasarrufta bulunduğu gibi, o da maişetinde tasarrufta bulunamamaktadır. Hattabi bunun doğru şeklinin vav'sız olarak \"el-mudem/el-mudim\" olduğunu söylemiştir. Ancak Hattabi'nin dediği gibi değildir, aksine ravilerin rivayet ettiği şekil doğrudur. \"Yoksula kazandırırsın\" ifadesinin aciz bir kimseyi arayıp, onun hayat bulmasını, canlanmasını sağlarsın, bunun için çalışırsın anlamında olduğu da söylenmiştir. \"Kesb: kazanmak\" istifade etmek, yararlanmak demektir. et-Tahrir sahibinin bu açıklamalarının bu laflZ ile ilgili belirttiğim gibi kısmen uygun tarafları olmakla birlikte doğru ve tercih edilen, az önce yaptığım açıklamadır. Allah en iyi bilendir. Hatice (r.anha) validemizin: \"Misafiri ağırlarsın\" ibaresinde te harfi fethalıdır. Misafire yedirilen yemeğe bu fiilden gelen isim olarak \"kıra\" denilir. Bu işi yapana (etken ortaç): karın denilir. \"Hak uğrundaki musibetlere yardımcı olursun\" sözlerine gelince, nevaib musibet demek olan naibe'nin çoğuludur. Hak musibet demesinin sebebi böyle bir olayın bazen hayır uğrunda, bazen şer uğrunda olmasının mümkün oluşundan dolayıdır. Lebid şöyle der: \"Hayır ve şerden türlü musibetler (hadiseler}in her ikisi de Hayır da uzayıp gitmez, şer de yapışıp kalmaz.\" İlim adamları (r.a) dedi ki: Hatice (r.anha)'nın söylediği bu sözlerin anlamı şudur: Sana hoşuna gitmeyecek bir şey gelip, isabet etmez; çünkü Allah seni üstün ahlaki değerlere ve oldukça büyük erdemlere sahip kılmıştır. Bunun da çeşitli örneklerini sözkonusu etmektedir. İşte bu, güzel ahlakın ve iyi hasletlerin kötü ve yıkıcı hadiselerden esen kalmaya sebep olacağını göstermektedir. Ayrıca bir maslahatı göz önünde bulundurarak bazı hallerde insanı yüzüne karşı övmek mümkündür. Diğer taraftan korkacağı bir hal ile karşı karşıya kalmış bir kimseyi teselli edip, onu müjdelemek ve ona esenliğe kavuşmasının sebeplerini zikretmek yerindedir. Ayrıca bunlarda Hatice (r.anha)'nın pek mükemmel, sağlam görüş sahibi, güçlü bir kişiliği, sapasağlam bir kalbi ve derinliğine anlayışı (fıkhı) pek büyük birisi olduğunun en büyük delili ve en açık bir belgesidir. Allah en iyi bilendir. Hatice (r.anha)'nın Varaka hakkında: \"Cahiliye döneminde hristiyanlaşmış bir adam idi\" sözleri hristiyanlık dinine girmişti demektir. Cahiliye ise Resulullah (Sallallahu aleyhi ve Sellem)'in risaletinden önceki dönemin adıdır. Onlara bu adın veriliş sebebi ileri derecede bir cehalet içerisinde bulunmaları idi. Allah en iyi bilendir. Hatice (r.anha)'nın: \"Arapça yazı yazardı. .. Allah'ın yazmasını dilediği kadarını yazardı.\" Müslim'de ibare bu şekildedir. Hem Arapça yazardı, hem de İncil'den Arapça yazardı, şeklindedir. Buhari'nin Sahihinin baş tarafında ise: \"O kitabı İbranice yazardı. İncil' den İbranice yazardı\" şeklindedir. Her ikisi de sahihtir. Bunların ifade ettiği mana da şudur: O hristiyanlık dinini İncil hakkında bazı çalışmalar yapacak kadar öğrenmişti. Oradan dilediği yeri isterse İbranice, isterce Arapça yazabiliyordu. Allah en iyi bilendir. \"Hatice (r.anha) ona: amcacığım kardeşinin oğlunu dinle, dedi.\" Diğer rivayette (403): \"Hatice: Ey amcamın oğlu ... dedi\" şeklindedir. Asıllarda bu şekildedir. Birinci rivayette amca, ikinci rivayette amcaoğlu denilmektedir. Her ikisi de doğrudur. İkincisinin doğru olması hadisin baş tarafında zikrettiği gibi gerçekten amcasının oğlu olduğundan dolayı böyle denilmiştir. Çünkü adı Varaka b. Nevfel b. Esed'dir. Kendisi ise Hatice bnt. Huveylid b. Esed' dir. Birincisinde ona amca demesi ise saygı için mecazen demiştir. Bu Arapların hitap adabındaki adetleridir. Küçük büyüğe ona saygı ve mertebesini yükseltmek maksadıyla, amca diye hitap eder. Amcamın oğlu hitabı ile ise bu maksat hasıl olmaz. Allah en iyi bilendir. Varaka'nın: \"Bu Musa (aleyhisselam)'a indirilen namustur\" sözünde de namus'tan kasıt, Cebrail (aleyhisseıam)'dır. Dilciler ve Garibu'l-Hadis bilginleri der ki: Sözlükte namus hayırlı bir sırrı saklayan kimsedir. Casus ise şer olan sırrı saklayan kişidir. -Sin harfi ile- \"nemese\" kökü ise gizleyip, saklamak demektir. Namese ise gizlice bir şeyler söylemek anlamındadır. Cebrail (aleyhisselam)'a namus denileceği üzerinde de ilim adamları ittifak etmişlerdir. Aynı şekilde burada onun kastedildiğini de ittifakla kabul etmişlerdir. el-Herevi dedi ki: Ona bu ismin veriliş sebebi yüce Allah'ın gaybı ve vahyi bildirme özelliğini ona tahsis etmiş olmasından dolayıdır. \"Musa (aleyhisselam)'a indirilen\" ibaresi de her iki sahihte ve diğer hadis kaynaklarında da bu şekildedir, meşhur olan da budur. Biz bunu Sahihin dışındaki kaynaklarda: \"İsa (aleyhisselam)'a inen\" diye rivayet etmiş bulunuyoruz. Her ikisi de sahihtir. Yine Varaka'nın: \"Keşke o zaman güçlü kuwetli olsaydım\" ifadesindeki \"o\" zamiri nübüwet günlerine ve süresine aittir. Keşke o günlerde genç ve güçlü birisi olsaydım da sana en ileri derecede yardımcı olabilseydim. Bu anlamda bu lafız aslında hayvanlar için kullanılır, burada bunu kendisi için istiare yoluyla kullanmıştır. \"Güçlü kuwetli\" anlamındaki \"ceza\" kelimesi Buhari ve Müslim'in Sahihlerinde ve diğer kaynaklarda meşhur olan rivayeti \"nasb\" iledir. Kadı İyaz der ki: İbn Mahan'ın rivayetinde ref ile gelmiştir. Buhari'de el-Asili rivayetinde de bu şekildedir. Bu rivayet açıktır, fakat nasb ile rivayeti açıklama hususunda ilim adamları ihtilaf halindedirler. el-Hattabi, el-Maziri ve başkaları (2/203) şöyle demektedir: Nasb ile okunması hazfedilmiş \"kane\"nin haberi kabul edilmesine binaendir. Bu Kufeli nahivcilerin mezhebine göre böyle gelebilir. Kadı İyaz der ki: Bana göre bu lafız halolarak nasbedilmiştir. \"Leyte\"nin haberi ise \"fiha: o zamanda, o vakitte\" lafzıdır. Kadı İyaz'ın tercih ettiği bu görüş yine hocalarımız arasından ve kendilerine güvenilen daha başkalarının tahkik ve bilgi ehli olanlarının tercih ettiği bir görüştür. Allah en iyi bilendir. Varaka'nın: \"Eğer senin gününe erişirsem\" yani peygamber olarak çıkacağın zamana kadar yaşarsam \"sana oldukça güçlü bir şekilde yardım ederim\" güçlü ve ileri derecede yardımcı olurum anlamındadır. Diğer rivayette (402): \"Bize Ma'mer haber verdi. Dedi ki: ez-Zührı dedi ki: Bana Urve de haber verdi\" ibaresi asıl nüshalarda da bu şekilde \"ve ahbaranı: ve bana haber verdi\" diye vav iledir, sahih olan budur. \"Bana haber verdi\" diyen ez-Zühri'dir. Buradaki vav'ın ince bir faydası vardır ki, daha önce birkaç yerde bunu açıklamıştık. O da şudur: Ma'mer, ez-Zühri'den çeşitli hadisler dinlemiş olup, ez-Zühri bunları rivayet ederken bana Urve şunu haber verdi ve bana Urve şunu haber verdi deyip, hadislerin tamamını rivayet eder. Ma'mer ilk hadisin dışında bir hadis rivayet etmek isterse şöyle derdi: ez-Zühri dedi ki: Bana Urve şunu da haber verdi deyip, işittiği gibi rivayet etmek için başa vav getirmiştir. Bu ise ihtiyat, tahkik, lafızları korumak ve bunlar için gereken dikkati göstermek türündendir. Allah en iyi bilendir. Yine bu rivayette yani (402) Ma'mer rivayetinde: \"Allah'a yemin ederim ki Allah seni üzmeyecektir\" demektedir ki buna dair açıklamayı daha önce yaptık. (2/204) Ukayli rivayetinde (403): \"Kalbi titriyordu\" ibaresine gelince, daha önce \"Yemenliler kalpleri en ince kimselerdir\" hadisinde kalp ile fuad arasındaki farkı açıklamıştık. Hatice (r.anha)'nm, Nebi (Sallallahu aleyhi ve Sellem)'in kalbinin titrediğini bilmesine gelince göründüğü kadarıyla o bunu gerçekten görmüştü. Görmemekle birlikte bunu halinin belirtilerinden ve şeklinden bilmiş olması da mümkündür. (404) \"Cabir b. Abdullah el-Ensari -ki Nebi (Sallallahu aleyhi ve Sellem)'in ashabındandı-\" şeklindeki ibareler hadiste zaman zaman tekrarlanan türden ibarelerdir. Onlara dikkat çekmek gerekir. Şöyle ki o (Ebu Seleme) \"Cabir' den -ki o Nebi (Sallallahu aleyhi ve Sellem)'in ashabındandı-\" diye rivayette bulunmuştur. Cabir b. Abdullah el-Ensari (r.a.)'ın ashab-ı kiramın en ileri derecede meşhurlarından birisi olduğu ise bilinen bir husustur. Hatta o Resulullah (Sallallahu aleyhi ve Sellem)'den en çok rivayet nakleden alb sahabiden biridir. Bunun cevabı şudur: Bazı raviler onun sahabi olduğunu bilmemesi ihtimali bulunan kimselere muhatap olmuşlardı. Bunu açıklayarak böyle bir yanılmayı ortadan kaldırmış sonra da bu şekilde rivayet devam etmiş bulunmaktadır. Eğer: Bu isnatta yer alan bu raviler üstün ve değerli imamlardır. Bunların Cabir'in sahabiliğini bilmemesi nasıl düşünülebilir denilecek olursa şöyle cevap verilir: Bu hususun bazılarına açıklanması ilimde ilerlemeden ve bilgi sahibi olmadan önceki küçüklük zamanında sözkonusu olmuştur. Sonra olgunluğa erişince bu hadisi duyduğu gibi rivayet etmiştir. Cabir hakkında sözünü ettiğim bu hususun bir benzeri ashab-ı kiram'ın birçoğu hakkında tekrar tekrar görülen bir husustur. Hepsi ile ilgili verilecek cevap da zikrettiğim şekildedir. Allah en iyi bilendir. \"Vahyin kesintiye uğraması (fetreti)\" ise vahyin gelmemesi, ardı arkasına inmemesi demektir. (2/205) Nebi (Sallallahu aleyhi ve Sellem)'in (404): \"Hira'da bana gelen meleği oturuyor gördüm.\" Asıl nüshalarda bu şekilde: \"(Ul.::-): oturuyor diye hal olarak nasb ile gelmiştir. Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Ondan korktum ... \" <--------------------------------------------------------------------------------------------------- İmam Nevevi burada Müslim'in 404 ve bundan sonraki rivayette bu kelimenin \"fecuistu\" ve \"fecusistu\" şeklindeki rivayetlerini ele almakta ve rivayet ihtilaflarım ortaya koymakta, muhakemelerini yapmakta ve rivayetler arasındaki farkın pek önemsenmemesi gerektiği sonucuna ulaşmaktadır. (Çeviren) ---------------------------------------------------------------------------------------------------> Bu lafzın anlamına gelince, her iki rivayette aynı anlamdadır. Yani bu kelimenin peltek se ve diğerinin hemze ile rivayeti korktum, dehşete düştüm anlamındadır. Buhari'nin rivayetinde de \"feruibtu: korktum, dehşete düştüm\" diye kaydedilmiştir. Resulullah (Sallallahu aleyhi ve Sellem)'in (405): \"Yere düştüm\" ibaresine gelince: Burada mı başına hemze getirilmeksizin ziyadesiz olarak gelmiştir ve bu doğrudur. Hemzeli olarak da kullanılır, o da aynı anlamdadır. İki ayrı söyleyiştir. Hemzesiz kullanılmayacağını söyleyenler ise yanlış yapmışlardır, bunu bilmemektedirler. Allah en iyi bilendir. \"Sonra vahiy hızlandı ve arka arkaya indL\" Hadisten \"hamiye: ısındı (hızlandı)\" ve \"tetabea: arka arkaya indi\" laflZlan aynı anlamdadır. Birini diğeriyle tekit etmiştir. Birinci kelime çokça indi ve arttı demektir. \"(....): Ateş ve güneş ısındı\" sözlerinden alınmıştır ki, harareti yükseldi, ısısı arttı demektir. \"İlk indirilen yüce Allah'ın: \"Ey örtünüp bürünen\" (Müddessir, 1) buyruğu olduğunu söylemek ise zayıftır hatta batıldır. Doğrusu ise kayıtsız ve şartslZ olarak ilk inenin Aişe (r.anha)'nın rivayet ettiği (401) hadiste açıkça ifade edildiği gibi \"yaratan Rabbinin adıyla oku\" (Nak, 1) buyruğudur. \"Ey örtünüp bürünen\" (Müddessir, 1) buyruğu ise, ez-Zühri'nin Ebu Seleme'den, onun Cabir' den diye naklettiği rivayette açıkça ifade ettiği gibi, vahyin fetret döneminden sonra inmiştir. Bu hadiste birkaç yerde açıkça görülmektedir. Bunlardan biri (404): \"Vahyin kesilmesinden söz ederken\" sözünden başlayıp: \"Sonra yüce ,.l\\llah: \"Ey örtünüp bürünen\" buyruklarını indirdi\" sözleridir. Yine Resulullah (Sallallahu aleyhi ve Sellem)'in (404): \"Bir de baktım ki Hira'da bana gelen melek\" sözü, daha sonra (406) sonra yüce Allah: \"Ey örtünüp bürünen\" buyruklarını indirdi\" ibaresi yine (404): \"Sonra vahiy arka arkaya geldi\" ifadesi bunlar arasındadır ki fetret döneminden sonra arka arkaya geldi demektir. O halde doğru olan ilk inen buyruğun \" ... oku\" buyrukları olduğudur. Vahyin fetret döneminden sonra ilk inen ise \"ey örtünüp bürünen\" (Müddessir, 1) buyruklarıdır. Müfessirler arasında ilk inen sure fatiha suresidir diyenlerin görüşleri ise, ayrıca sözkonusu edilmeyecek kadar açıkça batıl bir görüştür. Allah en iyi bilendir. Resulullah (salIallahu aIeyhi ve seIlem)'in (407): \"Vadinin iç tarafından geçtim\" yani, onun iç tarafında idim. Cebrail (aleyhisseIam) hakkında: \"Onun havada arşın üzerinde olduğunu gördüm.\" ifadesinde arş'tan kasıt daha önceki rivayette geçtiği üzere kürsidir yani yer ile gök arasında bir kürsi üzerinde idi. Dilciler der ki: Arş, serir (taht) demektir. Krallık seriri (tahtı) denilmiştir. Şanı yüce Allah da: \"Ve onun (Sebe kraliçesinin) büyük bir arşı (tahtı) vardır.\" (NemI, 23) buyurmaktadır. Hava ise sema ile yer arasındaki boşluktur. Diğer rivayette belirtildiği gibi. Hava boşluk demektir. Nitekim yüce Allah: \"Kalpleri ise heva (bomboş) olacaktır.\" (İbrahim, 43) buyurmaktadır. Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Beni şiddetli bir titreme tuttu\" ibaresindeki \"titreme\" anlamındaki kelime olan \"recfe\" meşhur rivayetlerde bu şekilde re harfi iledir. Kadı İyaz dedi ki: es-Semerkandi ise bunu vav harfi ile \"vecfe\" olarak rivayet etmiştir. Her ikisi de sahihtir. Anlam itibariyle birbirine yakındır. Anlamları sarsılmak, çalkalanmaktır. Nitekim yüce Allah: \"O gün titreyecek (vacife) kalpler vardır.\" (Naziat, 8); \"O günde sarsan sarsacak (tercufurracife)\" (Naziat,6); \"O gün yer ve dağlar sarsılacak (tarcufu)\" (Müzzemmil, 14) buyurmaktadır. Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Üzerime su dökünüz\" buyruğundan korkuya kapılmış kimsenin üzerine korkusunun dinmesi için su dökülmesi gerektiği anlaşılmaktadır. Allah en iyi bilendir. Yüce Allah'ın: \"Ey örtünüp bürünen\" (Müddessir, 1) buyruğunun tefsirine gelince: İlim adamları dedi ki: el-Müddessir ve el-müzzemmil aynı anlamda elbiselerine örtünmüş, onlara sarınmış kimse demektir. Cumhur elmüddessir'in elbiselerine bürünüp sarınmış anlamında olduğu kanaatindedir. el-Maverdi de İkrime' den şu anlamda bir görüş nakletmektedir: el-Müddessir nübüvvete ve onun yüklerine bürünmüş demektir. Yüce Allah'ın: \"Kalk ve uyar\" buyruğu ise, iman etmeyen kimseleri azaptan sakındır, demektir. (2/208) \"Rabbini yüceittikçe yücelt\" buyruğu da onu tazim et, ona layık olmayan her husustan onu tazim et, demektir. \"Elbiselerini tertemiz et. \" Necasetlerden elbiselerini temizle demek olduğu, elbiselerini kısa tut anlamında olduğu, elbiselerden kastın nefis olduğu da söylenmiştir. Yani nefsini günahlardan ve diğer eksikliklerden arındır. \"Pislik\" anlamındaki \"er-rucz\" kelimesi çoğunluk tarafından re harfi kesreli (er-ries) diye okunmuştur. Ama Hafs bunu ötreli (er-rucz) diye okumuş ve bunu kitapta putlar olarak açıklamıştır,. Müfessirlerden pek çok kimse de böyle demiştir. Sözlükte ise ricz azap demektir. Şirke, putlara tapmaya ricz denilmesinin sebebi ise azaba neden olmalarıdır. Ayetteki \"ricz\" den kastın şirk olduğu, günah olduğu, zulüm olduğu da söylenmiştir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 315
			}
		}
	]
}