{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4100,
			"arabicnumber": "715.15",
			"text": "Bize Osman b. Ebî Şeybe ile İshâk b. İbrahim rivâyet ettiler. Lâfız Osman'ındır, (İshâk: Bize haber verdi; tâbirini kullandı.) Osman: Bize Cerîr, Mugîre'den, o da Şa'bî'den, o da Câbir b. Abdillâh'dan naklen rivâyette bulundu, dedi. Câbir Şöyle dedi: (sallallahü aleyhi ve sellem)'le birlikte gazada bulundum. Altımda nerdeyse yürüyemez hâle gelmiş hasta bir sucu devem olduğu halde bana yetiştiler; ve bana: ne oldu?» diye sordular. Hastadır; dedim. Bunun üzerine Re- (sallallahü aleyhi ve sellem) ilerleyerek hayvanı sürdü ve ona dua etti. Bundan sonra hayvan bütün develerin önünde gitmeye başladı. Resûlüllah (sallallahü aleyhi ve sellem) bana: nasıl görüyorsun?» diye sordu. Afiyette (görüyorum), ona senin bereketin isabet etti; dedim. bana satar mısın?» buyurdu. Ben utandım. Ondan başka su taşıyan devemiz yoktu. Ama: Evet, dedim; ve Medine'ye varıncaya kadar sırtı benim olmak şartiyle deveyi kendilerine sattım. Ona: Yâ Resûlallah, ben damadım; diyerek kendilerinden izin istedim. Bana izin verdiler. Bunun Üzerine Medine'ye müteveccihen oradan ilerledim. Nihayet Medine'ye vardım. Beni dayım (Cedd b. Kays) karşıladı ve deveyi sordu. Onun hakkında ne yaptığımı kendisine haber verince beni ayıpladı. (sallallahü aleyhi ve sellem), kendisinden izin istediğim vakit: aldın, bakire mi, dul mu?» diye sormuştu. Ben kendilerine dul aldım; cevâbını verdim. oynaşacağınız bir bakire ile evfense idin ya!» buyurdu. Yâ Resûlallahî Babam vefat etti (yahut şehîd oldu). Küçük küçük kız kardeşlerim var. Onların emsaliyle evlenip de (karımın) onları terbiye edemiyeceğinden, onlara bakamayacağından korktum da onlara baksın ve terbiye etsin diye dul ile evlendim, dedim. ; (sallallahü aleyhi ve sellem) Medine'ye gelince deveyi kendilerine götürdüm. Bana parasını verdiler, deveyi de iade buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 139
			}
		}
	]
}