{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 411,
			"arabicnumber": "162.01",
			"text": "Bize Şeyban b. Ferruh tahdis etti. Bize Hammad b. Seleme tahdis etti. Bize Sabit b. Bunani'nin Enes b. Malik'ten rivayet ettiğine göre Resulullah (Sallallahu aleyhi ve Sellem) şöyle buyurdu: ''Bana beyaz renkli uzun, eşek'ten yüksek, katırdan alçak, gözünün değdiği son noktada ayağını koyan bir binek olan Burak getirildi. Ben buna binerek Beytu'l-Malkdis'e geldim. O'nu Nebilerin bağladığı halka'ya bağladım. Sonra Mescid'e girdim, iki rek'at namaz kıldım sonra çıktım. Cebrail (a.s.) bana içinde şarab bulunan bir kap ile süt bulunan bir kap getirdi. Ben sütü seçtim. Bunun üzerine Cebrail: Fıtratı seçtin dedi. Sonra bizi semaya çıkardı. Cebrail kapının açılmasını istedi. Sen kimsin diye soruldu, Cebrail dedi. Seninle birlikte kim var denildi. O: Muhammed, dedi. Ona (gelmesi için) gönderildi mi, denildi. O: Ona gönderildi, dedi. Bu sefer bize (kapı) açıldı. Adem'i karşımda buldum. Bana hoş geldin, merhaba dedi ve hayırla dua etti. Sonra bizi ikinci semaya çıkardı. Cebrail (aleyhisselam) kapının açılmasını istedi. Sen kimsin denildi, O: Cebrail dedi. Seninle kim var denildi. O: Muhammed, dedi. Ona (gelmesi için haber) gönderildi mi, diye soruldu. O: Evet, ona gönderildi ,dedi. Bunun üzerine bize kapı açıldı, bu sefer iki teyze çocuğu Meryem oğlu İsa ile Zekeriya oğlu Yahya ile -Allah'ın salat ve selamları onlara olsun- karşılaşıverdim. İkisi de bana hoş geldin dedi, bana hayırla dua etti. Sonra bizi üçüncü semaya çıkardı. Cebrail kapının açılmasını istedi, sen kimsin denildi. Cebrail, dedi. Seninle beraber kim var denildi, Muhammed dedi. Ona (gelmesi için) gönderildi mi denildi. O: Evet, ona gönderildi dedi. Bunun üzerine bize (kapı) açıldı. Orada da Yusuf {aleyhisselam} ile karşılaşıverdim. Bir de ne göreyim, güzelliğin yarısı ona verilmiş bulunuyor. O da beni güzel karşıladı ve bana hayırla dua etti. Sonra beni dördüncü semaya çıkardı. Cebrail (aleyhisselam) kapının açılmasını istedi. Kim o denildi, Cebrail dedi. Seninle beraber kim var denildi. Muhammed (Sallallahu aleyhi ve Sellem)'dedi. Ona (gelmesi için) gönderildi mi dedi. Cebrail: Evet ona gönderildi dedi. Bize kapı açıldı. İdris (aleyhisselam) ile karşılaşıverdim. O da beni hoş karşıladı ve bana hayırla dua etti. Aziz ve Celil Allah da: \"Ve biz onu yüksek bir yere kaldırdık.\" (Meryem, 57) buyurmaktadır. Sonra bizi beşinci semaya çıkardı. Cebrail kapının açılmasını istedi. Kim o denildi, Cebrail dedi. Seninle birlikte kim var denildi. Muhammed, dedi. Ona (gelmesi için haber) gönderildi mi, denildi. O: Ona gönderildi dedi. Bunun üzerine bize (kapı) açıldı. Bu sefer Harun (aleyhisselam) ile karşılaşıverdim O da beni hoş karşıladı ve bana hayırla dua etti. Sonra bizi altıncı semaya çıkardı. Cebrail (a.s.) kapının açılmasını istedi. Kim o denildi, Cebrail dedi. Seninle beraber kim var denildi. Muhammed {Sallallahu aleyhi ve Sellem}' dedi. Ona (gelmesi için haber) gönderildi mi denildi. O: Evet, ona gönderildi dedi. Bunun üzerine bize (kapı) açıldı. Musa (aleyhisselam) ile karşılaşıverdim. Beni hoş karşıladı ve bana hayırla dua etti. Sonra yedinci semaya Çıktı. Cebrail kapının açılmasını istedi. Kim o denildi, o Cebrail dedi. Seninle beraber kim var denildi. Muhammed (Sallallahu aleyhi ve Sellem) dedi. Ona (gelmesi için haber) gönderildi mi denildi. O: Evet, ona gönderildi dedi. Bu sefer bize (kapı) açıldı. İbrahim (aleyhisselam) ile sırtını el-Beytu'I-Ma'mur'a dayamış olduğu halde karşılaşıverdim. Bir de baktım ki ona her gün yetmiş bin melek giriyor ve bir daha ona geri dönmüyorlar. Sonra beni Sidretu'l-Münteha'ya kadar götürdü. Yapraklarının fillerin kulakları gibi olduğunu gördüm, meyveleri de küpler gibi idi. Allah'ın emrinden o ağacı bürüyen bürüyünce değişikliğe uğradı. Yüce Allah'ın yarattıklarından hiçbir kimse onun güzelliğini anlatamaz. Yüce Allah bana vahyettiklerini vahyetti. Bir gün bir gecede bana elli namazı farz kıldı. Musa'nın yanına indim. - Rabbin ümmetine neyi farz kıldı, dedi. Ben: Elli namaz dedim. O: Rabbine dön, ondan hafifletmesini dile, çünkü senin ümmetinin buna gücü yetmez. Ben İsrailoğullarını sınadım ve onları iyice tanıdım, dedi. (Allah Resulü devamla) buyurdu ki: Bunun üzerine Rabbime döndüm. Rabbim ümmetimin yükünü hafiflet, dedim. Benden beş vakit indirdi. Musa'nın yanına döndüm. Benden beş vakit indirdi, dedim. O: Ummetinin buna gücü yetmez. Rabbine dön ve ondan hafifletmesini dile, dedi. (Allah Resulü) buyurdu ki: Şanı yüce ve mübarek Rabbim ile Musa (aleyhisselam) arasında gidip gelmeye devam ettim. Nihayet: Ey Muhammed, bir gün ve bir gecede onlar beş namazdır, her bir namaz için de on (kat sevap) vardır. İşte böylece elli namaz oldular. Her kim bir iyilik yapmak ister de onu yapmazsa ona bir hasene olarak yazılır. Eğer onu yaparsa, bu sefer ona on hasene olarak yazılır. Kim bir kötülük yapmak ister de onu yapmazsa ona hiçbir şey yazılmaz. Şayet onu yaparsa ona bir günah olarak yazılır buyurdu. (Allah Resulü devamla) dedi ki: Sonra indim ve nihayet Musa (aleyhisselam)'ın yanına varıp, ona (durumu) haber verdim. O: Rabbine dön, ondan hafifletmesini dile, dedi. Resulullah (Sallallahu aleyhi ve Sellem) buyurdu ki: Bu sefer: Rabbime o kadar çok gidip geldim ki artık ondan haya ediyorum dedim. \" Yalnız Müslim rivayet etmiştir; Tuhfetu'I-Eşraf, 345",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 316
			}
		}
	]
}