{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4112,
			"arabicnumber": "1601.03",
			"text": "(Bize Muhammed b. Abdillâh b. Nümeyr rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Süfyân, Seleme b. Küheyl'den, o da Ebû Seleme'den, o da Ebû Hüreyre'den naklen rivâyette bulundu. Şöyle dedi: adam Resûlüllah (sallallahü aleyhi ve sellem)'den alacaklı olduğu bir deveyi istemeğe geldi de: kendi devesinden daha üstün bir baş deve verin!» buyurdu. Bir de: en hayırlınız, borç ödeme hususunda en iyi olanmizdır.» buyurdular. mânâda olan bu hadîslerden Ebû Hüreyre (radıyallahü anh) rivâyetini Buhârî «Vekâle» ve «İstikraz» bahislerinde; Nesâî «Buyû'»da; İbn Mâce «Ahkâm»da muhtelif râvilerden tahrîc etmişlerdir. Zâtü's-sinn yani muayyen bir yaş sahibi mânâsına gelir. Lügat kitaplarında devenin on yaşma kadar her yaşta ayrı isim taşıdığı zikredilir. Ebû Dâvûd bunları «Sünen»inde şöyle sıralamıştır: Huvar: Süt emen yavru deve; Fasîl: Memeden ayrılmış deve yavrusu; İbn mehâd: İki yaşına girmiş erkek yavru; dişisine Bintü mehâd derler. İbn Lebûn: Üç yaşma girmiş erkek yavru, dişisine Bintü Lebûn denilir. Hıkk: Dört yaşma girmiş erkek yavru, dişisine Hikka derler. Ceza': Beş yaşma girmiş erkek yavru, dişisine Cezea derler. Seniy: Altı yaşma girmiş erkek deve, dişisine Seniyye denir. Rabâi: Yedi yaşına girmiş deve, dişisine Rabâıyye derler. Sedîs yahut Sedes: Sekiz yaşına girmiş deve; Bâzilt Dokuz yaşına'girmiş deve; Muhallef: On yaşına girmiş deve demektir. Bu yaştan sonra devenin ayrıca adı yoksa da: «Bâ-zilu âm; Bâzilü âmeyn»; «Muhallefü âm, Muhallefü âmeyn, Muhallefü selâseti a'vâm...» diye isimler vererek on beş yaşına kadar çıkarlar. Devenin küçüğü mânâsına gelir. İnsanın küçüğüne çocuk denildiği gibi, devenin küçüğüne de Bekr, dişisine Bekra ve Kalûs denilmiştir. Kâdî Iyâz'ın beyânına göre mahsenin cem'idir; iyiler demektir, fakat ekseriyetle (ensen)’in cem'i olan (ehâsin) şeklinde kullanılır. Mehâsin aslında bedenin güzel yerleri demek olduğuna göre bu kelimenin «zevu'l-mehâsin» yani- güzel uzuvlara Mâlik mânâsında kullanılmış olması da ihtimâl dahilinde görülmüştür",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 151
			}
		}
	]
}