{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"23": "The Book of the Rules of Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4140,
			"arabicnumber": "1614",
			"text": "Bize Yahya b. Yahya ile Ebû Bekir b. Ebî Şeybe ve Is-hâk b. İbrâhîra rivâyet ettiler. Lâfız Yahya'nındır. Yahya (Bize haber verdi) tâbirini kullandı. Ötekiler: Bize İbn Uyeyne, Zührî'den, o da Aliy b. Hüseyn'den, o da Amr b. Osman'dan, o da Üsâme b. Zeyd'den naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem): kâfire; kâfir de müslümana mirasçı olamaz.» buyurmuş, dediler. beyânına göre irs ve mîrâs: Asıl itibariyle akıbet demektir. Bunun mânâsı bir kimseden diğerine intikaldir. müslümana mirasçı olamayacağı hususunda bütün İslâm uleması itt,ifâk halindedir. diyor ki: «Sahabe, tabiîn ve onlardan sonra gelen ulemanın cumhûruna göre müslüman da kâfire mî-rasç: olamaz. Bir taife müslümanı kâfire mirasçı yapmaya kail olmuşlardır. Bu kavil Muâz b. Cebel, Muâviye (radıyallahü anh) ile Saîd b. El-Müseyyeb, Mesrûk ve başkalarının mezhebidir. Aynı kavil Ebû'd-Derdâ', Şa'bî, Zührî ve İbrahim Nehaî'den de —aralarında bu hususta hilaf olmak üzere— rivâyet olunmuşsa da doğrusu bu zevatın kavilleri de cumhûrun kavli gibidir. Muhalifler «İslâm yücedir; onun üstüne geçilmez.» hadîsiyle istidlal etmişlerdir. Cumhûrun delili ise sadedinde bulunduğumuz sahîh ve sarih hadîstir. İslâm hadîsinde onlara hüccet yoktur. Zîra ondan murâd İslâm'ın başka dînlere olan üstünlüğüdür. Onda mirastan söz yoktur. Şu halde onunla amel ederek «Müslüman kâfire mirasçı olamaz...» hadîsinin nassi nasıl terk edilebilir? Her halde o taife bu hadîsi duymamış olacak!.. (yani müslümanlığı bırakıp başka bir dîne dönen kimse) bilicmâ' müslümana mirasçı olamaz. İmâm Şafiî, Mâlik, Rabîa, İbn Ebî Leylâ ve başkalarına göre müslüman da mürtedde mirasçı olamaz; mürtedin malı müslümanlar arasında ganimet olur. Hanife ile Küfe ulemâsı ve İshâk müslüman olan veresesinin mürtedde mirasçı olacaklarına kaildirler. Bu kavil Hazret-i Ali ile İbn Mes'ud (radıyallahü anh)'dan ve seleften bir cemaattan rivâyet olunmuştur. Lâkin Sevrî ile Ebû Hanîfe: Mürtedin riddet hâlinde kazandığı şeyler müslümanîann malıdır, demişlerdir, ötekilerine göre bütün malı müslüman olan veresesinin olur. birbirlerinden mirasçı olmalarına gelince: İmâm A'zam'la İmâm Şafiî ve diğer bir takım ulema yahudînin hı-ristiyana, hıristiyanın yahudîye, bunların mecûsîye ve mecûsînin bu iki millete mirasçı olabileceğine kaildirler. İmâm Mâlik bunu caiz görmemiştir. İmâm Şafiî: «Lâkin harbî zimmîye; zimmî harbîye mirasçı olamaz» demiştir. Ayrı ayrı memleketlerde bulunan iki harbî dahi birbirlerine mîrasçı olamazlar. Hanefîler'in kavli de budur",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 1
			}
		}
	]
}