{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"23": "The Book of the Rules of Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4144,
			"arabicnumber": "1615.04",
			"text": "(Bana bu hadîsi Muhammed b. Ala' Ebû Küreyb El-Hemdâni de rivâyet etti. ki): Bize Zeyd b. Hubâb, Yahya b. Eyyûb'dan, o da İbn Tâvûs'dan bu isnâdla Vüheyb ve Ravh b. Kâsım'in hadîsleri gibi rivâyette bulundu. hadîsi Buhârî, Ebû Dâvûd, Tirmizî ve Nesâî «Ferâiz» bahsinde muhtelif râvilerden tahrîc etmişlerdir. adı ile anılan mîras hisseleri Kur'ân'ı Kerîm'de: Yarı, çeyrek, sekizde bir, üçte iki, üçte bir ve altıda bir olmak üzere altı nevi'dir. Bu hisselerin kimlere verileceği dahi nass-ı Kur'ânüa beyân edilmiştir. Tafsilâtı fıkıh kitaplarındadır. şerifte geçen «evlâ» tâbiri daha lâyık mânâsına değil, daha yakın manasınadır. Bu kelime yakınlık mânâsına gelen «veyl»den alınmıştır. Nevevî şunları söylüyor: «Çünkü bu kelime burada (daha lâyık) mânâsına alınsa hiç bir faydası kalmaz; zira kimin daha lâyık olduğunu biz bilemeyiz.» Iyâz'ın beyânına göre bu hadîsin İbn Hâmân rivâyetinde «evlâ» yerine «ednâ» denilmiştir ki, bu da evlâ tâbirinin en yakın mânâsına kullanıldığını gösterir; çünkü ednâ: en yakın demektir. bir de bu hadîsteki «zeker» kelimesi üzerinde durmuşlardır. Zeker: erkek demektir. Bu kelimeden önce zikredilen «racûl» dahi erkek kişi mânâsına gelir. Şu halde mânâ: «Mîras hisselerinden artanı erkek olan erkeğindir.» demek olur. Onun için İbn'l-Cevzî ile Münzirî bu kelimenin mahfuz olmadığını söylemişler; İbn Salâh: «Rivâyet şöyle dursun bu kelime sahîh bile değildir.» demiştir. Ulemâdan bâzılarına göre burada erkeğin erkeklikle tavsif buyurulması mîras istihkakının sebebine tenbîh içindir. Bu sebep onun erkek oluşudur. Bir takımları te'kîd için getirildiğini iddia etmiş; daha başkaları, ra-cül kelimesinden şahıs mânâsı anlaşılmasın diye zikredildiğini söylemişlerdir. Hünsâdan ihtiraz için getirildiğini iddia edenler bile olmuştur. Fakat bu sözler i'tirazdan hali değildir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 5
			}
		}
	]
}