{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"27": "The Book of Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4264,
			"arabicnumber": "1649.02",
			"text": "Bize Abdullah b. Berrâd El-Eş'ari İle Muhammed b. Ala' El - Hemedânî rivâyet ettiler. Lâfızları birbirine yakındır. (Dediler ki): Bize Ebû Üsâme, Büreyd'den, o da Ebû Bürde'den, o da Ebû Mûsa'dan naklen rivâyette bulundu. Şöyle dedi: arkadaşlarım kendilerine yük devesi istemek için Resûlüllah (sallallahü aleyhi ve sellem)'e gönderdiler; çünkü darlık ordusunda —ki Tebûk gazasidır— onunla beraber idiler. Ben: Yâ Nebiyyallah! Arkadaşlarım beni yük devesi istemek için sana gönderdiler, dedim. Bunun üzerine: sizo hiç bir yük hayvanı veremem!» buyurdu. Kendisine öfkeli halinde rastlamışım ama bilmiyordum. Resûlüllah (sallallahü aleyhi ve sellem)’in bir şey vermemesinden mahzun olarak ve Resûlüllah (sallallahü aleyhi ve sellem) bana gücenmiştir diye korkarak geri döndüm; hemen arkadaşlarımın yanına giderek Resûlüllah (sallallahü aleyhi ve sellem)’in söylediklerini onlara haber verdim. Orada bir dakika durur durmaz Bilâl'in: Ey Abdullah b. Kays! diye seslendiğini işittim ve kendisine cevap verdim. Resûlüllah (sallallahü aleyhi ve sellem) seni çağırıyor; icabet et.» dedi. (sallallahü aleyhi ve sellem)'in yanına vardığımda: O anda Sa'd'dan satın aldığı altı deveyi göstererek: çifti, şu çifti ve şu çifti al da arkadaşlarına götür ve de ki: Size bu yük develerini Allah verdi (yahut Resûlüllah (sallallahü aleyhi ve sellem) verdi) artık bunlara binin!» Mûsâ sözüne şöyle devam etmiş: Ben de bu develeri arkadaşlarıma götürerek: Resûlüllah (sallallahü aleyhi ve sellem) bunları binmek için size gönderdi. Lâkin sizden biriniz benimle gelip de Resûlüllah (sallallahü aleyhi ve sellem)'den sizin için istekte bulunduğum zaman söylediği sözü işiten ve ilk defa vermeyişini sonradan verişini (gören) birine beraber gitmedikçe yakanızı bırakmam! Zannetmeyin ki onun söylemediği bir şeyi ben size söylemiş olayım, dedim. Bana şu cevabı verdiler: Vallahi sen bizim indimizde (doğruluğu) tasdik edilmiş bir adamsın. Dilediğini elbette yaparız. üzerine Ebû Mûsâ onlardan birkaç kişi ile birlikte yola revân olarak Resûlüllah (sallallahü aleyhi ve sellem)'in sözünü işiten ve onlara (evvelâ) bir şey vermeyip sonradan verdiğini görenlere gitmişler. Onlar da kendilerine tamamiyle Ebû Mûsa'nın anlattıklarını anlatmışlar",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 11
			}
		}
	]
}