{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"27": "The Book of Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4284,
			"arabicnumber": "1653.02",
			"text": "(Bize Ebû Bekir b. Ebi Şeybe de rivâyet etti. ki): Bize Yezîd b. Hârûn, Hüseyin'den, o da Abbâd b. Ebî Sâlih'den, o da babasından, o da Ebû Hüreyre'den naklen rivâyette bulundu. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): yemîn isteyenin niyetine göredir.» buyurdular. hadîsin şerhinde Nevevî şunları söylemiştir: «Bu hadîs, hâkimin yemîn istemesiyle edilen yemine hamlolunmuştur. Bir adam birinden bir hak dâva eder de hâkim yemîn ettirir ve yemîn eden şahıs niyetini gizleyerek hâkimin maksadından başka bir şey niyet ederse ye-mîni hâkimin niyetine göre mün'akid olur; niyetini gizlemesi ona bir fayda vermez. Bu bilittifak böyledir. Delili bu hadîs ve icmâ'dır. hâkim istemeden yemîn eder de niyetini gizlerse bu ona fayda verir; ve ister yemîn istenmeden doğrudan doğruya, isterse hâkim ve onun naibi olmayan biri tarafından vâki teklif üzerine yemîn etmiş olsun yemininden dönmüş olmaz. Hâkimden başka yemîn talep edenin niyetine itibâr yoktur. yemîn bütün hallerde yemîn eden kimsenin niyetine bağlıdır. Bundan yalnız kendisine teveccüh eden bir davada hâkim ile onun naibinin yemîn istemeleri müstesnadır. Bu yemîn (edenin değil) istenenin niyetine bağlı olur. Bu hadîsten murâd budur. Ama hâkim huzurunda onun teklifi olmaksızın bir dâvada biri yemîn ederse burada yemîn sahibinin niyeti mu'teber olur. Bu hususta Allah'a yemîn etmekle kadın boşamaya veya köle azadına yapılan yemîn arasında'fark yoktur. Şu kadar var ki, kadın boşamaya veya köle azadına yemîn vermeyi hâkim teklif ederse niyetini gizlemesi kendisine fayda verir; ve yemîn edenin niyetine itibâr olunur; çünkü hâkimin bu gibi şeylere yemin ettirmeye hakkı yoktur. O yalnız Allah'a yemîn teklif edebilir. da bilmeli ki, niyet gizlemekle yeminden dönülmüş olmazsa da bunu bir kimsenin hakkını iptal edecek yerde yapmak caiz değildir. Bu mesele de ulemâ arasında ittifâkîdir. Bu tafsilât İmâm Şafiî ve arkadaşlarının mezhebidir. Iyâz, İmâm Mâlik ile arkadaşlarından bu bâb-ta ihtilâf ve tafsilât nakletmiş ve şöyle deditir: Bir kimse kendisinden yemîn istenmeden ve yeminine bir hak teallük etmeden yemîn verirse sözü kabul edilip niyetine göre hüküm olunacağında ulemâ arasında hilaf yoktur. Fakat bir hak veya vesika için birine kendiliğinden yahut hâkimin hükmü ile yemîn ederse yemininin zahirine göre hükmolunaca-ğında da hilaf yoktur. yemîn sahibi ile Allah arasındaki hükmüne gelince: Bazıları, yemîn eden kimin için verildi ise onun niyeti mu'teberdir, demiş; bir takınılan yemîn edenin niyeti mu'teber olacağını söylemişlerdir. Hattâ: Yemîn teklif edilmişse kimin için yemîn verilirse onun niyeti, teklif edilmeden yapılmışsa yemîn edenin niyeti mu'teber olur, diyenler de vardır. Abdülmelik ile Stıhnûn'un kavilleri budur. İmâm Mâlik ile İbn'l-Kâsım'in zahir olan kavilleri de budur. Bunun aksine kail olduklarını söyleyenler de vardır, ki bunu Yahya İbn'l-Kâsım'den rivâyet etmiştir. Bazıları: Yemîn edenin aleyhine hükmolunmayacak husûsatta niyeti kendine fayda verir; aleyhine hükmolunacak hususta ise kendiliğinden yemîn etmesiyle teklifli yemîni birbirinden ayrılır, demişlerdir. Bu kavil dahi İbn’l-Kâsımden rivâyet olunmuştur. Mâlik'ten nakledildiğine göre: Hile ve kurnazlık yolu ile yapılan yeminin sahibi günahkârdır; yemîni de bozulmuştur, özürden dolayı yapılanda beis yoktur. İbn Habîb'in İmâm Mâlik'ten rivâyetine göre hile yolu ile yapılan yeminde yemîn sahibinin niyeti, bir hak uğrunda yapılanda kimin için yemîn edilirse onun niyeti mu'teber olur. Başkasının hakkına teallûk eden yeminde sahibi niyetini gizlese bile günahkâr olacağında hilaf yoktur",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 31
			}
		}
	]
}