{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"27": "The Book of Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4290,
			"arabicnumber": "1654.06",
			"text": "(Bana bu hadisi Süveyd b. Saîd de rivâyet etti. ki): Bize Hafs b. Meysera, Mûsâ b. Ukbe'den, o da Ebû'z-Zinâd'dan bu isnâdla bu hadîsin mislini rivâyet etti. Yalnız o; «Kadınların hepsi Allah yolunda mücâhede edecek birer oğlana gebe kalacak» dedi. hadîsi Buhârî: «Nikâh», «Cihâd», «Eymân» ve «Nüzûr», «Enbiyâ» ve «Tevhîd» bahislerinin altı yerinde; Nesâî: «Eymân» tahrîc etmişlerdir. geçen kadın dolaşmak tâbirinden murâd: Cinsî münâsebettir. Bu mânâ rivâyetlerin bâzılarında bir rivâyette fiiliyle ifâde olunmuştur ki, bunların ikisi de dolaşmak mânâsına gelen (tavaf) tandır. Yalnız birincisi sülâsî mücerd, ikincisi sülâsî mezîd olarak kullanılmıştır. Kelimenin başındaki (lâm) kasem lamıdır. muhtelif rivâyetlerinde Süleyman (aleyhisselâm)’ın zikrettiği kadın sayısı da muhteliftir. Bir rivâyette altmış, diğerinde yetmiş, başka birinde yüz, ötekinde doksan dokuzdur. Mamafih bu rivâyetler arasında münâfât yoktur; çünkü az olanını zikretmek, ondan fazlasını inkâr demek değildir. Bu mânâ ancak «mefhûm-ı aded» yolu ile çıkar ki, us'ul-i fıkıh ulemasının cumhûruna göre bununla amel edilmez. Süleyman (aleyhisselâm)’ın üç yüzü hurre, yedi yüzü câriye olmak üzere bin tane karısı bulunduğu rivâyet olunur. Kirmânî'nin beyanına göre Buhârî: «Esah olan doksandır.» demiştir. (aleyhisselâm)'a inşâallah demesini tavsiye eden arkadaşının kim olduğu ihtilaflıdır. Bazıları hadîsteki «arkadaşı yahut melek...» ifadesine bakarak bunun Cebrail (aleyhisselâm) yahut «Kirâmen Kâtibin »den bir melek olduğunu söylemişlerdir. Başka bir melek gönderilmiş olması da mümkündür. takımları: «Arkadaştan murâd: Süleyman (aleyhisselâm)’in ins veya cinden olan veziridir» demiş; hattâ bunun Âsaf İbn Berhıyâ olduğunu ileri sürenlerle hatır ve hayâlinden ibaret olduğunu iddia edecek kadar garabet gösterenler bile olmuştur. Hakikatte bu ihtilâflara mahal yoktur; çünkü Buhârî'nin bir rivâyetinde: melek: İnşâallah der ihtarında bulundu» denilerek arkadaşının melek olduğu tasrîh edilmiştir. Onun içindir ki Aynî: «Doğrusu bunun melek olmasıdır...» demiştir. Nevevî bu bâbta şunları söylemiştir: «Arkadaşından murâd melektir, diyenler olmuştur ki, hadîsin Lâfzından anlatılan da budur. Bazıları: Zevcedir demiş; bir takımları insanlardan bir dostu olduğunu söylemişlerdir...» anlaşılıyor ki, Süleyman (aleyhisselâm) bir gecede bu kadınların hepsi ile cima' etmiştir. Bu derece beden sıhhati, bu derece mükemmel erkeklik kudreti yalnız peygamberlere mahsus bir mevhibe-i İlâhiyyedir. Bir taraftan hadsiz hudutsuz İbâdet ve mücâhedeler, diğer taraftan nihayetsiz dünya meşgaleleri, irşâd ve tebliğ vazifeleri düşünülürse sair İnsanlara böyle bir işin asla müyesser olmayacağı derhal anlaşılır. Demek ki Hak Teâlâ Hazretleri peygamberlerine mu'cizeler halketmek suretiyle hârika haller yarattığı gibi, bu zevatın bedenlerinde de hârikalar halketmiştir. İşte Hazret-i Süleyman'in bir gecede yüz kadınla cima' takat getirmesi bundandır. peygamberlerden bu bâbta sarih bir haber yoktur. Ancak bizim Peygamberimiz Muhamed Mustafa (sallallahü aleyhi ve sellem)'e cima' hususunda otuz erkek kuvveti verildiği bildirilmiştir. Mücâhid, cennet erkeklerinden kırk erkek kuvveti verildiğini söylemişte. Hattâ bâzı büyüklerin ifâdesine göre her peygambere kırk erkek kuvveti; bizim peygamberimize ise kırk peygamber kuvveti ihsan edilmiştir. Bu hesaba göre Resûlü Ekrem (sallallahü aleyhi ve sellem) Efendimize bin altıyüz erkek kuvveti verilmiş demektir ki, bu takat her peygambere verilenin üstündedir. Avrupa küffârının izinden yürüyerek O'na utanmadan «karıcı» demek küstahlığırda bulunanlar azıcık düşünsünler!.. Yâ bu derece erkeklik kudreti kendilerine verilmiş olsa acaba ne yaparlardı?!.. Bizim sözümüz şudur: «Bu muazzam cinsî kudret karşısında Peygamber (sallallahü aleyhi ve sellem) Efendimizin dokuz kadınla iktifâ etmesi O'nun sonsuz sabır ve zühdünün açık ifadesidir...» (Aleyhîsselâm)'ın dili ile «İnşâallah» kelimesini söylememesini kalbine teşmil etmemelidir. Zira bir Peygamber-i zîşân'ın kalbini bir an Allah'a tefvîzdan hâlî bırakması Peygamberlik mansıb ve mevkiine asîâ yakışmaz. bu kelimeyi dille söylemeyi unutmak caizdir. Nitekim Peygamber (sallallahü aleyhi ve sellem) Efendimize Yahûdiler ruhun ne olduğunu, Hızır (Aleyhîsselâm)'ı ve Zülkarneyn'i sordukları vakit dili ile «İnşâallah» demeyi unutarak yarın cevap vereceğini söylemiş; bu sebeple vahîy biraz gecikmiş; küffâr da ona isnâdda bulunmuşlardı. Bundan sonra Teâlâ Hazretleri bir şey için ben bunu yarın yaparım deme! Ancak inşâallah dersen o başka...\" Kehf sûresi âyet: 23 - 24 âyetlerini indirerek «inşâallah» kelimesini diliyle söylemesini de ta'lîm buyurdu. Bu kelimenin mânâsı: «Allah dilerse» demektir. Resûlüllah (sallallahü aleyhi ve sellem) bu âyet indikten sonra bu kelimeyi vacibât hakkında bile kullanmaya başlamıştır. (sallallahü aleyhi ve sellem)’in: istisna yapmış olsaydı o kadınlardan her biri Allah yolunda harbedecek bir suvâri çocuk doğururdu.» buyurması Süleyman (aleyhisselâm) hakkındaki vahye istinâdendir; yoksa böyle yapan herkesin mutlaka çocuğu olur mânâsına değildir. Bu cümledeki «istisnadan murâd: «İnşâallah» sözüdür. hadîsin ikinci rivâyetindeki: «İnşâallah deseydi yemininden dönmüş olmazdı...» iradesi üzerinde durulmuş ve: «yemininden dönmezdi» cümlesi «muradı hâsıl olurdu» şeklinde tefsir edilmiştir. Çünkü ortada yemîn yoktur. Bazıları Hazret-i Süleyman (aleyhisselâm)’ın yemîn etmiş olmasını muhtemel görmüşlerdir. Bir takımları da gece mutlaka yetmiş kadını dolaşacağım» ifâdesindeki te'kîdden yemîn mânâsı çıkarmışlardır. Bu söze karşı El-Mühelleb: «Bu hadîste yemîn yoktur ki onu bozmuş olsun. Süleyman (aleyhisselâm) sadece kuvvet ve fiili kendine izafe etmiş; Allahü teâlâ da onu mahrumiyetle cezalandırmıştır. Binâenaleyh buradaki (hıns) kelimesi muvaffakiyetsizlik manasınadır. demiştir. doğan çocuğun Kur'ân-i Kerîm'de Hazret-i Süleyman (aleyhisselâm)'ın kürsîsi üzerine konulduğu bildirilen cesed olduğunu söyleyenler vardır",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 37
			}
		}
	]
}