{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"27": "The Book of Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4297,
			"arabicnumber": "1656.06",
			"text": "(Bana Abdullah b. Abdirrahmân Ed-Dârimî de rivâyet etti. ki): Bize Haccâc b. Minhâl rivâyet etti. ki): Bize Hammâd, Eyyûb'dan naklen rivâyet etti. H. Yahya b. Halef dahi rivâyet etti. ki): Bize Abdülâ'lâ, Muhammed b. ishâk’dan rivâyet etti. râvilerin ikisi de Nâfi'den, o da İbn Ömer'den bu hadisi nezir hakkında rivâyet etmişlerdir. Her ikisinin hadîsinde de «bir gün i'tikâf» kaydı vardır. hadîsi Buhârî: «Fardu'l-Humüs» ve «İ'tikaf» bahislerinde tahrîc etmiştir. Hazret-i Abdullah b. Ömer (radıyallahü anh)’in «Peygamber (sallallahü aleyhi ve sellem) Ci'râne'den ömre yapmadı» demesi bunu bilmediğine hamledilmiştir. Çünkü Resûlü Ekrem (sallallahü aleyhi ve sellem)'in Ci'râne'den ömre yaptığı sabit olmuştur. îspat nefîden mukaddemdir; zîra onda ilim ziyadesi vardır. kâfirin nezrinin sahîh olup olmadığında ihtilâf etmişlerdir. Hanefîler'le İmâm Mâlik ve Şafiîler'in cumhûru sahih olmadığına kaildirler. El-Mahzûmî, Ebû Sevr, Buhârî, İbn Cerîr ve bazı Şâfiîler'e göre sahihtir. Bunların delili Hazret-i Ömer hadîsinin zahiridir. Sahîh olmaz diyenler bunlara cevaben: Hazret-i Ömer hadîsinin müstehab mânâsına hamledildiğini söylemişlerdir. Yani Peygamber (sallallahü aleyhi ve sellem) Hazret-i ömere: Câhiliyet devrinde yaptığın nezrin mislini şimdi yapman müstehab olur; demek istemiştir. Şafiî i'tikâfm oruçsuz da yapılabileceğine bu hadîsle istidlal etmiştir. Bu meselede Hasan-ı Basrî, Ebû Sevr, İbn-l Münzir ve bir rivâyette İmâm Ahmed de Şafiî ile beraberdirler. İbn'l-Münzir bu kavlin Alî ve İbn Mes'ûd (radıyallahü anh) hazerâtından rivâyet olunduğunu söylemiştir. Ömer, İbn Abbâs , Âişe ve Urve b. Zübeyr (radıyallahü anhûm) hazerâtı ile Zühri, Evzâî, Sevrî, Ebû Hanîfe, Mâlik ve bir rivâyette İmâm Ahmed ile İshâk'a göre i'tikâf ancak oruçla sahîh olur. Ekser-i ulemânın kavilleri de budur",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 44
			}
		}
	]
}