{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 434,
			"arabicnumber": "174.03",
			"text": "Bize Ubeydullah b. Mu'az el Amberi rivayet etti. (Dediki): Bize babam rivayet etti dediki: Bize Şube, Süleyman eş-Şeybani'den rivayet etti, o da Zirr b. Hubeyş, Abdullah'tan yüce Allah'ın: \"Andolsun ki Rabbinin büyük ayetlerinden görmüştür.\" (Necm, 53/18) buyruğu hakkında: Cebrail'i asıl suretinde altı yüz kanatlı olarak gördü, dediğini nakletmektedir. Tahric bilgisi 432'nin olduğu gibi 431 ile aynı. DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın NEVEVİ ŞERHİ: \"Malik b. Miğvel, ez-Zubeyr b. Ali'den tahdis etti. O Talha'dan, o Murre'den\" Talha, Musarrif'in oğludur. Bu ravilerin üçü yani ez-Zubeyr, Talha ve Murre tabiinden olup, Kufelidirler .. \"Sidreti'I-MünteM'ya kadar götürüldü. O altıncı semadadır.\" Evet, bütün asıl nüshalarda bu şekilde \"altıncı sema\" denilmektedir. Ama daha önce Enes'in rivayet ettiği başka hadislerde yedinci semanın üstünde olduğu geçmiş bulunmaktadır. Kadı (İyaz) der ki: \"Bunun yedinci semada olduğu daha sahih ve çoğunluğun görüşüdür. Anlamı ve \"el-münteha\" diye adlandınıması da bunu gerektirmektedir.\" Derim ki: Bu iki farklı rivayetin şöyle telif edilmesi mümkündür: Bunun kökü altıncı semada, büyük bir bölümü de yedinci semada olabilir. Çünkü bu ağacın son derece büyük olduğu bilinen bir husustur. Halil-Allah'ın rahmeti ona- bu yedinci semada bir Sidre ağacıdır, gölgesi semalan ve cenneti kaplamıştır. Kadı İyaz -Allah'ın rahmeti ona- 'ın zahiren görülen iki nehir olan Nil ve Fırat'ın Sidretu'l-Münteha'nın dibinden çıkması, bu ağacın kökünün yerde olmasını gerektirir şeklindeki sözünü de nakletmiş bulunmaktayız. Onun bu dediği kabul edilecek olursa bu sözünü de açıkladığımız şekilde yorumlamak mümkün olur. (3/2) Allah en iyi bilendir. \"Ümmeti arasından Allah'a hiçbir şeyi ortak koşmamış olanlara elMukhimat (denilen büyük günahlar)ı bağışlandı.\" Mukhimat büyük günahlar demektir ki, kendilerini işleyen kimseyi helak edip, cehenneme götüren ve onların oraya atılmasına sebep olan büyük günahlardır. Tekahhum da helak edici şeylere düşmek demektir. Buradaki ifadelerin anlamı da şudur: Bu ümmetten Allah'a şirk koşmaksızın ölen kimseye helak edici günahlar bağışlanır. Bunların bağışlanmasından maksat -Allah en iyi bilendir- müşriklerden farklı olarak cehennemde ebediyen kalmayacağıdır. Yoksa hiçbir şekilde azap edilmeyeceği kastedilmemektedir. Çünkü şeriatın nasları ve ehl-i sünnetin icmaı, muvahhidler arasından bazı isyankar kimselerin azaba uğratılacağını ortaya koymuş bulunmaktadır. Bu buyrukla ümmet arasından özelolarak bir kesimin kastedilme ihtimali de vardır. Yani bu ümmetin bazılarının helak edici günahları mağfiret olunur. Bu da Arap dilinde \"men\" lafzı mutlak olarak genelliği gerektirmez, diyenlerin kanaatine göre ve aynı şekilde emir ve yasakta geneli gerektirse dahi haber ifadelerinde gerektirmez, diyenlerin görüşlerine göre açıkça anlaşılır bir husustur. Bununla birlikte tercih edilen kanaat olan bu lafzın, kayıtsız ve şartsız olarak genellik ifade ettiğini kabul edenlerin kanaatine göre sahih olarak açıklanması da mümkündür, çünkü özel bir kesimin kastedildiğine dair delil bulunmaktadır. Bu da (3/3) bizim bu hususta bulunduğunu söylediğimiz naslar ve iemadır. Allah en iyi bilendir. 431 – 446 NEVEVİ ŞERHİ 179.sayfada",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 339
			}
		}
	]
}