{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"28": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4349,
			"arabicnumber": "1669.08",
			"text": "Bana ishâk b. Mansûr rivayet etti. (Dediki): Bize Bişr b. Ömer haber verdi. (Dediki): Mâlik b. Enes'i şöyle derken işittim: Bana Ebû Leylâ Abdullah b. Abdirahmân b. Sehl, Sehl b. Ebî Hasme'den naklen rivayet etti. Sehl de kavminin büyüklerinden ma'dûd bazı zevattan naklen ona haber vermiş ki, Abdullah b. Sehl ile Muhayyisa başlarına gelen bir sıkıntıdan dolayı Hayber'e çıkmışlar. Az sonra Muhayyisa gelerek Abdullah b. Sehl'in öldürüldüğünü ve bir koyuya veya bir çukura atıldığını haber vermiş. Arkacığından yahudilere giderek: Vallahi onu siz öldürdünüz! demiş. Yahudiler: — Vallahi onu biz öldürmedik! demişler. Sonra dönüp kavminin yanına gelmiş. Bunu onlara da anlatmış. Bilâhare kendinden büyük olan kardeşi Huveyyisa ve Abdurrahmân b. Sehl ile birlikte gelmişler. Muhayyisa konuşmağa davranmış. Hayber'de bulunan da o imiş. Fakat Resûlullah (Sallallahu Aleyhi ve Sellem)—yaşı kasdederek— Muhayyisa'ya: «Büyült, büyült!» buyurmuş. Bunun üzerine Huveyyisa konuşmuş. Sonra Muhayyisa konuşmuş. Resûlullah (Sallallahu Aleyhi ve Sellem); «Yâ arkadaşınızın diyetini verirler yahut harbe hazır olduklarını bize bildirirler» buyurmuş. Resûlullah (Sallallahu Aleyhi ve Sellem) bu hususta onlara mektup da yazmış. Yahudiler: «Vallahi onu biz öldürmedik!» diye cevap yazmışlar. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) Huveyyisa, Muhayyisa ve Abdurrahman'a: «Yemîn verir de arkadaşınızın kanını hak eder misiniz?» diye sormuş. — Hayır! demişler. «Yahudiler size yemîn etsinler mi?» buyurmuş. — Onlar müslüman değildir! demişler. Artık Resûlullah (Sallallahu Aleyhi ve Sellem) de onun diyetini kendinden vermiş; ve onlara yüz dişi deve göndererek tâ evlerine kadar götürülmüş. Sehl de: «Gerçekten beni onlardan kızıl bir dişi deve tepdi.» demiş. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 8
			}
		}
	]
}