{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"28": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4378,
			"arabicnumber": "1676.04",
			"text": "Bana Haccâc b. Eş-Şair ile Kâsım b. Zekeriyyâ da rivâyet ettiler. (Dediler ki): Bize Ubeydullah b. Mûsa, Seyhan'dan, o da A'meş'den her iki isnâdla birden Süfyân hadisi gibi rivâyette bulundu. Bunlar hadiste: başka ilâh olmayan Allah'a yemîn ederim ki...» cümlesini zikretmemişlerdir. hadîsi Buhârî ile Tirmizî «Diyât» bahsinde; Ebû Dâvûd «Hudûd»da; Nesâî «Muharebe» ve «Kaved» bahislerinde muhtelif râvilerden tahrîc etmişlerdir. şerifte bir müslumanın ancak üç sebepten biri ile öldürüle-bileceği bildirilmektedir. Birinci sebebi seyyibin zina etmesidir. Bekâr olmayan demektir. Bundan murâd —hâlen evli olsun olmasın— başından sahîh nikâh geçen erkek ve kadındır. Henüz nikahlanmamış kıza Arablar «Bikr» derler. ıstılahında, başından nikâh geçen erkeğe «Muhsan» kadına «Muhsane» denilir. Kal'alanmış; muhkem surette muhafaza altına alınmış mânâsına gelir. Nikâh insanı zinadan muhafaza ettiği için evliye veya başından nikâh geçene bu isim verilmiştir. hukukuna göre muhsan olarak zina eden erkek ve kadının cezası taşlanarak öldürülmektir. Taşlamaya hususî tabîri ile «Recim» denir. Muhsanın recim edileceğine, muhsan olmayan zâniye de yüz dayak vurulacağına bütün ulemanın ittifakı vardır. Yeri gelince bu hususta tafsilât verilecektir. îkinci sebep: Cana karşı candır. Bundan murâd: Kı-sâsdır. Yani haksız yere insan Öldüren kimsenin cezası ölümdür. Hanefîler bu hadîsle istidlal ederek zimmî mukabilinde müslümanın, köle mukabilinde hurrun öldürüleceğine kail olmuşlardır. sebep: Dînini terk ederek İslâm cemaatinden ayrılmaktır. İslâm dininden dönene «mürted» denir. Bir erkek —meâzallah— dininden döner de küfründe ısrar ederse bütün ulemânın ittifakı ile kendisine ölüm cezası verilir. İrtidâd eden kadının hükmü dahi ekser-i ulemâya göre budur. İmâm A'zam (rahimehüllah) kadınlarla çocuklann öldürülmesini yasak eden delilin umumu ile istidlal ederek: «İrtidâd eden kadın Öldürülmez.» demiştir. bazıları hadîs-i şerifteki «cemaatten ayrılan» ifadesi ile istidlal etmiş; ve: «İcmâla sabit Olan bir hükmü inkâr eden dînden çıkar!» demişlerdir. Sahih kavle göre dînden çıkmak için inkâr edilen hükmün namaz, oruç gibi zarurâtı dîniyyeden olması lâzımdır. bu hadîsin, cemaatten ayrılan bâgîlerle haricîlere de şâmil olduğunu söylemişlerdir. Hadîs-i şerîf ölüm cezasının bu üç hale münhasır olduğunu gösteriyor. İbnü'l-Arâbî bâzı Mâlikîler’den naklen ölüm cezasının on sebeple verilebileceğini söylemiş: «Fakat bunlar hiç bir surette bu üç şeyden hâriç değildir. Çünkü sihir yapan, Allah'a, Peygamber'e veya Melekler'e söven kimse kâfirdir...» demiştir. Hadîsin mensuh olduğunu söyleyenler de vardır",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 37
			}
		}
	]
}