{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"28": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4380,
			"arabicnumber": "1677.02",
			"text": "(Bize bu hadîsi Osman b. Ebî Şeybe de rivâyet etti. ki): Bize Cerîr rivâyet etti. H. İshâk b. İbrahim de rivâyet etti. ki): Bize Cerîr ile Îsâ b. Yûnus haber verdiler. H. İbn Ebî Ömer dahi rivâyet etti. ki): Bize Süfyân rivâyet etti. râvilerin hepsi A'meş'den bu isnâdla rivâyette bulunmuşlardır. Cerîr ile Isa b. Yûnus'un hadîsinde: «Çünkü o ölümü îcâd etti.» denil-mistir. Onlar: «ilk» sözünü zikretmemişlerdir. hadîsi Buhârî «Enbiyâ, Diyât» ve «İ'tisâm» bahislerinde; Tirmizî «İlim»de; Nesâî «Tefsîr» ve «Muharebemde; İbn Mâce «Diyât»da muhtelif râvilerden tahrîc etmişlerdir. murâd: Âdem (aleyhisselâm), ilk oğlundan murâd da Kaabil'dir. Kaabil yirmi beş yaşında iken, yirmi yaşındaki kardeşi Hâbili haksız yere öldürmüştü. Ulemâ bunun sebebi hususunda ihtilâf etmişlerdir. Süddî'nin Mücâhid tarîki ile İbn Abbâs (radıyallahü anh)'dan rivâyetine göre: Hazret-i Havva çocuklarını biri kız biri oğlan olmak üzere ikiz doğururmuş. Yalnız Şît (aleyhisselâm)'ı tek doğurmuş. Hazret-i Âdem yeryüzüne indikten yüz sene sonra Kaabil ile kız kardeşi Iklîmâ'yi, bilâhare Hâbil ile kız kardeşi Leyûzâ'yi doğurmuş. Hazret-i Âdem oğullarına bir batından doğdukları kız kardeşlerini vermez; onları ayn batından doğan kızlarla evlendirirmiş. Hâbil ile Kaabil bulûğa erince Cenâb-i Hak Hazret-i Âdem'e, Kaabil ile Leyûzâ'yı, Hâbil ile de Iklîmâ'yi evlendirmesini emir buyurmuş. Iklîmâ pek güzelmiş. Kaabil —ikiz kardeşi olmasına rağmen— onunla evlenmek istemiş. Hazret-i Âdem (aleyhisselâm) onlara birer kurban teklif etmiş. Kaabil çiftçi, Hâbil davar sahibi imiş. Kaabil içinden: «Habil Iklîmâ'yı aldıktan sonra benim kurbanım kabul edilse ne olacak, edilmese ne olacak!» diyerek en kb'tü mahsûlünden bir yığın zahireyi kurban ayırmış. Habî1 ise Allah'ın rizâsmı dileyerek sürüsünün içinden en semiz koçu ve bir mikdar sütle yağı kurbân ayırmış. O zaman kimin kurbanı kabul edilirse, gökten beyaz bir ateş inerek onu yermiş. Gökten inen ateş Hâbi1'in kurbanını yemiş; Kaabi1'inkine dokunmamış. Kaabi1 buna içerliyerek Hâbil'i öldürmüş. yeri ile Hâbi1'in nerede ve nasıl öldürüldüğü de ihtilaflıdır. Ekser-i ulemâya göre kurbanın yeri Hindistan'dır. Kaabil kardeşini taşla öldürmüştür. Boğduğunu söyleyenler olduğu gibi, demirle öldürdüğünü söyleyenler de vardır. Sahîh kavle göre ölüm vak'ası da Hindistan'da olmuştur. geçen «kifl» kelimesi: Nasîb ve cüz' mânâsına gelir, İmâm Halil: «Günâh ve sevabın kifli: tki katı mânâsına gelir.» demiştir. şerîf İslâm'ın kaidelerinden biridir. Kaide şudur: Bir kimse bir kötülük icad ederse o kötülüğü işleyen her insanın kazandığı günahın bir misli —tâ kıyâmete kadar— îcâdçıya da verilir. Hayır îcâd edenin hali de böyledir. Ona da yolundan gidenlerin sevabı verilir. Bu babda: kim bir hayra delâlet ederse, o hayrı işleyenin kazandığı ecrin bir misli de kendisine verilir.» hadîsi. He daha başka sahîh hadîsler de vardır",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 39
			}
		}
	]
}