{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"28": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4383,
			"arabicnumber": "1679.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe île Yahya b. Habîb El-Hârisî rivayet ettiler. (Lâfızları birbirine yakındır.) (Dediler ki) : Bize Bekra'dan, o da Ebû Bekra'dan, o da Nebi (Sallallahu Aleyhi ve Sellem) Abdülvehhâb Es-Sekafî, Eyyûb'dan, o da İbni Sîrîn'den, o da ibni Ebî den naklen rivayet ettiler. (Demişki): Resûlullah (Sallallahü Aleyhi ve Sellem) şöyle buyurdu: «Şüphesiz ki zaman, Allah'ın göklerle yeri yarattığı gündeki hey'eti gîbi dönmüştür. Sene on iki aydır. Bunlardan dördü haram aylardır, ki üçü arka arkaya gelir: Zülka'de, Zülhicce ve Muharrem. Bir de iki cumâd ile Şa'bân arasındaki Mudar'ın ayı Receb!» Sonra şunları söyledi: «Bu hangi aydır?» Biz: — Allah ve ResûIü bilir! dedik. Bunun üzerine sükût etti; hattâ ona adından başka bir isim verecek sandık. «Bu Zülhicce değil mi?» buyurdu. — Evet öyle! dedik. «Yâ şu belde neresidir?» diye sordu. — Allah ve Resulü bilir! dedik. Müteakiben yine sükût etti; hattâ ona adından başka bir isim verecek sandık. «Ma'lûm belde değil mi?» dedi. — Evet öyle! cevabını verdik. «Yâ şu gün nedir?» buyurdu. — Allah ve Resulü bilir, dedik. Bunun üzerine yine sükût etti; hattâ ona adından başka bir isim verecek sandık. «Kurban gönü değil mi?» diye sordu. — Evet öyle! Yâ Resûlâllah, dedik. «İşte sizin kanlarınız, mallarınız (Muhammed demiş ki: Zannederim) ve ırzlarınız, şu ayınızda, şu beldenizde, şu gününüzün hürmeti gibi birbirinize haramdır. Yakında Rabbinize kavuşacaksınız; o da size amellerinizden suâl edecek. Sakın benden sonra birbirinizin boyunlarını vuran küffâr (veya sapıklar olmay) a dönmeyin! Dikkat!.. Burada bulunan, bulunmayana tebliğ etsin! Olur ki, bazı tebliğ olunan, bunu bazı işitenden daha belleyişli olur.» buyurdu. Sonra: «Dikkat!.. Tebliğ ettim mî?» dedi. İbni Habîb kendi rivayetinde : «Mudarın Recebi...» dedi. Ebû Bekr'in rivayetinde ise : «Benden sonra dönmeyin!» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 42
			}
		}
	]
}