{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 439,
			"arabicnumber": "177.01",
			"text": "Bana Zuheyr b. Harb rivayet etti. (Dediki): Bize İsmail b. İbrahim Davud'tan, o da Şa'bi'den, o da Mesruk'tan naklen rivayet etti. Mesruk dedi ki: Aişe'nin yanında yaslanmış bulunuyordum. Şöyle dedi: Ey Ebu Aişe üç şeyden birisini kim söylerse Allah'a büyük bir iftirada bulunmuş olur, dedi. Ben: Hangileridir, dedim. O: Muhammed'in Rabbini gördüğünü iddia eden bir kimse Allah'a karşı büyük bir iftirada bulunmuş olur, dedi. (Mesruk) dedi ki: Yaslanmış iken oturdum. Ey müminlerin annesi, bana bir mühlet ver ve acele etme. Aziz ve Celil Allah: \"Andolsun ki onu apaçık ufukta görmüştür. \" (Tekvir, 23); ''Andolsun ki onu diğer bir inişinde görmüştü.\" (Necm, 13) buyurmuyor mu, dedim. Aişe: Bunu Resulullah (Sallallahu aleyhi ve Sellem)' e bu ümmet arasında soran ilk kişi benim. O şöyle buyurdu, dedi: \"O (sözü edilen kişi) Cebrail'dir. Onu yalnız bu iki defa yaratıldığı sureti üzere gördüm. Onu semadan inerken hilkatinin büyüklüğü yer ile gök arasını kapatmış olduğu halde gördüm.\" Sonra (Aişe) şöyle devam etti: Sen yüce Allah'ın: \"Gözler onu ihata (idrak) edemez, o ise gözleri kuşatmıştır. O lütuf sahibidir, her şeyden haberdardır\" (En'am, 103) buyruğunu yine: ''Allah bir insanla ancak vahiy yolu ile konuşur. Ya bir perde arkasından yahut bir elçi gönderip izniyle dilediğini vahyeder. Şüphesiz o çok yücedir, hikmeti sonsuz olandır.\" (Şura, 51) buyruğunu hiç duymadın mı? (Devamla) dedi ki: Resulullah (sallallahu a1eyhi ve sellem)'in Allah'ın kitabından bir şeyler gizlediğini iddia eden kimse de Allah'a pek büyük bir iftirada bulunmuştur. Halbuki yüce Allah: \"Ey Resul, Rabbinden sana indirileni tebliğ et. Eğer böyle yapmazsan onun risaletini tebliğ etmemiş olursun. \" (Maide, 5/67) (Ayrıca Aişe) dedi ki: Kim onun yarın neler olacağını haber verdiğini iddia edecek olursa o da Allah'a karşı büyük bir iftirada bulunmuş olur; çünkü Allah: \"Deki: Göklerde ve yerde olan/ardan gaybı Allah'tan başka kimse bilmez.\" (NemI, 65) buyurmaktadır.2°O Diğer tahric: Buhari, 4612, 4855, 7380, 7531; Tirmizi, 3068, 3278; Tuhfetu'I-Eşraf, 17613",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 344
			}
		}
	]
}