{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4431,
			"arabicnumber": "1695.01",
			"text": "(Bize Muhammed b. El-Alâ’ El-Hemdânî rivâyet etti. ki): Bize Yahya b. Ya'lâ —ki İbn'l-Hâris El-Muhâribî'dir—Gaylân'dan (bu zât Câmiu'l-Muhâribî'nin oğludur.), o da Alkame b. Mersed'den, o da Süleyman b. Büreyde'den, o da babasından naklen rivâyet etti. Babası Şöyle dedi: b. Mâlik Peygamber (sallallahü aleyhi ve sellem)'e gelerek: Ya Resûlallah ! Beni temizle! dedi. Bunun üzerine: sana! Dön de Allah'tan mağfiret dîlel Ona tevbe et!» buyurdu. (Mâiz) uzağa gitmemek üzere geri döndü. Sonra gelerek: Yâ Resûlallah! Beni temizle! dedi. Resûlüllah (sallallahü aleyhi ve sellem) tekrar: sana! Dön de Allah'tan mağfiret dile! Ona tevbe et!» buyurdu. Mâiz yine uzağa gitmemek üzere geri döndü. Sonra gelerek: Yâ Resûlallah! Beni temizle! dedi. Peygamber (sallallahü aleyhi ve sellem) ona: ne hususta temizliyeyim?» diye sordu. Mâiz: Zinadan! dedi. Bunu müteâkib Resûlüllah (sallallahü aleyhi ve sellem): delilik var mı?» diye sordu. Kendilerine onun deli olmadığı haber verildi. içmiş mi?» diye sordu. Hemen bir zât kalkarak onun ağzını kokladı; fakat şarap kokusu bulamadı. Resûlüllah (sallallahü aleyhi ve sellem) tekrar: zina mı ettin?» diye sordu. Mâiz: Evet! cevâbını verdi. Artık emir buyurdular ve Mâiz recmedildi. Onun hakkında cemaat iki fırka olmuştu. Kimisi: Helâk oldu! Onu günahı kuşattı!., diyor; bazısı da: Mâiz'in tevbesinden efdal tevbe olmaz.!.. Zira o Peygamber (sallallahü aleyhi ve sellem)'e gelerek elini onun eline koydu. Sonra: Benî taşlarla öldür! dedi... diyordu. Bu minval üzere iki veya üç gün durdular. Bilâhare onlar otururken Resûlüllah (sallallahü aleyhi ve sellem) gelerek selâm verdi ve oturdu. Arkacığından: «Mâiz b. Mâlik için istiğfar edin!» buyurdular. Ashâb: Allah Mâiz b. Mâlik'e mağfiret eylesin! dediler. Resûlüllah (sallallahü aleyhi ve sellem) de: öyle bir tevbe etti ki, bu tevbe bir ümmet arasında taksim edilse onlara yeterdi.» buyurdu. Ezd kabilesinin Gâmid kolundan bir kadın geldi; ve: Ya Resûlallah! Beni temizle! dedi. sana!.. Dön de Allah'tan mağfiret dile! Ona tevbe et!» buyurdular,. Kadın: Görüyorum beni, Mâiz'i çevirdiğim gibi geri çevirmek istiyorsun, dedi. oldu sana?» diye sordu. Kadın kendisinin zinadan gebe olduğunu söyledi. Bunun üzerine: mi?» buyurdu. Kadın: Evet! cevâbını verdi. Ona: doğuruncaya kadar...» buyurdular. Derken kadın doğuruncaya kadar geçimini Ensârdan bir zât üzerine aldı. Bilâhare Peygamber (sallallahü aleyhi ve sellem)’e gelerek: Gâmidli kadın doğurdu; dedi. Efendimiz: halde onu recmedip de çocuğunu küçük olduğu halde emzirecek kimsesiz bırakamayız!» buyurdu. Bunun üzerine Ensâr'dan bir zât ayağa kalkarak: Çocuğun bakımı bana âid olsun ya Nebiyyaîlah! dedi. O da kadını recmetti (rdi)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 34
			}
		}
	]
}