{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4432,
			"arabicnumber": "1695.02",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe de rivâyet etti. ki): Bize Abdullah b. Nümeyr rivâyet etti. H. Muhammed b. Abdillâh b. Nümeyr dahi rivâyet etti. Hadîsin lâfzı hususunda birbirlerine yakındırlar. ki): Bize babam rivâyet etti. ki): Bize Büşeyr b. El-Muhâcîr rivâyet etti. ki): Bize Abdullah b. Büreyde, babasından naklen rivâyet etti ki: b. Mâlik El-Eslemî, Resûlüllah (sallallahü aleyhi ve sellem) ye gelerek: Yâ Resûlallah! Ben nefsime zulmettim; zina ettim. Beni temizlemeni dilerim! demiş. \"Peygamber (sallallahü aleyhi ve sellem) onu geri çevirmiş. Ertesi gün olunca (tekrar) gelerek: Ya Resûlallah! Ben gerçekten zina ettim! demiş. O da kendisini ikinci defa geri çevirmiş. Derken Resûlüllah (sallallahü aleyhi ve sellem) onun kavmine haber göndererek: aklında yadırgadığınız bir'kusur biliyor musunuz?» diye sormuş. Biz onu ancak aklı başında, kendi görüşümüze göre sulehâmızdan biliriz! cevabını vermişler. Mâiz üçüncü defa (tekrar) gelmiş. Resûlüllah (sallallahü aleyhi ve sellem) yine kavmine haber göndererek onu soruşturmuş. Onlar da: Ne kendinde bir kusur vardır, ne aklında! diye haber vermişler gün gelince onun için bir çukur kaz(dır)mış: Sonra emir buyurarak recmedilmiş. Gâmid'li kadın gelmiş; ve: Yâ Resûlallah! Ben zina ettim, imdi beni temizle! demiş. Peygamber (sallallahü aleyhi ve sellem) onu da geri çevirmiş. Ertesi gün gelince kadın: Yâ Resûlallah! Beni neye geri çeviriyorsun? Galiba beni, Mâiz'i Çevirdiğin gibi geri çevireceksin! Vallahi ben gebeyim! demiş. Efendimiz: haydi doğuruncaya kadar git (buradan!) » buyurmuşlar. Kadın doğurduğu zaman çocuğu bir bez parçası içinde getirmiş; ve: İşte! Onu doğurdum; demiş. (Yine): de bu çocuğu sütten kesilinceye kadar emzîr!» buyurmuş. Kadın onu memeden ayırdıktan sonra çocuğu, elinde bir parça ekmek olduğu halde getirmiş ve: İşte yâ Nebiyyâllah! Onu memeden ayırdım. Yemek yemeğe de başladı... demiş. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) çocuğu müslümanlardan birine vermiş. Sonra emir buyurarak kadın için göğsüne kadar bir çukur kazılmış. Cemaate de emir vermiş ve kadını recmetmişler. Hâlid b. Velîd bir taşla gelerek basına atmış da kan Hâlid'in yüzüne sıçramış; Hâlid de ona söğmüş. Peygamber (sallallahü aleyhi ve sellem) onun kadına söğdüğünü İşiterek: ol yâ Hâlid! Nefsim yed-i kudretinde olan Allah'a yemîn ederim! Bu kadın öyle bir tevbe etti ki, onu bir baççı yapsaydı mutlaka mağfiret olunurdu!» buyurmuşlar. Sonra kadın (in ihzarın)ı emrederek cenazesini kılmış ve kadın defnedilmiş",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 35
			}
		}
	]
}