{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4451,
			"arabicnumber": "1705.02",
			"text": "(Bu hadîsi bize İshâk b. İbrahim de rivâyet etti. ki): Bize Yahya b. Âdem haber verdi. ki): Bize İsrail, Süddî'den bu isnâd-la rivâyet etti. Yalnız «Memlüklerden muhsan olanı da olmayanı da» cümlesini zikretmedi. O hadîste: «İyileşinceye kadar onu bırak!» cümlesini ziyade etti. önceki bâbda gördük ki İmâm Mâlik'in İbn Şihâb-ı Zührî'den rivâyet ettiği Ebû Hüreyre (radıyallahü anh) hadîsinde Peygamber (sallallahü aleyhi ve sellem)’e muhsan olmayan câriye zina ederse hükmünün ne olacağı sorulmuş; o da dayak vurulacağını bildirmiş. Bu hadîste ise zina eden câriye ve kölelere —muhsan olsun olmasın— dayak vurulacağı beyan ediliyor. Zahiren iki rivâyet arasında bir çelişme var gibi görünüyorsa da hakikatte aralarında hiç bir münâfât yoktur. Şöyle ki: İmâm Mâlik'in rivâyet ettiği Ebû Hüreyre hadîsi muhsan olmayan cariyenin hükmünü bildiriyor. Bu hüküm dayaktır. Muhsan olan cariyenin hükmünü de muhsan olurlar da bir fahişelik ederlerse, onlara muhsan olan hür kadınlara verilecek azabın yarısı vardır.\" Âyet-i Kerîme âyet-i kerîmesi beyân ediyor; bu hüküm de dayaktır. Şu halde evlenerek muhsan olan câriye ile evlenmemiş, muhsan olmayan cariyenin ikisine de dayak cezası verilecek demektir ki Hazret-i Alî'nin hutbesinde beyan ettiği de budur. şöyle bir suâl hatıra gelebilir: Zina cezası hususunda evli câriye ile bekâr câriye arasında bir fark olmadığına göre âyet-i kerîmede: muhsan (evli) olurlarsa...»diye takyîd buyurulmasının hikmeti nedir? Âyet-i kerime cariyeye —evli de olsa— hür kadına vurulacak dayak cezasının yarısı vurulacağını tenbîh etmektedir. Çünkü yarıya bölünmek ancak dayak cezasında mümkündür: Recmin yarısı olmaz. Binâenaleyh âyetten recim kasdedilmediğinde şüphe yoktur. İşte âyetten murâd evli cariyeye yarım recim cezası olacağı vehmine düşülmemesi için «Evli cariyeler» kaydı ile hüküm beyan edilmiştir. Evli câriye zina ederse kendisine dayak cezası verileceğinde bütün ulemâ müttefiktirler. hadîs-i şerif nifâsh ve hasta kadınların cezası, iyileşinceye kadar tehir edileceğine delîldir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 54
			}
		}
	]
}