{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4457,
			"arabicnumber": "1707.01",
			"text": "Bize, Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb ve Aliy b. Hucr rivâyet ettiler. (Dediler ki): Bize İsmail (yani İbn Uley-ye), İbn Ebî Arûbe'den, o da Abdullah Ed-Dânâc'dan naklen rivâyet etti. H. İshâk b. İbrahim El-Han zait de rivâyet etti. Lâfız onundur. ki): Bize Yahya b. Hammâd haber verdi. ki): Bize Abdül-aziz b. Muhtar rivâyet etti. ki): Bize İbn Âmir Ed-Dânâc'ın âzâd-hsı Abdullah b. Feyrûz rivâyet etti. ki): Bize Hudayn b. Münzir Ebû Sâsân rivâyet etti. ki): b. Affân'a şâhid oldum. Kendisine Velid getirilmişti. Velîd sabah namazını iki rek'at kıldırmış; sonra: Size daha ziyâde edeyim mî? demişti. Onun aleyhine iki zât şehâdet etti. Biri Humran olup şarap içtiğine; diğeri de onu kusarken gördüğüne şehadette bulundu. Bunun üzerine Osman: Bu adam şarabı içmese kusmazdı! dedi. Ve: Yâ Ali! Kalk da şuna dayak vur! emrini verdi. Alî de: Kalk yâ Hasan şuna dayak vur! dedi. Hasan: Sen onun cefâsını, sefasını sürene yükle! dedi. Galiba Osman'a dargındı. Nihayet Alî: Yâ Abdullah b. Ca'fer! Kalk da şuna dayak vur! dedi. O, dayağı vurdu. Alî de sayıyordu. Kırka varınca: Kes! dedi. Sonra şunları söyledi. Peygamber (sallallahü aleyhi ve sellem) kırk değnek (hadd) vurdu. Ebû Bekir de kırk değnek vurdu, Ömer ise 80 değnek vurdu. Bunların hepsi sünnettir. Ama bence bu daha makbuldür. b. Hucr kendi rivâyetinde şunu ziyâde etti: «İsmail ki): Ben ondan Dânâc'ın hadîsini de dinledim ama onu bellemedim.» hadîste bahsi geçen Velîd , Velîd b. Ukbe b. Ebî Muayt'tır. Küfe'de vâlî bulunuyordu. İçki içer, kötü ahlâklı bir adamdı. Küfe'de sabah namazını dört rek'at kıldırmış; sonra cemaate dönerek: ziyade edeyim mi?» demiş. İlk saftaki cemaat: Sen bize vali olalı ziyâdeye devam ediyoruz! Bize daha neyi ziyâde edeceksin? Allah hayrını vermesini demişler ve cemaat kendisini mescidin çakılları ile taşlamıştı. Bu mesele Kûfe'ye yayılmış; nihayet Hazret-i Osman Velid'i huzuruna getirtmeye mecbur olmuştu: mü'minler! Size bir fâsik bir haber getirirse (hakikatini) soruşturun!\" Süre-i Hucurat, âyet: 6. âyet-i kerimesi bu zât hakkında nâzil olmuştur. şerifin mânâsı şudur: Velîd'e hadd-i şer'î lâzım gelince, o gün halife bulunan Hazret-i Osman bu işi Hazret-i Alî'ye havale ederek ona ikramda bulunmuş. «Haddi sana bırakıyorum; kime istersen emret de vursun!» demek istemişti. Alî (radıyallahü anh) bunu kabul ederek dayak vurmayı Hasan'a teklif etmiş; fakat o Hazret-i Osmân'a dargın olduğu için dayak vurmaya yanaşmamış: «Sen onun cefâsını, sefasını sürene yükle!» demişti. cümle Arapların bir ata sözüdür. Esmaî'nin beyânına göre mânâsı: «Onun pisliklerini, lezzetlerinden istifâde edene havale et!» demektir, ki zamir hilâfet ve vilâyete âiddir. Yani Osman (radıyallahü anh) ve yakınları hilâfetin ni'metlerinden nasıl istifâde ediyorlarsa dayak vurmayı da kendileri yapsın! demek istemiştir. Kötü ve şiddetli; Kaar da: Soğuk güzel ve afiyetti mânâlarına gelirler- Nihayet Abdullah b. Ca'fer dayak vurmayı kabul etmiş; Hazret-i Alî de başında bulunarak dayak adedini saymıştır. Sayı kırka baliğ olunca «Kes!» diyerek durdurmuş; ve: «Peygamber (sallallahü aleyhi ve sellem) kırk sopa hadd vurdu; Ebû Bekir de kırk sopa vurdu; Ömer seksen dayak vurdu. Bunların hepsi sünnettir; ama bence bu daha makbuldür.» demiştir. ki. Hazret-i Alî burada Velîd'e kırk sopa vurdunnuş-tur. Halbuki «Sahîh-i Buhârî-de Abdullah b. Adiy'den rivâyet olunduğuna göre Alî (radıyallahü anh) aynı kaziyyede seksen dayak vurdurmuştur. Bu bâbta Kâdî Iyâz şunları söylüyor: «Alî'nin mâruf olan mezhebi, şarap hakkında seksen değnek vurmaktır. Meşhur rivâyete göre Hazret-i Ömer'e seksen dayak hadd vurmasını da işaret etmiştir. Nitekim «El-Muvatta'» ve başkalarının rivâyetinden naklen yukarıda geçmişti. Bütün bunlar onun seksen dayak vurduğunu bildiren rivâyeti tercih ettirmektedir.» sonra Kâdî Iyâz iki rivâyetin arasını bulmuş: «Kırk dayağı iki başlı bir kamçı ile vurmuştur; mecmu yine seksen olur.» demiştir. Ona göre Hazret-i Alî 'nin: «Bence bu daha makbuldür.» sözündeki ismi işaretin, Hazret-i Ömer'in vurduğu seksen dayağa râci' olması ihtimâli de vardır",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 60
			}
		}
	]
}