{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"30": "The Book of Judicial Decisions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4480,
			"arabicnumber": "1714.04",
			"text": "(Bize Züheyr b. Harb rivâyet etti. ki): Bize Ya'kûb b. İbrahim rivâyet etti. ki): Bize Zührî'nin kardeşi oğlu, amcasından, rivâyet etti. ki): Bana Urvetü'bnü'z-Zübeyr haber verdi ki, Âişe şunları söylemiş: binti Utbe b. Rabia gelerek: Yâ Resûlallah! Vallahi yeryüzünde senin hanen halkı kadar zelil olmalarını dilediğim bir hâne yoktu. Bugün ise yeryüzünde senin hanen halkı kadar aziz olmalarını dilediğim hane kalmadı, dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): yed-i kudretinde olan Allah'a yemin olsun ki, yine de!» buyurdu. Sonra Hind: Yâ Resûlallah! Gerçekten Ebû Süfyân pek cimri bir adamdır. Acaba onun malından çoluğumuza çocuğumuza yedirmemde bana bir ve bal var mıdır? dedi. Efendimiz ona: Ancak ma'ruf vecihle (harca)!» buyurdular. hadîsi Buhârî «Nafakaat», «Menâkıbü'l-Ensâr» ve «Eymân» bahislerinde tahrîc etmiştir. şerif de Hazret-i Ebû Süfyân'in zevcesi olduğu bildirilen Hind (radıyallahü anh) Hazret-i Muâviye'nin annesidir. Hind'in babası Utbe'yi Bedir gazasında Hazret-i Hamza (radıyallahü anH) öldürmüştü. Amcası Şeybe ile kardeşi Velîd de aynı gazada maktul düşmüşlerdi. Bu sebeple o zaman henüz müslüman olmayan Hind başta Peygamber (sallallahü aleyhi ve sellem) olmak üzere bütün müslümanlara diş biliyordu. Nitekim Uhud harbinde Hazret-i Hamza'yı vurması için Vahşî namındaki köleyi teşvik edenlerden biri de Hind'di. Hattâ Hamza (radıyallahü amlı) şehîd edilince intikam hissi ile onun ciğerini çiğnediği rivâyet olunur. Hind, Mekke'nin fethinde kocası Ebû İSüfyân (radıyallahü anh)'dan sonra müslüman olmuş; Peygamber (sallallahü aleyhi ve sellem) onları nikâhları üzre bırakmış; nikâhlarını tazelemeye lüzum görmemiştir. Hind (radıyallahü anh): «Senin hanen halkı kadar Allah'ın zelil etmesini dilediğim bir hâne yoktu...» sözü ile o eski düşmanlık günlerine işaret etmiştir. geçen «Ehl-i hibâ»‘nın asıl mânâsı çadır halkı demektir, Yün veya yapağıdan yapılan çadırdır. Sonraları bir kimsenin evine, yurduna da hibâ' denilmiştir. Kirmanı: «İhtimal Hind bu sözü ile Resûlüllah (sallallahü aleyhi ve sellem)'in kendini kasdedilmiş; onu ve ehl-i beytini ta'zîm için kinaye yolu ile konuşmuştur.» diyor. (sallallahü aleyhi ve sellem)’in Hazret-i Hind'e cevaben: de!» buyurması- iki suretle mânâlandırılmıştır. Birinciye göre mânâ: «O yine öyledir; yani söylediğin doğrudur; ben de sana nisbetle senin dediğin gibiyim» demektir. İkinci surete göre bu sözden murâd: Bizi sevmen daha da artacak; kalbine îmân yer edecek» demektir. Allâme Aynî ile Nevevî bu ikinci mânâyı makama daha münâsib görmektedirler. Çünkü Hind ikinci cümlesinde Resûlüllah'ın ehl-i beytini çok sevdiğinden bahsetmektedir. Hind'in suâline Resûl-i Ekrem'in: Ancak ma'rûf vecihle» buyurmasının dahi iki veçhe ihtimali vardır:",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 11
			}
		}
	]
}