{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 449,
			"arabicnumber": "181.01",
			"text": "Bize Ubeydullah b. Ömer b. Meysere rivayet etti. Dediki; Bana Abdurrahman b. Mehdi rivayet etti. (Dediki): Bize Hammad b. Seleme, Sabit el-Bunani'den, o da Abdurrahman b. Ebi Leyla'da» o da Suhayb’dan Suhayb, Nebi (Sallallahu aleyhi ve Sellem)'den şöyle buyurduğunu nakletti: \"Cennet ehli cennete girdikten sonra Allah Tebareke ve Teala şöyle buyuracak: Size daha fazla bir şey vermemi istiyor musunuz? Onlar: Yüzlerimizi ak etmedin mi? Bizi cennete koyup, cehennemden korumadın mı (daha ne isteyelim), diyecekler. Bunun üzerine yüce Rabbimiz hicabı açacak. Aziz ve Celil Rablerine bakmaktan daha çok sevdikleri hiçbir şey onlara verilmiş olmayacaktır. \" Diğer tahric: Tirmizi, 2552; İbn Mace, 187; Tuhfetu'I-EşrM, 4968 NEVEVİ ŞERHİ: \"Bize Abdullah b. Ömer b. Meysere tahdis etti. .. Cennetlikler cennete girdiği zaman ... \" (3/16) Bu hadisi bu şekilde Tirmizi, Nesai, İbn Mace ve başkaları Hammad b. Seleme'nin, Sabit'ten, o İbn Ebu Leyla'dan, o Suhayb'den, o Nebi (Sallallahu aleyhi ve Sellem)'den diye rivayet etmişlerdir. Ebu İsa et-Tirmizi, Ebu Mesud edDımeşki ve başkaları da şöyle demişlerdir: Bu hadisi bu şekilde Sabit'ten merfu olarak Hammad b. Seleme'den başkası rivayet etmemiştir. Ayrıca bunu Süleyman b. el-Muğire, Hammad b. Zeyd ve Hammad b. Vakid, Sabit'ten, o İbn Ebi Leyla'dan onun sözü olarak rivayet etmiş olup, bu rivayette Nebi (Sallallahu aleyhi ve Sellem)'in adı da, Suhayb'in adı da geçmemektedir. Bunların bu söyledikleri hadisin sıhhatini olumsuz olarak etkilemez. Çünkü bizler daha önceki fasıllarda fakihlerin, usul alimlerinin ve muhakkık muhaddislerin tercihen kabul ettikleri Hatib Bağdadi'nin de sahih olduğunu belirttiği doğru (sahih) kanaatin şu olduğunu belirtmiştik: Bir hadisi sika ravilerinin bazısı muttasıl, diğer bazısı mürsel yahut bazıları merfu, diğer bazısı mevkuf olarak rivayet edecek olurlarsa, hadisin muttasıl ve merfu olduğuna hükmedilir. Çünkü bu şekildeki rivayet sika bir ravinin ziyadesidir, böyle bir ziyade ise bütün mezhep ve fırkalarm çoğunluğu tarafmdan kabul edilmiştir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 354
			}
		}
	]
}