{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 450,
			"arabicnumber": "181.02",
			"text": "Bunu bize Ebu Bekr b. Ebi Şeybe de tahdis etti. Bize Yezid b. Harun, Hammad b. Seleme'den bu isnad ile tahdis etti ve şunu ekledi: Sonra da şu: \"İhsan da bulunanlara el-Hüsna ve daha fazlası vardır.\" (Yunus, 26) ayetini okudu. Tahric bilgisi 448 ile aynı. DAVUDOĞLU AÇIKLAMA: Hadis-i Şerif bütün tarikleriyle mu'minlerin cennet'te Allah Tealayı göreceklerine delâlet etmektedir. Geçen bâblardada izah ettiğimiz gibi Allah Teâlâ'yı görmek bütün ehl-i sünnet imamlarına göre aklen caizdir. mu'minlerin cennette onu göreceklerine dair icma-i ümmet vardır. Vakıa ehl-i bid'attan Mu'tezile ile Hariciler ve Mürcie taifesinin bazıları Allah Teâlâ'yi mahlukâtından hiç biri göremez onu görmek aklen imkânsızdır, demişlerse de bu kavil hem sarih bir hata, hemde kabih bir cehildir. Zaten İcma-i ümmetten sonra ortaya atılmış bir bid'attır. Âhirette mu'minlerin Allah'ı göreceği, kitap, sünnet ve icma-ı ümmetle sabittir. Eshab-ı kiram ile onlardan sonra gelen selef-i salihin bu hususta icma' etmişlerdir. Ehl-i bid'atın esassız iddialarına ehl-i sünnet ulemâsının verdiği cevaplar meşhurdur, bunlar kelâm kitaplarında görülebilir. Yine geçen bâblarda görmüştük ki; dünya gözü ile Allah Tealayı görmenin mümkün olup olmadığı ehl-i sünnet ulemâsı arasında ihtilaflıdır. Mümkündür diyenler olduğu gibi; değildir diyenlerde olmuştur. Hatta Selef ve halefin kelâm ulemâsına göre; Teâlâ Hazretleri dünya gözü ile görülemez. İmam-ı Kuşeyri meşhur Risalesinde imam Ebu'l-Hasen el-Eşarî 'den iki kavil rivayet eder. Onların birine göre Allah Tealayı dünyada görmek caiz diğerine göre caiz değildir. Nasr b. Alî hadisi müteşabihattandır. Yani, mânasını bu dünyada anlamak imkânsızdır. Çünkü Hadis-i Şerifte geçen ridâ ve kibriya lâfızları bizim, bildiğimiz örtü, âbâ, azamet ve büyüklenme mânalarına değildir. Kurtubî «Azamet ve kibriya elbise cinsinden değildir. Bunlar mecazdır. Münasebet şudur ki; abâ ile gömlek nasıl insana mahsus ve bu bâbta ona müşarik yoksa azamet, kibriya da Allah Tealaya mahsustur. Bu hususta ona ortak olan yoktur.» diyor. Müteşabih âyet ve hadisler hakkında söz etmekten çekinen selef-i saHhin: «Bunların te'vilini ancak Allah' bilir» deyip geçerler te'vil eden ulemâ ise; buradaki veehden murâd Allah'ın zâtından, ridâ da azametinden kinayedir derler",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 355
			}
		}
	]
}