{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"31": "The Book of Lost Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4511,
			"arabicnumber": "1726.01",
			"text": "(Bize bu hadîsi Kuteybetü'bnü Saîd ile Muhammed b. Rurah dahi hep birden Leys b. Sa'd'dan rivâyet ettiler. H. bu hadîsi Ebû Bekir b. Ebî Şeybe de rivâyet etti. ki): Bize Aliy b. Müshir rivâyet etti. H. İbn Nümeyr dahi rivâyet etti. ki): Bana babam rivâyet etti. Her iki râvi Ubeydullah'dan rivâyet etmişlerdir. H. Ebû'r-Rabî' ile Ebû Kâmil de rivâyet ettiler. (Dediler ki): Bize Hammâd rivâyet etti. H. Züheyr b. Harb da rivâyet etti. ki): Bize İsmâîl (yani İbn Uleyye) rivâyet etti. Bu râviler toptan Eyyûb'dan rivâyet etmişlerdir. H. İbn Ebî Ömer dahi rivâyet etti. ki): Bize Süfyân, İsmail b. Ümeyye'den naklen rivâyet etti. H. Muhammed b. Râfi' de rivâyet etti. ki): Bize Abdürraz-zâk, Ma'mer'den, o da Eyyûb'dan, İbn Cüreyc dahi Mûsa'dan naklen rivâyet etti. Bu râvilerin hepsi Nâfi'den, o da İbn Ömer'den, o da Pey-gamber (sallallahü aleyhi ve sellem)’den naklen Mâlik'in hadîsi gibi rivâyette bulunmuşlardır. Şu kadar var ki her birinin hadîsinde «Fe yünte-sele» denilmiştir. Yalnız Leys b. Sa'd müstesna! Çünkü onun hadîsinde Mâlik'in rivâyetinde olduğu gibi «fe yüntekalü taâmuh» ibaresi vardır. hadîsi Buhârî «Lükata» bahsinde; Ebû Dâvûd «Ci-had»da tahrîc etmişlerdir. Deve, sığır, koyun, keçi mânâlarına gelirse de ekseriyetle koyun hakkında kullanılır. ve meşrabe: İçerisinde zahire ve eşya muhafaza edilen kilerdir. Bu kelime hassaten meşrabe şeklinde kullanılırsa, su yeri; mişrabe de su kabı mânâsına gelir. Hızâne muhafazası istenilen şeyin yeri veya kabıdır. yüntesele: Saçılmasını demektir. Bu kelime birinci rivâyetteki «aşırılmasını» kelimesinin yerine kullanılmıştır. Dır'ın cem'idir. Dır' hayvanın yelini yani sütünün toplandığı yerdir. Ekrem (sallallahü aleyhi ve sellem) hayvanın yelinindeki sütü, kiler veya anbarda saklanan zahireye benzetmiştir. Yani bir kimsenin izni olmaksızın anbarındaki zahiresini almak nasıl helâl değilse, davarının sütünü sağmak da helâl değildir. Bu hususta hurma, üzüm ve karpuz gibi şeylerin hüküm i'tiban ile sütten bir farkı yoktur. Ancak süt meselesinde insanlar daha lâkayıd davrandıkları için hassaten zikredilmiştir. diyor ki: «Cumhûra göre sahibinin rızâsı olmadan ne davarın sütünden bir şey helâl olur ne de hurmadan! Bazıları sahibinin haberi olmasa da bu gibi şeylerin helâl sayılacağını söylemiş; ve: Çünkü bu sâri' hazretlerinin ona bahşettiği bir haktır; demişlerdir...» izin almadan onun davarını sağmayı, yemişinden yemeyi mubah hatta bir hak sayanlar bâzı hadîslerle istidlal ederler. Şöyle ki: Dâvûd'un Semûra (radıyallahü anh)'dan tahrîc ettiği bir hadîste Peygamber (sallallahü aleyhi ve sellem): bir davar sürüsünün yanına vardığı zaman şayet sahibi orada İse ondan İzin İstesin! Kendisine izin verirse ne âlâi Vermezse hemen davan sağıp sütünü içsin! Sahibi orada yoksa üç defa seslensin! Cevap verirse ondan İzin istesin! İzin verirse ne âlâ! Vermezse hemen davan sağıp sütünü içsin! Ama alıp götürmesin!» buyurmuşlardır. Bu hadîsi Tirmizî dahi rivâyet etmiş; ve: «Semûra hadîsi hasen garîb, sahîh bir hadîstir. Ulemadan bazıları bununla âmel etmişlerdir...» demiştir. Filhakika İmâm Ahmed'le İshâk'ın mezhepleri budur. Tirmizî ile İbn Mâce'nin «Sünen»lerinde buna benzer rivâyetler vardır. Bunların birinde süt meselesinden sonra: bahçeye geldiğin vakit üç defa haykır! Şayet sana icabet ederse ne âlâ! Etmezse ifsad etmemek şartı ile hemen ye!» Duyurulmaktadır. delilleri de hicret esnasında Peygamber (sallallahü aleyhi ve sellem) ile Hazret-i Ebû Bekr'in bir çobanın koyunlarından süt içmeleridir. Şâfiîler'e, Mâlikıler'eve cumhûr-u ulemâya göre izinsiz hiç bir kimse birinin bağ ve bahçesinden yemiş yiyemez; davarının sütünü içemez. Meğer ki muztar kala! O zaman zaruret miktarı yiyip içebilir. Bu zevat cevaz bildiren hadîsler hakkında muhtelif yönlerden cevaplar vermişlerdir. Kurtubî: «Malûm kaide ile amel etmek daha iyidir.» demiştir. Nehî bildiren hadîs, cevaz hadîsinden daha sahihtir. Cevaz bildiren hadîsler âdete nazaran mal sahiplerinin razı olduklarının bilinmesine hamledilirler. Cevaz meselesi zaruret zamanlarına hamledilir. Nitekim İslâm'ın ilk zamanlarında hâl böyle idi. hususta Tahâvi de şunları söylemiştir: «Bu hadîsler mü-safir kabul etmenin vâcib olduğu zamanlara mahsustur. Resûlüllah (sallallahü aleyhi ve sellem) bunu emir buyurmuş; gelen müsafir için hane sahibine vacip kılmıştı. Bilâhare vücup neshedilerek hükmü kaldırılınca adı geçen hadîslerin hükmü de kalkmıştır.» esnasında Peygamber (sallallahü aleyhi ve sellem) ile Hazret-i Ebû Bekr'in içtikleri süt hakkında Kurtubî: «Bu Koyun sahibine bir idlâl (yani nazı geçme) idî. Çünkü Hazret-i Ebû Bekir onu tanıyordu. Yahut o çobanın oradan geçenlere süt takdim edilmesine izin verdiğini bilirdi. Yahut o süt, kendisine emân verilmemiş bir harbîye ait olduğu için içmişlerdi...» diyor. Bu hususta daha başka sözler de söylenmiştir",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 13
			}
		}
	]
}