{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"31": "The Book of Lost Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4512,
			"arabicnumber": "1726.02",
			"text": "Bu hadîsi Buhâri «lukata» bahsinde; Ebû Dâvûd «Cihad»da tahrîc etmişlerdir. Mâşiye: Deve, sığır, koyun, keçi mânâlarına gelirse de ekseriyetle koyun hakkında kullanılır. Meşrube ve meşrabe: İçerisinde zahire ve eşya muhafaza edilen kilerdir. Bu kelime hassaten meşrabe şeklinde kullanılırsa, su yeri; mişrabe de su kabı mânâsına gelir. Hızâne muhafazası istenilen şeyin yeri veya kabıdır. Fe yüntesele: Saçılmasını demektir. Bu kelime birinci rivayetteki «aşırılmasını» kelimesinin yerine kullanılmıştır. Duru': Dır'ın cem'idir. Dır' hayvanın yelini yâni sütünün toplandığı yerdir. Resulü Ekrem (Sallallahu Aleyhi ve Sellem) hayvanın yelinindeki sütü, kiler veya anbarda saklanan zahireye benzetmiştir. Yâni bir kimsenin izni olmaksızın anbarındaki zahiresini almak nasıl helâl değilse, davarının sütünü sağmak da helâl değildir. Bu hususta hurma, üzüm ve karpuz gibi şeylerin hüküm i'tibari ile sütten bir farkı yoktur. Ancak süt meselesinde insanlar daha lâkayıd davrandıkları için hassaten zikredilmiştir. Kurtubi diyor ki: «Cumhura göre sahibinin rızâsı olmadan ne davarın sütünden bir şey helâl olur ne de hurmadan! Bâzıları sahibinin haberi olmasa da bu gibi şeylerin helâl sayılacağını söylemiş; ve: Çünkü bu Şâri' hazretlerinin ona bahşettiği bir haktır; demişlerdir...» Sahibinden izin almadan onun davarını sağmayı, yemişinden yemeyi mubah hatta bir hak sayanlar bâzı hadîslerle istidlal ederler. Şöyle ki: Ebû Davud'un Semûra (Radiyallahu anh}'dan tahrîc ettiği bîr hadîste Nebi (Sallallahu Aleyhi ve Sellem): «Bîriniz bir davar sürüsünün yanına vardığı zaman şayet sahibi orada ise ondan izin istesin! Kendisine izin verirse ne âlâ! Vermezse hemen davarı sağıp sütünü içsin! Sahibi orada yoksa üç defa seslensin! Cevap verirse ondan izin istesin! İzin verirse ne âlâ! Vermezse hemen davarı sağıp sütünü içsin! Ama alıp götürmesin!» buyurmuşlardır. Bu hadîsi Tirmizi dahî rivayet etmiş; ve: «Semûra hadîsi hasen garîb, sahîh bir hadîstir. Ulemadan bazıları bununla âmel etmişlerdir...» demiştir. Filhakika İmam Ahmed'le îshâk'ın mezhepleri budur. Tirmizî ile ibni Mâce'nin «Sünen»lerinde buna benzer rivayetler vardır. Bunların birinde süt meselesinden sonra: «Bir bahçeye geldiğin vakit üç defa haykır! Şayet sana icabet ederse ne âlâ! Etmezse ifsad etmemek şartı ile hemen ye!» Buyurulmaktadır. Bir delilleri de hicret esnasında Nebi (Sallallahu Aleyhi ve Sellem) ile Hz. Ebû Bekr'in bir çobanın koyunlarından süt içmeleridir. Hanefîlerle, Şâfiîler'e, Mâlikıler'e ve cumhûr-u ulemâya göre izinsiz hiç bir kimse birinin bağ ve bahçesinden yemiş yiyemez; davarının sütünü içemez. Meğer ki muztar kala! O zaman zaruret miktarı yiyip içebilir. Bu zevat cevaz bildiren hadîsler hakkında muhtelif yönlerden cevaplar vermişlerdir. a) Kurtubî: «Malûm kaide ile amel etmek daha iyidir.» demiştir. b) Nehî bildiren hadîs, cevaz hadîsinden daha sahihtir. c) Cevaz bildiren hadîsler âdete nazaran mal sahiplerinin razı olduklarının bilinmesine hamledilirler. d) Cevaz meselesi zaruret zamanlarına hamledilir. Nitekim islâm'ın ilk zamanlannda hâl böyle idi. Bu hususta Tahâvi de şunları söylemiştir: «Bu hadîsler misafir kabul etmenin vâcib olduğu zamanlara mahsustur. Resûlullah (Sallallahu Aleyhi ve Sellem) bunu emir buyurmuş; gelen misafir için hane sahibine vacip kılmıştır. Bilâhare vücup neshedilerek hükmü kaldırılınca adı geçen hadîslerin hükmü de kalkmıştır.» Hicret esnasında Nebi (Sallallahu Aleyhi ve Sellem) ile Hz. Ebû Bekr'in içtikleri süt hakkmda Kurtubî: «Bu Koyun sahibine bir idlâl (yâni nazı geçme) idî. Çünkü Hz. Ebû Bekir onu tanıyordu. Yahut o çobanın oradan geçenlere süt takdim edilmesine izin verdiğini bilirdi. Yahut o süt, kendisine emân verilmemiş bir harbîye ait olduğu için içmişlerdi...» diyor. Bu hususta daha başka sözler de söylenmiştir",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 14
			}
		}
	]
}