{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 454,
			"arabicnumber": "183.01",
			"text": "Bana Suveyd b. Said de tahdis etti. Bana Hafs b. Meysere, Zeyd b. Eslem'den tahdis etti. Ata b. Yesar'dan, o Ebu Said el-Hudri'den rivayet ettiğine göre Resulullah (Sallallahu aleyhi ve Sellem)'in zamanında bazı kimseler: Ey Allah'ın Resulü kıyamet gününde Rabbimizi görecek miyiz, dediler. Resulullah (Sallallahu aleyhi ve Sellem): \"Evet\" buyurdu ve şöyle devam etti: \"Beraberinde bulut yokken havanın açık olduğu öğle vaktinde güneşi görmekte birbirinize zahmet verir misiniz? Yine dolunay gecesinde bulut yokken dolunayı görmekte birbirinize zorluk ve sıkıntı verir misiniz?\" Ashab: Hayır, ey Allah'ın Resulü deyince şöyle buyurdu: \"Kıyamet gününde Allah Tebareke ve Teala'yı görmekte ancak bu ikisinden birisini görürken birbirinize vereceğiniz zahmet kadar zahmet verirsiniz. Kıyamet gününde bir münudi yüksek sesle şu ilanı yapacak: Her bir ümmet dünyada iken neye ibadet ediyor idiyse onun arkasından gitsin. Şanı yüce Allah'tan başka putlara, dikili taş ve haykellere ibadet edip de cehennem ateşine ardı arkasına dökülmeyecek hiçbir kimse kalmayacak. Nihayet geriye yalnızca iyi ve kötü Allalı'a ibadet edenlerle, kitap ehlinden bir miktar kalıntılar kalınca Yahudiler çağrılacak ve onlara: Ney'e ibadet ediyordunuz denilecek. Onlar: Bız Aliah'in oğlu Üzeyr'e ibadet ediyorduk, diyecekler. Onlara: Yalan söylediniz, Allah ne bir zevce, ne bir evlat edinmiştir. Şimdi ne istiyorsunuz denilecek. Onlar, Rabbimiz Susadık bize su ver diyevekler. Onlara: O su'ya gitmezmisiniz diye işaret edilecek, (denilecek). Birbirini yiyip bıtiren bir serabı andıran cehennem ateşine haşrediiecekler ve cehennem içine arka arkaya dökülecekler: Sonra hristiyanlar çağrılacak onlara da: Neye ibadet ediyordunuz denilecek. Biz Allah'ın oğlu Mesih'e ibadet ediyorduk diyecekler. Onlara: Yalan söylediniz, Allah ne bir zevce, ne bİr evlat edindi denilecek. Sonra onlara: Ne istiyorsunuz diye soru!acak, onlar Rabbimiz susadık, bize su ver diyecekler. Kendilerine haydi suya gelmezmisiniz diye işaret olunacak. Onlar da birbirini yiyip bitiren bir serabı andıran cehenneme haşredilecekler ve cehennem ateşine arka arkaya dökülecekler. Nihayet geriye iyi olsun, kötü olsun yüce Allah'a ibadet eden kimselerden başkası kalmayınca, şanı yüce ve her türlü eksiklikten münezzeh alemlerin Rabbi onların yanına onu görmüş oldukları surete en yakın bir surette gelerek: Ne bekliyorsunuz, her ümmet neye ibadet ediyor idiyse onun arkasından gidiyor, buyuracak. Onlar: Rabbimiz bizler dünyada iken kendilerine en çok muhtaç olduğumuz bir zamanda insanlardan ayrı kaldık, onlarla birlikte olmadık, diyecekler. Alemlerin Rabbi: Rabbiniz benim diyecek, onlar: Senden Allah'a sığınırız. Biz Allah'a hiçbir şeyi ortak koşmayız, diyecekler. -Bunu iki yahut üç defa tekrar edecekler.- Nihayet onların bir kısmı neredeyse dönmeye kalkışacakken yüce Allah: Peki sizinle onun arasında onu kendisiyle tanıyacağınız bir alamet var mı, buyuracak. Onlar evet diyecekler. Bu sefer baldırın üzeri açılacak. (Dünyada iken) kendiliğinden Allah'a secde edenlerden, Allah'a secde etmesi için izin vermediği hiçbir kimse kalmayacak. Diğer taraftan (kendisini küfür dolayısıyla gelecek kötülüklerden) korumak maksadıyla (takiyye olarak) ve riyakarlık yaparak secde edip de sırtı tek bir tabaka haline getirilmeyecek (dümdüz edilip, kaskatı olmayacak) hiç kimse de kalmayacaktır. Böyle kimseler secde etmek istedikçe ensesi üzerine (sırtüstü) yıkılacaklar. Sonra başlarını kaldırdıklarında onun kendisini ilk defa görmüş oldukları suretine döndüğünü görecekler. Ben sizin Rabbinizim, diyecek onlar da: Sen Rabbimizsin, diyecekler. Sonra cehennem'in üzerine köprü kurulacak ve şefaate izin verilecek. Onlar: Allah'ım, esenlik ver esenlik, diyecekler.\" Ey Allah'ın Resulü, köprü nedir, diye sordular. Şöyle buyurdu: \"Kaypak ve kaygandır. Onda kancalar, çengeller ve Necid'de olan ve sa'dan denilen bir de diken vardır. Müminler (köprünün üzerinden) göz kırpması gibi, şimşek gibi, rüzgar gibi, kuş gibi, en asil atlar ve develer gibi geçecekler. Kimisi kurtulmuş ve esenliğe kavuşmuş olacak, kimisi yaralı bereli salınmış olacak, kimisi de cehennem ateşine yığılmış kalmış olacak. Nihayet müminler ateşten kurtulacaklarında, nefsim elinde olana yemin ederim ki, sizden birinizin hakkın tahsil edilmesi hususunda Allah'a şiddetlice (ileri derecede) yalvarıp yakarması, kıyamet gününde cehennem ateşinde bulunan mümin kardeşleri için yalvarıp yakarmasından daha ileri olmayacaktır. Rabbimiz, bizimle beraber oruç tutuyorlar, namaz kılıyorlar, haccediyorlardı, diyecekler. Onlara: Tanıdığınız kimseleri çıkartın denilecek ve suretleri cehennem ateşine haram edilir. Onlar da cehennem ateşinin kimisinin bacaklarının yarısına, kimisinin diz kapaklarına kadar yaktığı çok sayıda kimseleri çıkartacaklar sonra: Rabbimiz, içinde bize kendilerini çıkartmamızı emrettiğin kimselerden hiçbir kişi kalmadı, diyecekler. Yüce Allah: Dönün, kalbinde hayır adına bir dinar ağırlığı kadar bir şey bulduğunuz kimseleri çıkartın buyuracak, onlar da bunun üzerine çok sayıda kimseyi çıkartacaklar, sonra da: Rabbimiz, bize çıkartmamızı emrettiklerinden hiç kimseyi orada bırakmadık, diyecekler. Sonra yine: Dönün, kalbinde hayır adına yarım dinar ağırlığında bir şeyler bulduğunuz kimseleri de çıkartın, buyuracak onlar da çok sayıda kimseyi çıkaracaklar sonra: Rabbimiz, bize çıkarmamızı emrettiklerinden hiçbir kimseyi orada bırakmadık, diyecekler. Sonra: Geri dönün, kalbinde hayır namına zerre ağırlığınca bir şeyler bulduğunuz kimseleri çıkartın buyuracak, çok sayıda kimseyi çıkaracaklar sonra da: Rabbimiz orada hayır adına bir şey bırakmadık, diyecekler.\" Ebu Said el-Hudri de şöyle derdi: Eğer bu hadisi tasdik etmiyorsanız dilerseniz yüce Allah'ın: \"Allah şüphesiz zerre ağırlığı kadar dahi zulmetmez. (Yapılan) bir iyilik olursa onu kat kat arttırır ve lütfundan büyük bir mükafat verir. \" (Nisa, 40) buyruğunu okuyunuz. ''Aziz ve Celil Allah şöyle buyuracak: Melekler şefaat etti, nebiler şefaat etti, müminler şefaat etti. En merhametlilerin merhametlisinden başka (şefaat edecek) kalmadı buyuracak ve ateşten bir avuç alıp, içinden hayır adına hiçbir şey işlememiş, adeta kömüre dönmüş bir topluluk çıkartacak, onları hayat ırmağı denilen cennet yolları üzerindeki bir nehre atacak. Selin sürükledikleri arasında biten bir tanenin çıktığı gibi çıkacaklar. Bu gibi tanelerin taşın ya da ağacın yanında bittiğini görmüyor musunuz? Bunlardan güneşe bakanları sarımtrak ve yeşilimtrak olur, gölgede kalanları ise beyaz olur.\" Ashab: Ey Allah'ın Resulü, sanki çölde koyun otlatmış gibisin, dediler. (Devamla) buyurdu ki: \"Boyunlarında mühürler olduğu halde inci gibi çıkarlar. Cennetlikler onları tanıyacak. İşte bunlar Allah'ın önceden işledikleri herhangi bir amel ve yaptıkları bir hayır olmaksızın cennete soktuğu Allah'ın azatlılarıdır. Sonra şöyle buyuracak: Cennete girin, her neyi görürseniz o sizindir. Onlar: Rabbimiz, bize alemlerden kimseye vermediğini verdin, diyecekler. Yüce Allah: Sizin için benim nezdimde bundan daha da üstünü vardır buyuracak, onlar: Rabbimiz, bundan daha üstün ne olabilir ki, diyecekler. O: Benim rızamdır, ebediyen size gazap etmeyeceğim, buyuracak. \" Diğer tahric: Buhari, 4581, 7439; Tuhfetu'I-Eşraf, 4172 451 - 453",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 359
			}
		}
	]
}