{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4555,
			"arabicnumber": "1747",
			"text": "Bize Ebû Kureyb Muhammed b. Alâ* rivayet etti. (Dediki): Bize ibni'I-Mubârek, Ma'merden naklen rivayet etti. H. Bize Muhammed b. Râfi' de rivayet etti. Lâfız onundur. (Dediki): Bize Abdürrazzâk, rivayet etti. (Dediki): Bize Ma'mer, Hemmâm b. Münebbih'den naklen haber verdi. Hemmâm : Bize Ebû Hureyre'nin Resûlullah (Sallallahu Aleyhi ve Sellem)'den rivayet ettiği budur, diyerek bir takım hadîsler zikretmiştir; ezcümle, Resûlullah (Sallallahu Aleyhi ve Sellem): «Nebilerden bir Nebi gazaya çıktı da kavmine şunları söyledi: Nikâhla bir kadına mâlik olup da onunla gerdeğe girmeyi istediği halde henüz girememiş bir adam benim arkamdan gelmesin! Başka biri ev yapmış, fakat tavanını çekememişse (o da gelmesin!) Bir başkası koyun veya gebe develer satın almış da doğurmalarını bekliyorsa (o da gelmesini). Bunu müteakib gazaya çıktı; ve o yere ikindi namazı vakti yahut ona yakın bir zamanda yaklaştı; ve güneşe: Sen me'mursun ama ben de me'murum! Allahım, bunu benim üzerimde biraz durdur! dedi. Bunu müteâkıb güneş onun üzerinde Allah o yeri kendisine fethedinceye kadar durduruldu. Derken aldıkları ganimetleri topladılar. Arkacığından onları yemek için ateş geldi: Fakat onları tatmaktan çekindi. Nebi: Sizin içinizde ganimete hiyanet var; o halde bana her kabileden bir adam bey'at etsin! dedi. Bu surette ona bey'at ettiler. Derken bir adamın eli onun eline yapıştı. Nebi: Ganimete hıyanet sizin içinizdedir, bana senin kabilen bey'at etsin! dedi. Bu sefer ona kabilesi bey'at etti. Fakat eli iki veya üç kişinin eline yapıştı; ve (yine): Ganimete hıyanet sizdedir; sizler hıyanet ettiniz! dedi. Nihayet ona inek başı kadar altın çıkardılar; ve onu yerde duran malın içine koydular. Arkasından ateş gelerek o malı yedi. işte ganimetler bizden önce hiç bir kimseye helâl olmamıştır. Bunun sebebi : Çünkü Allah Tebâreke ve Teâlâ bizim za'fımızı ve aczimizi bildi de onu bize tertemiz heiâi kıldı.» buyurmuşlardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 36
			}
		}
	]
}