{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4555,
			"arabicnumber": "1747",
			"text": "(Bize Ebû Küreyb Muhammed b. Alâ' rivâyet etti. ki): Bize İbn’l-Mubârek, Ma'merden naklen rivâyet etti. H. Muhammed b. Râfi' de rivâyet etti. Lâfız onundur. ki): Bize Abdürrazzâk, rivâyet etti. ki): Bize Ma'mer, Hemmâm b. Münebbih'den naklen haber verdi. Hemmâm: Bize Ebû Hüreyre'nin Resûlüllah (sallallahü aleyhi ve sellem)'den rivâyet ettiği budur, diyerek bir takım hadîsler zikretmiştir; ezcümle Resûlüllah (sallallahü aleyhi ve sellem) bir peygamber gazaya çıktı da kavmine şunları söyledi: Nikâhla bir kadına Mâlik olup da onunla gerdeğe girmeye istediği halde henüz girememiş bir adam benim arkamdan gelmesin! Başka biri ev yapmış, fakat tavanını çekememişse (o da gelmesin!) Bir başkası koyun veya gebe develer satın almış da doğurmalarını bekliyorsa (o da gelmesini). müteakib gazaya çıktı; ve o yere ikindi namazı vakti yahut ona yakın bir zamanda yaklaştı; ve güneşe: Sen me'mursun ama ben de memurum! Allahım, bunu benim üzerimde biraz durdur! dedi. Bunu müteâ-kıb güneş onun üzerinde Allah o yeri kendisine fethedinceye kadar durduruldu. Derken aldıkları ganimetleri topladılar. Arkacığından onları yemek için ateş geldi: Fakat onları tatmaktan çekindi. Peygamber: Sizin içinizde ganimete hiyanet var; o halde bana her kabileden bir adam bey'at etsin! dedi. Bu surette ona bey'at ettiler. Derken bir adamın eli onun eline yapıştı. Peygamber: Ganimete hıyanet sizin içinizdedir, bana senin kabilen bey'at etsin! dedi. Bu sefer ona kabilesi bey'at etti. Fakat eli iki veya üç kişinin eline yapıştı; ve (yine): Ganimete hıyanet sizdedir; sizler hıyanet ettiniz! dedi. Nihayet ona inek başı kadar altın çıkardılar; ve onu yerde duran malın içine koydular. Arkasından ateş gelerek o malı yedi. ganimetler bizden önce hiç bir kimseye helâl olmamıştır. Bunun sebebi: Çünkü Allah Tebârekc ve Teâlâ bizim za'fımızı ve aczimizi bildi de onu bize tertemiz helâl kıldı.» buyurmuşlardır. hadîsi Buhârî «Kitâbu'l-Humüs» ve «Kitâbü'n-Nikâh»da tahrîc etmiştir. Kadının ferci demekse de bu gibi yerlerde nikâhla almak mânâsında kullanılır. Hâmile develer demektir. Ednâ: Fi'li rubaidir. Bu kelime ya «askerlerini yaklaştırdı» mânâsına müteaddidir; yahut «fethi yaklaştı» mânâsına lâzım olarak kullanılmıştır. Iyâz'in beyânına göre duası kabul edilerek güneş durdurulan bu Peygamber Yûşa' (aleyhisselâm)'dır. Muhasara ederek aldığı şehir de Filistin'deki Erîhâ'dır. Güneşin durdurulması mu'cizesi bizim Peygamberimiz (sallallahü aleyhi ve sellem)’e de iki defa nasîb olmuştur. Bunların biri Hendek harbinde vaki' olmuş; müslümanlar güneş batıncaya kadar ikindi namazını kılamamışlar; sonra Allah'ın izni ile güneş geri dönmüş ve namazı kılmışlardı. Bu hâdiseyi bildiren hadîsi Tahâvi nakletmiş; ve: «Râvileri mevsuktur.- demiştir. îsrâ gecesinin sabahında olmuştur. Allâme Aynî bu hârikanın Hazret-i Mûsâ ve Süleyman (aleyhisselam)'la Hazret-i Alî'ye de vâki' olduğunu söyler. Yûşa' (aleyhisselâm)'ın güneşe: «Sen me'mursun ama ben de me'murum!» şeklindeki hitabı: «Sen batmaya me'mursun ama hen de namaz kılmaya veya güneş batmadan gaza etmeye me'murum!» manasınadır. Ganimet meselesine gelince: Geçmiş Peygamberlerin âdeti, alınan ganimeti bir yere toplamaktı. Sonra gökyüzünden bir ateş inerek o ganimeti yer; bu da onun kabulüne alâmet olurdu. Bu seferde ateş yine inmiş; fakat ganimeti yemek şöyle dursun atmamıştır bile! Bunun sebebi ganimete hıyanet karışması yani ondan bir şeyler aşırılmasıdır. Nitekim araştırılınca inek başı kadar bir altın parçasının aşırılmış olduğu meydana çıkmış; bilâhare gelen ateş ganimeti yakmıştır. ümmetlerin kurbanlarını da böyle bir ateş inerek yer; kurbanın kabulü bu suretle anlaşılırdı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 36
			}
		}
	]
}