{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4557,
			"arabicnumber": "1748.02",
			"text": "Bize Muhammed b. El-Müsennâ ile İbn Beşşâr rivâyet ettiler. Lâfız İbn'l-Müsennâ'nındır. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be, Simâk b. Harb'den, o da Muş'ab b. Sa'd'dan, o da babasından naklen rivâyet etti. (Şöyle dedi): hakkımda dört âyet inmiştir. Bir kılıç ele geçirdim... (Sa'd) bu kılıcı Peygamber (sallallahü aleyhi ve sellem)'e getirerek: Yâ Resûlallah, bu kılıcı bana nefel olarak ver! demiş. Peygamber (sallallahü aleyhi ve sellem): onu!» buyurmuş. Sonra ayağa kalkmış. Peygamber (sallallahü aleyhi ve sellem) kendisine: aldığın yere koy!» buyurmuş. Sonra (tekrar) ayağa kalkarak: Bunu bana nefel olarak ver yâ Resûlallah! demiş. (Yine): onu!» buyurmuşlar. (Sa'd tekrar) ayağa kalkarak: Yâ Resûlallah! Bunu bana nefel olarak ver! Ben (harbde) yeteri olmayanlar gibi mi tutulacağım? demiş. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) kendisine (yine): aldığın yere koy!» buyurmuşlar. Ar kaçığın dan şu âyet inmiş: Sana enfâlin hükmünü soruyorlar! De ki: Enfal, Allah ve Resûlüne aittir!..» Nefelin cem'idir. Ordu kumandanı tarafından bazı askerlere verilen ganimet malıdır. Bununla o askerin iaşesi te'mîn edilmiş ve harbe karşı şevki arttırılmış olur. şerîî ganimet malından kimseye bir şey verilmesi helâl olmayacağına delâlet ediyorsa da Kâdî Iyâz: «İhtimal bu hadîs ganimet âyeti inmezden ve ganimet helâl kılınmazdan evvel vârid olmuştur. Doğrusu da budur. Hadîs de buna delâlet ediyor. Zîra hadîsin tamamında Peygamber (sallallahü aleyhi ve sellem)’in âyet indikten sonra Sa'd'a: kılıcını! Sen onu istediğin vakit o ne benimdİ, ne senin! Şimdi Allah onu bana verdi; ben de sana veriyorum! buyurduğu rivâyet olunmuştur.» diyor. buradaki âyetin mensuh olup olmadığı hususunda ihtilâf etmişlerdir. Bazılarına göre olun ki, ganimet olarak aldığınız bir şeyin beşte birî Allah'a ve Resûlüne aiddir...\" Enfâl sûresi, âyet: 41. âyet-i kerîmesi ile neshedilmiştir. Enfâl âyetinin muktezâsınca ganimetlerin hepsi Peygamber (sallallahü aleyhi ve sellem)'e mahsustu. Bilâhare Cenâb-i Hak diğer âyetle onların beşte dördünü ganimeti düşmandan alan gazilere tahsis buyurdu. Bu kavil Hazret-i İbn Abbâs ile bir cemaattan nakledilmiştir. takımları âyetin muhkem olduğunu, nefelin beşte birden verileceğini söylemiş; Bazıları da: «Âyet muhkemdir; kumandan ganimet malından münasib gördüğü askere dilediği kadar verebilir.» demişlerdir. «Âyet muhkemdir ama tahsis edilmiştir. Ondan murad: Seriyyelerin ganîmetidir.» diyenler de olmuştur. Sa'd: «Benim hakkımda dört âyet inmiştir.» demiş, fakat burada onlardan yalnız birini yani Enfâ1 âyetini zikretmiştir. Diğer üçünü İmâm Müslim «Kitabü'l-Fedâil»de beyân eder ki, bunlar: Anne babaya iyilik, şarabın haram kılınması ve «Rablerine duâ edenleri koğma!» mealindeki âyetlerdir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 38
			}
		}
	]
}