{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4568,
			"arabicnumber": "1751.03",
			"text": "Bize Ebâ't-Tâhir ile Harmele de rivâyet ettiler. Lâfız Harmele'-nindir. (Bediler ki): Bize Abdullah b. Vehb haber verdi. ki): Mâlik b. Enes'i şunları söylerken işittim: Bana Yahya b. Said, Ömer b. Kesir b. Eflâh'dan, o da Ebû Katâde'nin dostu Ebû Muhammed'den, o da Ebû Katâde’den naklen rivâyet etti. Şöyle dedi: (harbi) yılında Resûlüllah (sallallahü aleyhi ve sellem)’le birlikte (gazaya) çıktık. İki ordu karşılaşınca müslümanlarda bir bozulma oldu. Derken müşriklerden bir adam gördüm ki, müslümanlardan bir zâtı alt etmişti. Hemen ona dönerek arkasından yanına geldim ve boynunu vurdum. Ama üzerime dönerek beni öyle bir sıktı ki bundan ölümün korkusunu duydum: Sonra can vererek beni bıraktı. Müteakiben Ömer b. Hattab'a yetiştim: Bu insanlara ne oldu? dedi. Ben de: Allah'ın emri! dedim. Sonra cemaat döndüler. Resûlüllah (sallallahü aleyhi ve sellem) de oturdu ve: kimse birini öldürür de onun aleyhine beyyinesi de bulunursa, olenîn üzerindeki eşyası onun olur.» buyurdular. Bunun üzerine ben ayağa kalkarak: Bana kim şâhidlik edecek? dedim. Sonra oturdum. Sonra Resûlüllah (sallallahü aleyhi ve sellem) yine deminki gibi buyurdu. Ben hemen kalkarak: Bana kim şâhidlik edecek? dedim; ve oturdum. Sonra Peygamber (sallallahü aleyhi ve sellem) o sözü üçüncü defa tekrarladı. Ben yine kalktım. Fakat Resûlüllah (sallallahü aleyhi ve sellem): ne oldu yâ Ebâ Katade?» diye sordu. Ben de kıssayı kendilerine anlattım. Derken cemaattan bir adam: Doğru söyledi yâ Resûlallah! Bu öldürülenin üzerindeki eşyası bendedir; hakkından dolayı Ebû Katâde'yi razı ediver! dedi. Ebû Bekr-i Sıddîk ise: Hayır vallahi! Bu olamaz! Resûlüllah (sallallahü aleyhi ve sellem) Allah ve Resûlünün yolunda cenk eden Allah arslanlarından bir arslanın hakkını çiğneyerek onun eşyasını sana veremez! dedi. Artık Resûlüllah (sallallahü aleyhi ve sellem): söyledi. Bunu ona ver!» buyurdu; ve bana verdi. Sonra zırhı sattım da onunla Benî Selime (kabilesin)'de bir bahçe satın aldım. İşte İslâm'da ilk edindiğim mal budur. hadîsinde şu ibare vardır: «Ebû Bekir: Asla! Allah'ın arslanlarından bir arslanı bırakıp da onu Kureyş'ten bir sırtlancağiza veremez! dedi.» Leys'in hadîsinde: «Edindiğim ilk maldır.» cümlesi vardır. hadîsi Buhârî «Kitabü’l-Humüs»de tahrîc etmiştir. Müslim bu hadîsin birinci tarîkinde râvileri sıraladıktan sonra: «Ve hadîsi hikâye etmiştir» demiş; ikinci tarîkinde dahi; «Ve hadîsi nakletmiştir.» diyerek bu sözleri ile üçüncü tarîkte rivâyet edeceği hadîsi kasdetmiştir. diyor ki: «Bu, Müslim'in âdetine göre garîb bir şeydir. Senin için yaptığım bu tahkiki belle! Gerçekten bâzı kitab yazanların bu hadîste yanıldığını ve onu ilk iki tarîkten evvelki hadîse bağlı zannettiklerini gördüm. Nitekim ekseriyetle Müslim'in malûm âdeti de budur...» Mekke'ye üç mil mesafede bir vadidir. Burada hicretin sekizinci yılında müşriklerle müslümanlar arasında harb olmuş; müslümanlara çokluklarından dolayı ucub geldiği için harbin başında bozulmuşlar, fakat sonra Allah üzerlerine sekînet ve yardımcı melekler indirerek kâfirlerin cezasını vermişti. İşte Hazret-i Ömer'in: «Bu insanlara ne oldu?» demesi bozulduklarına şaştığı içindir. Bazılarına göre bu sözün mânâsı: «Bu bozgundan sonra acaba halleri ne olacak!» demektir. Buna mukabil Ebû Katâde'nin: «Allah'ın emri» diye cevap vermesi «Allah'ın emri geldi.» Yahut: «Allah'ın emri gâlibtir; akıbet ehl-i takvanındır.» manasınadır. gazada müslümanların bozulması umûmî değildi. Resûlü Ekrem (sallallahü aleyhi ve sellem) ile mü'minlerden bir taife yerlerinden ayrılmamışlardır. Bu hususta meşhur hadîsler vardır ki, yeri geldikçe görülecektir. diyor ki: «Peygamber (sallallahü aleyhi ve sellem) bozguna uğramıştır demenin caiz olmadığına müslümanlar icmâı nakledilmiştir. Onun hiç bir yerde bizzat münhezim olduğunu hiç bir kimse rivâyet etmemiştir. Bilâkis sahîh hadîsler daima ikdam ve sebatını isbât etmektedir.» izen» ifâdesi bütün rivâyetlerde bu şekilde tesbit edilmiştir. Hattâbi ile lisan uleması bunun râviler tarafından yanlışlıkla yapılmış bir değişiklik olduğunu, doğrusunun «lâhallahi zâ» şeklinde kullanılması lâzım geldiğini, bunun «lâ vallahi zâ» mânâsında bir yemîn olduğunu söylemişlerdir. Daha başka söz edenler de olmuştur. sırtlan mânâsına gelen «dab'»ın kıyâsa muhalif İsmi tasgiridir. Hazret-i Ebû Bekir herhalde Ebû Katâde'yi arslan diye tavsif edince Öteki zâtı ona nisbetle küçülterek sırtlana benzetmiştir. Çünkü sırtlanın yırtıcılığı zayıftır. Bu hayvan aciz ve hamakatla vasıflanır. Fakat «Üdaybi'» kelimesi «Üsaybiğ» şeklinde de rivâyet olunmuştur. Hattâbî'nin beyânına göre üsaybiğ bir nevi' kuştur. Başkaları onu boya mânâsına gelen sıbğanın tasgiri kabul etmiş ve kimi rengi kara olduğu için, kimi renginin çirkinliğinden dolayı, bazıları da onu zayıflık ve aşağılıkla vasıflandırmak için kendisine böyle hitab ettiğini söylemişlerdir. Hattâ «esbağ» denilen bir nebata benzetmiş olması da caizdir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 49
			}
		}
	]
}