{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4568,
			"arabicnumber": "1751.03",
			"text": "{…} Bize Ebâ't-Tâhir ile Harmele de rivayet ettiler. Lâfız Harmele'nindir. (Bedilerki): Bize Abdullah b. Vehb haber verdi. (Dediki): Mâlik b. Enes'i şunları söylerken işittim: Bana Yahya b. Said, Ömer b. Kesir b. Eflâh'dan, o da Ebu Katâde'nin dostu Ebû Muhammed'den, o da Ebû Katâde'den naklen rivayet etti. Şöyle demiş: Huneyn (harbi) yılında Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte (gazaya) çıktık, iki ordu karşılaşınca müslümanlarda bir bozulma oldu. Derken müşriklerden bir adam gördüm ki, müslümanlardan bir zâtı alt etmişti. Hemen ona dönerek arkasından yanına geldim ve boynunu vurdum. Ama üzerime dönerek beni öyle bir sıktı ki bundan ölümün korkusunu duydum: Sonra can vererek beni bıraktı. Müteakiben Ömer b. Hattab'a yetiştim: — Bu insanlara ne oldu? dedi. Ben de: — Allah'ın emri! dedim. Sonra cemaat döndüler. Resûlullah (Sallallahu Aleyhi ve Sellem) de oturdu ve: «Bir kimse birini öldürürde onun aleyhine beyyinesi de bulunursa, olenîn üzerindeki eşyası onun olur.» buyurdular. Bunun üzerine ben ayağa kalkarak: — Bana kim şâhidlik edecek? dedim. Sonra oturdum. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) yine deminki gibi buyurdu. Ben hemen kalkarak: — Bana kim şâhidlik edecek? dedim; ve oturdum. Sonra Nebi (Sallallahu Aleyhi ve Sellem) o sözü üçüncü defa tekrarladı. Ben yine kalktım. Fakat Resûlullah (Sallallahu Aleyhi ve Sellem): «Sana ne oldu yâ Ebâ Katade?» diye sordu. Ben de kıssayı kendilerine anlattım. Derken cemaattan bir adam: — Doğru söyledi yâ Resûlâllah! Bu öldürülenin üzerindeki eşyası bendedir; hakkından dolayı Ebû Katâde'yi razı ediver! dedi. Ebû Bekr-i Sıddîk ise: —'Hayır vallahi! Bu olamaz! Resûlullah (Sallallahu Aleyhi ve Sellem) Allah ve Resulünün yolunda cenk eden Allah arslanlarından bir arslanın hakkını çiğneyerek onun eşyasını sana veremez! dedi. Artık Resûlullah (Sallallahu Aleyhi ve Sellem): «Doğru söyledi. Bunu ona ver!» buyurdu; ve bana verdi. Sonra zırhı sattım da onunla Benî Selime (kabilesin)'de bir bahçe satın aldım. işte islâm'da ilk edindiğim mal budur. Leys'in hadîsinde şu ibare vardır: «Ebû Bekir: Asla! Allah'ın arslanlarından bir arslanı bırakıp da onu Kureyş'ten bir sırtlancağiza veremez! dedi.» Yine Leys'in hadîsinde: «Edindiğim ilk maldır.» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 49
			}
		}
	]
}