{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4580,
			"arabicnumber": "1759.01",
			"text": "Bana Muhammed b. Râfi' rivayet etti. (Dediki); Bize Huceyn haber verdi. (Dediki): Bize Leys, Ukayl'den, o da ibni Şihâb'tan, o da Urve b. Zübeyr'den, o da Âişe'den naklen rivayet ettiki, Aişe kendisine şunu haber vermiş: Fâtıme binti Resûlullah (Sallallahu Aleyhi ve Sellem) Ebû Bekr'e haber göndererek Resûlullah (Sallallahu Aleyhi ve Sellem)'in, kendisine Allah'ın Medine ile Fedek'de fey' olarak tahsis buyurduğu mallardan ve Hayber'in beşte birinden kalanlardan mirasını ondan istedi. Ebû Bekir de şunu söyledi: — Şüphesiz ki Resûlullah (Sallallahu Aleyhi ve Sellem); «Bize mirasçı olunmaz! Bıraktığımız sadakadır. Ancak Muhammed (Sallallahu Aleyhi ve Sellem)'in ailesi bu maldan yer!» buyurmuştur. Vallahi ben, Resûlullah (Sallallahu Aleyhi ve Sellem)'in sadakasından hiç bir şeyi, Resûlullah (Sallallahu Aleyhi ve Sellem) zamanındaki hâlinden değiştiremem! Onun hakkında mutlaka Resûlullah (Sallallahu Aleyhi ve Sellem) ne yaptı ise onunla amel ederim! Hâsılı Ebû Bekir, Fâtıme'ye bir şey vermekten çekindi. Fâtıme de bu hususta Ebû Bekr'e gücendi; ve kendisini terk etti; Ölünceye kadar da onunla konuşmadı. Fâtıme, Resûlullah (Sallallahu Aleyhi ve Sellem)'den sonra altı ay yaşadı. Vefat ettiği vakit onu kocası Alî b. Ebî Tâlib geceleyin defnetti. Onun vefatını Ebû Bekr'e haber vermedi. Namazını Alî kıldı. Fâtıme'nin hayatı müddetince Alî insanlardan itibar görmüştü. O vefat edince Alî halkın i'tbarını kaybetti. Ve Ebû Bekir'le barışarak ona bey'at etmek istedi. O aylarda henüz bey'at etmemişti. Ve Ebû Bekr'e: Bize gel! Ama seninle beraber başka bir kimse gelmesin! diye haber gönderdi. (Bunu Ömer b. Hattâb gelmesin diye yapıyordu.) Bunun üzerine Ömer, Ebû Bekr'e: — Vallahi onların yanına yalnız başına girme! dedi. Ebû Bekir ise: — Bana ne yapabilirler ki! Vallahi ben onlara giderim! cevabını verdi. Müteakiben Ebû Bekir yanlarına girdi. Alî b. Ebî Talib bir şehâdet getirdi. Sonra şunları söyledi: — Biz yâ Ebâ Bekr, senin faziletini ve Allah'ın sana olan ihsanını biliriz! Allah'ın sana verdiği bir bayırı sana çok görmeyiz. Lakin sen bu (hilâfet) iş (in) de bize karşı istibdâd gösterdin. Biz Resûlullah (Sallallahu Aleyhi ve Sellem)'e olan karabetimizden dolayı kendimiz için bir hak görüyorduk... Alî, Ebû Bekr'Ie konuşmasına devam etti. Nihayet Ebû Bekr'in gözleri boşandı. Sözü Ebû Bekir alınca şunları söyledi: — Nefsim yed-i kudretinde olan Allah'a yemin ederim ki, Resûlullah (Sallallahu Aleyhi ve Sellem)'in yakınları benim için kendi yakınlarıma yardım etmemden daha iyidir! Benimle sizin aranızda şu mallar hususunda geçen ihtilâfa gelince: Hiç şüphe yoktur ki ben bunlar hakkında hakta kusur etmiş değilim! Resûlullah (Sallallahu Aleyhi ve Sellem)'in yaptığını gördüğüm bir şeyi yapmadan bırakmadım!.. Bunun üzerine Alî Ebû Bekr'e: — Bey'at için miadın öğleden sonradır! dedi. Ebû Bekir öğle namazını kılınca Alî minbere çıkarak şehâdet getirdi; ve Alî'nin hâlini, bey'attan niçin geciktiğini, Ebû Bekr'e i'tizârda bulunduğu özrünü anlattı. Sonra istiğfar etti. Ve Ali b. Ebî Tâlib şehâdet getirerek Ebû Bekr'in hakkını ta'zîm eyledi. Bu yaptığına kendisini sevk eden şey ne Ebû Bekr'i çekememezlik, ne de Allah'ın ona verdiği fazileti inkâr olduğunu söyledi. (Sözüne devamla): — Lâkin biz kendimiz için bu işte bîr nasîb görüyorduk; ama bize karşı istibdat gösterildi; biz de gücendik! dedi. Müslümanlar buna sevindi ve: — isabet ettin! dediler. Emr-i ma'rûfa döndüğü zaman artık müslümanlar Alî'ye yakın oldular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 61
			}
		}
	]
}