{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4588,
			"arabicnumber": "1763",
			"text": "(Bize Hennâd b. Seriy rivâyet etti. ki): Bize İbnül-Mübârek, İkrime b. Ammâr'dan rivâyet etti. ki): Bana Simâk El-Hanefî rivâyet etti. ki): İbn Abbâs'ı şöyle derken işittim: Bana Ömer b. Hattâb rivâyet etti. ki): Bedir harbi olduğu gün... H. Züheyr b. Harb da rivâyet etti. Lâfız onundur. ki): Bize Ömer b. Yûnus El-Hanefî rivâyet etti. ki): Bize İkrime b. Ammâr rivâyet etti. ki): Bana Ebû Zümeyl (bu zât Simâk El-Hanefî'dir) rivâyet etti. ki): Bana Abdullah b. Abbâs rivâyet etti. ki): Bana Ömer b. Hattâb rivâyet etti. ki): harbi olduğu gün Resûlüllah (sallallahü aleyhi ve sellem) müşriklere baktı. Onlar bin nefer, ashabı ise üç yüz ondokuz kişi idiler. Bunun üzerine Nebiyyullah (sallallahü aleyhi ve sellem) kıbleye döndü. Sonra ellerini uzatarak Rabbine: Bana va'dettiğini yerine getir! Allah im, bana va'dettiğini ver! Allahım, eğer ehl-i Islâmdan olan şu cemaati helâk edersen (bundan sonra) yeryuünde sana ibâdet olunmaz!» diye niyaz etmeye başladı. Ellerini uzatarak kıbleye karşı Rabbine o derece niyazda bulundu ki, nihayet omuzlarından cübbesi düştü. Müteakiben Ebû Bekir, yanına gelerek cübbesini aldı ve omuzlarına koydu. Sonra arkasından ona sarılarak: Yâ Nebiyyallah! Rabbine yaptığın dilek yeter! Şüphesiz o sana va'dettiğmî yerine getirecektir! dedi. Az sonra Allah (azze ve celle): Rabbinizden imdat istiyordunuz! O da: Ben size birbiri ardınca gelecek bin melekle imdat göndereceğim! diye cevap vermişti!\" Sûre-i Enfâl âyet: 9. âyetini İndirdi ve Allah ona meleklerle imdat gönderdi. Zümeyl ki): Sonra bana İbn Abbâs rivâyet etti. ki): O gün müslümanlardan bir zât, önünde müşriklerden bir adamın peşinden koşarken ansızın üzerinde bir kırbaç darbesi işitti. Ve süvarinin: Dur yâ Hayzûm! diyen sesini duydu. Bir de Önündeki müşrike baktı ki, boylu boyunca yere serilmiş! Burnu berelenmiş; yüzü de kırbacın vurduğu şekilde yarılmış olduğunu gördü. Bütün bunlar yemyeşil olmuştu. Az sonra Ensârî gelerek bu hâdiseyi Resûlüllah (sallallahü aleyhi ve sellem)'e anlattı da: söyledin; bu semâdan gelen üçüncü imdattandır!»buyurdular. Artık o gün (müslümanlar) yetmiş kişi Öldürdüler; yetmiş de esîr aldılar. Zümeyl ki): İbn Abbâs şunu söyledi: Müslümanlar esîrleri aldıktan sonra Resûlüllah (sallallahü aleyhi ve sellem) Ebû Bekirle Ömer'e: esirler hakkında re'yiniz nedir?» diye sordu. Ebû Bekir: Yâ Nebiyyallah! Bunlar amca oğulları ve akrabadırlar; ben onlardan fidye jftlmjın fikrindeyim! Bu suretle küffar üzerine kuvvetimiz olur. Umulur ki Allah onları İslâm'a hidayet buyurur! dedi. Müteakiben Resûlüllah (sallallahü aleyhi ve sellem): ne fikirdesin ey Hattâb oğlu?» diye sordu. (Ömer diyor ki); Ben: Hayır, vallahi yâ Resûlallah! Ben Ebû Bekr'in fikrinde değilim! Lâkin ben, bize müsaade buyursan da şunlann boyunlarını vuruversek! fikrindeyim. Ukayl'e karşı Alî'ye müsaade buyurmaksın ki onun boynunu vursun! Bana da filâna (bir yakını) karşı müsaade buyurmaksın, ben de onun boynunu vurmalıyım! Zîra bunlar küfrün İmâmları ve eşrafıdırlar! dedim. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) Ebü Bekr'in söylediğine meyletti. Benim söylediğimi beğenmedi. Ertesi gün olunca ben geldim. Bir de ne göreyim! Resûlüllah (sallallahü aleyhi ve sellem)’le Ebû Bekir oturmuş ağlıyorlar!.. Yâ Resûlallah! Bana haber ver; sen ve arkadaşın neden ağlıyorsunuz? Ağlayacak bir şey bulursam ben de ağlarım; ağlayacak bir şey bulmazsam siz ağladığınız için ben de ağlar görünürüm! dedim. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): senin arkadaşlarının teklif ettiği fidye alma meselesine ağlıyorum. Gerçekten onların azapları bana şu ağaçtan daha yakın arzolundu.» buyurdu. (sallallahü aleyhi ve sellem) yakın bir ağaca işaret etmiş.) Allah (azze ve celle): üstünlüğü sağlamadıkça hiç bir Peygambere esir almak yaraşmaz.\" Sûre-i Enfâl âyet: 67-69. âyet-i kerîmesini \"Artık aldığınız ganimetten helâl hoş olarak yeyîn!\" âyetine kadar indirdi. Ve Allah müslümanlara ganimeti helâl kıldı. Medîne'den seksen mil yani dört konak mesafede Mekke ile Medîne arasında ma'ruf bir beldedir. Meşhur Bedir savaşı burada olmuştur. İbn Kuteybe'ye göre Bedir, aynı ismi taşıyan bir adama ait bir kuyudur. Sonradan sahibinin ismi kuyuya verilmiştir. Bedir gazası hicretin ikinci yılı ramazanının on yedinci cuma günü olmuştur. Buhârî'nin Hazret-i Abdullah b. Mes'ud'dan rivâyetinde o gün havanın çok sıcak olduğu bildirilmektedir. Hak, Resûlü Ekrem'ine iki taifeden birini va'detmişti. Ona ya müşriklerin kervanını nasîb edecek yahut ordularına karşı muzaffer kılacaktı.-Kervanları Suriye'ye ticaret için gitmiş ve dönmüştü. Binâenaleyh muhakkak harbte muzaffer olacaktı. Bundan emîn olmakla beraber Peygamber (sallallahü aleyhi ve sellem)’in Cenab-ı Hakka bu derece niyazda bulunmasını ulemâ şöyle îzâh etmişlerdir: Ekrem (sallallahü aleyhi ve sellem) bu niyazını ashabına gösterip o dehşetli anda onun dua ve niyazı sayesinde kalpleri kuvvet bulsun diye yapmıştır. Aynı zamanda duâ bir ibâdettir. Cenâb-ı Hak Resûlüne vâdettiğini o gün yerine getirmiş; küffan târu mâr etmek için gökten 1000 melek indirmiştir. îşte Hayzûm bu meleklerden birinin atıdır. dur demektir. Ancak bu kelime «Ukdum!» şeklinde de rivâyet olunmuştur. Bu takdirde mânâ: «İlerle!» demek olur. imdat olarak gökten melek inmesi Uhud ve Hendek gibi gazalarda da vâki' olmuş; ancak bu gazalarda melekler fi'len harb etmemişlerdir. Meleklerin inmesi zaferin esBâbındandır. Yoksa Teâlâ Hazretleri —hâşâ— bö'yle bir şeye muhtaç değildir. Meleklerin iştirak ettiği gazada dahi zaferi Allah ihsan etmiştir. şerîf duâ ederken kıbleye dönmenin ve el kaldırmanın müstehab olduğuna, duayı sesle okumanın cevazına delâlet etmektedir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 69
			}
		}
	]
}