{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4589,
			"arabicnumber": "1764.01",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Leys, Saîd b. Ebî Saîd'den naklen rivayet etti ki, Ebû Hureyre'yi şunu söylerken işitmiş: Resûlullah (Sallallahu A!eyhi ve Sellem) Necd tarafına suvari gönderdi. Bunlar Benî Hanîfe (kabilesin) den Sümame b. Usal denilen bir adam getirdiler. Bu zat Yemameliler'in reîsi idi. Onu mescidin direklerinden bir direğe bağladılar. Derken Resûlullah (Sallallahu A!eyhi ve Sellem) onun yanına çıkarak: «Ne haber ya Sümame?» dedi. Sümame şunları söyledi: — Bendeki ya Muhammed, hayırdır. Şayet öldürürsen kan sahibi birini öldürmüş olursun. ihsan edersen şükreden birine ihsan etmiş olursun! Eğer mal istiyorsan hemen dile! Sana dilediğin kadar mal verilir! Bunun üzerine Resûlullah (Sallallahu A!eyhi ve Sellem) onu terk etti. Ertesi günden sonraki gün gelince yine: «Ne haber ya Sümame?» diye sordu. O da: — Sana soylediğimdir! Eğer ihsan edersen şükreden birine ihsan etmiş olursun! öldürürsen kan sahibi birini öldürmüş olursun! Mal istiyorsan hemen dile! Sana dilediğin kadar mal verilir! dedi. Resûlullah (Sallallahu A!eyhi ve Sellem) onu yine terketti. Ertesi gün gelince (tekrar) : «Ne haber ya Sümame?» diye sordu. Sümame: — Bende sana söylediklerim var! Eğer ihsan edersen, şükreden birine ihsan etmiş olursun! öldürürsen kan sahibi birini öldürmüş olursun! Mal istiyorsan hemen dile! Sana dilediğin kadar mal verilecektir! dedi. Bunun üzerine Resûlullah (Sallallahu A!eyhi ve Sellem): «Sumame'yı serbest bırakın!» buyurdu. O da mescide yakın bir hurmalığa giderek yıkandı. Sonra mescide girdi. Ve: — Allah'tan başka ilah olmadığına şehadet ederim! Muhammed'in onun kulu ve resulü olduğuna da şehadet ederim! Ya Muhammed, vallahi yeryüzünde (şimdiye kadar) bana senin yüzünden daha sevimsiz bir yüz yoktu! Şimdi senin yüzün bana bütün yüzlerden daha sevimli oldu. Vallahi benim için senin dîninden daha sevimsiz bir dîn yoktu! Dînin de benim için bütün dînlerden daha sevimli oldu! Vallahi, benim için senin beldenden daha sevimsiz bir belde yoktu. Şimdi belden de benim için bütün beldelerden sevimli oldu! Süvarilerin beni yakaladığında ben umre yapmak istiyordum. Ne buyurursun? dedi. Bunun üzerine Resûlullah (Sallallahu A!eyhi ve Sellem) kendisini müjdeledi. Ve umre yapmasını emretti. Mekke'ye vardığında ona birisi: — Sen dininden mi döndün? diye sormuş. O da: — Hayır! Lakin ben Resulullah (Sallallahu A!eyhi ve Sellem)'le birlikte müslüman oldum! Hayır, vallahi! Size ResûluIIah (Sallallahu A!eyhi ve Sellem) izin vermedikçe Yemame'den bir buğday tanesi bile gelemez! demiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 70
			}
		}
	]
}