{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4601,
			"arabicnumber": "1769.04",
			"text": "(Bize Aliy b. Hüseyn b. Süleyman El-Kûfî de rivâyet etti. ki): Bîze Abde, Hişâm'dan bu isnâdla bu hadîsin benzerini rivâyet etti. Şu kadar var ki, o: «Yarası o akşam patladı. Ve ölünceye kadar akmaya devam etti.» dedi. Bir de hadîste şunu ziyade etti. ki): şâirin şunları söylediği zamandı: Ey Sa'd, Benî Muâz'in Sa'd'ı! Kureyza ile Nadîr ne yaptı;» «ömrüne yemin olsun ki, Benî Muâz'ın Sa'd'ı; onların göçtükleri sabah sabreden yalnız o idi.» içi boş olarak bıraktınız! Halbuki bu kavmin çömleği kaynamış; taşıyor!» Ebû Hubâb: Durun Kaynukaa gitmeyin! demişti.» «Bunlar memleketlerinde Meytân'daki kayalar kadar ağır idiler!» hadîsi Buhârî «Kitâbü's-Salât» ile «Kitâbü'l-Megâzî»de tah-rîc etmiştir. şerif Benî Kureyza Yahûdilerine hakemlik yapan Sa'd b. Muâz (radıyallahü anh)’in evvelce Hendek harbinde yaralandığını, tam iyileşmek üzere iken Benî Kureyza harbi koptuğunun, bu harbte hakemlik ettiğini ve harbte şehid olmak mukadder değilse evvelce aldığı yaradan ölerek şehidlik mertebesine erişmesi için Allah'a duâ ettiğini, nihayet duası kabul olunarak o yaradan vefat ettiğini bildiriyor. harbinde Hazret-i Sa'd'ı yaralayan şahıs Hibbân b. Kays yahut Hibbân b. Ebî Kays'dır. Hadîste annesinin adı ile kendisine İbn’l Arika denilmiştir. Arika’nın ismi Kılâbe binti Sa'd, künyesi de Ümmü Fâtıme'dir. Güzel koku saçtığı için kendisine Arika denilmiştir. Benî Kureyza Yahûdilerini 3000 piyade ve 36 süvari ile muhasara etmişler; 20-25 gün muhasaradan sonra Yahûdiler aman dileyerek Hazret-i Sa'd'in hakemliğine razı olmuşlardı. ki harb emrini Cibrîl (aleyhisselâm) getirmiştir. Bu hususta Taberânî ile Beyhakî'nin Hazret-i Âişe'den rivâyet ettikleri bir hadîste Âişe (radıyallahü anha) şöyle demektedir: «Evde bulunduğumuz bir sırada bize bir adam selâm verdi. Resûlüllah (sallallahü aleyhi ve sellem) endişe ederek hemen ayağa kalktı. Onun arkasından ben de kalktım. Bir de baktım Dihyetü'l-Kelbî!.. Resûlüllah (sallallahü aleyhi ve sellem): Cîbrîl'dir; bana Beni Kureyza'ya gitmemi emrediyor!) dedi. Bu hâdise Hendek harbinden döndüğü zaman oldu. Ben Resûlüllah (sallallahü aleyhi ve sellem)'in Cibrîl (aleyhisselâm)’ın yüzünden tozu sildiğini hâlâ görür gibiyim!» husustaki muhtelif rivâyetlerden anlaşıldığına göre Peygamber (sallallahü aleyhi ve sellem) ordunun önünden Hazret-i Alî'yi göndermiş; kendisine sancağı da vermiş. Fakat o Yahûdilerin müstahkem yerlerine varınca Benî Kureyza toplanarak Peygamberimiz (sallallahü aleyhi ve sellem) hakkında pek çirkin şeyler söylemişler. Nihayet 25 gün muhasaradan sonra Hazret-i Sa'd'in hükmü mucebince harbe yarayan erkekleri kılıçtan geçirilerek hazır hendeklere gömülmüş; kadın ve çocukları da müslümanlar arasında taksim edilmiştir. Öldürülen Yahûdilerin sayısı hakkında rivâyetler muhteliftir. Bazı rivâyetlere göre 400, bâzılarına göre 600 kişiymişler. Hattâ 700, 900 kişi olduklarını rivâyet edenler vardır. rivâyetlerin arasını bulanlar: «Dörtyüzü harbe iştirak edenler, geri kalanları onlara tâbi' olanlardır.» demişlerdir. Sa'd fi'len harbe iştirak edememişse de duası kabul olunarak aldığı yaradan vefat etmiş ve böylelikle şehadet mertebesini kazanmıştır. Rivâyete göre yaslanarak istirahat etmekte iken yanından bir keçi geçmiş; ve tırnağı Hazret-i Sa'd'in yarasına dokunarak patlamasına sebep olmuş; nihayet kan kaybından vefat etmiştir. Siyer kitaplarının beyanına göre vefatında Cibrîl (aleyhisselâm) cennet ipeklilerinden bir sarık sarınarak gelmiş ve: Muhammed! Kendisine gök kapıları açılan ve arş titreyen bu zât kimdir?» demiş. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) elbisesini sürüyerek acele kalkıp gitmiş ve onu vefat etmiş bulmuş. Na'şını taşıyanlar bir hafiflik hissetmişler. Resûlü Ekrem (sallallahü aleyhi ve sellem) kendilerine: sizden başka taşıyanlar var!» buyurmuş. İbn Âiz: «Sa'd'in cenazesine o günden başka yeryüzüne ayak basınamış 70 bin melek iştirak etmiştir.» diyor. Burada şöyle bir suâl hatıra gelebilir: ölümü istemek caiz olmadığı halde Hazret-i Sa'd gibi bir sahâbî-i celîl onu nasıl isteyebilmiştir? Onun maksadı şehîd olmaktı. Binâenaleyh o ölümü değil, şehîdliği istemiştir. şi'rine gelince: Bu mısralarla o Hazret-i Sa'd'ı Benî Küreyza'nın yakasını bırakmağa teşvik etmekte ve onlar hakkında verdiği hükümden dolayı kendisine sitemde bulunmaktadır. «Çömleğinizi içi boş olarak bıraktınız!» sözünden muradı Evs kabîlesidir. «Siz Evs kabilesini yardımsız bıraktınız; çünkü onların müttefiki azdır. Bir Kurey-za vardı; onlar da öldürüldü. Ama «Bu kavmin çömleği kaynamış taşıyor!» yani Hazrecliler Benî Kaynüka\" kabilesine yardım ettiler! Ebû Hubâb Abdullah b. Übeyy'i hatırlamalısın! Müttefikleri Benî Kaynuka' için nasıl şefaatte bulundu da serbest bırakıldılar! Benî Kureyza yurdlarında mal ve kuvvetçe Meytan dağının kayalan kadar ağır ve köklü idiler... demek istiyor. şerîf mescidde uyumanın ve yaralı bile olsa hastanın mescidde durmasının caiz olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 82
			}
		}
	]
}