{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4602,
			"arabicnumber": "1770",
			"text": "(Bana Abdullah b. Muhammed b. Esma Ed-Dubaî rivâyet etti. ki): Bize Cüveyriye b. Esma', Nâfi'den, o da Abdullah'dan naklen rivâyet etti. Şöyle dedi: muharebesinden döndüğü gün Resûlüllah (sallallahü aleyhi ve sellem) bize: kimse öğleyi Benî Kureyza'dan başka bir yerde kılmasın!» diye seslendi. Fakat bazı insanlar vaktin geçeceğinden korkarak namazı Beni Kureyza'dan başka yerde kıldılar. Ötekiler de: Vakti geçirsek bile biz namazımızı ancak Resûlüllah (sallallahü aleyhi ve sellem)’in emrettiği yerde kılarız! dediler. Ama o, iki fırkadan hiç bir kimseyi azarlamadı. hadîsi Buhârî «Salâtü’l-Havf» ve «Megâzî» bahislerinde tah-rîc etmiştir. Hendek muharebesidir. Bu muharebe hicretin beşinci yılı Şevvâl ayında olmuş; Ahzâb sûresi burada indirilmiştir. Ahzâb muharebesi denilmesi, küffar birçok Arap kabilelerini buraya topladıkları içindir. Sayılan on bin, baş kumandanları Ebû Süfyân'-dı. Müslümanlar Medîne'yi müdafaa için şehrin etrafına hendek kazmışlardı. Bu sebeple mezkûr harbe Hendek muharebesi de denilmiştir. İshak'ın beyanına göre Peygamber (sallallahü aleyhi ve sellem) Hendek harbinden Medîne'ye dönmüş; müslümanlar da silâhlarını bırakmışlardı. Öğle zamanı Cibrîl (aleyhisselâm) gelerek: «Yâ Muhammed! Melekler henüz silâhı bırakmadı. Allah sana Benî Kureyza üzerine yürümeni emrediyor. Ben de onlara dönüyorum.» dedi Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) üç bin kişi ile Benî Kureyza üzerine yürüdü. Ve öğle namazının orada kılınacağını ilân etti. Buhârî'nin rivâyetinde bu namazın ikindiyi olduğu bildiriliyor, iki rivâyetin arası şöyle bulunmuştur: emri öğle zamanı verilmiştir. O anda bazı kimseler Öğleyi kılmış; bazıları kılmamış olduğundan kılmayanlara: Öğleyi Ben! Kureyza’dan başka bir yerde kılmayın! denilmiş; kılanlara da: İkindiyi Benî Kureyza'dan başka bir yerde kılmayın!» Buyurulmuştur. Umûma hitaben: öğleyi ve ikindiyi Benî Kureyza'dan başka bir yerde kılmayın! demiş olması hattâ ilk hareket edenlere öğleyi, sonrakilere ikindiyi tavsiye etmiş olması da ihtimal dahilindedir. buradaki ihtilâfına gelince: Bunun sebebi delillerin çatış-masıdır. (Şöyle ki): Namazı vaktinde kılmak emredilmiştir. Peygamber (sallallahü aleyhi ve sellem)’in buradaki emri ise derhal yola çıkıp Benî Kureyza'ya gitmeyi, başka hiç bir şeyle meşgul olmamayı gerektirmektedir. Ama bundan haddi zâtında namazın geriye bırakılması kasdedilmemiştir. îşte sahabeden bazıları bu mânâya bakarak vakti geçirmemek için namazlarını kılmışlardır. Diğerleri ise mânâya değil Peygamber (sallallahü aleyhi ve sellem)’in emrine ve bu emrin zahirine bakarak namazlarını geciktirmişlerdir. Her iki taraf ictihadda bulundukları için Resûlüllah (sallallahü aleyhi ve sellem) hiç birini azarlamamıştır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 83
			}
		}
	]
}