{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4612,
			"arabicnumber": "1775.01",
			"text": "Bana Ebû't Tâhir Ahmed b. Amr b. Şerh rivayet etti. (Dediki): Bize ibni Vehb haber verdi. (Dediki): Bana Yûnus, ibni Şi-hâb'tan naklen haber verdi. (Demişki): Bana Kesir b. Abbâs b. Abdilmuttalib rivayet etti. (Dediki): Abbâs şunları söyledi: Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte Huneyn harbinde bulundum. Ebû Süiyân b. Haris b. Abdülmuttalib ile ben Resûlullah (Sallallahu Aleyhi ve Sellem)'in peşine takılarak ondan ayrılmadık. Resulullah (Sallallahu Aleyhi ve Sellem) beyaz bir katırının üzerinde idi. Onu kendisine Ferve b. Nüfâsete'l-Cüzâmî hediyye etmişti. Müslümanlarla küffâr karşılaşınca müslümanlar dönüp gerilediler. Resûlullah (Sallallahu Aleyhi ve Sellem) ise katırını kâfirlere doğru mahmuzlamaya başladı. Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'in katırının geminden tutuyor; onu kopmasın diye men' ediyordum. Ebû Süfyân da Resûlullah (Sallallahu Aleyhi ve Sellem)'in özengisinden tutuyordu. Derken Resûlullah (Sallallahu Aleyhi ve Sellem): «Ey Abbasi Ashâb-ı semurayi çağır!» dedi. Abbâs sesi kuvvetli bir zatmış. (Demişki): — Ben de sesim çıkabildiğine: Ashâb-ı semûra nerede? diye haykırdım. Vallahi sesimi işittikleri vakit (yerlerine) dönüşleri, ineğin yavrularına dönüşü gibi idi. Ve: — Yâ lebbeyk!.. Yâ lebbeyk!.. diyerek küffarla harbettiler. Ensârı çağırmak için : Ey Ensâr cemaati! Ey Ensâr cemaati! diyorlardı. Sonra da'yet Benî Haris İbni'I-Hazrec'e inhisar etti. Ve: Yâ Benî Haris ibni'l-Hazrec! Yâ Benî Haris ibni'l-Hazrec! dediler. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) katırının üzerinde uzanmış gibi bir vaziyette onların çarpışmasına baktı da : «Bu, tandırın kızıştığı zamandır!» buyurdu. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) birkaç çakıl alarak onları küffarın yüzlerine attı ve: «Muhammed'in Rabbine yemîn olsun bozguna uğradılar!» dedi. Az sonra ben bakmağa gittim. Ne göreyim harb onun dediği şekilde!.. Vallahi o küffara attığı çakıllarından başka bir şey yapmamıştı. Artık onların kuvvetinin zayıfladığını, işlerinin gerilediğini gördüm durdum",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 94
			}
		}
	]
}