{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4621,
			"arabicnumber": "1779",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe rivâyet etti. ki): Bize Affân rivâyet etti. ki): Bize Hammâd b. Seleme, Sâbit'den, o da Enes'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem) Ebû Süfyân’ın gelişini duyduğu vakit müşavere yapmış. Enes şöyle dedi: Ebû Bekir konuştu; Peygamber (sallallahü aleyhi ve sellem) ,ona iltifat etmedi. Sonra Ömer konuştu; ona da iltifat etmedi. Bunun üzerine Sa'd b. Ubâde kalkarak: Bizimi kasdediyorsun ya Resûlallah? Nefsim yed-i kudretinde olan Allah'a yemuı ederim ki, sen bize atlarımızı denize daldırmamızı emretsen daldırırız! Onları Berkü'l-Gemâd'a sürmemizi emretsen bunu da yaparız! dedi. Bunu müteakıb Resûlüllah (sallallahü aleyhi ve sellem) halkı davet etti. Onlar da yola revân olarak Bedr'e indiler. Derken yanlarına Kureyş'in sucuları geldi. İçlerinde Benî Haccâc kabilesinin siyah bir kölesi de vardı. Hemen onu derdest ettiler. (sallallahü aleyhi ve sellem)’in ashabı ona Ebû Süfyân'la arkadaşlarını soruyorlardı. O da: Ebû Süfyân hakkında bilgim yok. Ama işte Ebû Cehil, Utbe, Şeybe ve Ümeyyetü'bnü Halef!., diyordu. Bunu söylediği vakit onu dövüyorlardı. O da: Evet! Ben size haber vereceğim! İşte Ebû Süfyân! diyordu. Kendisini bırakıp da sorarlarsa: Ebû Süfyân hakkında bilgim yok! Ama işte Ebû Cehil, Utbe, Şeybe ve Ümeyyetü'bnü Halef insanların içinde!., diyordu. Bunu söyledi mi kendisim yine dövüyorlardı. Resûlüllah (sallallahü aleyhi ve sellem) de kalkmış namaz kılıyordu. Bunu görünce namazdan çıktı: yed-i kudretinde olan Allah'a yemîn ederim ki, size doğruyu söylediği vakit onu dövüyorsunuz; yalan söyledi mi bırakıyorsunuz!» buyurdular. Enes ki: Bir de Resûlüllah (sallallahü aleyhi ve sellem): filânın düşeceği yerdir!» diyor; ve elini yerde oraya buraya koyuyordu. Ve müşriklerden hiç biri Resûlüllah (sallallahü aleyhi ve sellem)’in elinin yerinden Öteye geçmedi. beyânına göre Peygamber (sallallahü aleyhi ve sellem)’in Bedir harbine çıkmazdan önce ashabı ile müşaverede bulunması Ensârı denemek içindi. Çünkü Ensârdan aldığı bey'atta onunla birlikte harbe çıkmaları şart koşulmamış; sadece düşmanın saldırısına karşı kendisini koruyacaklarına söz vermişlerdi. Onun için burada harbe iştirak edip etmeyeceklerini anlamak istemişti. Ensâr-ı kirâm her zaman olduğu gibi, bu defa da en güzel şekilde muvafakat cevabı verince ordu harekete geçmiştir. Mekke'nin sahîl tarafına düşen ve ona beş günlük mesafede bulunan bir yerdir. Bazıları Berk İle Gimâd'in, ayrı ayrı iki yer olduğunu söylemişlerdir. Kâdi Iyâz'a göre burası Hecer taraflarının nihayetinde bir yerdir. Gimâd kelimesi Gumâd şeklinde de okunmuştur. İbrahim Harbî, Berkü'l-Gimâd'ın uzaklıktan kinaye olduğunu söylemiştir. Râviyenin cem'idir. Râviye su taşıyan devedir. (sallallahü aleyhi ve sellem)'in namazdan çıkması selâm vermek suretiyle olmuştur",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 103
			}
		}
	]
}