{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4622,
			"arabicnumber": "1780.01",
			"text": "Bize Şeybân b. Ferrûh rivayet etti. (Dediki): Bize Süleyman b. Muğîre rivayet etti. (Dediki): Bize Sabit EI-Bünânî, Abdullah b. Rabâh'dan, o da Etû Hureyre'den naklen rivayet etti. Abdullah şöyle demiş: — Muâviye'ye bir takım hey'etler geldi. Bu, ramazanda idi. Biz birbirimize yemek yapıyorduk. Ebû Hureyre bizi kendi menziline çok davet edenlerdendi. Ben de dedim ki : — Beri bakın! Ben yemek yapıyorum; cemaati de benim menzilime davet ediyorum! Müteakiben yemek yapılmasını emrettim. Sonra akşam üzeri Ebû Hureyre'ye tesadüf ettim; ve : — Bu gece davet bendedir! dedim. — Benî geçtin mi? dedi. — Evet! cevâbını verdim; ve kendilerini davet ettim. Derken Ebû Hureyre: — Sizlere sizin hadisinizden bir hadîs bildireyimmi ey Ensâr cemaati? dedi. Sonra Mekke'nin fethini anlattı ve şunları söyledi : — Resûlullah (Sallallahu Aleyhi ve Sellem) gelerek Mekke'ye, dayandı. Ve Zübeyr'i bir cenaha, Hâlid-i diğer cenaha gönderdi. Ebû Ubeyde'yi de zırhsızlara kumandan gönderdi. Bunlar vadinin ortasını tuttular. Resûlullah (Sallallahu Aleyhi ve Sellem) de bir bölüğün içinde idi. Bir baktı; beni gördü. Ve: «Ebû Hureyre!» dedi. Ben: — Buyurun ya Resûlâllah! dedim. «Bana ancak bîr Ensâri gelir!» buyurdu. Seyban'dan başkaları şunu da ziyade ettiler: «Bana Ensâri çağır!» dedi. Ensâr derhal etrafını sardılar. Kureyş kendine muhtelif kabilelerden bir takım serseriler ve tâbi'ler toplamıştı. — Bunları ileri sürelim. Şayet ellerine bir şey geçerse onlarla beraber oluruz. isabet alırlarsa bizden istenileni veririz! dediler. Resûlullah (Sallallahu Aleyhi ve Sellem) de : «Kureyş'in serserilerine ve tâbi'lerine bakın!» buyurdu. Ve iki elini birbiri üzerine kavuşturarak (onların toplu haline) işaret etti. Sonra : «Bana Safa'da yetişinceye kadar (Allah'a, emanet olun?)!..» buyurdu. Müteakiben yürüdük. Artık bizden kim birini öldürmek isterse onu öldürüyordu. Onlardan hiç bir kimse bize bir şey gönderemiyordu. Derken Ebû Süfyân gelerek: — Yâ Resûlâllah! Kureyş cemâati ifna edilmiştir. Bu günden sonra Kureyş yoktu! dedi. Bundan sonra Nebi (Sallallahu Aleyhi ve Sellem): «Kim Ebû Süfyân'ın evine girerse o emniyettedir!» buyurdular. Bunun üzerine Ensâr birbirlerine: — Bu zâta memleketi için rağbet, kabilesi için şefkat geldi! dediler. Etû Hureyre demiş ki: (Bu arada) vahiy geldi. Vahiy geldiği zaman bize gizli kalmazdı. Bir geldi mi artık o geçinceye kadar bizden birimiz gözünün ucunu Resûlullah (Sallallahu Aleyhi ve Sellem)'e kaldırmazdı, Vahiy geçtikten sonra Resûlullah (Sallallahu Aleyhi ve Sellem): «Ey Ensâr cemaati!» diye seslendi. — Buyurun yâ Resûlâllah! dediler. «Siz: Bu zata memleketi için rağbet geldi!., dediniz» Ensâr; — Böyle bir şey oldu! dediler. «Hakka ki, ben Allah'ın kulu ve Resulüyüm! Allah'a ve sizlere hicret ettim. Hayât sîzin hayâtınız; memat sizin memâtınızdır!» buyurdular. Bunun üzerine Ensâr ağlayarak yanına geldiler; ve: — Vallahi biz o söylediklerimizi ancak Allah ve Resulüne kıyamadığımız için söyledik! diyorlardı. Resûlullah (Sallallahu Aleyhi ve Sellem) de: «Şüphesiz Allah ye Resulü sizi tasdik ediyor ve ma'zûr görüyorlar!» buyurdu, Arkacığından halk Ebû Süfyân'ın evine yöneldiler. Herkes kapılarını kapadı. Resûlullah (Sallallahu Aleyhi ve Sellem) de geldi. Tâ Hacer (i esved) e yanaştı. Ve onu öptü. Sonra Beytî tavaf etti. Beytin yanı başında bir putun başına vardı —ki Mekkeliler bu puta taparlardı— Resûlullah (Sallallahu Aleyhi ve Sellem)'in elinde bir yay vardı: Yayın eğri tarafından tutmuştu. Bu putun başına varınca onu gözüne dürtüyor ve : «Hak geldi; bâtıl muzmahil oldu!» diyordu. Tavafını bitirince Safâ'ya geldi ve üzerine çıkarak Kâ'beye baktı. Ellerini kaldırarak Allah'a hamd etmeğe ve dilediği duayı okumaya başladı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 104
			}
		}
	]
}