{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4632,
			"arabicnumber": "1784",
			"text": "(Bize Ebû Bekir b. Ebi Şeybe rivâyet etti. ki): Bize Affân rivâyet etti. ki): Bize Hammâd b. Seleme, Sabit'den, o da Enes'den naklen rivâyet etti ki, Kureyş, içlerinde Süheyl b. Amr olduğu halde Peygamber (sallallahü aleyhi ve sellem)’le sulh yapmışlar. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) Alî'ye ; yaz!» buyurmuş. Süheyl: Bismillâha gelince: Biz besmelenin ne olduğunu bilmiyoruz. Lâkin sen bizim bildiğimiz «Senin adınla Allahım!» ibaresini yaz! demiş. Sonra Peygamber (sallallahü aleyhi ve sellem): Resûlü Muhammed'den yaz!» buyurmuş. Müşrikler: Biz senin Resûlüllah olduğunu bilsek sana tâbi' olurduk! Lâkin sen kendi isminle babanın ismini yaz! demişler. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) i: b. Abdillâh'dan diye yaz!» buyurmuş. Müşrikler Peygamber (sallallahü aleyhi ve sellem)’e: Sizden (bize) gelen olursa onu size iade etmiyeceğiz; ama bizden size kim giderse siz onu bize iade edeceksiniz! diye şart koşmuşlar. Ashâb: Yâ Resûlallah, bunu yazalım mı? diye sormuşlar. Gerçekten bizden kim onlara giderse Allah onu ırak etsin! Onlardan bize gelene İse Allah bir ferahlık ve çıkar yol halkedecektir!» buyurmuşlar. ki Hudeybiye sulhunda müşrikler Peygamber (sallallahü aleyhi ve sellem)’e üç şeyi şart koşmuşlar; o da bunları kabul etmiştir. Acaba bundaki hikmet nedir? hikmet sulhun getireceği mühim menfaat ve maslahattır. Bununla beraber müşriklerin ileri sürdükleri şartlan kabul etmekte bir zarar ve mefsedet de yoktur. Çünkü mânâ i'tibarı ile Besmele ne ise «Senin adınla Allahım!» ibaresi de odur. Yalnız besmeledeki Rahman ve Rahîm sıfatlan terk edilmiştir ki, bundan bu sıfatların Allahü teâlâ'dan nefî edilmiş olması lâzım gelmez. silinen «Resûlüllah» kim ise Muhammed b. Abdillâh da odur. Binâenaleyh bu şartlan kabulde bir mahzur yoktur. Müşrikler bunların yerine putlannı ta'zîm gibi bir şeyi şart koşsalar, mefsedet ve mahzur o zaman baş gösterirdi. üçüncü şartı evvelemirde çok ağır gibi görünür. Nitekim ashâb-ı kirâma da ağır gelmiştir. Bu şarta göre müşriklerden müslüman olup gelenleri müslümanlar iade edecek; fakat müslümanlardan ir--tidâd edip müşrikler tarafına geçenler iade olunmayacaktı. Fahr-i Kâinat (sallallahü aleyhi ve sellem) Efendimiz bunu da kabul etti; ve bundaki hikmeti şu cümlelerle ifâde buyurdu: kim onlara giderse Allah onu ırak etsin! Onlardan bize gelene ise Allah bir ferahlık ve çıkar yol halk edecektir!» Gerçekten öyle olmuş; bu mu'cize dahi sahibinin haber verdiği gibi zuhur etmiş; Mekke'nin fethinden sonra bütün Araplar müslüman olmuşlardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 114
			}
		}
	]
}