{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4633,
			"arabicnumber": "1785.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdullah b. Numeyr rivayet etti. H. Bize ibni Numeyr de rivayet etti. ikisinin lâfızları birbirine yakındır. (Dediki): Bize babam rivayet etti. (Dediki): Bize Abdülâzîz b. Siyah rivayet etti. (Dediki): Bize Habîb b. Ebî Sabit, Ebû Vail'den naklen rivayet etti. (Şöyle demiş) : Sıffîn (harbi) günü Sehl b. Huneyf ayağa kalkarak şunları söyledi: Ey insanlar! Kendinizi itham edin! Yemîn olsun biz Hudeybiye günü Resûlullah (Sallallahu Aleyhi ve Sellem)'le beraberdik! Şayet harbe lüzûm görseydik mutlaka harbederdik! Bu söylediğim, Resûlullah (Sallallahu Aleyhi ve Sellem)'le müşrikler arasındaki sulhda idi. Derken Ömer b. Hattâb gelerek Resûlullah (Sallallahu Aleyhi ve Sellem)'e vardı; ve: — Yâ Resûlâllah! Biz hak, onlar bâtıl üzerinde değil miyiz? dedi. «Evet, öyle!» buyurdular. — Bizim Ölülerimiz cennette, onların ölüleri cehennemde olacak değil mi? dedi. «Evet, öyle!» buyurdular. — Öyle ise neye dînimiz hususunda bu aşağılığı gösteriyoruz da henüz Allah onlarla bizim aramızda bir hüküm vermemişken geri dönüyoruz? dedi. Resulü Ekrem (Sallallahu Aleyhi ve Sellem) şöyle buyurdular : «Ey Hattâb oğlu! Ben gerçekten Allah'ın Resulüyüm! Allah beni ebediyyen zayi* etmezi» Bunun üzerine Ömer sabretmedi de kızarak oradan gitti ve Ebû Bekr'e gelerek: — Yâ Ebâ Bekr! Biz hak, onlar bâtıl üzerinde değil miyiz? dedi. Ebû Bekir: — Evet, öyle!» cevâbını verdi. — Bizim Ölülerimiz cennette, onların ölüleri cehennemde olacak değil mi? — Evet, öyle! — O halde neye dînimiz hususunda bu aşağılığı gösteriyoruz da henüz Allah onlarla bizim aramızda bir hüküm vermemişken geri dönüyoruz? dedi. Ebû Bekir şu karşılığı verdi: — Ey Hattâb oğlu! O gerçekten Allah'ın Resulüdür. Allah onu ebediyyen zayi' etmez!..» Arkacığından Resûlullah (Sallallahu Aleyhi ve Sellem)'e fetih (müjdesi) le Kur'ân indi. Ve Ömer'e haber göndererek onu kendisine okuttu. Ömer : — Yâ Resûlâllah! Bu fetih midir? dedi. «Evet!» cevâbını verdiler. Artık Ömer'in gönlü oldu ve döndü",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 115
			}
		}
	]
}