{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4638,
			"arabicnumber": "1786.02",
			"text": "(Bize İbn'l-Müsennâ da rivâyet etti. ki): Bize Ebû Dâvûd rivâyet etti. ki): Bize Hemmâm rivâyet etti. H. Abd b. Humeyd dahi rivâyet etti. ki): Bize Yûnus b. Muhammed rivâyet etti. ki): Bize Şeybân rivâyet etti. râvilerin hepsi Katâde'den, o da Enes'den naklen İbn Ebî Arû-be'nin hadîsi gibi rivâyette bulunmuşlardır. Sehl b. Huneyf hadîsini Buhârî «Cizye», «İ'tİ-sâm» «Humus» ve «Tefsir» bahislerinde; Nesâî «Kitâbü't-Tefsîr»'de muhtelif râvilerden tahrîc etmişlerdir. Fırat nehri kenarında bir yerdir. Hazret-i Âli ile Muâviye (radıyallahü anhuma) arasındaki meşhur harp burada olmuştur. Sehl bu harbe iştirak etmiş ve Ali (radıyallahü anh) tarafını tutmuştu. Arkadaşları kendisini harpte gevşeklikle itham ediyorlardı. Hadîste zikri geçen sözünü burada söylemiş; birbirleri ile harbeden her iki fırkaya nasihat ederek: Siz kendi reylerinizi itham edin! Çünkü İslâmiyet nâmına reylerinize İstinaden dîn kardeşlerinizle harb ediyorsunuz! Ben vazifemde kusur etmiyorum! Nitekim Hudeybiye anlaşmasında da kusur etmemiştim!..» demiş ve orada olup bitenleri anlatmıştı. Cendel gününden murâd: Hudeybiye anlaşmasıdır. Ebû Cendel'in İsmi Âs olup Kureyş murahhası Sehl'in oğludur. Âs , Mekke'de müslüman olmuş; bu sebeple büyük işkencelere ma'ruz kalmıştı. Tam Hudeybiye anlaşmasının imzalandığı gün müşriklerin elinden kaçarak Peygamber (sallallahü aleyhi ve sellem)’e iltica etti. Fakat arkasından babası Sehl Peygamberimize: «Yâ Muhammed senden ilk dava ettiğim tudur!» dedi. Artık anlaşma gereğince Resûlüllah (sallallahü aleyhi ve sellem) de onu babasına teslim etti. Ebû Cendel sesi çıkabildiği kadar bağırıyor': «Ben müslüman olmuş ve Allah uğrunda bu kadar işkence görmüşken beni müşriklere iade mi ediyorsunuz?» diyordu. Bunun üzerine babası, Ebû Cende Tin yüzüne bir taş atmış ve burnunu kırmıştı. îşte Hazret-i Ömer'le diğer müslümanları gayrete getiren bu olmuş. Ömer (radıyallahü anh): «Biz hak, onlar bâtıl üzerinde değil miyiz?..» diye konuşmuştur. Ekrem (sallallahü aleyhi ve sellem) Ebû Cendel'e: Ebâ Cendel! Sabr-u tehammül et! Şüphesiz ki, Allah sana ve seninle beraber olan malzumlara bir ferah ve kurtuluş yolu halkedecektir. Biz bir anlaşma akdettik. Artık onlara karşı sözümüzden dönemeyiz!» buyurdu. Ulemâdan bazılarına göre Peygamber (sallallahü aleyhi ve sellem) Ebû Cendel'i, babasının i'tibarı sayesinde öldürülmeyeceğini bildiği için iade etmiştir. b. Huneyf'in: «Şayet Resûlüllah (sallallahü aleyhi ve sellem)’in emrini reddetmek elimden gelseydi onu mutlaka reddederdim!..» sözünden murâd: «Hudeybiye anlaşmasına aykırı harekette bulunmak elimden gelseydi müşriklerle harp ederdim! Ama anlaşma imzalanınca Peygamberimizin emrine imtisâlen herkes harpten vazgeçti!» demektir. sözleri ile Hazret-i Sehl , Sıffin harbinde arkadaşlarını hakem kararı ile anlaşmayı kabule davet etmiş; böyle ilk bakışta nahoş görünen şeylerin netice itibarı ile hayır getirdiğini, nitekim Hudeybiye anlaşmasında da böyle olduğunu anlatmak istemiştir. 96 numaralı hadîsteki: «Şu işinizin bir tarafını tıkar tıkamaz hemen öbür taraf Üzerimize fışkırmıştır!» cümlesinin mânâsı: Sizin reyinizi bir taraftan doğrultup düzeltiyoruz; Öbür taraftar patlak verip üzerimize fışkırıyor demektir. Yani hakemliği kabul meselesinde Hazret-i Alî tarafdâr-larının görüşlerini düzeltmenin çok zor olduğu, bir tarafından bağlanırken öteki ucundan patlayan su tulumuna veya çuvala benzetmek sureti ile ifade olunmuştur. Yalnız ibaredeki «fetahnâ» ta'bîri Kâdî Iyâzin da beyân ettiği vecihle hatadır. Doğrusu «sedednâ»dır; nitekim Buhârî'nin rivâyetinde de öyledir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 120
			}
		}
	]
}