{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 464,
			"arabicnumber": "188",
			"text": "Bize Ebu Bekir b. Ebi Şeybe tahdis etti. Nu'man b. Ebi Ayyaş'ın Ebu Said el-Hudri'den rivayetine göre: Resulullah (Sallallahu aleyhi ve Sellem) şöyle buyurdu: ''Şüphesiz cennet ehli arasında makamı en aşağı mer tebede olan kişi, Allah'ın, yüzünü ateşten cennete doğru çevirdiği ve ona gölgeli bir ağaç gösterdiği bir kimse olacaktır. Bu adam: Rabbim beni bu ağaca yaklaştır da gölgesinde bulunayım diyecek. \" Sonra hadisi İbn Mesud'un hadisine yakın olarak zikretti, ama rivayetinde: \"Ey Ademoğlu, sana ne versem de dileklerinin sonu gelse\" kısmını hadisin sonuna kadar zikretmedi. Ama rivayetinde fazladan şunları zikretti: ''Allah da ona şunu şunu iste, diye hatırlatır.\" Nihayet edeceği temennileri kesilince (bitince) Allah: \"Bu, on misliyle birlikte senindir\" buyuracak. Sonra evine girecek, onun yanına hurul iyn'den iki zevcesi de içeri girecek ve her ikisi: Bizim için sana hayat veren, senin için de bize hayat veren Allah'a hamdolsun, diyecekler. O da: Bana verilenler gibi hiçbir kimseye verilmemiştir, diyecek. \" Yalnız Müslim rivayet etmiştir; Tuhfetu'I-Eşraf, 4392 DAVUDOĞLU AÇIKLAMA: 461 nolu Hadisteki: «Bu zat kah yürüyecek, kah yüzüstü düşecek, bazan da yüzünu Alev çalacak.» ifadesinden murad adamın cehennemde yana yana bîtap düştüğünü bu sebeple güç halle ayakta durabildiğini ve yeni yürümeye başlamış çocuklar gibi düşe kalka gittiğini hatta arasıra cehennemin alevleri yetişerek yüzünü yaktığını ve yüzünde simsiyah eser bıraktığını anlatmakdır. Resulullah (Sallallahu Aleyhi ve Sellem) 'in : «Rabbülaleminin dıkh'ine gülüyorum.» ifadesindeki Dihk'in hakikati gülmek demeksede önce görüldüğü vechile Allah Teala hakkında gülmek müstahil olduğu için ona isnad edilen Dihk Allah'ın rızası, rahmeti ve merhamet buyurduğu kullarına hayır irade etmesidir diye te'vil olunur. NEVEVİ ŞERHİ: \"en-Numan b. Ebu Ayyaş\" Ebu Ayyaş ez-Zuraki el-Ensari bilinen bir sahabidir. İsminin ne olduğu hususunda görüş ayrılığı meşhurdur. Zeyd b. es-Samit denildiği gibi, Zeyd b. en-Numan, Ubeyd ve Abdurrahman olduğu da söylenmiştir. \"Hur-u ıyn'den iki zevcesi de yanına girer ... \" (3/43) \"(~s;.. jj): İki zevcesi\" anlamındaki lafız rivayetlerde ve asıl yazmalarda bu şekilde \"zevce\"nin ikili olarak sabittir. Tesniyenin bu şekilde yapılması doğru ve bilinen bir söyleyiştir. Bu hususta Arap şiiri arasında pek çok tanık beyit vardır ki, İbnu's-Sikklt ve dilbilginleri arasından pek çok kimse bunları zikretmiş bulunmaktadır. \"İkisi der ki\" anlamındaki mı yukarıdan noktalı te harfi iledir. Her ne kadar böyle olduğu açıkça bilinen bir husus ise de bunu özellikle zaptetmemizin sebebi yazılış arasında farkı gözetemeyen bazı kimselerin bu hususta yanılarak bu fiili alttan iki noktalı ye ile telaffuz etmeleridir. Bu ise hiç şüphesiz bir yanlış okuyuştur. Nitekim yüce Allah'ın: \"O zaman içinizden iki zümre bozulmaya yüz tutmuştu.\" (Al-i İmran, 3/122); \"Onlann berisinde ise kanşmasın diye (koyunlannı) kollayan iki hanım buldu.\" (Kasas,23); \"Muhakkak ki Allah göklerle yeri zeval bulmasınlar diye tutar. Eğer zeval bulsalar ... \" (Falır,35/41); \"Her ikisinde de akar iki pınar vardır. \" (Rahman, 55/50) buyruklarında da böyledir. İki zevcesinin: \"Bizim için sana hayat veren ... Allah'a hamd olsun\" sözleri de: Seni bizim için, bizi de senin için yaratıp, sevinci ebedi olan bu yurtta bizi bir araya getiren Allah'a hamdolsun, demektir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 369
			}
		}
	]
}