{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4658,
			"arabicnumber": "1797.03",
			"text": "Bize Ebû Bekir b. Ebî Şey be ile Muhammed b. Müsennâ ve İbn Beşşâr da rivâyet ettiler. (Dediler ki): Bize Muhammed b. Ca'fer, Şu'be'den rivâyet etti. H. İshâk b. İbrahim dahi rivâyet etti. ki): Bize Mülâî haber verdi. ki): Bize Süfyân rivâyet etti. Her iki râvi Esved b. Kays'dan bu isnadla ikisinin hadîsi gibi rivâyette bulunmuşlardır. hadîsi Buhârî «Kitâbü't-Tefsîr» ile «Kıyamü’l-leyl» bahislerinde tahrîc etmiştir. (sallallahü aleyhi ve sellem)'in birkaç gece teheccüd namazına kalkamadığını görerek ona gelen kadın Ebû Süfyân’ın kız kardeşi Ümmü Cemil Avrâ' binti Harb'tir. Bu kadın Ebû Leheb'le evli olup «Leheb» sûresinde, odun taşır vaziyette haşrolunacağı bildirilmiştir. tevdî'den murâd: Terk etmektir. Zira vedalaşan bir kimse o şahsı mübâlegah bir surette terk etmiş olur. (aleyhisselâm)’ın Peygamber (sallallahü aleyhi ve sellem)’e kaç zaman gelmediği ihtilaflıdır. İbn Cüreyc'den oniki gün gelmediği rivâyet olunmuş; İbn Abbâs (radıyallahü anh) onbeş, bir rivâyette yirmibeş gün gelmediğini söylemiştir. Mukaatil bu müddetin kırk gün olduğunu bildirmiştir. Üç gün olduğunu söyleyenler de vardır. Cibrîl'in niçin gelmediği hususunda da birkaç kavil vardır: Resûlüllah (sallallahü aleyhi ve sellem)'in hizmetçisi Havle (radıyallahü anh)'dan rivâyet olunduğuna göre Peygamber (sallallahü aleyhi ve sellem) Efendimizin yatağının altında bir köpek eniği ölmüş. Bu arada birkaç gün vahi kesilmiştir. Havle'ye: Havle! Benim evimde ne oldu?» diye sormuş. Bunun üzerine Hazret-i Havle evi güzelce süpürmüş. Bir de bakmış ki yatağın altında bir köpek eniği ölmüş!.. Hemen onu oradan atmış. Az sonra Resûlüllah (sallallahü aleyhi ve sellem) sakalı titreyerek gelmiş; ve: Havle! Beni ört!» demiş. Ve Duhâ sûresi inmiş. Mukaatil'in rivâyetine göre vahiy gecikince müslümanlar: Yâ Resûlallah! Sana gelen vahiy durdu! demişler. O da şu cevâbı vermiş: mafsallarınızı temilzemediğiniz, tırnaklarınızı da kesmediğiniz halde vahiy nasıl iner!» İbn İshâk'dan rivâyete göre müşrikler Peygamber (sallallahü aleyhi ve sellem)'e Hızır, Zülkarneyn ve ruhu sormuşlar. O da ertesi gibi cevap vereceğini söylemiş, fakat inşa allah dememiş. Bundan dolayı Cibrîl (aleyhisselâm) birkaç gün gelmemiş. Müşrikler bunu görünce: Rabbi onu terk etti! demişler. Az sonra Cebrail (aleyhisselâm) Duhâ sûresi ile birlikte: bir şey için: Ben bunu yarın yaparım; deme! Ancak İnşaallah dersen o başka!\" Sûre-i Kehf, âyet: 23-24. âyetini getirmiş. Kuşluk zamanı demektir. Buradaki kasem: Kuşluğun Rabbine yemin olsun! şeklinde takdir olunur. Sevginin zıddı, yani buğz etmek ve küsmektir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 140
			}
		}
	]
}