{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4659,
			"arabicnumber": "1798.01",
			"text": "Bize İshâk b. İbrahim El-Hanzalî ile Muhammed b. Râfi' ve Abd b. Humeyd rivâyet ettiler. Lâfız İbn Râfı'indir. (İbn Râfi'; haddesenâ ta'birini kullandı. Ötekiler: Bize Abdürrazzâk haber verdi dediler.) (Abdürrezzâk ki: Bize Ma'mer, Zühri'den, o da Urve'den naklen haber verdi. Ona da Üsâme b. Zeyd haber vermiş ki, Peygamber (sallallahü aleyhi ve sellem) üzerinde semer bulunan bir eşeğe binmiş. Altında bir Fedek kadifesi varmış. Arkasına da Üsâme'y» bindirmiş. Kendisi Haris b. Hazrec oğullarındaki Sa'd b. Ubâde'yi dolaşmağa gidiyormuş. Bu iş Bedir vak'asından önce olmuş. Nihayet müslümanlarla putperest müşriklerden ve içlerinde Abdullah b. Übeyy de olduğu halde ya-hudîlerden müteşekkil karma bir toplantının yanına uğramış. Toplantıda Abdullah b. Revâha da varmış. Hayvanın kaldırdığı toz duman meclisi kaplayınca Abdullah b. Übeyy elbisesi ile burnunu kapamış; sonra: Üzerimize tozatmayın! demiş. Müteakiben Peygamber (sallallahü aleyhi ve sellem) onlara selâm vermiş. Sonra durarak inmiş; ve kendilerini Allah'a (îmâna) da'vet etmiş; onlara Kur'ân okumuş. Bunun üzerine Abdullah b. Übeyy: Be adam! Bundan daha güzel bir şey yok!.. Eğer söylediklerin hak ise bizi toplantılarımızda rahatsız etme de evine dön!.. Artık bizden sana kim giderse ona anlat! demiş. Abdullah b. Revâha da: Sen bize toplantılarımızda gel!.. Zira biz bunu istiyoruz! mukabelesinde bulunmuş. Derken müslümanlarla müşrikler ve Yahûdiler birbirlerine söğmüşler. Hattâ birbirlerinin üzerine atlamayı gönüllerinden geçirmişler. Peygamber (sallallahü aleyhi ve sellem) ise onları yatıştırmağa çalışıyormuş. Sonra hayvanına binerek Sa'd b. Ubâde'nin yanına girmiş ve şunları söylemiş: Sa'd! Ebû HubSb'ın (yani Abdullah b. Übeyy'in) ne söylediğini işitmedin mi? Şöyle... şöyle dedi.» Sa'd: Onu affet yâ Resûlallah, bağışla! Vallahi Allah sana verdiğini vermiştir. Gerçekten bu yerin ahâlisi ona tâc giydirmeye, sarık sarmaya ittifak etmişlerdi. Allah, sana verdiği hak ile bunu reddedince bu onun boğazına durdu. İşte ona gördüğün şeyi yaptıran budur! demiş. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) onu affetmiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 141
			}
		}
	]
}