{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4664,
			"arabicnumber": "1801",
			"text": "Bize İshâk b. İbrâhîm El-Hanzalî ile Abdullah b. Mu- ımed b. Abdirrahmân b. Misver Ez-Zührî ikisi birden İbn Uyeyne'den rivâyet ettiler. Lâfız Zührî'nindir. (Dediler ki): Bize Süfyân, Amr’dan rivâyet etti. ki): Ben Câbir'i şunu söylerken işittim: (sallallahü aleyhi ve sellem): b. Eşrefe kim çıkacak? Çünkü o Allah ve Resûlüne eza etmiştir!» buyurdu. Bunun üzerine Muhammed b. Mesleme: Yâ Resûlallah! Onu Öldürmemi mi istiyorsun? dedi. «Evet!» buyurdular. İbn Mesleme: Bana müsaade buyur da (söyleyeceğimi) söyleyeyim! dedi. «Söyle!» buyurdular. Müteakiben ona vararak (söyleyeceğini) söyledi. İkisinin aralarında olanları anlattı ve şöyle dedi: Bu adam sadaka istedi ve bizi dara düşürdü. Kâ'b bunu işitince: Vallahi ondan daha da yaka silkeceksiniz! dedi. İbn Mesleme: Biz şimdi ona gerçekten tâbi' olduk! Onu bırakıp da halinin nereye varacağını görmekten çekiniyoruz. Bana biraz ödünç vermem dilerim! Dedi. Kâ'b: Bana rehin olarak ne vereceksin? diye sordu, İbn Mesleme: Neyi dilersen! cevâbını verdi. Bana kadınlarınızı rehin verirsin! dedi. İbn Mesleme: Sen Arapların en güzelisin, sana kadınlarımızı rehnede bilir miyiz hiç! dedi. Kâ'b: Bana çocuklarınızı rehin verin! dedi. İbn Mesleme: Birimizin oğluna söverler de: Bu iki yük hurma karşılığında reh-nedildî; derler. Lâkin biz sana zırhları (yani silâhları) rehnedelim! dedi. Kâb da: Peki öyle ise! dedi. İbn Mesleme ona Haris, Ebû Abs b. Cebr ve Abbâd b. Bişr ile geleceğini va'detti. Bunlar geceleyin gelerek Kâb'ı çağırdılar. O da yanlarına indi. Süfyân (b. Uyeyne) Şöyle dedi: Amr'dan başkası dedi ki: Karısı Kâ'b'a: Ben bir ses işitiyorum; sanki kan sesi! dedi, Kâ'b: Bu (gelen) Muhammed b. Mesleme ile süt kardeşi ve Ebû Nâile'dir. Mert adam geceleyin yaralanmaya çağırılsa yine icabet eder! dedi. Muhammed (b. Mesleme) ki) ; O geldiği vakit ben elimi başına uzatacağım. Onu alt etme imkânı buldum mu hemen tutun! İndiği zaman kılıcını kuşanmış olarak indi. (Gelenler): Biz senden tîb kokusu duyuyoruz! dediler. Kâ'b: Evet! Fülân hanım nikâhım altındadır. O Arapların en güzel kokulu kadınıdır; cevabını verdi, İbn Mesleme: Bana bundan koklamaya müsaade eder misin? dedi. Kâ'b: Evet! Koklayabilirsin! cevâbmı verdi. O da tutarak kokladı. Tekrarlamama müsaade eder misin? dedi; ve başına iyice hâkim oldu. Arkasından: Tutun! dedi. Onu hemen öldürdüler. hadîsi Buhârî «Kitâbü'l-Megâzî»'de tahrîc etmiştir. b. Eşref, Benî Kureyza Yahûdilerinin şâiridir. Daima Peygamber (sallallahü aleyhi ve sellem)'le müslümanları hicveder; müslümanlar aleyhine müşriklere yardımda bulunurdu. Bedir harbinde maktul düşen müşriklere ağlamış ve haklarında şiirler yazmıştı. Zengindi. Hicretin üçüncü yılı ramazanında öldürüldü. b. Mesleme (radıyallahü anh) Ashâb–ı kirâm'in büyüklerinden olup Bedir'de ve diğer gazaların hepsinde bulunmuş; 43 veya 46 tarihinde Medîne'de vâlî bulunduğu sırada vefat etmiştir. Kâ'b'in bu şekilde hîle ile öldürülmesinin sebebi de cevabı hususunda ihtilâf etmişlerdir. İmâm Mâzirî şöyle diyor: «İbnı Mesleme'nin Kâ'b'ı bu şekilde öldürmesi Peygamber (sallallahü aleyhi ve sellem) verdiği ahdi bozduğu, ona hicvederek sövdüğü içindir. Resûlüllah (sallallahü aleyhi ve sellem) aleyhine kimseye yardım etmeyeceğine söz vermişti. Sonra onun aleyhine düşmanlarla birleşerek onlara yardım etti...» Iyâz'ın beyanına göre ulemâdan bazıları bu meseleye şöyle cevap vermişlerdir: b. Mesleme hiç bir sözünde Kâ'b'a emân vermiş değildir. Onunla sadece ahş-veriş hususunda konuşmuş, bir de hâlinden şikâyet etmiştir. Kendisine bir söz veya emân vermemiştir. Binâenaleyh hiç bir kimsenin «onu gadren Öldürdü!» demesi helâl olamaz. Böyle bir sözü biri Hazret-i Alî'nin yanında söylemiş de Alî (radıyallahü anh) onun boynunu vurdurmuş. Gadir ancak emân verilip de öldürüldüğü zaman olur. b. Mesleme (radıyallahü anh)'ın: «Bana müsaade buyur da söyleyeceğimi söyleyeyim!» sözünden muradı: İzin ver de hem kendi tarafımdan hem de senin nâmına söylenmesini yararlı gördüğüm sözleri kimi ta'riz, kimi tasrîh yolu ile kendisine söyleyeyim demektir. kan sesi!» ifadesi: Sanki kan davacısının sesi yahut kan dökücünün sesi manasınadır. (gelen) Muhammed b. Mesleme île süt kardeşi ve Ebû Nâile'dir.» cümlesi bütün nüshalarda bu şekilde rivâyet olunmuşsa da Kâdi Iyâz şeyhinden naklen: «Doğrusu Muhammed b. Mesleme ile süt kardeşi Ebû Naile'dir.» diyor. Filhakika Siyer ulemâsı Ebû Naile'nin Muhammed b. Mesleme ile süt kardeşi olduklarını kaydederler. Ebû Naile, Kâ'b'in da süt kardeşi idi. b. Eşref'in katline bir rivâyette dört, diğer rivâyette beş kişi iştirak etmiştir.,Bunlar: Muhammed b. Mesleme, Ebû Naile Silkân b. Selâme, Abbâd b. Bişr, Ebû Abs b. Cebr ve Haris b. Evs'tir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 146
			}
		}
	]
}