{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4668,
			"arabicnumber": "1802.01",
			"text": "Bize Kuteybe b. Saîd ile Muhammed b. Abbâd rivâyet ettiler. Lâfız İbn Abbâd'ındır. (Dediler ki): Bize Hatim —ki İbn İsmail'dir— Seleme b. Ekva'ın âzâdlısı Yezid b. Ebî Ubeyd'den, o da Seleme b. Ekva'dan naklen rivâyet etti. Seleme (Şöyle dedi): (sallallahü aleyhi ve sellem)'le birlikte Hayber'e (müteveccihen yola) çıktık. Ve geceleyin yürüdük gittik. Derken cemaattan bir zât, Âmir b. Ekva'a: Bize racezlerinden dinletmez misin? dedi. Âmir şâir bir zât idi. Hemen cemaatF (n develerini) sürmek üzre hayvanından indi. Şöyle diyordu: Sen olmasan biz ne hidayete erer; ne sadaka verir; ne de namaz kılardık.» halde —can sana feda— biz günah irtikâb ettikçe affet! Düşmanla karşılaşırsak ayaklarımızı sabit kıl!» mutlaka sekinet ver! Çünkü biz çağırılırsak geliriz!» «Yaygara ile aleyhimize yardım istediler!» Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): «Bu sürücü kim?» diye sordu. Âmir! dediler. ona rahmet eylesin!» dedi. Cemaatten biri: (Şehâdet) vâcib oldu yâ Resûlallah! Bârî onunla bizleri faydalandırsa idin! dedi. Az sonra Hayber'e gelerek onları muhasara ettik. Nihayet bize şiddetli bir açlık çattı. Sonra: Allah onu size fethedecektir » buyurdular. Hayber'in fet-hedildiği günün akşamı cemaat geceledikleri vakit birçok ateşler yaktılar, Resûlüllah (sallallahü aleyhi ve sellem) âteşler ne? Ne üzerine yakıyorsunuz?» dedi. Ashâb: Et üzerine! dediler. «Ne eti?» diye sordu. Ehli eşeklerin eti! dediler. üzerine Resûlüllah (sallallahü aleyhi ve sellem): «Dökün onları ve kırın!» buyurdu. Bir zât; Yoksa onlan döksünler de yıkasınlar mı? diye sordu. «Yahut öyle yapsınlar!» buyurdu. harb için saf bağladığı vakit Âmir'in kılıcında kısalık vardı. Onunla, bir Yahûdiyi vurmak için bacağını yakaladı. Fakat kılıcının keskin tarafı dönerek Âmir'in dizine isabet etti. Ve ondan Öldü. Seleme ki: döndüğümüz vakit Resûlüllah (sallallahü aleyhi ve sellem) elimden tutmuştu. Beni susmuş görünce: ne oldu?» diye sordu. Kendisine şunu söyledim: Annem, babam sana feda olsun! Âmir'in ameli boşa gitti diycır-lar!.. kim söyledi?» diye sordu. Filân, filân ve Üseyd b. Hudayr El-Ensârî dedim. söyleyen hatâ etmiş! Ona gerçekten İki ecir vardır!» buyurdu. Ve iki parmağını bir araya topladı. (Sözüne devamla): gerçekten câhid, mücâhiddir! Yeryüzünde yürüyen onun gibi bir Arap pek az bulunur!» buyurdular. hadîste Kuteybe Muhammed'e iki cümlede muhalefet etmiştir, İbn Abbâd’ın rivâyetinde: «Bizim üzerimize sekînet ver!» cümlesi de vardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 150
			}
		}
	]
}