{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4669,
			"arabicnumber": "1802.02",
			"text": "Bana Ebû't-Tâhir de rivayet etti. (Dediki): Bize ibni Vehb haber verdi. (Dediki): Bana Yûnus, ibni Şihâb'dan naklen haber verdi. (Demişki): Bana Abdurrahmân (bunun nesebini ibni Vehb'den başkası bildirmiş ve: ibni Abdillâh b. Kâ'b b. Mâlik demiştir.) haber ver­di ki, Seleme b. Ekva' şöyle demiş: Hayber harbi olunca kardeşim, Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte şiddetli bir çarpışma yaptı da, kılıcı kendine dönerek onu öldürdü. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem)'in ashabı bu hususta söz ettiler ve onun hakkında şikâyette bulundular: Kendi silâhı ile ölen bir adam! dediler. Bâzı işlerinde de şüpheye düştüler. Seleme demişdi: Az sonra Resûlullah (Sallallahu Aleyhi ve Sellem) Hayber'den döndü. Ben: — Yâ Resûlullah! Bana müsaade buyur da sana racez okuyayım! dedim. Resûlullah (Sallallahu Aleyhi ve Sellem) kendisine izin vermiş. Ömer b. Hattâb: Ben senin ne söyleyeceğini biliyorum! demiş. Seleme şunları söylemiş: Ben de : «Vallahi Allah olmasa biz ne hidayete erer; ne sadaka verir, ne namaz kılardık! dedim. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem). «Doğru söyledin!» buyurdular. (Devam ettim) : «Bize mutlaka sekînet indir! Ve düşmanla karşılaşırsak ayaklarımızı sabit kıl!» «Müşrikler bize tecâvüz etmişlerdir!..» Ben racezimi bitirince Resûlullah (Sallallahu Aleyhi ve Sellem): «Bunu kim söyledi?» diye sordu. — Onu kardeşim söyledi! dedim. Resûlullah (Sallallahu Aleyhi ve Sellem): «Allah ona rahmet eylesin!» dedi. Ben de: — Yâ Resûlâllah! Bâzı insanlar ona rahmet okumaktan korkuyorlar: «Kendi silâhı ile ölmüş bir adam!» diyorlar! dedim. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «O câhid mücâhid olarak öldü!» buyurdular. ibni Şihâb demiş ki: Bilâhare ben Seleme b. Ekva'ın bir oğluna sordum da bana babasından naklen bunun gibi rivayette bulundu. Şu kadar var ki (ben: Bazı insanlar ona rahmet okumaktan korkuyorlar, dediğim vakit) Resûlullah (Sallallahu Aleyhi ve Sellem): «Hatâ etmişler! Câhid mücâhid olarak öldü. Binâenaleyh ona iki defa ecir vardır!» buyurdu ve parmağı ile işaret etti, dedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 151
			}
		}
	]
}