{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4678,
			"arabicnumber": "1807.01",
			"text": "(Bize Ahmed b. Yûsuf El-Ezdî Es-Sülemî de rivâyet etti. ki) ; Bize Nadr b. Muhammed, Ikrime b. Ammâr'dan bu isnâdla rivâyet etti. Mekke'ye bir, Medîne'ye dokuz konak mesafede küçük bir beldedir. Köye bu isim, orada bulunan aynı isimde bir su kuyusu dolayısı ile verilmiştir. Bâzılarr bu kelimeyi «Hudeybiyye» şeklinde okumuşlardır. Ağaç altındaki meşhur bey'at burada olmuştur. rivâyette Hudeybiyye'de bulunan ashabın 1400 kişi oldukları bildiriliyor. Bir rivâyette 1300, başka bir rivâyette 1500 nefer oldukları bildirilmiştir. 1600 kişi oldukları dahi rivâyet olunmuştur. Aynî'nin beyanına göre bu ihtilâflar, bazılarının kadınları ve sonradan katılanları da saymasından» bazılarının bunları hesaba katmamasından ileri gelmiştir. Burada en i'timada şayan rakam 1500 kişi olmalarıdır. (sallallahü aleyhi ve sellem)'in kuyuya tükürmesi veya duâ buyurması ile suyun coşarak çoğalması açık bir mu'cizedir. Bu bâbta Buhârî'nin bir rivâyetinde şöyle deniliyor: -Câbir'e: O gün kaç kişi idiniz? diye sordum. Yüz bin kişi olsak yine kâfi gelirdi; biz 1500 kişi idik! cevabını verdi.» murâd: Kureyş'den üç kardeştir. Bunlar Ümeyye, Nevfel ve Abdullah b. Abdi Şems'dirler. Anneleri Able binti Ubeyd'e nisbet edilmişlerdir. Harpte atı korumak için üzerine giydirilen çul gibi bir örtüdür. rivâyette Hazret-i Seleme «amcam Âmir» ta'bîrini kullanıyor; halbuki az yukarıda geçen «Hayber gazası bâbı»nda onun için «kardeşim» demişti. Nevevî bu iki rivâyetin arasım bulmuş ve: «İhtimal süt kardeşi olup neseben amcasidır.» demiştir. gazasında kal'a kumandanı Marhab mübareze için Hazret-i Alî'nin karşısına çıktığı vakit, kendisinin kim olduğunu Hayberliler'in iyi bildiklerini, silâhşor, tecrübeli bir kahraman olduğunu söyleyerek meydan okumuştur. adam bin kişilik bir orduya bedel sayılan müthiş bir pehlivandı. Hazret-i Alî (radıyallahü anh)'ın ona verdiği cevap ise şahane olmuştur. Arslan demektir. Alî (radıyallahü anh) doğduğu vakit annesi adını Esed yani arslan koymuş. Babası Ebü Tâlib evde yokmuş. Geldiğinde oğluna Alî ismini vermiş. Çocuk kuvvetli ve gürbüz olduğu için Esed'i de Haydara ile değiştirmiş. Bu isim güçlü, kuvvetli ve dolayısı ile yine arslan demektir. Alî'nin söze: «Ben o kimseyim ki, annem adımı Arslan koymuştur...» diye başlaması, Marhabi korkutmak ve moralini bozmak içindir. Çünkü Marhab rüyasında kendisini bir arslan öldüreceğini görmüştü. Alî (radıyallahü anh)’ın muradı, cesaret ve atılganlıkta arslan gibi olduğunu anlatmaktır. ufak ölçekle Sendera kilesi Ölçerim!» ifadesinin mânâsı: Düşmanları geniş ölçüde tepelerim demektir. Büyük ölçek ve acele mânâlarına gelir. Filhakika Alî (radıyallahü anh) bir vuruşta Marhabı Öldürmüştür. Bazıları onu Muhammed b. Mesleme'nin öldürdüğünü iddia etmişlerse de doğru değildir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 160
			}
		}
	]
}