{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4678,
			"arabicnumber": "1807.01",
			"text": "Ebu Bekir b. Ebi Şeybe, Hişam b. Kasim tarikiyle gelen tabi’ rivayetin Arapça metni bu hadisin Türkçe mealinden hemen sonra (تابع... 1): -132 - (1807) şeklinde geçmektedir. {132} Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Haşim b. Kaasim rivayet etti. H, Bize ishâk b. ibrahim de rivayet etti. (Dediki): Bize Ebû Âmir El-Akadî haber verdi. Her iki râvi Ikrime b. Ammâr'dan rivayet etmişlerdir. H. Bize Abdullah b. Abdirrahmân Ed-Dârimî dahî rivayet etti. Bu onun hadîsidir. (Dediki): Bize Ebû Aliy El-Hanefî UbeyduIIah b. Abdilmecîd haber verdi. (Dediki): Bize ikrime —ki ibni Ammâr'dır— rivayet etti. (Dediki): Bana iyâs b. Seleme rivayet etti. (Dediki): Bana babam rivayet etti. (Dediki): Hudeybiye'ye Resûlullah (Sallallahu Aleyhi ve Sellem)'le beraber geldik. 1400 kişi idik. Kuyunun başında elli koyun vardı. Kuyu bunları bile sulayamıyordu. Derken Resûlullah (Sallallahu Aleyhi ve Sellem) kuyunun kenarına oturdu da ya duâ etti yahut içine tükürdü. Bunun üzerine kuyu coştu, biz de hem su içtik hem hayvan suladık. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) bizi ağacın altında bey'ata da'vet etti. Ona cemaattan evvelâ ben bey'at ettim. Sonra birer birer herkes bey'at etti. Nihayet halkın ortasında kalınca: «Bey'at et yâ Seleme!» dedi. — Ben sana herkesten evvel bey'at ettim ya Resûlâllah! dedim. «Yine de!» buyurdu. Resûlullah (Sallallahu Aleyhi ve Sellem) beni çıplak gördü. (Beraberinde silâh olmadığını anlatmak istiyor.) Ve bana bir hacefe yahut deraka verdi. Sonra bey'at devam etti. Nihayet cemâatin sonunda kalınca: «Bana bey'at etmiyor musun yâ Seleme!» buyurdular. — Sana cemaatin başında ve ortasında bey'at ettim yâ Resûlâllah! Dedim. «Yine de!» buyurdu. Ben de kendisine üçüncü defa olarak bey'at ettim. Sonra bana: «Yâ Seleme! Sana verdiğim hacefen veya derakan nerede?» diye sordu. — Yâ Resûlâllah! Bana amcam Âmir çıplak olarak rastladı da, onu kendisine verdim; dedim. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) güldü. Ve: «Gerçekten son vaktiyle öbür adamın dediği gibisin: Allahım, bana öyle bir dost ver ki, benim için kendi nefsimden daha sevimli olsun! (demiş)» buyurdu. Bundan sonra müşrikler sulh hakkında bizimle haberleşmeye taşladılar. Hattâ birbirimize gittik ve barıştık. Ben Talha b. Ubeydillâh'ın hizmetçisi idim. Onun atını suluyor; kaşağılıyor ve kendisine hizmet ediyor; yiyeceğinden de yiyordum. Allah ve Resulü (Sallallahu Aleyhi ve Sellem)'e hicret ederek ailemi ve malımı terk etmiştim. Mekkeliler'le biz barış akdederek birbirimizle ihtilâf edince ben bir ağacın yanına geldim ve dikenlerini süpürerek kütüğüne yaslandım. Az sonra bana Mekkeli müşriklerden dört kişi geldi; ve Resûlullah (Sallallahu Aleyhi ve Sellem) hakkında atıp tutmaya başladılar. Ben bunlara kızdım; ve başka bir ağaca değiştim. Onlar da silâhlarını astılar; ve yaslandılar. Onlar bu halde iken birden vadinin aşağısından bir dellâl: Yetişin muhacirlere!.. Züneym oğlu öldürüldü!., diye seslendi. Hemen kılıcımı kuşandım. Sonra bu dört kişiye kendileri uyku halinde iken hücum ettim. Ve silâhlarını alarak elimde deste yaptım. Sonra şöyle dedim: — Muhammed'in yüzünü şereflendiren Allah'a yemîn olsun ki, sizden biriniz başını kaldırırsa üzerinde iki gözü bulunan uzvu [40] keserim! Sonra onları sürerek Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirdim. Amcam Âmir dahî Abelâttan Mikrez denilen bir adamı müşriklerden yetmiş kişinin içinde çukallı bir at üzerinde olduğu halde yederek Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirdi. Resûlullah (Sallallahu Aleyhi ve Sellem) onlara bir baktı ve: «Bırakın onları! Fücurun başı, sonu onların olsun!» buyurdu; ve kendilerini afvetti. Allah da: (Sizi onlar üzerine muzaffer kıldıktan sonra Mekke'nin içinde onların ellerini sizden, sizin ellerinizi de onlardan men'eden odur.) [Fetih 24] âyetinin tamâmını indirdi. Seleme demiş ki : Bundan sonra Medine'ye dönmek üzere yola çıktık. Ve öyle bir menzile indik ki, bizimle Benî Lehyân (kabilesi) arasında bir dağ vardı. Onlar müşriktiler. Resulullah (Sallallahu Aleyhi ve Sellem) bu gece bu dağa tırmanacak kimse için istiğfar etti. Sanki o zat Nebi (Sallallahu Aleyhi ve Sellem) ile ashabının karakolu olacaktı. Seleme şöyle demiş: O gece ben iki veya üç defa (dağa) çıktım. Sonra Medine'ye geldik. Resûlullah (Sallallahu Aleyhi ve Sellem) yük develerini, ben de beraber olmak üzere hizmetçisi Rabâh ile gönderdi. Ben onun maiyyetine Talha'nın atı ile çıktım. Atı develerle birlikte mer'aya suya getirip götürüyordum. Sabahladığımız vakit ne göreyim! Abdurrahman El-Fezârî, Resûlullah (Sallallahu Aleyhi ve Sellem)'m develerini yağma etmiş ve hepsini götürmüş! Çobanını da öldürmüş! Bunun üzerine: — Yâ Rabâh! Bu atı al da Talha b. Ubeydillâh'a götür! Resûlullah (Sallallahu Aleyhi ve Sellem)'e de haber ver ki, müşrikler mer'âdaki sürüsünü yağma etmişlerdir! Dedim. Sonra bir tepenin üzerine çıkarak Medine'ye doğru döndüm. Ve üç defa: Yâ sabahım! diye haykırdım. Sonra düşmanların arkasından onlara ok atarak çıktım. Hem racez okuyor ve: «Ben Ekva'ın oğluyum! Bugün alçakların (helak) günüdür!» diyordum. Az sonra onlardan, bir adama yetiştim. Ve semerine bir ok attım. Hattâ okun yüzü omuzuna erdi. Ben: Al bunu! «Ben de Ekva'ın oğluyum! Bugün alçakların (helak) günüdür!» dedim. Vallahi onlara attım durdum; atlarını vuruyordum. Bana bir atlı döndümü bir ağaca gelerek kütüğüne oturuyor; sonra ona ok atıyor hayvanını vuruyordum. Hattâ dağ daraldı da onun dar yerlerine girdiler mi ben dağa çıkıyor, üzerlerine taş yuvarlıyordum. Böylece devam ettim. Onları kovalıyordum. Hattâ Re«ûlulah (Sallallahu Aleyhi ve Sellem)'in hayvanlarından Allah'ın yarattığı hiç bir deve yoktu ki, onu arkama almış olmayayım! Müşrikler de benimle hayvanın arasını serbest bırakmasınlar! Sonra onlara ok atarak kendilerini ta'kîb ettim. Nihayet otuzdan fazla elbise ve otuz mızrak bıraktılar. Hafiflemek istiyorlardı. Bir şey attılar mı üzerine taşlardan nişanlar koyuyordum. Onları Resûlullah (Sallallahu Aleyhi ve Sellem) ile ashabı tanırdı. Nihayet dar bir dağ yoluna geldiler. Bir de baktılar ki, yanlarına Bedr El-Fezârî'nin oğlu filânca gelmiş! Az sonra kuşluk (yâni sabah) kahvaltısı yapmak için oturdular Ben de bir hüyükün tepesine oturdum. Fezârî: — Bu gördüğün nedir? dedi. (Müşrikler) : — Bu adamla belâya çattık! Vallahi, alaca karanlıktan beri bizden ayrılmadı. Bize ok atıyor; hattâ elimizdeki her şeyi aldı. Dediler. — O halde ona sizden dört kişi gitsin! Dedi. Derhal onlardan dört kişi dağa benim yanıma çıktı. Bana konuşma imkânı verdikleri vakit: — Beni tanıyor musunuz? diye sordum. — Hayır! Sen kimsin? Dediler. — Ben Seleme b. Ekva'yım. Muhammed (Sallallahu Aleyhi ve Sellem)'in yüzünü şereflendiren Allah'a yemin olsun ki, sizden bir adamı yakalamak istemeyeyim; yoksa ona yetişirim! Ama sizden biri beni yakalamak isterse bana yetişemez! Dedim. Onlardan biri: — Ben biliyorum! Dedi. Ve döndüler. Ben yerimden ayrılmadım. Tâ ki Resûlullah (Sallallahu Aleyhi ve Sellem)'in süvarilerini ağaçların arasına girerken gördüm. Bir de baktım. Başlarında Ahram El-Esedî!.. Onun peşinde Ebû Katâdete'l-Ensârî!.. Onun peşinde de Mikdâd b. Esved EI-Kindi!.. Hemen Ahram'ın gemini tuttum. Küffâr dönüp gittiler. — Yâ Ahramî Bunlardan sakın! ki Resûlullah (Sallallahu Aleyhi ve Sellem)'le ashabı yetişinceye kadar yolunu kesmesinler! Dedim. Ahram şunu söyledi: — Yâ Seleme! Eğer Allah'a ve son güne îmân ediyor ve cennetin hak, cehennemin hak olduğunu biliyorsan benimle şehidliğin arasına girme! Bunun üzerine onu bıraktım. O da Abdurrahman'la karşılaştı. Ve hemen Abdurrahman'ın atını öldürdü. Abdurrahmân da onu yaralayarak öldürdü ve onun atına geçti. Resûlullah (Sallallahu Aleyhi ve Sellem)'in atlısı Ebû Katâde Abdurrahmân'a yetişerek onu yaraladı ve öldürdü. Muhammed (Sallallahu Aleyhi ve Sellem)'in yüzünü şereflendiren Allah'a yemîn olsun ki, yaya koşarak onları ta'kîb ettim. Hattâ arkamdaki Muhammed (Sallallahu Aleyhi ve Sellem)'in ashabından ve onların tozundan bir şey görmüyordum. Nihayet güneş kavuşmazdan önce, içinde Zû Kared denilen su bulunan bir dağ yoluna saptılar. Susuz olduklarından ondan su içmek istiyorlardı. Bana baktılar; arkalarından koşuyorum. Ben onları bundan kovdum (yâni bertaraf ettim). Ondan bir damla tadamadılar. Ve çıkarak sarp bir yola çattılar. Ben de koştum; ve onlardan bir adama yetişerek ona omuz başı kemiğne bir ok yetiştirdim. — Al şunu! Ben Ekva'ın oğluyum! Bugün alçakların (helak) günüdür! dedim. — Ey anası ağlayasıca! Sabahki Ekva'ı mı? Dedi. — Evet, ey kendinin düşmanı! Sabahki Ekva'ın!.. cevabını verdim. Sarp bir yolda iki at bıraktılar. Ben bunları sürerek Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirdim. Âmir de birinde sulandırılmış süt, diğerinde su bulunan iki tulum ile bana yetişti. Ben abdest aldım ve su içtim. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem)'e geldim. Kendileri benim müşrikleri kovduğum suyun başında idi. Bir de ne göreyim! Resûlullah (Sallallahu Aleyhi ve Sellem) o develeri ve benim müşriklerden kurtardığım her şeyi, her oku ve her elbiseyi almış! Bilâl benim düşmandan kurtardığım develerden bir dişi deve boğazlamış bile! Kendisi onun ciğerinden, hörgücünden Resûlullah (Sallallahu Aleyhi ve Sellem)'e kızartıyor! — Yâ Resûlâllah! Bana müsaade buyur da şu cemaatten yüz adam seçeyim. Ve düşmanı ta'kîb edeyim de onlardan tepelemediğim hiç bir haberci kalmasın! Dedim. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) güldü. Hattâ gündüzün ışığında yan dişleri göründü. Ve: «Yâ Seleme! Acaba bir şey yapacağını sanıyor mu idin?» dedi. — Evet! Sana ikram buyuran Allah aşkına! cevâbını verdim. «Şüphesiz ki onlara şimdi Gatafan toprağında ziyafet verilmektedir.» buyurdular. Derken Gatafân'dan bir adam gelerek: — Onlar için filân bir deve boğazladı. Ama derisini açtıkları vakit bir toz gördüler. Bunun üzerine: Düşman size gelmiş! Dediler ve hemen çıkarak kaçtılar. Dedi. Sabahladığımızda Resûlullah (Sallallahu Aleyhi ve Sellem). «Bugün süvarilerimizin en hayırlısı Ebû Katade, piyadelerimizin en hayırlısı da Seleme idi.» buyurdular. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) bana iki hisse verdi. Biri süvâri hissesi, biri de piyade hissesi idi. Benim için bunların ikisini bir araya getirdi. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) Medine'ye dönmek üzere beni Adbâ'ın üzerinde arkasına aldı. Ensârdan bir zât vardı ki yaya koşusunda geçilmezdi. Biz yürümekte iken: Medine'ye kadar koşu yapacak yok mu? Koşucu var mı? demeye ve bunu tekrarlamaya başladı. Ben bunun sözünü işitince: — Sen hiç bir iyiye ikram etmez ve hiç bir şerefliyi savmaz mısın? dedim. — Hayır! Meğer ki Resûlullah (Sallallahu Aleyhi ve Sellem) olal cevâbını verdi. — Yâ Resûlâllah! Annem babam hakkı için! Müsaade buyurda şu adamla müsabaka edeyim! Dedim. «Dilersen !» buyurdu. — Kendine gel! Dedim. Ve ayaklarımı ayarlayarak bir sıçradım!.. Bir koştum!.. Nefesim tükenmesin, diye bir veya iki bayırda kendimi tuttum. Ve onun izinden koştum. Yine bir veya iki bayırda kendimi tuttum. Sonra ona yetişmek için eşkini kaldırdım. Ve onun iki omuzu arasına dokundum. Geçildin vallahi! dedim. — Ben biliyorum! dedi. Hasılı Medine'ye kadar onu geçtim. Vallahi üç geceden başka durmadık. Tâ ki Resûlullah (Sallallahu Aleyhi ve Sellem) le birlikte Hayber (seferin)'e çıktık. Ve amcam Âmir düşmana racez okumaya başladı: «Vallahi, Allah olmasa idi biz ne hidayete erer; ne sadaka verir; ne de namaz kılardık!» «Biz senin fadlından müstağni değiliz!;; «İmdi düşmanla karşılaşırsak, ayaklarımızı sabit kıl!» «Üzerimize mutlaka sekînet indir!» Resûlullah (Sallallahu Aleyhi ve Sellem): «Kim bu?» diye sordu. (Amcam): — Ben Âmir! cevabını verdi. «Rabbin sana mağfiret buyursun!» Dedi. Resûlullah (Sallallahu Aleyhi ve Sellem) hassaten bir insana mağfiret dilerse, o insan mutlaka şehîd olurdu! Bu sebeple Ömer b. Hattâb, bir devesinin üzerinde: — Ya Nebiyyallah! Âmir'le bizi faydaIandır saydım ya! diye seslendi. Hayber'e vardığımızda hükümdarları Marhab kılıcını bir kaldırıp bir indirerek çıktı. Hem: «Hayber benim Marhab olduğumu iyi bilir.» «Silahı tamam, denenmiş bir kahraman!..» ipIer geldi mi alev kesilir!» diyordu. Onun karşısına amcam Âmir çıktı. Ve şunları söyledi: «Hayber benim Âmir olduğumu iyi bilir.» «Silâhı tamam, bahâdir, kahraman!..» Derken iki vuruşla birbirlerine girdiler. Ve Marhab'ın kılıcı Âmir'in kalkanının içine düştü. Âmir onu alttan vurmaya kalkıştı. Fakat kılıcı kendine dönerek can damarını kesti. Ölümü de bundan oldu. Seleme demiş ki: Dışarı çıktım. Bir de baktım Nebi (Sallallahu Aleyhi ve Sellem)'in ashabından birkaç kişi: Âmir'in ameli bâtıl oldu! O kendini öldürdü! diyorlar. Hemen ağlayarak Peygamber (Sallallahu Aleyhi ve Sellem)'e geldim; ve; — Yâ Resûlâllah! Âmir'in ameli bâtılmı oldu? dedim. Resûlullah (Sallallahu Aleyhi ve Sellem): «Bunu kim söyledi?» diye sordu. — Senin ashabından bazı kimseler! Dedim. «Bunu söyleyen hatâ etmiş! Bilâkis onun için ecri iki defadır!» buyurdu. Sonra beni Alî'ye gönderdi. Ali gözlerinden rahatsızdı. Ve: «Bu sancağı behemehal Allah'ı ve Resulünü seven yahut Allah'ın ve Resulünün sevdiği bir adama vereceğim!» buyurdular. Müteakiben ben Alî'ye vardım. Ve onu, gözlerinden rahatsız olduğu halde yederek getirdim. Nihayet kendisini Resûlullah (Sallallahu Aleyhi ve Sellem)'e götürdüm. Gözlerine tükürdü; ve hemen iyileşti. Sancağı ona verdi. Marhab da çıkarak şunları söyledi: «Hayber benim Marhab olduğumu iyi bilir.» «Silâhı tamam, denenmiş bir kahraman!» «Harpler geldi mi alev kesilir!» Bunun Üzerine Alî de şöyle dedi: «Ben o kimseyim ki annem adımı arslan koymuştur.» -Ormanların arslanı gibi çirkin manzaralı düşmanlara ufak ölçekle, sendera kilesi ölçerim!» Arkacığından Marhab'ın başını vurarak onu tepeledi. Bilâhare fetih de onun eliyle müyesser oldu. Bâvi ibrahim demiş ki: Bize Muhammed b. Yahya rivayet etti. (Dediki): Bize Abdüssamed b. Abdilvâris, İkrime b. Ammâr'dan bu hadîsi bütün uzunluğu ile rivayet etti",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 160
			}
		}
	]
}