{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4683,
			"arabicnumber": "1811",
			"text": "(Bize Abdullah b. Abdirrahmân Ed-Dârimî rivâyet etti. ki): Bize Abdullah b. Amr rivâyet etti —bu zât Ebû Ma'mer El-Minkârî'dir— ki): Bize Abdülvâris rivâyet etti, ki): Bize Abdülazîz —ki İbn Suheyb'tir— Enes b. Mâlik'ten rivâyet etti. Şöyle dedi: harbi kopunca insanlardan bazıları Peygamber (sallallahü aleyhi ve sellem)’in yanından bozguna uğradılar. Ebû Talha ise Peygamber (sallallahü aleyhi ve sellem)'in önünde onun üzerine deriden bir kalkan tutuyordu. Ebû Talha şiddetle ok atan atıcı bir adamdı. O gün iki veya üç yay kırdı. Beraberinde ok torbası bulunan bir adam geçerken hemen Peygamber (sallallahü aleyhi ve sellem): okları Ebû Talha'ya saç!» buyururdu. (sallallahü aleyhi ve sellem) uzanıp düşmana bakıyor; Ebû Talha: Yâ Nebiyyallah! Annem babam sana feda olsun, uzanıp bakma! Düşmanın oklarından sana bir ok isabet etmesin! Göğsüm onlara senin göğsünden daha yakm olsun! Diyordu. olsun ki, Âişe binti Ebî Bekir ile Ümmü Süleym'i paçalarını sıvamış halde gördüm. Baldırlarının bileziklerini görüyordum. Su tulumlarını sırtlarında taşıyor; sonra gazilerin ağızlarına boşaltıyor; bilâhare dönüp tekrar dolduruyor; ve gelerek yine cemaatin ağızlarına boşaltıyorlardı. Vallahi uyuklamaktan Ebû Talba'nın elinden ya iki yahut üç defa kılıç düştü,. hadîsi Buhârî -Cihâd» ve «Menâkıbü'l-Ensâr» bahislerinde tahrîc etmiştir, paçalarını sıvayarak bacaklarım ve zînetlerini göstermeleri haram ise de bu harpte henüz tesettür âyeti inmemiş; onlara bakmak haram edilmemişti. Bir de burada Hazret-i Enes kasden baktığını söylememiştir. Binâenaleyh onun görmesi kasıdsız ve anî olup; devam etmediğine hamlolunmuştur. şerif, Hazret-i Ebû Talha’nın menkabesine ve harpte kadınların da erkeklerle birlikte kendilerine, münâsib vazifeler görebileceklerine delildir. uyuklama Allah'ın mü'minlere bir lütfü olmuştur. Teâlâ Hazretleri mü'minlerin pek üzüldüğünü ve düşmanın hücumundan korktuklarını bildiği İçin üzerlerine uyku İndirmiş; bu suretle gevşeyip azimlerinin kırılmasını önlemiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 165
			}
		}
	]
}