{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4701,
			"arabicnumber": "1818.01",
			"text": "(Bana Yahya b. Habîb El-Hârisî rivâyet etti. ki): Bize Bavh rivâyet etti. ki): Bize İbn Cüreyc rivâyet etti. ki): Bana Ebû'z-Zübeyr rivâyet etti ki, kendisi Câbir b. Abdillâh'ı şöyle derken işitmiş: (sallallahü aleyhi ve sellem): hayırda ve serde Kureyş'e tabi'dirler.» buyurdu. Hüreyre rivâyetini Buhari «Menâkıb» bahsinde tahrîc etmiştir. Mezkûr rivâyetteki «bu iş»'den murâd: Hilâfet ve emirliktir. Ulemâdan bazıları bu hadîsin emir mânâsına gelen bir ihbar olduğunu söylemişlerdir. Kureyş kabilesi sair Arap kabilelerinden her cihetle üstün olduğu için hilâfet onlara tahsis buyurulmuş; sair insanların onlara tâbi' olmaları emrolunmuştur. müslümanlanna tabi'dir.» Yani onlara karşı gelmek caiz değildir. «Kâfirleri de onların kâfirlerine tabi'dir.» cümlesini Kirmânı şöyle îzâh etmiştir: «Eu cümle onların geçmişteki hâllerini haber vermektedir. Yani onlar küfür devrinde de metbû' ve reis idiler. Kureyş kabilesi Harem-i şerif dahilinde yaşadıkları için Araplar onları sever ve sayarlardı. Resûlüllah (sallallahü aleyhi ve sellem) Peygamber gönderilerek hak dîne davete başlayınca Arapların ekserisi birdenbire ona tâbi' olmayıp Kureyş'in ne yapacağım beklediler. Mekke fethedilip Kureyş kabilesi müslüman olunca sair Araplar da onlara tâbi' olarak takım takım Allah'ın dînine girdiler. Peygamber'in hilâfeti Kureyş'de devam etti. Bu suretle (kâfiri kâfirlerine tâbi' idi) sözü doğru çıktı. Müslümanları da onların müslümanlarına tâbi' oldular.» ikinci rivâyetindeki »hayır ve şer»'den murâd da İslâmiyet ve cahiliyyet devirleridir. Yani: İnsanlar câhiliyyet devrinde nasıl Küreyş'e tâbi' idi iseler, İslâmiyette de yine onlara tâbi'dirler; demektir. Resûlü'Ekrem (sallallahü aleyhi ve sellem) bu hükmün dünya durdukça böyle devam edeceğini haber vermiştir. Aşağıdaki rivâyet dahi aynı mânâdadır",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 1
			}
		}
	]
}