{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4714,
			"arabicnumber": "1823.02",
			"text": "Bize İshâk b. İbrahim ile İbn Ebî Ömer, Muhammed b. Râfi' ve Abd b. Humeyd rivâyet ettiler. Lâfızları birbirlerine yakındır. (İshak ile Abd'ahheranâ tâbirini kullandılar. Ötekiler: Bize Abdürrazzâk rivâyet etti, dediler.) ki): Bize Ma'mer, Zührî'den naklen haber verdi. ki): Bana Salim, İbn Ömer'den naklen haber verdi. (Şöyle dedi): Hafsa'nın yanına girdim de: Biliyor musun baban halîfe bırakmıyor, dedi. O bunu yapacak değildir, dedim. Muhakkak yapar! Dedi. Bunun üzerine onunla bu hususta konuşmaya yemîn ettim; ve sustum. Hattâ sabahleyin eve gittim; ama onunla konuşmadım. Sağ elimle bir dağ taşıyor gibi idim. Nihayet dönerek yanına girdim. Bana insanların hâlini sordu. Ben de kendisine haber verdim. Sonra ona: Ben halkın bir söz söylediklerini işittim de onu sana söylemeye yemîn ettim! Diyorlar ki, sen kendine halîfe bırakmayacakmışsın. Gerçekten senin bir deve çobanın veya koyun çobanın olsa da onları bırakarak sana gelse, çobanın kaybetiğine kail olurdun. İnsanlara riâyet ise daha Çetindir. Dedim. Benim sözüm ona muvafık geldi. Ve bir müddet başını indirdi. Sonra onu bana kaldırarak şunları söyledi: Muhakkak Allah (azze ve celle) dînini koruyacaktır. Ben kendime halîfe bırakmamış olsam, Resûlüllah (sallallahü aleyhi ve sellem) de halîfe bırakmamıştır. Halîfe bırakmış olsam, Ebû Bekir halîfe bırakmıştır, İbn Ömer ki: Vallahi, babam, Resûlüllah (sallallahü aleyhi ve sellem)'le Ebû Bekr'i anmaktan başka bir şey yapmadı. Ve anladım ki, Resûlüllah (sallallahü aleyhi ve sellem) bir kimse ile değişecek değil ve kendine halîfe bırakacak değildir. hadîsi Buhârî «Ahkâm» bahsinde tahrîc etmiştir. (radıyallahü anh)’ın: «Uman ve korkan!» sözünden murâd bir ihtimale göre insanlar iki sınıftır; biri umar, diğeri korkar demektir. Yani bir kısmı benden bir şeyler koparmayı umar; bir kısmı da benden korkar demek istemiştir. Diğer bir ihtimale göre: Ben Allah'ın rahmetini umar, azabından korkarım demektir. Bazıları: «Bu sözden murâd hilâfettir. Yani hilâfet meselesinde insanlar iki kısımdır. Bir kısmı ona rağbet gösterir. Bir kısmı da ondan hoşlanmaz. Ben hoşlananları sevmem; hoşlanmayanların da aczinden korkarım, demektir.» mütâleasında bulunmuşlardır. Kâdî Iyâz'a göre Hazret-i Ömer'in bu sözleri kendinin iki vasfıdır. Yani Ömer; (radıyallahü anh) Allah'ın rahmetini ummakta, azabından korkmaktadır. Onun için de cemaatin övgülerine bakmayarak kendine halîfe bırakmamıştır",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 14
			}
		}
	]
}