{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 473,
			"arabicnumber": "191.05",
			"text": "Bize yine Haccac b. Şa'ir rivayet etti (dedi ki): Bize Fadl b. Dükeyn rivayet etti (dedi ki): Bize Ebu Asım yani Muhammed b. Ebî Eyyub rivayet etti, dedi ki: Bana Yezid el-Fakir tahdis edip dedi ki: Haricilerin bir görüşü kalbimde iyice yer etmişti. Haccetmek sonra da propaganda maksadıyla insanlar arasına çıkmak isteği ile birkaç kişilik bir grup ile birlikte yola çıktık. Yolumuz Medine'ye uğradı. Bir de ne göreyim Cabir b. Abdullah bir direğin yanında oturmuş, etrafındakilere Resulullah (Sallallahu aleyhi ve Sellem)'den hadis naklediyordu. Dedi ki: Derken o cehennemlikleri sözkonusu etti. (Yezid) dedi ki: Ben de ona: Ey Resulullah'ın arkadaşı şu anlattığınız neyin nesidir? Halbuki Allah şöyle buyuruyor dedim (ve) buyrukları okudum: \"Rabbimiz şüphe yok ki sen kimi ateşe sokarsan onu hakir kıldın demektir.\" (Al-i İmran, 192); \"Oradan her çıkmak istediklerinde tekrar oraya geri döndürülürler.\" (Secde, 20) Durum böyle iken daha siz ne diyorsunuz? Cabir: Kur'an okur musun (bilir misin) dedi. Ben, evet dedim. O: Peki, Muhammed aleyhisselamın makamını -Allah'ın onu ölümden sonra diriltip, göndereceği makamını kastediyor- hiç duydun mu, dedi. Ben, evet dedim. O: İşte o Muhammed (Sallallahu aleyhi ve Sellem)'in Allah'ın kendisi sebebiyle çıkartacağı kimseleri çıkartacağı Makam-ı Mahmud'udur dedi, sonra Sıratın konulmasını ve insanların üzerinden geçmesini anlattı. Ayrıca ben bunları ezberimde iyi tutmamış olmaktan korkarım, dedi. Ancak o cehenneme girdikten sonra cehennem ateşinden birtakım kimselerin çıkartılacağını da söyledi. Yani onlar susam çubukları imiş gibi çıkacaklar, cennet ırmaklarından bir ırmağa girip onda yıkanacaklar, sonra (oradan) kağıt gibi çıkacaklar. Bizler döndük (birbirimize):Yazık size, sizce bu yaşlı adam Resulullah (Sallallahu aleyhi ve Sellem)'e hiç yalan söylüyor olabilir mi, dedik ve döndük. Allah'a yemin ederim ki, bizden tek bir adamdan başka (insanlar arasına Haricilik propagandası maksadıyla) çıkmadı. Yahut Ebu Nuaym'in dediği gibi. Yalnız Müslim rivayet etmiştir; Tuhfetu'l-Eşraf, 3140 NEVEVİ ŞERHİ 192.sayfada. DAVUDOĞLU AÇIKLAMA: Darat: dâre'nin cem'idir. Dâre her taraftan yüzün çevresidir. Bunun manâsı yüz secde mahalli olduğu için cehennemde yanmayacak demektir. Yani cehennemden çıkarılanların secde yerlerinden başka yanmadık yerleri kalmamış olacaktır. Hâccâc hadisinde Yezid-i Fakir'in bir müddet haricilerin bâtıl mezhebine girdiği anlaşılmaktadır. Yerinde de görüldüğü vecihle hâriciler büyük günah işliyenlerin ebedi olarak cehennemde kalacaklarını iddia ederler. Yezid 'in kalbine işliyerek benimsediği ve hac dönüşü halka propaganda etmek istediği kavil budur. Fakat Câbir (Radiyallahu anh) \"in hadisini dinledikten sonra tevbe ederek bütün çete efradı bu kavilden dönmüş ve hâricilik propagandası yapmaktan vaz geçmişlerdir. Yalnız aralarından biri hâricilikte İsrar etmiştir. Câbir (Radiyallahu anh) cehennemden çıkarılanları kurumuş susam çubuklarına benzetmiştir. Bu bâbta îbni Esir (Rahimehümallah) şöyle demektedir: «Semâsını: Simsim'in (yani susamın) cem'idir. Susam kökleri topraktan çıkarılarak daneleri alınmak için güneşe konduğu zaman yanmış gibi simsiyah olur ve incelirler. Bu sebeple cehennemden çıkarılanlar susam çöplerine benzetilmiştir. Ben bu kelimeyi uzun müddet aradım sordum. Fakat onun hakkında sadra şifa verecek hiç bir şey bulamadım; bu lâfız tahrif edilmişe pek benziyor. Galiba aslı «sasam odunu» olacak. Sasam: Abonoz gibi siyah bir ağaçtır.» Kaadi Iyâz 'da şunları söylüyor: «Buradaki semâsimin manâsı bilinmiyor. Galiba doğrusu sasam odunu olacak bu, manâ daha güzel yakışıyor. Sasam siyah bir ağaçtır. Abonozdur diyenler de vardır.» Bu hususta daha başka mütâlea yürütenlerde vardır. Fakat muhtar olan kavil İbnü'l-Esir'in beyan ettiği gibi susam olmasıdır.» Karâtîs; Kırtasın cem'idir. Üzerine yazı yazılan sahife demektir. Cehennemden çıkanların beyaz yazı kâğıdına benzetilmesi hayat nehrinde yıkandıktan sonra yüzleri bembeyaz olacağı içindir. Hadisin sonunda ravi: «Yahut Ebu Nuaym'in dediği gibidir» ibaresini kullanmıştır. Ebu Nuaym, isnadın başında zikri geçen Fadl b. Dükeyn 'dir. Bu zât Müslim 'in şeyhinin şeyhidir. Bu cümle ravilerin hadisin sonunda kullandıkları mâruf bir edep ve nezaket cümlesidir. Onlar bunu, manâ itibariyle rivayet ettikleri hadiste bir hata veya değiştirme olmuştur, endişesi ile ihtiyatan söylerler. Yani; «ben hata ettimse doğrusu bana rivayet eden zatın söylediği gibidir» demek isterler",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 379
			}
		}
	]
}