{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 474,
			"arabicnumber": "192",
			"text": "Bize Heddâb b. Halid El-Ezdî rivayet etti (dedi ki): Bize Hammad b. Seleme Ebu imran ile Sabit'ten, onlarda Enes b. Malik'ten naklen rivayet ettiler ki: Resulullah (Sallallahu Aleyhi ve Sellem): şöyle buyurdu: \"Cehennemden dört kişi çıkarılacak ve onlar Allah'a arz edilecekler. Onlardan biri dönüp şöyle diyecek: Rabbim, beni oradan çıkardığına göre artık beni bir daha oraya döndürme diyecek, Allah da onu ondan kurtaracak. \" Yalnız Müslim rivayet etmiştir; Tuhfetu'I-Eşraf, 347, 1073 NEVEVİ ŞERHİ (471-473 numaralı hadisler): (471) \"Bana Yezid el-Fakir tahdis etti.\" Adı Yezid b. Suhayb el-Kufi sonra el-Mekki'dir. Künyesi Ebu Osman'dır. Ona \"el-Fakir\" denilmesinin sebebi sırtında bir hastalığa tutulmuş olmasıdır. Eğilip, bükülmedikçe ondan dolayı ağrı çekiyordu. \"Birtakım kimseler ... nihayet cennete girerler.\" Yüzleri n yuvarlağı yüzün etrafını çeviren yanları demektir. Bu ibarelerin anlamı da şudur: Cehennem ateşi yüzün yuvarlağını yemez; çünkü orası secde yeridir. Burada yüzün yuvarlığı sözkonusu edilirken daha önce diğer hadiste \"secde yerleri\"nden söz edilmişti. Orada da her iki ibarenin bir arada nasıl telif edildiği açıklanmıştı. Allah en iyi bilendir. \"Haricilerin bazı görüşleri kalbimde yer etmişti.\" Asıl yazmalarda ve rivayetlerde \"kalbimde yer etmişti\" anlamındaki lafız bu şekilde ğayn iledir. Kadı İyaz (yüce Allah'ın rahmeti ona) bu kelimenin ayn ile rivayet edildiğini de nakletmektedir. Her ikisinin anlamı birbirine yakındır; yani bu düşünce kalbimin zarına yapışmıştl. Haricilerin görüşüne gelince, daha önce birkaç defa büyük günah işlemiş olanların cehennemde ebediyen kalacakları ve cehenneme girenin oradan bir daha çıkmayacağı görüşüne sahip olduklarını belirtmiştik. \"Haccetmek sonra da insanlar arasına çıkmak maksadıyla ... yola çıktık.\" Yani bizler (3/50) büyük bir kalabalık halinde önce haccetmek sonra da insanlar arasında haricilerin mezhebini açıkça ortaya koyup, ona çağırıp, onun propagandasını yapmak üzere ülkemizden çıktık demektir. \"Ancak o birtakım kimselerin cehennemden çıkacaklarını söyledi.\" Burada (aslında iddia etti, anlamına gelen ve dedi diye tercüme ettiğimiz) zeame fiili, dedi anlamındadır, kitabın baş taraflarında bunun açıklaması geçmiş, imamların onun ile ilgili sözleri de nakledilmişti. Allah en iyi bilendir. \"Susam çubukları gibi çıkarlar. \" Kasıt yağı çıkartılan bildiğimiz susamdır. İbnu'l-Esir diye bilinen İmam Ebu's-Saadat el-Mubarek b. Muhammed b. Abdulkerim el-Cezeri (yüce Allah'ın rahmeti ona) şöyle diyor: Susam kökleri sökülüp, taneleri alınmak üzere güneşe bırakılacak olursa yanmış gibi incelir ve kararır. İşte bunlar ona benzetilmiştir. Ben bu kelimenin gerçekte ne olduğunu uzun süre araştırdım ve onu soruşturdum. Fakat bu hususta beni rahatlatacak bir bilgi bulamadım. Ama büyük bir ihtimalle lafız tahrife uğramış olmalıdır. Büyük bir ihtimalle bu lafız \"sa'sam\" çubukları (odunu) olmalıdır. Bu ise abanos gibi siyah bir ahşaptır. Ebu's-Saadat'ın açıklamaları bunlardır. Onun aradaki mim harfini kaydetmeyip, ikinci sin'in fethalı olarak sözünü ettiği sa'sam kelimesi hakkında Cevheri ve başkaları da aynı şeyleri söylemiştir. Kadı İyaz ise şunları söylemektedir: Burada \"susam\" kelimesinin ne anlama geldiği bilinmiyor. Muhtemelen bunun doğru şekli \"sa'sam odunu\" olmalıdır. Bunun doğru olma ihtimali daha yüksektir. Bu da siyah bir odundur. Abanosun kendisi olduğu da söylenmiştir. Metali' sahibi ise şunları söylemektedir: Semasim aslında susam ve kişniş gibi güçsüz her türlü bitkiye denir. Başkaları da bu muhtemelen hemzeli \"sesem\" olmalıdır, o da abanos demektir. Onları abanos gibi siyah diye benzetmiş olmaktadır. (3/51) Bu ilim adamlarının bu hususta söylediklerinin kısa özeti budur. Ancak tercih edilen Ebu's-Saadat'ın açıkladığı üzere kaydettiğimiz gibi \"susam\" olduğudur. Şunu da belirtelim ki, asıl nüshaların birçoğunda \"(.....): onlar susam çubukları gibi\" şeklinde (gibi anlamındaki lafız) he' den sonra elif ile yazılmıştır ama doğru ve asıl nüshaların ve kitapların birçoğunda yazılı olan şekil ise he' den sonra mim ile yazılmasıdır. Birincisinin de açıklanabilir bir tarafı vardır. O da oradaki zamirin suretlerine raci olmasıdır. Yani onların suretleri susam çubukları gibidir demek olur. Allah en iyi bilendir. \"Kağıt gibi çıkacaklar.\" Kırtas: kağıt üzerine yazı yazılan sahife demektir. O ırmakta yıkandıktan sonra ileri derecede beyaz olup, üzerlerindeki siyahlık kaybolacağından ötürü onları kağıtlara benzetmiştir. \"Yazık size! O yaşlı adamın Resulullah'a yalan söylediğini nasıl düşünebilirsiniz?\" Buradaki yaşlı adamdan kasıt Cabir b. Abdullah (r.a.)'dır. Bu soru bir inkar ve böyle bir kanaati red anlamını taşır; yani onun yalan söylediği asla düşünülemez, böyle bir şüphe olamaz. \"Sonra geri döndük ... \" Yani hacdan döndük ve biz haricilerin görüşünü hiç sözkonusu etmedik. Aksine sustuk ve bundan dolayı tövbe ettik. \"Aramızdan bir adam müstesna.\" O bu görüşten vazgeçmek hususunda bize muvafakat etmedi. \"Yahut Ebu Nuaym'in dediği gibi\" ibaresinden kasıt senedin başında adı geçen Ebu Nuaym Fadl b. Dukeyn'dir. O Müslim'in hocasının hocasıdır. Onun bu yaptığı ravilerin rivayet ettikleri edeplerden bilinen bir edep ve terbiyedir. Bu da eğer ravi rivayeti mana yoluyla nakletmiş ise rivayetinin sonunda ihtiyaten ve meydana gelmiş bir değişiklik endişesiyle \"yahut onun dediği gibi\" demesidir. (473) \"Bize Heddab b. Halid el-Ezdı tahdis etti. .. Enes (r.a.)'dan\" Bu senetteki ravilerin tamamı Basralıdır. \"Heddab\"in adı Hudbe olarak da söylenir. Bunların biri isimdir, diğeri lakaptır. Fakat hangisinin hangisi olduğu ihtilaflıdır. (3/52) Buna dair açıklama daha önce geçmişti. Senetteki Ebu İmran'ın nispeti el-Cevnı' dir. Adı da Abdulmelik b. Habib'dir. Sabit'in nispeti ise el-Bunanl'dir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 380
			}
		}
	]
}