{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 475,
			"arabicnumber": "193.01",
			"text": "Bize Ebû Kâmil FudayI b. Hüseyin el-Cahderî ile Muhammed b. Ubeyd, El-Guberi rivâyet ettiler lâfız Ebû Kâmil'indir dediler ki: Bize Ebû Avane, Katade'den, o da Enes b. Malik'ten naklen rivâyet etti. Enes şöyle dedi. Resulullâh (sallallahü aleyhi ve sellem) buyurdular ki: kıyâmet gününde insanları bir araya toplayacak, onlar buna ehemmiyet verecekler. (İbn Ubeyd: Bu kendilerine ilham olunacak demiş) ve: Rabbimizden şefaat dilesek de bizi şu vaziyetimizden rahata kavuştursa ya, diyecekler. Bunun üzerine Âdem (sallallahü aleyhi ve sellem)’e gelerek: Sen bütün insanların babasısın, Allah seni kendi yed-i kudreti ile yaratmış; sana kendi ruhundan ruh nefh eylemiş, meleklere de emir buyurarak onlar sana secde etmişlerdir. (Ne olur) Bize Rabbin nezdinde sefa'at et de bizi bu (müşkül) mevkimızden kurtarsın, diyecekler. Âdem (aleyhisselâm); Ben sizin zannettiğiniz mevkide değilim diyerek (vaktiyle) yaptığı hatayı söyleyecek ve o hatadan dolayı Rabbinden utanacak, (onlara) lâkin sız Nuh'a, Allah'ın gönderdiği ilk Resule gidin diyecek. Bunun üzerine Nuh (sallallahü aleyhi ve sellem)’e gidecekler. O da: Ben sizin zannettiğiniz mevkide değilim, diyerek (vaktiyle) yaptığı hatasını söyleyecek ve ondan dolayı Rabbinden utanacak (kendilerine) lâkın siz Allah'ın «Halil» ittihaz ettiği İbrahim (sallallahü aleyhi ve sellem)’e gidin diyecek. (Bu sefer) İbrahim (sallallahü aleyhi ve sellem)’e baş vuracaklar. O da: Ben sizin zannettiğiniz mevkide değilim, diyecek ve (vaktiyle) yaptığı hatasını söyleyerek, bundan dolayı Rabbinden utanacak: Lâkin siz Allah'ın kendisiyle konuştuğu ve Tevrat'ı verdiği Mûsa (sallallahü aleyhi ve sellem)’e gidin, diyecek. Mûsa (sallallahü aleyhi ve sellem)'a gidecekler. O da: Ben sizin zannettiğiniz mevkide değilim, diyecek ve (vaktiyle) işlediği hatasını söyleyerek ondan dolayı Rabbinden utanacak: Fakat siz Allah'ın ruhu ve kelimesi olan İsa'ya gidin diyecek. Müteakiben Allah'ın ruhu ve kelimesi olan İsa'ya varacaklar. O da: Ben sizin zannettiğiniz mevkide değilim. Lâkin siz Muhammed (sallallahü aleyhi ve sellem)’e, gelmiş geçmiş bütün günahları mağfiret buyurulmuş olan (o has) kula gidin, diyecek. (sallallahü aleyhi ve sellem) buyurdular ki: «Bunun üzerine bana gelecekler. Ben Rabbimin huzuruna çıkmak için izin istiyeceğim, bana izin verilecek. Rabbimi görünce secdeye kapanacağım. Allah dilediği kadar benî secde halinde bırakacak, sonra bana: Ya Muhammed! Başını kaldır. Söyle sözün dinlensin; iste ki isteğin verilsin; sefa'at dile sana şefa'at hakkı verilsin, denilecek. Ben de başımı kaldırarak Rabbınıin bana öğreteceği bir tahmîd ile Rabbime hamd edeceğim. Sonra şefa'atta bulunacağım. (Rabbını) bana bir hudud tayin edecek. (O hudut dahilindeki) insanları cehennemden çıkaracağım; onları cennete koyacağım. Sonra (Rabbınıe) dönerek secdeye kapanacağım. Allah (yîne) dilediği kadar beni (secde halinde) bırakacak. Sonra (bana): Ya Muhammed başını kaldır! Söyle sözün dinlensin; iste ki istediğin verilsin. Şefa'at dile sana şefa'at hakkı verilsin, denilecek. Ben de başımı kaldırarak Rabbınıe: Onun bana öğrettiği bir hamdle hamd edeceğim, sonra şefa'atta bulunacağım. Rabbim bana bir had çizecek. Ben de o haddin içinde bulunan insanları cehennemden çıkaracağım; kendilerini cennete koyacağım. ki: Üçüncüde mi, dördüncüde mi bilemiyorum. «Ben, Yarabbi! Cehennemde Kür'ân'ın hapsettiklerinden yani kendilerine ebediyyen cehennemde kalmak vacip olanlardan başka kimse katmadı! diyeceğim.» buyurdular. Ubeyd kendi rivâyetinde şöyle dedi: yani üzerine cehennemde ebedî kalmak vacip olan dedi» hadisi Buhârî «Kitabu’t-Tevhîd», «Kitabu’r-Rukaak» ve «Kitabu’l-Tefsir» de, Nesai «Kitabu’t-Tefsir» de, İbn Mâce «Kitâbü'z-Zühd» de tahriç etmişlerdir. şerif Resûlüllah (sallallahü aleyhi ve sellem)’in şefa'ât-i uzmâsı hakkındadır. Bu Şefâ'at mahşerde insanlar hesaba çekilmek için durdukları zaman olacaktır. Makam-ı Mahmud hakkında ulemânın kavilleri çoksa da Hafız İbn Hacere göre bundan murad Şefaat-i Uzma denilen umumî şefaâtdır. Resûlüllah (sallallahü aleyhi ve sellem)'in günahkârları cehennemden çıkarmak için yapacağı şefaati bunun tâbüerindendir. Nevevî şefaatin beş yerde olacağını beyân etmiştir. Bunlar:",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 381
			}
		}
	]
}