{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 478,
			"arabicnumber": "193.04",
			"text": "Bize Muhammed b. Minhal ed-Darir de tahdis etti. (3/20a) Bize Yezid b. Zurey' tahdis etti. Bize Said b. Ebi Arube ve ed-Destevai'nin arkadaşı Hişam, Katade'den tahdis etti. O Enes b. Malik'ten şöyle dediğini nakletti: Resulullah (Sallallahu aleyhi ve Sellem) şöyle buyurdu (H): Bana Ebu Gassan el-Mismai ve Muhammed b. el-Müsenna da tahdis edip dediler ki: Bize Muaz -ki o İbn Hişam'dır- tahdis edip dedi ki: Bana babam Katade'den tahdis etti. Bize Enes b. Malik'in tahdis ettiğine göre Nebi (Sallallahu aleyhi ve Sellem) şöyle buyurdu: \"La ilahe illallah deyip de kalbinde hayır adına arpa ağırlığı kadar bir şey bulunan cehennem ateşinden çıkarılacaktır. Sonra la ilahe Wallah deyip de kalbinde buğday tanesi ağırlığınca hayır adına bir şey bulunan kimseler cehennem ateşinden çıkarılacaktır. Sonra la ilahe illallah deyip de kalbinde zerre ağırlığınca hayır adına bir şey bulunanlar çıkartılacaktır. \" İbn Minhal rivayetinde şunu da eklemektedir: Yezid dedi ki: Şu'be ile karşılaştım, ona bu hadisi naklettim. Şu'be dedi ki: Bize bunu Katade, Enes b. Malik'ten tahdis etti. O Nebi (Sallallahu aleyhi ve Sellem)'den deyip hadisi nakletti. Ancak Şu'be \"zerre\" yerine \"zura (beyaz dan)\" kelimesini kullanmıştır. Yezid dedi ki: Bu lafızda Ebu Bistam tashif yapmıştır. Diğer tahric: Buhari, 44, 7410 -uzun olarak-; Tirmizi, 2593; İbn Mace, 4312; Tuhfetu'l-Eşraf, 1356, 1194,1272 DAVUDOĞLU AÇIKLAMA: SENED: Bu rivayetin senedindeki Sa'id b. Ebi Arube hakkında söz edilmiştir. Çünkü bu zatın âhir Ömründe hafızası bozulmuş bunaklık eseriyle hadisleri karıştırmaya başlamıştır. Böylelerin o hal geldikten sonra rivayet ettikleri hadislerle ihticac olunmazsa da Buhâri ve Müslim'deki hadisleri hadisi karıştırmazdan Önceki yani hafızalarının sağlam bulunduğu zamana hamledilir. Hişâm Said-i Desteva'îye Hişam-ı Desteva'î de derler. Desteva bir yerin ismidir. Bu zat o yerden getirilen elbiseleri sattığı için kendisine Hişâm-ı Desteva; yine o yerden getirilen buğdayı sattığı için Hişâm sahib-i Destevâi denilmiştir. «El-Metâli'» sahibi; «Mu'azb. Hişâm Sahib'd-Destevaî » ifadesindeki sahib-i Desteva'îyi Mu'az'ın sıfatı zannetmişse de bu yanlıştır. Sahib-i Desteva'i Mu'az değil babası Hişâm'dır. MANASI: Hadisteki zerreden murad küçük karıncadır. Züre rivayeti tashiftir. Onun için de Yezid: < Ebu Bistâm bu kelimede tashif yapmış» demiştir. Ebu Bistâm'dan murad Şu'be dîr. Bazıları bu kelimeyi (durra) şeklinde rivayet etmişlerdir ki bu da tasnif'in tashifi'dir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 384
			}
		}
	]
}