{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4824,
			"arabicnumber": "1861",
			"text": "(Bize yine İshâk b. İbrahim rivâyet etti. ki): Bize Mahzunu haber verdi. ki): Bize Vüheyb rivâyet etti. ki): Bize Amr b. Yahya, Abbâd b. Temîm'den, o da Abdullah b. Zeyd'den naklen rivâyet etti. Şöyle dedi: biri gelerek: İşte bu İbn Hanzale'dir; insanlardan bey'at alıyor! Demiş. O da: Ne üzerine? Diye sormuş. ölüm üzerine! cevâbını vermiş. Hayır! Ben bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem)’den sonra hiçbir kimseye bey'at etmem! Demiş. hadîsin Hazret-i Câbir , Müseyyeb ve Seleme rivâyetlerini Buhârî «Kitâbü’l-Megâzb de; Abdullah b. Zeyd rivâyetini «Kitâbül-Cihâd» da; Câbir rivâyetini Nesâî ile Buhârî «Kitâbü’l-Tefsîr» de muhtelif râvîlerden tahrîc etmişlerdir. - Ridvân demlen Hudeybiye bey'atında Peygamber (sallallahü aleyhi ve sellem)’in yanındaki sahabenin sayısını bildiren rivâyetler muhteliftir. Bunların bazısında 1400, bâzısında 1500, bir rivâyette 1300 kişi olduğu bildirilmektedir. Beyhakî ekseri rivâyetlerin 1400 olduğunu söylemiştir. Rivâyetlerin arası şöyle bulunur: Bu bey'atta bulunan ashâb bin dört yüz küsurdur. Ancak hadisi 1400 kişi idiler, diye rivâyet edenler, küsuru dikkate almamış; 1500 olduğunu söyleyenler onu da hesaba katmışlardır. 1300 kişi olduğunu söyleyenler ise kaç olduklarım iyi bilmedikleri için bir kısmını söylememişlerdir. gün ashabın Peygamber (sallallahü aleyhi ve sellem) efendimize ne üzerine föz verip bey'at ettikleri de muhtelif şekillerde rivâyet olunmuştur. Câbir rivâyetinde ölüm için değil harbten kaçmayacaklarına, Seleme rivâyetinde ölüm üzerine bey'at ettikleri bildiriliyor. Mamafih bu İki rivâyet arasında zıddiyet yoktur. Çünkü ölüm üzerine yapılan bey'attan murâd: ölseler bile harbten kaçmayacaklarına söz vermektir. Bir rivâyette ashab burada hicret ve cihâd için; başka bir rivâyete göre dinleyip itaat için; Hazret-i Abdullah b. Ömer'in bir rivâyetinde ise sabır için bey'at etmişlerdir. sabır rivâyetinin bütün mânâları bir araya toplayıp maksadı tam olarak ifade ettiğini söylemişlerdir. Şöyle ki: Kaçmayacaklarına dair yaptıkları bey'aün mânâsı ya zafer kazanıncaya yahut ölünceye kadar sabretmektir, ölüm ve cihâd üzerine yapılan bey'aün mânâları da sabırdır. ilk devirlerinde on müslümanın yüz kâfir karşısında sabredip kaçmamaları vâcib idi. Yüz müslüman bin kâfire karşı durmakla mükellef idiler. Sonraları bu hüküm lafteshedilerek iki misli düşmana karşı sabıretmek vâcib olmuştur. Malikîlerle Şâfiîlerin ve cumhûrun mezhebi budur. Bu kavil İbn Abbâs (radıyallahü anh)'nın da mezhebidir. A'zam'la diğer bir kısım ulemaya göre âyet neshedilmemiştir. Câbir'in: «Yüz bin kişi olsak yine bize yeterdi.,.» sözü, Hudeybiye kuyusu hakkındaki sahih hadîsin kısaltılmış şeklidir. O şunu demek İstemiştir: Ashâb Hudeybiye denilen yere varınca orada bir kuyu buldular. Suyu çok azdı. Resûlüllah (sallallahü aleyhi ve sellem) o kuyuya tükürerek bereketlenmesi için duâ etti. Arkacığından kuyu coştu. Bütün ashab abdest aldılar; hayvanlarını suladılar. Gerçi ashab 1500 kişi idiler; fakat 100.000 kişi -olsalar kuyunun suyu yine hepsine yeterdi. Bu hâdise Peygamber (sallallahü aleyhi ve sellem)'in mu'cizelerinden biridir. Öyle anlaşılıyor ki Hazret-i Câbir'e suâl soran zât, hadîsin asimi ve mu'cize olduğunu biliyor; sadece ashabın sayısını bilmiyormuş. beyanına göre altında Resûlüllah (sallallahü aleyhi ve sellem)'e bey'at yapılan ağacın yeri bulunmaması Allah'ın bir rahmetidir. Çünkü ağaç olduğu gibi kalsa câhil halkın ona tapmalarından korkulurdu. Bu ağacın altında bey'at gibi büyük bir hayır vaki' oldu; oraya ridvân ve sekînet İnmiştir., diyerek nice kimseler fitneye düşebilirlerdi. (radıyallahü anh) hadîsinde Peygamber (sallallahü aleyhi ve sellem)’in: «Bu gün siz yer yüzü halkının en hayırlısısınız!» buyurması ile istidlal eden bâzı şüler Hazret-i Alî'yi Osman (radıyallahü anh) üzerine tercih ve tafdil ederler. Çünkü o gün Ali (radıyallahü anh) mevcud fakat Hazret-i Osman orada yoktu. Şîanın iddiası doğru değildir. Zîra Osman (radıyallahü anh) Peygamber (sallallahü aleyhi ve sellem) efendimizin emri ile Mekke'de kalmış; onun namına bey'atım bizzat Resûlü Ekrem (sallallahü aleyhi ve sellem) yapmıştır. Binaenaleyh hükümde Hazret-i Osman da dâhildir. Zâten hadîsde sahabenin bir birlerine üstünlükleri kasdedilmemiştir. bu hadîsle Bazıları Hızır (Hadır) (aleyhisselâm)'ın peygamber olmadığına istidlal etmiş ve: «Peygamber olarak sağ bulunsa idi, ashabın bir peygamberden üstün olmaları lâzım gelirdi; bu gösterir ki o zaman Hızır (aleyhisselâm) sağ değildi.» demişlerse de sağ ve peygamber olduğunu söyleyenler buna cevap vermiş; onun peygamberliğine delâlet eden âyetleri hatırlattıktan sonra o gün ashabla birlikte Hızır (aleyhisselâm)'mda arada bulunduğunu söylemişlerdir: bu hadîsle bazıları Hızır (Hadır) (aleyhisselâm)'ın peygamber olmadığına istidlal etmiş ve: «Peygamber olarak sağ bulunsa idi, ashâbm bir peygamberden üstün olmaları lâzım gelirdi; bu gösterir ki o zaman Hızır (aleyhisselâm) sağ değildi.» demişlerse de sağ ve peygamber olduğunu söyleyenler buna cevap vermiş; onun peygamberliğine delâlet eden âyetleri hatırlattıktan sonra o gün ashabla birlikte Hızır (aleyhisselâm)'ın da orada bulunduğunu söylemişlerdir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 120
			}
		}
	]
}