{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4896,
			"arabicnumber": "1891.02",
			"text": "(Bize Abdullah b. Avn El-Hilâlî rivâyet etti. ki): Bize Ebû İshâk El-Fezâri ibrahim b. Muhammed, Süheyl b. Ebî Sâlih’den, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): ikisi bir bîrine zarar verecek şekilde bir araya gelmezler.» buyurdu. Kim onlar yâ Resûlüllah? Denildi. kâfiri öldürüp sonra doğru yolu tutan mü'mini» cevâbını verdi. Şerifin birinci rivâyeti hakkında Kâdî İyâz şunları söylemiştir: bu hal, cihâdda bir kâfir Öldüren kimseye mahsustur. Ve kâfiri öldürmesi günahlarına keffâret olur; hattâ onlardan dolayı hiç azâb görmez. Yahut hususî bir niyete veya hususî bir hâle göredir. Bir de o kimsenin A'râf da (cennetin dışında) evvelâ habsedilmek gibi ateş-den başka bir şeyle cezalandırılması, fakat cehenneme girmemesi dahi ihtimâl dahilindedir. Yahut ateşle cezalendınlır da kâfirlerin olmadığı bir yerde cezalandırıldığı için ikisi bir yere gelmez.» rivâyetindeki «ikisi bir birine zarar verecek şekilde bir araya gelmezler.» ifadesini Kâdi Iyâz mânâ i'tibârı ile müşkil görmek-de ve: «Bu hususta en güsel açıklama işaret ettiğimiz gibi şayet cezayı hak etti ise ikisinin ayni zamanda bir araya gelmemeleridir. Çünkü kâfirle beraber cehenneme girmek onun için ayıptır. îmânı ve o kâfiri Öldürmesi kendisine bir fayda vermemiş demektir...» mutâleasını İleri sürmektedir. Kâdı'ye göre bu rivâyet mânâ itibarı île yukarıdaki «Allah iki kimseye güler «muamelesi yapar.» hadîsi gibidir. Yani kâfir müslümanı öldürür; müslüman cennetlik olur. Sonra kâfir de müslüman olup harbde şehîd düşer. Böylece ikisi de cennete giderler. bu rivâyetin bir hangi râvî tarafından değiştirilmiş olduğuna kaaildirler. Onlara göre hadîsin doğru rivâyeti «Bir mü'minİ kâfir öldürür de sonra o kâfir doğru yolu tutarsa..» şeklindedir. takdirde: «Cehennemde İkisi bir birine zarar verecek şekilde bir araya gelmezler.» cümlesi: azâb için cehenneme girmezler., mânâsına gelir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 192
			}
		}
	]
}