{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4915,
			"arabicnumber": "1901",
			"text": "Bize Ebû Bekir b. Nadr b. Ebi'n-Nadr ile Harun b. Abdillâh, Muhammed b. Râfi' ve Abd b. Humeyd rivayet ettiler. Lâfızları birbirine yakındır. (Dedilerki): Bize' Hâşim b. Kaasim rivayet etti. (Dedikî): Bize Süleyman —ki, Ibni'l-Muğira'dır— Sâbit'den, o da Enes) b. Mâlik'den naklen rivayet etti. (ŞÖyle demiş) : Resûlullah (Sallallahu Aleyhi ve Sellem) Büseyse'yi, Ebû Süfyân'ın kervanı ne yaptığını görmek için casus olarak gönderdi. Büseyse evde ben ve Resûlullah (Sallallahu Aleyhi ve Sellem)'den başka kimse yokken geldi. (Râvî: Kadınlarından, birini istisna edip etmediğini bilmiyorum demiş.) Ve kendisine gördüğünü anlattı. Az sonra Resûlullah (Sallallahu Aleyhi ve Sellem) (dışarı) çıkarak konuştu ve şunları söyledi : «Bizim bîr isteğimiz var! Kimin hazır hayvanı varsa hemen bizimle birlikte binsin!..» «Bunun üzerine bazı kimseler Medine'nin yukarısında bulunan binek hayvanlarını almak için ondan izin istemeye başladılar. Fakat o: «Hayır! Yalnız hayvanı hazır oian (binecek)!» buyurdu. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem)'Ie ashabı yola çıktı. Ve müşriklerden önce Bedr'e vardılar. Müşrikler de geldi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Ben başında olmadıkça sakın sizden hiç bir kimse bir şeye ilerlemesin!» buyurdu. Derken müşrikler yaklaştı. Resûlullah (Sallallahu Aleyhi ve Sellem) de : «Kalkın! Genişliği göklerle yer kadar olan cennete!..» buyurdu. Umeyr b. Humâm El-Ensârî: — Yâ Resûlallah! Genişiği göklerle yer kadar olan cennet ha? Dedi. «Evet!» buyurdular. Umeryr : — Hele hele!.. Dedi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Seni hele hele demeye sevkeden nedir?» diye sordu. Umeyr: — Hayır vallahi yâ Resûlâllah! Cennet ehlinden olmamı ümîd etmekten başka bir şey yok! dedi. «Öyle ise sen onun ehlindensin!» buyurdular. Bunun üzerine Umeyr torbasından birkaç hurma çıkararak onlardan yemeye başladı. Sonra şunları söyledi : —Eğer ben bu hurmalarımı yiyinceye kadar yaşarsam bu gerçekten uzun bir hayâttır!.. Hemen elindeki hurmaları attı. Sonra öldürülünceye kadar müşriklerle harbetti",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 210
			}
		}
	]
}