{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4918,
			"arabicnumber": "1903",
			"text": "(Bana Muhammed b. Hatim de rivâyet etti. ki): Bize Behz rivâyet etti. ki): Bize Süleyman b. Muğira, Sâbit'den rivâyet etti. ki): Enes şunları söyledi: Bana da kendi adı verilen amcam Resûlüllah (sallallahü aleyhi ve sellem)'le birlikte Bedir'de bulunmadığını söyledi. Bu ona güç gelmiş. ki): (sallallahü aleyhi ve sellem)’in bulunduğu ilk harbde bulunmadım. Allah bana bundan sonra Resûlüllah (sallallahü aleyhi ve sellem)'le birlikte bir harb gösterdi ise işte ne yaptığımı Allah görüyor!.. söylemekten çekindi. Sonra Resûlüllah (sallallahü aleyhi ve sellem)'le birlikte Uhud gününde bulundu. Karşısına Sa'd b. Muâz çıktı. Enes ona: Yâ Ebâ Amr, nereye? Ah (şu) cennetin kokusu!.. Onu Uhud'un yanında buluyorum! Dedi. Arkacığından küffarla harbetti. Nihayet Öldürüldü. Ve cesedinde kimi vurmadan, kimi yaralama ve ok izinden seksen küsur yara bulundu. Kız kardeşi —halam— Rubeyyi' binti Nadr: Kardeşimi ancak parmak uçlarından tanıyabildim! Dedi. Ve şu âyet indi: \"Mü’minlerden öyle adamlar ki, Allah'a verdikleri sözde sâdık kaldılar. Onlardan bazısı vefat etti; bazısı da bekliyor. Ama hiç bir tebdil yapmadılar, Sûre-i Ahzâb âyet: 23 \" Bu âyetin onunla arkadaşları hakkında indiğini sanırlardı. Hadîsin benzerini Buhârî «Cİhâd» bahsinde tahrîc etmiştir. râvîsi Enes b. Mâlik, yararlıklarından bahsettiği amcası da Enes b. Nadr'dır. Hadîsin muhtelif rivâyetlerinden anlaşılıyor ki, Hazret-i Enes b. Nadr Peygamber (sallallahü aleyhi ve sellem)'in ile iştirak ettiği gazada yani Bedîr'de bulunamamasına çok üzülmüş ve: «Yâ Resûlallah, senin müşriklerle yaptığın ilk cenkte bulunamadım ama Allah bana müşriklerle cengi nasib ederse ne yapacağımı görecektir!» demiş. Bilâhare kendisine Uhud harbî nasîb olmuş. Orada müslümanların bozulduğunu görünce: «Allahım, bunların yaptıklarından dolayı senden özür dilerim. Bu müşriklerin yaptıklarından da sana berâet arzederim!» demiş. Bu arada karcısına bozgun halde Sa'd b. Muâz çıkmış. Evs kabilesinin reîsi olan bu zât o gün Peygamber (sallallahü aleyhi ve sellem) ile beraber yerinden sabit kalanlardanmış. Enes (radıyallahü anhûm) ona Müslîmin rivâyetinde: «nereye?» Buhârî'nin rivâyetinde: «Yâ Sa'd b. Muâz! Cenneti! (dilerim) Yemin olsun onun kokusunu Uhud'un yanında buluyorum.» diye seslenmiş. Ve harbe atılmış... Sa'd: «Yâ Resûlallah! Ben onun yaptığını anlatmaya kaadir değilim» demiş. «Onu (yani cennetin kokusunu) Uhud dağının yanında buluyorum!» sözü hakkında İbn Battal ve başkaları şunları söylemişlerdir: «Bu sözün hakikat olması muhtemeldir; ve Hazret-i Enes hakîkaten cennetin kokusunu duymuştur. Yahut güzel bir koku hissetmiş de onu cennet kokusu diye artmıştır, Şehidler için hazırlanan cenneti gözünün önüne getirerek onun burada savaş meydanında olduğunu tasavvur etmiş olması da caizdir. Bu takdirde mânâ şöyle olur: «Ben pekâlâ biliyorum ki cennet bu yerde kazanılır. Bundan dolayı ona can atıyorum.» Enes'in tanınmaz hale gelmesi, aldığı seksen küsur yaradan ve müşrikler tarafından ağzı, burnu ve sair uzuvları kesildiğîndendir. şerif: Enes b. Nadr (radıyallahü anhûma)'ın faziletine ve cihadda bezli cân etmenin caiz olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 213
			}
		}
	]
}