{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4923,
			"arabicnumber": "1905.01",
			"text": "(Bize Yahya b. Habîb el-Hârisî rivâyet etti. ki): Bize Hâlid b. Haris rivâyet etti. ki): Bize İbnü Cüreye rivâyet etti. ki): Bana Yûnus b. Yusuf, Süleyman b. Yesâr'dan rivâyet etti. (Şöyle dedi): Halk Ebû Hüreyre'nin yanından dağıldılar. Bunun üzerine Şamlıların Nâtil'i ona şunu söyledi: Yâ şeyh! Bize Resûlüllah (sallallahü aleyhi ve sellem)’den işittiğin bir hadîs söyleî Ebû Hüreyre: Peki! Dedi. Ben Resûlüllah (sallallahü aleyhi ve sellem)'i şöyle buyururken işittim: gününde insanların, üzerine ilk hüküm verilecek olanı şehîd edilen bir adamdır. Bu adam getirilerek ona Allah nî'metlerini ta'rîf edecek, o da onları tanıyacaktır. Bu ni'metler hakkında ne yaptın? diye soracak; şehid: Senin uğrunda çarpıştım. Nihayet şehîd edildim! Diyecektir. Hak Teâlâ: Yalan söyledin! Lâkin sen cesur denilmek için çarpıştın. Gerçekten denildi de! Buyuracak. Sonra onun hakkında emir verecek ye yüz üstü sürüklenecek, nihayet cehenneme atılacaktır. de ilmi öğrenip öğreten ve Kur'ânı okuyan bir adamdır. Bu da getirilerek kendisine ni'metlerinî ta'rîf edecek, o da onları tanıyacaktır. Bunlar hakkında ne yaptın? Diye soracak. O adam: İlmi öğrendim ve öğrettim. Senin rizân İçin Kur'ânı da okudum! Diyecek. Teâlâ: Yalan söyledin! Lâkin sen ilmi âlim denilsin diye öğrendin; Kur'ânı da o kaari'dir denilsin diye okudun; gerçekten denildi de! Buyuracak. onun hakkında emir verecek ve yüzü üstü sürüklenecek; nihayet cehenneme atılacaktır. de Allah'm, yakasını genişlettiği ve kendisine malın her çeşidinden verdiği adamdır. Bu da getirilerek ona ni'metlerini ta'rîf edecek; o da onları tanıyacaktır. Bunlar hakkında ne yaptın? Diye soracak. O adam: Uğrunda mal sarf edilmesini dilediğin hiç bir yol bırakmadım. Mutlaka senin için sarfettim! Diyecek. Teâlâ Hazretleri: Yalan söyledîn! Lâkin sen, o cömerttir desinler diye yaptın. Gerçekten denildi de! Buyuracak. Sonra onun hakkında emir verecek ve yüzü üstü sürüklenecek. Sonra cehenneme atılacaktır.»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 218
			}
		}
	]
}