{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4926,
			"arabicnumber": "1906.02",
			"text": "Bana Muhammed b. Sehl et-Temîmî rivayet etti. (Dediki): Bize ibni Ebî Meryem rivayet etti. (Dediki): Bize Nâfi' b. Yezîd haber verdi. (Dediki): Bana Ebû Hâni' rivayet etti. (Dediki): Bana Ebû Abdirrahman el-Hubulî, Abdullah b. Amr'dan rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Gaza ederek ganîmet alan ve selâmette kalan hiç bîr ordu veya seriyye yoktur ki; ecirlerinin üçte ikisini peşin almış olmasınlar. Ve ganimet almadan gaza edip ele geçen hiç bir ordu veya serîyye yoktur ki, ecirleri tamam verilmesin!» buyurdular. izah: Seriyye: en çok dört yüz kişiden meydana gelen bir kıt'a askerdir. ihfâk: bir sey ele geçirememek, boş elle dönmek demektir. Hadîsin mânâsı şudur: Gaziler esîr edilmeden selâmetle döner yahud ganimet alırlarsa ecirleri esîr edilmeden selâmetle döner yahud ganimet alırlarsa ecirleri esîr düşenlerin yahut ganimet almayanların ecirlerinden az olur. Ganimet, gazadan elde edilecek ecrin mukabili bir cüz'dür. Gâzîler ganimet aldılarmı o gazadan dolayı kendilerine verilecek ecrin üçte ikisini peşin almış olurlar. Yani ganimet, ecir cümlesindendir. Sahih ve meşhur hadîslere muvafık olan budur. Nevevi: «Hadîsin zahirî manâsı budur; buna muhalif tek bir sahih ve sarih hadîs rivayet edilmemiştir. Binaenaleyh bu hadîsi bizim verdiğimiz bu manâya hamletmek teayyün eder!» diyor. Kaadî iyâd bu hadîsin tefsirinde bir takım fâsid kaviller hikâye ettikten sonra aynen bu mânâyı kabul etmiştir. Onun hikâye ettiği kavillerden biri şudur: «Bu hadis sahih değildir. Ganimet almakla gazilerin sevabı azalmaz. Nitekim Bedir gazilerinin sevabı ganimet aldılar diye azalmamıştır...» Bâzıları râvîlerden Ebû Hâni'in râvisini meçhul kabul etmişlerdir. Nevevî bu kavillerin fâsid olduğunu beyân etmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 221
			}
		}
	]
}