{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4958,
			"arabicnumber": "1925",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Hüseyn, Davud b. Ebî Hind'den, o da Ebû Osman'dan, o da Sa'd b. Ebî Vakkâs'dan naklen haber verdi. Sa'd şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) : «Garb ehli kıyamet kopuncaya kadar Hakk üzere yardımcı olmakta devam edeceklerdir» buyurdular. izah: Bu rivayetlerin bazılarını Buhari Menakıb bahsinde tahri etmişir. Hadisi Şerifin izahı Kitabu-l-İman'ın sonlarında geçmişti. Buradaki kokudan murad kıyamete yakın Yemen taraflarından çıkarak kadın erkek her mu'minin ruhunu kabzedecek olan rüzgârdır. Bahsedilen taife veys cemaata gelince: Buhârî bunlardan murad ulemâ olduğunu söylemiş; imam Ahmed b. Hanbel ise: -«Bunlar ehli Hadîs değilseler kimler olacağını bende bilemiyorum» demiştir. Kadı iyâd imam Ahmed in bu sözüyle Ehl-i Sünnet vel-Cemaati, hadîs ulemasının mezhebinde olanları kasdettiğini söylemektedir. Nevevî diyor ki: «ihtimalki bu taife muhtelif mu'minler arasına dağılmıştır. Bazıları cengâver yiğitler, bir takımları fukaha ve hadîs uleması kimisi zâhıd kimisi Emri bil ma'rufu yapan zevattır. Hepsinin bir yerde toplu bulunmaları lâzım gelmez. Bilâkis muhtelif yerlerde bulunurlar.» Hadisin son rivayetinde zikri geçen «Garb ehlî»'nden murad Ali b. Medînî'ye göre araplardır. Garb: Büyük kova manasına gelir. Bunu ekseriyetle arablar kullandıkları için onlara «Garb Ehli» denilmiştir. Diğer ulemaya göre Garbdan murad batıdır. Muaz bunların Şamlılar olduğunu söylemiştir. Kudüslüler olduğunu bildiren hadisde vardır. Bazıları «Garb Ehlinden murad: Hiddet ve şiddet sahibi insanlardır. Hasılı yer yüzü kıyamete kadar cihaddan hâli kalmayacaktır. Bir yerde harb ve cidal bitse başka yerde yenisi patlayacak kıyamet yaklaşıncaya kadar bu böyle gidecek ve Hak yolunda mücahede eden halis müslümanlar bulunacaktır. Hadîsin bir rivayeti Allah'ın çok hayır vermek istediği kulunu fakih yaptığı bildirilmektedir.Yani o kimseye Şeriat sahibinin emirleriyle nehiylerinin sırrını ilâhi bir nûr ile anlatır. Bu rivâyet ilmin ve ulemanın faziletine, din âlimi olmanın imanı kurtarmaya bir alâmet sayıldığına delildir. Hadisi Şerifin bütün rivayetleri bir mucizeyi ispat etmektedir. Bu mucize Nebi (Sallallahu Aleyhi ve Sellem)'in haber verdiği cemaatlerin bugüne kadar her devirde zuhur edip hak din uğuruna mücadele etmeleridir Hadisi Şerif ayrıca icmaın hüccet olduğuna da delildir. Nevevî: ««Bu hadîs kendileriyle istidlal edilen en sahih hadislerdendir.» diyor",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 253
			}
		}
	]
}