{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4958,
			"arabicnumber": "1925",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Hü seyn, Dâvûd b. Ebî Hind'den, o da Elbû Osman'dan, o da Sa'd b. Ebî Vak kâs'dan naklen haber verdi. Sa'd Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): ehli kıyâmet kopuncaya kadar Hakk üzere yardımcı omlakta devam edeceklerdir» buyurdular. rivâyetlerin bazılarını Buhârî «Menakıb» bahsinde tahri etmişir. Şerifin izahı Kitabu-l-İman'ın sonlarında geçmişti. Buradak kokudan murad kıyâmete yakın Yemen taraflarından çıkarak kadın ekkek her müminin ruhunu kabzedecek olan rüzgârdır. Bahsedilen taife veys cemaata gelince: Buhârî bunlardan murad ulemâ olduğunu söylemiş; İmâm Ahmed b. Hanbel ise: -«Bunlar ehli Hadîs değil-seler kimler olacağını bende bilemiyorum» demiştir. Kadı Iyâz İmâmı Ahmed İn bu sözüyle Ehl-i Sünnet vel-Cemaati, hadîs ulemasının mezhebinde olanları kasdettiğini söylemektedir. diyor ki: «İhtimalki bu taife muhtelif müminler arasına dağılmıştır. Bazıları cengâver yiğitler, bir takımları fukaha ve hadîs uleması kimisi zâh'ıd kimisi Emri bil ma'rufu yapan zevattır. Hepsinin bir yerde toplu bulunmaları lâzım gelmez. Bilâkis muhtelif yerlerde bulunurlar.» Hadisin son rivâyetinde zikri geçen «Garb ehlî»'nden murad Ali b. Medînî'ye göre araplardır. Garb: Büyük kova manasına gelir. Bunu ekseriyetle arablar kullandıkları için onlara «Garb Ehli» denilmiştir. Diğer ulemaya göre Gabdan murad batıdır. Muâz bunların Şamlılar olduğunu söylemiştir. Kudüslüler olduğunu bildiren hadisde vardır. Bazıları «Garb Ehlinden murad: Hiddet ve şiddet sahibi insanlardır. yer yüzü kıyâmete kadar cihaddan hâli kalmayacaktır. Bir yerde harb ve cidal bitse başka yerde yenisi patlayacak kıyâmet yaklaşıncaya kadar bu böyle gidecek ve Hak yolunda mücahede eden halis müslümanlar bulunacaktır. bir rivâyeti Allah'ın çok hayır vermek istediği kulunu fakın yaptığı bildirilmektedir. Yani o kimseye Şeriat sahibinin emirleriyle nehiy-leriniri sırrını ilâhi bir nûr ile anlatır. Bu rvâyet ilmin ve ulemanın faziletine, din âlimi olmanın imanı kurtarmaya bir alâmet sayıldığına delildir. Hadisi Şerifin bütün rivâyetleri bir mucizeyi ispat etmektedir. Bu mucize Peygamber (sallallahü aleyhi ve sellem)'in haber verdiği cemaatlerin bugüne kadar her devirde zuhur edip hak din uğuruna mücadele etmeleridir Hadisi Şerif ayrıca icmam hüccet olduğuna da delildir. ««Bu hadîs kendileriyle istidlal edilen en sahih hadislerdendir.» diyor",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 253
			}
		}
	]
}