{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 498,
			"arabicnumber": "201",
			"text": "Bana Muhammed b. Ahmed b. Ebi Halef de rivayet etti. (Dediki): Bize Ravh rivayet etti. (Dediki): Bize İbni Cüreyc rivayet etti. Dediki bana Ebuzzübeyr haber verdi ki kendisi Cabir b. Abdillah'ı Nebi (Sallallahu Aleyhi ve Sellem)'den naklen şöyle derken işitmiş : \"Her bir nebinin ümmeti hakkında yapmış olduğu bir duası vardır. Ben ise duamı kıyamet gününde ümmetim için şefaat olarak sakladım. \" Yalnız Müslim rivayet etmiştir; Tuhfetu'I-Eşraf, 2838 NEVEVİ ŞERHİ (493-497 Numaralı Hadisler): (493) \"Bana Ebu Gass2m el-Mismaı. .. tahdis etti.\" Müslim'in tahkikini, işi ne kadar sağlam tuttuğunu, vera ve maharetinin, bilgisinin mükemmelliğini bilmeyen bir kimse bu lafızlara itiraz ederek sözlerini uzatmış olduğu vehmine kapılıp, şöyle diyebilir: Müslim \"ikisi bize tahdis etti\" sözünü söylememeliydi. Ancak bu böyle bir sözü söyleyen kimsenin bir yanılması, bir gafletidir. Aksine Müslim'in bu sözünde oldukça incelikli bir fayda vardır. O bu hadisi Ebu Gassan'ın lafzından dinlemiş olup, o sırada Müslim ile birlikte başka kimse de yoktu. Muhammed b. Müsenna ile İbn Beşşar'dan hadisi dinlediğinde ise beraberinde başkaları da vardı. Daha önce fasıllarda hadis alimleri nezdinde sevilen ve tercih edilen yolun tek başına hadisi dinleyenin \"bana tahdis etti\", başkasıyla birlikte işitenin de \"bize tahdis etti\" demesi olduğunu belirtmiştik. Bundan dolayı Müslim ihtiyatlı davranarak bu sevilen yolun gereğini yapıp: \"Bana Ebu Gassan tahdis etti.\" Yani tek başıma ben ondan dinledim, demiştir. Sonra söze yeniden başlayarak: \"Muhammed b. el-Müsennaile İbn Beşşar da bize tahdis etti.\" Yani ben her ikisinden başkalarıyla birlikte dinledim, demiştir. Buna göre Muhammed b. el-Müsennamübteda (isim cümlesinin öznesi) \"ikisi bize tahdis etti\" sözü ise haberdir. Yoksa Ebu Gassan'a atfedilmiş değildir. Allah en iyi bilendir. \"Hepsi bize Muaz tahdis etti. .. dediler.\" Muhammed b. el-Müsenna, İbn Beşşar ve Ebu Gassan'i kastetmektedir. Allah en iyi bilendir. \"Katade'den dedi ki: Bize Enes'in tahdis ettiğine göre Nebi (Sallallahu aleyhi ve Sellem) ... buyurdu.\" Sonra Müslim, VekIlı den ve Ebu Üsame' den, onlar Mis'ar ve Katade'den diye gelen bir başka yolu da zikretmektedir. (3/76) Sonra: \"Ancak Veki\"in hadisinde o dedi ki: Verildi, buyurdu. Ebu Üsame'nin hadisinde ise Nebi (Sallallahu aleyhi ve Sellem)'den, dedi.\" Bu da Müslim (r.a.)'ın ihtiyatlı bir rivayetidir. Yani onların rivayetleri Enes'in lafzının nasıl olduğu hususunda farklılık arzetmektedir. Enes'ten gelen birinci rivayette Nebi (Sallallahu aleyhi ve Sellem): \"Her bir nebinin bir duası vardır\" buyurduğu belirtilirken, Veki\"in rivayetinde Enes'ten dedi ki: Nebi (Sallallahu aleyhi ve Sellem): \"Her bir nebiye bir dua (hakkı) verilmiştir\" buyurdu, şeklindedir. Ebu Üsame'nin, Enes'ten, onun Nebi (Sallallahu aleyhi ve Sellem)'den diye naklettiği rivayette ise \"her nebinin bir duası vardır\" denilmektedir. \"Bana Muhammed b. Abd el-A\"la da tahdis etti. .. Enes'ten\" Bu bütün ravileri Basralı olan bir isnadtır. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Önceki rivayetler bir birlerini tefsir etmektedirler. Bunların mecmu'undan anlaşılıyor ki; her Nebinin yüzde yüz kabul edilen bir duası vardır. Ve her Nebi kabul edilen duanm hangisi olduğunu bilir. Geri kalan dualarının kabul edilip edilmediğini bilmezler. Bunların bazısı Kabul edilir bazısı edilmez. Kaadı Iyâz'ın beyanına göre; her Nebinin kabul edilen duasından murad ümmeti hakkında ettiği dua olsa gerektir. Nitekim son iki rivayette bu cihet tasrih buyurulmuştur. Bu hadis Nebi (Sallallahu Aleyhi ve Sellem) 'in ümmetine karşı son derece şefkat ve merhametli olduğuna, ümmetinin mühim işlerine bakmaya çok dikkat ettiğine delildir. Bundan dolayıdır ki; ümmeti hakkındaki müstecab duasını ümmetinin en ziyade başının sıkıldığı zamana, kıyamet gününe saklamıştır. Hadis şerif imanını kurtaran mu'minlerin cehennemde ebedi kalmıyacaklarına da delâlet eder. Bir çok yerlerde görüldüğü vecihle ehl-i hakkın mezhebi budur. Resulullah (Sallallahu Aleyhi ve Sellem) 'in duası hakkında inşallah demesi teberrük ve emr-i ilâhiye imtisal içindir. Çünku Allah Teâlâ Kur'an-ı Kerîm'de: «İnşallah demeden hiç bir şey için: Ben bunu yarın yaparım deme.» [ Kehf ] buyurmuştur",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 404
			}
		}
	]
}