{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 499,
			"arabicnumber": "202",
			"text": "Bana Yunus b. Abdil a'lâ Es Sadefi rivayet etti. (Dedi ki): Bize İbni Vehb haber verdi. (Dedi ki): Bana Arar b. Haris haber verdi, ona da Bekr b. Sevade Abdurrahman bin Cübeyr'den, o da Abdullah b. Amr b. As'tan rivayete göre Nebi (Sallallahu aleyhi ve Sellem) yüce Allah'ın İbrahim (aleyhisselfun) hakkındaki: \"Rabbim, şüphesiz ki onlar insanlardan birçoğunu saptırdılar. Artık kim bana uyarsa işte o bendendir.\" (İbrahim, 36) ayetini okudu. İsa (aleyhisselam) da: \"Eğer onları azaplandırırsan şüphe yok ki onlar senin kullarındır ve eğer onlara mağfiret edersen yine şüphe yok ki sen Azizsin, Hakimsin.\" (Maide,118) dedi(ğini bildiren) buyruğu okudu. Sonra ellerini kaldırarak: ''Allah'ım, ümmetimi (bağışla) ümmetimi\" buyurdu ve ağladı. Aziz ve Celil Allah: Ey Cebrail -Rabbin en iyi bilen olmakla birlikte Muhammed'e git ve ona neden ağladığını sor, buyurdu. Cebrail (aleyhisselam) ona gelerek sordu, Resulullah (Sallallahu aleyhi ve Sellem)'de neler söylediğini ona haber verdi. -Halbuki Allah onları da en iyi bilendir. - Bu sefer yüce Allah: Ey Cebrail, Muhammed'e git ve: Şüphesiz senin ümmetin hakkında biz seni razı edeceğiz ve seni üzmeyeceğiz de, buyurdu. Bunu yalnız Müslim rivayet etmiştir; Tuhfetu'I-EşrM, 8873 DAVUDOĞLU AÇIKLAMA: «Seni üzmeyeceğiz» cümlesi ondan önceki «Seni razı edeceğiz» cümlesinin te'kididir. Çünkü onu razı etmek ümmetinden bazılarını affetmekle de tahakkuk edebilir. Bu takdirde diğerleri cehenneme girerler, îşte ümmetinden cehennemde kimseyi bırakmıyacağını anlatmak için Allah Teala: «Seni razı edeceğiz; seni mahzun etmeyeceğiz, bilâkis bütün ümmetini cehennemden kurtaracağız» buyurmuştur. Bu hadisin ümmet hakkında en ümid bahş bir hadis olduğunda şüphe yoktur. Ancak bundan ümmet-i Muhammediyyenin hiç cehenneme girmiyeceği anlaşılmamalıdır. Bilâkis şimdiye kadar görülen rivayetlerden bir çok mu'minlerin cehenneme gireceği ve şefa'atlar sayesinde oradan Çıkarılacağı tasrih buyurulduğu gibi:«Sana Rabbin sen razı oluncaya kadar verecek.» âyet-i kerimesi nazil olduğu vakit Resulullâh (Sallallahu Aleyhi ve Sellem): «O halde ümmetimden bir nefer cehennemde kaldıkça ben de razı olmam.» buyurarak ümmetinden bazılarının cehenneme gireceğine işaretde bulunmuştur. Şu halde mu'minlere bu ve emsali hadislere itimad ederek ibadet hususunda asla gevşeklik göstermemek bilâkis böyle delillerden daha da aşk-u şevke gelerek ibadetlerinde kusur etmemeğe çalışmak gerekir. Mezkur deliller hakikaten ümidbahştır. Fakat bugün mu'min olanların yarın Ölürken bu imanın mutlaka muhafaza edebileceklerine hiç bir kimsenin elinde senet yoktur. Binaenaleyh mu'minler imanlarının icabı olan ibadetlerini tes tekmil ifa etmeli dünyadan mu'min olarak gitmeleri hususunda Allah'a niyazda bulunmalı onun rahmetinden ümitlerini kesmemelidirler. NEVEVİ ŞERHİ: \"Bana Yunus b. Abdula'la es-Sadef'i tahdis etti ... Abdullah b. Amr b. As'dan\" Bu isnadtaki ravilerin tümü Basralıdır. Daha önce \"Yunus\" lafzının nun harfi ötreli, fethalı ve kesreli okunmakla birlikte hepsinde hemzeli ve hemzesiz (mesela Yu'nus şeklinde) okunmak suretiyle altı türlü söyleyişinin olduğunu belirtmiş idik. \"es-Sadef'i\" ise bilinen bir kabile olan \"Sadef\" e nispettir. Ebu Said b. Yunus dedi ki: Bunların Sadeftiler arasında çağrılmaları (onların o kabileden oldukları anlamında değildir) kendisi (Yunus) ne bizzat onlardan (Sadeftilerden)dir, ne de onların azatlılarındandır. (3/77) Burada sözü edilen Yunus b. Abdula'la 264 yılı Rabiulahir ayında vefat etmiştir. 170 yılı Zülhicce ayında doğmuştur. Bu isnadta Müslim'in kendisinden sonra yaşamış bir üstattan rivayeti sözkonusudur. Çünkü Müslim daha önce geçtiği gibi 261 yılında vefat etmiştir. \"Abdullah b. Amr b. As'tan rivayete göre Nebi (Sallallahu aleyhi ve Sellem) yüce Allah'ın İbrahim (aleyhisselam) hakkındaki: \"Rabbim muhakkak on/ar insan/ardan birçoğunu saptırdı/ar\" (İbrahim, 14/36) ayetini okudu. İsa (aleyhisselam) da: \"Eğer on/arı azap/andırırsan şüphe yok ki on/ar senin kullarındır\" (Maide, 5/118) dedi.\" Asıl nüshalarda da \"İsa dedi\" şeklindedir. Kadı İyaz der ki: Bazıları şöyle demiştir: Burada \"dedi\" sözü fiilin değil, söylenenlerin adıdır. Sanki: İsa'nın söylediği şu sözleri tilavet etti, demiş gibidir. Nebi (Sallallahu aleyhi ve Sellem)'in: \"Ellerini ka/dırdı. .. seni üzmeyeceğiz\" buyruğuna gelince, bu hadis-i şerif çeşitli faydalı hükümleri ihtiva etmektedir: 1 - Nebi (Sallallahu aleyhi ve Sellem)'in ümmetine eksiksiz şefkati, onların maslahatlarına oldukça önem vermesi, onları ilgilendiren hususlarla ilgilenmesi 2- Dua ederken elleri kaldırmanın müstehap olduğu 3- Yüce Allah'ın şeretini daha da arttırmasını nİyaz ettiğimiz bu ümmete yüce Allah'ın: \"Ümmetin hakkında seni razı edeceğiz ve seni üzmeyeceğiz\" buyruğu ile verdiği pek büyük müjdesi. Bu hadis, bu ümmet için en çok ümit veren hadislerden birisidir ya da en çok ümit veren hadistir. (3/78) 4- Nebi (Sallallahu aleyhi ve Sellem)'in yüce Allah nezdindeki makamının büyüklüğü ve onun nebimize pek büyük lütfu 5- Nebi (Sallallahu aleyhi ve Sellem)'e Cebrail'in gönderilmesindeki hikmet ise Nebi {Sallallahu aleyhi ve Sellem)'in şerefini açığa çıkarmak, onun en üstün bir konumda olduğunu göstermektir. Çünkü O razı edilecek ve Allah'ın ona ikramları ile hoş tutulacaktır. Allah en iyi bilendir. Bu hadis aynı zamanda yüce Allah'ın: \"Elbette Rabbin sana verecek, sen de hoşnut olacaksın\" (Duha, 93/5) ayetine de uygundur. Yüce Allah'ın: \"Seni üzmeyeceğiz\" buyruğu ile ilgili olarak Tahrir sahibi şunları söylemektedir: Bu ifadelerin anlamını tekid etmektedir, seni mahzun etmeyeceğiz, üzmeyeceğiz demektir. Çünkü razı etmek, hoşnut etmek bazılarının affedilmesi ile gerçekleşebilir. Geri kalanlar ise cehenneme girer ama yüce Allah: Seni hoşnut edeceğiz ve sen üzülmeyeceksin hatta onların hepsini kurtaracağız, demiş olmaktadır. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 405
			}
		}
	]
}