{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"34": "The Book of Hunting, Slaughter, and what may be Eaten"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5004,
			"arabicnumber": "1935.07",
			"text": "{…} Bana Haccâc b. Şair de rivayet etti. (Dediki): Bize Osman b. Ömer rivayet etti. H. Bana Muhammed b. Rafı' dahi rivayet etti. (Dediki): Bize Ebû'I-Münzir El-Kazzâz rivayet etti. Her iki râvî Dâvud b. Kays'dan o da Ubeydullah b. Miksem'den, o da Câbir b. Abdillah'dan naklen rivayet etmişlerdir. Câbir şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) Cüheyne toprağına bir müfreze gönderdi. Üzerlerine de bir zâtı kumandan tayin etti... Râvî hadîsi yukarkilerin hadisi gibi rivayet etmiştir. izah: Bu hadisi Buhârî «Meğazî» bahsinde tahric etmiştir. Ashab’ın yanlarına aldıkları yiyecekler hususundaki rivayetler muhtelifdir. Bunların bâzısında: «Yiyeceklerimizi boynumuzda taşıyorduk» Diğer bazılarında: «Ebû Ubeyde yiyeceklerini bir kaba topladı*. Bir rivayette «Bize birer fiske verirdi, sonra birer hurma vermeye başladı.» deniliyor. Kaâdi İyâd bunların arasını şöyle bulmuştur. Peygamber (Sallallahu Aleyhi ve Sellem) bu zevatın yanlarında olan yiyeceklerden maada kendilerine bir kap kuru hurma vermiştir. ihtimal kî onların yiyecekleri arasında bu bir dağarcıkdan başka hurma yoktu. Hz. Ebû Ubeyde 'nin onlara birer hurma vermesi yanlarındaki yiyecekler bittikten sonradır. Şu halde hadisin birinci rivayeti hadisenin sonunu haber veriyor demektir. Çünkü zahire göre evvelâ hurmaları birer fiske olarak taksim etmiş; sonra azalınca her kese birer hurma vermeye başlamıştır. Nihayet hurma bitmiş, ashab açlıktan, son derece muzdarip olunca ağaç yaprağı yemiş; bundan sonra Allah Teâla kendilerine balina balığını ihsan etmiştir. Hz. Ebû Ubeyde'nin yiyecekleri bir araya toplaması ashabın rızasıyle olmuştur. O bu hususda Nebi (Sallallahu Aleyhi ve Sellem) Efendimize uymuştur. Resûlullah (Sallallahu Aleyhi ve Sellem) bir çok yerlerde bunu yapmıştır. Eş'arîlerde yiyeceklerini bir araya toplarlardı. Bundan dolayı Resûlullah (Sallallahu Aleyhi ve Sellem) onları medhü sena etmişti. Anber balina balığının bir nevidir. Buna mavi balina denildiği söylenir. Ki balina neviîerinin en büyüğü, olup yüz elli ton ağırlığında olabiliyormuş. Bugün bu hayvanın nesli tükenmek üzere bulunduğu söyleniyor. Hz. Ebû Ubeyde balinayı görünce laşe olduğuna kanaat getirmiş ve kendi içtihadı ile onun yenmesi haram olduğunu söylemiştir. Sonra içtihadı değişmiş ve.: «Bu hayvan ölü de olsa size helaldir, çünkü siz Allah yolunda çalışmaktasınız. Muztar da kaldınız. Muztar kalanlara haddi tecavüz etmemek şartiyle ölü hayvan eti yemeyi Allah Teâla mubah kılmıştır.» demiş, ashab da yemişlerdir. Bu hâdise Nebi (Sallallahu Aleyhi ve Sellem)'e haber verilince: «Bu Allah'ın size çıkardığı bir rızıktır.» buyurarak yediklerinin helal olduğunu bildirmiş. Kendisi de getirilen balina etinden yemiştir. Resûlullah (Sallallahu Aleyhi ve Sellem)'in bunu istemesi helal olduğunu bizzat yemek suretiyle göstererek ashabının kalblerini yatıştırmak içindir. Yahut balina Allah tarafından gönderilme bir yiyecek ve harikulade bir ikram olduğu için onunla teberrük etmek için yemiştir. Hadîsin bir rivayetinde üçer üçer deve boğazladığı bildirilen zât Kays b. Sa'd b. Ubâde (Radiyallahû anh)'dır. Ashabın deniz boyunda ne kadar kaldıkları muhtelif şekillerde rivayet olunmuştur. Bir rivayette bir ay, diğer rivayette on beş gün, başka bir rivayette onsekiz gün kaldıkları bildiriliyor. Bunların arası şöyle bulunmuştur. Esas itibariyle bulundukları yerde bir ay kalmışlardır. Bunu rivayet eden râvi hâdiseyi iyi biliyor demektir. Bîr aydan az kalındığını rivayet edenler de fazlasını nefiy etmemişlerdir. Usûlü fıkhın meşhur kaidesine göre mefhumu adedin hükmü yoktur. Yâni bir şeyde aded bildirmek o adedden fazla olmamasını iktiza etmez. Meselâ «sana bunu on kere söyledim» sözünden noksan ve fazlasız on kere söylemiş olmak lâzım gelmez. Onbeş kere söylemiş de olabilir. Bu kaide muarız delil bulunmadığı zaman böyledir. Halbuki burada fazlayı isbat eden delil vardır. Binaenaleyh onu kabul etmek gerekir. Kaadi İyâd rivayetlerin arasını bulmak için: «Yarım ay kaldık diyen bu müddet zarfında balinadan taze et yediklerini kasdetmiş; bir ay kaldıklarını söyleyen ondan pastırma yaparak ayın yarısından sonra pastırmasını yediklerini anlatmak istemiştir.» diyor",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 33
			}
		}
	]
}