{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"34": "The Book of Hunting, Slaughter, and what may be Eaten"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5026,
			"arabicnumber": "1942.02",
			"text": "(Bize bu hadisi Yahya b. Yahya dahi rivâyet etti. ki): Bize Ebû Muâviye haber verdi. H. Ebû Küreyb de rivâyet etti. ki): Bize Ebû Üsame rivâyet etti. Her iki râvî Hişâm'dan bu isnadla rivâyette bulunmuşlardır. hadisini Buhârî «Megazî» ve «Zebâyıh» bahislerinde; Ebû Dâvud «Kitabu'l-et'ıme»'de; Kesâî «Sayd» ile «Velime» bahislerinde tahrîc ettikleri gibi Esmâ hadisini Buhârî, Nesâî ve İbnü Mâce «Zebâyıh» bahsinde muhtelif râvilerden tahric etmişlerdir. etinin yenilip yenilmiyeceği hususunda ulema ihtilaf etmişlerdir. Yenilir deyenlerin delili bu rivâyetlerdir. Hanefîler'den İmâm Ebû Yûsuf ile İmam Muhammed'e diğer mezheb İmâmlarından İmâm Şafiî İmâm Ahmed, Ebû Sevr, Leys, İbnül Mübarek, İbnü Şîrîn, Hasen-i Basri. Ata', Esved b. Yezid Şureyh, İbrahim Nehâî, Hammâd b. Süleyman. Saîd b. Cübeyr, Dâvûd-u Zahirî ve cumhûr ulemâ at etinin mubah olduğuna kaildirler. Bu kavil Ashabı Kiramdan Abdullah b. Zübeyr, Yedâle b. Ubeyd, Enes b. Malik. Esma binti Ebî Bekir ve Süveyd b. Gafele hazerâtından naklolunmustur. İbn Abbâs (radıyallahü anhûm) olmak üzere bir taife bunu mekruh görmüştür. O halde bu keraheti Bazıları tahrimiyye bazıları da tenzîhiyye diye rivâyet etmişlerdir. İmâm A'zam'la İmâm Mâlik'in ve Hatem'in mezhebleri de budur. İmâmı A'zam: «At etini yiyen günahkâr olur ama buna haram ismi verilemez» demiştir. Hazret-i İmâmın bu hükme varması atın pis olduğuna inandığı için değil neslinin tükenmesi mülahazasına metnidir. Çünkü at harb âletidir. Bunların delilleri. katırları ve eşekleri do binesiniz diye bir de zînet için yaratmıştır» âyet-i kerîmesi ile İbn Mâce'nin rivâyet ettiği Halid İbn Velid hadisesidir. Mezkûr hadise: (sallallahü aleyhi ve sellem) at, katır ve eşek etleriyle yırtıcılardan azı dişlileri yemekten men etti.» denilmektedir. Bu hadîsi Ebû Dâvûd ile Nesâî de tahric etmişlerdir. Ancak hadîs ulemâ taraûndan zayıf görülmüş. Hattâ basıları nesh edildiğine bile kail olmuşlardır. Bununla beraber Aîlâme Ayni şöyle demektedir: «Hâlid hadisinin senedi güzeldir. Bundan dolayıdır ki Ebû Dâvûd onu kitabına aldığı vakit sükût etmiştir. Binaenaleyh ona göre bu hadis hasendir» bir rivâyetinde «bir at boğazladık» diğerinde «bir at kestik» deniliyor. Kesmek ameliyesi çene altından, boğazlamak ise göğüsten yapıldığına göre iki rivâyetin arasını bulmak için bunların ayrı ayrı iki vak'a olduğuna hükmedilir. Kesmekle boğazlamak sözlerinden birinin mecaz olarak kullanılması da mümkündür. Bu taktirde vak'a birdir. Ulemâdan Bazıları: «Kesme hususunda atın hükmü sığırın hükmü gibidir» demiş. Bununla atın hem boğazlanmasının hem de kesilmesinin caiz olduğunu anlatmak istemişlerdir. Fakat kesmek efdaî görülmüştür",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 55
			}
		}
	]
}