{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 503,
			"arabicnumber": "205",
			"text": "(Bize Muhammed b. Abdillah b. Nümeyr rivâyet etti. ki): Bize Vekî' ile Yunus b. Bükeyr rivâyet ettiler. Dediler ki: Bize Hişâm b. Urve babasından, o da Âişeden naklen rivâyet etti. ki: en yakın hısımlarını inzâr et.» âyet-i kerîmesi nâzil olunca Resûlüllah (sallallahü aleyhi ve sellem) Safa üzerine çıkarak: Fatime binti Muhammed! Ey Safiyye binti Abdilmuttalip! Ey Abdil Muttalip oğulları! Sizin için Allah'tan hiç bir şeye Mâlik değilim. Malımdan neyi dilerseniz isteyin.» buyurdular. hadis-i Buhari «Kitabül Vasâyâ» ile «Kitabü't-Tefsir» de Nesâî «Kitabül Vasâyâ» da tahriç etmişlerdir. Hadîs Sahabenin mürsellerinden sayılmıştır. Çünkii Ebû Hüreyre Medine'de müslüman olmuş, bu kıssa ise Mekke'de geçmiştir. Bazıları kıssanın iki defa vakî olduğunu söylerler. Buna delâlet eden rivâyetlerde vardır. muhtelif rivâyetlerinden anlaşılan ma'na şudur: «Benim hısımlığıma güvenmeyin; Çünkü ben Allah'ın dilediği azabı sizden defetmeğe kadir değilim.» kadar var ki sizin bir hısımlığınız var; ben bunu hısımlık suyu ile sulayacağım» cümlesinden murad sila-i rahmimi yani akrabalık hakkımı edâ edeceğim demektir. Resûlüllah (sallallahü aleyhi ve sellem) akraba hakkına rivâyet etmemeyi hararete benzeterek onu söndürmek suretiyle hafifleteceğini ifade buyurmuştur. diyor ki: «Resûlüllah (sallallahü aleyhi ve sellem)'e Allahü teâlâ yakın hısımlarını inzar etmesini emir buyurunca Kureyş aşiretlerini davet etti. Bunların içinde nesebi Resûlüllah (sallallahü aleyhi ve sellem) ile babasında birleşenler olduğu gibi üçüncü babada, dördüncü babada, beşinci babada, yedinci babada hatta bunlardan daha uzak babalarda birleşen akrabası da vardı. Ancak hepsi Kureyş kabilesine mensup olmakla bu kabile onları bir araya topluyordu. (sallallahü aleyhi ve sellem)'in hadisde görülen hısımlarına birer birer kabile ve şahıs isimleriyle hitap etmesi en yakın akrabası olduklarındandır. şerif akrabaya vasiyyet hususunda mezhep İmâmlarının delillerindendir. (sallallahü aleyhi ve sellem)’in umumî hitabından murad: Kureyş sözü», hususi hitabından murad da kabile ve şahısların birer birer isimlerini zikir ederek kendilerini çağırmasıdır. Nefislerini Cehennemden kurtarmaktan maksad; imanı olmayanların iman etmesi, imanı olanlarında onu kuvvetlendirmesidir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 409
			}
		}
	]
}