{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 503,
			"arabicnumber": "205",
			"text": "Bize Muhammed b. Abdillah b. Nümeyr rivayet etti. (Dediki): Bize Veki' ile Yunus b. Bukeyr rivayet ettiler Dedilerki: Bize Hişâm b. Urve babasından, o da Aişe'den naklen rivayet etti. Aişe dedi ki: ''Aşiretini, en yakın akrabanı uyar.\" (Şuara, 214) buyruğu nazil olunca, Resulullah (Sallallahu aleyhi ve Sellem) Safa tepesi üzerinde ayakta şöyle buyurdu: \"Ey Muhammed'in kızı Fatıma, Ey Abdulmuttalib'in kızı Safiye, Ey Abdulmuttalib oğulları Allah'a karşı benim size hiçbir faydam olmaz. Malımdan istediğinizi benden isteyebilirsiniz. \" Yalnız Müs\\im rivayet etmiştir; Tuhfetu'l-Eşraf, 17338 NEVEVİ İZAHI 206.sayfada. DAVUDOĞLU AÇIKLAMA: Bu hadis-i Buhari «Kitabül Vasâyâ» ile «Kitabü't-Tefsir» de Nesaî «Kitabül Vasâyâ» da tahriç etmişlerdir. Hadîs Sahabenin mürsellerinden sayılmıştır. Çünkii Ebu Hureyre Medine'de müslüman olmuş, bu kıssa ise Mekke'de geçmiştir. Bazıları kıssanın iki defa vakî olduğunu söylerler. Buna delâlet eden rivayetlerde vardır. Hadisin muhtelif rivayetlerinden anlaşılan ma'na şudur: «Benim hısımlığıma güvenmeyin; Çünkü ben Allah'ın dilediği azabı sizden def etmeğe kadir değilim.» «Şu kadar var ki sizin bir hısımlığınız var; ben bunu hısımlık suyu ile sulayacağım» cümlesinden murad sila-i rahmimi yani akrabalık hakkımı edâ edeceğim demektir. Resulullâh (Sallallahu Aleyhi ve Sellem) akraba hakkına rivayet etmemeyi hararete benzeterek onu söndürmek suretiyle hafifleteceğini ifade buyurmuştur. Tahâvî diyor ki: «Resulullâh (Sallallahu Aleyhi ve Sellem)'i Allah Teâlâ yakın hısımlarını inzar etmesini emir buyurunca Kureyş aşiretlerini davet etti. Bunların içinde nesebi Resulullâh (Sallallahu Aleyhi ve Sellem) ile babasında birleşenler olduğu gibi üçüncü babada, dördüncü babada, beşinci babada, yedinci babada hatta bunlardan daha uzak babalarda birleşen akrbası da vardı. Ancak hepsi Kureyş kabilesine mensup olmakla bu kabile onları bir araya topluyordu. Resulullâh (Sallallahu Aleyhi ve Se!lem)'in hadisde görülen hısımlarına birer birer kabile ve şahıs isimleriyle hitap etmesi en yakın akrabası olduklarındandır. Hadis şerif akrabaya vasiyyet hususunda mezhep imamlarının delillerindendir. Resulullâh (Sallallahu Aleyhi ve Sellem)'İn umumî hitabından murad: «Ey Kureyş sözü», hususi hitabından murad da kabile ve şahısların birer birer isimlerini zikir ederek kendilerini çağırmasıdır. Nefislerini Cehennemden kurtarmaktan maksad; imanı olmayanların iman etmesi, imanı olanlarında onu kuvvetlendirmesidir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 409
			}
		}
	]
}