{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"34": "The Book of Hunting, Slaughter, and what may be Eaten"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5063,
			"arabicnumber": "1959",
			"text": "(Bana Muhammed b. Hatim rivâyet etti. ki): Bize Yahya b. Saîd, İbn Cüreyc'den rivâyet etti. H. Abd b. Humeyd de rivâyet etti. ki): Bize Muhammedi b. Jîekr haber verdi. ki): Bize İbn Cüreyc haber verdi. H. Harun b. Abdillah dahi rivâyet etti. ki): Bize Haccâc rr. Muhammed rivâyet etti. ki): İbn Cüreyc şunu söyledi: Bana Ebû'z-Zübeyr haber verdi ki; kendisi Câbir b. Abdillah'ı şunu söylerken işitmiş: Resûlüllah (sallallahü aleyhi ve sellem) hayvanlardan birinin kapalı olarak öldürülmesini yasak etti. rivâyetleri Buhârî «Zebâyıh» bahsinde; Ebû Dâvûd «Kitabu’l-Edâhi»'de tahrîc etmişlerdir. Hakem b. Eyyûb, Haccâc-ı Zâlim'in amcası oğludur. Basra'da onun naibi imiş, Zalimliği hususunda amcası oğluna benzediği rivâyet olunur. şerifteki Sabr kelimesinden murad: Hayvanı nişan alıp öldürmek için hapsetmek veya bağlamaktır. Bir canlıyı hedef yaparak, onunla nişancılık talimleri yapmak dinen yasak edilmiştir. Buradaki ne-hiy bunun haram olduğunu bildirir. İbn Ömer rivâyetinde Resûlüllah (sallallahü aleyhi ve sellem)’in laneti de bunu gösterir. Canlı hayvanı hedef tutarak atıcılık Öğrenmekte hiç bir maslahat yoktur. Bunu askerlerin yaptığı gibi tahta veya kartondan yapılmış hedeflerle öğrenmek pekâla mümkündür. Çünkü hayvanı hedef almak ona eziyet olduğu gibi, maliyetini zayi etmek ve murdar öldürmek gibi zararları da vardır. Hazret-i Semra'dan rivâyet ettiği bir hadîs-i şerifte nişan almak için hedef yapılan hayvanın yenmesini Peygamber (sallallahü aleyhi ve sellem)'in yasak ettiği bildirilmiştir. Ukeylî şöyle demektedir: «Hayvanı bağlayarak hedef yapmak suretiyle öldürmeyi yasak eden birçok sahîh hadîsler rivâyet edilmiştir. Fakat bu hadisten başka o hayvanın yenilmesini yasak eden hadîs yoktur.» dr eddîn -i Aynî: «Diri iken yetişilerek kesilirse sapan taşıyle vurulan hayvanı yemekte bir beis yoktur.» diyor",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 92
			}
		}
	]
}