{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 507,
			"arabicnumber": "207.02",
			"text": "Bize Muhamnıed b. Abdil A'lâ da rivayet etti: Bize Mu'temir, babasından rivayet etti: Bize Ebu Osman, Züheyr b. Amr ile Kabisa b. Muharıkdan, onlarda Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bunun gibi bir hadis rivayet etti. Yalnız Müslim rivayet etmiştir; T uhfetu'l-Eşraf, 3652 ve 11066 DAVUDOĞLU AÇIKLAMA: Hadisi şerifte Kabisa ile Züheyr şöyle dediler denilerek her ikisinin âyeti okudukları sonra Resulullâh (Sallallahu Aleyhi ve Sellem) bir taş yığınına gittiğini ifade içinde «dedi» tabiri kullanıldığı görülüyorsa da bundan murad yine ikisinin birden söyledikleridir. Rivayette ittifak ettikleri için bir adam gibi kabul edilerek fiil müfred olarak kullanılmıştır. Bu söz ibareden hazf edilse manâya hiçbir zararı olmazdı. Lâkin cümle biraz uzaymca ravi bunu te'kid için tekrarlamıştır, Kur'an-ı Kerim ile Resulullâh (Sallallahu Aleyhi ve Sellem) 'in hadislerinde bunun emsalleri çoktur. NEVEVİ ŞERHİ: \"Kabisa b. el-Muharik ve Zuheyr b. Amr'dan dediler ki. .. \" Burada (hadisin rivayetinde) \"dedi\" fiili tekilolarak kullanılmış ise de kasıt Kabisa ve Zuheyr olduklarından, ikisi dediler demektir. Ancak (3/81) rivayetlerinde ittifak ettikleri için tek bir kişi gibi sayıldıklarında onlar hakkındaki fiili tekil olarak kullanmışbr. Şayet \"dedi\" lafzını hazfetmiş olsaydı, ifade yine açık ve muntazam olurdu. Ancak anlatımda bir parça uzama olunca pekiştirmek için \"dedi\" lafzının bir daha tekrar edilmesi güzeldir. Bunun bir benzeri de Kur'an-ı Azimuşşan'daki: ''lkaba siz ölüp toprak ve kemik olduktan sonra muhakkak çıkartılacaksınlZ diye sizi tehdit mi ediyor?\" (Mu'minan, 23/35) Burada \"siz\" anlamındaki lafız tekrar edilmiştir. Kur'an-ı Azimuşşan'da ve hadis-i şerifte bunun benzerleri pek çoktur. Buna dair açıklama bu kitabın çeşitli yerlerinde geçmiş bulunmaktadır. Allah en iyi bilendir. Hadiste geçen \"radme\" kelimesi \"rademe\" diye de telaffuz edilebilir, bu iki şekli Metilli' sahibi ve başkaları nakletmiş olmakla birlikte Kitabu'l-Ayn sahibi ile Cevherı, Herevı ve başkaları sadece \"radme\" söyleyişini zikretmişlerdir. İbn Faris ve bazıları ise yalnızca \"rademe\" şeklini sözkonusu etmektedirler. Derler ki: Radme'nin tekili \"radm\" ve \"ridam\" diye gelir. Üst üste yığılmış büyük taşlara denilir. Kitabu'l-Ayn'in müellifi şöyle der: Radme dağılmış gibi duran, yerde sabit olmayan bir aradaki taş yığınına denilir. \"Yerbeu\" yakınlarını korumak ve onlar için gözcülük yapmak demektir. Bu işi yapan kişiye \"rabie\" denilir. Düşmanın ani baskın yapmaması için gözcülük ve öncülük yapan kişidir. Çoğunlukla böyle bir kişi ya bir dağın yahut yüksekçe bir yerin üzerinde bulunur ki, uzağı iyice görebilsin. \"Ya sabahah\" ise pek büyük işlerin meydana gelmesi halinde kullanmayı alışkanlık haline getirdikleri bir sözdür. Bu sözü toplanıp, bir araya gelmek ve bu büyük iş için gerekli hazırlığı yapmak için söylerler. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 413
			}
		}
	]
}