{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 507,
			"arabicnumber": "207.02",
			"text": "(Bize Muhammed b. Abdil A'lâ da rivâyet etti, ki): Bize Mu'temir, babasından rivâyet etti. ki): Bize Ebû Osman, Züheyr b. Amr ile Kabisa b. Muharıkdan, onlarda Peygamber (sallallahü aleyhi ve sellem)'den naklen bunun gibi bir hadis rivâyet etti. şerifte Kabisa ile Züheyr şöyle dediler denilerek her ikisinin âyeti okudukları sonra Resulullâh (sallallahü aleyhi ve sellem) bir taş yığınına gittiğini ifade içinde «dedi» tabiri kullanıldığı görülüyorsa da bundan murad yine ikisinin birden söyledikleridir. Rivâyette ittifak ettikleri için bir adam gibi kabul edilerek fiil müfred olarak kullanılmıştır. Bu söz ibareden hazf edilse manâya hiçbir zararı olmazdı. Lâkin cümle biraz uzayınca ravi bunu te'kid için tekrarlamıştır, Kur'ân-ı Kerim ile Resulullâh (sallallahü aleyhi ve sellem)’in hadislerinde bunun emsalleri çoktur. taş yığını demektir. «Radın» ve «Rıdâm»ın müfredidir. «Yerbeü»; fiilinin manâsı Öncülük eder, onları korur demektir. Bu İşi yapana Araplar «Rabie» derler. Gözcü yani orduya düşman baskın yapmasın diye gözetmek için'gönderilen öncü manasınadır. Gözcü ekseriya yüksek bir yere çıkarak düşmanın haline muttali' olmağa çalışır. sabâhâh» kelimesi nahiv ilmine göre istigasedir. «Sabah zamanındaki baskına yetisin» mânasında kullanılır. Araplar baskınları ekseriyetle sabah zamanında yaptıkları için düşmanı gözetliyen murakıp onun hücum edeceğini anlayınca bu kelime ile kendi kavmine seslenir onlarda toplanarak' müdafaya hazırlanırlardı. (sallallahü aleyhi ve sellem) kendi hali ile kavminin halini işte bu gözcünün «baskın var» diye seslenmesine benzetmiştir. Yani Allah'ın gelmekte olan azabını ve kavminin halini düşmanın baskınına kendisini de baskını haber veren gözcüye benzetmiştir. Mâna şudur. Sizin haliniz düşmanın baskın yapacağından gafil bulunan bir kavme benim halimde bu baskını haber veren gözcünün haline benzer. İşte kıyâmet geliyor. Bu haliyle orada dehşetli azaba duçar olacaksınız ben sizi inzar ediyorum. Allah'a iman edin zira bu badireden başka türlü kurtulmanın imkânı yoktur",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 413
			}
		}
	]
}