{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 509,
			"arabicnumber": "208.02",
			"text": "Bize Ebu Bekr b. Ebi Şeybe ve Ebu Kureyb de tahdis edip dediler ki: Bize Ebu Muaviye, A'meş'ten bu isnad ile tahdis etti. (İbn Abbas) dedi ki: Bir gün Resulullah (Sallallahu aleyhi ve Sellem) Safa tepesine çıktı ve: \"Sabah baskınına uğradık\" dedi ve: Bir önceki Ebu Üsame'nin hadisine yakın olarak hadisi rivayet etti ama o bu rivayetinde: \"Aşiretini, en yakın akrabam uyar.\" (Şura, 214) ayetinin inişini sözkonusu etmedi. Tahric bilgisi 507 ile aynı NEVEVİ ŞERHİ: \"İbn Abbas (radıyal1ahu anh) dedi ki: Şu ... ayeti nazil olunca\" İbn Abbas'ın ifadelerinden \"onlar arasından en seçkin olanlarını\" anlamındaki lafızlar Kur'an'ın indirilmiş lafızları iken, sonradan tilavetinin nesh edilmiş olduğu anlaşılmaktadır. Ancak Buhari'nin rivayetlerinde bu fazlalık yer almamıştır. \"Sefhu'l-cebel\" dağın alt tarafı, eteği demektir. Yan tarafı anlamında olduğu da söylenmiştir. \"Bunun üzerine şu ... suresi nazil oldu. A'meş bu şekilde surenin sonuna kadar okudu.\" Yani A'meş meşhur kıraatten farklı olarak \"kad\" lafzını (tercümede:-kesinlikle- kelimesiyle buna işaret etmek istedik)eklemiştir. \"Surenin som.:na kadar\" sözü de surenin geri kalan kısmını ise herkesin okuduğu gibi oku)'up bitirdi, demektir. \"Sure\" kelimesinin-İbn Kuteybe'nin naklettiğine göre- biri hemzeli (su're şeklinde), diğeri hemzesiz (sure) şeklinde olmak üzere iki söyleyişi vardır. Ancak meşhur olan hemzesiz okuyuştur. Şehrin etrafındaki sur gibi yüksekliği nden ötürü bu ismi almıştır. Hemzeli söyleyenlere göre de \"su' re\" yiyecek ve içecekten artana benzetilerek Kur'an-ı Kerim'in bir bölümünün adı olur. Ebu Leheb'in bir diğer söyleyiş şekli de he harfi sakin olarak \"Ebu Lehb\"dir. Asıl adı Abduluzza'dır. Kadı İyaz dedi ki: Bu sure kafire künye vermenin caiz oluşuna delil gösterilmiştir. Halbuki ilim adamları bu hususta farklı kanaatlere sahiptir. Kafire künye vermek hususunda caiz ve mekruh olduğu şeklinde İmam Malik'ten farklı rivayet gelmiştir. Bazıları da şöyle demektedir: Kalbini ısındırmak maksadıyla ona künye vermek caizdir, değilse caiz olmaz; çünkü künye vermekte tazim ve büyütmek vardır. Yüce Allah'ın Ebu Leheb'den künyesi ile söz etmesi ise bu türden değildir. Onun adı Abduluzza ise bu isim batıl bir isimlendirme olduğundan ötürü isminin yerine künyesi sözkonusu edildiğinden bunun delil gösterilecek bir tarafı yoktur. (3/83) Şöyle de açıklanmıştır: O bu künye ile tanınan birisi idi. Bununla birlikte \"Ebu Leheb\"in künye değil, lakap olduğu da söylenmiştir. Künyesi ise Ebu Utbe idi. \"Ebu Leheb\"in sözdeki mücanese (cinas) için kullanıldığı da söylenmiştir. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Ebu Bekr İsmaili: yukarıdaki Ebu Hureyre rivayetiyle buradaki îbni Abbas rivayeti hakkında söz etmiş ve: «Ebu Hureyre'nin bu rivayeti ile İbni Abbas'ın rivayeti mürseldirler. Çünkü bu ayet Mekke'de nazil olmuştur; İbni Abbas o zaman küçüktü Ebu Hureyre ise Medine'de müslüman olmuştur.» demişse de kendisine cevap verilmiş ve: «Onlar bu hadisi ya Nebi (Sallallahu Aleyhi ve Sellem) 'den yahut bir sahabîden işitmiş olabilirler.» denilmiştir. Nevevî diyor ki: İbni Abbas hadisinin, zahirine bakılırsa «Ve onlardan en seçkin kabileni» ibaresi ayet olarak nazil olmuş sonra tilaveti neshedilmiştir. Buharî'nin rivayetinde bu ziyade yoktur. A'meş «Mesed» suresini sonuna kadar okumuş yalnız meşhur olan kıraetin hilafına tahkik edatı olan «Kad» kelimesini ziyade etmiştir. «Sure» kelimesi hemze ile «Su're» şeklinde okunabilir. Fakat meşhur kıraeti hemzesiz olanıdır. Sure okunduğuna göre kelime yükseklik manasına gelen sur'dan alınmıştır. Su're ise su'rdan alınmış olup bakiyye manasına gelir. Ebu Leheb, kelimesi Ebu Lehb şeklinde de okunur. Ebu Lehb'in ismi Abdul Uzza b. Abdulmuttalib'tir. Yani bu adam Resulullah (Sallallahu Aleyhi ve Sellem) 'in Nesebce amcası dır. Bazıları kendisine Ebu Leheb künyesinin verilmesi Leheb adında bir oğlu olduğu içindir demişler bir takımları yanaklarının pek kırmızı olduğu için daha başkaları yüzü pek güzel olup alev gibi parladığı için kendisine Ebu Leheb' (Yani Alemin babası) denildiğini söylemişlerdir. Ona bu künyenin verilmesi akibetinede muvafık düşmüştür. Çünkü ebedî olarak cehennemin alevli ateşinde azab görecektir. Ebu Leheb Nebi (Sallallahu Aleyhi ve Sellem) 'in en büyük düşmanlarından biridir. Bu düşmanlığı ölünceye kadar devam. etmiştir. Hatta Resulullah (Sallallahu Aleyhi ve Sellem)'e «Yazıklar olsun sana bizi bunun için mi topladin?» demesi de bu eziyetler cümlesindendir. Ayet-i kerimede Ebu Leheb hakkında: «Elleri kurudu» buyurulmuştur. Bundan murad helak oldu demektir. Mezkur ayet surede iki defa tekrar edilmiştir. Bunlardan birincisi Ebu Leheb'in helaki için beddua ikincisi hakikaten helak olduğunu ihbardır. Kaadi îyaz diyor ki: «Bu sure île kafire künye verilmesinin caiz olduğuna istidlal edilmiştir. Bu hususta ulemanın ihtilafı vardır. İmam-ı Malik'ten bir rivayete göre caiz bir rivayete göre de mekruhtur. Bazıları kafirin kalbini yatıştırmak: için ona künye verilebilir. Aksi takdirde verilemez. Çünkü künyede ta'zim ve hürmet vardır. Allah Teala'nm Ebu Lehebe künye vermesi bu kabilden değildir. Demişlerdir. İsminin Abdul Uzza olması hususunda hiç bir delil yoktur. Bu tesmiye batıldır. Onun için de künyesi ile anılmıştır. Bazıları Ebu Leheb onun künyesi değil lakabıdır. Künyesi Ebu Utbedir, derler. Ona Ebu Leheb denilmesi ayet sonlarındaki kelimelerin mücaneseti içindir diyenler de vardır",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 415
			}
		}
	]
}