{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"35": "The Book of Sacrifices"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5096,
			"arabicnumber": "1968.05",
			"text": "(Bize Muhammed b. Velid b. Abdülhamîd dahi rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Ya Resûlallah: Biz yarın düşmanla karşılaşacağız. Halbukî yanımızda bıçak yoktur... demiş. hadisi hikâye etmiş, yalnız: «Cemâa. acele ederek onlarla çömlekleri kaynattılar. Peygamber (sallallahü aleyhi ve sellem) Efendimiz de emir vererek çömlekler döküldü» cümlesini anmamış; kıssanın diğer yerlerini söylemiştir. hadîsi Buhârî «Şeriket. Cihad» ve «Zebâyıh» bahislerinde; Ebû Dâvûd «Zebâyıh» de; Tirmizî «Sayd» ve «Siyer» Nesâî «Hacc, Edâhî. Sayd» ve «Zebâyıh» bahislerinde; Mâce «Edâhî» ve «Zehâyıh»'da muhtelif râvilerden tahric etmişlerdir. Tîn'in beyanına göre hâdise hicretin sekizinci yılında Kuneyn gazasında geçmiştir. Zülhuleyfe Mîkaat:dan Zülhuleyfe değildir. ki Hazret-i Râfi' düşmanla karşılaştıkları vakit hayvan kesmek icabederse ne ile keseceklerini sormuştur. Kihçlarıyle düşmanın karşısına çıkmaya hazır bir ordunun hayvan kesmek için başka bir alet, araması kılıçlarını ancak düşmana karşı kullanmak azminde bulunduklarındandır. Çünkü kılıcı hayvan kesmek gibi şeylerle kullanmak onu bozar, körletir. (sallallahü aleyhi ve sellem)'in Hazret-i Râfi'a cevap verirken «A'cil» mi, yoksa «Erni» mi dediğinde râvi şek etmiştir. Acele et, demektir. «Erni» de aşağı yukarı aynı mânâya gelir. Fakat bu kelime «Erin» ve «Erııî» şekillerinde de rivâyet edilmiştir. Onu keserek helâk et. mânâsına gelir. Ernî bu iki veçhe de uyar. Yalnız kelimenin sonunda «N» kesre ile işba' edilmiş; bundan da doğmuştur. diyor ki: «Bu kelimeyi tespit için râviler uzun zaman uğraşmışlardır. Ben bunu lügat ulemasına sordum. Fakat hiç birinin kafi olarak bir şey söylediğini görmedim. Kendime bu işin içinden bir çıkış yolu aradım. Gördüm ki, bu kelime birkaç veçhe gelebilir...» Hattâbi ihtimalli gördüğü vecihleri sıralamış, daha başkaları bu kelime üzerinde uzun uzadıya söz etmişler. Fakat Bedreddîn Aynî bu sözlerin çoğunu sarf kaidelerine muhalif bulmuştur. En kuvvetli vecih «Erin»'dir. muhtelif rivâyetlerinden anlaşılıyor ki, ashâb-ı kirâm aç kalmışlar ve birkaç deve ile koyun ele geçirerek acele kesmişler ve pişirmeye başlamışlar. Resûl-i Ekrem (sallallahü aleyhi ve sellem) ordunun gerisinde bulunuyormuş. Nihayet o da gelerek bu hâli görünce kaynayan çömlekleri döktürmüş. Sonra kesilen her on koyunun yerine bir deve vermiş. Ulema kaynayan kapların niçin döktürüîdüğünde ihtilâf etmişlerdir. Bazıları hayvanlar ganimet değil, yağma suretiyle ve hiç bir ihtiyaç yokken alındığı için döktürül düğünü; \"bir takımları Peygamber (sallallahü aleyhi ve sellem)'i geride bırakarak acele ilerledikleri ve düşmanın hilesinden korunmadıkları için bir ceza olarak yemekleri döküldüğünü söylemişlerdir. Fakat birinci kavile yani ihtiyaç yokken yağma iddiasına itiraz olunur. Çünkü Buhârî'nin rivâyetinde: açlık isabet etti.» denilmektedir. Bu hususta Nevevî şunları söylemiştir: «Peygamber (sallallahü aleyhi ve sellem)’in kaynayan çömlekleri döktürmesi İslâm memleketine ve müşterek ganimet malından yemenin caiz olmadığı yere vardıkları içindir. Çünkü taksim edilmezden önce ganimet malından yemek ancak düşman memleketinde mubah olur.» devrilmesiyle itlafı istenilen yalnız etlerin suyudur. Bu onlara bir cezadır. Etler atılmamıştır. Eilâkis bir yere toplanarak ganimet malına katılmıştır. Gerçi etlerin atılmayarak ganimet mallarına katıldığı naklolunmamış tır. Fakat bunların yakılarak telef edildiği de rivâyet edilmemiştir. Binâenaleyh ganimete katıldıklarına hamledilir. Çünkü şeriat mal israfını haram kılmıştır. Hayber vak'asindaki çömleklerin devrilmesi buna benzemez. Çünkü onlar şer'an pis sayılan etlerle kaynıyordu. Bundan dolayı kaynayan çömleklerin etiyle suyuyla devrilmesi hattâ kırılması emir buyurulmuştu. Buradaki etlerse hiç şüphesiz temiz ve yenilir cinstendir. Binâenaleyh bunların telef edilmesi düşünülemez. (sallallahü aleyhi ve sellem) kesilen koyunların yerine ganimet mallarına on koyun mukabilinde bir deve verilmiştir. Bundan o develerin nefis olduğu ve bir devenin on koyun kıymetini taşıdığı anlaşılır. Bu mesele kurban babındaki kaideye yani bir devenin yedi koyun yerini tutarak, yedi kişi namına kurban edilebilmesine muhalif değildir. Çünkü orta bir devenin kıymeti ekseriyetle yedi koyundur. Buradaki de-velerse orta değil, nefisdirler",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 33
			}
		}
	]
}