{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5130,
			"arabicnumber": "1979.04",
			"text": "(Bu hadîsi bana Muhammed b. Abdillah b. Kuhzâz da rivâyet etti. ki): Bana Abdullah b. Osman, Abdullah b. Mübârek'den, o da Yûnus'dan, o da Zührî'den naklen bu isnadîa bu hadîsin mislini rivâyet etti. hadîsi Buhârî «Kitâbu’l-Humus»'da tahrîc etmiştir. Hadîsin zahirine bakılırsa Hazret-i Ali’ye verilen yaslı develer Bedir'den alınan ganimetlerin beşte birindendir. Fakat İbn-i Battâl'ın beyanına göre siyer ulemâsı Bedir Harbinde ganimetin beşte birinin Peygamberimize tahsisi henüz meşru olmadığına ittifak etmişlerdir. Bu takdirde Hazret-i Ali'nin sözü te'vile muhtaç olur. Ve: «Bana Resûlüllah (sallallahü aleyhi ve sellem) Abdullah b. Cahş'in seriyyesinden bir yaşlı deve verdi» mânâsına alınır. Çünkü Abdullah b. Cahg seriyyesi Bedr'den önce hicretin ikinci senesinde Mekke ile Tâif arasındaki Nahle'ye gönderilmiş, orada bir Kureyş kervanı ile harbederek küffarı tepelemiş, kervanı ganimet almışlardı. Hazret-i Abdullah arkadaşlarına: «Aldığımız ganimetin beşte biri Resûlüllah (sallallahü aleyhi ve sellem)'nin olacak» demişti. Halbuki o zaman henüz ganimetlerin beşte biri meselesi hakkında âyet inmemişti. Abdullah (radıyallahü anh) ganimetin beşte birini Resûlillah (sallallahü aleyhi ve sellem)'a ayırmış, geri kalanını arkadaşlarına taksim etmişti. Beşte bir meselesinin Benî Kureyza gazasında meşru' olduğu söylenir. Daha sonra meşru olduğunu söyleyenler de vardır. hâlini görünce Hazret-i Ali'nin ağlaması Nevevî'ye göre. Hazret-i Fâtıma'ya karşı kusur edip çehizini tamamîayamıyacağın-dan korktuğu içindir. Bizce develerin hâline acıdığı için ağlamış olması daha vârid-i hatırdır. Hamza iyice sarhoş olmuş. Câriye oynatıyordu. Çünkü o zaman henüz içki ve şarkı gibi şeyler haram edilmemişti. Müslümanlar içki içiyor, şarkı dinliyorlardı. İçki ancak Uhud gazasında haram kılınmıştır. Hazret-i Hamza'nin: «Siz benim babamın kölelerinden başka bir şey misiniz?» sözünün mânâsı teşbihtir. Yani siz benim babamın köleleri gibisiniz demek istemiştir. Maksadı da Peygamber (sallallahü aleyhi ve sellem)'n babası Abdullah ile Hazret-i Ali'nin babası Ebû Tâlib'dir. Bunlar Abdulmuttalib'e itaat ve hürmet hususunda onun köleleriymiş gibi davranırmış. Ben Abdulmuttalib'e onlardan daha yakınım» demek istemiştir. Hamza'nin yaraladığı develerin kıymetini ödemesi icabeder. Bu babda bir rivâyet yoksa da Hazret-i Hamza'nin onları ödemiş olması, yahut onun namına Peygamber (sallallahü aleyhi ve sellem)’in vermiş olması yahut Hazret-i Ali'nin bedel istemekten vaz geçmiş olması muhtemeldir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		}
	]
}