{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 517,
			"arabicnumber": "213.02",
			"text": "Bize Ebu Bekr b. Ebi Şeybe de rivayet etti. (Dediki): Bize Ebu Usâme, Amelden, o da Ebu İshak'tan, o da Nu'man b. Beşir'den naklen rivayet etti. Numan b. Beşir dedi ki: Resulullah (Sallallahu aleyhi ve Sellem) şöyle buyurdu: \"Şüphesiz cehennemlikler arasında azabı en hafif olacak kişi, ateşten ayakkabıları ve ayak bağları olan kişidir. Bunlardan dolayı beyni bir tencerenin kaynaması gibi kaynayacaktır. Hem bu kişi azabı kendisinden daha şiddetli bir kimse olmadığını düşünecektir. Hdlbuki o aralarında azabı en hafif olan kişidir. \" Tahric bilgisi 515 ile aynı. DAVUDOĞLU AÇIKLAMA: Bu hadisi Buhâri «Kitabur Rikak» ta, Tirmizî «Sifatü cehennem» bahsinde rivayet etmişlerdir. Bu rivayetlerin yalnız bir danesi müstesna diğerlerinde azabı en az olan kimsenin ismi bildirilmemiştir, îbni Tin'in beyanına göre bu bâbtaki rivayetlerden murad Ebu Talib olabilir. Bu rivayetlerle bunlara benzeyen diğer hadislerde cehennemliklerin muhtelif azab görecekleri tasrih edilmiştir. NEVEVİ ŞERHİ: (509-516 numaralı hadisler): \"Seni koruyordu.\" Seni himaye ediyor, senin menfaatine olan işleri yapıyordu. \"Ben onu cehennem ateşinin derinliklerinde buldum ve onu topuklarına kadar ateşin vardığı bir yere çıkardım.\" Hadiste geçen \"dahdah\" yer üzerinde topuklara kadar ulaşan, derin olmayan, sığ su demektir. Ateş için istiare yoluyla kullanılmıştır. \"Ben olmasaydım cehennem in en alt basamaklarında olacaktı. \" Dilciler \"ed-derk\" kelimesinin derek olarak da söylenebileceğini ve bu iki söyleyişin meşhur ve fasih olduğunu söylemişler, yedi kıraatte de her iki şekilde de okunmuştur. Ferra dedi ki: Bunlar iki ayrı söyleyiştir, çoğulları da \"edrak\" olarak gelir. Zeccac dedi ki: Her iki söyleyişi de dilciler nakletmiş olmakla birlikte tercih edilen \"derek\" şeklinde re harfinin fethalı okunuşudur; çünkü daha çok kullanılan odur. Ebu Hatim ise \"ed-derek\"in çoğulu \"edrak\" olarak gelir. (3/84) \"ed-derk\"in çoğulu ise \"edruk\" olarak gelir. Anlamına gelince, bütün dilbilginleri ile meani ve garip alimleri ile müfessirlerin çoğunluğu derk'in cehennemin dibinin en alt tarafı ve en derin yeri olduğunu söylemişlerdir. Cehennem in pek çok derekleri vardır, onun tabakalarından her birisine de derk veya derek denilir. Allah en iyi bilendir. (3/85) \"Ayaklarının çukur yerine konulur. \" Ayağın çukur yeri, yerden uzak yere yapışmayan kısmıdır. \"Cehennemliklerin azabı en hafif olanı. .. tencerenin kaynadığı gibi beyni kaynar.\" Ayakkabı bağı (şirak) ayakkabının bağının her birisinin adıdır, ayakkabının üst tarafında ayağın yukarı bakan tarafı üzerinde bulunur. Kaynamanın (galeyan) ne olduğu ise bellidir. Bu da oldukça alevli yandığından dolayı ateş üzerinde su ve benzeri şeylerin ileri derecede çalkalanması, hareket etmesi demektir. Mircel (tencere) ise demir, bakır, taş ya da çömlekten yapılmış olabilir. Daha sahih olanı budur. Metali' sahibi ise şöyle diyor: Bunun özelolarak bakırdan yapılmış tencere olduğu da söylenir, ama birincisi daha çok bilinen bir husustur. Başındaki mim ise zaidedir . . Bu hadiste ve benzerlerinde -cennetliklerin nimetlerinde farklılık olduğu gibi- cehennemliklerin azabının da farklı olduğu açıkça ifade edilmektedir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 423
			}
		}
	]
}