{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5244,
			"arabicnumber": "2011.01",
			"text": "(Bize Osman b. Ebî Şeybe de rivâyet etti. ki): Bize Cerir Âmeş'den, o da Ebû Süfyân ile Ebû Salih'den, onlar da Câbir'den naklen rivâyet etîi. Câbir (Şöyle dedi): Ebû Humeyd denilen bir adam Naki'den bir tas süt getirdi de Resûlüllah (sallallahü aleyhi ve sellem) kendisine: velev üzerine aykırı bir çırpı koymak suretiyle olsun Örtseydin ya!» buyurdular. hadîsi Buhârî «Kitâbu'l-Eşribe»'de tahrîc etmiştir, Va'dil Akik'de bir yerin ismidir. Resûlüllah (sallallahü aleyhi ve sellem)’in koyun otlatmak için koruduğu yerin burası olduğu söylenir. Ki Medine'den yirmi fersah uzaktadır. Resûlüllah (sallallahü aleyhi ve sellem)'in kabın üzerine hiç olmazsa aykırı bir çubuk konulmasını emir buyurması, Örtecek başka bir şey bulunmadığına göredir. Ulemâ, kapları Örtme emrinin birçok faideleri olduğunu söylemişlerdir. Bunlardan iki tanesi buradaki hadîslerde varid olmuştur. Biri şeytandan korumaktır. Çünkü şeytan kapak açamaz, bağ çözemez. İkincisi senenin bir gecesinde inen taundan korumaktır. Bunlardan maada pisliklerden korumak, muhtelif sinek ve böceklerden muhafaza gibi faydaları vardır. Zira açık bırakılan kabın içine geceleyin akreb gibi zehirli bir hayvan düşebilir. Bunu bilmeyen kimse kabın içindekini yer veya içerse zehirlenir. Ebû Humeyd'in kapları örtmek geceye mahsustu sözü hadîsin metninden değildir. diyor ki: «Ekseri usul ulemasının kavline göre —ki İmâm Şafiî ile diğer ulemanın mezhebleri de budur. Sahabinin tefsiri lâfzın zahir olan mânasına muhalif ise hüccet değildir. Bu tefsir konusunda başka müçtehidlerin ona uyması lâzım gelmez. Ama hadîsin zahiri mânâsında sahabinin sözüne muhalif bir şey yok, fakat mücmel olursa bu takdirde sahabinin te'viline müracaat olunur ve hadîs onun söylediğine hamledilir... örtme emri umumîdir. Binâenaleyh râvinin mezhebi ile amel ederek tahsisi kabul etmez. Umum üzere bırakılır.»",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 118
			}
		}
	]
}