{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5258,
			"arabicnumber": "2016",
			"text": "Bize Saîd b. Amr El-Eş'asî ile Ebû Bekr b. Ebî Şeybe, Muhammed b. Abdillah b. Nümeyr, Ebû Amir El-Eş'arî ve Ebû Küreyb rivâyet ettiler. Lâfız Ebû Âmir'indir. (Dediler ki): Bize Ebû Üsâme, Kü-reyb'den, o da Ebû Bürde'den, o da Ebû Mûsa'dan naklen rivâyet etti. dedi): Medine'de bir ev geceleyin sâhiblerinîn üzerine yandı. Bunların hali Peygamber (sallallahü aleyhi ve sellem)'e anlatılınca: ki bu ateş size ancak düşmandır. O halde uyuduğunuz zaman onu yanınızdan söndürün!» buyurdular. hadîsini Buhârî «Bed'ül-Halk» bahsinde; İbn-i Ömer'le Ebû Mûsa rivâyetlerini «Kitâbu'l-isti'zan»'da. İbn-i Ömer rivâyetini Ebû Dâvud ile İbn-i Mâce «Kitâb'ul-Edeb»'de; Tirmizî «Etme» bahsinde; Ebû Mûsa hadîsini İbn-i Mâce «Kitâb'ul-Edeb»'de muhtelif râvilerden tahrîc etmişlerdir. Fare demektir. Bu kelime Fâsık'dan alınma ismi tasgirdir. Fâsık; yoldan çıkan demektir. Fare de geceleri deliğinden çıkarak çeşitli zararlar yaptığı için ona bu isim verilmiştir. Fâşiyenin cem'idir. Fâşiye, yayılan demektir ki, murad keçi, koyun, sığır ve deve gibi yayılarak otlayan hayvanlardır. Aslında kömür demektir. Arablar bir benzetme yaparak akşamla yatsı arasındaki karanlığa da fahme demişlerdir. diyor ki: «Bu hadiste dünya ve âhiret mesâlihini bir araya toplayan muhtelif hayır nevilerinden cümleler vardır. Şeytanın ezasından kurtulmanın yolu da bu âdabı Peygamber (sallallahü aleyhi ve sellem) emir buyurmuş, Allah Taûlâ dahi aynı esBâbı onun şerrinden kurtulmaya sebep halketmiştir. Binâenaleyh şeytan kapalı bir kabı açmaya, bağlı bir tulumu çözmeye, kilitli bir kapıyı açmaya ve bir çocuğa veya başkasına ezâ vermeye ancak bu esBâbı bulduğu zaman muktedir olabilir. Nitekim sahih bir hadîste: . evine girerken besmele çekerse, şeytan: Bize bunların yanında gecelemek yok (yani, bizim bu evdekiler üzerine bir sultamız yok) der.\" buyurulmuştur...» rivâyetlerde bilhassa şeytanın şerrinden korunmaya tenbih buyu-rulmakta, şeytanların geceleyin etrafa dağıldıkları bildirilerek çoluk çocuğun ve hayvanatın akşamla yatsı arası olur olmaz yerlere salınmaması tavsiye edilmektedir. Hadîs-i şerif bütün rivâyetleriyle şeytanların varlığına ve insanlara çeşitli zararlar verebileceğine delâlet etmektedir. Maalesef yirminci asır müslümanlarından birçok zavalıllar dinden istifa «etmiş mürtedlerin menfî propagandalarına kapılarak şeytan iddiasını istihfafla veya açık açık inkârla karşılıyorlar. Bizim vazifemiz bu zavallılara bu yaptıklarının açık açık küfür yani dinden çıkmak olduğunu hatırlatmaktır. İslâm'ı hiç kabul etmeyenlerle, ondan yeni yeni çıkmış olanlara Allah'dan hidâyet dilemekten başka sözümüz yoktur. Bizim kırkbeş milyon müslümanm yaşadığı Türkiye'nin radyolarından onbeş dakikalık bir yayın süresinde cin, şeytan, melek ve mucize gibi şeylere en azından onbeş defa efsâne diyen radyo memur ve amirleriyle de uğraşacak vaktimiz yoktur. Bunun hükümetin lâikliğine ne derecede aykırı bir cüretkârlık olduğunu hükümeti idare edenler düşünsün. Biz bir defa daha şunu te'kid etmek isteriz ki, şeytanlar vardır. Bunların varlığına inanmak bir müslüman için zarurîdir. İnanmayan veya alay edenler derhal dinden çıkarak mürtedler güruhuna dâhil olurlar. hadîste senenin bir gecesinde vebanın (yani taun hastalığının) yeryüzüne indiği bildiriliyor. vebayı: «Ekseriyetle Ölüme götüren umumî bir hastalıktır.» diye tarif etmiştir. sarihlerinden Übbî, Cevheri'nin bu tarifini beğenmemiş: «Cevherî'nin söylediği veba malûm olan hastalıktır. Hadîsten anlaşılan bu veba değildir. O başka bir vebadır» demişse de burada hatâ eden Cevheri değil, kendisi olmuştur. Çünkü yeryüzüne indirildiği bildirilen veba hastalıktan başka bir şey değildir. Übbî: «İnmenin hakikati cisimlere mahsustur.» diyor. Bu söz vebanın yere inen bir hastalık olduğuna münafî değildir. Çünkü hastalıkların mikrob denilen ufak hayvanlardan meydana geldiği bugün ispat edilmiş bir keyfiyettir. Mikroplar gözle görülmeyecek kadar ufak da olsalar birer cisimdirler. (sallallahü aleyhi ve sellem) yangına sebebiyet vermemek için evlerde yanan mum, kandil ve gaz lâmbası gibi şeylerin söndürülmesini emir buyuruyor. Yangına sebebiyet vermiyeceği kuvvetle kestirilirse söndürmeden bırakmak da caizdir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 132
			}
		}
	]
}