{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 528,
			"arabicnumber": "220.02",
			"text": "Bize Ebu Bekir b. Ebi Şeybe rivayet etti. (Dediki): Bize Muhammed b. Fudayl. Husayn'dan, o da Sa'id b. Cübeyr'den naklen rivayet etti. (Dediki): Bize İbni Abbas rivayet etti. (Dediki): Resulullah (Sallallahu Aleyhi ve Sellem): «Bana bütün ümmetler gösterildi. » buyurdular sonra hadisin geri kalan kısmını Hüseyim hadisi gibi rivayet etti. Yalnız Hüşeym hadisinin baş tarafını zikretmedi. DAVUDOĞLU AÇIKLAMA: Bu hadisi Buhâri «Kitabu'l Merdâ'vet-Tıb» ile «Ehadisü'l Enbiya» ve «Kitabur' Rikak» da Tirmizi : «Kitabu'z-Zuhd» de Nesai 'de «Kitabu't-Tib» da tahric etmişlerdir. Husayn b. Abdirrahman'ın «namazda filân değildim. Lâkin beni akrep sokmuştu» demesi kendisinin ibadette bulunduğunu zannetmesinler yani yapmadığı bir şey'i yaptı zannederek başkasına o suretle anlatmasınlar diyedir. Rukye: Hasta okumaktır. Hadisdeki «ayn» dan murad da nazar olmaktır. Bazı insanların gözlerinin başkalarına dokunduğu dinen hak olduğu gibi bugün tıbben de kabul edilmiştir. Hume: Akrep ve yılan gibi hayvanların zehiri ve o zehirin tevlid ettiği şiddet ve hararettir. «Nazarla zehirli hayvan sokmasından başka hiç bir şeyde Rukiye yoktur.» cümlesi hakkında Hattabî şunları söylemiştir: «Bu hadisin mânası nazar olana ve zehirli hayvan sokana okumaktan daha şifâ bahş ve daha evlâ hiç bir deva yoktur, demektir. Çünkü bunların zararı pek şiddetlidir. Yoksa hastalara okunmaz demek değildir. Filvaki Nebi (Sallallahu Aleyhi ve Sellem) hem okumuş hemde okumayı emretmiştir. Hastaya Kur'an ve esmaullâh okumak mubahtır. Okumanın mekruh olanı arapçadan başka bir dille yapılandır. Çünkü bu ya küfüre varır yahut içine şirk karışan sözlerden ibaret olur. Resulullâh (Sallallahu Aleyhi ve Sellem/in kerih gördüğü hasta okuma cahiliyet devrinde Arapların yaptığı muskacılık (nüsha) dır. Onlar bunun hastalıkları gidereceğine inanır ve cinlerin yardımı ile yapıldığını söylerlerdi.» İbni Esir diyor ki: «Hadislerin bazısında hasta okumanın caiz olduğu diğer bazılarında ise; bundan nehyedildiği görülmektedir; ve her iki hususa aid bir çok hadisler vardır. Bunların araları şöyle bulunur: mekruh olan okuma Arapçadan başka bir lisanla ve Allah Teâlâ'nın isimlerini, sıfatlarını, semadan indirdiği kitaplarındaki kelâmını zikretmeksizin yapılacak okumanın mutlaka fayda vereceğine i'tikad ve itimad edilendir. Resulullâh (Sallallahu Aleyhi ve Sellem)'in : «Okunan kimse tevekkül etmiş sayılmaz.» buyurmasının mânası da budur. Ama Kur'an-ı Kerim ve esmâ-ı ilâhiyeyi okumak suretiyle yapılan rukye mekruh değildir...» «Hem onlarla birlikte cennete hesapsız, azapsız girecek yetmiş bin kişi (daha) var...» ifadesinden murad şüphesiz ki yine Nebi (Sallallahu Aleyhi ve Sellem)'in ümmetidir. Yalnız cümlenin takdiri hususunda iki ihtimal vardır. 1- Bu yetmişbin kişi ufukta gösterilenlerden başkadır. 2- Yetmişbin kişi ona gösterilenler cümlesindendir. Nitekim Buhârî'nin rivayeti de bu ihtimali teyid etmektedir. Hadis-i şerif : Şer'-i bir delilin üzerinde münazara ve münakaşa yapmanın mubah olduğuna; delildir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 434
			}
		}
	]
}