{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5291,
			"arabicnumber": "2029.03",
			"text": "(Bize Abdullah b. Mesleme b. Ka'neb de rivâyet etti. Lâfız onundur. ki): Bize Süleyman (yani İbn-i Bilâl) Abdullah b. Abdirrahman’dan rivâyet etti. O da Enes b. Mâlik'i rivâyet ederken dinlemiş. Enes şunu söylemiş: Bize Resûlüllah (sallallahü aleyhi ve sellem) evimize geldi. Az sonra su istedi. Biz de onun için bir koyun sağdık. Sonra o süte şu kuyunun suyundan kattım da Resûlüllah (sallallahü aleyhi ve sellem)’e verdim. Resûlüllah (sallallahü aleyhi ve sellem) (sütü) İçti. Ebû Bekr solunda, Ömer karşısında, bir bedevi de sağında bulunuyordu. Resûlüllah (sallallahü aleyhi ve sellem) içmesini bitirdikten sonra, Ömer kendisine Ebû Bekr'i göstererek: İşte Ebû Bekr ya Resûlüllah! dedi. Fakat Resûlüallah (sallallahü aleyhi ve sellem) bedeviye verdi. Ebû Bekr'le Ömer'i bıraktı. Ve Resûlüllah (sallallahü aleyhi ve sellem) sağdakıler, sağ da kiler!» buyurdu. «Şu halde bu sünnettir; şu halde bu sünnettir; şu halde bu sünnettir!» demiş. hadîsi Buhârî «Hibe» bahsinde tahrîc etmiştir. bedevinin Hâlid b. Velid (radıyallahü anh) olduğu söylenir. Fakat Aynî bunu kabul etmek istememiştir. Hadîsin gerek «eymen» şeklinde müfred, gerekse «eymenûn» şeklinde cem' olarak rivâyet edilen cümleleri mansub ve merfu' şekillerde rivâyet olunmuştur. Mansûb okunduğuna göre cümle: «Sağdakine ver...» Merfu' okunduğuna göre: «Sağdaki daha lâyıktır...» diye takdir olunur. Ve her iki vecihle sahihtir. Fakat «El-Eymenûn» şeklindeki cem' rivâyeti müfred rivâyetinin de merfu' okunmasını tercih ettirir. Enes'in annelerinden murad hakikî annesi Ümmü Suleym ile teyzesi Ümmü Hıram ve diğer yakınlarıdır. Ömer'in Resûlüllah (sallallahü aleyhi ve sellem)'e seslenerek «îşte Ebû Bekr» demesi unutulacağından endişe ederek onu hatırlatmak, Resûlüllah (sallallahü aleyhi ve sellem)'in sağında oturan bedeviye de Ebû Bekr'in büyüklüğünü bildirmek içindir. Süte su katmanın hikmeti onu hafifletmek veya soğutmak yahut bütün cemaata yetsin diye çoğaltmaktır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 165
			}
		}
	]
}