{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5312,
			"arabicnumber": "2037",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Yezid b. Harun rivâyet etti. ki): Bize Hammad b. Seleme, Sâbit'den, o da Enes'den naklen haber verdi ki, Resûlüllah (sallallahü aleyhi ve sellem)’in îranlı bir komşusu güzel çorba yaparmış. Resûlüllah (sallallahü aleyhi ve sellem)'e de yapmış. Sonra onu davete gelmiş. Peygamber (sallallahü aleyhi ve sellem) Âişe için: da davet ediyor musun?» demiş. Komşusu: Hayır! cevâbını vermiş. Onun üzerine Resûlüllah (sallallahü aleyhi ve sellem): (Gidemem!)» cevabını vermiş. tekrar davete gelmiş. Resûlüllah (sallallahü aleyhi ve sellem) (yine): da davet ediyor musun?» diye sormuş. O zât: Hayır! cevâbını vermiş. Resûlüllah (sallallahü aleyhi ve sellem): «Hayır! (Gidemem!)» demiş. tekrar dönerek onu davet etmiş. Resûlüllah (sallallahü aleyhi ve sellem) (yine): da davet ediyor musun?» diye sormuş. Komşusu üçüncüde: — Evet! cevâbını vermiş. Bunun üzerine kalkarak peşpeşe yürümüşler ve komşunun evine varmışlar, diyor ki: «Bu hadîs ortada bir özür bulunup davete icabetin vücûbuna mâni olduğuna hamledilir. Bu sebeple Peygamber (sallallahü aleyhi ve sellem) icabet edip etmemekte muhayyer bulunuyordu. O da iki caizden birini seçti. Hazret-i Âişe'ye de izin verilmezse davete gitmeyecekti. Zira Hazret-i Âişe'de açlık veya benzeri bir şey vardı. Bundan dolayı Resûlüllah (sallallahü aleyhi ve sellem) onsuz yemeğe gitmeyi kabul etmedi. Bu adâb-ı muaşeretten, arkadaşlık hukukundan ve beraber düşüp kalkma adabından ma'duddur. Komşusu Hazret-i Âişe'nin gelmesine izin verince Peygamber (sallallahü aleyhi ve sellem) kendisi için caiz olan ikinci şıkkı seçmiştir. Çünkü maslahat yenilenmiştir. Bu da zevcesi için arzu ettiği ikramın husul bulmasıdır...» bahsinde ulemanın davete icabetin hükmü hususunda ihtilâf ettiklerini, davete gitmemek için ne gibi şeylerin, özür sayılacağını görmüştük. «İranlı zâtın Hazret-i Âişe'yi davet etmemesi, ihtimal yemeği az olduğu içindir» demişlerdir. Hadîs-i şerif çorba ve diğer mubah yemeklerin yenilmesi caiz olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 186
			}
		}
	]
}