{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5315,
			"arabicnumber": "2039",
			"text": "(Bana Haccâc b. Şâir rivâyet etti. ki): Bana Dah-hâk b. Mahled bir kâğıttan —ki onunla evvelâ bana çatmış, sonra onu bana okumuştur— rivâyet etti. ki): Bize bunu Hanzala b. Ebî Süfyân haber verdi. ki): Bize Saîd b. Mînâ' rivâyet etti. ki): Câbir b. Abdillah'ı şunu söylerken işittim: kazıldığı vakit Resûlüllah (sallallahü aleyhi ve sellem)’de açlık gördüm. Hemen karıma dönerek ona Sende bir şey var mı? Çünkü ben Resûlüllah (sallallahü aleyhi ve sellem) de şiddetli açlık gördüm, dedim. Bana içinde bir Ölçek arpa bulunan bir dağarcık çıkardı. Evimizde beslediğimiz bir de kuzucuğumuz vardı. Ben onu kestim. Kadın da arpayı öğüttü. Ve benimle beraber o da işini bitirdi. Kuzuyu onun çömleğine parçaladım. Sonra Resûlüllah (sallallahü aleyhi ve sellem)'e döndüm. Kadın: Beni Resûlüllah (sallallahü aleyhi ve sellem)'le beraberindekilere karşı rezil etme! dedi. Ben Resûlüllah (sallallahü aleyhi ve sellem)'e gelerek (vaziyeti) gizlice kendisine söyledim. Ve: Ya Resûlallah! Biz bir kuzucuğumuzu kestik. Kaduı fla evimizde bulunan bir ölçek arpayı öğüttü. İmdi sen beraberinde biirkaç kişiyle beraber gel! dedim. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) seslendi. Ve: hendek ahalisi! Câbir sizin için davet tertib etmiş. Hemen buyrun!» dedi. (Bana da): gelinceye kadar sakın çömleğinizi ateşten indirmeyin! Hamurunuzdan da ekmek yapmayın!» buyurdular. (Eve) geldim. Resûlüllah (sallallahü aleyhi ve sellem) de cemaatın önünde geldiler. Kanının yanına vardım: Seni gidi seni! dedi. Ben de: Bana söylediğini yaptım, dedim. Peygamber (sallallahü aleyhi ve sellem)'e hamurumuzu çıkardı, ona tükürdü ve bereketlendirdi. Sonra çömleğimize giderek onun da içine tültürdü ve bereketlendirdi. Sonra (Kadına): ekmekçi çağır da seninle beraber ekmek yapsın! Çömleğinizden de kepçeyle al, onu (ateşten) indirmeyin!» buyurdu. Ordu bin kişi idi. Allah'a yemin ederim! Bir güzel yediler hattâ (doyarak) onu bırakıp gittiler. Çömleğimiz de olduğu gibi fıkırdıyordu. Hamurumuz dahi —yahut Dahhak’ın dediği gibi— ekmek yapılıyor (fakat) olduğu gibi duruyordu. hadîsi Buhârî «Kitâbu’l-Meğâzi» ile «Kitâbu'l-Cihad»'da tahric etmiştir. Hendek Harbini yerinde görmüştük. Burada da hülâsa olarak deriz ki: Bu harb kıtlık senesinde olmuştu. Müşrikler Ebû Süfyân’ın kumandasında dört bin kişilik bir ordu ile Medîne'ye gelmişlerdi. Müslümanlarsa bin kişiden ibaret idiler. Açlık ve yokluk sebebiyle Medine'nin harice açık bulunan yerine hendek kazarak müdafaa harbine karar vermişlerdi. Bu davet işi hendeğin kazıldığı zamana tesadüf etmiştir. Açlıktan karnın içeriye çekilmesidir. Ashâb-ı kirâm'la Resûlüllah (sallallahü aleyhi ve sellem)'in bu harbde açlıktan karınlarına taş bağladıkları rivâyet olunur. Davet yemeğidir. Mutlak yemek olduğunu söyleyenler de vardır. Bu kelime fârisidir. Birçok sahih hadislerden anlaşıldığına göre Peygamber (sallallahü aleyhi ve sellem) Arabça olmayan bazı sözler söylemiştir. Bu da onun cevazına delâlet eder. Resûlüllah (sallallahü aleyhi ve sellem)'in bu davete ordunun önünde gelmesi ashabı kendisi davet ettiği içindir. Burada kendisi davet sahibi makamındadir. Yoksa başka zamanlarda ordusunun Önünde gitmez; kimsenin ökçelerine basınasına sebebiyet vermezdi. Hazret-i Câbir'in hanımının ismi Süheyle binti Mes'ud olup, Resûlü Ekrem (sallallahü aleyhi ve sellem)'e bey'at eden ensardandır. kadının Câbir'e: «Bike ve fıike» sözü onu zemmetmekten kinayedir. Bâzılarına göre bundan murad: \"Başına kepazelik gelsin: Zem olunasın.» demektir. Bunun mânâsı ; «Bu senin reyinle ve tedbirsizliğinle oldu.» demektir, mütalâasında bulunanlar da vardır. Biz bu makamda: «Seni gidi seni» deriz",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 189
			}
		}
	]
}