{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 533,
			"arabicnumber": "222.02",
			"text": "Bize Ebu Bekr b. Ebi Şeybe tahdis etti. Bize Veki\" tahdis etti. (H) Bize Ebu Kureyb de tahdis etti. Bize Ebu Muaviye tahdis etti. Her ikisi A'meş'ten bu isnad ile hadisi rivayet ettiler. Aneak ikisi de şöyle dedi: \"Sizler o gün insanlar arasında ancak siyah öküzdeki beyaz bir kıl gibi yahut beyaz bir öküzdeki siyah bir kıl gibisiniz\" dediler ve \"yahut eşeğin ön ayağındaki tüysüz daire şeklindeki ben gibisiniz\" ibaresini zikretmediler. Diğer tahric: Buhari, 3348, 6530, 4741, 7483 -muhtasar olarak-; Tuhfetu'I-Eşrın, 4005 DAVUDOĞLU AÇIKLAMA: Bu hadisi Buhari «Kitabu'r-Rikak» ile Ye'cüc Me'cüc kıssasında tahriç etmiştir. Kıyamet gününde Allah Teâlâ Hz. Âdem'e; «Cehennem heyetini çıkar.» diyecek sözünden murad; cehenneme gidecek olanları başkalarından ayırmasını emredecek demektir. Bu işin Adem (A.S.)'a havale buyurulması ya bütün insanların babası olduğu için yahut da onları bildiğinden dir. Âdem (A.S.) Allah Tealanın nidasına kemâl-i nezaket ve edeple cevap verecek ve : «Lebbeyk ve Sa'deyk. (Yâni) : Senin emrine bir değil, iki defa icabet etmeye ve onu tekrar tekrar yerine getirmeğe hazırım; bütün hayır senin yed-i kudretindedir.» diyecektir. Bütün hayır ve şer Allah'ın yed-i kudretinde olduğu halde şerri ona nisbet etmeyerek yalnız hayırı zikretmesi de kemâl-i edep iktizasıdir.. Çünkü şerrin haliki de Allah-ü Zülcelâl isede; Allah şerre razı değil; Fakat hayıra razıdır. Bazıları; Allah'a nispetle hayır ve şer müsavidir. Zira Allah'ın her fiîli güzeldir. Fiillerin bazısının güzel bazısının çirkin ve yasak olması kullara nispetledir demişlerdir. Hadisin buradaki rivayetinde ehl-i cehennemin her bin kişide dokuz yüz doksan dokuz nispetinde olduğu beyan edilmiştir. Başka bir rivayette bu nispetin yüzde doksan dokuz olduğu zikredilmiştir. Bu iki adedin arasındaki fark pek büyük isede maksat adedlerin kendileri değildir. Bu adetler yukarıda da beyan ettiğimiz vecihle çokluktan kinayedirler. Çünkü bir şey'i adetle tahsis etmenin ziyadesini nefiy mânasına gelmiyeceği usul-u Fıkıhta tekarrur etmiş bir kaidedir. Binaenaleyh gerek binde dokuz yüz doksan dokuz gerekse yüzde doksandokuz nispetlerinin ifade ettikleri mâna aynı şey olup cehenneme girecek olan kâfir sayısının çokluğundan mu'min adedinin azlığından ibarettir. «Cehennem heyeti ne kadardır?» cümlesi mukadder bir cümle üzerine atf olunmuştur. Takdiri şöyledir : «Emrin baş üstüne Yarabbi! Ama bunların adedi ne kadardır?» Resulullâh (Sallallahu Aleyhi ve Sellem): «İşte çocuğun ihtiyarladığı, hamilenin çocuğunu düşürdüğü zaman o zamandır.» sözüyle: «Şüphesiz ki, kıyametin zelzelesi pek büyük bir şeydir. Onu gördüğünüz gün her emzikli anne emzirdiği çocuğundan vaz geçecek...» Âyet-i kerimesine işaret buyurmuştur. Ulemâ gerek hadis-i şerifte gerekse âyet-i kerimede zikredilen çocuk düşürme çocuğundan geçme gibi hallerinin ne zaman zuhur edeceği hususunda muhtelif kaviller ileriye sürmüşlerdir. Bazılarına göre; bu hal henüz dünyada iken kıyamet için yer sarsıldığı zaman olacaktır. Çünkü kıyamette çocuk düşürmek sarhoş olmak gibi haller yoktur. Bu kavle göre; âyet'ten murad zahiri manasıdır. Diğer bazılarına göre ise, aynı haller kıyamet­te vuku bulacaktır. Âyetteki çocuk düşürmek: «Kıyametin şiddet ve hevilnâk manzarası insanları o derece korkutacak ki; orada hamile kadınlar bulunduğu tasavvur edilse mutlak korkudan çocuklarını düşürürler.» Nitekim araplar başlarına gelen korkunç bir musibeti ifade için: «Başımıza öyle bir belâ geldi ki çocuğu ihtiyarlatır» derler. Kirmani: «Hadisten murad oradaki korkunç manzarayı temsildir.» diyor. Ashab-ı kiramın kendilerine verilen haberi pek ağır ve şiddetli bularak: «Ya Resulullâh! Acaba kurtulacak olan bu zat hangimiz olacak» diye sormaları bindebir nispetinde az olan kurtulanların her ümmete şamil olduğunu ve her ümmetten yalnız bir kişi kurtulacağını zannetmelerindendir. Resulullah (Sallallahu Aleyhi ve Sellem); «Müjde sîze...» buyurarak maksadının bu olmadığını beyanla cennetliklerin cehennemliklere nispetle az olduğunu anlatmak İstediğini söylemiştir. Ye'cüc ve Me'cüc: Kıyametin büyük alâmetlerinden olmak üzere kıyamete yakın yer yüzüne dağılarak pek büyük fitne ve fesatlar çıkaracak müthiş zulümler ika edecek iki fırkadır. Vehb'ibn Münebbih ile Mukatil b. Süleyman'ın beyalarına göre; bunlar Nuh (A.S.)'ın Yasef ismindeki oğlunun zürriyetidir. Kâ'ba göre ise; Âdem (A.S.)'ın toprağa karışan nutfesinden halk edilmişlerdir. Bu hususta daha başka kavillerde vardır. Tafsilât kelâm kitaplarındadır. Rakme: Merkebin ön bacaklarının iç taraflarında tırnaklara yakın daire şeklinde görülen berelerdir. Allah bilendir",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 439
			}
		}
	]
}