{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5362,
			"arabicnumber": "2055.01",
			"text": "Bize Efaû Bekr b- Ebî Şeybe rivayet etti. (Dediki): Bize Şebâbe b. Sevvâr rivayet etti. (Dediki): Bize Süleyman b. Muğîre Sabitten, o da Abdurrahman b. Ebî Leylâ'dan, o da Mikdad'dan naklen rivayet etti. Mikdâd (şöyle demiş); Ben ve iki arkadaşım yoldan geldik. Açlıktan gözlerimiz, kulaklarımız gitmişti. Kendimizi Resûlullah ($allallahu Aıeyhi ve Sellenı)'in ashabına arzetmeye başladık. Ama onlardan hiç biri bizi kabul etmiyordu. Derken Nebi ($allallahu Aıeyhi ve Sellenı)'e geldik, bizi hanesine götürdü, bîr de baktık üç keçi!.. Nebi ($allallahu Aıeyhi ve Sellenı): «Şu sütü aramızda (paylaşmak üzere) sağın!» buyurdu. Artık sütü sağıyor ve bizden her birimiz nasibini içiyordu. Nebi (Sallallahu Aleyhi ve Sellem)'e de nasibini takdim ediyorduk. O geceleyin gelerek öyle bîr selâm veriyordu ki. uyuyanı uyandırmak, fakat uyanık olana îşîttirirdi. Sonra mescide gelir. Namaz kılar. Sonra sütünün başına gelerek içerdi. Derken bir gece hana şeytan geldi. Tam nasibimi içmiştim. (Dediki): — Muhammed ensâra geliyor, ona hediye veriyorlar, onların yanında hissemend oluyor. Onun bu bir yudum süte ihtiyacı yoktur! Bunun üzerine ben sütün başına gelerek onu içtim. Karnıma yerleştiği ve onu çıkarmaya bir çare olmadığını anladığım vakit şeytan bana pişmanlık verdi. Ve : — Yazık sana! Ne yaptın seni Muhammed'in sütünü nıü içtin? Bir gelir de onu bulamaz ve sana beddua ederse helak olursun, dünyan da, âhirelin de (heba olup) gider, dedi. Üzerimde bir peştemal vardı, onu ayaklarıma koyarsam Başım meydana çıkar; başıma koyarsam ayaklarım meydana çıkardı. Uykum gelmemeye başladı. İki arkadaşım ise uyudular; onlar benim yaptığımı yapmadılar. Derken Nebi (Sallallahu Aleyhi ve Sellem) geıerek eskiden verdiği gibi selâm verdi. Sonra mescide geldi ve namaz kıldı. Sonra sütünün başına gelerek onu açtı. Ama kabın içinde bir şey bulamadı. Bunun üzerine başını semaya kaldırdı. Ben (içimden): Şimdi bana beddua ediyor ve helak oluyorum, dedim, (Halbuki) O: «Allahıml Bana yiyecek verene, sen de yiyecek ver! Su verene, sen de su ver!» dedi. ben peştemala dönerek onu üzerime bağladım. Ve bıçağı alarak keçilerin yanına gittim. Hangisi semiz ise onu Resülullah (Sallallahu Aleyhi ve Sellem)'e kesecektim. Bir de baktım keçinin sütü toplanmış. Baktım hepsinin sütleri toplanmış. Bunun üzerine Muhammed (Sallallahu Aleyhi ve Sellem) ailesinin bîr kabını ele geçirdim. Onun içine süt sağmaya tama' etmezlerdi, İçine sağdım. Hattâ südün üzerine köpük çıktı. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem)'e geldim. «Bu akşam sütünüzü içtiniz mi?» dedi. Ben; — Yâ Resûlallah iç! dedim. İçti, sonra bana verdi. Ben (yine) : — Yâ Resûlallah iç! dedim, içti, sonra bana verdi. Nebi ((Sallallahu Aleyhi ve Sellem)'in kandığını ve duasına nail olduğumu anlayınca güldüm. Hattâ yere düştüm. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): «Bu senin yaramazlıklarından biri (olacak) yâ Mikdad!» dedi. Ben de — Yâ ResûlalIah! Halim şöyle idi, ben de şöyle yaptım, dedim. Nebi (Sallallahu Aleyhi ve Sellem): «Bu Allah'ın rahmetinden başka bir şey değildir. Sen benden izin istesen de arkadaşlarımızı uyandırsak. onlar da bu sütten nasibedâr olsalardı ya!» buyurdu. Ben: — Seni hak dinle gönderen Allah'a yemin olsun ki, ondan sen ve seninle beraber ben de nasibedar olduktan sonra, insanlardan kimin ondan nasibedar olacağına aldırış etmem, dedim",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 236
			}
		}
	]
}