{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5366,
			"arabicnumber": "2057.02",
			"text": "Bana Muhammed b. Müsennâ rivayet etti. (Dediki): Bize Salim b. Nuh EI-Attâr, Cüreyrî'den, o da Ebû Osman'dan, o da Abdurrahman b. Ebî Bekir'den naklen rivayet etti. (Şöyle demiş) : Bize bir takım misafirlerimiz geldi. Babam geceleri Resûlullah (Sallallahu Aleyhi ve Sellem)'le konuşuyordu, hemen geldi ve: — Ey Abdurrahman! Misafirlerine akşam yemeği ver, dedi. Akşamlayınca biz misafirleri ağırlamaya geldik, fakat onlar kabul etmediler. Evimizin babası gelerek bizimle beraber yemedikçe olmaz, dediler. Ben kendilerine : — O hiddetli bir admdır. Eğer siz (dediğimi) yapmazsanız, ondan bana ezâ isabet edeceğinden korkarım, dedim. (Yine) kabul etmediler. Ebû Bekr geldiği vakit onlardan önce hiç bir şeye başlamadı: — Ziyafetinizi bitirdiniz mi? diye sordu : — Hayır! Vallahi bitirmedik, dediler. — Ben Abdurrahman'a emretmedim mi? dedi. Ben ondan (bir tarafa) çekildim. O: — Ey Abdurrahman! dedi. Ben (yine) çekildim. Bunun üzerine: — Ey alçak! Sana yemin ediyorum, sesimi işitirsen mutlaka gel! dedi. Ben de geldim. Ve: — Vallahi benim bir suçum yok! İşte misafirlerin! Onlara sor! Kendilerine yemeklerini getirdim ama onlar sen gelmedikçe yemekten çekindiler, dedim. Bu sefer (onlara) : — Size ne oldu? Bizden yemeğinizi kabul etmiyor musun? diye sordu. Abdurrahman demiş ki: Bunun üzerine Ebû Bekr: — Vallahi bu gece ben bu yemekten tatmam, dedi. Onlar da : — Vallahi sen tatmadıkça, biz de tatmayız, dediler. Ben bu gece gibi kötü bir gece görmedim. Yazık size! Ne oluyorsunuz da bizden yemeğinizi kabul etmiyorsunuz? dedi. Sonra şunu söyledi : — Birinciye gelince o (yâni yemin) şeytandandır. Yemeğinize gelin! Arkacığından yemek getirildi. Ebû Bekr besmele çekerek yedi. Misafirler de yediler. Sabahlayınca Nebi (Sallallahu Aleyhi ve Sellem)'in yanına gitti ve : — Yâ Resûlallah! Onlar yeminlerinde durdu. Ben yeminimi bozdum, dedi. Ve (olanı) ona haber verdi. O da : «Bilâkis sen onların en yemininde duranı ve en hayirlısssın!» buyurdular. Abdurrahman: «Keffâret (verip vermediği) benim kulağıma gelmedi» demiş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 240
			}
		}
	]
}