{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5379,
			"arabicnumber": "2063",
			"text": "(Bana Muhammed b. Râfi' rivâyet etti. ki): Bize İshâk b. îsa rivâyet etti. ki): Bize Mâlik, Süheyl b. Ebî Sâlih'den, o da babasından, o da Ebû Hüreyre'den naklen haber verdi ki, Resûlüllah (sallallahü aleyhi ve sellem) kendisine kâfir bir misafir göndermiş. Ve Resûlüllah (sallallahü aleyhi ve sellem) ona bir koyun sağılmasını emir buyurmuş. Koyun sağılmış, kâfir süt kabını (tamamca) içmiş. Sonra başka bir kab getirilmiş onu da içmiş, sonra başkası getirilmiş onu da içmiş. Ta ki yedi koyunun sütünü içmiş. Sonra sabahladığında müslüman olmuş. Resûlüllah (sallallahü aleyhi ve sellem) onun için (yine) bir koyun sağılmasını emir buyurmuş, fakat onun sütünü tamamıyle içememiş. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) ı bir bağırsağa İçer; kâfir ise yedi bağırsağa içer.» buyurmuşlar. hadisleri Buhârî «Et'ıme» bahsinde; Ebû Hüreyre rivâyetini Nesâî «Velîme»'de; İbn Mâce «Kitâbu'l-Et'ıme»'-de tahrîc etmişlerdir. bu hadîslerden murad ne olduğunda ihtilâf etmişlerdir. Bâzılarına göre maksad darb-î meseldir. Bu darb-ı mesel'de mü'minin dünyaya gönül vermediği, kâfirin ise ona sımsıkı sarıldığı belirtilmektedir. Bazıları: «Burada maksad mü'minin yemeğe besmele ile başlamasıdır. Bundan dolayı şeytan ona ortak olamaz. Kâfir de besmele olmadığı için şeytan onun yemeğine iştirak eder. Bu sebeple çok yer» demişlerdir. Bir takım ulemâ tabiblerin mide ile beraber insanda yedi bağırsak olduğunu söylediklerini; işte aç gözlü kâfir besmele de çekmediği için bunların yedisini de doldurmadan doymadığını; mü'min muktesid olduğu ve besmele çektiği için, ona bir bağırsak dolusu yemeğin kâfi geldiğini söylemişlerdir. umumî değil de bazı mü'rninlerle bazı kâfirler hakkında vârid olması da mümkündür. Bu hususta daha başka sözler de söylenmiştir. rivâyetlerden maksat dünya varlığının azı ile kanâat etmeye teşvik az yemenin güzel ahlâktan ma'dud olduğunu, çok yemenin ise bunun zıddına delâlet ettiğini göstermektir. İbn Ömer Hazretlerinin çok süt İçen misafiri için: «Bu benim yanıma girmemelidir» demesi misafir küffara benzediği içindir. Böylesi ile bir zaruret ve hacet yokken düşüp kalkmak kerih görülmüştür. Bir de böyle bir kişinin içeceği sütle bir cemâatin ihtiyacını görmek mümkündür. Yedî koyunun sütünü içen ve ertesi sabah müslüman olan bu zâtın Sümâme b. Üsa1 olduğu rivâyet edilmiştir. Maamafih Nabra b. Ebi Nadra. Ebû Gazvan ve daha başka isimde biri olduğunu söyleyenler de vardır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 253
			}
		}
	]
}