{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"37": "The Book of Clothes and Adornment"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5509,
			"arabicnumber": "2102.02",
			"text": "(Bana Ebû't-Tâhir de rivâyet etti. ki) ; Bize Abdullah: b. Vehb, İbn Cüreyc'den, o da Ebû'z-Zübeyr’den, o da Câbir b. Abdillah' dan naklen haber verdi. (Şöyle dedi): Mekke'nin fethedildiği gün Ebû Kuhâfe'yi getirdiler, başı ve sakalı seğame çiçeği gibi beyazlı. Resûlüllah (sallallahü aleyhi ve sellem): bir şeyle değiştirin ama siyaha boyamaktan kaçının!» buyurdular. Kuhafe. Hazret-i Ebû Bekr Osmani \"dır. Mekke'nin fethedildiği gün müslüman olmuştur. veya Seğame: Beyaz çiçekli ve beyaz yemişli bir nebattır. Ağaran saçların beyazlığı buna benzetilmiştir. İbn Arabi: tuz gibi bembeyaz olan bir ağaçtır.» demiştir. îyâz diyor ki: \"Sahabe ve tabiinin selefi saç boyamak ve boyanan cinsi hususunda ihtilâf etmişlerdir. Bazıları boyamayı terk etmenin efdal olduğunu söylemiş ve Peygamber (sallallahü aleyhi ve sellem)’den ağaran saçları değiştirmeyi yasak ettiğine dair hadîs rivâyet etmişlerdir. Çünkü Peygamber (sallallahü aleyhi ve sellem) ağaran saçlarını değiştirmemistir. Bu kavil Ömer, Ali, Übeyy (radıyallahü anhüm) ile diğer bazı ashabdan rivâyet olunmuştur. Bir takımları saç boyamanın efdal olduğunu söylemişlerdir. Sahabe ile Tabiinden ve onlardan sonra gelenlerden bir cemâat saçlarını boyamışlardır. Delilleri Müslim'in ve başkalarının rivâyet ettikleri hadislerdir. Sonra bunlar ihtilâf etmişler ve ekserisi saçlarını sarıya boyamışlardır. İbn Ömer, Ebû Hiireyre ve daha başkaları bunlardandır. Bu kavil Hazret-i Ali'den de rivâyet olunur, içlerinden bir cemâat saçlarını kına ve kütüm denilen boya ile, Bazıları zâferanla, bir cemaat da kara boya ile boyamışlardır. Bu Hazret-i Osman'la Hazret-i Ali’nin oğulları Hasan ve Hüseyin'den, Ukbe b. Âmir'den İbn Sîrin'den ve diğer bazı zevattan rivâyet olunmuştur.\" babda Taberânî de şunları söylemiştir: «Doğrusu şudur ki, Peygamber (sallallahü aleyhi ve sellem)'den gerek ağaran saçların boyanması, gerekse bundan nehiy buyurulması Bâbında rivâyet edilen hadîslerin hepsi sahihtir. Bunların arasında tenakuz da yoktur. Boyama emri Ebû Kuhâfe gibi saçları fazla ağaranlaradır. Nehiy ise henüz saçı ağarmaya başlayanlaradır. Selefin boyayı boyamama hususundaki ihtilâfı kendilerinin değişik hallerine göredir. Bununla beraber bu husustaki emir ve nehiy bilicma vucûb için değildir. Bundan dolayıdır ki: Selef bu hususta birbirlerini tenkîd etmemişlerdir. Boyama veya boyamama hususunda nasih ve mensuh bulunduğunu söylemek caiz değildir.» Iyâz'la diğer bazı ulema bu rnes'eleyi iki şekilde hulâsa etmişlerdir:",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 124
			}
		}
	]
}