{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5545,
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Hâlid b. Mâhled, Süleyman b. Bilâl'den, o da Süheyl'den, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): timsâller veya suretler bulunan eve melekler girmez.» buyurdular. Talha hadîsini Buhârî «Bed'ül-Halk» ve «Libâs» bahislerinde, Ebû Dâvud «Libâs»'da; Nesâî «Kitâbu'z-Zine»'de, Hazret-i Âişe rivâyetlerini Buhârî «Libâs», «Büyü'» ve «Nikâh» bahislerinde, İbn Ömer hadîsini Buhârî «Libâs» bahsinde; İbn Mes'ûd hadîsini Buhârî «Libâs» bahsinde, Nesâî «Kitâbu'z-Zine»'de, İbn Abbâs hadîsini Buhârî «Kitâbu'l-Buyû'»da, Nesâî «Kitâbu'z-Zine»'de, Ebû Hüreyre hadîsini Buhârî «Kitâbu’l-Libâs»'da muhtelif râvilerden tahrîc etmişlerdir. ki, bu rivâyetler içinde köpek ve suret bulunan eve meleklerin girmeyeceğini, resim yapmanın memnu olduğunu, canlı resmi yapanların en şiddetli azaba giriftar olacaklarını bildirmektedirler. Köpek hakkında ulemanın sözlerini, meleklerin köpek beslenen haneye niçin girmediklerini ve bu girmeyen meleklerin nev'ini az yukarda gördük. meselesine gelince, bu babda Nevevî şunları söylemektedir: «Bizim ulemâmızla diğer bir takım ulemâ, hayvan resmi yapmanın şiddetle haram olduğunu söylemişlerdir. Hayvan resmi yapmak büyük günahlardandır. Çunku bu hadislerde zikredilen şiddetli cezalar bunun üzerine tertib edilmiştir. Hayvan resmini küçumsenip tahkir edilen bir şey üzerine yapmakla küçumsenmeyen bir şey üzerine yapmak arasında fark yoktur, bunların ikisi de haramdır. Çunkü canlı resmi yapmakta Allah'ın yaratmasına benzeyiş vardır. yapılan resmin elbisede, yaygıda, altın veya gumuş paralarda, kaplarda, duvarda veya başka bir şey üzerinde olması hükmen hep birdir. Jf'aıtat ağaç ve deve semeri gibi içinde canlı sûren olmayan şeylerin resmini yapmak haram değildir. Resim yapmanın hükmü budur. Canlı suretinin yapıldığı şey duvara asılır yanut resim, giyilen elbise ve serpuş gibi küçumsenip hor görülmeyen şeylere yapılırsa haramdır. Yaygı, döşek ve yastık gibi çiğnenip hor görülen şeyler üzerine yapılması haram değildir. hususta gölgesi olan eşya ile gölgesi olmayanların da bir farkı yoktur. Bu mes'elede bizim mezhebimizin hulâsası budur. Sahabe ve Tabiin ile onlardan sonra gelen ulemânın cumhûru da buna kaildirler. Sevrî ile Mâlik, Ebû Hanîfe ve diğer ulemânın mezhebleri dahi budur. Selefden bazıları sadece gölgesi olan şeyleri yapmanın haram olduğunu, gölgesi olmayan resimleri yapmakta beis bulunmadığını söylemişlerdir. Fakat bu mezheb bâtıldır. Çünkü Peygamber (sallallahü aleyhi ve sellem)'in kabul etmediği perdedeki suretin mezmum ve çirkin bir şey olduğunda hiç kimsenin şüphesi yoktur. Halbuki o suretin gölgesi yoktu. Bu babda vârîd olan mutlak hadîslerde bütün suretlere şâmildir.» dahi nehyin umumî olduğunu söylermiş. Resim ister elbisede bir nakış olsun, ister duvara asılmış veya elbiseye yahut yaygıya yapılmış olsun, hakîr sayılsın, sayılmasın hükmün aynı olduğunu söylemiştir. bazıları, resim elbisede bir nakıs olursa tahkir edilsin, edilmesin duvara asılsın, asılmasın caiz olduğunu söylemişler; gölgesi olan heykel gibi şeylerle, duvara yapılan resimleri mekruh görmüşler, bundan yalnız elbisedeki nakşı istisna etmişlerdir. Kasım b. Muhammed'in mezhebi budur. Bunlar gölgesi olan şeylerin memnu' olduğuna ve değiştirilmesi icab ettiğine ittifak etmişlerdir. Kâdî Iyâz bu hususta küçük kız çocuklarının oynadıkları kukla gibi şeylere ruhsat verildiğini söylemiştir. Lâkin İmâm-ı Mâlik bir kimsenin kızına böyle oyuncak almasını kerih görmüştür. Hattâ bazı ulemâ kız çocukları hakkında verilen ruhsatın bu hadîslerle neshedildiğini söylemişlerdir. Âişe'nin rivâyet ettiği kuş resimli Örtü meselesi resim haram kılınmazdan Önceye hamledilmiştir. Resûlüllah (sallallahü aleyhi ve sellem)’in girip çıkarken onu gördüğü halde ses çıkarmaması bundandır. Haram kılınınca onu derhal yırtıp atmıştır. en şiddetli azaba duçar olacaklarını bildiren rivâyet resim ve heykeli tapılmak maksadıyle yapanlara hamledilmiştir. Bittabi başkası tapsın diye heykel yapan kimse kâfirdir. En şiddetli azaba duçar olacaktır. Bazılarına göre şiddetli azab hadisteki mânâyı kasdedenlere yani yaptığı resim ve heykelle kendini Allah'a benzetenleredir. Böyle bir iti-kad sahibi dahi kâfirdir. Küfrünün çirkinliğine göre azabı artar. Fakat yaptığı resim ve heykelden tapma ve benzeme gibi bir şey kasdetmeyen ressam fasık ve büyük günah işlemiş sayılırsa da kâfir olmaz. Ressamlara heykeltraşlara: şeylere can verin!» diye vâki olacak emir usûlü fıkıh ulemâsının erar-i ta'cizi dedikleri nevîdendir. Yani bu emir onları âciz bırakmak için verilecektir. Kur'ân-ı Kerîm'de Teâlâ Hazretlerinin küffâra Kur'ân-ı Kerîm'in on sûresine nazire getirmelerini emir buyurması bu kabildendir. bu hadîsler canlı resmi yapmanın şiddetle haram kılındığına delildirler. taş gibi ruh taşımayan şeylerin resmini yapmak, ahp satmak ise haram değildir. Bu babda ulema müttefikdirler. Yalnız Mücâhid'in meyva veren ağacın resmini mekruh gördüğü rivâyet edilir",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}