{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 558,
			"arabicnumber": "235.04",
			"text": "Bize Abdurrahman b. Bişr el-Abdiy rivayet etti. (Dediki): Bize Behz rivayet etti. (Dedi ki): Bize Vüheyb rivayet etti ve: Bize Amr b. Yahya yukarıkilerin isnadları gibi bir isnadla rivayet etti. diyerek hadisi söyledi. O bu hadiste: «Üç avuçtan mazmaza ve istinşak yaparak burnunu attı» dedi şunu dahi söyledi: «Başınada öne ve arkaya giderek bir defa mesh etti.» Behz: «Bana bu hadisi Vüheyb yazdırdı» demiş Vüheyb de: Bana bu hadisi Amr b. Yahya iki defa yazdırdı demiştir. NEVEVİ ŞERHİ 236.sayfada DAVUDOĞLU AÇIKLAMA: Bu hadisi Buhari «Kitabu'l Vudu'» da ve taharet bâblannın muhtelif beş yerinde Ebu Davud, Tirmizî, Nesaî ve İbni Mâce taharet bahsinde tahriç etmişlerdir. Ravîlerden Abdullah İbnî Zeyd hakkında Süfyan b. Üyene: «Bu zat ezan hadîsini rivayet eden Abdullah b. Zeyd'dir» demişsede bunun hatâ olduğunu birçok hadis hafızları beyan ettiği gibi Buhârî de sahihinin istiskaa bahsinde bunu tasrih etmiştir. Ezan hadisini rivayet eden zatın ismi Abdullah b. Zeyd b. Abdî Rabbih'dir bu zatın ezan hadisinden başka hadis rivayet etmediği söylenir. Hadisin buradaki rivayetinde: «Elini daldırdı» denilmiştir. Buhârî'nin ekseri rivayetlerinde de «el» kelimesi müfred olarak zikredilmişsede bir rivayette «iki elini» denilmiş, hatta İbni Abbas (R.A.) rivayetinde: «Suyu bir eliyle alarak öteki elini de ona kattığı» bildirilmiştir. Nevevî diyor ki: «Bu gösteriyor ki; bunların üçüde caiz ve üçüde'sünnettir. Rivayetlerin araları: «Bu abdestler ayrı ayrı zamanlarda alınmıştır.» Demek suretiyle bulunur. Ulemâmız bu vecihlerin üçünede kail olmuşsada sahih ve meşhur olan ve cumhurunda kat'î şekilde kabul ettikleri kavil; yüzü yıkamak için suyun iki elle alınmasının müstehab olmasıdır. Çünkü bu hem daha kolay, hemde abdesti usuliyle almaya daha muvafıktır. Ulemâmız yüzü üst kısmından başlıyarak yıkamanın müstehab olduğunu söylerler. Çünkü üst kısmı daha şerefli ve suyun bütün yüzü kaplamasına daha müsaittir.» Hadisin muhtelif rivayetlerinden anlaşılıyor ki; Resulullâh (Sallallahu Aleyhi ve Sellem) Abdest azasının bazılarını üç bazısını iki bazılarınıda bir defa yıkamıştır",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 25
			}
		}
	]
}