{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"38": "The Book of Manners and Etiquette"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5611,
			"arabicnumber": "2143.02",
			"text": "(Bize Muhammed b. Râfi' rivâyet etti. ki): Bize Abdürrezzâk rivâyet etti. ki): Bize Ma'mer, Hemmâm b. Münebbih’den naklen haber verdi. Hemmâm: Ebû Hüreyre'nin Resûlüllah (sallallahü aleyhi ve sellem)’den bize rivâyet ettikleri şunlardır, diyerek bir takım hadîsler zikretmiştir. Onlardan biri de şudur. Resûlüllah (sallallahü aleyhi ve sellem): gününde Allahü teâlâ’nın en fazla gadab edeceği en pis ve en kindar adam Melikül-Emlak adını takınan kimsedir. Allah'tan başka Melik yoktur.» buyurdular. hadîsi Buhârî «Kitâbu'l-Edeb»'de tahrîc etmiştir. şerifte ahna', ağyaz ve ahbes tâbirleri kullanılmıştır. Ahna'ı Ebû Amr en alçak diye tefsir etmiştir. Bu Ebû Amr, İshâk b. Mirar'dır ki, meşhur lügat ve nahv âlimidir. Onu Ebû Amr Eşşeybânî ile karıştırmamalıdır. Şeybânî tabiinden olup İmâm Ahmed b. Hanbel doğmazdan evvel vefat etmiştir. Ebû Amr'dan başkalarına göre hadîsin mânâsı kıyâmet gününde en hakîr, en zelil adam Melikül Emlâk adını taşıyan kimsedir. Maksat isim değil, ismin sahibidir. Kâdi Iyâz: «Bu hadîsle isimle müsemmânm bir şey olduğuna istidlal edilir. Bu husustaki hilaf meşhurdur.» diyor. Bâzılarına göre Ahna' en fâcir mânâsına gelir. Ahbes en pis mânâsına olup, burada Ahna' ile aynı mânâya gelir. En çirkin, en yalan demektir. Ahna'a daha başka mânâlar veren de olmuştur. «Ağyaz» Gayz'dan alınmıştır. Gayz intikam almaktan âciz kalan kimsenin gzab ve hiddetidir. Ki Allahü teâlâ hakkında müstehil yani imkânsızdır. Binâenaleyh ya onun şiddete kerih görmesinden kinaye yahut da vereceği cezadan mecaz olur. Ağyaz kelimesinin aynı cümlede iki defa kullanılması Kâdi Iyâz'a göre bazı râvilerin vehminden ileri gelmiştir. Maamafih bu kelimenin «ağnat» olması ihtimâlinden bahsedenler de vardır. Yani bu iki kelimeden biri «ağyaz», diğeri «ağnat»'dır. Ağnat, en şiddetli sıkıntı gören manasınadır. Melik ül-Emlâk bütün mülklerin sahibi mânâsına gelir. Bütün mülklerin sahibi ise Allah'dır. Onun için rivâyetlerin birinde Allah'dan başka Mâlik yoktur, buyurulmuştur. Binâenaleyh doğan çocuğa bu ismi takmak haram olduğu gibi, Allah'a mahsus Rahman, Kuddûs, Müheymin, Halik ve emsali isimleri Şahin Şah, Şahân Şah, Şahântıl-Mülük gibi acem mübalâğası sayılan unvanları takmak da haramdır. Çünkü onların hepsinde kula yakışmayan bir büyüklük vardır. Ebû Saîd-i Hudrî (radıyallahü anh)’den merfû olarak rivâyet edilen bir hadîste: Hakîm ve Ebû'l-Hakem adlarını koymayın; çünkü hakim alîm olan yalnız Allah'dır.» buyurulmuştur",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 26
			}
		}
	]
}