{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 563,
			"arabicnumber": "237.04",
			"text": "Bize Sa'id b. Mansur rivayet etti, (Dediki): Bize Hasan b. İbrahim rivayet etti. (Dediki): Bize Yunus b. Yezid rivayet etti. H: Bana Harmeletü'bnü Yahya dahi rivayet etti, (Dedi ki) : Bize Ebu Vehb haber verdi. (Dedi ki): Bana Yunus, îbni Şihab'dan naklen haber verdi. İbni Şihab : Bana Ebü İdris El Havlani haber verdi ki, Ebu Hureyre ile Ebu. Sa'id-i Hudrîyi Resulullah (Sallallahu Aleyhi ve Sellem) Şöyle buyurmuş diyerek bu hadisin mislini rivayet ederlerken dinlemiş dedi. Diğer tahric: Ebu Hureyre'nin rivayet ettiği hadisin kaynaklan 561 numaralı hadisin kaynaklandır. Ebu Said el-Hudri'nin rivayetini ise yalnızca Müslim rivayet etmiştir; Tuhfetu'l-Eşraf, 4090 ' NEVEVİ ŞERHİ 239.sayfada. DAVUDOĞLU AÇIKLAMA: Bu hadisi Buhari, Nesai ve İbni Mace «Kitabü'l Vudu'» da tahriç etmişlerdir. İsticmar: Taşla taharetlenmek demektir. Su, taş, toprak ve emsali şeylerle taharetlenmeye istinca yahut «istitabe» derler. Rivayete nazaran Abdullah b. Ömer (R.A.) buradaki isticmar'ı buhurdanla kokulamak ma'nasına te'vil edermiş. Bazıları bu ma'naya alındığı takdirde dahi sayı tek olmasını müstehab görmüşlerdir. Kokulanmanın tekliğinden murad ya bir defa kokuyu sürmekle iktifa etmek yahut üç defa sürünmektir. Bu ma'na İmam Malik 'den dahi rivayet olunmüşsa da hadisin asıl zahir ma'nası birinci ma'na yani taşla taharetlenmektir. Taharetlenilecek ufak taşlar birden beşe kadar olabilir. Kirmani: «Tek taharetlenmekten murad taşların sayısı değil taharet yerinin silinmesidir.Yani taharet yeri üç, beş, yahut daha ziyade tek adetle silinecektir.» demiştir. İstinsar: Burundaki pislikleri dışarıya atmak yani sümkürmek. demektir. Ulema bundaki hikmetin burunu temizlemek ve şeytanı kovmak olduğunu söylerler. Çünkü Buhari'nin rivayet ettiği bir hadisde: «Biriniz uykusundan uyandı mı üç defa burnunu atsın, çünkü şeytan genizlerinde geceler.» buyurulmuştur. Şafiî'lerden Nevevî şöyle diyor: «Bizim mezhebe göre üç taştan fazla tek taş kullanmak mustehabdır. Hasıl-ı Mezheb şudur ki, taharet yerini temizlemek farzdır. Üç kere silmek farzdır. Eğer bununla temizlenmek hasıl olursa; ziyadeye lüzum yoktur. Temizlenmezse ziyadeyi kullanmak icap eder, eğer temizlik üçden ziyade tek bir adetle hasıl olursa daha ziyadeye hacet yoktur. Dört veya altı gibi çift adetle temizlik hasıl olursa o adedi tek yapmak için bir taş daha kullanmak müstehab olur. Ulemamızdan bazıları isticmar için mutlak surette tek adedin vacip olduğuna kaildirler. Delilleri bu hadistir. Cumhurun delili «Sünen» kitaplarında tahriç edilen şu hadisdir : Resulullah (Sallallahu Aleyhi ve Sellem): «Her kim taşla taharetlenirse tek bıraksın, bunu yaparsa ne ala, ya­pamayana bir şey yok.» buyurmuşlardır. Onlar bu babın hadislerini farz olarak üç üçten fazlasınında mendup olduğuna hamlederler.» Yine Nevevî bu hadisle istidlal ederek istinsar ile istinşakın başka başka manalara geldiğini söylüyor. Fakat Aynî bu kelimelerin aynı manaya geldiğini bildirmiş ve muhtelif hadislerden misaller göstererek müddeasınr isbat etmiştir. Hadis-i şerif istinşak mutlak surette vaciptir diyenlerin delilidir. «Vacip değildir» diyenler buradaki emri nedip manasına hamletmişlerdir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 30
			}
		}
	]
}