{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 564,
			"arabicnumber": "238",
			"text": "Bana Bişr b. Hakem el-Abdi rivayet etti. (Dedi ki) ; Bize Abdülaziz yani ed-Deraverdi, ibni'I Haddan, o da Muhammed b. İbrahim'den, o da İsa b. Talha'dan, o da Ebu Hureyre'den naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: \"Sizden kim uykudan uyanırsa üç defa (bumuna su alıp) çıkarsın, çünkü şeytan onun burnunun delikleri üzerinde geceler. \" Diğer tahric: Buhari, 3295; Nesai, 90; Tuhfetu'l-Eşraf, 14284 NEVEVİ ŞERHİ 239.sayfada. DAVUDOĞLU AÇIKLAMA: Bu hadisi Bu'hari «Kitabu Bedi'l-Halk» ta Nesaî ayni bahiste tahriç etmiştir. Yerinde de görüldüğü vecihle bazıları istinşak ile istinsarın aynı ma'naya geldiğini söylemişlerdir. Hatta Aynî bu babta bir çok hadisler bulunduğunu söylemiştir. Bazılarıda bunların ayrı ayrı manalara geldiklerini ve istinşak buruna su çekmek istinsar ise; onu burundan atmak manasına geldiğini söylemişlerdir. Bazıları bunların aynı manaya geldiklerini kabul etmekle beraber istinsarın daha şumullu ve daha çok fayda ifade ettiğini söylerler. Çünkü istinsar istinşak'tan ileri gelir. Fakat istinsar'dan istinşak lazım gelmez. Bazanda istinşak yapılırda istinsar terkedilir. Binaenaleyh istinsar istinşakın faydasını tamamlar. Ayni burada da istinsar ile istinşakın aynı ma'naya gelmediklerini söylemekte ve yine hadisle istidlal etmektedir: «Şu halde anlaşılıyor ki bu iki kelime bir çok hadislerde aynı manaya kullanılmış bazı hadislerde de ayrı ayrı manalara delalet etmiştir demek» istiyor. Hayşum; burunun yukarısı yani geniz demektir. Bazıları bu kelimenin bütün burun manasına geldiğini diğer bazıları da burunun yukarısındaki kıkırdak kemikleri demek olduğunu söylemişlerdir. Kaadî İyaz diyor ki: «Resulullah (Sallallahu Aleyhi ve Sellem)'in: «Çünkü şeytan onun genizlerinde geceler.» sözü hakikat manasında kullanılmış olabilir. Çünkü burun cismin kalbe götüren yollarından biridir. Bu husus burunla kulaklardan mada cismin her menfezi kapalıdır. Bir hadiste: «Şeytan kapalı kapıları açamaz.» buyurulmuş ve esnerken ağzın kapanması şeytan girmesin diye emrolunmuştur. Maamafih bu sözün bir istiare olması ihtimalide vardır. Çünkü burnun içersine biriken toz toprak ve pislik şeytana tevafuk eder. Binaenaleyh bunlara istiare yoluyla şeytan denilmiştir. Şafiîlerden «Tarpeşti» : «Edep ve nezaket, bu gibi hadisler hakkında bir şey söylememektir. Çünkü Nebi (Sallallahu Aleyhi ve Sellem)'in sözleri esrar-ı ilahiyyenin hazineleridir. Garip manaları Allah Teala Resulüne tahsis etmiş olmaktan akıl ve idrakin aciz kaldığı hakikatleri ancak ona bildirmiştir.» diyor",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 31
			}
		}
	]
}