{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 565,
			"arabicnumber": "239",
			"text": "Bize İshak b. İbrahim ve Muhammed b. Rafi' tahdis etti. İbn Rafi' dedi ki: Bize Abdurrezzak tahdis etti. Bize İbn Cureyc bildirdi. Bana Ebu'z-Zubeyr'in haber verdiğine göre o Cabir b. Abdullah'ı şöyle derken dinledi: RasılluIlah (Sallallahu aleyhi ve Sellem): \"Biriniz taşla temizlenirse tek sayıda taş kullansın\" buyurdu. Yalnız Müslim rivayet etmiştir; Tuhfetu'l-Eşraf, 2842 NEVEVİ ŞERHİ (559-564 numaralı hadisler): (559) Babta Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Sizden biriniz taşla temizlenirse ... \" buyruğu yer almaktadır. Taşla temizlenmek (isticmar) küçük ve büyük abdest yerini küçük taşlarla silmek demektir. İlim adamları dedi ki: Küçük ve büyük abdest yerini temizlemek için \"istitabe, isticmar ve istinca\" lafızları kullanılır. İsticmar özelolarak taşlarla silmek hakkında kullanılır. İstitabe ve istinca ise su ile de yapılabilir, taş ile de yapılabilir. İsticmarın anlamına dair bizim bu zikrettiğimiz ilim adamı, dilci, muhaddis ve fukahanın birçoğunun dile getirdiği meşhur, sahih olan açıklamadır. Kadı lyaz (rahimehullah) dedi ki: Malik'in de, başkasının da bu hadiste sözkonusu edilen isticmar (taşla temizlenmek)ın anlamı hususundaki görüşleri farklıdır. Böyle denildiği gibi bundan kastedilenin tütsü olduğu ve ondan üç parça alması yahut kokudan üç defa arka arkaya alması olduğu da söylenmiştir. Ancak birincisi daha güçlüdür. Allah en iyi bilendir. Sahih ve bilinen ise bizim az önce yaptığımız açıklamadır. Tek sayıda (vitr) taş kullanmaya gelince, silme sayısının üç, beş (3/125) ya da bundan fazla tek sayıda olması demektir. Bizim mezhebimiz üçten fazla sayılarda tek olmasının müstehap olduğu şeklindedir. Mezhebimizin bu husustaki görüşünden çıkan sonuç şudur: Necaset yerini temizlemek vaciptir, yeri üç defa silmek de vaciptir. Eğer üç silme ile temizlenme gerçekleşiyor ise fazlasına gerek yoktur. Temizlenmezse o takdirde fazla silmek gerekir. Diğer taraftan tek sayıda silme gerçekleşirse fazlasına gerek yoktur. Eğer dört ya da altı gibi çift sayıda silme ile temizlenme hasıl olursa tek yapmak müstehab olur. Bazı mezhep alimlerimiz de şöyle demektedir: Bu hadisin zahiri gereği kayıtsız şartsız olarak tek sayıda silmek vaciptir. Cumhurun delili Sünenlerde yer alan sahih hadistir. Resulullah (Sallallahu aleyhi ve Sellem) şöyle buyurdu: \"Taş ile temizlenen tek sayıda temizlensin. Kim böyle yaparsa güzel yapmış olur. Yapmazsa da vebal yoktur. \" Bu görüşte olanlar baptaki hadisi üç silme hakkında yorumlarlar, fazlasının da mendub olduğunu söylerler. Allah en iyi bilendir. \"Burnuna su alsın sonra ... \" buyruğunda, istinsarın istinşaktan farklı olup, istinsarın istinşaktan sonra suyu burundaki sümük ve benzeri başka şeylerle dışarı çıkarmak olduğuna dair açık bir delalet bulunmaktadır. Bu husus da daha önce sözkonusu edilmişti. Ayrıca hadiste istinşakın -emir mutlak olduğundan dolayı- vacip olduğunu söyleyenlerin görüşlerine de delil vardır. Bunun vacip olmadığını söyleyenler ise emri mendubluk olarak yorumlamış- . lardır. Buna delil ise gerçekten emredilen husus olan istinsarın (burna aldığı suyu çıkarmanın) ittifakla vacip olmadığıdır. Eğer: Diğer rivayette: ''l\\bdest aldığı zaman sudan bir miktar burnunun içine çeksin sonra dışarı çıkarsın (istinsar yapsın)\" buyurulmuş olup, bunda da vücuba dair açık bir delalet vardır denilecek olursa, (şöyle cevap verilir:) Ama bunun mendubluğa Hamnedilmesi ihtimali de vardır. Böylelikle bu hadis ile müstehap oluşuna delalet eden deliller bir arada telif edilerek anlaşılmış olur. Allah en iyi bilendir .. (560) Hemmam yoluyla gelen hadiste \"çeşitli hadisler zikretti, onlardan biri de ... \" ibaresine gelince, defalarca bu ibaredeki faydayı açıklamış bulunmaktayız. Aradan uzun bir süre geçtiğinden ötürü iyice hatırlanması için ona dikkat çekmekteyiz. (563) \"İstinsar yapsın, çünkü şeytan burun delikleri üzerinde geceler.\" İlim adamları der ki: Hayşum, burnun üst tarafıdır. (3/126) Burnun tamamı olduğu söylendiği gibi, burnun dibinde burun ile dimağ (beyin) arasında ince ve yumuşak kemikler olduğu da söylenmiş, başka açıklamalar da yapılmıştır. Anlam itibariyle birbirine yakın farklı açıklamalardır. Kadı İyaz (rahimehullah) der ki: Nebi (Sallallahu aleyhi ve Sellem)'in: \"Çünkü şeytan onun burun delikleri üzerinde geceler\" buyruğunun gerçek anlamı ile söylenmiş olma ihtimali vardır; çünkü burun kendisinden kalbe ulaşılan bedenin giriş yerlerinden birisidir. Özellikle de ondan ve kulaklardan başka bedenin giriş yerleri arasında açık bulunan başka yeryoktur. Hadis-i şerifte: \"Şeytan kapalı bir yeri açmaz\" denilmektedir. Esnemek hakkında da şeytanın o esnada ağzın içine girmesinden ötürü kişinin kendisini tutması emredilmiştir. Bununla birlikte bu buyruğun istiare yoluyla kullanılmış olması ihtimali de vardır; çünkü burun deliklerinde sertleşen toz ve nem şeytana uygun bir pisliktir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 32
			}
		}
	]
}