{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5715,
			"arabicnumber": "2192.02",
			"text": "Bana Ebû't-Tahir ile Harmele dahi rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus haber verdi. H. Abd b. Humeyd de rivâyet etti. ki): Bize Abdürrezzak haber verdi. ki): Bize Ma'mer haber verdi. H. Muhammed b. Abdillah b. Nümeyr dahî rivâyet etti. ki): Bize Ravh rivâyet etti. H. Ukbe b. Mükrem ile Ahmed b. Osman En-Nevfeli de rivâyet ettiler. (Dediler ki): Bize Ebû Âsim rivâyet etti. Her iki râvi İbn Cüreye'den rivâyet etmişlerdir. ki): Bana Ziyad haber verdi. Bu râvilerin hepsi İbn Şihab'dan Mâlik'in isnadı ile onun hadîsi gibi rivâyette bulunmuşlardır. Mâlik'in hadîsinden başka hiç birinin hadîsinde «Bereketini umarak» kaydı yoktur. Yûnus ile Ziyâd’ın hadîsinde «Peygamber (sallallahü aleyhi ve sellem) hastalandığı vakit kendine muavvizâtı okuyarak üfürür ve eliyle kendini meshederdi.» cümlesi vardır. hadîsi Buhârî «Fedâilül-Kur'ân» bahsinde; Ebû Dâvud ile İbn Mâce «Kitâbü't-Tıb»'da; Nesâî «Tıb», «Tefsir» ve «Kitâbü'l-Yevmi ve'l-Leyle»'de muhtelif râvilerden tahrîc etmişlerdir. Tükürüksüz hafif üfürüktür. Hadis-i şerîf hastaya okurken üfürmenin müstehab olduğuna delildir. Ulemâ bunun caiz olduğuna ittifak etmişlerdir. Sahabe tabiîn ve-onlar dan sonra gelen ulemâ bunu hep müstehab görmüşlerdir. Fakat Kâdî Iyâz ulemâdan bir cemaatın bunu kabul etmediklerini hastaya okurken tükürüksüz üfürmenin caiz olduğunu söylediklerini rivâyet etmiştir. Bu mezheb ve bu lark ancak zayıf bir kavle ibtinâ eder. Zira nefes: Tükürüklü üfürüktür, diyenler olmuştur. Yine Kaâdî'nin beyânına göre ulemâ nefes ile tefel kelimelerinin mânâlarında ihtilâf etmişlerdir. Bazıları: «Bunların ikisi de bir mânâya gelir. Ve ikisi de tükürüklü üfürüktür.» demiş. Ebû Ubeyd tefel-de azıcık tükürük şart olduğunu, nefeste ise hiç tükürük bulunmadığını söylemiştir. Bunun aksini iddia edenler de vardır. Ebû Ubeyd: «Ben Âişe'ye, Peygamber (sallallahü aleyhi ve sellem)’in hasta okurken nasıl üfürdüğünü sordum da: Kuru üzüm yiyen gibi tükürüksüz üfürürdü, cevâbını verdi.» demiştir. Kâdî Iyâz Tefel denilen ıslak üfürüğün faydası bu rutubet ve heva ile teberrüktür, diyor. Mâlik kendine okursa üfürürmüş. Demirle, tuzla rukye yapmayı ve keza hatem-i Süleyman şeklinde yazmayı şiddetle kerih görürmüş. Zîra bunda sihre benzerlik vardır. şerîf Kur'ân ve zikirlerle rukye yapmanın müstehab olduğuna delildir. Muavvizâtdan murad ihlâs ile ondan sonra gelen Felâk ve Nâs sûreleridir. Peygamber (sallallahü aleyhi ve sellem)’in bunları okuması her kötülükten Allah'a sığınmayı tazammun ettikleri içindir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 69
			}
		}
	]
}