{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5741,
			"arabicnumber": "2204",
			"text": "Bize Harun b. Ma'ruf ile Ebû't-Tâhir ve Ahmed b. İsa rivâyet ettiler. (Dediler ki): Bize İbni Vehb rivâyet etti. ki): Bana Amr (bu zat İbn Hâris'dir.) Abdü Rabbih b. Saîd'den, o da Ebû'z Zübeyr'den, o da Câbir'den, o da Resûlüllah (sallallahü aleyhi ve sellem)'den naklen haber verdi ki: derdin bir devası vardır. Derdin devasına rastlanırsa Allah (Azze ve Celte)'nin izniyle düzelir.» buyurmuşlar. hadîste hastalığa karşı İlâç kullanmasının müstehab olduğuna işaret vardır. Cumhûr ulemânın mezhebi de budur. Iyâz diyor ki: «Bu hadîslerde din ve dünya ilimlerinden cümleler ve tıb ilminin sahîh olduğu, ilaçlanmanın cevazı ve bu hadîslerde de bildirilen şeylerle ilaçlanmanın müstehab oluşu görülüyor, Yine bu hadîslerde tedaviyi inkâr eden Gulât-ı sofiyye'ye fed cevabı vardır. Bunlar her şey Allah'ın kaza ve kaderiyledir, Binâenaleyh tedaviye hacet yoktur, derler. Ulemânın hücceti bu hadîslerdir. Onlar yaratanın Allah olduğuna itikad ederler. Ama tedavinin de Allah'ın kaderinden sayıldığına inanırlar. Bu mesele duâ, kâfirlerle harb, korunmak ve göre göre tehlikeye atılmaktan sakınmak hususundaki emirlere benzer. Halbuki ecel değişmez. Mukadderat mutlaka vuku bulur.» de şunları söylemiştir: «Müslim bu çok hadîsleri tıb ve ilâç bahsinde zikretmiştir. Kalbinde maraz olan kimseler bunların bâzısına itiraz etmiş ve şöyle dedilerdir: Doktorlar balın müshil olduğuna ittifak ediyorlar. O halde kendisinde ishal bulunan kimseye ne demeli! Yine doktorlar hummalı kimsenin soğuk su kullanmasının helâka yakın tehlikeli olduğuna ittifak ediyorlar. Çünkü soğuk su mesameleri bir araya toplar, Buhârî içeri tıkar ve harareti cismin içerisine çevirir. Böylece telefe sebep olur. Bunlar Zatü’l-Cenp hastalığının Kust denilen otla tedavi edileceğini de İnkâr eder ve tehlikeli görürler. Halbuki, bu otta şiddetli hararet vardır...» Mâzirî bu itirazların yersiz olduğunu beyandan sonra hadîslerin şerhine geçiyor ve sadedinde bulunduğumuz hadîsi şöyle izah ediyor: «Bu hadîste açık izahat vardır. Zira malûmdur ki doktorlar: Hastalık cismin tabiî mecrasından çıkmasıdır; tedavi ise cismi tabiî mecrasına iadedir, derler. Hıfzıssıhha cismin tabiî mecrasında kalmasıdır. O halde sıhhati korumak, yiyecekleri ve sâireyi isîâh ile cismi tabiî mecrasına döndürmek de hastalığa zıt olan muvafık ilâçlarla olur. Bukrat eşya zıtlarıyla tedavi edilir, demiştir. Lâkin bazan hastalığın ha-kîkatı ile ilâcın hakîkatı ince ve karışık olur da hastalığa zıt ilâca itimad azalır. Doktorun hatası da buradan ileri gelir. Bazan ilâcın hararetli maddeden olduğunu sanır. Halbuki ilâç başka maddedendir. Yahut ilâcın soğuk maddeden olacağını sanır. Halbuki değildir. Bundan dolayı şifâ hâsıl olmaz. îşte Peygamber (sallallahü aleyhi ve sellem) hadîsin sonunda: Derdin devasına rastlanırsa düzelir... sözüyle hadîsin başındaki beyanâtına edilebilecek itiraza tenzib buyurmuştur. Şayet: Ya Resûlallah! Sen her derdin devası vardır, dedin ama biz, birçok hastaların tedavi gördükleri halde düzelmediklerini görüyoruz, denilirse, O da: Bu ancak tedavinin hakikati bilinmediği içindir. Yoksa ilâç bulunmadığı için değil» şeklinde cevap vermiş gibidir.»",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 95
			}
		}
	]
}