{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 575,
			"arabicnumber": "242.03",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Cerir, Süheyl'den, o da babasından, o da Ebu Hureyre'den naklen rivayet etti. Ebu Hureyre dedi ki: Resulullah (Sallallahu aleyhi ve Sellem): ''Ayak ökçelerinin ateşten vay haline!\" buyurdu. Yalnız Müslim rivayet etmiştir; Tuhfetu'I-Eşraf, 12602 DAVUDOĞLU ŞERHİ AŞAĞIDA NEVEVİ ŞERHİ (565-574 numaralı hadisler): Bu başlıkta (569) \"ateşten dolayı ayak ökçelerinin vay haline ... \" (3/127) buyurulmaktadır. Müslim (yüce Allah'ın rahmeti onaj'in bu hadisi burada zikretmekten maksadı, ayakları yıkamanın vacip (farz) olduğuna ve ayakları mesh etmenin yeterli olmadığına delil göstermektir. Bu mesele hakkında insanlar farklı görüşlere sahiptirler. Çeşitli dönemlerde ve çeşitli bölgelerde fetvaya ehil olan fukahadan bir topluluğun kan aatine göre, farz olan topuklarla birlikte ayakları yıkamaktır. Onları mesh etmek yeterli değildir. Yıkamakla birlikte de mesh ise vacip (farz) değildir. İcma konusunda kendisine itibar olunan hiçbir kimseden bu hususta farklı herhangi bir kanaat sabit olmamıştır. Şia ise, farz olan ayakların mesh edilmesidir, demişlerdir. Muhammed b. Cerir ile çağında Mutezile'nin başı olan Cubbaı (abdest alan) mesh etmek ile yıkamaktan birisini yapmakta muhayyerdir, demişlerdir. Bazı zahiri mezhebi mensupları da meshi ve yıkamayı birlikte yapmak icab eder, demişlerdir. Pek büyük çoğunluğa muhalefet eden bu kimseler ise, delaleti açık olmayan delillere sarılmışlardır. Ben bu meselenin kitap ve sünnetten delilleri ile bunların tanıklarının muhaliflerin delil diye ileri sürdüklerine verilecek cevabı el-Mühezzeb Şerhinde oldukça güzel ve en geniş ibareler ile açıklamış bulunmaktayım. Öyle ki bu husustaki kanaatimize muhalif olan bir kimsenin birkaç bakımdan doğru bir şekilde cevabı verilmedik tek bir şüphesi dahi kalmamaktadır. Burada maksadımız ise hadislerin metinlerini ve lafızlarını delilleri ve muhaliflere verilecek cevapları geniş bir şekilde açıklama yoluna gitmeden Şerh etmektir. Bu hususta söyleyeceğimiz en özlü ifade de şudur: Çeşitli durumlarda ve pek çok nitelikte Resulullah (Sallallahu aleyhi ve Sellem)'in abdest alışını anlatanların tamamı ayakların yıkandığını ittifakla belirtmişlerdir. ':4yak ökçelerinin ateşten vay haline\" buyruğu ile Allah Resulü abdestsiz kaldıklarından ötürü ökçeleri cehennem ateşiyle tehdit etmektedir. Eğer mesh etmek yeterli olsaydı ökçelerini yıkamayan kimseleri asla tehdit etmezdi. Diğer taraftan Amr b. Şuayb'ın babasından, onun dedesinden sahih olarak rivayet ettiği hadise göre bir adam: Ey Allah'ın Resulü, abdest nasıl alınır, diye sorunca, Allah Resulü su getirilmesini istemiş ve ellerini üç defa yıkamışt!. .. Nihayet: Sonra da ayaklarını üç defa yıkadı, dedi, arkasından: \"İşte abdest almak böyle olur. Kim bundan fazlasını yapar ya da eksiltirse kötü yapmış ve zulmetmiş olur\" buyurdu. Bu, Ebu Davud ve başkalarının kendi sahih senetleriyle tahriç ettikleri sahih bir hadistir. Allah en iyi bilendir. (565) \"Şeddad'ın azatlısı Salim'den\" diğer rivayette (566) \"Şeddad b. el-Had' m azatlısı Ebu Abdullah\" üçüncü (567) rivayette \"el-Mehrl'nin azatlısı Salim\" şeklindeki ibarelere gelince, bütün bunlar onun nitelikleridir. O tek bir şahıstır. Adı da Şeddad b. el-Had'ın azatlısı Salim, el-Mehri'nin azatlısı Salim, Salib BadCıs, Malik b. Evs b. el-Hadesan en-Nasri'nin azatlısı Salim, Salim Senban, Salim el-Berrad, Basralıların azatlısı Salim, Salim Ebu Abdullah elMedinı, Salim b. Abdullah, Şeddad b. el-Had'ın azatlısı Ebu Ubeydullah'tır. Evet, bütün bunlar onun kullanılan isimleridir. Ebu Hatim dedi ki: Salim Müslümanların hayırlılarındandl. Ata b. es-Saib dedi ki: Bana Salim el-Berrad tahdis etti ki, ben ona kendimden daha çok güvenirdim. (568) \"Bana Seleme b. Şebib tahdis etti. .. İbn Şeddad'ın azatlısı Salim'den\" Evet, asıl yazmalarda İbn Şeddad'ın azatlısı diye kaydedilmiştir. Bunun yanlış olduğu doğrusunun ise az önce geçtiği gibi \"ibn\" Iafzının hazfedilmesidir ama zahir olan bunun sahih olduğudur; çünkü Şeddad'ın azat!ısı aynı zamanda oğlunun da azatlısı (mevlası) demektir. (3/129) Eğer gelen sahih rivayetin tevili mümkün ise onu iptal etmek caiz değildir. Özellikle de hakkında (adı ile ilgili) bu kadar türlü görüşlerin bulunduğu böyle bir kişi için bu böyledir. Allah en iyi bilendir. (567) \"Bize İkrime b. Ammar tahdis etti. .. Bize el-Mehri'nin azatlısı Salim tahdis etti.\" Bu birbirinden rivayet nakleden tabiinden dört kişinin bir arada bulunduğu bir isnadtır. Salim, Ebu Seleme ve Yahya bilinen tabiin şahıslardır. İkrime b. Ammar da aynı şekilde sahabi olan Hirmas el-Bahill (r.a.)'dan hadis dinlemiş tabiinden bir kimsedir. Ebu Davud'un Süneninde de ondan hadis dinlemiş olduğu açıkça ifade edilmektedir. \"Bana -yahut bize- tahdis etti.\" Bu da ihtiyatın en güzel bir örneğidir. Biraz önce ve daha önceleri benzeri inceliklere dikkat çekilmiş bulunmaktadır. Allah en iyi bilendir. \"Bana Muhammed b. Hatim ve Ebu Ma'n er-RakaŞı tahdis etti.\" Ebu Ma'n'ın adı Zeyd b. Yezid'dir, iman bölÜmünün baş taraflarında bunun açıklaması geçmiş idi. (568) \"Ben Aişe ile birlikte idim.\" Sağlam ravilerin zaptettiği tahkik edilmiş asıl yazmalarda \"ene mea: ben beraberdim\" ile tespit edilmiştir. Pek çok asıl nüshada ve meşrık ve mağrib nüshalarının birçoğunda ise \"ubayiu Aişete: Aişe'ye bey'at ediyordum\" şeklinde mübayaadan gelen bir lafız olarak zikredilmiştir. Kadı İyaz der ki: Doğrusu birincisidir, ikincisinin de açıklanabilir bir tarafı vardır. (569) \"Hilal b. Yesaf, Ebu Yahya'dan\" \"Yesaf\" ye harfi fethalı ve kesreli olarak ve bir de \"İsaf\" şeklinde olmak üzere üç türlü telaffuz edilir. Metali' sahibi der ki: Muhaddisler bu ismi ye harfi kesreli (Yisaf) diye söylerler. Bazıları ise ye harfi fethalıdır (Yesaf) derler. çünkü Arap dilinde başı kesreli ye olan el için kullanılan \"Yisar (sol el)\" dışında bir kelime yoktur. Derim ki: Dilbilginleri nezdinde \"İsaf\" daha meşhurdur. İbnu' s-Sikkit, İbn Kuteybe ve başkaları bunu insanların değiştirip, yanlış telaffuz ettikleri (lahn) lafızlar arasında zikretmişlerdir. Sonra (Metali' sahibi) dedi ki: Onun adı Hilal b. İsaf'tır. Ebu Yahya'ya gelince çoğunluk adının Misda' olduğunu kabul ederler. Yahya b. Main ise: Adı Ziyad /i:.rec el-Muarkab el-Ensari'dir demiştir. Allah en iyi bilendir. (571) \"Bize Ebu Avane, Ebu Bişr'den tahdis etti. O Yusuf b. Mahek'ten\" Ebu Avane'nin adının Vadda' b. Abdullah olduğu daha önce geçmişti. Ebu Bişr'in adı ise Cafer b. Ebi Vahşiye'dir. Mahek ismi ise munsarıf değildir; çünkü Arapça olmayan (Acemi) özel bir isimdir. \"ikindi namazı vakti girmişti.\" Yani namaz kılma zamanı gelmişti. (573) \"Mataradan abdest aldıklarını\" ilim adamları der ki: Kendisi ile taharet alınıp, temizlenilen her bir kaba matara (mithara) denilir. Mithara ve mathara meşhur iki söyleyiştir. Her ikisini de ibnu's-Sikklt zikretmiş olup, mithara diyenler bunu ism-i alet, mathara diyenler de bunu işin yapıldığı yer anlamında (ism-i mekan) kabul ederler demiştir. ''Ateşten dolayı ökçeler üstündeki sinirlerin vay haline!\" Burada geçen \"er-arakib: ökçeler üstündeki sinirler\" kelimesi \"urkub\" lafzının çoğuludur. Bu da ökçenin üzerindeki sinire denir. \"Veyl (vay haline)\" ise onlar helak oldu, hüsrana uğradı, demektir. DAVUDOĞLU AÇIKLAMA: Müslim merhumun bu rivayetleri bir araya toplamasından maksadı abdest alırken ayakları yıkamanın farz olduğuna istidlaldir. Onlara mesh etmek caiz değildir. Bunu mest üzerine meshle karıştırmamalıdır. Onun hükmü ileride gelecektir. Burada mevzu bahis olan mes'ele çıplak ayak üzerine mesh meselesidir ki; bu babta ulemanın ihtilaflarını az yukarıda gördük. Tekrarına lüzum görülürse derizki: Birçok Fıkıh ve Fetva uleması abdest alırken ayakların üzerine mesh etmenin caiz olmadığını; ayakların topuklarla beraber yıkanmasının farz olduğunu söylemişlerdir. Onlara göre; ayakları su ile yıkadıktan sonra üzerlerine birde mesh etmek vacib değildir. Bu hususta icma-i ümmet vardır. Fazla tafsilat için alusî Tefsirine müracaat edilebilir. İmamiyye taifesine göre ayakları mesh etmek farzdır. Fakat bu söz Kur'an'a mütevatir sünnette ve icma-ı ümmete muhaliftir. Mu'tezilenin reisi sayılan Cubbaî ile Muhammed b. Çerir'e göre abdest alan kimse ayaklarını yıkamakla mesh etmek arasında muhayyerdir. Zahirîlerden bazılarına göre; ayakları hem yıkamak hem mesh etmek farzdır. Ancak ehl-i sünnete muhalefet eden bu cemaatin hiç bir delili-itirazdan salim kalmamıştır",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 42
			}
		}
	]
}