{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 576,
			"arabicnumber": "243",
			"text": "Bana Selemetü'bnü Şebîb rivayet etti. (Dediki) : Bize Hasen b. Muhammed b. A'yen rivayet etti. (Dediki) : Bize Ma'kıl, Ebu'z-Zübeyr'den, o da Cabir'den naklen rivayet etti. Cabir şöyle demiş: Bana Ömer b. el-Hattab'ın haber verdiğine göre bir adam abdest aldı, ayağının üstünde bir tırnak kadar bir yeri yıkamadan bıraktı. Nebi (Sallallahu aleyhi ve Sellem) onu görünce: \"Dön de iyice abdest al\" buyurdu. Adam döndü (abdest aldıktan) sonra namaz kıldı. Diğer tahric: İbn Mace, 666; Tuhfetu'l-Eşraf, 10421 NEVEVİ ŞERHİ: \"Bir adam abdest aldı (3/131) sonra namaz kıldı.\" Bu hadisten abdest alırken temizlenmesi gereken yerlerden çok küçük bir kısmı dahi terk edecek olursa, abdestinin sahih olmayacağı anlaşılmaktadır. Bu da üzerinde ittifak olunmuş bir husustur. Ancak ilim adamları teyemmüm alan bir kimsenin yüzünün bir kısmını terk etmesi hakkında farklı kanaatlere sahiptir. Bizim ve cumhurun mezhebine göre abdesti sahih olmadığı gibi, teyemmümü de sahih olmaz. Ebu Hanife' den ise bu hususta üç rivayet gelmiştir. Birincisine göre eğer yarısından azını terk etmiş ise yeterli olur, ikincisine göre eğer bir dirhem miktarından daha azını terk etmişse yeterli olur, üçüncü rivayete göre dörtte birini ve daha azını terk ederse yeterli olur şeklindedir. Cumhur ise kıyası delil göstermek imkanına sahiptir. Allah en iyi bilendir. Bu hadiste, bilmeden abdest organlarından bir kısmını terk eden kimsenin abdestinin sahih olmayacağına delil vardır. Yine bu hadisten bilmeyen kimseye öğretmek ve ona yumuşak davranmak gerektiği de anlaşılmaktadır. Bir topluluk bu hadisi, ayaklar hakkında farz olanın onları mesh etmek değil, yıkamak olduğuna delil göstermişlerdir. Kadı İyaz (rahimehullah) ve başkaları da bu hadisi abdest alırken muvalata (abdest azalarını arka arkaya yıkamaya) da delil göstermişlerdir. Çünkü Nebi (Sallallahu aleyhi ve Sellem): \"Güzel bir şekilde abdest al\" buyurmuş ve yıkamadan bıraktığın yeri yıka buyurmamıştır. Böyle bir delillendirme zayıf yahut batıldır. Çünkü Nebi (Sallallahu aleyhi ve Selleml'in: \"Güzel bir şekilde abdest al\" buyurması tamamlamak anlamına gelme ihtimalini de taşır, yeniden abdest almak ihtimalini de taşır. Hadisin anlamını bunlardan birisi hakkında yorumlamak diğerine göre öncelikli değildir. Allah en iyi bilendir. \"Zufur\"un iki söyleyişi sözkonusudur. En iyileri zı ve fe harflerini ötreli (zufur) diye okumaktır. Kur'an-ı azimuşşan'da da bu şekilde (bk. En'am, 6/146) gelmiştir. Fe harfinin sakin okunarak \"zufr\" denilmesi caiz olduğu gibi, zı kesreli fe sakin olarak \"zıfr\" da her ikisi kesreli \"zifir\" da denilir. Şaz kıraatlerde her iki şekilde de okunmuştur. Çoğulu \"ezfar\" gelir. Çoğulun çoğulu ise \"ezatır\"dir. Aynı zamanda tekilolarak \"uzfur\" da denilir. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Bu hadisi-i şerif abdest alırken yıkanmadık az bir yer bırakan kimsenin abdesti sahîh olmadığına delildir. Mes'ele ulema arasında ittifakidîr. Yalnız teyemmüm eden bir kimsenin yüzünden bir yeri mesh etmeden bırakması ihtilaflıdır. Cumhur-u ulemaya göre; teyemmüm de abdest gibidir. Binaenaleyh o da sahih olmaz. Bu babta Ebu Hanifeden üç kavil rivayet edilmiştir: 1) Teyemmüm ederken yüzün yarısından az bir yer bırakılırsa o teyemmüm sahihtir. 2) Dirhem miktarından az bir yer bırakılırsa teyemmüm sahihtir. 3) Yüzün dörtte birini veya daha azını bırakırsa teyemmüm sahihtir. Yine bu hadisle Ulema cahili rifk-u mülayemetle öğretmek lazım geldiğine ve keza abdest alırken ayakların yıkanması farz olduğuna istidlal etmişlerdir. Kaadî Iyaz abdest alırken muvalaatın yani; her uzvu peşi peşine yıkamanın farz olduğuna bu hadisle istidlal etmişsede Nevevî onun bu istidlalini zaif hatta batıl görmüştür. Çünkü: «Abdestini tertemiz al» emri hem abdesti yeniden almaya hemde o abdesti tamamlamaya ihtimalli bir sözdür. Bu ihtimallerden birini tercih etmek için ortada bir delil yoktur. Fakat Nevevî bu itirazında haksız görülmüştür. Çünkü; hadis abdesti yenilemek manasında kesindir. îmam Ahmedin iyi bir, isnadla rivayet ettiği Halid bin Ma'dan hadisinde; «Resulullah (Sallallahu Aleyhi ve Sellem) Namaz kılan bir adam gördü; ayağının üzerinde dirhem mikdarı su isabet etmemiş bir yer vardı. Resulullah (Sallaîlahu Aleyhi ve Sellem) ona yeniden abdest almasını emir buyurdu.» denilmektedir. Malîkîler bu hadisle istidlal ederek muvalatın farz olduğunu söylemiş, diğer ulema ise; buradaki emri nedb manasına almışlardır. Tırnak manasına gelen zufur; kelimesi zufr ve zıfr şekillerinde de okunabilir. Fakat meşhur kıraeti zufurdur. Netekim kur'an-ı kerîmde de bu kiraet üzere varid olmuştur",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 43
			}
		}
	]
}