{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 577,
			"arabicnumber": "244",
			"text": "Bize Suveyd b. Said Malik b. Enesten rivayet etti. H. Bize Ebu't-Tahir'de rivayet etti. Bu lafız onundur. (Dediki) : Bize Abdullah b. Vehb, Malik b. Enes'ten, o da Süheyl b. Ebi Salih'ten, o da babasından, o da Ebu Hureyre'den naklen haber verdiki: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle demiş: Müslim yahut mu'min bir kul abdest alır da yüzünü yıkarsa, gözleri ile baktığı her günah suyla yahut suyun son damlası ile yüzünden çıkar. Ellerini yıkadığı vakit ellerinin tuttuğu her günah su ile yahut suyun son damlası ile beraber ellerinden çıkar; ayaklarını yıkadığı vakit ayaklarının yürüyerek işlediği her günah su ile yahut suyun son damlasiyle birlikte çıkar. Nihayet o kul günahlardan temiz pak olup çıkar» buyurdular. Resulullah (Sallallahu Aleyhi ve Sellem) «mu'min mi» dedi «müslimmi» ve keza, «suyla birliktemi» yoksa «suyun son damlası» ile, birliktemi» buyurdu bu cihetlerde ravî şek etmiştir. Diğer tahric: Tirmizi, 2; Tuhfetu'l-Eşraf, 12742 NEVEVİ ŞERHİ 245.sayfada DAVUDOĞLU AÇIKLAMA: Hataya'dan murad küçük günahlardır. Bu hususu daha önce görmüştük. Küçük günahların suyla birlikte çıkması Kaadî Iyaz'ın beyanına göre; mecaz ve istiaredir. Bundan murad; onların affedilmesidir. Günahlar cisim olmadıkları için hakikatta onların çıkması tasavvur edilemiyeceğinden cisimlere benzetilmek suretiyle istiare yapılmış ve onlarında çıktıkları beyan buyurulmuştur. Bu hadis «ayakların üzerine mesh farzdır» diyen Rafîzîlere karşı ehl-i sünnetin delilidir. Hadis-i şerifte zikri geçen: «Ellerinin tuttuğu ve ayaklarının yürüdüğü» cümlelerinden murad ellerle ayakların irtikab ettiği günahlardır. İmam-ı Malik'in «El-Muvatta»da ki rivayetinde günahların mazmaza ve istinşak ile hatta kirpikleriyle tırnaklarının altından ve kulaklarından dahi çıktığı beyan buyurulmuştur. Hadisin zahirîne bakılırsa; keffaret ayrı ayrı her abdest azasına mahsus gibi görülüyorsa da sonundaki «Nihayet o kul günahlardan tertemiz pak olup çıkar» buyurulması onun bütün vücuda amin ve şamil olduğunu gösteriyor. Maamafih Keffaretın yinede abdest uzuvlarına mahsus olması, umum vücüde şumülunü ise, ihlas ve huşu gibi karinelerin ifade etmeside mümkündür. Yüzde ağız ve burun gibi uzuvlar da olduğu halde bu hadiste yalnız gözlerin baktığı günahların affedileceği zikredilmesi gözlerin cinayeti-daha büyük olduğu içindir. Büyük cinayet affolununca; küçüğü dahi affolunur. Binaenaleyh gözlerin zikredilmesi affedilecek şeylerin son haddi gibidir. Bazıları bu hadisle istidlal ederek ma-i müsta'mel yani abdestte kullanılmış su ile abdest alınmıyacağını söylemişlerdir. Çünkü bu su günahlarla mülevves olmuştur. Artık onunla bir ibadet olan abdest alınamaz. İmam-ı A'zam'dan rivayete göre müstamel su pistir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 44
			}
		}
	]
}