{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5783,
			"arabicnumber": "2218.12",
			"text": "(Bana bu hadîsi Vehb b. Bakıyye dahi rivâyet etti. ki): Bize Hâlid (yani Tahhân) Şeybânî'den, o da Habîb b. Ebî Sâbit'ten, o da ibrahim b. Sa'd b. Mâlik’den, o da babasından, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen yukarkilerin hadîsi gibi haber verdi. hadîsi Buhârî «Kitâbü'l-Enbiya»'da tahrîc etmiştir. Taun: Vücûdun dirsek, koltuk, el ve parmak gibi yerlerinde çıkan ve şiddetli ağrılara, şişkinliklere sebep olan yaralardır. Yaranın etrafı siyah, yeşil veya menekşe rengi olur. Hastada kalb çarpıntısı ve kusmak gibi araz görünür. Bâzılarına göre taundur. Muhakkak ulemâya göre ise yeryüzünün bir tarafında mûtadın hilâfına zuhur eden pek çok insanların yakalandığı bir hastalıktır. Başka zamanlarda hastalıklar muhtelif olduğu halde vebada yalnız bir nevi olur. Bu zevata göre taunla veba arasında umum ve husus mutlak vardır. Her taun vebadır. Fakat her veba taun değildir. Bu hadîslerde taunun Benî İsrail'e azâb olarak gönderildiği bildirilmektedir. Müslümanlar için ise rahmetdir. Tâun bu ümmet İçin bir rahmet ve şehâdettir. Buhârî ile Müslim'in rivâyet ettikleri bir hadîs de: ölen şehiddir...» denildiği gibi, başka bir hadîste de: bir azâb idi. Allah onu dilediğinin üzerine gönderirdi. Nihayet onu mü'minlere rahmet yaptı. Eğer bir kul tauna tutulur da bulunduğu yerde sabrederek bekler, Allah'ın takdirinden başka kendisine bir şey isabet etmiyeceğini bilirse, o kimseye şehîd ecri kadar sevab verilir.» buyurulmuştur...» diyor. şerifteki riczden murad da azabdır. Râvi ricz mi, yoksa azab mı denildiğinde ve keza Benî İsrail'e mi, yoksa sizden öncekilere mi buyurulduğunda şekketmiştir. rivâyetlerde taun hastalığı zuhur eden yere girmek ve taundan kaçmak için o yerden çıkmak yasak edilmektedir. Kaçmak için değil de arızî bir sebeple o yerden çıkmakta beis yoktur. Cumhûr ulemânın kavli budur. Hattâ Hazret-i Âişe (radıyallahü anha); kaçmak, harbden kaçmak gibidir.» demiştir. Ulemâdan Bazıları taun hastalığı bulunan yere girmeyi ve ondan kaçmak için o yerden çıkmayı caiz görmüşlerdir. Bu kavil Hazret-i Ömer'le, Ebû Mûsa’l-Eş'ârî, Mesrûk ve Esved b. Hilâl'den rivâyet olunmuştur. Hattâ Amr b. Âs’ın: «Bu azabdan geçitlere, vadilere ve dağ tepelerine kaçın!» dediği rivâyet olunur. Bunlar hadîsteki nehyi te'vil ederek: «Resûlüllah (sallallahü aleyhi ve sellem) tâunlu beldeye girip çıkmayı mukadder olmayan bir şey başa gelir korkusuyla yasak etmemiştir. Lâkin fitne çıkmasın, halk o yere gelen kimsenin helâkini gelişine, kaçanın selâmetini de kaçışma bağlamasın diye nehiy buyurmuştur...» derler. diyor ki: «Sahîh olan yukarda arzetiğimiz gibi taun zuhur eden yere girmenin ve taundan kaçmak için o yerden çıkmanın men edilmesidir. Çünkü sahîh hadîslerin zahiri bunu gösterir.» kaçmak için değil de, herhangi bir iş veya meşguliyetle o yerden dışarı çıkmak bütün ulemâya göre caizdir. ancak ondan kaçmak çıkarır...» diye terceme ettiğimiz cümlesi bâzı nüshalarda merfu' bâzılarında mensub olarak rivâyet edilmiştir. Fakat gerek ibare gerekse mânâ itibariyle ikisi de müş-kildir. Kâdî Iyâz: «Bu rivâyet lisan âlimlerine göre zayıftır, mânâyı bozmaktadır. Çünkü zahirine göre herhangi bir sebeple tâunlu yerden çıkmak memnu, yalnız taundan kaçmak için çıkmak memnu değildir, mânâsına gelir ki, bu da maksadın tam zıddıdır.» diyor. bir cemâat bu cümledeki «illâ»nın râvi tarafından yanlışlıkla getirildiğini söylemişlerdir. Hadîsin doğru şekli sair rivâyetlerde olduğu gibi, onu hazfederek okumaktır. şerîf zararlı şeylerden ve onların sebeplerinden korunmaya, âfet ve musibet zamanında Allah'ın kazasına teslimiyet göstermeye teşvik etmektedir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 135
			}
		}
	]
}