{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5784,
			"arabicnumber": "2219.01",
			"text": "Bize Yahya b. Yahya Et-Temîmî rivayet etti. (Dediki): Mâlik'e, İbni Şihâb'daıı dinlediğim, onun da Abdü'l-Hamîd b. Abdirrahman b. Zeyd b. Hattab'dan, onun da Abdullah b. Abdillah b. Haris b. Nevfel'den, onun da Abdullah b. Abbas'dan naklen rivayet ettiği şu hadisi okudum. Ömer b. Hattâb Şam'a gitmek üzere yol'a çıkmış. Serğ denilen yere vardığında onu ecnadlılar (yâni) Ebû Ubeyde b. Cerrah ve arkadaşları karşılayarak Şam'da veba zuhur ettiğini kendisine haber vermişler. İbni Abbas demiş ki: Bunun üzerine Ömer: Bana iîk muhacirleri çağır! dedi. Ben de onları çağırdım, kendileriyle istişarede bulundu. Ve Şam'da veba zuhur ettiğini onlara haber verdi. Derken ihtilâfa düştüler. Bâzıları: Sen bir iş için yola çıktın, biz ondan dönmeni nıünâsib görmüyoruz, dediler. Bâzıları da: Senin beraberinde olanlar insanların bakıyyesi ve Resûlullah (Sallallahu Aleyhi ve Sellem)'in ashabıdır. Onları bu veba'nın üzerine götürmeni münasib görmüyoruz, dediler. Ömer (onlara): Yanımdan kalkın! dedi. — Bana ensârı çağır! dedi. Onları da çağırdım ve kendileriyle istişare etti. Fakat onlar da muhacirlerin yolunu tuttular ve onlar gibi ihtilâf ettiler. Ömer (onlara da): Yanımdan kalkın! dedi. Sonra : — Bana Fetih muhacirlerinden buruda bulunan Kureyş ihtiyarlarını çağır! dedi. Onları da çağırdım Ama onun yanında iki kişi bile ihtilafa düşmedi. Ve : — Biz insanları geri döndürmeni, onları bu vebanın üzerine götürmemeni münasib görüyoruz, dediler. Bunun üzerine Ömer cemaata seslendi : — Ben sabahleyin hayvanın sırtındaydım. Siz de binin! Ebû Ubeyde b. Cerrah : — Allah'ın kaderinden kaçmak için mi? dedi. Ömer : — Bunu senden başkası söylemeliydi yâ Ebâ Ubeyde! dedi. (Ömer ona karşı gelmekten çekinirdi.) Evet, Allah'ın kaderinden, Allah'ın kaderine kaçıyoruz. Ne buyurursun. Senin develerin olsa da iki taraflı bir vadiye inseler, tarafların biri verimli, diğeri çorak olsa. verimli yerde otlatsan Allah'ın kaderiyle otlatmış, çorak yerde otlatsan da Allah'ın kaderiyle otlatmış olmaz mıydın? dedi. Az sonra Abdurrahman b. Avf geldi. Bir hacetine gitmişti. Ve : — Bu hususta bende bilgi var. Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i: «Bir yerde taun olduğunu işitirseniz, o yere gitmeyin! Bir yerde zuhur eder, sîz de orada buiunursamz, ondan kaçmak için o yerden çıkmayınız!» buyururken işittim, dedi. İbni Abbâs: «Bunun üzerine Ömer b. Hattâb Allah'a hanıd etti. Sonra oradan gitti.» demiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 136
			}
		}
	]
}