{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 588,
			"arabicnumber": "251.02",
			"text": "Bana İshak b. Musa el-Ensari tahdis etti. Bize Ma'n tahdis etti, bize Malik tahdis etti. (H) Bize Muhammed b. el-Müsenna da tahdis etti. Bize Muhammed b. Cafer tahdis etti. Bize Şu'be tahdis etti. Hepsi birlikte Ala b. Abdurrahman'dan bu isnad ile rivayet ettiler ama Şu'be'nin hadisi rivayetinde ribattan söz edilmemektedir. Hadisin Malik tarafından rivayetinde ise bu iki defa sözkonusu edilerek: \"İşte ribat budur, işte ribat budur\" demiştir. Diğer tahric: Nesai, 143; Tuhfetu'l-Eşraf, 14087 NEVEVİ ŞERHİ: Resulullah (Sallallahu aleyhi ve Sellem): \"Size, Allah'ın kendisi i/e günahları si/diği dereceleri yükselttiği. .. İşte ribat budur\" buyruğu hakkında Kadı İyaz der ki: Günahların silinmesi, mağfiret edilip bağışlanmalarından kinayedir. Bununla birlikte, Hafaza meleklerinin yazdıkları kitaptan silinmesi anlamında olma ihtimali de vardır. Böylelikle bunların bağışlandıklarının delili olur. Derecelerin yükseltilmesi ise cennetteki mevkilerin yükseltilmesi demektir. Abdestin tam ve eksiksiz alınması (isbağ) ise mükemmel abdest almak demektir. \"Hoşlanılmayan, zor haller (el-mekarih)\" ise aşırı soğuk, vücudun acı çekmesi, hasta olmak ve benzeri hallerde sözkonusu olur. \"Çokça adım atmak\" ise evin uzaklığı ve defalarca gidilmesi ile olur. Namazdan sonra diğer namazın beklenmesi hakkında Kadı Ebu'l-Velid el-Bad de şöyle der: Bu vakitleri birbirine yakın iki namaz hakkındadır. Böyle olmayanların ise bu şekilde beklenmesi insanların uygulamalarından değildir. \"İşte ribat budur. \" Yani teşvik edilmiş ribat buna derler. Ribatın asıl anlamı kendisini bir şeye hapsetmektir. Burada kendisini böyle bir itaate hapsetmiş gibi olduğundan dolayı ribat denilmiştir. Ribatın en faziletlisinin o olması ihtimali vardır diye de açıklanmıştır. Nitekim, cihat nefse karşı cihattır, denildiği gibi. Ayrıca mümkün ve kolayolan ribat budur anlamında da olabilir yani bu ribat türlerinden bir türdür. Kadı İyaz'ın açıklamaları burada sona ermektedir. Hepsi güzelolmakla birlikte namazı beklemek ile ilgili el-Bad' nin sözü müstesnadır, o tartışılır. Allah en iyi bilendir. \"Hadisin Malik tarafından rivayetinde bu söz iki defa tekrar edilerek\" Müslim'in rivayetinde bu söz bu şekilde iki defa tekrar edilmiştir. Muvatta'daki rivayetinde ise üç defa tekrar edilerek (3/141) \"işte ribat budur, işte ribat budur, işte ribat budur\" denilmiştir. Bunu tekrar etmenin hikmetine gelince, buna ihtimam gösterilmesi ve konumunun büyüklüğünü anlatmak için olduğu söylendiği gibi Resulullah (Sallallahu aleyhi ve Sellem) sözünün anlaşılması için tekrar etmek alışkanlığı üzere bunu tekrar etmiştir diye de söylenmiştir, ama birinci açıklama daha güçlüdür. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Bu hadisin şerhinde Kaadî Iyad şunları söylemektedir: «Günahları mahvetmek onları affu mağfiret buyurmaktan kinayedir. Maamafih onları hafaza meleklerinin defterlerinden silmek de kasdedilmiş olabilir. Buda günahların affına cennete derecelerin yükseltilmesine delildir. Zorluklar soğuğun şiddetinden, vücudun hastalık sebebiyle elem ve kederinden ve buna benzer şeylerden neş'et eder. Mescitlere doğru adımı çok atmak evin onlara uzaklığı ve onlara çok gidip gelme sebebiyle olur.» Ebu'l Velid el-Bakî namazdan sonra namaz beklemenin birbirine yakın namazlar hakkında olduğunu sair namazlarda beklemenin adet olmadığını söylüyor. Ribat; nevbet yeri manasınadır. Esas itibari ile bir şey'e kendini hapsetmek demektir. Ribat meselesi Ebu Hureyre hadisinde bir, Malik hadisinde iki «el-Muvatta'da ise üç defa zikredilmiştir. Tekrarın hikmeti bu meselenin pek mühim, şanının pek büyük olduğunu bildirmektir, bazıları: «Resulullah (Sallallahu Aleyhi ve Sellem)'in adeti bir şey'i anlatırken iyi anlaşılması için onu üç defa tekrar etmektir. Buradada onun için tekrarlamıştır» derler",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 55
			}
		}
	]
}