{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 589,
			"arabicnumber": "252",
			"text": "Bize Kuteybetü'bnü Said ile Amr en-Nakıd ve Züheyr h. Harp rivayet ettiler. Dedilerki; Bize Süfyan, Ebu'z-Zinad'dan, o da A'rac'dan, o da Ebu Hureyre'den o da, Nebi (Sallallahu Aleyhi ve Sellem) 'den naklen rivayet etti. şöyle buyurmuşlar: \"Eğer müminlere zorluk vermeyecek olsaydım -Zuheyr'in hadisi rivayetinde: ümmetime şeklindedir- her namazdan önce onlara misvak kullanmalarını emredecektim. \" Diğer tahric: Ebu Davud, 46; Nesai, 533; İbn Mace, 690 -muhtasar olarak-; Tuhfetu'l-Eşraf, 13673 DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın NEVEVİ ŞERHİ: \"Müminiere -yahut ümmetime- zorluk vermeyecek olsaydım ... \" Buyruk misvakın vacip (farz) olmadığına delildir. Şafii (rahimehuliah) dedi ki: Eğer vacip olsaydı zor gelsin ya da gelmesin onlara bunu emrederdi. Çeşitli mezheplere mensup ilim adamlarından bir topluluk da şöyle demektedir: \"Bu hadiste emrin vücub ifade ettiğine delil vardır. Fukahanın çoğunluğu, kelamcı ve usul alimlerinin de pek çok topluluğu bu kanaattedir. Bu görüşte olanlar der ki: Bunun delil oluş şekline gelince, ittifakla misvak kullanmak sünnettir. İşte bu da vacip oluşunun terk edildiğine delildir. Ama bu şekildeki bir delillendirmenin tamam olabilmesi için Nebi (Sallallahu aleyhi ve Sellem)'in: \"Ümmetime zorluk vermeyecek olsaydım ... \" buyurduğu sırada misvak kullanmanın sllnnet olduğunu ortaya koyan delile ihtiyacı vardır. (3/143) Yine bir topluluğun dediğine göre bu buyrukta mendubun emredilmiş bir iş olmadığına delil bulunmaktadır. Ancak bu söz usul alimlerinin kanaatine muhaliftir. Bu istidlal hakkında da az önce vücub ifade ettiğine delil getirmek ile ilgili kaydettiğimiz itiraz sözkonusudur. Allah en iyi bilendir. Ayrıca bu hadiste yüce Allah tarafından hakkında nas gelmemiş olan hususlarda Nebi (Sallallahu aleyhi ve Sellem)'in içtihatta bulunmasının caiz olduğuna delil vardır. Fukahanın çoğunluğunun ve usul alimlerinin görüşü budur. Sahih ve tercih edilen kanaat de budur. Hadiste Nebi (Sallallahu aleyhi ve Sellem)'in ümmetine şefkati de açıklanmakta, her namazdan önce misvak kullanmanın faziletli olduğuna da delil bulunmaktadır. Misvak kullanmanın müstehap olduğu vakitlere dair açıklama az önce geçti",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 56
			}
		}
	]
}