{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"42": "The Book of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5934,
			"arabicnumber": "2272",
			"text": "Bize Ebû Âmir Abdullah b. Berrad El-Eş'arî ile Elû Küreyb Muhammed b. Alâ' rivâyet ettiler. Lafızları birbirine yakındır. (Dediler ki): Bize Ebû Üsâme Büreyd'den, o da dedesi Ebû Bürde'den, o da Ebû Mûsa'dan, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti. Şöyle buyurmuşlar: kendimi Mekke'den hurmali bir yere hicret ediyorum gördüm. Zannım bu yerin Yemame yahut Hecer olacağına gitti. Bir de baktım Yesrib şehri imiş. Bu rü'yamda bir kılıç salladığımı da gördüm. Kılıcın başı koptu. Bir de baktım bu Uhud Harbi gününde mü'minlerin başına gelen musîbettir. Sonra onu tekrar salladım ve en güzel şekline döndü. Bir de baktım bu Allah'ın getirdiği fetih ve mü'minlerin bir yere toplanmasıd;r. Bu rü'yâda bir takım ineklerle Allah'ın yaptığının daha hayırlı olduğunu gördüm. Bir de baktım ki bunlar Uhud gününde mü'minlerden bir cemaattır. Ve hayr Allah'ın sonradan getirdiği hayır; ve Allah'ın bize sonradan Bedir gününde getirdiği sıdkın sevabıdır.» hadîsi Buhârî «Menâkıb», «Meğâzi», «Alâmâtü'n-Nübüvve» ve «Ta'bir» bahislerinde; Nesâî ile İbn Mâce de «Kitâbür-Rü'ya»'da muhtelif râvilerden tahrîc etmişlerdir. Yemen'de bir şehirdir. Bahreyn'in payitahtıdır. Medine'nin eski ismidir. Bu hususta hac bahsinde izahat geçmişti. beyânına göre Resûlüllah (sallallahü aleyhi ve sellem)’in rü'yasını bu şekilde tefsir etmesi kılıç yardımcıya delâlet ettiği içindir. Çünkü bir insan düşmana kılıcıyle nasıl hücum eder. Başka yerlerde kılıç oğul, baba, amca veya kardeş, zevce gibi şeylere tefsir edilir, Bazan da me'murluğa, emânete, kişinin diline ve hüccetine, bir zâlimin tasallutuna delâlet eder. Bu hükümler görende, yahut gördüşü şeyde bulunan bazı mânâlara göre karine ile verilir. başkaları «Bu rü'yada bir takım inekler gördüm» cümlesine: «Kesilen inekler» kaydını ziyâde etmişlerdir. Rü'yanın te'vîli de bu ziyâde ile tamam olur. Zira inekleri kesmek Uhud gazasında sahabenin şehîd edilmeleridir. hayırdır...» cümlesini ekseri ulemâ Allah'ın sevabı daha hayırlıdır. Yani Allah'ın şehidlere verdiği sevab dünyada yaşamalarından daha hayırlıdır, şeklinde tefsir etmişlerdir",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 38
			}
		}
	]
}