{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5939,
			"arabicnumber": "2277",
			"text": "(Bana Hakem b. Mûsâ Ebû Salih rivâyet etti. ki): Bize Hikl (yani İbn Ziyad) Evzâî'den rivâyet etti. ki): Bana Ebû Ammâr rivâyet etti. ki): Bana Abdullah b. Ferruh rivâyet etti. ki): Bana Ebû Hüreyre rivâyet etti. ki): Resûlüllah (sallallahü aleyhi ve sellem): kiyâmet gününde Âdem oğullarının efendisi, kendisinden ötürü ili; kabiri yanlan ve ilk şefaat isteyen ve kendisine ilk şefaat hakkı verilen olacağım.» buyurdular. beyânına göre Seyyid; hayır hususunda kavminden üstün olan kimsedir. Başkaları onu: Baş sıkısında kendisine koşulan ve herkesin işini gören, kötülükleri insanlardan def eden kimsedir diye tarif etmişlerdir. (sallallahü aleyhi ve sellem) insanların hem dünyada hem âhirette ulusu ve efendisi olduğu halde burada kıyâmet gününde diye takyid etmesinin sebebi kıyâmette büyüklüğü herkes tarafından kabul edileceği, ona karşı gelen tek bir kimse kalmayacağı içindir. Halbuki dünyada böyle değildir. Dünyada ululuk hususunda küffârm kırallan ve müşriklerin reisleri kendisi ile münazaada bulunmuşlardır. Bu takyid Teâlâ Hazretlerinin mülk kimindir, Kahhar olan bir Allah'ında\" Sûre. âyeti celîlesine yakındır. Halbuki bundan önce de mülk Allah'a mahsustu, lâkin dünyada mülkü iddia edenler, yahut mecazen mülk kendilerine izafe edilenler vardı. Âhirette bütün bunlar bitmiştir. (sallallahü aleyhi ve sellem) iftihar için, Ben Âdemoğullarının efendisiyim, dememiştir. Çünkü meşhur bir hadîste: Âdemoğullarının efendisiyim; iftihar değil» buyurmuştur. Ulemâ burada bu sözü iki sebepten dolayı söylediğini beyân etmişlerdir: nimetini anlat da anlat\" Sûre-i Duhâ. emrine imtisal için yani tahdîsi nimet kabîlindendir. Bu söz ümmetine tebliği vâcib olan beyandan ma'duddur. Tâ ki bilerek itikad etsinler ve icâbında hareket ederek Peygamber (sallallahü aleyhi ve sellem)’e mertebesine göre ta'zimde bulunsunlar. hadîs Peygamber (sallallahü aleyhi ve sellem)'in bütün mahlûklar üzerine taidil edildiğine delildir. Çünkü ehl-i sünnetin mezhebine göre insanlar meleklerden efdal, Peygamber (sallallahü aleyhi ve sellem) ise hem insanlardan, hem de meleklerden efdaldir. Gerçi bir hadîste: arasında üstünlük çıkarmayın!» buyurulmuştur. Fakat bu hadîse beş suretle cevap verilmiştir:",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 2
			}
		}
	]
}