{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5949,
			"arabicnumber": "1392.03",
			"text": "(Bize bu hadîsi Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Affan rivâyet etti. H. İshâk b. İbrahim de rivâyet etti, ki): Bize Muğîre b. Selemete'l-Mahzumî haber verdi. iki râvi demişler ki: Bize Vüheyb rivâyet etti. ki): Bize Amr b. Yahya bu isnadla: hanelerinin her birinde hayır vardır.» cümlesine kadar rivâyet etti. Ondan sonraki Sa'd b. Ubâde kıssasını anmadı. Vüheyb'in hadîsinde: «Resûlüllah (sallallahü aleyhi ve sellem) de ona memleketinin idaresini verdiğini yazdı.» ifâdesini ziyâde etmiştir. Vüheyb'in hadîsinde «Resûlüllah (sallallahü aleyhi ve sellem)'de ona yazdı.» cümlesini anmamıştır. rivâyetlerden Ebû Humeyd hadîsini Buhârî «Kitabu'z-Zekât», «Kitâbu’l-Hacc» ve «Kitabu'l-Meğâzî»'de; Ebû Dâvud «Haraç» bahsinde rivâyet ettikleri gibi, Ebû Üseyd hadîsini Buhârî, Tirmizî ve Nesâî «Menâkıb» bahsinde muhtelif râvilerden tabrîc etmişlerdir. beyânına göre Ümmü Mâlik'in tulumu sıkmasıyle yağ bereketinin gitmesi ve ondan sonraki rivâyette adamın arpayı ölçmesiyle zahirenin bitmesinin hikmeti bu fiillerin tevekkül ve teslime aykırı olmalarıdır. Yani Allah'ın rızkına tevekkül ettikleri müddetçe rızık devam etmiş, kendi güç ve kuvvetlerine güvenerek işi ele almaya ve Allah'ın hükmündeki esrarı anlamaya kalkışınca bu nimetlerin ellerinden alınmalarıyla cezalandırılmışlardır. Altmış sa' demektir. Bu miktar tahminen onbeş teneke eder. Resûlüllah (sallallahü aleyhi ve sellem) o zâta yarım vesk arpa verdiğine göre bugünkü hesapla aşağı yukarı yedi teneke arpa vermiş demektir. İşte günlerce kendisinin, ailesinin ve misafirlerinin yemekle bitiremedikleri zahire budur. Resûlüllah (sallallahü aleyhi ve sellem) bu zâta arpayı ölçmemiş olsa bitmeyip onları beslemekte devam edeceğini bildirmiştir. ki: Gerek Ümmü Mâlik'in yağında gerekse bu zatın ırpasında Resûlüllah (sallallahü aleyhi ve sellem) açık birer mucize göstermiştir. Bundan sonraki rivâyetlerde dahi mucizeler görmekteyiz. Tebük'ün ayakkabı bağı kadar ince akan kaynağının şarıl şarıl akan bir dereye inkılâb etmesi; hattâ kimse yerinden kalkmasın diye tenbihde bulunduğu halde bir adam rüzgâr anında ayağa kalktığı için kendisine bir ;ezâ olmak üzere rüzgâr tarafından Tayyî dağlarına atılması, kalının bahçesinden \"on vesk (takriben yüz elli teneke) meyve çıkacağını tahmin buyurması ve neticede bahçeden o kadar meyve toplanması birer mucizedir. ; Medîne'ye on dört konak mesafede Medine İle Şam arasında bir şehirdir. Dimeşk’le aralarında on bir konak mesafe olduğu söylenir. Tebük gazası Resûl-i Ekrem (sallallahü aleyhi ve sellem)’in iştirak ettiği son gazadır. Sıcağın çok şiddetli olduğu ve meyvelerin kemâle erdiği bir zamana tesadüf etmiş, fakat bu gazada çarpışma olmamıştır. Kicaz’ın Şam tarafına düşen eski bir şehirdir.'Eyle de Misir'la Mekke arasında bir sahil şehridir. Buranın hükümdarı Yuhanna b. Ru'be Peygamber (sallallahü aleyhi ve sellem) bir mektup ve hediye olarak bir de beyaz katır göndermiştir. Bu hayvanın ismi Düldül'dür. Hadîsin zahirine bakılırsa Düldül bu gazada hediye edilmiştir. Peygamber (sallallahü aleyhi ve sellem)'in ondan başka bir katırı -'bulunduğu da rivâyet olunmamıştır. Şu halde burada zahiren bir tearuz göze çarpmaktadır. Şöyle ki; Tebük gazası hicretin dokuzuncu senesinde olmuştur. Halbuki Peygamber (sallallahü aleyhi ve sellem) Haneyn gazasına bu hayvanın üzerinde çıkmıştır. Vak'a sahîh hadîslerle rivâyet edilmiş ve şöhret bulmuştur. Huneyn gazası hicretin sekizinci yılında Mekke'nin fethinden sonra olmuştur. îyâz bu çelişikliği gidermek için şunu söylemiştir: «O halde hayvanın hediye edilmesi Tebük gazasından Önceye hamledilir. Zaten hediye meselesi elçinin gelmesi üzerine (vav) ile atfedilmiştir. Bu edat tertib iktiza etmez.» dağının Peygamber (sallallahü aleyhi ve sellem)’i sevmesi meselesi hac bahsinin sonunda geçmişti. hanelerinden murad kabilelerdir. Bunların içinden Benî Neccâr'in en faziletli olması İslâm'ı ilk kabul edenler oldukları ve dinde güzel eserler bıraktıkları içindir. dağları: Ece ve Selma isminde iki dağdır. Bunlara AMâlika denilen kavmden bir erkekle kadının ismi verildiği söylenir. Hadîsin bir rivâyetinde rüzgâr iki adam sürüklemiştir. Bunlar Benî Saide kabilesinden iki zât olup, biri haceti için gitmiş ve gittiği yerde tıkanmış kalmış. Öteki devesini aramaya çıkmış. Onu da rüzgâr Tayyi dağlarına atmış. Bu hâdise Peygamber (sallallahü aleyhi ve sellem)’e haber verilince: size yanında arkadaşı olmaksızın kimse dışarı çıkmasın demedim mi?» buyurmuş. Sonra gittiği yerde tıkanıp kalan zata duâ etmiş, o hemen şifa bulmuş. Öteki Resûlüllah (sallallahü aleyhi ve sellem)’e Tebük’den döndüğünde yetişmiş",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 12
			}
		}
	]
}