{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 596,
			"arabicnumber": "256",
			"text": "Bize Abd b, Humeyd rivayet etti. (Dediki): Bize Ebu Nuaym rivayet etti. (Dediki): Bize İsmail b. Müslim rivayet etti. (Dediki): Bize Ebu'l Mütevekkil rivayet etti. Önada İbni Abbas anlatmış. İbn Abbas bir gece Nebi (Sallallahu aleyhi ve Sellem)'in yanında kaldı. Allah'ın Nebisi (Sallallahu aleyhi ve Sellem) gecenin son vakitlerinde kalktı. Dışarı çıkıp semaya baktı, sonra Al-i İmran suresindeki şu: \"Muhakkak göklerin ve yerin yaratılışında, gece ile gündüzün değişip durmasında elbette akıl sahipleri için deliller vardır.\" (Al-i İmran, 190) ayetini: \"Bizi ateş azabından koru\" (Al-i İmran, 191) buyruğuna kadar okudu. Sonra eve dönüp ağzını misvakladı ve abdest aldı sonra kalkıp namaz kıldı sonra yattı sonra kalkıp dışarı çıktı, semaya baktı yine bu ayeti okudu sonra dönüp ağzını misvakladı, abdest aldı sonra kalkıp namaz kıldı. Yalnız Müslim rivayet etmiştir; Tuhfetu'l-Eşraf, 6286 DAVUDOĞLU AÇIKLAMA: Bu hadis İmam Müslim'in «Kitabu's-Salat»da bütün tarikleri ile rivayet ettiği bir hadisin muhtasarıdır. Hadis-i şerif bir çok nefis hükümleri ihtiva etmektedir. Bunlar inşaallah orada görülecektir. Ez Cümle geceleyin uykudan uyanan bir kimsenin gök yüzünü temaşa ederek kudretullahın azametine delalet eden sayısız yıldızlara ve nurtopu gibi parlayan aya bakması sonra bu ayeti kerimeyi okuması müstahaptir. Uykudan tekrar tekrar uyanan kimsenin aynı temaşayı ve ayeti tekrarlaması da müstahap olur. NEVEVİ ŞERHİ: \"Bize Ebu'l-Mütevekkil'in tahdis ettiğine göre İbn Abbas ... \" Bu hadiste çok sayıda faydalı mesele vardır ve ondan oldukça nefis hükümler çıkartılır. Müslim -yüce Allah'ın rahmeti üzerine olsun- bu hadisi burada muhtasar olarak zikretmiş, namaz kitabında (bölümünde) bunun rivayet yollarını genişçe açıklamıştır. Orada da bunun geniş açıklaması ve bundan elde edilecek faydalı bilgiler -yüce Allah'ın izniyle- gelecektir. Burada ise hadisin bu kadarı ile ilgili bazı hususları sözkonusu edeceğiz: Ebu'l-Mütevekkil'in adı Ali b. Davud'dur. Ali b. Davud el-Basrı olduğu da söylenir. \"Dışarı çıktı, semaya baktı sonra Al-i İmran suresindeki şu ayeti okudu ... \" Buradan geceleyin uyanırken semaya bakmakla birlikte bu ayetin okunmasının müstehap olduğu hükmü anlaşılmaktadır. (3/145) Çünkü bu çokça düşünmeye, tefekküre sebeptir. Aynı gecede birkaç defa uyuyup, uyanıp dışarı çıkacak olursa yine hadiste sözkonusu edildiği gibi bu ayetleri tekrar okuması müstehaptır. Şanı yüce Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 63
			}
		}
	]
}