{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 605,
			"arabicnumber": "261.02",
			"text": "Bize bu hadisi Ebu Kureyb de rivayet etti. (Dediki) : Bize İbni Ebi Zaide, babasından, o da Mus'ab b. Şeybe'den bu isnadda bu hadisin mislini haber verdi. Şu kadar varki o babasının; «onuncuyu unuttum» Dediğini söylemiş. DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın NEVEVİ ŞERHİ (596-604 numaralı hadisler): (596) \"Fıtrat beştir -yahut beş şey fıtrattandır.-\" Bu, raviden kaynaklanan bir şüphedir. Acaba birincisini mi söyledi yoksa ikincisini mi? Ancak ikinci rivayette (597) kesin bir ifade kullanarak \"fıtrat beştir\" demiş bulunmakta, sonra da bu beş şeyi Resulullah (Sallallahu aleyhi ve Sellem): \"Sünnet olmak, etek tıraşı olmak, tırnakları kesmek, koltuk altlarını yolmak ve bıyıklan kesmek\" diye açıklamaktadır. (598) \"Cafer b. Süleyman'dan, o Ebu İmran el-Cevni'den, o Enes (r.a.)'dan şöyle dediğini nakletti ... \" Buna dair açıklama ve bunun: Kırk günü geçmeyecek şekilde bu işleri terk etmememiz anlamında olduğu gelecek. \"Bize vakit tayin edildi.\" Bu da merfu hadislerden sayılır. Tıpkı bize şu husus emredildi denilmesi gibi. Buna dair açıklama kitabımızın baş taraflarında zikrettiğimiz fasıllarda geçmiş bulunmaktadır. Müslim'in sahihinden başka kaynaklarda: \"Resulullah (Sallallahu aleyhi ve Sellem) bize vakit tayin etti\" şeklinde geçmektedir. Allah en iyi bilendir. Kadı İyaz dedi ki: el-Ukayll dedi ki: Cafer'in rivayet ettiği bu hadis su götürür. Ebu Ömer b. Abdilberr de bu hadisi Cafer b. Süleyman'dan başkası rivayet etmiyor. O ise hıfzının kötülüğü ve çokça hata etmesi sebebiyle rivayeti delil olan birisi değildir. Derim ki: Bununla birlikte mütekaddimun (ilk dönem) imamlarının birçoğu Cafer b. Süleyman'ın sika olduğunu belirtmişlerdir. Onun sika olduğunu söylemek için Müslim'in rivayetini delil göstermesi yeterlidir. Bu hususta başkası da ona uymuştur. (599) \"Bıyıklan kesin ... \" (601 numaralı) diğer rivayette de \"sakallan uzatın\" buyurulmaktadır. İbn Bureyd dedi ki: (599 numaralı hadiste geçen: ehfO ile ilgili olarak) bir kimse bıyıklarını kökten tıraş edecek olursa, bu fiil kullanılır. (3/150) Bıyıkların kazınması (ihfa) ve sakalların bırakılması (ihfa)nın anlamı az önce açıklandı. (601 numaralı hadisteki) sakalları bırakın (evfCı) de onları bırakın, ondan bir şey eksiltmeyin, demektir. İbnu's-Sikkıt ve başkalarının dediğine göre \"lihye (sakal)\"ın çoğulu liha ve luha gelmekle birlikte kesreli söyleyiş (liha) daha fasihtir. (603) Numaralı diğer hadiste ise: \"On şey fıtrattandır ... \" denilmektedir. \"Fıtrat beştir\" buyruğunun anlamı, beş şey fıtrattandır demektir. Diğer rivayetteki \"on şey fıtrattandır\" denildiği gibi. Bununla birlikte fıtrattan olan şeyler yalnızca on taneden ibaret değildir. Resulullah (Sallallahu aleyhi ve Sellem)'de \"fıtrattandır\" buyurmakla, bunların on şeyden ibaret olmadığına işaret etmektedir. Allah en iyi bilendir. Fıtrat tabirinden burada ne kastedildiği hususunda görüş ayrılığı vardır. Ebu Süleyman el-Hattabi diyor ki: İlim adamlarının çoğunluğu bunun sünnet olduğu kanaatindedir. (3/147) Hattabfden başka bir topluluk da bunu böylece zikretmiş ve şunu da söylemişlerdir: Bunun anlamı ise bunların nebilerin -Allah'ın salat ve selamları onlara- sünnetlerinden olduklarıdır. Bir diğer açıklamaya göre bunlar dindendir. Diğer taraftan bu hususların birçoğu ilim adamlarına göre vacip (farz) değildir, bazılarının vacip olup olmadığı hususunda da görüş ayrılığı vardır. Sünnet olmak, mazmaza (abdest alırken ağza su alıp çalkalamak), istinşak (buruna su almak) gibi. Vacip olanın olmayanla birlikte zikredilmesinde ise bir engel yoktur. Yüce Allah'ın: \"Bunların her biri meyve verdiği zaman meyvelerinden yiyin, biçildiği gün de hakkını (zekatını) verin.\" (En'am, 6/141) buyruğunda olduğu gibi. Haklarını vermek vacip (farz) ama onlardan yemek vacip değildir. Allah en iyi bilendir. Hadislerde Sözü Geçen Hasletierin Açıklamasına Gelince: Sünnet (Hitan):Şafillere ve ilim adamlarının birçoğuna göre vacip, Malik ve çoğu ilim adamlarına göre sünnettir. Şafii'ye göre ise erkeklere de, kadınlara da vaciptir. Erkek hakkında vacip olan haşefeyi örten derinin haşefenin tamamı açığa çıkıncaya kadar kesilmesidir. Kadın hakkında vacip olan ise fercin üst tarafındaki deri parçasının asgari miktarını kesmektir. Mezhebimizin sahih ve alimlerimizin çoğunluğunun kabul ettiği kanaate göre ise küçükken sünnet olmak caizdir, vacip değildir. Mezhebimizdeki bir görüşe göre küçüğün velisinin büluğa ermeden önce küçüğü sünnet etmesi kap eder. Bir diğer görüşe göre on yaşından önce sünnet edilmesi haramdır. Bu husustaki sahih hadise göre görüş belirtilecek olursa, çocuğun doğumunun yedinci gününde sünnet edilmesi müstehaptır dememiz gerekir. Doğduğu gün yedi günden sayılır mı yoksa onun dışında yedi gün mü hususunda da iki görüş vardır, bu iki görüşün kuwetli olanına göre o günün de sayılacağıdır. Mezhep alimlerimiz müşkil hunsa (denilen erkek mi kız mı olduğuna hiçbir şekilde hüküm verilemeyen) hakkında farklı görüşlere sahiptir. Onun büluğdan sonra her iki fercinin de sünnet edilmesi kap eder denildiği gibi, hangisi olduğu açıkça ortaya çıkmadıkça sünnet edilmesi caiz olmadığı da söylenmiştir. Daha güçlü olan görüş budur. Erkeklik organı olan (hunsay)a gelince, eğer her iki organı da faal ise her ikisinin de sünnet edilmesi kap eder. Şayet onlardan biri faal, diğeri değilse faalolan sünnet edilir. Hangi organ ın faalolduğunun neye göre değerlendirileceği hususunda da iki görüş vardır. Bir görüşe göre küçük abdesti bozmaktır, diğerine göre ise cimadır. Bir kişi eğer sünnetsiz olarak ölürse mezhep alimlerimizin bu hususta üç görüşü vardır: Sahih ve meşhur olan ister küçük, ister büyük olsun sünnet edilmez, ikincisine göre ise büyükse sünnet edilir, küçükse edilmez. Allah en iyi bilendir. İstihdad (Etek Tıraşı):Bu da etek tıraşı yapmaktır. Buna istihdad denilmesinin sebebi ustura demek olan hadide (demir)in kullanılmasıdır. Bu da sünnettir. Bundan maksat ise belli yerin temizlenmesidir. Efdal olan da tıraş edilmesidir. Kesmek, yolmak ve tüy dökücü ilaç kullanmak da caizdir. '''Ane'' erkeğin tenasül organının üstündeki ve çevresindeki kıllar ile kadının fercinin etrafındaki kıllardır. Ebu'l-Abbas b. Sureye'den nakledildiğine göre, dübür yuvarlağının etrafında biten kıllardır. Bütün bunların toplamından ön arka ve çevrelerindeki bütün kılların tıraş edilmesinin müstehap olduğu anlaşılmaktadır. (3/148) Etek tıraşının ne zaman yapılacağına gelince. Tercih edilen görüşe göre bu ihtiyaca ve uzamasına göre tespit edilir. Uzadığı zaman tıraş edilir. Bıyıkların kesilmesi, koltuk altlarının yolunması, tırnaklarının kesilmesinde de durum böyledir. Enes (r.a.}'ın kitapta (598 numara ile) zikredilen \"bıyıkların kesilmesi, tırnakların kesilmesi... kırk günden fazla bırakılmaması. .. vakit olarak tayin edildi\" hadisinin anlamı ise kırk günü aşacak kadar kesilmeden bırakılmaması demektir. Yoksa kırk gün boyunca kesme yoluna gidilmemesi vakit olarak tayin edildi, demek değildir. Allah en iyi bilendir. Tırnakları Kesmek (Taklimu'l-Ezfar): Bu da sünnettir, vacip değildir. Ayaklardan önce ellerin tırnaklarını kesmek müstehaptır. Önce sağ elinin şahadet parmağını sonra orta parmağını sonra yüzük sonra serçe parmağını sonra baş parmağının tırnaklarını keser sonra sol ele geçip serçe parmağını sonra yüzük parmağını elinin sonuna kadar tırnaklarını keser. Sonra sağ ayağının tırnaklarını keserek önce serçe parmağının tırnağını keserek başlar, sol ayağının serçe parmağı ile tamamlar. Allah en iyi bilendir. Koltuk Altlarının Yolunması: İttifakla sünnettir. Efdal olan gücü yetenin koltuk altını yolmasıdır. Tıraş etmekle ve tüy dökücü ilaç kullanmakla da bu sünnet gerçekleşir. Yunus b. Abdula'la'dan şöyle dediği nakledilmektedir: Şafii (rahimehullah)'ın yanına girdim. Yanında berber de vardı, koltuk altını tıraş ediyordu. Şafii dedi ki: Ben sünnetin koltuk altlarını yolmak olduğunu biliyorum ama onun acısına dayanamıyorum. Sağ koltuk altından başlaması da müstehaptır. Bıyıkları Kesmek: Bu da sünnettir. Bıyığının sağ tarafından başlaması müstehaptır. Bizzat kendisi kesmek ile bu işi başkasına havale etmek arasında seçim yapmakta serbesttir. Çünkü açılmaması gereken bir yeri açmadan ve haram işlemeden maksat gerçekleşebilir. Halbuki koltuk altı ve etek tıraşı böyle değildir. Bıyığın kesilecek sınırına gelince, tercih olunan dudağın kenarı görününceye kadar kesmesidir, bıyığı dibinden kazımayız. \"Bıyıkları kesin\" şeklindeki rivayetlerin anlamı ise dudaklardan uzayıp taşan kısmı kesin demektir. Allah en iyi bilendir. Sakal Bırakmak (i'fau'l-lihye): Sakalın salınması demektir. Bir diğer rivayetteki \"evfu'l-liha\"nın anlamı budur. Farsların adeti sakalı kesmek şeklinde idi, şeriat bunu yasakladı. İlim adamları sakal hakkında mekruh on hususu zikretmektedirler. Bunların bir kısmı diğerinden daha çirkindir: 1- Cihad kastı olmaksızın siyaha boyamak 2- Sünnete uymak için değil de, salih kimselere benzetmek için sarıya boyamak 3- Baş olmak, tazim edilmek ve meşayihten olduğu izlenimini vermek için yaşlı görünmekte acele etmek niyetiyle kükürt ya da başka şeylerle ağartmak 4- Yüzünde tüy bitmemesini sağlamak ve suretinin güzel kalması maksadıyla ilk bittiği sıralarda sakalını yolmak yahut tıraş. etmek 5- Ağaran kılları yolmak 6- Kadınların ve başkalarının onu daha güzel bulmaları için saçının kıllarını tel tel, sıra sıra dizmek 7 - Şakaklardaki saçlardan sakala ilave yapmak yahut başı tıraş ederken, yan taraflarını alırken sakalın üst taraflarını kısmen almak 8- İnsanlar için güzel görünmek kastıyla sakalını taramak 9- Zahitlik görüntüsü ve kendisine pek aldırmadığı izlenimini vermek maksadıyla sakalını birbirine karışmış, birbirine geçmiş halde bırakmak 10- Sakalının siyahına ve beyazına beğenerek, böbürlenerek gençliğe kanıp, yaşlılıkla övünerek gençlere karşı üstünlük taslayarak bakmak 11- Sakala düğüm atmak, onu örgü yapmak 12- Sakalı tıraş etmek (3/149); ancak kadının sakalı çıkacak olursa onun da sakalını tıraş etmesi müstehap olur. Allah en iyi bilendir. İstinşak (burna su çekmek): Açıklaması, nitelikleri, vacip ve müstehap oluşunda ilim adamlarının görüş ayrılıkları daha önce geçti. Parmak Eklem ve Boğumlarını Yıkamak (ğaslu'l-beracim): Başlı başına bir sünnettir. Abdest almaya özgü değildir. Beracim, burcume'nin çoğulu olup, parmakların boğumları ve bütün eklemleri demektir. İ1im adamları der ki: Kulakların büküldükleri yerlerde toplanan kirler de bunlar gibidir. Bu kirleri de silerek alır çünkü bazı hallerde kulak kirinin çokluğu işitmeye zarar verebilir. Aynı şekilde burnun içinde toplanan kirleri de temizlemenin hükmü budur. Kısacası vücudun herhangi bir yerinde ter, toz ve buna benzer bir sebeple toplanan bütün kirlerin hükmü böyledir. Allah en iyi bilendir. Temizlenirken Su Kul/anmak (intikasu'l-ma'): Veki\" burada (603 numaralı hadiste) bunu istindı. diye açıklamış olmakla birlikte Ebu Ubeyde ve başkaları: Bunun anlamı tenasül uzvunu yıkarken su kullanmak suretiyle sidiğin kesilmesini sağlamaktır demişlerdir. Bazıları ise su serpmektir diye açıklamıştır. Bir rivayette ise \"intikasu'l-ma'\" yerine \"intizah\" gelmiştir. Cumhurun dediğine göre intizah, abdest aldıktan sonra vesveseyi ortadan kaldırmak maksadıyla ferce az miktarda su serpmek demektir. Bunun su ile istinca yapmak olduğu da söylenmiştir. İbnu'l-Esir'in belirttiğine göre bu laflZ \"intifasu'l-ma'\" diye de rivayet edilmiştir. \"en-Nihaye fi Garibi'l-Hadis\" adlı eserinin \"fe\" faslında: Doğrusu bunun fe ile olduğudur, demektedir. Devamla şunları söyler: Bundan maksat ise az miktardaki suyun ferce serpilmesidir. Bu da az miktarda akan kan hakkında \"nefasa\" fiilini kullanmalarından gelmektedir. Ancak onun bu nakli şazdır, doğrusu az önce kaydettiğimizdir. Allah en iyi bilendir. (603) \"Onuncusunu ise unuttum, ancak mazmaza olmalıdır.\" Bu onun (Mus'ab'ın) bu husustaki şüphesinden ileri gelmektedir. Kadı İyaz der ki: Belki de bu onuncusu beş haslet ile birlikte zikredilen sünnettir. Onun böyle olması daha uygundur. Allah en iyi bilendir. İşte bu söylediklerimiz fıtrat ile ilgili olanlar hakkında kısa açıklamalardır. Buna dair geniş ve etraflı açıklamaları delilleriyle ve diğer ayrıntılarıyla el- Mühezzeb Şerhinde doyurucu bir şekilde yapmış bulunmaktayım. Allah en iyi bilendir. (603) \"Sakalları bırakın\" yani onları bırakın, onlarda değişiklik yapmaya kalkışmayın. Kadı İyaz'ın belirttiğine göre çoğunluğun rivayeti bizim zikrettiğimiz gibi (erhCı) şeklindedir. Ancak İbn Mahan' daki rivayette cim ile \"ereCı\" şeklindedir. Bunun birincisi ile aynı anlamda olup, aslının \"erciCı\" diye hemzeli olup, hafifletmek için hemzenin hazfedildiği de söylenmiştir yani onu erteleyin ve onu terk edin, bırakın. Buhari'nin rivayetinde ise: \"VeffirCı\" şeklindedir. Böylelikle bu kelimede \"a'fu, evfu, erhu, ercu, veffiru\" olmak üzere beş rivayet ortaya çıkmaktadır. Hepsinin anlamı ise kendi haline bırakın, şeklindedir. Hadisin lafızlarının gerektirdiği hadisin zahirinden anlaşılan budur. Mezhep alimlerimizden ve onların dışındaki ilim adamlarından bir topluluğun kanaali de bu şekildedir. Kadı İyaz (rahimehullah) dedi ki: Sakalın tıraş edilmesi, kesilmesi ve yakılması mekruhtur. Boyundan, eninden alınması ise güzeldir. Şöhret için onu büyütmek mekruh olduğu gibi, bu maksatla kesilmesi ve yolunması da mekruhtur. Selef bunun bir sınırının olup olmadığı hususunda farklı kanaatlere sahiptir. Onlardan bu hususta hiçbir sınır getirmemiş olanlar olmakla birlikte dikkat çekecek kadar ilişmeden de bırakmaz, onu bir miktar kısaltır. Malik oldukça uzun tutulmasını mekruh görmüştür. Seleften bazıları da bir kabzadan fazlasının kesilmesini söyleyerek sınır getirmiştir. Kimisi de hac ya da umre dışında onu kısaltmayı mekruh görmüştür. (Kadı İyaz devamla) dedi ki: Bıyık hakkında ise seleften birçok kimse kökten alınacağı ve tıraş edileceği görüşündedir. Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Bıyıkları kesiniz ve onları dipten tıraş ediniz\" buyruğunun zahirini delil almışlardır. KCıfelilerin de görüşü budur. Seleften birçoğu ise tıraş etmenin ve kökten almanın yasak olduğu kanaatindedir. Malik de böyle demiştir. O bıyıkların (kökten) tıraş edilmesini bir müsle (hilkati çirkinleştirmek) kabul eder ve böyle yapanın tedib edilmesini emreder, bıyığın üst tarafından alınmasını da mekruh görürdü. Bu kanaatte olanlar kökten almanın, yolmanın ve kesmenin aynı manada olduğunu ve bunun du dağın ucu görününceye kadar kısaltılması anlamında olduğunu kabul ederler. Kimi ilim adamı ise her iki husustan birini seçmekte serbestlik olduğu kanaatindedir. -Kadı İyaz'ın ifadeleri burada sona ermektedir.- Tercih olunan ise sakalı kendi haline bırakmak ve onu kesinlikle kısa Itmaya kalkışmamaktır. Bıyık hakkında tercih olunan ise kökten tıraş etmeyip, du dağın kenarının görünmesini sağlayacak şekilde kısaltmaktır",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 72
			}
		}
	]
}