{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6084,
			"arabicnumber": "2344.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Ubeydullah, İsrail'den, o da Simâk'den naklen rivâyet etti ki: Simak, Câbir b. Semûra'yı şöyle derken işitmiş: Resûlüllah (sallallahü aleyhi ve sellem)’in sakalı ile başının Ön tarafı ağarmağa başlamıştı. Yağ süründüğü zaman (beyazlık) belli olmazdı. Başının saçı dağılırsa belli olurdu. Sakalının kılları çoktu. bir adam: Yüzü kılıç gibi miydi? dedi. Câbir: Hayır! Bilâkis ayla güneş gibiydi; yuvarlaktı. Omuzun da ki mührü de gördüm, güvercin yumurtası kadardı. Tenine benziyordu, cevabını verdi, Enes rivâyetini Buhârî «Kitâbu'l-Libas»'da; Ebû Cuheyfe rivâyetini «Kitâbu'l-Menâlub»'de tahric etmiştir. Boyaya yarıyan bir nevi ottur. İhtiyarlığın başlangıcı ve saçların ağarmaya başlamasıdır. Peygamber (sallallahü aleyhi ve sellem)’in saçlarının ağarmaya başladığını bildiren rivâyetler çoktur. Umumiyetle bu rivâyetlerde saç ve sakalının biraz ağarmaya başladığından bahsedilmektedir. Bu birazın ne kadar olduğu ihtilaflıdır. Bazıları saç ve sakalında on dokuz beyaz kıl olduğunu söylemiş bir takımları onu yirmiye, hatta bazıları otuza çıkarmıştır. Hazret-i Enes'den rivâyet edilen bir hadîste on beş, diğer bir rivâyette on yedi veya on sekiz olduğu bildirilmiştir. (sallallahü aleyhi ve sellem)'in saçını boyayıp boyamadığın-da dahi ihtilâf olunmuştur. Ekser ulemâ Hazret-i Enes'den rivâyet edilen hadîsle istidlal ederek boyamadığma kail olmuşlardır. İmâm Mâlik'in mezhebi de budur. Bâzı hadîs İmâmları boyadığına kaildirler. Delilleri buradaki Ümmü Seleme hadîsidir. İki rivâyetin arasını bulanlar da vardır. Onlara göre Hazret-i Enes'in işaret ettiği vecihle Peygamber (sallallahü aleyhi ve sellem) güzel kokuyu çok kullanıyordu. Bu iso saçın siyahlığını giderirdi. Saçını boyadığını iddia eden işte bu koku sürülmüş saçı görmüş de boya sanmıştır. diyor ki: «Muhtar olan kavle göre Peygamber (sallallahü aleyhi ve sellem) bâzan saçım boyamış, ekseri zamanlarda boyamamıştır. Bu hususta her râvi gördüğünü rivâyet etmiştir. Ve sözünde sadıktır.» son rivâyetinde: «Peygamber (sallallahü aleyhi ve sellem)’in yüzü kılıç gibi miydi?» diye soran zâtın bu suâliyle: Kılıç gibi uzun muydu, yahut kılıç gibi parlak mıydı demek istemiş olması muhtemeldir. Hazret-i Câbir buna: «Hayır güneş ve ay gibi idi. Ve yuvarlaktı.» diye cevâb vermiştir ki, bununla onun hem güzel ve yüzünün parlaklığına, hem de yuvarlaklığına işaret etmiştir. Çünkü ay ve güneş, hem kılıçtan daha parlak, hem de yuvarlaktırlar. Resûlüllah (sallallahü aleyhi ve sellem)’in yüzünü onlara benzetmek daha beliğ olur. Bilhassa sevgilinin yüzünü aya benzetmek Arablar arasında pek yaygın bir âdetti. Enes'in: «Bİr kimsenin başından ve sakalından beyaz kıl yolması mekruhtur.» sözü ulemâ arasında ittifakla kabul edilmiştir. mührü hakkında aşağıdaki hadîslerde izahat verilecektir",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 142
			}
		}
	]
}