{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 613,
			"arabicnumber": "267.01",
			"text": "Bize Yahya b. Yahya tahdis etti. Bize Abdurrahman b. Mehdi, Hemmam'dan haber verdi. O Yahya b. Ebi Kesir'den, o Abdullah b. Ebu Katade'den, o babasından şöyle dediğini nakletti: Resulullah (Sallallahu aleyhi ve Sellem): \"Sizden biriniz küçük abdestini bozarken zekerini sakın sağ eliyle tutmasın, helada sağ eliyle si/inmesin, kabın içine de solumasın\" buyurdu. Diğer tahric: Buhari, 153 -uzunca-, 154, 5630 -uzunca-; Müslim, 5253; Ebu Davud, 31 -uzunca-; Tirmizi, 15; Nesai, 24, 47, 48; İbn Mace, 310 -buna yakın-; Tuhfetu'l-Eşraf, 12105 DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın NEVEVİ ŞERHİ: \"Bize Yahya b. Yahya tahdis etti... Abdullah b. Ebu Katade'den, o babasından ... \" Müs!im -yüce Allah'ın rahmeti üzerine- (613 numaralı hadiste): \"Bize Yahya b. Yahya da tahdis etti ... İbn Ebu Katade'den, o babasından\" gördüğümüz asıllarda bu şekildedir. Birinci rivayette Hemmam, Yahya b. Ebu Kesir' den, ikincisinde ise Hişam şeklindedir. Birincisinin Müs!im' den nakledenlerden birisi tarafından bir tashif olduğunu zannediyorum, çünkü Buhari, Nesai ve onların dışındaki bazı imamlar bunu -Hişam ed-Desteval'den- diye Müslim'in ikinci rivayet yolunda rivayet ettiği gibi rivayet etmişlerdir. Benim bu söylediklerime de İmam Muhammed Halef el-Vasıti açıklık getirerek şunları söylemektedir: Bunu Müslim, Yahya b. Yahya'dan, o Abdurrahman b. Mehdi'den, o Hişam;dan ayrıca Yahya b. Yahya'dan, o Veki\"den, o Hişam'dan, o Yahya b. Ebu Kesir'den diye rivayet etmiş ve böylelikle imam halef Müslim'in bu hadisi her iki yolda da Hişam ed-Destevai'den rivayet ettiğini açıkça ifade etmiştir. İşte bu da \"Heriımam\" isminin Müslim' den sonrakiler tarafından bizim nüshamızda meydana getirilmiş bir tashif olduğuna delildir. Allah en iyi bilendir. \"Sizden biriniz sağ eliyle zekerini ... tutmasın.\" Zekerin sağ elle tutulması az önce istinca bahsinde geçtiği gibi tahrimen değil, tenzihen mekruhtur. Biz orada istinca yaparken herhangi bir şekilde sağ elinin yardımını almayacağını açıkladığımız gibi bu hususla ilgili başka noktalara da açıklık getirmiş idi k. \"Helada sağ eliyle si/inmesin. \" Burada hela kaydı küçük abdesti dışarıda tutmak için değildir, her ikisi de aynıdır. \"Held\" med ile kullanılır, maksat ise büyük abdest bozmaklır. Allah en iyi bilendir. (3/159) \"Kabın içine solumasın.\" Yani kabın içine nefes alıp vermesin. Kabın dışında (su içerken) üç defa nefes alıp vermek ise bilinen bir sünnettir. İlim adamları der ki: Kabın içine solumanın yasaklanışı suyu kirletip, kokutmak, içine ağızdan, burundan ve benzeri yerlerden bir şeyler düşmek korkusuyla edep olmak üzere yasaklanmıştır. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 80
			}
		}
	]
}