{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6165,
			"arabicnumber": "2380.03",
			"text": "Bize Ubey b. Ka'b rivayet etti. (Dediki): Resûlullslh (Sullallahu Aleyhi ve Sellem)’ı şöyle buyururken işittim: «Haluşân şu ki ; Bir defa Musa (Aleyhisselâm) kavminin içinde onlara Allah'ın günlerini hatırlatıyordu. Allah'ın günleri ni'metleriyle belâlarıdır. Bir ara şöyle dedi: Yeryüzünde benden daha hayırlı yahut daha âlim bir kimse bilmiyorum. Bunun üzerine Allah kendisine şunu vahyetti : Ben hayrı yahut hayrın kimde olduğunu ondan daha âlâ bilirim. Gerçekten yeryüzünde bir zat var ki, o senden daha âlimdir. Musa : — Yâ Rabbi! Onu bana göster, dedi. Kendisine : — Azık olarak yanına tuzlu bir balık al. O zat senin balığı kaybedeceğin yerdedir, denildi. Müteakiben Musa ile hizmetçisini bırakarak yürümeye devam etti. Derken balık suda harekete geçti. Su üzerine kapanmaz oldu. Dehliz gibi olmuştu. Bunun üzerine hizmetçisi : Nebiyyullah'a yetişip ona haber versem mi ki, dedi. Arkacığından, kendisine unutturuldu. Kayayı geçtikleri vakit Musa hizmetçisine : — Sabah kahvaltımızı getir. Gerçekten bu yolculuğumuzda müşkilâtla karşılaştık. Ama kayayı geçinceye kadar onlara güçlük isabet etmemişti. Hizmetçisi hemen hatırladı : — Gördün mü, kayaya geldiğimiz vakit ben balığı unuttum. Ama onu hatırlamamı bana ancak şeytan unutturdu. Hem denizde şaşılacak şekilde yolunu tuttu gitti, dedi. Musa : — Aradığımız buydu, dedi. Ve izlerini takibederek gerisin geriye döndüler. Hizmetçisi ona balığın yerini gösterdi. Musa : — Bana da burası tarif olundu, dedi ve aramaya gitti. Bir de ne görsün Hızır! Bir elbiseyle örtünmüş. Arkası üstü başının üzerine (yahut başının ortası üzerine) yatıyor. — Esselâmu aleykum! dedi. Bunun üzerine Hızır yüzünden elbiseyi açtı: — Ve aleykümüsselâm! Sen kimsin? — Ben Musa'yım! — Hangi Musa? — Beni İsrail'in Musa'sı! — Seni büyük bir iş getirmiş olmalı. — Sana öğretilen hakdan bana öğretmen için geldim. — Ama sen benimle beraber sabretmeye güç yetiremezsin. İyice bilmediğin bir şeye nasıl sabredebilirsin ki? Bir şey ki, ben onu yapmaya memur olurum. Sen onu görürsen sabredemezsin. — Inşaallah beni sabırlı bulacaksın! Sana hiç bir şeyde karşı gelmem. — O halde bana tâbi olursan; bana hiç bir şey sorma. Tâ ki kendiliğimden sana ondan bir şey anlatıncaya kadar. İkisi yola revan oldular : Nihayet gemiye bindikleri vakit Hızır gemiyi yaraladı. Onu kasden yaptı. Musa (Aleyhisselâm) kendisine : — Bu gemiyi üzerindekileri boğmak içinmi yaraladın gerçekten şaşacak bir iş yaptın, dedi. — Ben sana benimle beraber sabretmeye güç yetıremezsin demedim mi? — Unuttuğumdan dolayı beni muaheze buyurma. Bu işde benim başıma güçlük de çıkarma! Yine yürüdüler. Nihayet oynayan bir takım çocuklara rastladılar. Hızır hemen bunlardan birinin yanına vararak hiç düşünmeden onu öldürdü. O anda Musa (Aleyhisselâm) yadırganacak bir şekilde ürktü. — Masum bir nefsi kısas hakkın olmaksızın öldürdün mü? Gerçekten yadırganacak bir şey yaptın, dedi.» Sonra Resulullah bu yerde şöyle buyurdular : «Allah'ın rahmeti bize ve Musa'ya olsun! Eğer acele etmeseydi şaşılacak şeyler görecekti. Lâkin ona arkadaşından utanmak geldi. Bundan sonra sana bir şey sorarsam bir daha benimle arkadaşlık etme. Benim tarafımdan özür derecesine vardın, dedi. Eğer sabretmiş olsaydı şaşılacak şeyler görecekti.» Râvi diyor ki: Nebi (Sallaliahu Aleyhi ve Sellem), Nebilerden birini andığı vakit, kendinden başlar: «Allah'ın rahmeti bize ve kardeşim filâna olsun! Allah'ın rahmeti bize olsun.» derdi. «Sonra yürüdüler. Nihayet alçak bir takım köy halkına vardılar. Ve bütün meclislerde dolaşarak köy halkından yiyecek istediler. Fakat onlar kendilerini misafir etmekten çekindiler. Derken Hızır o köyde yıkılmak üzere olan bir duvar buldu. Ve onu doğrulttu. Musa: İsteseydin buna karşılık ücret alırdın, dedi. Hızır: — Bu benimle senin ayrılığımızdir, dedi ve elbisesinden tuttu. Sana sabredemediğin şeylerin te'vilini haber vereceğim, dedi: Gemi denizde çalışan bir takım fakirlerin idi... âyetini sonuna kadar okudu. Onu zabdedecek hükümdar geldiği vakit delinmiş bulacak ve bırakıp gidecek. Fakirier de onu tahta ile tamir edecekler. Oğlan ise yaratıldığı an kâfir olarak yaratılmıştı. Anası, babası ona karşı şefkatli idiler. Oğlan yetişmiş olsa onları azgınlık ve küfre sevkedecekti. Bu sebeple biz onun yerine annesiyle babasına Rablerinin ondan daha yararlı ve daha merhametli bir evlât vermesini diledik. Duvara gelince : Bu duvar şehirde iki yetim çocuğa ait idi. Altında...» âyeti sonuna kadar okudu",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 223
			}
		}
	]
}