{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6168,
			"arabicnumber": "2380.06",
			"text": "Bana Harmele b. Yahya rivayet etti; (Dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus İbni Şihab'dan, o da Ubeydullah b. AbdillaH b. Utbe b. Mes'ud'dan, o da Abdullah b. Abbâs'dan naklen haber verdi ki, İbni Abbas ile Hur b. Kays b. Hısn El-Fezâri, Musa (Aleyhisselâm)'ın arkadaşı hakkında münakaşa etmişler. İbni Abbâs: O Hızır'dır! demiş. Az sonra yanlarından Übey b. Kâ'b El-Ensâri geçmiş. İbni Abbâs.onu çağırarak: — Ey Ebû't-Tufeyl yanımıza gel! Çünkü ben ve şu arkadaşım Mûsa'nın görüşmek için çare sorduğu arkadaşı hakkında münakaşa ettik. Sen Resûlullah (Sallaliahu Aleyhi ve Sellem)'in onun hakkında bir şey söylediğini işittin mi? demiş. Bunun üzerine Übeyy şunu söylemiş : — Ben Resulullah (Sallaliahu Aleyhi ve Sellem)'i şöyle buyururken işittim ; «Bir defa Musa, Beni İsrail'den bir cemâatin içinde bulunuyordu. Ansızın kendisine bir adam gelerek : Sen kendinden daha âlim bir kimse biliyor musun? diye sordu. Musa : Hayır! diye cevab verdi. Bunun üzerine Allah Musa'ya bilâkis kulumuz Hızır {senden daha âlimdir) diye vahy indirdi. Musa da onunla görüşmenin yolunu sordu. Allah bunun için balığı alâmet yaptı. Musa'ya denildiki: Balığı kaybettin mi hemen geri dön! Ona rastlayacaksın! Artık Musa Allah'ın dilediği kadar yürüdü. Sonra hizmetçisine : — Sabah kahvaltımızı getir, dedi. O kahvaltıyı istediği vakit, hizmetçisi : — Gördün mü, kayaya vardığımızda ben balığı unuttum. Ama onu hatırlamayı bana unutturan ancak şeytandır, dedi. Bunun üzerine Musa hizmetçisine : — Bizim aradığımız buydu, dedi. Hemen kendi İzlerini takib ederek geri döndüler. Ve Hızır'ı buldular. Artık onların hal-ü şanlan Allah'ın kitabmda hikaye ettiği şekilde oldu.» Yalnız Yûnus: «Denizde balığın izini takib ediyordu.» demiştir. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 226
			}
		}
	]
}