{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6175,
			"arabicnumber": "2383.04",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Hâlid b. Abdillah, Hâlid'den, o da Ebû Osman'dan naklen haber verdi. ki): Bana Amr b. As\" haber verdi. Resûlüllah (sallallahü aleyhi ve sellem) zatı selâsil ordusuna kumandan göndermiş. Amr Şöyle dedi: Ona vararak: Sana insanların en sevimlisi kimdir? diye sordum. cevâbını verdi. Yâ erkeklerden? dedim. «Babası!» buyurdu. Sonra kim?» dedim. buyurdu ve bir takım zevat saydı. hadîsi Buhârî «Fedâli ashao» ne «megmı» Tirmizî ile Nesâî «Menâkıb»'de tahric etmişlerdir, Zatu Selâsil: Şam tarafında Benî Cüzam kabilesine ait bir sudur. Hicretin sekizinci yılında burada müslümanlarla küffar harb' ettiği için vak'aya bu yerin ismi verilmiştir. Mûte harbi bundan önce olmuştur. Resûlüllah (sallallahü aleyhi ve sellem) Hazret-i Amr İbn Âs'ı ordu kumandanı tayin etmişti. Halbuki ordunun içinde Hazret-i Ebû Bekr'le Ömer de vardı. Bunu görünce Hazret-i Amr b. Âs: Galiba beni Resûlüllah (sallallahü aleyhi ve sellem) daha çok seviyor; rütbe itibariyle bunlardan üstün tutuyor, diye düşünerek Peygamber (sallallahü aleyhi ve sellem) hadîste zikri geçen suali sordu. muhtelif rivâyetlerinden anlaşıldığına göre Amr b. Âs kendisini söyler ümidiyle: «Ondan sonra kimi seviyorsun?» diye sormakta devam etmiş, fakat Resûlüllah (sallallahü aleyhi ve sellem) hep başkalarını söylemiştir. Bunun üzerine Hazret-i Amr kendisine yakında sıra gelmeyeceğini anlayarak sormaktan vazgeçmiştir. Siyer ulemâsının beyânlarına göre gerçekten o gün Hazret-i Amr'dan daha üstün bir hayli Ashâb-ı kiranı bulunmakta idi. «Bu hadîs Hazret-i Ebû Bekr'le Ömer ve Âişe'nin pek büyük fazilet sahibi olduklarını açıkça göstermektedir. Bu hadîste Hazret-i Ebû Bekr'i, ondan sonra Ömer'i bütün sahabeden üstün kabul eden ehl-i sünnete açık delil vardır.» diyor",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 7
			}
		}
	]
}