{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6214,
			"arabicnumber": "2403.03",
			"text": "Bize Muhammed b. Miskin El-Yemâmi rivayet etti. (Dediki): Bize Yahya b. Hassan rivayet etti. (Dediki): Bize Süleyman (bu zat İbni Bilâl'dır) Şerik b. Ebi Nemr'den, o da Said b. Müseyyeb'den naklen rivayet etti. (Demişki): Bana Ebû Mûsa'l-Eş'ari haber verdi. Ki kendisi evinde abdest almış, sonra (dışarı) çıkarak: Bugün mutlaka Resûlullah (Sallallahu Aleyhi ve Sellem)’in yanına gideceğim. Ve onunla beraber olacağım, demiş. Ve mescide gelmiş. Nebi (Sallallahu Aleyhi ve Sellem)'i sormuş : — O çıktı; şu tarafa doğru gitti, demişler. Ebû Musa diyor ki: Ben de onu soruşturarak izinden yola çıktım. Nihayet Eriz kuyusuna girdi. Ben de kapıda oturdum. Onun kapısı hurma dalından idi. Resûlullah (Sallallahu Aleyhi ve Sellem) hacetini görüp abdesti alınca kalkarak yanına vardım. Bir de baktım. Eriz kuyusunun kenarına oturmuş, kuyunun kenarını ortalamış, baldırlarını açmış ve onları kuyunun içine sarkıtmış. Ona selâm verdim. Sonra giderek kapının yanına oturdum. (Kendi kendime) Bugün mutlaka Resûlullah (Sallallahu Aleyhi ve Sellem)’in kapıcısı olacağım, dedim. Az sonra Ebû Bekr geldi ve kapıyı çaldı. — Kim o? dedim. — Ebû Bekr! cevâbım verdi. — Ağır ol! dedim. Sonra giderek: — Yâ Resûlallah! Bu (gelen) Ebû Bekr'dir. İzin istiyor, dedim. «Ona izin ver! Ve kendisini cennetle müjdele!» buyurdu. Ben dönüp geldim ve Ebû Bekr'e : — Gir! Hem Resûlullah (Sallallahu Aleyhi ve Sellem) seni cennetle müjdeliyor, dedim. Ebû Bekr girdi. Ve Resûlullah (Sallallahu Aleyhi ve Sellem)'in sağ tarafına onunla birlikte kuyunun kenarına oturdu. Ayaklarını da Nebi (Sallallahu Aleyhi ve Sellem)'in yaptığı gibi kuyu'ya sarkıttı. Ve baldırlarını açtı. Sonra ben (kapı yanına) döndüm ve oturdum. Kardeşimi abdest alırken bırakmıştım. Bana yetişecekti. (İçimden kardeşimi kasdederek) Eğer Allah filâna hayr murad etti ise, onu (buraya) getirir, dedim. Bir de baktım. Bir insan kapıyı kıpırdatıyor: — Kim o? dedim. — Ömer b. Hattâb'ım! dedi. — Ağır ol! dedim. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek selâm verdim ve: — Bu (gelen) Ömer'dir, izin istiyor! dedim. «Ona izin ver; ve kendisini cennetle müjdele!» buyurdular. Hemen Ömer'e gelerek: — İzin verdi. Hem Resûlullah (Sallallahu Aleyhi ve Sellem) seni cennetle müjdeliyor! dedim. O da girdi. Ve Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte onun sol tarafına kuyu kenarına oturdu. Ayaklarını da kuyu'ya sarkıttı. Sonra (ben kapı yanına) dönerek oturdum. Ve (kardeşimi kasdederek) Allah filâna hayır murad etti ise onu (buraya) getirir, dedim. Derken az sonra bir insan gelerek kapıyı salladı: — Kim o? dedim. — Osman b. Affân'ım! cevâbını verdi. — Ağır ol! dedim ve Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek kendisine haber verdim: «Ona izin ver; ve başına gelecek bir belâ ile birlikte kendisini cennetle müjdele!» buyurdu. Hemen geldim ve: — Gir! Hem Resûlullah (Sallallahu Aleyhi ve Sellem) başına gelecek bir belâ ile birlikte seni cennetle müjdeliyor, dedim. O da girdi. Fakat kuyu kenarını dolmuş buldu. Ve öbür taraftan onların karşılarına oturdu. Şerik demiş ki: Said b. Müseyyeb: Ben bunu kabirlerine yordum, dedi",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 44
			}
		}
	]
}