{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 623,
			"arabicnumber": "272.02",
			"text": "Bize İshak b. İbrahim ve Ali b. Haşrem tahdis edip dediler ki: Bize İsa b. Yunus haber verdi. (H) Bunu bize Muhammed b. Ebu Ömer de tahdis edip dedi ki: Bize Süfyan tahdis etti. (H) Bize Mincab b. Haris et-Temimi de tahdis etti. Bize İbn Mushir haber verdi. Hepsi A'meş'ten bu isnadta Ebu Muaviye'nin hadisi rivayeti manasında rivayet ettiler. Ancak İsa ve Süfyan'ın hadisi rivayetinde dedi ki: Bu hadis Abdullah'ın arkadaşlarının hoşuna gidiyordu çünkü Cerir'in Müslüman olması Maide suresinin nüzulünden sonra olmuştu. NEVEVİ ŞERHİ AŞAĞIDA DAVUDOĞLU AÇIKLAMA: Bu hadisi Buharî, Tirmizî ve Nesaî «Kitabu's-Salat» da Ebu Davud ile İbni Mace de «Kitabu't-Tahare» da tahric etmişlerdir. Hadis-i şerif mest üzerine mesh'in meşru olduğuna delildir. Hz. Cerir (R.A.)'a «Sen böylenıi yapıyorsun» diye soran zat Hemmam b. Haris'tir. Nitekim Taberani 'nin Cafer b. Haris tarikiyle A'meş'ten rivayet ettiği hadiste ismi tasrih edilmiştir. Hatta hadisin bir tarikinde soran zatın Hz. Cerir'i ayıpladığı zikredilmiştir. Hz, Cerir'in hadisini beğenen cemaat yanında bulunan ashab idi. Cerir de yeni müslüman olmuştu. Onun islamiyeti kabulu Resulullah (Sallallahu Aleyhi ve Sellem)'in dünyadan gittiği seneye tesadüf eder. Hadisin bir rivayetinde: «Abdullah b. Mes'ud'un ashabı bu hadisi beğeniyorlardı» denilmiştir. Müslim'in rivayetinde: «Çünkü Cerir'in İslama girişi Maide suresinin nüzulünden sonra idi», Ebu Davud'un rivayetinde ise: «Bu iş yani Nebi (Sallallahu. Aleyhi ve Sellem)'\\n mestleri üzerine mesh etmesi maide suresinin nüzulündan sonra idi» denilmiş ve Cerîrin «ben ancak maide suresinin nuzulundan sonra müslüman oldum,» dediği rivayet edilmiştir. Tirmizî bu hadisi rivayet ettikten sonra şunları söyler: «Bu hadis müfesserdir. Çünkü mest üzerine meshi inkar edenlerden bazısı tevilde bulunarak ve Nebi (Sallallahu Aleyhi ve Sellem) in mest üzerine mesh etmesi maide süresindeki abdest ayeti inmezden önce idi. Binaenaleyh bu mesele abdest ayeti ile mesh edilmişitr demektedir. İşte Cerir bu hadisinde Nebi (Sallallahu Aleyhi ve Sellem) in Maide suresi indikten sonra mestleri üzerine mesh ettiğini gördüğünü anlatmıştır. İbni Mes'ud'un arkadaşlarının Cerir hadisini beğenmeleri bu te'vücilere red cevabını teşkil ettiğindendir.» Abdest ayetinden murad ! ... «Yüzlerinizi yıkayın, (ellerinizi de dirseklerinizle beraber yıkayın...» ayet-i celilesidir. Eğer Cerir (R.A.)'ın müslümanlığı kabulü bu ayetin nüzulünden önce olsaydı o zaman mest üzerine mesih meselesinin bu ayetle mensub olması mevzu bahis edilebilirdi. Fakat onun islamiyeti kabulü ayet-i kerimenin nüzulünden sonradır. Binaenaleyh neshe imkan yoktur. Hadisle amel etmek icab eder. Beyhakînin «Sünen» inde İbrahim b. Ethem (R.A.) in: «Mestler üzerine mesh hususunda Cerir (R.A.) hadisinden daha güzel bir şey işitmedim» dediği rivayet olunuyor. Mest üzerine mesh babında bir çok hadisler varid olmuştur. Bunların sayısı bir çok ulemaya göre tevatür derecesini bulmaktadır. İmam Ahmed b. Hanbel'den Meymuni'nin rivayetine göre mest üzerine meshin meşru olduğunu otuz yedi sahabi yine İmam-i Ahmed'den Hasan b. Muhammed'in rivayetine göre kırk; sahabi rivayet etmiştir. Bezzar'ın «Müsned» inde İbni Ebi Hatim'in kırk bir sahabi dediği rivayet olunduğu gibi Hasan-i Basrî'den bunların yetmiş Bedr gazisi olduğu rivayet edilir. İbni Abdilber diyorki: «Sair Bedr ve Hudeybiye gazileri ile onlardan başka Muhacirin ve Ensar, tabiin. İslam aleminin fukahası bilumum ulema ve muhaddisler mest üzerine mesh etmişlerdir. Bunu inkar edenler ancak müslümanların cemaatından ayrılan bid'atçılarla şaşkınlardır.» Bu babtaki hadisler tevatür derecesini bulduğu içindir ki Ebu Hanife mest üzerine meshe inanmayı ehl-i sünnet vel cemaatın şartlarından saymıştır. Hz. İmamın: «Bana gündüzün ziyası gibi aşikar olmadıkça meshe kail olmadım dediği rivayet olunur. Bunu inkar kibar-ı sahabeye muhalefet ve onları hataya nisbet ma'nasını taşıdığından bid'attır. Hatta Kerhi! «Mest üzerine meshi caiz göremeyenin küfründen korkarım» demiştir. Mesih babında Nevevide şunları söylüyor, «Seferde olsun hazarda olsun ve keza ihtiyar bulunsun bulunmasın mest üzerine mesh etmenin caiz olduğuna sözüne itimad edilir ulema icma' etmişlerdir. Hatta evinden çıkmayan kadına ve yürüyemiyen kötürüme dahi bu caizdir. Onu yalnız şiilerle hariciler inkar etmiştir ki; onların hilafıda nazar-ı itibar-a alınmaz. îmam-ı Malik (R.A.)'den bir kaç kavil rivayet edilmiştir. Meşhur kavle göre; onun mezhebide cumhur-u ulemanın mezhebi gibidir. Mest üzerine meshi ashabtan sayılmayacak kadar çok zevat rivayet etmişlerdir.» Nevevî sözüne devamla: «Ulema mest üzerine meshmi yoksa onları çıkarıp yıkamakmı efdal olduğunda ihtilaf etmişlerdir. Bizim ulemamıza göre ayakları yıkamak efdaldır. Çünkü asıl olan budur. Ashab-i kiramdan bir cemaatta buna kaildir ki Ömerü'bnü'l-Hattab, oğlu Abdullah ve Ebu Eyyub el-Ensarî (R.A.) bunlar meyanındadir. Tabiinden bir çokları meshin efdal olduğuna kaildirler. Şa'bî, Hakem ve Hammad'ın Mezhebleride budur. İmam Ahmed'den iki rivayet vardır. Esah rivayete göre mesh efdaldir. İkinci rivayete göre mest üzerine mesh ile ayakları yıkamak hükmen müsavidirler. İbni'I Münzir'de bu kavli ihtiyar etmiştir.» NEVEVİ ŞERHİ: İcmada sözüne itibar edilir kimseler, seferde olsun, mukimken olsun, ihtiyaç olsun olmasın mestler üzerine mesh etmesinin caiz olduğu üzerinde icma etmişlerdir. Hatta evinden dışarı çıkmayan kadının, yürümeyen kötürümün dahi mesh etmesi caizdir. Ancak şia ve hariciler bunu inkar etmişlerdir. Onların muhalefetinin ise bir değeri yoktur. Malik -Allah'ın rahmeti üzerine-'den bu hususta çeşitli rivayetler nakledilmiştir. Ancak onun mezhebinden meşhur olan görüşü büyük çoğunluğun kabul ettiği gibidir. Mestler üzerine mesh etmeyi ashab-ı kiram'dan sayılamayacak kadar kişi rivayet etmiştir. Hasan-ı Basri (rahimehul1ah) dedi ki: Resulullah (Sallallahu aleyhi ve Sellem)'in ashabından yetmiş kişi Resulullah (Sallallahu aleyhi ve Sellem) mestler üzerine mesh ederdi, diye bana tahdis ettiler. Ben el-Mühezzeb Şerhinde onu rivayet eden ashab-ı kiram'dan pek çok kişinin isimlerini açıklamış ve bu hususta oldukça nefis bilgiler kaydetmiş bulunmaktayım. Başarı Allah'tandır. İlim adamları mestler üzerine mesh etmek mi faziletlidir yoksa ayakları yıkamak mı faziletlidir hususunda ihtilaf etmişlerdir. Bizim (Şafii) mezhebimizin kanaatine göre ayakları yıkamakdaha faziletlidir çünkü aslolan odur. Aralarında Ömer b. el-Hattab, oğlu Abdullah ve Ebu Eyyub el-Ensari (r.a.)'ın da bulunduğu ashab-ı kiram'dan pek çok kimse de bu kanaati benimsemiştir. Tabiinden pek çok kimse de mestler üzerine mesh etmenin daha faziletli olduğu kanaatindedir. Şa'bi, Hakem ve Hammad bu kanaattedir. İmam Ahmed' den iki rivayet nakledilmiştir. İkisinden daha sahih olan mesh etmenin daha faziletli olduğudur, ikinci rivayete göre her ise ikisi de aynıdır. İbnu'l-Münzir de bu görüşü tercih etmiştir. Allah en iyi bilendir. \"Bu hadis hoşlarına gidiyordu ... \" Yani yüce Allah Maide suresinde: \"Yüzlerin izi ve dirseklere kadar ellerinizi yıkayın. Başlarınıza mesh edin, her iki topuğunuza kadar da ayaklarınızı (yıkayın}.\" (Maide, 5/6) buyurmaktadır. (3/164) Şayet Cerir'in Müslüman olması Maide suresinin nüzulünden önce olmuş olsaydı onun mestler üzerine mesh etmeye dair rivayet ettiği bu hadisin Maide suresindeki ayet ile nesh edilmiş olma ihtimali olurdu. Onun Müslüman olması Maide suresinden sonra meydana geldiğine göre onun rivayet ettiği hadis ile amel edildiğini öğrenmiş olduk, ayrıca bu hadis, Maide suresinde kastedilen kimsenin mestli olmayan kimse olduğunu da beyan edip, açıklamaktadır. Bu durumda sünnet bu ayeti tahsis eden bir ayettir. Allah en iyi bilendir. Beyhaki'nin Süneninde İbrahim b. Edhem'den şöyle dediğini rivayet etmekteyiz: Mestler üzerine mesh etmek hakkında Cerir (r.a.)'ın rivayet ettiği hadisten daha güzelini hiç duymadım. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 90
			}
		}
	]
}