{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 627,
			"arabicnumber": "274.02",
			"text": "Bunu bize Muhammed b. el-Müsenna da tahdis etti. Bize Abdulvehhab tahdis edip dedi ki: Ben Yahya b. Said'i bu isnad ile rivayet ederken dinledim ve: Yüzünü ve ellerini yıkayıp, başına mesh etti (3/66) Sonra mestler üzerine mesh etti dedi. NEVEVİ ŞERHİ: \"Bize Leys, Yahya b. Sa'd'dan haber verdi ... Babası el-Muğire'den\" (3/167) Bu senette biri diğerinden rivayet nakleden tabiinden dört zat bulunmaktadır. Bunlar Yahya b. Said el-Ensari, Sa'd, Nafi' ve Urve'dir. Muğire'nin mim harfinin ötreli (Muğire) ve kesreli (Miğire) şeklinde okunduğu daha önceden geçmişti. Allah en iyi bilendir. \"Urve b. el-Muğire'den, o babası Muğıre b. Şu'be'den ... Bir rivayette ise \"hıyne\" kelimesinin yerine \"hatta\" kullandı.\" \"Muğire ... arkasından gitti\" ifadesi Urve'nin babasından naklettiği bir rivayettir. Bu gibi rivayetler hadis-i şerifte çokça görülür, ravi gaib kip ile kendisinin adına kullanacağı bir lafzı rivayet naklettiği kişi hakkında aktarır. İdave (inatara), testi, matara ve mıdae denilen ibrik anlam itibariyle birbirine yakın lafızlardır. Abdest almak için kullanılan kap demektir. \"İhtiyacını bitirince üzerine su döktü.\" İhtiyacını gördüğü yerden ayrılıp, bir başka yere geçince üzerine abdest için su döktü demektir. \"Bitirinceye kadar\" rivayetine gelince, muhtemelen de bunun anlamı abdest alırken abdestini bitirinceye kadar üzerine su döktü, demektir. Bu durumda ihtiyaçtan maksat abdest almak olur. Zaten diğer rivayette ona su dökmesinin ihtiyacını görüp, dönmesinden sonra olduğu beyan edilmiştir. Allah en iyi bilendir. Bu hadiste abdest alırken başkasından yardım almanın caiz oluşuna delil bulunmaktadır. Yine bu husus Üsame b. Zeyd (r.a.)'ın rivayet ettiği hadiste de sabittir. Onun rivayetine göre o Resulullah (Sallallahu aleyhi ve Sellem) Arafat'tan döndüğü sırada abdest alırken eline su dökmüştür. Bununla birlikte abdest alırken yardım almanın yasaklandığı sabit olmayan çeşitli hadislerde gelmiş bulunmaktadır. Mezhep alimlerimiz der ki: Yardım almak üç türlüdür: 1 - Suyun hazır edilmesinde başkasından yardım almak.Bunda bir mekruhluk, bir eksiklik yoktur. (3/168) 2- Abdest azalarını yıkarken başkasından yardım istemesi ve bu başkasının abdest azalarını bizzat yıkaması. Bu ihtiyaç duyulması hali dışında mekruhtur. 3- Başkasının ona su dökmesi.Bunun da terk edilmesi evladır. Peki, buna mekruh denilebilir mi bu hususta iki görüş vardır. Mezhep alimlerimiz ve başkalarının dediğine göre kişi abdest alana su dökecek olursa abdest alan kimsenin sol tarafında durur. Allah en iyi bilendir .. DAVUDOĞLU AÇIKLAMA: Bezzar, bu hadisi Hz. Muğîre'den altmış zatın rivayet ettiğini söyler. Kıssa Tebuk Gazasında cereyan etmiştir. Abdest ayeti ise; Mureysî Gazasında inmişti. Tebuk Gazası-Müreysî'den muhakkak sonradır. Şu halde Cerir (R.A.)'in Hadisi gibi Hz. Mugire hadisi dahi mest üzerine mesih hükmünün ayetle neshedilmediğini gösterir. «Mugira içinde su bulunan bir kapla onu takib etmiş» sözü Mugira'nın Oğlu Urve'nindir. Bu gibi ibarelere hadislerde çok tesadüf edilir. Ravî kendini ben diyerek göstermezden gaib sığası ile ifade eder. Burada da Urve: «Babam onu takib etmiş» diyecekken Muhaddislerin adetine uyarak Mugira onu takip etmiş demiştir. İdave: İbrik ve desti gibi küçük kaptır. Hadiste'nde anlaşıldığı vecihle Hz. Mugire Nebi (Sallallahu Aleyhi ve Sellem)'e abdest alırken su dökmüştür. Hadisin bir rivayetinde «suyu hacetini bitirinceye kadar döktü» denilmiştir. Bundan ResuIullah (Sallallahu Aleyhi ve Sellem)'e istinca esnasında su döktü manası anlaşılmamalıdır. Zira her iki rivayette de hacetten murad abdesttir. Nitekim bundan sonraki rivayette su dökme işinin kaza-i hacetten dönüp geldikten sonra abdest alırken vaki olduğu tasrih edilmiştir. Hadis-i Şerif abdest almak için başkasından yardım istemenin caiz olduğuna delildir. Nevevî diyorki: «Usametü'bnü Zeyd (R.A.)'in ResuIullah (Sallallahu Aleyhi ve Sellem)'e Arafattan dönüşünde abdest alırken su döktüğü dahi sabit olmuştur. Subut bulmayan bazı hadislerde yardım istemenin nehiy edildiği görülmektedir. Ulemamız abdest almak için, yardım istemenin üç kısım olduğunu beyan ediyor. Bunlardan. Birincisi: Başkasından kendisine abdest suyu getirmesini istemektir. Bunda hiç bir kerahet ve noksanlık yoktur. İkincisi: Abdest uzuvlarını başkasına yıkatmaktır. İhtiyaç olmadıkça bunu yapmak mekruhtur. Üçüncüsü: Abdest alırken suyu başkasına döktürmektir. Bunu yapmamak evladır. Mekruh olup olmaması hususunda iki kavil vardır. Ulemamıza ve sair ulemaya göre abdest alırken su döken kimse abdest alanın soluna duracaktır",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 94
			}
		}
	]
}