{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6272,
			"arabicnumber": "2431",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb rivâyet ettiler. (Dediler ki): Bize Veki' rivâyet etti. H. Muhammed b. Müsenna ile İbn Beşşâr da rivâyet ettiler. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. Bunların hepsi Şu'be'den Rivâyet etmişlerdir. H. Ubeydullah b. Muâz El-Anberî dahi rivâyet etti. Lâfız onundur. ki): Bize babam rivâyet etti. ki): Bize Şu'be Amr b. Mür-ra'dan, o da Mürra'dan, o da Ebû Mûsa'dan naklen rivâyet etti. Ebû Mûsa şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem); kemâle erenler çoktur. Kadınlardan ise Meryem binti Imran ile Fİr'avn'ın karısı Âsiye'den başka kemâle eren yoktur. Kadınlar üzerine Âişe'nin üstünlüğü tiridin sâîr yiyecekler üzerine üstünlüğü gibidir.» buyurdular. hadîsi Buhârî «Kitâbu'l-Enbiya» ile «Kitâbu'l-Et'ime»ıde; Tirmizî ile İbn Mâce «Kitâbu'l-Et’ıme»'de; Nesâî «Me-nâkıb» ve «Îşretü'n-Nisâ» bahislerinde tahric etmişlerdir. bununla istidlal ederek Âsiye ile Meryem'in Peygamber olduklarını söylemiş ve: «Çünkü insan nev'inin en kemâllileri Peygamberlerdir. Sonra veliler, sıddıklar ve şehidler gelir. Âsiye ile Meryem Peygamber olmasalar, kadınlar içerisinde hiç bir velî, sıddîk ve şehid bulunmamak lâzım gelir. Hakikatte ise bu sıfatlar birçok kadınlarda bulunmaktadır. Peygamber (sallallahü aleyhi ve sellem) bu hadîsinde kadınlardan Âsiye ile Meryem'den başka Peygamber olan yoktur buyurmuş gibidir.» demişlerse de bu mütalâa kabul edilmemiş, kendilerine şöyle cevab verilmiştir: Kemâl sözünden onların peygamber olması lâzım gelmez. Çünkü bu söz birşeyin tamamına ve kendi nev'inde son dereceye vardığı mânâsında kullanılır. Burada murad Âsiye ile Meryem'in kadınlar arasında bütün faziletlerin en üstün derecesine vardıklarını anlatmaktır. «Kadınlardan Peygamber gelmediğine icma naklolun-muştur.» demiş, buna mukabil İmâm Eş'arî'nin kadınlardan altı Peygamber geldiğini söylediği rivâyet olunmuştur. Bunlar Havva, Sâre , Hazret-i Mûsa'nın annesi, Hâcer, Âsiye ve Meryem'dir. «Sahih kavle göre Hazret-i Meryem Peygamberdir. Çünkü Allah ona melek vasıtasiyle vahy göndermiştir. gelince onun Peygamberliğine delâlet eden bir rivâyet yoktur.» diyor. kadınlardan peygamber gelip gelmediği ihtilaflıdır. Ekser ulema gelmediğine kaildirler. binti Müzâhım, Firavn’ın karışıdır. Rivâyete göre Mûsa (aleyhisselâm) Firavn’ın sihirbazlarına galebe çalınca Âsiye iman etmiştir. Firavn bunu anladığı vakit, onun ellerini, ayaklarını kazıklarla yere çakarak güneşe karşı üzerine büyük bir kaya konmasını emretmiş. Kaya getirildiği vakit Âsiye: «Yarabbi, benim için cennetinde bir ev yap!» diye niyazda bulunmuş. O anda cennette inciden yapılmış evini görmüştür. Allah oracıkta ruhunu kabzetmiş, kaya cansız cesedinin üzerine konmuştur. binti Imran, İsa (aleyhisselâm)’ın annesidir. Kıssası Kur'ân-ı Kerîm'in birçok âyetlerinde ve hadîslerinde tafsilâtiyle beyân edilmiş olup, herkesçe malûm ve meşhurdur. Âişe'ye gelince, hadîs-i şerif'de beyân buyurulan fazileti bu ümmetin kadınlarına nisbetledir. Hattâ efdaliyyetinden bahsedilmemiştir. Çünkü Peygamber (sallallahü aleyhi ve sellem) onun faziletini tiride benzet-mistir. Tirid, şâir yiyeceklere nisbetle Arabların o gün için en makbul yemeklerinden biri idi. Zîra külfeti az, hazmı kolay bir yemekdir. Fakat bu hasletler onun her yönden efdaliyyetini gerektirmez. Hazret-i Âişe meselesi de Öyledir. sahîh hadîslerde Hazret-i Hatice'nin şâir kadınlardan efdal olduğu bildirilmiştir. Hazret-i Hatice ile Fâtıme (radıyallahü anh)'nın başkalarından efdal olduğunu bildiren rivâyetler de vardır",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 102
			}
		}
	]
}