{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6282,
			"arabicnumber": "2437",
			"text": "(Bize Süveyd b. Saîd rivâyet etti. ki): Bize Ali b. Müshir, Hişâm'dan, o da babasından, o da Âişe'den naklen rivâyet etti. (Şöyle dedi): Hatice'nin kız kardeşi Hâle binti Huveylid, Resûlüllah (sallallahü aleyhi ve sellem)'in yanına girmek için izin istedi de, Hatice'nin izin istemesini hatırladı. Ve bundan memnuniyet duyarak: Huveylid'in kızı Hâle!» dedi. Ben derhal kıskandım. Ve: — Allah sana yerine daha hayırlısını vermişken, zaman önce ölmüş Kureyş'in kocakarılarından çenelerinin içi kırmızı bir kocakarıyı île anıp duruyorsun! dedim. (sallallahü aleyhi ve sellem), Hâle binti Huveylid'in sesini işitince, onu Hazret-i Hatice'nin sesine benzeterek sevincinden titremiş ve: bu Hâle'dir.» demiştir. Hazret-i Âişe onu kıskanmış ve hadîsde beyan edildiği vecihle karşılık vermiştir. Kocakarıdan muradı Hatice (radıyallahü anha)'dır. Ağzın kenarları demektir. Bunun kırmızılığından muradı, son derece ihtiyarlamış hattâ ihtiyarlıktan; dişleri dökülmüş de kıpkırmızı yerleri kalmış olduğunu anlatmaktır. Tin diyor ki: «Peygamber (sallallahü aleyhi ve sellem)'in bu söze karşı ses çıkarmaması Âişe'nin Hatice'den efdal olduğuna delildir. Meğer ki, buradaki daha hayırlı tâbirinden şekil güzelliği ve yaş küçüklüğü kastedilmiş olsun.» ile diğer bâzı ulemâ kıskançlığın kadınlarda müsamaha götürdüğünü, bu hâl onların tabiatlarında bulunduğu için azabı mûcib olmadığım, Peygamber (sallallahü aleyhi ve sellem)’in de bundan dolayı Hazret-i Âişe'yi men etmediğini söylemişlerdir. Aynî diyor ki: Şu halde Peygamber (sallallahü aleyhi ve sellem)'in bu söze karşı ses çıkarmaması Hazret-i Âişe'nin Hatice (radıyallahü anha) dan efdal olduğuna delâlet etmez. Maamafih bu söze cevab verdiği de rivâyet olunmuştur. İmâm Ahmed'le Taberanî'nin tahric ettikleri bir hadîsde Hazret-i Âişe şöyle Üemiştir: «Allah senin için yaşlı yerine genci verdi, dedim. Bunun üzerine kızdı. Nihayet ben: Seni hak dinle gönderen Allah'a yemin olsun ki, Hatice'yi bundan sonra ancak hayırla anacağım, dedim.»",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 112
			}
		}
	]
}