{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6290,
			"arabicnumber": "2442.01",
			"text": "Bana Hasen b. Ali El-Hulvâni ile Ebû Bekr b. Nadr ve Abd b. Humeyd rivayet ettiler. Abd: Haddeseni, ötekiler : Haddesenâ tâbrierini kullandılar. (Dedilerki): Bize Ya'kub b. İbrahim b. Sa'd rivâyet etti. (Dediki): Bana babam, Sâlih'den, o da İbni Şihab'dan naklen jivâyet etti. (Demişki): Bana Muhammed b. Abdirralıman b. Haris b.Hişâm haber verdi ki: Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Aişe şunu söylemiş: Nebi (Sallallahu Aleyhi ve Sellem)'in zevceleri, Fâtıme binti Resûlullah (Sallallahu Aleyhi ve Sellem)'i, Resûlullah (Sallallahu Aleyhi ve Sellem)'e gönderdiler. O da yanına girmek için izin istedi. Kendisi benimle beraber örtünün altında uzanmıştı. Ona izin verdi, Fâtıme: — Yâ Resûlallah! Zevcelerin beni sana gönderdiler. Senden Ebû Kuhafe'nin kızı hakkında müsavat istiyorlar, dedi. Ben susuyordum. Resûlullah (Sallallahu Aleyhi ve Sellem) de ona: «Ey kızcağızım! Sen benim sevdiğimi sevmez misin?» dedi. Fâtıme: — Hay hay! (Severim) dedi. «O halde bunu sev!» buyurdular. Fâtıme Resûlullah (Sallallahu Aleyhi ve Sellem)'den bunu işitince kalktı ve Peygamher (Sallallahu Aleyhi ve Sellem)'in zevcelerine dönerek onlara kendi söylediğini ve kendisine Resûlullah (Sallallahu Aleyhi ve Sellem)'in söylediğini haber verdi. Onlar da kendisine şunu söylediler: — Bize hiç bir şey yaptığını görmüyoruz. Hemen Resûlullah (Sallallahu Aleyhi ve Sellem)'e dön ve ona: Gerçekten zevcelerin Ebû Kuhafe'nin kızı hakkında senden müsavat istiyorlar de! Fâtıme : — Vallahi onun hakkında ben kendisine ebediyyen söz etmem, dedi. Âişe şunları söylemiş: Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem)'in zevceleri onun zevcesi Zeyneb binti Cahş'ı gönderdiler. Resûlullah (Sallallahu Aleyhi ve Sellem)'in katında mertebece onlardan bana rakib olan da bu idi. Din hususunda Zeyneb'den daha hayırlı hiç bir kadın görmedim. Allah'dan onun kadar korkan, onun kadar doğru söyleyen, onun kadar sılayı rahim yapan, ondan çok sadaka veren, verdiği sadakada nefsini onun kadar horlayıp, o amelle Allah Teâlâ'ya yakınlık gösteren yoktu. Ancak mizacındakİ hiddetten nâşi bir kükremesi vardı ki, ondan da çabuk dönerdi. Zeyneb, Resûlullah (Sallallahu Aleyhi ve Sellem)'in yanına girmek için izin istedi. Resûlullah (Sallallahu Aleyhi ve Sellem) işe Âişe ile beraber onun örtüsünün altında Fâtıme'nin girdiği zamanki halde bulunuyordu. Resûlullah (Sallallahu Aleyhi ve Sellem) ona da izin verdi. Zeyneb: — Yâ Resûlallah! Zevcelerin beni sana gönderdiler; Ebû Kuhâfe'nin kızı hakkında senden müsavat istiyorlar, dedi. Sonra bana atıp tuttu ve hakkımda sözü uzattı. Ben Resûlullah (Sallallahu Aleyhi ve Sellem) gözetiyor; bana onun hakkında konuşmaya izin verecek mi diye gözüne bakıyordum. Zeyneb devam etti. Nihayet anladım ki, Resûlullah (Sallallahu Aleyhi ve Sellem) benim kendimi müdafaa etmemi kerih görmeyecek. Zeyneb'e ben atıp tutmaya başlayınca, ona yaptığım hücumda kendisine aman vermedim. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) gülümseyerek: «Bu Ebû Bekr'in kızıdır!» buyurdular",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 120
			}
		}
	]
}