{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6305,
			"arabicnumber": "2448.01",
			"text": "Bize Ali b. Hucur Es-Sa'di ile Ahmed b. Cenab ikisi birden İsa'dan rivayet ettiler. Lâfız İbni Hucur'undur. (Dedilerki): Bize İsâ b. Yûnus rivayet etti. (Dediki): Bize Hişâm b. Urve kardeşi Abdullah b. Urve den, o da Urve'den, o da Âişe'den naklen rivayet etti ki, şöyle demiş: — Onbir kadın oturmuşlar da kocalarının haberlerinden hiç bir şeyi gızlememeye ahdü peyman etmişler. Birincisi: Benim kocam sarp dag başında arık deve etidir. (Dağ) Düz değildir, ki çıkılsın! (Deve) Semiz değildir ki götürülsün! demiş. ikincisi: Kocamın haberini ifşa edemem, çünkü korkarım. O,nu (bitirmeden) bırakamam. Onu anarsam irisini ufağını söylerim, demiş. Üçüncüsü: Kocam uzun boyludur. Konuşursam boşanırım, susarsam muallakta bırakılırım, demiş. Dördüncüsü: Kocam tihâme gecesi gibidir. Ne sıcaktır, ne soğuk, (Ondan) Ne korkulur, ne bıkılır! demiş. Beşincisi: Kocam (içeri) girerse pars; (dışarı) çıkarsa arslan kesilir. Emniyet ettiği şeyi sormaz, demiş. Altıncısı: Kocam yerse dürer, içerse sömürür. Yatarsa sarınır. Kederi anlamak için elini sokmaz! demiş. Yedincisi: Kocam tohumsuzdur. Yahut karanlıktır. (Ahmaklığından) İşleri üzerine yığılmıştır. Her dert onu bulur. Baş yarığı mı yahut kol kırığı mı istersin. Yahut ikisini de sana bir araya toplayıversin! demiş. Sekizincisi: Kocamın kokusu za'feran, teni de tavşandır! demiş. Dokuzuncusu: Kocam direği yüksek, kını uzun, külü çok, evi meclise yakın bir adamdır, demiş. Onuncusu : Kocam Mâlik'dir. Amma ne Mâlik! Mâlik bundan çok daha hayırlıdır. Onun çok çöken, az dolaşan develeri vardır. Ud sesini işittiler mi helak olduklarını anlarlar, demiş. Onbirincisi: Kocam Ebû Zer'dir. Amma ne Ebû Zer! Zinetten kulaklarımı şakırdattı. Bazularımı yağla doldurdu. Beni sevindirdi. Benim de gönlüm ferah oldu. Beni dağ başında bir koyun sürücüğü sahibinde buldu da at kişnemesine ve deve sesine sâhib harman döğen, tınas savuran bir aileye kattı. İşte onun yanında konuşuyor, burunlanmıyorum; uyuyor sabahlıyorum; içiyor ve kanıyorum. Ebû Zer'in annesi de ne Ehû Zer annesi! Ambarları büyük, evi geniş.,. Ebû Zer'in oğlu da oe Ebû Zer oğlu! Yatağı soyulmuş hurma lifi gibi. Kendisini bir kuzunun budu doyurur. Ebû Zer'in kızı da ne Ebû Zer kızı! Anasına, babasına muti. Çarşaf dolusu ortağını çatlatan takımından... Ebû Zer'in cariyesi de ne Ebû Zer cariyesi! Bizim lâflarımızı (ortalığa) yaymaz. Zahiremizi döküp, saçmaz. Evimizi de kuş yuvasına çevirmez. Tulumlarımızda süt çalkalanırken Ebû Zer çıktı (gitti). Ve bir kadına rastladı ki, yanında pars gibi iki çocuğu var. Böğrünün altındaki iki nar tanesiyle oynuyorlar. Hemen beni boşayıp onu nikahladı. Ben de ondan sonra eşraftan bir adama kocaya vardım ki, yürüyüşlü bir ata biner. Eline Hatti mızrak alır. Evime birçok develer getirir. Bana her hayvandan bir Çift verdi: — Ye Ümmü Zer! Akrabana da ver! dedi. Ama onun bana verdiği her şeyi toplasam Ebû Zer'in kaplarının en küçüğünü doldurmaz, demiş, Âişe şunu söylemiş: Resûlullah (Sallallahu Aleyhi ve Sellem) bana: «Ben senin için Ummü Zer'e nisbette Ebû Zer' gibiyim.» buyurdular",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 135
			}
		}
	]
}