{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 631,
			"arabicnumber": "274.06",
			"text": "Bize Muhammed b. Abdillah b. Nümeyr rivayet etti. (Dediki) : Bize babam rivayet etti. (Dediki): Bize Zekeriyya, Amir'den naklen rivayet etti. Demişki Bana Urve b. Mugire babasından naklen haber verdi. Babası şöyle demiş: Bir gece bir yolculukta Nebi (Sallallahu aleyhi ve Sellem) ile birlikte idim. Bana: \"Yanında su var mı\" buyurdu. Ben, evet dedim. Bineğinden indi ve gece karanlığında kayboluncaya kadar yürüdü. Sonra geri geldi, ben de mataradan eline su döktüm. Yüzünü yıkadı üzerinde yünden bir cübbe vardı. Kollarını ondan çıkartamayınca sonunda kollarını cübbenin altından çıkardı ve kollarını yıkayıp, başına mesh etti, sonra mest1erini ayaklarından çıkarmak için eğildim, \"onları bırak, çünkü ben onları abdestli iken giyinmiştim\" buyurdu ve üzerlerine mesh etti. Diğer tahric: Buhari, 182 -buna yakın-, 203 -buna yakın-, 206, 4421 -uzunca-, 5799 -uzunca-; Müslim, 951; Ebu Davud, 149, 151 -uzunca-; Nesai, 79, 82 -uzunca-, 124; İbn Mace, 545; Tuhfetu'l-Eşraf, 11514 NEVEVİ ŞERHİ: \"Bana Muhammed b. Abdullah b. Numeyr tahdis etti ... Amr b. Muğıre babasından haber verdi.\" Bu senetteki bütün raviler KOfelidir. \"Ben mestlerimi ayaklarım temizken giyindim.\" Mestler üzerine mesh etmenin ancak onları tam bir taharet hali üzere giymesi halinde caiz olduğuna delil vardır. Bu da abdesti tamamen bitirdikten sonra mest1eri giyinmesiyle olur. Çünkü mest1eri taharet üzere giymenin gerçek hali her bir tekinin temiz iken giyilmiş olması ile mümkündür. İlim adamları bu mesele hakkında ihtilaf etmişlerdir. Bizim mezhebimize göre mest1erin tam bir taharet hali üzere giyilmesi şarttır. Öyle ki sağ ayağını yıkayıp, onun tekini giyinse sonra da sol ayağını yıkayıp onun tekini giyinse sağ ayağın tekini giymesi sahih olmaz. Bu durumda mutlaka onu ayağından çıkartıp yeniden giyinmelidir, solu çıkartmasına ise gerek yoktur çünkü sol ayağın teki taharetin tamamlanmasından sonra giyilmiştir. Bazı mezhep alimlerimiz istisna olarak sol tekin de çıkartılmasını vacip görmüşlerdir. Sözünü ettiğimiz mest1erin giyilmesinde taharetin bu şekilde şart olması aynı zamanda Malik, Ahmed ve İshak'ın da kabul ettiği görüştür. Ebu Hanife, Süfyan es-Sevrl, Yahya b. Adem, el-Müzenı, Ebu Sevr ve Davud ise abdestini tamamlamadan mest1erini giyinmesi caizdir, daha sonra abdestini tamamlar demişlerdir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 98
			}
		}
	]
}