{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6316,
			"arabicnumber": "2452",
			"text": "(Bize ETıû Ahmed Mahmud b. Gaylân rivâyet etti. ki):-Bize Fadl b. Mûsa Es-Sınânî rivâyet etti. ki) ; Bize Talha b. Yahya b. Talha, Âişe binti Talha'dan, o da Ümmü'l-Mü'minin Âişe'den naklen rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): bana en çabuk kavuşacak olanınız, kolu en uzun olanınızdır.» buyurdular, ki: Artık kadınlar hangisinin kolu en uzun olduğunu ölçüyorlardı. Kolu en uzun olanımız da Zeyneb idi. Çünkü Zeyneb eliyle çalışır ve sadaka verirdi. hadîsi Buhârî ile Nesâî «Kitâbu'z-Zekâ'da tahric etmişlerdir. rivâyetinde Resûlüllah (sallallahü aleyhi ve sellem)’in zevcelerinden bazılarının ona: Bizim hangimiz sana önce kavuşacak? diye sordukları, onun da: en uzun olanınız...» cevabını verdiği, sonra bir kamışla birbirlerinin kollarını ölçtükleri ve neticede Sevde binti Zem'a'nın en uzun kollu çıktığı bildirilmektedir. Fakat Nevevî, Hazret-i Sevde'nin burada bir vehm olarak yanlışlıkla zikredildiğini, bunun brlicma bâtıl olduğunu söylemiştir. Yine Nevevî'nin beyânına göre Resûlüllah (sallallahü aleyhi ve sellem)’in kendisinden sonra hayatta kalan zevcelerinden ilk vefat edeni Hazret-i Zeyneb'dir. Bâbımızın hadîsinden de anlaşıldiğı vecihle kıssanın sahibi odur. Ezvac-ı Tâhirat Resûlüllah (sallallahü aleyhi ve sellem)’in sözünü hakikî mânâya hamlederek birbirlerinin kollarını kamışla ölçmüşler. Hazret-i Sevde'nin kolları hepsinden uzun gelmiştir. Halbuki Resûlüllah (sallallahü aleyhi ve sellem)’in muradı azanın uzunluğu değil, sadaka vermektir. Bu hususta kolu en uzun olan ise Hazret-i Zeyneb'dir. Arablar bir kimsenin cömertliğini ifade etmek için filânın kolu uzundur yahut eli uzundur, derler. Cimriliğini anlatmak için de: Filânın eli veya kolu kısadır tâbirini kullanırlar. Lisânımızda eli uzundur tâbiri, hırsızlık eder mânâsında kullanılır. Cömertliğini anlatmak için biz «Filânın eli açıktır», cimriliği için de «Eli sıkıdır» gibi tâbirler kullanırız. Zeyneb binti Cahş (radıyallahü anh) el işleri yapar, kazandığını Allah yolunda tasadduk ederdi. Bu husûsda Ezvâc-ı Tâhirat içerisinde temayüz etmişti. Nitekim hepsinden evvel o vefat etmiş, bu suretle Resûlüllah (sallallahü aleyhi ve sellem)’in bu mucizesi de anlaşılmıştır",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 146
			}
		}
	]
}