{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 633,
			"arabicnumber": "274.08",
			"text": "Bana Muhammed b. Abdullah b. Bezl' de tahdis etti. Bize Yezid -yani b. Zurey' - de tahdis etti. Bize Humeyd et-Tavıl tahdis etti. Bize Bekr b. Abdullah el-Müzeni, Urve b. Muğıre b. Şu'be'den tahdis etti. O babasından şöyle dediğini nakletti: Resulullah (Sallallahu aleyhi ve Sellem) bir keresinde geri kaldı. Ben de onunla birlikte geri kaldım. İhtiyacını giderdikten sonra: \"Beraberinde su var mı\" buyurdu. Ben de ona bir matara (ibrik) getirdim. Ellerini ve yüzünü yıkadıktan sonra kollarını sıvamak istedi ancak cübbenin yenıeri dar gelince elini cübbenin alt tarafından çıkardı, cübbeyi omuzlarına attı ve kollarını yıkadı. Başının ön kısmına, sarığın ve mestlerinin üzerine de mesh etti sonra o da bineğine bindi, ben de bineğime bindim. Bizimle beraber olanların yanına vardık. Namaza durmuşlardı. Abdurrahman b. Avf onlara namaz kıldırmış ve onlarla birlikte bir re kat kılmış bulunuyordu. Nebi (Sallallahu aleyhi ve Sellem)'i fark edince gerilemeye başladı. (Allah Resulü) ona işaret edince o da onlara kıldırdığı namazını tamamladı. O selam verdikten sonra Nebi (Sallallahu aleyhi ve Sellem) kalkınca ben de kalktım ve bizim yetişemediğimiz rekatı kıldık. Diğer tagric: Müslim, 952; Nesai, 108, 125; Tuhfetu'l-Eşraf, 11495 DAVUDOĞLU ŞERHİ AŞAĞIDA NEVEVİ ŞERHİ: \"Bize Muhammed b. Abdullah b. Bezl'de tahdis etti. .. babasından şöyle dediğini nakletti.\" Hafız Ebu Ali el-Gassanıdedi ki: Müslim, İbn Bezl', Yezid b. Zurey'den, o Urve b. el-Muğire'den diye rivayet edilen hadisi bu şekilde diyerek rivayet etmekte olup, insanlar ona muhalefette bulunmuş ve bu hadisi rivayetlerinde \"Urve\" yerine Hamza b. Muğıre demişlerdir. Ebu'l-Hasan ed-Darakutni ise buradaki yanılmanın Müslim'den değil, Muhammed b. Abdullah b. Bezı'den kaynaklandığını söylemiştir. el-Gassani'nin ifadeleri burada sona ermektedir. Kadı İyaz da şöyle diyor: Bu hadisin rivayetinde hadis alimlerine göre doğrusu Hamza b. Muğ1re olduğudur. Urve b. Muğıre ise diğer hadiste geçmektedir. Hamza ve Urve ise Muğire'nin iki oğlunun adıdır. Hadis her ikisinden de rivayet edilmiştir ama Bekr b. Abdullah b. el-Müzenl'nin rivayeti ancak Hamza b. Muğıre ile ismi verilmeksizin İbn el-Muğire'den diye gelmektedir. Bekr b. Urve deyip, ismini vermez. Ondan nakledilen rivayette Urve diyen kimseler yanılmış olurlar. Aynı şekilde rivayetin Bekir' den gelişinde de ihtilaf vardır. Bunu Mu'temir ondan gelen iki vecihten birisinde Bekir' den, o el-Hasan'dan, o İbn el-Muğire'den diye rivayet etmiştir. Yahya b. Said de et-Temiml'den böylece rivayet etmiş ve bunu da Müslim zikretmiştir. Başkaları ise Bekr' den, o elMuğire' den diye nakletmişlerdir. Darakutni ise bu bir vehimdir demiştir. Kadı İyaz'ın sözleri de burada sona ermektedir. Allah en iyi bilendir. \"Ona bir matara (ibrik) götürdüm.\" Az. önce bunun mathara ve mithara söyleyişlerinin ve kendisi ile taharet alınan kap demek olduğunu belirtmiş idik. \"Kollarını sıvamak istedi.\" (3/171) Yani kollarını açmaya çalıştı. Allah en iyi bilendir. \"Başının ön kısmına ve sarığına mesh etti.\" Bu bizim mezhep alimlerimizin başın bir kısmına mesh etmenin yeterli olup, tümünü mesh etmenin şart olmadığına dair gösterdikleri delillerden birisidir. Çünkü başın tamamını mesh etmek vacip olsaydı, geri kalan kısmı için sarığı mesh etmekle yetinmezdi, çünkü aynı azada hem asıl, hem bedelin birlikte yapılması -mesela, bir meste mesh ederken, diğerinin ayağını yıkaması gibi caiz değildir. Sarığın mesh etmek suretiyle meshi tamamlamasına gelince,Şafii ve bir topluluğun kanaatine göre başın tamamının abdestte temizlenmiş olması için müstehap kabul edilmiştir. Sarığı başına abdestli ve abdestsiz olarak koymuş olmasının bir farkı yoktur. Aynı şekilde eğer başında takke (ve benzeri) varsa ve onu çıkarmazsa başının ön tarafına mesh eder. Sarık gibi takkenin üzerini de mesh ederek meshi tamamlaması müstehaptır. Şayet sadece sarığı mesh etmekle yetinir ve başın hiçbir kısmını mesh etmeyecek olursa bizim mezhebimize göre ihtilafsız olarak caiz değildir. Malik, Ebu Hanife ve ilim adamlarının çoğunluğunun -yüce Allah'ın rahmeti onlara- görüşü de budur. Ancak Ahmed b. Hanbel -yüce Allah'ın rahmeti onayalnızca onunla yetinmenin caiz olacağı kanaatindedir. Seleften bir topluluk da bu hususta ona muvafakat etmiştir. Allah en iyi bilendir. Nasiye, başın ön tarafına denilir. \"Yanlarına vardık. .. yetişemediğimiz rekatı kıldık.\" Bu Hadisten Çıkartılacak Pek Çok Hüküm Vardır. Bunların Bir Kısmı Şöyledir: 1- Daha faziletli olanın kendisinden daha az faziletli olana uyması caizdir. Nebinin de ümmetinden bir kişinin arkasında namaz kılması caizdir. 2- Efdal olan namazı ilk vaktinde kılmaktır. İşte onlar namazı ilk vaktinde kıldılar ve Nebi (Sallallahu aleyhi ve Sellem)'i de beklemediler. 3- İmam namazın ilk vaktinde bulunmayıp, gecikecek olursa cemaat de asıl imam'ın güzel ahlakından ve bundan rahatsız olmayıp, bunun bir fitne doğurmayacağından emin olmaları halinde kendilerine namaz kıldırmak üzere aralarından birisini öne geçirmeleri cemaat için müstehaptır. Ama onun rahatsız olmayacağından emin değilseler, vaktin ilk girişinde tek tek namazıarını kılarlar. Bundan sonra eğer cemaate yetişecek olurlarsa, cemaat1e birlikte namazıarını iade etmeleri müstehap olur. (3/172) 4- İmama namazın bir kısmını kıldırdıktan sonra yetişen kişi yetiştiğini kılar. İmam selam verdikten sonra geriye kalanı tamamlar, çünkü bu geri kalan onun üzerinden (başka türlü) sakıt olmaz. Ancak Fatiha'nın kıraati böyle değildir çünkü kişi imama rükGda iken yetişecek olursa Fatiha yükümlülüğü kalkar. 5- Mesbuk (imama sonradan yetişen kişi) rükG, sücud ve oturuş gibi fiillerinde imama tabi olur. İsterse bu fiiller imama uyanın o sırada yapması gereken fiiller olmasın. 6- Mesbuk imamdan ancak imamın selam vermesinden sonra ayrılmış olur. Allah en iyi bilendir. Abdurrahman'ın namazına devam etmesi ile Ebu Bekr es-Sıddık'ın -Allah ikisinden de razı olsun- Nebi (Sallallahu aleyhi ve Sellem)'in öne geçmesi için gerilemeye çalışması arasındaki fark şudur: Abdurrahman'ın namazı kıldırması esnasında bir rekat kılmış bulunuyordu. Bu bakımdan imama uyanların namaz rekatları sıralaması bozulmaması için Nebi (Sallallahu aleyhi ve Sellem) öne geçmemiştir. Halbuki Ebu Bekr (r.a.) ile ilgili mesele böyle değildir. Allah en iyi bilendir. \"Yetişemediğimiz rekatı kıldık.\" Asıl yazmalarda bu şekilde tespit edilmiştir ki biz orada bulunmadan önce kılınmış olan rekatı kıldık, demektir. Allah en iyi bilendir . DAVUDOĞLU AÇIKLAMA: Müslim'den başka hadis imamları bu hadisin senedinde ona muhalefet ederek Urvetü'bnü Mugira'nın yerine Hamzatu'bnü Mugîre'yi zikretmişlerdir. Dare Kutnî buradaki hatayı Müslim'e değil raviierden Muhammed b. Abdillah b. Bezia nispet etmiştir. Kaadi Iyaz dahi: «Muhaddislerce sahîh olan kavle göre bu senetteki ravi Hamzetü'bnü Mugire başka hadislerde olacaktır. Haraza ile Urve Muğîre'nin iki oğludurlar. Bu hadis onların ikisindende rivayet edilmiştir. Lakin Bekr b. Abdillah el-Müzenî'nin rivayeti yalnız Hamzatü'bnü Mugîre'dendir. Birde isim zikretmeden İbnü'l-Muğire diyerek rivayette bulunmuştur. Urve dememiştir. Onun Urve 'den rivayet ettiğini söyleyen hata etmiştir. Bekr 'den gelen rivayet te ihtilaflıdır. Rivayetin birine göre Mu'temir Bekr 'den o da Hasen'den oda İbni Mugire 'dan nakletmiştir. Müslim bu rivayeti zikreder. Başkaları ise; Bekr vasıtası ile Mugira 'dan rivayet etmişlerdir. Dare Kutnî bununda vehm olduğunu söyler» diyor. Hadis-i Şerif sarık ile mest üzerine meshin caiz olduğunu bildirmektedir. Sarık üzerine mesh meselesi ulema arasında ihtilaflıdır. İmam Ahmed b. Hambel'e göre; yalnız sarık üzerine mesh caizdir. Ancak sarığın tam abdestli iken sarılmış olması şarttır. Bunu caiz görmeyenler «Başlarınıza mesh edin.» ayet-i kerimesi ile istidlal ederler. Sarık üzerine edilen mesh başa mesh değildir. Ulema teyemmümde yüzün üzerindeki örtüye mesh etmenin caiz olmayacağına ittifak etmişlerdir. Başa meshde öyledir Hattabî (319-388): «Allah başa mesh etmeyi farz kılmıştır. Sarık üzerine meshi bildiren hadis ise; te'vile muhtemildir. Binaenaleyh yakînen malum olan vazife bırakılıpta ihtimalli olanı yapılamaz» demiştir. İbnü'l Münzîr: Ebu Bekr (R.A.)'ın sarığı üzerine mesh ettiğini Ömer, Enes, Ebu Ümame, Sa'd b. Malik, Ebu'd-Derda ve Ömer b. Abdilaziz (R.A.) ile Hasan-ı Basri, Katade,, Mekhul, Evza'î ve Ebu Sevr hazeratının da buna kail olduklarını söylemiştir. Urve, îbrahîm Nehaî. Şabi, Kaasim, İmam-ı Malik, İmam Şafiî 've Hanefîler sarık üzerine meshi caiz görmezler. «El-Muğni» nam-ı eserde şöyle deniliyor. «Sarık üzerine meshin iki şartı vardır. Biri üst çenenin altına kadar inmesidir. Büyük veya küçük olmasının farkı yoktur. İkinci şartı bütün başı kaplamasıdır. Bundan ancak adete göre açılması icab eden kulaklar ve başın ön kısmı gibi yerler müstesnadır. Sarık üzerine mesh ederken başın açık kısımlarını mesh etmekte müstehaptir. İmam Ahmed b. Hambel bunu nassan beyan etmiştir. Kalensüve denilen külah üzerine mesih caiz değildir, İbnü'l Münzir: «Külah üzerine meshin caiz olduğunu söyleyen hiç bir kimse bilmiyoruz. Yalnız Enes (R.A.) külahının üzerine mesh etmiştir» diyor. «Alnına ve sarığının üzerine mesh etti.» ifadesi hakkında Nevevî Şunları söylüyor. «Bu hadis bütün başa mesh etmek şart değil, bir kısmına mesh kafidir diyen ulemamızın delillerindendir. Zira bütün başa mesh etmek farz olsa Resulullah (Sallallahu Aleyhi ve Sellem) sarığın üzerine mesh etmekle iktifa eylemezdi. Çünkü; bir uzuvda hem aslı hem bedeli yapmak caiz değildir. Nitekim bir mestin üzerine mesh ederek Öteki ayağı yıkamak da caiz değildir. Başa meshi sarığın üzerinden tamamlamak İmam-ı Şafiî ile bir cemaata göre müstehaptır. Bu, taharet bütün başı kaplasın diye yapıhr. Sarığın abdestli veya abdestsiz giyilmesinde hükmen bir fark yoktur. Başında külah olan bir kimse onu çıkarmadan alnına mesh etse yine caizdir. Yalnız meshi külahın üzerinede yaparak sarıkta olduğu gibi tahareti tamamlamak müstehaptır. Sade sarığın üzerine mesh eder ve başın hiç bir yerine dokunmazsa bu bizim ulemamıza göre bilittifak kafi değildir. Malik ile Ebu Hanife'nin ve ekseri ulemanın mezhebleride budur. İmam-ı Ahmed b. Hambel (Rahimehullah) yalnız sarığın üzerine meshi caiz görmüştür. Seleften bir cemaatta bu hususta ona muvafakat etmişlerdir.» Kadının baş örtüsü üzerine mesh etmesi caizmidir değilmidir. Meselesi hususunda iki rivayet vardır. Bunlardan birine göre caiz diğerine göre caiz değildir. Nafi', Hammad b. Ebî Süleyman. Evza'i ve Saîd b. Abdiiaziz: «Başı korumak için sarılan şey üzerine bilittifak mesh caiz değildir. Bu babta hilaf bilmiyoruz. Çünkü bunu çıkarmak güç değildir.» demişlerdir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 100
			}
		}
	]
}