{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6359,
			"arabicnumber": "2473.01",
			"text": "Bize Heddâb b. Hâlid-El-Ezdi rivayet etti. (Dediki): Bize Süleyman b. Muğire rivayet etti. {Dediki): Bize Humeyd b. Hilâl, Abdullah b. Sâmid'deıı naklen haber verdi. (Demişki): «Ebû Zer şunları söyledi: Kavmimiz Gıfâr'ın arasından çıktık. Onlar haram ayı helâl yapıyorlardı. Ben, kardeşim Üneys ve annemiz (birlikte) çıktık. Ve bir dayımıza misafir olduk. Dayımız bize ikram ve ihsanda bulundu. Derken kavmi bize hased ederek: — Sen ailenin yanından çıktığın vakit Üneys onlara muhalefet etti, dediler. Sonra dayımız geldi. Ve kendisine söyleneni bize ifşa etti. Ben de: — Bize geçen iyiliğin yok mu, onu muhakkak surette berbad ettin. Bundan sonra sana yaklaşmak yok, dedim. Hemen develerimizi yanaştırdık ve üzerlerine bindik. Dayımız elbisesine sarınarak ağlamağa başladı. Biz yolumuza devam ettik. Nihayet Mekke kenarına indik. Derken Üneys bizim develerimizle onların misli develer nâmına şiir yarışına girdi. Ve her iki taraf kâhine gittiler. O Üneys'i daha hayırlı bulmuş. Bunun üzerine Üneys yanımıza develerimizle, bir misli de beraberlerinde olduğu halde geldi. Ebû Zer: — Ey kardeşim oğlu! Ben Nebi (Sallallahu Aleyhi ve Sellem)'e kavuşmamdan üç sene önce namaz kıldım, dedi. — Kime? diye sordum. — Allah'a! dedi. — Nereye doğru dönüyorsun? dedim. — Rabbim beni nereye çevirirse oraya doğru! Yatsıyı kılıyorum, gecenin sonu geldi mi, tâ güneş üzerime vuruncaya kadar bir örtü gibi seriliyorum, dedi. Üneys dedi ki: Benim Mekke'de bir hacetim var. Bana baş göz ol! Müteakiben Üneys yola düştü. Nihayet Mekke'ye varmış. Yanıma dönmekte biraz gecikti. Sonra geldi. — Ne yaptın? dedim. — Mekke'de senin dininde bir adam'a rastladım. Kendisini Allah gönderdiğini söylüyor, dedi. — Ya Halk ne söylüyor? diye sordum. — Şâir, kâhin, sihirbaz diyorlar, cevâbını verdi. Üneys de şâirlerden biriydi. Üneys dedi ki: Ben gerçekten kâhinlerin sözünü dinledim ama onunki kâhinlerin sözü değil. Onun sözünü şâir nevilerine tatbik ettim, fakat benden sonra ona şiir demeye kimsenin dili varmaz. Vallahi o hakikaten doğrucu, kâhinler de gerçekten yalancıdırlar. Ebû Zer dedi ki: — O halde bana baş göz ol, tâ ki gidip göreyim, dedim ve Mekke'ye geldim. Mekkelilerden zayıf bir adam buldum. Ve : — Kendisine sapık dediğiniz zât nerededir? diye sordum. Bana işaret etti. — Al sapığını! dedi. Az sonra vadinin sakinleri bütün topaç ve kemiklerle üzerime hücum ettiler. Hattâ bayılarak düştüm. Kalktığım vakit dikili taşlar gibi kıpkırmızı idim. Hemen zemzeme giderek üzerimden kanları yıkadım ve suyundan içtim. Yemin olsun kardeşim oğlu otuz günle gece arası durdum. Zemzem suyundan başka yiyeceğim yoktu. Ama semizledim. Hattâ karnımın büküntüleri kıvrıldı. Karnımda açlık zafiyeti hissetmedim. Bir ara Mekkeliler ay aydınlığı bir gecede ansızın uyudular. Kabe'yi kimse tavaf etmiyordu. Onlardan iki kadın İsâf ve Nâile'ye dua ediyorlardı. Tavafları esnasında yanıma geldiler. Ben: Bunların birini diğerine nikâh edin, dedim. Fakat onlar sözlerinden vaz geçmediler. Ve yanıma geldiler. — Odun gibi şey, yalnız ben kinaye söylemiyorum, dedim. Bunun üzerine kadınlar velvele kopararak gittiler. Bizim neferlerimizden biri burada olsaydı ya! diyorlardı. Az sonra karşılarına Resûlullah (Sallallahu Aleyhi ve Sellem) ile Ebû Bekr çıktı. Yukardan iniyorlardı. (Onlara): «Size ne oldu?» diye sordu. — Dinsiz Kâ'be ile örtülerinin arasındadır, dediler. «Size ne söyledi?» diye sordu. — O bize ağzı dolduran sözler söyledi, dediler. Resûlullah (Sallallahu Aleyhi ve Sellem) gelerek Hacer (i esved) i öptü. Ve arkadaşı ile birlikte Kâ'be'yi tavaf etti. Sonra namaz kıldı. Namazını bitirince (Ebû Zerr demişki): Onu İslâm'ın selâmı ile ilk selâmlayan ben oldum. Ve selâm sana yâ Resûlallah! dedim. «Sana da... Allah'ın rahmeti de... buyurdu. Sonra: «Sen kimsin?» diye sordu. — Gıfâr'dan'ım, dedim. Bunun üzerine eli ile uzanarak parmaklarını alnına koydu. Ben kendi kendime: Benim Gıfâr'a mensub olmamı kerih gördü, dedim. Ve elini tutmaya kalkıştım. Arkadaşı derhal beni men etti. Onu benden iyi biliyordu. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) başını kaldırdı ve : «Ne zamandan beri buradasın?» diye sordu. Ben: — Gecesi gündüz otuz günden beri buradayım, dedim. «O halde seni kim doyuruyordu? dedi. — Zemzem suyundan başka yiyeceğim yoktu ama semizledim. Hattâ karnımın kıvrımları kırıldı. Karnımda bir açlık zaafı da görmüyorum, dedim. «O gerçekten mübarektir. O hakikaten doyurucu yemektir.» buyurdular. Ebû Bekr: — Yâ Resûiallah! Bu gece onu doyurmak için bana izin ver! dedi. Müteakiben Resûlullah (Sallallahu Aleyhi ve Sellem) ile Ebû Bekr gittiler. Ben de onlarla beraber gittim. Ebû Bekr bir kapı açtı ve bize Tâif'in kuru üzümünden avuçlamaya başladı. Bu Mekke'de yediğim ilk yemek oldu. Sonra kaldığım kadar kaldım ve Resûlullah (Sallallahu Aleyhi ve Sellem)'e geldim de: «Bana gerçekten hurmalık bir yerin semti gösterildi. Onun Medine'den başka bir yer olacağını sanmıyorum. Sen kavmine benden (bir şeyler) tebliğ eder misin? Ola ki, Allah senin vasıtanla onları faydalandırır. Ve onlar hakkında sana ecir verir.» buyurdular. Sonra Üneys'e geldim. — Ne yaptın? diye sordu. — Şunu yaptım ki; ben gerçekten müslüman oldum ve tasdik ettim, dedim. — Ben senin dinine karşı değilim; çünkü ben do müslüman oldum ve tasdik eltim, dedi. Bunu nıüteâkib annemize geldik. O da : — Ben sizin dininize karşı değilim; çünkü ben de müslüman oldum ve tasdik ettim, dedi. Bunun üzerine hayvanlara bindik ve kavmimiz Gıfâr'a geldik. Onların da yarısı müslüman oldu. Kendilerine Eymâ' b. Rahadate'l-Gıfâri imam oluyordu. Reisleri idi. Yarısı da: Resûlullah (Sallallahu Aleyhi ve Sellem) Medine'ye geldiği vakit müslüman oluruz, dediler. Az sonra Resûlullah (Sallallahu Aleyhi ve Sellem) Medine'ye geldi. Onların kalan yarısı da müslüman oldular. Eslem kalilesi dahi gelerek: — Yâ Resûlallah! Bunlar bizim kardeşlerimizdir. Onlar ne üzerine müslüman oldularsa, biz de müslüman oluruz, dediler. Ve müslümanliğı kabul ettiler. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Gıfâr! Allah ona mağfiret buyursun! Eşlem! Allah ona da selâmet versin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 189
			}
		}
	]
}