{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6364,
			"arabicnumber": "2475.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Veki' ile Ebû Üsâme, İsmail'den rivâyet ettiler. H. İbn Nümeyr de rivâyet etti. ki) ; Bize Abdullah b. İdris rivâyet etti. ki): Bize İsmail, Kays'dan, o da Cerir'den naklen rivâyet etti. Cerir şoyîc demiş: Müslüman olduğumdan beri Resûlüllah (sallallahü aleyhi ve sellem) teni yanına girmekten men etmemiş, beni gördüğü zaman da mutlaka yüzüme gülümsemiştir. Nümeyr, İbn İdris'den rivâyet ettiği hadîsinde şunu ziyâde etmiştir: «Hakikaten at üzerinde duramadığımı kendisine şikâyet ettim de eliyle göğsüme vurdu ve: Allahım bunu sâbit kıl! Bunu hâdî Mehdî eyle! diye dua etti.» hadîsi Buhârî «Kitâbu'l-Cihâd» ve «Kİtâba'l-Edeb»'de; Tirmizî ile Nesâî «Kitâbu'l-Menâkıb»'de; İbn Mâce «Sünnet» bahsinde muhtelif râvilerden tahric etmişlerdir. Cerir'in: «Beni gördüğü zaman da mutlaka gülmüştür.» sözünden muradı; Peygamber (sallallahü aleyhi ve sellem)’in gülümsemesidir. Nitekim ikinci rivâyette sarahaten tebessüm buyurduğu bildirilmiştir. Peygamber (sallallahü aleyhi ve sellem) bunu ona bir lütuf ve ikram olmak üzere yapmıştır. Kendisini hiç bir zaman geri çevirmeyip, daima evine kabul1 buyurması da ayrı bir ikramdır. Bu rivâyetler Hazret-i Cerîr'in faziletine delildirler. (radıyallahü anh), Yemenli'dir. Resûlüllah (sallallahü aleyhi ve sellem) ile görüşmek üzere yola çıktığı vakit. Peygamber (sallallahü aleyhi ve sellem); Yemenlilerin en hayırlısı geliyor...» buyurarak onun gelmekte olduğunu ashabına haber vermiş ve yine onun hakkında: kavmin büyüğü size geldiği vakit ona ikram edinl» buyurmuştur. Cerîr (radıyallahü anh), Übbî'ye göre Peygamber (sallallahü aleyhi ve sellem)’in vefatından kırk gün evvel müslüman olmuştur. Fakat Kastalânî bunun söz götürdüğünü söylemiş. Cerîr'in veda haccında bulunduğunu kaydettikten sonra: «Bu ise Peygamber (sallallahü aleyhi ve sellem)’in vefatından seksen günden fazla önce idi.» demiştir. Hazret-i Cerîr kavminin reisi idi. Bundan dolayı Ömer (radıyallahü anh) kendisine: «Cahiliyette de, İslâm'da da reis olmakta devam ettin.» demiştir. Başkasına doğru yolu gösteren; Mehdi: Kendisi doğru yolu bulan mânâsına gelir. (sallallahü aleyhi ve sellem) bu sözüyle onun mükemmel bir insan olmasına dua etmiştir",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 194
			}
		}
	]
}