{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6406,
			"arabicnumber": "2498",
			"text": "Bize Abdullah b. Berrâd Ebû Amir El-Eş'ari ile Ebû Kureyb Muhammed b. Alâ' rivayet ettiler. Lâfız Ebû Âmir'indir. (Dedilerki): Bize Ebû Usâme, Büreyd'den, o da Ebû Bürde'den, o da babasından naklen rivayet etti. (Şöyle demiş): Nebi (Sallallahu Aleyhi ve Sellem) Huneyn'den ayrılınca Ebû Âmir'i Evtâs'a gidecek ordu üzerine kumandan gönderdi. O da Düreyd b. Sımme'ye rastladı. Düreyd öldürüldü. Arkadaşlarını da Allah hezimete uğrattı. Ebû Mûsâ demiş ki : Beni de Ebû Âmir ile gönderdi. Ebû Âmir dizinden yaralandı. Onu Beni Cüşem kabilesinden bir adam okla yaraladı. Ve dizine isabet ettirerek çökertti. Ben kendisine vararak : — Amca seni kim vurdu? diye sordum. Etû Âmir, Ebû Musa'ya işaret ederek (katili gösterdi). — Benim katilim işte budur. Görüyor musun? Beni işte bu vurdu! dedi. Ebû Mûsâ : — Ben de kendisine kasdettim. Bilerek üzerine yürüdüm ve ona yetiştim. Beni görünce dönerek gitmek istedi. Peşine düştüm. Ve ona : — Utanmıyor musun? Sen Arab değil misin? Yerinde dursana! demeye başladım. Gitmekten vaz geçti. İkimiz karşılaştık. Ben ve o iki kıhç darbesiyle birbirimize girdik. Kendisine bir kılıç vurarak öldürdüm. Sonra Ebû Âmir'e dönerek: — Allah seninkini tepeledi, dedim. — O halde şu oku çıkar! dedi. Oku çıkardım. Yerinden su yükseldi. Bunun Üzerine : — Ey kardeşim oğlu! Resûlullah (Sallallahu Aleyhi ve Sellem)'e git, benden kendisine selâm söyle ve de ki : Ebû Âmir sana benim için istiğfar eyle, diyor. Ebû Musa demiş ki: Ebû Âmir beni halka emir tâyin etti. Biraz yaşadı, sonra öldü. Ben Nebi (Sallallahu Aleyhi ve Sellem)'e döndüğümde yanına girdim. Kendisi bir odada hurma dalından dokunmuş bir yatak üzerinde idi. Yatağı üzerinde bir döşek vardı. Yatağın örgüleri Resûlullah (Sallallahu Aleyhi ve Sellem)'in sırtında ve yanlarında iz bırakmıştı. Kendi maceramızla Ebû Âmir'in başına geleni ona haber verdim. Ve dedim ki: Ebû Âmir: «Söyle ona benim için istiğfar buyursun!» dedi. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) su istedi. Ve ondan abdest aldı. Sonra ellerini kaldırdı. Ve : «Allah'ım! Ebû Âmir Ubeyd'e mağfiret buyur!» diye duâ etti. Hattâ koltuklarının beyazını gördüm. Sonra : «Allah'ım! Onu kıyamet gününde halkımdan yahut insanlardan çoğuna üstün kıl!» diye duâ etti. Ben: — Yâ Resûlallah! Bana da istiğfar eyle! dedim. Bunun üzerine Peygamber (Sallallahu Aleyhi ve Sellem): «Allah'ım! Abdullah b. Kays'a günâhını bağışla! Onu kıyamet gününde makbul bir yere koy!» diye duâ buyurdu. Ebû Bürde: «Bu dualardan biri Ebû Âmir'e, diğeri Ebû Musa'yadır.» demiş",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 237
			}
		}
	]
}