{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 642,
			"arabicnumber": "277",
			"text": "Bize Muhammed b. Abdullah b. Numeyr tahdis etti. Bize babam tahdis etti. Bize Süfyan, Alkame b. Mersed'den tahdis etti. (H) Bana Muhammed b. Hakim de -ki Lafız onundur- tahdis etti. Bize Yahya b. Said b. Süfyan tahdis edip dedi ki: Bana Alkame b. Mersed, Süleyman b. Bureyde'den tahdis etti. O babasından rivayet ettiğine göre Nebi (Sallallahu aleyhi ve Sellem) Mekke'nin fethedildiği günü bütün namazları tek bir abdestle kıl(dır)dı, mestleri üzerine de mesh yaptı. Ömer ona: Bugün daha önce yapmamış olduğun bir iş yaptın, dedi. Allah Resulü: \"Bunu bilerek (kasten) yaptım, ey Ömer\" buyurdu. Diğer tahric: Ebu Davud, 172 -muhtasar olarak-; Tirmizi, 61; Nesai, 133; İbn Mace, 510 -muhtasar olarak-; Tuhfetu'l-Eşraf, 1928 NEVEVİ ŞERHİ AŞAĞIDA DAVUDOĞLU AÇIKLAMA: Hadisi Şerif Bir Abdestle Bir Çok Namazların Kılınabileceğine Delildir. ve Bir Kaç Nevi Hüküm İfade Etmektedir. Şöyleki: 1- Mest üzerine mesh caizdir. 2- Farz ve nafile birçok namazları bir abdestle kılmak caizdir. Bu hususda sözlerine itimad edilen ulema müttefiktirler. Yalnız Ebu Caferi Tahavî ile İbni Battal Buharî şerhinde, bir takım ulemanın her namaz için abdestli olana bile yeniden abdest almak farzdır, dediklerini nakletmişlerdir. Bunların delili abdest ayetinde: «Namaza kalkmak istediğiniz vakit yüzlerinizi yıkayın...» buyurulmuş olmasıdır. Fakat Nevevî: «Bu mezhebin hiçbir kimseden sahih olarak nekledildiğini bilmiyorum. İhtimal bunlar her namaz için yeni abdest almanın müstahab olduğunu söylemek istemişlerdir.» diyor. Cumhurun delili; sahih hadislerdir ki, onlardan biri de izahı sadedinde bulunduğumuz bu hadîstir. Buharî'de Hz. Enes (R.A.)'dan şu hadîs rivayet edilmiştir: «Resulullah (Sallallahu Aleyhi ve Sellem) her namaz için abdest alırdı. Bizden herhangi birimize abdestini bozmadıkça bir abdest yeterdi.» Yine Sahih-i Buharîde Süveyd b. Nu'mandan Resulullah (Sallallahu Aleyhi ve Sellem) in ikindi namazını kıldıktan sonra karıştırma yediği sonra abdest tazelemeden akşam namazı kıldığı rivayet edilmiştir. Bu manada hadîsler çoktur. Arafat ile Müzdelifede iki namazı birden kıldığını, Hendek harbinde kazaya kalan beş vakit namazı hep birden kaza ettiğini bildiren hadisler de buna delildir. Abdest ayetine gelince; ondan murad: Namaza kalktığınız vakit abdestiniz yoksa abdest alın. demektir. Bazıları bu ayetin her namaz için yeni abdest almayı icap ettiğini fakat sonradan Nebi (Sallallahu Aleyhi ve Sellem)'ın fi'ili ile nesh olunduğunu söylemişlersede bu kavil pek zayıftır. Ayet-i kerime mensuh değildir. Ulema abdestli olan bir kimsenin her namaz için abdest tazelemesinin müstahab olduğunu söylemişlerdir. Abdest tazelemenin kimlere müstahab olduğu hususunda birkaç kavil vardır. a) Farz veya nafile namaz kılmış olan kimseye abdest tazelemek müstehaptır. b) Yalnız farz kılmış olana müstahaptır. c) Mushafı ele almak ve secde-i tilavet yapmak gibi abdestsiz caiz 'olmayacak bir şey yapana abdest tazelemek müstahaptır. d) Abdestiyle hiçbir şey yapmamış bile olsa; üzerinden biraz vakit geçmiş bulunan kimsenin abdestini tazelemesi müstahaptır. Sahih ve meşhur olan mezhebe göre; böylesine abdest tazelemek müstahap değildir. Teyemmümün dahi tazelenmesinin müstahap olup olmadığı hususunda iki kavil vardır. Meşhur olan kavle göre müstahab değildir. Teyemmümün tazelenmesi hasta yaralı ve emsali mahzurlar hakkında tasavvur olunabilir. Çünkü bunlar su bulunduğu halde teyemmümle namaz kılmaya me'zundurlar. 3- Hz. Ömer (R.A)'ın Nebi (Sallallahu Aleyhi ve Sellerh)e: «Bugün şimdiye kadar hiç yapmadığın bir işi yaptın» demesi Resul-i Ekremin efdal ile amel ederek her namaz için abdest almaya devam ettiğini gösterir. O gün ise; bir abdestle bir kaç namazın kılınması caiz olduğunu göstermek için öyle hareket etmiştir. Hz. Ömer'e: «Ben bunu kasten yaptım ya Ömer!» buyurması bunun en sarîh ifadesidir. 4- Bir kimse kendinden faziletçe daha üstün olan bir zatın bazı amellerini adete muhalif görerek «bunu niçin yaptın» diye sorabilir. Çünkü bunları unutarak yapmış olması ihtimali vardır. Bu takdirde sualden mütenebbih olur o işi bir daha yapmaz. Bazende soranın bilmediği gizli bir manadan dolayı kasten yapmış olabilir. O zamanda sebebini izah edince soran kimse müstefîd olur. NEVEVİ ŞERHİ: \"Bureyde (r.a.)'dan rivayete göre ... kasten yaptım ey Ömer, buyurdu.\" Bu Hadiste Çeşitli Bilgiler Vardır. 1 - Mestler üzerine mesh etmek caizdir. 2- Farz ve nafile birçok namaz, bozulmadığı sürece tek abdestle kılınabilir ve bu, içtihadı muteber olan ilim adamlarının icmaı ile caizdir. Ebu Cafer etTahavi ve Buhari'nin Şerhinde Ebu'l-Hasan b. Battal bir grup ilim adamından: Abdestli dahi olsa her bir namaz için abdest almak icap eder, dediklerini nakletmektedirler. Bu kanaatte olanlar yüce Allah'ın: \"Namaz için kalkacak olursanız yüzlerinizi. .. yıkayınız.\" (Maide, 5/6) ayetini delil göstermişlerdir. Bu kanaatin herhangi bir kimseden sahih olarak nakledilmiş olabileceğini sanmıyorum. Muhtemelen bu görüşleriyle her bir namaz kılınacağı vakit yeni bir abdest almanın müstehap olduğunu kastetmiş olmalıdırlar. Cumhurun delili ise bu husustaki sahih hadislerdir. Bunlardan biri bu hadistir, diğeri de Buhari'nin sahihinde yer alan Enes'in rivayet ettiği şu hadistir: \"Resuluilah (Sallallahu aleyhi ve Sellem) her bir namaz için bir abdest alırdı. Bizden herhangi birimize abdestini bozacak bir hali olmadığı sürece tek bir abdest yeterli idi.\" Yine Buhari'nin sahihinde yer alan Suveyd b. en-Numan'ın rivayet ettiği şu hadiste buna delildir: \"Resulullah (Sallallahu aleyhi ve Sellem) ikindi namazını kıldırdıktan sonra sevik yedi sonra abdest almaksızın akşam namazını kıldırdı.\" Bu manada çok sayıda hadis-i şerif vardır ki, Arafat ile Müzdelife' de vesair seferlerde ikişer vakit namazı bir arada cem edip kıldığına dair hadis ile Hendek günü geçirdiği namazıarı bir arada kılmasına dair hadis ve diğer rivayetler de buna delildir. Ayet-i kerimeden maksat ise -yüce Allah en iyi bilendir- hadesli (abdestsiz) olarak namaza kalktığınız vakit demektir. Ayrıca Nebi (Sallallahu aleyhi ve Sellem)'in fiili uygulamasıyla nesh edilmiş olduğu da söylenmiştir. Ama bu görüş zayıftır. Allah en iyi bilendir. Abdest ve Teyemmüm Tazelemenin Hükmü Mezhep alimlerimiz der ki: Abdesti tazelemek müstehaptır. Bu da bir kimsenin abdestli olmakla birlikte hadessiz olarak (abdesti bozulmadığı halde) ikinci olarak abdest almasıdır. Abdest tazelemenin müstehap oluşunun şart olması ile ilgili olarak çeşitli görüşler vardır: a. Abdestiyle farz ya da nafile bir namaz kılmış kimseler için abdest tazelemek müstehaptır. b. Ancak abdestle farz namaz kılmış olan kimseler için tazelemek müstehaptır. c. Abdest ile mushafa dokunmak, tilavet secdesi yapmak gibi ancak abdestli olarak yapılması caiz olan bir işi yapmış kimseler için tazelemek müstehaptır. d. Yeni abdest ile önceki abdest arasında bir süre geçmiş olması şartıyla o abdestle hiçbir iş yapmamış olsa dahi abdestini tazelemesi müstehaptır (3/177) ama meşhur ve sahih mezhebe göre yeni bir gusül almak müstehap değildir; ama İmamu'I-Harameyn bir şekilde müstehap olduğuna dair bir görüş nakletmektedir. e. Teyemmümün yenilenmesinin müstehap oluşuyla ilgili iki görüş vardır. Bu görüşlerin daha meşhur olanına göre müstehap olmaz. Bu da suyun bulunması ile birlikte teyemmüm yapmış olan yaralı, hasta ve benzeri durumdaki kimseler hakkındadır. Eğer teyemmüm yapacak kimse için su aramak icap etmez görüşünü kabul edecek olursak, başka kimseler hakkında da aynı durum düşünülebilir. İkinci husus ise teyemmümün yapılacağı yer ile ilgilidir. Allah en iyi bilendir. Ömer (r.a.)'ın: \"Bugün daha önce yapmadığın bir iş yaptın\" demesi, Nebi (Sallallahu aleyhi ve Sellem)'in daha faziletli olan ile amel etmek üzere her bir namaz için abdest almayı devamlı sürdürdüğünü açıkça ortaya koymaktadır. Ayrıca sözü geçen günde beş vakit namazı tek bir abdest ile de caiz oluşunu beyan etmek üzere kıldığını göstermektedir. Nitekim Resulullah (Sallallahu aleyhi ve Sellem): \"Bunu bilerek yaptım, ey Ömer\" buyurması bunu göstermektedir. 3- Hadiste bir kimsenin daha faziletli olan zata dış görünüşü itibariyle alışkın olduğu adete muhalif olmayan bazı davranışları hakkında soru sormasının caiz olduğu anlaşılmaktadır; çünkü bu aykırı davranışlar unutluktan dolayı yapılmış ve hatırlarsa ondan dönme ihtimali olabilir. Bazen de daha faziletli olanın yaptığı bu davranışı fark edemediği bir sebep dolayısıyla kasten yapmış olabilir, böylelikle soran kişi bu fark edemediği sebebi öğrenmiş ve yararlanmış olur. Allah en iyi bilendir. Başlıktaki hadisin isnadına gelince, \"İbn Numeyr dedi ki: Bize Süfyan, Alkame b. Mersed'den tahdis etti\" denilmektedir. Diğer rivayet yolunda da: \"Yahya b. Said, Süfyan'dan dedi ki: Bana Alkame b. Mersed tahdis etti\" şeklindedir. Müslim (rahimehullah)'ın böyle yapıp, Süfyan ve Alkame'yi tekrar zikretmesinin çeşitli faydaları vardır. Bunlardan birisi şudur: Süfyan (rahimehullah) tedlis yapan ravilerdendir. İlk rivayette ise: Alkame'den diye rivayeti nakletmiştir. Tedlis yapan ravinin ise an (dan) lafzını kullanarak yaptığı rivayet ittifakla delil gösterilmez. Ancak bir başka yoldan onu dinlediği sabit olması hali müstesnadır. Bundan dolayı Müslim, Süfyan'ın, Alkame'den hadisi dinlemiş olduğunu açıkça ifade eden ikinci rivayet yolunu zikrederek: \"Bana Alkame tahdis etti\" dediğini kaydetmiştir. İsnattaki diğer faydalı husus da şudur: İbn Numeyr dedi ki: Bize Süfyan ve Yahya b. Said tahdis etti. O Süfyan'dan diye rivayet etti. Müslim (rahimehullah) her iki ravinin rivayetini onlardan birisinin kullandığı siga ile nakletmeyi caiz görmemiştir. Çünkü \"bize tahdis etti\" lafzı ittifakla senedin muttasıl olduğu anlamında kabul edilir. Ancak \"an\"lafzının -mukaddimenin Şerhinde kaydettiğimiz gibi- ittisal ifade edip, etmediği ihtilaflıdır",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 108
			}
		}
	]
}