{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6466,
			"arabicnumber": "2531",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile İshâk b. İbrahim ve Abdullah b. Ömer b. Ebân hepsi Hüseyn'den rivâyet ettiler. Ebû Bekr dedi ki: Bize Hüseyn b. Ali El-Cu'fî, Mücemma' b. Yahya'dan, o da Saîd b. Ebî Bürde'den, o da Ebû Bürde'den, o da babasından naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem) İle birlikte akşam namazını kıldık. Sonra otursak da onunla beraber yatsıyı da kilsak a! dedik ve oturduk. Derken yanımıza çıktı ve: hâlâ burada mısınız?» dedi. (Biz) şu cevâbı verdik: Ya Resûlallah! Seninle birlikte akşam namazını kıldık. Sonra: Oturalım da seninle binlikte yatsıyı da kılalım, dedik. ettiniz!» Yahut «İsabet ettiniz!» buyurdular. Müteakiben başım semâya kaldırdı. Çok defalar başını semâya kaldırırdı ve: semânın emniyetidir. Yıldızlar gitti mi semâya vadolunan gelir. Ben ashabını için bir emniyetim. Ben gittim mi, ashabınıa vadolunan-tar gelir. Ashabını da ümmetim için bir emniyettir. Ashabını gitti mi ümmetime vadolunan şeyler gelir.» buyurdular. ve Eman aynı mânâya olup, emniyet ve korkusuzluk demektirler, Hadîsden murad şudur ; Yıldızlar kaldıkça semâ da bakidir...Kıyâmet gelip yıldızlar saçılınca, semâ da bozulup yarılacak ve yok olacaktır. Ben ashabını için bir emniyetim. Ben gittikten sonra ashabınıa vadolunan fitneler ve harbler, bedevilerin irtidâdı ve kalblerin birleşemeyip ihtilâfı gibi önceden açıkça haber verilmiş olan şeyler gelecektir. Nitekim bunların hepsi olmuştur. gittikten sonra ümmete vadedilen şeylerin gelmesinden murad dinde bid'atların, fitnelerin zuhuru, kıyâmet alâmetlerinin görünmesi, Mekke ile Medine'nin hürmetlerinin ayaklar altına alınması ve sairedir ki, bunların hepsi Peygamber (sallallahü aleyhi ve sellem)'in mucizelerindendir",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 295
			}
		}
	]
}