{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6507,
			"arabicnumber": "2549.04",
			"text": "(Bize Saîd b. Mansûr rivâyet etti. ki): Bize Abdullah b. Vehb rivâyet etti. ki): Bana Amr b. Haris, Yezîd b. Ebî Habîb'den naklen haber verdi. Ona da Ümmü Seleme'nin âzâdlısı Nâim rivâyet etmiş ki, Abdullah b. Amr b. Âs şunu söylemiş: (sallallahü aleyhi ve sellem)'e bir adam gelerek: Sana hicret ve cihâd şartı ile bey'at ediyorum. Ecri Allah'dan dilerim; dedi. Peygamber (sallallahü aleyhi ve sellem): babandan sağ biri var mı?» diye sordu. Adam: Evet! Hattâ ikisi de! cevâbını verdi. «Allah'dan ecir diler misîn?» dedi. Adam: Evet! cevâbını verdi, halde hemen annenle babana dön! Ve onlara güzel sohbette bulun!» buyurdular, hadîsi Buhârî «Kitâbü'l-Cihâd» ile «Kitâbü'l-Edeb»'de; Ebû Dâvûd, Tirmizî ve Nesâî de «Kitâbü'l-Cihâd»'da muhtelif râvilerden tahrîc etmişlerdir. (sallallahü aleyhi ve sellem)'e gelen zâtın Câhime b. Abbâs b. Mirdâs olması muhtemel görülmüştür.' Çünkü bir hadîsde bu zât: cihâd hakkında istişare için Peygamber (sallallahü aleyhi ve sellem)'e geldim de (bana): var mı?» diye sordu. Evet! dedim de ona ikram et!» Zira cennet onun ayaklarının att;ndad;ri» demiştir. husûsda daha başka hadîsler de vardır. «Öyle ise onlar hakkında mücahede et!» sözünden zahirî mânâ kastedilmemiştir. Çünkü cihâdın zahiri mânâsı başkasına zarar vermeyi tazammun eder. Burada maksad cihâdın külfetidir ki o da mal sarfetmek ve bedenen yorulmaktır. Binâenaleyh hadîsin mânâsı. Anne ve babanı razı etmek için malını sarfet ve bedenini yor, demek olur. Hadîs-i şerif, anneye-babaya itaatin şiddetle lüzumuna, haklarının büyüklüğüne, onlara itâattan dolayı kazanılacak sevabın çokluğuna delildir. Ulemâdan bazıları bu hadîsle istidlal ederek ana-baba hakkının cihâddan daha üstün olduğunu... Her ikisi veya birisi müslüman olduğu takd'irde, onlardan izinsiz cihâda gitmenin caiz olmadığını söylemişlerdir. Müşrik olurlarsa izinleri şart değildir. Ancak düşman müslürnanların karşısına gelir de, onunla çarpışmak zaruret hâlini alırsa, onlardan izinsiz cihâd etmek caiz olur. isyanın büyük günahlardan sayıldığını iman bahsinde görmüştük",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 7
			}
		}
	]
}