{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6515,
			"arabicnumber": "2552.03",
			"text": "(Bize Hasen b. Ali El-Hulvânî rivâyet etti. ki): Bize Ya'kub b. ibrahim b. Sa'd rivâyet etti. ki): Bize babamla Leys b. Sa’d hep birden Yezid b. Abdillah b. Usame b. Hâd'dan, o da Abdullah b. Dinar'dan, o da İbn Ömer'den naklen rivâyet etti ki, kendisinin bir eşeği varmış. Mekke'ye çıktığında deveye binmekten bıktığı zaman onun üzerinde rahatlanırımış. Bir de başına sardığı sarığı varmış. Bir gün bu eşeğin üzerinde iken aniden yanından bir bedevi geçmiş. Abdullah (ona): Sen filân oğlu filânın oğlu değil misin? diye sormuş. Bedevi: Evet! cevâbını vermiş. Abdullah hemen eşeği ona vermiş. Ve: Buna bin! demiş. Sarığı dahi vererek: Bunu başına sar! demiş. Bunun üzerine arkadaşlarından biri Abdullah'a: Allah sana mağfiret buyursun. Bu bedeviye üzerinde rahatlandığın bir eşek verdin. Bİr de sarık verdin ki, onu kendi başına sarıyordun, demiş. Abdullah ; Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: babası öldükten sonra baba dostlarına silede bulunması, iyiliğin en iyisindendir.» buyururken işittim. Bunun babası da Ömer'in dostu idi, demiş. hadîs-i şerif baba dostlarına şilede bulunmanın faziletine delildir. bulunmaktan murad; onların ziyaretlerine gitmek, kendilerine ikram ve ihsanda bulunmak, gerekirse yardımlarına koşmaktır. Buna sebep baba olduğu için, dostuna yapılan her nevi ihsan ve ikram babaya da yapılmış gibi olur. Annelerle dedelerin, hocaların, karı ve kocaların dostlarına yapılan ikram da aynı hükümdedir. Resûlüllah (sallallahü aleyhi ve sellem)'in Hazret-i Hatice'nin dostlarına yaptığı İkramı evvelce görmüştük. şerif baba hakkının pek büyük olduğuna da işaret etmektedir. Çünkü babanın dostlarına yapılan ikram ve ihsan, iyiliğin en faziletlisi olunca bizzat babaya yapılan ikramın faziletini dille ta'rife imkân kalmaz",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 15
			}
		}
	]
}