{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6517,
			"arabicnumber": "2553.02",
			"text": "(Bana Harun b. Saîd El-Eylî rivâyet etti. ki): Bize Abdullah b. Vehb rivâyet etti. ki): Bana Muâviye (yani İbn Salih) Abdurrahman b. Cübeyr b. Nüfeyr'den, o da babasından, o da Nevvâs b. Sem'an'dan naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem)'e birlikte Medine'de bir sene kaldım. Suâl sormaktan başka beni hicretten men eden bir şey yoktu. Bizden bîrimiz hicret etti mi,' Resûlüllah (sallallahü aleyhi ve sellem)'e bir şey sormazdı. Ben kendisine iyilik ve günahı sordum. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem); ahlâk güzelliğidir. Günah ise, kalbinde gıcık yapan ve başkalarının muttali olmasını istemediğin şeydir.» buyurdular. metnindeki ensârî tâbiri hakkında Ebû Ali El -Ceyyânî: «Bu vehmdir. Doğrusu Kilâb'î olacaktır. Çünkü Nevvâz meşhur bir Kilâbîdir.» demiştir. Kâdî Iyâz ile Ma'zirî dahi onun Kilâbî ismiyle meşhur olduğunu söylemişlerdir. İhtimal ensârın müttefiki imişdir. beyânına göre birr: Sile, lütuf, iyilik, güzel geçinmek ve tâat mânâlarına gelir. Hadisdeki «Ahlâk güzelliği» ifadesi bu mânâların hepsine şâmildir. gıcık yapmaktan murad; şüphe hâsıl etmek ve günah olacağına korku vermektir. Kâdî Iyâz ile başkalarına göre «Suâl sormaktan başka, beni hicretten inen eden bir şey yoktu.» cümlesinden murad Medîne'de ziyaretçi gibi kalmasıdır. Oraya hicretine mâni olan şey Peygamber (sallallahü aleyhi ve sellem)’e din hususunda suâl sormaktır. Çünkü Resûlüllah (sallallahü aleyhi ve sellem) ziyaretçilerin suâl sormasına müsaade eder, muhacirlere etmezdi. Muhacirler gelen ziyaretçilerin suâl sormalarından memnun kalırlardı. Çünkü kendileri de bundan istifâde ederlerdi. Bu husûsda bedevi vesâir ziyaretçiler ma'zur görülürlerdi",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 17
			}
		}
	]
}