{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 654,
			"arabicnumber": "280.02",
			"text": "Bunu bana Yahya b. Habib el-Harisı de tahdis etti. Bize Halid -yani b. el-Haris- tahdis etti. (H) Bana Muhammed b. Hatim de tahdis etti. Bize Yahya b. Said tahdis etti. (H) Bana Muhammed b. el-Velid de tahdis etti, bize Muhammed b. Cafer tahdis etti. Hepsi Şu'be'den bu isnad ile hadisi aynen nakletti, ancak Yahya b. Said'in rivayetinde: \"Koyun, av ve ziraat köpeğine ruhsat verdi\" fazlalığı vardır. Fakat Yahya'dan başka \"ziraat\" kaydını zikreden yoktur. DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın NEVEVİ ŞERHİ (646 – 652 ): Bu bapta (646) Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Köpek birinizin kabına dilini sarkıtıp yalarsa ... yedi defa yıkasın.\" Diğer (649) nolu rivayette: \"Köpek birinizin kabına dilini sarkıtıp yalarsa ... birincileri toprak ile olmak üzere\"; (650) Diğer rivayette \"köpek dilini sarkıtıp yalarsa ... yedi defa yıkamasıdır\" (651) Diğer rivayette \"Resulullah (Sallallahu aleyhi ve Sellem) öldürülmesini emretti ... sekizincisinde de toprakla ovalayınız.\" (652) Diğer \"rivayette koyun, av ve ziraat köpeği için ruhsat verdi\" buyurmaktadır. Başlıktaki rivayetlerin senetleri ile lafızlarına dair açıklamalara gelince (3/183): Ebu Rezin'den bundan önceki bapta söz edilmişti. \"Velağa\" fiili hakkında dilbilginlerinin dediklerine göre dilinin ucu ile su içmek demektir. Ebu Zeyd dedi ki: Köpek içeceğimizi yaladı denilip, bu fiil kullanılacak olursa \"be\" ve \"fi\" ile \"min\" edatları ile geçişi yapılır. \"Hemmam'ın sahifesinde, dedi ve çeşitli hadisler zikretti. Bunlardan birisi de ... \" Daha önce fasıllarda ve başka yerlerde bu ibarenin faydası ve anlamı ile ilgili açıklama geçti. Başlığın sonunda \"fakat Yahya'dan başka \"ziraat\" kaydını zikreden yoktur\" ibaresi bütün asıl nüshalarda bu şekildedir ve doğrudur. Bu da Yahya dışında bu rivayeti kimse zikretmemiştir, demektir. Senette geçen Ebu't-Teyyah'ın adı Yezid b. Humeyd ed-Dubaı el-Basri olup, salih bir zat idi. Şu'be: Biz onu Ebu Hammad künyesi ile çağırırdık, demiştir. Yine dedi ki: Bana ulaştığına göre o henüz bir genç iken Ebu't-Teyyah künyesi ile anılırdı. İbnu'l-Muğaffel'in adı Abdullah b. el-Muğaffel el-Müzenı'dir. Müslim'in (651) \"bize Ubeydullah b. Muaz tahdis etti. .. Ebu'l-Muğaffel'den\" (652): \"Bunu Yahya b. Habib el-Harisı de tahdis etti ... Hepsi Şu'be' den\" Bu isnadta ve onun gibi bütün yollardaki bu isnadların ravileri hep Basralıdır. Daha önce defalarca Şu'be'nin hem Vasıt'lı, hem de Basralı olduğunu belirtmiştik. Burada zikredilen Yahya b. Said de \"el-Kattan\"dır. Allah en iyi bilendir. Baptaki Hadislerden Çıkartılan Hükümler 1- Bu bapta Şafii ve onun dışında köpeğin necis olduğunu söyleyenlerin görüşleri lehine açık bir delalet vardır; çünkü temizlik ya hadesten ya da necasetten olur. Burada hades sözkonusu olmadığına göre geriye sadece necaset kalmaktadır. Eğer burada temizlikten kasıt sözlük anlamıyla temizliktir denilecek olursa buna sözün şer'i bakımdan hakikat anlamına göre anlaşılması, sözlük anlamına göre önceliklidir diye cevap verilir. 2- Köpeğin yaladığı şey necis olur. Eğer bu şey sıvı bir yiyecek ise onu yemek de haram olur; çünkü onu dökmek onu zayi etmektir. Eğer temiz olsaydı onu dökmeyi bize emretmezdi; çünkü bize malı zayi etmek yasaklanmıştır. Bizim mezhebimizin görüşü budur. Çoğunluğun mezhebi ise içinde yaladığı şey necis olur. Bu hususta barındırılmasında izin verilen köpek ile başkası arasında bir fark olmadığı gibi,çölde yaşayan köpek ile şehirde yaşayan köpek arasında da -lafzın genelliğinden ötürü- fark yoktur. Malik'in mezhebinde dört görüş vardır: Temiz olduğu, necis olduğu, edinilmesine izin verilenin artığının temiz diğerlerinin temiz olmadığı görüşü. Bu üçü Malik'ten nakledilmiştir. Dördüncüsü ise Abdulmelik b. Macişun el-Maliki' den nakledilmiş olup, buna göre çölde yaşayan köpek ile şehirde yaşayan arasında da bir fark yoktur. 3- Köpeğin yaladığının dökülmesi emredilmiştir. Bizim mezhebimizde bunun üzerinde ittifak vardır. Ama onu dökmek aynı dolayısıyla mı vaciptir yoksa (3/184) kabı kullanmak istediği zaman mı onu döker? Bu hususta farklı görüşler vardır. Mezhep alimlerimizin çoğunluğunun zikrettiğine göre aynı dolayısıyla onu dökmek icap etmez. Aksine bu müstehaptır ama kabı kullanmak isteyince onu döker. Bazı alimlerimizin kanaatine göre ise onu derhal dökmek vaciptir. İsterse kabı kullanmak istemesin. Bu görüşü de Maverdı, elHavı adlı kitabında bizim mezhep alimlerimizden nakletmiş bulunmaktadır. Bu görüş lehine emrin mutlak oluşu delil gösterilir. Mutlak emir ise tercih edilen kanaate göre vücub gerektirir. Fukahanın çoğunluğunun görüşü de budur. Birincisinin lehine ise diğer necis sulara kıyas delil gösterilir. Çünkü onların dökülmesinin vacip olmadığı hususunda görüş ayrılığı yoktur. Ama buna da köpeğin yalaması meselesinde maksat yasaklayıp, alıkoymak, hükmün ağırlığını bildirmek ve köpeklerden nefret ettirmekte mübalağa etmektir diye cevap verilebilir. Allah en iyi bilendir. 4- Köpeğin yalaması dolayısıyla sözkonusu olan necaseti yedi defa yıkamak kap eder. Bizim mezhebimiz de budur. Malik, Ahmed ve büyük çoğunluğun görüşü de budur. Ebu Hanife ise onu üç defa yıkamak yeterlidir,demiştir. Allah en iyi bilendir. Rivayetlerin Telif Edilmesi Rivayetlerin birbirleriyle telif edilmesine gelince, bir rivayette \"yedi defa\", diğerinde \"birincileri toprak ile olmak üzere yedi defa\", bir rivayette \"sonuncuları yahut birincileri\", bir başka rivayette \"yedincisi toprak ile olmak üzere yedi defa\", başka bir rivayette: \"Yedi defa yıkayınız ve sekizincisini de toprakla ovalayınız\" buyurulmaktadır. Beyhaki ve başkaları bütün bu rivayetleri kaydetmiş bulunmaktadır. Bu rivayetlerde birinci defanın ve diğerlerinin kayıtlı olarak zikredilmesi şart olarak zikredilmemiştir. Maksat bu yıkamalardan birisinin böyle olmasıdır. Sekizincisini toprakla ovalayınız rivayetine gelince, bizim ve büyük çoğunluğun kanaatine göre maksat kabı yedi defa yıkayınız ve onlardan birisi su ve toprak ile birlikte olsun adeta toprak da onu (ayrıca) bir defa yıkamak yerini tuttuğundan ötürü bu sebeple ona sekizinci defa denilmiştir. Allah en iyi bilendir. 5- Şunu da bilmek gerekir ki, bizim mezhebimize göre köpeğin dili ile yalaması ile, onun diğer cüzleri arasında bir fark yoktur. Mesela köpeğin sidiği yahut pisliği, kanı, teri, kılı, salyası yahut organlarından herhangi birisi temiz bir şeye isabet edip, ikisinden birisi eğer nemli durumda ise, birileri toprakla olmak üzere onu yedi defa yıkamak kap eder. Bir kapta iki köpek yahut bir köpek birkaç defa yalayacak olursa bizim mezhebimizin bu hususta üç görüşü vardır. Sahih görüş hepsi için yedi defa yıkamasının yeterli olduğudur, ikincisi görüşe göre her bir yalama için yedi defa yıkamak kap eder, üçüncü görüş ise tek bir köpek birkaç defa yalamışsa yedi defa yıkamak gerekir ve her bir köpek için de yedi defa gerekir. 6- Şayet başka bir necaset köpeğin yalamış olduğu bir kaba düşecek olursa hepsi için yedi defa yıkamak yeterlidir. Sahih kabul edilen kanaate göre sekizinci yıkamanın yalnız su ile yapılması, kabın çok miktardaki suya daldırılıp içinde yedi defa yıkayacak kadar bir süre kalması toprakla yıkamanın yerini tutmaz. Tuttuğu söylendiği gibi sabun ve çöven ile benzerleri de sahih kabul edilen görüşe göre toprağın bulunması ile bulunmaması arasında da fark yoktur. Sahih kabul edilen görüşe göre necis toprakla yıkamak la gerçekleşmez, şayet bulaşan necaset köpeğin kanı yahut onun pisliği ise bu necasetin aynı -mesela- ancak altı defa yıkamakla iz ale edilebilirse acaba bu altı defa yıkamak mı sayılacaktır yoksa bir defa yıkamak mı yoksa kesinlikle yedi yıkamadan sayılmayacak mı? Bu hususta üç görüş vardır. Sahih olanı bir defa yıkamak sayılacağıdır. Domuzun hükmü de bütün bu meselelerde köpeğin hükmü ile aynıdır. Bizim görüşümüz budur ama ilim adamlarının çoğunluğu domuzun yedi defa yıkamaya ihtiyacının olmadığı şeklindedir. Şafii'nin de görüşü budur, delil itibariyle de kuvvetli bir görüştür. Mezhep alimlerimiz der ki: Toprakla yıkamanın anlamı toprağı su bulanıncaya kadar suya karıştırmaktır. Suyu toprağa dökmek ile toprağı suyun içine atmak arasında bir fark olmadığı gibi bulanık suyu bir yerden alıp, onunla yıkamak arasında da fark yoktur. Necaset yerinin toprakla silinmesi ise yeterli değildir. Elin kaba sokulması da icap etmez. Aksine bunu toprağa atıp, hareket ettirmesi yeterli olur. Toprakla yıkamanın son yıkamanın dışındaki yıkamalarda olması müstehaptır. Böylelikle onun üzerinden onu temizleyecek olan (su) gelsin. Efdal olan da birinci defada toprak kullanılmasıdır. Eğer köpek suyu iki kulle (testi)den azaltmayacak kadar çok miktardaki suya dilini sarkıtıp yalarsa o suyu necis etmez. Şayet az miktardaki suya ya da yiyeceğe dilini sarkıtıp, o suya ya da yiyeceğe bir elbiseye, bedene ya da bir başka kaba isabet edecek olursa onu da birileri toprakla olmak üzere yedi defa yıkamak icap eder. Eğer köpek katı (donuk) bir yiyeceğin bulunduğu bir kabı yalayacak olursa dilinin değdiği yer ve etrafı atılır, geri kalandan ilk temizliği esas alınarak yararlanılır. Nitekim donmuş yağda ölmüş fare hükmünde olduğu gibi. Allah en iyi bilendir. (651) \"Resulullah (Sallallahu aleyhi ve Sellem) köpekleri n öldürülmesini emre tti sonra da: Köpeklerden onlara ne buyurdu, sonra da av köpeği ile koyun (çoban) köpeklerine ruhsat verdi.\" Diğer rivayette de: \"Tarla köpeğine de ruhsat verdi\" denilmektedir. Bu ifadeler köpek barındırmanın yasaklandığını ortaya koymaktadır. Bizim mezhep alimlerimiz de başkaları da mesela suretini beğendiği yahut başkalarına karşı onunla övünmek istediği için ihtiyaç bulunmaksızın köpek barındırmanın haram olduğunu ittifakla kabul etmişlerdir. Bunun haram olduğu hususunda görüş ayrılığı yoktur. Köpek barındırmayı caiz kılan ihtiyacın ne olduğuna gelince, hadis-i şerifte üç şeyden birisi dolayısıyla ruhsat sözkonusu edilmiştir. Bunlar da ekin, davar ve avdır. Bu maksatla köpek barındırmanın caiz olduğunda görüş ayrılığı yoktur. Fakat evleri ve yolları korumak, eniği eğitmek maksadıyla barındırmak hususunda mezhep alimlerimiz farklı görüşlere sahiptir. Aralarından bunun haram olduğunu söyleyenler vardır; çünkü ruhsat sadece az önce geçen üç husus hakkında varid olmuştur. Kimisi de bunun mübah olduğunu söylemiştir, daha sahih olan budur çünkü bunlar da o üç husus ile aynı anlamı taşımaktadır. Yine avcı olmayan bir kimsenin av köpeğini barındırması hakkında da farklı görüşlere sahiptirler. Allah en iyi bilendir. Köpeklerin öldürülmesinin emredilmesine gelince, mezhep alimlerimiz der ki: Eğer köpek saldıran, ısıran bir köpek ise öldürülür. Eğer saldıran, ısıran değilse ister sözü geçen faydalardan bir faydası olsun, ister olmasın öldürülmesi caiz değildir. İmamu'I-Harameyn İmam Ebu'I-Meali dedi ki: Köpeklerin öldürülmesi emri nesh edilmiştir. Resulullah (Sallallahu aleyhi ve Sellem)'in bir defa köpeklerin öldürülmesini emrettiği sahih olduğu rivayet edildiği gibi, daha sonra onları öldürmeyi yasakladığı da sahih olarak rivayet edilmiş ve böylece şeriat bu hususta -az önce belirttiğimiz etraflı açıklama esası üzerekarar bulmuştur. Simsiyah köpeğin öldürülmesini de emretmiştir ama bu ilk zamanlarda idi. Şu anda ise nesh edilmiştir. (3/186) İmamu'I-Harameyn'in sözleri bunlardır ve onun bu tahkikinden fazla söylenecek bir söz de yoktur. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 120
			}
		}
	]
}