{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 657,
			"arabicnumber": "282.02",
			"text": "Bize Muhammed b. Rafi'de rivayet etti. (Dediki): Bize Abdurrezzak rivayet etti. (Dediki): Bize Ma'mer, Hemmam b. Miinebbih'ten rivayet etti. dedi ki: Bu Ebu Hureyre'nin Resulullah (Sallallahu aleyhi ve Sellem) Muhammed'den bize tahdis ettikleridir deyip, çeşitli hadisler zikretti. Bunlardan birisi de şudur: Ayrıca (Ebu Hureyre) dedi ki: Resulullah (Sallallahu aleyhi ve Sellem): '~kmayan durgun suda küçük abdest bozma, sonra kalkar ondan yıkanırsm\" buyurdu. Diğer tahric: Tirmizi, 68; Tuhfetu'l-Eşraf, 14722 DAVUDOĞLU AÇIKLAMA: Hadîsin bazı rivayetlerinde durgun suya bevl etmek te'kid edatı ile bazılarında te'kitsiz olarak zikir edilmiştir. Keza bazı rivayetlerde durgun su bazılarında onun yerine daim su denilmiş ve bundan murad akmayan durgun su olduğu nefs-i rivayette tefsir buyurulmuştur. NEVEVİ ŞERHİ (653-655): Bu babta (654) Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Sizden herhangi bir kimse durgun suda küçük abdest bozmasm sonra ondan kalkar yıkanır. \" Diğer (655) rivayette: '~kmayan durgun suda küçük abdest bozmasm ... \" Öbür (653) rivayette: \"Durgun suda küçük abdest bozulmasını yasakladı\" buyurulmaktadır. \"Sonra kalkıp ondan yıkanır\" buyruğundaki \"yıkanır\" rivayetinde mı merfudur; yani orada küçük abdestini bozma, sonra kalkıp ondan yıkanırsın demektir. Üstadımız Ebu Abdullah b. Malik (r.a.)'ın zikrettiğine göre bunun \"küçük abdest bozmasm\" anlamındaki fiilin mahalline atfen cezm ile okunmasının da caiz olduğunu söylemiştir. Ayrıca \"en\" edatı takdir ederek nasp ile de okunabilir. \"Sonra\" edatına ise atıf vav'ı hükmü ile değerlendirilir. Cezm ile okunması açıkça anlaşılır, nasb ile okunması ise caiz değildir. Çünkü yasak olanın bunlardan birisi değil, her ikisini birlikte yapmanın yasaklanmış olmasını gerektirmektedir. Bunu ise kimse söylemiş değildir. Aksine durgun suda küçük abdest bozmak içinde yahut ondan alınan su ile yıkanmak istesin ya da istemesin fark etmez. Allah en iyi bilendir. \"Daim: durgun\" suyu Resulullah (Sallallahu aleyhi ve Sellem)'in: '~kmayan\" ibaresi tefsir etmekte, anlamını açıklamaktadır. Böyle'likle havuz ve buna benzer kısmen akmayan durgun suyu dışarıda tutmak istemiş olma ihtimali de vardır. Buradaki yasak bazı sular hakkında haramlığı, bazıları hakkında da mekruh olmayı ifade eder. Bu da meselenin hükmünden çıkartılır. Eğer su çok miktarda ve akan bir su ise hadisin mefhumu dolayısıyla içinde küçük abdest bozmak haram olmaz ama daha uygunu ondan sakınmaktır. Şayet az miktarda akan bir su ise ashabımızdan bir topluluk mekruhtur demiştir. Tercih edilen ise haram olduğudur. Çünkü Şafil'nin ve başkalarının mezhebi olarak meşhur olan görüşe göre böyle bir iş onu kirletir ve necis eder. Başkasının da aldanmasına sebep olarak necis olmakla birlikte kullanmasına sebep olur. Şayet su durgun ve çok miktarda ise mezhep alimlerimiz mekruhtur, haram olmaz demişlerdir. Haram olduğu söylenmesi de uzak bir ihtimal değildir. (3/178) Çünkü nehy (yasaklama) muhakkiklere ve usul alimlerinin çoğunluğuna göre tercih edilen kanaate göre haram olmayı gerektirir. Ayrıca bu yasaklamadan onu kirlettiği anlaşılır, bazen de bu değişikliğe uğrayacağından icma ile necis olması sonucuna kadar götürür, yahut bir tarafının hareket ettirilmesi ile diğer tarafı da hareket eden su birikintisine bir necaset düşmesi sebebiyle necis olur, şeklindeki Ebu Hanife'nin ve ona muvafakat edenlerin kanaatine göre de necis olması sonucunu verir. Az miktardaki durgun su ile ilgili olarak mezhep alimlerimizden bir topluluk onun mutlak olarak mekruh olacağını söylemişlerse de doğru ve tercih olunan onda küçük abdest bozmanın haram olduğudur. Çünkü bundan dolayı necis olur ve malolma özelliği telef olur, onu kullanması sebebiyle başkasını da aldatmış olur. Allah en iyi bilendir. Mezhep alimlerimiz ve diğer ilim adamları ise suda büyük abdest bozmanın da küçük abdest bozmak gibi hatta daha çirkin olduğunu söylemişlerdir. Aynı şekilde bir kaba küçük abdestini bozup sonra onu suya dökmesinin hükmü de böyledir. Nehrin yakınında sidiği ona akacak şekilde küçük abdest bozması halinde de hüküm budur, bunların hepsi zem edilmiş, çirkin ve belirtilen açıklamalar çerçevesinde yasaklanmış bir iştir. Bu konuda ilim adamlarından herhangi bir kimse muhalefet etmiş değildir. Bundan tek istisna Davud b. Ali ez-Zahiri' den nakledilen burada yasak bizzat insanın küçük abdest bozması hakkında özeldir, büyük abdest de küçük abdest gibi değildir diye nakledilen kanaatidir. Aynı şekilde (ona göre) bir kaba küçük abdestini bozup sonra suya dökse yahut suyun yakınında küçük abdestini bozsa da hüküm böyledir; fakat Davud ez-Zahiri' nin benimsediği bu kanaat ilim adamlarının iemaına aykırıdır. Onun zahir ifadeden anlaşılan çerçevesinde donuklaşıp, kalmasına dair nakledilen en çirkin görüşlerindende birisidir. Allah en iyi bilendir. İlim adamları der ki: Suya varmayacak olsa dahi suyun yakınlarında küçük ve büyük abdest bozmak mekruhtur. Sebep ise Nebi (Sallallahu aleyhi ve Sellem)'in genelolarak suya gidip gelinen yerlerde abdest bozmayı yasaklamış olması ve bundan dolayı suya gidip gelenlerin rahatsız edilmesi ve bunun suya ulaşmasından korkulmasıdır. Allah en iyi bilendir. İstinca yapmayan bir kimsenin suyun içinde istinca yapmak üzere suya gömülmesine gelince, su içine necaset düşmesiyle necis olacak kadar az ise bu haramdır; çünkü ona bulaşmış bir necaset vardır ve su da necis edilir. Şayet içine necaset düşmesi sebebiyle necis olmayacak kadar çok ise eğer su akarsu ise bunda bir sakınca yoktur, durgun ise haram değildir, mekruh olduğu da açıkça görülmemektedir. Çünkü böyle bir iş küçük abdest demek değildir, ona yakın da sayılmaz ama bir kimsenin bundan sakınması da elbette ki daha güzeldir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 123
			}
		}
	]
}