{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6572,
			"arabicnumber": "2577.01",
			"text": "Bize Abdullah b. Abdirrahman b. Behrâm Ed-Dârimî rivayet etti. (Dediki): Bize Mervân (yâni İbni Muhammed Ed-Dımeşkî) rivayet etti. (Dediki): Bize Saîd b. Abdil-Aziz, Rabîa b. Yezid'den, o da Ebu İdris EI-Havlânî'den, o da Ebû Zer'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen Allah Tebârekt ve Teâlâ'dan rivayet ettikleri meyânında şunu rivayet etti: «(Allah) Buyurdu ki: Ben zulmü kendime haram kılmışımdir. Onu sizin aranızda da haram kıldım. Binâenaleyh birbirinize zulmetmeyin! Ey kullarım! Hepiniz dalâlettesiniz, yalnız benim hidâyete erdirdiğim müstesna! İmdi benden hidâyet dileyin ki, sizi hidâyete erdireyim. Ey kullarım! Hepiniz açsınız! Yalnız benim doyurduğum müstesna. İmdi benden yiyecek isteyin ki, sizi doyurayım. Ey kullarım! Hepiniz çıplaksınız, yalnız benim giydirdiğim müstesna! Şu halde benden giyecek isteyin ki, sizi giydireyim. Ey kullarım! Siz gece-gündüz günah işliyorsunuz. Bütün günahları affeden de benim. Şu halde benden af dileyin ki, sizi affedeyim! Ey kullarım! Sizin bana zarar vermeye elbet gücünüz yetmez ki, zarar veresiniz. —Bana fayda vermeye de gücünüz yetmez ki, fayda veresiniz.— Ey kullarım! Sizin evveliniz âhiriniz, insiniz cinnîniz sizden en takva sahibi bir adamın kalbi üzre olsalar, bu benim mülküme bir şey ziyâde etmez. Ey kullarım! Sizin evveliniz âhiriniz ve insiniz cinnîniz en sapık bir adamın kalbi üzere olsalar, bu benim mülkümden bir şey eksiltmez. Ey kullarım! Sizin evveliniz âhiriniz ve insanınız cinnîniz bir toprağın üzerinde ayağa kalkarak benden isteseler, ben de her İnsana dilediğini versem; bu bende olandan ancak iğnenin denize batırıldığı vakit azalttığı kadar azaltır. Ey kullarım! Bunlar ancak sizin amellerinizdir. Onları size sayıyorum. Sonra onların karşılığını size tastamam veriyorum. İmdi (verileni) kim hayır bulursa Allah'a hamdetsîn! Hayırdan başka bulan ancak kendini muaheze etsin!» Saîd demiş ki: Ebû İdris El-Havlânî bu hadîsi rivayet ettiği vakit dizlerinin üzerine çökerdi",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 70
			}
		}
	]
}