{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6578,
			"arabicnumber": "2580",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Leys Ükayl'den, o da Zührî'den, o da Sâlim'den, o da babasından naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem): müslümanin kardeşidir. Ona zulmetmez; onu tehlikeye atmaz. Bir kimse din kardeşinin hacetinde bulunursa, Allah da onun hacetinde bulunur. Her kim bir müslümanın bir sıkıntısını giderirse, onun sebebiyle Allah kendisinden kıyâmet sıkınalarından birini giderir. Ve her kim bir müslümanın suçunu örtbas ederse kıyâmet gününde Allah onu örtbas eder.» buyurmuşlar. hadîsi Buhârî «Kitâbu’l-Mezâlim» ile «Kitâbu’l-ikrah»'da; Ebû Dâvud ile Tirmizî «Hudûd» bahsinde; Nesâî “Kitabu'r-Recm»'de tahric etmişlerdir. İbn Mâce. Hâkim, Taberânî ve İmâm Ahmed de muhtelif lâfızlarla rivâyet etmişlerdir. kardeşliği İslâmiyet itibariyledir. Aralarında ittifak ve mutabakat bulunan iki şeye Arabcada kardeş denilir. Müslüman tabiri ; Hür, köle, baliğ ve mümeyyiz olan her ferde şâmildir, Binâenaleyh müslümanlıkta kölelerle sahipleri de kardeştirler. zulmetmez...» cümlesi emir manasınadır. Ve te'kid kabililindendir. Çünkü müslümanın müslümana zulmetmesi haramdır. Battal: «Mazluma yardım etmek farz-ı kifâyedir. Sultana ise bu farz-ı ayn olur.» demiştir. İbn Tîn ; «Müslümanın müslümana zulmetmemesi farz; onu tehlikeye atmaması ise müstehabdır.» demişle de, Aynî bunların yerine göre değişeceğini söylemiştir. suçunu örtbas etmek, kendisine gizlice tenbih ve nasi-hatta bulunmaya mâni değildir. Bu hüküm aşikâre suç işlemiyenler hakkındadır. Zamanımızda olduğu gibi, her suçu pervasızca göz önünde yapanlar bundan hariçtir. Bunlara fasık denilir ki, gıybetleri mubahtır. Resûlüllah (sallallahü aleyhi ve sellem) bu husûsda: âlem bilip dururken anmaktan çekiniyor musunuz? Onu kendisinde bulunan marifetiyle anın kir insanlar ondan sakınsın!» buyurmuştur. Gam, keder mânâsına gelir. Bir kimsenin gam ve kederini, sıkıntısını gidermek malla, canla veya mevki ile olabilir. diyor ki: «Burada mendûb olan örtbasdan murad; eziyet ve fesadla meşhur olmayan iyi hal sahipleridir. Eziyet ve fesadla meşhur olan kimseye gelince onun suçunu örtbas etmemek ve mefsedetinden korkulmazsa kendisini Ulu’l-Emre şikâyet etmek müstehab olur. Çünkü Örtbas etmek, onu daha ziyâde ezâ ve fesada tama'landırır. Hürmetleri çiğnemeye ve daha başkalarını yapmaya cesaretlendirir. Bütün bunlar olmuş bitmiş bir suçu Örtbas etmek hakkındadır. Henüz yapılmakta olan bir suçu gören kimseye ona itiraz etmek ve elinden geliyorsa men etmek vâcibdir. Tehiri helâl değildir. Men etmekten âcizse meseleyi —Bir mefsedet terettüb etmiye-ceğinden emin olmak şartiyle— Ulu’l-Emre şikâyet etmesi lâzım gelir. Râvilerin, şâhidlerin; sadaka, evkaf ve yetim mallarına nezâret eden emin kimselerin ve emsalinin cerh edilmelerine gelince: Hacet zamanında bunları cerh etmek vâcibdir. Ehliyetlerine dokunan bir halleri görülürse onu örtbas etmek helâl değildir. Bu hâl haram olan gıybetten değil, vâcib olan nasihattan ma'duddur. Ulemâ bu hususa ittifak etmişlerdir.»",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 76
			}
		}
	]
}