{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6597,
			"arabicnumber": "2591.02",
			"text": "(Bana Muhammed b. Râü' ile Abd b. Humeyd ikisi birden Abdürrezzâk'dan rivâyet ettiler. ki): Bize Ma'mer İbn Münkedir’den bu isnadda bu hadîsin mânâsının mislini haber verdi. Yalnız o: kavmin kardeşi ve aşiretin oğlu ne fenadır.» dedi. hadîsi Buhârî «Kitâbü'l--Edeb»'in bir iki yerinde; Ebû Dâvud «Kitâbu’l-Edeb»'de; Tirmizî «Kitâbu'l-Birr»'de muhtelif râvilerden tahric etmişlerdir. Battal'in beyânına göre gelen adamın ismi Uyeyne b. Hısn El-Fezârî'dir. Kendisine ahmak denilirmiş. O gün henüz inüslüman değilmiş. Fakat müslüman görünürmüş. Peygamber (sallallahü aleyhi ve sellem) herkesin bilmesi ve hâline aldanmaması için onu ashabına tanıtmak istemiştir. Bu adam Peygamber (sallallahü aleyhi ve sellem)'in sağlığında olsun, vefatından sonra olsun imanının zayıflığına delâlet eden işler yapmış. Mürtedlerle beraber o da dinden dönmüş ve esir edilerek Hazret-i Ebû Bekr'e getirilmiştir. Peygamber (sallallahü aleyhi ve sellem)’in onu: aşiretin kardeşi ne fenadır...» diye vasfetmesi nübüvvetine delâlet eden mucizelerindendir. Çünkü sonraları hâli onun vasfettiği gibi zuhur etmiştir. Resûlüllah (sallallahü aleyhi ve sellem)’in ona yumuşak davranması ve huzuruna geldiği vakit konuşmakta olduğu Abdullah İbn Ümmi Mektum'u bırakarak onunla yumuşak konuşması kavminin müslüman olmasını ümit ettiği içindir. Bunun üzerine Teâlâ Hazretleri Abese Sûresinin ilk âyetlerini indirmişti, Hadîsteki aşiretten murad kabiledir. şerif kötülüklerinden korkulan bir kimseye karşı yumuşak davranmanın ve fışkını ilân eden fasıkın zemmi caiz olduğuna delildir. Peygamber (sallallahü aleyhi ve sellem) bu adamı methetmemiş, yalnız dünyaya ait bazı hususatta kalbini İslâm'a yatıştırmak için kendisiyle yumuşak konuşmuştur",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 95
			}
		}
	]
}