{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 676,
			"arabicnumber": "291.02",
			"text": "Bize Ebu Kureyb de rivayet etti (Dedi ki) : Bize İbni Nümeyr rivayet etti. H. Bana Ebu't-Tahir'de rivayet etti. (Dediki): Bana İbni Vehb haber verdi. (Dediki): Bana Yahya b. Abdillah b. Salim ile Malik b. Enes ve Amr b. Haris hep birden Hişam b. Urve'den bu isnadla Yahya b. Said hadisinin mislini haber verdiler. DAVUDOĞLU AÇIKLAMA: «Tehuttü» ovalar demektir «tekrusu» dahî ovalamak manasına gelirsede bazılarına göre aralarında fark vardır. «Tehuttu» elle ovmak «tekrusu» ise parmakların uçları ile oğuşturmaktır. Binaenaleyh «tekrusu» kelimesinde ötekinden daha ince bir dikkat manası vardır. «Tendahu» Hattabiye göre yıkar demektir. Kurtubî ise «Bundan murad: «üzerine su serpmektir.» demiştir. Hadis-i Şerifte evvela kan bulaşan elbisenin elle ovulacağı sonra su dökerek parmakların uçları ile ovalanarak yıkanacağı bildirildiğine göre ondan sonra zikredilen «tendahu» kelimesinin manası her halde su dökmek olacaktır. Onun için de bu kelimeye Kurtubî'nin verdiği mana daha makbul görülmüştür. Çünkü Hattabî'nin kavline göre yıkama.emri lüzumsuz olarak iki defa tekrar edilmiş olsun. Nebi (Sallallahu Aleyhi ve Sellem)e gelen kadının Hz. Esma binti Ebi Bekr olduğu İmam-ı Şafiî 'nin Süfyan b. Uyeyne tarikiyle Hişamdan rivayet ettiği hadiste tasrih edilmiştir Nevevî bunu kabul etmemiş ve o rivayeti zayıf bulmuşsada kabul etmemek için sebep yoktur. Çünkü ravi kendi ismini mübhem bırakabilir. Bunun emsali bazı hadislerde görülmüştür. Binaenaleyh Hz. Esma: «Bir kadın geldi» demekle kendini kastetmiş olabilir. Bu hadisin rivayetleri muhteliftir. Bazılarında burada olduğu gibi kan bulaşan elbiseyi elle ve tırnak ucuyle ovuşturarak suyla yıkamak zikredilmiş diğer bazılarında suya sidr yani nebk ağacının yaprağını katarak yıkamak emredilmiş; hatta bir rivayette: «Sana su yeter, kanın eseri zarar etmez.» buyurulmuştur. NEVEVİ ŞERHİ: Bu babta \"Esma (radıyallahu an ha) , nın ... dedi, sonra o elbisesinde namaz kılar\" hadisi yer almaktadır. \"Hayda\" hayız (ay hali) demektir. (673) \"Onu ovalar yani onu kazır ve onu oradan giderir. Onu su ile yıkar. \" Yani parmak uçları ile temizlenmesi için su ile toplayıp, bir araya getirerek su ile yıkar. (3/199) Hadisten Çıkan Hükümler 1- Necasetin su ile yıkanması kap eder. 2- Necaseti sirke ya da benzeri başka bir sıvı ile yıkamak yeterli değildir çünkü böyle yapan kişi emrolunanı terk etmiş olur. 3- Kan necistir. Bu hususta Müslümanlar icma halindedir. 4- Necasetin izale edilmesi için belli bir sayı şartı yoktur. Aksine temizlenmesi yeterlidir. 5- Bunun dışında daha başka hükümler de vardır. Şunu bilmek gerekir ki, necasetin giderilmesinde vacip olan ayıklanıp temizlenmesidir. Şayet necaset ise -sidik ve benzeri gözle görülmeyen necaset türünden olan- hükmı bir necaset ise onun bir defa yıkanması kap eder, fazlası vacip değildir ama ikinci ve üçüncü defa yıkanması da müstehaptır. Çünkü Nebi (Sallallahu aleyhi ve Sellem) şöyle buyurmaktadır: \"Biriniz uykusundan uyanacak olursa elini üç defa yıkamadan kaba daldırmasın.\" Açıklaması daha önceden geçmiş idi. Şayet necaset kan ve buna benzer aynı(maddi) bir necaset ise aynının giderilmesi zorunludur. Aynının giderilmesinden sonra ikinci ve üçüncü defa yıkanması ise müstehaptır. Elbiseyi yıkadıktan sonra sıkmak şart mıdır? Bu hususta iki görüş vardır: Daha sahih olan görüşe göre şart olmadığıdır. Aynı necaseti yıkadıktan sonra renginin kalmasının ona bir zararı olmaz. Hatta temizlik hasıl olur. Şayet necasetin tadı kalmış ise elbise de necis demektir, tadının mutlaka izale edilmesi gerekir. Eğer kokusu kalmışsa Şafil'nin bu hususta iki görüşü vardır. Daha sahih olan görüşü temiz olacağıdır, ikinci görüşü ise temiz olmaz. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 142
			}
		}
	]
}