{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"47": "The Book of Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6775,
			"arabicnumber": "2665",
			"text": "(Bize Abdullah b. Mesleme b. Ka'neb rivâyet etti. ki): Bize Yezîd b. İbrahim Et-Tüsterî, Abdullah b. Ebi Müleyke'den, o da Kasım b. Muhammed'den, o da Âişe'den naklen rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) ; Kitabı indiren O'dur. O Kitabın bazı ayetleri muhkemattır ki, bunlar Kitabın esasıdır. Diğer bir takımları da müteşâbihdirler. Kalblerinde bozukluk olanlar, fitne çıkarmak ve te'vîline gitmek arzusuyla onun müteşabihlerine tabi olurlar. Halbuki onun te'vilini Allah'tan başka kimse bilmez. İlimde râsih olanlar: Biz ona inandık, hepsi Rabbimizin nezdindedir, derler. Ama akıl sahiplerinden başkaları ibret almazlar.\" Al-i İmran Sûresi, Âyet: 7. okudu. Âişe ki: Resûlüllah (sallallahü aleyhi ve sellem): müteşabihlerine tâbi olanları gördüğünüz vakit, onlardan sakının. Onlar Allah'ın ad verdiği kimselerdir.» buyurdu. hadîsi Buhârî «Âl-i Imrân Sûresinin tefsiri»nde; Ebû Dâvud «Sünnet» bahsinde; Tirmizî «Kitâbüt-Tefsir»'de tahric etmişlerdir. Âyet-i kerîmenin ne sebeple indiği ihtilaflıdır. Bazıları îsa (aleyhisselâm) hakkında Resûlüllah (sallallahü aleyhi ve sellem) ile mücâdele edenler için nâzil olduğunu; bir takımları da bu ümmet için indiğini söylemişlerdir. îkinci kâvü daha makbul görülmüştür. mütesâbihin tarifi hususunda müfessirlerle Usûl-ü fıkıh ulemâsı arasında ihtilâf vardır. İmâm Gazali «El-Müstesfa» adlı eserinde şunları söyler: «Tesiri hakkında sâri tarafından bir izah vârid olmadığı zaman muhkemi lügat ulemâsının bildiği yolla ve lâfzın vaz'ı yönünden tenasübüne bakarak tefsir etmek gerekir. Mütesâbih, sûrelerin başlarındaki mukatta'- harflerdir. Muhkem ise bundan geri kalanlardır, demek buna münasb düşmediği gibi, muhkem: îlimde rusûhu olanların bildiğidir. Mütesâbih İse yalnız Allahü teâlâ'nın bildiği sözdür ve keza muhkem: Va'd, tehdîd. helâl ve haramdır. Mütesabih ise, kıssalarla emsâl-. dir sözü de buna münâsib değildir. Bu sonuncusu kavillerin ihtimalden en uzağıdır. Sahih olan sudur ki. muhkem iki mânâva gelir. Birinci mânâsı acık. kendisine işkâl ve ihtimal ân/ olmavan söndür. Mütesâbih ise. kendisine ihtimal arız olan demektir. İkincisi muhkem ; Tertibi muntazam olup. va zahiren vahut te'vil suretiyle mânâ ifâde edendir. Mütesâbih ise kur', nikâh akdi elînrie olan ve lems gibi müşterek isimlerdir. Kur' hayızla temizlik arasında müşterektir. Nikâh akdi elinde olan tâbiri veli ile zevç; arasında, lems de cinsi münâsebet ve elle dokunmak arasında müşterektir.» Usûl-ü fıkıh ilmine göre muhkem nesh ihtimâlinden hâli olduğu için kuvvetçe müfe^erden ziyâde olan közdür. Mütesâbih ise ümmet irin muradın ne olduğunu bilme ümidi kalmayan sözdür. Peygamber (sallallahü aleyhi ve sellem). Allah'ın bildirmesi ile mânâsına muttali olabilir. râsih yâni derin âlimlerin mütesâbihi bilin bilemiyeceğinde de ihtilâf etmislerdir. Bazıları derin âlimlerin mütesâbihleri bildiğine kail olmuşlardır. Onlarca âvetteki ilim kelimesi üzerinde vakfedilir. Ve mânâ şöyle olur: Halbuki onun tevîlini ancak Allah ve bir de ilimde rusûhu olanlar bilir. Diğer bir takım ulemâya göre müteşâbihlerin mânâsını Allah'dan başka kimse bilmez. Derin âlimler bunların karşısında sâdece iman ettik, hepsi Rabbimiz nezdindendir, deyip geçerler. Onlara göre âyette vakıf «İllallah» kelimesindedir. Nevevî birinci kavlin esah olduğunu söylemiş: «Derin âlimler müteşâbihlerin mânâlarını bilir. Çünkü mahlûkâtından hiç birinin anlamasına imkân olmayan bir söze Allah'ın kullarını muhatab tutması ihtimalden uzaktır. Bizim ulemâmızla diğer bir takım muhakkiklar Allahü teâlâ'nın faydasız söz söylemesi imkânsız olduğuna ittifak etmişlerdir.» demişsede Nevevî'nin bu sözü söz götürür. Çünkü müteşâbihlerin mânâsını bu ümmet anlayamaz diyenler onların hâşâ nahak yere indirildiğine, faydasız olduklarına kail değildirler. Müteşabih âyetlerin ulemâyı imtihan etmek, namazda okunmak, ibâdet ve sevap niyetiyle okumak gibi, birçok faydaları vardır. Bunları kulların anlaması şart değildir. Çünkü hiç biri ahkam âyeti değildir. Ulemânın ekserisine göre müteşâbihlerin mânâları anlaşılmaz. Ashâb-ı kirâm'dan Sultanu'l-Müfessirin Hazret-i İbn Abbâs ile Abdullah b. Ömer, Übey b. Ka'b, Hazret-i Âişe, İbn Mes'ud, Urve b. Zübeyr, Ebû'ş-Şa'sâ', Ebû Nehîk ve diğer birçok-larıyla Halife Ömer b. Abdi'l-Aziz'in mezhebleri budur. Bu kavli İbn Cerîr taberi İmâm Mâlik'den de rivâyet etmiştir. Hanefîler'in mezhebi dahi budur. Şüphe ve sapıklık demektir. Kalblerinde şüphe ve sapaklık olanlardan murad; bid'at fırkalarıdır. İslâm'da ilk bid'at fırkasının Haricîler olduğu söylenir. Bunlar Hazret-i Ali zamanında meydana çıkmış, sonra birçok dallara ayrılmışlardır. Resûlüllah (sallallahü aleyhi ve sellem): yetmişüç fırkaya ayrılacaktır. Bunların bir tanesi müstesna olmak üzere hepsi cehennemi boylayacaktır.» buyurmuş. Bu bir fırka kimdir yâ Resûlüllah? diye sorulunca: ve ashabımın yolunda bulunanlar!» cevâbını vermiştir. Hadîs-i Hâkim «Müstedrek»'inde tahric etmiştir. Bu dalâlet fırkaları hakikaten fasit fikirlerini terviç için mütesâbih âyetlere tâbi olmuşlardır. Çünkü bu âyetleri tahrif imkânını bulmuşlardır. Hadîs-i şerif fitne çıkarmak için müşkil ve mütesâbih âyetlere tâbi olan sapık bid'atçılarla düşüp kalkmayı men etmektedir. ki) El-Cevnî dullah b",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 1
			}
		}
	]
}