{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 678,
			"arabicnumber": "292.02",
			"text": "Bana bunu Ahmed b. Yusuf el-Ezdî rivayet etti. (Dediki): Bize Mualla b. Esed rivayet etti. (Dediki): Bize Abdülvahid, Süleyman el-A'meş'den bu isnadla rivayet etti. Yalnız o: «Diğeri bevlden dolayı yahut bevlden temizlenmezdi.» demiş. DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın NEVEVİ ŞERHİ: Bu babta İbn Abbas (r.a.)'ın: \"Nebi (Sallallahu aleyhi ve Sellem) iki kabrin yanından geçti. .. \" diye rivayet ettiği hadis yer almaktadır. (3/200) Diğer rivayette ise: \"Sidikten -yahut bevlden- kendisini korumazdı\" denilmektedir. Hadiste geçen \"asıb\" hurma ağacı dalıdır. Nemıme (laf taşıyıcılık)nin gerçek anlamı insanlardan bazılarının söyledikleri sözleri bozgunculuk maksadıyla diğerlerine taşımaktır. İman kitabının nemımenin ağır haram olduğu babında açıklamaları açık ve etraflı bir şekilde geçmiş bulunmaktadır. Nebi (Sallallahu aleyhi ve Sellem)'in: \"La yestetiru (korunmazdı)\" kelimesi \"yestetiru\", \"yestenzihu\" ve \"yestebriu\" olarak rivayet edilmiştir. Bu üç şekilde Buhari ve başka kaynaklarda da geçmektedir, hepsi de sahihtir. Üçünün de, ondan kendisini korumaz, ondan uzak durmazdı, demektir. Allah en iyi bilendir. \"Büyük bir şeyden dolayı azap edilmiyorlar.\" Buhari'nin rivayetinde: \"Büyük bir şeyden dolayı azap edilmiyorlar ama gerçekte o büyüktür. Onlardan birisi sidikten korunmazdı\" şeklindedir. Hadisi Buhari, Kitabu'l-Edeb, Nemime Büyük Günahlardandır babında ve Vudu (abdest almak) kitabında \"halbuki büyük bir günah sebebiyle azap edilmiyorlar, ama o aslında büyüktür\" şeklinde zikredilmektedir. İşte bu sahih iki fazlalık ile bunun büyük bir günah olduğu sabit olmaktadır. Buna göre Nebi (Sallallahu aleyhi ve Sellem)'in: \"Büyük bir günah dolayısıyla onlara azap edilmiyor\" buyruğunun tevili gerekmektedir. İlim adamları bu hususta iki tevil yapmışlardır: 1- Bu onların kendi yanlış kanaatlerine göre büyük günah değildi. 2- Bu günahları ferk etmek onlar için büyük bir iş değildi. Kadı İyaz -yüce Allah'ın rahmeti ona- üçüncü bir tevil nakletmektedir: Bu en büyük günahların en büyükleri değildir. Derim ki: Buna göre bu sözlerden kasıt, başkalarını alıkoymak ve sakındırmaktır. Yani herhangi bir kimse kabir az ab ın ın ancak helake götüren en büyük günahlardan dolayı olacağını zannetmesin, çünkü başka günahlar sebebiyle de olur demektir. Allah en iyi bilendir. Bu iki günahın büyük olmasının sebebine gelince, sidikten korunmamak namazın batıl olması sonucunu doğurur. O halde bunu (korunmayı) terk etlTek şüphesiz büyük bir günahtır. Nemime (laf taşıyıcılık) ve arayı bozmak için çalışmak ise en çirkin işlerdendir. Özellikle Nebi (Sallallahu aleyhi ve Sellem) \"(laf) taşırdı\" lafzı ile çoğunlukla devamlılık bildiren bir hal için yapıldığını ifade eden bir kip kullanmıştır. Allah en iyi bilendir. Resulullah (Sallallahu aleyhi ve Sellem)'in kabirlerin üzerine iki hurma dalı parçasını koymasına gelince (3/201) ilim adamları şöyle demektedir: Bu onun o kimseler için şefaat dileğinde bulunduğu şeklinde yorumlanır. O hurma dalları kuruyuncaya kadar azaplarının hafifletilmesi ile ilgili şefaati kabul olundu. Müslim -yüce Allah'ın rahmeti ona- kitabın sonlarında uzunca bir hadis olan Cabir (r.a.)'ın iki kabir sahibi hakkındaki bu hadisi zikretmekte ve: \"Bu iki dal yaş kaldıkları sürece bu azabın üzerlerinden kaldırılması şeklindeki şefaatim kabulolundu.\" buyruğunu da kayd etmektedir. Nebi (Sallallahu aleyhi ve Sellem)'in O süre boyunca o iki kişiye dua etmeyi sürdürüyor olması ihtimali vardır diye de açıklanmıştır. Bir diğer açıklama da şöyledir: Çünkü o hurma dalları yaş kaldıkları sürece tesbih ederlerdi. Kurumuş dalın ise tesbihi olmaz. Yüce Allah'ın: \"Onu hamd ile tesbih etmeyen hiçbir şey yoktur.\" (İsra, 17/44) buyruğu hakkında müfessirlerin pek çoğunun ya da çoğunluğunun benimsediği kanaat bu olup, canlı her bir şey mutlaka onu tesbih eder anlamındadır, demişlerdir. Sonra da şu açıklamaları eklerler: Her bir şeyin hayatı kendisine göredir. Ağacın hayatı kurumadığı sürece, taşın hayatı kesilmediği sürece devam eder. Muhakkik müfessirler ve müfessir olmayanların kanaatine göre ise buyruk genel anlamı üzerine alınmalıdırDiğer taraftan bu kanaatte olanlar gerçekten mi tesbih eder yoksa bunlarda yaratana delalet mi vardır, böylelikle kendi durumu ve sureti ile Allah'ı tesbih eden ve tenzih eden bir varlık olması mı demek olduğu hususunda ihtilaf etmişlerdir. Muhakkikler onun gerçek anlamda tesbih etmediği kanaatindedir. Yüce Allah da: \"Öylesi de vardır ki Allah korkusundan yuvarlanır. \" (el-Bakara, 2/74) diye haber vermektedir. Akıl bunlarda temyiz gücünün yaratılmasını imkansız kabul etmeyip, nas da bunu ifade ettiğine göre onun dediğinin kabul edilmesi icab eder. Allah en iyi bilendir. Bu hadis dolayısıyla ilim adamları kabrin yanında Kur'an okumayı müstehab kabul etmişlerdir. Çünkü hurma dalının tesbihi sebebiyle azabın hafifletilmesi umulabiliyorsa, Kur'an-ı Kerim tilaveti için bunun öncelikle sözkonusu olması gerekir. Allah en iyi bilendir. Buhari Sahih'inde sahabi Bureyde b. Husayb el-Eslemi'nin (r.a.) kabrine iki hurma dalı konulmasını vasiyet ettiğinden söz etmektedir. Buradan anlaşıldığına göre o (r.a.) Nebi (Sallallahu aleyhi ve Selleml'in yapmış olduğu bir işin benzerini yaparak bereketinden yararlanmak istemiştir. Hattabi bu hadise dayanarak insanların hurma yapraklarını, dallarını birbirine dolamaları şeklindeki uygulamalarını kabul etmeyip, reddetmiş, bunun aslı da yoktur, açıklanabilir bir tarafı da yoktur demiştir. Allah en iyi bilendir. Bu babtaki hadislerden çıkartılan fıkhi hükümlere gelince; 1- Kabir azabı sabittir. Mutezile'ye hilafen hak ehlinin görüşü budur. 2- İkinci rivayetteki: Kendisini idrardan korumazdı, ifadesinden ötürü sidik necistir. 3- Koğuculuk (nemime) büyük bir haramdır. 4- Ve bunun dışında daha önce sözkonusu edilen diğer hususlar. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 144
			}
		}
	]
}