{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"48": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6861,
			"arabicnumber": "2703",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki) Bize Ebû Hâlid (yani; Süleyman b. Hayyan) rivâyet etti. H. İbn Nümeyr de rivâyet etti. ki): Bize Ebû Muaviye rivâyet etti. Ebû Said El-Eşecc dahi rivâyet etti. ki): Bize Hafs (yani; İbn Gıyas) rivâyet etti. Bu râvîlerin hepsi Hişam'dan rivâyet etmiştir. H. Ebû Hayseme Züheyr b. Harb da rivâyet etti. Lâfız onundur. ki): Bize İsmail b. İbrahim Hişâm b. Hassan'dan, o da Muhan b. Sîrin'den, o da Ebû Hüreyre'den naklen rivâyet etti. Şöyle der: (sallallahü aleyhi ve sellem): kim güneş battığı yerden doğmazdan önce tevbe ederse, onun tevbesini kabul eder.» buyurdular. ve gaym; ikisi de bir mânâya olup, bulut demektirler. Burada gayndan murad; kalbi kaplayan şeylerdir. Bazıları bundan gevşeklik ve zikirden gaflet kastedildiğini söylemişlerdir. Resûlüllah (sallallahü aleyhi ve sellem) bunu kendisi için suç saymış ve ondan dolayı istiğfar etmiştir. Ulemâdan bazılarına göre burada gayndan murad ümmeti hakkında duyduğu endişedir. Kendisinden sonra gelecek ümmetinin hallerine muttali olmuş ve onlar için istiğfar etmiştir. Bir takımları da: «Bunun sebebi ümmetinin işleriyle meşgul olması, düşmanla muharebe etmesi vesaire gibi şeylerdir. Onlarla meşgul olduğu için yüksek makamına nisbetle bunları suç saymıştır...» demişlerdir. Bu husûsda daha başka sözler de söylenmiştir. Tevbe, İslâm kaidelerinin en mühimidir. Ve üç şartı vardır: Günahı terketmek, yaptığına pişman olmak ve bir daha yapmamaya azmetmek. Suç insan hakkına aitse dördüncü bir şartı daha vardır ki, o da; hakkı sahibine iade etmek yahut helâllaşmaktır. Güneşin batıdan doğması tevbenin kabulü için son haddir. Bir daha tevbe kabul edilmeyecektir",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 55
			}
		}
	]
}