{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"48": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6911,
			"arabicnumber": "2725.01",
			"text": "(Bize İbn Nümeyr de rivâyet etti. ki): Bize Ab dulla! (yani; İbn İdris) rivâyet etti. ki): Bize Âsim b. Küleyb bu isnadh haber verdi. ki): Resûlüllah (sallallahü aleyhi ve sellem) bana şum söyledi: Ben senden hidayet ve doğruluğu dilerim...» Sonra yukar ki hadîsin mislini söylemiştir. Hüreyre rivâyetini Buhârî «Kitâbu’l-Mcgâzi»'de tahric etmiştir. hadîslerdeki seci'li dualar tekellüfsüz yapılan soc'in makbul olduğuna delildirler. Sec'in çirkini zorlanarak kasden yapılanıdır. Çünkü böyle bir seci' duanın huşuunu ve ihlâsım kaçırır. Düşünmeden, tekellüf yapmadan bile geliveren seci'de ise beis yoktur. Hattâ güzeldir. Çünkü bu fesahatin kemâlinden ileri gelir. Yahut evvelce ezberlenmiş de okunur. Mes'ud rivâyetindeki kebr kelimesi kibir şeklinde de rivâyet olunmuştur. Bu takdirde mânâsı başkalarına büyüklenmek demek olur. Kâdî Iyâz kebr rivâyetini daha muvafık bulmuştur. Nitekim Nesâî'nin rivâyet ettiği bir hadîs de bunu te'yid eder. Nesâî'nin hadîsinde kebr yerine «sûü’l-ömr» yani, ömrün kötülüğü denilmiştir. murad Peygamber (sallallahü aleyhi ve sellem)'e karşı çıkan kâfir kabileleridir. Hendek harbinde bunları Ccnâb-ı Hak harbsiz darbsız rüzgârla ve meleklerle dağıtmıştı. Doğruluk ve her işde ifratsız tefritsiz hareket etmektir. Resûlüllah (sallallahü aleyhi ve sellem), Hazret-i Alî'ye duâ ederken Allah'ın kendisini doğru yola sevkettiğini, bir de okunu doğrulttuğunu, yani daima hedefe isabet ettirdiğini hatırlamasını emir buyurmuştur. Bundan murad doğru yolda giden nasıl sapmaz ve okunu doğrultan nasıl hedefden şaşmazsa duâ eden kimsenin de ilminin doğru olmasına ve sünnetten ayrılmamaya çalışmasına tenbihdir. Bazıları sedâd ve hûda kelimelerini hatırlasın da unutmasın diye tenbihde bulunduğunu söylemişlerdir",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 104
			}
		}
	]
}