{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"49": "The Book of Heart-Melting Traditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6949,
			"arabicnumber": "2743.01",
			"text": "Bana Muhammed b. İshak El-Müseyyebî rivayet etti. (Dedikî): Bana Enes (yâni Ebû Damra İbni İyâd) Musa b. Ukbe'den, o da Nâfi'den, o da Abdullah b. Ömer'den, o da Resulullah (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. Ki, şöyle buyurmuşlar : «Bir zamanlar üç kişi yolda giderlerken kendilerini yağmur tutmuş ve dağda bir mağaraya sığınmışlar. Arkacığsndan mağaranın ağzına dağdan bir kaya düşmüş ve onları kapamış. Bunun üzerine yolcular birbirlerine : — Bakın Allah için sâlih amel işledinizse, o ameller vasıtasıyle Allah'a duâ edin. Ola ki, Allah bu kayayı sizden açar, demişler, içlerinden biri : — Allahım! Benim iki ihtiyar geçkin ana-babam!a, bir karım ve küçük çocuklarım vardı. Onlara iyi bakardım. Hayvanlarımı yanlarına getirdiğim vakit süt sağar, evvelâ annemle babamdan başlsyarak çocuklanmdan önce onlara içirirdim. Şu var ki: Bir gün ağaçlık beni uzaklara götürdü de akşamlayıncaya kadar gelemedim. Ve onları uyumuş buldum. Hemen evvelce yaptığım gibi süt sağdım. Ve kabı getirerek başları ucuna dikildim. Onları uykularından uyandırmaya kıyamıyor; çocuklara da onlardan evvel süt vermekten çekiniyordum. Çocuklar ayaklarımın dibinde çağrışıyorlardı. Benim ve çocukların hâli bu minval üzere fecir doğuncaya kadar devam etti. Eğer benim bunu senin rızanı dileyerek yaptığını biliyorsan, bu kayadan bize bir mikdarını arala da, ondan gökyüzünü görelim, demiş. Bunun üzerine Allah kayanın bir mikdarını aralamış ve ondan gökyüzünü görmüşler. Diğeri : — Allahım! Benim bir amcam kızı vardı. O'nu erkeklerin kadınları sevmesinin en son derecesiyle sevmiştim. Ondan kendisiyle evlenmek taleb ettim. Ama o, kendisine yüz altın getirmedikçe bunu kabul etmedi. (Çalışıp) Yoruldum. Nihayet yüz altını topladım ve ona götürdüm. Ayaklarının önüne oturduğumda : __ Ey Allah'ın kulu! Allah'dan kork ve bu mührü nahak yere açma! dedi. Ben de yanından kalktım. Eğer bunu senin rızânı dileyerek yaptığımı biliyorsan, bu kayanın bir kısmını bize aç, demiş. Allah Teâla da onlara (bir miktar daha) açmış, öteki : -- Allahım! Ben bir ölçek pirince bir çırak tutmuştum, işini bitirdiği vakit : — Bana hakkımı ver! dedi. Ben de kendisine ölçeğini arzettim. Fakat o kabul etmedi. Onu ekmeye devam ettim. Nihayet o pirinçten çobanlarıyla birlikte bir sürü sığır elde eltim. Derken bana geldi ve : __ Allah'dan kork da benim hakkıma zulmetme! dedi. Ben : __ Çobanlarıyle beraber şu sığırlara git de onları al! dedim. (Bu sefer): — Allah'dan kork! Benimle alay etme! dedi. __ Ben seninle alay etmiyorum. Bu sığırları çobanlarıyle birlikte al! dedim. O da aldı, götürdü. Eğer bunu senin rızanı taleb için yaptığımı biliyorsan, bize (kayanın) kalan kısmını da aç! demiş. Bunun üzerine Allah kalan kısmı da açmış.»",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 13
			}
		}
	]
}