{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6962,
			"text": "(Bu hadîsi bana Ahmed Ed-Dârimî de rivâyet etti. ki): Bize Habban rivâyet etti. ki): Bize Hemmam rivâyet etti. ki): Bize Katâde rivâyet etti. ki): Bize Enes b. Mâlik, Peygamber (sallallahü aleyhi ve sellem)’âcn bu hadîsin mislini rivâyet etti. rivâyetleri Buhârî «Kitâbu'd-Dcavât»'da; Tirmizî «Kitâbu'z-Zühd»'de; Nesâî «Kitâbu'n-Nuût»'da muhtelif râvilerden tahric etmişlerdir. Lügatte dönmek manasınadır. Burada ondan murad; günah-dan dönmektir. İman bahsinde de görüldüğü vecihle tevbenin üç rüknü vardır: Günahdan vazgeçmek, yaptığına pişman olmak, bir daha işleme-meye azmetmek. Ve işlediği suç kul hakkına dâirse helâllaşmak. Tevbenin en büyük rüknü pişmanlıktır. İşlenen günah büyük olsun, küçük olsun hemen Arkacığından tevbe etmenin vâcib olduğunda ulemanın ittifakı vardır. Ehl-i sünnete göre tevbenin vucûbu şeriatla sâbitdir. Tevbenin kabulü Allah'a vâcib değildir. Delâlet fırkalarından Mutezile'ye göre tevbenin vucûbu akılla sâbitdir. Ve aklen şartları bulunduğu vakit, onu kabul etmek Allah'a vâcib olur. Ehl-i sünnet'e göre tevbe eden bir kimse aynı günâhı tekrarlarsa, ikinci günâhı yazılır. Fakat evvelce yaptığı tevbesi bâtıl olmaz. yahut Dîıviye: Çorak yer, sahra mânâsına gelir. Mchlekc: Korkulacak yerdir. Müslim, Hazret-i Abdullah'ın kendine ait olan hadîsini kitabına almamıştır. Buhârî ile Tirmizî ve diğer sahih sahipleri onu da rivâyet etmişlerdir. Hadîs şudur: «Mü'min günahlarını sanki bir dağın altındaymış da üzerine düşeceğinden korkuytormuş gibi görür. Fâcir ise günahlarım burnuna konan bir sinek gibi görür de şöyle yapıverir (yani kovalar).» son rivâyetindeki «isteygaza» kelimesi Sahih-i Müslim'in bütün nüshalarında bu şekilde rivâyet edilmişse de, bazıları bunun vehim olduğunu söylemiş, doğrusu «sekata»'dır, demişlerdir. Bunun mânâsı devesine rastladı, onu tesadüfen buldu, demektir. İsteykaza, uyandı manasınadır",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}