{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"50": "The Book of Repentance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6968,
			"arabicnumber": "2750.03",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Fadl b. Dü-keyn rivâyet etti. ki): Bize Süfyan, Said El-Cüreyrî'den, o da Ebû Osman En-Nehdî'den, o da Kâtib Hanzaletü't-Teymî El-Üseyyidî'den naklen rivâyet etti. (Şöyle dedi): Peygamber (sallallahü aleyhi ve sellem)’in yanında idik. Bize cennet ve cehennemi hatırlattı... râvi yukarkilerin hadîsleri rivâyette bulunmuştur. münafık oldu.» cümlesinin mânâsı; münafık olmaktan korktu, demektir. Çünkü Peygamber (sallallahü aleyhi ve sellem)'in meclisinde bulunduğu zaman kendisini âhiret korkusu kaplar, bu hal murakabe ve fikre dalmasından belli olurdu. Oradan ayrıldıktan sonra ise zevcesiyle, çocuklarıyla ve dünya maişeti ile meşgul olurdu. Nifakın aslı içinde gizlediği kötülüğün aksini meydana çıkarmaktır. Hazret-i Hanzale bu yaptığının nifak olmasından korkmuştu. Ebû Bekr (radıyallahü anh) da aynı şeyi yaptığını söyleyince, Resûlüllah (sallallahü aleyhi ve sellem) bu yaptıklarının nifak olmadığını dâimi şekilde fikir ve murakabede bulunmaları lâzım gelmediğini kendilerine haber vererek onları teselli buyurmuştur. kelimesinin mânâsı; suâldir. Yani; ne söylüyorsun? demektir. Sonundaki (h), sekte (h) sidir. Maamafih bu işi büyük görerek ondan vazgeçirmek ve men etmek için söylenmiş olması da muhtemeldir. Taberî diyor ki: Allahü teâlâ’nın insanlık alemindeki âdeti, insanı meleklerle şeytanlar âleminin arasında orta halde yaratmak olmuştur. Melekleri sırf hayır işlemek için yaratmış. Onlar emrolunduklarmı yaparlar. Gece gündüz Allah'ı tenzih ederler ve bıkmazlar. Şeytanlara da şer ve iğva kabiliyeti vermiştir. Onlar hiç ibâdet etmezler. İnsanlık âlemini renkli yaratmıştır. İşte Rcsûlülhıh (sallallahü aleyhi ve sellem): Hanzale! Bazı zaman şöyle, bazı zaman böyle.» buyurmakla buna işaret etmiştir",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 16
			}
		}
	]
}