{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 701,
			"arabicnumber": "305.03",
			"text": "Bize Muhammed b. el-Müsenna ile İbni Beşşar rivayet ettiler. Dedilerki: Bize Muhammed b. Ca'fer rivayet etti. H. Bize Ubeydullah b. Muaz dahi rivayet etti. Dediki: Bize babam rivayet etti. Dedi ki: Bize Şu'be bu isnadla rivayet etti. İbnü'I Müsenna kendi rivayetinde: «Bize Hakem rivayet etti. İbrahîmi rivayet ederken işittim dedi» ibaresini kullandı. NEVEVİ ŞERHİ 309.sayfada. DAVUDOĞLU AÇIKLAMA: Bu hadisi Buharî «Kitabul-gusl» de muhtelif ravîlerden tahriç etmiştir. Nitekim Müslim de burada muhtelif ravîler vasıtasiyle onu Hz. Aişe. İbnî Ömer Ebu Saîd-i Hudrî ve Ene (R.A.) dan tahriç etmiştir. Bu babta Ebu Davud ve başkaları Hz. Ali (R.A.) dan merfu' bir hadis rivayet etmişlerdir. O hadiste: «Şüphesiz ki içinde köpek, suret ve cünüb bulunan eve melekler girmez.» denilmektedir: Bazıları babımız hadisi için: «Buharî bunu Ebu Davud hadîsinin zayıf olduğuna işaret olmak üzere tahrîc etmiştir» demişlerdir. Fakat bu söz doğru değildir. Çünkü evvela Ebu Davud hadisi zayıf değil sahihtir. Onun sahih olduğunu İbni Hıbban ve Hakim tasrih etmişlerdir. Zayıf olduğunu söyleyenler isnadında Nüceyy-i Hadramî bulunduğunu bu zattan yalnız oğlu Abdullah rivayet ettiğini onunda meçhul olduğunu söylersede mezkur Abdullahın meçhul değil mevsuk bir zat olduğunu Iclî beyan etmiştir. Binaenaleyh hadisin sıhhatına bir diyecek yoktur. Sonra bu hadîsten murad yıkanmaya kulak asmayıpta cünüp gezmeyi adet edinen ve cünüb olduğu halde üzerinden bir veya birkaç vakit namaz geçenlerdir ki zamanımız hakkında pek mühim bir hüccettir. Çünkü bu gün bir çok kimselerin boyuna cünüb gezdiklerini hatta bir çoklarının cünüblük nedir; bu babta ne gibi bir vazife vardır bilmediklerini kimi gıyaben kimi şifahen işitiyoruz. İşte hadis-i şerif böyle müslümanlara şiddetli bir ihtardır. Ve adeta kulaklarından çekercesine: «Eğer müslümansanız müslümanlığın şerait ve adabını Öğrenin! Bu perişan halinizle sizin evlerinize melekler girmez. Müslüman olduğunuza şehadet edecek kimse bulunmaz; tuttuğunuz şeytanî yol göz göre göre sizi esfel-i safilî'ne götürür...» demektir. Hadisin maazallah dinden dönmüş mürtedlerle yahut müslüman olmayanlarla alakası yoktur. Onun ihtarı müslüman olduğu halde bu gibi cürümleri irtikab edenlerdir. Babımız hadîsine gelince; o da muhtelif rivayetleri ile cünüblüğün hükmünü bildirmektedir. Hulaseten söylemek lazım gelirse hüküm, şudur. Cünüb olan bir kimseye derhal yıkanmak müstehab olmakla beraber farz değildir. Yıkanmayı namaz vakti gelinceye kadar yahut Kur'an-ı kerimi ele almak, okumak. Kabeyi tavaf etmek ve secde-i tilavet gibi cünüp olarak yapılması yasak olan bir ibadeti yapmak isteyinceye kadar tehir edilir. Fakat bunlardan hiç birini cünüb olarak yapamayacağı için o anda yıkanması farz olur",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 23
			}
		}
	]
}