{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7016,
			"text": "(Bana Benî Ümeyye'nin azatlısı Ebû't-Tâhir Ahmed b. Amr b. Âbdillah b. Amr b. Sech rivâyet etti. ki): Bana İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihab'dan naklen haber verdi. İbn Şihab Şöyle dedi: Sonra Resûlüllah (sallallahü aleyhi ve sellem) Te-bûk gazasına gitti. Halbuki kendisi Romalılarla şam'daki hıristiyan Arab-ların üzerine gitmek istiyordu. Şihâb Şöyle dedi: Bana Abdurrahman b. Âbdillah b. Ka'b b. Mâlik haber verdi ki, Abdullah b. Ka'b oğullarından Ka'b'ın gözleri gor-mez olunca onun yedekçisi olmuş. ki) ; Ben Ka'b b. Mâlik'i Tebûk gazasında Resûlüllah (sallallahü aleyhi ve sellem)’den geri kaldığı vakit kendi macerasını anlatırken dinledim. Ka'b b. Mâlik şöyle dedi: Ben Resûlüllah (sallallahü aleyhi ve sellem)’in yaptığı gazaların hiç birinden geri kalmadım. Yalnız Tebûk gazası müstesna! Bir de Bedir gazasında bulunmamıştım. Ama o bu gazada bulunmayan hiç bir kimseyi muaheze buyurmadı. Resûlüllah (sallallahü aleyhi ve sellem) ile Müslümanlar ancak Kureyş'in kervanını kastederek yola çıkmışlardı. Neticede Allah onlarla düşmanlarını vakitsiz olarak bir yere getirdi. Gerçekten ben Resûlüllah (sallallahü aleyhi ve sellem) Akabe gecesinde ona İslâmiyet üzerine ahdû peyman verdiğimiz vakit beraber bulunmuşumdur. Her ne kadar Bedir insanlar arasında Akabe'den daha ziyâde dillere destan ise de ben Akabe'nin yerine Bedir gazası olsaydı diye dilemem. Tebûk gazasında Resûlüllah (sallallahü aleyhi ve sellem)’ den ayrıldığım zaman hikâyem şudur: Ben hiç bir vakit bu gazada ondan ayrıldığım zamankinden daha kuvvetli ve daha zengin bu-lunmamışımdır. Vallahi ondan önce iki yük devesini hiç bir zaman bir araya getirmemişimdir. Nihayet bu gazada İki deveyi bir araya getirdim. Resûlüllah (sallallahü aleyhi ve sellem) bu gazayı şiddetli bir sıcakta yaptı. Uzak bir sefere ve çöle gitti. Kalabalık düşman karşısına çıktı ve gazalarının hazırlıklarını tutabilmeleri için yapacakları işi müslümanlara açık bildirdi. Nereye götürmek istediğini onlara haber verdi. Resûlüllah (sallallahü aleyhi ve sellem)'in beraberindeki müslümanlar çoktu. Onların sayısını bir muhafızın kitabı cem'edemez. (Bu sözle asker kütüğünü kastediyor.) Ka'b sözüne şöyle devam etmiş. Az kimse vardı ki, (askerden) kaçmak istesin de bu babda Allah (azze ve celle)'dan bir vahy inmedikçe Peygamber (sallallahü aleyhi ve sellem)'in bunu bilmeyeceğini zannetmesin. Resûlüllah (sallallahü aleyhi ve sellem) bu gazayı meyveler ve gölgeler kemâle geldiği vakit yaptı. Ben bu gazaya en ziyade gönül veren bir kimse idim. Derken Resûlüllah (sallallahü aleyhi ve sellem) ve onunla birlikte müslümanlar hazırlandılar. Ben de onlarla birlikte hazırlanayım diye sabahlamağa başladım. Fakat hiç bir şey yapmadan dönüyor; kendi kendime: Ben buna istediğim zaman kadirim, diyordum. Bu hal bende devam etti. insanlar çalışmakta devam ettiler. Ve Resûlüllah (sallallahü aleyhi ve sellem) müslümanlar da beraberinde olduğu halde yola çıkmak üzere sabahladı. Ben hazırlığım namına hiç bir şey yapmamıştım. Sonra sabahladım ve yine hiç bir şey yapmamış olarak döndüm. Bu hâlim devam etti. Hattâ müslümanlar acele yola çıktılar ve gaziler ilerlediler. İçimden yola revan olarak onlara yetişmek geçti. Keşke yapsaydım. Sonra bana bu mukadder olmadı. Resûlüllah (sallallahü aleyhi ve sellem) çıkıp gittikten sonra insanlar arasına çıktığında ona uymamış olmak beni üzmeye başladı. Bundan yalnız nifakla müttehem yahut zayıflardan Allah'ın mazur gördüğü kimse müstesna olabilirdi. Resûlüllah (sallallahü aleyhi ve sellem) Tebûk'e varıncaya kadar beni anmamış. Tebûk'de cemaatın içerisinde otururken: «Ka'b b. Mâlik ne yaptı?» diye sormuş. Benî Selime (kabilesin)'den bir zât: Ya Resûlallah! Onu elbisesi ve o elbisenin yakalarına bakmasi alıkoydu, demiş. Bunun üzerine Muâz b. Cebel ona: Ne kötü söyledin! Vallahi ya Resûlüllah onun hakkında hayrdan başka bir şey bilmiyoruz, demiş. Resûlüllah (sallallahü aleyhi ve sellem) sükût buyurmuş. O bu halde iken kendisiyle serap kaybolan beyaz el giymiş bir zât görmüş. Resûlüllah (sallallahü aleyhi ve sellem): Ebû Hayseme olmalısın!» buyurmuş. Bir de bakmışlar ki Ebû Hayseraete'l-Ensârîdir. Kendisini münafıklar ayıpladıkları vakit ölçek kuru hurma tasadduk eden zat budur. b. Mâlik sözüne şöyle devam etmiş: Resûlüllah (sallallahü aleyhi ve sellem)’in Tebûk'den dönerek gelmekte olduğunu duyunca beni üzüntü kapladı. Yalan söylemeyi düşünmeye başladım. Yarın onun hısımımdan ne ile kurtulurum, diyordum. Bu hususta ailemin her fikir sahibinden! yardım istiyordum. Bana Resûlüllah (sallallahü aleyhi ve sellem)’in gelmesi yaklaştığı söylenince bâtıl düşünce benden gitti. Anladım ki, ondan hiçi bir şeyle ebediyyen kurtulamam. Ve ona doğru söylemeye niyet ettimi. Resûlüllah (sallallahü aleyhi ve sellem)'in gelişi sabahlayın oldu. Bir seferden geldiği vakit evvelâ mescidden işe başlardı. Orada iki rekât namaz kıldı. Sonra halkla görüşmek üzere oturdu. O bunu yapınca gazaya gitmeyenler gelerek kendisinden özür dilemeye ve ona yemin etmeye başladılar. Bunlar seksen küsur kişi idiler. Resûlüllah (sallallahü aleyhi ve sellem) de onların açık beyanatını kabul etti. Kendileriyle bey'atda bulundu ve bular için istiğfar etti. Gizli taraflarım da Allah'a havale etti. Nihayet beri geldim. Selâm verdiğim vakit kızgın bir kimsenin tebessümü ile gülümsedi. Sonra: dedi. Ben de yürüyerek geldim ve huzuruna oturdum. Bana: gazadan geri kaldın? Hayvanını satın almamış miydin?» dedi. Ben: ya Resûlallah! Vallahi ben dünya halkından senden başka birinin yanında otursaydım, onun hısımından bir özürle kurtulurdum sanırım. Bana fasahat da verilmiştir. Lâkin ben vallahi bildim ki, bugün sana seni razı edecek bir yalan söylesem, Allah'ın hısımına uğramam yakındır. Sana doğruyu söylesem bu hususta bana gücenirsin. Ben sözüm hususunda Allah'ın ukbasını dilerim. Vallahi hiç bir Özürüm yoktu. Vallahi senden geri kaldığım zamankinden daha kuvvetli ve daha zengin olduğum hiç bir zaman yoktur, dedim. Resûlüllah (sallallahü aleyhi ve sellem) gelince: Hakikaten doğruyu söyledi. İmdi Allah senin hakkında hükmünü verinceye kadar kalk (git)!» buyurdu. Ben de kalktım. Benî Se-lime'den bir takım adamlar da kalkarak peşime takıldılar ve bana: Vallahi! Senin bundan Önce hiç bir günah işlediğini'bilmiyoruz. Hakikaten sen gazaya gitmeyenlerin Resûlüllah (sallallahü aleyhi ve sellem)'e beyan ettikleri özürle özür dilemekten âciz kaldın. Senin günahına Resûlüllah (sallallahü aleyhi ve sellem)'in sana istiğfarda bulunması yeterdi, dediler. şöyle demiş: Vallahi! Beni o kadar muaheze ettiler ki, Resûlüllah (sallallahü aleyhi ve sellem)'e dönerek kendimi yalanlayacağım geldi. Sonra onlara: Buna benimle birlikte bir kimse düçâr oldu mu? dedim. Evet! Seninle birlikte iki adam duçar oldu. Onlar da senin söylediğin gibi söylediler. Ve onlara da sana söylendiği gibi söylendi, dediler. Kim onlar? diye sordum. Murâra b. Rabîate'l-Amirî ile Hilal b. Ümeyyete'l-Vâkıfî dediler. Ve bana Bedr gazasına iştirak etmiş, kendilerine uyulacak iki sâh zât söylediler Bana bunları anlatınca oradan gittim. Resûlüllah (sallallahü aleyhi ve sellem) kendisinden ayrılanlar arasından biz üç kişiyle konuşmaktan müslümanları nehiy buyurdu. Bunun üzerine halk bizden kaçındı. Bize karşı halleri değişti. Hattâ benim nazarımda yer de değişti. Artık o bild'ğim yer değildi. Bu minval üzere elli gece durduk. İki arkadaşım boyun bükerek ve ağlayarak evlerinde oturdular. Bana gelince: Ben kavmin en genci ve en metini idim. Evden çıkıyor, namaza geliyor, çarşılarda dolaşıyordum. Fakat benimle kimse konuşmuyordu. Namazdan sonra oturduğu yerde iken Resûlüllah (sallallahü aleyhi ve sellem)'e gelerek selâm veriyor; ve içimden; acaba selâmı almak için dudaklarını kıpırdatt îm, kıpırdatmadı mı diyordum. Sonra ona yakın bir yerde namazımı kılıyor, ona gizlice bakıyordum. Ben namazıma yöneldim mi, bana bakıyor, ona doğru baktım mı benden yüz çeviriyordu. Müslümanların bu cefâsı üzerimde uzun zaman devam edince giderek Ebû Katâde'nin bahçesi duvarından tırmandım. Ebû Katâde amcamdır. Ve en sevdiğim bir insandır. Ona selâm verdim. Vallahi selâmımı almadı. Kendisine: Ey Ebû Katâde! Allah aşkına söyle, benim Allah ve Resûlünü sevdiğimi Hlir misin? dedim. Ebû Katâde sustu. Tekrar Allah aşkına söylemesini istedim. Yine sustu. Tekrar istedim (bu sefer): Allah ve Resûlü bilir! dedi. Bunun üzerine gözlerim boşandı ve döndüm. Duvardan çıktım. defa Medine'nin çarşısında yürürken Şamlıların Acem fellâhlarından Medine'ye yiyecek satmaya gelenlerden bir fellaha rasladim. Bana Ka'b b. Mâlik'i kim gösterecek, diyordu. Halk beni göstererek kendisine işaret etmeye başladılar. Nihayet yanıma gelerek bana Gassân kiralından bir mektub verdi. Yazıcı idim. Mektubu okudum. Gördüm ki, içinde şunlar var: sonra (malûm olaki) seninkinin sana cefâ ettiğini duyduk. Allah seni ne hakaret diyarında yaratmıştır. Ne de hakkin zayi olacağı yerde. Hemen bize katıl ki, sana yardımda bulunalım. okuduğum vakit: Bu da belânın bir çeşidi, dedim ve tandıra yönelerek mektubu orada yaktım. Nihayet elli gecenin kırkı geçip vahy duraklayınca anîden Resûlüllah (sallallahü aleyhi ve sellem)’in elçisi bana geldi. Ve: Resûlüllah (sallallahü aleyhi ve sellem) sana karından uzaklaşmanı emrediyor, dedi. Onu boşayayım mı, yoksa ne yapayım? dedim. Hayır! Sadece ondan uzaklaş ona asla yaklaşma! dedi. iki arkadaşıma da bunun gibi haber göndermiş. Bunun üzerine karıma: Ailen nezdine dön de, Allah bu işde bir hüküm verinceye kadar onların yanında kal! dedim. Müteakiben Hilal b. Ümeyye'nin karısı Resûlüllah (sallallahü aleyhi ve sellem)'e geldi. Ve ona: Ya Resûlallah Gerçekten Hilâl b. Ümeyye zayi olmuş bir ihtiyardır; hizmetçisi yoktur. Ona hizmet etmemi kerih görür müsün? dedi. (sallallahü aleyhi ve sellem): Lâkın sana asla yaklaşmasın!» buyurdu. Kadın: Vallahi onun hiç bir şeye davranmaya vakti yok! Ve vallahi! Bu işi başına geleliden bugüne kadar ağlamakta devam etti, dedi. Bunun üzerine ailemden biri bana: Sen de Resûlüllah (sallallahü aleyhi ve sellem)'den zevcen hakkında İzin istesene! (bak) Hilâl b. Ümeyye'nin karısına. Hilâl'e hizmet etmek için izin verdi, dedi. Ben: Onun hakkında Rcsûlülkıh (sallallahü aleyhi ve sellem)'den . isteyemem. Ben genç bir adamım. Onun hakkında Resûlüllah (sallallahü aleyhi ve sellem)'den izin istediğim vakit tana ne söyleyeceği ne malûm! dedim. Ve bu minval üzere on gece durdum. Bu suretle bizimle konuşmak yasak edildiği zamandan itibaren elli gecemiz tamamlandı. Sonra ellinci gecenin sabahında sabah namazını evlerimizden birinin üzerinde kıldım. Ve Allah Teâlâ'nın hakkımızda beyân buyurduğu hal üzere otururken beni bir sıkıntı bastı. Bana yer bütün genişliğine rağmen dar geldi. Sel' dağı üzerine çıkmış bağıran bir kimsenin sesini işittim. Var sesiyle: Ka'b b. Mâlik, müjde! diyordu. Hemen secdeye kapandım. Ve anladım ki, şadumanî gelmiştir. Derken Resûlüllah (sallallahü aleyhi ve sellem) sabah namazını kıldıktan sonra Allah'ın bizim tövbemizi kabul ettiğini halka bildirdi. Bunun üzerine halk bizi müjdelemeye yürüdüler. İki arkadaşıma müjdeciler gitti. Bir adam da bana gelmek üzere at mah-muzladı. Eşlem kabilesinden biri koşarak tarafıma geldi. Ve dağa çıktı. Ses attan daha sür'atli idi. Sesini işittiğim zât bana müjdeye gelince hemen iki elbisemi çıkararak müjdesinden dolayı ona giydirdim. Vallahi bunlardan başkasına o gün Mâlik değildim. Ve emaneten iki elbise alarak onları giydim. Hemen Resûlüllah (sallallahü aleyhi ve sellem)’i görmek isteyerek yola düştüm. Halk takım takım karşıma çıkıyor, tevbeden dolayı beni tebrik ediyor: Allah'ın tevbeni kabul buyurması sana mübarek olsun! diyorlardı. Nihayet mescide girdim. Bir de baktım Resûlüllah (sallallahü aleyhi ve sellem) mescidde oturuyor. Etrafında da insanlar var. Derken Talha b. Ubeydillah kalkarak sür'atle yanıma geldi. Benimle musâfaha etti. Ve beni tebrikte bulundu. Vallahi muhacirlerden ondan başka kimse kalkmadı. ki: Ka'b Talha’nın bu yaptığım hiç unutmuyordu. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) selâm verdiğim vakit yüzü sevinçten parlıyor ve: seni doğuralıdanberi üzerinden geçen en hayırlı gün sana müjdeler olsun!» diyordu. Ben: Bu senin tarafından mı, yoksa Allah tarafından mı ya Resûlallah! dedim. Bilâkis Allah tarafından!» buyurdu. Resûlüllah (sallallahü aleyhi ve sellem) sevindiği vakit yüzü nurlanır, sanki yüzü bir ay parçası gîbi olurdu. Biz bunu bilirdik. oturduğum vakit: Ya Resûlallah! Benim tevbemden biri de Allah ve Resûlü (sallallahü aleyhi ve sellem) için sadaka olmak üzere malımdan sıyrılmamdır, dedim. (sallallahü aleyhi ve sellem): bir kısmını tut! Bu senin için daha hayırlıdır.» buyurdu. Ben Hayber'den aldığım hissemi tutuyorum, dedim ve ilâve ettim: Ya Resûlallah! Şüphesiz ki, Allah beni doğruluk sayesinde kurtardı. Benim tevbemden biri de yaşadığım müddetçe doğrudan başka bir söz söylememektir. bunu Resûlüllah (sallallahü aleyhi ve sellem)’e söylediğimden bugüne kadar müslümanlardan hiç birine doğru söz söyleme hususunda Allah'ın bana olan ihsanından daha güzel in'amda bulunduğunu bilmiyorum. Vallahi bunu Resûlüllah (sallallahü aleyhi ve sellem)'a söylediğimden bugüne kadar kasden hiç bir yalan yapmadım. Geriye kalan ömrüm hususunda da Allah'ın beni muhafaza buyurmasını dilerim. Ka'b Şöyle dedi: Bunun üzerine Allah (azze ve celle): \"Muhakkak Allah Peygamberin ve güçlük anında ona tâbi olan muhacirlerle ensarın —içlerinden bir fırkanın kalbleri hemen hemen sapmak üzere bulunduktan sonra tevbelerinî kabul etti. Evet, onların tevbelerini kabul etti. Çünkü Allah onlara şefkatli ve merhametlidir. Geriye bırakılan ve kendilerine bunca genişliği ile yer dar gelen kendi nefisleri de dar gelen üç kişinin de (tevbesini kabul ettî).\" Sûre-i Tevbe, âyet: 117-118 âyetlerini indirdi. Ta: iman edenler, Altah'dan korkun ve doğru söyleyenlerle beraber olun!\" âyetine kadar vardı. ki: Vallahi Allah beni İslâm için hidayete erdirdikten sonra, kendi nefsimce Resûlüllah (sallallahü aleyhi ve sellem)’e söylediğim doğru sözden daha büyük hiç bir nimet vermemiştir. Ona yalan söylevîp de yalancıların helâk olduğu gibi helam olmam meselesi! Gerçekten Allah yalancılar için vahyi indirdiği vakit, bir kimseye söyleyeceği en kötü şeyi söylemiştir. Allah buyurmuştur ki: yanına döndüğünüz vakit kendilerine bir şey söylemeyin diye sizin İçin Allah'a yemin edeceklerdir. Onlardan hemen yüz çevirin! Çünkü onlar necîstir. Ve kazandıklarına karşılık yerleri cehennemdir. Kendilerinden razı olasınız diye size yemin ederler. Siz onlardan razı olursanız şunu muhakkak bilin ki, Allah fas'k kavimden razı olmaz.\" Sûre-i Tevbe, âyet: 95-96. Şöyle dedi: Biz üç kişi Resûlüllah (sallallahü aleyhi ve sellem)’in yemin ettikleri vakit, yeminlerini kabul ederek kendileriyle bey'at yaptığını ve haklarında istiğfarda bulunduğu kimselerin işinden geri bırakılmıştık. Resûlüllah (sallallahü aleyhi ve sellem) bizim işimizi Allah hükmünü verinceye kadar tehir etmişti. İşte bu sebeple Allah (azze ve celle): bırakılan üç kişinin tevbesini de...» buyurmuştur. Bizim Allah’ın zikrettiği geri kalmamız (meselesi), gazadan geri kalmamız değildir. O ancak Peygamber (sallallahü aleyhi ve sellem)’in bizi tehir etmesi ve işimizi kendisine yemin vererek özür dileyen ve onun da Özrünü kabul ettiği kimselerden sonraya bırakmasıdır",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}