{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"50": "The Book of Repentance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7019,
			"arabicnumber": "2769.04",
			"text": "(Bana Seleme b. Şebîb de rivâyet etti. ki): Bize Hasen b. A'yen rivâyet etti. ki): Bize Ma'kıl (bu zat İbn Ubeydillah'dır.) Zührî'den rivâyet etti. ki): Bana Abdurrahman b. Abdillah b. Ka'b b. Mâlik, amcası Ubeydullah b. Ka'b'dan naklen haber verdi. Bu zat Ka'b gözünden rahatsızla di ğı vakit onun yedekçisi ve kavminin en âlimi ashâb-ı Resûlüllah (sallallahü aleyhi ve sellem)’in hadîslerini en belleyen bir kimse imiş. ki): Babam Ka'b b. Mâlik'den dinledim. O tevbeleri kabul edilen üç kişiden biridir. Anlatıyordu ki: Kendisi Resûlüllah (sallallahü aleyhi ve sellem)'in yaptığı gagalardan iki gazadan başka hiç birinden geri kalmamış... Ve hadîsi nakletmiştir. Bu hadîsde o şunu da söylemiştir: «Resûlüllah (sallallahü aleyhi ve sellem) on binden fazla kalabalık insanlarla gazaya gitmişti. Onları bir muhafızın divanı toplayamaz.» Bu hadîsi Buhârî kimi uzun kimi kısa olmak üzere kitabınır. on yerinde «Meğâzi», «Cihad», «Sufatû'n-Nebi», «Vüfûdu'l-Ensar», «Tefsir», «İstizan» ve «Ahkâm» bahislerinde; Ebû Dâvud ile Nesâi «Talâk» bahsinde tahric etmişlerdir. Ka'b b. Mâlik ensardandır. Ebû Abdillah kün yesini taşır. Cahiliyyet devrinin şâirlerinden biridir. İkinci Akabe beyatında bulunmuş, Bedr'le Tebûk gazalarından maada Peygamber (sallallahü aleyhi ve sellem) ile birlikte bütün harblere iştirak etmiştir. Son ömründe gözleri görmez olmuştu. Elli tarihinde Muâviye'nin hilâfe zamanında yetmişyedi yaşında vefat etmiştir. Medîneli'lerden sayılır. Tabiînden bir cemaat kendisinden hadîs rivâyet etmişlerdir. gazası Gazvetü’l-Usra yani; (Darlık gazası) namıyla da anılır. Tebûk, Medine ile Şam arasında, Medîne'ye ondört konak, Şam'a ise onbir konak mesafede bağlık, bahçelik bir yerdir. Bu gaza Resûlüllah (sallallahü aleyhi ve sellem)'in bizzat iştirak ettiği son gazâsıdır. Zûr'at Er-Razî'nin rivâyetine göre, Peygamber (sallallahü aleyhi ve sellem) bu gazaya yetmişbin kişi ile iştirak etmiştir. İbn. İshâk gazilerin otuzbin kişi olduğunu söylemiştir ki, bu kavil daha meşhurdur. Ulemâdan bazıları bu iki rivâyetin arasını bularak: «Ebû Zür'a tâbir ve metbu' bütün gazileri saymış. İbn İshâk ise yalnız metbuları nazar-ı itibâre almıştır.» demişlerdir. (sallallahü aleyhi ve sellem) bu gazadan harbe lüzum kalmadan dönmüştü. gecesinden murad; Medîneli ensarın Peygamber (sallallahü aleyhi ve sellem)'e bey'at ederek, ona yardım edeceklerine dair söz verdikleri gecedir. Akabe, Mina'nin kenarında bir yerdir. Cemratû’l-Akabe denilen şeytan taşlaması burada yapılır. Akabe bey'atı iki senede birer defa yapılmıştır. Birinci sene ensardan on iki kişi, ikinci sene yine ensardan yetmiş kişi bey'at etmişlerdir. Görülüyor ki Hazret-i Ka'b hiç bir özrü yokken nefsine uyarak Tebûk gazasına iştirak etmemiş, fakat sonradan buna pek ziyâde üzülmüştür. Resûlüllah (sallallahü aleyhi ve sellem),Tebûk'de onu sorduğu zaman Benî Selime kabilesinden bir zât: «Onu elbisesi ve yakasına bakmak alıkoydu.» demiş. Bununla onun kendini beğenmiş biri olduğuna ve elbisesiyle böbürlendiğine işaret etmiştir. beyânına göre bu sözü söyleyen Abdullah b. Üneys'dir. Yine Vâkıdi'nin beyânına göre, Tebûk harbine iştirak etmeyen seksen küsur kişi ensârın münafıklarındanmış. Resûlüllah (sallallahü aleyhi ve sellem) Benî Gıfar ve diğer kabilelerden sekseniki bedevinin özürlerini kabul etmiş. Ka'b'a atla müjdeye gelen zat bir rivâyete göre Zübeyr b. Avvam , diğer bir rivâyete göre Hamza b. Amr'dır. Diğer iki arkadaşından Hilâl b. Ümeyye'nin müjdecisi Saîd b. Zeyd, Murara'nın müjdecisi de Silkân b. Selame yahut Seleme b. Vakş'dır. kendisini tebşir eden ve Hazret-i Talha b. Ubeydillah’dır. Bu zat cennetle müjdelenen on kişiden biridir",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 64
			}
		}
	]
}