{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"50": "The Book of Repentance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7022,
			"arabicnumber": "2770.03",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Muhammed b. Ala' rivâyet ettiler. (Dediler ki): Bize Ebû Üsâme, Hişâm b. Urve'den, o da babasından, o da Âişe'den naklen rivâyet etti. (Şöyle dedi): Benim haberim yokken hakkımda söylenenler söylendiği vakit Resûlüllah (sallallahü aleyhi ve sellem) hutbe okumak üzere ayağa kalktı da, teşehhüd getirdi. Allah'a ehil olduğu şekilde bamdü senada bulundu. Sonra şunu söyledi: sonra! Bana zevcemi itham eden bir takım insanlar hakkında düşüncenizi söyleyin. Allah'a yemin ederim ki, ben ailemden hiç bir kötülük bilmem. Onları kiminle itham ettiler. Vallahi o zât hakkında hiç bir kötülük bilmem. Benim evime ben yanında olmaksızın hiç girmemiştir. Ne zaman bir sefere gidersem, o da benimle beraber gitmiştir...» hadîsi kissasıyle nakletmiştir. Bu hadîsde şu da vardır: «Ger çekten Resûlüllah (sallallahü aleyhi ve sellem) evime girerek cariyeme sor du. o da: Vallahi onun hiç bir kusurunu bilmem. Şu kadar var ki, uyuklar. Hattâ koyun girerek hamurunu yerdi. (Râvî Hişam acîn mi dedi, hamîr mi şekketmiştir.) Bunun üzerine cariyeyi arkadaşlaruıdan biri azarladı ve: Resûlüllah (sallallahü aleyhi ve sellem)'e doğruyu söyle, dedi. Nihayet cariyeye meseleyi açıkladılar. Câriye: Subhânallah! Vallahi onun namına kuyumcu kırmızı altın külçesi için neyi biliyorsa, ben de onu bilirim, dedi. mesele, hakkında dedikodu edilen adamın kulağına vardı. O da: Sübhanallah! Vallahi ben hiç bir kadın elbisesi açmadım, dedi. Âişe: Bu zât Allah yolunda şehid olarak Öldürüldü, demiş.» bu hadîsde şu ziyâde vardır: «İftirayı dile dolayanlar Mistah, Hınıne ve Hassan idiler. Münafık Abdullah b. Übey'ye gelince bu meseleyi o kurcalıyor, o topluyordu. Onun büyük kısmını üzerine alan kendisi İle Hınıne'dir.» hadîsi Buhârî «Kitabut-Tefsir»'de ve kimi uzun, kimi kısa olmak üzere Sahîh'inin birkaç yerinde tahric etmiştir. bazıları Zührî'nin bu hadîsi dört rivâyeti bir araya getirmek suretiyle naklini tenkid etmiş ve: «Zührî bu rivâyetleri ayrı ayrı nakletmeliydi.» demişlerse de Nevevî bunlara cevab vermiş: Zührî'nin yaptığı caiz olduğunu; bunda hiç bir kerahet bulunmadığım bildirmiştir. Zührî'nin rivâyetlerini biraraya topladığı hafızlar tabiînin en büyüklerinden sayılan İmâmlardır. Üstelik hadîsin bir kısmını birinden, diğer yerini ötekinden aldığını bildirmiştir. Hadîsin hangi parçasını kimden aldığını'bildirmemesi zarar etmez, öyle br hadîsle ihticac şahindir. Çünkü râvîleri mevsukdur. Bir hadîs hakkında râvî: «Bunu bana Zeyd yahut Amr rivâyet etti...» dese, ikisi de mu'temed olmak şartıyle o hadîs bilittifak hüccet olur. Yalan demektir. Bazıları yalanın en çirkini mânâsına geldiğini söylemişlerdir. Bu kelime esas itibariyle bir şeyi tersine çevirmek mânâsına gelir. Burada da Hazret-i Âişe (radıyallahü anha) hâiz olduğu iffet ve şeref itibariyle hamdü senaya lâyık iken, ona iftira atanlar bunu tersine çevirerek kendisine bühtanda bulunmuşlardır. Hazret-i Âişe'nin kur'a çekerek iştirak ettiği bu gaza Benî Müstalik gazâsıdır. Kendisi o zaman henüz onbeş yaşını doldurmamıştı. Ordudan bir parça geri kalmayla üzerine en çirkin iftirayı atanlar: Başta münafıkların reisi Abdullah b. Übey olmak üzere Zeyd b. Rıfâa, Hassan b. Sabit, Mistah b. Üsâse, Hanıne binti Cahş ve yardımcılarıdır. Bunlardan Mistah , Hazret-i Âişe'nin akrabasıdır. Mistah, çadır direği mânâsına gelir. Bu kelime onun lâkabıdır. İsmi Avf'dır. Hâdise hadîs-i şerifte tafsilâtiyle anlatılmıştır. Neticede masum olan Ümmü'l-Mü'minin Âişe (radıyallahü anha) validemizin beraeti hakkında Teâlâ Hazretleri birbiri ardınca tam onse-kiz âyet indirmiştir. yahut Tease: Ayağı kaydı, helâk oldu, kendisine kötülük lâsım geldi, uzak oldu ve yüzü üstü düştü mânâlarına gelir. hentahu kelimesi kadınlara mahsus bir nidadır. Bâzılarına göre ey kadın, diğer bâzı ulemâya göre ey şaşkın kadın, mânâsına gelir. Özür almaktan murad; bazılarına göre yardımda bulunmaktır. Hazret-i Zeyneb'in: «Ben kulağımı ve gözümü korurum...» sözünden maksadı işitmemişken işittim demekten; görmemişken gördüm demekten korunurum demektir. elbisesi açmamak tâbiri kadınlarla cinsi münasebette bulunmamaktan kinayedir. Alî'nin: «Ondan başka kadınlar çoktur...» sözü Peygamber (sallallahü aleyhi ve sellem) için maslahat ve nasihat icâbı söylenmiş bir sözdür. Yoksa —Hâşâ— Hazret-i Âişe hakkında söylenenlere inanmış değildir. indikten sonra annesinin Hazret-i Âişe'yi Peygamber (sallallahü aleyhi ve sellem)'e göndermesi, ona teşekkür etsin ve başından Öpsün, di-yedir. Âişe (radıyallahü anha) ise Peygamber (sallallahü aleyhi ve sellem)'i bu söylentilere kulak astığından dolayı zınınen muahezede bulunmak içrı bunu yapmamıştır. Âişe (radıyallahü anha) kendisine bir günah işleyip işlemediği sorulunca üzüntüsünün şiddetinden Ya'kub (radıyallahü anh)’in ismini hatırlayamamış, bundan dolayı ona Yûsuf'un babası demiştir. Bu cihet Buhârî'nin rivâyetinde tasrih edilmiştir. hadîsinden ulemâ birçok faideler çıkarmışlardır. Şöyle ki:",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 67
			}
		}
	]
}