{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"51": "Characteristics of The Hypocrites And Rulings Concerning Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7037,
			"arabicnumber": "2779.03",
			"text": "(Bize Züheyr b. Harb rivâyet etti. ki): Bize Ebû Ahmed El-Kûfî rivâyet etti, ki): Bize Velid b. Cümey' rivâyet etti. ki): Bize Ebû't-Tufeyl rivâyet etti. ki): Akabelilerden tir adamla Huzeyfe arasında, insanlar arasında olağan bazı şeyler vardı. O adam dedi ki: Allah aşkına söyle, Akabeliler kaç kişiydiler? Bunun üzerine cemâat Huzeyfe'ye: Madem sordu, ona haber ver, dediler. Huzeyfe şunu söyledi: Bize ondört oldukları haber verilirdi. Şayet sen de onlardansan, bu cemâat onbeş kişi olur. Allah'a şehadet ederim ki, onlardan onikisi hem dünya hayâtında, hem de şâhidler dikildiği gün Allah'a ve Resûlüne düşmandırlar. Üçünü ma'zur görmüştür. Cemâat: Biz Resûlüllah (sallallahü aleyhi ve sellem)’in dellâlını işitmedik. Bu kavmin ne yapmak istediğini de bilmedik. Taşlık bir yerde idi. Yürüdü ve: su azdır. Benden önce onun yanına kimse varamaz.» buyurdu. Ama kendinden önce oraya varmış bir kavm buldu da, o gün kendilerine lanet etti, dediler. (sallallahü aleyhi ve sellem) ashab tâbirini kullanmakla benim sohbetime nisbet edilenler mânâsını kasdetmiştir. Nitekim ikinci rivâyette: Ümmetimin içinde, demiştir. iğne deliğinden geçinceye kader...» sözünden murad; ebediy-yen demektir. Yani; deve nasıl ebediyyen iğne deliğine giremezse, bunlar da ebediyyen cennete giremiyeceklerdir. Akabe, ensârın bey'at ettikleri Mina'daki Akabı değil, Tebûk yolu üzerinde bir yerdir. Tebûk gazasında münafıklar Resûlüllah (sallallahü aleyhi ve sellem)’e gadretmek için orada toplanmış, fakat Teâlâ Hazretleri Resûlü Ekremini onlardan korumuştu. Re-sûtüllah (sallallahü aleyhi ve sellem) arkasından gelen münafıkların şamatasını duyunca, onları geri çevirmek için Hazret-i Huzeyfe'ye emir vermiş. Münafıklar onu görünce Allah tarafından kalblerine korku düşerek acele geri dönmüş ve orduya karışmışlardı. Hazret-i Huzeyfe, Peygamberin yanına dönünce onları tanıyıp tanıyamadığını sormuş; o da yüzleri zırhlı olduğu için kendilerini tanıyamadığını, fakat hayvanlarını tanıdığım söylemişti. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) onları bana isimleriyle ve babalarının adlarıyle haber verdi. Inşaallah sabahleyin onları sana bildiririm.» demişti. Bundan dolayı halk münafıklar hususunda bilâhere dâima Hazret-i Huzeyfe'ye müracaat et-mislerdir. Resûlüllah (sallallahü aleyhi ve sellem)'in bu münafıkların kimler olduğunu gizli tutması, fitne çıkmasından endişe ettiği içindir, deniliyor",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 14
			}
		}
	]
}