{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"52": "Characteristics of the Day of Judgment, Paradise, and Hell"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7065,
			"arabicnumber": "2797",
			"text": "Bize Ubeydullah b. Muaz ile Muhammed b. Abdi'I-A'Ia [El-Kaysî rivayet ettiler. (Dedilerki): Bize Mu'temir, babasından rivayet 'etti. (Demişki): Bana Nuaym b. Ebî Hind, Ebû Hâzim'den, o da Ebû Hureyre'den naklen rivayet etti. (Demişki): Ebû Cehl: — Muhammed sizin aranızda halâ yüzünü toprağa sürtüyor mu? dedi. Kendisine : Evet! cevabı verildi. Bunun üzerine : — Lât ve Uzza'ya yemin ederim kî onu, bunu yaparken görürsem mutlaka boynuna basarım. Yahut mutlaka yüzünü toprağa gömerim, dedi. Az sonra Resulullah (Sallallahu Aleyhi ve Sellem) namaz kılarken onun yanına vardı. Boynuna basmak niyetinde idi, fakat birdenbire onu bırakıp geri döndüğünü ve elleriyle korunduğunu gördüler. Kendisine : — Sana ne oldu? denildi. — Gerçekten onunla benim aramda ateşten bir hendek, korkunç bir Şey ve bir takım kanatlar var, dedi. Resulullah (Sallallahu Aleyhi ve Sellem) de: «Bana yaklaşmış olsaydı melekler onu birer birer uzuvlarını koparırdı!» buyurdular. Râvi demiş ki: Bunun üzerine Allah (Azze ve Celle) Ebû Hureyre'nin hadîsinde midir, yoksa duyduğu bir şey midir bilmiyoruz—: «Hayır! Gerçeklen İnsan kendini zengin görünce azar. Hiç şüphe yok ki, dönüş Rabbinedir. Bir kul'u namaz kılarken meneden kimseye ne dersin? Ya hidâyet üzere ise; veya takvayı emrederse ne dersin! Yalanladı ve dönüp gitti ise (Ebû Cehl'i kastediyor) ne dersin? Bilmez mi ki, Allah görüyor! Hayır! Eğer vazgeçmezse mutlaka alnına yapışacağız. Yalancı, günahkâr alına! O meclisini çağırsın. Biz zebanileri çağıracağız! Hayır! Ona itaat etme I» [Alak 6'dan 19'a] âyetlerini indirdi. Ubeydullah kendi hadîsinde ziyâde etti: «Ve ona ne emretti ise etti.» dedi. İbni Abdi'l-A'lâ da: Meclisini yâni; kavmini çağırsın...ibaresini ziyâde etti",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 21
			}
		}
	]
}