{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 708,
			"arabicnumber": "309",
			"text": "Bize Hasan b. Ahmed b. Ebî Şuayb el-Harranî rivayet etti (Dediki): Bize Miskin yani Bükeyr el-Hazza', Şu'be'den, o da. Hişam b. Zeyd'den o da Enes'den naklen rivayet etti ki, Enes'ten rivayete göre Nebi (Sallallahu aleyhi ve Sellem) bütün hanımlarını dolaşır ve bir defa gusül ederdi. Yalnız Müslim rivayet etmiştir DAVUDOĞLU ŞERHİ AŞAĞIDA NEVEVİ ŞERHİ (697-706) : (697) Aişe (r.anha)'nın rivayet ettiği hadiste: \"Resulullah (Sallallahu aleyhi ve Sellem) cünüp olup uyumak isterse ... \"; (698) \"Cünüp olup bir şeyler yemek yahut uyumak isterse ... \" (700) Ömer (r.a.)'ın rivayetinde: \"Ey Allah'ın Rasuıü ... evet buyurdu.\" (701) rivayetinde \"evet, abdest alsın ... \" (3/216) (702) Bir diğer rivayette \"abdest al ve erkeklik organını yıka sonra uyu\"; (703) rivayetinde \"Resulullah (Sallallahu aleyhi ve Sellem) ... \" (705) rivayetinde \"biriniz ai/esine yaklaştıktan sonra \"; (706) Diğer rivayette \"Resulullah (Sallallahu aleyhi ve Sellem) bütün hanımlarını \" hadisleri yer almaktadır. Bütün bu hadislerden anlaşılan cünüp bir kimsenin gusletmeden önce uyumasının, bir şeyler yiyip içmesinin ve bir daha cima etmesinin caiz olduğudur. Bu hususta icma vardır. İlim adamları ayrıca cünüp olan kimsenin bedeninin ve terinin de tahir olduğunu icma ile kabul etmişlerdir. Bu Hadislerden Ayrıca Şu Hükümler de Anlaşılmaktadır: 1- Bütün bu hususları yapmak için abdest alması ve fercini yıkaması müstehaptır. Özellikle de bundan önce kendisiyle cima etmemiş olduğu hanımı ile cima etmek isterse erkeklik organını yıkamasının müstehap oluşu daha da pekişir. Mezhep alimlerimiz abdest almadan önce bir şeyler yiyip içmenin ve cimaın mekruh olduğunu açıkça ifade etmiş olmakla birlikte, bu hadisler de buna delildir. Bununla birlikte bu abdestin vacip olmadığı hususunda da mezhebimizde görüş ayrılığı yoktur. Malik ve fukahimın cumhuru da böyle demişlerdir. (3/217) Maliki mezhebine mensup İbn Habib ise bu abdestin vacip olduğu kanaatindedir. Davud ez-Zahirl'nin mezhebi de budur. 2- Abdestten maksat namaz için alınan tam bir abdesttir. Bundan önceki babta geçen İbn Abbas'ın rivayet ettiği yalnızca yüzü ve elleri yıkamak ile ilgili hadisin sözkonusu ettiği bu uygulamanın cünüplükte değil de, küçük hadesten dolayı yapıldığını açıklamış idik. Ebu İshak es-Sebli'nin, el-Esved'den, onun Aişe (radıyall&hu anh&)'dan diye rivayet ettiği \"Nebi (Sallallahu aleyhi ve Sellem) cünüp olduğu halde elini suya değdirmeden uyurdu\" şeklindeki hadisi Ebu Davud, Tirmizi, Nesai, İbn Mace ve başkaları rivayet etmiş olup, Ebu Davud: Yezid b. Harun'dan diye rivayette Ebu İshak bu hususta yanılmıştır, demektedir. Kastettiği ise \"elini suya değdirmeden\" ibaresidir. Tirmizi de ilim adamları bunun Ebu İshak'ın bir yanlışlığı olduğu görüşündedirler, demiştir. Beyhaki de şöyle demektedir: Hadis hafızları bu lafzı tenkit etmişlerdir. Böylelikle sözünü ettiğimiz bu ifadelerle hadisin zayıf olduğu açıkça ortaya çıkmaktadır. Zayıf olduğu sabit olduktan sonra bu hadis ile az önce zikrettiklerimize yapılacak bir itiraz kalmamaktadır. Sahih dahi olsa bu hadislere aykırı olmaz. Aksine buna iki şekilde cevap verilebilir: Birincisi, iki büyük imam Ebu'l-Abbas b. Şureyh ile Ebu Bekr elBeyhaki'nin verdikleri şu cevaptır: Bundan kasıt gusletmek maksadıyla elini suya değdirmezdi, ikincisi ise -ki bu bana göre güzel bir cevaptır- maksat caiz olanı da beyan etmek için bazı hallerde kesinlikle elini suya değdirmezdi, şeklindedir; çünkü bu işi ısrarla devam ettirseydi, bunun farz olduğu zannına kapılmak mümkün idi. Allah en iyi bilendir. 3- Resulullah (Sallallahu aleyhi ve Sellem)'in bütün hanımlarını dolaşmakla birlikte sadece bir defa gusletmesine gelince, hanımlarının birinin yanından öbürüne giderken arada abdest alıyor olması ihtimali vardır. Yahut bundan maksat abdest almamanın caiz olduğunu beyan etmekti. Ebu Davud'un Sünenindeki rivayete göre Resulullah (Sallallahu aleyhi ve Sellem) bir gece hanımları nı dolaştı. Bunun yanında da yıkanıyordu, öbürünün yanında da yıkanıyordu. Ey Allah'ın Resulü niçin hepsi için bir defa gusletmiyorsun diye sorulunca, O: \"Böylesi daha temiz, daha hoş ve daha paktır\" buyurdu. Ebu Davud dedi ki: Ama birinci hadis daha sahihtir. Derim ki: Bu hadisin sahih olduğu kabul edilecek olursa bir zaman böyle, bir zaman da böyle yaptığı anlamına gelir. Allah en iyi bilendir. İlim adamları bu abdestin hikmeti hususunda farklı kanaatlere sahiptir. Mezhep alimlerimiz bunun hadesi hafiflettiğini söylemişlerdir; çünkü abdest ile abdest azalarının hadesi (abdestsizliği, gusulsüzlüğü)nü kaldırır. Ebu Abdullah el-Mazerı (r.a.) dedi ki: Bunun hikmeti hususunda farklı görüşler vardır. Uyurken ölür korkusu ile iki temizlik halinden birisi üzere uyumak için denildiği gibi, organlarına su değmesi halinde gusletme şevkini artırma ihtimali dolayısıyladır da denilmiştir. el-Mazerı devamla şöyle der: Sözkonusu bu görüş ayrılığı ay hali olanın uyumadan önce abdest alması hakkında da geçerlidir. Bunun abdest1i olarak uyuma hikmetine bağlı olduğunu kabul edenler bu durumdaki bir kadının abdestli uyumasını müstehap kabul etmişlerdir. Mazerl' nin sözleri bunlardır ama bizim mezhep alimlerimiz ay hali ve loğusa kadının abdest almasının müstehap olmadığı üzerinde ittifak etmişlerdir. Çünkü abdest almanın onların hadeslerinde herhangi bir etkisi yoktur; ama ay hali olanın şayet kanı kesilmiş ise cünüp bir kimse gibi olur. Allah en iyi bilendir. Nebi (Sallallahu aleyhi ve Sellem)'in hanımlarını dolaşıp, tek bir defa gusletmesi ise bunun onların rızası ile olduğu yahut eğer onlardan birisinin sırası ise sırası olanın rızasıyla olduğu şeklinde yorumlanır. Böyle bir yoruma ise, bize vacip olduğu gibi, zevceleri arasında paylaştırmak Resulullah (Sallallahu aleyhi ve Sellem)' e de vacip idi, diyenlerin ihtiyaç duyacağı bir yorumdur. Onun hakkında bunun farz olmadığını kabul edenlerin ise böyle bir yoruma ihtiyaçları yoktur; çünkü O bu gibi hususlarda dilediğini yapmakta serbesttir. Günleri paylaştırmanın vücubu ile ilgili (3/218) bu görüş ayrılığı aynı zamanda bizim mezhep alimlerimizin de bu husustaki iki farklı görüşünü ifade eder. Allah en iyi bilendir. 4- Bu babta sözkonusu edilmiş hadislerde cünüplükten dolayı derhal gusletmenin gerekmediğini ancak namaza kalkılması halinde insan için gusletmenin sözkonusu olduğunu ortaya koymaktadır. Bu hususta da Müslümanlar icma halindedir. 5- Mezhep alimlerimiz cünüplük guslünü neyin icap ettirdiği hususunda farklı görüşlere sahiptirler. Acaba cünüplük iki sünnet yerinin birbirine kavuşmasıyla mı gerçekleşir yoksa meninin inzali ile mi yoksa namaza kalkmakla mı, yoksa cünüplük namaza kalkmak ile birlikte mi sözkonusu olur? Bu hususta mezhep alimlerimizin üç görüşü vardır. Gusletmeyi gerektiren cünüplüktür diyenler bu vakti geniş (muvassa') bir vücub ifade eder derler. Aynı şekilde abdest almayı gerektiren husus hakkında da ihtilaf etmişlerdir. Bu hades midir yoksa namaza kalkmak isteği midir yoksa her ikisinin toplamı mıdır? Aynı zamanda ay hali guslünü neyin gerektirdiği hususunda ihtilaf etmişlerdir. Acaba onu gerektiren kanın çıkması mıdır yoksa kesilmesi midir? Allah en iyi bilendir. Babın senetleri ile ilgili söyleneceklere gelince (699) \"İbnu'l-Müsenna hadisi rivayetinde: Hakem'den ben İbrahim'i tahdis ederken dinledim, dedi\" sözlerinin anlamı şudur: İbnu'l-Müsenna, Muhammed b. Cafer'den, o Şu'be'den rivayetinde Şu'be dedi ki: Bize Hakem tahdis edip dedi ki: Ben İbrahim'i tahdis ederken dinledim. Önceki rivayette ise Şu'be, Hakem'den, o İbrahim' den şeklindedir. İkinci rivayetten maksat birincisinden daha güçlüdür; çünkü birinci rivayette iki defa \"an\" lafzı kullanılırken, ikinci rivayette bize tahdis etti ve dinledim denilmektedir. Tahdis etti ve dinledim ifadelerinin \"an\" tabirinden daha güçlü olduğu bilinen bir husustur. Bununla birlikte ilim adamlarından bir topluluk \"an\" lafzı senedin muttasıl olmasını gerektirmez, isterse tedlis yapmayan bir ravi tarafından kullanılmış olsun, derler. Bizler bunun açıklamasını baştaki fasıllarda ve ondan sonraki pek çok yerde yapmış bulunmaktayız. Allah en iyi bilendir. \"Muhammed b. Ebu Bekr el-Mukaddemi dedesi \"Mukaddem\"e nispetlidir. Bunun açıklaması daha önce birkaç defa geçti. Ayrıca senette Ebu'lMütevekkil, Ebu Said'den isnadı vardır ki buradaki Ebu'l-Mutevekkil enNaci nispetli olup, adı Ali b. Davud'dur. Dal harfi ötreli \"bin Duvad\" da denilmiştir. Bilinen bir kabile olan Naciye oğullarına mensuptur. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Bu hadisi Buharî biraz lafız farkiyle «Kitabu'I Gusul» de bir iki yerde Nesaî dahi «Işratü'n-Nisa» bahsinde tahrîc etmişlerdir. Buharî 'nin bir rivayetinde o gün Resulullah (Sallallahu Aleyhi ve Sellem) in dokuz zevcesi diğer rivayetinde onbir zevcesi olduğu beyan ediliyor. Bu cihet ulema arasında ihtilaflıdır. Hadîs-i Şerifteki tavaftan murad cima'dir. Buharî 'nin rivayetinde Katade'nin: «Enes'e Resulullah (Sallallahu Aleyhi ve Sellem) buna dayanabîliyormuydu ? dedim Enes: Biz aramızda ona otuz erkek kuvveti verildiğini konuşuyorduk cevabını verdi» demeside bunu gösterir. Resulullah (Sallallahu Aleyhi ve Sellem) in bir gusulle bütün kadınlarını dolaşmasının birkaç veçhe ihtimali vardır, Şöyleki: 1- Bunu seferden geldiği zaman yapmıştır. Çünkü o zaman Kasm denilen zevceler arasında adalete riayet lazım değildir. Nebi (Sallallahu Aleyhi ve Sellem) sefere çıkarken zevceleri arasında kur'a çektirir; kur'a kime düşerse beraberine onu alırdı. Döndüğü zaman kasme yine başlardı. Fakat başlarken bu hakta bütün zevceleri müsavi olduğu için hiç birini tercih etmez bir defada hepsinin yanına uğrar kasme ondan sonra başlardı. 2- Birden tavaf meselesi zevcelerinin rızası ile olmuştur. 3- Mühelleb'e göre bu iş zevceleri arasında kur'a çektirerek sefere çıkacağı gün olmuştur. Çünkü kur'a dan sonra kasme riayet lazım değildir. Ancak bu te'viller Resulullah (Sallallahu Aleyhi ve Sellem)'e zevceleri arasında devam üzre müsavata riayet farzdır diyenlere göredir, ki ekseri ulemanın kavli budur. Ona kasm vacip değildir diyenlere göre hadisi te'vile hacet yoktur. İbnü'l Arabî diyor ki: Allah nikah babında bazı şeyleri Nebiine tahsis buyurmuştur. Onlardan biride kendisine bir saat tahsis etmesidir o vakitte zevcelerinin onun üzerinde hakkı yoktur. Onların hepsinin yanına, girer kendilerine dilediği muameleyi yapar sonra nevbet sırası hangisinin ise ona döner. Müslim'in kitabında İbn-i Abbas'tan rivayet edilen bir hadiste bu saati'n ikindiden sonra .olduğu bildirilmektedir.» Resulullah (Sallallahu Aleyhi ve Sellem)'in zevcelerini bir gusulle fakat ayrı ayrı abdest alarak tavaf etmiş olması muhtemeldir. Yahut abdest almadan bir gusulle hepsini dolaşmış ve bununda caiz olduğunu göstermek istemiştir. Ebu Davud'un «Sünen» inde rivayet ettiği bir hadîste: «Nebi (Sallallahu. Aleyhi ve Sellem) bir gece bütün kadınlarını ziyaret etti ve her birinin yanında ayrı ayrı yıkandı. Kendisine: Ya Resulallah (Sallallahu Aleyhi ve Sellem) Neden bir defa yıkanmakla iktifa etmiyorsun? dediler. Resulullah (Sallallahu Aleyhi ve Sellem): «Böyle yapmak daha pak daha temiz ve daha iyidir.» buyurdular, denilmektedir. Ebu Davud evvelki rivayetin bu rivayetten daha sahih olduğunu söylemiştir. Rivayetlerin ikisi de sahih olduğuna göre bazan arada yıkanmış bazan yıkanmamış demek olur. Nevevî cima'dan evvel alınan abdestin hikmeti hakkında şunları söylüyor: «Ulemamız hikmeti ;hadesi hafifletmesidir. Çünkü abdest azadan hadesi giderir. Diyorlar. Ebu Abdillah Mazirî diyorki: Bu abdestin sebeb-i hikmeti ihtilaflıdır. Bazıları uyku esnasında ölürüm korkusu ile iki taharetten biriyle gecelemiş olmak için almıştır, demiş; bir- takımları da ihtimal abdest alması yıkanmaya neşatı açılsın içindir demişlerdir. Aynı hilaf hayzlı kadının uykudan önce abdest alması hususunda da mevcuttur. Geceyi temiz geçirmekle ta'lil edenlere göre kadının abdest alması müstehabtır. Mazirinin sözü budur. Ulemamıza gelince: Onlar Hayz ve nifaslı kadınlara abdest almanın müstehab olmadığında ittifak etmişlerdir. Çünkü bu kadınların hadeslerine abdestin bir tesiri yoktur. Kadının hayzı kesildimi cünüb gibi olur.» Babımız hadisleri cünüblükten yıkanmanın fevrî olmadığına yani derhal yıkanmak farz değil namaz gibi temizliğe mütevakkıf bir ibadet yapılacağı zaman farz olduğuna delildirler. Bu babta bütün ulema müttefiktir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 30
			}
		}
	]
}