{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"52": "Characteristics of the Day of Judgment, Paradise, and Hell"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7086,
			"arabicnumber": "2805.04",
			"text": "(Bize Abd b. Humeyd de rivâyet etti. ki): Bize Ravh b. Ubâde rivâyet etti. H. Amr b. Zürâra da rivâyet etti. ki): Bize Abdü'l-Vahhab (yani; İbn Atâ') haber verdi. Her iki râvi Saîd b. Ebî Arûbe'den, o da Katâde'den, o da Enes'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini rivâyet etmiştir. Yalnız o: Yalan söyledin, senden bundan daha kolayı İstenmişti, buyurulacaktır...» demiştir. hadîsi Buhârî «Kitâbu'l-Enbiya» ile «Kitabu sıfetü Nâr»'da tahric etmiştir. Kişinin düştüğü vartadan kurtulmak için mal vermesidir. hadîsdeki «diledim» tâbirinden murad; emrettim, demektir. Nitekim rivâyetin birinde, senden istenildi, buyurulması bu mânâyı te'ytö etmektedir. Çünkü ehl-i hakka göre Allahü teâlâ bir şeyi dilediği vakit olmaması imkânsızdır. Ehl-i Hakkın mezhebine göre Allahü teâlâ var olan şeylerin hepsini hayrıyle, şerriyle dileyerek yaratır. Bunlar da imanla küfürde dâhildir. Mü'minin imanını, kâfirin de küfrünü murad eder. Bu bâb da Mu'tezile fırkası muhalefet etmiş: «Allah kâfirin imânını murad etmiş; küfrünü dilememiştir.» demişlerdir. Bu söz bâtıldır. Çünkü Allahü teâlâ hakkında âciz isbatını istilzam eder. Bundan Allahü teâlâ’nın mülkünde dilemediği şeylerin vuku bulması lâzım gelir. Ki, Teâlâ Hazretleri bundan münezzehdir. mânâsı şudur: Kıyâmet gününde dünya bütün varlıklarıyle kâfirlerin elinde olsa ve azabdan kurtulmak için bunu fidye olarak vermek ellerinden gelse, hiç tereddüd etmeden verirlerdi. yalan söyledin, tâbiri: Dünyaya dönmüş olsan bunu yapmazdın, yalan söylerdin, manasınadır. Yoksa âhirette milke kadir olsalar onu gerçekten fidye olarak verirler. şerif Allah buyuruyor. Allah diyor, gibi sözlerin caiz olduğu da delildir. Selefden bazıları bunu kerih görmüş: «Allah \"buyurdu...» »nilmesi lâzım geldiğini söylemişlerdir. Bunun doğru olmadığını evvelce örmüş, bilûmum ulemânın cevaza kail olduklarını bildirmiştik",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 40
			}
		}
	]
}