{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 715,
			"arabicnumber": "314.02",
			"text": "Bize İbrahim b. Musa er-Razi, Se hı b. Osman ve Ebu Kureyb -ki lafız Ebu Kureyb' e attir- tahdis etti. Sehl bize İbn Ebu Zaide, babasından tahdis etti derken, diğer ikisi haber verdi, dediler. Babası Mus'ab b. Şeybe'den, oMusafi b. Abdullah'tan, o Urve b. ez-Zubeyr'den, o Aişe'den rivayet ettiğine göre bir kadın Resulullah (Sallallahu aleyhi ve Sellem)'e kadın ihtilam olup, suyu görürse gusleder mi, dedi. Allah Rasülü: \"Evet\" buyurdu. Aişe ona: Ellerin toprağa değsin ve harbe sana isabet etsin, dedi. Rasülullah (Sallallahu aleyhi ve Sellem): \"Onu bırak. Zaten {çocuğun} benzemesi bundan başka bir sebepten dolayı mı 'olur? Kadının suyu erkeğin suyundan yukarı çıkarsa çocuk dayılarına benzer, erkeğin suyu kadının suyu üzerine çıkarsa amcalarına benzer\" buyurdu. Yalnız Müslim rivayet etmiştir NEVEVİ ŞERHİ AŞAĞIDA DAVUDOĞLU AÇIKLAMA: Bu hadisi Buhari «Kitabu't-Tahare», «Kitabu'l Edep» ve «Halk-ı Adem» de Ebu Davud, Tirmîzî, Nesaî ve İbni Mace «Kitabu't-Tahare» de muhtelif ravîlerden tahrîc etmişlerdir. Hadîsin muhtelif rivayetlerinden anlaşılıyor ki Resulullah (Sallallahu Aleyhi ve Sellem)'e Suali soran kadın Ünımü Süleym'dir. Müslim'in Abbas b. Velid .den tahriç ettiği 311 numaralı hadiste: «Ünımü Süleym ben bundan utandım (ama yinede) Bu olurmu diye sordum dedi.» buyuruluyor. Hafız Ebu Ali el-Gassanî bunun yerine bazı nüshalarda Ümmü Seleme zikredildiğini söylemişsede Kaadî Iyaz: «Doğrusu Ümmü Süleym'dir. Çünkü bu hadiste suali soran Ümmü Süleym, ona itiraz eden Ümmü Seleme'dir. Önceki hadiste ise itirazı yapan Aişe (R.A.)'dır. Âişe ile Ümmü Selemenin hep birden itiraz etmiş olmaları da muhtemeldir» diyor. Ümmü Süleym (R.A.) Resulullah (Sallallahu Aleyhi ve Sellem)'e uyku esnasında kadının ihtilam olmasının hükmünü sormuştur. Kadınların bu meseleyi erkeklere açması adeten ayıp ve utanılacak bir şey sayıldığı için Hz, Ümmü Süleym sualini kendine hass bir nezaketle kapalı bir şekilde sorduğu halde Aişe ve Ümmü Seleme (R.A.) dayanamayıp itiraz etmişlerdir. Hz. Âişe'nin: «Ya Ümme Süleym kadınları kepaze ettin» diyerek onların daima sakladıkları utanılacak bir sıfatlarını söylediğinden dolayı Ümmü Süleym'i muahaze etmiştir. Çünkü kadınlardan menî gelmesi onların erkeklere karşı fazla şehvetli olduklarına delalet eder. Hazreti Ümmi Süleym'in sorduğu suali Resulullah (Sallallahu Aleyhi ve Sellem) 'e Havle binti Hakîm, Sehle binti Süheyl ve daha başka kadınlarda sormuşlardır. Resulullah (Sallallahu Aleyhi ve Sellem) in cevaben «Evet! Ya benzerlik nereden geliyor?» sözünün manası: Çocuk erkekle kadının menilerinin karışmasından meydana gelir. Bunların hangisi galebe çalarsa çocuk ona benzer demektir. Bu sözü müteakip: «Erkeğin suyu (menisi) koyu beyazdır; kadınınla İse sıvı ve sarı.» buyurmuştur. Bu îzahat meninin sıfatı hakkında büyük bir kaide olmuştur. Sağlam olan erkek ve kadınların ekseriyetle menilerinin sıfatı budur. Ulemanın beyanına göre erkek menisinin üç hassası vardır. 1- Yaş olduğu zaman kokusu hamur kokusuna; kuru olduğu zaman ise yumurta kokusuna benzer. 2- Atıla atıla gelir. 3- Dışarıya lezzetle çıkar; çıktıktan sonra da bir gevşeklik arız olur. Ekseri ulemaya göre bu üç sıfatta erkekle kadın menileri arasında fark yoktur. Mezkur sıfatların bir tanesi meniyi İspat için kafidir. Bu sıfatlardan hiç biri bulunmazsa çıkan suya meni hükmü verilmez. NEVEVİ ŞERHİ (707-713) : Bu babta (707) \"Um Suleym (r.a.)'ın Ai'şe (r.anha) yanında iken Resulullah (Sallallahu aleyhi ve Sellem)'e ... \" (3/219) hadisi yer almaktadır. Sözü geçen bu babta geri kalan rivayetler de yer almıştır. Yüce Allah'ın izniyle yeri geldikçe bunları göreceğiz. Şunu bilmek gerekir ki, kadının menisi dışarı çıkacak olursa erkeğe dışarı çıkması sebebiyle gusletmek icab ettiği gibi, kadının da gusletmesi icab eder. Esasen Müslümanlar meninin çıkması yahut erkeklik organının ferce sokulması ile kadına da, erkeğe de gusletmenin vacip olduğu üzerinde icma ettikleri gibi, ay hali ve loğusalık sebebiyle de kadının gusletmesinin icab ettiğinin üzerinde icma etmişlerdir. Fakat doğum yapmakla birlikte hiçbir şekilde kan görmeyen kadına guslün icap edip etmediği hususunda farklı görüşlere sahiptirler. Ancak mezhep alimlerimize göre daha sahih olan gusletmenin vacip olduğudur. Şayet kadın bir çiğnem et yahut bir parça kan düşük yapacak olursa aynı şekilde görüş ayrılığı sözkonusudur. Daha sahih olan gusletmesinin vacip olduğudur. Bununla birlikte bu gibi kimseler hakkında guslün vacip olmadığını söyleyenler abdest almasının vacip olduğunu söylemişlerdir. Allah en iyi bilendir. Diğer taraftan bizim mezhebimizde kabul edilen görüş, ister şehvetle ve hızlıca çıksın, ister bakarak, ister rüyada iken, ister uyanıkken çıksın, ister aklı başında olan birisinden çıksın, ister deliden çıksın meninin çıkması ile guslün vacip olduğudur. Ayrıca meninin çıkmasından maksat ise dışarıya çıkmasıdır. Eğer dışarıya çıkmamışsa gusletmek icap etmez. Şöyle ki, uyuyan bir kimse cima' ettiğini yahut inzal yaptığını görmekle birlikte uyandığında bir şey görmeyecek olursa Müslümanların icmaı ile gusletmek yükümlülüğü yoktur. Aynı şekilde meninin çıkmasının başlangıç hali sebebiyle vücudu harekete geçmiş olmakla birlikte, meni dışarı çıkmazsa yine meni erkeklik organının dibine indikten sonra dışarı çıkmayacak olursa gusül gerekmez. Hatta meni -kendisi namazda iken- erkeklik organının ortasına gelse ve bir şey üzerinden eliyle erkeklik organını tutsa namazından selam verinceye kadar men i dışarı çıkmazsa namazı sahih olur ve meni dışarı çıkıncaya kadar abdest1i kalmaya devam eder. Bu hususta kadın da erkek gibidir. Ancak kadın dul yahut evlenmiş olup, meni fercine inip, cünüplük ve istinca sırasında yıkaması gereken yere bulaşacak olursa -bu yer ise ihtiyacını karşılamak için oturması halinde görünen kısımdır- meninin bu yere ulaşması sebebiyle gusletmesi gerekir; ünkü bu yer zahir (görünen) kısım hükmündedir. Şayet bakire ise, fercinden dışarıya çıkmadıkça gusletmesi de gerekmez; çünkü onun fercinin iç kısmı erkeğin ihlilinin498 iç kısmı gibidir. Allah en iyi bilendir. Babtaki Lafızlar ve Babın İhtiva Ettiği Anlamlar Um Suleym, Enes b. Malik'in annesidir. Adı hakkında ilim adamları ihtilaf etmişlerdir. Sehle, Muleyke, Rumeysa, Uneyfe olduğu (3/220) söylendiği gibi, er-Rumeyda, el-Gumeyda olduğu da söylenmiştir. Kendisi kadın sahabilerin faziletlilerinden ve meşhurlarından idi. Milhan kızı Ümmü Haram'ın kızkardeşidir. Allah her ikisinden de razı olsun. Allah en iyi bilendir. Aişe (r.anha)'nın: \"Kadınları rezil (rüsvay) ettin\" demesi de sen onlar hakkında kendilerinin gizledikleri ve onunla nitelenmekten haya ettikleri bir hususlarını anlattın, demektir. Bu ise onlardan meninin gelmesidir ki bu da erkekleri ileri derecede arzuladıklarını gösterir. \"Sağ elin toprağa değsin\" sözü hakkında selefin ve halefin bütün fırka ve kesimlerinin oldukça yaygın ve pek çok farklı açıklamaları vardır. Anlamı ile ilgili muhakkiklerin benimsedikleri daha güçlü ve daha sahih olan görüşe göre bunun asıl anlamı fakir olasın demek olduğudur ama Araplar asıl anlamının hakikatini kastetmemek üzere bunu kullanmayı adet edinmişlerdir. Bu sebeple Araplar elleri n toprağa değsin, Allah onu kahretsin, ne kahramandır, annesiz kalasıca, babasız kalasıca, annesi onu kaybedesice, vayanasının haline ve buna benzer lafızları bir şeye karşı tepkilerini ortaya koymak yahut o işten vazgeçilmesini ya da o iş yapıldığı için yermeyi yahut büyük gördüklerini anlatmayı ya da o işe teşvik etmeyi yahut onu beğenmeyi ifade etmek üzere kullanırlar. Allah en iyi bilendir. (707) Resulullah (Sallallahu aleyhi ve Sellem)'in Aişe'ye: \"Hayır, asıl senin sağ elin toprağa değsin\" sözünün anlamı: Bu sözlerin sana söylenmesi daha uygundur çünkü o dini ile ilgili sorması gerekeni sordu, bu sebeple tepki gösterilmeyi hak etmedi ama sen tepki gösterilmemesi gereken bir işe tepki gösterdiğin için tepki gösterilmeyi hak ettin. 498 Erkek tenasül organının deliği, sidik yolu. Sidik deliği. \"Sağ elin toprağa değsin\" (ve) \"hayrolsun\" evet çoğu asıllarda bu şekildedir ve bu (hayrolsun) bir tefsirdir. Bununla birlikte bu tefsir pek çok asıl nüshada yer almamıştır. Aynı şekilde Kadı İyaz da bu tefsirin bulunup bulunmaması hususundaki ihtilMı sözkonusu etmiştir. Diğer taraftan bu kelimenin bulunduğunu söyleyenler nasıl okunacağı hususunda ihtilM etmişlerdir. Metali' sahibi ve başkaları çoğunluk bunu şerrin zıttı \"hayr\" diye okumuşlardır. Bazıları ise bunu \"haber\" diye okumuşlardır. Kadı İyaz der ki: Bu ikinci okuyuşun kıymeti yoktUr. Derim ki: Her ikisi de doğrudur, o bu sözü ile ona ağır söz söylemek istememişti ama söylenmesi alışkanlık haline getirildiği için dilden dökülüveren bir söz olarak söylemişti. ikincisine göre bu bir beddua değildir, aksine gerçek anlamı kastedilmeyen bir haberdir, demektir. (708) \"Bize Abbas b. Velid tahdis etti. Bize Yezid b. Zurey' tahdis etti.\" Müslim'in kitabını rivayet eden bazı kimseler \"Abbas\" ismini ye ve şın harfi ile \"Ayyaş\" olarak tashif etmişlerdir. Bu ise apaçık bir yanlıştır çünkü sözü edilen bu Ayyaş, Ayyaş b. Velid er-Rakkam el-Basri' dir. Müslim ise ondan hiçbir rivayet nakletmemiştir (3/221) ama Buhari ondan rivayet almıştır. Abbas da b. Velid el-Basri et-Tirsi'dir. Ondan hem Buhari, hem Müslim rivayet etmişlerdir. Bu hakkında görüş aynlığı bulunmayan hususlardandır. Ayyaş diyen kimsenin bu yanlışlığı ise her ikisinin babasının nesebinin ve yaşadıkları çağın ortak olmasından kaynaklanmaktadır. Allah en iyi bilendir. \"Um Suleym dedi ki: Ben bundan utandım.\" Asıl yazmalarda bu şekildedir. Hafız Ebu Ali el-Gassanıde nüshaların birçoğunda bu şekilde olduğunu ama bunun bazı nüshalarda değişikliğe uğratılarak: \"Um Seleme dedi ki\" şekline sokulduğunu söylemiştir. Halbuki değişik yollardan mahfuz olan \"Um Seleme\" dir. Kadı İyaz der ki: işte doğrusu da budur çünkü bu soruyu soran Ümmü Suleym'dir, ona bu hadiste karşılık veren de Ümmü Seleme'dir, önceki hadiste ise Aişe' dir. Hadis ehli alimler burada sahih olan Aişe değil, Ümmü Seleme'dir demekte iseler de Aişe ve Ümmü Seleme'nin birlikte ona tepki göstermiş olmaları da ihtimal dahilindedir. Allah en iyi bilendir. Resulullah {Sallallahu aleyhi ve Sellem)'in: \"Benzer/ik nerede?\" buyruğu şu demektir: Çocuk hem erkeğin, hem kadının suyundan doğar. Hangisi daha galip gelirse ona benzer. Kadının menisi olduğuna göre onun inzali ve ondan dışarıya çıkması da mümkündür. \"Erkeğin suyu ka/ın ve beyazdır ... \" Bu meninin niteliğinin açıklanmasında pek büyük bir esas dayanaktır. Sağlıklı iken ve çoğunlukla niteliği budur. ilim adamları der ki: Sağlıklı iken erkeğin menisi beyaz, katı ve arka arkaya hızlıca çıkan, şehvetle çıkıp, çıkması ile lezzet ve zevk alınan bir sudur. Çıkmasının akabinde ise bir rahatlama ve gevşeklik ile hurmanın yeni meyvesi gibi bir kokusu olur. Bu koku ise hamur kokusuna yakındır. Kokusunun taze hurma ağacı fidanına benzediği de söylenir. Kuruduğu takdirde ise kokusunun sidik kokusuna benzediği söylenmektedir. Bunlar meninin nitelikleridir. Bazı nitelikleri de farklı olabilir. Mesela kişi hastalanacak olursa menisi ince ve sarı olabilir, yahut meninin bulunduğu yerde gevşeklik olduğundan ötürü zevk almadan ve şehvet olmadan da akabilir, ya da çokça cima yaptığı için etsuyu gibi kırmızı bir renk alır. Hatta bazen pıhtılaşmış bir kan gibi de çıkabilir. Meni kırmızı renkte çıkacak olursa tahirdir ve tıpkı beyaz olması halinde olduğu gibi gusletmeyi gerektirir. Meninin Meni Olarak Kabul Edilmesi İçin Dayanak Alınan Üç Özelliği Vardır: 1 - Akabinde bir rahatlama ile birlikte şehvetle çıkması 2- Az önce geçtiği gibi kokusunun taze hurma kokusuna benzemesi 3- Kısım kısım defalarca arka arkaya dışarı çıkması Bu üç özellikten her birisi o suyun meni olduğunu ispatlamaya yeterlidir. Bütün bu üç özelliğin onda bulunması şartı yoktur. Fakat bunların hiçbirisi bulunmayacak olursa, onun meni olduğuna hükmedilmez ve zannı galible meni olmadığı kanaatine sahip olunur. Söylediğimiz bütün bu hususlar erkeğin menisi ile ilgilidir. Kadının menisine gelince, o sarımtrak ve incedir. Bazı hallerde kadının gücünden ötürü beyaz da olabilir. Bunun iki özelliği vardır ki, bu ikisinden birisiyle meni olduğu anlaşılır. Birincisi kokusu erkeğin menisinin kokusu gibidir, ikincisi ise çıkması sebebiyle zevk almak ve çıkmasından sonra şehvetinin dinmesidir. ilim adamları der ki: Meni hangi nitelik ve durumda çıkarsa çıksın gusletmek icap eder. Allah en iyi bilendir. \"Hangilerinden üste çıkar ya da öne geçerse ... \" diğer rivayette (713) \"kadının suyu erkeğin suyunun üstüne çıkarsa ... \" buyurulmuştur. ilim adamları der ki: Burada üste çıkmaktan kasıt öne geçmek de olabilir, şehvetin gücüne göre çokluk ve güç de kastedilmiş olabilir. (709) \"Eğer erkekte görülen halonda da olursa gusletsin\" sözlerinin anlamı şudur: Kadının menisi dışarı çıkarsa o da gusletsin. Nitekim erkeğin de menisi dışarıya çıkacak olursa gusleder. Bu şekildeki tabir güzel ve latif hitabın bir neticesi, adeten utanılan bir lafzı kullanmak yerine güzel lafzın kullanılması türündendir. Allah en iyi bilendir. (710) \"MuhakkakAllah haktan haya etmez.\" ilim adamIarı der ki: (3/223) Yani AlI ah hakkı açıklamaktan imtina etmez. O sivrisinek ve benzerierini de örnek verir. Nitekim yüce AlIah şöyIe buyurmaktadır: \"Gerçekten Allah bir sivrisineği yahut ondan daha üstün herhangi bir şeyi misal vermekten çekinmez. \" (Bakara, 2/26) işte ben de aynı şekilde ihtiyacım oIan bir husus hakkında soru sormaktan çekinmiyorum. AnIamının şu olduğu da söyIenmiştir: AlIah hak ile ilgili hususIarda utanmayı emretmez ve mübah da görmez. O, bu sözIerini adeten kadınIarın hakkında soru sorup, erkeklerin önünde sözkonusu etmekten haya edip, utandıkları ama sorma ihtiyacını duyduğu sorusundan önce mazeret oImak üzere söyIemiştir. Bundan da: 1- Bir meseIe ile karşı karşıya gelen bir kimsenin ona dair soru sorması gerektiği 2- Haya edip utanması onu o meselesini sözkonusu etmekten alıkoymaması gerektiği anIaşılmaktadır. 3- Böyle bir soru sormaktan çekinmek gerçek bir haya değildir; çünkü hayanın tamamı hayırdır ve hayırdan başka bir şey getirmez. Ama böyIe bir duruma dair soru sormaktan uzak durmak hayır değildir, aksine şerdir. Bu nasıl haya olabilir ki? iman kitabının baştaraflarında bu meseIenin açıkIamasl geçmiş idi. Aişe (r.anha)'da Ensar'ın kadınları ne iyi kadınIardır. Haya etmek onIarın dinde iyi bir bilgi sahibi aImaIarını engellemedi.\" Allah en iyi bilendir. (712) \"Aişe dedi ki: Ben ona üf senden dedim.\" Bu onu ve söyIedikIerini küçük görmesi anIamındadır. Bu söz bir şeyi küçümsemek, ondan tiksinmek ve ona tepki göstermek için kullanılır. (3/224) eI-Bad dedi ki: Burada bu söz ile kastedilen tepki göstermektir. Üf'ün asıI anIamı tırnak kiridir. On ayrı söyIeyişi vardır. Tenvinsiz olarak ufi, ufe ve ufu ayrıca tenvinli oIarak söyIeyişIeri ile aItı söyIeyiş oIur. Yedincisi ife, sekizincisi uf, dokuzuncusu ufi, onuncusu da ufe'dir. BunIar meşhur olan söyleyişIer oIup, bunIarın hepsini ibnu'I-Enbari ve birçok ilim adamı zikretmiştir. Delilleri de oldukça meşhurdur. Bu husustaki açıklamaların en kısa olanları ez-Zeccac ve İbnu'l-Enbari'nin zikrettikleridir. Ebu'l-Beka da bunu kısaltarak şöyIe demiştir: Kesreli okuyan asIına göre bina etmiş, fethalı okuyan kolay söyleyişi tercih etmiş, dammeli okuyan da hemzeye tabi olarak dammeli söylemiş, tenvinli söyleyen nekreyi kastetmiş, tenvinli söylemeyen marifeliği kastetmiş, fe'yi şeddesiz okuyan kolaylık olsun diye birbirinin misli olan iki harften birisini hazfetmiş olur. Ahfeş ve İbnu'lEnbari, dokuzuncu söyleyiş olan ya'lı söyleyiş hakkında sanki o bu sözü kendisine izafe etmiş gibi söylemiş olur, demişlerdir. Allah en iyi bilendir. (713) \"Elin toprağa değsin ve harbe sana isabet etsin.\" Harbe sana isabet etsin \"ullet\" şeklinde rivayet edilmiştir. Bu da \"el-elle\" denilen harbe ona isabet etsin anlamındadır; fakat bazı imamlar bu lafzı kabul etmeyip, bunun doğru şeklinin \"elilti\" olduğunu söylemişlerdir. Ancak bu doğru olmayan bir tepkidir, aksine sahih olarak rivayet edilen lafız doğrudur ve bunun aslı \"elilet\" şeklindedir. Ancak \"iki elin\" deyip, ellafzını tesniye kullanmakla birlikte \"ellet\"i tekil kullanması iki sebepten dolayıdır: Birincisi cinsi kastetmiş olması, ikincisi iki eli olanı kastetmiş olmasıdır; yani harbe sana isabet etsin demek olur ki, bu durumda bir arada iki (bed)dua yapmış olur. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 37
			}
		}
	]
}