{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 716,
			"arabicnumber": "315.01",
			"text": "Bana Hasan b. Ali el-Hulvfmı tahdis etti. Bize Ebu Tevbe -ki o Rab!' b. Nafi\"dir- tahdis etti. Bize Muaviye -yani b. Sellam- Zeyd'den -yani kardeşinden- tahdis ettiğine göre o Ebu Sellam'ı şöyle derken dinlemiştir: Bana Ebu Esma er-Rahab!'nin tahdis ettiğine göre Resulullah (Sallallahu aleyhi ve Sellem)'in azatlısı Sevban kendisine tahdis edip dedi ki: Resulullah (Sallallahu aleyhi ve Sellem)'in yanında ayakta duruyordum. Yahudi hahamlarından bir haham gelip: Selam sana ey Muhammed, dedi. Ben onu öyle bir ittim ki, ondan dolayı neredeyse yere düşecekti. Beni neden ittin, dedi. Ben: Neden ey Allah'ın Resulü demiyorsun, dedim. Yahudi: Biz onu ancak ailesinin kendisine vermiş olduğu ismiyle çağırırız, dedi. Resulullah (Sallallahu aleyhi ve Sellem) bunun üzerine: \"Şüphesiz ailemin bana verdiği ismim Muhammed'dir\" buyurdu. Bu sefer Yahudi: Sana soru sormak için geldim, dedi. Resulullah (Sallallahu aleyhi ve Sellem): \"Eğer sana (cevabını) söyleyecek olursam sana bir faydası olur mu?\" buyurdu. Yahudi: Kulaklarımla duymuş olurum, dedi. Resulullah (Sallallahu aleyhi ve Sellem) beraberindeki bir sapa ile düşünceli bir şekilde yere bir şeyler çizdi sonra: \"Sor\" buyurdu. Yahudi: Yer başka bir yere değişeceği semaların da değişeceği günde insanlar nerede olacaktır, dedi. Resulullah (Sallallahu aleyhi ve Sellem): \"Onlar köprünün berisindeki karanlıkta olacaklar\" buyurdu. Yahudi: İnsanlar arasından (o köprüyü) ilk olarak kimler geçecek dedi. Allah Resulü: \"Muhacirlerin fakirleri\" buyurdu. Yahudi: Cennete girecekleri zaman onlara ne ikram edilecek, dedi. Allah Resulü: \"Balığın ciğerinin fazlalık kısmı\" buyurdu. Yahudi: Hemen onun arkasındaki gıdaları ne olacak, dedi. Resulullah (Sallallahu aleyhi ve Sellem): \"Cennetin kenarlarından yiyen bir öküz onlar için kesilecek\" buyurdu. Yahudi: Bunun üzerine ne içecekler, dedi. Allah Resulü: \"Orada Selsebil diye adlandırılan bir pınardan (içecekler)\" buyurdu. Yahudi: Doğru söylüyorsun, dedi şunları ekledi: Bir de sana yeryüzü halkı arasında bir nebinin yahut bir ya da iki adamdan başka hiç kimsenin bilmediği bir şey hakkında soru sormak üzere geldim, dedi. Allah Resulü: \"Sana söylersem (bunun) sana faydası olur mu\" buyurdu. Yahudi: Kulaklarımla işitmiş olurum, dedi. Sana çocuk hakkında sormaya geldim (dedi). Allah Resulü: \"Erkeğin suyu beyaz, kadının suyu sarıdır. Her ikisi bir araya gelip de erkeğin menisi, kadının menisinin üstüne çıkarsa Allah'ın izniyle erkek çocukları olur. Eğer kadının menisi erkeğin menisinin üstüne çıkarsa Allah'ın izniyle kız çocukları olur\" buyurdu. Yahudi: Andolsun doğru söyledin ve muhakkak sen bir nebisin dedi, sonra dönüp gitti. Sonra Resulullah (Sallallahu aleyhi ve Sellem): \"Bu adam bana hakkında cevap istediği bu soruları sorduğu zaman yüce Allah bana onların bilgisini bildirinceye kadar onların hiçbirisi hakkında bir bilgim yoktu\" buyurdu. Yalnız Müslim rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 38
			}
		}
	]
}