{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 717,
			"arabicnumber": "315.02",
			"text": "Bunu bana Abdullah b. Abdurrahman ed-Darimi de tahdis etti, bize Yahya b. Hassan haber verdi, bize Muaviye b. Sellam bu isnadta aynısını tahdis etti. Ancak o(nun rivayetinde Sevban): Resulullah (Sallallahu aleyhi ve Selleml'in yanında oturuyordum, dedi. Ayrıca o rivayetinde \"balığın ciğerinin fazlalığı\" derken (ziyade lafzı yerine zaide lafzını) söyledi,yine onun erkek ve kız çocuğu olur dediği halde ikisinin erkek ve kız çocuğu olur demedi. Yalnız Müslim rivayet etmiştir DAVUDOĞLU ŞERHİ AŞAĞIDA NEVEVİ ŞERHİ: Bu babta Sevban (r.a.)'ın Yahudi hahamının kıssası ile ilgili rivayet ettiği hadis yer almaktadır. Bundan önceki babta ise meninin nitelikleri açıklanmıştı. Habr (haham) kelimesi habr ve hibr olarak söylenir ve bunlar iki meşhur söyleyiştir, alim kişi demektir. \"Ebu Esma er-Rahabı\"nin adı Amr b. Mersed eş-Şam i ed-Dımeşki'dir. Ebu Süleyman b. Zeyd dedi ki: Ebu Esma er-Rahabı Dımaşk Rahabesinden idi. Burası da Dımaşk'ın kasabalarından bir kasaba olup, onunla Dımaşk arasında bir millik mesafe vardır. Ben onun bayındır bir kasaba olduğunu gördüm. Allah en iyi bilendir. \"Resuluilah (Sallallahu aleyhi ve Sellem) bir değnek ile düşünceli olarak bir şeyler çizdi.\" (3/226) Yani elindeki değnek ile yere izleri belli bazı çizgiler çizdi. Böyle bir işi düşünen bir kişi yapar. Bu da benzeri bir iş yapmanın caiz olduğuna ve bunun insanın mürüwetini ihlal etmediğine delildir. Allah en iyi bilendir. \"Köprüden berideki bir karanlık içinde\" Köprü kelimesi \"cisr\" ve \"cesr\" olarak telaffuz edilir, bunlar meşhur iki söyleyiştir. Burada köprüden kasıt da Sırattır. \"Onlara ne ikram edilecektir.\" Tuhfe, kişiye sunulan hediye özelolarak verilen ve onunla taltif olunan şeye (ikrama) denilir. İbrahim el-HalEbi dedi ki: Bu meyvenin bir yanı demektir. Allah en iyi bilendir. \"Balığın ciğerinin ziyadesi (fazla k/smı)dır.\" (Hadisteki lafzıyla) nun balık demektir, çoğulu \"nınan\" diye gelir. Diğer rivayette ise \"balığın ciğerinin zaidesi\" denilmektedir. Ziyade ve zaide aynı şeydir, bu da ciğerin kenan demek olup, onun en lezzetli ve hoş kısmıdır. \"Gıdalan\" iki şekilde rivayet edilmiştir. Birisi kesreli gayn ve zel ile diğeri ise fethalı gayn ve dal \"gada\"olarak. Kadı İyaz der ki: Bu ikinci rivayet sahih olandır, çoğunluğun rivayeti de budur. Birincisinin bir değeri yoktur. Derim ki: Ama onun açıklanabilir bir tarafı vardır. O zamanda gıdaları ne olacaktır takdirindedir. Yoksa maksat her zaman için onların gıdalarının ne olacağını sormak değildir. Allah en iyi bilendir. \"Orada selsebil diye adlandırılan bir pınardan\" buyruğu ile ilgili olarak dilbilgini ve müfessirlerden bir topluluğun dediğine göre, Selsebil pınarın adıdır. Mücahid ve başkaları ise selsebil hızlıca akmak demektir. Yumuşak ve rahat akan anlamında olduğu da söylenmiştir .. '1illah'ın izniyle erkek çocukları olur, Allah'ın izniyle kız çocukları olur\" ibarelerinde birincisinin anlamı çocuk erkek olur, ikincisinin anlamı da çocuk kız olur şeklindedir. (3/227) \"Kız çocukları olur\" anlamındaki lafız hemzesi uzatılıp, nun harfi şeddesiz olarak \"fınesa\" diye okunmakla birlikte hemzesi uzatılmadan ve nun harfi şeddeli olarak \"ennesa\" şeklinde de rivayet edilmiştir. Allah en iyi bilendir . DAVUDOĞLU AÇIKLAMA: Yahudi aliminin Resulullah (Sallallahu Aleyhi ve Sellem)'e gelmesi ya onun doğruluğunu deneyerek îman etmek için yahut sırf imtihan maksadı iledir. Zahire bakılırsa cevaplarını tastik ettiği halde iman etmeden oradan ayrılmıştır. Resulullah (Sallallahu Aleyhi ve Sellem) selam vermesi ve Hz. Sevban (R.A.) kendisini ittiği halde ona unf-u şiddetle cevap vermemesi ilminin kendisine kazandırdığı edep ve terbiyeye delalet eder: Biz onu ancak ailesinin verdiği ismiyle çağırırız» demesi de alime yakışan bir cevaptır. Halbuki Kureyş Hudeybiye musalehasmda; «Senin hakikaten Resulullah olduğunu bilsek seninle harb etmezdik» demişlerdi. Maamafih Yahudi aliminin nezaket göstermesi o anda başka bir şey elinden gelmediği için de olabilir; «Kulaklarımla dinlerim» demesi: «Senin söylediklerini dinler doğrumu dcgilmi düşünürüm» manasınadır. Yoksa bununla senin sözlerin bir kulağımdan girer bir kulağımdan çıkar manasını kastedmemiştir. Resulullah (Sallallahu Aleyhi ve Sellem)'in elindeki değnekle yeri kazması öteden beri arap büyüklerinin adeti olan,bir iştir. Onlar mühim bir mesele karşısında düşünceye daldıkları zaman böyle yaparlardı. Yahudi aliminin, ilk Suali kıyamete dair olmuştur. Gerek onun sualinden gerekse Fahr-i kainat (Sallallahu Aleyhi ve Sellem)'efendimizin verdiği cevaptan anlaşilıyorki kıyamet gününde yer yüzünün yalnız sıfatı değil bizzat kendisi değişecektir. Çünkü yeryüzünün yalnız sıfatı değişse mesela dağlar vadiler dümdüz edilmek sureti ile yeryüzü bugünkünden başka bir hal alsa yahudî alimine bunu anlamak müşkil gelmezdi. Aynı suali Resulullah (Sallallahu Aleyhi ve Sellem)'e Aişe (R.A.)'nın dahi sorduğu rivayet olunur. Resulullah (Sallallahu Aleyhi ve Sellem) in: «Onlar köprünün yanında karanlıkta olacaklardır.» buyurmasıda bu değişmenin zat itibarı ile olacağına delildir. Köprüden murad sırattır. Nitekim Âişe (R.A.)'a. verilen cevapda tasrih edilmiştir. Değişen yerin dümdüz beyaz olacağı gizlenecek hiçbir yeri bulunmayacağı Hz. Sehl (R.A.)'ın rivayet ettiği bir hadiste beyan buyurulmuştur. Bunun keyfiyetini Allah bilir. Yahudinin: «Sıratı ilk defa kimler geçecek?» sualine Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) «fakır muhacirler.» cevabını vermiştir. Bu sözün umumu fakir muhacirlerin zenginlerden efdal olmasını iktiza edersede Hz. Osman ve Abdurrahman b. Avf {R.A.) gibi zenginlerin Ebu Hureyre ve Ebu Zerr (R.A.) gibi fakirlerden efdal olduğuna icma'ı ümmet vardır. Bazan bir zat kendisine hass bir meziyetten dolayı üstünlük vasfı . ile zikrolunabilir. Bu onun mutlak surette başkalarından üstün olduğuna delalet etmez. Bu sebepledir ki böyle hadislerle fakirliğin zenginlikten daha makbul olduğuna istidlal edilemez. Ashab-ı kiramın kendi aralarında fakirlikmi daha makbul dür, Zenginlik mi? meselesini münakaşa ettikleri ve neticede zenginliği daha makbul buldukları rivayet olunur. Çünkü zenginlerin malları ile kazandıkları dereceleri fakirler kazanamaz. Fakirle zenginin ibadet ve taat hususunda müsavi olduklarını kabul edersek zengin mali ibadetleri sayesinde fakiri geçer. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) in zikrettiği fakirler kendi zamanındaki fakirlerdir. Yoksa sırattan önce geçmek için muhacirlerin aleddevam fakir kalmaları şart değildir. Yahudinin üçüncü suali cennete girerken ehl-i cennete ne gibi izzet-ü ikramda bulunulacağı meselesidir. Tuhfe: ikram için bir kimseye verilen hediyedir. Bu suale cevaben Resul-i Zîşan (Sallallahu Aleyhi ve Sellem) bir rivayette «Balık ciğerinin ziyadesi.» diğer bir rivayette «Balık ciğerinin zaidesi.» buyurmuştur. Bu iki kelime manaca birdir. Ve ciğerin kenarındaki çıkıntı demektir ki; ciğerin en güzel yeri de orasıdır. Cennete girer girmez yiyecekleri şey evvelce kendileri için tahsis edilip cennet bahçelerinde otlamakta olan öküzün eti, içecekleri de selsebil ismindeki kaynağın suyu olacaktır. Bunların hakikatlarını Allah bilir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 39
			}
		}
	]
}