{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7180,
			"arabicnumber": "2848.04",
			"text": "(Bize Züheyr b. Harb rivâyet etti. ki): Bize Affân rivâyet etti. ki): Bize Hammad (yani; İbn Seleme) rivâyet etti. ki): Bize Sâid haber verdi. ki): Enes'i, Peygamber (sallallahü aleyhi ve sellem)'den naklen şöyle derken işittim: Allah'ın dilediği kadarı kalacak, sonra Allahü teâlâ dilediklerinden onun İçin yeni halk yaratacaktır.» buyurdu. rivâyetleri Buhârî «Kitâbu't-Tefsir» ile «Kitâbu'l-Eyman ve Nüzûr»'da; Enes rivâyetini Tirmizî «Kitâbu't-Teisir»'de; Nesâî «Kitâbu'n-Nuût»'da muhtelif râvîlerden tahric etmişlerdir. Cehennemin münâkaşa ve muhasemesi hakkında Nevevî şunları söylemiştir: «Bu hadîs zahir mânâsı üzeredir. Allahü teâlâ cennetle cehenneme temyiz halketmiş, bu sayede idrak sahibi olmuşlar ve birbirleriyle muhasamede bulunmuşlardır. Ama bundan onların daimî surette akü ve temyiz sahibi olmaları lâzım gelmez.» Maamafih bu münakaşanın lisânı hal ile yapılmış olması da muhtemeldir. hadîsin otuz altı nolu rivâyetindeki «gırratuhum» tâbiri «garesü-hum» ve «acezejtühüm» şekillerinde de rivâyet olunmuştur. ; Açlık, demektir, Accde de: Âcizin cemidir. Fakat en meşhur rivâyeti «gırra»fdır. Bundan murad; gafil takımı yani; sünneti iyi anlamayan avâmdır. Bunlar saf oldukları için aralarına fitne ve bid'at girmez. İmanları sabit, inançları sağlamdır. Mü'minlerin ekserisi bunlardandır. Cennetliklerin ekserisi de bunlardan olacaktır. Arif ve Salih ulemânın adedi azdır Onların dereceleri yüksek olacaktır. yahut katı bana yeter mânâsına ism-i fiildir. hadîsler sıfat hadîslerinin meşhurlarındandır. Evvelce de îzah ettiğimiz vecihle ulemâ bu hususta mûfevvi'da ve müevvile olmak üzere iki mezhebe ayrılmışlardır. Müfevvida tefvîzciler yani; bu gibi hadîslerin mânâlarını Allah'a havale eyleyenlerdir. Selefin cumhûru bu mezhebde idi. Onlar kelimenin hak olduğuna iman eder, mânâsını Allah'a bırakırlardı. Çünkü kelimenin zahirî mânâsı Allahü teâlâ hakkında müstehıl yani; imkânsızdır. Müevvile te'vilcilerdir. Cumhûru Mütekelliminin mezhebi budur. Bunlar Allahü teâlâ hakkında vârid olan el ve ayak gibi aza isimleri hakkında ihtilâf etmişlerdir. Bazıları bu hadîslerde geçen ayak tâbirinden mütekaddim mânâsı kastedildiğini söylemişlerdir. Arabcada bu mânâ geçerlidir. Hadîsden murad; Allah cehennemin üzerine cehennemliklerden bazılarını koyar, demektir. Bir takımları buradaki ayaktan bazı kulalrın ayağı kastedildiğini ileri sürmüşlerdir. Buna göre mânâ: Allah cehennemin üzerine bazı kullarının ayağım koyar, demek olur. Kademin bir mahlûk ismi olduğunu söyleyenler olduğu gibi, yer ismi olduğunu söyleyenler de vardır. Hatta bazıları kadem kelimesini kudumdan alarak ona takdim mânâsını vermişlerdir. Bu takdirde hadîsin mânâsı: Allah cehennemin üzerine kulun azab için takdim ettiği şeyleri koyar, demek olur. koymaktan murad; yeter artık mânâsına geldiğini söyleyenler de olmuştur. Iyâz diyor ki: «Bu te'villerin en güzeli kadem kelimesinden cehennemi haketmiş bir kavm murad edilmiş olmasıdır. Kelimeyi zahirî mânâsına almamak mutlaka lâzımdır. Çünkü Allahü teâlâ hakkında aza imkânsızdır, bu husasta kati delil vardır. teâlâ’nın cennet için yeniden kullar yaratması Ehl-i Sünnet'in delillerindendir. Onlara göre sevab vermek, amele bağlı değildir. O, Allah'ın biri lûtfu ihsanıdır. Bu hadîsde de cennette yaratılan kullara hiç bir amelleri olmadığı halde sevab verileceği bildirilmektedir. Nitekim küçükken ölenlerle delilerin hâli de böyledir. Bunların hiç bir ameli olmadığı halde, cennete girecek Allahü teâlâ’nın fadlu rahmetine nail olacaklardır. Bu hadîsler cennetin pek büyük olduğuna da delildirler. Filhakika sahîh bir hadîsde cennette bir kişiye dünya kadar yer verileceği, dünyanın on misli kadar da ziyâdesi ihsan edileceği ve yine de yeni yaratılacaklar için boş yer kalacağı bildirilmiştir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 49
			}
		}
	]
}