{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7193,
			"arabicnumber": "2856.02",
			"text": "Bana Amru'n-Nâkıd ile Hasen El-Hulvânî ve Abd b. Humeyd rivâyet ettiler. (Abd: Ahberanî, ötekiler: Haddesena tâbirlerini kullandılar. Dediler ki): Bize Yakub (bu zat İbn İbrahim b. Sa'd'dır) rivâyet etti. ki): Bize babam Sâlih'den, o da İbn Şihab'dan naklen rivâyet etti. ki): Ben Saîd b. Müseyyeb'i şunu söylerken işittim: Bahira, şeytanlar için sağılmaktan menedilen devedir. Onu insanlardan kimse sağamaz. Sâibe ise, Arabların ilâhları için bıraktıkları devedir. Onun üzerinde hiç bir şey taşınmaz. İbn Müseyyeb ki: Ebû Hüreyre şunu söyledi: Resûlüllah (sallallahü aleyhi ve sellem): Amr b. Âmir El-Huzâî'y'ı cehennemde bağırsaklarını sürürken gördüm, Bu adam ilk sâibe bırakan adamdır.» buyurdular. hadîsi Buhârî «Kitâbu'l-Menâkıb»'de tahric etmiştir. devrinde Arablar deve beşinci yavruyu doğurduktan sonra, o hayvanın kulağını yarar, artık ona binmeyi ve o hayvanın sütünü haram sayarlardı. Putlarına tazim için hayvanın suya ve mer'aya gitmesine mani olunmazdı. Bu deveye bahîra denilirdi. adam seferinden dönersem yahut hastalığımdan iyileşirsem, devem sâibe olsun, diye nezrederdi. Artık bu hayvandan istifâde dahi haram sayılırdı. Buhârî şaibeyi Arabların putları için tahsis ettikleri deve mânâsına almıştır. Arablar sığır ve koyundan da bahîra ve sâibe yaparlardı. Ancak hüküm bu hayvanların yalnız dişilerine mahsustu. Hayvanın binmesi, yavrusu, yün ve yapağısı putun olur, sütü ile menfaati erkeklere mahsus kalırdı. Kadınlar bundan istifâde edemezlerdi. Abbâs Hazretlerinin beyânına göre, dişi deve beşinci yavruyu erkek doğurursa, o yavruyu keserler ve erkek kadın hep beraber yerlermiş. Dişi doğurursa, devenin kulağını yararlar, ona bâhira derlermiş. Arablarda deveyi sâibe yapmak âdeti Amr b. Âmir'den kalmıştır. arasında İsmail (aleyhisselâm)’in dinini ile değiştiren, put diken, sâibe ve bahîra âdetini ilk çıkaran kimse, bu adamdır. Hübel denilen putu Mekke'ye getirerek dikmiş, halkı ona ibâdet ve ta'zime teşvik etmiştir. Kendisi cömert bir adam olup, fakir fukarayı doyurduğu ve giydirdiği için Arablar üzerinde büyük nüfuzu varmış. Çok defa hac mevsiminde on bin deve keser, fukaraya on bin hülle giydirirmiş. hadîs-i şerif den anlaşılıyor ki, hiç bir kâfire âhirette dünyevî iyilikleri fayda vermeyeceği gibi, buna da bütün bu yaptıklarının zerre kadar faydası olmamış. Resûlüllah (sallallahü aleyhi ve sellem) kendisini cehennemde bağırsaklarını sürüklerken görmüştür",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 62
			}
		}
	]
}