{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7196,
			"arabicnumber": "2857.02",
			"text": "Bize Ubeydullab b. Saîd ile Ebû Bekr b. Nâfi' ve Abd b. Humeyd rivayet ettiler. (Dedilerki): Bize Ebû Âmir El-Akadî rivayet etti. (Dediki): Bize Eflah b. Saîd rivayet etti. (Dediki): Bana Ümmü Seleme'nin azatlısı Abdullah b. Râfi' rivayet etti. (Dediki): Ebû Hureyre'yi şunu söylerken işittim: Ben Resûlullah (Sallallahu Aleyhi ve Sel!em)'i: «Çok yaşarsan Allah'ın hışımı içinde sabahlayan ve lâ'neti içinde akşamlayan, ellerinde sığır kuyrukları gibi kamçılar olan bir kavimi görmen yakındır.» buyururken dinledim. izah: Bu hadîsin kadınlardan bahseden rivayeti, daha önce geçmişti. Hadîs-i şerif, Nebi (Sallallahu Aleyhi ve Sellem)'in mucizelerinden olup, haber verdiği gibi zuhur etmiştir. Yine hülâsa edelim; sığır kuyrukları gibi kamçıları olan kavim zabıta memurlarıdır. Giyinmiş çıplaklardan murad; bir kavle göre Allah'ın nimetlerinden giyinip de şükretmeyen kadınlardır. İkinci kavle göre ise, bunlar elbise giyen, fakat hayır işleyip âhireti için çalışmayan kadınlardır. Üçüncü kavle göre güzelliklerini göstermek için bedenlerinin bir kısmını açanlardır. Dördüncü kavle göre ise, altındakini gösterecek derecede ince elbise giyenlerdir. Eğrilmiş kadınlar Allah'ın taatından çıkanlardır. Eğriltenler de, kendi yaptıkları marifeti başkasına öğretenlerdir. Bâzılarına göre eğrilenlerden murad; kırıtarak yürüyenler, eğriltenler de, omuzlarını kırarak yürüyenlerdir. Başlarının deve horgüçlerine benzetilmesi, saçlarına çeşitli şeyler sararak tepeye doğru yükselttikleri ve kurdukları hotos yana doğru eğrildiği içindir. Hadîs-i şerif böylelerin cennete girmek şöyle dursun, onun kokusunu bile alamıyacaklarına açık delildir. Zamanımızda olduğu kadar kadınların hiç bir devirde bu hadîs-i şerife tam mânâsıyle misâl teşkil ettikleri görülmemiştir sanırım. Allah müslümanlara intibahlar nasib etsin. Amin",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 65
			}
		}
	]
}