{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7196,
			"arabicnumber": "2857.02",
			"text": "Bize Ubeydullab b. Saîd İle Ebû Bekr b. Nâfi' ve Abd b. Humeyd rivâyet ettiler. (Dediler ki): Bize Ebû Âmir El-Akadî rivâyet etti. ki): Bize Eflah b. Saîd rivâyet etti. ki): Bana Ümmü Seleme'nin azatlısı Abdullah b. Râfi' rivâyet etti. ki): Ebû Hüreyre'yi şunu söylerken işittim: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: yaşarsan Allah'ın hışımı içinde sabahlayan ve lâneti içinde akşamlayan, ellerinde sığır kuyrukları gibi kamçılar olan bir kavimi görmen yakındır.» buyururken dinledim. hadîsin kadınlardan bahseden rivâyeti, çıplak kadınlar Bâbında geçmişti. şerif, Peygamber (sallallahü aleyhi ve sellem)’in mucizelerinden olup, haber verdiği gibi zuhur etmiştir. Yine hülâsa edelim; sığır kuyrukları gibi kamçıları olan kavm zabıta memurlarıdır. çıplaklardan murad; bir kavle göre Allah'ın nimetlerinden giyinip de şükretmeyen kadınlardır. İkinci kavle göre ise, bunlar elbise giyen, fakat hayr işleyip âhireti için çalışmayan kadınlardır. Üçüncü kavle göre güzelliklerini göstermek için bedenlerinin bir kısmını açanlardır. Dördüncü kavle göre ise, altındakini gösterecek derecede ince elbise giyenlerdir. kadınlar Allah'ın taatından çıkanlardır. Eğriltenler de, kendi yaptıkları marifeti başkasına Öğretenlerdir. Bâzılarına göre eğrilenlerden murad; kırıtarak yürüyenler, eğriltenler de, omuzlarını kırarak yürüyenlerdir. deve horgüçlerine benzetilmesi, saçlarına çeşitli şeyler sararak tepeye doğru yükselttikleri ve kurdukları hotos yana doğru eğril-diği içindir. şerif böylelerin cennete girmek şöyle dursun, onun kokusunu bile alamıyacaklarına açık delildir. olduğu kadar kadınların hiç bir devirde bu hadîs-i şerife tam mânâsıyle misâl teşkil ettikleri görülmemiştir sanırım. Allah müslümanlara intibahlar nasib etsin",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 65
			}
		}
	]
}