{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7201,
			"arabicnumber": "2860.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Veki' rivâyet etti. H. Ubeydullah b. Muâz da rivâyet etti. ki): Bize babam rivâyet etti. Her iki râvi Şu'be'den rivâyet etmişlerdir. H.. Muhammed b. Müsennâ ile Muhammed b. Beşşar dahi rivâyet ettiler. Lâfız İbn Müsennâ'nındır. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be, Muğîra b. Nu'man'dan, o da Saîd b. Cübeyr'den, o da İbn Abbâs'dan naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem) bir va'z dolayısıyle hutbe okumak için aramızda ayağa kalktı ve: insanlar! Hiç şüphe yok ki, siz Allah'a yalınayak, çıplak, sünnetsiz olarak hasredileceksiniz. (İlk yaratmaya nasıl başladıksa, üzerimize va'd olarak onu öylece iade edeceğiz. Biz va'dimizİ yaparız.) Süre-i Enbiya, âyet: 104 Dikkat edin ki, kıyâmet gününde mahlûkatın ilk giydirileni İbrahim (aleyhisselâm) olacaktır. Dikkat edin ki, benim ümmetimden bir takım adamlar getirilecek, fakat onlar sol tarafa alınacaktır. Bunun üzerine ben: Yarabbi! Bunlar benim ashabınıdır, diyeceğim. (Bana) ; Bunların senden sonra ne modalar çıkardıklarını sen bilmezsin? denilecek? Ben de sâlih kulun dediği gibi (Ben onlara aralarında bulunduğum müddetçe şâhid oldum. Benim ruhumu kabzedince (artık) onların üzerine rakib sen oldun. Sen her şeye şâhidsin. Onları azab edersen, şüphesiz onlar senin kullarındır. Affedersen şüphe yok ki, Aziz Hakim olan ancak sensin) Sure-i Mâide, âyet: 117-118 diyeceğim. Bunun üzerine bana: Sen onlardan ayrılalı onlar geriye dönmekte devam ettiler, denilecektir.» ile Muâvın hadîsinde: «Bunun üzerine sen onların, senden sonra ne modalar çıkardıklarını bilmezsin, denilecek...» cümlesi vardır. rivâyetleri Buhârî «Kitâbu'r-Rikâk»'da; Hazret-i Âişe rivâyetini Nesâî «Kitâbu’l-Cenâiz» ile «Kitabu't-Tefsir»'de; İbnû Mâce Kitabu'z-Zühd»'de tahric etmişlerdir. ilk rivâyetindeki «Bınıeterciu» kelimesi «Bimeyerciu» şeklinde de rivâyet edilmiştir. Bu takdirde zamir parmağa değil, şahsa râci olur. Fakat zamirin parmağa râci olması daha münâsibdir. Maksad parmağa çok su dokunmaz, demektir. Hadîsden murad şudur: Âhiretin devamlı lezzet ve nimetlerine nisbetle dünyanın fâni nimetleri denizden alınan bir katre gibidir. Ağrelin cem'idir. Ağrel sünnet edilmemiş kimse demektir. Çocuğu sünnet ederken kesilen deri parçasına arablar gürle derler. Ü\\x na-disaen maksad; kıyâmet gününde insanların cisimlerinden hiç bir şey kaybetmemek şartıyle dünyaya geldikleri andaki şekilleriyle haşrolunacaklarını beyândır. gününde İbrahim (aleyhisselâm)’in Peygamberimiz (sallallahü aleyhi ve sellem)’den önce giydirilmesi bâzılarına göre sünnet olmak ilk defa onun şeriatında meşru olduğu içindir. Sünnet olurken avret mahalli açıldığı için tesettür mukâfatı evvelâ ona verilecektir. Bazıları bundaki hikmetin Hazret-i İbrahim ateşe atılırken elbisesinden soyulmuş olmasını söylemişlerdir. Bu rivâyetteki sâlin kuldan murad Isâ (aleyhisselâm)'dır. Âyet-i kerîme onun sözlerini beyan etmektedir. Mürtedlerden murâd; ne olduğu ihtilaflıdır. Bazılarına göre bunlar Hazret-i Ebû Bekr devrinde dinden dönenlerdir. Hallâbi: «Resûlüllah (sallallahü aleyhi ve sellem) murted sözüyle dinden dönenleri değil, vazifelerini yapmayanları kastetmiştir. Allah'a hamdolsun ki, sahabeden hiç bir kimse dinden dönmemiş sadece bedevilerden bir takım beyinsizler dönmüşlerdir.» diyor. Kâdî Iyâz da: «Bunlar biri asîler, diğeri küfre dönenler olmak üzere iki sınıfdır.» demiştir. Bu hadîsin şerhi «Kitâbu't-Tahara»'da geçmişti. sarihlerinden Übbî , Peygamberlerin yüksek makamlarına bakarak onların çıplak haşredilmeyeceklerine kail olmuştur. Ona göre İbrahim (aleyhisselâm)’in giydirilmesi haşrden önce kabirden kalkarken olacaktır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 70
			}
		}
	]
}