{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7207,
			"arabicnumber": "2865.01",
			"text": "Bana Ebû Gassan El-Mismaî ile Muhammed b. Müsennâ ve Muhammed b. Beşşar b. Osman rivayet ettiler. Lâfız Ebû Gassan ile İbni Müsennâ'nındır. (Dedilerki): Bize Muâz b. Hişam rivayet etti. (De­diki): Bana babam, Katade'den, o da Mutarrif b. AbdiIIah b. Sihhîr'den, o da İyad b. Hımar EI-Mışâvî'den naklen rivayet ettiki: Resulullah (Sallallahu Aleyhi ve Sellem) bir gün hutbesinde şöyle buyurrmışlar: «Dikkat edin ki, Rabbim bana öğrettiklerinden bilmediklerinizi bugün size öğretmemi emretti. (Buyurdu ki: Bir kul'a verdiğim her mal helâldir. Ben kullarımın hepsini müslüman olarak yarattım. Ama onlara şeytanlar gelerek kendilerini dinlerinden alıp götürdüler. Benim kendilerine helâl kıldıklarımı, onlara haram ettiler. Benim hakkında zelil indirmediğim bîr şeyi, bana şerik koşmalarını emrettiler. Şüphesi ki, Allah yer hnlkına bakarak onların Arabına. Acemine şiddet huğzetmiştir. Yalnız ehl-i kitabdan bir tokım bakiyyeler müstesna! Teâla Hazretleri: Ben seni ancak İmtihan edeyim ve seninle başkalarını imtihan edeyim diye gönderdim. Sana su götürmez hir kitab indirdim. Onu uyurken, uyanıkken okursun, buyurdu. Gerçekten Allah bana Kureyş'i cayır cayır yakmamı emretti. Ben: Yâ Rabbi! O halde benim başımı yararlar, onu bîr ekmek parçasına çevirirler, dedim. Teâlâ Hazretleri: Onlar seni nasıI çıknrdılarsa. sen de onları çıkar. Onlarla gaza et ki, sana yardım edelim. infakda bulun, bîz de sana infak edelim! Sen bir ordu gönder. Biz onun beş mislini gönderelim! Sana İtaat edenlerle birlikte isyan edenlere karşı harbet, buyurdu. Cennetlikler üç kısımdır: 1- Kuvvet sahibi, adaletli, sadaka verici, muvaffak! 2- Her akrabaya ve müslüman'a karşı ince kalpli, merhametli bir adam! 3- Bir de iffetli, namuslu, çoluk çocuk sahibi, buyurdu. Cehennemlikler ise beş kısımdır: 1- Akl' olmayan, zayıf kişi! Böylelerî sizin aranızda tâbi olarak bulunurlar. Hiç bir aile ve mala tâbi olmazlar. 2- Tama yüze vurmayan hain, kapıyı çalsa ona hıyanet eder. 3- Akşamda sabahda sana ailen ve malın hakkında mutlaka hıyanet eden adam, buyurdu. 4 Cimriliği yahut yalanı da zikretmiştir. 5- Bir de kötü huylu küfürbaz, Ebu Gassan kendi hadîsinde: «İnfak et, biz de sana infak edeceğiz...» cümlesini anmadı)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 76
			}
		}
	]
}