{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7210,
			"arabicnumber": "2865.04",
			"text": "(Bana Ebû Ammar Hüseyin b. Hureys de rivâyet etti. ki): Bize Fadl b. Mûsa, Hüseyin'den, o da Matar'dan naklen rivâyet etti. ki): Bana Katâde, Mutarrif b. Abdillah b. Şihhîr'den, o da Benî Muşâcı'ın kardeşi Iyaz b. Himar'dan naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem) bir gün hutbe okumak üzere aramızda ayağa kalktı da: ki, Allah bana emir buyurdu...» dedi. hadîsi Hişam'ın Katâde'den rivâyet ettiği hadîs gibi nakletmiş. Şunu da ziyâde eylemiştir: ki, Allah bana sîzin tevazu göstermenizi bildirdi. Tâ ki, kimse kimseye karşı böbürlenmesin, kimse kimseye tecavüzde bulunmasın!» hadîsinde şun da söylemiştir: sizîn aranızda tabiîlerdir. Ne aile ararlar, ne de mal.» diyor ki: Ben (Mutarrife): Bu olur mu ya Ebâ Abdillah? dedim. Evet! Vallahi ben onlara cahiliyyet devrinde eriştim. Bir adam mahallenin koyunlarını güdüyor, kendisine ancak onların cariyesi veriliyor, ona yakınlık ediyordu, dedi. kula verdiğim her mal helâldir...» cümlesinden murad: Arabla-nn kendilerine haram kıldıkları sâibe, bahire gibi şeyleri inkârdır. Bunlar onların haram itikad etmesiyle haram olmazlar, demektir. Hanifin cem'idir. Hanîf müslüman demektir. Bazıları bu kelimenin günahlardan temiz mânâsına geldiğini, bir takımları da doğru ve hidâyeti kabule müheyya demek olduğunu söylemişlerdir, teâlâ’nın yeryüzü halkına bakarak Arabına, Acemine şiddetle buğz etmesi Resûlullah (sallallahü aleyhi ve sellem)'in gönderilmesinden önce olmuştur. Resûlüllah (sallallahü aleyhi ve sellem)'i imtihan buyurması risâleti tebliğ, cihâd ve hak yolunda sabır gibi şeyler hususunda, ümmetini imtihan ise, iman edip etmeyecekleri, taatta bulunup bulunmıyacakları hususundadır. Bu imtihan her şeyden meydana çıkarak kullar tarafından bilinsin diyedir. Yoksa Teâlâ Hazretleri hâşa imtihana muhtaç değildir. O her şeyi vukuundan Önce bilir. Akıl demektir. Bazıları bu kelimenin mal mânâsına geldiğini, bir takımları da itîmad edilecek şey demek olduğunu söylemişlerdir. Abdillah, Hazret-i Mutarrif'in künyesidir. Mutarrif (radıyallahü anh) cahiliyyet devrine yetişmemişse de «yetiştim» sözüyle her halde devrin sonlarına ve eserlerine yetiştiğini kasdetmiş olacaktır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 79
			}
		}
	]
}