{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 723,
			"arabicnumber": "317.02",
			"text": "Bize Muhammed b. es-Sabbah, Ebu Bekr b. Ebli Şeybe, Ebu Kureyb, el-Eşe c ve İshak hepsi Vekl\"den tahdis etti (H). Bunu bize Yahya b. Yahya ve Ebu Kureyb de tahdis edip dediler ki: Bize Ebu Muaviye ve Vekl' tahdis etti, her ikisi A'meş'ten bu isnad ile hadisi rivayet etti ama bu ikisinin hadisi rivayetlerinde başa üç avuç su dökmek sözkonusu edilmemektedir. Vekl\"in hadisi rivayetinde ise abdestin tamamı anlablmakta ve bu abdest alışta mazmaza ve istinşakı da zikretmiş bulunmaktadır. Hadisin Ebu Muaviye rivayetinde ise mendilden (havludan) söz edilmemektedir. DAVUDOĞLU AÇIKLAMA: Bu hadisi Buharî gusl bahsinin «Mazmaza ve istinşak» babında tahriç etmiştir. Bazıları «Buhari'nin onu burada Gusl bahsinde zikretmekten muradı Mazmaza ile İstinşakın Gusulde farz olmadığına işaret içindir. Gusül için abdest almak bilicma' farz değildir. Mazmaza ile istinşak ise abdest de tabî olan şeylerdir. Asıl olan abdest farz olmayınca onun tabileri bulunan mazmaza ile istinşak ta farz değildir.» demişlerdir. Fakat bu istidlal doğru değildir. Zira hadîsin bir rivayetinde mazmaza ile istinşak tasrih edilmişlerdir. Resulullah (Sallallahu Aleyhi ve Selleın) in onlara devam üzere yaptığı şüphesizdir. Bu ise vücub ifade eder. Hadîsin buradaki rivayetinde Resullullah (Sallallahu Aleyhi ve Sellem)'in kurulanmak için getirilen havluyu kabul etmediği; Buharî'nin rivayetinde ise onunla kurulanmadığı bildiriliyor ki mana itibariyle ikiside birdir. Hz. Âişe (R.A.) dan rivayet olunan bir hadîste Resulullah (Sallallahu Aleyhi ve Sellem) in yıkandıktan sonra kurulanmak için bir bezi bulunduğu bildirilmektedir, NEVEVİ ŞERHİ (720-721): \"Resulullah (Sallallahu aleyhi ve Sellem)' e cünüplükten yıkanması için suyunu yaklaşbrdım.\" Buradaki gusl kelimesinden kasıt kendisiyle yıkanılacak, gusledilecek sudur. \"Sonra elini yere vurdu ve onu iyice ovaladı.\" Bundan su ile istinca yapan kimsenin işini bitirdikten sonra elini toprak ya da çöven ile yıkamasının yahut onu üzerindeki pisliklerin gitmesi için toprak veya duvara ovalamasının müstehap olduğu hükmü anlaşılmaktadır. \"Sonra avucunu doldurarak başına üç avuç su döktü.\" Bizim ülkemizdeki asıl nüshalarında bu şekilde \"avuç\" anlamındaki lafız tekil olarak zikredilmiştir. Kadı İyaz da bunu bu şekilde çoğunluğun rivayeti olarak nakletmiş bulunmaktadır. Taberi'nin rivayetinde ise tesniye olarak iki eli (avucu) şeklindedir ki, bu da çoğunluğun rivayetini tefsir eder. Avuç ise bir arada iki elin dolu halini ifade eder. \"Sonra ona (kurulanması için) mendil getirdim ama onu istemedi.\" Bundan organları kurutmamanın müstehap olduğu anlaşılmaktadır. Ama abdest ve gusül aldıktan sonra azalan kurutmak hususunda mezhep alimlerimizin farklı beş görüşü bulunmaktadır. 1- En meşhur görüşe göre müstehap olan, kurulanm,'!ı terk etmektir fakat kurulanmak da mekruhtur denilemez. 2- Kurulanmak mekruhtur. 3- Yapılması da, terk edilmesi de eşit mübah bir iştir. Bizim tercih ettiğimiz de budur. Çünkü bunu yasaklamak veya müstehap olduğunu söylemek için açık bir delile gerek vardır. 4- Kirlerden sakınma özelliği dolayısıyla müstehaptır. 5- Kışın değil de yazın kurulanmak mekruhtur. Bunlar bizim mezhep alimlerimizin sözünü ettiği hükümlerdir. Ashab da, başkaları da kurulanmak hususunda üç farklı görüş ortaya atmışlardır: 1 - Abdest aldıktan sonra da, guslettikten sonra da kurulanmakta bir beis yoktur. Bu Enes b. Malik ve es-Sevri'nin görüşüdür. 2- Her ikisi için de mekruhtur. Bu da İbn Ömer ve İbn Ebi Leyla'nın görüşüdür. 3- Abdest aldıktan sonra mekruhtur, gusülden sonra değildir. Bu da İbn Abbas (radıyallShu anh)'ın görüşüdür. (3/231) Kurulanılmayacağı ile ilgili bu hadis ile sahihteki: \"Nebi (Sallallahu aleyhi ve Sellem) gusletti ve başından su damladığı halde dışarı çıktı.\" Şeklindeki diğer bir hadis daha rivayet edilmiş bulunmaktadır. Kurulanmanın fiilen yapıldığı ile ilgili hadisi ise ashab (r.a.)'dan bir topluluk değişik yollardan rivayet etmiş olmakla birlikte, bu rivayetlerin senetleri zayıftır. Tirmizi dedi ki: Bu babta Nebi (Sallallahu aleyhi ve Sellem)'den sahih bir şey yoktur. Bazı ilim adamları kurulanmanın mübahlığına Meymune (r.anha)'nın bu hadiste (722) \"suyu şöyle şöyle yapmaya başladı\" yani onu üzerinden silkti demesidir. Suyun silkelenmesi mübah olduğuna göre onu kurulamak da onun gibi ya da ondan daha evla olmalıdır; çünkü her ikisi de suyu izale etmek gibi ortak bir özelliğe sahiptir. Allah en iyi bilendir. \"Mendil (mindil)\"in ne demek olduğu bilinmektedir. İbn Faris dedi ki: Bu kelime nakletmek demek olan \"en-nedl\"den alınmış olabilir. Başkası ise bu kelime kir demek olan \"en-nedl\"den alınmıştır; çünkü mendil ile kirler nedl edilir (giderilir). Nitekim \"teneddeltu fi'l-mindil: mendil ile temizlendim\" denilir. Cevherı dedi ki: Temendeltu bi'l-mindil: mendil ile temizlendim de denilir. Ancak Kisaı bu kullanımı kabul etmemiştir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 45
			}
		}
	]
}