{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7276,
			"arabicnumber": "2895",
			"text": "Bize Ebû Kâmil Fudayl b. Hüseyin ile Ebû Ma'n Er-Rakâşî rivâyet ettiler. Lâfız Ebû Ma'n'ındır. (Dediler ki): Bize Hâlid b. Haris rivâyet etti. ki): Bize Abdü’l-Hamid b. Ca'fer rivâyet etti. ki): Bana babam Süleyman b. Yesar'dan, o da Abdullah b. Haris b. Nevfel'den naklen haber verdi. (Şöyle dedi): Übey b. Ka'b ile birlikte duruyordum. Ubey: Dünyalık arama hususunda insanların boğazları muhtelif olmakta devam ediyor, dedi. Ben: Evet! dedim. Übey dedi ki: Ben Resûlüllah (sallallahü aleyhi ve sellem)’ı şöyle buyururken işittim: nehrinin altın bir dağ üzerinden açılması yakındır. İnsanlar bunu işitince, ona yürüyecekler ve onun yanında bulunan: İnsanların bundan bir şey almasına müsaade edersek, bunun hepsi götürülür, diyecektir. Müteakiben onun için harb edecekler ve her yüz kişiden doksan dokuzu öldürülecektir.» Kâmil kendi hadîsinde şöyle dedi: «Abdullah dedi ki: Ben Übey b. Ka'b ile birlikte Hassan kal'asının gölgesinde durdum.» hadîsi Buhârî «Kitabu’l-Fi'ten»'de; Ebû Dâvud «Menâhim\" bahsinde; Tirmizî «Kitâbu sifatu'l-Cennet»'de tahric etmişlerdir. dağdan murad; definedir. Fırat nehrinin açılması, suyunun çekilmesiyle olacaktır. bu hadîsdeki boğaz kelimesinden büyüklerin ve reislerin kastedildiğini söylemişlerdir. Bâzılarına göre bundan murad; cemaatlardır. Kâdî Iyâz bu kelimenin cüz'ü zikir küllü murad kabilinden mecazı mürsel olabileceğini söylemiştir. kelimesi, utum gibi, kal'a mânâsına gelir. ki, Fırat nehrinde define çıktığını işitenler, onu almak için koşacaklar ve birbirleriyle harbedeceklerdir. Bu harbde çarpışanların yüzde doksan dokuzu öldürülecek ve her ölen, keşke ben kurtulsam da defineyi ben alsam diyecektir. başında bulunanların ondan bir şey almamaları tenbih edildiğine göre, onun alınması mümkün bir yerde bulunacağı yahut maden halinde değil de, para veya külçe şeklinde olacağı anlaşılıyor. Alınmasının nehiy Duyurulması define birçok belâlara sebep olacağı içindir. Aynî: «Bu bir mucizedir.» diyor. İbn Tin'e göre, define müslümanların hakkı olduğu için alınmayacaktır. Fakat bu söze itiraz edilmiş, definenin müslümanlara âid olup olmadığı malûm değildir, denilmiştir. Nehyin asıl sebebi fitne ve çarpışmadır",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 42
			}
		}
	]
}