{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7278,
			"arabicnumber": "2897",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Mu-alla b. Mansûr rivâyet etti. ki): Bize Süleyman b. Bilâl rivâyet etti. ki): Bize Süheyl babasından, o da Ebû Hüreyre'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuşlar: A'mâk'a yahut Dâbık'a inmedikçe kıyâmet kopmayacaktır. Onların karşısına Medine'den o gün yeryüzü halkının en iyilerinden bir ordu çıkacaktır. Askerler saf bağladıkları vakit Romalılar bizimle, bizden esir alınanların arasını serbest bırakın: Onlarla harbedelim, diyecekler. Müslümanlar da: Hayır! Vallahi sizinle din kardeşlerimizin arasını serbest bırakamayız. Cevabını vereceklerdir. Müteakiben onlarla harbedecekler ve üçte biri münhezim olup, Allah ebediyen kendilerine tevbe İlham etmeyecektir. Üçte biri de öldürülecek, Allah ındinde şehitlerin en faziletlisi olacaklardır. Üçte biri ise fethedecek, ebediyen fitneye duçar olmayacaklardır. Müteakiben İstanbul fethedilecektir. Gaziler kılıçlarını zeytin ağaçlarına asınış, ganimetleri taksim ederken anîden içlerinde şeytan: Gerçekten Mesih aileleriniz hakkında sizin yerinizi aldı, diye nâra atacak. Onlar da çıkacaklardır, bu Bâtıldır. Şam'a geldikleri vakit ise çıkacaktır. Gaziler harbe hazırlanır, saflarını düzeltirlerken namaz ikâme olunacak ve Meryem'in oğlu İsa (aleyhisselâm) İnerek onların yanına gitmek isteyecektir. Allah'ın düşmanı onu gördüğü vakit tuzun suda eridiği gibi eriyecektir. Onu bıraksa kendiliğinden helâk olacak, lâkin Allah onu yed-i kudretiyle tepeleyerek kanını onlara süngüsünde gösterecektir. ile Dâbık yahut Dâbak Şam'da Halep yakınlarında İki yerdir. Hadîsdeki «Sübû» kelimesi «Sebev» şeklinde de rivâyet olunmuştur. Bu takdirde cümlenin mânâsı bizimle, bizden esir aldıklarınızın arasını serbest bırakın, demek olur. Iyâz: «Doğrusu bu kelimenin sübû şeklinde okunmasıdır. Ekser râvîler de onu bu şekilde rivâyet etmişlerdir.» demişse de «Her iki rivâyet de doğrudur. Çünkü onlar evvelâ esir alınmış, sonra kâfirleri esir etmişlerdir. Zamanımızda bu mevcuttur. Hattâ Şam ve Mısır'dala İslâm askerlerinin ekserisi esir edilmiş. Sonra bugün Allah'a hamdolsun küffârı esir almaktadırlar...» diyor. (sallallahü aleyhi ve sellem)’in A'mâka mı yoksa Dâbıka mı buyurduğunda sekteden râvîdir. Hadîsin siyakından da anlaşılacağı vecihle üçte biri münhezim olacak askerler müslümanlardır. Bunlar bozulup kaçtıkları için Allah kendilerine tevbe ilham etmeyecek, firarda ısrar edeceklerdir. Mesih aileleriniz hakkında sizîn yerînîzî aldı...» cümlesinden murad; memleketinizde bıraktığınız aileleriniz Deccal'ın eline geçti demektir ki, bunun yalan ve bâtıl olduğu hadîs-i şerifte tasrih edilmiştir. îsa hakkında kullanılan «emme» fiili İmâm oldu mânâsına değil, müslümanlara uymak, Peygamberlerinin sünnetini ele almak için yanlarına gitmek istedi, manasınadır. bu fiildeki mansûb zamirin Deccalla tâbilerine ait olduğunu söylemişlerdir. Bu takdirde cümlenin mânâsı: Hazret-i îsa inerek Deccal'la tâbilerini ihlâk için kastedecektir, demek olur. fethedilmiş, Resûlüllah (sallallahü aleyhi ve sellem)’in bu mucizesi de yerini bulmuştur",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 44
			}
		}
	]
}