{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 729,
			"arabicnumber": "321.01",
			"text": "Bize Harun b. Saîd el-Eylî rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Mahremetü'bnü Bükeyr, babasından, o da Ebu Selemte'bni Abdirrahman'dan naklen haber verdi. Ebu Seleme şöyle demiş: Âişe dedi ki: Resulullah (Sallallahu aleyhi ve Sellem) guslettiği zaman sağından başlar ve onun üzerine su döküp, yıkardı sonra vücudundaki pisliğin üzerine sağ eliyle su döker ve onu sol eliyle yıkardı. Bu işi bitirdikten sonra da başına su dökerdi. Aişe dedi ki: Ben ve Resulullah (Sallallahu aleyhi ve Sellem) her ikimiz de cünüp olduğumuz halde aynı kaptan guslederdik. Yalnız Müslim rivayet etmiştir NEVEVİ ŞERHİ (726-727): \"Ebu Seleme b. Abdurrahman dedi ki. .. Başına üç defa su döktü.\" Kadı İyaz -yüce Allah'ın rahmeti ona- dedi ki: Hadisin zahirinden anlaşıldığı üzere her ikisi de Aişe (r.anha)'nın başını ve (4/3) mahrem olan bir kimsenin yine kendi mahremi olan bir kadının bakması helal olan kadarıyla vücudunun üst taraflarını görmüşlerdir. Çünkü bu iki zalın birisi kendisinin de belirttiği gibi Aişe (r.anha)'nın sütkardeşi idi. Adının Abdullah b. Yezid olduğu söylenir. Ebu Seleme ise kızkardeşinin süt oğlu idi. Ebu Bekir'in kızı Ümmü Kulsum ona süt emzirmişti. Kadı İyaz der ki: Eğer onlar buna tanık olmayıp, görmemiş olsalardı, Aişe (r.anha)'nın su getirilmesini isteyip, onların önünde gusletmesinin bir anlamı olmazdı. Eğer o bütün bu yaplıklarını onların görmeyecekleri şekilde perde arkasında yapmış olsaydı, bu anlamsız bir iş olurdu ve durum Aişe'nin guslü sadece sözlü olarak anlatması ile kalırdı. Onun perde arkasına çekilmesi sadece bedeninin alt taraflarını ve mahrem olan bir kimsenin bakması helal olmayan kısımlarını örtmesi içindi. Allah en iyi bilendir. Aişe (r.anha)'nın bu yaplığından fiili olarak öğretmenin müstehab olduğuna delil vardır. Çünkü uygulamalı olarak öğretmek sözden daha iyi etki bırakır ve sözden daha çok hafızada yer eder. Allah en iyi bilendir. \"Resulullah (Sallallahu aleyhi ve Sellem)'in zevceleri perçem gibi olana kadar saçlarını kısallırlardı.\" Vefra limme' den daha uzundur. Limme omuzlara kadar ulaşmayan saça denilir. Bu açıklama el-Esmai'ye aittir. Başkası ise şöyle demektedir: Vefra, limme'den daha azdır. Kulakları geçmeyen saça denilir (tercümede perçem). Ebu Hatim dedi ki: Vefra kulaklar üzerine kadar gelen saça denilir. (4/4) Kadı İyaz (yüce Allah'ın rahmeti ona) dedi ki: Bilinen şu ki, Arap kadınları saçlarını kısım kısım örederdi. Muhtemelen Nebi (Sallallahu aleyhi ve Sellem)'in zevceleri bu işi Rasillullah (Sallallahu aleyhi ve Selleml'in vefalından sonra yapmışlardır; çünkü onlar vefatından sonra süslenmeyi bırakmış ve saçlarını uzatmaya ihtiyaçları kalmamıştı. Ayrıca saçlarının bakımıarını kolaylaşlırmak için de saçlarını kısaltmışlardı. Kadı İyaz'ın sözünü ettiği müminlerin annelerinin bu işi Resulullah (Sallallahu aleyhi ve Sellem) hayatta iken değil de vefalından sonra yaplıklarına dair açıklamayı aynı şekilde başkası da yapmış olup, bunun zaten başka türlü olması sözkonusu değildir. Onların Resulullah (Sallallahu aleyhi ve Sellem)'in hayatta iken böyle bir iş yapmış olmaları asla düşünülemez. Bunda kadınların saçlarını kısaltmalarının caiz oluşuna delil vardır. Allah en iyi bilendir. \"İkimiz cünüp olduğumuz halde\" Burada \"cünubani\" (ikimiz cünüp olduğumuz) ifadesi \"cünüp\" lafzının ikil ve çoğul yapılacağını gösteren iki söyleyişten birisine göredir. Diğer söyleyişte ise bütün kullanım şekillerinde \"cünüp\" lafzı değişmeden tekil olarak gelir. Nitekim yüce Allah'ın: \"Eğer cünüp iseniz\" (Maide, 5/6) buyruğu ile \"bir de cünüp iken\" (Nisa, 4/43) buyruklarında böyledir. Bu söyleyiş ise daha fasih ve daha meşhurdur. Sözlükte cünüplüğün asıl anlamı uzaklıktır. Cima ya da meninin çıkışı dolayısıyla gusletmesi kap eden kişi hakkında kullanılır; çünkü o bu sebeple namazdan, Kur'an okumaktan, mescitten uzak kalır ve bunlardan uzak durur. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 51
			}
		}
	]
}