{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7297,
			"arabicnumber": "2905.06",
			"text": "Bize Abdullah b. Ömer b. Eban ile Vâsıl b. Abdi’l-A'la ve Ahmed b. Ömer El-Vekiî rivâyet ettiler. Lâfız İbn Ebân'ındır. (Dediler ki): Bize İbn Fudayl babasından rivâyet etti. ki): Ben Salim b. Abdillah b. Ömer'i şöyle derken işittim: Ey Iraklılar! Size küçüğü soracak ve sizi büyüğe bindirecek değilim! Ben babam Abdullah b. Ömer'i şunu söylerken işittim: Resûlüllah (sallallahü aleyhi ve sellem)'i: ki, fitne şu taraftan gelecektir.» buyururken dinledim ve eliyle doğu tarafına işaret ederek: iki boynuzunun doğduğu yerden!» buyurdular. Halbuki siz birbirinizin boyunlarını vuruyorsunuz. Mûsa, Fir'avn hanedanından Öldürdüğü şahsı ancak hata suretiyle öldürmüş; bunun üzerine Allah (Azze ve Cell'e) kendisine: bir nefis öldürdün de, biz seni üzüntüden kurtardık ve seni adamakıllı imtihan ettik.\" Sûre-i Tahâ, âyet: 40 buyurmuştur. b. Ömer kendi rivâyetinde: «Sâlim'den» dedi. «İşittim» demedi. hadîsi Buhârî ile Tirmizî «Kitabu’l-FHen»'de tahric etmişlerdir. «Şeytanın boynuzlarından murad; başının iki tarafıdır.» demiş. Bâvûdî ise şeytanın hakikaten boynuzlan olduğunu söylemiştir. Bâzılarına göre hadîsdeki boynuzdan murâd; kuvvettir. Bu takdirde hadîsin mânâsı: «Güneş şeytanın kuvvet bulduğu zaman doğar...» demek olur. (sallallahü aleyhi ve sellem)’in doğu tarafa işaret buyurması o zaman doğuluların ekseriyetle kâfir olmasındandır. Nitekim şimdi de en azılı küffâr oradadır. Fitnenin doğudan zuhur etmesi aynı zamanda Cemel ve Sıffın vak'alarına da işaret olmuştur. Kezâlik Haricîler Necid, Irak ve daha Öteye doğru şark taraflarında zuhur etmiş; Müslümanların başına en büyük fitne olmuşlardır. Resûlüllali (sallallahü aleyhi ve sellem) bunları vukuundan evvel bilmiş, haber vermiştir. Hadîs-i şerîf onun mucizelerinden biridir",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 63
			}
		}
	]
}