{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7307,
			"arabicnumber": "2909.03",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Abdû'l-Aziz (yani; Ed-Derâverdî) Sevr b. Yezid'den, o da Ebû'l-Gays'dan, o da Ebû Hüreyre'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem): incecik baldırlı biri Allah (azze ve celle)'nin beytini harab edecektir.» buyurmuşlar. hadîsi Buhârî «Kitabü'l-Hac»'da; Nesâî «Kitabu'l-Hac» ve «Kitabu't-Tesir»'de tahric etmişlerdir. murad; Sudanlıların bir nev'idir. (sallallahü aleyhi ve sellem) bir hadîslerinde: «Habeşlilerde hayır yoktur. Aç kalırlarsa çalarlar, doyarlarsa zinâ ederler. Ama onlarda İki güzel haslet vardır. Yemek yedirmek ve yokluk gününde fakiri giydirmek.» buyurmuştur. Kabe'nin tahribi Bâbında birçok hadîsler vârid olmuştur. Bunlardan bazılarını Ebû Dâvud Et-Tayâlişî, Ebû Nuaym, İmâm Ahmed ve İbn'l-Cevzî tahric etmişlerdir. ateyn: İki baldircık sahibi, yani incecik bacaklı demektir. murad; Kâbeyi zayıf bir Habeşlinin harab edeceğini bildirmektedir. umumundan anlaşıldığına göre, bu hâdise îsa (aleyhisselâm) yere indikten sonra olacak, Kâbe'yi bağlarında ince bacaklı, şiş karınlı bir adam bulunmak üzere Habeşliler yıkacak, taş üstünde taş bırakmıyacaklar. Hatta bu taşları denize atacaklardır. Bu, kıyâmete Kabe’nin kalkması demektir. Bir rivâyette Kâbe'yi yedi sene hac eden bulunmayacak ondan sonra Kabe yıkılacak, daha sonra Kur'ân-ı Kerîm mushaflardan bîlâhere kalblerden silinecek, insanlar şiir ve mûsikîye ve câhiliyet hikâyelerine dönecekler, sonra Deccal çıkacak ve îsa (aleyhisselâm) inecektir. Bir rivâyette Kâbe’nin iki defa yıkılacağı üçüncü defasında Hacerü'l-Esved’in kaldırılacağı, başka bir rivâyette, ikinci defada Hacerü’l-Esved’in kaldırılacağı bildirilmiştir. şöyle bir sual hatıra gelebilir. Teâlâ. Hazretleri. Harem-i Şerîf'in emniyette olduğunu bildirmiştir. Bu hadîs ona muarız düşmüyor mu? Hayır! Muarız değildir. Çünkü Harem-i Şerifin emniyeti kıyâmet yaklaşıp, dünya harab oluncaya kadardır. Kabe'nin yıkılması ise ondan sonra olacaktır. Bazıları Habeşliler hâdisesi âyetin umumundan tahsis edilmiştir demişlerse de, Kâdî Iyâz birinci kavlin daha zahir olduğunu söylemiştir",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 73
			}
		}
	]
}