{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 735,
			"arabicnumber": "324",
			"text": "Bıze Muhammed b. el-Müsenna rivayet etti. (Dediki): Bize Muaz b. Hışam rivayet etti. Dediki: Bana babam, Yahya b. Ebî Kesir'den rivayet etti. (Demişki): Bize Ebu Selemete'bni Abdirrahman rivayet ett, onada Zeyneb binti ümmi Seleme rivayet etmiş. onada Ümmü Seleme anlatmışki: Kendisi Resulullah (Sallallahu aleyhi ve Sellem) ile birlikte cünüplükten dolayı aynı kaptan guslederlerdi. Diğer tahric: Buhari, 322 -uzunca-, 1929 -uzunca-; İbn Mace, 380 NEVEVİ ŞERHİ AŞAĞIDA DAVUDOĞLU AÇIKLAMA: Bütün bu rivayetler erkekle kadının bir kabtan beraberce veya biri diğerinden artan suyla yıkanmalarının caiz olduğunu göstermektedir. Ulemanın bu husustaki kavillerini gördük. Ebu Ömer Bu Hususta Beş Mezheb Olduğunu Söylüyor. Şöyleki : 1- Kadın cünüb veya hayzlı değilse; ondan artan suyla erkeğin yıkanmasında beis yoktur. 2- Erkek ve kadının birbirlerinden artan suyla yıkanmaları mekruhtur. 3- Kadından artan suyla erkeğin yıkanması mekruh ise de erkekten artan suyla kadının yıkanmasında kerahet yoktur. 4- Erkekle kadının beraberce başlıyarak abdest almalarında beis yoktur. Kadından artan su da zararsızdır. İmam Ahmed b. Hambel'in mezhebi budur. 5- Erkekle kadının birbirlerinden artan suyla yıkanmalarında beis yoktur. Bu hususta beraberce yahut ayrı ayrı aynı kaptan yıkanmaları hükmen müsavidir. Cumhur-u Fukahanın kavli budur. Erkekle kadının bir kabdan yıkanabileceği hususunda Tahavî, Kurtubî ve Nevevî ulemanın müttefik olduklarını nakletmişlerdir. Bu mes'ele Ashab-ı Kiramdan Ali b. Ebi Talib, İbni Abbas, Cabir, Enes, Ebu Hureyre, Âişe, Ümmü Seleme, Ümmü Hani ve Meymune (R.A.) hazeratmdan rivayet olunmuştur. Hz. Ali hadisini İmam Ahmed b. Hanbel, İbn-i Abbas hadisini «El Kebir» inde Tabaranî, Cabîr hadisini «Musannef» inde İbni Ebî Şeybe, Enes hadisini Buharî, Ebu Hureyre hadisini « Müsned» inde Bezzar, Âişe hadisini Tahavî ile Beyhakî, Ümmü Seleme hadisini İbnî Mace ile Tahavi, Ümmu Hani hadisini Nesaî, Meymune hadisini Tirmîzî tahrîc etmişlerdir. Mezkur hadislerin hepsi sahih olup «erkekle kadın birbirlerinden artan su ile yıkanamaz» diyenlerin aleyhine delildirler. Erkekle kadının aynı kaptan hangisinin evvel başlıyacağı meselesine gelince bir hadiste Nebi (Sallallahu Aleyhi ve Sellem)'in zevcelerinden birinin cünüblükten yıkandığı ve Resulullah (Sallallahu Aleyhi ve Sellem)'in ondan artan su ile sbdest almak ve yıkanmak istediği zevcesinin: «Ya Resulallah! Ben cünübtüm» dediği Fahr-i kainat efendimizin ona: «Su cünüb olmaz» buyurduğu rivayet edilmiştir. İbnî Mace ile Tahavî de abdest hakkında buna benzer hadisler rivayet etmişlerdir. Hatta Tahavî, hadîsi rivayet ettikten sonra: «Bu gösteriyor ki suyu biri diğerinden sonra alırmış» demektedir. Vakıa Resul-i Ekrem (Sallallahu Aleyhi ve Sellem)'in erkekle kadının birbirinden artan suyla yıkanmalarını men ettiğini bildiren rivayetler de vardır. Fakat bu rivayetler itirazdan salim değildirler. Hatta bazıları hakkında hadîs uleması «Sahih değildir» demişlerdir. İbni Tîn bazı ulemadan naklen eskiden erkeklerle kadınların bir kaptan ayrı ayrı abdest aldıklarını rivayet edersede mezkur zevat her halde ecnebi erkeklerle ecnebi kadınları kasdetmiş olsalar gerektir. Çünkü bir adamın kendi ailesiyle bir kabdan beraberce yıkanabileceğini babımız hadîsleri göstermektedir. NEVEVİ ŞERHİ (728-733): (728) \"Aişe (r.anha) Nebi (Sallallahu aleyhi ve Sellem) ile birlikte üç mudd alan bir kapta yıkanırdı.\" Diğer (729) rivayette \"aynı kaptan ... ellerimiz bir iner, bir kalkardı\" denilmektedir. Kadı İyaz birinci rivayetin tefsirinde iki açıklama zikretmektedir: Birincisine göre onların her biri guslü için ayrı ayrı üçer mudd su kullanırdı. İkinci açıklamaya göre burada mud'dan kasıt sa' dır, o takdirde ferak'ın sözkonusu edildiği hadise uygun olur. Bunun bazı hallerde böyle olduğu ve her ikisinin üç mudd alan bir kaptan gusletmiş olmaları, suyu boşalınca da ona ayrıca su katmış olmaları da mümkündür. Allah en iyi bilendir. Diğer taraftan bu (728) numaralı hadiste \"üç mudd ya da ona yakın\" ibaresi diğer (724) rivayette \"ferak'ın kendisi olan bir kaptan yıkanırdı\" başka (726) rivayette: \"Bir sa' kadar bir kap istedi ve onunla yıkandı.\" Öteki (733) rivayette \"beş mekkuk ile gusleder, bir mekkuk ile abdest alırdı.\" Öteki (736) rivayette \"bir sa' onun guslüne yeter, bir mudd de abdestine yeterdi.\" Diğer (735) rivayette \"bir mudd ile abdest alır, bir sa' ile beş mudde kadar su ile de guslederdi\" denilmektedir. İmam Şafii ve ondan başka birtakım ilim adamları şöyle demişlerdir: Bu rivayetleri bir arada telif etmek şöyle olur: Burada sözü edilen gusüller en fazla suyu bulup kullandığı ve en azını bulup kullandığı çeşitli durumlarda sözkonusu olmuştur. İşte bu da taharette tam olarak kullanılması kap eden su miktarının bir sınırının bulunmadığına delildir. Allah en iyi bilendir. (731) Ebu'ş-Şa'sa'nın adı Cabir b. Zeyd'dir. (732) \"Büyük bir ihtimalle bildiğim ve habrladığım şu ki. .. \" (4/6) Hatınmdan geçen, içimden geçen demek istiyor. Bal ise kalp ve zihin demektir. el-Ezherı der ki: Hatara bi bali va ala bali (hatırımdan geçti) denilir. Başkası da habr insanın içinden geçiveren duygudur demişlerdir, çoğulu havabr gelir. Bu hadisi Müslim -yüce Allah'ın rahmeti ona- mutabaat olmak üzere zikretmiştir. Yoksa ona itimat etmek maksadıyla bunu zikretmiş değildir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 57
			}
		}
	]
}