{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7360,
			"arabicnumber": "2932.02",
			"text": "(Bize Muhammed b. Müsennâ rivâyet etti. ki): Bize Hüseyn (yani; İbn Hasen b. Yesâr) rivâyet etti. ki): Bize İbn , Vvn, Nâfi'den rivâyet etti. ki): Nâfi', İbn Sayyâd’ın lâfını ediyordu. İbn Ömer dedi ki: Ben ona iki defa rastladım. Bir defa rastladığımda \"bir zata: Bunun o (Deccal) olduğunu mu konuşuyorsunuz? dedim. Hayır vallahi! cevâbını verdi. Bana yalan söyledin. Vallahi bana bîriniz haber verdi ki, o sizin hepinizden çok mal ve çocuk sahibi olmadıkça ölmeyecektir, Söylendiğine göre bugün o da Öyledir, dedim. Müteakiben hiraz konuştuk, sonra ondan yrildim. İbn Sayyâd'a başka bir defa daha rastladım. Gözü şişmişti: Bu gördüğümü gözün ne zaman yaptı? diye sordum. Bilmiyorum! diye cevâb verdi, Gözün başında olduğu halde bilmiyorsun ha! dedim. Allah dilerse onu senin şu sopanda da halkeder, dedi ve işittiğim en şiddetli eşek anırması gibi anırdı. Bazı dostlarım onu elimdeki sopayla sopa kırılıncaya kadar dövdüğümü söylediler. Ama ben vallahi hatırlamıyorum, dedi. diyor ki, İbnû Ömer gelerek Ümmü'l-Mü'minînin yanına girdi ve hâdiseyi ona anlattı. Ümmü'l-Mü'minin (Hafsa): Ondan ne istiyorsun? Bilmez misin ki, Resûlüllah (sallallahü aleyhi ve sellem): şüphe yok ki, onu insanlar üzerine gönderecek olan ilk şey kızdığı gadab olacaktır.» buyurdular, dedi. hadîsi Buhârî «Kitabu'l-Cihful», «Küâhu'Bedü’l-Halk» ve «OKitâbu'l-Enbiya»'da tahric etmiştir. Sayyâd’ın ismi Sâf'dır. Buna İbn Sâidde denilir. Ulema İbn Sayyâd kıssasını müşkil saymışlardır. Bu adamın deccallardan biri olduğunda, şüphe yoksa da Mesih nâmındaki meşhur Deccal olup olmadığında şüphe edilmiştir. Hadîslerin zahirleri bunun meşhur Deccal olduğuna dâir vahy gelmediğini göstermektedir. Peygamber (sallallahü aleyhi ve sellem)'e bildirilen yalnız Deccal’ın sıfatlarıdır. İbnû Sayyâd da ihtimalli karineler görülmüştür. Onun için Peygamber (sallallahü aleyhi ve sellem), ne bu adamın, ne de başkasının Deccal olduğunu katiyyetle söylememiştir. Hazret-i Ömer'e: bu o Deccal'sa, senin onu öldürmeye gücün yetmeyecektir.» buyurması bundandır. İbnû Sayyâd fitne fesat çıkaran ve kehânet gösteren yalancı deccallardan biri olduğu için, onun sıfatlarını haber vermiştir. Filhakika İbnû Sayyâd kendisine doğrucu ve yalancı kimseler geldiğini, su üzerinde taht gördüğünü, kendisinin meşhur olmaktan çekinmediğini, Deccal'ı tanıdığını, doğduğu yeri ve halen nerede olduğunu bildiğini iddia etmiştir. Müslüman görünmesi, cihad etmesi, bulunduğu halden vazgeçmesi onun Deccal olmadığına sarih delil kabul edilmemiştir. Hattabî diyor ki: «İhtiyarladıktan sonra hali selef arasında ihtilaflıdır. Rivâyete göre İbnû Sayyâd bu sözlerinden tevbe etmiş ve Medîne'de ölmüştür. Hattâ cenaze namazı kılınacağı vakit yüzü açılarak cemaata gösterilmiş ye şâhid olun, denilmiştir. Fakat yine rivâyete göre İbn Ömer'le Câbir İbn Sayyâd'ın Deccal olduğuna yemin ederler, bunda hiç şüphe eseri gös-termezlermiş. Hazret-i Câbir'e: İbn Sayyâd müslüman oldu demişler: İsterse Müslüman olsun, cevâbını vermiş. O Mekke'ye girdi, zâten Medine'de idi, demişler: Girse de Deccal'dır, demiştir. Dâvud'un Sünen'inde Hazret-i Câbir'den rivâyet edilen sahih bir hadîsde: «Biz İbn Sayyâd'i Harra harbinde kaybettik.» denilmiştir ki, bu hadîs onun Medîne'de öldüğünü söyleyenlere reddiyedir. Sayyâd'in Deccal olmadığını söyleyenler, bundan sonra göreceğimiz Cesâse hadîsiyle istidlal etmişlerdir. Câbir hadîsinde Peygamber (sallallahü aleyhi ve sellem)’in Hazret-i Ömer'in sözüne karşı sükût buyurmasından başka bir şey yoktur. İhtimal ki, onun bu şaşr kın hâli karşısında Deccal olup olmadığı hususunda tevakkuf etmiş, sonra onun Deccal olmadığı hususunda kendisine vahy gelmiştir. şöyle bir sual hatıra gelebilir: İbn Sayyâd, Peygamber (sallallahü aleyhi ve sellem)'in huzurunda Peygamberlik iddia ettiği halde onu neden Öldürmemiştir? suale iki vecihîe cevap verilmiştir:",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 122
			}
		}
	]
}