{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7373,
			"arabicnumber": "2937.01",
			"text": "(Bana Muhammed b. Mihran Er-Râzî de rivâyet etti. Lâfız onundur. ki): Bize Velid b. Müslim rivâyet etti. ki): Bize Abdurrahman b. Yezid b. Câbir, Yahya b. Câbir El-Tâî'den, o da Abdurrahman b. Cübeyr b. Nüfeyr'den, o da Çabası Cübeyr b. Nüfeyr'den, o da Nevvas b. Sem'an'dan naklen rivâyet etti. Nevvas şöyle dedi: Bir sabah Resûlüllah (sallallahü aleyhi ve sellem) Deccal'ı andı da onun hakkında alçaltına yükseltme yaptı, hattâ onu hurma \"bahçeliğinde zannettik. Akşamlayın yanına vardığımızda bizdeki tu za'nnı anladı. Ve: nedir?» diye sordu. Biz: Ya Resûlallah! Sabahlayın Deccal'i andın, onun hakkında öyle alçaltma yükseltme yaptın ki, kendisini hurma bahçesinde zannettik, dedik. Bunun üzerine şöyle buyurdular: başkası sizin namınıza beni daha çok korkutur. Eğer ben sizin aranızda iken çıkarsa, sizin namınıza ona ben galebe çalarım. Ben aranızda yokken çıkarsa, herkes kendi nefsinin galibi olur. Allah her müslüman hakkında benim halifemdir. Bu adam kıvırcık saçlı bir gençtir. Gözü fırlamıştır. Ben onu Abdû'l-Uzaz?. b Katana benzetir gibiyim. Sizden ona kim yetişirse, üzerine Kehf suresinin ilk âyetlerini okuyuversin. O, Şam'la Irak arasında bir semtten çıkacak ve sağa sola fesad saçacaktır. Ey Allah'ın kulları, sebat edin!» Biz: Ya Resûlallah! Yeryüzünde o, ne kadar kalacaktır? dedik. gün (kalacak). Bir gün bir sene gibi. Bir gün bir ay gibi. Bir gün bir hafta gibi sair günleri de sizin günleriniz gibi olacaktır.» »uyurdular. Ya Resûlallah! Bu bir sene gibi olacak günde, bir günün namazı bize kâfi gelecek mi? dedik. Onun için günün miktarını takdir edin!» buyurdu. Ya Resûlallah! onun yeryüzünde sür'ati ne olacak? dedik. «Arkasından rüzgâr esen yağmur gibidir. Bir kavmin üzerine gelerek onları davet edecek. Onlar da kendisine iman edecek ve icabette bulunacaklardır. Gökyüzüne emredecek, o yağmur yağdıracak. Yere emredecek, o da nebat bitirecektir. Akşamlayın deve sürüleri o kavmin yanlarına alabildiğine uzun hörgüçlü ve bol sütlü, böğürleri dolu olarak döneceklerdir. Sonra bir kavme gelerek onları da davet edecek, fakat onun sözünü reddedecekler, o da kendilerinden savuşup gidecektir. Bunlar kıtlık içinde sabahlayacaklar, ellerinde mallarından bir şey kalmayacaktır. (Bu adam) Bir harâbezâre uğrayarak ona dermelerini çıkar, diyecek. Harabenin defineleri arı kovanları gibi hemen arkasına düşeceklerdir. Sonra genç babayiğit bir adam çağıracak ve onu kılıçla vurarak ikiye bölecek, her parçayı bir ok atımı yere fırlatacaktır. Sonra bu adamı çağıracak. Adam ona gülerek yüzü parlar bir halde gelecektir. O bu halde iken anîden Allah, Mesih b. Meryem'i gönderecektir. Mesih, Dimeşk'in doğusundaki Akminareye iki boyalı elbise içinde, elini iki meleğin kanatları üzerine koymuş olarak inecek. Başını eğdiği zaman su damlayacak, kaldırdığı zaman ondan inci gibi gümüş taneleri yuvarlanacaktır. Onun nefesinin kokusunu duyan her kâfir mutlaka ölecektir. Nefesi de gözünün gördüğü yere varacaktır. Mesih bu adamı arayacak, nihayet ona Lüd kapısında yetişerek öldürecektir. Sonra Meryem oğlu isa'ya bu adamın şerrinden kendilerini Allah'ın koruduğu bir kavm gelecek. İsa onların yüzlerini silecek, onlarla cennetteki derecelerine göre konuşacaktır. O bu halde iken Allah İsa'ya: Ben öyle bir takım kullarımı çıkardım ki, onları öldürmeye hiç bir kimsenin eli varmaz. Imdİ sen benim kullarımı Tûr'a götürerek koru, diye vahy indirecek ve Allah Ye'cûc'ü Me'cûc'ü gönderecektir. Bunlar her tepeden sür'atla sizacaklardır. Bu suretle öncüleri Taberiye gölüne uğrayacak ve içindeki suyu içecekler. Son gelenleri oraya uğrayacak ve: Bu gölde bir zamanlar hakikaten su vardı, diyeceklerdir.. Nebiyyullah Isâ İle arkadaşları muhasara edilecek hattâ onlardan birine bir öküz başı, sizden birinize bugün yüz altından daha makbul olacaktır. Bunun üzerine Nebiyyullah İsa ile arkadaşları (Allah'a) niyaz edecekler. Allah da Ye'cûc Me'cûc'un üzerine, boyunlarına isabet edecek deve kurdu gönderecektir. Böylece bir kişinin ölmesi gibi helâk olarak sa-bahlıyacaklardır. Sonra Nebiyyullah Isâ ile arkadaşları (Turdan) yeryüzüne inecekler. Yeryüzünde onların ISşe ve pislikleri ile dolmadık bir karış yer bulamıyacaklardır. Nebiyyullah İsa ile arkadaşlar, yine Allah’a niyaz edecekler, Allah da Horasan develerinin boyunlar, gibi kuşlar gönderecek, bu kuşlar onların cesetlerini yüklenerek Allah'ın dilediği yere atacaklardır. Sonra'Allah öyle bir yağmur gönderecek ki, ona ne kerpiç evr ne de çadır mâni olabilecektir. Bu yağmur yeryüzünü yıkayacak, onu ayna gibi yapacaktır. Sonra yere mahsulünü bitir, bereketini tekrac getir, denilecektir, işte o gün cemaat nar yiyecekler ve onun kabuğu altında gölgeleneceklerdir. Süte bereket verilecek hatta yeni doğurmuş bir deve sürülerce insanlara yetecek; yeni doğurmuş'bir sığır insanlardan bir kabileye yetecek. Yeni doğurmuş bir koyun akrabadan bir oymağa kâfi gelecektir. Onlar bu halde İken, Allah güzel bir rüzgâr gönderecek, bu rüzgâr onları koltuklarının altlarından yakalayacak, her mü'minin ve her müslümanın ruhunu kabzedecekr insanların kötüleri kalarak yeryüzünde eşekler gibi alenen çiftleşeceklerdir. İşte kıyâmet bunların üzerine kopacaktır.»",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 134
			}
		}
	]
}