{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7373,
			"arabicnumber": "2937.01",
			"text": "Bize Ebû Hayseme Züheyr b. Harb rivayet etti. (Dediki): Bize Velîd b. Müslim rivayet etti. (Dediki): Bana Abdurrahman b. Yezîd b. Câbir rivayet etti, (Dediki): Bana Hıns Kadısı Yahya b. Câbir Et-Taî rivayet etti. (Dediki): Bana Abdurrahman b. Cübeyr, babası Cübeyr b. Nufeyr El-Hadramî'den rivayet etti. O da Nevvas b. Sem'an El-Kilâbî'den dinlemiş. H. Bana Muhammed b. Mihran Er-Râzî de rivayet etti. Lâfız onundur. (Dediki): Bize Velid b. Müslim rivayet etti. (Dediki): Bize Abdurrahman b. Yezid b. Câbir, Yahya b. Câbir El-Tâî'den, o da Abdurrahman b. Cübeyr b. Nufeyr'den, o da babası Cübeyr b.Nufeyr'den, o da Nevvas b. Sem'an'dan naklen rivayet etti. Nevvas şöyle demiş: Bir sabah Resulullah (Sallallahu Aleyhi ve Sellem) Deccal'ı andı da onun hakkında alçaltına yükseltme yaptı, hattâ onu hurma bahçeliğinde zannettik. Akşamlayın yanına vardığımızda bizdeki bu zannı anladı. Ve: «Haliniz nedir?» diye sordu. Biz : — Ya Resulailah! Sabahlayın Deccal'i andın, onun hakkında öyle alçaltına yükseltme yaptın ki, kendisini hurma bahçesinde zannettik, dedik. Bunun üzerine şöyle buyurdular: «Daccal'dan başkası sizin namınıza beni daha çok korkutur. Eğer ben sizin aranızda iken çıkarsa, sizin namınıza ona ben galebe çalarım. Ben aranızda yokken çıkarsa, herkes kendi nefsinin galibi olur. Allah her müslüman hakkında benim halifemdir. Bu adam kıvırcık saçlı bir gençtir. Gözü fırlamıştır. Ben onu Abdû'l-Uzaz b Katana benzetir gibiyim. Sîzden ona kim yetişirse, üzerine Kehf suresinin ilk âyetlerini okuyuversin. O, Şam'la Irak arasında bir semtten çıkacak ve sağa sola fesad saçacaktır. Ey Allah'ın kulları, sebat edin!» Biz: — Yâ Resûlallah! Yeryüzünde o, ne kadar kalacaktır? dedik. «Kırk gün (kalacak). Bir gün bir sene gibi. Bir gün bir ay gibi. Bir gün bir hafta gıoi sair günleri de sizin günleriniz gibi olacaktır.» buyurdular. — Yâ Resûlallah! Bu bir sene gibi olacak günde, bir günün namazı bize kâfi gelecek mi? dedik. «Hayır! Onun için günün miktarını takdir edin!» buyurdu. — Yâ Resûlallah! unun yeryüzünde sür'ati ne olacak? dedik. «Arkasından rüzgâr esen yağmur gibidir. Bir kavmin üzerine gelerek onları davet edecek. Onlar da kendisine iman edecek ve icabette bulunacaklardır. Gökyüzüne emredecek, o yağmur yağdıracak. Yere emredecek, o da nebat bitirecektir. Akşamleyin deve sürüleri o kavmin yanlarına alabildiğine uzun hörgüçlü ve bol sütlü, böğürleri dolu olarak döneceklerdir. Sonra bir kavme gelerek onları da davet edecek, fakat onun sözünü reddedecekler, o da kendilerinden savuşup gidecektir. Bunlar kıtlık içinde sabahlayacaklar, ellerinde mallarından bir şey kalmayacaktır. (Bu adam) Bir harâbezâre uğrayarak ona dermelerini çıkar, diyecek. Harabenin defineleri arı kovanları gibi hemen arkasına düşeceklerdir. Sonra genç babayiğit bir adam çağıracak ve onu kılıçla vurarak ikiye bölecek, her parçayı bir ok atımı yere fırlatacaktır. Sonra bu adamı çağıracak. Adam ona gülerek yüzü parlar bir halde gelecektir. O bu halde iken anîden Allah, Mesih b. Meryem'i gönderecektir. Mesih, Dimeşk'in doğusundaki Akminareye iki boyalı elbise içinde, elini iki meleğin kanatları üzerine koymuş olarak inecek. Başını eğdiği zaman su damlayacak, kaldırdığı zaman ondan inci gibi gümüş taneleri yuvarlanacaktır. Onun nefesinin kokusunu duyan her kâfir mutlaka ölecektir. Nefesi de gözünün gördüğü yere varacaktır. Mesih bu adamı arayacak, nihayet ona Lüd kapısında yetişerek öldürecektir. Sonra Meryem oğlu isa'ya bu adamın şerrinden kendilerini Allah'ın koruduğu bîr kavim gelecek. İsa onların yüzlerini silecek, onlarla cennetteki derecelerine göre konuşacaktır. O bu halde iken Allah İsa'ya: Ben öyle bir takım kullarımı çıkardım ki, onları öldürmeye hiç bir kimsenin eli varmaz. Imdi sen benim kullarımı Tûr'a götürerek koru, diye vahy indirecek ve Allah Ye'cuc'u Me'cuc'u gönderecektir. Bunlar her tepeden sür'atla sızacaklardır. Bu suretle öncüleri Taberiye gölüne uğrayacak ve içindeki suyu içecekler. Son gelenleri oraya uğrayacak ve : Bu gölde bir zamanlar hakikaten su vardı, diyeceklerdir.. Nebiyyullah Isâ ile arkadaşları muhasara edilecek hattâ onlardan birine bîr öküz başı, sizden birinize bugün yüz altından daha makbul olacaktır. Bunun üzerine Nebiyyullah İsa ile arkadaşları (Allah'a) niyaz edecekler. Allah da Ye'cuc Me'cuc'un üzerine, boyunlarına isabet edecek deve kurdu gönderecektir. Böylece bir kişinin ölmesi gibi helak olarak sabahlıyacaklardır. Sonra Nebiyyullah İsâ ile arkadaşları (Turdan) yeryüzüne inecekler. Yeryüzünde onların Iaşe ve pislikleri ile dolmadık bir karış yer bulamıyacaklardır. Nebiyyullah İsa ile arkadaşlar, yine Allah'a niyaz edecekler, Allah da Horasan develerinin boyunları gibi kuşlar gönderecek, bu kuşlar onların cesetlerini yüklenerek Allah'ın dilediği yere atacaklardır. Sonra AlIah öyle bir yağmur gönderecek ki, ona ne kerpiç ev ne de çadır mâni olabilecektir. Bu yağmur yeryüzünü yıkayacak, onu ayna gibi yapacaktır. Sonra yere mahsulünü bitir, bereketini tekrar getir, denilecektir, işte o gün cemaat nar yiyecekler ve onun kabuğu altında gölgeleneceklerdir. Süt'e bereket verilecek hatta yeni doğurmuş bir deve sürülerce insanlara yetecek; yeni doğurmuş bir sığır insanlardan bir kabileye yetecek. Yeni doğurmuş bir koyun akrabadan bir oymağa kâfi gelecektir. Onlar bu halde iken, Allah güzel bir rüzgâr gönderecek, bu rüzgâr onları koltuklarının altlarından yakalayacak, her mu'minin ve her müslümanın ruhunu kabzedecek, insanların kötüleri kalarak yeryüzünde eşekler gibi alenen çıftleşeceklerdir. İşte kıyamet bunların üzerine kopacaktır.»",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 134
			}
		}
	]
}