{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7374,
			"arabicnumber": "2937.02",
			"text": "(Bize Ali b. Hucur Es-Sa'dî rivâyet etti. ki): Bize Abdullah b. Abdirrahman b. Yezîd b. Câbir ile Velid b. Müslim rivâyet ettiler. İbn Hucur dedi ki: Bunların Abdurrahman b. Yezid b. Cabir'den bu isnadla yukarda zikrettiğimiz gibi rivâyet ettikleri hadîsleri birbirine girmiştir. O: bu yerde bir zamanlar su vardı...» cümlesinden sonra şunu da ziyâde etti. Sonra yürüyecekler, tâ ağaçlı dağa varacaklardır. Bu dağ beyt-i makdis dağıdır. Gerçekten yeryüzündeki bütün insanları öldürdük. Haydi semâdakileri öldürelim, diyecekler ve oklarını gökyüzüne atacaklar; Allah da onların oklarım kana bulanmış olarak geri çevirecektir.» Mucur'un rivâyetinde: bazı kullarımı indirdim. Onları Öldürmeye kimsenin eli varmaz.» cümlesi vardır. hakkında alcalma yükselme yaptı...» cümlesine ulema iki türlü mânâ vermişlerdir. Birinci kavle göre, onu hem tahkir etti, hem yükseltti yani; büyülttü manasınadır. Körlüğünü ve Allah'ı hiçe saymasını söylemesi tahkirdir. Fitnesini ve hârikalar göstererek insanların basına belâ kesilmesini söylemesi de büyültmesidir. İkinci kavle göre cümleden murad; konuşurken sesini alçaltıp yükseltmesidir. Uzun konuşarak yorulmuş, istirahat için biraz sesini alçatmıştır. Sonra anlattıklarınıherkese işittirmek için sesini yükseltmiştir. kelimesindeki vikaye nunu üzerinde ulema söz etmişlerdir. Bazıları bu kelimeyi sadece «Ahvcfii» şeklinde rivâyet etmişlerdir. Mânâca ikisi de bir ve ikisi de doğrudur. Fakat diyor ki: «Üstadımız İmâm Ebû Abdillah b. Mâlik (rahimehüllah) bu hadîsin hem lâfzı, hem mânâsı üzerinde söz etmeye ihtiyaç olduğunu söyledi. Lâfzı, ahvefû kelimesinin nunu vikaye ile mütekellim yasına izafe edildiği için söz götürür. Bu mutad değildir. Ve sadece müteaddı fiillere mahsustur. Fakat buna cevab verilmiş, esas İtibariyle bunda da nûnun is-batı gerekirdi, lâkin terkedilmiş bir kaidedir, denilmiştir. İsmi tafdîl sigasının fiile bahusus teaccûb fiiline benzerliği vardır. Binâenaleyh sonuna nunu vikaye getirilmesi caizdir. Kelimenin ahvefülî mânâsında kullanılmış olması da ihtimal dahilindedir. Bu takdirde nûn lamdan ibtal edilmiş olur. Ahvefülî cümlesi benim için daha korkunçtur manasınadır.» meşhur rivâyette noktasız hâ ile tespit edilmiştir. Semt mânâsına gelir. Bazıları bunun hüzün yeri ve kayalık mânâsına geldiğini söylemişlerdir. günün bir sene, bir günün bir ay ve bir günün bir hafta olmasını ulemâ zahiri mânâsı-üzere kabul etmişlerdir. Çünkü hadîsde sair günlerinin mutad günler gibi olacağı bildirilmiştir. Ashab bu uzun günlerde namazlarını nasıl kılacaklarını sorunca Peygamber (sallallahü aleyhi ve sellem) bir gün mikdârı takdir edip, o miktar içinde beş vakit namazlarını kılmaları lâzım geldiğini tenbih buyurmuştur. Yani; fecir doğduktan sonra sair günlerdeki mutad zaman geçtikten sonra öğleyi kılacaklar. Öğle ile ikindi arasındaki zaman miktarı geçince ikindiyi kılacaklar. Diğer namazlarda da buna göre hareket edeceklerdir. Kâdi Iyâz ile ulemâdan bazıları: hüküm o güne mahsustur. Bunu bize şeriat sahibi mesrû kılmıştır. Bu hadîs olmasa da mesele bizim içtihadımıza bırakılsa, biz diğer günlerde olduğu gibi, o uzun günde de vakit geldikçe o vaktin namazını kılar ve sadece beş vakit namazla iktifa ederdik.» demişlerdir. Maamafih mes'e-le ihtilaflıdır. Bir takım ulemâ: «Vakit müeddanm zarfı, edasının şartı, nefsi vucubunun sebebi zâhirisidir. Şart bulunmayınca meşrut da bulunmaz. Binâenaleyh gerek bu uzun günlerde, gerekse kutuplar gibi gece ile gündüzün altışar ay devam ettiği yerlerde vakit bulunmadığı için namaz da farz değildir.» demişlerdir. Onlara göre altı ay devam eden günde sadece beş vakit namaz kılınacak, demektir. Şâir ulemâ ise bu hadîsle istidlal ederek, bu yerlerde oraya en yakın mutad günü ve gecesi olan bir beldenin günleri miktarı zaman ayrılarak, o zamanın içinde yukardaki takdire göre beş vakit namaz kılınacaktır. Fetva bu kavle göredir. İhtiyat da budur. İsâ'nın ineceği bildirilen Akminâre, Şam'da hâlen mevcuttur. kapısı Beyt-i Makdise yakın bir beldedir. Hazret-i İsâ'nın yanına gelen kavmin yüzlerini silmesi hakkında Kâdî Iyâz: «İhtimal bu hakikattir. Onların yüzlerini teberrüken silmiştir. Fakat onların korku ve şiddetlerini gidermek için bir işaret olması ihtimâli de vardır.» diyor. İnsanların gözü önünde eşeklerin yaptığı gibi kadınlarla cim'a etmektir",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 135
			}
		}
	]
}