{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7377,
			"arabicnumber": "2938.03",
			"text": "Bana Merv halkından Muhammed b. Abdillah b. Kuhsâz rivayet etti. (Dediki): Bize Abdullah b. Osman, Ebû Hamza'dan, o da Kays b. Vehb'den, o da Ebû'l-Veddâk'den, o da Ebû Saîd-i Hudrî'den naklen rivayet etti. (Demişki): Resûlullah (Sallallahu Aleyhi ve Selleın) şöyle buyurdular : «Deccal çıkacak ve mü'minlerden bir zât onun tarafına doğru yönelecektir. Karşısına silâhlılar, Deccal'ın silâhlıları çıkacak ve ona: Nereye gitmek istiyorsun? diye soracaklar. O da, şu çıkan adama gitmek istiyorum, cevabını verecek.Silâhlılar kendisine : — Sen bizim Rabbimize iman etmiyor musun? diyecekler. O zât: — Bizim Rabbimizde bir gizlilik yoktur! cevâbını verecek. Silâhlılar : — öldürün şunu! diyecekler. Fakat birbirlerine: — Rabbiniz size ondan başka hiç birinizin bir kimse öldürmesini yasak etmedi mi? diyecekler. Arkacığından onu Deccal'a götüreceklerdir. Mu'min onu görünce : — Ey insanlar! Resûlullah (Sallallahu Aleyhi ve Selleın)'in andığı Deccal işte budur, diyecek. Müteakiben Deccal onun hakkında emir verecek ve karnı üzerine uzatılacaktır. Deccal : — Onu alın ve başını yarın! diyecek. Bunun üzerine dayaktan sırtı ve karnı genişletilecektir. Deccal : — Bana iman eîmiyormusun? diyecek. Mü'min de : — Sen yalancı Mesih'sin! cevâbını verecektir. Bunun üzerine mü'min hakkında emir verilecek ve başının ayrıntısında ta bacaklarının araşına kadar testere ile yarılacaktır. Sonra Deccal iki parçanın arasında yürüyecek ve ona, kalk! diyecek, o da hemen kalkıp doğrulacaktir. Sonra ona : — Bana iman ediyor musun? diyecek. Mü'min de : — Senin hakkında ancak basiretim arttı, cevâbını verecek. Sonra : — Ey insanlar! Bu adam benden sonra insanlardan hiç birine bü işi yapamıyacaktsr, diyecek. Deccal onu kesmek için derhal yakalayacaktır. Fakat mü'minin boynu ile köprücük kemiği arası bakır kesilecek, Deccal onu kesmeye imkân bulamıyacaktır. Bunun üzerine elleriyle ayaklarından tutarak onu atacak. İnsanlar da onun cehenneme atıldığını sanacaklardır. Fakat o ancak cennete konacaktır.» Resûlullah (Sallallahu Aleyhi ve Selleın): «Bu zât Rabbu'l-Âlemin indinde insanların en büyük şehididir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 138
			}
		}
	]
}