{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7385,
			"arabicnumber": "2941.03",
			"text": "(Bize Nasr b. Alî El-Cehdamî de rivâyet etti. ki): Bize Ebû Ahmed rivâyet etti. ki): Bize Süfyan, Ebû Hayyan'dan, o da Ebû Zür'a'dan naklen rivâyet etti. (Şöyle dedi): Mervan'ın yanında kıyâmeti müzâkere ettiler de, Abdullah b. Amr şunu söyledi: Ben Resûlüllah (sallallahü aleyhi ve sellem)’i şöyle buyururken işittim: yukarkilerîn hadîsleri gibi rivâyet etmiş. Ama kuşluk vaktini anmamıştır. Isâ'nın gönderilmesinden murad; gökyüzünden yere indirilmesidir. İman bahsinde görüldüğü vecihle İsâ (aleyhisselâm) yeryüzüne indikten sonra bizim şeriatımızla hükmedecektir. Bu babda Kâdî Iyâz şunları söylemiştir: «Ehl-i Sünnete göre İsâ (Aleyhüsselâm)’ın inmesi ve Deccal'ı öldürmesi haktır, sahihtir. Çünkü bu babda sahih hadîsler vârid olmuştur. Aklen ve şer'an bunu iptal edecek bir delil de yoktur. Binâenaleyh isbâtı vâcibdir.» Mutezile ve Cehmiye fırkalarından bazılarıyle onlara muvafakat edenler bu hadîslerin Hâtemü'n-Nebiyyin âyeti, Peygamber (sallallahü aleyhi ve sellem)’in: «Benden sonra Peygamber gelmeyecektir.» hadîsi ve müslümanların icmaı ile reddedildiklerini söylemişlerse de bu istidlal fâsiddir. Çünkü İsâ (aleyhisselâm)'ın inmesinden murad; bizim şeriatımızı nesneden yeni bir şeriat getirmesi değildir. Bu hadîslerde ve başkalarında buna dâir bir söz yoktur. Buradaki sahih hadîslere ve başkalarına göre Hazret-i İsâ adaletli bir hakem olarak inecek, bizim şeriatımızla hükmedecek ve insanların terk ettiği şer'î umuru ihya eyleyecektir. insanların kuş hafifliğinde ve yırtıcı tabiatında olmalarından murad; kötülüklere fesat ve şehvetlere sür'atle inhimakleri hususunda kuşun uçmasına düşmanlık ve zulüm hususunda da yırtıcı hayvanların tabiatlarına benzeyeceklerini anlatmaktır. Hadîs-i gerîf de Nu'man'in şekkettiği tali veya zili kelimeleri hususunda esah rivâyet tall'dir. Tali çiğ demektir. Nitekim başka bir hadîsde bu yağmurun, erkeklerin menisi gibi olacağı bildirilmiştir ki, bu da tali rivâyetini te'yid eder. «Zül »gölge demektir. açılmasından murad; kıyâmet gününün şiddet ve dehşetlerinin meydana çıkmasıdır. şöyle bir suâl hatıra gelebilir: Bu hadîsin bir rivâyetinde ilk Çıkacak kıyâmet alâmeti güneşin battığı yerden doğması ve Dabbetü'l-Arzın çıkması olacağı bildiriliyor. Halbuki bunların ikisi de ilk zuhur edecek kıyâmet alâmeti değildir. Kıyâmetin ilk alâmeti Peygamber (sallallahü aleyhi ve sellem) Efendimizin gönderilmesidir. Ondan sonra hadîslerde beyan edilen birçok alâmetler görülecektir? Bu suale Münâvî şu cevâbı vermiştir: Hadîsden murad; alışılmamış alâmetlerdir. Deccal’ın çıkması, Îsâ (aleyhisselâm)'ın inmesi ve Ye'cûc Me'cüc'ün zuhuru daha önce görülecek alâmetlerden ise de, bunlar alışılmış şeylerdendir",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 146
			}
		}
	]
}