{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7386,
			"arabicnumber": "2942.01",
			"text": "Bize Abdû'l-Vâris b. Abdîssamed b. Abdil-Vâris ile Haccac b. Şâir ikisi birden Abdüssamed'den rivayet ettiler. Lâfız Abdû'I-Varis b. Abdis-Samed'indir. (Dediki): Bize babanı, dedemden, o da Hüseyin b. Zekvân'dan naklen rivayet etti. (Demişki): Bize ibni Büreyde rivayet etti. (Dediki): Bana Hemdan Sâbın'dan Amir b. Şerâhil Eş-Şâ'bi rivayet etti ki, kendisi Dahhâk b. Kays'ın kız kardeşi Fâtıme binti Kays'e sormuş. Bu kadın ilk muhacirlerdenmiş. Demişki: Bana Resulullah (Sallallahu Aleyhi ve Selem)'den işittiğin, ondan başka hiç bir kimseye isnad etmediğin bir hadîs söyle! Fâtıme : — Sen istersen ben bunu yaparım! demiş. Âmir ona : — Evet! Bana rivayette bulun! demiş. Bunun üzerine Fâtıme şunu söylemiş : — Ben İbni Muğîra'ya nikâh oldum. O gün kendisi Kureyş gençlerinin en iyilerindendi. Derken Resulullah (Sallallahu Aleyhi: ve Sellem)'le birlikte bulunduğu ilk cihadda yaralandı. Ben dul kalınca, beni Resulullah (Sallallahu Aleyhi ve Sellem)'in ashabından birkaç kişi içinde Abdurrahman b. Avf istedi. Resulullah (Sallallahu Aleyhi ve Sellem) de beni azatlısı Üsâme b. Zeyd'e istedi. Bana rivayet olunmuştu ki, Resulullah (Sallallahu Aleyhi ve Sellem): «Beni kim severse Usâme'yi sevsin!» buyurmuşlar.Resulullah (Sallallahu Aleyhi ve Sellem) benimle konuşunca: — Emrim senin elindedir. Beni dilediğine nikâh et! dedim. Bunun üzerine : «Ummü Şerîk'e taşın!» buyurdu. Ümmü Şerîk Ensar'dan zengin, Allah yolunda nafakası çok bir kadındı. Ona misafirler gelirdi. — Yaparım! dedim. (Bu sefer) : «Yapma, çünkü Ummü Şerîk misafiri çok bir kadındır. Ben senin baş örtünün düşmesini yahut baldırlarından elbisen açılıp hoşlanmadığın bazı yerlerini cemaatın görmesini hoş karşılamam. Lâkın sen amcanoğlu Abdullah b. Amr b. Ummü Mektum'e taşın!» buyurdu. (Bu zat Kureyş'in fihri, Benî Fihr'den bir adamdı. Kendisi Fâtıme'nin kabilesinden idi.) Ona taşındım. İddetim geçince dellâlın (yâni) Resûlullah (Sallallahu Aleyhi ve Sellem)'in dellâlinin sesini işittim. — Haydin toplayıcı olduğu halde namaza! diye sesleniyordu. Hemen mescide çıktım ve Resulullah (Sallallahu Aleyhi ve Sellem)'le birlikte namazı kıldım. Cemaatın arkalarına gelen kadın safındaydım. Resulullah (Sallallahu Aleyhi ve Sellem) namazı bitirince gülerek minberin üzerine oturdu ve: «Herkes namaz kıldığı yerde kalsın!» buyurdu. Sonra: «Biliyormusunuz sizi niçin topladım?» dedi. Ashab: — Allah ve Resulü bilir, dediler. Buyurdu ki: «Ben vallahi sîzi bir istek veya korkudan dolayı toplamadım. Lâkin şunun için topladım ki, Temimi Dârî hıristiyan bir adamdı. Sonra gelerek bey'at etti ve müslüman oldu. Bana bir söz rivayet etti ki, Mesih-i Deccal için size anlattıklarıma uygun düştü. Bana anlattığına göre kendisi Lahm ve Cüzam kabilelerinden otuz kişi ile birlikte bir deniz gemisine binmiş de dalga onlarla denizde bir ay oynamış. Sonra tâ güneşin battığı yerde denizde bir adaya yanaşmışlar ve geminin kayıklarına binerek adaya girmişler. Derken karşılarına çok saçlı, kıllı bir hayvan çıkmış. Kılın çokluğundan önünü ardından ayıramamışîar ve : — Vah sana, sen kimsin? demişler. Hayvan : — Ben cessâseyim! cevabını vermiş. Oradakiler: — Cessâse nedir? diye sormuşlar. O : — Ey cemaat! Manastırdaki şu adama gidin, çünkü o sizin haberinize müştakdır, demiş. Temîm dedi ki : Cessâse bize bir adam ismi verince, biz onun bir şeytan olmasından korktuk ve hemen sür'atle gittik, manastıra girdik. Bir de ne görelim, orada hilkat itibariyle gördüklerimizin en büyüğü ve en şiddetli şekilde bağlanmış bir insan. Elleri boynuna, İki dizinin arası topuklarına demirle bağlanmış! — Vah sana, sen kimsin? dedik. — Siz benim haberimi almışsınızdır. İmdi bana haber verin, siz kimsiniz? dedi. Oradakiler : — Biz Arablardan bir takım insanlarız. Bir deniz gemisine bindik de denize coştuğu anda rastladık. Dalga bizimle bir ay oynadı. Sonra senin şu adana yanaştık ve geminin kayıklarına binerek adaya girdik. Derken karşımıza kıllı, çok saçlı bir hayvan çıktı. Saçın çokluğundan önü arkasından farkedilemiyordu. — Vah sana, sen kimsin? dedik. Ben cessâseyim, cevâbını verdi. Cessâse nedir? diye sorduk. Manastırdaki şu adama gidin, çünkü o sizin haberinize müştaktır, dedi. Biz de koşarak sana geldik. Ondan korktuk. Bir şeytan olmayacağından emin değildik, dedik. Bunun üzerine (o adam) : — Bana Beysan hurmalığından haber verin! dedi. — Onun nesinden haber almak istiyorsun? dedik. — Size onun hurmasını soruyorum. Yemiş veriyor mu? dedi. Kendisine: — Evet! cevâbını verdik. — Dikkat edin ki, onun yemiş vermemesi yakındır. Bana Taberiye gölünden haber verîn! dedi. — Onun nesinden haber almak istiyorsun? dedik. — İçinde su var mı? dedi. Oradakiler : — Onun suyu çoktur! dediler. — Dikkat edin, gerçekten onun suyu çekilmek üzeredir. Bana Zügar pınarından haber verin! dedi. Oradakiler : — Onun nesinden haber almak istiyorsun? dediler. — Pınarda su var mı? Sahipleri pınarın suyuyla ekin yetiştiriyorlar mı? dedi. Kendisine : — Evet, onun suyu çoktur. Sahipleri de suyundan ekin yetiştirirler! cevâbını verdik. — Bana Ummîlerin Nebisinden habor verin, ne yaptı? dedi. Oradakiler : — Mekke'den çıktı, Yesrib'e yerleşti, dediler. — Arablar onunla harbettiler mi? diye sordu. Biz : — Evet! cevâbını verdik. — Onlarla ne yaptı? dîye sordu. Kendisine onun peşinden gelen Arablara galip geldiğini ve Arablarm ona İtaat ettiğini haber verdik. — Bu oldu mu? dedi, — Evet! cevâbını verdik, — Dikkat edîn ki, bu halleri ona itaat etmiş olmalarından daha hayırlıdır. Ben size kendimi haber vereyim. Ben gerçekten Mesih'im ve bana çıkış için izin verilmesi yakındır. Çıkıp yeryüzünde sefer edeceğim. Mekke ile Taybe'den başka kırk gecede İnmediğim belde bırakmıyacağım. Bunların ise ikisi de bana haram kilınmıştır. Her ne zaman bunlardan bîrine girmek istersem, elinde çekilmiş bîr kılıç olduğu halde bîr melek karşıma çıkacak, beni ondan men edecektir. O yerin her yolunun üzerinde orasını koruyacak meleltler vardır, dedi.» Fâtıme demîş ki: Resıilullah (Sallallahu Aleyhi ve Sellem) asâsıyla minbere dokunarak : «İşte Taybe budur! İşte Taybe budur! İşte Taybe budur!» buyurdu. Medine'yi kastediyordu, (Ve sözüne devamla) «Dikkat edin, bunu size söylemiş miydim?» dedi. Cemaat: — Evet! cevâbını verdiler. «Gerçekten Temîm'in sözü, bu sözün Deccal ve Medine ile Mekke hakkında söylediklerime uyması hoşuma gitti. Dikkat edin ki, o Şam denizinde yahut Yemen denizindedir. Hayır! Doğu tarafından. Evet! O, doğu tarafından! Evet! O, doğu tarafından zuhur edecektir.» buyurdu. Ve eliyle doğu tarafına işaret etti. Fâtıme: Ben de bunu Resulullah (Sallallahu Aleyhi ve Sellemj'den belledim, demiş)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 147
			}
		}
	]
}