{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 739,
			"arabicnumber": "326.02",
			"text": "Bize Ebu Bekr b. Ebi Şeybe de tahdis etti. Bize İbn Uleyye tahdis etti (H). Bana Ali b. Hucr de tahdis etti. Bize İsmail, Ebu Reyhane'den tahdis etti. O Sefine'den -Ebu Bekr, Resulullah (Sallallahu aleyhi ve Sellem)'in arkadaşı (Sefine'den) dedi- dedi ki: Resulullah (Sallallahu aleyhi ve Sellem) bir sa' ile gusleder bir mudd ile abdest alırdı. Hadisin İbn Hucr yoluyla gelen rivayetinde: Ya da şöyle dedi: Bir mudd onun abdestine yeterdi. (Ebu Reyhane) ayrıca: O (Sefine) yaşlanmıştı ve ben onun hadisine pek güvenmiyordum, dedi. Diğer tahric: Tirmizi, 56; İbn Mace, 267 NEVEVİ ŞERHİ: \"Bize Ebu Reyhane, Sefine' den tahdis etti.\" Ebu Reyhane' nin adı Abdullah b. Matar'dır. Ziyad b. Matar olduğu da söylenir. Sefine ise hem Resulullah (Sallallahu aleyhi ve Sellem)'in arkadaşı, hem onun azatlısıdır. Adının Mihran b. Ferruh olduğu söylendiği gibi, Mahran, Ruman, Kays, Umeyr, Şenbe olduğu da söylenir. Meşhur künyesi ise Ebu Abdurrahman'dır. Ebu'l-Bahteri olduğu da söylenmiştir. Ona Sefine deniliş sebebine gelince, o bir gazada arkadaşlarına ait çok miktardaki eşyayı taşımıştı. Bundan dolayı Nebi (Sallallahu aleyhi ve Sellem) ona: \"Sen Sefine (bir gemi}sin\" buyurmuştu. \"Bize Ebu Bekr b. Ebi Şeybe tahdis etti ... Onun hadisine güvenmiyordum.\" Bu rivayette geçen \"Resulullah (Sallallahu aleyhi ve Sellem)'in arkadaşı idi\" sıfatı Sefine'ye aittir. Sözü geçen bu sözü söyleyen Ebu Bekr ise Ebu Bekr b. Ebi Şeybe'dir. Yani onu bu şekilde nitelendiren yalnızca Ebu Bekr b. Ebi Şeybe'dir. Ali b. Hucr ise onu bu şekilde nitelendirmeyip, sadece Sefine'den demekle yetinmiştir demek istemektedir. \"Hadisine güvenmiyordum\" ibaresinde güvenmek anlamındaki fiil peltek \"se\" harfi ile \"vüsuk\"tan gelmektedir. Asıl nüshaların çoğunda da böyledir. Bununla birlikte bir topluluk da bu fiili beğenmek ve ondan hoşnut olmak anlamında hemzeden sonra ye ve nun ve kaf harfleri ile rivayet etmişlerdir ki bu da beğenmek, razı olmak demektir. (4/8) \"Yaşlanmışb\" diyen zat Ebu Reyhane' dir. Yaşlandığı söylenen kişi de Sefine'dir. Müslim -yüce Allah'ın rahmeti ona- ise onun bu hadisini yalnız ona güvenerek zikretmiş değildir. Aksine o bu hadisi daha önce zikretmiş olduğu diğer hadislere mutabaat olmak üzere sözkonusu etmiştir. Allah en iyi bilendir. * Hayz Kitabı 3. ciltte devam etmektedir * DAVUDOĞLU AÇIKLAMA: Hadis-i şerif muhtelif rivayetleri ile Resulullah (Sallallahu Aleyhi ve Sellem) abdest ve guslü için ne kadar su sarf ettiğini göstermektedir. Müdd ile Sa'ın neler olduğu yukarıda kısaca arz edilmişti. Ancak sa' hakkında muhtelif rivayetler vardır. Bu husustaki tafsilatı «Tecrid-i Sarîh» mütercimi merhum Ahmed Naîm beyden dinleyelim. Naîm bey şöyle diyor: «Sa': Beş rıtl-ı Bağdadî ile bir sülüs rıtl (1/3) istîab eden kaba denir. Bir müdd de bir sa'ın dörtte biri miktarıdır. Bu Şafiîler-den Nevevî 'nin verdiği hesaptır. Ancak bu ölçek pek ihtilaflı olduğundan ihtilafların derecesini anlamak istiyenler Kamus Tercemesi'nden müdd, sa', mekkuk, rıtl kelimelerine müracaat edebilirler. (Aleyhisselatü vesselam)'efendimiz hazretlerinin muhtelif miktarlarda su ile abdest alıp iğtisal buyurduklarına dair diğer pek çok rivayetler de vardır. Buradaki miktarlar orta yapılı bir kimsenin yıkanacak azası üzerinden akacak suyun en az miktarını gösterir. Bedenin azası üzerinden su aktıktan sonra bu mikdarlardan da az su ile hades giderilebilir. İsraf dedirtmeyecek ziyadesiyle de caizdir. Medine-i Münevvere'de kullanılan müdd -ki fukaha arasında «Müdd-ü Nebevi» namıyla maruftur- (4/3) rıtıl miktan alan bir hacim ölçüsüdür. Dört müdd bir sa'dır. Ancak müdd ile sa'ın miktarlarını anlamak, mikyas tutulan rıtl'ın ne miktar olduğunu bilmeye bağlıdır. Rıtl'ın ise Bağdadîsi, Şamîsi vardır. Yani birinin küsuru İran, diğerinin ki Roma ölçüleri olup hesap edilince takrîbî bir miktar gösteren iki ölçektir. Rıtl-ı Bağdadî (130) daha doğrusu İmam Nevevî'nin tahkikine göre (900/7 ) dirhemdir. Esah olan ikinci takdir isede kesirli olduğundan buna (10/7) dirhem; diğer tabirle bir miskal katarak kesirsiz (130) dirhem itibar edilmiştir, deniliyor. (4/3) rıtl olan bir müdd-ü nebevi bu hesaba göre (1200/7) veya (130) dirhem hesabına göre (520/3) dirhem eder ki en doğru hesap ve takdire göre bir dirhem (3.0898) gram ettiğinden bu miktar su (0,530) yani yarım litreden biraz ziyadece bir şey tutar. Bu miktar bu gün sucuların kullandıkları su bardaklarından üçünün aldığı sudan azdır. Bu, İmam Şafîî ile Hîcaz fukahasının takdiri olup Ebu Hanife ile Irak fukahasına göre ise müdd, iki rıtl olduğundan abdest suyunun miktarı (1,06) litre eder ki; beş kadehten biraz ziyadecedir. Rıtl-ı Şamî : Kamus Tercümesi'nin rıtl maddesinde beyan edildiğine göre (12) okiyye ve her okiyye (40) dirhem olduğundan bu hesaba göre (480) ve bir müdd (620) dirhem olmak lazım gelirse de yine kamusun mekkük maddesinde tafsil edildiğine göre bir okiyye (5/3) istar bir istar (9/2 ) mıskal, bir miskal de (10/7) dirhem olduğundan bir rıtl yine İmam Nevevi'nin bildirdiği üzere (900/7) ve bir müdd (1200/7) dirhem olmuş olur. Bu hesaba göre okiyye Kamus müterciminin rıtl maddesinde dediği gibi kırk dirhem değil Hicazlılarm takdirine göre (75/7) ve Iraklıların takdirine göre (150/7) dirhem olmuş olur. Meğer ki o maddede dirhem namıyla gösterdiği, başka ölçü ola. Resul-i Ekrem (S.A.V.)'efendimiz hazretlerinin buradaki rivayete nazaran abdest suyu işte bu kadar az miktardadır. Gusül için kullandıkları su da bu rivayete nazaran dörtten beş müdd kadardır ki; o da (4800/7) den (6000/) dirhem eder ki aşağı yukarı (2,120) den (2,650) litreye kadar eder. Irak fukahasının müddu iki rıtl itibar ettiklerine göre ise bu miktar takriben (4,24) den (5,3) litreye kadardır. Müslim'in burada Ebu Bekr b. Ebî Şeybe 'den rivayet ettiği son hadisdeki tefsirinden anlaşılıyorki Ebu Bekr b. Ebi Şeybe Sefine'yi Resulullah (Sallallahu Aleyhi ve Sellem)'in sahabisi olmakla vasıflandırmış; Ali b. Hucr ise bu tavsifi yapmayarak sadece ismini anmakla iktifa etmiştir. Hadisin sonundaki: «Ihtiyarlamişti da ben onun hadisine itimad edemiyordum» cümlesini söyleyen Ebu Reyhane ihtiyarlıyandan maksad da Hz. Sefine'dir. Müslim (Rahimehullah) bu Hadisi ssir hadislere mütabaat için rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 61
			}
		}
	]
}