{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7431,
			"arabicnumber": "2964",
			"text": "Bize Şeybân b. Ferruh rivâycl etti. (Dediki): Rize Hemmam rivayet etti. (Dediki): lîize ishak b. Abdillâh b. Ebî Talha rivayet etti. (Dediki): Bana Abdurrnhman b. Ebî Amr'a rivayet etti. Ona da Ebû Hureyre rivayet etmiş ki, Kendisi Nebi (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken işitmiş: «Benî israil'de biri abraş, biri kel, birî de kör üç kişi varmış. Allah onları imtihan etmek istemiş de, kendilerine bir melek göndermiş. Melek Abraş'a gelerek: Sence en makbul şey nedir? diye sormuş. Abraş : — Güzel renk, güzel cild ve benden insanların iğrendiği halin gitmesidir, demiş. Bunun üzerine melek onu sıvazlamış ve iğrenç hali gitmiş, kendisine güzel bir renk ve güzel bir cild verilmiş. Melek : — Sence hangi mal en makbuldür? diye sormuş. Abraş : — Devedir (yahut; sığırdır, ishak şek etmiş.) demiş —Şu kadar var ki. Abraşla Kel'den biri devedir, demiş, öteki sığırdır demiştir— ve kendisine doğurması yakın bir deve verilmiş. Bunun üzerine Melek : — Allah sana bu devede bereket versin, demiş. Müteakiben Kel'e gelerek : — Sence en makbul şey nedir? diye sormuş Kel : — Güzel saç ve insanların iğrendiği şu halin benden gitmesidir, demiş. Melek onu da sıvazlamış ve o hal gitmiş. Kendisine güzel saç verilmiş. Melek : — Sence hangi mal en makbuldür? diye sormuş. Kel : — Sığırdır, cevâbını vermiş. Hemen kendisine hâmile bir inek verilmiş ve melek : — Allah bu inekte sana bereket versin, demiş. Sonra kör'e gelerek ; — Sence en makbul şey nedir? diye sormuş. Kör : — Allah'ın bana gözümü iade etmesi ve onunla insanları görmemdir, demiş. Melek onu da sıvazlamış ve Allah gözünü ona iade etmîş. — Sence hangi mal en makbuldür? diye sormuş. Kör: — Koyundur, cevâbını vermiş, hemen kendisine doğurmuş bir koyun verilmiş. Derken ötekiler üretmiş. Beriki, de doğurtmuş, bu suretle birinin bir vâdi devesi, diğerinin b'ır vadi sığırı, bunun da bir vadi koyunu olmuş. Sonra melek abraş'a eski suret ve kılığında gelerek : — Ben fakir bîr adamım, yolculuğumda bütün çarelerim inkıta'a uğradı. Bugün evvel Allah sonra senden başka beni (evime) ulaştıracak yoktur. Senden şu güzel rengi, güzel cildi ve malı veren (Allah) aşkına bir deve istiyorum. Yolumda onun üzerinde muradıma ulaşacağım, dedi. Abraş : — Haklar çoktur, mukabelesinde bulunmuş. Bunun üzerine melek ona: — Ben seni tanır gibiyim. Sen insanların iğrendiği abraş değil misin? Hani fakirdin, Allah sana verdi, demiş. Abraş : — Ben bu malı ancak ve ancak büyükten büyüğe (intikal eden) bir miras olarak edindim, cevâbını vermiş. Melek de : — Yalancı isen Allah seni eski haline çevirsin! demiş. Melek kel'e de eski suretinde gelerek, buna söylediğinin mislini söylemiş. O dahi bunun gibi cevap vermiş. Bunun üzerine : — Yalancı isen Allah seni eski haline çevirsin, demiş. Kör'e de eski suret ve kılığında gelerek: Ben yoksul ve yolcu bir adamım. Yolculuğumda bütün çarelerim inkıtaya uğradı. Evvel Allah, sonra senden başka bugün beni (evime) ulaştıracak yoktur. Senden gözünü iade eden (Allah) aşkına bir koyun istiyorum. Onunla yolumda (muradıma) ulaşaccğim, demiş. Kör : — Gerçekten ben kör idim. Allah bana gözümü iade etti. şimdi dilediğini al, dilediğini bırak! Vallahi bu gün Allah için aldığın bir şeyde sana zorluk çıkarmam, demiş. Bunun üzerine melek : — Malın senin olsun. Siz ancak imtihan edildiniz. Senden razı olundu, iki arkadaşın da hışıma uğradı, demiş.»",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 15
			}
		}
	]
}