{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7514,
			"text": "Sonra yürüdük. Nihayet Câbir b. Abdillah'a mescidinde iken vardık. Kendisi bir giysi içinde ona sarınmış namaz kılıyordu. Ben cemâatin arasından adımlayarak onunla kıble arasında oturdum. Ve: Allah sana rahmet buyursun, kaftanın yanı başında iken bir giysi içinde namaz mı kılıyorsun? dedim. Eliyle göğsüme şöyle yaptı, parmaklarının arasını açtı ve onları kavisleşürdi. Diledim ki, yanıma senin gibi bir ahmak girsin, benim nasıl yaptığımı görsün de, o da öyle yapsın. Bize Resûlüllah (sallallahü aleyhi ve sellem) elinde bir İbn Tûb hurması dah olduğu halde şu mescidimize geldi de mescidin kıblesinde bir tükrük gördü. Ve onu dalla sildi. Sonra bize dönerek: kendisinden yüz çevirmesini hanginiz ister?» buyurdu. Biz ürktük. Sonra (tekrar): kendisinden yüz çevirmesini hanginiz ister?» buyurdu. Biz (yine) ürktük. Sonra: kendisinden yüz çevirmesini hanginiz ister?» buyurdu. Biz: Hayır! Hiç birimiz (istemeyiz) ya Resûlüllah! dedik, sîzden biriniz namaz kılmaya kalktığı vakit şüphesiz kir Allah Tebâreke ve Teâlâ'nın kâbesi onun yüzünün olduğu tarafa doğrudur. Binâenaleyh sakın yüzünün olduğu tarafa ve sağına tükürmesin. Sol tarafına, sol ayağının altına tükürsün. Şayet acele bir badire başına gelirse, elbisesiyle şöyle yapsın...» buyurdu. Sonra elbisesini bir bir üzerine katlayarak: bir zâferan gösterin!» dedi. Bunun üzerine mahalleden bir genç kalkarak evine koştu ve avucunda zâferanlı bir koku getirdi. Resûlüllah (sallallahü aleyhi ve sellem) onu alarak dalın ucuna sürdü. Sonra onunla tükürüğün eserini sildi, dedi. ki: Sizin mescidlerinize zâferanlı koku sürmeniz buradan kalmadır. (sallallahü aleyhi ve sellem) ile birlikte Batnı Buvad gazasında yola revan olduk. Kendisi Mecdî b. Amr El-Cüheni'yi arıyordu. Su devesine bizden beş, altı ve yedi kişi nevbetle biniyordu. Derken ensardan bir adamın biniş nevbeti kendi su devesine döndü. Ve onu çöktürerek bindi. Sonra onu sürdü. Ama deve bir parça durakladı. O da ona: Deh! Allah sana lanet etsin! dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): bu devesine lanet eden?» diye sordu. O zât: Ben ya Resûlallah! dedi. onun üzerinden, lanetlenmiş hayvanla bize arkadaşlık etme! Kendinize beddua etmeyin! Çocuklarınıza beddua etmeyin! Mallarınıza beddua etmeyin! Allah'dan bir şey İstenip de, sizin için kabul buyurduğu saata rastlamayın!» dedi. (sallallahü aleyhi ve sellem)’le birlikte yürüdük. Ya zamanı gelip, biz Arab sularından birine yaklaşınca Resûlüllah (sallallahü aleyhi ve sellem): adam bizden önce giderek havzı ıslâh edecek ve su içe? bize su getirecek?» diye sordu. Câbir ki: Ben hemen kalktım İşte bir adam ya Resûlüllah! dedim. Bunun üzerine Resûlüll (sallallahü aleyhi ve sellem): beraber kîm gidecek?» buyurdu. Hemen Cebbar b. Sa kalktı ve kuyuya gittik, havzın içine bir veya iki kova su çektik. Sor onun taşlarını ördük. Sonra onu dolduruncaya kadar su çektik. Yanım: İlk çıkagelen Resûlüllah (sallallahü aleyhi ve sellem) oldu: eder misiniz?»-dedi. Evet. ya Resûlallah! cevâbını verdik. Devesini saldı. O da su içti. Gemini çekti, hayvan bacaklarını araladı ve bevletti. Sonra onu saptırarak çöktürdü. Sonra Resûlüllah (sallallahü aleyhi ve sellem) havra gelerek ond abdest aldı. Bilâhare ben kalktım ve Resûlüllah (sallallahü aleyhi ve sellem) abdest aldığı yerden abdest aldım. Cebbar b. Sahr da kazây-i hacet gitti. Derken Resûlüllah (sallallahü aleyhi ve sellem) namaz kılmak için aga kalktı. Benim üzerimde çizgili bir vardı ki, iki ucu arasına rınmaya kalkıştım. Fakat bana yetişmedi. Giysînin saçakları vardı. Onları ters çevirdim. Sonra iki ucunun arasına sarındım. Sonra onu ovnm futtum. Ve gelerek Resûlüllah (sallallahü aleyhi ve sellem)'in sol taraf durdum. O. pl'Tndpn tnttn vp Vnni döndürerpk sağ tarafına Sol tarafına durdu. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) ikimizin de ellerimizden tutarak bizi itti. Ve arkasında durdurdu. Resûlüllah (sallallahü aleyhi ve sellem)’den hissetmeden Tana atmaya başladı. Sonra maksadını anladım. Eliyle sövle isâret etti. Yi belini bağla demek istiyordu, Resûlüllah (sallallahü aleyhi ve sellem) namazdan çıkınca: Câbir!» dedi. Hazırım ya Resûlallah! dedim. genişse, iki ucunun arasına sarın! Darsa, onu düğme yerine ağlayıver!» buyurdular. (sallallahü aleyhi ve sellem)’le birlikte yürüdük. Bizden her adamın günlük yiyeceği bir kuru hurma idi. Onu emer, sonra elbisesinin içine koyardı. Yaylarımızla yaprak silker de yerdik. Hattâ dudaklarımız yara oldu. Yemin ederim ki, bir gün yanlışlıkla bizden birine hurma verilmedi de (takatsızlığından) onu kaldırmaya gittik ve kendisine hurma verilmediğine şâhîdlik ettik. Hurma verildi, adam kalkarak onu aldı. (sallallahü aleyhi ve sellem)'le beraber yürüdük. Nihâyet geniş bir vadiye indik. Resûlüllah (sallallahü aleyhi ve sellem) kazayı hacetine gitti. Ben de \"bir su kabı ile kendisini tâkib ettim. Derken Resûlüllah (sallallahü aleyhi ve sellem) bakındı, fakat Örtünecek bir şey göremedi. Birden vadinin kenarında iki ağaç gözüne ilişti. Resûlüllah (sallallahü aleyhi ve sellem) hemen bunlardan birine giderek dallarından bir dal tuttu. Ve: izniyle bana râm ol!» buyurdu. Dal ona, sahibine huysuzluk eden burnu gemli deve gibi râm oldu. Öteki ağaca da gitti. Ve dallarından birinden tutarak: izniyle bana ram ol!» dedi. O da öteki gibi râm oldu. İkisinin ortasına varınca aralarını kapadı (yani; bir yere topladı) ve: izniyle benim üzerime kapanın!» dedi. Hemen kapandılar. Câbir ki: Ben Resûlüllah (sallallahü aleyhi ve sellem) yakınında olduğumu hissederse uzaklaşır korkusuyla (oradan) çıkarak koştum. (Muhammed b. Abbâd «Feyebteıde» yerine «Feyetebe'acıe» dedi.) Ve oturdum. İçimden konuşuyordum. Tesadüfen yanıbaşıma baktım. Bir de ne göreyim, Resûlüllah (sallallahü aleyhi ve sellem) geliyor. O İki ağaç da birbirinden ayrılmış ve her biri gövdesinin üzerine doğrulmuştu. Resûlüllah (sallallahü aleyhi ve sellem)’in bir an durduğunu gördüm. Kafasıyla şöyle yaptı. (Ebû İsmail başıyle sağa ve sola işaret etmiştir.) Sonra bana doğru yürüdü, yanıma gelince: Câbir! Benim durduğum yeri gördün mü?» diye sordu. Evet, ya Resûlallah! dedim. ise şu iki ağaca git de, her birinden birer dal kes ve getir. Benim yerimde durduğun vakit, bir dalı sağına, bir dalı da soluna salıver!» dedi. ki: Ben kalkarak bir taş aldım. Ve onu kırdım, keskinledim, benim İçin keskin oldu. Ve iki ağaca giderek her birinden birer dal kestim. Sonra onları sürükleyerek geldim ve Resûlüllah (sallallahü aleyhi ve sellem)'in durduğu yerde durdum. Bir dalı sağıma, bir dalı da soluma bıraktım. Sonra kendisine yetişerek: Yaptım Yâ Resûlüllah! Bu neden lâzım geldi? dedim. azab gören iki kabrin yanından geçtim de, şefaatim sayesinde bu dallar yaş durdukça onlardan azabın hafifletilmesini diledim.» buyurdular ki, müteakiben ordunun yanına geldik. Resûlüllah (sallallahü aleyhi ve sellem): Câbir «Abdest suyu diye seslen!» buyurdu. Ben de: Dikkat! Abdest suyu! Dikkat abdest suyu! Dikkat abdest suyu yok mu? diye seslemdim. Yâ Resûlüllah! Kafilede bir damla (su) bulamadım, dedim. Ensardan bir zât Resûlüllah (sallallahü aleyhi ve sellem) için hurma dalından bir askı üzerinde bulunan eski bir tulumunda su soğuturdu. Resûlüllah (sallallahü aleyhi ve sellem) bana: filân oğlu filâna git de, tulumunda bir sey var mı bak!» dedi. Ona giderek tuluma baktım. Ama içinde tulumun ağzında kalmış bir damladan başka bir şey bulamadım. Onu boşaltacak olsam, tulumun kuru tarafı içerdi. Hemen Resûlüllah (sallallahü aleyhi ve sellem)'e gelerek: Ya Resûlallah! Ben onun içinde tulumun ağzındaki bir damladan başka bir şey bulamadım. Onu boşaltacak olsam tulumun kuru tarafı İçecek, dedim. onu bana getir!» buyurdu. Onu derhal kendisine getirdim. Eliyle aldı. Ve ne olduğunu anlamadığım bir şey konuşmaya başladı. Hem iki eliyle onu sıkıyordu. Sonra onu bana verdi ve: Câbîr! Büyük bir çanak diye seslen!» buyurdu. Ben: Ey kafilenin çanak sahibi, diye seslendim. Hemen onu yüklenip bana getirdiler. Çanağı huzuruna koydum. Bunun üzerine Resûlüllah. (sallallahü aleyhi ve sellem) çanağın içine eliyle şöyle yaptı. Elini yaydı ve parmaklarının arasını ayırdı. Sonra elini çanağın dibine koydu ve: Câbir! Al da üzerime dök ve Bismillah de!» buyurdu. Ben hemen suyu üzerine döktüm ve Bismillah, dedim. Müteakiben suyu Resûlüllah (sallallahü aleyhi ve sellem)’in parmakları arasından kaynarken gördüm. Sonra çanak kaynadı, döndü, nihayet doldu. Bunun üzerine: Câbîr! Suya ihtiyacı olanlara seslen!» uyurdu. Derken cemâat gelerek kanmcaya kadar su İçtiler. Ben: İhtiyacı olan kimse kaldı mı? dedim. Artık Resûlüllah (sallallahü aleyhi ve sellem) dolu olduğu halde çanağın üzerinden elini kaldırdı. Resûlüllah (sallallahü aleyhi ve sellem)’e açlıktan şikâyet ettiler de: ki, Allah sizî doyura!» \"buyurdu. Derken deniz sahiline vardık. Deniz bir dalgalandı ve bir hayvan attı. Biz bu hayvanın yarısı üzerine ateş yaktık, yemek pişirdik. Kızartma yaptık ve doyuncaya kadar yedik. ki: Ben filân ve filân (beş kişi saymış) bu hayvanın göz kemiğinin içine girdik. Bizi kimse göremiyordu. Nihayet çıktık. Ve onun kaburgalarından bir kaburga kemiği alarak eğrilttik. Sonra kafiledeki en büyük adamı, en büyük deveyi ve en büyük örtüyü getirttik. Onun altına girdi de, başını bile eğmedi. Bulûğa yaklaşmış çocuk demektir. Bazıları yemeye başlamış çocuk, bir takımları da beş yaşındaki çocuk mânâsına geldiğini söylemiştir. ikinci rivâyetindeki «Ve ehazte» kelimesi Müslim'in bütün nüshalarında (vav) ile atfedilmişse de, Nevevî bunun hata olduğunu söylemiş, doğrusunun (ev) olacağını bildirmiştir. Çünkü maksad birinin üzerinde iki çizgili kumaştan, diğerinin üzerinde de iki maâ-firi kumaşından elbise bulunmasını temennidir. İki elbisedir. Bazıları bunun iki yeni elbise olduğunu söylemişlerdir. Lügat ulemasından Ebû Ubeyde göre zâferân demektir. Esmai, bunun zâferanla bir araya getirilen muhtelif kokular mânâsına geldiğini söylemiştir. Onun tarifine göre Halûk da aynı mânâya gelir ki, hadsîten murad da budur. Buvâd: Cûheyne dağlarından birisinin ismidir",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}