{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 760,
			"arabicnumber": "334.06",
			"text": "Bana Musa b. Kureyş Et-Temimi rivayet etti. (Dediki): Bize İshak b. Bekir b. Mudar rivayet etti. (Dediki): Bana babam rivayet etti. (Dediki): Bana Ca'fer b. Rabia Irak b. Malik'den, o da Urvetü'bnü Zübeyr'den, o da Nebi (Sallallahu Aleyhi ve Sellem) in zevcesi Aişe'den naklen rivayet etti: Aişe şöyle demiş: Abdurrahman b, Avf'ın nikahı altındaki Cahş kızı Ümmü Habibe Resulullah (Sallallahu aleyhi ve Sellem)'e (istihaza halinde gelen) kan'dan şikayet etti. O'na: \"Daha önce ay halin seni alıkoyduğu kadar bir süre bekle, sonra guslet\" buyurdu. O da her namaz vakti gelince guslederdi. DAVUDOĞLU AÇIKLAMA: Bu hadisi bütün Kütübü - Sitte sahihleri tahric etmişlerdir. Hadis-i şerifte Resulullah (Sallallahu Aleyhi ve Sellem)'e sual sorduğu bildirilen Hz. Ümmü Habîbe Ümmehat-ı Mümininden Zeynep binti Cahş (R.A.)'nın kız kardeşidir. Vakidi ile Harbi isminin Habîbe, künyesinin Ümmü Habîb olduğunu söylemişler, Dare Kutni dahi bunu tercih etmiş isede sahih rivayetlerdeki meşhur künyesi Ümmü Habîbe'dir. İmam Malik'in (El-Muvatta) ında Hz. Abdurrahman b. Avf'ın zevcesi Zeyneb binti Cahş olduğu, istihaze kanını da onun gördüğü rivayet edilmiştir. Bazıları bunun vehmolduğunu, diğer bazıları da vehim değil, doğrusunun bu olduğunu iddia etmişlerdir. Onlara göre bu kadının ismi Zeyneb, künyesi Ümmü Habîbe 'dir. Ümü'l Mü'minin Zeynep (R.A.)'ya gelince Onun asıl isminin Birre olduğunu sonra Resulullah (Sallallahu Aleyhi ve Sellem) onu değiştirerek kız kardeşinin ismini verdiğini söylerler. Çünkü kız kardeşi künyesi ile meşhur olduğuna göre ona Zeyneb demekle bir iltibas vaki olmamıştır. Hz. Ümmü Habibe 'nin Hamne isminde bir kız kardeşi daha vardır. Ulemadan bazıları Ümmü Habibe ile Hamne 'nin ikisininde istihazalı olduğunu diğer bazıları Ümmül-Mü'minin Zeynep (R.A.) nın dahi istihazalı olduğunu söylerler. Resulullah (Sallallahu Aleyhi ve Sellem) zamanında on kadının istihazalı olduğu rivayet edilmiştir. Bunlar, Ümmü Habibe binti Cahş, Ümmü'l Mü'minin Zeynep binti Cahş, diğer kız kardeşi Hamne binti Cahş, Ümmü'l Mü'minin Meymune (R.A.)'nın anne bir kız kardeşi Esma, Fatime bin­ti Ebi Hubeyş, Sehle binti Süheyl, Ümmü'l Mü'minin Sevde binti Zem'a, Zeynep binti Ümmü Seleme, Esma el Harisiyye ve Badiye binti Gaylan'dır. Resulullah (Sallallahu Aleyhi ve Sellem) in Hz. Ümmü Habibe'ye verdiği yıkanma emri mutlaktır. Bunun her namaz için yahut bazan yıkanma ihtimali vardır. Ebu Davud 'un tahric ettiği bir rivayet her namaz için yıkanması lazım geldiğini bildirmektedir. Çünkü o rivayette «Resulullah (Sallallahu Aleyhi ve Sellem) Ona her namaz için yıkanmayı emretti» denilmiştir. Beyhaki bu rivayetin yanlış olduğunu söylemiştir. Müslim'in buradaki rivayetinde Resulullah (Sallallahu Aleyhi ve Sellem) in her namaz için yıkanmayı emretmediği Hz. Ümmü Habibe'nin kendiliğinden yıkandığı bildirliyor. Bu hususta rivayetler muhteliftir. Bazılarında Nebi (Sallallahu Aleyhi ve Sellem)'in Ümmül Mü'minin Zeynep Binti Cahş'a: «Her namaz için yıkan.» diye buyurduğu, diğer bazılarında : «Her namaz için abdest al.» dediği bildiriliyor. Hatta Muslîm'in Hammad b. Zeyd 'den rivayet ettiği hadiste, Hammad yalnız başına rivayet etmiştir diye kitabına almadığı cümle dahi bazılarınca budur. Mezkur cümleyi yalnız Hammad değil Ebu Avane ve başkaları dahi rivayet etmişlerdir. Bununla beraber onu yalnız Hammad rivayet etmiş olsa bile kabul edilmesi lazım gelir. Çünkü Hammad mütemed bir ravidir. Mutemed ravinin ziyadesi ise makbuldür. Bazıları bu hadisin Fatime binti Ebi Hubeyş hadisi ile nesh edildiğini söylerler. Çünkü Hz. Aişe, Nebi (Sallallahu Aleyhi ve Sellem) in vefatından sonra Fatime hadisiyle fetva vermiş, bu suretle Ümmü Habîbe hadisine muhalefette bulunmuştur. Bundan dolayı Ebu Muhammed el îşbîlî; «Fatime hadisi istihaza hakkında rivayet edilen en sahih hadistir.» demiştir. Az yukarıda İmam Şafii 'den naklen onun da; «Ümmü Habibe'nin her namaz için yıkanması Resulullah (Sallallahu Aleyhi ve Sellem) in emri ile değil kendi fiilidir.» dediğini söylemiştik. Cumhur'u Ulemanın kavli de budur. Yani istihazalı bir kadına her namaz için yıkanmak vacip değildir. Hattabi (319 - 388); «Bu haber muhtasar» dır. Onda kadının hal-u şanı beyan edilmemiştir. Her istihzalı kadına her namaz için yıkanmak vacib değildir. Yıkanmak ancak müptela kadına vaciptir. Müptela: Gelen kanın hayz'mı istihaza mı olduğunu ayıramıyan yahut gününü, vaktini ve sayısını unutan kadındır. Böylesi hiçbir namazını terk edemediği gibi her namaz için yıkanması da vacibtir, diyor. Ebu Bekr b. Abdirrahman'ın; «Allah rahmet eylesin» diyerek zikrettiği Hind'in onun zevcesimi yoksa akrabasımı olduğuna dair hiçbir yerde bir malumata tesadüf edilememiştir. İbni Hacer'in «El-İsabe» adlı eserinin sonunda bir Hind'den bahsedilmiş fakat kim olduğu beyan edilmemiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 82
			}
		}
	]
}