{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 767,
			"arabicnumber": "337",
			"text": "Bize İshak b. İbrahim El-Hanzali rivayet etti. (Dediki): Bize Muse'I Kaari haber verdi. (Dediki), bize Zaide A'meş'den, o da Salim b. Ebil Ca'd'dan o da Kureyb'den, o da İbn Abbas'tan, o Meymune'den Nebi (Sallallahu aleyhi ve Sellem}'e su (hazırlayıp) koydum sonra onu örttüm O da yıkandı, dedi. Diğer tahric: Buhari, 260, 249, 257 -buna yakın muhtasar olarak-, 259 -buna yakın-, 265 -buna yakın muhtasar olarak-, 266 -buna yakın-, 274 -buna yakın-, 276, 281 -muhtasar olarak buna yakın-; Müs!im, 765 -muhtasar olarak-; Ebu Davud, 245 -uzunca-; Tırmizi, 103 -buna yakın muhtasar olarak-; Nesai, 253, 416 -buna yakın muhtasar olarak-, 417, 406 -muhtasar olarak-; İbn Mace, 467 -muhtasar olarak- (762 - 765) NEVEVİ ŞERHİ: (762) \"Ebu'n-Nadr'dan rivayete göre Ümmü Hani'nin azatlısı Ebu Murre\" denilmekte iken diğer rivayette (763) \"Akil'in azatlısı Ebu Murre\" denilmektedir. Ebu'n-Nadr'ın adı Salim b. Ebu Umeyye el-Kuraşi et-Teymi el-Medeni' dir. Ömer b. Abdullah et-Teymi'nin azatlısıdır. Ebu Murre'nin adı ise Yezid olup, Ümmü Hani'nin azatlısıdır. Ümmü Hani'nin kardeşi Akil ile birlikte bulunurdu. Bundan dolayı diğer rivayette onun mevlası (azatlısı) olduğunu ifade etmiştir. Ümmü Hani'nin adı ise Fahite'dir. Fatıma olduğu, Hind olduğu da söylenmiştir. Oğlu Hani b. Hubeyre b. Amr'ın adı ile künyelenmiştir. \"Hani\"nin sonunda hemze vardır. Ümmü Hani (r.a.) Mekke fethedildiği günü Müslüman olmuştur. \"Mekke'nin fethedildiği sene Resulullah (Sallallahu aleyhi ve Sellem)'in yanına gittim ... \" Bu buyrukta bir erkeğin kendisi ile arasında bir elbise, örtü ve buna benzer bir engel bulunması şartıyla mahremi olan bir kadının huzurunda yıkanmasının caiz olduğuna delil vardır. (763) \"Sonra sekiz rekat kuşluk namazı kıldı.\" Bu lafız oldukça incelikli bir hususu ihtiva etmektedir. O da kuşluk namazının sekiz rekat olduğudur. \"Kuşluk namazı\" demiş olması da buna delildir. Ayrıca bu ifade bunun bilinen ve karar kılmış bir sünnet olduğunu da Allah Resulünün bu namazı kuşluk namazı niyetiyle kıldığını da açıkça ifade etmektedir. Halbuki diğer rivayet (764) böyle değildir. Orada \"sekiz rekat namaz kıldı, o zaman kuşluk vakti idi\" demiştir. Buradan da birtakım kimseler doğru olmayan bir sonuca ulaşmakta ve: Bunda kuşluk namazının sekiz rekat olduğuna delil yoktur, diyerek Nebi (s.a.v.)'in bu vakitte kuşluk vakti olduğu için değil, Mekke'nin fethedilmesi sebebiyle sekiz rekat namaz kıldığını ileri sürmektedirler. Bu lafza dayanarak bu kanaati ileri süren bir kimse Ümmü Hani'nin: \"Kuşluk namazı\" ifadesinden hareketle bu sonucu çıkartamaz. İnsanlar da önceleri de, sonraları da bu hadisi kuşluk namazının sekiz rekat olduğuna delil gösterip durmuşlardır. Allah en iyi bilendir. (Hadisteki lafzıyla) \"subha\" nafile namaz demektir. Bu namazdaki tesbih (subhanallah) demek sebebiyle ona bu isim verilmiştir. (764) \"Sekiz rekat (secde) kıldı\" sözünden maksat sekiz rekat kıldığıdır. Rekata secde adının verilmesi secdeyi de kapsaması dolayısıyladır. Bu bir şeye onun bir kısmını teşkil eden şeyin adının verilmesi (tesniyetu'ş-şey'i bi cüz'ih) türündendir. DAVUDOĞLU AÇIKLAMA: Bu hadis de yukarıdakiler gibi yıkanırken başkalarının göremiyeceği şekilde kapalı bir yerde bulunmanın vücubuna delalet eder. Bir kimsenin zaruret olmadıkça başkasına avret yerlerini göstermesi caiz olmadığı gibi yine zaruret olmadıkça başkasının avret yerine bakması da caiz değildir. İbni Battal'ın da naklettiği vecihle peştemalsız hamama giren kimsenin şehadeti kabul edilmiyeceğine Fetva imamlarının ittifakı vardır. İmam A'zam (80-150), Malik (93-179), Şafii (150-204) ve Süfyanı Sevri 'nin kavilleri budur. Hatta hamamda yıkanacağı havuza girerken peştemalını atarak avreti görünen kimsenin şehadeti dahi İmam Malikle Şafii'ye göre sakıttır. İmam A'zam'la Sevri bu kadarını özür saymışlardır. Çünkü bundan korunmak imkansızdır. Ulema karı kocanın birbirlerinin avretlerini görebileceklerine ittifak etmişlerdir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 89
			}
		}
	]
}