{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 770,
			"arabicnumber": "339",
			"text": "Bize Muhammed b. Rafi rivayet etti. (Dediki): Bize Abdürrezzak rivayet etti. (Dediki): Bize Ma'mer, Hammam b. Münebbih'den rivayet etti. Hemmam bize Ebu Hureyre'nin Resulullah Muhammed (Sallallahu Aleyhi ve Sellem) den rivayeti şudur, diyerek çeşitli hadisler zikretti. Onlardan birisi de şudur: Resulullah (Sallallahu aleyhi ve Sellem) buyurdu ki: \"İsrailoğulları çıplak olarak yıkanırlar, biri diğerinin avretine bakardı. Musa (aleyhisselam) ise tek başına yıkanırdı. Bu sebeple (kendi aralarında): Allah'a yemin olsun ki Musa'yı bizimle birlikte yıkanmaktan alıkoyan husus onun hayalarının büyük olmasından (kasık fıtığı) başka bir sebebi yoktur, dediler. Bir defa Musa yıkanmaya gitmiş, elbiselerini bir taşın üzerine koymuştu. Taş elbisesi ile kaçıp gitti. Bunun üzerine Musa arkasından hızlıca koşarak: Ey taş elbisem, ey taş elbisem, demeye koyuldu. Sonunda İsrailoğulları Musa'nın avretini görünce, Allah'a yemin olsun ki Musa'nın herhangi bir hastalığı yoktur, dediler. Taş durdu ve o İsrailoğulları tarafından görüldü, sonra Musa elbisesini alıp taşa vurmaya başladı. \" Ebu Hureyre: Allah'a yemin olsun ki Musa'nın taşa vurması sebebiyle taşta altı ya da yedi tane iz kaldı, dedi. Diğer tahric: Buhari, 278; Müslim, 6098; Tuhfetu'l-Eşraf, 14708 DAVUDOĞLU AÇIKLAMASI AŞAĞIDA NEVEVİ ŞERHİ: Bu babta Musa (aleyhisselam)'ın kıssası yer almaktadır. Bundan önceki babta da kimsenin olmadığı bir yerde ihtiyaç halinde avretin açılmasının caiz olduğunu ifade etmiştik. Bu da yıkanmak, küçük abdest bozmak, zevcesi ile birlikte olmak ve buna benzer hallerdir. Bütün bu hallerde kimse yokken açılmak caizdir. İnsanların huzurunda ise bütün bu hallerde avreti açmak haramdır. İlim adamları der ki: Yalnızken yıkanmak esnasında peştamal ve benzeri bir şeyle örtünmek, üstünü açık bırakmaktan daha faziletlidir ama yıkanmak ve benzeri hallerde gereken süre kadar açık durmak caizdir. İhtiyaçtan fazla açık kalmak daha sahih kabul edilen görüşe göre haramdır. Nitekim bundan önceki babta belirttiğimiz üzere daha sahih olan görüşe göre yalnızken avretin örtülmesi vaciptir. İhtiyaç kadarını açmak müstesna. Allah en iyi bilendir. Bu hadisin hükme delaleti ise, Musa (aleyhisselam)'ın yalnız başına iken çıplak yıkanmış olduğudur. Bu da fıkıh usulü alimleri arasında bizden öncekilerin şeriatı bizim için de şeraittir diyenlerin görüşlerine uygun olarak delil olabilir. Allah en iyi bilendir. Nebi (Sallallahu aleyhi ve Sellem)'in: \"İsrailoğulları çıplak yıkanırlardı. Birbirlerinin avretlerine bakarlardı\" ibaresinin bunun onların şeriatlarında caiz olmakla birlikte Musa (aleyhisselam)'ın böyle bir halden kaçınmak maksadıyla ve bundan uzak durmak müstehap olduğu için,ayrıca haya ve edebinden bunu yapmaması ihtimali de vardır (4/32). Bizim şeriatımızda haram olduğu gibi, onların şeriatında da bu şeklin haram olma, bununla birlikte -bizim şeriatımıza iman edenlerin pek çoğunun bu hususta işi gevşek tuttukları gibi- onların da bu hususta gevşek davrandıkları ihtimali de vardır. (Kötülük anlamına gelen \"es-su\"'den türeyen) es-sev'e kelimesi avret demektir. Ona bu adın veriliş sebebi açılmasının kişiyi üzmesinden, hoşuna gitmemesinden dolayıdır. Allah en iyi bilendir. Hadiste geçen \"ader\" lafzını dilbilginleri hayaları iri, şişkin (fıtık) olarak açıklamışlardır. \"Musa (aleyhisselam) taş'ın arkasından hızlıca koştu.\" Cemaha: Oldukça hızlı koşmak demektir. \"Taşa vurmaya koyuldu.\" Yani Musa arka arkaya taşa vurup durdu. Musa'nın (aleyhisselam) taşa vurmak suretiyle taşta iz bırakarak kavmine bir mucize göstermek istemiş olması da mümkündür, mucize göstermesi için taşa vurmasının ona vahiy ile emredilmiş olma ihtimali de vardır. Allah en iyi bilendir. Ebu Hureyre'nin ifadesindeki \"taşta nedeb vardır\" sözü taşta iz vardır, iz kalmıştır demektir. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Kaadi İyad'ın beyanına göre Beni İsrail'in çıplak yıkanarak birbirlerinin avret yerlerine bakmaları Hz. Musa'ya ve onun şer'iatına muhalefet içindir. Bu hadisin bizim için delil teşkil etmesi şer'atımızdan önce geçen seri'atların bizim içinde şeri'at olması esasına istinad eder. Mesele ihtilaflıdır. Esah olan kavle göre bizden önce geçen şeriatlar Allah veya Resulü tarafından red ve inkar edilmemek şartıyla bize hikaye edilirse bizim için de seri'attırlar. Beni İsrail: İsrail oğulları demektir. İsrail, Yakup (A.S.)'ın ismidir. Yakup (A.S.) İshak'ın, İshak'da Halilullah ibrahim (A.S.)'ın oğludur. Beni İsrail Yakup (A.S.)'ın oniki oğlundan türemiş ve üremişlerdir. A'der: Fıtıklı ve poluç demektir. Musa (A.S.)'ın taş’a hitab ederek, (Elbisemi ver ey taş) demesi taş elbisesini kaçırdığı için ona akıllılar muamelesi yaptığındandır. Taş elbisesini vermeyince onu dövmesi de bundandır. Ulemadan bazıları «Hz. Musa'nm taşı dövmesi, onda iz bırakarak mucize göstermek içindir. Bunun vahiy suretiyle yapılmış olması da muhtemeldir. Taşın beni İsrail'e doğru yuvarlanarak elbiseyi götürmesi Musa (A.S.)'ın ikinci bir mucizesidir.» diyorlar. Ebu Hureyre r.a.’ın taşta altı veya yedi darbe izi bulunduğunu yeminle ifade ettiğini söyleyen zat bazılarına göre Ravi Hemmam'dır. Fakat Kirmani bu söz doğrudan doğruya Ebu Hureyre'nin olduğuna kaildir Hemmam'ın sözü olarak kabul edildiğine göre bu söz müsneddir. Ebu Hureyre'nin sözü olduğuna göre ise mürseldir. Fakat her iki takdire gorede Hadis Merfu hükmündedir. Çünkü Ebu Hureyre (R.A.) Hazretlerinin böyle bir sözü kendiliğinden söylemesine imkan yoktur. Onu mutlaka ResulülIah (Sallallahu Aleyhi ve Sellem)’den duymuştur",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 92
			}
		}
	]
}