{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 772,
			"arabicnumber": "340.02",
			"text": "Bize Züheyr b. Harb'da rivayet etti. (Dediki): Bize Ravh. Ubade rivayet etti. (Dediki): Bize Zekeriyya b. İshak rivayet etti. (Dediki): Bize Amr b. Dînar rivayet etti. Dedi ki; Cabir b. Abdullah'ı şöyle tahdis ederken dinledim: Resulullah (Sallallahu aleyhi ve Sellem) üzerinde izarı bulunduğu halde onlarla birlikte Ka'be için taş taşıyordu. Amcası Abbas ona: Kardeşimin oğlu izarını çözüp de onu omuzuna, taşların altına koysan (iyi olur), dedi. Bunun üzerine Allah Resulü de izarını çözüp, onu omuzuna koyunca bayılıp yere düştü. O günden sonra bir daha çıplak görülmedL Diğer tahric: Buhari, 364; Tuhfetu'l-Eşraf, 2519 Ahmed Davudoğlu AÇIKLAMASI: Bu hadis-i Buharı «Kitabü's - Salat» ile «Bünyanü'l Kabe» de tahric etmiştir. İbni Battal ile İbni Tîn'in beyanlarına göre Kureyş Kabe'yi bina ederken Resulullah (Sallallahu Aleyhi ve Sellem) in yaşı onbeş idi. Hişam; «Kabe'nin bina edilmesi ile Resulullah (Sallallahu Aleyhi ve Sellem) in Nebi olarak gönderilmesi arasında beş senelik bir müddet vardır, demiştir. Bir rivayete göre Kabe Resullah (Sallallahu Aleyhi ve Sellem) doğumundan 36 sene sonra bina edilmiştir. Beyhaki; «Kabe'nin bina edilmesi, Peygamber (Sallallahu Aleyhi ve Sellem) in Hatice (R.A.) ile evlenmesinden öncedir» diyor. Meşhur kavle göre Kureyş Kabe'yi Hz. Hatice 'nin evlenmesinden 10 sene sonra bina etmiştir. Şu halde Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) in o zaman yaşı: 35 olur. Nitekim Muhammed b. İshak'ın kavli de budur. İbni İshak'ın beyanına göre Resulullah (Sallallahu Aleyhi ve Sellem) küçüklüğünde görüp geçirdiği ve Allah'ın kendisini muhafaza buyurduğu bazı şeyleri hikaye ederken şöyle demiştir. «Kendimin Kureyş çocuklarının arasında bulunduğumu hatırlarım.. Birbirimize oynamak için taş taşırdık, hepimiz soyunmuş, esvabını boynuna asmış, üzerlerinde taş taşıyorduk, ben de onlarla beraber aynı halde gidip geliyordum. Birden bana birisi bir tokat vurdu, kim olduğunu göremedim. Yalnız canımı yakan bir tokat olduğunu hatırlıyorum. Sonra bana (elbiseni kuşan) dedi, ben de elbisemi alarak kuşandım ve taşları elbisemi kuşanmış olarak arkadaşlarımın arasında ensemde taşımaya başladım.» Süheyli: « İbni İshak'in bu hadisi sahih ise vak'anın iki defa cereyan ettiğine hamledilir. Biri küçüklüğünde biride Kabe yapılırken vuk'u bulmuştur.» diyor. Buhari ile Müslîm'in tahric etmedikleri bir rivayette Resulullah (Sallallahu Aleyhi ve Sellem)'e bir melek inerek esvabını bağladığı bildiriliyor",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 94
			}
		}
	]
}