{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 772,
			"arabicnumber": "340.02",
			"text": "(Bize Züheyr b. Harb'da rivâyet etti. ki): Bize Ravh b. Ubâde rivâyet etti. ki): Bize Zekeriyyâ b. İshâk rivâyet etti. ki): Bize Amr b. Dînâr rivâyet etti. Dedi ki; Câbir b. Abidillah'ı şöyle rivâyet ederken işittim Resûlüllah (sallallahü aleyhi ve sellem) Kureyş'le birlikte Kabe'ye taş taşıyormuş. Üzerinde de esvabı varmış. Amcası Abbâs ona: kardeşim oğlu esvabını çözsen de onu omuzuna taşların altına koysana, demiş. diyor ki: Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) onu çözerek omuzunun üzerine koydu. Fakat hemen bayılarak düştü. Artık o günden sonra bir daha çıplak olarak görülmedi. hadis-i Buhârî «Kitâbü's - Salât» ile «Bünyânü'l Kabe» de tahric etmiştir. Vak'a Resûlüllah (sallallahü aleyhi ve sellem)’in çocukluğunda geçmiştir. İbn Battal ile İbn Tîn'in beyanlarına göre Kureyş Kâbe'yi bina ederken Resûlüllah (sallallahü aleyhi ve sellem)’in yaşı onbeş idi. Hişâm; «Kabe'nin bina edilmesi ile Resûlüllah (sallallahü aleyhi ve sellem)’in Peygamber olarak gönderilmesi arasında beş senelik bir müddet vardır, demiştir. Bir rivâyete göre Kabe Resûlüllah (sallallahü aleyhi ve sellem) doğumundan 36 sene sonra bina edilmiştir. Beyhâki; «Kabe'nin bina edilmesi, Peygamber (sallallahü aleyhi ve sellem)’in Hatice (radıyallahü anha) ile evlenmesinden öncedir» diyor. Meşhur kavle göre Kureyş Kabe'yi Hazret-i Hatice'nin evlenmesinden 10 sene sonra bina etmiştir. Şu halde Resûl-i Ekrem (sallallahü aleyhi ve sellem)’in o zaman yaşı 35 olur. Nitekim Muhammed b. İshak'ın kavli de budur. İbn İshâk'ın beyânına göre Resûlüllah (sallallahü aleyhi ve sellem) küçüklüğünde görüp geçirdiği ve Allah'ın kendisini muhafaza buyurduğu bazı şeyleri hikâye ederken Şöyle deditir. Kureyş çocuklarının arasında bulunduğumu hatırlarım.. Birbirimize oynamak için taş taşırdık, hepimiz soyunmuş, esvabını boynuna asınış, üzerlerinde taş taşıyorduk, ben de onlarla beraber aynı halde gidip geliyordum. Birden bana birisi bir tokat vurdu, kim olduğunu göremedim. Yalnız canımı yakan bir tokat olduğunu hatırlıyorum. Sonra bana (elbiseni kuşan) dedi, ben de elbisemi alarak kuşandım ve taşları elbisemi kuşanmış olarak arkadaşlarımın arasında ensemde taşımaya başladım.» « İbn İshak'ın bu hadisi sahihse vak'anın iki defa cereyan ettiğine hamledilir. Biri küçüklüğünde biride Kabe yapılırken vuk'u bulmuştur.» diyor. Buhârî ile Müslîm'in tahric etmedikleri bir rivâyette Resûlüllah (sallallahü aleyhi ve sellem)’e bir melek inerek esvabını bağladığı bildiriliyor. (sallallahü aleyhi ve sellem)’in düşüp bayılmasına sebep avret mahallinin açılmasıdır. Bu vak'adan sonra kendileri hiç bir zaman açık saçık görülmemişlerdir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 94
			}
		}
	]
}