{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 803,
			"arabicnumber": "360.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Muâviye b. Amr rivâyet etti. (Dedi (ki): Bize Zaide, Simâk'tan rivâyet etti. H. Kâsım b. Zekeriya'da rivâyet etti. ki): Bize Ubeydullah b. Mûsa şeyban'dan, o da Osman b. Abdillah b. Mevheb ile Eş'as b. Ebi'ş-Şa'sa'dan naklen rivâyet etti. Bunların her biri Ca'fer b. Ebi Sevr'den, o da Câbir b. Semura'dan, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen Ebû Kamil'in Ebû Avâne'den rivâyet ettiği hadis gibi rivâyette bulunmuşlar. hadis deve eti yemenin abdesti bozacağını bildiriyor. Ulemâ bu hususta da ihtilâf etmişlerdir. Başta Hulefa-i Râşid'în Ebû Bekr, Ömer, Osman ve Ali (radıyallahü Anhûm) olmak üzere Abdullah b. Mes'ud, Übey b. Ka'b, Abdullah İbn Abbâs, Ebû'd-Derdâ, Ebû Talhâ, Amir b. Rabia ve Ebû Ümame (radıyallahü anhûm) ile Cumhûru tabiin, Ebû Hanîfe, Malik, Şafiî ve bu mezheplerin ulemâsı deve eti yemenin abdesti bozmadığına kail olmuşlardır. Ahmed b. Hanbel ile İshâk b. Râhuye, Yâhyâ b. Yahya, Ebû Bekr İbn'l-Münzir İbn Huzeyme ve Ebû Bekr Beyhakî'ye göre deve eti abdesti bozar. Bu kavil mutlak surette hadis ulamasından ve bir kısım Sahabe-i Kiramdan rivâyet olunur. bozulduğuna kail olanlar, Bâbımızın hadisîyle istidlal ederler. Berâ b. Azîb (radıyallahü anh)'dan rivâyet olunan bir hadiste Peygamber (sallallahü aleyhi ve sellem)’e deve eti yemenin abdesti bozup bozmadığı sorulduğunda, abdest almayı emir buyurduğu bildiriliyor. İmâm Ahmed'le İshak b. Rahuye bu bâbda biri Câbir diğeri Berâ (radıyallahu anhüma) dan olmak üzere iki sahih hadis bulunduğunu söylemişlerdir. İmâm Nevevî (631 -676) bu mezhebin delilini daha kuvvetli buluyor. ulemâ bu hadise Hazret-i Câbir hadisiyle cevap vermişlerdir. Yukarıda da gördüğümüz vecihle Câbir (radıyallahü anh) hadisinde: «Resûlüllah (sallallahü aleyhi ve sellem)’in son icraatı ateşte pişen bir şeyden abdest almamaktı» denilmiştir. ağıllarında namaz kılmak bilittifak mubahtır. Deve ireklerinde namaz kılmaz ise kerahet-i tenzihiye ile mekruhtur. Buradaki kerahatin sebebi ihtilaflıdır. Bazıları koyun ağılından daha pis koktuğu için mekruh olduğunu söylerler. Zira koyun ve deve sidiklerinin necis veya temiz olması hususundaki ihtilâf müsavidir. Yani birinin necaset veya tahareti diğerininkine tercih edilmiş değildir. İmâm Malik her iki cins hayvanın bevillerinin temiz olduğuna, İmâm-ı A'zam Ebû Hanife ile İmâm Şafiî ise her ikisinin necis olduğuna kaildirler. Bazıları «buradaki nehyin deve ireklerine kazâ-i hacet için oturulmasıdır» derler. Bir takınılanda develer ürkerek namaz kılan kimseyi korkutacağı veya meşgul edeceği için orada namaz kılmanın men edildiğini söylemişlerdir, Kâtip buradaki nehyi mûtad olan deve ireklerine tahsis etmiştir. Ona göre geceleyin develerin yanında yatan bir kimsenin onların yanında namaz kılması mekruh değildir. Çünkü, Peygamber (sallallahü aleyhi ve sellem) seferde devesine karşı durarak namaz kılmıştır",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 124
			}
		}
	]
}