{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 824,
			"arabicnumber": "371",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Yahya yani İbn Saîd rivâyet etti. ki: Bize Humeyd rivâyet etti. H. Ebû Bekr b. Ebi Şeybe de rivâyet etti lâfız onundur. ki): Bize İsmail b. Uleyye, Humeyd-i Tavil'den, o da Ebû Rafi'den, O da Ebû Hüreyre'den naklen rivâyet etti ki Ebû Hüreyre cünüp olarak Medine yollarından birinde Peygamber (sallallahü aleyhi ve sellem)'e rastlamış ve hemen sıvışarak gitmiş, yıkanmış, Peygamber (sallallahü aleyhi ve sellem) onu araştırmış, Ebû Hüreyre geldiği zaman: kaldın ya Eba Hüreyre?» diye sormuş. Ebû Hüreyre: Resûlüllah bana cünüp halimde tesadüf ettin. Ben de yıkanmadikça senin yanında oturmayı doğru bulmadım; demiş. Bunun üzerine (sallallahü aleyhi ve sellem): Mü'min necis olmaz.» buyurmuşlar. Hadîsi Buhârî «Kitâbü'l - Gusl» ün bir iki yerinde tahrîc ettiği gibi Ebû Dâvûd, Tirmîzî, Nesâî, ve İbn Mâce dahi muhtelif râvilerden tahrîc etmişlerdir. Şerifteki yani (Sıvıştı) kelimesi biri bu olmak üzere dokuz şekilde rivâyet edilmiştir. Bu rivâyetlerin bazılarıda denilmiştir. Mezkûr kelimeler (Geriledim, Çekildim) ve (Döndüm) mânâlarına gelirler. Bâzı rivâyetlerde yani (Koştum) diğerlerinde yani (Kendimi necis itikad ettim), bir rivâyette yani (Şitab ettim), diğer rivâyette yani (Kendimi noksan buldum), başka bir rivâyette, yani (Kendimi Resûlüllah (sallallahü aleyhi ve sellem) ile birlikte yürümekten men ettim), diğer bir rivâyettede yani (Sıvıştım) denilmiştir. kelimesi evvelce de arz ettiğimiz gibi taaccüb ve hayret makamında kullanılır. Bu kelime mahzûf bir fi'lin mef'ulüdür. «Seni tenzih için tesbih ettim yâ Rabbî!..» takdirindedir. Daha başka takdirlerde yapılmıştır. Hattâ bazıları Sübhânallah»m mânâsı: «Tâat hususunda Allah'a koşarım» demektir. Mütâlâasında bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 145
			}
		}
	]
}