{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 832,
			"arabicnumber": "375.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Züheyr b. Harb'da rivâyet ettiler. Dediler ki: Bize İsmail -ki İbn Uleyye'dir - Abdulaziz'den bu isnadla rivâyet etti ve Resûlüllah (sallallahü aleyhi ve sellem)'in: ve Habâisden Allah'a sığınırım.» dediğini söyledi. hadîsi Buhârî «Kitâbü'l - Vudû» ile «Kitâbü'd - Deavât» da Ebû Dâvûd, Tirmîzi, Nesâî ve İbn Mâce «Kitâbü't - Tahâre» de tahric etmişlerdir. (319-388)'nin beyânına göre; hubs, habisin cem'i, habâis ise habîsenin cem'idir. Bu iki kelimeden murad Şeytanların erkek ve dişileridir. Yani Peygamber (sallallahü aleyhi ve sellem) helaya girerken erkek ve dişi şeytanlardan Allah'a sığmırmış. umumiyetle hadîs ulemasının bu kelimeyi «Hubs» şeklinde «ba»nın sükûnu ile telâffuz ettiklerini, fakat bunun hata olduğunu, kelimenin doğru olarak Hubus şeklinde okunacağını söylemiş ve sözlerine şunu ilâve etmiştir. Çünkü şeytanlar helalarda bulunurlar. Helalar Allah'ın zikredilmediği yerlerdir. Bu sebeple Resûl-ü Ekrem (sallallahü aleyhi ve sellem) şeytanlardan korunmak için evvelâ Allah'a sığmırmış. Fakat Hattabî'nin hata iddiası doğru değildir. Çünkü tahfif için sakin okumak caizdir. Kelime burada olduğu gibi başka yerlerde de hubs şeklinde bâ'nın sükûnu ile rivâyet edilmiştir. Ulemâdan Ebî Ubeyd Kâsım b. Sellâm, Fârâbi ve Fârisî gibi zevat mezkûr kelimenin bu şekilde okunduğunu rivâyet etmişlerdir. Meşhur olan rivâyetide budur. Yalnız bazıları kelimenin mastarının da aynı şekilde gelmesine bakarak birbirlerine karışmasınlar diye bunun hubus okumanın evlâ olacağı söylenebilir, demişlerdir. Bazıları Huhs'dan murad küfür, Habâîs'de şeytanlardır, demişlerdir. İbn Battal (-444)'a göre hubus kelimesi bilumum kötülüklere şamil bir kelimedir. «Hubs» şeklinde okunursa pislik mânâsına masdardır. Bazan da isim olarak kulanılır. Habâis'den murad ona göre de şeytanlardır. Bu kelime hakkında İbnül-A'rabî şu tafsilâtı verir «Arap lisanında» Hubs'un aslı kerih görülen şey mânâsına gelir. Bu kelime söz hakında kullanılırsa sövmek, dinler hakkında kullanılırsa küfür, yemekler hakkında haram, içilen şeyler hakkında zararlı, mânâlarına gelir. Bazıları «Hubs» iyi ve makbul olmayan fiil yani kötülük, Habâis ise; bilcümle kötü fiiller ve çirkin huylar mânâsına gelir demişlerdir. Hela ve mirhâd, aynı manâya gelen sözlerdir. Bunlardan murad bizim de hela dediğimiz ayak yoludur",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 153
			}
		}
	]
}