{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 842,
			"arabicnumber": "379",
			"text": "Bana Ebû Gassân el-Mismaî, Mâlik b. Abdilvâhid ile İshak b. İbrahim rivâyet ettiler. Ebû Gassan; Bize Muâz rivâyet etti, dedi. İshak ise; Bize Sahib-i Destevâi Muâz b. Hişâm haber verdi, dedi. Muâz Dedi ki; Bana babam Amir b. Ahval'den, o da Mekhûl'den, o da Abdullah b. Muhayrîz'den, o da Ebû Mahzûra'dan naklen rivâyet etti ki: Nebiyyullah (sallallahü aleyhi ve sellem) kendisine şu ezam öğretmiş: Allâhü ekber herşeyden büyüktür. Allah herşeyden büyüktür. en lâilâhe illallah, Eşhedü en lâilâhe illallah Allah'dan başka ilâh olmadığına şahadet ederim. Allah'dan başka ilâh olmadığına şahadet ederim. Muhammeden Resûlüllah, Eşhedüenne Muhammeden Resûlüllah Muhammed'in Resûlüllah olduğuna, şahadet ederim. Resûlüllah olduğuna şahadet ederim» sonra dönerek yine şöyle dedi: Allah'dan başka ilâh olmadığına şahadet ederim. Allah'dan başka ilâh olmadığına şahadet ederim. Muhammed'in Resûlüllah olduğuna şahadet ederim, Muhammed'in Resûlüllah olduğuna şahadet »derim, (sonra iki defa): namaza» Hayye ale’s-salâh iki defa da: Felaha» Hayye ale’l-felâh (demiş) Allâhü ekber illâllah «Allah herşeyden büyüktür, Allah herşeyden büyüktür. Allah'dan başka ilâh yoktur» cümlelerini de ziyade etti. Hadîs Müslim'in ekseri esas nüshalarında böyledir. Yani ezanın başında iki defa tekbir getirileceğini gösterir. Fakat Müslim'den başka hadis İmâmları rivâyetlerinde ezanın başında dört defa tekbir alınacağı zikredilmiştir. Kâdî Iyâd, Sahîh-i Müslim'in Fârisî tarîklarından bazılarında tekbirin dört defa getirileceği zikredildiğini söyler. Aynı ihtilâf Abdullah b. Zeyd hadîsinde dahi mevcuttur. Meşhur olan rivâyete göre ezanın başındaki tekbirler dörttür. Mezheb imanlarından Ebû Hanîfe, Şafiî ve Ahmed b. Hanbel ile cumhûru ulemânın mezhebleri budur. İmâm Mâlik iki defa tekbîr alınacağına kail olmuş ve bu hadîsle istidlal etmiştir. Mâli k'in bir delili de: amelidir. Onlar Hazret-i İmâma göre sünneti daha iyi bilirler. Cumhûru ulemâ «mu'temed râvinin ziyâdesi makbuldür» diyerek dört tekbire kail olmuşlardır. Bir delilleri de: dört tekbîr almasıdır. Mekke-i Mükerreme gerek hac mevsiminde gerekse şâir zamanlarda müslümanların toplandığı yerdir. Onların bu fiilini inkâr eden bulunmamıştır. şerif ezanda tercîa kaail olan İmâm Mâlik, Şafiî'e Ahmed b. Hanbel (rahimehümüllah) ile diğer ulemânın de-allerindendir. Tercî’ iki şahadeti alçak sesle okuduktan sonra dönerek tekrar bir de yüksek sesle okumak demektir. Hanîfe ile Küfe ulemâsına göre ezanda Terci’, meşru’ değildir, onlar Abdullah b. Zeyd hadisi ile istidlal ederler. O hadisde terci' zikredilmemiştir. Tercî'in ezanın bir rüknü olup olmadığı hususunda ihtilâf etmişlerdir. Esah olan kavle göre terci' sünnettir. Hadis İmâmlarından bir çokları ile diğer bir takım ulemâya göre müezzin terci’ yapıp yapmamakta muhayyerdir",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 6
			}
		}
	]
}