{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 851,
			"arabicnumber": "386",
			"text": "(Bize Muhammed b. Rumh rivâyet etti. ki): Bize Leys, Hukeym b. Atdillah b. Kays el-Kureşî'den naklen haber verdi. H. Kuteybetü'bni» Said dahi rivâyet etti ki): Bize Leys, Hukeym b. Abdillah'dan, o da Âmir b. Sâ'd b. Ebi Vakkas'dan, o da Sa'd b. Ebi Vakkas'dan, o da Resûlüllah (sallallahü aleyhi ve sellem)'den naklen rivâyet etti ki: Şöyle buyurmuşlar: kîm müezzini işittiği vakit derse günâhı afolunur.» Rumh kendi rivâyetinde: «Herkim müezzini işittiği zaman» «......» derse» dedi. Kuteybe ise «......» dediğini söylemedi. Şerîf müezzin kelime-i şahadeti okuduğu zaman dinleyenlerinde duasını okumalarının müstahab olduğuna delildir. Görülüyor ki müezzini can kulağıyla dinleyerek onun okuduklarını ta'rif e-dildiği vecihle tekrarlamak kulun günahlarının affına sebeptir. Bu hususda Kâdî Iyâz (rahimehüllah) şunları söylemiştir. «Malumun olsun ki; ezan îman akidesini cem etmiştir. Ezan, İmanın iki nev'ine de yani hem akliyata, hem sem'iyyata şâmildir. Ezanın evveli Allah'ın zâtını ve lâyık olduğu kemâl sıfatlarını zıtlardan münezzehîyyetini ispat eder. Bu isbât «Allahü Ekber» lâfzıylâdır. Mezkûr lâfız pek kısa olmakla beraber bu söylediklerimize delâlet eder. Ondan sonra ezan Allah'ın birliğini, şeriki olmadığını tasrih eder ki her dînî vazifenin başında gelen îman ve tevhid'in esası budur; Daha sonra Peygamberliği ve bizim peygamberimiz Muhammed (sallallahü aleyhi ve sellem) şehâdeti ifâde eder. Allah'ın birliğine şahadetten sonra bu da büyük bir kaidedir. Yeri de tevhid'den sonradır. Çünkü Nübüvvet meselesi vuku'u caiz fiillerdendir. Öteki Mukaddimeler ise vâcibat kabilindendir. Bu kaidelerden sonra Allah hakkında vâcib, müstehil ve caiz olan bütün aklî akideler tekemmül etmiş bulunuyor. Bundan sonra ezan, kulları ibâdetlere davet eder. Namaza Nübüvveti ispattan sonra davet etmesi onun vücûbu aklen değil Peygamber (sallallahü aleyhi ve sellem) tarafından bildirildiği i-çindir. Bundan sonra ezan felaha davet eder. Felah (Kurtuluş) daimî nimetler içersinde ebedî hayat demektir. Bu cümle Öldükten sonra dirilmek ve ceza görmek gibi âhiret umurunu bildirmektedir ki islâm akidelerinin en son mevzu'u budur. Bütün bunlar namaza başlandığını bildirmek için ikâmette de tekrar edilir. Bu tekrar îmanın te'kidini ifade eder. Ta ki; namaz kılan kimse bu ibâdete başlarken kalbi ve lisaniyle şahadet ve îman basireti ile girsin de başladığı işin yüceliğini, ibâdet ettiği Allah'ın hakkının büyüklüğünü, sevabının bolluğunu düşünsün...»",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 15
			}
		}
	]
}