{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 860,
			"arabicnumber": "389.05",
			"text": "(Bize Muhammed b. Râfi' rivâyet etti. ki): Bize Ab-dürrezzak rivâyet etti ki): Bize Mâ'mer, Hemmâm b. Münebbih’den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den bu hadîsin mislini rivâyet etti. Şu kadar var ki o: kişi nasıl namaz kıldığını bilmez olur» buyurduğunu söylemiş. Hadîsi Buhârî «Kitâbü’l-Ezan» da Ebû Dâvud ile Nesâî'de «Kitabü's-Salât» da biraz lâfız farkı ile muhtelif râvîler-den tahrîc etmişlerdir. Namaz için nida edilmekten murâd ezandır «Durât» ile «husâs» in ikisi de sesle yellenmek mânâsına gelir. Bazıları husâsın şiddetle koşmak mânâsına geldiğini söylemişlerdir. sesini işitince şeytanın sesle yellenerek alabildiğine kaçması Kâdî Iyâz'a göre hakikat mânâsına alınabilir. Çünkü şeytan da bir cisimdir. Yellenmesi mümkündür. Fakat Buhârî şârihi Aynî: (762 - 855) bunun bir temsil olduğunu söylüyor. Şeytânın ezandan kaçması korkudan perişan olmuş bir adamın haline benzetilmiştir. Başına â-nî bir felâket gelen kimse korkudan ne yapacağını şaşırır, mafsalları gevşer, kendini tutamaz olur. Bu sebeple yellenir. Hattâ bevlini dahi kaçırır. İşte ezan sesini duyan şeytân (aleyhillâne) dabî böyle büyük bir felâket ve belâya uğramış gibi ne yapacağını şaşırır. Kaçmaya başlar. Onun bu perişan hali ne yaptığını bilmeyen felâketzedenin haline benzetilerek iddia sureti ile şeytâna da sesle yellenme isnat edilmiştir. Yoksa hakikaten şeytanın yellenmesi vaki' değildir. Mes'ele bir istiareden ibarettir. Bununla beraber şeytanın hakikaten yellenmesi de caizdir. Çünkü Şeytan bir ruhtur. Yalnız onun nasıl yellendiği bilinemez. (- 743): «Şeytanın ezan sesini işitince kendini meşgul etmesi kulağı dolduran ve başka ses işitmeye mâni olan sese benzetilmiştir. Sonra buna çirkinliğini beyân için sesle yellenme denilmiştir...» diyor. en faziletli ibâdet olan Kur'ân okumadan ve namazdan kaç-mayıp ezan sesinden kaçması kıyâmet gününde onu işittiğine şahadet etmemek içindir. Çünkü bir hadisde vârid olduğuna göre müezzinin sesini işiten İns-ü cin ve her şey kıyâmet gününde onu işittiğine şehadet edecektir. Şeytan da her şeye dahildir. Yahut cinlerden ma'duddur. Bazıları «Şeytânın kaçması ezanın azametindendir. Çünkü ezan dînin bütün ka-vâidine şâmil ve şeâir-i islâmiyyeyi ilândır. Bunlara hasın-ı cân olan şeytan onları işitmeye tahammül edemez; demişlerdir. Bir takımları şeytanın kaçmasını ye's ve ümitsizliğine hamlederler. Zira şeytan tevhid ilânını duyunca İnsana vesvese vereceğinden ümidim keser. Fakat namaz kılan ve Kur'ân-ı Kerim okuyarak Allah'a münacâatta bulunan kimseden şeytân kaçmaz. Çünkü o hallerde kendisine vesvese kapıları açıktır. İstediği gibi kulun damarlarına kadar sokularak vesvesenin enva'ını hatırına getirebilir. O derecede ki, namaz kılan kimse kendinden geçerek kaç rekât kıldığım bile unutur. Rivâyete nazaran İmâm A'zam, Ebû Hanîfe hazretlerine bir adam gelerek bir yere define gizlediğini, fakat nerede olduğunu unuttuğunu söylemiş, onu bulmak için ne yapması lâzım geldiğini sormuş. Hazret-i İmâm iki rekât namaz kılmasını ve namaz esnasında gönlünden namazla alâkası olmayan hiçbir şey geçirmemesini tavsiye etmiş. Bunun üzerine adam abdest alarak Kemal-i Huşu ile namaza durmuş. Lâkin (şeytan-ı lâin) bunu fırsat bilerek derhal yetişmiş ve adamcağıza defineyi nereye gizlediğini namazda iken hatırlatmış. ki namaz kılanlara şeytan musallattır. En olmayacak şeyler namazda hatırıma geliyor, diyenler bilmelidirler ki kendilerini şeytâ-. nın tuzağına kaptırmışlardır. Bundan kurtulmanın çaresi evvelce de gördüğümüz gibi hatıra gelen şeyi derhal reddetmek onu düşünmemektir. bir rivâyetinde geçen kelimesi şeklinde de rivâyet edilmiştir. îyâz: «Biz bu kelimeyi Mu'temed râvilerden «ta» nın kesriyle, ekseri râvîlerden ise «ta» nın zammı ile işittik, ama ta'nın kesri ile okumak daha münâsibtir. Çünkü vesvese verir mânâsına gelir. Ta'nın zammı ile ise yaklaşmak demektir. Yani kişi ile kalbinin arasına sokulur da onu meşgul eder» diyor. hadîste zikri geçen nefis kelimesini Buhârî «Kalp» diye tefsir etmiştir. Şu halde hadîsin mânâsı tercümede arzettiğimiz şekilde; «İnsanla kalbinin arasına girer» demek olur ki bu tefsir aynı zamanda; «İnsanla nefsi aynı şey oldukları halde şeytânın araya girmesi nasıl tasavvur olunabilir.» diyenlere cevap teşkil eder. Bu suale şeytânın kişi ile nefsi arasına girmesi onun son derece insana yaklaştığını anlatmak için bir temsildir, diye de cevap verilebilir. rivâyetteki kelimesi şeklinde de zapt olunmuştur. Bu ikinci rivâyete göre mânâ «Böylelikle insan şaşırır ve u-nutur da yanılır, demek olur. Fakat Kuşeyrî; «Ben onu bu şekilde rivâyet eden kimse bilmiyorum; ama böyle de rivâyet edilmiş olsa mânâ itibarı ile sahih olur ve Peygamber (sallallahü aleyhi ve sellem)’in muradının hâricine çıkılmış sayılmaz» demiştir",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 23
			}
		}
	]
}