{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 888,
			"arabicnumber": "398.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize İsmail b. Uleyye rivâyet etti. H. Muhammed b. el-Müsennâ da rivâyet etti. ki): Bize İbn Ebî Adiy rivâyet etti. Bunların ikisi de İbn Ebî Arûbe'den, o da Katâde'den bu isnadla rivâyet etmişler ki, Resûlüllah (sallallahü aleyhi ve sellem) öğleyi kılmış ve: anladım ki bîriniz onu benim ağzımdan aldı» buyurmuşlar. buradaki rivâyetinde Resûlüllah (sallallahü aleyhi ve sellem)’in öğle namazını mı, ikindiyi mi kıldırdığını râvî şüphe ile ifâde etmişse de, ekseri rivâyetlerinde şüphesiz olarak öğle namazını kıldırdığı beyân edilmiştir. Münâzea, yani çekiştirmek manasınadır. Burada ondan murâd Resûlüllah (sallallahü aleyhi ve sellem)’in ağzından alırcasına onun okuduğunu okumasıdır. Bu sözle Resûlü Ekrem (sallallahü aleyhi ve sellem) o zâtın başkalarına işittirecek derecede sesle okumasını reddetmiş; onun bu yaptığını doğru bulmamıştır. İmâma uyanlara da kırâeti vacip görenler bu hadîste kırâetin menedilmediğini, bilâkis ispat Duyurulduğunu söylerler. Çünkü Resûl-ü Ekrem (sallallahü aleyhi ve sellem) okumalarına bir şey dememiş, aşikâre okumalarına itiraz etmiştir. Gerek Nevevî'nin gerekse Kâdî Iyâz'ın izahatı bu tarzdadır. Fakat bize kalırsa hadîs-i şerif, İmâmın arkasında kırâet vâcibdir diyenlere ne kadar delilse, vâcib değildir diyenlere de o kadar, hattâ daha fazla delil teşkil eder. Çünkü Resûlüllah (sallallahü aleyhi ve sellem): sûreyi hanginiz okudu» diğer rivâyette «Okuyan kimdi» yahut «Hanginiz okudu?» buyurmuştur. Bu suallerden okuyun mânâsı mı çıkar, yoksa okumayın mânası mı? Bence okumayın mânâsı çıkar. Bunları sesle okuyan kimdi, sesle okumak doğru değildir. Gizli okuyun;» mânâsına almak, hele de okumayı bütün cemâate teşmil ederek cemâatin gizli okumalarını takrir ve kabul mânâsı vermek olsa olsa zayıf bir ihtimaldir. Bu sebeple hadîs; «Cemaata kırâet vâcibdir» diyenlere değil, vâcib değildir diyenlere delil olsa gerektir. Einâenaleyh Nevevî'nin: hadîs öğle namazında gerek İmâm, gerekse cemâatin sure okuyacaklarını isbât etmektedir. Bize göre hüküm budur. Mezhebimizin şâzz ve zaîf bir kavline göre cemâat gizli namazlarda da, cehrî namazlarda olduğu gibi sûreyi okumazlar. Fakat bu yanlıştır. Çünkü cehrî namazlarda susarak dinlemek emrolunmuştur; Burada ise bir şey işitmez. Şu halde susmanın bir mânâsı kalmaz. Cehrî namazlarda İmâmın okuduğunu işitmeyecek derecede uzakta bulunan cemâat bile esah kavle göre sûreyi o-kurlar» şeklindeki mütâlâası ile Kâdi Iyâz'ın; «Bu hadîsle imamın arkasındaki cemâatin bir şey okumayacaklarına istidlal edilemez. Çünkü Resûlüllah (sallallahü aleyhi ve sellem) o zâtı okumaktan menetmiş, yalnız aşikâre okumasını doğru bulmamıştır» demesi söz götürür",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 50
			}
		}
	]
}