{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 904,
			"arabicnumber": "404.01",
			"text": "Bize Saîd b. Mansûr ile Kuteybetü'bnü Saîd, Ebû Kâmil el-Cahderî ve Muhammed b. Abdilmelik el-Emevî rivâyet ettiler. Lâfız Ebû Kâmil'indir. Dediler ki: Bize Ebû Avâne, Katâde'den, o da Yûnus b. Cübeyr'den, o da Bıttân b. Abdillâh er-Rakaaşî'den naklen rivâyet etti. ki: Ebû Musel-Eş'arî ile birlikte bir namaz kıldım. Ka'deye sıra gelince; cemaattan biri: Namaz, sadaka ve zekâtla birlikte mi ikrar «dundu? dedi. Ebû Mûsâ namazı eda ederek selâm verince: kalktı ve (demin) şöyle deyen hangin izdi? diye sordu. Cemâat sükûtu iltizam ettiler. Sonra tekrar: (demin) şöyle deyen hangin izdi? dedi. Cemâat yine sükût ettiler. Bunun ü-zerine Ebû Mûsâ: Bunu galiba sen söyledin ya Hıttân! dedi. Hıttân; Onuf ben söylemedim; beni azarlarsın, diye korktum dedi. Müteakiben cemaattan biri; Onu ben söyledim. Ama bu sözle hayırdan başka birşey kastetmedim, dedi. Bunun üzerine Ebû Mûsâ: Siz namazınızda ne diyeceğinizi bilmiyor musunuz? Gerçekten Resûlüllah (sallallahü aleyhi ve sellem) bize hutbe okuyarak sünnetimizi beyân ve namazımızı bize tâlim eyledi. Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular: kılacağınız zaman saflarınızı düzeltin. Sonra içinizden biriniz size İmâm olsun. O tekbir aidimi siz de tekbîr alın dedimi sizde âmin deyin ki Allah duanıza icabet buyursun. tekbir alarak rüku'a gittimi siz de tekbir alın ve rükû' edin. Çünkü İmâm sizden önce rükû’ eder; sizden önce rükû'dan doğrulur.» Resûlüllah (sallallahü aleyhi ve sellem) şöyle devam etti: bununla kapanır. İmâm dediği vakit sizde deyin Allah sizin bu sözünüzü kabul eder. Çünkü Allah tebâreke ve Teâlâ, Peygamberi (sallallahü aleyhi ve sellem)’in dilinde buyurmuştur. İmâm tekbir alarak secdeye gittimi sizde tekbir alın ve secdeye gidin, zîra İmâm sizden önce secde edecek ve yine sizden önce secdeden başını kaldıracaktır.» (sallallahü aleyhi ve sellem) (burada yine): «Bu bununla kapanır. Oturuş anında sizden her hangi biriniz ilk sözü şu olsun",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 66
			}
		}
	]
}