{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 912,
			"arabicnumber": "408",
			"text": "Bize Yâhyâ b. Eyyûb ile Kuteybe ve İbn Hucr rivâyet ettiler. Dediler ki: Bize İsmail -ki İbn Ca'fer'dir- Alâ'dan, o da Baba­sından, o da Ebû Hüreyre'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem): kim bana bir salavât getirirsa Allah ona on salât eyler.» buyurmuşlar. Iyâd'ın beyânına göre bu hadîsin manâsı: Peygamber (sallallahü aleyhi ve sellem)'e bir defa salâvât getiren kimsenin ecrini Allahü teâlâ kat kat verir demektir. Bu takdirde hadîs kim bir iyilik işlerse kendisine o İyiliğin on misli verilir.\" Sure-i En'am âyet 160 âyet-i kerîmesi kabilindendir. Bazı müfessirler buradaki on tâbirinden hususî adet değil, çokluk kastedildiğini söylemiş ve buna; Allah yolunda harcıyanların hâli yedi başak suren ve her başakda yüz tane bulunan bir tohumun hâli gibidir. Allah dilediği­ne kat kat verir.\" Sure-i Bakara 261 Âyet-i kerîmesiyle istidlal etmişlerdir. Diğer müfessirlere göre âyetteki ondan murâd en az mikdarı beyândır. Yânî bir iyilik yapana en az on sevap verilecek demektir ki, zahir olan mânâ da budur. Maamafih hadîsteki «Salât» dan zahirî ma'nâsı kastedilmiş de olabilir. Yani Teâlâ hazretleri melekler arasında o kulunun şân-u şerefini göstermek için onlara işittirecek bir kelâmla ona rahmet buyurmuş olabilir. Nitekim bir hadîsde: kulum beni cemâat içinde anarsa ben o kulumu o cemâatdan daha hayırlı bir cemâat İçinde anarım.» buyurulmuştur. (sallallahü aleyhi ve sellem)'e salâvât ve gibi sözlerle olur. Bir kimse «Yarabbî Muhammed'e yüzbin sâlât eyle» dese acaba fi'len yüzbin defa salâvât getirenler kadar sevaba nail olur mu? Bu suâle Bazıları olmaz, cevâbını vermişlerdir. Ancak onlara göre de bu salâvâttan kazanacağı sevap bir tek salâvat sevabından kat kat fazladır. Yalnız bilfiil yüzbin salâvât getiren derecesine varamaz",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 74
			}
		}
	]
}