{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 936,
			"arabicnumber": "418.01",
			"text": "Bize Ahmed b. Abdillâh b. Yunus rivayet etti. (Dediki): Bize Zaide rivayet etti. (Dediki): Bize Musa b. Ebî Aişe, Ubeydullah b. Abdillah'dan naklen rivayet etti. Ubeydullah şöyle demiş: Aişe'nin yanına girdim de kendisine: — Bana ResuIullah (Sallallahu Aleyhi ve Sellem)'in hastalığından bahsetmez misin, dedim. Aişe: — Hay hay, dedi (ve şunları söyledi): Nebi (Sallallahu Aleyhi ve Sellem)'in hastalığı ağırlaştı (Bir ara): «Cemâat namazı kıldılarmı?» dedi. Biz: Hayır seni bekliyorlar Yâ Resulallâh dedik. — (öyle ise) «Benim için leğene su koyun» buyurdular. Dediğini yaptık, Resulullah. (Sallallahu Aleyhi ye Sellem) yıkandı. Sonra kalkmak için davrandı. Fakat bayıldı. Sonra ayılarak: «Cemâat namazı kıldılarmı» diye sordu. «Hayır, seni bekliyorlar, Ya Resulallâh» dedik. Yine: — «Benim için leğene su koyun» buyurdular. .Dediğini yaptık ve yıkandı. Sonra kalkmak için davrandı fakat yine bayıldı. Bilâhare ayıldı ve: — «Cemâat namazı kıldılar mı» diye sordu» — «Hayır, seni bekliyorlar, Ya Resulallâh» dedik. «Benim için su koyun» buyurdular. Biz bunu da yaptık Resulullah (Sallallahu Aleyhi ve Sellem) yıkandı. Sonra kalkmak için davrandı. Fakat yine bayıldı, sonra ayılarak? — «Cemâat namazı kıldılarmı?» diye sordu. — «Hayır. Seni bekliyorlar, Ya Resulallâh» dedik, cemâat mescide kapanmış yatsı namazı için Resulullah (Sallallahu Aleyhi ve Sellem)'i bekliyorlardı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) cemaata namaz kıldırması için Ebu Bekir'e haber gönderdi. Gönderilen zât Ebu Bekir'e vararak: — Resulullah (Sallallahu Aleyhi ve Sellem) cemâat'a namaz kıldırmanı sana emrediyor, dedi. Ebu Bekir yumuşak kalpli bir zât idi: — Yâ Ömer! Cemaata namazı sen kıldır, dedi. Ömer: — Buna sen daha lâyıksın, mukabelesinde bulundu. Müteakiben o günlerde cemaata Ebu Bekir namazı kıldırdı. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) kendinde bir parça hafiflik hissederek biri Abbas olmak üzere iki kişinin arasında öğle namazına çıktı. Ebu Bekir cemaata namaz kıldırıyordu. Ebu Bekir onu görünce geri çekilmeye davrandı, fakat Peygamber (Sallallahu Aleyhi ve Sellem) ona geriye çekilmemesini işaret etti. Yanındaki iki zat'a: «Beni onun yanı başına oturtun» dedi. Onlar da kendisini Ebu Bekir'in yambaşına oturttular. Ebu Bekir ayakta Nebi (Sallallahu Aleyhi ve Sellem)'in namazına uymuş, cemâat ta Ebu Bekir'in namazına uymuş olarak namaz kılıyorlar, Nebi (Sallallahu Aleyhi ve Sellem) ise oturuyordu.» Ubeydullah demiş ki: «Müteakiben Abdullah b. Abbâs'ın yanına girerek Resulullah (Sallallahu Aleyhi ve Sellem)'in hastalığı hakkında Aişe'nin bana anlattıklarını sana arzedeyim mi?» dedim. Anlat, dedi. Âişe'nin söylediklerini ona arzettim. Onlar da hiç bir şey inkâr etmedi. Yalnız: Abbas'la birlikte Resulullah (Sallallahu Aleyhi ve Sellem)'in koluna giren zât'ın adını Âişe sana söyledi mi?» dedi. — «Hayır» dedim. — «O Ali'ydi» dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 98
			}
		}
	]
}