{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 960,
			"arabicnumber": "425.02",
			"text": "(Bana Ebû Gassân el-Mismaî rivâyet etti. ki): Bize Muâz (yani İbn Hişâm) rivâyet etti. ki): Bana babam rivâyet etti. H. Muhammed b. el-Müsennâ da rivâyet etti. ki): Bize İbn Ebî Adiy, Saîd'den naklen rivâyet etti. Bunların ikisi de Katâde'den, o da Enes'den naklen rivâyet etmişler ki: Nebiyyullah (sallallahü aleyhi ve sellem): ve sücûdu tamamlayın! Vallahi rükû' ve secde ettiğiniz zaman ben sizi arkamdan pekâlâ görüyorum.» buyurmuşlar. rivâyetinde: (Mâ) kelimesi zikredilmeks denilmiştir. hadîsi Buhârî «Kitâbü's-Salât» ve «Kitâbü’l-Ezân» da muhtelif râvilerden tahrîc etmiştir. benim kıblemi bu tarafa doğrumu görüyorsunuz?» cümlesinden murâd, siz benim Önümün bu tarafa olduğuna bakarak yalnız bu taraf-daki şeyleri gördüğümü mü zannediyorsunuz? Vallahi görmem yalnız ö-nüme gelen şeylere mahsûs değil, arkamdakilere de şâmildir, demektir. Ulemâ, buradaki görmenin mânâsı ile keyfiyeti hususunda ihtilâf etmişlerdir. Bazıları: «Görmekden murâd, ya Vahiy tarikiyle cemâatin nasıl namaz kıldıklarının bildirilmesi, yahutta bunu ilham yoluyla anlamasıdır.» demişlerse de Aynî bu sözün hiç bir kıymeti olmadığını söylüyor ve: «Çünkü bu iş ilim yoluyla olsaydı, arkamdan görüyorum diye takyîd buyurmanın bir faydası kalmazdı.» diyor. takımları: «Bundan murâd: Resûlüllah (sallallahü aleyhi ve sellem)’in sağındaki ve solundaki cemâatin nasıl kıldıklarını göz ucuyla görmesidir.» demişlerdir. Bu söz dahi muteber değildir. ulemâya göre Peygamber (sallallahü aleyhi ve sellem) hakikî bir idrak ile arkasında olanları görürdü. Bu ona mahsûs hârikalardandır. Onun içindir ki Buh âr'î bu hadîsi «Peygamberliğin Alâmetleri» bahsinde tahrîc etmiştir. Bu hususda söylenen sözlerin doğrusu da budur. göre görmek için yüz yüze gelmek şart değildir. Çin'deki bir âmânın Endülüs'ü görmesi caizdir. Hadîsi gerîf onların bu kavline delildir. Aynî diyor ki: sünnete göre hak olan budur. Görmek için aklen husus! bir uzuv şart olmadığı gibi, mukabele yani yüz yüze gelmek ve yakınlık gibi şeyler de şart değildir. Bundan dolayıdır ki ehl-i sünnet Allahü teâlâ'-nm âhirette görülebileceğine hükmetmişlerdir.» taifesi Allahü teâlâ’nın mutlak surette görülemiyeceğini iddia etmiş; dalâlet fırkalarından Müşebbihe ile Kerrâmîye ise Allah'ın bir cihet ve mekânda bulunduğunu itikat ettikleri için, gören kimsenin karşısında bir mekânda bulunmak şartıyla görülebileceğine kail olmuş; ci-hetsiz ve mekansız görmenin imkânsız olduğunu iddia etmişlerdir. Ehl-i Sünnet ulemâsı bunlara lâzım gelen cevâbı vermiş; Allah'ı görmenin hem aklen, hem de naklen caiz olduğunu delilleriyle isbat etmişlerdir. (sallallahü aleyhi ve sellem)’in arkasındaki eşyayı nasıl gördüğü meselesine gelince; Ulemâdan bazılarına göre arkasında gözü vardır ve onunla arkasında bulunan eşyayı dâima görürdü. Bir takımları Peygamber (sallallahü aleyhi ve sellem)’in omuzları arasında iğne deliği büyüklüğünde iki gözü bulunduğunu söylerler. Onlara göre elbise ve şâire gibi şeyler bu gözlerin görmesine mânı olamazdı. Bazıları: suretleri Peygamber' (sallallahü aleyhi ve sellem)’in önündeki duvara resmolunur. Peyganiber efendimiz aynaya bakar gibi onları duvardan görürdü» demişlerdir. Hâsılı Resûlüllah (sallallahü aleyhi ve sellem)’in arkasındaki eşyayı görmesi ona hâs bir mucizedir. diyor ki: «Ulemâya göre Resûlüllah (sallallahü aleyhi ve sellem)’in arkasındaki eşyayı görmesi Allahü teâlâ'nın onun kafasında halk ettiği bir idrak iledir. Bu idrak ile Resûl-i Ekrem (sallallahü aleyhi ve sellem) arkasındaki şeyleri görür. Ona bundan daha ziyâde nice harikulade hususiyetler verilmiştir. ne akıl manîdir, ne de şeriat. Bilâkis şerîat vukuunu haber vermektedir. Binâenaleyh kabul etmek îcabeder. Kâdî Iyâz, İmâm Ahmed b. Hanbel ile cumhûru ulemânın: «Resûlüllah (sallallahü aleyhi ve sellem)’in arkasındaki eşyayı görmesi hakikaten gözle görmek suretiyle olmuştur, dediklerini nakleder.» Kâdî Iyâz'ın beyânına göre ulemâdan Bazıları Resûlüllah (sallallahü aleyhi ve sellem) efendimizin: sîzi arkamdan pekâlâ görürüm» sözünü vefatımdan sonra görürüm mânâsına hamletmişlerse de bunun siyakı hadisle hiç bir alâkası yoktur",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 122
			}
		}
	]
}