{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 97,
			"arabicnumber": "8.05",
			"text": "Bana Ebu Bekr b. Ebi Şeybe ve Zuheyr b. Harb beraberce İbn Uleyye'den tahdis etti: Zuheyr dedi ki: Bize İsmail b. İbrahim, Ebu Hayyan'dan tahdis etti. O Ebu Zur'a b. Amr b. Cerir'den, o Ebu Hureyre'den şöyle dediğini nakletti: Rasulullah (Sallallahu aleyhi ve Sellem) bir gün insanlar arasına çıkmıştı. Yanına bir adam gelerek: Ey Allah'ın Rasulü, iman nedir, dedi. O: ''Allah'a, meleklerine, kitabına, ona kavuşmaya ve rasullerine iman etmendir. Bir de ölümden sonra dirilişe de iman etmendir\" buyurdu. Adam: Ey Allah'ın Resulü İslam nedir dedi. O: \"İslam Allah'a ona hiçbir şeyi ortak koşmaksızın ibadet etmen, farz namazı dosdoğru kılman, farz zekatı tam olarak vermen ve ramazan orucunu tutmandır\" buyurdu. Adam: Ey Allah'ın Resulü, ihsan nedir, (diye) sordu. O: ''Allah'a onu görüyormuşsun gibi ibadet etmendir. Sen onu görmüyorsan dahi o seni görür\" buyurdu. Adam: Ey Allah'ın Rasulü (kıyametin) saat(i) ne zaman, dedi. Allah Rasulü: \"Hakkında soru sorulan kişi sorandan bilgili değildir ama ben sana onun şartlarını söyleyeyim. Cariye efendisini doğuracak olursa işte bu onun şartlarından (alametlerinden) dir. Çıplak ve yalınayak kimseler insanların başı olurlarsa işte bu onun şartlarındandır. Dilsiz davar çobanları uzun bina yanşma girişirlerse işte bu onun şartlarındandır. (Yoksa kıyametin ne zaman kopacağı} Allah'tan başka kimsenin bilmediği beş husus arasındadır\" buyurdu. Sonra da: \"Saatin ilmi muhakkak Allah'ın yanındadır. Yağmuru o indirir, rahimlerde olanı o bilir. (Hiçbir kimse yarın ne kazanacağını bilemez, hiçbir nefis de hangi yerde öleceğini bilemez.) Şüphesiz Allah her şeyi bilendir, her şeyden haberdardır. \" (Lokman, 34) buyruğunu okudu. (Ebu Hureyre) dedi ki: Sonra adam dönüp gitti. Resulullah (Sallallahu aleyhi ve Sellem): \"O adamı bana getiriniz\" buyurdu. Onu geri çağırmak için harekete geçtilerse de hiçbir §ey göremediler. Resulullah (Sallallahu aleyhi ve Sellem)'de: \"Bu Cibril'di. İnsanlara dinlerini öğretmek için geldi\" buyurdu. Diğer tahric: Buhari, 50 ve 4777; İbn Mace, 64 ve 4044'te kısmen; Tuhfetu'I-Eşraf, 14929",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 5
			}
		}
	]
}