{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 97,
			"arabicnumber": "8.05",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb beraberce, İbn Uleyye'den rivâyet ettiler. Züheyr dedi ki: Bize İsmâil b. İbrahim Ebû Hayyan'dan, o da Ebû Zür'ate'bni Amr b. Cerir'den o da Ebû Hüreyre'den naklen rivâyet etti. Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) bir gün halk arasına çıkmıştı. O sırada ona bir adam gelerek: Ya Resûlallah! İmân nedir? diye sordu. Resûlüllah (sallallahü aleyhi ve sellem): Allah'ın Meleklerine, Kitabına, Allah'a kavuşmaya ve Peygamberlerine, bir de son dirilmeye inanmalıdır.» buyurdu. Adam: «Ya Resûlallah! İslâm nedir?» dedi. Resûlüllah (sallallahü aleyhi ve sellem): Allah'a ibâdet etmen, Ona hiç bir şeyi şerik koşmaman, farz namazı ikaame etmen, farz olan zekâtı vermen ve Ramazanı tutmandır» buyurdu. Adam: Resûlüllah! İhsan nedir?» dedi. Resûlüllah (sallallahü aleyhi ve sellem): Onu görüyormuşsun gibi ibâdet etmendir. Çünkü sen Onu görmüyorsan da O senî muhakkak görür.» buyurdu. Resûlüllah!. Kıyâmet ne zaman kopacak?» diye sordu. Resûlüllah (sallallahü aleyhi ve sellem): meselede sorulan sorandan daha âlim değildir. Ama ben sana onun alâmetlerini söyleyeyim: Ne zaman câriye, kendi sahibini doğurursa İşte bu kıyâmet alâmetlerindendir. Ne zaman çıplak, yalın ayak takımı, insanlara baş olurlarsa bu da onun alâmeti erindendir. Ne zaman kuzu, oğlak çobanları yüksek bina yapmakta birbirleriyle yarış ederlerse işte bu da onun alâmetlerindendir. Kıyâmetin ne zaman kopacağı Allah'dan başka kimsenin bilmediği beş gâib şeyde dahildir.» buyurdu. sonra Resûlüllah (sallallahü aleyhi ve sellem) şu âyeti okudu: ne zaman kopacağını bilmek şüphesiz ki Allah'a mahsustur. Yağmuru O indirir, rahimlerde olanları O bilir. Hiç bir kimse yarın ne kazanacağını bilemez; hiç bir kimse de nerede öleceğini bilemez. Muhakkak Allah hakkıyla bilen ve haberdar olandır.» Hüreyre ki: o adam dönüp gitti. Arkasından Resûlüllah (sallallahü aleyhi ve sellem) — O adamı bana geri çevirin! dedi. üzerine ashab geri çevirmeye kalktılar; fakat hiç bir şey göremediler. (O zaman) Resûlüllah (sallallahü aleyhi ve sellem) O Cibrîl'dir. İnsanlara dinlerini öğretmek için geldi,» buyurdular",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 5
			}
		}
	]
}