{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 994,
			"arabicnumber": "442.07",
			"text": "(Bize Harun b. Abdillah rivâyet etti. ki): Bize Abdullah b. Yezîd el-Mukri' rivâyet etti. ki): Bize Saîd (yani İbn Ebî Eyyûp) rivâyet etti. ki): Bize Ka'b b. Alkame, Bilâl b. Abdillah b. Ömer'den, o da babasından naklen rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): sizden izin istedikleri vakit onları mescidlerdeki nasiplerinden menetmeyin.» buyurdular. Bunun üzerine Bilâl: onları mutlaka menederiz.» dedi. Abdullah ona: Resûlüllah (sallallahü aleyhi ve sellem) buyurdu, diyorum. Sen hâlâ onları mutlaka menederim diyorsun.» dedi. hadîsi Buhârî «Kitâbü’l-Ezan», «Kitâbü'l-Cum'a» ve «Kitâbü'n-Nikâh- da muhtelif râvîlerden tahrîc etmiştir. Hadîsi Şerîf bütün rivâyetleri ile mescide gitmek isteyen kadına izin verilmesini, gitmesine mâni olunmaması lâzım geldiğini bildirmektedir. bazısı mutlak, bazısı geceleyin çıkmakla mukayyeddir. Fakat burada hüküm ve hâdise bir olmakla mutlak mukayyede hamlolunmuştur. Binâenaleyh bütün rivâyetlere mevzûubabis olan izin, kadınların geceleyin mescide çıkmalarına aittir. Kirmânî: «Geceleyin çıkmalarına izin verilince gündüzün çıkmaları evleviyetle kalır. Çünkü gece fitne ve fesadın vuku bulabileceği zamandır. Gündüzün bu korku yoktur.» demişse de onun bu sözü ulemânın beyanatına muhaliftir. Zî-ra ulemâ: «Kadınlar geceleyin mescide çıkabilir. Geceleyin fitne ve fesat ehli fisku fücurla yahut uykuyla meşgul oldukları için gece emniyet zamanıdır. Gündüzün çıkamazlar. Çünkü fâsıklar her tarafa yayıldığından emniyet yoktur.» demişlerdir. mescidlere çıkıp çıkamaması ulemâ arasında ihtilaflı bir meseledir. Hanefîye ulemâsından «el-Hidâye» sahibi: «Kadınlara cemaatlarda bulunmak mekruhtur.» demiş. Hidâye sarihleri bu sözden maksadın, genç kadınlar olduğunu beyân etmişlerdir. «Cemaatlar» tâbiri Cuma, bayram, küsûf ve istiska gibi namazların hepsine şâmildir. Bunun sebebi kadınların dışarıya çıkmasile fitne ve fesâd zuhur edeceğinden ve bunun da haramla neticeleneceğinden duyulan endişedir. Harama müeddî olan bir şey de haram olur. Şu halde Hanefiyye ulemâsının buradaki mekrûhdan murâdları haramdır. Zamanımız şöyle dursun, bundan yüzlerce asır evvel yetişen ulemâ kendi zamanlarındaki fitne ve fesatları göstererek: «Bahusus bu zamanda kadınlar mescidlere çıkamaz. Çünkü zamanımız insanları arasında fitne ve fesâd şüyu' bulmuştur.» demişlerdir. Bununla beraber İmâm A'zam'a göre gece emniyet zamanı olduğu için ihtiyar kadınların sabah, akşam ve yatsı namazlarına çıkmalarında bir beis yoktur. İmâm Ebû Yûsuf'la, İmâm Muhammed'e göre ise ihtiyar kadınlar bütün namazlara çıkabilirler. Çünkü rağbet olmadığı için onlar hakkında fitne mevzubahis değildir. Şafiî'den bir rivâyete göre kadınların cemaata çıkmaları mubahtır. Mâlik bu ve emsali hadîslerin ihtiyar kadınlara ham-ledildiğini söylemiştir. Şâfiîlerden «Kadın için, ihtiyarda olsa, evinden daha hayırlı bir yer yoktur.» demektedir. Sahabeyi kirâmdan Abdullah b. Mes'ud (radıyallahü anh): «Kadın avrettir, onun Allah'a en yakm olduğu zaman evinde bulunduğu zamandır. Dışarıya çıktı mı, peşine şeytan takılır.» demiştir. İbrahim Nehaî kadınlarını Cum'a ve diğer namazlar için mescide çıkmaktan menedermiş. Hasan-i Basri'ye: Bir kadın kocam hapisten çıkarsa Basra'nın cemâatle namaz kılınan her camiinde iki rekât namaz kılacağım diye yemin etse, ne yapması lâzım geleceği sorulmuş. Hazret-i Hasan: «Kendi kavminin mescidinde kılar. Çünkü bu kadın bu dediklerinin hepsini yapamaz. Ömer (radıyallahü anh) ona yetişseydi başını ezerdi.» cevâbını vermiştir. ile Müslim'in, Ümmül-Mü'minîn Âişe (radıyallahü anha)'dan rivâyet ettiği şu hadîs bu bâbda fazla söze hacet bırakmaz. Mezkûr hadîsde Hazret-i Âişe: (sallallahü aleyhi ve sellem) kadınların yeni yeni çıkardıkları modalara yetişseydi Benî İsrail kadınlarının menedildikleri gibi onları mescidlerden muhakkak menederdi.» demiştir. Nitekim az sonra gelecektir. Âişe (radıyallahü anha)'nın bundan maksadı kadınların zînet, süs, koku ve güzel elbîse gibi şeylere düştüklerini anlatmaktır. Sârini Aynî, Hazret-i Âişe hadîsini îzah ederken şunları söylüyor: «Âişe (radıyallahü anha) bu zaman kadınların çı-kardıkları çeşit çeşit bid'adlarla münkerâtı görmüş olsaydı elbette inkârı daha şiddetli olurdu. Hele de Mısır kadınlarını!... Çünkü Mısır kadınları arasında dille tavsif edilemiyecek derecede bid'adlar ve menedilemiye-cek kadar çok münkerât vardır...» Bundan sonra Aynî (762 - 855) merhum, Mısır kadınlarının bazı marifetlerini saymışdır. Kaariîn-i Kirâm'ın ibretle okumalan için bunları da ârzedelim",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 156
			}
		}
	]
}