{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"14": "The Qibla"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 455,
			"arabicnumber": 455,
			"text": "রেওয়ায়ত ১. নাফি ইবন ইসহাক (রহঃ) বলেন- নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবী আবু আইয়ুব আনসারী (রাঃ)-কে আমি মিসরে বলিতে শুনিয়াছিঃ আল্লাহর কসম, আমি জানি না এই শৌচাগারগুলি কি করিব। অথচ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন তোমাদের কেউ যদি শৌচকার্যের জন্য যায় তবে কিবলাকে সামনেও করিবে না এবং পিছনেও করিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 455
			}
		},
		{
			"hadithnumber": 456,
			"arabicnumber": 456,
			"text": "রেওয়ায়ত ২. জনৈক আনসার সাহাবী (রাঃ) হইতে বর্ণিত, শৌচকার্যের সময় কিবলাকে সামনে করিয়া বসিতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদিগকে নিষেধ করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 456
			}
		},
		{
			"hadithnumber": 457,
			"arabicnumber": 457,
			"text": "রেওয়ায়ত ৩. ওয়াসি ইবন হাব্বান (রহঃ) বলেন, আবদুল্লাহ্ ইবন উমর (রাঃ) বলিতেনঃ কিছুসংখ্যক লোক বলিয়া থাকেঃ তুমি যখন তোমার আবশ্যকের জন্য (প্রস্রাব ও পায়খানার জন্য) বস, তখন কিবলা ও বায়তুল মুকাদ্দাসকে সামনে করিবে না। আবদুল্লাহ ইবন উমর (রাঃ) বলেনঃ (একবার) আমি আমাদের গৃহের ছাদে চড়িলাম, তখন আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে (তাহার আবশ্যকের জন্য) দুইটি ইটের উপর উপবিষ্ট দেখিলাম, বায়তুল মুকাদ্দাসকে সামনে রাখিয়া। অতঃপর তিনি বলেনঃ সম্ভবত তোমরা তোমাদের পাছার উপর নামায পড়। রাবী (ওয়াসি ইবন হাব্বান) বলেন- আমি বলিলামঃ আল্লাহর কসম, আমি জানি না আপনি ইহা দ্বারা কি বুঝাইয়াছেন। তখন তিনি বললেনঃ অর্থাৎ যে জমির সাথে পাছা লাগাইয়া সিজদা করে (সে পাছার উপর নামায পড়ে)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 457
			}
		},
		{
			"hadithnumber": 458,
			"arabicnumber": 458,
			"text": "রেওয়ায়ত ৪. আবদুল্লাহ ইবনে উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (একবার) কিবলার দিকে দেওয়ালে থুথু দেখিতে পাইয়া উহাকে ঘষিয়া তুলিয়া ফেলিলেন। তারপর তিনি মুখমণ্ডল লোকের দিকে করিলেন। অতঃপর তিনি বলিলেনঃ তোমাদের কেউ যখন নামায পড়ে, সে যেন সামনের দিকে থুথু না ফেলে। কারণ যখন নামায পড়ে তখন অবশ্যই সামনের দিকে আল্লাহ্ তা'আলা থাকেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 458
			}
		},
		{
			"hadithnumber": 459,
			"arabicnumber": 459,
			"text": "রেওয়ায়ত ৫. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার কিবলার দিকে দেওয়ালে থুথু অথবা কাশ বা নাকের পানি (কোনটি বলিয়াছেন এই বিষয়ে রাবীর সন্দেহ হইয়াছে) দেখিতে পাইলেন, তিনি উহা ঘষিয়া পরিষ্কার করিয়াছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 459
			}
		},
		{
			"hadithnumber": 460,
			"arabicnumber": 460,
			"text": "রেওয়ায়ত ৬. আবদুল্লাহ ইবন উমর (রাঃ) বলিয়াছেনঃ যখন লোকজন কাবাগৃহে ফজরের নামাযে ছিলেন এমন সময় একজন আগন্তুক তাহদের নিকট আসিলেন। তিনি (আসিয়া) বলিলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর (গত) রাত্রে কুরআন নাযিল হইয়াছে। তাহাকে নির্দেশ দেওয়া হইয়াছে (নামাযে) কাবা’র দিকে মুখমণ্ডল করার জন্য। অতএব আপনারাও কাবার দিকে মুখ করুন। ইহা শুনিয়া তাহারা কাবা’-র দিকে ঘুরিয়া গেলেন অথবা তাহাদের মুখ ছিল শামের দিকে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 460
			}
		},
		{
			"hadithnumber": 461,
			"arabicnumber": 461,
			"text": "রেওয়ায়ত ৭. সাঈদ ইবন মুসায়্যাব (রহঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদীনায় শুভাগমন করার পর ষোল মাস যাবত বায়তুল মুকাদ্দাসের দিকে নামায পড়িয়াছেন। অতঃপর বদরের (যুদ্ধের) দুই মাস পূর্বে কিবলা পরিবর্তিত হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 461
			}
		},
		{
			"hadithnumber": 462,
			"arabicnumber": 462,
			"text": "রেওয়ায়ত ৮. নাফি' (রহঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) বলিয়াছেনঃ বায়তুল্লাহর দিকে মুখ করিলেই হয়, পূর্বে ও পশ্চিমের মধ্যবর্তী স্থান কিবলা বলিয়া গণ্য করা হয়। (মদীনা হইতে মক্কা দক্ষিণ-পশ্চিমে, পূর্ব ও পশ্চিমের মধ্যবর্তী স্থান বলিতে ইহাই বুঝানো হইয়াছে।)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 462
			}
		},
		{
			"hadithnumber": 463,
			"arabicnumber": 463,
			"text": "রেওয়ায়ত ৯. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ আমার এই মসজিদের এক নামায মসজিদুল হারাম ব্যতীত অন্য মসজিদের হাজার নামায অপেক্ষা উত্তম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 463
			}
		},
		{
			"hadithnumber": 464,
			"arabicnumber": 464,
			"text": "রেওয়ায়ত ১০. হাফস ইবন আসিম (রহঃ) আবূ হুরায়রা (রাঃ) অথবা আবু সাঈদ খুদরী (রাঃ) হইতে বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ আমার ঘর ও মিম্বরের মধ্যবর্তী স্থান জান্নাতের বাগিচাসমূহের একটি বাগিচা। আর আমার মিম্বর হাওযের উপর অবস্থিত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 464
			}
		},
		{
			"hadithnumber": 465,
			"arabicnumber": 465,
			"text": "রেওয়ায়ত ১১. আবদুল্লাহ ইবন যায়দ মাযনী (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ আমার ঘর ও মিম্বরের মধ্যবর্তী স্থান রিয়াজুল-জান্নাতের একটি বাগিচা।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 465
			}
		},
		{
			"hadithnumber": 466,
			"arabicnumber": 466,
			"text": "রেওয়ায়ত ১২. আবদুল্লাহ ইবন উমর (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ আল্লাহর দাসিগণকে তোমরা আল্লাহর মসজিদসমূহ হইতে বিরত রাখিও না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 466
			}
		},
		{
			"hadithnumber": 467,
			"arabicnumber": 467,
			"text": "রেওয়ায়ত ১৩. বুসর ইবন সাঈদ (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ তোমাদের (মহিলাদের) কেউ যদি ইশার নামাযে হাজির হয়, তবে সে অবশ্য খুশবু স্পর্শ করিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 467
			}
		},
		{
			"hadithnumber": 468,
			"arabicnumber": 468,
			"text": "রেওয়ায়ত ১৪. ইয়াহইয়া ইবন সাঈদ (রহঃ) হইতে বর্ণিত, উমর (রাঃ)-এর স্ত্রী আতিকা বিনতে যায়দ ইবনে আমর ইবন নুফয়ল (রহঃ) মুসজিদে যাওয়ার জন্য উমর (রাঃ)-এর নিকট অনুমতি চাহিতেন। তিনি কোন উত্তর দিতেন না। ইহাতে তাহার স্ত্রী বলিতেনঃ আল্লাহর কসম, যতদিন আপনি আমাকে নিষেধ না করেন, ততদিন আমি যাইতে থাকিব। কিন্তু তিনি (তবুও) নিষেধ করিতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 468
			}
		},
		{
			"hadithnumber": 469,
			"arabicnumber": 469,
			"text": "রেওয়ায়ত ১৫. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলেনঃ মেয়েরা যেসব নুতন (চালচলন ও তরীকা) সৃষ্টি করিয়াছে, যদি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহা দেখিতেন, তবে অবশ্যই তাহাদিগকে মসজিদ হইতে বিরত রাখিতেন যেমন বনি ইসরাইলের মেয়েদিগকে বিরত রাখা হইয়াছিল। ইয়াহইয়া ইবনে সাঈদ (রহঃ) বলেনঃ আমি আয়েশা (রাঃ) হইতে বর্ণনাকারিণী আমরা-এর নিকট প্রশ্ন করিলামঃ বনি ইসরাইলের মেয়েদিগকে মসজিদে গমন করিতে নিষেধ করা হইয়াছিল কি? আমরা (রাঃ) বলিলেনঃ হ্যাঁ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 469
			}
		}
	]
}