{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"15": "The Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 470,
			"arabicnumber": 470,
			"text": "রেওয়ায়ত ১. আবদুল্লাহ ইবন আবু বকর ইবন হাযম (রহঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম 'আমর ইবন হাযমের নিকট যে পত্র লিখিয়াছিলেন উহাতে ইহাও লিখিত ছিল যে, পবিত্র ব্যক্তি ছাড়া কুরআনকে যেন কেউ স্পর্শ না করে। ইয়াহইয়া (রহঃ) বলেন, মালিক (রহঃ) বলিয়াছেনঃ কুরআনকে জুযবদান-এর ফিতা ধরিয়া অথবা বালিশের উপর রাখিয়া যেন উত্তোলন না করে, তবে পবিত্রাবস্থায়। যদি উহা (ফিতা ধরিয়া এবং বালিশের উপর কুরআন রাখিয়া ওযু ছাড়া স্পর্শ করা) জায়েয হইত, তবে জিলদকেও পবিত্রতা ছাড়া স্পর্শ করা যাইত। আর ইহা এই কারণে মাকরূহ করা হয় নাই যে, যে ব্যক্তি কুরআন উঠাইতেছে তাহার হাতে এমন কোন জিনিস আছে যদ্বারা ইহা অপরিষ্কার হইয়া যাইবে। অপবিত্র অবস্থায় উহা উঠান মাকরূহ, এই হুকুম করা হইয়াছে কুরআনের তাযীম ও সম্মানার্থে। ইয়াহইয়া (রহঃ) বলেন- মালিক (রহঃ) বলিয়াছেনঃ (لَا يَمَسُّهُ إِلَّا الْمُطَهَّرُونَ) অর্থাৎ যাহারা পূত-পবিত্র তাহারা ব্যতীত অন্য কেহ তাহা স্পর্শ করে না (সূরা ওয়াকিয়াহঃ ৭৯) এই আয়াতের ব্যাখ্যা প্রসঙ্গে সর্বোত্তম যাহা আমি শুনিয়াছি তাহা হইল যেইরূপ সূরা আবাসা'তে ইরশাদ করা হইয়াছে (كَلَّا إِنَّهَا تَذْكِرَةٌ فَمَن شَاءَ ذَكَرَهُ فِي صُحُفٍ مُّكَرَّمَةٍ مَّرْفُوعَةٍ مُّطَهَّرَةٍ) অর্থাৎ এই প্রকার আচরণ অনুচিত, ইহা উপদেশবাণী; যে ইচ্ছা করিবে সে ইহা স্মরণ রাখিবে। উহা আছে মহান, উন্নত মর্যাদাসম্পন্ন, পবিত্র গ্রন্থে, মহান, পূতচরিত্র লিপিকারদের হস্তে। (সূরা আবাসাঃ ১১-১৪)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 470
			}
		},
		{
			"hadithnumber": 471,
			"arabicnumber": 471,
			"text": "রেওয়ায়ত ২. এক সময় উমর (রাঃ) এমন এক সম্প্রদায়ের মধ্যে ছিলেন, যাহারা কুরআন পাঠ করিতেছিলেন, (ইতিমধ্যে) তিনি প্ৰস্ৰাব-পায়খানার আবশ্যকে গমন করিলেন, পুনরায় প্রত্যাবর্তন করিলেন এবং কুরআন পাঠ করিতে শুরু করিলেন। (ইহা দেখিয়া) এক ব্যক্তি তাহাকে বলিলঃ হে আমিরুল মু'মিনীন! আপনি (কুরআন) পাঠ করিতেছেন অথচ আপনি বে-ওযু। তখন উমর (রাঃ) বললেনঃ এইরূপ ফতওয়া কে দিয়াছে? মুসায়লামা কি?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 471
			}
		},
		{
			"hadithnumber": 472,
			"arabicnumber": 472,
			"text": "রেওয়ায়ত ৩. আবদুর রহমান ইবনে আবদিল কারী (রহঃ) হইতে আ’রজ (রহঃ) বর্ণনা করেন যে, তিনি বলিয়াছেনঃ উমর ইবন খাত্তাব (রাঃ) বলেন, যাহার রাত্রের (নির্দিষ্ট তিলাওয়াতের) অংশ ছুটিয়া যায়, সে উহা যোহরের নামাযের পূর্ব পর্যন্ত (সময়ে) পড়িয়া লইবে; তবে তাহার সে ওয়ীফা যেন ছুটে নাই (রবী বলেন) অথবা তিনি বলিয়াছেন, সে যেন উহা পূর্ণ করিয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 472
			}
		},
		{
			"hadithnumber": 473,
			"arabicnumber": 473,
			"text": "রেওয়ায়ত ৪. ইয়াহইয়া ইবনে সাঈদ (রহঃ) বলেনঃ আমি ও মুহাম্মদ ইবনে ইয়াহইয়া ইবনে হাব্বান (রহঃ) (এক জায়গায়) বসা ছিলাম। তারপর মুহাম্মদ ইবন ইয়াহইয়া এক ব্যক্তিকে ডাকিলেন এবং বলিলেন, আপনার পিতা হইতে যাহা শুনিয়াছেন তাহা আমার নিকট বলুন। সেই ব্যক্তি বলিলেন, আমাকে আমার পিতা বলিয়াছেন- তিনি একবার যায়দ ইবন সাবিত (রাঃ)-এর নিকট গেলেন; তারপর তাহাকে বলিলেনঃ সাত দিনে কুরআন পাঠ (খতম) করা সম্বন্ধে আপনি কি মনে করেন? (উত্তরে) যায়দ (রাঃ) বলিলেনঃ ভাল। কিন্তু পনর অথবা বিশ দিনে পাঠ (শেষ) করা আমার নিকট অতি পছন্দনীয়। আর তুমি ইহার কারণ কি জানিতে চাহিলে শোন (তিনি বলিলেন), ইহা এইজন্য যে, (কুরআনকে) থামিয়া থামিয়া পড়িলে আমি কুরআনের মর্ম বোঝার ব্যাপারে চিন্তা-ভাবনা করিতে পারিব।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 473
			}
		},
		{
			"hadithnumber": 474,
			"arabicnumber": 474,
			"text": "রেওয়ায়ত ৫. আবদুর রহমান ইবন আবদিল কারী (রহঃ) বলেনঃ আমি উমর ইবন খাত্তাব (রাঃ)-কে বলিতে শুনিয়াছি হিশাম ইবন হাকিম ইবন হিযামকে সূরা আল-ফুরকান আমি যেইরূপ পড়িয়া থাকি উহার ভিন্নরূপ পড়িতে শুনিলাম। অথচ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে সেই সূরাটি পড়াইয়াছেন। (আমি ক্রোধে) তাঁহাকে ধরিবার উপক্রম করিয়াছিলাম। কিন্তু নামায সমাপ্ত করা পর্যন্ত তাহাকে আমি সময় দিলাম। অতঃপর তাহার চাদর দ্বারা আমি তাহাকে পেচাইয়া লইলাম। পরে তাহাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খেদমতে নিয়া আসিলাম এবং আরজ করিলামঃ ইয়া রাসূলাল্লাহ! সূরায়ে আল-ফুরকান আপনি আমাকে যেরূপ পড়াইয়াছেন, আমি ইহাকে উহার ভিন্নরূপ পড়িতে শুনিয়াছি। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ তুমি তাঁহাকে ছাড়িয়া দাও। অতঃপর তাহাকে বললেনঃ তুমি পাঠ কর। তারপর আমি যেরূপ কিরাআত পড়িতে তাহাকে শুনিয়াছি সেই কিরাআতই তিনি পড়িলেন। (এই কিরাআত শুনিয়া) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, এইরূপ অবতীর্ণ করা হইয়াছে। অতঃপর আমাকে (উদ্দেশ্য করিয়া) বলিলেনঃ তুমি পড়। আমি উহা (ফুরকান) পাঠ করিলাম। তিনি বলিলেনঃ এইরূপ অবতীর্ণ করা হইয়াছে এবং কুরআন সাত অক্ষরের উপর নাযিল হইয়াছে, ফলে তোমরা তাহা হইতে যেইটি সহজ হয় সেইটি পাঠ কর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 474
			}
		},
		{
			"hadithnumber": 475,
			"arabicnumber": 475,
			"text": "রেওয়ায়ত ৬. আবদুল্লাহ্ ইবন উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ কুরআনওয়ালা রশিতে বাধা উটওয়ালার মত; যদি উহাকে তদারক করে, তবে নিয়ন্ত্রণে রাখিতে পারবে; আর যদি উহাকে ছাড়িয়া দেয়, তবে উহা চলিয়া যাইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 475
			}
		},
		{
			"hadithnumber": 476,
			"arabicnumber": 476,
			"text": "রেওয়ায়ত ৭. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) হইতে বর্ণিত, (একবার) হারিস ইবন হিশাম (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট প্রশ্ন করলেন, আপনার নিকট ওহী কিরূপে আসে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (উত্তরে) বলিলেনঃ কখনও কখনও আমার নিকট (ওহী) আসে ঘন্টাধ্বনির মত, এই (প্রকারে অবতীর্ণ) ওহী আমার উপর অতি কঠিন হয়। তারপর আমা হইতে (এই অবস্থার) অবসান হয়, (এই দিকে) তিনি যাহা বলিয়াছেন আমি তাহা হিফাযত করিয়াছি। আর কোন কোন সময় ফেরেশতা কোন ব্যক্তির রূপ ধারণ করিয়া আমার নিকট আসেন এবং আমার সঙ্গে কথা বলেনঃ তিনি যাহা বলেন আমি উহা হিফাযত করি। আয়েশা (রাঃ) বলেনঃ আমি অবশ্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখিয়াছি প্রচণ্ড শীতের দিনে তাহার প্রতি ওহী অবতীর্ণ হইতেছে। অতঃপর সেই অবস্থার অবসান হইয়াছে, তখন তাহার ললাট হইতে ঘাম টপকাইতেছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 476
			}
		},
		{
			"hadithnumber": 477,
			"arabicnumber": 477,
			"text": "রেওয়ায়ত ৮. হিশাম ইবনে উরওয়াহ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন- তিনি বলিয়াছেন, সূরা আবাসা অবতীর্ণ করা হইয়াছে আবদুল্লাহ্ ইবন উম্মে মাকতুম (রাঃ)-এর শানে। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসিয়া বলিতে লাগিলেনঃ হে মুহাম্মদ! আমাকে আপনার নিকট বসিতে দিন, সেই সময় নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট মুশরিকগণের নেতাদের একজন বড় নেতা উপস্থিত ছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহা ইহতে মনোযোগ ফিরাইয়া সেই নেতা ব্যক্তির দিকে মনোনিবেশ করিলেন এবং বলিতেছিলেনঃ হে আবূ ফুলান (অমুকের পিতা), আমি যাহা বলি উহাতে কোন ক্রটি দেখিয়াছ কি? (উত্তরে) সে বলিতেছিলঃ মূর্তির কসম, না, আপনি যাহা বলেন উহাতে কোন প্রকার ক্রটি দেখিতেছি না। অতঃপর এই সূরা অর্থাৎ সূরা আবাসা অবতীর্ণ হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 477
			}
		},
		{
			"hadithnumber": 478,
			"arabicnumber": 478,
			"text": "রেওয়ায়ত ৯. যায়দ ইবন আসলাম (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহার সফরসমূহের কোন এক সফরে পথ চলিতেছিলেন। রাত্রে উমর ইবন খাত্তাব (রাঃ)-ও তাহার সঙ্গে চলিতেছিলেন। তখন উমর (রাঃ) কোন বিষয়ে তাহাকে প্রশ্ন করিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাকে কোন উত্তর দিলেন না। উমর (রাঃ) পুনরায় সওয়াল করিলেন। কিন্তু তিনি উহার জবাব দিলেন না। অতঃপর তাহার নিকট (উমর) আবার সওয়াল করিলেন, কিন্তু (এইবারও) তিনি উহার জবাব দিলেন না। তখন উমর (রাঃ) (মনে মনে) বলিলেন, উমর, তোমার মাতা তোমাকে হারাইয়া ফেলুন (এবং কাঁদিতে থাকুন অর্থাৎ তোমার সর্বনাশ)। তুমি বিনয় সহকারে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট সওয়াল করিলে, আর তিনি তোমাকে কোন জবাব দিলেন না। উমর (রাঃ) বলেনঃ তারপর আমার উটকে আমি চালিত করিলাম, এমন কি আমি লোকের আগে আগে চলিয়া গেলাম। আমি আশংকা করিলাম আমার বিষয়ে কুরআন অবতীর্ণ হইতে পারে। তারপর আমি (বেশিক্ষণ) অবস্থান করি নাই, (হঠাৎ) এক উচ্চস্বরে আহবানকারী আমাকে ডাকিতেছিল। তিনি (উমর) বলেনঃ আমি আশংকা করিতেছিলাম আমার বিষয়ে হয় তো কুরআন নাযিল হইয়াছে। (উমর) বলেন, অতঃপর আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসিলাম এবং সালাম করিলাম। অতঃপর তিনি বলিলেনঃ অবশ্য এই রাত্রে আমার উপর একটি সূরা অবতীর্ণ হইয়াছে। নিঃসন্দেহে সেই সূরাটি আমার নিকট অধিক প্রিয়, সেই সব বস্তু অপেক্ষা যাহার উপর সূর্য উদিত হইয়াছে। অতঃপর তিনি পাঠ করিলেন (إِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِينًا) অর্থাৎ সূরা ফাতহ সূরাটি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 478
			}
		},
		{
			"hadithnumber": 479,
			"arabicnumber": 479,
			"text": "রেওয়ায়ত ১০. আবু সাইদ খুদরী (রাঃ) বলেন- আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলিতে শুনিয়াছিঃ তোমাদের মধ্যে এক সম্প্রদায় বাহির হইবে যাহারা তুচ্ছ মনে করিবে তোমাদের নামাযকে তাহাদের নামাযের মুকাবিলায় এবং তোমাদের রোযাসমূহকে তাহদের রোযার মুকাবিলায় এবং তোমাদের আমলসমূহকে তাহদের আমলসমূহের মুকাবিলায়। তাহারা কুরআন পাঠ করিবে কিন্তু কুরআন তাহাদের গলদেশের নিচে যাইবে না। তাহারা ধর্ম হইতে এমনভাবে বাহির হইয়া যাইবে, যেমন তীর শিকারকে ভেদ করিয়া বাহির হইয়া যায়। তীরের ফলা দেখিবে, তাহাতেও কোন কিছু দেখিবে না; তীরের লাকড়ি দেখিবে, সেখানেও কিছু দেখিতে পাইবে না; পালকের প্রতি লক্ষ করিবে, পালকেও কিছু দেখিবে না; ধনুকের ছিলার দিকে দেখিবে, সেখানে কিছু রক্ত লাগিয়াছে কিনা সন্দেহ করবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 479
			}
		},
		{
			"hadithnumber": 480,
			"arabicnumber": 480,
			"text": "রেওয়ায়ত ১১. মালিক (রহঃ) বলেন, তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, আবদুল্লাহ ইবন উমর (রাঃ) সূরা বাকারা শিক্ষা করিতে আট বৎসর অতিবাহিত করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 480
			}
		},
		{
			"hadithnumber": 481,
			"arabicnumber": 481,
			"text": "রেওয়ায়ত ১২. আবু সালমা ইবনে আবদুর রহমান (রহঃ) হইতে বর্ণিত, আবু হুরায়রা (বা) তাঁহাদের উদ্দেশ্যে (إِذَا السَّمَاءُ انشَقَّتْ) অর্থাৎ সূরা ইনশিকাক পাঠ করিলেন এবং এই সূরায় সিজদা করিলেন। তিনি নামায সমাপ্ত করিলে পর তাহাদিগকে জানাইলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই সূরায় সিজদা করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 481
			}
		},
		{
			"hadithnumber": 482,
			"arabicnumber": 482,
			"text": "রেওয়ায়ত ১৩. মিসরের বাসিন্দাদের একজন নাফি (রহঃ)-কে বলিয়াছেন যে, উমর ইবনে খাত্তাব (রাঃ) একবার সূরা হজ্জ পাঠ করিলেন এবং তিনি এই সূরায় দুইটি সিজদা করিলেন। অতঃপর তিনি বলিলেনঃ নিশ্চয় এই সূরাকে দুইটি সিজদা দ্বারা বৈশিষ্ট্যমণ্ডিত করা হইয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 482
			}
		},
		{
			"hadithnumber": 483,
			"arabicnumber": 483,
			"text": "রেওয়ায়ত ১৪. আবদুল্লাহ্ ইবনে দীনার (রহঃ) বলেন- আমি আবদুল্লাহ্ ইবনে উমর (রাঃ)-কে সূরা-এ হজ্জে দুইটি সিজদা করিতে দেখিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 483
			}
		},
		{
			"hadithnumber": 484,
			"arabicnumber": 484,
			"text": "রেওয়ায়ত ১৫. আরজ (রহঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) (وَالنَّجْمِ إِذَا هَوَىٰ) অর্থাৎ সূরা আন-নাজম পাঠ করলেন এবং উহাতে সিজদা করিলেন। তিনি দাঁড়াইলেন এবং অন্য একটি সূরা পাঠ করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 484
			}
		},
		{
			"hadithnumber": 485,
			"arabicnumber": 485,
			"text": "রেওয়ায়ত ১৬. উরওয়াহ (রহঃ) হইতে বর্ণিত- উমর ইবন খাত্তাব (রাঃ) একটি সিজদার আয়াত পাঠ করিলেন জুম'আ দিবসে। আর তিনি ছিলেন মিম্বরের উপর। অতঃপর তিনি অবতরণ করিলেন এবং সিজদা করিলেন এবং তাহার সঙ্গে লোকেরাও সিজদা করিলেন। পরবর্তী জুম'আয় তিনি সেই সূরা পাঠ করিলেন। লোকেরা সিজদার জন্য প্রস্তুতি গ্রহণ করিতে লাগিলেন। উমর (রাঃ) তখন বলিলেনঃ আপনারা অপেক্ষা করুন। আল্লাহ্ তা'আলা আমাদের উপর সিজদা ফরয করেন নাই, তবে আমরা যদি ইচ্ছা করি তা স্বতন্ত্র কথা! (ইহা শুনিয়া) তাহারা আর সিজদা করিলেন না। তিনি তাহাদিগকে সিজদা হইতে বিরত রাখিলেন। মালিক (রহঃ) বলেনঃ সিজদার আয়াত মিম্বরের উপর পাঠ করিলে, ইমামের মিম্বর হইতে অবতরণ করিয়া সিজদা করার প্রতি (আমাদের) আমল নাই (অর্থাৎ মিম্বর হইতে অবতরণ জরুরী নহে)। মালিক (রহঃ) বলেনঃ আমাদের অভিমত এই যে, কুরআন শরীফে সিজদাসমূহের মধ্যে তাকিদী সিজদা হইতেছে এগারটি। ইহাদের একটিও মুফাসসালাতে নাই। মালিক (রহঃ) বলেনঃ সুজুদুল কুরআন (কুরআনের সিজদাসমূহ) হইতে কোন সিজদার আয়াত ফজরের নামাযের এবং আসরের নামাযের পর পাঠ করা কাহারও পক্ষে উচিত নহে। কারণ ফজরের পর সূর্য উদিত হওয়া পর্যন্ত এবং আসরের পর (সূর্য) অস্ত যাওয়া পর্যন্ত নামায পড়িতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করিয়াছেন। আর সিজদাও নামাযে গণ্য, কাজেই কাহারও পক্ষে উচিত নহে যে, সেই দুই সময়ে কোন সিজদার আয়াত পাঠ করা। মালিক (রহঃ)-কে প্রশ্ন করা হইয়াছে ঐ ব্যক্তি সম্বন্ধে যিনি একটি সিজদার আয়াত পাঠ করিয়াছেন, আর একজন ঋতুমতী মহিলা উহা শুনিল। তবে সেই মহিলা কি সিজদা করিবে? (উত্তরে) মালিক (রহঃ) বলিলেনঃ পুরুষ বা নারী, পবিত্রাবস্থা ব্যতীত সিজদা করিবে না। ইয়াহইয়া (রহঃ) বলেন, মালিক (রহঃ)-কে প্রশ্ন করা হয় একজন মহিলা সম্পর্কে যিনি সিজদার আয়াত পাঠ করিয়াছেন, অন্য এক ব্যক্তি তাহা শুনিতেছে। সেই ব্যক্তির জন্য সিজদা করা জরুরী কি? (উত্তরে) মালিক (রহঃ) বলেনঃ সিজদা করা এই ব্যক্তির জন্য জরুরী নহে। সিজদা ওয়াজিব হয় সেই লোকের উপর যেসব লোক কোন ব্যক্তির সাথে নামাযে শরীক থাকেন এবং তাহার পিছনে ইকতিদা করেন। অতঃপর তাহাদের ইমাম সিজদার আয়াত পাঠ করিলে তাহারাও তাহার সহিত সিজদা করিবেন। আর যে ব্যক্তি সিজদার আয়াত শুনিয়াছে কোন লোকের মুখে (যিনি উহা পাঠ করিতেছেন), কিন্তু সেই ব্যক্তি এই লোকের ইমাম নহেন, তাহার জন্য এই সিজদা জরুরী নহে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 485
			}
		},
		{
			"hadithnumber": 486,
			"arabicnumber": 486,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 486
			}
		},
		{
			"hadithnumber": 487,
			"arabicnumber": 487,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 487
			}
		},
		{
			"hadithnumber": 488,
			"arabicnumber": 488,
			"text": "রেওয়ায়ত ১৯. হুমায়দ ইবন আবদুর রহমান ইবন আউফ (রহঃ) খবর দিয়াছেন ইবনে শিহাব (রহঃ)-কে সূরা ইখলাস কুরআনের এক-তৃতীয়াংশ আর সূরা মূল্‌ক উহার (পাঠকারী) সাথীর পক্ষে ঝগড়া করবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 488
			}
		},
		{
			"hadithnumber": 489,
			"arabicnumber": 489,
			"text": "রেওয়ায়ত ২০. আবূ হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ যে ব্যক্তি (لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ) এই দোয়াটি দৈনিক একশত বার পাঠ করিবে, ইহা তাঁহার জন্য দশটি গোলাম আযাদ করার সমতুল্য হইবে- তাহার জন্য একশত নেকী হইবে এবং তাহার (আমলনামা) হইতে একশত গুনাহ মিটাইয়া দেওয়া হইবে আর সেইদিন সন্ধ্যা পর্যন্ত ইহা তাহার জন্য শয়তান হইতে রক্ষাকবচ হইবে; আর সে যে আমল পেশ করিয়াছে অন্য কেউ উহা হইতে শ্রেষ্ঠ কোন আমল পেশ করে নাই একমাত্র সেই ব্যক্তি ব্যতীত যে ব্যক্তি (তাহার) এই আমল অপেক্ষা অধিক আমল করিয়াছ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 489
			}
		},
		{
			"hadithnumber": 490,
			"arabicnumber": 490,
			"text": "রেওয়ায়ত ২১. আবু হুরায়রা (রাঃ) হইতে বর্ণিত- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ যে ব্যক্তি (سُبْحَانَ اللَّهِ وَبِحَمْدِهِ) দৈনিক একশত বার পাঠ করবে তাহার পাপসমূহ মাফ করিয়া দেওয়া হইবে, যদি উহা সাগরের ফেনার পরিমাণও হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 490
			}
		},
		{
			"hadithnumber": 491,
			"arabicnumber": 491,
			"text": "রেওয়ায়ত ২২. আবূ হুরায়রা (রাঃ) বলেন, যে ব্যক্তি প্রতি নামাযের শেষে বলিবে- সুবহানাল্লাহ তেত্রিশ বার, আলহামদুলিল্লাহ্‌ তেত্রিশ বার এবং আল্লাহু আকবার তেত্রিশ বার আর একশত পূর্ণ করবে এই দোআ দিয়ে (لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ) তাহার গুনাহ মাফ করা হইবে, যদিও উহা সাগরের ফেনা পরিমাণও হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 491
			}
		},
		{
			"hadithnumber": 492,
			"arabicnumber": 492,
			"text": "রেওয়ায়ত ২৩. উমারা ইবন সাইয়্যাদ (রহঃ) সাঈদ ইবন মুসায়্যাব (রহঃ)-কে বলিতে শুনিয়াছেনঃ ‘বাকিয়াতুস সালিহাত’ (যাহা কুরআনে উল্লেখ করা হইয়াছে) সম্পর্কে বলিয়াছেনঃ হইতেছে বাকিয়াতুস সালিহাত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 492
			}
		},
		{
			"hadithnumber": 493,
			"arabicnumber": 493,
			"text": "রেওয়ায়ত ২৪. আবুদ্দারদা (রাঃ) বলেনঃ আমি কি তোমাদিগকে সংবাদ দিব না তোমাদের আমলসমূহের মধ্যে সর্বোত্তম আমলের, যাহা তোমাদিগকে সর্বাপেক্ষা উচ্চ মর্যাদায় সমাসীনকারী এবং তোমাদের প্রভুর নিকট সর্বাপেক্ষা পবিত্র, সেই আমলের আর (যাহা) তোমাদের জন্য স্বর্ণ ও রৌপ্য দান করা হইতে উত্তম এবং তাহা উত্তম তোমাদের জন্য ইহা হইতে যে, তোমরা তোমাদের শত্রুর সাথে যুদ্ধ কর, ফলে তাহারা তোমাদেরকে হত্যা করে এবং তোমরা তাহদের গর্দান কাট। উপস্থিত (লোকেরা) বললেন, হ্যাঁ, বলুন। তিনি বললেন, এই আমল হইতেছে- ذِكْرُ اللَّهِ (আল্লাহর যিকির)। যিয়াদ ইবনে আবি যিয়াদ (রহঃ) বলেনঃ আবু আবদুর রহমান মুআয ইবন জবল (রাঃ) বলিয়াছেনঃ আল্লাহর যিকির অপেক্ষা আযাব হইতে অধিক নাজাত প্রদানকারী কোন আমল আদম সত্তান সম্পাদন করে নাই ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 493
			}
		},
		{
			"hadithnumber": 494,
			"arabicnumber": 494,
			"text": "রেওয়ায়ত ২৫. রিফায়া ইবন রাফি' (রাঃ) বলেনঃ আমরা একদিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম‡এর সঙ্গে নামায পড়িতেছিলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রুকু হইতে মাথা উঠাইলেন سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ বলিলেন, তাহার পশ্চাতে এক ব্যক্তি বলিল, رَبَّنَا وَلَكَ الْحَمْدُ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন নামায সমাপ্ত করিলেন, তখন বলিলেনঃ এখন মুতাকাল্লিম (তসবীহ পাঠকারী) কে ছিল? সেই ব্যক্তি বলিলঃ আমি, ইয়া রাসূলাল্লাহ। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ আমি অবশ্য ত্ৰিশোর্ধ ফেরেশতাকে দেখিয়াছি, তাহদের মধ্যে ইহাকে সর্বপ্রথম কে লিপিবদ্ধ করিবেন, এই লইয়া তাহারা খুব তাড়াহুড়া করিতেছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 494
			}
		},
		{
			"hadithnumber": 495,
			"arabicnumber": 495,
			"text": "রেওয়ায়ত ২৬. আবু হুরায়রা (রাঃ) হইতে বর্ণিত- রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ প্রত্যেক নবীর জন্য একটি (মাকবুল) দুআ রহিয়াছে, যেই দুআ তিনি করিয়া থাকেন। আমি ইচ্ছা করিয়াছি আমার (জন্য নির্ধারিত) দু'আটি গোপন রাখিবার আখিরাতে আমার উম্মতের সুপারিশের উদ্দেশ্যে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 495
			}
		},
		{
			"hadithnumber": 496,
			"arabicnumber": 496,
			"text": "রেওয়ায়ত ২৭. ইয়াহইয়া ইবনে সাইদ (রহঃ) হইতে বর্ণিত, তাহার নিকট খবর পৌছিয়াছে যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুআ করিতে বলিতেনঃ اللَّهُمَّ فَالِقَ الإِصْبَاحِ وَجَاعِلَ اللَّيْلِ سَكَنًا وَالشَّمْسِ وَالْقَمَرِ حُسْبَانًا اقْضِ عَنِّي الدَّيْنَ وَأَغْنِنِي مِنَ الْفَقْرِ وَأَمْتِعْنِي بِسَمْعِي وَبَصَرِي وَقُوَّتِي فِي سَبِيلِكَ হে আল্লাহ তুমি উষার উন্মেষ ঘটাও, রাত্রকে বিশ্রামের জন্য নির্ধারিত করিয়াছ, গণনার জন্য সূর্য ও চন্দ্র সৃষ্টি করিয়াছ, আমার ঋণ শোধ করিয়া দাও, আমাকে অভাবমুক্ত কর; আমার দৃষ্টিশক্তি শ্রবণশক্তি, এবং তোমার পথে জিহাদ করার শক্তি দ্বারা আমাকে উপকৃত কর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 496
			}
		},
		{
			"hadithnumber": 497,
			"arabicnumber": 497,
			"text": "রেওয়ায়ত ২৮. আবূ হুরায়রা (রাঃ) হইতে বর্ণিত- রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, তোমাদের কেউ দু’আ করার সময় এইরূপ যেন না বলে, اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ اللَّهُمَّ ارْحَمْنِي إِنْ شِئْتَ অর্থাৎ হে আল্লাহ, আপনি ইচ্ছা করিলে আমাকে ক্ষমা করুন, অনুগ্রহ করুন। বরং দৃঢ় প্রত্যয় নিয়া দুআ করিবে, কারণ আল্লাহকে বাধা করিবার মত কেউ নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 497
			}
		},
		{
			"hadithnumber": 498,
			"arabicnumber": 498,
			"text": "রেওয়ায়ত ২৯. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওসাল্লাম বলিয়াছেনঃ তোমাদের এক ব্যক্তির দু'আ কবুল করা হয় (যখন দুআ করে) যদি সে তাড়াতাড়ি না করে। সে বলেঃ আমি দুআ করিয়াছিলাম, কিন্তু আমার দুআ কবুল করা হইল না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 498
			}
		},
		{
			"hadithnumber": 499,
			"arabicnumber": 499,
			"text": "রেওয়ায়ত ৩০. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওসাল্লাম বলিয়াছেনঃ আমাদের প্রভু মহান ও মহিমান্বিত আল্লাহ্ অবতরণ করেন প্রতি রাত্রে দুনিয়ার আসমানে, যখন রাত্রির শেষ তৃতীয়াংশ অবশিষ্ট থাকে। অতঃপর বলেনঃ কে (আছে এমন) আমাকে ডাকিবে? আমি তাহার ডাকে সাড়া দিব। কে (আছে এমন) আমার নিকট সওয়াল করিবে? আমি তাহাকে দান করিব। কে (আছে এমন) ক্ষমা প্রার্থনা করিবে? আমি তাহাকে ক্ষমা করিয়া দিব।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 499
			}
		},
		{
			"hadithnumber": 500,
			"arabicnumber": 500,
			"text": "রেওয়ায়ত ৩১. উম্মুল মু'মিনীন আয়েশা (রাঃ) বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পার্শ্বে (একবার) নিদ্রিত ছিলাম। রাত্রির এক অংশে আমি তাহাকে হারাইয়া ফেলিলাম। তারপর (সন্ধান করিতে করিতে এক পর্যায়ে) আমার হাত দ্বারা তাহাকে স্পর্শ করলাম এবং আমি আমার হাত তাঁহার উভয় কদমের উপর স্থাপন করিলাম। তিনি তখন সিজদায় ছিলেন এবং বলিতেছিলেনঃ أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَبِكَ مِنْكَ لاَ أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ অর্থাৎ, আমি আপনার ক্রোধ হইতে আপনার সন্তুষ্টির, আপনার আযাব হইতে আপনার ক্ষমার শরণ লইতেছি। আপনার শরণ লইতেছি আপনার দ্বারা আপনারই পক্ষ হইতে। আপনার প্রশংসার উপযুক্ত হক আমি আদায় করিতে পারিব না। আপনি সেইরূপ যেরূপ আপনি স্বয়ং নিজের সত্তার প্রশংসা করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 500
			}
		},
		{
			"hadithnumber": 501,
			"arabicnumber": 501,
			"text": "রেওয়ায়ত ৩২. তালহা ইবনে উবায়দুল্লাহ্ ইবনে কুরায়য (রহঃ) হইতে বর্ণিত- রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ দু'আর মধ্যে সর্বোত্তম দুআ হইল আরাফাতের দিবসের দুআ, আর উত্তম যাহা আমি ও আমার পূর্ববর্তী নবীগণ বলিয়াছেন, তাহা হইতেছে, (لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 501
			}
		},
		{
			"hadithnumber": 502,
			"arabicnumber": 502,
			"text": "রেওয়ায়ত ৩৩. আবদুল্লাহ্ ইবনে আব্বাস (রাঃ) হইতে বর্ণিত- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাদিগকে (নিম্নে বর্ণিত) এই দু'আটি কুরআনের সূরা যেরূপ শিক্ষা দিতেন সেইরূপ শিক্ষা দিতেন। তিনি বলিতেনঃ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ অর্থাৎ, হে আল্লাহ। আমি জাহান্নামের আযাব হইতে, কবরের আযাব হইতে, মসীহ দাজ্জালের ফিতনা হইতে, জীবিত এবং মৃতের ফিতনা হইতে আপনার শরণ লইতেছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 502
			}
		},
		{
			"hadithnumber": 503,
			"arabicnumber": 503,
			"text": "রেওয়ায়ত ৩৪. আবদুল্লাহ্ ইবনে আব্বাস (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মধ্য রাত্রে যখন (তাহাজ্জুদ) নামাযের জন্য দাঁড়াইতেন, তখন বলিতেনঃ اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ قَيَّامُ السَّمَوَاتِ وَالأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ أَنْتَ الْحَقُّ وَقَوْلُكَ الْحَقُّ وَوَعْدُكَ الْحَقُّ وَلِقَاؤُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالسَّاعَةُ حَقٌّ اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ وَإِلَيْكَ حَاكَمْتُ فَاغْفِرْ لِي مَا قَدَّمْتُ وَأَخَّرْتُ وَأَسْرَرْتُ وَأَعْلَنْتُ أَنْتَ إِلَهِي لاَ إِلَهَ إِلاَّ أَنْتَ অর্থাৎ, হে আল্লাহ! হামদ আপনারই জন্য, আপনি আসমান ও যমীনের জ্যোতি, আপনারই জন্য হামদ, আপনি আসমান ও যমীনের রক্ষক, আপনারই জন্য হামদ, আসমান ও যমীনের এবং এতদুভয়ে যাহা কিছু আছে সকলেরই প্ৰভু আপনি। আপনি সত্য, আপনার বাণী সত্য, আপনার ওয়াদা সত্য, আপনার সাক্ষাৎ সত্য, জান্নাত ও দোযখ সত্য, কিয়ামত সত্য। হে আল্লাহ! আপনার প্রতি আমি অনুগত হইয়াছি, আপনার প্রতি ঈমান আনিয়াছি এবং আপনার উপরই তাওয়াক্কুল করিয়াছি, আপনার দিকেই রুজু করিয়াছি, আপনার জন্যই আপনার শক্ৰদের সহিত বিবাদ করিয়াছি এবং আপনারই নিকট বিচার প্রার্থনা করিয়াছি, তাই আমাকে ক্ষমা করিয়া দিন- আমার পূর্বের ও পরের পাপসমূহ, আমার গোপন ও প্রকাশ্যে কৃত অপরাধসমূহ। আপনিই আমার মা’বুদ আপনি ব্যতীত অন্য কোন মা’বুদ নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 503
			}
		},
		{
			"hadithnumber": 504,
			"arabicnumber": 504,
			"text": "রেওয়ায়ত ৩৫. আবদুল্লাহ্ ইবন জাবির ইবন আতিক (রহঃ) বলেনঃ আমাদের নিকট আবদুল্লাহ ইবন উমর (রাঃ) আসিলেন বনু মুআবিয়াতে— ইহা আনসারগণ আধুষিত একটি লোকালয়। তিনি বলিলেন, তোমাদের মসজিদের কোন স্থানে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নামায পড়িয়াছেন, তোমরা তাহা অবগত আছ কি? আমি তাহাকে বলিলামঃ হ্যাঁ এবং সেই মসজিদের এক কিনারার দিকে ইশারা করিলাম। তারপর তিনি আমাকে বলিলেনঃ তুমি জান কি সেই তিনটি দু'আ কি ছিল যাহা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেই স্থানে করিয়াছিলেন? আমি বললামঃ হ্যাঁ। তিনি বলিলেন, তবে আমাকে সেই দু'আগুলির খবর দাও। অতঃপর আমি বলিলামঃ তিনি দু'আ করিয়াছেন- (১) যেন তাহাদের উপর অমুসলিম শত্রুকে বিজয়ী না করা হয়। (২) আর দুর্ভিক্ষ দ্বারা যেন তাহাদিগকে ধ্বংস করা না হয়। এই দুইটি তাহাকে প্রদান করা হইয়াছে। তিনি আরও দু'আ করিয়াছেন, (৩) তাহাদের ধ্বংস তাহাদের পরস্পরের হানাহানি দ্বারা যেন না হয়। কিন্তু তাহার এই দুআ মঞ্জুর করা হয় নাই। তিনি বলিলেনঃ তুমি ঠিক বলিয়াছ। আবদুল্লাহ্ (রাঃ) বললেনঃ তবে পরস্পরের কলহ বরাবর থাকিবে কিয়ামত দিবস পর্যন্ত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 504
			}
		},
		{
			"hadithnumber": 505,
			"arabicnumber": 505,
			"text": "রেওয়ায়ত ৩৬. যায়দ ইবন আসলাম (রহঃ) হইতে বর্ণিত, যে কোন ব্যক্তি দুআ করে, সে তিনটির একটি অবশ্যই পাইবে; হয় তো তাহার দু'আ কবুল করা হইবে, অথবা প্রার্থিত বস্তু তাহার জন্য সঞ্চিত রাখা হইবে, অথবা এই দুআ তাহার গুনাহের কাফফারা হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 505
			}
		},
		{
			"hadithnumber": 506,
			"arabicnumber": 506,
			"text": "রেওয়ায়ত ৩৭. আবদুল্লাহ্ ইবনে দীনার (রহঃ) বলেন, আবদুল্লাহ্ ইবনে উমর (রাঃ) আমাকে দেখিলেন যখন আমি দুআ করিতেছিলাম এবং ইশারা করিতেছিলাম দুই আঙুল দ্বারা, (প্রতি হাতের এক আঙুল দিয়া)। তিনি এরূপ করিতে আমাকে নিষেধ করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 506
			}
		},
		{
			"hadithnumber": 507,
			"arabicnumber": 507,
			"text": "রেওয়ায়ত ৩৮. সাঈদ ইবনে মুসায়্যাব (রহঃ) বলতেন- নিঃসন্দেহে লোকের দরজা বুলন্দ করা হয় তাহার মৃত্যুর পর তাহার সন্তানের দু'আর কারণে। আর তিনি তাহার হাত দ্বারা আসমানের দিকে ইশারা করিয়া উভয় হাত উপরে উঠাইলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 507
			}
		},
		{
			"hadithnumber": 508,
			"arabicnumber": 508,
			"text": "রেওয়ায়ত ৩৯. হিশাম ইবনে উরওয়াহ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন যে, তিনি বলিয়াছেন- (وَلاَ تَجْهَرْ بِصَلاَتِكَ وَلاَ تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذَلِكَ سَبِيلاً‏) [সূরা ইসরাঃ ১১০] আয়াতটি দুয়া সম্মন্ধেই নাযিল করা হইয়াছে। ইয়াহইয়া (রহঃ) বলেন- মালিক (রহঃ)-কে ফরয নামাযে দু'আ পাঠ সম্পর্কে প্রশ্ন করা হয়। তিনি বলেন, ফরয নামাযে দুআ করাতে কোন ক্ষতি নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 508
			}
		},
		{
			"hadithnumber": 509,
			"arabicnumber": 509,
			"text": "রেওয়ায়ত ৪০. মালিক (রহঃ) বলেনঃ তাহার নিকট খবর পৌছিয়াছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুআ করিতেন ও বলিতেনঃ اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ وَتَرْكَ الْمُنْكَرَاتِ وَحُبَّ الْمَسَاكِينِ وَإِذَا أَرَدْتَ فِي النَّاسِ فِتْنَةً فَاقْبِضْنِي إِلَيْكَ غَيْرَ مَفْتُونٍ অর্থাৎ, হে প্ৰভু! আমি যেন ভাল কাজ করি ও মঙ্গকে পরিত্যাগ করিতে পারি এবং মিসকিনদের ভালবাসিতে পারি, সেই তওফিক আপনার নিকট হইতে সাওয়াল করিতেছি, আর যখন লোকদিগকে পরীক্ষায় ফেলিতে ইচ্ছা করেন তখন আমাকে গোলযোগমুক্ত অবস্থায় আপনার নিকট গ্রহণ করিয়া লইবেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 509
			}
		},
		{
			"hadithnumber": 510,
			"arabicnumber": 510,
			"text": "রেওয়ায়ত ৪১. মালিক (রহঃ) বলেনঃ তাহার নিকট খবর পৌছিয়াছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফরমাইয়াছেনঃ যেকোন আহবানকারী হিদায়াতের দিকে আহবান করিবে তবে তাহাকে তাহার অনুসরণকারীদের সমান পুণ্য দেওয়া হইবে। অনুসরণকারীদের পুণ্য হইতে বিন্দুমাত্র কম করা হইবে না। আর যেকোন আহবানকারী পথভ্রষ্টতার দিকে আহবান করিবে, তবে তাহার উপর অনুসরণকারীদের পাপসমূহের সমান পাপ বৰ্তাইবে। তাহাতে অনুসরণকারীদের পাপসমূহের এতটুকুও কম করা হইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 510
			}
		},
		{
			"hadithnumber": 511,
			"arabicnumber": 511,
			"text": "রেওয়ায়ত ৪২. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, আবদুল্লাহ্ ইবন উমর (রাঃ) দুআ করিয়াছেন, (اللَّهُمَّ اجْعَلْنِي مِنْ أَئِمَّةِ الْمُتَّقِينَ) অর্থাৎ হে প্ৰভু! আমাকে আদর্শ মুত্তাকিনদের অন্তর্ভুক্ত কর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 511
			}
		},
		{
			"hadithnumber": 512,
			"arabicnumber": 512,
			"text": "রেওয়ায়ত ৪৩. মালিক (রহঃ) বলেনঃ তাহার নিকট খবর পৌছিয়াছে যে, আবুদ্দারদা (রাঃ) যখন মধ্যরাত্রে নামাযে দাঁড়াইতেন তখন বলিতেনঃ (نَامَتِ الْعُيُونُ وَغَارَتِ النُّجُومُ وَأَنْتَ الْحَىُّ الْقَيُّومُ) অর্থাৎ চক্ষুসমূহ ঘুমাইয়াছে, নক্ষত্ররাজি অস্ত গিয়াছে এবং তুমি চিরঞ্জীব, চিরন্তন, স্বাধিষ্ঠ ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 512
			}
		},
		{
			"hadithnumber": 513,
			"arabicnumber": 513,
			"text": "রেওয়ায়ত ৪৪. আবদুল্লাহ্ সুনাবিহি (রাঃ) হইতে বর্ণিত- রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, নিশ্চয়ই সূর্য উদিত হয় এবং উহার সাথে শয়তানের শিং থাকে। অতঃপর যখন সূর্য উর্ধ্বে উঠে তখন শিং সূর্য হইতে পৃথক হইয়া যায়। ইহার পর সূর্য যখন বরাবর হয়, তখন উহা শয়তানের শিং-এর সহিত মিলিত হয়। ইহার পর যখন সূর্য হেলিয়া যায়, তখন উহা পৃথক হইয়া যায়। সূর্য যখন অস্তমিত হওয়ার সময় হয়, তখন উহা সূর্যের সহিত মিলিত হয়। অতঃপর যখন অস্তমিত হয়, তখন উহাকে ছাড়িয়া দেয়। এই সময়গুলিতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নামায পড়িতে নিষেধ করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 513
			}
		},
		{
			"hadithnumber": 514,
			"arabicnumber": 514,
			"text": "রেওয়ায়ত ৪৫. হিশাম ইবনে উরওয়াহ্ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, যখন সূর্যের উপর দিকের অংশ উদিত হয় তখন তোমরা নামায বিলম্বে পড়িও, সূর্য পরিষ্কারভাবে ওঠা পর্যন্ত। আর যখন সূর্য অস্ত যায় তখন নামাযকে পিছাইয়া দাও উহা অদৃশ্য হওয়া পর্যন্ত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 514
			}
		},
		{
			"hadithnumber": 515,
			"arabicnumber": 515,
			"text": "রেওয়ায়ত ৪৬. আলী ইবনে আবদুর রহমান (রহঃ) বলেনঃ আমরা যোহরের পর আনাস ইবন মালিক (রাঃ)-এর নিকট প্রবেশ করিলাম, তিনি আসর পড়িতে দাঁড়াইলেন। যখন তিনি নামায সমাপ্ত করিলেন, তখন নামাযে তাড়াতাড়ি করার বিষয় উল্লেখ করিলাম অথবা তিনি উল্লেখ করিলেন। অতঃপর তিনি বলিলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলিতে শুনিয়াছি- উহা মুনাফিকদের নামায, উহা মুনাফিকদের নামায, উহা মুনাফিকদের নামায। তাহাদের একজন বসিয়া থাকে। যখন সূর্য হলুদ বর্ণের হইয়া যায় এবং উহা মিলিত হয় শয়তানের শিংয়ের সাথে। সে উঠে এবং চারটি ঠোকর মারে। উহাতে আল্লাহকে স্মরণ করে অতি অল্প।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 515
			}
		},
		{
			"hadithnumber": 516,
			"arabicnumber": 516,
			"text": "রেওয়ায়ত ৪৭. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, তোমাদের কেউ যেন সূর্য উদয়ের সময় এবং অস্ত যাওয়ার সময় নামায পড়ার ইচ্ছা না করে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 516
			}
		},
		{
			"hadithnumber": 517,
			"arabicnumber": 517,
			"text": "রেওয়ায়ত ৪৮. আবু হুরায়রা (রাঃ) হইতে বর্ণিত- রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসরের পর সূর্য অস্তমিত হওয়া পর্যন্ত নামায পড়িতে নিষেধ করিয়াছেন আর ফজরের পর সূর্য উদিত হওয়া পর্যন্ত নামায পড়িতে নিষেধ করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 517
			}
		},
		{
			"hadithnumber": 518,
			"arabicnumber": 518,
			"text": "রেওয়ায়ত ৪৯. আবদুল্লাহ্ ইবনে উমর (রাঃ) হইতে বর্ণিত- উমর ইবনে খাত্তাব (রাঃ) বলিতেনঃ তোমরা সূর্য উদয় এবং অস্ত যাওয়ার সময় তোমাদের নামায আদায় করার ইচ্ছা করিও না। কারণ শয়তান তাহার শিং দুইটি বাহির করে সূর্য উদয়ের সাথে এবং উভয়কে (শিং) অস্তমিত করে সূর্যাস্তের সাথে। আর তিনি [উমর (রাঃ)] লোকদিগকে এই (সময়) নামায পড়ার কারণে প্রহার করিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 518
			}
		},
		{
			"hadithnumber": 519,
			"arabicnumber": 519,
			"text": "রেওয়ায়ত ৫০. সায়িব ইবনে ইয়াযিদ (রহঃ) হইতে বর্ণিত- তিনি উমর ইবন খাত্তাব (রাঃ)-কে দেখিয়াছেন যে, তিনি [উমর (রাঃ)] আসরের পর নামায পড়ার কারণে মুনকাদির (রহঃ)-কে প্রহার করিতেছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 519
			}
		}
	]
}