{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"18": "Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 630,
			"arabicnumber": 630,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 630
			}
		},
		{
			"hadithnumber": 631,
			"arabicnumber": 631,
			"text": "রেওয়ায়ত ২. আবদুল্লাহ ইবনে উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ মাস উনত্রিশ দিনেরও হয়, যদি (আকাশ মেঘাচ্ছন্ন হওয়ার কারণে) তোমাদের উপর চাঁদ পর্দাবৃত করা হয়, তবে উহার জন্য দিন গণনা করিও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 631
			}
		},
		{
			"hadithnumber": 632,
			"arabicnumber": 632,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 632
			}
		},
		{
			"hadithnumber": 633,
			"arabicnumber": 633,
			"text": "রেওয়ায়ত ৪. মালিক (রহঃ) বলেনঃ তাহার নিকট খবর পৌছিয়াছে যে, উসমান ইবনে আফফান (রাঃ)-এর আমলে বিকালে চাঁদ দৃষ্ট হয়। কিন্তু উসমান (রাঃ) সন্ধ্যা হওয়া ও সূর্য অস্ত না যাওয়া পর্যন্ত ইফতার করেন নাই। ইয়াহইয়া (রহঃ) বলেনঃ আমি মালিক (রহঃ)-কে বলিতে শুনিয়াছি, যে ব্যক্তি রমযানের চাঁদ একাই দেখিয়াছে সে নিজে রোযা রাখিবে, তাহার জন্য রোযা ভঙ্গ করা সমীচীন নহে। কারণ সে জানে যে, উহা রমযান মাস। আর যে শাওয়ালের চাঁদ একা দেখিয়াছে, সে রোযা ভঙ্গ করিবে না, কারণ লোকে (এই বলিয়া) অপবাদ দিবে যে, আমাদের একজন রোযা রাখে নাই। পক্ষাত্তরে যাহারা নির্ভরযোগ্য নহে তেমন ব্যক্তিদের খেয়াল হইলে তবে তাহারা বলিবে, আমরা অবশ্য চাঁদ দেখিয়াছি। আর যে ব্যক্তি দিনে শাওয়ালের চাঁদ দেখিতে পায়, সে রোযা ইফতার করিবে না বরং সেই দিনের রোযা পূর্ণ করিবে, কারণ উহা আগামী রাতের চাঁদ। ইয়াহইয়া (রহঃ) বলেনঃ আমি মালিক (রহঃ)-কে বলিতে শুনিয়াছি, যদি লোকে ঈদের দিন রোযা রাখে এবং তাহারা উহাকে রোযার দিন বলিয়া মনে করে, তৎপর একজন বিশ্বস্ত লোক আসিয়া তাহাদিগকে বলে, রমযানের চাঁদ তাহাদের রোযার একদিন পূর্বে দেখা গিয়াছে, আর তাহদের এই দিবস হইতেছে একত্রিশের, তবে যেই মুহুর্তে তাহদের নিকট খবর পৌছে সেই মুহুর্তেই তাহারা রোযা ভাঙিয়া ফেলিবে। অবশ্য তাহারা সেই খবর সূর্য হেলিবার পর পাইলে সেই দিন তাহারা ঈদের নামায পড়িবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 633
			}
		},
		{
			"hadithnumber": 634,
			"arabicnumber": 634,
			"text": "রেওয়ায়ত ৫. নাফি' (রহঃ) হইতে বর্ণিত- আবদুল্লাহ ইবন উমর (রাঃ) বলিতেনঃ যে ফজরের পূর্বে নিয়ত করে নাই, সে রোষা রাখিবে না। ইবন শিহাব (রহঃ) কর্তৃক নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) ও হাফসা (রাঃ) হইতে অনুরূপ (মত) বর্ণনা করা হইয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 634
			}
		},
		{
			"hadithnumber": 635,
			"arabicnumber": 635,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 635
			}
		},
		{
			"hadithnumber": 636,
			"arabicnumber": 636,
			"text": "রেওয়ায়ত ৬. সাহল ইবন সা'দ সাঈদী (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ সর্বদা লোক মঙ্গলের উপর থাকিবে যতদিন ইফতার সত্বর করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 636
			}
		},
		{
			"hadithnumber": 637,
			"arabicnumber": 637,
			"text": "রেওয়ায়ত ৭. সাঈদ ইবন মুসায়্যাব (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ মানুষ সর্বদা মঙ্গলের উপর প্রতিষ্ঠিত থাকিবে যতদিন ইফতার সত্বর করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 637
			}
		},
		{
			"hadithnumber": 638,
			"arabicnumber": 638,
			"text": "রেওয়ায়ত ৮. হুমায়দ ইবন আবদুর রহমান (রহঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) এবং উসমান ইবন আফফান (রাঃ) উভয়ে মাগরিবের নামায পড়িতেন, এমন সময় তখন তাহারা রাত্রির অন্ধকার দেখিতে পাইতেন। (আর ইহা হইত) ইফতার করার পূর্বে। অতঃপর তাহারা (উভয়ে) ইফতার করিতেন। আর ইহা হইত রমযান মাসে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 638
			}
		},
		{
			"hadithnumber": 639,
			"arabicnumber": 639,
			"text": "রেওয়ায়ত ৯. আয়েশা (রাঃ) হইতে বর্ণিত, এক ব্যক্তি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলিলঃ তখন তিনি দরজায় দণ্ডায়মান ছিলেন, আর আমি শুনিতেছিলাম, ইয়া রাসূলাল্লাহ! জানাবত অবস্থায় আমার ফজর হয় অথচ আমি রোযা রাখিতে ইচ্ছা করি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ আমারও জানাবত অবস্থায় ফজর হয়, অথচ আমি রোযা রাখিবার ইচ্ছা করি। তাই আমি গোসল করি এবং রোযা রাখি। তখন লোকটি তাহার নিকট আরয করিল, ইয়া রাসূলাল্লাহ্! আপনি অবশ্য আমাদের মত নহেন। আল্লাহ্ আপনার অতীত ও ভবিষ্যত ক্রটিসমূহ মার্জনা করিয়াছেন। ইহাতে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাগান্বিত হইলেন এবং বলিলেনঃ আল্লাহর কসম, আমি তোমাদের তুলনায় আল্লাহকে অধিক ভয় করি আর আমি তাকওয়ার বিষয়ে তোমাদের অপেক্ষা অধিক জ্ঞাত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 639
			}
		},
		{
			"hadithnumber": 640,
			"arabicnumber": 640,
			"text": "রেওয়ায়ত ১০. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা ও উম্মে সালমা (রাঃ) বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্বপ্নদোষে নহে স্ত্রী সহবাসের কারণে রমযানে জানাবত অবস্থায় ফজর হইত, অতঃপর তিনি রোযা রাখিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 640
			}
		},
		{
			"hadithnumber": 641,
			"arabicnumber": 641,
			"text": "রেওয়ায়ত ১১. আবু বকর ইবন আবদুর রহমান (রহঃ) বলেনঃ আমি ও আমার পিতা মারওয়ানের নিকট ছিলাম, মারওয়ান তখন মদীনার শাসনকর্তা। তাহার নিকট উল্লেখ করা হয় যে, আবু হুরায়রা (রাঃ) বলেন- যে ব্যক্তির জানাবত অবস্থায় ফজর হয়, তাহার সেই দিনের রোযা নষ্ট হইয়াছে। মারওয়ান বলিলেন, হে আবদুর রহমান! আমি তোমাদের কসম দিতেছি যে, তুমি অবশ্যই উম্মুল মুমিনীনদ্বয় আয়েশা (রাঃ) ও উম্মে সালমা (রাঃ)-এর নিকট গমন কর এবং এ বিষয়ে উভয়কে প্রশ্ন কর। অতঃপর আবদুর রহমান গেলেন, আমিও সঙ্গে ছিলাম। আবদুর রহমান তাহাকে সালাম জানাইলেন এবং বলিলেনঃ হে উম্মুল মুমিনীন! আমরা মারওয়ান ইবন হাকামের নিকট ছিলাম, তাহার নিকট আলোচিত হয় যে, আবু হুরায়রা (রাঃ) বলিয়াছেন- যে ব্যক্তির জানাবত অবস্থায় ফজর হইয়াছে সে সেই দিনের রোযা ভঙ্গ করিয়াছে। আয়েশা (রাঃ) বলিলেনঃ আবু হুরায়রা যেমন বলিয়াছেন, (মাসআলা) তেমন নহে। হে আবদুর রহমান! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যাহা করিয়াছেন তুমি কি উহা হইতে বিমুখ। হইতে চাও? আবদুর রহমান বলিলেনঃ না, আল্লাহর কসম, (তা হয় না)। আয়েশা (রাঃ) বলিলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ব্যাপারে সাক্ষ্য দিতেছি যে, তিনি স্বপ্লদোষে নহে, সহবাসের কারণে জানাবত অবস্থায় ফজর করিতেন। অতঃপর সেই দিনের রোযা রাখতেন। (রাবী) বলেনঃ তারপর আমরা আয়েশা (রাঃ)-এর নিকট হইতে বাহির হইলাম এবং উম্মে সালমা (রাঃ)-এর নিকট গেলাম এবং এই বিষয়ে তাহাকে প্রশ্ন করিলাম। আয়েশা (রাঃ) যেমন বলিয়াছেন তিনিও তেমন বলিলেন। অতঃপর আমরা প্রস্থান করিলাম এবং মারওয়ান ইবন হাকামের নিকট উপস্থিত হইলাম। তাহারা উভয়ে যাহা বর্ণনা করিয়াছেন আবদুর রহমান মারওয়ানের নিকট তাহা উল্লেখ করিলেন। অতঃপর মারওয়ান বলিলেনঃ আমি তোমাকে কসম দিতেছি, হে আবু মুহাম্মদ, আমার সওয়ার দরজায় (উপস্থিত) রহিয়াছে, তুমি উহার উপর সওয়ার হইয়া অবশ্যই আবু হুরায়রা (রাঃ)-এর নিকট গমন কর। তিনি তাহার (নিজস্ব) ভূমিতে আকীক নামক স্থানে অবস্থান করিতেছেন। নিশ্চয়ই এই খবরটি তাহাকে পৌছাইয়া দাও। আবদুর রহমান সওয়ার হইলেন, আমি তাহার সহিত আরোহণ করিলাম। অতঃপর আমরা আবু হুরায়রা (রাঃ)-এর নিকট আসিলাম। আবু হুরায়রা (রাঃ)-এর সহিত আবদুর রহমান কিছুক্ষণ কথা বললেন। তারপর এই বিষয়ে তাহার সহিত আলোচনা করিলেন। ইহার পর আবু হুরায়রা (রাঃ) বলিলেনঃ এই বিষয়ে আমার জানা নাই, আমাকে খবরদাতা খবর দিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 641
			}
		},
		{
			"hadithnumber": 642,
			"arabicnumber": 642,
			"text": "রেওয়ায়ত ১২. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা ও উম্মে সালমা (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্বপ্নদোষ ব্যতীত সহবাসের কারণে জানাবত অবস্থায় ফজর হইত, অতঃপর তিনি রোযা রাখতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 642
			}
		},
		{
			"hadithnumber": 643,
			"arabicnumber": 643,
			"text": "রেওয়ায়ত ১৩. আতা ইবন ইয়াসার (রহঃ) হইতে বর্ণিত, এক ব্যক্তি রমযান মাসে রোযা অবস্থায় তাহার স্ত্রীকে চুমু খাইলেন এবং ইহাতে খুবই অনুতপ্ত হইলেন। অতঃপর এই বিষয়ে প্রশ্ন করার জন্য তাহার স্ত্রীকে পাঠাইলেন। সে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী উম্মে সালমা (রাঃ)-এর কাছে গমন করিল এবং সেই বিষয় তাহার নিকট উল্লেখ করিল। উম্মে সালমা (রাঃ) তাহাকে বলিলেনঃ রোযা অবস্থায় রাসূলুল্লাহ সাল্লাল্লাহ আলাইহি ওয়াসাল্লাম-ও চুমা দিয়া থাকেন। সে তাহার স্বামীর নিকট প্রত্যাবর্তন করিয়া এই খবর তাহাকে জানাইল। কিন্তু তাহার পেরেশানী আরো বৃদ্ধি পাইল। তিনি বলিলেনঃ আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মত নহি। আল্লাহ্ তাহার রসূলের জন্য যাহা ইচ্ছা হালাল করেন। তারপর তাহার স্ত্রী পুনরায় উম্মে সালমা (রাঃ)-এর নিকট গমন করিল। (এইবার) উম্মে সালমা (রাঃ)-এর নিকট রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে পাইল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ এই স্ত্রীলোকটির ব্যাপার কি? উম্মে সালমা (রাঃ) তাহাকে বিষয়টি জানাইলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ আমিও উহা করি, তুমি এই স্ত্রীলোককে এই খবর দাও নাই কেন? উম্মে সালমা (রাঃ) বলিলেন, আমি তাহাকে এই খবর দিয়াছি। অতঃপর তাহার স্বামীর নিকট গিয়া সেই খবর বলিয়াছে। ইহাতে তাহার চিন্তা আরো বৃদ্ধি পাইয়াছে এবং তিনি বলিয়াছেনঃ আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মত নহি। আল্লাহ্ তাহার রসূলের জন্য যাহা ইচ্ছা হালাল করেন। ইহা শুনিয়া রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাগান্বিত হইলেন এবং বলিলেনঃ আমি অবশ্য তোমাদের অপেক্ষা আল্লাহকে অধিক ভয় করি এবং তাহার সীমানাসমূহকে তোমাদের অপেক্ষা অধিক জানি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 643
			}
		},
		{
			"hadithnumber": 644,
			"arabicnumber": 644,
			"text": "রেওয়ায়ত ১৪. উম্মুল মু'মিনীন আয়েশা (রাঃ) বলিয়াছেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহার কোন এক সহধর্মিণীকে চুমু খাইতেন, অথচ তিনি রোযাদার। তারপর তিনি হাসিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 644
			}
		},
		{
			"hadithnumber": 645,
			"arabicnumber": 645,
			"text": "রেওয়ায়ত ১৫. উমর ইবন খাত্তাব (রাঃ)-এর স্ত্রী আতিকা বিনত সাঈদ (রাঃ) উমর ইবন খাত্তাব (রাঃ)-এর মাথায় চুমু খাইতেন, অথচ তিনি রোযাদার। তবুও তিনি তাহাকে নিষেধ করিতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 645
			}
		},
		{
			"hadithnumber": 646,
			"arabicnumber": 646,
			"text": "রেওয়ায়ত ১৬. আয়েশা বিনত তালহা (রহঃ) বলেন- তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ)-এর নিকট ছিলেন। সেখানে তাহার স্বামী প্রবেশ করিলেন। তিনি হইলেন আবদুল্লাহ ইবন আবদুর রহমান ইবন আবু বকর সিদ্দীক (রাঃ)। তিনি রোযাদার ছিলেন। আয়েশা (রাঃ) তাহাকে বলিলেন, তোমাকে তোমার পরিবারের নিকট যাইতে এবং তাহাকে চুমু খাইতে ও তাহার সহিত খেল-তামাশা করিতে কিসে বাধা দিয়াছে? তিনি বলিলেন, আমি তাহাকে চুমু খাই কিরূপে, আমি যে রোযাদার। তিনি [আয়েশা (রাঃ)] বলেন, হ্যাঁ (রোযাদার হইয়াও তাহা করিতে পার)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 646
			}
		},
		{
			"hadithnumber": 647,
			"arabicnumber": 647,
			"text": "রেওয়ায়ত ১৭. আবু হুরায়রা ও সা'দ ইবন আবি ওয়াক্কাস (রাঃ) রোযাদারের জন্য চুমু খাওয়ার অনুমতি দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 647
			}
		},
		{
			"hadithnumber": 648,
			"arabicnumber": 648,
			"text": "রেওয়ায়ত ১৮. মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌছিয়াছে যে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) যখন উল্লেখ করিতেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুমু খাইতেন, তখন [তিনি আয়েশা (রাঃ)] বলিতেন, তোমাদের চাইতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অধিক ক্ষমতা রাখেন নিজের নফসের উপর। উরওয়াহ ইবন যুবায়র (রহঃ) বলেনঃ রোযাদারের জন্য চুমু খাওয়া কোন মঙ্গলের দিকে আহবান করে বলিয়া আমি মনে করি না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 648
			}
		},
		{
			"hadithnumber": 649,
			"arabicnumber": 649,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 649
			}
		},
		{
			"hadithnumber": 650,
			"arabicnumber": 650,
			"text": "রেওয়ায়ত ১৯. আবদুল্লাহ ইবন আব্বাস (রাঃ)-কে রোযাদারের চুমু খাওয়ার বিষয় প্রশ্ন করা হয়। তিনি বৃদ্ধের জন্য অনুমতি দেন। আর যুবকের জন্য মাকরূহ বলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 650
			}
		},
		{
			"hadithnumber": 651,
			"arabicnumber": 651,
			"text": "রেওয়ায়ত ২০. আবদুল্লাহ ইবন উমর (রাঃ) রোযাদারের জন্য চুমু খাওয়া এবং স্ত্রীর সহিত মিলিত হওয়াকে নিষেধ করিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 651
			}
		},
		{
			"hadithnumber": 652,
			"arabicnumber": 652,
			"text": "রেওয়ায়ত ২১. আবদুল্লাহ ইবন আব্বাস (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা বিজয় বৎসরে রমযান মাসে মক্কার দিকে সফরে বাহির হইলেন এবং রোযা রাখিলেন। কাদীদ নামক স্থানে পৌছিলে পর তিনি রোযা ভঙ্গ করিলেন এবং তাহার সাথে অন্যরাও রোযা ভঙ্গ করিলেন। আর তাহারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হুকুম হইতে যাহা সদ্য অতঃপর যাহা অতি সদ্য তাহা গ্রহণ করিতেন। (অর্থাৎ যে কোন নূতন হুকুম পাওয়া বা শোনামাত্রই গ্রহণ করিতেন)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 652
			}
		},
		{
			"hadithnumber": 653,
			"arabicnumber": 653,
			"text": "রেওয়ায়ত ২২. রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জনৈক সাহাবী হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিজয় বৎসর তাহার সফরে সাহাবীগণকে রোযা খুলিতে নির্দেশ দিলেন এবং বলিলেন, তোমরা তোমাদের শত্রুদের জন্য শক্তি সঞ্চয় কর, আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজে রোযা রাখিলেন। আবু বকর ইবন আবদুর রহমান (রহঃ) বলেনঃ যে ব্যক্তি আমার নিকট হাদীস বর্ণনা করিয়াছেন তিনি বলিয়াছেনঃ আমি আরজ নামক স্থানে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে নিজের মাথায় পানি ঢালিতে দেখিয়াছি, পিপাসায় অথবা প্রচণ্ড গরমের কারণে। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলা হইল, আপনি রোযা রাখিয়াছেন বলিয়া একদল লোক (এখনও) রোযা রাখিয়াছে। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কাদীদে পৌছিলেন, তখন তিনি পেয়ালা চাহিলেন এবং (পানি অথবা দুধ) পান করিলেন, তারপর সাহাবীগণ রোযা ভঙ্গ করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 653
			}
		},
		{
			"hadithnumber": 654,
			"arabicnumber": 654,
			"text": "রেওয়ায়ত ২৩. আনাস ইবন মালিক (রাঃ) বলেনঃ আমরা রমযানে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে সফর করিয়াছি। অতঃপর কোন রোযাদার রোযাভঙ্গকারীর উপর দোষারোপ করেন নাই এবং কোন রোযাভঙ্গকারীও কোন রোযাদারের উপর দোষারোপ করেন নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 654
			}
		},
		{
			"hadithnumber": 655,
			"arabicnumber": 655,
			"text": "রেওয়ায়ত ২৪. হামযা ইবন আমর আসলামী (রাঃ) রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট বলিলেনঃ ইয়া রাসূলাল্লাহ! আমি প্রায়ই রোযা রাখি। আমি কি সফরে রোযা রাখিব? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁহাকে বলিলেনঃ তুমি ইচ্ছা করিলে রোযা রাখ, আর ইচ্ছা করিলে রোযা ছাড়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 655
			}
		},
		{
			"hadithnumber": 656,
			"arabicnumber": 656,
			"text": "রেওয়ায়ত ২৫. নাফি (রহঃ) হইতে বর্ণিত- আবদুল্লাহ ইবন উমর (রাঃ) রমযানে প্রবাসে রোযা রাখতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 656
			}
		},
		{
			"hadithnumber": 657,
			"arabicnumber": 657,
			"text": "রেওয়ায়ত ২৬. হিশাম ইবন উরওয়াহ (রহঃ) বলেনঃ উরওয়াহ (রহঃ) রমযানে সফর করিতেন, আমরাও তাহার সাথে সফর করিতাম। অতঃপর উরওয়াহ (রহঃ) রোযা রাখিতেন কিন্তু আমরা রোযা রাখিতাম না, তিনি আমাদিগকে রোযা রাখিতে বলিতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 657
			}
		},
		{
			"hadithnumber": 658,
			"arabicnumber": 658,
			"text": "রেওয়ায়ত ২৭. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে, উমর ইবন খাত্তাব (রাঃ) রমযানে যদি সফরে থাকিতেন, তবে তিনি যদি জানিতেন যে, তিনি মদীনায় দিনের প্রথম দিকে প্রবেশ করিবেন, তবে তিনি রোযা অবস্থায় (মদীনায়) প্রবেশ করিতেন। মালিক (রহঃ) বলেনঃ যে ব্যক্তি রমযানে সফরে থাকে অতঃপর জানিতে পারে যে, সে নিজের পরিজনের মধ্যে দিনের প্রথমদিকে প্রবেশ করিবে এবং প্রবেশ করার পূর্বে ফজর হয়, তবে সে রোযা অবস্থায় প্রবেশ করিবে। মালিক (রহঃ) বলেনঃ আর যে ব্যক্তি রমযানে সফরে বাহির হইতে ইচ্ছা করে এবং স্বীয় (আবাস) ভূমিতে থাকিতেই ফজর হয়, তাহার বাহির হওয়ার পূর্বে সেই দিনের রোযা রাখিবে। মালিক (রহঃ) বলেনঃ যে ব্যক্তি রোযা না রাখা অবস্থায় সফর হইতে ফিরিয়াছে, আর তাহার স্ত্রীও রোযা রাখে নাই (ঋতুমতী বলিয়া), এখন রমযানের মধ্যে ঋতু হইতে পাক হইয়াছে, তবে তাহার স্বামী ইচ্ছা করিলে (রোযার দিনে) তাহার সহিত সহবাস করিতে পারে (কারণ উভয়ে রোযা অবস্থায় নহে)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 658
			}
		},
		{
			"hadithnumber": 659,
			"arabicnumber": 659,
			"text": "রেওয়ায়ত ২৮. আবু হুরায়রা (রাঃ) হইতে বর্ণিত- এক ব্যক্তি রমযানের রোযা ভঙ্গ করিয়াছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাকে একটি ক্রীতদাস আযাদ করার নির্দেশ দিলেন অথবা একনাগাড়ে দুই মাস রোযা রাখার অথবা ষাটজন মিসকিনকে আহার দেওয়ার জন্য বলিলেন। লোকটি বলিলঃ আমি সামর্থ রাখি না। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এক টুকরি খেজুর আনা হয়। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন ইহা গ্রহণ কর এবং সদকা কর। লোকটি বলিলঃ ইয়া রাসূলাল্লাহ! আমা হইতে অধিক মুহতাজ আমি পাই না। (এই কথা শুনিয়া) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাসিলেন, এমনকি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনের দন্ত মুবারক প্রকাশিত হইল। অতঃপর বলিলেনঃ ইহা তুমি খাও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 659
			}
		},
		{
			"hadithnumber": 660,
			"arabicnumber": 660,
			"text": "রেওয়ায়ত ২৯. সাঈদ ইবন মুসায়্যাব (রহঃ) হইতে বর্ণিত, জনৈক বেদুঈন বুক চাপড়াইতে চাপড়াইতে এবং চুল টানিতে টানিতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আসিল। সে বলিতেছিলঃ (পুণ্য হইতে) দূরবর্তী ধ্বংস হইয়াছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ সে কি? সে বলিলঃ আমি স্ত্রীর সহিত রমযানে সহবাস করিয়াছি অথচ আমি রোযাদার। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (ইহা শুনিয়া) বলিলেনঃ তুমি একটি গোলাম আযাদ করার শক্তি রাখ কি? সে বলিলঃ না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ একটি উট হাদয় স্বরূপ পাঠাইবার সামর্থ রাখ কি? সে বলিলঃ না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ তুমি বস। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এক টুকরি খেজুর আনা হইল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ ইহা লও এবং সদকা কর। লোকটি বলিলঃ ইয়া রাসূলাল্লাহ্! আমা অপেক্ষা অধিক মুহতাজ কাহাকেও আমি পাই না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ ইহা তুমি খাও এবং স্ত্রী সহবাসের কাফফারাস্বরূপ একদিন রোযা রাখ। মালিক (রহঃ) বলেন, আতা খোরাসানী (রহঃ) বলিয়াছেনঃ আমি সাঈদ ইবন মুসায়্যাব (রহঃ)-কে প্রশ্ন করিলাম, সেই টুকরিতে কত খেজুর ছিল? তিনি বলিলেনঃ পনের ছা’ হইতে বিশ ছা’ পর্যন্ত।[1]ইয়াহইয়া (রহঃ) বলেন- মালিক (রহঃ) বলিয়াছেনঃ আমি আহলে ইলমকে (বিজ্ঞ উলামা) বলিতে শুনিয়াছি, যে ব্যক্তি রমযানের কাযা (করিতে গিয়া) দিনে তাহার স্ত্রীর সহিত সহবাস অথবা অন্য কারণে রোযা ভঙ্গ করিয়া ফেলে, তাহার উপর কাফফারা (ওয়াজিব) হইবে না। যে কাফফারার কথা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হইতে বর্ণিত হইয়াছে, উহা সেই ব্যক্তি সম্বন্ধে যে ব্যক্তি রমযান মাসে আপন স্ত্রীর সহিত দিনে সহবাস করিয়াছে। অবশ্য সেই ব্যক্তির উপর সেই দিনের কাযা (ওয়াজিব) হইবে। মালিক (রহঃ) বলেনঃ ইহাই সর্বাপেক্ষা পছন্দনীয় যাহা আমি এই ব্যাপারে শুনিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 660
			}
		},
		{
			"hadithnumber": 661,
			"arabicnumber": 661,
			"text": "রেওয়ায়ত ৩০. নাফি' (রহঃ) বলেনঃ আবদুল্লাহ ইবন উমর (রাঃ) সিঙ্গি লাগাইতেন অথচ তিনি রোযাদার। তিনি বলেনঃ অতঃপর তিনি উহা ছাড়িয়া দেন। তৎপর তিনি যখন রোযা রাখিতেন, ইফতার না করা পর্যন্ত সিঙ্গি লাগাইতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 661
			}
		},
		{
			"hadithnumber": 662,
			"arabicnumber": 662,
			"text": "রেওয়ায়ত ৩১. ইবন শিহাব (রহঃ) হইতে বর্ণিত, সা'দ ইবন আবি ওয়াক্কাস ও আবদুল্লাহ ইবন উমর (রাঃ) উভয়ে সিঙ্গি লাগাইতেন অথচ তাহারা রোযাদার।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 662
			}
		},
		{
			"hadithnumber": 663,
			"arabicnumber": 663,
			"text": "রেওয়ায়ত ৩২. হিশাম ইবন উরওয়াহ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন যে, তিনি সিঙ্গি লাগাইতেন অথচ তিনি রোযাদার। অতঃপর এই কারণে রোযা ভঙ্গ করিতেন না। হিশাম বলেন, আমি তাহাকে রোযাদার অবস্থা ছাড়া কখনো সিঙ্গি লাগাইতে দেখি নাই। মালিক (রহঃ) বলেনঃ রোযাদারের সিঙ্গি লাগান মাকরূহ নহে কিন্তু দুর্বল হইয়া পড়ার ভয় হইলে মাকরূহ, দুর্বল না হইলে ইহা মাকরূহ হইবে না। আর যদি কোন ব্যক্তি রমযানে সিঙ্গি লাগায়, অতঃপর রোযা ভঙ্গ করা হইতে বিরত থাকে, আমি তাহার জন্য কোন কিছু (লাগিবে বলিয়া) মনে করি না এবং যেদিন সিঙ্গি লাগাইয়াছে সেই দিনের রোযা কাযা করার হুকুমও করি না। কেননা রোযার ক্ষতির আশংকায় রোযাদারের জন্য সিঙ্গি লাগান মাকরূহ করা হইয়াছে। ফলে যে ব্যক্তি লাগাইয়াছে, সন্ধ্যা পর্যন্ত রোযা ইফতার করা হইতে বিরত রহিয়াছে আমি তাহার জন্য কোন দোষ মনে করি না এবং তাহার উপর সেই দিনের (রোযার) কাযাও প্রয়োজন হইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 663
			}
		},
		{
			"hadithnumber": 664,
			"arabicnumber": 664,
			"text": "রেওয়ায়ত ৩৩. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলেনঃ আশুরা দিবস এমন একটি দিবস ছিল, যেই দিবসে জাহিলিয়া যুগে কুরাইশগণ রোযা রাখিত। জাহিলিয়া যুগে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও সেই দিবসে রোযা রাখতেন। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদীনায় আসিলে পর তিনি সেই রোযা রাখলেন এবং লোকদিগকেও সেই দিনের রোযা রাখতে হুকুম করিলেন। অতঃপর যখন রমযানের রোযা ফরয হইল, উহাই ফরয হিসাবে রহিল। আশুরা দিবসের রোযা ছাড়িয়া দেওয়া হইল। অতঃপর যে ইচ্ছা করিত ঐ দিবসে রোযা রাখিত, আর যে ইচ্ছা করিত না সে উহা ছাড়িয়া দিত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 664
			}
		},
		{
			"hadithnumber": 665,
			"arabicnumber": 665,
			"text": "রেওয়ায়ত ৩৪. হুমায়দ ইবন আবদুর রহমান ইবন আউফ (রহঃ) হইতে বর্ণিত, তিনি হজ্জের সালে[1] আশুরা দিবসে মুয়াবিয়া ইবন আবু সুফইয়ান (রাঃ)-কে মিম্বরের উপর বলিতে শুনিয়াছেন, হে মদীনাবাসী! তোমাদের আলিমগণ কোথায়? আমি এই দিবস সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলিতে শুনিয়াছি ইহা আশুরা দিবস; তোমাদের উপর এই (দিবসের) রোযা ফরয করা হয় নাই। আমি রোযা রাখিয়াছি, তোমরা যে ইচ্ছা কর রোযা রাখিতে পার, আর যাহার ইচ্ছা রোযা ছাড়িয়া দাও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 665
			}
		},
		{
			"hadithnumber": 666,
			"arabicnumber": 666,
			"text": "রেওয়ায়ত ৩৫. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, উমর ইবন খাত্তাব (রাঃ) হারিস ইবন হিশাম (রাঃ)-এর নিকট খবর পাঠাইয়াছেন, কাল আশুরা দিবস, তুমি নিজেও রোযা রাখ এবং পরিবার-পরিজনকেও রোযা রাখিতে বল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 666
			}
		},
		{
			"hadithnumber": 667,
			"arabicnumber": 667,
			"text": "রেওয়ায়ত ৩৬. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুই দিবসে রোযা নিষেধ করিয়াছেন- ঈদুল ফিতর ও ঈদুল আযহার দিন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 667
			}
		},
		{
			"hadithnumber": 668,
			"arabicnumber": 668,
			"text": "রেওয়ায়ত ৩৭. মালিক (রহঃ) বলেনঃ তিনি আহলে ইলমকে (বিজ্ঞ উলামা) বলিতে শুনিয়াছেন, সর্বদা রোযা রাখতে কোন দোষ নাই, যদি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে দিবসে রোযা রাখিতে নিষেধ করিয়াছেন সেই সব দিবসে রোযা রাখা হইতে বিরত থাকে। আর সেই সব দিবস হইল- মিনা-এর দিনগুলি, ফিতর ও আযহা দিবস। আমাদের নিকট এই বিষয়ে যাহা পৌছিয়াছে এবং এই ব্যাপারে আমি যাহা শুনিয়াছি তন্মধ্যে ইহা হইতেছে সর্বাপেক্ষা আমার পছন্দনীয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 668
			}
		},
		{
			"hadithnumber": 669,
			"arabicnumber": 669,
			"text": "রেওয়ায়ত ৩৮. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত-রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অনবরত রাত্রেও কিছু না খাইয়া রেযা রাখিতে নিষেধ করিয়াছেন। সাহাবীগণ বললেন, ইয়া রাসূলাল্লাহ! আপনি যে অনবরত রোযা রাখেন! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ আমি অবশ্য তোমাদের মত নহি। আমাকে আহার ও পানীয় দেওয়া হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 669
			}
		},
		{
			"hadithnumber": 670,
			"arabicnumber": 670,
			"text": "রেওয়ায়ত ৩৯. আবু হুরায়রা (রাঃ) হইতে বর্ণিত- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ তোমরা অনবরত রোযা রাখা হইতে নিজদিগকে বাঁচাও। তোমরা অনবরত রোযা রাখা হইতে নিজদিগকে বাঁচাও। সাহাবীগণ বলিলেনঃ ইয়া রাসূলাল্লাহ! তবে আপনি যে অনবরত রোযা রাখেন! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ আমি তোমাদের মত নহি। আমি রাত্রি যাপন করি (এই অবস্থায়) যে, আমার প্রভু আমাকে আহার দান করেন এবং পানীয় দান করেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 670
			}
		},
		{
			"hadithnumber": 671,
			"arabicnumber": 671,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 671
			}
		},
		{
			"hadithnumber": 672,
			"arabicnumber": 672,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 672
			}
		},
		{
			"hadithnumber": 673,
			"arabicnumber": 673,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 673
			}
		},
		{
			"hadithnumber": 674,
			"arabicnumber": 674,
			"text": "রেওয়ায়ত ৪৪. খালিদ ইবন আসলাম (রহঃ) বর্ণনা করেন- উমর ইবন খাত্তাব (রাঃ) রমযান মাসে মেঘাচ্ছন্ন এক দিনে ইফতার করিলেন। তিনি মনে করিলেন যে, সন্ধ্যা হইয়াছে এবং সূর্য ডুবিয়াছে। অতঃপর এক ব্যক্তি আসিয়া বলিলঃ হে আমিরুল মুমিনীন সূর্য উদিত হইয়াছে। উমর ইবন খাত্তাব (রাঃ) বললেনঃ বিষয়টির সমাধান সহজ, আমরা যথাসাধ্য চেষ্টা করিয়াছি। মালিক (রহঃ) বলেনঃ উমর (রাঃ) ইহার দ্বারা আমাদের মতে কাযা মুরাদ নিয়াছেন। (আল্লাহ্ সর্বজ্ঞানী) তাহার উক্তি ‘বিষয়টির সমাধান সহজ’ ইহাতে মেহনতের স্বল্পতা ও ইহা সহজ হওয়াই তিনি বুঝাইতে চাহিয়াছেন। তিনি বলেনঃ ইহার পরিবর্তে আর একদিন রোযা রাখিব।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 674
			}
		},
		{
			"hadithnumber": 675,
			"arabicnumber": 675,
			"text": "রেওয়ায়ত ৪৫. নাফি’ (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) বলিতেনঃ যে ব্যক্তি সফর অথবা পীড়ার কারণে রোযা রাখে নাই, সে রমযানের রোযা রাখিবে একাধারে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 675
			}
		},
		{
			"hadithnumber": 676,
			"arabicnumber": 676,
			"text": "রেওয়ায়ত ৪৬. ইবন শিহাব (রহঃ) হইতে বর্ণিত-আবদুল্লাহ ইবন আব্বাস ও আবু হুরায়রা (রাঃ) তাহারা উভয়ে রমযানের কাযা সম্পর্কে ইখতিলাফ (মতপার্থক্য) করিয়াছেন। একজন বলিয়াছেন, কায রোযা পৃথক পৃথক রাখা হইবে। আর একজন বলিয়াছেন, পৃথক পৃথক রাখা যাইবে না (অর্থাৎ একাধারে রাখিতে হইবে)। তাঁহাদের উভয়ের মধ্যে কে বলিয়াছেন পৃথক করা যাইবে, কে বলিয়াছেন পৃথক করা যাইবে না, তাহা আমার (নির্দিষ্ট) জানা নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 676
			}
		},
		{
			"hadithnumber": 677,
			"arabicnumber": 677,
			"text": "রেওয়ায়ত ৪৭. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) বলতেনঃ যে রোযা অবস্থায় স্বেচ্ছায় বমি করে, তাহার উপর কায ওয়াজিব হইবে। আর যাহার অনিচ্ছাকৃত বমি হয়, তাহাকে করিতে হইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 677
			}
		},
		{
			"hadithnumber": 678,
			"arabicnumber": 678,
			"text": "রেওয়ায়ত ৪৮. ইয়াহইয়া ইবন সাঈদ (রহঃ) শুনিয়াছেন- সাঈদ ইবন মুসায়্যাব (রহঃ)-কে রমযানের কাযা সম্পর্কে প্রশ্ন করা হইলে তিনি বলিতেনঃ আমার নিকট পছন্দনীয় হইতেছে রমযানের কাযাকে পৃথক না করিয়া একাধারে রাখা। ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-কে আমি বলিতে শুনিয়াছি, যে ব্যক্তি রমযানের কাযা পৃথক পৃথক করিয়া রাখিয়াছে সেই ব্যক্তিকে রোযা পুনরায় রাখিতে হইবে না। সেই রোযাই তাহার পক্ষে যথেষ্ট হইবে। কিন্তু আমার নিকট একাধারে রাখাই পছন্দনীয়। ইয়াহইয়া (রহঃ) বলেনঃ আমি মালিক (রহঃ)-কে বলিতে শুনিয়াছি, যে ব্যক্তি রমযানের রোযা অথবা অন্য কোন ওয়াজিব রোযায় ভুলবশত আহার করে অথবা পান করে তাহাকে সেই দিনের পরিবর্তে অন্য একদিন কাযা করিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 678
			}
		},
		{
			"hadithnumber": 679,
			"arabicnumber": 679,
			"text": "রেওয়ায়ত ৪৯. মালিক (রহঃ) বর্ণনা করেন- হুমায়দ ইবন কায়েস মক্কী (রহঃ) বলিয়াছেন যে, আমি মুজাহিদ (রহঃ)-এর সঙ্গে ছিলাম। তিনি বায়তুল্লাহ্ তওয়াফ করিতেছিলেন। এমন সময় তাহার নিকট একজন লোক আসিল এবং কাফফারার রোযা সম্পর্কে তাহাকে জিজ্ঞাসা করিল। উহা একাধারে রাখিতে হইবে, না আলাদা আলাদা রাখিতে পরিবে? হুমায়দ (রহঃ) বলিলেনঃ ইচ্ছা করিলে আলাদা আলাদা রাখিতে পারিবে। মুজাহিদ (রহঃ) বলিলেনঃ আলাদা আলাদা রাখিবে না, কারণ উবাই ইবন কা'ব (রাঃ)-এর কিরাআতে রহিয়াছে (ثَلاَثَةِ أَيَّامٍ مُتَتَابِعَاتٍ) অর্থাৎ তিন দিন একাধারে। ইয়াহইয়া (রহঃ) বলেন- মালিক (রহঃ) বলিয়াছেনঃ আমার নিকট পছন্দনীয় হইল, আল্লাহ্ তা'আলা কুরআনে যেরূপ নির্ধারিত করিয়াছেন সেইরূপ একাধারে রোযা রাখা। ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-কে প্রশ্ন করা হইল এমন এক স্ত্রীলোক সম্পর্কে, যে স্ত্রীলোকের রমযানে ফজর হইয়াছে রোযাবস্থায়। হঠাৎ তাহার তাজা রক্ত বাহির হইল, ঋতুর নির্দিষ্ট সময় ছাড়া। অতঃপর সে লক্ষ্য রাখিবে সন্ধ্যা পর্যন্ত সেইরূপ রক্ত দেখার জন্য কিন্তু কিছুই দেখিল না। অন্য একদিন ফজরে হঠাৎ আর এক দফা রূক্ত বাহির হইল কিন্তু ইহা পূর্বের তুলনায় কম। অতঃপর কয়েক দিন তাহার হায়েযের পূর্ব পর্যন্ত উহ বন্ধ রহিল। সেই স্ত্রীলোক নিজের নামায ও রোযার বিষয়ে কি কৱিবে? ইহার উত্তরে মালিক (রহঃ) বলেন, সেই রক্ত হয়েযে গণ্য হইবে। যখন উহা দেখিবে রোযা ছাড়িয়া দিবে এবং সেই রোযা পরে কাযা করিবে। তাহার রক্ত বন্ধ হইয়া গেলে সে গোসল করিবে এবং রোযা রাখিবে। মালিক (রহঃ)-এর নিকট প্রশ্ন করা হইল এমন এক ব্যক্তি সম্পর্কে, যে ব্যক্তি রমযানের শেষ দিন মুসলিম হইল, তাহাকে রমযানের সকল রোযা করিতে হইবে কি? এবং যেদিন মুসলিম হইয়াছে সেই দিনের (রোযার) কাযা তাহার উপর ওয়াজিব হইবে কি? মালিক (রহঃ) প্রশ্নের উত্তরে বলিলেনঃ তাহাকে বিগত রোযা কাযা করতে হইবে না। সে আগামীতে রোযা আরম্ভ করিবে, যেদিন মুসলিম হইয়াছে সেই দিনের রোযা রাখাটা আমার নিকট পছন্দনীয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 679
			}
		},
		{
			"hadithnumber": 680,
			"arabicnumber": 680,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Munqar"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 680
			}
		},
		{
			"hadithnumber": 681,
			"arabicnumber": 681,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 681
			}
		},
		{
			"hadithnumber": 682,
			"arabicnumber": 682,
			"text": "রেওয়ায়ত ৫২. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, আবদুল্লাহ ইবন উমর (রাঃ)-কে গর্ভবতী স্ত্রীলোক সম্পর্কে প্রশ্ন করা হইল- সে যদি সন্তান সম্বন্ধে আশংকা করে এবং রোযা রাখা তাহার জন্য দুষ্কর হয় (তবে কি করিবে)? তিনি বলিলেনঃ সে রোযা রাখিবে না এবং প্রতিদিনের পরিবর্তে একজন মিসকিনকে আহার দিবে এক মুদ গম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুদ পরিমাপে। মালিক (রহঃ) বলিয়াছেনঃ আহলে ইলম গর্ভবতীর জন্য রোযার কাযা ওয়াজিব মনে করেন না, যেমন আল্লাহ তা'আলা বলিয়াছেন, (‏فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ‏) অর্থাৎ, তোমাদের মধ্যে কেহ পীড়িত হইলে বা সফরে থাকিলে অন্য সময় এই সংখ্যা পূর্ণ করিয়া লইতে হইবে। (বাকারাঃ ১৮৪) গর্ভবতী অবস্থাকে তাহারা রোগের মধ্যে একটি রোগ বলিয়া মনে করেন যাহার সঙ্গে রহিয়াছে সন্তানের আশংকাও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 682
			}
		},
		{
			"hadithnumber": 683,
			"arabicnumber": 683,
			"text": "রেওয়ায়ত ৫৩. আবদুর রহমান ইবন কাসিম (রহঃ) বর্ণনা করেন যে, তাহার পিতা বলিতেনঃ যাহার উপর রমযানের কাযা রহিয়াছে, সে রোযা রাখিতে সক্ষম, তবু কাযা (রোযা) রাখে নাই, এইভাবে পরবর্তী রমযান আসিয়া গিয়াছে, তবে সে প্রতিদিনের পরিবর্তে একজন মিসকিনকে এক মুদ করিয়া গম দিবে, তদুপরি তাহার উপর কাযাও জরুরী হইবে। মালিক (রহঃ) বলেনঃ সাঈদ ইবন যুবায়র (রহঃ) হইতেও অনুরূপ বর্ণনা তাহার নিকট পৌছিয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 683
			}
		},
		{
			"hadithnumber": 685,
			"arabicnumber": 685,
			"text": "রেওয়ায়ত ৫৪. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলেন, আমার জিম্মায় রমযানের রোযা (কাযা) থাকিত। আমি উহা রাখিতে সক্ষম হইতাম না, শাবান মাস না আসা পর্যন্ত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 685
			}
		},
		{
			"hadithnumber": 686,
			"arabicnumber": 686,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 686
			}
		},
		{
			"hadithnumber": 687,
			"arabicnumber": 687,
			"text": "রেওয়ায়ত ৫৭. আবু হুরায়রা (রাঃ) হইতে বর্ণিত- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, রোযা (একটি) ঢাল, কাজেই তোমাদের যে কেউ রোযাদার হও, সে বাজে কথা বলিবে না এবং বর্বরতার কাজ করিবে না। যদি কোন ব্যক্তি তাহাকে গালি দেয় অথবা কাটাকাটি-মারামারি করিতে আসে, তবে সে যেন বলে, আমি রোযাদার, আমি রোযাদার।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 687
			}
		},
		{
			"hadithnumber": 688,
			"arabicnumber": 688,
			"text": "রেওয়ায়ত ৫৮. আবু হুরায়রা (রাঃ) বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লা বলিয়াছেনঃ সেই সত্তার কসম, যাহার হাতে আমার প্রাণ, নিশ্চয়ই রোযাদারের মুখের গন্ধ আল্লাহর নিকট মৃগনাভীর ঘ্রাণ হইতেও উত্তম; নিঃসন্দেহে রোযাদার তাহার প্রবৃত্তি ও পানাহারকে ত্যাগ করে আমার জন্য। তাই রোযা আমারই এবং আমি উহার প্রতিদান দিব। প্রতিটি নেকীর প্রতিদান দশ হইতে সাত শত পর্যন্ত, আর রোযা আমার জন্য, আমিই উহার প্রতিদান দিব।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 688
			}
		},
		{
			"hadithnumber": 689,
			"arabicnumber": 689,
			"text": "রেওয়ায়ত ৫৯. আবু হুরায়রা (রাঃ) বলেনঃ রমযান মাস যখন প্রবেশ করে তখন জান্নাতের দরজাসমূহ খুলিয়া দেওয়া হয় এবং জাহান্নামের দরজাসমূহ বন্ধ করিয়া দেওয়া হয়, আর শয়তানকে শিকলে আবদ্ধ করা হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 689
			}
		}
	]
}