{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"19": "I'tikaf in Ramadan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 690,
			"arabicnumber": 690,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 690
			}
		},
		{
			"hadithnumber": 691,
			"arabicnumber": 691,
			"text": "রেওয়ায়ত ২. আমরা বিন্‌ত আবদুর রহমান (রহঃ) হইতে বর্ণিত, আয়েশা (রাঃ) যখন ইতিকাফ করিতেন, তখন তিনি রোগীর অবস্থা জিজ্ঞাসা করিতে গমন করিতেন না; কিন্তু চলার পথে না দাঁড়াইয়া জিজ্ঞাসা করিয়া নিতেন। ইয়াহইয়া (রহঃ) বলেন, মালিক (রহঃ) বলিয়াছেনঃ ইতিকাফকারী কোন প্রয়োজনে মসজিদের বাহিরে যাইবে না এবং কোন কারণে বাহিরও হইবে না। আর কাহাকে সাহায্যও করিবে না। কিন্তু যদি হাজতে-ইনসানীর (প্ৰস্ৰাব-পায়খানা) জন্য বাহির হয় তাহা বৈধ হইবে। আর যদি কাহারো আবশ্যকের জন্য বাহির হওয়া জায়েয হইত তবে রোগীর অবস্থা দেখা, জানাযার নামায পড়া ও উহার অনুগমন তাহার জন্য সর্বাগ্রে বৈধ হইত (কিন্তু সেগুলির জন্যও বাহির হওয়া নিষেধ)। ইয়াহইয়া (রহঃ) বলেন, মালিক (রহঃ) বলিয়াছেনঃ ইতিকাফকারী (প্রকৃত) ইতিকাফকারী হইবে না যতক্ষণ যেসব বস্তু হইতে তাহার পরহেয করিতে হয় সেইসব হইতে সে পরহিয না করিবে (যথা রোগী দেখিতে যাওয়া, জানাযার নামায পড়া, হাজতে-ইনসানী ব্যতীত গৃহে প্রবেশ করা)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 691
			}
		},
		{
			"hadithnumber": 692,
			"arabicnumber": 692,
			"text": "রেওয়ায়ত ৩. মালিক (রহঃ) বলেনঃ তিনি ইবন শিহাব (রহঃ)-কে প্রশ্ন করিলেন, এক ব্যক্তি সম্পর্কে যে ইতিকাফ করিতেছে, সে কি তাহার প্রস্রাব-পায়খানার প্রয়োজনে (গৃহের) ছাদের নিচে প্রবেশ করিতে পারবে? তিনি বলিলেনঃ হ্যাঁ, ইহাতে কোন ক্ষতি নাই। ইয়াহইয়া (রহঃ) বলেন- মালিক (রহঃ) বলিয়াছেনঃ আমাদের নিকট যাহাতে কোন ইখতেলাফ নাই তাহা এই যে, যে সকল মসজিদে জুম'আর নামায পড়া হয়, সেই সকল মসজিদে ইতিকাফ করা মাকরূহ নহে। আর আমি মনে করি না যে, যে সকল মসজিদে জুম'আর নামায পড়া হয় না, সেই সকল মসজিদে ইতিকাফকে তিনি (মালিক র.) মাকরূহ বলিয়াছেন। ব্যাপার হইল এই যে, ইতিকাফকারী যে মসজিদে ইতিকাফ করিতেছে উহা হইতে বাহির হইবে অথবা জুম'আ ছাড়িয়া দিবে, সেই জন্য তিনি মাকরুহ বলিয়াছেন। তাহার মতে, যদি এইরূপ মসজিদ হয় যাহাতে জুম'আ পড়া হয় না এবং ইতিকাফকারীর উপর সেই মসজিদ ছাড়া অন্য কোন মসজিদে জুম'আতে যাওয়া ওয়াজিব না হয় তবে সেই মসজিদে ইতিকাফ করিতে কোন দোষ নাই। কারণ আল্লাহ্ তা'আলা ইরশাদ করিয়াছেন, (‏وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ‏) অর্থাৎ তোমরা মসজিদে ইতিকাফরত অবস্থায় তাহদের সহিত (স্ত্রী) মিলিত হইও না। (বাকারাঃ ১৮৭) ইহাতে সাধারণভাবে সকল মসজিদকে উদ্দেশ্য করা হইয়াছে এবং কোন মসর্জির্দকে আল্লাহ নির্দিষ্ট করিয়া দেন নাই। মালিক (রহঃ) বলেন, এইজন্যই ইতিকাফকারীর পক্ষে জুম'আ অনুষ্ঠিত হয় না সেইরূপ মসজিদে ইতিকাফ করা জায়েয হইবে, যদি মসজিদ হইতে বাহির হইয়া জুম'আ মসজিদে যাওয়া তাহার উপর ওয়াজিব না হয়। মালিক (রহঃ) বলেন, যে মসজিদে ইতিকাফ করিয়াছে (ইতিকাফকারী) সেই মসজিদেই রাত্রি যাপন করিবে, তবে যদি তাহার তাবু মসজিদের চত্বরের কোন চত্বরে হয়। মালিক (রহঃ) বলেন, আমি শুনি নাই, ইতিকাফকারী রাত্রি যাপন করার জন্য কোন কিছু নির্মাণ করিবে কিন্তু তাহার রাত্রি যাপন হইবে মসজিদে অথবা মসজিদের চত্বরে। মসজিদ ব্যতীত অন্যত্র রাত্রি যাপন সে করিবে না, ইহার প্রমাণ হইল আয়েশা (রাঃ)-এর উক্তি- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন ইতিকাফ করিতেন তখন হাজতে-ইনসানী ছাড়া গৃহে প্রবেশ করতেন না। মালিক (রহঃ) বলেনঃ কেউ মসজিদের ছাদের উপর ইতিকাফ করিবে না এবং সাওমাআতেও (صومعه মিনার) না। মালিক (রহঃ) বলেনঃ ইতিকাফকারী যেই রাত্রে ইতিকাফের ইচ্ছা করিয়াছে, সেই রাত্রির সূর্যাস্তের পূর্বে ইতিকাফের স্থানে প্রবেশ করিবে, যাহাতে যেই রাত্রে ইতিকাফ করবে, সেই রাত্রির প্রথম অংশকে সে ইতিকাফ দ্বারা মুবারকবাদ জানাইতে পারে। মালিক (রহঃ) বলেনঃ ইতিকাফকারী নিজের ইতিকাফে মশগুল থাকিবে, ইতিকাফ ভিন্ন তিজারত বা অন্যকিছুর দিকে যেই সবের প্রতি মশগুল হওয়া যায় মনোযোগী হইবে না। ইতিকাফকারীর পক্ষে তাহার কোন আসবাব অথবা পরিবারের উপকারী ও উপযোগী কোন কাজ, তাহার মাল বিক্রয় অথবা অন্য কোন কাজ যাহা তাহাকে ব্যতিব্যস্ত করে না (এই জাতীয়) নিজের কোন আবশ্যকে নির্দেশ দেওয়াতে কোন ক্ষতি নাই। ইহাতে কোন দোষ নাই, যদি তিনি ছোটখাট কাজের জন্য কোন ব্যক্তিকে সেই কার্য সমাধা করিতে নির্দেশ দেন। মালিক (রহঃ) বলেন, কোন আহলে ইলম কর্তৃক ইতিকাফে কোন শর্ত আরোপ করিতে আমি শুনি নাই। ইতিকাফ অন্যান্য আমলের মত একটি আমল; যথা নামায, রোযা, হজ্জ এবং অন্যান্য যাহা এই সকল আমলের অনুরূপ এবং যাহা উহাদের মধ্যে ফরয অথবা নফল। (শরীয়তের) এই সকল আমলের মত ইতিকাফও একটি আমল। যে ব্যক্তি ইহার কোন আমলে প্রবেশ করিবে, সে প্রতিষ্ঠিত সুন্নত মুতাবিক আমল করিবে। মুসলিমগণ যে তরীকায় চলিয়াছেন সেই তরীকা ছাড়া উহাতে নূতন কোন পন্থা আবিষ্কার করার অধিকার তাহার নাই। না কোন শর্ত আরোপ করিবে, না কোন বিদ'আত সৃষ্টি করবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওসাল্লাম ইতিকাফ করিয়াছেন, উহা হইতে মুসলিমরা ইতিকাফের সুন্নত অবগত হইয়াছেন। ইয়াহইয়া (রহঃ) বলেন- মালিক (রহঃ) বলিয়াছেনঃ ইতিকাফ এবং মসজিদে অবস্থান এক সমান। আর গ্রাম ও শহরের লোকের ইতিকাফ এক সমান (আহকামের ব্যাপারে)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 692
			}
		},
		{
			"hadithnumber": 693,
			"arabicnumber": 693,
			"text": "রেওয়ায়ত ৪. মালিক (রহঃ) বলেনঃ তাহার নিকট খবর পৌছিয়াছে যে, কাসিম ইবন মুহাম্মদ (রহঃ) ও আবদুল্লাহ্ ইবন উমর (রাঃ)-এর মাওলা নাফি' (রহঃ) বলিয়াছেনঃ ইতিকাফ জায়েয নহে রোযা ব্যতীত, কারণ কুরআনে ইরশাদ হইয়াছেঃ ‏وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ مِنَ الْفَجْرِ ثُمَّ أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ وَلاَ تُبَاشِرُوهُنَّ وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ‏ আর তোমরা পানাহার কর যতক্ষণ রাত্রির কৃষ্ণ রেখা হইতে উষার শুভ্র রেখা স্পষ্টরূপে তোমাদের নিকট প্রতিভাত না হয়। অতঃপর নিশাগমন পর্যন্ত সিয়াম পূর্ণ কর। তোমরা মসজিদে ইতিকাফৱত অবস্থায় তাহাদের সহিত সঙ্গত হইও না। (বাকারাঃ ১৮৭) আল্লাহ্ তা'আলা ইতিকাফের উল্লেখ করিয়াছেন রোযার সহিত। মালিক (রহঃ) বলেনঃ আমাদের নিকট মাসআলা অনুরূপ। রোযা ব্যতীত ইতিকাফ হয় না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 693
			}
		},
		{
			"hadithnumber": 694,
			"arabicnumber": 694,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 694
			}
		},
		{
			"hadithnumber": 695,
			"arabicnumber": 695,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Shadh, Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 695
			}
		},
		{
			"hadithnumber": 696,
			"arabicnumber": 696,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 696
			}
		},
		{
			"hadithnumber": 697,
			"arabicnumber": 697,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 697
			}
		},
		{
			"hadithnumber": 698,
			"arabicnumber": 698,
			"text": "রেওয়ায়ত ১০. উরওয়াহ ইবন যুবায়র (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ রমযানের শেষ দশদিনে তোমরা শবে-কদরের সন্ধান কর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 698
			}
		},
		{
			"hadithnumber": 699,
			"arabicnumber": 699,
			"text": "রেওয়ায়ত ১১. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত-তোমরা রমযানের শেষের সাত দিনে শবে-কদরের অনুসন্ধান কর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 699
			}
		},
		{
			"hadithnumber": 700,
			"arabicnumber": 700,
			"text": "রেওয়ায়ত ১২. আবদুল্লাহ ইবন উনায়স জুহানী (রাঃ) হইতে বর্ণিত- তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে আরজ করিলেনঃ আমি এমন এক ব্যক্তি যাহার বাড়ি অনেক দূরে অবস্থিত, তাই আমাকে আপনি একটি রাত বলিয়া দিন যে রাত্রে আমি (ইবাদতের জন্য এই মসজিদে) আগমন করিব। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাকে বলিলেনঃ তুমি রমযানের তেইশে রাত্রে আগমন কর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 700
			}
		},
		{
			"hadithnumber": 701,
			"arabicnumber": 701,
			"text": "রেওয়ায়ত ১৩. আনাস ইবন মালিক (রাঃ) বলেন- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাহির হইয়া আমাদের নিকট আসিলেন, অতঃপর বলিলেনঃ আমাকে অবশ্য এই রাত্রিটি (শবে-কদর) রমযানে দেখান হইয়াছে, হঠাৎ দুইজন লোক বিতর্কে লিপ্ত হইল, ফলে উহা (আমার স্মৃতি হইতে) তুলিয়া নেওয়া হয়। অতঃপর তোমরা উহাকে তালাশ কর নবম, সপ্তম ও পঞ্চম রাত্রে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 701
			}
		},
		{
			"hadithnumber": 702,
			"arabicnumber": 702,
			"text": "রেওয়ায়ত ১৪. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীদের মধ্যে কিছু লোককে লাইলাতুল কদর স্বপ্নে দেখানো হয় শেষের সাত রাত্রে। তারপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ আমি মনে করি তোমাদের স্বপ্ন শেষের সাতদিনের ব্যাপারে পরস্পর মুয়াফিক (সামঞ্জস্যপূর্ণ) হইয়াছে। অতঃপর যে উহাকে (লাইলাতুল কুদর) তালাশ করে, সে যেন শেষের সাত দিনে উহাকে তালাশ করে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 702
			}
		},
		{
			"hadithnumber": 703,
			"arabicnumber": 703,
			"text": "রেওয়ায়ত ১৫. মালিক (রহঃ) বলেনঃ তিনি নির্ভরযোগ্য আহলে ইলমকে বলিতে শুনিয়াছেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাহার পূর্ববর্তী লোকদের আয়ু দেখান হয়। অথবা উহা হইতে যতটুকু আল্লাহ চাহিয়াছেন তাহা দেখান হয়। ফলে তিনি যেন তাহার উম্মতের আয়ুকে সংক্ষিপ্ত মনে করিলেন যাহার কারণে আমলের দিক দিয়া তাহারা পূর্ববর্তী ব্যক্তিদের সমপর্যায়ে পৌছিতে সক্ষম হইবে না। অতঃপর আল্লাহ্ তাহাকে হাজার মাস হইতে উত্তম লাইলাতুল কদর প্রদান করেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 703
			}
		},
		{
			"hadithnumber": 704,
			"arabicnumber": 704,
			"text": "রেওয়ায়ত ১৬. মালিক (রহঃ) বলেন, তাহার নিকট সংবাদ পৌছিয়াছে যে, সাঈদ ইবন মুসায়্যাব (রহঃ) বলিতেনঃ যে ব্যক্তি শবে-কদরের ইশার নামাযে উপস্থিত হইয়াছে, সে উহার (শবে-কদর) অংশ প্রাপ্ত হইয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 704
			}
		}
	]
}