{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"2": "Purity"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 32,
			"arabicnumber": 32,
			"text": "রেওয়ায়ত ১. ইয়াহইয়া মাযনী (রহঃ)-এর পিতা আবদুল্লাহ্ ইবন যায়দ ইবন আসিম (রাঃ)-কে বলিলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিভাবে ওযু করিতেন আপনি আমাকে দেখাইতে পারেন কি? আবদুল্লাহ ইবন যায়দ (রাঃ) বললেনঃ হ্যাঁ পারি। তারপর তিনি পানি আনাইলেন এবং তাহার হাতের উপর পানি ঢালিলেন। তিনি দুই দুইবার তাহার উভয় হাত ধুইলেন, তারপর কুলি করিলেন ও নাক পরিষ্কার করিলেন তিনবার। তারপর মুখমণ্ডলকে তিনবার ধুইলেন, তারপর কনুই পর্যন্ত উভয় হাত ধুইলেন দুই দুইবার। পরে দুই হাত দ্বারা শির মসেহ করিলেন, দুই হাত দিয়া সম্মুখ হইতে আরম্ভ করিয়া পিছনের দিকে নিলেন এবং পিছনের দিক হইতে আরম্ভ করিয়া সামনের দিকে আনিলেন। মসেহ আরম্ভ করিলেন মাথার সামনের দিক হইতে। অতঃপর উভয় হাত মাথার পিছনের দিকে নিয়া গেলেন। তারপর উভয় হাত ফিরাইলেন এবং যে স্থান হইতে আরম্ভ করিয়াছিলেন, পুনরায় সেই স্থানেই ফিরাইয়া আনিলেন। তারপর তাহার দুই পা ধুইলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 33,
			"arabicnumber": 33,
			"text": "রেওয়ায়ত ২. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করিয়াছেনঃ তোমাদের কেউ যখন ওযু করে, তখন সে যেন তাহার নাকে পানি দেয়, তারপর নাক পরিষ্কার করে, আর যে কুলুখ গ্রহণ করে সে যেন বেজোড় কুলুখ নেয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 34,
			"arabicnumber": 34,
			"text": "রেওয়ায়ত ৩. আবূ হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, যে ওযু করে সে যেন নাক পরিষ্কার করে আর যে কুলুখ নেয় সে বেজোড় নেবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 35,
			"arabicnumber": 35,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 36,
			"arabicnumber": 36,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 37,
			"arabicnumber": 37,
			"text": "রেওয়ায়ত ৯. আবূ হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ তোমাদের কেউ ঘুম হইতে জাগ্রত হইলে ওযুর পাত্রে হাত দেওয়ার পূর্বে তাহার হাত ধুইয়া লইবে, কেননা সে অবগত নহে তাহার হাত কোথায় রাত্রি যাপন করিয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 38,
			"arabicnumber": 38,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 39,
			"arabicnumber": 39,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 40,
			"arabicnumber": 40,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 41,
			"arabicnumber": 41,
			"text": "রেওয়ায়ত ১২. মুগীরা ইবন আবী বুরদা (রহঃ) আবু হুরায়রা (রাঃ)-কে বলিতে শুনিয়াছেনঃ এক ব্যক্তি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসিয়া বলিলঃ হে আল্লাহর রাসূল! আমরা সাগরে আরোহণ করি (নৌকা বা জাহাজে আরোহণ করি) আর আমাদের সঙ্গে অল্প পানি বহন করি। যদি আমরা সেই পানি দ্বারা ওযু করি তবে আমরা পিপাসিত থাকিব। তাই সমুদ্রের পানি দ্বারা আমরা ওযু করিব কি? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করিলেনঃ সাগরের পানি অতি পবিত্র। ইহার মৃত জীব হালাল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 42,
			"arabicnumber": 42,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 43,
			"arabicnumber": 43,
			"text": "রেওয়ায়ত ১৪. ইয়াহইয়া ইবন আবদুর রহমান ইবন হাতিব (রহঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) এক কাফেলার সহিত বাহির হইলেন। কাফেলায় আমর ইবন আস (রাঃ)-ও শরীক ছিলেন। তাহারা একটি জলাধারের নিকট অবতরণ করিলেন। জলাধারের মালিককে আমর ইবন আস বলিলেনঃ হে জলাধারের মালিক! আপনার জলাধারে চতুষ্পদ জন্তু অবতরণ করে কি? উমর ইবন খাত্তাব (রাঃ) জলাধারের মালিককে বলিলেনঃ আপনি (এই বিষয়ে) আমাদিগকে খবর দিবেন না। কারণ আমরা চতুষ্পদ জন্তুসমূহের নিকট বিচরণ করি এবং তাহারাও আমাদের কাছে বিচরণ করে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 44,
			"arabicnumber": 44,
			"text": "রেওয়ায়ত ১৫. নাফি (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ) বলিতেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সময়ে নারী-পুরুষ একত্রে ওযু করিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 45,
			"arabicnumber": 45,
			"text": "রেওয়ায়ত ১৬. ইবরাহীম ইবন আবদুর রহমান ইবন আউফ (রহঃ)-এর উম্মে-ওয়ালাদ (তাহার নাম হুমায়দা বলা হইয়াছে) হইতে বর্ণিত, তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী উম্মে-সালমা (রাঃ)-এর নিকট প্রশ্ন করিলেন, আমি একজন স্ত্রীলোক। আমি আমার কাপড়ের ঝুল লম্বা রাখি আর আমি কোন কোন সময় চলাফেরা করি আবর্জনাযুক্ত স্থান দিয়া। উম্মে সালমা (রাঃ) বলিলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করিয়াছেনঃ কাপড়ের ঝুলকে আবর্জনাযুক্ত রাস্তার পরবর্তী স্থান পবিত্র করিয়া দিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 46,
			"arabicnumber": 46,
			"text": "রেওয়ায়ত ১৭. মালিক (রহঃ) বলেনঃ তিনি রবী’আ ইবন আবদুর রহমানকে কয়েকবার উদর হইতে পানি বমি করিতে দেখিয়াছেন, তখন তিনি ছিলেন মসজিদে। তিনি অতঃপর নামায আদায় করা পর্যন্ত মসজিদ হইতে বাহিরেও যাইতেন না এবং ওযুও করিতেন না। ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-কে প্রশ্ন করা হইয়াছে এমন এক ব্যক্তি সম্পর্কে, যে ব্যক্তি খাদ্যবস্তু বমি করিয়াছে, তাহার জন্য ওযু ওয়াজিব হইবে কি? তিনি বলিলেনঃ তাহার জন্য ওযু ওয়াজিব নহে, ইহার জন্য সে কুলি করিবে এবং তাহার মুখ ধুইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 47,
			"arabicnumber": 47,
			"text": "রেওয়ায়ত ১৮. নাফি (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ) সাঈদ ইবন যায়দ-এর এক (মৃত) পুত্রকে হানূত[1] লাগাইলেন এবং তাহার লাশ বহন করিলেন, অতঃপর ওযু না করিয়া মসজিদে প্রবেশ করিয়া তিনি নামায পড়িলেন। মালিক (রহঃ)-কে প্রশ্ন করা হইলঃ বমি করিলে ওযু করিতে হইবে কি? তিনি বলিলেনঃ না। তবে ইহার জন্য কুলি করিবে এবং তাঁহার মুখ ধুইবে। তাহার উপর ওযু ওয়াজিব নহে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 48,
			"arabicnumber": 48,
			"text": "রেওয়ায়ত ১৯. আবদুল্লাহ্ ইবন আব্বাস (রাঃ) হইতে বর্ণিত, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছাগের কাঁধের গোশত আহার করার পর ওযু না করিয়া নামায পড়িলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 49,
			"arabicnumber": 49,
			"text": "রেওয়ায়ত ২০. সুওয়ায়দ ইবন নুমান (রাঃ) হইতে বর্ণিত, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে খায়বরের যুদ্ধের বৎসর বাহির হইলেন। যখন তাহার সাহ্‌বা (صهباء) নামক স্থানে পৌছিলেন- উহা খায়বরের ঢালু অংশে অবস্থিত- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (তথায়) অবতরণ করিলেন, তারপর আসর নামায পড়িলেন। অতঃপর সফরে আহারের জন্য রাখা খাদ্যবস্তু এবং উহার পাত্রসমূহ আনিতে বলিলেন, তাহার নিকট ছাতু ছাড়া অন্য কিছু উপস্থিত করা হইল না। তিনি নির্দেশ দিলেন, উহা গুলান হইল, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আহার করিলেন, আমরাও আহার করিলাম। অতঃপর মাগরিবের নামাযের জন্য উঠিলেন এবং কুলি করিলেন, আমরাও কুলি করিলাম। তারপর তিনি নামায পড়িলেন, অথচ আর ওযু করিলেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 50,
			"arabicnumber": 50,
			"text": "রেওয়ায়ত ২১. রবী’আ ইবন আবদুল্লাহ্ ইবন হুদায়র (রহঃ) উমর ইবন খাত্তাব (রাঃ)-এর সহিত সন্ধ্যাকালীন আহার করিলেন, তারপর নামায পড়িলেন, আর ওযু করিলেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 51,
			"arabicnumber": 51,
			"text": "রেওয়ায়ত ২২. উসমান ইবন আফফান (রাঃ) রুটি-গোশত আহার করিলেন, তারপর কুলি করিলেন, উভয় হাত ধুইলেন এবং হস্তদ্বয় দ্বারা মুখমণ্ডল মসেহ করিলেন, তারপর নামায পড়িলেন অথচ পুনরায় ওযু করিলেন না। মালিক (রহঃ) বলেনঃ তিনি জানিতে পারিয়াছেন যে, আলী ইবন আবি তালিব (রাঃ) এবং আবদুল্লাহ ইবন আব্বাস (রাঃ) আগুনে জ্বাল দেওয়া খাদ্যবস্তু আহার করিয়া ওযু করিতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 52,
			"arabicnumber": 52,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 53,
			"arabicnumber": 53,
			"text": "রেওয়ায়ত ২৩. ইয়াহইয়াহ্ ইবন সাঈদ (রহঃ) আবদুল্লাহ্ ইবন আমির ইবন রবী'আ (রহঃ)-এর নিকট একটি প্রশ্ন করিলেন এমন এক লোক সম্পর্কে, যে নামাযের জন্য ওযু করিয়া আগুনে রন্ধন করা খাদ্যবস্তু আহার করিল, সে কি ওযু করিবে? তিনি বলিলেনঃ আমার পিতাকে দেখিয়াছি তিনি এইরূপ রাধা খাদ্য খাইতেন ও ওযু করিতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 54,
			"arabicnumber": 54,
			"text": "রেওয়ায়ত ২৪. আবূ নঈম ওহাব ইবন কায়সান (রহঃ) জাবির ইবন আবদুল্লাহ্ (রাঃ)-কে বলিতে শুনিয়াছেনঃ আমি আবু বকর সিদীক (রাঃ)-কে দেখিয়াছি, তিনি গোশত খাইলেন, অতঃপর নামায পড়িলেন অথচ ওযু করিলেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 55,
			"arabicnumber": 55,
			"text": "রেওয়ায়ত ২৫. মুহাম্মদ ইবন মুনকাদির হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে (খানার জন্য) দাওয়াত করা হইল, তাহার সমীপে রুটি-গোশত পেশ করা হইল। তিনি উহা হইতে আহার করিলেন, তারপর অযু করিলেন ও নামায পড়িলেন। অতঃপর সেই খাদ্যের অবশিষ্ট তাহার নিকট আনা হইল। তিনি উহা হইতে আহার করিলেন, তারপর নামায পড়িলেন, আর ওযু করিলেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 56,
			"arabicnumber": 56,
			"text": "রেওয়ায়ত ২৬. আনাস ইবন মালিক (রাঃ) ইরাক হইতে আগমন করিলেন। তাহার নিকট আবূ তালহা ও উবাই ইবন কা'ব (রাঃ) আগমন করিলেন। আগুনে রন্ধন করা হইয়াছে এরূপ খাদ্য তাহাদের উভয়ের নিকট পেশ করা হইল। সকলে উহা হইতে আহার করিলেন, অতঃপর আনাস (রাঃ) উঠিলেন এবং ওযু করিলেন। (ইহা দেখিয়া) আবূ তালহা ও উবাই ইবন কা'ব (রাঃ) বলিলেনঃ হে আনাস! ইহা কি? ইহা কি ইরাকী আমল? আনাস (রাঃ) বলিলেনঃ আমি যদি ইহা না করিতাম (তবে ভাল হইত)। আবু তালহা ও উবাই ইবন কা'ব (রাঃ) উঠিলেন এবং নামায পড়িলেন, তাহারা ওযু করিলেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 57,
			"arabicnumber": 57,
			"text": "রেওয়ায়ত ২৭. উরওয়াহ্ ইবন যুবায়র (রহঃ) হইতে বর্ণিত, ইস্তিতাবা[1] সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে প্রশ্ন করা হইল। তিনি বলিলেনঃ তোমাদের একজন কি তিনটি পাথরও পায় না (যদ্বারা সে পবিত্রতা লাভ করিতে সক্ষম হয়?)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 58,
			"arabicnumber": 58,
			"text": "রেওয়ায়ত ২৮. আবু হুরায়রা (রাঃ) হইতে বর্ণিত – রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (একদ) কবরস্থানের দিকে গমন করিলেন। তিনি সেখানে পৌছার পর বলিলেনঃ السَّلاَمُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ “তোমাদের উপর শান্তি বর্ষিত হোক। হে মু’মিন সম্প্রদায়ের বাসস্থানে (অর্থাৎ গোরস্তানে) বসবাসকারিগণ! আমরা তোমাদের সহিত মিলিত হইব, ইনশাআল্লাহ।” আমার আকাঙ্ক্ষা, যদি আমার ভাইদিগকে দেখিতাম! তাহারা বলিলেনঃ হে আল্লাহর রাসূল! আমরা আপনার ভাই নই কি? তিনি বলিলেনঃ তোমরা আমার আসহাব, আমার ভাই তাহারা যাহারা এখনও (ইহজগতে) আসেন নাই। আমি তাহদের অগ্রদূত হইব হাওযের নিকট। তাহারা বলিলেনঃ ইয়া রাসূলাল্লাহ্! আপনার উম্মতের মধ্যে যাহারা আপনার পরে আগমন করিবে আপনি তাহাদের পরিচয় পাইবেন কিভাবে? তিনি বলিলেনঃ তোমরা আমাকে বল দেখি, যদি কোন ব্যক্তির কাছে পায়ে ও ললাটে সাদা চিহ্নযুক্ত ঘোড়া থাকে এবং সেগুলি গাঢ় কাল রং-এর ঘোড়ার সহিত একত্র থাকে, তবে সেই ব্যক্তি কি তাহার (সাদা চিহ্নযুক্ত) ঘোড়া চিনিতে পারবে না? তাহারা বলিলেনঃ হ্যা, ইয়া রাসূলাল্লাহ! চিনিতে পরিবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ আমার উম্মতকে আমি চিনিতে পারিব। কারণ তাহারা ওযুর দরুন রোজ কিয়ামতে জ্যোতির্ময় চেহারা এবং জ্যোতির্ময় অঙ্গ-প্রত্যঙ্গ নিয়া উপস্থিত হইবে। আমি হাওযে তাহদের অগ্রদূত থাকিব। দলভ্রষ্ট উটকে যেরূপ তাড়াইয়া দেওয়া হয়, আমার হাওয হইতে কাহাকেও অদ্রুপ তাড়াইয়া দেওয়া হইলে আমি তাহাকে আহবান করিবঃ أَلاَ هَلُمَّ أَلاَ هَلُمَّ أَلاَ هَلُمَّ - ওহে (আমার নিকট) আস, (আমার নিকট) আস, (আমার নিকট) আস। তারপর আমাকে বলা হইবেঃ ইহারা (আপনার সুন্নতকে) আপনার পরে পরিবর্তন করিয়াছে। আমি বলিবঃ فَسُحْقًا فَسُحْقًا فَسُحْقًا -তবে দূর হও, দূর হও, দূর হও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 59,
			"arabicnumber": 59,
			"text": "রেওয়ায়ত ২৯. হুমরান (রহঃ) (حُمْرَان) হইতে বর্ণিত, উসমান ইবন আফফান (রাঃ) (একদা) মাকাইদ (مَقَاعِد) বৈঠকখানায় বসিলেন। মুয়াযযিন আসিয়া তাহাকে আসরের নামাযের সংবাদ দিলেন। তিনি পানি আনাইলেন, তারপর ওযু করিলেন এবং বলিলেনঃ আল্লাহর কসম, আমি নিশ্চয়ই তোমাদের নিকট একটি হাদীস বয়ান করিব। কিতাবুল্লাহর (কুরআনের) একটি আয়াত যদি না থাকিত তবে আমি তোমাদের নিকট হাদীস বয়ান করিতাম না। অতঃপর বললেন, রসূলুল্লাহ সল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি বলতে শুনেছি যে ব্যক্তি ওযূ করে আর সে তাহার ওযূকে উত্তমরূপে সমাধা করার পর নামায আদায় করে, তার (পাপ) মার্জনা করা হবে অর্থাৎ পরবর্তী নামায সমাপ্ত করা পর্যন্ত অর্থাৎ পরবর্তী নামায আদায় করলেই এই মার্জনা পাওয়া যাবে। মালিক (রহঃ) বলিয়াছেনঃ আমার ধারণা, উসমান (রাঃ) যেই আয়াতের কথা বলিয়াছেন তাহা এইঃ أَقِمِ الصَّلَاةَ طَرَفَيِ النَّهَارِ وَزُلَفًا مِّنَ اللَّيْلِ ۚ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ذَٰلِكَ ذِكْرَىٰ لِلذَّاكِرِين সালাত কায়েম করবে দিবসের দুই প্রান্তভাগে ও রজনীর প্রথমাংশে। নিশ্চয় সৎকর্ম অসৎ কর্ম মিটাইয়া দেয়। (সূরা হুদঃ ১১৪)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 60,
			"arabicnumber": 60,
			"text": "রেওয়ায়ত ৩০. আবদুল্লাহ সুনাবিহী (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ মুমিন বান্দা যখন ওযু করে এবং কুলি করে, তাহার মুখ হইতে পাপসমূহ বাহির হইয়া যায়। সে যখন মুখমণ্ডল ধৌত করে তাহার মুখমণ্ডল হইতে তখন পাপসমূহ বাহির হইয়া যায়। এমনকি চক্ষুদ্বয়ের পালকের নিচ হইতেও গুনাহ বাহির হইয়া যায়। তারপর যখন সে তাহার উভয় হাত ধোয় তখন পাপসমূহ হস্তদ্বয় হইতে বাহির হইয়া যায়; এমনকি তাহার উভয় হাতের নখসমূহের নিচ হইতেও গুনাহ বাহির হইয়া যায়। অতঃপর যখন সে তাহার মাথা মসেহ করে তাহার পাপসমূহ তখন তাহার মাথা হইতে বাহির হইয়া যায়; এমনকি তাহার উভয় কান হইতেও বাহির হইয়া যায়। যখন সে তাহার উভয় পা ধোয় তখন পাপসমূহ তাহার উভয় পা হইতে বাহির হইয়া যায়; এমনকি তাহার উভয় পায়ের সকল নখের নিচ হইতেও গুনাহ বাহির হইয়া যায়। তিনি (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলিয়াছেনঃ অতঃপর সেই ব্যক্তির মসজিদে গমন এবং নামায পড়া তাহার জন্য নফল (অতিরিক্ত সওযাবের বস্তু)-স্বরূপ হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 61,
			"arabicnumber": 61,
			"text": "রেওয়ায়ত ৩১. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ যখন মু'মিন বান্দা ওযু করে এবং তাহার মুখমণ্ডল ধোয় তখন তাহার মুখমণ্ডল হইতে সকল গুনাহ যাহা দেখার দরুন অর্জিত হইয়াছে, বাহির হইয়া যায়; পানির সঙ্গে অথবা পানির শেষ কাতরার (ফোঁটা) সঙ্গে অথবা (ইহার সমার্থবোধক) অনুরূপ কোন বাক্য। তারপর যখন সে তাহার উভয় হাত ধোয় তখন তাহার হস্তদ্বয় হইতে হস্তদ্বয় দ্বারা অর্জিত সকল পাপ বাহির হইয়া যায়। পানির সঙ্গে অথবা (বলিয়াছেন) পানির শেষ কাতরার সঙ্গে; এমনকি সে যাবতীয় পাপ হইতে পবিত্র হইয়া যায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 62,
			"arabicnumber": 62,
			"text": "রেওয়ায়ত ৩২. আনাস ইবন মালিক (রাঃ) বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এমন সময় দেখিলাম যখন আসরের নামাযের সময় নিকটবর্তী। লোকজন ওযুর জন্য পানি তালাশ করিলেন, কিন্তু তাহারা পানি পাইলেন না। পরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট একটি পাত্রে কিছু পানি আনা হইল, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজের হাত সেই পাত্রে রাখিলেন। তারপর লোকজনকে উহা হইতে ওযু করার নির্দেশ দিলেন। আনাস (রাঃ) বলেনঃ আমি হযরতের অঙ্গুলিসমূহের নিচ হইতে পানি নির্গত হইতে দেখিলাম, লোকজন ওযু করিলেন। এমনকি তাহাদের (দলের) সর্বশেষ ব্যক্তিও ওষু করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 63,
			"arabicnumber": 63,
			"text": "রেওয়ায়ত ৩৩. নুআয়ম ইবন আবদুল্লাহ মুজমির (রহঃ) আবু হুরায়রা (রাঃ)-কে বলিতে শুনিয়াছেন, যে ব্যক্তি ওযু করিয়াছে এবং তাহার ওযুকে উত্তমরূপে সম্পাদন করিয়াছে, অতঃপর নামাযের উদ্দেশ্যে বাহির হইয়াছে, সে নামাযে থাকিবে (সওয়াবের দিক দিয়া নামাযে বলিয়া গণ্য হইবে) যতক্ষণ নামাযের নিয়ত রাখিবে এবং তাহার জন্য প্রতিটি প্রথম পদ উত্তোলনে একটি করিয়া নেকী লেখা হইবে, আর প্রতিটি দ্বিতীয় পদ উত্তোলনের পরিবর্তে তাহার পাপ মোচন করিয়া দেওয়া হইবে। তাই তোমাদের কেউ ইকামত শুনিতে পাইলে দৌড়াইবে না, কারণ তোমাদের মধ্যে সেই লোকই বেশি সওয়াবের অধিকারী যাহার ঘর মসজিদ হইতে অধিক দূরে। শ্রোতারা বলিলেনঃ এইরূপ কেন, হে আবু হুরায়রা? তিনি বলিলেনঃ কদমের আধিক্যের কারণে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 64,
			"arabicnumber": 64,
			"text": "রেওয়ায়ত ৩৪. ইয়াহইয়া ইবন সাঈদ (রহঃ) শুনিয়াছেন যে, সাঈদ ইবন মুসায়্যাব (রহঃ)-কে প্রশ্ন করা হইল, মল-মূত্র ত্যাগের কারণে পানি দ্বারা ইস্তিন্জা (মল-মূত্র ত্যাগের পর বিশেষ স্থান ধৌত করা) করা সম্পর্কে। সাঈদ (রহঃ) বললেনঃ ইহা অবশ্য মেয়েদের ইস্তিন্জা।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 65,
			"arabicnumber": 65,
			"text": "রেওয়ায়ত ৩৫. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ তোমাদের কাহারও পাত্র হইতে কুকুর আহার করিলে, তবে অবশ্যই উহাকে সাতবার ধুইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 66,
			"arabicnumber": 66,
			"text": "রেওয়ায়ত ৩৬. মালিক (রহঃ) বলেনঃ তাহার নিকট হাদীস পৌছিয়াছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ যে শরীয়ত তোমাদের জন্য নির্ধারিত করা হইয়াছে উহার উপর তোমরা দৃঢ়তার সহিত থাক, পূর্ণ ইস্তিকামাত বা দৃঢ়তার সামর্থ্যও তো তোমাদের নাই। কাজ করিতে থাক। তোমাদের আমলসমূহের মধ্যে সর্বোত্তম আমল নামায। মু'মিন ব্যতীত অন্য কেউ ওযুর যথাযোগ্য হিফাযত (ওযুতে যাহিরী ও বাতেনী পরিচ্ছন্নতা অর্জনের প্রতি লক্ষ্য রাখার নাম মুহাফিযাত) করে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 67,
			"arabicnumber": 67,
			"text": "রেওয়ায়ত ৩৭. নাফি (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) তাহার উভয় কানের জন্য দুই আঙুল দ্বারা পানি লইতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 68,
			"arabicnumber": 68,
			"text": "রেওয়ায়ত ৩৮. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, জাবির ইবন আবদুল্লাহ্ আনসারী (রাঃ)-কে মসহ আলাল ইসাবাহ (পাগড়ির উপর হাত বুলাইয়া যাওয়া) সম্পর্কে প্রশ্ন করা হইল। তিনি বলিলেনঃ না, (ইহা যথেষ্ট নহে) যতক্ষণ পানি দ্বারা চুল মসেহ করা না হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 69,
			"arabicnumber": 69,
			"text": "রেওয়ায়ত ৩৯. হিশাম ইবন উরওয়াহ (রহঃ) বলেনঃ আবু উরওয়াহ ইবন যুবাইর (রহঃ) পাগড়ি খুলিয়া ফেলিতেন এবং পানি দ্বারা মাথা মসেহ করিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 70,
			"arabicnumber": 70,
			"text": "রেওয়ায়ত ৪০. নাফি' (রহঃ) হইতে বর্ণিত, যখন তিনি বালক তখন আবু উবায়দার কন্যা, আবদুল্লাহ ইবন উমর (রাঃ)-এর স্ত্রী, সফিয়া (صفية)-কে তাহার ওড়না নামাইয়া পানি দ্বারা মসেহ করিতে তিনি দেখিয়াছেন। ইয়াহইয়া (রহঃ) বলেনঃ পাগড়ি ও ওড়নার উপর মসেহ করা সম্পর্কে মালিক (রহঃ)-কে প্রশ্ন করা হইলে তিনি বলিলেনঃ কোন পুরুষ কোন নারীর পক্ষে (যথাক্রমে) পাগড়ি কিংবা ওড়নার উপর মসেহ করা জায়েয নহে। তাহারা উভয়েই তাহাদের মাথা মসেহ করিবে। মালিক (রহঃ)-কে এক ব্যক্তি সম্পর্কে প্রশ্ন করা হইল, যে ব্যক্তি ওযু করিয়াছে কিন্তু মাথা মসেহ করিতে ভুলিয়া গিয়াছে, (এই অবস্থায়) তাহার ওযুর অঙ্গসমূহ শুকাইয়া গিয়াছে, এখন সে কি করিবে? তিনি উত্তরে বলিলেনঃ আমার মতে সে তাহার মাথা মসেহ করিবে। আর যদি সে (মসেহ ব্যতীত) ওযু দ্বারা নামায পড়িয়া থাকে তবে সে নামায পুনরায় পড়িবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 71,
			"arabicnumber": 71,
			"text": "রেওয়ায়ত ৪১. মুগীরা ইবন শু’বা (রাঃ) হইতে বর্ণিত, তাবুকের যুদ্ধে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্ৰস্ৰাব-পায়খানার প্রয়োজনে বাহিরে গেলেন। মুগীরা বলেন, আমি পানি লইয়া তাহার সঙ্গে গমন করিলাম। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (তাহার প্রয়োজন পূর্ণ করিয়া) আসিলেন, আমি তাহার হস্তদ্বয়ের উপর পানি ঢালিলাম, তিনি তাহার মুখমণ্ডল ধুইলেন। তারপর তাহার হস্তদ্বয জুব্বার আস্তিন হইতে বাহির করিতে চেষ্টা করিলেন। জুব্বার আস্তিনের সংকীর্ণতার দরুন তিনি (বাহির করিতে) সক্ষম হইলেন না। তাই জুব্বার নিচ দিয়া উভয় হাত বাহির করিলেন, তারপর দুই হাত ধুইলেন, মাথা মসেহ করলেন এবং মোজার উপর মসেহ করিলেন। তারপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তশরীফ আনিলেন, তখন আবদুর রহমান ইবন আউফ (রাঃ) (লোকের) ইমামতি করিতেছিলেন, তিনি এক রাকাত সমাপ্তও করিয়াছেন। যেই এক রাকাত তাঁহাদের অবশিষ্ট ছিল, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাদের সহিত সেই রাকাত পড়িলেন। লোকজন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখিয়া (তাহার অনুপস্থিতিতে নামায আরম্ভ করায় বেআদবী হইয়াছে ভাবিয়া) ঘাবড়াইয়া গেলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহার নামায সমাপ্ত করার পর বলিলেনঃ তোমরা ভাল করিয়াছ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 72,
			"arabicnumber": 72,
			"text": "রেওয়ায়ত ৪২. সা'দ ইবন ওয়াক্কাস (রাঃ) যখন কূফার আমীর ছিলেন তখন আবদুল্লাহ ইবন উমর (রাঃ) কূফায় সা’দ ইবন আবি ওয়াক্কাস (রাঃ)-এর নিকট আসিলেন এবং তাহাকে মোজার উপর মসেহ করিতে দেখিলেন। ইবন উমর (রাঃ) তাহার এই মসেহ-এর প্রতি অস্বীকৃতি জানাইলেন। সা'দ (রাঃ) তাঁহাকে বলিলেনঃ আপনার পিতার নিকট গেলে ইহা তাহাকে জিজ্ঞাসা করিবেন। আবদুল্লাহ্ (রাঃ) (মদীনায়) আগমন করিলেন; কিন্তু তাহার পিতাকে এই বিষয়ে জিজ্ঞাসা করিতে ভুলিয়া গেলেন। সা'দ পরে (মদীনায়) আসিলেন এবং ইবন উমর (রাঃ)-কে জিজ্ঞাসা করিলেনঃ আপনার পিতার নিকট সেই বিষয়ে জিজ্ঞাসা করিয়াছেন কি? তিনি বলিলেনঃ না। অতঃপর আবদুল্লাহ (রাঃ) তাহার পিতাকে এই বিষয়ে প্রশ্ন করিলেন। উমর (রাঃ) উত্তরে বলিলেন; যদি মোজাদ্বয়ের মধ্যে তোমার উভয় পা পবিত্র অবস্থায় (ওযুর পরে) ঢুকাও তবে (পুনরায় ওযুর সময়) তুমি মোজার উপর মসেহ কর। আবদুল্লাহ (রাঃ) বলিলেনঃ আমাদের এক ব্যক্তি পায়খানা-প্রস্রাব হইতে আসিলে তাহার জন্যও কি এই হুকুম? উমর (রাঃ) বললেনঃ হ্যাঁ, তোমাদের কেউ মলমূত্র ত্যাগ করিয়া আসিলে তাহার জন্যও এই হুকুম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 73,
			"arabicnumber": 73,
			"text": "রেওয়ায়ত ৪৩. নাফি’ হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ) বাজারে (প্রস্রাবের জন্য নির্দিষ্ট স্থানে) প্রস্রাব করিলেন। তারপর অযু করিলেন এবং তাহার মুখমণ্ডল ও উভয় হাত ধুইলেন এবং মাথা মসেহ করিলেন। তারপর তিনি মসজিদে প্রবেশ করার পর তাহাকে জানাযার নামায পড়াইবার জন্য আহ্বান করা হইল, তিনি মোজার উপর মসেহ করিলেন, তারপর জানাযার নামায পড়িলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 74,
			"arabicnumber": 74,
			"text": "রেওয়ায়ত ৪৪. সাঈদ ইবন আবদুর রহমান ইবন রুকাইশ আশআরী (রহঃ) বলেন, আমি আনাস ইবন মালিক (রাঃ)-কে দেখিয়াছি, তিনি কোবা আসিলেন, তারপর প্রস্রাব করিলেন। অতঃপর তাহার নিকট পানি আনা হইলে তিনি ওযু করিলেন, মুখমণ্ডল ধুইলেন, হস্তদ্বয় ধুইলেন কনুই পর্যন্ত, মাথা মসেহ করিলেন, আর মোজার উপর মসেহ করিলেন, তারপর মসজিদে আসিলেন এবং নামায পড়িলেন। ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-কে প্রশ্ন করা হইল এক ব্যক্তি সম্পর্কে যে ব্যক্তি ওযু করিয়াছে নামাযের ওযুর মত, অতঃপর তাহার মোজা পরিধান করিয়াছে। তারপর সে প্রস্রাব করিয়াছে। তারপর মোজা বাহির করিয়া লইয়াছে। অতঃপর মোজা উভয় পায়ে পরিধান করিয়াছে। সেই ব্যক্তি ওযু পুনরায় করিবে কি? তিনি বলিলেনঃ সে মোজা বাহির করিয়া লইবে। তারপর ওযু করিবে এবং উভয় পা ধুইবে। যে লোক উভয় পা মোজায় ওযুর মত পবিত্রাবস্থায় দাখিল করিয়াছে, সেই লোক মোজায় মসেহ করিতে পারবে। আর যে ওযুর মত পবিত্রাবস্থায় উভয় পা মোজায় দাখিল করে নাই সে মোজা মসেহ করিবে না। মালিক (রহঃ)-কে প্রশ্ন করা হইল এমন এক লোক সম্পর্কে, যে ব্যক্তি ওযু করিয়াছে তাহার পরিধানে মোজা থাকা অবস্থায়, কিন্তু সে মোজায় মসেহ করিতে তুলিয়া গিয়াছে। (এই অবস্থায়) তাহার ওযু (ওয়ূর অঙ্গসমূহ) শুকাইয়া গিয়াছে এবং সে নামায পড়িয়াছে। (তাহার হুকুম কি ) তিনি বলিলেনঃ সেই ব্যক্তি মোজার উপর মসেহ করিবে এবং নামায পুনরায় পড়িবে, ওযু পুনরায় করিতে হইবে না। মালিক (রহঃ)-কে প্রশ্ন করা হইল এমন এক লোক সম্পর্কে, যে তাহার দুই পা (প্রথমে) ধুইয়াছে, তারপর মোজা পরিধান করিয়াছে, অতঃপর ওযু শুরু করিয়াছে। তিনি বলিলেনঃ সে মোজা খুলিয়া ফেলিবে, তারপর ওযু করিবে এবং (যথারীতি) উভয় পা ধুইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 75,
			"arabicnumber": 75,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 76,
			"arabicnumber": 76,
			"text": "রেওয়ায়ত ৪৫. হিশাম ইবন উরওয়াহ (রহঃ) হইতে বর্ণিত, তিনি তাহার পিতাকে মোজার উপর মসেহ করিতে দেখিয়াছেন। তিনি মোজা মসেহ করার সময় ইহার অতিরিক্ত কিছু করিতেন না; মোজার উপরের অংশে মসেহ করিতেন, তলদেশ মসেহ করিতেন না। মালিক (রহঃ) ইবন শিহাব (রহঃ)-কে প্রশ্ন করিলেনঃ মোজা মসেহ কিরূপে সম্পাদন করিতে হয়? ইবন শিহাব তাহার এক হাত মোজার নিচে দাখিল করিলেন এবং অপর হাত মোজার উপর স্থাপন করিলেন। অতঃপর উভয় হাত মসেহ-এর জন্য চালিত করিলেন। মালিক (রহঃ) বলিয়াছেনঃ মোজা মসেহ-এর ব্যাপারে আমি যাহা শুনিয়াছি তন্মধ্যে ইবন শিহাবের মতামত আমার নিকট সর্বাপেক্ষা পছন্দনীয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 77,
			"arabicnumber": 77,
			"text": "রেওয়ায়ত ৪৬. নাফি’ (রহঃ) হইতে বর্ণিত, যখন আবদুল্লাহ্ ইবন উমর (রাঃ)-এর নাক দিয়া রক্ত বাহির হইত, তখন নামায হইতে তিনি ফিরিয়া যাইতেন। অতঃপর ওযু করিতেন এবং পুনরায় আসিয়া অবশিষ্ট নামায পড়িতেন, আর তিনি (এই অবস্থায়) কথা বলিতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 78,
			"arabicnumber": 78,
			"text": "রেওয়ায়ত ৪৭. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, আবদুল্লাহ ইবন আব্বাস (রাঃ)-এর নাক দিয়া রক্ত নির্গত হইলে তিনি বাহির হইতেন এবং রক্ত পরিষ্কার করিতেন, তারপর প্রত্যাবর্তন করিয়া নামায যতটুকু পড়িয়াছেন উহার (উপর ভিত্তি করিয়া) অবশিষ্ট নামায পড়িতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 79,
			"arabicnumber": 79,
			"text": "রেওয়ায়ত ৪৮. ইয়াযিদ ইবন আবদুল্লাহ ইবন কুসাইত লাইসী (রহঃ) বলেনঃ তিনি সাঈদ ইবন মুসায়্যাব (রহঃ)-কে দেখিয়াছেন, তিনি যখন নামায পড়িতেছিলেন তখন তাহার নাক দিয়া রক্ত বাহির হইল তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পত্নী উম্মু সালমার হুজরায় আসিলেন। তাহার জন্য পানি আনা হইল, তিনি ওযু করিলেন, তারপর প্রত্যাবর্তন করিলেন এবং নামায যতটুকু বাকি ছিল তাহা আদায় করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 80,
			"arabicnumber": 80,
			"text": "রেওয়ায়ত ৪৯. আবদুর রহমান ইবন হারমলা আসলামী (রহঃ) বলেনঃ আমি সাঈদ ইবন মুসায়্যাব (রহঃ)-কে দেখিয়াছি নকসীরের কারণে তাহার নাক হইতে রক্ত প্রবাহিত হইতেছিল, এমনকি তাহার নাক হইতে প্রবাহিত রক্তের দ্বারা তাহার আঙুল রঞ্জিত হইয়া গেল। অতঃপর তিনি নামায পড়িলেন অথচ ওযু করিলেন না।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 81,
			"arabicnumber": 81,
			"text": "রেওয়ায়ত ৫০. আবদুর রহমান ইবন মুজাব্বার (রহঃ) হইতে বর্ণিত, তিনি সালিম ইবন আবদুল্লাহ (রহঃ)-কে দেখিয়াছেন, তাহার নাক হইতে রক্ত প্রবাহিত হইতেছে, এমনকি (সেই রক্তে) তাহার আঙুলসমূহ রঞ্জিত হইয়া গিয়াছে। অতঃপর তিনি নাক মোচড়াইলেন, তারপর নামায পড়িলেন, অথচ ওযু করিলেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 82,
			"arabicnumber": 82,
			"text": "রেওয়ায়ত ৫১. মিসওয়ার ইবন মাখরামা (রহঃ) হইতে বর্ণিত, যে রাত্রে উমর ইবন খাত্তাব (রাঃ)-কে ছুরিকাঘাত করা হয়, সেই রাত্রে জনৈক ব্যক্তি[1] উমর ইবন খাত্তাব (রাঃ)-এর নিকট প্রবেশ করিল। উমর (রাঃ)-কে ফজরের নামাযের জন্য জাগানো হইল। উমর (রাঃ) বলিলেনঃ হ্যাঁ, আমি এই অবস্থায়ও নামায পড়িব। যে ব্যক্তি নামায ছাড়িয়া দেয়, ইসলামে তাহার কোন অংশ নাই। অতঃপর উমর (রাঃ) নামায পড়িলেন অথচ তাহার জখম হইতে তখন রক্ত প্রবাহিত হইতেছিল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 83,
			"arabicnumber": 83,
			"text": "রেওয়ায়ত ৫২. ইয়াহইয়া ইবন সাঈদ (রহঃ) হইতে বর্ণিত, সাঈদ ইবন মুসায়্যাব (রহঃ) বলিয়াছেনঃ নকসীরের কারণে যে ব্যক্তির রক্ত প্রবল হইয়াছে এবং তাহার রক্ত পড়া বন্ধ হয় নাই সেই ব্যক্তি সম্পর্কে তোমাদের মতামত কি? ইয়াহইয়া ইবন সাঈদ (রহঃ) বলেনঃ অতঃপর সাঈদ ইবন মুসায়্যাব (রহঃ) বলিলেনঃ আমার মতে সে মাথার দ্বারা কেবল ইশারা করিবে। মালিক (রহঃ) বলেনঃ এই বিষয়ে আমি যাহা কিছু শুনিয়াছি তন্মধ্যে ইহাই আমার নিকট উত্তম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 84,
			"arabicnumber": 84,
			"text": "রেওয়ায়ত ৫৩. মিকদাদ ইবন আসওয়াদ (রাঃ) হইতে বর্ণিত, আলী ইবন আবি তালিব (রাঃ) মিকদাদকে নির্দেশ দিলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট তাহার পক্ষে প্রশ্ন করার জন্য। প্রশ্নটি হলো এই-এক ব্যক্তি তাহার স্ত্রীর নিকট যাওয়ায় তাহার লিঙ্গাগ্রে মযী (তরল পদার্থ, শুক্র নহে) বাহির হইয়াছে, সে ব্যক্তির প্রতি কি ওযু ওয়াজিব হইবে। আলী (রাঃ) বলিলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কন্যা যেহেতু আমার স্ত্রী সেহেতু তাহাকে এই ধরনের প্রশ্ন করিতে আমি লজ্জাবোধ করি। মিকদাদ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে উপরিউক্ত প্রশ্ন করিলে তিনি বলিলেন, তোমাদের কেউ অনুরূপ অবস্থার সম্মুখীন হইলে সে নিজের লজ্জাস্থান পানি দ্বারা ধৌত করিবে, তারপর নামাযের ওযুর ন্যায় ওযু করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 85,
			"arabicnumber": 85,
			"text": "রেওয়ায়ত ৫৪. আসলাম (রহঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) বলিয়াছেনঃ আমার ভিতর হইতে উহা মুক্তাদানার মত নির্গত হইতে আমি অনুভব করি। তোমাদের কেউ এই অবস্থা প্রাপ্ত হইলে সে তাহার লজ্জাস্থান ধুইয়া লইবে এবং নামাযের ওযুর মত ওযু করিবে। তিনি (উমর) ইহা দ্বারা মযীর বিষয় বলিতে চাহিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 86,
			"arabicnumber": 86,
			"text": "রেওয়ায়ত ৫৫. জুনদাব (রহঃ) হইতে বর্ণিত, তিনি বলেনঃ আমি আবদুল্লাহ ইবন উমর (রাঃ)-কে মযী সম্পর্কে প্রশ্ন করিলাম। তিনি বলিলেনঃ তুমি উহা প্রাপ্ত হইলে তোমার লজ্জাস্থানকে ধুইয়া লও এবং নামাযের ওযুর মত ওযু কর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 87,
			"arabicnumber": 87,
			"text": "রেওয়ায়ত ৫৬. ইয়াহইয়াহ ইবস সাঈদ (রহঃ) শুনিয়াছেন- সাঈদ ইবন মুসায়াব (রহঃ)-কে এক ব্যক্তি প্রশ্ন করতে সে বলিলঃ আমি নামায পড়িতেছি এই অবস্থায় আর্দ্রতা অনুভব করি। তবে আমি কি (নামায ছাড়িয়া) ফিরিয়া যাইব? সাঈদ বলিলেনঃ আমার রানের উপর দিয়া ভাসিয়া পড়িলেও আমি আমার নামায সমাপ্ত না করিয়া ফিরিব না।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 88,
			"arabicnumber": 88,
			"text": "রেওয়ায়ত ৫৭. সালত ইবন যুয়ায়দ (রহঃ) বলেনঃ আমি সুলায়মান ইবন ইয়াসার (রহঃ)-কে আর্দ্রতা সম্পর্কে প্রশ্ন করিলাম; যা আমি অনুভব করি অর্থাৎ মনে সন্দেহ জাগে হয়তো আদ্ৰতা আছে। তিনি বলিলেনঃ তোমার কাপড়ের (লুঙ্গি অথবা পায়জামা) নিচে পানি ছিটাইয়া দাও। তারপর উহার ফিকির (চিন্তা) ছাড়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 89,
			"arabicnumber": 89,
			"text": "রেওয়ায়ত ৫৮. আবদুল্লাহ ইবন আবু বকর ইবন মুহাম্মদ ইবন আমর ইবন হাযম (রহঃ) হইতে বর্ণিত, তিনি উরওয়াহ ইবন যুবায়র (রহঃ)-কে বলিতে শুনিয়াছেনঃ আমি মারওয়ান ইবন হাকাম (রহঃ)-এর নিকট গেলাম, আমরা উভয়ে ওযূ কিসে ওয়াজিব হয় সেই বিষয়ে আলোচনা করিলাম। মারওয়ান বলিলেনঃ জননেন্দ্রিয় স্পর্শ করিলে ওযু করিতে হইবে। উরওয়াহ বলিলেনঃ আমি তো ইহা জানি না। মারওয়ান বলিলেনঃ বুসরা বিনত সফওয়ান (রাঃ) আমাকে খবর দিয়াছেন যে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলিতে শুনিয়াছেনঃ তোমাদের কোন ব্যক্তি জননেন্দ্রিয় স্পর্শ করিলে ওযু করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 90,
			"arabicnumber": 90,
			"text": "রেওয়ায়ত ৫৯. মুসআব ইবন সা’দ ইবন আবি ওয়াক্কাস (রহঃ) বলেনঃ আমি সা'দ ইবন আবি ওয়াক্কাস (রাঃ)-এর জন্য কুরআন হস্তে ধারণ করিতেছিলাম (যেন তিনি তিলাওয়াত করিতে পারেন), আমি নিজের শরীর চুলকাইলাম (বা ঘর্ষণ করিলাম)। সা'দ বলিলেনঃ সম্ভবত তুমি তোমার জননেন্দ্রিয় স্পর্শ করিয়াছ। আমি বলিলামঃ হ্যাঁ। তিনি বলিলেনঃ তুমি ওঠ এবং ওযু কর; অতঃপর আমি উঠিলাম এবং ওযু করিয়া আবার প্রত্যাবর্তন করিলাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 91,
			"arabicnumber": 91,
			"text": "রেওয়ায়ত ৬০. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) বলিতেনঃ তোমাদের কেউ যদি স্বীয় জননেন্দ্রিয় স্পর্শ করে, তবে সে ওযু করিবে, কারণ তাহার ওপর ওযু ওয়াজিব হইয়াছে।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 92,
			"arabicnumber": 92,
			"text": "রেওয়ায়ত ৬১. উরওয়াহ ইবন যুবায়র (রহঃ) বলতেনঃ যে স্বীয় জননেন্দ্রিয় স্পর্শ করিয়াছে তাহার ওপর ওযু ওয়াজিব হইয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 93,
			"arabicnumber": 93,
			"text": "রেওয়ায়ত ৬২. সালিম ইবন আবদুল্লাহ্ (রহঃ) বলিয়াছেনঃ আমি আমার পিতা আবদুল্লাহ ইবন উমর (রাঃ)-কে দেখিয়াছি, তিনি গোসল করিতেন, তারপর ওযু করিতেন। আমি বলিলামঃ আব্বাজান! গোসল আপনার ওযুর জন্য কি যথেষ্ট হয় না? (অর্থাৎ গোসল দ্বারা ওযুর কাজ হইয়া যায় না?) তিনি বলিলেনঃ হ্যাঁ, যথেষ্ট হয়। কিন্তু আমি কোন কোন সময় জননেন্দ্রিয় স্পর্শ করি। তাই আমি ওযু করি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 94,
			"arabicnumber": 94,
			"text": "রেওয়ায়ত ৬৩. সালিম ইবন আবদুল্লাহ্ (রহঃ) বলেনঃ আমি এক সফরে আবদুল্লাহ ইবন উমর (রাঃ)-এর সঙ্গে ছিলাম। আমি তাহাকে দেখিলাম সূর্য উদয়ের পর ওযু করিলেন, তারপর নামায পড়িলেন। আমি তাহাকে বলিলামঃ (আজকের দিন ব্যতীত) আপনি এই নামায কখনও এই সময়ে পড়েন না। তখন তিনি বলিলেনঃ আমি ফজরের নামাযের জন্য ওযু করার পর আমার লজ্জাস্থান স্পর্শ করিয়াছি। অতঃপর আমি ওযু করিতে ভুলিয়া গিয়াছি। তাই আমি ওযু করিলাম এবং পুনরায় নামায পড়িলাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 95,
			"arabicnumber": 95,
			"text": "রেওয়ায়ত ৬৪. আবদুল্লাহ ইবন উমর (রাঃ) বলিতেনঃ স্বামী কর্তৃক আপন স্ত্রীকে চুম্বন এবং উহাকে হাতে ছোঁয়া মুলামাসত (ملامست)-এর অন্তর্ভুক্ত। যে নিজের স্ত্রীকে চুম্বন করে অথবা তাহাকে হাতে ছোঁয় তাহার ওপর ওযু ওয়াজিব হইবে।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 96,
			"arabicnumber": 96,
			"text": "রেওয়ায়ত ৬৫. মালিক (রহঃ) বলেনঃ তাহার নিকট খবর পৌছিয়াছে যে, আবদুল্লাহ ইবনে মাসউদ (রাঃ) বলিতেনঃ পুরুষ নিজের স্ত্রীকে চুমা খাইলে তাহার ওযু ওয়াজিব হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 97,
			"arabicnumber": 97,
			"text": "রেওয়ায়ত ৬৬. মালিক (রহঃ) বলেনঃ ইবন শিহাব (রহঃ) বললেন, পুরুষ কর্তৃক নিজের স্ত্রীকে চুম্বনের দরুন ওযু করিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 98,
			"arabicnumber": 98,
			"text": "রেওয়ায়ত ৬৭. উম্মুল মুমিনীন আয়েশা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন জানাবত-এর গোসল করিতেন, সর্বপ্রথম উভয় হাত ধৌত করিতেন। অতঃপর নামাযের ওযুর মত ওযু করিতেন। তারপর আঙুলসমূহ পানিতে দাখিল করিতেন, আঙুল দ্বারা চুলের গোড়ায় খিলাল করিতেন। অতঃপর উভয় হাত দিয়া তিন আঁজলা পানি তাহার শিরে ঢালিতেন। অতঃপর সর্বশরীরে পানি ঢালিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 99,
			"arabicnumber": 99,
			"text": "রেওয়ায়ত ৬৮. উম্মুল মুমিনীন আয়েশা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন একটি পাত্র হইতে, যাহাতে দুই অথবা তিন সা' (প্রায় চার অথবা ছয় সের পরিমাণ) পানি ধরিত, জানাবতের গোসল করিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 100,
			"arabicnumber": 100,
			"text": "রেওয়ায়ত ৬৯. নাফি (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) যখন জানাবতের গোসল করিতেন, তিনি সর্বপ্রথম ডান হাতে পানি ঢালিতেন এবং উহাকে ধৌত করিতেন, অতঃপর লজ্জাস্থান ধুইতেন। তারপর কুলি করিতেন এবং নাক পরিষ্কার করিতেন। তারপর মুখমণ্ডল ধুইতেন এবং উভয় চক্ষুতে পানি ছিটা দিতেন। অতঃপর পুনরায় ডান হাত, তারপর বাম হাত ও মাথা ধুইতেন। তারপর (পূর্ণাঙ্গ) গোসল করিতেন এবং তাহার (দেহের) উপর পানি ঢালিয়া দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 101,
			"arabicnumber": 101,
			"text": "রেওয়ায়ত ৭০. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, উম্মুল মুমিনীন আয়েশা (রাঃ)-কে মেয়েদের জানাবতের গোসল সম্পর্কে প্রশ্ন করা হইল। তিনি বলিলেনঃ স্ত্রীলোক তাহার মাথায় তিন চুল্লু পানি ঢালিবে এবং উভয় হাত দ্বারা মাথা (মাথার চুল) কচলাইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 102,
			"arabicnumber": 102,
			"text": "রেওয়ায়ত ৭১. সাঈদ ইবন মুসায়্যাব (রহঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব, উসমান ইবন আফফান (রাঃ) ও নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলতেনঃ যখন (পুরুষের) লজ্জাস্থান (স্ত্রীর) লজ্জাস্থান স্পর্শ করিল তখন অবশ্য গোসল ওয়াজিব হইয়া গেল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 103,
			"arabicnumber": 103,
			"text": "রেওয়ায়ত ৭২. আবু সালমা ইবন আবদুর রহমান ইবন আউফ (রহঃ) বলেনঃ আমি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পত্নী আয়েশা (রাঃ)-কে প্রশ্ন করিলাম, কোন কাজ গোসলকে ওয়াজিব করে? তিনি বলিলেনঃ হে আবু সালমা! তুমি জান, তোমার দৃষ্টান্ত কি? তোমার দৃষ্টান্ত হইতেছে মুরগীর বাচ্চার মত,[1] যে মোরগকে যখন ডাক দিতে শোনে, তখন সেও মোরগের সহিত ডাক দেয়। শোন, (পুরুষের) লজ্জাস্থান (স্ত্রীর) লজ্জাস্থান অতিক্রম করিলে গোসল ওয়াজিব হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 104,
			"arabicnumber": 104,
			"text": "রেওয়ায়ত ৭৩. সাঈদ ইবন মুসায়্যাব (রহঃ) হইতে বর্ণিত, আবু মূসা আশ'আরী (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ)-এর নিকট উপস্থিত হইলেন। তিনি বলিলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবাদের মতানৈক্য আমার নিকট খুব ভারী ও কষ্টদায়ক হইয়াছে এবং তাহা এমন একটি বিষয়ে যাহা আপনার সমীপে উল্লেখ করা আমি মহাব্যাপার মনে করি। আয়েশা সিদীকা (রাঃ) বললেনঃ কি বিষয় উহা? তুমি যে বিষয় তোমার মাতার নিকট প্রশ্ন করিতে পার, সেই বিষয়ে আমার নিকটও প্রশ্ন করিতে পার। তারপর আবু মূসা (রাঃ) বলিলেনঃ কোন লোক তাহার স্ত্রীর সহিত সহবাস করার পর সে ক্লান্ত হইয়াছে এবং বীর্য নির্গত হয় নাই। সে কি করিবে? তিনি বলিলেনঃ (পুরুষের) লজ্জাস্থান (স্ত্রীলোকের) লজ্জাস্থান অতিক্রম করিলে গোসল ওয়াজিব হইবে। আবু মূসা (রাঃ) বলিলেনঃ আপনাকে জিজ্ঞাসা করার পর আমি এই বিষয় অন্য কাহারও নিকট আর কখনও জিজ্ঞাসা করিব না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 105,
			"arabicnumber": 105,
			"text": "রেওয়ায়ত ৭৪. মাহমুদ ইবন লবীদ আনসারী (রাঃ) যায়দ ইবন সাবিত আনসারী (রাঃ)-এর নিকট প্রশ্ন করিলেন, সেই লোক সম্পর্কে যে লোক নিজের স্ত্রীর সহিত সহবাস করিয়াছে, তারপর ক্লান্ত হইয়া পড়িয়াছে, বীর্য বাহির হয় নাই। তিনি বলিলেনঃ সে গোসল করবে। মাহমুদ (রাঃ) বলিলেনঃ উবাই ইবন কা'ব (রাঃ) গোসল (এই অবস্থায়) জরুরী মনে করিতেন না। যায়দ (রাঃ) বললেন, মৃত্যুর পূর্বে উবাই ইবন কা'ব (রাঃ) এই মত প্রত্যাহার করিয়াছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 106,
			"arabicnumber": 106,
			"text": "রেওয়ায়ত ৭৫. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ) বলিলেনঃ (পুরুষের) লজ্জাস্থান স্ত্রীলোকের লজ্জাস্থান অতিক্রম করিলে গোসল ওয়াজিব হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 107,
			"arabicnumber": 107,
			"text": "রেওয়ায়ত ৭৬. আবদুল্লাহ ইবন উমর (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সমীপে উমর ইবন খাত্তাব (রাঃ) উল্লেখ করিলেন, রাত্রিতে তাহার জানাবত অর্থাৎ অপবিত্রতা হয় (স্বপ্লদোষ বা স্ত্রী সহবাসের দরুন)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাকে বলিলেনঃ তুমি ওযু কর এবং জননেন্দ্রিয় ধুইয়া ফেল, তারপর ঘুমাও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 108,
			"arabicnumber": 108,
			"text": "রেওয়ায়ত ৭৭. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলিতেনঃ তোমাদের কেউ স্ত্রী সহবাস করিলে, অতঃপর গোসলের পূর্বে ঘুমাইতে ইচ্ছা করিলে সে নামাযের ওযুর মত ওযু না করিয়া ঘুমাইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 109,
			"arabicnumber": 109,
			"text": "রেওয়ায়ত ৭৮. নাফি’ (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) জানাবত হালতে ঘুমাইতে অথবা আহার করিতে ইচ্ছা করিলে তিনি মুখমণ্ডল ও উভয় হাত কনুই পর্যন্ত ধুইতেন এবং মাথা মসেহ করিতেন। তারপর আহার করিতেন অথবা ঘুমাইতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 110,
			"arabicnumber": 110,
			"text": "রেওয়ায়ত ৭৯. ইসমাঈল ইবন আবি হাকীম (রহঃ) হইতে বর্ণিত, 'আতা ইবন ইয়াসার (রহঃ) তাহাকে বলিয়াছেনঃ কোন এক নামাযে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তকবীর বললেন। অতঃপর হাত দিয়া তাহদের (নামাযে শরীক উপস্থিত সাহাবীদের) দিকে ইশারা করিলেনঃ তোমরা নিজ নিজ স্থানে অবস্থান কর। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রস্থান করিলেন। অতঃপর প্রত্যাবর্তন করিলেন (এমন অবস্থায় যে), তাহার (পবিত্র) দেহের উপর পানির আলামত বিদ্যমান ছিল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 111,
			"arabicnumber": 111,
			"text": "রেওয়ায়ত ৮০. যুয়ায়দ ইবন সালত (রহঃ) বলেনঃ আমি উমর ইবন খাত্তাব (রাঃ)-এর সহিত বাহির হইলাম জুরুফ-এর (মদীনা হইতে তিন মাইল দূরের একটি পল্লী) দিকে। তাহার স্বপ্লদোষ হইল এবং তিনি গোসল না করিয়া (ভুলে) নামায পড়িলেন। অতঃপর তিনি বলিলেনঃ কসম আল্লাহর! আমার মনে হয়, আমার অবশ্য ইহতিলাম (স্বপ্লদোষ) হইয়াছে অথচ আমি খবর রাখি না এবং আমি গোসল না করিয়া নামায পড়িয়াছি। তারপর তিনি গোসল করিলেন এবং কাপড়ে যা চিহ্ন দেখিলেন উহা ধুইলেন, যেখানে চিহ্ন নাই সেইখানে পানি ছিটাইয়া দিলেন। তারপর আযান ও ইকামত বলিলেন। অতঃপর দিবসের প্রথমাংশ সূর্য উচ্চতায় পৌছার পর নামায পড়িলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 112,
			"arabicnumber": 112,
			"text": "রেওয়ায়ত ৮১. সুলায়মান ইবন ইয়াসার (রহঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) দিনের প্রথমাংশে জুরুফ নামক স্থানে অবস্থিত তাহার জমির দিকে গমন করিলেন। তিনি তাহার কাপড়ে স্বপ্লদোষের আলামত দেখিতে পাইলেন। তিনি বলিলেনঃ যখন হইতে লোকের দায়িত্ব আমার উপর ন্যস্ত করা হইয়াছে, তখন হইতে আমি ইহতিলামে লিপ্ত হইয়াছি। তারপর তিনি গোসল করিলেন এবং তাহার কাপড়ে স্বপ্নদোষের যা আলামত দেখিলেন উহ ধুইলেন। তারপর সূর্য ওঠার পর তিনি নামায পড়িলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 113,
			"arabicnumber": 113,
			"text": "রেওয়ায়ত ৮২. সুলায়মান ইবন ইয়াসার (রহঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) লোকের সহিত (জামাতে) ফজরের নামায পড়িলেন, অতঃপর সকালবেলা জুরুফ'-এ (جرف) অবস্থিত তাহার জমির দিকে গমন করিলেন। তারপর তাহার কাপড়ে ইহতিলামের (চিহ্ন) দেখিতে পাইলেন। তিনি বলিলেনঃ আমরা চর্বি (চর্বিযুক্ত খাদ্যদ্রব্য) যখন হইতে আহার করিতেছি তখন হইতে আমাদের শিরাসমূহ কোমল হইয়াছে। তারপর তিনি গোসল করিলেন এবং কাপড় হইতে ইহতিলাম (এর চিহ্ন) ধুইয়া ফেলিলেন এবং নামায পুনরায় পড়িলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 114,
			"arabicnumber": 114,
			"text": "রেওয়ায়ত ৮৩. ইয়াহইয়াহ ইবন আবদুর রহমান (রহঃ) তাহার পিতা হইতে বর্ণনা করেন যে, তিনি উমর ইবন খাত্তাব (রাঃ)-এর সঙ্গে উমরাহ করিলেন একই কাফেলায়। আর সেই কাফেলায় আমর ইবনুল আস্ (রাঃ)-ও ছিলেন। উমর ইবন খাত্তাব (রাঃ) কোন পানির (চশমা বা কূপ) নিকটবর্তী এক রাস্তায় (রাস্তার পাশে) রাত্রির শেষাংশে অবতরণ করিলেন। উমর (রাঃ)-এর ইহতিলাম হইল। (এইদিকে) ফজর হইতে লাগিল কিন্তু কাফেলার সহিত পানি পাওয়া গেল না। তিনি সওয়ার হইয়া পানির নিকট আসিলেন। অতঃপর তিনি ইহতিলামের যা চিহ্ন দেখিলেন উহা ধুইতে লাগিলেন, তখন ফরসা হইয়া গিয়াছে। আমর ইবনুল আস (রাঃ) তাহাকে বলিলেনঃ আপনি ভোর করিলেন অথচ আমাদের সহিত কাপড় রহিয়াছে, আপনি আপনার বস্ত্র রাখিয়া দিন, (পরে) ধোয়া হইবে। উমর ইবন খাত্তাব (রাঃ) বলিলেনঃ ইবনুল ‘আস্! আশ্চর্য তোমার প্রতি! তোমার যদিও অনেক বস্ত্র আছে, কিন্তু প্রত্যেক ব্যক্তির নিকট কি তদ্রুপ আছে? আল্লাহর কসম, আমি যদি ইহা করি তবে ইহা সুন্নতে পরিণত হইবে। আমি বরং যাহা আলামত দেখিব উহা ধুইব, আর যাহা দেখা না যায় উহাতে পানি ছিটাইয়া দিব। মালিক (রহঃ) বলেনঃ যে ব্যক্তি তাহার কাপড়ে ইহতিলামের আলামত দেখিতে পায়, কোন সময় ইহতিলাম হইয়াছে সে তাহা জানে না, স্বপ্নে যা দেখিয়াছে তাহাও স্মরণ নাই, তবে সে সদ্য যে নিদ্রা হইতে জাগিয়াছে উহাতে (ইহতিলাম হইয়াছে বলিয়া গণ্য করিয়া) গোসল করবে। যদি সে এই নিদ্রার পর নামায পড়িয়া থাকে তবে সেই নামায পুনরায় পড়িবে। কারণ লোকের (অনেক সময়) ইহতিলাম হয় কিন্তু কোন কিছু (স্বপ্নে) দেখে না, আবার কোন সময় স্বপ্ন দেখে কিন্তু ইহতিলাম হয় না। তাই কাপড়ে যদি পানি দেখে (ইহতিলাম স্মরণ না থাকিলেও) তবে তাহার উপর গোসল ওয়াজিব হইবে। কারণ উমর ইবন খাত্তাব (রাঃ) এই ঘটনায় শেষ বারের নিদ্রা হইতে জাগ্রত হইবার পর যে নামায পড়িয়াছিলেন তিনি সেই নামায পুনরায় পড়িয়াছেন, উহার পূর্ববর্তী নামায অর্থাৎ ঐ নিদ্রার পূর্বের নামায তিনি কাযা করেন নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 115,
			"arabicnumber": 115,
			"text": "রেওয়ায়ত ৮৪. উরওয়াহ ইবন যুবায়র (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উম্মু সুলায়ম বিনতে মিলহান (রাঃ) বলিলেনঃ স্ত্রীলোক স্বপ্নে দেখিলে যেমন (স্বপ্ন) দেখিয়া থাকে পুরুষ, (সেই) স্ত্রীলোক গোসল করিবে কি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাকে বলিলেনঃ হ্যাঁ, সে গোসল করবে। আয়েশা (রাঃ) তাহাকে (উম্মু সুলায়মকে) বলিলেনঃ উঃ তোমার সর্বনাশ হোক! স্ত্রীলোকও কি উহা দেখে। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাকে [আয়েশা (রাঃ)-কে] বললেনঃ (تَرِبَتْ يَمِينُكِ) তোমার ডান হস্ত ধূলিধূসরিত হোক। (স্ত্রীলোকের উহা না হইলে) তবে (সন্তান-এর) সাদৃশ্য আসে কোথা হইতে? অর্থাৎ সন্তান মায়ের মত হয় কিরূপে?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 116,
			"arabicnumber": 116,
			"text": "রেওয়ায়ত ৮৫. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী উম্মু সালমা (রাঃ) বলেনঃ আবূ তালহা আনসারী (রাঃ)-এর স্ত্রী উম্মু সুলায়ম রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর খিদমতে হাজির হইলেন এবং আরজ করিলেনঃ হে আল্লাহর রাসূল! আল্লাহ হক কথা বলতে লজ্জা করেন না, স্ত্রীলোকের স্বপ্লদোষ হইলে তাহার উপর গোসল ওয়াজিব হইবে কি? তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলিলেনঃ হ্যাঁ, পানি দেখিলে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 117,
			"arabicnumber": 117,
			"text": "রেওয়ায়ত ৮৬. নাফি’ (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) বলিতেনঃ স্ত্রীলোকের গোসলের অবশিষ্ট পানি দ্বারা গোসল করাতে কোন দোষ নাই (অর্থাৎ ইহা জায়েয)। যদি স্ত্রীলোক ঋতুমতী (حائض) অথবা জুনুবী না হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 118,
			"arabicnumber": 118,
			"text": "রেওয়ায়ত ৮৭. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) পরিধানের কাপড়ে ঘর্মাক্ত হইতেন অথচ তখন তিনি জুনুবী। অতঃপর সেই কাপড়েই গোসলের পর তিনি নামায পড়িতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 119,
			"arabicnumber": 119,
			"text": "রেওয়ায়ত ৮৮. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ)-এর বাঁদিগণ তাহার পদদ্বয় ধৌত করিত এবং তাহাকে খুমরা (خمرة) ছোট মুসল্লা বা জায়নামায প্রদান করিত, অথচ তাহারা তখন ঋতুমতী। মালিক (রহঃ)-কে প্রশ্ন করা হইল এক ব্যক্তি সম্পর্কে, যে ব্যক্তির একাধিক স্ত্রী ও বাদী রহিয়াছে, সেই ব্যক্তি গোসলের পূর্বে সকলের (স্ত্রী ও বাদিগণের) সঙ্গে সহবাস করিতে পারবে কি? (উত্তরে) তিনি বলিলেনঃ জানাবতের গোসলের পূর্বে বাদীর সহিত সহবাস করা দোষের বিষয় নয় (অর্থাৎ ইহা জায়েয)। কিন্তু স্বাধীন স্ত্রীগণের ব্যাপারে মাসআলা এই- কোন ব্যক্তির পক্ষে নিজের স্ত্রীর (অধিকারের) দিনে (নিজের) আর এক স্ত্রীর সঙ্গে মিলিত হওয়া মাকরূহ। তবে কোন লোকের জন্য (তাহার) এক বাদীর সহিত সহবাস করিয়া অতঃপর আর এক বাদীর সহিত জুনুব থাকা অবস্থায় মিলিত হওয়া দোষের ব্যাপার নহে। মালিক (রহঃ)-কে প্রশ্ন করা হইল এমন এক জুনুবী ব্যক্তি সম্পর্কে, যে ব্যক্তির জন্য পানি রাখা হইয়াছে যাহা হইতে সে ব্যক্তি ফরয গোসল করিবে, তারপর সে ভুলবশত সেই পানিতে তাহার আঙ্গুল দাখিল করিয়াছে যাহাতে ঠাণ্ডা ও গরমের (মাত্রা) নির্ণয় করিতে পারে। (উত্তরে) মালিক (রহঃ) বলেনঃ তাহার আঙুলসমূহে কোন নাপাকী না পৌছিয়া থাকিলে তবে তাহার এই কাজে পানি নাপাক হইবে বলিয়া আমি মনে করি না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 120,
			"arabicnumber": 120,
			"text": "রেওয়ায়ত ৮৯. উম্মুল মুমিনীন আয়েশা (রাঃ) বলিয়াছেনঃ আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে সফরে গমন করিলাম। যখন আমরা বায়দা (بيداء) অথবা (তিনি বলিয়াছেন) যাতুল-জাইশ (নামক স্থান)-এ পৌছিলাম, তখন আমার একটি মালা হারান গেল। উহা অনুসন্ধানের জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (সেখানে) অবস্থান করিলেন এবং লোকজনও তাহার সহিত অবস্থান করিলেন। তাহারা কোন পানির (কূপ বা নহর) কাছে ছিলেন না এবং তাঁহাদের সঙ্গেও পানি ছিল না। লোকজন আবু বকর সিদ্দীক (রাঃ)-এর নিকট উপস্থিত হইলেন এবং ঘটনা বিবৃত করিলেন। তাহারা বললেনঃ আয়েশা (রাঃ) কি করিয়াছেন তাহা কি আপনি জানেন না? (তিনি) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এবং অন্য লোকদিগকে অবস্থানে বাধ্য করিয়াছেন। অথচ তাহারা পানির কাছে নহেন এবং তাহদের সঙ্গে পানিও নাই। আয়েশা (রাঃ) বলেনঃ তারপর আবু বকর (রাঃ) আমার নিকট আসিলেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহার (পবিত্র) শির আমার উরুর উপর স্থাপন করিয়া ঘুমাইতেছিলেন। তিনি [আবু বকর (রাঃ)] বললেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং লোকদিগকে তুমি আটকাইয়া রাখিয়াছ। অথচ তাহারা পানির পার্শ্বে নহেন এবং তাহাদের সাথে পানিও নাই। আয়েশা (রাঃ) বলিলেনঃ তারপর আবু বকর (রাঃ) আমার প্রতি ক্রোধ প্রকাশ করিলেন এবং আমাকে তিরস্কার করিলেন। আর তাহার হাত দিয়া আমার কোমরে খোচা মারিতে লাগিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর (পবিত্র) শির আমার উরুর উপর স্থাপিত থাকার দরুন আমি (খোচা মারা সত্ত্বেও) নড়াচড়া করিতেছিলাম না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অতঃপর ঘুমাইয়া পড়িলেন এমন কি এই পানিহীন অবস্থায় ভোর হইল। তারপর আল্লাহ তা'আলা তাইয়াম্মুমের আয়াত নাযিল করিলেন। তারপর তাহারা সকলে তাইয়াম্মুম করিলেন। উসায়দ ইবন হুযায়র (রাঃ) বললেনঃ হে আবু বকরের পরিজন ইহা (অর্থাৎ তাইয়াম্মুমের আয়াত অবতীর্ণ হওয়া) আপনাদের প্রথম বরকত নহে। (অর্থাৎ মুসলিমগণ আপনাদের দ্বারা নানাভাবে উপকৃত হইয়াছেন) আয়েশা (রাঃ) বলিলেনঃ তারপর আমি যে উটের উপর আরোহণ করিয়াছিলাম উহাকে উঠাইলাম এবং উহার নিচে মালা পাইলাম। মালিক (রহঃ)-কে প্রশ্ন করা হইল এক ব্যক্তি সম্পর্কে, যে ব্যক্তি উপস্থিত নামাযের জন্য তাইয়াম্মুম করিয়াছে। অতঃপর পরবর্তী নামায উপস্থিত হইয়াছে, ঐ লোক কি সেই নামাযের জন্য (আবার) তাইয়াম্মুম করবে, না সেই (পূর্ববর্তী) তাইয়াম্মুম তাহার জন্য যথেষ্ট হইবে? উত্তরে তিনি বলিলেনঃ প্রত্যেক (ফরয) নামাযের জন্য তাইয়াম্মুম করবে। কারণ (সময় উপস্থিত হইলে) প্রত্যেক নামাযের জন্য পানির অনুসন্ধান করা তাহার ওয়াজিব। যে ব্যক্তি পানির অনুসন্ধান করিল কিন্তু পানি পাইল না, সে তাইয়াম্মুম করিবে। মালিক (রহঃ)-কে প্রশ্ন করা হইল এমন এক ব্যক্তি সম্পর্কে, যে ব্যক্তি তাইয়াম্মুম করিয়াছে এবং তাহার সাথীগণ যাহারা ওযু করিয়াছেন সে তাহাদের ইমামতি করিতে পারবে কি? (উত্তরে) তিনি বলিলেন, সেই ব্যক্তি ব্যতীত অন্য কেউ ইমামতি করিলে তাহা আমার নিকট পছন্দনীয়, আর যদি সে তাহাদের ইমামতি করিয়া থাকে, তবে তাহাতেও আমি কোন দোষ দেখি না। মালিক (রহঃ) বলিয়াছেন, এক ব্যক্তি পানি না পাইয়া তাইয়াম্মুম করিয়াছে, তারপর সে নামাযে দাঁড়াইয়াছে এবং তকবীর বলিয়া নামায আরম্ভ করিয়াছে। অতঃপর একজন লোক পানিসহ তাহার নিকট আগমন করিল। তিনি বলেনঃ সে নামায ছাড়িবে না, বরং তাইয়াম্মুম দ্বারা সেই নামায পূর্ণ করিবে এবং আগামী নামাযের জন্য ওযু করবে। মালিক (রহঃ) বলিয়াছেন, যে ব্যক্তি নামাযের (প্রস্তুতির) জন্য দাঁড়াইয়াছে; কিন্তু সে পানি না পাইয়া আল্লাহর নির্দেশ মুতাবিক তাইয়াম্মুমের আমল করিয়াছে তবে সেই ব্যক্তি মহান আল্লাহর আনুগত্যই করিয়াছে। পক্ষাত্তরে যে ব্যক্তি পানি পাইয়াছে (ও ওযু করিয়াছে) তাহা (উপরিউক্ত তাইয়াম্মুমকারী) অপেক্ষা সেই ব্যক্তি বেশি পবিত্র ও নামাযের পূর্ণতাকারী বলিয়া গণ্য হইবে না; কারণ তাহারা উভয়েই নির্দেশপ্রাপ্ত এবং প্রত্যেকে মহিমান্বিত আল্লাহ্‌র পক্ষ হইতে যাহা নির্দেশ পাইয়াছে সেই মুতাবিক আমল করিয়াছে। যে ব্যক্তি পানি পাইয়াছে সেই ব্যক্তির আমল হইল ওযু, যেমন আল্লাহ্ তা'আলা তাহাকে নির্দেশ করিয়াছেন, আর যে ব্যক্তি নামায শুরুর পূর্বে পানি পায় নাই সেই ব্যক্তির জন্য (নির্দেশ) হইল তাইয়াম্মুম। মালিক (রহঃ) বলিয়াছেন, জুনুবী ব্যক্তি তাইয়াম্মুম করিবে এবং কুরআন হইতে তাহার নির্ধারিত অংশ তিলাওয়াত করিবে এবং নফল নামায পড়িবে যতক্ষণ পর্যন্ত পানি না পায়। তবে ইহা সেই স্থানের জন্য যে স্থানে তাহার জন্য তাইয়াম্মুম দ্বারা নামায পড়া বৈধ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 121,
			"arabicnumber": 121,
			"text": "রেওয়ায়ত ৯০. নাফি (রহঃ) হইতে বর্ণিত, তিনি স্বয়ং এবং আবদুল্লাহ ইবন উমর (রাঃ) যাত্রা আরম্ভ করিলেন। জুরুফ (جرف) হইতে তাহারা উভয়ে মিরবদ (مربد) নামক স্থানে পৌছার পর আবদুল্লাহ (রাঃ) অবতরণ করলেন এবং পবিত্র মাটি দ্বারা তাইয়াম্মুম করিলেন- তাহার মুখমণ্ডল ও হস্তদ্বয় কনুই পর্যন্ত মসেহ করিলেন। অতঃপর নামায পড়িলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 122,
			"arabicnumber": 122,
			"text": "রেওয়ায়ত ৯১. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) হস্তদ্বয়ের উভয় কনুই পর্যন্ত তাইয়াম্মুমে মসেহ করিতেন। মালিক (রহঃ)-কে প্রশ্ন করা হইলঃ তাইয়াম্মুম কিরূপে এবং (হস্তদ্বয়ে তাইয়াম্মুম করার সময়) কোন স্থান পর্যন্ত তাহা পৌছাইবে? তিনি (উত্তরে) বলিলেনঃ একবার মাটিতে হাত রাখিবে মুখমণ্ডলের নিমিত্ত আর এক দফা রাখিবে হস্তদ্বয়ের সমূহের জন্য এবং হস্তদ্বয় উভয় কনুই পর্যন্ত মসেহ করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 123,
			"arabicnumber": 123,
			"text": "রেওয়ায়ত ৯২. এক ব্যক্তি সাঈদ ইবন মুসায়্যাব (রহঃ)-কে প্রশ্ন করিল এমন এক জুনুবী ব্যক্তি সম্পর্কে, যে তাইয়াম্মুম করার পর পানি পাইয়াছে। সাঈদ (রহঃ) উত্তরে বলিলেনঃ পানি পাইলে আগামী নামাযের জন্য তাহার ওপর গোসল ওয়াজিব হইবে। মালিক (রহঃ) বলিয়াছেন, এমন এক ব্যক্তি যাহার ইহতিলাম হইয়াছে অথচ সে মুসাফির। কেবল ওযুর পরিমাণ পানি ব্যতীত তাহার নিকট আর পানি নাই এবং পানি পর্যন্ত পৌছার পূর্বে সে পিপাসিত হইবে না। তিনি বলিলেনঃ সেই পানি দ্বারা সে তাহার লজ্জাস্থান এবং যে স্থানে নাপাকী লাগিয়াছে তাহা ধুইবে। অতঃপর আল্লাহর নির্দেশ মুতাবিক পবিত্র মাটি দ্বারা তাইয়াম্মুম করবে। মালিক (রহঃ)-কে প্রশ্ন করা হইল এমন এক জুনুবী ব্যক্তি সম্পর্কে যে তাইয়াম্মুম করিতে ইচ্ছা করিয়াছে; কিন্তু সে লবণাক্ত মাটি ছাড়া অন্য মাটি পাইল না। তবে সে কি লবণাক্ত মাটি দ্বারা তাইয়াম্মুম করিবে? আরও প্রশ্ন করা হইলঃ লবণাক্ত মাটিতে নামায পড়া কি মাকরূহ? (উত্তরে) মালিক (রহঃ) বলিলেনঃ লবণাক্ত মাটিতে নামায পড়াতে এবং লবণাক্ত মাটি দ্বারা তাইয়াম্মুম করাতে কোন দোষ নাই। কারণ আল্লাহ তা'আলা বলিয়াছেনঃ (فَتَيَمَّمُوا صَعِيدًا طَيِّبًا) তোমরা পবিত্র মাটির দ্বারা তাইয়াম্মুম কর (সূরা মায়িদাঃ ৬)। ফলে যে-কোন পবিত্র মটি তাইয়াম্মুমের উপযুক্ত বলিয়া গণ্য হইবে। লবণাক্ত হোক অথবা না হোক।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 124,
			"arabicnumber": 124,
			"text": "রেওয়ায়ত ৯৩. যায়দ ইবনে আসলাম (রহঃ) হইতে বর্ণিত, একজন সাহাবী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট প্রশ্ন করিলেনঃ আমার স্ত্রী ঋতুমতী থাকিলে আমার জন্য তাহার কতটুকু হালাল? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করিলেনঃ স্ত্রীলোক তাহার ইযার (পায়জামা বা পরনের জন্য কাপড়) শক্ত করিয়া বাধিবে। অতঃপর তোমার জন্য তাহার উপরের অংশ দ্বারা উপকৃত হওয়া বৈধ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 125,
			"arabicnumber": 125,
			"text": "রেওয়ায়ত ৯৪. রবি’আ ইবনে আবি আবদির রহমান (রহঃ) হইতে বর্ণিত, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে এক চাদরে (আবৃত অবস্থায়) শায়িতা ছিলেন। তখন আয়েশা (রাঃ) তড়িঘড়ি করিয়া উঠিয়া পড়িলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁহাকে বলিলেন, তোমার কি ঘটিয়াছে। সম্ভবত তোমার নিফাস অর্থাৎ হায়েয হইয়াছে। তিনি বলিলেনঃ হ্যাঁ। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, তবে তুমি তোমার ইযার (পায়জামা বা তহবন্দ) শক্ত করিয়া বাঁধ, তারপর তোমার বিছানায় প্রত্যাবর্তন কর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 126,
			"arabicnumber": 126,
			"text": "রেওয়ায়ত ৯৫. উবায়দুল্লাহ ইবন আবদুল্লাহ উমর (রহঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ)-এর নিকট লোক প্রেরণ করিলেন এই প্রশ্ন করার জন্য, স্ত্রী ঋতুমতী হইলে স্বামী সেই স্ত্রীর সহিত মিলিত হইবে কি? তিনি বলিলেনঃ (স্ত্রী) তাহার নিচের অংশে ইযার (পরিধানের কাপড়) শক্ত করিয়া বাঁধিবে, অতঃপর স্বামী ইচ্ছা করিলে তাহার সহিত মিলিত হইবে। (কিন্তু সহবাস হইতে বিরত থাকিবে, এইজন্যই ইযার শক্ত করিয়া বাধিতে নির্দেশ দেওয়া হইয়াছে।)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 127,
			"arabicnumber": 127,
			"text": "রেওয়ায়ত ৯৬. মালিক (রহঃ) বলেন, তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, সালিম ইবন আবদুল্লাহ্ ও সুলায়মান ইবন ইয়াসার (রাঃ)-কে প্রশ্ন করা হইল ঋতুমতী স্ত্রীলোক সম্পর্কে, সে গোসলের পূর্বে পবিত্রতা (مسهير) লক্ষ করিলে তাহার স্বামী তাহার সহিত সহবাস করিতে পারিবে কি? তাহারা (উভয়ে) বলিলেনঃ গোসল না করা পর্যন্ত পারিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 128,
			"arabicnumber": 128,
			"text": "রেওয়ায়ত ৯৭. মার্জনা (مَوْلاَةِ عَائِشَةَ) হইতে বর্ণিত,তিনি বলেনঃ (ঋতুমতী) স্ত্রীলোকেরা আয়েশা (রাঃ)-এর নিকট ঝোলা বা ডিবা (دُرْجَة) পাঠাইতেন, যাহাতে নেকড়া বা তুলা (كُرْسُفْ) থাকিত। উহাতে পাণ্ডুবৰ্ণ ঋতুর রক্ত লাগিয়া থাকিত। তাহারা এই অবস্থায় নামায পড়া সম্পর্কে তাহার নিকট জানিতে চাহিতেন। তিনি [আয়েশা (রাঃ)] তাহাদিগকে বলিতেনঃ তাড়াহুড়া করিও না, যতক্ষণ পর্যন্ত পূর্ণ সাদা (বর্ণ) দেখিতে না পাও। তিনি ইহা দ্বারা ঋতু হইতে পবিত্রতা (طُهْر) বুঝাইতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 129,
			"arabicnumber": 129,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 130,
			"arabicnumber": 130,
			"text": "রেওয়ায়ত ১০০. মালিক (রহঃ) বলেন, তিনি জ্ঞাত হইয়াছেন যে, যে গর্ভবতী স্ত্রীলোক রক্ত দেখিতে পায় তাহার সম্পর্কে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলিয়াছেন, সে নামায পড়িবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 131,
			"arabicnumber": 131,
			"text": "রেওয়ায়ত ১০১. মালিক (রহঃ) ইবনে শিহাব (রহঃ)-কে প্রশ্ন করিয়াছেনঃ যে গর্ভবতী স্ত্রীলোক রক্ত দেখিতে পায় সে কি করিবে? তিনি বলিলেনঃ সে নামায হইতে বিরত থাকিবে । ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ) বলিয়াছেনঃ উক্ত হুকুম আমাদের গৃহীত সিদ্ধান্ত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 132,
			"arabicnumber": 132,
			"text": "রেওয়ায়ত ১০২. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর শির (মুবারক)-এ চিরুনি করিতাম, অথচ তখন আমি ছিলাম ঋতুমতী।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 133,
			"arabicnumber": 133,
			"text": "রেওয়ায়ত ১০৩. আসমা বিনত আবু বকর সিদ্দীক (রাঃ) বলেন, জনৈক স্ত্রীলোক রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে প্রশ্ন করিলেন আমাদের মধ্যে একজনের কাপড়ে ঋতুস্রাবের রক্ত লাগিলে সে কি করিবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন তোমাদের কোন স্ত্রীলোকের কাপড়ে হায়েযের রক্ত লাগিলে উহাকে খোচাইয়া পানি দ্বারা ধুইয়া ফেলিবে। অতঃপর সেই কাপড়ে নামায পড়িবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 134,
			"arabicnumber": 134,
			"text": "রেওয়ায়ত ১০৪. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলেন, ফাতিমা বিনত আবি হুবাইসা (রাঃ) বলিলেনঃ ইয়া রাসূলাল্লাহ! আমি পবিত্ৰ হই না (অর্থাৎ রক্তস্রাব বন্ধ হয় না।) আমি নামায পড়িব কি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাকে বলিলেনঃ উহা একটি রোগ (শিরামাত্র), হায়েয নহে। তাই যখন হায়েয আরম্ভ হয় তখন নামায ছাড়িয়া দাও। হয়েযের (দিবসের) পরিমাণ দিন অতিবাহিত হইলে তুমি তোমার রক্ত ধৌত কর, তারপর নামায পড়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 135,
			"arabicnumber": 135,
			"text": "রেওয়ায়ত ১০৫. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী উম্মু-সালমা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে জনৈকা স্ত্রীলোকের (রক্তস্রাব বন্ধ হইত না), রক্ত প্রবাহিত হইত। তাহার সম্পর্কে উম্মু-সালমা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে প্রশ্ন করিলেন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ (রক্তস্রাব বন্ধ না হওয়ার) যে রোগে সে আক্রান্ত হইয়াছে, সেই রোগ হওয়ার পূর্বে তাহার কত দিন কত রাত্র প্রতি মাসে হায়েয আসিত সে উহার প্রতি লক্ষ রাখিবে। মাসের সেই কয়দিন ও রাত্রিতে সে নামায পড়িবে না। অতঃপর সেই কয়দিন অতিবাহিত হইলে সে গোসল করিবে, তারপর লজ্জাস্থান কাপড় দিয়া বাধিয়া লইবে, তারপর নামায পড়িবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 136,
			"arabicnumber": 136,
			"text": "রেওয়ায়ত ১০৬. যায়নাব বিন্তি আবি সালমা (রাঃ) হইতে বর্ণিত, তিনি আবদুর রহমান ইবন আওফের স্ত্রী (উম্মু হাবিবা) যায়নাব বিন্ত জাহশকে দেখিয়াছেন, তাহার রক্তস্রাব বন্ধ হইত না, তিনি গোসল করিয়া নামায পড়িতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 137,
			"arabicnumber": 137,
			"text": "রেওয়ায়ত ১০৭. কাকা' (قَعْقَاع) ইবন হাকিম (রহঃ) এবং যায়দ ইবনে আসলাম (রহঃ) তাহারা উভয়ে সুমাইকে সাঈদ ইবন মুসায়্যাব (রহঃ)-এর নিকট পাঠাইলেন মুস্তাহাযা (স্ত্রীলোক) গোসল কিরূপে করিবে এই বিষয়ে তাহাকে প্রশ্ন করিতে। তিনি বলিলেনঃ এক যোহর হইতে অপর যোহর পর্যন্ত গোসল করিবে এবং প্রত্যেক নামাযের জন্য ওযু করবে। আর যদি রক্ত তাহার উপর প্রাধান্য লাভ করে (অর্থাৎ অধিক হয়) তবে (রক্ত প্রবাহের স্থানে) কাপড় বাধিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 138,
			"arabicnumber": 138,
			"text": "রেওয়ায়ত ১০৮. হিশাম ইবনে উরওয়াহ (রহঃ) হইতে বর্ণিত, তাহার পিতা বলিয়াছেন, মুস্তাহাযার জন্য একবার গোসল করা ব্যতীত অন্য কিছু ওয়াজিব নহে, অতঃপর প্রত্যেক (ফরয) নামাযের জন্য সে ওযু করিবে। মালিক (রহঃ) বলেনঃ আমাদের সিদ্ধাত্ত হইল- মুস্তাহাযা নামায পড়ার পর তাহার স্বামীর জন্য তাহার সঙ্গে সহবাস করা বৈধ, অনুরূপই নিফাসওয়ালীর (সন্তান প্রসবের পর যে রক্তস্রাব হয় উহাকে নিফাস বলা হয়) হুকুম। রক্ত স্ত্রীলোকদিগকে (নামায, রোযা ও স্বামীর মিলন হইতে) যতদিন বাধা দিয়া রাখে উহার শেষ সীমায় উপনীত হওয়ার পরও যদি সে রক্ত দেখিতে পায় তবে তখন তাহার স্বামী তাহার সহিত মিলিত হইতে পরিবে, কারণ সে স্ত্রীলোক মুস্তাহাযা স্ত্রীলোকের মত। মালিক (রহঃ) বলেনঃ হিশাম ইবন উরওয়াহ (রহঃ) তাহার পিতা হইতে মুস্তাহাযা সম্পর্কে যে হাদীসটি বর্ণনা করিয়াছেন, তদনুযায়ী এই বিষয়ে আমরা সিদ্ধান্ত করিয়াছি। এই বিষয়ে আমি যাহা শুনিয়াছি তন্মধ্যে ইহাই আমার মনঃপূত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 139,
			"arabicnumber": 139,
			"text": "রেওয়ায়ত ১০৯. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) হইতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে একটি শিশুকে আনা হইল। সে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাপড়ের উপর প্রস্রাব করিয়া দিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পানি তলব করিলেন এবং প্রস্রাব লাগা কাপড়ের উপর পানি ঢালিয়া দিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 140,
			"arabicnumber": 140,
			"text": "রেওয়ায়ত ১১০. উম্মু-কায়স বিনত মিহসান (রাঃ) হইতে বর্ণিত, দুগ্ধ ছাড়া অন্য খাদ্য এখনও গ্রহণ করে নাই তাহার এমন এক ছোট শিশুকে সঙ্গে লইয়া তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপস্থিত হইলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেই শিশুকে আপন কোলে বসাইলেন। সে তাহার কাপড়ের উপর প্রস্রাব করিয়া দিল। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পানি তলব করিলেন এবং কাপড়ে পানি ছিটাইলেন, উহাকে ধুইলেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 141,
			"arabicnumber": 141,
			"text": "রেওয়ায়ত ১১১. ইয়াহইয়া ইবন সাঈদ (রহঃ) বলেন, জনৈক বেদুইন মসজিদে প্রবেশ করিল, সে প্রস্রাব করার উদ্দেশ্যে লজ্জাস্থান হইতে (কাপড়) খুলিল। লোকজন তাহাকে ধমকাইতে লাগিলেন, ইহাতে লোকের স্বর উচ্চ হইল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ তাহাকে ছাড়িয়া দাও। তাহারা সেই লোকটিকে ছাড়িয়া দিলেন। সে প্রস্রাব করিল। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কয়েক ডোল পানি আনার নির্দেশ দিলেন। তারপর উক্ত স্থানে পানি ঢালা হইল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 142,
			"arabicnumber": 142,
			"text": "রেওয়ায়ত ১১২. আবদুল্লাহ ইবন দীনার (রহঃ) বলেন, আমি আবদুল্লাহ ইবন উমর (রাঃ)-কে দাঁড়াইয়া প্রস্রাব করিতে দেখিয়াছি। মালিক (রহঃ)-কে প্রশ্ন করা হইল প্রস্ৰাব-পায়খানা হইতে লজ্জাস্থান ধৌত করা সম্পর্কে কোন বর্ণনা (اثر) আসিয়াছে কি? তিনি বলিলেন, আমি জ্ঞাত হইয়াছি, পূর্বের লোকদের (আনসারদের) মধ্য হইতে কিছুসংখ্যক লোক মলত্যাগের পর মলদ্বার ধৌত করিতেন, আর আমি প্রস্রাব করার পর লজ্জাস্থান ধৌত করা পছন্দ করি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 143,
			"arabicnumber": 143,
			"text": "রেওয়ায়ত ১১৩. ইবন সব্বাক (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুম'আসমূহের কোন এক জুম'আয় ইরশাদ করিয়াছেনঃ (يَا مَعْشَرَ الْمُسْلِمِينَ) - হে মুসলিম সম্প্রদায় ইহা একটি দিবস, যাহাকে আল্লাহ্ ঈদস্বরূপ নির্দিষ্ট করিয়াছেন। তাই তোমরা গোসল কর, আর যাহার নিকট সুগন্ধ দ্রব্য থাকে, সে উহা হইতে স্পর্শ করিলে ক্ষতি নাই। মিসওয়াক ব্যবহার করা তোমাদের কর্তব্য।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 144,
			"arabicnumber": 144,
			"text": "রেওয়ায়ত ১১৪. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ যদি আমার উম্মতের উপর কঠিন হওয়ার আশংকা না করিতাম, তবে তাহাদিগকে বাধ্যতামূলকভাবে মিসওয়াক করার নির্দেশ দিতাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 145,
			"arabicnumber": 145,
			"text": "রেওয়ায়ত ১১৫. আবূ হুরায়রা (রাঃ) হইতে বর্ণিত, তিনি বলিয়াছেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যদি উম্মতের উপর কঠিন হওয়ার আশংকা না করিতেন, তবে তাহাদিগকে বাধ্যতামূলকভাবে মিসওয়াক করার নির্দেশ দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 145
			}
		}
	]
}