{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"20": "Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 705,
			"arabicnumber": 705,
			"text": "রেওয়ায়ত ১. আসমা বিনত উমাইস (রাঃ) বলেন, বায়দা নামক স্থানে মুহাম্মদ ইবন আবূ বকর (রাঃ)-এর জন্ম হয়। আবূ বকর সিদ্দীক (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামকে এই সম্পর্কে জিজ্ঞাসা করিলে তিনি বলিলেনঃ আসমাকে বলিয়া দিন সে যেন গোসল করিয়া ইহরাম বাধিয়া নেয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 705
			}
		},
		{
			"hadithnumber": 706,
			"arabicnumber": 706,
			"text": "রেওয়ায়ত ২. সাঈদ ইবন মুসায়্যাব (রহঃ) বর্ণনা করেন- জুল-হুলায়ফা নামক স্থানে আসমা বিনত উমাইসের গর্ভে আবূ বকর (রাঃ)-এর পুত্র মুহাম্মদের জন্ম হয়। আবু বকর (রাঃ) তখন আসমাকে গোসল করিয়া ইহরাম বাধিয়া নিতে নির্দেশ দেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 706
			}
		},
		{
			"hadithnumber": 707,
			"arabicnumber": 707,
			"text": "রেওয়ায়ত ৩. নাফি' (রহঃ) বর্ণনা করেন- আবদুল্লাহ ইবন উমর (রাঃ) ইহরাম বাঁধার উদ্দেশ্যে গোসল করিতেন। মক্কায় প্রবেশের পূর্বে এবং যিলহজ্জ মাসের নবম তারিখে আরাফাতে অবস্থানের জন্যও তিনি গোসল করতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 707
			}
		},
		{
			"hadithnumber": 708,
			"arabicnumber": 708,
			"text": "রেওয়ায়ত ৪. ইবরাহীম ইবন আবদুল্লাহ ইবন হুনায়ন (রহঃ) তাহার পিতা হইতে বর্ণনা করেন- আব্বাস (রাঃ) এবং মিসওয়ার ইবন মাখরামার মধ্যে আবওয়া’ নামক স্থানে বিতর্ক হয়। ইবন আব্বাস (রাঃ)-এর অভিমত ছিল মুহরিম অর্থাৎ ইহরামরত ব্যক্তি মাথা ধুইতে পারে আর মিসওয়ারের অভিমত ছিল যে, মুহরিম মাথা ধুইতে পারে না। আবদুল্লাহ ইবন হুনায়ন বলেনঃ শেষে আবদুল্লাহ ইবন আব্বাস (রাঃ) আমাকে এই বিষয়ের মীমাংসার জন্য আবু আইয়ুব আনসারী (রাঃ)-এর নিকট প্রেরণ করেন। তখন তিনি একটি কুয়ার ধারে পর্দা টাঙ্গাইয়া গোসল করিতেছিলেন। আমি পর্দার বাহির হইতে তাহাকে সালাম করিলাম। তিনি বলিলেনঃ কে? আমি বলিলামঃ আবদুল্লাহ ইবন হুনায়ন। আমাকে আবদুল্লাহ্ ইবন আব্বাস (রাঃ) পাঠাইয়াছেন, ইহরাম অবস্থায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম কিরূপে মাথা ধুইতেন তাহা জানিবার জন্য। আবু আইয়ূব (রাঃ) মাথায় হাত রাখিয়া মাথার কাপড় সরাইয়া দিলেন, আমি তাহার মাথাটি তখন স্পষ্ট দেখিতে পাইতেছিলাম। যে ব্যক্তি তাঁহার গায়ে পানি ঢালিতেছিল তাহাকে বলিলেনঃ পানি ঢাল। ঐ ব্যক্তি তাহার মাথায় পানি ঢালিতে লাগিল আর তিনি তাহার দুই হাত মাথার সামনে এবং পিছনে মর্দন করিয়া বলিলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামকে এইরূপ করিতে দেখিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 708
			}
		},
		{
			"hadithnumber": 709,
			"arabicnumber": 709,
			"text": "রেওয়ায়ত ৫. আতা ইবন আবি রাবাহ (রহঃ) বর্ণনা করেন- উমর ইবন খাত্তাব (রাঃ) গোসল করিতেছিলেন এবং ইয়ালা ইবন মুনইয়া (রহঃ) পানি ঢালিয়া দিতেছিলেন। উমর (রাঃ) ইয়ালাকে বলিলেনঃ আমার মাথায় পানি ঢালিয়া দাও। তখন তিনি বলিলেনঃ আপনি কি আমার দ্বারা এই কাজ করাইতে চান? (অর্থাৎ পানি মাথায় ঢালা সম্পর্কে ইয়ালার ভিন্নমত ছিল।) যদি হুকুম করেন তবে পানি ঢালিতে পারি। উমর ইবন খাত্তাব (রাঃ) বলিলেনঃ পানি ঢাল, কারণ পানি চুলের রুক্ষতাই বাড়াইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 709
			}
		},
		{
			"hadithnumber": 710,
			"arabicnumber": 710,
			"text": "রেওয়ায়ত ৬. নাফি' (রহঃ) বর্ণনা করেন- আবদুল্লাহ ইবন উমর (রাঃ) যখন মক্কার নিকটবর্তী হইতেন তখন দুই গিরিপথের মধ্যবর্তী যি-তুওয়া নামক স্থানে রাত্রিযাপন করিতেন। পরে ফজরেই নামাযের পর উপরের গিরিপথ বাহিয়া মক্কায় প্রবেশ করিতেন। আর হজ্জ বা উমরার উদ্দেশ্যে আসিলে যি-তুওয়ায় গোসল না করিয়া সেখানে প্রবেশ করিতেন না। সঙ্গীগণকে মক্কা প্রবেশের পূর্বে গোসল করিতে তিনি নির্দেশ দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 710
			}
		},
		{
			"hadithnumber": 711,
			"arabicnumber": 711,
			"text": "রেওয়ায়ত ৭. নাফি' (রহঃ) বর্ণনা করেন, আবদুল্লাহ ইবন উমর (রাঃ) ইহরামের অবস্থায় মাথা ধুইতেন না। তবে স্বপ্নদোষ হইলে বাধ্যতামূলক ধুইতে হইত। মালিক (রহঃ) বলেন, বিজ্ঞ আলিমদের নিকট শুনিয়াছি যে, জমরা-এ-আকাবার রমি করার পর মাথা কামাইবার পূর্বেই সাবান ইত্যাদি দ্বারা মাথা ধৌত করা যায়। কেননা জমরা-এ-আকাবায় প্রস্তর নিক্ষেপের পর উকুন মারা, মাথা কামানো, ময়লা বিদূরিত করা, কাপড় পরা ইত্যাদি কাজ মুহরিমের জন্য হালাল হইয়া যায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 711
			}
		},
		{
			"hadithnumber": 712,
			"arabicnumber": 712,
			"text": "রেওয়ায়ত ৮. আবদুল্লাহ্ ইবন উমর (রাঃ) বর্ণনা করেন, এক ব্যক্তি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম-এর নিকট জিজ্ঞাসা করিল, ইহরাম অবস্থায় মুহরিম ব্যক্তি কি ধরনের কাপড় পরিধান করিতে পারে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম উত্তরে বলিলেনঃ কোর্তা পরিবে না, পাগড়ি বাধিবে না, টুপি, পাজামা এবং মোজা পরিবে না। তবে কাহারও চপ্পল না থাকিলে সে মোজা পরিতে পারে বটে কিন্তু উহা এমনভাবে কাটিয়া পরিবে যাহাতে পায়ের টাখনা বাহির হইয়া থাকে। জাফরান বা ওয়ারস (এক প্রকার সুগন্ধযুক্ত রঙিন ঘাস) রঞ্জিত কাপড়ও পরিতে পারিবে না। ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-এর নিকট একবার জিজ্ঞাসা করা হইল, একটি হাদীস হইতে জানা যায় যে, লুঙ্গি না পাইলে সে পায়জামা পরিতে পরিবে। মুহরিমের জন্য পায়জামা পরা কি জায়েয হইবে? মালিক (রহঃ) উত্তরে বললেনঃ এই ধরনের কোন হাদীস আমি শুনি নাই। আমার মতে মুহরিমের জন্য পায়জামা পরিধান করা উচিত হইবে না। কারণ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুহরিমকে পায়জামা পরিতে নিষেধ করিয়াছেন এবং মোজার ব্যাপারে যেমন অনুমতি প্রদান করা হইয়াছে পায়জামার ব্যাপারে তদ্রুপ অনুমতি প্রদান করা হয় নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 712
			}
		},
		{
			"hadithnumber": 713,
			"arabicnumber": 713,
			"text": "রেওয়ায়ত ৯. আবদুল্লাহ ইবন দীনার (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহরাম অবস্থায় জাফরান এবং ওয়ার্স রঞ্জিত কাপড় পরিধান করিতে নিষেধ করিয়াছেন। তিনি বলিয়াছেন, যাহার জুতা নাই সে মোজা (চামড়ার) পরিতে পারবে, কিন্তু টাখনার[1] নিচ পর্যন্ত উহা কাটিয়া নিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 713
			}
		},
		{
			"hadithnumber": 714,
			"arabicnumber": 714,
			"text": "রেওয়ায়ত ১০. আবদুল্লাহ ইবন উমর (রাঃ) বর্ণনা করেন, উমর ইবন খাত্তাব (রাঃ) তালহা ইবন উবায়দুল্লাহ্ (রাঃ)-কে ইহরাম অবস্থায় রঙিন কাপড় পরিতে দেখিয়া তাহাকে বলিলেনঃ তালহা, এ রঙিন কাপড় কেন? তিনি বলিলেনঃ আমীরুল মুমিনীন, ইহা তো মাটির রঙ। ইহাতে দোষ কি? উমর ইবন খাত্তাব (রাঃ) বললেন, দেখ, তোমরা হইলে নেতা। অন্যরা তোমাদের অনুসরণ করিয়া চলে। স্বল্প বুদ্ধির কেউ তোমাকে দেখিলে মনে করিবে, তাহা ইবন উবায়দুল্লাহও ইহরাম অবস্থায় রঙিন কাপড় পরেন। সুতরাং তোমাদের কোন প্রকারের রঙিন কাপড় পরা উচিত নহে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 714
			}
		},
		{
			"hadithnumber": 715,
			"arabicnumber": 715,
			"text": "রেওয়ায়ত ১১. আসমা বিনত আবু বকর (রাঃ) ইহরাম অবস্থায় গাঢ় কুসুম রঙের কাপড় পরিতেন। তবে ইহাতে জাফরান মিশ্রিত হইত না। ইয়াহইয়া (রহঃ) বলেনঃ সুগন্ধি বিদূরিত হইয়া গেলে ঐ ধরনের কাপড় ইহরাম অবস্থায় পরিধান করা জায়েয কিনা এই সম্পর্কে মালিক (রহঃ)-কে জিজ্ঞাসা করা হইলে তিনি বলিলেনঃ হ্যাঁ, পরিতে পারে। তবে শর্ত হইল জাফরান এবং ওয়ার্‌স-এর রঙ যেন উহাতে না থাকে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 715
			}
		},
		{
			"hadithnumber": 716,
			"arabicnumber": 716,
			"text": "রেওয়ায়ত ১২. নাফি' (রহঃ) বর্ণনা করেন- আবদুল্লাহ ইবন উমর (রাঃ) ইহরাম অবস্থায় কোমরবন্ধ বাধা মাকরুহ বলিয়া মনে করিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 716
			}
		},
		{
			"hadithnumber": 717,
			"arabicnumber": 717,
			"text": "রেওয়ায়ত ১৩. ইয়াহইয়া ইবন সাঈদ (রহঃ) বর্ণনা করেন- সাঈদ ইবনুল মুসায়্যাব (রহঃ) বলেনঃ উভয় পার্শ্বে ফিতাযুক্ত কোমরবন্ধ কাপড়ের নিচে ইহরাম অবস্থায় পরিলে কোন অসুবিধা নাই। মালিক (রহঃ) বলেনঃ এই বিষয়ে উল্লিখিত বর্ণনাটি সর্বোত্তম, যাহা আমি শুনিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 717
			}
		},
		{
			"hadithnumber": 718,
			"arabicnumber": 718,
			"text": "রেওয়ায়ত ১৪. ফারাফিসা ইবন উমায়র আল-হানাকী (রহঃ) আরজ নামক স্থানে উসমান ইবন আফফান (রাঃ)-কে ইহরাম অবস্থায় মুখমণ্ডল আচ্ছাদিত করিতে দেখিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 718
			}
		},
		{
			"hadithnumber": 719,
			"arabicnumber": 719,
			"text": "রেওয়ায়ত ১৫. নাফি' (রহঃ) হইতে বর্ণিত- আবদুল্লাহ্ ইবন উমর (রাঃ) বলেনঃ চিবুকের উপরিভাগ মাথার হুকুমের শামিল। ইহরাম অবস্থায় উহা ঢাকা দুরন্ত নহে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 719
			}
		},
		{
			"hadithnumber": 720,
			"arabicnumber": 720,
			"text": "রেওয়ায়ত ১৬. নাফি’ (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ)-এর পুত্র ওয়াকিদ ইবন আবদুল্লাহ্ (রহঃ) জুহফা নামক স্থানে ইহরাম অবস্থায় ইন্তিকাল করেন। উমর ইবন খাত্তাব (রাঃ) নিজে তাহাকে কাফন পরান। তিনি তখন বলিয়াছিলেনঃ আমরা ইহরাম অবস্থায় না হইলে তাহাকে সুগন্ধি লাগাইতাম। তিনি তাহার মাথা এবং মুখমণ্ডল ঢাকিয়া দিয়াছিলেন। মালিক (রহঃ) বলেনঃ জীবিত থাকাকালীন মানুষ শরীয়তের উপর আমল করিতে পারে। মৃত্যুর পরে মানুষের আমল বন্ধ হইয়া যায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 720
			}
		},
		{
			"hadithnumber": 721,
			"arabicnumber": 721,
			"text": "রেওয়ায়ত ১৭. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) বলিতেনঃ ইহরাম অবস্থায় মহিলাগণ চেহারায় নেকাব ফেলিবে না বা হাতে দস্তানা পরিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 721
			}
		},
		{
			"hadithnumber": 722,
			"arabicnumber": 722,
			"text": "রেওয়ায়ত ১৮. ফাতিমা বিনতে মুনযির (রহঃ) বলেনঃ আমরা আসমা বিনতে আবু বকর (রাঃ)-এর সঙ্গী ছিলাম। আমরা ইহরাম অবস্থায় মুখ ঢাকিয়া ফেলিতাম, কিন্তু তিনি আমাদের কিছুই বলিতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 722
			}
		},
		{
			"hadithnumber": 723,
			"arabicnumber": 723,
			"text": "রেওয়ায়ত ১৯. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলেনঃ ইহরাম বাধার পূর্বে এবং ইহরাম খোলার সময় তাওয়াফে যিয়ারতের পূর্বে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সুগন্ধি লাগাইয়া দিতাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 723
			}
		},
		{
			"hadithnumber": 724,
			"arabicnumber": 724,
			"text": "রেওয়ায়ত ২০. আতা ইবন আবি রাবাহ (রহঃ) বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন হুনাইনে অবস্থান করিতেছিলেন তখন হলুদ রঙের চিহ্ন আছে এমন জামা পরিহিত এক বেদুঈন ব্যক্তি তাহার কাছে আসিয়া বলিলঃ ইয়া রাসূলাল্লাহ্! আমি উমরার নিয়ত করিয়াছি। এখন আপনি আমাকে কি করিতে নির্দেশ করেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ জামাটি খুলিয়া হলুদ দাগগুলি ধুইয়া ফেল এবং হজ্জের বেলায় যাহা করিতে এখন তাহাই কর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 724
			}
		},
		{
			"hadithnumber": 725,
			"arabicnumber": 725,
			"text": "রেওয়ায়ত ২১. আসলাম (রহঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) শাজারায় (মদীনা হইতে ছয় মাইল দূরবর্তী একটি স্থান) ছিলেন। তখন তাহার নাকে সুগন্ধি অনুভূত হইল। তিনি জিজ্ঞাসা করিলেনঃ এই সুগন্ধি কোথা হইতে আসিতেছে? মু'আবিয়া ইবন আবু সুফইয়ান (রাঃ) বলিলেনঃ আমার নিকট হইতে হে আমীরুল মুমিনীন! উমর (রাঃ) বলিলেনঃ আল্লাহর কসম, এই সুগন্ধি তোমা হইতে! অতঃপর মু'আবিয়া বলিলেনঃ উম্মে হাবীব (রাঃ) আমাকে এই সুগন্ধি লাগাইয়া দিয়াছিলেন। উমর (রাঃ) বলিলেনঃ তোমাকে বলিতেছি, তুমি ফিরিয়া যাও (উম্মে হাবীবার নিকট), তিনি নিশ্চয় ইহা ধুইয়া দিবেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 725
			}
		},
		{
			"hadithnumber": 726,
			"arabicnumber": 726,
			"text": "রেওয়ায়ত ২২. সালত ইবন যুয়াইদ (রহঃ) তাহার পরিবারের একাধিক ব্যক্তি হইতে বর্ণনা করেন যে, উমর ইবন খাত্তাব (রাঃ) শাজারায় সুগন্ধ দ্রব্যের ঘ্রাণ পাইলেন, তাহার পার্শ্বে ছিলেন কসীর ইবন সালত। উমর (রাঃ) বলিলেন, এই সুগন্ধ কাহার নিকট হইতে? কসীর বলিলেনঃ আমার নিকট হইতে। আমার মাথায় তলবীদ করিয়াছি এবং আমি মাথার চুল মুণ্ডাইবার ইরাদা করিয়াছি। উমর (রাঃ) বললেন, তুমি শরাবাতের দিকে গমন কর এবং তোমার মাথা মালিশ কর উহাকে পরিষ্কার করা পর্যন্ত। কসীর ইবন সালত (রহঃ) উহা করিলেন। মালিক (রহঃ) বলেন, শারাবাত (شربة) গাছের গোড়ার গর্ত যাহাতে পানি জমিয়া থাকে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 726
			}
		},
		{
			"hadithnumber": 727,
			"arabicnumber": 727,
			"text": "রেওয়ায়ত ২৩. ইয়াহইয়া ইবন সাঈদ (রহঃ), আবদুল্লাহ্ ইবন আবু বকর (রহঃ) এবং রবীআ ইবন আবু আবদুর রহমান (রহঃ) হইতে বর্ণিত, অলিদ ইবন আবদুল মালিক সালিম ইবন আবদুল্লাহ ও খারিজা ইবন যায়দ (রহঃ)-কে জিজ্ঞাসা করিলেনঃ রমীয়ে জামরা (প্রস্তর নিক্ষেপ) এবং মাথা কামাইবার পর তওয়াফে যিয়ারতের পূর্বে সুগন্ধি ব্যবহার করা কেমন? সালিম (রহঃ) ইহাকে নিষিদ্ধ বলিয়া মত দিলেন, আর খারিজা ইবন যায়দ ইবন সাবিত (রহঃ) বলিলেনঃ ইহা জায়েয। মালিক (রহঃ) বলেনঃ ইহরামের পূর্বে বা তাওয়াফে যিয়ারতের পূর্বে রমীয়ে জামরার পর মিনা হইতে প্রত্যাবর্তনকালে গন্ধবিহীন সাধারণ তৈল ব্যবহার করায় কোন অসুবিধা নাই। ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-কে জিজ্ঞাসা করা হইল, জাফরান মিশ্রিত খাদ্য মুহরিম ব্যক্তি খাইতে পারবে কি? তখন তিনি বলিলেনঃ আগুনে পরিপাক করা হইয়া থাকিলে খাইতে পারিবে। আর তাহা না হইলে খাইতে পারিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 727
			}
		},
		{
			"hadithnumber": 728,
			"arabicnumber": 728,
			"text": "রেওয়ায়ত ২৪. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলিয়াছেনঃ মদীনাবাসিগণ যুল-হুলায়ফা হইতে, সিরিয়াবাসিগণ জুহফা আর নজদবাসিগণ করুন হইতে ইহরাম বাঁধিবে। আবদুল্লাহ ইবন উমর বলেন, আমার নিকট আরও রেওয়ায়ত পৌছিয়াছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ ইয়ামানবাসিগণ ইয়ালাম্‌লাম হইতে ইহরাম বাধিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 728
			}
		},
		{
			"hadithnumber": 729,
			"arabicnumber": 729,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 729
			}
		},
		{
			"hadithnumber": 730,
			"arabicnumber": 730,
			"text": "রেওয়ায়ত ২৭. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ) ফুরু' নামক স্থান হইতে ইহরাম বাঁধিয়াছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 730
			}
		},
		{
			"hadithnumber": 731,
			"arabicnumber": 731,
			"text": "রেওয়ায়ত ২৮. মালিক (রহঃ) জনৈক নির্ভরযোগ্য ব্যক্তির নিকট শুনিয়াছেন যে, আবদুল্লাহ ইবন উমর (রাঃ) এলিয়া (বায়তুল মুকাদ্দাস) হইতে ইহরাম বাঁধিয়াছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 731
			}
		},
		{
			"hadithnumber": 732,
			"arabicnumber": 732,
			"text": "রেওয়ায়ত ২৯. মালিক (রহঃ) বলেন, তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম জিইরানা নামক স্থান হইতে ওমরার ইহরাম বাঁধিয়াছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 732
			}
		},
		{
			"hadithnumber": 733,
			"arabicnumber": 733,
			"text": "রেওয়ায়ত ৩০. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর তালবিয়া এইরূপঃ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيكَ لَكَ অর্থাৎ, বারবার হাযির হই হে পরওয়ারদিগার! বারবার আমি তোমার স্বারে হাযির হই, বারবার তোমার দরবারে হাযির হই, কোন শরীক নাই তোমার, বারবার আমি তোমার দ্বারে হাযির হই, নিঃসন্দেহে সকল প্রশংসা ও নিয়ামত এবং রাজত্ব তোমারই। কোন শরীক নাই তোমার। নাফি (রহঃ) বলেনঃ আবদুল্লাহ ইবন উমর (রাঃ) তৎসঙ্গে ইহাও বৃদ্ধি করিতেনঃ (لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ بِيَدَيْكَ لَبَّيْكَ وَالرَّغْبَاءُ إِلَيْكَ وَالْعَمَلُ) অর্থাৎ আমি তোমার দরবারে হাযির, আমি হাযির আমি হাযির, সৌভাগ্য তোমার নিকট হইতে, মঙ্গল তোমার হাতেই, আমি তোমার দরবারে হাযির, আমার সকল প্রেরণা তুমিই আর আমার সকল কর্মে একমাত্র উদ্দেশ্য তুমিই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 733
			}
		},
		{
			"hadithnumber": 734,
			"arabicnumber": 734,
			"text": "রেওয়ায়ত ৩১. হিশাম ইবন উরওয়াহ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুল-হুলায়ফা নামক স্থানে অবস্থিত মসজিদে দুই রাকাআত নামায পড়িতেন। অতঃপর যখন উষ্ট্রে আরোহণ করিতেন তখন উচ্চস্বরে তালবিয়া বা লাব্বায়কা পাঠ করিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 734
			}
		},
		{
			"hadithnumber": 735,
			"arabicnumber": 735,
			"text": "রেওয়ায়ত ৩২. সালিম ইবন আবদুল্লাহ (রহঃ) তাহার পিতা আবদুল্লাহ ইবন উমর (রাঃ)-এর নিকট শুনিয়াছেন, তিনি বলেনঃ এই স্থানটিতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহিওয়া সাল্লাম ইহরাম বাধিয়াছিলেন বলিয়া তোমরা ভুল ধারণা করিয়া থাক। অথচ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুল-হুলাইফাস্থ মসজিদের নিকট হইতে লাব্বায়কা বলিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 735
			}
		},
		{
			"hadithnumber": 736,
			"arabicnumber": 736,
			"text": "রেওয়ায়ত ৩৩. উবায়দ ইবন জুরায়জ (রহঃ) আবদুল্লাহ ইবন উমর (রাঃ)-কে বলিলেনঃ হে আবু আবদুর রহমান! এমন চারটি বিষয় আপনার মধ্যে দেখিতে পাই যাহা আপনার অন্যান্য সাথীর মধ্যে দেখিতে পাওয়া যায় না। আবদুল্লাহ ইবন উমর (রাঃ) বলিলেনঃ সেইগুলি কি? বলত শুনি। ইবন জুরায়জ বলিলেনঃ তাওয়াফের সময় আপনাকে রুকনে য়্যামানী এবং হাজরে আসওয়াদই কেবল ছুঁইতে দেখা যায়, লোমশূন্য চামড়ার জুতা আপনি পরিধান করিয়া থাকেন, আপনি হলুদ রঙের খেজাব ব্যবহার করেন, মক্কায় অবস্থান করিলে আপনি যিলহজ্জ মাসের আট তারিখে ইহরাম বাঁধিয়া থাকেন অথচ অন্যরা চাঁদ দেখামাত্র ইহরাম বাধিয়া নেন। আবদুল্লাহ ইবন উমর (রাঃ) জবাবে বলিলেনঃ রুকনে য়্যামানী ও হাজরে আসওয়াদ ব্যতীত অন্য কোন রুকন স্পর্শ করিতে আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে দেখি নাই। লোমশূন্য জুতা পরিতেও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখিয়াছি এবং সেই জুতা পরিধান করা অবস্থায় তিনি ওযুও করিতেন। তাই উহা পরিতে আমার ভাল লাগে। হলুদ রঙের খেজাবও রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে ব্যবহার করিতে দেখিয়াছি তাই আমার তাহা ভাল লাগে। আর ইহরাম সম্বন্ধে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে দেখিয়াছি যতক্ষণ তাহাকে লইয়া যাত্রার জন্য উট না দাঁড়াইত ততক্ষণ তিনি তালবিয়া পড়িতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 736
			}
		},
		{
			"hadithnumber": 737,
			"arabicnumber": 737,
			"text": "রেওয়ায়ত ৩৪. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) যুল-হুলায়ফাস্থ মসজিদে নামায পড়িয়া বাহির হইতেন, পরে উটে আরোহণ করিয়া ইহরাম বাঁধিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 737
			}
		},
		{
			"hadithnumber": 738,
			"arabicnumber": 738,
			"text": "রেওয়ায়ত ৩৫. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, আবদুল মালিক ইবন মারওয়ান[1] (রহঃ) যুল-হুলায়ফার মসজিদ হইতে উট যখন সোজা হইয়া দাঁড়াইত তখন তালবিয়া পড়িয়াছিলেন। আবান ইবন উসমান (রহঃ) তাহাকে তদ্রুপ করিতে বলিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 738
			}
		},
		{
			"hadithnumber": 739,
			"arabicnumber": 739,
			"text": "রেওয়ায়ত ৩৬. খাল্লাদ ইবন সায়িব আনসারী (রহঃ) তাহার পিতা হইতে বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ জিবরীল (আঃ) আসিয়া আমাকে নির্দেশ দিয়া গেলেন আমার সঙ্গীদের যেন উচ্চস্বরে ‘লাব্বায়কা’ বলার নির্দেশ দেই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 739
			}
		},
		{
			"hadithnumber": 740,
			"arabicnumber": 740,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 740
			}
		},
		{
			"hadithnumber": 741,
			"arabicnumber": 741,
			"text": "রেওয়ায়ত ৩৯. উম্মুল মুমিনীন আয়েশা (রাঃ) বর্ণনা করেন- রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হজ্জে ইফরাদ আদায় করিয়াছিলেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 741
			}
		},
		{
			"hadithnumber": 742,
			"arabicnumber": 742,
			"text": "রেওয়ায়ত ৪০. উরওয়াহ ইবন যুবায়র উম্মুল মু'মিনীন আয়েশা (রাঃ) হইতে বর্ণনা করেন- নিশ্চয়ই রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হজ্জে-ইফরাদ আদায় করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 742
			}
		},
		{
			"hadithnumber": 743,
			"arabicnumber": 743,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 743
			}
		},
		{
			"hadithnumber": 744,
			"arabicnumber": 744,
			"text": "রেওয়ায়ত ৪৩. সুলায়মান ইবন ইয়াসার (রহঃ) হইতে বর্ণিত, বিদায় হজ্জের সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হজ্জের উদ্দেশ্যে যখন রওয়ানা হন তখন সাহাবীদের মধ্যে কেহ কেহ কেবল হজ্জের, আর কেহ কেহ হজ্জ ও উমরা উভয়ের, আর কেহ কেহ কেবল উমরার ইহরাম বাঁধিয়াছিলেন। যাহারা হজ্জ ও উমরা উভয়ের বা কেবল হজ্জের নিয়ত করিয়াছিলেন, তাহারা ইহরাম খোলেন নাই, আর যাহারা উমরার ইহরাম বাধিয়াছিলেন তাহারা উমরা আদায় করিয়া ইহরাম খুলিয়া ফেলিয়াছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 744
			}
		},
		{
			"hadithnumber": 745,
			"arabicnumber": 745,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 745
			}
		},
		{
			"hadithnumber": 746,
			"arabicnumber": 746,
			"text": "রেওয়ায়ত ৪৬. জাফর ইবন মুহাম্মদ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন- আলী ইবন আবি তালিব (রাঃ) হজ্জের সময় উচ্চস্বরে লাব্বায়কা বলিতে থাকিতেন। তবে আরাফাতের দিন সূর্য যখন হেলিয়া পড়িত তখন লাব্বায়কা বলা মওকুফ করিয়া দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 746
			}
		},
		{
			"hadithnumber": 747,
			"arabicnumber": 747,
			"text": "রেওয়ায়ত ৪৭. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পত্নী আয়েশা (রাঃ) যখন আরাফাতের দিকে যাত্রা করিতেন, তখন লাব্বায়কা বলা বন্ধ করিয়া দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 747
			}
		},
		{
			"hadithnumber": 748,
			"arabicnumber": 748,
			"text": "রেওয়ায়ত ৪৮. নাফি' (রহঃ) হইতে বর্ণিত- আবদুল্লাহ ইবন উমর (রাঃ) হারম শরীফে তাওয়াফ ও সায়ী করিয়া ‘লাব্বায়কা’ মওকুফ করিয়া দিতেন। পরে আবার লাব্বায়কা বলা শুরু করতেন এবং মিনা হইতে সকালে আরাফাত যাত্রার সময় পর্যন্ত উহা পাঠ করিতেন। আরাফাতে যাত্রার সময় তিনি তাহা পুনরায় বন্ধ করিতেন। উমরার বেলায় হারম শরীফে প্রবেশ করিয়াই ‘লাব্বায়কা’ বলা বন্ধ করিয়া দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 748
			}
		},
		{
			"hadithnumber": 749,
			"arabicnumber": 749,
			"text": "রেওয়ায়ত ৪৯. ইবন শিহাব (রহঃ) বলেনঃ তাওয়াফ করার সময় আবদুল্লাহ্ ইবন উমর (রাঃ) ‘লাব্বায়কা’ বলতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 749
			}
		},
		{
			"hadithnumber": 750,
			"arabicnumber": 750,
			"text": "রেওয়ায়ত ৫০. উম্মুল মুমিনীন আয়েশা (রাঃ) হইতে বর্ণিত- তিনি আরাফাত ময়দানে প্রথমে ‘নামিরা’ নামক স্থানে অবস্থান করিতেন, পরে আরাক’ নামক স্থানে অবস্থান করা শুরু করেন। আয়েশা (রাঃ) যতক্ষণ মনযিলে অবস্থান করিতেন ততক্ষণ তিনি ও তাহার সঙ্গীগণ ‘লাব্বায়কা’ পাঠ করিতে থাকিতেন। যখন আরাফাতের দিকে যাত্রার জন্য সওয়ার হইতেন তখন উহা বন্ধ করিয়া দিতেন। আয়েশা (রাঃ) প্রথমে হজ্জের পর যিলহজ্জ মাসেই মক্কা হইতে ইহরাম বাঁধিয়া উমরা করিতেন, পরে উহা ত্যাগ করিয়া মুহাররম মাসের চাঁদ দেখার পূর্বে জুহফা আসিয়া অবস্থান করিতেন এবং মুহাররম মাসের চাঁদ উঠিলে উমরার ইহরাম বাঁধিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 750
			}
		},
		{
			"hadithnumber": 751,
			"arabicnumber": 751,
			"text": "রেওয়ায়ত ৫১. ইয়াহইয়া ইবনে সাঈদ (রহঃ) হইতে বর্ণিত, উমর ইবনে আবদুল আযীয (রহঃ) যিলহজ্জ মাসের নবম তারিখ মিনা হইতে সকালে আরাফাত ময়দানের দিকে যাত্রা করার সময় ‘আল্লাহু আকবার’ বলার আওয়াজ শুনিতে পাইলেন। তখন তিনি কতিপয় সিপাহীকে এই কথা ঘোষণা করিতে নির্দেশ দিলেন যে, এখনই ‘লাব্বায়কা’ পাঠ করার সময়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 751
			}
		},
		{
			"hadithnumber": 752,
			"arabicnumber": 752,
			"text": "রেওয়ায়ত ৫২. আবদুর রহমান ইবন কাসিম (রহঃ) তাহার পিতা হইতে বর্ণনা করেন- উমর ইবন খাত্তাব (রাঃ) মক্কাবাসীদের উদ্দেশ্যে বলিয়াছিলেনঃ হে মক্কাবাসী! অন্যান্য মানুষ এই সময় উস্কখুস্ক চুল ও অপরিপাটি অবস্থায় এইখানে আগমন করে, আর তোমরা চুলে তেল মর্দন করিয়া পরিপাটি হইয়া থাক। যিলহজ্জের চাঁদ উঠিলে তোমরাও ইহরাম বাঁধিয়া নিও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 752
			}
		},
		{
			"hadithnumber": 753,
			"arabicnumber": 753,
			"text": "রেওয়ায়ত ৫৩. হিশাম ইবন উরওয়াহ্ (রহঃ) তাহার পিতা হইতে বর্ণনা করেনঃ আবদুল্লাহ ইবন যুবায়র (রাঃ) নয় বৎসর মক্কায় ছিলেন। যিলহজ্জ মাসের চাঁদ দেখা গেলেই তিনি ইহরাম বাঁধিয়া নিতেন। উরওয়াহও তদ্রুপ করিতেন। মালিক (রহঃ) বলেনঃ মক্কাবাসী এবং মক্কায় অবস্থানরত অন্যান্য স্থানের বাসিন্দাগণ হারম শরীফ হইতেই ইহরাম বাঁধিবে। মালিক (রহঃ) বলেনঃ মক্কা হইতে যাহারা ইহরাম বাঁধিবে তাহারা মিনা হইতে ঘুরিয়া না আসা পর্যন্ত তাওয়াফ ও সাফা-মারওয়ার সায়ী করিবে না। আবদুল্লাহ ইবন উমর (রাঃ)-ও তদ্রুপ করিয়াছিলেন। ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-কে জিজ্ঞাসা করা হইল- মদীনাবাসী এবং মক্কার বাহিরের কোন লোক যদি মক্কায় অবস্থান কালে মক্কা হইতে যিলহজ্জ মাসে ইহরাম বাঁধে তবে তাওয়াফে যিয়ারত সম্পর্কে কি করিবে? তিনি বলিলেনঃ তাওয়াফে ইফাযা বা তাওয়াফে যিয়ারত তখন করিবে না। নফল তাওয়াফ যত ইচ্ছা তত করিতে পারে। তবে প্রতি তাওয়াফের পর দুই রাকাআত নামায পড়িয়া নিবে। যে সকল সাহাবী মক্কা হইতে ইহরাম বাধিয়াছিলেন তাহারাও তদ্রুপ করিয়াছিলেন। তাহারা মিনা হইতে ফিরিয়া না আসা পর্যন্ত তাওয়াফ ও সায়ী করেন নাই। আবদুল্লাহ ইবন উমর (রাঃ)-ও তাহাই করিতেন। যিলহজ্জ মাসের চাঁদ দেখার পর তিনি মক্কা হইতে ইহরাম বাঁধিতেন এবং মিনা হইতে ঘুরিয়া না আসা পর্যন্ত তিনি তাওয়াফ ও সায়ী করিতেন না। মালিক (রহঃ)-কে মক্কারাসী কোন ব্যক্তি উমরার জন্য ইহরাম কোথা হইতে বাঁধিবে তাহা জিজ্ঞাসা করিলে তিনি বলেনঃ হারম শরীফ হইতে উমরার ইহরাম বাঁধা মক্কাবাসীদের জন্য জায়েয নহে। তাহার হারমের বাহির হইতে ইহরাম বাঁধিয়া আসিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 753
			}
		},
		{
			"hadithnumber": 754,
			"arabicnumber": 754,
			"text": "রেওয়ায়ত ৫৪. আমরা বিনত আবদুর রহমান (রহঃ) বর্ণনা করেন- যিয়াদ ইবন আবু সুফইয়ান নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ)-এর নিকট চিঠি লিখিলেন, আবদুল্লাহ্ ইবন আব্বাস (রাঃ) বলেন, যবেহ না হওয়া পর্যন্ত কুরবানীর উদ্দেশ্যে মক্কায় পশু প্রেরণকারীর উপর ইহরাম পালনরত ব্যক্তির মত সকল জিনিস হারাম হইয়া যায়। আমি আপনার নিকট পশু[1] প্রেরণ করিলাম। আশা করি, উক্ত পশুর সহিত প্রেরিত ব্যক্তির নিকট অথবা পত্ৰযোগে আমাকে উক্ত বিষয়টি সম্পর্কে আপনার ফতওয়া জানাইবেন। আমরা বলেন, আয়েশা (রাঃ) বলিলেনঃ ইবন আব্বাস (রাঃ) যাহা বলিয়াছেন তাহা ঠিক নহে। আমি নিজের হাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কর্তৃক প্রেরিত পশুর রশি পাকাইয়াছিলাম। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজে তাহা উহার গলায় পরাইয়া আমার পিতার সহিত উহা মক্কায় প্রেরণ করিয়াছিলেন। অথচ উক্ত পশুটি যবেহ হওয়া পর্যন্ত সময়ের মধ্যেও কোন হালাল জিনিস রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য হারাম হয় নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 754
			}
		},
		{
			"hadithnumber": 755,
			"arabicnumber": 755,
			"text": "রেওয়ায়ত ৫৫. ইয়াহইয়া ইবন সাঈদ (রহঃ) বলেনঃ আমরা বিনত আবদুর রহমান (রহঃ)-কে জিজ্ঞাসা করিলামঃ যদি কেউ মক্কায় হাদয়ী বা কুরবানীর উদ্দেশ্যে পশু প্রেরণ করে কিন্তু নিজে সঙ্গে না যায় তবে তাহার উপরও কি কোন বিষয় হারাম হইবে? তিনি বলিলেনঃ আমি আয়েশা (রাঃ)-এর নিকট শুনিয়াছি, তিনি বলিতেনঃ যে ব্যক্তি ইহরাম বাঁধিয়াছে এবং লাব্বায়কা পাঠ করিয়াছে কেবল তাহাকেই মুহরিম বলা যায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 755
			}
		},
		{
			"hadithnumber": 756,
			"arabicnumber": 756,
			"text": "রেওয়ায়ত ৫৬. রবী’আ ইবন আবদুল্লাহ ইবন হুদায়র (রহঃ) একবার ইরাকে এক ব্যক্তিকে সেলাইবিহীন কাপড় পরিহিত দেখিয়া জানিতে পারিলেন যে, এই ব্যক্তি কুরবানীর উদ্দেশ্যে মক্কায় প্রেরিত পশুর গলায় হাড় লটকাইয়া দিয়াছে। তাই সে সেলাইযুক্ত কাপড় খুলিয়া ফেলিয়াছে। রবী’আ বলেনঃ আবদুল্লাহ্ ইবন যুবায়র (রাঃ)-এর সহিত সাক্ষাৎ করিয়া এই ঘটনা তাঁহাকে জানাইলে তিনি বলিলেনঃ কাবার মালিকের কসম, উহা বিদআত (উহা ঠিক নহে)। ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-কে জিজ্ঞাসা করা হইল- এক ব্যক্তি নিজে কুরবানীর পশু লইয়া ঘর হইতে বাহির হইল, নিজে উহা ইশ’আর করিয়া যুল-হুলায়ফায় উহার গলায় হাড় (قلادة) লটকাইল; কিন্তু জুহফায় গিয়া সে ইহরাম বাঁধিল। ঐ ব্যক্তি সম্পর্কে আপনি কি বলেন? তিনি বলিলেনঃ তাহার জন্য ইহা ঠিক হয় নাই। নিজে ইহরাম বাধিয়া ইশ’আর ও তাকলীদ করা তাহার উচিত ছিল। যে ব্যক্তি পশুর সঙ্গে নিজে যাইতে না চায় বরং বাড়িতে থাকিতে চায়, সে ইহরাম না বাঁধিয়াই উহা পাঠাইয়া দিবে। মালিক (রহঃ)-কে জিজ্ঞাসা করা হইলঃ ইহরাম না বাধিয়া কেউ হাদয়ী বা মক্কায় প্রেরিতব্য কুরবানীর পশু লইয়া বাহির হইতে পারবে কি? তিনি বলিলেনঃ হ্যাঁ, ইহাতে দোষের কিছুই নাই। মালিক (রহঃ)-কে জিজ্ঞাসা করা হইল কুরবানীর পশুর গলায় কিলাদা বা হাড় পরাইয়া মক্কায় পঠাইয়া দিলে ঐ পশুর মালিক কি মুহরিম গণ্য হইবে- এই বিষয়ে আলিমগণের মতপার্থক্য রহিয়াছে। আপনার কি মত? তিনি বলিলেনঃ এই বিষয়ে আমি উম্মুল মু'মিনীন আয়েশা (রাঃ) বর্ণিত হাদীসটি গ্রহণ করিয়া থাকি। আয়েশা (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কায় কুরবানীর পশু প্রেরণ করিয়াছিলেন, কিন্তু নিজে যান নাই অথচ কোন জিনিস তাহার জন্য হারাম হয় নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 756
			}
		},
		{
			"hadithnumber": 757,
			"arabicnumber": 757,
			"text": "রেওয়ায়ত ৫৭. নাফি’ (রহঃ) বর্ণনা করেন, আবদুল্লাহ ইবন উমর (রাঃ) বলেনঃ হজ্জ বা উমরার ইহরাম বাঁধার পর কোন মহিলার যদি হায়েয হয় তবে (ইহাতে তাহার ইহরাম বিনষ্ট হইবে না) সে যতদিন ইচ্ছা ‘লাব্বায়কা’ বলিতে পরিবে। তাওয়াফ ও সাফা-মারওয়ার সায়ী সে করিবে না। বাকি আমলসমূহ অন্যদের মতই করিয়া যাইবে। পবিত্র না হওয়া পর্যন্ত তাওয়াফ, সায়ী এবং মসজিদে যাওয়া তাহার জন্য নিষিদ্ধ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 757
			}
		},
		{
			"hadithnumber": 758,
			"arabicnumber": 758,
			"text": "রেওয়ায়ত ৫৮. মালিক (রহঃ) বলেন, তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তিনবার উমরা করিয়াছেন, একবার হুদায়বিয়ার বৎসর, আরেকবার উমরাতুল কাযা, আরেকবার উমরা-ই-জি’ইররানা।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 758
			}
		},
		{
			"hadithnumber": 759,
			"arabicnumber": 759,
			"text": "রেওয়ায়ত ৫৯. হিশাম ইবন উরওয়াহ্ (রহঃ) তাহার পিতা হইতে বর্ণনা করেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তিনবার উমরা করিয়াছেন। এক উমরা শাওয়ালে আর দুই উমরা যিলকদে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 759
			}
		},
		{
			"hadithnumber": 760,
			"arabicnumber": 760,
			"text": "রেওয়ায়ত ৬০. আবদুর রহমান ইবন হারমালা আসলামী (রহঃ) বর্ণনা করেন, এক ব্যক্তি সাঈদ ইবন মুসায়্যাব (রহঃ)-কে জিজ্ঞাসা করিলঃ হজ্জের পূর্বে উমরা আদায় করা যায় কি? তিনি বলিলেনঃ হ্যাঁ, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও হজ্জের পূর্বে উমরা করিয়াছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 760
			}
		},
		{
			"hadithnumber": 761,
			"arabicnumber": 761,
			"text": "রেওয়ায়ত ৬১. সাঈদ ইবন মুসায়্যাব (রহঃ) বর্ণনা করেন- উমর ইবন আবূ সালমা (রহঃ) উমর ইবন খাত্তাব (রাঃ)-এর নিকট শাওয়াল মাসে উমরা করার অনুমতি চাহিলে তিনি অনুমতি দেন। অতঃপর তিনি উমরা আদায় করিয়া হজ্জ না করিয়া বাড়ি ফিরিয়া আসেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 761
			}
		},
		{
			"hadithnumber": 762,
			"arabicnumber": 762,
			"text": "রেওয়ায়ত ৬২. হিশাম ইবনে উরওয়াহ্ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, তিনি উমরার ইহরাম বাঁধিলে হারমে প্রবেশ করার পর ‘লাব্বায়কা’ বলা বন্ধ করিতেন। মালিক (রহঃ) বলেনঃ তান’য়ীম (মক্কার অদূরবর্তী হারম শরীফ বহির্ভূত একটি স্থান) হইতে যে ব্যক্তি উমরায় ইহরাম বঁধিবে, বায়তুল্লাহ্ দৃষ্টিগোচর না হওয়া পর্যন্ত সে যেন ‘লাব্বায়কা’ বলা বন্ধ না করে। ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-কে জিজ্ঞাসা করা হইল, মক্কার বাহিরে বসবাসকারী ব্যক্তি মীকাত’ হইতে উমরার ইহরাম বাঁধিয়া আসিলে কখন তাহাকে ‘লাব্বায়কা’ বলা বন্ধ করিতে হইবে? তিনি বলিলেনঃ হারম শরীফে প্রবেশ করার পর সে উহা বন্ধ করিয়া দিবে। আবদুল্লাহ্ ইবন উমর (রাঃ)-ও তদ্রুপ করিতেন বলিয়া জানা গিয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 762
			}
		},
		{
			"hadithnumber": 763,
			"arabicnumber": 763,
			"text": "রেওয়ায়ত ৬৩. মুহাম্মদ ইবন আবদুল্লাহ্ ইবনে হারিস (রহঃ) বর্ণনা করেন- সা'দ ইবন আবি ওক্কাস (রাঃ) ও যাহহাক ইবন কায়েস (রাঃ)-এর মধ্যে হজ্জে তামাত্তু' সম্পর্কে আলোচনা হইতেছিল। যাহহাক (রাঃ) বলিলেনঃ আল্লাহ্ তা'আলার হুকুম-আহকাম সম্পর্কে অজ্ঞ লোকেরাই হজ্জে তামাত্তু করে। সা'দ বলিলেনঃ ভ্রাতুস্পুত্র, তোমার কথাটা ঠিক হয় নাই। যাহহাক (রাঃ) বলিলেনঃ উমর ইবন খাত্তাব (রাঃ) হজ্জে তামাত্তু করা নিষেধ করিয়াছেন। সা'দ (রাঃ) বলিলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজে হজ্জে তামাত্তু করিয়াছেন আর আমরাও তাঁহার সঙ্গে উহা করিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 763
			}
		},
		{
			"hadithnumber": 764,
			"arabicnumber": 764,
			"text": "রেওয়ায়ত ৬৪. আবদুল্লাহ ইবন উমর (রাঃ) বলেনঃ আল্লাহর কসম, হজ্জের পূর্বে উমরা করা এবং কুরবানীর পশু সঙ্গে লইয়া যাওয়া যিলহজ্জ মাসে হজ্জ করিয়া আবার উমরা করা হইতে আমার নিকট অধিক প্রিয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 764
			}
		},
		{
			"hadithnumber": 765,
			"arabicnumber": 765,
			"text": "রেওয়ায়ত ৬৫. আবদুল্লাহ ইবন উমর (রাঃ) বলেনঃ যদি কেউ হজ্জের মাসে অর্থাৎ শাওয়াল, যিলকা’দা, যিলহজ্জ মাসে হজ্জের পূর্বে উমরা আদায় করিয়া মক্কায় এতদিন অবস্থান করে, যতদিনে সে হজ্জই আদায় করিতে পারে, তাহার এই হজ্জ তামাত্তু বলিয়া গণ্য হইবে এবং সামর্থ্য অনুযায়ী তাহার উপর কুরবানী করা জরুরী হইবে। যদি কুরবানী করার সামর্থ্য তাহার না থাকে তবে মক্কায় অবস্থানকালে তিনদিন এবং বাড়ি ফিরিয়া আর সাতদিন তাহাকে রোযা রাখিতে হইবে। মালিক (রহঃ) বলেনঃ উক্ত হুকুম তখনই প্রযোজ্য হইবে যখন উমরা সমাপন করিয়া হজ্জ পর্যন্ত মক্কায় অবস্থানরত থাকিবে এবং হজ্জও করিবে। মালিক (রহঃ) বলেনঃ মক্কার বাসিন্দা কোন ব্যক্তি অন্য কোথাও গিয়া বসতি স্থাপন করিল। হজ্জের মাসে সে উমরা করিতে আসিয়া মক্কায় অবস্থান করিয়া হজ্জ সমাধা করিল। তাহার এই হজ্জ হজ্জে তামাত্তু বলিয়া গণ্য হইবে। এই ব্যক্তির উপর কুরবানী করা জরুরী হইবে। কুরবানী করিতে না পারিলে তাহাকে রোযা রাখিতে হইবে। মক্কার অপরাপর স্থায়ী বাসিন্দার মত তাহার হুকুম হইবে না। ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-কে জিজ্ঞাসা করা হইল- হজ্জের মাসে মক্কার বাহিরের অধিবাসী এক ব্যক্তি উমরার ইহরাম বাঁধিয়া মক্কায় আসিল এবং উমরা করিয়া হজ্জ সমাধা করার নিয়তে মক্কায় রহিয়া গেল। তাহার এই হজ্জ তামাত্তু বলিয়া গণ্য হইবে কি? তিনি বলিলেনঃ হ্যাঁ, মক্কাবাসীদের মত তাহার হুকুম হইবে না। মক্কায় থাকবার নিয়ত যদিও সে করিয়াছে, কিন্তু সে মক্কায় যখন প্রথম পদার্পণ করিয়াছিল তখন সে মক্কার বাসিন্দা ছিল না। সুতরাং কুরবানী দেওয়া এবং কুরবানী দিতে হইলে রোযা রাখা এইরূপ ব্যক্তির উপর ওয়াজিব হইবে। কারণ এই ব্যক্তি মক্কায় কেবল অবস্থান করার নিয়ত করিয়াছে এবং সামনের ব্যাপার কি হইবে তাহাও সে জানে না। এমতাবস্থায় সে মক্কাবাসী বলিয়া গণ্য হইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 765
			}
		},
		{
			"hadithnumber": 766,
			"arabicnumber": 766,
			"text": "রেওয়ায়ত ৬৬. ইয়াহইয়া ইবন সাঈদ (রহঃ) সাঈদ ইবন মুসায়্যাব (রহঃ)-কে বলিতে শুনিয়াছেন- শাওয়াল, যিলকা'দা ও যিলহজ্জ মাসে উমরা করিয়া যদি কেউ হজ্জ পর্যন্ত মক্কায় অবস্থান করে এবং হজ্জ করিয়া নেয় তবে তাহার এই হজ্জ হজ্জে তামাত্তু বলিয়া গণ্য হইবে। সামর্থ্য থাকিলে তাহার উপর কুরবানী ওয়াজিব হইবে। অসমর্থ হইলে হজ্জের সময় তিনদিন এবং হজ্জের পর বাড়ি ফিরিয়া সাত দিন তাহাকে রোযা রাখতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 766
			}
		},
		{
			"hadithnumber": 767,
			"arabicnumber": 767,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 767
			}
		},
		{
			"hadithnumber": 768,
			"arabicnumber": 768,
			"text": "রেওয়ায়ত ৬৯. সুমাই (রহঃ) আবু বকর ইবন আবদুর রহমান (রহঃ)-কে বলিতে শুনিয়াছেন, এক মহিলা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে আসিয়া আরয করিলঃ হজ্জের সমস্ত প্রস্তুতি শেষ করা সত্ত্বেও একটি বাধার দরুন আমি হজ্জ করিতে পারি নাই, এখন কি করিব। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ রমযান মাসে উমরা করিয়া নাও। রমযান মাসের উমরাতে হজ্জের সমান সওয়াব রহিয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 768
			}
		},
		{
			"hadithnumber": 769,
			"arabicnumber": 769,
			"text": "রেওয়ায়ত ৭০. আবদুল্লাহ ইবন উমর (রাঃ) বর্ণনা করেন, উমর ইবন খাত্তাব (রাঃ) বলিয়াছেনঃ হজ্জ ও উমরার মাসে তোমরা ব্যবধান রাখিও যাহাতে হজ্জ ও উমরা উভয়ই সম্পূর্ণরূপে আদায় হইতে পারে। ইহার উপায় হইল, হজ্জের মাসে তোমরা উমরা করিও না",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 769
			}
		},
		{
			"hadithnumber": 770,
			"arabicnumber": 770,
			"text": "রেওয়ায়ত ৭১. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, উসমান ইবন আফফান (রাঃ) যখন উমরা করিতেন, মদীনায় ফিরিয়া না যাওয়া পর্যন্ত উট হইতে অবতরণ করিতেন না। মালিক (রহঃ) বলেন, উমরা করা সুন্নত। এমন কোন মুসলিম দেখা যায় নাই যিনি ইহা পরিত্যাগ করার অনুমতি দেন। মালিক (রহঃ) বলেনঃ একই বৎসরে একাধিক উমরা করা জায়েয নহে। মালিক (রহঃ) বলেনঃ উমরার ইহরাম বাধিয়া স্ত্রী সহবাস করিলে উমরা বিনষ্ট হইয়া যাইবে এবং তাহার উপর আরেকটি উমরা কাযা ও একটি কুরবানী করা ওয়াজিব হইবে। তাই সত্বর তাহাকে উহার কাযা আদায় করিয়া নেওয়া উচিত। যে স্থান হইতে প্রথম উমরার ইহরাম বাঁধিয়াছিল সেই স্থান হইতেই তাছাকে এই কাযা উমরার ইহরাম বাধিতে হইবে, তবে প্রথম উমরার ইহরাম নির্দিষ্ট মীকাতের পূর্বে বাঁধিয়া থাকিলে কাযা উমরার মীকাত হইতে বাঁধিবে। মালিক (রহঃ) বলেনঃ উমরার ইহরাম বাঁধিয়া কোন ব্যক্তি মক্কায় আসিল এবং জানাবত (গোসল ফরয হওয়া) অবস্থায় বা ওযু ব্যতিরেকে সে তাওয়াফ ও সাফা-মারওয়ার সায়ী করিল। পরে ভুলবশত স্ত্রীসহবাস করিল। অতঃপর উমরার কথা তাহার মনে পড়িল। তখন সে গোসল বা ওযু করিয়া পুনরায় তাওয়াফ ও সাফা-মারওয়ার সায়ী করিবে এবং তদস্থলে অন্য একটি উমরা কাযা করিবে ও একটি কুরবানী দিবে। মহিলাও ইহরামরত অবস্থায় তদ্রুপ কিছু করিলে তাহাকেও (পুরুষদের মত) আমল করিতে হইবে। তান’য়ীম নামক স্থান হইতে উমরার ইহরাম বাঁধার ব্যাপারে মালিক (রহঃ) বলেনঃ হারম শরীফ হইতে বাহির হইয়া যে কোন স্থান হইতে উমরার ইহরাম বাঁধিতে পারবে। আল্লাহর ইচ্ছায় এই ইহরামই মুহরিমের জন্য যথেষ্ট। তবে মীকাত হইতে ইহরাম বাঁধা উত্তম। কারণ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কর্তৃক নির্ধারিত স্থান হইতে ইহরাম বাঁধা নিঃসন্দেহে উত্তম এবং তান’য়ীম হইতে দূরে অবস্থিত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 770
			}
		},
		{
			"hadithnumber": 771,
			"arabicnumber": 771,
			"text": "রেওয়ায়ত ৭২. সুলায়মান ইবন ইয়াসার (রহঃ) বর্ণনা করেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহার আযাদকৃত গোলাম আবু রাফি এবং জনৈক আনসারী ব্যক্তিকে পাঠাইলেন। তাহারা দুইজনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পক্ষে মায়মুনা বিনতে হারিসের নিকট বিবাহের পয়গাম দিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন মদীনা হইতে মক্কার পথে যাত্রা করেন নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 771
			}
		},
		{
			"hadithnumber": 772,
			"arabicnumber": 772,
			"text": "রেওয়ায়ত ৭৩. নুবাইহ ইবন ওহাব (রহঃ) বর্ণনা করেনঃ তাহাকে উমর ইবন উবায়দুল্লাহ্ (রহঃ)-এর এবং আবান ইবন উসমান (রহঃ)-এর নিকট বলিয়া পাঠাইলেন, (তাহারা উভয়ে তখন ইহরাম অবস্থায় ছিলেন) শায়বাহ ইবন যুবায়রের মেয়ের সহিত আমার পুত্র তালহা ইবনে উমরের বিবাহ প্রদান করিতে ইচ্ছা করিয়াছি। আপনিও ইহাতে শামিল হইবেন বলিয়া আশা করি। এই সংবাদ পাইয়া আবান ইবন উসমান (রহঃ) আসিতে অনিচ্ছা প্রকাশ করিয়া বলিলেন, উসমান ইবন আফফান (রাঃ)-এর নিকট আমি শুনিয়াছি, তিনি বলিয়াছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়ছেনঃ মুহরিম (ইহরামরত ব্যক্তি) নিজেও বিবাহ করিবে না এবং অন্যকেও বিবাহ করাইবে না এবং বিবাহের পয়গামও দিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 772
			}
		},
		{
			"hadithnumber": 773,
			"arabicnumber": 773,
			"text": "রেওয়ায়ত ৭৪. আবু গাতফান ইবন তরফ মূররী (রহঃ) বর্ণনা করেন- তাহার পিতা তরীফ ইহরাম অবস্থায় মক্কায় এক মহিলাকে বিবাহ করেন, কিন্তু উমর ইবন খাত্তাব (রাঃ) ইহা বাতিল বলিয়া ঘোষণা করেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 773
			}
		},
		{
			"hadithnumber": 774,
			"arabicnumber": 774,
			"text": "রেওয়ায়ত ৭৫. নাফি' (রহঃ) বর্ণনা করেন, আবদুল্লাহ ইবন উমর (রাঃ) বলিতেনঃ মুহরিম ব্যক্তি বিবাহ করিবে না বা বিবাহের পয়গাম দিবে না, নিজের হউক বা অন্যের, সকল অবস্থায়ই তাহা নিষিদ্ধ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 774
			}
		},
		{
			"hadithnumber": 775,
			"arabicnumber": 775,
			"text": "রেওয়ায়ত ৭৬. মালিক (রহঃ) জ্ঞাত হইয়াছেন যে, সাঈদ ইবন মুসায়্যাব (রহঃ), সালিম ইবন আবদুল্লাহ্ (রহঃ) এবং সুলায়মান ইবনে ইয়াসার (রহঃ)-কে মুহরিম ব্যক্তির বিবাহ সম্পর্কে জিজ্ঞাসা করা হইলে তাহারা সকলেই বলিয়াছিলেনঃ মুহরিম ব্যক্তি নিজে বিবাহ করিবে না বা বিবাহ করাইবে না। মালিক (রহঃ) বলেনঃ মুহরিম ব্যক্তি ইচ্ছা করিলে এবং ইদ্দতের ভিতর হইলে তাহার স্ত্রীর প্রতি রুজু করিতে পারে। (রজয়ী তালাক দেওয়া স্ত্রীকে গ্রহণ করিতে পারে।)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 775
			}
		},
		{
			"hadithnumber": 776,
			"arabicnumber": 776,
			"text": "রেওয়ায়ত ৭৭. সুলায়মান ইবনে ইয়াসার (রহঃ) বর্ণনা করেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহরাম অবস্থায় মাথায় সিঙ্গা লাগাইয়াছেন এবং সেইদিন তিনি মক্কাগামী পথের উপর উপস্থিত ‘লাহয়াই জমল’ নামক স্থানে ছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 776
			}
		},
		{
			"hadithnumber": 777,
			"arabicnumber": 777,
			"text": "রেওয়ায়ত ৭৮. নাফি (রহঃ) বর্ণনা করেন, আবদুল্লাহ ইবনে উমর (রাঃ) বলতেনঃ বাধ্য না হইলে মুহরিমের জন্য সিঙ্গা লাগানো উচিত নহে। মালিক (রহঃ)-ও অনুরূপ মত ব্যক্ত করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 777
			}
		},
		{
			"hadithnumber": 778,
			"arabicnumber": 778,
			"text": "রেওয়ায়ত ৭৯. উমর ইবনে আবদুল্লাহর মাওলা আবুন নাযর (রহঃ) নাফি' (রহঃ) হইতে বর্ণনা করেন, যিনি ছিলেন আবূ কাতাদার মাওলা। নাফি' (রহঃ) বলিয়াছেনঃ আবু কাতাদ আনসারী (রাঃ) বর্ণনা করিয়াছেন যে, তিনি এক সফরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে ছিলেন। কতিপয় মুহরিম সঙ্গীসহ তিনি পিছনে থাকিয়া যান। তিনি নিজে অবশ্য ইহরাম বাঁধা অবস্থায় ছিলেন না। হঠাৎ একটা বন্য গাধা সৃষ্টিগোচর হইল, তৎক্ষণাৎ একটি ঘোড়ায় আরোহণ করিয়া তিনি উহা শিকার করিতে ছুটিলেন। সঙ্গীদের নিকট চাবুক চাহিলেন; কিন্তু কেউই দিলেন না, বর্শাখানা চাহিলে তাহাও কেউ দিলেন না। শেষে তিনি নিজে ঘোড়া হইতে নামিয়া আসিয়া বর্শা সংগ্ৰহ করিলেন এবং উক্ত গাধটিকে শিকার করিলেন। সঙ্গিগণের কেউ কেউ ইহার গোশত খাইলেন, আর কেউ কেউ খাইতে অস্বীকৃতি জানাইলেন। পরে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহিত যখন সাক্ষাৎ হইল তখন উক্ত ঘটনা তাহাকে জানাইলে তিনি বলিলেনঃ উহা এমন এক খাদ্য ছিল যাহা আল্লাহ্ তা'আলা তোমাদিগকে খাওয়াইছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 778
			}
		},
		{
			"hadithnumber": 779,
			"arabicnumber": 779,
			"text": "রেওয়ায়ত ৮০. উরওয়াহ ইবন যুবায়র (রহঃ) বর্ণনা করেন, যুবায়র ইবন আওয়াম (রাঃ) ইহরাম অবস্থায় পাথেয় হিসাবে হরিণের ভুনা গোশত সঙ্গে লইতেন। মালিক (রহঃ) বলেনঃ সকীফ অর্থ হইল ‘কাদীদ’ অর্থাৎ শুকনা গোশত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 779
			}
		},
		{
			"hadithnumber": 780,
			"arabicnumber": 780,
			"text": "রেওয়ায়ত ৮১. আতা ইবন ইয়াসার (রহঃ) আবু কাতাদা (রাঃ)-র বন্য গাধা শিকার সম্পর্কে আবুন্‌ নাযরের হাদীসটির মতই বর্ণনা করিয়াছেন। তবে যায়দ ইবন আসলাম (রহঃ) বর্ণিত হাদীসে শিকার সংক্রান্ত ঘটনায় নিম্নোক্ত বাক্যটি রহিয়াছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন বলিয়াছেনঃ উহার কোন গোশত অবশিষ্ট আছে কি?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 780
			}
		},
		{
			"hadithnumber": 781,
			"arabicnumber": 781,
			"text": "রেওয়ায়ত ৮২. ঈসা ইবন তালহা ইবনে ওবায়দুল্লাহ্ (রহঃ) উমায়র ইবন সালমা জমরী (রহঃ) হইতে বর্ণনা করেন, উমায়র তাহাকে খবর দিয়াছেন যে, বাহযী[1] (রাঃ) বর্ণনা করেন- ইহরাম বাঁধিয়া রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কার উদ্দেশ্যে রওয়ানা হইলেন, রওহা নামক স্থানে পৌছিয়া একটি বন্য গাধা দেখিতে পাওয়া গেল। ইহা সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে আলোচনা করিলে তিনি বলিলেনঃ ছাড়িয়া দাও, এখন হয়তো উহার মালিক আসিবে। ততক্ষণে বাহযী আসিয়া পৌছিলেন, আর তিনিই উহার মালিক ছিলেন। তিনি বলিলেনঃ হে আল্লাহ্‌র রাসূল! ইহা আপনার, সকল ইখতিয়ার আপনারই। শেষে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নির্দেশে আবু বকর (রাঃ) সঙ্গীদের মধ্যে উহার গোশত বণ্টন করিয়া দেন। পরে সকলেই সম্মুখে অগ্রসর হইলেন। রুয়াইসা ও আরজ নামক স্থানদ্বয়ের মধ্যবর্তী উসায়া নামক স্থানে যখন পৌছিলেন তখন একটি গাছের ছায়ায় একটি তীরবিদ্ধ হরিণ মাথা নিচু করিয়া দাঁড়াইয়া থাকিতে দেখা গেল। বর্ণনাকারী ধারণা করিয়াছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন এক ব্যক্তিকে হরিণটির নিকট দাঁড়াইয়া পাহারা দিতে নির্দেশ দিলেন, যাহাতে সকলেই উহাকে অতিক্রম করিয়া সম্মুখে চলিয়া না যাওয়া পর্যন্ত কেউ উহার কোন কিছু করিতে না পারে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 781
			}
		},
		{
			"hadithnumber": 782,
			"arabicnumber": 782,
			"text": "রেওয়ায়ত ৮৩. আবূ হুরায়রা (রাঃ) হইতে বর্ণিত, তিনি বাহরাইন হইতে আসতেছিলেন। রবাজা নামক স্থানে ইহরাম বাঁধা অবস্থায় কতিপয় ইরাকী আরোহীর সঙ্গে তাহার সাক্ষাৎ হইল। তাহারা তাহাকে শিকারের গোশত খাওয়া সম্পর্কে জিজ্ঞাসা করিল। উক্ত শিকার রবাজাবাসীদের ছিল। আবু হুরায়রা (রাঃ) বলেনঃ পরে এই ফতওয়া সম্পর্কে আমার মধ্যে সন্দেহ সৃষ্টি হয়। মদীনায় আসিয়া উমর ইবন খাত্তাব (রাঃ)-কে তাহা জানাইলাম। তিনি বলিলেনঃ তুমি তাহাদিগকে এই সম্পর্কে কি বলিয়াছিলে? আমি বলিলামঃ তাহাদেরকে উহা খাইতে পারে বলিয়া মত দিয়াছিলাম। তখন তিনি বলিলেনঃ ইহা না বলিয়া অন্য কিছু যদি বলিতে তবে তোমাকে আমি শায়েস্তা করিতাম অর্থাৎ তিনি তাহাকে ভয় দেখাইলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 782
			}
		},
		{
			"hadithnumber": 783,
			"arabicnumber": 783,
			"text": "রেওয়ায়ত ৮৪. সালিম ইবন আবদুল্লাহ্ (রহঃ) আবু হুরায়রা (রাঃ)-কে আবদুল্লাহ্ ইবন উমর (রাঃ)-এর নিকট হাদীস বর্ণনা করিতে শুনিয়াছেন। আবু হুরায়রা (রাঃ) বলিতেছিলেন, যে রবাজা নামক স্থানে ইহরাম অবস্থায় কতিপয় লোকের সহিত তাহার সাক্ষাত হয়। ইহরামবিহীন লোকের শিকারকৃত পশু যাহা তাহারা খাইতেছে সেই পশুর গোশত তাহারা খাইতে পারবে কিনা এই সম্পর্কে তাহার নিকট ফতওয়া জিজ্ঞাসা করা হইল। তিনি তাহাদিগকে উহা খাইতে পারে বলিয়া ফতওয়া দেন। তিনি বলেনঃ পরে মদীনায় আসিয়া উমর ইবন খাত্তাব (রাঃ)-কে এ সম্পর্কে জিজ্ঞাসা করিলে তিনি বলিলেন, তুমি কি ফতওয়া দিয়াছিলে? আমি বলিলামঃ ঐ গোশত খাইতে পারে বলিয়া ফতওয়া দিয়াছিলাম। তিনি বলিলেনঃ এই ফতওয়া না দিয়া যদি অন্য কোন ফতওয়া তুমি দিতে তবে তোমাকে আমি শাস্তি দিতাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 783
			}
		},
		{
			"hadithnumber": 784,
			"arabicnumber": 784,
			"text": "রেওয়ায়ত ৬৫. কা’ব আহবার (রহঃ) যখন সিরিয়া হইতে আসেন কতিপয় ইহরাম বাঁধা আরোহীও তখন তাহার সঙ্গী হয় পথে তাহারা কিছু শিকারের গোশত পাইলেন। কা’ব (রহঃ) তাহাদিগকে উহা খাইতে অনুমতি দিলেন। ঐ আরোহী দল মদীনায় আসিয়া উমর ইবন খাত্তাব (রাঃ)-কে উক্ত ঘটনা জানাইলেন। তিনি বললেন, তোমাদিগকে উক্ত গোশত খাইতে কে ফতওয়া দিয়াছিলেন? তাহারা বললেনঃ কাব (রহঃ)। তিনি বলিলেনঃ ফিরিয়া না আসা পর্যন্ত কা'বকে আমি তোমাদের আমীর বানাইয়া দিলাম। পরে মক্কার পথে তাহারা অনেক পঙ্গপাল দেখিতে পাইলেন। কা'ব তাহাদিগকে উহা খাইতে বলিয়া দিলেন। তাহারা ফিরিয়া উমর ইবন খাত্তাব (রাঃ)-কে উহা জানাইলেন। তিনি কা’বকে বলিলেনঃ কি বিষয়ের উপর ভিত্তি করিয়া তুমি এই ধরনের ফতওয়া দিলে? কা’ব বলিলেনঃ এই জাতীয় পঙ্গপাল (টিড্ডী) সামুদ্রিক প্রাণীর অন্তর্ভুক্ত (আর মুহরিমের জন্য সামুদ্রিক প্রাণী খাওয়া জায়েয) । উমর (রাঃ) বলিলেনঃ ইহা কেমন করিয়া? কা'ব বলিলেন, আমীরুল মু'মিনীন! সেই সত্তার কসম যাহার হাতে আমার প্রাণ, এই জাতীয় পঙ্গপাল এক প্রকার সামুদ্রিক মাছের হাঁচি হইতে জন্ম হইয়া থাকে। উহা বৎসরে মাত্র দুইবারই হাঁচি দিয়া থাকে। ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-কে জিজ্ঞাসা করা হইল, পথে শিকারের গোশত পাওয়া গেলে মুহরিম ব্যক্তি উহা ক্রয় করিতে পারে কি? তিনি বলিলেনঃ হজ্জযাত্রীদের নিয়তে শিকার করিয়া থাকিলে উহা আমার কাছে মাকরূহ বলিয়া মনে হয়, তবে সাধারণভাবে বিশেষ কোন নিয়ত ব্যতিরেকে শিকার করা হইয়া থাকিলে উহা ক্রয় করায় দোষের কিছুই নাই। মালিক (রহঃ) বলেন, ইহরাম বাঁধার সময় কোন ব্যক্তির নিকট তৎকর্তৃক শিকারকৃত কোন পশু ছিল অথবা শিকারকৃত কোন পশু ক্রয় করিল। তবে উহা ছাড়িয়া দেওয়া তাহার জন্য জরুরী নহে, বরং বাড়িতে তাহা রাখিয়া যাইবে। মালিক (রহঃ) বলেনঃ সমুদ্র, নদী-নালা এবং পুকুর ইত্যাদির মাছ মুহরিমগণ শিকার করিতে পরিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 784
			}
		},
		{
			"hadithnumber": 785,
			"arabicnumber": 785,
			"text": "রেওয়ায়ত ৮৬. সা’ব ইবনে জাস্‌সামা লায়াসী (রাঃ) বর্ণনা করেন- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবওয়াহ বা ওয়াদ্দান নামক স্থানে অবস্থান করিতেছিলেন। তখন তিনি (রাবী) একটা বন্য গাধা হাদিয়া হিসাবে তাহার খেদমতে পেশ করেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহা ফিরাইয়া দিলেন। সাব (রহঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহাতে আমার চেহারায় দুঃখের অভিব্যক্তি প্রকাশ পাইতে দেখিয়া বলিলেনঃ আমরা মুহরিম, ইহরাম অবস্থায় আছি। কেবল এইজন্য ইহা ফিরাইয়া দিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 785
			}
		},
		{
			"hadithnumber": 786,
			"arabicnumber": 786,
			"text": "রেওয়ায়ত ৮৭. আবদুল্লাহ্ ইবন রবী'আ (রহঃ) বলেনঃ গরমের সময় আরজ নামক স্থানে উসমান ইবনে আফফান (রাঃ)-কে ইহরামের হালতে একটি লাল কম্বল দ্বারা মুখ ঢাকিয়া বসিয়া থাকিতে দেখিলাম। সেই সময় শিকার করা জন্তুর কিছু গোশত তাহার নিকট পেশ করা হয়। তিনি সঙ্গীদেরকে উহা খাইয়া নিতে বলিলেন। সঙ্গীরা বলিলেনঃ আপনি নিজে খাইতেছেন না? উসমান (রাঃ) বলিলেন, আমি তোমাদের মত নই, ইহা আমার নিয়তে শিকার করা হইয়াছে; সুতরাং আমি খাইতে পারি না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 786
			}
		},
		{
			"hadithnumber": 787,
			"arabicnumber": 787,
			"text": "রেওয়ায়ত ৮৮. উরওয়াহ ইবনে যুবায়র (রহঃ) বর্ণনা করেন, উম্মুল মু'মিনীন আয়েশা (রাঃ) তাহাকে বলিয়াছেনঃ ভ্রাতুস্পুত্র, ইহরামের মাত্র দশটা দিন বাকি। মনে যদি দ্বিধা-সন্দেহের সৃষ্টি হয়, তবে শিকারের গোশত খাওয়া এই কয়দিন একেবারেই ছাড়িয়া দাও। মালিক (রহঃ) বলেনঃ মুহরিম ব্যক্তির নিয়তে কোন প্রাণী শিকার করা হইয়া থাকিলে, আর ঐ ব্যক্তি উহা জানা থাকা সত্ত্বেও যদি উক্ত শিকার ভক্ষণ করে, তবে তাহাকে উহার পরিবর্তে বদলা আদায় করিতে হইবে। মালিক (রহঃ) বলেনঃ মালিক (রহঃ)-কে জিজ্ঞাসা করা হইল- যদি খাদ্যাভাবের দরুন মুহরিম ব্যক্তির জন্য মৃত পশু খাওয়া জায়েয হয়, এমতাবস্থায় সে মৃত প্রাণী খাইবে, না শিকারকৃত প্রাণী আহার করিবে? তিনি বললেনঃ সে মৃত প্রাণী আহার করবে। কারণ আল্লাহ্ তা'আলা কালামে পাকে উপায়হীন অবস্থায় মৃত প্রাণী খাওয়ার অনুমতি দিয়াছেন, পক্ষান্তরে মুহরিমের জন্য কোন অবস্থায়ই শিকারকৃত প্রাণী আহার করা অনুমতি প্রদান করেন নাই। মালিক (রহঃ) বলেনঃ মুহরিম যদি কোন প্রাণী শিকার করে বা ঐ জাতীয় প্রাণী যবেহ করে, তবে উহা খাওয়া মুহরিম বা হালাল (যিনি ইহরাম অবস্থায় নাই) কোন ব্যক্তির জন্যই জায়েয নহে। কেননা শরীয়তের দৃষ্টিতে উহা যবেহ বলিয়া গণ্য হয় না। মালিক (রহঃ) বলেন, শিকার করিয়া সে নিজে আহার করুক বা শিকার করার পর নিজে আহার না করুক, উভয় অবস্থায়ই তাহাকে একই ধরনের কাফফারা দিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 787
			}
		},
		{
			"hadithnumber": 788,
			"arabicnumber": 788,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 788
			}
		},
		{
			"hadithnumber": 789,
			"arabicnumber": 789,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 789
			}
		},
		{
			"hadithnumber": 790,
			"arabicnumber": 790,
			"text": "রেওয়ায়াত ৯৩. হিশাম ইবন উরওয়াহ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ পাঁচ প্রকার প্রাণী ফাসিক। এইগুলি হারম শরীফের ভিতর ও বাহিরে যেকোন স্থানে পাওয়া গেলে মারিয়া ফেলা উচিত; যথা ইদুর, বিচ্ছু, কাক, চিল ও হিংস্ৰ কুকুর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 790
			}
		},
		{
			"hadithnumber": 791,
			"arabicnumber": 791,
			"text": "রেওয়ায়ত ৯৪. ইবন শিহাব (রহঃ) হইতে বর্ণিত- উমর ইবন খাত্তাব (রাঃ) হারম শরীফে সাপ মারার হুকুম দিয়াছেন। মালিক (রহঃ) বলেনঃ হিংস্র কুকুর বলিতে যাহাকে হারম শরীফে হত্যার অনুমতি দেওয়া হইয়াছে, তাহা এই ধরনের পশুকে বুঝায় যাহা মানুষকে কামড়ায় বা হামলা করে বা ভয় প্রদর্শন করে, যেমন সিংহ, বাঘ, চিতাবাঘ ইত্যাদি। কিন্তু যে সমস্ত পশু হিংস্র বটে, তবে হামলা করে না, যেমন হায়েনা, শিয়াল, বিড়াল ইত্যাদি পশু — মুহরিম ব্যক্তির এইগুলি মারা উচিত নহে। মারিলে তাহার উপর ফিদয়া দেওয়া ওয়াজিব। আর যে সমস্ত পাখির উল্লেখ নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম করিয়াছেন (যেমন কাক ও চিল), এইগুলি ব্যতীত অন্যান্য ক্ষতিকারক পাখিও মুহরিম ব্যক্তির জন্য হত্যা করিলে তাহাকে ফিদয়া দিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 791
			}
		},
		{
			"hadithnumber": 792,
			"arabicnumber": 792,
			"text": "রেওয়ায়ত ৯৫. রবী'আ ইবন আবদুল্লাহ ইবনে হুদায়র (রহঃ) উমর ইবন খাত্তাব (রাঃ)-কে সুকুইয়া নামক জনপদে স্বীয় উটের উকুন বাহির করিয়া কাদায় ফেলিতে দেখিয়াছেন, অথচ তিনি তখন ইকবাম অবস্থায় ছিলেন। মালিক (রহঃ) বলেনঃ আমি ইহাকে অপছন্দ করি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 792
			}
		},
		{
			"hadithnumber": 793,
			"arabicnumber": 793,
			"text": "রেওয়ায়ত ৯৬. আলকামা ইবন আবি আলকামা (রহঃ) তাহার মাতা হইতে বর্ণনা করেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পত্নী আয়েশা (রাঃ)-কে বলতে শুনিয়াছি, তাহাকে জিজ্ঞাসা করা হইয়াছিল, ইহরাম অবস্থায় শরীর চুলকাইতে পারবে কি? তিনি [আয়েশ (রাঃ)] বলেনঃ হ্যাঁ, চুলকাইতে পারিবে, ভালভাবে চুলকাইতে পারিবে। কেউ আমার হাত বাঁধিয়া রাখিলে তবে পা দ্বারা যদি সম্ভব হয়, প্রয়োজন হইলে তাহা দিয়াই আমি চুলকাইব।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 793
			}
		},
		{
			"hadithnumber": 794,
			"arabicnumber": 794,
			"text": "রেওয়ায়ত ৯৭. আইয়ুব ইবন মূসা (রহঃ) বর্ণনা করেন, চোখে অসুখ হওয়ায় আবদুল্লাহ ইবন উমার (রাঃ) ইহরাম অবস্থায়ও আয়না দেখিয়াছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 794
			}
		},
		{
			"hadithnumber": 795,
			"arabicnumber": 795,
			"text": "রেওয়ায়ত ৯৮. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবনে উমর (রাঃ) মুহরিম ব্যক্তির জন্য উটের উকুন ইত্যাদি বাহির করা মাকরূহ বলিয়া মনে করিতেন। মালিক (রহঃ) বলেন, আমার নিকট এই মতটিই অধিক প্রিয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 795
			}
		},
		{
			"hadithnumber": 796,
			"arabicnumber": 796,
			"text": "রেওয়ায়ত ৯৯. মুহাম্মদ ইবন আবদুল্লাহ্ ইবন আবূ মরইয়াম (রহঃ) সাঈদ ইবন মুসায়্যাব (রহঃ)-এর নিকট জিজ্ঞাসা করিলেনঃ ইহরামকালে আমার একটা নখ ভাঙিয়া গিয়াছে, এখন কি করিব? সাঈদ (রহঃ) বললেনঃ ইহা কাটিয়া ফেল। ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-কে জিজ্ঞাসা করা হইল- মুহরিম ব্যক্তির কানে ব্যথা হইলে সে কানে গন্ধবিহীন তেল ব্যবহার করিতে পারিবে কি? তিনি বলিলেনঃ ইহাতে কোন দোষ নাই। যদি মুখেও ঢালে, তবুও আমি দোষ মনে করি না। মালিক (রহঃ) বলেনঃ মুহরিম ব্যক্তি যদি ফোড়া বা ফোস্কা ফাটাইয়া দেয় বা প্রয়োজনে সিঙ্গা লাগায় তবে কোন গুনাহ্ হইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 796
			}
		},
		{
			"hadithnumber": 797,
			"arabicnumber": 797,
			"text": "রেওয়ায়ত ১০০. আবদুল্লাহ্ ইবন আব্বাস (রাঃ) বর্ণনা করেন, ফযল ইবন আব্বাস (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহিত তাহার পিছনে আরোহী ছিলেন। এমন সময় খাস'আম কবীলার এক মহিলা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট মাসআলা জানিতে আসিলেন। ফযল তাহার দিকে তাকাইতে লাগিলেন আর সেই মহিলাটিও ফযলকে দেখিতে লাগিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম ফযলের চেহারা অন্যদিকে ঘুরাইয়া দিলেন। মহিলাটি বললেন, হে আল্লাহর রাসূল! আমার পিতার উপর হজ্জ এমন সময় ফরয হইল যে, বাৰ্ধক্যজনিত কারণে তিনি এত দুর্বল যে, উটের পিঠে বসিতে সক্ষম নন। তাহার পক্ষ হইতে হজ্জ করা আমার জন্য বৈধ হইবে কি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হ্যাঁ, করিয়া নাও। এই ঘটনাটি ছিল বিদায় হজ্জের।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 797
			}
		},
		{
			"hadithnumber": 798,
			"arabicnumber": 798,
			"text": "রেওয়ায়ত ১০১. মালিক (রহঃ) বলেন, শক্ৰ যদি কাহারও যাত্রাপথে বাধার সৃষ্টি করে এবং বায়তুল্লাহ পর্যন্ত সে যদি পৌছিতে না পারে তবে যে স্থানে বাধাপ্রাপ্ত হইবে সেই স্থানেই সে ইহরাম খুলিয়া ফেলিবে ও কুরবানী দিবে এবং মাথা কামাইয়া ফেলিবে। তাহাকে আর দ্বিতীয়বার এই হজ্জ কাযা করিতে হইবে না। মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, মক্কার কাফিরগণ হুদায়বিয়ার ময়দানে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাহার সাহাবীগণকে মক্কায় যাইতে বাধা দিল। তখন তাহারা সেখানেই ইহরাম খুলিয়া ফেলিয়াছিলেন, হাদয়ী কুরবানী দিয়াছিলেন এবং মাথা কামাইয়া নিয়াছিলেন। বায়তুল্লাহ তাওয়াফ এবং কুরবানীর পশু মক্কায় পৌছার পূর্বেই তাহারা হালাল হইয়া গিয়াছিলেন। পরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন সঙ্গী বা সাহাবীকে দ্বিতীয়বার এই হজ্জ কাযা করার বা পুনরায় করার নির্দেশ দিয়াছিলেন বলিয়া আমাদের জানা নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 798
			}
		},
		{
			"hadithnumber": 799,
			"arabicnumber": 799,
			"text": "রেওয়ায়ত ১০২. নাফি' (রহঃ) হইতে বর্ণিত, বিশৃংখলার বৎসর আবদুল্লাহ ইবনে উমর (রাঃ) উমরা করার নিয়তে মক্কার উদ্দেশ্যে যাত্রা করার সময় বলিয়াছিলেনঃ বায়তুল্লায় যাওয়ার পথে যদি আমি বাধাপ্রাপ্ত হই, তবে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে থাকাকালীন এই অবস্থায় আমরা যাহা করিয়াছিলাম আজও তাহাই করিব। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হুদায়বিয়ার বৎসর শুধু উমরার নিয়তেই মক্কা যাত্রা করিয়াছিলেন– এই কথা খেয়াল করিয়া আবদুল্লাহ্ ইবন উমর (রাঃ)-ও শুধু উমরার ইহরাম বাধিলেন। পরে চিন্তা করিয়া দেখিলেন, বাধাপ্রাপ্ত হওয়ার বেলায় হজ্জ ও উমরার হুকুম একই ধরনের। তোমাদিগকে সাক্ষী বানাইতেছি যে, আমি এখন হজ্জ ও উমরা উভয়ই আমার উপর ওয়াজিব করিয়া নিলাম। এই বলিয়া তিনি যাত্রা শুরু করিলেন এবং বায়তুল্লাম আসিয়া তাওয়াফ সমাধা করিলেন, আর এইটুকুই নিজের জন্য যথেষ্ট মনে করিলেন। কুরবানীর যে পশু ছিল তাহাও নাহর করিলেন।[1] মালিক (রহঃ) বলেনঃ আমার মতে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং তাহার সাহাবীগণ যাহা করিয়াছিলেন হজ্জের পথে বাধাপ্রাপ্ত হইলে তাহাই করা উচিত। তবে শত্রুর দ্বারা নয়, অন্য কোন কারণে বাধাপ্রাপ্ত হইলে বায়তুল্লাহু না যাওয়া পর্যন্ত আর সে হালাল হইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 799
			}
		},
		{
			"hadithnumber": 800,
			"arabicnumber": 800,
			"text": "রেওয়ায়ত ১০৩. আবদুল্লাহ ইবন উমর (রাঃ) বলেনঃ অসুস্থতার কারণে যদি কাহারও যাত্রা বাধাপ্রাপ্ত হয় তবে তাওয়াফ ও সাফা মারওয়ার সায়ী করা ব্যতীত সে হালাল হইবে না। কোন কাপড় বা ঔষধ ব্যবহার করার প্রয়োজন হইলে (যাহা ইহরাম অবস্থায় জায়েয নহে) তাহা ব্যবহার করিবে এবং উহার ফিদয়া দিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 800
			}
		},
		{
			"hadithnumber": 801,
			"arabicnumber": 801,
			"text": "রেওয়ায়ত ১০৪. ইয়াহইয়া ইবনে সাঈদ (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌঁছিয়াছে যে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলিতেন, ইহরামকে শুধু বায়তুল্লাহই হালাল করিতে পারে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 801
			}
		},
		{
			"hadithnumber": 802,
			"arabicnumber": 802,
			"text": "রেওয়ায়ত ১০৫. আইয়ুব ইবন আবি তামীম সাখতীয়ানী (রহঃ) বসরার জনৈক প্রবীণ[1] ব্যক্তি হইতে বর্ণনা করেন- তিনি বলেনঃ মক্কার উদ্দেশ্যে একবার রওয়ানা ইলাম। পথে উট হইতে পড়িয়া আমার উরু ভাঙিয়া যায়। মক্কায় আমি একজনকে পাঠাইলাম। তখন সেখানে আবদুল্লাহ ইবন আব্বাস (রাঃ), আবদুল্লাহ ইবন উমর (রাঃ) এবং আরও অনেক বিজ্ঞ লোক উপস্থিত ছিলেন। তাঁহাদের কেউই আমাকে এই অবস্থায় ইহরাম খুলিতে অনুমতি দিলেন না। ফলে সাত মাস পর্যন্ত সেখানে আমি পড়িয়া রহিলাম। শেষে সুস্থ হইয়া উমরা আদায় করিয়া ইহরাম খুলিলাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 802
			}
		},
		{
			"hadithnumber": 803,
			"arabicnumber": 803,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 803
			}
		},
		{
			"hadithnumber": 804,
			"arabicnumber": 804,
			"text": "রেওয়ায়ত ১০৬. আবদুল্লাহ ইবন উমর (রাঃ) বলেনঃ অসুস্থতার কারণে যদি কেউ যাত্রা করিয়াও খানা-এ-কাবায় পৌঁছিতে না পারে তবে তাওয়াফ ও সাফা-মারওয়ার সায়ী না করা পর্যন্ত সে আর হালাল হইবে না। সুলায়মান ইবন ইয়াসার (রাঃ) হইতে বর্ণিত-মাবদ ইবন হুযাবা মাখযুমী (রহঃ) মক্কা আসার পথে তাহার বাহন হইতে পড়িয়া গিয়া আহত হন। তিনি তখন ইহরাম অবস্থায় ছিলেন। অতঃপর একটি কূপের নিকট যাত্রা বিরতি করিলেন এবং খোঁজ নিয়া জানিতে পারিলেন যে, সেখানে আবদুল্লাহ্ ইবনে উমর (রাঃ), আবদুল্লাহ্ ইবন যুবায়র (রাঃ) এবং মারওয়ান ইবনুল হাকাম (রাঃ) আছেন। তাহাদের নিকট উক্ত ঘটনা বর্ণনা করিলে তাহারা বলিলেনঃ প্রয়োজনীয় ঔষধ ব্যবহার কর আর উহার ফিদয়া আদায় করিয়া দিও। সুস্থ হওয়ার পর উমরা আদায় করিয়া ইহরাম খুলিয়া ফেলিও। আগামী বৎসর পুনরায় এই হজ্জ আদায় করিয়া নিও এবং সামর্থ্যানুযায়ী কুরবানী দিও। মালিক (রহঃ) বলেনঃ শত্রু ছাড়া অন্য কোন কারণে হজ্জে বাধাপ্রাপ্ত হইলে আমাদের নিকটও মাসআলা অনুরূপ। মালিক (রহঃ) বলেনঃ আবু আইয়ুব আনসারী (রাঃ) এবং হাব্বান ইবন আসওয়াদ (রাঃ) যখন হজ্জের নির্ধারিত সময়ে উপস্থিত হইতে পারিলেন না এবং নাহরের দিন উপস্থিত হইলেন, সেই বৎসর দশ তারিখে মক্কায় গিয়া পৌছিলেন, তখন উমর ইবন খাত্তাব (রাঃ) তাহাদিগকে বলিয়াছিলেনঃ উমরা করিয়া ইহরাম খুলিয়া নিন এবং এই বৎসর ফিরিয়া যান। আগামী বৎসর হজ্জ করিবেন এবং কুরবানী দিবেন। কুরবানীর সামর্থ্য না হইলে আপনাদেরকে হজ্জের সময় তিনদিন এবং বাড়ি ফিরিয়া সাতদিন রোযা রাখিতে হইবে। মালিক (রহঃ) বলেনঃ ইহরাম বাঁধার পর অসুস্থতা বা অন্য কোন কারণে- যেমন তারিখে ভুল করার দরুন, যদি হজ্জ করিতে না পারে তবে তাহার হুকুম মুহসারের মত হইবে।[1] ইয়াহইয়া (রহঃ) বলেন- মালিক (রহঃ)-কে জিজ্ঞাসা করা হইল- মক্কাবাসী কোন ব্যক্তি হজ্জের নিয়তে ইহরাম বাঁধার পর তাহার পা ভাঙিয়া গেল বা দাস্ত শুরু হইল, এখন সে কি করিবে? তিনি বলিলেনঃ তাহার হুকুম মুহসারের মত। মক্কার বাহিরের অধিবাসী কোন ব্যক্তির ইহসার বা বাধাপ্রাপ্ত হইলে যে হুকুম, এখানেও সেই হুকুম প্রযোজ্য হইবে। মালিক (রহঃ) বলেনঃ হজ্জের মাসে কোন ব্যক্তি উমরার ইহরাম বাধিয়া মক্কা আসিল এবং উমরা সমাধা করিয়া মক্কা হইতে পুনরায় হজ্জের ইহরাম বাঁধার পর তাহার পা ভাঙিয়া গেল বা এমন কোন কষ্ট পাইল যাহাতে সে আরাফাতে যাইতে আর সক্ষম হইল না। তখন সে যখন সুস্থ হইবে হারম শরীফের বাহিরে গিয়া মক্কায় ফিরিয়া আসিবে এবং তাওয়াফ ও সাফা-মারওয়ার সায়ী করিয়া ইহরাম খুলিয়া ফেলিবে। পরে আগামী বৎসর পুনরায় হজ্জ করিবে এবং কুরবানী দিবে। মালিক (রহঃ) বলেনঃ কোন ব্যক্তি হজ্জের মওসুমে উমরার ইহরাম বাঁধিয়া মক্কায় প্রবেশ করিল। অতঃপর উমরা পূর্ণ করিয়া মক্কা হইতে হজ্জের ইহরাম বাঁধিল। অতঃপর (দুর্ঘটনায় হাত-পা) ভাঙিল অথবা অন্য কোন বাঁধার সম্মুখীন হইল। ফলে অন্য লোকদের সঙ্গে আরাফাতে উপস্থিত হইতে পারে নাই। মালিক (রহঃ) বলেনঃ উক্ত ব্যক্তি ইহরাম অবস্থায় থাকিবে। যখন সে সুস্থ হইবে, হিলের (হারম শরীফের বাহিরে) দিকে যাইবে। অতঃপর মক্কার দিকে প্রত্যাবর্তন করিবে। তাওয়াফ করিবে ও সাফা-মারওয়া সায়ী করিবে এবং হালাল হইবে। তাহার উপর আগামী বৎসর হাদয়ী ও হজ্জ ওয়াজিব হইবে। মালিক (রহঃ) বলেনঃ যে ব্যক্তি মক্কা হইতে হজ্জের ইহরাম বাধিয়াছে, তাওয়াফ ও সাফা-মারওয়া সায়ী করিয়াছে, অতঃপর সে অসুস্থ হইয়া পড়ে এবং লোকের সঙ্গে আরাফাতে উপস্থিত হইতে পারে নাই। তিনি বলেনঃ যদি সে হজ্জ করিতে না পারে যখন সম্ভব হইবে তখন সে হিলের দিকে যাইবে এবং উমরার নিয়ত করিয়া মক্কায় প্রবেশ করবে। ইহার কারণ, প্রথমে সে তাওয়াফ ও উমরার নিয়ত করে নাই। এইজন্য সে পুনরায় তাওয়াফ ও সায়ী করিবে এবং তাহার উপর আগামী বৎসর হাদয়ী ও হজ্জ ওয়াজিব হইবে।মালিক (রহঃ) বলেনঃ যে ব্যক্তি হজ্জের ইহরাম বাধিয়াছে সে যদি মক্কার বাহিরের লোক হয়, সে অসুস্থতার দরুন যদি হজ্জ করিতে না পারে, অথচ ইহার পূর্বে সে তাওয়াফ ও সাফা-মারওয়া সায়ী করিয়াছিল, সেই ব্যক্তি উমরা করিয়া হালাল হইবে এবং আরেকবার বায়তুল্লাহ্ তাওয়াফ ও সাফা-মারওয়ার সায়ী করবে। কারণ তাহার পূর্বের তাওয়াফ ও সায়ী ছিল হজ্জের নিয়তে। তাহার উপর আগামী বৎসর হাদয়ী ও হজ্জ ওয়াজিব হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 804
			}
		},
		{
			"hadithnumber": 805,
			"arabicnumber": 805,
			"text": "রেওয়ায়ত ১০৭. আয়েশা (রাঃ) হইতে বর্ণিত, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি কি লক্ষ কর নাই, তোমার কওম কুরাইশগণ যখন কা'বা শরীফ পুনঃনির্মাণ করে তখন ইবরাহীম (আঃ) যে চৌহদ্দি নিয়া ইহা নির্মাণ করিয়াছিলেন ইহা হইতে কিছু কমাইয়া ফেলিয়াছিল? আয়েশা (রাঃ) বলিলেনঃ ইয়া রাসূলাল্লাহ! ইবরাহীম (আঃ) যেমন বানাইয়াছিলেন অদ্রপ আপনি বানাইয়া দিতেছেন না কেন? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ তোমার কওমের কুফরির অবস্থা যদি অতি নিকট না হইত তবে নিশ্চয়ই আমি অদ্রপ বানাইয়া দিতাম। আবদুল্লাহ ইবন উমর (রাঃ) বলেনঃ আয়েশা (রাঃ) যদি ইহা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হইতে শুনিয়া থাকেন, আমার ধারণা এই কারণেই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাওয়াফের সময় হাতীম সংলগ্ন রুকনে শামী এবং রুকনে ইরাকী ইস্তিলাম করিতেন না, ছুইতেন না। কেননা ইবরাহীম (আঃ)-এর বুনিয়াদের উপর কা'বা শরীফের নির্মাণ হয় নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 805
			}
		},
		{
			"hadithnumber": 806,
			"arabicnumber": 806,
			"text": "রেওয়ায়ত ১০৮. হিশাম ইবন উরওয়াহ্ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, উম্মুল মু'মিনীন আয়েশা (রাঃ) বলিয়াছেনঃ আমি পরওয়া করি না, নামায হাতীমে আদায় করি বা কা'বার অভ্যন্তরে আদায় করি। (অর্থাৎ এই দুই স্থানের মধ্যে কোন পার্থক্য আছে বলিয়া আমি মনে করি না। কেননা হাতীমও খানা-এ-কা'বার অংশ)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 806
			}
		},
		{
			"hadithnumber": 807,
			"arabicnumber": 807,
			"text": "রেওয়ায়ত ১০৯. মালিক (রহঃ) বলেন, তিনি ইবন শিহাব (রহঃ)-কে বলিতে শুনিয়াছেনঃ কতিপয় আলিমের নিকট শুনিয়াছি তাহারা বলেনঃ হাতীমের পাশে দেয়াল উঠানোর এবং তাওয়াফের মধ্যে শামিল করার কারণ হইল ইহাতে সম্পূর্ণ বায়তুল্লাহর তাওয়াফ যেন আদায় হইয়া যায়। (কেননা ইহাও বায়তুল্লাহর অংশ)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 807
			}
		},
		{
			"hadithnumber": 808,
			"arabicnumber": 808,
			"text": "রেওয়ায়ত ১১০. জাবির ইবন আবদুল্লাহ (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখিয়াছি, হাজরে আসওয়াদ হইতে আরম্ভ করিয়া হাজরে আসওয়াদ পর্যন্ত তাওয়াফে (চক্করে) তিনি রমল করিয়াছেন।[1] মালিক (রহঃ) বলেনঃ আমাদের শহরস্থ আলিমদের অভিমত ইহাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 808
			}
		},
		{
			"hadithnumber": 809,
			"arabicnumber": 809,
			"text": "রেওয়ায়ত ১১১. নাফি (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) হাজরে আসওয়াদ হইতে হাজরে আসওয়াদ পর্যন্ত তিন তাওয়াফে রমল করিতেন আর বাকি তাওয়াফগুলিতে সাধারণভাবে চলিতেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 809
			}
		},
		{
			"hadithnumber": 810,
			"arabicnumber": 810,
			"text": "রেওয়ায়ত ১১২. হিশাম ইবন উরওয়াহ (রহঃ) বলেনঃ তাহার পিতা যখন বায়তুল্লাহ্ তাওয়াফ করিতেন তখন তিন তাওয়াফে দৌড়াইয়া দৌড়াইয়া চলিতেন এবং এই দো'আ পড়িতেনঃ (اللَّهُمَّ لاَ إِلَهَ إِلاَّ أَنْتَا وَأَنْتَ تُحْيِي بَعْدَ مَا أَمَتَّا) অর্থাৎ হে আল্লাহ, তুমি ছাড়া আর কোন ইলাহ নাই, আর মৃত্যুর পর আমাদের যিন্দা করিবে তুমিই। এই দোআটি তিনি আস্তে আস্তে পড়িতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 810
			}
		},
		{
			"hadithnumber": 811,
			"arabicnumber": 811,
			"text": "রেওয়ায়ত ১১৩. হিশাম ইবন উরওয়াহ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন যে, তিনি আবদুল্লাহ ইবন যুবায়র (রাঃ)-কে তানয়ীম নামক স্থান হইতে উমরার ইহরাম বাঁধিতে দেখিয়াছেন এবং বায়তুল্লাহর চতুষ্পার্শ্বে প্রথম তিন তাওয়াফে রমল করিতে দেখিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 811
			}
		},
		{
			"hadithnumber": 812,
			"arabicnumber": 812,
			"text": "রেওয়ায়ত ১১৪. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) যখন মক্কা হইতে ইহরাম বাঁধিতেন তখন মীনা হইতে ফিরিয়া না আসা পর্যন্ত বায়তুল্লাহর তাওয়াফ ও সাফা-মারওয়ার সায়ী করিতেন না, রমলও করিতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 812
			}
		},
		{
			"hadithnumber": 813,
			"arabicnumber": 813,
			"text": "রেওয়ায়ত ১১৫. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাওয়াফ করার পর দুই রাকাআত নামায আদায় করিলেন। অতঃপর তিনি সাফা-মারওয়ার দিকে রওয়ানা হওয়ার ইচ্ছা করিলেন, তখন তিনি হাজরে আসওয়াদ ইস্তিলাম[1] করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 813
			}
		},
		{
			"hadithnumber": 814,
			"arabicnumber": 814,
			"text": "রেওয়ায়ত ১১৬. হিশাম ইবন উরওয়াহ্ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবদুর রহমান ইবন আউফ (রাঃ)-কে বলিলেনঃ হে আবু মুহাম্মদ, কিরূপে তুমি হাজরে আসওয়াদে ইস্তিলাম কর? তিনি বলিলেনঃ কখনও ইস্তিলাম করিয়াছি আর কখনও করি নাই। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ তুমি ঠিক করিয়াছ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 814
			}
		},
		{
			"hadithnumber": 815,
			"arabicnumber": 815,
			"text": "রেওয়ায়ত ১৭. হিশাম ইবন উরওয়াহ্ (রহঃ) বর্ণনা করেন, তাহার পিতা উরওয়া বায়তুল্লাহর তাওয়াফ করার সময় সকল রুকনই ছুইতেন। বিশেষত একান্ত বাধ্য না হইলে রুকনে ইয়ামানীর ইস্তিলাম পরিত্যাগ করিতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 815
			}
		},
		{
			"hadithnumber": 816,
			"arabicnumber": 816,
			"text": "রেওয়ায়ত ১১৮. হিশাম ইবন উরওয়াহ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, বায়তুল্লাহর তাওয়াফের সময় উমর ইবন খাত্তাব (রাঃ) হাজরে আসওয়াদকে লক্ষ করিয়া বলিতেনঃ তুমি শুধু একখানা পাথর, লাভ-লোকসানের কোন ক্ষমতা তোমার নাই। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে যদি তোমাকে চুমা দিতে না দেখিতাম তবে আমিও তোমাকে চুমা দিতাম না। অতঃপর তিনি হাজরে আসওয়াদ চুমা দিলেন। মালিক (রহঃ) বলেনঃ কতিপয় আলিমকে বলিতে শুনিয়াছি, রুকনে ইয়ামানী ইস্তিলাম করিয়া হাত দ্বারা মুখ স্পর্শ করা মুস্তাহাব, সরাসরি উহাকে চুমা দিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 816
			}
		},
		{
			"hadithnumber": 817,
			"arabicnumber": 817,
			"text": "রেওয়ায়ত ১১৯. হিশাম ইবন উরওয়াহ্ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, তিনি দুই সাবআর মাঝখানে নামায না পড়িয়া উভয়কে একত্র করিতেন না, বরং তিনি প্রত্যেক সাবআর পর দুই রাকাআত নামায পড়িতেন মাকামে ইবরাহীমের নিকট, আর কখনও পড়িতেন অন্যত্র।[1] মালিক (রহঃ)-কে জিজ্ঞাসা করা হইলঃ কেউ যদি কয়েক সাব্‌আর পর একত্রে সবগুলির নামায আদায় করে তবে তাহা জায়েয হইবে কি? তিনি বলিলেনঃ জায়েয হইবে না। প্রতি সাবআর (সাত তাওয়াফ) সঙ্গে সঙ্গেই দুই রাকাআত নামায পড়া সুন্নত। মালিক (রহঃ) বলেনঃ ভুল করিয়া যদি কেউ আট বা নয় চক্কর (তাওয়াফ) দিয়া ফেলে তবে যখনই মনে পড়িবে তাওয়াফ ছাড়িয়া দিবে এবং দুই রাকাআত নামায আদায় করিয়া নিবে। অতিরিক্ত তাওয়াফগুলি ধর্তব্যের বলিয়া মনে করিবে না এবং দুই সাবআ সমাধা করিয়া পরে একত্রে নামায আদায় করা সঙ্গত নহে। প্রতি সাবআর (সাত তাওয়াফ) সঙ্গে সঙ্গেই দুই রাকাআত নামায পড়া সুন্নত। মালিক (রহঃ) বলেনঃ তাওয়াফ করিয়া দুই রাকাআত নামায আদায় করার পর সাত তাওয়াফ (চক্কর) পুরা হয় নাই বলিয়া যদি কাহারও মনে সন্দেহ হয় তবে তাহাকে ইয়াকীন (দৃঢ় বিশ্বাস)-এর উপর ভিত্তি করিয়া তাওয়াফ পুরা করিয়া আবার দুই রাকাআত নামায আদায় করিতে হইবে। কারণ সাত চক্কর পূর্ণ করার পরই তাওয়াফের নামায পড়িতে হয়। মালিক (রহঃ) বলেনঃ তাওয়াফ বা সায়ী করার সময় যদি কাহারও ওযু নষ্ট হইয়া যায়, তবে ওযু করিয়া পুনরায় নূতন করিয়া তাওয়াফ করিবে এবং সায়ীর যে কয় চক্কর অবশিষ্ট ছিল তাহা পুরা করিবে।মালিক (রহঃ) বলেনঃ ওযু নষ্ট হওয়ার দরুন সায়ী বাতিল হয় না। তবে সায়ী শুরু করার সময় ওযু করিতে হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 817
			}
		},
		{
			"hadithnumber": 818,
			"arabicnumber": 818,
			"text": "রেওয়ায়ত ১২০. আবদুর রহমান ইবন আবদ আল-করিয়্যে[1] (রহঃ) ফজরের নামাযের পর উমর ইবন খাত্তাব (রাঃ)-এর সঙ্গে বায়তুল্লাহর তওয়াফ করেন। আবদুল্লাহ ইবন উমর (রাঃ) যখন তাওয়াফ শেষ করেন তখনও সূর্যোদয় হয় নাই। তিনি উটে আরোহণ করিয়া বাহিরে গেলেন এবং মী-তুয়া নামক স্থানে পৌছিয়া উট হইতে অবতরণ করিয়া দুই রাকাআত নামায আদায় করেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 818
			}
		},
		{
			"hadithnumber": 819,
			"arabicnumber": 819,
			"text": "রেওয়ায়ত ১২১. আবুয যুবায়র মক্কী (রহঃ) বলেনঃ আবদুল্লাহ ইবন আব্বাস (রাঃ)-কে আসরের পর তাওয়াফ করিতে দেখিতে পাইলাম। তাওয়াফের পর হুজরায় চলিয়া গেলেন। জানি না সেখানে তিনি কি করিয়াছিলেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 819
			}
		},
		{
			"hadithnumber": 820,
			"arabicnumber": 820,
			"text": "রেওয়ায়ত ১২২. আবুয যুবায়র মক্কী (রহঃ) বর্ণনা করেন, আমি দেখিয়াছি আসর ও ফজরের পর বায়তুল্লাহ খালি হইয়া পড়িত। ঐ সময় কোন তাওয়াফকারী থাকিত না। মালিক (রহঃ) বলেনঃ তাওয়াফ শুরু করার পর ফজর বা আসরের জামাতের তাকবীর শুরু হইলে ইহা ত্যাগ করিয়া ইমামের সহিত নামাযে শামিল হওয়া উচিত। নামায পড়ার পর অবশিষ্ট তাওয়াফ পুরা করিবে। কিন্তু তাওয়াফের দুই রাকাআত নামায ফজরের সময় সূর্যোদয় এবং আসরের সময় সূর্য অস্ত না যাওয়া পর্যন্ত পড়িবে না। মাগরিবের পর যদি উহা পড়ে তবে উহাতেও কোন দোষ নাই। মালিক (রহঃ) বলেনঃ সাত চক্করের উপর বৃদ্ধি না করিয়া যদি কোন ব্যক্তি ফজর ও আসরের পর তাওয়াফ করে এবং তাওয়াফের দুই রাকাআত নামায সূর্যোদয়ের পর পড়িয়া নেয়, যেরূপ উমর ইবন খাত্তাব (রাঃ) করিয়াছিলেন, ইহাতে কোন দোষ নাই। আর যদি আসরের পর তাওয়াফ করিয়া থাকে তবে সূর্য অস্ত যাওয়ার পূর্বে তাওয়াফের নামায পড়িবে না। সূর্যাস্তের পর ইচ্ছা করিলে তাওয়াফের দুই রাকাআত নামায পড়িয়া লইবে অথবা ইচ্ছা করিলে মাগরিবের নামায সমাপ্ত করার পর পড়িবে, ইহাতে কোন ক্ষতি নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 820
			}
		},
		{
			"hadithnumber": 821,
			"arabicnumber": 821,
			"text": "রেওয়ায়ত ১২৩. আবদুল্লাহ ইবন উমর (রাঃ) বর্ণনা করেন, উমর ইবন খাত্তাব (রাঃ) বলিয়াছেনঃ বায়তুল্লাহর তাওয়াফ না করিয়া হাজীগণের কেউ যেন মক্কা হইতে না ফিরে। কারণ হজ্জের শেষ আমল হইল বায়তুল্লাহর তাওয়াফ।[1] মালিক (রহঃ) বলেনঃ ‘শেষ আমল বায়তুল্লাহর তাওয়াফ উমর ইবন খাত্তাব (রাঃ)-এর এই উক্তির অর্থ হইল, আল্লাহ তা'আলা ইরশাদ করেনঃ ‏وَمَنْ يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِنْ تَقْوَى الْقُلُوبِ‏ যে ব্যক্তি আল্লাহর নিদর্শনসমূহের মর্যাদা দিবে উহা তাহার আল্লাহভীতি হইতেই উৎসারিত। এ সবকিছুরই সম্পর্ক বায়তুল্লাহর সঙ্গে। সুতরাং হজ্জের সমস্ত রুকন ও আমল বায়তুল্লাহতে যাইয়াই শেষ হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 821
			}
		},
		{
			"hadithnumber": 822,
			"arabicnumber": 822,
			"text": "রেওয়ায়ত ১২৪. ইয়াহইয়া ইবন সাঈদ (রহঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) এক ব্যক্তিকে মাররুয-যাহরান (মক্কা হইতে ১৮ মাইল দূরে অবস্থিত একটি স্থান) হইতে ফিরাইয়া দিয়াছিলেন। কারণ সে তাওয়াফুল বিদা করিয়া আসে নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 822
			}
		},
		{
			"hadithnumber": 823,
			"arabicnumber": 823,
			"text": "রেওয়ায়ত ১২৫. হিশাম ইবন উরওয়াহ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, তিনি বলিয়াছেনঃ তাওয়াফে ইফাযা (তাওয়াফে যিয়ারত) যে ব্যক্তি করিতে পারিয়াছে আল্লাহ তাহার হজ্জ পুরা করিয়া দিয়াছেন। পরে বিশেষ অসুবিধা দেখা না দিলে সে যেন তাওয়াফুল-বিদা'ও করিয়া নেয়। যদি কোন অসুবিধা দেখা দেয় এবং এই কারণে বিদায়ী তাওয়াফ করিতে না পারে তবে তাওয়াফে ইফাযা আদায় করায় হজ্জ তাহার পুরা হইয়া গিয়াছে। মালিক (রহঃ) বলেনঃ তাওয়াফে যিয়ারত করার পর তাওয়াফুল বিদা জানা না থাকার দরুন যদি কেউ উহা না করিয়া মক্কা হইতে চলিয়া আসে তবে আর তাহার জন্য ফিরিয়া যাওয়া জরুরী নহে। তবে মক্কার নিকটবর্তী স্থানে থাকিলে পুনরায় গিয়া বিদায়ী-তাওয়াফ করিয়া নেওয়া উচিত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 823
			}
		},
		{
			"hadithnumber": 824,
			"arabicnumber": 824,
			"text": "রেওয়ায়ত ১২৬. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী উম্মে সালমা (রাঃ) বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আমার অসুস্থতার কথা জানাইলে তিনি বলিলেনঃ পুরুষদের পিছনে থাকিয়া কোন বাহনে আরোহণ করিয়া তোমার তাওয়াফ আদায় করিয়া নাও। উম্মে সালমা (রাঃ) বলেনঃ আমি তাওয়াফ করিলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন কা'বার এক কোণায় নামাযে দাঁড়াইয়া সূরা তুর পড়িতেছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 824
			}
		},
		{
			"hadithnumber": 825,
			"arabicnumber": 825,
			"text": "রেওয়ায়ত ১২৭. আবূয যুবায়র মক্কী (রহঃ) বলেনঃ আবা মায়িয আসলামী আবদুল্লাহ ইবন সুফইয়ান (রহঃ) তাহার নিকট বর্ণনা করিয়াছেন, তিনি আবদুল্লাহ ইবন উমর (রাঃ)-এর নিকট বসা ছিলেন। তখন এক মহিলা আসিয়া বলিলঃ আমি বায়তুল্লাহর তাওয়াফের ইচ্ছা করিয়াছিলাম। মসজিদের দরওয়াজা পর্যন্ত পৌছিতেই আমার ঋতুস্রাব আরম্ভ হইল। এমতাবস্থায় আমি ফিরিয়া যাই। পরে ঋতুস্রাব বন্ধ হইলে আবার তাওয়াফের জন্য আসি, কিন্তু মসজিদের দরওয়াজা পর্যন্ত পৌছিতেই আবার ঋতুস্রাব শুরু হইল। ফলে আবার ফিরিয়া গেলাম। শেষে ঋতুস্রাব বন্ধ হইলে আবার তাওয়াফ করিতে গেলাম। কিন্তু এইবারও দরওয়াজা পর্যন্ত যাইতে না যাইতে পুনরায় রক্ত দেখা দেয়। এখন কি করিব? আবদুল্লাহ ইবন উমর (রাঃ) বলিলেনঃ ইহা শয়তানের কাণ্ড! গোসল করিয়া লজ্জাস্থানে কাপড়ের পটি দিয়া তাওয়াফ সারিয়া নাও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 825
			}
		},
		{
			"hadithnumber": 826,
			"arabicnumber": 826,
			"text": "রেওয়ায়ত ১২৮. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, সা'দ ইবন আবি ওয়াক্কাস (রাঃ) মক্কায় পৌছিয়া যদি দেখিতেন নয় তারিখ অতি নিকটবর্তী (সময় অতি অল্প), তবে তাওয়াফ ও সায়ী করার পূর্বেই আরাফাতে চলিয়া যাইতেন এবং সেখান হইতে ফিরিবার পর তাওয়াফ করিতেন। মালিক (রহঃ) বলেনঃ সময় সংকীর্ণ হইলে এইরূপ করা (আরাফাতে প্রথমে যাওয়া) জায়েয। মালিক (রহঃ)-কে জিজ্ঞাসা করা হইলঃ ওয়াজিব তাওয়াফ আদায় করার সময় কাহারও সঙ্গে কথা বলার জন্য কি থামিয়া যাওয়া বৈধ? তিনি বলিলেনঃ আমি উহা পছন্দ করি না। মালিক (রহঃ) বলেনঃ তাওয়াফ এবং সাফা-মারওয়ার সায়ী পবিত্রতার সহিত করা উচিত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 826
			}
		},
		{
			"hadithnumber": 827,
			"arabicnumber": 827,
			"text": "রেওয়ায়ত ১২৯. জাবির ইবন আবদুল্লাহ (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদ হইতে সাফার উদ্দেশ্যে যখন বাহির হইলেন তখন শুনিয়াছি, তিনি বলিতেছেনঃ আল্লাহ যে স্থানটির উল্লেখ প্রথমে করিয়াছিলেন আমরাও সেই স্থান হইতে শুরু করিব। অতঃপর তিনি সাফা হইতে সায়ী করা শুরু করেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 827
			}
		},
		{
			"hadithnumber": 828,
			"arabicnumber": 828,
			"text": "রেওয়ায়ত ১৩০. জাবির ইবন আবদুল্লাহ (রাঃ) বলেন-রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন সাফায় গিয়া দাঁড়াইতেন তখন তিনবার ‘আল্লাহু আকবর’ বলিতেন এবং এই দু'আ পড়িতেনঃ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ অর্থাৎ, আল্লাহ ছাড়া কোন ইলাহ নাই, তাহার কোন শরীক নাই, সকল সাম্রাজ্য, ক্ষমতা এবং সকল প্রশংসা শুধু তাহারই, আর তিনি সকল বস্তুর উপর ক্ষমতাশীল। তিনবার ইহা পড়িয়া পরে দুআ করিতেন। মারওয়া পাহাড়েও তিনি এইরূপ করিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 828
			}
		},
		{
			"hadithnumber": 829,
			"arabicnumber": 829,
			"text": "রেওয়ায়ত ১৩১. নাফি’ (রহঃ) হইতে বর্ণিত, তিনি আবদুল্লাহ ইবন উমর (রাঃ)-কে সাফার উপর দাঁড়াইয়া এই দুআ পড়িতে শুনিয়াছেনঃ اللَّهُمَّ إِنَّكَ قُلْتَ ادْعُونِي أَسْتَجِبْ لَكُمْ وَإِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ وَإِنِّي أَسْأَلُكَ كَمَا هَدَيْتَنِي لِلإِسْلاَمِ أَنْ لاَ تَنْزِعَهُ مِنِّي حَتَّى تَتَوَفَّانِي وَأَنَا مُسْلِمٌ অর্থাৎ, হে আল্লাহ! আপনি বলিয়াছেনঃ আমার কাছে চাও, আমি তাহা কবুল করিব। আর আপনি কখনও ওয়াদা খেলাফ করেন না। এখন আপনার নিকটই আমি চাহিতেছি, আমাকে যেরূপ ইসলামের দিকে হিদায়াত করিয়াছেন উহা আমার নিকট হইতে ছিনাইয়া নিবেন না। আমার মৃত্যু পর্যন্ত আমি মুসলিম হিসাবে আপনার অনুগত বান্দা হইয়াই যেন থাকি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 829
			}
		},
		{
			"hadithnumber": 830,
			"arabicnumber": 830,
			"text": "রেওয়ায়ত ১৩২. হিশাম ইবন উরওয়াহ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন- তিনি বলিয়াছেন, আমি উম্মুল মু'মিনীন আয়েশা (রাঃ)-কে বললাম (তখন আমি অল্প বয়স্ক), দেখুন, আল্লাহ তা'আলা ইরশাদ করিয়াছেনঃ (‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ) সুতরাং যে কেউ বাইতুল্লাহর হজ্জ বা উমরা করিবে তাহার জন্য এই দুইটির মধ্যে সায়ী করায় কোন গুনাহ নাই- তাই কেউ যদি সায়ী না করে তবে ইহাতে তাহার গুনাহ হইবে কি? তিনি বলিলেনঃ সাবধান, তুমি যাহা বুঝিয়াছ তাহা ঠিক নহে। তাহাই যদি হইত তবে আয়াতে বলার ভঙ্গী হইত- এই দুইয়ের মধ্যে সায়ী না করায় কোন গুনাহ নাই। (অথচ আল্লাহ্ তা'আলা বলিয়াছেনঃ সায়ী করায় কোন গুনাহ নাই।) এই আয়াতটি মূলত আনসারদের ব্যাপারে নাযিল হইয়াছিল। ইহারা জাহিলী যুগে মানাতের উদ্দেশ্যে ইহরাম বাধিয়া হজ্জের নিয়তে আসিত। মক্কার পথে কুদায়দ নামক স্থানের বিপরীতে ছিল ওদের দেবী মানাত। সাফা-মারওয়ায় সায়ী করা তাহারা মনে করিত গুনাহর কাজ। ইসলাম আসার পর তাহারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এই সম্পর্কে জিজ্ঞাসা করে, তখন নাযিল হয় এই আয়াতঃ ‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا অর্থাৎ, সাফা ও মারওয়া আল্লাহর নিদর্শনসমূহের অন্যতম। সুতরাং যে কেহ কাবা গৃহের হজ্জ কিংবা উমরা সম্পন্ন করে এই দুইটির মধ্যে যাতায়াত করিলে তাহার কোন পাপ নাই। (বাকারাঃ ১৫৮)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 830
			}
		},
		{
			"hadithnumber": 831,
			"arabicnumber": 831,
			"text": "রেওয়ায়ত ১৩৩. হিশাম ইবন উরওয়াহ (রহঃ) বর্ণনা করেন- আবদুল্লাহ ইবন উমর (রাঃ)-এর কন্যা সাওদা (রহঃ) ছিলেন উরওয়াহ ইবন যুবায়র (রহঃ)-এর স্ত্রী। একবার হজ্জ বা উমরার সময় তিনি সাফা-মারওয়ার সায়ীর জন্য বাহির হন। তিনি মোটা ধরনের মহিলা ছিলেন। ইশার নামায পড়িয়া মানুষ যখন বাহির হইয়াছিল তখন তিনি হাঁটিয়া হাঁটিয়া হজ্জ অথবা উমরার তাওয়াফ ও সায়ী শুরু করিয়াছিলেন। কিন্তু তখনও সায়ী শেষ হইতে পারে নাই, আর এইদিকে ফজরের আযান হইয়া যায়। সায়ী শেষ করিতে তাহার ইশা হইতে ফজর পর্যন্ত সময় লাগিয়াছিল। উরওয়াহ কাহাকেও কোন কিছুতে আরোহণ করিয়া সায়ী করিতে দেখিলে কঠোরভাবে নিষেধ করিতেন। লোকেরা তাহাকে দেখিলে অসুস্থতার বাহানা করিত। তিনি পরে আমাদের নিকট আলাপে বলিতেনঃ ইহারা (যাহারা সওয়ার হইয়া সায়ী করে) ক্ষতিগ্রস্ত, তাহারা স্বীয় উদ্দেশ্য হাসিল করিতে পারে নাই। মালিক (রহঃ) বলেনঃ উমরা করার সময় সাফা-মারওয়ার সায়ী করিতে যদি ভুলিয়া যায় এবং মক্কা হইতে দূরে চলিয়া যাওয়ার পর ইহা স্মরণ হইলে তাহাকে পুনরায় মক্কায় আসিয়া সায়ী করিতে হইবে। আর ইহার মধ্যে স্ত্রী সহবাস করিয়া থাকিলে তবে ফিরিয়া আসিয়া সায়ী করিবে এবং দ্বিতীয়বার উমরা করিবে এবং হাদয়ী কুরবানী দিবে। মালিক (রহঃ)-কে জিজ্ঞাসা করা হইলঃ সায়ী করার সময় যদি কেউ কাহারও সঙ্গে দাঁড়াইয়া কথা বলিতে শুরু করে তবে কেমন হইবে? তিনি বলিলেনঃ আমি ইহাকে পছন্দ করি না। মালিক (রহঃ) বলেনঃ কেউ যদি তাওয়াফ করিতে গিয়া কোন চক্কর ভুলিয়া যায় বা এই সম্পর্কে তাহার সন্দেহ হয়, পরে সায়ী করার সময় যদি তাহার উহা খেয়াল হয় তবে সায়ী মওকুফ করিয়া দিবে এবং প্রথমে ইয়াকীনের উপর ভিত্তি করিয়া তাওয়াফ পুরা করিয়া দুই রাকাআত তাওয়াফের নামায পড়িয়া নুতনভাবে সায়ী করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 831
			}
		},
		{
			"hadithnumber": 832,
			"arabicnumber": 832,
			"text": "রেওয়ায়ত ১৩৪. জাবির ইবন আবদুল্লাহ্ (রাঃ) বর্ণনা করেন- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফা ও মারওয়াতে সায়ী করিতে আসিলে সাধারণভাবে হাঁটিতেন, মধ্যবর্তী নিম্নভূমিতে (বাতনে ওয়াদী) যখন চলিতেন তখন ইহা হইতে বাহির না হওয়া পর্যন্ত দ্রুত চলিতেন। মালিক (রহঃ) বলেনঃ যে ব্যক্তি অজ্ঞতার কারণে তাওয়াফের পূর্বে সায়ী করিয়া ফেলে তবে সে ফিরিয়া আসিয়া তাওয়াফ করার পর পুনরায় সায়ী করিবে। তাওয়াফের কথা তুলিয়া মক্কা হইতে দূরে চলিয়া গেলে যত দূরেই যাক তাহাকে ফিরিয়া আসিতে হইবে এবং বায়তুল্লাহর তাওয়াফ ও সাফা-মারওয়ার সায়ী করিতে হইবে। আর স্ত্রী সহবাস করিয়া থাকিলে তবে ফিরিয়া আসিয়া তাওয়াফ ও সায়ী করিতে হইবে এবং উমরার বাকি কার্যাদি সমাধা করিবে। তাহার পক্ষে পুনরায় উমরা করা এবং হাদয়ী কুরবানী করা ওয়াজিব।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 832
			}
		},
		{
			"hadithnumber": 833,
			"arabicnumber": 833,
			"text": "রেওয়ায়ত ১৩৫. হারিস তনয়া উম্মুল ফযল (রাঃ) বর্ণনা করেন- আরাফাত দিবসে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রোযাদার কিনা এই সম্পর্কে কতিপয় সাহাবী আমার নিকট আসিয়া তাহাদের সন্দেহ প্রকাশ করেন। কেউ কেউ বলিয়াছেন, তিনি রোযা রাখিয়াছেন, কেউ কেউ বলিলেন, আজ রোযা রাখেন নাই। উম্মুল ফযল (রাঃ) তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর খিদমতে একটি দুধভর্তি পেয়ালা পাঠাইলেন। তিনি তাহা পান করিলেন। তখন তিনি আরাফাতে একটি উটের উপর আসীন ছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 833
			}
		},
		{
			"hadithnumber": 834,
			"arabicnumber": 834,
			"text": "রেওয়ায়ত ১৩৬. কাসিম ইবন মুহাম্মদ (রহঃ) বর্ণনা করেনঃ উম্মুল মু'মিনীন আয়েশা (রাঃ) আরাফাত দিবসে রোযা রাখিতেন। কাসিম ইবন মুহাম্মদ বলেনঃ আমি তাহাকে (আয়েশা (রাঃ)-কে আরাফাত দিবসে সন্ধ্যায় দেখিয়াছি, ইমামের (আমীরুল মু'মিনীন) প্রত্যাবর্তনের পরও তিনি [আয়েশা (রাঃ)] অপেক্ষা করিলেন এবং পরে ভিড় কমিয়া পথ পরিষ্কার হইলে পানি আনাইয়া ইফতার করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 834
			}
		},
		{
			"hadithnumber": 835,
			"arabicnumber": 835,
			"text": "রেওয়ায়ত ১৩৭. সুলায়মান ইবন ইয়াসার (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আইয়্যামে তাশরীকে রোযা রাখিতে নিষেধ করিয়াছেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 835
			}
		},
		{
			"hadithnumber": 836,
			"arabicnumber": 836,
			"text": "রেওয়ায়ত ১৩৮. ইবন শিহাব (রহঃ) হইতে বর্ণিত, মিনার দিবসগুলিতে আবদুল্লাহ ইবন হুযাফা (রাঃ)-কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘুরিয়া ফিরিয়া ঘোষণা প্রচার করিতে বলিলেনঃ খাওয়া, পান করা আর আল্লাহর স্মরণের জন্য এই দিনগুলি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 836
			}
		},
		{
			"hadithnumber": 837,
			"arabicnumber": 837,
			"text": "রেওয়ায়ত ১৩৯. আবু হুৱায়রা (রাঃ) বর্ণনা করেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুইদিন রোযা রাখতে নিষেধ করিয়াছেন- ঈদুল ফিতরের দিন আর ঈদুল আযহার দিন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 837
			}
		},
		{
			"hadithnumber": 838,
			"arabicnumber": 838,
			"text": "রেওয়ায়ত ১৪০. আবদুল্লাহ ইবন উমর (রহঃ) তাহার পিতা আমর ইবনু আস (রাঃ)-এর নিকট গেলেন। দেখিতে পাইলেন তিনি আহার করিতেছেন, আবদুল্লাহকেও তিনি ডাকিলেন। আমি বলিলামঃ আমি আজ রোযা আছি। তিনি বলিলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যেই দিনে রোযা রাখিতে নিষেধ করিয়াছেন সেই দিনগুলিতে তুমি রোযা রাখিলে! পরে তিনি আবদুল্লাহকে রোযা ভাঙিয়া ফেলিতে হুকুম করিলেন। মালিক (রহঃ) বলেনঃ এই দিনগুলি হইতেছে আইয়্যামে তাশরীক, (যিলহজ্জ মাসের ১১, ১২ এবং ১৩ তারিখ) যেগুলিতে আমর ইবনু আস (রাঃ) তাহার পুত্রকে রোযা রাখতে নিষেধ করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 838
			}
		},
		{
			"hadithnumber": 839,
			"arabicnumber": 839,
			"text": "রেওয়ায়ত ১৪১. আবদুল্লাহ ইবন আবু বকর ইবন হাযম (রহঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হজ্জ বা উমরাতে একটি উট যাহা পূর্বে (আবু জাহল ইবন হিশামের ছিল) হাদয়ী হিসাবে পঠাইয়াছিলেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 839
			}
		},
		{
			"hadithnumber": 840,
			"arabicnumber": 840,
			"text": "রেওয়ায়ত ১৪২. আবু হুরায়রা (রাঃ) বর্ণনা করেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে একটি কুরবানীর উট হাকাইয়া নিয়া যাইতে দেখিতে পাইয়া বলিলেনঃ ইহার উপর আরোহণ কর। সে বলিলঃ হে আল্লাহর রাসূল, ইহা তো কুরবানীর উদ্দেশ্যে নিয়া যাইতেছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ তোমার অনিষ্ট হউক, আরোহণ কর। এই কথা তিনি দ্বিতীয় বা তৃতীয় বারে বলিয়াছিলেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 840
			}
		},
		{
			"hadithnumber": 841,
			"arabicnumber": 841,
			"text": "রেওয়ায়ত ১৪৩. আবদুল্লাহ্ ইবন দীনার (রহঃ) বর্ণনা করেন, আবদুল্লাহ ইবন উমর (রাঃ) হজ্জের সময় দুইটি করিয়া আর উমরার সময় একটি করিয়া কুরবানী দিতেন। আমি তাহাকে খালিদ ইবন আসীদের স্বরে বাঁধা তাঁহার উমরার কুরবানীর উটটিকে নাহর করিতে দেখিয়াছি। আমি উমরার সময় দেখিয়াছি তাহার কুরবানীর উটের উপর এমন জোরে বর্শা মারিয়াছিলেন (নাহর করার জন্য) যে, উহা ভেদ করিয়া অপরদিকে গিয়া ঘাড়ের নিচ দিকে বাহির হইয়া গিয়াছিল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 841
			}
		},
		{
			"hadithnumber": 842,
			"arabicnumber": 842,
			"text": "রেওয়ায়ত ১৪৪. ইয়াহইয়া ইবন সাঈদ (রহঃ) বর্ণনা করেন, উমর ইবন আবদুল আযীয (রহঃ) হজ্জ কিংবা উমরার সময় একটি উট হাদয়ী হিসাবে প্রেরণ করিয়াছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 842
			}
		},
		{
			"hadithnumber": 843,
			"arabicnumber": 843,
			"text": "রেওয়ায়ত ১৪৫. আবূ জাফর কারী (রহঃ) বর্ণনা করেন- আবদুল্লাহ ইবন আইয়াশ ইবন আবি রবী'আ মাখযূমী দুইটি উটের কুরবানী করিয়াছিলেন। ইহার মধ্যে একটি বুখতী ধরনের উষ্ট্রীও ছিল।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 843
			}
		},
		{
			"hadithnumber": 844,
			"arabicnumber": 844,
			"text": "রেওয়ায়ত ১৪৬. নাফি’ (রহঃ) বর্ণনা করেন, আবদুল্লাহ্ ইবন উমর (রাঃ) বলেনঃ কুরবানীর উদ্দেশ্যে প্রেরিত উষ্ট্রীর যদি বাচ্চা পয়দা হয় তবে মার সঙ্গে বাচ্চাটিকেও কুরবানীর জন্য লইয়া যাওয়া হইবে। লইয়া যাওয়ার জন্য যদি কোন যানবাহন না পাওয়া যায় তবে বাচ্চাটিকে মার উপর চাপাইয়া লইয়া যাওয়া হইবে, যাহাতে মার সঙ্গে বাচ্চাটিকে নাহর করা যায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 844
			}
		},
		{
			"hadithnumber": 845,
			"arabicnumber": 845,
			"text": "রেওয়ায়ত ১৪৭. হিশাম ইবন উরওয়াহ (রহঃ) বলেন- আমার পিতা উরওয়াহ (রহঃ) বলিতেনঃ কুরবানীর উদ্দেশ্যে নীত কুরবানীর পশুর উপর প্রয়োজন হইলে আরোহণ করিতে পার। তবে এইভাবে ব্যবহার করিবে না যে, উহার কোমর ভঙিয়া যায়। দুধের প্রয়োজন হইলে ইহার বাচ্চ পরিতৃপ্ত হইয়া খাওয়ার পর (অবশিষ্ট দুধ) পান করিতে পর, আর ইহাকে নাহর করার সময় বাচ্চাটিকেও নাহর করিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 845
			}
		},
		{
			"hadithnumber": 846,
			"arabicnumber": 846,
			"text": "রেওয়ায়ত ১৪৮. নাফি’ (রহঃ) হইতে বর্ণিত- আবদুল্লাহ ইবন উমর (রাঃ) মদীনা হইতে যখন কুরবানীর পশু (হাদয়ী) নিয়া যাইতেন তখন যুল-হুলায়ফা পৌছিয়া ইহার গলায় চিহ্নের জন্য কিছু একটা লটকাইয়া দিতেন এবং সেখানেই উহার ইশআর (কাঁধের চামড়া যখম করিয়া রক্ত মাখাইয়া দেওয়া) করিতেন। প্রথমে ঐ পশুটির মুখ কিবলার দিকে করিয়া ইহার গলায় দুইটি জুতা লটকাইয়া দিতেন, পরে বাম দিকের কাঁধের চামড়া চিরিয়া উহা রক্তাক্ত করিতেন এবং নিজের সঙ্গে উহা হাঁকাইয়া নিয়া চলিতেন। আরাফাতে পৌছিয়া সকলে যেখানে অবস্থান করিতেন, তিনিও সেখানে অবস্থান করিতেন। সকলেই যখন ফিরিয়া আসিত কুরবানীর পশুটিও সঙ্গে ফিরিত। ইয়াওমুন নাহরের সকালে মিনায় পৌছিয়া মাথা কামানো বা চুল ছাটার পূর্বেই কুরবানীর পশুটি নাহর করিতেন। আবদুল্লাহ ইবন উমর (রাঃ) স্বীয় কুরবানীর পশুটি স্বহস্তে নাহর করিতেন। কিবলামুখ করিয়া প্রথমে কুরবানীর পশুগুলি কাতার করাইয়া দাঁড় করাইতেন, পরে এইগুলি নাহর করিতেন এবং এই গোশত নিজেও খাইতেন এবং অন্যদেরকেও খাওয়াইতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 846
			}
		},
		{
			"hadithnumber": 847,
			"arabicnumber": 847,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 847
			}
		},
		{
			"hadithnumber": 848,
			"arabicnumber": 848,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 848
			}
		},
		{
			"hadithnumber": 849,
			"arabicnumber": 849,
			"text": "রেওয়ায়ত ১৪৯. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) ইশআর করার উদ্দেশ্যে যখন কুরবানীর উটের কুঁজে যখম করিতেন তখন বিসমিল্লাহি ওয়াল্লাহু আকবার বলিতেন। নাফি' (রহঃ) হইতে বর্ণিত- আবদুল্লাহ ইবন উমর (রাঃ) বলিতেনঃ কাদয়ী হইল সেই পশু যাহার গলায় হার লটকানো হইয়াছে, যাহার কুঁজ চিরিয়া যখম করা হইয়াছে এবং আরাফাতের ময়দানে নিয়া দাঁড় করানো হইয়াছে। নাফি (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) কুরবানীর উটসমূহকে মিসরীয় কুবাতি ও আনমাত কাপড় পরাইতেন। কুরবানীর পর কাপড়সমূহ বায়তুল্লাহর গিলাফ হিসাবে ব্যবহার করার উদ্দেশ্যে পাঠাইয়া দিতেন। মালিক (রহঃ) আবদুল্লাহ্ ইবন সীনার (রহঃ)-কে জিজ্ঞাসা করিয়াছিলেনঃ পরে বায়তুল্লাহর জন্য যখন আলাদা গিলাফ বানাইয়া নেওয়া হইল তখন আবদুল্লাহ্ ইবন উমর (রাঃ) কুরবানীর উটসমূহের এই কাপড়-চোপড় কি করিতেন? তিনি বলিলেনঃ এইগুলি তিনি তখন খয়রাত করিয়া দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 849
			}
		},
		{
			"hadithnumber": 850,
			"arabicnumber": 850,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 850
			}
		},
		{
			"hadithnumber": 851,
			"arabicnumber": 851,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 851
			}
		},
		{
			"hadithnumber": 852,
			"arabicnumber": 852,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 852
			}
		},
		{
			"hadithnumber": 853,
			"arabicnumber": 853,
			"text": "রেওয়ায়ত ১৫০. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) বলিতেনঃ কুরবানীর উট পাঁচ বা ততোধিক বৎসর বয়সের হইতে হইবে। নাফি' (রহঃ) হইতে বর্ণিত- আবদুল্লাহ ইবনে উমর (রাঃ) তাহার কুরবানীর উটের কাপড়-চোপড় মিনা আরাফাতে না যাওয়া পর্যন্ত ছিড়িতেন না বা পরাইতেন না। হিশাম ইবন উরওয়াহ্ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, তিনি স্বীয় পুত্রগণকে বলিতেনঃ বৎসগণ আল্লাহর নামে তোমরা এমন উট কুরবানী দিও না একজন দোস্তকে যাহা দিতে লজ্জা কর। আল্লাহ্ তাআলা সবচাইতে সম্মানিত। সুতরাং সর্বোত্তম বস্তুই তাহার জন্য নির্বাচন করা উচিত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 853
			}
		},
		{
			"hadithnumber": 854,
			"arabicnumber": 854,
			"text": "রেওয়ায়ত ১৫১. হিশাম ইবন উরওয়াহ্ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, যে ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর হাদয়ী নিয়া যাইতেছিল সেই ব্যক্তি তাহাকে বলিলঃ পথে যদি হাদয়ীর কোন একটি মারা যাওয়ার উপক্রম হয় তবে কি করিব? তিনি বলিলেন, এমন হইতে দেখিলে ঐ পশুটিকে 'নাহর' করিয়া গলায় বাধা হারটি রক্ত মাখাইয়া রাখিয়া দিবে। ইহাতে লোকগণ ইহার গোশত খাইয়া নিতে পরিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 854
			}
		},
		{
			"hadithnumber": 855,
			"arabicnumber": 855,
			"text": "রেওয়ায়ত ১৫২. সাঈদ ইবন মুসায়্যাব (রহঃ) বলেনঃ যে ব্যক্তি হাদয়ী নিয়া রওয়ানা হইয়াছে, সে যদি ইহাকে পথে মরিয়া যাইতে দেখে, তবে নাহর করিয়া রাখিয়া দিবে, যাহাতে লোকজন উহা খাইয়া নিতে পারে। ঐ ব্যক্তির কোন বদলা দিতে হইবে না। কিন্তু ইহার গোশত নিজে খাইলে বা অন্য কাহাকেও খাইতে বলিলে বদলা দিতে হইবে। মালিক (রহঃ) সাওর ইবন যায়দ দীলি (রহঃ) হইতে বর্ণনা করেনঃ আবদুল্লাহ ইবন আব্বাস (রাঃ)-ও উপরিউক্ত মত ব্যক্ত করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 855
			}
		},
		{
			"hadithnumber": 856,
			"arabicnumber": 856,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 856
			}
		},
		{
			"hadithnumber": 857,
			"arabicnumber": 857,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 857
			}
		},
		{
			"hadithnumber": 858,
			"arabicnumber": 858,
			"text": "রেওয়ায়ত ১৫৩. ইবন শিহাব (রহঃ) হইতে বর্ণিত, তিনি বলিয়াছেনঃ কাফফারা, মানত বা হজ্জে তামাত্তু'র কুরবানীর উট লইয়া রওয়ানা হওয়ার পর পথে যদি মারা যায় বা নষ্ট হইয়া যায় তবে ইহার পরিবর্তে আরেকটি উট কুরবানী দিতে হইবে। নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ) বলিয়াছেনঃ কুরবানীর পশু পথে মারা গেলে বা হারাইয়া গেলে উহা মানতের হইয়া থাকিলে ইহার পরিবর্তে আরেকটি কুরবানী দিতে হইবে, আর নফলী হইয়া থাকিলে আরেকটি কুরবানী দেওয়া না দেওয়া মালিকের ইচ্ছাধীন থাকিবে। মালিক (রহঃ) বলেনঃ তিনি বিজ্ঞ আলিমগণকে বলিতে শুনিয়াছেন, শাস্তিস্বরূপ অথবা ইহরামের পরিপন্থী পরিচ্ছন্নতা ও আরাম-আয়েশ গ্রহণ করার দরুন যে হাদয়ী (কুরবানী) ওয়াজিব হয় উহা হইতে কুরবানী প্রদানকারী আহার করিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 858
			}
		},
		{
			"hadithnumber": 859,
			"arabicnumber": 859,
			"text": "রেওয়ায়ত ১৫৪. মালিক (রহঃ) বলেন, তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, উমর ইবন খাত্তাব (রাঃ), আলী ইবন আবি তালিব (রাঃ) ও আবু হুরায়রা (রাঃ)-কে জিজ্ঞাসা করা হইয়াছিল- ইহরাম অবস্থায় কেউ যদি স্ত্রীর সহিত সহবাস করে তবে সে কি করিবে? তাহারা বলিলেনঃ স্বামী-স্ত্রী উভয়েই হজ্জের অবশিষ্ট রুকনগুলি আদায় করিয়া হজ্জ পুরা করিবে। আগামী বৎসর তাহাদিগকে পুনরায় হজ্জ করিতে হইবে এবং কুরবানী দিতে হইবে। মালিক (রহঃ) বলেনঃ আলী ইবন আবি তালিব (রাঃ) বলিয়াছেনঃ আগামী বৎসর পুনরায় হজ্জের ইহরাম বাঁধিলে হজ্জ পুরা না হওয়া পর্যন্ত তাহারা স্বামী-স্ত্রী উভয়ে আলাদা আলাদা থাকিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 859
			}
		},
		{
			"hadithnumber": 860,
			"arabicnumber": 860,
			"text": "রেওয়ায়ত ১৫৫. ইয়াহইয়া ইবন সাঈদ (রহঃ) সাঈদ ইবন মুসায়্যাব (রহঃ)-এর নিকট শুনিয়াছেন- তিনি সমবেত লোকদেরকে লক্ষ করিয়া বলিতেছিলেনঃ ইহরাম অবস্থায় যে ব্যক্তি স্ত্রী সহবাস করে তাহার সম্পর্কে তোমরা কি বল? উপস্থিত সকলেই চুপ হইয়া রহিলেন। শেষে সাঈদ (রহঃ) নিজেই বলিলেনঃ এক ব্যক্তি ইহরাম অবস্থায় স্ত্রী সহবাস করিয়াছিল। পরে সে এই সম্পর্কে মাসআলা জিজ্ঞাসার জন্য এক ব্যক্তিকে মদীনায় প্রেরণ করে। কেউ কেউ জবাব দিলেনঃ স্বামী-স্ত্রী এক বৎসর পর্যন্ত উভয়েই আলাদা হইয়া থাকিবে। কিন্তু সাঈদ (রহঃ) বললেনঃ এই বৎসর তাহারা হজ্জে অবশিষ্ট কাজসমূহ পুরা করবে। পরের বৎসর জীবিত থাকিলে পুনরায় হজ্জ করিবে এবং কুরবানী দিবে। প্রথম হজ্জের ইহরাম যে স্থান হইতে বাঁধিয়াছিল এই হজ্জের ইহরামও সেই স্থান হইতে বাঁধিবে। আর কাযা হজ্জ করিতে যখন আসিবে তখন উভয়েই তাহারা হজ্জ পূর্ণ না হওয়া পর্যন্ত আলাদা আলাদা থাকিবে। মালিক (রহঃ) বলেনঃ উভয়কেই এক একটি করিয়া কুরবানী করিতে হইবে। মালিক (রহঃ) বলেনঃ আরাফাতে অবস্থানের পর এবং প্রস্তর নিক্ষেপের পূর্বে যদি কেউ স্ত্রী সহবাস করে তবে তাহার উপর কুরবানী করা ওয়াজিব হইবে এবং আগামী বৎসর পুনরায় তাহাকে হজ্জ করিতে হইবে। রমিয়ে হাজর বা প্রস্তর নিক্ষেপের পর যদি স্ত্রী সহবাস করে, তবে তাহাকে একটি উমরা এবং একটি কুরবানী করিতে হইবে। পরেরবার পুনরায় হজ্জ করিতে হইবে না। মালিক (রহঃ) বলেনঃ স্খলন না হইয়া শুধু পুরুষাঙ্গ প্রবিষ্ট হইলেও হজ্জ ও উমরা বিনষ্ট হইয়া যাইবে এবং হাদয়ী ওয়াজিব হইবে। প্রবিষ্ট না হইয়াও যদি রতিলীলায় স্খলন হইয়া যায় তবুও হজ্জ বিনষ্ট হইয়া যাইবে। আর কল্পনা করার দরুন যদি কাহারও স্বলন হইয়া যায় তবে ইহাতে কিছুই ওয়াজিব হইবে না। মালিক (রহঃ) বলেনঃ কেউ স্ত্রীকে চুমা খাইলে স্খলন না হইলেও তাহার উপর কুরবানী ওয়াজিব হইবে। মালিক (রহঃ) বলেনঃ কোন মুহরিম মহিলার স্বামী যদি তাহার সম্মতিক্রমে তাহার সঙ্গে হজ্জ ও উমরার মধ্যে কয়েকবার সহবাস করে তবে ঐ মহিলাকে পরের বৎসর এই হজ্জের কায আদায় করিতে হইবে এবং কুরবানী দিতে হইবে। আর এইরূপ সহবাস উমরার মধ্যে হইলেও অতি সত্বর উমরা কাযা করিতে হইবে ও কুরবানী দিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 860
			}
		},
		{
			"hadithnumber": 861,
			"arabicnumber": 861,
			"text": "রেওয়ায়ত ১৫৬. সুলায়মান ইবন ইয়াসার (রাঃ) বর্ণনা করেন, আবু আইয়ুব আনসারী (রহঃ) হজ্জের নিয়তে রওয়ানা হইয়াছিলেন। মক্কার পথে নাযিয়া নামক স্থানে পৌছার পর তাহার উটটি হারাইয়া যায়। নাহর দিবস অর্থাৎ দশ তারিখে তিনি উমর ইবন খাত্তাব (রাঃ)-এর নিকট উপস্থিত হইয়া ঘটনা বিবৃত করলেন। তখন উমর ইবন খাত্তাব (রাঃ) বলিলেনঃ এখন উমরা করিয়৷ ইহরাম খুলিয়া ফেল। আগামী বৎসর হজ্জ করিয়া নিও এবং সামর্থ্যানুসারে একটি কুরবানী করিও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 861
			}
		},
		{
			"hadithnumber": 862,
			"arabicnumber": 862,
			"text": "রেওয়ায়ত ১৫৭. সুলায়মান ইবন ইয়াসার (রাঃ) বর্ণনা করেন- ইয়াওমুন-নাহারে অর্থাৎ দশ তারিখে হাব্বার ইবন আসওয়াদ (রাঃ) হজ্জের জন্য আসিয়া পৌছেন। উমর ইবন খাত্তাব (রাঃ) তখন তাহার কুরবানীর পশুগুলির নাহর করিতেছিলেন। হাব্বার বলিলেনঃ আমীরুল মু'মিনীন! তারিখের ব্যাপারে আমাদের ভুল হইয়া গিয়াছে। আমরা ধারণা করিয়াছিলাম আজ আরাফাতের দিন। উমর ইবন খাত্তাব (রাঃ) বলিলেনঃ তুমি সঙ্গিগণসহ মক্কায় চলিয়া যাও এবং তাওয়াফ করিয়া নাও। কোন কুরবানীর পশু সঙ্গে থাকিলে উহার কুরবানী করিয়া ফেল। পরে মাথা কামাইয়া বা চুল ছাঁটাইয়া বাড়ি ফিরিয়া যাও। আগামী বৎসর পুনরায় হজ্জ করিবে এবং কুরবানী দিবে। যাহার কুরবানী করার সামর্থ্য নাই সে তিনদিন হজ্জের সময় এবং বাড়ি ফিরিয়া সাতদিন রোযা রাখিবে। মালিক (রহঃ) বলেনঃ হজ্জে কিরানের ইহরাম বাঁধার পর যদি হজ্জ না পায়, তবে পরের বৎসরও হজ্জে কিরান করিবে এবং তাহকে দুইটি কুরবানী দিতে হইবে- একটি হজ্জে কিরানের আর একটি গত বৎসর হজ্জ না পাওয়ার।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 862
			}
		},
		{
			"hadithnumber": 863,
			"arabicnumber": 863,
			"text": "রেওয়ায়ত ১৫৮. আতা ইবন রাবাহ (রহঃ) হইতে বর্ণিত- আবদুল্লাহ ইবন আব্বাস (রাঃ)-এর নিকট এমন এক ব্যক্তি সম্বন্ধে জিজ্ঞাসা করা হইল, যে ব্যক্তি ইহরাম অবস্থায় মিনাতে তাওয়াফে ইফাযার পূর্বে স্ত্রী সহবাস করিয়াছে, তিনি তাহাকে একটি উট কুরবানী করিতে হুকুম দেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 863
			}
		},
		{
			"hadithnumber": 864,
			"arabicnumber": 864,
			"text": "রেওয়ায়ত ১৫৯. ইকরামা (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন আব্বাস (রাঃ) বলেনঃ তাওয়াফে ষিয়ারত করার পূর্বে কেউ যদি স্ত্রীসহবাস করে তবে তাহাকে উমরা এবং কুরবানী করিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 864
			}
		},
		{
			"hadithnumber": 865,
			"arabicnumber": 865,
			"text": "রেওয়ায়ত ১৬০. ইকরামা (রহঃ) আবদুল্লাহ ইবন আব্বাস (রাঃ) হইতে যেরূপ বর্ণনা করিয়াছেন মালিক (রহঃ) রবী'আ ইবন আবূ আবদুর রহমানকে এ সম্পর্কে অনুরূপ বলিতে শুনিয়াছেন। মালিক (রহঃ) বলেনঃ এই বিষয়ে যাহা শুনিয়াছি তন্মধ্যে ইহাই আমার পছন্দনীয়। ইয়াহইয়া (রহঃ) বলেন- মালিক (রহঃ)-কে জিজ্ঞাসা করা হইলঃ তাওয়াফে যিয়ারত ভুলিয়া গিয়া যদি বাড়ি ফিরিয়া আসে তবে সে কি করিবে? তিনি বলিলেনঃ স্ত্রীসম্ভোগ না করিয়া থাকিলে মক্কায় ফিরিয়া যাইবে এবং তাওয়াফে যিয়ারত আদায় করিবে। আর স্ত্রীসম্ভোগ করিয়া থাকিলে মক্কায় ফিরিয়া গিয়া তাওয়াফ আদায় করিবে এবং উমরা করিয়া একটি কুরবানী দিবে। মক্কা হইতে উট ক্রয় করিয়া কুরবানী দিলে হইবে না। সঙ্গে যদি কুরবানীর পশু আনিয়া না থাকে তবে মক্কা হইতে কুরবানীর পশু কিনিয়া ইহাসহ হারমের বাহিরে চলিয়া যাইবে এবং সেই স্থান হইতে উহাকে মক্কায় হাকাইয়া নিয়া আসিবে এবং সেখানে নাহর করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 865
			}
		},
		{
			"hadithnumber": 866,
			"arabicnumber": 866,
			"text": "রেওয়ায়ত ১৬১. জাফর ইবন মুহাম্মদ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন- আলী ইবন আবি তালিব (রাঃ) বলতেনঃ (مَا اسْتَيْسَرَ مِنَ الْهَدْى) অর্থাৎ, তবে সহজলভ্য কুরবানী করিও। (বাকারাঃ ১৯৬) এই কথার অর্থ হইল, অন্তত একটি বকর কুরবানী করা।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 866
			}
		},
		{
			"hadithnumber": 867,
			"arabicnumber": 867,
			"text": "রেওয়ায়ত ১৬২. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, আবদুল্লাহ ইবন আব্বাস (রাঃ) বলিয়াছেনঃ (مَا اسْتَيْسَرَ مِنَ الْهَدْى) এর অর্থ হইল, অন্তত একটি বকরী কুরবানী করা। মালিক (রহঃ) বলেনঃ এই বর্ণনাটি আমার নিকট খুবই প্রিয়। কেননা কুরআনুল করীমে আল্লাহ্ তা'আলা ইরশাদ করেনঃ হে মু’মিনগণ, তোমরা যখন ইহরাম অবস্থায় থাক তখন তোমরা কোন প্রাণী বধ করিও না। কেউ যদি কোনকিছু ইচ্ছাকৃতভাবে বধ করে তবে যে ধরনের পশু সে বধ করিয়াছে সেই ধরনের কোন পশু তাহাকে প্রতিদান (জরিমানা) দিতে হইবে। তোমাদের দুইজন ন্যায়নিষ্ঠ লোক ইহার ফয়সালা করিয়া দিবে। এই প্রতিদান বায়তুল্লাহতে প্রেরিত হাদয়ী হইবে অথবা কাফফারা হিসাবে হইবে যাহা মিসকীনদেরকে আহার করানো হইবে অথবা তাহাকে তৎপরিমাণ রোযা রাখিতে হইবে যাহাতে সে তাহার কৃতকর্মের শাস্তি ভোগ করিয়া নেয়। যাহা হউক, শিকারকৃত পশুর পরিবর্তে কোন সময়ে বকরীও ওয়াজিব হইতে পারে। উক্ত আয়াতে উহাকেও হাদয়ী বলিয়া উল্লেখ করা হইয়াছে। এই কথায় একজন কি করিয়া সন্দেহ করিতে পারে? কারণ যে পশু উট বা গরুর সমতুল্য নহে উহার প্রতিদানে (জরিমানা) একটি বকরীই ওয়াজিব হইতে পারে। একটি বকরীর সমতুল্যও যেখানে হইবে না সেখানে কাফফারা ওয়াজিব হইবে। সে রোযার মাধ্যমে উহা আদায় করুক বা মিসকীনদেরকে আহার করাইয়া তাহা আদায় করুক, উভয় অবস্থায় ইহা কাফফারা হিসাবেই গণ্য হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 867
			}
		},
		{
			"hadithnumber": 868,
			"arabicnumber": 868,
			"text": "রেওয়ায়ত ১৬৩. নাফি (রহঃ) বর্ণনা করেন- আবদুল্লাহ ইবন উমর (রাঃ) বলতেনঃ (مَا اسْتَيْسَرَ مِنَ الْهَدْى) আয়াতটির অর্থ হইল- অন্ততপক্ষে একটি বকরী বা গাভী কুরবানী করিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 868
			}
		},
		{
			"hadithnumber": 869,
			"arabicnumber": 869,
			"text": "রেওয়ায়ত ১৬৪. আবদুল্লাহ ইবন আবু বকর (রহঃ) বর্ণনা করেন, আমরাহ বিনত আবদুর রহমানের আযাদকৃত দাসী রুকাইয়া (রহঃ) খবর দিয়েছেন- তিনি একবার আমরাহ বিনত আবদুর রহমানের সঙ্গে মক্কা অভিমুখে রওয়ানা হন। তিনি বলেনঃ যিলহজ্জ মাসের অষ্টম তারিখে তিনি (আমরাহ) মক্কায় গিয়া উপনীত হন। আমি তাহার সঙ্গে সঙ্গেই ছিলাম। তিনি কা'বার তাওয়াফ ও সাফা-মারওয়ার সায়ী করিয়া মসজিদে গেলেন। আমাকে বললেনঃ তোমার নিকট কাঁচি আছে কি? আমি বলিলামঃ নাই। তিনি বলিলেনঃ তালাশ করিয়া একটি কাঁচি লইয়া আস। আমি তাহাই করিলাম। তিনি উহা দ্বারা তাঁছার চুলের কিছু অংশ কাটিলেন। পরে কুরবানীর দিন (ইয়াওমুননাহরে) তিনি একটি বকরী যবেহ করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 869
			}
		},
		{
			"hadithnumber": 870,
			"arabicnumber": 870,
			"text": "রেওয়ায়ত ১৬৫. সাদাকাহ ইবন ইয়াসার মক্কী (রহঃ) বর্ণনা করেন- ইয়ামনের অধিবাসী এক ব্যক্তি আবদুল্লাহ ইবন উমর (রাঃ) এর নিকট আসে। চুলগুলি তাহার জটপাকানো ছিল। সে বলিলঃ হে আবু আবদুর রহমান! আমি শুধু উমরার ইহরাম বাঁধিয়া আসিয়াছি। আবদুল্লাহ ইবন উমর (রাঃ) বলিলেনঃ তুমি যদি আমার সঙ্গে থাকিতে বা আমার নিকট পূর্বে জিজ্ঞাসা করিতে তবে তোমাকে আমি হজ্জে কিরান করার কথা বলিতাম। লোকটি বলিলঃ উহার সময় অতিবাহিত হইয়া গিয়াছে। আবদুল্লাহ্ ইবন উমর (রাঃ) বললেনঃ তোমার এই লম্বা চুলগুলি কাটিয়া ফেল এবং কুরবানী কর। ইরাকের অধিবাসী একজন মহিলা তখন বলিলঃ হে আবু আবদুর রহমান! এই লোকটির হাদয়ী (কুরবানী) কি হইবে? তিনি বলিলেনঃ উত্তম হাদয়ী সে দিবে। মহিলাটি পুনরায় বলিলঃ ইহা কি হইবে? আবদুল্লাহ্ ইবন উমর (রাঃ) বলিলেনঃ যবেহ করিবার জন্য বকরী ব্যতীত অন্য কিছু যদি না পায় বা দিতে অসমর্থ হয়, তবে আমার কাছে রোযা রাখা অপেক্ষা বকরী হাদয়ী দেওয়াই উত্তম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 870
			}
		},
		{
			"hadithnumber": 871,
			"arabicnumber": 871,
			"text": "রেওয়ায়ত ১৬৬. নাফি (রহঃ) বর্ণনা করেন, আবদুল্লাহ ইবন উমর (রাঃ) বলতেনঃ ইহরামরত স্ত্রীলোক তাহার চুলের গোছা না কাটা পর্যন্ত সে চুল আঁচড়াইবে না। সঙ্গে হাদয়ী থাকিলে উহা যবেহ না করা পর্যন্ত সে চুল কাটিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 871
			}
		},
		{
			"hadithnumber": 872,
			"arabicnumber": 872,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 872
			}
		},
		{
			"hadithnumber": 873,
			"arabicnumber": 873,
			"text": "রেওয়ায়ত ১৬৯. মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌছিয়াছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ আরাফাতের সারা ময়দানে অবস্থান করা যায়, তবে তোমরা বাতনে উরানায় অবস্থান করিও না। এমনিভাবে মুযদালিফার সারা ময়দানে অবস্থান করা যায় তবে তোমরা বাতনে মুহাসসিরে অবস্থান করিও না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 873
			}
		},
		{
			"hadithnumber": 874,
			"arabicnumber": 874,
			"text": "রেওয়ায়ত ১৭০. আবদুল্লাহ্ ইবন যুবায়র (রাঃ) বলেনঃ তোমরা বিশ্বাস কর ‘বাতনে উরানা’ ব্যতীত সমগ্র আরাফাতের ময়দানই অবস্থান করার স্থান, এমনভাবে বাতনে মুহাসসির ব্যতীত মুযদালিফার সারাটা ময়দানেই অবস্থান করা যায়। মালিক (রহঃ) বলেনঃ আল্লাহ্ তা'আলা ইরশাদ করিয়াছেনঃ (فَلَا رَفَثَ وَلَا فُسُوقَ وَلَا جِدَالَ فِي الْحَجِّ) অর্থাৎ, হজের সময়ে স্ত্রীসম্ভোগ অন্যায় আচরণ ও কলহ-বিবাদ বিধেয় নহে। (বাকারাঃ ১৯৭) রাফাস অর্থ হইল স্ত্রীসম্ভোগ। আল্লাহ্‌রই অধিক জ্ঞাত। আল্লাহ্ তা'আলা অন্যত্র ইরশাদ করেনঃ (أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَىٰ نِسَائِكُمْ) অর্থাৎ, সিয়ামের রাত্রে তোমাদের জন্য স্ত্রীসভোগ বৈধ করা হইয়াছে। (বাকারাঃ ১৮৭) মালিক (রহঃ) বলেনঃ ফুসুক অর্থ হইল, দেব-দেবীর নামে পশু উৎসর্গ করা, আল্লাহ্ই অধিক জ্ঞাত। আল্লাহ তা'আল ইরশাদ করেনঃ (أَوْ فِسْقًا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ) অথবা যাহা অবৈধ, আল্লাহ ছাড় অন্যের নামে উৎসর্গের কারণে। (আল-আন’আমঃ ১৪৫) মালিক (রহঃ) বলেনঃ হজ্জে জিদাল বা ঝগড়া-বিবাদ হইল, কুরাইশ গোত্রের লোকজন তৎকালে হজ্জের সময় মুযদালিফার কুযাহ্ নামক স্থানে অবস্থান করিত। আর অন্যরা আরাফাতে অবস্থান করিত। উভয় দল তখন পরস্পর ঝগড়ায় লিপ্ত হইত, একদল বলিত, আমরাই সত্যপথের অনুসারী; অপর দল বলিত, আমরাই কেবল সত্যপথের অনুসারী। আল্লাহ্ তা'আলা আয়াত নাযিল করিয়া ইরশাদ করিলেনঃ لِكُلِّ أُمَّةٍ جَعَلْنَا مَنسَكًا هُمْ نَاسِكُوهُ فَلَا يُنَازِعُنَّكَ فِي الْأَمْرِ وَادْعُ إِلَىٰ رَبِّكَ إِنَّكَ لَعَلَىٰ هُدًى مُّسْتَقِيمٍ অর্থাৎ, আমি প্রত্যেক সম্প্রদায়ের জন্য নির্ধারিত করিয়া দিয়াছি ইবাদত পদ্ধতি যাহা উহারা অনুসরণ করে সুতরাং উহারা যেন তোমার সহিত বিতর্ক না করে এই ব্যাপারে। তুমি উহাদিগকে তোমার প্রতিপালকের দিকে আহবান কর। তুমিতো সরল পথেই প্রতিষ্ঠিত। (সূরা হাজ্জঃ ৬৭) হজ্জের সময় ঝগড়-বিবাদ বলিতে এই কথাই বোঝানো হইয়াছে। আল্লাহ অধিক জ্ঞাত। আলিমগণের নিকটও আমি এই ব্যাখ্যা শুনিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 874
			}
		},
		{
			"hadithnumber": 875,
			"arabicnumber": 875,
			"text": "রেওয়ায়ত ১৭১. ইয়াহইয়া (রহঃ) বলেনঃ মালিক (রহঃ)-কে জিজ্ঞাসা করা হইলঃ অপবিত্র অবস্থায় কোন ব্যক্তি আরাফাত বা মুযদালিফায় অবস্থান বা প্রস্তর নিক্ষেপ বা সাফা-মারওয়ার সায়ী করিতে পারবে কি? তিনি বলিলেনঃ ঋতুমতী স্ত্রীলোক হজ্জের যে সমস্ত আহকাম-আরকান আদায় করিতে পারে তাহা ওযূবিহীন অবস্থায় তাহাকে আদায় করিতে হয়। তদ্রুপ ওযু ছাড়া পুরুষ ও স্ত্রীলোক এইগুলি করিতে পারে। ইহাতে দোষের কিছুই হয় না। তবে ওযুসহ ঐ সমস্ত বিষয় আদায় করা উত্তম। স্বেচ্ছায় ওযূবিহীন অবস্থায় এইসব কাজ করা ঠিক নহে। মালিক (রহঃ)-কে জিজ্ঞাসা করা হইলঃ কোন ব্যক্তি আরোহী হইলে আরাফাতে অবস্থানকালে সে আরোহী অবস্থায় থাকিবে কিনা। তিনি বলিলেনঃ আরোহী অবস্থায় ওয়াকুফ করিবে। তবে তাহার বা তাহার ভারবাহী পশুর কোন অসুবিধা থাকিলে আল্লাহ্ তা'আলা তাহা কবূল করিবেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 875
			}
		},
		{
			"hadithnumber": 876,
			"arabicnumber": 876,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 876
			}
		},
		{
			"hadithnumber": 877,
			"arabicnumber": 877,
			"text": "রেওয়ায়ত ১৭৪. আবদুল্লাহ ইবন উমর (রাঃ)-এর পুত্র সলিম (রহঃ) এবং উবায়দুল্লাহ (রহঃ) বর্ণনা করেন, তাহাদের পিতা আবদুল্লাহ ইবন উমর (রাঃ) শিশু ও মহিলাদেরকে প্রথম মুযদালিফা হইতে মিনায় পাঠাইয়া দিতেন, মিনায় ফজরের নামায আদায় করার পরপরই অন্যান্য লোক আসিবার পূর্বে যেন তাহারা প্রস্তর নিক্ষেপ করিয়া নিতে পারেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 877
			}
		},
		{
			"hadithnumber": 878,
			"arabicnumber": 878,
			"text": "রেওয়ায়ত ১৭৫. আতা ইবন রাবা' (রহঃ) হইতে বর্ণিত, আসমা বিনত আবি বকর (রাঃ)-এর আযাদ দাসী বর্ণনা করেনঃ অন্ধকার থাকিতেই আসমা বিনত আবি বকর (রাঃ)-এর সহিত আমরা মিনায় চলিয়া আসিলাম। আসমাকে তখন আমি বলিলামঃ অন্ধকার থাকিতেই যে মিনায় আমরা চলিয়া আসিলাম? তিনি বলিলেন, তোমাদের হইতে যিনি শ্ৰেষ্ঠ ছিলেন অর্থাৎ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহার আমলেও আমরা এই ধরনের আমল করিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 878
			}
		},
		{
			"hadithnumber": 879,
			"arabicnumber": 879,
			"text": "রেওয়ায়ত ১৭৬. মালিক (রহঃ) বলেনঃ আমার নিকট রেওয়ায়ত পৌছিয়াছে যে, তালহা ইবন উবায়দুল্লাহ (রহঃ) তাহার পরিবারের মহিলা ও শিশুদিগকে মুযদালিফা হইতে মিনায় আগেই পাঠাইয়া দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 879
			}
		},
		{
			"hadithnumber": 880,
			"arabicnumber": 880,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 880
			}
		},
		{
			"hadithnumber": 881,
			"arabicnumber": 881,
			"text": "রেওয়ায়ত ১৭৯. হিশাম ইবন উরওয়াহ্ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, তিনি বলিয়াছেনঃ উসামা ইবন যায়দ (রাঃ)-এর নিকট বসা ছিলাম। তাহাকে তখন জিজ্ঞাসা করা হইলঃ বিদায় হজ্জের সময় রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরাফাতের ময়দান হইতে প্রত্যাবর্তনের সময় কিরূপ গতিতে উট চালাইতেছিলেন? তিনি বলিলেনঃ দ্রুত চালাইয়া ফিরিতেছিলেন। একটু ফাঁক পাইলে তখন খুবই দ্রুতগতিতে চালাইতেন।মালিক (রহঃ) বলেনঃ হিশাম (রহঃ) বলিয়াছেন, ‘নস’ জাতীয় গতি ‘আনাক’ জাতীয় গতি হইতে দ্রুততর।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 881
			}
		},
		{
			"hadithnumber": 882,
			"arabicnumber": 882,
			"text": "রেওয়ায়ত ১৮০. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) বাতনে-মুহাসসির হইতে প্রস্তর নিক্ষেপ করার স্থান পর্যন্ত তাহার উটের গতি দ্রুত করিয়া দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 882
			}
		},
		{
			"hadithnumber": 883,
			"arabicnumber": 883,
			"text": "রেওয়ায়ত ১৮১. মালিক (রহঃ) বলেন, তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিনা সম্পর্কে বলিয়াছেনঃ মিনার সারাটা ময়দানই নাহর করার স্থান। আর উমরা সম্পর্কে বলিয়াছেনঃ ইহার জন্য মারওয়াহ্ উত্তম স্থান। মক্কার প্রতিটি পথ এবং গলিও নাহর করার স্থান।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 883
			}
		},
		{
			"hadithnumber": 884,
			"arabicnumber": 884,
			"text": "রেওয়ায়ত ১৮২. উম্মুল মুমিনীন আয়েশা (রাঃ) বলেন, তখন যিলকা'দ মাসের পাঁচ দিন অবশিষ্ট ছিল, যখন আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহিত রওয়ানা হইলাম। আমাদের এই ধারণাই ছিল যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হজ্জের উদ্দেশ্যেই যাইতেছেন। যখন আমরা মক্কার নিকটবর্তী হইলাম তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যাহাদের নিকট হাদয়ী ছিল না তাহাদিগকে তাওয়াফ ও সায়ী করিয়া ইহরাম খুলিয়া ফেলিতে বলেন। আয়েশা (রাঃ) বলেনঃ ইয়াওমুন্নাহরের দিন আমাদের কাছে গরুর গোশত আনা হইল। ইহা দেখিয়া বলিলামঃ ইহা কোথা হইতে আসিয়াছে? লোকেরা বলিলঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্ত্রীগণের তরফ হইতে কুরবানী দিয়াছেন। ইয়াহইয়া (রহঃ) বলেনঃ আমি কাসিম ইবন মুহাম্মদের নিকট উক্ত হাদীসটি বর্ণনা করিলে তিনি বলিলেনঃ আল্লাহর কসম, আমরাহ বিনত আবদুর রহমান এই হাদীসটি সম্পূর্ণরূপে বর্ণনা করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 884
			}
		},
		{
			"hadithnumber": 885,
			"arabicnumber": 885,
			"text": "রেওয়ায়ত ১৮৩. উম্মুল মুমিনীন হাফসা (রাঃ) হইতে বর্ণিত-তিনি বাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বললেনঃ অন্যরা তো উমরা করিয়া ইহরাম খুলিয়া ফেলিয়াছে, কিন্তু আপনি খুলিলেন না? তিনি বলিলেনঃ আমি আমার চুল জমাট করিয়া নিয়াছি আর হাদয়ীর গলায় হার লটকাইয়া দিয়াছি। সুতরাং ‘নাহর’ না করা পর্যন্ত আমি ইহরাম খুলিব না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 885
			}
		},
		{
			"hadithnumber": 886,
			"arabicnumber": 886,
			"text": "রেওয়ায়ত ১৮৪. আলী ইবন আবি তালিব (রাঃ) বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বীয় কুরবানীর কিছুসংখ্যক পশু নিজের হাতে নাহর করেন আর বাকিগুলি অন্যরা ‘নাহর’ করেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 886
			}
		},
		{
			"hadithnumber": 887,
			"arabicnumber": 887,
			"text": "রেওয়ায়ত ১৮৫. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ) বলিয়াছেনঃ হাদয়ীর কুরবানী করার মানত করিলে উহার গলায় একজোড়া জুতা লটকাইয়া দিবে এবং উহার কুঁজ যখমী করিয়া দিবে। পরে দশ তারিখে কা'বা শরীফের নিকট বা মিনা ময়দানে উহা নাহর করিবে। ইহা ছাড়া ‘নাহর’ করার আর কোন স্থান নাই। আর যদি কেউ উট বা গরু ইত্যাদি কুরবানী করার মানত করে, তবে সে যে স্থানে ইচ্ছা কুরবানী করিতে পারে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 887
			}
		},
		{
			"hadithnumber": 888,
			"arabicnumber": 888,
			"text": "রেওয়ায়ত ১৮৬. হিশাম ইবন উরওয়াহ্ (রহঃ) বর্ণনা করেন, তাহার পিতা উটগুলিকে দাঁড় করাইয়া ঐগুলির নাহর করিতেন। মালিক (রহঃ) বলেনঃ কুরবানী করার পূর্বে মাথা কামানো জায়েয নহে। দশ তারিখের সুবহে সাদিকের পূর্বে কুরবানী করাও জায়েয নহে। কুরবানী করা, কাপড় বদলান, শরীরের ময়লা সাফ করা, মাথা কামান ইত্যাদি বিষয় যিলহজ্জের দশ তারিখে করিতে হইবে। উহার পূর্বে এই সমস্ত করা জায়েয নহে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 888
			}
		},
		{
			"hadithnumber": 889,
			"arabicnumber": 889,
			"text": "রেওয়ায়ত ১৮৭. আবদুল্লাহ ইবন উমর (রাঃ) বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু'আ করিয়াছিলেনঃ হে আল্লাহ, মাথা মুণ্ডনকারীদের উপর আপনি রহম করুন। সাহাবীগণ আরয করিলেনঃ হে আল্লাহর রাসূল! চুল যাহারা ছাটিবে তাহাদের জন্যও আল্লাহ্‌র রহমতের দু'আ করুন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ হে আল্লাহ্! মাথা মুণ্ডনকারীদের রহম করুন। সাহাবীগণ আরয করিলেনঃ হে আল্লাহর রাসূল! চুল যাহারা ছাঁটিবে তাহদের জন্য আল্লাহর রহমতের দুআ করুন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ হে আল্লাহ্! চুল যাহারা ছাটিবে তাহদের প্রতিও রহমত করুন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 889
			}
		},
		{
			"hadithnumber": 890,
			"arabicnumber": 890,
			"text": "রেওয়ায়ত ১৮৮. আবদুর রহমান ইবন কাসিম (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, তিনি (কাসিম ইবন মুহাম্মদ) উমরার ইহরাম বাধিয়া রাত্রে মক্কায় আসিতেন, তাওয়াফ ও সায়ী করার পর ভোর পর্যন্ত মাথা মুণ্ডন করার জন্য অপেক্ষা করিতেন। মাথা না কামানো পর্যন্ত বায়তুল্লাহর তাওয়াফ করিতেন না। নিকটবর্তী মসজিদে আসিয়া কখনও কখনও বিতরের নামায আদায় করিতেন বটে তবে বায়তুল্লাহর নিকটবর্তী হইতেন না। মালিক (রহঃ) বলেনঃ ‘তাফাস' অর্থ হইল, হজ্জের পর মাথা কামানো এবং কাপড়-চোপড় বদলান ইত্যাদি। মালিক (রহঃ)-কে জিজ্ঞাসা করা হয়ঃ হজ্জের সময় একজন মাথা কামাইতে ভুলিয়া গেলে সে কি মক্কায় আসিয়া মাথা মুণ্ডন করিতে পারিবে? তিনি বলিলেনঃ হ্যাঁ, পারবে। তবে মিনাতে অবস্থানকালে উহা করা ভাল। মালিক (রহঃ) বলেনঃ আমাদের নিকট সর্বসম্মত বিষয় এই—যতক্ষণ পর্যন্ত হাদয়ী যবেহ করে নাই ততক্ষণ কেউ মাথা মুণ্ডন করিবে না বা চুল ছাঁটিবে না। আর যতক্ষণ মিনায় পৌছিয়া যিলহজ্জ মাসের দশ তারিখে ইহরাম না খুলিবে, ততক্ষণ তাহার হারাম বিষয়সমূহ হালাল হইবে না। কারণ আল্লাহ্ তা'আলা ইরশাদ করিয়াছেনঃ কুরবানী যতক্ষণ তাহার নিজ স্থলে না পৌছাইবে ততক্ষণ তোমরা মাথা মুণ্ডন করিও না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 890
			}
		},
		{
			"hadithnumber": 891,
			"arabicnumber": 891,
			"text": "রেওয়ায়ত ১৮৯. নাফি' (রহঃ) হইতে বর্ণিত- আবদুল্লাহ ইবন উমর (রাঃ) যখন রমযানের রোযা সমাপ্ত করিতেন আর ঐ বৎসর হজ্জ করার ইচ্ছা করিতেন তখন হজ্জ সমাধা না করা পর্যন্ত মাথার চুল কাটিতেন না ও দাড়ি ছাঁটিতেন না। মালিক (রহঃ) বলেনঃ এ বিষয়টি ওয়াজিব নহে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 891
			}
		},
		{
			"hadithnumber": 892,
			"arabicnumber": 892,
			"text": "রেওয়ায়ত ১৯০. নাফি (রহঃ) হইতে বর্ণিত- আবদুল্লাহ্ ইবন উমর (রাঃ) হজ্জ ও উমরার পরে যখন মাথা মুণ্ডন করিতেন তখন দাঁড়ি ও গোফ ছাঁটিয়া নিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 892
			}
		},
		{
			"hadithnumber": 893,
			"arabicnumber": 893,
			"text": "রেওয়ায়ত ১৯১. রবী'আ ইবন আবু আবদুর রহমান (রহঃ) হইতে বর্ণিত, এক ব্যক্তি কাসিম ইবন মুহাম্মদ (রহঃ)-এর নিকট আসিয়া বলিলঃ আমি ও আমার স্ত্রী তাওয়াফে যিয়ারত সমাধা করার পর সহবাস করার ইচ্ছায় আমার স্ত্রীকে এক নির্জন স্থানে লইয়া গেলাম। আমার স্ত্রী তখন বলিলঃ হজ্জের পর আমি এখনও আমার চুল ছাঁটাই নাই। আমি তখন দাঁত দিয়া তাহার চুল কাটিয়া তাহার সহিত মিলিত হই। এখন কি করিব? কাসিম (রহঃ) হাসিয়া বলিলেনঃ যাও, স্ত্রীকে কাচির সাহায্যে চুল ছাঁটিয়া নিতে বল।। মালিক (রহঃ) বলেন, এই অবস্থায় স্বামী যদি একটি কুরবানী দেয় তবে উহা ভাল। কেননা আবদুল্লাহ ইবন আব্বাস (রাঃ) বলিয়াছেনঃ যে কেউ কোন আমল বা রুকন ভুলিয়া বসিলে সে ইহার পরিবর্তে একটি কুরবানী দিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 893
			}
		},
		{
			"hadithnumber": 894,
			"arabicnumber": 894,
			"text": "রেওয়ায়ত ১৯২. নাফি’ (রহঃ) হইতে বর্ণিত, মুজাব্বার নামক কোন এক নিকট-আত্মীয়ের সঙ্গে আবদুল্লাহ ইবন উমর (রাঃ)-এর সাক্ষাৎ হয়। সে তাওয়াফে যিয়ারত করিয়া গিয়াছিল বটে তবে অজ্ঞতার দরুন মাথার চুল ছাঁটায় নাই বা কামায় নাই। তাহাকে তখন আবদুল্লাহ্ ইবন উমর (রাঃ) পুনরায় মক্কায় গিয়া চুল কামাইতে বা ছাটাইতে এবং পুনরায় তাওয়াফে যিয়ারত করিতে নির্দেশ দেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 894
			}
		},
		{
			"hadithnumber": 895,
			"arabicnumber": 895,
			"text": "রেওয়ায়ত ১৯৩. মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌছিয়াছে- সালিম ইবন আবদুল্লাহ যখন ইহরাম বাঁধিতে ইচ্ছা করিতেন তখন উটে আরোহণ এবং ইহরাম বাঁধিয়া তালবিয়া পাঠ করার পূর্বেই কাঁচি আনাইয়া মোচ এবং দাড়ি ছাঁটিয়া নিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 895
			}
		},
		{
			"hadithnumber": 896,
			"arabicnumber": 896,
			"text": "রেওয়ায়ত ১৯৪. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) বলিয়াছেনঃ (ইহরাম বাঁধার সময়) যে ব্যক্তি মাথার চুল জমাট করিয়া লইবে সে (ইহরাম খোলার সময়) যেন উহা কামাইয়া ফেলে। ‘তালবীদ' (আঠাল কোন পদার্থ দ্বারা মাথার চুল জমাট করা) সদৃশ যেন কেউ চুল জমাট না করে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 896
			}
		},
		{
			"hadithnumber": 897,
			"arabicnumber": 897,
			"text": "রেওয়ায়ত ১৯৫. সাঈদ ইবন মুসায়্যাব (রহঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) বলিয়াছেনঃ (ইহরাম বাঁধার সময়) যে চুল খোপা বানাইয়া নেয় বা বেণী গাঁথিয়া নেয় বা আঠালো কিছু দ্বারা জমাইয়া নেয় তাহার জন্য (ইহরাম খোলার সময়) মুণ্ডন করা ওয়াজিব।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 897
			}
		},
		{
			"hadithnumber": 898,
			"arabicnumber": 898,
			"text": "রেওয়ায়ত ১৯৬. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, উসামা ইবন যায়দ (রাঃ) বিলাল ইবন রাবাহ (রাঃ) এবং উসমান ইবন তালহা হাযাবী (রাঃ)-কে লইয়া রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কা'বার অভ্যন্তরে প্রবেশ করেন এবং দরওয়াজা বন্ধ করিয়া দেন। আবদুল্লাহ ইবন উমর (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখানে কিছুক্ষণ রহিয়া গেলেন। আবদুল্লাহ্ বলেনঃ বিলাল যখন বাহির হইয়া আসিলেন তখন তাহাকে আমি জিজ্ঞাসা করিলামঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখানে কি করিয়াছেন? তিনি বলিলেনঃ একটি স্তম্ভ ডাইনে এবং তিনটি স্তম্ভ পিছনে রাখিয়া তিনি সেখানে নামায পড়িয়াছেন। তখনকার সময়ে কা'বার ভিতর মোট ছয়টি স্তম্ভ ছিল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 898
			}
		},
		{
			"hadithnumber": 899,
			"arabicnumber": 899,
			"text": "রেওয়ায়ত ১৯৭. সালিম ইবন আবদুল্লাহ (রহঃ) বর্ণনা করেন, আবদুল মালিক ইবন মারওয়ান তদীয় গভর্নর হাজ্জাজ ইবন ইউসুফকে নির্দেশ দিয়া লিখিয়াছিলেনঃ হজ্জে আবদুল্লাহ্ ইবন উমর (রাঃ)-এর কোন কাজে বিরোধিতা করিবে না। সালিম (রহঃ) বলেনঃ আরাফাতের দিন সূর্য পশ্চিম দিকে হেলিয়া পড়ামাত্রই আবদুল্লাহ ইবন উমর (রাঃ) হাজ্জাজ ইবন ইউসুফের তাবুতে আসেন। আমিও তাহার সহিত ছিলাম। তিনি বলিলেনঃ হাজ্জাজ কোথায়? হাজ্জাজ তখন কুসুম রঙের চাদর শরীরে জড়াইয়া বাহির হইয়া আসিয়া বলিলেনঃ হে আবু আবদুর রহমান, ব্যাপার কি? ইবন উমর (রাঃ) বলিলেনঃ পবিত্র সুন্নতের অনুসরণ করিয়া যদি চলার ইচ্ছা থাকে তবে জলদি চল। হাজ্জাজ বলিলেনঃ এখনই। তিনি বলিলেনঃ হ্যাঁ, এখনই। হাজ্জাজ বলিলেনঃ একটু সময় দিন, গোসল করিয়া লই। আবদুল্লাহ ইবন উমর (রাঃ) তখন সওয়ারী হইতে নামিয়া আসিলেন। কিছুক্ষণ পরেই হাজ্জাজও আসিলেন এবং আমার ও আমার পিতার (ইবন উমর) মাঝখানে আসিয়া দাঁড়াইলেন। আমি তখন তাহাকে বলিলামঃ পবিত্র সুন্নতের অনুসরণ করিয়া চলার ইচ্ছা থাকিলে আজ খুতবাটা একটু হালকা করিয়া পড়িও এবং নামায বেশি বিলম্ব করিও না, জলদি করিয়া পড়িয়া নিও। এই কথা শুনিয়া হাজ্জাজ আবদুল্লাহ ইবন উমর (রাঃ)-এর মুখ হইতে উহা শোনার জন্য তাহার দিকে তাকাইল। তিনি তখন বলিলেনঃ হ্যাঁ, সালিম সত্য কথাই বলিয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 899
			}
		},
		{
			"hadithnumber": 900,
			"arabicnumber": 900,
			"text": "রেওয়ায়ত ১৯৮. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ) যুহর, আসর, মাগরিব, ইশা এবং ফজরের নামায মিনা ময়দানে পড়িতেন এবং সকালে সূর্যোদয়ের পর আরাফাতের দিকে যাত্রা করিতেন। মালিক (রহঃ) বলেনঃ আমাদের নিকট সর্বসম্মত সিদ্ধান্ত হইল, আরাফাত দিবসে ইমাম যুহরের নামাযে কিরাআত জোরে পড়িবেন না। হ্যাঁ, আরাফাতের দিন ইমাম খুতবা দিবেন। মূলত আরাফাতের নামায যুহরেরই নামায। তবে সফরের কারণে উহা কসর বা সংক্ষিপ্ত করিয়া দেওয়া হইয়াছে। মালিক (রহঃ) বলেনঃ ইয়াওমে-আরাফা বা ইয়াওমুন্নাহার বা আইয়্যামে তাশরীকের দিন যদি জুম'আর দিন হয় তবে ঐ সমস্ত দিনে ইমামুল-হজ্জ জুম'আর নামায পড়াইবেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 900
			}
		},
		{
			"hadithnumber": 901,
			"arabicnumber": 901,
			"text": "রেওয়ায়ত ১৯৯. আবদুল্লাহ্ ইবন উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুযদালিফায় মাগরিব ও ইশার নামায একত্রে আদায় করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 901
			}
		},
		{
			"hadithnumber": 902,
			"arabicnumber": 902,
			"text": "রেওয়ায়ত ২০০. উসামা ইবন যায়দ (রাঃ) বর্ণনা করেন, আরাফাত হইতে প্রত্যাবর্তনের সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গিরিবর্তে পৌছিয়া প্রস্রাব করার জন্য নামিলেন এবং পরে ওযু করিলেন, কিন্তু পূর্ণভাবে করিলেন না। আমি তাহাকে বলিলামঃ হে আল্লাহর রাসূল, নামাযের কি হইবে? তিনি বলিলেনঃ আরও আগাইয়া আমরা নামায পড়িব। তিনি মুযদালিফায় পৌছিয়া পূর্ণভাবে ওযু করিলেন। তখন নামাযের তকবীর হইল। তিনি মাগরিবের নামায আদায় করিলেন। প্রত্যেকেই স্ব স্ব উট স্ব স্ব স্থানে বাঁধিয়া রাখিলেন। অতঃপর আবার ইশার নামাযের তকবীর হইল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার নামায আদায় করিলেন। তখন এই উভয় নামাযের মধ্যে আর কোন (নফল) নামায তিনি পড়েন নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 902
			}
		},
		{
			"hadithnumber": 903,
			"arabicnumber": 903,
			"text": "রেওয়ায়ত ২০১. আবু আইয়ুব আনসারী (রাঃ) বর্ণনা করেনঃ তিনি বিদায় হজ্জের সময় রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহিত মুযদালিফায় মাগরিব ও ইশা একত্রে আদায় করিয়াছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 903
			}
		},
		{
			"hadithnumber": 904,
			"arabicnumber": 904,
			"text": "রেওয়ায়ত ২০২. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ) মুযদালিফায় মাগরিব ও ইশার নামায একত্রে আদায় করিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 904
			}
		},
		{
			"hadithnumber": 905,
			"arabicnumber": 905,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 905
			}
		},
		{
			"hadithnumber": 906,
			"arabicnumber": 906,
			"text": "রেওয়ায়ত ২০৫. সাঈদ ইবন মুসায়্যাব (রহঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) যখন মক্কায় আসেন তখন দুই রাকাআত নামায আদায় করিলেন। অতঃপর বলিলেনঃ হে মক্কাবাসিগণ, তোমরা স্ব স্ব নামায পূর্ণ করিয়া নাও। কারণ আমরা মুসাফির (তাই আমাদিগকে কসর পড়িতে হইয়াছে)। পরে তিনি মিনায় গিয়া দুই রাকাআতই আদায় করিলেন। তবে সেখানেও তিনি নামাযের পর কিছু বলিয়াছিলেন বলিয়া আমরা সংবাদ পাই নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 906
			}
		},
		{
			"hadithnumber": 907,
			"arabicnumber": 907,
			"text": "রেওয়ায়ত ২০৬. যায়দ ইবন আসলাম (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, মক্কায় উমর ইবন খাত্তাব (রাঃ) দুই রাকাআত নামায পড়াইয়া বলিয়াছিলেনঃ হে মক্কাবাসিগণ! আমরা মুসাফির! তোমরা তোমাদের নামায পূর্ণ করিয়া নাও। পরে মিনায়ও তিনি দুই রাকাআত নামায পড়েন। কিন্তু সেখানেও কিছু বলিয়াছিলেন বলিয়া আমরা সংবাদ পাই নাই। মালিক (রহঃ)-কে জিজ্ঞাসা করা হইয়াছিলঃ মক্কাবাসিগণ আরাফাতের ময়দানে চার রাকাআত পড়িবে, না দুই রাকাআত পড়িবে? অনুরূপভাবে আমীরে-হজ্জ যদি মক্কাবাসী হন তবে তিনি এই ব্যাপারে কি করিবেন? মক্কাবাসিগণ মিনায় থাকাকালে কসর (দুই রাক’আত) পড়িবে কিনা ? উত্তরে তিনি বলিলেনঃ মক্কাবাসিগণ যতক্ষণ মিনা ও আরাফাতে অবস্থান করিবে মক্কায় প্রত্যাবর্তন না করা পর্যন্ত কসরই পড়িবে। আমীরে-হজ্জও যদি মক্কাবাসী হন তিনিও কসর পড়িবেন। মালিক (রহঃ) বলেনঃ মিনা এবং আরাফাতের বাসিন্দাগণ কসর পড়িবেন না, পূর্ণ নামায পড়িবেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 907
			}
		},
		{
			"hadithnumber": 908,
			"arabicnumber": 908,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 908
			}
		},
		{
			"hadithnumber": 909,
			"arabicnumber": 909,
			"text": "রেওয়ায়ত ২০৯. আবদুল্লাহ্ ইবন উমর (রাঃ) বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুল-হুলায়ফা ময়দানের প্রস্তুরাকীর্ণ স্থানে স্বীয় উট বসাইয়া নামায পড়িয়ছিলেন। নাফি’ (রহঃ) বলেনঃ আবদুল্লাহ ইবন উমর (রাঃ) তদ্রুপ করিতেন।মালিক (রহঃ) বলেনঃ হজ্জ সমাধা করিয়া মদীনা ফেরার পথে ‘মাআররাস’ নামক স্থানে প্রত্যেকে যেন নামায পড়ে। আর নামাযের ওয়াক্ত না হইলে ওয়াক্ত হওয়া পর্যন্ত যেন অপেক্ষা করে এবং যত রাকাআত পড়া সহজ তাহা যেন পড়িয়া নেয়। কারণ আমার নিকট রেওয়ায়ত পৌছিয়াছে- রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখানে শেষরাতে অবস্থান করিয়াছিলেন। আবদুল্লাহ ইবন উমর (রাঃ)-ও সেখানে স্বীয় উট বসাইতেন এবং অবস্থান করিতেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 909
			}
		},
		{
			"hadithnumber": 910,
			"arabicnumber": 910,
			"text": "রেওয়ায়ত ২১০. নাফি' (রহঃ) বর্ণনা করেন, আবদুল্লাহ ইবন উমর (রাঃ) যুহর, আসর, মাগরিব এবং ইশার নামায মুহাসসাব নামক স্থানে পড়িতেন। অতঃপর রাত্রে মক্কায় গিয়া বায়তুল্লাহর তাওয়াফ করিতেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 910
			}
		},
		{
			"hadithnumber": 911,
			"arabicnumber": 911,
			"text": "রেওয়ায়ত ২১১. মালিক (রহঃ) নাফি' (রহঃ) হইতে বর্ণনা করেন, তিনি বলিয়াছেনঃ লোকেরা আমার নিকট বলিয়াছেনঃ উমর ইবন খাত্তাব (রাঃ) জামরা-এ-আকাবা বা প্রস্তর নিক্ষেপের স্থানের পশ্চাৎ হইতেই লোকদিগকে মিনার দিকে ফিরাইয়া দেওয়ার জন্য কিছুসংখ্যক লোক নিযুক্ত করিয়া রাখিতেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 911
			}
		},
		{
			"hadithnumber": 912,
			"arabicnumber": 912,
			"text": "রেওয়ায়ত ২১২. আবদুল্লাহ ইবন উমর (রাঃ) বর্ণনা করেন- উমর ইবন খাত্তাব (রাঃ) বলিয়াছেনঃ মিনার রাত্রিসমূহে কেউ যেন জামরা-এ-আকাবার পিছনে অবস্থান না করে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 912
			}
		},
		{
			"hadithnumber": 913,
			"arabicnumber": 913,
			"text": "রেওয়ায়ত ২১৩. হিশাম ইবন উরওয়াহ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, তিনি বলিয়াছেনঃ মিনায় অবস্থানের রাত্রিসমূহে কেউ যেন মিনা ব্যতীত অন্যত্র রাত্রি যাপন না করে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 913
			}
		},
		{
			"hadithnumber": 914,
			"arabicnumber": 914,
			"text": "রেওয়ায়ত ২১৪. মালিক (রহঃ) জ্ঞাত হইয়াছেন, জামরা-ই-উলার (প্রথম কঙ্কর নিক্ষেপের স্থান) ও জামরা-ই-বুসতার (মধ্যবর্তী কঙ্কর নিক্ষেপের স্থান) নিকট উমর (রাঃ) (দু'আর জন্য) এতক্ষণ দাঁড়াইয়া থাকিতেন যে, দণ্ডায়মান অন্য লোকজন বিরক্ত হইয়া যাইত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 914
			}
		},
		{
			"hadithnumber": 915,
			"arabicnumber": 915,
			"text": "রেওয়ায়ত ২১৫. নাফি' (রহঃ) বর্ণনা করেন, আবদুল্লাহ্ ইবন উমর (রাঃ) দীর্ঘক্ষণ জামরা-ই-উলা এবং জামরা-ই-বুসতার নিকট দাঁড়াইয়া থাকিতেন। তাকবীর-এ-তাশরীক ও হামদ পড়িতেন এবং দু'আ করিতে থাকিতেন। জামরা-ই-আকাবা শেষ কঙ্কর নিক্ষেপের নিকট তিনি দাঁড়াইতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 915
			}
		},
		{
			"hadithnumber": 916,
			"arabicnumber": 916,
			"text": "রেওয়ায়ত ২১৬. নাফি' (রহঃ) বর্ণনা করেন, আবদুল্লাহ ইবন উমর (রাঃ) প্রতিটি কঙ্কর নিক্ষেপের সময় ‘আল্লাহু আকবার’ বলিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 916
			}
		},
		{
			"hadithnumber": 917,
			"arabicnumber": 917,
			"text": "রেওয়ায়ত ২১৭. মালিক (রহঃ) বলেনঃ কোন কোন আহলে-ইলমের নিকট তিনি শুনিয়াছেন যে, কঙ্কর এত ছোট হওয়া উচিত যাহাতে দুই আঙুল দ্বারা নিক্ষেপ করা যায়। মালিক (রহঃ) বলেন, আমার মতে উহা হইতে কঙ্কর সামান্য বড় হওয়া উচিত। নাফি (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) বলেনঃ ১২ তারিখের সূর্যস্ত পর্যন্ত যে ব্যক্তি মিনায় অবস্থান করিবে ১৩ তারিখে কঙ্কর নিক্ষেপ না করা পর্যন্ত সে যেন ফিরিয়া না যায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 917
			}
		},
		{
			"hadithnumber": 918,
			"arabicnumber": 918,
			"text": "রেওয়ায়ত ২১৮. আবদুর রহমান ইবন কাসিম (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, কঙ্কর নিক্ষেপের জন্য সাধারণত পায়ে হাটিয়া লোকজন আসা-যাওয়া করিত। সর্বপ্রথম মুআবিয়া ইবন আবু সুফিয়ান (রাঃ) আরোহী অবস্থায় নিক্ষেপ করেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 918
			}
		},
		{
			"hadithnumber": 919,
			"arabicnumber": 919,
			"text": "রেওয়ায়ত ২১৯. আবদুর রহমান ইবন কাসিম (রহঃ)-এর নিকট মালিক (রহঃ) জিজ্ঞাসা করিয়াদিলেনঃ কাসিম ইবন মুহাম্মদ (রহঃ) কোথা হইতে জামরা-ই-আকাবার কঙ্কর নিক্ষেপ করিতেন। তিনি বলিলেনঃ যে স্থান হইতে সুবিধা এবং সহজ হইত সেই স্থান হইতেই তিনি উক্ত সময় কঙ্কর নিক্ষেপ করিতেন। মালিক (রহঃ)-কে জিজ্ঞাসা করা হইয়াছিলঃ অসুস্থ ও শিশুদের তরফ হইতে কঙ্কর নিক্ষেপ করা যায় কিনা? উত্তরে তিনি বলিলেনঃ হ্যাঁ, ইহা জায়েয। তবে অসুস্থ ব্যক্তি কঙ্কর নিক্ষেপের সময় অনুমান করিয়া স্বীয় স্থানে থাকিয়াই ‘আল্লাহু আকবার’ বলিবে এবং একটি কুরবানী করিবে। আইয়্যামে তাশরীকের মধ্যে যদি সুস্থ হইয়া পড়ে তবে নিজে কঙ্কর নিক্ষেপ করিবে এবং একটি কুরবানী দিবে। মালিক (রহঃ) বলেনঃ ওযু ব্যতীত কঙ্কর নিক্ষেপ করিলে বা সায়ী করিলে উহা পুনরায় আদায় করিতে হইবে না বটে কিন্তু জানিয়া-শুনিয়া এইরূপ করা উচিত নহে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 919
			}
		},
		{
			"hadithnumber": 920,
			"arabicnumber": 920,
			"text": "রেওয়ায়ত ২২০. নাফি (রহঃ) বর্ণনা করেন, আবদুল্লাহ ইবন উমর (রাঃ) বলিতেনঃ তিন দিনের প্রত্যেক দিনই সূর্য হেলিয়া পড়ার পর কঙ্কর নিক্ষেপ করা উচিত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 920
			}
		},
		{
			"hadithnumber": 921,
			"arabicnumber": 921,
			"text": "রেওয়ায়ত ২২১. আবুল বাদ্‌দা ইবন আসিম ইবন আদী (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উটের রাখালগণকে মিনা ব্যতীত অন্য স্থানেও রাত্রি যাপন করার অনুমতি প্রদান করিয়াছিলেন। দশ তারিখ এবং উহার পরদিন ও উহার পরবর্তী দিন (১১ ও ১২ তারিখ) সে রমিয়ে জমর (কঙ্কর নিক্ষেপ) করিবে। চতুর্থ দিন অর্থাৎ ১৩ তারিখও যদি সে সেখানে অবস্থান করে তবে কঙ্কর নিক্ষেপ করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 921
			}
		},
		{
			"hadithnumber": 922,
			"arabicnumber": 922,
			"text": "রেওয়ায়ত ২২২. ইয়াহইয়া ইবন সাঈদ (রহঃ) আতা ইবন আবি রাবাহ (রহঃ)-কে উল্লেখ করিতে শুনিয়াছেন- উটের রাখালদিগকে কঙ্কর নিক্ষেপের অনুমতি দেওয়া হইয়াছে। আতা ইবন রাবাহ বলেনঃ এই অনুমতি প্রথম যুগ হইতে প্রচলিত ছিল। মালিক (রহঃ) বলেনঃ আবুল বাদ ইবন আসিম ইবন আলী বর্ণিত উপরিউক্ত হাদীসটির মর্মার্থ হইল, সে দশ তারিখে রমী করার পর এগার তারিখ অতিবাহিত হইয়া গেলে বার তারিখে আসিয়া এগার এবং বার উভয় তারিখের রমী করবে। কারণ ওয়াজিব হওয়ার পূর্বে কোন বস্তুর কাযা হয় না; যখন তাহার উপর ওয়াজিব হইল এবং সেইদিন অতিবাহিত হইল তখন সেইদিনের রমী কাযা করিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 922
			}
		},
		{
			"hadithnumber": 923,
			"arabicnumber": 923,
			"text": "রেওয়ায়ত ২২৩. আবু বকর ইবন নাফি' (রহঃ) তাহার পিতা হইতে বর্ণনা করেন- সফিয়া বিনত আবি উবায়দের ভ্রাতৃকন্যার মুযদালিফায় নিফাস শুরু হয়। শেষে তিনি এবং তাহার ভ্রাতৃকন্যা সেখানেই থাকিয়া যান। দশ তারিখ যখন তাহারা মিনায় পৌছিলেন তখন সূর্য উঠিয়া গিয়াছিল। মিনায় পৌছার পর আবদুল্লাহ ইবন উমর (রাঃ) উভয়কে কঙ্কর নিক্ষেপের নির্দেশ দিলেন। তবে তাহাদের উপর কোন বদলার হুকুম দেন নাই। মালিক (রহঃ)-কে জিজ্ঞাসা করা হইয়াছিলঃ কেউ যদি মিনার দিবসগুলির কোন তারিখের রমী করিতে তুলিয়া যায় আর এইদিকে সূর্যও অস্তমিত হইয়া যায় তবে সে কি করিবে? তিনি বলিলেনঃ রাতে বা দিনে যখনই স্মরণ হইবে রমী করিয়া নিবে। নামাযের কথা ভুলিয়া গেলে যেমন রাত্রে বা দিনে যখনই স্মরণ হয় তখনই পড়িয়া নিতে হয়, এখানেও তাহাই করিবে। তবে মিনা হইতে চলিয়া যাওয়ার পর যদি স্মরণ হয় তবে তাহার উপর কুরবানী দেওয়া ওয়াজিব হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 923
			}
		},
		{
			"hadithnumber": 924,
			"arabicnumber": 924,
			"text": "রেওয়ায়ত ২২৪. আবদুল্লাহ্ ইবন উমর (রাঃ) বর্ণনা করেন, উমর ইবন খাত্তাব (রাঃ) আরাফাতের ময়দানে সমবেত লোকদের উদ্দেশ্যে ভাষণ দেন। হজ্জের আরকান ও আহকাম সম্পর্কে তাহাদিগকে শিক্ষা দেন। অন্যান্য কথার মধ্যে তিনি ইহাও বলেন যে, মিনা আগমন এবং কঙ্কর নিক্ষেপের পর স্ত্রীসহবাস এবং সুগন্ধি দ্রব্য ব্যতীত তোমাদের জন্য সবকিছুই হালাল হইয়া যাইবে। বায়তুল্লাহ্ তাওয়াফ (তাওয়াফে যিয়ারত বা ইফাযা) না করা পর্যন্ত তোমাদের কেউ যেন সুগন্ধি দ্রব্য ও স্ত্রী স্পর্শ না করে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 924
			}
		},
		{
			"hadithnumber": 925,
			"arabicnumber": 925,
			"text": "রেওয়ায়ত ২২৫. আবদুল্লাহ ইবন উমর (রাঃ) বর্ণনা করেন- উমর ইবন খাত্তাব (রাঃ) বলিয়াছেনঃ যে ব্যক্তি কঙ্কর নিক্ষেপ, মাথা কামান বা ছাটান এবং কুরবানী ওয়াজিব থাকিলে উহা আদায় করিয়াছেন, তাহার জন্য সুগন্ধি দ্রব্য এবং স্ত্রীসম্ভোগ ব্যতীত আর সকল কিছুই হালাল হইয়া গিয়াছে। বায়তুল্লাহর তাওয়াফের পর তাহার জন্য এ দুইটিও হালাল হইয়া যাইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 925
			}
		},
		{
			"hadithnumber": 926,
			"arabicnumber": 926,
			"text": "রেওয়ায়ত ২২৬. উম্মুল মুমিনীন আয়েশা (রাঃ) বলেনঃ বিদায় হজ্জের সময় আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহিত যাত্রা করি। আমরা উমরার ইহরাম বাধিয়াছিলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ কুরবানীর পশু যাহার আছে সে যেন হজ্জ ও উমরা উভয়টিরই ইহরাম বাঁধিয়া নেয় এবং কাজ সমাধা না করা পর্যন্ত যেন ইহরাম না খোলে। আয়েশা (রাঃ) বলেনঃ মক্কায় যখন প্রবেশ করি তখন আমি ঋতুমতী হইয়া পড়ি। ফলে আমি তাওয়াফ এবং সায়ী করিতে পারলাম না। এ সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আরয করলে তিনি বলিলেন, বিনুনি খুলিয়া আঁচড়াইয়া নাও আর উমরা পরিত্যাগ করিয়া হজ্জের ইহরাম বাঁধিয়া নাও। আমি তাহাই করিলাম। আমার হজ্জ আদায়ের পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবদুর রহমান ইবন আবু বকর (রাঃ)-এর সহিত আমাকে তানয়ীম প্রেরণ করেন। তখন সেই স্থান হইতে আমি উমরা আদায় করি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ পূর্বে পরিত্যক্ত উমরার বদল হইল তোমার এই উমরা। যাহারা কেবল উমরার ইহরাম বাঁধিয়াছিল তাহারা তাওয়াফ ও সায়ী করার পর হালাল হইয়া যায় এবং মিনা হইতে ফিরিয়া আসিয়া তাহারা হজ্জের জন্য দ্বিতীয় তাওয়াফ আদায় করবে। আর যাহারা কেবল হজ্জের বা হজ্জ ও উমরা উভয়ের ইহরাম বাঁধিয়াছিল তাহারা শুধু একবারই তাওয়াফ আদায় করিবে। উরওয়াহ ইবন যুবায়র (রহঃ) আয়েশা (রাঃ) হইতে অনুরূপ রেওয়ায়ত করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 926
			}
		},
		{
			"hadithnumber": 928,
			"arabicnumber": 928,
			"text": "রেওয়ায়ত ২২৭. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলেনঃ ঋতুমতী অবস্থায় আমি মক্কায় আসিয়াছিলাম। ফলে আমি তাওয়াফ ও সায়ী করি নাই। এই কথা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট পেশ করিলে তিনি বলিয়াছিলেনঃ একজন হাজী যে সমস্ত কাজ করে তুমি তাহাই করিয়া যাও। তবে পাক না হওয়া পর্যন্ত তাওয়াফ ও সায়ী স্থগিত রাখ। মালিক (রহঃ) বলেনঃ উমরার ইহরাম বাঁধিয়া কোন মহিলা মক্কায় আসিলে আর হজ্জের সময় তাহার ঋতুস্রাব আরম্ভ হওয়ার দরুন সে যদি তাওয়াফ করিতে না পারে, পাক হইতে হইতে হজ্জের সময় শেষ হইয়া যাওয়ার আশঙ্কা হইলে, সে হজ্জের ইহরাম বাঁধিয়া নিবে এবং একটা কুরবানী করিবে। কিরান হজ্জকারীর মত তাহাকেও একবার তাওয়াফ করিলেই হইবে। তাওয়াফ করিয়া দুই রাকাআত তাওয়াফের নামায আদায় করার পর যদি ঋতুস্রাব শুরু হয় তবে সে হজ্জের অন্যান্য আহকাম, যথা সায়ী, আরাফাতে মুযদালিফায় অবস্থান এবং প্রস্তর নিক্ষেপ এই অবস্থায়ই চালাইয়া যাইতে পারিবে। তবে হায়য হইতে পাক না হওয়া পর্যন্ত তাওয়াফে যিয়ারত করিতে পারিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 928
			}
		},
		{
			"hadithnumber": 929,
			"arabicnumber": 929,
			"text": "রেওয়ায়ত ২২৮. উম্মুল মু'মিনীন আয়েশা (রাঃ) বর্ণনা করেন, (হজ্জের সময়) সফিয়্যা বিনত হুয়াই (রাঃ)-এর ঋতুস্রাব আরম্ভ হয়। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট ইহা ব্যক্ত করিলে তিনি বলিলেনঃ সফিয়া যেন আমাদেরকে এইখানেই আটকাইয়া রাখিবে। তখন তাহাকে বলা হইল, ইনি তাওয়াফে যিয়ারত (ইফাযা) আদায় করিয়া নিয়াছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ তবে আর আটকাইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 929
			}
		},
		{
			"hadithnumber": 930,
			"arabicnumber": 930,
			"text": "রেওয়ায়ত ২২৯. উম্মুল মু'মিনীন আয়েশা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট বলিলেনঃ হে আল্লাহর রাসূল! সফিয়্যারতো ঋতুস্রাব শুরু হইয়াছে। তিনি বলিলেনঃ মনে হয় সে আমাদের আটকাইয়া রাখিবে। সে কি তোমাদের সহিত বায়তুল্লাহর তাওয়াফ করে নাই? মহিলাগণ বলিলেনঃ হ্যাঁ, করিয়াছিলেন। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ তবে আর কি, তাহা হইলে এখন চল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 930
			}
		},
		{
			"hadithnumber": 931,
			"arabicnumber": 931,
			"text": "রেওয়ায়ত ২৩০. আমরাহ বিনত আবদুর রহমান (রহঃ) বর্ণনা করেন, উম্মুল মু'মিনীন আয়েশা (রাঃ) অন্য মহিলাদেরকে নিয়া হজ্জ করিতেন এবং যদি তাহদের কাহারও ঋতুস্রাবের আশঙ্কা দেখা দিত তবে দশ তারিখেই তাহাকে তাওয়াফে যিয়ারত সমাধা করিয়া আসার জন্য পাঠাইয়া দিতেন। তাওয়াফে যিয়ারত করিয়া নেওয়ার পর কাহারও ঋতুস্রাব হইলে তাহার পাক হওয়ার আর অপেক্ষা করিতেন না, গন্তব্যস্থলে রওয়ানা হইয়া পড়িতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 931
			}
		},
		{
			"hadithnumber": 932,
			"arabicnumber": 932,
			"text": "রেওয়ায়ত ২৩১. উম্মুল মু'মিনীন আয়েশা (রাঃ) বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উম্মুল মু'মিনীন সফিয়া (রাঃ)-এর কথা জিজ্ঞাসা করিলে তাহারা বলিলেনঃ তাহার ঋতুস্রাব শুরু হইয়াছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ হয়তো সে আমাদেরকে আটকাইয়া রাখিবে। অন্যরা বলিলেনঃ হে আল্লাহর রাসূল! তিনি তাওয়াফ করিয়া নিয়াছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ তবে আর আটকাইবে না। হিশাম ইবন উরওয়াহ (রহঃ) হইতে বর্ণিত, তিনি বলিয়াছেনঃ আমরা উপরিউক্ত বিষয় আলোচনা করিয়াছিলাম। তখন আয়েশা (রাঃ) বলেনঃ মহিলাগণকে যদি পূর্বে তাওয়াফের জন্য পাঠাইয়া দেওয়া উপকারী না হয়, তবে মানুষ কেন পাঠায়? মানুষের এই ধারণা যদি ঠিক হইত, তবে ছয় হাজারেরও অধিক মহিলাকে ঋতুমতী অবস্থায় তাওয়াফে রুখসতের অপেক্ষায় মিনায় পড়িয়া থাকিতে হইত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 932
			}
		},
		{
			"hadithnumber": 933,
			"arabicnumber": 933,
			"text": "রেওয়ায়ত ২৩২. আবদুল্লাহ ইবন আবু বকর (রহঃ) তাহার পিতা হইতে বর্ণনা করেন, তাহাকে আবু সালমা ইবন আবদুর রহমান (রহঃ) খবর দিয়াছেনঃ উম্মে সুলায়ম বিনত মিলহান (রাঃ)-এর তাওয়াফে যিয়ারতে ঋতুস্রাব শুরু হইলে অথবা তাহার সন্তান ভূমিষ্ঠ হইলে তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট চলিয়া যাওয়ার অনুমতি চাহিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাকে চলিয়া যাইতে অনুমতি দিলেন। পরে তিনি চলিয়া গেলেন। মালিক (রহঃ) বলেনঃ মিনায় অবস্থানকালে কাহারও ঋতুস্রাব শুরু হইলে তাওয়াফে যিয়ারত না করা পর্যন্ত সে অপেক্ষা করিবে। তাওয়াফে যিয়ারত করার পর যদি কাহারও ঋতুস্রাব শুরু হয় তবে সে তাহার দেশে ফিরিয়া যাইতে পারে। কারণ এমন ঋতুমতী মহিলা সম্পর্কে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর তরফ হইতে অনুমতি প্রদানের রেওয়ায়ত আমাদের নিকট পৌছিয়াছে। তাওয়াফে যিয়ারতের পূর্বেই যদি ঋতুস্রাব শুরু হয় এবং উহা বন্ধ না হয় তবে ঋতুস্রাবের জন্য নির্ধারিত পূর্ণ মেয়াদ পর্যন্ত সে অবস্থান করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 933
			}
		},
		{
			"hadithnumber": 934,
			"arabicnumber": 934,
			"text": "রেওয়ায়ত ২৩৩. আবূয যুবায়র মক্কী (রহঃ) বর্ণনা করেন, উমর ইবন খাত্তাব (রাঃ) হায়েনা হত্যার বেলায় একটি মেষ, হরিণের বেলায় একটি ছাগল এবং খরগোশ হত্যার বেলায় এক বৎসর বয়সের ছাগলছানা, বন্য ইদুর হত্যার বেলায় চার মাস বয়সের ছাগলছানা প্রদানের বিধান দিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 934
			}
		},
		{
			"hadithnumber": 935,
			"arabicnumber": 935,
			"text": "রেওয়ায়ত ২৩৩. মুহাম্মদ ইবন সীরীন (রহঃ) বর্ণনা করেন, এক ব্যক্তি উমর ইবন খাত্তাব (রাঃ)-এর নিকট আসিয়া বলিলঃ আমি ও আমার সঙ্গী একটি গিরিবর্তে আমাদের ঘোড়া দৌড়াইয়া ইহরাম অবস্থায় একটি হরিণ শিকার করিয়া ফেলিয়াছি। উমর (রাঃ) তখন পার্শ্বে উপবিষ্ট এক ব্যক্তিকে বলিলেনঃ চলুন, আমরা দুইজনে ইহার একটি ফয়সালা করিয়া দেই। শেষে তাহারা উভয়ে ঐ ব্যক্তির উপর একটা বকরী ফিদয়া প্রদানের বিধান দেন। ঐ ব্যক্তি ফিরিয়া যাইতে যাইতে বলিতেছিলঃ ইনি আমিরুল মু'মিনীন, যিনি অন্যের সহযোগিতা ভিন্ন একটি হরিণের ফয়সালা দিতে পারিলেন না। উমর (রাঃ) তাহার উক্তি শুনিয়া ফেলিলেন। তাহাকে ডাকিয়া বলিলেনঃ তুমি কুরআনুল কারীমের সূরা-ই-মায়িদা পড়িয়াছ কি? সে বলিলঃ জি, না। তিনি বলিলেনঃ যিনি আমার সঙ্গে ফয়সালা দিয়াছেন তাহাকে চিন? সে বলিলঃ জি, না। উমর (রাঃ) তখন বলিলেনঃ যদি সূরা-ই-মায়িদা পড়িয়াছ বলিতে তবে তোমাকে আমি আজ শাস্তি দিতাম। আল্লাহ্ তা'আলা তাহার কিতাবে (সূরা-ই-মায়িদায়) ইরশাদ করিয়াছেনঃ “তোমাদের দুইজন ন্যায়নিষ্ঠ সত্যবাদী ব্যক্তি ফিদয়া সম্পর্কে ফয়সালা করিয়া দিবে। উহা কুরবানীর জন্য হইবে যাহা মক্কায় পৌছিবে।” আর যিনি আমার সহিত ফয়সালা প্রদানে সহযোগিতা করিয়াছেন ইনি হইতেছেন আবদুর রহমান ইবন আউফ (রাঃ)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 935
			}
		},
		{
			"hadithnumber": 936,
			"arabicnumber": 936,
			"text": "রেওয়ায়ত ২৩৫. হিশাম ইবন উরওয়া (রহঃ) বর্ণনা করেন- তাহার পিতা উরওয়াহ বলিতেনঃ একটি বন্য গাভী হত্যা করিলে একটি গরু এবং হরিণ হত্যা করিলে একটি বকরী ফিদয়া দিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 936
			}
		},
		{
			"hadithnumber": 937,
			"arabicnumber": 937,
			"text": "রেওয়ায়ত ২৩৬. সাঈদ ইবন মুসায়্যাব (রহঃ) বলেনঃ মক্কার কোন কবুতর শিকার করিলে একটি বকরী ফিদয়া দিতে হইবে। মালিক (রহঃ) বলেনঃ মক্কার অধিবাসী কোন ব্যক্তি যদি হজ্জ বা উমরার ইহরাম বাঁধে আর তাহার ঘরে যদি মক্কার কবুতরের বাচ্চা থাকে আর ঐ ব্যক্তি কবুতরের বাসার মুখ বন্ধ করিয়া দেওয়ার ফলে যদি ঐ ছানা মারা যায়, তবে প্রতিটি ছানার পরিবর্তে এক একটি বকর ফিদয়া দিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 937
			}
		},
		{
			"hadithnumber": 938,
			"arabicnumber": 938,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 938
			}
		},
		{
			"hadithnumber": 939,
			"arabicnumber": 939,
			"text": "রেওয়ায়ত ২৩৯. ইয়াহইয়া ইবন সাঈদ (রহঃ) বর্ণনা করেন, এক ব্যক্তি ইহরাম অবস্থায় কিছু পঙ্গপাল মারিয়া ফেলিয়ছিল। উমর ইবন খাত্তাব (রাঃ)-এর নিকট সে এই সম্পর্কে জিজ্ঞাসা করিলে তিনি কা'ব (রাঃ)-কে ডাকিয়া বললেনঃ চলুন, আমরা উভয়ে মিলিয়া ইহার একটা ফয়সালা করি। কাব (রাঃ) বললেনঃ ইহাতে এক দিরহাম কাফফারা দিতে হইবে উমর (রাঃ) কা’ব (রাঃ)-কে বলিলেনঃ আপনার নিকট অনেক দিরহাম রহিয়াছে (তাই এই ধরনের বিধান দিতে পারিয়াছেন), আমার নিকট একটি পঙ্গপাল হইতে একটা খেজুর অনেক শ্রেয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 939
			}
		},
		{
			"hadithnumber": 940,
			"arabicnumber": 940,
			"text": "রেওয়ায়ত ২৪০. কাব ইবন উজরা (রাঃ) বর্ণনা করেন- তিনি ইহরাম অবস্থায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহিত ছিলেন। তাহার মাথায় উকূন তাহাকে কষ্ট দিতেছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন তাহাকে মাথার চুল কামাইয়া ফেলিতে হুকুম করিয়া বলিলেনঃ ইহার পরিবর্তে তিনদিন রোযা বা ছয়জন মিসকীনের প্রত্যেককে দুই মুদ পরিমাণ খাদ্য কিংবা একটি বকরী কুরবানী দিয়া দাও। উপরিউক্ত তিনটি বিষয়ের যেকোন একটিই তোমার জন্য যথেষ্ট।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 940
			}
		},
		{
			"hadithnumber": 941,
			"arabicnumber": 941,
			"text": "রেওয়ায়ত ২৪১. কা’ব ইবন উজরা (রাঃ) বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেনঃ মনে হয় উকুন তাহাকে খুবই কষ্ট দিতেছে? আমি বলিলামঃ হ্যা, ইয়া রাসূলাল্লাহ্। তিনি তখন বলিলেনঃ চুল কামাইয়া ফেল এবং তিনদিন রোযা রাখ বা ছয়জন মিসকীনকে আহার করাও বা একটি বকরী কুরবানী দিয়া দিও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 941
			}
		},
		{
			"hadithnumber": 942,
			"arabicnumber": 942,
			"text": "রেওয়ায়ত ২৪২. কাব ইবন উজরা (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট আসিলেন। আমি চুলায় আগুন ধরাইয়া সঙ্গীদের জন্য রান্না-বান্নায় ব্যস্ত ছিলাম। আমার মাথা ও দাড়ি উকুনে ভরা ছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার পেরেশানী অনুভব করিয়া আমার ললাটে হাত রাখিলেন এবং বলিলেনঃ চুল কাটিয়া ফেল এবং তিনদিন রোযা রাখ বা ছয় জন মিসকীনকে খাদ্য দিয়া দাও। আর আমার নিকট কুরবানী করার মত কিছু ছিল না, এই কথা তিনি জানিতেন। মালিক (রহঃ) বলেন, অপরাধ না হওয়া পর্যন্ত কেউ কিছু ফিদয়া দিবে না। কারণ অপরাধ করার পরই শুধু কাফফারা ওয়াজিব হইয়া থাকে। কাফফারার বেলায় কুরবানী বা রোযা বা মিসকীনকে খাদ্য প্রদান, এই তিনটির যেকোন একটি এবং মক্কা বা মক্কার বাহিরে যেকোন শহরে উহা আদায় করার ইখতিয়ার রহিয়াছে। মালিক (রহঃ) বলেনঃ ইহরাম না খোলা পর্যন্ত মুহরিমের জন্য চুল উপড়ান বা কামানো বা ছাটা কিছুই জায়েয নহে। চুলে উকুন ইত্যাদি হইয়া গেলে উহা জায়েয। কিন্তু উহার পরিবর্তে আল্লাহর নির্দেশমত ফিদয়া দিতে হইবে। মুহরিমের জন্য নখ কাটা, উকুন মারা বা মাথার চুল হইতে উকুন বাহির করিয়া মাটিতে ফেলিয়া দেওয়া বা শরীর ও কাপড়ের উকুন বাহির করা জায়েয নহে। এইরূপ করিলে এক মুষ্টি খাদ্য খয়রাত করিবে। মালিক (রহঃ) বলেনঃ যদি ইহরাম অবস্থায় কোন ব্যক্তি নাকের চুল বা বগলতলা বা নাভীর নিচের লোম চিমটি দ্বারা উপড়ায় অথবা মাথায় যখম হওয়ার দরুন প্রয়োজনের খাতিরে চুল কামায় বা সিঙ্গা লাগাইবার উদ্দেশ্যে গর্দানের চুল কাটে, এইসব জানিয়া করুক বা ভুলবশত করুক, সকল অবস্থায়ই তাহার জন্য ফিদয়া দেওয়া ওয়াজিব। সিঙ্গা লাগানো স্থানের চুল কামানো মুহরিমের জন্য জায়েয নহে। মালিক (রহঃ) বলেনঃ অজ্ঞতার দরুন যদি কেউ কঙ্কর নিক্ষেপের পূর্বেই মাথার চুল কামাইয়া ফেলে তবে তাহাকে ফিদয়া দিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 942
			}
		},
		{
			"hadithnumber": 943,
			"arabicnumber": 943,
			"text": "রেওয়ায়ত ২৪৩. সাঈদ ইবন যুবায়র (রহঃ) বর্ণনা করেন, আবদুল্লাহ ইবন আব্বাস (রাঃ) বলিয়াছেনঃ যদি কেউ হজ্জে কোন রুকন আদায় করিতে ভুলিয়া যায় বা উহা ছাড়িয়া দেয় তবে তাহাকে কুরবানী দিতে হইবে। আইয়ুব (আইয়ুব ইবন আবি তমীমা সখতিয়ানী) (রহঃ) বলেনঃ আমার মনে নাই সাঈদ (রহঃ) ভুলিয়া গেলে বলিয়াছেন, না ছাড়িয়া দিলে বলিয়াছিলেন। মালিক (রহঃ) বলেনঃ উক্ত কুরবানী মক্কায় পৌছাইতে হইবে। অন্য কোন ইবাদত হইলে যেকোন স্থানেই তাহা আদায় করা যায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 943
			}
		},
		{
			"hadithnumber": 944,
			"arabicnumber": 944,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 944
			}
		},
		{
			"hadithnumber": 945,
			"arabicnumber": 945,
			"text": "রেওয়ায়ত ২৪৬. আবদুল্লাহ ইবন উমর (রাঃ) বর্ণনা করেন- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন জিহাদ বা হজ্জ বা উমরা হইতে প্রত্যাবর্তন করিতেন, তখন প্রতিটি চড়াই অতিক্রম করার সময় তিনি ‘আল্লাহু আকবার’ বলিয়া নিম্নোক্ত দু'আ পাঠ করিতেনঃ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ অর্থাৎ, আল্লাহ ছাড়া কোন ইলাহ বা মাবূদ নাই, তিনি এক, তাহার কোন শরীক নাই। তাহার সকল সাম্রাজ্য এবং তাঁহারই সকল প্রশংসা এবং তিনি সকল জিনিসের উপর ক্ষমতাশীল। আমরা প্রত্যাবর্তনকারী, তওবাকারী, ইবাদত-গুজার, সিজদা আদায়কারী এবং প্রভুর প্রশংসাকারী। আল্লাহ্ তাহার ওয়াদা পূরণ করিয়াছেন, তাহার বান্দাকে সাহায্য করিয়াছেন এবং একাই তিনি পরাজিত করিয়াছেন সকল শত্রু বাহিনী।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 945
			}
		},
		{
			"hadithnumber": 946,
			"arabicnumber": 946,
			"text": "রেওয়ায়ত ২৪৭. আবদুল্লাহ ইবন আব্বাস (রাঃ)-এর আযাদকৃত গোলাম কুরায়ব বর্ণনা করেন- হাওদাতে আরোহিণী এক মহিলার নিকট দিয়া রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পথ অতিক্রম করিয়া যাইতেছিলেন। মহিলাটিকে কেউ তখন বলিলঃ ইনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মহিলাটি তখন স্বীয় শিশু সন্তানটির হাত ধারণ করিয়া বলিলঃ হে আল্লাহর রাসূল! এই শিশুটিও হজ্জ আমার সহিত আদায় হইবে কি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ হ্যাঁ, আদায় হইবে। আর ইহার সওয়াব তুমি পাইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 946
			}
		},
		{
			"hadithnumber": 947,
			"arabicnumber": 947,
			"text": "রেওয়ায়ত ২৪৮. তালহা ইবন উবায়দুল্লাহ ইবন কারীয (রহঃ) বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ আরাফাতের দিন হইতে বেশি আর কোনদিন শয়তানকে লাঞ্ছিত, অপমানিত এবং রাগান্বিত হইতে দেখা যায় নাই। কারণ এই দিন সে আল্লাহ তা'আলার অপার রহমত নাযিল হইতে এবং বড় বড় গুনাহসমূহ মাফ হইয়া যাইতে দেখিতে পায়। বদর যুদ্ধের দিনও তাহার ঐ অবস্থা হইতে দেখা গিয়াছিল? কেউ জিজ্ঞাসা করিলঃ বদরের দিন সে কি দেখিয়াছিল? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ ঐ দিন সে জিবরীল (আঃ)-কে ফেরেশতা বাহিনীকে কাতারবন্দী করিতে দেখিয়াছিল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 947
			}
		},
		{
			"hadithnumber": 948,
			"arabicnumber": 948,
			"text": "রেওয়ায়ত ২৪৯. তালহা ইবন উবায়দুল্লাহ ইবন কারীয (রহঃ) বর্ণনা করেন- রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ সর্বোত্তম দুআ হইল আরাফাতের দু'আ। আর আরাফাতের সর্বোত্তম দুআ হইল ঐ দুআ যাহা আমি এবং আমার পূর্ববর্তী পয়গম্বরগণ করিয়াছিলেন। দুআটি এইঃ (لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ) আল্লাহ ব্যতীত কেউ ইলাহ নাই, তিনি এক, তাহার কোন শরীক নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 948
			}
		},
		{
			"hadithnumber": 949,
			"arabicnumber": 949,
			"text": "রেওয়ায়ত ২৫০. আনাস ইবন মালিক (রাঃ) বর্ণনা করেন- মক্কা বিজয়ের সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মক্কায় প্রবেশ করেন তখন তিনি মাথায় লৌহ শিরস্ত্রাণ পরিহিত ছিলেন। মাথা হইতে উহা যখন খুলিয়া রাখিলেন, তখন এক ব্যক্তি আসিয়া বলিলঃ হে আল্লাহর রাসূল! ইবন খতল কা'বার গিলাফ ধরিয়া দাঁড়াইয়া রহিয়াছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ তাহাকে হত্যা কর। ইমাম মালিক (রহঃ) বলেনঃ ইবন শিহাব (রহঃ) বলিয়াছেন, ঐদিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহরাম বাধা অবস্থায় ছিলেন না। আল্লাহ্ই সর্বজ্ঞ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 949
			}
		},
		{
			"hadithnumber": 950,
			"arabicnumber": 950,
			"text": "রেওয়ায়ত ২৫১. নাফি' (রহঃ) বর্ণনা করেন, আবদুল্লাহ ইবন উমর (রাঃ) মক্কা হইতে মদীনায় প্রত্যাবর্তন করিয়াছিলেন। কুদায়দ নামক স্থানে পৌছিয়া তিনি মদীনার বিশৃংখলা সম্পর্কে সংবাদ জ্ঞাত হন। শেষে তিনি পুনরায় মক্কা ফিরিয়া যান এবং ইহরাম না করিয়াই মক্কায় প্রবেশ করেন। মালিক (রহঃ) এইরূপ রেওয়ায়ত ইবন শিহাব হইতেও বর্ণনা করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 950
			}
		},
		{
			"hadithnumber": 952,
			"arabicnumber": 952,
			"text": "রেওয়ায়ত ২৫২. মুহাম্মদ ইমরান আনসারী (রহঃ) তাহার পিতা হইতে বর্ণনা করেন- মক্কার পথে একটি বড় গাছের নিচে আমি বিশ্রাম নিতেছিলাম। আবদুল্লাহ ইবন উমর (রাঃ) তখন আমার নিকট আসিয়া বলিলেনঃ এই গাছটির নিচে আসিয়া কেন নামিয়া পড়িলে? আমি বলিলামঃ একটু ছায়া লাভের জন্য। তিনি বলিলেনঃ আর কোন উদ্দেশ্য নয়তো আমি বললাম না, শুধু ছায়ার জন্যই। তখন আবদুল্লাহ ইবন উমর (রহঃ) বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ যখন তুমি মিনায় বড় বড় দুইটি পর্বতের মধ্যবর্তী স্থানে হইবে, এই বলিয়া রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পূর্বদিকে হস্ত দ্বারা ইশারা করিলেন, তখন (জানিও যে,) ঐ উপত্যকায় যাহাকে সিরার বলা হয়, উহার একটি বড় গাছের নিচে সত্তর জন নবীর (জনের পর) নাড়ী কর্তন করা হইয়াছিল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 952
			}
		},
		{
			"hadithnumber": 953,
			"arabicnumber": 953,
			"text": "রেওয়ায়ত ২৫৩. ইবন আবি মুলায়কা (রহঃ) বর্ণনা করেন, বায়তুল্লাহর তাওয়াফরত কুষ্ঠ রোগাক্রান্ত এক মহিলার নিকট দিয়া উমর ইবন খাত্তাব (রাঃ) যাইতেছিলেন। তখন তিনি তাহাকে বলিলেনঃ হে আল্লাহর দাসী, অন্য মানুষকে কষ্ট দিও না। হায়, তুমি যদি তোমার বাড়িতেই বসিয়া থাকিতে। পরে উক্ত মেয়েলোকটি নিজের বাড়িতেই বসিয়া থাকিত। একদিন একটি লোক তাহাকে বলিলঃ যিনি তোমাকে বাড়ির বাহিরে যাইতে নিষেধ করিয়াছিলেন, তিনি ইনতিকাল করিয়াছেন। এখন তুমি বাহির হইয়া আসিতে পার। মেয়েটি বলিলঃ জীবদ্দশায় তাঁহাকে মানিব, আর মৃত্যুর পর অবাধ্য হইব, আমি এমন স্ত্রীলোক নহি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 953
			}
		},
		{
			"hadithnumber": 954,
			"arabicnumber": 954,
			"text": "রেওয়ায়ত ২৫৪. মালিক (রহঃ) বলেনঃ আমি জ্ঞাত হইয়াছি, আবদুল্লাহ ইবন আব্বাস (রাঃ) বলতেনঃ হাজরে আসওয়াদ এবং কা'বার দরজার মধ্যবর্তী স্থানটি হইল মুলতাযাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 954
			}
		},
		{
			"hadithnumber": 955,
			"arabicnumber": 955,
			"text": "রেওয়ায়ত ২৫৫. মুহাম্মদ ইবন ইয়াহইয়া ইবন হাব্বান (রহঃ) বর্ণনা করেন, রবাযা নামক স্থানে আবূ যর (রাঃ)-এর নিকট দিয়া এক ব্যক্তি পথ অতিক্রম করিয়া যাইতেছিলেন। তাহাকে দেখিয়া তিনি বলিলেনঃ কোথায় যাইতেছ? তিনি বলিলেনঃ হজ্জের উদ্দেশ্যে যাত্রা করিয়াছি। তিনি বলিলেনঃ অন্য কোন উদ্দেশ্য তো নাই? তিনি বলিলেনঃ না। আবূ যর (রাঃ) বললেনঃ আচ্ছা যাও, তোমার কাজ তুমি কর। ঐ ব্যক্তি বলেনঃ আমি মক্কায় চলিয়া গেলাম। আল্লাহর যতদিন ইচ্ছা হইল আমি সেখানে রহিয়া গেলাম। একদিন দেখি এক ব্যক্তিকে কেন্দ্র করিয়া মানুষ খুবই ভিড় করিয়া আছে। ভিড়ের ভিতরে যাইয়া দেখি, রবাযায় যাহার সঙ্গে আমার সাক্ষাৎ হইয়াছিল [আবূ যর (রাঃ)] তিনি বসিয়া আছেন। তিনি আমাকে দেখিয়া চিনিয়া ফেলিলেন এবং বলিলেনঃ তুমি সেই ব্যক্তি না, যাহাকে আমি হাদীস বর্ণনা করিয়া শুনাইয়াছিলাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 955
			}
		},
		{
			"hadithnumber": 956,
			"arabicnumber": 956,
			"text": "রেওয়ায়ত ২৫৬. মালিক (রহঃ) ইবন শিহাব (রহঃ)-এর নিকট জিজ্ঞাসা করিলেন, হজ্জের মধ্যে কোন কিছুর শর্ত আরোপ করা কিরূপ? তিনি বলিলেন, এমনও কেউ করে নাকি? এবং তিনি উক্ত বিষয়টির বিপক্ষে মতপ্রকাশ করিলেন। মালিক (রহঃ)-কে জিজ্ঞাসা করা হইয়াছিল- স্বীয় পশুর (খাদ্যের) নিমিত্ত হারম শরীফের ঘাস কাটা যাইতে পারে কি? তিনি বলিলেনঃ না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 956
			}
		},
		{
			"hadithnumber": 957,
			"arabicnumber": 957,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 957
			}
		}
	]
}