{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"3": "Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 146,
			"arabicnumber": 146,
			"text": "রেওয়ায়ত ১. ইয়াহইয়া ইবন সাঈদ (রহঃ) বলিয়াছেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুইটি কাঠ তৈয়ার করাইবার মনস্থ করিয়াছিলেন, যেন একটির দ্বারা অপরটির উপর আঘাত করিয়া ধ্বনি সৃষ্টি করিয়া মানুষকে নামাযের জামাতের উদ্দেশ্যে একত্র করা যায়। অতঃপর আবদুল্লাহ ইবন যায়দ আনসারী এবং বনি হারিস ইবন খাযরাযী (রাঃ) স্বপ্নে দুইটি কাঠ দেখিতে পাইয়া বলিলেনঃ এই দুইটি অনুরূপ কাঠই যেরূপ কাঠ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তৈয়ার করাইতে চাহিয়াছেন। তারপর তাহাকে বলা হইলঃ তোমরা নামাযের জন্য আযান দাও না কেন? ঘুম হইতে জাগার পর তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সমীপে উপস্থিত হইয়া তাহার স্বপ্নের কথা আরয করলেন। অতঃপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আযানের জন্য হুকুম দিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mursal Sahih Isnaad"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 147,
			"arabicnumber": 147,
			"text": "রেওয়ায়ত ২. আবু সাঈদ খুদরী (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ যখন তোমরা আযান শোন তখন মুয়াযযিনের অনুরূপ তোমরাও বল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 148,
			"arabicnumber": 148,
			"text": "রেওয়ায়ত ৩. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ মানুষ যদি জানিত আযান ও প্রথম কাতারে কী (বরকত ও মঙ্গল) রহিয়াছে, তবে উহা পাইবার জন্য লটারী ছাড়া উপায় না থাকিলে তাহারা উহার জন্য লটারী করিত। আর যদি তাহারা জানিত দ্ধিপ্রহরের নামাযে (যোহর ও জুম'আয়) প্রথম সময়ে গমনে কী রহিয়াছে তবে তাহার দিকে দ্রুতগতিতে ধাবিত হইত। আর তাহারা যদি জানিত ইশা ও ফজরের নামাযে কী রহিয়াছে তাহা হইলে উভয় নামাযের জন্য অবশ্যই আসিত, এমনকি হামাগুড়ি দিয়াও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 149,
			"arabicnumber": 149,
			"text": "রেওয়ায়ত ৪. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ যখন নামাযের ইকামত বলা হয় তখন তাড়াহুড়া না কুরিয়া ধীরে সুস্থে আসিবে। অতঃপর জামাতের সঙ্গে যতখানি পাইবে উহা পড়িয়া অবশিষ্ট নামায নিজে নিজে পূরণ করবে। কেননা তোমাদের কেউ নামাযের উদ্দেশ্যে বাহির হইলে তাহাকে নামাযে গণ্য করা হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 150,
			"arabicnumber": 150,
			"text": "রেওয়ায়ত ৫. আবদুর রহমান ইবন আবি সাসা'আ' আনসারী মাযনী (রহঃ) কর্তৃক তাহার পিতা হইতে বর্ণিত, আবু সাঈদ খুদরী (রাঃ) তাহাকে উদ্দেশ্য করিয়া বলিয়াছেনঃ আমি দেখিতেছি তুমি মাঠ ও বকরীকে ভালবাস। তুমি যখন তোমার বকরীর সঙ্গে থাক অথবা মাঠে থাক এবং নামাযের জন্য আযান দাও তবে তারস্বরে আযান দিও। কারণ আযানের স্বর মানুষ, জিন এবং অন্য যে কেউ শুনিতে পায়, সে মুয়াযযিনের জন্য কিয়ামত দিবসে সাক্ষ্য দিবে। আবূ সাঈদ (রাঃ) বলিয়াছেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হইতে অনুরূপ শুনিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 151,
			"arabicnumber": 151,
			"text": "রেওয়ায়ত ৬. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ নামাযের জন্য আযান দেওয়ার সময় শয়তান সশব্দে বায়ু ছাড়িতে ছাড়িতে পালায়, যেন সে আযানের শব্দ না শোনে। আযান শেষ হইলে সে আবার আসে। ইকামত আরম্ভ হইলে আবার পলায়ন করে। ইকামত বলা শেষ হইলে পুনরায় উপস্থিত হয় এবং ওয়াসওয়াসা ঢালিয়া নামাযী ব্যক্তি ও তাহার অভীষ্ট লক্ষ্যের মধ্যে প্রতিবন্ধকতা সৃষ্টি করে; যে সকল বিষয় তাহার স্মরণ ছিল না সেই সবের প্রতি আকৃষ্ট করিয়া সে বলিতে থাকেঃ অমুক বিষয় স্মরণ কর, অমুক বিষয় স্মরণ কর। ফলে সেই ব্যক্তি কত রাকাআত নামায পড়িয়াছে উহা পর্যন্ত ভুলিয়া যায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 152,
			"arabicnumber": 152,
			"text": "রেওয়ায়ত ৭. সাহল ইবন সা’আদ সায়েদী (রাঃ) বর্ণনা করিয়াছেনঃ দুইটি মুহূর্ত এইরূপ আছে সেই সময় অসমানের দরওয়াজা খোলা হয় এবং সেই মুহূর্তদ্বয়ে প্রার্থনাকারীর প্রার্থনা কুচিৎ ফেরত দেওয়া হয়; নামাযের আযানের মুহুর্ত এবং আল্লাহর পথে জিহাদের কাতার ঠিক করার মুহুর্ত। ইয়াহইয়া (রহঃ) বলিয়াছেনঃ মালিক (রহঃ)-কে প্রশ্ন করা হইলঃ জুম'আর দিন সময়ের পূর্বে আযান দেওয়া যায় কি? তিনি উত্তর দিলেনঃ না, যায় না। সূর্য পশ্চিম দিকে ঝুঁকিবার পরই আযানের সময় হয়। ইয়াহইয়া (রহঃ) বর্ণনা করিয়াছেন- মালিক (রহঃ)-কে জিজ্ঞাসা করা হইল আযান ও ইকামত-এর (বাক্যগুলি) দুই দুইবার বলা সম্পর্কে এবং ইকামতের সময় মানুষের কোন সময় দাঁড়াইতে হইবে সেই সম্পর্কে। তিনি উত্তর দিলেনঃ আযান ও ইকামতের বিষয় আমি লোকজনকে যে পর্যায়ে পাইয়াছি উহার চাইতে অধিক কিছু আমার নিকট পৌছে নাই। ইকামত অবশ্য দুই দুইবার বলিতে নাই। আমাদের শহরের (মদীনা) বিজ্ঞ আলিমগণ এই মতই পোষণ করিতেন। ইকামতের সময় দাঁড়াইবার সম্পর্কে সুনির্দিষ্ট কোন সীমা আমি জ্ঞাত নই। তবে আমার মতে উহা অনেকটা লোকের শক্তি-সামর্থ্যের উপর নির্ভর করে। কারণ সব লোক এক রকমের নয়; তাহাদের মধ্যে সবল ও দুর্বল সকল প্রকারের লোকই থাকে। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মালিক (রহঃ)-কে প্রশ্ন করা হইলঃ যাহারা প্রবাসী নহে বরং মুকীম (স্বদেশে বা বিদেশে শরীয়তসম্মত স্থায়ী বসবাসকারী) তাহারা ফরয নামায জামাত সহকারে আযান ছাড়া শুধু ইকামত বলিয়া পড়িতে চাহিলে-এই বিষয়ে আপনার মত কি? তিনি বলিলেনঃ কেবল ইকামত বলিলেও চলিবে। কেননা আযান ওয়াজিব হয় সেই সব মসজিদের জন্য যেসব মসজিদে জামাত অনুষ্ঠিত হয় এবং লোকজনকে নামাযের জন্য আহবান করা হয়। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মুয়াযযিন কর্তৃক ইমামকে সালাম দেওয়া, নামাযের জন্য তাহাকে আহবান করা এবং সর্বপ্রথম কোন আমীরের প্রতি এইরূপ করা হইয়াছিল- এই বিষয়ে মালিক (রহঃ)-কে জিজ্ঞাসা করা হইলে তিনি বলিলেনঃ এইরূপ সালাম দেওয়ার রীতি প্রথম যুগে ছিল বলিয়া আমি অবগত নই। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মুয়াযযিন আযান দিয়া অপেক্ষা করিল, কিন্তু নামায পড়িতে কেউ আসিল না। অতএব, সে ইকামত বলিয়া একা একাই নামায পড়িল। নামায সমাপ্ত হইলে কিছু লোক আসিল। এক্ষণে সে কি পুনরায় আগন্তুকদের সঙ্গে নামায পড়িবে? মালিক (রহঃ)-এর নিকট এই বিষয়ে প্রশ্ন করা হইলে তিনি বলিলেনঃ না, পরে যাহারা আসিবে তাহারা পৃথক পৃথকভাবে নামায পড়িবে। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মালিক (রহঃ) জিজ্ঞাসিত হইলেনঃ মুয়াৰ্যযিন আযান দিবার পর নফল নামায শুরু করিল। লোকজন আসিয়া অন্যের দ্বারা ইকামত বলাইয়া জামাতসহকারে নামায পড়িতে ইচ্ছা করিল, এইরূপ করা চলে কি? তিনি উত্তর দিলেন, যায়, ইহা বৈধ। ইকামত বলার ব্যাপারে মুয়াযযিন এবং অন্য ব্যক্তি এক সমান। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মালিক (রহঃ) বলিয়াছেনঃ ফজরের আযান প্রায়ই সুবহে-সাদিক-এর আগে দেওয়া হইত। কিন্তু অন্যসব নামাযের আযান আমাদের মতে সময় হওয়ার পর ছাড়া দেওয়া হইত না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 153,
			"arabicnumber": 153,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 154,
			"arabicnumber": 154,
			"text": "রেওয়ায়ত ৮. মালিক (রহঃ) বলিয়াছেন, তাহার নিকট সংবাদ পৌছিয়াছে যে, ফজরের নামাযের সংবাদ দেওয়ার জন্য মুয়াযযিন উমর ইবন খাত্তাব (রাঃ)-এর নিকট আসিলেন এবং তাহাকে নিদ্রিত পাইয়া বলিলেন- (يا امير المؤمنين) الصَّلاَةُ خَيْرٌ مِنَ النَّوْمِ উমর (রাঃ) শুনিয়া বাক্যটিকে ফজরের আযানের অন্তর্ভুক্ত করিবার নির্দেশ দিলেন। মালিক (রহঃ)-এর চাচা আবু সুহায়ল ইবন মালিক (রহঃ) তাহার পিতা হইতে বর্ণনা করিয়াছেন, তিনি বলিয়াছেনঃ লোকদিগকে (পূর্বযুগে) যেইরূপ পাইয়াছি, এখন নামাযের আযান ব্যতীত আর অন্য কিছুই সেইরূপ দেখিতেছি না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 155,
			"arabicnumber": 155,
			"text": "রেওয়ায়ত ৯. নাফি (রহঃ) বর্ণনা করিয়াছেন- আবদুল্লাহ ইবন উমর (রাঃ) ইকামত শুনিয়া ‘বকী’ নামক স্থান হইতে মসজিদের দিকে ত্বরিত ধাবিত হইয়াছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 156,
			"arabicnumber": 156,
			"text": "রেওয়ায়ত ১০. নাফি’ (রহঃ) হইতে বর্ণিত, এক শীতল রজনীতে আবদুল্লাহ ইবন উমর (রাঃ) আযান দিতে নির্দেশ দিলেন। আযানের পর বললেনঃ (أَلاَ صَلُّوا فِي الرِّحَالِ)-তোমরা নিজ নিজ আবাসে নামায পড়। তারপর তিনি বলিলেনঃ শীতল ও বর্ষনশীলা রজনীতে (أَلاَ صَلُّوا فِي الرِّحَالِ) বলিবার জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুয়াযযিনকে নির্দেশ দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 157,
			"arabicnumber": 157,
			"text": "রেওয়ায়ত ১১. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ) সফরে শুধু ইকামত বলিতেন। অবশ্য ফজরের সময় আযান ও ইকামত উভয়ের ব্যবস্থা করা হইত। তিনি বলিতেনঃ আযান বলিতে হয় সেই ইমামের বেলায় যাহার সহিত নামায পড়িবার উদ্দেশ্যে লোকজন একত্রিত হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 158,
			"arabicnumber": 158,
			"text": "রেওয়ায়ত ১২. হিশাম ইবন উরওয়া (রহঃ) হইতে বর্ণিত, তাহার পিতা বলিয়াছেনঃ তুমি সফরে থাকিলে ইচ্ছা করিলে আযান ও ইকামত দুইটিই বলিতে পার, আর যদি চাও, আযান না দিয়া কেবল ইকামতও বলিতে পার। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, আমি মালিক (রহঃ)-কে বলিতে শুনিয়াছি, আরোহী’ আযান দিলে কোন দোষ নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 159,
			"arabicnumber": 159,
			"text": "রেওয়ায়ত ১৩. ইয়াহইয়া ইবন সাঈদ (রহঃ) হইতে বর্ণিত, সাঈদ ইবন মুসায়্যাব (রহঃ) বলিয়াছেন, যে ব্যক্তি মাঠে নামায পড়ে তাহার ডাইনে একজন ও বামে একজন ফেরেশতা নামাযে দাঁড়ান। আর যদি সে আযান ও ইকামত দিয়া নামায পড়ে তবে তাহার পিছনে পাহাড় পরিমাণ (বহু) ফেরেশতা নামাযে শামিল হন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 160,
			"arabicnumber": 160,
			"text": "রেওয়ায়ত ১৪. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ বিলাল রাত্রি থাকিতে আযান দেয়। অতএব ইবন উম্মি-মাকতুম আযান না দেওয়া পর্যন্ত তোমরা পানাহার করিতে পার।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 161,
			"arabicnumber": 161,
			"text": "রেওয়ায়ত ১৫. সালিম ইবন আবদুল্লাহ্ (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ বিলাল রাত (অবশিষ্ট থাকিতে) আযান দেয়। অতঃপর তোমরা পানাহার করিতে থাক যতক্ষণ ইবন উম্মি মাকতুম আযান না দেয়। তিনি (রেওয়ায়ত বর্ণনাকারী) বলিয়াছেনঃ ইবন উম্মি মাকতুম ছিলেন অন্ধ ব্যক্তি। তাহার উদ্দেশ্যে أَصْبَحْتَ أَصْبَحْتَ (ভোর হইয়াছে, তোর হইয়াছে) না বলা পর্যন্ত তিনি আযান দিতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 162,
			"arabicnumber": 162,
			"text": "রেওয়ায়ত ১৬. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নামায আরম্ভ করার সময় উভয় হাত কাঁধ বরাবর তুলিতেন এবং যখন রুকু হইতে মাথা তুলিতেন তখনও দুই হাত অনুরূপভাবে তুলিতেন এবং বলতেন (سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ) অবশ্য সিজদার সময় তিনি হাত উঠাইতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 163,
			"arabicnumber": 163,
			"text": "রেওয়ায়ত ১৭. আলী ইবন হুসায়ন আলী ইবন আবি তালিব (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নামাযের মধ্যে যখন নিচের দিক ঝুঁকিতেন ও মাথা উপরে তুলিতেন তখন তকবীর (আল্লাহু আকবার) বলতেন। তিনি আল্লাহর সহিত মিলিত হওয়া পর্যন্ত এইভাবে নামায পড়িয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 164,
			"arabicnumber": 164,
			"text": "রেওয়ায়ত ১৮. সুলায়মান ইবন ইয়াসার (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নামাযে দুই হাত উপরে উঠাইতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 165,
			"arabicnumber": 165,
			"text": "রেওয়ায়ত ১৯. আবি সালমা ইবন আবদুর রহমান ইবন আওফ (রহঃ) বর্ণনা করিয়াছেন, আবু হুরায়রা (রাঃ) তাহাদের (শিক্ষাদানের) উদ্দেশ্যে নামায পড়িতেন এবং তিনি যতবার নিচের দিকে ঝুঁকিতেন ও মাথা উপরে তুলিতেন ততবার তকবীর (আল্লাহু আকবার) বলতেন। নামায শেষ করার পর তিনি বলিতেনঃ তোমাদের মধ্যে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নামাযের সঙ্গে আমি অধিকতর সামঞ্জস্য-রক্ষাকরী।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 166,
			"arabicnumber": 166,
			"text": "রেওয়ায়ত ২০. সলিম ইবন আবদুল্লাহ্ (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ) যখন নিচের দিকে ঝুঁকিতেন ও মাথা উপরে তুলিতেন তখন তকবীর বলিতেন। নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) নামায আরম্ভ করার সময় উভয় হাত কাঁধ বরাবর তুলিতেন। আর যখন রুকৃ হইতে মাথা তুলিতেন তখন দুই হাত কাঁধের একটু নিচ পর্যন্ত তুলিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 168,
			"arabicnumber": 168,
			"text": "রেওয়ায়ত ২১. আবু নঈম ওয়াহব ইবন কায়সান (রহঃ) হইতে বর্ণিত, জাবির ইবন আবদুল্লাহ্ (রাঃ) তাহাদিগকে নামাযের ‘তকবীর শিক্ষা দিতেন। তিনি আরও বর্ণনা করিয়াছেনঃ নিচের দিকে ঝুঁকিবার ও মাথা উপরে তুলিবার সময় ‘তকবীর’ বলার জন্য তিনি [জাবির (রাঃ)] আমাদিগকে নির্দেশ দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 169,
			"arabicnumber": 169,
			"text": "রেওয়ায়ত ২২. মালিক (রহঃ) ইবন শিহাব (রহঃ) হইতে বর্ণনা করিয়াছেন- তিনি বলিয়াছেনঃ যদি কোন ব্যক্তি এক রাকআত নামায পায় এবং একবার তকবীর বলে তাহার জন্য ঐ এক ‘তকবীর যথেষ্ট হইবে। ইয়াহইয়া (রহঃ) মালিক (রহঃ) হইতে বর্ণনা করিয়াছেন- ঐ এক ‘তকবীরই যথেষ্ট হইবে যদি সে উক্ত তকবীর দ্বারা ‘তকবীর-এ তাহরীমা’-এর নিয়ত করে। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মালিক (রহঃ)-কে প্রশ্ন করা হইলঃ এক ব্যক্তি ইমামের সঙ্গে নামাযে শরীক হইল কিন্তু সে তববীর-এ তাহরীমা’ ও রুকূর ‘তকবীর বলিতে ভুলিয়া গেল। নামায এক রাকআত পড়ার পর তাহার স্মরণ হইল যে, সে ‘তাহরীমা’ ও রুকূর তকবীর বলে নাই। অতঃপর দ্বিতীয় রাকআতে সে তকবীর বলিল। তাহার কি করা উচিত? তিনি উত্তর দিলেন, সেই ব্যক্তির জন্য নামায শুরু হইতে পুনরায় পড়া আমি ভাল মনে করি। আর যদি কোন ব্যক্তি ইমামের সঙ্গে ‘তকবীর-এ-তাহরীমা’ বলিতে ভুলিয়া যায়, প্রথম রুকূর সময় তকবীর’ বলে, রুকূর তকবীরের সঙ্গে ‘তকবীর-এ-তাহরীমা’রও নিয়ত করে, তবে আমার মতে উক্ত রুকূর ‘তকবীর’ই তাহার জন্য যথেষ্ট হইবে। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মালিক (রহঃ) বলিয়াছেনঃ যে ব্যক্তি একা একা নামায পড়িতেছে সে ‘তকবীর-এ-তাহরীমা’ ভুলিয়া গেলে তাহাকে নামায পুনরায় পড়িতে হইবে। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মালিক (রহঃ) বলিয়াছেনঃ ইমাম যদি ‘তকবীর-এ-তাহরীমা’ বলিতে ভুলিয়া গেলেন এবং নামায সমাপ্ত করিলেন, তবে আমার মতে ইমাম ও মুকতাদী উভয়ের নামায পুনরায় পড়া উচিত, এমন কি মুকতাদীগণ তকবীর বলিয়া থাকিলেও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 170,
			"arabicnumber": 170,
			"text": "রেওয়ায়ত ২৩. মুহাম্মদ ইবন যুবায়র ইবন মুতায়িম (রহঃ) তাহার পিতা হইতে বর্ণনা করেন যে, তিনি বলিয়াছেনঃ আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মাগরিবের নামাযে সূরা[1] (والطُّورِ) পাঠ করতেন শুনিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 171,
			"arabicnumber": 171,
			"text": "রেওয়ায়ত ২৪. আবদুল্লাহ ইবন আব্বাস (রাঃ) হইতে বর্ণিত, উম্মুল ফযল বিনত হারিস (রাঃ) তাহাকে সূরা[1] পাঠ করিতে শুনিয়া বলিয়াছিলেন, হে বৎস! তুমি এই সূরা পাঠ করিয়া রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কথা স্মরণ করাইয়া দিলে। এই সূরাটি সর্বশেষ সূরা যাহা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পবিত্র মুখে মাগরিবের নামাযে পাঠ করিতে আমি শুনিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 172,
			"arabicnumber": 172,
			"text": "রেওয়ায়ত ২৫. কায়স ইবন হারিস (রহঃ) আবু আবদুল্লাহ সুনাবিহি (রাঃ) হইতে বর্ণনা করিয়াছেন- তিনি (আবু আবদুল্লাহ সুনাবিহি) বলিয়াছেনঃ আমি আবু বকর (রাঃ)-এর খিলাফতকালে মদীনায় আগমন করিলাম এবং তাহার ইমামতিতে মাগরিবের নামায পড়িলাম। তিনি প্রথম দুই রাকাআতে সূরা ফাতিহার পর (قِصَارِ الْمُفَصَّلِ) (কিসার-ই-মুফাসসাল) হইতে এক রাকাআতে একটি করিয়া সূরা পাঠ করিলেন; তারপর তৃতীয় রাকাআতে দাঁড়াইলেন । আমি তখন তাহার এত নিকটবর্তী ছিলাম যে, আমার কাপড় তাহার কাপড়কে প্রায় স্পর্শ করিতেছিল। সেই সময় আমি তাহাকে সূরা ফাতিহা ও (নিচের) আয়াতটি পাঠ করিতে শুনিয়াছিঃ (‏رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ‏) অর্থঃ হে আমাদের প্রতিপালক সরলপথ প্রদর্শনের পর তুমি আমাদের অন্তরকে সত্য-লংঘনপ্রবণ করিও না এবং তোমার নিকট হইতে আমাদিগকে করুণা দাও, তুমিই মহাদাতা। (সূরা আলে ইমরানঃ ৮)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 173,
			"arabicnumber": 173,
			"text": "রেওয়ায়ত ২৬. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) যখন একা নামায পড়িতেন তখন চার রাকআত বিশিষ্ট নামাযের প্রত্যেক রাকআতে সূরা ফাতিহার সঙ্গে একটি সূরা পাঠ করিতেন। আর এমনও হইত যে, ফরয নামাযের এক রাকাআতে দুই-তিনটি সূরা একসাথেও পাঠ করিতেন। আর মাগরিবের নামাযে প্রথম দুই রাক’আতে সূরা ফাতিহার সাথে একটি করিয়া সূরা পড়িতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 174,
			"arabicnumber": 174,
			"text": "রেওয়ায়ত ২৭. আদী ইবন সাবিত আনসারী (রহঃ) হইতে বর্ণিত, বারা ইবন আযির (রাঃ) বলিয়াছেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহিত ইশার নামায পড়িয়ছিলাম। তিনি সেই নামাযে সূরা[1] (والتِّينِ وَالزَّيْتُونِ) পড়িয়ছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 175,
			"arabicnumber": 175,
			"text": "রেওয়ায়ত ২৮. ইবরাহীম ইবন আবদিল্লাহ ইবন হুনায়ন (রহঃ) তাহার পিতা হইতে তিনি আলী ইবন আবি তালিব (রাঃ) হইতে বর্ণনা করিয়াছেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (قَسِّيِّ) ও (معصفر) (পুরুষদিগকে) পরিধান করিতে নিষেধ করিয়াছেন, আরও নিষেধ করিয়াছেন পুরুষদিগকে স্বর্ণের আংটি ব্যবহার করিতে। রুকূতে কুরআন পাঠ করিতেও তিনি নিষেধ করিয়াছেন। قَسِّيِّ রেখাযুক্ত এক প্রকার রেশমী বস্ত্র এবং (معصفر) হলুদ বর্ণের বস্ত্র।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 176,
			"arabicnumber": 176,
			"text": "রেওয়ায়ত ২৯. আবু হাযিম তাম্মার (রহঃ) কর্তৃক বায়াযী (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদল লোকের কাছে আগমন করিলেন, সেই সময় তাহারা (ক্ষুদ্র ক্ষুদ্র দলে বিভক্ত হইয়া) নামায পড়িতেছিলেন এবং উচ্চকণ্ঠে কুরআন পড়িতেছিলেন। ইহা দেখিয়া তিনি বলিলেনঃ নামাযরত ব্যক্তি তাহার প্রতিপালকের সাথে মোনাজাত করে, কাজেই তাহার খেয়াল রাখা উচিত যে, কিরূপে তাহার প্রভুর সহিত আলাপ করিতেছে। আর তোমরা সরবে (নামাযে) কুরআন পাঠে একে অপরের সাথে প্রতিযোগিতা করিও না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 177,
			"arabicnumber": 177,
			"text": "রেওয়ায়ত ৩০. হুমায়দ-এ তবীল (রহঃ) হইতে বর্ণিত, আনাস ইবন মালিক (রাঃ) বলিয়াছেনঃ আমি আবু বকর, উমর, উসমান (রাঃ)-এর পশ্চাতে (নামাযে) দাঁড়াইয়াছি। তাহাদের কেউই নামায আরম্ভ করার পর (‏بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ) সরবে পড়িতেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 178,
			"arabicnumber": 178,
			"text": "রেওয়ায়ত ৩১. আবু সুহায়ল ইবন মালিক (রহঃ) কর্তৃক তাহার পিতা হইতে বর্ণিত-তিনি বলিয়াছেনঃ আমরা বলাত (بلاط) নামক স্থানে অবস্থিত আবু জুহায়মের বাড়ি হইতে উমর (রাঃ)-এর কিরা'আত শুনিতাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 179,
			"arabicnumber": 179,
			"text": "রেওয়ায়ত ৩২. নাফি' (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ)-এর নিয়ম ছিলঃ যে নামাযে ইমাম সরবে কিরা'আত পড়িতেন সেই নামাযে ইমামের সহিত কিছু অংশ ছুটিয়া গেলে ইমাম সালাম ফিরাইবার পর আবদুল্লাহ্ (রাঃ) দাঁড়াইয়া অবশিষ্ট নামায সরবে কিরা'আত সহকারে পড়িতেন। ইয়াযিদ ইবন রূমান (রহঃ) হইতে বর্ণিত, তিনি বলিয়াছেনঃ আমি নাফি’ ইবন যুবায়র ইবন মুতায়িম-এর পার্শ্বে দাঁড়াইয়া নামায পড়িতাম। তিনি আমাকে হস্ত দ্বারা যখন চাপ দিতেন অর্থাৎ ইশারা করিতেন তখন আমি তাহাকে কিরা'আত বলিয়া দিতাম, অথচ আমরা উভয়েই তখন নামাযে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 180,
			"arabicnumber": 180,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 181,
			"arabicnumber": 181,
			"text": "রেওয়ায়ত ৩৩. হিশাম ইবন উরওয়া (রহঃ) তাহার পিতা হইতে বর্ণনা করিয়াছেন, আবু বকর সিদ্দীক (রাঃ) ফজরের নামাযে পড়িলেন, তিনি ফজরের উভয় রাকাআতে সূরা বাকারা পাঠ করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 182,
			"arabicnumber": 182,
			"text": "রেওয়ায়ত ৩৪. হিশাম ইবন উরওয়া (রহঃ) তাহার পিতা হইতে বর্ণনা করিয়াছেন যে, তিনি আবদুল্লাহ ইবন আমির ইবন রবী’আ-কে বলিতে শুনিয়াছেনঃ আমরা উমর ইবন খাত্তাব (রাঃ)-এর পিছনে ফজরের নামায পড়িয়াছি। তিনি ফজরের নামাযে সূরা ইউসুফ ও সূরা হাজ্জ ধীরেসুস্থে পাঠ করিয়াছিলেন। তিনি (হিশাম-এর পিতা) বলিলেনঃ তখন তো ফজর হইয়া যাইত অর্থাৎ চতুর্দিক আলোকিত হইয়া উঠিত। তিনি (আবদুল্লাহ ইবন আমির ইবন রবী’আ) বললেনঃ হ্যাঁ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 183,
			"arabicnumber": 183,
			"text": "রেওয়ায়ত ৩৫. কাসিম ইবন মুহাম্মদ (রহঃ) হইতে বর্ণিত, ফারাফিসা ইবন উমাইর আল-হানাফি (রহঃ) বলিয়াছেনঃ উসমান ইবন আফফান (রাঃ) ফজরের নামাযে প্রায় সূরা ইউসূফ পাঠ করিতেন। তাহার (পুনঃ পুনঃ) তিলাওয়াত হইতেই আমি উক্ত সূরা কণ্ঠস্থ করিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 184,
			"arabicnumber": 184,
			"text": "রেওয়ায়ত ৩৬. নাফি’ (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবন উমর (রাঃ) ফজরের নামাযে ‘মুফাসসাল’ -এর প্রথম দশটি সূরা হইতে পাঠ করিতেন; প্রতি রাকাআতে উম্মুল কুরআন (ফাতিহা) এবং একটি সূরা।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 185,
			"arabicnumber": 185,
			"text": "রেওয়ায়ত ৩৭. আলী ইবন আবদুর রহমান ইবন ইয়াকুব (রহঃ) হইতে বর্ণিত, ‘আমির ইবন কুরায়য’-এর মাওলা আবূ সাঈদ (রহঃ) তাহার নিকট বর্ণনা করিয়াছেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উবাই ইবন কা'ব (রাঃ)-কে ডাকিলেন, তখন তিনি নামায পড়িতেছিলেন। নামায শেষ করিয়া তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সমীপে হাযির হইলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আপন হাত তাহার হাতের উপর রাখিলেন, তখন তিনি (উবাই ইবন কা'ব) মসজিদের দরজা দিয়া বাহির হইতে চাহিতেছিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাকে বললেন, আমার ইচ্ছা যে, তুমি একটি সূরা জ্ঞাত না হইয়া মসজিদ হইতে বাহির হইবে না। সূরাটি এইরূপ যে, উহার সমতুল্য কোন সূরা তওরীত, ইঞ্জিল এমন কি খোদ কুরআনেও অবতীর্ণ হয় নাই। উবাই (রাঃ) বলিলেনঃ ইহা শুনিয়া সূরাটি জানিবার বাসনায় আমি ধীরে ধীরে চলিতে লাগিলাম। অতঃপর আমি বলিলামঃ হে আল্লাহ্‌র রাসূল! যেই সূরাটি জ্ঞাত করাইবার বিষয় আপনি আমাকে বলিয়াছেন, তাহা কোন সূরা? তিনি বললেন, তুমি নামায আরম্ভ করার পর কিরূপে কিরাআত পড়। উবাই (রাঃ) বলেন, আমি সূরা ফাতিহা (‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏) হইতে শেষ পর্যন্ত তাহাকে পড়িয়া শুনাইলাম। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ইহাই সেই সূরা। (যে সূরার কথা বলিয়াছিলাম) এ সূরার নামই (السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ) যাহা আমাকে প্রদান করা হইয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 186,
			"arabicnumber": 186,
			"text": "রেওয়ায়ত ৩৮. আবু নুয়ায়ম ওহ্‌ব ইবন কায়সান (রহঃ) হইতে বর্ণিত, তিনি জাবির ইবন আবদুল্লাহ্ (রাঃ)-কে বলিতে শুনিয়াছেনঃ যে ব্যক্তি এমন এক রাকাআত নামায পড়িয়াছে যাহাতে সূরা ফাতিহা পাঠ করে নাই তাহার নামায হয় নাই, অবশ্য যদি সেই ব্যক্তি ইমামের পশ্চাতে (নামায পড়িয়া) থাকে (তবে তাহার নামায শুদ্ধ হইয়াছে।)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 187,
			"arabicnumber": 187,
			"text": "রেওয়ায়ত ৩৯. আবুস সায়িব মাওলা’ হিশাম ইবন যুহরা (রহঃ) হইতে বর্ণিত, তিনি আবু হুরায়রা (রাঃ)-কে এইরূপ বর্ণনা করিতে শুনিয়াছেনঃ আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলিতে শুনিয়াছি, যে ব্যক্তি নামায পড়িয়াছে, কিন্তু সে নামাযে উম্মুল কুরআন পড়ে নাই, তাহার নামায অসম্পূর্ণ, অসম্পূর্ণ, অসম্পূর্ণ-না-তামাম। আবুস সায়িব (রহঃ) বলিলেনঃ আমি প্রশ্ন করিলাম, হে আবু হুরায়রা (রাঃ)! আমি অনেক সময় ইমামের পিছনে (নামায পড়িয়া) থাকি (তখন কিভাবে পড়িব?)। তিনি আমার বাজুতে চিমটি কাটিয়া বলিলেনঃ হে পারস্যের অধিবাসী! তুমি উহা মনে মনে পড়। কেননা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলিতে শুনিয়াছিঃ আল্লাহ তা'আলা বলিয়াছেন- আমি নামাযকে (সূরা ফাতিহাকে) আমার বান্দা ও আমার মধ্যে আধা-আধি ভাগ করিয়াছি। উহার অর্ধেক আমার, অর্ধেক আমার বান্দার। আর আমার বান্দার জন্য তাহাই যাহা সে চায়। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ তোমরা পাঠ কর; (الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ) (বিশ্ব জগতের প্রতিপালক আল্লাহরই প্রাপ্য সমস্ত প্রশংসা), আল্লাহ (ইহার উত্তরে) বলেনঃ আমার বান্দা আমার প্রশংসা করিয়াছে। বান্দা বলে (الرَّحْمَٰنِ الرَّحِيمِ) (যিনি দয়াময়, পরম দয়ালু) আল্লাহ বলেনঃ আমার বান্দা আমার গুন বর্ণনা করিয়াছে। বান্দা বলে (مَالِكِ يَوْمِ الدِّينِ) (কর্মফল দিবসের মালিক), আল্লাহ্‌ বলেনঃ আমার বান্দা আমার শ্রেষ্ঠত্ব বর্ণনা করিয়াছে। বান্দা বলে (إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ) (আমরা শুধু তোমারই ইবাদত করি, শুধু তোমারই সাহায্য প্রার্থনা করি), আল্লাহ বলেনঃ এই আয়াতটি আমার ও আমার বান্দার মধ্যে আধা-আধি বিভক্ত। আর আমার বান্দার জন্য তাহাই যাহা সে চায়। বান্দা বলেঃ (اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ) (আমাদিগকে সরলপথ প্রদর্শন কর, যাহাদিগকে তুমি অনুগ্রহ দান করিয়াছ, যাহারা ক্রোধ-নিপতিত নহে, পথভ্রষ্ট নহে।) আল্লাহ্ বলেনঃ এই আয়াতগুলি আমার বান্দারই। (অর্থাৎ এই প্রার্থনা আমার বান্দার পক্ষ হইতে) এবং তাহার জন্য উহা যাহা সে চায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 188,
			"arabicnumber": 188,
			"text": "রেওয়ায়ত ৪০. হিশাম ইবন উরওয়া (রহঃ) তাহার পিতা হইতে বর্ণনা করিয়াছেনঃ ইমাম যে সকল নামাযে নীরবে কিরাআত পড়িতেন সেই নামাযে তিনি ইমামের পিছনে কিরাআত পড়িতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 189,
			"arabicnumber": 189,
			"text": "রেওয়ায়ত ৪১. কাসিম ইবন মুহাম্মদ (রহঃ) যেসব নামাযে ইমাম কিরাআত সরবে পড়িতেন না সেসব নামাযে ইমামের পিছনে কিরাআত পড়িতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 190,
			"arabicnumber": 190,
			"text": "রেওয়ায়ত ৪২. মালিক (রহঃ) য়াযিদ ইবন রূমান (রহঃ) হইতে বর্ণনা করেন; যেসব নামাযে ইমাম সরবে কিরাআত পড়িতেন না সেই সব নামাযে নাফি ইবন জুবায়র ইবন মুতয়িম (রহঃ) ইমামের পিছনে কিরাআত পড়িতেন। ইয়াহইয়া (রহঃ) বর্ণনা করিয়াছেন যে, মালিক (রহঃ) বলিয়াছেন- এই বিষয়ে আমি যাহা শুনিয়াছি তন্মধ্যে ইহাই আমার মনঃপূত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 191,
			"arabicnumber": 191,
			"text": "রেওয়ায়ত ৪৩. নাফি’ (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ)-কে প্রশ্ন করা হইত, ইমামের পিছনে কেউ কুরআন পাঠ করিবে কি? তিনি বলিতেনঃ তোমাদের কেউ যখন ইমামের পিছনে নামায পড়ে তখন ইমামের কিরাআতই তাহার জন্য যথেষ্ট। আর একা নামায পড়িলে অবশ্য কুরআন পাঠ করিবে। আবদুল্লাহ ইবন উমর (রাঃ) নিজেও ইমামের পিছনে কুরআন পাঠ করিতেন না। ইয়াহইয়া (রহঃ) বলেনঃ আমি মালিক (রহঃ)-কে বলিতে শুনিয়াছিঃ আমার মতে যেসব নামাযে ইমাম সরবে কুরআন পাঠ করেন সেসব নামাযে মুকতাদিগণ কিরাআত হইতে বিরত থাকিবেন। আর যেসব নামাযে ইমাম নীরবে কুরআন পাঠ করেন সেসব নামাযে তাহারা কুরআন পাঠ করিবেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 192,
			"arabicnumber": 192,
			"text": "রেওয়ায়ত ৪৪. ইবন উকায়মা লায়সী (রহঃ) আবূ হুরায়রা (রাঃ) হইতে বর্ণনা করিয়াছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সরবে কুরআন পাঠ করা হইয়াছে এমন একটি নামায সমাপ্ত করিলেন। অতঃপর বললেনঃ তোমাদের কেউ এখন (নামাযে) আমার সাথে কুরআন পড়িয়াছ কি? উত্তরে এক ব্যক্তি বলিলঃ হ্যাঁ, আমি পড়িয়াছিলাম, ইয়া রাসূলাল্লাহ্! আবু হুরায়রা (রাঃ) বলিলেনঃ ইহার পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ আমি (মনে মনে) বলিতেছিলাম, আমার কী হইল, কুরআন পাঠে আমার সাথে মুকাবিলা করা হইতেছে কেন! ইহা শুনিয়া লোকেরা (নামাযে ইমামের পিছনে) কুরআন পড়া হইতে বিরত হইলেন। যে নামাযে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সরবে কুরআন পাঠ করিয়াছিলেন, সেইরূপ নামাযেই তিনি (কোন সাহাবী কর্তৃক কুরআন পড়িতে) শুনিয়াছিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 193,
			"arabicnumber": 193,
			"text": "আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ যখন ইমাম আমীন (امين) বলেন তখন তোমরাও আমীন বল। কেননা যাহার আমীন ফেরেশতাদের আমীন-এর সহিত একত্রে উচ্চারিত হয় তাহার পূর্বের গুনাহ মাফ করা হয়। ইবন শিহাব (রহঃ) (এই হাদীসের একজন রাবী) বলিয়াছেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিতেন, আমীন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 194,
			"arabicnumber": 194,
			"text": "রেওয়ায়ত ৪৫. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ ইমাম যখন (غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ) বলিবেন তখন তোমরা আমীন বলিও। যাহার বাক্য ফেরেশতাদের (আমীন) বাক্যের সহিত মিলিত হইবে তাহার পূর্বের গুনাহ মাফ করা হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 195,
			"arabicnumber": 195,
			"text": "রেওয়ায়ত ৪৬. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ যখন তোমাদের কেউ আমীন বলে তখন আসমানের ফেরেশতাগণও আমীন বলেন। ফলে যদি এক আমীন (যাহা তোমাদের কেউ বলিয়াছে) দ্বিতীয় আমীন'-এর সাথে (যাহা ফেরেশতাগণ বলিয়াছেন) মিলিত হয় তবে তাহার পূর্বের সকল গুনাহ্ ক্ষমা করা হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 196,
			"arabicnumber": 196,
			"text": "রেওয়ায়ত ৪৭. আবূ হুরায়রা (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ ইমাম (سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ) বলিলে তোমরা বলিবে (اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ) কেননা যাহার বাক্য ফেরেশতাদের বাক্যের সহিত মিলিত হয় তাহার পূর্বের পাপসমূহ মাফ করা হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 197,
			"arabicnumber": 197,
			"text": "রেওয়ায়ত ৪৮. মুসলিম ইবন আবু মারইয়াম (রহঃ) আলী ইবন আবদুর রহমান মূআবী (রহঃ) হইতে বর্ণনা করেন যে, তিনি বলিয়াছেনঃ আবদুল্লাহ ইবন উমর (রাঃ) আমাকে দেখিলেন, আমি ছোট ছোট কংকর লইয়া নামাযে খেলিতেছি। আমি নামায পড়িয়া ফিরিলে তিনি আমাকে এইরূপ করিতে নিষেধ করিলেন এবং বলিলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (নামাযে) যেরূপ করিয়াছেন তুমিও সেইরূপ করবে। আমি (আলী ইবন আবদুর রহমান) বলিলামঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিরূপ করিতেন? তিনি (আবদুল্লাহ ইবন উমর) বললেনঃ আত্তাহিয়াতু পড়ার জন্য নামাযে যখন বসিতেন, তখন তিনি ডান করতল ডান উরুর উপর রাখিতেন এবং হাতের আঙুলগুলি সংকুচিত করিয়া নিতেন। অতঃপর ইবহাম-এর (ابهام) (বৃদ্ধাঙ্গুলির পার্শ্বপতী আঙুল) দ্বারা ইশারা করিতেন এবং বাম করতলকে বাম উরুর উপর রাখিতেন, তিনি তারপর বলিলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এইরূপই করিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 198,
			"arabicnumber": 198,
			"text": "রেওয়ায়ত ৪৯. আবদুল্লাহ ইবন দীনার (রহঃ) আবদুল্লাহ ইবন উমর (রাঃ) হইতে শুনিয়াছেন যে, তাহার পার্শ্বে এক ব্যক্তি নামায পড়িলেন। যখন তিনি চার রাকাআতের পর বসিলেন তখন পিড়িতে বসার মত বসিলেন। পা দুইটি বিছাইয়া দিলেন। নামায সমাপ্ত করার পর আবদুল্লাহ (রাঃ) তাহাকে এইরূপ বসার জন্য দোষারোপ করিলেন। ঐ ব্যক্তি বলিলেনঃ আপনি যে এইরূপভাবে বসেন! আবদুল্লাহ ইবন উমর (রাঃ) বললেনঃ আমার রোগ আছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 199,
			"arabicnumber": 199,
			"text": "রেওয়ায়ত ৫০. মুগীরা ইবন হাকীম (রহঃ) হইতে বর্ণিত, তিনি আবদুল্লাহ ইবন উমর (রাঃ)-কে দুই সিজদার মাজখানে তাহার উভয় পায়ের গোড়ালির উপর বসিতে দেখিয়াছেন। নামায শেষ করার পর তাহার নিকট এ বিষয়ে উত্থাপন করা হইলে, তিনি বলিলেনঃ ইহা নামাযের সুন্নত নহে। আমি অসুস্থতার কারণে এইভাবে বসি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 200,
			"arabicnumber": 200,
			"text": "রেওয়ায়ত ৫১. আবদুর রহমান ইবন কাসিম (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন আবদুল্লাহ ইবন উমর (রহঃ) তাহার নিকট বর্ণনা করিয়াছেন যে, তিনি আবদুল্লাহ ইবন উমর (রাঃ)-কে নামাযে বসাকালে পিড়িতে বসার মত (চার জানু) হইয়া বসিতে দেখিতেন। তিনি আরও বলিয়াছেনঃ আমিও (উহা দেখিয়া) সেইভাবে বসিলাম। তখন আমি তরুণ। আবদুল্লাহ ইবন উমর (রাঃ) আমাকে (এইভাবে বসিতে) নিষেধ করিলেন এবং বলিলেনঃ নামাযের সুন্নত হইতেছে ডান পা খাড়া রাখিয়া বাম পা বিছাইয়া দেওয়া। আমি বলিয়া উঠিলামঃ আপনি যে এইরূপ করেন (পিড়িতে বসার মত বসেন)। তিনি বলিলেনঃ আমর পদদ্বয় (বসিবার সময়) আমার ভার বহন করিতে অক্ষম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 201,
			"arabicnumber": 201,
			"text": "রেওয়ায়ত ৫২. ইয়াহইয়া ইবন সাঈদ (রহঃ) বলিয়াছেনঃ কাসিম ইবন মুহাম্মদ (রহঃ) ‘আমাদিগকে ‘আত্তাহিয়্যাতু’ পড়ার সময় বসার নিয়ম দেখাইলেন। তিনি ডান পা খাড়া রাখলেন এবং বাম পা বিছাইয়া দিলেন। পায়ের উপর না বসিয়া বাম নিতম্বের উপর বসিলেন। অতঃপর বলিলেনঃ আবদুল্লাহ ইবন আবদুল্লাহ ইবন উমর (রহঃ) আমাকে বসার এইরূপ পদ্ধতি দেখাইয়াছেন এবং তিনি বলিয়াছেনঃ তাহার পিতা এইরূপ করিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 202,
			"arabicnumber": 202,
			"text": "রেওয়ায়ত ৫৩. আবদুর রহমান ইবন আবদুল কারী (রহঃ) হইতে বর্ণিত, তিনি উমর ইবনুল খাত্তাব (রাঃ)-কে মিম্বরে আরোহণ করিয়া লোকদিগকে তাশাহহুদ তালীম দিতে শুনিয়াছেন। التَّحِيَّاتُ لِلَّهِ الزَّاكِيَاتُ لِلَّهِ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ তিনি বলতেনঃ আত্তাহিয়্যাতু লিল্লাহিয যাকিয়াতু লিল্লাহিত তায়্যিবাতু আসসালাওয়াতু লিল্লাহি আসসালামু আলাইকা আইয়ুহান্নাবিয়্যু ওয়া রহমাতুল্লাহি ওয়া বারাকাতুহু আসসালামু আলাইনা ওআলা ইবাদিল্লাহিস সালিহিনা আশহাদু আল লা-ইলাহা ইল্লাল্লাহু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রসূলুহু।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 203,
			"arabicnumber": 203,
			"text": "রেওয়ায়ত ৫৪. নাফি (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) তাশাহহুদ এইরূপ পড়িতেনঃ بِسْمِ اللَّهِ التَّحِيَّاتُ لِلَّهِ الصَّلَوَاتُ لِلَّهِ الزَّاكِيَاتُ لِلَّهِ السَّلاَمُ عَلَى النَّبِيِّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ شَهِدْتُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ شَهِدْتُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ বিস্মিল্লাহি আত্তাহিয়্যাতু লিল্লাহি আস্‌সালাওয়াতু লিল্লাহি আযযাকিয়াতু লিল্লাহি, আসসালামু আলাননাবিয়্যি ওয়া রহমাতুল্লাহি ওয়া বারাকাতুহু আসসালামু আলাইনা ও'আলা ইবাদিল্লাহিস সালিহীন। শাহিদ্‌তু আল-লা ইলাহা ইল্লাল্লাহু শাহিদতু আন্না মুহাম্মাদার রাসূলুল্লাহ্। প্রথম দুই রাকাআতের পর তিনি উক্ত তাশাহহুদ পাঠ করিতেন। তাশাহহদ পাঠ সমাপ্ত করিয়া তাহার পছন্দমত দুআ পাঠ করিতেন। নামাযের সর্বশেষ রাকাআতে যখন বসিতেন তখনও অনুরূপ তাশাহুহুদ পড়িতেন । অবশ্য তিনি তাশাহহুদ আগে পাঠ করিয়া পরে যাহা ইচ্ছা দুআ পাঠ করিতেন। তারপর তাশাহহুদ পড়ার পর সালাম-এর ইচ্ছা করিলে বলিতেনঃ السَّلاَمُ عَلَى النَّبِيِّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ‏ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ السَّلاَمُ عَلَيْكُمْ প্রথমে ডান দিকে, তারপর ইমামের প্রতি অর্থাৎ সামনের দিকে সালাম দিতেন। অতঃপর কেউ বাম দিক হইতে সালাম দিলে উহার উত্তর দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 204,
			"arabicnumber": 204,
			"text": "রেওয়ায়ত ৫৫. আবদুর রহমান ইবন কাসিম (রহঃ) তাহার পিতা হইতে বর্ণনা করিয়াছেন- নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী আয়েশা (রাঃ) তাশাহুহুদ পড়ার সময় বলিতেনঃ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ الزَّاكِيَاتُ لِلَّهِ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ‏ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ‏ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ السَّلاَمُ عَلَيْكُمْ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 205,
			"arabicnumber": 205,
			"text": "রেওয়ায়ত ৫৬. ইয়াহইয়া ইবন সাঈদ (রহঃ) হইতে বর্ণিত, কাসিম ইবন মুহাম্মদ তাহাকে বলিলেন যে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) তাশাহহুদ পড়ার সময় বলিতেনঃ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ الزَّاكِيَاتُ لِلَّهِ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُ اللَّهِ وَرَسُولُهُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ السَّلاَمُ عَلَيْكُمْ মালিক (রহঃ) হইতে বর্ণিত, তিনি ইবন শিহাব ও নাফি' (মাওলা ইবন উমার) (রহঃ)-এর নিকট প্রশ্ন করিয়াছেনঃ এক ব্যক্তি জামাতে শামিল হইল, ইতিপূর্বে ইমাম এক রাকাআত শেষ করিয়াছেন, সে ইমামের সাথে দ্বিতীয় ও চতুর্থ রাক’আতে তাশাহহুদ পড়িবে কি, যদিও সে তিন রাক’আতই পড়িল? উভয়ে (উত্তরে) বলিলেনঃ হ্যাঁ, সে ইমামের সাথে তাশাহহুদ পড়িবে। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মালিক (রহঃ) বলিয়াছেনঃ আমাদের (মদীনাবাসীদের) আমলও অনুরূপ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 206,
			"arabicnumber": 206,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 207,
			"arabicnumber": 207,
			"text": "রেওয়ায়ত ৫৭. মলিহ্ ইবন আবদুল্লাহ্ সাদী (রহঃ) আবু হুরায়রা (রাঃ) হইতে বর্ণনা করেন যে, তিনি বলিয়াছেনঃ যে ব্যক্তি ইমামের পূর্বে মাথা তোলে অথবা ঝোঁকায় তাহার কপাল শয়তানের হাতে। ইয়াহইয়া (রহঃ) বলেন, মালিক (রহঃ) বলিয়াছেনঃ যে ব্যক্তি ভুলবশত রুকূ-সিজদায় ইমামের পূর্বে মাথা উঠাইয়াছে তাহার বিষয়ে সুন্নাহ বা নিয়ম হইল, সে পুনরায় রুকূ অথবা সিজদায় ফিরিয়া যাইবে। ইহাতে সে ইমামের অপেক্ষা করিবে না। কেননা যে ব্যক্তি ইহা করিয়াছে, সে ভুল করিয়াছে। কারণ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ অনুসরণের জন্যই ইমাম নিযুক্ত করা হইয়াছে। কাজেই তোমরা ইমামের বরখেলাফ করিও না। আবু হুরায়রা (রাঃ) বলিয়াছেনঃ যে ব্যক্তি ইমামের পূর্বে মাথা উঠায় অথবা ঝোঁকায় তাহার কপাল শয়তানের হাতে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 208,
			"arabicnumber": 208,
			"text": "রেওয়ায়ত ৫৮. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (একবার) দুই রাকাআত (পড়িয়া) নামায সমাপ্ত করিলেন, তখন যুল-ইয়াদায়ন (সাহাবী) তাহাকে বলিলেনঃ হে আল্লাহর রাসূল! নামায সংক্ষিপ্ত করা হইয়াছে, না আপনার ভুল হইয়াছে? ইহা শুনিয়া রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (উপস্থিত মুসল্লিদের সম্বোধন করিয়া) বলিলেনঃ যুল-ইয়াদায়ন ঠিক বলিয়াছেন কি? লোকেরা বললেনঃ হ্যাঁ। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উঠিলেন এবং শেষের দুই রাকাআত পড়িলেন, তারপর সালাম ফিরাইয়া আল্লাহু আকবার বলিয়া সিজদা করিলেন, পূর্বের মত (সিজদা) অথবা তাহা হইতে দীর্ঘ সিজদা। অতঃপর (পবিত্র) শির উঠাইলেন, পুনরায় তকবীর বলিয়া সিজদায় গেলেন, পূর্বের (সিজদার) মত অথবা উহা হইতে দীর্ঘ সিজদা, অতঃপর (পবিত্র) শির উঠাইলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 209,
			"arabicnumber": 209,
			"text": "রেওয়ায়ত ৫৯. আবু আহমদ (রহঃ)-এর পুত্রের মাওলা আবূ সুফইয়ান (রহঃ) হইতে বর্ণিত, তিনি আবু হুরায়রা (রাঃ)-কে বলিতে শুনিয়াছেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (একদা) আসরের নামায পড়িলেন, তিনি (উহাতে) দুই রাকাআতের পর সালাম ফিরাইলেন। যুল-ইয়াদায়ন দাঁড়াইয়া বলিলেনঃ হে আল্লাহ্‌র রাসূল। নামায কমাইয়া দেওয়া হইয়াছে না আপনি তুলিয়া গিয়াছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফরমাইলেন, (আমার মনে হয়) উভয়ের কোনটাই ঘটে নাই। যুল-ইয়াদায়ন বলিলেনঃ হে আল্লাহ্‌র রাসূল! একটা কিছু ঘটিয়াছে। (ইহা শোনার পর) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পবিত্র মুখমণ্ডল সাহাবাদের দিকে করিলেন এবং জিজ্ঞাসা করিলেন , যুল-ইয়াদায়ন কি ঠিক বলিতেছেন? উপস্থিত সাহাবা বলিলেনঃ হ্যাঁ। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়াইলেন এবং অবশিষ্ট নামায পূর্ণ করিলেন। তারপর সালামের পর বসা অবস্থায় দুইটি সিজদা করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 210,
			"arabicnumber": 210,
			"text": "রেওয়ায়ত ৬০. আবু বকর ইবন সুলায়মান ইবন আবি হাসমা (রহঃ) হইতে বর্ণিত, তিনি বলিয়াছেনঃ আমার নিকট রেওয়ায়ত পৌছিয়াছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দিনের কোন এক নামায- যোহর কিংবা আসরে দুই রাকাআত পড়িয়া সালাম ফিরাইলেন, তখন বনি যোহরা ইবন কিলাব গোত্রের যুশ-শিমালায়ন (রাঃ) নামক জনৈক সাহাবী বলিলেন, হে আল্লাহ্‌র রাসূল! নামায কি সংক্ষিপ্ত করা হইয়াছে, না আপনি ভুলিয়া গিয়াছেন? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফরমাইলেনঃ নামাযও সংক্ষিপ্ত করা হয় নাই, আমিও ভুলি নাই। যুশ-শিমালায়ন (রাঃ) পুনরায় বলিলেন, ইয়া রাসূলাল্লাহ! (অবশ্যই) কোন একটা হইয়াছে। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চেহারা মুবারক লোকের দিকে করিলেন এবং বলিলেনঃ যুশ-শিমালায়ন ঠিক বলিয়াছে কি? (উপস্থিত) লোকজন বলিলেনঃ হ্যাঁ। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অবশিষ্ট নামায পূর্ণ করিলেন। অতঃপর সালাম ফিরাইলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 211,
			"arabicnumber": 211,
			"text": "রেওয়ায়ত ৬১. সাঈদ ইবন মুসায়্যাব (রহঃ) এবং আবি সালামা ইবন আবদুর রহমান (রহঃ) হইতে অনুরূপ বর্ণিত আছে। ইয়াহইয়া (রহঃ) বর্ণনা করেন যে, মালিক (রহঃ) বলিয়াছেনঃ যে ভুলে নামাযে ঘাটতি হয়, উহাতে সালামের পূর্বে সিজদা করিতে হয়। আর যে ভুলে বৃদ্ধি হয় উহাতে সালামের পরে সিজদা করিতে হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 212,
			"arabicnumber": 212,
			"text": "রেওয়ায়ত ৬২. আতা ইবন ইয়াসার (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফরমাইয়াছেনঃ তোমাদের কেউ যদি নামাযের মধ্যে সন্দেহগ্ৰস্ত হয়, তদ্দরুন তিন রাকাআত পড়িয়াছে না চার রাকাআত পড়িয়াছে তাহা স্মরণ করতে না পারে তবে সে আর এক রাকাআত পড়িবে এবং বসা অবস্থায়ই সালামের পূর্বে দুইটি সিজদা করিবে। যে (এক) রাক’আত সে পড়িয়াছে তাহা যদি পঞ্চম রাকাআত হইয়া থাকে, তবে উক্ত দুই সিজদা (ষষ্ঠ রাকাআতের পরিবর্তে গণ্য করা হইবে এবং) ঐ নামাযকে জোড় নামাযে পরিণত করবে। আর যদি উহা চতুর্থ রাকাআত হয়, তবে দুই সিজদা শয়তানের অপমানের কারণ হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 213,
			"arabicnumber": 213,
			"text": "রেওয়ায়ত ৬৩. সালিম ইবন আবদুল্লাহ্ (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবন উমর (রাঃ) বলেন, তোমাদের কেউ নামাযে (কত রাকাআত পড়া হইল সে বিষয়) সন্দেহে লিপ্ত হইলে সে তাহার ধারণা মত কত রাকাআত নামায ভুলিয়া গিয়াছে, উহা স্থির করিবে এবং (সে মত) নামায পড়িবে। তারপর বসা অবস্থায় ভুলের জন্য দুইটি সিজদা করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 214,
			"arabicnumber": 214,
			"text": "রেওয়ায়ত ৬৪. আতা ইবন ইয়াসার (রহঃ) বলিয়াছেনঃ আমি আবদুল্লাহ ইবন আমর ইবন আ'স (রাঃ) এবং কা'ব আল-আহবার (রহঃ)-কে এমন এক ব্যক্তি সম্বন্ধে জিজ্ঞাসা করিয়াছি, যে ব্যক্তি নামাযে সংশয়ে লিপ্ত হয়, অতঃপর সে বলিতে পারে না কত রাকাআত পড়িয়াছে – তিন রাকাআত না চারি রাকাআত। তখন তাহারা (উত্তরে) বলিলেন যে, সে আর এক রাকাআত পড়িবে। তারপর বসা অবস্থায়ই দুইটি সিজদা করিবে। মালিক (রহঃ) নাফি’ (রহঃ) হইতে বর্ণনা করেন যে, আবদুল্লাহ্ ইবন উমর (রাঃ)-কে নামাযে ভুলিয়া যাওয়ার বিষয়ে প্রশ্ন করা হইলে (উত্তরে) তিনি বলিতেনঃ যে ব্যক্তি মনে করে যে, কিছু নামায ভুলিয়া গিয়াছে সে ভাবিয়া ঠিক করিবে, অতঃপর নামায পড়িয়া লইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 215,
			"arabicnumber": 215,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 216,
			"arabicnumber": 216,
			"text": "রেওয়ায়ত ৬৫. আবদুল্লাহ ইবন বুহায়না (রাঃ) বলিয়াছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (একবার) আমাদিগকে দুই রাকাআত নামায পড়াইয়া (আত্তাহিয়্যাতু পড়িতে না বসিয়াই) দাঁড়াইয়া গেলেন। মুসল্লিগণ তাহার সহিত দাঁড়াইলেন। তারপর যখন নামায পূর্ণ করিলেন এবং আমরা সালামের অপেক্ষায় রহিলাম তখন তিনি আল্লাহু আকবর’ বলিলেন। অতঃপর সালামের পূর্বে বসা অবস্থায়ই দুইটি সিজদা করিলেন এবং সালাম ফিরাইলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 217,
			"arabicnumber": 217,
			"text": "রেওয়ায়ত ৬৬. আবদুল্লাহ ইবন বুহায়না (রাঃ) হইতে বর্ণিত, তিনি বলিয়াছেন, (একবারের ঘটনা) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে যোহরের নামায পড়াইলেন, তিনি দুই রাকাআতের পর দাঁড়াইয়া গেলেন এবং (আত্তাহিয়্যাতু পড়ার জন্য) বসিলেন না। যখন তিনি নামায পূর্ণ করিলেন দুইটি সিজদা (সাহু সিজদা) করিলেন, অতঃপর সালাম ফিরাইলেন। মালিক (রহঃ) বলেন- যে ব্যক্তি নামাযে ভুল করে এবং চারি রাকাআত পূর্ণ করার পর দাঁড়াইয়া যায়, তারপর কিরাআত সমাপ্ত করিয়া রুকূ করে, রুকু হইতে মাথা তোলার পর তাহার স্মরণ হইল যে, সে নামায পূর্ণ পড়িয়াছিল, তখন সেই ব্যক্তি বসার দিকে প্রত্যাবর্তন করিবে এবং বসিয়া যাইবে। সে তখন আর সিজদায় যাইবে না। আর যদি দুই সিজদার এক সিজদা করিয়া থাকে তবে আমি দ্বিতীয় সিজদা করা সঙ্গত মনে করি না। অতঃপর সে যখন নামায পূর্ণ করিবে তখন দুইটি সিজদা করিবে বসা অবস্থায় সালামের পর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 218,
			"arabicnumber": 218,
			"text": "রেওয়ায়ত ৬৭. আলকামা ইবন আবি আলকামা (রহঃ) হইতে বর্ণিত, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলিয়াছেনঃ আবু জাহম ইবন হুযায়ফা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খেদমতে শামী চাদর হাদিয়াস্বরূপ পেশ করিলেন, যাহাতে ফুল, বুটা ইত্যাদি দ্বারা কারুকার্য করা ছিল। উহা পরিধান করিয়া তিনি নামায পড়িলেন। নামায হইতে ফিরিয়া তিনি ফরমাইলেন, এই চাদরখানা আবূ জাহম-এর নিকট ফিরাইয়া দাও। কেননা উহার কারুকার্যের দিকে নামাযে আমার দৃষ্টি পতিত হইয়াছে। উহা নামাযের একগ্রতা নষ্ট করিয়া আমাকে ফিতনায় লিপ্ত করিয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 219,
			"arabicnumber": 219,
			"text": "রেওয়ায়ত ৬৮. হিশাম ইবন উরওয়াহ্ (রহঃ) স্বীয় পিতা হইতে বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (একবার) শামী চাদর পরিধান করিয়াছিলেন। উহাতে ফুল, বুটা দ্বারা কারুকার্য করা ছিল; অতঃপর আবু জাহমকে উহা ফিরাইয়া দিয়া (তৎপরিবর্তে) আবূ জাহম হইতে আমবিজানিয়া (মোটা পশমী কাপড়) গ্রহণ করিলেন। ইহার কারণ ব্যাখ্যা করিয়া রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফরমাইলেন, নামাযে ইহার কারুকার্যের প্রতি আমার দৃষ্টি পতিত হইয়াছে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 220,
			"arabicnumber": 220,
			"text": "রেওয়ায়ত ৬৯. আবদুল্লাহ ইবন আবু বকর (রহঃ) বর্ণনা করেন যে, আবূ তালহা আনসারী (রাঃ) একবার তাহার এক বাগানে নামায পড়িতেছিলেন। ইতিমধ্যে একটি ছোট পাখি উড়িতে শুরু করিল, (বাগান এত ঘন ছিল যে এই ক্ষুদ্র পাখিটি পথ খুঁজিয়া পাইতেছিল না), তাই পাখিটি এদিক-সেদিক বাহির হওয়ার পথ খুঁজিতে আরম্ভ করিল। এই দৃশ্য তাহার খুব ভাল লাগিল। ফলে তিনি কিছুক্ষণ সেইদিকে তাকাইয়া রহিলেন। তারপর নামাযের দিকে মনোযোগ দিলেন। কিন্তু (অবস্থা এই দাঁড়াইল) তিনি (তখন) স্মরণ করিতে পারিলেন না যে, নামায কত রাকাআত পড়িয়াছেন। তিনি বলিলেনঃ এই মাল আমাকে পরীক্ষায় ফেলিয়াছে। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খেদমতে উপস্থিত হইলেন এবং বাগানে তাহার সম্মুখে যে পরীক্ষা উপস্থিত হইয়াছিল উহা বিবৃত করিলেন। তারপর বলিলেনঃ হে আল্লাহর রাসূল! এই মাল আল্লাহর জন্য উৎসর্গ করিতেছি। আপনি যেখানে পছন্দ করেন উহাকে সেইখানে ব্যয় করুন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 221,
			"arabicnumber": 221,
			"text": "রেওয়ায়ত ৭০. আবদুল্লাহ্ ইবন আবু বকর (রহঃ) হইতে বর্ণিত, আনসারী এক ব্যক্তি মদীনার উপত্যকাসমূহের মধ্যে কুফ নামক উপত্যকায় তাহার এক বাগানে নামায পড়িতেছিলেন, তখন ছিল (খেজুরের) মওসুম। খেজুরের গাছগুলি খেজুরের ভারে ঝুঁকিয়া পড়িতেছিল। গাছগুলি যেন স্বীয় ফলগুচ্ছের হার পরিহিত। ফলের এ দৃশ্যটি তাহার খুবই মনঃপূত হইল। তাই সেইদিকে চাহিয়া রছিলেন। অতঃপর নামাযের দিকে মনোযোগী হইলেন। কিন্তু তাহার আর স্মরণ হইতেছিল না যে, তিনি কত রাকাআত নামায পড়িয়াছেন। ইহা দেখিয়া তিনি বলিলেন, আমার এই সম্পত্তি আমার জন্য ফিতনারূপে উপস্থিত হইয়াছে। তখন ছিল উসমান (রাঃ)-এর খিলাফতকাল। তিনি উসমান ইবন আফফান (রাঃ)-এর নিকট হাজির হইলেন এবং তাহার নিকট ঘটনা বিবৃত করিলেন। তারপর বলিলেনঃ উক্ত সম্পদ আল্লাহর পথে উৎসর্গ করা হইল। ইহাকে সৎকাজে ব্যয় করুন। উসমান (রাঃ) উহাকে পঞ্চাশ হাজার (দিরহাম)-এর বিনিময়ে বিক্রি করিলেন। (এই কারণে) উক্ত সম্পত্তির নাম রাখা হইল (খমসিন) বা পঞ্চাশ হাজারী।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 221
			}
		}
	]
}