{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"36": "Judgements"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1399,
			"arabicnumber": 1399,
			"text": "রেওয়ায়ত ১. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী উম্মে সালমা (রাঃ) হইতে বর্ণিত আছে যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, আমি একজন মানুষ, তোমরা আমার নিকট ঝগড়া-বিবাদ লইয়া আস। এমনও হইতে পারে যে, একে অপরের তুলনায় অধিক চালাকী ও চাতুরির আশ্রয় লইবে এবং নিজ দাবি প্রমাণিত করিবে এবং আমি তাহার বাহ্যিক প্রমাণের দিকে লক্ষ্য করিয়া তাহার পক্ষে রায় দিয়া দিব। সুতরাং এমতাবস্থায় যদি আমি অপরের হক কাহাকেও দিয়া দেই তবে তাহার জন্য উক্ত বস্তু গ্রহণ করা উচিত নহে। কেননা উহা তাহার জন্য আগুনের টুকরা।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1399
			}
		},
		{
			"hadithnumber": 1400,
			"arabicnumber": 1400,
			"text": "রেওয়ায়ত ২. সাঈদ ইবন মুসায়্যাব (রহঃ) হইতে বর্ণিত, একদা উমর (রাঃ)-এর দরবারে এক ইহুদী ও এক মুসলিম কোন বিবাদ লইয়া আসিল। উমর (রাঃ) বুঝিতে পারিলেন যে, ইহুদীর দাবি সত্য। তাই ইহুদীর সপক্ষে রায় দিয়া দিলেন। ইহুদী সর্বশেষে বলিল, আল্লাহর কসম, আপনি হক ফায়সালা করিয়াছেন। ইহা শুনিয়া উমর (রাঃ) তাহাকে বেত্র দ্বারা আঘাত করিয়া বলিলেন, কিভাবে জানিতে পারিয়াছ যে, এই বিচার হক হইয়াছে? ইহুদী বলিল, আমি আমাদের আসমানী কিতাবে দেখিয়াছি যে, যে বিচারক সত্য ফয়সালা করে তাহার ডান দিকের এবং বাম দিকের কাধে একজন করিয়া ফেরেশতা থাকেন। তাহারা তাহাকে শক্তিশালী রাখে এবং সৎ পথ দেখাইতে থাকে যতক্ষণ সে হকের উপর থাকে। আর যদি সে হককে ছাড়িয়া দেয় তবে ফেরেশতারাও তাহাকে ছাড়িয়া ঊর্ধ্বজগতে উঠিয়া যায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1400
			}
		},
		{
			"hadithnumber": 1401,
			"arabicnumber": 1401,
			"text": "রেওয়ায়ত ৩. যায়দ ইবন খালেদ জুহানী (রাঃ) হইতে বর্ণিত আছে যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, আমি কি তোমাদিগকে সর্বোত্তম সাক্ষীর কথা বলিব? তাহা হইল, যে জিজ্ঞাসা করার পূর্বেই সাক্ষ্য প্রদান করে অথবা যে সাক্ষ্য প্রদান করে তাহাকে জিজ্ঞাসা করার পূর্বেই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1401
			}
		},
		{
			"hadithnumber": 1402,
			"arabicnumber": 1402,
			"text": "রেওয়ায়ত ৪. রাবিয়া ইবন আবি আবদির রহমান হইতে বর্ণিত যে, উমর (রাঃ)-এর দরবারে ইরাক হইতে এক ব্যক্তি আসিয়া বলিল, আমি এমন এক ব্যাপার লইয়া আসিয়াছি যাহার কোন আগ-পাছ কিছুই নাই। উমর (রাঃ) বলিলেন, “তাহা কি?” সে বলিল আমাদের দেশে মিথ্যা সাক্ষ্য ছড়াইয়া পড়িয়াছে। উমর (রাঃ) বলিলেন, তুমি কি সত্যই বলিতেছ? সে বলিল, হ্যাঁ, তখন উমর (রাঃ) বলিলেন, ভবিষ্যতে নির্ভরযোগ্য ও ন্যায়পরায়ণ সাক্ষীর সাক্ষ্য ব্যতীত কোন মুসলিমকে কয়েদ করা যাইবে না। মালিক (রহঃ) বলেনঃ উমর (রাঃ) বলেন যে, শত্রু এবং দীনের ব্যাপারে দোষারোপ করা হইয়াছে এমন লোকদের সাক্ষ্য জায়েয হইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1402
			}
		},
		{
			"hadithnumber": 1403,
			"arabicnumber": 1403,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1403
			}
		},
		{
			"hadithnumber": 1404,
			"arabicnumber": 1404,
			"text": "মালিক (রহঃ) বলেন যে, সুলায়মান ইবন ইয়াসার (রহঃ)-সহ আরো কয়েকজনকে জিজ্ঞাসা করা হইয়াছিল যে, যে ব্যক্তি অপবাদের দায়ে শাস্তিপ্রাপ্ত তাহার সাক্ষ্য গ্রহণযোগ্য হইবে কি? তাহারা বলিলেন, হ্যাঁ যখন সে তওবা করিয়াছে বলিয়া জানা যাইবে। মালিক (রহঃ) বলেন যে, ইমাম জুহরী (রহঃ)-কে ঐরুপ প্রশ্ন করা হইয়াছিল। তিনিও সুলায়মান ইবন ইয়াসারের মতো উত্তর দিয়াছিলেন। মালিক (রহঃ) বলেনঃ আমার মতও অনুরূপ, কেননা আল্লাহ্ তা'আলা বলেন যে, যে ব্যক্তি নেককার স্ত্রীলোকের উপর মিথ্যা অপবাদ দেয় এবং চারজন সাক্ষী হাযির করিতে না পারে তবে তাহাদিগকে আশি দোররা মার, অতঃপর কোন সময় তাহার সাক্ষ্য কবুল করিও না, কেননা, ইহারাই পাপাচারী। হ্যাঁ, পরে যাহারা তওবা করিয়া নেয় এবং সংশোধন হইয়া যায় তবে আল্লাহ নিশ্চয়ই ক্ষমাকারী ও দয়াবান। মালিক (রহঃ) বলেন, এই ব্যাপারে আমাদের নিকট কোন মতভেদ নাই যে, যাহার উপরে অপবাদের শাস্তি হইয়াছে অতঃপর সংশোধন হইয়াছে তাহার সাক্ষ্য গ্রহণ করা যায় এবং আমি যাহা এই ব্যাপারে জানিয়াছি, তাহার মধ্যে ইহাই খুব পছন্দনীয় কথা।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1404
			}
		},
		{
			"hadithnumber": 1405,
			"arabicnumber": 1405,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1405
			}
		},
		{
			"hadithnumber": 1406,
			"arabicnumber": 1406,
			"text": "রেওয়ায়ত ৫. জাফর সাদিক (রহঃ) তাহার পিতা মুহাম্মদ (রহঃ) হইতে বর্ণনা করেন যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাক্ষী ও কসমের উপর ফয়সালা করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1406
			}
		},
		{
			"hadithnumber": 1407,
			"arabicnumber": 1407,
			"text": "রেওয়ায়ত ৬. আবূ যিনাদ (রহঃ) হইতে বর্ণিত যে, উমর ইবন আবদিল আযীয (রহঃ) কুফার শাসনকর্তা আবদুল হামিদ ইবন আবদির রহমানকে লিখিয়া পাঠাইলেন যে, সাক্ষীর সাথে কসম গ্রহণ করিয়া ফয়সালা করিয়া লইতে পার।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1407
			}
		},
		{
			"hadithnumber": 1408,
			"arabicnumber": 1408,
			"text": "রেওয়ায়ত ৭. মালিক (রহঃ) বলেন যে, আবু সালমা ও সুলায়মান ইবন ইয়াসার (রহঃ)-কে জিজ্ঞাসা করা হইয়াছিল যে, সাক্ষী ও কসমের দ্বারা ফয়সালা করা যাইবে কি? উত্তরে তাহারা বলিলেন, হ্যাঁ। মালিক (রহঃ) বলেন যে, একজন সাক্ষীর সাথে বাঁদীর কসম গ্রহণের প্রথা পূর্ব হইতে প্রচলিত হইয়া আসিতেছে। সে যদি কসম করে তবে তাহার দাবি প্রমাণিত হইবে। আর যদি সে কসম করিতে ভয় পায় অথবা অস্বীকার করে তবে বিবাদীকে কসম দেওয়া হইবে। যদি বিবাদী কসম করিয়া নেয় তবে ঐ হক (পাওনা) বিবাদীর উপর হইতে এড়াইয়া যাইবে। আর যদি সেও কসম করিতে অস্বীকার করে তবে পুনরায় বাঁদীর দাবি তাহার উপর ন্যস্ত হইবে। মালিক (রহঃ) বলেন যে, কসমসহ সাক্ষ্য শুধু মালের বেলায় চলিবে, হুদুদ (শরীয়তের শাস্তি), বিবাহ, তালাক, গোলাম আযাদ, চুরি ও অপবাদের মধ্যে চলিবে না। অতঃপর যদি কেহ বলে যে, গোলাম আযাদ মালের মধ্যে শামিল, তবে সে ভুল করিবে। কারণ ব্যাপার অন্য রকম, যদি এমন হইত যে, সে বলিয়াছে তবে গোলাম একজন সাক্ষীসহ হাযির হইলে কসম লইয়া তাহাকে আযাদ করিয়া দেওয়া উচিত ছিল। আর যদি গোলাম একজন সাক্ষী আনে কোন মালের ব্যাপারে যে, সে মালিকের উপর দাবি করে তবে সেই ক্ষেত্রে একজন সাক্ষীসহ কসম লওয়া হইবে এবং তাহার হক প্রমাণিত হইবে। যেমন আযাদ মানুষ হলফ করিলে হয়। মালিক (রহঃ) বলেনঃ আমাদের নিকট গ্রহণযোগ্য নিয়ম এই যে, গোলাম যদি তাহার আযাদ হওয়ার সপক্ষে একজন সাক্ষী লইয়া আসে তবে তাহার মনিবকে কসম দেওয়া হইবে যে, তাহার গোলামকে আযাদ করে নাই। তাহা হইলেই গোলামের আযাদী প্রমাণিত হইবে না। মালিক (রহঃ) বলেন যে, এই নিয়ম তালাকের ব্যাপারেও। যদি কোন স্ত্রী লোক তালাকের ব্যাপারে একজন সাক্ষী লইয়া আসে তবে স্বামীকেও কসম করানো হইবে। যদি স্বামী তালাক না দেওয়ার উপর কসম করে তবে তালাক প্রমাণিত হইবে না। মালিক (রহঃ) বলেন যে, এইভাবেই তালাক ও আযাদ-এর সাক্ষ্যের মধ্যে এক সাক্ষী থাকিলে স্বামী ও মনিবকে কসম করানো হইবে। কেননা আযাদ করা (ই’তাক) একটি শরীয়তী সীমারেখার মধ্য হইতে একটি, তাহার মধ্যে স্ত্রীলোকদের সাক্ষ্য জায়েয নাই। কেননা গোলাম আযাদ হইয়া গেলেই তাহার মর্যাদা প্রতিষ্ঠিত হইয়া যায় এবং তাহার কারণে শাস্তি অন্যের উপর পতিত হয় এবং অন্যের কারণে শাস্তি তাহার উপর পতিত হয়। সে যদি যিনা করে এবং বিবাহিত হয় তবে তাহাকে রজম (প্রস্তর নিক্ষেপ) করা হইবে। আর যদি সে হত্যা করে তবে তাহার বদলায় তাহাকেও হত্যা করা হইবে এবং তাহার ওয়ারিসগণ মীরাস দাবি করিতে পারিবে। কেহ যদি প্রশ্ন করে যে, যদি কোন মনিব তাহার গোলামকে আযাদ করে এবং কোন ব্যক্তি আসিয়া গোলামের মনিবের নিকট নিজের কর্জ দাবি করে এবং তাহার সপক্ষে একজন পুরুষ ও দুইজন মহিলাকে সাক্ষীরূপে পেশ কবে তবে মনিবের উপর কর্য প্রমাণিত হইয়া যাইবে। আর যদি মনিবের নিকট এই গোলাম ছাড়া আর কোন সম্পদ না থাকে তবে গোলামের আযাদী ভঙ্গ হইয়া যাইবে। ইহার দ্বারা প্রমাণিত হয় যে, আযাদীর ব্যাপারে মেয়েদের সাক্ষ্য গ্রহণযোগ্য। তাহার উত্তর এই যে, এখানে মেয়েদের সাক্ষ্য কর্জ প্রমাণের জন্য গ্রহণযোগ্য। গোলাম আযাদের ব্যাপারে নহে। তাহার উদাহরণ এইরূপ যে, যদি কোন লোক তাহার গোলামকে আযাদ করিয়া দেয়, অতঃপর তাহার পাওনাদারগণ এক সাক্ষী ও কসমের দ্বারা নিজের দাবি প্রমাণিত করে এবং ইহার কারণে গোলামের আযাদী বাতিল করিয়া দেওয়া হইবে। অথবা কেহ গোলামের মনিবের উপর কর্জের দাবি করে এবং সাক্ষী না থাকে তবে মনিব হইতে কসম গ্রহণ করা হইবে। যদি কসম করিতে অস্বীকার করে তবে বাদীর নিকট হইতে কসম লওয়া হইবে এবং কর্জ মনিবের উপর প্রমাণিত হইবে এবং গোলামের আযাদী বাতিল হইবে। এমনিভাবে যদি কেহ কোন দাসীকে বিবাহ করে এবং দাসীর মনিব স্বামীকে বলে যে, তুমি এবং অমুক ব্যক্তি মিলিয়া আমার অমুক দাসীকে এত টাকায় খরিদ করিয়াছ। স্বামী সম্পূর্ণরূপে অস্বীকার করিল। এদিকে মনিব যদি একজন পুরুষ ও দুইজন স্ত্রী লোক সাক্ষীরূপে পেশ করে তবে এই অবস্থাতে বিক্রয় প্রমাণিত হইয়া যাইবে এবং সে হকদার হইয়া যাইবে ও বিবাহ হারাম হইয়া যাইবে এবং বিবাহ ভঙ্গ হইয়া যাইবে। অথচ স্ত্রীলোকের সাক্ষ্য তালাকের ব্যাপারে জায়েয নাই। মালিক (রহঃ) বলেনঃ এইরূপভাবে যদি কেহ কোন আযাদ লোকের প্রতি যিনার অপবাদ দেয় তবে তাহার উপর শরীয়তের হুদুদ (শাস্তি) আসিবে। আর যদি একজন পুরুষ ও দুইজন স্ত্রীলোককে সাক্ষীরূপে আনে এবং তাহারা সাক্ষ্য দেয় যে, যাহার উপর অপবাদ দেওয়া হইতেছে সে গোলাম তবে অপবাদকারীর উপর হইতে শাস্তি রহিত হইয়া যাইবে। অথচ স্ত্রীলোকদের সাক্ষ্য অপবাদের মধ্যে চলে না। মালিক (রহঃ) বলেন যে, যাহার মধ্যে বিচার ভিন্নরূপ হয় তাহার উদাহরণ এইরূপ — যেমন দুইজন স্ত্রীলোক সাক্ষ্য দিল যে, এই বাচ্চা জীবিত অবস্থায় ভূমিষ্ঠ হইয়াছে, তাহা হইলে এই বাচ্চার জন্য মীরাস প্রমাণিত হইবে এবং এই সন্তানের উত্তরাধিকার যে সেই মীরাসের মালিক হইবে, যদি সন্তান মৃত্যুবরণ করে এইখানেও দুইজন স্ত্রীলোকের সাথে কোন পুরুষ নাই কিংবা কসমও নাই। কোন সময় মীরাসের মাল অনেক হইয়া থাকে, যেমন স্বর্ণ, রৌপ্য, জমি, বাগান, গোলাম, ইহা ছাড়া অন্যান্য সম্পদ আর যদি একটি দিরহাম অথবা তাহাঁর চাইতেও কম বা অধিক মালের ব্যাপারে দুইজন স্ত্রীলোক সাক্ষ্য প্রদান কবে তবে তাহদের সাক্ষ্যের দ্বারা কোন পরিবর্তন হইবে না এবং কার্যকরীও হইবে না, যতক্ষণ তাহাদের সাথে একজন পুরুষ সাক্ষ্য না থাকিবে অথবা কসম না থাকিবে। মালিক (রহঃ) বলেন যে, কোন কোন লোক বলে যে, একজন সাক্ষীর সাথে কসম প্রয়োজন হয় না এবং দলীলস্বরূপ এই আয়াত পেশ করে, “আল্লাহর কথা সত্য; যদি দুইজন পুরুষ না পাওয়া যায় তবে একজন পুরুষ ও দুইজন স্ত্রীলোককে, যাহারা তোমাদের মনঃপূত হয় সাক্ষী মনোনীত কর।” তাহারা বলে যে, একজন পুরুষ ও দুইজন স্ত্রীলোক না হইলে তাহাদের জন্য কিছুই নাই। একজন সাক্ষীর সঙ্গে কসমও গ্রহণ করা হয় না। মালিক (রহঃ) উত্তরে বলেনঃ যাহারা এরূপ বলে, তাহাদের বলা হইবে যে, তুমি কি দেখ না যে যদি কেহ কাহারো নিকট অর্থ দাবি করে তবে বিবাদীর নিকট হইতে কি কসম লওয়া হয় না? যদি সে কসম করে তবে তাহার উপর দাবিকৃত হক বাতিল হইয়া যায়। আর যদি সে কসম করিতে অস্বীকার করে তবে দাবিদারকে কসম দেওয়া হইবে যে, তাহার দাবি সত্য, তাহা হইলে হক তাহার উপর অবধারিত হইয়া যাইবে। এই মাসআলায় কোন মানুষের মতভেদ নাই, আর কোন দেশের লোকেরও ইহাতে মতভেদ নাই। তবে তোমরা এই কথা কোথা হইতে আনিয়াছ? এবং আল্লাহর কোন কিতাব হইতে সংগ্রহ করিয়াছ? যদি তোমাদের নিকট ইহা জায়েয থাকে তবে একজন সাক্ষীর সাথে কসমের কথাও স্বীকার করিয়া লও। ইহা যদিও কুরআনে নাই, হাদীসে তো আছে। এই ব্যাপারে যেই সমস্ত হাদীস বর্ণিত হইয়াছে তাহাই যথেষ্ট, কিন্তু যদি সত্য কথা পাওয়া যায় তাহা মানিয়া লওয়াই কর্তব্য এবং দলীলের বিষয়গুলি দেখা প্রয়োজন। আল্লাহর ইচ্ছায় কঠিন বিষয় সহজ হইয়া যাইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1408
			}
		},
		{
			"hadithnumber": 1409,
			"arabicnumber": 1409,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1409
			}
		},
		{
			"hadithnumber": 1410,
			"arabicnumber": 1410,
			"text": "রেওয়ায়ত ৯. হিশাম ইবন উরওয়াহ (রহঃ) হইতে বর্ণিত যে, আবদুল্লাহ্ ইবন যুবায়র (রহঃ) বালকদের সাক্ষ্যের উপর ভিত্তি করিয়া তাহাদের মারামারির বিচার করিয়া দিতেন। মালিক (রহঃ) বলেনঃ আমাদের নিকট এই হুকুম যে, যদি বালকগণ একে অপরকে আহত করিয়া দেয় তবে তাহাদের সাক্ষ্য বৈধ। ইহা ছাড়া অন্য মামলায় তাহা বৈধ হইবে না। ইহা ঐ সময় হইবে যখন ঝগড়া করিয়া সেখানেই থাকে, অন্যত্র না গিয়া থাকে। যদি অন্যত্র চলিয়া যায় তবে তাহাদের সাক্ষ্য জায়েয নহে। যতক্ষণ না কোন নির্ভরযোগ্য মানুষের সাক্ষ্য গ্রহণ করা হয় এবং বালকগণও ঐখানেই থাকে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1410
			}
		},
		{
			"hadithnumber": 1411,
			"arabicnumber": 1411,
			"text": "রেওয়ায়ত ১০. জাবির ইবন আবদুল্লাহ্ (রাঃ) হইতে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, আমার মিম্বরে যে মিথ্যা কসম করে সে যেন তাহার স্থান দোযখে বানাইয়া লয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1411
			}
		},
		{
			"hadithnumber": 1412,
			"arabicnumber": 1412,
			"text": "রেওয়ায়ত ১১. আবু উমামা (রাঃ) হইতে বর্ণিত যে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, যে ব্যক্তি মিথ্যা কসম করিয়া কোন মুসলিম ভাইয়ের সম্পদ আত্মসাৎ করে তাহার জন্য আল্লাহ তা'আলা বেহেশত হারাম করিয়া দিবেন এবং দোযখ ওয়াজিব করিয়া দিবেন। সাহাবীগণ বলিলেন, যদি সামান্য জিনিসও হয় তবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, যদিও পিলু গাছের একটি ডাল হয়, যদিও পিলু গাছের একটি ডাল হয়, যদিও পিলু গাছের একটি ডাল হয়, তিনি এই বাক্যকে তিনবার বলিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1412
			}
		},
		{
			"hadithnumber": 1413,
			"arabicnumber": 1413,
			"text": "রেওয়ায়ত ১২. আবু গাতফান (রহঃ) হইতে বর্ণিত যে, যায়দ ইবন সাবিত (রাঃ) ও ইবন মুতী-এর মধ্যে একটি ঘরের ব্যাপারে ঝগড়া হইয়া যায়। অবশেষে তাহারা ইহার বিচার মারওয়ানের নিকট লইয়া গেলেন। সেই সময় তিনি মদীনার শাসনকর্তা ছিলেন। মারওয়ান বলিলেন, যায়দ ইবন সাবিত মিম্বরের উপর উঠিয়া কসম করিয়া নিক। যায়দ (রাঃ) বললেন, আমি আমার স্থানে দাঁড়াইয়া কসম করিয়া লই। মারওয়ান বলিলেন, আল্লাহর কসম, ইহা হইতে পারে না। অন্য লোকেরা যেখানে তাহাদের হকের মীমাংসা করে সেখানেই করিতে হইবে। অতঃপর যায়দ (রাঃ) নিজ স্থানে দাঁড়াইয়া বলিতে লাগিলেন, আমি কসম করিয়া বলিতেছি যে, আমার দাবি সত্য, কিন্তু মিম্বরের উপর গিয়া কসম করিতে অস্বীকার করিতে লাগিলেন। মারওয়ান ইহাতে বিক্ষিত হইয়া গেলেন। মালিক (রহঃ) বলেন যে, এক-চতুর্থাংশ দীনারের কম দাবি হইলে মিম্বরের কসম করা জায়েয নাই, উহা তিন দিরহাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1413
			}
		},
		{
			"hadithnumber": 1414,
			"arabicnumber": 1414,
			"text": "রেওয়ায়ত ১৩. সাঈদ ইবন মুসায়্যাব (রহঃ) হইতে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, “রেহেনকে বন্ধ করা উচিত নয়।” মালিক (রহঃ) বলেন যে ইহার ব্যাখ্যা আমাদের নিকট এই যে, (আল্লাহ্ই ভাল জানেন) এক ব্যক্তি কিছু জিনিস অপর ব্যক্তির নিকট রেহেন রাখিল কোন জিনিসের পরিবর্তে। আর রেহেন-এর বস্তুটি মূল্যবান যে জিনিসের পরিবর্তে রাখা হইয়াছে তাহার চাইতে। অতঃপর রেহেন (গচ্ছিতকারী) মুরতাহেনকে (যাহার নিকট রাখা হইয়াছে) বলিল, আমি যদি নির্দিষ্ট তারিখে আপনার জিনিস লইয়া আসি তবে আমার জিনিস আমাকে দিবেন আর যদি আমি ঐ সময় না আসিতে পারি তবে গচ্ছিত মাল আপনার। এইরূপ করা জায়েয নাই এবং হালালও নহে। ইহাই নিষিদ্ধ করা হইয়াছে। যদি নির্দিষ্ট দিনের পরে ঐ ব্যক্তি আসে তবে রেহেনের বস্তু তাহারই হইবে। আর এই শর্ত বাতিল হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1414
			}
		},
		{
			"hadithnumber": 1415,
			"arabicnumber": 1415,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1415
			}
		},
		{
			"hadithnumber": 1416,
			"arabicnumber": 1416,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1416
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": 1417,
			"text": "রেওয়ায়ত ১৬. মুহাম্মাদ ইবন আবদুল্লাহ (রহঃ) তাহার পিতা হইতে বর্ণনা করেন যে, আবু মূসা আশ'আরী (রাঃ)-এর নিকট হইতে এক ব্যক্তি উমর (রাঃ)-এর নিকট আসিল। উমর (রাঃ) তাহাকে জিজ্ঞাসা করিলেন সেখানের লোকের কি অবস্থা? সে সেখানের অবস্থা বর্ণনা করিল। অতঃপর উমর (রাঃ) বললেন, সেখানে কোন নূতন ব্যক্তি ইসলাম গ্রহণ করার পর আবার কাফের হইয়া গেলে তোমরা তাহাকে কি করিয়াছ? সে বলিল, তাহাকে বন্দী করিয়া শিরোচ্ছেদ করিয়াছি। উমর (রাঃ) বললেন, তোমরা যদি তাহাকে তিন দিন পর্যন্ত বন্দী করিয়া রাখিতে আর খাইতে শুধু ১টি রুটি দিতে এবং তওবা করাইতে তবে হয়ত সে তওবা করিত এবং আল্লাহর দীনের দিকে আসিয়া যাইত। অতঃপর উমর (রাঃ) বলিলেন, হে আল্লাহ আমি ঐ কাজে শামিল ছিলাম না, মারার হুকুমও দেই নাই, কিংবা তাহার খবর শুনিয়াও খুশী হই নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1417
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": 1418,
			"text": "রেওয়ায়ত ১৭. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, সা'দ ইবন উবাদা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করিয়াছিলেন যে, আমি যদি আমার স্ত্রীর সাথে অপর লোককে দেখি তবে কি তাহাকে সময় দিব যতক্ষণ চারজন সাক্ষী যোগাড় না করিতে পারি? উত্তরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, হ্যাঁ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1418
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": 1419,
			"text": "রেওয়ায়ত ১৮. সাঈদ ইবন মুসায়্যাব হইতে বর্ণিত একজন সিরিয়াবাসী তাহার স্ত্রীর সাথে অপর একজনকে (লিপ্ত) দেখিতে পাইয়া তাহাকে অথবা দুইজনকে মারিয়া ফেলিল। মু'আবিয়া (রাঃ) আবূ মূসা আশ আরী (রাঃ)-এর নিকট লিখিয়া পাঠাইলেন যে, আলী (রাঃ)-এর নিকট জিজ্ঞাসা করিয়া আমাকে জানাও তাহার কি সমাধান? অতঃপর আবু মূসা (রাঃ) তাঁহাকে জিজ্ঞাসা করিলেন। তিনি বলেন, এই ঘটনা আমার দেশের বলিয়া মনে হয় না। সত্য করিয়া বল কোন দেশের ঘটনা, আমার মনে হয় তুমি আমাকে পরীক্ষা করিতেছ। আবু মূসা (রাঃ) বলিলেন, মু'আবিয়া (রাঃ) আমার নিকট লিখিয়া পাঠাইয়াছেন আপনাকে জিজ্ঞাসা করার জন্য; আলী (রাঃ) বলিলেন, আমি হইলাম আবুল হাসান (হাসানের পিতা) যদি চার জন সাক্ষী আনিতে পারে তবে যেন তাহাকে উত্তমরূপে বন্দী করা হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1419
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": 1420,
			"text": "রেওয়ায়ত ১৯. সুনাইন ইবন আবী জমিলা (রহঃ) বনী সুলায়মান বংশোদ্ভূত, তিনি উমর (রাঃ)-এর জামানায় একটি শিশু পাইয়াছিলেন। তিনি বলেন যে, তাহাকে আমি উঠাইয়া উমর (রাঃ)-এর দরবারে হাযির হইলাম। উমর (রাঃ) বলিলেন, তুমি তাহাকে কেন উঠাইয়াছ? তিনি বলিলেন, আমি তাহাকে উঠাইয়া না আনিলে সে ধ্বংস হইয়া যাইত। এমন সময় পরিচিত এক ব্যক্তি বলিল, হে আমিরুল মু'মিনীন, আমি এই ব্যক্তিকে চিনি, সে খুব নেককার লোক। উমর (রাঃ) বলিলেন, সত্যই কি সে নেককার? সে বলিল, হ্যাঁ। অতঃপর উমর (রাঃ) বলিলেন, তুমি চলিয়া যাও, এই সন্তান আযাদ (মুক্ত), তুমি তাহার অভিভাবকত্ব পাইবে। আর আমরা তাহার খরচাদি বহন করিব। মালিক (রহঃ) বলেনঃ আমাদের নিকট হারানো প্রাপ্ত সন্তান আযাদ। তাহার অভিভাবকত্ব মুসলিমদের জন্য, তাহারাই তাহার উত্তরাধিকারী এবং তাহারাই তাহার পক্ষে হইতে দীয়্যত (ক্ষতিপূরণ) দেবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1420
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": 1421,
			"text": "রেওয়ায়ত ২০. নবী করীম সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের সহধর্মিণী আয়েশা (রাঃ) হইতে বর্ণিত, তিনি বলিয়াছেন, উতবা ইবন আবী ওয়াক্কাস (রাঃ) মৃত্যুর সময় তাহার ভাই সা'দ ইবন আবী ওয়াক্কাসকে বলিয়া গিয়াছিলেন যে, যামআ’-এর দাসীর সন্তান আমার, তুমি তাহাকে লইয়া আসিও। আয়েশা (রাঃ) বলেন যে, মক্কা বিজয়ের দিন সা’দ ঐ সন্তানকে আনিলেন ও গ্রহণ করিলেন এবং তিনি বলিলেন, সে আমার ভাই-এর সন্তান। তিনি আমাকে মৃত্যুর সময় অঙ্গীকার করাইয়াছিলেন। এইদিকে আবদ ইবন যামআ (রাঃ) বলিলেন, সে আমার ভাই এবং আমার পিতার দাসীর ছেলে ও আমার পিতার ঘরে জন্মগ্রহণ করিয়াছে। অবশেষে দুইজন বিতর্ক করিয়া রাসূলুল্লাহ্ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট আসিলেন। সা'দ বলিলেন, ইয়া রাসূলাল্লাহ্ সে আমার ভাইয়ের সন্তান, মৃত্যুকালে আমার ভাই আমাকে অঙ্গীকার করাইয়া গিয়াছিল। অতঃপর আবদ ইবন যামআ' বলিলেন, আমার ভাই আমার পিতার দাসীর গর্ভে ও আমার পিতার ঘরে জন্মগ্রহণ করিয়াছে। তাহার পর সব শুনিয়া রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, ‘হে আবদ ইবন যামআ', সে তোমারই ভাই, সে তোমারই কাছে থাকিবে। অতঃপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, সন্তান তাহার মাতার স্বামীর অথবা মনিবেরই হইয়া থাকে আর ব্যভিচারীর জন্য প্রস্তরই নির্ধারিত। অতঃপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাওদা বিনুত যামআকে বলেন, হে সাওদা! এই সন্তান হইতে পর্দা কর, কেননা তাহার আকৃতি উৎবার সদৃশ। অতঃপর সে আর সাওদাকে তাহার মৃত্যু পর্যন্ত দেখে নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1421
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": 1422,
			"text": "রেওয়ায়ত ২১. আবদুল্লাহ ইবন আবী উমাইয়া (রাঃ) হইতে বর্ণিত যে, এক স্ত্রীলোকের স্বামীর ইন্তেকাল হয়। অতঃপর চার মাস দশ দিন ইদ্দত পালন করার পর অন্য একজনের নিকট তাহার বিবাহ হয়। বিবাহের পর সেই স্বামীর নিকট সাড়ে চার মাস অতিবাহিত করার পর তাহার একটি পূর্ণাঙ্গ সন্তান ভূমিষ্ঠ হইল। অতঃপর তাহার স্বামী উমর (রাঃ)-এর নিকট আসিয়া সমস্ত ঘটনা বর্ণনা করিল। উমর (রাঃ) অন্ধকার যুগের কয়েকজন বৃদ্ধা স্ত্রীলোককে ডাকাইলেন এবং তাহাদিগকে এই সম্বন্ধে প্রশ্ন করিলেন। তখন তাহাদের একজন বলিল, আমি আপনাকে তাহার বৃত্তান্ত বলিতেছি। এই স্ত্রীলোকটি তাহার মৃত স্বামী হইতে গর্ভবতী হইয়াছিল। সন্তান গর্ভে থাকা অবস্থায় তাহার রক্তস্রাব হইল, ইহাতে সন্তান শুকাইয়া যায়। অতঃপর দ্বিতীয় বিবাহের পর স্বামী তাহার সহিত সংগত হওয়ায় সন্তানের উপর পুরুষের বীর্য পতিত হয়। ইহাতে সন্তান নড়াচড়া করে এবং বড় হইতে থাকে। অতঃপর উমর (রাঃ) তাহাদের কথা সত্য বলিয়া মানিলেন এবং বিবাহ ভঙ্গ করিয়া দিলেন এবং বলিলেন যে, তোমাদের সম্বন্ধে কোন খারাপ কথা আমি শুনি নাই। অতঃপর সন্তানটি প্রথম স্বামীর ঔরসজাত বলিয়া সিদ্ধান্ত দিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1422
			}
		},
		{
			"hadithnumber": 1423,
			"arabicnumber": 1423,
			"text": "রেওয়ায়ত ২২. সুলায়মান ইবন ইয়াসার (রহঃ) হইতে বর্ণিত, উমর (রাঃ) অন্ধকার যুগের সন্তানকে যদি কেহ ইসলামের যুগে দাবি করিত তবে তাহার সাথে মিলাইয়া দিতেন। একবার দুইজন লোক একটি সন্তানকে নিজের বলিয়া দাবি করে। অতঃপর উমর (রাঃ) কেয়াফাবিদকে (লক্ষণ দেখিয়া পরিচয় নির্ণয়কারী) ডাকিয়া পাঠাইলেন। কেয়াফাবিশারদ সন্তানকে দেখিয়া বলিল, সন্তান দুইজনেরই। অতঃপর উমর (রাঃ) তাহাকে দোররা দ্বারা আঘাত করিলেন। তাহার পর সন্তানের মাতাকে ডাকাইয়া বলিলেন তোমার বৃত্তান্ত খুলিয়া বল। সে একজনের দিকে ইঙ্গিত করিয়া বলিল যে, সে আমার নিকট আসা-যাওয়া করিত এবং আমি আমার বাড়ির উটের ঘরের কাছে থাকিতাম। ঐ সময়ে সে আমার সাথে সঙ্গম করিত। অতঃপর সে যখন ধারণা করিতে পারিল যে, আমি গর্ভবতী হইয়াছি তখন সে আর কাছে আসিত না, আর আমার রক্তস্রাব দেখা যাইত। তারপর এই দ্বিতীয়জন তাহার পর আমার নিকট আসিল। সেও আমার সহিত সঙ্গম করিল। এখন আমি জানি না, এই সন্তান দুইজনের মধ্য হইতে কাহার। ইহা শুনিয়া কেয়াফাবিদ খুশিতে আল্লাহু আকবর (আল্লাহ্ মহান) বলিয়া উঠিল। অতঃপর উমর (রাঃ) সন্তানকে বলিলেন, যাহার সাথে খুশি তুমি যাইতে পার।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1423
			}
		},
		{
			"hadithnumber": 1424,
			"arabicnumber": 1424,
			"text": "রেওয়ায়ত ২৩. মালিক (রহঃ) বলেন যে, উমর (রাঃ) অথবা উসমান (রাঃ) এই দুইজনের মধ্যে একজন এক স্ত্রীলোকের ফয়সালা করিয়াছিলেন। সেই স্ত্রীলোকটি ধোঁকা দিয়া একজনকে বলিল, আমি আযাদ এবং তাহার সহিত বিবাহ বন্ধনে আবদ্ধ হইল। অতঃপর তাহাদের সন্তান হইয়াছিল। ফয়সালা দেওয়া হইয়াছিল, স্বামী তাহার সন্তানের মতো বালক-বালিকা স্ত্রীলোকটির মনিবকে দিবে এবং নিজের সন্তান মুক্ত করিয়া লইবে। মালিক (রহঃ) বলেন, এই স্থানে মূল্য দান করিয়া দেওয়াই উত্তম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1424
			}
		},
		{
			"hadithnumber": 1425,
			"arabicnumber": 1425,
			"text": "মালিক (রহঃ) বলেনঃ আমার নিকট ইহা একটি সর্বসম্মত মাসআলা। কোন ব্যক্তি মারা যাওয়ার সময় কয়েকটি সন্তান রাখিয়া গেল। তাহাদের মধ্য হইতে কেহ বলিল, আমার পিতা বলিয়া গিয়াছেন অমুক ব্যক্তি আমার ছেলে। এই অবস্থায় একজনের সাক্ষ্যে পুত্রের সম্পর্ক প্রমাণিত হইবে না এবং সম্পত্তিও সে পাইবে না। তবে যে ছেলে স্বীকার করিয়াছে তাহার অংশ হইতে সে অংশ পাইবে। মালিক (রহঃ) ইহার ব্যাখ্যায় বলিয়াছেন যে, এক ব্যক্তি দুই ছেলে রাখিয়া মারা গেল এবং ছয়শত দীনার রাখিয়া গেল। দুই ছেলে এখান হইতে তিনশত করিয়া পাইল। তাহার পর এক ছেলে বলিল আমাদের মৃত পিতা বলিয়াছিলেন যে, ঐ ব্যক্তি তাহার ছেলে। তখন সে স্বীকার করিল তাহার তিনশত দীনার হইতে একশত দীনার সেই ব্যক্তি পাইবে, কেননা, সে মৃত ব্যক্তির ছেলে হিসাবে এই অর্ধেক অংশ পাইবে। অর্থাৎ সে ছেলে প্রমাণিত হইলে দুইশত দীনার পাইত, এখন একশত দীনার পাইয়াছে। আর যদি দ্বিতীয় ছেলেও স্বীকার করে তবে তাহার নিকট হইতেও একশত পাইবে এবং তাহার হক পূর্ণ হইবে এবং তাহার বংশও মৃত ব্যক্তি হইতে প্রমাণিত হইল। তাহার আর একটি উদাহরণ এই : কোন স্ত্রীলোক তাহার পিতা অথবা স্বামীর ঋণের কথা স্বীকার করে আর অন্যান্য অংশীদার অস্বীকার করে, এ অবস্থায় সে নিজ অংশ অনুপাতে নিজ হইতে কর্জ আদায় করিবে। স্ত্রীলোকটি যদি এক-অষ্টমাংশ পায় তবে ঋণেরও এক-অষ্টমাংশ আদায় করিবে, আর যদি পিতার সম্পত্তি অর্ধেক পায় তবে ঋণেরও অর্ধাংশ আদায় করিবে। মালিক (রহঃ) বলেনঃ যদি কোন পুরুষ ঋণের ব্যাপারে সাক্ষ্য দেয় যেমন স্ত্রীলোকটি স্বীকার করিয়াছে, যথা এই মৃতের নিকট তাহার এই পরিমাণ পাওনা আছে তবে ঋণদাতার নিকট হইতে কসম গ্রহণ করা হইবে এবং ঋণদাতার পূর্ণ কর্জ শোধ করা হইবে। কেননা এই ব্যাপার স্ত্রীলোকটির ব্যাপারের মতো নয়, কেননা পুরুষের সাক্ষ্য গ্রহণযোগ্য। আর যদি কৰ্জদার কসম না করে, তবে যে স্বীকার করিয়াছে শুধু তাহার নিবাস হইতে কর্জদারকে দেওয়া হইবে তাহার হিস্যা অনুযায়ী।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1425
			}
		},
		{
			"hadithnumber": 1426,
			"arabicnumber": 1426,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1426
			}
		},
		{
			"hadithnumber": 1427,
			"arabicnumber": 1427,
			"text": "রেওয়ায়ত ২৬. উরওয়া ইবন যুবায়র (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, যদি কেহ কোন পতিত জমি আবাদ করে তবে উহা তাহারই হইবে। উহাতে কোন জালিমের অধিকার নাই। মালিক (রহঃ) বলেন যে, জালিমের দখল বলিতে বোঝায় যে, জবরদস্তি কোন জমিতে গর্ত খনন, কিংবা গাছ লাগান, অথবা অন্য উপায়ে কজা করা। অথচ উহাতে তাহার কোন হক (অধিকার) নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1427
			}
		},
		{
			"hadithnumber": 1428,
			"arabicnumber": 1428,
			"text": "রেওয়ায়ত ২৭. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, উমর (রাঃ) বলিয়াছেন, যদি কেহ অনাবাদী জমি আবাদ করে তাহা তাহারই হইবে। মালিক (রহঃ) বলেনঃ আমাদের নিকটও এই হুকুম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1428
			}
		},
		{
			"hadithnumber": 1429,
			"arabicnumber": 1429,
			"text": "রেওয়ায়ত ২৮. আবদুল্লাহ ইবন আবী বকর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, মাহযুর ও মুযায়ানব নামক দুইটি খাল সম্বন্ধে বলিয়াছেন যে, যাহার ক্ষেত খাল সংলগ্ন সে যেন টাখনু (পায়ের গোড়ালি) পর্যন্ত পানি রাখিয়া নিম্ন এলাকার ক্ষেতসমূহের জন্য পানি ছাড়িয়া দেয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1429
			}
		},
		{
			"hadithnumber": 1430,
			"arabicnumber": 1430,
			"text": "রেওয়ায়ত ২৯. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, দরকারের চাইতে অধিক পানি বন্ধ রাখা উচিত নহে, কেননা তাহার ফলে উক্ত এলাকায় ঘাস জন্মানও বন্ধ হইয়া যাইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1430
			}
		},
		{
			"hadithnumber": 1431,
			"arabicnumber": 1431,
			"text": "রেওয়ায়ত ৩০. আমরাহ বিনত আবদির রহমান (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন যে, কূপের অবশিষ্ট পানি হইতে মানুষকে নিষেধ করা উচিত নহে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1431
			}
		},
		{
			"hadithnumber": 1432,
			"arabicnumber": 1432,
			"text": "রেওয়ায়ত ৩১. ইয়াহইয়া মাযেনী (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন যে, নিজের স্বার্থে অন্যের ক্ষতি করিবে না, তদ্রুপ পরস্পর কাহারও ক্ষতি করিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1432
			}
		},
		{
			"hadithnumber": 1433,
			"arabicnumber": 1433,
			"text": "রেওয়ায়ত ৩২. আবূ হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, কোন মুসলিমের পক্ষে তাহার প্রতিবেশীকে স্বীয় ঘরের দেওয়ালে কোন কাঠ গাড়িতে নিষেধ করা উচিত হইবে না। অতঃপর আবু হুরায়রা (রাঃ) বলেন যে, ব্যাপার কি, এই হাদীস শোনার পর তাহাদিগকে মুখ ফিরাইয়া রাখিতে দেখি কেন? আল্লাহর কসম, আমি এই হাদীস তোমাদের স্কন্ধের উপর ফেলিব অর্থাৎ খুব প্রচার করিব।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1433
			}
		},
		{
			"hadithnumber": 1434,
			"arabicnumber": 1434,
			"text": "রেওয়ায়ত ৩৩. ইয়াহইয়া মাযেনী (রহঃ) হইতে বর্ণিত, যাহহাক ইবন খলীফা, আরীট নামক স্থান হইতে একটি ছোট খাল কাটিয়া আনিলেন এবং মুহাম্মদ ইবন মাসলামা (রাঃ) এর জমির উপর দিয়া লইয়া যাইবেন বলিয়া মনস্থ করিলেন। কিন্তু তিনি তাহাতে অসম্মতি জানাইলেন। যাহহাক (রাঃ) বলিলেন, আপনি নিষেধ করিতেছেন কেন? তাহাতে আপনার জমিরও উপকার সাধিত হইবে, আপনি প্রথম হইতে শেষ পর্যন্ত জমিতে পানি সেচ করিতে পারবেন। আপনার কোন অসুবিধাই হইবে না। কিন্তু ইবন মাসলামা (রাঃ) কিছুতেই সম্মত হইতেছেন না দেখিয়া যাহহাক (রাঃ) উমর (রাঃ)-এর সাথে আলাপ করিলেন। উমর (রাঃ) ইবন মাসলামাকে ডাকাইয়া বলিলেন, তুমি খালটি তোমার জমির উপর দিয়া লইয়া যাইতে দাও। ইবন মাসলামা (রাঃ) বলিলেন, আল্লাহর কসম, এইরূপ হইবে না। উমর (রহঃ) বলিলেন, তুমি কেন নিষেধ করিতেছ? ইহার দ্বারা তোমার ভাইয়ের ও তোমার উপকার হইবে। তুমিও তোমার জমিতে পানি সেচ করিতে পারিবে অথচ তোমার কোন ক্ষতিই হইবে না। মুহাম্মদ ইবন মাসলাম (রাঃ) বলিলেন, আল্লাহর কসম, তাহা হইবে না। উমর (রাঃ) বলিলেন, আল্লাহর কসম, খাল প্রবাহিত করা হইবে যদিও তোমার পেটের ভিতর দিয়া হয়। অতঃপর উমর (রাঃ) ইবন মাসলামার জমির উপর দিয়া খাল খননের নির্দেশ দিলেন। যাহহাক (রাঃ) তাহাই করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1434
			}
		},
		{
			"hadithnumber": 1435,
			"arabicnumber": 1435,
			"text": "রেওয়ায়ত ৩৪. ইয়াহইয়া ইবন মাযেনী (রাঃ) বলেনঃ আবদুর রহমান ইবন আওফ (রাঃ)-এর একটি ছোট খাল আমার দাদার জমির উপর দিয়া প্রবাহিত হইতেছিল। আবদুর রহমান (রাঃ) চাহিলেন যেন খালটি অন্যত্র দিয়া প্রবাহিত হয়, যেন তাহার জমির নিকটবর্তী হয়। অতঃপর আমার দাদা নিষেধ করিলেন। আবদুর রহমান (রাঃ) উমর (রাঃ)-এর নিকট এই বিষয়ে আলাপ করিলেন। উমর (রাঃ) পরে তাহাকে অনুমতি দান করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1435
			}
		},
		{
			"hadithnumber": 1436,
			"arabicnumber": 1436,
			"text": "রেওয়ায়ত ৩৫. সওর ইবন যায়দ দীলী (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাম আলায়হি ওয়া সাল্লাম বলিয়াছেন, যেকোন ঘর অথবা জমি অন্ধকার যুগে বন্টন করা হইয়াছে তাহা ঐ অনুযায়ীই থাকিবে। আর যেকোন ঘর অথবা জমি আজ পর্যন্ত বন্টন হয় নাই উহা ইসলামী বিধান অনুযায়ী বন্টিত হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1436
			}
		},
		{
			"hadithnumber": 1437,
			"arabicnumber": 1437,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1437
			}
		},
		{
			"hadithnumber": 1438,
			"arabicnumber": 1438,
			"text": "রেওয়ায়ত ৩৮. ইয়াহয়া ইবন আবদির রহমান (রহঃ) হইতে বর্ণিত, একদা হাতিব (রাঃ)-এর এক ক্রীতদাস কাহারো উট চুরি করিয়া জবাই করিয়া ফেলে। ইহার মামলা উমর (রাঃ)-এর দরবারে গেলে তিনি কাসীর ইবন সলত (রাঃ)-কে নির্দেশ দিলেন যে, ঐ ক্রীতদাসের হাত কাটিয়া ফেল। অতঃপর তিনি হাতিব (রাঃ)-এর দিকে তাকাইয়া বলিলেন, আমার মনে হয় যে, তুমি ক্রীতদাসদিগকে অনাহারে রাখ, আল্লাহর কসম, আমি ইহার জন্য তোমার এমন জরিমানা করিব যাহা তোমার জন্য খুব ভারী হইবে। তাহার পর উটের মালিককে উটের মূল্য সম্বন্ধে জিজ্ঞাসা করিলেন। সে বলিল, ইহার মূল্য চারিশত দিরহাম। উমর (রাঃ) তাহাকে আরও চারশত দিরহাম, মোট আটশত দিরহাম দিতে বলিলেন। মালিক (রহঃ) বলেনঃ ইহাদিগের উপর আমাদের আমল নাই কিন্তু আমাদের আমল এই কথার উপর যে, যেদিন উট খরিদ করা হইয়াছে সে দিনের মূল্য দিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1438
			}
		},
		{
			"hadithnumber": 1439,
			"arabicnumber": 1439,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1439
			}
		},
		{
			"hadithnumber": 1440,
			"arabicnumber": 1440,
			"text": "রেওয়ায়ত ৪০. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী আয়েশা (রাঃ) হইতে বর্ণিত, তিনি বলেন যে, আবু বকর (রাঃ) গাবা নামক স্থানের বাগানের কিছু খেজুর গাছ আমাকে দান করিলেন। যাহার মধ্যে বিশ ওসক খেজুর উৎপন্ন হইত। অতঃপর ইন্তিকালের সময় বলিতে লাগিলেন, হে কন্যা। আল্লাহর কসম, আমার পরে তোমা হইতে সচ্ছল কেহ থাকুক আমি তাহা পছন্দ করি না, আর তুমি দরিদ্র থাক তাহাও আমার সবচাইতে বেশি অপছন্দ। আমি তোমাকে এমন খেজুর গাছ দিয়াছিলাম যাহার মধ্যে বিশ ওসক খেজুর জন্মে। তুমি যদি তাহা দখলে রাখিতে এবং ফল সংগ্ৰহ করিতে থাকিতে তবে তাহা তোমার সম্পদ হইয়া যাইত। এখন তো তাহা ওয়ারিসদের সম্পত্তি। ওয়ারিস তোমার দুই ভাই ও দুই বোন, সুতরাং উহাকে আল্লাহর কিতাব অনুসারে বন্টন করিও। আয়েশা (রাঃ) বলিলেন, হে আব্বাজান যত বড় সম্পদই হউক না কেন, আমি তাহা ছাড়িয়া দিতাম, কিন্তু আমার তো বোন শুধু একজন আসমা (রাঃ), অন্য জন কে? তিনি উত্তরে বলিলেন, (আমার স্ত্রী) বিন্‌ত খারেজা গর্ভবতী, তাহার গর্ভে যে সন্তান আছে আমার ধারণ তাহা মেয়েই হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1440
			}
		},
		{
			"hadithnumber": 1441,
			"arabicnumber": 1441,
			"text": "রেওয়ায়ত ৪১. আবদুর রহমান ইবন আবদুল কারী (রহঃ) হইতে বর্ণিত উমর (রাঃ) বলিয়াছেন যে, মানুষের হইল কি? তাহারা নিজ পুত্র-সন্তানদের জন্য হেবা করে। অতঃপর তাহা নিজেই নিজ দখলে রাখিতে চায়, যদি ছেলে মারা যায় তবে বলে যে, আমার সম্পদ আমারই দখলে আছে, আমি কাহাকেও দান করি নাই, আর যদি নিজে মারা যায় তবে বলিয়া যায় যে, ইহা আমার ছেলেরই, আমি তাহাকে দান করিয়াছি। যদি কোন হেবা করার পরে তাহা চালু না করে এবং ছেলে ওয়ারিসসুত্রে মালিক হয় তবে তাহা বাতিল হইয়া যায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1441
			}
		},
		{
			"hadithnumber": 1442,
			"arabicnumber": 1442,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1442
			}
		},
		{
			"hadithnumber": 1443,
			"arabicnumber": 1443,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1443
			}
		},
		{
			"hadithnumber": 1444,
			"arabicnumber": 1444,
			"text": "রেওয়ায়ত ৪৪. আবদুর রহমান ইবন কাসিম (রহঃ) হইতে বর্ণিত, তিনি মাকহুল দামেশকীকে কাসিম ইবন মুহাম্মদের নিকট মৃত্যু পর্যন্ত দান সম্বন্ধে প্রশ্ন করিতে শুনিয়াছেন অর্থাৎ এই ব্যাপারে মানুষের কি মতামত তাহা জানিতে চাহিয়াছেন। তখন কাসিম ইবন মুহাম্মদ (রহঃ) বলেন, আমি তো মানুষদিগকে নিজ সম্পদের মধ্যেও নিজ দানের ব্যাপারে নিজ নিজ শর্ত পূর্ণ করিতে দেখিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1444
			}
		},
		{
			"hadithnumber": 1445,
			"arabicnumber": 1445,
			"text": "রেওয়ায়ত ৪৫. নাফি’ (রহঃ) হইতে বর্ণিত, ইবন উমর (রাঃ) হাফসা বিনত উমরের একটি গৃহের ওয়ারিস হইলেন। তিনি ঐ গৃহ যায়দ ইবন খাত্তাবের কন্যাকে আজীবন থাকার জন্য দিয়াছিলেন। অতঃপর যখন যায়দের কন্যার মৃত্যু হইল তখন ইবন উমর (রাঃ) উহা দখল করিলেন এবং তিনি উহাকে নিজস্ব মনে করিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1445
			}
		},
		{
			"hadithnumber": 1446,
			"arabicnumber": 1446,
			"text": "রেওয়ায়ত ৪৬. যায়দ ইবন খালেদ জুহানী (রাঃ) হইতে বর্ণিত, এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট আসিয়া কোথাও পাওয়া জিনিস সম্বন্ধে প্রশ্ন করিলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, তাহার পাত্রটি চিনিয়া রাখ এবং তাহার বন্ধনও চিনিয়া রাখ, অতঃপর এক বৎসর পর্যন্ত মানুষের কাছে ঘোষণা করিতে থাক। যদি মালিক পাওয়া যায় তবে ফেরত দিয়া দাও; অন্যথায় তুমি নিজে ব্যবহার করিতে পার। সে বলিল, যদি ছাড়া ছাগল পাওয়া যায় তবুও। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, তাহা তোমার অথবা তোমার ভাইয়ের কিংবা বাঘের হইবে। সে পুনরায় জিজ্ঞাসা করিল, যদি ছাড়া উট পাওয়া যায় তবে কি করিব? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, সে উটের সাথে তোমার কি সম্পর্ক তাহার সাথে পান করার মতো পানি আছে এবং তাহার পা আছে যেখানে খুশী পানি পান করিয়া লইবে। গাছের পাতা খাইবে। শেষ পর্যন্ত তাহার মালিক উহা পাইয়া ফেলিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1446
			}
		},
		{
			"hadithnumber": 1447,
			"arabicnumber": 1447,
			"text": "রেওয়ায়ত ৪৭. মুয়াবিয়া ইবন আবদুল্লাহ জুহানী (রহঃ) হইতে বর্ণিত, তাহার পিতা বলিয়াছেন যে, তিনি সিরিয়ার পথে এক মঞ্জিলে একটি তোড়া পাইলেন। তাহাতে আশিটি দীনার ছিল। তিনি ইহা উমর (রাঃ)-এর নিকট বর্ণনা করিলেন। উমর (রাঃ) বলিলেন, ইহাকে মসজিদসমূহের দরজায় ঘোষণা কর। আর যাহারা সিরিয়া হইতে আসে তাহাদিগকে এক বৎসর পর্যন্ত জিজ্ঞাসা কর। যদি এক বৎসর অতিবাহিত হয় তাহা হইলে তখন তোমার ইচ্ছা।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1447
			}
		},
		{
			"hadithnumber": 1448,
			"arabicnumber": 1448,
			"text": "রেওয়ায়ত ৪৮. নাফি' (রহঃ) হইতে বর্ণিত, এক ব্যক্তি রাস্তায় কিছু পাইল। সে উহা লইয়া ইবন উমর (রাঃ)-এর নিকট আসিয়া বলিল, আমি একটি জিনিস পাইয়াছি, এই ব্যাপারে আপনার মত কি? আবদুল্লাহ্ ইবন উমর (রাঃ) তাহাকে বললেন, তাহা প্রচার কর। সে বলিল, আমি তাহা করিয়াছি। ইবন উমর (রাঃ) বললেন, পুনরায় ঘোষণা কর। সে বলিল, তাহাও করিয়াছি। ইবন উমর (রাঃ) বলিলেন, আমি তোমাকে ব্যবহার করিতে বলিব না। তুমি উহা নাও উঠাইতে পারিতে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1448
			}
		},
		{
			"hadithnumber": 1449,
			"arabicnumber": 1449,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1449
			}
		},
		{
			"hadithnumber": 1450,
			"arabicnumber": 1450,
			"text": "রেওয়ায়ত ৫০. সাঈদ ইবন মুসায়্যাব (রহঃ) হইতে বর্ণিত, উমর (রাঃ) কা'বা শরীফের দেওয়ালে পৃষ্ঠদেশ লাগাইয়া বসিয়াছিলেন। এই অবস্থায় বলিলেন, যে হারানো বস্তু ধরে সে নিজেই গোমরাহ (পথভ্রষ্ট)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1450
			}
		},
		{
			"hadithnumber": 1451,
			"arabicnumber": 1451,
			"text": "রেওয়ায়ত ৫১. মালিক (রহঃ) ইবন শিহাব যুহরী (রহঃ)-কে বলিতে শুনিয়াছেন উমর (রাঃ)-এর যুগে যে হারানো উট পাওয়া যাইত উহাকে ঐভাবেই ছাড়িয়া দেওয়া হইত। তাহার বাচ্চা জন্ম হইলেও কেহই স্পর্শ করিত না। অতঃপর উসমান (রাঃ)-এর যুগ আসিল। তিনি ঐরূপ উটকে প্রচার করার পর বিক্রয় করিয়া তাহার মূল্য বায়তুল মালে জমা করার হুকুম দিলেন। অতঃপর যখন মালিক আসিবে তখন ঐ পয়সা মালিকের সোপর্দ করিয়া দেওয়া হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1451
			}
		},
		{
			"hadithnumber": 1452,
			"arabicnumber": 1452,
			"text": "রেওয়ায়ত ৫২. সাঈদ ইবন আমর (রহঃ) হইতে বর্ণিত, সা’আদ ইবন উবাদা (রাঃ) কোন যুদ্ধের মধ্যে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে রওয়ানা হইলেন। এদিকে মদীনায় তাহার মাতার মৃত্যুর সময় উপস্থিত। মানুষ তাহার মাতাকে ওসীয়াত করিতে বলিলে উত্তর দিলেন যে, কি ওসীয়্যত করিব? সমস্ত সম্পত্তি তো সাআদেরই। অবশেষে সা’আদ (রাঃ) বাড়িতে ফিরার পূর্বে তিনি মারা যান। সা’আদ (রাঃ) বাড়িতে আসিলে এই ঘটনা বর্ণনা করা হইল। অতঃপর সা’আদ (রাঃ) বলিলেন, ইয়া রাসূলাল্লাহ্! আমি সদকা করিলে আমার মাতার কোন উপকার হইবে কি? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, হ্যাঁ। অতঃপর সা’আদ (রাঃ) বললেন, এই এই বাগান আমার আম্মাজানের পক্ষ হইতে দান করিতেছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1452
			}
		},
		{
			"hadithnumber": 1453,
			"arabicnumber": 1453,
			"text": "রেওয়ায়ত ৫৩. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী আয়েশা (রাঃ) হইতে বর্ণিত, এক ব্যক্তি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলিলঃ আমার আম্মাজান হঠাৎ ইন্তিকাল করেন। আমার দৃঢ় বিশ্বাস যদি তিনি কথা বলার সুযোগ পাইতেন তবে নিশ্চয়ই দান-খয়রাত করিতেন। এখন আমি তাহার পক্ষ হইতে দান করিতে পারিব কি? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, “হ্যাঁ, পারিবে।”",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1453
			}
		},
		{
			"hadithnumber": 1454,
			"arabicnumber": 1454,
			"text": "রেওয়ায়ত ৫৪. মালিক (রহঃ) বলেন যে, এক আনসার ব্যক্তি নিজ পিতামাতাকে কিছু দান করিল, অতঃপর মাতাপিতার ইন্তিকালের পরে সে-ই তাহাদের ওয়ারিস হইল। সে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এই বিষয় জিজ্ঞাসা করিলে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, তোমার সদকার সওয়াব তুমি পাইয়াছ, এখন ওয়ারিস হিসাবে আবার গ্রহণ কর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1454
			}
		}
	]
}