{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"38": "Setting Free and Wala'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1464,
			"arabicnumber": 1464,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1464
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1465
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": 1466,
			"text": "রেওয়ায়ত ৪. রবিয়া ইবন আবদির রহমান (রহঃ) হইতে বর্ণিত, আবান ইবন উসমান (রহঃ) এর শাসনকালে এক ব্যক্তি তাহার সব কয়টি গোলামকে আযাদ করিয়া দিল, তাহার আর কোন মাল ছিল না সেই ক্রীতদাসগুলি ছাড়া। আবান ইন উসমানের নির্দেশে সব ক্রীতদাসকে তিন ভাগে বিভক্ত করা হইল। তারপর লটারি দেওয়া হইল মৃত ব্যক্তির অংশ বেই ভাগে বাহির হইবে সেই ভাগের ক্রীতদাসদিগকে আযাদ করা হইবে, তিন অংশের মধ্য হইতে এক অংশের উপর লটারি উঠিল, ফলে যেই এক-তৃতীয়াংশের উপর লটারি উঠিল সে অংশ আযাদ হইল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1466
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": 1467,
			"text": "রেওয়ায়ত ৫. মালিক (রহঃ) ইবন শিহাব (রহঃ)-কে বলিতে শুনিয়াছেন, ইহা প্রচলিত সুন্নাত (নিয়ম) যে, ক্রীতদাস আযাদ হইলে মাল তাহার পশ্চাদগামী হইবে। মালিক (রহঃ) বলেনঃ আরও স্পষ্ট করিয়া এই দৃষ্টান্তটি বলা যায় যে, ক্রীতদাস আযাদ হইলে তাহার মালও তাহার সাথে থাকিবে, কারণ মুকাতাব (যাহাকে মালের বিনিময়ে আযাদী প্রদানের প্রতিশ্রুতি দেওয়া হইয়াছে)-কে (মালের বিনিময়ে) আযাদীর প্রতিশ্রুতি দেওয়া হইলে তবে শর্ত না করিলেও মাল তাহারই থাকিবে। ইহা এইজন্য যে, কিতাবতের কার্য পূর্ণতা লাভ করিলে (অর্থাৎ অর্থ আদায় করিলে) উহা হুবহু স্বত্বাধিকার (ولاء) এর চুক্তির মতো গণ্য হইবে, যেমন ক্রীতদাসকে আযাদ করিয়া দিলে সে স্বত্বাধিকার লাভ করে তদ্রুপ বদলে কিতাবত (আযাদীর জন্য নির্ধারিত অর্থ) আদায় করিলে ক্রীতদাস (مكاتب) আযাদ হইয়া যায় এবং তাহার সম্পদের স্বত্বাধিকারী সে নিজেই হইবে। আর ক্রীতদাস ও মুকাতাব-এর সম্পদ তাহদের সন্তান-সন্ততির মতো নহে, কারণ তাহাদের সন্তানগণ তাহাদেরই মতো (কর্তাগণ উহাদের মালিক বটে) উহারা তাহাদের সম্পদের মতো নহে অর্থাৎ সম্পদের মতো ক্রীতদাস ও মুকাতাব দাস সন্তানদের মালিক হইবে না। কারণ নিয়ম এই, যেই নিয়মে কোন দ্বিমত নাই অর্থাৎ ক্রীতদাস আযাদ হইলে তাহার মাল তাহার পশ্চাদানুসরণ করিবে, কিন্তু সন্তান তাহার পশ্চাদগামী হইবে না। আর মুকাতাব-এর সহিত যখন কিতাবত করা হয়, তখন তাহার মালও তাহার পশ্চাদানুসরণ করিবে, কিন্তু তাহার সন্তান তাহার পশ্চাদগামী হইবে না। মালিক (রহঃ) বলেনঃ যাহা ইহাকে আরও স্পষ্ট করে তাহা হইল, ক্রীতদাস ও মুকাতাব তাহারা উভয়ে দেউলিয়া হইলে তাহাদের সম্পদ ও তাহাদের উম্মে ওয়ালাদগণকে গ্রহণ করা হইবে কিন্তু তাহাদের সন্তানগণকে বিনিময়ে গ্রহণ করা হইবে না। কারণ সন্তান তাহদের মাল নহে। মালিক (রহঃ) বলেনঃ আর একটি নজীর ইহাকে স্পষ্ট করিয়া তোলে। তাহা হইল, যদি ক্রীতদাসকে এই শর্তে বিক্রয় করা হয় যে তাহার মাল ক্রেতা পাইবে, তবে ক্রীতদাসের সন্তান মালের অন্তর্ভুক্ত হইবে না। মালিক (রহঃ) বলেনঃ আরও যে নজীর ইহাকে স্পষ্ট করে তাহা হইল এই যে, ক্রীতদাস কাহাকেও জখম করিলে, ক্রীতদাস ও উহার মাল বিনিময়ে লওয়া হইবে, কিন্তু (বিনিময়ে) সন্তানকে গ্রহণ করা হইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1467
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": 1468,
			"text": "রেওয়ায়ত ৬. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, উমর ইবন খাত্তাব (রাঃ) বলিয়াছেন, যেই ক্রীতদাসী তাহার কর্তার ঔরসে সন্তান জন্মাইয়াছে, সে কর্তা উহাকে বিক্রয় করিতে পারিবে না, আর পরিবে না উহাকে দান করিতে, উহার স্বত্বাধিকারও লাভ করিবে না, সে উহার দ্বারা উপকৃত হইবে, যখন কর্তার মৃত্যু হইবে ক্রীতদাসী তখন আযাদ হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1468
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": 1469,
			"text": "রেওয়ায়ত ৭. মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌছিয়াছে যে, উমর ইবন খাত্তাব (রাঃ)-এর নিকট জনৈকা ক্রীতদাসী আসিল, যাহাকে তাহার কর্তা আগুন দ্বারা জখম করিয়াছে অথবা তাহার শরীরে আগুন লাগাইয়াছে। উমর (রাঃ) উহাকে আযাদ করিয়া দিলেন (অর্থাৎ আযাদ করিয়া দেওয়ার জন্য কর্তাকে নির্দেশ দিলেন।) মালিক (রহঃ) বলেনঃ আমাদের নিকট পছন্দনীয় হুকুম এই যে, যে ব্যক্তির উপর ঋণ আছে এবং ঋণ তাহার সমস্ত মাল ঘিরিয়া রাখিয়াছে সে ব্যক্তির পক্ষে (ক্রীতদাস বা ক্রীতদাসীকে) আযাদ করা বৈধ নহে। বালক যতক্ষণ বালেগ না হয় অথবা বালেগ পুরুষের সমপর্যায়ে না পৌছে, ততক্ষণ তাহার পক্ষে গোলাম আযাদ করা বৈধ হইবে না, যে ব্যক্তির মালের উপর মুতাওয়াল্লী নিযুক্ত করা হইয়াছে (এবং তাহাকে কার্য পরিচালনা হইতে বিরত রাখা হইয়াছে) সে বালিগ (সাবালক) হইলেও গোলাম আযাদ করিতে পরিবে না, যাবত সে নিজ সম্পদের পরিচালক না হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1469
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": 1470,
			"text": "রেওয়ায়ত ৮. আতা ইবন ইয়াসার (রহঃ) উমর ইবন হাকাম[1] (রাঃ) হইতে ৰণনা করেন যে, তিনি বলিয়াছেন, আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট উপস্থিত হইলাম। আমি বলিলাম, ইয়া-রাসূলাল্লাহ! আমার এক ক্রীতদাসী আমার ছাগপাল চরাইতেছিল। একদিন আমি তাহার নিকট গেলাম এবং জানিতে পারিলাম সে একটি বকরী হারাইয়া ফেলিয়াছে। আমি তাহাকে বকরীর বিষয়ে জিজ্ঞাসা করিলাম। সে বলিল, উহাকে বাঘে খাইয়া ফেলিয়াছে। আমি উহার জন্য দুঃখিত হইলাম, আর আমি আদম সন্তানের একজন (আমার রাগ হইল)। তাই আমি ক্রীতদাসীর মুখের উপর চড় মারিলাম। আমার উপর (পূর্বে) একটি দাস বা দাসী আযাদ করা জরুরী ছিল, এখন আমি উহাকে (ক্রীতদাসীকে) আযাদ করিব কি? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উহাকে (ক্রীতদাসীকে) জিজ্ঞাসা করিলেন, আল্লাহ কোথায়? সে বলিল, উর্ধ্বলোকে। তিনি [রাসূল সাল্লাল্লাহু আলয়হি ওয়া সাল্লাম] বললেন, আমি কে? সে বলল, আপনি আল্লাহর রাসূল। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলয়হি ওয়া সাল্লাম বলিলেনঃ ইহাকে আযাদ করিয়া দাও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1470
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": 1471,
			"text": "রেওয়ায়ত ৯. ওবায়দুল্লাহ্ ইবন আবদিল্লাহ ইবন উতবা ইবন মাসউদ (রহঃ) হইতে বর্ণিত, আনসারের এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট তাহার একটি কৃষ্ণ বর্ণের ক্রীতদাসীকে লইয়া উপস্থিত হইল এবং বলিল, ইয়া রাসূলাল্লাহ্! আমার উপর একটি ঈমানদার ক্রীতদাসী আযাদ করা ওয়াজিব হইয়াছে, তবে আমি এই ক্রীতদাসীটিকে আযাদ করিতে পারি কি? আপনি যদি ইহাকে ঈমানদার মনে করেন তবে আমি তাহাকে আযাদ করিব। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উহাকে (উদ্দেশ্য করিয়া) বলিলেন, আল্লাহ ছাড়া কোন মা’বুদ নাই (لا اله الا الله) তুমি কি ইহার সাক্ষ্য দাও। সে বলিল, হ্যাঁ। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ মুহাম্মদ আল্লাহর রাসূল (محمد رسول الله) তুমি এই সাক্ষ্য দাও কি? সে বলিল, হ্যাঁ। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ (মৃত্যুর পর) পুনরুত্থানে তুমি বিশ্বাস কর কি? সে বলিল, হ্যাঁ। অতঃপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, তুমি ইহাকে মুক্তি দাও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1471
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": 1472,
			"text": "রেওয়ায়ত ১০. মাকবুরী (রহঃ) বলিয়াছেনঃ আবু হুরায়রা (রাঃ)-কে প্রশ্ন করা হইল এক ব্যক্তি সম্পর্কে, যাহার উপর দাস বা দাসীর আযাদ করা ওয়াজিব হইয়াছে। প্রশ্নটি হইল, সে ব্যক্তি জারজ সন্তান আযাদ করিতে পারিবে কি ? আবূ হুরায়রা (রাঃ) বলিলেন, হ্যাঁ, উহা তাহার জন্য যথেষ্ট হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1472
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": 1473,
			"text": "রেওয়ায়ত ১১. মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌছিয়াছে ফুযাল ইবন উবায়দ আনসারী (রাঃ) হইতে, তিনি ছিলেন রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের সাহাবীদের একজন। তাহার নিকট প্রশ্ন করা হইল এক ব্যক্তি সম্পর্কে, যাহার উপর রাকাবা (গোলাম বা বাঁদী) আযাদ করা ওয়াজিব, তাহার পক্ষে জারজ সন্তান আযাদ করা জায়েয হইবে কি? তিনি বলিলেনঃ হ্যাঁ, উহা তাহার পক্ষে যথেষ্ট হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1473
			}
		},
		{
			"hadithnumber": 1474,
			"arabicnumber": 1474,
			"text": "রেওয়ায়ত ১২. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, আবদুল্লাহ ইবন উমর (রাঃ)-কে প্রশ্ন করা হইল, যেই ক্রীতদাসকে আযাদ করা ওয়াজিব হইয়াছে উহাকে (ক্রেতা কর্তৃক আযাদ করার) শর্তে ক্রয় কম যায় কি? তিনি বলিলেন, না। মালিক (রহঃ) বলেনঃ রাকাবা ওয়াজিব [ক্রীতদাস বা দাসীকে কোন ব্যাপারে আবাদ করা ওয়াজিব হইলে উহাকে রাকাবা-ই ওয়াজিবা’ বলা হয়। যেমন মানত এবং কাফফারাতে গোলাম আযাদ করা ওয়াজিব হয়] সম্বন্ধে যাহা আমি শুনিয়াছি (তন্মধ্যে) সর্বাপেক্ষা সুন্দরতম (এই যে,) 'রাকাবা-ই ওয়াজিবা'-কে যে আযাদ করিবে, সে আযাদী দেওয়ার শর্ত করিয়া ক্রয় করিবে না। কারণ এইরূপ শর্ত করিলে ঐ রাকাবা’ পূর্ণ রাকাবা হইবে না, কেননা যে এইরূপ শর্ত করিবে তাহার উদ্দেশ্যে বিক্রেতা মূল্য কমাইয়া দিবে (কাজেই রাকাবা অসম্পূর্ণ থাকিবে)। মালিক (রহঃ) বলেনঃ নফল নিয়্যত আযাদ করার জন্য গোলাম ক্রয় করিতে যাইয়া আযাদ করিবে বলিয়া শর্ত করিয়া ক্রয় করাতে কোন দোষ নাই। মালিক (রহঃ) বলেনঃ রিকাবে-ওয়াজিবা সম্পর্কে সবচাইতে সুন্দর যাহা আমি শুনিয়াছি, (তাহা হইল এই), উহাতে নাসূরানী অথবা ইহুদী গোলাম আযাদ করা যাইবে না। মাকাতাব (যে ক্রীতদাসকে অন্য কিছুর বিনিময়ে আযাদ করিবে বলিয়া ঠিক করা হইয়াছে) ও মুদাব্বর (কর্তার মৃত্যুর পর যে ক্রীতদাস আযাদ)-কে অথবা যাহাকে কয়েক বৎসরের জন্য আযাদ করা হইয়াছে উহাকে আযাদ করা যাইবে না (আরও আযাদ করা যাইবে না) উম্মু ওয়ালাদকে এবং অন্ধকেও না, তবে নফল রূপে নাসরানী, ইহুদী ও মজুসীকে আযাদ করাতে কোন দোষ নাই। কারণ আল্লাহ তা'আলা কিতাবে বলিয়াছেনঃ (‏فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِدَاءً‏) এখানে মান্না (مَنَّ) হইতেছে আযাদ করা। মালিক (রহঃ) বলেনঃ ওয়াজিবরূপে যে ব্যাপারে ক্রীতদাসকে আযাদ করা হয়, যাহার উল্লেখ আল্লাহু তা'আলা কিতাবে বর্ণনা করিয়াছেন, সেই সকল ব্যাপারে মু'মিন ‘রাকাবা’-কেই আযাদ করিতে হইবে। মালিক (রহঃ) বলেনঃ কাফফারাতে মিসকীনদিগকে ভোজ দেওয়াতে মুসলিম মিসকীন ছাড়া অন্য কাহাকেও ভোজ দেওয়া ঠিক নহে, এই ব্যাপারে কোন অমুসলিমকে খাওয়াইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1474
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": 1475,
			"text": "রেওয়ায়ত ১৩. আবদুর রহমান ইবন আবি আমরা আনসারী (রহঃ) হইতে বর্ণিত, তাহার মাতা কিছু ওসীয়াত করার ইচ্ছা করিয়াছিলেন, পরে ভোর হওয়া পর্যন্ত উহাতে বিলম্ব করিলেন, অতঃপর ওসীয়াত করার পূর্বেই তাহার মৃত্যু হয়, তিনি (গোলাম বা বাঁদী) আযাদ করার সংকল্প করিয়াছিলেন। আবদুর রহমান বলেনঃ আমি কাসিম ইবন মুহাম্মদ (রহঃ)-কে বলিলাম, তাহার পক্ষ হইতে আমি আযাদ করিলে ইহা তাহার উপকার করিবে কি? কাসিম বলিলেনঃ সা’দ ইবন উবাদা রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট আরয করিলেন, আমার মাতার মৃত্যু হইয়াছে, আমি তাহার পক্ষ হইতে গোলাম আযাদ করিলে ইহা তাহার উপকার করিবে কি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, হ্যাঁ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1475
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": 1476,
			"text": "রেওয়ায়ত ১৪. ইয়াহইয়া ইবন সাঈদ (রহঃ) বলিয়াছেনঃ আবদুর রহমান ইবন আবী বকর (রহঃ)-এর আকস্মিক ওফাত হয় তাহার নিদ্রাতে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পত্নী আয়েশা (রাঃ) তাহার পক্ষ হইতে অনেকগুলো দাস-দাসী আযাদ করেন। মালিক (রহঃ) বলেনঃ এই বিষয়ে যাহা শুনিয়াছি তন্মধ্যে ইহা আমার নিকট উত্তম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1476
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": 1477,
			"text": "রেওয়ায়ত ১৫. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী আয়েশা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট প্রশ্ন কর হইল, যেসব ব্যাপারে দাস-দাসী আযাদ করা ওয়াজিব উহাতে কোন প্রকার দাস-দাসী (আযাদ করা) উত্তম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, যাহার মূল্য বেশি এবং যাহারা কর্তাদের (এবং তাহাদের পরিজনের) নিকট মনোরম ও আদরণীয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1477
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": 1478,
			"text": "রেওয়ায়ত ১৬. নাফি (রহঃ) আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণনা করেন যে, তিনি অবৈধ সন্তান ও তাহার মাতাকে আযাদ করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1478
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": 1479,
			"text": "রেওয়ায়ত ১৭. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সহধর্মিণী আয়েশা (রাঃ) বলিয়াছেন, বরীরা (রাঃ) (তাহার নিকট) আসিয়া বলিলেন, আমি আমার কর্তাদের সহিত প্রতি বৎসর এক উকীয়া (এক উকীয়াতে চল্লিশ দিরহাম হয়- আওজাস) হিসাবে (সর্বমোট) নয় উকীয়ার বিনিময়ে মুকাতাবত (আযাদী লাভের কথা ঠিক) করিয়াছি। আপনি আমাকে এই ব্যাপারে সাহায্য করুন। আয়েশা (রাঃ) বলিলেন যদি তোমার কর্তারা পছন্দ করেন যে, আমি উহার ব্যবস্থা করি তবে উহা (আদায়) করিব আর তোমার অভিতাবকত্ব আমার জন্য হইবে। বরীরা তাহার কর্তাদের নিকট গেলেন এবং এই বিষয়ে তাহাদিগকে অবহিত করিলেন। তাহারা অস্বীকৃতি জ্ঞাপন করিলেন। বারীরা তাহার কর্তাদের নিকট হইতে যখন (ফিরিয়া) আসিলেন তখন (আয়েশার গৃহে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বসা ছিলেন। বরীরা আয়েশা (রাঃ)-কে বলিলেনঃ আমি তাহাদের নিকট সেই কথা পেশ করিয়াছিলাম। তাহারা ইহা অস্বীকার করিয়াছে। কিন্তু যদি অভিভাবত্ব তাহাদের জন্য হয় (তবে তাহারা রাজী)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহা শুনিলেন। অতঃপর তাহাকে (আয়েশাকে) জিজ্ঞাসা করিলেন। আয়েশা ব্যাপারটি তাহাকে জানাইলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (ইহা শুনিয়া) বলিলেন, তুমি বরীরাকে (মূল্য পরিশোধ করিয়া) গ্রহণ কর এবং তাহাদের জন্য (অভিভাবকত্বের) শর্ত মানিয়া লও, (কিন্তু উহা যেহেতু অবৈধ তাই স্বত্ব তাহারা পাইবে না)। অভিভাবকত্ব হইবে যে আযাদ করিবে তাহার। তারপর আয়েশা (রাঃ) উহা করিলেন, অতঃপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকের (সাহাবীদের) মধ্যে কিছু বলার জন্য দাঁড়াইলেন। অতঃপর আল্লাহর হামদ ও সানা বর্ণনা করিলেন, তারপর বলিলেনঃ কিছু লোকের অবস্থা কি? তাহারা এমন সব শর্ত আরোপ করে যাহা আল্লাহর কিতাবে নাই, আর যেই সকল শর্ত আল্লাহর কিতাবে নাই, উহা বাতিল বলিয়া গণ্য হইবে। যদিও শর্তাশর্তও হইয়া থাকে। আল্লাহর হুকুমই গ্রহণযোগ্য, আল্লাহর শর্ত অতি দৃঢ়। (জানিয়া রাখুন) অভিভাবকত্ব তাহারই হইবে যে আযাদ করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1479
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": 1480,
			"text": "রেওয়ায়ত ১৮. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, আয়েশা উম্মুল মু'মিনীন (রাঃ) জনৈকা ক্রীতদাসীকে খরিদ করিয়া আযাদ করার ইচ্ছা করিলেন। ক্রীতদাসীর কর্তারা বলিল আমরা উহাকে আপনার নিকট এই শর্তে বিক্রয় করিতে পারি যে, উহার অভিভাবকত্ব আমাদের জন্য থাকিবে। আয়েশা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট ইহা উল্লেখ করিলেন। তিনি বলিলেন এই শর্তারোপ যেন তোমাকে (উহাকে ক্রয় করিয়া আযাদ করিতে) বারণ না করে। অভিভাবকত্ব উহারই হইবে, যে আযাদ করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1480
			}
		},
		{
			"hadithnumber": 1481,
			"arabicnumber": 1481,
			"text": "রেওয়ায়ত ১৯. আমরা বিনত আবদির রহমান (রাঃ) হইতে বর্ণিত, বরীরা আসিলেন উম্মুল মু'মিনীন আয়েশা (রাঃ)-এর নিকট সাহায্য চাহিতে। আয়েশা (রাঃ) বলিলেন যদি তোমার কর্তারা পছন্দ করে যে আমি তাহাদিগকে একবারে মূল্য পরিশোধ করিব এবং তোমাকে আযাদ করিয়া দিব তবে আমি উহা করিব। বরীরা কর্তাদের নিকট ইহা পেশ করিলেন। তাহারা বলিল, আমরা ইহাতে রাজী নহি, তবে যদি তোমার অভিভাবকত্ব আমাদের জন্য থাকে। মালিক (রহঃ) বলেন, ইয়াহইয়া ইবন সাঈদ (রহঃ) বলিয়াছেন, আমরা ধারণা করেন যে, আয়েশা (রাঃ) ইহা উল্লেখ করিয়াছেন রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, তুমি বরীরাকে খরিদ কর এবং তাহাকে আযাদ করিয়া দাও, অভিভাবকত্ব অবশ্য তাহারই জন্য থাকিবে যে আযাদ করিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1481
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": 1482,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1482
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": 1483,
			"text": "রেওয়ায়ত ২০. আবদুল্লাহ্ ইবন উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অভিভাবকত্ব বিক্রি ও দান করিতে নিষেধ করিয়াছেন। মালিক (রহঃ) বলেনঃ যে ক্রীতদাস নিজকে ক্রয় করিয়া লয় আপন কর্তা হইতে এই শর্তে যে, সে যাহাকে চায় তাহাকে অভিভাবকত্ব প্রদান করবে। ইহা জায়েয হইবে না। অভিভাবকত্ব তাহার জন্য হইবে, যে আযাদ করিবে। আর যদি কোন ব্যক্তি নিজের মুক্তিপ্রাপ্ত ত্রীতদাসকে যাহাকে ইচ্ছা তাহাকে অভিভাবকত্ব প্রদানের অনুমতি দিয়াছে তবে ইহা বৈধ হইবে না। কারণ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন অভিভাবকত্ব তাহারই হইবে যে আযাদ করিবে এবং তিনি স্বত্বাধিকার বিক্রয় ও দান করিতে নিষেধ করিয়াছেন। যদি কর্তার পক্ষে ক্রীতদাসের জন্য এইরূপ শর্ত করা বৈধ হয় অথবা সে ক্রীতদাসকে অনুমতি দেয় যে, সে যাহাকে ইচ্ছা অভিভাবকত্ব প্রদান করিবে, তবে ইহা দান করা হইল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1483
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "রেওয়ায়ত ২১. রবী'আ ইবন আবদির রহমান (রহঃ) হইতে বর্ণিত, যুবাইর ইবনুল আওয়াম (রাঃ) জনৈক ক্রীতদাসকে খরিদ করিয়া উহাকে আযাদ করিয়াছিলেন। সেই ক্রীতদাসের কয়েকটি ছেলে ছিল আযাদ স্ত্রীর ঔরসের। যুবাইর (রাঃ) যখন উহাকে আযাদ করিলেন তখন তিনি বলিলেন, ইহারা আমার মাওয়ালী। [موالى আযাদী প্রদান সূত্রে ইহাদের উপর আমার অভিভাবকত্ব উত্তরাধিকার প্রতিষ্ঠিত হইয়াছে -তাই ইহারা এখন আমার অধীনস্থ ও অধিকারভুক্ত। অন্যদিকে এই সন্তানদের জননীকে যাহারা আযাদ করিয়াছিলেন। তাহারা বলিলেনঃ ইহারা আমাদের অধিকারভুক্ত (موالى)]। অতঃপর তাহারা বিবাদ লইয়া উসমান ইবন আফফান (রাঃ)-এর নিকট গেলেন। উসমান (রাঃ) উহাদের অভিভাবকত্ব- এর ফয়সালা দিলেন যুবাইরের পক্ষে। মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌছিয়াছে যে, সাঈদ ইবন মুসায়্যাব (রহঃ)-কে প্রশ্ন করা হইল জনৈক ক্রীতদাসী সম্বন্ধে, যাহার কয়েকটি ছেলে রহিয়াছে আযাদ স্ত্রীর ঔরসে। উহাদের স্বত্বাধিকার কাহার জন্য হইবে। সাঈদ বললেন, যদি আযাদী না পাওয়া অবস্থায় উহাদের পিতার মৃত্যু হয় তবে উহাদেৱ অভিভাবকত্ব হইবে তাহাদের মাতার মাওলাদের (আযাদী দাতার) জন্য। মালিক (রহঃ) বলেনঃ তদ্রূপ অনারব মুসলিম লি'আনকারী (লি'আনকারী অধ্যায়) স্ত্রীলোকের সন্তান ও তাহার (সন্তানের মাতা) মাওলার দিকে সম্পর্কিত হইবে। তাই মাতার কর্তারা এই ছেলের মাওলা হইবে। যদি সে মারা যায় তবে তাহারা উহার মীরাস লাভ করিবে। সে কোন অপরাধ করিলে তাহারা উহার পক্ষ হইতে খেসারত বা ক্ষতিপূরণ দিবে। আর উহার পিতা যদি উহার নসব স্বীকার করিয়া লয় তবে উহাকে পিতার দিকে সম্পর্কিত করা হইবে। এবং উহার স্বত্বাধিকার তাহার পিতার অভিভাবকত্ব (موالى) লাভ করিবে। তাহার মীরাসও উহাদের জন্য হইবে, আর তাহার অপরাধের খেসারতও হইবে উহাদের উপর এবং (স্বীকারোক্তির পর) ছেলের পিতাকে (অপবাদের শাস্তিতে) বেত্ৰাঘাত করা হইবে। মালিক (রহঃ) বলেনঃ তদ্রূপ আরব লি'আনকারী স্ত্রীলোকের স্বামী যে স্ত্রীকে সন্তানের ব্যাপারে অপবাদ দিয়াছে সে যদি উহার ছেলের নসব (জন্মসূত্র) স্বীকার করে তবে সে ছেলে ঐ রূপ মর্যাদাই লাভ করিবে। কিন্তু (পার্থক্য এই থাকিবে যে,) এই ছেলের মাতা ও ভগ্নীদের মীরাস বরাদের পর অবশিষ্ট মীরাস যদি তাহার পিতার সহিত সে যুক্ত না হয় তবে সাধারণ মুসলিমদের জন্য নির্ধারিত হইবে। পক্ষান্তরে লি'আনকারী স্ত্রীলোকের ছেলের মীরাস তাহার অর্থাৎ মাতার মাওলারা লাভ করিবে পিতা কর্তৃক ছেলের নসব স্বীকার করার পূর্ব পর্যন্ত। কারণ এই ছেলের নসব (জন্মসূত্র) নাই, ফলে তাহার কোন আসাবা অর্থাৎ মীরাস লাভ করে এমন কোন আত্মীয়-স্বজন নাই। আর যদি নসব প্রমাণিত হয় তবে তাহার মীরাস আসাবাগণ হইবে । মালিক (রহঃ) বলেনঃ আমাদের নিকট ইজমাঈ (اجماعى) সর্বজনগৃহীত যাহাতে কোন ইখতিলাফ নাই— মাসয়ালা হইল এই, ক্রীতদাসের পুত্ৰগণ আযাদ স্ত্রীর ঔরসের হইলেও ক্রীতদাসের পিতা আযাদ হইলে, তবে পুত্রদের বড় বাপ অৰ্থাৎ দাদা স্বীয় ছেলের এমন পুত্রদের (নাতির) যাহারা আযাদ এবং আযাদ মাতার গর্ভে যাহাদের জন্ম, তাহাদের মীরাস লাভ করিবে, যতদিন পিতা ক্রীতদাস থাকে ততদিন। যদি তাহাদের পিতা আযাদ হইয়া যায় তবে পিতার মাওলাগণ অভিভাবকত্ব লাভ করিবে। আর যদি ক্রীতদাস থাকিতেই তাহার মৃত্যু হয় তবে মীরাস অধিকার (ولاء) দাদার জন্য থাকিবে। আর যদি ক্রীতদাস পিতার আযাদ দুই পুত্র থাকে এবং উহাদের একজন মারা যায় তাহাদের পিতা গোলাম থাকা অবস্থায় তবে পুত্রের বড় বাপ-দাদা মীরাস ও অভিভাবকত্ব (ولاء) দুইটিই লাভ করিবে। মালিক (রহঃ) বলেনঃ অন্তঃসত্ত্ব অবস্থায় যে ক্রীতদাসীকে আযাদ করা হইল এবং তাহার স্বামী তখনও (অন্যের) দাস। অতঃপর সন্তান প্রসবের পূর্বে অথবা পরে তাহার স্বামীকে আযাদ করা হয় তবে পেটে যাহা ছিল উহার অর্থাৎ সন্তানের অভিভাবকত্ব যে তাহার জননীকে আযাদ করিয়াছে সে-ই লাভ করিবে। কারণ এই সন্তান তাহার মাতাকে আযাদী দেওয়ার পূর্বের, ফলে দাসত্ব তাহাকে স্পর্শ করিয়াছে। সে ঐ সন্তানতুল্য মর্যাদার অধিকারী নহে যাহাকে তাহার জননী গর্ভে ধারণ করিয়াছে আযাদী লাভের পরে। কারণ আযাদী লাভের পর জননী সেই সন্তান গর্ভে ধারণ করিয়াছে। সেই সন্তানের পিতা তাহার অভিভাবকত্ব প্রাপ্ত হইবে, যদি পিতাকে আযাদ করা হইয়া থাকে। মালিক (রহঃ) বলেনঃ যে ক্রীতদাস গোলাম আযাদ করার জন্য তাহার কর্তার অনুমতি প্রার্থনা করিয়াছে, কর্তা তাহাকে অনুমতি দিয়াছে তবে আযাদীপ্রাপ্ত ক্রীতদাসের অভিভাবকত্ব এই ক্রীতদাসের কর্তা লাভ করিবে, এই (আযাদীপ্রাপ্ত) ক্রীতদাসের অভিভাবকত্ব ও উত্তরাধিকার তাহার কর্তা যে তাহাকে আযাদ করিয়াছে সে পাইবে না, যদিও সে (পরে) আযাদী লাভ করিয়া থাকে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1484
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": 1485,
			"text": "রেওয়ায়ত ২২. আবদুল মালিক ইবন আবী বকর ইবন আবদির রহমান তাহার পিতা হইতে বর্ণনা করেন যে, তিনি আবদুল মালিক-এর নিকট বর্ণনা করিয়াছেন যে, আসী (عاصى) ইবন হিশাম পরলোকগমন করেন এবং তিনি রাখিয়া যান তাহার তিন পুত্র, দুইজন (তাহদের মধ্যে) সহোদর ও একজন ছিল বৈমাত্রেয় ভ্রাতা। পরে সহোদরদ্বয়ের একজনের মৃত্যু হয়। সে রাখিয়া যায় সম্পদ ও মাওয়ালী (موالى - যে সকল ক্রীতদাসকে মুক্তি দিয়াছে, সেই সব ক্রীতদাস মুক্তিদাতার মাওয়ালী) তাহার সহোদর ভাই তাহার সম্পদ ও মাওয়ালীদের অভিভাবকত্বের উত্তরাধিকারী হইল। অতঃপর যিনি সম্পদ ও অভিভাবকত্বের উত্তরাধিকার লাভ করবেন তিনি মৃত্যুবরণ করিলেন এবং রাখিয়া গেলেন পুত্র ও বৈমাত্রেয় ভ্রাতা; তাহার পুত্র বলিলঃ আমার পিতা যে সম্পদ ও অভিভাবকত্বের মালিক হইয়াছিলেন (বর্তমানে) আমি সেই সবের উত্তরাধিকারী হইয়াছি। তাহার ভাই (অর্থাৎ পুত্রের চাচা) বলিল, এইরূপ নহে। তুমি সম্পদের উত্তরাধিকারী হইয়াছ। কিন্তু মাওয়ালীদের অভিভাবকত্বের উত্তরাধিকারী তুমি নহে। তুমি কি ভাবিয়া দেখ না যদি আমার ভাই আজ পরলোকগমন করিত, আমি কি উহার উত্তরাধিকারী হইতাম না? অতঃপর তাহারা উভয়ে বিবাদ লইয়া উসমান ইবন আফফান (রাঃ)-এর নিকট উপস্থিত হইল। তিনি [উসমান (রাঃ)] মাওয়ালীগণের স্বত্বাধিরার তাহার ভাইকে প্রদান করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1485
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": 1486,
			"text": "রেওয়ায়ত ২৩. আবদুল্লাহ ইবন আবী বকর ইবন হাযম (রহঃ) হইতে বর্ণিত, তাহার পিতা তাহার নিকট বর্ণনা করিয়াছেন যে, তিনি আবান ইবন উসমান (রাঃ)-এর নিকট বসা ছিলেন (এমন সময়) জুহাইনা (গোত্রের) কিছু লোক এবং বনী হারিস ইবন খাযরাজ (গোত্রের) কিছু লোক বিবাদ লইয়া তাহার নিকট আসিল। আর জুহাইনা গোত্রের জনৈকা নারী বনী ইবন খাযরাজ-এর এক ব্যক্তির স্ত্রী ছিল, তাহাকে বলা হইত ইবরাহীম ইবন কুলাইব। (তাহার) স্ত্রী মারা যায় এবং রাখিয়া যায় ধন-সম্পদ ও আযাদ করা ক্রীতদাস উহার মীরাস পাইল তাহার স্বামী ও পুত্র। অতঃপর স্ত্রীলোকটির পুত্রটি মারা গেল। তখন স্বামীটি বলিল, মাওয়ালীগণের স্বত্বাধিকার আমার প্রাপ্য। কারণ তাহার পুত্র (উত্তরাধিকারসূত্রে) উহার মালিক হইয়াছে। জুহাইনীয়া গোত্রের লোকেরা বলিল, এইরূপ নহে। উহার (আযাদী প্রাপ্ত ক্রীতদাসগণ) হইতেছে আমাদের (গোত্রের) স্ত্রীলোকের ক্রীতদাস। [موالى যাহাদিগকে এই স্ত্রীলোক আযাদ করিয়াছে] তাহার পুত্র যখন মারা গেল তবে এই মাওয়ালীগণের স্বত্বাধিকার আমরাই পাইব। আমরা উহাদের মীরাস লাভ করিব। সব শুনিয়া আবান ইবন উসমান (রহঃ) মাওয়ালীগণের অভিভাবকত্ব প্রদান করিলেন জুহাইনীয়দের জন্য।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1486
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": 1487,
			"text": "রেওয়ায়ত ২৪. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, সাঈদ ইবন মুসায়্যাব (রহঃ) বলিয়াছেন সেই ব্যক্তি সম্পর্কে, যে ব্যক্তি পরলোকগমন করিয়াছে তিন পুত্র রাখিয়া, আর রাখিয়া গিয়াছে কতিপয় মাওয়ালী (ক্রীতদাস) যাহাদিগকে সে আযাদ করিয়াছে। তারপর তাহার দুই পুত্র মারা যায়। তাহারা উভয়ে রাখিয়া যায় (তাহাদের) সন্তান। সাঈদ ইবন মুসায়্যাব (রহঃ) বললেন, তাহার তিন পুত্রের মধ্যে জীবিত পুত্র মাওয়ালীগণের অভিভাবকত্ব ও উত্তরাধিকার লাভ করিবে। সেও পরলোকগমন করিলে তখন তাহার সন্তান ও তাহার (মৃত) দুই ভাইয়ের সন্তানগণ মাওয়ালীগণের সম্পদের উত্তরাধিকারের ব্যাপারে বরাবর হকদার হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1487
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": 1488,
			"text": "রেওয়ায়ত ২৫. মালিক (রহঃ) ইবন শিহাব (রহঃ)-কে প্রশ্ন করিয়াছেন সায়িবা সম্বন্ধে। তিনি বলিয়াছেন, সে যাহার সহিত ইচ্ছা মিত্রতার বন্ধন করিতে পারে আর যদি তাহার মৃত্যু হয় অথচ সে কাহাকেও ওয়ালী (অভিভাবক) নিযুক্ত করে নাই, তবে তাহার মীরাস হইবে মুসলিমদের জন্য এবং তাহার খেসারতও মুসলিমদের উপর হইবে। মালিক (রহঃ) বলেনঃ সায়িবা সম্বন্ধে উত্তম যাহা শোনা গিয়াছে তাহা হইল সে কাহারো সহিত মিত্রতার বন্ধনে আবদ্ধ হইবে না এবং তাহার মীরাস মুসলিমদের জন্য হইবে, আর তাহার খেসারত তাহাদের উপর আসিবে। ইহুদী ও নাসরানী সম্বন্ধে মালিক (রহঃ) বলেনঃ তাহদের একজনের ক্রীতদাস মুসলিম হইয়াছে এবং তাহার পক্ষ হইতে ক্রীতদাস বিক্রি হওয়ার পূর্বে সে উহাকে আযাদ করিয়া দিয়াছে (এইরূপ) মুক্তিপ্রাপ্ত ক্রীতদাসের অভিভাবকত্ব মুসলিমদের জন্য হইবে। ইহার পর যদি ইহুদী ও নাসরানী মুসলিম হয় স্বত্বাধিকার তাহদের দিকে আর ফিরিবে না। মালিক (রহঃ) বলেন, যদি ইহুদী অথবা নাসরানী তাহদের সহধর্মী কোন ক্রীতদাসকে আযাদ করে, তারপর যে ইহুদী অথবা নাসরানী ইহাকে আযাদ করিয়াছে তাহার ইসলাম গ্রহণের পূর্বে সেই ক্রীতদাস মুসলিম হয়, তার পর যে আযাদ করিয়াছে সেও মুসলিম হয় তবে অভিভাবকত্ব তাহার দিকে প্রত্যাবর্তন করিবে। কারণ যেই দিন আযাদ করিয়াছিল সেই দিন স্বত্বাধিকার তাহারই প্রাপ্য ছিল। মালিক (রহঃ) বলেনঃ যদি ইহুদী অথবা নাসরানীর মুসলিম সন্তান থাকে, আর সে (কর্তা) তাহাকে আযাদ করিয়াছে তাহার ইসলাম গ্রহণের পূর্বে যদি আযাদী প্রাপ্ত ক্রীতদাস মুসলিম হইয়া যায়, তবে সে (সন্তান) ইহুদী অথবা নাসরানী পিতার আযাদী প্রদত্ত ক্রীতদাসদের মীরাসের অধিকারী হইবে। আর যদি আযাদী প্রাপ্তির সময় ক্রীতদাস মুসলিম ছিল তবে ইহুদী অথবা নাসরানীর মুসলিম সন্তানরা মুসলিম ক্রীতদাসের স্বত্বাধিকারের কোন কিছু প্রাপ্য হইবে না। কারণ ইহুদী অথবা নাসরানীর জন্য কোন অভিভাবকত্ব নাই। তাই মুসলিম ক্রীতদাসের অভিভাবকত্ব মুসলিম সম্প্রদায়ের প্রাপ্য হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1488
			}
		}
	]
}