{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"48": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "রেওয়ায়ত ১. জাবির ইবন আবদুল্লাহ্ আনসারী (রাঃ) হইতে বর্ণিত, তিনি বলেন, আমরা বনী আনমার যুদ্ধের[1] জন্য রাসূলুল্লাহ্ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের সহিত রওয়ানা হইলাম। জাবির (রাঃ) বলেন, আমরা একটি বৃক্ষের নিচে অবস্থান করিতেছিলাম। হঠাৎ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে দেখা গেল। আমি বলিলাম, ইয়া রাসূলাল্লাহ! ছায়ায় আসুন। তিনি আসিয়া ছায়ায় দাঁড়াইলেন। আমি আমার টুকরির কাছে যাইয়া উহাতে (কিছু খাদ্য) অনুসন্ধান করিতে লাগিলাম। শেষ পর্যন্ত উহাতে একটি কাকড়ি পাওয়া গেল। আমি উহাকে কাটিয়া রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের সম্মুখে উপস্থিত করিলাম। তিনি বলিলেন, ইহা কোথা হইতে আসিল? জাবির (রাঃ) বলিলেন, ইয়া রাসূলাল্লাহ! আমরা ইহাকে মদীনা হইতে লইয়া যাত্রা করিয়াছিলাম। জাবির বলেন, আমাদের সহিত এক ব্যক্তি ছিল যাহার নিকট আমরা সফরের মালপত্র দিয়াছিলাম। সে ব্যক্তি আমাদের জন্তুগুলিও চরাইত। যখন সে আমাদের জন্তুগুলি চরাইতে যাইতে লাগিল, তখন তাহার গায়ে দুইটি পুরান ছেড়া চাদর ছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইহা দেখিয়া বলিলেন, এই ব্যক্তির নিকট কি অন্য কোন কাপড় নাই? জাবির বলিলেন, ইয়া রাসূলাল্লাহ! তাহার নিকট ইহা ব্যতীত আরও কাপড় রহিয়াছে যাহা সে পুটলি বাঁধিয়া রাখিয়াছে। উহা আমি তাহাকে পরিতে দিয়াছিলাম। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, তাহাকে ঐ কাপড় পরিধান করিতে বল। আমি তাহাকে ডাকিয়া উহা পরিধান করিতে বলিলে সে তাহা বাহির করিয়া পরিধান করিল। যখন সে আবার যাইতেছিল তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ তাহার কি হইয়াছিল যে, কাপড় থাকিতে সে তাহা পরিধান করিল না? আল্লাহ তাহার গর্দান মারুক! এখন কি তাহাকে আগের চাইতে ভাল দেখায় না? সে ব্যক্তি ইহা শুনিতে পাইয়া বলিল, ইয়া রাসূলাল্লাহ! আল্লাহর রাস্তায় কি আমার গর্দান মারা যাইবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, হ্যাঁ, আল্লাহর রাস্তায়। পরে ঐ ব্যক্তি আল্লাহর রাস্তায় শহীদ হইয়া গেল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1651
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "রেওয়ায়ত ২. উমর (রাঃ) বলেনঃ আমি ক্কারীগণকে (কুরআনের আলিমগণ) শুভ্ৰ পোশাকে দেখিতে পছন্দ করি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1652
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "রেওয়ায়ত ৩. উমর (রাঃ) বলিতেন, যখন তোমাদেরকে আল্লাহ সচ্ছলতা দান করিবেন, তখন তোমরাও নিজের উপর সচ্ছলতার নিদর্শন দেখাও। নিজেদের পোশাক তৈরি করিয়া লও।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1653
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1654
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "রেওয়ায়ত ৪. নাফি (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবনে উমর (রাঃ) গেরুয়া ও জাফরানী রঙে রঞ্জিত কাপড় পরিধান করিতেন। মালিক (রহঃ) বলেন, আমার মতে শিশুদেরকে স্বর্ণ পরান মাকরূহ। কেননা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হইতে আমার নিকট এই খবর পৌছিয়াছে যে, তিনি সোনার আংটি পরিতে নিষেধ করিয়াছেন। পুরুষ ও ছেলের জন্য সোনা ব্যবহার করা মাকরূহ মনে করি। যরকানী বলেনঃ বড়দের জন্য সোনা ব্যবহার করা মাকরুহ তাহরীমা এবং ছোটদের জন্য মাকরুহ তানযীহী। বাচ্চাদেরকে রৌপ্যের অলঙ্কার পরানোও অনেকের মতে মাকরূহ, আবার কাহারও মতে বৈধ। মালিক (রহঃ) বলেনঃ আমি পুরুষদের জন্য ঘরে ও ঘরের আশেপাশে কুসুম রঙের রঞ্জিত চাদর গায়ে দেওয়া হারাম মনে করি না। কিন্তু আমার মতে না পরাই ভাল, ইহা ব্যতীত অন্য পোশাক পরিধান করাই পছন্দনীয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1655
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "রেওয়ায়ত ৫. উম্মুল মু'মিনীন আয়েশা (রাঃ) আবদুল্লাহ ইবনে যুবাইর (রাঃ)-কে একটি কাপড় পরাইয়াছেন, যাহা নিজেও পরিধান করিতেন, উহাতে পশম ও রেশম ছিল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1656
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "রেওয়ায়ত ৬. আলকামা ইবন আবি আলকামা (রহঃ)-এর জননী মারজানা হইতে বর্ণিত, তিনি বলেন, হাফসা বিনতে আবদুর রহমান (রাঃ) একটি মিহিন ওড়না পরিয়া উম্মুল মু'মিনীন আয়েশা (রাঃ)-এর নিকট গেলে আয়েশা (রাঃ) উহাকে ছিড়িয়া ফেলিলেন এবং মোটা কাপড়ের ওড়না তাহাকে পরাইয়া দিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1657
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "রেওয়ায়ত ৭. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, তিনি বলেন, কাপড় পরিহিতা উলঙ্গিনী[1] এবং পুরুষদেরকে নিজের প্রতি আকৃষ্টকারিণী স্ত্রীলোকগণ বেহেশতে প্রবেশ করিতে পারবে না, বরং তাহারা বেহেশতের সুগন্ধও পাইবে না। অথচ ঐ সুগন্ধ পাঁচশত বৎসরের দূরত্ব হইতে অনুভূত হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1658
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "রেওয়ায়ত ৮. ইবনে শিহাব (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক রাত্রে জাগরিত হইলেন এবং আকাশের প্রতি দৃষ্টি নিক্ষেপ করিয়া বলিলেন, আল্লাহ তা’আলা এই রাত্রে কত ধনাগার খুলিয়া দিয়াছেন এবং কত ফিতনা অবতীর্ণ করিয়াছেন! পৃথিবীতে অনেক কাপড় পরিধানকারিণী স্ত্রীলোক পরকালে উলঙ্গ অবস্থায় উঠিবে।[1] যাহারা কক্ষে রহিয়াছে তাহাদেরকে জাগাইয়া দাও (অর্থাৎ ইবাদতের জন্য)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1659
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "রেওয়ায়ত ৯. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ যে ব্যক্তি গর্বভরে স্বীয় কাপড় টাখনুর নিচে লটকায় কিয়ামতের দিন আল্লাহ্ তা'আলা তাহাকে রহমতের দৃষ্টিতে দেখিবেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1660
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "রেওয়ায়ত ১০. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ আল্লাহ তা’আলা কিয়ামতের দিন ঐ ব্যক্তির প্রতি রহমতের দৃষ্টি করবেন না, যে ব্যক্তি অহঙ্কার করিয়া নিজের কাপড় লটকায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1661
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "রেওয়ায়ত ১১. ইবনে উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, আল্লাহ তা’আলা কিয়ামতের দিন ঐ ব্যক্তির প্রতি রহমতের দৃষ্টি করবেন না, যে অহঙ্কার করিয়া নিজের কাপড় নিচের দিকে লটকাইয়া দেয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1662
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "রেওয়ায়ত ১২. আবদুর রহমান ইবনে ইয়াকুব (রহঃ) বলিয়াছেন, আমি আবু সাঈদ খুদরী (রাঃ)-কে লুঙ্গির ব্যাপারে জিজ্ঞাসা করিয়াছিলাম। তিনি বলিয়াছেন, আমার জানা আছে, আমি বলিতেছি। আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলিতে শুনিয়াছি, মুমিনের লুঙ্গি হাটুর নিম্ন পর্যন্ত থাকিবে, টাখনু পর্যন্ত পরিলে ঐ ব্যক্তির প্রতি কিয়ামতের দিন আল্লাহ তা’আলা রহমতের দৃষ্টি করিবেন না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1663
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "রেওয়ায়ত ১৩. উম্মুল মু'মিনীন উম্মু সালমা (রাঃ) যখন নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট লুঙ্গি লটকানোর কথা জিজ্ঞাসা করিতে যাইয়া বলিলেন, ইয়া রাসূলাল্লাহ! নারীগণ কিরূপে কাপড় পরিধান করিবে? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, তাহারা এক বিঘত নিচু রাখিয়া পরিবে। উম্মু সালমা বলিলেন, ইহাতে তো খুলিয়া যাইবে। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, তবে এক হাত নিচু রাখিবে, ইহার অতিরিক্ত নহে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1664
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "রেওয়ায়ত ১৪. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, কোন মুসলিম যেন একটি জুতা পরিধান করিয়া না হাঁটে। হয় উভয় জুতা পরিধান করিবে না হয় উভয় জুতা খুলিয়া রাখিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1665
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "রেওয়ায়ত ১৫. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেনঃ যখন কোন মুসলিম জুতা পরিতে ইচ্ছা করে তখন যেন সে ডান পা প্রথমে পরিধান করে। আর যখন জুতা খোলে তখন যেন বাম পা হইতে খোলে। জুতা পরিধান করিতে ডান পা প্রথমে হইবে, আর জুতা খুলিতে ডান পা শেষে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1666
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "রেওয়ায়ত ১৬. কাব আহবার (রহঃ) হইতে বর্ণিত, এক ব্যক্তি নিজের জুতা খুলিল, কা'ব তাহাকে বলিল, তুমি তোমার জুতা কেন খুলিয়া ফেলিয়াছ? হয়ত তুমি (إِنِّي أَنَا رَبُّكَ فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوَادِ الْمُقَدَّسِ طُوًى) অর্থাৎ “আমি তোমার প্রভু। তুমি তোমার জুতা খুলিয়া ফেল। কেননা তুমি 'তুয়া’ নামক পবিত্র ভূমিতে আছ।” (সূরা ত্ব-হাঃ ১২) এই আয়াত দেখিয়া জুতা খুলিয়াছ। অতঃপর কা'ব বলিলেন, তোমার জানা আছে কি মূসা (আঃ)-এর জুতা কিসের ছিল? মালিক (রহঃ) বলিলেন, আমার জানা নাই, ঐ ব্যক্তি কি উত্তর দিয়াছিল। অতঃপর কা'ব বললেন, উহা মৃত গাধর চামড় দ্বারা প্রস্তুত করা হইয়াছিল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1667
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "রেওয়ায়ত ১৭. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুই প্রকার পোশাক এবং দুই প্রকার বিক্রয় হইতে নিষেধ করিয়াছেন (ইহা উপরে বর্ণিত হইয়াছে)। আর মানুষের এমনভাবে বসা যাহাতে তাহার হাঁটু খাড়া থাকে এবং তাহার লজ্জাস্থানের উপর কোন কাপড় না থাকে এই প্রকার বসা নিষেধ। আর এক কাপড় দ্বারা সমস্ত শরীর ঢাকিয়া লইতে তিনি নিষেধ করিয়াছেন (যাহাতে সতর না খুলিয়া হাত বাহির করা যায় না)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1668
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": 1669,
			"text": "রেওয়ায়ত ১৮. আবদুল্লাহ ইবনে উমর (রাঃ) হইতে বর্ণিত যে, উমর (রাঃ) একখানা রেশমী কাপড় মসজিদের সম্মুখে বিক্রি হইতে দেখিলেন। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলিলেন, ইয়া রাসূলাল্লাহ! যদি আপনি এই রেশমী কাপড়খানা খরিদ করিয়া লইতেন তাহা হইলে শুক্রবারে উহা পরিধান করিতে পারিতেন অথবা কোন বৈদেশিক দূত আসিলে তাহা পরিতে পারিতেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, ইহা ঐ ব্যক্তিই পরিধান করিবে পরকালে যাহার কোন অংশ থাকিবে না। পরে রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট ঐরূপ আরও কাপড় আসিলে তিনি তাহা হইতে একখানা কাপড় উমর (রাঃ)-কে দান করিলেন। উমর (রাঃ) বলিলেন, ইয়া রাসূলাল্লাহ্! আপনি আতারদের কাপড় সম্বন্ধে যাহা বলিয়াছেন তাহা দ্বারা ইহাই বুঝা যায় যে, ঐ ধরনের কাপড় পরিধানকারীর জন্য আখিরাতে কোন অংশ নাই। আর এখন আমাকে উহা দান করিতেছেন? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, আমি তোমাকে উহা পরিতে দেই নাই। অতঃপর উমর (রাঃ) ঐ কাপড় স্বীয় এক কাফির ভাই যে ছিল মক্কায় তাহাকে দান করিয়া দিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1669
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "রেওয়ায়ত ১৯. আনাস ইবনে মালিক (রাঃ) বলেন, আমি উমর (রাঃ)-কে দেখিয়াছি যখন তিনি আমীরুল মু'মিনীন ছিলেন। আর তখন তাহার জামায় উভয় স্কন্ধের মধ্যস্থলে পর পর তিনটি তালি লাগানো ছিল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1670
			}
		}
	]
}