{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"50": "The Evil Eye"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "রেওয়ায়ত ১. আবূ উমামা ইবনে সহল ইবনে হুনাইফ (রহঃ) বলেন, (জুহফার নিকটবর্তী) হেরার নামক স্থানে আমার পিতা আবু সহল (ইবনে হানীফ) গোসল করার মনস্থ করিয়া জুব্বা খুলিয়া ফেলিলেন। আমির ইবনে রবীয়া দেখিতেছিলেন। আমার পিতা সহল সুন্দর ও সুদর্শন লোক ছিলেন। আমির বলিলেন, আজিকার মতো আর কোনদিন আমি এত সুন্দর মানুষ দেখি নাই, এমন কি এত সুন্দর দেহবিশিষ্ট কোন যুবতীও দেখি নাই। (আমিরের এই কথা বলার সঙ্গে সঙ্গেই) তৎক্ষণাৎ সহলের গায়ে জ্বর আসিল এবং জ্বরের বেগ ভীষণ হইল। অতঃপর এক ব্যক্তি আসিয়া রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের কাছে বলিল, সহলের জ্বর আসিয়াছে এবং সে আপনার সঙ্গে যাইতে পরিবে না। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সহলের নিকট আগমন করিলেন, সহল আমিরের সেই কথা নকল করিয়া শোনাইলেন। ইহা শুনিয়া রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, কোন মুসলিম নিজের ভাইকে কেন হত্যা করে। অতঃপর আমিরকে বলিলেন, তুমি ‘বারাকাল্লাহ’ বলিলে না কেন? বদ নজর (কুদৃষ্টি) সত্য। সহলের জন্য ওযু কর। আমির সহলের জন্য ওযু করিলেন। অতঃপর সহল ভাল হইয়া গেলেন এবং রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের সঙ্গে গেলেন, আর তাহার কোন অসুবিধা তখন ছিল না।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1711
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "রেওয়ায়ত ২. আবূ উসামা ইবন সহল (রহঃ)-এর রেওয়ায়ত, ‘আমির ইবনে রবী'আ সহল ইবনে হানীফকে গোসল করিতে দেখিয়া বলিলেন, আজ আমি যেই সুন্দর মানুষ দেখিলাম, এই রকম কাহাকেও দেখি নাই, এমন কি সুন্দরী যুবতীও এত সুন্দর দেহবিশিষ্ট দেখি নাই। (আমিরের) এই কথা বলার সাথে সাথে সহল সেখানে লুটাইয়া পড়িল। এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের খেদমতে হাযির হইয়া আরয করিল, ইয়া রাসূলাল্লাহ্! আপনি সহল ইবনে হুনাইফ (বা হানীফ)-এর কিছু খবর রাখেন কি? আল্লাহর কসম! সে মস্তক উত্তোলন করিতে পারিতেছে না। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, তুমি কি মনে করিতেছ যে, তাহাকে কেহ বদনজর দিয়াছে লোকটি বলিল, হ্যাঁ, আমর ইবন রবী'আ (বদনজর দিয়াছে)। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আমির ইবন রবী’আকে ডাকিয়া ক্রোধান্বিত হইয়া তাহাকে বলিলেন, তোমাদের কেহ নিজের মুসলিম ভাইকে কেন নিহত করিতেছ? তুমি (بارك الله) কেন বলিলে না? এইবার তুমি তাহার জন্য গোসল কর। অতএব আমির হাত, মুখ, হাতের কনুই, হাটু, পায়ের আশেপাশের স্থান এবং লুঙ্গির নিচের আবৃত দেহাংশ ধৌত করিয়া ঐ পানি একটি বরতনে জমা করিল। সেই পানি সহলের দেহে ঢালিয়া দেওয়া হইল। অতঃপর সদল সুস্থ হইয়া গেল এবং সকলের সঙ্গে রওয়ানা হইল।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1712
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "রেওয়ায়ত ৩. হুমাইদ ইবন কাইস মক্কী (রহঃ) বলেন, জাফর ইবনে আবী তালিব (রাঃ)-এর দুইটি ছেলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আসিল। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাদের আয়া (মহিলা খাদেম)-এর কাছে জিজ্ঞাসা করিলেন, এই ছেলেরা এত জীর্ণশীর্ণ (দুর্বল) কেন? আয়া উত্তর দিল, ইয়া রাসূলাল্লাহ! তাহদের উপর খুব তাড়াতাড়ি (খুব সহজেই) বদ নজর লাগিয়া যায়। আর তাহাদেরকে কোন রকম ঝাড়ফুক করাই নাই। কারণ হয়ত বা আপনি উহা পছন্দ করেন না। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, ইহাদের জন্য ঝাড়ফুকের ব্যবস্থা কর। কেননা যদি কোন বস্তু তকদীরের অগ্ৰে কোন কর্ম সম্পন্ন করিতে পারিত তবে উহা বদনজর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1713
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "রেওয়ায়ত ৪. উরওয়া ইবন যুবাইর (রহঃ) বর্ণিত, নবী-পত্নী উম্মে সালমা (রাঃ)-এর ঘরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রবেশ করিলেন। তখন ঘরে একটি বাচ্চা ক্ৰন্দন করিতেছিল। লোকেরা আরয করিল, বাচ্চাটির উপর বদনজর লাগিয়াছে। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, বদনজরের জন্য ঝাড়ফুক করাইতেছ না কেন?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1714
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "রেওয়ায়ত ৫. আতা ইবন ইয়াসার (রহঃ) বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, যখন কোন (আল্লাহর) বান্দা রোগাক্রান্ত হয় তখন আল্লাহ তা’আলা তাহার কাছে দুইজন ফেরেশতা প্রেরণ করেন এবং বলেন, রোগাক্রান্ত ব্যক্তি যাহারা তাহাকে দেখিতে আসে সেই সমস্ত লোককে কি বলে দেখ, যদি সে আগন্তুকদের কাছে আল্লাহর প্রশংসা করে তখন উক্ত দুইজন ফেরেশতা সেই প্রশংসা লইয়া আল্লাহর দরবারে হাজির হয়। (অতঃপর আল্লাহ তা’আলা সেই ফেরেশতাদ্বয়ের কাছে জিজ্ঞাসা করেন, সে কি বলিয়াছে?) অথচ তিনি উহা সবচাইতে বেশি অবগত আছেন। অতঃপর (ফেরেশতা যখন সেই প্রশংসার কথা বলেন তখন) আল্লাহ বলেন, যদি আমি আমার সেই (রুগ্ন) বান্দাকে (এই রোগের মাধ্যমে) ওফাত দান করি, তবে আমি তাহাকে বেহেশতে প্রবেশ করাইব। আর যদি সুস্থ করিয়া দিই, তবে আগের চাইতে অধিক গোশত ও রক্ত দান করিব (অর্থাৎ ভাল স্বাস্থ্য দান করিব) এবং তাহার গুনাহ মাফ করিয়া দিব।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1715
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "রেওয়ায়ত ৬. নবী-পত্নী আয়েশা (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফরমাইয়াছেন, মু'মিন যদি কোন মুসিবতে পতিত হয়, এমন কি যদি (সামান্য) একটি কাঁটাও বিধে, তবে তাহার গুনাহ মাফ করা হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1716
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "রেওয়ায়ত ৭. আবু হুরায়রা (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, আল্লাহ তা’আলা যাহার মঙ্গল চাহেন তাহার উপর মুসিবত ঢালিয়া দেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1717
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "রেওয়ায়ত ৮. ইয়াহইয়া ইবনে সায়ীদ (রহঃ) বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের যুগে এক ব্যক্তি মারা গেল, তখন অপর এক ব্যক্তি বলিল, বাহ! কী চমৎকার মৃত্যুবরণ করিল। কোন রকম রোগে আক্রান্তও হইল না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি ইহা কি বলিতেছ। তুমি কি জান আল্লাহ্ পাক যদি তাহাকে কোন রোগে আক্রান্ত করিতেন, তবে তাহার গুনাহ মাফ হইয়া যাইত",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1718
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "রেওয়ায়ত ৯. উসমান ইবনে আবিল আস (রাঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট গিয়াছিলাম, আর (তখন) আমার এমন ব্যথা হইতেছিল যে, আমি যেন মারা যাইব! অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, তোমার (হৃদযন্ত্রের উপর) ডান হস্ত রাখিয়া সাতবার এই দোয়া পড়িয়া মালিশ করঃ أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ আমি যাহা অনুভব করিতেছি উহার ক্ষতি হইতে আল্লাহর ইজ্জত ও কুদরতের আশ্রয় প্রার্থনা করিতেছি। (উসমান বলেন) আমি তাহাই করিলাম। আল্লাহ তা’আলা আমার ব্যথা দূর করিয়া দিলেন। অতঃপর আমি সর্বদা পরিবারের সকলকে এবং অপরাপর মানুষকে সেইরূপ করার নির্দেশ দিতাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1719
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "রেওয়ায়ত ১০. আয়েশা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখনই অসুস্থ হইতেন তখন সূরা ফালাক ও সূরা নাস পড়িয়া (নিজের উপর) দম করিতেন। আয়েশা (রাঃ) বলেন, যখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ব্যথা অধিক হইত, তখন আমি নিজে সেই সূরাদ্বয় পড়িয়া বরকতের জন্য তাহার (প্রিয় নবীর) ডান হাত দিয়া মালিশ করিয়া দিতাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1720
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "রেওয়ায়ত ১১. আমর বিনতে আবদুর রহমান (রাঃ) বলেন, আবু বকর সিদ্দীক (রাঃ) আয়েশা (রাঃ)-এর নিকট গেলেন। তখন তিনি (আয়েশা) অসুস্থা ছিলেন এবং জনৈক ইহুদী মহিলা (কিছু) পাঠ করিয়া তাহার উপর দম করিতেছিলেন। আবু বকর (রাঃ) বললেন, আল্লাহ্‌র কিতাব পড়িয়া দম কর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1721
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "রেওয়ায়ত ১২. যায়দ ইবনে আসলাম (রহঃ)-এর বর্ণনা রাসূলুল্লাহ্ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের যুগে এক ব্যক্তির (শরীর) যখম হইয়াছিল। সেই যখমে রক্ত জমিয়া গিয়াছিল। অতঃপর লোকটি বনী আনযাম গোত্রের দুই ব্যক্তিকে (উহার চিকিৎসার জন্য) ডাকাইল। তাহারা আসিয়া (যখন পরীক্ষা-নিরীক্ষা করিয়া) দেখিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাদেরকে জিজ্ঞাসা করিলেন, তোমাদের উভয়ের মধ্যে চিকিৎসা বিজ্ঞান কে অধিক জানে? তাহারা বলিল, ইয়া রাসূলাল্লাহ! চিকিৎসা বিজ্ঞানে কোন উপকার আছে কি? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, ঔষধ তো তিনিই নাযিল করিয়াছেন, যিনি রোগ নাযিল করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Isnaad Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1722
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "রেওয়ায়ত ১৩. ইয়াহইয়া ইবনে সাঈদ (রহঃ) বলেন, আমার কাছে রেওয়ায়ত পৌছিয়াছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের যুগে সা'দ ইবনে যুরারা (রাঃ) খান্নাক রোগে (গলার ব্যাধি) আক্রান্ত হইয়া চিকিৎসা হিসাবে লোহা পোড়াইয়া দাগাইয়াছিলেন। কিন্তু তিনি মারা যান।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1723
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "রেওয়ায়ত ১৪. নাফি’ (রহঃ)-এর বর্ণনা, আবদুল্লাহ ইবন উমর (রাঃ) লকওয়া-এর জন্য লোহা পোড়াইয়া দাগ লাগাইয়াছিলেন এবং বিচ্ছুর (দংশনের) জন্য ঝাড়ফুঁক করিয়াছিলেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1724
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "রেওয়ায়ত ১৫. ফাতিমা বিনত মুনযির আসমা বিনতে আবু বকর (রাঃ)-এর নিকট যখনই কোন জ্বরাক্রান্ত স্ত্রীলোক আসিত, তিনি পানি আনাইয়া তাহার বুকের উপর ঢালিয়া দিতেন এবং বলিতেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জ্বরকে পানি দ্বারা ঠাণ্ডা করিবার নির্দেশ দিতেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1725
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "রেওয়ায়ত ১৬. উরওয়া ইবনে যুবাইর (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফরমাইয়াছেন যে, জ্বর হইল জাহান্নামের উদগিরণ। অতএব উহাকে পানি দ্বারা ঠাণ্ডা কর। নাফি' (রহঃ) হইতে ইবন উমর (রাঃ) সূত্রে বর্ণিত রসূলুল্লাহ সাল্লাল্লাহু আলয়হি ওয়া সাল্লাম ফরমাইয়াছেন যে, জ্বর হইল জাহান্নামের উদগিরণ। অতএব উহাকে পানি দ্বারা ঠাণ্ডা কর।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1726
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1727
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "রেওয়ায়ত ১৭. জাবির ইবন আবদুল্লাহ (রাঃ)-এর বর্ণনা, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, তোমাদের মধ্যে যখন কেহ রোগী দেখিতে যায়, তখন সে আল্লাহর রহমতের মধ্যে ঢুকিয়া পড়ে। অতঃপর যখন সে সেখানে বসে, তখন সেই রহমত তাহার ভিতরে অবস্থান করে কিংবা এই রকমই কিছু তিনি বলিয়াছেন।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1728
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "রেওয়ায়ত ১৮. ইবন আতিয়া (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, রোগের ছোঁয়াচ বা সংক্রমণ বলিয়া কিছুই নাই। পেঁচা অশুভ পাখি এবং সফর মাসে অমঙ্গলজনক কিছুই নাই। তবে রোগা উটকে সুস্থ উটের সহিত রাখিও না (বা বাধিও না)। অবশ্য সুস্থ উটকে যেখানে ইচ্ছা রাখিতে পার। অতঃপর সাহাবীগণ জিজ্ঞাসা করিলেন, ইয়া রাসূলাল্লাহ! এই রকম কেন? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, রোগ একটি কষ্ট বিশেষ।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1729
			}
		}
	]
}