{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"52": "Visions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1747,
			"arabicnumber": 1747,
			"text": "রেওয়ায়ত ১. আনাস ইবনে মালিক (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, নেককার মানুষের ভাল স্বপ্ন নবুয়তের ছেচল্লিশ ভাগের একভাগ সমতুল্য।[1]আবু হুরায়রা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হইতে অনুরূপ (অর্থাৎ পূর্বোক্ত হাদীস) রেওয়ায়ত করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 52,
				"hadith": 1747
			}
		},
		{
			"hadithnumber": 1749,
			"arabicnumber": 1749,
			"text": "রেওয়ায়ত ২. আবু হুরায়রা (রাঃ)-এর বর্ণনা, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের নামায শেষে (উপস্থিত সাহাবীগণকে) জিজ্ঞাসা করিতেন, তোমাদের কেহ রাত্রে কোন স্বপ্ন দেখিয়াছ কি? অতঃপর বলিতেন যে, আমার পরে ভাল (সত্য) স্বপ্ন ব্যতীত নবুয়তের কিছুই অবশিষ্ট থাকিবে না (অর্থাৎ ভাল স্বপ্নও নবুয়তের একটি অংশ)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 52,
				"hadith": 1749
			}
		},
		{
			"hadithnumber": 1750,
			"arabicnumber": 1750,
			"text": "রেওয়ায়ত ৩. আতা ইবনে ইয়াসার (রাঃ)-এর রেওয়ায়ত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, আমার পরে মুবাশশিরাত (সুসংবাদসমূহ) ব্যতীত নবুয়তের কিছুই অবশিষ্ট থাকিবে না। সাহাবীগণ আরয করিলেন, ইয়া রাসূলাল্লাহ! মুবাশশিরাত কি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, এমন ভাল ও শুভ স্বপ্ন যাহা কোন নেককার মানুষে দেখে কিংবা অপর কেহ তাহার (উক্ত নেককার) সম্বন্ধে দেখে। ইহা নবুয়তের ছেচল্লিশ ভাগের এক ভাগ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 52,
				"hadith": 1750
			}
		},
		{
			"hadithnumber": 1751,
			"arabicnumber": 1751,
			"text": "রেওয়ায়ত ৪. আবু কাতাদ ইবনে রিবয়ী (রাঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট শ্রবণ করিয়াছি, তিনি বলিয়াছেন, যে ভাল স্বপ্ন আল্লাহর পক্ষ হইতে হয় এবং দুঃস্বপ্ন শয়তানের পক্ষ হইতে হয়। সুতরাং তোমাদের কেহ যদি কোন খারাপ স্বপ্ন দেখে তাহা হইলে সে যেন বাম দিকে তিনবার থুথু ফেলে এবং উহার অমঙ্গল হইতে আল্লাহর আশ্রয় প্রার্থনা করে। কারণ আল্লাহ চাহেন তো উহা আর তাহার কোন অনিষ্ট করিতে পারিবে না। আবু সালমা বলেন, আগে আমি এমন স্বপ্ন দেখিতাম, যাহা আমার উপর পাহাড়ের চাইতেও অধিক বোঝা হইত। কিন্তু যখন হইতে এই হাদীস শ্রবণ করিয়াছি, আমি আর সেই দিকে ক্ৰক্ষেপও করি নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 52,
				"hadith": 1751
			}
		},
		{
			"hadithnumber": 1752,
			"arabicnumber": 1752,
			"text": "রেওয়ায়ত ৫. উরওয়া ইবন যুবায়র (রহঃ) এই আয়াত সম্বন্ধে(তাহাদের জন্য দুনিয়া ও আখিরাতে সুসংবাদ রহিয়াছে) বলেন যে, ইহার অর্থ হইল ঐ সমস্ত ভাল স্বপ্ন, যাহা নেককার মানুষে দেখে কিংবা অপর কেহ তাহার সম্বন্ধে (বা তাহার জন্য) দেখে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 52,
				"hadith": 1752
			}
		},
		{
			"hadithnumber": 1753,
			"arabicnumber": 1753,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 52,
				"hadith": 1753
			}
		},
		{
			"hadithnumber": 1754,
			"arabicnumber": 1754,
			"text": "রেওয়ায়ত ৬. আবূ মূসা আশ'আরী (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, যে ব্যক্তি শতরঞ্জ খেলা খেলিল, সে আল্লাহ ও আল্লাহর রাসূলের নাফরমানী করিল (অবাধ্য হইল)।[1] নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী আয়েশা (রাঃ) হইতে বর্ণিত, তাহার বাড়ির একটি ঘরে কিছুসংখ্যক লোক বাস করিত। তিনি শুনিয়াছেন যে, উহাদের নিকট শতরঞ্জ রহিয়াছে। অতঃপর তিনি তাহাদের নিকট বলিয়া পাঠাইলেন, তোমরা উহা (শতরঞ্জ) দূর কর। অন্যথায় আমি তোমাদেরকে আমার ঘর হইতে বাহির করিয়া দিব। তিনি উহাকে অত্যন্ত খারাপ মনে করিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 52,
				"hadith": 1754
			}
		},
		{
			"hadithnumber": 1755,
			"arabicnumber": 1755,
			"text": "রেওয়ায়ত ৭. আবদুল্লাহ ইবন উমর (রাঃ) তাহার পরিবারের কাহাকেও শতরঞ্জ খেলিতে দেখিলে তাহাকে মারিতেন এবং শতরঞ্জ ভাঙ্গিয়া ফেলিতেন। ইয়াহইয়া (রহঃ) বলেন, আমি মালিক (রহঃ) হইতে শুনিয়াছি, তিনি বলিয়াছেন, শতরঞ্জ খেলা ভাল নহে। তিনি উহাকে মাকরূহ মনে করিতেন। আমি (ইমাম) মালিক (রহঃ)-এর নিকট শ্রবণ করিয়াছি, তিনি বলিতেন যে, শতরঞ্জ খেলা, অপরাপর সকল অনর্থ এবং উদ্দেশ্যহীন খেলা মকরূহ। অতঃপর এই আয়াত তিলাওয়াত করিতেন (‏فَمَاذَا بَعْدَ الْحَقِّ إِلاَّ الضَّلاَلُ) (হক-এর পর পথভ্রষ্টতা ছাড়া আর কিছু নাই)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 52,
				"hadith": 1755
			}
		}
	]
}