{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"53": "Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "রেওয়ায়ত ১. যায়দ ইবন আসলাম (রহঃ) হইতে বর্ণিত, রাসূলল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন যে, সওয়ার ব্যক্তি পথচারীকে সালাম করিবে। আর যখন দলের কোন এক ব্যক্তি সালাম করে, উহা সকলের পক্ষ হইতে যথেষ্ট হইবে।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1756
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "রেওয়ায়ত ২. মুহাম্মদ ইবনে আমর ইবনে আতা (রহঃ) বর্ণনা করেন, আমি আবদুল্লাহ ইবনে আব্বাস (রাঃ)-এর নিকট ছিলাম; এমন সময় ইয়ামনের অধিবাসী এক ব্যক্তি আসিয়া বলিল, “আসসালামু আলাইকুম ওয়া রহমাতুল্লাহি ওয়া বরকাতুহু।” আরও কয়েকটি শব্দ ইহার সহিত সংযোজন করিল। তখনকার সময়ে ইবনে আব্বাসের দৃষ্টিশক্তি ছিল না। তাই তিনি জিজ্ঞাসা করিলেন, ইনি কে? উপস্থিত সকলে বলিল, ইনি সেই ইয়ামনী লোক, যে আপনার কাছে (সর্বদা) আসা-যাওয়া করে। এই বলিয়া তাহারা লোকটির পরিচয় করাইয়া দিল। তখন ইবনে আব্বাস (রাঃ) লোকটিকে চিনতে পারিলেন। অতঃপর ইবনে আব্বাস লোকটিকে বলিলেন, “বরকত” পর্যন্ত সালাম শেষ হয়।[1] ইয়াহইয়া (রহঃ) বলেন, মালিক (রহঃ)-এর নিকট জিজ্ঞাসা করা হইল যে, পুরুষ স্ত্রীলোককে (কিংবা স্ত্রীলোক পুরুষকে) সালাম করিবে কি? তিনি উত্তর দিলেন যে, বৃদ্ধের জন্য তো ইহা খারাপ নহে, তবে যুবক (যুবতী)-এর জন্য ভাল নয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1757
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": 1758,
			"text": "রেওয়ায়ত ৩. আবদুল্লাহ ইবন উমর (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, ইহুদীদের কেহ তোমাদেরকে সালাম দিলে তাহারা বলে \"আসসামু আলাইকুম\" (অর্থাৎ তোমার মৃত্যু হউক)। এতদুত্তরে তোমরা কেবল “ওয়ালাইকুম\" বলিবে (অর্থাৎ মৃত্যু তোমাদের হউক)। মালিক(রহঃ)-এর কাছে জিজ্ঞাসা করা হইল, যদি কেহ কোন ইহুদী অথবা খ্রিস্টানকে সালাম করে, তবে কি উহা গৃহীত হইবে? এতদুত্তরে তিনি বলিলেন, না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1758
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "রেওয়ায়ত ৪. আবু ওয়াকিদ লাইসী (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদে ছিলেন, আরও বহু লোক তাহার সঙ্গে ছিলেন। ইত্যবসরে তিন ব্যক্তিবিশিষ্ট একটি দল সেখানে আগমন করিল। ইহাদের মধ্যে দুইজন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর দিকে অগ্রসর হইল এবং একজন চলিয়া গেল (প্রত্যাবর্তন করিল)। অতঃপর ঐ দুইজন রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট গিয়া সালাম করিল। তাহাদের একজন (সাহাবীগণের) হালকায় স্থান পাইয়া সেখানে বসিল এবং অপরজন তাহদের পিছনে বসিল। তৃতীয়জন তো আগেই চলিয়া গিয়াছিল। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা’লীম হইতে ফারিগ হইলেন এবং বলিলেন আমি তোমাদেরকে এই (আগন্তুক) তিনজনের অবস্থা বলিব কি? (অর্থাৎ নিশ্চয়ই বলিব)। উহাদের একজন আল্লাহর কাছে আগমন করিয়াছে। আল্লাহও তাহাকে স্থান দান করিয়াছেন আর একজন লজ্জা করিয়াছে (এবং মানুষকে কষ্ট দিয়া ভিতরে প্রবেশ করে নাই, বরং পিছনে রহিয়াছে) আল্লাহ তা’আলাও লজ্জা করিয়াছেন (এবং তাহার প্রতি রহমত নাযিল করিয়াছেন)। আর একজন ফিরিয়া গিয়াছে; অতঃপর আল্লাহ তা’আলাও তাহার দিক হইতে ফিরিয়া গিয়াছেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1759
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": 1760,
			"text": "রেওয়ায়ত ৫. আনাস ইবনে মালিক (রাঃ) উমর (রাঃ) হইতে শুনিয়াছেন যে, এক ব্যক্তি তাহাকে (উমরকে) সালাম করিলে পর তিনি সালামের জওয়াব দিলেন এবং জিজ্ঞাসা করিলেন, কেমন আছ? লোকটি বলিল, আল্লাহর শোকর (ভাল আছি)। উমর (রাঃ) বলিলেন, আমি তোমার কাছে ইহাই কামনা করিয়াছিলাম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1760
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "রেওয়ায়ত ৬. ইসহাক ইবনে আবদুল্লাহ ইবনে আবু তালহা (রহঃ) বলেন, তুফাইল ইবনে উবাই ইবনে কা'ব (রহঃ) সকালে সকালে আবদুল্লাহ ইবনে উমর (রাঃ)-এর নিকট আসিতেন এবং তাহার সঙ্গে বাজারে গমন করিতেন। তুফাইল (রাঃ) বলেন, আমরা বাজারে পৌছিলে ইবনে উমর (রাঃ) যে কোন মামুলী জিনিস বিক্রেতাকে যেকোন দোকানদারকে, যেকোন মিসকীনকে, এমন কি প্রত্যেককে সালাম দিতেন। তুফাইল বলেন, একদা আমি আবদুল্লাহ ইবনে উমর (রাঃ)-এর নিকট গেলাম। পরে তিনি আমাকে বাজারে লইয়া যাইতে চাহিলেন। আমি বলিলাম, আপনি বাজারে যাইয়া কি করিবেন? বেচাকেনার নিকটে আপনি যান না, কোন বস্তু সম্বন্ধে কিছু জিজ্ঞাসা করেন না, কোন জিনিসের দামও জিজ্ঞাসা করেন না কিংবা বাজারের কোন মজলিসেও বসেন না। ইহার চাইতে এখানে বসিয়া থাকুন এবং আমরা পরস্পর আলাপ-আলোচনা করি। অতঃপর আবদুল্লাহ ইবনে উমর (রাঃ) বলিলেনঃ হে ভুড়িওয়ালা! (তুফাইলের পেট মোটা ছিল বলিয়া এই রকম বলিলেন) আমি সালাম করিবার জন্যই বাজারে যাই, যাহার সাথে সাক্ষাৎ হয় তাহাকে সালাম করি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1761
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1762
			}
		}
	]
}