{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"55": "The Oath of Allegiance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"text": "রেওয়ায়ত ১. আবদুল্লাহ ইবন দীনার (রহঃ) হইতে বর্ণিত, আবদুল্লাহ্ ইবনে উমর (রাঃ) বলিয়াছেন, আমরা যখন রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট তাহার কথা শ্রবণ করিব এবং মানিয়া চলিব বলিয়া বায়’আত গ্রহণ করিতাম তখন তিনি বলিতেন, তোমরা যাহা পার (অর্থাৎ যতটুকু তোমাদের শক্তিতে কুলায় ততটুকু আমল করিবে)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 55,
				"hadith": 1808
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"text": "রেওয়ায়ত ২. উমাইয়া বিনুত রুকাইকা (রাঃ) বলেন, আমি অপরাপর মহিলার সহিত রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট বায়’আত গ্রহণের জন্য গমন করিলাম। অতঃপর তাহারা (মহিলাগণ) আরয করিল, ইয়া রাসূলাল্লাহ্! আমরা আপনার নিকট এই কথার বায়’আত গ্রহণ করিতেছি যে, আমরা আল্লাহর সহিত অপর কোন বস্তুকে শরীক করিব না, চুরি করিব না, যেনা (ব্যভিচার) করিব না, আমাদের সন্তানদেরকে হত্যা করিব না। আমরা নিজে কাহারও বিরুদ্ধে অপবাদ রটাইব না এবং যেকোন ভাল কাজে আপনার নাফরমানী (বিরুদ্ধাচরণ) করিব না। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, তোমাদের সাধ্যানুযায়ী করিবে। অতঃপর তাহারা বলিল, আল্লাহ্ ও তাহার রাসূল আমাদের প্রতি আমাদের নিজেদের চাইতেও অধিক দয়ালু। অতএব, ইয়া রাসূলাল্লাহ! আসুন, আমরা আপনার সাথে হাত মিলাই। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, আমি স্ত্রীলোকদের সহিত হাত মিলাই না। আমার কথা এক শত মহিলার জন্য যেই রকম, একজনের জন্যও ঠিক সেই রকম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 55,
				"hadith": 1809
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "রেওয়ায়ত ৩. আবদুল্লাহ ইবন দীনার (রহঃ) হইতে বর্ণিত, আবদুল্লাহ ইবনে উমর (রাঃ) আবদুল মালিক ইবনে মারওয়ানের নিকট এই মর্মে একটি বায়’আতনামা লিখিলেন, বিসমিল্লাহির রাহমানির রাহীম, আল্লাহর বান্দা আবদুল মালিকের নিকট, যিনি মুসলিমদের আমীর। আপনার উপর শান্তি বর্ষিত হউক, আমি সেই আল্লাহর প্রশংসা করিতেছি, যিনি ব্যতীত অন্য কোন উপাস্য নাই। আমি এই কথার স্বীকারোক্তি দিতেছি, আমি আমার সাধ্যানুযায়ী আপনার কথা শ্রবণ করিব এবং মানিব যদি আল্লাহ্ ও তাহার রাসূলের নির্দেশ মুতাবিক হয়।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 55,
				"hadith": 1810
			}
		}
	]
}