{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"56": "Speech"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "রেওয়ায়ত ১. আবদুল্লাহ ইবনে উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, যদি কেহ নিজের কোন ভাইকে কাফের বলে, তবে এতদুভয়ের মধ্যে একজন (নিশ্চয়ই) কাফের হইল।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1811
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "রেওয়ায়ত ২. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, যদি তুমি কাহাকেও এই কথা বলিতে শুনিতে পাও যে, মানুষ ধ্বংস হইয়াছে, তাহা হইলে সে সবচাইতে অধিক ধ্বংস হইয়াছে।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1812
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "রেওয়ায়ত ৩. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, তোমাদের কেহই যেন দাহরকে (যুগ বা জমানাকে) মন্দ না বলে। কেননা আল্লাহই দাহর (যুগ)।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1813
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "রেওয়ায়ত ৪. ইয়াহইয়া ইবন সাঈদ (রহঃ) হইতে বর্ণিত, ঈসা ইবনে মরিয়ম (আঃ)-এর সম্মুখে পথে একটি শূকর আসিল। তিনি তখন বলিলেন, নিরাপদে তুমি চলিয়া যাও। লোকেরা তাহাকে বলিল, আপনি শূকরের সাথে কথা বলিতেছেন? (অথচ ইহা সর্বনিকৃষ্ট অশুচি জীব। ইহাকে তো মারিয়া এবং গালমন্দ দিয়া তাড়াইয়া দেওয়া দরকার!) অতঃপর তিনি বলিলেন, ইহাতে আমার মুখ খারাপ কথায় অভ্যস্ত হইবে বলিয়া আমি ভয় করিতেছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1814
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "রেওয়ায়ত ৫. বিলাল ইবনে হারিস মুযানী (রাঃ) হইতে বর্ণিত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, (অনেক সময়) মানুষ কথা বলে, কিন্তু সেই কথা কোথায় তাহাকে পৌছাইবে, সে তাহা জানে না। অথচ সেই কথার জন্য আল্লাহ তা’আলা তাহার জন্য স্বীয় সন্তুষ্টি কিয়ামত পর্যন্ত লিখিয়া দেন। আবার কোন সময় এমন কথা কেহ বলে, সেই কথা কোথায় গিয়া ক্রিয়া করে সে তাহা জানে না, অথচ সেই কথার জন্য আল্লাহ তা’আলা তাহার জন্য কিয়ামত পর্যন্ত স্বীয় অসন্তুষ্টি লিখিয়া দেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1815
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "রেওয়ায়ত ৬. আবূ সালেহ সাম্মান (রহঃ) হইতে বর্ণিত, আবু হুরায়রা (রাঃ) বলিয়াছেন যে, (অনেক সময়) মানুষ চিন্তা না করিয়া কথা বলে, পরিণামে সে জাহান্নামে পতিত হয়; আবার চিন্তা না করিয়া (এমন) কথা কেহ বলে, যাহার ফলে সে বেহেশতে গমন করে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1816
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "রেওয়ায়ত ৭. যায়দ ইবনে আসলম আবদুল্লাহ ইবন উমর (রাঃ) বর্ণনা করেন যে, পূর্বদিক হইতে দুইজন লোক আগমন করিল। তাহারা বক্তৃতা দান করিল এবং তাহাদের বক্তৃতায় জনসাধারণ আশ্চর্যান্বিত হইল। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, নিঃসন্দেহে কোন কোন বক্তৃতা যাদুর মতো ক্রিয়া করে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1817
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": 1818,
			"text": "রেওয়ায়ত ৮. মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌছিয়াছে যে, ঈসা ইবনে মরিয়ম (আঃ) বলতেন, আল্লাহর যিকির ব্যতীত অনর্থক বেশি কথা বলিও না। অন্যথায় তোমাদের অন্তর কঠিন হইয়া যাইবে। আর কঠিন হৃদয়ের ব্যক্তি আল্লাহ হইতে দূরে থাকে, অথচ তোমরা তাহা জান না। আর তোমরা অপরের গুনাহের দিকে (এইভাবে) তাকাইও না যেন তোমরা তাহাদের প্রভু! তোমরা নিজেদের গুনাহের দিকে (এইভাবে) তাকাও, যেন তোমরা গোলাম। কেননা মানুষ অনেক রকমের হয়। কেহ রোগী আর কেহ সুস্থ। অতএব, রোগীদের প্রতি সদয় হও এবং নিজের সুস্থতার জন্য আল্লাহর শোকর আদায় কর ।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1818
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": 1819,
			"text": "রেওয়ায়ত ৯. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী আয়েশা (রাঃ) ইশার নামাযের পর আপনজনদের কাছে বলিয়া পাঠাইতেন যে, লেখক ফেরেশতাদেরকে এখনও আরাম (অবসর) দিবে না?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1819
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": 1820,
			"text": "রেওয়ায়ত ১০. মুত্তালিব ইবনে আবদুল্লাহ মাখযুমী (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট এক ব্যক্তি জিজ্ঞাসা করিল, গীবত কি (বা গীবত কাহাকে বলে)? এতদুত্তরে রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লাম বলিলেন, কাহারও অবর্তমানে তাহার এমন কথা প্রকাশ করা যাহা সে শুনিলে অসন্তুষ্ট হইবে। অতঃপর লোকটি (আবার) বলিল, ইয়া রাসূলাল্লাহ! কথা যদি সত্য হয় (অর্থাৎ যাহা বলা হইতেছে উহা যদি মিথ্যা না হয়, বরং সত্য হয় তাহা হইলেও কি উহা গীবত হইবে)? তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, যদি মিথ্যা হয়, (তবে উহাকে গীবত বলা হয় না; বরং) উহা বুহতান (অপবাদ)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1820
			}
		},
		{
			"hadithnumber": 1821,
			"arabicnumber": 1821,
			"text": "রেওয়ায়ত ১১. আতা ইবনে ইয়াসার (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, আল্লাহ তা’আলা যাহাকে দুইটি জিনিসের অনিষ্ট হইতে রক্ষা করিবেন সে বেহেশতে যাইবে। (ইহা শুনিয়া) এক ব্যক্তি বলিল, ইয়া রাসূলাল্লাহ! সেই দুইটি জিনিস কি? আপনি কি আমাদেরকে বলিবেন না? অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নীরব হইয়া গেলেন। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেই প্রথম কথার পুনরাবৃত্তি করিলেন। লোকটি আবার বলিল, ইয়া রাসূলাল্লাহ! আমাদেরকে উহা বলিবেন না? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নীরব হইয়া গেলেন। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পুনরায় সেই কথা বলিলেন। লোকটি আবার বলিল, ইয়া রাসূলাল্লাহ! আমাদেরকে বলিবেন না? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবার সেই কথা বলিলেন। লোকটিও সেই একই কথা বলিল (অর্থাৎ আপনি আমাদেরকে উহা বলিবেন না?) অতঃপর লোকটির পার্শ্বে উপবিষ্ট এক ব্যক্তি তাহাকে চুপ করাইল। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজেই বলিলেন, “আল্লাহ্ পাক যাহাকে দুইটি জিনিসের অনিষ্ট হইতে রক্ষা করিবেন সে বেহেশতে যাইবে। একটি হইল দুই চোয়ালের মধ্যবর্তী বস্তু (জিহ্বা), অপরটি হইল দুই রানের মধ্যবর্তী বস্তু (লজ্জাস্থান)। এই কথাটি তিনবার বলিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1821
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": 1822,
			"text": "রেওয়ায়ত ১২. যাইদ ইবনে আসলম (রাঃ) তাহার পিতা হইতে বর্ণনা করেন, উমর ইবনে খাত্তাব (রাঃ) আবু বকর সিদ্দীক (রাঃ)-এর নিকট গিয়া দেখিলেন যে, আবু বকর (রাঃ) স্বীয় জিহ্বা ধরিয়া টানিতেছেন। উমর (রাঃ) বলিলেন, রাখুন (অর্থাৎ এই রকম করবেন না), আল্লাহ আপনাকে ক্ষমা করুন। অতঃপর আবু বকর (রাঃ) বলিলেন, এই জিহ্বাই তো আমাকে ধ্বংসের মুখে ঠেলিয়া দিয়াছে",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1822
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": 1823,
			"text": "রেওয়ায়ত ১৩. আবদুল্লাহ ইবন দীনার (রহঃ) বলেন, আমি ও আবদুল্লাহ ইবনে উমর (রাঃ) খালিদ ইবন উকবা (রাঃ)-এর সেই ঘরের নিকটে ছিলাম যাহা বাজারে অবস্থিত ছিল। ইত্যবসরে এক ব্যক্তি আসিয়া তাহার সহিত কানে কানে কিছু কথা বলিতে ইচ্ছা করিল। আবদুল্লাহ (ইবনে উমর)-এর সঙ্গে আমি ও সেই ব্যক্তি ব্যতীত, যে তাহার সহিত কানে কানে কথা বলিতে চাহিয়াছিল, আর কেহ ছিল না। অতঃপর আবদুল্লাহ ইবনে উমর (রাঃ) অপর এক ব্যক্তিকে ডাকিয়া লইলেন। এখন আমরা চারিজন হইলাম এবং তিনি আমাকে ও সেই ব্যক্তিকে একটু সরিয়া যাইতে বললেন, যাহাকে ডাকিয়া লইয়াছিলেন এবং বলিলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট শ্রবণ করিয়াছি, তিনি বলিয়াছেন, দুইজন একজনকে একা ছাড়িয়া কানে কানে কথা বলিবে না। ইহাতে তৃতীয় ব্যক্তি দুঃখিত হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1823
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": 1824,
			"text": "রেওয়ায়ত ১৪. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, যদি তিনজন এক সঙ্গে হয়, তবে একজনকে ছাড়িয়া অবশিষ্ট দুইজন কানে কানে কথা বলিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1824
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": 1825,
			"text": "রেওয়ায়ত ১৫. সাফওয়ান ইবনে সুলাইম (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট এক ব্যক্তি আসিয়া বলিল, আমি আমার স্ত্রীর সাথে মিথ্যা বলিতে পারিব কি? এতদুত্তরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, মিথ্যা কথায় কোন উপকার নাই। লোকটি আবার বলিল, আমি'তাহার সাথে ওয়াদা তো করিতে পারিব যে, আমি তোমাকে এই জিনিস দিব। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, ইহাতে কোন দোষ নাই।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1825
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": 1826,
			"text": "রেওয়ায়ত ১৬. মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌঁছিয়াছে যে, আবদুল্লাহ্ ইবনে মাসউদ (রাঃ) বলতেন, তোমরা সত্য বলা নিজের উপর ওয়াজিব (অনিবার্য) করিয়া লও। কেননা সত্য কথা নেকীর দিকে পথ প্রদর্শন করে এবং নেকী বেহেশতের পথ সুগম করে। আর তোমরা মিথ্যা বলা হইতে সংযত হও। কেননা মিথ্যা কথা গুনাহর দিকে পথ প্রদর্শন করে এবং গুনাহ দোযখের পথ সুগম করে। তুমি কি শোন নাই, ইহা বলা হয় যে, সত্যই নেকী এবং মিথ্যাই গুনাহ?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1826
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": 1827,
			"text": "রেওয়ায়ত ১৭. মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌঁছিয়াছে যে, লুকমান (আঃ)-এর নিকট কেহ জিজ্ঞাসা করিল, কিসের কারণে আপনি এই এত বুযুর্গী পাইলেন? লুকমান (আঃ) বলিলেন, সত্য কথা বলা, আমানতদারী এবং অনর্থক কাজ পরিহার করার কারণে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1827
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": 1828,
			"text": "রেওয়ায়ত ১৮. মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌঁছিয়াছে, আবদুল্লাহ ইবনে মাসউদ (রাঃ) বলতেন, মানুষ মিথ্যা কথা বলে। শেষ পর্যন্ত তাহার অন্তরে একটা কাল দাগ পড়ে যাহার কারণে গোটা অন্তরই কাল হইয়া যায়। অবশেষে আল্লাহর নিকট তাহার নাম মিথ্যাবাদীদের তালিকায় লিপিবদ্ধ হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1828
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": 1829,
			"text": "রেওয়ায়ত ১৯. সফওয়ান ইবনে সুলাইম (রহঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট কেহ জিজ্ঞাসা করিল, মুমিন সাহসহীন বা ভীরু হইতে পারে কি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, হ্যাঁ। আবার জিজ্ঞাসা করা হইল, মুমিন কৃপণ (বখিল) হইতে পারে কি? বলিলেন, হ্যাঁ। আবার জিজ্ঞাসা করা হইল, মু'মিন মিথ্যাবাদী হইতে পারে কি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1829
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": 1830,
			"text": "রেওয়ায়ত ২০. সুহাইল ইবন আবী সালেহ (রহঃ) তাহার পিতা হইতে, তিনি আবু হুরায়রা (রাঃ) হইতে বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, আল্লাহ তা’আলা তোমাদের তিনটি কাজে সন্তুষ্ট হন এবং তিনটি কাজে অসন্তুষ্ট হন। যেসব কাজে তিনি সন্তুষ্ট হন সেইগুলি হইল, (১) তোমরা তাহারই ইবাদত করিবে এবং তাহার সাথে আর কাহাকেও শরীক করিবে না। (২) আল্লাহর রজ্জু (অর্থাৎ কুরআন) মজবুত করিয়া ধরিবে। (৩) আল্লাহ যাহাকে শাসনের ভার দিয়াছেন তাহাকে নসীহত করবে। যেসব কাজে তিনি অসন্তুষ্ট হন, সেইগুলি হইল : (১) কথা অধিক বলা, (২) অপব্যয় করা, (৩) অধিক যাচনা করা (ভিক্ষা করা)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1830
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": 1831,
			"text": "রেওয়ায়ত ২১. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, দোমুখো মানুষই নিকৃষ্টতম ব্যক্তি অর্থাৎ যে এক দলের সঙ্গে এক রকম কথা বলে এবং অপর দলের সঙ্গে আরেক রকম কথা বলে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1831
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": 1832,
			"text": "রেওয়ায়ত ২২. নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী উম্মে সালমা (রাঃ) বলেন, ইয়া রাসূলাল্লাহ! (কিছু সংখ্যক লোকের কৃতকর্মের দরুন আসন্ন বিপদে) আমরা ধ্বংস হইয়া যাইব কি? অথচ আমাদের মধ্যে অনেক নেককার মানুষও আছে। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, হ্যাঁ, গুনাহ যখন অধিক হয়, তখন (উহার শাস্তি সকলকেই ভোগ করিতে হয়)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1832
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": 1833,
			"text": "রেওয়ায়ত ২৩. উমর ইবন আবদুল আযীয (রহঃ) বলিতেন, বিশেষ লোকের গুনাহের কারণে আল্লাহ তা’আলা জনসাধারণকে আযাব দেন না। তবে পাপাচার যদি প্রকাশ্যে হইতে থাকে, তখন সকলেই আযাবের যোগ্য হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1833
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": 1834,
			"text": "রেওয়ায়ত ২৪. আনাস ইবনে মালিক (রাঃ) বলেন, আমি উমরের সঙ্গে ছিলাম। তিনি একটি বাগানে গেলেন। আমি ও তাহার মধ্যে বাগানের একটি দেয়াল ছিল। আমি শ্রবণ করিতেছিলাম, তিনি নিজেকেই সম্বোধন করিয়া বলিতেছিলেন, হে উমর! আমীরুল মু'মিনীন বাহবা! হে খাত্তাবের পুত্র, হয় তুমি আল্লাহকে ভয় কর, না হয় তিনি তোমাকে আযাব দিবেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1834
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": 1835,
			"text": "রেওয়ায়ত ২৫. কাসেম ইবনে মুহাম্মদ (রহঃ) বলেন, আমি দেখিলাম যে, মানুষ কথায় মোহিত হয় না। মালিক (রহঃ) বলেন, ইহার অর্থ এই যে, তাহার কাজের (আমলের) দিকে তাকাইতেন, কথার দিকে তাহাদের তেমন দৃষ্টি ছিলনা।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1835
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": 1836,
			"text": "রেওয়ায়ত ২৬. আমির ইবনে আবদুল্লাহ ইবনে যুবাইর (রহঃ) বজ্রের শব্দ শুনিলে কথা বলা বন্ধ করিয়া এই দোয়া পাঠ করিতেনঃ سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلائِكَةُ مِنْ خِيفَتِهِ বজ্র নির্ঘোষ ও ফেরেশতাগণ ভয় তাহার প্রশংসা মহিমা ও পবিত্রতা ঘোষণা করে। অতঃপর তিনি (আমির ইবন আবদুল্লাহ) বলিতেন, যমীনের অধিবাসীদের জন্য এই আওয়ায অত্যন্ত কঠিন আযাবের সংবাদ।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1836
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": 1837,
			"text": "রেওয়ায়ত ২৭. মু'মিন জননী আয়েশা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের ওফাতের পর তাহার বিবিগণ ইচ্ছা করিলেন, উসমান ইবনে আফফান (রাঃ)-কে আবু বকর সিদ্দীক (রাঃ)-এর নিকট পাঠাইয়া রাসূলুল্লাহ্ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের পরিত্যক্ত সম্পত্তি দাবি করবেন। অতঃপর আয়েশা (রাঃ) তাহাদেরকে বলিলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি এই কথা বলেন নাই আমাদের কেহ ওয়ারিস হয় না, আমরা যাহা কিছু মাল রাখিয়া যাই, উহা সদকায় পরিণত হয়।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1837
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": 1838,
			"text": "রেওয়ায়ত ২৮. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, আমার পরে আমার ওয়ারিসগণ আমার সম্পত্তি ভাগ করিবে না। আমি যাহা কিছু রাখিয়া যাইব, উহা হইতে আমার বিবিগণের খাওয়া-পরা ও কর্মচারীর খরচ বাদ দিয়া যাহা অবশিষ্ট থাকিবে, উহা সদকা।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1838
			}
		}
	]
}