{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"58": "Sadaqa"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1841,
			"arabicnumber": 1841,
			"text": "রেওয়ায়ত ১. সায়ীদ ইবনে ইয়াসার (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, যে ব্যক্তি হালাল উপায়ে অর্জিত মাল সদকা করে, আল্লাহ তা’আলা হালাল অর্থাৎ পবিত্রকেই কবুল করেন – তাহা হইলে উক্ত সদকা সে আল্লাহর হাতে দিল। আল্লাহ্ পাক তাহাকে এইভাবে লালন-পালন করেন, যেইভাবে তোমরা ঘোড়ার বাচ্চা কিংবা উটের বাচ্চা লালন-পালন কর। শেষ পর্যন্ত সেই সদকা (বর্ধিত হইয়া) পর্বতসমান হইয়া যায়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1841
			}
		},
		{
			"hadithnumber": 1842,
			"arabicnumber": 1842,
			"text": "রেওয়ায়ত ২. আনাস ইবনে মালিক (রাঃ) বলেন, মদীনার আনসারগণের মধ্যে আবু তালহা (রাঃ) ছিলেন সর্বাধিক ধনী ব্যক্তি। তাঁহার সবচাইতে অধিক খেজুর বৃক্ষ ছিল। সমুদয় বাগানের মধ্যে ‘বাইরহা’ নামক বাগানটি ছিল তাহার (আবু তালহার) অধিক পছন্দনীয়। বাগানটি মসজিদে নববীর সামনেই অবস্থিত ছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লাম সেই বাগানে প্রায়ই আসা-যাওয়া করিতেন। সেখানকার পানি খুবই উত্তম ছিল, তিনি তাহা পান করিতেন। আনাস (রাঃ) বলেন, যখন এই আয়াত নাযিল হইলঃ (لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ) অর্থাৎ যতক্ষণ তোমরা তোমাদের প্রিয় বস্তু (আল্লাহর রাহে) খরচ না করিবে, ততক্ষণ তোমরা সওয়াব পাইবে না)। তখন আবু তালহা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট আসিয়া বলিলেন, ইয়া রাসূলাল্লাহ! আল্লাহ তা’আলা বলেন যে, যতক্ষণ তোমরা তোমাদের প্রিয় বস্তু (আল্লাহর রাহে) খরচ না করিবে, ততক্ষণ তোমরা সওয়াব পাইবে না। আর আমার প্রিয় বস্তু হইল এই ‘বাইরহা’। আমি ইহাকে আল্লাহর রাস্তায় সদকা করিলাম। ইহার বিনিময়ে আমি নেকীর আশা রাখি এবং ইহা আল্লাহর নিকট জমা রাখিতেছি। সুতরাং ইয়া রাসূলাল্লাহ্! আপনি ইহাকে যেভাবে ইচ্ছা কবুল করুন। অতঃপর রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, বাহবা! ইহা অত্যন্ত লাভজনক মাল, ইহা অত্যন্ত লাভজনক মাল। তুমি এই বাগান সম্বন্ধে যাহা কিছু বলিয়াছ আমি উহা শ্রবণ করিয়াছি। আমার মনে হয়, তুমি ইহাকে তোমার আত্মীয়-স্বজনদের মধ্যে বিতরণ করিয়া দাও। আবু তালহা বলিলেন, ইয়া রাসূলাল্লাহ! আমি উহা বিতরণ করিয়া দিব। অতএব আবু তালহা (রাঃ) তাহার আত্মীয়-স্বজন ও চাচাত ভাইগণের মধ্যে উহা বন্টন করিয়া দিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1842
			}
		},
		{
			"hadithnumber": 1843,
			"arabicnumber": 1843,
			"text": "রেওয়ায়ত ৩. যায়দ ইবনে আসলাম (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, ভিক্ষুককে দাও যদিও সে ঘোড়ায় আরোহণ করিয়া আসে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1843
			}
		},
		{
			"hadithnumber": 1844,
			"arabicnumber": 1844,
			"text": "রেওয়ায়ত ৪. আমর ইবনে মুয়াজ আশহালী তাহার দাদী হইতে বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, হে মু’মিন মহিলাগণ তোমাদের কেহ যেন স্বীয় প্রতিবেশীকে তুচ্ছ মনে না করে, যদিও সে ছাগলের একটি পোড়া খুর পাঠায় (তাহাও কবুল কর)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1844
			}
		},
		{
			"hadithnumber": 1845,
			"arabicnumber": 1845,
			"text": "রেওয়ায়ত ৫. নবী করীম সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের সহধর্মিণী আয়েশা (রাঃ)-এর নিকট জনৈক ভিক্ষুক আসিয়া কিছু ভিক্ষা চাহিল। তিনি (আয়েশা) রোযা রাখিয়াছিলেন। ঘরে একটি রুটি ব্যতীত আর কিছুই ছিল না । তিনি স্বীয় দাসীকে বলিলেন, উহা ফকীরকে দিয়া দাও। দাসী বলিল, আপনার ইফতারের জন্য আর কিছুই থাকিবে না। তিনি বলিলেন, (যাহা হউক) দিয়া দাও। অতঃপর দাসী সেই রুটি ফকীরকে দিয়া দিল। দাসীটি বলে, সন্ধ্যার সময় কোন বাড়ি হইতে বা কোন এক ব্যক্তি হাদিয়া পাঠাইয়া দিল ছাগলের ভূনা গোশত। আয়েশা (রাঃ) আমাকে ডাকিয়া বলিলেন, খাও। ইহা তোমার রুটি হইতে উত্তম।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1845
			}
		},
		{
			"hadithnumber": 1846,
			"arabicnumber": 1846,
			"text": "রেওয়ায়ত ৬. মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌছিয়াছে যে, জনৈক মিসকীন নবী করীম সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের সহধর্মিণী আয়েশা (রাঃ)-এর নিকট আসিয়া কিছু ভিক্ষা চাহিল। তাহার সম্মুখে তখন আঙ্গুর ছিল। আয়েশা (রাঃ) এক ব্যক্তিকে বলিলেন, একটি আঙ্গুর নিয়া ঐ মিসকীনকে দিয়া দাও। লোকটি আশ্চর্যবোধ করিতে লাগিল (মাত্র একটি আঙ্গুর দিতেছেন)। আয়েশা (রাঃ) লোকটির মনোভাব বুঝিতে পারিয়া বলিলেন, তুমি আশ্চর্যবোধ করিতেছ? এই একটি আঙ্গুর কত অণু পরিমাণ হইবে বলিয়া তুমি মনে কর?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1846
			}
		},
		{
			"hadithnumber": 1847,
			"arabicnumber": 1847,
			"text": "রেওয়ায়ত ৭. আবু সাঈদ খুদরী (রাঃ) হইতে বর্ণিত, আনসারের কিছু লোক রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট কিছু চাহিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাদেরকে কিছু দান করিলেন; তাহারা পুনরায় কিছু চাহিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবার কিছু দান করিলেন। এইভাবে তিনবার দান করিলেন; এমন কি রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট যাহা কিছু ছিল, সব নিঃশেষ হইয়া গেল। অতঃপর তিনি বলিলেন, আমার নিকট যেই পরিমাণ মাল থাকিবে, উহা তোমাদের না দিয়া আমি কখনও জমা করিয়া রাখিব না। তবে যে ভিক্ষা চাওয়া হইতে বিরত থাকিবে, আল্লাহ্ তাহাকে রক্ষা করেন। যে সবর করিয়া কাহারও মুখাপেক্ষী নহে বলিয়া কার্যত প্রকাশ করিবে, আল্লাহ্ তাহাকে ধনী করিয়া দিবেন। যে সবর করিবে, আল্লাহ তা’আলা তাহাকে সবরের তওফীক দান করিবেন। মানুষকে যাহা কিছু দান করা হইয়াছে, তন্মধ্যে সবরের চাইতে বড় ও উত্তম আর কিছু নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1847
			}
		},
		{
			"hadithnumber": 1848,
			"arabicnumber": 1848,
			"text": "রেওয়ায়ত ৮. আবদুল্লাহ ইবন উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বরের উপর আরোহণ করিয়া বলিলেন, তিনি তখন সদকা ও ভিক্ষাবৃত্তি হইতে নিজেকে বাঁচাইয়া রাখা সম্পর্কে কথা বলিতেছিলেন, নিচের হাতের চাইতে উপরের হাত উত্তম। উপরের হাত হইল দাতার হাত এবং নিচের হাত হইল ভিক্ষুকের হাত।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1848
			}
		},
		{
			"hadithnumber": 1849,
			"arabicnumber": 1849,
			"text": "রেওয়ায়ত ৯. আতা ইবন ইয়াসার (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উমর ইবনে খাত্তাব (রাঃ)-এর নিকট কিছু দান (বা তুহফা) প্রেরণ করিলেন। উমর (রাঃ) উহা (গ্রহণ করিলেন না বরং) ফেরত পাঠাইলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাকে জিজ্ঞাসা করিলেন, ফেরত পাঠাইলৈ কেন? উমর (রাঃ) বলিলেন, ইয়া রাসূলাল্লাহ্! আপনি আমাদেরকে বলিয়াছিলেন যে, ঐ লোকটি উত্তম, যে কাহারও নিকট হইতে কিছু গ্রহণ করে না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, ইহার অর্থ এই যে, ভিক্ষা চাহিয়া কিছু গ্রহণ করিবে না। আর চাওয়া ছাড়া যদি পাওয়া যায় উহা আল্লাহর দান। অতঃপর উমর ইবনে খাত্তাব (রাঃ) বলিলেন, সেই পাক যাতের কসম, যাহার হাতে আমার প্রাণ রহিয়াছে, ভবিষ্যতে আমি কাহারও নিকট কিছু চাহিব না এবং চাওয়া ছাড়া কিছু পাওয়া গেলে উহা গ্রহণ করিব।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1849
			}
		},
		{
			"hadithnumber": 1850,
			"arabicnumber": 1850,
			"text": "রেওয়ায়ত ১০. আবু হুরায়রা (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, সেই পাক যাতের কসম, যাহার হাতে আমার প্রাণ রহিয়াছে, যদি কোন মুসলিম রশি দিয়া জ্বালানি কাঠের বোঝা বাঁধিয়া উহা স্বীয় পৃষ্ঠে তুলিয়া লয় (এবং উহাকে বিক্রি করিয়া রোজগার করে), তাহা সেই ব্যক্তির জন্য ইহা হইতে উত্তম যে, সে এমন কোন ব্যক্তির নিকট গিয়া কিছু (ভিক্ষা) চায়, যাহাকে আল্লাহ তা’আলা মাল দিয়াছেন, সে তাহাকে কিছু দিক বা না দিক।[1]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1850
			}
		},
		{
			"hadithnumber": 1851,
			"arabicnumber": 1851,
			"text": "রেওয়ায়ত ১১. আসাদ গোত্রীয় এক ব্যক্তির নিকট হইতে আতা ইবনে ইয়াসার (রহঃ) রেওয়ায়ত বর্ণনা করেন যে, তিনি বলিয়াছেন, আমি ও আমার পরিবার বকীউল-গরকদে (মদীনার প্রসিদ্ধ কবরস্থান) অবস্থান করিলাম। আমার স্ত্রী আমাকে বলিল, রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট গিয়া আমাদের খাওয়ার জন্য কিছু চাহিয়া আন এবং আমাদের দৈন্যের কথা বর্ণনা কর। অতঃপর আমি রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট গিয়া দেখি যে, এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট কিছু ভিক্ষা চাহিতেছে এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিতেছেন, আমার নিকট এমন কিছু নাই যে, আমি তোমাকে দিতে পারি। (ইহা শুনিয়া) লোকটি ক্রোধান্বিত হইয়া এই বলিতে বলিতে ফিরিয়া গেল, আমার জীবনের কসম! তুমি যাহাকে দিতে চাও তাহাকেই দাও। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, এই লোকটি আমার উপর এইজন্য রাগ করিয়া চলিয়া গেল যে, তাহাকে কিছু দেওয়ার মতো আমার কাছে কিছু নাই। যেই মুসলিমের নিকট চল্লিশ দিরহাম (এক উকিয়া) কিংবা সেই পরিমাণ মাল আছে, সে যদি ভিক্ষা চায় তবে সে কাকুতি মিনতি করিয়া ভিক্ষা চাহিল। আসাদ গোত্রীয় লোকটি বলিল, একটি দুধের উষ্ট্রী আমার জন্য এক উকিয়া (চল্লিশ দিরহাম) হইতে উত্তম। মালিক (রহঃ) বলেন, চল্লিশ দিরহামে এক উকিয়া হয়। আসাদ লোকটি বলিল, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট কিছু না চাহিয়া প্রত্যাবর্তন করিলাম। ইহার পর রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট যব ও শুকনা আঙ্গুর আসিল এবং তিনি আমাদেরকেও সেইগুলি হইতে দিলেন, এমন কি শেষ পর্যন্ত আল্লাহ তা’আলা আমাদেরেকে ধনী করিয়া দিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1851
			}
		},
		{
			"hadithnumber": 1852,
			"arabicnumber": 1852,
			"text": "রেওয়ায়ত ১২. আ'লা ইবন আবদুর রহমান (রাঃ) বলেন, আল্লাহর পথে মাল সদকা করিলে মাল কমিয়া যায় না। মাফ করিলে সম্মান বৃদ্ধি হয় এবং নম্রতা প্রদর্শনকারীর মর্যাদা আল্লাহ তা’আলা বাড়াইয়া দেন। মালিক (রহঃ) বলেন, এই হাদীসটির সনদ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পর্যন্ত পৌছিয়াছে কি না, তাহা আমার জানা নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1852
			}
		},
		{
			"hadithnumber": 1853,
			"arabicnumber": 1853,
			"text": "রেওয়ায়ত ১৩. মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌছিয়াছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পরিবারের জন্য সদকা হালাল নহে; উহা (সদকা) মানুষের হাতের ময়লা।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1853
			}
		},
		{
			"hadithnumber": 1854,
			"arabicnumber": 1854,
			"text": "রেওয়ায়ত ১৪. আবু বকর ইবন মুহাম্মদ (রহঃ) হইতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনী আবদিল আশহাল গোত্রীয় এক ব্যক্তিকে সদকা উশুল করার জন্য আমিল (কর্মচারী) নিযুক্ত করিলেন। লোকটি (কাজ শেষে) প্রত্যাবর্তন করিয়া রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট (তাহার পরিশ্রম ছাড়া) সদকার একটি উট চাহিল। অতঃপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাগান্বিত হইলেন; তাহার চেহারা মুবারকে ক্রোধের লক্ষণ দৃষ্ট হইল। রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের ক্রোধের লক্ষণ এই ছিল যে, তখন তাঁহার চক্ষু মুবারক লাল হইয়া যাইত। অতঃপর রসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেন, কেহ কেহ আমার কাছে এমন কিছু চায় যাহা আমার জন্য দেওয়া অনুচিত এবং তাহার পক্ষে চাওয়াও অনুচিত। আমি যদি না দেই, তবে উহা আমার খারাপ লাগে, আর যদি দেই, তবে আমার পক্ষে দেওয়া অনুচিত, তাহার পক্ষে নেওয়াও অনুচিত। অতঃপর লোকটি বলিল, ইয়া রাসূলাল্লাহ! আমি আপনার নিকট আর কখনও কিছু চাহিব না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1854
			}
		},
		{
			"hadithnumber": 1855,
			"arabicnumber": 1855,
			"text": "রেওয়ায়ত ১৫. যায়দ ইবনে আসলামের পিতা হইতে বর্ণিত, তিনি বলিয়াছেন, আবদুল্লাহ ইবনে আরকম (রাঃ) আমাকে বলিলেন, আমাকে কোন সওয়ারীর উট দেখাও। আমি উহা আমীরুল মু'মিনীনকে বলিয়া ব্যবহার করিব। আমি বলিলাম, হ্যাঁ, আছে। তবে উহা সদকার উট। অতঃপর আবদুল্লাহ ইবনে আরকম বলিলেন, তুমি কি ইহা পছন্দ করিবে? গরমের দিনে কেহ স্বীয় লজ্জাস্থান এবং রানের গোড়া ধুইয়া সেই পানি তোমাকে খাওয়াইতে চাহিলে তুমি উহা খাইবে? আসলামের পিতা বলেন, আমার বড় রাগ হইল, তাহাকে বলিলাম, আল্লাহ তোমাকে মাফ করুন, তুমি আমাকে এই রকম কথা বলিতেছ? আবদুল্লাহ বলিলেন, সদকাও মানুষের ময়লা ধোয়া পানি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 58,
				"hadith": 1855
			}
		}
	]
}