{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1006,
			"arabicnumber": "449",
			"text": "Ibn 'Abbâs (رضي الله عنهما) a dit : L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) ne vut jamais de djinns ni ne récita du Coran pour eux. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) s'était mis en route pour la foire de 'Ukâz, avec un groupe de ses compagnons. A ce temps, les diables, qui venaient surprendre les secrets du Ciel, avaient été éloignés et chassés par des flammes dirigées contre eux. Ces diables étant retournés vers leurs compagnons, ceux-ci leur demandèrent ce qui leur était arrivé. - \"Nous avons été écartés du Ciel et empêchés d'en surprendre les secrets, répondirent-ils, et des flammes ont été lancées contre nous\". - \"Il faut, répliquèrent les autres, qu'un événement nouveau ait surgi pour qu'on vous ait éloignés des secrets du Ciel. Parcourez donc la terre entière et voyez quel est celui qui s'est interposé entre vous et les secrets du Ciel\". Les diables se mirent à la recherche et ceux d'entre eux qui s'étaient dirigés du côté du Tuhâma trouvèrent le Prophète à Nakhl alors qu'il faisait route avec ses compagnons vers la foire de 'Ukâzh. Au moment de leur arrivée, le Prophète et ses compagnons faisaient la prière de fajr (l'aurore). Quand les diables entendirent la récitation du Coran, ils prêtèrent l'oreille et dirent ensuite : \"Par Dieu! voici celui qui s'est interposé entre nous et les secrets du ciel\". Aussitôt ils retournèrent vers leurs compagnons et leur dirent : \"Frères, Nous avons certes entendu une Lecture (le Coran) merveilleuse, qui guide vers la droiture. Nous y avons cru, et nous n'associerons jamais personne à notre Seigneur. Ce fut alors que Dieu révéla à Son Prophète (paix et bénédiction de Dieu sur lui) les paroles suivantes : Dis : Il m'a été révélé qu'un groupe de djinns prêtèrent l'oreille, puis dirent :...... Récitation du Coran à la prière de zhuhr (midi) et à celle de 'asr",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 168
			}
		}
	]
}