{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2290,
			"arabicnumber": "987.01",
			"text": "Selon Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : \"Nul homme qui thésaurise de l'or ou de l'argent sans en payer l'aumône légale, au Jour de la Résurrection, des plaques métalliques portées à incandescence dans le feu de la Géhenne lui seront appliquées sur le flanc, le front et le dos. Dès qu'elles se refroidissent, elles seront à nouveau portées à incandescence, et lui seront appliquées durant un jour de cinquante mille ans, jusqu'à ce que les comptes des hommes soient réglés. Il verra alors la destinée qui lui a été réservé : le Paradis ou bien l'Enfer\". On demanda : \"Ô Envoyé de Dieu! Si les biens étaient des chameaux?\" Il répondit : \"La même chose pour le possesseur des chameaux qui n'en paye pas l'aumône légale qui consiste à distribuer un peu de leurs laits le jour où il les mène à l'abreuvoir. Au Jour de la Résurrection, il sera jeté à terre et on amènera tous ses chameaux sans même qu'un chamelon ne manque. Ceux-ci le piétineront avec leurs sabots et le mordront. Ils le fouleront dans un va-et-vient continuel et cela durera un jour de cinquante mille ans, jusqu'à ce que les comptes des Serviteurs soient réglés. Il verra alors la destinée qui lui a été réservé : le Paradis ou bien l'Enfer\". On demanda ensuite : \"Qu'en est donc du sort du possesseur des vaches et des moutons?\" L'Envoyé de Dieu répondit : \"La même chose pour le possesseur des vaches et des moutons qui n'en paye pas l'aumône légale. Au Jour de la Résurrection, il sera jeté à terre et on amènera tout son bétail sans exception. Aucun d'eux n'aura ni des cornes courbées, ni sera décornu, ni aura l'oreille fendue! Ces animaux l'attaqueront avec leurs cornes et le fouleront aux pieds dans un va-et-vient continuel et cela durera un jour de cinquante mille ans, jusqu'à ce que les comptes des Serviteurs soient réglés. Il verra alors la destinée qui lui a été réservé : le Paradis ou bien l'Enfer\". On demanda de nouveau : \"Qu'en est-il du possesseur des chevaux, ô Envoyé de Dieu?\" Il répondit : \"Les chevaux sont de trois catégories : ils représentent un péché pour un homme, un rempart pour un autre et une récompense pour un troisième. Le cheval est un péché pour son propriétaire, quand celui-ci le destine par vanité et ostentation pour s'attaquer aux musulmans. Le cheval est un rempart à son propriétaire, quand celui-ci le destine à servir dans le chemin de Dieu, sans négliger d'en payer le dû de Dieu soit en donnant à un combattant (pour la cause de Dieu) le droit de s'en servir, soit en versant l'aumône légale. Le cheval est une récompense pour son propriétaire, lorsque celui-ci le consacre aux musulmans pour s'en servir dans la cause de Dieu en l'attachant au sein d'une prairie ou d'un jardin, autant que le cheval mange de ce pâturage, autant que l'homme amasse de bonnes actions, le montant de celles-ci augmentera même suivant la quantité des crottins et des urines de l'animal. Même si ces chevaux se détacheront de leurs longs licous et courront à une longue allure une colline ou plus, Dieu inscrira à leur propriétaire de bonnes actions équivalentes au nombre de leurs traces et de leurs crottins. Et quand leur propriétaire passera par un fleuve, et que ces chevaux s'y abreuveront, même s'il n'avait pas l'intention de les abreuver, Dieu lui inscrira de bonnes actions équivalant à la quantité de l'eau bue\". On demanda enfin : \"Ô Envoyé de Dieu! Qu'en est-il des ânes?\" Il répondit : \"Dieu ne m'a rien révélé à leur sujet sauf ce verset exceptionnel et exhaustif : Quiconque fait un bien fût-ce du poids d'un atome, le verra, et quiconque fait un mal fût-ce du poids d'un atome, le verra\". Dureté du châtiment de celui qui refuse la Zakâ",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		}
	]
}