{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3055,
			"arabicnumber": "1264.01",
			"text": "Ibn Tufayl a interrogé Ibn 'Abbâs, en disant : \"Est-ce que la marche rapide pendant les trois premières tournées rituelles autour de la Maison, et la marche normale pendant les quatre autres sont une Sunna? Car, ta tribu prétend que c'est de la Sunna\". Il répondit : \"Ils ont dit vrai et ils ont menti\". Je répliquai : \"Comment cela, ils sont véridiques et menteurs à la fois?\". Ibn 'Abbâs dit : Quand l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) vint à La Mecque (avec ses compagnons), les polythéistes qui l'enviaient, dirent alors : \"Muhammad et ses compagnons ne peuvent pas faire les tournées rituelles autour de la Maison, à cause de leur faiblesse\". Alors, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) ordonna à ses compagnons de marcher à pas rapides pendant les trois premières tournées, puis de marcher à allure normale pendant les quatre autres\". Je lui demandai de m'informer si le parcours entre As-Safâ et Al-Marwa en monture était-il une Sunna; tant que sa tribu prétendait qu'il l'était. Il répondit : \"Ils ont dit vrai et ils ont menti\". Je répliquai : \"Comment cela, ils sont véridiques et menteurs à la fois?\". Il (Ibn 'Abbâs) dit alors : \"L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) (étant venu à La Mecque), vit d'énormes foules l'entourèrent en disant : Voilà Muhammad! Voilà Muhammad!, même les vierges sortirent de chez elles (pour jeter un coup d'œil sur lui). Comme l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) était doux avec les gens, ceux-ci ne s'écartaient pas pour lui faire chemin. N'arrivant plus à marcher, il enfourcha sa monture. Mais, c'est préférable de marcher et de parcourir ce trajet\". Recommandation de toucher les deux coins yéménites lors des tournées rituelles",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 261
			}
		}
	]
}