{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 451,
			"arabicnumber": "182.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), des gens interrogèrent un jour le Prophète (paix et bénédiction de Dieu sur lui) s'ils verraient le Seigneur le Jour de la Résurrection. Et le Prophète (paix et bénédiction de Dieu sur lui) de répondre : \"Trouvez-vous de la peine à voir la lune quand elle est pleine?\". - \"Non, ô Envoyé de Dieu\" - \"Trouvez-vous de la peine à voir le soleil quand aucun nuage ne le cache?\". - \"Non, ô Envoyé de Dieu!\". - Eh bien, reprit-il, de même vous verrez le Seigneur. Le Jour de la Résurrection, Dieu rassemblera les gens, et leur dira : \"Que chacun suive ce qu'il adorait!\". Ceux qui adoraient le soleil, le suivront; ceux qui adoraient la lune, la suivront; et ceux qui adoraient les taghût (toute fausse divinité), les suivront. Tout le monde s'en ira donc, sauf cette Communauté y compris ses hypocrites. Ensuite Dieu (que soient exaltées Sa toute puissance et Sa grandeur) s'incarnera à elle dans une forme qu'elle ne connaît pas et leur dira : \"Je suis votre Seigneur\". - \"Nous nous réfugions contre toi auprès de Dieu, diront-ils, nous resterons ici jusqu'à ce que notre Seigneur vienne, et alors nous Le reconnaîtrons\". Dieu (que soient exaltées Sa toute puissance et Sa grandeur) leur viendra ensuite sous la forme qu'ils connaissent et leur dira : \"Je suis votre Seigneur\". - \"Certes, Tu es notre Seigneur\", répondront-ils; et ils Le suivront. A ce moment-là, le Sirât (pont aussi fin qu'un fil) sera établi entre les deux extrémités de l'Enfer. Ma Communauté et moi serons les premiers à le traverser. Ce jour-là, personne ne parlera sauf les Prophètes qui imploreront Dieu en ces termes : \"Ô Seigneur! Sauve-nous, sauve-nous!\". En Enfer, il y aura des grappins pareils aux épines du Sa'dân (plante épineuse), avez-vous vu le Sa'dân? - Certes oui, ô Envoyé de Dieu. - Ces grappins ressembleront donc aux épines du Sa'dân mais personne -si ce n'est que Dieu- ne connaît leur grandeur. Ils saisiront les gens suivant leurs actions : les croyants y échapperont tandis que les coupables y demeureront jusqu'à l'expiation de leurs fautes. Puis, quand Dieu achèvera le jugement de Ses serviteurs, et qu'Il voudra faire sortir par Sa miséricorde et selon Sa volonté certains des réprouvés de l'Enfer, Il donnera l'ordre aux anges de faire sortir du Feu, quiconque ne Lui associait rien parmi ceux à qui Il voudra accorder Sa miséricorde parce qu'ils attestaient qu'il n'y avait d'autre divinité que Dieu. Les anges les reconnaîtront grâce aux traces de la prosternation (marquées sur leur front), car le Feu dévorera entièrement le corps du fils d'Adam, à l'exception de cette partie, parce que Dieu lui a interdit de le faire. Ils sortiront donc de l'Enfer consumés par le Feu; mais grâce à l'eau de la vie qu'on versera sur eux, ils renaîtront comme renaît le pourpier dans le limon de l'inondation. Quand Dieu achèvera de régler les comptes des hommes et qu'il ne restera qu'un seul homme, ayant la face tournée vers le Feu. Celui-ci entrera au Paradis le dernier. Il s'écriera : \"Seigneur! Détourne mon visage de l'Enfer dont le souffle m'étouffe et les flammes me brûlent!\". L'homme implorera Dieu autant qu'Il lui inspirera. - \"Mais, lui dira-t-Il alors, est-ce que si J'exauce ton vœu, me demanderas-tu un autre?\". - \"Non, je ne Te demanderai pas autre chose\", dira l'homme en faisant maintes promesses et en prenant maints engagements vis-à-vis de Dieu qui détournera alors son visage de l'Enfer. Mais quand il arrivera au seuil du Paradis et qu'il le verra, l'homme gardera le silence aussi longtemps que Dieu le voudra et finira par dire : \"Seigneur! Approche-moi de la porte du Paradis\". - \"N'as-tu pas pris, répliquera Dieu, l'engagement formel de ne plus jamais rien Me demander après ce que Je t'ai déjà donné. Malheur à toi, ô fils d'Adam! Combien tu es perfide!\". - \"Si Seigneur\", dira l'homme qui continuera à invoquer et à implorer Dieu jusqu'à ce qu'Il lui dise : \"Me promets-tu de ne Me rien demander si J'exauce ton vœu?\". L'homme Lui promettra et confirmera sa promesse par autant d'engagements formels que Dieu voudra. Puis, Dieu l'approchera de la porte du Paradis, qui s'ouvrira alors devant lui. Voyant les biens et les félicités qu'il renferme, il gardera d'abord le silence aussi longtemps que Dieu voudra, puis s'écriera : \"Seigneur! Fais-moi entrer au Paradis\". - \"N'as-tu pas pris l'engagement formel de ne Me plus rien demander. Malheur à toi, ô fils d'Adam! Combien tu es perfide!\". \"Ô Seigneur! Fais que je ne sois pas le plus malheureux de Tes créatures\", dira l'homme qui poursuivra ses implorations jusqu'à provoquer le rire de Dieu (que soient exaltées Sa toute puissance et Sa grandeur). Dieu le fera alors entrer au Paradis et lui dira ensuite : \"Demande ce que tu désire\". L'homme ne cessera de demander et de formuler ses désirs, Dieu, de même, lui rappellera des vœux oubliés, jusqu'à ce que l'homme n'ait point de souhaits à exprimer et ce sera alors que Dieu lui dira : \"Tout cela est à toi et autant encore",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 356
			}
		}
	]
}