{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4555,
			"arabicnumber": "1747",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) a dit : Un des Prophètes partit en expédition et dit à son peuple : \"Que ne me suivent pas : celui qui a contracté mariage et ne l'a pas encore consommé et qui désire le faire; celui qui a construit une maison dont il n'a pas encore élevé le toit et celui ayant acheté des brebis ou des chamelles pleines, attend qu'elles mettent bas\". Puis, il partit et, étant arrivé près d'un village à l'heure de la prière de `asr, ou tout près de cette heure, il dit au soleil : \"Toi, soleil, tu es ordonné par Dieu ainsi que moi. Ô mon Seigneur! Retiens-le dans sa course, qu'il nous éclaire\". Le soleil fut alors arrêté, jusqu'à ce que Dieu eut donné la victoire à Son Prophète. La bataille terminée, les hommes rassemblèrent ce qu'ils avaient gagné comme butin et voulurent le sacrifier en le mettant au feu, mais le feu ne le dévora pas, alors le Prophète s'écria : \"Il y a eu de la fraude parmi vous; qu'un homme de chaque tribu vienne me prêter serment (en lui touchant la main)!\". Or la main d'un homme resta collée à la sienne et le Prophète s'écria : \"Il y a certains parmi vous qui ont fraudé le butin; que chaque homme de cette tribu vienne me prêter serment (en lui touchant la main)!\" Or les mains de deux ou de trois hommes restèrent collées à la main du Prophète. - \"C'est bien vous qui avez fraudé le butin!\", s'écria-t-il. Alors ces hommes lui apportèrent une tête de bœuf en or et la déposèrent part-terre avec le reste du butin et le feu dévora le tout. L'Envoyé de Dieu ajouta : \"Ainsi, la consommation des butins n'a jamais été rendue licite à aucune nation avant nous; c'est que Dieu, que soient exaltées Sa toute puissance et Sa grandeur, a vu notre faiblesse et notre impuissance nous les a rendus bons\". Butin",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 36
			}
		}
	]
}