{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4589,
			"arabicnumber": "1764.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), le Prophète (paix et bénédiction de Dieu sur lui) envoya une cavalerie du côté du Nedjd. Elle ramena un homme des Banû Hanîfa, nommé Thumâma Ibn `Uthâl, chef d'Al-Yamâma. On l'attacha à l'un des piliers de la mosquée. Le Prophète (paix et bénédiction de Dieu sur lui) alla le trouver et lui dit : \"Que penses-tu maintenant ô Thumâma?\". - \"Tout ce qui est bien, ô Muhammad, répondit-il, si tu me tues, tu auras fait périr un homme dont le sang sera vengé; si tu me fais grâce, tu auras fait grâce à un homme reconnaissant et si tu veux de l'argent, tu obtiendras ce que tu voudras\". Le Prophète (paix et bénédiction de Dieu sur lui) le laissa et, le lendemain, il revint lui dire : \"Que penses-tu maintenant, ô Thumâma?\". - \"Ce que je t'ai déjà dit\", répondit-il; et il lui répéta ce qu'il lui a dit la veille. Le Prophète (paix et bénédiction de Dieu sur lui) le laissa de nouveau et, le lendemain, il revint et lui répéta : \"Que penses-tu maintenant, ô Thumâma?\". - \"Ce que je t'ai déjà dit\", répondit-il. - \"Qu'on mette Thumâma en liberté!\", s'écria le Prophète (paix et bénédiction de Dieu sur lui). Il (Thumâma) se rendit aussitôt à un enclos de dattiers voisin de la mosquée, se lava et revint à la mosquée où il prononça ces mots : \"J'atteste qu'il n'y a d'autre divinité que Dieu et j'atteste que Muhammad est le serviteur de Dieu et Son Envoyé. Par Dieu, ô Muhammad, jusqu'ici aucun visage d'homme sur terre ne m'était plus odieux que le tien, mais maintenant ton visage est celui de tous que j'aime le mieux. Par Dieu, aucune religion ne m'était plus odieuse que ta religion et maintenant ta religion est celle que j'aime le plus. Par Dieu, aucune ville ne m'était plus odieuse que ta ville et maintenant nulle ville ne me plaît autant que la tienne. Tes cavaliers m'ont pris au moment où je voulais faire la `Umra, que penses-tu que je devrai faire?\". Le Prophète (paix et bénédiction de Dieu sur lui) le félicita et lui enjoignit de faire la `Umra. Quand il arriva à La Mecque, quelqu'un lui dit : \"Tu as changé ta religion?\". - \"J'ai embrassé l'Islam avec l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), répondit-il; et maintenant, jamais, non jamais, par Dieu, vous ne recevrez un grain de froment d' Al-Yamâma, sans que le Prophète (paix et bénédiction de Dieu sur lui) en ait donné l'autorisation\". Expulsion des juifs du Hedjaz",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 70
			}
		}
	]
}