{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4649,
			"arabicnumber": "1794.01",
			"text": "D'après Ibn Mas'oûd (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) faisait la prière auprès de la Maison Sacrée, alors que Abou Jahl et ses compagnons étaient assis non loin de lui. Comme on venait d'égorger un chameau la veille, Abou Jahl dit : \"Lequel d'entre vous pourra apporter le placenta de la chamelle des Banû tel et le mettra sur le dos de Muhammad, quand il se prosternera?\". Le plus malheureux d'entre eux se leva et apporta le placenta, puis il attendit que le Prophète (paix et bénédiction de Dieu sur lui) se prosternât et le mit sur son dos entre ses épaules. Ils éclatèrent de rire en se penchant les uns vers les autres. Quant à moi, ajouta le transmetteur, quoique j'aie assisté à cette scène, je n'ai pas pu agir; or si j'avais quelque force, j'aurai ôté ce placenta loin des épaules du Prophète (paix et bénédiction de Dieu sur lui). Le Prophète (paix et bénédiction de Dieu sur lui) demeura alors prosterné, alors qu'un homme alla prévenir Fâtima, encore très jeune, qui ne tarda pas à venir. Elle prit le placenta, le jeta loin de son père et se tournant vers les Qoraychites, elle les invectiva. Ayant terminé sa prière, le Prophète (paix et bénédiction de Dieu sur lui) leva sa voix en appelant les malédictions sur les Qoraychites. Quand il maudissait les impies, le Prophète avait l'habitude de le faire trois fois et quand il invoquait Dieu, il le faisait à trois reprises aussi; et c'était ainsi qu'il le fit ce jour-là : \"Grand Dieu! C'est à Toi de ruiner les Qoraychites\". Quand ils entendirent sa voix, les Qoraychites cessèrent de rire redoutant l'exaucement de son invocation. Le Prophète, quant à lui, poursuivit : \"Grand Dieu! Tire vengeance de Abou Jahl Ibn Hichâm, de `Utba Ibn Rabî`a, de Chayba Ibn Rabî`a, d'Al-Walîd Ibn `Uqba, de 'Umayya Ibn Khalaf, et de `Uqba Ibn 'Abî Mu`ayt\". Le transmetteur ajoute qu'il a mentionné un septième mais qu'il n'a pas retenu son nom et poursuit : \"Par Celui qui, par la Vérité, a envoyé Muhammad (paix et bénédiction de Dieu sur lui) j'ai vu tous ces gens-là morts le jour de la bataille de Badr et on les traîna jusqu'au puits de Badr",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 131
			}
		}
	]
}