{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4668,
			"arabicnumber": "1802.01",
			"text": "Salama Ibn Al-Akwa` (que Dieu l'agrée) a dit : Nous partîmes avec l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) pour Khaybar et nous voyageâmes de nuit. Un des nôtres, s'adressant à `Amir Ibn Al-Akwa`, lui dit : \"Ne vas-tu pas nous faire entendre quelques-uns de tes vers?\". qui était poète, se mit aussitôt à entonner les vers suivant (pour divertir ses compagnons et pousser les chameaux à poursuivre leur démarche) : Seigneur, sans Toi nous n'aurions pas été dirigés dans la bonne voie. Nous n'aurions fait ni l'aumône ni la Salâ (prière). Pardonne-nous nos péchés, nous sommes prêts à sacrifier nos vies dans Ton sentier. Affermis nos pas à la rencontre de l'ennemi. Fais naître en nous la sérénité. Nous qui, quand on nous appelle dans Ta voie, nous accourons, pour Te satisfaire ô Dieu. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) demanda alors quel était le nom de l'improvisateur et comme on lui répondit que c'était il dit : \"Que Dieu lui fasse miséricorde!\". Un des nôtres dit alors : \"Ô Prophète, il sera donc martyr; si seulement vous ne deviez pas dire ces mots maintenant et qu'il aurait destiné à une vie plus longue!\". Le transmetteur ajoute : \"Nous gagnâmes Khaybar que nous assiégeâmes si longtemps que nous souffrîmes de la famine. Puis, Dieu nous rendit maîtres de l'endroit. Le soir du jour où nous entrâmes dans la ville, nous avions allumé de nombreux feux. - \"Pourquoi ces feux et pourquoi les avez-vous allumés?\", demanda le Prophète (paix et bénédiction de Dieu sur lui). - \"Pour faire rôtir de la viande\", répondit-on. - \"Quelle viande?\", demanda le Prophète. - \"De la viande d'ânes domestiques\". - \"Renversez les marmites et cassez-les\", dit l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui). - \"Ô Envoyé de Dieu, dit un homme, si nous renversions les marmites seulement et les rincions sans les casser?\". - \"Eh bien, soit\", dit le Prophète. Quand les troupes furent rangées en bataille, avait un sabre court; comme il s'en servait pour frapper un juif, la pointe de la lame du sabre revint en arrière et atteignit le genou de qui mourut de cette blessure. - \"Comme nous revenions de Khaybar, dit Salama, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), me voyant silencieux et chagriné, me demanda ce que j'avais\". - \"Ô toi, pour qui je suis prêt à sacrifier la vie de mon père et celle de ma mère, est-il vrai, comme on le prétend, que perdra le fruit de son acte?\". - \"Et qui a dit cela?\", demanda le Prophète. - Je lui répondis : \"Untel, untel et 'Usayd Ibn Hudayr Al-Ansâri\". - \"Ceux qui ont dit cela, ont menti\", répliqua l'Envoyé de Dieu. - \"Il aura, ajouta-t-il en réunissant deux de ses doigts, une double récompense, car il a regroupé deux qualités : celle de quelqu'un qui a fait un grand effort pour satisfaire Dieu et lui obéir et celle de celui qui combat dans la voie de Dieu, peu d'Arabes en auraient fait autant\". Bataille des Coalisés, nommée également (du Fossé)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 150
			}
		}
	]
}