{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5784,
			"arabicnumber": "2219.01",
			"text": "D'après 'Abdoullâh Ibn 'Abbâs (رضي الله عنهما), 'Omar Ibn Al-Khattâb, se rendant en Syrie (Ach-Châm), trouva, en arrivant à Sargh, les généraux commandant des troupes dans les régions de la Syrie, Abou 'Ubayda Ibn Al-Jarrâh et ses compagnons, qui lui annoncèrent que l'épidémie avait éclaté en Syrie. Ibn 'Abbâs poursuit : 'Umar leur dit alors : \"Qu'on m'amène les plus anciens Muhâjirûn\". On les amena et lui, après leur avoir annoncé que l'épidémie avait éclaté en Syrie, leur demanda conseil. Les avis furent partagés : les uns lui disant : \"Nous nous sommes mis en route pour une affaire et nous estimons que nous ne saurions revenir sur nos pas\". - \"Tu as avec toi, déclaraient les autres, les derniers des compagnons de l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) et nous estimons que tu ne dois pas les exposer à l'épidémie\". - \"vous pouvez vous en aller (maintenant), répondit 'Umar, et qu'on aille me chercher les 'Ansâr\". Je les fis venir et 'Umar leur demanda conseil. Ils dirent exactement ce qu'avaient dit les Muhâjirûn et leurs avis furent également partagés. - \"Vous pouvez vous en aller (maintenant), reprit 'Umar, et qu'on aille chercher tous les vieillards Qoraychites qui ont émigré lors de la conquête de La Mecque\". Je les fis venir. Il n'y eut pas deux avis à ce propos parmi eux car ils dirent : \"Nous estimons que tu reviens sur tes pas et que tu n'exposes pas les fidèles à cette épidémie\". Alors 'Umar fit annoncer dans le camp que le lendemain matin il serait prêt à partir sur sa monture et ordonna que tout le monde en fît autant. - \"Voudrais-tu fuir ainsi la destinée fixée par Dieu?\", s'écria Abou 'Ubayda ibn Al-Jarrâh. - \"Si un autre que toi, répliqua 'Umar, s'était permis de dire une chose pareille, ô Abou 'Ubayda! ('Umar qui n'aimait pas contrarier Abou 'Ubayda fut cependant choqué de son avis ...). Eh bien oui, ajouta 'Umar, nous fuyons la destinée fixée par Dieu mais nous la fuyons pour une autre destinée également fixée par Lui. Que ferais-tu si tu avais des chameaux parqués dans une vallée dont un des côtés serait couvert d'herbe et l'autre dénudé? Quand tu ferais paître tes chameaux dans la partie couverte d'herbes, ne le ferais-tu pas d'après la destinée fixée par Dieu et quand tu les ferais paître dans le côté dénudé, ne le ferais-tu pas également d'après la destinée fixée par Dieu?\". Abdourrahmân Ibn 'Awf, qui était absent pour quelque affaire, arriva sur ces entrefaites et dit : Je suis bien informé à ce sujet, car j'ai entendu l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) dire : \"Lorsque vous apprenez que la peste existe dans un pays n'y allez pas; mais, si elle éclate dans le pays où vous êtes, ne quittez point ce pays pour la fuir\". 'Omar Ibn Al-Khattâb alors loua Dieu et s'en alla. Pas de contagion ni de \"hâma\" ni de \"safar\" ni de pluie grâce aux étoiles ni ogre. Qu'un homme n'amène pas ses chameaux malades s'abreuver avec d'autres qui sont sains",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 136
			}
		}
	]
}