{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6151,
			"arabicnumber": "2373.01",
			"text": "Abou Hourayra (que Dieu l'agrée) a dit : Alors qu'un juif étalait sa marchandise (devant les clients), on lui en offrit un prix qu'il trouva dérisoire, - 'Abd Al-'Azîz n'a pas précisé le degré de l'insatisfaction du juif : - \"Non, s'écria-t-il, j'en jure par Celui qui a élu Moïse (que la paix soit sur lui) parmi tous les êtres humains!\". Un homme des 'Ansâr, ayant entendu ces paroles, se leva, souffleta le juif et dit : \"Comment! Tu dis : J'en jure par Celui qui a élu Moïse parmi tous les êtres humains, alors que l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) est au milieu de nous!\". Le juif se rendit alors auprès du Prophète (paix et bénédiction de Dieu sur lui) et lui dit : \"Ô Abou Al-Qâsim (surnom du Prophète)! Je suis ici sous la foi des traités, pourquoi donc untel m'a-t-il frappé sur le visage?\". - \"Pourquoi l'as-tu giflé?\", demanda le Prophète au musulman. L'homme ayant raconté l'aventure, le Prophète (paix et bénédiction de Dieu sur lui) fut atteint d'une colère dont les traces se dessinaient sur le visage. Puis il dit : \"Ne faites pas de distinction entre les Prophètes de Dieu (donnant votre prédilection aux uns sur les autres). Le jour où on soufflera dans la Trompette, à l'exception de celui que Dieu voudra, tous ceux qui sont dans les cieux et sur la terre s'évanouiront. On soufflera une seconde fois dans la Trompette et je serai le premier à être ressuscité - ou dans une variante : parmi les premiers qui seront ressuscités. A ce moment, Moïse sera cramponné au Trône divin. Je ne sais si on lui a déjà tenu compte lors de son premier évanouissement le jour du At-Tûr (lorsque Dieu s'est adressé à lui) ou s'il a été ressuscité avant moi. Quant à moi, je ne dirai jamais que quelqu'un vaut mieux que Jonas fils d'Amittaï\". Récit de Jonas. Du dire du Prophète (paix et bénédiction de Dieu sur lui) a dit : \"Personne ne doit prétendre être meilleur que Jonas fils d'Amittaï",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 209
			}
		}
	]
}