{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6508,
			"arabicnumber": "2550.01",
			"text": "D'après Abou Hourayra (que Dieu l'agrée) : Un jour, Jurayj était en train de prier dans une tourelle quand sa mère vint l'appeler. Humayd dit : Abou Râfi' nous a rapportés que Abou Hourayra avait décrit, d'après le Prophète (paix et bénédiction de Dieu sur lui) comment la mère mit sa paume sur son sourcil puis leva la tête et s'adressa à lui en ces termes : \"Jurayj je suis ta mère. Réponds-moi!\". Jurayj, qui était en pleine prière, se dit : \"Seigneur! Répondrai-je à ma mère ou continuerai-je ma prière?\". Il choisit, en fait, de continuer sa prière. La mère s'en alla puis revint et la même scène se déroula. - \"Seigneur!, s'écria alors la mère, voici mon fils Jurayj. Je l'ai appelé mais il s'est abstenu de me répondre, fais donc qu'il n'arrive au terme de sa vie avant que Tu ne lui aies montré les prostituées\". Et il ajouta que si elle avait invoqué Dieu pour qu'il soit éprouvé, Il l'aurait exaucée. Un berger qui se réfugiait dans la tourelle de Jurayj rencontra une femme sortant du village, coucha avec elle et elle en eut un enfant. Interrogée sur le père de l'enfant, elle répondit en ces termes : \"C'est le propriétaire de cette tourelle\". Ils arrivèrent menus de leurs haches et de leurs pelles et l'appelèrent, Jurayj était toujours absorbé dans sa prière et ne leur répondit pas. Ils commencèrent alors à démolir sa tourelle. Sur ce, il descendit et demanda aux gens pourquoi ils agirent de la sorte. Ils lui répondirent : \"Demande à celle-ci\". (en désignant la femme). Il sourit, passa la main sur les cheveux du nourrisson et lui dit : \"Qui est ton père?\". - \"C'est le berger\", répondit l'enfant. - \"Nous allons, dirent les gens, te bâtir une tourelle en or et en argent à la place de celle que nous avons démolie\". - \"Non, répliqua-t-il, en argile seulement comme elle était\". Il monta ensuite (pour continuer sa prière). Maintien du lien de parenté et interdiction de le rompre",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 8
			}
		}
	]
}