{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7354,
			"text": "D'après 'Abdoullah Ibn 'Omar (رضي الله عنهما), 'Umar se rendit avec le Prophète (paix et bénédiction de Dieu sur lui) dans un groupe de musulmans du côté de l'endroit où se trouvait Ibn Sayyâd. Ils le trouvèrent en train de jouer avec d'autres enfants près du château des Banû Maghâla. A cette époque, Ibn Sayyâd s'approchait de l'âge de la puberté. Il ne s'aperçut de l'arrivée du Prophète que lorsque celui-ci, l'ayant frappé de sa main sur le dos, lui dit : \"Confesses-tu que je suis l'Envoyé de Dieu?\". Ibn Sayyâd le regarda et lui répondit : \"Je confesse que tu es l'envoyé des illettrés\". Puis, il ajouta en s'adressant au Prophète : \"Et toi, confesses-tu que je suis l'Envoyé de Dieu?\". Alors, le Prophète refusa et reprit : \"Je crois en Dieu et en ses Envoyés. Mais toi, quelles visions as-tu?\". - \"J'en ai de vraies et de mensongères\", répartit Ibn Sayyâd. - \"C'est que pour toi, riposta le Prophète, les choses sont embrouillées. Eh bien! J'ai quelque chose pour toi\". - \"Il s'agit d'un astuce\", dit Ibn Sayyâd. - \"Que tu sois déprécié et humilié!, s'écria le Prophète, tu ne saurais jamais faire ce qui est au-dessus de tes forces!\". 'Omar Ibn Al-Khattâb dit alors : \"Ô Envoyé de Dieu! Laisse-moi lui trancher la tête\". - \"S'il est l'Antéchrist, répliqua l'Envoyé de Dieu, tu ne saurais avoir de pouvoir sur lui; et, s'il n'est pas l'Antéchrist, il n'y aura pour toi aucun avantage à l'avoir tué\". Le transmetteur Sâlim Ibn 'Abdoullâh poursuivit : J'ai entendu 'Abdoullâh Ibn 'Omar : Plus tard, l'Envoyé de Dieu, accompagné de 'Ubayy Ibn Ka'b Al-‘Ansârî se rendit vers un bosquet de palmiers où se trouvait Ibn Sayyâd. Il (paix et bénédiction de Dieu sur lui) dissimula son approche, espérant surprendre quelque propos d' Ibn Sayyâd avant d'être aperçu de ce dernier, qu'il vit couché dans une couverture et il s'y agitait -ou selon une variante- il chantait. Mais la mère d' Ibn Sayyâd ayant aperçu l'Envoyé de Dieu qui se dissimulait derrière les troncs de palmier, cria à son fils : \"Hé! Sâfi, c'était le nom d' Ibn Sayyâd voilà Muhammad \". Aussitôt, Ibn Sayyâd bondit. - \"Si dit alors le Prophète, cette femme l'avait laissé, il nous aurait montrés clairement (qui il était)\". Sâlim dit : 'Abdoullâh Ibn 'Omar ajoute que le Prophète groupa les gens et après avoir loué et glorifié Dieu, leur dit : \"Je vous mets en garde contre l'Antéchrist. En effet, il n'y a aucun Prophète qui n'a engagé son peuple à se méfier de l'Antéchrist. Noé aussi a mis son peuple en garde contre lui; mais je vais vous annoncer de lui ce qu'aucun Prophète n'avait signalé à son peuple. Sachez que l'Antéchrist est borgne alors que Dieu, que soient exaltées Sa toute puissance et Sa grandeur, n'est pas borgne\". L'Antéchrist, son portrait et ce qu'il y aura avec lui",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}