{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7431,
			"arabicnumber": "2964",
			"text": "D'après Abou Hourayra (que Dieu l'agrée), Il a entendu l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) dire : Il y avait parmi les israélites, trois hommes, un lépreux, un chauve et un aveugle, que Dieu trouva bon d'éprouver. Ainsi, Il leur dépêcha un Ange; celui-ci alla trouver le lépreux et lui dit : \"Quelle est la chose qui te serait le plus agréable?\". - \"Un beau teint, une belle peau, lui répondit-il, et la guérison de cette maladie qui me rend répugnant aux yeux des gens\". L'Ange ayant passé sa main sur cet homme, les taches de la lèpre disparurent et firent place à un beau teint et à une belle peau. - \"Quel est le bien que tu préfères?\", ajouta l'Ange - \"Les chameaux, répondit-il - ou suivant une variante les vaches\". ('Ishâq a douté sur ce point; toutefois, l'un des deux hommes : le lépreux et le chauve répondit \"les chameaux\" et l'autre \"les vaches\"). On lui donna une chamelle pleine de dix mois et l'Ange lui dit : \"Que Dieu te la bénisse!\". L'Ange alla ensuite trouver le chauve et lui demanda : \"Quelle chose te sera le plus agréable?\". - \"Une belle chevelure, répondit-il, car les gens me trouvent ainsi répugnant\". L'Ange passa alors sa main sur la tête du chauve, celle-ci se couvrit d'une belle chevelure. - \"Et maintenant, ajouta l'Ange, quel est le bien que tu préfères le plus?\". - \"Les vaches\", reprit-il. On lui donna une vache pleine et l'Ange lui dit : \"Que Dieu te la bénisse!\". Allant ensuite vers l'aveugle, l'Ange lui demanda quelle chose lui serait le plus agréable. - \"Ce serait, répondit l'aveugle, que Dieu me rende la vue afin que je puisse voir les hommes\". L'Ange passa alors sa main sur les yeux de l'aveugle et Dieu lui rendit alors la vue. - \"Et maintenant, ajouta-il, quel est le bien que tu préfères le plus?\". - \"Les moutons\", reprit-il. On lui donna une brebis pleine qui allait mettre bas. Les trois femelles ayant mis bas, le premier homme eut bientôt une vallée remplie de chameaux, le second une vallée remplie de bœufs et le troisième une vallée remplie de moutons. Quelque temps après cela, l'Ange, reprenant la figure d'un lépreux, vint trouver le lépreux d'autrefois et lui dit : \"Je suis un homme malheureux, j'ai perdu en voyage toutes mes ressources et aujourd'hui il ne me reste que de m'adresser à Dieu et à toi. Au nom de Celui qui t'a donné un beau teint et une belle peau ainsi qu'une grande fortune, je te demande de me donner un chameau qui me permette d'achever mon voyage\". - \"J'ai de nombreuses charges\", répondit l'homme. - \"Mais, répliqua-il (l'Ange), il me semble bien te reconnaître. N'étais-tu pas un lépreux d'aspect répugnant et sans ressources, et Dieu ne t'a-t-Il pas donné (tout ce que tu as)?\". - \"Par contre, tout ce bien je l'ai hérité de mes ancêtres\". - \"Si tu mens répliqua l'Ange, puisse Dieu te faire redevenir comme tu étais!\". Puis, prenant le visage d'un chauve, l'Ange alla trouver le chauve d'autrefois et lui tint les mêmes propos et obtint de lui la même réponse. - \"Si tu mens, riposta l'Ange, puisse Dieu te faire redevenir comme tu étais!\". Enfin l'Ange, prenant le visage d'un aveugle, se présenta à l'aveugle d'autrefois et lui dit : \"Je suis un malheureux voyageur, j'ai perdu en voyage toutes mes ressources et aujourd'hui il ne me reste qu'à m'adresser à Dieu et à toi. Au nom de Celui qui t'a rendu la vue, je te demande un mouton afin que je puisse achever mon voyage\". - \"J'étais aveugle, répondit l'homme et Dieu m'a rendu la vue. Prends ce que tu voudras, car, par Dieu, je ne te contesterai pas quoi que ce soit que tu prendras\". - \"Garde ton bien, répliqua l'Ange. C'était seulement pour vous éprouver (tous les trois). Dieu est Satisfait de toi et Il maudit tes deux compagnons",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 15
			}
		}
	]
}