{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 816,
			"arabicnumber": "367.01",
			"text": "Aïcha (raa) a dit : Nous étions partis avec l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) pour une de ses expéditions quand, arrivés à Al-Baydâ' - ou à Dhât Al-Jaych, mon collier se coupa et tomba à mon insu. Le Prophète fit halte pour le rechercher et tout le monde s'arrêta également. Il se trouvait que nous n'étions pas auprès d'un point d'eau et que nous étions en défaut d'eau. Ensuite, les fidèles allèrent trouver Abou Bakr et lui dirent : \"Ne vois-tu pas ce qu'a fait 'Aïcha; elle a obligé l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) et ses compagnons à s'arrêter bien qu'ils ne soient pas sur un point d'eau et qu'ils n'en aient pas apporté avec eux\". Abou Bakr vint alors me trouver alors que l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui), la tête posée sur ma cuisse, s'était endormi. - \"Tu as retenu, me dit-il, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) et tout le monde bien qu'ils ne soient pas sur un point d'eau et qu'ils n'en aient pas apporté avec eux\". Et Abou Bakr de continuer à me gronder et de m'adresser tous les reproches qu'il plût à Dieu de lui laisser dire, et de me donner des coups de main à la taille. Il ne m'empêcha de bouger que (la peur de déranger) l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) qui dormait sur ma cuisse. L'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) se leva le lendemain matin et, comme on était sans eau, Dieu révéla le verset concernant les ablutions à sec et on les fit. - \"Ô famille de Abou Bakr, s'écria 'Usayd Ibn Al-Hudayr, un des nobles, ce n'est pas la première de vos bénédictions!\". Alors, ajouta 'Aïcha, quand nous fîmes lever le chameau qui me servait de monture, nous trouvâmes le collier sous l'animal",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 137
			}
		}
	]
}