{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 949,
			"arabicnumber": "421.01",
			"text": "D'après Sahl Ibn Sa'd As-Sâ'idî (que Dieu l'agrée), l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) était allé chez les Banû 'Amr Ibn 'Awf pour rétablir la paix parmi eux. Comme l'heure de la prière était arrivée, le muezzin vint trouver Abou Bakr et lui dit : \"Veux-tu présider la prière pour que je fasse le second appel?\". - \"Oui\", répondit-il. Abou Bakr présida la prière, mais au cours de laquelle, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) arriva à la mosquée. Il se fraya un passage à travers les fidèles et se mit au premier rang. Les fidèles battirent des mains (pour attirer l'attention de l'imam), mais Abou Bakr ne se retourna pas et continua sa prière. Puis, comme les fidèles faisaient plus de bruit, il se retourna et aperçut l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui). Celui-ci lui fit signe de demeurer en sa place. Abou Bakr éleva les mains et loua Dieu, à Lui la puissance et la gloire, pour l'ordre que venait de lui donner l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui). Ensuite, il recula et alla prendre place au premier rang parmi les fidèles. Alors l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) s'avança, fit la prière et quand elle fut achevée il dit : \"Ô Abou Bakr, qu'est-ce donc qui t'a empêché de rester à ta place puisque je t'en avais donné l'ordre?\". - \"C'est, répondit Abou Bakr, qu'il n'appartenait pas au fils de Abou Quhâfa (surnom de Abou Bakr) de diriger la prière en présence de l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui)\". Puis, s'adressant aux fidèles, l'Envoyé de Dieu (paix et bénédiction de Dieu sur lui) dit : \"Pourquoi donc avez-vous tapé des mains si bruyamment? Celui d'entre vous qui, étant en prière, voulut exprimer quelque chose, qu'il glorifie Dieu car cette glorification attire l'attention de l'imam. Seules les femmes sont autorisées à claquer des mains pour cette fin\". Au cas d'urgence en priant, l'homme doit célébrer la gloire de Dieu tandis que la femme peut applaudir",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 111
			}
		}
	]
}