{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"15": "The Chapters on Charity"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2390,
			"arabicnumber": 2390,
			"text": "Ömer bin el-Hattâib (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) (kendisine): «(Vermiş olduğun) sadakana dönüş yapma.» AÇIKLAMA 2391’de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2391,
			"arabicnumber": 2391,
			"text": "Abdullah bin el-Abbâs (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Sadaka verip sonra sadakasına dönüş yapan kimsenin durumu, kusan sonra dönüp kusmuğunu yiyen köpeğin durumu gibidir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2392,
			"arabicnumber": 2392,
			"text": "Ömer (bin el-Hattâb) (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken kendisi (yaya bir mücâhide) bir at'ı sadaka olarak vermiş, bir süre sonra at sahibinin at'ı noksan fiyatla satmak istediğini görmüş ve bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem)'e giderek at'a müşteri olmasının hükmünü sormuştur. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) de (Ömer'e): «Sadakanı satın alma,» buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2393,
			"arabicnumber": 2393,
			"text": "Zübeyîr bin el-Avvâm (r.a.)'den rivayet edildiğine göre: Kendisi gamr veya gamre denilen bir at'ı sadaka olarak (birisine) vermiş sonra o at'tan olduğu söylenen erkek veya dişi kir tay'ın satışa arz edildiğini görmüş ve (onun atından olduğu için) tay'ı satın almayı bırakmıştır. Not: Bunun senedinin sahih olduğu, Zevaid'de bildirilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2394,
			"arabicnumber": 2394,
			"text": "Büreyde (bin el-Husayb) (r.a.)'den; Şöyle demiştir: Bir kadın, Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: Yâ Resulallan! Ben anneme (genç) bir cariyeyi sadaka olarak verdim. Annem de öldü (ve o cariyeyi bıraktı), dedi. Bunun üzerine Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (kadına) şöyle buyurdu: «Allah seni sevablandırdı ve (cariyeyi) mirasla sana geri verdi..» EBU DAVUD HADİSİ İÇİN TIKLA",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2395,
			"arabicnumber": 2395,
			"text": "Amr bin Şuayb'ın dedesi (Abdullah bin Amr bin el-Âs) (r.a.)'den; Şöyle demiştir: Bir adam Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: Yâ Resûlallah! Ben anneme bir bahçemi verdim. (Sonra) annem de öldü ve benden başka mirasçı bırakmadı, dedi. Resulullah (Sallallahu Aleyhi ve Sellem) de (adama) şöyle buyurdu: «Senin sadakan tam oldu. Bahçen de sana döndü.» Not: Zevaid'de şöyle denilmiştir: Amr bin Şuayb'ın hadisini delil gösterenlerin yanında bu sened sahihtir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2396,
			"arabicnumber": 2396,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre: (Babası) Ömer bin el-Hattab (ın ganimet payı) Hayber'de (Semg denilen hurmalık) bir araziye isabet etti. Sonm Ömer (r.a.), Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına giderek: Yâ Resülaliah! Hayber'de(ki ganimetten) öyle bir mal bana isabet etti ki benim nazarımda bundan daha azizi ve güzel bir malı şimdiye kadar hiç elde etmedim. Bana ne emir buyurursun? diyerek (araziyi hayır için değerlendirme şekli hakkında) O'ndan emir istedi. Bunun üzerine Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (kendisine): «Dilersen arazinin aslını vakfedersin ve onun mahsullerini sadaka edersin,» buyurdu. İbn-i Ömer demiştir ki: Sonra Ömer bu arazi hakkında şu (şartlı vakıf) işlemi yaptı: Malın aslı satılamaz, hibe edilemez ve ona mirasçı olunamaz. Ömer onun gelirini fakirlere, vâkıfın yakın akrabasına, esaretten kurtulmak isteyen kölelere, Allah yolunda savaşan mücâhidlere, yolculara ve konuklara sadaka kıldı. Bu malın mütevellisi olan kimsenin bundan mal biriktirmeksizin ve mülkiyetine tecâvüz etmeksizin gelirinden örfe göre yemesinde veya bir dostuna yedirmesinde bir günah yoktur. EBU DAVUD HADİSLERİ VE İZAH: 2878 – 2879",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2397,
			"arabicnumber": 2397,
			"text": "(Abdullah) bin Ömer (r.a.)'den rivayet edildiğine göre (babası) Ömer bin el-Hattâb: Yâ Resûlullah! Şüphesiz ben, Hayber'deki yüz sehim(lik malım) -dan bana daha sevimli bir malı hiç bir zaman elde etmedim. Ben bunu sadaka etmek istedim, dedi. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) (ona): «Onun aslını vakfet ve meyvasını Allah yoluna tahsis eti» buyurdu. . EBU DAVUD HADİSLERİ VE İZAH: 2878 – 2879",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2398,
			"arabicnumber": 2398,
			"text": "Ebû Umâme (r.a.)'den rivayet edildiğine göre kendisi: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'den işittim şöyle buyurdu, demiştir: «Âriye (sahibine) ödenir. Minha da (sahibine) iade edilir.» Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedi zayıftır. Çünkü ravi İsmail bin Ayyaş tedlisçidir. Lakin bu hadisi yalnız İbn-i Ayyaş rivayet etmemiştir. Zira İbn-i Hibban de kendi sahih'inde bu hadisi başka bir senedIe rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2399,
			"arabicnumber": 2399,
			"text": "“... Enes bin Mâlik (radıyallahü anh)’den rivâyet edildiğine göre kendisi : Resûlüllah (sallallahü aleyhi ve sellem)’den şöyle buyururken işittim, demiştir: (sahibine) ödenir ve minha (sahibine) iade edilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2400,
			"arabicnumber": 2400,
			"text": "Semûre (bin Cündüb) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur; «El, (başkasına âit) aldığı malı, (mâlikine) ödeyinceye kadar o maldan sorumludur.» Diğer tahric: Bu hadisi Tirmizi, Ebu Davud ve Nesai de rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2401,
			"arabicnumber": 2401,
			"text": "Amr bin Şuayb'm dedesi (Abdullah bin Amr bin el-Âs (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem), şöyle buyurdu, demiştir: «Bir mal hıfz edilmek üzere kimin yanına emaneten bırakılırsa o kimse üzerine tazminat yükleme yoktur.» Not: Ravi el-Müsenna ve onun ravisi zayıf oldukları için bu sened zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2402,
			"arabicnumber": 2402,
			"text": "Urve el-Bârıkî (bin ebi'l-Ca'd) (r.a.)'den rivayet edildiğine göre : Nebi (Sallallahu Aleyhi ve Sellem) kendisi için bir koyun satın almak üzere ona bir dinar verdi. O da (gidip) Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) için (o dinarla) iki koyun satın aidi. Sonra bir koyunu bir dinara sattı ve Nebi (Sallallahu Aleyhi ve Sellem)'e bir koyun ile bir dinar getirdi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) (alış verişinin) bereketli olması için ona dua etti. Râvî demiştir ki: Artık Urve ve toprak alsaydı onda kâr ederdi.\" ... \"Urve bin Ebi'l-Ca'd el-Bârıkî (r.a.)'den; Şöyle demiştir : Satılmak üzere bir koyun sürüsü geldi. Nebi (Sallallahu Aleyhi ve Sellem) de bana bir dinar verdi ve râvi bunun mislini anlattı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2403,
			"arabicnumber": 2403,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Zulüm, borcunu ödemeye muktedir olanın özürsüz olarak borcunu ödemeyi geciktirmesidir. Ve (alacaklı durumda olan) biriniz varlıklı ve güvenilir bir kimseye havale edildiği zaman, havale işini kabullensin.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2404,
			"arabicnumber": 2404,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Borcunu ödemeye muktedir olanın özürsüz olarak borcunu ödemeyi geciktirmesi bir zulümdür. Ve sen (alacaklı durumda iken) varlıklı ve güvenilir bir kimseye havale edildiğin zaman ona havale edilmeni kabullen.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2405,
			"arabicnumber": 2405,
			"text": "Ebû Ümâme el-Bâhilî (r.a.)'den rivayet edildiğine göre kendisi: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'den şöyle buyururken İşittim, demiştir: «Kefil, taahhüd ettiği borcu yüklenmiştir ve borcun ödenmesi vâcibtir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2406,
			"arabicnumber": 2406,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken bir adam 10 dinar alacaklı olduğu borçlusunun yakasına sarıldı. Borçlu şahıs (alacaklısına): Benim yanımda (mülkiyetimde) sana vereceğim hiç bîr şey yoktur, dedi. Alacaklı adam da (borçlusuna): Hayır! Vallahi sen alacağımı ödeyinceye veya bir kefil bana getirinceye kadar senden ayrılmıyacağım, dedi. Sonra onu Nebi (Sallallahu Aleyhi ve Sellem)'in huzuruna çekip götürdü. Nebi (Sallallahu Aleyhi ve Sellem) borçluya: «Sen alacaklından ne kadar mehil istersin?» buyurdu. Borçlu: Bir ay, dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «O halde ona ben kefil olurum.» buyurdu. Sonra borçlu. Nebi (Sallallahu Aleyhi ve Sellem)'in dediği vakitte huzura geldi (veya borcunu getirdi). Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) ona: «Bu (altını) nereden elde ettin?» buyurdu. Adam: Bir madenden, diye cevab verdi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Bunda hayır yoktur,» buyurdu ve onun yerine borcunu ödedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2407,
			"arabicnumber": 2407,
			"text": "Ebû Katâde (r.a.)'den rivayet edildiğine göre: Bir cenaze. Nebi (Sallallahu Aleyhi ve Sellem)'e getirilerek üzerine namaz kılması arzulandı. Fakat Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (sahabilere): «Arkadaşınız üzerine (siz) namaz kılınız. Çünkü onun üzerinde bir borç vardır.» buyurdu. Bunun üzerine Ebû Katâde: O borcu ben tekeffül ederim, dedi. Nebi (Sallallahu Aleyhi ve Sellem): «Ödemeyi (mi?)» buyurdu. Ebû Katâde: (Evet) ödemeyi (tekeffül ederim), dedi. Cenazenin zimmetindeki borç on sekiz veya on dokuz dirhem idi. (Sonra Nebi (Sallallahu Aleyhi ve Sellem) onun üzerine namaz kıldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2408,
			"arabicnumber": 2408,
			"text": "İmran b. Huzeyfe (r.a)’den rivâyete göre, şöyle demiştir: Meymune çok borçlanırdı. Ailesi borçlanmasını hoş görmeyip ona kızınca Meymune: “Borçlanmadan vazgeçmeyeceğim sevgili eşim ve dostum.” Rasûlullah (s.a.v) şöyle derken işittim: “Her kim ödeme niyeti ile borç ederse Allah onu dünyada ödettirir.” Bu Hadisi Nesai Buyu’ da tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2409,
			"arabicnumber": 2409,
			"text": "Abdullah bin Ca'fer (bin Ebl Tâlib) (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Borçlu Allah'ın rızâsına aykırı bir şeye Aid olmadıkça borcunu ödeyinceye kadar Allah onunla beraberdir.» Zevaid de: Bu hadis’in isnadı sahihtir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2410,
			"arabicnumber": 2410,
			"text": "Suhaybü'l-Hayr (bin Sinan) (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Herhangi bir adam ödünç alacağı şeyi sahibine ödememek kararı ile borçlanırsa Allah'ın huzuruna hırsız olarak çıkar.» Bu hadis başka bir senedle de Suhayb'den, merfû olarak rivayet edilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2411,
			"arabicnumber": 2411,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Her kim halkın mallarını, telef etmek niyetiyle alırsa. Allah onu telef ettirir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2412,
			"arabicnumber": 2412,
			"text": "Resulullah (Sallallahu Aleyhi ve Sellem)'in mevlâsı (azadlı kölesi) Sevbân (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kim (şu) üç şeyden uzak iken ruhu cesedinden aynlırsa, cennet'e girer: Kibir, ganimet malına hıyanet ve borç.» Diğer tahric: Tirmizi, Nesai, İbn-i Hibban ve Hakim AÇIKLAMA 2413’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2413,
			"arabicnumber": 2413,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «(Ölen) mu'min'in ruhu. zimmetindeki borç ödeninceye kadar borçluluğundan dolayı tutukludur.» Diğer tahric: Ahmed ve Tirmizi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2414,
			"arabicnumber": 2414,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivâyel edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Üzerinde bir dinar veya bir dirhem (borç) bulunduğu halde Ölen kimsenin borcu onun hasenatından (hayırlarından) ödenir. Orada (Yâni kıyamette) ne dinar var ne de dirhem.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Muhammed bin Salebe bin Seva vardır. Ebu Hatim onun hakkında: Ben ona yetiştim de onun hadislerini yazmadımt demiştir. Ben onun hakkında yalnız bunu gördüm. Ebu Hatim'den başka hiç bir imam'ın onun hakkında bir şey söylediğini görmedim. Senedin kalan ravileri Müslim'in şartı üzerine sİka zatlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2415,
			"arabicnumber": 2415,
			"text": "Ebu Hureyre (r.a.)l'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken mu'min kimse borçlu olarak öldüğü zaman Resulullah (Sallallahu Aleyhi ve Sellem): «Bu ölü, borcunu karşıhyacak bir mal bıraktı mı?» diye sorardı. Eğer oradakiler: Evet, deseydiler Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem} onun üzerine namaz kılardı. Ve eğer: Hayır, deseydiler Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) oradakilere: «Arkadaşınız üzerine siz namaz kılınız,» buyururdu. Sonra Allah Teâlâ Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem)'ine fetihler verince Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: «Ben mu'minlere kendi nefislerinden daha yakınım. Her hangi bir mu'min borçlu ölürse, borcunu ödemek bana aittir. Mal bırakırsa, veresesinin hakkıdır.» Diğer tahric: Bu hadisi, Buhari, Müslim, Tirmizi ve Nesai de rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2416,
			"arabicnumber": 2416,
			"text": "Câbir (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim (ölürken) bir mal bırakırsa, bu onun mirasçılarınındir ve kim (ölürken) bir borç veya bakıma muhtaç aile ferdleri bırakırsa (borcunu ödemek ve çoluk çocuğuna bakmak) benim üzerimdedir ve (işi) bana aittir. Ben mü'minlere (kendilerinden) daha yakınım.» Diğer tahric: Ebu Davud, Nesai ve Ahmed",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2417,
			"arabicnumber": 2417,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim fakir bir borçluya kolaylık gösterirse Allah (da) ona dünyada ve âhirette kolaylık ihsan eder.» Diğer tahric: Bu hadisi Müslim, Ebu Davud, Tirmizi, Nesai, Hakim ve İbn-i Hibban da rivayet etmişlerdir. Bazı rivayetlerde bulunan cümle değişikliği mana ve hükmü etkilemez",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2418,
			"arabicnumber": 2418,
			"text": "Büreyde el-Eslemî (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kim bir fakirin borcunu ertelerse (erteleme süresince) her gün karşılığında o kimseye bir sadaka sevabı olur. Kim onun borcunu vâdesi geldikten sonra ertelerse (bu sürece) her gün karşılığında o kimseye borç mikdarının bir misli sadaka sevabı olur.» Not: Zevaid'de şöyle denilmiştir; Bunun senedinde Nüfey' bin el-Haris el-A’ma el-Kufi vardır. Bu ravinin zayıflığı üzerinde ittifak edilmiştir. Diğer tahric: Ahmed ve Hakim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2419,
			"arabicnumber": 2419,
			"text": "Peygamber (Sallallahu Aleyhi ve Sellem)'in sahabisi Ebü'l-Yeser (Ka'b bin Amr) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim Allah'ın kendisini (kıyamet günü Arş'ın) gölgesinde gölgelemesini severse bir fakirin borcunu ertelesin ya da (borcunu kısmen veya tamamen) düşsün.» Diğer tahric: Müslim, Hakim ve Taberani",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2420,
			"arabicnumber": 2420,
			"text": "Huzeyfe (r.a.)'den rivayet edildiğine göre; Peygamber (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «(Sizden önceki ümmetlerden) bir adam ölmüş (ve cennete girmiş) sonra kendisine: Sen ne (hayır) işledin (ki cennetlik oldun)? diye sorulmuştur. Adam — işlediği hayrı — (ya hatırlamış veya kendisine hatırlatılmış) da: Ben (istihkakım olarak) dirhemleri, dinarları ve nakid para (yi aldığım) da müsamaha ve kolaylık gösterirdim. Fakir borçluya da mehil verirdim, diye cevab vermiş. Bunun için Allah kendisini bağışlamıştır. (Huzeyfe (r.a.) bu hadisi rivayet ederken orada bulunan Ukbe bin Amr el-Ensârî) Ebû Mes'ûd (r.a.): Ben (de) bunu Resulullah (Sallallahu Aleyhi ve Sellem)'den işittim, demiştir. Diğer tahric: Buhari ve Müslim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2421,
			"arabicnumber": 2421,
			"text": "(Abdullah) bin Ömer ve Âişe (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kim hakkını taleb ederse bunu imkân nisbetinde günahlara girmekten sakınarak istesin.» Diğer tahric: Tirmizi ve İbn Hibban AÇIKLAMA 2422’de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2422,
			"arabicnumber": 2422,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre, Resulullah (Sallallahu Aleyhi ve Sellem) hak sahibine: «Sen hakkını, imkân dâhilinde günahlara girmekten sakınarak al.» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bu, sahih bir seneddir. Ravileri Müslim'in şartı üzerine sika zatlardır. İbn-i Hibban da bunu kendi sahihinde rivayet etmiştir. Diğer tahric: İbn Hibban",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2423,
			"arabicnumber": 2423,
			"text": "Ebu Hureyre (r.a.)'dea rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Şüphesiz sizin en hayırlınız borcunu en güzel şekilde verenlerinizdir. (Veya borcunu en güzel şekilde verenleriniz sizin en hayırlı olanlarınızdandır.)» Diğer tahric: Buhari. Müslim, Tirmizi ve Nesai",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2424,
			"arabicnumber": 2424,
			"text": "Abdullah bin Ebî Rebîa el-Mahzûmî (r.a.)'den rivayet edildiğine göre: Peygamber (Sallallahu Aleyhi ve Sellem) Huneyn savaşma giderken kendisinden otuz veya kırk bin (dinar veya dirhem) ödünçalmış ve savaştan dönünce bu borcu kendisine ödemiş sonra Peygamber (Sallallahu Aleyhi ve Sellem) kendisine: «Allah senin için ailene ve malına bereket ihsan eylesin. Şüphesiz borcun karşılığı (borçlunun) bunu tam olarak (alacaklıya) ödemesi ve teşekkür etmesidir.» Diğer tahric: Ahmed ve Nesai",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2425,
			"arabicnumber": 2425,
			"text": "(Abdullah) bin Abhâs (r.a.)'dan; Şöyle demiştir: Bir adam gelip Allah'ın Nebisi (Sallallahu Aleyhi ve Sellern)'den bir alacak veya bir hak taleb etti de (yüce huzura münâsib olmayan kaba) bâzı sözler söyledi. Resulullah (Sallallahu Aleyhi ve Sellem)'in sahâbîleri o adamın haddini bildirmek istediler. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Susunuz, bırakınız. Çünkü kişi borcunu ödeyinceye kadar alacak sahibinin onun üzerinde bir nüfuzu (yâni edep çerçevesinde alacağını taleb etme hakkı) vardır.» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Haneş bulunuyor. Bu zatm ismi Huseyn bin Kays Ebu Ali er-Rahbi'dir. Ahmed, İbn-i Main, Ebu Hatim ve Ebu Zur'a bunun zayıflığını ifade etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2426,
			"arabicnumber": 2426,
			"text": "Ebu Saîd-i Hudri (r.a.)'den: şöyle demiştir: Bir bedevi Peygamber (Sallallahu Aleyhi ve Sellem)'e gelerek Resul-i Ekrem (Sallallahu Aleyhi ve Sellem)'in uhdesinde bulunan alacağını istedi de O'na karşı sert davrandı. Hattâ O'na: Borcumu ödemezsen (veya: Borcumu ödediğin zaman dışında) seni sıkıştıracağım, dedi. Bunun üzerine sahâbiler (o kaba) bedeviyi azarladılar ve (kendisine): Yazıklar olsun sana kimle konuştuğunu biliyor (mu)sun? dediler. Bedevi: Ben şüphesiz hakkımı istiyorum, dedi. Bundan sonra Peygamber (Sallallahu Aleyhi ve Sellem) (sahâbîlerine): «Niçin hak sahibi ile beraber (ondan yana) olmadınız? (olmalıydınız), buyurdu. Sonra Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) (Hamza r.a.'ın karısı) Havle bint-i Kays (r.anha)'ya (haber) gönderdi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) ona: «Eğer yanında kuru hurma varsa bize ödünç ver, bizim kuru hurmamız gelince senin borcunu öderiz.» Havle de: Evet, babam sana feda olsun Ya Resulallah, dedi. (Rabi) demiştir ki: Havle Resul-i Ekrem (Sallallahu Aleyhi ve Sellem)'e ödünç verdi. ve Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) de bedevi'nin borcunu ödedi ve ona yemek yedirdi. Sonra bedevi (Resul-i Ekrem (Sallallahu Aleyhi ve Sellem))'e: Sen benim hakkımı mükemmel bir şekilde ödedin. Allah da sana mükafatını tam olarak versin, diye dua etti. Bunun üzerine, Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): İşte bunlar insanların en hayırlılarındandır. İçinde zayıf kimsenin incitilmeden hakkını alamadığı bir toplum yücelemez. (veya yücelmesin.) Not: Zevaid'de şöyle denilmiştir: Bu, sahih bir seneddir, ravileri sika zatlardır. Çünkü ravi İbrahim bin Abdillah'ın çok doğru sözlü olduğunu Ebu Hatim söylemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2427,
			"arabicnumber": 2427,
			"text": "Eş-Şerîd (bin Süveyd es-Sakafî (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Borcunu ödemeye gücü yeten kişinin borcunu ödemeyi geciktirmesi (alacaklısı tarafından) şikâyet edilmesini ve cezalandırılmasını helâl kılar.» EBU DAVUD HADİSİ VE İZAH İÇİN TIKLA",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2428,
			"arabicnumber": 2428,
			"text": "El-Hirmâs bin Habîb'in dedesi (r.a.)'den; Şöyle demiştir: Ben bir borçlumu (yakalayıp) Peygamber (Sallallahu Aleyhi ve Sellem)'e götürdüm. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) bana: «Borçlunun peşini bırakma,» buyurdu. Sonra gündüzün sonunda bana uğrayarak: «Yâ Ahâ benî Temim! Senin esirin ne yaptı (Yâni borcunu ödedi mi?)» buyurdu. EBU DAVUD HADİSİ VE İZAH İÇİN TIKLA",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2429,
			"arabicnumber": 2429,
			"text": "Kâ'b bin Mâlik (r.a.)'den rivayet edildiğine göre: Kendisi (Bir gün) Mescid-i Nebevi'de (Abdullah) bin Ebî Hadred (el-Eslemi)'den alacağını ödemesini istemiş (ve aralarında ileri geri konuşma geçmiş), hattâ sesleri yükselmiş ve nihayet Resulullah (Sallallahu Aleyhi ve Sellem) evinde olduğu halde seslerini işitmiş ve bunun üzerine onların yanına teşrif ederek: «Yâ Kâ'b,» buyurmuştur. Kâ'b de: Emrindeyim, Yâ Resûlallah! diye cevab vermiştir. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) (ona): «Alacağından şu kadarını bırak,» buyurmuş ve istihkakın yarısını mübarek eliyle işaretlemiştir. Kâ'b de: Yaptım, demiş, (bunun üzerine) Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) (borçluya): «Kalk da bunu (yâni kalanı) öde,» buyurmuştur. EBU DAVUD HADİSİ VE İZAH İÇİN TIKLA",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2430,
			"arabicnumber": 2430,
			"text": "Kays bin Rûmî'den; Şöyle demiştir: Süleyman bin Üzünân, Alkame (bin Kays bin Abdillah'a ödeneği çıkıncaya kadar bin dirhem borç vermiş idi. Sonra Alkame'nin ödeneği çıkınca Süleyman alacağını kendisinden İstedi ve onu sıkıştırdı. Bunun üzerine Alkame borcunu ödedi. (Ama) Alkame kızmış gibiydi; bir kaç ay durdu. Sonra Süleyman'ın yanına giderek! Benim ödeneğim çıkıncaya kadar bana bin dirhem ödünç ver, dedi. Süleyman da: Peki, memnuniyetle (dedikten sonra ailesine.) Yâ Ümme Utbe! Senin yanmda bulunan mühürlü keseyi getir, dedi. Bunun üzerine Ümmü Utbe keseyi getirdi. Süleyman (bana hitaben:) Bilmiş ol ki: Allah'a yemin ederim bu (para), şüphesiz senin bana ödediğin dirhemlerdir. Ben bundan tek bir dirhemin (bile) yerini değiştirmedim (kullanmadım), dedi. (Bunun üzerine) Alkame: Allah babandan razı olsun. O halde (alacağının tahsili için) beni sıkıştırmanın sebebi ne idi? dedi. Süleyman: (Sebebi senden işittiğim (hadis) dir deyince, Alkame: Sen benden ne işittin? diye sordu. Süleyman: Ben senden İşittim, sen İbn-i Mes'ûd (r.a.)'den rivayetle Peygamber (Sallallahu Aleyhi ve S«llem)'in şöyle buyurduğunu naklettin: «Bir müslumana bir şeyi iki kez borç olarak veren hiç bir nuislüman yoktur ki onun bu davranışı, o şeyi bir defa sadaka etmesi gibi (sevab) olmasın.» Alkame: İbn-i Mes'ûd bana böyle rivayet etti, dedi. Not: Zevaid'de şöyle denilmiştir; Bunun senedi zayıftır. Çünkü ravi Kays bin Rünii mechüldur. Süleyman bin Yüseyr'in de zayıflığı üzerinde ittifak edilmiştir. Bu hadisi İbn-i Hibban kendi sahih'inde başka bir sened ile İbn-i Mes'ud (r.a.)'den rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2431,
			"arabicnumber": 2431,
			"text": "Enes bin Mâlik (r.a.)'den rivayet edildiğine gire Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Mirac'a çıkarıldığım gece Cennet'in kapısı üzerinde: \"Sadaka karşılığı (nda) on misli (sevab var) dır. Borç karşılığı (nda) da on sekiz misli (sevab var) dır.\" ifâdesinin yazılı olduğunu gördüm. Bunun üzerine Cebrail'e: Borç vermenin sadakadan üstün olmasının hikmeti nedir? diye sordum. Cebrail dedi ki: Çünkü sadaka dileyen kişi (bazen) yanında (bir şey) bulunduğu halde dilenir. Fakat borç isteyen kimse, ancak ihtiyaçtan dolayı borçlanmak ister. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde bulunan Halid bin Yezid'in zayıflığını Ahmed, İbn-i Main, Ebu Davud, Nesai, Ebu Zur'a. Darekutni ve başkalan ifade etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2432,
			"arabicnumber": 2432,
			"text": "Yahya bin Ebî îshâk el-Hünâi'den; Şöyle demiştir: Ben Enes bin Mâlik (r.a.)'a şunu sordum: Bizden bir adam, (din) kardeşine mal ikraz eder (yâni mislini geri almak üzere bir mal verir). Sonra malı alan kişi, ikraz edene bir hediye verir? Enes dedi ki: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Biriniz bir mal ikraz edip sonra malı alan şahıs ikraz edene bir hediye verdiği veya onu bineğine bindirmek istediği zaman sakın o bineğe binmesin ve o hediyeyi kabul etmesin. Meğer ki, ikraz işinden önce bunlar arasında bu nevi iş cereyan etmiş ola.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Utbe bin Humeyd ed•Dabbi bulunuyor. Bu raviyi Ahmed ve Ebu Hatim zayıf saymışlar ve İbn-i Hibban ise onu sikalar arasında anmıştır. Ravi Yahya bin Ebi İshak'ın hali de mechuldür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2433,
			"arabicnumber": 2433,
			"text": "Sa'd bin el-Atval (r.a.)'den rivayet edildiğine göre: Kardeşi vefat etmiş, üçyüz dirhem (mal) bırakmış ve bakıma muhtaç çoluk çocuğu bırakmıştır. (Sa'd demiş ki:) Bunun üzerine ben bu parayı kardeşimin çoluk çocuğunun nafakasına harcamak istedim. Fakat Peygamber (Sallallahu Aleyhi ve Sellem) (bana): «Senin (ölen) kardeşin borcundan dolayı hapsedilmiştir. Artık sen onun yerine borcunu öde», buyurdu. Sa'd da: Yâ ResOlaUaht Ben onun yerine borcunu ödedim. Yalnız bir kadının iddia edip şâhidlendiremediği iki dinarı ödemedim. dedi. Bunun üzerine Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (Sa'd'a): «Sen kadına (iddia ettiğini) ver. Çünkü kadın şüphesiz gerçeği söyleyendir (veya bunu hak edendir)» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahihtir. Ravi Abdülmelik Ebü Cafer'i İbn-i Hibban sika zatlar arasında anmıştır. Senedin kalan ravileri de sahihtit. Kütüb-i Sitte'de Sa'd bin el-Atvan'ın bundan başka hadisi yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2434,
			"arabicnumber": 2434,
			"text": "Câbir bin Abdillah (bin Amr bin el-Harâm) (r.a.)'dan rivayet edildiğine göre: Babası (Abdullah) bir yahûdi adamın (alacaklı) olduğu otuz vesk (kuru hurma) borcunu kendisinin boynunda bırakıp vefat etti (şehid edildi). Câbir bin Abdillah, borcun ertelenmesini yahûdî'den taieb etti ise de yahûdî ona mehil vermekten imtina etti. Bunun üzerine Câbîr Resulullah (Sallallahu Aleyhi ve Sellem)'e müracaat ederek kendisi İçin yahüdî ile görüşüp aracılık etmesini diledi. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) Câbir'in yanına giderek boynundaki borca karşılık hurmalığının meyvasım almayı yahudiye teklif etti. Fakat (hurmalıktaki hurma az olduğundan) yahûdi bundan imtina etti. Resulullah (Sallallahu Aleyhi ve Sellem) yahûdî ile (tekrar) konuştu. (Câbir'e mehil vermesini istedi) Yahudi borcu ertelemeyi de kabul etmedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) Câbir'in hurmalığına girdi ve içinde dolaştıktan sonra Câbir'e: Ağaçlardaki hurmaları yahûdi için topla ve onun borcunun tamamını ver-, buyurdu. Resulullah (Sallallahu Aleyhi ve Sellem) (hurmalıktan çıkıp) döndükten sonra Câbir de yahûdi için otuz vesk hurma topladı ve on iki vesk de kendisi için arttı. Sonra Câbir olup biten bu durumu Resulullah (Sallallahu Aleyhi ve Sellem)'e haber vermek üzere O'nun yanına gitti. Fakat Resulullah (Sallallahu Aleyhi ve Sellem)'i (yerinde) bulamadı. Resulullah (Sallallahu Aleyhi ve Sellem) (gittiği yerden) dönünce Câbir O'nun yanına vardı, yahudînin borcunun tamamını ödediğini haber verdi ve on iki veskin arttığını arz etti. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) (Câbir'e): «Bu durumu Ömer bin el-Hattâb'a haber ver,» buyurdu; Câbir de Ömer (r.a.)'a gidip haber verdi. Ömer, Câbir'e : And olsun Resulullah (Sallallahu Aleyhi ve Sellem) hurmalıkta dolaştığı zaman kesin olarak bildim ki Allah muhakkak hurmalığı bereketlendirecektir.» EBU DAVUD HADİSİ VE İZAH İÇİN TIKLA",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2528,
			"arabicnumber": 2528,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine gorc; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir; «Kim bir köledeki hissesini âzadlar ve kölenin (kalan) hissesine yetecek kadar malı var ise onun adına, kölenin kalan sehmi için adaletli bir kıymet takdir edilir ve o kimse, ortaklarının hisseleri (nin kıymet)ini verir. Köle de onun adına âzadlamr. Şayet o kimsenin, ortaklarının hisselerini karşılıyacak kadar malı yok ise köleden azadadığı hisseyi âzadlamış olur.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 46
			}
		}
	]
}