{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"20": "The Chapters on Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2533,
			"arabicnumber": 2533,
			"text": "Ebu Ümâme (Es'ad) bin Sehl bin Huneyf (r.a.)'den; Şöyle demiştir: (Halîfe) Osman bin Affân (r.a.) (fitneciler yüzünden evine kapandığı günlerde) bir ara onlara yukardan baktı ve onların (kendisini) öldürmekten sözetmekte olduklarını işitti. Sonra (bize) şöyle söyledi: Onlar şüphesiz beni ölümle tehdîd ediyorlar. Niçin beni öldürüyorlar? Halbuki ben Resulullah (Sallallahu Aleyhi ve Sellem)'den: «(Şu) üç (suç)dan başka (suçlar)dan dolayı hiçbir müslümanın kanı (nı akıtmak) helâl olmaz: Sahih bir nikâh ile cinsel ilişkide bulunmuş olduğu halde zina edip recmedilen adam, haksız olarak bir insanı katleden adam ve müslüman olduktan sonra din'den çıkan adam (öldürülürler.)» buyururken işittim. Allah'a yemin ederim ki, ben ne câhîîiyet devrinde ne de İslâmiyet döneminde zina ettim. Müslüman hiç bir kimseyi de öldürmedim ve müslüman olduğum andan bu ana kadar dinden çıkmadım. EBU DAVUD HADİSİ VE İZAHI TIKLA",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2534,
			"arabicnumber": 2534,
			"text": "Abdullah bin Mes'ûd (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Allah'tan başka ilâh olmadığına ve benim Allah'ın Resulü olduğuma şehâdet eden hiç bir müslüman kişinin kanı (nı akıtmak) helâl olmaz. Ancak (şu) üç kişiden birisinin kanı helâl olur: Maktulün hayatına karşılık (öldürülecek! katil, zina eden seyyib (yâni sahih bir nikâh ile cinsel ilişkide bulunmuş kişi) ve İslâm cemaatından ayrılıp dinini terkeden kimse.» EBU DAVUD HADİSİ VE İZAHI TIKLA",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2535,
			"arabicnumber": 2535,
			"text": "İbn-i Abbas (r.a.)'den (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir; «Her kim (hak olan) dinini değiştirirse, onu hemen öldürünüz.» Diğer tahric: Buhari, MüsIiın, Tirmizi ve Ebu Davud da kısa ve uzun metinler halinde rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2536,
			"arabicnumber": 2536,
			"text": "Behz bin Hakîm'in dedesi (Muâviye bin Hayda) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: Müslüman olduktan sonra (Allah'a) ortak koşan bir müşrik kâfirlerden ayrılıp müslümanlar (camiasın) a katılmadıkça Allah onun hiç bir amelini kabul etmez.» 2535 ve 2536",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2537,
			"arabicnumber": 2537,
			"text": "İbn-i Ömer (r.a.)'den (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Allah'ın (koyduğu) had (cezâ)Iarından birisini dosdoğru infaz etmek Allah Azze ve Celle'nin beldelerinde kırk gece (süreyle) yağan) yağmurdan daha hayırlıdır.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde bulunan Said bin Sinan'ı İbn-i Main ve başkası zayıf saymışlardır. Darekutni de: O hadis uydurur, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2538,
			"arabicnumber": 2538,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Yer yüzünde uygulanan (ilâhî) bir had (ceza), yerdekiler için kendilerine kırk gün yağmur verilmesinden daha hayırlıdır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2539,
			"arabicnumber": 2539,
			"text": "İbn-i Abbas (r.a.)'den (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim Kur'an'dan bir âyet'i inkâr ederse şüphesiz onun boynunu vurmak (öldürmek) helâl olur. Kim de: Allah'tan başka (hak) ilâh yoktur, O birdir, ortağı yoktur. Şüphesiz Muhammed (Sallallahu Aleyhi ve Sellem) de Allah'ın kulu ve Resulüdür, derse artık kimse ona dokunamaz. Meğer ki bir (suç işlemekle) bir had (cezây)a uğrar da cezası infaz edile.» Not: Zevaid'de şöyle denilmiştir: Bu, zayıf bir sened'dir. Çünkü bunda Hafs bin Ömer el-Arabi bulunur. İbn-i Main, Ebü Hatim, Nesai, İbn-i Adi ve Darekutni onu zayıf saymışlar. İbn-i Ebi Hatim ise onu sika saymıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2540,
			"arabicnumber": 2540,
			"text": "Ubâde bin es-Sâmıt (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir; «(Ey müslümanlar) Siz Allah'ın had (cezâ)larını (Akrabalıkta veya güçlülükte ve güçsüzlükte size) yakın olan ve uzak olan herkes hakkında dosdoğru infaz ediniz. Sakın hiç bir kınayanın kınaması sizi Allah (ın hükmünü uygulamak) konusunda tutmasın (yâni alıkoymasın.)» Not: Zevaid'de şöyle denilmiştir: Bunun senedi İbn-i Hibban'ın şartı üzerine sahihtir. Çünkü o bunun bütün ravilerini sikalar arasında anmıştır. Bu babta rivayet olunan İbn-i Ömer (r.a.)'ın hadisini Taberani de rivayet etmiştir. Ebu Hureyre (r.a.)'ın hadisini Ahmed ve Nesai de rivayet etmiştir. İbn-i Abbas (r.a.)'ın hadisi ile Ubade (r.a.)'ın hadisi ise Zevaid türünden olup başkaca kim tarafından rivayet edildiğini tesbit edemedim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2541,
			"arabicnumber": 2541,
			"text": "Atiyye el-Kurazî (r.a.)'den; Şöyle demiştir: Kurayza (savaşı) günü (müslümanlarca esir edilen) bizler Resulullah (Sallallahu Aleyhi ve Sellem)'e arzedildik. (Durumumuz kontrol edildi.) Sonra avret yerinde tüy biten erkek (esirler) öldürüldü ve avret yerinde tüy bitmeyen oğlan (esirler) salıverildiler (yâni öldürülmediler). Ben de avret yerinde tüy bitmeyenlerin içinde idim. Bu nedenle salıverildim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2542,
			"arabicnumber": 2542,
			"text": "Atiyye el-Kurazî (r.a.)'den rivayet edildiğine göre şöyle demiştir: (Ey müslümanlar!) Bilmiş olun ki işte ben aranızdayım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2543,
			"arabicnumber": 2543,
			"text": "İbn-i Ömer (r.a.)'den (r.a.)'dan; Şöyle demiştir: Uhud (savaşı) günü ben on dört yaşında iken Resulullah (Sallallahu Aleyhi ve Sellem)'e arz edildim (Yâni durumum O'nun tarafından gözden geçirildi). O, bana icazet vermedi. (Yâni yaşça ergin değilim, diye savaşa katılmama izin vermedi.) Hendek (savaşı) günü de ben on beş yaşında iken O'na arz edildim. Bu defa bana izin verdi. Nafi demiştir ki: Ben bir kere bilafeti zamanında Ömer bin AbdiIaziz'e bu hadisi anlattım. Ömer bin Abdilaziz dedi ki: Bu on beş yaş küçük ile büyük arasında bir sınırdır (çocukluğun nihayeti ve erginliğin başlangıcıdır, dedi ve bütün illerdeki valilerine bir genelge göndererek on beş yaşına varan askerlere maaş bağlamalarını emretti)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2544,
			"arabicnumber": 2544,
			"text": "Ebû Hureyre (r.a.)'den rivâyeı edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim bir müslüman (kardeşinin aybın)ı örterse Allah da onutn aybmı) dünyada ve âhirette örter.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2545,
			"arabicnumber": 2545,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Had (cezây)ı defedebildiğiniz sürece (yâni suç sabit olmadıkça) defediniz.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde İbrahim bin el-Fadl el-Mahzumi bulunur. Bu raviyi Ahmed, İbn-i Main, Buhari ve başkaları zayıf saymışlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2546,
			"arabicnumber": 2546,
			"text": "İbn-i Abbas (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Srllem) şöyle buyurmuştur: «Kim müslüman kardeşinin avretini (yani ayıbını) örterse Allah da kıyamet günün onun ayıbını örter. Kim müslüman kardeşinin avretini açığa vurursa Allah da onu aybmdan dolayı evinin içinde bile rezil etmekle kusurunu meydana çıkarır.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Muhammed bin Osman bin Safvan el-Cümehi bulunur. Ebu Hatim bunun hadislerinin münker (bilinmeyen) ve zayıf olduğunu söylemiştir. Darekutni de: Bu ravi kuvvetli değildir, demiştir. İbn-i Hibban ise bunu sika raviler arasında anmıştır. Senedin kalan ravileri sika (güvenilir) ravilerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2547,
			"arabicnumber": 2547,
			"text": "Âişe (r.anha)'dan; Şöyle demiştir: Benî Mahzûm kabilesinden hırsızlık eden (Fâtıma isimli) kadının durumu Kureyş'i cidden üzdü, ızdıraba soktu. Bunun üzerine bunlar: Bu kadın hakkında kim Resulullah (Sallallahu Aleyhi ve Sellem) ile konuşabilir, diyorlardı. (Kendi aralarında böylece görüşdükten sonra) dediler ki: Resulullah (Sallallahu Aleyhi ve Sellem)'in mahbûbu (sevdiği) Usame bin Zeyd (r.a.)'dan başka kim bunu arz etmeye cesaret edebilir? (Sonra Kureyş, konuyu Usame ile görüşüp aracı olmasını istediler.) Usame de Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) ile konuştu. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Sen Allah'ın (koyduğu) hadlardan birisi (nin terkedil-mesi) hakkında mı aracı oluyorsun?» diyerek onu kınadı. Sonra kalktı ve (halka) yüksek sesle hitabede bulunarak: «Ey insanlar! Sizden öncekiler — İsrail oğulları — şöyle davrandıkları için helak oldular: Bunlar kuvvetli adam aralarında hırsızlık ettiği zaman onu bırakırlardı da zayıf adam aralarında hırsızlık ettiği zaman onun aleyhinde had (ceza) uygularlardı. Allah'a and olsun ki eğer Muhemmed'in kızı Fâtıma çalmış olsayds şüphesiz ben o'nun elini keserdim,» buyurdu. (Müellifin şeyhi) Muhammed bin Rumh dediki: Ben el-Leys bin Sa'd'dan; Allah (Azze ve Celîe) Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem)'in kızı Fâtıma'yı hırsızlık etmekten şüphesiz korumuştur, sözünü söylerken işittim. Her müslüman da bunu söylemelidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2548,
			"arabicnumber": 2548,
			"text": "Mes'ûd bin el-Esved (r.a.)'den; Şöyle demiştir: (Fâtıma isimli) kadın Resulullah (Sallallahu Aleyhi ve Sellem)'in evinden o kadifeyi çaldığı zaman biz bunu büyük (bir olay olarak) gördük. Bu, Kureyş'den bir kadın idi. Biz Nebi (Sallallahu Aleyhi ve Sellem)'in yanına gidip O'nunla konuştuk ve: Bu kadını kurtarmak için biz kırk okka fidye veririz, dedik. Resulullah (Sallallahu Aleyhi ve Sellem): «(Cezasını çekmekle) temizlenmesi onun için daha hayırlıdır,» buyurdu. Sonra biz Resulullah (Sallallahu Aleyhi ve Sellem)'in sözünün yumuşaklığını işitince (cesaretlendik ve) Usame'nin yanına gidip (ona): Resulullah (Sallallahu Aleyhi ve Sellem) ile sen konuş dedik. Resulullah (Sallallahu Aleyhi ve Sellem) bunu görünce bir hitabede bulunmak üzere ayağa kalktı ve: «Allah'ın cariyelerinden bir câriye üzerine vâcib olan Allah Azze ve Celle'nin cezalardan birisi (nin terk edilmesi) hakkındaki bu İsrarınız nedir? Muhammed'in nefsi elinde olan (Allah) a yemin ederim ki o kadının tenezzül ettiği şey (hırsızhğ)a Resulullah (Sallallahu Aleyhi ve Sellem)'in kızı Fâtıma tenezzül etmiş olsaydı şüphesiz Muhammed (Salîallahu Aleyhi ve Sellem) onun elini keserdi,» buyurdu. Not: Zevaid'de şöyle denilmiştir; Bunun senedinde Muhammed bin İshak bulunur. Bu ravi tedlisçidir (ve bunu an'ane ile rivayet etmiştir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2549,
			"arabicnumber": 2549,
			"text": "Ebu Hureyre, Zeyd bin Halid ve Şibl (r.anhum)'dan rivayet edildiğine göre (bu üç sahabî) şöyle demişlerdir: Biz Resulullah (Sallallahu Aleyhi ve Sellem)'in yanında idik. (Bedevilerden) bir adam (hasmı ile birlikte) geldi ve Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem)'e: (Ya Resûîallah), Allah'a yemin ederek Allah'ın kitabı ile aramızda hüküm etmeni diliyorum, (Benimle hasmın arasında sulh yoluyla değil de Allah'ın hükmü ile hüküm etmedikçe bu dileğimde ısrar edeceğim), dedi. Hasmı daha dirayetli ve edebli idi. O da: (Ya Resûîallah) aramızda Allah'ın kitabı ile hükmet ve bana izin ver ki (durumu) arzedeyim, dedi. Resul-i Ekrem (Sallallahu Aleyhi ve Seliem) de (buna hitaben): «Söyle», buyurdu. Bunun üzerine söz verilen hasım (yani ikinci kişi): Benim oğlum bunun yanında işçi idi ve bunun karısı ile zina etmiş. Bu nedenle ben (bu adama) yüz koyun ve bir hadim (cariye) vererek oğlumu kurtardım. Sonra ben ilim ehlinden birkaç adama sordum. (Henüz bekar olan) oğluma yüz değnek had (cezası) ve bir yıl sürgün, bu adamın karısına da recm'in gerektiği bana haber verildi, dedi. Bundan sonra Resulullah (Sallallahu Aleyhi ve Sellem): «Hayatım, elinde olan (Allah) a yemin ederim ki, şüphesiz ben, aranızda Allah'ın kitabı (yani hükmü) ile hükmedeceğim: Verdiğin yüz koyun ve hadim sana iade olunur. Oğluna da yüz değnek vurmak ve bir yıl sürgün gerekir» buyurdu. (Sonra sahabilerden Uneys'e de): «Ya Uneys bu (bedevi) nin karısına git. Eğer (isnad edilen suçu) itiraf ederse onu recmet», buyurdu. (Ravî Hişam demiştir ki: Sonra Uneys kadına gitti. Kadın da itiraf etti. Uneys de kadını recmetti)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2550,
			"arabicnumber": 2550,
			"text": "Ubâde bin es-Sâmit (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «(Zina cezasının hükmünü) benden alınız. Allah şüphesiz o (zina eden) kadınlar için bir yol açtı. Bekâr (erkeğin) bekâr (kadın) la (zina etmesi cezası) yüz değnek ve bir yıl sürgündür. Seyyib (sahîh nikâhla evlenip bir defa olsun eşiyle birleşen erkeğin) seyyib (kadın) la (zina etmesi cezası) yüz değnek ve recimdir.» Diğer tahric: Müslim, Ebu Davud, Tirmizi ve Nesai de rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2551,
			"arabicnumber": 2551,
			"text": "(Kufe emîri Na'man bin Beşîrin katibi) Habîb bin Sâlim'den rivayet edildiğine göre: Karısının cariyesi ile cinsel ilişkide bulunan bir adam Nu'man bin Beşîr (r.a.)'in huzuruna getirildi. Nu'man bin Beşîr (r.a.): Ben bu olay hakkında ancak Resulullah (Sallallahu Aleyhi ve Sellem)'in hükmü ile hükmedeceğim, diyerek şunu söyledi: Eğer kadın kendi cariyesini kocasına helâl etmiş ise, ben kocasına yüz değnek vurdururum. Şayet kadın kocasma (anılan temas için) izin vermemiş ise ben kocasını recmederim, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2552,
			"arabicnumber": 2552,
			"text": "Seleme bin el-Muhabbık (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem)'e, karısının câriyesiyle cinsel ilişkide bulunan bir adamın dâvası arzedildi. Resulullah (Sallallahu Aleyhi ve Sellem) adam'ı had (cezası) ile cezalandırmadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2553,
			"arabicnumber": 2553,
			"text": "İbn-i Abbas (r.a.)'den rivayet edildiğine göre: Ömer bin el-Hattâb (r.a.) (halîfe iken Medîne-i Münevvere'deki Mescid-i Nebevide bir Cuma hutbesinde) şöyle demiştir: (Ey müslümanlar) Şüphesiz ben şundan korkarım: Halkın üzerinden uzun bir zaman geçer de nihayet bir adam; Ben Allah'ın kitabında recmetme (hükmünü) bulmuyorum, der ve bu yüzden halk Allah'ın farizalarından birisini terketmekle dalâlete giderler. Bilmiş olun ki kişi muhsan (evlenmiş) olup beyyine (dört erkek şâhid), veya gebelik, ya da itiraf olduğu zaman şüphesiz recmetmek haktır. Şüphesiz ben recm âyetini okudum. Âyet şudur: «Şeyh ve Şeyha (yani muhsan erkek ve kadın) zina ettikleri zaman onları muhakkak recmediniz.» Resulullah (Sallallahu Aleyhi ve Sellem) recmetti ve O'ndan sonra da biz recmettik",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2554,
			"arabicnumber": 2554,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Mâiz bin Mâlik (el-Eslemî) Nebi (Sallallahu Aleyhi ve Sellem)'in yanına gelerek: (Yâ Resûlallah) ben şüphesiz zina ettim, dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) ondan yüz çevirdi. Sonra Mâiz (gene): Şüphesiz ben zina ettim, dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (yine) ondan yüz çevirdi. Daha sonra Mâiz (tekrar): Ben şüphesiz zina ettim, dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (tekrar) ondan yüz çevirdi. Sonra Mâiz: Ben zina ettim, dedi. Nebi (Sallallahu Aleyhi ve Sellem) (yine) ondan yüz çevirdi. Nihayet Mâiz dört defa ikrar edince Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) onun recmedümesini emretti. Sonra Mâiz taşlanınca, (dayanamayıp) geri kaçtı. Elinde bir deve çene kemiği bulunan bir adam (Abdullah bin Uneys) ona yetişip vurdu ve yere yığdı. (Böylece öldürüldü.) Taşların kendisine verdiği ızdıraba dayanamayıp kaçışı sonradan Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem)'e anlatılınca buyurdular ki: «Niçin onun peşini bırakmadınız» (belki itirafından dönüş yapardı. Allah da onun tevbesini kabul ederdi.»)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2555,
			"arabicnumber": 2555,
			"text": "İmrân bin Husayn (r.a.)'den rivayet edildiğine göre: Bir kadın Nebi (Sallallahu Aleyhi ve Selîem)'in huzuruna gelerek zina ettiğini itiraf etti. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) kadının üstündeki elbisenin onan üzerinde sıkıca bağlanmasını emretti. Sonra kadını recmettirdi. Daha sonra kadının cenazesi .üzerine namaz kıldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2556,
			"arabicnumber": 2556,
			"text": "İbn-i Ömer (r.a.)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve- Sellem) (zina eden) bir yahudi erkek ile bir yahudi kadın'ı recmettirdi. Ben onları recmedenlerdenim, (And olsun ki) ben, recmedilen erkeğin (atılan) taşlara karşı kendini recmedilen kadına siper ettiğini gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2557,
			"arabicnumber": 2557,
			"text": "Câbir bin Semure (r.a.)'den; Şöyle demiştir: Gerçekten Nebi (Sallallahu Aleyhi ve Sellem) (zina eden) bir yahudi erkeği ve bir yahudi kadını recmettirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2558,
			"arabicnumber": 2558,
			"text": "Berâ' bin Âzib (r.a.)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem), yüzü kömür ile karartılmış ve değnekle dövülmüş bir yahûdî erkeğin yanından geçti. Sonra yahûdîleri çağırtıp Conlara): «Siz kitabınız da zina edenin cezasını böyle (mi) buluyorsunuz?» buyurdu. Yahudiler: Evet, diye cevab verdiler. Bunun üzerine Resûl-i Ekrem (Aleyhi's-salatu ve's-selam) onların âlimlerinden (Abdullah bin Surya isimli) bir adamı çağırtıp: «Musa'ya Tevrat indiren Allah'a yemin ettirerek sana soruyorum. Siz (Tevrat'ta) zina edenin cezasını böyle mi buluyorsunuz?» buyurdu. Adam: Eğer bana böyle yemin ettirmen olmasaydı ben (gerçeği) sana bildirmezdim, biz kitabımız (Tevrat) da, zina edenin cezâsını recmetmek olarak buluyoruz. Lâkin eşrafımız arasında recim cezası çoğaldı. Bunun üzerine artık eşraf'tan olan kimseyi yakaladığımız zaman onu bırakıyorduk ve zayıf kimseyi yakaladığımız zaman onun hakkında recim cezâsını uyguluyorduk. Sonra biz Gelin eşraf'tan olana ve olmayana tatbik edeceğimiz bir ceza şekli üzerinde ittifak edelim, dedik. Sonra recim cezası yerine yüzü kömürle karartma ve değnekle dövme cezası üzerine ittifak ettik, dedi. Bundan sonra Nebi (Sallallahu Aleyhi ve Sellem): «Allahım, Yahudiler senin emrini öldürdükleri (uygulamadıkları) zamanda, senin emrini ilk ihya eden (uygulayan) benim,» buyurdu ve zâni yahûdînin recmedilmesine hükmetti de bu hüküm infaz edildi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2559,
			"arabicnumber": 2559,
			"text": "İbn-i Abbas (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «(Zina suçundan dolayı) herhangi bir kimseyi şâhidsiz (ve itirafsız) recmetmiş olsaydım falan kadını recmedecektim, Çünkü konuşma tarzından, vaziyetinden ve yanına girenlerden dolayı cidden kendisinden şüphe meydana gelmiştir.» Not: Bunun senedinin sahih ve ravilerinin sika olduğu, Zevaid'de belirtilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2560,
			"arabicnumber": 2560,
			"text": "Kasim bin Muhammed (bin Ebi Bekr-i Sıddık) (r.a.)'den; Şöyle demiştir: İbn-i Abbas (r.a.) lian işlemi usulünce lânetleşen karı-koca kıssasını anlattı. Bunun üzerine (Abdullah) bin Şeddâd (bin el-Hâd), İbn-i Abbâs'a; Hakkında, Resulullah (Sallallahu Aleyhi ve Sellem)'in: «(Zina suçundan dolayı) her hangi bir kimseyi şâhidsiz (ve itirafsız) recmetmiş olsaydım bu kadını recmedecektim» buyurduğu kadm o (anlattığın kadm mı) dır? diye sordu. İbn-i Abbâs: (Hayır). Rivayet ettiğin hadîste sözü edilen kadm, (kötülük belirtilerini) açığa vuran bir kadındır. Not: Bu hadis Buhari, Müslim ve başka hadis kitablarında da vardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2561,
			"arabicnumber": 2561,
			"text": "İbn-i Abbas (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kimin Lût kavminin amelini işlediğini bilirseniz, bu (çirkin) fiili işleyeni de kendisi ile bu fiil işleneni de öldürünüz.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2562,
			"arabicnumber": 2562,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) Lût kavminin amelini işleyen kimse hakkında: «Üsttekini ve alttakini recmediniz. Her ikisini de recmediniz» buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2563,
			"arabicnumber": 2563,
			"text": "Câbir bin Abdillah (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ümmetim için en çok korktuğum şeyüerden birisi) Lût kavminin ameli (ni işlemesi) dir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2564,
			"arabicnumber": 2564,
			"text": "İbn-i Abbas (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Mahremi olan kadınla zina edeni katlediniz. Bir hayvanla cinsel ilişkide bulunan kimseyi de katlediniz ve o hayvanı da öldürünüz.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2565,
			"arabicnumber": 2565,
			"text": "Ebu Hureyre, Zeyd bin Hâlid ve Şibl (r.anhum)'dan rivayet edildiğine göre şöyle demişlerdir: Biz, Nebi (Sallallahu Aleyhi ve Sellem)'in yanında idik. Bir adam, O'na evlenmeden önce zina eden cariye'nin (had edilip edilmemesi) hükmünü sordu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «(Zina ettiği sabit ise) cariyeyi (elli değnekle) döv. Sonra (tekrar) zina ederse (gene elli değnekle) döv» buyurdu. Sonra Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (ya) üçüncü defasında veya dördüncüsünde: «Câriye tekrar zina ederse artık (aybını beyân ederek) onu kıldan (mamul) bir ip (değeri) ile de olsa sat,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2566,
			"arabicnumber": 2566,
			"text": "Âişe (r.anha)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Câriye zina ettiği zaman onu (elli değnekle) dövünüz. Eğer (yine) zina ederse yine onu (elli değnekle) dövünüz. Sonra (tekrar) zina ederse (yine) onu (elli değnekle) dövünüz. Sonra (yine) zina ederse (tekrar) onu (elli değnekle) dövünüz. Sonra (aybını beyân ederek) bükülmüş bir ipe de olsa satınız.» Dafir, (bükülmüş) ip anlamınadır. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Ammar bin Ebi Ferve bulunur. Buhari ve başkasının dediği gibi bu ravi zayıftır. Fakat İbn-i Hibban onu sika (güvenilir) zatlar arasında anmıştır",
			"grades": [
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2567,
			"arabicnumber": 2567,
			"text": "Aişe (r.anha)'dan: (İtham edildiğim suçtan) beraatime (masumiyetime) dâir âyetler inince Resulullah (Sallallahu Aleyhi ve Sellem) minber üzerinde ayağa kalkarak masumiyetimi anlattı ve (inen) Kur'ân (âyetlerin) i okudu. Minberden inince (beni itham eden) iki erkeğin ve bir kadın'ın hadd edilmelerini (cezalandırılmalarını) emretti. Bunlar (kâzif) haddi olarak dövüldüler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2568,
			"arabicnumber": 2568,
			"text": "İbn-i Abbas (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Bir adam bir adama yâ muhannes dediği zaman o (diyen) adamı yirmi (kırbaçla) dövünüz. Ve bir adam bir adama yâ lûtî (livâtacı) dediği zaman o (diyen) adamı yirmi (kırbaçla) dövünüz.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2569,
			"arabicnumber": 2569,
			"text": "Ali bin Ebî Tâlib (r.a.)'den; Şöyle demiştir: Hadd (cezası) nı infaz ettiğim (ve bu cezadan dolayı ölen) hiç kimsenin diyetini vermiş değilim. Ancak şarap içen kimsenin diyetini öderim. Çünkü Resulullah (Sallallahu Aleyhi ve Sellem) şarap içen hakkında (sayısı sınırlı) bir had koymamıştır. O (şarap içene belirli bir sayı ile vurduğumuz) had bizim kendimizin (ictihadla) koyduğumuz bir cezadır.\" EBU DAVUD HADİSLERİ VE İZAHLARI 4481 — 4486",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2570,
			"arabicnumber": 2570,
			"text": "Enes bin Mâlik (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) şarap içme (cezasın) da (suçluyu) ayakkabılarla ve yapraklarından soyulmuş hurma dallarıyla (kırk darbe) vurmayı emrederdi. EBU DAVUD HADİSİ TIKLA",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2571,
			"arabicnumber": 2571,
			"text": "Hudayn bin el-Münzir er-Rakkaşî (r.a.)'den Şöyle demiştir: El-Velîd bin Ukbe, (halîfe) Osman (bin Affân) (r.a.)'in huzuruna getirilerek, (şarab içtiğine dâir) şâhidler onun aleyhinde ifâde verince, Osman, Ali (r.a.)'a: Amcan oğlunu (yâni el-Velîd'i) al da onun hakkında (şarab içme) cezasını infaz et, dedi. Ali de onu dövdürdü ve dedi ki: (Şarab içene) Resulullah (Sallallahu Aleyhi ve Sellem) kırk dayak attı, Ebû Bekir kırk dayak attı ve Ömer seksen dayak attı. Kırk dayak da seksen dayak da sünnettır. EBU DAVUD HADİSİ TIKLA",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2572,
			"arabicnumber": 2572,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kişi sarhoş olduğu zaman ona dayak atınız. Eğer tekrar sarhoş olursa (gene) ona dayak atmız. Sonra tekrar sarhoş olursa (tekrar) dayağa çekiniz» Resûl-i Ekrem (Sallallahu Aleyhi ve Seîlem) dördüncü defasında buyurdu ki: «Sonra sarhoşluğa dönüş yaparsa boynunu vurunuz.» EBU DAVUD HADİSLERİ VE İZAH: 4483 — 4484 — 4485",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2573,
			"arabicnumber": 2573,
			"text": "Muâviye bin Ebî Süfyân (r.a.)'dan rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kişiler şarab içtikleri zaman onlara dayak atınız. Sonra içtikleri zaman (tekrar) onlara dayak a&mız. Sonra içtiklerinde (gene) onlara dayak atınız. Bundan sonra (şarab) içtikleri zaman artık onları öldürünüz.» EBU DAVUD HADİSİ TIKLA",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2574,
			"arabicnumber": 2574,
			"text": "Saîd bin Sa'd bin Ubâde (r.a.)'dm; Şöyle demiştir: Evlerimiz arasında vücût yapısı noksan ve zayıf bir adam vardı. (Bir defa) binanın cariyelerinden birisiyle kötü vaziyette aniden yakalandı. Bunun üzerine (babam) Sa'd bin Ubâde onun durumunu Resulullah (Sallallahu Aleyhi ve Sellem)'e arz etti. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Ona yüz sopa atınız.» buyurdu. Sahâbîler: Ey Allah'ın nebisi adam bu dayağa dayanamıyacak derecede çok zayıftır, ona yüz sopa atmış olsaydık ölecekti, dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «O halde onun için yüz salkımlı bir hurma dalını alınız ve onu (o dal ile) bir defa dövünüz.» buyurdu. Bu hadîsin benzeri Ebû Ümâme bin Sehl tarafından doğrudan doğruya (yâni Saîd bin Sa'd'ın aracılığı olmaksızın) Sa'd bin Ubâde'den merfû olarak ve kısmen değişik bir sened ile de müellifimize intikal etmiştir. Not: Zevaid'de şöyle denilmiştir: Bu senedin kuvvet durumu ravi Muhammed bin İshak'ın haline bağlıdır. Bu ravi tedlisçidir ve bunu an'aneyIe rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2575,
			"arabicnumber": 2575,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kim biz (mu'minler)e silâh çekerse artık o bizden değildir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2576,
			"arabicnumber": 2576,
			"text": "“... (Abdullah) bin Ömer (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: biz (mü'minler) e silâh çekerse artık o bizden değildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2577,
			"arabicnumber": 2577,
			"text": "İbn-i Ömer (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim biz (mu'minler) e silâh çekerse artık o bizden değildir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2578,
			"arabicnumber": 2578,
			"text": "Enes bin Mâlik (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken Ureyne (kabilesin) den bâzı kimseler Medîne-i Münevvere'ye geldiler. Sonra Medîne (nin su ve havası onlara dokunduğu için bu şehir) de kalmak istemediler. Bunun üzerine Resûl-î Ekrem (Sallallahu Aleyhi ve Sellem) onlara: «Bize âit bir deve sürüsünün bulunduğu (Gâbe denilen) yere gidip develerin sütlerinden ve idrarlarından içiniz», buyurdu. Onlar da (böyle) yaptılar. (Bu vahşîler sıhhat bulunca) İslâmiyet'ten (küfre) döndüler ve Resulullah (Sallallahu Aleyhi ve Sellem)'in (Yesâr isimli) çobanını öldürüp develerini de önlerine katıp götürdüler. (Bundan haberdar olunca) Resulullah (Sallallahu Aleyhi ve Sellem) onları yakalamak için (bir fırka) gönderdi. Onlar yakalanıp huzura getirildi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) onların ellerini ve ayaklarını kestirdi, ateşte kızdırılmış çivilerle gözlerini sürmeletti ve ölünceye kadar onları Harre (denilen yer) de bıraktırdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2579,
			"arabicnumber": 2579,
			"text": "Aişe (r.anha)'dan; Şöyle demiştir: Bir güruh insan Resulullah (Sallallahu Aleyhi ve Sellem) ıin sağım develerine baskın yapıp kaçırdılar. Sonra Nebi (Sallallahu Aleyhi ve Sellem) (yakalattığı bu vahşî) topluluğun ellerini ve ayaklarını kestirdi ve gözlerini oydurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2580,
			"arabicnumber": 2580,
			"text": "Saîd bin Zeyd bin Amr bin Nufeyl (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Seİlem): «Malı(nı koruma) uğrunda öldürülen kimse şehîddir» buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2581,
			"arabicnumber": 2581,
			"text": "İbn-i Ömer (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim ki malının yanına gidilip (gasbedilmesi için) kendisiyle savaşılır, kendisi de (malını korumak için) savaşır ve öldürülürse o kimse şehîddir.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde bulunan Yezid bm Simin et-Temimi Ebu Rehavi'nin zayıflığı Ahmed ve başkası tarafından ifade edilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2582,
			"arabicnumber": 2582,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine güre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kimin malı zulüm yoluyla (elinden) alınmak istenip de (bu uğurda) Öldürülürse o kimse şehîddir.» Not: Zevaid'de şöyle denilmiştir: Bu, hasen bir seneddir. Çünkü derecesi hafız ve itkanlı ravilerin derecesinden aşağıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2583,
			"arabicnumber": 2583,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Allah hırsıza la'net etsin. O yumurta çalar da eli kesilir, bir ip çalar de eli kesilir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2584,
			"arabicnumber": 2584,
			"text": "İbn-i Ömer (r.a.)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) üç dirhem değerindeki bir kalkanda hırsızın elini kestirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2585,
			"arabicnumber": 2585,
			"text": "Âişe (r.anha)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Hırsızın eli ancak dinarın dörtte biri ve daha fazlada kesilir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2586,
			"arabicnumber": 2586,
			"text": "Âmir bin Sa'd'ın babası (Sa'd bin Ebî Vakkas (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) $öyle buyurmuştur: «(Üç dirhemlik) kalkan değerinde hırsızın eli kesilir.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Ebu Vakıd bulunur. Bu ravi zayıftır. Bunun zayıflığını belirten, bir kişi değildir. Bu hadisin aslı Buhari, Müs!im ve diğer hadis kitaplarında Aişe, Ebu Hureyre ve İbn-i Ömer (r.a.) hadisi olarak. rivayet edilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2587,
			"arabicnumber": 2587,
			"text": "(Abdurrahman) bin Muhayrîz'den Şöyle demiştir: Hırsızın elini (kestirdikten sonra) boynuna takmanın hükmünü Fadâla bin Ubeyd (el-Ensârî) (r.a.)'a sordum. Fadâla: Sünnettir, Resulullah (Sallallahu Aleyhi ve Sellem) (hırsızlık eden) bir adamın elini kestirdi sonra adamın boynuna taktırdı, diye cevap verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2588,
			"arabicnumber": 2588,
			"text": "Sa'lebe el-Ensârî (r.a.)'den; Şöyle demiştir: Amr bin Semure bin Habîb bin Abd-i Şems (r.a.), Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına gelerek: Yâ Resûlallah! Falanın oğullarına ait bir deveyi çaldım. (Cezamı vermekle) beni (günahtan) temizle, dedi. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) (Amr'ın dediği) kabileye adam göndererek soruşturdu. Adamlar: Gerçekten bir devemizi bulamadık, dediler. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem)'in emriyle Amr'in eli kesildi. Sa'lebe demiştir ki: Amr'ın eli (kesilip) yere düştüğü zaman ben ona bakıyordum, kendisi şöyle söylüyordu: (Ey hırsızlık eden el) Beni senden temizleyen Allah'a hamd olsun. Sen cesedimi cehennem ateşine sokmak istedin",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2589,
			"arabicnumber": 2589,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Köle hırsızlık ettiği zaman onu neşş (yirmi dirhem, yâni yarı fiyatla) da olsa satınız.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2590,
			"arabicnumber": 2590,
			"text": "İbn-i Abbas (r.a.)'den; Şöyle demiştir: Ganimet malının humus (beşte bir) hissesinden olan kölelerden biri, humus malından bir şey çaldı. Durum Nebi (Sallallahu Aleyhi ve Sellem)'e arz edildi. Nebi (Sallallahu Aleyhi ve Selîem) onun elini kestirmedi ve: «Allah Azze ve Celle'nin malıdır, bâzısı bâzısını çalmıştır,» buyurdu. Not: Bunun senedinde bulunan Cübare'nin zayıflığı Zevaid'de belirtilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2591,
			"arabicnumber": 2591,
			"text": "Câbir bin Abdİllah (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Ne hâin (kendisine mal emânet edilen) in, ne müntehib (malı gasbeden)'in ne de muhtelis (el çabukluğuyla, hissettirmeden mal aşıran) in eli kesilir.» (Yâni bunlardan hiçbirisinin eli kesilmez)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2592,
			"arabicnumber": 2592,
			"text": "Abdurrahman bin Avf (r.a.h)'den; Şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'den işittim, buyurdu ki: «Muhtelis (el çabukluğuyla, hissettirmeden mal aşıran) kimseye el kesme (cezası) yoktur.» Not: Bunun ravilerinin sika oldukları, Zevaid'de belirtilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2593,
			"arabicnumber": 2593,
			"text": "Râfi' bin Hadîc.(r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ne ağacı üzerindeki meyveyi ne de keser (denilen hurma göbeğini çalması hâlin) de hırsızın elini kesmek yoktur.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2594,
			"arabicnumber": 2594,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ne ağacı üzerindeki meyveyi ne de keser (denilen hurma göbeğini çalması hâlin) de hırsızın elini kesmek yoktur.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde bulunan Abdullah bin Said el•Makbüri zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2595,
			"arabicnumber": 2595,
			"text": "Safvân (bin Ümeyye) (r.a.)'den rivayet edildiğine gnre: Bir kere: Kendisi Mescid-i Nebevî'de ridâsım başına yastık edip uyumuş ve ridâsı başının altından alınmış. Sonra Safvân hırsızını yakalayıp Nebi (Sallallahu Aleyhi ve Sellem)'e götürmüş. Nebi (Sallallahu Aleyhi ve Sellenı) de (suçu subut bulan) hırsızın elinin kesilmesini emretmiştir. Bunun üzerine Safvân: Yâ Resulallah! Ben bunu (yâni elinin kesilmesini) istemedim. Ridâm ona sadaka olsun, deyince Resulullah (Sallallahu Aleyhi ve Sellem) Safvân'a: «Adamı bana getirmeden önce (bu işi) yapmalıydın» buyurdu (ve hırsızın elini kestirdi). EBU DAVUD RİVAYETİ VE İZAH İÇİN BURAYA TIKLAYIN",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2596,
			"arabicnumber": 2596,
			"text": "Amr bin Şuayb'ın dedesi (Abdullah bin Amr r.a.)'den rivayet edildiğine göre: Müzeyne'den bir adam meyveler (i çalmanın) hükmünü Nebi (Sallallahu Aleyhi ve Sellem)'e sordu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «(Ağacı üzerinde ve) kapçıkları içinde iken alınıp götürülen meyvelerin değeri ve bununla beraber bir katı (hırsıza ödettirilir.) Harmandan olan meyve kalkan pahâsına ulaşınca bu değerdeki meyveyi çalmak da hırsızın elini kesmek vardır. Kişi meyveden yer ve (bundan bir şey) alıp götürmezse ona bir şey lâzım gelmez.» buyurdu. Adam: Harise (yâni meradan çalman) koyun (hakkında ne buyurursun) Yâ Resulallah? diye sordu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Koyunun pahası, bununla beraber pahasının bir katı ve ceza (yâni tazir cezası) var. Ağılda olan (koyunu çalmak) ta da hırsızın aldığı koyunun değeri kalkanın pahası kadar olunca el kesme cezası vardır.» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2597,
			"arabicnumber": 2597,
			"text": "Ebu Ümeyye (r.a.)'den rivayet edildiğine göre: Hırsız Resulullah (Sallallahu Aleyhi ve Sellem)'in huzuruna getirildi. Hırsız suçunu sıhhatli bir şekilde itiraf etti. Fakat çalman eşya onun beraberinde, yanında bulunmamıştı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) (kendisine hitaben): «Senin çaldığını zannetmiyorum», buyurdu. Hırsız: — Bilâkis (ben çaldım), dedi. Sonra Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (tekrar): «Senin çaldığını sanmıyorum.» buyurdu. Hırsız. Bilâkis (ben çaldım), dedi. Bunun üzerine Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem)'in emriyle onun eli kesildi. Sonra Nebi (Sallallahu Aleyhi ve Seîlem) (hırsıza): De ki; — «Ben Allah'tan mağfiret dilerim ve Ona dönüş yaparım» buyurdu. Hırsız: أَسْتَغْفِرُ اللهَ وَأَتُوبَ إِلِيْهِ. [estağfirullahe ve etube ileyhi]dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) de iki kez: «Allahım onun tevbesini kabul eyle» diye duâ etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2598,
			"arabicnumber": 2598,
			"text": "Vâil (bin Hucr el-Hadramî) (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken bir kadın (zinaya) zorlandı. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) had cezasını kadından defetti ve kadın'la zina eden adama had cezasını verdi. Râvî, Nebi (Sallallahu Aleyhi ve Sellem)'in kadına bir mehir (hakkını) kıldığını anlatmadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2599,
			"arabicnumber": 2599,
			"text": "İbn-i Abbas (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Had cezaları mescidlerde infaz edilmez.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2600,
			"arabicnumber": 2600,
			"text": "Amr bin Şuayb'm dedesi (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) had cezasını mescidlerde infaz etmeyi yasaklamıştır. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde bulunan İbn-i Lehia zayıf ve tedlisçidir. Muhammed bin Aclan da tedIisçidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2601,
			"arabicnumber": 2601,
			"text": "Ebû Bürde bin Nîyâr (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyururdu: «Allah'ın (koyduğu) had cezalarından başka hiç bir cezada, kimseye on değnekten fazla vurulamaz.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2602,
			"arabicnumber": 2602,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «On kamçıdan fazla te'zîr cezası vermeyiniz.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Abbad bin Kesir bulunur. Ahmed bin Hanbel: Bu ravi, işitmediği yalan hadisler rivayet etmiştir, der. Buhari de: Alimler bu raviyi terketmişler, demiştir. Bunlardan başka zatlar da bu ravi hakkında böyle konuşmuşlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2603,
			"arabicnumber": 2603,
			"text": "Ubâde bin es-Sâmıt (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Sîzden herhangi birisinin (işlediği suçtan dolayı) başına had gelmekle cezasını dünyada çekerse o ceza onun (günahının) kefaretidir. Şayet (işlediği suçun) cezâsını dünyada çekmezse artık (âhirette) onun işi Allah'a kalır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2604,
			"arabicnumber": 2604,
			"text": "Ali (bin Ebî Tâlib) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim dünyada (küfürden başka) bir günah işler de (had veya ta'zîr) cezası infaz edilirse Allah, kuluna azabını çiftleştirmekten çok daha âdildir. (Yâni âhirette ikinci kez ona azab etmez.) Ve kim dünyada bir günah işler de Allah onun o günahını (insanların gözlerinden) örterse Allah bağışladığı bir şey (den dolayı cezalandırmayla dönüş yapmaktan pak, çok kerem ve afıv sahibidir.»)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2605,
			"arabicnumber": 2605,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Sa'd bin Ubâde (bin Deylem) el-Ensârî (r.a.): Yâ Resulallah! Adam karısının yanında (yabancı) bir erkek bulur, onu öldürebilir mi? diye sordu. Resulullah (Sallallahu Aleyhi ve Sellem): «Hayır» buyurdu. Sa'd: Sana Hak dini ikram eden Allah'a and olsun ki (adam kıskançlığı dolayısıyla) bilâkis öldürür, dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) (orada bulunanlara hitaben): «Büyüğünüz (olan Sa'd) ın söylediği sözü işitiniz,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2606,
			"arabicnumber": 2606,
			"text": "Seleme bin el-Muhabbık (r.a.)'den; Şöyle demiştir: Had cezaları âyeti inince kıskanç bir adam olan Ebû Sabit Sa'd bin Ubâde'ye: Söyle bakalım, sen karının beraberinde (yabancı) bir erkek bulmuş olursan ne yapmış olursun? diye soruldu. Sa'd: Ben karımı ve erkeği kılıçla vurup tepelemiş olurum. Ben gidip dört erkek şahidi getirinceye kadar bekler (miy)im? O zamana kadar adam işini bitirip gider. Veya: Ben (karım ile falan erkeği zina hâlinde) şöyle böyle gördüm, diyeceğim. Siz de kazif cezası olarak beni (seksen değnek) döveceksiniz ve ebedî olarak hiç bir şâhidliğimi kabul etmiyeceksiniz. diye cevap verdi. Râvî demiştir ki: Bu konuşma, Nebi (Sallallahu Aleyhi ve Sellem)'e anlatıldı. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): «Şâhid olarak kılıç kâfidir» buyurdu. Daha sonra: «Hayır. Sarhoşun ve kıskancın bu işte biribirini takip etmelerinden korkarım.» buyurdu. Ebû Abdillah, yâni İbn-i Mâce dedi ki: Ben Ebû Zur'a'yi şöyle söylerken işittim: Bu, Ali bin Muhammed et-Tanâfisî'nin hadîsidir. Ben bu hadîsi kendisinden dinlemeyi kaçırdım. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Kabisa bin Hureys bin Kabisa bulunur. Buhari: Bu ravinin hadisi üzerinde düşünmek gerekir, demiştir. İbn-i Hibban ise onu sikalar arasında anmıştır. Senedin kalan ravileri sika zatlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2607,
			"arabicnumber": 2607,
			"text": "Berâ bin Â'zib (r.a.)'den: Şöyle demiştir: Dayım (râvî Hüşeym kendi rivayetinde onun isminin el-Haris bin Amr olduğunu belirtmiştir.) bana uğradı. (Bu seferinde) ona Nebi (Sallailahu Aleyhi ve Sellem) bir sancak tahsis etmiş idi. Ben dayıma: Nereye gitmek istiyorsun? diye (yolculuğunun nedenini) sordum. Dayım şöyle dedi: Resulullah (Sallallahu Aleyhi ve Sellem) beni babasın (ın ölümün) den sonra onun karısıyla (yâni üvey anasıyla) evlenen bir adama gönderdi ve onun boynunu (kılıçla) vurmamı emretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2608,
			"arabicnumber": 2608,
			"text": "Kurre( bin Eyâs bin Hilâl) (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) beni, babasının (ölümünden sonra) karısıyla evlenen bir adamın boynunu vurmak ve malmı müsadere etmek üzere ona gönderdi. Not: Bunun senedinin sahih olduğu, Zevaid'de belirtilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2609,
			"arabicnumber": 2609,
			"text": "İbn-i Abbas (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim babasından başkasına intisap eder (yâni onun evlâdı olduğunu iddia eder) ise veya kendisini âzadlayan kimselerden başkasının âz adlısı olduğunu söylerse Allah'ın, meleklerin ve bütün insanların la'neti onun üzerine olsun (veya onun üzerindedir.)» Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedinde İbn-i Ebi Dayf bulunur. Bu ravinin sikalığı veya zayıflığı konusunda kimsenin bir sözüne rastlamadım. Senedin kalan ravileri Müslim'in şartı üzerinedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2610,
			"arabicnumber": 2610,
			"text": "Ebû Osman en-Nehdi (r.a.)'den: Şöyle demiştir: Ben Sa'd (bin Ebî Vakkas) ve Ebû Bekre (Nüfey' bin el-Hars bin Kelede) (r.a.)'dan (ayrı ayrı) işittim. Her biri şöyle dedi: Muhammed (Sallallahu Aleyhi ve Sellem): «Her kim babasından başkasına — babası olmadığını bile bile — neseb iddia ederse (yâni onun evlâdı olduğunu iddia ederse) o kimseye cennet haramdır (yasaktır).»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2611,
			"arabicnumber": 2611,
			"text": "Abdullah bin Amr (bin el-As) (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim babasından başkasına neseb iddia ederse o kimse cennet kokusunu almayacaktır. Halbuki cennet kokusu beşyüz senelik mesafede şüphesiz bulunur.» Not; Zevâid'de şöyle denilmiştir: Bunun senedi sahihtir. Çünkü Muhammed bin Sabbâh isimli râvî Ebû Cafer el-Cürcâni eî-Tâcir'dir. Onun hakkında îbn-s Muin : Onun rivayetinde bir beis yoktur, demiş ve Ebû Hatim de : Onun rivayeti işe yarar, demiştir. Senedin kalan râvileri meşhur zâtlar olduğu için durumlarım soruşturmaya gerek yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sanad Malool"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2612,
			"arabicnumber": 2612,
			"text": "El-Eş'as bin Kays (r.a.)'den; Şöyle demiştir: Ben kendi elçileri içinde Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına vardım. Elçiler beni kendilerinden üstün görürlerdi. Ben: Yâ Resulallah! Siz bizden değil misiniz? dedim. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): Biz en-Nadır bin Kinâne oğullarıyız. Biz anamızı iffetsizlikle itham etmeyiz ve babalarımıza nisbetimizi red etmeyiz (veya biz babalarımızın sülâlesine intisab etmeyi bırakıp analarımızın sülâlesine intisab etmeyiz), buyurdu.» Râvi demiştir ki: Bundan sonra el-Eş'as bin Kays şöyle derdi: Kureyş kabilesinden her hangi bir adamın en-Nadr bin Kinâne (sülâlesin) den olmadığını iddia eden kim bana getirilirse onu (kazif cezası olarak) had ederim. Not: Zevaid'de şöyle denilmiştir: Bu, sahih bir seneddir, ravileri sika zatlardır. Çünkü Akil bin Talha'yı İbn-i Main ve Nesai sika saymışlardır. İbn-i Hibban da onu sıkalar arasında anmıştır. Senedin kalan ravileri de Müslim'in şartı üzerinedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2613,
			"arabicnumber": 2613,
			"text": "Safvân bin Ümeyye (bin Halef) (r.a.)'den: Şöyle demiştir: (Bir kere) biz Resulullah (Sallallahu Aleyhi ve Sellem)'in yanında idik. (Bu arada) Amr bin Mürre geldi ve: Yâ Resûlallah! Allah şüphesiz benim kaderimde musibet yazmıştır. Çünkü ben elimle tef çalmaktan başka hiç bir yolla rızıkIanmamı sanmıyorum. Bu nedenle hayâsızlık durumu olmaksızın şarkıcılık etmem için bana izin ver, dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) (ona): «Sana izin vermem, (sana) ikram yok ve hoşnutluk da yoktur. Yalan söyledin, ey Allah'ın düşmanı Allah şüphesiz sana helâl ve güzel rızık edilme imkânını vermiştir. Ama sen Allah Azze ve Celle'nin sana helâl kıldığı, rızık yerine Allah'ın sana haram kıldığı rızkı tercih ettin. Eğer bu yasaklama hükmünü daha önce sana iletmiş olsaydım şimdi sana (hak ettiğin) cezayı verirdim. Kalk benim yanımdan ve Allah'a tevbe et. Bilmiş ol ki, bu yasağı duyduktan sonra (bu işi) yaparsan seni fena bir şekilde dövdüreceğim, ibret olarak senin başını (usturayla) traş ettireceğim, seni aile ferdlerinden uzaklaştırıp sürgün edeceğim ve senin (yağmaladığın malını) ganimet olarak Medine gençlerine helâl kılacağım» buyurdu. Râvî demiştir ki: Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem)in bu buyruğundan sonra Amr (bin Mürre) öyle kötü ve rezil bir durumda kalktı ki bunun derecesini ancak Allah bilir. Amr defolup gidince Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: «Bunlar âsilerdir. Bunlardan kim tevbe etmeden ölürse Allah Azze ve Celle onu kıyamet günü dünyada olduğu gibi muhannes, çıplak ve insanlara karşı bir ince yaprakla olsun örtünmez vaziyette haşredeçektir, ayağa kalktıkça yere yıkılacaktır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2614,
			"arabicnumber": 2614,
			"text": "Ümmü Seleme (r.a.)'dan rivayet edildiğine göre: (Tâif'in muhasarası esnasında) Nebi (Sallallahu Aleyhi ve Sellem) onun yanına girdi. O esnada —Ümmü Seleme'nin kardeşi Abdullah bin Ebî Ümeyye ve kölesi muhannes orda idiler. — Muhannes'in Abdullah bin Ebî Ümeyye'ye şöyle söylediğini işitti. Eğer Allah yarın Tâif'in fethini nasîb etse sana öyle (genç) bir kadın göstereceğim (yâni senin için yakalıyacağım) ki dört büklümle karşılar ve sekiz büklümle arkaya döner. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): «(Ey mü'minler) bu (muhannes) herifleri evlerinizden çıkarınız.» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 82
			}
		}
	]
}