{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"21": "The Chapters on Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2615,
			"arabicnumber": 2615,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2616,
			"arabicnumber": 2616,
			"text": "Abdullah (bin Mes'ûd) (radıyallahü anh)’den rivâyet edildiğine göre: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: günü insanlar arasında verilen ilk hüküm kan dâvaları hakkındadır. ) \". . . Abdullah (bin Mes'ûd) (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : ile öldürülen her insanın kamdım günahı)ndan bir pay Âdem (Peygamber)'in ilk oğlu (Kabil hesabı) na olur. Çünkü adam öldürme çığırını ilk açan odur. (Kardeşi Hâbil'i öldürdü)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2617,
			"arabicnumber": 2617,
			"text": "Abdullah (bin Mes'ûd) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kıyamet günü insanlar arasında verilen ilk hüküm kan dâvâları hakkındadır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2618,
			"arabicnumber": 2618,
			"text": "Ukbe bin Âmir ei-Cühenî (r.a.)'den rivayeti edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim Allah'a ortak koşmayarak ve haram bir kana bulaşmamış olarak O'na kavuşursa (Yâni bu durumda ölürse) cennete girecektir.» Not: Zevaid'de şöyle denilmiştir: Ravi Abdurrahman bin Aiz el-Ezdi, Ukbe bin Amir (r.a.)'den hadis işitmiş ise bu hadisin senedi sahihtir. Çünkü Abdurrahman'm Ukbe'den olan rivayetinin mürselolduğu söylenmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2619,
			"arabicnumber": 2619,
			"text": "el-Berâ bin Âzib (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Şüphesin dünyanın yok olması Allah katında, haksız yere bir mu'mini öldürmekten daha ehvendir.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahih ve ravileri sika zatlardır. Ravi el-Velid, bu hadisi Mervan'dan işittiğini belirttiği için tedlis etme şüphesi gitmiştir. Müellifimizden başkası da bu hadisi el-Bera (r.a.)'den başka sahabiden rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2620,
			"arabicnumber": 2620,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim bir mu'min'i öldürmeye yarım kelime ile (olsun) yardım ederse alnında \"Allah'ın rahmetinden ümitsizdir.\" ibaresi yazılı olduğu halde o kimse Allah Azze ve Celle'nin huzuruna çıkacaktır.» Not: Zevaid'de şöyle denilmiştir; Bunun senedinde bulunan Yezid bin Ebi Ziyad'ın zayıflığı hakkında çok söylemişlerdir, Hatta bu, mevzü bir hadise benzer, denilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2621,
			"arabicnumber": 2621,
			"text": "Salim bin Ebi'l-Ca'd (r.a.)'den; Şöyle demiştir: Bir mu'mini kasden öldürüp, sonra tevbe ederek îman eden, iyi amel işleyen, sonra hidâyet yolu üzerinde duran kimsenin hükmü (Abdullah) bin Abbâs (r.a.)'a sorulmuştur. İbn-i Abbas: Ona yazıklar olsun, nerde onun için hidâyet? Ben sizin Peygamberiniz (Sallallahu Aleyhi ve Sellem)'den: «Kıyamet günü katil, maktul onu yakalayıp kafasından tuttuğu halde (Allah'ın huzuruna) gelir ve maktul: (Yâ) Rabbi buna sor, niçin beni öldürdü, diyecektir,» -hadîsini işittim. Allah'a yemin ederim Allah Azze ve Celle Peygamber (Sallallahu Aleyhi ve Sellem)'inize (katilin ebedi cehennemlik olduğuna dâir) âyeti indirdi ve bu âyeti indirdikten sonra (hükmünü) neshetmedi, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2622,
			"arabicnumber": 2622,
			"text": "Ebû Saîd-i Hudrî (r.a.)'den; Şöyle demiştir: (Ey mu'minler) dikkat ediniz Resulullah (Sallallahu Aleyhi ve Sellem)'in (mübârek) ağzından işittiğim (şu) şeyi size haber vereceğim hadîsi kulaklarım işitti ve kalbim hıfzetti: «(îsrâil oğullarından) bir adam doksan dokuz insan öldürdükten sonra tevbe etmek istedi. Yer yüzünün en bilgin adamını soruşturdu. Bunun üzerine kendisine (rahip) bir kimse gösterildi. O da kalkıp ona gitti ve: Ben doksan dokuz insan öldürdüm. Acaba benim için tevbe-(den yararlanma ihtimâli) var mı? diye sordu. (Râhib) adam: Doksan dokuz insan (ın katlin) den sonra (mı? ), diye cevâb verdi. Râvi demiştir ki, katil (bu olumsuz cevap üzerine) kılıcını kınından çekip rahibi (de) öldürdü ve böylece öldürdüğü insan sayısını bununla yüze çıkardı. Sonra (yine) tevbe etme arzusu belirdi. Bunun üzerine yer yüzünün en bilgin adamını soruşturdu. Kendisine bir (âlim) adam gösterildi. (Bu kere) ona giderek; Ben yüz insan öldürdüm, acaba benim için tevbe (den istifâde etmem ihtimâli) var mı? diye sordu. Adam: Yazıklar olsun sana! Kim senin ile tevbe arasına girebilir (tevbeden yararlanamazsın diyebilir)? Oturduğun (Kefre isimli) kötü köyden çıkıp iyi olan falan köye (Nasra köyüne) git ve orada Rabbine ibâdet et, dedi. Bunun üzerine (tevbekâr) katil, tavsiye edilen iyi köye gitmek üzere yola çıktı ve yolda eceli geldi. Rahmet melekleri ile azab melekleri onun hakkında münâkaşa etmeye başladılar: Şeytân! Bu adama ben herkesten fazla yakınım, çünkü hiç bir an bana isyan etmedi (dâima bana uydu) dedi. Rahmet melekleri de: Bu adam tevbe ederek yola çıktı, dediler.» (Râvi) Hammâm demiştir ki: Humeyd et-Tavil, Bekr bin Abdillah aracılığıyla Ebû Râfi (r.a.)'den bana rivayet ettiğine göre Ebû Râfi' şöyle demiştir: (Rahmet melekleri ile azab meleklerinin ihtilâfa düşmeleri üzerine) Allah Azze ve Celle (ihtilâfın halli için) bir melek gönderdi. Melekler ihtilâfın halli için buna baş vurup döndüler. Hakem olan melek: Bakınız. îki köy (yâni ölünün çıktığı kötü köy ile gitmek istediği iyi köy) den hangisi ölünün bulunduğu yere daha yakın ise ölüyü o köy halkının hükmüne tabi tutunuz, diye hüküm verdi. (Râvi) Katâde demiştir ki: El-Hâsan (el-Basrî) bize şu hadîsi rivayet etti: Bu adama (yolun yarısında) ölüm erişince, adam kendini (iyi köye doğru) itti ve böylece iyi köye yaklaştı .ve kötü köyü kendisinden uzaklaştırdı. Melekler de kendisini iyi köy halkının hükmüne tabi tuttular (yâni iyi insanlardan saydılar). Müellifimiz demiştir ki: Ebü'l-Abbâs bin Abdillah bin İsmail el-Bağdadî (de) Affân aracılığıyla Hammâm'dan naklen bu hadîsin benzerini bize rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2623,
			"arabicnumber": 2623,
			"text": "Ebû Şürayh el-Huzâî (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Yakınının öldürülmesi veya bir uzvunun kesilmesi musibeti başına gelen (mirasçı durumundaki) kimse (şu) üç şeyden birisini seçmekte serbesttir. Eğer dördüncü bir şey isterse manî olunuz. (şöyleki): Katili öldürmesi veya onu afv etmesi ya da diyet (tazminat) alması (dır.) Kim bunlardan birisini yaptıktan sonra (diğer bir şeye) dönüş ederse şüphesiz o kimseye, içinde ebedî olarak kalacağı ve ibka edileceği cehennem ateşi vardır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2624,
			"arabicnumber": 2624,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Bir yakını öldürülen (mirasçı durumundaki) kimse, katili öldürmek veya fidye (tazminat) almaktan uygun gördüğünü seçmeye yetkilidir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2625,
			"arabicnumber": 2625,
			"text": "Zeyd bin (Sa'd bin) Dumayra (r.a.)'den; Şöyle demiştir: Babam (Sa'd) ve amcam bana (şu) hadisi anlattılar. —İkisi de Resulullah (Sallallahu Aleyhi ve Sellem) 'in beraberinde Huneyn savaşına katılmışlar idi. — İkisi dediler ki: Nebi (Sallallahu Aleyhi ve Sellem) bize öğle namazını kıldırdı. Sonra bir ağacın altında oturdu. Hındıf kabilesi başkanı el-Akra' bin Habis O'nun huzuruna çıkarak (katil durumundaki) Muhallim bin Cessâme'nin kanını (yâni öldürülmemesini) savunmaya başladı. Uyeyne bin Hısn da ayağa kalkarak (maktul) Âmir bin el-Edbat'ın kanını taleb etmeye başladı. (Maktul) Âmir el-Eşca' kabilesinden idi. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) maktulün adamlarına: «Diyeti kabul ediyor (mu) sunuz?» buyurdu. Adam!ar (bundan) imtina ettiler (ve katili öldürmek istediler.) Sonra Benî Leys kabilesinden Mükeytil denilen bir adam ayağa kalkarak: Yâ Resûlallah Allah'a yemin ederim ki, ben İslâmiyet'in ilk günlerinde öldürülen bu maktul (un kan durumun) u ancak (şöyle olan) bir koyun sürüsü (nün hâli) ne benzetirim-. Sürü su içmeye gelir de (baş kısmı) taşlanıp kovalanır, taşlanmayanı da (korkup) kaçar, (yâni ibret için katil öldürülmelidir), dedi. Sonra Nebi (Sallallahu Aleyhi ve Sellem) (maktulün velîlerine): «Size elli (deve) bu yolculuğumuzda (peşin), elli (deve) de (Medîne-i Münevvere'ye) döndüğümüz zaman (diyet olarak verilsin)-buyurdu. Onlar da diyeti kabul ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2626,
			"arabicnumber": 2626,
			"text": "Amr bin Şuayb'ın dedesi (Abdullah bin Amr bin el-As) (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim (bir mu'mini) kasden öldürürse o kimse maktulün velîlerine teslim edilir. Maktulün velîleri dilerlerse onu öldürürler, dilerlerse diyet alırlar. Bu da otuz (aded) hikka, otuz aded cezaa ve kırk aded halıfa (hâmile deve) dir. Bu diyet, kasden öldürme tazminatıdır. Maktulün velîleri ile ne (meblâğ) üzerine sulh yapılırsa bu (meblâğ) onların hakkıdır. Bu da diyetin ağırlaştırılmış olanıdır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2627,
			"arabicnumber": 2627,
			"text": "Abdullah bin Amr {bin el-Âs) (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kasden öldürmeye benzeyen hatâen (yanlışlıkla) Öldürme olayının maktulü, kamçı ve sopa ile öldürülen kimsedir. (Bunun diyeti), kırk tanesi hâmile olan yüz devedir.» Müellifimiz bu hadisin bir mislini ikinci bir senedle de Abdullah bin Amr'den merfû olarak rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2628,
			"arabicnumber": 2628,
			"text": "(Abdullah) bin Ömer (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Mekke fetih günü Kabe merdiveni üzerinde ayağa kalkarak Allah'a hamd ve sena ettikten sonra şöyle buyurdu; «Hamd (Mekke'nin fethine dâir) va'dini yerine getiren, kuluna — Muhammed (Sallallahu Aleyhi ve Sellem)'e— yardım eden ve düşman topluluklarını yenilgiye yalnızca uğratan Allah'a mahsustur. Bilmiş olunuz ki: (Kasden işlenene benzeyen) hatâen öldürme olayı maktulü, kamçı ve sopa ile öldürülen kimsedir. Bunun diyeti yüz devedir. Develerin kırk tanesi karınlarında yavruları bulunan haîifa develerdir. Bilmiş olunuz ki : Câhüiyet devrinde iftihar vesilesi edilen her şey ve bütün kan dâvaları şu iki ayağımın altındadır. Ancak olagelen Kâ'be sidânesi (hizmet ve bakımı) ve hacı sıkayesi (sulaması) bu hükmün dışındadır. Bilmiş olunuz ki: Bu iki işi evvelce olduğu gibi ellerinde bulunanlara vermeyi onaylıyorum.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2629,
			"arabicnumber": 2629,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan rivayet edildiğine göre: Peygamber (Sallallahu Aleyhi ve Seîîem), öldürme diyetini on iki bin (dirhem gümüş) kıldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2630,
			"arabicnumber": 2630,
			"text": "Amr bin Şuayb'ın dedesi (Abdullah bin Amr bin el-Âs) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem): Kim hatâen (= yanlışlıkla) öldürülürse onun develerden diyeti otuz bint-i Madhâd (iki yaşına giren dişi deve), otuz bint-i Lebûn (üç yaşına giren dişi deve), otuz hıkka (dört yaşına basan dişi deve) ve. on ibn-i Lebûn (üç yaşına giren erkek deveîdir, buyurmuştur. Resulullah (Sallallahu Aleyhi ve Sellem), köylülerin ödeyeceği bu diyet için dört yüz dinar (altın) veya buna denk gümüş kıymet takdir ederdi. Deve sahiplerinin ödeyeceği bu diyet için de kıymet takdir ederdi. Develer pahalanınca, (deve sahiplerinin ödeyeceği) diyetin bedelini de artırırdı ve develerin fiatı düşünce diyetin bedelini de eksiltirdi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem), (deve sahiplerinin ödeyeceği bu nevî diyetin kıymetini) zamanın (rayiç) durumuna göre ayarlardı. Böylece bu nevî diyetin kıymeti Resulullah (Sallallahu Aleyhi ve Sellem) hayatta olduğu dönemde, dört yüz dinar (altın) ile sekiz yüz dinar (altın) arasındaki meblâğlara veya bunun gümüşten dengi olan sekiz bin dirheme ulaştı. Resulullah (Sallallahu Aleyhi ve Sellem) sığır sürüsü sahipleri tarafından diyeti sığırdan ödenecek maktulün diyetinin iki yüz sığır olduğuna ve koyun sürüsü sahipleri tarafından diyeti koyundan ödenecek maktulün diyetinin iki bin koyun olduğuna hükmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2631,
			"arabicnumber": 2631,
			"text": "Abdullah bin Mes'üd (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyîe buyurdu, demiştir: «Hatâen öldürme diyetinde yirmi hıkka (beş yaşına giren dişi deve), yirmi cezaa (dört yaşına giren dişi deve), yirmi bint-i mahad (iki yaşına giren dişi deve), yirmi bint-i Lebûn (üç yaşına giren dişi deve) ve yirmi ibn-i mahad (iki yaşma giren erkek deve lâzım)dır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2632,
			"arabicnumber": 2632,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: Peygamber (Sallallahu Aleyhi ve Sellem) öldürme diyetini on iki bin (dirhem gümüş) kıldı. İbn-i Abbâs dedi ki: Allah Teâlâ'mın: «Allah ve Resulü bol nimetinden onları zenginleştirdi de öç almaya kalktılar,»[Tevbe 74] buyruğu, bunun hakkındadır. İbn-i Abbâs dedi ki: Âyette sözü edilenler diyet almakla (zenginleştiler)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2633,
			"arabicnumber": 2633,
			"text": "El-Muğîre bin Şu'be (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) diyetin (katilin) âkilesi tarafından ödenmesine hükmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2634,
			"arabicnumber": 2634,
			"text": "EI-Mıkdam eş-Şami (bin Madikerib) (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu aleyhi ve Sellem) şöyle buyurdu, demiştir; ''Mirasçısı olamayan (müslüman'ın mirasçısı benim. (Yani malını beytü'I-mala korum). Onun diyetini öderim ve ona mirasçı olurum. Dayı, mirasçısı olmayan (yeğenin'in mirasçısıdır. Onun yerine diyet öder ve onun mirasını alır)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2635,
			"arabicnumber": 2635,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan rivayet edildiğine göre; Peygamber (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kim nasıl olduğu belirsiz bir karışıklık içinde veya yakınlarını savunma esnasında bir taş veya bir kamçı ya da bir sopa ile (öldürme kasdı olmaksızın) öldürürse o kimse üzerine hatâen öldürme diyeti (vâcib) dir. Kim (bu ortamda) kasden öldürürse bu (öldürme) kısasta sebebidir. Kim de katil ile kısas arasına girer (yâni katilin öldürülmesine engel olur) ise, Allah'ın, meleklerin ve bütün insanların laneti o kimse üzerine olsun (veya üzerinedir). O kimseden ne tevbe kabul olunur, ne de fidye (veya o kimsenin ne nafile ibâdeti ne de farz ibâdeti kabul olunur.»)",
			"grades": [
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Batil"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2636,
			"arabicnumber": 2636,
			"text": "Câriye (bin Zafar) (r.a.)'den: Bir adam başka bir adam'ın alt koluna kılıç vurup mafsal olmayan bir yerden kesip kopardı. Kolu koparılan adam Peygamber (Sallallahu Aleyhi ve Sellem)'e müracaatla, kolunu kesenden hakkını almasını İstedi. Peygamber (Sallallahu Aleyhi ve Sellem) kolu kesilene diyet ödemeyi emretti. Adam: Ya Resûlallah ben kısas istiyorum, dedi. Peygamber (Sallallahu Aleyhi ve Sellem) (adama): «Diyeti al. Allah diyeti sana mübarek eylesin,» buyurdu ve onun için hasmının kısas edilmesine hükmetmedi. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Dehsem bin Kurran el-Yemani bulunm. Ebu Davud onu zayıf saymıştır. Zevaid yazarı: Müellif (İbn-i Maceh)'in yanında Cariye'nin bundan başka hadisi yoktur. Kütüb-i Sitte'nin diğerlerinde ise onun hiç bir hadisi yoktur, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2637,
			"arabicnumber": 2637,
			"text": "Abbâs bin Abdilmuttalib (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ne me'mûne (beyin zarına ulaşan yara) da, ne câife (bedenin iç kısmına ulaşan yara) da ne de münakkıla (kemiği kırıp yerinden kaydıran yara) da kısas vardır. » (Yâni başkasını böyle yaralayan kimseye ceza olarak misilleme yapılmaz.)» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Rişdin bin Sa'd el-Mısri Ebü'l-Haccac el-Mehri bulunur. Bir cemaat onu zayıf saymıştır. Ahmed'in onun hakkındaki sözleri değişiktir. Çünkü bir defasında onun zayıf Olduğunu söylemiş, başka bir kere: Onun hadisinin işe yarar durumda olduğunu umarım, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2638,
			"arabicnumber": 2638,
			"text": "Aîşe (r.anha)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Ebû Cehm bin Huzeyfe (r.a.)'i zekât tahsildarı olarak (taşraya) gönderdi. Bir adam zekâtı hakkında Ebû Cehm ile münâkaşa ediyor. Bunun üzerine Ebû Cehm onu dövüp başını kırıyor. Sonra adamın yakınları Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: Ya Resûlallah! Kısas, dediler. Nebi (Sallallahu Aleyhi ve Sellem) (onlara): «Size şu kadar (mal verilsin), buyurdu. Adamlar razı olmadılar. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «(Ödenecek tazminat mikdarını artırarak) size şu kadar (mal verilsin)» buyurdu. Adamlar razı oldular. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) (adamlara): «Ben (öğleden sonra) halka hitabede bulunacağım ve sizin razı olduğunuzu onlara bildireceğim,» buyurdu. Adamlar: Evet, dediler. Buna binâen Nebi (Sallallahu Aleyhi ve Sellem) bir konuşma yaptı ve: «Şu Leysîler kısas talebinde bulunmak üzere bana baş vurdular. Ben onlara (kısas yerine) şu kadar (tazminat) teklif ettim,» buyurdu. (onlara.dönüp): Razı oldunuz mu? dedi. Adamlar; Hayır, dediler. Bunun üzerine muhacirler onları menetmek istediler. Fakat Nebi (Sallallahu Aleyhi ve Sellem} muhacirlerin vazgeçmelerini emretti. Muhacirler de vazgeçtiler. Sonra Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) onları çağırdı ve kendilerine verilecek mal miktarını artırdı. Sonra (onlara); «Razı oldunuz mu?» buyurdu. Adamlar: Evet, deyince. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Ben halka konuşma yapacağım ve sizin razı olduğunuzu onlara haber vereceğim,» buyurdu. Adamlar; Peki, dediler. Sonra Nebi (Sallallahu Aleyhi ve Sellem) halka konuşma yaptı. Sonra (adamlara): «Razı oldunuz mu?» buyurdu. Adamlar da: Evet, dediler. İbn-i Mâceh dedi ki: Ben, Muhammed bin Yahya'dan şu sözleri işittim: Bu hadîsi yalnız Ma'mer rivayet etti. Kendisinden başka kimselerin bunu rivayet ettiklerini bilmiyorum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2639,
			"arabicnumber": 2639,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) cenin (in tazminatı) hakkında bir ğurre ile hükmetti. Ğurre, köle veya câriyedir. Aleyhinde (yâni ğurre ödemesine) hüküm verilen adam (kafiyeli, seci'lî cümlelerle : Yâ Resûlallah) Henüz içmeyen, yemeyen, bağırmayan, doğarken ses vermeyen cenîn için diyet verecek miyiz. Halbuki bunun misli hederdir (öcü alınmaz)? dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Şüphesiz bu adam bir şâirin sözü ile hükmediyor. Cenîn (in diyeti) bir ğurredir; Bir köle veya bir câriye.» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2640,
			"arabicnumber": 2640,
			"text": "Misver bin Mahrama (r.a.)'den: Şöyle demiştir: Ömer bin el-Hattâb (r.a.), kadının karnından darbe yemekle ölü cenîn düşürmesi (tazminatı) hakkında sahâbîlere danıştı. Bunun üzerine el-Müğîre bin Şu'be (r.a.): Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'in bunun hakkında bir ğurre (yâni) bir köle veya bir câriye (tazminat) ile hükmettiğine şahid oldum, dedi. Ömer (el-Müğîre'ye): Seninle beraber (bu hükme) şâhidlik edecek bir sahâbî getir, dedi. Sonra Muhammed bin Mesleme (r.a.) de Muğîre ile beraber (bu hükme) şâhid olduğunu söyledi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2641,
			"arabicnumber": 2641,
			"text": "Ömer bin el-Hattâb (r.a.)'den rivayet edildiğine göre: Kendisi Peygamber (Sallallahu Aleyhi ve Sellem)'in bu meselede, yâni cenin (in diyeti) hakkındaki hükmünü sahâbîlere sordu. Bunun üzerine Hami bin Mâlik bin en-Nâbiğa ayağa kalkarak: Ben iki karımın arasında idim. Bunlardan birisi diğerini bir çadır direğiyle dövüp öldürdü ve ceninini (yâni karnındaki bebeğini) de öldürdü. Resulullah (Sallallahu Aleyhi ve Sellem) cenîn (in tazminatı) hakkında ğurre olan bir kölenin ödenmesine ve öldürülen kadına karşılık katile kadının öldürülmesine hükmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2642,
			"arabicnumber": 2642,
			"text": "Saîd bin el-Müseyyeb'den rivayet edildiğine yöre: Ömer (hin eî-Hattâb) (r.a.ı): Diyet âkile'nin (yâni maktulün baba tarafından olan yakınlarının) hakkıdır ve kadın (öldürülen) kocasının diyetindan hiç bir şeye vâris olmaz, diyordu. Nihayet ed-Dahhâk bin Süfyân (r.a.): Peygamber (Sallallahu Aleyhi ve SelIem)'in, Eşyem ed-Dıbâbi'nin karısını kocasının diyetine mirasçı kıldığını Ömer'e yazdı. (Bunun üzerine Ömer görüşünden dönüş yaptı)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2643,
			"arabicnumber": 2643,
			"text": "Ubade bin es-Sâmıt (r.a.)'den rivayet edildiğine göre: Peygamber (Sallallahu Aleyhi ve Sellem), Hami bin Mâlik el-Huzeli el-Lihyânî'yi kuması tarafından öldürülen karısına mirasçı kıldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2644,
			"arabicnumber": 2644,
			"text": "Amr bin Şuayb'in dedesi (Abdullah bin Amr) (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) iki kitâb (yâni Tevrat ve İncil) ehlinin diyetinin müslümanların diyetinin yarısı olduğuna hükmetmiştir. İki kitâb ehli, yahüdîler ve hristiyanlardır.\" Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedi hasendir, çünkü sahih senedin derecesinden noksandır. Sebebi de şudur: Ravi Abdurrahman bin Ayyaş'ı zayıf sayanı da sika sayanı da görmedim. Amr bin Şuayb'ın dedesi, hakkında da ihtilaf vardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2645,
			"arabicnumber": 2645,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem): «Katil (öldürdüğü yakınının malına) vâris olmaz» buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2646,
			"arabicnumber": 2646,
			"text": "Amr bin Şuayb'den rivayet edildiğine göre: Müdlic oğullarından Ebû Katâde denilen bir adam oğlunu öldürdü. Ömer (r.a.) kendisinden otuz hikka (beş yaşına basmış dişi deve), otuz cezaa ve kırk hahfa olmak üzere yüz deve aldı. Sonra: Maktulün erkek kardeşi nerdedir? Ben Resulullah (Sallallahu Aleyhi ve Sellem)'den işittim buyurdu ki: «Kâtil'e (maktulün malına) vâris olma hakkı yoktur,» dedi. Not: Bu hadisin senedinin hasen olduğu Zevaid'de belirtilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2647,
			"arabicnumber": 2647,
			"text": "Amr bin Şuayb'in dedesi (Abdullah bin Amr) (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem): Kadının mevcud asabesi (yâni baba tarafından erkek, akıllı akrabası) nım onun (cinayet işlemesi hâlinde ödenmesi gerekli) diyetini vermelerine ve bunların, kadının vereselerinden (belirli hisse sahiplerinden) artan mal dışında onun hiç bir malına mirasçı olmamalarına hükmetti. (Ayrıca şuna da hükmetti:) Kadın öldürülürse diyeti , onun mirasçıları arasındadır (Farâiz hükümlerine göre aralarında taksim edilir). Bu itibarla katilini onlar öldürür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2648,
			"arabicnumber": 2648,
			"text": "Câbir (bin Abdillah) (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) diyeti, katile kadının âkilesi (baba tarafından erkek ve akıllı yakınları) üzerine yükledi. Bunun üzerine öldürülmüş olan kadının âkilesi (baba tarafından olan erkek ve akıllı yakınları): Ya Resûlallah! Öldürülen kadının mirası bizedir, dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Hayır. Mirası kocasına ve çocuklarınadır» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2649,
			"arabicnumber": 2649,
			"text": "Enes (bin Mâlik) (r.a.)'den; Şöyle demiştir: Enes'in (yâni kendisinin) halası er-Rubeyyi' (r.anha) (bir kere) bir cariyenin ön dişini kırdı. Rubeyyi'in yakınları (karşı taraftan) afıv dilediler. Fakat cariyenin adamları (affetmekten) imtina ettiler. Bunun üzerine Rubeyyi'in yakınları dişin tazminatını ödemeyi onlara teklif ettiler. Onlar bunu da kabul etmeyerek Peygamber (Sallallahu Aleyhi ve Sellem)'e vardılar. Resûl-i Ekrem (Sal-lallahu Aleyhi ve Sellem) de kısasın uygulanmasını emretti. (Rubeyyi'nin kardeşi) Enes bin en-Nadr (r.a.): Yâ Resûlallah er-Rubeyyi'nin ön dişi (misilleme olarak) kırılacak (mı?) Seni hak (din) ile gönderen Allah'a yemin ederim (ve Allah'ın yardımını umarak derim) ki er-Rubeyyi'nin dişi kınlmıyacaktır, dedi. Peygamber (Sallallahu Aleyhi ve Sellem) de: «Yâ Enes (bin en-Nadr) Allah'ın farz kıldığı hüküm kısastır,» buyurdu. Râvi demiştir ki: (Enes'in umutlu yemininden) sonra cariyenin adamları (diyete) razı oldular ve (er-Rubeyyi'i kısas cezasından) affettiler. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Şüphesiz, Allah'ın kullarından öyle kişi vardır ki, Allah'a yemin etse Allah onun yeminini yerine getirir» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2650,
			"arabicnumber": 2650,
			"text": "(Abdullah) hin Abbâs (r.a.)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Dişler (diyet mikdarı bakımından) eşittir. Seniyye (denilen ön) diş ve dırs (denilen diğer dişler) eşittir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2651,
			"arabicnumber": 2651,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan rivayet edildiğine göre: Peygamber (Sallallahu Aleyhi ve Sellem) dişin diyetinin beş deve olduğuna hükmetti. Not: Bu hadisin senedinin sahih olduğu, Zevaid'de belirtilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2652,
			"arabicnumber": 2652,
			"text": "(Abdullah) bin Abbâs (r.a.)'danrivayet edildiğine göre: Peygamber (Sallallahu Aleyhi ve Sellem) «Şu ve şu» yâni küçük parmak, yüzük parmağı ve baş parmak (diyet mikdarı bakımından) «eşittir» buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2653,
			"arabicnumber": 2653,
			"text": "Amr bin Şuayb'ın dedesi (Abdullah bin Amr) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Parmakların hepsi (diyet mikdarı bakımından) eşittir. Bunlarda onar deve (diyeti) vardır.» Not: Bunun senedinin hasen olduğu, Zevaid'de bildirilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2654,
			"arabicnumber": 2654,
			"text": "Ebû Mûsa el-Eş'arî (r.a.)'den rivayet edildiğine göre; Peygamber (Sallallahu Aleyhi ve Sellem): «Parmaklar (diyet mikdarı bakımından) eşittir» buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2655,
			"arabicnumber": 2655,
			"text": "Anır hin Şııayb'ın dedesi (Abdullah bin Amr bin el-Âs) (r.a.)'den rivayet edildiğine göre: Peygamber (Sallallahu Aleyhi vr Sellem) şöyle buyurmuştur: «Mevâdih (kemiğe dayanan baş ve yüzdeki yaralar) da beşer deve (diyet) vardır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2656,
			"arabicnumber": 2656,
			"text": "Ümeyye oğulları Ya'lâ ve Seleme (r.a.)'dan rivayet edildiğine göre şöyle demişlerdir: Biz Tebûk savaşında Resulullah (Sallallahu Aleyhi ve Sellem) ile beraber yola çıktık. Bizim beraberimizde bir arkadaşımız da vardı. Biz yolda iken arkadaşımız ile diğer bir adam döğüştüler. Ya'lâ demiştir ki: Adam, (döğüştüğü) arkadaşının elini ısırdı. Arkadaşı da elini onun ağzından çekti ve adamın ön dişini düşürdü. Adam, Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına vararak (düşürülen) ön dişinin diyetini istedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Biriniz (din) kardeşine yönelerek erkek devenin ısırması gibi onu ısırır, sonra gelip (düşen dişine) diyet ister. Düşürülen dişe diyet yoktur,» buyurdu. Ya'lâ demiştir ki: Resulullah (Sallallahu Aleyhi ve Sellem) (dâvayı red ederek) dişin diyetinin bâtıl olduğuna hükmetti. Ya'Iâ bin Ümeyye (R.A. )'m Hâl Tercemesi Birinci hadisin râvîsi Ya'Iâ bin Ümeyye (R.A.)'ın hâl tercemesi 1065 nolu hadîs bölümünde geçmiştir. Diğer râvi Seleme bin Ümeyye (R.A.) ise Ya'lâ'nın kardeşidir. Kûfe'ye yerleşen sahâbilerdendir. Buhâri ile Müslim onun bir hadîsini rivayet etmişlerdir. Râvîsi de kardeşi Ya'lâ'nın oğlu Safvân'dır. îbn-i îshâk böyle demiştir. Fakat hıfzedilen rivayet şekli Safvân'ın kendi babası olan Ya'Iâ bin Ümeyye'den rivayetidir. (Hülâsa: 147)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2657,
			"arabicnumber": 2657,
			"text": "İmrân bin Husayn (r.a.)'den rivayet edildiğine göre: Bir adam (başka) bir adam'ın kolunu ısırdı. Isırılan adam da kolunu çekti de ısıranın ön dişi düştü. Dâva Peygamber (Sallallahu Aleyhi ve Sellem)'e intikal ettirildi. Peygamber (Sallallahu ASeyhi ve Sellem) dişin diyetinin bâtıl olduğuna hükmetti ve: «Biriniz erkek devenin dişleriyle sert yem yediği gibi (din kardeşinin kolunu) çatır çatır yiyer (ısırır), (ısıranın düşen dişinin diyeti yoktur).» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2658,
			"arabicnumber": 2658,
			"text": "Ebû Cühayfe (Veheb bin Abdillah es-Suvâî) (r.a.)'den; Şöyle demiştir: Ben Ali bin Ebî Tâlib (r.a.)'a: (Allah'ın kitabından başka) halkın yanında bulunmayıp yalnız sizin yakınınızda (yazılı olarak ve vahya âit) bir bilgi var mıdır? diye sordum. Alî: Hayır! Vallahi halkın yanında bulunandan başka bir şey bizim yanımızda yoktur. Ancak (bizde) Allah'ın kişiye Kur'an hükümlerini anlamak kabiliyeti vermesi ve şu sahifede (yazılı) olan hükümler vardır. Şu sahifede Resulullah (Sallallahu Aleyhi ve Sellem) tarafından buyurulan diyetlerin hükümleri ve hiç bir müslümanm herhangi bir kâfir(i öldürmesin)e karşılık öldürülmemesi hükmü vardır, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2659,
			"arabicnumber": 2659,
			"text": "Amr bin Şuayb'ın dedesi (Abdullah bin Anır bin el-Âs) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Hiç bir müslüman herhangi bir kâfir (i öldürmesin) e karşılık öldürülmez.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2660,
			"arabicnumber": 2660,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan rivayet edildiğine göre; Peygamber (Sallalîahu Aleyhi ve Sellem) şöyle buyurmuştur: «Hiç bir mu'min herhangi bir kâfir(i öldürmesin)e karşılık öldürülmez ve ahid (güvence) sahibi (kâfir) ahdi (süresi) içinde öldürülmez.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2661,
			"arabicnumber": 2661,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Baba, oğlunu öldürmesi sebebiyle kısas edilmez.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2662,
			"arabicnumber": 2662,
			"text": "Ömer bin el-Hattâb (r.a.)'den Şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyururken işittim: «Baba oğlunu öldürmesi sebebiyle kısas edilmez.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2663,
			"arabicnumber": 2663,
			"text": "Semure bin Cündeb (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim kölesini öldürürse biz (de) o kimseyi öldürürüz ve kim kölesinin burnunu keserse biz (de) o kimsenin burnunu keseriz.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2664,
			"arabicnumber": 2664,
			"text": "Amr bîn Şuayb'ın dedesi (Abdullah bin Amr) (r.a.)'den; Şöyle demiştir: Bir adam kölesini kasden ve teammüden öldürdü. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) (de) o adam'a yüz sopa attırdı, onu bir yıl süreyle sürgün etti ve müslümanların (hisselerinin) içinden onun hissesini sildi. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde İshak bin Abdillah bin Ebi Ferve bulunur. Bu ravi zayıftır. Senedde İsmail bin Ayyaş da vardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2665,
			"arabicnumber": 2665,
			"text": "Enes bin Mâlik (r.a.)'den rivayet edildiğine göre: Yahudi bir adam (Ensâr'dan) bir kadının başını iki taş arasında ezerek onu öldürmüştü. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) yahudi'nin başını iki taş arasında ezdirdi (yâni bu şekilde kısas edilmesini emretti)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2666,
			"arabicnumber": 2666,
			"text": "Enes bin Mâlik (r.a.)'den rivayet edildiğine göre: Yahudi bir adam (Ensârdan) genç bir kadın'ı üzerindeki gümüş ziynet eşyasına temaen (başını iki taş arasında ezmek suretiyle) öldürdü. (Kadın henüz can vermemiş iken Peygamber (Sallallahu Aleyhi ve Sellem)'in huzuruna getirildi.) Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem), kadına: «Falan kişi mi seni öldürdü?» diye sordu. Kadın: Hayır, diye başıyla işaret etti. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (başka adamın ismini söyleyerek: «Falan adam mı seni öldürdü,» diye) ikinci kez sordu. Kadın: (Yine) hayır, diye başıyla işaret etti. Sonra Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (bir başka adamın ismini söyleyerek: «Falan adam mı seni öldürdü,» diye) üçüncü defa kadına soru sordu. Kadm: Evet, diye başıyla işaret etti. (Kadının işaret ettiği yahûdî adam yakalanarak huzura getirildi. Adam suçunu itiraf etti.) Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem)'in emriyle katil (in başı) iki taş arasında (ezilerek) öldürüldü",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2667,
			"arabicnumber": 2667,
			"text": "Nu'mân bin Beşîr (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kısas (cezası) ancak kılıçla yerine getiılllr.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Cabir el-Ca'fi bulunur. Bu ravi kezzab (çok yalan sözıü)dür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2668,
			"arabicnumber": 2668,
			"text": "Ebû Bekre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kılıçtan başka bir şeyle kısas (cezasının) infazı yoktur.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde bulunan Mübarek bin el-Füdala tedlisçidir ve bu hadisi an'ane ile rivayet etmiştir. Ravi el-Hasan da böyledir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2669,
			"arabicnumber": 2669,
			"text": "Amr bin el-Ahvas (r.a.)'den; Şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i Veda haccmda şöyle buyururken işittim: «Bilmiş olunuz ki her cânî ancak şahsının işlediği günahtan sorumludur. Hiç bir baba oğlunun günahından sorumlu tutulamaz ve hiç bir oğul babasının günahından sorumlu tutulamaz.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2670,
			"arabicnumber": 2670,
			"text": "Târik el-Mühâribî (r.a.)'den Şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i koltuk altları beyazlığını gördüğüm derecede ellerini havaya kaldırarak şöyle buyururken gördüm: «Bilmiş olunuz ki hiç bir anne oğlunun günahından sorumlu tutulamaz. Bilmiş olunuz ki hiç bir anne oğlunun günahından sorumlu tutulamaz.» Not: Bunun senedinin sahih ve ravilerinin sika oldukları. Zevaid'de bildirilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2671,
			"arabicnumber": 2671,
			"text": "El-Haşhâş el-Anbarî (r.a.)'den; Şöyle demiştir: Beraberimde oğlum bulunduğu halde ben Peygamber (Sallallahu Aleyhi ve Sellem)'in yanına vardım. Peygamber (Sallallahu Aleyhi ve Sellem): «Sen oğlunun günahından sorumlu tutulamazsın, o da senin günahından sorumlu tutulamaz,» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bunun senedindeki ravilerin hepsi sika zatlardır. Fakat Hüşeym tedlisçi idi. El-Haşhaş'ın bundan başka hadisi yoktur. Kütüb-i Sitte'nin kalanlarında onun hadisi yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2672,
			"arabicnumber": 2672,
			"text": "Usâme bin Şerik (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Hiç bir şahıs, başka bir şahsın günahından sorumlu tutulamaz.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahihtir. Ravi Muhammed bin Abdillah'ı İbn-i Hibban sika zatlar arasında anmıştır. Nesai de onun rivayetinde bir beis Olmadığını söylemiştir. Ebü'l-Avvam el-Kattan'ın adı İmran bin Davud'dur. Cumhur onun sika olduğunu söylemiştir. Senedin kalan ravileri de Buhari ile Müslim'in şartları üzerinedirler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2673,
			"arabicnumber": 2673,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Acmâ hederdir, maden ocağı (nda uğranılan zarar) hederdir. Kuyu (da uğranılan zarar) hederdir. (Yâni bu zararlar kimseye ödettirilemez.)»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2674,
			"arabicnumber": 2674,
			"text": "Amr bin Avf (el-Müzenî) (r.a.)'den; Şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'den şöyle buyururken işittim: «Acmâ'nın verdiği zarar hederdir. Maden ocağı(nda uğranılan zarar) da hederdir.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde bulunan Kesir bin Abdillah'ı Ahmed ve İbn-i Main zayıf saymışlardır. Ebu Davud da: O kezzabtır, demiştir. İmam Şafii de: O, yalan sözlülüğün temellerinden biridir, demiştir. İbn-i Abdillah da: Onun zayıflığı üzerinde icma vardır, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2675,
			"arabicnumber": 2675,
			"text": "Ubâde bin es-Sâmit (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), maden ocağı (nda uğranılan zararın) hederliğine, kuyu (da uğranılan zararın) hederliğine ve acmâ'nın verdiği zararın hederliğine hükmetti. Not: Zevaid'de şöyle denilmiştir. Bunun senedindeki raviler sika zatlardır. Ancak Tirmizi ve başkası İshak bin Yahya'nın Ubade (r.a.)'a yetişmediğini söylemişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2676,
			"arabicnumber": 2676,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ateş(in yaptığı zarar) hederdir. Kuyu (zararı) da hederdir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2677,
			"arabicnumber": 2677,
			"text": "Sehl bin Ebî Hasme (r.a.)'in kendi kavminin ileri gelen adamlarından rivayetine göre: Abdullah bin Sehl (bin Zcyd) ve Muhayyısa (bin Mes'ûd bin Zeyd) (r.a.) başlarına gelen fakirlikten dolayı (bir hurma mevsiminde hurması bol olan) Hayber'e (dostları yanında hurma toplamaya) gittiler. (Ve Hayber'e vardıklarında kendi işlerine bakmak üzere birbirinden ayrıldılar. Bir süre) sonra Muhayyisa'ya gelinip, Abdullah bin Sehl'in öldürülüp bir kuyuya veya bir pınara atılmış olduğu haberi verildi. Bunun üzerine Muhayyısa Hayber yahûdîlerîne giderek: Allah'a yemin ederim ki onu siz öldürdünüz, deyince yahûdîler: Allah'a and olsun ki onu biz öldürmedik, dediler. Sonra Muhayyısa ordan (Medine'ye) dönüp kavminin yanına varıyor ve durumu onlara anlatıyor. Daha sonra kendisi, ağabeyi Muhayyısa ve Abdurrahmân bin Sehl kalkıp (Nebi) (Sallallahu Aleyhi ve Sellem'e) gittiler. (Önce) Muhayyısa söze başladı, (maktul ile beraber) Hayber'de olan kendisi idi. Fakat Resulullah (Sallallahu Aleyhi ve Sellem) Muhayyısa'ya yaşça büyüklüğü kasdederek: «İlk sözü büyüğe bırak, ilk sözü büyüğe bırak», uyarısında bulundu. Bunun üzerine (Muhayyısa sustu ve ağabeyi) Huvayyısa olayı anlattı. Ondan sonra da Muhayyısa konuştu. Neticede Resulullah (Sallallahu Aleyhi ve Sellem) onlara: «Hayber yahûdîleri ya (öldürülen) arkadaşınızın diyetini öderler, veya onlara (karşı Allah ve Resulü tarafından) bir savaş ilân edilir,» buyurdu. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) bu konu hakkında (Hayber yahûdüerine) yazı yazdırdı. (Bu yazıya cevaben) onlar: Allah'a yemin ederiz ki onu kat'iyyen biz öldürmedik, diye yazı gönderdiler. Bu cevab üzerine Resulullah (Sallallahu Aleyhi ve Sellem), Huvayyısa. Muhayyısa ve Abdurrahmân'a: «Bu cinayetin Hayber yahûdîleri tarafından işlendiğine yemin eder (mi) siniz ve (bu takdirde) arkadaşınızın kan bedeline müstahak olursunuz?» buyurdu. Bunlar: Hayır, (yanında) bulunmadığımız ve görmediğimiz bir cinayet hakkında nasıl yemin ederiz? dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Şu halde yahûdîler (bu cinayetten habersiz olduklarına dâir) size yemin ederler,» buyurdu. Bunlar: Onlar müslüman değiller, (nasıl onların yeminlerine itibar ederiz), dediler. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) maktulün diyetini kendi yanından verdi. Resulullah (Sallallahu Aleyhi ve Sellem) maktulün yakınlarına yüz adet dişi deve gönderip ta evin içinde onlara teslim ettirdi. Râvî Sehl (bin Ebi Hasme) demiştir ki: O sürüden kırmızı bir dişi deve bana tekme attı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2678,
			"arabicnumber": 2678,
			"text": "Amr bin Şuayb'in dedesi (Abdullah bin Amr) (r.a.)'den; Şöyle demiştir: Mes'üd'un oğullan Huvayyısa ve Muhayyısa ile Sehl'in oğullan Abdullah ve Abdurrahmân (r.a.), Hayber'de yiyecek temini maksadıyla, (Medîne-i Münevvere'den) çıkıp gittiler. (Hayber'de) Abdullah'a zulüm edilip öldürüldü. Sonra durum Resulullah (Sallallahu Aleyhi ve Sellem)'e anlatıldı. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (maktulün arkadaşlarına): «(Abdullah'ın Hayber yahûdîleri tarafından öldürüldüğüne) yemin edersiniz ve (kan bedeline) müstahak olursunuz»? buyurdu. Onlar: Ya Resulallah yanında bulunmadığımız bir cinayet hakkında nasıl yemin ederiz? dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) : «Şu halde yahûdiler (yemin etmekle) isnad ettiğiniz suçtan beraet ederler.» buyurdu. Onlar; Ya Resûlallah! Yahudiler yemin etmekle beraet edebilince bizi öldürürler, dediler. Râvî demiştir ki: Bunun sonucunda Resulullah (Sallallahu Aleyhi ve Sellem) maktulün diyetini kendi yanından verdi. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Haccac bin Ertat vardır. O tedlisçidir (ve an'ane ile rivayet etmiştir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2679,
			"arabicnumber": 2679,
			"text": "Zinbâ (Ebû Ravh) (r.a.)'dan rivayet edildiğine: Kendisi bir kölesinin yumurtalarını çekip çıkarmış (veya erkeklik organını kesmiş) olarak Peygamber (Sallallahu Aleyhi ve Sellem)'in huzuruna vardı. Peygamber (Sallallahu Aleyhi ve Sellem) bu işkenceye karşı köleyi azadladı (azadlığma hükmetti). Not: Ravi İshak bin Ebi Ferve'nin zayıflığı nedeniyle bu senedin zayıflığı, Zevaid'de belirtilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2680,
			"arabicnumber": 2680,
			"text": "Amr bin Şuayb'in dedesi (Abdullah bin Amr ) (r.a.)'den rivayet edildiğine göre şöyle demiştir: (Köle) bir adam imdâd, diye bağırarak Peygamber (Sallallahu Aleyhi ve Sellem)'in yanına geldi. Resulullah (Sallallahu Aleyhi ve Sellem) ona: «Neyin var?» buyurdu. Köle: Efendim beni bir cariyesini öptüğüm esnada gördü, bu nedenle benim erkeklik organımı kesti, dedi. Nebi (Sallallahu Aleyhi ve Sellem) (sahâbilere) : «O herifi bana getiriniz,» buyurdu. Adam arandı. Fakat bulunamadı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) (köleye): «Git. Sen hürsün,» buyurdu. (Râvî) demiştir ki: Köle: Yâ Resulallah! Efendim beni köleleştirmek isterse bana yardımcı olmanın kimin üzerine (vâcib) olduğunu söyler misin? diye sordu. Resulullah (Sallallahu Aleyhi ve Sellem) de: «Her mu'min veya her müslüman üzerine (vâcib) dir,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2681,
			"arabicnumber": 2681,
			"text": "Abdullah (bin Mes'ûd) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Ehli îman, öldürme tarzı yönünden insanların en iffetli (merhametli) lerindendir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2682,
			"arabicnumber": 2682,
			"text": "Abdullah (bin Mes'ûd) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Öldürme tarzı yönünden insanların en iffetlisi îman ehlidir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2683,
			"arabicnumber": 2683,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Müslümanların kanları eşittir. Ve onlar, başkalarına karşı tek el'dır. Onların teminatını (mertebece) en düşük olanı akdedebilir (verebilir). Ve (savaşta alınan ganimet düşman saflarına en yakın olanlar tarafından) en uzak olana iade edilir (yâni hissesi verilir),»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2684,
			"arabicnumber": 2684,
			"text": "Ma'kil bin Yesâr (r.a.)'den rivâyet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Müslümanlar başkalarına (düşmanlarına) karşı tek el (gibi olmalı) dır ve kanlan (kısas ve diyet hususunda) eşittir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2685,
			"arabicnumber": 2685,
			"text": "Amr bin Şuayb'ın dedesi (Abdullah bin Amr) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Müslümanların (birlik ve beraberlik) eli onlardan olmayanlara (düşmanlarına) karşı (olmalı) dır. Müslümanların kanları (kısas ve diyet hususunda) ve malları eşittir. Müslümanların (mertebece) en düşüğü hepsinin adına (kâfire mal, can ve namus) teminatı verebilir ve (savaşta) müslümanlarm en uzak olanları (yâni düşmana en yakın olanları ele geçirdikleri ganimeti düşmana uzak olan) müslümanlara iade eder (yâni hisselerini verir).»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2686,
			"arabicnumber": 2686,
			"text": "Abdullah hin Amr (hin el-As) (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir; «(Müslümanlardan) kim bir muâhed (yâni zimmîyi) (haksız yere) öldürürse o kimse Cennet kokusu kokamaz. Halbuki Cennet kokusu kırk yıllık mesafede bulunur.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2687,
			"arabicnumber": 2687,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «(Müslümanlardan) kim, Allah'ın teminatına ve Resulünün teminatına (yâni dînen geçerli sayılan teminata) sahip olan bir muâd (yâni zimmi'yH (haksız yere) öldürürse, o kimse Cennet kokusu kokamaz. Halbuki Cennet kokusu yetmiş yıllık mesafede bulunur,»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2688,
			"arabicnumber": 2688,
			"text": "Rifâa bin Şeddâd el-Fityânî'den; Şöyle demiştir: Amr bin el-Hamık el-Huzâi (r.a.)'den işittiğim bir kelime (hadis) olmasaydı, beri el-Muhtâr'ın başı ile cesedi (ni birbirinden ayırıp) arasında yürüyecektim. Ben Amr bin el-Hamık'tan şöyle söylerken işittim. Resulullah (Sallallahu Aleyhi ve Sellem) buyurdu ki: «Kim bir adam'a can teminatını verip sonra onu öldürürse şüphesiz o kimse kıyamet günü bir ğadir (zulüm) sancağını taşıyacaktır.» Not: Zevaid'de şöyle denilmiştıir: Bunun isnadı sahih ve ravileri sika (güvenilir) zatlardır. Çünkü ravi Rıfaa bin Şeddad'ın hadisini Nesai kendi süneninde rivayet etmiş ve sika olduğunu söylemiştir. İbn-i Hibban da onu sika raviler arasında anmıştır. Senedin kalan ravileri. Müslim'in şartı üzerinedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2689,
			"arabicnumber": 2689,
			"text": "Rıfâa bin Şecîdâd (r.a.j'den; Şöyle demiştir: Ben Muhtâr'ın yanına kendisinin sarayında girdim. Kendisi: Cebrail (Aleyhisselâm) bu saatta benim yanımdan kalktı, dedi. Süleyman bin Sured {r.a.)'ın Nebi (Sallallahu Aleyhi ve Sellem) den bana rivayet ettiği: «Adam kanı hususunda sana güvendiği zaman sen onu öldürme» hadîsinden başka hiç bir şey beni Muhtâr'ın boynuna (bu iftirasından dolayı kılıç) vurmakdan alakoymadı. İşte beni onun boynunu (kılıçla) vurmaktan meneden şey bu hadistir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2690,
			"arabicnumber": 2690,
			"text": "Ebu Hureyre (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken bir adam (bir müslüman kişiyi) öldürmüştü. Dâva Peygamber (Sallallahu Aleyhi ve Sellem)'e arzedildi. Peygamber (Sallallahu Aleyhi ve Sellem) de katili (kısas edilmek üzere) maktulün velîsine teslim etti. Bunun üzerine katil: Yâ Resulallah Allah'a yemin ederim ki ben maktulü kasden öldürmedim, dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem), maktulün velîsine: «Bilmiş ol ki, katil eğer gerçekten doğru sözlü olup sonra sen onu öldürür isen Cehennem ateşine girersin,» buyurdu. Ebu Hureyre dedi ki: Bu buyruk üzerine maktulün velîsi katili serbest bıraktı. Ebu Hureyre dedi ki: Katilin elleri bir enli ve uzun kayışla arkasından bağlı idi. Katil, kayışını çekerek, yederek çıkıp gitti. Bu nedenle kendisine Ze'n-Nis'a ( = kayış sahibi) ismi verildi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2691,
			"arabicnumber": 2691,
			"text": "Enes bin Mâlik (r.a.)'den rivayet edildiğine göre: Bir adam, velisinin katilini Resulullah (Sallallahu Aleyhi ve Sellem)'e getirdi. Peygamber (Sallallahu Aleyhi ve Sellem) (adama): «(Katili) bağışla,» buyurdu. Adam bağışlamaktan imtina etti. Bunun üzerine Peygamber (Sallallahu Aleyhi ve Sellem): «Diyetini (kan bahasını) al,» buyurdu. Adam (bundan da) imtina etti. (Bu kere) Peygamber (Sallallahu Aleyhi ve Sellem): «Git katili öldür, şüphesiz sen (onu öldürür isen) onun mislisin,» buyurdu. Enes dedi ki: Sonra adam'a arkadan yetişildi ve kendisine denildi ki, Resulullah (Sallallahu Aleyhi ve Sellem): «Katili öldür. Şüphesiz sen (onu öldürürsen) onun mislisin,» buyurdu. Adam bunun üzerine katile yol verdi. Enes (r.a.) dedi ki: Katil, (bağlı bulunduğu ve son anda çözülen) kayışını yederek, ev halkının yanına doğru gider vaziyette görüldü. Enes (r.a.) dedi ki; maktulün velîsi galiba katili bağlamıştı. (Müellifin şeyhi) Ebû Umeyr dedi ki: İbn-i Şevzeb, Abdurrah-man bin el-Kâsım'in şöyie söylediğini rivayet etti: Peygamber (Sallallahu Aleyhi ve Seîlem)'den sonra (yâni O'ndan başka) hiç kimse (maktulün velisine): «Katili öldür, şüphesiz sen de (onu öldürürsen) onun mislisin» diyemez. İbn-i Mâceh dedi ki: Bu, Kemlilerin hadîsidir. Yalnız onların yanında bulunur, (onlardan başka hiç kimsenin yanında bulunmaz)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2692,
			"arabicnumber": 2692,
			"text": "Enes bin Mâlik (r.a.)'dan rivayet edildiğine göre şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem)'e arzedilen kısasla ilgili her dâvada O, bağışlamayı emir (yâni teşvik) ederdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2693,
			"arabicnumber": 2693,
			"text": "Ebü'd-Derdâ (r.a.)'den; Şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'den işittim, buyurdular ki; «Vücûdundan bir şey (yâni yaralanma veya bir tarafının kesilmesi) ile başına bir musibet gelip de bunu sadaka eden (yâni hasmını bağışlayıp misillemeden vazgeçen) hiç bir (müslüman) adam yoktur ki, bu (bağışlaması) ndan dolayı Allah onu bir derece yükseltmesin veya bundan dolayı onun bir günahını bağışlamasın.» (Ebü'd-Derdâ demiştir ki): Bu hadîsi iki kulağım işitti ve kalbim iyice hıfzetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2694,
			"arabicnumber": 2694,
			"text": "Muâz bin Cebel, Ebû Ubeyde bin el-Cerrâh, Ubâde bin es-Sâmit ve Şeddâd bin Evs (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kadın teammüden (bir kimseyi) öldürdüğü zaman, hâmile olursa, hamlini bırakıp bebeğini bir bakıcıya teslim edinceye kadar öldürülmez ve hâmile kadın zina ederse, doğum yapıp bebeğini bir bakıcıya teslim edinceye kadar recmedilmez.» Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedinde İbn-i En'üm bulunur. Bunun adı Abdurrahman bin Ziyad bin En'üm olup zayıftır. Kendisinden rivayet eden Abdullah bin Lehia da böyledir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 80
			}
		}
	]
}