{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"22": "The Chapters on Wills"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2695,
			"arabicnumber": 2695,
			"text": "Aişe (r.anha)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) vefat ettiği zaman ne bir dinar (altın), ne bir dirhem (gümüş), ne bir koyun - keçi, ne de bir deve bırakmadı ve (mal ile ilgili) bir şey vasiyyet etmedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2696,
			"arabicnumber": 2696,
			"text": "Talha bin Musarrif'ten rivayet edildiğine göre kendisi şöyle demiştir: Ben Abdullah bin Ebî Evfâ (r.a.)'a: Resulullah (Sallallahu Aleyhi ve Sellem) bir şey vasiyyet etti nü? diye sordum. Abdullah: Hayır, (etmedi) dedi. Ben: Öyle ise O, müslümanlara nasıl vasiyyet etmelerini emretti? dedim. Abdullah: O, Allah'ın Kitâb'ı ile (amel edilmesini) vasiyyet etti, dedi. Mâlik dedi ki: Talha bin Musarrif, el-Huzeyl bin Şürahbîl'in şöyle dediğini söyledi: Ebû Bekir (r.a.), Resulullah (Sallallahu Aleyhi ve Sellem)'in vasîsî (yâni Şîîler'in iddia ettiği gibi) hilâfeti verdiği Ali (r.a.) başında halîfe olmaya (mı) kalkıştı? Ebû Bekir, Resulullah (Sallallahu Aleyhi ve Sellem)'den (herhangi bir sahâbî'nin halifeliği yolunda) bir ahdini bulup da kendini, onun hükmü altına almayı çok arzu etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2697,
			"arabicnumber": 2697,
			"text": "Enes bin Mâlik (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem)'in vefat edeceği son anlarında ruhu boğazına geldiğindeki tüm vasiyyeti: «Namaza (devam ediniz) ve sağ ellerinizin mâlik olduğu şeylere (yâni mallarınızın haklarına ve köleler ile cariyelerinizin haklarına riâyet ediniz)» emri idi. Not: Zevaid'de şöyle denilmiştir: Bunun senedi hasendir. Çünkü Ahmed bin el-Mıkdam Ehl•i Zabtın (yani işittiği hadisleri iyice belleyenlerin) derecesine erişmemişti. Senedin kalan ravileri Buhari ile Müslim'in şartları üzerinedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2698,
			"arabicnumber": 2698,
			"text": "Alî bin Ebî Tâlib (r.a.)'en; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem)'in (vefatı sıralarındaki) son sözü: «Namaza (devam ediniz) ve sağ ellerinizin mâlik olduğu şeylere dikkat ediniz),» emri idi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2699,
			"arabicnumber": 2699,
			"text": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Vasiyyet edeceği bir şeyi bulunup da vasiyyeti, yanında yazılı bulunmadıkça iki gece yatmak müslüman bir kişinin hakkı değildir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2700,
			"arabicnumber": 2700,
			"text": "Enes bin Mâlik (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Mahrum kişi, vasiyyet etmekten mahrum olan kimsedir.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Yezid bin Eban er-Rak. kaşl bulunur, bu ravi zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2701,
			"arabicnumber": 2701,
			"text": "Câbir bin Abdillah (r.a.)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «(Müslümanlardan) kim vasiyyet üzerine (yâni vasiyyet etmiş olarak) ölürse, o kimse (yakışır) bir yol ve sünnette riâyet) üzerine ölmüş olur, takva ve şehâdet üzerine ölmüş olur ve bağışlanmış olarak ölmüş olur.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Bakiyye vardır ki bu zat tedlisçidir. Şeyhi Yezid bin Avf hakkında konuşan kimseyi görmedim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2702,
			"arabicnumber": 2702,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Vasiyyet edeceği bir şeyi bulunup da vasiyyeti yanında yazılı bulunmadıkça iki gece yatmak müslüman bir kişinin hakkı değildir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2703,
			"arabicnumber": 2703,
			"text": "Enes bin Mâlik (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim vârisinin mîrasçıhğı (hakkı) ndan kaçarsa Allah kıyamet günü o kimsenin Cennetten mîrasçılığını keser.» Not: Zevaid'de bunun senedinde Zeyd el-Ammi'nin bulunduğu bildirilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2704,
			"arabicnumber": 2704,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Şüphesiz adam yetmiş yıl hayır ehlinin amelini işler. Sonra vasiyyet ettiği zaman vasiyyetinde zulüm eder, böylece ameli şerle kapanır ve bu yüzden ateşe girer. Şüphesiz adam yetmiş yıl şer ehlinin amelini işler. Sonra vasiyyetini adaletli eder, böylece ameli, hayırla kapanır ve bu nedenle Cennete girer.» Ebû Hureyre (r.a.) (bu hadîsi te'yid etmek üzere) şöyle demiştir: isterseniz; تِلْكُ حُدُودُ اللهِ_ إِلى قَوْلِهِ_ عَذَابٌ مُهِينٌ âyetlerini okuyunuz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2705,
			"arabicnumber": 2705,
			"text": "Kurre (bin Eyâs) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim ki ölümü yaklaşır da vasiyyet eder ve vasiyyeti Allah'ın Kitabı (ndaki esâslar) üzerine olursa o vasiyyet o kimsenin hayatta iken ödemediği zekâtına keffâret olur.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Bakiyye bin el-Velid bulunur. Bu ravi tedIisçi olup bu hadisi an'ane ile rivayet etmiştir. Onun şeyhi Ebu Halbes de meçhüI rayilerdendir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2706,
			"arabicnumber": 2706,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre: Bir adam Peygamber (Sallallahu Aleyhi ve Sellem)'in yanına gelerek: Ya Resûlallah iyi davranmam hususunda üzerimde en çok hakkı bulunan insanın kim olduğunu bana haber ver, dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Evet. Babana and olsun ki muhakkak sana haber verilecektir. (O) annendir,» buyurdu. Adam: Sonra kimdir? diye sordu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Sonra (yine) annendir,» buyurdu. Adam: Sonra kim? diye sordu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Sonra (yine) annen,» buyurdu. Adam: Sonra kim? diye sordu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Sonra baban», buyurdu. Adam (bu kere): Malımdan bana haber ver Ya Resûlallah! Ondan nasıl sadaka vereyim, (en faziletli sadaka nasıl olur)? diye sordu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Peki, Allah'a yemin ederim sen muhakkak haberdar edileceksin. (faziletli tasadduk), sen sıhhatli, ihtiraslı, yaşamaya ümidli ve fakirlikten korkarken sadaka vermendir. Sakın (sadaka vermeyi) geciktirme. Nihayet ruhun (gırtlağa işaretle) şuraya gelince malım falana ve malım fulana (olsun) dersin. Halbuki sen hoşlanmasan bile malın (ölümün dolayısıyla) onlaradır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2707,
			"arabicnumber": 2707,
			"text": "Büsr bin Cahhâş el-Kureşî (r.a.)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) (bir kere) eline (hafifçe) tükürdü. Sonra şehâdet parmağını (tükürük damlası üzerine) bırakıp şöyle buyurdu: «Allah (Azze ve Celle) buyuruyor ki: (Ey) Âdem oğlu seni şunun misli olan (bir damla menliden yarattığım halde beni nasıl âciz (zan) edersin (de malından sadaka ödemezsin)? Sonra ruhun şuraya (ve Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) boğazına işaret etti) ulaştığı zaman sen: Sadaka veririm, dersin. Halbuki sadaka verme zamanı nerede? (Yâni bu fırsatı kaçırdın).»\" Not: Bunun senedinin sahih olduğu, Zevaid'de bildirilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2708,
			"arabicnumber": 2708,
			"text": "Amir'in babası Sa'd (bin Ebî Vakkas) (r.a.)'dan; Şöyle demiştir: Ben Mekke'nin fetih yılı (Mekke'de) ölüme yaklaştığım derecede hastalandım. Resulullah (Sallallahu Aleyhi ve Sellem) hastalığım dolayısıyla bana uğradı. Ben de: Ey Allah'ın Resulü şüphesiz benim çok malım var ve bir kızımdan başka mirasçım yoktur. Ben malımın üçte ikisini sadaka olarak vasiyyet edebilir miyim? diye sordum. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Hayır,» buyurdu. Ben: Yarısı (vasiyyet olabilir mi)? dedim. Resûî-i Ekrem (Sallallahu Aleyhi ve Sellem) (yine); «Hayır,» buyurdu. Ben: Peki üçte biri (olabilir mi) diye sordum. Resül-i Ekrem (Sallallahu Aleyhi ve Sellem): «Üçte bir (kâfidir), üçte bir de çoktur. (Çünkü) senin mirasçılarını zengin bırakman, onları halka ellerini açıp dilenecek derecede fakir bırakmadan hayırlıdır,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2709,
			"arabicnumber": 2709,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Şüphesiz, Allah (hayır) amellerinizi artırmak için mallarınızın üçte birini vefatınız zamanında size tasadduk etti (sadaka - vasiyyet etme yetkisini verdi.)» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Talha bin Amr el-Hadrami bulunur. Bu raviyi zayıf sayanlar bir kişi değildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2710,
			"arabicnumber": 2710,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «(Allah Teâlâ buyurdu ki) Ey Âdem oğlu hiç birisi senin olmayan (ve merhametimle sana verdiğim) iki şey var-. Seni (günahlardan) temizlemek ve arındırmak için, gırtlağını tuttuğum (canını alacağım) zaman malından sana bir pay (vasiyyet için) verdim ve ecelinin bitiminden sonra kullarımın senin üzerine (kıldıkları) cenaze namazı.»' Not: Zevaid'de şöyle denilmiştir: Bunun senedi aleyhinde söz söylenir. çünkü ravilerinden Salih bin Muhammed bin Yahya hakkında ne tenkid ne de başka şekilde herhangi bir kimsenin sözünü görmedim. Rav! Mübarek bin Hassan'ı İbn-i Main sika saymıştır. Fakat Nesai, onun kuvvetli olmadığını. Ebu Davud da onun hadisinin münker olduğunu söylemişlerdir. İbn-i Hibban da onu sikalar arasında anmış ve: Bazen hataya düşer ve muhalefet eder, demiştir. EI-Ezdi de onun hadisinin terkedildiğini söylemiştir. Senedin kalan ravileri Buhari ile Müslim'in şartları üzerinedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2711,
			"arabicnumber": 2711,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: Halkın (vasiyyetlerini) mallarının üçte birinden dörtte birine indirmelerini arzularım. Çünkü Resulullah (Sallallahu Aleyhi ve Sellem); «Sülüs (yâni malın üçte biri vasiyyet için) büyüktür veya çoktur,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2712,
			"arabicnumber": 2712,
			"text": "Amr bin Hârice (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) devesi üzerinde hutbe irâd buyurdu. (Bu esnada) binek devesi geviş getiriyordu ve ağzının köpüğü benim iki omuzumun arasında akıyordu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (hutbesinde) buyurdu ki: «Allah, şüphesiz her mirasçıya mirastan olan nasibini taklim (ve tâyin) buyurdu. Artık hiç bir mirasçıya vasiyyet caiz değildir. Çocuk döşek (sahibin) e aittir. Zina eden (erkeğ)e de mahrumiyet vardır. Kim babasından başka bir kimsenin oğlu olduğunu iddia eder veya kendisini âzadlayanlardan başkasının âzadlısı olduğunu söylerse Allah'ın, meleklerin ve bütün insanların laneti o kimsenin üzerine olsun. O kimseden ne tevbe ne de fidye (râvl dedi ki: veya Peygamber! ne fidye ne de tevbe buyurdu) kabul olunur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2713,
			"arabicnumber": 2713,
			"text": "Ebû Ümâme el-Bâhili (r.a.)'den; Şöyle demiştir: Ben Veda Haccı yılı Resulullah (Sallallahu Aleyhi ve Sellem)'i hutbesinde şöyle buyururken işittim: «Allah her hak sahibine (mirastan) hakkını şüphesiz vermiştir. Artık mirasçıya vasiyyet yoktur.» (Yani mirasçının beli payı dışında bir tasarruf yapılamaz)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2714,
			"arabicnumber": 2714,
			"text": "Enes bin Mâlik (r.a.)'dan; Şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'in devesinin (boynunun) altında idim. Devesinin ağzının köpüğü benim üstüme akıyordu. Resül-i Ekrem (Sallallahu Aleyhi ve Sellem)'den şu buyruğu işittim: «Allah şüphesiz her hak sahibine hakkını vermiştir. Bilmiş olunuz ki hiç bir vârise vasiyyet yoktur.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahihtir. Ravi Muhammed bin Şuayb'ı Rahim ve Ebu Davud sika saymışlardır. Senedin kalan ravileri Buhari'nin şartı üzerinedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2715,
			"arabicnumber": 2715,
			"text": "Alî (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), vasiyyet'dan önce (ölüye ait) borcun ödenmesine hükmetti. Siz; «Edilen vasiyyetten veya borçtan artakalanının...» âyetini de okuyorsunuz. Ve Resul i Ekrem (Sallallahu Aleyhi ve Sellem) ana baba bir erkek kardeşlerin birbirlerine mirasçı olduklarına, fakat (bunların beraberinde bulunan) yalnız baba bir erkek kardeşlerinin mirasçı olmadıklarına da hükmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2716,
			"arabicnumber": 2716,
			"text": "Ebû Hureyre (r.a.)'dan; Şöyle demiştir: Bir adam Resulullah (Sallallahu Aleyhi ve Sellem)'e: Babam öldü. Mal da bırakmıştır. Ve vasiyyet etmemiştir. Onun yerine benim sadaka vermem günahlarına keffâret olur mu? diye sordu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Evet.» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2717,
			"arabicnumber": 2717,
			"text": "Âişe (r.anha)'dan; Şöyle demiştir: Bir adam Peygamber (Sallallahu Aleyhi ve Sellem)'e gelerek: (Yâ Resûlallah!) Annem aniden öldü. Vasiyyet de etmemişti. Zannımca annem konuşabilseydi sadaka (verilmesini vasiyyet) ederdi. Şimdi ben onun adına sadaka verirsem ona da bana da sevap olur mu? diye sordu. Bunun üzerine Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Evet,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2718,
			"arabicnumber": 2718,
			"text": "Amr bin Şuayb'in dedesi (Abdullah bin Amr) (r.a.)'den; Şöyle demiştir: Bir adam Peygamber (Sallallahu Aleyhi ve Sellem)'e gelerek: (Geçimime vesile olacak) hiç bir şey bulamıyorum ve malım (da) yoktur. Malı bulunan bir yetimim vardır, dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «İsraf etmeyerek ve bir sermaye edinmeyerek yetiminin malından ye,» buyurdu. Amr'ın dedesi dedi ki: ve Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem)'in şunu da buyurduğunu zannediyorum: «Ve sen malını yetiminin malıyla koruma.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 24
			}
		}
	]
}