{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"23": "Chapters on Shares of Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2719,
			"arabicnumber": 2719,
			"text": "Ebu Hureyre (r.a.'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Yâ Ebâ Hureyre, Ferâiz (ilmin)i öğreniniz ve öğretiniz. Çünkü ilmin yarısıdır ve bu ilim unutulur. Ümmetimden çekilip çıkarılacak ilk şey bu ilimdir.» Not: Zevaid yazarı şöyle der: Bu hadisi Hakim de el-Müstedrek'te rivayet ederek isnadının sahih olduğunu söylemiştir. Fakat söylediği söze itiraz vakidir. Çünkü senedde itiraz vakidir. Çünkü senedde ismi geçen Hafs bin Ömer'in zayıflığını İbn-i Main. Buhari, Nesai ve Ebu Hatim söylemişlerdir. İbn-i Hibban da: Hiç bir durumda onun rivayetini delil göstermek caiz değildir, demiştir. İbn-i Adiy de: Onun hadisi azdır ve Buhari'nin dediği gibi münkerdir, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2720,
			"arabicnumber": 2720,
			"text": "Cabir bin Abdillah (r.a.)'dan; Şöyle demiştir: (Ensar'ın Hazreç kabilesinden) Sa'd bin er-Rabi (r.a.)'ın karısı (kocası) Sa'd'ın iki kızını Nebi (Sallallahu Aleyhi ve Sellem)'in yanına getirerek: Ya Resulallah! Bunîar Sa'd'ın kızlarıdır. Sa'd, seninle beraber katıldığı Uhud (savaşı) günü şehîd edildi. Bu kızların amcası, Sa'd'ın bıraktığı malın hepsini aldı. Şüphesiz kadın (genellikle) ancak malına tamaen nikahlanır (Yani malı olmayan kadınlara pek rağbet edilmez). Resulullah (Sallallahu Aleyhi ve Sellem) (bu müracaata cevap vermeyip) sustu. Nihayet mîras ayeti indirildi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) Sa'd bin er-Rabi'in erkek kardeşini çağırttı ve: «Sa'd'ın malının üçte ikisini onun iki kızma ver. Karısına da sekizde birini ver. Sen de kalanı al,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2721,
			"arabicnumber": 2721,
			"text": "el-Hüzeyl bin Süıahbîl (r.a.)'den; Şöyle demiştir: Bir adam (Kufe valisi) Ebû Mûsâ el-Eş'arî ile (Kufe kadısı) Selmân bin Rebîa el-Bâhilî (r.a.)'ın yanlarına gelerek, ölen kimsenin bir kızına, bir oğlunun kızına ve ana baba bir tek kız kardeşine ait miras hisselerini sordu. Ebû Mûsâ ile Selmân: Ölünün kızına terekenin yarısı vardır. Kalan (yarısı) da ölünün kız kardeşinedir. (Böylece ölünün oğlunun kızına bir şey yoktur), dediler. (Ebû Mûsâ, soru sahibine:) Sen (Abdullah) bin Mes'ûd'a da git (Ona da sor) O da (kanaatımca) bizim fetvamıza uygun cevap verecektir, dedi. Bunun üzerine adam Abdullah bin Mes'ûd (r.a.)'a giderek meseleyi ona sordu ve Ebû Mûsâ ile Selmân'ın söyledikleri sözleri ona anlattı. Abdullah; Ben onların verdikleri fetvaya uygun cevap verdiğim zaman delâlete gitmiş olurum ve hidâyet üzerinde onlardan olmam. Ve lâkin ben Resulullah (Sallallahu Aleyhi ve Sellem)'in hükmü ile hükmedeceğim. (O da şudur:) ölünün kızına terekenin yarısı var. Ölünün oğlunun kızına, terekenin üçte ikisini tamamlamak üzere altıda bir var. Kalan (üçte biride ölünün kızkardeşinedir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2722,
			"arabicnumber": 2722,
			"text": "Ma’kil bin Yesâr el-Müzenî (r.a.)'den; Şöyle demistir: Nebi (Sallallahu Aleyhi ve Sellem)'den işittim ki (mirasçılar) içinde bir ced (baba babasın)ın bulunduğu bir ferâiz meselesi O'na arz edilmiş ve O, cedd'e üçte bir veya altıda bir hisse vermiştir (buna hükmetmiştir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2723,
			"arabicnumber": 2723,
			"text": "Ma'kil bin Yesâr (r.a.,)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), bizde olan bir cedd(in mirası) hakkında altıda bir hisse ile hükmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2724,
			"arabicnumber": 2724,
			"text": "Kabîsa bin Züeyb (r.a.)'den; Şöyle demiştir: (Sahîh) cedde (Yâni ölünün anne annesi) Ebû Bekir es-Sıddîk (r.a.)'a müracaat ederek mîrasçılık hakkını sormuş, Ebû Bekir de kendisine: Allah'ın kitabında senin (nıîrasçılık hakkın) için bir şey yoktur. Resulullah (Sallallahu Aleyhi ve Sellem)'in sünnetinde (hadîsinde) senin (mirasçılık hakkın) için bir şeyin bulunduğunu da bilmiyorum. Bu itibarla ben (durumu) sahâbilere soruncaya kadar sen git, diye cevap vermiş ve sonra (durumu) sahâbilere sormuştur. (Soruşturma neticesinde) el-Müğîre bin Şu'be (r.a.): Resulullah (Sallallahu Aleyhi ve Sellem) ona (yâni sahîh neneye) altıda bir hisse verirken ben O'nun huzurunda bulundum, demiş. Bunun üzerine Ebû Bekir (r.a.) Müğîre'ye: Senin beraberinde başka şâhid, var mı? diye sorunca Muhammed bin Mesleme el-Ensâri (r.a.) ayağa kalkarak, Müğîre bin Şu'be'nin dediğinin mislini söylemiş. Sonra Ebû Bekir o neneye altıda bir miras hissesinin verilmesine hükmetmiştir. Daha sonra baba tarafından olan diğer nene (yâni ölünün baba annesi) Ömer (r.a.)'a başvurarak mîrasçıhk hakkını sormuştur. Ömer de kendisine: Allah'ın kitabında senin (mirasçılık hakkın) için bir şey yoktur. (Nebi (Sallallahu Aleyhi ve Sellem) ve Ebû Bekir (r.a.) devirlerinde) neneye altıda bir miras hissesine dâir verilen hüküm ancak senden başkası (yâni diğer nene) için idi. Ben miras paylarına bir şey ilâve edici de değilim. Ve lâkin (sahîh) nenenin miras hissesi o südüstür (altıda bir nisbetindeki paydır). Artık bu hissede ikiniz içtima ederseniz bu hisse ikiniz arasmdadır (eşit bölüşürsünüz) İkinizden hangisi tek başına bu hisseye mirasçı olursa bu hisse onadır, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2725,
			"arabicnumber": 2725,
			"text": "(Abdullah) hin Abbâs (r.a.)dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (sahih) neneyi altıda bir hisseye mirasçı kıldı. Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedinde Leys bin Selim vardır. Bu ravi zayıf ve tedlisçidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2726,
			"arabicnumber": 2726,
			"text": "Ma'dan bin Ebî Talha el-Ya'mürî (r.a.)'den] Şöyle demiştir: Ömer bin el-Hattab (r.a.) Cum'a günü hutbe okumak üzere ayağa kalktı veya Cuma günü onlara hutbe okudu. Allah'a hamd ve sena ettikten sonra şöyle dedi: Allah'a yemin ederim ki ben şüphesiz kelale işinden daha Önemli hiç bir şeyi kendimden;, sonraya bırakmıyorum. (Yani arkama bırakacağım en önemli mesele kelale meselesidir). Ben (Kelale meselesini) Resulullah (Sallallahu Aleyhi ve Sellem)'e şüphesiz sordum. Bana karşı bu meselede sert davrandığı kadar hiç bir meselede böyle sert davranmadı. Hatta (bu meseleyi sorduğum zaman) benim yanıma veya göğsüme mübarek parmağıyla dürttü. Sonra: «Ya Ömer! Nisa sûresinin sonunda inen yaz mevsimi ayeti (176. ayet) sana kafidir.» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2727,
			"arabicnumber": 2727,
			"text": "Ömer bin el-Hattâb (r.a.)'den; Şöyle demiştir: Üç mesele vardır ki Resulullah (Sallallahu Aleyhi ve Sellem) onları (açıklamış olsaydı O'nun) açıklaması bana dünyadan ve dünyadaki bütün şeylerden daha sevimliydi: Kelâle, faiz ve hilâfet. Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedindeki raviler sika (güvenilir) zatIardır. Fakat sened munkatidir kopuktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2728,
			"arabicnumber": 2728,
			"text": "Câbir bin Abdillah (r.a.)'dan; Şöyle demiştir: Ben (bir ara) hastalandım. Resulullah (Sallallahu Aleyhi ve Sellem) ve Ebû Bekir (r.a.) birlikte yaya olarak beni hastalığım nedeniyle ziyarete gelmişler. Ben bu esnada baygın imişim. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) abdest almış sonra abdest suyundan bir mikdarını benim üzerime serpmiş. (Ben hemen ayıldım)ve; Yâ Resûlallah! Nasıl yapayım? Malım hakkında nasıl hükmedeyim? dedim. Nihayet Nisa sûresinin sonundaki miras âyeti indi. (Kelâle mirasına dâir Nisa sûresinin 176. ayeti);",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2729,
			"arabicnumber": 2729,
			"text": "Usâme bin Zeyd (r.a.), Nebi (Sallallahu Aleyhi ve Sellem)'den rivayet ettiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) efendimiz: «Müslüman, kâfire mirasçı olamaz ve kâfir de müslümana vâris olamaz» buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2730,
			"arabicnumber": 2730,
			"text": "Usâme bin Zeyd (r.a.)'dan rivayet edildiğine göre, Kendisi: Yâ Resûlallah! Mekke'deki evine mi ineceksin? diye sormuş. Re-sûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Akil (Mekke'de) bize evden, meskenden bir şey mi bıraktı?» diye cevâb vermiştir. Akil ve (kardeşi) Tâlib, (babaları) Ebû Tâlib'e vâris olmuşlardı. (Ebû Tâlib'in diğer oğulları) Ca'fer ve Alî (r.a.) hiç bir şeye mirasçı olmamışlardı. Çünkü (Ebû Tâlib öldüğünde) bunlar müslüman idiler. Akil ile Tâlib ise kâfir idiler. Ömer (r.a.) bunun için diyordu ki: Mu'min, kâfire mirasçı olamaz. Usâme (r.a.) da şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) buyurdu ki: «Müslüman, kâfire mirasçı olamaz. Kâfir de müslümana mirasçı olamaz.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2731,
			"arabicnumber": 2731,
			"text": "Amr bin Şuayb'ın dedesi (Abdullah bin Amr) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur; «İki milletin insanları biribirine mirasçı olamazlar.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2732,
			"arabicnumber": 2732,
			"text": "Amr bin Şuayb'ın dedesi (Abdullah bin Amr) (r.a.)'den; Şöyle demiştir: Riyâb bin Huzeyfe bin Saîd bin Sehm, Ma'mer'in kızı Ümmü Vâil el-Cümehiyye ile evlendi ve ondan üç erkek çocuğu oldu. Sonra çocukların annesi öldü. Oğlan çocuklar, annelerinin bir evine ve annelerinin âzadlılarının velâ hakkına mirasçı oldular. Daha sonra Amr bin el-Âs (r.a.) bu çocukları Şam'a götürdü. Çocuklar Amvâs vebâsında öldüler. Onların asabesi durumundaki Amr (bin el-Âs) onlara mirasçı oldu. Sonra Ma'mer'in oğulları gelip (halife) Ömer (bin el-Hattâb) (r.a.)'a müracaat ederek kızkardeşlerinîn velâ hakkı konusunda Amr'a dâvâcı oldular. Bunun üzerine Ömer (r.a.) : Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'den işittiğim hadîsle aranızda hükmedeceğim. Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'den şöyle buyururken işittim, dedi: «Veled (çocuk) ve vâlid (baba veya annen) in elde ettikleri mîras hakkı, o (çocuğun veya babası ile annesi) nin olan asabesinindir.» Abdullah dedi ki: Ömer (r.a.), (bu hadîse dayanarak) Ümmü vâil'in velâ hakkının bize ait olduğuna hükmetti ve bizim için bu hükme dâir bir yazı verdi. Bu yazıda Abdurrahman bin Avf, Zeyd bin Sabit ve diğer bir zâtın şâhidliği de vardı. Nihayet Abdülmelik bin Mervân halîfe olduğu süre içinde Ümmü Vâil'in bir âzadlısı vefat etti ve iki bin dinar mâras bıraktı da (Ömer tarafından verilen) bu hükmün değiştirildiği haberi bana ulaştı. Ma'mer'in oğulları, yâni Ümmü Vâil'in erkek kardeşleri bu kere (velâ hakkı için) Hişâm bin İsmail'e müracaatla (bize) dâvâcı oldular. Hişâm da bizi (halife) Abdülmelik'e havale etti. Biz de Ömer (r.a.)'in yazılı hükmünü Abdülmelik'e götürdük. Abdülmelik: Ben gerçekten bu hükmün şüphe götürmez hüküm nevinden olduğu görüşünde idim. Medine-i Münevvere halkının durumunun bu hükümde tereddüd edebilecek dereceye ulaştığını sanmıyordum, dedi. Sonra Abdülmelik (de) Ümmü Vâil'in velâ hakkının bize âit olduğuna hükmetti. Biz bu ana kadar bu hakkımıza devam edegeldik",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2733,
			"arabicnumber": 2733,
			"text": "Âişe (r.a.)''den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem)'in bir âzadlı kölesi bir hurma ağacından düşüp vefat etti. Geriye bir mikdar mal bıraktı. Ne çocuğu ne de başkaca yakını vardı. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): «Onun mirasını, köylülerinden bir adam'a veriniz» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2734,
			"arabicnumber": 2734,
			"text": "Hamza (r.a.)'ın kızı (ki Muhammed bin Ebî Leylâ'nın dediğine göre; Abdullah bin Şeddâd'ın ana bir kız kardeşidir) (r.anha)'dan; Şöyle demiştir: Benim bir âzadlı kölem vefat etti ve geriye bir kız bıraktı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) onun malını benim ile kızı arasında taksim etti. Malının yarısını bana, yarısını da onun kızına hükmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2735,
			"arabicnumber": 2735,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) «Katil (öldürdüğü kimseye) mirasçı olamaz,» buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2736,
			"arabicnumber": 2736,
			"text": "Abdullah bin Amr (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Mekke'nin fetih günü ayağa kalkarak şöyle buyurdu: «Kadın, kocasının diyetindan ve malından miras alır ve erkek de karısının diyetinden ve malından miras alır. Bunlardan birisi arkadaşını (yâni eşini) öldürmedikçe, (hüküm budur.) Karı ve kocadan birisi arkadaşını (eşini) kasden öldürdüğü zaman, diyetinden ve malından hiç bir şeye vâris olamaz. Eğer bunlardan birisi arkadaşını yanlışlıkla öldürürse onun malından mîras alır. Fakat diyetinden mîras alamaz.» Not : Zevâid'de şöyle denilmiştir : Bunun senedinde bulunan Muhammed bin Sa'îd, asılarak öldürülen Said'dir. Ahmed : Onun hadîsleri mevzudur, demiştir ve bir defasında da : O, kasden ve bile bile hadis uydururdu, demiştir. Ebû Ahmed el-Hâkim de : O, hadîs uydururdu ve zındıklık suçundan dolayı asıldı, demiştir. El-Hâkim Ebû Abdillah da : O'nun rivayetinin düşüklüğünde ihtilâf yoktur, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2737,
			"arabicnumber": 2737,
			"text": "Ebu Ümâme (Es'ad) bin Sehl bin Huneyf (r.a.)'den rivayet edildiğine göre: Bir adam (başka) bir adama bir ok atarak öldürdü. Öldürülen adamın bir dayıdan başka mirasçısı da yoktu. Ebu Ubeyde bin el-Cerrâh (r.a.) bu adamın miras işini (halîfe) Ömer (r.a.)'a yazılı olarak sordu. Ömer (r.a.), Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur, diye Ebü Ubeyde'ye yazılı cevab verdi: «Allah ve Resulü, hiç bir mirasçısı bulunmayan (müslüman)ın mirasçısıdır. Dayı da hiç mirasçısı bulunmayan (yeğenin) in mîrasçısıdır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2738,
			"arabicnumber": 2738,
			"text": "Resulullah (Sallallahu Aleyhi ve Sellem)'m sahabelerinden olup Şâm halkından olan Mikdâm Ebû Kerîme (bin Madîkerib) (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim (ölüp de) bir mal bırakırsa o mal onun mirasçılarınadır. Ve kim (ölüp de) bir ağırlık (yâni yardıma muhtaç çoluk çocuk ve borç) bırakırsa o ağırlık (işini yüklenmek) bize aittir, (veya: O agırlık Allah'a ve Resulüne aittir, buyurmuştur). Ve ben hiç bir mirasçısı bulunmayanın mîrasçısıyım. Onun yerine diyet veririm ve onun mirasını alırım. Dayı da hiç bir mirasçısı bulunmayanın mîrasçısıdir. Onun yerine diyet öder ve ona mirasçı olur.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2739,
			"arabicnumber": 2739,
			"text": "Alî bin Ebî Tâlib (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), ana baba bir kardeşlerin biribirlerine mirasçı olduklarına, (bunlarla beraber bulunan) yalnız baba bir kardeşlerinin (bunlara) mirasçı olmadıklarına hükmetti. Adam, baba ve anne bir kardeşine mirasçı olur. Fakat o kardeşin (yalnız) baba bir kardeşleri mirasçı olmazlar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2740,
			"arabicnumber": 2740,
			"text": "“... (Abdullah) bin Abbâs (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: malını belirli hisse sahipleri arasında taksim ediniz. Hisselerden artakalanı (ölüye) en yakın erkeğe veriniz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2741,
			"arabicnumber": 2741,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken bir adam öldü ve geriye hiç bir mirasçı bırakmadı. Fakat âzadlamış olduğu bir köle vardı. Bunun üzerine Peygamber (Sallallahu Aleyhi ve Sellem) adamın mirasını o âzadlanmış köleye verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2742,
			"arabicnumber": 2742,
			"text": "Vasile bin el-Eska' (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kadın (şu) üç (çeşit) mirası toplar (alır); Âzadlısı, yolda (terk edilmiş olarak) bulup yetiştirdiği bebek ve üzerine, kocasıyla liânlaştığı çocuğu (onun mirasları).» Muhammed bin Yezîd dedi ki: Bu hadisi Hişâm'dan başkası rivayet etmemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2743,
			"arabicnumber": 2743,
			"text": "Ebû Hureyre (r.a.)den; Şöyle demiştir: Liân âyeti (Nûr 6 - 9) indiği zaman Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: «Hangi kadın (doğurduğu gayri meşru çocuğun kocasından olduğunu ve meşruluğunu iddia etmek suretiyle) bir aileden olmayan bir kişiyi onlara ilhak eder (katar) se o kadının Allah (ın dini veya rahmeti) ile ilgisi yoktur ve Allah onu cennetine sokmayacaktır. Hangi erkek de çocuğunu tanıdığı (yâni kendisinden olduğunu bildiği) halde inkâr eder (yâni kendisinden olmadığını iddia eder) ise Allah kıyamet günü onu (rahmetinden veya cemâlini görmekten) mahrum edecek ve şâhidler (yâni mahşerdekiler')in huzurunda rezîl edecektir.» Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedi zayıftır. Çünkü sened de Yahya bin Harb bulunur. Zehebi, el-Kaşif'te bu ravinin mechul Olduğunu söylemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2744,
			"arabicnumber": 2744,
			"text": "Amr hin Şuayb'ın dedesi (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kişinin, bilmediği bir nesebi iddia etmesi veya iç yüzü mechul olsa bile bir nesebi reddetmesi bir nankörlüktür.» Not: Zevaid'de şöyle denilmiştir: Bu hadis sünenin bazı nüshalarında bulunur, bazısında bulunmaz. El-Müzzi de el-Atraf'ta bu hadisi zikretmemiştir. Bunun senedi sahihtir, Bu hadisin İbnü'l-Kattan'ın ilavelerinden olduğunu sanınm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2745,
			"arabicnumber": 2745,
			"text": "Amr bin Şuayb'ın dedesi (İbn-i Amr el-As) (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kim bir câriye veya hür kadınla zina ederse, ondan olma çocuk, zina çocuğudur. Çocuk (o kimseye) mirasçı olamaz ve kendisine mirasçı olunamaz.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2746,
			"arabicnumber": 2746,
			"text": "Amr bin Şuayb'in dedesi (İbn-i Amr) (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Nisbet edildiği babasının ölümünden sonra ilhak edilmesi istenen çocuk, babası olduğu söylenen adam'ın ölümünden sonra mirasçılarının ilhak iddiasında bulundukları kimsedir.» Resül-i Ekrem (Sallallahu Aleyhi ve Sellem) (bu konuda) şöyle hükmetti: «Adamın cinsel ilişkide bulunduğu zaman mâliki bulunduğu bir cariyeden doğma kimse, onun adamm çocuğu olduğunu iddia eden (mirasçılar)a katılmış olur. Fakat ilhak iddiasından önce (adamın mirasçıları arasında) taksim edilmiş olan miras malından o kimseye bir şey yoktur. Henüz taksim edilmemiş mirastan yetiştiği mikdardan hissesi kendisinedir. Nisbet edildiği babası (hayatta iken) onu inkâr etmiş (yâni çocuğu olmadığını söylemiş) olduğu zaman, artık (mirasçılar ilhak iddiasında bulunsa bile) o kimse mirasçılara katılmaz (ve adamın çocuğu sayılamaz). Eğer çocuk, adamın (cinsel ilişkide bulunduğu zaman) mâlik olmadığı bir cariyeden veya zina ettiği hür bir kadından olsa, (adamın mirasçıları ilhak iddiasında bulunsa bile) çocuk adamın evlâdından sayılamaz ve çocuğa mirasçı olunamaz. Kendisine nisbet edilen adam, çocuğun kendisinden olduğunu iddia etse bile hüküm böyledir. Çünkü o, bir zina çocuğudur, hür veya câriye olan annesinin mirasçılarına katılır.» (Râvi) Muhammed bin Râşid demiştir ki: Hadisteki \"İlhaktan önce taksim edilen miras\" sözü ile İslâm'dan önce, câhiliyet devrinde mirasçılar arasında taksim edilmiş olan mal kasdedilmiştir.\" Not: Zevaid'de şöyle denilmiştir: Bunun senedi hasendir. Bu hadis sünenin bazı nüshalannda bulunur, bazılarında bulunmaz ve eI-Müzzi bu hadisi anmamıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2747,
			"arabicnumber": 2747,
			"text": "(Abdullah) bin Ömer (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), velâ'nın satılmasını ve hibe edilmesini yasaklamıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2748,
			"arabicnumber": 2748,
			"text": "(Abdullah) bin Ömer (r.a.)'dan: Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) velâ'nın satılmasını ve hibe edilmesini yasaklamıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2749,
			"arabicnumber": 2749,
			"text": "Abdullah bin Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Câhiliyet devrinde taksim edilmiş olan miras malı, câhiliyet devrindeki taksim şekli üzerinde (geçerli) dir. İslâmiyet'in yetiştiği miras malı da İslâmiyet'in taksim şekli üzerinde (geçerli)dir.» Not: Zevaid'de şöyle denilmiştir: Ravi İbn-i Lehia'nın zayıflığı nedeniyle bu sened zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2750,
			"arabicnumber": 2750,
			"text": "Câbir (bin Abdillah} (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Bebek (doğduğunda) istihlâl edince (bağırınca veya hayat belirtisi gösterince) cenaze namazı kılınır ve mirasçı olur.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2751,
			"arabicnumber": 2751,
			"text": "Câbir bin Abdillah ve eî-Misver bin Mahreme (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Bebek (doğduğunda) bağırarak istihlâl etmedikçe (ses çıkarmadıkça) mirasçı olmaz.» (Râvî) demiştir ki: Bebeğin istihlâl'ı, ağlaması, bağırması veya aksırmasidır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2752,
			"arabicnumber": 2752,
			"text": "Temin ed-Dârî (r.a.)'den; Şöyle demiştir: Ben (bir defa): Yâ Resûlallah! (Müslüman) adamın elleri üzerine müslümanlığı kabul eden Ehl-i Kitâb'tan olan adam hakkındaki sünnet (şer'i hüküm) nedir? diye sordum. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) buyurdular ki: «(Müslüman) adam, müslümanlığı kabul edene, hayatında ve ölümünde herkesten evlâ (fazla yakın)dır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 34
			}
		}
	]
}