{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"23": "Chapters on Shares of Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2719,
			"arabicnumber": 2719,
			"text": "“... Ebû Hureyre (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : Ebâ Hüreyre, Ferâiz (ilmin)i öğreniniz ve öğretiniz. Çünkü ilmin yarısıdır ve bu ilim unutulur. Ümmetimden çekilip çıkarılacak ilk şey bu ilimdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2720,
			"arabicnumber": 2720,
			"text": "“... Câbir bin Abdillah (radıyallahü anhümâ)’dan; Şöyle demiştir: Hazreç kabilesinden) Sa'd bin er-Rabi (radıyallahü anh)’ın karısı (kocası) Sa'd'ın iki kızını Peygamber (sallallahü aleyhi ve sellem)’in yanına getirerek: Resûlallah! Bunlar Sa'd'ın kızlarıdır. Sa'd, seninle beraber katıldığı Uhud (savaşı) günü şehîd edildi. Bu kızların amcası, Sa'd'ın bıraktığı malın hepsini aldı (yani kızlara hiç bir şey bırakmadı). kadın (genellikle) ancak malına tamaen nikahlanır (Yani malı. olmayan kadınlara pek rağbet edilmez). . Resûlüllah (sallallahü aleyhi ve sellem) (bu müracaata cevap vermeyip) sustu. Nihâyet mîras'a âit; . . . . . . âyeti indirildi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) Sa'd bin er-Rabi’in erkek kardeşini çağırttı ve: malının üçte ikisini onun iki kızına ver. Karısına da sekizde birini ver. Sen de kalanı al, ) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2721,
			"arabicnumber": 2721,
			"text": "“... el-Hüzeyl bin Sürahbîl (radıyallahü anh)’den; Şöyle demiştir : adam (Küfe valisi) Ebû Mûsâ el-Eş'arî ile (Küfe kadısı) Selmân bin Rebîa el-Bâhilî (radıyallahü anhümâ)'nın yanlarına gelerek, ölen kimsenin bir kızına, bir oğlunun kızına ve ana baba bir tek kız kardeşine ait miras hisselerini sordu. Ebû Mûsâ ile Selmân : kızına terekenin yarısı vardır. Kalan (yarısı) da ölünün kız kardeşinedir. (Böylece ölünün oğlunun kızına bir şey yoktur), dediler. (Ebû Mûsâ, soru sahibine:) Sen (Abdullah) bin Mes'ûd'a da git (Ona da sor) O da (kanaatımca) bizim fetvamıza uygun cevap verecektir, dedi. Bunun üzerine adam Abdullah bin Mes'ûd (radıyallahü anh)'a giderek meseleyi ona sordu ve Ebû Mûsâ ile Selmân'in söyledikleri sözleri ona anlattı. Abdullah ; Ben onların verdikleri fetvaya uygun cevap verdiğim zaman delâlete gitmiş olurum ve hidâyet üzerinde onlardan olmam. Ve lâkin ben Resûlüllah (sallallahü aleyhi ve sellem)'in hükmü ile hükmedeceğim. (O da şudur:) ölünün kızına terekenin yarısı var. Ölünün oğlunun kızına, terekenin üçte ikisini tamamlamak üzere altıda bir var. Kalan üçte biride ölünün kızkardeşinedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2722,
			"arabicnumber": 2722,
			"text": "“... Ma'kil bin Yesâr el-Müzenî (radıyallahü anh)’den; Şöyle demiştir: (sallallahü aleyhi ve sellem)’den işittim ki (mirascılar) içinde bir ced (baba babası)nın bulunduğu bir ferâiz meselesi O'na arz edilmiş ve O, cedd'e üçte bir veya altıda bir hisse vermiştir (buna hükmetmiştir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2723,
			"arabicnumber": 2723,
			"text": "“... Ma'kil bin Yesâr (radıyallahü anh)’dan; Şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem), bizde olan bir cedd’in mirası hakkında altıda bir hisse ile hükmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2724,
			"arabicnumber": 2724,
			"text": "“... Kabîsa bin Züeyb (radıyallahü anh)’den; Şöyle demiştir: cedde (Yani ölünün anne annesi) Ebû Bekir es-Sıddîk (radıyallahü anh)'a müracaat ederek mîrasçılık hakkını sormuş, Ebû Bekir de kendisine: kitabında senin (nıîrasçılık hakkın) için bir şey yoktur. Resûlüllah (sallallahü aleyhi ve sellem)'in sünnetinde (hadîsinde) senin (mirasçılık hakkın) için bir şeyin bulunduğunu da bilmiyorum. Bu itibarla ben (durumu) sahâbilere soruncaya kadar sen git, diye cevap vermiş ve sonra (durumu) sahâbilere sormuştur. (Soruşturma neticesinde) el-Müğîre bin Şu'be (radıyallahü anh) : Resûlüllah (sallallahü aleyhi ve sellem) ona (yani sahîh neneye) altıda bir hisse verirken ben O'nun huzurunda bulundum, demiş. Bunun üzerine Ebû Bekir (radıyallahü anh) el-Müğîre'ye: Senin beraberinde başka şâhid, var mı? diye sorunca Muhammed bin Mesleme el-Ensâri (radıyallahü anh) ayağa kalkarak, el-Müğîre bin Şu'be'nin dediğinin mislini söylemiş. Sonra Ebû Bekir o neneye altıda bir miras hissesinin verilmesine hükmetmiştir. sonra baba tarafından olan diğer nene (yani ölünün baba annesi) Ömer (radıyallahü anh)’a başvurarak mîrasçılık hakkını sormuştur. Ömer de kendisine : kitabında senin (mirasçılık hakkın) için bir şey yoktur. (Peygamber (sallallahü aleyhi ve sellem) ve Ebû Bekir (radıyallahü anh) devirlerinde) neneye altıda bir miras hissesine dâir verilen hüküm ancak senden başkası (yani diğer nene) için idi. Ben miras paylarına bir şey ilâve edici de değilim. Ve lâkin (sahîh) nenenin miras hissesi o südüstür (altıda bir nisbetindeki paydır). Artık bu hissede ikiniz içtima ederseniz bu hisse ikiniz arasındadır (eşit bölüşürsünüz) . İkinizden hangisi tek başına bu hisseye mirasçı olursa (yani diğeriniz yok ise) bu hisse onadır, demiştir. \" \". , , (Abdullah) bin Abbâs (radıyallahü anhümâ)'dan; Şöyle demiştir : (sallallahü aleyhi ve sellem) (sahih) neneyi altıda bir hisseye mirasçı kıldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2725,
			"arabicnumber": 2725,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2726,
			"arabicnumber": 2726,
			"text": "“... Ma'dân bin Ebî Talha el-Ya'mürî (radıyallahü anhüm)’den: Şöyle demiştir: bin el-Hattâb (radıyallahü anh) Cuma günü hutbe okumak üzere ayağa kalktı veya Cuma günü onlara hutbe okudu. Allah'a hamd ve sena ettikten sonra şöyle dedi: yemin ederim ki ben şüphesiz kelâle işinden daha önemli hiç bir şeyi kendimden;, sonraya bırakmıyorum. (Yani arkama bırakacağım en önemli mesele kelâle meselesidir). Ben (Kelâle meselesini) Resûlüllah (sallallahü aleyhi ve sellem)’e şüphesiz sordum. Bana karşı bu meselede sert davrandığı kadar hiç bir meselede böyle sert davranmadı. Hattâ (bu meseleyi sorduğum zaman) benim yanıma veya göğsüme mübarek parmağıyla dürttü. Sonra: Ömer! Nisa sûresinin sonunda inen yaz mevsimi âyeti (176. âyet) sana kâfidir. ) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2727,
			"arabicnumber": 2727,
			"text": "“... Ömer bin el-Hattâb (radıyallahü anh)’den; Şöyle demiştir: mesele vardır ki Resûlüllah (sallallahü aleyhi ve sellem) onları (açıklamış olsaydı O'nun) açıklaması bana dünyadan ve dünyadaki bütün şeylerden daha sevimli (olacak)tı: Kelâle, faiz ve hilâfet",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2728,
			"arabicnumber": 2728,
			"text": "“... Câbir bin Abdillah (radıyallahü anhümâ)'dan; Şöyle demiştir: Ben (bir ara) hastalandım. Resûlüllah (sallallahü aleyhi ve sellem) ve Ebû Bekir (radıyallahü anh) birlikte yaya olarak beni hastalığım nedeniyle ziyarete gelmişler. Ben bu esnada baygın imişim. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) abdest almış sonra abdest suyundan bir mikdarmı benim üzerime serpmiş. (Ben hemen ayıldım) ve; Resûlallah! Nasıl yapayım? Malım hakkında nasıl hükmedeyim? dedim. Nihayet Nisa sûresinin sonundaki miras âyeti indi. (Kelâle mirasına dâir Nisa sûresinin); ayeti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2729,
			"arabicnumber": 2729,
			"text": "“... Üsâme bin Zeyd (radıyallahü anhümâ), Peygamber (sallallahü aleyhi ve sellem)’den rivâyet ettiğine göre; Peygamber (sallallahü aleyhi ve sellem) efendimiz: kâfire mirasçı olamaz ve kâfir de müslümana vâris olamaz) buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2730,
			"arabicnumber": 2730,
			"text": "“... Üsâme bin Zeyd (radıyallahü anhümâ)'dan rivâyet edildiğine göre kendisi : Resûlallah! Mekke'deki evine mi ineceksin? diye sormuş. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : (Mekke'de) bize evden, meskenden bir şey mi bıraktı?) diye cevâb vermiştir. Akil ve (kardeşi) Tâlib, (babaları) Ebû Tâlib'e vâris olmuşlardı. (Ebû Tâlib'in diğer oğulları) Ca'fer ve Alî (radıyallahü anhümâ) hiç bir şeye mirasçı olmamışlardı. Çünkü (Ebû Tâlib öldüğünde) bunlar müslüman idiler. Akil ile Tâlib ise kâfir idiler. (radıyallahü anh) bunun için diyordu ki: Mü'min, kâfire mirasçı olamaz. ... Üsâme (radıyallahü anh) da şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem) buyurdu ki: kâfire mirasçı olamaz. Kâfir de müslümana mirasçı olamaz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2731,
			"arabicnumber": 2731,
			"text": "“... Amr bin Şuayb'ın dedesi (Abdullah bin Amr bin el-Âs) (radıyallahü anhüm)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur ; milletin insanları biribirine mirasçı olamazlar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2732,
			"arabicnumber": 2732,
			"text": "“... Amr bin Şuayb'ın dedesi (Abdullah bin Amr bin el-Âs) (radıyallahü anhüm)'den; Şöyle demiştir: bin Huzeyfe bin Saîd bin Sehm, Ma'mer'in kızı Ümmü Vâil el-Cümehiyye ile evlendi ve ondan üç erkek çocuğu oldu. Sonra çocukların annesi öldü. Oğlan çocuklar, annelerinin bir evine ve annelerinin âzadlılarının velâ hakkına mirasçı oldular. Daha sonra Amr bin el-Âs (radıyallahü anh) bu çocukları Şam'a götürdü. Çocuklar Amvâs vebâsında öldüler. Onların asabesi durumundaki Amr (bin el-Âs) onlara mirasçı oldu. Sonra Ma'mer'in oğulları gelip (halife) Ömer (bin el-Hattâb) (radıyallahü anh)'a müracaat ederek kız kardeşlerinîn velâ hakkı konusunda Amr'a dâvâcı oldular. Bunun üzerine Ömer (radıyallahü anh) : Resûlüllah (sallallahü aleyhi ve sellem)’den işittiğim hadîsle aranızda hükmedeceğim. Ben, Resûlüllah (sallallahü aleyhi ve sellem) 'den şöyle buyururken işittim, dedi: (çocuk) ve vâlid (baba veya annen) in elde ettikleri mîras hakkı, o (çocuğun veya babası ile annesi) nin olan asabesinindir. ) dedi ki: Ömer (radıyallahü anh), (bu hadîse dayanarak) Ümmü Vâil'in velâ hakkının bize ait olduğuna hükmetti ve bizim için bu hükme dâir bir yazı verdi. Bu yazıda Abdurrahman bin Avf, Zeyd bin Sabit ve diğer bir zâtın şâhidliği de vardı. Nihayet bin Mervân halîfe olduğu süre içinde Ümmü Vâil'in bir âzadlısı vefat etti ve iki bin dinar mâras bıraktı da (Ömer tarafından verilen) bu hükmün değiştirildiği haberi bana ulaştı. Ma'mer'in oğulları, yani Ümmü Vâil'in erkek kardeşleri bu kere (velâ hakkı için) Hişâm bin İsmail'e müracaatla (bize) dâvâcı oldular. Hişâm da bizi (halife) Abdülmelik'e havale etti. Biz de Ömer (radıyallahü anh)'in yazılı hükmünü Abdülmelik'e götürdük. Abdülmelik: gerçekten bu hükmün şüphe götürmez hüküm nevinden olduğu görüşünde idim. Medine-i Münevvere halkının durumunun bu hükümde tereddüd edebilecek dereceye ulaştığını sanmıyordum, dedi. Abdülmelik (de) Ümmü Vâil'in velâ hakkının bize âit olduğuna hükmetti. Biz bu ana kadar bu hakkımıza devam edegeldik. \" - . . Âişe (radıyallahü anha)'dan; Şöyle demiştir : (sallallahü aleyhi ve sellem)'in bir âzadlı kölesi bir hurma ağacından düşüp vefat etti. Geriye bir mikdar mal bıraktı. Ne çocuğu ne de başkaca yakını vardı. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) : mirasını, köylülerinden bir adama veriniz) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2733,
			"arabicnumber": 2733,
			"text": "“... (Abdullah) bin Abbâs (radıyallahü anhümâ)’dan: Şöyle demiştir : (sallallahü aleyhi ve sellem) hayatta iken bir adam Öldü ve geriye hiç bir mirasçı bırakmadı. Fakat âzadlamış olduğu bir köle vardı. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) adamın mirasını o âzadlanmış köleye verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2734,
			"arabicnumber": 2734,
			"text": "“... (Peygamber (sallallahü aleyhi ve sellem)'in amcası) Hamza (radıyallahü anh)'ın kızı (ki Muhammed bin Ebî Leylâ'nın dediğine göre; Abdullah bin Şeddâd'ın ana bir kız kardeşidir) (radıyallahü anha)'dan; Şöyle demiştir : bir âzadlı kölem vefat etti ve geriye bir kız bıraktı. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) onun malını benim ile kızı arasında taksim etti. Malının yarısını bana, yarısını da onun kızına hükmetti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2735,
			"arabicnumber": 2735,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2736,
			"arabicnumber": 2736,
			"text": "“... Abdullah bin Amr (bin el-As) (radıyallahü anhümâ)’dan; Şöyle demiştir : (sallallahü aleyhi ve sellem) Mekke'nin fetih günü ayağa kalkarak şöyle buyurdu. kocasının diyeti (kan bahası) ndan ve malından miras alır ve erkek de karısının diyetinden ve malından miras alır. Bunlardan birisi arkadaşını (yani eşini) öldürmedikçe, (hüküm budur. ) Karı ve kocadan birisi arkadaşını (eşini) kasden öldürdüğü zaman, diyetinden ve malından hiç bir şeye vâris olamaz. Eğer bunlardan birisi arkadaşını yanlışlıkla öldürürse onun malından mîras alır. Fakat diyetinden mîras alamaz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2737,
			"arabicnumber": 2737,
			"text": "“... Ebû Ümâme (Es'ad) bin Sehl bin Huneyf (radıyallahü anh) 'den rivâyet edildiğine göre : adam (başka) bir adama bir ok atarak öldürdü. Öldürülen adamın bir dayıdan başka mirasçısı da yoktu. Ebû Ubeyde bin el-Cerrâh (radıyallahü anh) bu adamın miras işini (halîfe) Ömer (radıyallahü anh)’a yazılı olarak sordu. Ömer (radıyallahü anh), Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur, diye Ebü Ubeyde'ye yazılı cevab verdi: ve Resulü, hiç bir mirasçısı bulunmayan (müslüman)ın mirasçısıdır. Dayı da hiç mirasçısı bulunmayan (yeğenin) in mîrasçısıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2738,
			"arabicnumber": 2738,
			"text": "“... Resûlüllah (sallallahü aleyhi ve sellem)'in sahabelerinden olup Şâm halkından olan Mikdâm Ebû Kerîme (bin Madîkerib) (radıyallahü anh)’den rivâyet edildiğine göre Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : (ölüp de) bir mal bırakırsa o mal onun mirasçılarınadır.) kim (ölüp de) bir ağırlık (yani yardıma muhtaç çoluk çocuk ve borç) bırakırsa o ağırlık (işini yüklenmek) bize aittir, (veya: O ağırlık Allah'a ve Resulüne aittir, buyurmuştur). Ve ben hiç bir mirasçısı bulunmayanın mîrasçısıyım. Onun yerine diyet veririm ve onun mirasını alırım. Dayı da hiç bir mirasçısı bulunmayanın mîrasçısıdir. Onun yerine diyet öder ve ona mirasçı olur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2739,
			"arabicnumber": 2739,
			"text": "“... Alî bin Ebî Tâlib (radıyallahü anh)’den; Şöyle demiştir: (sallallahü aleyhi ve sellem), ana baba bir kardeşlerin biribirlerine mirasçı olduklarına, (bunlarla beraber bulunan) yalnız baba bir kardeşlerinin (bunlara) mirasçı olmadıklarına hükmetti. Adam, baba ve anne bir kardeşine mirasçı olur. Fakat o kardeşin (yalnız) baba bir kardeşleri mirasçı olmazlar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2740,
			"arabicnumber": 2740,
			"text": "“... (Abdullah) bin Abbâs (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: malını belirli hisse sahipleri arasında taksim ediniz. Hisselerden artakalanı (ölüye) en yakın erkeğe veriniz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2741,
			"arabicnumber": 2741,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2742,
			"arabicnumber": 2742,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2743,
			"arabicnumber": 2743,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den; Şöyle demiştir: âyeti (Nûr sûresinin 6 - 9. âyetleri) indiği zaman Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu : kadın (doğurduğu gayri meşru çocuğun kocasından olduğunu ve meşruluğunu iddia etmek suretiyle) bir aileden olmayan bir kişiyi onlara ilhak eder (katar) sa o kadının Allah (in dini veya rahmeti) ile ilgisi yoktur ve Allah onu cennetine sokmayacaktır. Hangi erkek de çocuğunu tanıdığı (yani kendisinden olduğunu bildiği) halde inkâr eder (yani kendisinden olmadığını iddia eder) ise Allah kıyamet günü onu (rahmetinden veya cemâlini görmekten) mahrum edecek ve şâhidler (yani mahşerdekiler)in huzurunda rezîl edecektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2744,
			"arabicnumber": 2744,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2745,
			"arabicnumber": 2745,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) (Katil (öldürdüğü kimseye) mirasçı olamaz,) buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2746,
			"arabicnumber": 2746,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2747,
			"arabicnumber": 2747,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2748,
			"arabicnumber": 2748,
			"text": "“... (Abdullah) bin Ömer (radıyallahü anhüma)'dan: Şöyle demiştir : (sallallahü aleyhi ve sellem) velâ'nın satılmasını ve hibe edilmesini yasaklamıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2749,
			"arabicnumber": 2749,
			"text": "“... Abdullah bin Ömer (radıyallahü anhümâ)'dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: , - devrinde taksim edilmiş olan miras malı, câhiliyet devrindeki taksim şekli üzerinde (geçerli) dir. İslâmiyet'in yetiştiği miras malı da İslâmiyet'in taksim şekli üzerinde (geçerli)dir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2750,
			"arabicnumber": 2750,
			"text": "“... Câbir (bin Abdillah) (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (doğduğunda) istihlâl edince (bağırınca veya hayat belirtisi gösterince) cenaze namazı kılınır ve mirasçı olur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2751,
			"arabicnumber": 2751,
			"text": "“... Câbir bin Abdillah ve el-Misver bin Mahrama (radıyallahü anhüm)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : (doğduğunda) bağırarak istihlâl etmedikçe (ses çıkarmadıkça) mirasçı olmaz. ) demiştir ki: Bebeğin istihlâl'ı, ağlaması, bağırması veya aksırmasidır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2752,
			"arabicnumber": 2752,
			"text": "“... Temini ed-Dârî (radıyallahü anh)’den; Şöyle demiştir: (bir defa) : Yâ Resûlallah! (Müslüman) adamın elleri üzerine müslümanlığı kabul eden Ehl-i Kitâb'tan olan adam hakkındaki sünnet (=şer'i hüküm) nedir? diye sordum. Resûl-i Ekrem (sallallahü aleyhi ve sellem) buyurdular ki: adam, müslümanlığı kabul edene, hayatında ve ölümünde herkesten evlâ (fazla yakın)dır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 34
			}
		}
	]
}