{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"25": "Chapters on Hajj Rituals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2882,
			"arabicnumber": 2882,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2883,
			"arabicnumber": 2883,
			"text": "El-Fadl bin Abbâs veya Abdullah bin Abbâs (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: Hacc'a gitmek isteyen kimse acele etsin. Çünkü bazen kişi hastalanır, binit hayvanı kaybolur ve (hacca gitmeyi engelleyici) iş peyda olur (meydana gelir).\" Not: Zevâid'de şöyle denilmiştir : Bunun senedinde İsmail Ebû Halife Ebû İsrâîl el-Melai bulunur. İbn-i Adi onun hakkında: Onun rivayet ettiği hadislerin hepsi sıka, rivayetlerine aykırıdır, demiş. Nesâi de onun zayıf olduğunu söylemiş ve Cürcâni onun müfteri ve doğru yoldan sapmış kişi olduğunu söylemiştir. Evet; «Kim hacc'a gitmek isterse acele etsin» hadisini başka bir senedle Hâkim rivayet etmiş ve hadisin sahih oldujunu söylemiştir. Ebû Dâvûd da onun gibi o hadisi rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2884,
			"arabicnumber": 2884,
			"text": "Ali (r.a.)'den; Şöyle demiştir: \"Oraya yol bulabilen insanlara Allah için Ka'be'yi hac etmeleri farzdır.\" (Âl-i îmrân; 97) âyeti inince sahâbîler; Yâ Resûlallah! Hac her yılda (farz nı)? dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) sustu. Sonra sahâbîler! Her yılda mı (hac etmek farz kılındı) ? diye sordular. Bunun üzerine Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Hayır. Eğer ben evet deseydim (her yıl hac etmek) vâcib olurdu,» buyurdu. Bunun akebinde; Ey imân edenler! Size açıklanırsa hoşunuza gitmeyecek şeyleri sormayınız\" (Mâide 101.) âyeti indi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2885,
			"arabicnumber": 2885,
			"text": "Enes bin Mâlik (r.a.)'dan rivayet edildiğine göre sabâbîler: Yâ Resûlallah! Hacc'a gitmek her yılda (mı farzdır)? dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (onlara cevaben): «Eğer ben evet deseydim (her yıl hac etmek) vâcib olurdu, vâcib olsaydı bunu ifâ edemezdiniz ve ifâ etmeseydiniz tazîb edilirdiniz.» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bu sened salıihtir. çünkü Muhammed bin Ebi Ubeyde bin Maan bin Abdirrahman bin Abdillah bin Mes'üd sika'dır. Babası da onun mislidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2886,
			"arabicnumber": 2886,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: El-Akra bin Habis, Nebi (Sallallahu Aleyhi ve Sellem)'e: Yâ Resûlallah! Hac her yıl (mı) veya (hayatta) bir defa (mı farzdır), diye sordu? Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (buna cevaben): «Hac, her yıl değil, (hayatta) bir defa farzdır. Bundan sonra kim (birden fazla hac) yapabilirse o (fazla hac) nafiledir» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2887,
			"arabicnumber": 2887,
			"text": "Ömer (bin el-Hattâb) (r.a.)'dan rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle -buyurmuştur: Hac ve Umre'yi ard arda yapınız. Çünkü bunları ard arda yapmak demirci körüğü demirin kirini, pasını giderdiği gibi fakirliği ve günahları giderir. Ebu Bekir bin Ebî Şeybe ... senediyle de Peygamber (Sallallahu Aleyhi ve Sellem)'in bu hadisinin mislini (yine) Ömer bin el-Hattab (r.a.)'den bize rivayet etti. Not: Zevaid'de şöyle denilmiştir: Bu iki senedin dönüm noktası ravi Asım bin Ubeydillah'tır. Bu ravi zayıftır. Bu metin İbn-i Mes'üd (r.a.)'ın hadisi olarak sahlhtir. Tirmizi ve Nesa!, İbn-i Mes'üd'un hadisini rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2888,
			"arabicnumber": 2888,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Umre, kendisiyle diğer Umre arasındaki (zaman içinde işlenen küçük) günahlara keffarettir. Mebrûr (yâni makbul) hacc'ın mükafatı ancak cennet (e dahil olmak) tır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2889,
			"arabicnumber": 2889,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim bu beyt'i (Ka'be-yi) hac eder de (bu ibadet süresince) cinsel ilişki, şehvanî lâflar ve günah işlemezse o kimse (günahlardan temizlenip) annesinin kendisini doğurduğu (günkü) duruma dönüşür.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2890,
			"arabicnumber": 2890,
			"text": "Enes bin Mâlik (r.a.)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) eski bir palan ve dört dirhem eder veya etmez bir örtü üstünde hac yolculuğu etti ve: «Allahım! (Bu), riyasız ve gösterişsiz bir hac'dır,» dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2891,
			"arabicnumber": 2891,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: Biz Resulullah (Sallallahu Aleyhi ve Sellem) ile beraber Mekke ve Medine arasında (hac yolculuğu ediyor) idik. (Yolculuk esnasında) bir dereden geçtik. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): — Bu, hangi deredir, diye sordular. Sahâbîler (r.a.) : El-Ezrak deresidir, dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): Musa (Sallallahu Aleyhi ve Sellem) iki parmağını (n uçlarını) iki kulağına koyup yüksek sesle telbiye etmek suretiyle Allah'a niyaz ederek bu dereden geçerken gözümün önündedir, buyurdu (ve Musa'nın saçlarının uzunluğunu anlattı. Fakat râvî Dâvûd anlatılanı iyice hatırlamıyor). İbn-i Abbâs demiş ki: Sonra bu yolculuğumuza devam ettik. Nihayet bir dağ yolunun (veya bir dağ geçitinin) üstüne vardık. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (orada da) : Bu, hangi dağ yolu (veya geçiti)dir? buyurdu. Sahâbiler (r.a.): (Bu), Herşâ veya Lift yolu (veya geçitlidir, dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) : Yûnus (Aleyhisselâm) kırmızı bir deve üstünde, yünden mamul bir cübbe giymiş, devesinin yuları hurma lifinden örülü ince bir sicim olduğu halde telbiye okuyarak bu dereden geçerken gözümün önündedir, buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2892,
			"arabicnumber": 2892,
			"text": "Ebu Hureyre (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem): «Hacca gidenler ve Umre'ye gidenler Allah'ın elçileridir. Onlar Allah'a duâ ederlerse, Allah dualarını kabul eder ve onlar Allah'tan günahlarının bağışlanmasını isterlerse Allah onların günahlarını bağışlar, buyurmuştur.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Salih bin Abdillah var. Buharİ onun hadislerinin münker olduğunu söylemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "(Abdullah) bin Ömer (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Allah yolunda savaşa giden, hacca giden ve Umre'ye giden kimseler Allah'ın elçileridir. Allah bunları davet etti, bunlar da Onun dâvetine icabet ettiler ve bualar Allah'tan dilekte bulundular, Allah da onlara dilediklerini verdi.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi hasen'dir. Ravİ İmran'ın sıkalığı, ihtilaflıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2894,
			"arabicnumber": 2894,
			"text": "Ömer (bin el-Hattâb) (r.a.)'den rivayet edildiğine göre: (Bir kere) kendisi Umre'ye gitmek için Nebi (Sallallahu Aleyhi ve Sellem)'den izin istedi. Peygamber de kendisine izin verdi ve ona şöyle buyurdu: «Ey kardeşciğim! Sen duanın bir parçasına bizi ortak et ve bizi unutma.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2895,
			"arabicnumber": 2895,
			"text": "Ebü'd-Derdâ'nın damadı Safvân bin Abdillah bin Safvân (r.a.)'den rivayet edildiğine göre: Kendisi (Şam'a giderek) Ebü'd-Derdâ'nın evine varmış ve (evde) Ümmü'd-Derdâ (r.aanhâ)'yı bulmuş, Ebü'd-Derdâ (r.a.)'ı bulamamış. Ümmü'd-Derdâ kendisine: Sen bu yıl hacc'a (mı) gideceksin? demiş. Kendisi de: Evet, demiş. Bunun üzerine Ümmü'd-Derdâ (r.anha) demiş ki: O halde Allah'a bizim için hayır duâ et. Çünkü Nebi (Sallallahu Aleyhi ve Sellem) : «(Müslüman) kişinin (din) kardeşi için gıyabında ettiği duâ makbuldür. O kişinin baş ucunda, duasına âmin, diyen bir melek bulunur. O kişi (din) kardeşine hayır duâ ettikçe melek: Amîn, (din kardeşin için istediğin) hayrın aynı senin için de olsun, der,» buyurdu. Safvân demiş ki: Sonra ben çarşıya çıktım ve Ebü'd-Derdâ'ya rastladım. O da bu hadîsin aynını Nebi (Sallallahu Aleyhi ve Sellem) 'den bana rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2896,
			"arabicnumber": 2896,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre: Bir adam Resulullah (Sallallahu Aleyhi ve Sellem)'in huzurunda ayağa kalkarak: Yâ Resûlallah! Hacc'ı vâcib kılan (şart) nedir? dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «(Hacc'ın vâcib olmasının şartı) azık ve binittir,» buyurdu. Adam: Yâ Resûlallah! Hacı(nın vaziyeti) nedir? dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «(Hacı, çeşitli sıkıntılar nedeniyle) vücûdu kirli ve güzel kokuları kullanmayı bırakandır,» buyurdu. Başka bir adam ayağa kalkarak: Yâ Resûlallah! Hacetin belirtisi) nedir? dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Acc ve sece'dir» buyurdu. (Râvi Vekî demiş ki: Acc'dan maksad, Telbiyeyi yüksek sesle okumak ve Sece'den maksad (kurbanlık) develeri boğazlamaktır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2897,
			"arabicnumber": 2897,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) , (Âl-i İmrân sûresinin 97. âyetinde geçen); «Onun (yâni Ka'be'nin) yoluna gücü yetenler» buyruğun (daki güç) ten maksad azık ve binittir, buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "Ebû Saîd(-i Hudrî) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kadın, üç günlük ve daha fazla mesafeye yolculuk edemez. Meğer ki babası, erkek kardeşi, oğlu, kocası veya mahremi olan (başka) bir erkeğin beraberinde ola.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2899,
			"arabicnumber": 2899,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Allah'a ve âhiret gününe inanan hiç bir kadına, beraberinde mahremi olan bir erkek bulunmadığı halde tek bir günlük mesafeye yolculuk etmesi helâl değildir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2900,
			"arabicnumber": 2900,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan rivayet edildiğine göre (bir gün) bir bedevi, Nebi (Sallallahu Aleyhi ve Sellem)'in yanına gelerek: (Yâ Resûlallah!) Ben şöyle şöyle bir savaşa (katılmak için) yazıldım. Halbuki, karım hacc'a gitmek üzeredir, (Ne buyurulur?) dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (Adama): «O halde sen karınla beraber hacc'a gitmek üzere geri dön, buyurdu.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2901,
			"arabicnumber": 2901,
			"text": "Âi§e (r.anha)'dan rivayet edildiğine göre; Şöyle demiştir: Ben (bir defa): Yâ Resûlallah! Kadınlara (farz olan) bir cihâd var (mı?) dedim. Resûl-i Ekrem (Sallallauü Aleyhi ve Sellem): «Evet. Onlar üzerine çarpışmasız bir cihâd vardır: Hac ve Umre,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2902,
			"arabicnumber": 2902,
			"text": "Ümmü Seleme (r.anha)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Hac, zayıf olan her (müslüman) kişinin cihâdıdır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2903,
			"arabicnumber": 2903,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (bir defa) bir adamı = \"Allahım ben Şübrüme yerine senin emrine amadeyim, çağrına icabet ettim\" duasını okurken işitti ve bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) (adama) : Şübrüme kimdir?» buyurdu. Adam: — Benim bir yakınımdır, diye cevab verdi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): Sen (kendi nefsin için) hiç hac ettin mi?» diye sordu. Adam: Hayır, dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): Şu halde sen bu hacc'ı kendi nefsin için yap, sonra Şübrüme yerine hac ibâdetini yap,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2904,
			"arabicnumber": 2904,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: Bir adam (bir gün) Nebi (Sallallahu Aleyhi ve Sellem)'in yanına gelerek: (Yâ Resûlallah!) Ben babam yerine hac etmek isterim (Ne buyurulur?), dedi. Resul i Ekrem (Sallallahu Aleyhi ve Sellem): «Evet. Baban yerine hac et. Çünkü sen onun yerine hac etmekle onun hayrını artırmazsan şerrini arttırmış olmazsın,» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahihtir. Seneddeki Süleyman, İbn-i Feyruz Ebu İshak künyeli olan Süleyman'dır, sika bir ravidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2905,
			"arabicnumber": 2905,
			"text": "Ebü'l-Ğavs bin Husayn (bu zât, el-Fur' kabilesinden bir adamdır) (r.a.)'den rivayet edildiğine göre: Kendisi, hac etmeden ölen babasının zimmetinde olan bir hac (ibâdeti borcu) hakkında Nebi (Sallallahu Aleyhi ve Sellem)'e fetva sordu. Nebi (Sallallahu Aleyhi ve Sellem): Baban yerine hacc'a git, buyurdu ve Nebi (Sallallahu Aleyhi ve Sellem) şöyle de buyurdu: Adak orucu da böyledir, (zimmetinde adak orucu bulunan) ölü yerine bu oruç kaza edilir. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Osman bin Ata. el-Hurasani bulunur. İbn-i Main onu zayıf saymıştır. Onun hadislerinin münker olduğu ve rivayetlerinin bırakıldığı da söylenmiştir. El-Hakim de: Bu ravi, babasından bir takım mevzü hadisler rivayet etmiş, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2906,
			"arabicnumber": 2906,
			"text": "Ebû Rezîn (Lakît bin Âmir) el-Ukaylî (r.a.)'den rivayet edildiğine göre: Kendisi Nebi (Sallallahu Aleyhi ve Sellem)'in yanına gelerek: Yâ Resûlallah! Babam çok yaşlıdır, ne hacc'a ne Umre'ye ne de yolculuk etmeye (bedenen) gücü yetmez (Ne buyurulur?), demiş. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (de Ebû Rezîn'e): «Sen baban yerine hac ve umre et,» buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2907,
			"arabicnumber": 2907,
			"text": "Abdullah bin Abbâs (r.a.)'dan; Şöyle demiştir: (Veda hacc'ı esnasında) Has'am (kabilesin) den bir kadın Nebi (Sallallahu Aleyhi ve Sellem) 'in yanına gelerek: Yâ Resûlallah! Benim babam cidden çok yaşlı, ihtiyardır, bunamıştır. Allah'ın kullarına farz kıldığı hac babama da erişmiş (yâni farz olmuş) tur. Halbuki bu farizayı edâ etmeye (bedenen) gücü yetmez (binek hayvanı üstünde duramaz). Onun yerine hac farizasını benim ifâ etmem ona kâfi gelir mi? diye sordu. Resulullah (Sallallahu Aleyhi ve Sellem): «Evet,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2908,
			"arabicnumber": 2908,
			"text": "Husayn bin Avf (r.a.)'den: Şöyle demiştir: Ben (bir kere): Yâ Resûlallah! Babama hac (farizası) erişti. Halbuki babamın hacc'a bedenen gücü yetmez, meğer ki binit üstünde bağlana, dedim. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) bir saat sustu. Sonra: «Babana bedel olarak sen hacc'a git,» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedinde Muhammed bin Kureyb bulunur. Ahmed: Bu ravinin hadisleri münkerdir, Husan bin Avf (r.a.)'den acalb hadisler getirir, demiştir. Buhari de: Onun hadisleri münkerdir. rivayetlerlne itıraz vardır, demiştir. Müteaddid zatlar onun zayıflığını söylemişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2909,
			"arabicnumber": 2909,
			"text": "İbn-i Abbâs'ın kardeşi el-Fadl (bin Abbâs) (r.a.)'den rivayet edildiğine göre: Kendisi (Veda hacc'ında) Kurban bayramının ilk günü sabahı Nebi (Sallallahu Aleyhi ve Sellem)'in redif'i idi (Yâni Nebi s.a.v.'in devesinin arkasına binmişti). Bir ara Has'am (kabilesin) den bir kadın Nebi (Sallallahu Aleyhi ve Sellem)'in yanına vararak: Yâ Resülallah! Allah'ın kulları üzerinde hac hususundaki farizası babama çok yaşlı ve ihtiyar hâlinde erişti (Yâni babama bu halde iken hac farz oldu). Babam (hayvana) binemez (deve üstünde duramaz) haldedir. Ben ona bedel olarak hac edebilir miyim? diye sordu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): Evet, (edebilirsin!) Çünkü eğer babanın zimmetinde bir (kul) borcu olsaydı sen onu öderdin,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2910,
			"arabicnumber": 2910,
			"text": "Câbir bin Abdillah (r.a.)'dan Şöyle demi§tir: Bir hac (yolculuğun) da bir kadın bir çocuğunu Nebi (Sallallahu Aleyhi ve Sellem)'e arz ederek: Yâ Resulallah! Bu çocuk için hac (fazileti) var mı? diye sordu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Evet. Senin için de bir sevâb vardır,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2911,
			"arabicnumber": 2911,
			"text": "Aişe (r.anha)'dan; Şöyle demiştir: (Üvey annem) Esma bint-i Umeys (el-Has'amiyye) (r.a.) (Zü'l-Huleyfe mescidi yanındaki) eş-Şecere'de (ihrama gireceği sırada) doğum yaptı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem)'in emri üzerine (Esma'nın kocası) Ebû Bekir (r.a.), Esmâ'ya bütün vücûdunu yıkayıp ihrama girmesini emretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2912,
			"arabicnumber": 2912,
			"text": "Ebû Bekir (es-Sıddîk) (r.a.)'dan rivâyel edildiğine göre: Kendisi Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde hac etmek üzere (Medine-i Münevvere'den yola) çıktı. Ebû Bekr'in yanında (zevcesi) Esma' bint-i Umeys de bulunuyordu. Esma (Zü'l-Huleyfe mescidi yanındaki) eş-Şecere'de Muhammed bin Ebî Bekr'i doğurdu. Bunun üzerine Ebû Bekir (r.a.), Nebi (Sallallahu Aleyhi ve Sellem)'in yanına giderek durumu O'na arz etti. Resulullah (Sallallahu Aleyhi ve Sellem) de Esmâ'ya şu talimatı vermeyi Ebû Bekir (r.a.)'e emretti-. Esma' bütün vücûdunu yıkayacak, sonra hac niyetiyle ihrama girecek ve herkesin yaptığı hac menâsikini yapacak. Ancak (kandan temizleninceye kadar) Ka'be'yi tavaf etmeyecektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2913,
			"arabicnumber": 2913,
			"text": "Câbir (bin Abdillah) (r.a.)'dan rivayet edildiğine göre: Esma bint-i Umeys (r.a.) (hac ihramına gireceği sırada) Muhammed bin Ebi Bekr'i doğurdu. Bunun üzerine Esma (ne yapacağını öğrenmek için) Nebi (Sallallahu Aleyhi ve Sellem)'e haber gönderdi. Nebi (Sallallahu Aleyhi ve Sellem) o'na vücûdunun tamamını yıkamasını, (kan akmasını engellemek üzere) bir bez parçasını avret mahalline sıkıca bağlamasını ve ihrama girmesini emretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2914,
			"arabicnumber": 2914,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem): Medine (-i Münevvere) halkı Zu'l-Huleyfe'den, Şam halkı Cuhfe'den ve Necid halkı Karn'den (hac veya umre niyetiyle) ihram'a girerler (yâni girsinler), buyurdu. Abdullah (bin Ömer) demiş ki: Bu üç (mîkat)'ı ben (bizzat) Resulullah (Sallallahu Aleyhi ve Sellem)'den işittim. Resulullah (Sallallahu Aleyhi ve Sellem)'in; Yemen halkı da Yelemlem'den ihrama girerler (girsinler), buyurduğu haberi bana ulaştı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2915,
			"arabicnumber": 2915,
			"text": "Câbir (bin Abdillah) (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) bize bir hutbe okudu. (Hutbede) Medine (i Münevvere) halkının ihrama girecekleri yer Zu'l-Huleyfe'den başlar. Şâm halkının ihrama girecekleri yer, Cuhfe'den başlar. Yemen halkının ihrama girecekleri yer Yelemlem'den başlar. Necid halkının İhrama girecekleri yer Karn'den başlar. (yâni Irak) halkının ihrama girecekleri yer Zât ı Irk'dan başlar, buyurdu. Sonra (mübarek) yüzünü (doğu tarafındaki) ufuka çevirdi ve: «Allahım! Onların (yâni doğu halkının) gönüllerini (İslâmiyet'e) yönelt,» diye duâ etti. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde İbrahim el-Hariri bulunur. Ahmed ve başkası onun hadislerinin metruk olduğunu söylemişler. Bir kavle göre onun hadisleri münkerdir. Onun zayı! olduğu da söylenmiştir. Bu hadism aslını Müslim, Cabir (r.a.)'den rivayet etmiş, fakat o rivayette ...döndürdü ... \" cümlesiyle başlayan parağrafı söylememiş ve Şam halkının mikatını da anlatmamıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2916,
			"arabicnumber": 2916,
			"text": "(Abdullah) bin Ömer (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) ayağını özengiye sokup devesi ayağa kalkarak doğrulunca Zu'l-Huleyfe mescidinin yanından itibaren yüksek sesle telbiyeı okudu (yâni o zaman ihrama girdi)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2917,
			"arabicnumber": 2917,
			"text": "Enes bin Mâlik (r.a.)'den; Şöyle demiştir: (Zu'I-Huleyfe'deki) ağacın yanında ben Resulullah (Sallallahu Aleyhi ve Sellem)'in (bindiği) devesinin sefineleri (yâni çökük iken yere gelen uzuvları) nin yanıbaşında idim. Deve ayağa kalkıp doğrulunca Resûi-i Ekrem (Sallallahu Aleyhi ve Sellem): AlIahım! Hac ve umre'yi beraber etmekle dâvetine icabet ediyorum, emrine amadeyim\" buyurdu (yâni o zaman ihrama girdi). Bu (ihrama giriş işi) Veda hacc'ında oldu. Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahih, ravileri de sika zatlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2918,
			"arabicnumber": 2918,
			"text": "(Abdullah) bin Ömer (r.a.)'dan; Şöyle demiştir: Ben telbiye'yi Resulullah (Sallallahu Aleyhi ve Sellem)'lin mübarek ağzından aldım (belledim), O şöyle buyuruyordu: Lebbeyk Allahümme Lebbeyk, Lebbeyk la şerik'e leke Lebbeyk, inne'l-Hamde ve'n-ni'mete leke ve'l-mülk. La şerike lek. (îbn-i Ömer'in râvîsi) Nâfi' demiş ki: İbn-i Ömer (r.a.), Nebi (Sallallahu Aleyhi ve Sellem)'in telbiyesine şunu ekliyordu: Lebbeyke, Lebbeyke, Lebbeyke ve sa'deyke ve'I-hayru fi yedeyke Lebbeyke Ve'-r-Rağbâu ileyke ve'I-amel",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2919,
			"arabicnumber": 2919,
			"text": "Cabir (bin Abdillah) (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem)'in telbiyesi şöyle idi: Lebbeyk Allahümme Lebbeyk Lebbeyk Lâ şerike leke Lebbeyk. İnne'l-hamde ve'n-ni'mete leke ve'l-mulk. Lâ Şerike Iek",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2920,
			"arabicnumber": 2920,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) , telbiyesinde şöyle (de) demiştir: Lebbeyk İlâhe'l-hakki Lebbeyk = Senin dâvetine icabet ediyorum, (Ey) hakkın ilâh'ı! Senin emrini yerine getirmeye hazırım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2921,
			"arabicnumber": 2921,
			"text": "Sehl bin Sa'd es-Sâidî (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) §Öyle buyurmuştur: «Herhangi bir mülebbi (telbiye zikrini okuyucu) lebbeyke zikrini okuduğu zaman onun sağında ve solunda bulunan taş, ağaç ve kerpiç de lebbeyke zikrini eder. (Resûl-i Ekrem (Sallallahu Aleyhi ve Sellemî doğuya ve batıya işaret ederek) Yer küresi şuradan ve şuradan bitinceye kadar (bulunan bu maddeler lebbeyke zikrini ederler).»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2922,
			"arabicnumber": 2922,
			"text": "Hallâd bin es-Sâib'in babası (es-Sâib bin Hallâd el-Ensârî) (r.a.)'dan rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Cebrail (Aleyhisselâm) bana gelerek, ashabımın Telbiye'yi yüksek sesle okumalarını onlara emretmemi bana emretti.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2923,
			"arabicnumber": 2923,
			"text": "Zeyd bin Hâîid el-Cühenî (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Cebrail (Aleyhisselâm) bana gelerek: Yâ Muhammed! Ashabına emret Telbiye'yi yüksek sesle okusunlar. Çünkü telbiye (yüksek sesle okumak) hacc'ın alâmetlerindendir, dedi.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2924,
			"arabicnumber": 2924,
			"text": "Ebû Bekr-i Sıddîk. (r.a.)'den rivayet edildiğine göre: (Hacc'a âit) amellerin hangisinin efdal olduğu, Resulullah (Sallallahu Aleyhi ve Sellem)'e soruldu. O, şöyle cevab verdi: «Telbiye'yi yüksek sesle okumak ve kurbanlıkların kanını akıtmak.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2925,
			"arabicnumber": 2925,
			"text": "Câbir bin Abdillah (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Allah rızâsı için gününü akşama kadar güneş altında geçiren hiç bir muhrim (hac veya umre ihramında bulunan kimse) yoktur ki günahları güneşle beraber batmasın (bağışlanmasın) ve annesinin kendisini doğurduğu (günkü günahsız) hâle dönüşmesin.» Not: Zevaid'de şöyle denilmiştir: Ravilerden Asım bin Ubeydillah ve Asım bin Ömer bin Hafs zayıf oldukları için bu sened zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2926,
			"arabicnumber": 2926,
			"text": "Aişe (r.anha)'dan rivayet edildiğine göre şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'i ihram'a girmeden önce ihramı için ve ifâda (ziyaret) tavafı etmeden önce ihram'dan çıkması için güzel koku ile kokuladim. (Râvi) Süfyân (kendi rivayetinde, Âişe'nin şu sözünü de ilâve ederek): \"Bu iki elimle'' demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2927,
			"arabicnumber": 2927,
			"text": "Âişe (r.anha)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) telbiye getirirken (mübarek) başında bulunan ıtrin (yâni sürülen güzel kokunun) parıldaması hâlâ gözümün önündedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2928,
			"arabicnumber": 2928,
			"text": "Âişe (r.anha)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) ihram'a girdikten üç gün sonra ve ihramda iken (mübarek) başında ıtrin parıldamasını sanki hâlâ görüyorum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2929,
			"arabicnumber": 2929,
			"text": "Abdullah bin Ömer (r.a.)'dan rivayet edildiğine göre: Bir adam, Nebi (Sallallahu Aleyhi ve Sellem)'e: İhramda olan kimse elbiselerden ne giyebilir? diye sordu. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: «Ne gömlekler, ne sarıklar, ne donlar, ne bornozlar ne mestler giyer. Ancak na'leyn bulamadığı zaman mestler giysin ve (mest giyeceği zaman) bunları topuklarının aşağısına kadar kessin. Ve (siz ihramda iken) za'feran veya vers (bitkisi) ile boyanmış (veya kokulanmış) hiç bir elbise giymeyiniz.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2930,
			"arabicnumber": 2930,
			"text": "Abdullah bin Ömer (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) ihramda olan kimsenin vers veya za'feran (bitkisi) ile boyanmış bir elbiseyi giymesini yasaklamıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2931,
			"arabicnumber": 2931,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: Ben, Nebi (Sallallahu Aleyhi ve Sellem) (Arafat'ta) hutbe okurken (râvi Hişâm dedi ki: \"Minber üzerinde\" hutbe okurken) dinledim. O, (hutbesinde): (İhrâmlılardan) kim izâr (yâni belden aşağı sarılan peştemalimsi elbise) bulamazsa bir don giysin ve kim na'leyn bulamazsa mestler giysin, buyurdu. Râvi Hişâm hadîsin baş kısmının kendi rivayetinde; \"izâr bulamayan kimse bir don giysin. Don bulamaması hâil müstesna\" şeklinde olduğunu söylemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2932,
			"arabicnumber": 2932,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «(İhrâmlılardan) kim na'leyn bulamazsa mestler giysin ve mestleri topuk kemiklerinin aşağısına kadar kessin.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2933,
			"arabicnumber": 2933,
			"text": "Esma bint-i Ebi Bekir (r.a.)'dsn; Şöyle demiştir: Biz, Resulullah (Sallallahu Aleyhi ve Sellem) ile beraber (Veda haccı yolculuğuna) çıktık. Nihayet biz el-Arc (kasabasın)a varınca konakladık. Resulullah (Sallallahu Aleyhi ve Sellem) oturdu ve Âişe O'nun yanında oturdu. Ben de (babam) Ebû Bekr-i Siddik'ın yanında oturdum. Bizim azığımızı ve yol eşyamızı taşıyan deve ile Ebû Bekir (r.a.)'in yol eşyasını ve azığını taşıyan deve bir tane idi ve Ebû Bekir (r.a.)'in hizmetçisinin beraberinde idi. (Biz onun gelmesini bekliyorduk) Esmâ'nın râvîsi demiştir ki, sonra hizmetçi çıkıp geldi. Beraberinde devesi yoktu. Bunun üzerine Ebû Bekir hizmetçiye : Deven nerededir? diye sordu. Hizmetçi: Onu dün gece kaybettim, dedi. Ebû Bekir (r.a.): Senin beraberinde bir tek deve bulunur sen onu kaybedersin? dedi. Esmâ'nın râvisi demiş ki: Sonra Ebû Bekir hizmetçiyi dövmeye başladı. Resulullah (Sallallahu Aleyhi ve Sellem) de: «Şu ihrâmlıya bakın ne yapıyor,» buyuruyordu (ve gülümsüyordu)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2934,
			"arabicnumber": 2934,
			"text": "Abdullah bin Huneyn'den rivayet edildiğine göre: Abdullah bin Abbas ile Misver bin Mahreme (r.a.), Ebvâ mevkiinde (ihrâmlı kimsenin başını yıkaması hususunda) ihtilafa düştüler. Abdullah bin Abbâs (r.a.}: İhrâmlı kimse başını yıkayabilir, dedi- Misver (r.a.): İhrâmlı kimse başını yıkayamaz, dedi. Bu ihtilâf üzerine İbn-i Abbâs beni meseleyi Ebü Eyyûb el-Ensâri'ye sormak üzere gönderdi. Ben Ebû Eyyûb'u bir kuyunun iki direği arasında başını yıkamak üzere iken buldum. Ebü Eyyûb bir elbise ile örtünüyordu. Kendisine selâm verdim. Kim o? diye sordu. Ben: Abdullah bin Huneyn'im. Beni Abdullah bin Abbâs size gönderdi. Resulullah (Sallallahu Aleyhi ve Sellem) ihramda iken başını nasıl yıkardı? sorusunu size arz ediyorum, dedim. Abdullah bin Huneyn demiştir ki: Bunun üzerine Ebü Eyyûb-i Ensârî elini kendisini örten elbise üzerine koydu ve başı (tamamıyla) bana görününceye kadar elbiseyi (başından göğsüne kadar) indirdi. Sonra üzerine su dökmek için bekleyen adama: (su) dök diye emretti. Adam onun başına su döktü. Sonra Ebû Eyyûb elleriyle başını oğuşturup ellerini kâh ileri kâh geri götürdü ve daha sonra şöyle dedi: Resulullah (Sallallahu Aleyhi ve Sellem)'in böyle yaptığını (yâni başını böylece yıkadığını) gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2935,
			"arabicnumber": 2935,
			"text": "Âişe (r.anha)'dan; Şöyle demiştir: Biz ihramda olduğumuz halde Nebi (Sallallahu Aleyhi ve Sellem)'in beraberinde idik. Erkek kervanı bize rastladığı zaman baş örtümüzü başımızın üstünden (yüzümüze) salardık. Kervan bizi geçince biz baş örtümüzü yukarıya kaldırır (yüzümüzü açar) dik",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2936,
			"arabicnumber": 2936,
			"text": "Ebû Bekir bin Abdillah bin Zübeyr'in nenesi (râvî demiştir ki: Nenesi sözcüğü ile Esma bint-i Ebî Bekir'in mi, Su'dâ bint-i Avfra mı kasdedildiğini bilemiyorum) (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem), Dubâa bint-i (Zübeyr bin) Abdulmuttalib (r.a.)'nın yanına girdi ve: Yâ halam! Seni hacc'a gitmekten alakoyan mâni nedir? diye sordu. Dubâa: Ben hasta bir kadınım ve hastalığımın hac menâsikini tamamlamama engel olmasından korkarım, dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) ona: «Sen ihrama gir ve hac ibadetini ikmâl etmekten (hastalık gibi bir sebeble) alakonulduğun yerde İhramdan çıkmanı şart koş,» buyurdu. Not: Zevaid'de şöyle denilmiştir: Su'da bint-i Avf (r.a.)'ın bundan başka hadlsi müellif (İbn-i Mace)'nin yanında yoktur. Kütüb-i Sitte'nin kalanlarında onun hiç bir hadisi yoktur. Bu hadis onun müsnedlerindendir. Bu hadisin senedinde Ebu Bekir bin AbdiIlah bulunur. Bu ravi'nin tenkidi veya güvenilirliği hakkında konuşan kimseyi görmedim. Senedin kalan ravileri sika zatlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2937,
			"arabicnumber": 2937,
			"text": "Dubâa (bînt-i Zübeyr bin Abdilmuttalib) (r.a.)'dan rivayet edildiğine göre şöyle demiştir: Ben hasta iken Resulullah (Sallallahu Aleyhi ve Sellem) yanıma girdi ve (bana): Sen bu yıl hacc'a gitmek istemiyor musun? buyurdu. Ben: Yâ Resûlallah! Ben cidden hastayım, dedim. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Sen hacc'a git ve (ihrama girerken) de ki: (Allahım!) Beni hac menâsikinî ikmâl etmekten (hastalık gibi bir sebeble) alakoyduğun yerde ihramdan çıkacağım, buyurdu.» Not: Zevaid'de şöyle denilmiştir: Bunun senedindeki raviler. sahih'in ravlleridir. Dubaa (r.a.)'ın üçten fazla hadisi yoktur. Bu hadisini yalnız musannefimiz rivayet etmiştir. Ebu Davud da onun bir hadisini rivayet etmiş, diğer hadisini de Nesaİ rivayet etntiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2938,
			"arabicnumber": 2938,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: Dubâa bint-i Zübeyr bin Abdilmuttalib (r.a.) (bir kere) Resulullah (Sallallahu Aleyhi ve Sellem)'in yanma gelerek: Ben vücûdunda ağırlık bulunan bir kadınım ve ben cidden hacc'a gitmek istiyorum. Bu durumda, hac niyetiyle nasıl ihrama gireyim? dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) ona: «Sen hac niyetiyle ihrama gir ve (ihrama girerken Allahım!) Beni hac menâsikini ikmâl etmekten (hastalık gibi bir sebeble) alakoyduğun yerde ihramdan çıkacağım, diye şart koş,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2939,
			"arabicnumber": 2939,
			"text": "Abdullah bin Abbâs (r.a.)'dan; Şöyle demiştir: Peygamberler Harem (-i Şerife) yaya ve yalın ayak olarak girerlerdi. Yalın ayak ve yaya olarak Beyt-i Şerifi tavaf edip menâsik'i (yâni hac ve umre ibâdetini bu şekilde) ifâ ederlerdi. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Mübarek bin Hassan bulunur. Bu raviyi İbn-i Main sıka saymış ise de Nesai: O, kuvvetli değil, demiş ve Ebü Davüd da onun hadisinin münker olduğunu söylemiştir. İbn-İ Hibban da sika raviler bahsinde onun bazen hata edip muhalefet ettiğini söylemiştir. EI-Ezdi de onun terkedilmiş olduğunu söylemiştir. Seneddeki ravilerden İsmail'e gelince İbn-i Hibban onu sikalar arasında anmıştır. Senedin kalan ravileri sika zatlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2940,
			"arabicnumber": 2940,
			"text": "(Abdullah) bin Ömer (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Mekke'ye \"Seniyye-i Ulyâ\" yolundan girerdi ve Mekke'den çıkmak istediği zaman \"Seniyye-i Süflâ\" yolundan çıkardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2941,
			"arabicnumber": 2941,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) Mekke'ye gündüz girmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2942,
			"arabicnumber": 2942,
			"text": "Usâme bin Zeyd (r.a.)'dan; Şöyle demiştir: Ben, (Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem)'e): Yâ Resûlallah! Yarın (Mekke'de) nereye ineceksin, (evinize mi)? diye sordum. Bu soruyu sormak O'nun (Veda) haccı sırasında idi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): Akîl (Mekke'de) bize mesken bıraktı mı? buyurdu. Sonra: (înşâallah) biz yarın Kinâne oğullarının yurduna (yâni el-Muhassab'a) ineceğiz. Kureyş (müşrikleri) küfür üzerine bu yerde ahd etmişlerdi. Bu ahid ve andIaşma Kinâne oğulları ile Kureyş (müşrikleri) arasında Hâşim oğulları (ve Muttalib oğulları) aleyhine: \"Bunlarla kız alıp vermemek, alış veriş etmemek üzere\" akdedilmişti. (Hâşimîlerle Muttalibiler, Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem)'i Kureyş ile Kinâne'ye itaat etmeye ikna edinceye kadar bu akid devam edecekti.) (Râvi) el-Ma'mer demiş ki: Zührî, el-Hayf'ın dere olduğunu söyledi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2943,
			"arabicnumber": 2943,
			"text": "Abdullah bin Sercis (r.a.)'dan: Şöyle demiştir: Ben Usaylı' (yâni başının saçı dökülmüş olan) Ömer bin el-Hattâb (r.a.)'i Hacer-i Esved'i öperken ve şöyle söylerken gördüm: (Ey Hacer-i Esved)! Ben senin bir taş olduğunu, (aslında kimseye) ne zarar, ne de yarar sağlayamayacağını çok iyi bildiğim halde şüphesiz seni öpüyorum. Eğer ben Resulullah (Sallallahu Aleyhi ve Sellem)'in seni öptüğünü görmeseydim seni öpmezdim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2944,
			"arabicnumber": 2944,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demştir: Resulullah (Sallallahu Aleyhi ve Sellem) buyurdular: «And olsun ki şu Hacer(-i Esved) kıyamet günü gören gözleri ve konuşan dili olduğu halde (mahşere) şüphesiz gelecek ve onu hakkıyla istilâm eden (yâni Allah'a itaat ve Resulüne uymak üzere ziyaret eden mu'min) kimseler lehinde şâhidlik edecektir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2945,
			"arabicnumber": 2945,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) Hacer(-i Esved)'e karşı durdu. Sonra mübarek dudaklarını onun üzerine bırakıp uzun süre ağladıktan sonra ondan ayrıldı. Baktı ki Ömer (bin el-Hattâb) O'nun yanında ağlıyor. Bunun üzerine buyurdular ki: Yâ Ömer! Göz yaşları burada dökülür (dökülmelidir). Not: Zevâid'de şöyle denilmiştir : Bunun senedinde Muhammed bin Avn el-Horasâni vardır. Onu İbn-i Muin, Ebû Hatam ve başkaları zayıf saymışlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2946,
			"arabicnumber": 2946,
			"text": "Sâlim'in babası (İbn-i Ömer) (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Ka'be'nin köşelerinden yalnız siyah köşeyi (yâni Hacer-i Esved'in bulunduğu köşeyi) ve Cumhîlerin evlerinin tarafından o köşeyi tâkib eden köşeyi (yâni Rükn-i Yemânîyi) istilâm ederdi (mübarek elini sürerdi)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2947,
			"arabicnumber": 2947,
			"text": "Safiyye bint-i Şeybe (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Mekke'nin fetih yılı (fetih işini tamamlamakla) sükûnete kavuşunca devesi üzerinde Ka'be'yi tavaf etti. Hacer-i Esved'i de mıhcen ile istilâm etti. Sonra Ka'be-i Muazzama'nın içine girdi. Orada aydan (denilen hurma ağacından mamul) güvercin suretinde bir put buldu. O'nu kırdıktan sonra Ka'be'nin kapısında durup kırdığı putu (dışarı) attı. Ben de O'na bakıyordum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2948,
			"arabicnumber": 2948,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) Veda hacc'ında bir deve üzerinde tavaf etti. Hacer-i Esved'i de bir mıhcen ile istilâm ediyordu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2949,
			"arabicnumber": 2949,
			"text": "Ebü't-Tufeyl Amir bin Vasile (r.a.)'den; Şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i devesi üzerinde Kabe'yi tavaf ederken, mıhcen (denilen değneği) île Hacer-i Esved'i istilâm ederken ve mihcen'i (istilâmdan sonra) öperken gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2950,
			"arabicnumber": 2950,
			"text": "(Abdullah) bin Ömer (r.a.)'dan: şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (Mekke'ye geldiğinde) Ka*be'yi ilk tavaf ettiği zaman Hacer-i Esved'den (tekrar) Hacer-i Esved'e (varıncaya) kadar (ilk) üç turda hızlıca ve (diğer) dört turda normal yürürdü. (Râvi Nâfi demiştir ki:) İbn-i Ömer (r.a.) da öyle yapardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2951,
			"arabicnumber": 2951,
			"text": "Câbir (bin Abdillah) (r.a.)'dan rivayet edildiğine güre: Nebi (Sallallahu Aleyhi ve Sellem) (kudum tavafında) Hacer-i Esved'den (tekrar) Hacer-i Esved'e (varıncaya) kadar (ilk) üç turda hızlıca ve (diğer) dört turda normal yürüdü",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2952,
			"arabicnumber": 2952,
			"text": "Ömer (bin el-Hattâb) (r.a.)'den Şöyle demiştir: Allah Teâlâ İslâmiyet'i kökleştirip küfrü ve mensublarını yok ettiği halde tavafta hızlı yürümek şu anda nedendir? (Ama) Allah'a yemin olsun ki, Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken yapmış olduğumuz bir şeyi terketmeyiz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2953,
			"arabicnumber": 2953,
			"text": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) Hudeybiye (andlaşmasın)dan sonra umre (yolculuğu esna)sında ashabına Mekke'ye girmek istedikleri zaman: Sizin kavminiz (yâni Mekke müşrikleri) şüphesiz yarın (Mekke'de) sizi göreceklerdir. Onlar sizleri güçlü, şiddetli görsünler, buyurdu. Sonra Resül-i Ekrem (Sallallahu Aleyhi ve Sellem) ile ashabı Mescid-i Haram'a girdikleri zaman Hacer-i Esved'i istilâm ettiler ve (tavafta) hızlı yürüdüler. Nebi (Sallallahu Aleyhi ve Sellem) de onlarla beraber idi. Nihayet Rükn-i Yemânî'ye ulaştıkları zaman (hızlı yürümeyi bırakıp oradan Hacer-i Esved'in bulunduğu) siyah köşeye kadar normal yürüdüler. Sonra (Hacer-i Esved köşesinden) Rürkn-i Yemânî'ye ulaşıncaya kadar hızlı yürüdüler. Oradan Hacer-i Esved köşesine kadar normal yürüdüler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) üç defa (yâni tavafın üç turunda) böyle yaptı. Sonra (kalan) dört turda normal yürüdü",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2954,
			"arabicnumber": 2954,
			"text": "Ya'Iâ (bin Ümeyye et-Temîmî) (r.a.)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) ıztıbâ'lı olarak tavaf etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2955,
			"arabicnumber": 2955,
			"text": "Âîşe (r.anha)'dan; Şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'e Hicr-i (ismail'in Ka'be'den olup olmadığını) sordum. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): O, Ka'be'den (bir parça)dır, buyurdu. Ben: Kureyş'in Hicrt-i İsmail)'i Ka'be'ye idhâl etmelerine engel olan şey ne idi? diye sordum. Resûl-î Ekrem (Sallallahu Aleyhi ve Sellem): Kureyş'in bütçesi Hicr(-i İsmail)'i Ka'be'ye dâhil etmeye yetmedi, (bu yüzden Ka'be'yi daralttılar) diye cevab verdi. Ben: Peki, Ka'be'nin kapısı niçin bu kadar yüksektir, ancak bir merdivenle kapıya çıkılabilir? diye sordum. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): O, senin kavminin işidir. Dilediklerini Ka'be'ye dâhil etmek, dilediklerini de oraya sokmamak içindir. Eğer senin kavminin küfüre yakınlıkları (müslümanhğa girişlerinin yeniliği), gönüllerinin kırılması endişesi olmasaydı Ka'be'nin bir parçası olup (dişarıda bırakılan) noksan kısmını Ka'be'ye eklemek üzere onda bir değişiklik yapmaya gücümün yetip yetmeyeceğine bakacaktım ve kapısını zemin seviyesine indirecektim, buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2956,
			"arabicnumber": 2956,
			"text": "Abdullah bin Ömer (r.a.}dan; Şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'den şöyle buyururken işittim: «Kim Ka'be'yi tavaf eder ve iki rekât namaz kılarsa bir rakabe (köle veya câriye) yi azadlamış gibi sevabı olur.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2957,
			"arabicnumber": 2957,
			"text": "Humeyd bin Ebî Sevîyye'den; Şöyle demiştir: Atâ bin Ebî Rabâh Ka'be'yi tavaf ederken İbn-i Hişâm (r.a.)'in kendisine şöyle soru sorduğuna ve kendisinin şöyle cevab verdiğine şâhid oldum: İbn-i Hişâm (r.a.) ; Rükn-i Yemânîlnin fazileti) hakkında (bilgi verir misin? diye) sordu. Atâ bin Ebî Rabâh (r.a.): Ebû Hureyre (r.a.), Nebi (Sallallahu Aleyhi ve Sellem)'in (Rükn-i Irâki'nin fazileti hakkında) şöyle buyurduğunu bana rivayet etti, dedi: Rükn-i Yemânî yanında 70 melek görevlendirilmiştir. Kim orada; \"Allahım şüphesiz ben senden afıv, dünyada ve âhirette afiyet (selâmet) dilerim. Ey Rabbımız bize dünyâda iyiyi, âhirette de iyiyi ver ve bizi ateşin azabından koru\" diye dua ederse o melekler âmin, derler.» Atâ bin Ebı Rabâh Hacer-i Esved'in bulunduğu köşe'ye ulaşınca İbn-i Hişâm (ona): Yâ Ebâ Muhammed! Şu Hacer-i Esvedtin fazileti) hakkında sana ne (bilgi) ulaşmış? diye sordu. Bunun üzerine Atâ: Ebü Hureyre (r.a.), Resulullah (Sallallahu Aleyhi ve Sellem)'den (Hacer-i Esved'in fazileti hakkında) şöyle buyurduğunu işittiğini bana rivayet etti, dedi: ''Kim Hacer-i Esved'e yönelirse şüphesiz o kimse Rahman'a yönelmiş (yâni O'na bey'at ve ahıd) etmiş olur.» İbn-i Hişâm, Atâ bin Ebi Rabâh'a: Yâ Ebâ Muhammed! Tavaf('ın fazileti hakkında işittiğin) nedir? dedi. Atâ: Ebû Hureyre (r.a.), Resulullah (Sallallahu Aleyhi ve Sellem)'den (tavaf hakkında) şöyle buyurduğunu işittiğini bana rivayet etti, dedi: Kim Ka'be'yi yedi defa tavaf eder ve (tavaf esnasında): \"Ailah'ın her nevî noksanlıklardan pâk ve nezih olduğuna inanırım. Hamd Allah'a mahsustur. Allah'tan başka ilâh yoktur ve Allah (her şeyden) büyüktür. Günahlardan dönüş ve ibâdete güç ancak Allah'ın yardımıyladır\" sözünden başka bir şey (yâni dünya ile ilgili bir lâf) konuşmazsa, onun on günahı silinir, onun için on hasene (sevabl yazılır ve bu ibâdet sayesinde onun mertebesi on derece yükselir. Kim de tavaf eder ve tavaf esnasında (dünya ile ilgili) konuşursa, (yalnız) ayakları suya batan kimse gibi onun (yalnız) ayakları rahmete batar, (yâni vücûdunun kalan kısmı rahmete batmaz).\" Not; Zevâid'de şöyle denilmiştir: Sened, bu hadisin Zevâid nevinden olduğuna delâlet eder. Fakat Zevâid yazarı bu sened hakkında bir şey söylememiştir. Sindi bu bilgiyi verdikten sonra: Ed-Dümeyri bu hadîsin mahfuz olmadığına delâlet eden bazı bilgiler nakletmiş tir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2958,
			"arabicnumber": 2958,
			"text": "El-Muttalİb (bin Ebî Vedâa es-Sehmî) (r.a.)'den; Şöyle, demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i şöyle yaparken gördüm: Ka'be'yi yedi defa tavaf edince gelip Hacer-i Esved'in hizasında durdu. Sonra tavaf sahasının kenarında iki rek'at namaz kıldı ve (namaz kılarken) kendisi ile tavaf edenler arasında (sütre olarak) hiç kimse yoktu. İbn-i Mâceh dedi ki: Bu durum (yâni sütresiz namaza durmak ve namazın önünden geçmek) Mekke'ye mahsustur. Diğer Tahric edenler: Ebu Davud, menasik; Nesâî, menâsik; Ahmed b. Hanbel, VI, 399; Beyhakî, es-Sünenü'l-kübrâ, II, 273",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2959,
			"arabicnumber": 2959,
			"text": "(Abdullah) hin Ömer (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (Mekke'ye) geldi. Ka'beyi yedi defa tavaf ettikten sonra iki rek'at namaz kıldı. (Râvi Veki' demiş ki : Yâni İbrahim'in makamı yanında,) Sonra (sa'y için) Safâ'ya çıktı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2960,
			"arabicnumber": 2960,
			"text": "Câbir (bin Abdillah) (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Ka'be'yi tavaf işini bitirince (tavaf namazı için) İbrahim'in makamına geldi. Bunun üzerine Ömer (bin el-Hattâb) (r.a.): Yâ. Resülallah! Burası Allah Sübhâne'nin; \"ibrahim'in makamı yanında namaz için bir yer edinin\" [Bakara 125] buyurduğu babamız İbrahim'in makamıdır, dedi. (Râvi) el-Velîd demiş ki: Ben Mâlik (bin Enes)'e Râvi bu âyeti; وَاتَّخِذُوا مِنْ مَقَامَ إِبْرَاهِيمَ مُصَبَّى şeklinde (mi) okudu? diye sordum. Mâlik (r.a.): Evet, diye cevab verdi. (Yâni âyetteki fiil mazi şeklinde değil emr-i muhatab fiilidir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2961,
			"arabicnumber": 2961,
			"text": "Ümmü Seleme (r.anha)'dan rivayet edildiğine göre: Kendisi hastalanmış, bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem)'in emriyle (devesine) binerek halkın arkasından tavaf etmiştir. Ümmü Seleme demiştir ki: (Ben deve üstünde Ka'be'yi tavaf ederken) Resulullah (Sallallahu Aleyhi ve Sellem)'in Ka'be'nin (ta) yanında namaza durduğunu ve (namazda); Tur suresini okuduğunu gördüm. İbn-i Mâceh dedi ki: Bu, Ebû Bekr'in bana rivayet ettiği hadîs metnidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2962,
			"arabicnumber": 2962,
			"text": "Amr bin Şuayb'ın babası aracılığıyla dedesinden rivayet edildiğine güre babası Şuayb (r.a.) söyle demiştir: Ben Abdullah bin Amr (bin el-Âs) ile beraber Ka'be'yi (veda için) tavaf ettim. Yedi defa dolaşmak suretiyle tavafımızı bitirince Ka'be'nin arkasında (yâni güney tarafında) tavaf namazını kıldık. Sonra ben ona: Cehennem ateşinden Allah'a sığınma duasında bulunmayacak mısın? diye sordum. Kendisi: Cehennem ateşinden Allah'a sığınırım, dedi. Şuayb dedi ki: Sonra Abdullah geçip Hacer-i Esved'i istilâm etti (elini sürdü). Sonra Hacer-i Esved ile Ka'be'nin kapısı arasında ayakta durdu ve göğsünü, kollarını ve yanağını mültezeme (Kabe duvarına) yapıştırdı. Daha sonra şöyle dedi: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i böyle yaparken gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2963,
			"arabicnumber": 2963,
			"text": "Âişe (r.anha)'dan; Şöyle demiştir: Biz (hac mevsiminde) ancak hac yapılabileceği (yâni umre yapılamayacağı) inancıyla Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde (Medine'den Mekke yolculuğuna) çıktık. Serif'e veya buraya yakın bir yere vardığımız zaman âdet gördüm. Ben (hac görevimi ifâ edemiyeceğim diye) ağlamakta iken Resulullah (Sallallahu Aleyhi ve Sellem) yanıma girdi ve: Neyin var? Âdet mi gördün? diye sordu. Ben de: Evet, diye cevab verdim. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): Bu, Allah'ın Âdem (Aleyhisselâm)'ın kızlarına yazdığı bir şeydir. Bu itibarla sen menâsikinin hepsini ifâ et. Sâdece Ka'be-i Muazzama'yı (hayız'dan çıkıncaya kadar) tavaf etme, buyurdu. Âişe dedi ki: Ve Resulullah (Sallallahu Aleyhi ve Sellem) zevceleri adına bir sığır kurban etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2964,
			"arabicnumber": 2964,
			"text": "Aişe (r.anha)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) hacc-ı ifrâd etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2965,
			"arabicnumber": 2965,
			"text": "Aişe (r.anha)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) hacc-ı ifrûd etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2966,
			"arabicnumber": 2966,
			"text": "Câhir (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) hacc-i ifrâd etmiştir. Not: Cabir'in hadisine dair bu senedin sahih olduğu, Zevaid'de belirtilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2967,
			"arabicnumber": 2967,
			"text": "Câbir (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) ile Ebû Bekir, Ömer ve Osman (r.a.) hacc-i ifrâd etmişlerdir. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Kasım bin Abdillah bulunur. Bu ravi terkedilmiştir. Ahmed bin Hanbel onu yalanlamış ve hadislerinin mevzu olduğunu söylemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2968,
			"arabicnumber": 2968,
			"text": "Enes bin Mâlik (r.a.)'den; Şöyle demiştir: Biz (Veda haccı yılı) Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde Mekke'ye (gitmek üzere Medine'den yola) çıktık. Ben Resulullah (Sallallahu Aleyhi ve Sellem)'den: «Lebbeyke, bir umre'ye ve bir hacc'a niyetlendim,» buyruğunu işittim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2969,
			"arabicnumber": 2969,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2970,
			"arabicnumber": 2970,
			"text": "Es-Subey bin Ma'bed (r.a.)'den; Şöyle demiştir: Ben Hristiyan bir adamdım. Sonra müslüman oldum ve hac ile umre (yâni Hacc-i Kıran) niyetiyle ihrama girdim. Sonra Selmân bin Rebia ve Zeyd bin Sohân (r.a.) Kadisiyye'de benim hac ve umre'nin her ikisi için de Telbiye getirmekte olduğumu işittiler. Bunun üzerine bu iki zât (bana işaretle) : Şu adam devesinden daha idraksizdir (yâni Hacc-ı îfrâdın daha faziletli olduğu bilincinden mahrumdur), dediler. Onlar bu sözleriyle sanki bana bir dağ yüklediler. Sonra ben Ömer bin el-Hattâb (r.a.)'in yanına vardım ve olup biteni ona arz ettim. Bunun üzerine Ömer (r.a.) onlara yönelip kınamada bulundu. Sonra bana dönüp: Sen Nebi (Sallallahu Aleyhi ve Sellem)'in sünnetine hidâyet olundun, sen Nebi (Sallallahu Aleyhi ve Sellem)'in sünnetine hidâyet olundun (yâni yaptığın iş O'nun sünnetine uygundur), dedi. (Râvî) Hişâm kendi rivayetinde dedi ki: Şakîk: Ben ve Mesrûk çok kere gidip es-Subay bin Ma'bed'e bu olayı soruyorduk, demiştir. ......senediyle de es-Subay bin Ma'bed (r.a.)'den rivayet edildiğine göre kendisi: Hrıstiyanlık dininden müslümanlığa yeni dönmüştüm. Müslümanlığı kabul edip (sünnet'e uymak için) gayret ve çalışmamda kusur etmedim. Sonra hac ve umre niyetiyle ihrama girdim (Yâni Hacc-ı Kır'ân'a başladım), demiş ve yukarıdaki hadîsin mislini anlatmıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2971,
			"arabicnumber": 2971,
			"text": "Ebû Talha (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) hac ve umre'yi beraber ifâ etti (yâni hacc-ı kırân'ı edâ etti.) Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Haccac bin Ertat bulunur. Bu ravi zayıf ve tedlisçidir ve bu hadisi an'ane ile rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2972,
			"arabicnumber": 2972,
			"text": "Câbir bin Abdillah, İbn-i Ömer ve İbn-i Abbâs (r.anhum)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) sahâbileriyle beraber (Veda haccında Mekke'ye) geldikleri zaman Resûllulah ve (Hacc-ı Kır'ân'a niyetlenen) sahâbîler, umre ve hac için (Ka'be'nin etrafında yedi defa dolaşmak suretiyle) ancak bir defa tavaf ettiler. Not: Zevaid'de şöyle denilmiştir: MüelIifin senedinde Leys bin Ebi Selim bulunur. Bu ravi zayıf ve tedlisçidir. Bu hadisi İbn-i Abbas'ın dışında kalan sahabUerden (yani Cabir ve İbn-! Ömer'den), başka müellifler de rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2973,
			"arabicnumber": 2973,
			"text": "Câbir (bin Abdillah) (r.a.)'dan rivayet edildiğine göre: Peygamber (Sallallahu Aleyhi ve Sellem) (Veda haccında) hac ve umre için (farz olarak) bir defa tavaf etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2974,
			"arabicnumber": 2974,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre: Kendisi Hacc-ı Kırân'a niyet etmiş olarak (Mekke'ye) geldi. Sonra yedi defa Ka'be etrafında dolaşmak suretiyle tavaf etti ve Safa ile Merve arasmda sa'y etti. Sonra: Resulullah (Sallallahu Aleyhi ve Sellem) böyle yaptı, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2975,
			"arabicnumber": 2975,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: Kim hac ve umre niyetiyle ihrama girerse (yâni Hacc-ı Kır'ân'a başlarsa) hac ve umresi için bir tavaf kifayet eder ve o kimse haccını tamamlayıp da hac ve umrenin her ikisinin ihramından beraber çıkıncaya kadar ihramdan çıkamaz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2976,
			"arabicnumber": 2976,
			"text": "Ömer bin el-Hattâb (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem)'in El-Akîk (deresin) de iken şöyle buyurduğunu (kulağımla) işittim; Bana Rabbim tarafından bir gelen (yâni Cebrail) geldi ve: Bu mübarek derede namaz kıl ve de ki: Bu, hac içinde bir umre'dir, diye talimat verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2977,
			"arabicnumber": 2977,
			"text": "Surâka bin (Mâlik) bin Cu'şum (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) bu derede hitabet etmek üzere ayağa kalktı ve: «Bilmiş olun ki umre kıyamete dek hacc'a şüphesiz dâhil oldu,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2978,
			"arabicnumber": 2978,
			"text": "Mutarrif bin Abdillah bîn eş-Şıhhîr (r.a.)'dan rivayet edildiğine göre şöyle demiştir: İmrân bin el-Husayn (r.a.), bana şöyle dedi: Bu günden sonra Allah'ın seni yararlandıracağı umulan bir hadîsi sana rivayet edeyim: Bilmiş ol ki Resulullah (Sallallahu Aleyhi ve Sellem)'in ailesinden bir grup Zilhicce ayının (ilk) on gününde şüphesiz umre ettiler. Resulullah (Sallallahu Aleyhi ve Sellem)'de bunu menetmedi ve bunun neshine dâir bir âyet inmedi. Sonra bir adam bunun (yâni Hacoı Temettü) hakkında kendi görüşüne dayak dilediği şeyi söyledi (yâni Hacc-ı Temettü'a karşı çıktı)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2979,
			"arabicnumber": 2979,
			"text": "Ebû Mûsâ el-Eş'arî (r.a.)'den rivayet edildiğine göre: Kendisi Hacc-ı Temettü'a fetva veriyordu. Sonra bir adam kendisine: Sen fetvanın bâzısını geciktir, fetva işini bırak. Çünkü mu'minlerin Emirinin (yâni halîfe Ömer'in) senden sonra hac ve umre menâsiki hakkında ihdas ettiği şeyi (ki Hacc-ı Temettü menetmektir) bilmiyorsun, dedi. (Ebû Mûsâ demiş ki) sonra nihayet ben mu'minlerin emirine rastladım ve ona sordum. Bunun üzerine (Halife) Ömer (r.a.) dedi ki: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'in ve ashabının hacc-ı temettu'u yaptıklarını şüphesiz biliyorum. Ve lâkin ben hacı adaylarının (Arafat'a çıkacakları zamana kadar) el-Erâk (ağacı) altında (bile) karılarına yaklaşmaya devam edip sonra başlarından boy abdesti suyu damladığı bir vaziyette hacc'a başlamalarını (Arafat'a çıkmalarını) kerih gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2980,
			"arabicnumber": 2980,
			"text": "Câbir bin Abdillah (r.a.)'dm; Şöyle demiştir: Biz Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde sırf hac niyetiyle ihrama girdik, umre yi hacca katmadık. Sonra Zilhicce ayının dördüncü günü (sabahı) Mekke'ye vardık. Biz Ka'be'yi tavaf edip Safa ile Merve arasında sa'y edince Resulullah (Sallallahu Aleyhi ve Sellem) haccımızı umre'ye çevirmemizi ve ihramdan çıkıp kadınlarımıza yaklaşabilmemizi emretti. Bunun üzerine biz kendi aramızda: Bizim ile Arefe (günü veya Arafat) arasında ancak beş gün var. Biz kadınlarımızdan bile yararlanmış olarak Arafat'a çıkacağız (Bu ne hâldir?) diye konuştuk (bu duruma hayret ettik). Sonra Resulullah (Sallallahu Aleyhi ve Sellem): Ben şüphesiz hepinizden ziyâde hayra düşkün, Allah'a itaatkâr ve doğruyum. Ve (beraberimdeki) kurbanlık olmasaydı (umre yi yaptıktan sonra) ben muhakkak ihramdan çıkacaktım, buyurdu. Sonra Surakâ bin Mâlik (r.a.) (Resül-i Ekrem (Sallallahu Aleyhi ve Sellem)'e): Bu mut'a'mız (yâni umre için ettiğimiz tavaf ve sa'y'den sonra ihramdan çıkmak suretiyle yararlanmamız) bu yılımıza mı mahsustur, yoksa ebediyen meşru mudur? diye sordu. ResûM Ekrem (Sallallahu Aleyhi ve Sellem): Hayır, (bu yıla mahsus değildir). Bilâkis ilelebed meşrudur, buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2981,
			"arabicnumber": 2981,
			"text": "Âişe (r.anha)'dan; Şöyle demiştir: Biz Zilkade ayının bitimine beş gün kala Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde (Medine'den hac yolculuğuna) çıktık. (Hac mevsiminde umre değil) ancak hac edilir sanıyorduk. Nihayet varıp (Mekke'ye) yaklaştığımız zaman Resulullah (Sallallahu Aleyhi ve Sellem), beraberinde kurbanlık olmayanların (tavaf ve sa'y'den sonra) ihramdan çıkmalarını emretti. Beraberinde kurbanlık olanlar dışında kalan herkes (tavaf ve sa'y'den sonra) ihramdan çıktı. Kurban bayramı günü olunca bize sığır eti getirildi ve Resulullah (Sallallahu Aleyhi ve Sellem) 'in, zevceleri yerine kurban kestiği söylendi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2982,
			"arabicnumber": 2982,
			"text": "El-Berâ bin Âzib (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) ve ashabı başımızda (hac yolculuğuna) çıktılar. Biz (sahâbilerin çoğu) hac niyetiyle ihrama girdik. Sonra Mekke'ye vardığımız zaman Resül-i Ekrem (Sallallahu Aleyhi ve Sellem) (bize): Bu haccınızı umre'ye çeviriniz, buyurdu. Sahâbiler: Yâ Resûlallah! Biz hac niyetiyle ihrama girdik. Haccımızi umre'ye nasıl çevirelim, dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) : Size emrettiğim şeye bakınız, (onu) yapınız, buyurdu. Sahâbiler: İhramdan çıkmaya yanaşmadılar. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (bu duruma) hiddetlenip gitti. Sonra Âişe (r.anha)'nm yanına öfkeli olarak girdi. Âişe (r.anha) : (Yâ Resûlallah)! Kim seni hiddetlendirdi? Allah o kimsenin cezasını versin, dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) : Ben bir şeyi emredip de bana uyulmadığı halde nasıl hiddetlenmeyeyim? diye cevab verdi. Not: Zevaid'de şöyle denilmiştir: Bunun senedindeki raviler sika kimselerdir. Ancak senedde Ebü İshak bulunur. Bunun adı Amr bin Abdillah'tır. Bu nıvinin hafızası son zamanlarında zayıflamış, rivayetleri karıştırmıştt. Rlivisi İbn-i Ayyaş'ın ondan bu halinden önce mi sonra mı rivayette bulunduğu açıklığa kavW?mamıştır. Bu itibarla İbn-i Ayyaş'ın rivayet zamanı açıklığa kavW?unca,. ya kadar Ebü İshak'ın hadisinin sıhhat durumu hakkında bir şey söylenemez",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2983,
			"arabicnumber": 2983,
			"text": "Esma' bint-i Ebî Bekir (r.anha)'dan; Şöyle demiştir: Biz Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde ihrâmlı olarak (Hac yolculuğuna) çıktık. Sonra Peygamber (Sallallahu Aleyhi ve Sellem): Beraberinde kurbanlık olanlar ihrâmlı kalsınlar ve beraberinde kurbanlık olmayanlar (tavaf ve sa'y'den sonra) ihramdan çıksınlar, buyurdu. Esma demiştir ki: Benim beraberimde kurbanlık yoktu. Bu nedenle ben ihramdan çıktım. (Kocam) Zübeyr'in beraberinde kurbanlık vardı, o ihramdan çıkmadı. Sonra ben (ziyaret) elbisemi giyip Zübeyr'in yanına varıp oturdum. Zübeyr: Yanımdan kalk, benden uzak dur, dedi. Ben de i Senin üstüne atılacağımdan mı korkuyorsun, dedim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2984,
			"arabicnumber": 2984,
			"text": "Bilâl bin el-Haris (r.a.)'den; Şöyle demiştir: Ben (Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem)'e): Yâ Resûlallah! Haccın umre'ye çevirilmesi hükmü (Veda haccı yolculuğuna katılan) bizlere mi mahsustur? yoksa bütün insanlara umumî midir? Bunu bize bildir, dedim. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Bu hüküm umûmî değil, bize (yâni Veda haccı yolculuğuna katılanlara) mahsustur, buyurdu.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2985,
			"arabicnumber": 2985,
			"text": "Ebû Zer' (r.a.)'den; Şöyle demiştir: Haccın umre'ye çevirilmesi hükmü Muhammed (Sallallahu Aleyhi ve Sellem)'in (beraberinde Veda haccı yolculuğunda bulunan) sahabilerine mahsustu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2986,
			"arabicnumber": 2986,
			"text": "Urve (bin Zübeyr) (r.a.)'dan; şöyle demiştir: Ben (teyzem) Aişe (r.anha)'ya: Ben (Hac veya Umre ettiğimde) Safa ile Merve arasında Sa'y etmememden dolayı bir günaha gireceğim kanısında değilim, dedim. Aişe (r.anha): Allah: إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِر اللهِ، فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا ''Safa ile Merve Allah'ın şiarlarındandır. Kim Ka'be'yi hac eder veya umre ederse, bu iki tepe arasında sa'y etmesinde bir günah yoktur'' [Bakara 158] buyurdu. Eğer senin dediğin gibi olsaydı; ''....Bu iki tepe arasında sa'y etmemesinde bir günah yoktur'' şeklinde olacaktı. Bu ayet, ensardan bir gurup hakkında indirildi. Onlar (müslüman olmazdan önce) ihrama girdikleri zaman menat putuna tapmak niyetiyle ihrama girerlerdi ve (safa ile merve tepeleri üstünde başka putla bulunduğu için) safa ile merve arasında sa'y etmeyi kendilerine mübah saymazlardı. Sonra veda haccında Nebi (Sallallahu Aleyhi ve Sellem)'in beraberinde geldikleri zaman anılan durumu Nebi (Sallallahu Aleyhi ve Sellem)'e anlattılar. Bunun üzerine Allah mezkur ayeti indirdi. ''And olsunki safa ile Merve arasında sa'y etmeyen bir kimsenin haccını Allah tamam saymaz, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2987,
			"arabicnumber": 2987,
			"text": "Ümmü veled-i Şeybe (r.a.)'dan; şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i Safa ile Merve arasında sa'y ederken ve: «Bu dere ancak koşarak katedilir.» buyururken gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2988,
			"arabicnumber": 2988,
			"text": "İbn-i Ömer (r.a.)'den; şöyle demiştir: Eğer ben Safa ile Merve arasında koşarsam şüphesiz Resulullah (Sallallahu Aleyhi ve Sellem)'in koştuğunu gördüm (de öyle koşuyorum) ve eğer (normal) yürürsem (yine) şüphesiz Resulullah (Sallallahu Aleyhi ve Sellem)'in (normal) yürüdüğünü gördüm (de öyle yürüyorum). Kaldı ki ben yaşı ilerlemiş bir ihtiyarım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2989,
			"arabicnumber": 2989,
			"text": "Talha bin Ubeydillah (r.a.)'den rivayet edildiğine göre: Kendisi Resulullah (Sallallahu Aleyhi ve Sellem)'den şunu işitmiştir: «Hac bir cihaddır. Umre de bir tatavvudur.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Mendel diye tanınan İbn-i Kays bulunur. Bunu Ahmed, İbn-i Main ve başkaları da zayıf saymışlardır. Ravilerden Hasan da zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2990,
			"arabicnumber": 2990,
			"text": "Abdullah bin Ebi Evfa (r.a.)'den rivayet edildiğine göre; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (kaza) umresi yaptığı zaman biz de beraberinde idik. Resulullah Ka'be'yi tavaf etti, biz de kendisiyle beraber tavaf ettik. O (Makam-ı İbrahim arkasında iki rek'at) namaz kıldı, biz de onunla beraber kıldık. Biz o'nu Mekke halkından koruyorduk ki kimsenin zararı O'na dokunmasın",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2991,
			"arabicnumber": 2991,
			"text": "Vehb bin Hanbeş (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ramazan ayında (yapılan) bir umre (sevap olarak nafile) bir hacca muadildir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2992,
			"arabicnumber": 2992,
			"text": "Herim bin Hanbeş (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu. demiştir: «Ramazan ayında (yapılan) bir umre (nafile) hacca muadildir.» Not: Zevdid'de şöyle denilmiştir: Vehb bin Hanbeş'in hadisinin ilk senedi sahihtir. İkinci sened Davud bin Yezid'in zayıfl!ğı sebebiyle zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2993,
			"arabicnumber": 2993,
			"text": "Ebu Ma'kil (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem): «Ramazan ayında bir umre yapmak (nafile) bir hac etmeye muadildir,» buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2994,
			"arabicnumber": 2994,
			"text": "İbn-i Abbas (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem): «Ramazan ayında (yapılan) bir umre (sevap bakımında nafile) bir hacca muadildir, » buyurmuştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2995,
			"arabicnumber": 2995,
			"text": "Cabir (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) «Ramazan ayında bir umre yapmak (sevap bakımında nafile) bir hacca muadildir, » buyurmuştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2996,
			"arabicnumber": 2996,
			"text": "İbn-i Abbas (r.a.)'dan; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Zilkade ayından başka hiç bir ay da umre etmemiştir. Not: Zevaid'de şöyle denilmiştir: İbn-i Abbas (r.a.)'ın hadisinin senedi zayıftır. Çünkü ravl Muhammed bin Abdirrahman bin Ebi Leyla zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2997,
			"arabicnumber": 2997,
			"text": "Aişe (r.anha)'dan şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) hiç bir umre'yi zilkade ayından başka ay da ifa etmemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2998,
			"arabicnumber": 2998,
			"text": "Urve (r.a.)'dan rivayet edildiğine göre: Bir kere (Abdullah) bin Ömer'e, Resulullah (Sallallahu Aleyhi ve Sellem)'in hangi ay da umre ettiği soruldu. İbn-i Ömer de: Recep ayında, diye cevap verdi. Sonra Aişe: Resulullah (Sallallahu Aleyhi ve Sellem) Receb ayında kat'iyyen umre etmemiştir ve Resulullah (Sallallahu Aleyhi ve Sellem)'in ettiği bütün umreler de O (İbn-i Ömer) Onun beraberinde idi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2999,
			"arabicnumber": 2999,
			"text": "Ebu Bekr-i Sıddık'ın oğlu Abdurrahman (r.a.)'dan rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem) kendisine (kızkardeşi) Aişe (r.anha)'yı terkiyesine bindirip Ten'im'den (ihramlayarak) o'na umre ettirmesini emretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3000,
			"arabicnumber": 3000,
			"text": "Aişe (r.anha)'dan; şöyle demiştir: Biz, Zilhicce hilal'i (nin görüleceği) ne yakalşmış (yani zilkadenin sonuna beş gün kalmış) iken Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde (veda haccı) yolculuğuna çıktık. Somra Resulullah (Sallallahu Aleyhi ve Sellem): «Sizlerden kim umre niyetiyle ihram'a girmek isterse (öyle) ihram'a girsin. Kurbanlığımı sevketmiş olmam olmasaydı ben bir umre niyetiyle ihram'a girecektir.» Aişe (r.anha): Bunun üzerine (sadece) umre niyetiyle ihram'a girenler oldu. Hac niyetiyle ihram'a girenler de oldu. Ben umre niyetiyle ihram'a girenlerdendim. Aişe : Sonra biz (mikattan) yol'a çıktık. Nihayet Mekke'ye vardık. Ben arefe gününü hayızlı ve umre'nin ihramından çıkmamış olarak idrak ettim. Sonra durumumu Nebi (Sallallahu Aleyhi ve Sellem)'e arz ettim, dedi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Sen umre'ni bırak, saç örgülerini çöz, saçını tara ve hac'ca niyetlen,» buyurdu. Aişe dediki: Ben de yaptım. Sonra Hasbe (yani hasbeye inilme gecesi olan zilhicce'nin14.) gecesi olup Allah haccımızı tamamlatınca, Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) Abdurrahman bin Ebi Bekr'i benim beraberimde gönderdi. Abdurrahman beni devesinin arkasına bindirip Ten'im'e çıktı. Ben (orda) umre niyetiyle ihram'a girdim. Böylece Allah bizim haccımızı ve umremizi tamamlattı. Bu işte ne kurban vardı, ne sadaka nede oruç, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3001,
			"arabicnumber": 3001,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3002,
			"arabicnumber": 3002,
			"text": "Ümmü Seleme (r.anha)'dan rivayet edildiğine göre, Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kim beytu'l-Makdir'ten umre ihramına girerse günahları bağışlanır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3003,
			"arabicnumber": 3003,
			"text": "İbn-i Abbas (r.a.)'dan; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (şu) dört umreyi ifa etmiştir. Hudeybiye umre'si, bundan bir yıl sonra kaza umre'si, üçüncüsü Ci'rane'den ettiği umre, dördüncüsü de (veda) haccıyla beraber ettiği umre",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3004,
			"arabicnumber": 3004,
			"text": "İbn-i Abbas (r.a.)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) (veda haccında) terviye günü öğle, ikindi, akşam, yatsı ve (arefe günü) sabah namazını Mina'da kıldı. (Arefe günü) güneş doğduktan sonra Arafat'a hareket etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3005,
			"arabicnumber": 3005,
			"text": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre: Kendisi beş vakit namazı minada kılardı. Sonra Resulullah (Sallallahu Aleyhi ve Sellem)'in böyle yaptığını arkadaşlarına haber vermiştir. Beş vakit: Minada terviye günü yani zilhicce'nin 8'inde öğle ikindi akşam yatsı ve Arefe günü sabah namazı demektir. Not: Zevaid'de şöyle denilmiştir: İbn-i Ömer (r.a.)'ın bu hadlsinin senedi zayıftır. Çünkü onda bulunan rfwi Abdullah bin Ömer zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3006,
			"arabicnumber": 3006,
			"text": "Aişe (r.anha)'dan; şöyle demiştir: Ben: Ya Resulallah! Biz senin için Mina'da bir ev yaptırmayalım mı? dedim. O: «Hayır. Mina, önce varan kimse'nin konaklama yeridir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3007,
			"arabicnumber": 3007,
			"text": "Aişe (r.anha)'dan şöyle demiştir: Biz: Ya Resulallh! Senin için Mina da seni güneş'ten koruyacak bir ev yaptıralım mı? dedik. O: «Hayır. Mina, önce varan kimse'nin konaklama yeridir » buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3008,
			"arabicnumber": 3008,
			"text": "Enes (r.a.)'den; şöyle demiştir: Biz bu gün (arefe günü) Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde sabahleyin Mina'dan Arafat'a gittik. Bazılarımız tekbir getiriyordu, bazılarımız tehlil getiriyordu. Ne tekbir edenler tehlil edenleri ayıpladı. Nede tehlil edenler tekbir edenleri ayıpladı. (Enes ne şunlar bunlara nede bunlar şunlara... tabirini kullanmış olabilir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3009,
			"arabicnumber": 3009,
			"text": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) Arafat da nemire deresinde konaklardı. İbn-i Ömer dediki: Haccac(-ı zalim), İbn-i Zübeyr (r.a.)'i öldürünce İbn-i Ömer'e adam göndererek: Nebi (Sallallahu Aleyhi ve Sellem) bu gün (arafat günü) öğleden sonra hangi saatte (memire'den urn deresine) hareket ederdi? diye sordurdu. İbn-i Ömer (r.a.): Öğleden sonra o saat olunca hareket ederiz (ve sana haber veririz), diye cevap verdi. Sonra İbn-i Ömer hareket etmek isteyince: Güneş (tepeden) batıya eğildimi? diye sordu. Yanındakiler: Henüz eğilmedi, dediler. Bunun üzerine İbn-i Ömer oturdu. Bir süre sonra: Güneş batıya eğildi mi? diye sordu. Yanındakiler: Henüz eğilmedi, dediler. İbn-i Ömer oturdu. Biraz sonra İbn-i Ömer: Güneş batıya eğildimi diye sordu. Yanındakiler: Güneş hala batıya eğilmedi, dediler. Bunun üzerine İbn-i Ömer oturdu. Bir müddet sonra: Güneş batıya eğildimi? diye sordu. Orada bulunanlar: Evet, diye cevap verdiler. Oradakiler: Güneş batıya eğildi, deyince İbn-i Ömer hareket etti. (Ravi) Veki' demiştirki : Yani İbn-i Ömer öğle vakti girdikten sonra hareket etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3010,
			"arabicnumber": 3010,
			"text": "Ali bin Ebi Talib (r.a.)'den şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Arafatta vakfe etti. Sonra (durduğu yeri işaret ederek): «Burası vakfe etme yeridir ve Arefe'nin hepsi vakfe etme yeridir. » buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3011,
			"arabicnumber": 3011,
			"text": "Yezid bin Şeyban (r.a.)'den; rivayet edildiğine göre: Kendisi (ravisi olan Amr bin Abdillah bin Safvan'a hitaben): Biz mevkif'ten (Nebi s.a.v.'in vakfe ettiği yerden) uzak saydığın bir yerde vakfe ediyorduk. Sonra İbn-i Mirba (r.a.) yanımıza gelerek dediki: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'in size gönderdiği elçiyim. O buyuruyor ki: «Öteden beri vakfe edegeldiğiniz yerler üzerinde olunuz. Çünkü siz bugün İbrahin (A.S.)'ın mirasından bir miras üzerindesiniz.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3012,
			"arabicnumber": 3012,
			"text": "Cabir bin Abdillah (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Arefe'nin hepsi vakfe yeridir. Ve Urene deresinden uzak durun. Müzdelife'nin hepsi vakfe yeridir. Ve Muhassir deresinden uzak durun. Mina'nın hepsi mezbahadır. Ancak Akabe cemresinin arkasında kalan gölge kurban kesme yeri değildir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3013,
			"arabicnumber": 3013,
			"text": "Abbas bin Mirdas es-Selemi (r.a.)'den; şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem), Ümmeti için Arefe günü akşamı (Arafatta) mağfiret duasında bulundu. O'na, (Allah tarafından) şöyle cevap verildi: Zalim müstesna, onları bağışladım. Çünkü ben mazlumun hakkını zalim'den şüphesiz alırım. Nebi (Sallallahu Aleyhi ve Sellem): «Ey Rabbim! Eğer dilersen mazluma (hakkını) cennetten verir ve zalimi bağışlarsın, » diye dua etti. Fakat o akşam bu duası kabul olunmadı. Sonra Resul-i Ekrem (ertesi gün) Müzdelife de sabahlayınca anılan duayı tekrarladı ve duası kabul olundu. Abbas bin Mirdas: Sonra Resulullah (Sallallahu Aleyhi ve Sellem) güldü, dedi. veya gülümsedi. Bunun üzerine Ebu Bekir ve Ömer (r.a.) (Resulullah (Sallallahu Aleyhi ve Sellem))'e: Babam ve anam sana feda olsun! Bu saatte gülmezdin. Seni güldürüren nedir? Allah seni sevindirsin, dediler. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Allah düşmanı İblis, Allah Azze ve Celle'nin benim duamı kabul ettiğini ve Ümmetimi bağışladığını bilince toprağı alıp başına dökmeye ve mahvoldum, helak oldum diye bağırmaya başladı. Gördüğüm onun bu sabırsızlığı ve üzüntüsü beni güldürdü, buyurdu.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Abdullah bin Kinane bulunur. Buhari, onun hadisinin sahih olmadığını söylemiştir. Fakat ben onu cerh veya tevsik eden kimseyi görmedim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3014,
			"arabicnumber": 3014,
			"text": "Aişe (r.anha)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Allah Azze ve Celle'nin Arefe günü ateş'ten azadladığı kullardan fazla sayıda kulları azadladığı hiç bir gün yoktur. Allah Azze ve Celle şüphesiz (Arefe günü) kullarına (rahmetiyle) yaklaşır, sonra meleklere karşı onlarla iftihar ederek: Bunlar ne diliyorlar? buyurur.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3015,
			"arabicnumber": 3015,
			"text": "Abdurrahman bin Ya'mer ed-Dili (r.a.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Arafat ta vakfe halinde iken ben O'nun yanında hazır bulundum. O esnada Necid halkından birkaç kişi Onun yanına gelerek: Ya Resulallah! Hac nasıldır? diye sordular. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Hac Arafat'dır. Kim Cem' gecesi sabah namazından önce (Arafat'a) gelirse haccı tamamdır. Mina günleri üçtür. Artık kim iki günde acele ederse onun üzerinde bir günah yoktur. Kim de gecikirse ona da günah yoktur.» buyurdu. Sonra bunun arkasından bir adam gönderdi. Adam bu hükümleri yüksek sesle halk'a duyurmaya başladı. Abdurrahman bin Ya'mer ed-Dili (r.a.)'den şöyle de rivayet edilmiştir: Ben Arafat ta Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına vardım. Somra Necid halkından bir Nefer O'nun yanına geldi. ... Ravi bundan sonra yukarıdaki metnin mislini (aynısını) anlattı. Ravi Muhammed bin Yahya dedi ki: Ben Sevri'nin bundan üstün bir hadisinin olduğunu sanmıyorum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3016,
			"arabicnumber": 3016,
			"text": "Urve bin Mudarris et-Tai (r.a.)'den rivayet edildiğine göre: Kendisi Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken Hacc'a gitmi fakat hacılara ancak Müzdelife de yetişebilmişti. Kendisi şöyle demiştir: Ben Nebi (Sallallahu Aleyhi ve Sellem)'in yanına (sabah namazına çıktığı sıralarda) vardım ve: Ya Resulallah! Ben şüphesiz binek devemi zayıflattım ve kendimi cidden yordum. Allah'a yemin ederim ki üzerinde vakfe etmediğim tek bir kum tepesi bırakmadım. Hal böyle olunca benim için hac var mı? (Hacı olabildim mi) dedim. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: «Kim bizimle beraber bu namazda (yani Müzdelife de kılınan bu sabah namazında) hazır bulunur ve (Arefe günü) gündüz veya geceleyin Arafat dan (Müzdelife'ye) dönerse tefesini (yani ihramlıya uygun kirlilik ve diğer halini) ikmal etmiş (veya kirini giderme zamanına kavuşmuş) ve haccı tamamlanmıştır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3017,
			"arabicnumber": 3017,
			"text": "Usame bin Zeyd (r.a.)'den rivayet edildiğine göre: Kendisine: Resulullah (Sallallahu Aleyhi ve Sellem) (veda haccında) Arafat'dan (Müzdelife'ye) döndüğü zaman nasıl seyrediyor du? (yani yavaşmı hızlımı) diye soruldu. Kendisi: Resulullah (Sallallahu Aleyhi ve Sellem) normal seyrediyordu ve boş bir saha bulunca hızlı gidiyordu, dedi. Veki' dediki: Yani normalin üstünde hızlı gidiyordu. (boşluk bulunca)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3018,
			"arabicnumber": 3018,
			"text": "Aişe (r.anha)'dan rivayet edildiğine göre şöyle demiştir: Kureyş: Biz Ka'be yi muazzama sakinleriyiz. Biz (vakfe için) Harem-i şerif'in dışına (Arafat'a) çıkmayız. dediler. Bunun üzerine Allah Azze ve Celle buyurdu ki: ‘’Sonra siz, halkın döndüğü yerden dönünüz… ‘’[Bakara 199] Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedi, sahih bir seneddir. Ravlleri sıka (güvenilir) zatlardır. Bu hadis mevkü! ise de merfü hükmündedir. Çünkü anılan ilahi emrin inişi hakkındadır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3019,
			"arabicnumber": 3019,
			"text": "Usame b. Zeyd (r.a.)'den; şöyle demiştir: Ben (veda haccında) Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde Arafat'tan Müzdelife'ye döndüm. Resulullah Halifelerin mola verdikleri Şi'b (denen boğaz)'a vardığı zaman devesinden indi ve küçük abdest bozup sonra abdest aldı. Ben: Ya Resulallah! Akşam namazı (kıl yada kılacakmısın?) dedim. Resul-i Ekremh (Sallallahu Aleyhi ve Sellem): «Namaz önünde (bulunan Müzdelife de kılınacaktır,») buyurdu. Sonra Müzdelife varınca ezan okunmasını ve kamet getirilmesini emretti. Sonra akşam namazını kıldırdı. Sonra kalkıp yatsı namazını kıldırıncaya kadar halk'tan hiç kimse develerin sırtındaki eşyasını çözmedi. Diğer tahric: Bu hadisin benzeri; Buhari, Müslim Ebu Davud, Muvatta ve Şafii de geçmektedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3020,
			"arabicnumber": 3020,
			"text": "Ebu Eyyub-i Ensari (r.a.)'den şöyle demiştir: Ben veda haccında (arefeyi bayrana bağlayan gece) akşam ve yatsı namazlarını Resulullah (Sallallahu Aleyhi ve Sellem) ile beraber Müzdelife'de kıldım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3021,
			"arabicnumber": 3021,
			"text": "Abdullah bin Ömer (r.a.)'den şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) (Arefe gününü bayrama bağlayan gece) akşam namazını Müzdelife de kıldı. Namazdan sonra biz develerimizi çöktürünce: «Namaz ikamet edilmek suretiyle (kılınmalı) dır, buyurdu.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3022,
			"arabicnumber": 3022,
			"text": "Amr bin Meynun (r.a.)'den; şöyle demiştir: Biz Ömer b. el-Hattab (r.a.) ile beraber haccettik. Müzdelife'den (Minaya) dönmek istediğimiz zaman Ömer b. el-Hattab şöyle dedi: Müşrikler (Müzdelifede vakfe ettiklerinde) : Ey Sebir (dağı) güneşlenki sür'atle gidelim, derlerdi ve güneş doğuncaya kadar (Müzdelife'den) dönmezlerd. Bu nedenle Resulullah (Sallallahu Aleyhi ve Sellem) onlara muhalefet ederek güneş doğmadan önce (Müzdelife'den Mina'ya) döndü",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3023,
			"arabicnumber": 3023,
			"text": "Cabir (r.a.)'den; şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) veda haccında (Müzdelife'den Mina'ya) ağır hareket etti. Sahabilere ağır yürümelerini emretti ve (cemrelere) fiske taşları misli (çakıl) atmalarını emretti. Muhassir deresinde de devesini hızlı sürdü ve «Benim ümmetim menasiki alsınlar. Çünkü bilemeyeceğim, umulur ki bu yılımdan sonra onlara rastlayamayacağım,» buyurdu. Diğer tahric: Ebu Davud, Nesai Şafii ve Beyhaki de bu hadisi rivayet ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3024,
			"arabicnumber": 3024,
			"text": "Bilal bin Rabah (r.a.)'den rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem) Müzdelife sabahı kendisine: «Ya Bilal, Halkı sustur veya Halkı dinlet,» buyurdu. Sonra (halka) şöyle buyurdu «Allah şüphesiz şu Müzdelifenizde sizlere iyilik ve ihsanda bulunarak kötülük işleyenlerinizi iyilik işleyenlerinize bağışladı ve iyilik işleyenlerinize dilediğini verdi. Allah'ın adıyla (Mina'ya) hareket ediniz.» Not: Zevaid'de şöyle denilmiştir: Bu, zayıf bir seneddir. Seneddeki Ebu Seleme'nfn ismi bilinmiyor ve mechul bir kimsedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3025,
			"arabicnumber": 3025,
			"text": "İbn-i Abbas (r.a.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) biz Abdu'l-Muttalib oğullarına küçük yaştaki oğlan çocuklarını merkeblerimiz üstünde Müzdelife'den (Müna'ya) önceden gönderdi ve (yolcularken) mubarek el ayasıyla uyluklarımızı hafifçe dövmeye ve şöyle buyurmaya başladı: «Oğulcuklarım! Güneş doğuncaya kadar cemreye taş atmayınız.» (Ravilerden) Süfyan bunda şu ilavede bulunmuştur: Ve hiç kimseyi güneş doğuncaya kadar cemreye taş atar sanmıyorum. Diğer Tahric edenler: Ebu Davud, Nesai, Ahmed bin Hanbel ve Tahavi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3026,
			"arabicnumber": 3026,
			"text": "İbn-i Abbas (r.a.)'den; şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'in (Müzdelife'den Mina'ya) önceden gönderdiği aile ferdlerinin zayıfları içinde idim. Diğer tahric edenler: Buhari, Müslim, Ebu Davud, Şafii ve Ahmed",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3027,
			"arabicnumber": 3027,
			"text": "Aişe (r.anha)'dan; şöyle demiştir: Sevde bint-i Zem'a iri yapılı ağır canlı bir kadın idi. Halk'ın izdihamından önce Müzdelife'den (Mina'ya) gitmek için Resulullah (Sallallahu Aleyhi ve Sellem)'den izin istedi. Resulullah da o'na izin verdi. Diğer tahric: Buhari ve Müslim de tahric ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3028,
			"arabicnumber": 3028,
			"text": "Süleyman bin el-Ahvas'ın anası (Ümmü Cündüb el-Esdiyye) (r.amha.)'den; şöyle demiştir: Ben Nebi (Sallallahu Aleyhi ve Sellem)'i Kurban bayramı (nın ilk günü) Akabe cemresi yanında bir katur'a binmiş halde gördüm. Bu arada şöyle buyurdu: «Ey insanlar cemreye taş atmak istediğiniz zaman fiske taşları mislini atınız » Diğer Tahiric edenler: Ebu Davud, Ahmed, Beyhaki",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3029,
			"arabicnumber": 3029,
			"text": "İbn-i Abbas (r.a.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Akabe sabahı devesinin üstünde olduğu halde: «Benim için yerden çakıl taşları topla.» buyurdu. Bunun üzerine ben O'nun için yedi tane çakıl taşı topladım. O taşlar fiske taşlarıydı. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) taşları avucunda oynatmaya ve: «Ancak şunların emsalini atınız,» buyurmaya başladı. Daha sonra şöyle buyurdu. «Ey insanlar Dinde haddi aşmaktan - teşdid'den sakınınız. Çünkü sizden öncekileri dinde aşırılık ve teşdid helak etti.» Diğer Tahiric edenler: Nesai ve Ahmed",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3030,
			"arabicnumber": 3030,
			"text": "Abdurrahman bin Yezid (r.a.)'den; şöyle demiştir: Abdullah bin Mes'ud (r.a.) Akabe cemresinin yanına vardığı zaman derenin ortasına geçip yüzünü Ka'be'ye çevirdi ve cemreyi sağ kaşının hizasına aldıktan sonra yedi tane çakıl attı ve her çakılla beraber tekbir alıyordu. Sonta şöyle dedi: Kendisinden başka ilah olmayan'a yemin ederim ki, üzerine Bakara suresi indirilen (Nebi s.a.v.) çakılları şu (durduğum) yerde attı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3031,
			"arabicnumber": 3031,
			"text": "Süleyman bin Amr bin el-Ahvas anası (Ümmü Cündüb el-Ezdiyye) (r.anha)'dan; şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i Kurban bayramı günü Akabe cemresi yanında derenin ortasında yer alırken gördüm. Cemre'ye yedi tane taş attı. Her taşla beraber tekbir alıyordu. Taşları attıktan sonra oradan ayrıldı. Ümmü Cündübün bu merfu' hadisinin mislini Abdurrahim bin Süleyman da Yezid bin Ebi Ziyad'dan muttasıl bir senedle rivayet atmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3032,
			"arabicnumber": 3032,
			"text": "İbn-i Ömer (r.a.)'den rivayet edildiğine göre: Kendisi Akabe cemresine taş atmış ve (sonra) onun yanında durmamıştır. Nebi (Sallallahu Aleyhi ve Sellem)'in de böyle yaptığını amlatmıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3033,
			"arabicnumber": 3033,
			"text": "İbn-i Abbas (r.a.)'dan; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Akabe cemresine taş attığı zaman, geçiyor ve (orada) durmuyordu. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Süveyd bin Said bulunur. Bu ravi hakkında ihtilaf vardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3034,
			"arabicnumber": 3034,
			"text": "İbn-i Abbas (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) devesinin üstünde Akabe cemresine tşaları attı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3035,
			"arabicnumber": 3035,
			"text": "Kudame bin Abdillah el-Amiri (r.a.)'den; şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i Kurban bayramı günü kırmızı ve beyaza çalan sarı renkli bir devesi üstünde Akabe cemresine taş atarken gördüm. Ne dövmek, ne kovmak nede yoldan çekil, yoldan çekil vardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 3036,
			"arabicnumber": 3036,
			"text": "Ebu'l-Beddah bin Asım'ın babası (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem), çobanlar için bir gün (cemrelere çakıl) atmalarına ve diğer bir gün (çakıl atmayı) terk etmelerine ruhsat vermiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 3037,
			"arabicnumber": 3037,
			"text": "Ebu'l-Beddah bin Asım'ın babası (Asım bin Adi) (r.a.)'den şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) deve çobanları için geceleri Mina'da geçirme (işini bırakma) k, Kurban bayramı (nın ilk) günü Akabe cemresine taş atıp bundan sonraki iki günlük taşlama işini birleştirerek anılan iki günden birinde (Malik demişki: Anılan iki günün birincisinde dediğini sanırım) yapmalarına ruhsat verdi. Çobanlar bayramın dördüncü günü de (gelip başkaları gibi) taş atma işini tamamlarlar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 3038,
			"arabicnumber": 3038,
			"text": "Cabir (r.a.)'den; şöyle demiştir: Biz Resulullah (Sallallahu Aleyhi ve Sellem) ile beraber haccettik. Beraberimizde kadınlar ve çocuklar da vardı. Biz çocuklar yerine Telbiye ettik ve onlar yerine cemrelere taşlar attık",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 3039,
			"arabicnumber": 3039,
			"text": "İbn-i Abbas (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) (bayramın ilk günü) Akabe cemresine çakılları atıncaya kadar telbiye getirmeye devam etti. Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahihtir ve ravİ Eyyüb, Sahtiyani olan Eyyub'tur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 3040,
			"arabicnumber": 3040,
			"text": "El-Fadl bin Abbas (r.a.)'den; şöyle demiştir: Ben (veda haccında Müzdelife'den Mina'ya kadar) Nebi (Sallallahu Aleyhi ve Sellem)'in ridfi (terkisine binmiş durumda) idim. Akabe cemresine çakıl atıncaya kadar O'nun telbiye getirdiğini hep işitiyordum. Akabe cemresine çakıl atınca Telbiye getirmeyi kesti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 3041,
			"arabicnumber": 3041,
			"text": "İbn Abbas (r.a.)’dan rivâyete göre, şöyle demiştir: Cemreler taşlandıktan sonra kadınlarla cinsel ilişki dışında her şey helaldir. “Güzel kokuda helâl midir?” diye soruldu. O da şöyle karşılık verdi: “Rasûlullah (Sallallau Aleyhi ve Sellem)’i misk kokusunu süründüğünü gördüm. Acaba o koku sayılır mı?” Diğer tahric edenler: Nesai, Menasik-i Hac; Müsned-i Hanbel: 1986",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 3042,
			"arabicnumber": 3042,
			"text": "Aişe (r.anha)'dan; şöyle demiştir: Ben (veda haccında) Resulullah (Sallallahu Aleyhi ve Sellem)'i ihram'a girmek istediği zaman, ihramlanması için ve ihram'dan çıktığı zaman ihram'dan çıkması sebebiyle (ve henüz ziyaret tavafı etmemişken) kokuladım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 3043,
			"arabicnumber": 3043,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem): «Allahım! Saçını traş eden erkeklere mağfiret eyle, » diye dua buyurdu. Sahabiler: Ya Resulallah! Saçını kısaltan erkeklere de, diye ricada bulundular. Resulullah (Sallallahu Aleyhi ve Sellem): «Allahım! saçını traş edenlere mağfiret eyle,» diye dua etti. Bu duayı üç defa tekrarladı. Sahabiler (r.anhum): Ya Resulallah! Saçını kısaltan erkeklere de, diye ricada bulundular. Resulullah: «Saçını kısaltan erkeklere de (mağfiret eyle),» diye dua etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 3044,
			"arabicnumber": 3044,
			"text": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem): «Allah, saçlarını traş edenlere rahmet eylesin,» diye dua etti. Sahabiler (r.anhum): Ya Resulallah! saçını kısaltanlara da, dediler. Resulullah (Sallallahu Aleyhi ve Sellem): «Allah saçlarını traş edenlere rahmet eylesin,» diye dua etti. Sahabiler (r.anhum): Saçlarını kısaltanlara da Ya Resulallah, dediler. Resulullah (Sallallahu Aleyhi ve Sellem): «Allah saçlarını traş edenlere rahmet eylesin,» buyurdu. Sahabiler (r.anhum): Saçlarını kısaltanlara da, Ya Resulallah, diye ricada bulundular. Resulullah (Sallallahu Aleyhi ve Sellem) (dördüncü defasında): «Saçlarını kısaltanlara da (Allah rahmet eylesin),» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 3045,
			"arabicnumber": 3045,
			"text": "İbn-i Abbas (r.a.)'dan rivayet edildiğine göre: Ya Resulallah! Niçin saçlarını traş edenlere üç defa ve saçlarını kısaltanlara bir defa dua etmekle saçlarını traş edenlere müzahir oldun, destek oldun diye (hikmeti) soruldu. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Saçlarını traş edenler (saç traşı konusunda Resulullah'a uymanın daha iyi olduğunda) şüphe edercesine kat'iyyen davranmadılar.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 3046,
			"arabicnumber": 3046,
			"text": "Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Hafsa (r.anha)'dan; şöyle demiştir: Ben: Ya Resulallah! İnsanlara ne oluyor ki sen umre'nin ihramından çıkmadığın halde onlar ihram'dan çıktılar? diye sordum. O: «Ben başımı telbid ettim ve kurbanlığımı kladeledim. Artık kurbanımı kesmedikçe ihram'dan çıkamam,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 3047,
			"arabicnumber": 3047,
			"text": "Salim'in babası (ibn-i Ömer) (r.a.)'den; şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'den, başını telbid etmiş olduğu halde yüksek sesle telbiyeyi işittim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 3048,
			"arabicnumber": 3048,
			"text": "Cabir bin Abdillah (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Mina'nın hepsi kurban kesme yeridir. Mekke ('ye açılan) boğazların hepsi yol ve kurban kesme yeridir. Arafat'ın hepsi vakfe yeridir ve Müzdelife'nin hepsi vakfe yeridir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 3049,
			"arabicnumber": 3049,
			"text": "İbn-i Abbas (r.a.)'dan; şöyle demiştir: (Veda haccında bayramın ilk günü) herhangi bir şeyi diğer bir şey'den yapanların durumları Resulullah (Sallallahu Aleyhi ve Sellem)'e sorulduğunda bütün sorulara cevaben, mubarek ellerinin ikisiyle işaret buyurarak hiçbir sakınca bulunmadığını bildirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 3050,
			"arabicnumber": 3050,
			"text": "İbn-i Abbas (r.a.)'dan; şöyle demiştir: Mina günü (yani veda haccında bayramın ilk günü) Resulullah (Sallallahu Aleyhi ve Sellem)'e (hac ile ilgili bazı) sorular soruluyordu. O da: «Sakıncası yok. Sakıncası yok,» buyuruyordu. Bu arada bir adam gelerek: Ben kurbanımı kesmeden saçımı traş ettim, dedi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Bir sakıncası yok,» buyurdu. Adam: Ben çakılları akşam (güneş battık) dan sonra (Akabe cemresine) attım, dedi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Bir sakınca yoktur,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 3051,
			"arabicnumber": 3051,
			"text": "Abdullah bin Amr (r.a.)'dan rivayet edildiğine göre: Saç traşı olmadan önce kurban kesen veya kurban kesmeden evvel saç traşı olan kimse'nin durumu Nebi (Sallallahu Aleyhi ve Sellem)'e soruldu. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Sakınca yok,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 3052,
			"arabicnumber": 3052,
			"text": "Cabir bin Abdillah (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (Veda haccında) halk (ın hac ile ilgili soruları sormaları) için Kurban bayramının ilk günü Mina'da oturdu. Sonra bir adam O'nun yanına gelerek: Ya Resulallah! Ben kurban kesmeden önce saçımı tıraç ettim dedi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Bir sakınca yok,» buyurdu. Sonra başka bir adam geldi ve: Ya Resulallah! Ben (Akabe cemresine) çakılları atmadan önce kurban kestim, dedi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Bir sakınca yok,» buyurdu. Kısacası o gün Resul-i Ekrem (Sallallahu Aleyhi ve Sellem)'e takdim (veya te'hir) edilmiş hiç bir şey sorulmadı ki (cevabında): «Sakınca yok,» buyurmasın.' Not: Zevaid'de bunun senedinin sahih ve ravilerinin sıka (güvenilir) oldukları bildirilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 3053,
			"arabicnumber": 3053,
			"text": "Cabir (r.a.)'dan; Şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'in Akabe cemresine çakılları kuşluk zamanı attığını ve bundan (yani ilk günden) sonra ise çakılları cemrelere güneşin zevalinden (yani öğle namazı vakti girdikten) sonra attığını gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 3054,
			"arabicnumber": 3054,
			"text": "İbn-i Abbas (r.a.)'da; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (bayramın ilk gününden sonraki günlerde) güneş göğün ortasından batıya kayınca cemrelere çakıllar atardı. Şöyle ki taşlama işini bitirince öğle namazına dururdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 3055,
			"arabicnumber": 3055,
			"text": "Amr bin el-Ahvas (el-Cegmî) (r.a.)'den; Şöyle demiştir: Ben Veda haccında (Minâ'da) Peygamber (Sallallahu Aleyhi ve Sellem)'den şunu işittim: Ey insanlar! Dikkat ediniz! Hangi gün en mukaddes gündür? Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) bu buyruğu üç kez tekrarladı. Sahâbîler (r.amhum): En mukaddes gün Hacc-ı Ekber günüdür, dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) : İşte bu beldeniz (Mekke) de, bu (Zilhicce) ayınızda bu (bayram) gününüz nasıl mukaddes bir gün ise şüphesiz kanlarınız (yâni canlarınız) , mallarınız ve ırzlarınız kendi aranızda öyle mukaddestir. Dikkat ediniz! Hiç bir suçlu kendi nefsinden başka kimse aleyhine suç işlemez (Yâni onun suçundan dolayı başkası cezalandırılmaz). Evlâd babasının suçundan dolayı cezalandırılmaz. Baba da evlâdının suçundan dolayı mulahaza edilmez. Bilmiş olunuz ki, şeytan bu beldeniz (Mekke) de (Allah'tan başkasına ibâdet edilmekle) kendisine itaat edilmekten kesinlikle ebedî surette ümidini yitirmiştir. Lâkin küçümsediğiniz bâzı işlerinizde ona uymak işi vuku bulacak, bu da onu memnun edecektir. Bilmiş olunuz ki, Câhiliyet devrinden kalma kan gütme dâvalarının hepsi iptal edilmiştir. Anılan kan dâvalarından iptal ettiğim ilk kan dâvası Abdulmuttalib'in oğlu el Hâris'in kan davasıdır. (El-Hâris, Beni Leys kabilesinde çocuğu için süt anasını arıyordu. Hüzeyl kabilesi onu öldürmüştü). Bilmiş olun ki Câhiliyet devrinden kalma faiz'in her çeşidi iptal edilmiştir. Mallarınızın sermayesi sizin hakkınızdır. Zulüm etmeyiniz ve zulmolunmayınız, buyurdu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) bundan sonra üç kez: Dikkat ediniz! Ey Ümmetim, Ben (Allah'ın emrini) tebliğ ettim mi?, diye sordu. Sahâbîler (r.anhum): Evet, diye cevab verdiler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): Allahım şâhid ol, Allahun şâhid ol, Allahım şâhid ol, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 3056,
			"arabicnumber": 3056,
			"text": "Cübeyr bin Mut'im (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Minâ*nın el-Hayf (denilen dere kenarın) da ayağa kalkarak şöyle buyurdu: Allah, benim sözümü işitip de (başkasına) tebliğ eden adamın yüzünü ağartsın. Çünkü fıkıh (kaynağı olan hadisleri) ezberleyen nice adamlar fıkıhçı değiller ve fıkıhçı olan nice (hadis) hafızları kendilerinden daha kuvvetli fıkıhçı]ara (hadisleri) iletebilirler. Üç meziyyet vardır ki müslüman bir kişi onlara sahip olduğu sürece kalbi, kin, hıyanet ve husûmet beslemez: Ameli, tam bir ihlâsla sırf Allah rızâsı için işlemek, müslümanların başındaki yöneticilere hayır dilemek ve müslumanların cemaatından ayrılmamak. Çünkü müslüman cemaatının daveti, arkalarındakileri de kaplar. Not: Zevaid'de şöyle denlımiştir: Bunun senedinde bulunan Muhammed bin İshak tedlisçi olup bunu an'ane ile rivayet etmiştir. Hadisin metni bu haliyle sahihtiro",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 3057,
			"arabicnumber": 3057,
			"text": "Abdullah bin Mes'ud (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) Arafat'ta muhadrama (yâni kulakları kesik gibi küçücük olan) devesi üstünde olduğu halde şöyle buyurdu, demiştir: (Ey sahâbilerim!) Bu gün hangi gündür, bu ay hangi aydır ve bu belde hangi şehirdir biliyor musunuz? diye sordu. Sahâbîler (r.anhum) : Bu belde mukaddes bir şehirdir, bu ay mukaddes bir aydır ve bu gün mukaddes bir gündür, diye cevab verdiler. (Bunun üzerine Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): Bilmiş olunuz ki bu şehriniz (Mekke) de, bu (Arefe) gününüzde, bu (Zilhicce) ayınız nasıl mukaddes ise, mallarınız ve canlarınız da şüphesiz size haram ve mukaddestir. (Ümmetim!) İyi biliniz ki: Ben Kevser havuzu başında öncünüzüm ve diğer ümmetlere karşı çokluğunuzla övünürüm. Artık (çok günahlar işlemekle) siz benim yüzümü karartmayınız (yâni beni Allah'a karşı mahcub etmeyiniz). Bilmiş olunuz ki: Ve ben (kıyamet günü) bâzı insanları kurtaracağım. Bâzı insanlar da benden kurtarılacak (yâni zebaniler onları götürecekleridir. Ben: Yâ Rabbi! Arkadaşcıklarım (ne olacaklar?) diyeceğim. Allah şöyle buyuracak: ''Senden sonra onların neler ihdas ettiklerini bilmiyorsun.\" Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahihtir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 3058,
			"arabicnumber": 3058,
			"text": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) Veda haccında bayramın ilk günü cemreler arasında durdu. Sonra Nebi (Sallallahu Aleyhi ve Sellem) (beraberinde bulunanlara hitaben): Bu gün hangi gündür? diye sordu. Sahâbüer (r.anhum): Nahr (Kurban bayramı) günüdür, dediler. Nebi (Sallallahu Aleyhi ve Sellem): Peki bu şehir hangi şehirdir? diye sordu. Sahâbîler (r.anhum): Bu şehir, Mukaddes beldetullahtır, dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) : Peki bu ay hangi aydır? buyurdu. Sahâbiler (a.nhum): Bu ay, Allah'ın mukaddes ayıdır, diye cevab verdiler. Nebi (Sallallahu Aleyhi ve Sellem): Bu gün, hacc-ı Ekber günüdür. Bu ayda, bu günde bu beldeniz nasıl mukaddes ise, canlarınız, mallarınız ve ırzlarınız da size mukaddestir, buyurdu. Sonra: Ben (Allah'ın emrini) tebliğ ettim mi? buyurdu, Sahâbîler: Evet, diye cevab verdiler. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): Allahım şâhid ol, demeye başladı. Daha sonra halk'a veda etti. Bu nedenle sahâbîler; Bu hac. Veda hacadır, dediler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 3059,
			"arabicnumber": 3059,
			"text": "Âişe ve İbn-i Abbâs (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) ziyaret tavafını (bayramın birinci gününü ikinci gününe bağlayan) geceye tehir etmiştir. Diğer tahric: Tirmizî, Ebû Dâvûd, Ahmed ve Beyhaki de Hadis'i rivayet etmişler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 3060,
			"arabicnumber": 3060,
			"text": "Abdullah bin Abbâs (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) ifaza (yâni ziyaret) tavafının yedi şavtında remel etmemiş (yâni hızlı ve çalımlı yürümemiş) tir. (Râvî) Atâ demiş ki ifâza tavafında remel yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 3061,
			"arabicnumber": 3061,
			"text": "Muhammed bin Abdirrahman bin Ebî Bekir (r.a.)'den rivayet edildiğine göre şöyle demiştir: Ben (bir defa) İbn-i Abbâs (r.a.)'ın yanında oturuyordum. Bir adam onun yanına geldi. İbn-i Abbâs (r.a.), adam'a: Nereden geldin? diye sordu. Adam: Zem-zem'den (geliyorum), dedi. İbn-i Abbâs (r.a.) ona: Zem-zem'den lâyıkıyla içtin (mi?), dedi. Adam: Bu nasıl olur?, diye sordu. İbn-i Abbâs (r.a.): Zem-zem'den su içmek istediğin zaman kıbleye doğru dur, Allah'ın ismini an, Zem-zem suyunu içerken üç defa nefes al ve ondan kana kana iç. Zem-zem suyunu böylece içtikten sonra Allah (Azze ve Celle)'ye hamdet. Çünkü Resulullah (Sallallahu Aleyhi ve Sellem) buyurdular ki : Bizimle münafıklar arasındaki alâmeti farika onların Zem-zem'den kana kana içememeleridir. Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedi sahih ve ravileri güvenilir zatlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 3062,
			"arabicnumber": 3062,
			"text": "Cablr bin Abdillah (r.a.)'dan rivayet edildiğine göre: Kendisi Resulullah (Sallallahu Aleyhi ve Sellem)'den şu hadîsi işitmiştir: Zem-zem suyu ne maksadla içilirse onun için (yararlı) dır. Not: Suyuti bu kitabın haşiyesinde: Bu hadis diller üstünde çok meşhur bir hadistir. Hadis hafızları bu hadisin sıhhati hususunda ihtilaf etmişlerdir. Bazılarına göre sahih, bir kısmına göre hasen, diğer bir kısmına göre zayıftır. Kuvvetli olan görüş ilk görüştür, demiştir. Zevaid'de de şöyle denilmiştir: Ravi Abdullah bin el-Müemmel'in zayıflığı sebebiyle bu sened zayıftır. El-Hakim bu hadisi el-Müstedrek'te İbn-i Abbas yoluyla rivayet ederek, senedinin sahih olduğunu söylemiştir. Sindi de: Ben diyorum ki alimler bu hadisin hükmünü denediklerini ve bildirilen sonucu aldıklarını anlatmışlardır. (Yani zemzem suyu açlığı gidermek, susuzluğu gidermek, bir has.. talıktan kurtulmak gibi ne niyetle içilirse Allah'ın lütfu ile o niyete uygun sonuç alırur. Bu dunun tecrübelerle sabittir,) der",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 3063,
			"arabicnumber": 3063,
			"text": "İbn-i Ömer (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), (Mekke'nin) fetih günü, beraberinde Bilal (bin Rabâh) ve Osman bin Şeybe olduğu halde Ka'be'ye girdi ve kapıyı içerden kilitlediler. Sonra Ka'be'den çıktıkları zaman, Resulullah (Sallallahu Aleyhi ve Sellem)'in Ka'be'nin neresinde namaz kıldığını Bilâl'e sordum. Bilal, O'nun Ka'be'ye girdiğinde sağında kalan iki direk arasında ve yüzüne karşı gelen duvara doğru namaz kıldığını bana haber verdi. Sonra ben, Resulullah (Sallallahu Aleyhi ve Sellem)'in kaç rek'ât namaz kıldığını Bilâl'e sormamış olmaklığımdan dolayı kendi nefsimi kınadım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 3064,
			"arabicnumber": 3064,
			"text": "Âişe (r.anha)'dan; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) benim yanımdan sevinçli olarak çıkıp gitti. Bir süre sonra üzgün olarak yanıma döndü. Ben: Yâ ResûIallan! Sen sevinçli olarak yanımdan çıktın ve üzgün olarak döndün? dedim. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: «Ben Ka'be'ye girdim. Ama keşke girmeseydim. Çünkü (girmekligimle) ümmetime güçlük çıkarmış olduğumdan korkarım.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 3065,
			"arabicnumber": 3065,
			"text": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre: Abbâs bin Abdulmuttalib (r.a.), sikâye hizmeti için Minâ günlerinde geceleri Mekke'de geçirmek üzere Resulullah (Sallallahu Aleyhi ve Sellem)'den izin istedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) de ona izin verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 3066,
			"arabicnumber": 3066,
			"text": "İbn-i Abbâs (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) hiç kimseye (Minâ gecelerinde) geceyi Mekke'de geçirmek ruhsatını vermedi. Yalnız (Abdulmuttalib oğlu) Abbâs'a sikaye hizmetinden dolayı müsaade etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 3067,
			"arabicnumber": 3067,
			"text": "Âişe (r.anha)'dan: Şöyle demiştir: (Minâ'dan dönüşte) el-Ebtah (deresin) de konaklamak sünnet değildir. Resulullah (Sallallahu Aleyhi ve Sellem) (Medine yoluna) çıkması sırf kolay olsun diye orada konakladı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 3068,
			"arabicnumber": 3068,
			"text": "Âişe (r.anha)'dan; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) Minâ'dan döndüğü günü ertesi güne bağlayan gecenin sonunda Bathâ'dan (Medine'ye) hareket etti. Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedi sahihtir, Ravileri Müslim'in şartı üzerine sıka (güvenilir) kimselerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 3069,
			"arabicnumber": 3069,
			"text": "İbn-i Ömer (r.a.)'dan: Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) ve (O'ndan sonra halîfe olan) Ebû Bekir, Ömer ve Osman (r.anhum) (Minâ'dan dönüşlerinde) el-Ebtah (deresin) de konaklıyorlardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 3070,
			"arabicnumber": 3070,
			"text": "İbn-i Abbâs (r.a.)'dan; Şöyle demiştir: (Hac için Mekke'ye gelen) halk (farz tavaftan ve Minâ günlerinden sonra) etrafa dağıtıyorlardı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Sakın hiç kimse Ka'be'yi son kez tavaf etmedikçe (Mekke'den) çıkmasın» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 3071,
			"arabicnumber": 3071,
			"text": "İbn-i Ömer (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), adam'ın son görevi Ka'be'yi tavaf (ı Veda) olmadıkça (Mekke'den) çıkmasını yasaklamıştır. Not: Zevaid'de şöyle denilmiştir. Bunun senedinde İbrahim var. Bu, İsmail el-Mekki el-Ferberi'nin oğludur. Ahmed ve başkası onun zayıflığına hükmetmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 3072,
			"arabicnumber": 3072,
			"text": "Âişe (r.anha)'dan; Şöyle demiştir: Safiyye bint-i Huyey ifâda (yâni farz olan) tavafı ettikten sonra hayız gördü. Âişe demiştir ki: Ben bu durumu Resulullah (Sallallahu Aleyhi ve Sellem)'e anlattım. Bunun üzerine Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «¦Safiyye (ifâda tavafını âdet görünceye kadar geciktirmekle) bizim (Medine'ye) hareket etmemizi engelleyici mi?» buyurdu. Ben: Safiyye ifâda tavafı etti ve ondan sonra âdet gördü, dedim. Resulullah (Sallallahu Aleyhi ve Sellem): «O halde Safiyye çıksın (yâni veda tavafını olmadan Medine'ye hareket edebilir.)» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 3073,
			"arabicnumber": 3073,
			"text": "Âişe (r.anha)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Safiyye (bint-i Huyey)'den söz etti. Biz de onun ay başı âdeti hâline girdiğini söyledik. Bunun üzerine Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «(Yahûdî olan kavmine) uğursuzluk getiren kadın! Ben onu ancak yola çıkmamızı engelleyici sanırım (Yâni galiba onun yüzünden Medine'ye hareketimiz gecikecek)», buyurdu. Bunun üzerine benj: Yâ Resülallah! Safiyye Kurban bayramının ilk günü ifâda tavafı etti, dedim. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «O zaman (Medine'ye hareket etmemize) engel yok. Ona söyleyin yollansın.» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 3074,
			"arabicnumber": 3074,
			"text": "Ca'fer bin Muhammed'in babası (Muhammed bin Ali bin Hüseyin bin Ali bin Ebî Tâlib) (r.a.)'den; Şöyle demiştir: Biz Câbir bin Abdillah (r.a.)'ın yanına girdik. Yanına vardığımız zaman girenlerin kimler olduğunu (bir bir) sordu. Nihayet sıra bana gelince : Ben Muhammed bin Ali bin Hüseyin'im, dedim. Bunun üzerine elini başıma uzatarak (gömleğimin yakasındaki) üst düğmemi çözdü. Sonra alt düğmemi de çözdü. Daha sonra avucunu iki mememin arasına (göğsümün üstüne) koydu. Ben o zaman genç bir çocuktum. (Bana): Hoş geldin. Dilediğini sor, dedi. Ben de ona (Nebi (Aleyhi's-salâtu ve's-selâm)'ın haccının keyfiyetini) sordum. Kendisi â'mâ idi. O sırada namaz vakti geldi. Bunun üzerine bir dokumaya bürünerek (namaza) kalktı. Sarındığı dokuma küçük olduğu için omuzlarına koydukça iki tarafı kendisine doğru geriye dönüyordu. Cübbesi de yanıbaşında askı üstünde (duruyor) idi. Bize namaz kıldırdı. Namaz'dan sonra ben (kendisine) : Bize Resûlullah (Sallallahu Aleyhi ve Sellem)'in hac edişini anlat, dedim. Bunun üzerine eliyle dokuz sayışma işaret ederek dedi ki: Resûlullah (Sallallahu Aleyhi ve Sellem) hac etmeden (Medine'de) dokuz yıl durdu. Sonra onuncu yıl Resulullah (Sallallahu Aleyhi ve Sellem)'in hacedeceğini halka ilân edilmesini emretti. Bunun üzerine Medine'ye çok insan geldi. Hepsi Resulullah (Sallallahu Aleyhi ve Sellem)*e uymak (yâni O'nunla beraber hac etmek) ve O'nun yaptığının mislini yapmak istiyordu. Resulullah (Sallallahu Aleyhi ve Sellem) (Medine'den yola) çıktı. Biz de O'nunla beraber çıktık. Zü'I-Huleyfe'ye vardık. Esma' bint-i Umeys (orada) Muhammed bin Ebi Bekr'i doğurdu ve: Ben ne yapacağım? diye Resulullah (Sallallahu Aleyhi ve Sellem)'e haber gönderdi. Peygamber (Sallallahu Aleyhi ve Sellem) (ona): «Yıkan, kanın akmasını engelleyici bir bez sarın ve ihrama gir» buyurdu. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) Zü'I-Huleyfe mescidinde namaz kıldı. Sonra Kasvâ'ya bindi. Nihayet devesi O'nu Beydâ (denilen mevki) ye çıkarınca (Câbir demiştir ki) O'nun önünde gözümün görebildiği kadar binekli ve yayaya baktım, O'nun sağında da o Kadar insan vardı. Solunda da o miktarda insan bulunurdu ve bir o kadar da arkasında vardı. Resulullah (Sallallahu Aleyhi ve Sellem) de aramızda bulunuyordu. Kur'ân (âyetleri) O'na iniyor, mânâlarını da o biliyordu. Artık O, ne yapıyorsa biz de ayni şeyi yapıyorduk. Resûl-i Ekrem, tevhîd'i, (yâni Allah'ın tekliğini ihtiva eden şu telbiye'yi yüksek sesle okudu): \"Allahım dâvetine çokça icabet ettim. Senin dâvetine mükerrer icabet ettim. Senin ortağın yoktur. Senin dâvetine tekrar icabet ettim. Şüphesiz, hamd ve ni'met senindir mülk de senindir. Hiç bir ortağın yoktur.\" Halk ise hâlen yüksek sesle okudukları telbiyeyi yüksek sesle okudular. (Yâni Nebi (s.a.v.)'in telbiyesine ilâve yaptılar.) Resulullah (Sallallahu Aleyhi ve Sellem) de onların okuduklarından bir şeyi reddetmedi (yâni niçin bu ilâveyi yapıyorsunuz demedi). Resulullah (Sallallahu Aleyhi ve Sellem) kendi telbiyesine devam etti. Câbir demiştir ki: Biz hac'dan başka bir şeye niyet etmiyorduk. Biz umreyi bilmiyorduk (Yâni hac ile umre'nin birlikte yapılabileceğini veya hac mevsiminde umre yapılabileceğini bilmiyorduk). Nihayet biz O'nunla beraber Ka'be'ye vardığımız zaman rüknü (Hacer-i Esved'i) istilâm etti ve Üç tur hızlı, dört tur da normal yürüyüşle tavaf etti. Sonra Makam-ı İbrahim'e gidip : «Makam-ı İbrahim'den namazgah edinin.» [Bakara 125.] âyetini okudu. Sonra Makam-ı kendisiyle Ka'be arasına aldı (ve makam'ın arkasında durup iki rekât namaz kıldı). (Râvî Ca'fer demiştir ki:) Babam diyordu ki: O, bu iki rek'at (tavaf namazın) da (Fâtiha'dan sonra) Kâfirûn ve İhlas surelerini okurdu. (Ben babamın bunu ancak Nebi (Sallallahu Aleyhi ve Sellem)'den merfû' olarak rivayet ettiğini bilirim.) (Câbir rivayetine devamla şöyle demiştir:) Sonra Nebi (Sallallahu Aleyhi ve Sellem) Ka'be'ye dönerek rüknü (yâni Hacer-i Esved'i) istilâm etti. Sonra (Safa) kapı (sın) dan Safâ'ya çıktı. Nihayet Safâ'ya yaklaşınca; \"Şüphesiz Safâ ile Merve Allah'ın (menâsik) alâmetlerindendir\" [Bakara 158] âyetini okudu ve: Allah'ın başladığından (sa'y'e) başlarız, buyurarak Safâ'dan (sa'y'e) başladı, Ka'be'yi görünceye kadar Safa tepesinin üstüne çıktı. Sonra tekbîr alarak, tehlil ve hamd eyledi ve; \"Allah'tan başka (ibâdete lâyık) hiç bir ilâh yoktur. O, birdir. Ortağı yoktur. Mülk O'nundur. Hamd da O'nundur. Diriltir ve Öldürür. O, her şeye de kadirdir. Allah'tan başka hiç bir ilâh yoktur. O, birdir. Hiç bir ortağı yoktur. (Nebi (Sallallahu Aleyhi ve Sellem)'in (verdiği) vaadini yerine getirdi, kuluna zafer verdi ve yalnız başına düşman birliklerini hezimete uğrattı\" dedi. Bu arada duâ etti ve bu zikir ile duayı üç defa tekrarladı. Sonra Safa tepesinden inip Merve ye doğru yürüdü. İnişi bitip derenin ortasına varınca hızlı yürüdü. Ayakları dereden çıkınca Merve tepesine varıncaya kadar (yine) normal yürümeye devam etti. Safa üstünde yaptığını Merve üstünde de yaptı. Tavaf (yâni yedi tur sa'y'ı) Merve üstünde bitince : Hac aylarında umre etmenin câizliğini şimdi bildiğim gibi başlangıçta bilseydim kurbanlığımı (Mekke'ye) sevketmezdim ve ihramm'a başladığım haccı umre'ye çevirirdim. Artık sizlerden (hac niyetiyle ihrama girip de) beraberinde kurbanlığı olmayanlar hemen ihramdan çıksın ve haccını umre'ye çevirsin, buyurdu. Bunun üzerine herkes ihramdan çıkıp saçlarını kısalttılar. Yalnız Peygamber (Sallallahu Aleyhi ve Sellem) ile yanında kurbanlığı bulunanlar ihramdan çıkmadılar. Sonra Sürâka bin Mâlik bin Cu'şum ayağa kalkarak: Yâ Resûlallah! Bu iş, bu yılımıza mı mahsus, yoksa ebedî olarak devam edecek mi? diye sordu. Câbir demiştir ki: Bu soru üzerine Resulullah (Sallallahu Aleyhi ve Sellem) bir elinin parmaklarını diğer elinin parmaklarına kenetleyerek: Umre şöylece (kenetlenen parmaklarım gibi) hacca dâhil olmuştur. Umre şöylece hacca dâhil olmuştur. Hayır. Bilâkis ebedî olarak devam edecektir, buyurdu. Câbir demiştir ki: Ali (r.a.) Peygamber (Sallallahu Aleyhi ve Sellem)'in develerini (Yemen'den) getirdi. Fâtıma (r.anha)'yı da ihram'dan çıkanlar meyânında, boyalı elbise giymiş ve gözlerine sürme çekilmiş olarak buldu. Ali (r.a.) Fâtima'nın ihramdan çıkmasına karşı çıktı. Fâtime: İhram'dan çıkmamı babam bana emretti, dedi. Alî (r.a.) Irak'ta (halîfe) iken şöyle derdi: Bunun üzerine ben Fâtima'yı bu yaptığı işten dolayı azarlatmak ve Resulullah (Sallallahu Aleyhi ve Sellem)'den naklen anlattığı husus ile onun yaptığı işe karşı çıkmam meselesi hakkında Resulullah (Sallallahu Aleyhi ve Sellem)'e fetva sormak üzere Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına gittim. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) : Fâtima doğru söylemiş, doğru söylemiş. Sen hacca niyetlenirken ne dedin? buyurdu. Ben: Allahım! Resûl'ün (Sallallahu Aleyhi ve Sellem) neye niyetlendiyse, ben de ona niyetlendim, cevâbını verdim. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (bana): Benim beraberimde kurbanlığım var. Sen (de) ihramdan çıkma, buyurdu. Câbir demiştir ki: Alî (r.a.)'in Yemen'den getirdiği kurbanlıklar ile Nebi (Sallallahu Aleyhi ve Sellem)'in Medine'den getirdiği kurbanlıkların toplamı yüz adetti. Sonra herkes ihramdan çıkıp saçlarını kısalttılar. Yalnız Nebi (Sallallahu Aleyhi ve Sellem) ile beraberinde kurbanlığı olanlar ihram'dan çıkmadılar. Sonra terviye günü olunca ve Minâ'ya doğru hareket edecekleri zaman (ihram'dan çıkmış olanlar) hac niyetiyle ihram'a girdiler. Resulullah (Sallallahu Aleyhi ve Sellem) hayvanına binerek (Minâ'ya) gitti. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (o günün) öğle, ikindi, akşam ve yatsı namazları ile (ertesi günü) sabah namazını Minâ'da kıldı. Sonra güneş doğuncaya kadar biraz bekledi ve kendisi için (Arafat'a yakın olan) Nemire (denilen yer) de kıldan bir çadırın kurulmasını emretti. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) (Minâ'dan Nemire'ye) hareket etti. Kureyş kendilerinin câhiliyet devrinde yaptıkları gibi O'nun da Meş'ar-i Haram yanında veya Müzdelife(nin başka bir yerin) de vakfe edeceğinde şüphe etmiyorlardı. Halbuki Resulullah (Sallallahu Aleyhi ve Sellem) (Kureyş'in kanaati hilâfına) Müzdelife'yi geçerek Arafat ('ın yakının) a vardı. Nemire'de kendisi için çadırı kurulmuş olarak buldu ve oraya indi. Nihayet güneş göğün ortasında batıya kayınca, Kasvâ'nın hazırlanmasını emretti. Bunun üzerine kasva'ya semer vuruldu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) binip (Ürene denilen) derenin ortasına vardı. Orada halka bir hutbe okuyarak şöyle buyurdu: Şu ayınızda, şu şehrinizde bu gününüz nasıl mukaddes ise şüphesiz kanlarınız ve mallarınız da size haramdır Bilmiş olunuz ki câhiliyet devri işlerinden olan her şey bu iki ayağımın altına konulmuştur. Câhiliyet devrine ait kanlar bâtıldır. İptal ettiğim kan dâvası el Hâris'in oğlu Rebia'nın kan davasıdır. Câhiliyet döneminin faizi de bâtıldır (yâni islam öncesindeki faiz sözü de geçersizdir). İlk iptal ettiğim faiz bizim faizimiz, Abbâs bin Abdulmuttalib'in faizidir. Çünkü faizin hepsi bâtıldır. Kadınlar hakkında Allah'tan korkunuz. Çünkü şüphesiz siz onları Allah'ın emâneti ile aldınız. Onların ırzlarını Allah'ın kelimesi ile kendinize helâl kıldınız. Yaygılarınıza (yâni evlerinize) hoşlanmadığınız kimselere ayak bastırmamaları şüphesiz sizin onlar üzerindeki hakkınızdır. Bunu yaparlarsa (yâni mahremi olsun veya olmasın hoşlanmadığınız her hangi bir erkek veya kadın'ın evinize girmesine izin verirlerse), onlara zarar vermeyecek biçimde dövünüz. Ma'ruf bir şekilde (yâni hâlinize göre veya normal biçimde) onların nafakasını ve giyeceğini vermek onların sizin üzerinizdeki hakkıdır. Size öyle bir şey bıraktım ki ona sımsıkı sarılırsanız dalâlet'e gitmezsiniz Allah'ın kitabıdır. Ben size sorulacağım. Acaba ne diyeceksiniz? Sahâbîler: (Emrolunduğun şeyleri) tebliğ ettiğine, görevini hakkıyla îfa ettiğine ve (ümmete) nasîhatta bulunduğuna şehâdet ederiz, dediler. Bunun üzerine Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) şehâdet parmağını göğe kaldırıp sonra halka doğru eğerek üç defa: Allahım şâhid ol, Allahım şâhid ol, Allahım şâhid ol, dedi (Bu hutbeden) sonra Bilâl (r.a.), ezan okudu. Sonra ikâmet etti. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) öğle namazını kıldırdı. Sonra Bilâl ikâmet etti. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) ikindi namazını kıldırdı. (Yâni öğle ve ikindi farzlarını ard arda Cem-i Takdim şeklinde kıldırdı). Resûl-i Ekrem bu iki namaz arasında başka namaz kılmadı. Bundan sonra Resulullah (Sallallahu Aleyhi ve Sellem) (devesine) binerek vakfe yerine geldi. Devesinin göğsünü kayalara çevirdi. Yayaların yolunu da karşısına aldı ve kıbleye döndü. Akşam'a kadar orada vakfeye durdu. Nihayet güneşin sarılığı biraz gitti ve güneş tamamen kayboluncaya kadar vakfeye devam etti. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) Usame bin Zeyd'i terkisine alarak oradan (Müzdelife'ye) hareket etti. Resûl-i Ekrem kasvâ'nın yularını o derece kasmıştıki neredeyse devenin başı semerin ön kısmındaki deriye değiyordu ve Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) sağ eliyle işaret ederek : Ey insanlar, sükunetten ayrılmayın, sükûnetten ayrılmayın buyuruyordu. Kum tepeciklerinden birine geldikçe düzlüğe çıkıncaya kadar devesinin dizginimi gevşetiyordu. Nihayet Müzdelife'ye vardı. Orada akşam ve yatsı namazlarını bir ezan ve iki ikâmetle kıldırdı. Ve bunlar arasında başka namaz kılmadı. Sonra Resulullah (Sallallahu Aleyhi ve Sellem), fecir doğuncaya kadar uzandı. Fecir doğunca bir ezan ve bir ikâmetle sabah namazını kıldırdı. Sonra Kasvâ'ya binerek Meş'ar-i Harâm'a geldi. Bu dağın üstüne çıktı. Orada Allah'a hamd etti, tekbîr aldı ve tevhîd'de bulundu (Yâni el-Hamdu lillâh Vellahu Ekber ve Lâ ilahe illallah dedi). Ortalık iyice aydınlanıncaya kadar orada vakfe'ye devam etti. Sonra henüz güneş doğmamış iken oradan yola çıktı ve terkisine Fadl bin Abbâs'ı aldı. Fadl, güzel saçlı beyaz tenli ve yakışıklı bir zât idi. Resulullah (Sallallahu Aleyhi ve Sellem) yola çıkınca, yanından bir takım kadınlar koşarak geçtiler. Fadl onlara bakmaya başladı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem), elini diğer taraftan (Fadl'ın yüzüne) koydu. Fadl da yüzünü o taraftan çevirip baktı. Nihayet Resül-i Ekrem (Sallallahu Aleyhi ve Sellem) (Müzde-life ile Minâ arasında bulunan) Muhassir deresine vardı ve (devesini) biraz hızlandırdı. Sonra seni büyük cemre'ye çıkaran orta yola girdi ve nihayet ağacın yanındaki (büyük) cemre'ye vardı (buna Akabe cemresi de denilir). (O cemre'ye) fiske taşı gibi yedi aded çakıl attı. Her çakılı atarken tekbîr alıyordu. Taşları derenin ortasından attı. Sonra mezbahaya döndü. 63 deveyi kendi eliyle boğazladı. Sonra (bıçağı) Alî'ye verdi. Ali de kalan (37) deveyi boğazladı. Resül-i Ekrem (Sallallahu Aleyhi ve Sellem), kurbanlıklarına Alî'yi ortak etti. Sonra, her deveden birer parça etin alınmasını emretti. Bunlar bir çömleğe konularak pişirildi. İkisi de develerin etinden yediler ve et suyundan içtiler. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) (ifâda tavafı için Minâ'dan) Ka'be'ye indi. (Tavaftan sonra) öğle namazını Mekke'de kıldı. Daha sonra Zem-zem (kuyusu) üzerinde halka suvarmakta olan Abdulmuttalib'in oğullarının yanma vardı ve (onlara) : (Kuyudan su) çıkarınız Ey Muttalib oğulları. Su çıkarmanız hususunda halkın size izdiham vermesi korkusu olmasaydı ben de sizinle beraber su çıkarırdım, buyurdu. Sonra onlar kendisine bir kova su sundular. O da bundan içti, BU HADİS’İN MÜSLİM RİVAYETİ VE İZAHAT İÇİN BURAYA TIKLAYIN",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 3075,
			"arabicnumber": 3075,
			"text": "Aişe (r.anha)'da; şöyle demiştir: Biz üç nevi hac niyetiyle Resulullah (Sallallahu Aleyhi ve Sellem)'in refakatinde yolculuğa çıktık. Bâzılarımız hac ve umreye beraber niyetlenerek ihrama girdi. Bir kısmımız yalnız hac ihramına girdi. Bâzılarımız da yalnız umre ihramına girdi. Hac ve umreyi beraber ifa etmek üzere ihrama girmiş olanlar hac menâsikini tamamlayıncaya kadar ihramdan çıkmadı. Yalnız hac niyetiyle ihram'a girenler de hac menâsikini bitirinceye kadar ihramdan çıkmadı ve yalnız umre ihramına girenler, Ka'be'yi tavaf edip Safa ile Merve arasında sa'y ettikten sonra ilerde hac niyetiyle ihrama girmek üzere, umre'nin ihramından çıktılar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 3076,
			"arabicnumber": 3076,
			"text": "Süfyân(-ı Sevrî) (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) üç defa hac etmiştir: İki hacc'ı hicret etmeden önce ve bir haccı hicret ettikten sonra Medine'den gitmek suretiyle ifa etmiştir. Hicretten sonra ettiği hac ile umre'yi birleştirmiştir. (Bu hac'da) Nebi (Sallallahu Aleyhi ve Sellem)'in getirdiği kurbanlar ile Alî'nin getirdiği kurbanların toplamı yüz deveyi bulmuştur. Bu develerden birisi de burnunda gümüşten bir halka bulunan Ebû Cehl'in erkek devesi idi. Nebi (Sallallahu Aleyhi ve Sellem) (bunlardan) 63 tanesini kendi eliyle boğazlamış. Ali de kalanları boğazlamıştir. Süfyân'at Bu hadîsi kim (sana) anlatmış? diye sorulmuş kendisi : Ca'fer, babasından, babası da Câbir (r.a.)'den rivayet etmiştir. İbn-i Ebî Leylâ da el-Hakem'den, bu da Mıksem'den, Mıksem de İbn-i Abbfts (r.a.)'dan rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 3077,
			"arabicnumber": 3077,
			"text": "Haccâc bin Amr el-Ensârî (r.a.)'den: Şöyle demidir: Ben Nebi (Sallallahu Aleyhi ve Sellem)'den şöyle buyururken işittim: «(İhram'a girdikten sonra) vücûdunun bir tarafı kırılan veya topallayan bir kimse ihramdan çıkabilir ve gelecek yıl haccetmekle mükelleftir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 3078,
			"arabicnumber": 3078,
			"text": "Abdullah bin Râfi' Mevlâ Ümmü Seleme (r.anha)'den; Şöyle demiştir: Ben ihrâmlı kimsenin (farz menâsikini tamamlamaktan) men edilmesi meselesini Haccâc bin Amr (el-Ensâriy)e sordum. Bunun üzerine Haccâc şöyle dedi: Resulullah (Sallallahu Aleyhi ve Sellem) buyurdu ki: «(İhram'a girdikten sonra) vücûdunun bir tarafı kırılan veya hastalanan ya da topallayan kimse ihram'dan çıkabilir ve gelecek yıl haccetmekle mükellef olur.» (Râvî) İkrime demiştir ki: Ben bunu İbn-i Abbâs ve Ebû Hureyre (r.a.)'e rivayet ettim. Bunlar; Haccâc doğru söylemiştir, dediler. (Râvi) Abdürrezzak demiştir ki: Ben bu hadîsi Destevâi sahibi Hişâm'ın cüz'ünde buldum ve Ma'mer'e götürdüm. Ma'mer bana okudu veya ben ona okudum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 3079,
			"arabicnumber": 3079,
			"text": "Abdullah bin Ma'kıl (r.a.)'dan; Şöyle demiştir: Ben (Kufe'de) Mescid'de Ka'b bin Ucre (r.a.)'ın yanına oturdum ve ona; ... Oruçtan veya sadakadan veya kurbandan bir fidye — gerekir— âyetini sordum. Ka'b dedi ki: Bu âyet benim hakkımda indirildi. (Ben Hudeybiye'de umre'nin ihramında iken) başımdan bir elemim vardı. Bitler (başımdan) yüzüme dökülür vaziyette ben Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına götürüldüm. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (bana): Meşakkatin şu gördüğüm vaziyete ulaştığını sanmıyordum. Bir koyun bulabilir misin?» diye sordu. Ben: Hayır, diye cevab verdim. Bunun üzerine şu âyet indi: Ka'b dedi ki: Oruç üç gündür. Sadaka her fakire yarım sa' yiyecek vermek üzere altı fakiredir. Kurban da bir koyundur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 3080,
			"arabicnumber": 3080,
			"text": "Ka'b bin Ucra (r.a.)'den; Şöyle demiştir: (Hudeybiye'de) bitler bana eziyet ettiği zaman Nebi (Sallallahu Aleyhi ve Sellem). başımı tıraş etmemi ve (fidye olarak) üç gün oruç tutmamı veya altı fakiri yedirmemi emretti ve O, kurban edeceğim hayvanın yanımda bulunmadığını biliyordu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 3081,
			"arabicnumber": 3081,
			"text": "îbn-i Abbâs (r.a.)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) oruçlu ve ihrâmlı iken hacamat olmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 3082,
			"arabicnumber": 3082,
			"text": "Cabir (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) ihrâmlı iken yakalandığı bir ayak rahatsızlığı nedeniyle hacamat olmuştur. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Muhammed bin Ebi Dayf bulunur. Ben onu zayıf sayan veya cerheden bir kimseyi görmedim. Senedin kalan ravileri sıka zatlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 3083,
			"arabicnumber": 3083,
			"text": "îbn-i Ömer (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) ihrâmlı iken başına kokusu güzelleştirilmemiş zeytin yağını sürerdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 3084,
			"arabicnumber": 3084,
			"text": "İbn-î Abbâs (r.a.)'dan: Şöyle demiştir: (Veda haccmda Arafat'ta) bir adam ihrâmlı iken devesi (onu yere düşürüp) boynunu kırdı (ve adam derhal öldü). Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): «Onu su ve sidr ile yıkayınız ve iki ihramı içinde kefenleyiniz ne yüzüne ne de başına bez sarmayınız. Çünkü o. Kıyamet günü Telbiye getirerek diriltilecektir- buyurdu. Bu hadisin misli ... senediyle de İbn-i Abbâs'tan bize rivayet edilmiştir. Ancak bu senedde râvî; ....... demiş ve Resul i Ekrem (Sallallahu Aleyhi ve Sellem)'in: «Ona güzel koku yaklaştırmayınız. Çünkü o. Kıyamet günü Lebbeyk, diyerek diriltilecektir» buyurduğunu söylemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 3085,
			"arabicnumber": 3085,
			"text": "Câbir (bin Abdillah) (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) ihrâmlının sırtlan avlanması (suçu) sebebiyle bir koç (cezasın) a hükmetti ve sırtlanı av hayvanlarından kıldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 3086,
			"arabicnumber": 3086,
			"text": "Ebû Hureyre (r.a.)'/den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem): «İhrâmlı kişinin deve kuşu yumurtasını avlanması (suçu) sebebiyle o yumurta bedeli (fidyesi) vardır» buyurmuştur. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Ali bin AbdiIaziz bulunur. Bu ravi meçhuldür. İsmi Yezid bin Süfyan olan Ebü'l-Mühezzim de zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 3087,
			"arabicnumber": 3087,
			"text": "Âişe (r.anha)'dan rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Fâsık olan beş nevi hayvan vardır ki hill (yâni Harem-i Şerif dışın) da ve Harem'de öldürülür: Yılan, ebka' (yâni karnında veya sırtında beyazlık veya siyahlık bulunan) karga, fare. akûr (ısırıcı) köpek ve çaylak.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 3088,
			"arabicnumber": 3088,
			"text": "Îbn-İ Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Yer yüzünde yürüyen hayvanlardan beş nevî vardır ki, ihrâmlı iken onları öldürene (veya buyurdu ki onları öldürmekte) hiçbir günah yoktur: Akreb, karga, çaylakcık, fare ve kelb-i akûr (yani: saldırgan köprek).»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 3089,
			"arabicnumber": 3089,
			"text": "Ebû Saîd-i Hudrî (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem); «İhrâmlı kimse, yılanı, akrebi, saldırgan yırtıcı hayvanı, kelb-i akûr'u ve fâsıkcık fareyi öldürür» buyurmuştur. Ebû Saîd-i Hudri'ye i Fareye niçin füveysika (fâsıkcık) denilmiş, diye soruldu. Ebû Saîd: Çünkü (bir gece) fare evi yakmak üzere yağlı, yanık bir paçavrayı tutup sürüklerken Resulullah (Sallallahu Aleyhi ve Sellem) bunun için uykudan uyandı, diye cevab verdi. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Yezid bin Ebi Ziyad bulunur. Müslim bunun rivayetini almış ise de zayıf bir ravidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 3090,
			"arabicnumber": 3090,
			"text": "Sa'b bin Cessâme (r.a.)'den; Şöyle demiştir: Ben Ebvâ veya Veddân'da iken Resulullah (Sallallahu Aleyhi ve Sellem) yanıma uğradı. Ben de O'na yabanî bir eşek hediye ettim: Fakat O, (kabul buyurmayarak) bana geri verdi. Sonra yüzümden üzüntü, kırılma belirtisini görünce şöyle buyurdu: «Bizde sana iade etmek yoktur. Lâkin biz ihramdayız.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 3091,
			"arabicnumber": 3091,
			"text": "Alî bin Ebî Tâlib (r.a.)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem)'e ihramda iken bir av eti getirildi. Fakat Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) onu yemedi. Not: Zevaid'de şöyle denilmiştir: Bwıun senedinde bulunan Abdülkerim Ebü'l-Maharık zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 3092,
			"arabicnumber": 3092,
			"text": "Talha bin Ubeydillah (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) ona bir yabanî eşek vererek arkadaşlar arasında ihramda bulundukları halde taksim etmesini emretmiştir. Not: Zevaid'de şöyle denilmiştir: Bunun senedinin ravileri sıka (güvenilir) zatlardır. El-Etraf'ta şöyle denilmiştir: Yaküb bin Şeybe demiş ki: Bu hadisi, İbn-i Uyeyne'den başka bir kimsenin bu şekilde rivayet ettiğini bilmem. İbn-i Uyeyne'nin bunu kısaltmak istediğini ve kısaltayım derken hataya düştüğünü sanıyorum. Halkın hepsi ona muhalefet ederek rivayetlerinde şöyle demişlerdir: ''Sonra Resulullah (s.a.v.) Ebu Bekr'e o yabani eşeği arkadaşlar arasında, ilmimda bulundukları halde taksim etmesini emrettİ",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Isnaad Malool"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Isnaad Malool"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 3093,
			"arabicnumber": 3093,
			"text": "Abdullah bin Ebî Katâde'nin babası (Ebû Katâde EL-Ensarf) (r.a.)'dan; Şöyle demiştir: Hudeybiye (yolculuğu) zamanında ben (de) Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde (yolculuğa) çıktım. Resûl-i Ekrem'in arkadaşları ihramlandılar. Fakat ben ihrâmlanmadım. Sonra (yolda) bir yabanî eşek gördüm. Ben hemen ona hücum edip avladım. Sonra Resulullah (Sallallahu Aleyhi ve Sellem)'e hayvanın durumunu anlattım ve (onu avlanırken) ihrâmlannuş olmadığımı belirtmek için); bunu, senin için avladım (Yâ Resûlallah), dedim. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) onu yemeleri için arkadaşlarına emretti. Fakat Zât-i Nebevileri için avladığımı söyleyince O, bundan yemedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 3094,
			"arabicnumber": 3094,
			"text": "Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Âişe (r.anha)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (Mekke'ye) Medine'den kurban gönderirdi. Ben de O'nun kurbanının boynuna takılacak ipleri büküyor (ve hazırlıyor) dum. Kurbanları Mekke'ye yolladıktan sonra Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem), İhrâmlı kimsenin sakındığı şeylerin hiç birisinden sakınmazdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 3095,
			"arabicnumber": 3095,
			"text": "Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Âişe (r.anha)'dan; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem)'in (Mekke'ye göndermek istediği) kurbanlığının boynuna takılacak ipleri ben büküyordum. O da bu ipleri kurbanının boynuna takıyordu. Sonra onu (Mekke'ye) gönderiyordu. Sonra ihrâmlı kimsenin sakındığı şeylerin hiç birisinden sakınmaksızuı kendisi (Medine'de) ikâmet ediyordu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 3096,
			"arabicnumber": 3096,
			"text": "Âişe (r.anha)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Ka'be'ye bir defa kurbanlık ganem (koyunlar veya keçiler) gönderdi ve onların boyunlarına kurbanlık alâmetlerini taktı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 3097,
			"arabicnumber": 3097,
			"text": "İbn-i Abbâs (r.a.)dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) (Veda haccında) kurbanlık devesinin hörgücünün sağ tarafını (bıçakla) nişanladı ve (akan) kanı temizledi. (Râvî) Alî kendi rivayetinde: Bu iş Zu'l-Huleyfe'de olmuş ve Resulullah (Sallallahu Aleyhi ve Sellem) devesinin boynuna kurbanlık alâmeti olarak iki papuç takmış, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 3098,
			"arabicnumber": 3098,
			"text": "Âişe (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) kurbanlığının boynuna kurbanlık alâmetini taktı, nişanladı ve (Mekke'ye) gönderdi, İhrâmlı kişinin sakındığı şeylerden de sakınmadı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 3099,
			"arabicnumber": 3099,
			"text": "Alî bin Ebî Tâlib (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) bana, (Veda haccında Mekke'ye sevkettiği kurbanlık) develerine nezâret etmemi, semerleri ile derilerini (fakirlere) taksim etmemi ve kassab'a (ücret olarak) develerden bir şey vermememi emretti ve: «Kassab'a, (ücretini) biz (yanımızdan) veririz» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 3100,
			"arabicnumber": 3100,
			"text": "İbn-i Abbâs (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) kurbanlık develeri meyânında burun halkası gümüşten olan Ebû Cehl'in bir erkek devesini de kurban olarak Mekke'ye yolladı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 3101,
			"arabicnumber": 3101,
			"text": "İyâs bin Seleme'nin babası (Seleme) (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem)\"in (Harem-i Şerife yolladığı) kurbanlık develeri içinde erkek bir deve de bulunuyordu. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Müsa bin Ubeyde ez-Zebidi bulunur. Ahmed, İbn-i Main ve başkaları bunun zayıf olduğunu söylemişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 3102,
			"arabicnumber": 3102,
			"text": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) kurbanlığını Kudeyd'den satın aldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 3103,
			"arabicnumber": 3103,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine .göre: Nebi (Sallallahu Aleyhi ve Sellem) bir adam'ın kurbanlık devesini sevk ettiğini, (kendisinin yaya olarak gittiğini) gördü. Bunun üzerine (adama): «Deveye bin», buyurdu. Adam: Bu deve kurbanlıktır, (nasıl bineyim?) dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Yazıklar olsun sana. deve'ye bin» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 3104,
			"arabicnumber": 3104,
			"text": "Enes bin Mâlik (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem)'in yanından kurbanlık bir deve geçirildi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (Deveyi götürene): «Deveye bin» buyurdu. Adam: Bu deve kurbanlıktır, diye cevab verdi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Deveye bin», buyurdu. Enes demiştir ki: Sonra ben adamı devesine binmiş olduğu halde Nebi (Sallallahu Aleyhi ve Sellem)'in beraberinde gördüm. Devenin boynunda bir papuç takılı idi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 3105,
			"arabicnumber": 3105,
			"text": "Züeyb el-Huzâî (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) kurbanlık develerini kendisiyle beraber (Mekke'ye) gönderiyor ve şöyle buyuruyordu: «Kurbanlıklarımdan ölüm tehlikesiyle karşılanan ve öleceğinden korktuğun hayvan olduğu zaman, sen hemen onu boğazla ve (boynuna takılı) papuçu onun kanına batırdıktan sonra hörgücünün üstüne vur (ki Kurbanlık olduğu bilinsin). Ne sen ne de senin beraberindeki kafileden hiç bir kimse onun etinden bir şey yemeyin.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 3106,
			"arabicnumber": 3106,
			"text": "Naciye el-Huzâî (Amr kendi rivayetinde diyordu ki: Naciye, Nebi (Sallallahu Aleyhi ve Sellem)'ın kurbanlık develerine refâket eden idi. (r.a.)'den; Şöyle demiştir: Ben, Yâ Resûlallah! Kurbanlık develerinden ölüm tehlikesiyle karşı karşıya kalana ne yapayım? dedim. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Onu boğazla ve (boynuna takılı) papuçu kanına batırdıktan sonra hörgücünün üstüne vur (ki kurbanlık olduğu bilinsin). Ve onu halk'a bırak. Halk onu yesin» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 3107,
			"arabicnumber": 3107,
			"text": "Alkame bin Nadla (r.a.)'den; Şöyle demiştir: Mekke evlerine ancak sevâib (yâni oturanların mülkü olmayıp ihtiyaç sahihlerine terkedilmiş olarak) denile geldiği halde Resulullah (Sallallahu Aleyhi ve Sellem), Ebû Bekir ve Ömer (r.a.) vefat ettiler. Kim (meskene) muhtaç ise (Mekke evlerinde) oturur ve kim muhtaç değil ise ihtiyâcı olanı (kirâsız olarak) oturur nOt: Zevaid'de şöyle denilmiştir: Bunun senedi Müslim'in şartı üzerine sahihtir. İbn-i Mace yanında Alkama bin Nadla'nın bundan başka hadisi yoktur. Kütüb-i Sitte'nin kalanlarında onun hiç hadisi yoktur. Sindi: Ben derim ki; Bu hadis rivayet edilmekte olduğu için bir delildir. Lakin Dümeyri şöyle demiştir: Alkama bin Nadla'nın sahabiliği sahih değildir. Kitablarda onun bundan başka hadisi yoktur. İbn-i Hibban onu tabiileri gören sıka. yani güvenilir zatlar arasında zikretmiştir. Bu hadisi Hakim kendi Müstedrek'te de rivayet etmiş ise de zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 3108,
			"arabicnumber": 3108,
			"text": "Abdullah bin Adî bin e!-Hamrâ (r.a.)'den; Söyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i, dişi devesi üstünde olup (Mekke'nin) el-Hazvara (semtin) de durarak şöyle buyururken gördüm: «(Ey Mekke)! Vallahi sen Allah'ın arzının şüphesiz en hayırlısısın ve Allah'ın arzının bana en sevimlisisin. Vallahi (Allah'ın emriyle) senin dışına ihraç edilmem (durumu) olmasaydı senden çıkmazdım.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 3109,
			"arabicnumber": 3109,
			"text": "Safiyye bint-i Şeybe (r.a.)'dan; Şöyle demiştir: Mekke'nin fetih yılı Nebi (Sallallahu Aleyhi ve Selem)'in hutbesini (Ondan) dinledim. O, hutbesinde: «Ey insanlar! Allah gökleri ve yeri yarattığı gün şüphesiz, Mekke'yi haram kılmıştur. Artık Mekke, kıyamete dek haramdır. (Şöyle ki:) Ağacı kesilmez, avı rahatsız edilmez ve lukatasını münşid (ilânla tanıtıcılık eden) kişiden başkası (yerden) almaz» buyurdu. Abbâs (r.a.): İzhir (otu) müstesna, çünkü o evler ve kabirler içindir, dedi. Resulullah (Sallallahu Aleyhi ve Sellem) de: «İzhir bu hükmün dışındadır» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bu hadisde, Safiyye'nin Nebi (s.a.v.)'den şahsen işittiğini belirtiyor ise de senedinde Eban bin Silih bulunur. Du rilvi ise zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 3110,
			"arabicnumber": 3110,
			"text": "Ayyaş bin Ebî Rebîa el-Mahzûmî (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Bu ümmet, şu hürmeti hakkıyla yücelttikleri sürece hayırlı biçimde devam edecektir. Bu ta'zimi zayi ettikleri zaman helak olurlar.» Not: Zevâid'de şöyle denilmiştir: Bunun senedinde Yezid bin Ebî Ziyâd bulunur. Bu râvi, ömrünün sonlarına doğru ihtilat'a uğramıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 3111,
			"arabicnumber": 3111,
			"text": "EbÛ Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Yılan yuvasına toplandığı gibi imân da Medine'ye toplanır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 3112,
			"arabicnumber": 3112,
			"text": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim Medine'de (yerleşip ölünceye kadar orada oturmak suretiyle) ölebilirse yapsın. Çünkü ben orada ölen kimse için şüphesiz şehâdet ederim (yâni şefaat ederim).»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 3113,
			"arabicnumber": 3113,
			"text": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Allahım İbrahim (Aleyhisselâm) senin dostun ve Nebiindir ve sen Mekke'yi İbrahim'in dileği üzerine şüphesiz haram kıldın. Allahım! Ben de senin kulun ve Nebiinim. Ben de Medine'nin şu iki lâbetin arasındaki sahayı şüphesiz haram kılıyorum. Not: -Bu hadisin aslı Buhari ve Müslim'de vardır. Ancak bu şekliyle Zevaid nevindendir. Zevaid yazarı: Bunun senedinde bulunan Muhammed bin Osman'ı Ebu Hatim sıka. (güvenillr) saymıştır. Salih bin Muhammed el-Es edi de: Bu, sıka. ve çok sadıktır. Fakat babasından münker hadisler rivayet eder, demiştir. İbn-i Hibban da: Bu, sıkalar arasındadır. Ama hata eder ve muhalil kalır, demiştir. EbQ Abdiilah el-Hakim de: Bunun rivayetlerinde bazen münker haçtis bulwıur, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 3114,
			"arabicnumber": 3114,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim Medine halkına bir kötülük etmek isterse, tuz'un suda eridiği gibi Allah o kimseyi eritir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 3115,
			"arabicnumber": 3115,
			"text": "Enes bin Mâlik (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Uhud, şüphesiz bizi seven ve bizim sevdiğimiz bir dağdır ve cennet bahçelerinden bir bahçenin üstündedir. Ayr (dağı) da cehennem kapılarından bir kapının üzerindedir.» Not: Zevâid'de şöyle denilmiştir : Bunun senedinde İbn-i İshâk bulunur. Bu râvl tedliscidir ve hadisi an'ane ile rivayet etmiştir. Onun şeyh'i Abdullah'tır. Bur hârî : Abdulalh'ın hadîsi üzerinde düşünmek gerekir, demiştir. İbn-i Hibbân da: Abdullah'ın Enes (r.a.)'den hadis işittiğini bilmem, demiştir. Fakat îbn-i Mâceh'ln rivayetinde Abdullah: Ben Enes'ten İşittim, dediği için İbn-i Hibbân'ın dediği husus giderilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 3116,
			"arabicnumber": 3116,
			"text": "Şekik (bin Seleme bin Vail) (r.a.) den Şöyle demiştir: Bir adam Ka'be'ye hediye olarak bir miktar gümüş para benimle (Mekke'ye) gönderdi. Şakîk; Sonra ben Ka'be'ye girdim. (Ka'be hizmetkârı) Şeybe (r.a.) (Ka'be'de) bir kürsü üstünde oturuyordu. Ben parayı ona teslim ettim, dedi. Şeybe, Şakîk'a: Bu para senin mi? diye sordu. Şakîk: Hayır. Ve eğer para benim olsaydı sana getirmezdim, diye cevab verdim, (diyor). Şeybe: Bak sen cidden bu sözü söylersen, (sana şunu anlatacağım: Ömer bin el-Hattâb (r.a.), şu oturduğun yere oturdu ve dedi ki: Ben Ka'be'nin malını müslümanların fakirleri arasında taksim etmedikçe (Ka'be'den) çıkmiyacağım, dedi. Ben: Sen yapmazsın, dedim. Kendisi: Muhakkak yapacağım dedi ve niçin öyle söyledin? diye sordu. Ben dedim ki: Çünkü Nebi (Sallallahu Aleyhi ve Sellem) Ka'be malının yerini şüphesiz gördü (yâni bu malın varlığını biliyordu). Ebu Bekir de gördü. Ve onların mal'a ihtiyaçları seninkinden fazlaydı. Buna rağmen onlar bu mal'ı yerinden oynatmadılar. Bunun üzerine Ömer, olduğu gibi ayağa kalktı ve (malı taksim etmeden Ka'be'den) çıktı, diyerek Şakîk'a cevab verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 3117,
			"arabicnumber": 3117,
			"text": "İbn-i Abbâs (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim Ramazan ayına Mekke'de kavuşup orucunu tutar ve kolayına geldiği kadar gecesini ibâdetle ihya ederse, Allah, ona Mekke dışında yüzbin Ramazan ayı orucunu tutmak sevabını yazar ve Allah ona her gün ve her gece karşılığında bir köleyi âzadlama sevâbını yazar. Her gün karşılığında Allah yolunda bir atın (düşmana) saldırısının sevabını yazar. Keza her gün bir hasene, her gece bir hasene yazar.» buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 3118,
			"arabicnumber": 3118,
			"text": "Dâvûd bin Aclân (r.a.)'den; Şöyle demiştir: Biz yağmurlu bir zamanda Ebû Ikal'ın beraberinde Ka'be-i Muazzama'yı tavaf ettik. Tavafımızı bitirince İbrahim (Aleyhisselâm)'ın makamının arkasına geldik. Sonra Ebû Ikal dedi ki: Ben yağmurlu bir zamanda Enes bin Mâlik (r.a.) ile beraber Ka'be'yi tavaf ettim. Sonra tavafımızı bitirince Makamı îbrahim'e geldik ve iki rek'at namaz kıldık. Sonra Enes bize: İşi (yâni tavafı) yenileyiniz, mağfiret olundunuz. Biz bir defa Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde yağmurlu bir zamanda tavaf etmiş durumda iken Resulullah (Sallallahu Aleyhi ve Sellem) bize böyle buyurdu, dedi. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Düvüd bin Aclan bulunur. İbn-i Muin, Ebu Davud, Hakim ve Nakkaş bunun zayıf olduğunu söylemişlerdir. Zev:iid yazarı: Bu ravi, Ebü İkal'den mevzu hadisler rivayet etmiştir. Bu ravinin şeyh'i Ebü ikal'm ismi Hilal bin Zeyd'dir. Ebil Hatim, Buhari, Nesai, İbn-! Adi ve İbn-! Hibb:in onun zayıf olduğunu söylemişlerdir. Zevaid yazarı: Ebu Ikal, Enes (r.a.)'ın kesinlikle rivayet etmediği bir takım mevzu şeyleri ondan rivayet etmIştir. Hiç bır durumda Ebü Ikal'ın rivayetleri delil gösterilemez, der",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 3119,
			"arabicnumber": 3119,
			"text": "Ebû Saîd (r.a.)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) hac etti. Ashabı da Medine'den Mekke'ye kadar yaya idiler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (onlara): İzarlarınızı bellerinize bağlayınız», buyurdu ve bazen yavaş, bazen hızlı yürüdü (veya onların böyle yürümelerini emretti). Not; Zevâid'de şöyle denilmiştir : Bu, zayıf bir seneddir. Çünkü îbn-i Muin, râvî Humrân bin A'yan el-Kufî hakkında: Bu râv! bir şey değildir, demiştir- Ebû Dâvud da onun râfızî olduğunu, Nesâi de onun sıka yâni güvenilir olmadığını söylemişler. Râvî Yahya bin Yemân'ın hadislerinin bâzısını Müslim rivayet etmiş ise de bu râvî son zamanlarında bunamıştı. Kendisinden rivayette bulunan zâtın, onun bunalım döneminden önce mi, sonra mı rivayette bulunduğu da anlaşılmamıştır. Bu itibarla rivayetinin terkedilmesl uygundur. Dümeyrî de: Bu hadîsi yalnız îbn-i Mâceh rivayet etmiştir. Bu hadîs münker ve zayıftır. Nebi (S.A.V.) ile sahabilerinin Medfne'den Mekke'ye kadar yaya olmadıklarını beyan eden ve daha önce geçen sahih hadîslerle reddedilmiştir, der",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 238
			}
		}
	]
}