{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"35": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3893,
			"arabicnumber": 3893,
			"text": "Enes bin Mâlik (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Salih kişi tarafından görülen güzel rü'ya, Nebiliğin kırk altı parçasından bir parçadır.» Diğer tahric: Buhari, ta’bir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3894,
			"arabicnumber": 3894,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Mu'min'in rü'yası Nebiliğin kırk altı parçasından bir parçadır.» Diğer tahric: Müslim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3895,
			"arabicnumber": 3895,
			"text": "Ebu Saîd-i Hudrî (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöy\\e buyurmuştur: «Salih müslüman adam'ın rü''yası Nebiliğin yetmiş parçasından bir parçadır.» Not: Zevad'de şöyle denilmIştir: Bunun senedinde bulunan Atiyye bin Said el•Avli el-Beceli, zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3896,
			"arabicnumber": 3896,
			"text": "Ümmü Kürz el-Ka'biyye (r.a.)'dan rivayet edildiğine göre kendisi: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'den şu buyruğu işittim, demiştir: «Nebilik gitti (yâni O'ndan sonra Nebi gönderilmeyecek) ve mübeşşirât (yani mu'minin göreceği güzel rü'yalar) kaldı.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahih olup ravilerI güvenillr zatlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3897,
			"arabicnumber": 3897,
			"text": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Salih, (yâni güzel) rü'ya, Nebiliğin yetmiş parçasından bir parçadır.» Diğer tahric: Müslim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3898,
			"arabicnumber": 3898,
			"text": "Ubade bin es-Samit (r.a.)'dan; Şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'e, Allah Sübhânehu'nun = لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا وَفِي الآْخِرَةِ ‘’Dünya hayatında da ahirette de büşrâ (müjde) onlara (Allah'ın velilerine) dir.’’ (Yunus 64) buyruğunu (n Büşrâ = Müjde kelimesiyle neyin kasdedildiğini) sordum. Buyurdular ki: «O, (yani âyetteki Büşrâ), güzel rü'yadır, onu müslüman kişi görür veya (başka müslüman tarafından) onun için görülür.» Diğer tahric: Buharî, Ta’bir; Tirmizi, Rü'ya; Dârimî, Rüya) Harb kendi rivâyetinde: Yahya b. ebî Kesîr bize anlattı demektedir. Tirmizî: Bu hadis hasendir. Bu konuda Ebu’d-Derda r.a.’dan da hadis rivayet edilmiştir",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3899,
			"arabicnumber": 3899,
			"text": "İbn-i Abbas (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), (son) hastalığında sitâreyi (yâni evinin kapısının perdesini) açtı. (Mescid-i Nebevî'deki) cemaat safları Ebu Bekir (r.a.)'ın arkasında (duruyor) idi. Resul i Ekrem (Sallallahu Aleyhi ve Sellem) (onlara hitaben): «Ey insanlar! Nebiliğin belirtilerinden yalnız güzel rü'ya kaldı. O rü'yayı müslüman kişi görür veya onun için (başkası tarafından) görülür,» buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3900,
			"arabicnumber": 3900,
			"text": "Abdullah (bin Mes'ûd) (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kim beni rü'yasmda görürse o kimse uyanık iken beni görür (gibidir, rü'yası doğrudur). Çünkü şeytan bana benzer bir surete giremez.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3901,
			"arabicnumber": 3901,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim rü'yasındâ beni görürse o kimse gerçekten beni görmüştür. Çünkü şeytan şüphesiz bana benzer bir şekle giremez.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3902,
			"arabicnumber": 3902,
			"text": "Cabir (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kim uykusunda beni görürse o kimse şüphesiz beni görmüştür. Çünkü şüphesiz benim suretime benzer bir şekle girmek şeytan için mümkün değildir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3903,
			"arabicnumber": 3903,
			"text": "Ebu Saîd (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kim rü'yasında beni görürse o kimse gerçekten beni görmüştür. Çünkü şeytan şüphesiz bana benzer bir surete giremez.» Not: Zevaid'de şöyle denilmiştir: Ravi Atiyye bin Sa'd el-Avfl'nin Muhammed bin Abdirrahman adlı İbn-i Ebi Leyla'nın zayıflığı nedeniyle bu hadlsin senedi zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3904,
			"arabicnumber": 3904,
			"text": "Ebu Cuhayfe (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kim beni rü'yasmda görürse o kimse uyanık iken beni görmüş gibidir. Çünkü şüphesiz, şeytan benim suretime girmeye muktedir değildir (gücü buna yetmez).» Not. Zevaid'de şöyle denilmiştir: Bunun senedi hasen'dir, Çünkü ravi Sadaka bin Ebi İmran hakkında ihtilaf vardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3905,
			"arabicnumber": 3905,
			"text": "İbn-i Abbâs (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim benî rü'yada görürse o kimse şüphesiz beni görmüştür. Çünkü şeytan benim suretime giremez.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Cabir el-Ca'fi bulunur. Bu ravi itham olunmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3906,
			"arabicnumber": 3906,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: Rü'ya üç çeşittir: Allah tarafından (melek vasıtasıyla mu'minin kalbine rü'yasında telkin edilen) bir müjde (yâni sevindirici güzel rü'ya), kişinin uyanık hâlinde önemseyip kalben meşgul olduğu bir şeyle ilgili olarak gördüğü rü'ya ve şeytan tarafından (uyku hâlinde kalbe sokulan) korkutmak. Bu itibarla biriniz sevindirici bir rü'ya gördüğü zaman dilerse anlatsm ve hoşlanmadığı bir rü'ya görürse onu kimseye anlatmasın ve (şeytanı defetmek için) kalkıp namaz kılsın.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Hevze bin Halife bulunur. İbn-i Main, bunun zayıf olduğunu söylemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3907,
			"arabicnumber": 3907,
			"text": "Avf bin Mâlik (el-Eşcaî) (r.a.)'den rivayet edildiğine göre kendisi Resulullah (Sallallahu Aleyhi ve Sellem): «Şüphesiz, rü'ya üç çeşittir: Bâzı rü'yalar, insan oğlunu üzmek için şeytan tarafından (kalbe sokulan) korkulardır. Rü'yalann bir kısmı İnsanın uyanık iken arzulayıp azmettiği, sonra da uykusunda gördüğü şeydir. Rü'yaların bâzısı da Nebiliğin kırk altı parçasından bir parça olan rü'yadır», buyurdu, demiştir. Ravi Müslim bin Mişkem demiş ki: Ben, Avf bin Malik (r.a.)'e: Bu hadîsi Resulullah (Sallallahu Aleyhi ve Sellem)'den sen (bizzat) işittin (mi)? dedim. Avf bin Malik (r.a.): Evet. Bunu Resulullah (Sallallahu Aleyhi ve Sellem)'den ben işittim. Bunu Resulullah (Sallallahu Aleyhi ve Sellem)'den ben işittim, dedi. Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahlh olup ravileri güvenilir zatlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3908,
			"arabicnumber": 3908,
			"text": "Câbir bin Abdillah (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Biriniz hoşlanmadığı rü'ya görünce (uyandığında) hemen sol tarafına üç defa (hafif nefesle) tükürsün ve üç defa şeytan'dan Allah'a sığınsın (yâni Euzu billahi mine'ş-şeytâni, desin) ve üzerinde olduğu taraftan diğer tarafa dönsün.» Diğer tahric: Bu hadisi Müslim. Ebu Davud ve Nesai tarafından da rivayet edilmiştir. AÇIKLAMA 3910’da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3909,
			"arabicnumber": 3909,
			"text": "Ebu Katade (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «(Güzel) rü'ya Allah'tandır. Hulm (yâni hoşlanılmayan rü'ya) şeytandandır. Bu itibarla biriniz rü'yasında, hoşlanmadığı bir şey görürse sol tarafına üç defa (hafif nefesle) tükürsün, üç defa şeytan-ı recimden Allah'a sığınsın (yâni Eûzu billahi mine'ş-şeytâni'r-recim, desin) ve üzerinde olduğu yandan diğer yana dönsün. (Bu suretle o rü'yayı zararsız hâle getirir).» Bu hadis Kütüb-i Sitte'nin hepsinde rivayet olunmuştur. AÇIKLAMA 3910’da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3910,
			"arabicnumber": 3910,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Biriniz hoşlanmadığı bir rü'yayı gördüğü zaman (uyandığında) hemen diğer tarafa dönsün, sol tarafına üç defa (hafif nefesle) tükürsün. Allah'tan o rü'yanın hayrından istesin ve şerrinden Allah'a sığınsın.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde el-Ömeri bulunur. Bunun adı Abdullah el- Ömeri'dir, zayıf bir ravidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3911,
			"arabicnumber": 3911,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre bir adam Nebi (Sallallahu Aleyhi ve Sellem)'in yanına gelerek: Ben rü'yamda başımın vurulduğunu (kesildiğini) ve başımın yerde yuvarlandığını gördüm, dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: «Şeytan birinizi (rü'yasında üzüp korkutmak üzere) İşler. Sonra o kimse bundan dolayı korkuya kapılır. Sonra sabahleyin gidip (rü'yasını) insanlara anlatır (yâni böyle rü'yadan korkup anlatmak yersizdir)» buyurdu. Not: Zevald'de şöyle denilmiştlr: Bunun senedi sahlh olup ravileri güvenilir zatlardır. AÇIKLAMA 3913’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3912,
			"arabicnumber": 3912,
			"text": "Cabir (bin Abdillah) (r.a.)'dan; Şöyle demiştir: Bir gün Nebi (Sallallahu Aleyhi ve Sellem) hutbe okurken bir adam O'na geldi ve: Ya Resulallah! Dün gece rü'yamda gördüm ki sanki benim boynum vurulmuş ve başım yere düşmüş. Ben de başımın arkasında gidip onu aldım ve tekrar yerine koydum, dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: «Şeytan birinizle uykusunda oynadığı zaman o kimse o rü'yayı sakın insanlara anlatmasın.» Diğer tahric: Müslim AÇIKLAMA 3913’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3913,
			"arabicnumber": 3913,
			"text": "Cabir (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Biriniz hoşlanmadığı bir rü'ya gördüğü zaman rü'yasında şeytan'ın onunla oynamasını (yâni bu tür rü'yayı) insanlara haber vermesin.» Diğer tahric: Müslim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3914,
			"arabicnumber": 3914,
			"text": "Ebû Rezîn (Lakît bin Âmir) (r.a.)'den rivayet edildiğine göre kendisi şu buyruğu Nebi (Sallallahu Aleyhi ve Sellem)'den igitmiştir: «Rü'ya yorumlanmadıkça bir kuşun ayağı üzerinde (yâni istikrarsız ve askıda) dır. Yorumlanınca vuku bulur.» Nebi (Sallallahu Aleyhi ve Sellem) (buyruğuna devamla): «Rü'ya (nın güzel ve sağlıklı olanı) Nebiliğin kırk altı parçasından bir parçadır» buyurdu. Ebu Rezîn demiştir ki : Ve sanırım şöyle buyurdu : Sahibi onu seveninden veya (rü'ya tâbiri hususunda) bilgi, dirayet sahibi olandan başkasına anlatmasın. Diğer tahric: Bu hadisi; Tirmizi ve Ebu Davud da rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3915,
			"arabicnumber": 3915,
			"text": "Enes bin Mâlik (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Rü'yada gördüğünüz şeylerin isimlerini o rü'yanın yorumlanmasına esas alınız. Rü'yada gördüğünüz şeylerin künyelerini (veya) kinaye mânâlarını da yorumlamaya esas alınız. (Birden fazla yoruma muhtemel) rü'ya ilk yorumcuyadır (yâni ona göre vukua gelir).» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Yezid bin Eban er-Rakkaşi bulunur. Bu ravi zayıftır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3916,
			"arabicnumber": 3916,
			"text": "İbn-i Abbas (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim görmediği bir rü'yayi gördüğünü iddia ederek yalan söylerse (kıyamet günü) ona iki arpa tanesini bir birine düğümlemesi teklif edilir ve bunu yapamamasından dolayı tazîb edilir.» Diğer tahric. Bu hadisi; Buhari. Tirmizi, Ebu Davud ve Nesai de rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3917,
			"arabicnumber": 3917,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Zaman (bitime) yaklaşınca (yâni dünyanın sonuna doğru), mu'min'in rü'yası yalan çıkmaz. Mu'mirilerin rüya bakımından en doğru olanı da, en doğru sözlü olanıdır ve mu'minin rü'yası Nebiliğin kırk altı parçasından bir parçadır.» Diğer tahric: Bu hadisi; Buhari. Müslim, TirmizI ve Ebu Davud da rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3918,
			"arabicnumber": 3918,
			"text": "“... İbn-i Abbâs (radıyallahü anhüma)’dan; Şöyle demiştir: (sallallahü aleyhi ve sellem)'e Uhud (harbin) den döndüğü zaman bir adam gelerek: Resûlallah! Rü'yamda bir bulut gördüm, ondan yağ ve bal yağıyordu. Halkın da yağan yağ ve baldan avuç avuç aldıklarını gördüm. Kimi çok alırdı, kimi de az alırdı. Bu arada (yerden) göğe (kadar uzanıp) ulaşan bir ip gördüm. Senin de o ipi tutup onunla (göğe doğru) yükseldiğini gördüm. Senden sonra da bir adamın o ipi tutup onunla yükseldiğini gördüm. O adamdan sonra da başka bir adamın o ipi tutup onunla yükseldiğini gördüm. Bundan sonra gördüm ki başka bir adam o ipi tuttu. Fakat ip koptu. Sonra onun için ip bağlanıp bitişti ve o da o iple yükseldi, dedi. Üzerine Ebû Bekir (radıyallahü anh) : Resûlallah! Beni (serbest) bırak (yani izin ver) bu rü'yayı ben yorumlayayım, dedi. Resûl-i Ekrem (sallallahü aleyhi ve sellem) de : buyurdu. Ebû Bekir (de) şöyle yorum yaptı : Bu adamın gördüğü bulut, İslâm dinidir. Ondan yağan yağ ve bal ise Kur'ân'dır. Tatlılığı ve yumuşaklığıdır. Halkın ondan avuç avuç aldığı şeye gelince; Kur'ân-ı Kerîm'den (kabiliyetlerine), gayretlerine göre çok veya az istifâde eden, feyiz alan müslümanlardır. Göğe kadar uzanan ip de üzerinde bulunduğun (adaletli) yönetimdir. Sen hakkı tuttun. O da senin yükselmene vesile oldu. Senden sonra da bir adam o hak, adalet ipini tutacak ve o da onunla yükselecek. Ondan sonra başka bir adam tutacak, o da yükselecek. Daha sonra bir başkası tutacak. Fakat ip kopacak, sonra onun için bağlanıp bitişecek ve böylece o da yükselecek. Ekrem (sallallahü aleyhi ve sellem) (Ebû Bekir (radıyallahü anh)'a hitaben) : (Sen bâzısında isabet ettin, bâzısında da hatâ ettin, ) buyurdu. Bunun üzerine Ebû Bekir: And olsun, Yâ Resûlallah isabet ettiğim kısmı hatâ ettiğim kısımdan ayırdedip bana muhakkak haber ver, dedi. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) : etme Yâ Ebâ Bekir), buyurdu. ..... Ebû Hüreyre (radıyallahü anh)’den; Şöyle demiştir: adam Resûlüllah (sallallahü aleyhi ve sellem)’in yanına gelerek : Resûlallah! Ben (rü'yamda) gök ile yer arasında bir bulut gördüm, buluttan yağ ve bal yağıyordu, dedi ve râvi bu hadisin mislini anlattı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3919,
			"arabicnumber": 3919,
			"text": "İbn-i Ömer (r.a.)'dan; Şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'in hayatta olduğu dönemde bekâr bir gençtim. Bu nedenle de gece Mescid-i Nebevî'de kalırdım (yâni evli olmadığım için orada uyurdum). Biz (sahâbîler) den biri, bir rü'ya gördüğü zaman onu Nebi (Sallallahu Aleyhi ve Sellem)'e anlatırdı. Ben de bir defa: Allahım! Eğer senin katında benim için bir hayır (iyi hal) var ise bana Nebi (Sallallahu Aleyhi ve Sellem)'in yorumlayacağı bir rü'yayı bana göster, diye duâ ettim. Sonra uyudum ve rü'yamda gördüm ki; İki melek bana geldi ve beni alıp götürdüler. Sonra (yolda) başka bir melek onlara rastladı ve bana: Korkulacak bir şey yok, dedi. Sonra o iki melek beni cehennem'e götürdüler. Baktım ki cehennem kuyu duvarı gibi (taş ile) örülmüş vaziyettedir ve içinde bâzısını tanıdığım insanlar vardır. Sonra ayni melekler beni alıp sağ tarafa giden bir yola götürdüler (yâni cehennemden uzaklaştırdılar). Sonra sabah olunca ben bu rü'yayı Hafsa (r.anha)'ya anlattım. O da rü'yamı Resulullah (Sallallahu Aleyhi ve Sellem)'e anlattığını ve Resul-i Ekrem (Sallallahu Aleyhi ve Sellem)'in şöyle buyurduğunu söyledi: «Abdullah, şüphesiz salîh bir adamdır. Fakat gece namaza çok kılsaydı.» Râvi demiştir ki: Abdullah bin Ömer bundan sonra geceleyin çok namaz kılardı. Diğer tahric: Bu hadisi Buhari ve Müslim de rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3920,
			"arabicnumber": 3920,
			"text": "Hareşe bin el-Hürr (r.a.)'den; Şöyle demiştir. Ben Medine-i Münevvere'ye gittim ve Nebi (Sallallahu Aleyhi ve Sellem)'in Mescidinde bir gurup şeyh'in yanına oturdum. Sonra yaşlı bir zat bir asa'ya dayanarak geldi. Yanlarında oturduğum cemaat: Kim cennet ehlinden bir adam'a bakmakla sevinmek isterse bu zat'a baksın, dediler. Bu zat bir sütun'un arkasında durup iki rek'at namaz kıldı. Sonra ben kalkıp o'nun yanına vardım. ve o'na : Cemaatin bazısı şöyle şöyle söyledi, dedim. Bu yaşlı zat: Hamd Allah'adır. Cennet Allahındır, dilediğini ona dahil eder. Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken ben bir rü'ya gördüm. Rü'yam da şunu gördüm: Sanki bir adam bana gelerek: Yürü, dedi. Bende onunla beraber gittim. Beni büyük bir yol'a götürdü. Sonra sol tarafımda kalan bir yol bana gösterildi. Ben de o yol'a gitmek istedim fakat adam: Sen bu yol'un halkından değilsin, dedi. Daha sonra sağımdaki bir yol bana gösterildi. Ben de o yol'a girdim. Nihayet kaygan bir dağ'a vardım. Adam elimi tutup beni (yukarı) fırlattı. Ben o anda dağın zirvesinde oldum fakat durup tutunamadım. O esnada tepesinde altından bir kulp bulunan demirden bir direk göründü. Adam elimden tutup beni fırlattı. Nihayet ben o kulp'u tutum. Adam: Sarıldın mı? dedi.Ben de: Evet, dedim. Sonra adam ayağı ile direğe vurup devirdi. Ben de kulp'a sarılı kaldım. Yaşlı zat (devamla) dediki: Ben rü'yamı Nebi (Sallallahu Aleyhi ve Sellem)'e anlattım. Buyurdu ki: «Sen hayırlı bir rü'ya gördün. Büyük yol mahşerdir. (Sonra) senin sol tarafında gösterilen yol cehennem halkının yoludur. Sen o yolun ehlinden değilsin. (Sonra) senin sağ tarafında gösterilen yol cennet ehlinin yoludur. Kaygan dağ'a gelince o şehidlerin makamıdır. (Sen şehid olmayacaksın) Tuttuğun kulp ise İslam kulbudur. Bu itibarla sen ölünceye kadar bu kulp'a sarılmaya devam et.» (İşte) ben bundan dolayı cennet ehlinden olmayı umarım (Hareşe demiştir ki) Sonra bu yaşlı zat'ın Abdullah bin Selam olduğunu öğrendim. Diğer tahric: Buhari, Müslim AÇIKLAMA 3921’de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3921,
			"arabicnumber": 3921,
			"text": "Ebu Mûsâ (el-Eş'arî) (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyje buyurmuştur: «Ben rü'yada Mekke'den hurma bahçeleri bulunan bir memlekete hicret ettiğimi gördüm. O yerin Yemâme veya Hecer olduğunu sandım. Fakat o yerin Medine, Yesrib olduğu görüldü. O rü'yamda bir kılıcı salladığımı ve kılıcın ağzının kesildiğini de gördüm. Sonra bunun Uhud (savaşı) günü şehîd edilen mu'minler olduğu görüldü. (O rü'yada şunu da gördüm:) Sonra kılıcımı (tekrar) salladım ve kılıç en güzel hâle dönüştü. Bunun da Allah'ın lütfettiği fetih ve mu'minlerin toplanması olduğu görüldü. O rü'yamda (boğazlanmış) sığırlar ve ''Allah (ın ettiği işte) hayır (var) dır\" (cümlesini) de gördüm. Sonra (boğazlanmış) sığırların Uhud (savaşı) günü (şehid edilen) mu'minler gurubu olduğu görüldü ve (rü'yada görülen) hayrın da Allah'ın bundan sonra verdiği hayırdı zaferler) ve Allah'ın bize Bedir (savaşı) günü lütfettiği sadakat (cihad'daki sabır, metanet) sevabı olduğu görüldü. Diğer tahric: Buhari, Müslim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3922,
			"arabicnumber": 3922,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ben bîr defa rü'yamda iki kolumda altından (mamul) iki bilezik gördüm. (Bunlar bana ağır geldi) Sonra bileziklere üfledim (ikisi de hemen uçup gitti). Sonra ben bu bilezikleri şu iki kezzâb (sahte peygamber) Müseyleme ve el-Ansi ile yorumladım.»\" Diğer tahric: Bu hadis; Buhari, Müslim ve Tirmizi tarafından da rivayet edilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3923,
			"arabicnumber": 3923,
			"text": "Ümmü'l-Fadl (Lübâbe bint-i el-Haris) (r.a.)'den rivayet edildiğine göre kendisi: Ya Resulallah! Ben rü'yamda gördüm ki; sanki senin uzuvlarından bir uzuv (organ) benim evimde idi, dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) de (ona): «Bir hayır gördün. (Kızım) Fâtime bir oğlan çocuğu doğurur. Sen de onu emzirirsin», buyurdu. Sonra Fâtime, Hasan veya Hüseyin (r.a.)'i doğurdu. Ümmü'l-Fadl da (bebeği) Kusem'İn sütü ile onu emzirdi. Ümmü'l-Fadl (sözüne devamla) demiştir ki: Bir gün ben onu Nebi (Sallallahu Aleyhi ve Sellem)'in yanına götürerek kucağına koydum. Bebek de (O'nun kucağında iken) işedi. Bundan dolayı bebeğin omuzuna vurdum. Bunun Üzerine Nebi (Sallallahu Aleyhi ve Sellem) (bana): «Sen oğlumu incittin. Allah sana rahmet eylesin», buyurdu. Not: Zevaid'de şöyle denilmiştir: Bunun senedindeki raviler güvenilir zatlardır. Fakat sened munkati' (kesik) dir. Et-Tehzib lle el•Etraf'ta beyAn edildiğine göre ravi Kabus, babası aracılığıyla Ummü'I-Fadl (r.a.)'dan rivayet etmıştır. (Halbuki bunda Kabus Ummü'l-Fad!'daıı rivayet etmiştir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3924,
			"arabicnumber": 3924,
			"text": "Abdullah bin Ömer (r.a.)'dan rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Rü'yamda siyah ve başı (nın saçı) dağınık bir kadının Medine'den çıkarak nihayet Mehyea'ya —ki, el-Cuhfe'dir — yerleştiğini gördüm. Sonra ben rü'yamda gördüğüm kadını Medine vebası ile yorumladım. Bu hastalık da oraya nakledildi.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3925,
			"arabicnumber": 3925,
			"text": "Talha bin Ubeydillah (r.a.)'den; Şöyle demiştir: Beli (kabilesin) den iki adam Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına geldiler. İkisinin müslümanhğı kabul etmeleri beraber olmuştu. Bunlardan birisinin (İslâmiyet uğrundaki) çalışma ve gayreti diğerininkinden fazla ve daha kuvvetli İdi. Bunlardan çok çalışkan olanı savaşa gidip şehid edildi. Diğeri ondan sonra bir yıl daha yaşadı. Sonra o da vefat etti. Talha demiştir ki: Ben uyurken rü'yamda cennet'in kapısı yanında olduğum sırada bu iki adamla karşılaştım. Sonra cennet'ten bir zat çıktı ve bu iki adam'dan sonradan vefat edene (cennete girmesi için) izin verdi. Bir süre sonra (görevli olan) aynı zât (tekrar dışan) çıktı ve şehid olan adama (cennete girmesi için) izin verdi. Daha sonra (görevli) zât bana döndü ve: Sen geri dön. Çünkü senin cennet'e girmen zamanı henüz gelmedi, dedi. Talha sabahleyin bu rü'yasını halka anlattı. Herkes şehîd olan ada'mın diğerinden sonra cennete girmesine şaştı. Nihayet bu haber Resulullah (Sallallahu Aleyhi ve Sellem)'e ulaştı ve halk O'na bu rü'ya olayını arzettiler. Bunun üzerine Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Bu olayın neyine şaşıyorsunuz?» buyurdu. Sahâbîler: — Yâ Resulallah! Bu (yâni önce ölüp sonradan cennet'e giren adam) arkadaşından daha gayretli, daha çalışkan idi. Sonra şehîd edildt Halbuki şu diğeri (yâni arkadaşı) ondan önce cennete girdi, dediler. Resulullah (Sallallahu Aleyhi ve Sellem): «Cennete önce giren adam, şehid edilen adam'dan sonra bir yıl daha yaşamadı mı?» diye sordu. Sahabîler : — Evet yaşadı, dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Ve Ramazan ayına erişip oruç tuttu, bir yılda şu kadar namaz, şu kadar secde etti, değil mi?» buyurdu. Sahabîler : — Evet doğrudur, dediler. Resulullah (Sallallahu Aleyhi ve Sellem): «Şu halde ikisinin arasında bulunan mesafe gök ile yer arasındaki mesafeden daha uzaktır>, buyurdu.\" Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedindeki raviler güvenilir zatlardır. Fakat sened munkati' (kesik) dir. Çünkü Ali bin el-Medini ve İbn-i Main: Ebu Seleme, Talha (r.a.)'den bır şey işitmemiş, demişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3926,
			"arabicnumber": 3926,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ben (rü'yada) ğul (— boyuna takılan lala — yi görmek) den hoşlanmam ve kayd (—ayağa takılan pranga — yı görmek)! severim. Kayd (yâni pranga) dinde sebat etmektir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 34
			}
		}
	]
}