{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4100,
			"arabicnumber": 4100,
			"text": "“..... Ebû Zerr-i Gıfârî (radıyallahü anh)’den rivâyet edildiğine göre ; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: rağbet göstermemek, ondan yüz çevirmek, ne helâl şeyi haram etmekledir, ne de malı zayi etmek (atmak veya yersiz harcamak) tadır. Ve lâkin dünyaya rağbet göstermemek, senin ellerinde bulunan (nimet ve imkânlar) a Allah'ın elinde (yani hazînesinde) olan (nimet ve imkânlar) dan fazla güvenir (umutlanır) olmamandır ve başına bir musibet geldiği zaman sevabından dolayı ona gösterdiğin rağbet (ve rızan) ın, başına o musibetin faraza gelmemiş olması arzusundan fazla olmasıdır.) dediki: Ebû İdrîs el Havlani, konuşmasında : Hadisler içinde bu hadîsin durumu altın içinde som altının durumu gibidir, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4101,
			"arabicnumber": 4101,
			"text": "“..... Sahâbîlik şerefine kavuşan Ebû Hallâd (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: kendisine dünyaya rağbet göstermemek ve az konuşmak hasleti verilmiş olarak bir adam gördüğünüz zaman ona yaklaşınız (sözlerini dikkatle dinleyiniz). Çünkü o kimse hikmetli söz söyler (veya kalbine hikmet ilham edilir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4102,
			"arabicnumber": 4102,
			"text": "“... Sehl bin Sa'd es-Sâidî (radıyallahü anh)’den; Şöyle demiştir: adam (bir gün) Peygamber (sallallahü aleyhi ve sellem)’in yanına gelerek: Resûlallah! Bana öyle bir amel (ibâdet) göster ki ben onu işlediğim zaman beni Allah sevsin ve insanlar da sevsin, dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) (ona) : rağbet gösterme ki Allah seni sevsin ve insanların ellerinde bulunan (nimet ve imkânlar) dan yüz çevir ki onlar (da) seni sevsin,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4103,
			"arabicnumber": 4103,
			"text": "“... Ebû Vâil (Şakîk bin Seleme)nin kavminden bir adam olan Semûre bin Sehm (radıyallahü anhüma)’dan; Şöyle demiştir : Hâşim bin Utbe (radıyallahü anh), veba hastalığına yakalanmış halde iken yanına vardım. Biraz sonra Muâviye (bin Ebî Süfyân) (radıyallahü anhümâ), onun ziyaretine geldi. Ebû Hâşim bir ara ağladı. Bunun üzerine Muâviye: ağlatan şey nedir? Ey Dayım! Seni ızdıraba sokan bir acı mı, yoksa artık safası gitti (diye) dünyaya düşkünlük mü? dedi. Ebû Hâşim: Onların hiç birisi için değildir. Ve lâkin Resûlüllah (sallallahü aleyhi ve sellem) bana bir tavsiyede bulundu, keşki o tavsiyeye uymuş olaydım (diye hayıflanıyorum). O : Ebâ Haşim!) Senin, bâzı kavimler arasında taksim edilecek (hazîneye âit) bir takım mallara yetişmen kuvvetle umulur. O mallardan sana ancak bir hizmetçi ve Allah yolunda (üstünde yolculuk edeceğin) bir binek hayvanı yeter,) buyurdu (idi). Sonra ben (o mallara) yetiştim de (o tavsiye hilâfına mal) biriktirdim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4104,
			"arabicnumber": 4104,
			"text": "“... Enes (radıyallahü anh)'den; Şöyle demiştir: (ı Fârisî) (radıyallahü anh) hastalandı. Sa'd (bin Ebî Vakkas) (radıyallahü anh) da onu ziyarete gitti. Baktı ki Selmân ağlıyor. Bunun üzerine Sa'd, ona: Seni ağlatan nedir? Sen Resûlüllah (sallallahü aleyhi ve sellem) ile arkadaşlık etmek şerefine kavuşmadın mı? (Şöyle) değil mi, (böyle) değil mi? (yani şu ve bu faziletlerin var), dedi. Selmân: iki şeyden birisi için ağlamıyorum: Ben ne dünyaya bir düşkünlükten dolayı ne de âhiretten hoşlanmamaktan dolayı ağlıyorum. Ve lâkin Resûlüllah (sallallahü aleyhi ve sellem) bana bir tavsiyede bulundu (idi) de ben kendimi o tavsiyenin sınırlarını mutlaka aşmış sanırım (yani bundan dolayı ağlıyorum), dedi. Sa'd: sana ne tavsiye buyurdu? diye sordu. Selmân: O, bana: (Binek hayvanı üstünde yolculuk edenin azığı kadar (mal) birinize yeter,) diye tavsiyede bulundu (idi). Halbuki ben kendimi o tavsiyenin sınırlarını mutlaka aşmış sanırım. Sana gelince Yâ Sa'd: Hüküm vereceğin zaman hükmünde, (hakları) taksim edeceğin zaman dağıtımında ve bir şeye niyetlendiğin zaman azminde Allah'tan kork (azabından sakın), dedi. Sabit demiştir ki: Selmân (radıyallahü anh) ‘ın (vefat ettiğinde) yanında olan yirmi küsur dirhemlik nafakadan başka bir mal bırakmadığı haberi bana ulaştı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4105,
			"arabicnumber": 4105,
			"text": "“... Ebân bin Osman bin Affân (radıyallahü anhümâ)'dan; Şöyle demiştir: bin Sabit (radıyallahü anh) (bir defa) gündüz yarısı (halîfe) Mervân (bin el-Hakem) 'in yanından çıktı. Ben: Mervân bu (zamansız) saatte Zeyd bin Sâbit'e mutlaka sormak istediği bir şey için ona haber gönderdi (yanına çağırttı), dedim ve (çağırılma sebebini) Zeyd bin Sâbit'e sordum. Bunun üzerine Zeyd : bize Resûlüllah (sallallahü aleyhi ve sellem)’den işittiğimiz bâzı şeyler sordu. Ben, Resûlüllah (sallallahü aleyhi ve sellem)'den şu buyruğu işittim, dedi: ki arzusu, amacı dünya olursa Allah o kimsenin aleyhine işini darmadağın eder, fakirliğini iki gözünün arasında kılar (yani dünyalığı elde etmek uğrunda sıkıntılar çeker, ihtirası da dinmez) ve dünya (nimet ve malın) dan kendisi için (kaderinde) yazılmış olan miktardan başka hiç bir şey ona gelmez. Kimin niyeti, arzusu âhiret olursa Allah o kimse için (dağınık) işini toparlar (düzenler), zenginliğini kalbine yerleştirir, dünya (nimetleri ile malı) da boyun eğerek ona (rahatlıkla) gider.) \" Abdullah (bin Mes'ûd) (radıyallahü anh)'den; Şöyle demiştir: Peygamberimiz (sallallahü aleyhi ve sellem)’den şu buyruğu işittim : çok arzuları tek arzu — Âhiret arzusu — hâline döndürürse, Allah onun dünyaya ait arzusu için yeterdir. Ve kim ki dünya ahvali hakkındaki arzuları dağılırsa veya arzular kendisini dağıtırsa, derelerinin hangisinde helak olduğuna Allah iltifat etmeyecektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4106,
			"arabicnumber": 4106,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4107,
			"arabicnumber": 4107,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4108,
			"arabicnumber": 4108,
			"text": "“... Benî Fihr'in kardeşi el-Müstevrid (radıyallahü anh)'den; Şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem) 'den şöyle buyururken işittim : (Âhiret (nimetleri) karşısında dünya (nimetleri) nin durumu (ve değeri) ancak birinizin (el) parmağını denizin içine koyması durumu (gibi)dir. Artık parmağın (o sudan) ne ile döneceğine bir bakıversin",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4109,
			"arabicnumber": 4109,
			"text": "“... Abdullah (bin Mes'ûd) (radıyallahü anh)'den; Şöyle demiştir: (sallallahü aleyhi ve sellem) bir hasır üzerinde yattı. Hasır O'nun (mübarek) derisinde iz yaptı. Bunun üzerine ben : anam sana feda olsun Yâ Resûlallah! Keşki bize haber vereydin de senin için hasır üstüne, seni on (un iz yapmasın) dan koruyacak bir şey sereydik, dedim. Sonra Resûlüllah (sallallahü aleyhi ve sellem) : dünya (nimetleri) ile beraber değilim. Benim dünya ile beraberliğim ancak bir ağacın altında biraz gölgelenip (dinlenip), sonra giden ve ağacı bırakan (yolcu) bir binici (nin ağaçla beraberliği) gibidir), buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4110,
			"arabicnumber": 4110,
			"text": "“... Sehl bin Sa'd (radıyallahü anhümâ)'dan; Şöyle demiştir: Zü’l-Huleyfe'de Resûlüllah (sallallahü aleyhi ve sellem)’in beraberinde idik. O, şişkinlikten ayağı havaya kalkmış murdar bir davarla ani olarak karşılaştı. Bunun üzerine O : murdar davarın sahibinin yanında kıymetsiz olduğunu görüyor musunuz (veya biliyor musunuz)? Nefsim (kudret) elinde olan (Allah) a yemin ederim ki Allah katında dünya, sahibi yanında şu davardan daha kıymetsizdir ve eğer dünya Allah katında bir sivrisinek kanadı kadar kıymetli olsaydı Allah bir kafire dünya (suların) dan bir damla (bile) hiç içirmezdi,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4111,
			"arabicnumber": 4111,
			"text": "“... El-Müstevrid bin Şeddâd (radıyallahü anh)’den; Şöyle demiştir : (sallallahü aleyhi ve sellem), atılmış murdar bir sahle (yani kuzu veya oğlak) üzerine vardığı zaman beraberinde bulunan kervan içinde ben (de) muhakkak vardım. El-Müstevrid demiştir ki : Resûl-i Ekrem (sallallahü aleyhi ve sellem) (o ölü hayvanın başına vardıktan) sonra: murdar hayvanın sahipleri yanında kıymetsiz olduğunu görüyor (veya biliyor) musunuz?) buyurdu — veya buyurduğu gibidir —. El-Müstevrid demiştir ki (bu soru üzerine) : Resûlallah! Sahipleri onu ancak kıymetsizliğinden dolayı atmışlar, denildi. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : (kudret) elinde olan (Allah) a yemin ederim ki Allah yanında dünya, sahipleri yanında şu hayvandan daha kıymetsizdir,) buyurdu. \" '..... Ebû Hüreyre (radıyallahü anh)’den; Şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem) 'den şunu buyururken işittim : mel'ûn (yani Allah katında kabule şayan olmaktan, O'nun iltifatından uzak) dır. Dünyadaki şeyler de mel'ündur. Ancak Allah'ı anmak, Allah'ın sevdiği (veya Allah'ı anmaya yakın, uygun) şeyler, âlim ve ilim öğrenen (in dînî ilimlerle meşguliyetleri) bu hükmün dışındadır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4112,
			"arabicnumber": 4112,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4113,
			"arabicnumber": 4113,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4114,
			"arabicnumber": 4114,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (Dünya mü'minin zindanı ve kâfirin cennetidir.) \" \". . . (Abdullah) bin Ömer (radıyallahü anhümâ)’dan; Şöyle demiştir : (sallallahü aleyhi ve sellem) vücûdumun bazısını (iki omuzu) tuttu ve: Abdallah! Sen dünyada (vatanından uzak) bir yabancı gibi yahut bir yoldan geçen (yolcu) gibi ol ve kendi nefsini mezarlar halkından (ölülerden) say, buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4115,
			"arabicnumber": 4115,
			"text": "“... Muâz bin Cebel (radıyallahü anh)’den; Şöyle demiştir: (sallallahü aleyhi ve sellem) (bana) : (Sana cennetin padişahların (ın sıfatların) dan haber vermiyeyim mi?) buyurdu. Ben: (haber ver), dedim. (Bunun, üzerine) O: olup (toplum nazarında) zayıf görülen, eski iki parça elbiseye bürünen, kendisine hiç değer ve iltifat gösterilmeyen ve (bir şeyin olması veya olmaması için) Allah'a yemin (veya duâ) ederse Allah onun duası (veya yemini) nin gereğini (keremiyle) yapacak (derecede Allah katında kıymetli mü'min) olan her adamdır,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4116,
			"arabicnumber": 4116,
			"text": "“... Harise bin Vehb (el-Huzâî) (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : ediniz! Ben size cennetlik olanları haber veriyorum: Zayıf olup (toplum nazarında) zayıf görülen her (mü'min) kimse. Dikkat ediniz! Ben size cehennemlik olanları (da) haber veriyorum: Katı yürekli, mal biriktirmeye çok düşkün olup hayırda harcamamak için çok cimrilik eden ve ululuk taslıyan kimseler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4117,
			"arabicnumber": 4117,
			"text": "“... Ebû Ümâme (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: itikadıma göre hâline insanların en çok imrenmeleri uygun olan kişi şu sıfatları taşıyan kimsedir: (Yükü ve) Hâli hafif, namazdan pay sahibi, insanlar içinde gizli kalan (pek tanınmayan) ve (toplumda) kendisine değer verilmeyip iltifat edilmeyen mü'min. Onun rızkı yetecek kadar olup buna sabretti. Ölümü de çabuk oldu, mîras olarak geriye bıraktığı mal az, (arkasında) ağlıyan kadınları da azdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4118,
			"arabicnumber": 4118,
			"text": "“... Ebû Ümâme el-Hârisî (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: imândandır. ) demiştir ki Bezâze kişinin üst ve başının eskiliğidir. Yani (gönül alçaklığı maksadıyla) sert ve süssüz eski elbise giymektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4119,
			"arabicnumber": 4119,
			"text": "“... Esma bint-i Yezîd (radıyallahü anha)'dan rivâyet edildiğine göre; Kendisi Resûlüllah (sallallahü aleyhi ve sellem)’in (sahâbîlerine) : ediniz! Ben size en hayırlı olanlarınızı bildirmiyeyim mi?) buyurduğuna, sahâbîlerin (de) : (yani bize bildir) Yâ Resûlallah, diye karşılık verdiklerine ve Resûl-i Ekrem (sallallahü aleyhi ve sellem)’in (bunun üzerine) : en hayırlılarınız o (mü'min) kimselerdir ki görüldükleri zaman Allah (Azze ve Celle) hatırlanır), buyurduğuna şâhid olmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4120,
			"arabicnumber": 4120,
			"text": "“... Sehl bin Sa'd es-Sâidî (radıyallahü anh)’den; Şöyle demiştir: kere Resûlüllah (sallallahü aleyhi ve sellem)'in yanından (zengin) bir adam geçti. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) (yanında bulunanlara) : (zengin) adam hakkında ne dersiniz?) buyurdu. Orada bulunanlar: adam hakkında senin görüşüne uygun söz söyleriz. (Dış görünüşe göre ve dünyalık açısından ise) şöyle söyleriz: Bu adam insanların en şereflilerindendir. Bu adam (bir kız kadın ile) evlenmek isterse evlenilmeye, (bir şey için) şefaatçi (aracı) olursa, şefaatçiliği (aracılığı) kabul edilmeye, bir şey söylerse sözü dinlenmeye lâyık bir kimsedir, dediler. Peygamber (sallallahü aleyhi ve sellem) de sustu. Bu esnada (fakir olan) başka bir adam geçti. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) : adam hakkında ne dersiniz?) diye sordu. Orada bulunanlar : Vallahi Yâ Resûlallah! Biz şöyle deriz: Bu adam, müslümanların fakirlerindendir. Bu şuna layıktır! (Bir kız-kadın ile) evlenmeye talip olursa onunla evlenilmez, (bir şey için) şefaatçi (aracı) olursa şefaatçiliği (aracılığı) kabul edilmez ve bir şey söylerse sözü dinlenmez, dediler. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) : (fakir) şüphesiz, öbür (zengin) adam gibi dünya dolusu insanlardan hayırlıdır) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4121,
			"arabicnumber": 4121,
			"text": "“... İmrân bin Husayn (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : şüphesiz, maddî yönden bakıma muhtaç çoluk çocuk sahibi olup dilencilik ve haram kazançtan kaçan, fakir mü'min kulunu sever",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4122,
			"arabicnumber": 4122,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4123,
			"arabicnumber": 4123,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4124,
			"arabicnumber": 4124,
			"text": "“... Abdullah bin Ömer (radıyallahü anhümâ)'dan; Şöyle demiştir: fakirleri, Allah'ın zengin muhacirlere kendilerinden fazla mazhar kıldığı fazilet (bir takım mâlî ibâdetler) hususunda Resûlüllah (sallallahü aleyhi ve sellem)'e şikâyette bulundular (yani zenginleri gibi mâli ibâdetler yapamamanın üzüntüsünü arz ettiler). Bunun üzerine O: fakirler gurubu, dikkat ediniz! Ben mü'mirilerin fakirlerinin cennete zenginlerinden yarım gün, (yani) beşyüz yıl önce gireceklerini size müjdeliyorum) buyurdu. Mûsâ (bu hadîsi rivâyet ettikten) sonra şu âyeti okudu: . . . . . \"ve şüphesiz, senin Rabbin katındaki bir gün, sizin saymakta olduğunuz bin yıl gibidir. \" (Hac, 47)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4125,
			"arabicnumber": 4125,
			"text": "“... Ebû Hüreyre (radıyallahü anh)'den; Şöyle demiştir: bin Ebî Tâlib (radıyallahü anh), fakirleri (çok) sever, onların yanında oturur, onlarla konuşur (sohbet eder) ve onlar da onunla konuşur (sohbet eder) di. Resûlüllah (sallallahü aleyhi ve sellem) de ona (Ebü'l-Mesâkin (yani fakirlerin babası)) ismini verirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4126,
			"arabicnumber": 4126,
			"text": "“... Ebû Saîd-i Hudrî (radıyallahü anh)’den; Şöyle demiştir : seviniz. Çünkü ben Resûlüllah (sallallahü aleyhi ve sellem)'i duasında şöyle derken işittim: Beni miskin olarak yaşat, miskin olarak öldür ve beni miskinler zümresi içinde haşret",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4127,
			"arabicnumber": 4127,
			"text": "“... Habbâb (bin Eret) (radıyallahü anh)’den rivâyet edildiğine göre kendisi Allahü teâlâ’nın; akşam, Rab’lerinin nzâsını dileyerek O'na duâ edenleri (yanından) kovma. Onların hesabından sana bir sorumluluk yoktur, senin hesabından da onlara bir sorumluluk yoktur ki onları kovup da zâlimlerden olasın. \" (En'âm, 52) buyruğu hakkında şöyle demiştir: bin Habis et-Temîmi ve Uyeyne bin Hısn el-Fezârî (Resûlüllah (sallallahü aleyhi ve sellem)'in ziyaretine) geldiler ve Resûlüllah (sallallahü aleyhi ve sellem)'i mü'minerin zayıflarından bir gurubun içinde oturup Suheyb, Bilâl, Ammâr ve Habbâb ile beraber iken buldular; Peygamber (sallallahü aleyhi ve sellem)’in etrafında onları (yani zayıf, fakir, nüfuzsuz sahâbileri) görünce o zayıf sahâbîleri küçümsediler, hakir gördüler. Nihayet Onun yanına varıp O'nunla yalnız kaldılar (yani biz de bir kenara çekildik) ve onlar: (Yâ Resûlallah, ziyaretine geldiğimizde) bir oturumu bize tahsis etmeni muhakkak isteriz ki Araplar bununla bizim üstünlüğümüzü tanısınlar. Çünkü senin yanına Arap hey'etleri gelir. Bu itibarla Arabların bizi şu kölelerle (yani fakir müslümanlarla) beraber görmelerinden utanırız. Onun için biz senin yanına geldiğimiz zaman köleleri yanından kaldır. Sonra biz huzurundan ayrılınca dilersen onlarla beraber otur, dediler. Resûl-i Ekrem (sallallahü aleyhi ve sellem) (de) : buyurdu. Bu kere onlar: halde bu teklifimizi kabul buyurduğuna dâir bizim için bir yazı yazdır, dediler. Habbâb dedi ki: Bunun üzerine Resûl-i Ekrem (sallallahü aleyhi ve sellem) bir yaprak kâğıd istedi ve yazı yazması için Ali (radıyallahü anh)'ı çağırttı. Biz de meclisin bir kenarında oturuyorduk. O sırada Cebrail (Aleyhisselâm) indi ve; akşam Rab'lerinin rızâsını dileyerek O'na duâ edenleri (yanından) kovma. Onların hesabından sana bir sorumluluk yoktur, senin hesabından da onlara bir sorumluluk yoktur ki onları kovup da zâlimlerden olasın. \" (Enam, 52) âyetini (indirip) söyledi. Sonra el-Akra' bin Habis ve Uyeyne bin Hısn'ı anlatarak: işte böylece, \"Allah aramızdan şunlara mı lütûfta bulundu?\" deyiversinler diye bâzısını bâzısıyla imtihan ettik. Allah şükredenleri en iyi bilen değil midir?\" (En'âm, 53) âyetini (indirip) söyledi. Bundan sonra: imân edenler sana geldikleri zaman (onlara) de ki: Selâm sizlere. Rabb'iniz rahmet etmeyi kendi üzerine aldı — vaadetti —. \" (En'âm, 54) âyetini (indirip) söyledi. dedi ki: Bu âyetler indikten sonra biz O'na öyle yaklaştık ki dizlerimizi O'nun dizi üzerine bıraktık ve Resûlüllah (sallallahü aleyhi ve sellem) bizimle beraber otururdu. Sonra kalkmak istediği zaman kalkar ve bizi bırakırdı (yani biz ondan sonra kalkıp dağılırdık) . Sonra Allah (Azze ve Celle) : rızâsını dileyerek sabah akşam O'na duâ edenlerle beraber nefsini sabırlı tut (yani onlarla sohbet etmeye tahsis et); dünya hayatının süsünü arzulayarak gözlerini o kimselerden (başkasına) çevirme (eşraf kimselerle—özel— oturum yapma). Bizi anmak hususunda kalbine gaflet verdiğimiz ve hevesine uyup da işi furut (yani helak olmak) olan (yani Uyeyne ve el-Akra')a uyma\" (Kehf, 28) âyetini indirdi. Habbâb: ( . . . . . . dan maksad) Uyeyne ve el-Akra'nın işidir, dedi. (Habbâb sözüne devamla) Sonra Allah onlara (yani mü’minlere ve kâfirlere) iki adamın misâlini (Kehf sûresinin 32 ilâ 44. âyetlerinde) ve dünya hayatının misâlini (Kehf sûresinin 45. âyetinde) getirdi (yani anılan âyetleri indirdi). dedi ki: (Kehf sûresinin 28. âyeti indirildikten) sonra biz (yani fakir-zayıf sahabiler) Peygamber (sallallahü aleyhi ve sellem)'in beraberinde otururduk. O'nun kalkacağı saate varınca biz O'nu bırakıp kalkıyorduk ki, O da kalksın",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4128,
			"arabicnumber": 4128,
			"text": "“... Sa'd (bin Ebî Vakkas) (radıyallahü anh)’den; Şöyle demiştir: âyet biz altı kişi hakkında indi: Benim hakkımda ve İbn-i Mes'ûd, Suheyb, Ammâr, Mıkdâd ve Bilâl (radıyallahü anhüm) hakkında. dediki, Kureyş (müşrikleri) Resûlüllah (sallallahü aleyhi ve sellem)'e: Biz onlara (yani yukarda isimleri geçen sahâbîlere) tâbi olmaya kesinlikle razı olmayız. Bu sebeple onları yanından kov, diye teklifte bulundular. Sa'd, dedi ki: Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem)'in kalbine girmesini Allah'ın dilediği bir şey (yani tekliflerine uymak düşüncesi) de O'nun kalbine girdi. Sonra Allah (Azze ve Celle) : rızâsını dileyerek sabah akşam O'na dua edenleri (yanından) kovma..... \" âyetini (En'âm, 52) indirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4129,
			"arabicnumber": 4129,
			"text": "“... Ebû Saîd-i Hudrî (radıyallahü anh)’den. rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) : şöyle, şöyle, şöyle ve şöyle yapanlar hâriç, dünyalığı çok olanlara yazıklar olsun,) buyurdu. (\"Şöyle\" kelimesi) dört (defa buyurulmuş) tur: (Yani) Sağından, solundan, önünden ve arkasından (fakirlere, hayır yollarına harcayanlar)",
			"grades": [
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4130,
			"arabicnumber": 4130,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4131,
			"arabicnumber": 4131,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4132,
			"arabicnumber": 4132,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: Uhud (dağı) kadar altın olup da ondan bir parça yanımda kaldığı halde (iki gün geçip) üçüncü bir gecenin gelmesini sevmem. Bir borcu ödemek üzere (o altından) saklıyacağım parça hâriç",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4133,
			"arabicnumber": 4133,
			"text": "“... Amr bin Ğaylân es-Sakafî (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: Kim bana imân edip beni tasdik eder (doğrular) ve getirdiğim (Din) in senin katından (gelme) yegâne hak (din) olduğunu bilirse, sen o kimseye az mal ve az çocuk ver, sana kavuşmayı ona sevimli kıl ve ölümünü çabuklaştır (yani ömrünü uzun tutma). Kim de bana imân etmez, beni tasdik etmez (doğrulamaz ) ve benim getirdiğim (Din)in senin katından (gelme) yegâne hak (din) olduğunu bilmezse o kimseye çok mal ve çok çocuk ver ve ömrünü uzat",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4134,
			"arabicnumber": 4134,
			"text": "“... Nukade el-Esedî (radıyallahü anh)’den; Şöyle demiştir; (sallallahü aleyhi ve sellem) beni bir adama göndererek ondan meniha (yani geçici bir süre için karşılıksız sütünden yararlanılacak) bir dişi deve istedi. Adam bu isteği yerine getirmedi. Sonra Resûlüllah (sallallahü aleyhi ve sellem) beni başka bir adama gönderdi. Bu adam O'na (sağmal) bir deve gönderdi. Resûlüllah (sallallahü aleyhi ve sellem) deveyi görünce : (Allahım! Bu deveyi ve onu göndereni bereketlendir,) diye duâ buyurdu. demiş ki: Bunun üzerine ben Resûlüllah (sallallahü aleyhi ve sellem)'e; (bereket duası) Deveyi getirene de (şümullendirilse), dedim. O: deveyi getireni (de bereketlendir),) diye duâ buyurdu. Sonra devenin sağılmasını emretti. Bunun üzerine deve sağıldı ve bol süt verdi. Sonra Resûlüllah (sallallahü aleyhi ve sellem) (sağmal deve vermekten imtina eden ilk adam için): Falanın malını çoğalt,) diye duâ etti ve deve gönderen adam için de: Falanın rızkını gün be gün eyle,) diye duâ etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4135,
			"arabicnumber": 4135,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir; kulu, gümüş kulu, saçaklı elbise kulu ve kareli elbise kulu olan kimse mutsuz olsun. O (çıkar düşkünü muhteris) kişiye (dilediği) verilirse memnun olur, verilmezse (ödevini) îfâ etmez",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4136,
			"arabicnumber": 4136,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: kulu, gümüş kulu ve kareli elbise kulu olan kimse, sürünsün ve baş aşağı yuvarlansın. Vücûduna diken batınca da cımbızla çıkaran bir kimseyi bulamasın",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4137,
			"arabicnumber": 4137,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : mal çokluğundan değildir. Lâkin zenginlik nefis (ve gönül) zenginliğidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4138,
			"arabicnumber": 4138,
			"text": "“... Abdullah bin Amr bin el-As (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur (İslâm dinine erdirilen, yetecek derecede rızkı verilen ve buna kanaatkâr olan kimse muhakkak felah bulmuştur)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4139,
			"arabicnumber": 4139,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4140,
			"arabicnumber": 4140,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4141,
			"arabicnumber": 4141,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4142,
			"arabicnumber": 4142,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (dünya işlerinde) kendinizden aşağı olanlara bakınız ve (dünyalık bakımından) sizden yukarı olanlara bakmayınız. Çünkü bu, Allah'ın nimetini küçümsememenize daha lâyıktır.) Ebû Muâviye (kendi rivâyetinde) \"üzerinizde olan — nimetini —\" demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4143,
			"arabicnumber": 4143,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: şüphesiz (mükâfatlandırma veya cezalandırma bakımından) sizin suretlerinize ve mallarınıza bakmaz ve lâkin ancak amellerinize ve kalblerinize bakar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4144,
			"arabicnumber": 4144,
			"text": "“... Âişe (radıyallahü anhâ)'dan; Şöyle demiştir: biz Muhammed (sallallahü aleyhi ve sellem)'in âli (yani ev halkı) kesinlikle bir ay durup (bir yiyecek pişirmek için) o süre içinde ateş yakmazdık. O, (yani yiyecek ve içecek olarak evde kullanılan şey) yalnız kuru hurma ve su idi. (Râvi İbn-i Nümeyr: \"Bir ay kalırdık\" demiştir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4145,
			"arabicnumber": 4145,
			"text": "“... Âişe (radıyallahü anhâ)'dan; Şöyle demiştir: olsun ki) Muhammed (sallallahü aleyhi ve sellem)'in evlerinin hiç birisinde ateş dumanı görülmeksizin Onun ev halkının (üzerinden bir ay geçerdi ve) üzerlerine yeni ay gelirdi. râvisi Ebû Seleme demiş ki) Ben (Âişe'ye) : onların yemeği ne idi? dedim. Âişe: iki şey: Kuru hurma ve su. Bir de şu var ki, Ensâr'dan olan sadakatli komşularımız vardı. Bunların sağmalları bulunurdu. İşte bunlar sağmallarının sütlerini O'na gönderirlerdi. (O da bize içirirdi), dedi. Muhammed demiş ki: Ve onlar (yani Peygamber (sallallahü aleyhi ve sellem)'in Ehli Beyt'i) dokuz evdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4146,
			"arabicnumber": 4146,
			"text": "“... Ömer bin el-Hattâb (radıyallahü anh)’den; Şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem)’i açlıktan bütün gün kıvranıp karnını doyuracak kötü hurma (bile) bulamıyorken gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4147,
			"arabicnumber": 4147,
			"text": "“... Enes bin Mâlik (radıyallahü anh)’den; Şöyle demiştir: Ben, Resûlüllah (sallallahü aleyhi ve sellem)'den defalarca : (Muhammed'in canı (kudret) elinde olan (Allah) a yemin ederim ki Muhammed'in ev halkı yanında ne bir sâ dâne (yani hububat) ne de bir sâ kuru hurma sabahladı,) buyruğunu işittim. O gün O'nun dokuz zevcesi şüphesiz vardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4148,
			"arabicnumber": 4148,
			"text": "“... Abdullah (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) : ev halkında bir müd yemekten başka (azık olarak) bir şey sabahlamadı) veya (Muhammed'in ev halkında bir müd yemek (bile) sabahlamadı) buyurdu, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4149,
			"arabicnumber": 4149,
			"text": "“... Süleyman bin Sured (radıyallahü anh)’den: Şöyle demiştir: (sallallahü aleyhi ve sellem) yanımıza geldi ve bir yiyecek maddesine gücümüz yetmediği (veya O'nun gücü yetmediği) halde üç gece (yemeksiz) durduk",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4150,
			"arabicnumber": 4150,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den: Şöyle demiştir: gün Resûlüllah (sallallahü aleyhi ve sellem)'e sıcak bir yemek getirildi. O da yedi ve yemekten sonra: Hamdü lillâh (=Hamd Allah'a mahsustur). Şu ve şu kadar zamandan beri karnıma sıcak bir yemek girmedi (idi),) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4151,
			"arabicnumber": 4151,
			"text": "“... Âişe (radıyallahü anhâ)’dan: Şöyle demiştir: (sallallahü aleyhi ve sellem)’in, üstünde yattığı yatak, içi lif (yani hurma yaprağı) ile dolu tabaklanmış deri idi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4152,
			"arabicnumber": 4152,
			"text": "“... Ali (bin Ebî Tâlib) ve (eşi) Fâtıma (radıyallahü anhümâ) kendilerine âit bir hamil (hamil, yünden mamul, saçaklı beyaz çarşaftır) içinde (yatmakta) iken Resûlüllah (sallallahü aleyhi ve sellem) onlara vardı. Resûlüllah (sallallahü aleyhi ve sellem) o çarşafı, içi izhır (yani Mekke samanı denilen ot) ile doldurulmuş bir yastığı ve bir kırbayı (su tulumunu) cehiz olarak onlara vermişti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4153,
			"arabicnumber": 4153,
			"text": "Ömer bin el-Hattâb (radıyallahü anh)’den; Şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem)'in huzuruna (odasına) girdim. O, bir hasır üstünde (uzanmış) idi. Ömer demiştir ki: Biraz sonra oturdum. Baktım ki O'nun üzerinde bir îzâr (belden aşağı bedeni örten elbise) var ve üzerinde ondan başka bir şey yok. Bir de gördüm ki hasır O'nun mübarek böğründe iyice iz yapmış. Odasının bir kenarında da bir sâ (ölçeği) kadar bir tutam arpa ve biraz karaz (deri tabaklamada kullanılan selem ağacı meyvesi) gözüme ilişti. Henüz tabaklanmamış bir deriyi de asılı gördüm. Bu vaziyet karşısında gözlerim yaşardı (ağladım). Bunun üzerine O: (Seni ağlatan nedir, Ey Hattâbın oğlu?) buyurdu. Ben de: Ey Allah'ın Peygamberi! Nasıl ağlamıyayım? Şu hasır senin (mübarek) böğründe iyice iz yapmış, şu hazânen (yani azık için ayırdığın köşe) de gördüğüm şeyden başka bir şey göremiyorum. Halbuki şu Kisrâ ve Kayser, meyveler ile nehirler (nimetlerin) de bulunurlar. Sen ise Allah'ın peygamberi ve seçkin kulusun, kilerciğin de işte budur, dedim. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : Hattâb'ın oğlu! Âhiretin bize, dünyanın da onlara olmasına râzı olmaz mısın?) buyurdu. Ben: olurum, dedim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4154,
			"arabicnumber": 4154,
			"text": "Ali (bin Ebi Tâlib) (radıyallahü anh)'den; Şöyle demiştir: (sallallahü aleyhi ve sellem)’in kızı (Fâtıma gerdek gecesi) bana gönderildi. Zifaf gecesi yatağımız, bir koç derisinden başka bir şey değildi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4155,
			"arabicnumber": 4155,
			"text": "“... Ebû Mes'ûd (el-Ensârî) (radıyallahü anh)'den şöyle rivâyet edilmiştir: (sallallahü aleyhi ve sellem) sadaka vermeyi emrederdi. Bunun üzerine (sadaka vermeye mâlî gücü olmayan) herhangi birimiz iki avuç (hurma) getirebilmek için gidip sırtında (ücretle) yük taşırdı. Bu gün ise bunların birisinin yüz bin derle servet) i vardır. Mes'ûd'un râvisi) Şakîk demiş ki: Bana öyle geliyor ki Ebû Mes'ûd (bu sözle) kendi şahsını(n mâli durumunu) kasdediyor(du)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4156,
			"arabicnumber": 4156,
			"text": "“... Hâlid bin Umeyr (radıyallahü anh)’dan: Şöyle demiştir: bin Ğazvân (bin Câbir) minber üstünde bize bir hutbe okudu ve (hutbesinde ez cümle) şöyle dedi: Gerçekten ben kendimi Resûlüllah (sallallahü aleyhi ve sellem)'in beraberinde bulunan (ilk müslüman) yedi kişinin yedincisi olarak gördüm. Ağaç yaprağından başka yiyeceğimiz bir yemek yoktu. Hattâ (ağaç yapraklarını yediğimizden dolayı) ağızlarımızın etrafı yara oldu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4157,
			"arabicnumber": 4157,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre: gün arkadaşları ile) yedi kişi olarak (çok) acıkmışlar. Ebü Hüreyre demiş ki: Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) beher kişiye bir aded olmak üzere bana yedi tane kuru hurma verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4158,
			"arabicnumber": 4158,
			"text": "“... Zübeyr bin el-Avvâm (radıyallahü anh)’den rivâyet edildiğine göre : olsun ki) sonra o gün (kıyamette) nimet (in şükrün) den muhakkak sorulacaksınız. \" (Tekâsür, âyeti inince Zübeyr (bin el- Avvâmî (radıyallahü anh) : Resûlallah!) Biz hangi nimettin şükrün)den sorulacağız? (Bizdeki) nîmet ancak (şu) siyah iki şeydir: Kuru hurma ve su, dedi. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : olunuz ki, muhakkak o (sorulacağınız nîmet) olacaktır (yani bolluğa kavuşacaksınız),) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4159,
			"arabicnumber": 4159,
			"text": "“... Câbir bin Abdillah (radıyallahü anhümâ)’dan; Şöyle demiştir: (sallallahü aleyhi ve sellem) bizi üç yüz kişilik müfreze olarak bir sefere yolladı. Azıklarımızı (azlığından dolayı) boyunlarımızda taşıyorduk. Sonra azığımız tüken (meye başla) di. Öyle ki bizden beher adam (başın) a bir tane kuru kurma (nafaka verilir) oldu. (Câbir bu durumu anlatınca râvisi Vehb bin Keysân tarafından) : Ebâ Abdillah! Bir kuru hurma (aç) adam için ne yerine düşer? denildi. Bunun üzerine Câbir: kuru hurma (yı bile) bulamadığımız zaman yokluğunu (n ne olduğunu) cidden duyduk, dedi (ve sözüne devamla) sonra biz denize vardık. Orada denizin sahile attığı bir büyük balıkla aniden karşılaştık ve on sekiz gün o balıktan yedik",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4160,
			"arabicnumber": 4160,
			"text": "“... Abdullah bin Ömer (radıyallahü anhümâ)'dan; Şöyle demiştir: kendimize âit bir kulübeyi onarmakla meşgul iken Resûlüllah (sallallahü aleyhi ve sellem) yanıbaşımızdan geçti ve : (Bu nedir?) diye sordu. Ben de : eğilen bir kulübemizdir, biz onarıyoruz. dedim. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) : işin (in) ondan daha acele olduğunu sanırım,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4161,
			"arabicnumber": 4161,
			"text": "“... Enes (radıyallahü anh)’den; Şöyle demiştir: (sallallahü aleyhi ve sellem), Ensârdan bir adamın ev kapısının üstünde (yaptırdığı) bir binanın yanından geçti ve: bu?) diye sordu. Orada bulunanlar: falan adamın yaptığı bir binadır, dediler. Resûlüllah (sallallahü aleyhi ve sellem) (de) : (gereksiz binaya harcanan) her mal kıyamet günü sahibi aleyhinde bir vebaldir,) buyurdu. Sonra bu buyruk (ev sahibi olan) Ensâriye ulaştı. O da binayı (yıkıp) indirdi. Bir süre sonra Peygamber (sallallahü aleyhi ve sellem) (tekrar) oradan geçti ve o binayı göremedi, Bunun üzerine binaya ne olduğunu sordu. Sahibi senin buyruğunu işittiği için binayı (yıkıp) indirdi, diye O'na cevap verildi. O da : o adama rahmet eylesin, Allah o adama rahmet eylesin,) diye duâ etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4162,
			"arabicnumber": 4162,
			"text": "“... İbn-i Ömer (radıyallahü anhümâ)’dan; Şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem) zamanında kendimi yağmurdan ve güneşten koruyan (yani basit) bir evi elimle) yaptım. O evin yapımında Allahü teâlâ'nın hiç bir yaratığı bana yardım etmedi. O çalışmam sanki gözümün önündedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4163,
			"arabicnumber": 4163,
			"text": "“... Harise bin Mudarrib (radıyallahü anh)’den; Şöyle demiştir: Habbâb (bin el-Erett) (radıyallahü anh)'ı hastalığı dolayısıyla ziyarete gittik. Habbâb dedi ki; cidden uzadı ve eğer ben, Resûlüllah (sallallahü aleyhi ve sellem)'i : (Ölümü temenni etmeyiniz,) buyururken işitmiş olmasaydım, (hastalığın ıztırabından kurtulmak için) ölümü temenni edecektim. Kul (meşru olan) harcamasının hepsinde muhakkak sevaplanır. Yalnız toprağa yaptığın veya dedi ki; Binaya yaptığı harcama hâriç",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4164,
			"arabicnumber": 4164,
			"text": "“... Ömer (bin el-Hattâb) (radıyallahü anh)’den; Şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem)’i şöyle buyururken işittim: siz hakkıyle Allah'a tevekkül etseydiniz sabahleyin aç gidip akşamleyin tok olarak (yuvalarına) dönen kuşları rızıklandırdığı gibi sizi (de) muhakkak rızıklandırırdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4165,
			"arabicnumber": 4165,
			"text": "“... Hâlid'in oğulları Habbe ve Sevâ’ (radıyallahü anhümâ)’dan; Şöyle demişlerdir: (sallallahü aleyhi ve sellem) bir şeyi tamir etmekle meşgul iken onun yanına girdik. Biz de o işte O'na yardım ettik. Sonra bize şöyle buyurdu: hareket ettiği (yani yaşadığınız) sürece rızaktan ümitsiz olmayınız. Çünkü şüphesiz insanı kırmızı ve üstünde hiç bir elbise olmıyarak annesi doğurur. Sonra Allah Azze ve Celle onu rızıklandırır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4166,
			"arabicnumber": 4166,
			"text": "“... Amr bin el-Âs (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: her derede Âdem oğlunun kalbinden bir parça (kalbin rağbet edilen her şeyle bir ilişkisi) bulunur. Artık o parçaların hepsine uyarsa (yani tüm arzulara peşkeş olursa) o kimseyi hangi derede (yani arzu peşinde) helak ettiğine iltifat etmez (bakmaz). Kim de Allah'a tevekkül ederse, kalbinin dağınıklığı (nı önlemek) için o kimseye Allah yeterdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4167,
			"arabicnumber": 4167,
			"text": "“... Câbir (bin Abdillah) (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : sizden herhangi bir kimse Allah hakkında güzel zan (yani bağışlama ümidi) beslemekten başka bir halde ölmesin",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4168,
			"arabicnumber": 4168,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: mü'min zayıf mü'minden daha hayırlı ve Allah'a daha sevimlidir. Her ikisinde de hayır vardır. Sana menfaati olan (ibâdet ve mükâfatı gibi) şeylere düşkün ol ve (bu hususta) gevşeklik gösterme. Şayet bir iş seni yenerse \"Allah'ın takdiridir ve O, dilediğini yapar, de. Lev (= şunu yapsaydım, böyle olsaydı sözün) den iyice sakın. Çünkü Lev (= şunu yapsaydım, böyle olsaydı kelimesi), şeytân işine (ve vesvesesine) yol açar (= Kadere karşı gelmek düşüncesini kalbe sokar)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4169,
			"arabicnumber": 4169,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: söz, müminin yitiği (gibi)dir. Onu nerede bulursa almaya en çok hak sahibidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4170,
			"arabicnumber": 4170,
			"text": "“... İbn-i Abbâs (radıyallahü anhümâ)'dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : nimet vardır ki çok insanlar bu nimetler (i kullanma işin) de aldanmıştır : Sıhhat (yani insan sağlığı) ve boş vakit",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4171,
			"arabicnumber": 4171,
			"text": "“... Ebû Eyyûb (el-Ensârî) (radıyallahü anh) Şöyle demiştir: adam Peygamber (sallallahü aleyhi ve sellem)’in yanına gelerek: Resûlallah! Bana (faydalı şeyi) öğret ve özlü söyle, dedi. Resûl-i Ekrem (sallallahü aleyhi ve sellem) (de adama): (Namazına durduğun zaman veda edenin namazı gibi namaz kıl. Özür dilemeni gerektiren bir sözü konuşma ve insanların ellerindeki (dünyalık) şeylerden ümidini kesmeye azim ve karar ver,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4172,
			"arabicnumber": 4172,
			"text": "“... Ebû Hüreyre (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: yerde) oturup hikmetli konuşmayı dinledikten sonra (konuşmacı) arkadaşından işittiği (sözlerin) yalnız şer (yani yanılma, unutma veya dil sürçmesi eseri) olanı anlatan kişinin durumu şu adamın durumuna benzer ki, bir çobanın yanına varır ve : Ey çoban! Bana koyunlarından kesilmeye elverişli (semiz) bir koyun ver, diye talebte bulunur. Çoban (da) : Git de koyunların en iyisinin kulağından tut (götür), der. Bunun üzerine adam gidip sürünün köpeğinin kulağından tutar.) ... Bu hadisin mislini ..... senediyle Ebü'l-Hasan bin Seleme de bize rivâyet etti. Şu farkla ki râvi bu senedle rivâyet ettiği hadis metninde: \"Sürünün en iyi koyununun kulağından\" söyledi. (Yani \"şât = Koyun\" kelimesini ilâve etti ki bu kelime rivâyette yoktur)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4173,
			"arabicnumber": 4173,
			"text": "“... Abdullah (bin Mes'ûd) (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: hardal danesi ağırlığı kadar kibir bulunan kimse cennete girmiyecek ve kalbinde hardal danesi ağırlığı kadar imân bulunan kimse (ebedi) ateşe girmiyecektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4174,
			"arabicnumber": 4174,
			"text": "“... Ebû Hüreyre (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: Sübhânehu buyuruyor ki : Büyüklük ve azamet bana mahsus sıfatlarımdır. Kim bu iki sıfattan birisinde (bile) benimle nizalaşırsa (yani bu sıfatları kısmen de olsa takınmaya kalkışırsa) o kimseyi cehenneme atarım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4175,
			"arabicnumber": 4175,
			"text": "“... İbn-i Abbâs (radıyallahü anhüma)'dan rivâyet edildiğine göre ; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: Sübhanehu buyuruyor ki: Kibriya, benim rıdâ’mdır. Azamet de benim izarımdır. (yani bana mahsus sıfatlarımdır). Kim bu iki sıfattan birisinde (bile) benimle nizâlaşırsa (yani bu sıfatları kısmen de olsa takınmaya kalkışırsa) o kimseyi ateşe atarım",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4176,
			"arabicnumber": 4176,
			"text": "“... Ebû Saîd(-i Hudrî) (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: Allah Sübhanehu (rızâsı) için bir derece tevazu (alçak gönüllülük) ederse Allah o kimseyi buna karşılık olarak bir derece yükseltir. Kim de Allah (rızâsı) hilâfına bir derece kibirlenirse Allah bu kimseyi kibirlenmesine karşılık olarak bir derece alçaltır ki, nihayet onu aşağıların en aşağısında kılsın",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4177,
			"arabicnumber": 4177,
			"text": "“... Enes bin Mâlik (radıyallahü anh)’den; Şöyle demiştir: Medine halkından câriye (durumundaki yaşlı kadın bile) Resûlüllah (sallallahü aleyhi ve sellem)'in elinden tutar ve kendi ihtiyacı - işi için istediği Medine'nin her hangi bir semtine götürünceye kadar Resûl-i Ekrem (sallallahü aleyhi ve sellem) mübarek elini (yaşlı) kadının elinden çekip çıkarmazdı (yani bu derece üstün tevazu gösterirdi)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4178,
			"arabicnumber": 4178,
			"text": "“... Enes bin Mâlik (radıyallahü anh)’den; Şöyle demiştir: (sallallahü aleyhi ve sellem), hastayı ziyaret eder, cenazeyi takip eder, kölenin dâvetine icabet eder ve merkebe binerdi. O, Kurayza ve Nadir (savaş) günü bir merkeb üstünde idi. Hayber (savaş) günü de burnuna hurma yaprağından yapılma bir yuların takılı bulunduğu bir merkeb üstünde idi ve altında hurma yaprağından mamul (yani sert - kaba) bir semer vardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4179,
			"arabicnumber": 4179,
			"text": "“... Iyâz bin Himâr (radıyallahü anh)’den rivâyet edildiğine göre : (sallallahü aleyhi ve sellem) onlara bir konuşma yaparak şöyle buyurmuştur: (Azze ve Celle) : Birbirinize karşı alçak gönüllülük ediniz ki hiç kimse hiç kimseye üstünlük taslamasın, diye bana vahiy etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4180,
			"arabicnumber": 4180,
			"text": "“... Ebû Saîd-i Hudrî (radıyallahü anh)’den; Şöyle demiştir; (sallallahü aleyhi ve sellem), örtülü köşesinde duran bakire bir kızdan daha çok utangaçtı ve bir şeyden hoşlanmadığı zaman hoşnutsuzluğu (mübarek) yüzünde görülürdü",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4181,
			"arabicnumber": 4181,
			"text": "“... Enes (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: her dinin (mensuplarına özgü) bir huyu - karakteri vardır. İslâm (mensuplarına özgü) huyu - karakteri de hayadır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4182,
			"arabicnumber": 4182,
			"text": "“... İbn-i Abbâs (radıyallahü anhümâ)’dan rivâyet edildiğine göre ; Resûlüllah (sallallahü aleyhi ve sellem) söyle buyurdu, demiştir : her dinin (mensuplarına özgü) bir huyu - karakteri vardır. İslâm (dini mensuplarına özgü) huyu - karakteri de şüphesiz hayadır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4183,
			"arabicnumber": 4183,
			"text": "“... Ukbe bin Amr Ebû Mes'ûd (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: peygamberlerin sözlerinden (eksiksiz ve kesintisiz) insanların eriştiği haberlerden birisi de: Sen utanmayınca dilediğini işle! (sözü) dür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4184,
			"arabicnumber": 4184,
			"text": "“... Ebû Bekre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (utangaçlık) imândan (bir parça) dır. İmân (sahibi) de cennettedir. Hayâsızlık (ve bundan dolayı yapılan çirkin konuşma) ise cefâ'dan (bir parça) dır. Cefâ (eden) de ateştedir.) \" \" . . Enes (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: çirkin lâf hangi şey (yani kişi)de olduysa mutlaka onu lekeleyip çirkinleştirdi. Haya da hangi şey (kişi) de olduysa mutlaka onu süsledi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4185,
			"arabicnumber": 4185,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4186,
			"arabicnumber": 4186,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4187,
			"arabicnumber": 4187,
			"text": "“... Ebû Saîd el-Hudrî (radıyallahü anh)’den; Şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem)'in yanında oturuyorduk. Resûl-i Ekrem (sallallahü aleyhi ve sellem) (bu arada) : Abdü’l-Kays heyetleri geldi,) buyurdu. Halbuki içimizde hiç bir kimse öyle görmedi (yani O, henüz Medine'ye varmamış hey'etlerin geldiğini mu'cize olarak söyledi). Bir süre sonra gelip konakladılar ve sonra Resûlüllah (sallallahü aleyhi ve sellem)'in huzuruna çıktılar. Onlardan El-Eşeccü’l-Asari kaldı. O, sonra geldi. Çünkü o, bir konağa indi, devesini çökertti ve (yolculuk) elbisesini bir tarafa bıraktı. Sonra (temiz elbise giyip) Resûlüllah (sallallahü aleyhi ve sellem)’in yanına vardı. Resûlüllah (sallallahü aleyhi ve sellem) de ona: Eşecc! Sende Allah'ın sevdiği iki haslet gerçekten vardır : Akıllılık ve acele etmeyip teenniyle hareket etmek,) buyurdu. Eşecc : Resûlallah! (Bu hasletler), yaratılışımda bulunan bir şey mi, yoksa sonra mı bende meydana geldi? diye sordu. Resûlüllah (sallallahü aleyhi ve sellem) : yaratılışında bulunan bir şeydir,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4188,
			"arabicnumber": 4188,
			"text": "“... İbn-i Abbâs (radıyallahü anhümâ)'dan rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) el-Eşeccü’l-Asarî'ye: sende Allah'ın sevdiği iki haslet vardır: Akıllılık ve teenniyle hareket edip acele etmemek,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4189,
			"arabicnumber": 4189,
			"text": "“... İbn-i Ömer (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (mü'min) kulun sırf Allah rızâsını talep etmek için yuttuğu bir öfke yudumundan Allah katında sevap bakımından daha büyük bir yudum yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4190,
			"arabicnumber": 4190,
			"text": "“... Ebû Zerr(-i Gifârî) (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) : ben sizin görmediğiniz (gerçekler) i görürüm ve işitmediğiniz (gerçekler) i işitirim. Gök (âdeta) gıcırdadı ve gıcırdaması da hakkıdır. (Çünkü) gökte dört parmak yeri yoktur ki bir melek Allah'a secde etmek üzere (o yere) alnını koymasın. Allah'a yemin ederim ki. Benim bildiğim (gerçekleri) siz bilseydiniz az gülerdiniz ve çok ağlardınız. Yataklar üstünde kadınlardan da zevk duymazdınız ve (meskenlerinizden) yollara çıkıp Allah'a yüksek sesle yakarışta bulunurdunuz), buyurdu. (Ebü Zerr sözüne devamla) Vallahi ben kesilen bir ağaç olmamı cidden temenni ettim, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4191,
			"arabicnumber": 4191,
			"text": "“... Enes bin Mâlik (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : benim bildiğim (gerçekler) i siz bilseydiniz az gülerdiniz ve çok ağlardınız",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4192,
			"arabicnumber": 4192,
			"text": "“... Abdullah bin Zübeyr (radıyallahü anhümâ)’dan rivâyet edildiğine göre: müslümanlığı kabul etmeleri ile Allah'ın onları azarladığına dair (şu) âyetin inmesi arasında dört yıldan fazla zaman olmadığını söylemiştir : edenler bundan önce kendilerine kitâb verilen, sonra üzerlerinden uzun zaman geçip de kalbleri katılaşan ve çoğu dinden çıkan (yahûdiler ile hıristiyan) lar gibi olmasın.) (Hadid, 16)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4193,
			"arabicnumber": 4193,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : gülmeyiniz. Çünkü gülmenin çokluğu kalbi öldürür (yani katılaştınr)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4194,
			"arabicnumber": 4194,
			"text": "“... Abdullah (bin Mes'ûd) (radıyallahü anh)’den; Şöyle demiştir: (sallallahü aleyhi ve sellem) bana: (Yâ İbn-i Mes'ûd!) Bana Kur'ân oku, diye emretti. Ben de O'na Nisa sûresini okumaya başladım. Nihayet; ümmetten (onun peygamberini) birer şâhid getirdiğimiz, Mal de onlar üzerine şâhid olarak getirdiğimiz zaman (bakalım kâfirlerin hâli nasıl olacak?)\" — Nisa, 41 — âyetine ulaştığım zaman O'na baktım, O'nun iki gözünden yaşların akmakta olduğunu gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4195,
			"arabicnumber": 4195,
			"text": "“... El-Berâ (radıyallahü anh)’den; Şöyle demiştir: Biz, Resûlüllah (sallallahü aleyhi ve sellem) ile beraber bir cenazede idik. Resûlüllah (sallallahü aleyhi ve sellem) kabrin kenarı üzerinde oturdu. Sonra o kadar ağladı ki, toprak (O'nun göz yaşlarıyla) ıslandı. Daha sonra şöyle buyurdu: kardeşlerim! İşte bunun misli için (iyi amel) hazırlayınız",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4196,
			"arabicnumber": 4196,
			"text": "“... Sa'd bin Ebî Vakkas (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: korkusundan dolayı) ağlayınız. Eğer ağlamanız gelmezse, ağlamak için kendinizi zorlayınız",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4197,
			"arabicnumber": 4197,
			"text": "“... Abdullah bin Mes'ûd (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : korkusundan dolayı karasinek başı kadar (ufak) bile olsa iki gözünden yaşlar çıkıp dayanak yumrusunun bir yerine değen hiç bir mü'min kul yoktur ki, Allah onu ateşe haram etmesin",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4198,
			"arabicnumber": 4198,
			"text": "“... Âişe (radıyallahü anhâ)'dan; Şöyle demiştir: Resûlallah (Mü'minûn, 60) âyetinde — durumu belirtilen — mü'min zina eden, hırsızlık yapan ve içki içen kişi midir? diye sordum. O : Ey Ebû Bekir'in kızı (veya \"Ey Siddîk'ın kızı)! Ve lâkin o, kendisinden kabul olunmaması korkusu içinde oruç tutan, sadaka veren ve namaz kılan adamdır,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4199,
			"arabicnumber": 4199,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4200,
			"arabicnumber": 4200,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4201,
			"arabicnumber": 4201,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4202,
			"arabicnumber": 4202,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4203,
			"arabicnumber": 4203,
			"text": "“... Sahâbîlerden olan Ebû Sa'd bin Ebî Fadâle el-Ensârî (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: önce gelenleri ve sonra gelenleri (yani tüm insanları ve cinleri) kıyamet günü, vuku bulmasında şüphe olmayan (hesab) günü için topladığı zaman bir çağırıcı: Allah (rızâsı) için işlediği bir ibadete (Allah'tan başka bir kimsenin rızâsını) ortak etti ise sevabını Allah'tan başkasının (yani ortak koştuğu kimsenin) yanından taleb etsin. Çünkü Allah, ortakların ortaklıktan en müstağni olanıdır (yani hiçbir ortaklığa ihtiyacı yoktur), diye çağrıda bulunacaktır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4204,
			"arabicnumber": 4204,
			"text": "“... Ebû Saîd(-i Hudrî) (radıyallahü anh)’den; Şöyle demiştir: Biz (sahâbiler bir gün) Mesîh-i Deccâlı(n fitnesi hakkında kendi aramızda) müzâkere ederken Resûlüllah (sallallahü aleyhi ve sellem) üzerimize çıkageldi ve: (Bence sizin için Mesîh-i Deccâl'dan daha korkunç olan şeyi size haber vermeyeyim mi?) buyurdu. Ebû Saîd demiştir ki: Biz de: Buyur (haber ver), dedik. Bunun üzerine: için daha korkunç şey) gizli şirk (tir) ki: Adamın namaza durup da gördüğü bir başka adamın (kendisine) bakmasından dolayı namazını güzelleştirmesidir.) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4205,
			"arabicnumber": 4205,
			"text": "“... Şeddâd bin Evs (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: hakkında en çok korktuğum şey, Allah'a ortak koşma (suçunu işlemeleri) dir. Bilmiş olunuz ki: Şüphesiz onlar güneşe, aya veya puta tapacaklar diyecek değilim ve lâkin bir takım ibâdetleri Allah'tan başkası için işliyecekler ve gizli bir şehvet arzulayacaklar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4206,
			"arabicnumber": 4206,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4207,
			"arabicnumber": 4207,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4208,
			"arabicnumber": 4208,
			"text": "“... Abdullah bin Mes'ûd (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: katında sevimli) imrenme yalnız (şu) iki (haslet) de vardır : Allah'ın bir mal verip de onu hak (yolun) da harcamaya muvaffak ettiği adam (ın bu hasleti) ve Allah'ın bir hikmet verip de o hikmetle hükmeden ve onu öğreten adam (ın bu hasleti)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4209,
			"arabicnumber": 4209,
			"text": "“... Abdullah bin Ömer (radıyallahü anhümâ)'dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: katında sevimli) imrenme yalnız (şu) iki (haslet) de vardır: Allah'ın Kur'ân (bilgisini) verip de gece saatlerinde ve gündüz saatlerinde onunla amel eden adam (ın bu hasleti) ve Allah'ın mal verip de onu gece vakitlerinde ve gündüz saatlerinde hayır yolunda harcayan adam (ın bu hasleti)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4210,
			"arabicnumber": 4210,
			"text": "“... Enes (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: (yani başkasındaki bir nimeti çekememek), ateşin odunu yediği (mahvettiği) gibi sevabları yiyer (tüketir). Sadaka da suyun ateşi söndürdüğü gibi hatâyı söndürür. Namaz mü'minin nurudur. Oruç da ateşten koruyucu bir kalkandır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4211,
			"arabicnumber": 4211,
			"text": "“... Ebû Bekre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: sahibi için âhirete ertelediği ceza ile beraber dünyada (da) cezasını çabuklaştırmasına zulüm ve akraba ile iyi ilişkiyi kesme günahlarından daha lâyık bir günah yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4212,
			"arabicnumber": 4212,
			"text": "“... Mü'minlerin anası Âişe (radıyallahü anhâ)'dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: en çabuk olan hayır, yaratıklardan herhangi birisine iyilik etmek ve akraba ile iyi ilgilenmektir. Cezası en çabuk olan şer de, zulüm - yaratıklara kötü davranmak ve akraba ile iyi ilişkiyi kesmektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4213,
			"arabicnumber": 4213,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: kardeşini küçümsemek (suçu) adama şer (huy) olarak yeterdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4214,
			"arabicnumber": 4214,
			"text": "“... Enes bin Mâlik (radıyallahü anh)'den rivâyet edildiğine göre; (sallallahü aleyhi ve sellem) şöyle buyurmuştur: alçak gönüllü olunuz ve bâzınız bâzınıza zulüm edemez (etmesin) diye bana vahiy etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4215,
			"arabicnumber": 4215,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4216,
			"arabicnumber": 4216,
			"text": "“... Atiyye eş-Sa'dî —ki Peygamber (sallallahü aleyhi ve sellem)’in sahâbîlerinden idi— (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: sakıncalı şeyden korktuğundan dolayı sakıncasız şeyi de bırakmadıkça müttakiler derecesine erişemez.) \" '..... Abdullah bin Amr (bin el-As) (radıyallahü anhümâ)’dan; Şöyle demiştir: (sallallahü aleyhi ve sellem) 'e: Resûlallah)! İnsanların hangisi daha faziletlidir? diye soruldu. O : mahmûm (pâk) ve dili çok doğru olan her (mü'min) kişi,) buyurdu. Sahâbîler: Resûlallah)! Dili çok doğru olanı (n ne demek olduğunu) biliriz. Mahmûm kalb nedir? diye sordular. O: kalb), Allah'tan korkan, tertemiz, içinde ne günah, ne zulüm ile yaratıklara kötülük etmek, ne kin ne de hased (çekememezlik) olan (kalb) dir,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4217,
			"arabicnumber": 4217,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: Ebâ Hüreyre! Şüpheli (yani helâl mı, haram mı diye tereddüd ettiğin) şeylerden titizlikle sakın, (o takdirde) insanların (Allah'a) en çok kulluk edeni olursun. (Sana verilen dünyalığa) kanaatkar ol, (o zaman) insanların (Allah'a) en çok şükredeni olursun. Kendi nefsin için sevdiğin (iyi) şeyi insanlar için (de) sev (yani arzula, o zaman olgun) mü'min olursun. Sana komşu olanlara iyi komşuluk et, (o takdirde kâmil) müslüman olursun ve az gül. Çünkü gülmenin çokluğu kalbi öldürür (yani karartıp katılaştırır)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4218,
			"arabicnumber": 4218,
			"text": "“... Ebû Zerr (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: gibi bir akıl yok, nefsi (müslümanlara eziyet etmekten) alıkoymak gibi bir vera’ (= günah ve şüpheli şeylerden dikkatle sakınmak) yok ve huy güzelliği gibi bir şeref yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4219,
			"arabicnumber": 4219,
			"text": "“... Semûre bin Cündüb (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : (yani kişiyi halk nazarında yücelten şey) maldır. Kerem (yani kişiyi Allah katında yücelten şey) de takvadır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4220,
			"arabicnumber": 4220,
			"text": "“... Ebû Zerr (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) : ben öyle bir kelime (Osman — kendi rivâyetinde — dediki: öyle bir âyet) bilirim ki eğer insanların hepsi onu tutsaydılar, hepsine yetecekti,) buyurdu. Sahâbiler: Resûlallah! Hangi âyettir? dediler. O, buyurdu ki: = (ve kim Allah'tan korkarsa, Allah o kimseye (darlıktan genişliğe) bir çıkış yolu ihsan eder. ) (Talâk, 2) demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4221,
			"arabicnumber": 4221,
			"text": "“... Ebû Züheyr es-Sakafî (radıyallahü anh)’den; Şöyle demiştir: (sallallahü aleyhi ve sellem), Nebâvet veya Benâvefte (râvi dedi ki Nebâvet Tâif'ten bir yerdir) bize bir konuşma yaparak : ise cennetlik olanları cehennemlik olanlardan ayırdedip tanıyabilirsiniz,) buyurdu. Sahâbîler: ayırdedip tanımak ne ile (olabilir) ? diye sordular. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : anmak ve kötülükle anmak suretiyle (olur). (Çünkü) siz birbiriniz hakkında (şâhidlik eden) Allah'ın şâhidlerisiniz,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4222,
			"arabicnumber": 4222,
			"text": "“... Külsûm el-Huzâî (radıyallahü anh)’den; Şöyle demiştir: adam Peygamber (sallallahü aleyhi ve sellem)’in yanına gelerek : Resûlallah! İyilik ettiğim zaman iyilik ettiğimi ve fenalık ettiğim zaman fenalık ettiğimi nasıl bilebilirim? diye sordu. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) : (ne ettiğini bilen) komşuların: İyilik ettin, dedikleri zaman hakikaten iyilik etmişsin ve onlar : Fenalık ettin, dedikleri zaman gerçekten fenalık etmişsin,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4223,
			"arabicnumber": 4223,
			"text": "“... Abdullah (bin Mes'ûd) (radıyallahü anh)'den rivâyet edildiğine göre bir adam; Peygamber (sallallahü aleyhi ve sellem)’e: ettiğim zaman (yaptığım işin iyi olduğunu) ve fenalık ettiğim zaman (yaptığım işin fena olduğunu) nasıl bilebilirim? diye sordu. Peygamber (sallallahü aleyhi ve sellem) (de): (ne yaptığını bilen dindar) komşularını : İyilik ettin, söylerken işittiğin zaman muhakkak iyilik etmiş (olur) sun ve sen onlar : Fenalık ettin, derken işitince gerçekten fenalık etmiş (olur) sun,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4224,
			"arabicnumber": 4224,
			"text": "“... İbn-i Abbâs (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: olan (mü'min) o kimsedir ki Allah onun iki kulağını, (işlediği) iyi bir şeyden dolayı insanların övgüsü ile doldurur. Kendisi de (hayır ile anıldığını) işitir. Cehennemlik olan da o kimsedir ki Allah onun iki kulağını (işlediği) şer bir şeyden dolayı insanların (onu) fena anmaları sözleriyle doldurur. Kendisi de (şer ile anıldığını) duyar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4225,
			"arabicnumber": 4225,
			"text": "“... Ebû Zerr (radıyallahü anh)’dan. Şöyle demiştir : Peygamber (sallallahü aleyhi ve sellem)'e: Allah (rızâsı) için (hayırlı) şey işler. İnsanlar da bu işten dolayı onu severler (yani bu duruma ne buyurulur)? dedim. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : (sevgi), mü'minin (kavuşacağı) müjdenin âcil olanıdır,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4226,
			"arabicnumber": 4226,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den; Şöyle demiştir: Bir adam: Resûlallah! Ben (hayırlı) bir iş yaparım. Sonra (o işi yaptığım) duyulur. Ben de duyulmasından hoşlanırım (yani bu duruma ne buyurulur)? dedi. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : için iki sevab vardır: Gizli yapmak sevabı ve açıktan yapma sevabı,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4227,
			"arabicnumber": 4227,
			"text": "“... Ömer bin el-Hattâb (radıyallahü anh)’den rivâyet edildiğine göre kendisi: Ben, Resûlüllah (sallallahü aleyhi ve sellem)'i şöyle buyururken işittim, demiştir: (yani kişilerin kendi iradeleriyle işlediği şeylerin değeri) ancak niyetlere göredir ve herkese ancak niyet ettiği şey vardır. kimin (küfür diyarından İslâm memleketine) hicreti (nden niyet ve gayesi) Allah ve Resûl'üne yönelik olursa o kimsenin hicreti (gerçekten) Allah'a ve Resûl'ünedir. Kimin hicreti elde edeceği dünyalık veya evleneceği bir kadın için olursa o kimsenin hicreti (sevaba yönelik olmayıp) göç etmesine sebep olan (dünyalık veya kadın) adır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4228,
			"arabicnumber": 4228,
			"text": "“... Ebû Kebşe el-Enmârî (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: ümmetin durumu, şu dört kişinin durumu gibidir : (Birincisi), Allah'ın mal ve (dinî) ilim verdiği bir adamdır. Bu adam, malı (nı harcama) hakkında ilmiyle amel ederek (yani dinî bilgisinin ışığında hareketle) onu hakkı (olan zekât, sadaka ve ikram) uğrunda harcar. (İkincisi), Allah'ın (dinî) ilim verip de mal vermediği adamdır. Bu da (Kalbinde) : Eğer şu malın misli benim olsaydı, ben (de) şu adamın işlediğinin mislini işlerdim, der. Resûlüllah (sallallahü aleyhi ve sellem) : iki adam (asıl) sevabta eşittir, buyurduktan sonra ve (üçüncüsü) Allah'ın mal verip de (dînî) ilim vermediği adamdır. Bu adam, malında şuursuzca hareket ederek hakkının dışında (yani nefsi arzuları uğrunda) harcar ve (dördüncüsü), Allah'ın ne (dinî) ilim ne de mal verdiği adamdır. Bu da: Eğer bu malın misli benim olsaydı, ben (de) bu adamın malında yaptığı şeylerin mislini yapardım (yani nefsi arzularım yolunda harcardım), der. Resûlüllah (sallallahü aleyhi ve sellem) buyurdu ki: iki adam (asıl) günahta eşittir.) ... (İbn-i Mâcete demiş ki) bu hadisin mislini ..... senediyle İshâk bin Mervezî ve bir mislini ..... senediyle Muhammed bin İsmail bin Semûre bize rivâyet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4229,
			"arabicnumber": 4229,
			"text": "“... Câbir (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (ölürken taşıdıkları) niyetler üzerine haşrolunurlar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4230,
			"arabicnumber": 4230,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4231,
			"arabicnumber": 4231,
			"text": "“... Abdullah bin Mes'ûd (radıyallahü anh)’den rivâyet edildiğine göre: (sallallahü aleyhi ve sellem) (sahâbiler için toprak -kum üzerine değnekle) kare biçiminde bir şekil, o şeklin ortasına bir çizgi, ortadaki çizginin yanına doğru çizgiler ve kare biçimindeki o şeklin dışında bir çizgi çizdi. Sonra (sahâbilere) : ne olduğunu bilir misiniz?) buyurdu. Sahâbîler: ve Resulü en iyi bilendir, dediler. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : (karenin içindeki) orta çizgidir. O çizginin yanına doğru olan çizgiler, insana arız olan (hastalık, açlık vesâir) musibetler - afetlerdir. Bu arızalar her yerden onu (zehirli yılan - akrep gibi) sokup ısırmaya yönelir. Şayet bu musibet - âfet ona isabet etmez (yakalıyamaz) ise bu musibet - âfet ona isabet eder (yakalayıp sokar). Kare biçimindeki şekil de onu çevreleyen eceldir. Karenin dışındaki çizgi de emeldir,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4232,
			"arabicnumber": 4232,
			"text": "“... Enes bin Mâlik (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) (bir yere işâret ederek): Âdem oğludur (yani insandır). Bu da ecelidir, ensesi yanındadır,) buyurdu ve elini, ecel yeri (olarak gösterdiği nokta) nın ilerisine doğru açarak; insanın emeli oradadır,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4233,
			"arabicnumber": 4233,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: kişinin kalbi iki hasleti sevmek hususunda gençtir (yani kuvvetli ve şendir) : (O hasletler) yaşama sevgisi ve mal çokluğu sevgisi (dir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4234,
			"arabicnumber": 4234,
			"text": "“... Enes (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : yaşlanır. Fakat on (un ahlâkın) dan iki haslet gençleşir (yani kuvvetlenip gelişir) : Mal (biriktirme ve çoğaltma) üzerine ihtiras ve ömür (uzunluğu) üzerine ihtiras",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4235,
			"arabicnumber": 4235,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: iki dere dolusu malı olsa bunlarla beraber bir üçüncüsünü ister. Âdemoğiunun (ihtiraslı) nefsini topraktan başka hiçbir şey dolduramaz. Allah tevbe edenin tevbesini kabul eder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4236,
			"arabicnumber": 4236,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: ömürleri altmış (yaş) ile yetmiş (yaş) arasıdır ve bu yaşı geçenleri çok azdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4237,
			"arabicnumber": 4237,
			"text": "“... (Mü'minlerin anası) Ümmü Seleme (radıyallahü anha)’dan: Şöyle demiştir: (sallallahü aleyhi ve sellem)’in ruhunu (atıp) götüren (Rabb'im)e yemin ederim ki O, ömrünün son zamanlarında (farz olanı hâriç) namaz(lar)ının çoğu(nu) oturarak (kılıyor) idi. O'na en sevimli amel de az bile olsa (mümin) kulun devamlı işlediği sâlih amel (yani ibâdet) idi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4238,
			"arabicnumber": 4238,
			"text": "“... Âişe (radıyallahü anha)’dan; Şöyle demiştir: gün) bir kadın yanımda bulunuyordu. Biraz sonra Peygamber (sallallahü aleyhi ve sellem) odama girdi ve (Bu kadın kimdir?) diye sordu. Ben de: (Geceleyin) hiç uyumaz, dedim (Âişe kadının kıldığı namazları anlatmaya başladı). Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) : (Devamlı) yapabileceğiniz ameller (yani nafile ibâdetler) ile meşgul olunuz. Çünkü Allah'a yemin ederim ki, siz (ibâdetten) usanıncaya kadar Allah size ihsanını kesmez,) buyurdu. Âişe demiştir ki: Resûl-i Ekrem (sallallahü aleyhi ve sellem)’e en sevimli din (yani ibâdet), sahibinin devamlı ifâ ettiği (ibâdet) idi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4239,
			"arabicnumber": 4239,
			"text": "“... Hanzala el-Kâtib et-Temîmî el-Üseyyidî (radıyallahü anh)’den rivâyet edildiğine göre şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem)'in yanında bulunuyorduk. Bize cennet ve cehennemi öyle hatırlattı ki biz (cennet ve cehennemi) gözle görüyor gibi olduk. Sonra ben kalkıp ailemin ve çocuğumun yanına gittim ve (o hâli unutup) güldüm, eğlendim. Hanzala dedi ki: Biraz sonra (kendimi toparlayıp Resül-i Ekrem (sallallahü aleyhi ve sellem)’in yanında iken) içinde olduğumuz hali hatırladım. Hemen (evden) çıktım ve Ebû Bekir (radıyallahü anh)'a rastladım . Ona: (içine düştüğüm gafleti anlatarak) münafık oldum, münafık oldum, dedim, Ebû Bekir: Muhakkak biz onu (yani aile ferdlerimizle eğlenip gülme işini) işliyoruz, dedi. Sonra Hanzala gidip bu hâli Peygamber (sallallahü aleyhi ve sellem)’e anlattı. Bunun üzerine Resûl-i Ekrem (sallallahü aleyhi ve sellem) : Hanzala! (Benim yanımda olmadığınız zaman) benim yanımda olduğunuz gibi olsaydınız melekler yataklarınız üstünde (veya yollarınız üzerinde) sizlerle tokalaşacaktı. Yâ Hanzala! Bir saat şöyle, bir saat böyle,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4240,
			"arabicnumber": 4240,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (yani farz olmayan ibâdet) den (devamlı yapmaya) gücünüzün yettiği miktarı yükleniniz. Çünkü amelin en hayırlısı az bile olsa en çok devam ettirilenidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4241,
			"arabicnumber": 4241,
			"text": "“... Câbir bin Abdillah (radıyallahü anhüma)'dan; Şöyle demiştir: (sallallahü aleyhi ve sellem), bir taş üstünde namaz kılan bir adamın yanından geçip Mekke'nin kenarına vardı. (Orada) uzun bir süre kaldıktan sonra geri döndü ve taş üstünde namaz kılan adama aynı durumda namaz kılarken rastladı. Bunun üzerine Resûl-i Ekrem (sallallahü aleyhi ve sellem) ayağa kalkarak iki elini birleştirdi ve üç kere : insanlar! Mutedil davranın (yani ifrat ve tefritten sakının),) buyurdu. (Sonra buyruğuna şöyle devam etti) : (Çünkü şüphesiz, siz (ibâdetten) usanıncaya kadar Allah size ihsanını kesmez",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4242,
			"arabicnumber": 4242,
			"text": "“... Abdullah (bin Mes'ûd) (radıyallahü anh)'den; Şöyle demiştir: Yâ Resûlallah! Câhiliyet devrinde (yani müslüman olmazdan önce) işlemiş olduğumuz günahlardan dolayı cezalandırılır mıyız? diye sorduk. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) : müslümanlıkta güzel hareket ederse câhiliyet devrinde (yani müslüman olmazdan önce) olan (günahların) dan dolayı cezalandırılmaz. Kim (müslüman olduktan sonra) kötü hareket ederse hem (müslüman olmazdan) önceki hem (müslüman olduktan) sonraki (günahları) ile muaheze edilir (yani sorumlu tutulur),) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4243,
			"arabicnumber": 4243,
			"text": "“... Âişe (radıyallahü anha)'dan; Şöyle demiştir: (sallallahü aleyhi ve sellem) bana: Âişe (Günah sayılan) amellerin küçümsenenlerinden (de) sakın. Çünkü şüphesiz, onlar için (de) Allah (tarafın) dan bir araştırıcı (melek) vardır,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4244,
			"arabicnumber": 4244,
			"text": "“... Ebû Hüreyre (radıyallahü anh)'den rivâyet edildiğine göre; Reeûlullah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: günah işlediği zaman kalbinde siyah bir iz olur. Sonra o kişi tevbe edip (nefsini o günahtan) çekip çıkarır ve (Allah'tan) mağfiret dilerse kalbi (o iz pasından) cilalanıp temizlenir. Eğer mü’min günahı fazlalaştırırca kalbindeki siyah iz (ve leke) fazlalaşır. İşte Allah'ın, Kitâb'ında; (onların sandıkları gibi değil). Onların kazandıkları günahlar, kalblerini paslandırıp karartmıştır\" (Mutaffıfin, 14) âyetinde buyurduğu rân budur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4245,
			"arabicnumber": 4245,
			"text": "“... Sevbân (radıyallahü anh)'den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur : birtakım kimseleri bilirim ki onlar kıyamet günü Tihâme dağları emsali (çok) ve bembeyaz (yani tertemiz) sevaplar getirirler de Allah (Azze ve Celle) o sevabları saçılmış toz eder (yani mahveder, kabul etmez). Sevbân (radıyallahü anh) : Resûlallah! Bilmiyerek onlardan olmamamız için bize onların sıfatlarını söyle ve bize onların durumunu açıkla, dedi. Resül-i Ekrem (sallallahü aleyhi ve sellem) : olunuz ki onlar sizin (din) kardeşleriniz ve sizin cinsinizden (bir takım insanlar) dır. Sizin aldığınız gibi onlar geceden (ibâdet nasibini) de alırlar. Ve lâkin onlar, Allah'ın yasak kıldığı şeylerle tenha yerde başbaşa kaldıkları zaman o yasakların sınırlarını çiğnerler,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4246,
			"arabicnumber": 4246,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem)’e: cennete dâhil eden (yani cennete girmesine sebep olan) amellerin en çoğu hangisidir? diye soruldu. O (yani Allah korkusu) ve huy güzelliğidir,) buyurdu. Ve O'na: cehenneme sokan günahların en çoğu hangisidir? diye soruldu. O : iki organ : Ağız ve tenasül uzvu,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4247,
			"arabicnumber": 4247,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur : (Azze ve Celle) birinizin tevbe etmesine o kimsenin kayıp hayvanını bulunca duyduğu sevinçten muhakkak daha çok sevinir (yani razı olur)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4248,
			"arabicnumber": 4248,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur; göğe ulaşacak kadar günah işleyip de sonra (onlardan) tevbe etmiş olsanız, Allah tevbenizi kabul eder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4249,
			"arabicnumber": 4249,
			"text": "“... Ebû Saîd (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: kulunun tevbesine şu adamın sevinmesinden daha çok sevinir (yani razı olur) ki (yolculuk hâlinde olan) o adam bir susuz çölde binit devesini kaybeder. Bunun üzerine adamcağız yitik devesini aramaya koyulur. Nihayet o arayış, adamı cidden yorup âciz bırakınca (susuzluk ve sıcaktan dolayı olduğu yerde ölmek üzere başını yere koyup) elbisesini başına çekip örtünür. İşte kendisi o halde olduğu sırada devesini kaybettiği yerde aniden hayvanının ayak sesini duyar. Bunun üzerine yüzüne çektiği örtüyü açar ve hemen binit hayvanı ile karşılaşır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4250,
			"arabicnumber": 4250,
			"text": "“... Abdullah (bin Mes'ûd) (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: tevbe eden kimse, hiç günahı olmayan kimse gibidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4251,
			"arabicnumber": 4251,
			"text": "“... Enes (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: oğullarının hepsi çok günah işler. Çok günah işleyenlerin en hayırlısı çokça tevbe edenlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4252,
			"arabicnumber": 4252,
			"text": "“... (Abdullah) bin Ma'kil (bin Mukrin) (radıyallahü anhümâ)’dan; Şöyle demiştir: babam (Ma'kil) ile beraber Abdullah (bin Mes'ûd) (radıyallahü anh)’ın yanına girdik de ben onu (yani İbn-i Mes'ûd'u) şöyle söylerken işittim: Resûlüllah (sallallahü aleyhi ve sellem) : pişmanlık duymak, bir tevbedir,) buyurdu. Bunun üzerine babam (Ma'kil), Abdullah (İbn-i Mes'ûd)a: pişmanlık duymak bir tevbedir) hadîsini Peygamber (sallallahü aleyhi ve sellem)'den sen işittin (mi)? dedi. Abdullah (İbn-i Mes'ûd) : diye cevap verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4253,
			"arabicnumber": 4253,
			"text": "“... Abdullah bin Amr (bin el-As) (radıyallahü anhüma)'dan rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: (Azze ve Celle), kulun tevbesini ruhu boğazına gelmedikçe muhakkak kabul eder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4254,
			"arabicnumber": 4254,
			"text": "“... (Abdullah) bin Mes'ûd (radıyallahü anh)'den; Şöyle demiştir: adam Peygamber (sallallahü aleyhi ve sellem)’in yanına gelerek (helâl olamayan) bir kadından bir öpücük aldığını anlattı ve bu günahın keffâretini sormaya başladı. Resûl-i Ekrem (sallallahü aleyhi ve sellem) ise ona bir şey söylemedi. Sonra Allah (Azze ve Celle) : namazı gündüzün iki tarafında, geceden de gündüze yakın saatlarda dosdoğru kıl. Şüphesiz, iyilikler kötülükleri giderir. Bu, iyi düşünüp öğütlenenler için bir nasihattir.) (Hûd, 114) âyetini indirdi. Bunun üzerine adam: Resûlallah! Bu âyet(in hükmü) yalnız benim için midir? diye sordu. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : âyet (in hükmü) benim ümmetimden onunla amel edenler için. (umûmi) dir,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4255,
			"arabicnumber": 4255,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: adam kendine israf etti (yani aşırı derecede günahlar işledi). Sonra ölüm döşeğine düşünce oğullarına vasiyet ederek: Ben öldüğüm zaman cesedimi yakınız, sonra ufaltıp kül hâline getiriniz ve beni (m külümü) rüzgâra ve denize saçınız. Çünkü Allah'a yemin ederim ki, eğer Rabb'ım bana kadir olursa hiç kimseye vermediği bir azabı bana muhakkak verecektir, dedi. Resûl-i Ekrem (sallallahü aleyhi ve sellem) buyurdu ki: da adama öyle yaptılar (yani vasiyyetini yerine getirdiler). Bunun üzerine (Allah) yere : (geri) ver, buyurdu. Adamda o anda kalkıverdi ve Allah ona: bu yaptığına sürükleyen nedir? dedi. Adam: haşyetin (veya senin mahâfetin) —Yani senden olan korkum. Yâ Rabbi! dedi. Allah da onu bu sebebten dolayı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4256,
			"arabicnumber": 4256,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: kadın bağladığı (hapsettiği) bir kedi sebebiyle cehenneme girdi. Çünkü ne kendisi kediye (bir şey) yedirdi, ne de yerin haşerâtından yesin diye salıverdi ve nihayet kedi (açlıktan) öldü.) verici bu ve bundan önceki hadîsi Ma'mer'e rivâyet eden) Zührî demiş ki: (İbret verici bu iki hadîsi birlikte rivâyet etmem) herhangi bir adamın (kulluk görevini ihmal edip ilâhî rahmete) dar yanmaması ve hiç bir kimsenin (ilâhi rahmetten) ümidini kesmemesi içindir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4257,
			"arabicnumber": 4257,
			"text": "“... Ebû Zerr(-i Gifârî) (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : Tebâreke ve Teâlâ buyurur ki: Ey kullarım! Benim koruduğum (ermiş kimseler) hâriç hepiniz günah işleyebilirsiniz. Bu itibarla benden mağfiret dileyiniz ki sizi bağışlıyayım. Sizden kim bağışlamaya gücümün yettiğini bilir de kudretimle benden mağfiret dilerse o kimseyi bağışlarım. Hidâyete erdirdiğim kimseler hâriç, hepiniz dalâlettesiniz. Onun için benden hidâyet dileyiniz, sizi hidâyete erdireyim. Zengin ettiğim kimseler hâriç hepiniz fakirsiniz. Bu itibarla benden (rızık) isteyiniz, sizi rızıklandırayım. Eğer hayatta olanınız, ölmüş olanınız, önce gelenleriniz, sonra gelenleriniz, yaş olanınız ve kuru olanınız (yani bütün kullar) toplanıp da kullarımdan en çok takva sahibi kulumun kalbi üzerinde (yani hepsinin kalbi onun kalbi gibi) olsa, benim mülkümde (yani hükümranlığım ve saltanatımda) bir sivrisinek kanadı (kadar bir şey) artmaz. Şayet onlar (yani tüm kullar) toplanıp da kullarımdan en sapık - şerir kulumun kalbi üzerinde (yani hepisinin kalbi onun kalbi gibi) olsa benim mülkümden bir sivrisinek kanadı (kadar bir şey) eksilmez. Eğer hayatta olanınız, ölmüş olanınız, önce gelenleriniz, sonra gelenleriniz, yaş olanınız ve kuru olanınız (yani bütün kullar) toplanıp da her biri hatırından geçen bütün ihtiyaç ve isteklerini (benden) dilerse, onların bütün dileklerini yerine getirmem, benim mülkümden ancak birinizin deniz kenarından geçip de bir dikiş iğnesini denize sokup çıkarması ile deniz suyunu eksilttiği kadar eksiltir, (yani bu misalde nasıl deniz suyu hiç eksilmiyorsa kulların bütün isteklerini yerine getirmekle ilâhi hazineden hiç bir şey eksilmez). Benim mülkümden hiç bir şeyin eksilmemesi sebebi şudur: Şüphesiz ben çok cömerdim, keremim boldur. Bağış yapmam bir söz söylemek (ten ibaret) tir (yani çalışmayı, didinmeyi gerektirmez). Ben bir şeyi dilediğim zaman sâdece ona \"Ol\" derim. O da hemen olur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4258,
			"arabicnumber": 4258,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) (ve zevkleri kesen (ona son veren) i çokça hatırlayınız,) buyurdu, demiştir. Yani ölümü (çokça hatırlayınız)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4259,
			"arabicnumber": 4259,
			"text": "“... (Abdullah) bin Ömer (radıyallahü anhümâ)’dan; Şöyle demiştir ; Resûlüllah (sallallahü aleyhi ve sellem)'in beraberinde idim. Ensâr'dan bir adam Ona geldi ve Peygamber (sallallahü aleyhi ve sellem)'e selâm verdikten sonra: Resûlallah! Mü'minlerin hangisi daha faziletlidir? diye sordu. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : bakımından en güzel olanı, buyurdu.) Adam: Peki, mü'minlerin hangisi daha akıllı - şuurludur? diye sordu. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : en çok hatırlayanı ve ölümden sonraki (hayatı) için en güzel şekilde hazırlananı. İşte onlar en akıllı - şuurlu olanlardır,) buyurdu. \" \". . . Ebû Ya'lâ Şeddud bin Evs (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: - şuurlu adam o kimsedir ki nefsini (Allah'a karşı) köleleştirir (veya hesaba çeker) ve ölümden sonraki (hayat) için (iyi) amel işler. (Nefsini yenmekten) Âciz adam da o kimsedir ki nefsini arzusuna uydurur (yani nefsini haramdan alıkoymaz). Sonra Allah'tan (mağfiret) temenni eder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4260,
			"arabicnumber": 4260,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4261,
			"arabicnumber": 4261,
			"text": "“... Enes (radıyallahü anh)’den; Şöyle demiştir: (sallallahü aleyhi ve sellem) ölüm döşeğinde olan bir gencin yanına girdi ve ona: kendini nasıl buluyorsun?) diye sordu. Genç : Allah (ın afvın)ı umarım Yâ Resûlallah! Ve günahlarımdan korkarım, dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) buyurdu ki: vakitte (yani ölüm döşeğinde) her hangi bir (mü'min) kulun kalbinde bağışlanma umudu ve günah korkusu birleşince mutlaka Allah o kuluna dilediği (mağfireti) ni verir ve onu korktuğu (azabı)ndan emin kılar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4262,
			"arabicnumber": 4262,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur : döşeğinde olan kimsenin yanında melekler hazır bulunur. Kişi dindar olunca melekler: Ey güzel cesedde olan güzel nefis (rûh)! Övülerek (cesedden) çık ve rahmet, güzellik ve öfkeli olmayan Rabb(a kavuşmak) ile müjdelen, derler. Artık can çıkıncaya kadar devamlı ona böyle söylenir. Sonra o ruh göğe yükseltilir ve gök (kapısı) onun için açılır. Sonra, bu kimdir? diye sorulur. Onu götüren melekler: Falancadır, derler. Bu kere (Gökte görevli melekler) tarafından: Güzel nefse merhaba, güzel cesedde idi. Övgüye lâyık olarak gir ve rahmet, güzellik ve öfkeli olmayan Rabb(a kavuşmak) ile müjdelen, denilir. Sonra Allah (Azze ve Celle) nin (hükümlerinin açıklanıp melekler tarafından alınmakta) olduğu göğe götürülünceye kadar ona devamlı olarak böyle söylenir. (Ölüm döşeğinde) kötü adam olduğu zaman (görevli) melek: Çık ey pis cesedde olan pis nefis. Yerilmiş olarak çık ve kaynar su, cehennem halkının irini ve bunların misli çeşitli başka azab ile müjdelen, der. O habis nefis (cesedden) çıkıncaya kadar ona devamlı olarak böyle (tehdidler) söylenir. Sonra o nefis (yani ruh), göğe çıkarılır. Fakat gök (kapısı) ona açılmaz ve: Bu kimdir? denilir. Falancadır, diye cevab verilir. Bunun üzerine: Habis nefse merhaba olmaz, o pis nefis pis cesedde idi. Kınanmış olarak geri dön. Çünkü sana göğün kapıları kesinlikle açılmıyacaktır, denilir ve bunun üzerine o ruh gökten (yere) gönderilir ve sonra cesedin bulunduğu mezara varır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4263,
			"arabicnumber": 4263,
			"text": "“... Abdullah bin Mes'ûd (radıyallahü anh)’den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: eceli bir yerde olduğu zaman ihtiyaç - iş onu oraya sıçratır (yani o yere zamanında gitmesine vesile oluverir). Sonra kalan ömrünün sonuna varınca, Allah sübhânehû onun ruhunu (orada) alır. Kıyamet günü de o yer: Ey Rabb'ım! İşte bu, bana emanet ettiğin (cesed)dir, der",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4264,
			"arabicnumber": 4264,
			"text": "“... Âişe (radıyallahü anha)'dan; Şöyle demiştir: (sallallahü aleyhi ve sellem) : kim Allah'a kavuşmayı severse, Allah (da) ona kavuşmayı sever. Her kim de Allah'a kavuşmaktan hoşlanmazsa Allah (da) ona kavuşmaktan hoşlanmaz,) buyurdu. Bunun üzerine O'na: Resûlallah! Allah'a kavuşmaktan hoşlanmamak. Ölüme kavuşmaktan hoşlanmamak dolayısıyladır ve hiç birimiz ölümden hoşlanmayız (ne buyurulur?) denildi. Resûl-i Ekrem (sallallahü aleyhi ve sellem) buyurdu ki: (öyle değil). Bu (yani Allah'a kavuşmayı sevmek veya sevmemek) ancak kişinin öleceği anda olur. Ölüm döşeğinde kişi Allah'ın rahmet ve mağfiretiyle müjdelendiği zaman Allah'a kavuşmayı sever. Allah da ona kavuşmayı sever. Ölüm döşeğinde kişi Allah'ın azabı ile müjdelenince (yani tehdid edilince) Allah'a kavuşmak istemez. Allah da ona kavuşmaktan hoşlanmaz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4265,
			"arabicnumber": 4265,
			"text": "“... Enes (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: herhangi biriniz, başına gelen zarardan dolayı ölmeyi temenni edemez (etmesin). Eğer mutlaka ölümü temenni etmek zorunda kalırsa şöyle desin ) Yaşamak benim için hayırlı olduğu sûrece beni yaşat ve ölüm benim için hayırlı olduğu zaman beni öldür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4266,
			"arabicnumber": 4266,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: kemik hâriç insan (cesedin) den çürümeyen hiç bir şey yoktur. O (çürümeyen kemik) de kuyruk sokumudur ve kıyamet günü cesedin yaratılışı o kemikten kurulur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4267,
			"arabicnumber": 4267,
			"text": "“... Hâni' Mevlâ Osman (bin Affân) (radıyallahü anhüma)’dan; Şöyle demiştir: bin Affân (radıyallahü anh), bir mezar başında durduğu zaman sakalını (göz yaşlarıyla) ıslatıncaya kadar ağlardı. Bu sebeple kendisine: Sen cenneti ve cehennemi anıyorsun, ağlamıyorsun da bundan (yani kabir korkusundan) dolayı ağlıyorsun? denildi. Osman (radıyallahü anh), dedi ki: Resûlüllah (sallallahü aleyhi ve sellem) : mezar, âhiret konaklarının ilkidir. Eğer ölü on (un azabın) dan kurtulursa ondan sonraki (konaklar) ondan kolay olur. ölü on (un azabın) dan kurtulmazsa ondan sonraki (konaklar) ondan şiddetli olur,) buyurdu. Osman dedi ki: Resûlüllah (sallallahü aleyhi ve sellem) şöyle de buyurdu . kadar korkunç hiç bir fecî manzara görmedim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4268,
			"arabicnumber": 4268,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: mezara konulur. Salih (yani kulluk görevini yapan mü'min) kişi kabrinde endişesiz ve korkusuz oturtulur. Sonra ona : hangi dinde idin? diye sorulur. O: Ben îslâm dininde idim, diye cevab verir. Sonra ona : Şu adam nedir? diye (Resûl-i Ekrem (sallallahü aleyhi ve sellem) hakkındaki itikadı ve kanaati) sorulur. O da : (sallallahü aleyhi ve sellem) Allah'ın Resulüdür. O, bize Allah katından apaçık âyetler getirdi. Biz de O'nu doğruladık, diye cevab verir. Daha sonra bu (mü'min) ölüye : Allah'ı gördün mü? diye sorulur. O da : bir kimse Allah'ı (dünyada) görmeye lâyık değildir, diye cevab verir. Bu soru ve cevablardan sonra onun için ateş tarafına bir pencere açılır. Ölü ona bakarak ateş alevlerinin (şiddetli hararet ve sıkışıklıktan) birbirini kırıp yenmeye çalıştığını görür. Sonra ona: Allah'ın seni koruduğu ateşe bak, denilir. Sonra onun için cennet tarafına bir pencere açılır. O da bu defa cennetin süsüne ve nimetlerine bakar ve kendisine : İşte bu güzel yer senin makamındır, denildikten sonra: Sen (dünyada) samimi imân üzerinde idin, bu sağlam imân üzerine öldün ve (kıyamet günü) inşâallah imân üzerine dirileceksin, denilir. kişi de dehşet ve korku içinde mezarında oturtulur ve kendisine: hangi dinde idin? diye sorulur. Kendisi: diye cevab verir. Sonra ona: adam nedir? diye (Resûl-i Ekrem (sallallahü aleyhi ve sellem) hakkındaki itikad ve kanaati) sorulur. O da: (onun hakkında) bir söz (yani peygamber olduğunu) söylüyordu. Ben de o sözü söyledim, der. Bunun üzerine onun için cennet tarafına bir pencere açılır. O da cennetin süsüne ve içindeki (nimet) lere bakar. Sonra kendisine: senden geri çevirdiği (yani kötülüğünden dolayı sana nasib etmediği) cennete bak, denilir. Daha sonra onun için ateş tarafına bir pencere açılır. Bu kere ateşe alevlerinin bazısı bâzısını kırıp yenmeye çalıştığı halde bakar ve bunun üzerine ona: İşte bu, senin yerindir. (İslâm'a inanmak bakımından) şüphe üzerinde (yaşadı) idin, şüphe üzerine öldün ve inşâallah Teâlâ (kıyamet günü) şüphe üzerine diriltilirsin, denilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4269,
			"arabicnumber": 4269,
			"text": "“... El-Berâ' bin Azib (radıyallahü anh)’den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) buyurdu ki: imân edenleri sabit kavil (yani şehâdet kelimesi) ile metanetli kılar\" (âyeti) kabir azabı (yani sorgusu) hakkında indi. Ölüye (kabirde) : Senin Rabbin kim? diye sorulur. O da: Rabbim Allah'tır ve Peygamberim Muhammed (sallallahü aleyhi ve sellem)'dir, diye cevab verir. İşte mü'min ölünün böyle (metanetle) cevâbı, Allah (Azze ve Celle) 'nin: imân edenleri sabit kavil (yani şehâdet kelimesi) ile dünya hayatında ve âhirette (yani kabirde) metanetli kılar\" mealindeki âyeti (nin canlı bir ifâdesi) dir. \" (İbrahim, 27)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4270,
			"arabicnumber": 4270,
			"text": "“... İbn-i Ömer (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur : öldüğü zaman varacağı yer sabah akşam kendisine gösterilir. Ölü cennet ehlinden ise cennetliklerin makamlarından bir makam kendisine gösterilir. Şayet ölü cehennemliklerden ise cehennem ehlinin hücrelerinden biri kendisine gösterilir. (Her) ölüye: İşte kıyamet günü diriltilinceye kadar senin durağın buradır (veya: îşte kıyamet günü diriltilinceye kadar yerin sana gösterilecektir), denilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4271,
			"arabicnumber": 4271,
			"text": "“... Ka'b (bin Mâlik) el-Ensârî (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: ruhu, kendisinin dirileceği (kıyamet) gün(ü) cesedine geri dönüneceye kadar cennet ağaçlarında rızıklanan bir kuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4272,
			"arabicnumber": 4272,
			"text": "“... Câbir (bin Abdillah) (radıyallahü anhüma)’dan rivâyet edildiğine göre Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: ölü, kabre girdiği zaman güneş, batmak üzere bulunduğu şekilde (ona) temsil edilir (yani sanki akşam namazı vakti gelmiş gibi bir görüntü ona gösterilir). Bunun üzerine ölü oturup ellerini gözlerine sürer ve: Beni bırakınız namaz kılayım, der",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4273,
			"arabicnumber": 4273,
			"text": "“... Ebü Saîd (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: iki sahibinin ellerinde (lifleyecekleri) iki boynuz bulunur. Ne zaman (üflemekle) emrolunacaklarını dikkatle gözleyip düşünürler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4274,
			"arabicnumber": 4274,
			"text": "“... Ebû Hüreyre (radıyallahü anh)'den: Şöyle demiştir; bir adam, Medine (i Münevvere) çarşısında Musâ'yı insanlar üzerine seçip tercih eden (Rabb'im)e yemin ederim diye yemin etti. Bunun üzerine Ensâr'dan bir adam (yahûdi kişiye) İçimizde Resûlüllah (sallallahü aleyhi ve sellem) bulunduğu halde sen bu sözü (nasıl) söylersin? diyerek elini kaldırıp ona bir tokat attı. Sonra o olay Resûlüllah (sallallahü aleyhi ve sellem)'e anlatıldı. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: (Azze ve Celle) \"Ve Sûr'a üflenir, bunun üzerine Allah'ın dilediği kimseler hâriç, göklerde olanlar ve yerde olanlar çarpılıp yıkılırlar. Sonra Sûr'a bir daha üflenir. Bu defa onlar (kabirlerinden hemen kalkarak bakınıp dururlar.\" (Zümer, 68), buyurmuştur. Ben başını kaldıranların ilki olurum. O anda ben Arş'ın ayaklarından birisini tutan Mûsâ ile karşılaşırım. Artık bilmem o, başını benden önce mi kaldırdı, yoksa o, Allah (Azze ve Celle)'nin çarpılıp yıkılmaktan müstesna (ve muaf) tuttuğu kimselerden mi oldu. Kim de : Ben Yûnus bin Mettâ'dan daha hayırlıyım (üstünüm), derse şüphesiz yalan söylemiş olur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4275,
			"arabicnumber": 4275,
			"text": "“... Abdullah bin Ömer (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) minber üstünde şöyle buyururken işittim, demiştir: (olan Allah kıyamet günü) mülkü olan gökleri ve yerleri eline (şöyle) alır.) (Râvi Abdullah bin Ömer dedi ki: Ve Resûlüllah (sallallahü aleyhi ve sellem) böyle buyururken avucunu kapadı sonra da açıp kapatmaya başladı). (sallallahü aleyhi ve sellem) sözlerine devamla şöyle buyurdu): Allah buyurur ki: Cebbar benim, Melik benim. Hani (dünyadaki) cebbarlar nerede? Mütekebbirler nerede?) Abdullah bin Ömer dedi ki: Resûlüllah (sallallahü aleyhi ve sellem) bu konuşmasını yaparken sağına ve soluna eğiliyordu. Hattâ baktım minber altından (yukarısına kadar) öyle sallanıyor ki ben kendi kendime artık minber Resûlüllah (sallallahü aleyhi ve sellem) ile beraber düşecek mi? diyor (ve endişeleniyor) dum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4276,
			"arabicnumber": 4276,
			"text": "“... Âişe (radıyallahü anha)'dan; Şöyle demiştir: Yâ Resûlallah! Kıyamet günü insanlar nasıl haşredilecekler? diye sordum. O : ve çıplak olarak (haşredilecekler),) buyurdu. Beni Kadınlar da (çıplak mı olacaklar)? dedim. O: (Kadınlar da (çıplak olacaklar),) buyurdu. Ben: Ya Resûlüllah! Peki haya edilmez mi? diye sordum. O: (Ya Âişe! Haşr işi çok şiddetli olup insanların birbirlerine bakmaları hatırlarına bile gelmez (yani herkes sorgu ve azab korkusundan kendi derdiyle meşguldür, başkasının hâlinden habersizdir).) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 4277,
			"arabicnumber": 4277,
			"text": "“... Ebû Mûsâ el-Eş'arî (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: günü insanlar üç defa Allah'a arzolunacaklar (yani huzurda sorguya çekilecekler). İki arz (yani sunuş) mücâdele ve mazeretlerden ibarettir. Üçüncü sunuşa gelince (insanların işledikleri amellerin yazılı olduğu) defterler o zaman ellere uçacaklar (yani hızla verilecektir). Artık (defteri) kimisi sağ eliyle tutacak ve kimisi sol eliyle tutacaktır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 4278,
			"arabicnumber": 4278,
			"text": "“... İbn-i Ömer (radıyallahü anhüma)’dan rivâyet edildiğine göre: (sallallahü aleyhi ve sellem) \"Âlemlerin Rabbi(nin emri, hesabı ve ceza ya da mükâfatı) için insanların (kabirlerinden) kalktıkları gün\" (Mutaffifîn, 6) âyeti hakkında şöyle buyurmuştur : her biri iki kulağının yarılarına kadar tere batmış olarak ayakta (bekleyip) durur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 4279,
			"arabicnumber": 4279,
			"text": "“... Âişe (radıyallahü anha)'dan; Şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem)'e, yer (küresin) in yerden başka bir şeyle ve göklerin değiştirileceği günü (hatırlayıp gözle) âyetini (İbrahim, 48) sordum. İnsanlar o gün nerede olacak? dedim. O : üzerinde, buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 4280,
			"arabicnumber": 4280,
			"text": "“... Ebû Said(-i Hudrî) (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (köprüsü), cehennemin ortasının üstüne, sa'dân dikenleri gibi (ateşten) dikenler üzerine (kurulup) konulur. Sonra insanlar (onun üstünden) geçmeye çalışacaklar. Artık kimisi sapasağlam (geçip) kurtulur. Kimisi o (ateşten) dikenle tırmalanmış olup sonra (geçerek) kurtulur. Kimisi de o dikene takılarak cehenneme baş aşağı atılır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 4281,
			"arabicnumber": 4281,
			"text": "“... Hafsa (radıyallahü anhâ)’dan; Şöyle demiştir: (sallallahü aleyhi ve sellem) : Teâlâ, Bedir (harbin) de ve Hudeybiye (seferin) de hazır bulunan (müslümanlardan hiç kimsenin cehennem ateşine girmemesini cidden kuvvetle umarım,) buyurdu. Hafsa demiş ki : Ben : Resûlallah! Allah \"Sizden cehenneme varmıyacak hiç bir kimse yoktur. Bu, senin Rabbin katında kesinleşmiş bir hükümdür. \" (Meryem, 71) muhakkak buyurmadı mı, dedim. (Bunun üzerine) Resûl-i Ekrem (sallallahü aleyhi ve sellem) : Hafsa!) Sen Allah'ın: \"Sonra biz Allah'tan korkup (O'na karşı gelmekten) sakınanları kurtarır, zâlimleri de toptan orada bırakırız. \" (Meryem, 72) buyruğunu işitmedin mi?) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 4282,
			"arabicnumber": 4282,
			"text": "“... Ebü Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (kıyamet günü) benim yanıma abdest izlerinden dolayı yüzleriniz, kol ve bacaklarınız nurlu olarak geleceksiniz. (Bu nur), Ümmetimin alâmeti olup ondan başka hiç bir kimsede bulunmaz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 4283,
			"arabicnumber": 4283,
			"text": "“... Abdullah (bin Mes'ûd) (radıyallahü anh)’den; Şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem)’in beraberinde bir kubbe (yani deriden mamul çadır) da idik. O (bize) : cennetliklerin dörtte biri olmanıza razı mısınız?) buyurdu. Biz : dedik. O. (bu kere): cennet ehlinin üçte biri olmanıza razı mısınız?) buyurdu. Biz : dedik. O şöyle buyurdu: (kudret) elinde olan (Allah) a yemin ederim ki, ben sizin cennetliklerin yarısı olmanızı çok kuvvetle umarım. Sebebi de şudur : Cennete yalnız müslüman olan kimse girecek, başkası giremiyecektir ve sizler müşrikler (yani kâfirler) içinde ancak, siyah öküzün cildindeki beyaz bir kıl veya kırmızı öküzün derisindeki siyah bir kıl gibisiniz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 4284,
			"arabicnumber": 4284,
			"text": "“... Ebû Saîd(-i Hudri) (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: günü bir) peygamber beraberinde (ümmeti olarak) iki adam olduğu halde gelir. Bir başka peygamber, beraberinde (ümmeti olarak) üç kişi bulunduğu halde gelir. Bundan fazla ve az (ümmetle gelen peygamber) de olur. Sonra o (gelen her) peygambere: Sen kendi kavmine (dini) tebliğ ettin mi? diye sorulur. O da: Evet, der. Sonra onun kavmi (huzura) çağrılarak: Peygamberiniz size (dini) tebliğ etti mi? denilir. Onlar: Hayır, derler. Bunun üzerine (onların peygamberine) : Senin (dini kavmine tebliğ ettiğine dâir) şahidin kimdir? denilir. O da: Muhammed (sallallahü aleyhi ve sellem) ve ümmeti der. Bunun üzerine Muhammed (sallallahü aleyhi ve sellem)'in ümmeti çağırılır ve (onlara) : Bu peygamber (dinini kavmine) tebliğ etti mi? diye sorulur. Onlar da: Evet, derler. Sonra Allahü teâlâ (Ümmet-i Muhammedi'ye) : Bu peygamberin kendi kavmine dinî tebliğ ettiğine dâir bilginiz nedir (yani bu durumu nasıl bilebilirsiniz)? der. Onlar da: Peygamberlerin (dinlerini kendi kavimlerine) tebliğ ettiklerini bize Peygamberimiz (Muhammed) (sallallahü aleyhi ve sellem) haber verdi, biz de O'nu doğruladık, derler. İşte bu açıklamam Allahü teâlâ'nın : böylece sizi hayırlı ve âdil bir ümmet kıldık ki bütün insanlar üzerine şâhidler olasınız. Peygamber (iniz) de üzerinize şâhid olsun. \" (Bakara, 143) buyruğunun muhtevasıdır (içeriğidir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 4285,
			"arabicnumber": 4285,
			"text": "“... Rifâa el-Cühenî (radıyallahü anh)’den: Şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem)'in beraberinde bir yolculuk (veya savaş) tan geri döndük. O sıralarda Resûl-i Ekrem (sallallahü aleyhi ve sellem) : canı (kudret) elinde olan (Allah) a yemin ederim ki: İmân edip, sonra doğru yoldan ayrılmayan hiç bir kul yoktur ki cennete dâhil edilmesin. Siz ve iyi (= dindar) nesliniz cennetteki meskenlere (köşklere) yerleşmedikçe (diğer ümmetlerin mü'minleri olan) cennetliklerin cennete girmemelerini de ümit ederim ve Rabbim (Azze ve Celle), ümmetimden yetmiş bin kişiyi hesabsız olarak cennete dâhil etmeyi bana kesin vaadetti,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 4286,
			"arabicnumber": 4286,
			"text": "“... Ebû Ümâme el-Bâhilî (radıyallahü anh)'den rivâyet edildiğine göre kendisi: Resûlüllah (sallallahü aleyhi ve sellem)'i şu buyruğu buyururken işittim, demiştir : Sübhânehû benim ümmetimden yetmiş bini, üzerlerinde ne hesab ne de azab olmaksızın cennete dâhil etmeyi bana vaadetti. (Bunlardan) beher birinin beraberinde yetmiş bin (kişi) ve Rabbim (Azze ve Celle)'nin avuçlarıyla üç avuç dolusu, (yani ümmetimden çok sayada kişi) bulunur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 4287,
			"arabicnumber": 4287,
			"text": "“... Behz bin Hakîm'in baba babası (Muâviye bin Hayda el-Kuşeyrî) (radıyallahü anhüm)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : (yani Ümmeti Muhammediye) kıyamet günü yetmiş ümmeti tamamlarız (yani ümmetlerin sayısı bizimle yetmişe ulaşır). Biz (dünyaya geliş bakımından) ümmetlerin sonuncusuyuz ve (de) en hayırlısıyız",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 4288,
			"arabicnumber": 4288,
			"text": "“... Behz bin Hakîm'in baba babası (Muâviye bin Hayda el-Kuşeyrî) (radıyallahü anhüm)’den rivâyet edildiğine göre kendisi: Ben, Resûlüllah (sallallahü aleyhi ve sellem)'i şöyle buyururken işittim, demiştir: (ümmetim), ümmetlerin sayısını yetmişe tamamladınız. Siz ümmetlerin en hayırlısı ve Allah katında en değerlisisiniz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 4289,
			"arabicnumber": 4289,
			"text": "“... Süleyman bîn Büreyde'nin babası (Büreyde bin el-Husayb) (radıyallahü anhümâ)'dan rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: ehli yüz yirmi saftır. Seksen (saf) bu ümmetten, kırk saf da diğer ümmetlerden oluşur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 4290,
			"arabicnumber": 4290,
			"text": "“... İbn-i Abbâs (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: (dünyaya geliş bakımından) ümmetlerin sonuncusuyuz ve (kıyamet günü) hesabı görüleceklerin ilkiyiz, (Kıyamet günü) \"Ümmi olan ümmet ve peygamberi nerededir?\" denilir (yani bu ümmete öncelik verilir). Bu itibarla biz (dünyaya gelişte) sonuncu (kıyamet günü hesabın görülmesi ve cennete girmek bakımından) önde olanlarız",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 4291,
			"arabicnumber": 4291,
			"text": "“... Ebû Bürde'nin babası (Ebû Mûsâ el-Eş'arî) (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: kıyamet günü yaratıkları topladığı zaman secde etmek hususunda Muhammed (sallallahü aleyhi ve sellem)'in ümmetine izin verilecek ve bunun üzerine bu ümmet Allah'a uzun sürecek bir secde edecekler. Sonra onlara: \"Başlarınızı (secdeden) kaldırınız. Biz sayınız kadar (kâfirleri) ateşten (kurtuluşunuz için) fidyeleriniz yaptık, buyurulacaktır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 4292,
			"arabicnumber": 4292,
			"text": "“... Enes bin Mâlik (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: bu ümmet (Allah tarafından) rahmete mazhar olmuştur. Azabı da kendi elleriyledir. Sonra kıyamet günü olunca müslümanlardan her kişiye, müşriklerden bir kişi verilecek ve: Bu senin ateşten (kurtuluş) fidyendir, denilecektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 4293,
			"arabicnumber": 4293,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: yüz rahmeti şüphesiz vardır. Onlardan bir rahmeti bütün yaratıklar arasında taksim buyurmuştur. İşte yaratıklar birbirlerine ancak o rahmet sebebiyle merhamet ederler, bu sebeble şefkatlaşırlar. Vahşi hayvan da yavrularına bu rahmet sebebiyle acır. Allah, doksan dokuz rahmeti de geciktirerek kıyamet günü (mü'min) kullarına onlarla merhamet edecektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 4294,
			"arabicnumber": 4294,
			"text": "“... Ebû Saîd (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (Azze ve Celle), gökleri ve yeri yarattığı gün yüz rahmet yaratarak onlardan bir rahmeti yerde kıldı. İşte anne, yavrusuna, hayvanlar birbirine ve kuşlar (birbirine) bu rahmetle şefkat ederler. Allah, doksan dokuz rahmeti de kıyamet gününe erteledi. Kıyamet günü olunca Allah yüz rahmeti bu rahmetle tamamlar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 4295,
			"arabicnumber": 4295,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (Azze ve Celle), yaratıkları yarattığı zaman kendi zâtı için: Benim rahmetim gadabıma galebe çalar, diye bizzat yazdı (yani vaad edip bu vaadini yerine getirmeyi taahhüt etti)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 4296,
			"arabicnumber": 4296,
			"text": "“... Muâz bin Cebel (radıyallahü anh)’den; Şöyle demiştir: bir merkeb üstünde iken Resûlüllah (sallallahü aleyhi ve sellem) yanımdan geçti ve: Muâz! Allah'ın kullar üzerindeki hakkının ne olduğunu ve kulların Allah üzerindeki hakkının ne olduğunu bilir misin?) buyurdu. Ben de: ve Resulü daha iyi bilir, dedim. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : Allah'ın kullar üzerindeki hakkı, kulların Ona ibâdet (ve kulluk) etmeleri ve O'na hiç bir şeyi ortak koşmamalarıdır. Bunu yaptıkları zaman kulların Allah üzerindeki hakkı da onlara azab vermemesidir,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 4297,
			"arabicnumber": 4297,
			"text": "“... İbn-i Ömer (radıyallahü anhümâ)’dan; Şöyle demiştir: savaşlarının birisinde Resûlüllah (sallallahü aleyhi ve sellem)’in beraberinde bulunuyorduk. O (bu seferde) bir kavme uğrayarak : (Bunlar kimdir?) diye sordu. O kavim de: Biz müslümanız, dediler. Bir kadın da tandırına yakacak atmakla meşguldü ve beraberinde bir oğlu vardı. Tandırın alevi yükselince kadın çocuğunu uzaklaştırırdı. Sonra kadın Peygamber (sallallahü aleyhi ve sellem)'in yanına geldi ve : Allah'ın Resulü (mü)sün? dedi. O da: buyurdu. (Bunun üzerine) kadın (O'na) : anam sana feda olsun! Allah merhametli olanların en çok merhametlisi değil mi? dedi. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : (en merhametlisidir),) buyurdu. Kadın : kullarına, annenin çocuğuna şefkatinden daha çok merhametli değil midir? dedi. Resûl-i Ekrem (sallallahü aleyhi ve sellem): (daha merhametlidir),) buyurdu. Kadın: anne, çocuğunu ateşe kesinlikle atmaz, (yani merhametlilerin en merhametlisi olan Allah, kullarının bâzısını nasıl ateşe atacak), dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) ağlıyarak mübarek başını eğip uzun zaman yere baktı. Sonra mübarek başını kadına doğru kaldırarak: Allah, hak yoldan sapıp O'na itâat etmeye tenezzül etmeyen ve Tevhîd kelimesini söylemekten imtina eden azgın kulundan başka kullarına azab vermeyecektir,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 4298,
			"arabicnumber": 4298,
			"text": "“... Ebû Hüreyre (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) olan kişiden başka kimse ateşe girmiyecek,) buyurdu. Yâ Resûlallah! Şaki kimdir? diye sorulunca da O: ibâdet olarak Allah için hiç bir amel işlemeyen ve günahtır diye hiç bir günahı bırakmayan kimsedir,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 4299,
			"arabicnumber": 4299,
			"text": "“... Enes bin Mâlik (radıyallahü anh)’den rivâyet edildiğine göre ; Resûlüllah (sallallahü aleyhi ve sellem); . . . . . . (Müddessir, 56) âyetini okudu (veya tilâvet etti). Sonra buyurdu ki : (Azze ve Celle) (bu âyette) : Ben (azabımdan) sakınılarak benden başka ilâh edinilmemeye (yani bana ortak koşulmamaya) lâyıkım. Artık kim benimle beraber başka bir ilâh edinmekten sakınırsa o kimseyi ben bağışlarım, buyurdu.) ..... Enes (radıyallahü anh)'den rivâyet edildiğine göre Resûlüllah (sallallahü aleyhi ve sellem); . . . . . Müddessir, 56) âyeti hakkında şöyle buyurdu: buyurdu ki: Ben (azabımdan) sakınılarak benden başkasının bana ortak koşul mamasına lâyıkım ve bana ortak koşmaktan sakınan kimseyi bağışlamaya lâyık olan (da ancak) benim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 4300,
			"arabicnumber": 4300,
			"text": "“... Abdullah bin Amr (bin el-Âs) (radıyallahü anhümâ)’dan rivâyet edildiğine göre kendisi: Ben, Resûlüllah (sallallahü aleyhi ve sellem)’i şöyle buyururken işittim, demiştir : günü bütün yaratıkların duyacağı biçimde ümmetimden bir adam (hesaba) çağırılır ve ona (günahlarının yazılı olduğu) doksan dokuz sicil (yani büyük defter açılıp) yayılır. Her defter gözün görebildiği saha kadar uzundur. Sonra Allah (Azze ve Celle) (o kula) : sicillerde yazılı (günahlar) dan bir şey inkâr eder misin? buyurur. Kul: ya Rabbi, der. sonra Allah (ona) : sevablarını ve günahlarını) kaydedip tutan yazıcı melekler sana haksızlık ettiler mi? buyurur. Sonra (yine) Allah (Azze ve Celle) : (kadar günahlarına karşılık bir iyiliğin - hayrın var mı? diye sorar. Bunun üzerine adam büyük bir korkuya kapılarak (telaşından) : (hiç bir iyi amelim yok), diyecek. Sonra Allah (Azze ve Celle) : (vardır). Şüphesiz katımızda senin bir takım iyi amellerin bulunur ve şüphesiz bu gün sana hiç bir zulüm yoktur, buyurur. Sonra o adam için bir yaprak kâğıt çıkarılır ki onda \"Eşhedü ellâ ilahe illallah ve eşhedü enne Muhammeden abdühu ve Resûlühu = Dilimle söyler, kalbimle de tasdik ederim ki Allah'tan başka ibâdete-tapınmaya lâyık hiç bir ilâh yoktur ve dilimle söyler, kalbimle de tasdik ederim ki Muhammed, Allah'ın kulu ve (son) elçisi, peygamberidir. \" bulunur. Resûl-i Ekrem (sallallahü aleyhi ve sellem) buyur-muş ki: : Yâ Rabbi, şu (koskoca) büyük defterler yanında bu kağıt nedir? Allah (ona) : sana zulüm edilmiyecek, buyurur. Sonra siciller (yani günahlarının yazılı olduğu büyük defterler) terazinin bir kefesine konulur. Şehâdet kelimesinin yazılı olduğu kâğıd da terazinin diğer kefesine konulur (ve tartılır). Büyük defterler hafif gelir ve o kağıt parçası ağır gelir.) Muhammed bin Yahya dedi ki: Bıtâka, kâğıt parçasıdır. Mısır halkı kâğıda Bıtâka derler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 4301,
			"arabicnumber": 4301,
			"text": "“... Ebû Saîd-i Hudrî (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: Ka'be ile Beytü’l-Makdis (yani Kudüs'teki Mescid-i Aksa) arası kadar (büyük) bir havuzum vardır. Süt gibi beyaz olup kabları yıldızlar sayısıncadır. Kıyamet günü şüphesiz, ümmeti en çok olan peygamber benim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 4302,
			"arabicnumber": 4302,
			"text": "“... Huzeyfe (bin el-Yemân) (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) : benim havuzum, Eyle'den Aden'e kadar olan mesafeden cidden daha uzundur. Nefsim (kudret) elinde olan (Allah)'a yemin ederim ki muhakkak kabları yıldızların sayısından daha çoktur ve muhakkak o, sütten daha beyaz ve baldan daha tatlıdır. Ruhum (kudret) elinde olan (Allah) a yemin ederim ki adam yabancı develeri kendi havuzundan kovduğu gibi ben de bir takım adamları havuzumdan kovarım,) buyurdu, demiştir. (Bunun üzerine sahâbiler tarafından) : Resûlallah! Sen bizi tanıyacak mısın? diye soruldu. O: (Evet. Siz benim yanıma abdest izinden yüzleriniz, kollarınız ve ayaklarınız nurlu olarak varacaksınız. Bu alâmet sizden başka hiç bir kimsede olmayacaktır,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 4303,
			"arabicnumber": 4303,
			"text": "“... Ebû Sellâm el-Hubşî (Meiritûr el-Esved) (radıyallahü anh)'den; Şöyle demiştir: Ömer bin Abdilaziz bana haber göndererek yanına çağırttı. Ben de bir katır sırtında onun yanına gittim. Nihayet yanına vardığım zaman (bana) : Ebâ Sellâm! Buraya kadar bindirip getirmek hususunda cidden sana meşakkat verdik, dedi. Ebû Sellâm da: doğrudur, Yâ Emîre’l-Mü'minin, dedi. Ömer bin Abdilaziz : yemin ederim ki, sana eziyyet çektirmek istemedim. Ve lâkin (kevser) havuzu hakkında Resûlüllah (sallallahü aleyhi ve sellem)'in mevlâsı Sevbân (radıyallahü anh)’den senin rivâyet ettiğini haber aldığım bir hadis var. O hadisi kendi ağzınla bana rivâyet etmeni sevdim (de bunun için seni çağırttım), dedi. Ebû Sellâm el-Hubşî demiştir ki, bunun üzerine ben dedim: Resûlüllah (sallallahü aleyhi ve sellem)’in mevlâsı Sevbân (radıyallahü anh)'ın rivâyet ettiğine göre Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: benim havuzum Aden ile Eyle arasındaki mesafe kadar (uzun) dur. Sütten daha beyaz ve baldan daha tatlıdır. Bardakları gökteki yıldızlar sayısı gibi (çok) dur. Kim ondan bir yudum içerse artık ebediyen susamaz. O havuzun başına yanıma gelenlerin ilki, (dünyada iken) elbiseleri kirli başlarındaki saçlar dağınık, karışık (yani maddî sıkıntıdan üstü başı perişan) olan muhacirlerin fakirleridir ki varlıklı eşraftan olan kadınlarla evlenemez ve kapılar onlara açılmaz.) demiştir ki: Ömer (bin Abdilaziz), sakalı ıslanıncaya kadar ağladı. Sonra şöyle söyledi: Lâkin ben bol nîmetlenmiş kadınlarla evlendim ve kapılar bana açıldı. Artık çâre yok, vücûdum üstündeki elbiseyi yıkamıyacağım ki iyice kirlensin ve başımı yağlamıyacağım ki saçım dağılıp karışsın, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 4304,
			"arabicnumber": 4304,
			"text": "“... Enes (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: havuzumun iki kenarı arasındaki mesafe San'a ile Medine arasındaki mesafe gibi veya Medine ile Amman arasındaki mesafe gibidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 4305,
			"arabicnumber": 4305,
			"text": "“... Enes bin Mâlik (radıyallahü anh)’den rivâyet edildiğine göre; Allah'ın Nebîsi (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: gökteki yıldızlar sayısınca altın ve gümüş bardaklar görülür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 4306,
			"arabicnumber": 4306,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre: (sallallahü aleyhi ve sellem) bir mezarlığa giderek kabristan (da yatanlar) a şöyle selâm verdi: size ey mü'minler topluluğunun diyarında olanlar! Biz de inşâallah Teâlâ, size katılacağız.) Sonra Resûl-i Ekrem (sallallahü aleyhi ve sellem) : kardeşlerimizi (dünyada) görmüş olmayı çok arzu ederdim, buyurdu.) Sahâbîler: Resûlallah! Biz senin (din) kardeşlerin değil miyiz? dediler. O: (Siz benim sahâbilerim (arkadaşlarım) sınız. Kardeşlerim de benden sonra gelen (mü'min) lerdir ve ben havuz üstünde öncünüzüm,) buyurdu. Sahâbîler : Resûlallah! Senin ümmetinden olup da henüz (dünyaya) gelmemiş olanları nasıl tanıyacaksın? diye sordular. (Söyleyin bakayım, yağız ve doru at sürüsü içinde bir adamın sakar ve sekir atları bulunsa, adam kendi atlarını tanır olmaz mı?) diye sordu. Sahabîler: (tanır), dediler. Resûl-i Ekrem (sallallahü aleyhi ve sellem): onlar da kıyamet günü abdest izinden dolayı yüzleri, kolları ve ayakları nurlu olarak gelirler,) buyurduktan sonra: (Ben havuz üstünde sizin (ve onların) öncüsüyüm,) buyurdu. Daha sonra (Buyruğuna devamla) : takım adamlar kayıp devenin (sudan) kovulduğu gibi benim havuzumdan muhakkak kovulacaklar. Ben (onlara hitaben) dikkat ediniz, buraya geliniz, diye onları çağıracağım. Fakat (bana) : senden sonra muhakkak (dinde) değişiklik yaptılar, denilecek ve onlar geri dönmeye devam edecekler. Ben de haydin uzaklaşın, uzaklaşın diyeceğim,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 4307,
			"arabicnumber": 4307,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: peygamberin kabul edilen bir duası olur ve her peygamber bu duasını acele etti (yani dünyada etti). Fakat ben (makbul) duamı ümmetime şefaat için sakladım. Bu sakladığım duâ ümmetimden olup da Allah'a hiç bir şeyi ortak koşmadan ölen herkese nasip olur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 4308,
			"arabicnumber": 4308,
			"text": "“... Ebû Saîd(-i Hudrî) (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: Âdem oğlunun (yani bütün insanların) büyüğüyüm de böbürlenme yoktur. Kıyamet günü (dirilmek için) yerin yarılmasıyla (kabirden) ilk çıkacak olan da benim. Bununla beraber böbürlenme yoktur. İlk şefaat edecek ve şefaati ilk kabul olunacak kimse de benim ve (bununla) iftihar etmek yoktur. Kıyamet günü Hamd Bayrağı benim elimde bulunacak. Bununla beraber böbürlenmek yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 4309,
			"arabicnumber": 4309,
			"text": "“... Ebû Saîd(-i Hudrî) (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) : ehli olan (yani ebedî olarak cehennemde kalacakları Kur'ân'da bildirilen) cehennemliklere gelince, şüphesiz onlar ateşte ne ölürler ne de yaşarlar (yani devamlı azabta olurlar). Lâkin günahları yüzünden veya hatâları sebebiyle kendilerine cehennem ateşi isabet eden bir takım insanlar da vardır ki ateş onları tam manâsıyla öldürür. Nihayet onlar (yanıp) kömür olunca onlar için şefâata izin verilir ve onlar guruplar hâlinde getirilip cennet nehirlerine dağıtılırlar. Sonra: (Cennet halkına hitaben) : Cennetlik olanlar! Şunların üzerine cennet nehirlerinin sularını dökünüz, denilir. Bunun üzerine (su dökülünce) onlar selin taşıdığı (çamur ve benzeri) kalıntıda olan tohum (hızla) bittiği gibi bitiverirler,) buyurdu. buyruk üzerine cemaattan biri: Resûlüllah (sallallahü aleyhi ve sellem) (sel durumlarını bilmesi açısından) çölde imiş gibidir, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 4310,
			"arabicnumber": 4310,
			"text": "“... Câbir (bin Abdillah) (radıyallahü anhümâ)’dan rivâyet edildiğine göre kendisi: Resûlüllah (sallallahü aleyhi ve sellem)'i şöyle buyururken işittim, demiştir: kıyamet günü benim şefaatim, ümmetimden büyük günahlar işleyenleredir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 4311,
			"arabicnumber": 4311,
			"text": "“... Ebû Mûsâ el-Eş'arî (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: şefaat etmek ve (ya) ümmetimin yarısının cennete girmesi arasında muhayyer (serbest) kılındım. Ben şefaat etmeyi seçtim. Çünkü şefaat daha umûmî ve daha çok yeterlidir. Siz bu şefaatimi takva sahibi (yani Allah'tan korkup kulluk görevlerini yerine getiren ve yasaklardan sakınan) mü'minler için mi sanırsınız? Hayır (öyle sanmayınız). Ve lâkin o (şefaatim) günahkâr, hatalı ve pis işlere karışan (müslüman) lar içindir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 4312,
			"arabicnumber": 4312,
			"text": "“... Enes bin Mâlik (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: kıyamet günü toplanarak : Rabbimize bir şefaatçi göndersek de Rabbimiz bizi bu (sıkıntılı) yerimizden rahata kavuştursa, diyecekler (Bunu söylemeleri için Allah tarafından) gönüllerine ilham edilir (veya onlar bu sıkıntıya gereken önemi verirler. — Bu tereddüd ravi Said'e aittir—). Bunun üzerine mü'minler Âdem (Aleyhisselam) 'a varırlar ve (ona) : Âdem'sin, bütün insanların babasının, Allah seni (kudret) eliyle yarattı ve meleklerini sana secde ettirdi. Artık (ne olur) bizim için Rabbin katında şefaat et de bizi şu (sıkıntılı) yerimizden (kurtarıp) rahata kavuştursun, derler. Fakat Âdem (Aleyhisselâm) : sizin dediğiniz (şefaat) makamında değilim (ve Âdem vaktiyle işlediği hatâyı onlara yakınarak anlatarak bundan dolayı haya eder) ve lakin Nuh'a gidiniz. Çünkü O, Allah'ın yer yüzündekilere gönderdiği ilk resul (elçi)dir, der. Bunun üzerine mü'minler Nuh (Aleyhisselâm) 'a varırlar. O da: sizin dediğiniz (şefaat) mevkiinde değilim, (ve Nûh, hakkında bilgisi olmayan bir şeyi — ki oğlunun aile ferdlerinden oluşu dolayısıyla tufanda boğulmaması isteğidir— Rabbinden dilediğini anlatır ve bundan dolayı haya eder) ve lâkin Halilu'r-Rahmân (yani Allah'ın dostu) İbrâhîm (Aleyhisselâm)’ın yanına gidiniz, der. Sonra mü'minler İbrâhîm peygambere varırlar. Fakat O da sizin dediğiniz şefaat mevkiinde değilim. Ve lâkin Allah'ın kendisi ile konuştuğu ve Tevrat'ı verdiği kulu Mûsâ (Aleyhisselâm)'a gidiniz, der. O da : orada (yani şefaat makamında) yokum (ve Mûsâ bu arada vaktiyle kısas durumu olmaksızın bir adamı öldürdüğünü anlatır) ve lâkin siz, Allah'ın kulu, resulü, kelimesi ve ruhu (denilen) Îsa (Aleyhisselâm)’ın yanına gidiniz, der. Bunun üzerine mü'minler Îsa'ya varırlar. O da : sizin dediğiniz şefaat makamında yokum ve lâkin Muhammed (sallallahü aleyhi ve sellem)’e, Allah'ın kendisinin geçmiş ve gelecek hatâlarını bağışladığı (o yüce) kula gidiniz, der. Resûl-i Ekrem (sallallahü aleyhi ve sellem) buyurdu ki: üzerine mü'minler benim yanıma gelirler. Ben de kalkıp giderim) (râvi demiştir ki: Şeyhim: \"Ve mü'minlerden İki saf arasında yürürüm\" buyruk cümlesini el-Hasan'dan naklen anlattı). Râvi demiştir ki sonra Enes (radıyallahü anh) 'in hadisine döndü. Resûl-i Ekrem (sallallahü aleyhi ve sellem) (sözüne devamla) buyurdu ki : üzerine ben Rabbimin huzuruna çıkmak için izin isterim. Bana izin verilir. Sonra Rabbimi gördüğüm zaman hemen secdeye kapanının. Allah dilediği sürece beni secde hâlinde bırakır. Sonra (bana): kaldır Yâ Muhammed! Ve söyle, işitilirsin; iste, istediğin verilir ve şefaat et, şefaatin kabul olunur, buyurulur. Bunun üzerine ben (başımı secdeden kaldırarak) O'na, Zâtının bana öğrettiği bir hamd şekliyle hamdederim. Sonra (genel ve özel) şefâatta bulunurum. Bunun üzerine Rabbim bana bir sınır (ve çerçeve) çizer. Ben de o sınır (yani ölçü) içinde kalanları cennete dâhil ederim. Sonra ikinci defa (şefaat için) dönerim ve O'nu görünce secdeye varırım, Allah beni dilediği kadar secdede bırakır. Sonra bana : kaldır (yâ) Muhammed! Söyle, dinlenirsin iste, istediğin verilir ve şefaat et şefaatin kabul olunur, buyurulur. Bunun üzerine ben de başımı kaldırıp O'na bana öğrettiği bir hamd şekliyle hamdederim. Sonra (tekrar) şefaat ederim. Rabbim benim (şefaat edeceğim kimseler) için bir sınır (ve çerçeve) çizer. Ben de o ölçü içine girenleri cennete dâhil ederim. Sonra üçüncü defa (şefaat etmeye) dönerim ve Rabbimi görünce secdeye kapanırım. Rabbim beni dilediği kadar (secdede) bırakır. Sonra : kaldır (yâ) Muhammed! Söyle, işitilirsin; iste, istediğin verilir ve şefaat et, şefaatin kabul olunur, buyurulur. Ben de başımı kaldırıp O'na bana öğrettiği biçimde hamdederim. Sonra şefaat ederim. Allahım (yine) bana bir sınır tâyin eder. Ben de onları cennete dâhil ederim. Sonra dördüncü kez (Rabbimin huzuruna) dönerek: Rabbî (cehennemde) Kur'ân’ın hapsettiği (yani ebedi olarak cehennemde kalmalarına hükmettiği) kişilerden başka hiç kimse kalmadı, diyeceğim.) ... Râvi demiştir ki: Katade bu hadîsin hemen arkasında şöyle dedi : Ve Enes bin Mâlik (radıyallahü anh), Resûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu da bize rivâyet etti : bir arpa (tanesi) ağırlığınca hayır (yani iman) bulunduğu halde \"lâ ilahe illallah = Allah'tan başka ilâh yoktur\" diyen herkes cehennemden çıkacaktır. Keza: kalbinde bir buğday (tanesi) ağırlığınca hayır (yani imân) bulunduğu halde \"Lâ ilahe illallah\" diyen herkes cehennemden çıkacaktır. Kalbinde zerre ağırlığı kadar hayır (yani imân) bulunup da \"Lâ ilahe illallah\" diyen herkes de cehennemden çıkacaktır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 4313,
			"arabicnumber": 4313,
			"text": "“... Osman bin Affân (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: günü üç (zümre) şefaat eder : Peygamberler, sonra din bilginleri, sonra şehîdler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 4314,
			"arabicnumber": 4314,
			"text": "“... Übeyy bin Kâ'b (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: günü olduğu zaman ben peygamberlerin imamı, hatibi ve şefaatlerinin sahibi olurum. (bu sözüm) bir böbürlenme değildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 4315,
			"arabicnumber": 4315,
			"text": "“... İmrân bin Husayn (radıyallahü anh)'den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: bir takım (mü'min) insanlar cehennemden benim şefâatımla çıkacaklar (ve cennete girecekleridir. Onlar cehennemlikler, diye adlandırılacaklardır)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 4316,
			"arabicnumber": 4316,
			"text": "“... Abdullah bin Ebi'l-Ced'ân (radıyallahü anh)’den rivâyet edildiğine göre kendisi Peygamber (sallallahü aleyhi ve sellem)’i: ümmetimden bir adamın şefâatıyla Temim oğullan (kabilesi) nden daha çok (mü'min) kimseler muhakkak cennete girecektir,) buyururken işitmiş (ve orada hazır bulunanlar) : Resûlallah! Senden başka bir adam (mı) ? diye sorunca O : (Evet,) buyurmuştur. Abdullah bin Şakîk demiş ki) :Ben (Abdullah bin Ebi’l-Ced’ân'a:) Bu hadîsi Resûlüllah (sallallahü aleyhi ve sellem)'den sen kendin (mi) işittin? dedim. O : kendim O'ndan işittim, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 4317,
			"arabicnumber": 4317,
			"text": "“... Avf bin Mâlik el-Eşcaî (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) : bu gece beni ne hakkında muhayyer (serbest) kıldığını bilir misiniz?) diye (bize) sordu. Biz : ve Resulü (her şeyi) en iyi bilenlerdir, dedik. O: (İşte Rabbim ümmetimin yarısını cennete dâhil etmek ve şefaat (etmem) arasında şüphesiz beni muhayyer kıldı. Ben şefaat etmeyi seçtim,) buyurdu. Biz: Resûlallah! Bizi şefaat edeceğin kimselerden etmesi için Allah'a duâ buyur, dedik. O : her müslümanadır,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 4318,
			"arabicnumber": 4318,
			"text": "“... Enes bin Mâlik (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: sizin şu (dünya) ateşiniz, cehennem ateşinin yetmiş parçasından bir parçadır ve eğer su ile iki defa söndürülmemiş (yani harâreti giderilmemiş) olsaydı siz (dünyada) ondan yararlanamazdınız. Şüphe yok ki, dünya ateşi, (kendisinden) giderilmiş sıcaklığı ona iade etmemesi için Allah (Azze ve Celle)'ye duâ eder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 4319,
			"arabicnumber": 4319,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: Rabbine şikâyet ederek : Yâ Rabbi! Ben kendi kendimi yedim, dedi. Bunun üzerine Allah ona iki (defa) nefes (vermesi) için izin verdi. Bir nefes kışın, bir nefes de yazın (dır). İşte bulduğunuz şiddetli soğuk, cehennemin zemherîrindendir, bulduğunuz şiddetli sıcak da onun harâretindendir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 4320,
			"arabicnumber": 4320,
			"text": "“... Ebû Hüreyre (radıyallahü anh)'den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: ateşi bin yıl yakılarak beyazlaştı. Sonra bin yıl daha yakılarak kıpkırmızılaştı. Daha sonra bin yıl yakılmak suretiyle nihayet simsiyah hâle geldi. Artık karanlık gece gibi kapkaradır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 4321,
			"arabicnumber": 4321,
			"text": "“... Enes bin Mâlik (radıyallahü anh)’den rivâyet edildiğine göre; (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : dünya nimetlerinden en çok yararlanıp müreffeh yaşıyanı kıyamet günü getirilir ve : Şu herifi ateşe bir kere daldırınız, denilir. Bu emir üzerine adam ateşe (bir kere) daldırıldıktan sonra kendisine : Falan (kişi)! Geçmiş zaman boyunca herhangi bir nimet senin eline geçti mi? denilir. Kendisi: geçmiş sürece bana hiç bir nimet bana isabet etmedi, der. Mü'minlerin (dünyada iken) en şiddetli sıkıntı ve belâ çekeni de (kıyamet günü) getirilir ve: Bunu cennete bir kere daldırınız, denilir. Bunun üzerine o mü'min cennete bir kere daldırılır. Sonra ona: Falan (Mü'min)! Geçmiş zaman boyunca herhangi bir sıkıntı veya belâ çektin mi? denilir. O da : Şu ana kadar hiç bir sıkıntı ve hiç bir belâ çekmedim, der",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 4322,
			"arabicnumber": 4322,
			"text": "“... Ebû Saîd-i Hudrî (radıyallahü anh)’den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: kişi (cehennemde) şüphesiz öyle iri yapılı olur ki dişi Uhud (dağın) dan muhakkak daha büyük olur ve vücûdunun dişinden büyüklüğü (de) herhangi birinizin vücûdunun dişinden büyüklüğü gibidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 4323,
			"arabicnumber": 4323,
			"text": "“... El-Hâris bin Ukayş (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: benim ümmetimden (şefaati makbul) öyle kimseler vardır ki onların şefâatıyla Mudar (kabilesin) den daha çok kişiler cennete girer. Şüphesiz benim (davet) ümmetimden öyle kimseler de bulunur ki, ateş (te yanmak) için cehennemin bir köşesini teşkil edecek kadar iri yapılı olur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 4324,
			"arabicnumber": 4324,
			"text": "“... Enes bin Mâlik (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: halkının üzerine ağlama gönderilir (yani ilâhi emirle onları bir ağlamak tutar) ve göz yaşları tükeninceye kadar ağlarlar. Sonra da kan ağlarlar. Nihayet yüzlerinde kanal biçimi gibi öyle çukur oluşur ki eğer o kanala gemiler salınırsa hızlı gidecektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 4325,
			"arabicnumber": 4325,
			"text": "“... İbn-i Abbâs (radıyallahü anhüma)’dan; Şöyle demiştir Resûlüllah (sallallahü aleyhi ve sellem) : imân edenler Allah'tan sakınılması gerektiği gibi sakının ve herhalde mûslüman olarak can veriniz\" (Âl-i îmrân, 102) âyetini okuyup şöyle buyurdu : zakkûm'dan bir damla yere damlatılmış olsaydı, o damla dünyadaki canlıların geçim vesilesi (olan tüm gıda maddeleri) ni bozardı. Artık zakkûm'dan başka yiyeceği olmayan (cehennem halkın) ın hali nasıl (elem verici) dir?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 4326,
			"arabicnumber": 4326,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur : ateşi (mü'min olan) Âdem oğlunun secde yeri (yani organları) dışında kalan bedenini yiyer. Allah cehennem ateşine secde eserini (yani organlarını) yemeyi (yakmayı) yasakladı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 4327,
			"arabicnumber": 4327,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: günü ölüm (bir koç gibi) getirilip Sırat (köprüsü) üstün’de durdurulur ve: Ey cennet halkı, diye çağırılırlar. Cennettekiler (bu çağrı üzerine) içinde bulundukları (güzel) yerden çıkarılacakları endişe ve korkusu ile bakarlar. Sonra: Ey Cehennem halkı, denilir. Onlar da içinde oldukları (kötü) yerden çıkarılacakları ümidiyle sevinç- ve ferahlı bakarlar. Daha sonra (Cennettekiler ile cehennemdekilere): Bunu tanır mısınız? diye sorulur. Onlar da : Evet, bu ölümdür, derler, Resûl-i Ekrem (sallallahü aleyhi ve sellem) buyurdu ki : Bunun üzerine emir verilerek ölüm. Sırat (köprüsü) üstünde boğazlanıp kesilir ve sonra cennet halkı ile cehennem halkının her ikisine de : İçinde bulunduğunuz halde devamlı kalıcılarsınız. Onda sonsuza dek ölüm yoktur, denilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 4328,
			"arabicnumber": 4328,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (Azze ve Celle) : Ben sâlih (yani ibâdete düşkün, yasak şeylerden çekingen, ahlaken faziletli mü'min) kullarım için hiç bir gözün görmediği, hiç bir kulağın işitmediği ve hiç bir insanın kalbinden geçmeyen bir takım nimetler hazırladım,) buyurur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 4329,
			"arabicnumber": 4329,
			"text": "“... Ebû Saîd-i Hudri (radıyallahü anh)’den rivâyet edildiğine göre ; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: cennetteki bir karış (lık saha) yer (küresin) den ve üzerinde bulunan şeylerden (yani dünya ve içindeki bütün nimetlerden) hayırlıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 4330,
			"arabicnumber": 4330,
			"text": "“... Sehl bin Sa'd (es-Sâidî) (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: bir kamçının (azıcık) yeri (bile) dünyadan ve dünyada bulunan her şeyden hayırlıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 4331,
			"arabicnumber": 4331,
			"text": "“... Muâz bin Cebel (radıyallahü anh)’den rivâyet edildiğine göre kendisi: Ben, Resûlüllah (sallallahü aleyhi ve sellem)’i şöyle buyururken işittim, demiştir: cennet yüz derecedir. Onlardan her bir derece (nin yüksekliği) gök ile yer arasındaki mesafe kadardır. Şüphesiz o derecelerin en yücesi Firdevs'tir, en fazîletliside Firdevs'tir. Arş, muhakkak Firdevs'in üstündedir. Cennetin ırmakları da Firdevs'ten çıkıp akar. Bu itibarla siz Allah'tan (cennet) dilemek istediğiniz zaman O'ndan Firdevs'i isteyiniz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 4332,
			"arabicnumber": 4332,
			"text": "“... Üsâme bin Zeyd (radıyallahü anhümâ)’dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) bir gün sahâbîlerine şöyle buyurdu, demiştir: cennet için çabalayıp gayret edecek kimse yok mu? Şüphesiz, cennete denk hiç bir şey yoktur. Kâ'be'nin Rabbine yemin ederim ki, cennet, güzel, sağlam ve yüksek saraylarda, yüz parlaklığı ve mutluluk - refah içinde sonsuza dek devamlı kalınacak, parlayan nur, (rüzgâr esintisiyle) sallanıp dalgalanan güzel kokulu yeşillik, sağlam köşk, akan nehir, olgunlaşmış bol meyve, (huyu) beğenilen ve (şeklen) güzel hanım ve çok giysiden ibarettir.) Sahâbîler: için çabalayıp gayret edenler bizleriz, yâ Resûlüllah, dediler. O: deyiniz,) buyurdu. Sonra cihad etmeyi anlatarak (sahâbileri) ona teşvik etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 4333,
			"arabicnumber": 4333,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: giren ilk zümre ayın on dördüncü gecesindeki suretinde (parlak) dır. Onların ardından girenler de gökteki en şiddetli ışık saçan yıldız parlaklığındadır. Küçük abdest yapmazlar, büyük abdest yapmazlar, sümkürmezler ve tükürmezler. Tarakları altındır. Terleri de misk (gibi)dir ve (buhurdanlıklarındaki) buhurları öd ağacıdır. Zevceleri (yani hanımları) büyük gözlü hurilerdir. Huyları bir adamın huyu üzerinde (yani huyları aynı) dır. Onlar, babaları Âdem (Aleyhisselâm)'ın suretinde (boyları da) altmış arşındır.) . ... Ebû Bekir bin Ebî Şeybe bize İbn-i Fudayl'ın Umâre'den rivâyet ettiği (şu) hadisin mislini ..... senediyle de yine Ebû Hüreyre'den merfû olarak rivâyet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 4334,
			"arabicnumber": 4334,
			"text": "“... İbn-i Ömer (radıyallahü anhüma)’dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: cennette bir ırmaktır. Irmağın iki kenarı altındır. Yakut ve büyük inciler üzerinde akar. Toprağı miskten daha güzel kokuludur. Suyu baldan tatlı ve kardan daha beyazdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 4335,
			"arabicnumber": 4335,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: cennette öyle bir ağaç vardır ki süvari kimse onun gölgesinde yüz yıl yürür onu(n dallarının kapladığı sahayı) bitiremez.) \" Hüreyre demiştir ki) : Ve dilerseniz \"ve cennet halkı uzanmış bir gölgededir\" (Vakıa, 30. âyet) i okuyunuz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 4336,
			"arabicnumber": 4336,
			"text": "“... Saîd bin el-Müseyyeb (radıyallahü anh)’den rivâyet edildiğine göre : (bir gün) Ebû Hüreyre (radıyallahü anh)'a rastlamış ve Ebû Hüreyre (radıyallahü anh) kendisine : Beni ve seni cennet çarşısında (da) biraraya getirmesini Allah'tan isterim, demiş. (Bunun üzerine) Said: çarşı var mı? diye sormuş. Ebû Hüreyre (radıyallahü anh) (de); (sallallahü aleyhi ve sellem) bana şu haberi verdi, demiştir. halkı cennete girdikleri zaman (iyi) amellerinin çokluk derecesine göre makamlarına yerleşirler. Sonra dünya günlerinden Cuma günü kadar bir süre için onlara izin verilerek Allah (Azze ve Celle) 'yi ziyaret ederler. Allah onlar için Arş'ını açar ve cennet bahçelerinden bir bahçede onlara görünür. Cennet halkı için nurdan koltuklar, inciden koltuklar, yakuttan koltuklar, zeberced (cevherin) den koltuklar, altından koltuklar ve gümüşten koltuklar konulur. Cennet halkının (makamca) en aşağı olanı (onların içinde deni-âdî kimse yoktur) da misk ve kâfur yığınları (yani tepecikleri) üstünde otururlar. Bunlar koltuklarda oturanların yerlerinin kendilerinin oturdukları yerlerden üstün olduğunu sanmazlar (ki üzülmesinler). Hüreyre demiş ki: Ben: Resûlallah! Biz (cennette) Rabbimizi görecek miyiz? dedim. O: (göreceksiniz). Siz güneşi görmek ve (gök) ayı on dördüncü gecesinde (yani dolunay hâlinde iken) görmek hususunda şüpheye düşer misiniz?) diye sordu. Biz: (şüpheye düşmeyiz, alenen görürüz), dedik. O : (İşte böylece Rabbiniz (Azze ve Celle)'yi (Cennette) görmek hususunda da şüpheye düşmiyeceksiniz (yani O'nun Zâtını açıkça görmek şerefine kavuşacaksınız) ve o mecliste bulunan herkesle Allah (Azze ve Celle) (ayrı ayrı) konuşacaktır. Hattâ Allah sizden bir adama : Yâ Fulân! Şöyle şöyle yaptığın günü hatırlamıyor musun? diyecek (dünyadaki bâzı vefasızlıklarını —günahlarını— ona hatırlatacaktır) . Adam da : Rabbi! Beni bağışlamadın mı? diyecek. Bunun üzerine Allah (o adama): seni bağışladım. Sen şu mertebene ancak benim mağfiretimin bolluğuyla eriştin, buyuracaktır. İşte cennet halkı böyle (ce Allah'ın cemal ve sohbetiyle müşerref) oldukları sıralarda bir bulut parçası üstten onları kaplıyarak üzerlerine öyle güzel bir koku yağdıracak ki onun kokusu gibi güzel bir şeyi hiç duymamışlar. Sonra Allah (onlara): için hazırladığım ikrama kalkıp gidiniz ve arzuladığınızı -canınızın çektiği şeyleri alınız, buyuracaktır. (Peygamber buyurdu ki) Bunun üzerine meleklerin kuşattığı bir çarşıya varacağız. Misline gözlerin bakmadığı, kulakların işitmediği ve kalblerden geçmeyen şeyler o çarşıda bulunur. (Peygamber buyurdu ki) : O çarşıda hiç bir şey satılmadığı ve satın alınmadığı (yani her şeyin bedava olduğu) halde arzuladığımız şeyler bizim için (köşklerimize) nakledilecektir. Cennet halkı birbirlerini o çarşıda göreceklerdir. Yüksek makam sahibi olan adam gelip kendisinden dûn (yani makamca düşük) adama rastlar (Cennet halkı içinde deni - âdî kimse yoktur). Makamca düşük olan adam, makamca kendisinden yüksek olan adamın üstündeki elbiseyi beğenir - hoşuna gider. Fakat henüz beğenme işi tamamlanmamış iken kendisinin üstündeki elbise gözünde ondan daha güzel hal alır. Bunun sebebi de cennette hiç bir kimsenin üzülmesine meydan verilmemesidir. buyurdu ki: Sonra (çarşıdan) konaklarımıza döneceğiz. Zevcelerimiz bizi karşılayarak: Merhaba, hoş geldin. And olsun ki bizden ayrıldığın vakitteki güzellik ve güzel kokudan daha üstün bir güzellik ve daha güzel koku ile geldin, diyecekler. Biz de diyeceğiz ki : Bu gün biz Cebbar olan Rabbimiz (Azze ve Celle) nin meclisinde oturduk (yani sohbet ve cemâli ile şereflendik) ve şu gördüğünüz üstün güzellik ve daha güzel koku misli ile dönmemiz bize lâyıktır, diyeceğiz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 4337,
			"arabicnumber": 4337,
			"text": "“... Ebû Ümâme (radıyallahü anh)'den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: (Azze ve Celle) sizden cennete dahil ettiği her adama yetmiş iki zevce verir. Bunlardan ikisi gözleri geniş hurilerden ve yetmişi cehennemlik olanlardan kalma mîrasındandır. Bu zevcelerin hepsinin kadınlığı çok şehvet çekicidir ve cennetlik olan her adamın şehvet gücü daimidir.) bin Hâlid hadîsin; . . . . . . . ifadesinden maksad şudur, demiştir: Bâzı erkekler cehenneme (ebedî olarak) girerler ve Fir'avun'un karısı (Âsiye) miras olarak (kıyamette) alınmış (olacağı) gibi cennet ehli olan erkekler onların (imanlı) kadınlarını miras olarak alırlar. \" Ebû Saîd-i Hudrî (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: kişi, cennette çocuk istediği zaman, arzu ettiği gibi çocuğun ceninliği, doğumu (ve erginlik çağına varması) tek bir saatte olur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 4338,
			"arabicnumber": 4338,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 4339,
			"arabicnumber": 4339,
			"text": "“... Abdullah bin Mes'ûd (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: cehennemlik olanlardan en son cehennemden çıkan ve cennetlik olanlardan en son cennete giren adamı şüphesiz bilirim. (O kişi), cehennemden emekleyerek çıkan bir adamdır, (Allah tarafından) onat Git de cennete gir, denilecek. Bunun üzerine adam cennete gidecek, fakat ona cennet dolu gibi görünecektir. Adam da geri dönerek : Rabbi! Ben cenneti dolu buldum, diyecek. Allah (da ona): Git cennete gir, diyecek. O da cennete varacak. Fakat ona cennet (yine) dolu görünecek ve tekrar geri dönecek. Sonra : Rabbi! Ben cenneti dolu buldum, diyecektir. Allah Sübhanehu (ona): cennete gir, buyuracak. O da (tekrar) cennete varacak ve (yine) ona cennet dolmuş gibi görünecek. Tekrar dönüp : Rabbi! Cennet şüphesiz doludur, diyecektir. Bunun üzerine Allah (ona): de cennete gir. Çünkü şüphesiz (orada) dünya kadar ve dünyanın on misli sanadır (veya muhakkak dünyanın on katı kadar sanadır) , buyuracaktır. Adam da : Rabbi!) Yegâne hükümdar olduğun halde benimle alay mı ediyorsun (veya benim aklıma mı gülüyorsun) ? diyecektir.) bin Mes'ûd demiştir ki: (Vallahi) ben Resûlüllah (sallallahü aleyhi ve sellem)’i (bu hadîsin sonunu buyururken) azı dişleri görülecek derecede gülerken gördüm, demiştir. Mes'ûd sözüne devamla) Bu adam cennetliklerin mertebece en aşağı olanıdır, söyleniyordu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 4340,
			"arabicnumber": 4340,
			"text": "“... Enes bin Mâlik (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir : (Allah'tan) cenneti üç defa isterse cennet: Allahım onu cennete dâhil et, der. Kim de cehennem ateşinden korunmasını (Allah'tan) üç defa dilerse, cehennem ateşi: Allahım onu cehennem ateşinden koru, der",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 4341,
			"arabicnumber": 4341,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu, demiştir: hiç bir kimse yoktur ki iki konağı olmasın: Bir konak cennette, diğer bir konak da ateşte cehennemdedir. Bu itibarla bir adam ölüp de ateşe girdiği zaman cennet halkı o kimsenin (cennetteki) konağına vâris olurlar. İşte cennet ehlinin cehennemliklerin cennetteki konaklarına varis olmaları Allahü teâlâ'nın bu sıfatları taşıyanlar, vârislerdir. \" (Mü'minûn, 10) buyruğunun te'yid ettiği bir hükümdür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 242
			}
		}
	]
}