{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"4": "The Book On The Mosques And The Congregations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 735,
			"arabicnumber": 735,
			"text": "Ömer bin el-Hattab (r.a.)'den. rivayet edildiğine göre şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve 5ellem)'i «Her kim, içinde Allah adı anılan bir mescidi bina ederse Allah da onun için cennette bir ev bina eder», buyururken işittim.» Not: Zevaid'de: Ömer (r.a.)'in hadisi mürseldir. Çünkü Osman bin Abdillah bin Süraka, Ömer (r.a.)'den rivayet etmiş. Halbuki Ömer (r.a.), Onun anasının babasıdır. Ve Osman.. kendisinden hadis' işitmemiştir. Bunu el-Mizzi', et-Tehzib'te söylemiştir. İbn•i Hibban da sahihinde bu senedIe hadisi rivayet etmiştir. denilmiştir . AÇIKLAMA 738 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 736,
			"arabicnumber": 736,
			"text": "Osman bin Affan (r.a.')'dan rivayet edildiğine göre şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve 5ellem)'i şöyle buyururken işittim: «Her kim Allah için bir mescid bina ederse Allah da onun için Cennette onun mislini bina eder.» AÇIKLAMA 738 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 737,
			"arabicnumber": 737,
			"text": "Ali bin Ebi Talib (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve 5ellem) şöyle buyurdu, demiştir : «Her kim kendi malından Allah için bir mescid yaparsa Allah da onun için Cennet'te bir ev yapar.» Not: Zevaid'de: Ravi el-Velid bin Müslim tedlisçi olup bunu an'ane ile rivayet etmiştir, şeyhi Lehia da zayıftır. Bu nedenle Ali (r.a.)'ın hadisinin isnadı zayıftır, denilmiştir. AÇIKLAMA 738 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 738,
			"arabicnumber": 738,
			"text": "Cabir bin Abdillah (r.a.)'dan; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve 5ellem) buyurdular ki: «Her kim Allah için bağırtlak kuşu yuvası gibi veya daha küçük bir mescid yaparsa Allah da onun için Cennet'te bir ev yapar.» Not: Zevaid'de: İsnadı sahih, ricali de sika'dır, denilmiştir. Tahric: Ömer (r.a.l'in hadisini, İbn-i Hibban; Osman (r.a.)'ın hadisini Buhari, Müslim ve Tirmizi; Cabir (r.a.)'in hadisini İbn-i Huzeyme de rivayet etmişlerdir. Ali (r.a.)'in hadisini, müelliften başka rivayet edenin bulunup bulunmadığını bilmiyorum. AÇIKLAMA (735, 736, 737 ve 738) : Tirmizi, Osman (r.a.)'ın hadisini rivayet ettikten sonra: Bu konuda Ebu Bekir, Ömer, Ali, Abdullah bin Amr, Enes, İbn-i Abbas, Aişe, Ümmü Habibe, Ebu Zer, Amr bin Abese, Vasile bin el-Eska' Ebu Hureyre ve Cabir bin Abdillah (r.anhum)'dan da rivayetler vardır. Osman (r.a.)'ın hadisi hasen-sahihtir, demiştir. Bu babta geçen bütün hadisler, Allah için bir mescid yapmanın ne kadar sevab olduğunu ifade ederler. Hadislerde ''Allah için ... \" tabirinden maksad, Mescid yapmaktan gayenin Allah rızası olmasıdır. Onun için el-Fetih'te beyan edildiğine göre İbnü'l-Cevzi: Kim yaptığı mescid üzerine ismini yazar veya yazdırırsa ihlastan uzak kalmış olur, demiştir. Ücret mukabilinde mescid inşaatında ça lışan kimse için de bu özel vaad hasıl olmaz. Çünkü ihlas yoktür. Bununla beraber sevabı bulunur. Hadisin; ''Allah onun için bir mislini Cennet'te yapar.'' parçasına gelince; Nevevi: parçadaki; '' ... misli ... '' kelimesi iki manaya muhtemeldir: 1- Yani Allah'ın Cennet'te yapacağı bina ev denilmesi bakımından mescid gibidir. Ama, genişliği ve diğer yönlerden üstünlüğü malumdur. Çünkü Cennet'teki yapılar, hadisle sabit olduğu gibi, hiç bir gözün görmediği hiç bir kulağın işitmediği ve hiç bir beşerin düşünemediği güzelliktedirler. 2- Mescid, dünya evlerinden üstün olduğu gibi Allah'ın o kişiye Cennet'te yapacağı bina, cennet'teki evlerden üstün olacaktır, demiştir. Tuhfetu'l-Ahvezi yazarının beyanına göre, bazıları, parçadaki: \" ... misli ... '' kelimesini şöyle yorumlamışlardır: Allah'ın cennette yapacağı bina, büyüklük bakımından kişinin yaptığı mescid gibidit .. Lakin bir çok yönlerden daha güzel olacaktır. Cabir (r.a.)'in hadisinde; ''Bağırtlak kuşu yuvası gibi veya daha 'küçüh: bir mescid ... '' buyuruluyor. Alimlerin ekserisi bu ifadeyi mübalağa üzerine yorumlamışlardır. Çünkü gerçekten bağırtlak kuşu yuvası kadar küçük olan bir yerde bir insanın namaz kılmasının mümkün olmadığı bilinmektedir. Gaye, en ufak bir mescidi bile yapmanın faziletini anlatmaktadır. Bazı alimler bu ifadeyi zahirine göre yorumlayarak: Hadisin manası şudur, demişlerdir; Bir mescidi genişletmek ihtiyacı duyulduğu zaman, yapılacak ilave, bir kuş yuvası kadar bile olsa, anlatılan sevabı kazandırır. Yahut bir cemaat, ortaklaşa bir mescid inşa ederler de, katkıda bulunanların yardım hissesi, bir kuş yuvası tutarında bile olsa, hadiste bildirilen sevabı kazandırır. Bazıları; Mescid ile, bilinen mana kasdedildigi takdirde anlatılan yorumlara ihtiyaç duyulur. Lakin, mescid kelimesi ile secde yeri kasdedilirse, Bahsi geçen yorumlara ihtiyaç duyulmaz, demişlerdir. Tuhfetu'l-Ahvezi yazarı; Mescid ile, secde yeri değil de binanın murad olduğu bazı rivayetlerden açıkça anlaşılıyor. Mesela Ümmü Habibe'nin hadisinde; ''Kim Allah rızası için bir ev yaparsa ... '' buyurulmuştur. Ömer (r.a.)'in (735) nolu) hadisinde: ''Kim, içinde Allah isminin anıldığı bir mescid yaparsa... '' buyurulmuştur, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 739,
			"arabicnumber": 739,
			"text": "Enes bin Malik (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve 5ellem) şöyle buyurdu, demiştir: «İnsanlar, mescidleri (yapmak) ile birbirlerine karşı öğünüp iftihar etmedikçe kıyamet kopmayacaktır.» Diğer tahric: Ebu Davud ve Ahmed b. Hanbel AÇIKLAMA : Nesai de bunu, şu mealdeki bir lafızIa rivayet etmiştir; ''İnsanların mescidleri yapmak ile birbirlerine karşı öğünüp, iftihar etmeleri, kıyametin alametlerindendir.\" EI-Menhel yazarı: İnsanların öğünüp iftihar etmeleri, örneğin şöyle olabilir: Benim mescidim, seninkinden daha yüksektir veya daha süslüdür veya daha güzeldir veya daha geniştir ... Bunu söylerken kişi riya, gösteriş ve iftihar niyetini taşır. Hadis, mescidlerin yapımı ile iftihar etmenin kıyametin alametlerinden olduğuna delalet eder, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 740,
			"arabicnumber": 740,
			"text": "İbn-i Abbas (r.a.)'dan rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve 5ellem) şöyie buyurmuştur : «Yahudiler havralarını yükselttikleri ve hristiyanlar kiliselerini yükselttikleri gibi sizlerin de benden sonra mescidlerinizi yükselteceğinizi biliyorum.» Not: Zevaid'de: İsnadı zayıftır. Çünkü senedde Cubare bin El-Muğalis bulunuyor ki o çok yalancıdır. Ebu Davud da bu hadisi başka bir ifade ile ve kendi senediyle İbn-i Abbas (r.a.)'den merfu' olarak rivayet etmiştir, denilmiştir. AÇIKLAMA : Notta belirtildiği gibi Ebu Davud da bu hadisi ibn-i Abbas (r.a.)'den şu lafızla rivayet etmiştir: \"Ben mescidlerin teşyidi ile emrolunmadım. İbn-i Abbas dedi ki: Yahudiler ve hristiyanlar (mabedlerinil yaldızla süs!edikleri gibi sizler de muhakkak süsleyeceksiniz.'' Teşyid: Müellif bu bab'ın başlığında ve Ebu Davud da ibn-i Abbas (r.a.)'in hadisinde bu kelimeyi kulIanmışlardır EI-Menhel yazarının el-Bağavi'den naklen beyan ettiğine göre, mescidlerin teşyidin'den maksad, onları yüksek yapmaktır Teşyid'in sözlük manası, binayı yükseltmek, sağlam yapmak, inşaatında alçı ve kireç gibi malzemeleri kullanmak demektir. Ebu Davud'un rivayet ettiği İbn-i Abbas (r.a.)'in hadisinde: \"Yahudiler ve hristiyanlar ... '' parçası mevkuf yani İbn-i Abbas'ın sözü olarak geçmektedir. İbn-i Hibban'ın rivayeti de böyledir. Bununla beraber merfu' hükmündedir. Çünkü bu gibi sözler, re'ye dayalı olamaz. Zuhrufe: Ebu Davud'un rivayetinde geçen fiilin masdarı olan bu kelimenin asıl manası süslemektir. Zuhruf: Kelimesi ise aslında altın demektir Bilahere altınla yapılan her türlü süslemeye denilmiştir. Nihaye'nin heyanına göre Zuhruf', altınla yapılan nakışlar ve resimlerdir. EI-Menhel yazarı, hadis'in açıklaması ile ilgili olarak aşağıdaki ma'lumatı vermiştir: Yahudiler ve hristiyanlar, kutsal kitabIarını tahrif ederek, bunlarla amel etmeyi bırakınca, mabedlerini altınla süslemeye girişmişlerdir. Hadis ile sanki şöyle uyarı yapılıyor: 'Sizler, amelde ihlası bıraktığınız ve mescidleri yüksek ve süslü yapmakla öğünerek birbirinize karşı iftihar ettiğiniz zaman, sizin haliniz yahudi ve hristiyanların haline dönecektir.' Mescidleri, ilk olarak sahabe devrinin sonlarında el-Velid bin Abdulmelik bin Mervan süslemiş ve ilim ehlinin çoğu, fitne korkusuyla, bunun karşısında susmuştur. el-Ayni: 'İbn-i Abbas (r.a.)'in hadisini delil gösteren arkadaşlarımız; Mescidleri süslemek mekruhtur. Hele vakıf malından masraf yaparak süslemek, caiz değildir. Bu masraf, harcama yapan mütevelli veya başkasından tanzim edilir, demişlerdir. Kişi, kendi malından süslemeyi yapınca niçin kerahet var? diye bir soru akla gelebilir. Bunun sebebi, ya namaz kılan kişinin süslemeye bakarak meşgul olmasıdır ya da parayı yersiz harcamasıdır,' demiştir. İbn-i Reslan: Bu hadis, açık bir mu'cizedir. Zira Nebi s.a.v., kendisinden sonra meydana gelecek olan durumu haber vermiştir Mescidleri süslemek ve bunu iftihar vesilesi yapmak, bugün Mısır, Şam ve Kudüs'te devlet adamları arasında yaygın bir hal almıştır. Buradaki devlet adamları, halkın malını cebren alarak mescidleri ve okulları modern bir şekilde yapmaktadırlar Allah'tan selamet ve afiyet dileriz, demiştir. Eş-Şevkani: Hadis, mescidlerin yüksek ve süslü yapılmasının bid'at olduğuna delalet eder Ebu Hanife'nin buna ruhsat verdiği rivayet olunmuştur, demiştir. el- Bedr bin el-Münir: Halkın evlerini yüksek ve süslü yapınca mescidleri de böyle yapmaları münasiptir. Ta ki mescidler hakir görünmekten korunsun, demiştir Mescidleri yüksek ve süslü yapmayı caiz görenlerin dayanağı, Selef'in böyle yapanlar karşısında susmasıdır. Bunlara göre bid'at-ı hasene sayılır, mescidlere rağbet edilmesini sağlar. Süslemenin, Nebi (s.a.v.)'in emrinden olmadığına, kıyametin alametlerinden sayıldığına ve yasaklanan iffihar çeşidinden olduğuna delalet eden hadisler müvacehesinde anılan dayanağın tutarsızlığı aşikardır Selef'in susması, kabul alameti sayılamaz. Çünkü yukarıda anlatıldığı gibi bu iş, devlet adamlarından başlamıştır. Selef, bir fitne çıkmasın diye susmayı tercih etmiştir. el- Hafız, el-Fetih'de şöyle demiştir: 'Bazı alimler, mescidleri yüksek ve süslü yapmaya ruhsat vermişlerdir\" Ebu Hanife de: Bu iş, mescidlere ta'zim maksadıyla ve hazineden harcama yapmamak şartıyla caizdir, demiştir. Burada bir kaç önemli nokta vardır: 1. Mescidleri süslemek, namaz kılanların kalbini meşgul edecek durumda ise bunun mekruhluğuna alimler ittifak etmişlerdir. 2. Süslemek; övünmek, iftihar etmek, riyakarlık ve gösteriş için ise yine mekruhtur. Hatta değil süslemek, mescidleri böyle bozuk niyetlerle inşa etmek de mekruhtur. 3. Sağlam olsun diye mescid inşaatında alçı, kireç ve benzeri malzemeleri kullanmak mekruh değildir. Bunun delili Osman (r.a.)'ın halife iken Medine'deki Mescid-i Nebevi'yi yıktınp taş ve kireçle inşa etmiş olmasıdır. İbn-i Abbas (r.a.)'ın: \" ... Mescidleri süsleyeceksiniz.'' sözü, süslemenin yasaklığına delil değildir, çünkü mevkuftur. Hükmen merfu' olduğu kabul edilse şöyle yorumlanır: Bundan maksad, namaz kılan kişiyi meşgul eden süslemedir. Veya riya ve gösteriş için yapılan süslemedir. 4. Halktan zorla para alıp mescid yapmak haramdır. 5. Mütevelli ve benzeri kişilerin vakıf malından harcama yaparak, mescidi süslemeleridir. Bu da haramdır. Hiç bir alim, buna ruhsat vermemiştir. Abdullah bin Zübeyr (r.a.), Ka'be'yi yeniden yaparken eskisinden daha fazla yükselterek muhkem yapmıştır. Kendisine muhalefet edenlerin elinde hiç bir delil yoktur. Bütün itirazları Ka'be'nin eskisinden fazla yükseltilmesinden ibaretti. Nitekim İbn-i Zübeyr (r.a.) Kabe'yi yıkarak duvarlarını yenilemek istediği zaman İbn-i Abbas (r.a.) Ka'be duvarlarından eğilmiş olan yerleri tamir etmekle yetinilerek duvarlara bir ilave yapılmamasına taraftar olduğuna işaret ederek İbn-i Zübeyr (r.a.)'e: Senden sonra gelen bir emir'in senin yaptığını değiştirmiyeceğinden emin değilim, demiştir. Halife Harun er-Reşid'in veya el-Mehdi'nin yahut da el-Mansur'un Kabe'yi yıktırarak İbn-i Zübeyr (r.a.)'in yaptırdığı şekilde yenilemesini istedikleri ve İmam Malik'in onları uyararak: Kabe'nin meliklerin oyuncağı haline dönüşmesinden korkarım, demesi üzerine bu işten vaz geçtikleri rivayet olunmuştur. Yukarıdan beri verilen izahtan anlaşıldığı gibi Şevkani'nin ve başkasının bir ayırım yapmadan: mescidIeri yükseltmek ve süslemek yasaktır, sözleri yerinde değildir. HADİSİN FIKlH YÖNÜ : 1. Mescidleri yüksek yapmak meşru değildir. Bundaki tafsilat yukarıda görüldü. 2. Altın, gümüş ve benzeri şeylerle mescidleri süslemek caiz değildir. Bu iş yahudilerin ve hristiyanların işidir. Bu sebeple, bundan uzak durmak gerekir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 741,
			"arabicnumber": 741,
			"text": "Ömer bin el-Hattab (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve 5ellem) şöyle buyurmuştur: «Ameli bozuk bir hale gelen her kavim, mescidlerini yaldızla süslemeye kalkışırlar. (böyle olmayan bir kavim gelmemiştir.»\" Not: Zevaid'de: Bu hadisin isnadında Ebu İshak bulunur. Ki kendisi tedlis yapardı. Ravi Cübare de çok yalancıdır, denmiştir. AÇIKLAMA : Sindi: Hadisin manasının şöyle olduğu umulur: Her kavmin ameli bozuk bir hale gelince. yani bütün önem ve ğayretleri yüksek binalar yapmak ve süslemek olunsa. bu hal onları mescidleri de altın yaldızı ile süslemeye sürükleyecektir. Çünkü evleri yüksek, mamur ve nakışlı iken mescidlerinin böyle olmamasından hoşlanmıyacaklardır, demiştir. Şu halde bir kavmin mescidlerinin yaldızlarla süslenmiş olması, o kavmin hayrına alamet degil, bilakis amellerinin bozulduğuna bir belirtidir. Bunun için mescidleri altın, gümüş ve benzeri maddelerle süslemekten sakınmak gerekir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 742,
			"arabicnumber": 742,
			"text": "Enes bin Malik (r.a.)'den rivayet edildiğine göre. şöyle demiştir : Nebi (Sallallahu Aleyhi ve Sellem)'in Medine'deki mescidinin yeri, Beni Neccar kabilesine ait idi. Orada hurma ağaçları ve müşriklerin kabirleri bulunuyordu. Nebi (Sallallahu Aleyhi ve Sellem), o kabileye : «Bu yeri para karşılığında bana veriniz.» buyurdu. Onlar da: Bu yer için kat'iyyen para almayacağız, dediler. Enes (r.a.), demiştir ki: Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem), orada mescid yapmaya başladı. Sahabiler de Ona (malzeme) veriyorlardı. Ve Nebi (Sallallahu Aleyhi ve Sellem) şöyle diyordu: «Bilmiş olun ki. gerçek hayat ahiret hayatıdır. (Allah'ım) Ensar ve Muhacirlere mağfiret eyle.- Enes (r.a.) demiştir ki: Nebi (Sallallahu Aleyhi ve Sellem), mescid yapmadan önce namazı vaktine eriştiği yerde kılardı..\" Diğer tahric: Buhari, Müslim, Ebu Davud ve Nesai AÇIKLAMA : Buhari, Müslim ve Ebu Davud'un riva,yeti daha uzundur. Beni Neccar kabilesi, Ensardan büyük bir kabiledir. Neccar, o kabilenin babasıdır. Adı Tey mü'l-Lat'tır. Ona Neccar (marangoz) lakabının verilmesinin sebebi; söylendiğine göre keser ile sünnet olmuş olmasıdır. Bu kabile, Nebi (s.a.v.)'in dedesi Abdü'l-Muttalib'in, dayıları idi. Nebi (s.a.v.), bu akrabalık dolayısıyla onları çağırtarak, kendilerine ait, olan mescid yerini satın almak istemiştir, Hadisin zahirine göre Beni Neccar kabilesİ, arsa bedelini almamışlardır. Lakin Zühri'den rivayet edildiğine göre arsa, bu kabileye mensub Amr'ın Sehl ve Süheyl adlı iki oğluna aitmiş. Yetim olan bu çocuklar, Ebu Ümame Es'ad bin . Zurare'nin yanında yetiştiriliyorlarmış. Hicretle Nebi (s.a.v.), Medine'ye şeref verdiği gun devesi bu arsada çökünce: ''İnşaallah menzilimiz burasıdır.'' buyurmuş; sonra yetimleri çağırtarak, arsalarında mescid yaptırmak üzere arsa. değerini bildirmelerini istemiş; Yetimler: Ya Resulallah! Parayla değil de, onu sana. hibe ederiz, demişler. Fakat Nebi (s.a.v.), hibe olarak kabul etmekten imtina etmiş ve nihayet onlardan satın aldıktan sonra orada mescid yaptırmıştır. El-Vakıdi: Nebi (s.a.v.) mescid arsasını Afra' oğullarından on dinar altın mukabılinde satın almış ve bu parayı Ebu Bekir (r.a.) ödemiştir, demiştir. Bu rivayete göre Es'ad bin Züraee, Bahsi geçen arsa yerine, şahsına ait bir hurma bahçesini yetimlere vermiştir. Bir başka rivayete göre Ebu Eyyub (r.a.): Bu yer, iki yetimindir ve ben onları razı ederim, demiş ve onları razı etmiştir. El-Menhel yazarı, bu rivayetleri naklettikten sonra: Rivayetlerin arası şöyle bulunur, demiştir: '' Beni Neccar kabilesi, arsa bedelini istemediklerini söyleyince Nebi (s.a.v.), arsanın asıl sahiplerinin kim olduğunu sormuş, onlar da Bahsi geçen iki yetimi gösterince Nebi (s.a.v.), onlardan satın almıştır. Arsa bedeli ödenmek istendiğinde Ebu Bekir (r.a.), Es'ad bin Zürare (r.a.) ve Ebu Eyyub (r.a.), ortaklaşa bedeli ödemişlerdir. Bu yerde hurma ağaçları ve müşriklerin kabirlerinin bulunduğu belirtilmiştir. Buhari, Ebu Davud ve Müslim'in rivayetlerinde, hurma ağaçlarının Nebi (s.a.v.)'in emriyle kesildiği ve müşriklerin kabirlerinin nakledildiği bildirilmiştir. Müşriklerin kabirleri açılarak, içindeki kemikler ve ceset kalıntıları çıkarılmıştır. Müşriklere bir hürmet göstermek söz konusu olmadığı için kabirlerinin açılması emredilmiştir Kabir, içinde gömülü bulunana mahsustur Nebi (s.a.v.) nasıl müşriklerin kabristanını satın almış ve kabirlerini açtırmıştır? şeklinde bir soru akla gelebilir. Cevabı şudur: Kabristanın satın alınamaması ve ceset naklinin yasaklığı müslümanların kabirlerine mahsustur. Kafirlerin kabristanı için böyle bir hüküm yoktur. Şöyle cevab vermek de mümkündür: Zaruret ve ihtiyaç, müşriklerin kabirlerini açmayı gerektirmiştir. Bu sebeple açtırılmıştır. Fakat ilk cevab, daha kuvvetlidir. Kafirlerin kabirlerini açtırıp, yerine mescidlerin yapılmasını caiz gören alimlerin delillerinden birisi bu hadistir.\" MÜSLÜMANLARIN KABRİSTANINDA MESCİD YAPMAK CAİZ MİDjR? İslam alimlerinin bir kısmının bu husustaki görüşleri, el-Menhel'de şöyle anlatılmıştır: 1- Hanefiler'den el- Ayni: Arkadaşlarımız mescid yıkılıp yerle bir olduğu ve çevresinde cemaat bulunmadığı zaman kabristan da çok eskiyip ne ceset izi, ne de mezar ismi kalmadığı zaman, bunlar, sahiplerinin mülküne dönüşmüş olur. Sahibinin malına dönüşünce, mal sahibi mescid yerine ev ve kabristan yerine mescid veya başka şey yaptırabilir. Eğer mescid yeri ve kabristanın sahibi yoksa, bu yerler hazineye intikal eder, demiştir 2- Şafii alimlerine göre, kabristan olarak vakfedilmiş olan sahada ölü gömülü olsun olmasın, yer altında ve yer üstünde bina yapmak haramdır. Hakim, bu gibi yerlerde yapılan bütün binaları yıktırmakla mükelleftir. Çünkü bina yapımı, kabristan gayesine ters düşer, halk'a sıkıntı verir. Yapılan bina ev olsun, mescid olsun başka şey olsun hiç fark etmez. Mülkiyeti şahsa ait özel kabristanın ölü gömülmemiş olan kısımlarında bina yapmak ise mekruhtur. 3- Hanbeliler'e göre, ölüler tamamen çürüdükten sonra kabristanda ekin ekmek ve üzerine bina yapmak caizdir. Aksi takdirde caiz değildir. 4- Malikiler'den ibnü'l-Kasım: Müslümanların kabristanının izi kalmadığı zaman orada bir mescid yapılmasında beis görmem. Çünkü kabristan müslümanların, ölülerini defnetmek için vakfettikleri bir yerdir. Hiç kimsenin malı olamaz. Bu yerde mezar izi kalmayıp bundan böyle ölüleri oraya defnetmek ihtiyacı kalmayınca bu yeri mescide çevirmek caizdir. Çünkü mescid de müslümanların vakıf mallarından birisidir. Kimse mescide sahip çıkamaz, demiştir. Beyhaki'nin rivayetine göre Mescid-i Nebevi yapılırken kıblesi Mescid-i Aksa'ya yönelik olarak yapılmıştı. Mescid, kare şeklindeydi. Uzunluğu ve genişliği yüzer zira: idi Bir rivayete göre önce yetmiş zira' idi. Hayber fethinden sonra bir misli daha. büyütüldü Mescidin üç kapısı vardı Bir kapı mescidin sonunda idi. Atike kapısına Babu'r-Rahme denilmiştir. Nebi (s.a.v.)'in mescide girdiği kapıya bu gün Al-i Osman denilir. Bu iki kapı kıblenin Ka'be yönüne değiştirilmesinden sonra da aynen kalmıştır. Fakat mescidin sonundaki kapı kapatılarak hizasında başka bir kapı açılmıştır. Bir rivayete göre: Cebrail (a.s.) gelerek mescid yapma emrini tebliğ edince Nebi (s.a.v.), yapılacak mcscidin yüksekliğini sormuş, Cebrail (a.s.) da: Yedi zira'; bir rivayete göre de : Beş zira' olsun, demiştir.\" Buhari ve Ebu Davud'un rivayetinde sahabilerin. mescid inşaatı için taş taşıdıkları belirtilmiştir. Rivayete göre duvarın üç zira'lık kısmı taş ile yapılmış, ondan sonra ham kerpiç ile tamamlanmıştır. Ümmü Seleme (r.anha)'dan rivayet edildiğine göre: Nebi (s.a.v.) ashabıyla beraber mescid inşaatında çalışıyordu. Her sahabi birer kerpiç taşıyordu. Amınar bin Yasir ise, birisi kendisi için diğeri de Nebi (s.a.v.) için olmak üzere ikişer kerpiç taşıyordu. Nebi (s.a.v.) bir ara kalkıp Ammar (r.a.)'ın sırtına mübarek elini sürdü ve: ''Ey Sümeyye oğlu! Senin için iki sevab vardır. Halk için bir sevab. Dünya'dan son rızkın bir yudum süttür. Asi taife seni öldürecektir.\" buyurmuştur. İmam Ahmed bin Hanbel'in Ebu Hureyre (r.a.)'den rivayet ettigine göre: ''Nebi (s.a.v.) de sahabilerle beraber kerpiç taşıyormuş. Ebu Hureyre (r.a.) diyor ki: Bir ara Nebi (s.a.v.) bir kerpici mübarek karnı üzerine koyarak taşıyordu. Kerpiçin Ona ağır geldiğini sandım da onu karşıladım ve: Bana ver Ya Resulallah! dedim. Resulullah (s.a.v.) : ''Başka bir kerpiç al Ya Eba Hureyre. Çünkü ahiret hayatından başka hiç bir hayat yoktur.\" buyurdu. Ebu Hureyre (r.a.)'in bu hadisi, ikinci mescid yapımına aittir. Çünkü ilk mescid inşaatında, Ebu Hureyre (r.a.) bulunmamıştır. Bilindiği gibi Ebu Hureyre (r.a.)'in Nebi (s.a.v.)'e gelerek müslümanlıgı kabul etmesi Hayber yılına rastlar. Dolayısıyla Ebu Hureyre (r.a.) hadisiyle Ümmü SeIeme (r.anha) hadisi arasında bir çelişki yoktur. Hadisin: ''Nebi (s.a.v.) mescid yapıyordu. Sahabiler de Ona (malzeme) veriyorlardı.\" ifadesinin zahirine göre Nebi (s.a.v.), bizzat mescid duvarlarının yapımında çalışmıştır. Mescid'in duvarları kerpiçten yapılmış, damı hurma dallarıyla örtülmüş, direkleri de hurma kütüğündenmiş. Ömer (r.a.) zamanında yapılan tamirde, mescide bir ilave yapılmamış, Osman (r.a.) hilafeti zamanında mescid büyütülmüş, duvarları taş ve kireçle yapılmış, direkleri taştan yapılmış ve tavanı hint çınarı ve hint ardıcı denilen ve Hindistan'da yetişen, abanoz'a benzeyen sert agaçlarla örtülmüştür. Mescidin bu durumunu belirten İbn-i Ömer (r.a.)'in hadisi, Buhari ve Ebu Davud tarafından rivayet edilmiştir, Nebi (s.a.v.): ''Bilmiş olunuz ki, gerçekten hayat... '' parçasını mescid inşaatında çalışmayı kolaylaştırmak ve çalışma karşılığında Sahabiler için Allah tarafından hazırlanmış olan uhrevi mükafatı müjdelemek üzere buyurmuştur. Müslim ve Ebu Davud'un rivayetinde Nebi (s.a.v.) ve Sahabiler çalışırken şöyle derlerdi: ''Allahım! Ahiret hayrından başka hiç bir hayır yoldur. Sen, Ensar ile Muhacirlere yardım eyIe.'' Buhari'nin rivayetinde ikinci mısra, sünenimizdeki Iafızlarla geçmiştir. Nebi (s.a.v.) için şiir söylemek haram kılınmıştır. Burada Nebi (s.a.v.) şiir söylemiş olmuyor mu? denilemez. Çünkü bu secili bir sözdür, şiir değildir. Zira vezni yoktur. Vezinli olduğu kabul edilse bile bu inşa değil inşad'dır. Yani şiir icadı değil, başkası tarafından söylenmiş olan bir şiiri nakletmektir. Nitekim Buhari'nin bir rivayetinde; Bir müslüman tarafından söylenmiş olan bu şiiri Nebi (s.a.v.) okudu, denilmiştir. Nebi (s.a.v.)'e yasak kılınan şey, başkasının şiirini okumak değil, şiir inşa etmektir. Kaldı ki alimler: Şiir, vezinle söylenmesi kasdedilmiş olan söz dizisidir. Eğer kasıd olmaksızın vezinli bir cümle dil üzerinde cereyan edecek olursa, buna şiir denmez, diye ittifak etmişlerdir. Bunun için Nebi (s.a.v.) tarafından buyurulmuş olan şiir şeklindeki hadisleri buna hamledilmiştir. Örneğin; ''Ben ancak Nebiim. Hiç yalan değildir. Ben Abdülmuttalibin oğluyum.'' HADİSİN FIKIH YÖNÜ : 1- Namazı, vakti gelince her hangi bir yerde kılmak meşrudur. 2- İhtiyaç halinde bir an önce mescidleri inşa etmek matlubtur. 3- Alış - veriş meşrudur. Başkasının malını gasbetmek yasaktır. 4- Allah rızası için teberru yapmak meşrudur. 5- Müşriklerin eski kabirlerini açıp nakletmek ve kabristanlarını satmak caizdir. 6- İhtiyaç halinde meyveli agaçları kesmek caizdir. 7- Müşriklerin kabirlerini açıp içindekilerini çıkardıktan sonra orada namaz kılmak caizdir. Hattabi: Müşriklerin kabirleri açılıp toprağı nakledildiği ve orada toprağa karışacak bir necaset bulunmadığı zaman o yerde namaz kılmak caizdir. Kabristanda namaz kılmanın yasaklığı toprağına ölülerin kanları ve irinIeri karıştığı zamana mahsustur. Kabir eseri ve ismi kalmayınca, o yerin hükmü temizliğe dönüşür, demiştir. 8 - Müşriklerin kabirleri yerinde mescid yapmak cılizdir. Hattabi: Hayatta iken kanı muhterem olmayan kişinin, ölümünden sonra kemiklerinin de muhterem olmadığına bu hadis delildir, demiştir. 9- Ağır işlerde çalışırken teşvik için şiir söylemek caizdir. 10- Devamlı hayır, ancak ahiret hayrıdır. Müslümanlara AIlah'ın yardımını dilemek meşrudur. 11- Hadis, Nebi (s.a.v.)'in tevazuunu ve ahlakının üstünlüğünü ifade eder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 743,
			"arabicnumber": 743,
			"text": "Osman bin Ebi'l-As (r.a.)'den rivayet edildiğine göre : Resulullah (Sallallahu Aleyhi ve 5ellem), Taif halkının putlarının yerini Taif mescidi kılmasını kendisine emretmiştir.\" Diğer tahric: Ebu Davud ve Hakim AÇIKLAMA : Taif, Mekke-i Mükerreme'nin doğusunda, iki ve ya üç' konak mesafede bir şehirdir. Tağiye: Onların Allah'a ortak koştukları putlar ve benzeri şeylerdir. Ebu Davud'un süneninde 'Tavağiyet' diye geçer. Bu kelime 'Tağut'un çoğuludur. Tağüt: Şeytan ve put anlamında kullanılır. Burada put anlamında kullanılmıştır. Taif halkının putlarının bulunduğu yeri mescid haline getirme emrinden dolayıdır ki Müslümanlar fethettikleri memleketlerdeki kilise ve havraları mescidlere ve medreselere çevire gelmişlerdir. Bunun amacı, küfrü çiğnemek, izini silmek ve kafirlere eziyet etmektir. Zira onlar bu yerlerde Allah'tan başkasına taparlardı HADİSİN FIKIH YÖNÜ : Kafirlerin diyarı İslamın eline geçtiği zaman onların ibadet yerlerini mescidlere çevirmek suretiyle küfür alametlerini yok etmek matlubtur. Bir çok sahabi böyle yapmıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 744,
			"arabicnumber": 744,
			"text": "(Abdullah) İbn-i Ömer (r.a.)'den rivayet edildiğine göre, içine insan terslerinin atıldığı bahçeler(de namaz kılınması) hükmü kendisine sorulmuş ve şöyle cevap vermiştir: «O bahçeler, defalarca sulandığı zaman içinde namaz kılabilirsiniz.» İbn-i Ömer (r.a.), bu hadisi Nebi (Sallallahu Aleyhi ve Sellem)'e ref ederek söylemiştir. Not: Zevaid'de: İsnadı zayıftır. Çünkü onda Muhammed bin İshak bulunur. Kendisi tediis yapardı. Bunu da an'ane ile rivayet etmiştir, diye bilgi verilmiştir . AÇIKLAMA : Sindi: \"Defalarca sulandığı..'' ifadesinden maksad, bahçeye atılmış olan pislik eseri kalmayacak kadar üzerinden suyun bol bol geçmiş olmasıdır. Ölçü budur. Yoksa şu kadar defa sulamak gerekir, diye bir şey söylenemez, demiştir. Hiytan: Haitin çoğuludur. Hait. duvara denir. Bir de bahçe ve bostana denilir. Nihaye sahibi: Hait. etrafı duvarla çevrili bahçeye denir, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 745,
			"arabicnumber": 745,
			"text": "Ebu Said-i Hudri (r.a.)'den rivayet edildiğine güre; Resulullah (Sallallahu Aleyhi ve 5ellem) şöyle buyurdu demiştir: «Kabristan ve hamamdan başka yer yüzünün hepsi mesciddir.» Diğer tahric: Ebu Davüd, Şafii, Ahmed, İbn-i Hibban, İbn-i Huzeyme ve Tirmizi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 746,
			"arabicnumber": 746,
			"text": "(Abdullah) bin Ömer (r.a.)'den rivayet edildiğine göre şöyle demiştir : Resulullah (Sallallahu Aleyhi ve 5ellem) yedi yerde namaz kılmaktan nehiy buyurmuştur: «Çöplükte, mezbahada, kabristanda, yolun ortasında, hamamda, deve yataklarında ve Kabe (i Muazzama) damı üzerinde.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 747,
			"arabicnumber": 747,
			"text": "Ömer bin el-Hattab (r.a.)'den rivay«t edildiği» göre şöyle demiştir: Resulullah (Sallallahu Aleyhi ve 5ellem) buyurdular ki: «Yedi yer var. Oralarda namaz kılmak caiz değildir: Beytullahın üstü. kabristan, çöplük, mezbaha, hamam, deve yatağı ve cadde.» AÇIKLAMA : Bu iki hadiste kabristan ve hamamdan başka, namaz kılınmasının yasaklandığı beş yer daha zikredilmiştir. Bu yerlerden deve yataklarında namaz kılmakla ilgili şer'i hükmün özeti 497 nolu hadisin açıklamasında verilmişti. Mescidler kitabının 12. babında daha geniş izah yapılacaktır. İnşaallah! Sindi'in beyanına göre çöplükte ve mezbahada namaz kılmanın yasaklanmasının sebebi, bu yerlerin pisliği, kirliliği ve necasetten hali olmamasıdır. Yol üzerinde namaz kılmanın yasaklanmasının sebebine gelince; oradan geçenler namaza duranın dikkatini çeker. Diğer taraftan onun önünden geçenler olabilir. Ayrıca orada namaz kılmakla yolda geçenlere eziyet ve yolda bir tıkanıklığa sebebiyet verebilir. Kabe damı üzerinde namaz kılmak, bir nevi saygısızlık olduğu için bundan nehy edilmiştir. El-Menhel yazarı: \"Namaz kılmanın yasaklandığı yerler çoktur. Şöyle ki : Aşağıda yazılı yerlerde namaz kılmanın yasaklığına dair hadisler vardır: Hamam ve kabristanda namaz kılmanın yasaklığı, Ebu Said-i Hudri (r.a.)'in hadisiyle ve başka hadislerle sabittir. Çöplük, mezbaha, yolun ortası, deve yatakları ve Ka'be'nin damı üzerinde namaz kılmanın yasaklığı, İbn-i Mace ve Tirmizi'nin İbn-i Ömer (r.a.)'den rivayet ettikleri hadisten anlaşılıyor. TirmizI, bu hadisin isnadının pek kuvvetli olmadığını söylemiştir. Kilisede, havrada, kabre karşı, ğusülhane duvarına karşı, resimlere karşı, yakılan ateşe karşı, uyuyana karşı durup namaz kılmak da mekruhtur.'' diyerek bu yerlerde namaz kılmanın nehyine ait hadisleri nakletmektedir. Bunları buraya aktarmak bir hayli uzun süreceği için bundan ferağat ettik. El-Menhel yazarı daha sonra Şevkani'nin şöyle dediğini nakleder: 'Anılan yerlerin hepsinde veya ekserisinde kılınan namazın 8ıhhatına hükmedenler; ''Nerede namaz vakti sana yetişirse orada namaz kıl..'' hadisine ve benzeri hadislere dayanmışlardır. Halbuki kabristan, hamam ve benzeri yerlerde namaz kılmayı yasaklayan hadisler hususi oldukları için umumi hadislerden istisna edilmeleri gerekir.' Yukarıdaki iki hadiste nanıaz kılmanın yasak olduğu yerlerden kabristan ve hamamda kılınan namaz hakkındaki İslam alimlerinin görüşlerini 745 nolu Ebu Said-i Hudri (r.a.)'in hadisinin açıklaması bahsinde anlatmıştık. Diğer yerlerde kılınan namazın şer'i hükmü hakkında el•Fıkh Ala'I-Mezhahibi'l-Erbaa'nın -dört mezhebin fıkıh kitabı- ''Namazın mekruhları\" bahsinde verdiği malumatı özlü olarak nakledelim: I - Kabe üzerinde kılınan namazın hükmÜ: 1- Hanefiler'e göre Ka'be'nin içinde ve damı üzerinde, farz olsun nafile olsun kılınan namaz sahihtir. Ancak damı üzerinde kılmak mekruhtur. Çünkü saygısızlık olur. 2- Şafiiler'e göre Ka'be içinde kılınan farz ve nafile namaz sahihtir. Ancak kapısı açıkken Ka'be içinde kapıya doğru durarak kılınan namaz sahih değildir. Ka'be'nin damı üzerinde namaz kilmak da sahihtir. Şu şartla: Namaza duranın önünde insan ziraı ile 2/3 zira: boyunda bir sütrenin bulunması şarttır. 3- Malikiler'e göre Ka'be'nin üstünde kılınan farz namaz fasiddir. Ğayri müekkede nafile namaz sahihtir.- Sünnet-i müekkede hakkında eşit iki kavil vardır: Ka'be'nin içinde ise farz namaz kılmak kerahati şedide ile mekruhtur. Henüz vakit çıkmadan kılınan namazı iade etmek mendubtur. Sünnet•i müekkede de öyledir. Ancak iadesi istenmez. Nafile namazın Ka'be içinde kılınması ise mendubtur. 4- Hanbeliler'e göre Ka'be içinde kılınan farz namaz sahih değildir. Ka'be üstünde kılınsa hüküm aynıdır. Ancak Ka'be'nin damında tam kenar üzerinde dışa doğru dursa ve önünde Ka'be' den hiç bir şey kalmasa kılınan namaz sahihtir. Veya Ka'be'nin dışında durup içinde secde ederse sahihtir. Nafile ve adak namazın ise Ka'be'nin içinde ve dam'ı üzerinde kılınması sahihtir. Ancak tam kenarı üzerinde secde ederse sahih değildir. Çünkü bu takdirde Ka'be'ye doğru durmuş sayılmaz. II - Çöplükte, mezbahada, yolun ortasında. deve yataklarında necaset'ten emin olunsa dahi namaz kılmak, Hanefi ve Şafii mezhebIerine göre mekruhtur. Hanbeliler'e göre zaruret olmadıkça bu yerlerde kılınan namaz fasiddir. Ve burada namaza durmak haramdır. Ancak bu yerlere hapsedilmek gibi bir zaruret halinde namaz kılınabilir. Malikiler'e göre necasetten emin olunduğu takdirde çöplükte, mezbahada ve caddede namaz kılmak, kerahetsiz olarak caizdir. Necaset'ten emin olunmadığı zaman eğer necasetin bulunduğu muhakkak veya. kuvvetle muhtemelse kılınan namaz batıldır. Şayet zayıf bir ihtimal varsa, henüz vakit çıkmamışken namaz iade edilir. Ancak mescidin darlığı sebebiyle yol üzerinde namaz kılınıp da yerin temizliğinden şüphe edilse bile, namazı iadesi gerekmez. Deve yataklarında ise necaset'ten emin olunduğu takdirde namaz kılmak mekruhtur. Vakit çıkmadan namaz iade edilmelidir. Bu hüküm, su çevresindeki deve yataklarına mahsustur. Develerin geceledikleri ve yine gündüz sıcağında kaldıkları yataklarda necaset'ten emin olunduğu zaman namaz kılmak, mutemed kavle göre mekruh değildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 748,
			"arabicnumber": 748,
			"text": "Ahdullah b. Ömer (r.a.)'den rivayet edildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu, demiştir : «Mescidde şıi şeyler yapılmamalıdır: Mescid yol edinilemez, orada silah çekilip çıkarılamaz, orada yay'a kiriş bağlanıp salınamaz, orada ok atılamaz, içinden çiğ et geçirilemez, orada had olarak kimse dövülemez, orada hiç kimsenin kısas cezası tatbik edilemez, orası çarşı edinilemez.» Not: Ravi Zeyd bin Cebire'nin zayıflığı üzerinde, alimler ittifak ettikleri için ve İbn-i Abdi'l-Berr onun zayıflığına alimlerin icma' ettiklerini naklettiği için isnadın zayıflığı Zevaid de bildirilmiştir. AÇIKLAMA : Kütüb-i Sitte sahiplerinden yalnız İbn-i Mace'nin rivayet ettiği anlaşılan bu hadiste anılan işlerin mekruhluğu, bab'ın başlığından da anlaşılmaktadır. Hadisin baş kısmında geçen: ''Mescidde şu şeyler ... '' parçasını Camiü's-Sağir şarihi el-Azizi şöyle yorumlar: Yani mescidde şu şeyleri yapmak mekruhtur. Hatta temiz bir madde ile bile olsa mescidin kirletilmesine sebep olan her hareket haramdır. ''Mescid yol edinilemez.'' cümlesinden maksad, mescid'in iki veya daha fazla kapısı bulunduğu takdirde, bir kapı'dan girip diğer kapıdan çıkmak suretiyle bir yol gibi kullanılmamasıdır. \"' ... Orada yay'a kiriş ... '' cümlesinden maksad, orada yay ve kirişle meşgul olup kirişi bağlamak ve salmak suretiyle bunun iyi olup olmadığı denenmemelidir. Çünkü böyle denendiği takdirde ses çıkarır. Şayet namaz'a duran her hangi bir kimsenin dikkatini çekmeyecek olursa, bununla meşgul olmak mekruhtur. Eğer namazdakilerin namazlarını şaşırmalarına sebebiyet verirse bu hareket haram sayılır. Orada ok atılması hükmü de aynıdır. '' ... İçinden çiğ et geçirilemez.'' parçasına gelince; Eğer çiğ et'ten kan damlaması ve mescid döşemesinin necis edilmesi sanılmıyorsa çiğ et geçirmek mekruhtur. Sanılıyorsa yani kuvvetle muhtemelse bu davranış haramdır. Had olarak adam dövmenin ve kısas cezasını uygulamanın yapılmamasının nedeni izahtan varestedir. '' •.. Orası çarşı edinilemez.'' cümlesinden maksad, mescidde alış veriş yapılmamasıdır. MESCİD'DEN GEÇİŞ HAKKINDAKİ ALİMLERİN GÖRÜŞLERİ : 1- Hanefi mezhebine göre bir zaruret olmadıkça mescid'in bir kapısından girip, diğer kapısından çıkmak suretiyle orayı yol gibi kullanmak tahrimen mekruhtur. Eğer bir zaruret nedeniyle geçilirse caizdir. Zaruret yokken geçişi itiyat (alışkanlık) haline getiren kişi fasık olur. Ama günde bir iki defa geçmekle fasık olunmaz. Girerken i'tikafa niyet etmek, fasık sayılmaktan korur. Her gün oradan geçmek durumunda olan kişinin, günde bir defa Tahiyyetü'l-Mescid sünnetini kılması kafidir. 2- Şafii mezhebine göre temiz kişinin ve cünüb adamın mescidden geçmeleri, ihtiyaç olsun olmasın caizdir. Hayızlı kadının mescidi kirletmekten emin olduğu takdirde bile olsa mescidden geçmesi mekruhtur. Kirletmekten emin değilse geçmesi haramdır. 3- Hanbeliler'e göre temiz kişinin ve cünübün mescidden yol gibi geçmeleri mekruhtur. Hayızlı kadın ile lahusa kadının ihtiyaç olmadan geçmeleri, mescidi kirletmekten emin olunması şartı ile mekruhtur. İhtiyaç halinde hepsi için, kerahetsiz caizdir. Yolun kestirme oluşu, ihtiyaçtan sayılır. 4- Malikiler'e göre mescidden geçiş nadir ise caizdir. Eğer sık sık geçiliyorsa bakılır: Şayet mescid yapılmazdan önce orada yol bulunuyorduysa, sonradan yapılan mescid'den geçmek mekrun değildir. Aksi takdirde mekruhtur. Geçen kişi Tahiyyetü'l-Mescid namazını kılmakla muhatab değildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 749,
			"arabicnumber": 749,
			"text": "Amr bin Şuayb'ın dedesi (Abdullah bin Amr bin el-As) (r.a.)'dan rivayet edildiğine göre şöyle demiştir : Resulullah Sallallahu Aleyhi ve Sellem, mescidlerde satmaktan, satın almaktan ve karşılıklı şiirler okumaktan nehiy buyurmuştur. Diğer tahric: Tirmizi, Ebu Davud ve Nesai AÇIKLAMA : Tirmizi bu hadis konusu için açtığı bab ta rivayet etmiştir. Tirmizi bunu rivayet ettikten sonra şöyle der: AbduIlah bin Amr bin el-As (r.a.)'in hadisi hasendir. Amr'ın babası Şuayb, Muhammed bin Abdillah bin Amr bin el-As'ın oğludur. Buhari: Ben, Ahmed ve İshak'ın, Amr bin Şuayb (r.a.)'ın hadisini delil saydıklarını gördüm, demiştir. Muhammed: Şuayb bin Muhammed, Abdullah bin Amr'dan hadis dinlemiş, demiştir. İlim ehlinden bir cemaat, mescidde satış akdini yapmanın kerahetine hükmetmiştir. Ahmed ve İshak böyle hükmedenlerdendirler. Tabiilerden bazı ilim adamları, mescidde satış akdine ruhsat vermişlerdir. Nebi (s.a.v.)'den, mescidde şiir okumaya ruhsat verdiğine dair rivayet olunan hadis bir tane değildir.' Tirmizi'nin şerhi Tuhfetu'l-Ahvezi yazarı, hadisin açıklanıasıyla ilgili olarak şöyle der: \"Mescidde alış veriş yapmak, cumhur'a göre yasaktır. Hak olanı da budur. Alış-veriş'in mekruh olmadıgını söyleyenlerin elinde hiç bir delil yoktur. Bilakis bu babta rivayet edilen hadisler onların görüşünü reddeder. Şevkani, en-Neyl'de: 'Alimlerin cumhuru; Mescidde satış akdinin yapılmasına dair hadisteki nehiy kerahete hamledilir, demişlerdir. el-İraki: Alimler, mescidde yapılan satış akdinin geçersiz sayılamıyacağına icma' etmişler, demiştir. el-Maverdi de böyle demiştir. Biliyorsun ki; ayet veya hadiste mevcut nehiy, aslında haramIık içindir, diyenlere göre bir nehyin haramIıktan mekruhluğa döndürülebilmesi için, haramlık anlamına olmadığına dair bir alamete ihtiyaç vardır. Alimlerin yapılan akdin sıhhati üzerine icma' etmiş olmaları, akid yapmanın haramlığına mani değildir. Yani mescidde satış akdini yapmak haramdır, günahtır, bununla beraber fasid değildir, sıhhatlidir. O halde akdin sıhhati, nehyin mekruhluğuna yorumlanmasına karine ve alamet olamaz Şafii'nin bazı arkadaşları: Mescidde satış akdinin yapılması mekruh değildir, demişlerse de hadisler bu görüşü reddeder', demiştir.'' Ebu Davud da: \"Cuma namazından önce mesddde halka kurmak\" babında bu hadisi daha uzun bir metinle yine Abdulah bin Amr (r.a.)'den rivayet etmiştir. El-Menhel yazarı özetle şöyle der: ''Hadis, mescidde satış akdinin haramlığına delalet eder. Bu hususta mezheb alimlerinin görüşleri şöyledir: 1- Hanefi alimlerine göre mescidde alış - veriş işi yaygınlaştığı zaman mekruhtur. Nadiren yapıldığı takdirde mekruh değildir. 2- Şafiiler'e göre i'tikafta olmayan kişinin, mescidde herhangi bir şeyi satması veya satın alması mekruhtur. i'tikafta olan kişinin ihtiyaç duyduğu şeyleri satması ve alması caizdir. Diğerleri mekruhtur. 3- Malikiler'e göre satmak ve satın almak işi bağırarak yapılırsa haramdır. Çünkü bu takdirde, mescid pazar yerine çevrilmiş olur. Alçak sesle yapılan satış ve alış işlemleri mekrubtur. EI-Menhel yazarı: Bu üç mezheb aliminin ayrıntılı görüşlerini teyid eden her hangi bir delil yoktur, diyerel{ Hanbeliler'in şu görüşlerinin kuvvetli olduğunu söyler: 4- Hanbeliler, hadisin zahirini tutarak: Mescidde satın alma ve satmanın her çeşidi herkes için haramdır. İtikafta olanın, olmayan'ın;, ihtiyaç maddesi ile diğer maddenin ve satış işlerinin azlığı ve çOkfuğunun farkı yoktur, demişlerdir. Ahmed bin Hanbel: Şu mescidler Allah'ın evleridir. İçinde satış ve alış yapılamaz, demiştir. MESCİDLERDE ŞİİR OKUMAK : Mescidde şiir okumanın caiz olmadığı hadisten anlaşılıyor. Yasaklanan şiir, yersiz övgü veya yermeyi ihtiva eden yahut kibirlenmeyi ifade eden kısma yorumlanmıştır. Böyle yorumlanınca Buhari ve Müslim'in Said bin el-Müseyyeb'den rivayet ettikleri şu mealdeki hadise muhalif kalmaz: 'Ömer (r.a.), bir ara mescid'den geçerken (şair) Hassan (r.a.) şiir okuyordu. Ömer (r.a.) Ona biraz kulak verdi. Bunun üzerine Hassan (r.a.) Ona: Şu mescidde senden daha hayırlı olan Zat ResuluIlah (s.a.v.) bulunurken, ben şurada şiir okurdum, dedikten sonra Ebü Hureyre (r.a.)'e dönerek: 'Allah için söyle. ResuluIlah (s.a.v.)'i bana şöyle buyururken işittin mi: ''Ey Hassan! Benim yerime sen cevap ver. Allah'ım Hassan (r.a.)'ı Ruhü'l-Kudüs ile te'yid eyle''' diye sordu. Ebü Hureyre (r.a.) : Evet! dedi.'' . Kafirler, Nebi (s.a.v.) hakkında hiciv şiirlerini söylemişlerdi. ResuluIlah (s.a.v.), Hassan (r.a.)'in onlara cevap vermesini emir buyurmuştur. Hadis, anlatılan şekilde yorumlandıgı takdirde Ahmed bin Hanbel'in Cabir (r.a.)'den rivayet ettigi şu mealdeki hadise ters düşmez: 'Cabir (r.a.) demiştir ki : Ben yüz defa'dan fazla ResuluIlah (s.a.v.)'i mescidde gördüm. Ashabı şiir müzakeresini yaparlar ve cahiliyet devrine ait bazı şeyleri anlatırlardı. Zaınan zaman Nebi (s.a.v.) Onlarla beraber gülümserdi.' Bu ve benzeri badisler, müşrikleri yermeyi, Nebi (s.a.v.)'i sövmeyi, takva ve güzel ahlaka teşvik etmeyi ihtiva eden şiirlerin mescidde okunmasının caizliğine delalet eder. İbnü'l-Arabi: Din lehinde ve şer'i şerif'in ayakta tutulması ile ilgili şiirleri mescidde okumakta bir beis yoktur, demiştir. Nevevi de; Şiir, Nebi (s.a.v.)'i veya İslamiyet'i övücü mahiyette ise veya güzel ahlak, takva ve benzeri hayır çeşitleri hakkında ise mescidde okuması sakıncalı değildir. Ama bir müslüman'ı hiciv etmek, içkiyi övmek, kadınları anlatmak, bir zalimi övmek, yasak olan böbürlenmek gibi kötü şeyleri işleyen şiirleri mescidlerde okumak haramdır, demiştir. Alimlerin ekserisi mescitlerde şiir okumanın yasaklığına dair hadisler ile caiz olduğuna dair hadislerin arasını anlattığımız şekilde bulmuşlardır. Şunu da belirtelim ki okunması caiz görülen şiirlerin namaz kılmak Kur'an okumak ve zikir etmekle meşgul olanları şaşırtması halinde okunması caiz değildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 750,
			"arabicnumber": 750,
			"text": "Vasile bin el-Eska (r.a.)'den rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Çocuklarınızı, delilerinizi, satın almanızı, satışınızı, münakaşalarınızı, seslerinizi yükseltmeyi, had cezalarınızın infazını mescidlerinizden uzak tutun. Mescidlerinizin kapılarının yakınında abdest alma yerleri ittihaz ediniz. Ve Cum'a günlerinde mescidlerinizi buhurla tütsüleyiniz.» Not: Zevaid'de ravi el-Haris bin Nebha'nın zayıflığı üzerinde ittifak edildiği için isnadının zayıflığı bildirilmiştir. AÇIKLAMA : Hadis, küçük çocukları ve delileri mescidlere sokmanın yasaklığına delalet eder. MezhebIerin bu husustaki görüşleri şöyledir: 1- Hanefi mezhebine göre bunların, mescidi necis etmeleri kuvvetle zannedildiği zaman mescide sokulmaları tahrimen mekruhtur. Aksi takdirde tenzihen mekruhtur. 2- Şafiiler'e göre henüz mümeyyizlik çağına ermemiş olan küçük yaştaki çocukların ve delilerin mescidi kirletmelerinden, içindekilere zarar vermelerinden ve avret yerlerini açmalarından emin olunduğu takdirde mescide sokulmaları caizdir. Mümeyyiz olan çocuğun, mescidi oyuncak haline getirmemesi şartıyla mescide alınması caizdir. Aksi takdirde haramdır. 3- Malikiler'e göre çocuk ve deli'nin mescide alınması, mescidin necis edilmesine sebebiyet verdiği takdirde haramdır. Keza mescidi pislememekle beraber yaramazlık ederlerse, mescide alınmaları haramdır. Mescidi pislemiyecek ve haylazlık etmiyecek veya edince uyarıldığı zaman uslu duracak çocuğun mescide götürülmesi caizdir. 4- Hanbeliler'e göre okutmak gibi bir ihtiyaç için mümeyyiz olmayan çocuğu mescide sokmak mekruh değildir. İhtiyaç olmadan mescide girmesi mekruhtur. Deli'nin hükmü de böyledir. Mescidlerde alış veriş etmenin şer'i hükmü, bundan önceki hadiste açıklandı. Mescidlerde sesleri yükseltmenin yasaklığı bu hadisten anlaşılıyor. Bu da mekruhtur. MezhebIerin konu hakkındaki görüşleri şöyledir: 1- Hanefi mezhebine göre mescidde namaz'a duranları şaşırtacak veya orada uyuyanları uyandıracak şekilde yüksek sesle zikretmek mekruhtur. Böyle bir durum söz konusu değilse kerahet yoktur. Bilakis zikredenin; ibadete karşı hevesinin artması uykuyu defetmesi ve kalbini uyarması gibi bir fayda elde edildiği zaman yüksek sesle zikretmesi daha efdaldır. Zikrin dışındaki sözlere gelince; mübah olmayan sözleri yüksek sesle söylemek tahrimen mekruhtur. Mübah olan sözleri yüksek sesle söylemek, namaz kılan'ın şaşırmasına sebeb olursa mekruhtur. Aksi takdirde keraheti yoktur. Tabii kişi ibadet maksadıyla mescide girmiş ise kerahet yoktur. şayet sırf konuşmak için mescide gırmiş olursa mutlaka mekruhtur. 2- Şafiiler'e göre mescidde yüksek sesle zikretmek, eğer namaz kılan, ders veren, kıraatla meşgul olan veya mütalaa eden birisini şaşırtırsa mekruhtur. Keza uyandırılması sünnet olmayan bir uyuyanı uyandırırsa yine mekruhtur. Aksi takdirde mekruh değildir. Yüksek sesle konuşmaya gelince, hadis diye uydurulduğu hadis alimlerince belirlenmiş sözleri okumak gibi helal olmayan konuşma türünden ise, anılan kişilerden birisini şaşırtsın, şaşırtmasın mutlaka haramdır. Mübah konuşma cinsinden ise bahsi geçen şahısları şaşırtır'sa mekruhtur. Şaşırtmazsa mekruh değildir. 3- Malikiler'e göre zikir ve ihmle bile olsa mescidde sesi yükseltmek mekruhtur. Ancak dört halde hüküm değişir: --- (a)- Müderrisin öğrencilere sesini duyurmak için ihtiyaç duyduğu takdirde sesini yükseltmesinde kerahet yoktur. (b)- Namaz kılanı şaşırtırsa haramdır. (c)- Mekke veya Mina mescidinde yüksek sesle ''Lebbeyk'' duasını okumak mekruh değildir. (d)- Nöbet bekleyenin sesini yükseltmesi mekruh degildir. 4- Hanbeliler'e göre namazdakilerin şaşırmasına sebebiyet verilmemesi halinde mescidde yuksek sesle zikretmek mübahtır. Mübah türünden olan konuşmalar da böyledir. Bunlar namaz kılanları şaşırtırsa mekruhtur. Mübah olmayan sözlerle ses yükseltmek, kimseyi şaşırtsın, şaşırtmasın mutlaka mekruhtur. Had cezalarını mescidlerde infaz etmek ve kılıçları çekip çıkarmak da, gerek bu hadiste ve gerekse 748 nolu İbn-i Ömer (r.a.)'in hadisiyle yasaklanmıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 751,
			"arabicnumber": 751,
			"text": "İbn-i Ömer (r.a.)'den rivayet edildiğine göre şöyle söylemiştir : Biz, Resulullah Sallallahu Aleyhi ve Sellem hayattayken mescidde uyuyorduk. AÇIKLAMA 752’de",
			"grades": [
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 752,
			"arabicnumber": 752,
			"text": "Kays bin Tihfa (r.a.) Suffe ashabındandı. Kendisi şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem bize: «(Mescidden evime) Gidiniz.» buyurdu. Bunun üzerine biz, Aişe (r.anha)'nın odasına giderek yedik ve içtik. Sonra Resulullah Sallallahu Aleyhi ve Sellem bize: «İsterseniz burada uyuyabilirsiniz. Dilerseniz mescide gidebilirsiniz.» buyurdu. Kays bin Tıhfe: Biz de. Hayır mescide gideriz, dedik; demiştir.\" Tahric: İbn-i Ömer (r.a.)'in hadisini Buhari, Tirmizi ve Nesai de rivayet etmişlerdir. Buhari'nin rivayetinde İbn-i Ömer (r.a.)'in, genç ve bekar olup ehli yokken Mescid-i Nebevi'de uyuduğunu söylediği bildirilmektedir. Müslim Tirmizi ve Nesai de bunu rivayet etmişlerdir. AÇIKLAMA : Kays bin Tıhfe (r.a.)'in hadisinin müel!iften başka diğer kütüb-i sitte sahiplerinden İmam Ebu Davud 35. Kitabu'l-Edeb. 103. Babun fir'reculiyenbetha ala bathini, hadis no 5040 tahric etmiştir. Ayrıca İbn-i Mace hadisin metnini Sünen 33. Kitabu-I'Edeb, 27. Babun Nehyi ani'l-iztica-i ale-I' vech'de 3727 No. ile rivayet edilmiştir. Suffe: Mescid-i Nebevi'de fakir sahabileI'in kaldığı üstü kapalı bir yerdir. Buhari'nin 'Mescidde erkeklerin uyuması babı'nda rivayet ettiği bir hadiste Ebu Hureyre (r.a.) şöyle demiştir: 'Ben, Suffe ashabından yetmiş kişi gördüm Hiç birisinin üzerinde rida (bedenin yukarı kısmını örten elbise) yoktu. Ya izar (bedenin belden aşağısını örten elbise) vardı ya da boyunlarına bağladıkları kisa denilen örtü vardı. Bazılarının kisa denilen örtüleri topuklarma kadar uzundu, bir kısmınınki ancak diz kapağının altını örtüyordu. Avret yeri görünmesin diye elleriyle örtüyü toylayanlar oluyordu.' Suffe ehli; mescid içinde kendileri için ayrılan yerde yatıp kalkarlardı. Onların orada uyumaları, mescidde uyumanın caizliğine deIalet eder Tirmizi, İbn-i Ömer (r.a.)'in hadisini rivayet ettikten sonra bunun hasen - sahih oldugunu söylemiş ve ilim ehlinden bir kavmin mescidde uyumaya ruhsat verdiğini söyledikten sonra İbn-i Abbas (r.a.): \"Sakın kimse mcscidi gece ve gündüz uykusu için yatacak yer edinmesin.'' buyurmuştur. İlim ehlinden bir cemetat da İbn-i Abbas (r.a.)'in kavli ile hükmetmişlerdir. demiştir. EI-Menhel yazarı mescidde uyumak hakkında alimler arasında• ki ihtilafı özetle şöyle anlatmıştır: 1- Said bin el-Müseyyeb, Hasan-ı Basri, Ata', Muhammed bin Sirin ve Şafii alimleri: Mescidde uyumak caizdir. Bunda kerahet (kötülük) yoktur. Ancak orada uyumak; namaz kılanların yerini daraltır veya namazıarını şaşırmalarına sebep olursa, haramdır, demişlerdir. Onların delilleri İbn-i Mace, Buhari, Müslim, Tirmizi ve Nesai'nin rivayet ettikleri İbn-i Ömer (r.a.)'in (751 nolu) hadisidir. Diğer bir delili de Buhari'nin Sehl bin Sa'd (r.a.)'den rivayet ettiği şu mealdeki hadistir: ''Resulullah (s.a.v.) (Bir gün kızı) Fatime (r.a.a)'in evine geldi. Ali (r.a.)'i bulamadı: ''Amcam oğlu nerede?'' diye sordu, Fatime (r.anha) de: Aramızda bir şey geçti. Birbirimize öfkelendik. Bunun üzerine gündüz uykusunu benim yanımda uyumadı, diye cevap verdi. Nebi (s.a.v.) birisine: \"Bak nerededir?'' buyurdu, Adam (gidip) geldi. Ve: Ya ResulalIah! Ali mescidde uyuyor, dedi. Nebi (s.a.v.) mescide vardı. Ali (r.a.) yan tarafına yatmış, ridası bir yanından sıyrılmış vücüdu toprağa bulanmıştı, ResululIah (s.a.v.) toprağı ondan silkmeye başladı. Ve: ''Kalk ey Ebu Turab ! (= toprağın babası)) buyurdu.' Nevevi: ''Suffe eshabının ve sahabilerden bir cemaat'ın mescidde uyuya geldikleri sabittir. Keza Sümame bin Usal'ın müslümanllgı kabul etmeden önce mescidde uyuduğu sabittir. Bunların hepsi, Nebi (s.a.v.) hayatta iken olmuştur. Şafii: Müşrik mescidde geceleyince müslümanın gecelemesi de en az onun gibi kabul edilmelidir, demiştir.'' der. Hanefi alimlerinden el-Ayni: 'İbnü'l-Müseyyeb ve Süleyman bin Yesar'a mescidde uyumanın hükmü sorulmuş; Kendileri de: Suffe ehli mescidde uyuyorlardı. Onlar, meskenleri mescid olan bir kavim idi. Hal böyle iken bunu ne diye sorarsınız? diye cevap vermişler; Taberi de el-Hasan'ın şöyle dediğini zikretmiştir: Osman bin Affan (r.a.) halife iken mescidde uyuduğunu gördüm. Orada nöbet bekleyen de yoktu,' demiştir. 2- İmam Malik: Meskeni olan kimsenin mescidde gece veya gündüz uyumasını hoş görmem, demiştir. İmam Ahmed ve İshak da bu görüştedirIer. Onlara göre meskeni olanın mescidde uyuması mekruhtur. Yabancının uyııması mekruh değildir, İmam Malik'e göre mescidde uyuyan sahabilerin evleri yokmuş, Namazı beklerken uyumakta kerahet olmadığı kendisinden rivayet edilmiştir. İbn-i Mes'ud, Tavus, Mücahid ve Evzai de mescidde uyumayı mekruh görmüşlerdir.'' Yukarıdaki bilgi el-Menhel'in: \"Cünüb mescide girer'' babından alınmışt",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 753,
			"arabicnumber": 753,
			"text": "Ebu Zerr-i Gifari (r.a.)'den rivayet edildiğine güre şöyle söylemiştir: Ben: Ya Resulallah! Yeryüzünde ilk kurulan mescid hangisidir? diye sordum. Resulullah Sallallahu Aleyhi ve Sellem: «Mescidi Haram'dır.» buyurdu. Ebu Zerr demiştir ki: Ben: Sonra hangisidir? diye sordum. Resulullah Sallallahu Aleyhi ve Sellem: «Sonra Mescidi Aksa'dır.» buyurdu. Ben : — Bu iki mescid arasında ne kadar zaman vardır? diye sordum. O : — «Kırk yıl. Sonra yer yüzü senin için namazgahdır. Nerede namaz vakti sana gelirse orada kılıver.» buyurdu.\" Diğer tahric: Bu hadisi Buhari, ehadisu'l-Enbiya; Müslim, Mesacid; Nesai, enbiya ve Tefsir bahislerinde rivayet etti. Rivayetler arasında az bir lafız farkı varsa da hepsi aynı manayı ifade ederler. AÇIKLAMA : Mescid-i Haram, Mekke'de bulunan Ka'be'nin çevresindeki mesciddir, Mescid-i Aksa ise Kudüs şehrindeki meşhur camidir. Aksa: En uzak demektir, Kudüs'teki mescid'e bu ismin verilmesinin sebebi, Ka'be'ye pek uzak oluşu, yahut ondan daha geri istikamette başka bir mabedin bulunmayışıdır, Bazılarına göre bu ismin veriliş sebebi, mescidin pisliklerden uzak tutulması, tertemiz ve mukaddes oluşudur. Ka'be'nin İbrahim (a.s.), Mescid-i Aksa'nın da Süleyman (a.s.) tarafından yapıldığı ve aralarında bin yıldan fazla zaman bulundugu cihetle bu hadiste iki mescidin yapımı arasında kırk yıllık bir sürenin bulunuşu Kurtubi tarafından şöyle yorumlanmıştır: Bu konuda varid olan ayet ve hadis, İbrahim ile Süleyman'ın Bahsi geçen mescidIeri yeni inşa etmediklerine ve daha önce başkaları tarafından yapılmış olan binaları yenilediklerine delalet eder Ka'be'nin ilk yapıcısının Adem (a.s.) oldugu da rivayet. edilmiştir Eger bu rivayet asıl kabul edilirse Adem (a.s.)'dan kırk yıl sonra evladından birisi tarafından Mescidi Akaa'nın yapılmış olduğu bu hadisten çıkarılabilir. Ayni'nin beyanına göre Ka'be'yi ilk defa melekler bina etmiş, sonra İbrahim (a.s.), ondan sonra sırayla Amalika, Curhum ve Kureyş onu yenilemişlerelir. Kureyş'in Ka'be'yi yapması Nebi (s.a.v.)'in nübüvvetinden önceki yıllara rastlar, Daha sonra Abdullah bin Zübeyr (r.a.) ve ondan sonra da Haccac tarafından yapılmıştır. İbn-i Kesir; Mescid-i Aksa'yı mescid olarak ittihaz eden ilk zat'ın israil (a.s.) oldugunu, Süleyman (a.s.) tarafından onarıldığını söylemiştir. Buhari'nin 'Mekke fadlı babındaki Cabir bin Abdullah'ın hadisi bahsinde Kastalani Ka'be'nin yapımı ve onarımıarı hakkında genişçe bilgi vermiştir Anlattığına göre Ka'be, on defa bina edilmiştir. İlk yapılışı Adem (a.s.)'ın yaratılışından önceki devirlerde melekler tarafından olmuştur. İkinci yapıcısı Adem (a.s.)'dir, Nuh tufanı sebebiyle yıkılarak yeri bile kaybolan Ka'be, Kur'an'ın nassıyla sabit oldug'u gibi İbrahim (a.s.) tarafından ziyaretçilere hazırlanmış ve İbrahim (a.s.) üçüncü yapıcısı olmuştur. Hatta şöyle denilmiştir: Şu dünya aleminde Ka'be'den daha şerefli bir bina yoktur Çünkü yapılmasını emreden, Melik-i Celil, mühendisi Cibril, ustası İbrahim Halil ve kalfası ismail'dir Daha sonra sırayla Amalika, Curhum,, Kusayy bin Kilab, Kureyş, Abdullah bin Zübeyr (r.a.) ve Haccac tarafından yenilenmiştir. Harun Reşid veya babası yahut da dedesi Ka'be'yi yıktırarak yeniden Abdullah bin Zübeyr (r.a.)'in yaptırdığı şekilde yenilemek istemişse de İmam Malik halifeyi uyararak: Ka'be'nin meliklerin oyuncağı haline dönüşmesinden korkarım demek suretiyle ilgilileri bu teşebbüsten vaz geçirmiştir. Ebu Zer (r.a.)'in Nebi (s.a.v.)'e yönelttiği sorulara gelince; Görüldüğü gibi önce yer yüzünde kurulan ilk mescid'in hangisi olduğunu öğrenmek istemiş, bunu öğrendikten sonra ikinci mescidi sormuş, bunu da öğrenince iki mescidin yapılışı arasında geçen süreyi öğrenmek istemiştir. Nebi (s.a.v.l, Onun sorularını cevaplandırdıktan sonra yer yüzünün mescid hükmünde olduğunu, namaz vakti girince olunduğu yerde namaz kılınabileceğini bildirmiştir. Fazileti (istün olan mescidlere ulaşmak için kazaya bırakılacak şekilde namazı geciktirmeye mahal olmadığına hadiste işaret vardır. Burada yer yüzü namazgah olarak gösterilmekte ise de namaz kılmanın mekruh olduğu kabristan, hamam, çöplük, mezbaha, yolun ortası ve develerin yatakları gibi yerler özel hadislerle bu hükümden müstesnadırlar. Namaz kılmanın mekruh olduğu yerlerin bir kısmını bildiren hadisler dördüncü babta 745 746 ve 747 numaralarda geçmiştir. Ebu Zer' (r.a.)'in sorusu hangi mescidin tarih itibariyle önce yapıldığına dair olabildiği gibi, fazilet bakımından. hangisinde öncelik bulunduğuna dair de olabilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 754,
			"arabicnumber": 754,
			"text": "Resulullah Sallallahu Aleyhi ve Sellem'in kendilerine ait bir kuyudaki kovadan (mübarek ağzına) aldığı suyu yüzüne püskürttüğünü hatırlayan Mahmud bin er-Rabi' el-Ensari (r.a.)'den, o da, Resulullah Sallallahu Aleyhi ve Sellem ile beraber Bedir savaşına katılan ve mensubu bulunduğu Beni Salim kabilesinin imamlığını yapagelen İtban bin Malik es-Salimi (r.a.)'den rivayet ettiğine göre İtban (r.a.) şöyle söylemiştir : Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına gelerek : 'Ya Resulallah (Sallallahu Aleyhi ve Sellem)! Gerçekten gözüm zayıfladı. (Yağmur yağdığı zaman) sel gelir de benimle kavmimin mescidi arasına girer ve onu geçmek bana meşakkat verir. Eğer benimle evime gelmeyi ve mescid edineceğim bir yerinde bir namaz kılmayı uygun görürseniz bunu lutfediniz, dedim. O da: « Yaparım.» buyurdu. Ertesi gün Resulullah sallallahu aleyhi ve sellem Ebu Bekir (r.a.) ile gün yükseldikten sonra teşrif etti ve Resulullah (Sallallahu Aleyhi ve Sellem) (eve girmek için) izin istedi. Ben de girmesine izin verdim. Eve girdiğinde: «Sen evinin neresinde mescid edinmen için namaz kılmamı arzuluyorsun ?» buyuruncaya kadar oturmadı. Bunun üzerine ona namaz kılmasını arzu ettiğim mekanı işaretledim. Resulullah Sallallahu aleyhi ve sellem de namaz'a durdu. Biz de arkasında saf olduk. Bize iki rek'at namaz kıldırdı. Sonra sonra kendileri için pişirilen bir hazire (yi yenmesi) için onu alıkoydum. AÇIKLAMA : Mecc: Nevevi'nin beyanına göre alimler: Mecc ağızdan suyu püskürmektir, demişlerdir. Buhari'nin rivayetinde Mahmud bin er-Rabi': Nebi (s.a.v.)'in yüzüme su püskürdüğünü hatırlarım, demiştir. Çocukların yüzüne su püskürmekte, onlarla şakalaşmak ve babalarına ikram etmek gibi yararlar vardır. Bazı alimler: Nebi (s.a.v.) Mahmud (r.a.)'ın yüzüne mubarek ağzındaki suyu püskürmek ile, Mahmud (r.a.)'in bu olayı bellemesi ve bilahere anlatmakla rivayet faziletine kavuşmasını ve sahabiliğinin sabitliğini kasdetmiştir, demişlerdir. O tarihte Mahmud (r.a.) beş yaşında idi. Dört yaşında olduğu da söylenmiştir. Nebi (s.a.v.) henüz hayatta iken, Mahmud (r.a.l bilahere mümeyyizlik çağına ermiştir. Kastalani'nin beyanına göre İtban Cuma günü Nebi (s.a.v.)'e müracaat etmiş ve Nebi (s.a.v.) Cumartesi günü onun evini şereflendirmiştir. Ebu Uveys'in rivayetine göre beraberlerinde Ömer (r.a.) de bulunmuştur. Müslim'in bir rivayetine göre İtban: Nebi (s.a.v.) ve Sahabilerden Allah'ın dilediği zatlar geldi. demiştir. Rivayetlerin arası şöyle bulunmuştur: Nebi (s.a.v.) Ebu Bekir (r.a.) ile yola çıkmış, İtban (r.a.)'ın evine girilecegi zaman Ömer (r.a.) ve diğerleri oraya toplanarak Nebi (s.a.v.) ile beraber eve girmişlerdir, Nevevi, İtban (r.a.)'ın hadisinden istifade edilen hususlardan bir kısmını şöyle anlatır: 1- Salihlerden, eserlerinden ve namaz kıldıkları yerlerde namaz kılmaktan feyiz ve bereket alınır 2- Büyük zutlaırdan feyiz ve bereket. almak istenmelidir. 3- BüyÜk zatların, kendilerinden küçük olanları ziyaret etmeleri ve ziyaretlerinde bulunmaları meşrudur 4- Özür sebebiyle cemaata gitmemek meşrudur. 5- Alim, devlet adamı ve benzerleri yolculuğa çıkarken bazı arkadaşlarını beraberinde götürmelidirler. 6- Bir adam'ın evine girilirken izin istenmelidir. Ev sahibi önceden davet etmiş olsa bile müsaade alınmadan girilmemelidir. 7. Bir kaç iş varken en önemlisinden başlamalı çünkü Nebi (s.a.v.), namaz kılmak için gitmişti Namazı kılmadan oturmamıştı!' 8- Nafile namazını cemaatla kılmak caizdir. 9- Geceleyin kılınan nÜfile namazında olduğu gibi, gündüz kılınan nafile namazında da iki rek'atte bir selam vermek efdaldır, 10- Daima evin muayyen bir yerinde namaz kılmak meşrudur. Hazire diye geçen yemeğin yağlı çorba oldugunu söyleyenler bulunduğu gibi; Hazire: Ufak kıyıimış et ve undan yapılma sulu bir ypmektir, diyenler de vardır. Bu yemeğe et karıştırlmadığı takdirde ismi Aside'dir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 755,
			"arabicnumber": 755,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: Ensardan bir adam gözlerini kaybettikten son Resulullah Sallallahu Aleyhi ve sellem'e: Teşrif et de evimde benim için bir mescid tayin et, Orada namaz kılatrım, diye evine da'vet etti. Nebi sallallahu aleyhi ve sellem de gelerek (dediğini) yaptı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 756,
			"arabicnumber": 756,
			"text": "Enes bin Malik (r.a.)'den rivayet edildiğine göre şöyle demiştir: Benim amcalarımdan birisi, Nebi (Sallallahu Aleyhi ve Sellem) için yemek yaptı ve Nebi (Sallallahu Aleyhi ve Sellem)'e: Evimde yemek yemeni ve namaz kılmanı arzuluyorum, dedi. Enes (r.a.) demiştir ki: Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) Onun evine geldi ve evde şu hasırlardan bir tane bulunuyordu. Nebi (Sallallahu Aleyhi ve Sellem), evin bir kenarını (hazırlamayı) emretti. Hemen orası süpürüldü ve hafifçe sulandı. Sonra Nebi (Sallallahu Aleyhi ve Sellem) namaza durdu. Biz de Onunla beraber namaz kıldık.\" Ebu Abdillah bin Mace demiştir ki: Fahl: Siyahlaşmış hasirdir. Not: Zevaid'de: İsnadı hasendir. Hadisin aslı Buhari'de vardır, denilmiştir. AÇIKLAMA : Buhari, Müslim, Ebu Davud, Tirmizi ve Nesai de Enes bin Malik (r.a.)'den rivayet edilen hadisin meali bunun mealine benzer. Ancak Kütüb-i Hamse'de (Yani Buhari, Müslim, Ebu Davud, Tirmizi ve Nesai'de) rivayet olunan Enes (r.a.)'in hadisinde Nebi (s.a.v.)'i davet eden zat Enes (r.a.)'in amcası değil, onun anne annesi Müleyke'dir. Bazı rivayetlerde davet eden hatun, Enes (r.a.)'in annesi Ümmü Süleym'dir. [Kastalani'nin açıklamasına göre Enes (r.a.)'in annesi Ümmü Süleym'dir. Anne annesi Müleyke'dir. ] Buhari ve Müslim'in rivayet ettikleri hadisin metni mealen şöyledir: ''Enes bin Malik (r.a.)'den rivayet edildiğine göre büyükannesi Müleyke, Nebi (s.a.v.)'i, Onun için hazırlamış olduğu yemeğe davet etti. Nebi (s.a.v.), yemekten biraz yedikten sonra: ''Kalkınız. Size namaz kıldırayım,'' buyurdu. Enes (r.a.) demiştir ki: Uzun süre kullamlmasından dolayı kararmış olan bir hasırımıza doğru kalkıp gittim. (Yumuşatmak veya temizlemek için) hasırı hafifçe suladım. ResuluIlah (s.a.v.) hasır üzerinde ayakta durdu. Ben ve yetim (= Nebi (s.a.v.)'in mevlası (azadlısı, Dumeyre bin Ebi Dumeyre) Onun arkasında saf olduk. İhtiyar hatun (Müleyke) bizim arkamıza durdu. Nebi (s.a.v.), bize iki rekat namaz kıldırdı. Sonra (namazdan) çıktı. (Ve evine gitti\" Buhari ve Müslim bu hadisi 'Hasır üzerinde namaz babı'nda rivayet etmişlerdir. Nevevi, bu hadisin açıklaması bahsinde şöyle der; HADİSİN İHTİVA ETTİĞİ HÜKÜMLER ŞUNLARDIR : 1- Düğün dolayısıyla verilen ve velime adı verilen ziyafetteu başka ziyafetler için de yapılan davete icabet edilmelidir. Bu icabetin meşruluğunda ihtilaf yoktur. Ancak icabet vacib midir? Farz-ı kifaye midir? Sünnet midir? diye Şafii alimleri ve diğer mezheb alimleri arasında meşhur ihtilaf konusu olmuştur. Hadislerin zahirine göre bu davet vacibtir. Yeri gelince inşaaIlah izah edeceğiz. 2- Nafile namazı cemaatle kılmak eaizdir. 3- Salih ve alim zatların bir evde namaz kılmalan ev halkına bereket vesilesi olur. Nebi (s.a.v.), teşrifleriyle onları bereketlendirdiği gibi, namaz kılınış şeklini uygulamalı olarak.oıılara öğretmek istediği umulur. Çünkü kadın Nebi (s.a.v.)'in namaz kılışını mescidde ender görebilir. Nebi (s.a.v.), kılınış şeklini o kadına göstermek, öğretmek ve kadının da başkelarına öğretmesini istemiş olabilir. 4- Hasır v.s.. bitkiler üzerinde namaz kılmak caizdir. Bu hususta icma vardır. Ömer bin Abdilaziz (r.a.)'in muhalif kalışı, toprak üzerinde namaz kılmakla tevazu göstermenin müstahablığına yorumlanmıştır. 5- Elbiselerde, sergilerde, hasırlarda ve benzeri eşyalarda asıl olan hüküm, bunların temiz oluşudur. NecasetIeri gerçekleşmedikçe temizlik hükmü devam eder 6- Gece nafilelerinde olduğu gibi, gündüz kılınan nafile namazlarında iki rekat'ten selam vermek daha efdaldır. 7- Mümeyyizlik çağına ermiş çocuğun namazı sahihtir. 8- Çocuk, erkeklerle beraber safı tamamlar. Mezhebimizin sahih ve meşhur kavli budur. Alimlerin cumhuru da bununla hükmetmişlerdir. Yalnız İbn-i Mes'ud ve arkadaşları, muhalefet ederek: İmama uyanlar iki kişi oldukları takdirde imamla beraber bir saf olurlar,. İmam ortalarında durur, demişlerdir. 9- Erkeklerin cemaatında bir kadın bulunduğu takdirde, kadın tek başına ve erkeklerin arkasında durup, imama uyar. Enes (r.a.j, yumuşatmak için hasir sulamıştır. Çünkü başka rivayette açıklandığı gibi hasır, hurma dallarından yapılma imiş. Bir de üzerindeki toz ve benzerinii1 giderilmesi istenmiştir. Kadi İsmail el-Maliki ve başka alimler, sulamayı böyle yorumlamışlardır. Kadi iyad ise: 'Kuvvetli ihtimal şudur ki: Enes (r.a.), hasirın necaseti hususunda şüphe duyduğu için sulamıştır,' demiştir. Kadi iyad'ın bu sözü mezhebine göredir. Çünkü onun mezhebine göre şüpheli necaset, hafifçe sulamakla giderilebilir. Halbuki bizim mezhebimize ve cumhuruin mezhebine göre, necis olan bir şey iyice yıkanmakla temiz olabilir. Bu nedenle seçkin yorum, ilkidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 757,
			"arabicnumber": 757,
			"text": "Ebu Said-i Hudri (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem), şöyle buyurdu, demiştir : «Her kim mescidde bulunması uygun olmayan bir şeyi oradan çıkarırsa, Allah onun için Cennette bir ev yapar.» Not: Zevaid'de:' İsnadında inkıta' ve gevşeklik vardır. Çünkü ravilerinden İbn-i Ebi Meryem olan Selman bin Yesar, Ebu Said-i Hudri (r.a.)'den hadis işitmemiştir. diğer ravi Muhammed bin Salih'te de gevşeklik vardır, denilmiştir. AÇIKLAMA 759’da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 758,
			"arabicnumber": 758,
			"text": "Aişe (r.anha)'dan rivayet edildiğine göre şöyle demiştir : Resulullah (Sallallahu Aleyhi ve Sellem) mahallelerde mescidlerin (veya) evlerde namaz yerlerinin yapılmasını ve temiz tutulup güzel koku sürülmesini emretmiştir.» AÇIKLAMA 759’da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 759,
			"arabicnumber": 759,
			"text": "Aişe (r.anha)'den rivayet edildiğine,göre şöyle demiştir : Resulullah (Sallallahu Aleyhi ve Sellem) mahallelerde mescidlerin (veya) evlerde namaz yerlerinin ittihaz edilmesini ve temiz tutulup güzel koku sürülmesini emretmiştir.» AÇIKLAMA (757, 758 ve 759): Müellifin ikİ senedIe rivayet ettiği aynı ma'nadaki Aişe (r.anha)'nın hadisini Ebu Davud, İbn-i Hibban, Ahmed ve Tirmizi de rivayet etmişlerdir. Ebu Davud'un, 'Mahallelerde (veya) evlerde mescidlerin ittihazı babı'nda rivayet ettiği Aişe (r.anha)'nın hadisini açıklayan el-Menhel, özetle şu bilgiyi vermiştir: ''Dur: 'Dar'ın çoğuludur. Dar kelimesi bina, arsa ve mahalle anlamlarına gelir. Çünkü araplar, bir kabilenin toplu halde bulunduğu mahalleye Dar adını verirler. Hadisteki Dur kelimesi mahalleler anlamına yorumlandığında hadisteki 'Mesacid' kelimesi ile meseidler anlamı kasdedilmiş olur. Bu takdirde cümlenin manası şöyle olur: 'Resulullah (s.a.v.) mahallelerde mescidleri yapmayı emretmiştir.' Şayet 'Dur' kelimesi: 'Evler' anlamına yorumlanırsa, Mesacid kelimesi ile namaz kılınan yerler kasdedilmiş olur. Yani bu kelime 'Mescid'in çoğulu değil, secde ve namaz yeri anlamını taşıyan 'Mesced'in çoğulu olmuş olur. Buna göre cümlenin manası şudur: 'Restilullah (s.a.v.), evlerde namaz yerlerinin yapılmasını emretmiştir. ' EI-Mirkat sahibi: Birinci yorum tercihe şayandır. Tatbikat. da ona göredir. Nebi (s.a.v.)'in her mahalle halkının kendileri için birer mescid yapmalarını emretmesinin hikmeti, bir mahalle halkının başka mahalledeki mescide gitmelerinin zorluğu veya imkansızlığı ve bu nedenle mescıdde namaz kılmanın ve cemaatın faziletinden mahrum kalınmasıdır. Her mahalle halkının güçlük çekmeden bu faziletleri kazanmaları için kendi mahallelerinde mescid yapmalarını emretmiştir, demiştir. Hattabi, ikinci yorumu anlatmış, birinci şekilde yorum yapıldığını da söylemiştir. Ayni de, Hattabi gibi ikinci yorumu daha açık, görerek şöyle demiştir: 'Bir yer sahibi tarafından vakfedilmedikçe ve halk orada cemaatla namaz kılmadıkça mescid sayılmaz, diyen arkadaşlarımız için bu hadis bir delildir. Eğer yer sahibinin mescid ismini vermesiyle iş tamamlanmış olsaydı, şahısların kendi evlerinden mescid olarak ayırdıkları köşe veya oda, onlarıri mülkü olmaktan çıkmış olacaktı. Şu halde bir yere mescid ismini vermek, o yerin mescid sayılması için yeterli değildir. Bunun için Hidaye sahibi: Eğer kişi evinin içinden bir yeri mescid edinerek halkın oraya girip namaz kılmalarına izin verirse, o yeri satabilir ve ölümü halinde mirasçıların malı olur. Çünkü mescid, içine girilmesine hiç kimsenin mani olamıyacağı bir yerdir. Kişinin, evinden mescid olarak ayırdığı yer, onun mülkü ile çevrili olduğu için oraya kimseyi sokmayabilir. O halde orası mescid hükmüne girmiş değildir, demiştir. Mahallelerde mescidlerin ve evlerde namazgahların yapılmasına ait verilen emir vueub için değil, izin mahiyetindedir. Çünkü bundan gaye uzak mescidlere gitmek meşakkatinden kurtulmalarıdır. Nebi (s.a.v.) mescidlerin temiz tutulmasını emretmekle mescidde bulunması münasib olmayan her şeyden arınmasını, pis kokudan kirlerden korunmasını ve tertemiz muhafazasını istemiştir. Bunun yanında mescidlere güzel kokuların sürülmesini emretmiştir. Çünkü bu yerlerde namaz kılındığı için, camiler gibi hürmet edilmesi gerekir. İbn-i Reslan: 'Mescidlere erkeklerin kullandıkları ve renk izi bırakmayan güzel koku türleri sürülmelidir. Çünkü renk izi namaza duranların dikkatini çekebilir. Mescidlere güzel koku sürülürken en iyisi cemaatın namaz kıldıkları ve secde ettikleri yerlere Sürülmelidir, demiştir. Güzel koku sürmek diye terceme ettiğimiz \"Tatyib' kelimesini, buhurla tütsülemek diye yorumlamak caizdir. Bunun içindir ki İbn-i Hacer: Mescidi buhurla tütsülemenin müstahablığı hadisten anlaşılır. Malik bunu mekruh görmekle muhalefet etmiştir. Halbuki Ömer bin el- Hattab (r.a.) minber üzerinde oturduğu zaman Abdullah (r.a.) mescidi buhurla tütsülerdi. Selefin bir kısmı, mescide za'feran ve güzel koku sürülmesini müstahab saymışlardır. Nebi (s.a.v.)'in de bunu yaptığı rivayet olunmuştur, der. Şa'bi: Mescide güzel koku sürmek sünnettir, demiştir. İbn-i Ebi Şeybe'nin tahric ettiğine göre Abdullah İbn-i Zübeyr, Ka'be'yi yaptığı zaman duvarlarını misk ile sıvamıştır. Hadis, evlerde namazgahların ittihaz edilmesinin meşruluğuna delalet eder, Nebi (s.a.v.)'in, ashabtan İtban bin Malik (r.a.)'in evinin bir köşeşini mescid olarak ittihaz etmesini sağladığı sabittir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 760,
			"arabicnumber": 760,
			"text": "Ebu Said-i Hudri (r.a.)'den rivayet edildiğine göre şöyle demiştir : Mescidlerde ilk lamba yakan zat Temim ed-Dari (r.a.)dir.\" Not; Zevaid'de; Hadis mevkuftur. İsnadırıdaki ravilerden Halil bin İyas'ın zayıflığı üzerinde alimler ittifak etmişlerdir, denmiştir. AÇIKLAMA : Kütüb-i Sitte sahibierinden yalnız İbn-i Mace'nin rivayet ettigi anlaşılan bu hadis, mescidlerde ışık yakmanın meşruluğuna kanıttır. Ebu Davud'un 'Mescidlerde lamba yakmak babı'nda rivayet ettiği hadıse göre Nebi (s.a.v.)'in azatlı cariyesi Meymune bin-t Sa'd (r.anha), Nebi (s.a.v.)'den Mescid-i Aksa'da namaz kılmanın hükmünü sormuş. Nebi (s.a.v.) de: \"Oraya gidiniz ve içinde namaz kılıııız. (O bölgedekı şehirler. o sıralarda gayr-i müslimlerin hakimiyetindeydi.) Eger sizler Mescid-i Aksa'ya gidemez ve içinde namaz kılamazsanız kandillerinde yakılacak zeytin yağını gönderiniz.\" buyurmuştur. Ebu Davud'un rivayet ettigi bu hadıs İbn-i Mace tarafından da rivayet edilmiştir. Bahsi geçen iki hadis, mescidIerde lamba, kandil ve benzeri ışıkların yakılmasının meşruluğuna delalet eder. EI-Menhel yazarı, Meymune (r.anha)'nın hadisinden çıkarılan fıkhi hükümleri şöyle sıralamıştır: 1- Mescid-i Aksa'nın fazileti ve orada namaz kılmak için yolculuk edilmesinin meşruluğu anlaşılıyor. 2- Yakılmak üzere mescidlere yakıt göndermek, hatta başka şehirlerdeki mescidIere göndermek meşrudur. 3- Küfür diyarında bulunan mescidlerde namaz kılmak isteyen müslümanların yararlanması için mescidIerin aydınlatılmasında kullanılmak üzere oralara zeytin yağı göndermek meşrudur. Mescidlerin yararına olan başka maddeler de yağ gibidir. 4- Şer'i hükmü bilmeyen kimse, bilenlere sorup öğrenmelidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 761,
			"arabicnumber": 761,
			"text": "Humeyd bin Abdirrahman bin Avf (r.a.)'den rivayet edildiğine güre: Ebu Hureyre ve Ebu Said-i Hudrı (r.a.), kendisine şu haberi vermişlerdir: Resulullah (Sallallahu Aleyhi ve Sellem) mescidin duvarında balğam görmüş de eline aldığı bir çakıl taşıyla onu kazımış, sonra şöyle buyurmuştur: «Siz'den birisi balğam çıkardığı zaman ne önüne ne de sağına atmasın. Soluna veya sol ayağının altına tükürüğünü atsın.» AÇIKLAMA 764’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 762,
			"arabicnumber": 762,
			"text": "Enes bin Malik (r.a.)'den rivayet edildiğine göre şöyle demiştir : Nebi (Sallallahu Aleyhi ve Sellem), mescidin kıble duvarmda bir balğam gördü. Bunun üzerine öfkelendi. Hatta mübarek yüzü kıpkırmızı kesildi. Biraz sonra Ensar'dan bir kadın gelerek onu kazıdı ve yerine haluk sürdü. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) : «Bu ne güzel şeydir.» buyurdu. AÇIKLAMA 764’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 763,
			"arabicnumber": 763,
			"text": "İbn-i Ömer (r.a.)'den rivayet edildiğine göre şöyle demiştir : Resulullah (Sallallahu Aleyhi ve Sellem) (bir gün) cemaat'a namaz kıldırırken mescidin kıble duvarında balğam görmüş, namaz'dan çıktığı zaman şöyle buyurmuştur: «Siz'den birisi namazda olduğu zaman, Allah (ın kıblesi) onun yüzünün döndüğü tarafta olmuş olur. Bu nedenle sakın hiç biriniz namazda iken yüzünün olduğu tarafa balğam atmasın.» AÇIKLAMA 764’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 764,
			"arabicnumber": 764,
			"text": "Aişe (r.anha)'dtn rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) mescidin kıble duvarındaki bir tükrüğü kazımıştır. Not: Zevaid'de: İsnadı sahihtir. Ricali sikadır. Buhari ve Müslim'de bu hadis metni Ebu Hureyre, Ebu Said-i Hudri ve Abdullah bin Ömer (r.a.)'den rivayet edilmiştir, denmiştir. AÇIKLAMA (761, 762, 763 ve 764) 764 nolu Aişe (r.anha)'nın hadisinin Kütüb-i Sitte'den yalnız sünenimiz İbn-i Mace'de rivayet edildiği notta belirtildiği gibi Zevaid sahibi tarafından söylenmiş ise de bu hadis Müslim'in 'Mescidde tükürmekten nehiy' babında rivayet olunmuştur. İzah'ın sonunda Müslim'deki metni senediyle beraber nakledeceğiz Ebu Said-i Hudri (r.a.), Ebu Hureyre ve AbduIIah bin Ömer (r.a.)'in hadisleri, Buhari ve diğer sahih hadis kitabıarında az lafız farkıyla rivayet edilmiştir. Nühame: Göğüsten çıkan balğamdır. Bazıları: Burun yoluyla baştan inen balğam'a Nühame denilir, göğüsten çıkan balğam'a Nühaa denilir, demişlerdir. Busak ve Buzak kelimeleri, tükürük demektir. Bazı rivayetlerde 'Nühame' geçer, diğer bir kısım rivayetlerde 'Busak'; başka rivayetlerde 'Buzak' geçer. Mescidlerde, göğüs'ten çıkan balğam, baştan inen balgam ve ağızda oluşan tükürüğün atılması arasında bir fark yoktur. Hepsi yasaktır. Bu itibarla Bahsi geçen kelimelerden hangisi rivayet olunmuşsa netice değişmez. 761 nolu Ebu Hureyre (r.a.) ve Ebu Said-i Hudri (r.a.)'nin hadisinin Buhari ve Müslim tarafından da rivayet edildiğini yukarıda söylemiştik. Bu hadis, kıble ve sağ tarafa tükürmeyi yasaklıyor. Bu yasaklama umumidir. Yani namaz içinde veya mescid içinde olma şartını koşmuyor. Tirmizi, Ebu Davud ve Nesai'nin Tarık bin Abdillah el-Muharibi (r.a.)'dan rivayet ettikleri benzer hadiste Nebi (s.a.v.) şöyle buyuruyor: ''Adam namaza durduğu zaman veya biriniz namaz klldığl zaman ne önüne ne de sağına tükürmesin ... \" EI-Menhel yazarı 'Mescidde tükürmenin keraheti babı'ndaki Tarık (r.a.)'ın hadisini açıklarken şöyle der: ''Hadiste kıble ve sağ taraflarına tükürmek yasak kılındığından yasaklama zahiren haram kılınma anlamını taşır. Buhari'nin Enes (r.a.)'den olan rivayetinde yasaklama sebebinin Allah Teala'nın kişi ile kıble arasında oluşunun gösterilmesi de haramlık anlamını te'yid eder el-Hafız: 'Bu sebebe bağlamak, kıble tarafına tükürmenin mutlaka haram olduğuna delalet eder Kişi mescidde olsun olmasın hüküm aynıdır, özellikle namaz esnasında bu hareket şiddetle haramdır, Artık mescidde tükürmenin mekruhluğu tenzih için mi? tahrim için mi diye bir ihtilaf' söz konusu değildir. İbn-i Huzeyme ve İbn-i Hibban'ın sahihlerinden Huzeyfe (r.a.)'den mer1u' olarak rivayet edilen bir hadiste : \"Kıble tarafına tüküren kişi, kıyamet günü tükrüğü gözleri arasında olduğu halde gelir.\" buyurulmuş; yine İbn-i Huzeyme'nin İbn-i Ömer (r.a.)'den merfu' olarak rivayet ettiği başka bir hadiste, ''Kıble tarafına balğam atan kişi, kıyamet günü balğam'ı yüzünde olduğu halde haşredilir.\" buyurulmuştur Ebu Davud ve İbn-i Hibban'ın es-Saib bin Hallad (r.a.)'dan riv;iyet ettikleri hadiste: Bir adam bir kavme imamlık etmiş de, kıble tarafına tükürmüş. Namazdan çıkınca ResululIah (s.a.v.), o kavme: \"O şahıs size imamlık yapmasın.'' buyurmuş ve adama: ''Gerçekten sen, Allah'a ve Resulüne eziyet ettin.\" buyurmw)tur' demiştir. Tarık (r.a.)'in hadisinin zahirine göre kıbieye ve sağ tarafa tükürmenin yasaklığı namaz haline mahsustur. İmam Malik'e göre namaz dışında sağ tarafa tükürmekte beis yoktur. Nevevi. Namaz içinde ve namaz dışında kıble yönüne ve sağ tarafa tükürmek mutlaka yasaktır, demiştir, Buhari ve Müslim'in rivayet ettikleri Ebu Hureyre (r.a.)'in (761 nolu) hadisi mutlaka yasaklığa deleılet eder. Ebu Said-i Hudri (r.a.) ilc Cabir (r.a.)'in hadisi de buna delalet eder. El-Hafız. 'Sag tarafa tükürmenin mutlaka yasak olduğuna delalet eden delillerden birisi de İbn-i Mes'ud (r.a.)'in namazda değilken sağ tarafa tükürmekten kerahat ettigine dair Abdürrezzak ve başkasının rivayet ettikleri hadistir. Muaz bin Cebel (r.a.)'in de: Ben müslüman olalı sağ tarafıma tükürmedim, dedigi rivayet olunmuştur. Ömer bin Abdülaziz (r.a.)'in de, oğlunu sağ tarafa tükürmekten menettiği rivayet olunmuştur,' demiştir. Kadi iyad: Namaz esnasında mecbur olmadıkça sağ tarafa tükürmek yasaktır. Bundan başka hiç bir çare bulmak mümkün değilse zaruret nedeniyle yapabilir, demiştir. el-Hafız: Namaza duran kişinin üzerinde elbise varken sağ tarafa tükürmekten başka bir çare yoktur denemez. Zaten Şar-i Hakim mecbur kalındığında elbise içine tükürme yolunu göstermiştir, demiştir. Hadisin zahirine göre sol tarafa veya sol ayak altına tükürme ruhsatı verilmiştir. Tarık (r.a.)'in rivayetinde şöyle buyuruluyor: \"Velakin sol tarafı boş ise oraya tükürsün. \" Şu halde adamın sol tarafında bir kimse. varsa oraya da tüküremez. Ancak sol ayağ'ının altına tükürebilir. Nevevi: Sol tarafta veya sol ayağının altına tükürme ruhsatı mescidin dışındaki adama mahsustur. Mescid içinde kişi buralara da tüküremez. Ancak elbisesi içine tükürebilir. Çünkü: \"Mescidde tükürmek günahtır,'' hadisi sahihtiı'. demiştir Nevevi şunu demek istemiştir: Nebi (s.a.v.) mescidde tükürmenin hata olduğunu\" beyan ettikten sonra mescidde tükürmeye izin vermesi akıldan uzaktır. İbn-i Hacer 'Mişkatü'l-Mesabih' şerhinde: Kişinin sol tarafına veya sol ayağının altına tükürmesi ruhsatı, namazdaki şahsın mescidden başka bir yerde namaz kılması zamanına mahsustur. Veyahut mescidde iken tükürmesi halinde tükrüğünün mescidin her hangi bir yerine dokunmaması şartına bağlıdır. Namaz dışındaki tükürme ve mescid dışındaki tükürme hükmü de, namaz içindeki tükürme hükmü gibidir, demiştir. İbnü'l-İmad: Mescidde hakaret maksadıyla tükrüğünü her hangi bir tarafa atan kişinin küfre gittiği husüsunda alimler arasında her hangi bir ihtilaf yoktur, demiştir.' MESCİDDE TÜKÜRMENİN MEZHEBLERE GÖRE ŞER'İ HÜKMÜ 1- Hanefilere göre mescid i tükürük, sümkürük ve balğamdan korumak vacibtir Mescidin duvarlarına veya zeminine; döşemesinin üstüne veya altına tükürmek, tahrimen mekruhtur. Bunu yapanın derhal temizlemesi gerekir. Mescid tabanının topraklı oluşu, sert bir madde ile kaplı oluşu keza döşemeli, döşemesiz oluşu arasında hiç biı fark yoktur. 2- Şafii alimleriıw göre nıescidin tabanı yumuşak bir topreık labakasından teşekkül etmiş olup kişi önceden bir çukur kazıp içine tükürdükten Sonra toprakla iyice üstünü örterse haram işlemiş sayılmaz. Çukur kazmadan tükıırse haram işlemiş olur Tükürdükten sonra onu gömerse, günahın devamını önlemiş olur. Keza mesc:idin sert tabanına tükürük atmakla haram işlemiş olur, Günahııı devamını önlemek için, onu kazıması gerekir 3- Malikiler' göre tabanı sert olan mcscidin tabanına az tükürük atmak mekruhtur, Çok olunca haram olur Mescidin tabanı çakıl taşlarıyla döşeli olduğu zaman yere tükürmek mekruh değildir. 4- Hanbelilere göre mescidde tükürmek haramdır. Tabanı toprak veya çakıl taşlarıyla döşeli olan mescidin tabanına atılan tükürük, sahibi tarafından yere göınüldüğü takdirde günahın devamlılığı önlenmiş olur, Şayet. tabanı sert ise kazıması veya silmesi gerekir, Bunu hasırla örtmek kafi değildir. Sahibi tarafınrlan gömülmeyen tükürüğü görenin. bımun gidermesi vacibtir, 763 nolu İbn-i Ömer (r.a.)'in hadisini yukarıda anlattığımız gibi Buhari, Müslim, Ebu Davud, Nesai ve Maiik az lafız farkıyla rivayet etmişlerdir. Bu hadisle namaz esnasındcl kıble tarafına tükiirmenin yasaklığl gerekçeli olarak bildirilnliştir EI-Menhel yazarının, bu hadisin açıklaması ile ilgili olarak verdiği bilginin biı' kısmı şöyledir: \"Hadisin zahirine göre Nebi (s.a.v.), ınescidin kıble tarafında gördüğü balğaml bizzat gidermiştir. Nesai'nin Enes (r.a.)'den rivayet ettigi bir hadise: (762 nolu hadisimizi kastediyor) göre Ensardan bir kadın kalkıp mescid'in duvarındaki balğamı kazımış ve yerine haluk denilen güzel kokuyu sürmüştür Nebi (s.a.v.) de bunu beğenmiştir iki hadis arasında bir çelişki yoktur. Çünkü olayın teaddüdü (bir'den fazla tekrarı) muhtemeldir. Rivayetin zahirine göre görülen balğam kuruymuş. Çünkü yaş olmuş olsaydı ravi. \" ... kazıdı'' yerine ''.sildi'' diyecekti. Hadis yaş balğam gibi kuru balğamın da pis olduğuna delalet. eder Hadis'in ''... كان اللَّه قبل وجهه...'' cümlesinin zahiri manası: ''Allah Teala namaza duranın yüzünün döndüğü tarafta olmuş olur.'' demektir-. Halbuki Allah mekandan münezzehtir. Bunun için bu cümle şöyle yorumlanmıştır. \"AIlah'ın kıblesi ... '' veya \"Allah'ın azameti ... '' yahut. \"Allah'ın sevabı...'' Yami ehlinin malumu olduğu üzere lafza-i Celal'in dışında bir mudaf kelime takdir edilir . Hattabi cümleyi şöyle yorumlamıştır. Allah'ın, namaz kılınırken O'na doğru durmayı emrettiği kıble, namaz kılanın yüzünün döndüğü taraftadır. O halde kıble tarafını balğamdan korusun. Kabe'ye Allah'ın kabesi ve Allah'ın evi denildiği gibi namaz kılan'ın yüzünün dönük olduğu tcırafa Allah'ın tarafı ve Allah'ın kıblesi denilebiIiI'. Hadiste ''Kişi namazda olduğu zaman ... '' buyurulmuştur. Namaz dışında da kıble tarafına tükürmenin yasaklığı, sahih hadislerle sabittir. Özellikle namaz içinde kıble tarafına tükürmek çok daha ağır olduğu için bu hadiste ''namazda olduğu .. '' kaydı konulmuştur. HADİSiN FIKIH YÖNÜ : 1- Mescidi, kirletici olan her şeyden korumak gerekir. 2- İmam, mescidin durumunu kontrol ederek, pisliklerden korunmasında titizlik göstermelidir. 3- Hadis, Nebi (s.a.v.)'in yüksek tevazusunu ifade eder. 4- Özellikle kıble yönüne çok hürmet edilmelidir. Zevaid'de yalnız ibn-i Mace tarafından rivayet. edildiği bildirilen Aişe (r.anha)'nın hadisinin Müslim'de de rivayet edildiğini belirtmiştik. Müslim'in rivayeti şöyledir. \" ... Aişe (r.anha)'dan rivayet edildiğine göre; Nebi (s.a.v.) (mescidin) kıble duvarında bir tükürük veya sümük veya balğam görmüş de onu kazımıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 765,
			"arabicnumber": 765,
			"text": "Büreyde (r.a.)'den rivayet edildiğine göre şöyle demiştir : Resulullah (Sallallahu Aleyhi ve Sellem) (sabah) namazı (nı) kıldıktan sonra bir adam: Kırmızı deveyi (görüp) söyleyen var mı? dedi. Nebi (Sallallahu Aleyhi ve Sellem) : «Onu bulamıyasın. Çünkü mescidler, ancak malum işlerde kullanılmak için yapılmıştır.» buyurdu.\" MÜSLİM RİVAYETLERİ: 568 – 569",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 766,
			"arabicnumber": 766,
			"text": "Amr bin Şuayb'ın dedesi (Abdullah bin Anır bin el-As) (r.a.)'den rivayet edildiğine göre şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), mescidde kayıp ilanından, (veya) tarifinden nehiy buyurmuştur.\" EBU DAVUD HADİS’İ VE İZAH İÇİN BURAYA TIKLAYIN",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 767,
			"arabicnumber": 767,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre kendisi: Resulullah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken işittim, demiştir : «Mescidde kayıp arayan adamı işiten kişi desin ki: Allah (onu) sana geri vermesin. Çünkü şüphesiz mescidler bunun için yapılmamıştır.» EBU DAVUD HADİSLERİ VE İZAHLARI: 473 — 4490",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 768,
			"arabicnumber": 768,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Eğer siz (namaz kılmak için) koyun ağıllarından ve deve yataklarından başka bir yer bulamazsanız, koyun ağıllarında namaz kılınız ve deve yataklarında namaz kılmayınız.» Not; İsnadının sahih olduğu Zevaid'de bildirilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 769,
			"arabicnumber": 769,
			"text": "Abdullah bin el-Muğaffel el-Müzeni (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Seİlem) şöyle buyurdu demiştir: «Koyun ağılarında namaz kılınız ve deve yataklarında namaz kılmayınız. Çünkü develer şeytanlardan yaratılmışlardır.» Not: Zevaid'de: Müellifin isnadı hakkıııda konuşulmuştur Nesai bu hadisin, 'deve yataklarında namaz kılmaktan nehiy' bülümünü rivayet etmiş, koyun ağılında namaz kılmakla ilgili kısmı rivayet etmemiş, denilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 770,
			"arabicnumber": 770,
			"text": "Sebere bin Ma'bed el-Cüh-ni (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir : «Deve yataklarında namaz kılınmaz ve koyun ağılında namaz kılınır.» Not: Zevaid sahibi bu hadisi zikretmiş de, onun isnadı hakkında konuşmamıştır. AÇIKLAMA (768, 769 ve 770) Zevaid yazarının beyanına göre Ebu Hureyre (r.a.) ile Sebere (r.a.)'nın hadislerini Kütüb-İ Sitte sahibIerinden yalnız müellifimiz (İbn-i Mace) riva,yet etmiştir. Halbuki Tirmizi 'Koyun ağıllarında ve deve yataklarında namaz kılmak hakkında gelen hadisler babı'nda Ebu Hureyre (r.a.)'den merfu' olarak şu hadisi rivayet edip, hasen - sahih olduğunu söylemiştir: ''Koyun ağıllarında namaz kılınız ve deve yataklannda namaz kılmayınız.'' Görüldüğü gibi Tirmizi'nın Ebu Hureyre (r.a.)'den rivayet ettiği hadis metni daha kısadır. Nesai'nin Abdullah bin Muğaffel'den merfu' olarak rivayet ettigi hadisin metni de şöyledir :. ''Şüphesiz Resulullah (s.a.v.) deve yataklarında namaz kılmaktan nehiy etmiştir.'' Müslim'de 'Deve etleri(ni yemek) den dolayı abdest almak babı'nda Cabir bin Semure (r.a.)'den rivayet ettiği uzunca bir hadiste: ''Bir adam, Nebi (s.a.v.)'e: Ben, koyun ağıllarında namaz kılayım mı? diye sormuş; Nebi (s.a.v.) : ''Evet'' buyurmuş; Adam bu defa: Deve yataklarında namaz kılayım mı? diye sorunca Nebi (s.a.v.) ''Hayır'' diye cevab buyurmuştur,'' demektedir Ebu Davud'da Cabir bin Semure (r.a.)'in hadisine benzer bir hadisi Bera' bin A'zib (r.a.)'den rivayet etmiştir. Abdest bahsinde rivayet ettigi hadisin açıklamasını yaparken el-Menhel yazarı şöyle der. ''Hadisin zahirine göre deve yataklarında nama/. kılmak haramdır. Ahmed bin Hanbei bununla hükmederek, Burada kılınan namaz katiyyen sahih degildir. iyade edilmesi gerekil', demiştir. Cumhura göre burada namaz kılmak mekruhtur. Hödiste deve yataklarında namaz kılmanın yasaklığına gerekçe olarak develerin şeytanlardan yaratılmış oldukları gösterilmiştir. Gerekçenin zahirine göre yasaklama hükmü, develerin orada bulunduğu zamana aittir. Develer orada yoksa ve necasetten emin olunursa namaz kılmak yasak degildir. Çünkü Ebu Zer (r.a.)'in hadisinde Nebi (s.a.v.) ''Yeryüzü benim için temizleyici ve mcscid kılınmıştır\", buyurmuştul'. Şafii, el-Ümm adlı kitabında. 'Nebi (s.a.v.)'in. ''Deve yataklarında namaz kılmayın. Çünkü deve, cinden yaratılmış bir cindir.\" hadisi söz konusu yasağın, o yerin neccisetinden dolayı değil, devenin kendisinden dolayıdır ... ' demiştir. Hadisin. '' .. çünkü şeytandan yaratılmıştır.'' parçasına gelinc8; Bu parça Ahmed bin Hanbel'in rivayetinde mealen şöyledir. ''.. Çünkü deve cinden yaratılmıştır, Kaçtığı zaman gözlerini ve durumlarını görmüyor musun?\" Bu rivayetlerin zahirine göre deve şeytan neslinclen türemedir. Hatta kendileri de şeytanlar gibidir. Parça'dan kasdedilen mana şu olabilir. Deve, şeytanlar gibi namaz kılanları meşgu! eder. Çünkü develer rahat durmaz. icabında kişi namazda iken deve ürker veya kaçıp gider, sağı solu karıştırır ve bu davranışları ile, kişinin namazını yarıda bırakmasına sebebiyet verebilir. Kişinin, namazını şaşırması, karıştırması hatta icabında kesmesi hususunda develer şeytan'a benzetilıniş olur. Bu haller, koyunda yoktur. Hadisin: ''Koyun ağılında namaz kılın\" emri vucub için değil, mübahlık içindir Yani bu yerde kılınabilir.\" Tuhfetü'l-Ahvezi'nin beyanına göre cumhur: Deve yafaklarında necaset yokken namaz kılmak mekruhtuı' Necaset varken haramdır, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 771,
			"arabicnumber": 771,
			"text": "Resulullah (Sallallahu Aleyhi ve Sellem)'in kızı Fatinıe (r.anha)'dan rivayet edildiğine göre şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) mescide girdiği zaman şöyle derdi: «Allah'ın adıyla. Selam da Allah'ın Resulüne olsun. Allah'ım! Benim günahlarımı mağfiret eyle ve rahmetinin kapılarını bana aç.»\" Ve Resulullah (Sallallahu Aleyhi ve Sellem) mescidden çıktığı zaman şöyle derdi: «Allah'ın adıyla. Selam da Allah'ın Resulü ne olsun. Allahim! Günahlarımı mağfiret eyle ve fadlının kapılarını bana aç.» Not: Tirmizi, Fatime (r.a.)'in hadisini tahric ettikten sonra: Hadis hasendir. İsnadı ise muttasıl değildir. Çünkü (Nebi (s.a.v.)'in torunu) Hüseyin (r.a.)'in kızı olan Fatime (r.a.), (nenesi olan) büyük Fatime (r.anha)'ya yetişmemiştir. Zira büyük Fatima (r.anha), Nebi (s.a.v.)'den sonra bir kaç ay yaşamıştır, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 772,
			"arabicnumber": 772,
			"text": "Ebu Humeyd es-Saidi (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir : Biriniz mescide girdiği zaman Nebi (Sallallahu Aleyhi ve Sellem)'e selam etsin. Sonra şöyle desin: ~ 'Allahım! Bana rahmetinin kapılarını aç.' ve çıktığı zaman şöyle desin : - 'Allahım! Senin fadlından sana dilekde bulunurum.'»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 773,
			"arabicnumber": 773,
			"text": "Ebu Hureyre (r.a.j'den rivayet edildiğine güre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Biriniz mescide girdiği zaman Nebi (Sallallahu Aleyhi ve Sellem)'e selam etsin ve şöyle desin: 'Allahım! Bana rahmetinin kapılarını aç.' Ve çıktığı zaman Nebi (Sallallahu Aleyhi ve Sellem)'e selam etsin ve şöyle desin : -Allahım! Beni, şeytanı racim'den koru.'» Not: Hadisin isnadının Sahih, ricalinin sikalar olduğu Zevaid'de bildirilmiştir. AÇIKLAMA : Ebu Humeyd (r.a.)'ın hadisini Müslim Nesai. Ahmed ve Ebu Davud 'da rivayet etmişlerdir: Fatime (r.anha)'nın hadisini Tirnizi ve Ahmed de rivayet etmişlerdir Yalnız, MüelIif larafından rivayet edildiği Zevaid'de bildirilen Ebu Hureyre (r.a.)'in hadisinde, mescide girerken okunması emredilen dua Ebu Humeyd (r.a.)'in hadisindeki dua'nın aynısıdır. Çıkarken okunması emredilen dua'nın benzeri Ebu Davud tarafından Abdullah bin Amr bin el-As (r.a.)'dan mefu' olarak rivayet olunan bir hadiste mescide girerken okunması emredilmiştir, El-Hakim de Ebu Hureyre (r.a.)'in hadisini riwayet ederek sahih olduğunu söylemiştir, Üç hadiste geçen. \"Mescide girdiği zaman ... \" parçasından maksad: 'Mescide girmek istediği zaman veyahut: 'Mescide fiilen girdigi zaman .. 'dır. Mescid'e girerken Allah'dan dilenen rahmet kapılarının açılmasından maksad, ihsan ve nimetlerine erişmek kolaylığını bahşetmektir. EI-Menhel yazarının beyan ettiği gibi mescide girerken rahmet kapılarının ve mescidden çıkarken fadl kapılarının açılması veya fadl dilenmesinin sırrı şudur: Mescide giren kimse, kendisini Rabb'inin sevabına ve cennetine yaklaştıracak olan şeylerle meşgul olur. Bu nedenle rahmet dilemek uygun olur. Rızık taleb etmek üzere mescidden çıktığı zaman fadl dilemek münasib olur. Nitekim Allah Teala; \"Cuma namazı kılınınca yer yüzüne dağılınız ve Allah'm fadIından isteyiniz'' (Cum'a 10) buyurmuştur. Huccetu'llah el-BaIiğa'de: 'Mescide girenin rahmet ve çıkanın fadl dilemesinin hikmeti şudur: Rahmet, Kur'an-ı Kerim'de, velilik ve Nebilik gibi uhrevi ve nefsani ni'metler anlamında kullanılmıştır. ...... \"Ve Rabb'inin rahmeti (Nebilik), kafirlerin (mal ve mülk olarak) topladıkları şeylerden daha hayırlıdır,'' (Zuhruf 32) ayetinde olduğu gibi Fadl ise Dünya ni'metleri anlamında kullanılmıştır,' denilerek yukarıya alelığımız. ayet meali gösterilmiştir' Son hadiste geçen \"Şeytan-i Recim ... '' parçasındaki Şeytani'r-recim kelimelerinin manalarına gelince: Şeytan: ibn-i Abbas (r.a.)'ın dediği gibi Şeytan. Insan cin ve hayvanlardan azmış olan, demektir. Bu kelime 'Şatana = Uzaklaştı' fiilinden türeme olabilir. Bu takdirde 'Şeytan' kelimesininnanası, Allah'ın rahmetinden uzaklaştırılmış olan demektir. 'Şeytan' kelimesi 'Şata = yandı' fiilinden alınmış olabilir. Bu taktirde 'Şeytan' kelimesinin manası; Allah'ın azabıyla helak edilmiş olan. demektir' Racim: Taşlanmış olan demektir. Şeytan aleyhi'l-La'ne lanetlendiği ve yıldız (gök taşı) alevlerine tutulageldiği için ona bu isim verilmiştir. Parçanın manası şudur: Allah'ım! Rahmetten uzaklaştırılan, azabınla helak edilen azgın; lanet taşına ve yıldız (gök taşı) alevine tutulmuş olan Şeytan'ın vesvesesinden, alatmasından, sapıtmasından beni Sen koru. Parçadaki korumaktan maksad, şeytanın huyu olan hased, kibir, böbürlenme, aldanma, aldatma ve isyan gibi vasıflardan korumak olabilir. EBU DAVUD HADİSİ İÇİN BURAYA TIKLAYIN",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 774,
			"arabicnumber": 774,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Sizden birisi güzelce abdest aldıktan sonra namazdan başka hiç bir maksadla evden çıkmayarak ve sırf namaz kılmak niyetini güderek mescide doğru yürüdüğü zaman, mescide girinceye kadar attığı her adımla Allah onu bir derece yükseltir ve kendisinden bir hata düşürür. Mescide girince de namaz onu alıkoyduğu sürece namaz içinde olmuş olur.» Tahric: Bu hadisi Kütüb-i Sitte sahiplerinin hepsi, birbirine yakın lafızlarla rivayet etmişlerdir Malik, İbn-i Hibban ve Beyhaki de buna yakın lafızlarla rivayet etmişlerelir, AÇIKLAMA : Ebu Davud'un rivayet ettiği metin daha uzundur, Onun rivayet ettigi haelisin baş kısmında, kişinin cemaatla kıldığı namazın, evinde ve çarşısında kıldığı namazdan yirmibeş derece fazla olduğu bildiriliyor, Hadisin son kısmında da: ''Kişi namazı beklerken mescidde kimseye eziyet etmedikçe ve abc\\esti bozulmadıkça melekler onun için dua ederek: 'Allahım ona mağfiret eyle', Allah'ım ona rahmet eyle Allah'ıın onun tevbesini kabul eyle'' derler. ilavesi vardır. Hadisteki, ''....namazdan başkabir maksatıla...'' cümlesinden anlaşılıyor ki; kişi sırf namaz için değil de, namaz kılmak niyetiyle beraber başka mülahazalarla mescide vardığı takdirde, hadiste va'd olunan fazileti kazanamaz, Sırf namaz kılmak maksadıyla mescide giiden kişi, attığı her adım karşılığında hem bir hasene kazanır, hem de bir günahl silinir. Kişi mescide girdikten sonra namaz için beklediği sürece sevab kazanması yönünden namazia meşgul olanın hükmündedir. Yukarıda Ebu Davud'un süneninden naklen beyan ettiğimiz, rivayette belirtildiği gibi kişi orada kimseye söz veya fiil ile eziyet etmeclikçe ve abdesti bozulmadıkça, namazdaymış gibi sevab kazanmış olur. Kimseye eziyet ettiği veya abdesti bozulduğu zaman. namaz\"\" meşgulmüş gibi süregelen sevabı son buiur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 775,
			"arabicnumber": 775,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Namaza ikamet getirildiği vakit sakın ona, koşarak gelmeyiniz, yürüyerek geliniz. Sükunet ve vakardan ayrılmayınız. Yetişebildiğiniz kadarını (imamla) kılınız. Yetişemediğinizi (kendiniz) tamamlayınız.» Diğer tahric: Buhari, Müslim, Ebu Davud... AÇIKLAMA : Hadiste ''Namaza kamet getirildiği vakit...'' buyurulmuştur. Buhari'nin bir rivayetinde:......= ''İkamet sesini işittiğiniz zaman ... ''; başka bir rivayette de: ''Namaza geldiğiniz zaman ... \" buyurulmuştur. ''İkamet edildiği vakit koşarak namaza gitmeyin'' buyurulurken: İkamet edilmeden önce namaza koşarak gidebilirsiniz, hükmü çıkarılamaz. Esasen namaza başlarken imamla beraber niyet etmeye yetişebilmek için, kamet edilirken koşmanın meşruluğu düşünüldüğünden dolayı bu düşünüşün yanlışlığını belirtmek için özellikle kametten bahsedilmiştir. İkamet getirilirken imam la beraber taharrum (namaz'a ilk giriş) tekbirinin faziletine erişmek maksadıyla koşmak yasak iken kamet'ten önce koşmak hayda hay yasak olur. Şu halde gerek kamet edildiği vakit ve gerekse başka zaman koşarak namaza gitmek, caiz değildir. Ebu Davud'un sunenınin 'Namaza koşmak babı'nda rivayet olunan bu hadisin açıklanmasında el-Menhel yazarı şöyle der: ''Bazı alimler hadisteki kamet kaydını dikkate alarak 'İkamet getirilmeden önce koşmak caizdir. İkamet getirilirken caiz değildir. Caiz olmayışının sebebi de şudur: kamet edildiği zaman koşarak gelip namaza duran kişi tam bir huşu ile kıraatini ve diğer vecibeleri yerine getiremez. Fakat kamet'ten önce koşarak gelen şahıs, icabında dinlenir, sonra kamet edilir ve huşu ile namaza başlar,' demişlerdir. Nevevi: 'İkarnet getirilmediği zamanlarda koşarak namaza gelmenin yasaklığına dikkati çekmek için hadiste: ''İkamet getirilirken ... \" buyurulmuştur. Çünkü kamet getirilirken cemaatla kılınan namazın bir kısmını kaçırmak endişesi bulunmasına rağmen koşmak yasak olduğuna göre, böyle bir endişe olmadığı yani henüz kamet edilmemişken koşmanın yasaklığı kendiliğinden anlaşılır. Koşmaya gerek olmadığına dair Nebi (s.a.v.)'in: \"Çünki biriniz namaza gitmeye kasdedip (yürüyünce) artık o kişi namazdadır.'' buyruğu kametten önce de koşmanın manasız olduğuna delalet eder. Ne zaman olursa olsun, namaz. niyetiyle yola çıkan kişi, mademki namazda sayılır, ister kamet edilirken, ister henüz kamet edilmemişken koşmaya lüzum kalmamış olur. Hadisin sonundaki: \"Yetişebildiğiniz kadarını (imamla) kılın, yetişemediğiniz kısmı (kendiniz) tamamlayın.'' buyrugu da bu görüşÜ te'yid eder.' demiştir. Hadis, namaza koşarak gitmenin yasaklıgına delalet eder. Bu hususta Cuma namazı ile vakit namazları arasında bir fark yoktur. Taharrum tekbirini veya bazı rek'atları, hatta cemaatı kaçırma endişesi bulunsun bulunmasın hüküm aynıdır .. Zeyd bin Sabit, Enes, Ahmed ve Ebu Sevr'in mezhebi budur. İbnü'l-Münzir de bu görüşü seçmiştir Alimlerin ekserisinin buna hükmettikleri rivayet olunmuştur İbn-i Mes'ud, İbn-i Ömer, el-Esved bin Yezid, Abdurrahman bin Yezid ve İshak bin Rahuye (r.anhum)'a göre taharrum tekbirinin faziletini kaçırma endişesi varsa koşulur Nevevi: Ebu Hureyre (r.a.)'den rivayet. olunan Bahsi geçen hadis dolayısıyla birinci görüşün daha sıhhatli olduğunu söylemiştir. Tirmizi: Alimlerin bir kısmı: Taharrum tekbirinin faziletini kaçırmak endişesi varsa koşulur, demişler hatta bunlardan koşarcasına hızlı yürüyen olmuştur Bir kısım alimler ise, bu endişe olsa bile koşmayı mekruh saymış ve sükunetle, vakarla gitmeyi tercih etmişlerdir Ahmed ve İshak bununla hükmederek: Uygulama. Ebu Hureyre (r.a.)'in hadisine göredir, demişlerdir. Bu arada İshak: Taharrum tekbirinin faziletini kaçırmaktan korkan kişinin hızlı yürümesinde beis yoktur, demiştir . \"Yetişebildiğiniz kadarını (imamla) kılınız.'' parçasına gelince; Cemaatla namaz kılmanın fazileti olan yirmiyedi derecelik üstünlük, namazın bir kısmında cemaate yetişen kimse için de vardır, diyen cumhur. bu hadisi delil göstermiştir. Onlara göre başından itibaren bütün namazı cemaatle kılmanın dereceleri daha mükemmel olmakla beraber, namazın en küçük bir parçasında, mesela son oturuşta cemaata yetişen kişi de cemaatin faziletine kavuşmuş olur. Bazı alimlere göre cemaatin faziletine kavuşmuş sayılabilmek için namazın en az bir rek'atının cemaatla kılınması gerekir. \"Yetişemediğinizi (kendiniz) tamamlayınız.'' parçasının manası şudur: imam'ın sizden önce kılmış oldugu rek'atları selam verince kılınız. parçadaki: \" .. tamamlayınız'' lafzı. kişinin imamla kıldıgı kısmın, namazın baş kısmına mahsub edildiğine ve imam selam verdikten sonra kılınacak kısmın, namazın son kısmına mahsub edildiğine delalet eder. (İmam selam verince sen selam vermeden eksik rekat sayısınca namaz kılarsın. bir rekat eksikse imam selam verince sen telbir alıp teşehüdden kıyama kalkıp fatihayla başlayıp rüku, kavme iki secde ve teşehüd'den oluşam bir rekat kılıp selam verirsin.) Bu hususta alimler arasında ihtilaf vardır: Cumhüra göre geç kalan şahsın imama yetiştiği rek'atler, onun için namazın baş kısmıdır. Ali bin Ebi Talib, Said bin el-Müseyyeb, Hasan-i Basri, Mekhul, Ata', Zühri, Evzai ve İshak, bununla hükmetmişlerdir. Delilleri Darekutni'nin Katade'den rivayet ettiği Ali bin Ebi Talib (r.a.)'in şu haberidir: ''İmamla beraber yetiştiğin miktar, senin namazının evvelidi ...İmamın senden önce okuduğu Kur'an'ı sen tamamla.'' Alimlerin ikinci delili, Ebu Hureyre (r.a.)'in Bahsi geçen hadisidir. Bunların üçüncü delili şudur: ''Akşam farzında imamla bir rek'at kılabilen kişi, imam'ın selamından sonra kalkar, bir rek'at kıldıktan sonra teşehhüde oturur, sonra üçüncü rek'ate kalkar. Bu hususta bütün alimler müttefiktirler. Eğer imam'ın daha önce kıldığı rek'atler geç kalan şahsın namazının baş kısmına mahsub edilmiş olsaydı, imam selam verdikten sonra ayağa kalkan bu şahıs, bir rek'at kıldıktan sonra oturmamalıydı. Çünkü akşam namazının ilk rek'atinden sonra oturmak yoktur. Süfyan-i Sevri, Ebu Hanife, Ahmed, Mücahid ve İbn-i Sirin'in dahil olduğu bir cemaata göre geç kalan şahsın imama yetiştiği rek'atlar, şahsın namazının son kısmına mahsub edilir Hatta: İki rek'at kaçıran kişi, imam selam verdikten sonra kalkıp bunları kılarken kıraatını açıktan okumalı, Fatiha'ya sure eklemelidir, demişlerdir. Bunların delili ise Ebu Hureyre (r.a.)'in mezkur hadisinin bazı rivayetlerinde bu parçadaki; Fe etimmu ='' tamamlayınız.'' emri yerine; Fekdu = \"kaza ediniz,'', emrinin hulunuşudur. Onlar: kaza ancak kaçırılmış olan için kullanılır, demişlerdir. Cumhurun görüşü kuvvetlidir. parçadaki iki lafız arasında bir çelişki yoktur. Çünkü kaza kelimesi: eda vaktinde kılınmayan namazın sonradan kılınmasında kullanıldığı gibi, namazın asıl vaktinde kılınmasında da kullanılır. Yani eda ile eş anlamlıdır. Nitekim Kur''an-ı Keriın'in şu ayetlerinde 'Kaza' kelimesi 'Eda' manasında kullanılmıştır; ''Namazı tamamladığınız zaman ... \" (Nisa: 103) ''Menasikinizi tamamladığınız zaman ... \" (Bakara: 200) Cuma namazı eda edilince ..'' (Cum'a: 10) Rivayetlerin arasını bulmak için; --fe etimmu-- cümlesi ile; --fekdu-- cümlesi aynı manaya yorumlanır. Ve kaza kelimesi kalan rek'atları yapmak demektir. Esasen rivayetlerin ekseri; --Fe etimmu-- 'dur. Beyhaki: --Fe etimmu-- diyenler çogunluktadır. Ebu Hureyre (r.a.)'e daha sıkı temasta bulunmuşlar ve hıfz yönünden daha kuvvetlidirier. Bu nedenle; --Fe etimmu-- rivayeti öncelik kazanır, demiştir. HADİSİN FIKIH YÖNÜ : 1- Namaza giderken koşmak yasaktır. 2- Sükunet ve vakarla namaza gidilmelidir. 3- İmamla namazın bir parçasını kılmaya yetişen kişi için cemaat fazileti vardır. 4- İmam namazın neresinde olursa olsun ona uymak caizdir. 5- İmamla beraber kılınan rek'atler, namazın baş kısmına mahsub edilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 776,
			"arabicnumber": 776,
			"text": "Ebu Said-i Hudri (r.a.)'den rivayet edildiğine göre kendisi Resulullah (Sallallahu Aleyhi ve Sellem)'den, şöyle buyurduğunu işitnıiştir : — «Allah'ın, günahlara keffaret ve hasenatı artırmaya vesile kıldığı şeyleri size göstereyim mi?» Sahatoiler: — Göster, Ya Resulallah! dediler. Resulullah (Sallallahu Aleyhi ve Sellem): — Güçlüklere rağmen abdesti tam olarak almak, mescidlere doğru çok adım atmak ve bir namazdan sonra diğer namazı beklemektir.» buyurdu.\" Not: Zevaid'de: Ebu Said (r.a.)'in hadisini İbn-i Huzeyme ve İbn-i Hibban da rivayet etmişlerdir. Sahih-i Müslim'de ve başka hadis kitabıarında bu hadisin şahidi vardır, denilmiştir. Müellif, 'Abdestte İsbağ' babında 427 nolu bu hadisi rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 777,
			"arabicnumber": 777,
			"text": "Abdullah (bin Mes'ud) (r.a.)'den rivayet edildiğine göre şöyle demiştir : Kim yarın müslüman olarak Allah'a kavuşmaktan sevinirse şu beş vakit namazını ezan okunan yerde muhafaza etsin. Çünkü bu namazlar hidayet sünnetlerindendir ve şüphesiz Allah, Nebiiniz (Sallallahu Aleyhi ve Sellem)'e hüda (= hidayet) sünnetlerini meşru kılmıştır. Andolsun ki, eğer her biriniz kendi evinde namaz kılmış olsaydı siz Nebiiniz (Sallallahu Aleyhi ve Sellem) sünnetini terketmiş olurdunuz. Ve Nebiiniz (Sallallahu Aleyhi ve Sellem) sünnetini terketmiş olsaydınız, şüphesiz dalalete düşmüş olurdunuz. Vallahi ben, bizleri (sahabileri) bilirim ki münafıklığı bilinen münafıklardan başka hiç kimse cemaattan geri kalmazdı. Vallahi saf'a girinceye kadar iki kişi arasında tutularak mescide getirileni bilirim. Hiç kimse yoktur ki tertemiz ve güzelce abdestini alıp mescide gider, içinde namaz kılar da attığı her adımla Allah onu bir derece yükseltmesin ve her adımla onun bir günahını affetmesin.\" Diğer tahric: Müslim, mesacid; Ebu Davud ve Nesai de İbn-i Mes'ud (r.a.)'dan mevkuf olarak rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 778,
			"arabicnumber": 778,
			"text": "Ebu Said-i Hudri (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir : «Kim namaza gitmek üzere evinden çıktıktan sonra şu duayı okursa, Allah, rahmetiyle ona yönelir ve yetmiş bin melek, onun günahlarının bağışlanmasını (Allah'tan) diler: 'Allahım! Senden istiyenlerin Senin katındaki hakkı için gerçekten Senden istiyorum. Ve şu yürüyüşüm hakkı için Senden istiyorum. Çünkü ben ne kibirlenmek ne de böbürlenmek için ve ne görsünler diye ne de duysunlar diye (evden) çıkmadım. Ve ben Senin kızmandan sakınmak ve Senin rızanı taleb etmek için çıktım. Bu sebeple Cehennem ateşinden beni korumanı ve günahlarımı örtmeni Senden istiyorum. Şüphesiz Senden başka hiç kimse günahları örtemez.'.» Not: Zevaid'de: Bu hadisin isnadı zayıf raviler zincirinden kuruludur. Atiyye el-Avfi, Fudayl bin Merzuk ve el-Fadl bin el-Muvaffak adlı ravilerin hepsi zayıftır. Lakin İbn-i Huzeyme kendi sahihinde bu hadisi Fudayl bin Merzuk tarikinden rivayet etmiştir. Hadis İbn-i Huzeyme yanında sahihtir, denilmiştir. AÇIKLAMA : Hadiste geçen : Senden isteyenlerin Senin katındaki hakkı için ... \" ve '' ... Şu yürüyüşün hakkı için ... '' cumlelerinde geçen Hak: kelimesi, Allah tarafından kul'a ödenmesi gerekli kazanılmış bir istihkak demek değildir. Çünkü Allah, hiç b(r şeyi yapmaya mecbur değildir. Faili Muhtar'dır. Dilediğini yapar. Tam irade sahibidir. Hiç bir kulun ödenmesi gerekli herhangi ıbir hakkı Allah katında yoktur. Kulun hayat boyunca yaptığı tüm kulluk görevleri ve ibadetleri başarması, Allah'ın inayehyledir. Ve bütün hayır kazandıran işleri Allah'ın kendisine vermiş qlduğu sayısız ni'metlerden mesela bir akıl ni'metine denk gelemez. Bu sebeple hadiste geçen Hak'tan maksad; Allah'ın; dilekte bulunan mu'min kullarına lütuf ve ihsanı ile ve tamamen karşılıksız bir ikram mahiyetinde olmak üzere vereceği va'd buyurduğu fazilettir. Kişi, 'Hak' kelimesini kullanarak dua ederken şunu demek istiyor: Allah'ım! İhtiyacımın giderilmesi ve dileğimin kabulü uğrunda ben Senden dilekte bulunanlar için va'dettiğin yüce katındaki fazilete tevessül ederek Senden dilekte bulunuyorum. 'Hak' kelimesi bu manaya yorumlanınca sakıncalı bir tarafı kalmamakla beraber, bu inceliklere aklı ermeyen kimselerin zihinlerinde yanlış manalara yer verileceği endişesiyle Hanefi alimleri, ''Şunun hakkı için... '' gibi sözlerle dua etmekten kaçınmışlar ve bu tür kelimeleri mutlak kullanmayı kerahetten helli görmemişlerdir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 779,
			"arabicnumber": 779,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir : «Karanlıklarda mescidlere çok (defa) yürüyenler, işte onlar Allah'ın rahmetine çokça dalanlardır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 780,
			"arabicnumber": 780,
			"text": "Sehl bin Sa'des-Saidi (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir : «Gece karanlıklarında (mescidlere) çok (defa) yürüyenler, kıyamet günündeki tam nurla sevinsinler.» Bu hadisi Hakim de rivayet ederek sahih olduğunu söylemiştir. İbn-i Huzeyme ve Beyhaki' de rivayet etmişlerdir. Zevaid yaz.arı da isnadının hasen olduğunu söylemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 781,
			"arabicnumber": 781,
			"text": "Enes bin Malik (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Karanlıklarda mescidlere çok (defa) yürüyenleri kıyamet günündeki tam nurla müjdele.» Not: Zevaid'de Enes (r.a.)'in hadisine ait isnadın zayıf olduğu bildirilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 782,
			"arabicnumber": 782,
			"text": "Ebu Hureyre (r.a.)'den şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) buyurduki: «Mescidden en uzak olanların (uzaklık derecesine göre) sevabı daha büyüktür.» Diğer tahric: Ahmed, Ebu Davud ve Beyhaki tahric etti. el-Hakim rivayet ederek sahih olduğunu söylemiştir. AÇIKLAMA : Hadisten kasdedilen mana şudur: Kaldığı yer mescidden daha uzak olanın, cemaata gelişi dolayısıyla kazandığı sevab, durduğu yer mescide o kadar uzak olmayanın cemaat sevabından daha büyüktür. Böylece kişinin meskeni veya bulunduğu yer mescidden uzaklaştıkça sevabı daha çok olur. Müslim'in Ebu Musa (r.a.)'den rivayet ettiği bir hadis'e göre Resulullah (s.a.v.) şöyle buyurmuştur: ''Namaz hakkında sevabı en büyük olan insan, namaz yolu en çok uzak alandır.'' Hadisler, meskeni mescidden uzak olan kimseler için bir teselli kabilindendir. Çünkü meskeni mescide yakın olanın mescidde durması ve orada bol bol namaz kılması kolaydır, sevabı da buna göre çoktur. Evi mescidden uzak olan kimse bunlardan mahrumdur. Ona teselli olsun diye mescide gelip gitmek için karşılaştığı meşakkat ve çok adım atması karşılığında bol sevab kazanmakla müjdelenmiştir. Hadislerden maksad, meskenleri mescidlerden uzaklaştırmak değildir. Çünkü Nebi (s.a.v.)'in evi mescide çok yakındı. Bu nevi hadisler: 'Oruçlu adamın ağız kokusunun Allah indinde misk kokusundan daha güzel olduğunu' bildiren hadis gibidir. Çünkü o hadiste ağız kokusunu bozmaya teşvik etme anlamı yoktur'. Maksad, oruçlunun, ağzına bir şey almaması nedeniyle bozulan ağız kokusu dolayısıyla teselli edilmesi ve çokça sevab kazanmakla mÜjdelenmesidir. HADISİN FIKIH YÖNÜ : Hadis, mescidlere çok adım atmanın, sevabı bol olan ibhdetIerden olduğuna delalet eder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 783,
			"arabicnumber": 783,
			"text": "Ubeyy bin Ka'b (r.a.)'den şöyle demiştir: Ensardan bir adam vardı. Onun evi, Medine'nin (mescidden) en uzak olan eviydi. Bununla beraber, Resulullah (Sallallahu Aleyhi ve Sellem) ile beraber namaz kılmayı hiç kaçırmazdı. Ubeyy (r.a.) demiştir ki: Ben, ona acıdım ve: — Ya Filan! Eğer sen bir merkep satın alsaydın, seni şiddetli sıcaktan korurdu. Ayağına taş değip incinmesinden yüksek tutardı ve yerin zehirli hayvanlarından korurdu, dedim. Adam: — Vallahi evimin Muhammet) (Sallallahu Aleyhi ve Sellem)'in evinin bitişiğinde olmasından hoşlanmam, dedi. Ubey demiştir ki: Ben adamın sözünü istiskal ederek alındım. Hatta Nebi (Sallallahu Aleyhi ve Sellem)'in evine vararak, dediklerini Ona anlattım. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) adamı çağırtıp ona sordu. Adam da, bana dediğinin mislini Ona zikretti ve (attığı adımların) izinden sevab umduğunu anlattı. Resulullah (Sallallahu Aleyhi ve Sellem) de Ona: «Gerçekten sana, saklayıp umduğun (sevab) vardır.» buyurdu.\" Tahric: Bu hadisi Müslim, Euu Davud ve Beyhaki de az bir lafız farkıyla rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 784,
			"arabicnumber": 784,
			"text": "Enes hin Malik (r.a.)'den rivayet edildiğine göre şöyle demişlir: (Ensardan) Bani Selime kabilesi, (Nebi (Sallallahu Aleyhi ve Sellem)'in mescidden uzak kalan) evlerinden çıkarak mescidin yakınına gelmek istediler. Nebi (Sallallahu Aleyhi ve Sellem), (Medine'yi muhafaza eden bu evleri tahliye etmekle) Medine çevresini boş bırakmalarını arzu buyurmadı. Ve Nebi (Sallallahu Aleyhi ve Sellem) onlara : «Ey Beni Selime! Sizler, (mescide gelip giderken) attığınız adımlarınızın izlerini hesaba katmayacak mısınız?» buyurdu. Bunun üzerine onlar, yerlerine ikamet ettiler. Tahric: Bu hadisi Buhari de rivayet etmiştir. Müslim ise, aynı olayı anlatan bir hadisi Cabir bin Abdillah (r.a.)'den, başka lafızlarla, müteaddit senedlerle rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 785,
			"arabicnumber": 785,
			"text": "(Abdullah) İbn-i Abhas (r.a.)'den şöyle demiştir: Ensarın evleri mescidden uzaktaydı. Yakına gelmek istediler. Bunun üzerine; «Ve biz, onların önden gönderdiklerini ve eserlerini yazarız.» ayeti nazil oldu. İbn-i Abbas demiştir ki: Onlar da (evlerinde) kaldılar.\" Not: Zevaid'de: Bu hadis mevkuftur. Senedinde İbn-i Harb olan Simak vardır. İbn•i Main ve Ebu Hatim, onu sika saymışlarsa da Ahmed: Onun hadisleri mustaribtir, demiştir. Yakub bin Şeybe de: Simak'ın yalnız İkrimi'den olan rivayeti mustarib olup. başkalarından olan rivayeti yararlıdır, demiş diye bilgi vermiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 786,
			"arabicnumber": 786,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine güre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir : «Adamın (mescidde) cemaatla kıldığı namaz (ın sevabı, tek başına) evinde kıldığı ve çarşısında kıldığı namaz (ın sevabın) dan yirmi küsur derece fazladır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 787,
			"arabicnumber": 787,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Cemaatla kılman namazın birinizin tek başına kıldığı namaza üstünlüğü yirmi beş cüzdür.» Tahric: Müellifin iki ayrı senedIe rivayet ettiği Ebu Hureyre (r.a.)'in hadisini Buhari, Müslim, Ebu Davud ve Tirmizi de uzun ve kısa metinler halinde ve az lafız farkıyla rivayet etmişlerdir. Bazı rivayetlerde: ''...yirmibeş derece... '' bir kısım rivayetlerde: ''...yirmibeş cüz... '' ve Müslim'in bir rivayetinde: ''...yirmibeş namaz...'' ifadeleri bulunmaktadır. Bu nedenle 'derece' ve 'cüz' kelimeleri, namaz anlamına yorumlanmıştır. Ebu Davud'un sünenindeki 'Namaza yürüyerek gitmenin fazileti hakkında gelen hadisler babı'nda rivayet olunan bu hadisin açıklamasını yapan el-Menhel yazarı şöyle der: AÇIKLAMA : '''Rivayetlerde: ''...yirmibeş derece... '', ''...yirmibeş cüz'...'' Ve ''...yirmibeş namaz, .. \" tabirierinin değişik oluşunun, ravilerin tasarrufundan ileri geldiği kanaatındayım, Hadisin manası şudur: Adamın mescidde cemaatla kıldığı namazın sevabı, onun evde ve çarşıda kendi başına kıldığı yirmibeş namazın sevabından fazladır, Burada 'Adam' tabiriyle kadının bu hükümden istisna edilmesi kasdedilmemiştir, Çünkü kadının mescide gitmesi, bazı şartlarla caiz olduğuna göre aynı sevab onun için de mevcuttur. Hadisin zahirine göre evde ve çarşıda kılınan namaz, cemaatla. da kılınmış olsa hüküm aynıdır. Lakin, bu mana kasdedilmemiştir. Maksad, mescidde cemaatla kılınan namazın, başka yerlerde tek başına kılınan namazdan üstünlüğünü ifade etmektir. Çünkü konu budur. Hadiste bu durumun açıkca belirtilmemesinin sebebi, mesciddeki cemaata girmiyenlerin ekseriyetle namazı tek başlarına kılmaları olabilir. Hal böyle olunca mesciddeki cemaat ile ev ve çarşıdaki cemaatın faziletinin eşit olması gerekmez. Bilakis çarşıdan başka yerde kılınan namaz, çarşıda kılınan namazdan efdaldır. Çünkü çarşının, şeytanların yeri olduğuna dair hadis vardır. Bununla beraber evde ve çarşıda namazı cemaatla kılmak, tek başına kılmaktan evladır. Bazı rivayetlerde bulunan 'Dereceler' ve 'Cüz'ler', 'Namazlar' manasını taşır. Çünkü bazı rivayetlerde Derece ve Cüz' yerine 'Namaz' kelimesi kullanılmıştır. Şu halde mescidde cemaatla kılınan namazın sevabı, evde ve çarşıda kılınan yirmibeş namazın sevabından fazladır. İlk hadisteki: ''...yirmibeş küsur...'' parçasında küsur diye karşılık verdiğimiz 'Bid' kelimesi, birden veya üçten ona kadar olan sayılar için kullanılır. Diğer rivayetlerde yirmibeş sayısı kesin olarak geçtiği için, buradaki küsurdan maksad, beştir. İkinci hadisteki 'Cüz' kelimesi ise, bir parça demektir. Başka rivayetlerde bu kelime yerine derece veya namaz kelimeleri bulunduğu için 'Cüz' kelimesi ile namaz kasdedilmiştir. HADİSİN FIKIH YÖNÜ : 1- Cemaatla kılınan namaz, tek başına kılınan namazlardun üstündür. 2- Farz namazıarı evlerde ve çarşılarda kılmak caizdir. 3- Farz namazların cemaatla kılınması şart / farz değildir. Tek başına da kılınabilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 788,
			"arabicnumber": 788,
			"text": "Ebu Said-i Hudri (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir : «Adamın (mescidde cemaatla kıldığı namazın sevabı) evinde (tek başına) kıldığı namaz'ın sevabından yirmibeş derece fazladır,» NOT: Buhari'nin Ebu Said-i Hudri (r.a.)'den merfu' olarak rivayet ettiği hadisin lafzı şöyledir; ''Cemaat namazı, münferidin namazından yirmibeş derece ile efdal olur.\" Ebu Davud'un rivayetindeki hadisin metni ise şöyledir; ''Cemaatla kılınan namaz, (münferiden) kılınan yirmibeş namaza denk gelir .... '' Ebu Davud'un rivayetindeki önemli özellik, derece ve cüz' yerine namaz kelimesinin kullanılmasıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 789,
			"arabicnumber": 789,
			"text": "Abdullah İbn-i Ömer (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir : «Adamın cemaatla kıldığı namaz, adamın kendi başına kıldığı namazdan yirmiyedi derece üstündür.» Diğer tahric: Buhari, Müslim ve Tirmizi de, bu hadisi az lafız farkıyla rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 790,
			"arabicnumber": 790,
			"text": "Ubeyy bin Ka'b (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Adam'ın cemaatla kıldığı namaz, adamın tek başına kıldığı namazdan yirmi dört veya yirmibeş derece üstündür.» Diğer tahric: Bu hadisi Ahmed, Ebu Davud, Nesai, İbn-i Huzeyme ve İbn-i Hibban da rivayet etmişlerdir. Yahya bin Muin ve Zühri hadisin sahih olduğunu belirtmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 791,
			"arabicnumber": 791,
			"text": "Ebu Hureyre (r.a.)'deıı şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) buyurdu ki: «Vallahi içimden öyle arzu ettim ki namaza durulmasını emredeyim de ikamet getirilsin. Sonra bir adama emredeyim halka namaz kıldırsın. Bu emirden sonra beraberlerinde odundan demetler bulunan bir kaç adamı cemaata (özürsüz) gelmeyen güruha götürüp de üzerlerine evlerini ateşle cayır cayır yakayım.» Diğer tahric: Buhari, Müslim, Ebu Davud, Nesai ve Ahmed",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 792,
			"arabicnumber": 792,
			"text": "(Abdullah) bin Ümmi Mektum (r.a.)'den rivayet edildiğine güre şöyle demiştir : Ben, Nebi {Sallallahu Aleyhi ve Sellem)'e dedim ki: Ben yaşlı, a'ma, evi (mescidden) uzak bir kimseyim. Bana yardım edip mescide götürecek yedekçim de yoktur. (Cemaata gelmemem için) Bir ruhsat bulur musun? Nebi (Sallallahu Aleyhi ve Sellem) : -Sen ezan (sesini) işitiyor musun?» diye sordu. Ben: Evet, dedim. O: «Ben senin için bir ruhsat bulamam.» buyurdu.\" EBU DAVUD HADİSLERİ VE AÇIKLAMA: 552 — 553",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 793,
			"arabicnumber": 793,
			"text": "(Abdullah) İbn-i Abbas (r.a.)'den şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) buyurdu ki : «Ezan sesini işitip de oraya (özürsüz) gitmeyenin namazı (makbul) olmaz.» Diğer tahric: İbn-i Hibban ve el-Hakim de rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 794,
			"arabicnumber": 794,
			"text": "İbn-i Abbas ve İbn-i Ömer (r.anhum)'dan rivayet edildiğine göre kendileri Nebi (Sallallahu Aleyhi ve Seliem)'i minber ağaçları üzerinde şöyle buyururken işitmişlerdir ; «Vallahi bazı kavimler cemaatları terketmekten vaz geçecekler ya da Allah onların kalblerini mühürleyecektir. Sonra da muhakkak gafillerden olacaklardır.» AÇIKLAMA : Nesai, bu hadisi 'Cum'a' bahsinde rivayet etmiştir. Oradaki rivayette Bahsi geçen tehdid Cum'a namazını terkedenler hakkında buyurulmuştur. Camiu's-Sağir yazarının beyanına göre Ahmed, Müslim, Nesai ve İbn-i Mace bu hadisi rivayet etmişlerdir. Nesai'nin rivayetinde; ''... Minberinin ağaçları üzerinde ... \" buyurulmuştur Nebi (s.a.v.)'in minberi üç basamaklıydı Üçüncü basamak üzerinde otururdu. Mübarek sırtını üç ağaca dayardı Minberin iki tarafında da birer ağaç bulunurdu. Minberin yüksekliği, genişliği, uzunluğıı v.s. özellikleri hakkında geniş malumat inşaaIlah 'Cum'a namazı' bahsinde verilecektir Sindi şöyle der: Kurtubi: Kalbi mühürlemek, Allah'ın, söz konusu kavimlerin kalbIerinde yaratacağı cehalet, kasvet ve cefadır, demiştir. El-Kadı da Mesabih şerhinde: Hadiste buyurulan iki şeyden birisi mutlaka gerçekleşecektir. Ya cemaatları terketmekten vaz geçip cemaata devam edeceklerdir Ya da Allah, onların kalbIerini mühürleyecektir. Çünkü cemaatları bırakmayı alışkanlık haline getirmek, kalbi karartır ve insanı ibadetten soğutur, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 795,
			"arabicnumber": 795,
			"text": "Usame bin Zeyri (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Vallahi bazı adamlar cemaatı terketmekten vaz geçecekler. Yahut şüphesiz Een, onların evlerini yakacağım.-\" Not: Zevaid'de: Bu hadisin isnadında tedlisçi olan el•Velid bin Müslim ed-Dimışki bulunur. Ravi Osman'ın hali bilinmiyor. Hadis metninin manası Buhari, Müslim ve haşka kitaplarda mevcuttur. deniliyor. ALİMLERİN, NAMAZLARI CEMAATLA KILMAK HAKKINDAKİ GÖRÜŞLERİ 1- Vakıt namazlarını cemaatla kılmak farz-ı ayn'dır. Ata', Evzai, İshak, Hanbeli'ler, Ebu Sevr, İbn-i Huzeyme, İbnü'l-Münzir, İbn-i Hibban ve Zahiriyye mezhebi mensupları bu görüştedirler. Onların delilleri 791 nolu Ebu Hureyre (r.a.)'in hadisi ve benzeri hadislerdir. Namazın sıhhati için cemaat şart mıdır? deği! midir? diye bu gruptaki alimler arasında da ihtilaf vardır: Zahiriye mezhebi İmam-ı Davud ve kendisine tabi olanlar cemaatla kılmayı, namazın sıhhatının şartlarından saymışlardır, İbn-i Hazm: Ezan sesini işitebilen erkeklerin, namazlarını mescidde cemaatla kılmaları farzdıf. Özürsüz olarak ve bile bile bunu terkedenin namazı sahih degildir. Ezan sesini işitmeyecek durumdaysa, en az bir kişiyle cemeaat kurup namaz kılması farzdır. Böyle yapmasa, kendi başına kılacagı namaz sahih degildir Şayet cemaat olacak hiç kimseyi bulamazsa münferiden namaz kılabilir. Şer'i mazereti olanın kendi başına namaz kılması sahihtir, demiştir. Bu gruptaki diger alimlere göre cemaat farz-ı ayn olmakla beraber kendi başına kılınan namaz sahihtir. 2 - Cemaat farz-ı kifayedir. Bazı Şafii alimleriyle Malikiler, bu görüşü benimsemişlerdir. Hanefi alimlerinden Tahavi ve Kerhi de bunu seçmişlerdir. Bunlar da birinci grubun delillerine dayanmışlardır. Ancak bu hükmü farz-ı ayn'dan farz-ı kifaye'ye çevirici karineler bulunduğu için: Farz-ı ayn'dır, dememişlerdir. Gösterdikleri karine: ''Cemaatla kılınan namaz, tek başına kılınan namazdan yirmibeş derece efdaldır.'' mealindeki hadistir. Çünkü bu hadis, tek başına kılınan namazın slhhatini ifade eder. Şu halde delillerden çıkarılan vücub, kifaye içindır. 3 - Cemaat sünnet-i meıekkededir. Hanefi, Şafii ve Maliki mezhebIerinin meşhur görüşleri budur Bunların delilleri, cemaatla kılınan namazın, tek başına kılınan namazdan yirmibeş derece üstün olduğunu ifade eden İbn-i Ömer (r.a.)'ın (789 nolu) hadisi, Ebu. Said-i Hudri (r.a.)'in 788 nolu hadisi ve Ebu Hureyre (r.a.)'in (786 ve 787 nolu) hadisleridir. Bu alimler: Cemaat namazının münferid namazından efdal oluşu, münferid namazında da faziletinin bulunduğuna delildir. demişlerdir. Cemaata gelmeyenlerin evlerinin Nebi (s.a.v.) tarafından yakılması arzusuna ait 791 nolu hadise gelince; buna birden fazla ceyap verilmiştir. El-Menhel yazarı cevapların bir kısmını şöyle sıralamıştır: 1- Evlerin yakılmasıyla ilgili hadis, özürsüz olarak cemaattan geri kalan ve tek başlarına namaz kılan münafıklar hakkındadır. Nitekim İbn-i Mes'ud (777 nolu) hadiste: ''Ben bilirim ki besbelli münafıklardan başka hiç birimiz cemaattan geri kalmazdı,'' demiştir. 2- Nebi (s.a.v.): \"Cemaat'tan geri kalanların evlerini yakmak arzusu içinden gelir.'' buyurmuş ama bunu gerçekleştirmemiştir. Eğer gerçekleşmesi vacib olsaydı terketmezdi. 3- Kadı iyad: Namazı cemaatla kılmak ilk zamanlarda farz-ı ayn kılınmış. Ta ki münafıkların cemaattan geri durmaları önlensin. Sonra bu vucub neshedilmiştir, demiştir. El-Fetih yazarı: Cemaat fazileti hakkında varid olan hadisler, neshe delalet eder. Çünkü efdaliyet tek başına kılınan namazda fazlletin aslının bulunmasını gerektirir. Faziletin aslının oluşu, tek başına kılınan namazın cevazına delalet eder, demiştir. Cemaatın sünnet olduğuna hükmeden cumhur'un görüşü, açık olan görüştür. Çünkü bu takdirde bütün delillerin arası bulunur. Hiç birisi ihmal edilmemiş olur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 796,
			"arabicnumber": 796,
			"text": "Aişe (r.anha)'dan şöyle söylemiştir: Resulullah (Sallallahu Aleyhi ve Sellem) buyurdu ki: «Eğer halk yatsı ve sabah namazları cemaatiarındaki fazileti bilselerdi onlar (için mescid)'e emekliye emekliye de olsa gelirlerdi.» AÇIKLAMA 797’de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 797,
			"arabicnumber": 797,
			"text": "Ebu Hureyre (r.a.)'den şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) buyurdu ki: «Şüphesiz münafıklara en çok ağır gelen namaz, yatsı ve sabah namazlarıdır. Eğer bunlardaki sevabı bilmiş olsaydılar bu iki namaz (için mescid)'e emekliye emekliye de olsa gelirlerdi.» AÇIKLAMA : Ebu Hureyre (r.a.)'in hadisini Buhari az lafız farkıyla ve 791 nolu hadis metni ile birlikte, Müslim'de buradaki metni aynen ve 791 nolu metni az lafız farkıyla ve bir metin halinde rivayet etmişlerdir. Ebu Davud da benzer bir metni Ubeyy bin Ka'b'dan rivayet etmiştir. EI-Menhel yazarı: 'Yatsı ve sabah namazlarının faziletinin daha üstün olmasının sebebi, ikisinin de uyku vaktine rastlamasıdır. Uykusunun tatlı olduğu zamanda Allah Teala için ancak takva sahibi mu'min yatağından kalkar. Münafık adam lezzetli uykusunu bırakıp namaza durmaz. İşte bu sebeple yatsı ve sabah namazının fazileti daha çoktur. İkinci hikmet, bu iki namazın gece karanlığında oluşudur. Gösteriş için namaz kılan münafıkların gayesi, bu iki namazda kolayca gerçekleşemez. Çünkü gece karanlığında pek az kişi onları görebilir. Münafıkların dini bir amacı bulunmuyor ki onları cemaata gitmeye zorlasın. Bu nedenle anılan iki namaza gitmekte münafıkların ne dini ne de dünyevi gayeleri bulunur' demiştir. Ebu Hure yre (r.a.)'in hadisinde geçen \"...münafıklar...'' kelimesi ile zahiren müslüman ve kalben kafir olan hakiki münafıklar mı kasdedilmiş yoksa kalben de mu'min olup günah münafıklığına düşenler mi kasdedilmiştir? Kastalani ve Ayni: Buradaki münafık tabiriyle küfür münafıkları degil, günah münafıkları kasdedilmiştir. Tehdid ve teşdid için mu'minlere münafık denmiştir. Çünkü bu mu'minler, mescide gelmezler. Hiç bir özürleri olmadığı halde namazıarını evlerinde kılarlardı. Nitekim Ebu Hureyre (r.a.)'in Ebu Davud'un süneninde rivayet olunan hadisinde: \".\" Sonra hiç bir illeti olmadığı halde namazlarını evlerinde kılan kavme gideyim ... '\" buyurulmuştur. O halde bunlar, mu'min kimselerdir. Tehdid için onlara münafık ismi verilmiştir, demişlerdir. '' ... Münafıklar...\" tabiriyle hakiki münMıkların kasdediImiş olması da muhtemeldir. AbduIIah İbn-i Mes'ud (r.a.)'İn 779 nolu hadisi bu ihtimali te'yid eder. Çünkü İbn-i Mes'ud (r.a.), o hadiste; 'Valiahi münafıklığı besbelli olan münafıklar hariç hiç birimizin cemaattan geri kalmadığını bildim' demiştir. Buna göre mü'minlerden özürsüz olarak cemaattan geri kalan olmamıştır. Kanaatımca üçüncü bir ihtimal olarak \" ... Münafıklar ... '\" tabiriyle daha geniş kapsamlı bir anlam kasdedilmiş olabilir. Yani hem küfür münafıkları hem günah münafıkları kasdedilmiş olabilir. Kalben inanmayanlar mescide gitmekten geri kaldıkları gibi kalben inanıp cemaata özürsüz gitmeyenler de olmuş olabilir. Bu takdirde Ebu Hureyre (r.a.)'in hadisi ile İbn-i Mes'ud (r.a.)'in hadisinin araları bulunmuş olur. İbn-i Mes'ud (r.a.) hakiki münafıklardan başkalarının cemaattan geri kaldıklarından haberi olmamış olabilir. Ebu Hureyre (r.a.) bundan haberdar olmuş olabilir. İki gruba da,. bilhassa yatsı ve sabah vakitlerinde mescide giderek bu namazları cemaatla kılmak çok ağır gelmiştir. Nebi (s.a.v.) ; ''Eğer münafıklar anılan iki namazı mescidde cemaatla kılmanın faziletini şuurlu olarak bilselerdi emekliye emekliye bile olsaydı mescide giderek cemaatla kılarlardı.,. buyurmak istenmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 798,
			"arabicnumber": 798,
			"text": "Ömer bin el-Hattab (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyururdu, demiştir: «Kim kırk gece mescidde cemaatla namaz kılar ve bu sürece yatsı namazının ilk rek'atini kaçırmazsa, Allah bununla o kimse için Cehennem ateşinden bir azadlık yazar.» Not: Zevaid'de: Hadisin isnadında mürsellik ve zaaf vardır. Tirmizi ve Darekutni: Umare, Enes (r.a.)'e yetişmemiş ve onunla buluşmamıştır. Diğer ravi İsmail de tedlis ederdi, demişlerdir. denılir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 799,
			"arabicnumber": 799,
			"text": "Ebu Hureyre (r.a.)'den şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) buyurdu ki: «Şüphesiz biriniz mescide girdiği zaman, namaz onu alıkoyduğu müddetçe namazda (imiş gibi sevab kazanmış) olur. Ve sizden birisi namaz kıldığı yerden ayrılmadığı, abdesti bozulmadığı ve kimseye eziyet etmediği müddetçe melekler: 'Allah'ım! Buna mağfiret eyle. Allah'ım! Buna rahmet eyle. Allah'ım! Bunun tevbesini kabul eyle' diyerek dua ve istiğfar eylerler.» Tahric: Bu hadisi Beyhaki, Buhari, Tirmizi, Ebu Davud uzun ve kısa metinler halinde rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 800,
			"arabicnumber": 800,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir : «Gurbetteki adam aile efradının yanına döndüğü zaman kendisinin dönüşüyle, onlar sevindikleri gibi; Allah, mescidleri namaz ve zikir için vatan edinen (buralara devamlı giden) her Müslüman adam (ın bu hali) için sevinir.» Not: 'Zevaid'de isnadının sahih ve ricalinin sika olduğu bildirilmiştir. AÇIKLAMA : Kütüb-i Sitte sahiplerinden yalnız İbn-i Mace'nin rivayet ettiği bu hadisi el-Hakim de rivayet etmiştir. Metinde geçen 'Tebeşnüş'ün aslı iki dosttan birisinin gelişiyle diğerinin sevinmesi, yönelmesi, güleryüz göstermesidir. Cami'us-Sağir'in şerhi es-Siracu'I•Münir'de beyan edildiğine göre Zamahşeri; Burada 'Tebeşbüş'ten maksad; kulun mescidIere gönül bağlayışından Allah'ın razı alması ve bu güzel davranışının O'nun katında makbule geçmesidir, demiştir. Sindi de kelimenin lugat manasını naklettikten sonra; Burada kastedilen mana Allah'ın o kulu zatımı yakınlaştırması, ikram ve in'amda bulunmasıdır, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 801,
			"arabicnumber": 801,
			"text": "Abdullah bin Amr (r.a.)'dan: şöyle demiştir: Biz, Resulullah (Sallallahu Aleyhi ve Sellem) ile beraber akşam namazını kıldıktan sonra (evine) dönen döndü ve bekliyen bekledi. Bir süre sonra Resulullah (Sallallahu Aleyhi ve Sellem) koşarak, hızlı nefes alarak ve diz kapakları açılmış bir halde geldi. Ve (bize) buyurdu ki: «Müjdeleniniz. İşte Rabbiniz gök kapılarından bir kapı açmış, meleklere karşı sizlerle övünerek (onlara): 'Şu kullarıma bakınız. Bir farzı kılmışlar ve diğer farzı belkiyorlar,' buyuruyor.» Not: Zevaid'de; Bu, sahih bir isnaddır. Ricali sıkadır, denmiştir. AÇIKLAMA : Bu hadis de bundan önceki gibi Kütüb-i Sitte sahipierinden yalnız müelliI tarafından rivayet edilmiştir ... Hadis, bir farz namazı cemaatla kıldıktan sonra mescidden çıkmayıp diğer farzı beklemenin üstün faziletini bildirmektedir. Hadiste geçen 'Akkaba' fiili, 'Ta'kib' masdarından alınmadır. Sindi'nin beyanına göre Suyuti; mescidIerde 'Ta'kib' bir farz namazdan sonra mescid içinde diğeri için beklemektir, demiştir. Es-Sihah'ta ise ; Namazda 'Ta'kib', namazı kıldıktan sonra dua, dilek ve benzeri bir şey için oturmaktır, denilmiştir. Hadisin sonundaki Allah'ın buyruğu, ta'kib kelimesi ile Suyuti'nin tarif ettiği mananın kasdedildiğine delalet eder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 802,
			"arabicnumber": 802,
			"text": "Ebu Saiıl-i Hudri (r.a.)'den şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) buyurdu ki : «Siz, adamın mescidlere gidip gelmeyi itiyad haline getirdiğini bildiğiniz (veya) gördüğünüz zaman, onun imanlı olduğuna şahitlik ediniz. Allah Teala; -Şüphesiz Allah'ın mescidlerini ancak Allah'a inan edenler imar ederler.' [Tevbe 18] buyurmuştur.» AÇIKLAMA : Bu hadisi Tirmizi de rivayet ederek hasen olduğunu söylemiştir. Ayetteki 'İmaret' kelimesiyle kastedilen mana hususunda alimler iki görüş rivayet etmişlerdir: Bunlardan bir kısmı: İmaretten maksad, ma'lum olan manadır. Yani mescidleri yapmak, binayı sağlamlaştırmak, onarmak, yıkıldığı zaman yeniden yapmaktır. Kafir kişi bundan men edilir. Hatta bir mescid yapılmasını vasiyet etse bu vasiyeti kabul edilmeyecektir, demişlerdir. İkinci kavle göre imaret'ten maksad mescide girmek ve orada oturmaktır. İmaret, iki kavle göre de mu'minin şanıdır. Özellikle mescidleri ibadetIe ve kılınan cemaat namazlarıyla canlandırmak, en büyük manevi imarettir. Mescidlere namaz için gidip gelmeyi alışkanlık haline getirerek sık sık girip çıkan kimsenin bu hali, mu'min olmasının alametidir. Bunun için de hadiste böyle adamın imanlı oluşuna şehadet ediImesi emrediImiştir. Şehadetten maksad, böyle adamın mu'min olduğunu dille söylemek mi yoksa kalben itikad etmek midir? Sindi'nin beyanına göre Tiy i: ''' ... Şehadet ediniz ... \" emrinin manası: Adamın imanlı olduğuna kesinlikle hükmedin. Çünkü şehadet, kalbteki kanaat ve inanca uygun olarak dille kesin söz söylemektir,' demiştir. Sindi: Tıybi'nin yorumu, hadisin sonunda, hadisin hükmünü te'yid mahiyetinde okunan ayette uygun olan yegane yorumdur. Ancak şöyle hir sorun var: Buhari ve Müslim'in rivayet ettikleri bir hadise göre; Sa'd (r.a.) bir adam hakkında: 'Şüphesiz bu adam mu'mindir.' deyince Nebi (s.a.v.) : \"Veya müslümandır.\" buyurmuştur. Bu hadis, kimsenin imanlı olmasına kesinlikle hükmetmenin nehyine delalet eder. Bu soruna şöyle cevap verilebilir: Sa'd (r.a.)'ın hadisinde bahsi geçen adam, mescidlere müdavim değil idi. Bu sebeple onun imanına kesinlikle hükmedilmemesi arzulanmıştır. Mescide müdavim kimsenin ise imanlı olmasına Ebu Said (r.a.)'in hadisi gereğince hükmedilmelidir. Mezkur problem şöyle de çözülebilir: Ebu Said (r.a.)'ın hadisindeki imandan maksad, İslamiyettir, teslim olmaktır. Yani mescidlere devam eden kimsenin müslüman olmasına hükmedilir. Ama içindeki inancın gerçek mahiyetini ancak Allah bilir. Fçıkat bu çözüm şekline şöyle itiraz edilebilir: Kişinin müslümanlığına hükmetmek için mescidlere, devam etmesine ihtiyaç yoktur. Çünkü mescidlere müdavim olsun olmasın: 'Ben Müslümanım' diyen herkesin müslümanlığına hükmedilir. En uygun yorum şekli, hadisteki şehadetten maksadın mescidlere müdavim olan kişinin imanlı olduğuna kanaat edip itikad etmek olduğuna dair olan yorumdur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 68
			}
		}
	]
}