{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"8": "The Chapters Regarding Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "İbn-i Abbas (r.a.)'aan: Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) Muaz (r.a.)'ı Yemen'e (vali olarak) gönderdi. (Gönderirken) ona şöyle buyurdu : «Şüphesiz sen ehl-i kitap olan bir kavme gidiyorsun. Onları Allah'tan başka ilah olmadığı ve benim Allah'ın resulü olduğum şehadetine davet et. Eğer onlar bu davet için (sana) İtaat ederlerse Allah'ın her gün ve gecede beş (vakit) namazı onlar üzerine farz kıldığını onlara bildir. Eğer onlar bunun İçin (sana) itaat ederlerse Allah'ın onların malında sadaka (zekat) ı onlara farz kıldığını bildir. Bu sadaka onların zenginlerinden alınır ve fakirlerine verilir. Eğer onlar bunun için (sana) itaat ederlerse sen onların mallarının seçkinlerinden sakın (zekat için en üstün kalitesini seçme). Mazlumun bedduasından sakın. Çünkü o beddua ile Allah arasında hiç bir perde yoktur.» Diğer tahric: Buhari, Müslim, Tirmizi, Ahmed ve Darekutni de bu hadisi rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "Abdullah bin Mes'ud (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem): «Zekatını ödemeyen herkesin (zekata tabi) malı kıyamet günü kendisi (ni tazib etmek) için erkek bir kel yılan şekline konularak boynunun gerdanlığı olur.» buyurdu. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) bize Allah Teala'nın kitabından bunu tasdik edici: (•= Allah'ın, kereminden verdiği servette cimrilik edenler, sakın bu cimriliğin kendileri için hayırlı olduğunu sanmasınlar. Bilakis bu, onlar için şerdir. Cimrilik ettikleri şey, kıyamet günü onların boyunlarına dolanacaktır. Göklerin ve yerin mirası Allah'ındır. Allah yaptıklarınızdan haberdardır.)» [Al-i İnran 180] ayetini okudu. Diğer tahric: Nesai ve İbn-i Huzeyme de bunu rivayet etmişlerdir. Buhari, Müslim ve Nesai bunun mislini Ebu Hureyre (r.a.)'den rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "Ebü Zer' (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Develeri, koyunları ile keçileri ve sığırları bulunup zekatını vermeyen herkesin bu malları kıyamet günü en iri ve en semiz durumu ile gelerek sahibine boynuzları ile vurur ve ayakları ile çiğnerler. (Sahibini vura vura ve çiğneye çiğneye geçen) hayvanların sonu geldikçe başı sahibine dönüp ona böylece musallat olur. Bu ta'zib (mahşerde) Allah tarafından insanlar arasında hüküm verilinceye kadar devam eder.» Diğer tahric:Buhari, Müslim ve Tirmizi AÇIKLAMA 1786'da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "Ebu Hureyre (r.a.h)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «(Sahibi tarafından) zekat hakkı verilmeyen develer (kıyamet günü besili ve en kuvvetli hali ile) gelerek sahibini tabanları ile çiğner, (zekatı verilmeyen) sığırlar ve koyunlar ile keçiler de gelip sahibini tırnakları ile çiğner ve boynuzları ile süser. (Zekatı verilmeyen) kenz (ticaret eşyası, para, altın ve gümüş) de kel bir erkek yılan şekline sokulmuş olarak gelir ve kıyamet günü sahibine rastlar. Sahibi iki defa ondan kaçar. Sonra (tekrar) sahibinin önüne çıkar. Sahibi yine kaçarak: Senin ile aramızda (geçmiş) ne (olay) var (ki sen peşimi bırakmıyorsun) ? diye sorar. Yılan : Ben senin (zekatı ödenmeyen) kenzinim (= malınım). Ben senin kenzinim, der. Sahibi, eli ile kendini yılandan korumaya çalışır. Yılan onun elini kıtır kıtır yer.» Diğer tahric: Bu hadisi: Buhari de rivayet etmiştir. Müslim de bunun benzerini Cabir bin Abdillah el-Ensari (r.a.)'den rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "Ömer bin el-Ilattab'ın mevlası Halid bin Eşlem (r.a.)'den; Şöyle demiştir: Ben (bir gün) Abdullah bin Ömer (r.a.) ile beraber (Medine dışına) çıkmıştık. Bir A'rabi arkadan gelip Abdullah bin Ömer (r.a.)'a: Allah'ın; والذين يكنزون الذهب والفضة ولا ينفقونها في سبيل اللَّه «Ve altın ve gümüşü kenz edip (= biriktirip) Allah yolunda harcamayanlar...» buyruğu(ndaki kenz ve mal biriktirmenin) mahiyeti nedir? diye sordu. İbn-i Ömer (r.a.) Ona: — Altın ve gümüşü biriktirip de zekatını vermeyenler için helak ve azab vardır. Zekat farz kılınmazdan önce ihtiyaç fazlası olup biriktirilen mal, kenz (azabı mucip bir biriktirme) sayılırdı. Zekat farziyeti emri indirilince Allah Teala zekatı malların temizleyicisi kıldı, diye cevap verdikten sonra dönüp şöyle dedi: — Sayısını bilip zekatını verdiğim ve Allah (Azze ve Celle)'nin taatile işlettiğim Uhud dağı kadar altınım olsa (bu yüzden) endişe duymam. Not: Tirmizi bu hadisi rivayet ettikten sonra: Bu hadis hasen-garib'tir, demiştir. Diğer tahric: Bıı hadisi, Buhari, Tirmizi ve Nesai de rivayet etmişlerdir. Buhari'nin rivayetinde; \"Sonra dönüp şöyle söyledi ... \" cümlesi ve onu takip eden İbn-i Ömer (r.a.)'ın sözü yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine güre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Sen malının zekatını verince, üzerindeki (malın hakkı) ın ödemiş olursun,» Diğer tahric: Tirmizi ve Hakim de bunu rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "Fatime bint-i Kays (r.anha)'dam rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Malda zekattan başka hiç bir hak yoktur.» Diğer tahric: Tirmizi ve Darimi bu hadisi tahric etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Munqar"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "Ali (bin Ebi Talib) (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ben sizi at ve köle zekatından kesinlikle afv ettim. Lakin gümüşten öşürün dörtte birisini (zekat olarak) veriniz. Her kırk dirhemden bir dirhem (veriniz).» Diğer tahric: Bu hadisi Ebu Davud, Nesai ve Tahavi de rivayet etmişlerdir. AÇIKLAMA 1791’de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": 1791,
			"text": "(Abdullah) bin Ömer ve Aişe (r.anhuma)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) her yirmi dinardan ve bundan fazla meblağdan yarım dinar ve kırk dinardan bir dinar (zekat) alırdı. Not: Ravi İbrahim bin İsmail zayıf olduğu için bunun isnadının zayıf olduğu Zevaid'de bildirilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "Aişe (r.anha)'den; Söyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'den işittim. Buyurdu ki: «Bir malın üzerinden bir yıl geçinceye kadar onda hiç zekat yok tur.» Not: Zevaid'de şöyle denilmiştir: İbn•i Ebi'r•Rical olan ravi Harise bin Muhammed zayıf olduğu için bu isnad zayıftır, Tirmizi bu hadisi İbn-i Ömer (r.a.)'den merfu' ve mevkuf olarak rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": 1793,
			"text": "Ebu Said-i Hudri (r.a.)'den rivayet edildiğine göre kendisi. Nebi (Sallallahu Aleyhi ve Sellem) 'den şunu buyururken isitmiştir: «Beş vesk miktarından az olan hurmada, beş okiyyeden az (gümüş) de ve beş deveden aşağısında zekat yoktur.» Diğer tahric: Buhari, Müslim, Tirmizi, Ebu Davud, Nesai AÇIKLAMA 1794’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "Cabir bin Abdillah (r.a.'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem), şöyle buyurdu, demiştir: «Beş deveden aşağısında zekat yoktur. Beş okiyye'den az (gümüş) de zekat yoktur. Ve beş vesk miktarından az olan (hurma, üzüm ve hububat) da zekat yoktur.» Not: Bu hadisin senedinin hasen olduğu Zevaid'de belirtilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "Ali bin Ebi Talib (r.a.)'den rivayet edildiğine göre: Abbas (bin Abdulmuttalib) (r.a.), zekatını vaktinden önce yermekte acele etmesi hükmünü Nebi (Sallallahu Aleyhi ve Sellem)'e sormuş. Efendimiz de ona bu hususta ruhsat vermiştir. Diğer tahric: Ahmed, Ebu Davud, Tirmizi, Hakim, Beyhaki ve Darekutni de bunu rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "Abdullah bin Ebi Evfa (r.a.)'dan rivayet edildiğine göre şöyle demiştir: Her hangi bir adam malının zekatını Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına getirdiği zaman Efendimiz ona rahmet ve mağfiret için dua ederdi. Ben de malımın zekatını Onun huzuruna getirdim. Efendimiz: «Allah'ım! Ebu Evfa ailesine rahmet ve mağfiret eyle.» diye dua buyurdu. Diğer tahric: Buhari. Müslim. Ebu Davud ve Nesai de bunu rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine güre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Zekat verdiğiniz zaman; اللهم اجعلها مغنماً ولا تجعلها مغرماً Allah'ım! Bu zekatı büyük bir sevaba vesile eyle ve bunu (sevaba sebep olmadan hak sahibine ödenen) bir borç eyleme' demekle zekatın sevabını istemeyi unutmayınız.» Not: Zevaid'de şöyle denilmiştir: Bunun isnadında el•Velid bin Müslim ed-Dimışki bulunuyor. Bu ravi tedIisci idi. Ravi el-Bahteri ise Onun zayıflığı hususunda alimter müttefiktir. İbn-i Ebi Evfa (r.a.)'ın (1796 nolu) hadisi bu hadis için şahid durumundadır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "İbn-i Şihab (Zühri), Salim bin Abdillah (bin Ömer)'den O da babası (Abdullah.bin Ömer) (r.a.j'den. O da Nebi (Salla/lahui Aleyhi ve Sellem)'den rivayetle şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem)'in vefat etmeden önce zekatlar hakkında yazdırmış olduğu bir mektubu Salim bana okudu (veya okutturdu.) Ben o mektupta şöyle buyuruldugunu buldum. «Beş (deve) de bir şat, on (deve) de iki şat, on beş (deve) de üç şat ve yirmi (deve)de dört şat (zekat) olur. Yirmi beş de(n) otuz beş (devey)e kadar bir bint-i mahad (zekat) olur. Eğer bint-i mahad bulunmazsa erkek olan bir İbn-i Lebun (verilir). Otuzbeşten bir (deve) fazlalaşırsa kırk beşe kadar (olan develer için) bir bint-i lebun zekat vardır. Develer kırk beşten bir fazla olunca altmış (devey)e (varıncaya) kadar bunlar için bir hıkka (zekat) bulunur. Altmıştan bir fazla olunca yetmiş beşe kadar bir Cezea (zekat) olur. Yetmişbeşten bir fazla olunca doksana kadar iki bint-i Lebun (zekat) olur. Doksandan bir fazla olunca yüz yirmiye kadar iki hıkka (zekat) olur. Develer daha da çoğalınca artık her elli (deve) için bir hıkka ve her kırk (deve) için bir bint-i Lebun (zekat) olur.» Diğer tahric: Ahmed, Tirmizi, Ebu Davud, Darekutni, Beyhaki ve Hakim de bu hadisi rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "Ebu Said-i Hudri (r.a.)den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Beşten az develerde zekat yoktur. Dört devede de hiç bir şey yoktur. Develerin sayısı beşe ulaşınca onun zekatı bir şat olur. Dokuz deveye kadar (böyledir.) Deve sayısı 10a ulaşınca (bundan) on-dörde kadar onun zekatı iki şat olur, develer on beş olunca (bundan) 19'a kadar onun zekatı üç şattır. Develer 2O'ye ulaşınca zekatı dört şattır. Deve sayısı 24'e ulaşıncaya kadar (hüküm budur.) Deve sayısı 25'e ulaşınca (bundan) 35'e kadar, onun zekatı bir bint-i Mahad-dır. Bint-i mahad olmadığı zaman erkek olan bir ibn-i lebun verilir. Bir deve fazlalaşırsa, zekatı bir bint-i lebun olur. Deve sayısı 45e ulaşıncaya kadar (hüküm budur.) Bir deve fazlalaşırsa, zekatı bir hıkka olur. Deve sayısı 60'a ulaşıncaya kadar (hüküm budur.) Bir deve daha olursa zekatı bir cezea olur. Deve sayısı 75'e ulaşıncaya kadar (hüküm budur.) Deve sayısı bir artarsa zekatı iki bint-i lebun olur. Deve sayısı 90'a ulaşıncaya kadar (hüküm budur.) Buna bir deve daha ziyadeleşirse. zekatı iki hıkka olur. Develer 120 adede ulaşıncaya kadar (hüküm budur.) Bundan sonra her elli deve için bir hık.... ve kırk deve için bir bint i lebun (zekat) olur.» Not: Zevaid'de şöyle denmiştir: Bunun senedindeki ravi Muhammed bin Akil hakkında Ahmed ve Hakim: Muhammed bin Akil, Hafs bin Abdillah'tan muteber olmayan iki hadis rivayet etmiştir. demişlerdir. İbn-i Hibban ise: 0, sika'dır, bazen hata etmiştir. Irak'ta on kadar matlup hadis rivayet etmiş, demiştir. Nesai de O'nu sika saymış ve Ebü Abdillah el•Hakim'de: 0, alimlerin seçkinlerindendir, demiştir. İsnadın kalan ravileri Buhari'nin şartı üzerine sika zatlardır. Bu hadisin ilk cümlesini (yani «Beşten az develerde zekat yoktur.» cümlesini Buhari, Müslim ve başkaları (Müellifin Süneninde 1793 numarada geçmiştir.) da rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "Enes bin Malik (r.a.)'den rivayet edildiğine göre: Ebu Bekir-i Sıddik (r.a.) (kendisini Bahreyn'e zekat amiri olarak gönderdiğinde) O'na şu mektubu vermiştir: Sana verdiğim bu mektup, Allah'ın Resulullah (Sallallahu Aleyhi ve Sellem)'e emrettiği ve Resulullah (Sallallahu Aleyhi ve Sellem)'in müslümanlara farz ettiği (veya takdir ve tayin buyurduğu) zekat farizası (hükümlerini beyan eden bir talimat)dır. Şüphesiz, hayvan zekatları meyanındaki develerin gerekli yaşlarından bir kısmı şöyle olur: Kimin yanındaki develerin zekatı dört yaşım bitirip beş yaşa erişmiş bir dişi deveye ulaşır ve o'nun yanında böyle deve bulunmaz da bir yaş aşağı dişi deve bulunursa, mal sahibinden (zekat olarak bu deve kabul edilir.) Ve mal sahibi yaş farkının telafisi için, yanında varsa iki şat, yoksa yirmi dirhem (gümüş) verir. Kimin yanındaki (develerin) zekatı üç yaşını bitirip dört yaşına basmış bir dişi deveye ulaşır ve onun yanında yalnız iki yaşını bitirip üçüncü yaşa basmış deve varsa, bu deve ondan kabul edilir. Ve mal sahibi (yaş farkına karşılık olarak) bu deve ile beraber, yanında varsa iki şat, yok ise yirmi dirhem (gümüş) verir. Kimin zekatı iki yaşını tamamlayıp üçüncüsüne basmış dişi bir deveye ulaşırsa yanında bu evsafta bir deve bulunmayıp bir yaş büyüğü bulunursa bu deve mal sahibinden kabul edilir ve zekat memuru (yaş farkı telafisi için) ona yirmi dirhem (gümüş) veya iki şat verir. Kimin zekatı iki yaşını tamamlayıp üçüncüsüne basmış bir dişi deveye erişir ve yanında bu vasıflarda deve bulunmayıp, yanında bir yaş küçüğü dişi deve bulunursa mal sahibinden bu deve kabul edilir ve mal sahibi (yaş farkını kapatmak için) bu deve ile beraber 20 dirhem (gümüş) veya İki şat verir. Kimin zekatı bir yaşını tamamlayıp ikinci yaşa giren dişi bir deveye ulaşır da, yanında bu evsafta deve bulunmaz ve yanında bir yaş küçüğü dişi deve bulunursa, ondan o büyük deve kabul edilir. Ve zekat memuru (yaş farkının telafisi için) ona yirmi dirhem (gümüş) vcya iki şat verir. Kimin yanında zekat olarak vermesi gereken iki yaşındaki dişi deve bulunmayıp yanında, iki yaşından üçüncüsüne geçmiş erkek bir deve varsa ondan o deve kabul edilir ve bununla beraber başka bir şey (vermek) yoktur. Diğer tahric: Malik, Şafii, Ahmed, Buhari, Ebu Davud, Darekutni, Hakim ve Beyhaki de bu hadisi rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "Süveyd bin Ğafele (r.a.)'den; Şöyir demiştir: Nebi (Sallallahu Aleyhi ve Sellem)'in zekat memuru bize geldi. Ben onun elini tuttum ve onun (zekat ahkamına ait) mektubunda bulunan şu hükümleri okudum. «Zekat (artar veya eksilir) korkusuyla müteferrik (dağınık mal) bir araya toplatılmaz. Toplu (mal) da dağıtılmaz.» Sonra btr adam ona iri ve çok semiz bir dişi deve getirdi. O (zekat memuru) bu deveyi (zekat olarak) almaktan imtina etti. Bunun üzerine adam, o deveden aşağı bir deveyi memura getirdi. Memur, bunu aldı ve dedi ki: Ben müslüman bir adam'ın develerinin en seçkinini almış olarak Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına varacağım zaman hangi yer beni taşır ve hangi gök beni gölgeler. Diğer tahric: Bu hadisi, Ebu Davud ve Darekutni de bu hadisi rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "Cerir bin Abdillah (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Zekat memuru (mal sahiplerinden) ancak razı olarak döner (dönmelidir.)» Diğer tahric: Müslim, Tirmizi, Ebu Davud ve Nesai de bunu benzer lafızIarla rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "Muaz bin Cebel (r.a.)'den: Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), Beni, Yemen'e (zekat ve sair işlerin yöneticisi olarak) gönderdi ve bana, beher kırk sığır ve mandadan bir müsinne'yi ve beher otuzundan bir tebi' veya bir tebia'yı (zekat olarak) almamı emretti. Diğer tahric: Bu hadisi Ahmed, Tirmizi ve Ebu Davud da rivayet ettiler. AÇIKLAMA 1804’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "Abdullah (bin Mes'ud) (r.a.)'dan rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Otuz bakar (sığır ve manda)da bir tebl' veya bir tebia ve kırk (bakar'da) bir müsinne (zekat.) vardır.» Diğer tahric: Bu hadisi Tirmizi de rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "İbn-i Şihab(-i Zühri), Salim bin Abdillah (bin Ömer)'den. O da babası (Abdullah) (r.a.)'dan. O da Resulullah (Sallallahu Aleyhi ve Sellem)'den rivayetle şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem)'In vefat etmeden önce zekatlar hakkında yazdırmış olduğu bir mektubu Salim bana okudu (veya okutturdu.) Ben o mektubta şöyle buyurulduğunu buldum: «(Zekat) kırk şat (koyun ve keçi) de, yüz yirmiye kadar bir şattır. Yüz yirmiden bir tane fazla olunca, iki yüze kadar, iki şattır. Ukiyüzden) bir tane fazla olunca, üçyüze kadar, üç şattır. Daha da çoğalınca artık her yüz tanede bir şat (zekat) olur.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "(Abdullah) bin Ömer (r.a.)'daan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Müslümanların zekatları (hayvan sürülerini suladıkları) suları üzerinde alınır.» Not: Zevaid'de şöyle denilmiştir: Seneddeki ravi Usame bin Zeyd'in zayıflığı üzerinde alimler ittifak etmişlerdir. Bazıları bunun Usame bin Zeyd bin Eslem olduğunu söylemişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Seilem) şöyle buyurmuştur: «Koyun ve keçi zekatı kırk tanede, yüz yirmiye kadar bir şattır. Bir tane fazlalaşınca, ikiyüze kadar iki şattır. Eğer bir tane fazlalaşırsa artık üçyüze kadar zekatı üç şattır. Eğer daha da fazlalaşırsa artık beher yüz tanede bir şat zekat olur. Zekat (artar veya eksilir) korkusuyla toplu mal dağıtılmaz ve dağınık mal toplatılmaz. Her iki halit (= ortak veya mallarını başkasının malına karıştıran) verdiği zekattan arkadaşına düşen hisse karşılığını ondan alır. Zekat memuru (ne) malın yaşlısını (ne) ayıplısını (ne de koç ve teke gibi) döl hayvanını zekat olarak alamaz. Ancak mal sahibi dilediği zaman zekat memuru döl hayvanı alabilir.» Diğer tahric: Bunu Ahmed. Tirmizi ve Ebu Davud tarafından da rivayet edilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"text": "Enes bin Malik (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Zekatta haksız davranan kimse zekatı vermekten imtina eden gibidir.» Diğer tahric: Bu hadisi Tirmizi ve Ebu Davud da bunu rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"text": "Rafi' bin Hadic (r.a.)'den; Şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'den şöyle buyururken işittim: «Hakkıyle çalışan zekat memuru evine dönünceye kadar Allah yolunda çalışan gazi gibidir.» Diğer tahric: Bu hadisi Tirmizi ve Ebu Davud da rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "Abdullah bin Uneys (r.a.)'dan rivayet edildiğine göre: Kendisi bir gün Ömer bin el-Hattab (r.a.) ile beraber zekat hakkında müzakere etmişler. Bu arada Ömer kendisine: Sen Resulullah (Sallallahu Aleyhi ve Sellem)'i zekatta hiyanet etmeyi anlattığı zaman : «Şüphesiz kim zekattan bir deve veya bir şat (koyun veya keçi) hiyanetinde bulunursa kıyamet günü hiyanet edilen hayvan getirilerek niyanet edene yüklenir.» buyururken işitmedin mi? demiş. Ravi demiştir ki Abdullah bin Uneys de: Evet işittim diye cevap vermiştir. Not: Zevaid'de şöyle denmiştir: Bunun senedi hakkında konuşulmuştur. Çünkü İbn•i Hibban. Ravi Musa bin Cübeyr'i sikalar arasında zikrederek: O bazen hata eder. demiştir. Zehebi de el-Kaşif'te: O sıkadır, demiştir. Ben Musa hakkında başkasının bir şey söylediğini görmedim. Ravilerden Abdullah bin Abdurrahman'ı İbn-i Hibban sikalar arasında zikretmiştir. Senedin kalan ravileri sika zatlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "İmran bin Husayn Mevlası Ata' (r.a.)'dan rivayet edildiğine göre: İmran bin el-Husayn Ziyad bin Ebi Süfyan veya başka bir emir tarafından zekat memuru olarak gönderilmiş sonra görevden dönünce gönderen emir tarafından kendisine: — Topladığın mal nerededir? diye sorulmuş. Kendisi de: — Beni mal getirmek için mi gönderdin? Biz Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken nereden alıyor idiysek oradan aldık ve aldığımızı nereye bırakıyor idiysek oraya bıraktık, diye cevap vermiştir.\" Diğer tahric. Ebu Davud",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Müslüman üzerinde (ne) kölesi için (ne de) atı için zekat yoktur.» Diğer tahric: Bunu Kütüb-i Sitte sahibIerinin hepsi ve Ahmed rivayet etmişlerdir AÇIKLAMA 1813’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "Ali (bin Ebi Talib) (r.a.)'den rivayet edildiğine göre; Nebi (Sallallhu Aleyhi ve Sellem) şöyle buyurmuştur: «Sizin için at ve köle zekatından vazgeçtim » Diğer tahric: Bunu sünen sahipleri ve Tahavi rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "Muaz bin Cebel (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) onu Yemen'e göndererek ona şöyle talimat buyurmuştur: «(Zekat olarak) hububattan hububat koyun ile keçilerden koyun ve keçi, develerden deve ve sığırlardan sığır al.» Diğer tahric. Bu hadisi Ebu Davud ve Hakim de rivayet etmişler, Darekutni de bunun sahih olduğunu bildirmiştir. AÇIKLAMA 1815’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "Amr bin Şuayb'ın babasının dedesi (Abdullah bin Amr bin el-As (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (toprak mahsullerinden) yalnız şu beş şey için zekatı meşru kılmıştır: Buğdayı, arpa. hurma, üzüm ve darı. Not: Zevaid'de şöyle denmiştir: Bunun isnadı zayıftır. Çünkü ravi Muhammed bin Ubeydillah, el•Hazreci olan Muhammed'dir. İmam Ahmed: Halk onun hadislerini terketmiş, demiştir. El-Hakim de: Onun hadislerinin terkedilmiş olduğu hususunda rivayet imamları arasında ihtilaf yok, demiştir. Es-Sa'd de : Rivayet ehli onun hadislerini bırakmaya ittifak etmişlerdir. Onun yanında münker hadisler var, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Yağmurun ve pınarlar (gibi akar sular) ın suladığı şeylerde öşür (vacib)dir. Nadıh ( = aletle) sulananlarda da öşürün yarısı (vacip) dır.» Diğer tahric: Tirmizi AÇIKLAMA 1818’de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "Salim'in babası (ibn-i Ömer) (r.a.)'den rivayet edildiğine göre şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken işittim: «Yağmurun, nehirlerin ve pınarların suladığı veya ba'l olan (yani köküne bağlı damarlarla topraktan su emenler) de öşür (vacip} dir. Sevani (su taşıyan develer veya büyük kovalar) ile sulananlarda öşür'ün yarısı (vacip)dir.» Diğer tahric: Bu hadisi Buhari, Tirmizi, Ebu Davud, Nesai, Ahmed ve Darekutni de rivayet etmişlerdir. AÇIKLAMA 1818’de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": 1818,
			"text": "Muaz bin Cebel (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) beni (Zekat toplamak ve dıger işleri yönetmek için) Yemen'e gönderdi ve bana, yağmurun suladığı ve ba'l (köküne bağlı damarlarla topraktan su emici) olarak sulananlardan öşür, devali (aletter) ile sulananlardan öşürün yarısını almamı emir buyurdu.' (Ravi) Yahya bin Adem demiştir ki: Ba'l, aseri, azi ve izi: Yağmur suyu ile sulanandu. Aseri: Sırf bulut ve yağmurla yetişen ve yağmur suyundan başka hiç su görmeyen mahsuldür. Ba'l de: Köklerine bağh damarları yer altına gidip suya ulaşan ve beş altı yılsulamaya ihtiyaç duymayıp sulanmamaya dayanan üzüm asmalarıdır. İşte ba'l budur. Dere suyu akınca ona da Seyl denir. Peşpeşe gelen Seyl'e de 'Gayl' denir. Diğer tahric: Bu hadisi Nesai de rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": 1819,
			"text": "Attab bin Esid (r.a.)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) üzüm asmaları üzerinde bulunan yaş üzümden tahminen ne kadar kuru üzüm çıkacağını tesbit edecek kimseleri bağ sahiplerine gönderirdi. Diğer tahric: Bu hadisi Tirmizi, Ebu Davud, Nesai ve Darekutni de rivayet etmişlerdir. AÇIKLAMA 1820’de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": 1820,
			"text": "(Abdullah) bin Abbas (r.a.)'dan; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) Hayber'i fethşttiği zaman, Hayber toprağı ile nekadar altın ve gümüş varsa hepisinin Zatı Nebevilerinin emrine verilmesini şart koştu. (Yani bu şartla yerli yahudilerin orada kalmalarına müsaade buyurdu.) Hayber yahudileri O'na: Biz toprak (tan iyi mahsul almak) işini daha iyi biliriz. Bu itibarla toprağı bize ver. Meyvesinin yarısı bize ve yarısı size ait olmak üzere biz işletelim, dediler. Ravi demiştir ki. Nebi (Sallallahu Aleyhi ve Sellem) (Hayber arazisini) bu şekilde onlara verdi. Hurmaların toplanması zamanı yaklaşınca Efendimiz Abdullah bin Ravaha (r.a.)'i Hayber yahudilerine gönderdi. İbn-i Ravaha hurma bahçelerindeki meyve miktarını tahminen tesbit etti. Medine halkı bu tahmini tesbit işine Hars derler. İbn-i Ravaha: Bu hurmalıkta, şu kadar, bu kadar hurma var dedi. Yahudiler: — Ey İbn-i Revaha, tahmin ettiğin miktar bize fazla geldi, dediler. Bunun üzerine İbn-i Revaha: — Şu halde, bu miktarı ben kabullenirim ve dediğim bu miktarın yarısını ben size veririm, dedi. Ravi demiştir ki: Hayber yahudileri: — Hak olan ancak senin yaptığın tahmindir ve gök ile yer ancak hak ile durur, dediler. Sonra: Biz senin dediğin miktarı vermeye razı olduk, dediler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1821,
			"arabicnumber": 1821,
			"text": "Avf bin Malik el-Eşcai (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (bir defa) elinde bir asa bulunduğu halde Mescid'e çıktı. Bir adam da (zekat olarak getirdiği) hurma salkımlarını veya bir hurma salkımını (mescid içinde iki direk arasında gerilmiş olan ipe) asmış idi. Nebi (Sallallahu Aleyhi ve Sellem) asılmış olan hurma salkımını (elindeki asa ile) dürtüp sallamaya ve şöyle buyurmaya başladı: «Bu zekat sahibi dileseydi bundan iyisini zekat olarak verebilirdi. Şüphesiz bu zekat sahibi kıyamet günü bozuk kuru hurma yer.» Diğer tahric: Bu hadisi Ebu Davud ve Nesai de bunu rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": 1822,
			"text": "Bera' bin A'zib (r.a.)'ın Allah Teala'mn (Bakara suresi 267 de): ومما أخرجنا لكم من الأرض ولا تيمموا الخبيث منه تنفقون. (Ey iman edenler! Kazandığınız şeylerin) ve yerden sizin için çıkardığımız şeylerin temizlerinden (infak ediniz.) Ve malın kötüsünden infak etmeye kalkmayın.» kavli celH-i hakkında şöyle dediği rivayet olunmuştur: Bu ayeti celile Ensar-ı Kiram hakkında inmiştir. Hurma devşirme zamanı olunca, Ensar-ı kiram, kendi hurma bahçelerinden taze hurma salkımlarını toplarlar ve Resulullah (Sallallahu Aleyhi ve Sellem)'in mescidinde İki direk arasında (gerilmiş durumda) ki ipin üzerine asarlar. Muhacirlerin fakirleri de ondan yerlerdi. Oraya konulan salkımların çokluğu dolayısıyla kimse farkına varmaz ve geçişir zanniyle bir adam, bozuk hurmalı bir salkımı bile bile getirip (oradaki salkımların arasına) sokar. İşte böyle yapan adam hakkında şunlar nazil oldu: ''Zekat'ı bozuk ve kötü kuru hurmadan vermek kastında bulunmayınız.'' (Şu) nazmı celilindede: Allah Teala: ''Öyle kötü hurmalarki; eğer size hediye edilmiş olsaydı işinize yaramayan bir şeyi size gönderdiği için (duyduğunuz) öfkeden dolayı ancak sahibinden utanarak kabul edecektiniz.'' buyuruyor. Şu cümlede de buyruluyor ki: ''Bilmiş olunuz ki şüphesiz Allah sizin zekatlarınızdan müstağnidir.'' Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedi sahihtir. Çünkü bu senettekl ravi Ahmed bln Muhammed bin Yahya'nın çok Sadık olduğunu İbn-i Ebi Hatim ve Zehebi söylemişlerdir. İbn-i Hibban da: O. sikalardandır, rivayetIerinde muhkem idi. demiştir. Senedin kalan ravileri de Müslim'in şanı üzerinde sahihtir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": 1823,
			"text": "Ebu Seyyare el-Mütef (r.a.)'den; Şöyle demiştir: Ben, Nebi (Sallallahu Aleyhi ve Selleml'e: Ya Resulallah! Benim bal arılarım vardır, dedim. O: Öşür (yani onun balının onda birini zekat olarak) öde, buyurdu. Ben: Ya Resulallahl Benim için arılarımı muhafaza buyur, dedim. O da benim için arılarımı muhafaza buyurdu. Not Zevaid'de şöyle denilmiştir: Ravi Süleyman bin Musa'nm Ebu Seyyare (r.a.)'ın zamanına yetişmediğini İbn-i Ebi Hatim babası Ebu Hatim'den naklen söylemiştir. Bu sebeple hadis mürseldir. Tirmizi de el-İlel'de bu hadisin arkasında anlattığına göre Buhari bu hadisin mürsel olduğunu söylemiştir. Tirmizi daha sonra: Süleyman bin Musa sahabilerden hiç bir kimseye ulaşmamıştır, demiştir. İbn-i Mace yanında bundan başka Ebu Seyyare (r.a.) hadisi yoktur. Kütüb-i Sitte'nin diğerlerinde onun hiç bir hadisi yoktur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": 1824,
			"text": "Abdullah bin Amr (bin el-as) (r.a.)'dan rivayet edildiğine göre: Kendisi Nebi (Sallallahu Aleyhi ve Sellem)'in bal'dan öşür aldığım rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": 1825,
			"text": "(Abdullah) bin Ömer (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) fıtır zekatını bir sa' kuru hurma veya bir sa' arpa olarak emir buyurdu. Abdullah (bin Ömer) demiştir ki :. Sonra halk iki müd buğdayı buna muadil eyledi. AÇIKLAMA VE TAHRİC BİLGİSİ 1826’da",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": 1826,
			"text": "Abdullah bin Ömer (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) hür veya köle erkek veya kadın her müslüman'a fıtır sadakasını bir sa' arpa veya bir sa' kuru hurma olarak farz kıldı. TAHRİC: İbn-i Ömer (r.a.)'ın ilk hadisini Buhari ve Müslim aynı metinle, Tirmizi ve Ebu Davud ile Nesai manayı etkilemeyen benzer lafızlarla rivayet etmişlerdir. Onun ikinci hadisini Kütüb-i Sitte sahipleri Ahmed ve Darekutni rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": 1827,
			"text": "İbn-i Abbas (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) oruçluyu (işlediği) faydasız söz ve fiillerden ve çirkin, ölçüsüz laflar (in pisliğin) den temizleyici ve fakirlere yiyecek olmak üzere fıtır zekatını farz kıldı. Artık kim bunu bayram namazından önce öderse, o, makbul bir zekattır. Kim bunu bayram namazından sonra öderse o, sadakalardan birisidir.\" Diğer tahric. Ebu Davud, Hakim ve Darekutni de bunu rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": 1828,
			"text": "",
			"grades": [
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": 1829,
			"text": "Kays bin Sa'd (bin Ubade) (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) zekat (emri) İndirilmeden önce bize fıtır sadakasını vermemizi emretti. Sonra zekat (emri) inince bize (fıtır sadakası ile) ne emretti, ne de bizi (bu sadakayı vermekten) menetti. Biz bu sadakayı veriyoruz. (Veya biz ise yine bu sadakayı verirdik.) Diğer tahric: Nesai ve Hakim de bunu rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": 1830,
			"text": "Resulullah (Sallallahu Aleyhi ve Sellem)'m Müezzini Sa'd (el-Karaz) (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), fıtır sadakasını kuru hurmadan bir sa' veya arpadan bir sa' yahut süit (buğdaya benzeyen bir nevi arpa) den bir sa' olarak vermeyi emretti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": 1831,
			"text": "El-Ala' bin el-Hadrami (r.a.)'den: Şöyle demişlir: Resulullah (Sallallahu Aleyhi ve Sellem) beni Bahreyn'e veya Hecer'e (vali ve amil olarak) gönderdi. Ben (orada) kardeşler arasında (müşterek) olan bahçeye (haraç almak için) giderdim. (Kardeşlerden) birisi müslümanlığı kabul ederdi. Artık müslüman olan (kardeş'den öşür, müşrik olan (kardeş)den de haraç alırdım Not: Zevaid'de şöyle denilmiştir: Bunun senedi zayıftır Çünkü ravilerinden Muğire el-Ezdi ve Muhammed bin Zeyd meçhuldürler. Ravi Hayyan el-A'rac'ı İbn-i Muin ve İbn-i Hibban sikalardan saymışlar ise de Onun el-Ala' bin el-Hadrami'den olan rivayetinin mürsel olduğunu el-Mizzi et-Tehzib'te söylemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": 1832,
			"text": "Ebu Said(-i Hudri) (r.a.)'den rivayet edildiğine göre: Kendisi Nebi (Sallallahu Aleyhi ve Sellem)'den msrfu' olarrak şunu rivayet etmiştir: «Vesk altmış sa'dır.» Diğer tahric: Ebu Davud ve Darekutni de bunu rivayet etmişlerdir, AÇIKLAMA 1833’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": 1833,
			"text": "Cabir bin Abdillah (r.a.)'dan rivayet edildiğine göre; ResuIullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Vesk altmış sa'dır.» Not: Zevaid'de şöyle denilmiştir: Cabir (r.a.)'ın bu hadisinin isnadı zayıftır. Çünkü alimler, ravi Muhammed bin Ubeydillah el-Arzemi'nin rivayetini bırakmak için ittifak etmişlerdir. Tirmizi hariç sünen sahipleri bu hadisi Ebu Said (r.a.)'den rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": 1834,
			"text": "Abdullah (bin Mes'ud'un) karısı Zeyneb (bint-i Abdillah) (r.a.)'dan; Şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem) 'e: — Kocama ve himayem altında bulunan bir kaç yetime verdiğim nafaka benim için sadaka yerine kifayet eder mi? diye sordum. Resulullah (Sallallahu Aleyhi ve Sellem): — -Anılan nafakadan dolayı (veya anılan nafakayı veren kadın için) iki ecir vardır: Sadaka ecri ve akrabalık ecri.» buyurdu. Diğer tahric: Bu hadisi Ebu Davud hariç Kütüb-i Sitte sahipleri rivayet etmişlerdir. AÇIKLAMA 1835’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": 1835,
			"text": "Ümmü Seleme (r.anha)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) sadaka vermeyi bize emretti. Bunun üzerine Abdullah (bin Mes'udu'n) karısı Zeyneb (r.anha)': Fakir olduğu halde kocama ve bir erkek kardeşimin yetim olan oğlan çocuklarına sadaka vermem benim için sadaka yerine geçer mi? Ben onlara her durumda şöyle şöyle nafaka vermekteyim? diye sordu. (Ravı) demiştir ki. Efendimiz (Sallallahu Aleyhi ve Sellem): «Evet» buyurdu. Ravi demiştir ki: (Anılan) Zeyneb (r.anha)'nın ellerinden (kazanç getirici) iş gelirdi. Not: Zevaid'de şöyle denilmiştir: Bu, sahih bir seneddir. Ebli Davlid hariç Kütüb-i Sitte sahiplerinin rivayet ettikleri Abdullah bin Mes'ud (R.A.)'m hadisi bu hadis için sahih bir şahiddir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": 1836,
			"text": "Hişam bin Urve'nin dedesi (Zübeyir bin el-Avvanı) (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «(And olsun ki,) Sizden birinizin urganlarını alıp, dağa gitmesi, (oradan topladığı) bir odun demetini sırtında getirip satması ve odun bedeli ile ihtiyacını gidermeye çalışması şüphesiz onun için (halktan istiyeceği şeyi) versinler veya vermesinler onlardan İstemekten iyidir.» Diğer tahric: Buhari de bu hadisi rivayet etmiştir. Ayrıca bir benzerini Ebu Hureyre (r.a.)'den merfu olarak rivayet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": 1837,
			"text": "(Nebi'in mevlası) Sevban (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem): — «Ve kim bir haslet (sahibi olmak) için bana garanti verir? Ben ona cennet garantisini veririm» diye sordu. Dedim ki: — Ben. (O haslet sahibi olma garantisi veririm.)' Efendimiz: — «Sen, halk'ın malların)dan hiç bir şey isteme.» buyurdu. Ravi demiştir ki: Bundan sonra Sevban (r.a.), binek üstünde iken kamçısı elinden (yere) düşerdi de hiç bir kimseye: Onu bana sunuver, demezdi ve nihayet kendisi inip onu alırdı. Diğer tahric. Ahmed, Ebu Davud ve Nesai de bunu benzer lafızlarla rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": 1838,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Malını çoğaltmak için halktan mallarını isteyen bir kimse şüphesiz Cehennemin tutuşmuş ateş parçalarını İstemiş olur. Artık bunu azaltsın veya çoğaltsın.» Diğer tahric: Müslim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1839,
			"arabicnumber": 1839,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ne varlıklı kişi için ne de kuvvetli ve sağlam kişi için sadaka helal değildir.» Diğer tahric. Nesai, İbn-i Hibban, Darekutni ve Hakim de bunu rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1840,
			"arabicnumber": 1840,
			"text": "Abdullah bin Mes'ud (r.a.)'den rivayet edildiğine göre. Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: — «Gına verip geçindirecek malı varken halktan isteyen kimsenin dilencilikle aldığı şey kıyamet günü onun yüzünde yara, bere olarak gelir. Ashab-ı Kiram tarafından: — Ya Resulallah! (Halk'tan istemeye mani) ne kadar mal insana gına verir? diye soruldu. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): — «Elli dirhem gümüş veya- bunun değerinde altın.» diye cevap buyurdu. (Ravi Yahya demiştir ki:) Bir adam (Ravi) Süfyan'a: Şu'be, Hakim bin Cübeyr'den hadis rivayet etmez, demiş, Süfyan'da: Bu hadisi bize Muhammed bin Abdirrahman bin Yezid'den (Hakim'den başka) Zübeyd (de) rivayet etmiş, demiştir. Diğer tahric: Bu hadisi, Ahmed, Tirmizi, Ebu Davud, Nesai, Darimi, Tahavi ve Darekutni de rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1841,
			"arabicnumber": 1841,
			"text": "Ebu Saicl-i Hudri (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «(Şu) beş kişi müstesna, zekat almak hiç bir zengine helal değildir: Zekat amili (memuru), Allah yolundaki mücahid, zekat malını kendi malı ile satın alan zengin, fakirin, kendisine verilmiş olan sadakayı hediye ettiği zengin ve (Müslümanların arasını bulmak yolunda) borçlanan (zengin).» Diğer tahric. Ebu Davud, Ahmed, Darekutni ve Hakim de bunu rivayet etmişlerdir. Ayrıca Malik, Ebu Davud ve Hakim bunu Ata bin Yesar'dan mürsel olarak rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1842,
			"arabicnumber": 1842,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Her hangi bir kimsenin bir hurma değerinde bile olsa helal kazancından verdiği sadakayı — ki Allah helal maldan verilen sadakadan başka hiç bir sadakayı kabul etmez— Rahman (olan Allah) behemahal sağ eliyle alır. Sonra o sadaka dağdan daha büyük oluncaya kadar Rahmanın avucunda artar ve sizin biriniz erkek küheylan tayını veya devesinin yavrusunu titizlikle büyüttüğü gibi. Rahman o sadakayı sahibi için önemle büyütür.» Diğer tahric: Buhari, Müslim, Nesai, Tirmizi ve İbn-i Huzeyme de bu hadisi rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1843,
			"arabicnumber": 1843,
			"text": "Adiyy bin Hatim (-i Tai) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kıyamet günü Rabbi kendisi ile konuşmıyacak (sorguya çekilmiyecek) hiç biriniz yoktur. Rabbi ile kulu arasında hiç bir tercüman olmaksızın (Allah kulu ile konuşacaktır.) Bu durumda kul önüne bakar. Karşısında Cehennem ateşi bulunur. Sağına bakar, önünden gönderdiği (ameli) nden başka bir şey göremez. Soluna bakar, gönderdiği (ameli)nden başka bir şey görmez. (Ashabım!) Artık tek bir hurmanın yarısı ile olsun ateşten korumaya gücü yeteniniz (bunu) yapsın.» Diğer tahric: Buhari ve Müslim de bu hadisi rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1844,
			"arabicnumber": 1844,
			"text": "Selman bin Amir ed-Dabbi (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Fakire verilen sadaka bir sadakadır. Akrabalığı olan'a verilen sadaka iki (hayır)dır. Sadaka ve sıla(-ı rahim)dir.» Diğer tahric: Hakim, Tirmizi, Nesai, İbn-i Hibban, İbn-i Huzeyme ve Darimi de bunu rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 62
			}
		}
	]
}