{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"11": "The Fear Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 441,
			"arabicnumber": 441,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 441
			}
		},
		{
			"hadithnumber": 442,
			"arabicnumber": 442,
			"text": "Sahl Ibn Abi Hathama a dit que la prière de la crainte (en cas de danger), consiste à ce que l'imam se tint debout avec un groupe d'hommes, quant à l'autre, il doit faire face à l'ennemi. L'imam fait une inclinaison avec eux puis une prosternation et il se relève et demeure debout jusqu'à ce que les hommes complètent leur prière, seuls, et fassent la salutation finale, après quoi, ils quittent le lieu de la prière pour se mettre en face de l'ennemi. Puis vint l'autre groupe, pour se tenir derrière l'imam qui est toujours debout; les hommes font le takbir, le répétant après l'imam qui prie avec eux, en faisant une inclinaison et une prosternation. Ensuite l'imam fait la salutation finale au moment où les hommes complètent seuls la prière en faisant la deuxième raka't puis la salutation finale»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 442
			}
		},
		{
			"hadithnumber": 443,
			"arabicnumber": 443,
			"text": "Nafé a rapporté: «Quand on demandait Abdallah Ibn Omar, au sujet de la prière de danger, il répondait: «L'imam préside la prière avec un certain nombre d'hommes, en complétant une raka't, alors que les autres qui n'ont pas encore prié, feront face à l'ennemi. Ceux qui ont déjà fait une raka't avec l'imam, reculent pour céder leur place à ceux qui ne l'ont pas encore faite, sans cependant faire la salutation finale. Ainsi, les seconds devancent pour faire une raka't avec l'imam, qui, lui, ayant déjà complété les deux raka'ts, quitte le lieu de la prière; à ce moment, les hommes dans chacune des deux catégories, font seuls l'autre raka't, et toute personne peut compléter sa prière en faisant deux raka'ts. S'il y a un danger imminent, les hommes font la prière tout en étant debout, ou même montés sans toutefois que leur direction ne soit la qibla».Nafé ajouta: «Je crois que Abdallah Ibn Omar n'aurait pas rapporté ce Hadith s'il ne l'avait pas entendu de la bouche de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 443
			}
		},
		{
			"hadithnumber": 444,
			"arabicnumber": 444,
			"text": "Sa'id Ibn Al-Moussaiab, a rapporté: «le jour de la bataille du «Fossé» (Al-Khandaq), l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) n'a fait la prière du midi et celle de l'asr, qu'après le coucher du soleil. Malek a dit: «le Hadith concernant la prière en cas de danger que Saleh Ibn Khawatt a rapporté, était le meilleur que j'ai entendu». MOUATTAA Au Nom d’Allah Le Clément Le Miséricordieux Livre 12 La prière de l'éclipse Chapitre Premier Que doit-on faire dans la prière de l'éclipse",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 444
			}
		}
	]
}