{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"12": "The Eclipse Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 445,
			"arabicnumber": 445,
			"text": "Aicha , la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a rapporté: «Il y eut une éclipse du soleil, du temps de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah). Il fit une prière avec les hommes où il se tint debout et demeura longtemps, puis il s'inclina pour une longue durée pour se lever de nouveau et resta debout cependant moins que la première fois. Puis il s'inclina pour une durée moins longue que la première inclinaison, puis releva la tête et se prosterna. Au cours de la deuxième raka't. il agit pareillement à la première; la prière achevée, le soleil se dégagea, alors l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) se tourna vers les hommes, loua Allah et l'exalta, puis il fit ce prône: «Le soleil et la lune sont deux signes d'entre les signes d'Allah,qui ne s’éclipse pas ni à la naissance, ni à la mort de quiconque. Ainsi si vous êtes témoins de ce phénomène, invoquez Allah, proclamez Sa Grandeur et faites l'aumône». Puis il ajouta: «O communauté de Mouhammad! Par Allah! Nul n'est jaloux plus que Allah. Lorsque son serviteur ou sa servante commet l'adultère.Ô communauté de Mouhammad! Par Allah! Si vous saviez ce que je sais. Vous auriez ri peu mais beaucoup pleuré»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 445
			}
		},
		{
			"hadithnumber": 446,
			"arabicnumber": 446,
			"text": "Abdallah Ibn Abbas a rapporté: «Il y eut une éclipse .alors que l'Envoyé d'Allah (salallahou alayhi wa salam)r (Sur lui la grâce et la paix d'Allah) se trouvait avec les hommes. Il se leva pour prier avec eux, et demeura debout, le temps de réciter environ la sourate «La Vache», puis il fit une longue inclinaison, et releva ensuite la tête pour rester debout dans une durée moins longue que la première fois; il s'inclina ensuite pour un temps moins long que celui de la première inclinaison puis il se prosterna. Après cela, il se leva et demeura debout pour un temps moins long que celui de la première fois, puis s'inclina pour une durée moins longue que celle de la première inclinaison, releva la tête et resta ainsi debout pour un temps moins long que la première fois, puis il s'inclina de nouveau pour un temps moins long que la fois précédente, ensuite il se prostema. La prière achevée, le soleil se dégagea, il dit: «le soleil et la lune sont deux signes d'entre ceux d'Allah, qui ne subissent pas une éclipse à cause, soit de la mort de quelqu'un, soit de sa naissance. Or, si vous assistez à ce phénomène, invoquez Allah»? On lui demanda: «Ô Envoyé d'Allah nous t'avons vu prendre quelque chose de ta place, puis tu t'es reculé»? Il répondit: «Je viens de voir le Paradis et j'ai voulu cueillir une grappe de ses raisins. Or, si je l'avais prise, vous en auriez mangé tant que le monde existe. J'ai vu également l'Enfer, et je n'ai jamais vu un spectacle aussi horrible que celui que j'ai vu aujourd'hui. J'ai vu que les femmes étaient de majorité en Enfer». On lui demanda: «pourquoi cela, ô Envoyé d'Allah»? Il répondit: «à cause de leur infidélité». On répliqua: «Seraient-elles infidèles à Allah»? Il rétorqua: «elles sont infidèles à leurs maris et elles sont ingrates. Si tu fais du bien à l'une d'elles toute la vie, et qu'elle voit ensuite de ta part une chose qui lui déplait, elle s'écriera: «Je n'ai jamais reçu de toi la moindre chose»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 446
			}
		},
		{
			"hadithnumber": 447,
			"arabicnumber": 447,
			"text": "Aicha, la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a raconté: «Une juive vint lui demander une aumône en lui disant: «Que Allah te préserve du châtiment de la tombe». Aicha demanda ensuite à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) si les hommes, sont châtiés dans leurs tombes»? Il lui répondit en se réfugiant auprès d'Allah contre le tourment de la tombe». Puis un matin, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) enfourcha sa monture et il y eut une éclipse du soleil. Il revint au moment de «Al-douha» et passa entre les appartements (de ses femmes); puis il se leva faire une prière et les gens derrière lui. Il resta longtemps debout, puis fit une longue inclinaison, releva ensuite la tête et demeura debout pour une durée moins longue que celle de la première fois, puis il s'inclina de nouveau et fit une inclinaison moins longue que la première, puis releva la tête et ensuite il se prosterna. Il se leva de nouveau, resta debout pour un laps de temps moins long que la première fois, fit une inclinaison moins longue que la première, puis il releva la tête et demeura debout moins longtemps que la première fois, puis il s'inclina pour un temps moins long que sa première inclinaison, ensuite il releva la tête et se prosterna La prière achevée, il dit ce que Allah voulut qu'il dit, et ordonna ensuite aux gens de se réfugier auprès d'Allah contre le châtiment de la tombe». Chapitre II La prière de l’éclipse",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 447
			}
		},
		{
			"hadithnumber": 448,
			"arabicnumber": 448,
			"text": "Asma la fille de Abou Bakr AlSiddiq a rapporté: «Je vins trouver Aicha la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) et il y eut une éclipse du soleil, et je trouvais les gens, ainsi que Aicha, faire la prière». Je me dis: «Qu'on-ils ces gens»? Aicha fit un signe de sa main vers le ciel en disant: «Gloire à Allah». Je lui demandai: «Est-ce un signe»? Elle l'affirma de sa tête. Asma ajouta: «En me levant pour prier, je faillis perdre connaissane, et je versai de l'eau sur ma tête». La Prière terminée, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) loua Allah et l'exalta puis il dit: «Il en est des choses que je n'avais jamais vues, et que je vienne de voir de mon siège ci, même le Paradis et L'Enfer. On m'a inspiré que vous allez subir une tentation dans vos tombes pareille à celle de L'Antéchrist ou presque-il y a un doute du rapporteur - (les deux anges viendront) demander à l'un de vous: «Que sais-tu de cet homme»? Le croyant ou l'homme sûr de sa foi (Je ne sais pas au juste lequel de ces deux mots a mentionné Asma) répondra: «Il est Mouhammad, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) qui nous a apporté les preuves certaines et la bonne voie. Nons avons répondu à son appel, nous avons cru, et nous avons suivi (ses enseignements). Quant à l'hypocrite ou celui qui doute de sa foi (je ne sais pas lequel de ces deux mots a dit Asma, il répondra: «Je ne sais pas. J'ai entendu les gens dire des choses à son sujet et j'ai répété leurs paroles». MOUATTAA Au Nom d’Allah Le Clément Le Miséricordieux Livre 13 La prière pour la chute de la pluie Chapitre Premier Le fait de prier Allah pour la chute de la pluie)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 448
			}
		}
	]
}