{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"15": "The Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 470,
			"arabicnumber": 470,
			"text": "Abdallah Ibn Abi Bakr Ibn Hazm a rapporté que dans la lettre envoyée par l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) à Amr Ibn Hazm, il lui dit: «Défense de toucher le Coran, si l'on n'est pas en état de pureté rituelle». Malek a dit: «un homme qui n'est pas en état de pureté rituelle ne doit pas porter le Coran par le nœud, ni le poser sur un coussin, et si cela était permis, on l'aurait porté dans un sac. Cela n'a pas été interdit pour le fait qu'un homme puisse avoir en main quelque chose qui souille le Coran, mais à cause de son impureté rituelle, par respect du Coran et pour sa vénération». Malek a dit aussi: «Ce verset: «seuls ceux qui sont purs peuvent le toucher» (Coran LVI, 79) est de mieux ce que j'ai entendu à ce sujet, et est de la même valeur que les versets qu'on trouve dans la Sourate «Abassa» quand Allah Le Béni et le Très-Haut dit: «Non, non! vraiment ceci est un Rappel * Quiconque le veut s'en souviendra * II est contenu dans des feuilles vénérées * élevées et purifiées * entre les mains des scribes * nobles et purs» (Coran LXXX, 11-16). Chapitre II De la permission de réciter le Coran sans ablutions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 470
			}
		},
		{
			"hadithnumber": 471,
			"arabicnumber": 471,
			"text": "Mouhammad Ibn Sirine a rapporté que Omar Ibn Al-Khattab était parmi des hommes qui récitaient le Coran. Comme il s'en alla pour satisfaire un besoin naturel, il revint en récitant toujours le Coran. Un homme lui fit une remarque et dit: «Ô prince des croyants! Récites-tu le Coran avant que tu n'aies fait tes ablutions»? Il lui répondit: «Qui t'a appris cela? Moussailima (l'imposteur)»? Chapitre III De la subdivision du Coran en (hizbs)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 471
			}
		},
		{
			"hadithnumber": 472,
			"arabicnumber": 472,
			"text": "Abdel Rahman Ibn Abdel-Kari a rapporté que Omar Ibn Al-Khattab, a dit: «Celui qui, pour une raison quelconque, ne peut pas réciter «son hizb», la nuit, et qui le récitera avant que le soleil ne quitte le méridien, jusqu'au moment de la prière du midi, c'est comme s'il n'a pas manqué cette récitation ou selon une variante: comme s'il l'a rattrapé»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 472
			}
		},
		{
			"hadithnumber": 473,
			"arabicnumber": 473,
			"text": "Yahia Ibn Sa'id a rapporté: «nous étions Mouhammad Ibn Yahia Ibn Habban et moi, assis quand Mouhammad appela un homme et lui dit: « raconte moi, ce que tu as entendu ton père dire». L'homme dit: «Mon père m'a rapporté, qu'il est allé voir Zaid Ibn Thabet et il lui dit: «Que penses-tu de la récitation du Coran en sept jours»? Zaid répondit: «c'est bien, mais je préfére que cette récitation soit faite au cours de quinze jours (moitié d'un mois) ou dans dix jours. Demande-moi le pourquoi? On le lui demanda, il répliqua: «Afin que je médite ses sens et que je puisse le comprendre». Chapitre IV La récitation du Coran",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 473
			}
		},
		{
			"hadithnumber": 474,
			"arabicnumber": 474,
			"text": "Omar Ibn Al-Khattab a rapporté: «J'ai entendu Hicham Ibn Hakim Ibn Hizam réciter la sourate «le discernement» (Al-Fourkan) d'une façon toute autre que la mienne, et dont l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) me l'avait apprise. Je fus sur le point de m'irriter contre lui, mais je le laissai terminer, puis de par son vêtement, je le tins et l'amenai auprès de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) en lui disant: «Ô Envoyé du Allah j'ai entendu celui-là, réciter la sourate «Al-Fourkan» d'une façon différente de celle que tu m'a apprise». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) me dit: «lâche-le», puis il lui dit: «Ô Hicham, récite». Hicham récita la même sourate que j'avais auparavant entendue, puis l'Envoyé d'Allah (salallahou alayhi wa salam)r (Sur lui la grâce et la paix d'Allah) répliqua: «C'est ainsi, qu'elle m'a été révélée». Ensuite, il me dit: «Récite-la». Après ma récitation il me dit: «c'est comme ça, qu'elle m'a été révélée, ce Coran m'a été révélé sur sept variantes (de lecture); prenez donc, celle qui vous parait la plus facile (simple)»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 474
			}
		},
		{
			"hadithnumber": 475,
			"arabicnumber": 475,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Celui qui retient le Coran est pareil à un homme qui possède des chameaux attachés. S'il les maintient ainsi, il peut les garder, mais s'il les relâche, ils s'enfuient»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 475
			}
		},
		{
			"hadithnumber": 476,
			"arabicnumber": 476,
			"text": "Aicha, la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a rapporté que Al-Hareth Ibn Hicham demanda à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah): «comment reçois-tu la révélation»?. Il lui répondit:«parfois, je la reçois comme le tintement d'une cloche, qui m'est une façon trés pénible, une fois qu'elle cesse, je saisis ce qui m'a été révélé; d'autre fois, l'ange me vient sous une forme humaine, qui me parle, et je retiens tout ce qu'il m'a dit». Aicha ajouta: «Je l'ai vu recevoir la révélation dans un temps très froid, et une fois qu'elle cessa la sueur commença à couler sur son front. (475) 8- Ourwa a rapporté:La sourate Abassa LXXX) a été révélée au sujet de Abdallah Ibn Oum Maktoum. Il est venu trouver l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) en lui disant: «Ô Mouhammad! fais-moi asseoir à côté de toi», alors qu'étaient présents chez le Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) un des notables des polythéistes\". Le Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) se détourna de lui en accueillant l'autre avec amabilité et il lui dit: «Ô, le père de tel! Trouves-tu du mal, dans ce que je viens de te dire\"? L'autre lui répondit: «Non, je jure par ce qu'on a sacrifié (pour les idoles), je n'y trouve aucun mal». A ce moment, il reçut cette révélation: «il s'est renfrogné et il s'est détourné * parce que l'aveugle est venu à lui» (Coran LXXX, 1,2)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 476
			}
		},
		{
			"hadithnumber": 477,
			"arabicnumber": 477,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 477
			}
		},
		{
			"hadithnumber": 478,
			"arabicnumber": 478,
			"text": "Zaid Ibn Aslam a rapporté que son père a raconté le récit suivant:«dans une de ses expéditions, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) marchait et Omar Ibn Al-Khattab, lui tenait compagnie. Il arriva que Omar posa une question au Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) mais sans recevoir une réponse, puis il lui posa la question pour la deuxième fois sans qu'il ait toutefois une réponse; et ce fut pareillement pour la troisième fois. Alors, Omar se dit: «pour trois fois, tu as repris la même question à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) sans que tu aies pour autant une réponse». Et Omar ajouta: « je poussai alors mon chameau et arrivai à la tête des hommes en redoutant qu'une révélation du Coran ne fût faite à mon sujet j'étais tel, jusqu'à avoir entendu qu'on m'appella. Je redoutai toujours cette révélation à mon sujet, et arrivé tout près de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) je le saluai, et il me dit: «cette nuit, on me fit révéler une sourate qui m'a été plus agréable que quelque autre chose sur laquelle le soleil se lève». Puis il récita: «Oui, nous t'avons accordé une éclatante victoire» (Coran XLVIII, 1)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 478
			}
		},
		{
			"hadithnumber": 479,
			"arabicnumber": 479,
			"text": "Abou Sa'id a rapporté qu'il a entendu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dire: «Parmi vous, sortiront des gens, dont la prière avec la leur, le jeûne et leur pratiques religieuses vous feront penser peu de votre prière votre jeûne et vos pratiques religieuses. Ils réciteront le Coran, sans que leur récitation dépasse leur gosier. Ils sortiront de la religion telle une flèche transperçant le gibier de sorte qu'en regardant sa pointe, elle n'a rien; tu regardes la hampe, elle n'a rien, et tu regardes la barbe, elle n'a rien; tu douteras alors que cette flèche avait été tirée». (....) 11 - On rapporta à Malek, que Abdallah Ibn Omar a mis huit ans pour l'apprentissage de la sourate: «La Vache». Chapitre V De la prosternation quand on récite le Coran",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 479
			}
		},
		{
			"hadithnumber": 480,
			"arabicnumber": 480,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 480
			}
		},
		{
			"hadithnumber": 481,
			"arabicnumber": 481,
			"text": "Abou Salama Ibn Abdel Rahman a rapporté que Abou Houraira, en priant, récita la sourate «al-Inshiqaq» (Coran LXXXIV,) et il se prosterna. La prière achevée, il leur dit que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) en la récitant, fit une prosternation»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 481
			}
		},
		{
			"hadithnumber": 482,
			"arabicnumber": 482,
			"text": "Nafé, l'esclave de Ibn Omar a rapporté qu'un homme des habitants de l'Egypte l'informa que Omar Ibn Al-Khattab, en récitant la sourate «al-Hajj (XXII).\"» a fait deux prosternations, et dit: « cette sourate a été préférée aux autres par deux prosternations»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 482
			}
		},
		{
			"hadithnumber": 483,
			"arabicnumber": 483,
			"text": "Abdallah Ibn Dinar a rapporté qu'il a vu Abdallah Ibn Omar, faire deux prosternations en récitant la sourate «al-Hajj (XXII)»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 483
			}
		},
		{
			"hadithnumber": 484,
			"arabicnumber": 484,
			"text": "Al-A'raj a rapporté que Omar Ibn Al-Khattab récita la sourate: «an-Najm» (Coran LIII,) et fit une prosternation, puis en relevant la tête, il récita une autre sourate»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 484
			}
		},
		{
			"hadithnumber": 485,
			"arabicnumber": 485,
			"text": "Ourwa a rapporté que Omar Ibn Al-Khattab, étant en chaire, il récita une sourate où il y a eu une prosternation, dans un jour de Vendredi, puis descendit, fit une prosternation et les hommes firent de même. Omar récita la même sourate un autre jour de Vendredi, et comme les hommes s'apprêtèrent à se prosterner, il leur dit: «Doucement, Allah ne nous a pas prescrit cette prosternation à moins que nous voulons la faire». Il ne s'est pas prosterné et il a empêché les hommes de la faire». Malek dit: «L'imam n'a pas à quitter sa chaire pour faire une prosternation quand il récite un verset qui l'exige». Malek a dit: «nous considérons qu'il y a dans le Coran onze prosternations dont aucune ne se trouve dans les sourates du «Moufassal». Et Malek a dit: «Il ne convient à personne de réciter, après les prières de l'aurore, et de l'asr, du Coran renfermant une prosternation parce que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a interdit toute prière faite après celle de l'aurore jusqu'au lever du soleil et après celle de l'asr jusqu'à son coucher. Et comme la prosternation fait partie de la prière, il est inconvenable de réciter du Coran, où il y a une prosternation en ces deux moments». On demanda à Malek au sujet de celui qui récite du Coran où il y a une prosternation alors que sa femme a ses menstrues: doit-elle se prosterner»? Il répondit: «ni l'homme, ni la femme n'auront à se prosterner, que quand ils sont en état de pureté». On demanda à Malek, , au sujet d'une femme qui récite du Coran, où il y a une prosternation, alors que son mari est à l'écoute; doit-il se prosterner avec elle II répondit: «Il n'aura pas à se prosterner, car à vrai dire; la prosternation n'est d'exigence que lorsque l'homme se trouve avec d'autres en présidant la prière, alors il récite le verset où il y a une prosternation, il se prosterne et les hommes la font avec lui. Mais au cas où un homme entend un tel verset récité par un autre qui n'est pas son imam, il ne doit pas faire la prosternation. Chapitre VI Les deux sourates «al-Ikhlas et al-Mulk",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 485
			}
		},
		{
			"hadithnumber": 486,
			"arabicnumber": 486,
			"text": "Abou Sa'id Al Khoudri a entendu un homme, réciter toujours en priant, la sourate «al-Ikhlas» (Coran CXII). Comme il trouvait que cette sourate n'est pas tellement suffisante, il se rendit, le matin chez l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) pour lui faire part de cela. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui répondit: «Par celui, qui tient mon âme en Sa main, cette sourate est évaluée au tiers du Coran»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 486
			}
		},
		{
			"hadithnumber": 487,
			"arabicnumber": 487,
			"text": "Abou Houraira a rapporté: «Venant avec l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) Il entendit un homme qui récitait sourate «al-Ikhlas», il dit: «il lui est assuré». Je lui demandai: «qu'est-ce qui lui est assuré, Ô Envoyé d'Allah»? Il répondit: «le Paradis». Et Abou Houraira ajouta: «Je voulus aller, annoncer la bonne nouvelle, à cet homme, mais je craignis manquer le déjeuner avec l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah); ainsi je me décidai d'avoir, d'abord, le déjeuner avec l'Envoyé d'Allah (salallahou alayhi wa salam), puis de me rendre chez l'homme, mais il était déjà parti»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 487
			}
		},
		{
			"hadithnumber": 488,
			"arabicnumber": 488,
			"text": "Ibn Chéhab a rapporté que Houmaid Ibn Abdel-Rahman Ibn Awf lui a dit la sourate: «al-Ikhlas» équivaut au tiers du Coran et la sourate «al-Mulk» intercédera pour celui qui l'aurait récitée». Chapitre VII Le rappel d'Allah le Béni et le Très-Haut",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 488
			}
		},
		{
			"hadithnumber": 489,
			"arabicnumber": 489,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «celui qui dit cent fois par jour :« Il n'y a pas d'autre divinité que Allah, l'Unique, II n'a pas d'associé, à Lui la Royauté et la Louange, II est puissant sur toute chose», ces mots lui équivaudront l'affranchissement de dix esclaves, cent bonnes actions lui seront comptées, et cent autres mauvaises effacées. Ils le préserveront du démon toute la journée jusqu'à ce qu'il soit au soir. Nul n'aura acquis mieux que lui qu'un autre qui aura répété ces mots plus que lui»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 489
			}
		},
		{
			"hadithnumber": 490,
			"arabicnumber": 490,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «celui qui dit cent fois par jour: «Gloire et Louange à Allah, ses fautes lui seront effacées même si elles étaient quantitativement comme l'écume de la mer»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 490
			}
		},
		{
			"hadithnumber": 491,
			"arabicnumber": 491,
			"text": "Abou Houraira a dit: «celui, qui, après chaque prière, glorifie Allah (soubahnallah) trente trois fois, proclame sa grandeur (AllahouAkbar) trente trois fois. Le loue (Allamdoulillah) trente trois fois et termine ces mots par: «Il n'y a pas d'associé, à Lui la royauté et la louange. II est puissant sur toute chose», celui-là aura tous ses péchés effacés, même s'ils étaitent aussi nombreux que l'écume de la mer»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 491
			}
		},
		{
			"hadithnumber": 492,
			"arabicnumber": 492,
			"text": "Oumara Ibn Sayyad a rapporté qu'il a entendu Sa'id Abdallah Ibn AI-Moussaiab dire au sujet «des bonnes actions impérissables» (Coran XVIII, 46) qu'elles sont ces paroles que le serviteur profère: «Allah est grand. Gloire à Allah. Louange à Allah. Il n'y a d'autre divinité que Allah. Il n'y a ni puissance, ni force qu'en Allah»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 492
			}
		},
		{
			"hadithnumber": 493,
			"arabicnumber": 493,
			"text": "Ziad Ibn Abi Ziad a rapporté que Abou Dardaa a dit: «Vous dirai-je quelles sont vos meilleures œuvres, les plus élevées de vos degrés, les plus pures auprès de votre Souverain, qui vous seront de beaucoup plus valables que ce qu'on vous donne d'or et d'argent, de rencontrer votre ennemi et le tuer ou qu'il vous tuera»? On lui répondit: «Certes, oui». Il répliqua: «C'est la mention (zhikr) d'Allah». Ziad Ibn Ziad ajouta: «Abou Abdel Rahman Mou'az Ibn Jabal a dit: «Parmi toutes les œuvres du fils d'Adam, seule l'œuvre, de la mention d'Allah, peut le sauver du châtiment d'Allah»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 493
			}
		},
		{
			"hadithnumber": 494,
			"arabicnumber": 494,
			"text": "Rifa'a Ibn Rafé a rapporté: «un jour, en faisant la prière derrière l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah), il dit en relevant la tête de l'inclinaison: «Allah écoute ceux qui le louent» (Sami Allahu liman hamidah). Un homme derrière lui s'écria:«Notre Seigneur, à Toi la louange, des louanges nombreuses bénies et bonnes». (Rabbana wa laka'l hamd kathiran tayiban mubarakan fihi).La prière achevée, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah)( demanda: «qui a donc proféré ces mots que je viens d'entendre»? L'homme lui répondit: «c'est moi, ô Envoyé d'Allah»! L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) répliqua: «J'ai vu plus de trente anges qui se hâtaient et chacun voulait être le premier à écrire ces mots». Chapitre VIII De l’invocation d'Allah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 494
			}
		},
		{
			"hadithnumber": 495,
			"arabicnumber": 495,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Chaque Prophète (salallahou alayhi wa salam) a eu une invocation que Allah exauce; quant à la mienne, je désire la garder jusqu'au jour de la résurection afin qu'elle soit une intercession pour ma communauté»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 495
			}
		},
		{
			"hadithnumber": 496,
			"arabicnumber": 496,
			"text": "On fit savoir à Yahia Ibn Sa'id que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) invoquait Allah par ces mots: «Grand Seigneur, c'est Toi qui ouvre l'aube. Toi qui assigne la nuit au repos, qui fais du soleil et de la lune une mesure de temps! Acquitte-moi de ma dette, enrichis-moi de la pauvreté, et fais-moi jouir de mon ouie, de ma vue, et de ma force dans Ton chemin». (Allahumma faliqa'l isbah, wa ja ila'l-layli sakana, wa'sh-shamsi wa'l-qamari housbana. iqdi anniy addayna, wa'ghnaniy mina'l faqr. Na'mti aniy bi samiy wa basariy, wa qouwwatiy fi sabilik)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 496
			}
		},
		{
			"hadithnumber": 497,
			"arabicnumber": 497,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «lorsque l'un de vous invoque Allah, qu'il ne dise pas: «Grand Allah! Pardonne-moi, si Tu veux; Fais-moi, miséricorde, si Tu veux! Plutôt, qu'il affirme dans sa requête. Nul, n'oblige Allah à ne pas exaucer»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 497
			}
		},
		{
			"hadithnumber": 498,
			"arabicnumber": 498,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «chacun de vous sera exaucé, à moins qu'il ne se hâte et qu'il ne se dise: «J'ai invoqué, mais je n'ai pas été exaucé»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 498
			}
		},
		{
			"hadithnumber": 499,
			"arabicnumber": 499,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Allah Le Béni et Le Très-Haut, descend chaque nuit dans le ciel d'ici-bas, lorsque le premier tiers de la nuit s'est écoulé et dit:«Qui M'invoque, afin que je l'exauce? Qui Me demande afin de lui donner? Qui implore Mon pardon afin que Je le lui accorde»?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 499
			}
		},
		{
			"hadithnumber": 500,
			"arabicnumber": 500,
			"text": "Aicha, la mère des croyants a rapporté: «m'étant couchée tout près de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah), je m'éveillai et ne le trouvai pas; je fis promener ma main, et elle toucha ses pieds alors qu'il se prosternait en invoquant Allah par ces mots: «Je me réfugie auprès de Ta satisfaction contre Ton courroux, auprès de Ton pardon contre Ton châtiment, auprès de Toi contre Toi. Je ne puis dénombrer Tes éloges, Toi Tu est comme Tu t'es loué».( Aoudhou bi ridaka min sakhatika, wa bi mouafatika min ouqoubatika wa bika minka, la ouhsiy thana'an alayka, anta kama athnayta ala nafsika)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 500
			}
		},
		{
			"hadithnumber": 501,
			"arabicnumber": 501,
			"text": "Talha Ibn Oubaidallah Ibn Kariz a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «l'invocation la plus méritoire est celle faite le jour de «Arafa». Et les meilleures paroles que j'ai proférées ainsi que tous les Prophètes qui m'ont devancé, sont ce qui suit: «II n'y a d'autre divinité que Allah, l'Unique, il n'a pas d'associé».( (La ilaha illa'llah, wahdahou la sharika lah)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 501
			}
		},
		{
			"hadithnumber": 502,
			"arabicnumber": 502,
			"text": "Abdallah Ibn Abbas a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) enseignait aux fidèles cette invocation, comme s'il leur enseignait la sourate du Coran: «Grand Allah! Je me réfugie auprès de Toi contre le châtiment de la Géhenne; je me réfugie auprès de Toi contre le tourment de la tombe; je me réfugie auprès de Toi contre la tentation de l'antéchrist; et je me réfugie auprès de Toi contre les épreuves de la vie et de la mort».( Allahumma inniy audhu bika min adhabi jahannama, wa audhu bika min adhabi'l-qabri, wa audhu bika min fitnati'l-mahya wa mamati)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 502
			}
		},
		{
			"hadithnumber": 503,
			"arabicnumber": 503,
			"text": "Abdallah Ibn Abbas a rapporté: «quand l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) s'éveillait, pour prier, au milieu de la nuit, il invoquait Allah par ces mots: «Grand Allah! A Toi la louange. Tu es la lumière des cieux et de la terre, et de ce qu'il y a entre eux. Tu es la Vérité, Tes paroles sont la Vérité, Ta promesse est la vérité. Ta rencontre est une Vérité. Le Paradis est une Vérité, l'Enfer est une Vérité, l'Heure suprême est une Vérité. Grand Allah! Je me remets entièrement à Toi, je crois en Toi, je me confie à Toi, je reviens à Toi. C'est grâce à Toi que je plaide (la vérité) et c'est Toi que je prends le jugement. Pardonne-moi ce que j'ai devancé et ce que je retarderai, ce que je fais en cachette et ce que je fais en publique. Toi, tu es mon Allah, il n'y a d'autre Allah que Toi». (Allahoumma laka'l-hamdou anta nourou's-samawati wa'l-ardi, wa laka'l-hamdou anta qayamou's-Samawati wa'l-ardi, wa laka'l-hamdou anta rabbou's-Samawati wa'l-ardi,wamanfihina.Anta'l-haqqou,waqaouwlouka'lhaqqu, wa wadouka'l-haqqou, wa liqa'ouka haqqoun, wa jannatou haqqoun, wa naoru haqqoun, wa sactou haqqoun. Allahoumma laka aslamtou, wa bikaamantou, waalayka tawakaltou, wa ilayka anabtou, wa bika khasamtou, wa ilayka hakamtou, fa'ghfirliy ma qadamtou wa akhartou wa asrartou, wa alantou. Anta ilahiy, la ilaha illa ant)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 503
			}
		},
		{
			"hadithnumber": 504,
			"arabicnumber": 504,
			"text": "Abdallah Ibn Abdallah Ibn Jaber Ibn Atik a rapporté: «Abdallah Ibn Omar vint nous trouver avec quelques uns de Bani Mou'awia dans un des villages des Ansars, et il nous dit: «Savez-vous, en quel endroit de votre mosquée, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a-t-il fait la prière»? Je lui répondis: «Oui», et je lui indiquai un certain côté. Puis il me demanda: «Connais-tu, les trois invocations qu'il a formulées»? Je lui dis: «Oui». Il me demanda enfin: «Dis-les moi, donc». Je répliquai: «Il a invoqué Allah, de ne plus donner la victoire à un ennemi s'il n'a pas des leurs (un des musulmans), de ne plus les faire périr par la disette, et Allah les a exaucées. Il a enfin invoqué Allah afin de ne plus s'entretuer, mais Allah la lui a refusée». Abdallah me répondit: «tu as dit vrai». Ibn Omar ajouta: «la tuerie ne cessera, jusqu'au jour de la résurrection»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 504
			}
		},
		{
			"hadithnumber": 505,
			"arabicnumber": 505,
			"text": "Malek a rapporté que Zaid Ibn Aslam disait: «chaque invocation que formule un homme aura un de ces trois résultats: elle sera exaucée, ou épargnée (jusqu'au jour de la résurrection) ou elle sera une expiation de ses péchés». Chapitre IX La façon d'invoquer",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 505
			}
		},
		{
			"hadithnumber": 506,
			"arabicnumber": 506,
			"text": "Abdallah Ibn Dinar a rapporté' «Abdallah Ibn Omar m'a vu invoquer Allah en levant deux doigts (un de chaque main), il m'a interdit de faire cela»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 506
			}
		},
		{
			"hadithnumber": 507,
			"arabicnumber": 507,
			"text": "Yahia Ibn Sa'id a rapporté que Sa'id Ibn Al-Moussaiab disait: «L'homme sera élevé (de degrés dans le Paradis) grâce aux invocations de ses enfants après sa mort\". Disant cela, il leva ses mains vers le ciel",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 507
			}
		},
		{
			"hadithnumber": 508,
			"arabicnumber": 508,
			"text": "Hicham Ibn Ourwa a rapporté que son père a dit: «Ce verset n'a été révélé qu'au sujet des invocations: «Lorsque tu pries: n'élève pas la voix, ne prie pas à voix basse, cherche un mode intermédiaire» (Coran XVII, 110). On demanda à Malek au sujet d'une invocation écrite qu'on fait au cours de la prière canonique? Il répondit: «Il n'y a pas de mal à cela»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 508
			}
		},
		{
			"hadithnumber": 509,
			"arabicnumber": 509,
			"text": "On rapporta à Malek que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) invoquait Allah et disait: «Grand Allah! Je te demande (de m'aider) à faire les bonnes œuvres, de laisser ce qui est blâmable, d'être compatissant pour les pauvres. Si Tu veux infliger une tentation aux gens, recueille mon âme sans être éprouvé». (Allahoumma inniy asa'louka fala'l-khayrati, wa tarqa'l-mounqarati, wa houbba'l-masakin, wa idha aradta fi'n-nasi fitnatan fa'qbithni ilayka ghayra maftoun)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 509
			}
		},
		{
			"hadithnumber": 510,
			"arabicnumber": 510,
			"text": "• On rapporta à Malek que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Tout homme qui invite à une voie droite, aura une récompense équivalante à celle de ceux qui le suivront sans que pour autant celle de ceux qui l'ont suivi en soit diminuée. Tout homme qui invite à un égarement, supportera un fardeau égal aux fardeaux de ceux qui l'ont suivi, sans toutefois que les fardeaux de ceux qui l'ont suivi ne soient diminués»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 510
			}
		},
		{
			"hadithnumber": 511,
			"arabicnumber": 511,
			"text": "On rapporta à Malek que Abdallah Ibn Omar a dit: «Grand Allah! Fais que je sois un leader de ceux qui représentent Ta crainte». (Allahumma jalniy min a'imati'l-moutaqin)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 511
			}
		},
		{
			"hadithnumber": 512,
			"arabicnumber": 512,
			"text": "On rapporta à Malek, que Abou Al-Darda s'éveillait au milieu de la nuit et disait: «les yeux se sont endormis, les étoiles ont disparu et Toi Tu es le Vivant, l'Eternel Allah»!. Chapitre X L'interdiction de faire une prière après celle de l'aurore et après celle de l’asr",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 512
			}
		},
		{
			"hadithnumber": 513,
			"arabicnumber": 513,
			"text": "Abdallah Ibn Al-Sounabihi a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «lorsque le soleil se lève, la corne du démon l'accompagne; ainsi, quand il se rehausse dans l'horizon, cette corne disparaîtra; lorsqu'il sera au milieu du ciel, la corne accompagnera le soleil; et une fois que celui-ci aura quitté le méridien, elle se séparera le lui. Lorsque le soleil sera à son coucher, la corne de nouveau l'accompagnera; et une fois que le soleil s'est couché, elle le quittera». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a interdit la prière en ces moments-là",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 513
			}
		},
		{
			"hadithnumber": 514,
			"arabicnumber": 514,
			"text": "Ourwa a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) disait: «Lorsque le rond solaire commence à faire son apparition, retardez la prière jusqu'à son apparition complète; et lorsque le cadran solaire est à sa disparition, retardez la prière jusqu'à sa complète disparition»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 514
			}
		},
		{
			"hadithnumber": 515,
			"arabicnumber": 515,
			"text": "Al'-Ala Ibn Abdel Rahman a rapporté: «étant entrés, un après-midi chez Anas Ibn Malek, nous le vîmes faire la prière de l'asr. La prière achevée, nous lui fîmes l'observation d'avoir hâté la prière ou même, c'est lui qui l'a mentionné, puis il dit: «J'ai entendu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dire: «Telle est la prière des hypocrites» (en reprenant cette expression pour trois fois) ;c'est que l'un de vous s'assit attendant que le soleil soit jauni,et qu'il soit entre deux cornes du démon ou sur une corne du démon alors il se lève pour faire une prière de quatre raka'ts, en hâte sans penser guère à Allah»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 515
			}
		},
		{
			"hadithnumber": 516,
			"arabicnumber": 516,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r Sur lui la grâce et la paix d'Allah a dit: «Que l'un de vous, ne cherche pas a faire la priere ni au lever, ni au coucher du soleil»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 516
			}
		},
		{
			"hadithnumber": 517,
			"arabicnumber": 517,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a interdit de faire une prière après celle de l’asr jusqu'au coucher du soleil, et après celle de l'aurore avant le lever du soleil»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 517
			}
		},
		{
			"hadithnumber": 518,
			"arabicnumber": 518,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 518
			}
		},
		{
			"hadithnumber": 519,
			"arabicnumber": 519,
			"text": "Al-Saeb Ibn Yazid a rapporté qu'il a vu Omar Ibn Al-Khattab frapper Al-Mounkader alors qu'il faisait une prière après celle de l'asr». MOUATTAA Au Nom d’Allah Le Clément Le Miséricordieux Livre 16 Les funérailles Chapitre Premier La lotion du mort. (517 1 Ja'far Ibn Mouhammad a rapporté d'après son père que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a été lavé, alors qu'il ne portait qu'une seule tunique»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 519
			}
		}
	]
}