{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"18": "Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 630,
			"arabicnumber": 630,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 630
			}
		},
		{
			"hadithnumber": 631,
			"arabicnumber": 631,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Le mois est de vingt et neuf jours; ne jeûnez pas avant d'avoir vu le croissant, et de ne pas interrompre le jeûne avant que cette visibilité n'eût lieu; et si elle n'en est pas, faire une supputation",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 631
			}
		},
		{
			"hadithnumber": 632,
			"arabicnumber": 632,
			"text": "Abdallah Ibn Abbas a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) en mentionnant Ramadan, a dit: «ne jeûnez pas avant d'avoir vu le croissant de lune, et n'arrêtez pas le jeûne avant que vous ne l'ayez vu; si il n'est pas visible, complétez le mois à trente jours»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 632
			}
		},
		{
			"hadithnumber": 633,
			"arabicnumber": 633,
			"text": "On rapporta à Malek, que la nouvelle lune, au temps de Osman, a été de vue dans l'après-midi. Osman continua son jeûne et ne le romput que le soir, au coucher du soleil». Yahia a rapporté qu'il a entendu Malek dire au sujet de l'homme qui voit tout seul la nouvelle lune de Ramadan: «II doit jeûner, et ne pas rompre son jeûne, sachant, que ce jour est le début de Ramadan». Malek a dit aussi: «Celui qui, tout seul, voit la lune de Chawal, ne doit pas rompre le jeûne, car les gens, accuseront, d'un manque de confiance, celui qui rompra son jeûne, en disant: «Nous avons vu la nouvelle lune». Celui, qui voit donc, la lune de Chawal, durant le jour, ne doit pas interrompre son jeûne, mais le continuera jusqu'à la fin du jour; et cette lune n'est autre que le signe de la nuit qui va suivre». Yahia a rapporté encore qu'il a entendu Malek, dire: «Si les gens sont à jeun, le jour du fitr, croyant que c'est un jour de Ramadan, puis qu'on les avertit que la lune de Ramadan, était visible, un jour avant qu'ils n'aient commencé le jeûne et que ce jour de leur jeûne sera le trente et unième du mois, ils doivent rompre leur jeûne ce même jour-là, juste à l'heure où ils ont été avertis, cependant, sans qu'ils ne fassent la prière de la fête, surtout si l'avertissement a eu lieu après que le soleil ait quitté le méridien». Chapitre II De celui qui s'est décidé de jeuner avant l'aube",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 633
			}
		},
		{
			"hadithnumber": 634,
			"arabicnumber": 634,
			"text": "Nafe' a rapporté que Abdallah Ibn Omar disait: «le jeûne n'est valable, que pour celui qui s'est décidé avant l'aube». (....) 6 - Malek a rapporté d'après Ibn Chéhab que Aicha et Hafsa les femmes du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) ont rapporté le même hadith». Chapitre III De la hâte pour couper le jeûne",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 634
			}
		},
		{
			"hadithnumber": 635,
			"arabicnumber": 635,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 635
			}
		},
		{
			"hadithnumber": 636,
			"arabicnumber": 636,
			"text": "Sahl Ibn Sa'd Al-Sa'idi a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Les gens seront toujours dans le bien, tant qu'ils hâteront l'arrêt du jeûne (juste après le coucher du soleil)»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 636
			}
		},
		{
			"hadithnumber": 637,
			"arabicnumber": 637,
			"text": "Sa'id Ibn Al-Moussaiab a rapporté l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Les gens en seront toujours dans le bien,tant qu'ils se dépêchent de rompre le jeûne»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 637
			}
		},
		{
			"hadithnumber": 638,
			"arabicnumber": 638,
			"text": "Houmaid Ibn Abdel-rahman a rapporté que Omar Ibn Al-Khattab et Osman Ibn Affan, faisaient la prière du coucher du soleil, tout en observant l'obscurité de la nuit, avant d'arrêter le jeûne, et cela durant le mois de Ramadan». Chapitre IV Du jeûne de celui qui, au matin du mois de Ramadan devient rituellement impur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 638
			}
		},
		{
			"hadithnumber": 639,
			"arabicnumber": 639,
			"text": "Abou Younous, l'affranchi de Aicha, a rapporté qu'elle a dit: «J'ai entendu un homme, qui, à la porte de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui a dit: «ô Envoyé d'Allah! il m'arrive, que je sois rituellement impur, le matin, alors que, je me suis décidé de jeûner ce jour. Il lui répondit: «Cela m'arrive aussi; or je me purifie et je jeûne». L'homme objecta: «Ô Envoyé d'Allah! Tu ne nous es pas semblable, car Allah t'a pardonné tes fautes antérieures et postérieures». Irrité, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui répondit: «Par Allah! Je souhaite être l'homme qui de tous, redoute Allah le plus, et connaît le mieux la cause de ma crainte»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 639
			}
		},
		{
			"hadithnumber": 640,
			"arabicnumber": 640,
			"text": "Abou Bakr Ibn Abdel-Rahman Ibn Al-Hareth Ibn Hicham a rapporté que Aicha et Oum Salama, les femmes de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) ont dit: «il arrivait que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) à Ramadan, se trouvait le matin, en état d'impureté rituelle, à la suite des rapports charnels, et il jeûnait le jour»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 640
			}
		},
		{
			"hadithnumber": 641,
			"arabicnumber": 641,
			"text": "Abou Bakr Ibn Abdel-Rahman Ibn al-Hareth Ibn Hicham a rapporté: «Nous étions, mon père et moi chez Marwan Ibn Al-Hakam, alors qu'il était gouverneur à Médine. On lui fit savoir que Abou Houraira avait dit: «Celui qui, le matin, se trouve impur rituellement, il ne doit pas jeûner». Marwan s'écria: «Je te conjure ô Abdel-Rahman, de te rendre chez les deux mères des croyants Aicha et Oum Salama, et de leur demander à ce sujet». Nous nous rendîmes, Abdel-Rahman et moi chez Aicha; une fois entrés chez elle, Abdel-Rahman la salua et lui dit: «Nous étions chez Marwan Ibn Al-Hakam à qui l'on a rapporté que Abou Houraira avait dit: «Celui, qui est impur rituellement, au matin, ne jeûnera pas le jour». Aicha répondit: «Ô Abdel-Rahman, ce n'est pas comme a dit Abou Houraira; sauf si tu veux agir, autrement qu’a fait l'Envoyé d'Allah (salallahou alayhi wa salam)».r Abdel-Rahman répondit: «non»; Aicha reprit: «Je témoigne qu'il arrivait à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) d'être rituellement impur le matin, à la suite des rapports charnels, et pourtant il jeûnait le jour (après avoir fait la lotion)». Nous quittâmes Aicha, et nous nous trouvâmes chez Oum Salama, que Abdel Rahman interroge à propos du même sujet, et de qui il reçu la même réponse que celle de Aicha. Rentrés chez Marwan Ibn Al-Hakam Abdel-Rahman lui fit un rapport sincère de ce qu'il a entendu de Aicha et de Oum Salama. Marwan dit: «Ô Abou Mouhammad, je te conjure d'enfourcher ma monture qui est à la porte, et d’aller chez Abou Houraira qui est à présent, dans son terrain à Al-aqiq, afin que tu lui racontes, ce que tu as entendu». Abdel-Rahman enfourcha la monture, et je l'accompagnai jusqu'à ce que nous soyons arrivés chez Abou-Houraira. Abdel-Rahman, s'entretint avec lui pour une heure et l'informa de ce qu'il avait entendu; Abou-Houraira lui répondit: «Je ne savais rien de tout cela, car pour ma part, c'est un homme qui me l'avait rapporté»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 641
			}
		},
		{
			"hadithnumber": 642,
			"arabicnumber": 642,
			"text": "Abou Bakr Ibn Abdel-Rahman a rapporté que Aicha et Oum Salama, les femmes du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) avaient dit: «Il arrivait que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) soit rituellement impur le matin, à la suite de rapports charnels, et il jeûnait le jour (après la lotion)». Chapitre V Du baiser toléré à sa femme pour celui qui jeûne",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 642
			}
		},
		{
			"hadithnumber": 643,
			"arabicnumber": 643,
			"text": "Ata Ibn Yassar a rapporté qu'un homme a embrassé sa femme alors qu'il jeûnait, en Ramadan. Se trouvant profondément chagriné, il demanda à sa femme de se renseigner à ce sujet. Elle se rendit chez Oum Salama, l'épouse du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) à qui, elle fit part de son état. Oum Salama lui répondit: «Il arrivait que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) embrassait ses femmes, alors qu'il jeûnait». Revenant chez elle, la femme rapporta à son mari, ce qu'elle a entendu dire, ce qui allait exciter son chagrin, et il dit: «nous ne sommes pas comme l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) à qui Allah rendit licite ce qu'il voulut». Sa femme retourna, de nouveau chez Oum Salama, chez qui se trouvait l'Envoyé d'Allah (salallahou alayhi wa salam).r Il demanda à Oum Salama: «Qu'a-t-elle, cette femme»? Elle le mit au courant de son interrogation. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui répliqua: «Ne lui as-tu pas dit, que je fais de pareil». «Je lui ai dit cela, dit Oum Salama; mais une fois de retour chez son mari, lui rapportant ma réponse, cela redouble son chagrin, et il dit: nous ne sommes pas comme l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), à qui Allah rendit licite ce qu'il voulut». Apprenant cela, l'Envoyé d'Allah (salallahou alayhi wa salam),r tout en colère, s'écria: «Par Allah! Je redoute Allah plus que quiconque, , et je connait bien ses prescriptions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 643
			}
		},
		{
			"hadithnumber": 644,
			"arabicnumber": 644,
			"text": "Ourwa a rapporté que Aicha la mère des croyants que Allah l'agrée a dit: «Il arrivait que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) embrassait quelques unes de ses femmes, tout en faisant le jeûne», puis elle se mit à rire",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 644
			}
		},
		{
			"hadithnumber": 645,
			"arabicnumber": 645,
			"text": "Atika, la fille de Zaid Ibn Amr Ibn Noufail, la femme de Omar Ibn Al-Khattab, a rapporté, qu'elle embrassait la tête de Omar Ibn Al-Khattab, alors qu'il jeûnait, et lui ne le lui interdisait pas",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 645
			}
		},
		{
			"hadithnumber": 646,
			"arabicnumber": 646,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 646
			}
		},
		{
			"hadithnumber": 647,
			"arabicnumber": 647,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 647
			}
		},
		{
			"hadithnumber": 648,
			"arabicnumber": 648,
			"text": "On rapporta à Malek, que Aicha, la femme du Prophète (salallahou alayhi wa salam),r en parlant de la façon dont l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) embrassait (ses femmes) quand il était à jeûne disait: «qui peut donc mieux se maîtriser que l'Envoyé d'Allah »? Ourwa Ibn Al-Zoubair a dit: «Je ne vois pas de bien pour le baiser, de celui qui jeûne»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 648
			}
		},
		{
			"hadithnumber": 649,
			"arabicnumber": 649,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 649
			}
		},
		{
			"hadithnumber": 650,
			"arabicnumber": 650,
			"text": "Ata Ibn Yassar a rapporté qu'on demanda Abdallah Ibn Abbas au sujet du jeûneur qui embrasse sa femme? Il l'a toléré aux personnes âgées, et l'a répugné pour les jeunes»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 650
			}
		},
		{
			"hadithnumber": 651,
			"arabicnumber": 651,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 651
			}
		},
		{
			"hadithnumber": 652,
			"arabicnumber": 652,
			"text": "Abdallah Ibn Abbas a rapporté que, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) quitta pour la Mecque, l'an de la conquête, au mois de Ramadan. Il demeura à jeun, jusqu'à son arrivée à «Al-Kadid», où il le rompit, et les gens firent de même. Ils ne faisaient que suivre la tradition la plus récente de l'Envoyé d'Allah (salallahou alayhi wa salam).r",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 652
			}
		},
		{
			"hadithnumber": 653,
			"arabicnumber": 653,
			"text": "Abou Bakr Ibn Abdel-Rahman a rapporté d'après quelques uns des compagnons de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) qu'il avait ordonné aux hommes, durant son voyage, l'an de la conquête, de rompre leur jeûne. Et il leur dit: «soyez bien robustes afin que vous puissiez affronter votre ennemi», quant à lui, il restait à jeun» . Abou Bakr ajouta: «Celui qui ma' rapporté ce hadith, a dit: «J'ai vu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) à «Al-Araj»», verser de l'eau sur sa tête à cause de la soif et de la chaleur. Puis on demanda à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah): «Ô, Envoyé d'Allah il y a un bon groupe de gens qui ont jeûné quand tu as jeûné»! Arrivé à «Al-Kadid», l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) demanda de lui apporter un verre d'eau, il en but et les gens suspendirent leur jeûne»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 653
			}
		},
		{
			"hadithnumber": 654,
			"arabicnumber": 654,
			"text": "Anas Ibn Malek a rapporté: «Nous étions dans une expédition avec l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) au mois de Ramadan. Ceux qui étaient à jeun n'ont rien reproché à ceux qui ne l'étaient pas et réciproquement»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 654
			}
		},
		{
			"hadithnumber": 655,
			"arabicnumber": 655,
			"text": "Ourwa a rapporté qu Hamza Ibn Amr Al-Aslami demanda à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah): «Ô Envoyé d'Allah! Je suis un homme qui jeûne; cependant dois-je jeûner en voyage»? Il lui répondit: «si tu veux, jeûne, sinon tu peux ne pas le faire»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 655
			}
		},
		{
			"hadithnumber": 656,
			"arabicnumber": 656,
			"text": "Nafe' a rapporté que Abdallah Ibn Omar, ne jeûnait pas au cours d'un voyage",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 656
			}
		},
		{
			"hadithnumber": 657,
			"arabicnumber": 657,
			"text": "Hicham Ibn Ourwa a rapporté qu'il voyageait avec son père au mois de Ramadan; Ourwa jeûnait et les autres ne jeûnaient pas, et pourtant il ne leur ordonnait pas de jeûner. Chapitre VIII Ce qu'un homme, rentrant d'un voyage ou comptant entamer un, doit faire au mois de Ramadan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 657
			}
		},
		{
			"hadithnumber": 658,
			"arabicnumber": 658,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 658
			}
		},
		{
			"hadithnumber": 659,
			"arabicnumber": 659,
			"text": "Abou Houraira a rapporté qu'un homme a rompu son jeûne en Ramadan, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui ordonna l'expiation de son acte, par l'affranchissement d'un esclave, ou par le jeûne qui doit couvrir deux mois successifs (à l'exception du mois de Ramadan), ou par le manger offert à soixante pauvres». L'homme répondit: «Je ne peux faire ni l'un, ni l'autre». On fit apporter, à ce moment à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) un couffin contenant de dattes; il dit à l'homme: «Prends cela, afin de faire l'aumône» II lui répondit: «nul, n'en a besoin. plus que moi». L'Envoyé d'Allah (Sur lui la grâce et la paix d'Allah) se mit à rire, à tel point que ses canines parurent, et dit à l'homme: «Manges-en donc»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 659
			}
		},
		{
			"hadithnumber": 660,
			"arabicnumber": 660,
			"text": "• Sa'id Ibn AI Moussaiab a rapporté qu'un bédouin arriva chez l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) en se frappant la poitrine, en tirant ses cheveux et disant: «Je suis perdu». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui demanda: «qu'as-tu»? «Je viens d'avoir des rapports charnels avec ma femme alors que je jeûne au mois de Ramadan» répondit l'homme. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui dit: «Es-tu capable d'affranchir un esclave» Non», répondit l'homme. «Es-tu capable de sacrifier une chamelle»? - «Non» répondit l'homme. «Assis-toi, donc»; on apporta, à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) à ce moment un couffin de dattes; il le donna à l'homme lui disant: «Prends cela, et fais-en une aumône». Le bédouin dit: «Nul, n'en a besoin, plus que moi». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dit: «manges-en, mais à jeûner un jour à titre d'expier ce que tu as commis». -Ata demanda à Sa'id Ibn Al Moussaiab: «quel était le poids des dattes contenues dans ce couffin»? Il lui répondit: «une affaire de quinze à vingt sa's». Malek a dit: «J'ai entendu les hommes versés dire: «Celui qui, pour avoir eu des rapports charnels avec sa femme, ou pour une autre cause, a rompu un jour de jeûne au mois de Ramadan, n'aura pas à faire expiation, comme d'ailleurs, cela a été mentionné par l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) au sujet de celui qui a eu déjà des rapports durant le jour; mais il aura à compenser ce jour, dans d'autres mois de l'année». C'est ce que, j'ai entendu de mieux dit à ce sujet. Chapitre X Celui qui à l’état de jeûne pratique une saignée",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 660
			}
		},
		{
			"hadithnumber": 661,
			"arabicnumber": 661,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 661
			}
		},
		{
			"hadithnumber": 662,
			"arabicnumber": 662,
			"text": "Ibn Chéhab a rapporté que Sa'd Ibn Abi Waqas et Abdallah Ibn Omar, se laisssaient faire une saignée alors qu'ils se trouvaient en état de jeûne»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 662
			}
		},
		{
			"hadithnumber": 663,
			"arabicnumber": 663,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 663
			}
		},
		{
			"hadithnumber": 664,
			"arabicnumber": 664,
			"text": "Ourwa a rapporté que Aicha, la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Le jour de Achoura, était un jour de jeûne pour les Qoraichites, dans la période antéislamique, et il en était de même, pour l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah). Et lorsque l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) était à Médine et qu'arriva, le jour de Achoura, , il le jeûna, et ordonna qu'on le jeûne. Mais quand fut prescrit le jeûne de Ramadan, il fut considéré le seul jeûne qu'il fallait suivre, et on suspend le jeûne du jour de Achoura, en laissant aux gens la liberté de le jeûner»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 664
			}
		},
		{
			"hadithnumber": 665,
			"arabicnumber": 665,
			"text": "Houmaid Ibn Abdel-Rahman Ibn Awf a rapporté qu'il a entendu Mou'awia Ibn Abi Soufian, l'année où il fit le pèlerinage, dire, le jour de Achoura, tout en étant en chaire: «Ô Médinois! où sont vos hommes versés? J'ai entendu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dire, au sujet de ce jour: «C'est le jour de Achoura, et Allah ne vous l'a pas prescrit, jour de jeûne. Pour moi, je le jeûne, pour vous autres, vous pouvez ou non, le jeûner»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 665
			}
		},
		{
			"hadithnumber": 666,
			"arabicnumber": 666,
			"text": "On rapporta à Malek, que Omar Ibn Al-Khattab a envoyé dire à Al-Hareth Ibn Hicham: «Demain, c'est le jour de Achoura, jeûne-le et ordonne ta famille de faire pareillement». Chapitre XII Du jeûne des deux jours le fitr et al-adha, et du jeûne omnitemporel",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 666
			}
		},
		{
			"hadithnumber": 667,
			"arabicnumber": 667,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a interdit de jeûner les deux jours du fitr (suspension du jeûne) et de al-adha (le jour du sacrifice)»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 667
			}
		},
		{
			"hadithnumber": 668,
			"arabicnumber": 668,
			"text": "Malek a rapporté qu'il a entendu, les hommes versés dire: «il n'y a pas de mal de procéder à un jeûne continuel, mais à l'exception du jeûne pour les deux jours qu’il a d'ailleurs été interdit de jeûner à savoir le jour du fitr, et celui de al-adha; tel est ce qui nous a été parvenu». Malek ajouta: tel est de ce que j'ai de mieux préféré». Chapitre XIII De l'interdiction de faire un jeûne continu (pour deux jours qui s’ensuivent)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 668
			}
		},
		{
			"hadithnumber": 669,
			"arabicnumber": 669,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 669
			}
		},
		{
			"hadithnumber": 670,
			"arabicnumber": 670,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 670
			}
		},
		{
			"hadithnumber": 671,
			"arabicnumber": 671,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 671
			}
		},
		{
			"hadithnumber": 672,
			"arabicnumber": 672,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 672
			}
		},
		{
			"hadithnumber": 673,
			"arabicnumber": 673,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 673
			}
		},
		{
			"hadithnumber": 674,
			"arabicnumber": 674,
			"text": "Khaled Ibn Aslam a rapporté que Omar Ibn Al-Khattab, a suspendu son jeûne, un jour de Ramadan, du moment que le ciel étant nuageux, et croyant que le soleil avait disparu. Un homme vint lui dire: «Ô prince des croyants! Le soleil est apparu »; Omar répondit: «ce que je viens de faire n'est pas grave, et je n'ai fait que l'application de mes propres lumières». Et Malek, en voulant expliquer ce qui précède dit: «Omar, désigne par «ce n'est pas grave», qu'il compte compenser le jour où le jeûne a été rompu , par un autre, car il n'est question que d'un seul jour qui est si facile à jeûner». Et Allah à ce sujet est le plus informé»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 674
			}
		},
		{
			"hadithnumber": 675,
			"arabicnumber": 675,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 675
			}
		},
		{
			"hadithnumber": 676,
			"arabicnumber": 676,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 676
			}
		},
		{
			"hadithnumber": 677,
			"arabicnumber": 677,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 677
			}
		},
		{
			"hadithnumber": 678,
			"arabicnumber": 678,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 678
			}
		},
		{
			"hadithnumber": 679,
			"arabicnumber": 679,
			"text": "Malek a rapporté que Houmaid Ibn Qais Al-Makki lui a raconté: «J'étais avec Moujahed, dans une tournée processionnelle autour de la Ka'ba, quand un homme vint lui demander à propos du jeûne des jours d'expiation, s'ils sont à faire sans interruption ou séparés? Houmaid lui répondit: «Certes, il peut les séparer en jeûnant». Mais Moujahed ajouta: «Il doit, les jeûner sans interruption, car selon la récitation de Oubai Ibn Ka'b, ils doivent être trois jours de suite». Malek a ajouta: «Il est préférable qu'ils soient jeûnés sans interruption, comme cela a été révélé par Allah dans le Coran». On demanda à Malek au sujet d'une femme qui jeûnant, en Ramadan, eut le matin un écoulement du sang, sans que ce soit ses menstrues, puis se met à l'attente du soir afin de voir si elle sera dans un état pareil, mais elle ne voit rien de cela. Puis le lendemain matin, elle aura un écoulement, moins que le premier, qui cesse même avant quelques jours de ses menstrues, que devra faire cette femme et pour son jeûne et sa prière»? Il répondit: «Cet écoulement est dû aux menstrues, ainsi, elle doit rompre son jeûne, et aura à compenser ces jours ultérieurement après le mois du jeûne. Une fois que ses menstrues cessent qu'elle fasse sa lotion et jeûne». On demanda à Malek, au sujet d'un homme qui, juste au dernier jour de Ramadan, s'est converti à l'Islam. Devra-t-il jeûner seulement le jour de sa conversion à l'Islam, ou tous les jours de ce mois»? Il répondit: «II n'a pas à jeûner les jours qui se sont écoulés, par compensation; mais il doit jeûner les jours qui leur font suite, bien que je préfère qu'il jeûne le jour où il s'est converti à l'Islam». Chapitre XVIII De l'acquittement du jeûne bénévole",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 679
			}
		},
		{
			"hadithnumber": 680,
			"arabicnumber": 680,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Munqar"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 680
			}
		},
		{
			"hadithnumber": 681,
			"arabicnumber": 681,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 681
			}
		},
		{
			"hadithnumber": 682,
			"arabicnumber": 682,
			"text": "On demanda à Abdallah Ibn Omar au sujet de la femme enceinte qui craint pour son fœtus, si le jeûne lui cause de la faiblesse? Il répondit: «Qu'elle cesse de jeûner et qu'elle donne à manger aux pauvres, pour chaque jour, un moudd de froment qui équivaut au moudd du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah)». Malek a dit: «Les hommes versés prévoient qu'elle doit jeûner d'autres jours par compensation, conformément aux paroles d'Allah à Lui la puissance et la gloire: «Celui d'entre vous qui est malade ou qui voyage, jeûnera ensuite un nombre égal de jours». Coran II, 184. Ils considèrent que sa grossesse et sa crainte sur son enfant ne sont qu'une maladie»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 682
			}
		},
		{
			"hadithnumber": 683,
			"arabicnumber": 683,
			"text": "Abdel Rahman Ibn al-Kassem a rapporté que son père disait: «Celui qui devait jeûner pour quelques jours et qu'il ne l'a pas fait, jusqu'à l'avènement du Ramadan suivant, il doit donner, pour chaque jour, à manger aux pauvres, un moudd de froment, en jeûnant ce qu'il doit de jours». (....) 55 - On rapporta à Malek que Sa'id Ibn Joubair était du même avis». Chapitre XX De l'acquittement du jeûne",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 683
			}
		},
		{
			"hadithnumber": 685,
			"arabicnumber": 685,
			"text": "Malek a entendu, les hommes versés dans la religion, interdire le jeûne du jour duquel on doute au mois de Cha'ban, si l'on a l'intention de le considérer le premier jour de Ramadan. Et, ils ont considéré que celui qui l'aura jeûné sans la vision de la nouvelle lune (de Ramadan) à la suite de quoi, l'on vient assurer que c'est, en fait, le premier jour de Ramadan, il doit le jeûner un autre jour, et ils ne trouvent pas de mal à jeûner ce jour comme étant surérogatoire». Et Malek ajoute: «Tel est ce qui est de nos traditions, et qui était d'ailleurs de suivi à Médine». Chapitre XXII Le jeûne et son mérite",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 685
			}
		},
		{
			"hadithnumber": 686,
			"arabicnumber": 686,
			"text": "Abou Salama Ibn Abdel Rahman a rapporté qu'Aicha, la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) jeûnait à tel point que l'on se disait qu'il ne rompait pas le jeûne, et mangeait à ce que l'on se disait qu'il ne jeûnait pas. Et je n'ai jamais vu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâc jeûne e et la paix d'Allah) jeûner au complet pour un mois sauf à Ramadan. Son jeûne bénévole se faisait souvent au mois de Cha'ban»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 686
			}
		},
		{
			"hadithnumber": 687,
			"arabicnumber": 687,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Le jeûne est protection. Si l'un de vous fait le jeûne, qu'il ne tienne pas de propos indécents, qu'il ne commette pas des actes inconvenables; si quelqu'un l'injurie ou l'attaque, qu'il dise: «je jeûne, je jeûne»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 687
			}
		},
		{
			"hadithnumber": 688,
			"arabicnumber": 688,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Par celui qui tient mon âme dans sa main, le relent de la bouche du jeûneur est plus parfumé auprès d'Allah que l'odeur du musc. Il a écarté son désir, sa nourriture et sa boisson pour Moi. Le jeûne M'appartient et c'est Moi qui en attribue la récompense. Toute bonne action sera décuplée et peut aller jusqu'à sept cent multiples; quant au jeûne, il M'appartient et c'est Moi qui en fixera la récompense»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 688
			}
		},
		{
			"hadithnumber": 689,
			"arabicnumber": 689,
			"text": "Abou Houraira a dit: «lorsque c'est le mois de Ramadan, les portes du Paradis s'ouvrent, les portes de l'Enfer se ferment, et les démons sont enchaînés»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 689
			}
		}
	]
}