{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"2": "Purity"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 32,
			"arabicnumber": 32,
			"text": "Amr Ibn Yahia Al-Mazini a rapporté d'après son père qu'il a dit à Abdallah Ibn Zaid Ibn Assem le grand père de Amr Ibn Yahia Al-Mazini et l'un des compagnons de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah): «Peux-tu me montrer comment l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) faisait ses ablutions»? Abdallah répondit: «Certes, oui». Il fit apporter de l'eau, versa sur ses deux mains, les lava deux foix, se rinça la bouche, fit entrer de l'eau dans son nez en la reniflant par trois fois, puis il se lava le visage trois fois, et les bras jusqu'aux coudes deux foix, puis il se frotta la tête avec les deux mains en les faisant passer d'avant en arrière puis d'arrière en avant et en commençant par le sommet de la tête, allant vers l'occiput, enfin il se lava les pieds»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 33,
			"arabicnumber": 33,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 34,
			"arabicnumber": 34,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 35,
			"arabicnumber": 35,
			"text": "Abdel-Rahman Ibn Abou Bakr a rapporté: «le jour où mourut Sa'd Ibn Abi waqas, il entra chez Aicha, la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) et demanda qu'on lui apporte de l'eau pour ses abultions. Aicha lui dit: «O Abdel-Rahman, fais les ablutions intègres, car j'ai entendu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dire: «malheur aux talons d'être touchés par le feu»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 36,
			"arabicnumber": 36,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 37,
			"arabicnumber": 37,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Si l'un de vous s'éveille, qu'il se lave les mains avant qu'il ne débute son ablution, car il ne peut savoir où il a mis ses mains durant son sommeil»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 38,
			"arabicnumber": 38,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 39,
			"arabicnumber": 39,
			"text": "Omar Ibn Al-Khattab a dit: «lorsque l'un de vous se couche en s'étendant, qu'il fasse ses ablutions (quand il veut prier)». (...) 11 - Malek a rapporté d'après Zaid Ibn Aslam, au sujet de l'interprétation de ce verset (le sens): «O vous les croyants! Lorsque vous vous levez pour faire la prière, lavez vos visages, alors, et vos mains jusqu'aux coudes, et passez les mains humides sur vos têtes, et lavez-vous les pieds jusqu'aux chevilles» (Coran V, 6) que cela signifie quand vous vous réveillez». (42) 12,- Malek a dit: «on ne doit pas faire les ablutions après le saignement du nez, ou à cause d'une blessure d'où coule le sang, ou le pus; et on ne doit pas non plus les faire qu'après la sortie de quelque chose des deux exutoires, ou après un sommeil». Malek a rapporté d'après Nafé qu'Ibn Omar ne faisait pas ses ablutions quand il s'assoupissait assis et même il priait. Chapitre III Le sujet de l'eau pure pour les ablutions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 40,
			"arabicnumber": 40,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 41,
			"arabicnumber": 41,
			"text": "Abou Houraira a rapporté qu'un homme vint trouver l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) et lui dit: «Ô Envoyé d'Allah, nous naviguions en pleine mer, et ne portions que peu d'eau avec nous; ainsi si nous nous en servions pour les ablutions, nous n'aurions plus de quoi boire; devons-nous donc utiliser cette eau pour les ablutions»? Il lui répondit: «l'eau de la mer est purificatrice, et sa pêche est licite»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 42,
			"arabicnumber": 42,
			"text": "Kabcha bint ka'b Ibn Malek, la femme d'Ibn Abi Katada le Médinois a rapporté que Abou Katada entra chez elle; elle lui apporta de l'eau pour ses ablutions, or une chatte s'était approchée pour boire de cette eau; il lui inclina le vase jusqu'à ce qu'elle fut rassasiée. Remarquant que je le regardais faire, il me dit: «ô, la fille de mon frère, ça t'étonne»? Je lui répondis: «Oui». Il répliqua: «L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit:« ces animaux ne souillent pas l'eau car ils vous fréquentent souvent (c.a.d. qu’ils vivent parmi vous)». Malek a dit: «il n'y a pas mal à cela, à moins que l'homme ne remarque une certaine impureté sur la bouche de cette chatte»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 43,
			"arabicnumber": 43,
			"text": "Abdel Rahman Ibn Hateb a rapporté que Omar Ibn Al-Khattab sortit à la tête d'une cavalerie dont Amr Ibn Al-As faisait partie, jusqu'à leur arrivée près d'un bassin, Amr Ibn Al'-As dit à son propriétaire: «Ô un tel! Les bêtes fauves viennent-elles boire souvent de ton bassin»? Omar Ibn Al-Khattab s'adressant au propriétaire dit: «Ne réponds pas car nous fréquentons souvent ces bêtes, et elles nous fréquentent aussi»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 44,
			"arabicnumber": 44,
			"text": "Abdallah Ibn Omar disait souvent: «du temps de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) femmes et hommes faisaient ensemble les ablutions». Chapitre IV De ce qui n'exige pas à refaire les ablutions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 45,
			"arabicnumber": 45,
			"text": "La mère d'un fils de Ibrahim Ibn Abdel-Rahman Ibn Awf demanda à Oum Salama la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah): «Je suis une femme qui marche dans des lieux immondes et laisse l'extrémité de mon vêtement traînant» (dois-je faire les ablutions lorsque je veux prier). Elle lui répondit: «L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «(Le sable) fait débarasser les vêtements de toute impureté»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 46,
			"arabicnumber": 46,
			"text": "Malek a rapporté qu'il a vu Rabi'a Ibn Abdel-Rahman vomir souvent dans la mosquée, sans quitter ce lieu, et ne refaisait pas ses ablutions même avant la prière». On demanda à Malek au sujet d'un homme qui vomissait en rejetant ce qu'il avait mangé; devait-il refaire ses ablutions? Il répondit: «il pouvait ne pas les refaire, mais qu'il se rince la bouche et la lave»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 47,
			"arabicnumber": 47,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 48,
			"arabicnumber": 48,
			"text": "Abdallah Ibn Abbas a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a mangé de l'épaule d'un mouton rôti, puis il fit sa prière sans refaire ses abultions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 49,
			"arabicnumber": 49,
			"text": "Souwaid Ibn An-Nou'man a rapporté que, l'année de Khaibar, il partit avec l'Envoyé d'Allah r (salallahou alayhi wa salam) et arrivés à Al-Sahaba, une localité tout proche de Khaibar, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) descendit, fit la prière de l'asr, puis il ordonna qu'on apporte les provisions. Comme on apporta que du sawiq, il ordonna qu'on le mouille d'eau, puis il en mangea et nous mangeâmes. Ensuite, il se contenta de se rincer la bouche, et nous fîmes de même, et fit la prière du coucher du soleil sans refaire ses ablutions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 50,
			"arabicnumber": 50,
			"text": "Rabi'a Ibn Abdallah Ibn Al-Houdair a rapporté qu'il a pris son dîner avec Omar Ibn Al-Khattab, puis il pria sans refaire ses ablutions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 51,
			"arabicnumber": 51,
			"text": "Aban Ibn Osman a rapporté que Osman Ibn Affan mangea du pain et de la viande, il se rinça la bouche, se lava les mains puis il en frotta le visage, ensuite il pria sans refaire les ablutions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 52,
			"arabicnumber": 52,
			"text": "On rapporta à Malek que Ali Ibn Abi Taleb et Abdallah Ibn Abbas ne refaisaient pas leurs ablutions après avoir mangé de la viande rôtie",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 53,
			"arabicnumber": 53,
			"text": "Yahia Ibn Sa'id a demandé Abdallah Ibn Amer Ibn Rabi'a au sujet de l'homme qui a fait ses ablutions pour la prière, puis il mange de ce que le feu a touché, doit-il refaire ses ablutions? Il lui répondit: «J'ai vu mon père manger du rôti sans refaire ses ablutions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 54,
			"arabicnumber": 54,
			"text": "Jaber Ibn Abdallah Al-Ansari a rapporté qu'il a vu Abou Bakr Al-Siddiq manger du rôti puis faire la prière sans refaire ses ablutions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 55,
			"arabicnumber": 55,
			"text": "Mohammed Ibn Al-Mounkader a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) fut convié à un repas; on lui servit du pain et de la viande (rôtie), il en mangea puis il fit ses ablutions et pria. Comme on lui présenta plus tard, du reste de ce mets, il en mangea puis fit la prière sans refaire ses ablutions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 56,
			"arabicnumber": 56,
			"text": "Abdel Rahman Ibn Yazid Al-Ansari a rapporté que quand Anas Ibn Malek, retourna de l'Iraq, Abou Talha et Oubai Ibn Ka'b vinrent le trouver; il leur présenta un mets que le feu a touché. Ils en mangèrent, et comme Anas fit ses ablutions après avoir mangé, ils lui dirent: «que signifie cela ô Anas? Fait-on ceci en Iraq»? Et Anas répondit: «comme je souhaitais ne pas faire cela»! Abou Talha et Oubai Ibn Ka'b se levèrent, firent la prière sans refaire leurs ablutions». Chapitre VI Les ablutions intègres",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 57,
			"arabicnumber": 57,
			"text": "Hicham Ibn Ourwa a rapporté d'après son père qu'il demanda l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) au sujet du nettoyage après avoir satisfait un besoin naturel, il répondit: «l'un de vous sera-t-il incapable de trouver trois pierres (pour se torcher)»?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 58,
			"arabicnumber": 58,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) sortit se rendre au cimetière. Y arrivant, il dit: «que la paix soit sur vous ô demeure des gens croyants, quant à nous, nous vous rejoindrons s'il plut à Allah. Comme j'ai souhaité avoir vu nos frères». On lui dit: «ô Envoyé d'Allah ne sommes-nous pas tes frères»? Il répondit: «non, plutôt vous êtes mes compagnons, car nos frères sont ceux qui ne sont pas encore venus. Je vous devancerai au bassin». On lui demanda: «ô Envoyé d'Allah comment reconnaitras-tu ceux qui ne sont pas encore venus de ta communauté»? Il répondit: «Pensez-vous que si un homme possède de chevaux qui ont des taches blanches au front et aux pieds, ne les reconnaîtrait-il pas s'ils se trouvaient parmi d'autre chevaux noirs»? On lui répondit: «Certes oui, ô Envoyé d'Allah. Il reprit: «(ainsi seront mes frères) qui viendront au jour de la résurrection, ayant des marques brillantes aux fronts et aux pieds, à cause de leurs ablutions, et je les devancerai au bassin. Des hommes de ma communauté seront éloignés de mon bassin comme un chameau égaré, et je les appellerai: «Venez y, venez y, venez y»! On me répondra: «tu ne sais pas ce qu'ils ont fait après toi». Je m'écrierai alors: «qu'ils périssent, qu'ils périssent, qu'ils périssent»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 59,
			"arabicnumber": 59,
			"text": "Houmran l'affranchi de Osman Ibn Affan a rapporté que Osman s'assit sur le siège de la mosquée; le muezzin vint lui dire que c'est le moment de la prière. Osman demanda qu'on lui apporte de l'eau, et fit ses ablutions puis dit: «par Allah! je vais vous rapporter un hadith, qui s'il ne se trouvait dans le livre d'Allah, je ne vous l'aurais pas rapporté». Puis il dit: «J'ai entendu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dire: «Il n’y a pas un musulman qui ne fait à la perfection ses ablutions, puis fait la prière, sans qu'on lui pardonne les fautes commises entre ce moment même jusqu'à l'accomplissement de la prière suivante». Malek a dit: «je pense qu'il a fait allusion à ce verset: «Acquittez-vous de la prière aux deux bouts du jour et plusieurs fois au cours de la nuit. Oui les bonnes actions dissipent les mauvaises; ceci est un rappel pour ceux qui se souviennent» (Coran XI, 114)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 60,
			"arabicnumber": 60,
			"text": "Abdallah Al-Sanabihi a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «lorsque le serviteur croyant, se rince la bouche, en faisant ses ablutions, ses fautes sortent de sa bouche. Lorsqu'il aspire l'eau de par ses narines et la rejette, ses fautes sortent de son nez. Lorsqu'il se lave le visage, ses fautes sortent de son visage et même de bord de ses paupières. Lorsqu'il se lave les mains, ses fautes sortent de ses mains même du dessous de ses ongles. Lorsqu'il se frotte la tête, ses fautes sortent de sa tête et même de ses oreilles. Lorsqu'il se lave les pieds, ses fautes sortent de ses pieds et du dessous de ses ongles. Enfin sa marche vers la mosquée, et la prière seront pour lui une œuvre surérogatoire»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 61,
			"arabicnumber": 61,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dît: «lorsque l'adorateur musulman (ou croyant) fait ses ablutions et se lave le visage, chaque faute commise par ses yeux, sortira avec l'eau (ou avec la dernière goutte d'eau). Lorsqu'il se lave les mains, toute faute qu'il a commise de ses mains, sortira avec l'eau (ou avec la dernière goutte d'eau). Lorsqu'il se lave les pieds, chaque faute commise par ses pieds sortira avec l'eau (ou avec la dernière goutte d'eau), qu'à la fin, il en sera purifié de toute faute»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 62,
			"arabicnumber": 62,
			"text": "Anas Ibn Malek a rapporté: «J'ai vu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) et ce fut le moment de la prière de l'asr. Comme les hommes ne trouvèrent pas de l'eau pour leurs ablutions, on fit apporter à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) un vase contenant de l'eau, où il y mit sa main. Puis il demanda aux hommes de faire leurs ablutions». Anas poursuivit: «J'ai vu l'eau jaillir du dessous de ses doigts de telle façon que tous les hommes ont tous fait leurs ablutions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 63,
			"arabicnumber": 63,
			"text": "Abou Houraira a dit: «Celui qui fait ses ablutions à la perfection puis sort vers la mosquée pour la prière, il sera considéré en prière tant qu'il ne cherchera qu'à prier. Pour chaque pas fait, on lui inscrira une bonne action et on lui effacera une mauvaise. Lorsque l'un de vous (se dirigeant vers la mosquée) entend le deuxième appel à la prière, qu'il ne hâte pas le pas, car,il aura la plus grande récompense, celui qui habite le plus loin de la mosquée». On demanda à Abou Houraira: «en vertu de quoi, Abou Houraira»? Il répondit: «à cause de la longueur du trajet qu'il traversera»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 64,
			"arabicnumber": 64,
			"text": "On demanda Sa'id Ibn Al-Moussaiab au sujet du nettoyage avec l'eau après la satisfaction d'un besoin naturel il répondit: «cela est exigé des femmes»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 65,
			"arabicnumber": 65,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «si le chien lape du vase de l'un de vous, qu'il lave le vase sept fois»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 66,
			"arabicnumber": 66,
			"text": "On rapporta à Malek, que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «restez adroits, vous ne pourrez pas dénombrer (les œuvres pies); œuvrez, et sachez que les meilleures de vos œuvres sont les prières, et nul ne fait les ablutions qu'un croyant». Chapitre VII Le fait de se frotter la tête et les oreilles",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 67,
			"arabicnumber": 67,
			"text": "Nafe' a rapporté que Abdallah Ibn Omar plongeait les doigts dans l'eau et se frottait les oreilles",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 68,
			"arabicnumber": 68,
			"text": "Jaber Ibn Abdallah Al-Ansari, demanda au sujet de frotter sur le turban, répondit: «Non, car, on doit faire passer les mains humides sur la tête»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 69,
			"arabicnumber": 69,
			"text": "Hicham Ibn Ourwa a rapporté que son père Ourwa Ibn Az-Zoubair, «ôtait son turban, et se frottait la tête de ses mains humides»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 70,
			"arabicnumber": 70,
			"text": "Nafe' a rapporté qu'il a vu Safia Bint Abi Oubaid, la femme de Abdallah Ibn Omar, se dévoiler et passer ses mains humides sur sa tête». Nafe', à cette époque, était tout jeune. On demanda à Malek au sujet de frotter le turban et le voile, il répondit: «un homme ne doit pas frotter son turban, ni une femme son voile; ils doivent tous deux passer les mains humides sur leurs têtes». On demanda également Malek au sujet d'un homme qui a fait ses ablutions mais en oubliant de frotter la tête, jusqu'à ce que l'eau ait séché»?. Il répondit: «Je pense qu'il doit se frotter la tête, et s'il a déjà fait sa prière, qu'il la refasse». Chapitre VIII Du fait de frotter les bottines (Khouffs)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 71,
			"arabicnumber": 71,
			"text": "Al Moughira Ibn Chou'ba a rapporté que «l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lors de la bataille de Tabouk, sortit pour satisfaire un besoin naturel». Al Moughira poursuivit: «Je l'acommpagnai en portant de l'eau, et quand il revint, je lui versai de l'eau, il se lava le visage puis voulant faire sortir ses deux mains des manches de sa tunique, et n'arrivant pas à le faire, il les sortit alors du dessous de sa tunique, les lava puis passa ses mains humides sur la tête et frotta sur ses bottines. Comme l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) revint alors vers les musulmans, il trouva Abdel-Rahman Ibn Auf présidant la prière en accomplissant une seule raka't l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) fit la raka't restant (en présidant la prière). La prière achevée, et comme les hommes furent étonnés, il leur dit: «vous avez bien agi»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 72,
			"arabicnumber": 72,
			"text": "Nafe' et Abdallah Ibn Dinar ont rapporté que Abdallah Ibn Omar arriva à Koufa et se présenta chez Sa'd Ibn Abi Waqas, qui était gouverneur de la ville, et le trouva en train de frotter sur ses bottines. Comme il désavoua son geste, Sa'd lui dit: «une fois de retour chez ton père, demande-lui à ce sujet». De retour chez lui, Abdallah oublia de demander son père, jusqu'à ce que fut l'arrivée de Sa'd qui lui dit: «as-tu demandé à ton père»? Il lui répondit: «Non». Abdallah questionnant son père, Omar lui répondit: «Quand tu fais entrer tes pieds dans les bottines et qu'ils soient purs (c.a.d. après les ablutions), frotte sur elles (Si tu refais les ablutions)». De nouveau Abdallah demanda: «Si l'un de nous vient d'un lieu caché (après avoir satisfait un besoin naturel»)? Omar répondit: «même si l'un de vous vient d'un lieu caché»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 73,
			"arabicnumber": 73,
			"text": "Nafe' a rapporté que Abdallah Ibn Omar avait uriné au marché, puis fit ses ablutions en se lavant le visage, les mains et passa ses mains humides sur la tête. On le convoqua pour faire la prière funéraire sur un mort;il entra dans la mosquée, frotta sur ses bottines, et fit la prière",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 74,
			"arabicnumber": 74,
			"text": "Sa'id Ibn Abdel-Rahman Ibn Rouqaich a rapporté qu'il a vu Anas Ibn Malek urinant alors qu'il se trouvait à Qouba. Il fit apporter de l'eau et fit ses ablutions en se lavant le visage et les mains jusqu'aux coudes, puis il passa les mains humides sur la tête et frotta sur les bottines, il entra dans la mosquée et pria». On demanda à Malek «au sujet d'une homme qui a fait ses ablutions comme pour prier, puis il se chaussa les bottines, urina, se déchaussa, et se chaussa de nouveau doit-il refaire les ablutions»? Il répondit: «qu'il se déchausse, et se lave les pieds; mais aura à frotter sur les bottines, celui qui avait fait entrer ses pieds dans les bottines après les ablutions. Quant à celui, qui a fait entrer ses pieds dans les bottines sans qu'ils soient purs à la suite des ablutions, il n'aura pas à frotter sur les bottines». On demanda aussi Malek au sujet d'un homme qui a fait ses ablutions en mettant ses bottines et qui a oublié de frotter sur ses bottines, jusqu'à ce que l'eau ait séché, puis fait sa prière». Il répondit: «qu'il frotte sur les bottines, et qu'il refasse la prière, sans refaire lesablutions.On demanda également à Malek au sujet d'un homme qui s'est lavé les pieds, s'est chaussé les bottines, puis a fait ses ablutions»? Il répondit: «qu'il se déchausse, qu'il fasse ses ablutions puis qu'il se lave les pieds». Chapitre IX Comment frotter sur les bottines",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 75,
			"arabicnumber": 75,
			"text": "Hicham Ibn Ourwa a rapporté «qu'il a vu son père frotter sur les bottines, se contentant de frotter le dessus sans le dessous»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 76,
			"arabicnumber": 76,
			"text": "Malek demanda Ibn Chéhab au sujet de la façon de frotter sur les bottines? Ibn Chéhab mit alors une main au-dessous des bottines et l'autre au-dessus et il les frotta». Et Malek ajouta: «et les propos de Ibn Chéhab, m'étaient à ce sujet, les meilleurs». Chapitre X Du saignement du nez",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 77,
			"arabicnumber": 77,
			"text": "Rafe' a rapporté: «Quand Abdallah subissait un saignement du sang de son nez, il quittait la prière, faisait ses ablutions, puis revenait continuer la prière sans parler à personne»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 78,
			"arabicnumber": 78,
			"text": "On rapporta à Malek «que Abdallah Ibn Abbas subissait un saignement du nez, ainsi il se levait et revenait continuer sa prière»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 79,
			"arabicnumber": 79,
			"text": "Yazid Ibn Abdallah Ibn Qoussait Al-Laithi a rapporté qu'il a vu le sang couler du nez de Sa'id Ibn Al-Moussaiab alors qu'il priait. Il se rendit chez Oum Salama la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) fit apporter de l'eau pour faire ses ablutions puis revint continuer sa prière. Chapitre XI Ce qu'on doit faire lors d'un saignement du nez",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 80,
			"arabicnumber": 80,
			"text": "Abdel-Rahman Ibn Harmala Al-Aslami a rapporté: «J'ai vu couler le sang du nez de Sa'id Ibn Al Moussaiab de sorte que ses doigts furent tout mouillés. Il fit la prière, sans faire ses ablutions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 81,
			"arabicnumber": 81,
			"text": "Abdel Rahman Ibn Al-Moujabbar a rapporté qu'il a vu Salem Ibn Abdallah le sang lui coulant du nez, de sorte qu'il se mouilla les doigts. Il l'essuya puis continua la prière sans refaire les ablutions». Chapitre XII Ce qu'il faut faire quand le sang coule avec abondance",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 82,
			"arabicnumber": 82,
			"text": "Al Miswar Ibn Makhrama a rapporté «que la nuit où l'on poignarda Omar Ibn Al-Khattab, il entra chez lui pour le réveiller afin de faire la prière de l'aurore». Omar lui répondit: «Certes, oui, car n'est plus considéré comme musulman, celui qui néglige la prière». Omar fit alors la prière et le sang continuait à couler de sa blessure»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 83,
			"arabicnumber": 83,
			"text": "Sa'id Ibn Al Moussaiab a demandé aux fidèles: «que pensez-vous, de ce qu'un homme doit faire, si le sang lui coule incessamment du nez». Sa'id Ibn Al Moussaiab poursuivit: «Je pense qu'il doit faire signe de sa tête sans la faire bouger». Malek a dit: «C'était de préférence, la meilleure réponse que j'ai entendue». Chapitre XIII Les ablutions après un suintement",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 84,
			"arabicnumber": 84,
			"text": "Al-Miqdad Ibn Al-Aswad a rapporté que Ali Ibn Abi Taleb le chargea de demander l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) au sujet d'un homme, qui en s'approchant de sa femme, fit un suintement (mazi), sur ce qu'il doit faire»? Ali poursuivit: «Comme j'ai pour femme, la fille de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) J'ai honte de lui poser une telle question». Al-Miqdad demanda l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) au sujet en question, et il lui répondit: «lorsque l'un de vous, subit un tel suitement, qu'il asperge sa verge avec de l'eau, et qu'il fasse ses ablutions comme pour la prière»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 85,
			"arabicnumber": 85,
			"text": "Omar Ibn Al-Khattab a dit: «Je sens parfois (le mazi) coulant sur ma cuisse comme une perle. Celui qui en subit un tel phénomène, qu'il lave sa verge et qu'il fasse ses ablutions comme pour la prière»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 86,
			"arabicnumber": 86,
			"text": "Joundob, l'esclave de Abdallah Ibn Ayyach a rapporté qu'il a demandé à Abdallah Ibn Omar au sujet du mazi ; il lui répondit: «lorsque tu le sens, lave ta verge et fais tes ablutions comme pour la prière». Chapitre XIV L'autorisation de ne plus refaire les ablutions, à celui qui a un suintement (dit mazi)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 87,
			"arabicnumber": 87,
			"text": "Un homme demanda à Sa'id Ibn Al-Moussaiab: «parfois je me sens mouillé par le mazi, et cela en priant; dois-je suspendre ma prière»? Sa'id lui répondit: «même si ma cuisse est toute mouillée, je ne quitterai pas la prière avant de l'achever»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 88,
			"arabicnumber": 88,
			"text": "Al-Salt Ibn Zouyaid a rapporté qu'il a demandé à Souleiman Ibn Yassar: «Je me trouve tout mouillé par le mazi, (dans ce cas, que dois-je faire)?. Il lui répondit: «asperge, ce qui se trouve au-dessous de tes vêtements, et n'y pense plus». Chapitre XV Le fait de refaire les ablutions, si l'on touche la verge",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 89,
			"arabicnumber": 89,
			"text": "Ourwa Ibn Az-Zoubair a rapporté: «J'entrai chez Marwan Ibn Al-Hakam, et nous eûmes un entretien à propos de ce qui exige les ablutions. Marwan a dit: «entre autre, qu'on touche la verge». Ourwa répondit: «Bousra Bint Safwan m'a fait savoir qu'elle a entendu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dire: «lorsque l'un de vous touche sa verge, qu'il fasse ses ablutions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 90,
			"arabicnumber": 90,
			"text": "Mouss'ab Ibn Sa'id Ibn Abi Waqas a rapporté: «Comme je tenais le Coran pour Sa'id Ibn Abi Waqas, je me suis gratté (les parties intérieures). Sa'd me dit: «peut-être tu as touché ta verge»? je lui répondis:«Oui». Il répliqua: «va faire tes ablutions». Je me levai pour les faire et je revins»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 91,
			"arabicnumber": 91,
			"text": "Abdallah Ibn Omar disait souvent: «Si l'un de vous touche sa verge, il doit faire ses ablutions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 92,
			"arabicnumber": 92,
			"text": "Hicham Ibn Ourwa a rapporté que son père a dit: «Celui qui touche sa verge, doit faire ses ablutions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 93,
			"arabicnumber": 93,
			"text": "Salem Ibn Abdallah a rapporté: «J'ai vu mon père Abdallah faire une lotion puis ses ablutions»? Il me répondit: «il se peut que j'aie touché ma verge, après la lotion, pour cela j'ai à faire les ablutions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 94,
			"arabicnumber": 94,
			"text": "Salem Ibn Abdallah a rapporté: «étant en voyage avec Abdallah Ibn Omar, je l'ai vu, après le lever du soleil, faire ses ablutions et prier». Je lui dis: «C'est une prière que je ne t'ai pas vu faire auparavant»? Il me répondit: «après que j'aie fait la prière de l'aurore, j'ai touché ma verge. Et comme j'ai oublié de faire mes ablutions je les ai faite, et je suis revenu faire ma prière». Chapitre XVI Un homme qui embrasse sa femme doit faire ses ablutions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 95,
			"arabicnumber": 95,
			"text": "Abdallah Ibn Omar disait souvent: «Un baiser qu'un homme fait à sa femme ou le fait de la caresser, constituent un attouchement. Celui qui embrasse sa femme ou qui la caresse avec sa main, doit faire ses ablutions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 96,
			"arabicnumber": 96,
			"text": "On fit savoir à Malek que Abdallah Ibn Mass'oud disait: «lorsqu'un homme embrasse sa femme, il doit faire ses ablutions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 97,
			"arabicnumber": 97,
			"text": "Ibn Chéhab disait: «lorsqu'un homme embrasse sa femme, il doit faire ses ablutions». Malek a dit: «C'est ce que j'ai entendu de mieux à ce sujet». Chapitre XVII La lotion à la suite d'une impureté rituelle",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 98,
			"arabicnumber": 98,
			"text": "Aicha, la mère des croyants a rapporté: «lorsque l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) voulait faire une lotion à la suite d'une impureté rituelle due à des rapports charnels, il commençait par se laver les mains, puis s'abluait comme pour faire la prière, puis il plongeait ses doigts dans l'eau et les faisait passer dans ses cheveux, puis versait de l'eau sur sa tête, pour trois fois de suite, en puisant l'eau avec ses paumes, enfin il répandait l'eau sur tout son corps»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 99,
			"arabicnumber": 99,
			"text": "Aicha, la mère des croyants a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) faisait la lotion à la suite du commerce charnel en se servant d'un vase appelé Faraq",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 100,
			"arabicnumber": 100,
			"text": "Nafe' a rapporté: «lorsque Abdallah Ibn Omar voulait faire une lotion à la suite d'un rapport charnel, il versait de l'eau sur sa main droite et la lavait puis se lavait la verge, puis se rinçait la bouche, puis aspirait de l'eau par ses narines et la rejetait, puis il se lavait le visage. Il aspergeait de l'eau sur ses yeux, se lavait la main droite puis la gauche, se lavait la tête, ensuite il se lavait tout le corps en répandant de l'eau»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 101,
			"arabicnumber": 101,
			"text": "On fit savoir à Malek que Aicha fut demandée au sujet de la lotion de la femme à la suite des rapports charnels; elle répondit: «qu'elle verse trois poignées d'eau sur la tête, puis qu'elle se lave la chevelure». Chapitre XVIII Devoir faire une lotion, quand les deux parties circoncises (mâle et femelle) se touchent",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 102,
			"arabicnumber": 102,
			"text": "Sa'id Ibn Al Moussaiab a rapporté que Omar Ibn Al-Khattab, Osman Ibn Affan et Aicha disaient: «quand les deux parties circoncises(les génitales mâle et femelle), se touchent, on doit obligatoirement faire une lotion (ghusl)»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 103,
			"arabicnumber": 103,
			"text": "Abou Salama Ibn Abd Al-Rahman Ibn Awf a rapporté qu'il a demandé à Aicha, la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) au sujet de l'obligation de la lotion; elle répondit: «Abou Salama, sais- tu à quoi cela ressemble? Eh oui, à un coq qui entend les autres chanter, pour chanter avec. Lorsque les deux parties circoncises (les génitales mâle et femelle), se touchent et qu'il y a pénétration, c'est du devoir de faire la lotion»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 104,
			"arabicnumber": 104,
			"text": "Sa'id Ibn Al Moussaiab a rapporté que Abou Moussa Al-Ach'ari vint trouver Aicha la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) et lui dit: «il m'est pénible de voir les compagnons du Prophète (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dans un débat au sujet d'une question dont l'importance me pousse à te la poser». Elle répondit: «quelle est-elle, cette question? Ce dont tu as eu l'habitude de poser à ta mère, demande le à moi»? Il répliqua:«il s'agit d'un homme qui commerce avec sa femme puis il cesse sans éjaculer»? Elle dit: «quand il y a pénétration d'un organe génital dans l'autre, la lotion est obligatoire». Abou Moussa rétorqua: «C'est une question, que je ne poserai jamais à nul autre que toi»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 105,
			"arabicnumber": 105,
			"text": "Mahmoud Ibn Zoubaid Al- Ansari a demandé Zaid Ibn Thabet «au sujet de l'homme qui a eu un rapport charnel avec sa femme puis il cesse sans éjaculer (que doit-il faire dans ce cas)»? Zaid lui répondit: «qu'il, fasse une lotion». Mahmoud répliqua «mais Oubai Ibn Ka'b ne trouve pas que la lotion est d'obligation». Zaid rétorqua: «Oubai Ibn Ka'b avait changé d'avis avant de mourir»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 106,
			"arabicnumber": 106,
			"text": "Abdallah Ibn Omar disait: «Une fois que l'organe génital mâle pénètre dans l'organe femelle, la lotion est devoir obligatoire». Chapitre XIX Les ablutions de l'homme à l'état d'impureté rituelle quand il veut se coucher ou manger avant de faire la lotion;",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 107,
			"arabicnumber": 107,
			"text": "Abdallah Ibn Omar a rapporté que Omar Ibn Al-Khattab a dit à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) qu'il lui arrive d'être dans un état d'impureté durant la nuit. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui répondit: «fais tes ablutions, lave ta verge, et dors». (110).80. Ourwa a rapporte que Aicha,la femme du Prophete r disait . « Lorsque l’un de vous commerce avec sa femme et veut se coucher sans faire les grandes ablutions qu’il ne se couche pas sans faire les ablutions comme pour la priere",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 108,
			"arabicnumber": 108,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 109,
			"arabicnumber": 109,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 110,
			"arabicnumber": 110,
			"text": "Ata Ibn Yassar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) au début de l'une de ses prières, après avoir fait le takbir, fit signe aux fidèles de garder leur place. Il partit et revint et on put remarquer les traces d'eau sur sa peau",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 111,
			"arabicnumber": 111,
			"text": "Zoubaid Ibn As-Sait a rapporté: «Je partis en compagnie de Omar Ibn Al- Khattab à Aljourf (une localité à trois miles de Médine). Se rappelant qu'il a fait un rêve érotique, il fit la prière sans faire la lotion, puis il dit: «J'ai vécu un rêve érotique sans m'apercevoir, et j'ai fait la prière sans faire la lotion». Ensuite, il fit une lotion, lava son vêtement, en se débarassant des traces qu'il n'a pas vues, puis il fit le premier et le deuxième appel à la prière, et pria juste au moment où le soleil était haut dans l'horizon»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 112,
			"arabicnumber": 112,
			"text": "Soulaiman Ibn Yassar a rapporté que Omar Ibn Al-Khattab partit de bon matin à son terrain à Aljourof. Voyant sur son vêtement les traces du sperme, il s'écria: «depuis que je me suis occupé des affaires des gens, je suis victime des rêves érotiques». Il fit une lotion, enleva avec de l'eau les traces du sperme, puis il fit la prière alors que le soleil était déjà haut»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 113,
			"arabicnumber": 113,
			"text": "Soulaiman Ibn Yassar a rapporté que Omar Ibn Al-Khattab fit la prière en commun avec les hommes puis partit à sa propriété à Aljourof. Comme il vit du sperme sur son vêtement, il dit: «depuis que nous mangeons de la viande graisseuse, les veines se sont amollies». Ainsi, il fit une lotion, enleva les traces du sperme de son vêtement puis il fit la prière»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 114,
			"arabicnumber": 114,
			"text": "Yahia Ibn Abdel- Rahman Ibn Abi Hateb a rapporté qu'il a fait la visite pieuse avec Omar Ibn Al-Khattab en compagnie d'une troupe de cavaliers parmi qui, se trouvait Amr Ibn Al'-As. Omar Ibn Al-Khattab fit halte la nuit et campa sur une route près d'une source d'eau. Omar fit un rêve érotique, et, comme l'aube fut en parution et ne trouvant pas d'eau avec les cavaliers, il monta et chercha jusqu'à ce qu'il fut tout près de la source d'eau; il enleva avec de l'eau les traces du sperme alors que l'aurore brillait. Amr Ibn Al'-As lui dit: «tu es déjà au petit jour, et nous possédons tant de vêtements, Donne ton vêtement à quelqu'un pour qu'il le lave». Omar lui répondit: «comme tu es étrange Amr Ibn Al'-As! Si tu possèdes tant de vêtements, crois- tu que tous les hommes en possèdent? Par Allah! Si je l'avais fait (c.a.d. emprunter un vêtement), cela aurait devenu une des traditions. Je préfère enlever avec de l'eau, ce que je vois (de traces) et asperger les autres parties». Malek a dit: «lorsqu'un homme voit sur son vêtement les traces du sperme, sans savoir depuis quand elles s'y trouvent, et ne se souvient pas qu'il a fait un rêve érotique, qu'il fasse une lotion après son dernier réveil. S'il avait fait une prière dans cette journée, qu'il fasse de nouveau les prières accomplies à partir du moment où il s'est réveillé, car il se peut que l'homme. ait un rêve érotique sans voir de traces et sans s'apercevoir qu'il l'a fait. S'il trouve les traces du sperme sur son vêtement, il doit faire une lotion, car Omar, selon le hadith mentionné ci-dessus a refait toutes les prières qu'il avait accomplies depuis son dernier réveil, sans cependant répéter les prières déjà faites avant son dernier sommeil. Chapitre XXI La lotion de la femme qui pareillement à l'homme fait un rêve érotique",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 115,
			"arabicnumber": 115,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 116,
			"arabicnumber": 116,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 117,
			"arabicnumber": 117,
			"text": "Nafe' a rapporté que Abdallah Ibn Omar disait: «il n'y a pas de mal à se servir du reste de l'eau de la lotion d'une femme si elle n'avait pas ses menstrues ou était à l'état d'une impureté rituelle»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 118,
			"arabicnumber": 118,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 119,
			"arabicnumber": 119,
			"text": "Nafe' a rapporté «Que les esclaves femelles de Abdallah Ibn Omar, lui lavaient les pieds et lui donnaient la natte alors qu'elles avaient leurs menstrues». On demanda à Malek au sujet de l'homme qui est polygame et qui a des esclaves femelles, peut-il avoir avec ses femmes des rapports charnels avant de faire une lotion? Il répondit: «Il n' y a pas de mal à ce que l'homme ait des rapports charnels avec deux de ses esclaves, et cela avant de faire une lotion, Quant à ses femmes libres, il est répugnant que l'homme ait de rapports charnels avec l'une de ses femmes dans la nuit même qui a été consacrée pour une autre. Mais qu'il ait des rapports charnels avec une de ses esclaves puis avec une autre, tout en étant en état d'impureté rituelle, il n'y a pas de mal à cela». On demanda à Malek aussi au sujet d'un homme, qui à l'état d'impureté, plonge par mégarde, son doigt dans l'eau qui est destinée à sa lotion, pour savoir sa température? Il répondit: «Si son doigt n'a pas été atteint d'un mal quelconque, je ne trouve pas en cela, ce qui souillera l'eau». Chapitre XXIII La lustration pulvérale \"Tayamoum",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 120,
			"arabicnumber": 120,
			"text": "Aicha, la mère des croyants a rapporté le récit qui s'ensuit: «nous sortîmes dans une des expéditions avec l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah). Arrivés à «All- Bayada» ou «Zatel-Jaich», je perdis mon collier. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) aussi bien que ses compagnons se mirent à le rechercher, et il est qu'ils se trouvaient dans un lieu où il n'y avait pas d'eau, et ils n'avaient pas d'eau. Les hommes vinrent trouver et dire à Abou Bakr: «n'as- tu vu, ce qu'a fait Aicha? Elle obligea l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) et les hommes à faire halte dans une place où il n'y a pas d'eau, et même ils n'avaient pas d'eau». Aicha poursuivit «Abou Bakr vint vers moi, alors que l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dormait, mettant sa tête sur ma cuisse». Il me dit: «tu as retenu l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dans une place où il n'y a pas d'eau et les gens n'ont pas d'eau». Aicha continua son récit: «Abou Bakr m'adressa de reproches et dit ce que Allah voulut et il se mit à me frapper sur le flanc, à tel point que rien ne m'empêchait de bouger que la tête de l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) déposée sur ma cuisse. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dormi jusqu'au matin, et se réveillant, il ne trouva pas d'eau. Allah Béni et très Haut, fit alors la révélation du verset relatif à la lustration pulvérale, et les hommes la firent. Oussaid Ibn Houdair dit alors: «Ce n'est pas d'ailleurs, la première grâce divine que vous receviez, ô la famille de Abou Bakr». Aicha ajouta: «En faisant lever la chameau que je montais nous trouvâmes le collier sous cet animal». On demanda à Malek au sujet d'un homme qui a fait une lustration pulvérale pour une prière présente, puis pour la prière suivante; sa lustration pulvérale déjà faite, sera-t-elle suffisante? Ou doit il en faire une autre»? Il répondit: «il doit faire la lustration pulvérale pour chaque prière, parce qu'il doit rechercher l'eau (pour ses ablutions) et faire la prière. Or, celui qui ne trouve pas l'eau, pourra dans de cas faire la lustration pulvérale». On demanda également à Malek au sujet d'un homme qui a fait une lustration pulvérale; pourra-t-il présider la prière alors que ses compagnons avaient déjà fait leurs ablutions? Il répondit: «vaut mieux qu'un autre la préside .mais s'il la préside lui- même, il n'y a pas mal à cela». On demanda à Malek au sujet d'un homme qui a fait la lustration pulvérale à cause de la pénurie d'eau, il se leva, fit le takbir et entame la prière. Mais, soudain, un homme survint en apportant de l'eau? Il répondit: «il ne doit pas interrompre la prière, mais plutôt peut la poursuivre, il pourra se servir de cette eau (et faire ses ablutions pour les prières qui s'ensuivront». Malek a dit: «celui qui se lève pour prier, et qu'il ne trouve pas de l'eau, et fait ce que Allah lui a ordonné de faire de la lustration pulvérale, il aura obéi à Allah. A savoir que celui qui a trouvé l'eau n'est pas plus pur que lui, ni même sa prière n'est plus complète, car chacun d'eux avait obtempéré aux ordres d'Allah et avait agi selon ses ordres. Celui qui trouve l'eau, fait ses ablutions, et celui qui ne la trouve pas, fait la lustration pulvérale et cela avant d'entamer la prière». Malek a dit aussi au sujet de l'homme qui est impur rituellement: «il fait la lustration pulvérale, récite un «hizb» du Coran et fait d'autres prières surérogatoires, s'il ne trouve pas l'eau, étant toujours dans le lieu où il lui est permis de faire la prière». Chapitre XXIV Comment faire la lustration pulvérale \"Tayamoum)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 121,
			"arabicnumber": 121,
			"text": "Nafe' a rapporté qu'en revenant de «Al-Jourof», Abdallah Ibn Omar et lui, arrivés à «Al-Mirbad», Abdallah descendit de sa monture, et fit une lustration pulvérale avec du bon sable, il fit passer ses mains (après avoir frappé sur le sol) sur son visage, et les mains jusqu'aux coudes, puis il pria»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 122,
			"arabicnumber": 122,
			"text": "Nafe' a rapporté que Abdallah Ibn Omar frottait ses mains jusqu'aux coudes, en faisant la lustration pulvérale. On demanda à Malek au sujet de la lustration pulvérale et du comment faire, il répondit: «on frappe le sol une fois avec les mains qu'on fait passer sur le visage, et deux fois en les faisant passer sur les bras jusqu'aux coudes». Chapitre XXV La lustration pulvérale de l'homme rituellement impur;",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 123,
			"arabicnumber": 123,
			"text": "On demanda à Sa'id Ibn Al-Moussaiab, au sujet de l'homme, qui impur rituellement, a fait une lustration pulvérale, puis il put trouver de l'eau, que doit-il faire»? Il répondit: «S'il trouve l'eau, il doit faire une lotion pour les prières qui suivent». Au sujet d'un homme, qui, voyageant, a fait un rêve érotique, et ne possédant qu'une quantité d'eau de quoi se suffir pour ses ablutions, et pouvant supporter sa soif jusqu'à ce qu'il trouve de l'eau, Malek a dit: «il se lave la verge, et la partie souillée, puis il fait une lustration pulvérale avec du sable pur comme Allah l'a ordonné». On demanda aussi à Malek au sujet d'un homme rituellement impur,et qui veut faire la lustration pulvérale, mais qui ne trouve que le sable d'un marécage, pourra-t-il s'en servir? D'autre part, peut-il faire la prière dans ce lieu»? Il répondit: «il n'y a pas de mal à faire la prière dans tel lieu, et la lustration pulvérale, car Allah le Béni et le Très Haut a dit (le sens): «recourez à du bon sable» et tout ce qui est du bon sable, on peut s'en servir pour la lustration pulvérale, et pour faire la prière, s'agit-il d'un marécage ou autre». Chapitre XXVI Ce dont l'homme peut disposer de sa femme, qui a ses menstrues",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 124,
			"arabicnumber": 124,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 125,
			"arabicnumber": 125,
			"text": "Rabi'a Ibn Abi Abdel-Rahman a rapporté que Aicha la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) était couchée avec l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) portant un seul vêtement, et brusquement elle bondit». Il lui dit: «qu'as-tu? as-tu tes menstrues»? Elle répondit:«Oui». Il répliqua: «mets un izar autour de ta taille, et reviens te coucher»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 126,
			"arabicnumber": 126,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 127,
			"arabicnumber": 127,
			"text": "On demanda à Salem Ibn Abdallah et à Soulaiman Ibn Yassar si l'homme peut avoir des rapports charnels avec sa femme dont les menstrues ont cessé avant qu'elle fasse une lotion»? Ils répondirent: «Non, pas avant qu'elle fasse une lotion». Chapitre XXVII La pureté de la femme qui a ses menstrues",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 128,
			"arabicnumber": 128,
			"text": "La mère de Alqama, l'affranchie de Aicha, la mère des croyants a rapporté: «les femmes demandaient à Aicha, au sujet de la prière quand l'une d'elles trouve une tache jaune sur le chiffon du coton signe de la cessation des menstrues»? Elle leur répondit: «ne vous hâtez pas, attendez jusqu'à ce que vous voyez la tache blanche», voulant entendre-par là, la pureté des menstrues",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 129,
			"arabicnumber": 129,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 130,
			"arabicnumber": 130,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 131,
			"arabicnumber": 131,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 132,
			"arabicnumber": 132,
			"text": "Ourwa a rapporté que Aicha, la femme du Prophète (salallahou alayhi wa salam) a dit: «Je peignais la tête de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) tout en étant à mes menstrues»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 133,
			"arabicnumber": 133,
			"text": "Asma, la fille de Abou Bakr-Siddiq a rapporté qu'une femme demanda à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah): «lorsque l'une de nous trouve que son vêtement est tacheté du sang des menstrues, que doit-elle faire»? Il lui répondit: «lorsque l'une de vous, a son vêtement taché par le sang des menstrues, qu'elle gratte les taches, asperge son vêtement d'eau et puis qu'elle fasse la prière en le portant». Chapitre XXIX De la femme qui a une veine qui saigne",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 134,
			"arabicnumber": 134,
			"text": "Aicha, la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a rapporté que Fatima bint Abi Houbaich demanda à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah): «ô Envoyé d'Allah (Je vois toujours du sang et) je ne me sens jamais pure; dois-je cesser la prière»? Il lui répondit: «Ce n'est qu'une veine saignante et non plus des menstrues; quand tu as tes menstrues, cesse la prière dans leur durée normale, après cela, nettoie-toi avec de l'eau et prie»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 135,
			"arabicnumber": 135,
			"text": "Oum Salama a rapporté qu'une femme subissait un écoulement du sang du temps de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah). Oum Salama en consultant l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) à ce sujet, il lui répondit: «qu'elle compte le nombre des nuits et des jours du temps normal de ses menstrues avant qu'elle subisse un tel écoulement, qu'elle cesse la prière durant cette période du mois. Après cela qu'elle fasse une lotion, puis qu'elle mette un chiffon sur son organe génital, et qu'elle fasse ensuite la prière»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 136,
			"arabicnumber": 136,
			"text": "Zainab Bint Abi Salama a rapporté qu'elle a vu Zainab Bint Jahch la femme de Abdel-Rahman Ibn Awf, qui subissait un écoulement du sang, faire une lotion et prier»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 137,
			"arabicnumber": 137,
			"text": "Soumai, l'esclave de Abou Bakr Ibn Abdel-Rahman a rapporté que Al-Ka'Ka'Ibn Hakim et Zaid Ibn Aslam l'ont envoyé chez Sa'id Ibn Al-Moussaiab pour lui demander au sujet de la lotion de la femme qui a un écoulement du sang? Sa'id répondit: «elle doit faire une lotion après la cessation normale de ses menstrues, et faire ses ablutions pour prier. Au cas où l'écoulement devient si abondant, qu'elle mette un chiffon sur son organe sexuel»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 138,
			"arabicnumber": 138,
			"text": "Ourwa a dit: «la femme qui subit un écoulement du sang, fait une seule lotion, puis fait ses ablutions pour chaque prière». Malek a dit: «ce qui est suivi à Médine, c'est que la femme qui a un écoulement, quand elle peut prier, son mari a le droit d'avoir des rapports charnels avec elle, ainsi c'est le cas de la femme accouchée quand le sang cesse de couler après la période maximale qui suit l'accouchement. Mais si celle-ci verra le sang, son mari aura le droit de coiter avec elle, car elle sera considérée comme une femme qui subit un écoulement du sang». En commentant les propos de Hicham Ibn Ourwa (N° 108) Malek a dit: Ce sont les meilleures paroles que j'ai entendues à ce propos». Chapitre XXX De l'urine d'un nourisson",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 139,
			"arabicnumber": 139,
			"text": "Aicha, la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a rapporté qu'en amenant un jeune enfant à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah), il urina sur son vêtement. Le Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) fit apporter de l'eau et lava la partie souillée",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 140,
			"arabicnumber": 140,
			"text": "Oum Qais Bint Mihsen amena son enfant qui ne se nourrissait que du lait, chez l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah). En le plaçant dans son giron, l'enfant urina. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) fit apporter de l'eau et aspergea la partie souillée sans laver son vêtement. Chapitre XXXI Le fait d'uriner debout",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 141,
			"arabicnumber": 141,
			"text": "Yahia Ibn Sa'id a rapporté qu'un bédouin entra dans la mosquée, et voulant uriner, les gens s'écrièrent à haute voix (pour l'empêcher). L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) leur dit: «Laissez-le (terminer)». Le bédouin urina, et l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) fit apporter un seau d'eau et le versa sur la place souillée",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 142,
			"arabicnumber": 142,
			"text": "Abdallah Ibn Dinar a rapporté qu'il a vu Abdallah Ibn Omar, uriner debout. On demanda à Malek au sujet du lavage des parties sexuelles après avoir satisfait un besoin naturel, y-a-t-il des renseignements concernant cela»? Il répondit: «on me fit savoir que ceux qui nous ont précédé se contentaient de faire leurs ablutions, quant à moi, j'aime me laver la verge après avoir uriné. Chapitre XXXII De l'usage du \"siwak\" (frottoir à dents)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 143,
			"arabicnumber": 143,
			"text": "Ibn As-Sabbag a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit dans un jour de Vendredi: «O gens musulmans! Allah vous a rendu ce jour comme un jour de fête, faites y donc une lotion. Il n'y aura pas de mal à ce que l'un de vous se parfume s'il en trouve et pour cela, faites usage de siwak»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 144,
			"arabicnumber": 144,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Si ce n'était trop imposer d'excessif à ma communauté, j'aurais ordonné de faire usage du siwak»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 145,
			"arabicnumber": 145,
			"text": "Abou Houraira a dit: «Si (l'Envoyé d'Allah (salallahou alayhi wa salam)) ne voulait imposer quelque chose d'excessive à sa communauté, il lui aurait ordonné de faire usage du siwak avec chaque ablution» MOUATTA // Author: Brian Gosselin at scriptasylum.com var isMinNS4 = (navigator.appName.indexOf(\"Netscape\")>=0 && parseFloat(navigator.appVersion) >= 4 && parseFloat(navigator.appVersion) < 5)? true : false; var isMinIE4 = (document.all)? true : false; var isMinNS6 = (parseFloat(navigator.appVersion) >= 5 && navigator.appName.indexOf(\"Netscape\")>=0 )? true: false; var w_x, w_y, item, okscroll=false, godown, scrollamount=6; function init(){ if(isMinNS4)item=document.item; if(isMinNS6)item=document.getElementById('item'); if(isMinIE4)item=document.all.item; moveitem(); (isMinNS4)? item.visibility=\"show\" : item.style.visibility=\"visible\"; setInterval('scrollpage()' , 50); } function setscroll(ismore){ scrollamount= (ismore)? Math.min(30 , scrollamount+2) : Math.max(1, scrollamount-2); } function moveitem(){ if(isMinNS4 isMinNS6){ w_x=window.innerWidth; w_y=window.innerHeight; scrlx=window.pageXOffset; scrly=window.pageYOffset; }else{ w_x=document.body.clientWidth; w_y=document.body.clientHeight; scrlx=document.body.scrollLeft; scrly=document.body.scrollTop; } if(isMinNS4){ item.moveTo((scrlx+w_x-70),(scrly+w_y-50)) }else{ item.style.left=scrlx+w_x-70+'px'; item.style.top=scrly+w_y-50+'px'; }} function scrollpage(){ status=''; if(okscroll){ (godown)? window.scrollBy(0,scrollamount) : window.scrollBy(0,-scrollamount) ; } moveitem(); } var txt=(isMinNS4)? '<layer name=\"item\" visibility=\"hidden\" top=\"0\" left=\"0\" width=\"42\" height=\"20\">' : '<div id=\"item\" style=\"position:absolute; visibility:hidden; left:0px; top:0px; width: 42px; height:20px\">'; txt+='<a href=\"javascript:setscroll(false)\" onMouseover=\"okscroll=true; godown=true\" onMouseout=\"okscroll=false\"><img src=\"bas.gif\"/*tpa=http://www.nouralislam.org/almouwatta/livres/bas.gif*/ border=\"0\" alt=\"Cliquez pour ralentir\"></a><a href=\"javascript:setscroll(true)\" onMouseover=\"okscroll=true; godown=false\" onMouseout=\"okscroll=false\"><img src=\"haut.gif\"/*tpa=http://www.nouralislam.org/almouwatta/livres/haut.gif*/ border=\"0\" alt=\"Cliquez pour accélérer\"></a>'; txt+=(isMinNS4)? '</layer>' : '</div>'; document.write(txt); window.onload=init; Livre3 Les Prières. Chapitre premier L'appel à la prière",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 145
			}
		}
	]
}