{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"21": "Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 959,
			"arabicnumber": 959,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «L'exemple de celui qui combat dans la voie d'Allah, est pareil à celui qui jeûne jour et nuit, ne cessant de prier et de jeûner, et cela jusqu'à son retour»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 959
			}
		},
		{
			"hadithnumber": 960,
			"arabicnumber": 960,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Allah assure à celui qui combat dans sa voie, ne quittant sa demeure que pour le combat dans la voie d'Allah, témoignant ses paroles de véridiques, de le faire entrer au Paradis, ou de le ramener chez lui, à sa maison qu'il a quittée, tout en obtenant récompense céleste et butin»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 960
			}
		},
		{
			"hadithnumber": 961,
			"arabicnumber": 961,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «La propriété des chevaux est considérée soit une récompense, ou une protection ou un fardeau. Celui qui est de récompense est considéré tel, car son propriétaire l'a voué pour le combat dans la voie d'Allah, il l'a attaché, lui allongeant la corde dans une prairie ou un verger afin qu'il broute l'herbe. Et tout ce qui est brouté sera compté à titre de bonnes actions pour cet homme propriétaire due cheval. S'il est fait que ce cheval se soit détaché de sa corde, et qu'il s'éloigne en traversant aux galops deux ou trois étapes, ses traces et ses excréments en sont comptés de bonnes actions pour cet homme propriétaire. S'il arrive, que, ce cheval, passe près d'un fleuve, boive sans que son propriétaire le veuille, cela lui sera compté comme de bonnes actions et en sera récompensé. Le cheval qui est une protection, est celui dont le propriétaire l'utilise pour sa subsistance, sans mendier des autres, et sans même oublier le droit d'Allah sur leurs cous et sur leur dos. Quant au cheval fardeau, son propriétaire l'a attaché par vanité, par ostentation et par aversion contre les musulmans». On demanda l'Envoyé d'Allah (salallahou alayhi wa salam) r(Sur lui la grâce et la paix d'Allah) au sujet des ânes, il répondit: «Rien ne m'a été révélé à leur sujet, excepté ce verset général et isolé: «Celui qui aura fait le poids d'un atome de bien, le verra. Celui qui aura fait le poids d'un atome de mal, le verra» Coran XCIX. 7,8",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 961
			}
		},
		{
			"hadithnumber": 962,
			"arabicnumber": 962,
			"text": "Ata Ibn Yassar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r a dit: «Ne voulez-vous pas connaître celui qui en jouira le plus du meilleur poste (auprès d'Allah)? Il est celui qui tenant la bride de son cheval, ira combattre dans la voie d'Allah. Ne voulez-vous pas connaître celui qui le suivra? Il est celui qui, avec son troupeau, vit dans une retraite, faisant la prière, s'acquittant de la zakat et adorant Allah sans rien lui associer»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 962
			}
		},
		{
			"hadithnumber": 963,
			"arabicnumber": 963,
			"text": "Oubada Ibn Al-Samett a rapporté que son grand-père a dit: «Nous prêtâmes serment d'allégeance à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) de l'entendre et de lui obéir aussi bien dans l'aisance que dans l'indigence, dans ce qui est plaisant et ce qui est déplaisant, de ne plus disputer le pouvoir à ceux qui le détiennent, et finalement de dire et d'être pour la vérité là où nous soyons, sans la crainte du reproche d'un blâmeur»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 963
			}
		},
		{
			"hadithnumber": 964,
			"arabicnumber": 964,
			"text": "Zaid Ibn Aslam a rapporté que Abou Oubaida Ibn al-Jarrah écrivit à Omar Ibn Al-Khattab au sujet des troupes des Romains et ce qu'il redoute à leur égard». Omar lui répondit: «Ensuite, quoi qu'il en soit de l'affliction qui puisse frapper un adorateur croyant. Allah lui accordera à la suite une délivrance, car une gêne ne l'emporte pas sur deux aisances. Allah le Très-Haut a dit dans son Livre: «Ô vous qui croyez! Soyez patients! Encouragez-vous mutuellement à la patience! Soyez fermes! Craignez Allah! Peut-être serez-vous heureux» Coran III, 200. Chapitre II La prohibition de porter le Coran dans le pays de l'ennemi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 964
			}
		},
		{
			"hadithnumber": 965,
			"arabicnumber": 965,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a interdit de porter le Coran dans le pays de l'ennemi. Malek a dit: \"De peur que l'ennemi ne le souille.\" Chapitre III L'interdiction d'assommer les femmes et les enfants au cours des expéditions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 965
			}
		},
		{
			"hadithnumber": 966,
			"arabicnumber": 966,
			"text": "Un des fils de Ka'b Ibn Malek (J'ai cru qu'il est dit Abdel-Rahman Ibn Ka'b, ajouta le rapporteur) a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a interdit à ceux qui ont assommé Ibn Abi Al-Houqaiq, de massacrer les femmes et les enfants. Le rapporteur ajouta: «Un de ces hommes a dit: «La femme de Ibn Abi-Houqaiq, allant dévoiler notre présence par ses cris, je levai mon sabre pour l'abattre, quand me souvenant les paroles de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) je me retins de le faire; sans cela, nous nous serions débarassés d'elle»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 966
			}
		},
		{
			"hadithnumber": 967,
			"arabicnumber": 967,
			"text": "Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a vu au cours de l'une de ses expéditions une femme massacrée; il désapprouva cela et défendi par la suite d'assommer les femmes et les enfants»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 967
			}
		},
		{
			"hadithnumber": 968,
			"arabicnumber": 968,
			"text": "Yahia Ibn Said a rapporté que Abou Bakr Al-Siddiq avait envoyé une troupe en Syrie. Il sortit pour s'entretenir avec Yazid Ibn Abi Soufian et celui-ci était en ce temps là, gouverneur d'une de ses régions. On prétendit que Yazid avait dit à Abou Bakr: «Ou que tu montes, ou que je descends (On veut bien entendre que Abou Bakr allait à pieds, quant à Yazid, il était à cheval). Abou Bakr répondit: «Ni à toi de descendre, ni à moi de monter, car je veux bien mériter la récompense de mes pas dans la voie d'Allah». Puis il lui dit: «Tu verras des gens qui se sont consacrés à Allah (Les moines), laisse-les et celui à qui ils se sont consacrés. Tu verras des gens qui se sont rasés le sommet de leur tête (Les diacres), abats-les en frappant le sommet de leur tête». Et je te recommande dix:choses «De ne pas tuer ni une femme, ni un enfant, ni un vieillard, de ne pas couper un arbre fruitier, ni détruire ce qui est construit; de n'égorger ni un mouton ni un chameau sauf s'ils sont à manger; de ne pas mettre le feu aux abeilles et à ne pas les disperser; de ne pas frauder et de ne pas être lâche»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 968
			}
		},
		{
			"hadithnumber": 969,
			"arabicnumber": 969,
			"text": "On rapporta à Malek que Omar Ibn Abdel-Aziz écrivit à l'un de ses préfets: «On nous rapporta que si l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) envoyait une troupe d'hommes, il leur disait: «Faites l'expédition au nom d'Allah et luttez dans la voie d'Allah vous abattrez ceux qui ne croient pas en Allah; ne fraudez pas, ne trahissez pas, ne défigurez pas vos victimes et ne tuez pas les enfants». Transmez cela à ton armée et à tes troupes s'il plut à Allah. Que la paix soit sur toi». Chapitre IV Du respect de la promesse de sécurité",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 969
			}
		},
		{
			"hadithnumber": 970,
			"arabicnumber": 970,
			"text": "Malek a rapporté d'après un homme de Koufa, que Omar Ibn Al-Khattab écrivit au chef d'une troupe, envoyé pour une mission: «On m'a rapporté que des hommes parmi vous chasse l'incrédule alors que ce dernier s'est réfugié au sommet d'une montagne, un homme parmi vous lui dit: «Descends et n'aie pas peur» et une fois qu'il en fut tout près, l'homme le tua par traitise.Or, par Celui qui tiend mon ame dans Sa main! Si je connaissais où était celui qui a fait cela, j'aurais à lui couper la tête». Yahia a dit: «J'ai entendu Malek dire: «Ce hadith n'a pas été reconnu par les ulémas, et on ne met pas en exécution (les mots de Omar à savoir) couper la tête». On demanda à Malek à propos de la promesse de sécurité, est-elle verbale»? Il répondit: «Oui, je vois qu'elle peut-être signe de main, tel que, l'on s'avance aux troupes et que l'on dise: «Ne pas tuer quelqu'un à qui on aura promis la sécurité, car pour moi, un signe fait de la main équivaut à une parole». On m'a rapporté que Abdallah Ibn al-Abbas a dit: «Le peuple qui trahit la promesse, .Allah donnera la victoire à son ennemi». Chapitre V Du faitde donner une chose dans la voie d'Allah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 970
			}
		},
		{
			"hadithnumber": 971,
			"arabicnumber": 971,
			"text": "Nafe' a rapporté que Abdallah Ibn Omar, donnant à un autre une chose, lui disait: «Une fois que tu arrivera à Wadil-Qoura, tu pourras en profiter»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 971
			}
		},
		{
			"hadithnumber": 972,
			"arabicnumber": 972,
			"text": "Yahia Ibn Sa'id a rapporté que Sa'id Ibn Al-Moussaiab disait: «Quand un homme donne à un autre qui combat dans la voie d'Allah, une chose, et que cet homme arrive au lieu de combat, il pourra en profiter». On demanda à Malek au sujet d'un homme qui s'est décidé de faire une expédition, et qui s'est disposé; au moment où il voulut quitter, ses parents ou l'un d'eux, le lui empêche». Il répondit: «Qu'il ne les irrite pas, mais qu'il repousse son expédition pour l'année qui suit. Quant à son équipement (ses armes) qu'il le garde pour s'en servir quand il en aura besoin. Et s'il risque que ce dont il a disposé ne soit plus utilisable, il peut le vendre afin d'avoir le prix, avec quoi il s'achètera de quoi s'en servir pour l'expédition prochaine. Au cas où il est aisé, il pourra se procurer le même équipement pour sa prochaine expédition, où il pourra en profiter comme bon lui semble. Chapitre VI De l'assemblage du butin au cours d'une expédition",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 972
			}
		},
		{
			"hadithnumber": 973,
			"arabicnumber": 973,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a envoyé une troupe où Abdallah Ibn Omar fut membre, du côté de Najd. Ils se sont procurés un grand troupeau de chameaux où chacun a eu part de douze ou onze chameaux. Et pour butin un chameau en plus",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 973
			}
		},
		{
			"hadithnumber": 974,
			"arabicnumber": 974,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 974
			}
		},
		{
			"hadithnumber": 975,
			"arabicnumber": 975,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 975
			}
		},
		{
			"hadithnumber": 976,
			"arabicnumber": 976,
			"text": "Abou Katada Ibn Rib'i a rapporté ce qui suit: «Nous sortîmes avec l'Envoyé d'Allah (salallahou alayhi wa salam),r l'année de Hounain. Les musulmans entrèrent dans un combat acharné avec l'ennemi. Je vis un des ennemis sur le point de tuer un musulman. Je me tournai vers lui et je l'attaquai par derrière en lui donnant un coup de sabre sur la carotide. Il me fit face et me pressa d'une façon que j'allais sentir le mort puis me lâcha et tomba mort. Je croisait Omar Ibn Al-Khattab, il me dit: «Qu'ont-ils les hommes»? Je lui répondis: «C'est l'ordre d'Allah». Les hommes revenus, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) leur dit: «Celui qui a tué un ennemi, en prouvant cela, il aura ses dépouilles». Puis je me levais et dis: «Qui peut être mon témoin»? Puis je m'assieds. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) reprit sa question: «Celui qui a tué un ennemi, en prouvant cela, il aura ses dépouilles». De nouveau je me levai pour dire: «Qui peut être mon témoin»? Puis je m'assieds. Enfin pour la troisième fois, l'Envoyé d'Allah (salallahou alayhi wa salam), r reprit la même question; me levant, il me dit: «Qù'as-tu donc, ô Abou Katada»? Je lui racontai la scène, un homme se leva et dit: «C'est vrai, ô Envoyé d'Allah, et les dépouilles du mort sont chez moi. Fais-donc qu'il soit satisfait de ce qu'il en a de droit». Abou Bakr se leva et dit à l'homme: «Non! Par Allah! L'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) ne fera pas tort à un des lions d'Allah qui a combattu pour Allah et son Envoyé, qu'il te donne ses dépouilles». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) s'écria alors: «Abou Bakr a dit la vérité» puis s'adressant à l'homme, il lui dit: «Remets-lui ces dépouilles». L'homme me donna les dépouilles et en vendant la cuirasse, je me suis acheté avec son prix un jardin chez Bani Salama; et tel fut le premier bien que j'ai bénéficié de l'islam»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 976
			}
		},
		{
			"hadithnumber": 977,
			"arabicnumber": 977,
			"text": "Al-Kassem Ibn Mouhammad a rapporté qu'il a entendu un homme interrogeant Abdallah Ibn Abbas au sujet du butin? Ibn Abbas répondit: «le cheval est un butin, ainsi que les dépouilles». L'homme reprit la même question et reçut de Ibn Abbas la même réponse. L'homme demanda, pour la troisième fois, «Quel est le butin mentionné par Allah dans son Livre»? Al-Kassem dit: «Et l'homme ne cessa de demander Ibn Abbas au point de l’embarasser, quand ce dernier s'écria: «Savez-vous à qui est pareil cet homme? Il est pareil à «Sabigh» que Omar Ibn Al Khattab a frappé. On demanda à Malek au sujet d'un homme qui tua un ennemi, s’il pourra bénéficier de ses dépouilles sans la permission de l'imam? Il répondit: «II ne peut en profiter sans la permission de l'imam, et ce dernier ne peut se décider que d'après ses propres lumières. On ne m'a pas rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Que celui qui a tué un ennemi s'empare de ses dépouilles», sauf le jour de Hounain». Chapitre XI Des parts exceptionnelles du cinquième du butin. .\"al qoums",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 977
			}
		},
		{
			"hadithnumber": 978,
			"arabicnumber": 978,
			"text": "Sa'id Ibn al-Moussaiab a dit: «On donnait aux hommes des parts exceptionnelles du cinquième du butin». Malek a dit: «C'est ce qui j'ai de mieux entendu à ce sujet». On demanda à Malek au sujet des parts exceptionnelles, pourraient-elles être tenues du premier butin obtenu? Il répondit: «Cela revient à l'imam et à sa jurisprudence, et ce qui est suivi à Médine, ne peut se faire sans la jurisprudence du sultan. D'autre part on ne m'a pas rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) avait agi ainsi dans toutes ses expéditions excepté le jour de Hounain. Tout revient à la jurisprudence de l'imam au sujet du premier butin obtenu et aux autres après». Chapitre XII Les parts des cavaliers au cours des expéditions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 978
			}
		},
		{
			"hadithnumber": 979,
			"arabicnumber": 979,
			"text": "Malek a rapporté: «On m'a fait savoir que Omar Ibn Abdel Aziz disait: «Pour le cavalier, le droit est de deux parts, et d’une part pour le fantassin»? Malek ajouta: «Et on ne cesse de suivre ce principe». On demanda à Malek au sujet d'un homme qui dispose de beaucoup de chevaux au combat; ces chevaux seront-ils tous des parts à partager»? Il répondit: Je n'ai rien à ce sujet; et je pense qu'on ne doit lui donner que la part propre au cheval qu'il a monté pour combattre». Malek a dit: «Les bêtes de somme et les chevaux d'une race arabe pure, ne sont que des chevaux, car Allah Béni et Très-Haut a dit: «Il a créé pour vous les chevaux, les mulets, et les ânes, pour que vous les montiez et pour l'apparat» Coran XVI, 8. Il a dit aussi: «Préparez pour lutter contre eux, tout ce que vous trouverez, de forces et de cavaleries, afin d’éffrayer l'ennemi d'Allah et le vôtre». Coran VIII, 60. Je pense, dit Malek, que ces genres de bêtes à savoir de somme, sont des chevaux que le gouverneur permet qu'on monte». Sa'id Ibn Al-Moussaiab a dit: «On demanda à Malek, si on doit la zakat pour les bêtes de somme»? Il répondit: «Devra-t-on une zakat pour les chevaux»? (Puisque ces derniers n'exigent pas une zakat, il en sera de même pour les bêtes de somme. Chapitre XIII De la fraude du butin)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 979
			}
		},
		{
			"hadithnumber": 980,
			"arabicnumber": 980,
			"text": "Amr Ibn Chou'aib a rapporté: «Quand l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) fut de retour de Hounain, en se dirigeant vers Al-Jourana, les hommes lui demandèrent (de leur donner du butin) et finirent par l'acculer à un arbuste épineux qui lui déchiqueta le manteau et glissa de son dos». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) leur dit: «Rendez-moi nom manteau, craignez-vous que je ne vous partage pas ce que Allah m'a accordé comme butin? Par celui qui tient mon âme en sa main! Si Allah m'avait accordé des bienfaits autant que les arbres de Tihama (litt des samoura, genre d'arbre long) je vous les aurais partagés. Vous ne me trouverez ni avare, ni lâche, ni menteur». Quand l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) descendit, (de sa monture), il se tint parmi les hommes et leur dit: «Rendez le fil et l'aiguille, car la fraude n'est qu'une infamie, que feu et honte pour son auteur le jour de la résurrection». Puis il ramassa de la terre un poil de chameau, ou quelque chose de pareil, et continua: «Par celui qui tient mon âme en sa main, si Allah nous avait donné, une chose pareille, à vous et à moi, je ne tarderais pas à vous distribuer, même le cinquième qui me revient»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 980
			}
		},
		{
			"hadithnumber": 981,
			"arabicnumber": 981,
			"text": "Zaid Ibn Khaled Al-Jouhani a rapporté qu'on fit part à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) de la mort d'un homme le jour de Hounain. Zaid annonça que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Faites la prière funéraire pour votre compagnon»; les visages des hommes changèrent et Zaid poursuivit que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) leur dit: «Votre compagnon a fraudé le butin». Les hommes, ouvrirent, les bagages du mort, et trouvèrent quelques perles d'un collier provenant des biens des Juifs, dont la valeur ne dépassait pas deux dirhams»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 981
			}
		},
		{
			"hadithnumber": 982,
			"arabicnumber": 982,
			"text": "Abdallah Ibn al-Moughira Ibn Abi Bourda Al-Kinani a dit qu'on lui rapporta que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) vint trouver les gens en invoquant Allah pour eux, citant toutes les tribus et négligeant une. Il dit: «Les hommes de cette tribu ont trouvé dans la bât d'une monture qui appartenait à l'un d'eux, un collier de grains noirs et blancs qu'il avait fraudé du butin. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) rejoint ces hommes, fit sur eux le takbir comme on le fait pour un mort»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 982
			}
		},
		{
			"hadithnumber": 983,
			"arabicnumber": 983,
			"text": "Abou Houraira a rapporté: «Nous sommes partis avec l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) l'année de Khaibar, sans que nous ayons eu pour butin, ni or, ni argent mais seulement des vêtements et des ustensiles. Rifa'a Ibn Zaid fit un présent à l'Envoyé d'Allah (salallahou alayhi wa salam) r la prière (Sur lui la grâce et la paix d'Allah) un esclave noir appelé Mid'am. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah), ordonna les hommes de se rendre à Wadi-Al-Qoura. Quand ils furent là alors que Mid'am déposait le bât du chameau de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) il fut touché par une flèche venant du hazard, qui le tua». Les hommes s'écrièrent: «Quel heureux sort, qu'il soit au Paradis». L'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) répondit: «Non! Par celui qui tient mon âme en sa main! la \"chemia\" (large étoffe sous forme de manteau) qu'il avait prise du butin le jour de Khaibar avant qu'il soit partagé le brûlera dans le feu». Apprenant cela, un homme parmi les gens apporta un ou deux lacets de sandales et les donna à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) qui dit: «Un ou deux lacets du feu »",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 983
			}
		},
		{
			"hadithnumber": 984,
			"arabicnumber": 984,
			"text": "Abdallah Ibn Abbas a dit: «Jamais une fraude n'apparut chez des gens, sans que la frayeur n'ait pris leur cœur; quand l'adultère se répand chez les gens la mort augmente quand les gens faussent la mesure et la balance, ils seront privés des biens; quand les gens ne jugent pas selon la vérité, la tuerie se propagera parmi eux; quand les gens trahissent le pacte, Allah donnera le pouvoir sur eux à leur ennemi». Chapitre XIV Les martyrs dans le chemin d'Allah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 984
			}
		},
		{
			"hadithnumber": 985,
			"arabicnumber": 985,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Par celui qui tient mon âme entre ses mains! Je voudrais bien combattre dans la voie d'Allah, et que je sois tué, puis que je revive, puis être tué, puis que je revive de nouveau et enfin tué». Abou Houraira en rapportant cela disait: «J'en jure par Allah trois fois»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 985
			}
		},
		{
			"hadithnumber": 986,
			"arabicnumber": 986,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Allah rit de deux hommes: Que l'un tue l'autre et qu'ils entrent tous deux au Paradis. Le premier, combattant dans la voie d'Allah, est tué; puis Allah reviendra vers le tueur et le fera repentir; ainsi ce tueur combattra dans la voie d'Allah, et sera tué à son tour»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 986
			}
		},
		{
			"hadithnumber": 987,
			"arabicnumber": 987,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Par celui qui tient mon âme entre ses mains! Quiconque sera blessé en combattant dans la voie d'Allah, et Allah connaît celui qui sera blessé dans sa voie, viendra le jour de la résurrection de sa blessure coulera du sang; la couleur est celle du sang, et l'odeur celle du musc»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 987
			}
		},
		{
			"hadithnumber": 988,
			"arabicnumber": 988,
			"text": "Zaid Ibn Aslam a rapporté que Omar Ibn Al-Khattab disait: «Ô Allah! Ne fais pas que mon meurtier soit un homme qui a déjà accompli une seule raka't, pour Toi et qui sera un argument à le soutenir, le jour de la résurrection»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 988
			}
		},
		{
			"hadithnumber": 989,
			"arabicnumber": 989,
			"text": "Abou Katada a rapporté qu'un homme vint trouver l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) et lui dit: «O Envoyé d'Allah! Si je suis tué en combattant dans la voie d'Allah, me résignant et espérant être récompensé, allant toujours en avant sans jamais reculer. Allah me pardonnera-t-il mes péchés»? Il lui répondit: «Oui». L'homme partit, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) l'appela ou ordonna qu'on l'appelle et lui dit: «Qu'est-ce que tu viens de dire»; l'homme reprit ses dires; le Prophète (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) lui répondit alors: «Oui, excepté la dette, et c'est Gabriel qui est venu me le dire»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 989
			}
		},
		{
			"hadithnumber": 990,
			"arabicnumber": 990,
			"text": "On rapporta à Abou-Al-Nadar, l'esclave de Omar Ibn Oubaidallah que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit aux martyrs de Ouhod: «Ceux-ci, je me tiens pour leur témoin»; Abou Bakr Al-Siddiq lui dit: «Ne sommes-nous pas leurs frères? Nous avons combattu comme ils l'ont fait»? L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui répondit: «Certainement; mais j'ignore ce qui vous arrivera après mon départ»; Abou Bakr se mit à pleurer, et continua puis dit: «Serons-nous vivants après toi»?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 990
			}
		},
		{
			"hadithnumber": 991,
			"arabicnumber": 991,
			"text": "Yahia Ibn Sa'id a rapporté: «L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) était assis, alors qu'une tombe se creusait à Médine. Un homme à la vue de la tombe, s'écria: «Quel détestable séjour pour le croyant»! L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui répondit: «C'est mal ce que tu viens de dire». L'homme reprit: «Je ne voulais pas désigner la tombe, mais j'entendais le fait d'etre tuer dans la voie d'Allah». L'Envoyé d'Allah (salallahou alayhi wa salam) r répondit: «Rien n'est pareil au fait d'être tué dans la voie d'Allah, et nul endroit ne m'est préférable que d'avoir ma tombe en ce lieu même». Il répéta cela pour trois fois et voulait dire la Médine. Chapitre XV En quoi consiste le martyr",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 991
			}
		},
		{
			"hadithnumber": 992,
			"arabicnumber": 992,
			"text": "Zaid Ibn Aslam a rapporté que Omar Ibn Al-Khattab disait souvent: «O Allah! Je te demande de m'accorder le martyre dans ta voie et la mort dans le pays de Ton Envoyé»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 992
			}
		},
		{
			"hadithnumber": 993,
			"arabicnumber": 993,
			"text": "Yahia Ibn Sa'id a rapporté que Omar Ibn Al-Khattab a dit: «La générosité du bon croyant est sa piété, sa religion est sa noble lignée, sa prouesse est son bon caractère; quant à l'audace et à la lâcheté, ce sont des instincts que Allah place là où il veut. Ainsi le lâche fuit son père et sa mère, et l'audacieux combattra sans trop considérer ce qu'il pourra apporter en revenant chez lui. La tuerie est un moyen de la mort. Le martyr est celui qui se donne pour Allah, espérant obtenir la récompense». Chapitre XVI Du lavage du martyr",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 993
			}
		},
		{
			"hadithnumber": 994,
			"arabicnumber": 994,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 994
			}
		},
		{
			"hadithnumber": 995,
			"arabicnumber": 995,
			"text": "Yahia Ibn Sa'id a rapporté que Omar Ibn Al-Khattab donna une année quarante mille chameaux. Des fois il donnait un chameau pour un seul homme, et parfois il donnait pour deux hommes un chameau, pour se rendre en Iraq au cours de ses expéditions en Iraq. Un homme de L'Iraq vint le trouver et lui dit: «Fais que moi et «Souhaim», soyons sur un chameau»; Omar lui répondit: «Par Allah! Ce «Souhaim», ci, est-il une outre»? «Oui» répliqua l'homme». Chapitre XVIII L'exhortation au combat dans la voie d'Allah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 995
			}
		},
		{
			"hadithnumber": 996,
			"arabicnumber": 996,
			"text": "Anas Ibn Malek a rapporté: «Quand l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) partait pour Qouba, il se rendait chez Oum Haram Bint Milham, femme de Oubada Bint al-Samett, qui lui donnait à manger. Un jour, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) se rendit chez elle, elle lui donna à manger, puis s'assit pour épouiller sa tête. L'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) s'endormit, puis s'éveilla en riant. Oum Haram dit: «Je lui demandai: «Ô Envoyé d'Allah qu'est-ce qui te fait rire»? Il me dit: «Des hommes de ma communauté, m'ont été présentés (en rêve), combattant dans la voie d'Allah; ils prenaient la mer en large, des rois sur leurs trônes, ou comme des rois sur leurs trônes (le rapporteur se doute de l'exactitude)». Je lui dis: «Ô Envoyé d'Allah! Invoque Allah pour que je sois parmi eux; il invoqua Allah pour elle, puis il réposa sa tête et s'endormit. Et après, il se réveilla, riant». Elle dit: «Je lui demandai: «Ô Envoyé d'Allah! Qu'est-ce qui te fait rire»? Il lui répondit: «Des gens de ma communauté, m'ont été présentés (en rêve), au cours d'une expédition dans la voie d'Allah. Ils sont des rois sur leurs trônes ou comme des rois sur leurs trônes, reprenant les mêmes paroles». Je lui dis: «Ô Envoyé d'Allah invoque Allah pour moi afin que je sois l'une d'eux». Il répondit: «Tu es parmi les premiers». Le rapporteur ajouta: «Elle naviguait, au temps où Mou'awia gouvernait; et en, débarquant, elle tomba de sa monture et fut tuée»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 996
			}
		},
		{
			"hadithnumber": 997,
			"arabicnumber": 997,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Si je ne craignais, de mettre en peine à ma communauté, j'aurais aimé ne jamais manquer une troupe d'homme partant pour une expédition dans la voie d'Allah. Mais je ne peux pas toujours avoir des montures à mettre à leur disposition, afin qu'ils puissent accomplir leur mission. D'autre part, ils ne pourront pas supporter, rester derrière moi. Ainsi, j'aimerais combattre dans la voie d'Allah, et que je sois tué, puis revenir à la vie, puis tué encore, et finalement revenir à la vie de nouveau, et être tué»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 997
			}
		},
		{
			"hadithnumber": 998,
			"arabicnumber": 998,
			"text": "Yahia Ibn Sa'id a rapporté: «Quand ce fut le jour de Ouhod, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) s'adressant aux fidèles, dit: «Qui peut m'apporter des nouvelles de Sa'd Ibn Al-Rabi' Al-Ansari»? Un homme répondit: «Moi, O Envoyé d'Allah». L'homme partit, cherchant parmi les tués. Sa'd Ibn Al Rabi' lui demanda: «Que veux-tu»? L'homme répondit: «L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) m'a chargé de lui apporter de tes nouvelles». Sa'd répliqua: «Retournes chez lui, transmets-lui mon salut, et dis-lui que j'ai reçu douze coups de lance qui pouvaient causer ma mort, mais j'ai été sauvé. Rapporte à tes concitoyens, qu'ils ne seront jamais excusés auprès d'Allah, si L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) est tué, et que l'un de vous restera vivant»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 998
			}
		},
		{
			"hadithnumber": 999,
			"arabicnumber": 999,
			"text": "Yahia Ibn Sa'id a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) incitait les hommes au combat dans la voie d'Allah, et mentionnait le Paradis. Un homme des Ansars mangeait des dattes qui se trouvaient dans sa main et dit: «Ce sera une avidité du monde d'ici-bas, si je reste passant le temps pour finir ces dattes, il les jeta, prit son épée, puis combattit jusqu'à ce qu'il fut tué»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 999
			}
		},
		{
			"hadithnumber": 1000,
			"arabicnumber": 1000,
			"text": "Yahia Ibn Sa'id a rapporté que Mou'az Ibn Jabal a dit: «II y a deux genres d'expédition: Une où l'on dépense les biens précieux, où on traite le compagnon avec clémence, où on obéit à celui qui a le pouvoir, et où on évite la perversité; cette expédition n'apporte que le bien. L'autre, est une expédition où on ne dépense pas des biens, où on traite grossièrement le compagnon, où on n'obéit pas à celui qui tient le pouvoir, et où on n'évite pas la perversité. Une telle expédition, n'apporte aucun bien à celui qui y participe. Chapitre XIX Au sujet des chevaux, des courses de chevaux et la dépense pour les expéditions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1000
			}
		},
		{
			"hadithnumber": 1001,
			"arabicnumber": 1001,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Le bien sera attaché aux toupets des chevaux jusqu'au jour de la résurrection»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1001
			}
		},
		{
			"hadithnumber": 1002,
			"arabicnumber": 1002,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) participa à la course des chevaux mis pour le trajet entre «Al-Hafia» jusqu'à «Thaniat- Al-Wadah»; il participa de même à la course entre les chevaux qui n'ont pas été entraînés de la thania jusqu'à la mosquée de Bani Zouraiq. Et Abdallah Ibn Omar avait encore participé à cette course»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1002
			}
		},
		{
			"hadithnumber": 1003,
			"arabicnumber": 1003,
			"text": "Yahia Ibn Sa'id a rapporté qu'il a entendu Sa'id Ibn Al-Moussaiab dire: «II n'y a pas de mal, de parier sur les chevaux, s'il y a un certain prix à recevoir au cas où on gagne une course. Au cas de la perte, on ne doit rien payer. (C'est-à-dire qu'il n'y a pas à avancer un pari, mais, un prix que le vainqueur doit avoir)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1003
			}
		},
		{
			"hadithnumber": 1004,
			"arabicnumber": 1004,
			"text": "Yahia Ibn Sa'id a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a été vu essuyant la tête de son cheval de son manteau. Comme on lui demanda d'expliquer cela, il répondit: «On me reprocha, cette nuit, d'avoir négligé les chevaux»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1004
			}
		},
		{
			"hadithnumber": 1005,
			"arabicnumber": 1005,
			"text": "Anas Ibn Malek a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r Sur lui la -grâce et la paix d'Allah parti pour l'expédition de Khaibar, il y arriva la nuit. Et d'habitude, s'il arrivait au lieu de l'expédition la nuit, il n'attaquait que le matin. Les juifs de Khaibar sortirent avec leurs pelles et leurs couffins, le voyant, ils s'écrièrent: «Mouhammad! par Allah! C'est Mouhammad et son «Khamis» (son armée). Alors, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) déclara: «Allah est Grand Khaibar est ruinée. Quand nous descendons dans la place des gens, quel désastreux réveil sera-t-il, pour ceux qui ont été avertis»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1005
			}
		},
		{
			"hadithnumber": 1006,
			"arabicnumber": 1006,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Celui qui use deux paires (de ses biens) dans la voie d'Allah, il lui sera dit au Paradis: «Ô serviteur d'Allah, cela est bien»; celui qui est de ceux qui accomplissent la prière, on l'appellera de la porte de la prière; celui qui est de ceux qui ont participé aux combats, on l'appellera de la porte du combat; celui qui est de ceux qui ont fait l'aumône, on l'appellera de la porte de l'aumône; celui qui est de ceux qui ont jeûné, on l'appellera de la porte dite: «Al-Rayan». Abou Bakr Al-Siddiq dit alors: «ô Envoyé d'Allah, celui qui sera appelé par l'une de ces portes n'aura donc plus à s'embarasser; y aura-t-il quelques uns qui seront appelés par toutes ces portes»? Il lui répondit: «Certes, oui, et j'espère, que tu sois l'un d'eux». Chapitre XX De la récupération, par les gens du Livre qui suivent l'islam, de leur territoire. On demanda à Malek à propos de l'imam, qui accepte l'impôt, que payaient les gens (du Livre). Comment traites-tu ceux qui ont suivi l'Islam, ont-ils droit à leurs territoires, ou seront-ils pour les musulmans, aussi bien que leurs territoires, ou seront-ils pour les musulmans, aussi bien que leurs possessions». Malek répondit: «Cela est à discuter: ainsi, ceux qui ont signé un pacte de paix, et ayant suivi l'Islam, auront droit à leurs territoires et aux biens qu'ils possédaient; par contre ceux qui ont été vaincus par force, n'auront droit ni à leurs territoires, ni aux biens possédés même s'ils suivront l'Islam, car ils ont lutté contre les musulmans, et les ont affrontés; par conséquent leurs territoires et leurs biens seront d'appartenance musulmane. Quant à ceux qui ont été pour la paix, ils ont ainsi défendu leurs personnes et leurs biens, sans chercher à résister». Chapitre XXI De l'enterrement dans une seule tombe de plusieurs morts, et de la promesse de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) accomplie par Abou Bakr",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1006
			}
		},
		{
			"hadithnumber": 1007,
			"arabicnumber": 1007,
			"text": "Abdel Rahman Ibn Abi Sa'ssa'a a rapporté qu'il a appris que Amr Ibn Al-Jamouh et Abdallah Ibn Amr, Al-Ansarines puis les Al-Salamines, étaient enterrés dans une seule tombe qui fut détruite par le torrent, et cette tombe était située tout près de son cours. Tous deux furent tués en martyrs le jour de Ouhod. En creusant leur tombe pour les enterrer dans une autre, on les trouva comme récemment morts sans que leurs cadavres ne soient pourris. L'un d'eux blessé, avait la main posée sur sa blessure, et il était enterré ainsi; en le transférant pour l'enterrer dans la nouvelle tombe, on lui enleva la main qui couvrait sa blessure, elle revint à sa place. Et entre le jour de Ouhod et le jour de leur enterrement, on souligne une durée de quarante six ans». Malek a dit: «II n'y a pas de mal, à ce que deux ou trois hommes soient enterrés dans une seule tombe, par nécessité, à condition que le plus âgé soit placé du côté de la Qibla»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1007
			}
		},
		{
			"hadithnumber": 1008,
			"arabicnumber": 1008,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1008
			}
		}
	]
}