{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"25": "Game"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "Nafe' a rapporté: «J'ai lancé une pierre, sur deux oiseaux, alors que je fus à «Al-Jourof», et je les ai atteints. L'un d'eux, étant mort, Abdallah Ibn Omar, le jeta. Quant à l'autre, Abdallah le porta et l'égorgea par une hachette; mais étant mort, avant qu'il ne soit égorgé, Abdallah le jeta aussi»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1052
			}
		},
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "On rapporta à Malek que al-Kassem Ibn Mouhammad, repoussait l'acte de tuer l'animal à l'aide d'un Mi'rad ou d'une balle»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1053
			}
		},
		{
			"hadithnumber": 1054,
			"arabicnumber": 1054,
			"text": "On rapporta à Malek que Sa'id Ibn Al-Moussaiab, répugnait que l'animal domestique soit tué comme l'animal qui est à chasser, par une flèche ou autre moyen qui lui est de pareil». Malek a dit: «Je ne vois aucun mal à ce que l'animal, tué par Al-Mi'rad qui s'enfonce dans son corps et cause sa mort, qu'il soit mangé. Selon les paroles d'Allah Béni et Très-Haut: «Ô vous qui croyez! Allah va vous éprouver à propos du gibier que vos mains et vos lances vous ont procuré» Coran V, 94. Ainsi donc, tout ce que l'homme pourra obtenir soit de sa main, soit par sa lance, ou par n'importe quelle arme, et que cela s'enfonce dans le corps du gibier et cause sa mort, est une chasse licite, tel que Allah l'a affirmée»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1054
			}
		},
		{
			"hadithnumber": 1055,
			"arabicnumber": 1055,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1055
			}
		},
		{
			"hadithnumber": 1056,
			"arabicnumber": 1056,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1056
			}
		},
		{
			"hadithnumber": 1057,
			"arabicnumber": 1057,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1057
			}
		},
		{
			"hadithnumber": 1058,
			"arabicnumber": 1058,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1058
			}
		},
		{
			"hadithnumber": 1059,
			"arabicnumber": 1059,
			"text": "Nafe' a rapporté que Abdel-Rahman Ibn Abi Houraira demanda à Abdallah Ibn Omar, concernant les animaux que la mer jette sur les rives.qui dit Il est interdit de les manger». Nafe' ajouta: «Puis Abdallah revint sur ses dires, apporta le Coran et récita: «Le gibier de la mer et la nourriture qui s'y trouve vous est permis» Coran V, 96. Nafe' continue: «Alors, Abdallah Ibn Omar m'envoya auprès de Abdel Rahman Ibn Abi Houraira, lui dire: «II n'y a pas de mal à les manger». (1072)'10 - Sa'd Al-Jari, l'affranchi de Omar Ibn Al-Khattab a dit: «J'ai demandé Abdallah Ibn Omar au sujet des baleines qui s'entretuent, ou qui meurent de froid? Peut-on les manger? Il répondit: «II n'y a pas de mal en cela». Puis j'ai demandé à leur sujet, Abdallah Ibn amr Ibn al-A's, qui me donna la même réponse»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1059
			}
		},
		{
			"hadithnumber": 1060,
			"arabicnumber": 1060,
			"text": "Abou Salama Ibn Abdel-Rahman a rapporté que Abou Houraira et Zaid Ibn Thabet, ne voyaient pas de mal à manger ce qui est jeté par la mer»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1060
			}
		},
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"text": "Abou Salama Ibn Abdel-Rahman a rapporté que des gens de «Al-Jar» (lieu situé près de Médine) arrivèrent auprès de Marwan Ibn Al-Hakam à Médine, lui demandant au sujet de ce que la mer jette, s'il est légal de le manger». Il leur répondit:«Il n'y a pas de mal à le faire» .Puis il ajouta: « Rendez-vous auprès de Zaid Ibn Thabet et de Abou Houraira pour vous renseigner de plus, puis revenez m'apprendre ce qu'ils vous diront». Ils allèrent, leur demandèrent la même question et reçurent encore la même réponse. Ils revinrent chez Marwan Ibn Al-Hakam, lui rapportant ce qui était dit; alors il leur répondit: «C'est bien ce que je vous ai dit». Malek a dit: «II n'y a pas de mal à manger les poissons qu'un mage pêche, car l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit au sujet de la mer: «Son eau est purifiante, et ses animaux morts sont licites». Malek a ajouté: «Et si l'on mange ces poissons, même mort il ne faut pas tenir compte du pêcheur». Chapitre IV L’interdiction de manger les animaux carnassiers",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1061
			}
		},
		{
			"hadithnumber": 1062,
			"arabicnumber": 1062,
			"text": "Abou Tha'iaba a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Le fait de manger de la chair d'un animal carnassier est interdit»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1062
			}
		},
		{
			"hadithnumber": 1063,
			"arabicnumber": 1063,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1063
			}
		},
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "Malek a dit: «Ce que j'ai de mieux entendu au sujet des chevaux, des mulets et des ânes, c'est que leur chair n'est pas à manger, car selon les paroles d'Allah Béni et Très-Haut: «II a créé pour vous les chevaux, les mulets et les ânes, pour que vous les montiez et pour l'apparat» Coran XVI, 8. Il a dit aussi au sujet de troupeaux: «...afin que certains d'entre eux vous servent de montures et d'autres de nourriture» Coran XL, 79. Il a dit aussi: «Afin que les hommes invoquent le nom d'Allah sur la bête des troupeaux» Coran XXII, 34. Et: «mangez-en et nourrissez celui qui s'en contente et celui qui mendie» Coran XXII, 36. Malek, interprétant ces versets dit: «J'ai entendu dire que le malheureux est le pauvre, et celui qui mendie est l'homme qui barre la route pour demander l’aumône». Malek dit encore: «Allah a mentionné les chevaux, les mulets et les ânes pour être montés et pour l'apparat, quant aux» troupeaux, ils sont pour être montés et pour la nourriture». Malek finalement dit: «Celui qui se contente (de peu de nourriture) est aussi un pauvre». Chapitre VI Au sujet des peaux des bêtes mortes ( 1078) 16 - Abdallah Ibn Abbas A rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) Sur lui 1a grâce et la paix d'Allah passa par un mouton mort qui avait été donné comme aumône à une affranchie de Maimouna la femme du Prophète r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah);,,il dit : «N'avez-vous pas profité de la peau de cet animal»? On lui répondit: «Ô Envoyé d'Allah, il est mort», il reprit: «La chair de cet animal vous est interdite»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1064
			}
		},
		{
			"hadithnumber": 1065,
			"arabicnumber": 1065,
			"text": "Abdallah Ibn Abbas a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Au cas où la peau est tannée, elle est purifiée»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1065
			}
		},
		{
			"hadithnumber": 1066,
			"arabicnumber": 1066,
			"text": "Aicha, la femme du Prophète r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam), ordonne que l'on use des peaux des animaux, une fois qu'elles sont tannées». Chapitre VII Celui qui est obligé de manger de la chair d'un animal mort",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1066
			}
		}
	]
}