{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"3": "Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 146,
			"arabicnumber": 146,
			"text": "Yahia Ibn Sa'id a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) voulait se servir de deux planches de bois (comme une crécelle), qui en les battant, appelait les fidèles à la prière en commun. On fit montrer en rêve à Abdallah Ibn Zaid Al-Ansari et à un autre de Bani Al-Hareth Ibn Al-Khazraj deux planches de bois pareilles à celles que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) voulait s'en servir, et on leur dit:«pourquoi vous n'appelez pas à la prière»? Une fois réveillé, Abdallah vint trouver l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) et lui raconta son rêve. L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) donna aussitôt l'ordre d'appeler à la prière",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mursal Sahih Isnaad"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 147,
			"arabicnumber": 147,
			"text": "Abou Sa'id Al- Khoudri a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «lorsque vous entendez l'appel à la prière, répétez ce que dit le muezzin»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 148,
			"arabicnumber": 148,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Si les gens savaient le mérite qu'il y a, à faire l'appel à la prière, et d'être au premier rang (faisant la prière en commun) et qu'ils ne trouvent pas d'autres moyens pour y arriver que le tirage au sort, ils auraient tiré au sort. S'ils savaient ce qu'il y a comme mérite en arrivant tôt pour prier dans la mosquée, ils se seraient hâtés d'y accourir. Et s'ils savaient ce qu'il y a comme mérite à faire la prière du soir et celle de l'aurore en commun, ils se seraient rendus, en trainant même à quatre pattes»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 149,
			"arabicnumber": 149,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «lorsque vous entendez le deuxième appel à la prière, ne vous y rendez pas en pressant le pas, venez plutôt en toute tranquilité. Ce que vous réussirez à faire en commun, faites-le, et complétez ce que vous aurez manqué. Chacun de vous est consédéré comme étant en prière tant qu'il cherche à l'accomplir»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 150,
			"arabicnumber": 150,
			"text": "Al- Mazini a rapporté d'après son père que Abou Sa'id Al Khoudri lui a dit: «Je vois que tu aimes les moutons et le désert. Quand tu es avec tes moutons, ou dans le désert, et que tu appelleras à la prière, hausse la voix car aucun génie, un être humain, ni ce qui est inanimé, n'entendra la portée de la voix du muezzin, sans qu'il ne témoigne, en sa faveur, le jour de la résurrection». Abou Sa'id ajouta: «C'est ce que j'ai entendu de la bouche de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah)»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 151,
			"arabicnumber": 151,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «lorsqu'on appelle à la prière, Satan s'en va, et fait des pets afin de ne pas entendre cet appel. Une fois que le premier appel est terminé, il revient et reste jusqu'au moment du deuxième appel. Quand le deuxième appel fut fait, Satan s'en va de nouveau puis revient pour se placer entre l'homme et son cœur, en lui suggérant et en disant: «Souviens-toi de telle chose, souviens- toi de telle chose, à laquelle cet homme ne pensait jamais, qu'à la fin, il ne se souvient plus le nombre des raka'ts qu'il a déjà effectuées». 155) 7 - Sahl Ibn Sa'd As-Sa'idi a dit: «il y a deux moments (litt deux heures) où les Portes du ciel s'ouvrent et peu de gens invoquent Allah et que leurs prières ne soient exaucées: quand on appelle à la prière et quand on se met en rang pour combattre dans la voie d'Allah». On demanda à Malek au sujet du moment de l'appel à la prière, le jour du Vendredi sera-t-il avant son heure fixée. Il répondit: «non, son moment sera quand le soleil aura quitté le méridien». On demanda à Malek au sujet des deux appels à la prière et quand les gens doivent-ils se lever pour faire la prière? Il répondit: «Je ne connais à leur sujet autre que ce j'ai vu les hommes faire: au deuxième appel on ne reprend pas pour deux fois les mêmes paroles (ce qu'on fait pour le premier) et c'est bien ce que les gens versés ne cessent de faire à Médine. Quant au moment où les gens doivent se lever pour faire la prière après le deuxième appel, je ne trouve pas en cela un temps bien déterminé, mais je vois bien qu'on doit prendre en considération la capacité des hommes, car parmi eux, il y aura et le fort et le faible, et ils ne pourront pas être tous semblables». On demanda à Malek au sujet des gens tous présents pour faire la prière prescrite, en commun; ainsi ils voulaient faire le deuxième appel sans le premier? Il répondit: «cela suffit car le premier appel n'a été imposé que dans les mosquées fréquentées par une multitude de gens où on fait la prière en commun». On demanda encore à Malek au sujet du salut que fait le muezzin à l'imam et son invitation pour présider la prière et de la première personne qu'on avait saluée? Il répondit: «on ne m'a pas fait savoir que ce salut était pratiqué à là première époque». On demanda à Malek au sujet d'un homme qui appelle à la prière mais sans que personne ne soit présent pour la faire avec lui; alors il fait le deuxième appel, et prie tout seul, après quoi les gens viennent prier, devra-t-il refaire la prière avec eux? Il répondit: «non, il ne devra plus la refaire, et celui qui viendra après que la prière ait pris fin, il pourra l'accomplir seul». On demanda à Malek au sujet d'un homme qui appelle à la prière et fait ensuite une prière surérogatoire. Les gens arrivant à la mosquée, voulaient qu'un autre fasse le deuxième appel peut être fait par une autre personne». Malek a dit: «on ne cesse de faire le premier appel à la prière de l'aube avant que l'aurore apparaît. Quant aux autres prières, on ne fait le premier appel qu'après leurs heures fixées",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 152,
			"arabicnumber": 152,
			"text": "On rapporta à Malek que le muezzin vint trouver Omar Ibn Al-Khattab pour l'avertir que c'est le moment de la prière de l'aurore. Le trouvant endormi, il lui dit: «la prière vaut mieux que le sommeil. Omar par la suite, ordonna que cela soit prononcé dans le premier appel à la prière de l'aurore",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 153,
			"arabicnumber": 153,
			"text": "Souhail Ibn Malek a rapporté d'après son père qu'il a dit: «Ce que j'ai vu les hommes (il est entendu: les compagnons du Prophète (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah)) faire (sans le changer) c'est le premier appel à la prière»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 154,
			"arabicnumber": 154,
			"text": "Souhail Ibn Malek a rapporté d'après son père qu'il a dit: «Ce que j'ai vu les hommes (il est entendu: les compagnons du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah)) faire (sans le changer) c'est le premier appel à la prière»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 155,
			"arabicnumber": 155,
			"text": "Nafe' a rapporté que Abdallah Ibn Omar, se trouvant à «Al-Baqi'», entendit l'appel à la prière, ainsi il pressa le pas pour se rendre à la mosquée». Chapitre II De l'appel à la prière en voyage avant de faire les ablutions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 156,
			"arabicnumber": 156,
			"text": "Nafe' a rapporté : «dans une nuit très froide où le vent soufflait fort, Abdallah Ibn Omar appela à la prière et à la fin il dit: «faites la prière chez vous». (En le questionnant) il répondit: «au cours d'une nuit froide et pluvieuse, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a ordonné au muezzin de dire à la fin de l'appel: «faites la prière chez vous»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 157,
			"arabicnumber": 157,
			"text": "Nafe' a rapporté que Abdallah Ibn Omar, se trouvant en voyage, il ne faisait que le deuxième appel à la prière sauf pour celle de l'aurore, où il faisait le premier. Il disait: «le premier appel à la prière n'a été imposé que pour inviter les gens à se réunir autour l'imam (pour faire la prière en commun)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 158,
			"arabicnumber": 158,
			"text": "Hicham Ibn Ourwa a rapporté que son père lui a dit: «quand tu es en voyage, tu peux faire lé premier et le deuxième appels à la prière, et tu peux te contenter du deuxième sans le premier». Malek a dit: «il n'y a pas de mal à ce qu'un homme fasse le premier appel à la prière en enfourchant sa monture»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 159,
			"arabicnumber": 159,
			"text": "Sa'id Ibn Al-Moussaiab disait: «celui qui fait la prière (seul) dans une place désertée, un ange à sa droite et un autre à sa gauche prient avec lui. Quand il fait le premier et le deuxième appel à la prière ou le deuxième, seul, une foule des anges pareille aux montagnes prient derrière lui». Chapitre III Le temps consacré au souhour expire avec le premier appel à la prière",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 160,
			"arabicnumber": 160,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Bilal fait appel à la prière tant qu'il fait encore nuit, mangez et buvez jusqu'à ce que Ibn Maktoun fasse cet appel»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 161,
			"arabicnumber": 161,
			"text": "Salem Ibn Abdallah a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam)r (Sur lui la grâce et la paix d'Allah) a dit: «Or Bilal appelle quand il faisait encore nuit, mangez et buvez jusqu'à ce que Ibn Maktoum fasse cet appel». Il ajouta: «Ibn Maktoum était un homme aveugle, et il ne faisait appel à la prière, que quand on lui disait: «tu es au matin, tu es au matin». Chapitre IV Comment procéder à la prière",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 162,
			"arabicnumber": 162,
			"text": "Abdallah Ibn Omar a rapporté: «quand l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) commençait la prière, il levait ses mains au niveau de ses épaules, de même quand il relevait la tête de l'inclinaison, et disait: «Allah écoute ceux qui le louent, notre Seigneur à vous la louange», mais il ne faisait pas cela quand il se prosternait». (l66) 18 - Ali Ibn Houssein Ibn Ali Ibn Abi Taleb a rapporté: «l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) prononçait le takbir (dire: Allah est grand) quand il s'abaissait (pour s'incliner ou se prosterner) et en relevant ta tête de la prosternation. Il agissait ainsi, jusqu'à ce qu'il ait rencontré Allah»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 163,
			"arabicnumber": 163,
			"text": "Soulaiman Ibn Yassar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) levait les mains (au commencement de la prière)»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 164,
			"arabicnumber": 164,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 165,
			"arabicnumber": 165,
			"text": "Abou Salama Ibn Abdel-Rahman Ibn Awf, a rapporté que Abou Houraira leur présidant la prière, prononçait le takbir à chaque fois qu'il s'abaissait (pour s'incliner et pour se prosterner) et puis qu'il relevait la tête (de la prosternation). Sa prière terminée, il dit: «Par Allah! Cette prière est pareille à celle que faisait l'Envoyé d'Allah (salallahou alayhi wa salam)»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 166,
			"arabicnumber": 166,
			"text": "Salem Ibn Abdallah a rapporté que Abdallah Ibn Omar prononçait le takbir chaque fois qu'il s'inclinait et se prosternait». (...) 22 - Nafe' a rapporté qu'au commencement de la prière, Abdallah Ibn Omar levait ses mains au niveau de ses épaules, et ainsi quand il levait la tête de l'inclinaison»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 168,
			"arabicnumber": 168,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 169,
			"arabicnumber": 169,
			"text": "Malek a rapporté que Ibn Chéhab disait: «lorsque l'homme parvient à faire une seule raka't (en commun) et prononce une fois le takbir, cela lui suffisait». Malek, commentant cela, a dit: «lorsque l'homme veut par ce takbir débuter sa prière». On demanda à Malek, au sujet d'un homme qui vient faire la prière en commun derrière l'imam, en oubliant de faire le takbir au commencement de la prière, et à l'inclinaison, jusqu'à ce qu'il ait accompli une raka't, puis se rappelant de cela, il prononce le takbir lors de la deuxième raka't»? Il répondit: «il m'est de préférence qu'il fasse le takbir au commencement de la prière même s'il oublie de le faire en suivant l'imam et il le fait lors de la première inclinaison, car cela lui suffit s'il le considère comme le takbir du commencement». Au sujet de celui qui faisant, seul, la prière en oubliant de prononcer le takbir au commencement, Malek a dit: «il peut poursuivre sa prière». Et concernant, l'imam qui oublie le takbir du commencement de la prière, jusqu'à ce qu'il l'accomplisse, Malek a dit: «Je pense qu'il doit reprendre la prière, ainsi que pour ceux qui ont prié avec lui, même si ces derniers ont prononcé le takbir, ils doivent le refaire». Chapitre V De la récitation du Coran aux prières du coucher du ciel et du soir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 170,
			"arabicnumber": 170,
			"text": "Mouhammad Ibn Joubair Ibn Moutém a rapporté d'après son père qu'il a entendu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) réciter à la prière du coucher du soleil la sourate: «Par le Mont» (Coran L II)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 171,
			"arabicnumber": 171,
			"text": "Abdallah Ibn Abbas a rapporté que Oum Al- Fadl bint Al-Hareth, l'ayant entendu réciter la sourate «Les envoyés» (Coran L XXVII), lui dit: «O mon fils! ta récitation m'a rappelée celle de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) car cette sourate était ce que je l'ai dernièrement entendu réciter, à la prière du coucher du soleil»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 172,
			"arabicnumber": 172,
			"text": "Abou Abdallah Al- Sounabihi a rapporté: «J'arrivai à Médine du temps où Abou Bakr était le calife, et je fis la prière du coucher du soleil avec lui. Il récita dans les deux premières raka'ts la Fatiha et deux courtes sourates de «Al-Moufassal». A la troisième raka't, il se leva, et je m'approchai de lui à tel point que mes vêtements touchèrent les siens; je l'entendis réciter la Fatiha (la mère du livre) puis le verset suivant: «Notre seigneur! ne dévie pas nos cœurs après nous avoir dirigés, accorde- nous une miséricorde venant de toi. Tu es le suprême Donateur» (Coran III, 8)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 173,
			"arabicnumber": 173,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 174,
			"arabicnumber": 174,
			"text": "Albara Ibn Azeb, a rapporté: «J'ai fait la prière du soir avec l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) où il récita la sourate: «Par le figuier et l'olivier» (Coran XCV). Chapitre VI Comment faire la récitation",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 175,
			"arabicnumber": 175,
			"text": "Ali Ibn Abi Taleb a rapporté que «L'Envoyé d'Allah (salallahou alayhi wa salam)r (Sur lui la grâce et la paix d'Allah) a interdit de mettre les vêtements faits en «qassi» (sorte de vêtements en soie), les bagues en or, et de faire la récitation du Coran au cours des inclinaisons»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 176,
			"arabicnumber": 176,
			"text": "Al- Baiadi a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) vint croiser les gens alors qu'ils priaient, tout en élevant la voix, en récitant le Coran, il leur dit: «toute personne priant, se trouve tête à tête avec son Seigneur, pensant au comment s'entretenir avec lui, et que l'un de vous ne hausse pas le ton en récitant, afin de ne pas troubler les autres»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 177,
			"arabicnumber": 177,
			"text": "Anas- Ibn Malek a rapporté: «J'ai prié derrière Abou Bakr, Omar et Osman, et chacun d'eux ne récitait pas «Au nom d'Allah le Miséricordieux le Très Miséricordieux» en débutant la prière",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 178,
			"arabicnumber": 178,
			"text": "Souhail Ibn Malek, a rapporté' d'après son père qu'il a dit:«étant à «Al-Balate», chez Abi Jahm, nous entendions la récitation de Omar Ibn Al-Khattab (quand il priait)»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 179,
			"arabicnumber": 179,
			"text": "Nafe' a rapporté que «quand Abdallah Ibn Omar manquait une raka't au cours d'une prière en commun où l'imam devait réciter le Coran à haute voix, après que l'imam ait fait sa salutation finale, Abdallah complétait tout seul la prière manquante de la prière, en récitant à voix haute»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 180,
			"arabicnumber": 180,
			"text": "Malek a dit: «Yazid Ibn Rouman m'a rapporté: «quand je priais à côté de Nafe' Ibn Joubair Ibn Mout'em, il me faisait signe de lui rappeler les versets du Coran (au cas où il les oubliait)». Chapitre VII De la récitation du Coran à la prière de l'aube",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 181,
			"arabicnumber": 181,
			"text": "Hicham Ibn Ourwa a rapporté d'après son père qu'il a dit:«Abou Bakr Al-Siddiq faisant la prière de l'aurore, récitait la sourate «La Vache», dans les deux raka'ts»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 182,
			"arabicnumber": 182,
			"text": "Abdallah Ibn Amer Ibn Rabia a dit: «J'ai fait la prière de l'aurore derrière Omar Ibn Al-Khattab, au cours de quoi, il récita lentement les deux sourates «Youssouf et «Le pèlerinage». On demanda au rapporteur: «Par Allah! Il devait alors débuter la prière dès l'apparition de l'aube»? Il répondit: «Oui»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 183,
			"arabicnumber": 183,
			"text": "Al-Fourafissa Ibn Omaïr Al-Hanafi a dit: «Je n'ai retenu la sourate «Youssouf», que de par la récitation de Osman Ibn Affan, faite souvent à la prière de l'aube»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 184,
			"arabicnumber": 184,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 185,
			"arabicnumber": 185,
			"text": "Abou Sa'id, l'esclave de Amer Ibn Kouraiz a rapporté: «L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) appela Oubai Ibn Ka'b alors qu'il priait. Achevant sa prière, celui-ci rejoignit l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) qui mit la main sur la sienne, au moment où il voulait quitter la mosquée, en lui disant: «J'espère, avant que tu sortes de la mosquée, te faire connaître une sourate que Allah n'a révélée de pareille ni dans la Tora, ni dans l'Evangile, ni dans le Coran». Et Oubai ajouta: «J'ai ralenti le pas, à l'attente de ce qu'il allait me faire connaître, puis je lui dis: «O Envoyé d'Allah Quelle est cette sourate que tu m'as promis de m'enseigner»? Il me répondit: «Par quoi, tu débutes la prière»? Je récitai alors: «Louange à Allah, Seigneur des mondes», jusqu'à la fin de cette sourate». Il me dit: «Elle est justement cette sourate, car elle comprend les sept versets qu'on répète et aussi le grand Coran qu'on m'a accordé»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 186,
			"arabicnumber": 186,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 187,
			"arabicnumber": 187,
			"text": "Abou Houraira a rapporté qu'il a entendu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dire: «Celui qui prie sans réciter la mère du Coran, sa prière est manquée et n'est plus complète». Le rapporteur dit à Abou Houraira: «II m'arrive parfois de faire la prière derrière l'imam»? Abou Houraira me pinça le bras et répondit: «Ô persan! Récite la pour toi-même, car j'ai entendu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dire: «Allah le Béni et le Très- Haut a dit: «J'ai partagé la prière, entre Mon serviteur et Moi, en deux parties: Une moitié qui m'appartient, et une autre est la sienne» L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) ajouta: «Récitez donc! L'adorateur récite: «Louange à Allah, Seigneur des mondes». Allah le Béni et le Très-Haut dit (le sens): «Mon adorateur M'a loué». L'adorateur récite: «Le Miséricordieux, le Très Miséricordieux», Allah dit (le sens) :«Mon adorateur M'a exalté». L'adorateur récite: «Le Roi du Jour du Jugement». Allah dit: «Mon adorateur M'a glorifié». L'adorateur poursuit:«C'est Toi que nous adorons, c'est Toi dont nous implorons le secours». Allah dit (le sens) «Ce verset est entre Moi et Mon adorateur, et j'accorderai à Mon adorateur ce qu'il demande». L'adorateur récite: «Dirige-nous dans le chemin droit, le chemin de ceux que tu as comblés de bienfaits; non pas le chemin de ceux qui encourent Ta colère ni celui des égarés». Allah dit: «Ceci appartient à Mon adorateur et Je lui accorderai ce qu'il Me demande»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 188,
			"arabicnumber": 188,
			"text": "Hicham Ibn Ourwa a rapporté d'après son père qu'il «récitait en priant derrière l'imam, quand celui-ci ne devait pas réciter à haute voix»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 189,
			"arabicnumber": 189,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 190,
			"arabicnumber": 190,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 191,
			"arabicnumber": 191,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 192,
			"arabicnumber": 192,
			"text": "Abou Houraira a rapporté: «L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) achevant une prière où il a récité à haute voix, il demanda aux fidèles: «l'un de vous, a-t-il récité le Coran avec moi»? Un homme répondit: «Oui, moi, O Envoyé d'Allah». Il lui dit: «Je me suis dit: pourquoi on ne me laisse pas réciter le Coran»? Les hommes, depuis, ont cessé de réciter en même temps avec l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) et cela quand il récitait à haute voix, après cette remarque qu'il leur a faite». Chapitre XI Le fait de dire «Amin» derrière l'imam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 193,
			"arabicnumber": 193,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «quand l'imam dit «Amin», dites Amin car celui qui fait correspondre son «Amin», à celui que disent les anges, ses fautes antérieures lui seront pardonnées». Ibn Chéhab a dit: «L'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) disait «Amin» »",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 194,
			"arabicnumber": 194,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «quand l'imam récite «Non pas, (le chemin) de ceux qui encourent Ta colère ni celui des égarés», dites: «Amin», car celui qui le dit en même temps que les anges, ses fautes lui seront effacées»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 195,
			"arabicnumber": 195,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «quand l'un de vous dit «Amen», et que les anges dans le ciel disent aussi «Amen», en même temps, les fautes de cet homme lui seront effacées»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 196,
			"arabicnumber": 196,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «quand l'imam dit: «Allah écoute ceux qui le louent», dites: «Grand Allah, notre Seigneur, à Toi la louange». Celui dont le dire-ci correspond à celui des anges, ses fautes lui seront effacées». Chapitre XII Comment doit-on s'asseoir pendant la prière",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 197,
			"arabicnumber": 197,
			"text": "Ali Ibn Abdel-Rahman Al Mou'awi a rapporté: «Abdallah Ibn Omar m'a vu me distraire avec des galets, alors que je priais. Ma prière achevée, il m'interdit de faire une chose pareille et me dit: «fais, ce que faisait l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah)». Je lui demandai: «Que faisait l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah)»? Il répondit: «Quand il s'asseyait, au cours de la prière, il mettait sa main droite sur sa cuisse droite eu joignant tous ses doigts sauf l'index, qu'il gardait tout droit, et sa main gauche sur sa cuisse gauche. Voilà, ce que faisait l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah)»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 198,
			"arabicnumber": 198,
			"text": "Abdallah Ibn Dinar a rapporté: «Un homme fit la prière avec Abdallah Ibn Omar, après la quatrième raka't, il s'assit en posant son séant sur ses pieds pliés. La prière terminée, Abdallah Ibn Omar reprocha à l'homme d'avoir ainsi agi. L'homme objecta et dit: «mais, toi tu as fait de pareil»? Il répondit: «Je l'ai fait parce que j'ai mal aux pieds»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 199,
			"arabicnumber": 199,
			"text": "Al Moughira Ibn Hakim a rapporté qu'il a vu Abdallah Ibn Omar s'asseoir sur le devant de ses pieds après la deuxième et la quatrième raka't. Quand il termina la prière, il lui fit une remarque concernant sa posture de s'asseoir». Abdallah lui répondit: «Je sais bien que ce n'est pas de tradition, mais j'ai fait cela, parce que je souffre de mes pieds»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 200,
			"arabicnumber": 200,
			"text": "Abdallah Ibn Abdallah Ibn Omar, a rapporté qu'il a vu Abdallah Ibn Omar s'accroupir, quand il s'asseyait dans la prière. Il poursuivit: «comme je l'imitai alors que j'étais tout jeune, il m'a interdit de le faire en disant: «la bonne tradition de la prière consiste à dresser ton pied droit et à plier la gauche». Je lui répondis: «mais toi, tu fais cela»? Il répliqua: «c'est parce que mes pieds ne peuvent pas me supporter»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 201,
			"arabicnumber": 201,
			"text": "Yahia Ibn Sa'id a rapporté que Al- Kassem Ibn Mouhammad montra aux fidèles la façon de s'asseoir pour témoigner l'unité d'Allah: il dressa son pied droit, plia le gauche, s'assit sur sa hanche gauche, et ne s'asseoit pas sur son pied (gauche). Puis il dit: «Abdallah Ibn Omar m'a montré cela en disant qu'il a vu son père faire de même». Chapitre XIII Du témoignage de l'unité d'Allah pendant la prière",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 202,
			"arabicnumber": 202,
			"text": "Abdel Rahman Ibn Abd Al-Qari a rapporté qu'il a entendu Omar Ibn Al-Khattab, étant en chaire, enseigner les gens sur le faire du témoignage de l'unité d'Allah. Il leur dit: «dites: «les salutations à Allah, les bonnes œuvres à Allah, les bonnes paroles et les prières à Allah. Que la paix soit sur Toi ô Prophète (salallahou alayhi wa salam) ainsi que la Misédicorde d'Allah et ses bénédictions. Que la paix soit sur nous ainsi que sur les saints serviteurs d'Allah. je témoigne qu'il n'y a d'autre divinité que Allah, et je témoigne que Mouhammad est son serviteur et son envoyé». At-tahiyatu lillah, az-zakiyatu lillah, at-tayibatu wa's-salawatu lillah. As-salamu alayka ayyuha'nnabiyyu wa rahmatu'llahi wa barakatuhu. As-salamu alayna wa ala ibadi'llahi s-salihin. Ash-hadu an la ilaha illa 'llah wa ash-hadu anna Muhammadan abduhu wa rasuluh",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 203,
			"arabicnumber": 203,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 204,
			"arabicnumber": 204,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 205,
			"arabicnumber": 205,
			"text": "Al Kassem Ibn Mouhammad a rapporté que Aicha, la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) disait, en témoignant l'Unité d'Allah: «les salutations, les bonnes œuvres, les prières et les bonnes paroles sont à Allah. Je témoigne qu'il n'y a d'autre divinité que Allah, l'Unique, il n'a pas d'associé. Et je t'émoigne que Mouhammad est le serviteur d'Allah et son envoyé. Que la paix soit sur toi ô le Prophète (salallahou alayhi wa salam) ainsi que la Miséricorde d'Allah et ses bénédictions. Que la paix soit sur nous et sur les saints serviteurs d'Allah. Que la paix soit sur vous»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 206,
			"arabicnumber": 206,
			"text": "Malek demanda à Ibn Chéhab et à Nafe', l'esclave de Ibn Omar au sujet d'un homme qui fait la prière en commun avec l'imam, et que celui-ci l'a devancé d'une raka't, doit-il témoigner avec lui, l'Unité d'Allah après la deuxième et la quatrième raka't, sachant qu'il n'a fait que des raka'ts impaires»?. Ils lui répondirent: «qu'il fasse le témoignage avec l'imam». Malek a dit: «C'est bien ce que nous faisons à Médine». Chapitre XIV Du fait qu'un homme relève la tête avant l'imam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 207,
			"arabicnumber": 207,
			"text": "Abou Houraira a dit: «Celui qui relève la tête et l'abaisse avant que l'imam le fasse, son toupet sera dans la main d'un démon». Au sujet d'un homme qui relève la tête après une inclinaison ou une prosternation avant que l'imam le fasse, Malek a dit: «il est de notre tradition que cet homme doit revenir à sa posture d'inclinaison ou de prosternation sans attendre l'imam, car en faisant cela, il aura commis une faute, parce que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «l'imam n'a été institué que pour être suivi, c'est pourquoi ne vous débattez pas à ce sujet». Abou Houraira ajouta: «Celui qui relève la tête et l'abaisse avant que l'imam le fasse, celui-ci a le toupet dans la main du démon». Chapitre XV Ce que doit faire un homme qui par insouciance, fait la salutation après la deuxième raka't",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 208,
			"arabicnumber": 208,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) avait terminé sa prière après avoir fait deux rakat's. Zouliadaine lui dit: «la prière a-t-elle été abrégée, O Envoyé d'Allah ou as-tu oublié de la compléter»? L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) s'adressant aux fidèles, ceux-ci lui affirmèrent les paroles de Zouliadaine». Il se leva, fit les deux raka'ts omises, et fit la salutation finale. Puis il prononça le takbir, se prosterna pour une durée égale même un peu plus long, releva la tête, prononça une deuxième fois le takbir, se prosterna pour une durée égale ou un peu plus longue, puis il releva la tête»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 209,
			"arabicnumber": 209,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 210,
			"arabicnumber": 210,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 211,
			"arabicnumber": 211,
			"text": "Malek a rapporté, d'après Ibn Chéhab, Sa'id Ibn Al-Mous-saiab, et Abou Salama Ibn Abdel-Rahman un hadith analogue». Malek a dit: «toute distraction provoquant l'incomplétude de la prière, la prosternation est à faire avant la salutation finale. Toute distraction provoquant un surplus dans la prière, la prosternation est de même à faire, mais après la salutation finale». Chapitre XVI Du doute de l'incomplétude de la prière et comment la compléter",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 212,
			"arabicnumber": 212,
			"text": "Ata Ibn Yassar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «lorsque l'un de vous, doute dans sa prière, du nombre des raka'ts déjà faites, sont-elles à trois ou à quatre, qu'il fasse une quatrième raka't puis qu'il fasse deux prosternations tout en étant assis, avant la salutation finale. Si cette raka't était la cinquième, ces deux prosternations rendraient les raka'ts à un nombre pair. Et si cette raka't était la quatrième, ces deux prosternations seraient une humiliation du démon»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 213,
			"arabicnumber": 213,
			"text": "Abdallah Ibn Omar disait: «lorsque l'un de vous doute du nombre des raka'ts qu'il a fait, qu'il s'efforce de se rappeler du nombre exact et qu'il prie ce qui est de manque, puis qu'il fasse deux prosternations de distraction, tout en étant assis»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 214,
			"arabicnumber": 214,
			"text": "Ata Ibn Yassar a rapporté: «J'ai demandé Abdallah Ibn Amr Al'-As, et Ka'b Al- Ahbar, au sujet de l'homme qui doute du nombre des raka'ts qu'il a déjà fait, en est-il à trois ou à quatre? Chacun d'eux me répondit: «qu'il fasse une raka't, puis qu'il se prosterne pour deux fois, tout en étant assis»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 215,
			"arabicnumber": 215,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 216,
			"arabicnumber": 216,
			"text": "Abdallah Ibn Bouhaina a rapporté: «L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) nous fit une prière et se leva de la deuxième raka't sans s'asseoir, et les gens firent de même. La prière complétée, nous nous attendions à sa salutation finale, or il fit le takbir, puis deux prosternations. étant assis, avant la salutation finale, puis il salua»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 217,
			"arabicnumber": 217,
			"text": "Abdallah Ibn Bouhaina a rapporté: «L'Envoyé d'Allah (salallahou alayhi wa salam) Sur r lui la grâce et la paix d'Allah nous fit la prière du midi où il se leva après la deuxième raka't sans s'asseoir. Au sujet de l'homme, qui après avoir fait quatre raka'ts, se lève, récite, s'incline et en relevant la tête de l'inclinaison, se rappelle qu'il a fait les quatre raka'ts, Malek a dit: «qu'il revient s'asseoir sans se prosterner, même s'il a fait une seule prosternation, il n'aura pas à faire l'autre. Quand il termine sa prière, qu'il fasse, assis, deux prosternations, après la salutation finale». Chapitre XVIII De ce qui cause la distraction en priant",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 218,
			"arabicnumber": 218,
			"text": "Aicha, la femme du Prophète (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a rapporté: «Abou Jahm Ibn Houzaifa avait présenté à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) une «Khamissa» (sorte de vêtement) qui renferme des dessins; il fit la prière en la portant; complétant sa prière, il dit: «rends cette Khamissa à Abou Jahm, car regardant ses dessins en priant, je faillis être troublé»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 219,
			"arabicnumber": 219,
			"text": "Hicham Ibn Ourwa a rapporté d'après son père que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) porta une Khamissa qui renfermait des dessins, puis il la donna à Abou Jahm, et prit en échange une «Anbijania» (Vêtement de tissu grossier, ne renfermant pas de dessins). Abou Jahm demanda: «Pourquoi fais- tu cela, O Envoyé d'Allah»? Il lui répondit: «je passais le temps, à regarder ses dessins, en priant »",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 220,
			"arabicnumber": 220,
			"text": "Abdallah Ibn Abi Bakr a rapporté: «faisant la prière dans son jardin, Abou Talha Al-Ansari regarda un petit ramier s'envoler devant lui, à la recherche d'une issue. Comme cela plut à Abou Talha, il le suivait de son regard un laps de temps, puis, s'apercevant, qu'il était en prière, il lui est arrive de ne plus se rappeler de nombre des raka'ts qu'il a fait. Il se dit:, «mes biens m'ont causé un certain trouble». Il vient retrouver l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) et lui fit part de ce qu'il lui est arrivé en lui disant à la fin: «je fais de ce jardin une aumône en vue d'Allah, tu peux en disposer»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 221,
			"arabicnumber": 221,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 221
			}
		}
	]
}