{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"36": "Judgements"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1399,
			"arabicnumber": 1399,
			"text": "Oum Salama, la femme du Prophète (Sur lui la grâce et la paix d'Allah) r a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Je suis un être humain. Quand vous me rapportez vous accusations, il se peut que l'un de vous me présente habilement ses arguments, à un tel point que je lui donne raison à quelque chose du bien de son frère. Qu'il ne le prenne donc pas, car effectivement, je ne lui donne qu'un morceau de l'Enfer»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1399
			}
		},
		{
			"hadithnumber": 1400,
			"arabicnumber": 1400,
			"text": "Sa'id Ibn Al-Moussaiab a rapporté qu'un musulman et un juif, disputés entre eux, portèrent leur accusation à Omar Ibn Al-Khattab. Trouvant que le juif avait raison, Omar juga en sa faveur. Ainsi le juif s'écria: «Par Allah, tu as jugé en toute justice», Omar lui donna un coup de fouet, lui disant: «Comment le sais-tu»? Le Juif répondit: «Nous trouvons qu'aucun juge ne donne son jugement en toute justice, sans qu'il ait un ange à sa droite et un à sa gauche, qui le mettent sur la voie droite, lui accordant le succès pour la justice tant qu'il est pour la j ustice. Mais, s'il laisse la justice, ils l'abandonnent et retournent au ciel». Chapitre II Au sujet des témoignages",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1400
			}
		},
		{
			"hadithnumber": 1401,
			"arabicnumber": 1401,
			"text": "Zaid Ibn Khaled Al-Jouhani a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Ne vous ai-je pas dit, qui est le meilleur martyr? Il est celui qui présente son témoignage avant qu'on le lui demande, ou encore celui qui déclare son témoignage avant qu'on le lui demande»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1401
			}
		},
		{
			"hadithnumber": 1402,
			"arabicnumber": 1402,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1402
			}
		},
		{
			"hadithnumber": 1403,
			"arabicnumber": 1403,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1403
			}
		},
		{
			"hadithnumber": 1404,
			"arabicnumber": 1404,
			"text": "Rabi'a Ibn Abi Abdul-Rahman a rapporté qu'un homme de l'Iraq vint auprès de Omar Ibn Al-Khattab et lui dit: «Je viens te voir pour une question qui n'a pas ni début ni fin»; Omar lui répondit: «Quelle est cette question»? L'homme de répondre: «Les faux témoignages qui sont présents dans notre pays». Omar lui demanda: «Est-ce que c'est vraiment ainsi»? - Oui, répondit l'homme. Alors Omar s'écria: «Par Allah! Nul homme n'est détenu dans un pays de l'Islam, sans le témoignage des hommes justes». j (......) 5 - On rapporta à Malek que Omar Ibn Al-Khattab a dit: «Le témoignage d'un adversaire et d'un accusé, n'est pas admis». Chapitre III Le témoignage de celui qui a subi une peine prescrite - On rapporta à Malek qu'on demanda à Soulaiman Ibn Yassar et à d'autres, au sujet d'un homme, qui ayant subi une peine de flagellation, peut-on accepter son témoignage? Ils répondirent: «Oui s'il a fait preuve de repentir». (......) 6 - Malek a rapporté, qu'en posant la même question à Ibn Chéhab, il répondit pareillement à Soulaiman Ibn Yassar». Malek a dit: «Et telle est la règle suivie à Médine, et il est des paroles d'Allah Béni et Très Haut (le sens): «Frappez de quatre-vingts coups de fouet ceux qui accusent les femmes honnêtes sans pouvoir désigner quatre témoins; et n'acceptez plus jamais leur témoignage; voilà ceux qui sont pervers à l'exception de ceux qui, à la suite de cela, se repentent et se réforment. Allah est en vérité Celui qui pardonne, Il est miséricordieux» (Coran XXIV, 4,5). Malek a encore dit: «Ainsi, ce qui est incontestable, à Médine, c'est que celui qui, a subi une peine de flagellation, et après il s'est repenti et réformé, son témoignage sera admis. Et c'est ce que j'ai de mieux entendu à ce, sujet». Chapitre IV Le sujet du jugement basé sur le serment d'un témoin",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1404
			}
		},
		{
			"hadithnumber": 1405,
			"arabicnumber": 1405,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1405
			}
		},
		{
			"hadithnumber": 1406,
			"arabicnumber": 1406,
			"text": "Ja'far Ibn Mouhammad a rapporté d'après son père que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a jugé d'après le serment du plaintif et d'un témoin»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1406
			}
		},
		{
			"hadithnumber": 1407,
			"arabicnumber": 1407,
			"text": "Abou Zinad a rapporté que Omar Ibn Abdul Aziz donne l'ordre par écrit à Abdul Hamid Ibn Abdul Rahman Ibn Zaid Ibn Al-Khattab, alors que ce dernier était le gouverneur de Koufa: «Juge d'après le serment du plaintif et d'un témoin»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1407
			}
		},
		{
			"hadithnumber": 1408,
			"arabicnumber": 1408,
			"text": "On rapporta à Malek que Abou Salama Ibn Abdul Rahman et Soulaiman Ibn Yassar ont été interrogé si l'on pouvait juger d'aprés le serment du plaintif et, un témoin»? Ils répondirent: «Oui». * Malek a dit: Le précédent dans la sounna prescrit que l'on juge d'après le serment du plaintif et le témoignage d'un seul homme, ainsi si le plaintif fait un serment avec son témoin, il est confirmé dans son droit. Ainsi, si le plaintif renonce au serment et le refuse, on demande à l'accusé de le faire, si ce dernier fait serment, il est jugé innocent, et s'il refuse de le faire, cela donne complètement raison au plaintif,». * Cependant cette sounna est suivie pour tout ce qui est des biens privés; ce qui n'est pas le cas pour tout ce qui concerne la délimitation (d'une terre), ni le mariage, ni le divorce, ni l'affranchissement, ni le vol, ni la diffamation. Ainsi, si l'on veut dire: «L'affranchissement fait partie des biens, on aura tort, car s'il en est ainsi, l'esclave et son témoin celui-ci étant présent auraient fait un serment, que son maître l'a affranchi. D'autre part si l'esclave avait fait présenté un témoin, qui atteste qu'il est le propriétaire de l'argent, et qu'ils fassent tous deux serment, il aura pleinement son droit, tout comme le cas d'un homme libre». ' * Ainsi, il est de la sounna suivie à Médine, au cas où un esclave présente un témoin, qui atteste qu'il a été affranchi, de porter le maître de cet esclave à faire serment qu'il ne l'a pas affranchi si cela est fait, ce que l'esclave a prétendu être n'est plus considéré». * II en est de même pour la sounna suivie concernant le divorce, ainsi si la femme présente un témoin, attestant grâce à lui, que son mari l'a divorcé , on portera son mari à faire serment qu'il ne l'a pas divorcé; s'il le fait, elle ne sera pas divorcée». * Malek pousuit et dit:\"Il y a une seule sounna, , concernant le divorce et l'affranchissement, soutenus par le témoignage d'un seul homme; le serment sera fait par le mari de la femme, et par le maître de l'esclave, du moment que l'affranchissement est l'une des lois prescrites et on ne tolère pas à ce sujet le témoignage de la femme, car si l'esclave est affranchi, sa personne sera intègre,et sera de ce fait soumis aux mêmes peines prescrites, tout comme un homme libre; s'il commet l'adultère, alors qu'il est marié, il sera lapidé; s'il tue, il sera tué; il a finalement le droit de faire hériter ses successeurs. Si l'on proteste en disant: «Si jamais un homme a affranchi son esclave, et qu'un autre vint, revendiquer au maître de cet esclave, une dette que ce dernier lui doit, de telle manière, qu'il ait pour témoins, qu'il lui doit une dette, un homme et deux femmes. Au cas où l'esclave ne possède aucun bien, et que l'homme insiste de devoir avoir sa dette, le maître sera porté à tenir cette dette en charge afin de la payer, et par conséquent l'affranchissement ne sera plus considéré. Cet homme qui est venu revendiquer sa dette, a cherché à rendre le témoignage des femmes, un témoignage toléré au sujet de l'affranchissement; or leur témoignage ne tient compte que de la question de la dette. Le cas de cet homme est pareil à celui qui, affranchissant son esclave, un homme vient, soutenu par un témoin, jurant réclamer une dette que lui doit cet esclave. S'il se trouve que cette dette est due, l'affranchissement ne sera plus considéré. Ou encore qu'un homme qui, ayant avec le maître d'un esclave un litige financier, vient prétendre qu'il a une dette que le maître de l'esclave doit le lui payer, l'on dira à ce maître: «Jure que tu ne lui dois pas, ce qu'il prétend avoir chez toi»; s'il renonce et refuse de jurer, l'on demandera au plaintif de faire ce serment, qui, par conséquent, en le faisant, met en preuve qu'il a droit à cette dette du maître de l'esclave. Ce qui fait que l'affranchissement de l'esclave n'est plus considéré, si il est prouvé que le maître doit une dette à l'homme en question». - Il en est de même pour le cas d'un homme qui épouse une esclave; devenu sa femme, le maître de cette dernière vient dire à l'homme: «Tu as acheté mon esclave pour tant de dinars»; le mari reniant cela, le maître de l'esclave fait appel à un homme et deux femmes témoignant et justifiant ses paroles. Ainsi la vente est maintenue, le maître aura son droit, la femme esclave sera illicite pour son mari, et se séparera de lui. Le témoignage des femmes, dans le cas d'un divorce, n'est pas admis». - Un autre exemple: Qu'un homme accuse un homme libre d'une calomnie, ce qui fait qu'il finit par être soumis à la peine prescrite. Il appelle un homme et deux femmes témoignant et certifiant ses paroles que l'homme accusé est un esclave. Ainsi, l'homme qui a tissé la calomnie, fuit la peine prescrite. Le témoignage des femmes n'est plus admis concernant la calomnie». - Ce qui est encore pareil à ce cas, où l'on souligne la divergence entre les juges et qui est de la sounna suivie, c'est quand deux femmes témoignent qu'un enfant est né vivant, et de ce fait, il a droit à l'héritage, et léguera par la suite ses biens à ses successeurs. Si le garçon meurt, et que les femmes qui ont été témoins, se trouvent non accompagnées d'un homme, et n'ayant pas fait serment, et que l'héritage en soit une grande fortune constituée d'or, d'argent, de demeures, de jardins, d'esclaves ou d'autres biens encore, par conséquent les deux femmes qui avaient déjà témoigné, d'un dirham ou de plus ou même de moins leur témoignage n'est pas à considérer, si elles ne sont pas soutenues, par un homme témoin et un serment à faire». - Il y en a, parmi les gens, qui disent, qu'un serment fait par un seul homme témoin, n'est pas considéré, justifiant leur protestation, en s'appuyant sur ce qui est dit par Allah Béni et Très Haut (le sens): «Demandez le témoignage de deux témoins parmi vos hommes. Si vous ne trouvez pas deux hommes, choisissez un homme et deux femmes, parmi ceux que vous agréez comme témoins» (Coran II,282). Malek a dit: «si on ne fait pas appel à un homme et deux femmes pour témoigner l'homme plaintif n'aura droit à rien et par conséquent, on ne doit pas lui demander de faire un serment avec son témoin, l'homme plaintif n'aura droit à rien et par conséquent, on ne doit pas lui demander de faire un serment avec son témoin». Il est de l'argument de celui qui a dit ce hadith, de lui dire: «Que penses-tu d'un homme qui prétend avoir une dette d'un autre, ne demandera-t-on pas à ce dernier de jurer qu'il ne doit rien, ainsi la prétention de l'autre sera refusée; S'il renonce à jurer, on demandera au plaintif de faire ce serment, et alors, son droit sera affirmé. D'ailleurs, cela n'est contesté par personne ni non plus dans aucun pays. Cependant, à quel verset du Livre d'Allah, s'est-il référé? S'il veut bien affirmer cela, qu'il le fasse en désignant son témoin qui fera le serment, même si cela n'a pas été mentionné dans le Livre d'Allah. Et, il est suffisant de suivre la tradition qui a été adoptée par nos ancêtres. Mais l'homme veut bien savoir ce qui est juste et ce qui est argumenté. Et, c'est là une explication de ce qui pourra troubler l'esprit, si Allah le veut». Chapitre V Le jugement concernant l'homme qui meurt et laisse une dette à rembourser et une autre dette qui lui esr due et n'ayant à ce sujet qu'un seul témoin (1431) - Malek a dit: «Quand un homme meurt, et qu'on lui doit une dette, et qu'il n'a à ce sujet qu'un seul témoin, et d'autre part qu'il doit aux gens une dette, n'ayant encore là qu'un seul témoin, puis que ses héritiers refusent de faire, avec leur témoin, un serment, de ne pas devoir une telle dette, on demande aux créanciers de faire serment pour récupérer ce qu'ils doivent. Dans ce cas,s'il reste une partie de la succession, les héritiers n'en auront aucun droit car ils ont été appelés à faire un serment et l'ont refusé, sauf qu'ils disent: «Selon nous, notre défunt n'a rien laissé comme héritage», et l'on se rend compte qu'ils ont refusé de faire un serment à cause de cela. Ainsi, à mon avis, ils doivent faire un tel serment et prendre le reste une fois que la dette est payée». Chapitre VI Le jugement concernant un procès",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1408
			}
		},
		{
			"hadithnumber": 1409,
			"arabicnumber": 1409,
			"text": "Malek a rapporté que Jamil Ibn Abdul Rahman Al-Mouezzin partageait avec Omar Ibn Abdul Aziz les séances, où il décidait des controverses entre les gens. Au cas où un homme venait prétendre avoir d'un autre, un droit, Omar tenait la chose en considération; ainsi, s'il trouvait qu'entre eux, il y avait une affaire commune ou de conjecture, il demandait à l'accusé de faire un serment, et s'il trouvait qu'il n'y avait rien de pareil, il ne prenait pas un serment». Malek a dit: «C'est bien ce que nous suivons chez nous (à Médine) à savoir que, au cas où un homme porte accusation contre un autre, il faut considérer les choses ainsi, s'il se trouve entre eux une affaire commune ou de conjecture, on demande à l'accusé de faire un serment; s'il le fait, l'accusation n'est plus considérée, par contre s'il refuse de le faire, déférant le serment au plaintif, et que ce dernier fasse serment, il aura ainsi son droit au complet». Chapitre VII Le jugement fait sur le témoignage des enfants",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1409
			}
		},
		{
			"hadithnumber": 1410,
			"arabicnumber": 1410,
			"text": "Hicham Ibn Ourwa a rapporté que Abdallah Ibn Al-Zouhair tenait en considération le témoignage des enfants, pour les blessures communes entre eux». Malek a dit: «Ce qui est suivi (chez nous) à Médine, c'est que le témoignage des enfants est toléré entre eux, pour des blessures qui leur sont communes, sans que ceci soit toléré pour d'autres. Ainsi, leur témoignage est toléré, pour avoir eu seulement entre eux, des blessures, et cela avant qu'ils ne se séparent, ou qu'on les trompe ou encore qu'on leur enseigne. Ainsi, s'ils se sont séparés, leur témoignage n'est plus considéré, sauf au cas où ils ont déclaré, avant de se séparer, ce dont quoi ils ont été témoins, à des gens justes». Chapitre VIII La violation du serment devant la chaire de l'Envoyé d'Allah (salallahou alayhi wa salam)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1410
			}
		},
		{
			"hadithnumber": 1411,
			"arabicnumber": 1411,
			"text": "Jaber Ibn Abdallah Al-Ansari a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Celui qui, devant ma chaire fera un faux serment aura sa place dans le feu»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1411
			}
		},
		{
			"hadithnumber": 1412,
			"arabicnumber": 1412,
			"text": "Abou Oumama a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Celui qui, faisant un faux serment, réussit à s'emparer du bien d'un musulman, Allah lui interdira d'entrer au Paradis, et l'intégrera à l'Enfer». On lui demanda: «Même s'il s'agit de quelque chose insignifiant, Ô Envoyé d'Allah»? Il répondit: «Même s'il s'agit d'une simple branche d'arak», reprenant cela pour trois fois». Remarque: l'arak, genre d'arbuste, dont on se sert des branches, afin de faire les siwaks, qui servent à se brosser les dents». Chapitre IX Le serment fait devant le minbar (la chaire)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1412
			}
		},
		{
			"hadithnumber": 1413,
			"arabicnumber": 1413,
			"text": "Abou Ghatafan Ibn Tarif Al-Mouri a rapporté: «Zaid Ibn Thabet Al-Ansari et Ibn Muti' s'étaient disputés au sujet d'une maison, ils portèrent leur accusation à Marwan Ibn Al-Hakam, qui était, à ce temps, le gouverneur de Médine. Marwan demanda à Zaid Ibn Tabet de faire un serment devant la chaire, alors Zaid lui répondit: «Je ferai un serment, de ma place». Marwan répondit: «Non, par Allah! Tu ne le feras que devant le siège des juges». Zaid, ne cessa de faire des serments, affirmant par là que son droit est juste, et refusant de le faire devant la chaire, ce qui étonna Marwan Ibn Al-Hakam». Malek a dit: «Je n'envisage pas que quelqu'un fasse un serment devant la chaire, si le sujet est de moins qu'un quart du dinar équivalent à trois dirhams». Chapitre X Ce qui n'est pas toléré dans le désistement des arrhes",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1413
			}
		},
		{
			"hadithnumber": 1414,
			"arabicnumber": 1414,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1414
			}
		},
		{
			"hadithnumber": 1415,
			"arabicnumber": 1415,
			"text": "Sa'id Ibn Al Moussaiab a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r Sur lui la grâce et la paix d'Allah a dit: «Il n'est pas permis d'empêcher le retrait. du gage». - Interprétant cela, Malek a dit: «Je pense, et Allah en est le plus informé, qu'un homme qui a mit en gage chez un autre, quelque chose de plus grande valeur que ce qu'il a emprunté, et que l'emprunteur sur gage dise au bailleur: «Je te remettrais ton droit à telle date, sinon, tu auras ce que j'ai déjà mis en gage». Or, continue Malek: «Ceci n'est ni permis, ni licite; d'ailleurs, c'est ce qui a été interdit même si l'emprunteur s'acquitte après la date échéante, de ce qu'il devait, car il aura toujours le droit de retirer son gage et ce qui a été stipulé est à annuler». Chapitre XI Le jugement fait dans le gage des fruits et des animaux (1438) Yahia a rapporté qu'il a entendu Malek dire au sujet de celui qui donne en gage un jardin pour un délai déterminé, qu'il n'aura pas à faire, des fruits cueillis de ce jardin, avant la date du délai, partie intégrante du gage, sauf si le bailleur le demande. De même, si un homme met en gage une esclave qui est enceinte ou qu'elle le sera après la date du gage, son nouveau-né reste avec elle». - Malek a dit: «On a fait la distinction entre les fruits, et le nouveau-né d'une esclave. A ce sujet, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Celui qui vend des palmiers déjà fécondés, les fruits appartiennent au vendeur, sauf si l'acheteur demande de les avoir». La règle, dit Malek, incontestablement suivie chez nous (à Médine), au sujet de celui qui vend une esclave, ou une femelle des animaux étant enceinte, le nouveau-né revient à l'acheteur s'il demande ou non de l'avoir, cependant les palmiers ne sont pas considérés comme les animaux, ni non plus les fruits comme le fœtus dans le giron de sa mère». Malek interprète ceci comme suit: «Les gens donnent d'habitude en gage les fruits des palmiers et non les palmiers eux-mêmes, mais nulle personne ne met en gage un fœtus tout en étant dans le giron de sa mère, qu'il soit celui d'une esclave ou d'une femelle des animaux». Chapitre XII Le jugement concernant la caution avec des animaux (1439) - Yahia a rapporté qu'il a entendu Malek dire: «Ce qui est incontestablement suivi chez nous (à Médine), au sujet du gage est ce qui suit: «Si ce qui est pris en gage, est une terre ou une demeure ou un animal, pouvant être ravagée ou détruite ou mourir, tout en étant entre les mains d'un bailleur, cette responsabilité revient à l'emprunteur sur gage sans que toutefois le droit du bailleur ne soit diminué de rien. Ainsi, tout gage disparaissant tout en étant en possession du bailleur et qu'on ne peut l'évaluer que selon les dires de celui-ci, son dédommagement est la responsabilité du bailleur qui doit s'en acquitter et à qui l'on dira: «Décris-le, et fais un serment». Tenant en considération ce qui est dit, les gens experts estimeront la valeur; ainsi si la valeur du gage est supérieure à celle qui a été antérieurement fixée, l'emprunteur pourra garder la différence, mais si la valeur en est inférieure, l'on demandera à l'emprunteur de faire serment convenant à l'affirmation des dires du bailleur sans qu'il en soit responsable du dédommagement, tenu pour la différence entre le gage et l'objet donné en substitution. Si l'emprunteur refuse de faire serment, on donnera au bailleur la différence. Si le bailleur, à son tour, ignore la valeur du gage, on demandera à l'emprunteur de faire serment où il donnera la description du gage, récupérant lui-même la différence s'il avance des preuves évidentes». Malek a dit: «Ceci est fait, tant que le bailleur garde en sa possession le gage, sans qu'il l'ait donné à un autre». Chapitre XII Le jugement fait pour un gage existant entre deux hommes (1440) Yahia a rapporté qu'il a entendu Malek dire au sujet d'un gage, qui, se trouve entre deux hommes, l'un d'eux veut alors le vendre, quant à l'autre, il lui avait accordé pour la question de ce gage, le délai d'un an?. Malek a dit: «Si le gage peut être partagé, sans que la part de celui qui avait accordé le délai ne soit diminuée, on vendra la moitié du gage pour lui assurer son droit. Et si l'on risque que sa part ne soit diminuée, l'on vendra tout le gage et l'on donnera à la partie endommagée son dû. Si celui qui avait accordé le délai veut donner pour de bon sa moitié à l'emprunteur, que cela soit fait, autrement l'on demandera au bailleur de faire un serment mettant prouvant que l'autre ne lui avait accordé un délai, que pour pouvoir garder le gage tel quel, et dans ce cas on lui donnera immédiatement son droit». A propos de l'esclave dont le maître le met en gage, alors que l'esclave possède des biens, Malek a dit: «Ces biens ne font pas partie intégrante du gage, sauf si le bailleur l'exige». Chapitre XIV Le jugement concernant les gages en général (1441) - Yahia a rapporté qu'il a entendu Malek dire: «Au sujet de celui qui avance en gage des choses personnelles, qui furent détruites chez le bailleur, mais que le redevable avoue ce qu'il doit en donnant la description de ces choses et sans renier à l'autre son droit.Ils sont en accord sauf pour la valeur du gage ainsi la contestation tiendra sur la valeur, où l'emprunteur dit qu'elle est de vingt dinars, et que le bailleur dit qu'elle est de dix dinars, alors que l'emprunt est de vingt dinars?. Malek a dit: «On dira à celui qui est en possession du gage; «Fais sa description»; s'il le fait, on lui demandera de faire un serment, et par conséquent on appellera les gens experts, pour évaluer le gage en question. Si la valeur se montre supérieure à celle de la valeur réelle du gage, l'on demandera au bailleur de payer à l'emprunteur la différence de ce qu'il a pour droit. Si la valeur est inférieure, le bailleur récupérera la différence de l'emprunteur. Si, finalement la valeur est la même, le gage sera compensé». - D'autre part, au cas où deux hommes se disputent la question d'un gage, de façon que l'emprunteur dit au bailleur: «J'ai avancé ceci en gage, pour dix dinars» et que le bailleur lui répond: «C'est plutôt vingt dinars», en soulignant que le gage est en possession du bailleur, Malek a dit: «On demandera au bailleur de faire un serment où il précisera la valeur du gage ainsi s'il se montre qu'elle est telle sans rien de plus ou de moins, le bailleur reprendra le gage contre cette valeur. Et là, ou lui demandera en premier de faire un serment car le gage est toujours de son appartenance, sauf si l'emprunteur ne s'acquitte de la valeur, dans le but de vouloir reprendre son gage. - Si dans la situation ci-dessus, la valeur du gage se révèle inférieure à vingt dinars, l'on demandera au bailleur de faire un serment assurant ainsi la somme qu'il a fixée, et à l'emprunteur, l'on demandera: «tu paieras la somme fixée par le bailleur, en faisant un serment et tu reprendras ton gage, ou encore, tu feras serment, où tu cherches à assurer la fixation de la somme que tu as déclarée, et par conséquent tu te dispenseras de la différence que le bailleur a désignée. Si l'emprunteur fait tel serment, rien ne lui est d'exigible, sinon, il paiera la somme que le bailleur avait déjà fixée». - Si le gage a disparu, et que le gagiste et l'emprunteur démentissent l'un et l'autre le droit; si celui qui a le droit dit: «J'ai accepté ce gage en versant vingt dinars», et que le redevable lui répond: «tu n'en avais que dix dinars»; puis le bailleur, qui a le droit réplique: «La valeur du gage n'est que de dix dinars», ce à quoi l'emprunteur répond: «Il valait vingt dinars», l'on demandera à celui qui a le droit, de décrire le gage; ainsi s'il le fait, on lui fera prêter serment, puis s'appuyant sur cette description, les gens experts estimeront à leur tour la valeur. Si elle se montre supérieure à celle qui a été estimée par le gagiste, on lui demandera de faire un serment, et par conséquent on donnera à l'emprunteur l'excès du la valeur du gage. Si la valeur se montre inférieure on demandera au gagiste de faire un serment, assurant par là son droit (des vingt dinars), et il cherchera à compenser la valeur, on demandera, à la suite au débiteur de faire un serment assurant par là, que le reste doit revenir au défendeur, une fois que la valeur du gage est prise en considération. Car, celui qui a le gage en sa possession, deviendra par rapport àl'emprunteur, un demandeur, qui faisant un serment, il ne devra rien de ce que le bailleur avait fait serment à propos de l'excès de la valeur du gage. Mais, au cas où il refuse, il devra s'acquitter du droit du bailleur qui est en rapport avec cet excès». Chapitre XV Le jugement au sujet de la location des bêtes si ces dernières causent des dégâts (1442) - Yahia a rapporté qu'il a entendu Malek dire: «Quand un homme loue une monture pour se rendre à un lieu bien déterminé, puis traverse ce lieu à un autre, le propriétaire de la monture aura à choisir: «ou qu'il revendique la location de sa monture pour la distance qui a été traversée en plus et aura de ce fait à encaisser avec elle la première location en reprenant sa monture, ou qu'il revendique le prix de sa monture (proportionnellement à la distance traversée en plus) et la première location si cette location a été faite pour l'aller. Si la location englobe l'aller et le retour, puis que le locataire dépasse le milieu qu'il avait auparavant désigné, le propriétaire de la monture aurait droit à la moitié (de l'excès) de la première location, étant donné que cette location couvre deux trajets: l'aller et le retour. Le locataire ayant dépassé le lieu désigné, n'aura à payer que la moitié de cette location. S'il est fait que sa monture est morte lors de son arrivée au pays désigné, le locataire n'aura aucune garantie à l'égard du propriétaire et ne lui paiera que la location prévue à sa moitié». Telle est la règle suivie quand il s'agit d'une contestation entre le popriétaire d'une monture et son locataire, au sujet de la monture louée par ce dernier». D'autre part, il en est de même pour celui qui prend du propriétaire d'un capital, une somme commandite, de telle façon que ce dernier lui dit: «ne t'achète pas de cette somme ni un animal, ni une marchandise», qu'il lui cite, et qu'il la lui interdit, répugnant que sa somme commandite soit payée pour tel achat. Or, si cet homme qui avait pris l'argent, allait s'acheter, ce dont le propriétaire du capital le lui interdit de faire; voulant par là garantir l'argent, et priver le propriétaire, du bénéfice, si donc, cela est fait, le propriétaire aura à choisir: «ou de partager avec l'autre le bénéfice de la marchandise selon la condition avancée par eux à ce sujet, en lui confiant l'argent ou encore de réavoir son capital étant garanti par l'autre, et de quoi d'ailleurs il en avait abusé». C'est de même pour le cas d'un homme qui demande à un autre de lui acheter une marchandise qui sera à joindre avec les siennes en lui versant une somme, afin qu'il se lui achète une marchandise qu'il la lui désigne. Au cas où l'autre s'achète une marchandise qui n'est pas celle qui lui a été désignée, en abusant de cette confiance, le propriétaire de la somme aura à choisir: «ou qu'il prenne la marchandise que l'autre le lui a achetée, ou qu'il reprenne son argent une fois que le deuxième le lui garantit». Chapitre XVI Le jugement relatif à la femme violée par force",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1415
			}
		},
		{
			"hadithnumber": 1416,
			"arabicnumber": 1416,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1416
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": 1417,
			"text": "Abdul Kari a rapporté qu'un homme vint de la part de Abou Moussa Al-Ach'ari, retrouver Omar Ibn Al-Khattab, qui l'interrogeant à propos des gens, ce à quoi l'homme lui répondit. Puis Omar lui dit: «as-tu des nouvelles de ceux qui sont dans les régions lointaines»? L'homme répondit: «Certainement, un homme a apostasié après avoir été un musulman». Omar reprit: «Qu'avez-vous fait de lui»? L'homme de répondre: «Nous l'avons amené et nous lui avons coupé la tête» ; Omar s'écria: «Ne l'avez-vous pas mis en prison pour trois jours, lui donnant un morceau de pain à manger chaque jour, afin de lui donner la possibilité de revenir à Allah, se repentant et se convertissant de nouveau à l'Islam»? Puis Omar ajouta: «Grand Allah! Je n'étais pas présent à ce meurtre, et je ne l'aurais ni ordonné, ni accepté, si on m'avait fait part de cet événement». Chapitre XIX Le jugement fait au sujet de celui qui trouve sa femme avec un homme",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1417
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": 1418,
			"text": "Abou Houraira a rapporté que Sa'd Ibn Oubada, retrouvant l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui dit: «Que penses-tu, si je trouve un homme avec ma femme; dois-je le laisser afin que je puisse appeler quatre témoins»? L'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) lui répondit: «oui»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1418
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": 1419,
			"text": "Sa'id Ibn Al Moussaiab a rapporté qu'un homme de Syrie, nommé Ibn Khaibari, ayant trouvé avec sa femme, un homme, le tua, ou les tua ensemble. Rapportant ce cas à Mouawia Ibn Abi Soufian, afin qu'il juge là-dessus; Mouawia tombant dans l'embarras, écrivit à Abou Moussa al-Ach'ari, lui demandant d'avoir l'avis de Ali Ibn Abi taleb, à ce sujet. Ali -répondit: «Cet événement n'a pas eu lieu dans mon pays; je te demande de me le raconter; Abou Moussa écrivit à Mouawia Ibn Abi Soufian, à la suite de quoi Ali donna sa proposition en disant: «Je soussigné; moi Abou Al Hassan s'il ne fait pas appel à quatre témoins,qu'il doit payer le prix du sang de la victime». Chapitre XX Le jugement relatif à l'enfant trouvé",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1419
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": 1420,
			"text": "Ibn Chéhab a rapporté que Sounain Ibn Jamila, un homme de Bani Soulaim, a trouvé, au temps de Omar Ibn Al-Khattab, un enfant abandonné. Sounain continue: «Alors je l'ai amené chez Omar Ibn Al-Khattab qui me demanda: «Qu'est-ce qui t'a porté à te charger de cette petite âme» ? Sounain répondit: «Je l'ai trouvée, délaissée, alors je m'en occupais». L'un des conseillers de Omar lui dit: «Ô prince des croyants, c'est un homme vertueux», Omar de sa part répondit: «Le trouves-tu comme tel»? Oui, lui répondit le conseiller; ainsi Omar Ibn Al Khattab déclara: «Quitte donc, il est libre, et tu as le droit de le patronner, quant à nous, nous nous chargerons de ses dépenses». Malek a dit: «Ce qui est suivi à Médine, c'est de considérer l'enfant abandonné, libre, et aux musulmans de le patronner, tout en l'héritant et en payant pour lui, le prix du sang». Chapitre XXI Le jugement concernant l'adoption de l'enfant à son père",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1420
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": 1421,
			"text": "Aicha, la femme du Prophète (Sur lui la grâce et la paix d'Allah) a rapporté: «Outba Ibn Abi Waqas avait confié à son frère Sa'd Ibn Abi Waqas, un enfant, en lui disant: «Le fils de l'esclave de Zam'a est le mien, charges-toi de lui». Aicha continue: «Lorsque ce fut l'an de la conquête, Sa'd prit l'enfant en disant: «Il est le fils de mon frère (neveu) et c'est son père qui me l'a confié». Abd Ibn Zam'a protesta et dit: «Il est plutôt mon frère, et le fils de l'esclave de mon père, né sur son lit». Portant leur accusation à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) Sa'd dit: «Ô Envoyé d'Allah, il est le fils de mon frère, qui me l'a confié», et Abd Ibn Zam'a, de sa part, dit: «Il est mon frère, et est le fils de l'esclave de mon père, né sur son lit»; l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dit: «Il est ton frère à toi, Abd Ibn Zam'a», puis ajouta: «L'enfant revient au maître du lit, par contre l'adultère, doit être lapidé». Finalement s'adressant à Sawda Bint Zam'a, l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dit: «Tu as à te voiler, en sa présence», voyant la ressemblance de l'enfant en question à Outba Ibn Abi Waqas. Et cet enfant n'a jamais vu Sawda, jusqu'à sa mort». ;",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1421
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": 1422,
			"text": "Abdallah Ibn Abi Oumaya a rapporté qu'une femme, ayant perdu son mari, a passé une viduité de quatre mois et dix jours, puis cette période s'étant écoulée, elle se maria avec un homme chez qui, elle demeura pour quatre mois et demi, et mit au monde, un enfant après une grossesse de neuf mois». Son mari se rendit chez Omar Ibn Al-Khattab à qui il fit part de cela; Omar, alors convoqua des femmes âgées, qui furent témoins d'une telle situation à l'époque antéislamique, et leur demanda de le renseigner à ce sujet. L'une d'elles dit: «Moi, je peux te renseigner au sujet de cette femme; son mari mourut alors qu'elle était enceinte, puis elle eu un écoulement du sang, mais son enfant resta stable dans son giron. Aussitôt que son deuxième mari ait eu des rapports avec elle, l'enfant ayant goûté les spermes, se ravifie et grossit». Omar considérant ce qui était avancé par cette femme, sépara entre la femme sujet discuté et son mari, en disant: «On ne m'a rapporté à votre sujet (s'adressant au groupe des femmes) que du bien, puis rattacha l'enfant au premier mari»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1422
			}
		},
		{
			"hadithnumber": 1423,
			"arabicnumber": 1423,
			"text": "Soulaiman Ibn Yassar a rapporté que Omar Ibn Al-Khattab rattachait les enfants nés à l'époque antéislamique, à ceux qui prétendaient être leurs pères au début de l'époque islamique. Deux hommes vinrent, prétendant chacun à son tour, être le père d'un fils qu'une femme a mis au monde. Alors Omar Ibn Al-Khattab convoqua un physionomiste qui allait les examiner tous deux puis dit: «Cet enfant est des deux à la fois» Omar, lui donna un coup de fouet puis convoqua la femme lui disant: «Dis-moi la vérité». Ainsi la femme dit: «L'un de ces deux hommes - et elle en désigna un- se rendait chez moi, alors que je gardais à ce temps là, les chameaux au pâturage il ne se sépara de moi, qu'en étant sûr et moi aussi, quej'étais devenue enceinte. La quittant, elle eut un écoulement de sang, après quoi le deuxième homme l'avait cohabitée, ainsi, elle ignore de ce fait qui des deux en est le père», le physionomiste, à l'écoute, exalta Allah, quant à Omar, s'adressant à l'enfant, lui dit: «A toi de choisir, qui des deux sera ton patron »",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1423
			}
		},
		{
			"hadithnumber": 1424,
			"arabicnumber": 1424,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1424
			}
		},
		{
			"hadithnumber": 1425,
			"arabicnumber": 1425,
			"text": "On rapporta à Malek, que Omar Ibn Al-Khattab ou Osman Ibn Affan, avait jugé le cas d'une esclave, qui invita un homme à l'adultère, en lui disant qu'elle était libre, il se maria avec elle et lui donna plusieurs enfants: «Que l'homme rançonne ses enfants avec ce qui est équivalent». Malek à ce propos, à dit: «Et les rançonner à la valeur de leur prix est plus juste, dans ce cas, si Allah le veut». Chapitre XXII Le jugement relatif au sujet de l'héritage de l'enfant reconnu (1453) -Malek a dit: - Ce que nous suivons chez nous (à Médine), est ce qui s'ensuit: «quand un homme meurt, et que l'un de ses nombreux fils, dise: «Mon père a reconnu tel, être son fils»; cette parenté n'est jamais prise en considération, à partir du témoignage d'une seule personne. D'autre part, celui qui fait une telle reconnaissance, aura à donner de sa part reçue de l'héritage paternel, une part pareille à celui qu'il a reconnu être fils de son père». • Interprétant cela, Malek a dit: «Considérons qu'un homme meurt en laissant deux fils, et une somme de six-cent dinars, où chacun aura trois cent dinars pour part. L'un d'eux, témoignant que son père lui avait, avant sa mort, déclaré que untel est son fils, il devra donner de sa part, cent dinars au fils en question. Une telle somme constitue la moitié de la part de l'enfant reconnu; d'autre part si l'autre frère avait fait le même témoignage, l'enfant devrait avoir encore cent dinars, recevant ainsi sa part complète de l'héritage, et par conséquent sa parenté en serait évidente (soulignons que, l'héritage étant ainsi partagé, chacun aura eu sa part équitable à savoir deux cent dinars). Son cas est similaire à celui d'une femme qui avoue que son père ou son mari, doit une dette, et que les autres héritiers la renient; ainsi, elle devra s'acquitter de cette dette au créancier, proportionnellement à-ce quelle recevra comme part de l'héritage, s'il est fait que la dette reviendra à tous les héritiers: par exemple, si elle hérite le huitième de l'héritage en tant qu'épouse, elle doit s'acquitter du huitième de la dette au créancier; et si elle hérite la moitié en tant que fille unique, elle paiera la moitié de la dette. Telle est la norme que l'on doit appliquer aux femmes reconnaissant la dette». Si encore, un homme avoue pareillement, à la femme, que son père devait une dette quelconque, le créancier est porté à faire un serment avec son témoin, et aura de ce fait toute la dette. Cependant ce cas n'est pas pris au même titre que celui de la femme, du moment que le témoignage de l'homme est toléré; ainsi celui-ci ayant reconnu la dette, l'on demande au créancier de faire un serment avec son témoin, et aura donc tout son droit. Si le créancier reruse de faire ce serment, il aura de l'héritage de celui qui lui a reconnu la dette, une part qui est proportionnelle, à la part revenant au successeur de l'héritage; quant aux autres, ils auraient renié cette dette». Chapitre XXIII Le jugement fait au sujet des mères-esclaves des enfants",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1425
			}
		},
		{
			"hadithnumber": 1426,
			"arabicnumber": 1426,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1426
			}
		},
		{
			"hadithnumber": 1427,
			"arabicnumber": 1427,
			"text": "Ourwa a rapporté d'après son père que l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Celui qui fait la ranimation d'une terre morte, elle sera sa propriété. Par contre celui qui s'approprie unjustement un terrain, en le plantant, ce terrain ne sera jamais sa possession». - Interprétant ce hadith, Malek a dit: «on veut dire par l'appropriation inégale, tout terrain qui a été soit cultivé, soit planté, sans aucun droit»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1427
			}
		},
		{
			"hadithnumber": 1428,
			"arabicnumber": 1428,
			"text": "Abdullah a rapporté que son père Omar Ibn Al-Khattab a dit: «Celui qui ravivifie une terre morte, elle sera sa possession». Malek a dit: «C'est ce qui a été suivi chez nous (à Médine)». Chapitre XXV Le jugement fait au sujet de l'eau",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1428
			}
		},
		{
			"hadithnumber": 1429,
			"arabicnumber": 1429,
			"text": "On rapporta à Abdullah Ibn Abi Bakr Ibn Mouhammad Ibn Amr Ibn Hazm que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Au sujet des canaux d'irrigation de «Mahzouz et Mouzaineb» deux vallées à Médine: «Celui qui possède la partie supérieure de ces deux vallées, retient l'eau au niveau de son terrain (arrosant ainsi son terrain) puis quand elle atteind le niveau des chevilles il la renvoie arroser la partie inférieure». 1459) 31 - Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «On défend de retenir ce qui abonde de l'eau, car ainsi l'on empêchera les herbes, servant de pâturage, de pousser»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1429
			}
		},
		{
			"hadithnumber": 1430,
			"arabicnumber": 1430,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1430
			}
		},
		{
			"hadithnumber": 1431,
			"arabicnumber": 1431,
			"text": "Amra Bint Abdul Rahman a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «On ne doit pas interdire l'abondance de l'eau d'un puits». Chapitre XXVI Du jugement fait pour un service cTintérêt commun",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1431
			}
		},
		{
			"hadithnumber": 1432,
			"arabicnumber": 1432,
			"text": "Amr Ibn Yahia Al-Mazini a rapporté d'après son père que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «On ne doit, ni nuire à quelqu'un, ni répondre à un dégât par un autre»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1432
			}
		},
		{
			"hadithnumber": 1433,
			"arabicnumber": 1433,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Qu'aucun d'entre vous n'interdise à son voisin de planter une poutre dans le mur de sa demeure», puis Abou Houraira ajouta : «Pourquoi, je vois, que vous vous détournez de l'accepter; par Allah, je vous lancerai cette poutre entre vos épaules»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1433
			}
		},
		{
			"hadithnumber": 1434,
			"arabicnumber": 1434,
			"text": "Al-Mazini a rapporté d'après son père que Al-Dahaq Ibn Khalifa avait creusé de «Al-Ouraid» - vallée à Médine - un canal d'irrigation, qu'il voulait faire traverser dans un terrain qui appartenait à Mouhammad Ibn Maslama. Celui-ci le refusant, Al-Dahaq lui dit: «Pourquoi me le refuses-tu, et pourtant tu vas en profiter? tu pourras avoir de l'eau à boire à jamais, et cela ne te nuira pas». Mouhammad le refusant toujours, al-Dahaq l'apprend à Omar Ibn Al-Khattab, qui convoqua Mouhammad Ibn Maslama, et l'ordonna de le permettre à Al-Dahaq. Mais Mouhammad n'acceptant toujours pas, Omar s'écria: «Pourquoi empêches-tu ton frère, de faire ce qui lui est d'utile, et qui l'est encore pour toi: tu arroseras pour toujours, ton terrain de cette eau, et cela, ne te nuira en rien». Mouhammad ayant pour réponse: «non, par Allah», Omar s'écria: «Par Allah, il fera passer ce canal, même sur ton ventre», et ordonna par la suite, à Al-Dahaq de le creuser, ce dernier le fit»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1434
			}
		},
		{
			"hadithnumber": 1435,
			"arabicnumber": 1435,
			"text": "Yahia Al-Mazini a rapporté que son père a dit: «Il y avait dans le jardin de son grand-père, un ruisselet qui appartenait à Abdul-Rahman Ibn Awf. Comme Abdul Rahman voulait détourner le cours de ce ruisselet vers un endroit proche de son terrain, le propriétaire (qui est le grand-père) le lui interdit; alors Abdul Rahman ayant fait apprendre cela à Omar Ibn Al-Khattab, il lui donna le droit de le faire». Chapitre XXVII Le jugement fait au sujet de la répartition des biens",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1435
			}
		},
		{
			"hadithnumber": 1436,
			"arabicnumber": 1436,
			"text": "Thawr Ibn Zaid Al-Dili a dit: «On m'a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «N'importe quelle demeure ou terre qui a été partagée à l'époque anté-islamique, elle sera maintenue telle qu'elle a été partagée. Et n'importe quelle demeure ou terre qui est à partager à l'époque islamique, le sera selon la loi islamique»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1436
			}
		},
		{
			"hadithnumber": 1437,
			"arabicnumber": 1437,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1437
			}
		},
		{
			"hadithnumber": 1438,
			"arabicnumber": 1438,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1438
			}
		},
		{
			"hadithnumber": 1439,
			"arabicnumber": 1439,
			"text": "• Yahia Ibn Abdul-Rahman Ibn Hateb a rapporté que quelques uns de ses esclaves ont volé à un homme de Mouzaina, une chamelle et l'égorgèrent. Le cas fut présenté à Omar, qui ordonna à Kathir Ibn Al-Salt de leur couper les mains. Mais aussitôt Omar se saisit et dit à Hateb: «Ne leur donnes-tu pas suffisamment à manger? Par Allah, continua Omar, je te ferai payer une amende insupportable», puis s'adressant à l'homme: «Quel est le prix de ta chamelle»? Al-Mouzani répondit: «Par Allah, je ne la vendrai pas moins que quatre cent dirhams». Alors Omar dit à Hateb: «Donnes-lui huit cent dirhams». - Malek a dit: «Il ne faut pas croire, que l'on cherchait à Médine, à doubler la valeur; mais c'est ce que les gens suivaient d'habitude; or actuellement, on exige pour amende une valeur égale à celle du prix du chameau ou de l'animal du jour où il a été pris». Chapitre XXIX Le jugement fait au sujet de celui qui cause du mal aux bêtes (1469) - Malek a dit: «Ce qui est suivi chez nous (à Médine), au cas où quelqu'un a causé du mal à une bête, c'est qu'il paiera un prix, compensent celui qui allait être soustrait du prix réel de la bête qui a ainsi perdu de sa valeur». - Dans cas où un chameau, se jette sur un homme de telle façon que celui-ci effrayé, le tue ou le mutile, Malek a dit: «Si cet homme était pleinement sûr du danger, il ne lui revient rien à payer comme compensation; par contre si Ton ne tient pour argument que ce qui est de son dire, il doit indemniser le propriétaire de ce chameau». Chapitre XXX Le jugement relatif au salaire des ouvriers (1470) - Malek a dit: «Celui qui donne son vêtement au blanchisseur pour lui changer sa couleur, après quoi il vient dire à ce dernier: je ne t'ai pas ordonné de le faire, et que l'autre lui répond: en fait, c'est toi qui m'a ordonné de le faire», l'on doit dans ce cas, admettre ce qui est des paroles du blanchisseur, et il en est de même, quand il s'agit d'un couturier et d'un bijoutier où ils sont portés à faire un serment à ce sujet, sauf s'ils allaient faire autre ce qu'on leur a demandé de faire; ainsi, l'on ne pourra plus les croire et l'on demandera à celui qui possède le vêtement de faire un serment. Si, celui-ci refuse de le faire, l'on demande au teinturier de le faire. - Malek aussi a dît: «Si le teinturier, à qui l'on a donné le vêtement, se trompe à savoir qu'il le donne à un autre homme qui n'est pas son possesseur et qu'il le mette, on n'exige rien de cet homme mais il revient au teinturier de payer une indemnité au prossesseur du vêtement, étant donné que celui qui a mis le vêtemenent ignorait qu'il n'était pas le sien; par contre, s'il savait bien que ce vêtement n'était pas le sien, il doit le garantir». ChapitreXXXI Le jugement fait au sujet du garant et de celui qui prend en charge une créance (1471) - Malek a dit: «Au cas où un homme ayant une dette, la fait porter en charge à un autre qui lui soit créancier; si ce dernier fait faillite ou meurt sans avoir payé la dette, on n'exige rien du débiteur et le créancier n'a pas le droit de revenir sur lui pour récupérer sa dette. Telle est la règle incontestable suivie chez nous à Médine. - Malek a aussi dit: «Quand un homme prend en charge une dette qu'il paiera pour un autre et qu'il décède ou fasse faillite, le créancier a le droit de revenir sur le débiteur pour régler sa dette». Chapitre X XXII Le jugement fait au sujet de celui qui s'achète un vêtement ayant un défaut (1472) - Malek a dit: «Celui qui achète un vêtement ayant un défaut telle une brûlure ou autre, que le vendeur connait et a confirmé, et que celui qui l'a acheté, l'ait déchiré, de telle façon que cette déchirure a fait diminué le prix du vêtement, après quoi l'acheteur s'est aperçu du défaut original, le vêtement peut être rendu au vendeur, sans que pour autant l'acheteur n'ait rien à payer pour avoir déchiré ce vêtement». - Malek a aussi dit: «Si un homme achète un vêtement ayant un défaut telle une brûlure ou un trou, qu'il cherche à découper ou à teindre, et le vendeur dit qu'il ignorait que le vêtement était ainsi, l'acheteur peut opter entre le fait ou de garder le vêtement après que le vendeur ait accepté de diminuer son prix à cause du défaut, ou encore de rendre le vêtement au vendeur en lui payant l'indemnité du découpage ou de la teinture. Cependant, si l'acheteur a fait teindre le vêtement de telle façon qu'il est devenu plus cher, il aura encore là à choisir: ou qu'il demande du vendeur un prix compensant le défaut du vêtement, ou d'être partenaire du vendeur pour la question du vêtement. Ensuite, l'on fait estimer le vêtement inclus la brûlure ou le trou; ainsi si le prix est de dix dirhams, et que la teinture du vêtement en soit de cinq, le vendeur et l'acheteur sont tous deux partenaires du vêtement, où chacun aura une part qui sera proportionnelle soit au prix initial du vêtement, soit aux frais payés pour la teinture». Chapitre XXXIII Ce qui n'est pas permis en donnant des présents",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1439
			}
		},
		{
			"hadithnumber": 1440,
			"arabicnumber": 1440,
			"text": "Aicha, la femme du Prophète (Sur lui la grâce et la paix d'Allah) a rapporté que son père Abou Bakr Al-Siddiq avait fait à son égard, un don de vingt wasqs de dattes, étant de sa propriété à «Al-Ghaba». A sa mort, il dit: «Par Allah, ma fille, je n'aimerai voir après moi, quelqu'un de plus riche, que toi, et il m'est insupportable que tu sois plus pauvre que les autres, ainsi je t'ai fait un don de vingt wasqs de dattes, qui si tu les avais cueillies personnellement, elles te seraient une donation; mais à présent, étant considérées comme un héritage, tu auras à les partager avec tes deux frères et sœurs, selon ce qui est prescrit dans le Livre d'Allah». Aicha lui demanda: «Père, si c'était tel, par Allah, je l'aurais abandonné. Cependant, je n'ai que Asma pour sœur, qui en est donc l'autre»? Il lui répondit: «C'est la fille que porte Bint Kharija (l'épouse du frère d'Abou Bakr des Ansars) dedans son giron, et je la considère comme telle (il sous-entend que cette fille sera la sœur de Aicha)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1440
			}
		},
		{
			"hadithnumber": 1441,
			"arabicnumber": 1441,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1441
			}
		},
		{
			"hadithnumber": 1442,
			"arabicnumber": 1442,
			"text": "Abdul Rahman Ibn abdul Qari a rapporté que Omar Ibn Al-Khattab a dit: «Qu'arrive-t-il aux hommes de faire dons à leurs fils, puis de retenirces dons avec eux. Ainsi, si l'un d'eux a un fils qui meurt, il dit: «Mes biens sont toujours à ma portée, je ne les ai donnés à personne». Mais aussitôt qu'il sent la mort s'approcher il dit: «Cela est un don que j'avais fait à mon fils». «Or, celui qui décide de faire un don, et qu'il ne l'avance pas à celui, à qui il l'a destiné, préférant le garder comme héritage à ses successeurs, ce don devient illicite». Chapitre XXXIV De ce qu'on interdit comme don (1476) - Malek a dit: «Ce que l'on suit chez nous, (à Médine), au sujet de celui qui fait un don à quelqu'un, ne visant pas avoir un autre en échange, le faisant aussi en présence de témoins, que ce don, est déjà assuré à la personne destinée, sauf au cas où celui qui a fait le don, ne meurt, avant qu'il ne l'ai effectivement donné à l'autre. D'autre part, si le donateur veut retenir son don, après qu'il ait fait à son sujet, un témoignage, cela lui est interdit; ainsi, si celui à qui revient le don, le réclame, il doit l'avoir». - Malek aussi dit: «Celui qui fait un certain don, après quoi il le renie, puis que celui qui devait profiter de ce don, amène un témoin, lui assurant que l'autre lui avait effectivement fait un don, à savoir que cela soit une marchandise, d'or, d'argent ou d'un animal, l'on portera celui qui devait profiter et son témoin à faire un serment à ce sujet. S'ils le refusent, l'on demandera au donateur de le faire, si celui-ci encore le refuse, il donnera à l'autre ce qu'il prétend, par droit, avoir, surtout s'il a un seul témoin; si ce dernier n'est pas présent, le donateur n'aura rien à avancer». - Malek a finalement dit: «Celui qui fait un don, sans vouloir avoir quelque chose en échange, et que le bénéficiaire meurt, les héritiers de ce dernier, profiteront de ce don; et si le bénéficiaire meurt avant d'avoir eu son don, il n'aura rien dans ce cas, car le don n'était pas encore de sa possession. Ainsi, si le donateur veut le garder ayant eu au sujet de son don, un témoin prouvant qu'il l'avait fait, le bénéficiaire pourra, l'avoir, s'il le demande». Chapitre XXXV Le jugement fait au sujet des dons",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1442
			}
		},
		{
			"hadithnumber": 1443,
			"arabicnumber": 1443,
			"text": "Abou Ghatfan Ibn Tarif Al Mourri a rapporté que Omar Ibn Al-Khattab a dit: «Celui qui, à un proche parent, fait un don, ou même une aumône, ne doit plus le retenir. Et celui qui fait un don, voulant par là, obtenir un autre en échange, peut garder son don, revenir même sur ce don, s'il n'est pas satisfait de ce qu'il devrait avoir en échange». - Malek a dit: «Ce qui est suivi chez nous (à Médine) au sujet de la réception d'un don, qui subit une transformation de plus ou de moins, que le donataire voulant faire un échange, aura à considérer la valeur de ce don juste à sa livraison». Chapitre XXXVI Le fait de reprendre l'aumône (1478) - Malek a dit: «Ce qui est incontestablement suivi chez nous (à Médine), quand une personne qui a fait à son fils une aumône qu'il a déjà prise, ou qui est resté à la garde de père, et qui a fait, au sujet de cette aumône un témoignage, le père n'aura plus le droit de retenir cette aumône, ni partiellement ni totalement». - Malek a dit encore: «Celui qui fait un don qui n'est pas une aumône à son fils, , a le droit de retenir ce don tant que le fils n'a pas utilisé ce don pour prendre une dette auprés des gens de sorte qu'il devienne débiteur; ainsi, dans ce cas là le père ne pourra pas retenir ce don pour laisser son fils incapable de s'acquitter de sa dette. Par conséquent, le père n'a pas le droit de retenir son don dans les cas qui s'ensuivent: Que le père donne son fils, ou sa fille en mariage, de telle façon que la fille n'épouse l'homme ou que l'homme n'épouse la fille que pour être riche et pour l'argent que son père lui avait donné. Ou encore que l'homme épouse la femme à qui son père avait fait don, lui assurant par là une grande dot due à sa richesse et à ses biens, et à ce que son père lui avait donné». Chapitre XXXVII Le jugement fait au sujet de la \"Oumra\" N.B. La \"Oumra\": il s'agit du fait que quelqu'un dise à un autre: «Je te donnerai cette demeure où tu pourras rester, tant que tu es vivant». A la mort de celui qui dispose de cette demeure, la demeure doit revenir à son propriétaire s'il est toujours en vie; sinon les héritiers de celui qui vivait dans la demeure, pourront en profiter»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1443
			}
		},
		{
			"hadithnumber": 1444,
			"arabicnumber": 1444,
			"text": "Abdul Rahman Ibn Al-Kassem a rapporté qu'il a entendu Makhoul Al-Dimachki demander Al-Kassem Ibn Mouhammad au sujet de la «Oumra», et ce que disent les gens à ce propos»? Al-Kassem Ibn Mouhammad répondit: «Les gens ne cessent de se lier à leurs promesses de tout temps suivies, au sujet de leurs biens et de ce qu'ils reçoivent». - Malek a dit: «Ce que nous, suivons chez nous (à Médine), concernant la Oumra, c'est qu'elle doit revenir à son propriétaire à la mort du donataire sauf s'il a dit à ce dernier: «Elle revient à toi et à tes héritiers»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1444
			}
		},
		{
			"hadithnumber": 1445,
			"arabicnumber": 1445,
			"text": "Nafe' a rapporté que Abdallah Ibn Omar avait hérité de Hafsa Bint Omar, sa demeure. Or, cette dernière, avait fait loger dans cette demeure, la fille de Zaid Ibn Al-Khattab, tant qu'elle était vivante; mais quand elle décéda, la demeure revint à Abdallah Ibn Omar, qu'il considèrait être la sienne». Chapitre XXXVffl Le jugement au sujet de ce qui est trouvé",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1445
			}
		},
		{
			"hadithnumber": 1446,
			"arabicnumber": 1446,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1446
			}
		},
		{
			"hadithnumber": 1447,
			"arabicnumber": 1447,
			"text": "Mou'awia Ibn Abdallah Ibn Badr Al-Jouhani a rapporté que son père lui a raconté, qu'en route pour le Châm (la Syrie),il s'arreta chez des gens et il trouva une bourse contenant quatre vingt dinars. Le racontant à Omar Ibn Al-Khattab, il lui dit: «Annonce ; cette trouvaille dans les mosquées, et à toute personne qui arrive du Châm (Damas), pour un an; si déjà cette durée s'est écoulée, elle te reviendra»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1447
			}
		},
		{
			"hadithnumber": 1448,
			"arabicnumber": 1448,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1448
			}
		},
		{
			"hadithnumber": 1449,
			"arabicnumber": 1449,
			"text": "Soulaiman Ibn Yassar a rapporté que Thabet Ibn Al-Dahhaq Al-Ansari lui a raconté qu'il trouva un chameau égaré à «Al-Harra», il le retint puis rapporta cela à Omar Ibn Al-Khattab qui l'ordonna de faire annonce au sujet du chameau, par trois fois. Or Thabet lui dit: «Ce chameau m'a fait négliger mes propriétés», Omar lui dit: «Laisse-le là ou tu l'as trouvé»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1449
			}
		},
		{
			"hadithnumber": 1450,
			"arabicnumber": 1450,
			"text": "Sa'id Ibn Al Moussaisab a rapporté que Omar Ibn Al-Khattab, tout en ayant le dos appuyé au mur de la Ka'ba, a dit: «Celui qui garde un animal égaré, a déjà commis un péché»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1450
			}
		},
		{
			"hadithnumber": 1451,
			"arabicnumber": 1451,
			"text": "Malek a rapporté qu'il a entendu Ibn Chéhab dire: «Les animaux égarés, étaient, du temps de Omar Ibn Al-Khattab, considérés comme appartenant à leur propriétaire, et du fait même, ils se copulaient, sans que personne ne pense à les retenir. Mais, lorsque ce fut le temps de Osman Ibn Affan, il ordonna de faire annonce à leur sujet puis de les vendre; ainsi, si leur propriétaire se présentait, on lui versait leur prix de vente». Chapitre XLI L'aumône faite de la part du vivant pour un mort",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1451
			}
		},
		{
			"hadithnumber": 1452,
			"arabicnumber": 1452,
			"text": "Le grand-père de Sa'id Ibn Amr Ibn Chourhabil Ibn Sa'id Ibn Sa'd Ibn Oubada a rapporté: «Sa'd Ibn Oubada, partit avec l'Envoyé d'Allah r (Sur lui la grâce et la paix d'Allah) pour une expédition, et sa mère était sur le point de mourir à Médine, on lui dit: «Fais ton testament». Elle répondit: «Pourquoi faire ce testament; tous les biens que je possède reviennent à Sa'd»; puis elle décéda, avant que Sa'd ne soit présent à Médine, on lui fit part de ce qui eut lieu, Sa'd dit à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah): «Ô Envoyé d'Allah, sera-t-elle récompensée si je fais en son nom, une aumône»? L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) répondit: «Oui, certainement». Alors Sa'd dit: «Tel jardin, (qu'il désigna), est une aumône»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1452
			}
		},
		{
			"hadithnumber": 1453,
			"arabicnumber": 1453,
			"text": "Aicha, la femme du Prophète (Sur lui la grâce et la paix d'Allah) a rapporté qu'un homme vint dire à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah): «Ô Envoyé d'Allah ma mère est morte subitement, et je crois qu'elle voulait me dire de faire l'aumône pour elle; pourrai-je le faire»? L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui répondit: «Oui, certainement»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1453
			}
		},
		{
			"hadithnumber": 1454,
			"arabicnumber": 1454,
			"text": "On rapporta à Malek qu'un homme des Ansars, de la tribu de Al-Hareth Ibn Al-Khazraj , fit à ses parents, une aumône. Ses parents étant décédés, le fils hérita tous leurs biens qui étaient des palmeraies. Alors, il interrogea à ce sujet l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) qui lui répondit: «Tu as fait l'aumône à tes parents,et tu en as déjà eu une récompense; quant à l'héritage, il est ton acquisition». MOUATTAA Au Nom d’Allah Le Clément Le Miséricordieux Livre 37 Le Livre du testament Chapitre Premier L'ordre de faire un testament",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1454
			}
		}
	]
}