{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1552,
			"arabicnumber": 1552,
			"text": "Mouhammad Ibn Amr Ibn Hazm a rapporté d'après son père que dans la lettre écrite par l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), et envoyée à Amr, on souligne ce qui suit: «Pour un homme assommé, le prix du sang est de cent chameaux, et il en est de même pour un nez entièrement amputé; pour une blessure à la tête influant sur le cerveau, le tiers de la dyia, et de même pour un ventre attaqué; pour l'œil, la main, et le pied, chacun est de cinquante chameaux; pour tout doigt amputé, dix chameaux; quant à la dent arrachée et à la blessure atteignant l'os, chacun est de cinq chameaux». Chapitre II La mise en pratique du prix du sang",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1552
			}
		},
		{
			"hadithnumber": 1553,
			"arabicnumber": 1553,
			"text": "On rapporta à Malek que Omar Ibn Al-Khattab a évalué pour les habitants des villages, le prix du sang à mille dinars en or, ou à douze mille dirhams d'argent, et cela, suivant le fonds courant». - Malek, expliquant ceci dit: «Le fonds courant en Syrie et en Egypte, c'est l'or; et en Iraq, c'est l'argent». (......) 3 - Malek a entendu dire que le prix du sang est à payer au cours de trois ou quatre ans. - Et Malek de poursuivre: «Et il m'est préférable, qu'il soit payé au cours de trois ans». - Finalement Malek a dit: «Ce qui est suivi chez nous (à Médine), c'est de ne pas admettre des habitants des villages, comme prix du sang, les chameaux; ni des bédouins, or ou argent; ni de ceux qui possèdent de l'or, l'argent et réciproquement». (1) Notons que cette expression, sera, tout le long de ce chapitre, prise pour désigner «le meurtre»; quant au terme «dyia», mot d'origine arabe, il sera pris au sens de «la compensation légale» versée à titre d'une compensation pour un délit commis. Chapitre III Le prix du sang payé pour un crime volontaire et du crime commis par un fou",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1553
			}
		},
		{
			"hadithnumber": 1554,
			"arabicnumber": 1554,
			"text": "Malek a rapporté qu'Ibn Chéhab disait: «au cas où le prix du sang payé pour un crime prémédité est admis, il est de vingt-cinq chamelles d'un an révolu, de vingt-cinq chamelles de deux ans révolus, de vingt-cinq chamelles de trois ans révolus, et de vingt-cinq chamelles de quatre ans révolus»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1554
			}
		},
		{
			"hadithnumber": 1555,
			"arabicnumber": 1555,
			"text": "Yahia Ibn Sa'id a rapporté que Marwan Ibn Al-Hakkam écrivit à Mou'awia Ibn Abi Soufian, lui demandant son avis au sujet, d'un homme fou qui a tué un autre. Mou'awia lui répondit par écrit: «impose-lui le prix du sang sans le tuer, car l'on ne soumet pas un fou à la peine prescrite». - Malek a dit: «A propos de deux hommes, dont l'un est adulte et l'autre benjamin, et qui tuent ensemble, d'une façon préméditée un homme, c'est à l'adulte d'être tué, et au benjamin de payer la moitié du prix du sang. - Finalement Malek a dit: «Il en est de même pour le cas où deux hommes, l'un libre et l'autre esclave, tuent ensemble un esclave; c'est l'esclave qui sera tué, quant à l'homme libre, il aura à payer la moitié du prix du sang». Chapitre IV Le prix du sang payé pour un crime involontaire",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1555
			}
		},
		{
			"hadithnumber": 1556,
			"arabicnumber": 1556,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1556
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": 1557,
			"text": "Irak Ibn Malek et Soulaiman Ibn Yassar ont rapporté qu'un homme de Bani Sa'd Ibn Laith, faisait courir un cheval, celui-ci écrasa le doigt d'un homme de Jouhaina, qui eut une saignement, et finit par mourir. Omar Ibn Al-Khattab dit aux accusés: «Juriez-vous pour cinquante fois au nom d'Allah, que l'homme n'est pas mort à cause de cette blessure»? Ils refusèrent et s'empécherent de faire cela, et de sa part Omar s'adressant aux autres, leur demandant aussi, de jurer, et ils refusèrent, il exiga que les premiers à savoir les partisans de Sa'd, payent la moitié du prix du sang à la victime». - Malek a dit: «ceci n'était pas suivi chez nous (à Médine)». (......) 7 - Malek a rapporté que Ibn Chéhab, Souleiman Ibn Yassar et Rabi'a Ibn Abi Abdul Rahman, disaient: «Le prix du sang pour un crime involontairement commis est de vingt chamelles d'un an révolu, vingt chamelles de deux ans révolus, vingt chameaux de deux ans révolus, vingt chamelles de trois ans révolus, et vingt chamelles de quatre ans révolus». - Malek a dit aussi: «ce qui est suivi chez nous (à Médine), c'est de ne pas soumettre les jeunes adolescents à la peine prescrite, même s'ils ont volontairement commis un crime, sauf s'ils sont pubères. Ainsi, un homicide commis par un garçon n'est pas tenu pour volontaire, étant donné, que si un garçon et un homme adulte ont tous deux involontairement assommé un homme libre, il incombe à la \"a'quila\" de chacun d'eux, de verser la moitié du prix du sang». (1) «la a'qila» constitue l'ensemble des mâles unis par le lien légitime de parenté à savoir «agnat», héritant le mort qui peut être ou le père, ou l'oncle, on le frère, ou le grand-père.... - Malek a finalement dit: «Celui qui assomme involontairement, il versera le prix du sang sans qu'il soit soumis à la peine corporelle, car le prix en question payé pour la victime est tout comme ce qu'il a de biens à partir de quoi il peut s'acquitter d'une dette ou même de faire un legs. Ainsi, s'il a des biens, le prix du sang à payer en sera le tiers, et ainsi il est exempt de la diya, encore que ceci lui est toléré. Et s'il n'a pas des biens, sauf ce qui est du prix du sang, aussi ceci lui est toléré de prélever le tiers pour en faire un legs et une exemption si les parents de la victime lui pardonne. Chapitre V Le prix du sang convenable aux blessures causées involontairement;",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1557
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "Malek a dit: «Ce qui est suivi chez nous (à Médine), concernant les blessures causées involontairement, c'est que le prix du sang n'est à verser, qu'une fois que le blessé a guéri. Encore, s'il s'agit d'une fracture à la main ou au pied, ou autre membre du corps de l'homme, involontairement causée, puis qu'elle soit guérie, reprenant son état initial, il n'y a pas un prix à payer, mais si cette plaie a causé une déformation ou un enlaidissement, le prix du sang qui est à verser doit être proportionnel à ce qui a été déformé et enlaidi». - Et Malek de poursuivre: «S'il s'agit d'une fracture des os, dont le Prophète r (Sur lui la grâce et la paix d'Allah) avait précisé le prix du sang qui lui est convenable, cela doit être conforme aux prescriptions du Prophète; mais s'il est fait que le Prophète (Sur lui la grâce et la paix d'Allah) n'a pas précisé le prix du sang, et qu'il n'y ait à ce sujet ni une sounna, ni un prix fixe, l'on essaie de donner une sentence convenable». - Malek aussi a dit: «les cicatrices causées par erreur, au corps involontairement, n'exigent pas un prix du sang, si la cicatrice devient saine, reprenant son état initial. Mais, si la citratrice laisse une déformation ou un enlaidissement, on estisme ce qui lui est de convenable comme diya, sauf s'il s'agit d'une «jaifa», qui exige que la dyia en soit le tiers de celle d'un meurtre. Il n'y a pas non plus, continue Malek, une dyia pour le cas d'une «mounakkila»^ qui est tout comme «la moudiha»^. - Malek a finalement dit: «Ce qui est suivi chez nous (à Médine), au cas où un médecin en circoncisant fait couper le gland du pénis, c'est que ceci lui impose une dyia. Et ceci est une des erreurs que doit assumer la'aqila dans ses responsabilités. Il en est de même pour toute erreur commise par un médecin, ou encore qu'il dépasse ses fonctions, sans qu'il le veuille; s'il en est tel, la dyia est exigible». Chapitre VI Le prix du sang de la femme",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1558
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": 1559,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1559
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "Yahia ibn Sa'id a rapporté que Sa'id Ibn Al Moussaiab disait:«Le prix du sang de la femme est du tiers de celui d'un homme, mais la dyia est la même s'il s'agit d'un doigt amputé ou une dent cassée, ou encore des mêmes blessures dites moudiha et mounakkila». (......) 10 - Malek a rapporté que Ibn Chéhab et Ourwa Ibn al Zoubair disaient pareillement à Sa'id Ibn Al Moussaiab au sujet du prix du sang d'une femme, à savoir qu'il est du tiers de celui de l'homme. Et si ce prix atteint déjà le tiers, la dyia sera de la moitié de celle de l'homme». Interprétant ceci, Malek a dit: «Ainsi pour les blessures dites la «moudiha» et la «mounakkila», la dyia est la même que celle de l'homme; mais pour ce qui est de la «jaifa» et la «ma'mouma» , et autres blessures pareilles, soumises au tiers du prix du sang, la dyia de la femme sera la moitié de celle de l'homme». (......) 11 - Malek a rapporté qu'il a entendu Ibn Chéhab dire: «Il est de la sounna qu'un homme causant une blessure à sa femme, qu'il lui paie la dyia convenable à cette blessure, sans qu'il soit soumis à la peine prescrite». - Malek aussi a dit: «Or il en est tel au cas où cette blessure est involontairement causée par l'homme, en frappant sa femme avec un fouet et en lui crevant un œil par exemple». (1) «jaifa»: c'est une blessure atteignant l'intérieur du corps. (2) «mounakkila»: une blessure avec luxation. (3) «moudiha»: une blessure sans fracture. (4) «la m'amouma»: c'est une fracture à la tête atteignant le crâne. - Malek a finalement dit: «Concernant la femme qui a un mari et des enfants qui ne sont ni de ses \"acebs\" ni de son peuple, son mari, surtout si il est d'une autre tribu, n'aura pas à verser un prix du sang au cas d'un délit, ni à l'égard de cette femme, ni à l'égard de ses enfants qui ne sont pas de sa tribu à lui, ni encore à l'égard de ses frères utérins qui ne sont ni de ses \"acebs\" ni de son peuple, car ceux-là ont droit à l'héritage de cette femme. Quant aux proches, ils avaient, et du temps de l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), à payer le prix du sang, jusqu'à nos jours. Il en est de même pour les affranchis de la femme dont leur héritage revient aux enfants de la femme même s'ils ne sont pas de sa tribu. Et le prix du sang d'un crime involontairement commis par les affranchis, devra être payé par la tribu de la femme». (2) «l'aceb»: est le mâle qui hérite d'un mort, le reste de l'héritage, après que les réservataires aient eu leur part; ou encore qui hérite tout s'il n'y a pas de réservataires. Chapitre VII Le prix du sang du fœtus",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1560
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": 1561,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1561
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": 1562,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1562
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "Sa'id Ibn Al Moussaiab a dit: «l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a exigé, au sujet de l'enfant tué dans le giron de sa mère, «la ghourra» comme compensation licite et qui est un ou une esclave. L'homme qui devait cette compensation, protestant dit: «Comment paierai-je le prix d'un être qui a encore ni bu, ni mangé, ni articulé, ni parlé; ainsi une telle exigence est invalable». Or, l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) répondit: «Cet homme-là est un confrère des magiciens». (......) 14 - Malek a rapporté que Rabi'a Ibn Abdul Rahman disait: «La ghourra est évaluée à cinquante dinars ou six cent dirhams; et la dyia d'une femme libre musulmane est de cinq cent dinars ou même six-mille dirhams». - Malek a dit: «La compensation licite d'un enfant tué dans le giron de sa mère, femme libre, est équivalente au dixième de sa dyia; et le dixième est de cinquante dinars ou de six cent dirhams». - Et Malek de continuer: «Je n'ai entendu personne dire que l'on ne doit pour l'enfant tué dans le giron de sa mère, payer une ghourra, que jusque au moment où sa mère l'a avorté ou encore qu'il tombe mort». - «Et toujours, à ce sujet, Malek a dit: «J'ai entendu dire que si l'enfant sort du giron de sa mère tout vivant, puis qu'il meurt, là encore on exige une compensation complète». -«Aussi Malek ajoute: «Un enfant n'est considéré de vivant, que lorsqu'il sort du giron de sa mère. Ainsi, s'il y sort et meurt après, le compensation est exigible. Je crois aussi que la compensation d'un enfant d'une esclave est du dixième du prix de sa mère». - Finalement Malek a dit: «si une femme enceinte tue un homme ou une femme involontairement, on ne la soumettra à la peine prescrite, qu'une fois qu'elle ait mis au monde son fœtus. Si une femme enceinte est volontairement ou involontairement tuée, celui qui l'a tuée n'aura rien à payer a Tégarûée son fœtus. Mais si elle est volontairement tuée, l'on tue celui qui l'a tuée, sans qu'il ait à payer à l'égard de son fœutus, une compensation.Enfin, si la femme est tuée involontairement, il revient à l'aquila du meurtrier de verser le prix du sang de la mère, indépendament de son fœtus». (......) 15 - On demanda Malek au sujet de l'enfant d'une femme juive ou chrétienne, s'il est avorté, il répondit: «Je trouve qu'on doit lui payer le dixième du prix du sang de sa mère». Chapitre VIII Ce qui est soumis à une dyia complète",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1563
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": 1564,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1564
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": 1565,
			"text": "Ibn Chéhab a rapporté que Sa'id Al Moussaiab disait: «Pour les deux lèvres coupées, l'on doit une dyia complète; mais si c'est seule la lèvre inférieure, la dyia est de deux tiers». (......) 17 - Malek a rapporté qu'il a demandé Ibn Chéhab au sujet de l'homme borgne crevant l'œil à un homme sain? Ibn Chéhab répondit: «Si le sain désire que la peine soit appliquée au borgne, ceci est de son droit; ou encore il peut avoir une dyia de mille dinars ou de douze mille dirhams». (......) 18 - On rapporta à Malek que pour chaque paire perdue des membres d'un homme, il faut une dyia complète; il en est de même pour la langue, les deux oreilles atteintes d'une surdité, qu'elles soient même coupées ou non; aussi il en faut une dyia complète pour le pénis de l'homme et les deux testicules» (......) 19 - On rapporta encore à Malek, que la dyia doit être complète pour les deux seins coupés à une femme». - Malek, d'autre part, a dit: «Je pense qu'il n'y a pas une dyia au sujet des sourcils coupés, ni non plus de la poitrine de l'homme». - Finalement Malek a dit: «Ce qui est suivi chez nous (à Médine), c'est de donner à l'homme une dyia complète au cas où il a perdu beaucoup plus qu'un membre. Aussi, si ce sont ses mains, ses pieds et ses yeux qui sont atteints à sa savoir brisés et crevés, il a droit à trois dyia». «Quant à l'œil sain d'un homme borgne, qui par erreur se trouve crevé, il aura droit à une dyia complète». Chapitre IX La dyia versée au sujet de l'œil perdant la vue",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1565
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": 1566,
			"text": "Soulaiman Ibn Yassar a rapporté que Zaid Ibn Thabet disait: «Pour l'œil sain qui a perdu la vue, il faut une dyia de cent dinars». - On demanda Malek au sujet de la perte de la paupière inférieure de l'œil, et de la fracture de son orbite; il répondit: «on ne manque pas à trouver une sentence convenable, sauf si ceci nuit à la vue de l'œil, alors l'on estime ce qui est de nuisible». - Finalement Malek a dit: «Ce qui est suivi chez nous (à Médine), au sujet d'un œil borgne, s'il est arraché, et de même pour une main paralysée qui est coupée.C'est qu'il n'y a là que sentence convenable à avancer, sans qu'il y ait à son sujet une dyia précise. Chapitre X La dyia correspondant aux blessures",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1566
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "Yahia Ibn Sa'id a entendu Soulaiman Ibn Yassar dire: «la moudiha» au visage est traitée pareillement à celle qui est faite à la tête, sauf si elle enlaidit le visage; alors ainsi, on ajoute sa dyia, en tenant compte de la différence entre celle-ci, et la moitié de la dyia correspondant à la tête et elle sera de soixante et quinze dinars. - Malek a dit: «ce qui est suivi à Médine au sujet de la «mounakkila», c'est de donner quinze chameaux à titre d'une dyia. «La mounakkila», poursuit Malek, est la blessure qui fait perdre les os fins de la tête sans atteindre le cerveau; elle peut être aussi bien à la tête qu'au visage». - Malek de dire aussi: «ce qui est suivi à Médine, au sujet de la «maamouma» et de la «Jaifa», c'est qu'elles m'imposent pas la peine prescrite». Et Ibn Chéhab a dit: «la maamouma n'exige pas la peine». - Et Malek interprétant dit: «la maamouma est une fracture pénétrant les os du crâne; et elle n'est considérée que comme telle». - Finalement Malek a dit: «Ce qui est suivi à Médine, c'est qu'il n'y a pas à verser une dyia pour une blessure qui en soit moins grande que la moudiha; en fait la dyia est pour ce qui est de la moudiha et d'une blessure plus grande, car l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) l'avait soulignée dans sa lettre envoyée à Amr Ibn Hazm, où il l'a faite correspondre à cinq chameaux. D'ailleurs les imams d'autrefois et d'aujourd'hui n'ont rien exigé comme dyia à propos de la moudiha». (......) 22 - Yahia Ibn Sa'id a rapporté que Sa'id Ibn Al Moussaiab a dit: «Toute blessure profonde pratiquée dans l'un des membres, exige une dyia équivalente au tiers de celle de ce membre». (......) 23 - Malek a dit: «Ibn Chéhab n'était pas de l'avis (cité ci-dessus); quant à moi, je n'ai pas trouvé qu'on s'est concerté au sujet de la blessure profonde pratiquée dans l'un des membres, mais plutôt c'est à l'imam de trouver un sentence convenable». - Aussi Malek a dit: «Ce qui est appliqué à Médine, c'est de ne considérer une blessure à titre d'une maamouma ou mounakkila ou même moudiha, que si elle est au visage ou à la tête. Mais toute autre blessure faite dans n'importe quelle partie du corps, ne fait appel qu'à une sentence». - Finalement Malek a dit: «je ne conçois pas, pour ce qui est de la mâchoire inférieure et le nez, de les considérer comme faiant partie de la tête, du moment qu'ils en sont séparés, et que la tête en soit à lui, un seul os». (......) 24 - Rabi'a Ibn Abdul Rahman a rapporté que Abdallah Ibn Al Zoubair avait appliqué la loi du talion à un homme qui a causé la mounakkila». Chapitre XI La dyia correspondant aux doigts",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1567
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1568
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": 1569,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1569
			}
		},
		{
			"hadithnumber": 1570,
			"arabicnumber": 1570,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1570
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": 1571,
			"text": "Rabi'a Ibn Abdul Rahman a rapporté: «J'ai demandé Sa'id Ibn Al Moussaiab au sujet de la dyia pour le doigt coupé à une femme? Il me répondit: «Elle est de dix chameaux» «Et pour deux doigts, repris-je»? «Vingt chameaux, répondit-il» «Et pour trois»? - «Trente chameaux»; «et pour quatre»? - «vingt chameaux». Alors je lui demandai: «Comment ça se fait, que plus la blessure est grave, plus la dyia est en diminution»? Sa'id répondit: «Es-tu Irakien ? - «En fait un savant à esprit fin, ou un ignorant à apprendre, répondis-je». Sa'id de répondre: «Plutôt, il est de la sounna, ô fils de mon frère». (1) Irakien: désigne celui qui applique le raisonnement par Syllogisme. - Malek a aussi dit: «ce qui est suivi à Médine, c'est d'exiger la dyia au cas où le doigt d'une main est coupé. Si ce sont les cinq coupés, leur dyia sera celle d'une main complète à savoir cinquante chameaux, repartis de dix chameaux pour chaque doigt». - Finalement Malek a dit: «pour les phalanges de la main, la dyia exigée est de trente-trois dinars, et d'un tiers pour chacune d'elles, correspondant ainsi, à trois chameaux et à un tiers du chameau». ChapitreXIl La dyia relative aux dents",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1571
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1572
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": 1573,
			"text": "Aslam, l'affranchi de Omar Ibn Al-Khattab a rapporté que Omar a exigé que la dyia d'une dent, soit un chameau, ainsi que pour la clavicule et la côte». l (......) 27 - Yahia Ibn Sa'id a rapporté qu'il a entendu Sa'id Ibn Al Moussaiab dire: «Omar Ibn Khattab a exigé que la dyia en soit, pour toute dent arrachée, un chameau; et Mou'awia (de sa part, que la dyia soit de cinq chameaux pour toute dent arrachée». - Sa'id, continua, et dit: «Ainsi donc la dyia est en diminution selon Omar, et en augmentation selon Mou'awia. Quant à moi, si j'avais à me décider, j'aurais imposé deux chameaux pour chaque dent arrachée, trouvant qu'une telle dyia est si convenable, et tout juriconsulte en sera récompensé». (......) 28 - Yahia Ibn Sa'id a rapporté que Sa'id Ibn Al Moussaiab disait: «au cas où la dent est touchée et de ce fait se noircit, la dyia est exigible. Et si, après s'être noirde. elle est arrachée, la dyia sera à verser, au complet». [ Chapitre XIII L'application de la dyia des dents]",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1573
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": 1574,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1574
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": 1575,
			"text": "Abou Ghatafan Ibn Tarif Al-Mourri a rapporté que Marwan Ibn Al-Hakam l'a envoyé, demander à Abdallah Ibn Al-Abas, au sujet de l'arrachement involontaire d'une dent»? Abdallah Ibn AI Abbas répondit: «La dyia payée est de cinq chameaux». Marwan me chargea d'être de nouveau chez Abdallah Ibn Abbas lui demandant «Considères-tu les molaires comme les incisives»?. Et Abdallah Ibn Abbas de répondre: «les doigts d'une main n'exigent-ils pas la même dyia»? (......) 30 - Hicham Ibn Ourwa a rapporté que son père ne faisait pas distinction d'entre les dents, quand il est sujet de la dyia». * Malek a dit: «Ce qui est suivi chez nous (à Médine) c'est que la dyia est la même pour toutes les dents à la fois, s'agit-il des inolaires ou des incisives, du fait que l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «pour une dent-involon-tairement arrachée - la dyia est de cinq chameaux, et le molaire n'est autre qu'une dent parmi d'autres, où l'on ne les distingue pas les unes des autres». Chapitre XIV La dyia versée pour la blessure causée à un esclave",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1575
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": 1576,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1576
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": 1577,
			"text": "On rapporta à Malek que Sa'id Ibn Al Moussaiab et Soulaiman Ibn Yassar disaient: «la moudiha de l'esclave exige une dyia valant la moitié du dixième de son prix». (......) 32 - On rapporta aussi à Malek que Marwan Ibn Al Hakkam décidait au sujet de l'esclave qui fut blessé, qu'il est du devoir de celui qui a blessé, de donner le paiement d'une dyia équivalente à ce qui est de la diminution du prix de l'esclave». * Malek a dit: «Ce qui est suivi chez nous (à Médine), c'est que la dyia payée pour la blessure causée à un esclave, dépend de la nature de cette dernière, tout comme ce qui s'ensuit: * pour la moudiha, une dyia valant le dixième de la moite du prix de l'esclave. * pour la mounakkila, elle est du dixième et la moitié du dixième. * pour la maamouma et la jaifa: chacune est du tiers de son prix. Quant à ce qui est des autres blessures, à savoir tout ce qui peut diminuer le prix de l'esclave, l'on estime, après la guérison de l'esclave, de combien est la différence, entre la valeur du prix de l'esclave après sa blessure, et sa valeur avant qu'il ne l'ait subie. Puis l'on demande à l'auteur de la blessure le paiement d'une dyia équivalente à la différence des deux prix». - Également, au sujet de l'esclave dont la main ou le pied ont été fracturés, après quoi, le membre a guéri, Malek a dit: «En fait, celui qui a causé cette fracture, n'aura rien à payer, sauf si cette fracture cause la diminution du prix de l'esclave, ou encore sa luxation alors ainsi, la dyia à payer sera équivalente a la diminution du prix». - Et Malek de continuer: «ce qui est suivi à Médine, c'est que la loi du talion est appliquée aussi bien aux esclaves qu'aux hommes libres à savoir: une esclave peut être tuée pour un esclave, leurs blessures encore sont pareilles. Aussi, si un esclave tue volontairement un autre esclave, le maître de ce dernier aura à opter: ou qu'il applique la loi du talion à l'esclave, ou qu'il ait à récupérer la dyia, équivalente au prix de son esclave tué. D'autre part, si le maître de l'esclave homicide veut bien payer le prix de l'esclave tué, il pourra le faire, ou encore, il livrera son esclave au maître de l'esclave meurtrier et encore l'autre maître ayant déjà l'esclave meurtrier, n'aura pas à le tuer. Telle est la règle suivie entre les esclaves au cas même où il s'agit d'une main ou d'un pied coupés ou encore d'autre peine tel le meurtre qui est lui aussi soumis à la loi du talion». - Malek a finalement dit au sujet de l'esclave musulman, blessant un juif ou un chrétien, que le maître de cet esclave peut lui payer la dyia pour son faire, ou encore qu'il le livre pour être vendu. Etant tel, l'on donne au juif ou au chrétien, une dyia provenant du prix de l'esclave, ou encore tout le prix afin que la dyia soit payée; mais l'on ne livrera jamais ni au juif ni au chrétien un esclave musulman». Chapitre XV La dyia des gens du Livre",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1577
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": 1578,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1578
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": 1579,
			"text": "On rapporta à Malek que Omar Ibn Abdul Aziz a décidé, au cas où un juif ou un chrétien est tué, que Sa dyia de chacun, soit équivalente à la moitié de celle d'un homme musulman libre\", - Malek a dit: «Ce qui est suivi chez nous (à Médine), c'est de ne pas tuer un musulman à cause d'un mécréant, sauf si le musulman tue l'autre par trahison; en conséquence il sera sujet à l'exécution\". (......) 34 - Yahia Ibn Sa'id a rapporté que Soulaiman Ibn Yassar disait: «La dyia d'un \"majous\" (un des mages) est de huit-cent dirhams». Et Malek de souligner: «Tel est aussi ce qui est suivi chez nous (à Médine)». - Enfin Malek a dit: «Les blessures causées aux juifs, chrétiens, et mages ont une dyia relativement comptée par rapport aux blessures des musulmans, qui est comme suit: Pour la moudiha, elle est la moitié du dixième de la dyia (des musulmans); pour îa maamouma et la jaifa: chacune est du tiers, et il en est ainsi pour toutes leurs blessures». Chapitre XVI Ce qui est soumis à la dyia des biens propres à un homme",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1579
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": 1580,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1580
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": 1581,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1581
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1582
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": 1584,
			"text": "Hicham Ibn Ourwa a rapporté d'après son père, qu'il disait: «L'aqila n'est pas soumise au paiement du prix du sang, quand il s'agit d'un crime volontairement commis; mais ce prix est à payer, si le crime est involontaire». (......) 36 - Malek a rapporté que Ibn Chéhab a dit: «Il est de la sounna de ne plus exiger de l'aquila le paiement du prix du sang d'un crime volontaire sauf si elle veut bien le faire». (......) 37 - Malek a ajouté, que Yahia Ibn Sa'id était du même avis (cité ci-dessus). -Et Malek de continuer que Ibn Chéhab a dit: «Il est de la sounna, au cas où il s'agit d'un meurtre volontaire, et où les parents de la victime se sont désisté, que la dyia soit payée des propres biens du meurtrier, sauf si l'aqila compte le soutenir pour s'acquitter de son gré». - Malek a aussi dit: «ce qui est suivi à Médine, c'est que la dyia n'est pas d'obligation de l'acquitter, sauf au cas où la dyia est du tiers et au delà; étant telle, elle est exigée de l'aqila; si elle est de moins que le tiers, la dyia est payée du propre argent de l'auteur». - Malek a ajouté: «Ce qui est incontestablement suivi à Médine au sujet de qui, l'on accepte le paiement d'une dyia, pour avoir commis un meurtre volontaire ou même pour une blessure causée volontairement, et où les parents de la victime avaient accepté la dyia, c'est que rien n'est exigé de l'aqila sauf si elle ne le fait de bon gré; car en fait le prix du sang, est à payer du propre argent du meurtrier ou de celui qui a causé la blessure, s'il possède l'argent; autrement, ceci reste une dette, de laquelle il devra s'acquitter; par conséquent, l'aqila n'aura rien à payer sauf si elle le désire». - Malek a encore dit: «Rien n'est exigé de l'aqila, au cas où un homme se tue ou se blesse volontairement ou involontairement; d'ailleurs tel est l'avis des hommes versés dans la religion à ce sujet. Et je n'ai jamais entendu quelqu'un dire que l'aqila doit garantir la dyia d'un crime volontaire. Ceci est connu de par les paroles d'Allah Béni et Très Haut dans Son Livre (le sens): «On doit user de procédés convenables envers celui auquel son frère a remis une partie de la dette, et lui-même dédommagera celui-ci de la meilleure façon» (Coran II,178). Cela est interprété comme suit, et Allah est le plus savant: «Celui qui aura pris une partie de la dyia de son frère, qu'il le suive par un acte convenable, et que l'auteur le dédommage charitablement». - «Concernant le garçon ou la femme, commettant un forfait dont la dyia n'est pas au delà du tiers du prix du sang, et que tous deux ne possèdent pas l'argent qui leur est nécessaire, Malek a dit: «En fait, cela doit être garanti de leurs propres biens, d'où l'on prend la somme; mais si ni l'un, ni l'autre ne possède l'argent, le prix du sang sera une dette dont ils auront à s'acquitter, sans que l'aqila n'ait rien à ce propos. D'autre part, le père du garçon n'aura pas à payer ce qui en est du devoir de ce garçon». - Finalement Malek a dit: «Ce qui est incontestablement suivi chez nous (à Médine), au sujet de l'esclave tué, c'est que sa dyia est à évaluer le jour même de son meurtre. Quant à l'aqila du meurtrier, elle ne devra rien de cette dyia de quelque valeur soit-elle, à savoir de moins ou de plus. Car, c'est au meurtrier que revient le fait de dédommager de son propre argent autant que sera la dyia. D'autre part, si le prix de l'esclave est équivalent à la dyia ou qu'il lui soit supérieur ou inférieur, elle sera prise de l'argent du meurtrier, du moment que l'esclave est considéré comme une marchandise parmi d'autres». Chapitre XVII L'héritage de la dyia et de son exécution",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1584
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": 1585,
			"text": "Ibn Chéhab a rapporté que Omar Ibn Al-Khattab, s'adressa, alors qu'il était à Mina, aux gens disant: «Celui qui en possède un savoir à propos de la dyia, qu'il me l'apprenne». Al-Dahhak Ibn Soufian surgit et dit: «L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) m'a incité par écrit de faire hériter la femme de Achiam al-Dibabi sa part de la dyia de son mari». Omar lui dit: «Entre sous ta tente, et attends mon arrivée». Aussitôt que Omar se présenta,. Al-Dahhak lui apprend ce qui est du sujet de la dyia; dès lors, Omar se décida de l'affaire de la dyia. - Et Ibn Chéhab ajouta: «Le meurtre de Achiam fut accompli involontairement»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1585
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": 1586,
			"text": "Amr Ibn Chou'aib a rapporté qu'un homme de Bani Moudiej connu sous le nom de Katada, lançant son épée contre son fils, le toucha à sa jambe, après quoi, le fils décéda à cause d'une hémorragie. Souraqa Ibn Jou'choum, se rendit chez Omar Ibn Al Khattab, lui apprit l'incident, Omar, aussi lui dit: «rends toi à «Qadid», compte cent et vingt chameaux et attends que j'arrive». Omar Ibn Al-Khattab arriva au lieu destiné, prit des chameaux comptés, trente chamelles de trois ans révolus, trente chamelles de quatre ans révolus et trente autres bien pleines, puis dit: «où est le frère de l'assommé»? - «Me voici, lui répondit-il». - Prends-les», reprit Omar, car l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «un homicide n'a aucun droit à la dyia». (......) 40 - Malek a rapporté que Sa'id Al Moussaiab et Soulaiman Ibn Yassar ont été demandés, si la dyia était à âccroitre, si elle tombe au cours d'un mois sacré? «Non», répondirent-ils mais elle subit un ajout par considération à ce mois» Puis on demanda à Sa'id: «Doit-on augmenter la dyia correspondant aux blessures, tout comme celle qui l'est au meurtre»? «Oui», dit-il. - Malek a ajouté: «je vois qu'ils ont, à ce sujet, agi, tout comme Omar Ibn Al-Khattab avait jugé l'affaire de la dyia de Moudlaji, lançant son épée et blessant son fils»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1586
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": 1587,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1587
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": 1588,
			"text": "Ourwa Ibn Al-Zoubair a rapporté qu'un homme des Ansais connu sous le nom de Ouhaiha Ibn Al-Joulah avait un oncle qui était plus petit que lui, vivant chez ses oncles maternels; Ouhaiha le prit et le tua; ainsi les oncles maternels s'écrièrent: «nous l'avons élevé dès son âge tendre, et une fois qu'il est devenu un homme robuste, un neveu paternel nous l'a ôté». Ourwa dit alors: «c'est pour une telle raison, qu'un meurtrier n'hérite pas de sa victime». - Malek a dit: «Ce qui est incontestablement suivi chez nous (à Médine), c'est que le meurtrier tuant de toute volonté, n'hérite rien de la dyia de la victime, ni de ses biens. Aussi, ce meurtrier ne peut empêcher à aucun réservataire de recevoir sa part de la succession. Et celui qui, involontairement, tue, n'hérite rien encore de la dyia. Cependant, concernant son droit à la succession, cela a été soumis à la discussion, du moment qu'on ne l'accuse pas d'avoir tué, pour hériter la victime, ni non plus pour s'emparer de ses biens. Ainsi, ce que je trouve de bon, c'est qu'il aura à hériter de ses biens, indépendamment de sa dyia». Chapitre XVIII La dyia en général",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1588
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": 1589,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Plus de dyia à remettre au cas d'un accident provenant d'un animal, d'un puits et d'un métal. Quant à ce qui est du «rikaz» (c'est ce qui est enfoui des trésors au temps antéislamique) l'on en compte le cinquième». - Malek, à ce sujet, est du même avis. - Malek a dit: «Le chef d'une caravane, le conducteur d'une bête et celui qui la monte, tous en sont responsables des blessures causées par une monture, excepter le cas où la bête frappe du pied sans qu'elle soit poussée par quelqu'un qui le lui fait faire cela. D'autre part, Omar Ibn Al-Khattab, était pour le paiement de la dyia concernant celui qui fait parcourir sa monture (à savoir lui causant par là une blessure). - Malek a ajouté: «D'ailleurs le chef d'une caravane, le conducteur d'une bête et celui qui la monte doivent beaucoup plus le versement d'une dyia que celui qui fait parcourir sa monture». - Malek a encore dit: «Ce qui est pratiqué à Médine, est ce qui suit: «Celui qui creuse un puits en pleine rue, ou qu'il attache une monture ou même qu'il fasse une chose pareille sur la voie parcourue par les musulmans, et que toutes ces actions sont ce qui n'est pas permis, et ce qui cause du mal aux musulmans, il sera tenu à assumer la responsabilité de ce qui pourrait arriver, une blessure soit-elle ou autre. Si les dégâts causés ne comptent pas même le tiers de la dyia, ils seront pris du propre argent de cet homme; mais si la somme est du tiers et au delà, elle est de l'aqila. Cependant si l'homme avait effectué ce qui est permis comme action, et que ceci avait causé un dégât ou un préjudice aux musulmans, il n'en sera pas responsable, comme le fait de creuser un puits pour retenir l'eau de la pluie ou descendre d'une monture et l'attacher à côté de la route, pour satisfaire un besoin». - Aussi, au sujet de celui qui descend dans un puits, et qu'un autre lui fait suite, de telle façon que le premier attire le second, finissant tous deux dans le puits, Malek a dit: «C'est au premier de payer la dyia». - De même pour le garçon, à qui l'homme demande de descendre dans un puits, ou de monter un palmier, et qui finit par mourir (en faisant une chute ou autre cause liée à cette ordre), Malek a dit: «C'est à l'homme d'assumer la responsabilité, payant ainsi la dyia». - Malek a encore dit: «Ce qui est incontestablement pratiqué chez nous (à Médine), c'est de n'exiger des femmes et des garçons le paiement de la dyia avec raqua, car en fait la dyia n'est exigible que des hommes qm sont déjà à maturité». -A propos de la dyia exigée des affranchis Malek a dit: «On peut en charger l'aquila si elle accepte mais au cas où elle refuse ils seront d'appartenanœ an Diwan (1), ou abandonnés. Aussi du temps de l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâœ et la paix d'Allah) et de Abou Bakr Al Siddiq, le régime de 1'aqila était suivi avant même que le diwan n'existait; par conséquent ce diwan a été institué du temps de Omar. Ainsi donc, il n'est pas permis que l'on paie à quelqu'un la dyia si ce ne sont ou des gens de sa tribue ou ses proches, car le wala ne peut être transmis, encore que l'Envoyé d'Allah r (salallahou alayhi wa salam) Sur lui la grâce et la paix d'Allah a dit: «le droit du patronage (autrement dit le wala) revient à celui qui affranchit». (1) Le Diwan est conçu comme étant le régistre. Mais durant l'époque de Omar Ibn el Khattab le Diwan était constitué des institutions gouvernementales et officielles telles le trésor publique le statut personnel et autre… - Et Malek de souligner le wala est une appartenance fixe» - - Aussi, ce qui est suivit chez nous (à Médine) concernant les bêtes qui ont subit un mal; Malek a dit: «Celui qui leur a causé du mal, doit payer à leur sujet une somme équivalente au taux de la diminution». - Concernant l'homme condamné à mort, en commettant un crime qui le soumet à une peine prescrite, Malek a dit: «On ne tient plus compte de la peine prescrite, du moment que la mort englobe tout, sauf si c'est le cas d'une diffamation, ainsi on demande au diffamé: «Pourquoi ne demandes-tu pas l'application de la peine à celui qui t'a diffamé»? Et Malek de souligner: «Je conçois là, l'application de la peine prescrite au diffamateur avant de le tuer. Puis on le tuera, je ne conçois pas qu'on a le droit de lui imposer le paiement de la dyia s'il s'agit d'une blessure par exemple, car la peine de la mort ne laisse place à aucune autre peine». - Malek a encore dit: «Ce qui est suivi chez nous (à Médine), au sujet d'un homme tué, abandonné parmi les demeures ou dans un village ou autre lieu. C'est que l'on n'a pas le droit d'accuser celui dont la maison est proche du tué, ni celui qui habite tout près de la place où a été abandonné te tué, car il se peut qu'un homme soit tué puis jeté à la porte des gens afin qu'ils en soient inculpés. Ainsi un tel acte est à repousser». - Finalement, au sujet d'un groupe de gens qui, se battent enre eux,et terminent par un tué ou un blessé sans que l'on puisse savoir qui en est le responsable , Malek a dit: «Ce que j'ai de mieux entendu dire à ce sujet, c'est d'exiger la dyia de ceux qui se sont battus contre lui; et si le blessé ou le tué n'était ni de tel camp, ni de tel autre, la dyia sera exigée des deux camps à la fois». Chapitre XIX Le meurtre commis par trahison ou par magie",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1589
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": 1590,
			"text": "Sa'id Ibn Al Moussaiab a rapporté que Omar Ibn Al-Khattab a ordonné de tuer cinq ou sept personnes qui ont assommé, par trahison un homme, et il dit: «si tous les habitants de Sana'a (ville à Yaman où le crime a eu lieu) s'étaient complotés pour son meurtre, j'aurais ordonné de les tuer tous à la fois»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1590
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": 1591,
			"text": "On rapporta à Mouhammad Ibn Abdul-Rahman Ibn Sa'd Ibn Zarara que Hafsa, la femme du Prophète (Sur lui la grâce et la paix d'Allah) avait ordonné de tuer une de ses esclaves qu'elle avait déjà affranchie à titre posthume, pour l'avoir ensorcelée». - Malek a dit: «le magicien pratiquant la sorcellerie, sans qu'il en soit ensorcelé par un autre (tuant un autre par sa magie) est à comparé à l'homme au sujet de qui Allah a dit dans son Livre (le sens): «Les hommes savent que celui qui fait l'acquisition de ces vanités, n'aura aucune part dans la vie futre» (Coran 11,102). Ainsi donc, il doit être tué s'il a commis lui-même le meurtre». Chapitre XX Le crime volontaire",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1591
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": 1592,
			"text": "Omar Ibn Houssein, l'affranchi de Aicha Bint Koudama, a raconté que Abdul-Malek Ibn Marwan avait livré un homme qui avait tué un autre avec un bâton au défenseur de la victime qui, lui, tua le coupable avec un bâton». - Malek a dit: «La norme incontestablement suivie chez nous (à Médine) est la suivante: «Au cas où un homme frappe un autre avec un bâton ou lui jette une pierre ou même le frappe volontairement, et que l'homme meurt, tel est le crime volontaire soumis à la loi du talion». - Malek a ajouté: «ainsi, le crime considéré volontaire chez nous (à Médine), est qu'un homme frappe un autre jusqu'à ce qu'il meure; d'autre part, c'est encore un crime volontaire, le fait qu'un homme frappe un autre à cause d'une animosité ou même à la suite d'une querelle, puis qu'il le quitte encore vivant. Or, si ce dernier meurt à la suite d'une hémorragie, on fera recours à la «Kaça-ma» (c.f Chapitre suivant). - Malek a finalement dit: «Ce que nous suivons chez nous (à Médine), c'est qu'au cours d'un meurtre volontaire, les hommes libres coupables soient tués par un seul homme libre , les femmes par une seule femme, et les esclaves par un seul esclave». Chapitre XXI La loi du talion appliquée à un meurtre",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1592
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": 1593,
			"text": "On rapporta à Malek que Marwan Ibn Al-Hakam avait envoyé par écrit à Mou'awia Ibn Abi Soufian qu'on lui avait amené un homme ivre, qui a tué un homme. Sur ce sujet, Moua'wia lui répondit «Fais le tuer». - Malek a dit: «Ce que j'ai de mieux entendu au sujet de l'explication de ce verset (le sens) : «L'homme libre pour l'homme libre, l'esclave pour l'esclave«, (Coran II, 178), tels en sont les mâles, et «la femme libre pour la femme libre», c'est que l'application de la loi du talion est la même, aussi bien aux femmes qu'aux hommes. Ainsi, on tue une femme libre pour une femme libre, tout comme on tue l'homme libre pour un homme libre, encore on tue l'esclave mâle ou femelle, pour un esclave mâle ou femelle. Donc la loi du talion est appliquée de la même façon aussi bien aux femmes qu'aux hommes, conformément aux paroles d'Allah Béni et Très Haut dans son livre (le sens): «Nous leur avons prescrit, dans la Tora: vie pour vie, œil pour œil, nez pour nez, oreille pour oreille, dent pour dent. Les blessures tombent sous la loi du talion» (Coran V,45). Ainsi, Allah Béni et Très haut avait mentionné que la vie est pour la vie, signifiant par là que la femme libre peut être tuée par un homme libre, et ses blessures sont comme les siennes, soumises à la loi du talion». - Concernant l'homme qui tient pour un autre, un homme pour que le second frappe le troisième et le tue sur place, Malek a dit: «Si le premier tient le troisième, afin que le second puisse tuer ce dernier, il faut que les deux soient tués. Mais s'il le tient croyant que le second veut frapper le troisième, voulant par là le réformer, sans qu'il cherche à le tuer, le meurtrier doit être tué; quant à celui qui tenait la victime, il sera sévèrement jugé et emprisonné pour un an sans être condamné à mort». - Concernant l'homme qui, volontairement, tue un autre ou lui crève un œil, après quoi le meurtrier sera tué, ou on lui crèvera son œil, avant qu'on lui applique la loi du talion, Malek a dit: «Il ne paiera ni une dyia, ni sera soumis à la loi du talion, car celui qui a été tué ou à qui on crevé l'œil, avait droit à appliquer une sanction pareille à celui qui a volontairement tué. Car en fait il est dans la même situation que celle d'un homme qui volontairement tue, puis meurt. Ainsi, étant donné que le meurtrier est mort, les parents de la victime n'auront droit ni a une dyia, ni à une autre compensation légale, et cela par renvoi à ce que Allah Béni et Très Haut a dit dans Son Livre: «la loi du talion vous est prescrite en cas de meurtre: l'homme libre pour l'homme libre, l'esclave pour l'esclave» (Coran 11,178). - Expliquant cela, Malek a dit: «Ainsi donc, la victime a le plein droit d'appliquer au meurtrier la loi du talion; mais si le meurtrier meurt, la victime n'aura ni un prix du sang, ni une application de la loi du talion». - Finalement Malek a dit: «la loi du talion n'est pas à appliquer à un homme libre blessant un esclave; mais si un esclave tue volontairement un homme libre, on le tuera; quant à l'homme libre tuant un esclave, il ne sera pas tué même si le crime est volontaire. Et c'est ce que j'ai de mieux entendu». Chapitre XXII Le pardon pour un crime volontaire",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1593
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": 1594,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1594
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": 1595,
			"text": "Yahia a rapporté que Malek avait croisé des hommes versés dans la religion et agréés de lui, dire: «Si un homme assassiné recommande (avant de mourir), de pardonner à son meurtrier qui l'a tué volontairement, cela lui est permis, car il avait plus de droit que les autres, de disposer de la personne du meurtrier (à savoir ou de la condamner à mort ou de lui pardonner). - Concernant un homme assassiné, qui pardonne, avant de mourir à son meurtrier qui l'a tué volontairement, une fois condamné à mort, Malek a dit: «La victime n'a plus le droit au prix du sang, sauf qu'il le lui demande en lui accordant le pardon». - Et Malek de continuer: Au cas où le tueur volontaire est pardonné, il sera soumis à la flagellation pour cent coups, et sera mis en prison pour un an. - Quand un homme tue volontairement un autre, et que ceci est déjà mis en preuve, alors que la victime a des fils et des filles, si les fils pardonnent au tueur et que les filles le refusent, ce pardon est valable du moment qu'il est plus considéré que celui des filles; par conséquent les filles n'auront aucun droit de réclamer ni le pardon, ni le prix du sang». Chapitre XXIII L'application de la loi du talion, au sujet des blessures. (1628) - Malek a dit: \"Ce qui est incontestablement suivi chez nous (à Mcdine), an sujet de celui qui cause volontairement une fracture à la main ou au pied d'un homme, c'est de iui appliquer la loi du talion-sans reclamer la dyia». -Aussi Malek a dit: \"La loi du talion ne sera appliquée au coupable que si les blessures sont guéries- Si la blessure causée au coupable est pareille à celle de l'agressé une fois guéri, telle en sera la peine; au cas où la blessure est plus grawc, ou bien que le coupable est mort, l'agressé ne doit rien au coupable-Si l'agressé devient paralysé ou que ses blessures ont été guéries en laissant un défaut corporel ou une difformité ou une luxation, alors que l'agresseur se trouve complètement guéri, il n'aura pas le droit qu'on casse au coupable, l'antre main, ou qu'on lui applique une peine. Cependant on paie, par compensation la dyia qui doit être équivalente à celle luxation; et les blessures seront traitées pareillement aux fractures». -Malek a dit un si un homme crève volontairement un œil à son épouse, ou lui brise une main ou lui coupe un doigt, ou lui fait un mal similaire il sera soumis à la loi du talion. Quant à l'homme qui frappe sa femne d'avec une corde ou un fouet, lui causant ainsi un mal quelconque involontairement, il paiera la dyia sans qu'il soit soumis à la loi du talion». (......)«-Malek a finalement dit on m'a rapporté que Abou Bakr ibn Mohammed ibn Amer ibn Hazm avait décidé d'appliquer la loin du talion pour une fracture à la cuisse »- Chapitrc XXIV Ce qui convient comme dyia à «Al Sa'iba»» et au crime qu'il commet",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1595
			}
		}
	]
}