{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"46": "The Decree"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1623,
			"arabicnumber": 1623,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Adam et Moïse se sont débattus, au cours de quoi Adam avança à Moïse un argument cherchant ainsi à le convaincre. Moïse dit à Adam: «Est-ce toi Adam qui as séduit les hommes et les a fait quitter le Paradis»? Et Adam de lui répondre: «est-ce toi Moïse, à qui Allah a voué la connaissance de toute chose, et qu'il t'a même distingué de tous les autres par Son Message»? «Oui-répondit Moïse»; Et Adam de reprendre: «Me blâmes-tu pour une affaire qui m'a été prédestinée, avant même que je ne sois créé»?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1623
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": 1624,
			"text": "Mouslem Ibn Yassar Al-Jouhani a rapporté qu'on a demandé Omar Ibn Al-Khattab au sujet de l'explication du verset suivant; «quand ton Seigneur tira une descendance des reins des fils d'Adam, il les fît témoigner contre eux-même: «Ne suis-je pas Votre Seigneur»? Ils dirent: «Oui, nous en témoignons»! Et cela pour que vous ne disiez pas le jour de la résurrection (le sens):«….Nous avons été pris au dépourvu….» (Coran, VII,172). Omar répondit: «J'ai entendu les gens, demander l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) au sujet du même verset, où il leur répondit: «Allah Béni et Très haut, créa Adam, puis II Y lui caressa le dos de Sa main droite extrayant ainsi, une descendance. Puis Il Y dit: «J'ai créé ceux-ci pour le Paradis et ils accompliront les faires des élus du Paradis. Ensuite Il Y caressa le dos d'Adam, extrayant une autre descendance, puis dit: «J'ai créé ceux-là pour l'Enfer, et ils accompliront les faires des damnés». Un homme dit: «ô Envoyé d'Allah quel est donc ce faire»? L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) lui répondit: «Quand Allah Y crée un homme pour le Paradis, Il Y le fera accomplir les œuvres des élus, jusqu'à ce qu'il meurt en accomplissant une œuvre de celles accomplies par les élus; ainsi donc, il sera au Paradis. Et quand II Y crée un homme pour l'Enfer, il lui fera faire les travaux des damnés jusqu'à ce qu'il meurt et accomplissent l'un de ces travaux, et sera ainsi à l'Enfer»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1624
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": 1625,
			"text": "On rapporta à Malek que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Je vous ai laissé deux sujets; si vous les suivez, vous ne seriez jamais perdus: Le Livre d'Allah, et la sounna de son Prophète",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1625
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": 1626,
			"text": "Taous Al-Yamani a dit: «J'ai vécu dans une époque où j'étais contemporain à des compagnons de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) qui disaient: «Tout est soumis à la prédestination». - Taous de continuer: «J'ai entendu Abdallah Ibn Omar dire que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Toute chose est soumise à la prédestination, même l'inactivité et l'énergie, ou l'énergie et l'inactivité»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1626
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": 1627,
			"text": "Amr Ibn Dinar a rapporté: «j'ai entendu Abdallah Ibn Al Zoubair dire au cours de son serment: «Allah Y est celui qui guide et qui égare»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1627
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "Abou Souhail Ibn Malek a raconté: «Je marchais avec Omar Ibn Abdul Aziz quand il me dit: «Que dis-tu au sujet des Qadarias. Je lui répondis: «Je conçois que tu les encourages au repentir; ainsi, ou qu'ils se repentent ou qu'ils soient combattus à l'épée». Omar reprit: «Tel est aussi mon avis». - Et Malek dit: «je suis du même avis de Omar». Chapitre II Au sujet des \"Qadarias\".(1) (1) C'est un groupe de gens qui repoussent la prédestination, croyant que tout acte accompli par chaque serviteur d'Allah, dépend de sa propre volonté indépendamment de celle d'Allah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1628
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": 1629,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Que la femme ne demande pas à sa sœur d'être divorcée afin qu'elle ait son plat (à savoir pour qu'elle occupe sa place), et qu'elle se marie. Car, elle n'aura que ce que Allah lui a prédestiné»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1629
			}
		},
		{
			"hadithnumber": 1630,
			"arabicnumber": 1630,
			"text": "Mouhammad Ibn Ka'b Al-Qourazi a rapporté, que Mou'awia Ibn Abi Soufian, étant sur le mimbar (la chaire), a dit: «Hommes! Nul ne peut empêcher ce que Allah accorde, et nul ne donne ce que Allah empêche; ni la richesse ni le rang ne sont salutaires car c'est Allah qui les accorde. Celui que Allah voue pour le bien, Il Y l'instruit dans la religion». Puis Mou'awia continua et dit: «J'ai entendu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dire ces mots, de sa propre bouche, étant sur cette même chaire»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1630
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": 1631,
			"text": "On rapporta à Malek qu'on disait: «Louanges à Allah, qui a parfaitment créé toute chose; rien n'arrivera que selon ce qu'Il prédestine (à savoir ni avant ni après le temps-prédestiné). Allah me suffit; Allah exauce celui qui L'invoque, Allah est notre seule destinée»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1631
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": 1632,
			"text": "On rapporta à Malek que l'on disait: «Nul ne mourra avant qu'il n'ait eu tous les biens, qui lui sont prédestinés par Allah. Ainsi, soyez modérés en demandant vos biens à Allah». MOUATTAA Au Nom d’Allah Le Clément Le Miséricordieux Livre 47 Le Livre des bons caractères Chapitre premier: De ce qui est des bons caractères",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1632
			}
		}
	]
}