{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"48": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "Jaber Ibn Abdallah Al-Ansari a rapporté: «Nous quittâmes avec l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) pour l'expédition de «Bani Anmar». J'étais à l'ombre d'un arbre, et voyant l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), je lui dis: «ô Envoyé d'Allah viens te mettre à l'ombre de cet arbre». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) descendit, et je me levai pour chercher dans un grand sac, de quoi manger; trouvant quelques concombres, je coupai un et le donnai à l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) qui me demanda: «D'où avez-vous apporté cela»? Jaber de dire: «Nous l'avons apporté avec nous, en sortant de Médine», et Jaber de poursuivre: «Nous avions un homme, à qui nous donnions ce qui est nécessaire, et qui mène notre troupeau au pâturage. Ainsi, je donnai, à cet homme, dit Jaber ce qui lui est nécessaire, puis il parti à la canicule, ayant mis deux vêtements râpés. «L'Envoyé d'Allah (salallahou alayhi wa salam) r le ragarda et lui dit: «N'a-t-il pas autre chose que ces deux vêtements»? «Certes, oui, répondis-je, il en a deux autres dans le vestiaire, que je lui avais donnés». L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dit: «appelle-le, et ordonne-lui de les mettre». J'appelai l'homme pour qu'il mette les deux vêtements, puis il partit. Alors l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dit: «Qu'a-t-il cet homme; que Allah frappe son cou; ces deux vêtements ne sont-ils pas mieux que les autres»? L'homme entendant les paroles de l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah), dit: «ô Envoyé d'Allah que je meure dans la voie d'Allah». L'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) lui répondit: «Que ça soit dans la voie d'Allah». L'homme plus tard, fut tué dans la voie d'Allah»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1651
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "On rapporta à Malek que Omar Ibn Al-Khattab a dit: «J'aime que ceux qui récitent le Coran, soient vus habillés tout en blanc»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1652
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "Ibn Sirine a rapporté que Omar Ibn Al-Khattab a dit: «Si Allah vous accorde des biens, vivez donc aisément. Qu'un homme soit enveloppé de tous ses vêtements». Chapitre II Le fait de porter des vêtements teints et brodés en or",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1653
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1654
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "Nafe' a rapporté que Abdallah Ibn Omar mettait des vêtements teints de Safran et de terre rouge». - Yahia a rapporté qu'il a entendu Malek dire: «Je déteste le fait que les garçons mettent des vêtements brodés d'or, car on m'a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a interdit de mettre des bagues en or. Ainsi, je le refuse aux hommes, grands on petits, soient-ils». - Yahia a rapporté qu'il a entendu Malek dire à propos des vêtements drapés teints de carthame à la maison et dans les parvis des demeures: «Je ne crois pas que ceci est interdit; mais d'autres vêtements me sont plus préférés». Chapitre III Le fait de porter des vêtements en soie (dits Khazz) (l)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1655
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "Hicham Ibn Ourwa a rapporté d'après son père que Aicha, la femme du Prophète (Sur lui la grâce et la paix d'Allah) avait donné à Abdallah Ibn Al-Zoubair, un vêtement en Khazz, à porter, que Aicha avait déjà mis». (1) genre de tissu dont le chaîne est en soie et le trame en laine. Chapitre IV Ce qu'on répugne comme vêtements pour les femmes",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1656
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "Alqama Ibn Abi Alqama a rapporté d'après sa mère que Hafsa, Bint Abdul Rahman entra chez Aicha, la femme du Prophète r (Sur lui la grâce et la paix d'Allah), et Hafsa était couverte d'un voile très mince. Aicha découpa ce voile, et couvra Hafsa d'un autre plus épais»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1657
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "Abou Saleh a rapporté que Abou Houraira a dit: «Il y a des femmes vêues (de parure) et nues, désobéissantes et séduisantes, qui n'entreront pas au Paradis, ni même sentiront son odeur , bien que son odeur soit répandue à une distance de cinq cent années de parcours»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1658
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "Ibn Chéhab a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) se leva la nuit, regarda le ciel et dit: «Que de trésors sont ouverts cette nuit (voulant dire de miséricorde et de bienfaits)? Que de troubles sont envoyés? Combien de femmes sont vêtues (dans le monde d'ici-bas),et nues (dans le monde de l'au-delà) le jour de la résurrection. Réveillez celles qui habitent les demeures». Chapitre V Le fait de traîner l'habit par vanité",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1659
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Celui qui, par vanité, traîne son habit, Allah ne lui prête pas attention, le jour de la résurrection»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1660
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Allah Y, Béni et Très-Haut ne prêtera pas, le jour de la résurrection, attention, à celui, qui, avec vanité, traîne son habit»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1661
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a dit: «Le jour de la résurrection, Allah Y , ne porte aucun intérêt à celui qui traîne, avec ostentation, son habit»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1662
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "Al'Ala Ibn Abdul Rahman a rapporté d'après son père, qu'il a demandé Abou Sa'id Al-Khoudri au sujet de l'izar? Il lui répondit: «Moi, je peux te l'apprendre. J'ai entendu l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) dire: «L'izar du croyant ne doit pas aller au-delà de la mi-jambe. Ainsi, il n'y a pas de mal à ce que ça soit au-dessus des talons; mais si l'izar va plus bas que les talons, ceci ira à l'Enfer, et plus bas encore, ira à l'Enfer. Allah Y , le jour de la résurrection, ne regardera pas, celui qui traîne vaniteusement son habit». Chapitre VI Au sujet de la femme qui traine ses vêtements",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1663
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1664
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1665
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "Safia Bint Abi Oubaid a rapporté que Oum Salama, la femme du Prophète (Sur lui la grâce et la paix d'Allah), faisant allusion à l'izar, a demandé à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah): «Que dis-tu à propos de la robe de la femme»? Il répondit: «Elle peut l'allonger d'un empan (des talons). Ainsi, Oum Salama dit: «Donc, son talon sera nu» II répliqua: «qu'elle l'allonge donc d'une coudée, au plus». Chapitre VII Le fait de se chausser 1701) 14 - Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r Sur lui la grâce et la paix d'Allah a dit: «Que personne ne marche ayant à l'un de ses pieds un soulier, alors que l'autre est déchaussé; ainsi qu'il se chausse les deux pieds, ou qu'il se déchausse». 1702) 15 - Abou Houraira a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) r Sur lui la grâce et la paix d'Allah a dit: «Si l'un de vous veut se chausser, qu'il commence par le pied droit; cependant, s'il veut se déchausser, qu'il commence par le pied gauche. Ainsi, que le pied droit soit le premier à chausser, et le dernier à déchausser»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1666
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "Abou Souhail Ibn Malek a rapporté d'après son père que Ka'b al-Ahbar a vu un homme se déchausser; il lui dit: «Pourquoi enlèves-tu tes chaussures? Peut-être que tu as agi conformément à ce verset (le sens): «Enlève tes sandales: tu es dans dans la vallée sainte de Tuwa» (Coran XX, 12). Puis Ka'b, continua, et demanda à l'homme: «Sais-tu de quoi étaient faites les sandales de Moïse»?. - Malek de dire: «J'ignore quelle était la réponse de l'homme». Et Ka'b de poursuivre: «Elles étaient faites de la peau d'un âne mort». Chapitre VIII Au sujet des vêtements à mettre",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1667
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "Abou Houraira a dit: «l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) a défendu le port de deux genres de vêtements, et le fait d'accomplir deux ventes à savoir «la moulamassa» et «la mounabaza» Voir: chapitre des ventes - 31 -; et également qu'un homme ne s'enveloppe que d'un seul vêtement, laissant voir une partie de son corps toute nue, ou encore qu'un homme se couvre d'un vêtement, tombant sur une seule partie de son corps",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1668
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": 1669,
			"text": "Abdallah Ibn Omar a rapporté que Omar Ibn Al-Khattab, à la vue d'une tunique dite «siarà»^, qu'»n vendait à la porte de la mosquée, dit à l'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah): «ô Envoyé d'Allah, si tu t'achetais cette tunique, pour que tu la mettes le jour du vendredi, pour recevoir ainsi les députés qui viendront chez toi»! L'Envoyé d'Allah (salallahou alayhi wa salam) r Sur lui la grâce et la paix d'Allah répondit: «Ce lui qui mettra une telle tunique, n'aura aucun espoir dans la vie de l'au-delà». Puis ayant reçu quelques unes de ces tuniques, l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) en donna une à Omar Ibn Al-Khattab qui s'écria: «ô Envoyé d'Allah me donnes-tu une à mettre, après m'avoir dit tel au sujet de la tunique de «Outared»? L'Envoyé d'Allah (salallahou alayhi wa salam) r (Sur lui la grâce et la paix d'Allah) de répondre: «Je ne te la donne pas pour que la mettes». Ainsi Omar, donna la tunique à un de ses confrères polythéiste à la Mecque». (2) «siarà»Tunique faite en fils de soie",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1669
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "Anas Ibn Malek a dit: «J'ai vu Omar Ibn Al-Khattab, alors que ce jour-là; il était gouverneur à Médine, mettant un habit qu'il avait rapiécé à trois places, de façon que les rapiéçages étaient les uns à côté des autres». MOUATTAA Au Nom d’Allah Le Clément Le Miséricordieux Livre 49 Le Livre des qualités du Prophète (Sur lui la grâce et la paix d'Allah) et d'autres sujets Chapitre Premier Au sujet de la qualité du Prophète r (Sur lui la grâce et la paix d'Allah)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1670
			}
		}
	]
}