{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"50": "The Evil Eye"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "Mouhammad Ibn Abi Oumama Ibn Sahl Ibn Hounaif a rapporté qu'il a entendu son père dire: «Mon père Sahl Ibn Hounaif fit une lotion à «Al-Kharrar» (lieu près de Jouhfa) en ôtant une «joubba» qu'il mettait alors que Amer Ibn Abi Rabi'a le regardait. Sahl était un homme au teint blanc et avait une belle peau. Amer Ibn Abi Rabi'a lui dit: «je n'ai jamais vu une peau pareille, même pas celle d'une vierge». Sahl tomba malade sur place, et sa maladie allait s'aggraver de plus en plus. On vint rapporter à l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) que Sahl était malade et qu'il ne pourrait plus accompagner l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah). Ainsi, l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) vint rendre visite à Sahl qui lui apprit le fait de Amer. L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dit alors à Amer: «Pourquoi donc, l'un de vous tue son frère? Pourquoi tu n'as pas béni sa peau; le méchant œil est un fait effectif; fais donc tes ablutions? Amer fit ses ablutions, et Sahl accompagna par la suite l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) sans souffrir d'aucun mal. (On avait retenu l'eau des ablutions faites par Amer, et on l'a versée sur Sahl)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1711
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "Abou Oumama Ibn Sahl Ibn Hounaif a rapporté que voyant Amer Ibn Rabi'a faisant une lotion,il lui dit: «Je n'ai jamais vu jusqu'à présent une belle peau cachée»; Sahl tomba immédiatement malade. Venant apprendre à l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) ce qui a eu lieu, on lui dit: «Ô Envoyé d'Allah!, viens voir Sahl Ibn Hounaif; par Allah, il ne peut pas même lever la tête». Il demanda: «Accusez-vous quelqu'un à son sujet»? On lui répondit: \"Nous accusons Amer Ibn Rabi'a». Ainsi, l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) convoqua Amer et le gronda en disant: «Pourquoi l'un de vous, cherche-t-il à tuer son frère? Pourquoi, tu ne lui as pas béni la peau? Vas faire une lotion». Alors Amer se lava le visage, les mains, les coudes, les genous, les extrémités de ses pieds, les hanches, lui versant l'eau de la lotion dans un vase, puis la verse sur Sahl, après quoi, ce dernier partit avec les gens, sans avoir aucun mal». Chapitre II L'exorcisme du mauvais œil",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1712
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "Houmaid Ibn Qais Al-Makki a rapporté: «On fit entrer chez l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) les deux fils de Ja'far Ibn Abi Taleb»; alors il dit à leur nourrice: «Pourquoi me paraissent-ils si, maigres»? Elle lui répondit «Ô Envoyé d'Allah ils sont si vite atteints par le mauvais œil; et on ne s'est pas empêché de les exorciser sauf ce par quoi tu agrées comme formules». Ainsi, l'Envoyé d'Allah r (salallahou alayhi wa salam) Sur lui la grâce et la paix de Allah dit: «Faites qu'ils soient exorcisés, car si une chose pouvait précéder le destin, ça ne pouvait être que le mauvais œil»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1713
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "Ourwa Ibn Al-Zoubair a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) Sur lui la grâce et la paix d'Allah entra chez Oum Salama, la femme du Prophète (Sur lui la grâce et la paix d'Allah), il y trouva un enfant pleurant, qui lui dit-on a été atteint par un mauvais œil. Ourwa continuant: «Ainsi l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dit: «Pourquoi ne cherchez-vous à l'exorciser du mauvais œil»?. , Chapitre III La récompense du malade",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1714
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "Ata Ibn Yassar a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Une fois qu'un homme tombe malade. Allah Y lui envoie deux anges, leur disant: «Allez voir, ce que Mon serviteur dit à ceux qui lui rendent visite; ainsi, si en les recevant, il loue Allah et L'exalte, les deux anges rapportent ses dires à Allah Y , à Lui la puissance et la gloire, bien qu'il en soit le plus informé. Et Allah dira: «Mon Serviteur, si Je le fais mourir, que Je le fasse entrer au paradis; et si Je le guéris, que Je lui change chair et sang en d'autres meilleurs; et que Je lui efface ses mauvaises actions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1715
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "Ourwa Ibn Al-Zoubair a rapporté qu'il a entendu Aicha, la femme du Prophète r (Sur lui la grâce et la paix d'Allah), dire: «L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) disait: «Tout croyant éprouvant une maladie quelconque, fût-ce même une piqûre d'épine, lui sera une sanction, ou même lui effacera ses péchés»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1716
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Celui pour qui Allah, veut du bien, Il lui fait éprouver une affliction quelconque»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1717
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "Yahia Ibn Sa'id a rapporté qu'un homme, du temps de l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) fut frappé par la mort. Un autre homme dit: «Que le bonheur lui soit accordé, il est mort sans souffrir d'une maladie». L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dit alors: «malheur à toi! Comment peux-tu savoir, que si Allah, lui avait fait éprouver une maladie, qu'il lui ait, par là, effacé toutes ses mauvaises actions». Chapitre IV Du refuge et de l'exorcisme au cours d'une maladie",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1718
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "Nafe' Ibn Joubair a rapporté que Osman Ibn Al-'As alla chez l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) et lui dit: «J'éprouve une douleur qui me fait sentir la mort». L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) lui répondit: «Passe ta main là où tu sens la douleur, par sept fois, et dis: «Je demande la puissance d'Allah, et son pouvoir contre ce que j'éprouve de douleur» \"ahou dhou bi ezzati 'llahi wa koudratihi min char ajidou\". Osman ajouta: «En disant cela. Allah m'a dissipé ma douleur, et étant tel je ne cesse de conseiller ma famille d'en faire pareillement»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1719
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "Aicha a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), s'il éprouvait un mal quelconque, il récitait sur lui même les deux sourates talismaniques et soufflait. Mais lorsque sa maladie s'aggravait, je récitais sur lui les deux sourates, puis je faisais passer, ma main droite, sur son corps, espérant avoir la grâce d'Allah»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1720
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "Amra Bint Abdul Rahman a rapporté que Abou Bakr Al Sid-diq était entré chez Aicha et la trouvait plaignante; une juive l'exorcisait, Abou Bakr lui dit: «exorcise-la selon le Livre d'Allah». Chapitre V Du traitement du malade",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1721
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "Zaid Ibn Aslam a rapporté qu'un homme, du temps de l'Env oyé d'Allah r (Sur lui la grâce et la paix d'Allah) était atteint d'une blessure où le sang a subi une congestion. Ainsi l'homme appela deux hommes de la tribu Ammar pour le soigner. Le regardant tous deux, ils prétendirent que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) leur avait dit: «lequel de vous est le plus compétent en médecine»? Alors ils lui répondirent: «Ô Envoyé d'Allah la médecine en a-t-elle du bien»? Zaid prétendit que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) leur a dit: «Celui qui en a descedu la maladie, a descendu les remèdes»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Isnaad Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1722
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "On rapporta à Yahia Ibn Sa'id que Sa'id Ibn Zourara, avait fait, du temps de l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) des cautérisations à cause d'une angine à la poitrine, ainsi il mourut»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1723
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "Nafe' a rapporté que Abdallah Ibn Omar s'est fait cautérisé à cause d'une paralysie faciale, et s'est exorcisé à cause d'une piqûre de scorpion». Chapitre VI Le fait de refroidir la fièvre par de l'eau",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1724
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "Fatima Bint Al-Mounzer a rapporté que toutes les fois qu'As-ma Bint Abi Bakr en recevait une femme atteinte d'une fièvre pour lui invoquer Allah, elle lui versait dans l'échancrure de sa chemise, de l'eau et disait:«l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) nous ordonnait de refroidir la fièvre par de l'eau»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1725
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "Hicham Ibn Ourwa a rapporté d'après son père que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «La fièvre est un jaillissement du feu de l'Enfer; refroidissez-la par de l'eau». (......) 17 - Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) Sur lui la grâce et la paix d'Allah a dit: «La fièvre est un jaillissement du feu de l'Enfer; éteignez-la par de l'eau». Chapitre VII De la visite du malade et de l'ornithomancie",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1726
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1727
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "Jaber Ibn Abdallah a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Si un homme visite un malade, c'est comme s'il plonge dans la miséricorde, de sorte que, s'il s'assied chez lui, cette miséricorde s'intégrera dans son for intérieur, ou même de ce qui est de pareil»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1728
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "Ibn Atia a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Pas de contagion, ni «hâma»1 ni «Safar»2. Il n'est pas toléré qu'un homme malade se mêle d'un homme sain, quant à ce dernier il peut être là où il veut»3. L'on demanda à l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) «Pourquoi donc cela»? Il répondit: «Car c'est du mal». (1) Hâma: oiseau qui selon la mythologie antéislamique, réclame vengeance pour la victime assassinée. L'on rapprochait le hâma de l'hibou dit «oiseau de mauvaise augure». (2) Safar à l'époque antéislamique, l'on faisait que le moifr-de Safar était au lieu du mouharram, un mois sacré. (3) Selon une autre version, l'on disait que celui qui a des chameaux malades ne devait pas les faire boire au même lieu que les chameaux sains; quant à ces derniers, il pouvaient être amenés n'importe où». MOUATTAA Au Nom d’Allah Le Clément Le Miséricordieux Livre 51 Le Livre des cheveux Chapitre Premier: La sounna suivie pour les cheveux",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1729
			}
		}
	]
}