{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"53": "Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "Zaid Ibn Aslâm a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Celui qui est sur sa monture salue le piéton; et si un homme d'un groupe salue, cela est suffisant»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1756
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "Mouhammad ibn Amr Ibn Ata a raconté: «J'étais assis chez Abdallah Ibn Abbas, un homme du Yemen entra et dit: «Que la paix d'Allah, soit sur vous, aussi, bien que Sa Miséricorde et Ses bénédictions», puis il ajouta quelques autres mots. Ibn Abbas, qui, ce temps là, était devenu aveugle, demanda: «qui est-ce? » - «C'est l'homme venant du Yemen qui te rend fréquemment visite», et on le lui décrit». Alors Ibn Abbas dit: «Le salut se termine aux bénédictions (à savoir au terme bénédictions). On demanda à Malek: «Peut-on saluer une femme»? «Quant à la vieille femme, je ne le répugne pas: mais pour une jeune, Je suis contre», répondit-il. Chapitre II Le salut fait pour un juif et pour un chrétien",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1757
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": 1758,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Lorsque l'un des juifs vous salue, il dit: «que la Sa'm(1) soit sur vous»; répondez-lui: «et sur toi»,. (1) Ce terme est pris au sens de la mort; en prononçant «le mot salam», le «l» est élidé, par le juif, voulant dire le contraire du mot «salam». - Yahia a rapporté qu'on a demandé à Malek, au sujet de celui qui salue un juif ou un Chrétien, si cela lui est nuisible»? - «Non, répondit Malek». Chapitre III Le salut en général",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1758
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "Abou Waqed Al-Laithi a rapporté: «Alors que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) était assis dans la mosquée en compagnie des fidèles, trois hommes entrèrent dont deux s'approchèrent de l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), quant au troisième, il quitta. Ainsi, en arrivant tout près de l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), l'un des deux, ayant trouvé, près de lui, une place vacante dans le cercle s'assit, quant à l'autre, il prit une place derrière eux, et le troisième partit. (son hadith), L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) terminant et dit: «Vous est ce que je vous raconte au sujet de ces trois hommes? Le premier s'est réfugié auprès d'Allah et Allah, le lui a assuré; le deuxième s'est montré honteux de s'approcher d'Allah et Allah l'a traité pareillement; quant au troisième, il s'est détourné d'Allah, et Allah s'est détourné de lui»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1759
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": 1760,
			"text": "Anas Ibn Malek a rapporté qu'il a entendu Omar Ibn Al-Khattab recevant le salut d'un homme et Omar de lui rendre, en lui demandant: «Comment te portes-tu»? Et l'homme de lui répondre: «Je loue Allah pour toi»; alors Omar lui dit: «C'est bien ce que j'ai voulu que tu me fasses entendre»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1760
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "Al-Toufail Ibn Abi Ka'b a rapporté qu'il se rendait chez Abdallah Ibn Omar, et l'accompagna au marché. Al-Toufail continua et dit aussitôt,; que nous sommes arrivé au marché, Abdallah Ibn Omar ne passa par un vendeur de camelote, ou un vendeur de bric à brac, ou un pauvre, ou quiconque sans les avoir salués. Un jour, j'allais chez Abdallah Ibn Omar, et il me demada de le suivre au marché; alors je lui dis: «Ainsi donc, que feras-tu au marché, et pourtant tu ne vends rien, ni demandes les prix des marchandises, ni marchandes, ni tu t'y arrêtes»? «Asseyons-nous ici, et lui dit nous nous y rendons, tout simplement pour le salut à savoir saluer ceux que nous rencontrions»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1761
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1762
			}
		}
	]
}