{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"54": "General Subjects"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1763,
			"arabicnumber": 1763,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1763
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": 1764,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1764
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": 1765,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1765
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": 1766,
			"text": "Abdallah Ibn Abi Bakr a rapporté d'après son père que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Si quelqu'un éternue et loue Allah», on répond: «Que Allah te fasse miséricorde», reprenant cela pour trois fois; mais à la quatrième, à lui dire: «Tu es enrhumé»! Et Abdallah Ibn Abi Bakr souligne: «Je ne sais s'il avait dit après la troisième ou la quatrième fois»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1766
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": 1767,
			"text": "Nafe' a rapporté que si Abdallah Ibn Omar éternuait et qu'on lui disait: «Que Allah te fasse miséricorde», il répondait: «Que Allah nous fasse à tous miséricorde, et qu'Il Y nous pardonne». Chapitre III Au sujet des figurines et des statues",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1767
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": 1768,
			"text": "Rafe' Ibn Ishac l'affranchi de Al-Chifà a raconté: «Nous avons rendu visite, Abdallah Ibn Abi Talha et moi à Abou Sa'id Al-Khoudri, lors de sa maladie, Abou Sa'id nous dit: «L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) nous a appris que les anges n'entrent pas dans une maison où se trouvent des figurines ou des statues». Le rapporteur se doutait du cas (à savoir figu -rines ou statues)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1768
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": 1769,
			"text": "Oubaidallah Ibn Abdallah Ibn Outba Ibn Mass'oud a rapporté qu'en rendant visite à Abou Talha Al-Ansari, lors de sa maladie, il y trouva chez lui Sahl Ibn Hounaif. Abou Talha demandant à un homme de tirer au-dessous de lui une tapisserie, Sahl Ibn Hounaif lui dit: «Pourquoi l'enlèves-tu»? Il lui répondit: «Parce qu'elle porte des dessins; or l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) l'a interdit, comme tu le sais». Sahl répliqua:«Mais l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) n'a-t-il pas précisé: «Sauf si c'est un dessin sur un vêtement»? Abou Talha, alors, dit: «Certes oui! mais ainsi j'en serai plus apaisé",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1769
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": 1770,
			"text": "Aicha, la femme du Prophète r (Sur lui la grâce et la paix d'Allah) a rapporté, qu'elle s'est achetée un coussin, renfermant des figures. Quand l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) vit le coussin, il se mit à la porte, et n'entra pas. Aicha continua et dit: «J'ai senti qu'il était mécontent», et je lui dis: «Ô Envoyé d'Allah, je reviens à Allah, et à Son Envoyé; quelle erreur, ai-je commise»? L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) lui répondit: «Pourquoi ce coussin»? Elle dit: «Je te l'ai acheté pour que tu t'assois dessus et que tu t'y accoudes». L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) répliqua: «Ceux qui font ces figures, seront, au jour de la résurrection, châtiés et on leur dira: «faites revivre ce que vous avez créé»; puis il ajouta: «La maison où se trouvent les figures, les anges ne l'y pénètrent pas». Chapitre IV Au sujet de la consommation du \"dab\"(1) (1) Une sorte de lézard",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1770
			}
		},
		{
			"hadithnumber": 1771,
			"arabicnumber": 1771,
			"text": "Soulaiman Ibn Yassar a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) alla en compagnie de Abdallah Ibn Abbas et Khaled Ibn al Walid, chez Maymouna Bint Al-Hareth, il y trouva des dabs avec leurs œufs. Il lui demanda: «Qui vous les a apportés»? Elle lui répondit: «C'est ma sœur Houzaila Bint Al-Hareth qui me les a offerts». Alors l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dit à Abdallah Ibn Al-Abbas et Khaled Ibn Al-Walid: «Mangez», et eux de lui répondre: «Et toi. Envoyé d'Allah n'en manges-tu pas»? Il leur répondit: «Non, car les anges d'Allah Y viennent souvent vers moi». Alors Maymouna lui demanda: «Bois-tu du lait de chez nous, Ô Envoyé d'Allah»? «Oui», répondit-il. Il but puis il lui demanda: «Qui vous l'a apporté»? Elle répondit: «C'est ma sœur Houzaila qui m'en a donné». Alors l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) lui dit: «Te rappelles-tu de l'esclave dont tu m'as parlé de son affranchissement; donne-la à ta sœur, entretenant par là, tes liens de proches avec elle; cela sera mieux pour toi»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1771
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": 1772,
			"text": "Khaled Ibn Al-Walid, Ibn Al-Moughira a rapporté qu'il est entré avec l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dans la maison de Maymouna, le femme du Prophète (Sur lui la grâce et la paix d'Allah) où l'on apporta un dab fard. L'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) le touchant de sa main; les femmes qui se trouvaient chez Maymouna s'écrièrent «dites à l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) ce qu'il va en manger». On lui dit: «c'est un dab, Ô Envoyé d'Allah». Alors il écarta sa main, je lui demandai: «Est-il interdit, Ô Envoyé d'Allah»? «Non, dit-il, mais cet animal ne vivant pas dans la terre de mon peuple, je sens le dégoût de le manger». Khaled ajouta: «Alors je le tirai; le mangeai, et l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) me regardait manger»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1772
			}
		},
		{
			"hadithnumber": 1773,
			"arabicnumber": 1773,
			"text": "Abdallah Ibn Omar a rapporté qu'un homme appela l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) et lui dit: «Ô Envoyé d'Allah, que dis-tu au sujet du dab»? Il répondit: «Je ne mange pas de sa chair et ne l'interdis pas». Chapitre V Au sujet des chiens",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1773
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": 1774,
			"text": "Al Saib Ibn Yazid a rapporté qu'il a entendu Soufian Ibn Abi Zouhair, qui d'ailleurs était un homme de la tribu Azdé-Chénoua, et qui encore était l'un des compagnons de l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), s'entretenir avec des gens, à la porte de la mosquée, leur disant: «J'ai entendu l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dire: «Celui qui élève un chien qui ne lui est utilite ni pour la garde, ni pour la plantation, aura diminué de ses travaux, chaque jour, un qirat (de récompense)». On lui demanda: «As-tu entendu l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) dire cela en personne»? Il répondit: «Oui; je le jure par le Seigneur de cette mosquée»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1774
			}
		},
		{
			"hadithnumber": 1775,
			"arabicnumber": 1775,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Celui qui élève un chien, qui n'est utile ni pour la chasse, ni pour la garde du troupeau, fera amoindrir, tous les jours, deux qirats (de récompense) de ses bonnes œuvres»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1775
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": 1776,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a ordonné de tuer les chiens». Chapitre VI Au sujet des moutons",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1776
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": 1777,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Le comble de l'incrédulité est vers l'orient, où l'on trouve l'orgueil et la présomption chez ceux qui possèdent les chevaux et les chameaux, distingués par leur rude voix et qui habitent les tentes en poils, et la tranquilité est chez les propriétaires de moutons»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1777
			}
		},
		{
			"hadithnumber": 1778,
			"arabicnumber": 1778,
			"text": "Abou Sa'id Al Khoudri a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Bientôt,la bonne fortune d'un musulman, sera la possession d'un troupeau de moutons qu'il mènera paître sur les sommets des montagnes et dans les endroits arrosés par la pluie, sauvegardant ainsi par sa fuite, sa religion, des troubles (qui éclateront)»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1778
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": 1779,
			"text": "Ibn Omar a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Il est défendu à chacun d'entre vous de traire les brebis d'un autre sans qu'il ait eu la permission de ce dernier. Est-ce que l'un de vous, aimerai qu'on entre par force dans sa maison, qu'on brise son armoire et qu'on lui vole sa nourriture? Ainsi donc, il en est le cas des brebis qui entassent dans leurs pis la nourriture de leur propriétaire. Alors, il n'est donc permis pas que l'un de vous traie les brebis d'un autre sans avoir sa permission». 1",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1779
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": 1780,
			"text": "On rapporta à Malek, que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Il n'y a pas un prophète qui n'ait pas mené de moutons au pâturage». On lui demanda: «Et toi aussi, ô Envoyé d'Allah»! il répondit:«Et moi aussi». Chapitre VII Au sujet d'une souris tombait dans la graisse et du fait de commencer à manger avant de prier",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1780
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": 1781,
			"text": "Nafe' a rapporté qu'il arrivait qu'on présentait à Ibn Omar son dîner chez lui, et qu'il s'était mis à l'écoute de la récitation de l'imam faisant la prière. Alors Ibn Omar ne quittait son repas avant qu'il n'en ait été rassasié»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1781
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": 1782,
			"text": "Maymouna, la femme du Prophète (Sur lui la grâce et la paix d'Allah) a rapporté, que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), questionné au sujet d'une souris qui était tombée dans la graisse, il répondit: «Enlevez-la, puis jetez la quantité de graisse, tout autour de la place où elle fut tombée». Chapitre VIII De la malchance qu'on a à craindre",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1782
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "Sahl Ibn Sa'd Al-Sa'idi a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Si la malchance existe (elle sera à craindre) dans le cheval, la femme, et la maison»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1783
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «La malchance est dans une maison, ou une femme, ou un cheval»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1784
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "Yahia Ibn Sa'id a rapporté qu'une femme vint auprès de l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) et lui dit: «Ô Envoyé d'Allah,! Nous avons habité une maison, et nous étions nombreux et nous avions une fortune abondante; peu après le nombre a diminué, et la fortune est perdue». L'Envoyé d'Allah (Sur lui la grâce et la paix d'Allah) lui dit: «Quittez cette maison, car elle est de mauvaise augure». Chapitre IX Des noms qui sont répugnants",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1785
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "Yahia Ibn Sa'id a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit aux hommes: «Qui donc veut traire cette chamelle laitière»? Un homme se leva, l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) lui demanda: «Quel est ton nom»? «Mourra (qui signifie «amer), lui répondit-il»;«Assis-toi, lui dit l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah). Reprenant la même question, un autre homme, du nom «Harb» (qui signifie «guerre»). se leva; et l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) lui dit: «assis-toi»; il posa pour la troisième fois, la question, un homme se leva, et répondant que son nom est «Ya'ich» (qui signifie «vivant») , l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) lui dit: «Va traire la chamelle»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1786
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "Yahia Ibn Sa'id a rapporté que Omar Ibn Al-Khattab demanda à un homme: «quel est ton nom»? - «Jamra» (qui signifie braise) lui répondit-il; - «Qui est ton père», ajouta Omar; - «Ibn Chéhab» (qui signifie une flamme.); «De quelle tribu es-tu»? - «De Al-Houraqa» (qui signifie brûlant.)- «où habites-tu»? - «A Harrat-el-Nar» (qui signifie chaleur du feu) - «C'est où»? «A Zat-Liza» (qui signifie feu brûlant) -. «Et Omar de s'écrier: «vas-y voir tes parents, qui sont brûlés». En effet, ses parents furent brûlés, tel que Omar l'avait prédit». Chapitre X La saignée et du salaire du soignant",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1787
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "Anas Ibn Malek a rapporté que Abou Taiba, avait fait des saignées à l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah), il lui ordonna de lui faire le don d'un sa'de dattes, comme salaire, aussi l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) ordonna au maître (de Abou Taiba qui était un esclave) de lui faire remise de son tribut»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1788
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "On rapporta à Malek que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «S'il y a un remède qui peut guérir une maladie, la saignée pourra y remèdier)»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1789
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "Ibn Chéhab a rapporté que Ibn Mouhaissa Al-Ansari qui était un de la tribu Haritha, avait demandé d'avoir l'autorisation de l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) afin qu'il ait un salaire, à l'égard du soin des saignées; mais l'Envoyé d'Allah (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) le lui interdisant, et Ibn Mouhaissa ne cessant de le lui demander, il lui dit: «donne ce salaire à ton esclave». Chapitre XI En ce qui concerne l'Orient",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1790
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": 1791,
			"text": "Abdallah Ibn Omar a rapporté: «J'ai vu l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) faisant signe de sa main vers l'orient, et disait: «Là; les troubles viendront de là. Les troubles viendront de là, de là se lèvent les cornes du diable»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1791
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "On rapporta à Malek que Omar Ibn Al-Khattab, voulant partir vers l'Irak, Ka'b Al-Ahbar lui dit: «N'y vas pas, ô prince des croyants, car il y a les neuf-dixième de la sorcellerie, les génies pervers et la maladie inguérissable». Chapitre XII Du fait de tuer les serpents et de ce qui est dit à leur sujet",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1792
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": 1793,
			"text": "Abou Loubaba a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a défendu que l'on tue les serpents vivant dans les maisons»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1793
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "Saiba, une affranchie de Aicha a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a défendu que l'on tue les serpents vivant dans les maisons sauf ceux qui ont deux rayures au dos, et la couleuvre, car ils peuvent causer la cécité, et l'avortement des femmes enceintes",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1794
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "Abou Saib, l'affranchi de Hicham Ibn Zouhra a rapporté: «J'entrais chez Abou Sa'id Al Khoudri, et je le trouvais dans la prière, je m'assieds, en attendant qu'il finisse sa prière. J'entendis un mouvement sous un lit dans sa maison, et ce fut un serpent; je me levai pour le tuer quand Abou Sa'id me fit signe de m'asseoir. Puis terminant (sa prière) il me montra de sa main une maison et dit: «vois-tu cette maison»? - «oui, répondis-je». Et lui de reprendre: «il y avait un jeune homme tout nouvellement marié, qui était sorti avec l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) participant ainsi à la bataille de «Khandaq». Alors qu'il était présent, un jeune homme vint lui dire: «ô Envoyé d'Allah permets moi de revenir chez moi, car je suis nouvellement marié». L'Envoyé d'Allah r (salallahou alayhi wa salam), le lui accorda, il lui dit: «Prends ton arme avec toi car je crains que tu ne rencontres les Bani Kouraiza». Ainsi, en revenant chez lui, le jeune homme trouva sa femme debout entre deux portes; pris de jalousie, il voulait la transpercer de sa lance, elle lui dit: «Ne te hâte pas pour me tuer; entre et regarde ce qu'il y a dans ta maison».En entrant, il vit un serpent enroulé sur son lit; il le fixa du bout de sa lance puis le porta au seuil de la porte. Le serpent remuant toujours au bout de la lance, morda l'homme qui tomba mort. Nous ne savions pas qui fut le premier à mourir, l'homme ou le serpent. On rapporta ceci à l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) il dit: «à Médine, il y a des génies qui sont devenus musulmans; ainsi si vous en rencontrez un, donnez-lui un délai de trois jours; une fois qu'il paraîtra après ce délai; tuez-le, car il n'est que le diable». Chapitre XIII Les invocations lors d'un voyage",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1795
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "On rapporta à Malek que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) quand il voulait voyager et en mettant le pied dans l'étrier, il disait: «Au nom d'Allah! Grand Allah! Tu es le compagnon du voyage, et le successeur en famille. Grand Allah! Réduits-nous la distance, et facilite-nous le voyage. Grand Allah! Je me réfugie auprès de Toi contre la peine du voyage, et la tristesse du retour, et la mauvaise rencontre des biens et de la famille»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1796
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "Des hommes en qui Malek avait confiance, lui ont dit que Khawla Bint Hakim a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Celui qui, se déplace d'un lieu à un autre, qu'il dise: «Je demande par les parfaites paroles d'Allah, de me réfugier contre le mal de ce qu'il a créé. Par conséquent, il ne sera atteintt de rien jusqu'à ce qu'il quitte ce lieu». Chapitre XIV Sur le fait de voyager seul par l'homme ou par la femme",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1797
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "Amr Ibn Chou'aib a rapporté d'après son père, d'après son grand-père que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Un voyageur seul est un diable (1); deux voyageurs sont deux diables, et les trois, un convoi». (1) Notons, que nous entendons dire par «diable», œmparé à celui qui voyage seul, que ce dernier peut en être victime d'une distraction, ou même souffrant d'une peine... Ainsi, mieux vaut qu'au cours d'un voyage, qu'il y est plusieurs à voyager ensemble",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1798
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "Sa'id Ibn Al Moussaiab rapportait fréquemment que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Le diable peut s'en prendre à un ou à deux voyageurs; mais s'il sont trois, il ne pourra rien faire»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1799
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «I n'est pas agréé à une femme croyant en Allah Y et au jour de la résurrection de voyager seule pour une journée (nuit et jour) sans qu'elle soit accompagnée d'un Zou-Mahram (un homme d'avec qui son mariage est illicite). Chapitre XV De ce que l'on doit faire au cours d'un voyage",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1800
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "Khaled Ibn Ma'dan a rapporté ce hadith, qu'il a attribué à l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) où il est dit: «Allah Y Béni et Très-Haut est clément et aime la clémence, et en est satisfait. Il aide les cléments et non les violents. Ainsi, lorsque vous montez ces bêtes muettes, laissez-les dans les milieux convenables. Or si la terre est stérile, fuyez-la en la traversant d'une façon accélérée, et voyagez la nuit, car la terre que l'on traverse la nuit paraît plus courte que lorsqu'on la traverse le jour. Gardez-vous de camper la nuit, dans une voie publique parce que de telles voies sont traversées par les bêtes, et sont des refuges pour les serpents»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1801
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Le voyage est l'un des aspects de la torture, où l'un de vous s'empêche de dormir, de manger et de boire. Une fois que l'un de vous a terminé ses affaires, qu'il se hâte de retourner chez sa famille». Chapitre XVI Le fait de traiter l'esclave avec clémence",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1802
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "Abou Houraira a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «L'on doit convenablement nourir et vêtir l'esclave, sans qu'on le charge d'un travail qui lui soit insupportable»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1803
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "On rapporta à Malek que Omar Ibn Al-Khattab allait tous les samedis à «Al-Awali» (bourgs entourant Médine) - y trouvant là un esclave chargé d'un travail insupportable, il le lui allégeait»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1804
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "Abou Souhail Ibn Malek a rapporté d'après son père qu'il a entendu Osman Ibn Affan faire un sermon et dire: «Ne chargez pas une esclave, de gagner de l'argent, si elle n'a pas une profession, Car si vous l'en chargez, elle s'adonnera à la prostitution. De même, ne chargez pas l'enfant d'un travail, car s'il ne va pas en gagner, il volera. Ainsi, ne laissez donc ni l'esclave, ni le petit, travailler, et Allah vous comblera de ses bienfaits. Et nourrissez les correctement». Chapitre XVII Au sujet de l'esclave et de sa récompense",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1805
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "Abdallah Ibn Omar a rapporté que l'Envoyé d'Allah r (salallahou alayhi wa salam) (Sur lui la grâce et la paix d'Allah) a dit: «Si l'esclave donne de bons conseils à son maître, et s'il adore sincèrement Allah, il aura une double récompense»",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1806
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "On rapporta à Malek qu'une esclave possédée par Abdallah Ibn Omar Ibn Al-Khattab, a été vue par Omar Ibn Al-Khattab,se comportant et paraissant tout comme une femme libre. Il entra chez sa fille Hafsa et lui dit: «Pourquoi donc l'esclave de ton frère se comporte et apparaît comme une femme libre, fréquentant les gens»? Omar, par conséquent, désavoua sa façon d'agir». MOUATTAA Au Nom d’Allah Le Clément Le Miséricordieux Livre 55 Le Livre de l'allégeance Chapitre Premier: Au sujet de l'allégeance",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1807
			}
		}
	]
}