{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1354,
			"arabicnumber": 1354,
			"text": "Narrated Ibn `Umar:`Umar set out along with the Prophet (p.b.u.h) with a group of people to Ibn Saiyad till they saw him playing with the boys near the hillocks of Bani Mughala. Ibn Saiyad at that time was nearing his puberty and did not notice (us) until the Prophet (ﷺ) stroked him with his hand and said to him, \"Do you testify that I am Allah's Messenger (ﷺ)?\" Ibn Saiyad looked at him and said, \"I testify that you are the Messenger of illiterates.\" Then Ibn Saiyad asked the Prophet (p.b.u.h), \"Do you testify that I am Allah's Messenger (ﷺ)?\" The Prophet (p.b.u.h) refuted it and said, \"I believe in Allah and His Apostles.\" Then he said (to Ibn Saiyad), \"What do you think?\" Ibn Saiyad answered, \"True people and liars visit me.\" The Prophet (ﷺ) said, \"You have been confused as to this matter.\" Then the Prophet (ﷺ) said to him, \"I have kept something (in my mind) for you, (can you tell me that?)\" Ibn Saiyad said, \"It is Al-Dukh (the smoke).\" (2) The Prophet (ﷺ) said, \"Let you be in ignominy. You cannot cross your limits.\" On that `Umar, said, \"O Allah's Messenger (ﷺ)! Allow me to chop his head off.\" The Prophet (p.b.u.h) said, \"If he is he (i.e. Dajjal), then you cannot overpower him, and if he is not, then there is no use of murdering him.\" (Ibn `Umar added): Later on Allah's Messenger (ﷺ) (p.b.u.h) once again went along with Ubai bin Ka`b to the date-palm trees (garden) where Ibn Saiyad was staying. The Prophet (p.b.u.h) wanted to hear something from Ibn Saiyad before Ibn Saiyad could see him, and the Prophet (p.b.u.h) saw him lying covered with a sheet and from where his murmurs were heard. Ibn Saiyad's mother saw Allah's Apostle while he was hiding himself behind the trunks of the date-palm trees. She addressed Ibn Saiyad, \"O Saf ! (and this was the name of Ibn Saiyad) Here is Muhammad.\" And with that Ibn Saiyad got up. The Prophet (ﷺ) said, \"Had this woman left him (Had she not disturbed him), then Ibn Saiyad would have revealed the reality of his case",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}