{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"24": "Obligatory Charity Tax (Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1454,
			"arabicnumber": 1454,
			"text": "Narrated Anas:When Abu Bakr; sent me to (collect the Zakat from) Bahrain, he wrote to me the following:-- (In the name of Allah, the Beneficent, the Merciful). These are the orders for compulsory charity (Zakat) which Allah's Messenger (ﷺ) had made obligatory for every Muslim, and which Allah had ordered His Apostle to observe: Whoever amongst the Muslims is asked to pay Zakat accordingly, he should pay it (to the Zakat collector) and whoever is asked more than that (what is specified in this script) he should not pay it; for twenty-four camels or less, sheep are to be paid as Zakat; for every five camels one sheep is to be paid, and if there are between twenty-five to thirty-five camels, one Bint Makhad is to be paid; and if they are between thirty-six to forty-five (camels), one Bint Labun is to be paid; and if they are between forty-six to sixty (camels), one Hiqqa is to be paid; and if the number is between sixty-one to seventy-five (camels), one Jadha is to be paid; and if the number is between seventy-six to ninety (camels), two Bint Labuns are to be paid; and if they are from ninety-one to one-hundredand twenty (camels), two Hiqqas are to be paid; and if they are over one-hundred and-twenty (camels), for every forty (over one-hundred-and-twenty) one Bint Labun is to be paid, and for every fifty camels (over one-hundred-and-twenty) one Hiqqa is to be paid; and who ever has got only four camels, has to pay nothing as Zakat, but if the owner of these four camels wants to give something, he can. If the number of camels increases to five, the owner has to pay one sheep as Zakat. As regards the Zakat for the (flock) of sheep; if they are between forty and one-hundred-and-twenty sheep, one sheep is to be paid; and if they are between one-hundred-and-twenty to two hundred (sheep), two sheep are to be paid; and if they are between two-hundred to three-hundred (sheep), three sheep are to be paid; and for over three-hundred sheep, for every extra hundred sheep, one sheep is to be paid as Zakat. And if somebody has got less than forty sheep, no Zakat is required, but if he wants to give, he can. For silver the Zakat is one-fortieth of the lot (i.e. 2.5%), and if its value is less than two-hundred Dirhams, Zakat is not required, but if the owner wants to pay he can",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 57
			}
		}
	]
}