{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1691,
			"arabicnumber": 1691,
			"text": "Narrated Ibn `Umar:During the last Hajj (Hajj-al-Wada`) of Allah's Messenger (ﷺ) he performed `Umra and Hajj. He drove a Hadi along with him from Dhul-Hulaifa. Allah's Messenger (ﷺ) started by assuming Ihram for `Umra and Hajj. And the people, too, performed the `Umra and Hajj along with the Prophet. Some of them brought the Hadi and drove it along with them, while the others did not. So, when the Prophet (ﷺ) arrived at Mecca. he said to the people, \"Whoever among you has driven the Hadi, should not finish his Ihram till he completes his Hajj. And whoever among you has not (driven) the Hadi with him, should perform Tawaf of the Ka`ba and the Tawaf between Safa and Marwa, then cut short his hair and finish his Ihram, and should later assume Ihram for Hajj; but he must offer a Hadi (sacrifice); and if anyone cannot afford a Hadi, he should fast for three days during the Hajj and seven days when he returns home. The Prophet (ﷺ) performed Tawaf of the Ka`ba on his arrival (at Mecca); he touched the (Black Stone) corner first of all and then did Ramal (fast walking with moving of the shoulders) during the first three rounds round the Ka`ba, and during the last four rounds he walked. After finishing Tawaf of the Ka`ba, he offered a two rak`at prayer at Maqam Ibrahim, and after finishing the prayer he went to Safa and Marwa and performed seven rounds of Tawaf between them and did not do any deed forbidden because of Ihram, till he finished all the ceremonies of his Hajj and sacrificed his Hadi on the day of Nahr (10th day of Dhul-Hijja). He then hastened onwards (to Mecca) and performed Tawaf of the Ka`ba and then everything that was forbidden because of Ihram became permissible. Those who took and drove the Hadi with them did the same as Allah's Messenger (ﷺ) did",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 170
			}
		}
	]
}