{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"34": "Sales and Trade"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2217,
			"arabicnumber": 2217,
			"text": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"The Prophet (ﷺ) Abraham emigrated with Sarah and entered a village where there was a king or a tyrant. (The king) was told that Abraham had entered (the village) accompanied by a woman who was one of the most charming women. So, the king sent for Abraham and asked, 'O Abraham! Who is this lady accompanying you?' Abraham replied, 'She is my sister (i.e. in religion).' Then Abraham returned to her and said, 'Do not contradict my statement, for I have informed them that you are my sister. By Allah, there are no true believers on this land except you and 1.' Then Abraham sent her to the king. When the king got to her, she got up and performed ablution, prayed and said, 'O Allah! If I have believed in You and Your Apostle, and have saved my private parts from everybody except my husband, then please do not let this pagan overpower me.' On that the king fell in a mood of agitation and started moving his legs. Seeing the condition of the king, Sarah said, 'O Allah! If he should die, the people will say that I have killed him.' The king regained his power, and proceeded towards her but she got up again and performed ablution, prayed and said, 'O Allah! If I have believed in You and Your Apostle and have kept my private parts safe from all except my husband, then please do not let this pagan overpower me.' The king again fell in a mood of agitation and started moving his legs. On seeing that state of the king, Sarah said, 'O Allah! If he should die, the people will say that I have killed him.' The king got either two or three attacks, and after recovering from the last attack he said, 'By Allah! You have sent a satan to me. Take her to Abraham and give her Ajar.' So she came back to Abraham and said, 'Allah humiliated the pagan and gave us a slave-girl for service",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 164
			}
		}
	]
}