{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"37": "Hiring"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2276,
			"arabicnumber": 2276,
			"text": "Narrated Abu Sa`id:Some of the companions of the Prophet (ﷺ) went on a journey till they reached some of the 'Arab tribes (at night). They asked the latter to treat them as their guests but they refused. The chief of that tribe was then bitten by a snake (or stung by a scorpion) and they tried their best to cure him but in vain. Some of them said (to the others), \"Nothing has benefited him, will you go to the people who resided here at night, it may be that some of them might possess something (as treatment),\" They went to the group of the companions (of the Prophet (ﷺ) ) and said, \"Our chief has been bitten by a snake (or stung by a scorpion) and we have tried everything but he has not benefited. Have you got anything (useful)?\" One of them replied, \"Yes, by Allah! I can recite a Ruqya, but as you have refused to accept us as your guests, I will not recite the Ruqya for you unless you fix for us some wages for it.\" They agrees to pay them a flock of sheep. One of them then went and recited (Surat-ul-Fatiha): 'All the praises are for the Lord of the Worlds' and puffed over the chief who became all right as if he was released from a chain, and got up and started walking, showing no signs of sickness. They paid them what they agreed to pay. Some of them (i.e. the companions) then suggested to divide their earnings among themselves, but the one who performed the recitation said, \"Do not divide them till we go to the Prophet (ﷺ) and narrate the whole story to him, and wait for his order.\" So, they went to Allah's Messenger (ﷺ) and narrated the story. Allah's Messenger (ﷺ) asked, \"How did you come to know that Suratul- Fatiha was recited as Ruqya?\" Then he added, \"You have done the right thing. Divide (what you have earned) and assign a share for me as well.\" The Prophet (ﷺ) smiled thereupon",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		}
	]
}