{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2405,
			"arabicnumber": 2405,
			"text": "Narrated Jabir:When `Abdullah (my father) died, he left behind children and debts. I asked the lenders to put down some of his debt, but they refused, so I went to the Prophet (ﷺ) to intercede with them, yet they refused. The Prophet (ﷺ) said (to me), \"Classify your dates into their different kinds: 'Adha bin Zaid, Lean and 'Ajwa, each kind alone and call all the creditors and wait till I come to you.\" I did so and the Prophet (ﷺ) came and sat beside the dates and started measuring to each his due till he paid them fully, and the amount of dates remained as it was before, as if he had not touched them. (On another occasion) I took part in one of Ghazawat among with the Prophet (ﷺ) and I was riding one of our camels. The camel got tired and was lagging behind the others. The Prophet (ﷺ) hit it on its back. He said, \"Sell it to me, and you have the right to ride it till Medina.'' When we approached Medina, I took the permission from the Prophet (ﷺ) to go to my house, saying, \"O Allah's Messenger (ﷺ)! I have newly married.\" The Prophet (ﷺ) asked, \"Have you married a virgin or a matron (a widow or divorcee)?\" I said, \"I have married a matron, as `Abdullah (my father) died and left behind daughters small in their ages, so I married a matron who may teach them and bring them up with good manners.\" The Prophet (ﷺ) then said (to me), \"Go to your family.\" When I went there and told my maternal uncle about the selling of the camel, he admonished me for it. On that I told him about its slowness and exhaustion and about what the Prophet (ﷺ) had done to the camel and his hitting it. When the Prophet (ﷺ) arrived, I went to him with the camel in the morning and he gave me its price, the camel itself, and my share from the war booty as he gave the other people",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}