{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"47": "Partnership"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2494,
			"arabicnumber": 2494,
			"text": "Narrated `Urwa bin Az-Zubair:That he had asked `Aisha about the meaning of the Statement of Allah: \"If you fear that you shall not Be able to deal justly With the orphan girls, then Marry (Other) women of your choice Two or three or four.\" (4.3) She said, \"O my nephew! This is about the orphan girl who lives with her guardian and shares his property. Her wealth and beauty may tempt him to marry her without giving her an adequate Mahr (bridal-money) which might have been given by another suitor. So, such guardians were forbidden to marry such orphan girls unless they treated them justly and gave them the most suitable Mahr; otherwise they were ordered to marry any other woman.\" `Aisha further said, \"After that verse the people again asked the Prophet (about the marriage with orphan 'girls), so Allah revealed the following verses:-- 'They ask your instruction Concerning the women. Say: Allah Instructs you about them And about what is Recited unto you In the Book, concerning The orphan girls to whom You give not the prescribed portions and yet whom you Desire to marry...\" (4.127) What is meant by Allah's Saying:-- 'And about what is Recited unto you is the former verse which goes:-- 'If you fear that you shall not Be able to deal justly With the orphan girls, then Marry (other) women of your choice.' (4.3) `Aisha said, \"Allah's saying in the other verse:--'Yet whom you desire to marry' (4.127) means the desire of the guardian to marry an orphan girl under his supervision when she has not much property or beauty (in which case he should treat her justly). The guardians were forbidden to marry their orphan girls possessing property and beauty without being just to them, as they generally refrain from marrying them (when they are neither beautiful nor wealthy)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 12
			}
		}
	]
}