{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"52": "Witnesses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2661,
			"arabicnumber": 2661,
			"text": "Narrated Aisha:(the wife of the Prophet) \"Whenever Allah's Messenger (ﷺ) intended to go on a journey, he would draw lots amongst his wives and would take with him the one upon whom the lot fell. During a Ghazwa of his, he drew lots amongst us and the lot fell upon me, and I proceeded with him after Allah had decreed the use of the veil by women. I was carried in a Howdah (on the camel) and dismounted while still in it. When Allah's Messenger (ﷺ) was through with his Ghazwa and returned home, and we approached the city of Medina, Allah's Messenger (ﷺ) ordered us to proceed at night. When the order of setting off was given, I walked till I was past the army to answer the call of nature. After finishing I returned (to the camp) to depart (with the others) and suddenly realized that my necklace over my chest was missing. So, I returned to look for it and was delayed because of that. The people who used to carry me on the camel, came to my Howdah and put it on the back of the camel, thinking that I was in it, as, at that time, women were light in weight, and thin and lean, and did not use to eat much. So, those people did not feel the difference in the heaviness of the Howdah while lifting it, and they put it over the camel. At that time I was a young lady. They set the camel moving and proceeded on. I found my necklace after the army had gone, and came to their camp to find nobody. So, I went to the place where I used to stay, thinking that they would discover my absence and come back in my search. While in that state, I felt sleepy and slept. Safwan bin Mu'attal As-Sulami Adh-Dhakwani was behind the army and reached my abode in the morning. When he saw a sleeping person, he came to me, and he used to see me before veiling. So, I got up when I heard him saying, \"Inna lil-lah-wa inn a ilaihi rajiun (We are for Allah, and we will return to Him).\" He made his camel knell down. He got down from his camel, and put his leg on the front legs of the camel and then I rode and sat over it. Safwan set out walking, leading the camel by the rope till we reached the army who had halted to take rest at midday. Then whoever was meant for destruction, fell into destruction, (some people accused me falsely) and the leader of the false accusers was `Abdullah bin Ubai bin Salul. After that we returned to Medina, and I became ill for one month while the people were spreading the forged statements of the false accusers. I was feeling during my ailment as if I were not receiving the usual kindness from the Prophet (ﷺ) which I used to receive from him when I got sick. But he would come, greet and say, 'How is that (girl)?' I did not know anything of what was going on till I recovered from my ailment and went out with Um Mistah to the Manasi where we used to answer the call of nature, and we used not to go to answer the call of nature except from night to night and that was before we had lavatories near to our houses. And this habit of ours was similar to the habit of the old 'Arabs in the open country (or away from houses). So. I and Um Mistah bint Ruhm went out walking. Um Mistah stumbled because of her long dress and on that she said, 'Let Mistah be ruined.' I said, 'You are saying a bad word. Why are you abusing a man who took part in (the battle of) Badr?' She said, 'O Hanata (you there) didn't you hear what they said?' Then she told me the rumors of the false accusers. My sickness was aggravated, and when I returned home, Allah's Messenger (ﷺ) came to me, and after greeting he said, 'How is that (girl)?' I requested him to allow me to go to my parents. I wanted then to be sure of the news through them I Allah's Messenger (ﷺ) allowed me, and I went to my parents and asked my mother, 'What are the people talking about?' She said, 'O my daughter! Don't worry much about this matter. By Allah, never is there a charming woman loved by her husband who has other wives, but the women would forge false news about her.' I said, 'Glorified be Allah! Are the people really taking of this matter?' That night I kept on weeping and could not sleep till morning. In the morning Allah's Messenger (ﷺ) called `Ali bin Abu Talib and Usama bin Zaid when he saw the Divine Inspiration delayed, to consul them about divorcing his wife (i.e. `Aisha). Usama bin Zaid said what he knew of the good reputation of his wives and added, 'O Allah's Messenger (ﷺ)! Keep you wife, for, by Allah, we know nothing about her but good.' `Ali bin Abu Talib said, 'O Allah's Messenger (ﷺ)! Allah has no imposed restrictions on you, and there are many women other than she, yet you may ask the woman-servant who will tell you the truth.' On that Allah's Messenger (ﷺ) called Barirah and said, 'O Barirah. Did you ever see anything which roused your suspicions about her?' Barirah said, 'No, by Allah Who has sent you with the Truth, I have never seen in her anything faulty except that she is a girl of immature age, who sometimes sleeps and leaves the dough for the goats to eat.' On that day Allah's Messenger (ﷺ) ascended the pulpit and requested that somebody support him in punishing `Abdullah bin Ubai bin Salul. Allah's Apostle said, 'Who will support me to punish that person (`Abdullah bin Ubai bin Salul) who has hurt me by slandering the reputation of my family? By Allah, I know nothing about my family but good, and they have accused a person about whom I know nothing except good, and he never entered my house except in my company.' Sa`d bin Mu`adh got up and said, 'O Allah's Messenger (ﷺ)! by Allah, I will relieve you from him. If that man is from the tribe of the Aus, then we will chop his head off, and if he is from our brothers, the Khazraj, then order us, and we will fulfill your order.' On that Sa`d bin 'Ubada, the chief of the Khazraj and before this incident, he had been a pious man, got up, motivated by his zeal for his tribe and said, 'By Allah, you have told a lie; you cannot kill him, and you will never be able to kill him.' On that Usaid bin Al-Hadir got up and said (to Sa`d bin 'Ubada), 'By Allah! you are a liar. By Allah, we will kill him; and you are a hypocrite, defending the hypocrites.' On this the two tribes of Aus and Khazraj got excited and were about to fight each other, while Allah's Messenger (ﷺ) was standing on the pulpit. He got down and quieted them till they became silent and he kept quiet. On that day I kept on weeping so much so that neither did my tears stop, nor could I sleep. In the morning my parents were with me and I had wept for two nights and a day, till I thought my liver would burst from weeping. While they were sitting with me and I was weeping, an Ansari woman asked my permission to enter, and I allowed her to come in. She sat down and started weeping with me. While we were in this state, Allah's Messenger (ﷺ) came and sat down and he had never sat with me since the day they forged the accusation. No revelation regarding my case came to him for a month. He recited Tashah-hud (i.e. None has the right to be worshipped but Allah and Muhammad is His Apostle) and then said, 'O `Aisha! I have been informed such-and-such about you; if you are innocent, then Allah will soon reveal your innocence, and if you have committed a sin, then repent to Allah and ask Him to forgive you, for when a person confesses his sin and asks Allah for forgiveness, Allah accepts his repentance.' When Allah's Messenger (ﷺ) finished his speech my tears ceased completely and there remained not even a single drop of it. I requested my father to reply to Allah's Messenger (ﷺ) on my behalf. My father said, By Allah, I do not know what to say to Allah's Messenger (ﷺ).' I said to my mother, 'Talk to Allah's Messenger (ﷺ) on my behalf.' She said, 'By Allah, I do not know what to say to Allah's Apostle. I was a young girl and did not have much knowledge of the Qur'an. I said. 'I know, by Allah, that you have listened to what people are saying and that has been planted in your minds and you have taken it as a truth. Now, if I told you that I am innocent and Allah knows that I am innocent, you would not believe me and if I confessed to you falsely that I am guilty, and Allah knows that I am innocent you would believe me. By Allah, I don't compare my situation with you except to the situation of Joseph's father (i.e. Jacob) who said, 'So (for me) patience is most fitting against that which you assert and it is Allah (Alone) whose help can be sought.' Then I turned to the other side of my bed hoping that Allah would prove my innocence. By Allah I never thought that Allah would reveal Divine Inspiration in my case, as I considered myself too inferior to be talked of in the Holy Qur'an. I had hoped that Allah's Messenger (ﷺ) might have a dream in which Allah would prove my innocence. By Allah, Allah's Apostle had not got up and nobody had left the house before the Divine Inspiration came to Allah's Apostle. So, there overtook him the same state which used to overtake him, (when he used to have, on being inspired divinely). He was sweating so much so that the drops of the sweat were dropping like pearls though it was a (cold) wintry day. When that state of Allah's Messenger (ﷺ) was over, he was smiling and the first word he said, `Aisha! Thank Allah, for Allah has declared your innocence.' My mother told me to go to Allah's Messenger (ﷺ) . I replied, 'By Allah I will not go to him and will not thank but Allah.' So Allah revealed: \"Verily! They who spread the slander are a gang among you . . .\" (24.11) When Allah gave the declaration of my Innocence, Abu Bakr, who used to provide for Mistah bin Uthatha for he was his relative, said, 'By Allah, I will never provide Mistah with anything because of what he said about Aisha.' But Allah later revealed: -- \"And let not those who are good and wealthy among you swear not to help their kinsmen, those in need and those who left their homes in Allah's Cause. Let them forgive and overlook. Do you not wish that Allah should forgive you? Verily! Allah is Oft-forgiving, Most Merciful.\" (24.22) After that Abu Bakr said, 'Yes ! By Allah! I like that Allah should forgive me,' and resumed helping Mistah whom he used to help before. Allah's Messenger (ﷺ) also asked Zainab bint Jahsh (i.e. the Prophet's wife about me saying, 'What do you know and what did you see?' She replied, 'O Allah's Messenger (ﷺ)! I refrain to claim hearing or seeing what I have not heard or seen. By Allah, I know nothing except goodness about Aisha.\" Aisha further added \"Zainab was competing with me (in her beauty and the Prophet's love), yet Allah protected her (from being malicious), for she had piety",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 25
			}
		}
	]
}