{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "Narrated Sahl bin Sa`d As-Sa`idi:Allah's Messenger (ﷺ) and the pagans faced each other and started fighting. When Allah's Messenger (ﷺ) returned to his camp and when the pagans returned to their camp, somebody talked about a man amongst the companions of Allah's Messenger (ﷺ) who would follow and kill with his sword any pagan going alone. He said, \"Nobody did his job (i.e. fighting) so properly today as that man.\" Allah's Messenger (ﷺ) said, \"Indeed, he is amongst the people of the (Hell) Fire.\" A man amongst the people said, \"I shall accompany him (to watch what he does)\" Thus he accompanied him, and wherever he stood, he would stand with him, and wherever he ran, he would run with him. Then the (brave) man got wounded seriously and he decided to bring about his death quickly. He planted the blade of the sword in the ground directing its sharp end towards his chest between his two breasts. Then he leaned on the sword and killed himself. The other man came to Allah's Messenger (ﷺ) and said, \"I testify that you are Allah's Messenger (ﷺ).\" The Prophet (ﷺ) asked, \"What has happened?\" He replied, \"(It is about) the man whom you had described as one of the people of the (Hell) Fire. The people were greatly surprised at what you said, and I said, 'I will find out his reality for you.' So, I came out seeking him. He got severely wounded, and hastened to die by slanting the blade of his sword in the ground directing its sharp end towards his chest between his two breasts. Then he eased on his sword and killed himself.\" when Allah's Messenger (ﷺ) said, \"A man may seem to the people as if he were practising the deeds of the people of Paradise while in fact he is from the people of the Hell) Fire, another may seem to the people as if he were practicing the deeds of the people of Hell (Fire), while in fact he is from the people of Paradise",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 112
			}
		}
	]
}