{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3091,
			"arabicnumber": 3091,
			"text": "Narrated `Ali:I got a she-camel in my share of the war booty on the day (of the battle) of Badr, and the Prophet (ﷺ) had given me a she-camel from the Khumus. When I intended to marry Fatima, the daughter of Allah's Apostle, I had an appointment with a goldsmith from the tribe of Bani Qainuqa' to go with me to bring Idhkhir (i.e. grass of pleasant smell) and sell it to the goldsmiths and spend its price on my wedding party. I was collecting for my she-camels equipment of saddles, sacks and ropes while my two shecamels were kneeling down beside the room of an Ansari man. I returned after collecting whatever I collected, to see the humps of my two she-camels cut off and their flanks cut open and some portion of their livers was taken out. When I saw that state of my two she-camels, I could not help weeping. I asked, \"Who has done this?\" The people replied, \"Hamza bin `Abdul Muttalib who is staying with some Ansari drunks in this house.\" I went away till I reached the Prophet (ﷺ) and Zaid bin Haritha was with him. The Prophet (ﷺ) noticed on my face the effect of what I had suffered, so the Prophet (ﷺ) asked. \"What is wrong with you.\" I replied, \"O Allah's Messenger (ﷺ)! I have never seen such a day as today. Hamza attacked my two she-camels, cut off their humps, and ripped open their flanks, and he is sitting there in a house in the company of some drunks.\" The Prophet (ﷺ) then asked for his covering sheet, put it on, and set out walking followed by me and Zaid bin Haritha till he came to the house where Hamza was. He asked permission to enter, and they allowed him, and they were drunk. Allah's Messenger (ﷺ) started rebuking Hamza for what he had done, but Hamza was drunk and his eyes were red. Hamza looked at Allah's Messenger (ﷺ) and then he raised his eyes, looking at his knees, then he raised up his eyes looking at his umbilicus, and again he raised up his eyes look in at his face. Hamza then said, \"Aren't you but the slaves of my father?\" Allah's Messenger (ﷺ) realized that he was drunk, so Allah's Messenger (ﷺ) retreated, and we went out with him",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 1
			}
		}
	]
}