{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3159,
			"arabicnumber": 3159,
			"text": "Narrated Jubair bin Haiya:`Umar sent the Muslims to the great countries to fight the pagans. When Al-Hurmuzan embraced Islam, `Umar said to him. \"I would like to consult you regarding these countries which I intend to invade.\" Al-Hurmuzan said, \"Yes, the example of these countries and their inhabitants who are the enemies. of the Muslims, is like a bird with a head, two wings and two legs; If one of its wings got broken, it would get up over its two legs, with one wing and the head; and if the other wing got broken, it would get up with two legs and a head, but if its head got destroyed, then the two legs, two wings and the head would become useless. The head stands for Khosrau, and one wing stands for Caesar and the other wing stands for Faris. So, order the Muslims to go towards Khosrau.\" So, `Umar sent us (to Khosrau) appointing An-Nu`man bin Muqrin as our commander. When we reached the land of the enemy, the representative of Khosrau came out with forty-thousand warriors, and an interpreter got up saying, \"Let one of you talk to me!\" Al-Mughira replied, \"Ask whatever you wish.\" The other asked, \"Who are you?\" Al-Mughira replied, \"We are some people from the Arabs; we led a hard, miserable, disastrous life: we used to suck the hides and the date stones from hunger; we used to wear clothes made up of fur of camels and hair of goats, and to worship trees and stones. While we were in this state, the Lord of the Heavens and the Earths, Elevated is His Remembrance and Majestic is His Highness, sent to us from among ourselves a Prophet whose father and mother are known to us. Our Prophet, the Messenger of our Lord, has ordered us to fight you till you worship Allah Alone or give Jizya (i.e. tribute); and our Prophet has informed us that our Lord says:-- \"Whoever amongst us is killed (i.e. martyred), shall go to Paradise to lead such a luxurious life as he has never seen, and whoever amongst us remain alive, shall become your master.\" (Al-Mughira, then blamed An-Nu`man for delaying the attack and) An-Nu' man said to Al-Mughira, \"If you had participated in a similar battle, in the company of Allah's Messenger (ﷺ) he would not have blamed you for waiting, nor would he have disgraced you. But I accompanied Allah's Apostle in many battles and it was his custom that if he did not fight early by daytime, he would wait till the wind had started blowing and the time for the prayer was due (i.e. after midday)",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}