{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3329,
			"arabicnumber": 3329,
			"text": "Narrated Anas:When `Abdullah bin Salam heard the arrival of the Prophet (ﷺ) at Medina, he came to him and said, \"I am going to ask you about three things which nobody knows except a prophet: What is the first portent of the Hour? What will be the first meal taken by the people of Paradise? Why does a child resemble its father, and why does it resemble its maternal uncle\" Allah's Messenger (ﷺ) said, \"Gabriel has just now told me of their answers.\" `Abdullah said, \"He (i.e. Gabriel), from amongst all the angels, is the enemy of the Jews.\" Allah's Messenger (ﷺ) said, \"The first portent of the Hour will be a fire that will bring together the people from the east to the west; the first meal of the people of Paradise will be Extra-lobe (caudate lobe) of fish-liver. As for the resemblance of the child to its parents: If a man has sexual intercourse with his wife and gets discharge first, the child will resemble the father, and if the woman gets discharge first, the child will resemble her.\" On that `Abdullah bin Salam said, \"I testify that you are the Messenger of Allah.\" `Abdullah bin Salam further said, \"O Allah's Messenger (ﷺ)! The Jews are liars, and if they should come to know about my conversion to Islam before you ask them (about me), they would tell a lie about me.\" The Jews came to Allah's Messenger (ﷺ) and `Abdullah went inside the house. Allah's Apostle asked (the Jews), \"What kind of man is `Abdullah bin Salam amongst you?\" They replied, \"He is the most learned person amongst us, and the best amongst us, and the son of the best amongst us.\" Allah's Messenger (ﷺ) said, \"What do you think if he embraces Islam (will you do as he does)?\" The Jews said, \"May Allah save him from it.\" Then `Abdullah bin Salam came out in front of them saying, \"I testify that None has the right to be worshipped but Allah and that Muhammad is the Apostle of Allah.\" Thereupon they said, \"He is the evilest among us, and the son of the evilest amongst us,\" and continued talking badly of him",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 4
			}
		}
	]
}