{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3571,
			"arabicnumber": 3571,
			"text": "Narrated `Imran bin Husain:That they were with the Prophet (ﷺ) on a journey. They travelled the whole night, and when dawn approached, they took a rest and sleep overwhelmed them till the sun rose high in the sky. The first to get up was Abu Bakr. Allah's Messenger (ﷺ)s used not to be awakened from his sleep, but he would wake up by himself. `Umar woke up and then Abu Bakr sat by the side of the Prophet's head and started saying: Allahu-Akbar raising his voice till the Prophet (ﷺ) woke up, (and after traveling for a while) he dismounted and led us in the morning prayer. A man amongst the people failed to join us in the prayer. When the Prophet (ﷺ) had finished the prayer, he asked (the man), \"O so-and-so! What prevented you from offering the prayer with us?\" He replied, \"I am Junub,\" Alllah's Apostle ordered him to perform Tayammam with clean earth. The man then offered the prayer. Allah's Messenger (ﷺ) ordered me and a few others to go ahead of him. We had become very thirsty. While we were on our way (looking for water), we came across a lady (riding an animal), hanging her legs between two water-skins. We asked her, \"Where can we get water?\" She replied, \"Oh ! There is no water.\" We asked, \"how far is your house from the water?\" She replied, \"A distance of a day and a night travel.\" We said, \"Come on to Allah's Messenger (ﷺ), \"She asked, \"What is Allah's Messenger (ﷺ) ?\" So we brought her to Allah's Messenger (ﷺ) against her will, and she told him what she had told us before and added that she was the mother of orphans. So the Prophet (ﷺ) ordered that her two water-skins be brought and he rubbed the mouths of the water-skins. As we were thirsty, we drank till we quenched our thirst and we were forty men. We also filled all our waterskins and other utensils with water, but we did not water the camels. The waterskin was so full that it was almost about to burst. The Prophet (ﷺ) then said, \"Bring what (foodstuff) you have.\" So some dates and pieces of bread were collected for the lady, and when she went to her people, she said, \"I have met either the greatest magician or a prophet as the people claim.\" So Allah guided the people of that village through that lady. She embraced Islam and they all embraced Islam",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 80
			}
		}
	]
}