{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3578,
			"arabicnumber": 3578,
			"text": "Narrated Anas bin Malik:Abu Talha said to Um Sulaim, \"I have noticed feebleness in the voice of Allah's Messenger (ﷺ) which I think, is caused by hunger. Have you got any food?\" She said, \"Yes.\" She brought out some loaves of barley and took out a veil belonging to her, and wrapped the bread in part of it and put it under my arm and wrapped part of the veil round me and sent me to Allah's Messenger (ﷺ). I went carrying it and found Allah's Messenger (ﷺ) in the Mosque sitting with some people. When I stood there, Allah's Messenger (ﷺ) asked, \"Has Abu Talha sent you?\" I said, \"Yes\". He asked, \"With some food? I said, \"Yes\" Allah's Apostle then said to the men around him, \"Get up!\" He set out (accompanied by them) and I went ahead of them till I reached Abu Talha and told him (of the Prophet's visit). Abu Talha said, \"O Um Sulaim! Allah's Messenger (ﷺ) is coming with the people and we have no food to feed them.\" She said, \"Allah and His Apostle know better.\" So Abu Talha went out to receive Allah's Messenger (ﷺ). Allah's Apostle came along with Abu Talha. Allah's Messenger (ﷺ) said, \"O Um Sulaim! Bring whatever you have.\" She brought the bread which Allah's Messenger (ﷺ) ordered to be broken into pieces. Um Sulaim poured on them some butter from an oilskin. Then Allah's Messenger (ﷺ) recited what Allah wished him to recite, and then said, \"Let ten persons come (to share the meal).\" Ten persons were admitted, ate their fill and went out. Then he again said, \"Let another ten do the same.\" They were admitted, ate their fill and went out. Then he again said, '\"'Let another ten persons (do the same.)\" They were admitted, ate their fill and went out. Then he said, \"Let another ten persons come.\" In short, all of them ate their fill, and they were seventy or eighty men",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 87
			}
		}
	]
}