{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3698,
			"arabicnumber": 3698,
			"text": "Narrated `Uthman:(the son of Muhib) An Egyptian who came and performed the Hajj to the Ka`ba saw some people sitting. He enquire, \"Who are these people?\" Somebody said, \"They are the tribe of Quraish.\" He said, \"Who is the old man sitting amongst them?\" The people replied, \"He is `Abdullah bin `Umar.\" He said, \"O Ibn `Umar! I want to ask you about something; please tell me about it. Do you know that `Uthman fled away on the day (of the battle) of Uhud?\" Ibn `Umar said, \"Yes.\" The (Egyptian) man said, \"Do you know that `Uthman was absent on the day (of the battle) of Badr and did not join it?\" Ibn `Umar said, \"Yes.\" The man said, \"Do you know that he failed to attend the Ar Ridwan pledge and did not witness it (i.e. Hudaibiya pledge of allegiance)?\" Ibn `Umar said, \"Yes.\" The man said, \"Allahu Akbar!\" Ibn `Umar said, \"Let me explain to you (all these three things). As for his flight on the day of Uhud, I testify that Allah has excused him and forgiven him; and as for his absence from the battle of Badr, it was due to the fact that the daughter of Allah's Messenger (ﷺ) was his wife and she was sick then. Allah's Messenger (ﷺ) said to him, \"You will receive the same reward and share (of the booty) as anyone of those who participated in the battle of Badr (if you stay with her).' As for his absence from the Ar-Ridwan pledge of allegiance, had there been any person in Mecca more respectable than `Uthman (to be sent as a representative). Allah's Messenger (ﷺ) would have sent him instead of him. No doubt, Allah's Messenger (ﷺ) had sent him, and the incident of the Ar-Ridwan pledge of Allegiance happened after `Uthman had gone to Mecca. Allah's Messenger (ﷺ) held out his right hand saying, 'This is `Uthman's hand.' He stroke his (other) hand with it saying, 'This (pledge of allegiance) is on the behalf of `Uthman.' Then Ibn `Umar said to the man, 'Bear (these) excuses in mind with you",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 48
			}
		}
	]
}