{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3861,
			"arabicnumber": 3861,
			"text": "Narrated Ibn `Abbas:When Abu Dhar received the news of the Advent of the Prophet (ﷺ) he said to his brother, \"Ride to this valley (of Mecca) and try to find out the truth of the person who claims to be a prophet who is informed of the news of Heaven. Listen to what he says and come back to me.\" So his brother set out and came to the Prophet (ﷺ) and listened to some of his talks, and returned to Abu Dhar and said to him. \"I have seen him enjoining virtuous behavior and saying something that is not poetry.\" Abu Dhar said, \"You have not satisfied me as to what I wanted.\" He then took his journey-food and carried a waterskin of his, containing some water till be reached Mecca. He went to the Mosque and searched for the Prophet and though he did not know him, he hated to ask anybody about him. When a part of the night had passed away, `Ali saw him and knew that he was a stranger. So when Abu Dhar saw `Ali, he followed him, and none of them asked his companion about anything, and when it was dawn, Abu Dhar took his journey food and his water-skin to the Mosque and stayed there all the day long without being perceived by the Prophet, and when it was evening, he came back to his retiring place. `Ali passed by him and said, \"Has the man not known his dwelling place yet?\" So `Ali awakened him and took him with him and none of them spoke to the other about anything. When it was the third day. `Ali did the same and Abu Dhar stayed with him. Then `Ali said \"Will you tell me what has brought you here?\" Abu Dhar said, \"If you give me a firm promise that you will guide me, then I will tell you.\" `Ali promised him, and he informed `Ali about the matter. `Ali said, \"It is true, and he is the Messenger of Allah. Next morning when you get up, accompany me, and if I see any danger for you, I will stop as if to pass water, but if I go on, follow me and enter the place which I will enter.\" Abu Dhar did so, and followed `Ali till he entered the place of the Prophet, and Abu Dhar went in with him, Abu Dhar listened to some of the Prophet's talks and embraced Islam on the spot. The Prophet (ﷺ) said to him, \"Go back to your people and inform them (about it) till you receive my order.\" Abu Dhar said, \"By Him in Whose Hand my life is, I will proclaim my conversion loudly amongst them (i.e. the pagans).\" So he went out, and when he reached the Mosque, he said as loudly as possible, \"I bear witness that None has the right to be worshipped except Allah, and Muhammad is the Messenger of Allah.\" The People got up and beat him painfully. Then Al-Abbas came and knelt over him ((to protect him) and said (to the people), \"Woe to you! Don't you know that this man belongs to the tribe of Ghifar and your trade to Sha'm is through their way?\" So he rescued him from them. Abu Dhar again did the same the next day. They beat him and took vengeance on him and again Al-Abbas knelt over him (to protect him)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 86
			}
		}
	]
}