{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3950,
			"arabicnumber": 3950,
			"text": "Narrated `Abdullah bin Mas`ud:From Sa`d bin Mu`adh: Sa`d bin Mu`adh was an intimate friend of Umaiya bin Khalaf and whenever Umaiya passed through Medina, he used to stay with Sa`d, and whenever Sa`d went to Mecca, he used to stay with Umaiya. When Allah's Messenger (ﷺ) arrived at Medina, Sa`d went to perform `Umra and stayed at Umaiya's home in Mecca. He said to Umaiya, \"Tell me of a time when (the Mosque) is empty so that I may be able to perform Tawaf around the Ka`ba.\" So Umaiya went with him about midday. Abu Jahl met them and said, \"O Abu Safwan! Who is this man accompanying you?\" He said, \"He is Sa`d.\" Abu Jahl addressed Sa`d saying, \"I see you wandering about safely in Mecca inspite of the fact that you have given shelter to the people who have changed their religion (i.e. became Muslims) and have claimed that you will help them and support them. By Allah, if you were not in the company of Abu Safwan, you would not be able to go your family safely.\" Sa`d, raising his voice, said to him, \"By Allah, if you should stop me from doing this (i.e. performing Tawaf) I would certainly prevent you from something which is more valuable for you, that is, your passage through Medina.\" On this, Umaiya said to him, \"O Sa`d do not raise your voice before Abu-l-Hakam, the chief of the people of the Valley (of Mecca).\" Sa`d said, \"O Umaiya, stop that! By Allah, I have heard Allah's Messenger (ﷺ) predicting that the Muslim will kill you.\" Umaiya asked, \"In Mecca?\" Sa`d said, \"I do not know.\" Umaiya was greatly scared by that news. When Umaiya returned to his family, he said to his wife, \"O Um Safwan! Don't you know what Sa`d told me? \"She said, \"What has he told you?\" He replied, \"He claims that Muhammad has informed them (i.e. companions that they will kill me. I asked him, 'In Mecca?' He replied, 'I do not know.\" Then Umaiya added, \"By Allah, I will never go out of Mecca.\" But when the day of (the Ghazwa of) Badr came, Abu Jahl called the people to war, saying, \"Go and protect your caravan.\" But Umaiya disliked to go out (of Mecca). Abu Jahl came to him and said, \"O Abu Safwan! If the people see you staying behind though you are the chief of the people of the Valley, then they will remain behind with you.\" Abu Jahl kept on urging him to go until he (i.e. Umaiya) said, \"As you have forced me to change my mind, by Allah, I will buy the best camel in Mecca. Then Umaiya said (to his wife). \"O Um Safwan, prepare what I need (for the journey).\" She said to him, \"O Abu Safwan! Have you forgotten what your Yathribi brother told you?\" He said, \"No, but I do not want to go with them but for a short distance.\" So when Umaiya went out, he used to tie his camel wherever he camped. He kept on doing that till Allah caused him to be killed at Badr",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 2
			}
		}
	]
}