{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4037,
			"arabicnumber": 4037,
			"text": "Narrated Jabir bin `Abdullah:Allah's Messenger (ﷺ) said, \"Who is willing to kill Ka`b bin Al-Ashraf who has hurt Allah and His Apostle?\" Thereupon Muhammad bin Maslama got up saying, \"O Allah's Messenger (ﷺ)! Would you like that I kill him?\" The Prophet (ﷺ) said, \"Yes,\" Muhammad bin Maslama said, \"Then allow me to say a (false) thing (i.e. to deceive Ka`b). \"The Prophet (ﷺ) said, \"You may say it.\" Then Muhammad bin Maslama went to Ka`b and said, \"That man (i.e. Muhammad demands Sadaqa (i.e. Zakat) from us, and he has troubled us, and I have come to borrow something from you.\" On that, Ka`b said, \"By Allah, you will get tired of him!\" Muhammad bin Maslama said, \"Now as we have followed him, we do not want to leave him unless and until we see how his end is going to be. Now we want you to lend us a camel load or two of food.\" (Some difference between narrators about a camel load or two.) Ka`b said, \"Yes, (I will lend you), but you should mortgage something to me.\" Muhammad bin Mas-lama and his companion said, \"What do you want?\" Ka`b replied, \"Mortgage your women to me.\" They said, \"How can we mortgage our women to you and you are the most handsome of the 'Arabs?\" Ka`b said, \"Then mortgage your sons to me.\" They said, \"How can we mortgage our sons to you? Later they would be abused by the people's saying that so-and-so has been mortgaged for a camel load of food. That would cause us great disgrace, but we will mortgage our arms to you.\" Muhammad bin Maslama and his companion promised Ka`b that Muhammad would return to him. He came to Ka`b at night along with Ka`b's foster brother, Abu Na'ila. Ka`b invited them to come into his fort, and then he went down to them. His wife asked him, \"Where are you going at this time?\" Ka`b replied, \"None but Muhammad bin Maslama and my (foster) brother Abu Na'ila have come.\" His wife said, \"I hear a voice as if dropping blood is from him, Ka`b said. \"They are none but my brother Muhammad bin Maslama and my foster brother Abu Naila. A generous man should respond to a call at night even if invited to be killed.\" Muhammad bin Maslama went with two men. (Some narrators mention the men as 'Abu bin Jabr. Al Harith bin Aus and `Abbad bin Bishr). So Muhammad bin Maslama went in together with two men, and sail to them, \"When Ka`b comes, I will touch his hair and smell it, and when you see that I have got hold of his head, strip him. I will let you smell his head.\" Ka`b bin Al-Ashraf came down to them wrapped in his clothes, and diffusing perfume. Muhammad bin Maslama said. \" have never smelt a better scent than this. Ka`b replied. \"I have got the best 'Arab women who know how to use the high class of perfume.\" Muhammad bin Maslama requested Ka`b \"Will you allow me to smell your head?\" Ka`b said, \"Yes.\" Muhammad smelt it and made his companions smell it as well. Then he requested Ka`b again, \"Will you let me (smell your head)?\" Ka`b said, \"Yes.\" When Muhammad got a strong hold of him, he said (to his companions), \"Get at him!\" So they killed him and went to the Prophet (ﷺ) and informed him. (Abu Rafi`) was killed after Ka`b bin Al-Ashraf",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 84
			}
		}
	]
}