{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4039,
			"arabicnumber": 4039,
			"text": "Narrated Al-Bara bin Azib:Allah's Messenger (ﷺ) sent some men from the Ansar to ((kill) Abu Rafi`, the Jew, and appointed `Abdullah bin Atik as their leader. Abu Rafi` used to hurt Allah's Messenger (ﷺ) and help his enemies against him. He lived in his castle in the land of Hijaz. When those men approached (the castle) after the sun had set and the people had brought back their livestock to their homes. `Abdullah (bin Atik) said to his companions, \"Sit down at your places. I am going, and I will try to play a trick on the gate-keeper so that I may enter (the castle).\" So `Abdullah proceeded towards the castle, and when he approached the gate, he covered himself with his clothes, pretending to answer the call of nature. The people had gone in, and the gate-keeper (considered `Abdullah as one of the castle's servants) addressing him saying, \"O Allah's Servant! Enter if you wish, for I want to close the gate.\" `Abdullah added in his story, \"So I went in (the castle) and hid myself. When the people got inside, the gate-keeper closed the gate and hung the keys on a fixed wooden peg. I got up and took the keys and opened the gate. Some people were staying late at night with Abu Rafi` for a pleasant night chat in a room of his. When his companions of nightly entertainment went away, I ascended to him, and whenever I opened a door, I closed it from inside. I said to myself, 'Should these people discover my presence, they will not be able to catch me till I have killed him.' So I reached him and found him sleeping in a dark house amidst his family, I could not recognize his location in the house. So I shouted, 'O Abu Rafi`!' Abu Rafi` said, 'Who is it?' I proceeded towards the source of the voice and hit him with the sword, and because of my perplexity, I could not kill him. He cried loudly, and I came out of the house and waited for a while, and then went to him again and said, 'What is this voice, O Abu Rafi`?' He said, 'Woe to your mother! A man in my house has hit me with a sword! I again hit him severely but I did not kill him. Then I drove the point of the sword into his belly (and pressed it through) till it touched his back, and I realized that I have killed him. I then opened the doors one by one till I reached the staircase, and thinking that I had reached the ground, I stepped out and fell down and got my leg broken in a moonlit night. I tied my leg with a turban and proceeded on till I sat at the gate, and said, 'I will not go out tonight till I know that I have killed him.' So, when (early in the morning) the cock crowed, the announcer of the casualty stood on the wall saying, 'I announce the death of Abu Rafi`, the merchant of Hijaz. Thereupon I went to my companions and said, 'Let us save ourselves, for Allah has killed Abu Rafi`,' So I (along with my companions proceeded and) went to the Prophet (ﷺ) and described the whole story to him. \"He said, 'Stretch out your (broken) leg. I stretched it out and he rubbed it and it became All right as if I had never had any ailment whatsoever",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 86
			}
		}
	]
}