{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4040,
			"arabicnumber": 4040,
			"text": "Narrated Al-Bara:Allah's Messenger (ﷺ) sent `Abdullah bin 'Atik and `Abdullah bin `Utba with a group of men to Abu Rafi` (to kill him). They proceeded till they approached his castle, whereupon `Abdullah bin Atik said to them, \"Wait (here), and in the meantime I will go and see.\" `Abdullah said later on, \"I played a trick in order to enter the castle. By chance, they lost a donkey of theirs and came out carrying a flaming light to search for it. I was afraid that they would recognize me, so I covered my head and legs and pretended to answer the call to nature. The gatekeeper called, 'Whoever wants to come in, should come in before I close the gate.' So I went in and hid myself in a stall of a donkey near the gate of the castle. They took their supper with Abu Rafi` and had a chat till late at night. Then they went back to their homes. When the voices vanished and I no longer detected any movement, I came out. I had seen where the gate-keeper had kept the key of the castle in a hole in the wall. I took it and unlocked the gate of the castle, saying to myself, 'If these people should notice me, I will run away easily.' Then I locked all the doors of their houses from outside while they were inside, and ascended to Abu Rafi` by a staircase. I saw the house in complete darkness with its light off, and I could not know where the man was. So I called, 'O Abu Rafi`!' He replied, 'Who is it?' I proceeded towards the voice and hit him. He cried loudly but my blow was futile. Then I came to him, pretending to help him, saying with a different tone of my voice, ' What is wrong with you, O Abu Rafi`?' He said, 'Are you not surprised? Woe on your mother! A man has come to me and hit me with a sword!' So again I aimed at him and hit him, but the blow proved futile again, and on that Abu Rafi` cried loudly and his wife got up. I came again and changed my voice as if I were a helper, and found Abu Rafi` lying straight on his back, so I drove the sword into his belly and bent on it till I heard the sound of a bone break. Then I came out, filled with astonishment and went to the staircase to descend, but I fell down from it and got my leg dislocated. I bandaged it and went to my companions limping. I said (to them), 'Go and tell Allah's Messenger (ﷺ) of this good news, but I will not leave (this place) till I hear the news of his (i.e. Abu Rafi`'s) death.' When dawn broke, an announcer of death got over the wall and announced, 'I convey to you the news of Abu Rafi`'s death.' I got up and proceeded without feeling any pain till I caught up with my companions before they reached the Prophet (ﷺ) to whom I conveyed the good news",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 87
			}
		}
	]
}