{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4196,
			"arabicnumber": 4196,
			"text": "Narrated Salama bin Al-Akwa`:We went out to Khaibar in the company of the Prophet. While we were proceeding at night, a man from the group said to 'Amir, \"O 'Amir! Won't you let us hear your poetry?\" 'Amir was a poet, so he got down and started reciting for the people poetry that kept pace with the camels' footsteps, saying:-- \"O Allah! Without You we Would not have been guided On the right path Neither would be have given In charity, nor would We have prayed. So please forgive us, what we have committed (i.e. our defects); let all of us Be sacrificed for Your Cause And send Sakina (i.e. calmness) Upon us to make our feet firm When we meet our enemy, and If they will call us towards An unjust thing, We will refuse. The infidels have made a hue and Cry to ask others' help Against us.\" The Prophet (ﷺ) on that, asked, \"Who is that (camel) driver (reciting poetry)?\" The people said, \"He is 'Amir bin Al-Akwa`.\" Then the Prophet (ﷺ) said, \"May Allah bestow His Mercy on him.\" A man amongst the people said, \"O Allah's Prophet! has (martyrdom) been granted to him. Would that you let us enjoy his company longer.\" Then we reached and besieged Khaibar till we were afflicted with severe hunger. Then Allah helped the Muslims conquer it (i.e. Khaibar). In the evening of the day of the conquest of the city, the Muslims made huge fires. The Prophet (ﷺ) said, \"What are these fires? For cooking what, are you making the fire?\" The people replied, \"(For cooking) meat.\" He asked, \"What kind of meat?\" They (i.e. people) said, \"The meat of donkeys.\" The Prophet (ﷺ) said, \"Throw away the meat and break the pots!\" Some man said, \"O Allah's Messenger (ﷺ)! Shall we throw away the meat and wash the pots instead?\" He said, \"(Yes, you can do) that too.\" So when the army files were arranged in rows (for the clash), 'Amir's sword was short and he aimed at the leg of a Jew to strike it, but the sharp blade of the sword returned to him and injured his own knee, and that caused him to die. When they returned from the battle, Allah's Messenger (ﷺ) saw me (in a sad mood). He took my hand and said, \"What is bothering you?\" I replied, \"Let my father and mother be sacrificed for you! The people say that the deeds of 'Amir are lost.\" The Prophet (ﷺ) said, \"Whoever says so, is mistaken, for 'Amir has got a double reward.\" The Prophet raised two fingers and added, \"He (i.e. Amir) was a persevering struggler in the Cause of Allah and there are few 'Arabs who achieved the like of (good deeds) 'Amir had done",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 236
			}
		}
	]
}