{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4230,
			"arabicnumber": 4230,
			"text": "Narrated Abu Musa:The news of the migration of the Prophet (from Mecca to Medina) reached us while we were in Yemen. So we set out as emigrants towards him. We were (three) I and my two brothers. I was the youngest of them, and one of the two was Abu Burda, and the other, Abu Ruhm, and our total number was either 53 or 52 men from my people. We got on board a boat and our boat took us to Negus in Ethiopia. There we met Ja`far bin Abi Talib and stayed with him. Then we all came (to Medina) and met the Prophet (ﷺ) at the time of the conquest of Khaibar. Some of the people used to say to us, namely the people of the ship, \"We have migrated before you.\" Asma' bint 'Umais who was one of those who had come with us, came as a visitor to Hafsa, the wife the Prophet (ﷺ) . She had migrated along with those other Muslims who migrated to Negus. `Umar came to Hafsa while Asma' bint 'Umais was with her. `Umar, on seeing Asma,' said, \"Who is this?\" She said, \"Asma' bint 'Umais,\" `Umar said, \"Is she the Ethiopian? Is she the sea-faring lady?\" Asma' replied, \"Yes.\" `Umar said, \"We have migrated before you (people of the boat), so we have got more right than you over Allah's Messenger (ﷺ) \" On that Asma' became angry and said, \"No, by Allah, while you were with Allah's Messenger (ﷺ) who was feeding the hungry ones amongst you, and advised the ignorant ones amongst you, we were in the far-off hated land of Ethiopia, and all that was for the sake of Allah's Messenger (ﷺ) . By Allah, I will neither eat any food nor drink anything till I inform Allah's Messenger (ﷺ) of all that you have said. There we were harmed and frightened. I will mention this to the Prophet (ﷺ) and will not tell a lie or curtail your saying or add something to it",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 268
			}
		}
	]
}