{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4280,
			"arabicnumber": 4280,
			"text": "Narrated Hisham's father:When Allah's Messenger (ﷺ) set out (towards Mecca) during the year of the Conquest (of Mecca) and this news reached (the infidels of Quraish), Abu Sufyan, Hakim bin Hizam and Budail bin Warqa came out to gather information about Allah's Messenger (ﷺ) , They proceeded on their way till they reached a place called Marr-az-Zahran (which is near Mecca). Behold! There they saw many fires as if they were the fires of `Arafat. Abu Sufyan said, \"What is this? It looked like the fires of `Arafat.\" Budail bin Warqa' said, \"Banu `Amr are less in number than that.\" Some of the guards of Allah's Messenger (ﷺ) saw them and took them over, caught them and brought them to Allah's Messenger (ﷺ). Abu Sufyan embraced Islam. When the Prophet (ﷺ) proceeded, he said to Al-Abbas, \"Keep Abu Sufyan standing at the top of the mountain so that he would look at the Muslims. So Al-`Abbas kept him standing (at that place) and the tribes with the Prophet (ﷺ) started passing in front of Abu Sufyan in military batches. A batch passed and Abu Sufyan said, \"O `Abbas Who are these?\" `Abbas said, \"They are (Banu) Ghifar.\" Abu Sufyan said, I have got nothing to do with Ghifar.\" Then (a batch of the tribe of) Juhaina passed by and he said similarly as above. Then (a batch of the tribe of) Sa`d bin Huzaim passed by and he said similarly as above. then (Banu) Sulaim passed by and he said similarly as above. Then came a batch, the like of which Abu Sufyan had not seen. He said, \"Who are these?\" `Abbas said, \"They are the Ansar headed by Sa`d bin Ubada, the one holding the flag.\" Sa`d bin Ubada said, \"O Abu Sufyan! Today is the day of a great battle and today (what is prohibited in) the Ka`ba will be permissible.\" Abu Sufyan said., \"O `Abbas! How excellent the day of destruction is! \"Then came another batch (of warriors) which was the smallest of all the batches, and in it there was Allah's Messenger (ﷺ) and his companions and the flag of the Prophet (ﷺ) was carried by Az-Zubair bin Al Awwam. When Allah's Messenger (ﷺ) passed by Abu Sufyan, the latter said, (to the Prophet), \"Do you know what Sa`d bin 'Ubada said?\" The Prophet (ﷺ) said, \"What did he say?\" Abu Sufyan said, \"He said so-and-so.\" The Prophet (ﷺ) said, \"Sa`d told a lie, but today Allah will give superiority to the Ka`ba and today the Ka`ba will be covered with a (cloth) covering.\" Allah's Messenger (ﷺ) ordered that his flag be fixed at Al-Hajun. Narrated `Urwa: Nafi` bin Jubair bin Mut`im said, \"I heard Al-Abbas saying to Az-Zubair bin Al- `Awwam, 'O Abu `Abdullah ! Did Allah's Messenger (ﷺ) order you to fix the flag here?' \" Allah's Messenger (ﷺ) ordered Khalid bin Al-Walid to enter Mecca from its upper part from Ka'da while the Prophet (ﷺ) himself entered from Kuda. Two men from the cavalry of Khalid bin Al-Wahd named Hubaish bin Al-Ash'ar and Kurz bin Jabir Al-Fihri were martyred on that day",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 314
			}
		}
	]
}