{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4318,
			"arabicnumber": 4318,
			"text": "Narrated Marwan and Al-Miswar bin Makhrama:When the delegate of Hawazin came to Allah's Messenger (ﷺ) declaring their conversion to Islam and asked him to return their properties and captives, Allah's Messenger (ﷺ) got up and said to them, \"There Is involved in this matter, the people whom you see with me, and the most beloved talk to me, is the true one. So choose one of two alternatives: Either the captives or the properties. I have been waiting for you (i.e. have not distributed the booty).\" Allah's Messenger (ﷺ) had delayed the distribution of their booty over ten nights after his return from Ta'if. So when they came to know that Allah's Messenger (ﷺ) was not going to return to them but one of the two, they said, \"We prefer to have our captives.\" So Allah's Messenger (ﷺ) got up amongst the Muslims, and praising Allah as He deserved, said, \"To proceed! Your brothers have come to you with repentance and I see (it logical) to return their captives. So, whoever of you likes to do that as a favor then he can do it. And whoever of you likes to stick to his share till we give him from the very first booty which Allah will give us, then he can do so.\" The people said, \"We do that (i.e. return the captives) willingly as a favor, 'O Allah's Messenger (ﷺ)!\" Allah's Messenger (ﷺ) said, \"We do not know which of you have agreed to it and which have not; so go back and let your chiefs forward us your decision.\" They went back and their chief's spoke to them, and they (i.e. the chiefs) returned to Allah's Messenger (ﷺ) and informed him that all of them had agreed (to give up their captives) with pleasure, and had given their permission (i.e. that the captives be returned to their people). (The sub-narrator said, \"That is what has reached me about the captives of Hawazin tribe)",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}