{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4321,
			"arabicnumber": 4321,
			"text": "Narrated Abu Qatada:We set out along with the Prophet (ﷺ) during the year of (the battle of) Hunain, and when we faced the enemy, the Muslims (with the exception of the Prophet (ﷺ) and some of his companions) retreated (before the enemy). I saw one of the pagans over-powering one of the Muslims, so I struck the pagan from behind his neck causing his armor to be cut off. The pagan headed towards me and pressed me so forcibly that I felt as if I was dying. Then death took him over and he released me. Afterwards I followed `Umar and said to him, \"What is wrong with the people?\" He said, \"It is the Order of Allah.\" Then the Muslims returned (to the battle after the flight) and (after overcoming the enemy) the Prophet sat and said, \"Whoever had killed an Infidel and has an evidence to this issue, will have the Salb (i.e. the belonging of the deceased e.g. clothes, arms, horse, etc).\" I (stood up) and said, \"Who will be my witness?\" and then sat down. Then the Prophet (ﷺ) repeated his question. Then the Prophet (ﷺ) said the same (for the third time). I got up and said, \"Who will be my witness?\" and then sat down. The Prophet (ﷺ) asked his former question again. So I got up. The Prophet (ﷺ) said, What is the matter, O Abu Qatada?\" So I narrated the whole story; A man said, \"Abu Qatada has spoken the truth, and the Salb of the deceased is with me, so please compensate Abu Qatada on my behalf.\" Abu Bakr said, \"No! By Allah, it will never happen that the Prophet (ﷺ) will leave a Lion of Allah who fights for the Sake of Allah and His Apostle and give his spoils to you.\" The Prophet (ﷺ) said, \"Abu Bakr has spoken the truth. Give it (the spoils) back to him (O man)!\" So he gave it to me and I bought a garden in (the land of) Banu Salama with it (i.e. the spoils) and that was the first property I got after embracing Islam",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 351
			}
		}
	]
}