{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4323,
			"arabicnumber": 4323,
			"text": "Narrated Abu Musa:When the Prophet (ﷺ) had finished from the battle of Hunain, he sent Abu Amir at the head of an army to Autas He (i.e. Abu Amir) met Duraid bin As Summa and Duraid was killed and Allah defeated his companions. The Prophet (ﷺ) sent me with Abu 'Amir. Abu Amir was shot at his knee with an arrow which a man from Jushm had shot and fixed into his knee. I went to him and said, \"O Uncle! Who shot you?\" He pointed me out (his killer) saying, \"That is my killer who shot me (with an arrow).\" So I headed towards him and overtook him, and when he saw me, he fled, and I followed him and started saying to him, \"Won't you be ashamed? Won't you stop?\" So that person stopped, and we exchanged two hits with the swords and I killed him. Then I said to Abu 'Amir. \"Allah has killed your killer.\" He said, \"Take out this arrow\" So I removed it, and water oozed out of the wound. He then said, \"O son of my brother! Convey my compliments to the Prophet (ﷺ) and request him to ask Allah's Forgiveness for me.\" Abu Amir made me his successor in commanding the people (i.e. troops). He survived for a short while and then died. (Later) I returned and entered upon the Prophet (ﷺ) at his house, and found him lying in a bed made of stalks of date-palm leaves knitted with ropes, and on it there was bedding. The strings of the bed had their traces over his back and sides. Then I told the Prophet (ﷺ) about our and Abu Amir's news and how he had said \"Tell him to ask for Allah's Forgiveness for me.\" The Prophet (ﷺ) asked for water, performed ablution and then raised hands, saying, \"O Allah's Forgive `Ubaid, Abu Amir.\" At that time I saw the whiteness of the Prophet's armpits. The Prophet (ﷺ) then said, \"O Allah, make him (i.e. Abu Amir) on the Day of Resurrection, superior to many of Your human creatures.\" I said, \"Will you ask Allah's Forgiveness for me?\" (On that) the Prophet (ﷺ) said, \"O Allah, forgive the sins of `Abdullah bin Qais and admit him to a nice entrance (i.e. paradise) on the Day of Resurrection.\" Abu Burda said, \"One of the prayers was for Abu 'Amir and the other was for Abu Musa (i.e. `Abdullah bin Qais)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 353
			}
		}
	]
}