{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4337,
			"arabicnumber": 4337,
			"text": "Narrated Anas Bin Malik:When it was the day (of the battle) of Hunain, the tributes of Hawazin and Ghatafan and others, along with their animals and offspring (and wives) came to fight against the Prophet (ﷺ) The Prophet (ﷺ) had with him, ten thousand men and some of the Tulaqa. The companions fled, leaving the Prophet (ﷺ) alone. The Prophet then made two calls which were clearly distinguished from each other. He turned right and said, \"O the group of Ansar!\" They said, \"Labbaik, O Allah's Messenger (ﷺ)! Rejoice, for we are with you!\" Then he turned left and said, \"O the group of Ansar!\" They said, \"Labbaik! O Allah's Messenger (ﷺ)! Rejoice, for we are with you!\" The Prophet (ﷺ) at that time, was riding on a white mule; then he dismounted and said, \"I am Allah's Slave and His Apostle.\" The infidels then were defeated, and on that day the Prophet (ﷺ) gained a large amount of booty which he distributed amongst the Muhajirin and the Tulaqa and did not give anything to the Ansar. The Ansar said, \"When there is a difficulty, we are called, but the booty is given to other than us.\" The news reached the Prophet (ﷺ) and he gathered them in a leather tent and said, \"What is this news reaching me from you, O the group of Ansar?\" They kept silent, He added,\" O the group of Ansar! Won't you be happy that the people take the worldly things and you take Allah's Messenger (ﷺ) to your homes reserving him for yourself?\" They said, \"Yes.\" Then the Prophet said, \"If the people took their way through a valley, and the Ansar took their way through a mountain pass, surely, I would take the Ansar's mountain pass.\" Hisham said, \"O Abu Hamza (i.e. Anas)! Did you witness that? \" He replied, \"And how could I be absent from him?",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 366
			}
		}
	]
}