{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4418,
			"arabicnumber": 4418,
			"text": "Narrated `Abdullah bin Ka`b bin Malik:Who, from among Ka`b's sons, was the guide of Ka`b when he became blind: I heard Ka`b bin Malik narrating the story of (the Ghazwa of) Tabuk in which he failed to take part. Ka`b said, \"I did not remain behind Allah's Messenger (ﷺ) in any Ghazwa that he fought except the Ghazwa of Tabuk, and I failed to take part in the Ghazwa of Badr, but Allah did not admonish anyone who had not participated in it, for in fact, Allah's Messenger (ﷺ) had gone out in search of the caravan of Quraish till Allah made them (i.e. the Muslims) and their enemy meet without any appointment. I witnessed the night of Al-`Aqaba (pledge) with Allah's Messenger (ﷺ) when we pledged for Islam, and I would not exchange it for the Badr battle although the Badr battle is more popular amongst the people than it (i.e. Al-`Aqaba pledge). As for my news (in this battle of Tabuk), I had never been stronger or wealthier than I was when I remained behind the Prophet (ﷺ) in that Ghazwa. By Allah, never had I two she-camels before, but I had then at the time of this Ghazwa. Whenever Allah's Messenger (ﷺ) wanted to make a Ghazwa, he used to hide his intention by apparently referring to different Ghazwa till it was the time of that Ghazwa (of Tabuk) which Allah's Messenger (ﷺ) fought in severe heat, facing, a long journey, desert, and the great number of enemy. So the Prophet (ﷺ) announced to the Muslims clearly (their destination) so that they might get prepared for their Ghazwa. So he informed them clearly of the destination he was going to. Allah's Messenger (ﷺ) was accompanied by a large number of Muslims who could not be listed in a book namely, a register.\" Ka`b added, \"Any man who intended to be absent would think that the matter would remain hidden unless Allah revealed it through Divine Revelation. So Allah's Messenger (ﷺ) fought that Ghazwa at the time when the fruits had ripened and the shade looked pleasant. Allah's Messenger (ﷺ) and his companions prepared for the battle and I started to go out in order to get myself ready along with them, but I returned without doing anything. I would say to myself, 'I can do that.' So I kept on delaying it every now and then till the people got ready and Allah's Messenger (ﷺ) and the Muslims along with him departed, and I had not prepared anything for my departure, and I said, I will prepare myself (for departure) one or two days after him, and then join them.' In the morning following their departure, I went out to get myself ready but returned having done nothing. Then again in the next morning, I went out to get ready but returned without doing anything. Such was the case with me till they hurried away and the battle was missed (by me). Even then I intended to depart to take them over. I wish I had done so! But it was not in my luck. So, after the departure of Allah's Messenger (ﷺ), whenever I went out and walked amongst the people (i.e, the remaining persons), it grieved me that I could see none around me, but one accused of hypocrisy or one of those weak men whom Allah had excused. Allah's Messenger (ﷺ) did not remember me till he reached Tabuk. So while he was sitting amongst the people in Tabuk, he said, 'What did Ka`b do?' A man from Banu Salama said, 'O Allah's Messenger (ﷺ)! He has been stopped by his two Burdas (i.e. garments) and his looking at his own flanks with pride.' Then Mu`adh bin Jabal said, 'What a bad thing you have said! By Allah! O Allahs Apostle! We know nothing about him but good.' Allah's Messenger (ﷺ) kept silent.\" Ka`b bin Malik added, \"When I heard that he (i.e. the Prophet (ﷺ) ) was on his way back to Medina. I got dipped in my concern, and began to think of false excuses, saying to myself, 'How can I avoid his anger tomorrow?' And I took the advice of wise member of my family in this matter. When it was said that Allah's Messenger (ﷺ), had come near all the evil false excuses abandoned from my mind and I knew well that I could never come out of this problem by forging a false statement. Then I decided firmly to speak the truth. So Allah's Messenger (ﷺ) arrived in the morning, and whenever he returned from a journey., he used to visit the Mosque first of all and offer a two-rak`at prayer therein and then sit for the people. So when he had done all that (this time), those who had failed to join the battle (of Tabuk) came and started offering (false) excuses and taking oaths before him. They were something over eighty men; Allah's Messenger (ﷺ) accepted the excuses they had expressed, took their pledge of allegiance asked for Allah's Forgiveness for them, and left the secrets of their hearts for Allah to judge. Then I came to him, and when I greeted him, he smiled a smile of an angry person and then said, 'Come on.' So I came walking till I sat before him. He said to me, 'What stopped you from joining us. Had you not purchased an animal For carrying you?' I answered, \"Yes, O Allah's Messenger (ﷺ)! But by Allah, if I were sitting before any person from among the people of the world other than you, I would have avoided his anger with an excuse. By Allah, I have been bestowed with the power of speaking fluently and eloquently, but by Allah, I knew well that if today I tell you a lie to seek your favor, Allah would surely make you angry with me in the near future, but if I tell you the truth, though you will get angry because of it, I hope for Allah's Forgiveness. Really, by Allah, there was no excuse for me. By Allah, I had never been stronger or wealthier than I was when I remained behind you.' Then Allah's Messenger (ﷺ) said, 'As regards this man, he has surely told the truth. So get up till Allah decides your case.' I got up, and many men of Banu Salama followed me and said to me. 'By Allah, we never witnessed you doing any sin before this. Surely, you failed to offer excuse to Allah's Messenger (ﷺ) as the others who did not join him, have offered. The prayer of Allah's Messenger (ﷺ) to Allah to forgive you would have been sufficient for you.' By Allah, they continued blaming me so much that I intended to return (to the Prophet) and accuse myself of having told a lie, but I said to them, 'Is there anybody else who has met the same fate as I have?' They replied, 'Yes, there are two men who have said the same thing as you have, and to both of them was given the same order as given to you.' I said, 'Who are they?' They replied, Murara bin Ar-Rabi Al- Amri and Hilal bin Umaiya Al-Waqifi.' By that they mentioned to me two pious men who had attended the Ghazwa (Battle) of Badr, and in whom there was an example for me. So I did not change my mind when they mentioned them to me. Allah's Messenger (ﷺ) forbade all the Muslims to talk to us, the three aforesaid persons out of all those who had remained behind in that Ghazwa. So we kept away from the people and they changed their attitude towards us till the very land (where I lived) appeared strange to me as if I did not know it. We remained in that condition for fifty nights. As regards my two fellows, they remained in their houses and kept on weeping, but I was the youngest of them and the firmest of them, so I used to go out and witness the prayers along with the Muslims and roam about in the markets, but none would talk to me, and I would come to Allah's Messenger (ﷺ) and greet him while he was sitting In his gathering after the prayer, and I would wonder whether the Prophet (ﷺ) did move his lips in return to my greetings or not. Then I would offer my prayer near to him and look at him stealthily. When I was busy with my prayer, he would turn his face towards me, but when I turned my face to him, he would turn his face away from me. When this harsh attitude of the people lasted long, I walked till I scaled the wall of the garden of Abu Qatada who was my cousin and dearest person to me, and I offered my greetings to him. By Allah, he did not return my greetings. I said, 'O Abu Qatada! I beseech you by Allah! Do you know that I love Allah and His Apostle?' He kept quiet. I asked him again, beseeching him by Allah, but he remained silent. Then I asked him again in the Name of Allah. He said, \"Allah and His Apostle know it better.' Thereupon my eyes flowed with tears and I returned and jumped over the wall.\" Ka`b added, \"While I was walking in the market of Medina, suddenly I saw a Nabati (i.e. a Christian farmer) from the Nabatis of Sham who came to sell his grains in Medina, saying, 'Who will lead me to Ka`b bin Malik?' The people began to point (me) out for him till he came to me and handed me a letter from the king of Ghassan in which the following was written: \"To proceed, I have been informed that your friend (i.e. the Prophet (ﷺ) ) has treated you harshly. Anyhow, Allah does not let you live at a place where you feel inferior and your right is lost. So join us, and we will console you.\" When I read it, I said to myself, 'This is also a sort of a test.' Then I took the letter to the oven and made a fire therein by burning it. When forty out of the fifty nights elapsed, behold ! There came to me the messenger of Allah's Messenger (ﷺ) and said, 'Allah's Messenger (ﷺ) orders you to keep away from your wife,' I said, 'Should I divorce her; or else! what should I do?' He said, 'No, only keep aloof from her and do not cohabit her.' The Prophet (ﷺ) sent the same message to my two fellows. Then I said to my wife. 'Go to your parents and remain with them till Allah gives His Verdict in this matter.\" Ka`b added, \"The wife of Hilal bin Umaiya came to Apostle and said, 'O Allah's Messenger (ﷺ)! Hilal bin Umaiya is a helpless old man who has no servant to attend on him. Do you dislike that I should serve him? ' He said, 'No (you can serve him) but he should not come near you.' She said, 'By Allah, he has no desire for anything. By, Allah, he has never ceased weeping till his case began till this day of his.' (continued...) (continuing... 1): -5.702:... ... On that, some of my family members said to me, 'Will you also ask Allah's Messenger (ﷺ) to permit your wife (to serve you) as he has permitted the wife of Hilal bin Umaiya to serve him?' I said, 'By Allah, I will not ask the permission of Allah's Messenger (ﷺ) regarding her, for I do not know What Allah's Messenger (ﷺ) would say if I asked him to permit her (to serve me) while I am a young man.' Then I remained in that state for ten more nights after that till the period of fifty nights was completed starting from the time when Allah's Messenger (ﷺ) prohibited the people from talking to us. When I had offered the Fajr prayer on the 50th morning on the roof of one of our houses and while I was sitting in the condition which Allah described (in the Qur'an) i.e. my very soul seemed straitened to me and even the earth seemed narrow to me for all its spaciousness, there I heard the voice of one who had ascended the mountain of Sala' calling with his loudest voice, 'O Ka`b bin Malik! Be happy (by receiving good tidings).' I fell down in prostration before Allah, realizing that relief has come. Allah's Messenger (ﷺ) had announced the acceptance of our repentance by Allah when he had offered the Fajr prayer. The people then went out to congratulate us. Some bringers of good tidings went out to my two fellows, and a horseman came to me in haste, and a man of Banu Aslam came running and ascended the mountain and his voice was swifter than the horse. When he (i.e. the man) whose voice I had heard, came to me conveying the good tidings, I took off my garments and dressed him with them; and by Allah, I owned no other garments than them on that day. Then I borrowed two garments and wore them and went to Allah's Apostle. The people started receiving me in batches, congratulating me on Allah's Acceptance of my repentance, saying, 'We congratulate you on Allah's Acceptance of your repentance.\" Ka`b further said, \"When I entered the Mosque. I saw Allah's Messenger (ﷺ) sitting with the people around him. Talha bin Ubaidullah swiftly came to me, shook hands with me and congratulated me. By Allah, none of the Muhajirin (i.e. Emigrants) got up for me except him (i.e. Talha), and I will never forget this for Talha.\" Ka`b added, \"When I greeted Allah's Messenger (ﷺ) he, his face being bright with joy, said \"Be happy with the best day that you have got ever since your mother delivered you.\" Ka`b added, \"I said to the Prophet (ﷺ) 'Is this forgiveness from you or from Allah?' He said, 'No, it is from Allah.' Whenever Allah's Messenger (ﷺ) became happy, his face would shine as if it were a piece of moon, and we all knew that characteristic of him. When I sat before him, I said, 'O Allah's Messenger (ﷺ)! Because of the acceptance of my repentance I will give up all my wealth as alms for the Sake of Allah and His Apostle. Allah's Apostle said, 'Keep some of your wealth, as it will be better for you.' I said, 'So I will keep my share from Khaibar with me,' and added, 'O Allah's Messenger (ﷺ)! Allah has saved me for telling the truth; so it is a part of my repentance not to tell but the truth as long as I am alive. By Allah, I do not know anyone of the Muslims whom Allah has helped fortelling the truth more than me. Since I have mentioned that truth to Allah's Messenger (ﷺ) till today, I have never intended to tell a lie. I hope that Allah will also save me (from telling lies) the rest of my life. So Allah revealed to His Apostle the Verse:-- \"Verily, Allah has forgiven the Prophet, the Muhajirin (i.e. Emigrants (up to His Saying) And be with those who are true (in word and deed).\" (9.117-119) By Allah, Allah has never bestowed upon me, apart from His guiding me to Islam, a Greater blessing than the fact that I did not tell a lie to Allah's Messenger (ﷺ) which would have caused me to perish as those who have told a lie perished, for Allah described those who told lies with the worst description He ever attributed to anybody else. Allah said:-- \"They (i.e. the hypocrites) will swear by Allah to you when you return to them (up to His Saying) Certainly Allah is not pleased with the rebellious people-- \" (9.95-96) Ka`b added, \"We, the three persons, differed altogether from those whose excuses Allah's Apostle accepted when they swore to him. He took their pledge of allegiance and asked Allah to forgive them, but Allah's Messenger (ﷺ) left our case pending till Allah gave His Judgment about it. As for that Allah said):-- And to the three (He did for give also) who remained behind.\" (9.118) What Allah said (in this Verse) does not indicate our failure to take part in the Ghazwa, but it refers to the deferment of making a decision by the Prophet (ﷺ) about our case in contrast to the case of those who had taken an oath before him and he excused them by accepting their excuses",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 440
			}
		}
	]
}