{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4747,
			"arabicnumber": 4747,
			"text": "Narrated Ibn `Abbas:Hilal bin Umaiya accused his wife of committing illegal sexual intercourse with Sharik bin Sahma' and filed the case before the Prophet. The Prophet (ﷺ) said (to Hilal), \"Either you bring forth a proof (four witnesses) or you will receive the legal punishment (lashes) on your back.\" Hilal said, \"O Allah's Apostle! If anyone of us saw a man over his wife, would he go to seek after witnesses?\" The Prophet (ﷺ) kept on saying, \"Either you bring forth the witnesses or you will receive the legal punishment (lashes) on your back.\" Hilal then said, \"By Him Who sent you with the Truth, I am telling the truth and Allah will reveal to you what will save my back from legal punishment.\" Then Gabriel came down and revealed to him:-- 'As for those who accuse their wives...' (24.6-9) The Prophet (ﷺ) recited it till he reached: '... (her accuser) is telling the truth.' Then the Prophet (ﷺ) left and sent for the woman, and Hilal went (and brought) her and then took the oaths (confirming the claim). The Prophet (ﷺ) was saying, \"Allah knows that one of you is a liar, so will any of you repent?\" Then the woman got up and took the oaths and when she was going to take the fifth one, the people stopped her and said, \"It (the fifth oath) will definitely bring Allah's curse on you (if you are guilty).\" So she hesitated and recoiled (from taking the oath) so much that we thought that she would withdraw her denial. But then she said, \"I will not dishonor my family all through these days,\" and carried on (the process of taking oaths). The Prophet (ﷺ) then said, \"Watch her; if she delivers a black-eyed child with big hips and fat shins then it is Sharik bin Sahma's child.\" Later she delivered a child of that description. So the Prophet (ﷺ) said, \"If the case was not settled by Allah's Law, I would punish her severely",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 269
			}
		}
	]
}