{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4750,
			"arabicnumber": 4750,
			"text": "Narrated Aisha:(The wife of the Prophet) Whenever Allah's Messenger (ﷺ) intended to go on a journey, he used to draw lots among his wives and would take with him the one on whom the lot had fallen. Once he drew lots when he wanted to carry out a Ghazwa, and the lot came upon me. So I proceeded with Allah's Apostle after Allah's order of veiling (the women) had been revealed and thus I was carried in my howdah (on a camel) and dismounted while still in it. We carried on our journey, and when Allah's Apostle had finished his Ghazwa and returned and we approached Medina, Allah's Messenger (ﷺ) ordered to proceed at night. When the army was ordered to resume the homeward journey, I got up and walked on till I left the army (camp) behind. When I had answered the call of nature, I went towards my howdah, but behold ! A necklace of mine made of Jaz Azfar (a kind of black bead) was broken and I looked for it and my search for it detained me. The group of people who used to carry me, came and carried my howdah on to the back of my camel on which I was riding, considering that I was therein. At that time women were light in weight and were not fleshy for they used to eat little (food), so those people did not feel the lightness of the howdah while raising it up, and I was still a young lady. They drove away the camel and proceeded. Then I found my necklace after the army had gone. I came to their camp but found nobody therein so I went to the place where I used to stay, thinking that they would miss me and come back in my search. While I was sitting at my place, I felt sleepy and slept. Safwan bin Al-Mu'attil As-Sulami Adh- Dhakw-ani was behind the army. He had started in the last part of the night and reached my stationing place in the morning and saw the figure of a sleeping person. He came to me and recognized me on seeing me for he used to see me before veiling. I got up because of his saying: \"Inna Li l-lahi wa inna ilaihi rajiun,\" which he uttered on recognizing me. I covered my face with my garment, and by Allah, he did not say to me a single word except, \"Inna Li l-lahi wa inna ilaihi rajiun,\" till he made his shecamel kneel down whereupon he trod on its forelegs and I mounted it. Then Safwan set out, leading the she-camel that was carrying me, till we met the army while they were resting during the hot midday. Then whoever was meant for destruction, fell in destruction, and the leader of the Ifk (forged statement) was `Abdullah bin Ubai bin Salul. After this we arrived at Medina and I became ill for one month while the people were spreading the forged statements of the people of the Ifk, and I was not aware of anything thereof. But what aroused my doubt while I was sick, was that I was no longer receiving from Allah's Messenger (ﷺ) the same kindness as I used to receive when I fell sick. Allah's Messenger (ﷺ) would enter upon me, say a greeting and add, \"How is that (lady)?\" and then depart. That aroused my suspicion but I was not aware of the propagated evil till I recovered from my ailment. I went out with Um Mistah to answer the call of nature towards Al-Manasi, the place where we used to relieve ourselves, and used not to go out for this purpose except from night to night, and that was before we had lavatories close to our houses. And this habit of ours was similar to the habit of the old 'Arabs (in the deserts or in the tents) concerning the evacuation of the bowels, for we considered it troublesome and harmful to take lavatories in the houses. So I went out with Um Mistah who was the daughter of Abi Ruhm bin `Abd Manaf, and her mother was daughter of Sakhr bin Amir who was the aunt of Abi Bakr As-Siddiq, and her son was Mistah bin Uthatha. When we had finished our affair, Um Mistah and I came back towards my house. Um Mistah stumbled over her robe whereupon she said, \"Let Mistah be ruined ! \" I said to her, \"What a bad word you have said! Do you abuse a man who has taken part in the Battle of Badr?' She said, \"O you there! Didn't you hear what he has said?\" I said, \"And what did he say?\" She then told me the statement of the people of the Ifk (forged statement) which added to my ailment. When I returned home, Allah's Messenger (ﷺ) came to me, and after greeting, he said, \"How is that (lady)?\" I said, \"Will you allow me to go to my parents?\" At that time I intended to be sure of the news through them. Allah's Messenger (ﷺ) allowed me and I went to my parents and asked my mother, \"O my mother! What are the people talking about?\" My mother said, \"O my daughter! Take it easy, for by Allah, there is no charming lady who is loved by her husband who has other wives as well, but that those wives would find fault with her.\" I said, \"Subhan Allah! Did the people really talk about that?\" That night I kept on weeping the whole night till the morning. My tears never stopped, nor did I sleep, and morning broke while I was still weeping, Allah's Messenger (ﷺ) called `Ali bin Abi Talib and Usama bin Zaid when the Divine Inspiration delayed, in order to consult them as to the idea of divorcing his wife. Usama bin Zaid told Allah's Messenger (ﷺ) of what he knew about the innocence of his wife and of his affection he kept for her. He said, \"O Allah's Messenger (ﷺ)! She is your wife, and we do not know anything about her except good.\" But `Ali bin Abi Talib said, \"O Allah's Messenger (ﷺ)! Allah does not impose restrictions on you; and there are plenty of women other than her. If you however, ask (her) slave girl, she will tell you the truth.\" `Aisha added: So Allah's Messenger (ﷺ) called for Barira and said, \"O Barira! Did you ever see anything which might have aroused your suspicion? (as regards Aisha). Barira said, \"By Allah Who has sent you with the truth, I have never seen anything regarding Aisha which I would blame her for except that she is a girl of immature age who sometimes sleeps and leaves the dough of her family unprotected so that the domestic goats come and eat it.\" So Allah's Messenger (ﷺ) got up (and addressed) the people an asked for somebody who would take revenge on `Abdullah bin Ubai bin Salul then. Allah's Messenger (ﷺ), while on the pulpit, said, \"O Muslims! Who will help me against a man who has hurt me by slandering my family? By Allah, I know nothing except good about my family, and people have blamed a man of whom I know nothing except good, and he never used to visit my family except with me,\" Sa`d bin Mu`adh Al-Ansari got up and said, \"O Allah's Messenger (ﷺ)! By Allah, I will relieve you from him. If he be from the tribe of (Bani) Al-Aus, then I will chop his head off; and if he be from our brethren, the Khazraj, then you give us your order and we will obey it.\" On that, Sa`d bin 'Ubada got up, and he was the chief of the Khazraj, and before this incident he had been a pious man but he was incited by his zeal for his tribe. He said to Sa`d (bin Mu`adh), \"By Allah the Eternal, you have told a lie! You shall not kill him and you will never be able to kill him!\" On that, Usaid bin Hudair, the cousin of Sa`d (bin Mu`adh) got up and said to Sa`d bin 'Ubada, \"You are a liar! By Allah the Eternal, we will surely kill him; and you are a hypocrite defending the hypocrites!\" So the two tribes of Al-Aus and Al-Khazraj got excited till they were on the point of fighting with each other while Allah's Messenger (ﷺ) was standing on the pulpit. Allah's Messenger (ﷺ) continued quietening them till they became silent whereupon he became silent too. On that day I kept on weeping so much that neither did my tears stop, nor could I sleep. In the morning my parents were with me, and I had wept for two nights and a day without sleeping and with incessant tears till they thought that my liver would burst with weeping. While they were with me and I was weeping, an Ansari woman asked permission to see me. I admitted her and she sat and started weeping with me. While I was in that state, Allah's Apostle came to us, greeted, and sat down,. He had never sat with me since the day what was said, was said. He had stayed a month without receiving any Divine Inspiration concerning my case. Allah's Messenger (ﷺ) recited the Tashahhud after he had sat down, and then said, \"Thereafter, O `Aisha! I have been informed such and-such a thing about you; and if you are innocent, Allah will reveal your innocence, and if you have committed a sin, then ask for Allah's forgiveness and repent to Him, for when a slave confesses his sin and then repents to Allah, Allah accepts his repentance.\" When Allah's Apostle had finished his speech, my tears ceased completely so that I no longer felt even a drop thereof. Then I said to my father, \"Reply to Allah's Messenger (ﷺ) on my behalf as to what he said.\" He said, \"By Allah, I do not know what to say to Allah's Messenger (ﷺ).\" Then I said to my mother, \"Reply to Allah's Apostle.\" She said, \"I do not know what to say to Allah's Messenger (ﷺ).\" Still a young girl as I was and though I had little knowledge of Qur'an, I said, \"By Allah, I know that you heard this story (of the Ifk) so much so that it has been planted in your minds and you have believed it. So now, if I tell you that I am innocent, and Allah knows that I am innocent, you will not believe me; and if I confess something, and Allah knows that I am innocent of it, you will believe me. By Allah, I cannot find of you an example except that of Joseph's father: \"So (for me) patience is most fitting against that which you assert and it is Allah (Alone) Whose help can be sought. Then I turned away and lay on my bed, and at that time I knew that I was innocent and that Allah would reveal my innocence. But by Allah, I never thought that Allah would sent down about my affair, Divine Inspiration that would be recited (forever), as I considered myself too unworthy to be talked of by Allah with something that was to be recited: but I hoped that Allah's Messenger (ﷺ) might have a vision in which Allah would prove my innocence. By Allah, Allah's Messenger (ﷺ) had not left his seat and nobody had left the house when the Divine Inspiration came to Allah's Messenger (ﷺ) . So there overtook him the same hard condition which used to overtake him (when he was Divinely Inspired) so that the drops of his sweat were running down, like pearls, though it was a (cold) winter day, and that was because of the heaviness of the Statement which was revealed to him. When that state of Allah's Messenger (ﷺ) was over, and he was smiling when he was relieved, the first word he said was, \"Aisha, Allah has declared your innocence.\" My mother said to me, \"Get up and go to him.\" I said, \"By Allah, I will not go to him and I will not thank anybody but Allah.\" So Allah revealed: \"Verily! They who spread the Slander are a gang among you. Think it not....\" (24.11-20). When Allah revealed this to confirm my innocence, Abu Bakr As-Siddiq who used to provide for Mistah bin Uthatha because of the latter's kinship to him and his poverty, said, \"By Allah, I will never provide for Mistah anything after what he has said about Aisha\". So Allah revealed: (continued...) (continuing... 1): -6.274:... ... \"Let not those among you who are good and are wealthy swear not to give (help) to their kinsmen, those in need, and those who have left their homes for Allah's Cause. Let them Pardon and forgive (i.e. do not punish them). Do you not love that should forgive you? Verily Allah is Oft-forgiving. Most Merciful.\" (24.22) Abu Bakr said, \"Yes, by Allah, I wish that Allah should forgive me.\" So he resumed giving Mistah the aid he used to give him before and said, \"By Allah, I will never withold it from him at all.\" Aisha further said: Allah's Messenger (ﷺ) also asked Zainab bint Jahsh about my case. He said, \"O Zainab! What have you seen?\" She replied, \"O Allah's Messenger (ﷺ)! I protect my hearing and my sight (by refraining from telling lies). I know nothing but good (about Aisha).\" Of all the wives of Allah's Messenger (ﷺ), it was Zainab who aspired to receive from him the same favor as I used to receive, yet, Allah saved her (from telling lies) because of her piety. But her sister, Hamna, kept on fighting on her behalf so she was destroyed as were those who invented and spread the slander",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 272
			}
		}
	]
}