{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4757,
			"arabicnumber": 4757,
			"text": "Narrated Aisha:When there was said about me what was said which I myself was unaware of, Allah's Messenger (ﷺ) got up and addressed the people. He recited Tashah-hud, and after glorifying and praising Allah as He deserved, he said, \"To proceed: O people Give me your opinion regarding those people who made a forged story against my wife. By Allah, I do not know anything bad about her. By Allah, they accused her of being with a man about whom I have never known anything bad, and he never entered my house unless I was present there, and whenever I went on a journey, he went with me.\" Sa`d bin Mu`adh got up and said, \"O Allah's Messenger (ﷺ) Allow me to chop their heads off\". Then a man from the Al-Khazraj (Sa`d bin 'Ubada) to whom the mother of (the poet) Hassan bin Thabit was a relative, got up and said (to Sa`d bin Mu`adh), \"You have told a lie! By Allah, if those persons were from the Aus Tribe, you would not like to chop their heads off.\" It was probable that some evil would take place between the Aus and the Khazraj in the mosque, and I was unaware of all that. In the evening of that day, I went out for some of my needs (i.e. to relieve myself), and Um Mistah was accompanying me. On our return, Um Mistah stumbled and said, \"Let Mistah. be ruined\" I said to her, \"O mother Why do you abuse your Son\" On that Um Mistah became silent for a while, and stumbling again, she said, \"Let Mistah be ruined\" I said to her, \"Why do you abuse your son?\" She stumbled for the third time and said, \"Let Mistah be ruined\" whereupon I rebuked her for that. She said, \"By Allah, I do not abuse him except because of you.\" I asked her, \"Concerning what of my affairs?\" So she disclosed the whole story to me. I said, \"Has this really happened?\" She replied, \"Yes, by Allah.\" I returned to my house, astonished (and distressed) that I did not know for what purpose I had gone out. Then I became sick (fever) and said to Allah's Messenger (ﷺ) \"Send me to my father's house.\" So he sent a slave with me, and when I entered the house, I found Um Rum-an (my mother) downstairs while (my father) Abu Bakr was reciting something upstairs. My mother asked, \"What has brought you, O (my) daughter?\" I informed her and mentioned to her the whole story, but she did not feel it as I did. She said, \"O my daughter! Take it easy, for there is never a charming lady loved by her husband who has other wives but that they feel jealous of her and speak badly of her.\" But she did not feel the news as I did. I asked (her), \"Does my father know about it?\" She said, \"yes\" I asked, Does Allah's Messenger (ﷺ) know about it too?\" She said, \"Yes, Allah's Messenger (ﷺ) does too.\" So the tears filled my eyes and I wept. Abu Bakr, who was reading upstairs heard my voice and came down and asked my mother, \"What is the matter with her? \" She said, \"She has heard what has been said about her (as regards the story of Al-lfk).\" On that Abu- Bakr wept and said, \"I beseech you by Allah, O my daughter, to go back to your home\". I went back to my home and Allah's Messenger (ﷺ) had come to my house and asked my maid-servant about me (my character). The maid-servant said, \"By Allah, I do not know of any defect in her character except that she sleeps and let the sheep enter (her house) and eat her dough.\" On that, some of the Prophet's companions spoke harshly to her and said, \"Tell the truth to Allah's Messenger (ﷺ).\" Finally they told her of the affair (of the slander). She said, \"Subhan Allah! By Allah, I know nothing against her except what goldsmith knows about a piece of pure gold.\" Then this news reached the man who was accused, and he said, \"Subhan Allah! By Allah, I have never uncovered the private parts of any woman.\" Later that man was martyred in Allah's Cause. Next morning my parents came to pay me a visit and they stayed with me till Allah's Messenger (ﷺ) came to me after he had offered the `Asr prayer. He came to me while my parents were sitting around me on my right and my left. He praised and glorified Allah and said, \"Now then O `Aisha! If you have committed a bad deed or you have wronged (yourself), then repent to Allah as Allah accepts the repentance from his slaves.\" An Al-Ansari woman had come and was sitting near the gate. I said (to the Prophet). \"Isn't it improper that you speak in such a way in the presence of this lady? Allah's Apostle then gave a piece of advice and I turned to my father and requested him to answer him (on my behalf). My father said, \"What should I say?\" Then I turned to my mother and asked her to answer him. She said, \"What should I say?\" When my parents did not give a reply to the Prophet, I said, \"I testify that none has the right to be worshipped except Allah, and that Muhammad is His Apostle!\" And after praising and glorifying Allah as He deserves, I said, \"Now then, by Allah, if I were to tell you that I have not done (this evil action) and Allah is a witness that I am telling the truth, that would not be of any use to me on your part because you (people) have spoken about it and your hearts have absorbed it; and if I were to tell you that I have done this sin and Allah knows that I have not done it, then you will say, 'She has confessed herself guilty.\" By Allah, 'I do not see a suitable example for me and you but the example of (I tried to remember Jacob's name but couldn't) Joseph's father when he said; So (for me) \"Patience is most fitting against that which you assert. It is Allah (alone) whose help can be sought.' At that very hour the Divine Inspiration came to Allah's Messenger (ﷺ) and we remained silent. Then the Inspiration was over and I noticed the signs of happiness on his face while he was removing (the sweat) from his forehead and saying, \"Have the good tidings O ' \"Aisha! Allah has revealed your innocence.\" At that time I was extremely angry. My parents said to me. \"Get up and go to him.\" I said, \"By Allah, I will not do it and will not thank him nor thank either of you, but I will thank Allah Who has revealed my innocence. You have heard this story but neither did not deny it nor change it (to defend me),\" (Aisha used to say:) \"But as regards Zainab bint Jahsh, (the Prophet's wife), Allah protected her because of her piety, so she did not say anything except good (about me), but her sister, Hamna, was ruined among those who were ruined. Those who used to speak evil about me were Mistah, Hassan bin Thabit, and the hypocrite, `Abdullah bin Ubai, who used to spread that news and tempt others to speak of it, and it was he and Hamna who had the greater share therein. Abu Bakr took an oath that he would never do any favor to Mistah at all. Then Allah revealed the Divine Verse: \"Let not those among you who are good and wealthy (i.e. Abu Bakr) swear not to give (any sort of help) to their kinsmen, and those in need, (i.e. Mistah) ...Do you not love that Allah should forgive you? And Allah is Oft-Forgiving, Most Merciful.\" (24.22) On that, Abu Bakr said, \"Yes, by Allah, O our Lord! We wish that You should forgive us.\" So Abu Bakr again started giving to Mistah the expenditure which he used to give him before",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 279
			}
		}
	]
}