{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5105,
			"arabicnumber": 5105,
			"text": "Ibn 'Abbas further said, \"Seven types of marriages are unlawful because of blood relations, and seven because of marriage relations.\" Then Ibn 'Abbas recited the Verse:\"Forbidden for you (for marriages) are your mothers...\" (4:23). 'Abdullah bin Ja'far married the daughter and wife of 'Ali at the same time (they were step-daughter and mother). Ibn Sirin said, \"There is no harm in that.\" But Al-Hasan Al-Basri disapproved of it at first, but then said that there was no harm in it. Al-Hasan bin Al-Hasan bin 'Ali married two of his cousins in one night. Ja'far bin Zaid disapproved of that because of it would bring hatred (between the two cousins), but it is not unlawful, as Allah said, \"Lawful to you are all others [beyond those (mentioned)]. (4:24). Ibn 'Abbas said: \"If somebody commits illegal sexual intercourse with his wife's sister, his wife does not become unlawful for him.\" And narrated Abu Ja'far, \"If a person commits homosexuality with a boy, then the mother of that boy is unlawful for him to marry.\" Narrated Ibn 'Abbas, \"If one commits illegal sexual intercourse with his mother in law, then his married relation to his wife does not become unlawful.\" Abu Nasr reported to have said that Ibn 'Abbas in the above case, regarded his marital relation to his wife unlawful, but Abu Nasr is not known well for hearing Hadith from Ibn 'Abbas. Imran bin Hussain, Jabir b. Zaid, Al-Hasan and some other Iraqi's, are reported to have judged that his marital relations to his wife would be unlawful. In the above case Abu Hurairah said, \"The marital relation to one's wife does not become unlawful except if one as had sexual intercourse (with her mother).\" Ibn Al-Musaiyab, 'Urwa, and Az-Zuhri allows such person to keep his wife. 'Ali said, \"His marital relations to his wife does not become unlawful",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 43
			}
		}
	]
}