{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5126,
			"arabicnumber": 5126,
			"text": "Narrated Sahl bin Sa`d:A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I have come to you to present myself to you (for marriage).\" Allah's Messenger (ﷺ) glanced at her. He looked at her carefully and fixed his glance on her and then lowered his head. When the lady saw that he did not say anything, she sat down. A man from his companions got up and said, \"O Allah's Messenger (ﷺ)! If you are not in need of her, then marry her to me.\" The Prophet (ﷺ) said, \"Have you got anything to offer.\" The man said, 'No, by Allah, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said (to him), \"Go to your family and try to find something.\" So the man went and returned, saying, \"No, by Allah, O Allah's Messenger (ﷺ)! I have not found anything.\" The Prophet said, \"Go again and look for something, even if it were an iron ring.\" He went and returned, saying, \"No, by Allah, O Allah's Messenger (ﷺ)! I could not find even an iron ring, but this is my Izar (waist sheet).' He had no Rida (upper garment). He added, \"I give half of it to her.\" Allah's Messenger (ﷺ) said \"What will she do with your Izar? If you wear it, she will have nothing over herself thereof (will be naked); and if she wears it, then you will have nothing over yourself thereof ' So the man sat for a long period and then got up (to leave). When Allah's Messenger (ﷺ) saw him leaving, he ordered that he e called back. When he came, the Prophet (ﷺ) asked (him), \"How much of the Qur'an do you know (by heart)?\" The man replied, I know such Sura and such Sura and such Sura,\" naming the suras. The Prophet (ﷺ) said, \"Can you recite it by heart?\" He said, 'Yes.\" The Prophet (ﷺ) said, \"Go I let you marry her for what you know of the Qur'an (as her Mahr)",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 62
			}
		}
	]
}