{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"69": "Supporting the Family"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5358,
			"arabicnumber": 5358,
			"text": "Narrated Malik bin Aus bin Al-Hadathan:Once I set out to visit `Umar (bin Al-Khattab). (While I was sitting there with him his gate-keeper, Yarfa, came and said, \"Uthman `AbdurRahman (bin `Auf), Az-Zubair and Sa`d (bin Abi Waqqas) are seeking permission (to meet you).\" `Umar said, \"Yes. So he admitted them and they entered, greeted, and sat down. After a short while Yarfa came again and said to `Umar 'Shall I admit `Ali and `Abbas?\" `Umar said, \"Yes.\" He admitted them and when they entered, they greeted and sat down. `Abbas said, \"O Chief of the Believers! Judge between me and this (`Ali).\" The group, `Uthman and his companions Sa`d, 'O Chief of the Believers! Judge between them and relieve one from the other.\" `Umar said. Wait! I beseech you by Allah, by Whose permission both the Heaven and the Earth stand fast ! Do you know that Allah's Messenger (ﷺ) said. 'We (Apostles) do not bequeath anything to our heirs, but whatever we leave is to be given in charity.' And by that Allah's Messenger (ﷺ)s meant himself?\" The group said, \"He did say so.\" `Umar then turned towards 'All and `Abbas and said. \"I beseech you both by Allah, do you know that Allah's Messenger (ﷺ) said that?\" They said, 'Yes \" `Umar said, \"Now, let me talk to you about this matter. Allah favored His Apostle with something of this property (war booty) which He did not give to anybody else. And Allah said:-- 'And what Allah has bestowed on His Apostle (as Fai Booty) from them for which you made no expedition with either cavalry or camelry . . . Allah is Able to do all things.' (59.6) So this property was especially granted to Allah's Messenger (ﷺ). But by Allah he neither withheld it from you, nor did he keep it for himself and deprive you of it, but he gave it all to you and distributed it among you till only this remained out of it. And out of this property Allah's Messenger (ﷺ) used to provide his family with their yearly needs, and whatever remained, he would spend where Allah's Property (the revenues of Zakat) used to be spent. Allah's Messenger (ﷺ) kept on acting like this throughout his lifetime. Now I beseech you by Allah, do you know that?\" They said, \"Yes.\" Then `Umar said to `Ali and `Abbas, \"I beseech you by Allah, do you both know that?\" They said, \"Yes.\" `Umar added, \"When Allah had taken His Apostle unto Him, Abu Bakr said, 'I am the successor of Allah's Messenger (ﷺ). So he took charge of that property and did with it the same what Allah's Messenger (ﷺ) used to do, and both of you knew all about it then.\" Then `Umar turned towards `Ali and `Abbas and said, \"You both claim that Abu- Bakr was so-and-so! But Allah knows that he was honest, sincere, pious and right (in that matter). Then Allah caused Abu Bakr to die, and I said, 'I am the successor of Allah's Messenger (ﷺ) and Abu Bakr.' So I kept this property in my possession for the first two years of my rule, and I used to do the same with it as Allah's Messenger (ﷺ) and Abu Bakr used to do. Later both of you (`Ali and `Abbas) came to me with the same claim and the same problem. (O `Abbas!) You came to me demanding your share from (the inheritance of) the son of your brother, and he (`Ali) came to me demanding his wives share from (the inheritance of) her father. So I said to you, 'If you wish I will hand over this property to you, on condition that you both promise me before Allah that you will manage it in the same way as Allah's Messenger (ﷺ) and Abu Bakr did, and as I have done since the beginning of my rule; otherwise you should not speak to me about it.' So you both said, 'Hand over this property to us on this condition.' And on this condition I handed it over to you. I beseech you by Allah, did I hand it over to them on that condition?\" The group said, \"Yes.\" `Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, did I hand it over to you both on that condition?\" They both said, \"Yes.\" `Umar added, \"Do you want me now to give a decision other than that? By Him with Whose permission (order) both the Heaven and the Earth stand fast, I will never give any decision other than that till the Hour is established! But if you are unable to manage it (that property), then return it to me and I will be sufficient for it on your behalf",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 8
			}
		}
	]
}