{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6073,
			"arabicnumber": 6073,
			"text": "Narrated `Aisha:(the wife of the Prophet) that she was told that `Abdullah bin Az-Zubair (on hearing that she was selling or giving something as a gift) said, \"By Allah, if `Aisha does not give up this, I will declare her incompetent to dispose of her wealth.\" I said, \"Did he (`Abdullah bin Az-Zubair) say so?\" They (people) said, \"Yes.\" `Aisha said, \"I vow to Allah that I will never speak to Ibn Az-Zubair.\" When this desertion lasted long, `Abdullah bin Az-Zubair sought intercession with her, but she said, \"By Allah, I will not accept the intercession of anyone for him, and will not commit a sin by breaking my vow.\" When this state of affairs was prolonged on Ibn Az-Zubair (he felt it hard on him), he said to Al- Miswar bin Makhrama and `Abdur-Rahman bin Al-Aswad bin 'Abu Yaghuth, who were from the tribe of Bani Zahra, \"I beseech you, by Allah, to let me enter upon `Aisha, for it is unlawful for her to vow to cut the relation with me.\" So Al-Miswar and `Abdur-Rahman, wrapping their sheets around themselves, asked `Aisha's permission saying, \"Peace and Allah's Mercy and Blessings be upon you! Shall we come in?\" `Aisha said, \"Come in.\" They said, \"All of us?\" She said, \"Yes, come in all of you,\" not knowing that Ibn Az- Zubair was also with them. So when they entered, Ibn Az-Zubair entered the screened place and got hold of `Aisha and started requesting her to excuse him, and wept. Al-Miswar and `Abdur Rahman also started requesting her to speak to him and to accept his repentance. They said (to her), \"The Prophet (ﷺ) forbade what you know of deserting (not speaking to your Muslim Brethren), for it is unlawful for any Muslim not to talk to his brother for more than three nights (days).\" So when they increased their reminding her (of the superiority of having good relation with Kith and kin, and of excusing others' sins), and brought her down to a critical situation, she started reminding them, and wept, saying, \"I have made a vow, and (the question of) vow is a difficult one.\" They (Al-Miswar and `Abdur-Rahman) persisted in their appeal till she spoke with `Abdullah bin Az- Zubair and she manumitted forty slaves as an expiation for her vow. Later on, whenever she remembered her vow, she used to weep so much that her veil used to become wet with her tears",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}