{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6148,
			"arabicnumber": 6148,
			"text": "Narrated Salama bin Al-Aqwa:We went out with Allah's Messenger (ﷺ) to Khaibar and we travelled during the night. A man amongst the people said to 'Amir bin Al-Aqwa', \"Won't you let us hear your poetry?\" 'Amir was a poet, and so he got down and started (chanting Huda) reciting for the people, poetry that keep pace with the camel's foot steps, saying, \"O Allah! Without You we would not have been guided on the right path, neither would we have given in charity, nor would we have prayed. So please forgive us what we have committed. Let all of us be sacrificed for Your cause and when we meet our enemy, make our feet firm and bestow peace and calmness on us and if they (our enemy) will call us towards an unjust thing we will refuse. The infidels have made a hue and cry to ask others help against us. Allah's Messenger (ﷺ) said, \"Who is that driver (of the camels)?\" They said, \"He is 'Amir bin Al-Aqwa.\"' He said, \"May Allah bestow His mercy on him.\" A man among the people said, Has Martyrdom been granted to him, O Allah's Prophet! Would that you let us enjoy his company longer.\" We reached (the people of) Khaibar and besieged them till we were stricken with severe hunger but Allah helped the Muslims conquer Khaibar. In the evening of its conquest the people made many fires. Allah's Messenger (ﷺ) asked, \"What are those fires? For what are you making fires?\" They said, \"For cooking meat.\" He asked, \"What kind of meat?\" They said, \"Donkeys' meat.\" Allah's Messenger (ﷺ) said, \"Throw away the meat and break the cooking pots.\" A man said, O Allah's Messenger (ﷺ)! Shall we throw away the meat and wash the cooking pots?\" He said, \"You can do that too.\" When the army files aligned in rows (for the battle), 'Amir's sword was a short one, and while attacking a Jew with it in order to hit him, the sharp edge of the sword turned back and hit 'Amir's knee and caused him to die. When the Muslims returned (from the battle), Salama said, Allah's Messenger (ﷺ) saw me pale and said, 'What is wrong with you?\"' I said, \"Let my parents be sacrificed for you! The people claim that all the deeds of Amir have been annulled.\" The Prophet (ﷺ) asked, \"Who said so?\" I replied, \"So-and-so and soand- so and Usaid bin Al-Hudair Al-Ansari said, 'Whoever says so is telling a lie. Verily, 'Amir will have double reward.\"' (While speaking) the Prophet (ﷺ) put two of his fingers together to indicate that, and added, \"He was really a hard-working man and a Mujahid (devout fighter in Allah's Cause) and rarely have there lived in it (i.e., Medina or the battle-field) an \"Arab like him",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 174
			}
		}
	]
}