{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6408,
			"arabicnumber": 6408,
			"text": "Narrated Abu Huraira:Allah 's Apostle said, \"Allah has some angels who look for those who celebrate the Praises of Allah on the roads and paths. And when they find some people celebrating the Praises of Allah, they call each other, saying, \"Come to the object of your pursuit.' \" He added, \"Then the angels encircle them with their wings up to the sky of the world.\" He added. \"(after those people celebrated the Praises of Allah, and the angels go back), their Lord, asks them (those angels)----though He knows better than them----'What do My slaves say?' The angels reply, 'They say: Subhan Allah, Allahu Akbar, and Alham-du-li l-lah, Allah then says 'Did they see Me?' The angels reply, 'No! By Allah, they didn't see You.' Allah says, How it would have been if they saw Me?' The angels reply, 'If they saw You, they would worship You more devoutly and celebrate Your Glory more deeply, and declare Your freedom from any resemblance to anything more often.' Allah says (to the angels), 'What do they ask Me for?' The angels reply, 'They ask You for Paradise.' Allah says (to the angels), 'Did they see it?' The angels say, 'No! By Allah, O Lord! They did not see it.' Allah says, How it would have been if they saw it?' The angels say, 'If they saw it, they would have greater covetousness for it and would seek It with greater zeal and would have greater desire for it.' Allah says, 'From what do they seek refuge?' The angels reply, 'They seek refuge from the (Hell) Fire.' Allah says, 'Did they see it?' The angels say, 'No By Allah, O Lord! They did not see it.' Allah says, How it would have been if they saw it?' The angels say, 'If they saw it they would flee from it with the extreme fleeing and would have extreme fear from it.' Then Allah says, 'I make you witnesses that I have forgiven them.\"' Allah's Messenger (ﷺ) added, \"One of the angels would say, 'There was so-and-so amongst them, and he was not one of them, but he had just come for some need.' Allah would say, 'These are those people whose companions will not be reduced to misery",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 103
			}
		}
	]
}