{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6443,
			"arabicnumber": 6443,
			"text": "Narrated Abu Dhar:Once I went out at night and found Allah's Messenger (ﷺ) walking all alone accompanied by nobody, and I thought that perhaps he disliked that someone should accompany him. So I walked in the shade, away from the moonlight, but the Prophet (ﷺ) looked behind and saw me and said, \"Who is that?\" I replied, \"Abu Dhar, let Allah get me sacrificed for you!\" He said, \"O Abu Dhar, come here!\" So I accompanied him for a while and then he said, \"The rich are in fact the poor (little rewarded) on the Day of Resurrection except him whom Allah gives wealth which he gives (in charity) to his right, left, front and back, and does good deeds with it. I walked with him a little longer. Then he said to me, \"Sit down here.\" So he made me sit in an open space surrounded by rocks, and said to me, \"Sit here till I come back to you.\" He went towards Al-Harra till I could not see him, and he stayed away for a long period, and then I heard him saying, while he was coming, \"Even if he had committed theft, and even if he had committed illegal sexual intercourse?\" When he came, I could not remain patient and asked him, \"O Allah's Prophet! Let Allah get me sacrificed for you! Whom were you speaking to by the side of Al-Harra? I did not hear anybody responding to your talk.\" He said, \"It was Gabriel who appeared to me beside Al-Harra and said, 'Give the good news to your followers that whoever dies without having worshipped anything besides Allah, will enter Paradise.' I said, 'O Gabriel! Even if he had committed theft or committed illegal sexual intercourse?' He said, 'Yes.' I said, 'Even if he has committed theft or committed illegal sexual intercourse?' He said, 'Yes.' I said, 'Even if he has committed theft or committed illegal sexual intercourse?' He said, 'Yes",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 32
			}
		}
	]
}