{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6444,
			"arabicnumber": 6444,
			"text": "Narrated Abu Dhar:While I was walking with the Prophet (ﷺ) in the Harra of Medina, Uhud came in sight. The Prophet (ﷺ) said, \"O Abu Dhar!\" I said, \"Labbaik, O Allah's Messenger (ﷺ)!\" He said, \"I would not like to have gold equal to this mountain of Uhud, unless nothing of it, not even a single Dinar of it remains with me for more than three days, except something which I will keep for repaying debts. I would have spent all of it (distributed it) amongst Allah's Slaves like this, and like this, and like this.\" The Prophet (ﷺ) pointed out with his hand towards his right, his left and his back (while illustrating it). He proceeded with his walk and said, \"The rich are in fact the poor (little rewarded) on the Day of Resurrection except those who spend their wealth like this, and like this, and like this, to their right, left and back, but such people are few in number.\" Then he said to me, \"Stay at your place and do not leave it till I come back.\" Then he proceeded in the darkness of the night till he went out of sight, and then I heard a loud voice, and was afraid that something might have happened to the Prophet (ﷺ) .1 intended to go to him, but I remembered what he had said to me, i.e. 'Don't leave your place till I come back to you,' so I remained at my place till he came back to me. I said, \"O Allah's Messenger (ﷺ)! I heard a voice and I was afraid.\" So I mentioned the whole story to him. He said, \"Did you hear it?\" I replied, \"Yes.\" He said, \"It was Gabriel who came to me and said, 'Whoever died without joining others in worship with Allah, will enter Paradise.' I asked (Gabriel), 'Even if he had committed theft or committed illegal sexual intercourse? Gabriel said, 'Yes, even if he had committed theft or committed illegal sexual intercourse",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 33
			}
		}
	]
}