{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"88": "Apostates"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6939,
			"arabicnumber": 6939,
			"text": "Narrated:Abu `Abdur-Rahman and Hibban bin 'Atiyya had a dispute. Abu `Abdur-Rahman said to Hibban, \"You know what made your companions (i.e. `Ali) dare to shed blood.\" Hibban said, \"Come on! What is that?\" `Abdur-Rahman said, \"Something I heard him saying.\" The other said, \"What was it?\" `AbdurRahman said, \"`Ali said, Allah's Messenger (ﷺ) sent for me, Az-Zubair and Abu Marthad, and all of us were cavalry men, and said, 'Proceed to Raudat-Hajj (Abu Salama said that Abu 'Awana called it like this, i.e., Hajj where there is a woman carrying a letter from Hatib bin Abi Balta'a to the pagans (of Mecca). So bring that letter to me.' So we proceeded riding on our horses till we overtook her at the same place of which Allah's Messenger (ﷺ) had told us. She was traveling on her camel. In that letter Hatib had written to the Meccans about the proposed attached of Allah's Messenger (ﷺ) against them. We asked her, \"Where is the letter which is with you?' She replied, 'I haven't got any letter.' So we made her camel kneel down and searched her luggage, but we did not find anything. My two companions said, 'We do not think that she has got a letter.' I said, 'We know that Allah's Messenger (ﷺ) has not told a lie.'\" Then `Ali took an oath saying, \"By Him by Whom one should swear! You shall either bring out the letter or we shall strip off your clothes.\" She then stretched out her hand for her girdle (round her waist) and brought out the paper (letter). They took the letter to Allah's Messenger (ﷺ). `Umar said, \"O Allah's Messenger (ﷺ)! (Hatib) has betrayed Allah, His Apostle and the believers; let me chop off his neck!\" Allah's Messenger (ﷺ) said, \"O Hatib! What obliged you to do what you have done?\" Hatib replied, \"O Allah's Messenger (ﷺ)! Why (for what reason) should I not believe in Allah and His Apostle? But I intended to do the (Mecca) people a favor by virtue of which my family and property may be protected as there is none of your companions but has some of his people (relatives) whom Allah urges to protect his family and property.\" The Prophet (ﷺ) said, \"He has said the truth; therefore, do not say anything to him except good.\" `Umar again said, \"O Allah's Messenger (ﷺ)! He has betrayed Allah, His Apostle and the believers; let me chop his neck off!\" The Prophet (ﷺ) said, \"Isn't he from those who fought the battle of Badr? And what do you know, Allah might have looked at them (Badr warriors) and said (to them), 'Do what you like, for I have granted you Paradise?' \" On that, `Umar's eyes became flooded with tears and he said, \"Allah and His Apostle know best",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 21
			}
		}
	]
}