{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7097,
			"arabicnumber": 7097,
			"text": "Narrated Abu Musa Al-Ash`ari:The Prophet (ﷺ) went out to one of the gardens of Medina for some business and I went out to follow him. When he entered the garden, I sat at its gate and said to myself, \"To day I will be the gatekeeper of the Prophet though he has not ordered me.\" The Prophet (ﷺ) went and finished his need and went to sit on the constructed edge of the well and uncovered his legs and hung them in the well. In the meantime Abu Bakr came and asked permission to enter. I said (to him), \"Wait till I get you permission.\" Abu Bakr waited outside and I went to the Prophet (ﷺ) and said, \"O Allah's Prophet! Abu Bakr asks your permission to enter.\" He said, \"Admit him, and give him the glad tidings of entering Paradise.\" So Abu Bakr entered and sat on the right side of the Prophet (ﷺ) and uncovered his legs and hung them in the well. Then `Umar came and I said (to him), \"Wait till I get you permission.\" The Prophet (ﷺ) said, \"Admit him and give him the glad tidings of entering Paradise.\" So `Umar entered and sat on the left side of the Prophet and uncovered his legs and hung them in the well so that one side of the well became fully occupied and there remained no place for any-one to sit. Then `Uthman came and I said (to him), \"Wait till I get permission for you.\" The Prophet (ﷺ) said, \"Admit him and give him the glad tidings of entering Paradise with a calamity which will befall him.\" When he entered, he could not find any place to sit with them so he went to the other edge of the well opposite them and uncovered his legs and hung them in the well. I wished that a brother of mine would come, so I invoked Allah for his coming. (Ibn Al-Musaiyab said, \"I interpreted that (narration) as indicating their graves. The first three are together and the grave of `Uthman is separate from theirs",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 48
			}
		}
	]
}