{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7207,
			"arabicnumber": 7207,
			"text": "Narrated Al-Miswar bin Makhrama:The group of people whom `Umar had selected as candidates for the Caliphate gathered and consulted each other. `Abdur-Rahman said to them, \"I am not going to compete with you in this matter, but if you wish, I would select for you a caliph from among you.\" So all of them agreed to let `Abdur-Rahman decide the case. So when the candidates placed the case in the hands of `Abdur-Rahman, the people went towards him and nobody followed the rest of the group nor obeyed any after him. So the people followed `Abdur-Rahman and consulted him all those nights till there came the night we gave the oath of allegiance to `Uthman. Al-Miswar (bin Makhrama) added: `Abdur-Rahman called on me after a portion of the night had passed and knocked on my door till I got up, and he said to me, \"I see you have been sleeping! By Allah, during the last three nights I have not slept enough. Go and call Az-Zubair and Sa`d.' So I called them for him and he consulted them and then called me saying, 'Call `Ali for me.\" I called `Ali and he held a private talk with him till very late at night, and then 'Al, got up to leave having had much hope (to be chosen as a Caliph) but `Abdur-Rahman was afraid of something concerning `Ali. `Abdur-Rahman then said to me, \"Call `Uthman for me.\" I called him and he kept on speaking to him privately till the Mu'adh-dhin put an end to their talk by announcing the Adhan for the Fajr prayer. When the people finished their morning prayer and that (six men) group gathered near the pulpit, `Abdur-Rahman sent for all the Muhajirin (emigrants) and the Ansar present there and sent for the army chief who had performed the Hajj with `Umar that year. When all of them had gathered, `Abdur- Rahman said, \"None has the right to be worshipped but Allah,\" and added, \"Now then, O `Ali, I have looked at the people's tendencies and noticed that they do not consider anybody equal to `Uthman, so you should not incur blame (by disagreeing).\" Then `Abdur-Rahman said (to `Uthman), \"I gave the oath of allegiance to you on condition that you will follow Allah's Laws and the traditions of Allah's Apostle and the traditions of the two Caliphs after him.\" So `Abdur-Rahman gave the oath of allegiance to him, and so did the people including the Muhajirin (emigrants) and the Ansar and the chiefs of the army staff and all the Muslims",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 67
			}
		}
	]
}