{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7437,
			"arabicnumber": 7437,
			"text": "Narrated 'Ata' bin Yazid Al-Laithi: On the authority of Abu Huraira: The people said, \"O Allah's Messenger (ﷺ)! Shall we see our Lord on the Day of Resurrection?\" The Prophet (ﷺ) said, \"Do you have any difficulty in seeing the moon on a full moon night?\" They said, \"No, O Allah's Messenger (ﷺ).\" He said, \"Do you have any difficulty in seeing the sun when there are no clouds?\" They said, \"No, O Allah's Messenger (ﷺ).\" He said, \"So you will see Him, like that. Allah will gather all the people on the Day of Resurrection, and say, 'Whoever worshipped something (in the world) should follow (that thing),' so, whoever worshipped the sun will follow the sun, and whoever worshiped the moon will follow the moon, and whoever used to worship certain (other false) deities, he will follow those deities. And there will remain only this nation with its good people (or its hypocrites). (The sub-narrator, Ibrahim is in doubt.) Allah will come to them and say, 'I am your Lord.' They will (deny Him and) say, 'We will stay here till our Lord comes, for when our Lord comes, we will recognize Him.' So Allah will come to them in His appearance which they know, and will say, 'I am your Lord.' They will say, 'You are our Lord,' so they will follow Him. Then a bridge will be laid across Hell (Fire)' I and my followers will be the first ones to go across it and none will speak on that Day except the Apostles. And the invocation of the Apostles on that Day will be, 'O Allah, save! Save!' In Hell (or over The Bridge) there will be hooks like the thorns of As-Sa'dan (thorny plant). Have you seen As-Sa'dan? \" They replied, \"Yes, O Allah's Messenger (ﷺ)!\" He said, \"So those hooks look like the thorns of As-Sa'dan, but none knows how big they are except Allah. Those hooks will snap the people away according to their deeds. Some of the people will stay in Hell (be destroyed) because of their (evil) deeds, and some will be cut or torn by the hooks (and fall into Hell) and some will be punished and then relieved. When Allah has finished His Judgments among the people, He will take whomever He will out of Hell through His Mercy. He will then order the angels to take out of the Fire all those who used to worship none but Allah from among those whom Allah wanted to be merciful to and those who testified (in the world) that none has the right to be worshipped but Allah. The angels will recognize them in the Fire by the marks of prostration (on their foreheads), for the Fire will eat up all the human body except the mark caused by prostration as Allah has forbidden the Fire to eat the mark of prostration. They will come out of the (Hell) Fire, completely burnt and then the water of life will be poured over them and they will grow under it as does a seed that comes in the mud of the torrent. Then Allah will finish the judgments among the people, and there will remain one man facing the (Hell) Fire and he will be the last person among the people of Hell to enter Paradise. He will say, 'O my Lord! Please turn my face away from the fire because its air has hurt me and its severe heat has burnt me.' So he will invoke Allah in the way Allah will wish him to invoke, and then Allah will say to him, 'If I grant you that, will you then ask for anything else?' He will reply, 'No, by Your Power, (Honor) I will not ask You for anything else.' He will give his Lord whatever promises and covenants Allah will demand. So Allah will turn his face away from Hell (Fire). When he will face Paradise and will see it, he will remain quiet for as long as Allah will wish him to remain quiet, then he will say, 'O my Lord! Bring me near to the gate of Paradise.' Allah will say to him, 'Didn't you give your promises and covenants that you would never ask for anything more than what you had been given? Woe on you, O Adam's son! How treacherous you are!' He will say, 'O my lord,' and will keep on invoking Allah till He says to him, 'If I give what you are asking, will you then ask for anything else?' He will reply, 'No, by Your (Honor) Power, I will not ask for anything else.' Then he will give covenants and promises to Allah and then Allah will bring him near to the gate of Paradise. When he stands at the gate of Paradise, Paradise will be opened and spread before him, and he will see its splendor and pleasures whereupon he will remain quiet as long as Allah will wish him to remain quiet, and then he will say, O my Lord! Admit me into Paradise.' Allah will say, 'Didn't you give your covenants and promises that you would not ask for anything more than what you had been given?' Allah will say, 'Woe on you, O Adam's son! How treacherous you are! ' The man will say, 'O my Lord! Do not make me the most miserable of Your creation,' and he will keep on invoking Allah till Allah will laugh because of his sayings, and when Allah will laugh because of him, He will say to him, 'Enter Paradise,' and when he will enter it, Allah will say to him, 'Wish for anything.' So he will ask his Lord, and he will wish for a great number of things, for Allah Himself will remind him to wish for certain things by saying, '(Wish for) so-and-so.' When there is nothing more to wish for, Allah will say, 'This is for you, and its equal (is for you) as well.\" 'Ata' bin Yazid added: Abu Sa'id Al-Khudri who was present with Abu Huraira, did not deny whatever the latter said, but when Abu Huraira said that Allah had said, \"That is for you and its equal as well,\" Abu Sa'id Al-Khudri said, \"And ten times as much, O Abu Huraira!\" Abu Huraira said, \"I do not remember, except his saying, 'That is for you and its equal as well.'\" Abu Sa'id Al-Khudri then said, \"I testify that I remember the Prophet (ﷺ) saying, 'That is for you, and ten times as much.' ' Abu Huraira then added, \"That man will be the last person of the people of Paradise to enter Paradise",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}