{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7440,
			"arabicnumber": 7440,
			"text": "Narrated Anas: The Prophet (ﷺ) said, \"The believers will be kept (waiting) on the Day of Resurrection so long that they will become worried and say, \"Let us ask somebody to intercede far us with our Lord so that He may relieve us from our place. Then they will go to Adam and say, 'You are Adam, the father of the people. Allah created you with His Own Hand and made you reside in His Paradise and ordered His angels to prostrate before you, and taught you the names of all things will you intercede for us with your Lord so that He may relieve us from this place of ours? Adam will say, 'I am not fit for this undertaking.' He will mention his mistakes he had committed, i.e., his eating off the tree though he had been forbidden to do so. He will add, 'Go to Noah, the first prophet sent by Allah to the people of the Earth.' The people will go to Noah who will say, 'I am not fit for this undertaking' He will mention his mistake which he had done, i.e., his asking his Lord without knowledge.' He will say (to them), 'Go to Abraham, Khalil Ar-Rahman.' They will go to Abraham who will say, 'I am not fit for this undertaking. He would mention three words by which he told a lie, and say (to them). 'Go to Moses, a slave whom Allah gave the Torah and spoke to, directly and brought near Him, for conversation.' They will go to Moses who will say, 'I am not fit for this undertaking. He will mention his mistake he made, i.e., killing a person, and will say (to them), 'Go to Jesus, Allah's slave and His Apostle, and a soul created by Him and His Word.' (Be: And it was.) They will go to Jesus who will say, 'I am not fit for this undertaking but you'd better go to Muhammad the slave whose past and future sins have been forgiven by Allah.' So they will come to me, and I will ask my Lord's permission to enter His House and then I will be permitted. When I see Him I will fall down in prostration before Him, and He will leave me (in prostration) as long as He will, and then He will say, 'O Muhammad, lift up your head and speak, for you will be listened to, and intercede, for your intercession will be accepted, and ask (for anything) for it will be granted:' Then I will raise my head and glorify my Lord with certain praises which He has taught me. Allah will put a limit for me (to intercede for a certain type of people) I will take them out and make them enter Paradise.\" (Qatada said: I heard Anas saying that), the Prophet (ﷺ) said, \"I will go out and take them out of Hell (Fire) and let them enter Paradise, and then I will return and ask my Lord for permission to enter His House and I will be permitted. When I will see Him I will fall down in prostration before Him and He will leave me in prostration as long as He will let me (in that state), and then He will say, 'O Muhammad, raise your head and speak, for you will be listened to, and intercede, for your intercession will be accepted, and ask, your request will be granted.' \" The Prophet (ﷺ) added, \"So I will raise my head and glorify and praise Him as He has taught me. Then I will intercede and He will put a limit for me (to intercede for a certain type of people). I will take them out and let them enter Paradise.\" (Qatada added: I heard Anas saying that) the Prophet said, 'I will go out and take them out of Hell (Fire) and let them enter Paradise, and I will return for the third time and will ask my Lord for permission to enter His house, and I will be allowed to enter. When I see Him, I will fall down in prostration before Him, and will remain in prostration as long as He will, and then He will say, 'Raise your head, O Muhammad, and speak, for you will be listened to, and intercede, for your intercession will be accepted, and ask, for your request will be granted.' So I will raise my head and praise Allah as He has taught me and then I will intercede and He will put a limit for me (to intercede for a certain type of people). I will take them out and let them enter Paradise.\" (Qatada said: I heard Anas saying that) the Prophet (ﷺ) said, \"So I will go out and take them out of Hell (Fire) and let them enter Paradise, till none will remain in the Fire except those whom Quran will imprison (i.e., those who are destined for eternal life in the fire).\" The narrator then recited the Verse:-- \"It may be that your Lord will raise you to a Station of Praise and Glory.' (17.79) The narrator added: This is the Station of Praise and Glory which Allah has promised to your Prophet",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 66
			}
		}
	]
}