{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7510,
			"arabicnumber": 7510,
			"text": "Narrated Ma`bad bin Hilal Al-`Anzi:We, i.e., some people from Basra gathered and went to Anas bin Malik, and we went in company with Thabit Al-Bunnani so that he might ask him about the Hadith of Intercession on our behalf. Behold, Anas was in his palace, and our arrival coincided with his Duha prayer. We asked permission to enter and he admitted us while he was sitting on his bed. We said to Thabit, \"Do not ask him about anything else first but the Hadith of Intercession.\" He said, \"O Abu Hamza! There are your brethren from Basra coming to ask you about the Hadith of Intercession.\" Anas then said, \"Muhammad talked to us saying, 'On the Day of Resurrection the people will surge with each other like waves, and then they will come to Adam and say, 'Please intercede for us with your Lord.' He will say, 'I am not fit for that but you'd better go to Abraham as he is the Khalil of the Beneficent.' They will go to Abraham and he will say, 'I am not fit for that, but you'd better go to Moses as he is the one to whom Allah spoke directly.' So they will go to Moses and he will say, 'I am not fit for that, but you'd better go to Jesus as he is a soul created by Allah and His Word.' (Be: And it was) they will go to Jesus and he will say, 'I am not fit for that, but you'd better go to Muhammad.' They would come to me and I would say, 'I am for that.' Then I will ask for my Lord's permission, and it will be given, and then He will inspire me to praise Him with such praises as I do not know now. So I will praise Him with those praises and will fall down, prostrate before Him. Then it will be said, 'O Muhammad, raise your head and speak, for you will be listened to; and ask, for your will be granted (your request); and intercede, for your intercession will be accepted.' I will say, 'O Lord, my followers! My followers!' And then it will be said, 'Go and take out of Hell (Fire) all those who have faith in their hearts, equal to the weight of a barley grain.' I will go and do so and return to praise Him with the same praises, and fall down (prostrate) before Him. Then it will be said, 'O Muhammad, raise your head and speak, for you will be listened to, and ask, for you will be granted (your request); and intercede, for your intercession will be accepted.' I will say, 'O Lord, my followers! My followers!' It will be said, 'Go and take out of it all those who have faith in their hearts equal to the weight of a small ant or a mustard seed.' I will go and do so and return to praise Him with the same praises, and fall down in prostration before Him. It will be said, 'O, Muhammad, raise your head and speak, for you will be listened to, and ask, for you will be granted (your request); and intercede, for your intercession will be accepted.' I will say, 'O Lord, my followers!' Then He will say, 'Go and take out (all those) in whose hearts there is faith even to the lightest, lightest mustard seed. (Take them) out of the Fire.' I will go and do so.\"' When we left Anas, I said to some of my companions, \"Let's pass by Al-Hasan who is hiding himself in the house of Abi Khalifa and request him to tell us what Anas bin Malik has told us.\" So we went to him and we greeted him and he admitted us. We said to him, \"O Abu Sa`id! We came to you from your brother Anas Bin Malik and he related to us a Hadith about the intercession the like of which I have never heard.\" He said, \"What is that?\" Then we told him of the Hadith and said, \"He stopped at this point (of the Hadith).\" He said, \"What then?\" We said, \"He did not add anything to that.\" He said, Anas related the Hadith to me twenty years ago when he was a young fellow. I don't know whether he forgot or if he did not like to let you depend on what he might have said.\" We said, \"O Abu Sa`id ! Let us know that.\" He smiled and said, \"Man was created hasty. I did not mention that, but that I wanted to inform you of it. Anas told me the same as he told you and said that the Prophet (ﷺ) added, 'I then return for a fourth time and praise Him similarly and prostrate before Him me the same as he 'O Muhammad, raise your head and speak, for you will be listened to; and ask, for you will be granted (your request): and intercede, for your intercession will be accepted .' I will say, 'O Lord, allow me to intercede for whoever said, 'None has the right to be worshiped except Allah.' Then Allah will say, 'By my Power, and my Majesty, and by My Supremacy, and by My Greatness, I will take out of Hell (Fire) whoever said: 'None has the right to be worshipped except Allah",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 135
			}
		}
	]
}