{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7517,
			"arabicnumber": 7517,
			"text": "Narrated Anas bin Malik:The night Allah's Messenger (ﷺ) was taken for a journey from the sacred mosque (of Mecca) Al-Ka`ba: Three persons came to him (in a dreamy while he was sleeping in the Sacred Mosque before the Divine Inspiration was revealed to Him. One of them said, \"Which of them is he?\" The middle (second) angel said, \"He is the best of them.\" The last (third) angle said, \"Take the best of them.\" Only that much happened on that night and he did not see them till they came on another night, i.e. after The Divine Inspiration was revealed to him. (Fath-ul-Bari Page 258, Vol. 17) and he saw them, his eyes were asleep but his heart was not----and so is the case with the prophets: their eyes sleep while their hearts do not sleep. So those angels did not talk to him till they carried him and placed him beside the well of Zamzam. From among them Gabriel took charge of him. Gabriel cut open (the part of his body) between his throat and the middle of his chest (heart) and took all the material out of his chest and `Abdomen and then washed it with Zamzam water with his own hands till he cleansed the inside of his body, and then a gold tray containing a gold bowl full of belief and wisdom was brought and then Gabriel stuffed his chest and throat blood vessels with it and then closed it (the chest). He then ascended with him to the heaven of the world and knocked on one of its doors. The dwellers of the Heaven asked, 'Who is it?' He said, \"Gabriel.\" They said, \"Who is accompanying you?\" He said, \"Muhammad.\" They said, \"Has he been called?\" He said, \"Yes\" They said, \"He is welcomed.\" So the dwellers of the Heaven became pleased with his arrival, and they did not know what Allah would do to the Prophet (ﷺ) on earth unless Allah informed them. The Prophet (ﷺ) met Adam over the nearest Heaven. Gabriel said to the Prophet, \"He is your father; greet him.\" The Prophet (ﷺ) greeted him and Adam returned his greeting and said, \"Welcome, O my Son! O what a good son you are!\" Behold, he saw two flowing rivers, while he was in the nearest sky. He asked, \"What are these two rivers, O Gabriel?\" Gabriel said, \"These are the sources of the Nile and the Euphrates.\" Then Gabriel took him around that Heaven and behold, he saw another river at the bank of which there was a palace built of pearls and emerald. He put his hand into the river and found its mud like musk Adhfar. He asked, \"What is this, O Gabriel?\" Gabriel said, \"This is the Kauthar which your Lord has kept for you.\" Then Gabriel ascended (with him) to the second Heaven and the angels asked the same questions as those on the first Heaven, i.e., \"Who is it?\" Gabriel replied, \"Gabriel\". They asked, \"Who is accompanying you?\" He said, \"Muhammad.\" They asked, \"Has he been sent for?\" He said, \"Yes.\" Then they said, \"He is welcomed.'' Then he (Gabriel) ascended with the Prophet (ﷺ) to the third Heaven, and the angels said the same as the angels of the first and the second Heavens had said. Then he ascended with him to the fourth Heaven and they said the same; and then he ascended with him to the fifth Heaven and they said the same; and then he ascended with him to the sixth Heaven and they said the same; then he ascended with him to the seventh Heaven and they said the same. On each Heaven there were prophets whose names he had mentioned and of whom I remember Idris on the second Heaven, Aaron on the fourth Heavens another prophet whose name I don't remember, on the fifth Heaven, Abraham on the sixth Heaven, and Moses on the seventh Heaven because of his privilege of talking to Allah directly. Moses said (to Allah), \"O Lord! I thought that none would be raised up above me.\" But Gabriel ascended with him (the Prophet) for a distance above that, the distance of which only Allah knows, till he reached the Lote Tree (beyond which none may pass) and then the Irresistible, the Lord of Honor and Majesty approached and came closer till he (Gabriel) was about two bow lengths or (even) nearer. (It is said that it was Gabriel who approached and came closer to the Prophet. (Fate Al-Bari Page 263, 264, Vol. 17). Among the things which Allah revealed to him then, was: \"Fifty prayers were enjoined on his followers in a day and a night.\" Then the Prophet (ﷺ) descended till he met Moses, and then Moses stopped him and asked, \"O Muhammad ! What did your Lord en join upon you?\" The Prophet (ﷺ) replied,\" He enjoined upon me to perform fifty prayers in a day and a night.\" Moses said, \"Your followers cannot do that; Go back so that your Lord may reduce it for you and for them.\" So the Prophet (ﷺ) turned to Gabriel as if he wanted to consult him about that issue. Gabriel told him of his opinion, saying, \"Yes, if you wish.\" So Gabriel ascended with him to the Irresistible and said while he was in his place, \"O Lord, please lighten our burden as my followers cannot do that.\" So Allah deducted for him ten prayers where upon he returned to Moses who stopped him again and kept on sending him back to his Lord till the enjoined prayers were reduced to only five prayers. Then Moses stopped him when the prayers had been reduced to five and said, \"O Muhammad! By Allah, I tried to persuade my nation, Bani Israel to do less than this, but they could not do it and gave it up. However, your followers are weaker in body, heart, sight and hearing, so return to your Lord so that He may lighten your burden.\" The Prophet (ﷺ) turned towards Gabriel for advice and Gabriel did not disapprove of that. So he ascended with him for the fifth time. The Prophet (ﷺ) said, \"O Lord, my followers are weak in their bodies, hearts, hearing and constitution, so lighten our burden.\" On that the Irresistible said, \"O Muhammad!\" the Prophet replied, \"Labbaik and Sa`daik.\" Allah said, \"The Word that comes from Me does not change, so it will be as I enjoined on you in the Mother of the Book.\" Allah added, \"Every good deed will be rewarded as ten times so it is fifty (prayers) in the Mother of the Book (in reward) but you are to perform only five (in practice).\" The Prophet (ﷺ) returned to Moses who asked, \"What have you done?\" He said, \"He has lightened our burden: He has given us for every good deed a tenfold reward.\" Moses said, \"By Allah! I tried to make Bani Israel observe less than that, but they gave it up. So go back to your Lord that He may lighten your burden further.\" Allah's Messenger (ﷺ) said, \"O Moses! By Allah, I feel shy of returning too many times to my Lord.\" On that Gabriel said, \"Descend in Allah's Name.\" The Prophet (ﷺ) then woke while he was in the Sacred Mosque (at Mecca)",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 142
			}
		}
	]
}