{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"15": "Invoking Allah for Rain (Istisqaa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1033,
			"arabicnumber": 1033,
			"text": "Telah menceritakan kepada kami [Muhammad bin Muqatil] berkata, telah mengabarkan kepada kami ['Abdullah bin Al Mubarak] berkata, telah mengabarkan kepada kami [Al Auza'i] berkata, telah menceritakan kepada kami [Ishaq bin 'Abdullah bin Abu Thalhah Al Anshari] berkata, telah menceritakan kepadaku [Anas bin Malik] berkata, \"Di zaman Rasulullah shallallahu 'alaihi wasallam manusia pernah terkena musibah paceklik kekeringan. Pada hari Jum'at ketika Nabi shallallahu 'alaihi wasallam sedang memberikan khutbah, tiba-tiba seorang Arab badui berdiri dan berkata, \"Wahai Rasulullah, harta benda telah binasa dan telah terjadi kelaparan, maka berdo'alah kepada Allah agar menurunkan hujan untuk kita!\" Anas bin Malik berkata, \"Maka Rasulullah shallallahu 'alaihi wasallam lalu berdoa dengan mengangkat kedua telapak tangannya. Dan saat itu tidak sedikitpun ada awan di langit.\" Anas bin Malik melanjutkan perkataannya, \"Maka awan seperti gunung bergerak. Beliau belum lagi turun dari mimbarnya hingga aku melihat air hujan membasahi jenggotnya. Maka pada hari itu kami mendapatkan hujan hingga esok harinya dan lusa, hingga hari Jum'at berikutnya. Pada hari Jum'at berikut itulah orang Arab badui tersebut, atau orang yang lain berdiri dan berkata, \"Wahai Rasulullah, banyak bangunan yang roboh, harta benda tenggelam dan hanyut, maka berdo'alah kepada Allah untuk kami!\" Rasulullah shallallahu 'alaihi wasallam lalu berdoa dengan mengangkat kedua telapak tangannya: 'ALLAHUMMA HAWAALAINAA WA LAA 'ALAINAA (Ya Allah, turunkanlah hujan di sekeling kami saja dan jangan sampai menimbulkan kerusakan kepada kami) '. Belum lagi beliau memberikan isyarat dengan tangannya ke langit, awan tersebut telah hilang. Saat itu kota Madinah menjadi seperti danau dan aliran-aliran air, bahkan tidak mendapatkan sinar matahari selama satu bulan.\" Anas bin Malik berkata, \"Tidak ada satupun orang yang datang dari segala pelosok kota kecuali akan menceritakan tentang terjadinya hujan yang lebat tersebut",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 28
			}
		}
	]
}