{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"16": "Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Hisyam bin 'Urwah] dari isterinya [Fatimah binti Al Mundzir] dari [Asma' binti Abu Bakar] radliallahu 'anhuma, bahwasanya dia berkata, \"Aku pernah datang menemui 'Aisyah? radliallahu 'anha, isteri Nabi shallallahu 'alaihi wasallam, ketika terjadi gerhana matahari. Ternyata orang-orang sedang melaksanakan shalat dan saat itu ia juga ikut melaksanakannya. Setelah itu aku bertanya kepadanya, \"Apa yang dilakukan orang-orang?\" Aisyah memberi isyarat dengan tangannya ke langit seraya berkata, \"Maha suci Allah!\" Aku bertanya, \"Satu tanda saja?\" Lalu dia memberi isyarat tanda mengiyakan. Maka akupun ikut shalat sementara timbul perkara yang membingungkanku, hingga aku siram kepalaku dengan air. Selesai shalat Rasulullah shallallahu 'alaihi wasallam memuji Allah dan mensucikan-Nya, lalu bersabda: \"Tidak ada sesuatu yang belum diperlihatkan kepadaku, kecuali aku sudah melihatnya dari tempatku ini, hingga surga dan neraka. Kemudian diwahyukan kepadaku, bahwa Kalian akan terkena fitnah dalam kubur kalian seperti, atau seupa dengan fitnah Dajjal -Aku sendiri tidak tahu mana dari keduanya yang dikatakan oleh Asma'-. Salah seorang dari kalian akan dihadapkan lalu ditanya, 'Apa yang kamu ketahui tentang laki-laki ini? ' Orang beriman atau orang yang yakin -Aku tidak tahu mana dari keduanya yang dikatakan ileh Asma'- akan menjawab, 'Dia adalah Muhammad Rasulullah shallallahu 'alaihi wasallam, dia datang kepada kami membawa penjelasan dan petunjuk. Maka kami sambut, kami beriman kepadanya dan kami ikuti (ajarannya).' Maka kepada orang itu dikatakan, 'Tidurlah kamu dengan baik, sungguh kami telah mengetahui bahwa kamu adalah orang yang yaqin.' Adapun orang Munafik atau orang yang ragu - aku tidak tahu mana dari keduanya yang dikatakan oleh Asma'- akan menjawab, 'Aku tidak tahu siapa dia, aku mendengar orang-orang mengatakan sesuatu, maka aku pun ikut mengatakannya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		}
	]
}