{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"19": "Prayer at Night (Tahajjud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1185,
			"arabicnumber": 1185,
			"text": "Telah menceritakan kepada saya [Ishaq] telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [bapakku] dari [Ibnu Syihab] berkata, telah mengabarkan kepada saya [Mahmud bin Ar-Rab' Al Anshary] bahwasanya dia mengingat kejadian bersama Rasulullah shallallahu 'alaihi wasallam diantaranya Beliau shallallahu 'alaihi wasallam pernah menyemburkan air dari mulut Beliau kepadanya dari air yang ada di sumur yang berada di rumah mereka. Mahmud mengabarkan bahwa dia mendengar ['Itban bin Malik Al Anshariy radliallahu 'anhu] seorang shahabat yang pernah mengikuti perang Badar bersama Rasulullah shallallahu 'alaihi wasallam berkata: \"Aku sering memimpin shalat kaumku Bali Salim sedanglan tempat aku dan mereka dipisahkan oleh lembah yang apabila turun hujan akan menghalangi aku mengunjungi masjid mereka. Maka aku menemui Rasulullah shallallahu 'alaihi wasallam, dan aku berkata kepada Beliau: \"Pandanganku sudah buruk, sementara lembah yang ada antara aku dan kaumku saat turun hujan akan menghalangiku mengunjungi mereka. Maka aku menginginkan anda dapat mengunjungi aku lalu shalat di rumahku yang akan aku jadikan sebagai tempat shalat. Maka berkata, Rasulullah shallallahu 'alaihi wasallam: \"Akan saya penuhi\". Maka Rasulullah shallallahu 'alaihi wasallam dan Abu Bakar berangkat ketika siang hari lalu Rasulullah shallallahu 'alaihi wasallam meminta izin, maka aku izinkan. Beliau tidaklah duduk hingga Beliau berkata: \"Mana tempat yang kau sukai untuk aku shalat di rumahmu?\" Maka Beliau aku tunjukkan tempat yang aku sukai untuk aku shalat disana. Maka Nabi shallallahu 'alaihi wasallam berdiri lalu bertakbir. Dan kami pun berdiri membuat shaf di belakang Beliau, lalu Beliau shalat dua raka'at kemudian memberi salam dan kami pun memberi salam ketika Beliau memberi salam. Lalu aku tahan Beliau dengan menyuguhkan makanan dari daging yang kami masak untuk Beliau. Kemudian orang-orang mendengar kehadiran Rasulullah shallallahu 'alaihi wasallam di rumahku. Lalu ada seorang diantara mereka yang mengabarkan sehingga orang-orang bertambah banyak yang berkumpul di rumahku. Berkata seorang dari mereka: \"Apa yang dilakukan aku tidak setuju\". Lalu ada seorang dari mereka yang berkata: \"Inilah munafiq, yang tidak mencintai Allah dan RasulNya\". Maka Rasulullah shallallahu 'alaihi wasallam berkata.: \"Janganlah kamu ucapkan seperti itu. Bukankan kamu tahu dia telah mengucapkan laa ilaaha illallah dengan semata mengharap ridha Allah?\" Orang itu berkata: \"Allah dan RasulNya yang lebih tahu\". Adapun kami, demi Allah 'tidaklah kami melihat kecintaan dan ucapan Beliau ini kecuali untuk orang Munafiqin. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah telah mengharamkan neraka bagi orang yang mengucapkan laa ilaaha illallah dengan mengharap ridha Allah \". Berkata, Mahmud bin Ar-Rabi': \"Kemudian kisah ini aku ceritakan kepada kaum yang dikampung itu terdapat ada Abu Ayyub yang pernah menyertai Rasulullah shallallahu 'alaihi wasallam dalam perang yang Beliau lakukan yang ia menjadi wafat karenanya dan Yazid bin Mu'awiyah yang saat itu menjadi pemimpin mereka dibumi Rum. Maka Abu Ayyub mengingkari apa yang aku ceritakan seraya berkata: \"Demi Allah, aku tidak percaya bahwa Rasulullah shallallahu 'alaihi wasallam mengatakan seperti yang kamu ceritakan\". Pernyataan Abu Ayyub ini membuat aku sangat berat menerimanya sehingga aku serahkan diriku kepada Allah Ta'ala agar menyelamatkan aku sampai aku kembali dari perangku ini dengan tujuan agar aku bisa menanyakan hal ini kepada 'Itban bin Malik radliallahu 'anhu jika aku menjumpainya masih hidup di masjid kaumnya. Maka aku kembali lalu aku bertalbiyah (memulai) hajji dan 'umrah. Setelah itu aku pergi berjalan hingga sampai di kota Madinah. Kemudian aku mendatangi Bani Salim, disana aku jumpai 'Itban dalam kondisi yang sudah sangat tua dan telah buta matanya sedang shalat bersama kaumnya. Setelah selesai salam dari shalatnya aku memberi salam kepadanya lalu aku memberi tahu siapa aku lalu aku bertanya kepadanya tentang kisah yang aku maksud. Maka dia menceritakan kepadaku sebagaimana dia pernah menceritakan kali pertama dulu",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 62
			}
		}
	]
}