{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"3": "Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 122,
			"arabicnumber": 122,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] berkata, telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami ['Amru] berkata, telah mengabarkan kepadaku [Sa'id bin Jubair] berkata, aku berkata kepada [Ibnu 'Abbas], \"Sesungguhnya Nauf Al Bakali menganggap bahwa Musa bukanlah Musa Bani Isra'il, tapi Musa yang lain.\" Ibnu Abbas lalu berkata, \"Musuh Allah itu berdusta, sungguh [Ubay bin Ka'b] telah menceritakan kepada kami dari Nabi shallallahu 'alaihi wasallam: \"Musa Nabi Allah berdiri di hadapan Bani Isra'il memberikan khutbah, lalu dia ditanya: \"Siapakah orang yang paling pandai?\" Musa menjawab: \"Aku.\" Maka Allah Ta'ala mencelanya karena dia tidak diberi pengetahuan tentang itu. Lalu Allah Ta'ala memahyukan kepadanya: \"Ada seorang hamba di antara hamba-Ku yang tinggal di pertemuan antara dua lautan lebih pandai darimu.\" Lalu Musa berkata, \"Wahai Rabb, bagaimana aku bisa bertemu dengannya?\" Maka dikatakan padanya: \"Bawalah ikan dalam keranjang, bila nanti kamu kehilangan ikan itu, maka itulah petunjuknya.\" Lalu berangkatlah Musa bersama pelayannya yang bernama Yusya' bin Nun, dan keduanya membawa ikan dalam keranjang hingga keduanya sampai pada batu besar. Lalu keduanya meletakkan kepalanya di atas batu dan tidur. Kemudian keluarlah ikan itu dari keranjang (lalu ikan itu melompat mengambil jalannya ke laut itu) ' (Qs. Al Kahfi: 61). Kejadian ini mengherankan Musa dan muridnya, maka keduanya melanjutkan sisa malam dan hari perjalannannya. Hingga pada suatu pagi Musa berkata kepada pelayannya, '(Bawalah kemari makanan kita, sesungguhnya kita telah merasa lelah karena perjalanan kita ini) ' (Qs. Al Kahfi: 62). Musa tidak merasakan kelelahan kecuali setelah sampai pada tempat yang dituju sebagaimana diperintahkan. Maka muridnya berkata kepadanya: '(Tahukah kamu ketika kita mencari tempat berlindung di batu tadi? Sesungguhnya aku lupa menceritakan ikan itu. Dan tidaklah yang melupakan aku ini kecuali setan) ' (Qs. Al Kahfi: 63). Musa lalu berkata: '(Itulah tempat yang kita cari. Lalu keduanya kembali mengikuti jejak mereka semula) ' (Qs. Al Kahfi: 64). Ketika keduanya sampai di batu tersebut, didapatinya ada seorang laki-laki mengenakan pakaian yang lebar, Musa lantas memberi salam. Khidlir lalu berkata, \"Bagaimana cara salam di tempatmu?\" Musa menjawab, \"Aku adalah Musa.\" Khidlir balik bertanya, \"Musa Bani Isra'il?\" Musa menjawab, \"Benar.\" Musa kemudian berkata: '(Bolehkah aku mengikutimu supaya kamu mengajarkan kepadaku ilmu yang benar di antara ilmu-ilmu yang telah diajarkan kepadamu?) ' Khidlir menjawab: \"Sesungguhnya kamu sekali-kali tidak akan sanggup sabar bersama Aku) ' (Qs. Al Kahfi: 66-67). Khidlir melanjutkan ucapannya, \"Wahai Musa, aku memiliki ilmu dari ilmunya Allah yang Dia mangajarkan kepadaku yang kamu tidak tahu, dan kamu juga punya ilmu yang diajarkan-Nya yang aku juga tidak tahu.\" Musa berkata: '(Insya Allah kamu akan mendapati aku sebagai orang yang sabar, dan aku tidak akan menentangmu dalam sesuatu urusanpun) ' (Qs. Al Kahfi: 69). Maka keduanya berjalan kaki di tepi pantai sementara keduanya tidak memiliki perahu, lalu melintaslah sebuah perahu kapal. Mereka berbicara agar orang-orang yang ada di perahu itu mau membawa keduanya. Karena Khidlir telah dikenali maka mereka pun membawa keduanya dengan tanpa bayaran. Kemudian datang burung kecil hinggap di sisi perahu mematuk-matuk di air laut untuk minum dengan satu atau dua kali patukan. Khidlir lalu berkata, \"Wahai Musa, ilmuku dan ilmumu bila dibandingkan dengan ilmu Allah tidaklah seberapa kecuali seperti patukan burung ini di air lautan.\" Kemudian Khidlir sengaja mengambil papan perahu lalu merusaknya. Musa pun berkata, \"Mereka telah membawa kita dengan tanpa bayaran, tapi kenapa kamu merusaknya untuk menenggelamkan penumpangnya?\" Khidlir berkata: '(Bukankah aku telah berkata, \"Sesungguhnya kamu sekali-kali tidak akan sabar bersama dengan aku) ' Musa menjawab: '(Janganlah kamu menghukum aku karena kelupaanku dan janganlah kamu membebani aku dengan sesuatu kesulitan dalam urusanku) ' (Qs. Al Kahfi: 72-73). Kejadian pertama ini karena Musa terlupa. Kemudian keduanya pergi hingga bertemu dengan anak kecil yang sedang bermain dengan dua temannya. Khidlir lalu memegang kepala anak itu, mengangkat dan membantingnya hingga mati. Maka Musa pun bertanya: '(Mengapa kamu membunuh jiwa yang bersih, bukan karena dia membunuh orang lain?) ' (Qs. Al Kahfi: 74). Khidlir menjawab: '(Bukankah sudah kukatakan kepadamu, bahwa sesungguhnya kamu tidak akan dapat sabar bersamaku?) ' (Qs. Al Kahfi: 75). Ibnu 'Uyainah berkata, \"Ini adalah sebuah penegasan. '(Maka keduanya berjalan hingga tatkala keduanya sampai kepada penduduk suatu negeri, mereka minta dijamu kepada penduduk negeri itu, tetapi penduduk negeri itu tidak mau menjamu mereka. Kemudian keduanya mendapatkan dalam negeri itu dinding rumah yang hampir roboh. Maka Khidlir menegakkan dinding itu) ' (Qs. Al Kahfi: 77). Rasulullah meneruskan ceritanya: \"Khidlir melakukannya dengan tangannya sendiri. Lalu Musa berkata, '(Jikalau kamu mau, niscaya kamu mengambil upah untuk itu. Khidlir menjawab, \"Inilah saat perpisahan antara aku dan kamu) ' (Qs. Al Kahfi: 77-78). Nabi shallallahu 'alaihi wasallam bersabda: \"Semoga Allah merahmati Musa. Kita sangat berharap sekiranya Musa bisa sabar sehingga akan banyak cerita yang bisa kita dengar tentang keduanya",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 64
			}
		}
	]
}