{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"23": "Funerals (Al-Janaa'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Ibnu Syihab] dari ['Amir bin Sa'ad bin Abu Waqash] dari [bapaknya] radliallahu 'anhu berkata; Rasulullah Shallallahu'alaihiwasallam pernah mengunjungiku pada hari Haji Wada' (perpisahan) saat sakitku sudah sangat parah, lalu aku berkata: \" Sakitku sudah sangat parah (menjelang kematianku) dan aku banyak memiliki harta sedangkan tidak ada yang akan mewarisinya kecuali anak perempuanku. Bolehkah aku menyedekahkan sepertiga dari hartaku ini?. Beliau menjawab: \"Tidak boleh\". Aku katakan lagi: \"Bagaimana kalau setengahnya?\". Beliau menjawab: \"Tidak boleh\". Kemudian Beliau melanjutkan: \"Sepertiga dan sepertiga itu sudah besar atau banyak. Sesungguhnya kamu bila meninggalkan ahli warismu dalam keadaan berkecukupan (kaya) itu lebih baik dari pada kamu meninggalkan mereka serba kekurangan sehingga nantinya mereka meminta-minta kepada manusia. Dan kamu tidaklah menginfaqkan suatu nafaqah yang hanya kamu hanya niatkan mencari ridha Allah kecuali kamu pasti diberi balasan pahala atasnya bahkan sekalipun nafkah yang kamu berikan untuk mulut isterimu\". Lalu aku bertanya: \"Wahai Rasulullah, apakah aku diberi umur panjang setelah sahabat-sahabatku?. Beliau berkata,: \"Tidaklah sekali-kali engkau diberi umur panjang lalu kamu beramal shalih melainkan akan bertambah derajat dan kemuliaanmu. Dan semoga kamu diberi umur panjang sehingga orang-orang dapat mengambil manfaat dari dirimu dan juga mungkin dapat mendatangkan madharat bagi kaum yang lain. Ya Allah sempurnakanlah pahala hijrah sahabat-sahabatku dan janganlah Engkau kembalikan mereka ke belakang\". Namun Sa'ad bin Khaulah membuat Rasulullah Shallallahu'alaihiwasallam bersedih karena dia akhirnya meningal dunia di Makkah",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 53
			}
		}
	]
}