{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"23": "Funerals (Al-Janaa'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1386,
			"arabicnumber": 1386,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Jarir bin Hazim] telah menceritakan kepada kami [Abu Raja'] dari [Samrah bin Jundab] berkata; Sudah menjadi kebiasaan Nabi Shallallahu'alaihiwasallam bila selesai melaksanakan suatu shalat, Beliau menghadapkan wajahnya kepada kami lalu berkata,: \"Siapa diantara kalian yang tadi malam bermimpi\". Dia (Samrah bin Jundab) berkata,: \"Jika ada seorang yang bermimpi maka orang itu akan menceritakan, saat itulah Beliau berkata,: \"Maa sya-allah\" (atas kehendak Allah) \". Pada suatu hari yang lain Beliau bertanya kepada kami: \"Apakah ada diantara kalian yang bermimpi?\". Kami menjawab: \"Tidak ada\". Beliau berkata,: \"Tetapi aku tadi malam bermimpi yaitu ada dua orang laki-laki yang mendatangiku kemudian keduanya memegang tanganku lalu membawaku ke negeri yang disucikan (Al Muqaddasah), ternyata disana ada seorang laki-laki yang sedang berdiri dan yang satunya lagi duduk yang di tangannya memegang sebatang besi yang ujungnya bengkok (biasanya untuk menggantung sesuatu). Sebagian dari sahabat kami berkata, dari Musa bahwa: batang besi tersebut dimasukkan ke dalam satu sisi mulut (dari geraham) orang itu hingga menembus tengkuknya. Kemudian dilakukan hal yang sama pada sisi mulut yang satunya lagi, lalu dilepas dari mulutnya dan dimasukkan kembali dan begitu seterusnya diperlakukan. Aku bertanya: \"Apa ini maksudnya?\". Kedua orang yang membawaku berkata,: \"Berangkatlah\". Maka kami berangkat ke tempat lain dan sampai kepada seorang laki-laki yang sedang berbaring bersandar pada tengkuknya, sedang ada laki-laki lain yang berdiri diatas kepalanya memegang batu atau batu besar untuk menghancurkan kepalanya. Ketika dipukulkan, batu itu menghancurkan kepala orang itu, Maka orang itu menghampirinya untuk mengambilnya dan dia tidak berhenti melakukan ini hingga kepala orang itu kembali utuh seperti semula, kemudian dipukul lagi dengan batu hingga hancur. Aku bertanya: \"Siapakah orang ini?\". Keduanya menjawab: \"Berangkatlah\". Maka kamipun berangkat hingga sampai pada suatu lubang seperti dapur api dimana bagian atasnya sempit dan bagian bawahnya lebar dan dibawahnya dinyalakan api yang apabila api itu didekatkan, mereka (penghuninya) akan terangkat dan bila dipadamkan penghuninya akan kembali kepadanya, penghuninya itu terdiri dari laki-laki dan perempuan. Aku bertanya: \"Siapakah mereka itu?\". Keduanya menjawab: \"Berangkatlah\". Maka kami pun berangkat hingga sampai di sebuah sungai yang airnya adalah darah, disana ada seorang laki-laki yang berdiri di tengah-tengah sungai\". Berkata, [Yazid] dan [Wahb bin Jarir] dari [Jarir bin Hazim]: 'Dan di tepi sungai ada seorang laki-laki yang memegang batu. Ketika orang yang berada di tengah sungai menghadapnya dan bermaksud hendak keluar dari sungai maka laki-laki yang memegang batu melemparnya dengan batu kearah mulutnya hingga dia kembali ke tempatnya semula di tengah sungai, dan terjadilah seterusnya begitu, setiap dia hendak keluar dari sungai, akan dilempar dengan batu sehingga kembali ke tempatnya semula. Aku bertanya: \"Apa maksudnya ini?\" Keduanya menjawab: \"Berangkatlah\". Maka kamipun berangkat hingga sampai ke suatu taman yang hijau, didalamnya penuh dengan pepohonan yang besar-besar sementara dibawahnya ada satu orang tua dan anak-anak dan ada seorang yang berada dekat dengan pohon yang memegang api, manakala dia menyalakan api maka kedua orang yang membawaku naik membawaku memanjat pohon lalu keduanya memasukkan aku ke sebuah rumah (perkampungan) yang belum pernah aku melihat seindah itu sebelumnya dan didalamnya ada para orang laki-laki, orang-orang tua, pemuda, wanita dan anak-anak lalu keduanya membawa aku keluar dari situ lalu membawaku naik lagi ke atas pohon, lalu memasukkan aku ke dalam suatu rumah yang lebih baik dan lebih indah, didalamnya ada orang-orang tua dan para pemuda. Aku berkata: \"Ajaklah aku keliling malam ini dan terangkanlah tentang apa yang aku sudah lihat tadi\". Maka keduanya berkata,: \"Baiklah. Adapun orang yang kamu lihat mulutnya ditusuk dengan besi adalah orang yang suka berdusta dan bila berkata selalu berbohong, maka dia dibawa hingga sampai ke ufuq lalu dia diperlakukan seperti itu hingga hari qiyamat. Adapun orang yang kamu lihat kepalanya dipecahkan adalah seorang yang telah diajarkan Al Qur'an oleh Allah lalu dia tidur pada suatu malam namun tidak melaksanakan Al Qur'an pada siang harinya, lalu dia diperlakukan seperti itu hingga hari qiyamat. Dan orang-orang yang kamu lihat berada didalam dapur api mereka adalah para pezina sedangkan orang yang kamu lihat berada di tengah sungai adalah mereka yang memakan riba' sementara orang tua yang berada dibawah pohon adalah Nabi Ibrahim 'alaihissalam, sedangkan anak-anak yang ada disekitarnnya adalah anak-anak kecil manusia. Adapun orang yang menyalakan api adalah malaikat penunggu neraka sedangkan rumah pertama yang kamu masuki adalah rumah bagi seluruh kaum mu'minin sedangkan rumah yang ini adalah perkampungan para syuhada' dan aku adalah Jibril dan ini adalah Mika'il, maka angkatlah kepalamu. Maka aku mengangkat kepalaku ternyata diatas kepalaku ada sesuatu seperti awan. Keduanya berkata,: \"Itulah tempatmu\". Aku berkata: \"Biarkanlah aku memasuki rumahku\". Keduanya berkata,: \" Umurmu masih tersisa dan belum selesai dan seandainya sudah selesai waktunya kamu pasti akan memasuki rumahmu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 138
			}
		}
	]
}