{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"24": "Obligatory Charity Tax (Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"text": "Telah menceritakan kepada kami [Mu'adz bin Fadhalah] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Hilal bin Abu Maimunah] telah menceritakan kepada kami ['Atha' bin Yasar] bahwa dia mendengar [Abu Sa'id Al Khudriy radliallahu 'anhu] menceritakan bahwa Nabi Shallallahu'alaihiwasallam suatu hari duduk diatas mimbar dan kami pun duduk didekatnya lalu Beliau berkata,: \"Sesungguhnya diantara yang aku khawatirkan terjadi pada kalian sepeninggalku adalah apabila telah dibuka untuk kalian (keindahan) dunia serta perhiasannya\". Tiba-tiba ada seorang laki-laki berkata,: \"Wahai Rasulullah, apakah kebaikan dapat mendatangkan keburukan?\". Maka Nabi Shallallahu'alaihiwasallam terdiam. Dikatakan kepada orang yang bertanya tadi; \"Apa yang telah kamu lakukan, kamu mengajak Nabi Shallallahu'alaihiwasallam berbicara yang membuat Beliau tidak berbicara kepadamu\". Maka kami melihat bahwa wahyu sedang turun kepada Beliau. Abu Said berkata,: \"Beliau mengusap keringatnya yang banyak lalu berkata,: \"Mana orang yang bertanya tadi?\". Lalu nampak Beliau memuji Allah seraya bersabda: \"Kebaikan tidak akan mendatangkan keburukan. Sesungguhnya apa yang ditumbuhkan pada musim semi dapat membinasakan atau dapat mendekatkan kepada kematian kecuali seperti (ternak) pemakan dedaunan hijau yang apabila sudah kenyang dia akan memandang matahari lalu mencret kemudian kencing lalu dia kembali merumput (makan lagi). Dan sungguh harta itu seperti dedaunan hijau yang manis. Maka beruntunglah seorang muslim yang dengan hartanya dia memberi orang-orang miskin, anak yatim dan ibnu sabil (musafir yang kehabisan bekal) \". Atau seperti yang didabdakan oleh Nabi Shallallahu'alaihiwasallam: \"Dan sesungguhnya barangsiapa yang mengambil harta dunia tanpa hak ia seperti orang yang memakan namun tidak pernah kenyang dan harta itu akan menjadi saksi yang menuntutnya pada hari qiyamat",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 67
			}
		}
	]
}