{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"24": "Obligatory Charity Tax (Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1466,
			"arabicnumber": 1466,
			"text": "Telah menceritakan kepada kami ['Umar bin Hafsh] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada saya [Syaqiq] dari ['Amru bin Al Harits] dari [Zainab] isteri 'Abdullah radliallahu 'anhuma berkata,, lalu dia menceritakannya kepada Ibrahim. Dan diriwayatkan pula, telah menceritakan kepada saya [Ibrahim] dari [Abu 'Ubaidah] dari ['Amru bin Al Harits] dari [Zainab] isteri 'Abdullah radliallahu 'anhua sama seperti ini, berkata,: \"Aku pernah berada di masjid lalu aku melihat Nabi Shallallahu'alaihiwasallam. Kemudian Beliau bersabda: \"Bershadaqahlah kalian walau dari perhiasan kalian\". Pada saat itu Zainab berinfaq untuk 'Abdullah dan anak-anak yatim di rumahnya. Dia ('Amru bin Al Harits) berkata,:; Zainab berkata, kepada 'Abdullah: \"Tanyakanlah kepada Rasulullah Shallallahu'alaihiwasallam apakah aku akan mendapat pahala bila aku menginfaqkan shadaqah (zakat) ku kepadamu dan kepada anak-anak yatim dalam rumahku\". Maka 'Abdullah berkata,: \"Tanyakanlah sendiri kepada Rasulullah Shallallahu'alaihiwasallam \". Maka aku berangkat untuk menemui Nabi Shallallahu'alaihiwasallam dan aku mendapatkan seorang wanita Anshar di depan pintu yang sedang menyampaikan keperluannya seperti keperluanku. Kemudian Bilal lewat di hadapan kami maka kami berkata: \"Tolong tanyakan kepada Nabi Shallallahu'alaihiwasallam, apakah aku akan mendapat pahala bila aku meninfaqkan shadaqah (zakat) ku kepada suamiku dan kepada anak-anak yatim yang aku tanggung dalam rumahku?\". Dan kami tambahkan agar dia (Bilal) tidak menceritakan siapa kami. Maka Bilal masuk lalu bertanya kepada Beliau. Lalu Beliau bertanya: \"Siapa kedua wanita itu?\". Bilal berkata,: \"Zainab\". Beliau bertanya lagi: \"Zainab yang mana?\". Dikatakan: \"Zainab isteri 'Abdullah\". Maka Beliau bersabda: \"Ya benar, baginya dua pahala, yaitu pahala (menyambung) kekerabatan dan pahala zakatnya",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 68
			}
		}
	]
}