{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "Telah menceritakan kepada kami [Muhammad bin Abu Bakar Al Muqaddamiy] telah menceritakan kepada kami [Fudhail bin Sulaiman] berkata, telah menceritakan kepada saya [Musa bin 'Uqbah] berkata, telah mengabarkan kepada saya [Kuraib] dari ['Abdullah bin 'Abbas RAa] berkata: \"Nabi shallallahu 'alaihi wasallam berangkat dari Madinah setelah Beliau menyisir rambutnya dan memolesnya dengan minyak zaitun. Dan Beliau mengenakan baju dan rida'nya, begitu juga para sahabat Beliau. Beliau tidak melarang apapun mengenai rida' (selendang panjang) dan baju untuk dipakai kecuali minyak wangi (za'faran) yang masih tersisa pada kulit badan. Ketika paginya berada di Dzul Hulaifah, Beliau berangkat dengan mengendarai tunggangannya hingga sampai di padang sahara saat siang hari. Maka disitulah Beliau memulai ihram dengan bertalbiyyah begitu juga para sahabatnya. Lalu Beliau menandai hewan qurbannya. Ini terjadi pada lima hari terakhir dari bulan Dzul Qa'dah. Lalu Beliau sampai di Makkah pada malam keempat dari bulan Dzul Hijjah lalu Beliau melaksanakan thowaf di Baitulloh, lalu sa'i antara bukit Shafaa dan Marwah dan Beliau belum lagi bertahallul karena Beliau membawa hewan qurban yang telah ditandainya. Kemudian Beliau singgah di tempat yang tinggi di kota Makkah di Al Hajjun, yang dari tempat itu Beliau berniat memulai hajji. Beliau tidak mendekati Ka'bah setelah melaksanakan thowafnya disana hingga Beliau kembali dari 'Arafah lalu Beliau memerintahkan para sahabatnya agar melaksanakan thowaf di Baitulloh dan sa'iy antara bukit Shafaa dan Marwah kemudian memerintahkan pula agar mereka memotong rambut mereka lalu bertahallul. Ketentuan ini berlaku bagi mereka yang tidak membawa hewan sembelihan (qurban). Maka barangsiapa yang ada isterinya bersamanya, isterinya itu halal baginya begitu juga memakai wewangian dan pakaian (baju)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 31
			}
		}
	]
}