{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy], berkata, ['Urwah]: Aku bertanya kepada ['Aisyah radliallahu 'anha], kataku kepadanya: \"Bagaimana pendapatmu tentang firman Allah Ta'ala (QS Al Baqarah 158) yang artinya: (\"Sesungguhnya Ash-Shafaa dan Al Marwah adalah sebahagian dari syi'ar-syi'ar Allah, maka barangsiapa yang beribadah haji ke Baitullah atau ber'umrah, maka tidak ada dosa baginya mengerjakan sa'iy antara keduanya\"), dan demi Allah tidak ada dosa bagi seseorang untuk tidak ber thawaf (sa'iy) antara bukit Ash-Shafaa dan Al Marwah\". 'Aisyah radliallahu 'anha berkata: \"Buruk sekali apa yang kamu katakan itu wahai putra saudariku. Sesungguhnya ayat ini bila tafsirannya menurut pendapatmu tadi berarti tidak berdosa bila ada orang yang tidak melaksanakan sa'iy antara keduanya. Akan tetapi ayat ini turun berkenaan dengan Kaum Anshar, yang ketika mereka belum masuk Islam, mereka berniat hajji untuk patung Manat Sang Thoghut yang mereka sembah di daerah Al Musyallal. Waktu itu, barangsiapa yang berniat hajji, dia merasa berdosa bila harus sa'iy antara bukit Ash-Shafaa dan Al Marwah (karena demi menghormatii patung mereka itu). Setelah mereka masuk Islam, mereka bertanya kepada Rasulullah Shallallahu'alaihiwasallam tentang masalah itu, mereka berkata: \"Wahai Rasulullah, kami merasa berdosa bila melaksanakan sa'iy antara bukit Ash-Shafaa dan Al Marwah\". Maka kemudian Allah Ta'ala menurunkan ayat (\"Sesungguhnya Ash-Shafaa dan Al Marwah adalah sebahagian dari syi'ar-syi'ar Allah\"). 'Aisyah radliallahu 'anha berkata: \"Sungguh Rasulullah Shallallahu'alaihiwasallam telah mencontohkan sa'iy antara kedua bukit tersebut dan tidak boleh seorangpun untuk meninggalkannya\". Kemudian aku kabarkan hal ini kepada Abu Bakar bin 'Abdurrahman, maka katanya: \"Sungguh ini suatu ilmu yang aku belum pernah mendengar sebelumnya, padahal aku sudah mendengar dari orang-orang ahli ilmu yang menyebutkan bahwa diantara manusia, selain orang-orang yang diterangkan oleh 'Aisyah radliallahu 'anha itu, ada yang dahulu melaksanakan ihram untuk Manat, mereka juga melaksanakan sa'iy antara bukit Ash-Shafaa dan Al Marwah. Ketika Allah menyebutkan thawaf di Ka'bah Baitullah tapi tidak menyebut sa'iy antara bukit Ash-Shafaa dan Al Marwah dalam Al Qur'an, mereka bertanya kepada: \"Wahai Rasulullah, dahulu kami melaksanakan thawaf (sa'iy) antara bukit Ash-Shafaa dan Al Marwah dan Allah telah menurunkan ayat tentang thawaf di Ka'bah Baitullah tanpa menyebut Ash-Shafaa, apakah berdosa bagi kami bila kami sa'iy antara bukit Ash-Shafaa dan Al Marwah?\". Maka Allah Ta'ala menurunkan ayat (\"Sesungguhnya Ash-Shafaa dan Al Marwah adalah sebahagian dari syi'ar Allah\"). Abu Bakar bin 'Abdurrahman berkata: \"Maka aku mendengar bahwa ayat ini turun untuk dua golongan orang yaitu golongan orang-orang yang merasa berdosa karena pernah melaksanakan sa'i antara bukit Ash-Shafaa dan Al Marwah saat mereka masih jahiliyyah (karena pernah melaksanakan untuk patung Manat), dan golongan orang-orang yang pernah melaksanakannya namun merasa berdosa bila melaksanakannya kembali setelah masuk Islam karena Allah pada mulanya hanya menyebutkan thawaf di Ka'bah Baitullah dan tidak menyebut Ash-Shafaa hingga kemudian Dia menyebutkannya setelah memerintahkan thawaf di Ka'bah Baitullah",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 125
			}
		}
	]
}