{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "Telah menceritakan kepada kami [Mu'ammal bin Hisyam] telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Hafshah] berkata: \"Dahulu kami melarang anak-anak gadis remaja kami keluar rumah\", hingga datang seorang wanita lalu mendatangi Qashra Banu Khalaf lalu aku menemuinya. Kemudian dia menceritakan tentang saudara perempuannya yang menjadi suami seorang dari sahabat Rasulullah Shallallahu'alaihiwasallam yang pernah ikut berperang bersama Nabi Shallallahu'alaihiwasallam sebanyak dua belas peperangan, dan saudaranya telah mendampingi suaminya dalam enam kali peperangan. Saudara perempuannya berkata: \"Maka (dalam peperangan itu) kami sering mengurus orang yang sakit dan mengobati orang-orang yang terluka. Saudaraku bertanya kepada Nabi Shallallahu'alaihiwasallam.: \"Wahai Rasulullah, apakah berdosa bila seorang dari kami tidak keluar rumah karena tidak memiliki jilbab?\" Beliau Shallallahu'alaihiwasallam menjawab: \"Hendaklah temannya meminjamkan jilbabnya dan agar mereka dapat menyaksikan kebaikan dan mendo'akan Kaum Muslimin\". Berkata, Hafshah: \"Ketika [Ummu 'Athiyah] datang aku menemuinya lalu aku bertanya atau dia berkata, lalu kami bertanya kepadanya. Dan setiap kali dia menceritakan tentang Rasulullah Shallallahu'alaihiwasallam dia selalu mengatakan demi bapakku. Kami bertanya: \"Apakah kamu pernah mendengar Rasulullah Shallallahu'alaihiwasallam berkata, tentang ini dan ini?\". Dia menjawab: \"Iya, demi bapakku\". Beliau bersabda: \"Keluarkanlah para gadis remaja dan wanita-wanita yang dipingit di rumah dan wanita yang sedang haidh agar mereka dapat menyaksikan kebaikah dan mendo'akan Kaum Muslimin namun para wanita yang sedang haidh harus dijauhkan dari tempat shalat\". Aku (Hafshah) bertanya: \"Juga wanita yang sedang haidh?\" Dia berkata: \"Bukankah mereka juga hadir di 'Arafah, dan menyaksikan ini dan itu?",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 133
			}
		}
	]
}