{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1691,
			"arabicnumber": 1691,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari [Salim bin 'Abdullah] bahwa [Ibnu'Umar radliallahu 'anhuma] berkata; Rasulullah Shallallahu'alaihiwasallam melaksanakan hajji tamattu saat hajii wada' dengan dengan menggabungkan niat (berihram) 'umrah dan hajjinya dan Beliau membawa hewan qurban. Beliau menggiring hewan qurbannya dari Dzul Hulaifah lalu Beliau memulai berihram dengan niat 'umrah lalu berihram untuk hajji. Sedangkan orang-orang berhajji tamattu' bersama Nabi Shallallahu'alaihiwasallam dengan niat ihram 'umrah untuk pelaksanaan hajji mereka. Diantara mereka ada yang membawa hewan qurban dan ada yang tidak membawa hewan qurban. Ketika Nabi Shallallahu'alaihiwasallam tiba di Makkah, Beliau berkata, kepada orang banyak: \"Barangsiapa dari kalian yang membawa hewan qurban maka baginya tidak halal suatu apapun yang diharamkan baginya hingga dia menyelesaikan seluruh manasik hajjinya dan siapa dari kalian yang tidak membawa hewan qurban hendaklah dia thawaf di Ka'bah Baitullah dan sa'iy antara bukit Shafaa dan Marwah kemudian dia memotong rambutnya lalu bertahallul. Kemudian dia berihram untuk hajji. Dan siapa yang tidak memiliki hewan qurban hendaklah dia shaum (puasa) selama tiga hari pada masa pelaksanaan hajji dan tujuh hari jika telah kembali kepada keluarganya. Sesuatu yang harus dilakukannya ketika tiba di Makkah adalah thawaf mencium Ar-Rukun (Al Hajar Al Aswad) yang thawaf nya itu dengan berjalan cepat pada tiga putaran dan berjalan biasa pada empat putaran lainnya, kemudian setelah menyelesaikan thawaf nya di Ka'bah Baitullah itu supaya dia shalat dua raka'at dibelakang maqam Ibrahim, kemudian salam dan setelah selesai hendaklah dia menuju bukit Ash-Shafaa lalu melaksanakan sa'iy antara bukit Shafaa dan Marwah tujuh putaran, lalu tidak menghalalkan apa yang diharamkan baginya hingga menyelesaikan manasaik hajjinya dan menyembelih hewan qurban pada hari Nahar. Setelah itu dia bertolak menuju Makkah, lalu thawaf, maka menjadi halallah segala sesuatu yang sebelumnya diharamkan baginya. Maka mereka yang berqurban dan membawa hewan qurban melakukan seperti yang Rasulullah Shallallahu'alaihiwasallam lakukan\". Dan dari ['Urwah] bahwa ['Aisyah radliallahu 'anha] mengabarkannya dari Nabi Shallallahu'alaihiwasallam dalam pelaksanaan haji tamattu' dengan niat 'umrah dalam pelaksanaan hajji Beliau, maka orang-orang berhajji tamattu' bersama Beliau sebagaimana yang dikabarkan kepadaku oleh Salim dari Ibnu'Umar radliallahu 'anhuma dari Rasulullah Shallallahu'alaihiwasallam",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 170
			}
		}
	]
}