{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"34": "Sales and Trade"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2215,
			"arabicnumber": 2215,
			"text": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Abu 'Ashim] telah mengabarkan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepada saya [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu'Umar radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Ada tiga orang yang sedang berjalan kemudian turun hujan lalu ketiganya masuk kedalam gua di sebuah gunung namun kemudian mereka tertutup oleh batu\". Beliau melanjutkan; \"Kemudian diantara mereka berkata kepada yang lainnya; Mintalah kepada Allah dengan perantaraan amal yang paling utama yang kalian pernah melakukannya. Orang pertama diantara mereka berkata; Ya Allah, aku memiliki kedua orangtua yang sudah renta. Suatu hari aku keluar untuk mengembala untuk mendapatkan susu kemudian aku datang membawa susu, lalu aku berikan kepada kedua orangtuaku, lalu keduanya meminum baru kemudian aku berikan minum untuk bayiku, keluarga dan isteriku. Pada suatu malam, aku mencari susu setelah aku kembali dan aku datangi mereka ternyata keduanya sudah tertidur. Dia berkata; Aku enggan untuk membangunkan keduanya untuk meminum susu sedangkan anakku menangis dibawah kakiku karena kelaparan, Begitulah kebiasaanku dan kebiasaan kedua orangtuaku hingga fajar. Ya Allah seandainya Engkau mengetahui apa yang aku kerjakan itu semata mencari ridha Mu, maka bukakanlah celah untuk kami agar kami dapat melihat matahari darinya\". Beliau shallallahu 'alaihi wasallam bersabda: \"Maka terbukalah sedikit celah untuk mereka. Orang kedua berkata: \"Ya Allah, sungguh Engkau mengetahui bahwa aku seorang lelaki yang sangat mencintai seorang wanitaputri dari pamanku seperti kebanyakan laki-laki mencintai wanita. Suatu hari dia berkata, bahwa aku tidak akan bisa mendapatkannya kecuali aku dapat memberi uang sebanyak seratus dinar. Maka aku bekerja dan berhasil mengumpulkan uang tersebut. Ketika aku sudah berhadapan dengannya dan aku hendak menyetubuinya, dia berkata; bertaqwalah kepada Allah, dan janganlah kamu renggut keperawanan kecuali dengan haq\". Maka aku berdiri lalu pergi meninggalkan wanita tersebut. Ya Allah seandainya Engkau mengetahui apa yang aku kerjakan itu semata mencari ridhaMu, maka bukakanlah celah untuk kami\". Beliau shallallahu 'alaihi wasallam bersabda: \"Maka terbukalah dua pertiga dari batu yang menutup pintu gua. Kemudian orang yang ketiga berkata: Ya Allah sungguh Engkau mengetahui bahwa aku pernah memperkerjakan seseorang untuk mengurusi satu benih tumbuhan lalu aku beri upah namun dia tidak mau menerimanya. Lalu aku sengaja mengembangkan benih tersebut sehingga darinya aku bisa membeli seekor sapi dan seorang pengembalanya. Kemudian di suatu hari orang itu datang kepadaku seraya berkata; \"Wahai 'Abdullah, berikanlah upahku yang dulu!\" Lalu aku katakan; Kemarilah lihat kepada seekor sapi dan pemngembalanya itu semua milikmu\". Dia berkata: \"Kamu jangan mengolok-olok aku!\" Dia berkata: Aku katakan: Aku tidak mengolok-olok kamu tetapi itu semua benar milikmu. Ya Allah seandainya Engkau mengetahui apa yang aku kerjakan itu semata mencari ridhaMu, maka bukakanlah celah untuk kami\". Akhirnya mereka bisa terbebas dari gua tersebut",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 162
			}
		}
	]
}