{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"34": "Sales and Trade"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2217,
			"arabicnumber": 2217,
			"text": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] telah menceritakan kepada kami [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah radliallahu 'anhu] berkata; Telah bersabda Nabi shallallahu 'alaihi wasallam: \"Nabi Ibrahim Alaihissalam berhijrah bersama isterinya Sarah lalu memasuki suatu kampung yang dipimpin oleh seorang raja atau seorang yang diktator diantara para penguasa bengis. Ada yang berkata; Nabi Ibrahim datang dengan seorang wanita yang paling cantik. Lalu Nabi Ibrahim dipanggil kemudian ditanya: Wahai Ibrahim, siapakah wanita yang bersamamu itu?\" Nabi Ibrahim berkata: \"Dia adalah saudariku\". Lalu Nabi Ibrahim kembali kepada Sarah dan berkata: \"Janganlah kamu mendustakan perkataanku karena aku telah mengabarkan kepada mereka bahwa kamu adalah saudaraku. Demi Allah sesungguhnya tidak ada orang beriman di tempat ini selain aku dan kamu\". Kemudian Sarah dibawa menghadap raja untuk hidup bersamanya. Maka Sarah berwudhu' lalu shalat seraya berdo'a: \"Ya Allah, sesungguhnya Engkau mengetahui bahwa aku beriman kepadaMu dan kepada RasulMu dan aku memelihara kemaluanku kecuali untuk suamiku maka janganlah Engkau satukan aku dengan orang kafir ini\". Maka tiba-tiba raja itu langkahnya terhenti hingga kakinya tidak menempel ke tanah selain ujung-ujung jari-jemari kakinya. Berkata [Al A'raj], berkata [Abu Salamah bin 'Abdurrahman], [Abu Hurairah radliallahu 'anhu] berkata; Sarah berdo'a: \"Ya Allah, seandainya dia mati nanti akan dikatakan bahwa wanita ini telah membunuhnya\". Maka Sarah dibawa kepada raja itu dan telah berdiri dihadapannya. Maka Sarah berwudhu' lalu shalat seraya berdoa: \"Ya Allah, sesungguhnya Engkau mengetahui bahwa aku beriman kepadaMu dan kepada RasulMu dan aku memelihara kemaluamku kecuali untuk suamiku maka janganlah Engkau satukan aku dengan orang kafir ini\". Secara tiba-tiba lagkah raja terhenti dan kakinya tidak menempel ke tanah selain ujung jari jemari kakinya. Berkata 'Abdurrahman, berkata Abu Salamah berkata, Abu Hurairah radliallahu 'anhu: Sarah berkata: \"Ya Allah, seandainya dia mati nanti akan dikatakan bahwa wanita ini telah membunuhnya\". Maka Sarah dibawa untuk kali kedua atau ketiga. Maka raja itu berkata: \"Demi Allah, tidaklah kalian bawa ke hadapanku melainkan syetan. Kembalikanlah wanita itu kepada Ibrahim dan berikan dia upah. Maka Sarah kembali kepada Ibrahim Alaihissalam lalu berkata: \"Apakah kamu menyadari bahwa Allah telah menghinakan orang kafir itu dan menjadikannya sebadai budak seorang hamba sahaya?",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 164
			}
		}
	]
}