{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"37": "Hiring"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2271,
			"arabicnumber": 2271,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al 'Alaa'] telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Perumpamaan Kaum Muslimin dibandingkan orang-orang Yahudi dan Nashrani seperti seseorang yang memperkerjakan kaum yang bekerja untuknya pada suatu hari hingga malam dengan upah yang ditentukan. Maka diantara mereka ada yang melaksanakan pekerjaan hingga pertengahan siang lalu berkata: Kami tidak memerlukan upah darimu sebagaimana yang kamu persyaratkan kepada kami (bekerja hingga malam) dan apa yang telah kami kerjakan biarlah nggak apa-apa\". Maka orang itu berkata: \"Selesaikanlah sisa pekerjaan, nanti baru kalian boleh mengambil upahnya dengan penuh\". Maka mereka tidak mau dan tidak melanjutkan pekerjaan mereka. Kemudian dia memperkerjakan dua orang pekerja setelah mereka untuk menuntaskan sisa pekerjaan dan berkata, kepada keduanya: \"Selesaikanlah sisa waktu hari kalian ini dan bagi kalian berdua akan mendapatkan upah sebagaimana yang aku syaratkan kepada mereka. Maka mereka berdua mengerjakannya hingga ketika sampai saat shalat 'Ashar, keduanya berkata, \" Tidaklah yang kami telah kerjakan sia-sia dan kamu wajib membayar upah seperti yang kamu janjikan kepada kami berdua\". Maka orang itu berkata, kepada keduanya: \"Selesaikanlah sisa pekerjaan kalian berdua yang tidak sampai separuh hari ini\". Namun kedua orang itu enggan melanjutkannya. Lalu orang itu memperkerjakan suatu kaum yang mengerjakan sisa hari. Maka kaum itu mengerjakan sisa pekerjaan hingga terbenam matahari dan mereka mendapatkan upah secara penuh termasuk upah dari pekerjaan yang sudah dikerjakan oleh dua golongan orang sebelum mereka. Itulah perumpamaan mereka dan mereka ang menerima cahaya (Islam) ini",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 11
			}
		}
	]
}