{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2307,
			"arabicnumber": 2307,
			"text": "Telah menceritakan kepada kami [Sa'id bin 'Ufair] berkata, telah menceritakan kepada saya [Al Laits] berkata, telah menceritakan kepada saya ['Uqail] dari [Ibnu Syihab] berkata; dan ['Urwah] menduga bahwa [Marwan bin Al Hakam] dan [Al Miswar bin Makhramah] keduanya mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam berdiri ketika datang kepada Beliau suku Hawazin yang telah ditundukkan lalu mereka meminta kepada Beliau agar mengembalikan harta dan para tawanan mereka. Maka Rasulullah shallallahu 'alaihi wasallam berkata, kepada mereka: \"Ucapan yang paling aku sukai adalah yang paling benar. Maka pilihlah salah satu dari dua hal apakah tawanan atau harta dan sungguh aku akan memberi kesempatan terhadap mereka\". Rasulullah shallallahu 'alaihi wasallam telah menanti mereka sekitar sepuluh malam ketika akhirnya mereka kembali dari Tho'if. Setelah jelas bagi mereka bahwa Rasulullah shallallahu 'alaihi wasallam tidak akan mengembalikan kepada mereka kecuali salah satu dari dua pilihan, mereka berkata; \"Kami memilih tawanan\". Maka Rasulullah shallallahu 'alaihi wasallam berdiri di hadapan Kaum Muslimin kemudian memuji Allah yang memang Dia paling berhak untuk dipuji lalu bersabda: \"Kemudian dari pada itu, sesungguhnya saudara-saudara kalian ini telah datang kepada kita dengan bertobat dan sungguh aku berpikir akan mengembalikan para tawanan. Maka siapa diantara kalian yang suka berbuat baik (dengan membebaskan tawanan) dalam masalah ini maka lakukanlah dan siapa diantara kalian yang ingin tetap menjadikannya sebagai haknya hingga kami berikan kepadanya harta fa'i yang Allah karuniakan kepada kita, lakukanlah\". Maka orang-orang berkata: \"Kami serahkan mereka untuk Rasulullah shallallahu 'alaihi wasallam \". Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kami tidak tahu siapa diantara kalian yang berhak memberi izin dan siapa yang bukan, maka itu kembalilah hingga kalian bawa para pimpinan yang mengurusi urusan kalian\". Akhirnya mereka pulang dan berbicara dengan para pimpinan mereka lalu kembali menghadap Rasulullah shallallahu 'alaihi wasallam dan mereka mengabarkan bahwa mereka telah menyetujui dan memberi izin",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}