{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"41": "Agriculture"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2333,
			"arabicnumber": 2333,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir] telah menceritakan kepada kami [Abu Dhamrah] telah menceritakan kepada kami [Musa bin 'Uqbah] dari [Nafi'] dari ['Abdullah bin 'Umar radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam berkata: \"Ada tiga orang yang sedang bepergian lalu hujan turun hingga akhirnya mereka masuk ke dalam gua pada suatu gunung. Lalu sebuah batu yang jatuh dari gunung di depan mulut gua sehingga menutupi mereka. Satu sama lain diantara berkata; Perhatikanlah amal amal yang pernah kalian amalkan semata karena Allah lalu berdoalah dengan perantaraan amal amal tersebut semoga Allah Ta'ala berkenan membukakan batu tersebut untuk kalian. Seorang diantara mereka berkata; \"Ya Allah, aku memiliki kedua orangtua yang sudah renta dan aku juga mempunyai anak yang masih kecil dimana aku mengembalakan hewan untuk makan minum mereka. Apabila aku sudah selesai aku memeras susu dan aku mulai memberikan susu tersebut untuk kedua orang tua, aku mendahuluinya untuk kedua orangtuaku sebelum anakku. Pada suatu hari aku terlambat pulang hingga malam dan aku dapati kedanya sudah tertidur. Maka aku mencoba menawarkan susu kepada keduanya, aku hampiri di dekat keduanya dan aku khawatir dapat membangunkannya dan aku juga tidak mau memberikan susu ini untuk anak kecilku padahal dia sedang menangis dibawah kakiku meminta minum hingga terbit fajar. Ya Allah seandainya Engkau mengetahui apa yang aku kerjakan itu semata mencari ridhoMu, maka bukakanlah celah batu ini sehingga dari nya kami dapat melihat matahari. Maka Allah membukakan batu itu hinga mereka sedikit dapat melihat matahari\". Kemudian berkata, yang lain: \"Ya Allah, bersamaku ada putri pamanku yang merupakan orang yang paling aku cintai sebagaimana umumnya laki-laki mencintai wanita. Suatu hari aku menginginkannya namun dia menolak aku hingga kemudian aku datang kepadanya denagn membawa seratus dua puluh dinar agar aku bisa berbuat mesum dan menyetubuinya. Ketika aku sudah berada diantara kedua kakinya dia berkata; \"Wahai 'Abdullah, bertaqwalah kepada Allah dan janganlah kamu renggut keperawanan kecuali dengan cara yang haq. Maka bangkit. Ya Allah seandainya Engkau mengetahui apa yang aku kerjakan itu semata mencari ridhoMu, maka bukakanlah celah pintu gua ini untuk kami. Maka batu itu kembali terbuka. Kemudian orang yang ketiga berkata: Ya Allah aku pernah memperkerjakan orang pada ladang padi. Ketika sudah selesai dia meminta upahnya, aku memberikannya namun dia enggan menerimanya. Sejak itu aku meneruskan bertani, hingga aku dapat mengumpulkan harta yang banyak dari hasil yang aku kembangkan tersebut orang itu datang kepadaku lalu berkata \"Bertaqwalah kamu kepada Allah\". Aku katakan: \"Pergilah lihat sapi itu beserta pengembalanya dan ambillah\". Dia berkata: \"Bertaqwalah kepada Allah dan jangan mengolok-olok aku!\" Aku katakan: \"Aku tidak mengolok-olok kamu, ambillah. Maka dia mengambilnya. Jika aku kerjakan itu semata mencari ridhoMu, maka bukakanlah celah batu gua yang masih tersisa\". Maka Allah membukakannya. Berkata, Abu 'Abdullah dan berkata, [Isma'il bin Ibrahim bin 'Uqbah] dari [Nafi']: makna Fabaghaitu maksudnya fasa'aitu (Aku bersungguh-sunguh untuk menyetubuinya)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 14
			}
		}
	]
}