{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"41": "Agriculture"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2350,
			"arabicnumber": 2350,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Ibrahim bin Sa'ad] dari [Ibnu Syihab] dari [Al A'raj] dari [Abu Hurairah radliallahu 'anhu] berkata: Sesungguhgnya orang-orang mengatakan: \"Abu Hurairah adalah yang paling banyak menyampaikan hadits dan Allah Maha Memenuhi janji. Dan mereka berkata: \"Mengapa Muhajirin dan Anshar menampaikan hadits tidak sebanyak yang aku sampaikan?\" Sesungguhnya saudara-saudaraku dari kalangan Muhajirin mereka disibukkan dengan berdagang di pasar-pasar dan saudara-saudaraku dari kalangan Anshar mereka disibukkan dengan pekerjaan mereka dalam mengurus harta mereka (bercocok tanam). Adapun aku adalah seorang yang miskin, aku selalu bermulazamah (mendampingi) Rasulullah shallallahu 'alaihi wasallam dengan isi perut sekedar kebutuhan pokok, dan aku selalu hadir (dalam majelis) saat mereka tidak bisa hadir dan dapat menjaga hafalan saat mereka lupa\". Dan pada suatu hari Nabi shallallahu 'alaihi wasallam bersabda: \"Sekali-kali janganlah seorang dari kalian menghamparkan kainnya sebelum aku selesai menyampaikan sabdaku ini lalu dia mengumpulkannya dalam dadanya yang akhirnya dia melupakan sesuatu dari sabdaku untuk selamanya\". Maka aku hamparkan kainku yang bermotif karena aku tidak memiliki kain yang lain hingga Nabi shallallahu 'alaihi wasallam selesai menyampaikan sabda Beliau lalu aku kumpulkan dalam dadaku\". Maka demi Dzat yang mengutus Beliau dengan haq, tidaklah aku lupa satupun dari sabda Beliau hingga hari ini dan demi Allah, kalau bukan karena dua ayat dalam Kitabulloh maka aku tidak akan menyampaikannya sesuatu haditspun kepada kalian selamanya\". (Lalu dia membaca ayat 159 dan 160 dari surah Al Baqarah yang artinya: ('Sesungguhnya orang-orang yang menyembunyikan apa yang telah Kami turunkan berupa penjelasan dan petunjuk ……hingga akhir ayat.. Allah Maha Penyayang)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 28
			}
		}
	]
}