{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"46": "Oppressions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2468,
			"arabicnumber": 2468,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] berkata, telah menceritakan kepadaku ['Ubaidullah bin 'Abdullah bin Abu Tsaur] dari ['Abdullah bin 'Abbas radliallahu 'anhuma] berkata: \"Aku selalu antusias untuk bertanya kepada ['Umar] tentang dua wanita diantara isteri-isteri Nabi shallallahu 'alaihi wasallam yang Allah berfirman kepada keduanya: (\"Jika kamu berdua bertaubat kepada Allah, maka sesungguhnya hati kamu berdua telah condong (untuk menerima kebaikan) …QS At-Tahrim 4). Maka aku kunjungi dia namun dia menghindar dan aku susul dia dengan membawa kantong terbuat dari kulit berisi air hingga dia datang, lalu aku tuangkan air dari kantong air tadi keatas kedua tangannya hingga dia berwudhu' lalu aku tanya: \"Wahai amirul mu'minin, siapakah dua wanita dari isteri Nabi shallallahu 'alaihi wasallam yang Allah berfirman kepadanya (\"Jika kamu berdua bertaubat kepada Allah, maka sesungguhnya hati kamu berdua telah condong (untuk menerima kebaikan) …), maka dia menjawab: \"Aku heran kepadamu wahai Ibnu 'Abbas!, dia adalah 'Aisyah dan Hafshah\". Kemudian 'Umar menyebutkan hadits, katanya: \"Aku dan tetanggaku dari Anshar berada di desa Banu Umayyah bin Zaid, termasuk suku kepercayaan di Madinah dan kami saling bergantian menemui Rasul shallallahu 'alaihi wasallam. Sehari aku yang menemui Beliau shallallahu 'alaihi wasallam, hari lain dia yang menemui Beliau shallallahu 'alaihi wasallam. Jika giliranku menemui Beliau, aku menanyakan seputar wahyu yang turun hari itu dan perkara lainnya. Dan jika giliran tetangguku itu, ia pun melakukan hal sama. Kami adalah kaum Quraisy yang bisa menundukkan para isteri, hingga ketika kami mendatangi Kaum Anshar, ternyata mereka adalah sebuah kaum yang ditundukkan oleh isteri-isteri mereka. Lalu isteri-isteri kami segera saja meniru kebiasaan wanita Anshar tersebut. Suatu hari aku nasehati isteriku tapi dia membantahku dan aku larang dia membantahku tapi dia berkata: \"Kenapa kamu melarang aku membantahmu? Demi Allah, sesungguhnya hari ini isteri-isteri Nabi Shallallahu 'alaihiwasallam telah membantah Beliau bahkan seorang dari mereka tidak berbicara kepada Beliau hingga malam hari\". Aku kaget mendengar itu lalu aku katakan: \"Sangat celakalah diantara kalian orang yang berbuat hal seperti ini\". Kemudian aku bergegas untuk menemui Hafshah lalu aku bertanya: \"Wahai Hafshah, apakah salah seorang dari kalian hari ini telah membantah Rasulullah shallallahu 'alaihi wasallam hingga malam hari?\" Dia menjawab: \"Iya\". Aku katakan: \"Celaka dan rugilah. Apakah kalian merasa aman dari murka Allah disebabkan RasulNya shallallahu 'alaihi wasallam marah lalu kalian menjadi binasa? Janganlah kalian menuntut terlalu banyak kepada Rasulullah shallallahu 'alaihi wasallam dan jangan kalian membantahnya tentang suatu apapun dan jangan pula kalian menghindar untuk berbicara dengan Beliau. Mintalah kepadaku apa yang menjadi keperluanmu dan jangan kamu cemburu bila ada (isteri Nabi shallallahu 'alaihi wasallam), madu kamu, yang lebih cantik dan lebih dicintai oleh Rasulullah shallallahu 'alaihi wasallam \". Yang dimaksudkannya adalah 'Aisyah radliallahu 'anha. Suatu hari kami membicarakan suku Ghossan sebagai tukang sepatu yang biasanya menyiapkan sepatu kami untuk perang. Maka sahabatku pergi (menemui Rasulullah shallallahu 'alaihi wasallam) pada hari gilirannya lalu dia kembali pada waktu 'Isya dengan mengetuk rumahku dengan sangat keras seraya berkata: \"Apakah dia sudah tidur?\" Aku kaget lalu keluar menemuinya. Dia berkata: \"Telah terjadi masalah besar\". Aku bertanya: \"Masalah apa itu? Apakah suku Ghassan sudah datang?\" Dia menjawab: \"Bukan, bahkan urusannya lebih penting dan lebih panjang dari masalah itu. Rasulullah shallallahu 'alaihi wasallam telah menceraikan isteri-isteri Beliau. 'Umar berkata: \"Sungguh celaka dan rugilah Hafshah. Aku mengira hal ini tidak akan terjadi. Maka aku lipat pakaianku kemudian aku shalat Shubuh bersama Nabi shallallahu 'alaihi wasallam lalu Beliau memasuki bilik yang tinggi dan mengasingkan diri disana. Maka aku menemui Hafshah yang ternyata sedang menangis lalu aku bertanya: \"Apa yang membuatmu menangis, bukankah aku sudah peringatkan kamu? Apakah Rasulullah shallallahu 'alaihi wasallam telah menceraikan kalian?\" Dia menjawab: \"Aku tidak tahu, sekarang Beliau berada di tempat pengasingannya\". Maka aku keluar lalu mendatangi mimbar ternyata di sekelilingnya ada sejumlah orang (kurang dari sepuluh) yang sedang berkumpul diantaranya ada yang menangis. Maka aku duduk bersama mereka sebentar lalu aku sangat ingin mendatangi tempat pengasingan tempat Beliau berdiam disana. Aku katakan kepada Aswad, anak kecil pembantu Beliau: \"Mintakanlah izin untuk 'Umar?\" Maka dia masuk dan berbicara dengan Nabi shallallahu 'alaihi wasallam lalu keluar dan berkata: \"Aku sudah sampaikan tentang maksudmu namun Beliau diam saja\". Maka kemudian aku kembali dan berkumpul bersama orang-orang yang berada dekat mimbar. Sesaat kemudian timbul lagi keinginanku maka aku temui anak kecil itu lalu aku sampaikan maksudku seperti tadi dan diapun menjawab seperti tadi pula. Maka aku kembali duduk bersama orang-orang yang berada dekat mimbar. Ternyata timbul lagi keinginanku, maka aku datangi lagi anak kecil itu dan aku katakan: \"Mintakanlah izin untuk 'Umar?\" Maka dia menjawab seperti tadi pula. Ketika aku hendak kembali, anak kecil itu memanggilku dan berkata: \"Rasulullah shallallahu 'alaihi wasallam mengizinkan kamu masuk\". Maka aku masuk menemui Beliau yang ketika itu Beliau sedang berbaring diatas pasir sebagai kasurnya, dan tidak ada kasur yang menengahi antara pasir dan beliau sehingga pasir itu membekas pada sisi badan Beliau, Beliau bersandar diatas bantal yang terbuat dari kulit yang isinya sabut. Aku memberi salam kepada Beliau lalu aku berkata dalam posisi tetap berdiri: \"Apakah anda telah menceraikan isteri-isteri anda\". Maka Beliau memandang ke arahku lalu berkata: \"Tidak\". Kemudian aku katakan: \"Apakah anda merasa tidak enak karena melihat aku?\" Kami ini adalah orang Quraisy yang biasa menundukkan isteri-isteri. Ketika kami datang disini bertemu dengan Kaum yang mereka ditundukkan oleh isteri-isteri mereka\". Maka 'Umar menceritakan. Lalu Nabi shallallahu 'alaihi wasallam tersenyum. Kemudian aku katakan: \"Bagaimana seandainya anda melihatku menemui Hafshah dan aku katakan kepadanya: \"Jangan kamu cemburu bila ada (isteri Nabi shallallahu 'alaihi wasallam), madu kamu, yang lebih cantik dan lebih dicintai oleh Rasulullah shallallahu 'alaihi wasallam \". Yang dimaksudkan Umar adalah 'Aisyah radliallahu 'anha. Maka Beliau tersenyum lagi. Lalu aku duduk ketika melihat Beliau tersenyum lalu aku memandang ke rumah Beliau. Demi Allah, aku tidak melihat apapun disana, karena mataku bolak balik melihat tidak kurang dari tiga kali. Lalu aku katakan: \"Mintalah kepada Allah agar melapangkan dunia buat ummat anda karena bangsa Persia dan Ramawi saja dilapangkan dan diberikan dunia padahal mereka tidak menyembah Allah\". Saat itu Beliau sedang berbaring lalu berkata: \"Apakah kamu ragu wahai Ibnu Al Khaththob? Mereka itulah kaum yang telah disegerakan kebaikan mereka dalam kehidupan dunia ini\". Aku katakan: \"Wahai Rasulullah, mohonkanlah ampun buatku\". Ternyata disebabkan kalimatku seperti tadilah Rasulullah shallallahu 'alaihi wasallam mengasingkan diri ketika Hafshah menyampaikannya kepada 'Aisyah radliallahu 'anha. Sebelumnya Beliau telah berkata: Aku tidak akan tinggal bersama mereka selama satu bulan karena disebabkan kesalnya Beliau terhadap mereka setelah Allah menegur Beliau. Ketika telah berlalu masa selama dua puluh sembilan hari, yang pertama kali Beliau datangi adalah 'Aisyah. Maka 'Aisyah berkata, kepada Beliau: \"Anda sudah bersumpah untuk tidak mendatangi kami selama satu bulan, sedangkan hari ini kita baru melewati malam kedua puluh sembilan, aku sudah menghitungnya\". Maka Nabi shallallahu 'alaihi wasallam berkata: \"Bulan ini berjumlah dua puluh sembilan hari\". Pada bulan itu memang berjumlah dua puluh sembilan hari. Kemudian 'Aisyah radliallahu 'anha berkata: \"Maka turunlah ayat takhyiir (pilihan). Maka Beliau memulainya dari aku sebagai yang pertama dari isteri-isteri Beliau. Beliau berkata: \"Sesungguhnya aku mengingatkan kamu pada suatu urusan yaitu janganlah kamu tergesa-gesa hingga kamu meminta pendapat kedua orangtuamu\". 'Aisyah radliallahu 'anha berkata: \"Aku sudah mengetahui bahwa kedua orangtuaku tidaklah menyuruh aku untuk bercerai dari anda\" Kemudian Beliau berkata: \"Sesungguhnya Allah telah berfirman: (\"Wahai Nabi, katakanlah kepada isteri-isterimu … hingga sampai pada firmanNya … pahala yang besar) QS Al Ahzab: 28 -29). Aisyah radliallahu 'anha berkata: \"Apakah begitu kedua orangtuaku memerintahkannya? Sungguh aku lebih memilih Allah, RasulNya dan kehidupan akhirat\". Kemudian para isteri Beliau memilih hal yang sama lalu mereka berkata, seperti yang diucapkan 'Aisyah radliallahu 'anha",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 29
			}
		}
	]
}