{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"54": "Conditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2729,
			"arabicnumber": 2729,
			"text": "Telah bercerita kepada kami [Isma'il] telah bercerita kepada kami [Malik] dari [Hisyam bin 'Urwah] dari [bapaknya] dari ['Aisyah radliallahu 'anha] berkata: \"Barirah datang kepadaku seraya berkata: \"Aku telah menetapkan tebusan kepada Tuanku untuk kemerdekaan diriku dengan sembilan Awaq, dimana aku harus membayar satu uqiyah dalam setiap tahunnya, maka tolonglah aku\". Aku berkata: \"Jika tuanmu berkehendak aku akan bayar ketetapan tersebut kepada mereka sedangkan perwalianmu menjadi hakku\". Lalu aku penuhi. Kemudian Barirah pergi menemui tuannya dan menyampaikannya kepada mereka namun mereka menolaknya. Lalu dia datang setelah menemui mereka sementara Rasulullah shallallahu 'alaihi wasallam sedang duduk, seraya berkata: \"Sungguh aku sudah menawarkan hal itu kepada mereka namun mereka enggan menerimanya kecuali bila perwalian tetap menjadi hak mereka\". Nabi shallallahu 'alaihi wasallam mendengar hal ini lalu 'Aisyah mengabarkan kepada Nabi shallallahu 'alaihi wasallam, maka Beliau berkata: \"Ambillah dia (Barirah) dan berikan syarat perwalian kepada tuannya bahwa perwalian seorang budak adalah bagi yang memerdekakannya\". Maka 'Aisyah radliallahu 'anha melaksanakan perintah Beliau. Kemudian Rasulullah shallallahu 'alaihi wasallam berdiri di hadapan manusia seraya memuji Allah dan mengagungkan-Nya kemudian bersabda: \"Bagaimana jadinya orang-orang itu, mereka membuat persyaratan dengan syarat-syarat yang tidak ada pada Kitab Allah. Apapun bentuknya syarat yang tidak sesuai dengan Kitab Allah maka syarat itu batal sekalipun seratus kali persyaratan. Ketetapan Allah lebih berhaq (untuk ditunaikan) dan syarat (yang ditetapkan) Allah lebih kuat. Sesungguhnya perwalian (seorang budak) adalah milik orang yang memerdekakannya",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 17
			}
		}
	]
}