{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2842,
			"arabicnumber": 2842,
			"text": "Telah bercerita kepada kami [Muhammad bin Sinan] telah bercerita kepada kami [Fulaih] telah bercerita kepada kami [Hilal] dari ['Atha' bin Yasar] dari [Abu Sa'id Al Khudriy radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam berdiri di atas mimbar lalu bersabda: \"Sungguh yang aku khawatirkan atas kalian sepeninggalku adalah bila dibukakan kepada kalian keberkahan bumi\". Maka Beliau menyebut bunga-bunga dunia yang dimulai dengan yang pertama lalu dilanjutkan dengan yang lainnya. Lalu ada seorang yang berdiri seraya berkata: \"Wahai Rasulullah, apakah kebaikan akan datang membawa keburukan?\" Maka Nabi shallallahu 'alaihi wasallam terdiam atas pertanyaan orang itu. Kami berkata: \"Beliau sedang mendapat wahyu\". Maka orang-orang terdiam seolah di atas kepala mereka ada burung yang bertengger. Kemudian Beliau mengusap wajahnya yang penuh dengan keringat lalu bertanya: \"Mana orang yang bertanya tadi? Apakah kebaikan itu?\" Beliau bertanya tiga kali.\"Sesungguhnya kebaikan itu tidak akan datang kecuali (dengan membawa) kebaikan. Sesungguhnya apa yang ditumbuhkan pada musim semi dapat membinasakan atau dapat mendekatkan kepada kematian kecuali seperti ternak pemakan dedaunan hijau yang apabila sudah kenyang dia akan memandang matahari lalu mencret kemudian kencing lalu dia kembali merumput (makan lagi). Dan sungguh harta itu seperti dedaunan hijau yang manis. Maka beruntunglah seorang muslim yang dia mendapatkan harta dengan haq dan dengan hartanya itu dia nafkahkan di jalan Allah, anak-anak yatim, orang-orang miskin, dan ibnu sabil (musafir yang kehabisan bekal). Dan barangsiapa yang mengambil harta dunia tanpa hak ia seperti orang yang memakan namun tidak pernah kenyang dan harta itu akan menjadi saksi baginya pada hari qiyamat",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 58
			}
		}
	]
}