{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2940,
			"arabicnumber": 2940,
			"text": "Telah bercerita kepada kami [Ibrahim bin Hamzah] telah bercerita kepada kami [Ibrahim bin Sa'ad] dari [Shalih bin Kaisan] dari [Ibnu Syihab] dari ['Ubaidullah bin 'Abdullah bin 'Utbah] dari ['Abdullah bin 'Abbas radliallahu 'anhuma] bahwa dia mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam menulis surat kepada Qaishar (Raja Romawi) yang isinya mengajaknya agar memeluk Islam. Maka Beliau mengutus Dihyah Al Kalbiy dengan membawa surat Beliau kepadanya dan Rasulullah shallallahu 'alaihi wasallam memerintahkannya agar pertama memberikannya kepada pembesar Bushra untuk kemudian memberikanya kepada Qaishar. Dan Qaishar, ketika Allah memenangkan dia menghadapi pasukan Persia, dia berjalan antara kota Himsh sampai ke kota Iyliya' sebagai rasa syukur atas kemenangan yang Allah berikan kepadanya. Ketika surat Rasulullah shallallahu 'alaihi wasallam datang kepada Qaishar dia berkata setelah membacanya: \"Bawalah ke hadapanku seseorang yang berasal dari kaumnya agar aku dapat bertanya kepada mereka tentang Rasulullah shallallahu 'alaihi wasallam\". [Ibnu 'Abbas] radliallahu 'anhu berkata; [Abu Sufyan bin Harb] bercerita kepadaku bahwa saat itu dia sedang berada di negeri Syam bersama orang-orang Quraisy yang mengunjungi negeri itu dalam rangka berdagang pada masa (perdamaian/berlangsungnya gencatan senjata) antara Rasulullah shallallahu 'alaihi wasallam dan orang-orang kafir Quraisy, Abu Sufyan berkata: \"Maka utusan Qaishar menemui kami ketika kami berada di Syam lalu dia berangkat mengajak aku dan teman-temanku hingga ketika kami sampai di negeri Iyliya' kami dipersilahkan masuk menemui Qaishar yang saat itu sedang duduk di majelis kerajaannya sedang dia mengenakan mahkota sementara di sekelilingnya ada para pembesar kerajaan Romawi. Maka dia berkata kepada penterjemahnya: \"Tanyakanlah kepada mereka siapa diantara mereka yang paling dekat nasab (hubungan darahnya) dengan laki-laki yang mengaku dirinya sebagai Nabi tersebut\". Abu Sufyan berkata; maka aku katakan: \"Akulah orang yang paling dekat nasabnya \". Dia bertanya: \"Apa hubungan nasab kamu dengan dia?\" Aku jawab: \"Dia adalah anak dari pamanku\". Dan saat itu memang tidak ada seorangpun dari keturunan Bani 'Abdu Manaf selain aku. Lalu Qaishar berkata lagi: \"Dekatkanlah dia kepadaku\". Lalu dia memerintahkan teman-temanku dan menjadikan mereka berada di belakangku berbaris dekat bahuku. Kemudian dia berkata kepada penterjemahnya: \"Katakanlah kepada teman-temannya bahwa aku bertanya kepada orang ini tentang laki-laki yang mengaku dirinya sebagai Nabi. Bila dia berdusta maka kalian dustakanlah dia\". Abu Sufyan berkata: \"Demi Allah, seandainya pada saat itu bukan karena rasa malu yang akan berdampak buruk terhadap teman-temanku (bila berdusta) pasti aku sudah berdusta ketika dia bertanya tentang dia (Nabi shallallahu 'alaihi wasallam). Akan tetapi aku malu bila kemudian memberikan citra buruk kepada mereka tentang kedustaan sehingga aku membenarkannya\". Kemudian dia berkata lagi kepada penterjemahnya: \"Katakan kepadanya, bagaimana hubungan nasab laki-laki ini di tengah-tengah kalian?\" Aku jawab: \"Di kalangan kami, dia adalah orang yang punya nasab (keturunan) yang baik\". Dia bertanya lagi: \"Apakah pengakuannya (sebagai Nabi) ini ada orang di antara kalian sebelum dia yang pernah mengatakannya?\" Aku jawab: \"Belum pernah ada\". Dia bertanya lagi: \"Apakah kalian dahulu menuduhnya dia pernah berbohong sebelum dia mengatakan pengakuannya ini?\" Aku jawab: \"Tidak pernah\". Dia bertanya lagi: \"Apakah dari nenek moyangnya ada yang pernah menjadi raja?\" Aku jawab: \"Tidak ada\". Dia berttanya lagi: \"Apakah orang yang mengikutinya dari kalangan orang-orang terpandang atau dari kalangan orang-orang lemah?\" Aku jawab: \"Bahkan yang mengikutinya adalah orang-orang yang lemah\". Dia bertanya lagi: \"Apakah pengikutnya semakin bertambah atau berkurang? '\". Aku jawab: \"Bahkan semakin bertambah\". Dia bertanya lagi: \"Apakah ada orang yang menjadi murtad kembali karena benci terhadap ajaran agamanya setelah memeluknya?\" Aku jawab: 'Tidak ada\". Dia bertanya lagi: \"Apakah dia pernah berkhiyanat?\" Aku jawab: \"Tidak pernah. Dan kami sekarang berada dalam masa perdamaian dan kami khawatir bila dia berkhiyanat. Abu Sufyan berkata: \"Raja tidak memberi kesempatan sedikitpun kepadaku untuk dapat aku masukkan satu kata agar aku mencelanya (Nabi shallallahu 'alaihi wasallam) dimana aku tidak takut bila ucapan itu dapat memberi kesan (buruk) orang lain tentang aku\". Dia bertanya lagi: \"Apakah kalian memeranginya atau dia memerangi kalian?\" Aku jawab: \"Ya\". Dia melanjutkan: \"Bagaimana kesudahan dari perang kalian?\" Aku jawab: \"Kemenangan dan kekalahan silih berganti antara kami. Terkadang dia mengalahkan kami dan kadang dalam kesempatan lain kami yang mengalahkannya\". Dia bertanya lagi: \"Lalu apa yang diperintahkannya kepada kalian?\" Aku jawab: \"Dia memerintahkan kami agar kami ber'ibadah kepada Allah satu-satunya dan tidak menyekutukan-Nya dengan suatu apapun dan dia melarang kami (menyembah) apa yang disembah oleh nenek moyang kami. Dia juga memerintahkan kami untuk mendirikan shalat, bershadaqah, kejujuran, memenuhi janji dan menunaikan amanat\". Dia berkata kepada penterjemahnya ketika aku sedang menjawab itu semua: \"Katakan kepadanya, bahwa ketika aku bertanya kepadamu tentang nasabnya di tengah-tengah kalian, kamu menjawab bahwa dia orang yang memiliki nasab (kedudukan) yang baik. Dan begitulah memang seorang Rosul yang selalu diutus di tengah-tengah nasab (keturunan) kaumnya. Dan ketika aku bertanya kepadamu, apakah ada orang di antara kalian yang mengatakan pengakuan ini sebelum dia, kamu menjawab tidak ada. Maka aku katakan seandainya ada seseorang dari kalian yang pernah mengatakannya sebelum dia berarti orang ini hanya mengikuti ucapan orang sebelum dia. Dan ketika aku bertanya apakah kalian pernah menuduhnya berdusta sebelum dia mengucapkan pengakuannya ini, kamu menjawabnya belum pernah. Maka dari hal itu aku mengetahui bahwa tidak mungkin dia menjauhkan perkataan dusta terhadap manusia lalu berani berdusta terhadap Allah. Dan ketika aku bertanya kepadamu apakah ada dari nenek moyangnya yang menjadi raja, kamu menjawab tidak ada. Aku katakan seandainya ada dari nenek moyangnya yang pernah menjadi raja aku katakan berarti orang ini sedang mencari (menuntut kembali) kerajaan nenek moyangnya. Dan ketika aku bertanya kepadamu apakah orang-orang yang mengikutinya dari kalangan orang-orang terpandang atau orang-orang yang lemah, kamu menjawab bahwa orang-orang yang lemahlah yang mengikutinya. Dan memang merekalah yang menjadi para pengikut Rosul. Dan ketika aku bertanya kepadamu apakah pengikutnya semakin bertambah atau berkurang, kamu menjawab bahwa mereka semakin bertambah. Dan memang begitulah iman akan terus bertambah menjadi sempurna. Dan ketika aku bertanya kepadamu apakah ada orang yang menjadi murtad karena benci kepada ajaran agamanya setelah dia memeluknya, kamu menjawabnya tidak ada. Dan memang begitulah iman apabila telah masuk ke dalam lubuk hati tidak akan ada orang yang membencinya (tentang ajaran agamanya). Dan ketika aku bertanya kepadamu apakah dia pernah berkhiyanat kamu menjawabnya tidak pernah. Dan memang begitulah para Rosul tidak akan berkhiyanat. Dan ketika aku bertanya kepadamu apakah kalian memeranginya dan dia memerangi kalian kamu menjawab telah sering terjadi peperangan dan bahwa peperangan kalian dan dia silih berganti. Terkadang dia mengalahkan kalian dan kadang pula kalian dapat mengalahkannya dalam kesempatan lain. Dan memang begitulah para Rosul diuji dan kesudahannya pasti kemenangan menjadi milik mereka. Dan ketika aku bertanya kepadamu apa yang dia perintahkan kepada kalian, kamu jawab bahwa dia memerintahkan kalian agar kalian ber'ibadah kepada Allah dengan tidak menyekutukuan-Nya dengan sutau apapun dan melarang kalian dari apa yang disembah oleh nenek-moyang kalian dan dia memerintahkan kalian untuk mendirikan shalat, bershadaqah, kejujuran, memenuhi janji dan menunaikan amanat\". Raja berkata: \"Itulah sifat-sifat seorang Nabi. Sungguh aku sudah mengetahui bahwa Nabi terakhir telah muncul tapi aku tidak pernah menyangka kalau dia datang dari kalangan kalian (Quraisy). Seandainya apa yang kamu ucapkan itu benar, sungguh dia akan menguasai tanah yang sekarang berada di bawah kedua telapak kakiku ini dan seandainya aku ada harapan untuk menjumpainya pasti aku mengharuskan diriku untuk menemuinya. Dan seandainya aku sudah berada di hadapannya pasti aku akan basuh kedua telapak kakinya\". Abu Sufyan berkata: \"Kemudian dia meminta surat Rasulullah shallallahu 'alaihi wasallam lalu dibacakan kepadanya yang isinya adalah; \"Bismillahir rahmaanir rahiim. Dari Muhammad, hamba Allah dan Rosul-Nya, untuk Heraklius, Raja Romawi, Keselamatan bagi orang yang mengikuti petunjuk. Kemudian dari pada itu, sungguh aku menyeru kamu dengan seruan Islam. Masuklah kedalam Islam maka kamu akan selamat. Masuklah Islam niscaya Allah akan memberimu pahala dua kali. Namun bila kamu enggan maka kamu akan menanggung dosa bangsa Arisiyyiin (Erapa). Dan; (Disalam surat itu Beliau menuliskan firman Allah QS Alu 'Imran ayat 63) yang artinya: (\"Hai ahli kitab, marilah (berpegang) kepada suatu kalimat (ketetapan) yang tidak ada perselisihan antara kami dan kamu, bahwa tidak kita sembah kecuali Allah dan tidak kita persekutukan Dia dengan sesuatupun dan tidak (pula) sebagian kita menjadikan sebagian yang lain sebagai tuhan selain Allah. Jika mereka berpaling maka katakanlah kepada mereka: \"Saksikanlah, bahwa kami adalah orang-orang yang berserah diri (kepada Allah) \". Abu Sufyan berkata: \"Ketika sang Raja sudah menyelesaikan pernyataannya itu tiba-tiba terdengar suara gaduh orang-orang yang berada di sekelilingnya dari para pembesar Romawi dan semakin bertambah kegaduhan mereka dan aku tidak mengerti apa yang mereka ucapkan. Kemudian kami diperintahkan agar keluar. Ketika aku hendak keluar bersama teman-temanku dan aku telah menjauh dari majelis mereka aku berkata kepada teman-temanku: \"Sungguh besar perkara anak Abu Kabsyah ini. Inilah seorang Raja Bani Ashfar (Bangsa berkulit kuning/Romawi) yang dia juga mengkhawatirkannya\". Abu Sufyan berkata lagi: \"Demi Allah, aku senantiasa merasa hina dan sangat yakin bahwa urusan (agamanya) akan berjaya hingga akhirnya Allah membukakan hatiku untuk menerima Islam padahal sebelumnya aku membencinya",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}