{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3045,
			"arabicnumber": 3045,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata telah mengabarkan kepadaku ['Amru bin Abi Sufyan bin Asid bin Jariyah Ats Tsaqofiy], dia adalah sekutu Bani Zuhroh dan dia termasuk diantara shohabat Abu Hurairah, bahwa [Abu Hurairah radliallahu 'anhu] berkata; Rasulullah Shallallahu'alaiwasallam mengutus ekspedisi militer dengan jumlah sepuluh orang sebagai mata-mata dan Beliau angkat 'Ashim bin Tsabit Al Anshoriy, kakek dari 'Ashim bin 'Umar bin Al Khoththob sebagai pemimpin pasukan tersebut. Mereka berangkat hingga ketika sampai di Al Hada', suatu tempat antara 'Ushfan dan Makkah, keberadaan mereka diceritakan kepada penduduk dari suku Hudzail yang biasa disebut dengan Banu Lahyan. Maka suku ini mengerahkan hampir dua Ratus orang yang kesemuanya ahli memanah. Mereka pun mencari jejak keberadaan anggota ekspedisi militer muslimin. Ketika melihat mereka, 'Ashim dan pasukannya bersembunyi di balik bukit kecil (fad-fad). Namun suku itu langsung mengepung mereka dan berseru: \"Turun dan serahkanlah kepada kami apa yang ada ditangan kalian. Bagi kalian ada jaminan dan perjanjian agar kami tidak membunuh seorangpun dari kalian\". 'Ashim bin Tsabit, sebagai pemimpin ekspedisi militer itu berkata: \"Adapun aku, demi Allah, tidak akan mau turun dengan jaminan orang kafir. Ya Allah, beritahukanlah keadaan kami kepada Nabi-Mu\". Maka suku itu menyerang mereka dengan anak panah hingga mereka dapat membunuh 'Ashim beserta tujuh orang anak buahnya. Akhirnya tiga orang anggota ekspedisi yang masih hidup turun dengan menyetujui jaminan dan perjanjian. Diantara mereka ada Khubaib Al Anshoriy dan Ibnu Datsinah serta seorang lagi. (Setelah ketiganya turun) mereka menangkapnya dan melepas tali busur panah mereka untuk mengikat ketiganya. Orang ketiga berkata: \"Ini merupakan awal pengkhiyanatan. Demi Allah, aku tidak akan mengikuti kalian. Sungguh mereka bagiku sebagai teladan\". Yang dia maksud adalah shohabat mereka yang sudah terbunuh. Maka mereka menyeretnya dan memaksanya agar mengikuti mereka namun dia menolaknya hingga akhirnya mereka membunuhnya. Kemudian mereka berangkat dengan membawa Khubaib dan Ibnu Datsinah hingga akhirnya mereka menjual keduanya di Makkah sesudah peristiwa perang Badar. Khubaib dibeli oleh Banu Al Harits bin 'Amir bin Nawfal bin 'Abdu Manaf. Sebelumnya Khubaib adalah orang yang telah membunuh Al Harits bin 'Amir saat perang Badar. Maka jadilah Khubaib di tangan mereka sebagai tawanan. ['Ubaidullah bin 'Iyadl] mengabarkan kepadaku bahwa [putri dari Al Harits (Zainab)] mengabarkan kepadanya bahwa, ketika mereka bersepakat (untuk membunuh Khubaib), Khubaib meminjam (kepada Zainab) sebilah pisau cukur untuk mencukur bulu kemaluannya maka dia meminjamkannya. Kemudian Khubaib mengambil anakku saat aku lengah, itu karena anakku menghampirinya. (Zainab) berkata: \"Aku dapati anakku sedang dipangku olehnya sedangkan dia (Khubaib) sambil memegang pisau cukur. Aku sungguh terperanjat seketika itu\". Khubaib mengetahui keterperanjatanku pada wajahku, maka dia berkata: \"Kamu khawatir bila aku akan membunuhnya?. Sungguh aku tidak akan melakukannya\". (Zainab berkata); Sungguh demi Allah, belum pernah aku melihat ada seorang tawanan sebaik Khubaib. Demi Allah, aku pernah mendapatkan dia pada suatu hari sedang memakan buah anggur di tangannya padahal tangannya sedang dibelenggu dengan besi dan juga di Makkah saat itu bukan musimnya buah-buahan\". Dia berkata: \"Sungguh itu merupakan rezeki dari Allah yang Dia berikan kepada Khubaib\". Ketika mereka hendak keluar dari tanah Harom untuk membunuh Khubaib di daerah halal, Khubaib berkata kepada mereka: \"Biarkanlah aku untuk melaksanakan sholat dua roka'at\". Maka mereka mempersilakanhya. Maka Khubaib sholat dua Raka'at kemudian berkata: \"Seandainya bukan karena kalian akan mengira aku takut tentu aku akan memanjangkan sholatku ini. Ya Allah, binasakanlah mereka semuanya\". (Kemduaian dia bersya'ir); \"Aku tidak peduli selagi aku dibunuh sebagai muslim # Dibagian tubuh manakah diriku terbunuh jalan Allah\". # \"Semuanya itu pastilah ada balasan disisi AIlah # jika Dia berkendak, Dia memberkahi pada daging tercabik-cabik\". Akhirnya Ibnu Al Harits membunuhnya. Dan Khubaib adalah orang pertama yang mencontohkan sholat dua roka'at bagi setiap muslim yang akan dibunuh sebagai wujud keshabaran. Dan Allah mengabulkan do'a 'Ashim bin Tsabit pada saat dia dibunuh. Lalu Nabi Shallallahu'alaihiwasallam mengabarkan kepada para shohabat Beliau tentang berita mereka dan musibah yang mereka alami. (Saat kematian 'Ashim) orang-orang kafir Quraisy mengirim orang mendatangi 'Ashim dan mengabarkan bahwa dia telah dibunuh agar mereka datang mengambil sesuatu dari bagian jasad 'Ashim agar mereka dapat mengenalinya. Sebelumnya 'Ashim memang telah membunuh seorang dari pembesar mereka saat perang Badar. (Ketika mereka hendak membalaskan dendam kepada 'Ashim), Allah mengirim kepada 'Ashim pasukan lebah yang melindunginya dari para utusan kafir Quroisy sehingga mereka tidak mampu untuk mengambil secuilpun daging dari jasad 'Ashim",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 251
			}
		}
	]
}