{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3110,
			"arabicnumber": 3110,
			"text": "Telah bercerita kepada kami [Sa'id bin Muhammad Al Jarmiy] telah bercerita kepada kami [Ya'qub bin Ibrahim] telah bercerita kepada kami [bapakku] bahwa [Al Walid bin Katsir] bercerita kepadanya dari [Muhammad bin 'Amru bin Halhalah ad-Du'aliy] bercerita kepadanya bahwa [Ibnu Syihab] bercerita kepadanya bahwa ['Ali bin Husain] bercerita kepadanya bahwa mereka ketika tiba di Madinah dari bertemu dengan Yazib bin Mu'awiyah di masa terbunuhnya Husain bin 'Ali Rahmatullah 'alaihi, dia (Ali bin Husain) ditemui oleh Al [Miswar bin Makhramah] lalu dia (Al Miswar) berkata kepadanya' \"Apakah kamu ada keperluan dengan suatu perintah untukku?\". Maka aku katakan kepadanya; \"Tidak\". Lalu dia berkata lagi kepadanya; \"Apakah kamu termasuk orang yang diberi pedang Rasulullah Shallallahu'alaiwasallam?. Karena aku khawatir bila mereka dapat mengambilnya dari kamu. Demi Allah, seandainya kamu menyerahkannya kepadaku, aku tidak akan pernah memberikannya kepada mereka untuk selama-lamanya hingga aku terbunuh, dan sesungguhnya 'Ali bin Abu Thalib pernah meminang anak perempuan Abu Jahal (untuk dijadikan istri) disamping Fathimah 'alaihi salam, lalu kudengar Rasulullah Shallallahu'alaiwasallam memberikan khuthbah kepada manusia tentang masalah itu di atas mimbar ini sedang aku saat itu sudah baligh, Beliau bersabda: \"Sesungguhnya Fathimah adalah bagian dariku dan aku sangat khawatir dia terfitnah dalam agamanya\". Kemudian Beliau menyebutkan kerabat Beliau dari Bani 'Abdu Syamsi seraya menyanjungnya dalam hubungan kekerabatannya yang baik kepada Beliau. Beliau melanjutkan: \"Dia berbicara kepadaku lalu membenarkan aku serta berjanji kepadaku dan dia menunaikan janjinya kepadaku. Sungguh aku bukanlah orang yang mengharamkan suatu yang halal dan bukan pula menghalalkan apa yang haram akan tetapi, demi Allah, tidak akan bersatu putri Rasulullah Shallallahu'alaiwasallam dengan putri musuh Allah selamanya",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 19
			}
		}
	]
}