{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3124,
			"arabicnumber": 3124,
			"text": "Telah bercerita kepada kami [Muhammad bin Al 'Alaa'] telah bercerita kepada kami [Ibnu Al Mubarak] dari [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah Radliallahu 'anhu] berkata; Rasulullah Shallallahu'alaiwasallam bersabda: \"Ada seorang Nabi diantara para Nabi yang berperang lalu berkata kepada kaumnya; \"Janganlah mengikuti aku seseorang yang baru saja menikahi wanita sedangkan dia hendak menyetubuhinya karena dia belum lagi menyetubuhinya (sejak malam pertama), dan jangan pula seseorang yang membangun rumah-rumah sedang dia belum memasang atap-atapnya, dan jangan pula seseorang yang membeli seekor kambing atau seekor unta yang bunting sedang dia menanti-nanti hewan itu beranak\". Maka Nabi tersebut berperang dan ketika sudah hampir mendekati suatu kampung datang waktu shalat 'Ashar atau sekitar waktu itu lalu Nabi itu berkata kepada matahari; \"Kamu adalah hamba yang diperintah begitu juga aku hamba yang diperintah. Ya Allah tahanlah matahari ini untuk kami. Maka matahari itu tertahan (berhenti beredar) hingga Allah memberikan kemenangan kepada Nabi tersebut. Kemudian Nabi tersebut mengumpulkan ghanimah lalu tak lama kemudian datanglah api untuk memakan (menghanguskannya) namun api itu tidak dapat memakannya. Maka Nabi tersebut berkata; \"Sungguh diantara kalian ada yang berkhiyanat (mencuri ghanimah) untuk itu hendaklah dari setiap suku ada seorang yang berbai'at kepadaku. Maka ada tangan seorang laki-laki yang melekat (berjabatan tangan) dengan tangan Nabi tersebut lalu Nabi tersebut berkata; \"Dikalangan sukumu ada orang yang mencuri ghanimah maka hendaklah suku kamu berbai'at kepadaku. Maka tangan dua atau tiga orang laki-laki suku itu berjabatan tangan dengan tangan Nabi tersebut lalu Nabi tersebut berkata; \"Di kalangan sukumu ada orang yang mencuri ghanimah\". Maka mereka datang dengan membawa emas sebesar kepala sapi lalu meletakkannya' Kemudian datanglah api lalu menghanguskannya. Kemudian Allah menghalalkan ghanimah untuk kita karena Allah melihat kelemahan dan ketidak mampuan kita sehingga Dia menghalalkannya untuk kita",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 33
			}
		}
	]
}