{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3131,
			"arabicnumber": 3131,
			"text": "Telah bercerita kepada kami [Sa'id bin 'Ufair] berkata telah bercerita kepadaku [Al Laits] berkata telah bercerita kepadaku ['Uqail] dari [Ibnu Syihab] berkata; ['Urwah] menganggap bahwa [Marwan bin Al Hakam] dan [Miswar bin Makhramah] keduanya mengabarkan kepadanya bahwa Rasulullah Shallallahu'alaiwasallam berkata ketika datang kepada beliau utusan suku Hawazin yang telah menyatakan diri memeluk Islam lalu mereka meminta kepada Beliau agar mengembalikan harta-harta mereka dan para tawanan mereka. Maka Rasulullah Shallallahu'alaiwasallam berkata kepada mereka: \"Perkataan yang paling aku sukai adalah yang paling jujur. Untuk itu silakan kalian pilih satu dari dua pilihan, apakah tawanan atau harta. Sungguh aku memberi kesempatan untuk mereka\". Rasulullah Shallallahu'alaiwasallam menunggu kedatangan kabar mereka sekitar sepuluh malam ketika Beliau kembali dari Tha'if. Setelah jelas bagi mereka bahwa Rasulullah Shallallahu'alaiwasallam tidak akan mengembalikan kepada mereka kecuali satu diantara dua pilihan akhirnya mereka berkata; \"Kami memilih tawanan kami\". Maka Rasulullah Shallallahu'alaiwasallam berdiri di hadapan Kaum Muslimin kemudian Beliau memuji Allah yang memang Dialah satu-satunya yang berhak untuk dipuji lalu berkata: \"Amma ba'du. Sesungguhnya saudara-saudara kalian datang kepada kita dengan bertobat dan aku berpikir untuk mengembalikan tawanan mereka. Maka siapa yang suka untuk berbuat baik, lakukanlah (mengembalikan tawanan) dan siapa yang suka di antara kalian untuk mengambil haknya hingga kami akan berikan kepadanya bagian dari fa'i yang dari awal Allah telah mengkaruniakannya kepada kita, lakukanlah\". Maka orang-orang berkata; \"Kami memilih untuk berbuat baik kepada mereka, wahai Rasulullah\". Maka Rasulullah Shallallahu'alaiwasallam berkata kepada mereka: \"Sesungguhnya kami belum mengetahui siapa di antara kalian yang berhak memberi izin dan siapa yang tidak. Untuk itu kembalilah kalian sampai jelas bagi kami siapa orang yang memegang urusan kalian\". Maka mereka kembali lalu orang-orang yang memegang urusan mereka berbicara kepada mereka kemudian mereka kembali menemui Rasulullah Shallallahu'alaiwasallam dan mengabarkan bahwa mereka telah bersikap baik dan mengizinkan. Inilah kisah yang sampai kepada kita tentang para tawanan suku Hawazin",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}