{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3133,
			"arabicnumber": 3133,
			"text": "Telah bercerita kepada kami ['Abdullah bin 'Abdul Wahhab] telah bercerita kepada kami [Hammad] telah bercerita kepada kami [Ayyub] dari [Abu Qalabah] berkata telah bercerita kepadaku [Al Qasim bin 'Ashim Al Kulaibiy], hadits Al Qasim aku menghafalnya dari [Zahdam] berkata; \"Kami pernah berada di sisi [Abu Musa] ketika dia diberikan seekor ayam jantan dan saat itu di sampingnya ada seorang dari suku Bani Taymillah yang berkulit merah nampak sebagai orang asing (non 'Arab). Abu Musa mengundangnya untuk makan. Zahdam berkata; \"Sungguh aku lihat dia memakan sesuatu sehingga aku merasa jijik hingga aku bersumpah untuk tidak ikut makan\". Abu Musa berkata; \"Kemarilah karena aku akan bercerita kepada kalian tentang masalah ini. Aku pernah menemui Nabi Shallallahu'alaihiwasallam bersama rombongan Al Asy'ariyin untuk meminta kepada Beliau agar menyertakan kami (dalam perang dan bagian ghanimah), maka Beliau berkata: \"Demi Allah, aku tidak dapat menyertakan kalian dan akupun tidak punya kendaraan yang dapat menyertakan kalian\". Kemudian Rasulullah Shallallahu'alaiwasallam diberikan ghanimah berupa unta lalu Beliau bertanya kepada kami: \"Mana rombongan Al Asy'ariyin tadi?\". Maka Beliau memberikan kami sejumlah unta putih yang paling baik. Ketika kami tengah bertolak pulang, kami berkata; \"Apa yang telah kita lakukan ini tidak berkah\". Akhirnya kami kembali kepada Beliau lalu kami katakan; \"Kami telah meminta kepada Baginda agar menyertakan kami dan Baginda telah bersumpah untuk tidak akan menyertakan kami, apakah Baginda lupa?\". Beliau menjawab: \"Bukan aku yang menyertakan kalian tetapi Allah dan sungguh, demi Allah, aku insya Allah tidaklah aku bersumpah lalu aku lihat ada sesuatu yang lebih baik darinya melainkan aku akan mengambil yang lebih baik itu dan kubayar kafarat sumpahku",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 41
			}
		}
	]
}