{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3400,
			"arabicnumber": 3400,
			"text": "Telah bercerita kepada kami ['Amru bin Muhammad] telah bercerita kepada kami [Ya'qub bin Ibrahim] berkata telah bercerita kepadaku [bapakku] dari [Shalih] dari [Ibnu Syihab] bahwa ['Ubaidullah bin 'Abdullah] mengabarkan kepadanya dari [Ibnu 'Abbas radliallahu 'anhuma] bahwa dia (Ibnu 'Abbas radliallahu 'anhuma) dan Al Hurru bin Qais Al Fazariy beselisih pendapat tentang teman Nabi Musa 'Alaihissalam. Ibnu 'Abbas radliallahu 'anhuma berkata: \"Dia adalah Khadlir\". Di tengah perselisihan itu, [Ubbay bin Ka'ab] lewat di hadapan keduanya maka Ibnu 'Abbas memanggilnya seraya berkata; \"Aku sedang berbeda pendapat dengan temanku ini tentang teman Nabi Musa 'Alaihissalam yang beliau menanyakan jalan agar bisa bertemu dengannya. Apakah anda pernah mendengar Rasulullah shallallahu 'alaihi wasallam menceritakan hal ini?\". Ubay berkata; \"Ya. Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika Musa 'Alaihissalam berada di tengah-tengah pembesar Bani Isra'il tiba-tiba ada seorang laki-laki yang datang lalu berkata; \"Apakah kamu mengetahui ada orang yang lebih pandai darimu?.\" Nabi Musa menjawab; \"Tidak\". Kemudian Allah Ta'ala mewahyukan kepada Musa 'Alaihissalam: \"Bahkan ada, yaitu Hamba Kami yang bernama Khadlir.\" Lalu Musa menanyakan jalan untuk dapat bertemu dengannya. Maka dijadikanlah ikan sebagai tanda dan dikatakan kepadanya: \"Jika kamu kehilangan ikan itu, kembalilah karena dengan begitu kamu bertemu dengannya\". Maka Musa menyusuri jejak ikan itu dari tepi laut. Kemudian muridnya berkata kepada Musa; \"Tahukah kamu tatkala kita berlkindung di balik batu itu, sebenarnya aku lupa menceritakan tentang ikan itu dan tidak ada yang melupakan aku untuk menceritakannya melainkan setan\". Maka Musa 'Alaihissalam berkata; \"Itulah tempat yang kita cari\". Lalu keduanya kembali mengikuti jejak mereka semula\". Akhirnya Musa bertemu dengan Khadlir. Itulah kejadian yang dialami keduanya sebagaimana Allah Ta'ala menceritakannya dalam Kitab-Nya",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 73
			}
		}
	]
}