{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3450,
			"arabicnumber": 3450,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Abu 'Awanah] telah bercerita kepada kami ['Abdul Malik] dari [Rab'iy bin Hirasy] berkata, ['Uqbah bin 'Amru] berkata kepada [Hudzaifah]; \"Tidakkah kamu bersedia untuk menceritakan apa yang pernah kamu dengar dari Rasulullah shallallahu 'alaihi wasallam?\". Hudzaifah berkata; \"Sungguh aku pernah mendengar beliau besabda: \" Dajjal keluar dengan membawa air dan api. Adapun apa yang dilihat manusia sebagai api sebenarnya adalah air yang dingin, dan yang dilihat manusia sebagai air sesungguhnya dia adalah api yang membakar. Maka siapa di antara kalian yang berjumpa dengannya hendaklah mengambil yang di tangannya yang nampak seperti api karena itu adalah air yang segar lagi dingin\". Hudzaifah berkata pula; \"Dan aku juga pernah mendengar beliau shallallahu 'alaihi wasallam besabda: \"Ada seorang dari kaum sebelum kalian didatangi malaikat untuk mencabut nyawanya lalu ditanyakan kepadanya; \"Apakah kamu pernah beramal kebaikan?\". Orang itu menjawab; \"Aku tidak tahu\". Dikatakan kepadanya; \"Coba kamu ingat-ingat\". Orang itu kembali menjawab; \"Aku tidak tahu apapun, kecuali aku pernah melakukan transaksi jual beli sesama manusia, terhadap yang diberi kelonggaran hartanya pun aku memberi toleransi waktu untuk membayar hutangnya, dan terhadap yang kesulitan aku memaafkan. Allah pun kemudian memasukkannya ke surga\". Lalu Hudzaifah berkata lagi; \"Dan aku juga pernah mendengar beliau shallallahu 'alaihi wasallam: \"Ada seseorang ketika kematiannya sudah hampir dekat dan sudah tidak punya harapan untuk bertahan hidup, dia berwasiat kepada keluarganya; \"Jika nanti aku meninggal dunia, kumpulkanlah kayu bakar yang banyak lalu nyalakanlah api pada kayu-kayu itu (untuk membakarku) hingga apabila api telah melumat dagingku dan menghancurkan tulang belulangku, hingga setelah menjadi abu maka ambillah, kumpulkanlah abu jasadku itu lalu lihatlah suatu hari ketika angin berhembus kencang, maka kalian hanyutkanlah abu jasadku itu ke sungai. Keluarganya pun melakukan wasiatnya. Pada hari qiyamat Allah memgumpulkan kembali abu jasadnya itu lalu dihidupkan, kemudian dia ditanya: \"Mengapa kamu lakukan itu?\". Orang itu menjawab: \"Karena aku takut kepada-Mu\". Maka Allah mengampuni orang itu\". 'Uqbah bin 'Amru; \"Dan aku mendengar beliau shallallahu 'alaihi wasallam besabda seperti itu dan disebutkan bahwa orang yang dimaksud itu pekerjaannya sebagai tukang penggali kubur",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}