{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3465,
			"arabicnumber": 3465,
			"text": "Telah bercerita kepada kami [Isma'il bin Khalil] telah mengabarkan kepada kami ['Ali bin Mushir] dari ['Ubaidullah bin 'Umar] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada tiga orang dari orang-orang sebelum kalian yang ketika sedang bepergian turun hujan lalu ketiganya masuk kedalam gua namun kemudian gua itu (pintunya) menutup mereka. Kemudian diantara mereka berkata kepada yang lainnya; \"Demi Allah, wahai kawan, tidak akan ada yang dapat menolong kalian kecuali kejujuran (kebajikan). Maka masing-masing dari mereka berdo'a dengan apa yang mereka ketahui sebagai suatu kebajikan. Maka seorang diantara mereka berkata; \"Ya Allah, sungguh Engkau mengetahui bahwa aku pernah punya seorang pekerja uang bekerja untukku dengan upah satu faraq (tiga sha') berupa beras lalu dia pergi dan meninggalkan upahnya itu kemudian aku sengaja dari beras itu aku jadikan benih dan aku tanam sehingga berkembang lalu dari hasilnya itu aku belikan seekor sapi. Suatu hari dia dating dan memint aupahnya yang dului lalu aku katakan kepadanya; \"Lihatlah sapi itu. Itulah upah mu yang satu faraq itu ambil dan giringlah pulang\". Orang itu berkata; \"Yang menjadi hakku hanyalah satu faraq beras\". Aku katakan kepadanya; \"Ambillah sapi itu karena dia hasil yang aku kembangkan dari upah berasmu\". Ya Allah, seandainya Engkau mengetahui apa yang aku kerjakan itu semata karena takut kepada-Mu, maka bukakanlah celah untuk kami\". Maka pintu gua itu terbuka sedikit. Lalu orang yang lain berkata; \"Ya Allah, sungguh Engkau telah mengetahui bahwa aku memiliki kedua orangtua yang sudah renta. Dan setiap malam aku membawakan bagi keduanya susu dari kambing milikku. Pada suatu malam, aku terlambat mendatangi keduanya sehingga ketika aku dating keduanya sudah tertidur sementara keluargaku dan anak-anakku menangis karena kelaparan sedangkan aku tidak akan memberi minum kepada mereka sebelum kedua orangtuaku dan aku enggan untuk membangunkan keduanya dan aku juga enggan meninggalkan keduanya dengan meminum jatah susu keduanya. Dan aku terus menunggu dalam keadaan seperti itu hingga terbit fajar. Ya Allah, seandainya Engkau mengetahui apa yang aku kerjakan itu semata karena takut kepada-Mu, maka bukakanlah celah untuk kami\". Maka pintu gua itu kembali terbuka sedikit hingga mereka dapat melihat langit. Kemudian orang yang ketiga berkata; \"Ya Allah, sungguh Engkau mengetahui bahwa aku mempunyai mempunyai anak pamanku (keponakan) yang merupakan manusia yang paling aku cintai dan aku pernah menginginkan dirinya untukku namun dia menolak kecuali bila aku dapat memberinya uang sebanyak seratus dinar. Maka aku bekerja dan berhasil mengumpulkan uang tersebut. Lalu aku temui dia dan aku berikan uang tersebut dan dia mempersilakan dirinya untukku namun ketika aku sudah berada di antara kedua kakinya dia berkata; \"Bertaqwalah kepada Allah, dan janganlah kamu renggut keperawanan kecuali dengan haq\". Maka aku berdiri lalu pergi meninggalkan uang seratus dinar tersebut. Ya Allah, seandainya Engkau mengetahui apa yang aku kerjakan itu semata karena takut kepada-Mu, maka bukakanlah celah untuk kami\".\"Maka Allah membukakan gua itu untuk mereka lalu mereka keluar",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 132
			}
		}
	]
}