{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3813,
			"arabicnumber": 3813,
			"text": "Telah bercerita kepadaku ['Abdullah bin Muhammad] telah bercerita kepada kami [Azhar as-Samman] dari [Ibnu 'Aun] dari [Muhammad] dari [Qais bin 'Abbad] berkata; Aku pernah duduk di masjid Madinah lalu datang seorang laki-laki yang nampak pada wajahnya tanda-tanda kekhusyu'an. Orang-orang berkata; \"Inilah seseorang diantara calon penghuni surga\". Orang itu kemudian mengerjakan shalat dua raka'at dengan menyempurnakannya lalu keluar masjid. Aku mengikutinya lalu aku berkata; \" ketika anda masuk masjid tadi orang-orang mengatakan bahwa anda termasuk calon penghumi surga\". Orang itu berkata; \"Demi Allah, sungguh tidak patut buat seorangpun mengatakan hal yang dia tidak mengetahuinya. Aku akan ceritakan kepadamu apa alasannya. Sungguh aku pernah bermimpi pada zaman Nabi shallallahu 'alaihi wasallam lalu aku ceritakan mimpiku kepada beliau. Dalam mimpiku itu seolah aku melihat taman yang luas, suasananya yang hijau nan asri, di tengahnya ada tiang-tiang dari besi. Bagian bawahnya adalah bumi sedang atasnya adalah langit. Pada bagian atasnya itu ada tali. Dikatakan kepadaku; \"Mendakilah\". Aku katakan; \"Aku tak sanggup\". Kemudian datang kepadaku orang yang membantuku, lalu dia mengangkat bajuku dari belakangku sehingga aku mampu mendakinya hingga ketika sudah berada di atas aku pegang tali tersebut. Dikatakan kepadaku; \"Berpeganglah\". Maka aku sanggup memegangnya dan sungguh tali itu berada pada genggamanku\". Kemudian aku ceritakan mimpiku itu kepada Nabi shallallahu 'alaihi wasallam maka beliau berkata; \"Yang dimaksud dengan taman itu adalah Islam sedangkan tiang-tang adalah tiangnya Islam dan tali itu adalah al-'urwatul wutsqa (kalimat tauhid). Dan kamu berada dalam Islam hingga meninggal dunia\". Orang itu adalah ['Abdullah bin Salam]. Dan berkata kepadaku [Khalifah] telah bercerita kepada kami [Mu'adz] telah bercerita kepada kami [Ibnu 'Aun] dari [Muhammad] telah bercerita kepada kami [Qais bin 'Abbad] dari [Ibnu Salam] berkata; Kata Shiifu sebagai kata ganti dari minshaf",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 38
			}
		}
	]
}