{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3932,
			"arabicnumber": 3932,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami ['AbdulWarits]. Dan diriwayatkan pula, telah menceritakan kepada kami [Ishaq bin Manshur] telah mengabarkan kepada kami ['Abdush Shamad] berkata, aku mendengar [Bapakku] bercerita, telah menceritakan kepadaku [Abu At Tayyah. Yazid bin Humaid Adl Dluba'i] berkata, telah menceritakan kepadaku [Anas bin Malik] radliallahu 'anhu berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam tiba di Madinah, beliau singgah di dataran tinggi Madinah, sebuah perkampungan yang mereka kenal sebagai Suku 'Amru bin 'Auf. Anas berkata; \"Maka beliau tinggal selama empat belas malam. Kemudian beliau mengutus seseorang untuk menemui pemimpin suku Bani Najjar. Maka mereka datang sambil menyarungkan pedang di badan mereka. Anas melanjutkan; \"Aku melihat Nabi shallallahu 'alaihi wasallam diatas tunggangannya, sedangkan Abu Bakar membonceng di belakang beliau, sementara para pembesar suku Najjar mendampingi di sekeliling beliau hingga sampai di sumur milik Abu Ayyub. Anas berkata; \"Beliau lalu bersegera mendirikan shalat saat waktu sudah masuk. Beliau shalat di kandang kambing. Kemudian beliau memerintahkan untuk membangun masjid. Lalu Beliau mengutus seseorang untuk menemui pembesar suku Najjar. Utusan itu berkata; \"Wahai suku Najjar, sebutkan berapa harga kebun kalian ini?\" Mereka berkata; \"Tidak, demi Allah. Kami tidak akan menjualnya kecuali kepada Allah!\". Anas berkata; \"Aku beritahu kepada kalian bahwa kebun itu banyak terdapat kuburan orang-orang musyrik, juga ada sisa-sisa reruntuhan rumah dan pohon-pohon kurma.\" Maka Nabi shallallahu 'alaihi wasallam memerintahkan untuk membongkar kuburan-kuburan tersebut. Sedangkan reruntuhan rumah supaya diratakan dan untuk pohon-pohon kurma ditumbangkan, lalu dipindahkan didepan arah qiblat masjid. Anas berkata; \"Maka mereka bekerja membuat pintu masjid dari pohon dan mengangkut bebatuan yang besar-besar sambil bersenandung. Sedangkan Rasulullah shallallahu 'alaihi wasallam ikut bekerja bersama mereka sambil mengucapkan: \"Ya Allah, tidak ada kebaikan kecuali kebaikan akhirat, maka tolonglah kaum Anshar dan Muhajirin",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 157
			}
		}
	]
}