{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3936,
			"arabicnumber": 3936,
			"text": "Telah menceritakan kepada kami [Yahya bin Qaza'ah] telah menceritakan kepada kami [Ibrahim] dari [Az Zuhri] dari ['Amir bin Sa'ad bin Malik] dari [bapaknya] berkata; \"Nabi shallallahu 'alaihi wasallam menjengukku pada waktu hajji wada' ketika aku sakit yang tidak menyebabkan kematian. Aku berkata; \"Wahai Rasulullah, aku rasakan sakitku semakin parah. Begaimana pendapat anda, aku memiliki banyak harta namun aku tidak memiliki orang yang akan mewarisinya kecuali satu anak perempuanku. Apakah aku boleh mensedekahkan dua pertiga hartaku?\". Beliau menjawab: \"Tidak\". Dia berkata; \"Apakah boleh aku bersedekah seperduanya?\". Beliau menjawab: \"Sepertiga, wahai Sa'ad. Dan sepertiga itu sudah banyak. Sesungguhnya bila kamu meninggalkan keturunanmu dalam keadaan berkecukupan itu lebih baik daripada kamu meninggalkan mereka dalam keadaan miskin, lalu mereka mengemis meminta-minta kepada manusia. Dan tidaklah kamu menafkahkan suatu nafaqah (harta) semata-mata mencari wajah (ridla) Allah melainkan Allah pasti akan memberimu balasannya, sekalipun satu suap makanan yang kamu berikan pada mulut istrimu.\" Aku bertanya; \"Wahai Rasulullah, apakah aku diberi umur panjang setelah shahabat-shahabatku?. Beliau bersabda: \"Tidaklah sekali-kali engkau diberi umur panjang lalu kamu beramal shalih melainkan akan bertambah derajat dan kemuliaanmu. Dan semoga kamu diberi umur panjang sehingga orang-orang dapat mengambil manfaat dari dirimu dan juga mungkin dapat mendatangkan madlorot bagi kaum yang lain. Ya Allah sempurnakanlah pahala hijrah shahabat-shahabatku dan janganlah Engkau kembalikan mereka ke belakang.\" Namun Sa'ad bin Khaulah membuat Rasulullah shallallahu 'alaihi wasallam bersedih karena dia meningal di Makkah. [Ahmad bin Yunus] dan [Musa] berkata dari [Ibrahim] dengan redaksi; \"…Kamu meninggalkan warisanmu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 161
			}
		}
	]
}