{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3983,
			"arabicnumber": 3983,
			"text": "Telah menceritakan kepadaku [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Abdullah bin Idris] berkata, aku mendengar [Hushain bin 'Abdur Rahman] dari [Sa'ad bin 'Ubadah] dari [Abu 'Abdur Rahman as-Sulamiy] dari ['Ali] radliallahu 'anhu berkata; Rasulullah shallallahu 'alaihi wasallam mengutus aku, Abu Martsad Al Ghanawiy dan Az Zubair bin Al 'Awwam, yang mana kami adalah penunggang kuda yang ulung. Beliau berkata: \"Berangkatlah kalian hingga sampai di sebuah taman yang bernama Khakh, disana ada seorang wanita dari kaum Musyrikin yang membawa sepucuk surat dari Hathib in Abi Balta'ah yang ditujukan untuk kaum Musyrikin\". Maka kami dapati wanita itu sedang berjalan dengan untanya persis seperti apa yang disampaikan Rasulullah shallallahu 'alaihi wasallam. Maka kami bertanya; \"Mana surat itu?\". Wanita itu menjawab; \"Tidak ada surat pada kami\". Maka kami memeriksanya, namun kami tidak melihat adanya sepucuk suratpun. Kami katakan; \"Tidak mungkin Rasulullah shallallahu 'alaihi wasallam berdusta. Kamu keluarkan surat itu atau kami akan menggeladah kamu\". Setelah wanita melihat kesungguhan kami, dia melirik pada kain ikat pinggangnya, yaitu yang ternyata surat itu disembunyikan dibalik kain ikat pinggangnya. Akhirnya dia mengeluarkan surat itu. Kemudian kami berangkat menemui Nabi shallallahu 'alaihi wasallam dengan membawa surat itu. Lalu 'Umar berkata; \"Wahai Rasulullah, dia telah berkhianat kepada Allah dan Rasul-Nya dan juga kaum m'uminin. Biarkan aku memenggal leher orang ini\". Kemudian beliau bertanya: \"Apa yang mendorongmu berbuat seperti?\". Hathib menjawab; \"Demi Allah, tidaklah aku bermaksud untuk tidak beriman kepada Allah dan Rasul-Nya. Maksudku, hanyalah agar aku memiliki penjamin di tengah kaum (musyrikin) yang dengannya Allah melindungi keluarga dan hartaku. Juga tidak ada satupun dari shahabat anda melainkan dia punya kerabat di sana yang dengannya Allah akan melindungi keluarga dan hartanya\". Maka Nabi shallallahu 'alaihi wasallam berkata: \"Dia benar. Dan janganlah kalian katakan padanya kecuali kebaikan\". Namun 'Umar tetap berkata; \"Dia telah berkhianat kepada Allah dan Rasul-Nya dan juga kaum m'uminin. Biarkan aku memenggal leher orang ini\"Maka beliau bersabda: \"Bukankan dia termasuk ahlu Badar. Dan Allah telah mendatangi Ahlu Badar dan berfirman: \"Silakan kalian berbuat apa yang kalian suka karena telah wajib bagi kalian untuk masuk ke dalam surga\" atau: \"Sungguh Aku telah mengampuni kalian\". Maka air mata 'Umar bercucuran lalu berkata; \"Allah dan Rasul-Nya lebih mengetahui",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 34
			}
		}
	]
}