{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3991,
			"arabicnumber": 3991,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Yahya] dari [Nafi'] bahwa [Ibnu 'Umar RAa] diceritakan kepadanya bahwa Sa'id bin Zaid bin 'Amru bin Nufail, salah serang yang ikut perang Badar sedang menderita sakit pada hari Jum'at. Maka Ibnu 'Umar RAa mendatanginya dengan berkendaraan saat tengah hari dan waktu shalat Jumat sudah dekat dan dia meninggalkan shalat Jum'at\". Dan telah berkata [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] berkata, telah menceritakan kepadaku ['Ubaidullah bin Abdullah bin 'Utbah] bahwa bapaknya menulis surat kepada ['Umar bin Abdullah bin Al Arqam Az Zuhriy] untuk menyuruhnya menemui [Subai'ah binti Al Harits Al Aslamiyyah] dan menanyakannya tentang hadits yang disampaikannya dan tentang apa yang disampaikan Rasulullah shallallahu 'alaihi wasallam kepadanya ketika dia meminta fatwa kepada beliau. Maka 'Umar bin Abdullah bin Al Arqam menulis surat balasan kepada Abdullah bin 'Utbah dan mengabarkan bahwa Subai'ah binti Al Harits telah mengabarkan kepadanya bahwa dia dahulu berada dalam tanggungan Sa'ad bin Khawlah, dia adalah dari keturunan Bani 'Amir bin Lu'ay dan dia juga termasuk orang yang ikut dalam perang Badar. Lalu Sa'ad meninggal dunia ketika Hajji Wada' dan Subai'ah dalam keadaan mengandung dan kemudian dia melahirkan tidak lama setelah kematian Sa'ad. Setelah masa nifasnya berakhir, dia berhias diri kepada orang yang hendak meminangnya. Maka Abu as-Sanabil bin Ba'kak, laki-laki dari Bani 'Abdid Dar datang menemuinya dan berkata kepadanya; \"Aku memandang, kamu tidak patut bersoleh di hadapan orang yang meminangmu dengan tujuan menikah. Karena, demi Allah, kamu tidak boleh menikah hingga kamu melewati masa empat bulan sepuluh hari\". Subai'ah berkata; \"Setelah dia mengatakan itu, aku mengemas pakaianku ketika sore hari lalu aku menemui Rasulullah shallallahu 'alaihi wasallam lantas aku bertanya kepada beliau tentang masalah tadi. Beliau memberikan fatwa jawaban kepadaku bahwa aku telah halal ketika aku melahirkan dan beliau menyatakan bahwa aku boleh menikah jika aku mau\". Hadits ini juga diikuti oleh [Ashbagh] dari [Ibnu Wahb] dari [Yunus]. Dan Al Laits berkata, telah menceritakan kepadaku Yunus dari Ibnu Syihab; \"dan kami bertanya kepadanya lalu dia berkata; telah mengabarkan kepadaku Muhammad bin 'Abdur Rahman bin Tsauban, maula Bani 'Amir bin Lu'ay bahwa Muhammad bin Iyas bin Al Bukair, yang bapaknya adalah salah seorang yang ikut perang Badar, telah mengabarkan kerpadanya",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 42
			}
		}
	]
}