{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4093,
			"arabicnumber": 4093,
			"text": "Telah menceritakan kepada kami ['Ubaidullah bin Isma'il] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [Ayahnya] dari ['Aisyah] radliallahu 'anha, dia berkata, \"Abu Bakr pernah meminta izin kepada Nabi shallallahu 'alaihi wasallam untuk hijrah ketika gangguan (orang-orang Quraisy) semakin menjadi-jadi, lalu beliau bersabda kepadanya: \"Berdiam aja dulu.\" Abu Bakar berkata, \"Wahai Rasulullah, apakah anda hendak menunggu perintah?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku berharap hal itu.\" Aisyah melanjutkan, \"Abu Bakr lalu menunggu (perintah hijrah), suatu hari yaitu diwaktu siang, Rasulullah shallallahu 'alaihi wasallam datang menemuinya, beliau lalu menyerunya: \"Suruhlah orang-orang yang ada di sisimu untuk keluar.\" Abu Bakr menjawab, \"Sesungguhnya dia adalah kedua puteriku.\" Beliau bersabda: \"Apakah kamu merasa bahwa diriku telah diizinkan untuk berhijrah?\" Abu Bakr berkata, \"Apa perlu ditemani?\" Maka Nabi shallallahu 'alaihi wasallam menjawab: \"Benar, aku perlu ditemani.\" Abu Bakr berkata, \"Wahai Rasulullah, sesungguhnya aku memiliki dua ekor unta yang telah aku persiapkan untuk berhijrah.\" Kemudian Abu Bakr memberi salah satu hewan tunggannya, yaitu al Jad'a`, keduanya pun berangkat hingga sampai di gua Tsur lalu keduanya bersembunyi di dalamnya. Sementara Amir bin Fuhairah adalah seorang budak milik Abdullah bin Thufail bin Sahbarah, saudara seibu 'Aisyah, dan Abu Bakr juga memiliki beberapa ekor kambing perah, yang setiap pagi dan sore dibawa oleh Amir bin Fuhrairah untuk keduanya. Kemudian ia pergi dimalam hari untuk menemui keduanya, selepas itu Amir bin Fuhairah pergi merumput sehingga tak satupun dari para penggembala yang tahu, tatkala Amir bin Fuhairah berangkat, maka Abu Bakr dan Nabi keluar mengikuti dari belakang hingga keduanya tiba di Madinah. Dan Amir bin Fuhairah gugur pada peristiwa Bi'rul Ma'unah.\" Dan dari Abu Usamah dia berkata, Hisyam bin 'urwah mengatakan; telah mengabarkan kepadaku Ayahku dia berkata, \"Ketika para sahabat dibunuh di Bi'rul Ma'unah dan 'Amr bin Umayyah Adh Dlamri ditawan, Amir bin Thufail kemudian berkata kepadanya, \"Ini adalah Amir bin Fuhairah.\" Ia berkata, \"Sungguh aku telah melihatnya setelah dibunuh dia diangkat ke langit hingga aku melihat ke langit, dia berada di antara langit dan bumi, lalu dia diturunkan. Ketika berita (kematian) mereka sampai kepada Nabi shallallahu 'alaihi wasallam, maka beliau pun mengabarkan berita kematian mereka sambil bersabda: \"Sesungguhnya sahabat-sahabat kalian telah terbunuh, mereka meminta kepada Rabb mereka dengan mengatakan, \"Wahai Rabb kami, sampaikan berita kami kepada saudara-saudara kami tentang apa yang membuat kami ridla terhadap-Mu dan Engkau ridla terhadap kami, \" maka Allah mengabarkan berita mereka.\" Diantara mereka yang terbunuh pada peristiwa tersebut adalah Urwah bin Asma' bin Ash Shalt, lantas 'Urwah pun diberi nama sesuai dengan namanya, begitu juga dengan Mundzir bin Amir yang kemudian diberikan sebagai nama bagi Mundzir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 137
			}
		}
	]
}