{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4102,
			"arabicnumber": 4102,
			"text": "Telah menceritakan kepadaku ['Amru bin Ali] telah menceritakan kepada kami [Abu 'Ashim] telah mengabarkan kepada kami [Hanzhalah bin Abu Sufyan] telah mengabarkan kepada kami [Sa'id bin Mina'] dia berkata, aku mendengar [Jabir bin Abdullah] radliallahu 'anhuma berkata, \"Tatkala penggalian parit pertahanan Khandaq sedang dilaksanakan, aku melihat Rasulullah shallallahu 'alaihi wasallam dalam keadaan lapar. Karena itu aku kembali kepada isteriku, menanyakan kepadanya, 'Apakah engkau mempunyai makanan? Aku melihat Rasulullah shallallahu 'alaihi wasallam sedang lapar.' Maka dikeluarkannya suatu karung, di dalamnya terdapat satu sha' (segantang) gandum. Di samping itu kami mempunyai seekor anak kambing. Lalu aku sembelih kambing itu, sementara isteriku membuat adonan tepung. Ketika aku selesai mengerjakan pekerjaanku, aku lalu memotong-motong kecil daging kambing tersebut dan aku masukkan ke dalam periuk. Setelah itu aku pergi menemui Rasulullah shallallahu 'alaihi wasallam. Isteriku berkata kepadaku, 'Janganlah kamu mempermalukanku dihadapan Rasulullah shallallahu 'alaihi wasallam dan para sahabat beliau.' Aku langusng menemui beliau seraya berbisik kepadanya, 'Wahai Rasulullah! Aku menyembelih seekor anak kambing milikku, dan isteriku telah membuat adonan segantang gandum yang kami miliki. Karena itu sudilah kiranya anda datang bersama-sama dengan beberapa orang sahabat.' Maka Rasulullah shallallahu 'alaihi wasallam berteriak: 'Hai para penggali Khandaq! Jabir telah membuat hidangan untuk kalian semua. Marilah kita makan bersama-sama!\" Rasulullah shallallahu 'alaihi wasallam lalu berkata kepada Jabir: 'Jangan kamu menurunkan periukmu dan janganlah kamu memasak adonan rotimu sebelum aku datang.' Lalu aku pulang. Tidak lama kemudian Rasulullah datang mendahului para sahabat. Ketika aku temui isteriku, dia berkata, 'Bagaimana engkau ini! Bagaimana engkau ini! ' Jawabku, 'Aku telah melakukan apa yang engkau pesankan kepadaku.' Maka aku mengeluarkan adonan roti kami, kemudian nabi meludahi adonan itu untuk memberi keberkahan. Setelah itu beliau menuju periuk (tempat memasak kambing), maka beliau meludahi dan mendo'akan keberkahan kepadanya, sesudah itu beliau berkata kepada isteriku: 'Panggillah tukang roti untuk membantumu memasak. Nanti isikan gulai ke mangkok langsung dari kuali dan sekali-kali jangan kamu menurunkan periukmu. 'Kala itu para sahabat semuanya berjumlah seribu orang. Demi Allah, semuanya turut makan dan setelah itu mereka pergi. Tetapi periuk kami masih tetap penuh berisi seperti semula. Sedangkan adonan masih seperti semula",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 146
			}
		}
	]
}