{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4141,
			"arabicnumber": 4141,
			"text": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah] telah menceritakan kepada kami [Ibrahim bin Sa'ad] dari [Shalih] dari [Ibnu Syihab] ia berkata; telah menceritakan kepadaku ['Urwah bin Az Zubair] dan [Sa'id bin Al Musayyab] dan ['Alqamah bin Waqash Al Laitsi] dan ['Ubaidullah bin Abdullah bin 'Uqbah bin Mas'ud] dari ['Aisyah radliallahu 'anha] istri Nabi shallallahu 'alaihi wasallam, yaitu ketika orang-orang penuduh berkata kepadanya seperti apa yang telah mereka katakan. Mereka semuanya bercerita kepadaku, sekelompok orang becerita berdasarkan apa yang disampaikan 'Aisyah dan sebagian lagi hanya perkiraan mereka, lalu aku menetapkan hadits dari kisah-kisah yang berkenaan dengan peristiwa ini dan aku juga memasukkan hadits-hadits dari mereka yang diceritakan kepadaku dari 'Aisyah dan sebagian lagi hadits saling menguatkan satu sama lain, dimana mereka menduga kepada sebagian yang lain, mereka berkata 'Aisyah berkata: \"Apabila Rasulullah shallallahu 'alaihi wasallam hendak mengadakan suatu perjalanan, beliau biasa mengundi diantara istri-istri beliau, jika nama seorang dari mereka keluar, berarti dia ikut bepergian bersama beliau. Pada suatu hari beliau mengundi nama-nama kami untuk suatu peperangan yang beliau lakukan, maka keluar namaku hingga aku turut serta bersama Rasulullah shallallahu 'alaihi wasallam setelah turun ayat hijab. Aku dibawa didalam sekedup dan ditempatkan didalamnya. Kami lalu berangkat, ketika Rasulullah shallallahu 'alaihi wasallam selesai dari peperangan tersebut, kamipun kembali pulang. Tatkala kami dekat dengan Madinah, beliau mengumumkan untuk beristirahat malam. Maka aku keluar dari sekedup saat beliau dan rombongan berhenti, lalu aku berjalan hingga meninggalkan pasukan. Setelah aku selesai menunaikan keperluanku, aku kembali menuju rombongan, betapa terkejutnya aku, ketika aku meraba dadaku ternyata kalungku yang terbuat dari negeri Zhafar terjatuh. Maka aku kembali untuk mencari kalungku. Aisyah melanjutkan; \"Kemudian orang-orang yang membawaku datang dan membawa sekedupku, dan menaikkannya di atas unta yang aku tunggangi. Mereka menduga aku sudah berada didalam sekedup itu. Memang masa itu para wanita berbadan ringan, tidak terlalu berat, dan mereka tidak banyak daging, mereka hanya makan sesuap makanan. Oleh karena itu orang-orang yang membawa sekedupku tidak curiga dengan ringannya sekedupku ketika mereka mengangkatnya. Saat itu aku adalah wanita yang masih muda. Lalu mereka menggiring unta dan berjalan. Sementara aku baru mendapatkan kembali kalungku setelah pasukan telah berlalu. Aku lalu mendatangi tempat rombongan berhenti, namun tidak ada seorangpun yang tertinggal. Setelah itu aku kembali ke tempatku semula dengan harapan mereka merasa kehilangan aku lalu kembali ke tempatku. Ketika aku duduk, aku terserang rasa kantuk hingga akhirnya aku tertidur. Shafwan bin Al Mu'aththal As Sulami Adz Dzakwan datang menyusuk dari belakang pauskan, kemudian dia menghampiri tempatku dan dia melihat ada bayangan hitam seperti orang yang sedang tidur. Dia mengenaliku saat melihat aku. Dia memang pernah melihat aku sebelum turun ayat hijab. Aku langsung terbangun ketika mendengar kalimat istirja'nya, (ucapan innaa lillahi wa inanaa ilaihi raji'un), saat dia mengenali aku. Aku langsung menutup mukaku dengan jilbabku. Demi Allah, tidaklah kami berbicara sepatah katapun dan aku juga tidak mendengar sepatah katapun darinya kecuali kalimat istirja'nya, dia lalu menghentikan hewan tunggangannya dan merundukkannya hingga berlutut. Maka aku menghampiri tunggangannya itu lalu aku menaikinya. Dia kemudian berjalan sambil menuntun tunggangannya itu hingga kami dapat menyusul pasukan setelah mereka berhenti di tepian sungai Azh Zhahirah untuk singgah di tengah panasnya siang. Aisyah berkata; \"Maka binasalah orang yang binasa.\" Dan orang yang berperan besar menyebarkan berita bohong ini adalah Abdullah bin Ubay bin Salul.\" - 'Urwah berkata; Dikabarkan kepadaku bahwa Abdullah bin Ubay menyebarkan berita bohong itu, menceritakannya, membenarkannya dan menyampaikannya kepada orang-orang sambil menambah-nambahinya- 'Urwah juga berkata; \"Tidak disebutkan orang-orang yang juga terlibat menyebarkan berita bohong itu selain Hasaan bin Tsabit, Misthah bin Utsatsah dan Hamnah binti Jahsyi. Aku tidak tahu tentang mereka melainkan mereka adalah sekelompk orang sebagaimana Allah Ta'ala firmankan. Dan yang paling berperan diantara mereka adalah Abdullah bin Ubay bin Salul. 'Urwah berkata; 'Aisyah tidak suka mencela Hassan, dia berkata bahwa Hassan adalah orang yang pernah bersya'ir: \"Sesungguhnya ayahku, dan ayahnya serta kehormatanku adalah untuk kehormatan Muhammad sebagai tameng dari kalian.\" Selanjutnya 'Aisyah berkata; \"Setibanya kami di Madinah, aku menderita sakit selama satu bulan sejak kedatanganku, sementara orang-orang sibuk dengan berita bohong yang diucapankan oleh orang-orang yang membawa berita bohong. Sementara aku sama sekali tidak menyadari sedikitpun adanya berita tersebut. Namun aku curiga, bila beliau shallallahu 'alaihi wasallam hanya menjengukku saat sakitku dan aku tidak merasakan kelembutan Rasulullah shallallahu 'alaihi wasallam seperti yang biasa aku dapatkan dari beliau ketika aku sedang sakit. Rasulullah shallallahu 'alaihi wasallam hanya masuk menemuiku dan memberi salam lalu bertanya: \"Bagaimana keadaanmu\", lantas pergi. Inilah yang membuat aku gelisah, namun aku tidak menyadari adanya keburukan yang sedang terjadi. Pada suatu hari, aku keluar (dari rumahku) saat aku merasa sudah sembuh. Aku keluar bersama Ummu Misthah menuju Al Manashi', tempat kami biasa membuang hajat dan kami tidak keluar kesana kecuali di malam hari, Hal itu sebelum kami membuat tempat buang hajat di dekat rumah kami. 'Aisyah berkata; \"Dan kebiasaan kami sama seperti kebiasaan orang-orang Arab dahulu, bila buang hajat diluar rumah (atau di lapangan terbuka). Kami merasa tidak nyaman bila membuat tempat buang hajat dekat dengan rumah-rumah kami\". 'Aisyah melanjutkan; \"Maka aku dan Ummu Misthah, -dia adalah anak Abu Ruhum bin Al Muthallib bin Abdu Manaf, sementara ibunya adalah anak dari Shakhar bin 'Amir, bibi dari ibu Abu Bakr Ash Shiddiq, sedangkan anaknya bernama Misthah bin Utsatsah bin 'Abbad bin Al Mutahllib- setelah selesai dari urusan kami, aku dan Ummu Misthah kembali menuju rumahku. Tiba-tiba Ummu Misthah tersandung kainnya seraya berkata; \"Celakalah Misthah.\" Aku katakan kepadanya; \"Sungguh buruk apa yang kamu ucapkan tadi. Apakah kamu mencela seorang laki-laki yang pernah ikut perang Badar?\" Dia berkata; \"Wahai putri, apakah anda belum mendengar apa yang dia ucapkan?\". Aku bertanya; \"Apa yang telah diucapkannya?\" Ummu Misthah menceritakan kepadaku tentang ucapan orang-orang yang membawa berita bohong (tuduhan keji). Kejadian ini semakin menambah sakitku diatas sakit yang sudah aku rasakan. Ketika aku kembali ke rumahku, Rasulullah shallallahu 'alaihi wasallam masuk menemuiku lalu memberi salam dan bersabda: \"Bagaimana keadaanmu?\". Aku bertanya kepada beliau; \"Apakah engkau mengizinkanku untuk pulang ke rumah kedua orangtuaku.\" 'Aisyah berkata: \"Saat itu aku ingin mencari kepastian berita dari pihak kedua orang tuaku.\" Maka Rasulullah shallallahu 'alaihi wasallam memberiku izin, lalu aku bertanya kepada ibuku; \"Wahai ibu, apa yang sedang dibicarakan oleh orang-orang?\" Ibuku menjawab: \"Wahai putriku, tenanglah. Demi Allah, sangat sedikit seorang wanita yang tinggal bersama seorang laki-laki yang dia mencintainya serta memiliki para madu melainkan mereka akan mengganggunya.\" 'Aisyah berkata; aku berkata; \"Subhanallah, apakah benar orang-orang tengah memperbincangkan masalah ini.\" 'Aisyah berkata; \"Maka aku menangis sepanjang malam hingga pagi hari dengan penuh linangan air mata dan aku tidak dapat tidur dan tidak bercelak karena terus menangis, hingga pagi hari aku masih menangis. 'Aisyah melanjutkan; \"Rasulullah shallallahu 'alaihi wasallam memanggil 'Ali bin Abi Thalib dan Usamah bin Zaid ketika wahyu belum turun, beliau bertanya kepada keduanya dan meminta pandangan perihal rencana untuk berpisah dengan istri beliau. 'Aisyah melanjutkan; Usamah memberi isyarat kepada beliau tentang apa yang diketahuinya berupa kebersihan keluarga beliau dan apa yang dia ketahui tentang mereka pada dirinya. Usamah berkata: \"Keluarga anda, tidaklah kami mengenalnya melainkan kebaikan.\" Sedangkan 'Ali bin Abi Thalib berkata; \"Wahai Rasulullah, Allah tidak akan menyusahkan anda, sebab masih banyak wanita-wanita lain. Tanyakanlah kepada sahaya wanitanya yang akan membenarkan anda.\" Maka Rasulullah shallallahu 'alaihi wasallam memanggil Barirah dan bersabda: \"Wahai Barirah, apakah kamu pernah melihat sesuatu yang meragukan pada diri Aisyah?\". Barirah menjawab: \"Demi Dzat Yang mengutus anda dengan benar, aku tidak pernah melihatnya sesuatu yang meragukan. Kalaupun aku melihat sesuatu padanya tidak lebih dari sekedar perkara kecil, dia juga masih sangat muda, dia pernah tidur di atas adonan milik keluargaya lalu dia memakan adonan tersebut.\" 'Aisyah melanjutkan; \"Suatu hari, di saat beliau berdiri di atas mimbar, Rasulullah shallallahu 'alaihi wasallam berdiri untuk mengingatkan Abdullah bin Ubay bin Salul. Beliau bersabda: \"Wahai sekalian kaum Muslimin, siapa orang yang dapat membebaskan aku dari orang yang aku dengar telah menyakiti keluargaku. Demi Allah, aku tidak mengetahui keluargaku melainkan kebaikan. Sungguh mereka telah menyebut-nyebut seseorang (maksudnya Shafwan) yang aku tidak mengenalnya melainkan kebaikan, tidaklah dia mendatangi keluargaku melainkan selalu bersamaku.\" 'Aisyah berkata; \"Maka Sa'ad bin Mu'adz, saudara dari Bani 'Abdul Ashal berdiri seraya berkata: \"Aku wahai Rasulullah, aku akan membalaskan penghinaan ini buat anda. Seandainya orang itu dari kalangan suku Aus, aku akan memenggal batang lehernya dan seandainya dari saudara kami dari suku Khazraj, maka perintahkanlah kepada kami, pasti kami akan melaksanakan apa yang anda perintahkan.\" 'Aisyah melanjutkan; Lalu beridirilah seorang laki-laki dari suku Khazraj -Ibunya Hassan adalah anak dari pamannya- dia adalah Sa'ad bin 'Ubadah, pimpinan suku Khazraj. 'Aisyah melanjutkan; \"Dia adalah orang yang shalih, namun hari itu terbawa oleh sikap kesukuan sehingga berkata kepada Sa'ad bin Mu'adz; \"Dusta kamu, demi Allah yang mengetahui umur hamba-Nya, kamu tidak akan membunuhnya dan tidak akan dapat membunuhnya. Seandainya dia dari sukumu, kamu tentu tidak akan mau membunuhnya.\" Kemudian Usaid bin Hudlair, anak pamannya Sa'ad bin Mu'adz, berdiri seraya berkata; \"Justru kamu yang dusta, demi Allah yang mengetahui umur hamba-Nya, kami pasti akan membunuhnya. Sungguh kamu telah menjadi seorang munafiq karena membela orang-orang munafiq.\" Maka suasana pertemuan menjadi semakin memanas, antara dua suku, Aus dan Khazraj hingga mereka hendak saling membunuh, padahal Rasulullah shallallahu 'alaihi wasallam masih berdiri di atas mimbar. 'Aisyah melanjutkan; \"Rasulullah shallallahu 'alaihi wasallam terus menenangkan mereka hingga akhirnya mereka terdiam dan beliau pun diam. 'Aisyah berkata; \"Maka aku menangis sepanjang hariku, air mataku terus berlinang dan aku tidak bisa tidur tenang karenanya hingga akhirnya kedua orangtuaku berada di sisiku, sementara aku telah menangis selama dua malam satu hari, hingga aku menyangka air mataku telah kering.\" Ketika kedua orangtuaku sedang duduk di dekatku, dan aku terus saja menangis, tiba-tiba seorang wanita Anshar datang meminta izin menemuiku, lalu aku mengizinkannya. Kemudian dia duduk sambil menangis bersamaku. Ketika kami seperti itu, tiba-tiba Rasulullah shallallahu 'alaihi wasallam datang lalu duduk. 'Aisyah berkata; \"Namun beliau tidak duduk di dekatku sejak berita bohong ini tersiar. Sudah satu bulan lamanya peristiwa ini berlangsung sedangkan wahyu belum juga turun untuk menjelaskan perkara yang menimpaku ini.\" Aisyah berkata; \"Rasulullah shallallahu 'alaihi wasallam lalu membaca syahadat ketika duduk, kemudian bersabda: \"Wahai 'Aisyah, sungguh telah sampai kepadaku berita tentang dirimu begini dan begini. Jika kamu bersih, tidak bersalah pasti Allah akan membersihkanmu. Namun jika kamu telah melakukan dosa, maka mohonlah ampun kepada Allah dan bertaubatlah kepada-Nya, karena seorang hamba bila dia mengakui telah berbuat dosa lalu bertaubat, Allah pasti akan menerima taubatnya.\" Setelah Rasulullah shallallahu 'alaihi wasallam menyelesaikan kalimat yang disampaikan, aku membersihkan air mataku agar tidak nampak tersisa setetespun, lalu aku katakan kepada ayahku; \"Belalah aku terhadap apa yang di katakan Rasulullah shallallahu 'alaihi wasallam tentang diriku.\" Ayahku berkata; \"Demi Allah, aku tidak tahu apa yang harus aku katakan kepada Rasulullah shallallahu 'alaihi wasallam.\" Lalu aku katakan kepada ibuku: \"Belalah aku terhadap apa yang di katakan Rasulullah shallallahu 'alaihi wasallam tentang diriku.\" Ibuku pun menjawab; \"Demi Allah, aku tidak mengetahui apa yang harus aku katakan kepada Rasulullah shallallahu 'alaihi wasallam.\" 'Aisyah berkata; \"Aku hanyalah seorang wanita yang masih muda belia, memang aku belum banyak membaca Al Qur'an. Demi Allah, sesungguhnya aku telah mengetahui bahwa kalian telah mendengar apa yang diperbincangkan oleh orang-orang, hingga kalian pun telah memasukkannya dalam hati kalian lalu membenarkan berita tersebut. Seandainya aku katakan kepada kalian bahwa aku bersih dan demi Allah, Dia Maha Mengetahui bahwa aku bersih, kalian pasti tidak akan membenarkan aku. Seandainya aku mengakui (dan membenarkan fitnah tersebut) kepada kalian, padahal Allah Maha Mengetahui bahwa aku bersih, kalian pasti membenarkannya. Demi Allah, aku tidak menemukan antara aku dan kalian suatu perumpamaan melainkan seperti ayahnya Nabi Yusuf 'alaihis salam ketika dia berkata: (\"Bershabarlah dengan shabar yang baik karena Allah akan mengungkap apa yang kalian\") QS Yusuf ayat 18. Setelah itu aku pergi menuju tempat tidurku dan Allah mengetahui hari itu aku memang benar-benar bersih dan Allah-lah yang akan membebaskanku dari tuduhan itu. Akan tetapi, demi Allah, aku tidak menduga kalau Allah akan menurunkan wahyu yang menerangkan tentang urusan yang menimpaku. Karena menurutku tidak pantas bila wahyu turun lalu dibaca orang hanya karena menceritakan masalah peribadiku ini. Aku terlalu rendah bila Allah membicarakan masalahku ini. Tetapi aku hanya berharap Rasulullah shallallahu 'alaihi wasallam mendapatkan wahyu lewat mimpi bahwa Allah membersihkan diriku. Dan demi Allah, sungguh Rasulullah shallallahu 'alaihi wasallam tidak ingin beranjak dari tempat duduknya dan tidak pula seorang pun dari keluarganya yang keluar melainkan telah turun wahyu kepada beliau. Beliau menerima wahyu tersebut sebagaimana beliau biasa menerimanya dalam keadaan yang sangat berat dengan bercucuran keringat seperti butiran mutiara, padahal hari itu adalah musim dingin. Ini karena beratnya wahyu yang diturunkan kepada beliau. 'Aisyah berkata; Setelah itu nampak muka beliau berseri dan dalam keadaan tertawa. Kalimat pertama yang beliau ucapkan adalah: \"Wahai 'Aisyah, sungguh Allah telah membersihkan dirimu.\" 'Aisyah berkata; \"Lalu ibuku berkata kepadaku: \"Bangkitlah untuk menemui beliau.\" Aku berkata: \"Demi Allah, aku tidak akan berdiri kepadanya dan aku tidak akan memuji siapapun selain Allah 'azza wajalla. Maka Allah menurunkan ayat \"Sesungguhnya orang-orang yang menyebarkan berita bohong diantata kalian adalah masih golongan kalian juga…\" QS An Nuur; 11 dan seterusnya sebanyak sepuluh ayat. Selanjutnya turun ayat yang menjelaskan terlepasnya diriku dari segala tuduhan. Abu Bakar Ash Shiddiq yang selalu menanggung hidup Misthah bin Utsatsah karena memang masih kerabatnya berkata: \"Demi Allah, setelah ini aku tidak akan lagi memberi nafkah kepada Misthah untuk selamanya, karena dia telah ikut menyebarkan berita bohong tentang 'Aisyah.\" Kemudian Allah menurunkan ayat; \"Dan janganlah orang-orang yang memiliki kelebihan dan kelapangan diantara kalian bersumpah untuk tidak lagi memberikan kepada …..hingga ayat…. Allah Maha Pengampun lagi Maha Penyayang.\" QS An Nuur; 22. Lantas Abu Bakar berkata; \"Ya, demi Allah, sungguh aku lebih mencintai bila Allah mengampuniku.\" Maka dia kembali memberi nafkah kepada Misthah sebagaimana sebelumnya dan berkata; \"Aku tidak akan mencabut nafkah kepadanya untuk selama-lamanya.\" 'Aisyah berkata; \"Dan Rasulullah shallallahu 'alaihi wasallam pernah bertanya kepada Za",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 185
			}
		}
	]
}