{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"8": "Prayers (Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 425,
			"arabicnumber": 425,
			"text": "Telah menceritakan kepada kami [Sa'id bin 'Ufair] berkata, telah menceritakan kepadaku [Al Laits] berkata, telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] berkata, telah menceritakan kapadaku [Mahmud bin Ar Rabi' Al Anshari] bahwa ['Itban bin Malik] seorang sahabat Rasulullah shallallahu 'alaihi wasallam yang pernah ikut perang Badar dari kalangan Anshar, dia pernah menemui Rasulullah shallallahu 'alaihi wasallam dan bersabda: \"Wahai Rasulullah, pandanganku sudah buruk sedang aku sering memimpin shalat kaumku. Apabila turun hujun, maka air menggenangi lembah yang ada antara aku dan mereka sehingga aku tidak bisa pergi ke masjid untuk memimpin shalat. Aku menginginkan Tuan dapat mengunjungi aku lalu shalat di rumahku yang akan aku jadikan sebagai tempat shalat.\" Mahmud berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Aku akan lakukan insyaallah.\" 'Itban berkata, \"Maka berangkatlah Rasulullah shallallahu 'alaihi wasallam dan Abu Bakar ketika siang hari, beliau lalu meminta izin lalu aku mengizinkannya, dan beliau tidak duduk hingga beliau masuk ke dalam rumah. Kemudian beliau bersabda: \"Mana tempat di rumahmu yang kau sukai untuk aku pimpin shalat.\" Maka aku tunjukkan tempat di sisi rumah. Nabi shallallahu 'alaihi wasallam lalu berdiri dan takbir. Sementara kami berdiri membuat shaf di belakang beliau, beliau shalat dua rakaat kemudian salam.\" 'Itban melanjutkan, \"Lalu kami suguhkan makanan dari daging yang kami masak untuk beliau. Maka berkumpullah warga desa di rumahku dalam jumlah yang banyak. Salah seorang dari mereka lalu berkata, \"Mana Malik bin Ad-Dukhaisyin atau Ibnu Ad Dukhsyun?\" Ada seorang yang menjawab, \"Dia munafik, dia tidak mencintai Allah dan Rasul-Nya.\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Janganlah kamu ucapkan seperti itu. Bukankan kamu tahu dia telah mengucapkan LAA ILAAHA ILLALLAH dengan mengharap ridla Allah?\" Orang itu menjawab, \"Allah dan Rasul-Nya yang lebih tahu.\" 'Itban berkata, \"Kami lihat pandangan dan nasehat beliau itu untuk kaum Munafikin. Bersabda Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah telah mengharamkan neraka bagi orang yang mengucapkan LAA ILAAHA ILLALLAH dengan mengharap ridla Allah?\" [Ibnu Syihab] berkata, \"Kemudian aku tanyakan kepada [Al Hushain bin Muhammad Al Anshari] salah seorang dari Bani Salim yang termasuk orang terpandang tentang hadits Mahmud bin Ar Rabi' ini. Maka dia membenarkannya",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 75
			}
		}
	]
}