{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4251,
			"arabicnumber": 4251,
			"text": "Telah menceritakan kepadaku ['Ubaidullah bin Musa] dari [Israil] dari [Abu Ishaq] dari [Albarra\"] radliallahu 'anhu, katanya, Ketika Nabi shallallahu 'alaihi wasallam berumrah di bulan Dzul qa'dah, dan penduduk Makkah enggan membiarkan beliau memasuki Makkah hingga memperkarakan mereka untuk tinggal hanya selama tiga hari, ketika itu kaum muslimin menulis surat perjanjian, mereka tulis dengan redaksi \"Inilah ketetapan yang diterima Rasulullah\". Orang-orang Quraisy pun mengajukan protes \"Kami tidak mengakui ini, kalaulah kami sadar bahwa engkau adalah Rasulullah, kami sama sekali tidak melarangmu, namun engkau hanyalah Muhammad bin Abdullah\". Rasulullah pun berujar 'Aku Rasulullah, sekaligus aku juga Muhammad bin Abdullah. Kemudian beliau katakan kepada 'Ali bin Abu thalib radliallahu 'anhu \"Tolong hapuslah redaksi Rasulullah.\" Ali katakan \"Demi Allah, saya tidak akan menghapusnya selama-lamanya.\" Rasulullah shallallahu 'alaihi wasallam kemudian mengambil kertas tersebut -padahal beliau tidak bisa menulis dengan baik-dan beliau tulis 'Inilah ketetapan yang diterima Muhammad bin Abdullah agar ia tidak memasuki Makkah dengan senjata, selain pedang yang terbungkus dalam sarung, dan agar jangan sampai penduduk Makkah menghalangi siapapun yang ingin mengikuti beliau melakukan thawaf, dan untuk tidak menghalangi salah seorangpun dari sahabatnya yang ingin bermukim disana. Tatkala Nabi sudah memasuki Makkah dan waktu sudah selesai, Orang-orang Quraisy menemui Ali dan berujar \"Katakan kepada kawanmu (maksudnya Muhammad), masa tinggal di Makkah telah habis! Maka Nabi shallallahu 'alaihi wasallam keluar dari Makkah kemudian anak perempuan Hamzah mengikuti beliau seraya memanggil \"Wahai paman, wahai paman\" Ali kemudian menggandengnya, dan ia tarik tangannya dan berujar kepada Fathimah 'alaihimassalam \"Tolong rawatlah anak perempuan pamanmu\", Maka Fathimah menggendongnya. Kemudian Ali, Zaid, dan Ja'far mempersengketakan anak perempuan Hamzah (maksudnya, masing-masing menginginkan agar anak itu dirumahnya). Ali mengatakan; 'Akulah yang mengambilnya dan dia anak perempuan pamanku.\" Sedang Ja'far mengatakan \"Dia adalah anak perempuan pamanku dan bibinya adalah isteriku sendiri.\" Sedang Zaid mengatakan \"Ia adalah anak perempuan saudaraku.\" Maka Nabi shallallahu 'alaihi wasallam memutuskannya untuk bibinya dan berujar: 'Bibi adalah pengganti ibu'. Dan beliau katakan kepada Ali: \"Engkau bagian dariku, dan aku bagian darimu.\" Dan beliau katakan kepada Ja'far: \"Akhlakku menyerupai akhlakmu.\" Dan beliau katakan kepada Zaid: 'Engkau adalah saudara dan maula kami.\" Ali katakan kepada Rasulullah; \"Tidakkah engkau nikahi anak perempuan Hamzah? Nabi menjawab: \"Dia adalah anak perempuan saudaraku sepersusuan",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 286
			}
		}
	]
}