{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4274,
			"arabicnumber": 4274,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Said] Telah menceritakan kepada kami [Sufyan] dari [Amru bin Dinar], katanya telah mengabarkan kepadaku [Al Hasan bin Muhammad] ia mendengar [Ubaidullah bin Abu Rafi'] mengatakan, aku mendengar [Ali] radliallahu 'anhu berujar, Rasulullah shallallahu 'alaihi wasallam mengutusku, Zubair, dan Miqdad, pesan beliau: \"Berangkatlah kalian hingga kalian sampai \"Raudhah Khakh\", sebab disana ada seorang wanita penunggang unta yang membawa surat, rebutlah surat itu.\" Kata Ubaidullah bin Rafi', kami pun berangkat dan kuda kami pacu secepat-cepatnya hingga kami tiba di Raudah Khakh, disana telah ada ada seorang wanita menunggang unta. Kami katakan kepadanya; \"Tolong keluarkan suratmu.\" \"Aku tak membawa surat.\" Jawab si wanita tersebut. Maka terpaksa kami katakana; \"Kamu harus keluarkan surat itu, atau kami yang akan menelanjangi pakaianmu!\" Kata Ubaidullah, maka si wanita itu akhirnya mau mengeluarkan suratnya dari gelung rambutnya, dan kami bawa surat tersebut kepada Rasulullah Shallallahu'alaihiwasallam. Ternyata surat tersebut berasal dari Khatib bin Abu Balta'ah Al Ansahri untuk beberapa orang musyrik Makkah, memberitakan mereka beberapa kebijakan Rasulullah yang akan beliau lakukan. Maka Rasulullah shallallahu 'alaihi wasallam menginterogasi Hatib bin Abu Balta'ah dengan berujar \"Wahai Hathib, apa maksudmu menulis surat seperti ini?\" Jawab Hathib \"Wahai Rasulullah, jangan engkau terburu-buru menghukumku, aku adalah seseorang yang dahulu terdampar di Quraisy, -lantas ia jelaskan, dia adalah sekutunya, namun bukan berasal dari cucu keturunannya-. Orang-orang muhajirin yang bersamamu mempunyai banyak kerabat yang menjaga keluarga dan harta mereka, maka aku juga pingin jika aku tak punya nasab, aku cari pelindung disisi mereka sehingga menjaga keakrabanku. Aku lakukan bukan karena aku murtad dari agamaku, bukan pula berarti aku ridla terhadap kekafiran setelah keIslaman.\" Rasulullah memberi komentar \"Hatib memang telah jujur kepada kalian.\" Umar namun menyampaikan sikap kerasnya \"Wahai Rasulullah, biarkan aku untuk memenggal leher si munafik ini.\" Rasulullah mencegahnya seraya berujar \"Dia, Hatib, telah ikut perang badar, siapa tahu Allah telah mengintip semua pengikut perang Badar dan bertitah \"lakukan yang kalian suka, AKU telah mengampuni kalian, maka turunlah ayat: \"Wahai orang-orang yang beriman, janganlah kalian ambil musuh-Ku dan musuh kalian sebagai pelindung, kamu nampakkan kecintaan kepada mereka, padahal, mereka mengkufuri kebenaran yang datang kepada kalian.\" -sampai ayat \"Telah sesat dari jalan yang lurus- (QS. Mumtahanah ayat 1)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 308
			}
		}
	]
}