{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4303,
			"arabicnumber": 4303,
			"text": "Telah menceritakan kepadaku [Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari [Urwah bin Zubair] dari [Aisyah] radliallahu 'anhuma, dari Nabi shallallahu 'alaihi wasallam, kata [Al Laits], telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] Telah mengabarkan kepada kami ['Urwah bin Zubair] bahwasanya ['Aisyah] mengatakan, Utbah bin Abu Waqash berpesan serius kepada saudaranya Sa'd bin Abi Waqqash agar mengambil anak hamba sahaya Zam'ah. Utbah berujar \"Anak laki-laki hamba sahaya Zam'ah adalah sebenarnya anakku. Maka ketika Sa'd bin Abu Waqqash tiba di Makkah saat penaklukan makkah, Sa'd bin Abu Waqqash mengambil anak hamba sahaya Zam'ah dan membawanya kepada Rasulullah shallallahu 'alaihi wasallam sekaligus Abd bin Zam'ah (anak laki-laki Zam'ah) juga menghadirinya. Sa'd bin Abu Waqqash menyampaikan; \"Ini adalah anak saudaraku, ia berpesan serius kepadaku (agar mengambilnya, sebab) anak itu adalah anaknya. Maka Abd bin Zam'ah (anak laki-laki Zam'ah) tak mau kalah dengan mengatakan \"Wahai Rasulullah, ini adalah saudara laki-lakiku, dia dilahirkan diatas kasurnya (kasur Zam'ah). Lantas Rasulullah shallallahu 'alaihi wasallam mencermati anak hamba sahaya Zam'ah yang menyerupai Utbah bin Abu Waqqash. Namun anehnya Rasulullah terus mengatakan kepada abd bin Zam'ah \"Anak itu justru bagimu, dia adalah saudara laki-lakimu wahai Abd bin Zam'ah sebab dia dilahirkan diatas kasurnya (kasur Zam'ah) \". Lantas Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berrhijablah engkau daripadanya wahai Saudah, yang demikian karena beliau lihat ada kemiripan dengan Utbah bin Abu Waqqash. Kata Ibnu Syihab, kata Aisyah; Rasulullah shallallahu 'alaihi wasallam bersabda; \"Anak adalah pemilik kasur, pezina harus dihukum batu (rajam). Kata [Ibnu Syihab], dan [Abu Hurairah] berteriak ketika menyampaikan hadits ini",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 336
			}
		}
	]
}