{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4322,
			"arabicnumber": 4322,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] Telah mengabarkan kepada kami [Malik] dari [Yahya bin Said] dari [Umar bin Katsir bin Aflah] dari [Abu Muhammad, -mantan budak- Abu Qatadah] dari [Abu Qatadah] katanya, kami berangkat bersama Nabi shallallahu 'alaihi wasallam pada perang Hunain. Tatkala kami berperang, terjadi perselisihan dikalangan kaum muslimin, namun selanjutnya kulihat seorang musyrikin memburu seorang kaum muslimin. Dengan sigap aku tebas si laki-laki musyrik itu dari belakangnya, tepatnya di urat pundaknya dengan pedang, aku berhasil membelah baju besinya. Tiba-tiba si laki-laki itu menghadapku, mendekapku, namun telah kucium bau kematiannya, dan kematian ia pun mati, sehingga aku terbebas darinya. Kemudian kutemui Umar bin Khattab dan kutanyakan \"Bagaimana nasib orang-orang? Jawabnya; 'Itu sudah menjadi Allah azza wa Jalla.\" Kemudian para sahabat pulang sedang Nabi shallallahu 'alaihi wasallam duduk dan mengumumkan: \"Barangsiapa yang bisa membunuh musuh, dan ia mempunyai bukti, maka baginyalah rampasannya\". Maka aku (Abu Qatadah) berkata; \"Siapa yang mau memberi kesaksian padaku? Aku lantas duduk. Nabi kemudian mengucapkan seperti semula.\" Maka aku pun berdiri untuk kedua kalinya dan mengatakan; siapa yang mau memberi kesaksian kepadaku? Lantas aku duduk. Lalu nabi shallallahu 'alaihi wasallam bersabda dengan kalimat yang serupa. Aku pun berdiri lagi, namun Nabi shallallahu 'alaihi wasallam bertanya; \"Apa perlumu wahai Abu Qatadah? Maka kuberitakan segala yang kulakukan. Tiba-tiba ada seorang sahabat berdiri dan berujar \"Abu Qatadah benar, dan rampasannya ada padaku, tolong bujuklah dia agar meridhai untukku!\" Seketika itu pula Abu Bakar tampil dan berujar; \"Saya bersumpah, Demi Allah, tidak bisa seperti ini. Tidak bisa orang itu menemui salah satu singa Allah (maksudnya Abu Qatadah) yang ia berperang demi Allah dan rasul-Nya lantas ia berikan salab (rampasannya)!\" Nabi shallallahu 'alaihi wasallam berujar; \"Abu Bakar benar, berikan rampasannya kepada Abu Qatadah! Maka si laki-laki pun memberikannya kepadaku. Lalu (Abu Qatadah) dengan rampasan itu aku belikan kebun di bani Salimah, dan itulah harta pertama-tama yang kumiliki semasa Islam. Sedang [Laits] mengatakan, Telah menceritakan kepadaku [Yahya bin Said] dari [Umar bin Katsir bin Aflah] dari [Abu Muhammad], -maula- Abu Qatadah, [Abu Qatadah] bercerita, ketika perang Hunain, aku mencermati seorang kaum muslimin yang memerangi seorang musyrikin, dan ada musuh musyrikin lain yang mengintainya di belakangnya untuk membunuhnya. Maka aku bergegas memburu si pengintai itu, ia angkat pedangnya untuk menyabetku, namun aku lebih dahulu menyabet tangannya hingga putus. Si laki-laki itu terus memegangku dan mendekapku sangat kuat hingga aku ketakutan juga, namun rupanya kekuatannya berangsur-angsur melemah, dan akhirnya aku sungkurkan dan kubunuh, kaum muslimin kemudian kocar-kacir dan aku kocar kacir bersama mereka, tapi ternyata Umar bin khattab masih ditengah-tengah kaum muslimin dan kutanyakan; \"Bagaimana nasib kita? Jawab Umar; \"Allah yang akan menentukannya!\" kemudian para sahabat menemui Rasulullah Shallallahu'alaihiwasallam, dan beliau sampaikan pengumuman; \"Barangsiapa yang bisa mengajukan bukti atas korban yang ia bunuh, maka ia peroleh rampasannya.\" Maka aku segera berdiri untuk mencari bukti atas korban yang kubunuh di perang itu, dan tak kulihat seorang pun yang mau memberi kesaksian atas pembunuhanku. Maka aku duduk, kemudian aku punya inisiatif agar kuutarakan uneg-unegku kepada Rasulullah Shallallahu'alaihiwasallam. Tiba-tiba salah seseorang berujar; \"Senjata orang yang dibunuhnya, yang selalu Abu Qatadah sebut-sebut ada padaku, tolong mintalah keridlaannya!\" Maka Abu Bakar kontan berujar; \"Sekali-kali tidak, nggak bisa, tidak bakalan Rasulullah memberi senjata itu hanya kepada burung pipit quraisy -ucapan penghinaan Abu bakar kepada si laki-laki- sedang beliau tinggalkan singa Allah (julukan Abu Qatadah) yang telah berperang membela Allah dan Rasul-Nya Shallallahu'alaihiwasallam. Maka Rasulullah shallallahu 'alaihi wasallam berdiri. Lalu si laki-laki menyerahkan senjatanya kepadaku yang dengannya kubelikan sebidang kebun. Itulah kekayaaan pertama-tama yang kumiliki dalam keIslamanku",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 352
			}
		}
	]
}