{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4323,
			"arabicnumber": 4323,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al'Ala'] Telah menceritakan kepada kami [Abu Usamah] dari [Buraid bin Abdullah] dari [Abu Burdah] dari [Abu Musa] radliallahu 'anhu katanya, selepas Nabi shallallahu 'alaihi wasallam dari perang Hunain, beliau utus Abu Amir memimpin pasukan ke Authas. Selanjutnya Abu Amir temui Duraid bin Shimah dan Duraid pun terbunuh. Kemudian Allah menghancurkan para pengikutnya. Kata Abu Musa; Rasul mengutusku bersama Abu Amir, Abu umair kemudian terkena lemparan pada lututnya, ia terkena panah yang dibidikkan oleh Jusyami hingga panah itu terus menancap di lututnya. Aku pun menemuinya dan bertanya; \"Wahai paman, siapa yang melemparmu? Ia memberi isyarat kepada Abu Musa dan berujar; \"Itulah pembunuhku yang telah membidikkan panah kepadaku.\" Maka aku memburunya dan berusaha kutemui, ketika ia melihatku, ia melarikan diri, maka aku terus menguntitnya dan kuejek; \"Apa kamu tidak malu, tidak bisakah engkau bertahan?\" Ia pun bertahan, kami bergantian menebas dengan pedang dua kali sabetan yang selanjutnya aku berhasil membunuhnya. Kemudian kukatakan kepada Abu Amir; \"Allah telah membunuh kawanmu. Abu Amir kemudian berujar; \"Tolong cabutlah panah ini dariku\" Maka aku mencabutnya sehingga lukanya mengalirkan air. Kata Abu amir \"Wahai anak saudaraku, sampaikanlah salam kepada Nabi shallallahu 'alaihi wasallam dan sampaikan, \"Mintakanlah ampunan untukku! Dan Abu Amir menjadikanku sebagai komandan para sahabat. Ia masih bertahan beberapa saat kemudian wafat. Aku pun pulang dan kutemui Nabi shallallahu 'alaihi wasallam di rumahnya diatas tempat tidur yang terbuat dari pelepah kurma beralaskan kasur dan pelepah kasurnya membekas di punggung dan pinggangnya. Kusampaikan kepada beliau segala berita kami dan juga berita Abu Amir yang menyampaikan pesan, \"Sampaikan kepada Rasulullah, mintakanlah ampunan untukku.\" Nabi meminta air, dan beliau berwudhu, kemudian beliau tengadahkan kedua tangannya dan berdoa ALLOOHUMMAGHFIR LI'UBAID ABI AMIR\" (Ya Allah, berilah ampunan untuk hamba-Mu yang lemah, Abu Amir), dan kulihat ketiaknya yang putih kemudian beliau memanjatkan doa ALLOOHUMMAJ'ALHU YAUMAL QIYAAMATI FAUQO KATSIIRIN MIN KHOLQIKA MINAN NASI' (Ya Allah, jadikanlah ia diatas kebanyakan manusia ciptaan-Mu). Maka aku meminta; \"Dan aku juga mintakanlah ampunan.\" Maka Nabi panjatkan ALLOOHUMMAGH FIR LIABDILLAH BIN QAIS DZANBAHU WA ADKHILHU YAUMAL QIYAMATI MUDKHALAN KARIIMA (Ya Allah, ampunilah Abdullah bin Qais (Abu Musa) atas dosanya, dan masukkanlah pada hari kiamat ke tempat yang terpuji). Kata Abu Burdah, satu doanya untuk Abu Amir dan satunya untuk Abu Musa",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 353
			}
		}
	]
}