{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4359,
			"arabicnumber": 4359,
			"text": "Telah menceritakan kepadaku ['Abdullah bin Abu Syaibah Al 'Absi] Telah menceritakan kepada kami [Ibnu Idris] dari [Isma'il bin Abu Khalid] dari [Qais] dari [Jarir] dia berkata; Ketika aku berada di Yaman, aku bertemu dengan dua orang Yaman yang bernama dzu-Kala dan Dzy-Amr. Kepada mereka berdua kuceritakan perihal Rasulllah Shallallahu'alaihiwasallam. Dzu-Amr berkata kepadaku, \"Jika cerita tentang sahabatmu itu (Rasulullah Shallallahu'alaihiwasallam) benar, maka ia telah wafat tiga hari yang lalu.\"Maka mereka berdua pergi bersamaku ke Madinah dan ketika jarak kami telah dekat dengan Madinah kami melihat sejumlah orang menunggang binatang-binatang mereka datang dari arah Madinah. Kami bertanya kepada mereka dan mereka berkata,: \"Rasulullah Shallallahu 'Alaih wa Sallam telah wafat dan Abu Bakar telah ditunjuk sebagai khalifah, sementara orang-orang (Muslim) dalam keadaan baik.\"Kemudian mereka (berdua) berkata, \"Katakan kepada sahabatmu (Abu Bakar) bahwa kami (berniat mengunjunginya) dan insya allah, kami akan kembali ke mari.\" Maka mereka (berdua) pulang kembali ke Yaman. Maka hal itu aku kabarkan kepada Abu Bakr. Lalu dia berkata; Kenapa kamu tidak datang bersama mereka. Pada keesokan harinya Dzu Amru berkata kepadaku; Ya Jarir, kamu memiliki kemuliaan padaku, Sungguh aku akan mengabarkan kepadamu satu kabar: Sesungguhnya kalian wahai bangsa Arab, akan senantiasa dalam keadaan baik sebagaimana keadaan saat ini. Karena ketika pemimpin kalian meninggal, kalian memilih pemimpin yang lain. Tetapi jika kalian memilihnya dengan memakai pedang (peperangan), maka hal itu tidak beda dengan para raja yang apa bila mereka murka maka kemurkaannya karena kekuasaan dan apabila rela maka kerelaannya pun karena kekuasaan",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 385
			}
		}
	]
}