{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4378,
			"arabicnumber": 4378,
			"text": "Telah menceritakan kepada kami [Sa'id bin Muhammad Al Jarmi] Telah menceritakan kepada kami [Ya'qub bin Ibrahim] Telah menceritakan kepada kami [Bapakku] dari [Shalih] dari [Ibnu 'Ubaidah bin Nasyith] di dalam riwayat lain ia bernama 'Abdullah. ['Ubaidullah bin 'Abdullah bin 'Utbah] berkata; kami mendengar bahwa Musailamah Al Kadzdzab sudah sampai di Madinah, lalu ia singgah di rumah Binti Al Harits bin Kuraiz yaitu Ibnu Abdullah bin 'Amir. Lalu Rasulullah shallallahu 'alaihi wasallam bersama Tsabit bin Qais bin Syammas -juru bicara Rasulullah shallallahu 'alaihi wasallam- menemuinya. Pada waktu itu beliau membawa sebatang tongkat. Lalu beliau berdiri dihadapannya dan berdialog dengannya. Musailamah berkata kepada beliau; Jika anda mau, kita selesaikan urusan kita. Lalu Nabi shallallahu 'alaihi wasallam berkata; 'seandainya kamu meminta tongkat ini, maka aku tidak akan memberikannya kepadamu. Dan sungguh aku melihatmu seperti apa yang telah aku lihat dalam mimpiku. Inilah Tsabit bin Qais akan menjawab tantanganmu.' Lalu beliau shallallahu 'alaihi wasallam pergi. Ubaidullah bin Abdullah berkata; Aku bertanya kepada [Ibnu Abbas] tentang mimpi Rasulullah shallallahu 'alaihi wasallam yang telah beliau sebutkan. Ibnu Abbas menjawab; Rasulullah shallallahu 'alaihi wasallam menyebutkan kepadaku, beliau bersabda: 'Ketika aku sedang tidur, aku bermimpi bahwa di kedua tanganku ada dua buah gelang emas, hingga aku merasa cemas dengan keberadaan dua buah gelang itu. Kemudian aku diberi wahyu dalam tidurku itu agar aku meniup kedua gelang tersebut, lalu akupun meniupnya hingga kedua gelang itu hilang. Maka dari mimpi itu aku menafsirkan bahwa dua buah gelang tersebut adalah dua orang pembohong (nabi palsu) yang akan muncul sepeninggalku kelak. Ubaidullah berkata; yang satu adalah Al Ansi, yang dibunuh oleh Fairuz di Yaman, dan yang satunya adalah Musailamah Al Kadzab",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}