{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4415,
			"arabicnumber": 4415,
			"text": "Telah menceritakan kepadaku [Muhammad bin Al A'laa] Telah menceritakan kepada kami [Abu Usamah] dari [Buraid bin 'Abdullah bin Abu Burdah] dari [Abu Burdah] dari [Abu Musa] radliallahu 'anhu dia berkata; para sahabatku mengutusku menemui Rasulullah shallallahu 'alaihi wasallam untuk meminta darinya sejumlah hewan tunggangan karena mereka ikut ambil bagian bersama Rasulullah shallallahu 'alaihi wasallam dalam pasukan Al 'Usrah, yaitu perang Tabuk. Aku berkata; Ya Rasulullah! Para sahabatku memintamu memberi mereka hewan tunggangan. Nabi shallallahu 'alaihi wasallam bersabda: Demi Allah, kalian tidak perlu mengendarai apapun. Itu terjadi ketika aku menemui Nabi shallallahu 'alaihi wasallam dalam keadaan marah dan aku tidak mengetahuinya. Maka dengan perasaan sedih karena penolakan itu, aku kembali dan dengan perasaan takut kalau Rasulullah shallallahu 'alaihi wasallam akan marah padaku. Maka aku kembali menemui para sahabatku, dan memberi tahukan apa yang terjadi. Tak berapa lama kemudian, aku mendengar Bilal memanggilku; wahai Abdullah bin Qais! Aku menjawab panggilannya. Bilal berkata; Rasulullah shallallahu 'alaihi wasallam memanggilmu. Ketika aku berjumpa dengannya, Nabi shallallahu 'alaihi wasallam berkata; Ambillah dua unta ini, dan dua unta ini. Seraya menunjuk enam ekor unta yang dibawa Nabi shallallahu 'alaihi wasallam dari Sa'ad. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: Bawalah unta-unta itu kepada para sahabatmu dan katakan Allah atau Rasulullah shallallahu 'alaihi wasallam mengizinkanmu mengendarainya, jadi kendarailah. Maka akupun membawa unta-unta itu kepada mereka dan berkata; Nabi shallallahu 'alaihi wasallam mengizinkan kalian mengendarai unta-unta ini, aku tidak akan meninggalkan kalian hingga sebagian dari kalian ikut bersamaku menemui seseorang yang mendengar perkataan Nabi shallallahu 'alaihi wasallam. Jangan berfikir bahwa aku mengatakan apa yang tidak dikatakan Nabi shallallahu 'alaihi wasallam. mereka berkata kepadaku; menurut kami, kamu benar. Dan kami akan melakukan apa yang kamu inginkan. Maka Abu Musa berangkat bersama sebagian dari mereka menemui orang-orang yang mendengar langsung perkataan Rasulullah shallallahu 'alaihi wasallam. Dan ternyata mereka menginformasikan hal yang sama sebagaimana yang diinformasikan Abu Musa",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 437
			}
		}
	]
}