{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4513,
			"arabicnumber": 4513,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basysyar] Telah menceritakan kepada kami ['Abdul Wahhab] Telah menceritakan kepada kami ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar radliallahu 'anhuma] bahwa dua orang laki-laki mendatangi Ibnu Jubair mengadukan perihal fitnah yang menimpa Ibnu Jubair keduanya berkata; sesungguhnya orang-orang telah berbuat sesuatu kepadanya, sedangkan kamu wahai Ibnu Umar sebagai sahabat Rasulullah shallallahu 'alaihi wasallam, apa yang menghalangimu tidak ikut campur dalam urusan ini? Ibnu Umar menjawab; 'Yang menghalangiku adalah karena Allah telah mengharamkan darah saudara muslim. Lalu keduanya berkata; 'Bukankah Allah telah berfirman: \"Dan perangilah mereka sehingga tidak ada lagi fitnah?\" maka Ibnu Umar menjawab: \"Kami telah berperang hingga fitnah itu tidak ada lagi dan din ini sudah menjadi milik Allah. Sedangkan kalian menginginkan peperangan hingga terjadi fitnah dan din ini menjadi milik bukan selain Allah. ['Utsman bin Shalih] menambahkan dari [Ibnu Wahhab] dia berkata; Telah mengabarkan kepadaku Fulaan dan [Haiwah bin Syuraih] dari [Bakr bin 'Amru Al Ma'afiri] bahwa [Bukair bin 'Abdullah] Telah menceritakan kepadanya dari [Nafi'] bahwa seseorang menemui Ibnu 'Umar seraya berkata; 'Wahai Abu 'Abdur Rahman apa yang menghalangimu untuk berhaji dan berumrah pada tahun ini dan kamu meninggalkan jihad di jalan Allah padahal kamu tahu bahwa Allah sangat menganjurkan hal itu? [Ibnu Umar] menjawab; 'Wahai anak saudaraku, Islam ini dibangun atas lima dasar; Iman kepada Allah dan Rasul-Nya, shalat lima waktu, puasa dibulan Ramadlan, menunaikan zakat, dan haji ke baitullah. Laki-laki itu berkata; 'Wahai Abu Abdurrahman, apakah kamu tidak mendengar apa yang disebutkan Allah di dalam kitabnya: \"Dan kalau ada dua golongan dari mereka yang beriman itu berperang hendaklah kamu damaikan antara keduanya! Tapi kalau yang satu melanggar perjanjian terhadap yang lain, hendaklah yang melanggar perjanjian itu kamu perangi sampai kembali pada perintah Allah\". Juga firman Allah: \"Perangilah mereka hingga tidak ada fitnah.\" Ibnu Umar menjawab; 'kami telah melakukan hal itu pada masa Rasulullah shallallahu 'alaihi wasallam ketika Islam masih sedikit hingga seseorang dari kami difitnah karena agamanya, baik dengan dibunuh maupun disiksa sampai Islam semakin menyebar dan tidak ada lagi fitnah. Orang itu berkata lagi; 'Bagaimana pendapatmu tentang Utsman dan Ali? Ibnu Umar menjawab; 'Adapun Utsman maka Allah telah memaafkannya sedangkan kalian telah membenci untuk memaafkannya. Sedangkan Ali dia adalah sepupu Rasulullah shallallahu 'alaihi wasallam dan menantunya. Lalu dia mengisyaratkan dengan tangannya seraya berkata; 'Inilah rumahnya sebagaimana kamu lihat",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}