{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4554,
			"arabicnumber": 4554,
			"text": "Telah menceritakan kepada kami [Isma'il] berkata; Telah menceritakan kepadaku [Malik] dari [Ishaq bin 'Abdullah bin Abu Thalhah] bahwasanya dia mendengar [Anas bin Malik radliallahu 'anhu] berkata; Abu Thalhah adalah orang Anshar yang paling banyak pohon kurmanya. Dan harta yang paling ia sukai dari harta miliknya adalah Bairuha` (kebun) yang berhadapan dengan masjid. Nabi shallallahu 'alaihi wasallam biasa masuk ke dalamnya untuk minum airnya yang jernih segar. ketika turun ayat: \"Kamu sekali-kali tidak akan mendapatkan kebajikan (yang sempurna) sebelum kamu menafkahkan sebahagian harta yang kamu cintai. Maka Abu Thalhah berkata; \"Wahai Rasulullah, sesungguhnya Allah telah berfirman: Kamu sekali-kali tidak sampai kepada kebajikan (yang sempurna), sebelum kamu menafkahkan sebahagian harta yang kamu cintai, dan harta yang paling aku sukai adalah Bairuha`, maka ia sekarang adalah sedekah bagi Allah 'azza wajalla. Dan aku mengharap kebaikan dan simpanannya di sisi Allah. Wahai Rasulullah, sekarang aturlah ia sesukamu.\" Maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Amboi, itu adalah harta yang menguntungkan, itu adalah harta yang menguntungkan! Aku telah mendengar apa yang telah kamu katakan, namun aku melihat sepertinya lebih baik itu engkau sedekahkan untuk kerabat-kerabatmu.\" Lalu Abu Thalhah berkata; \"Wahai Rasulullah, aku akan melakukannya.\" Maka Abu Thalhah pun membagi-bagikan kepada kerabat dan anak-anak pamannya.\" ['Abdullah bin Yusuf] dan [Rauh bin 'Ubadah] berkata; 'Itulah harta yang rabih (menguntungkan). Telah menceritakan kepadaku [Yahya bin Yahya] dia berkata; Aku membaca Hadits [Malik] dengan lafazh; 'Maal Rayih.' (harta yang menguntungkan). Telah menceritakan kepada kami [Muhammad bin 'Abdullah Al Anshari] dia berkata; Telah menceritakan kepadaku [Bapakku] dari [Tsumamah] dari [Anas radliallahu 'anhu] berkata; 'Maka harta itu dibagikan kepada Hassan dan Ubay, dan akupun termasuk kerabat yang paling dekat dengannya namun dia tidak memberikannya kepadaku sedikit pun",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 76
			}
		}
	]
}