{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4574,
			"arabicnumber": 4574,
			"text": "Telah menceritakan kepada kami ['Abdul 'Aziz bin 'Abdullah] Telah menceritakan kepada kami [Ibrahim bin Sa'ad] dari [Shalih bin Kaisan] dari [Ibnu Syihab] dia berkata; Telah mengabarkan kepadaku ['Urwah bin Az Zubair] bahwasanya ia bertanya kepada ['Aisyah] mengenai firman Allah Azza wa Jalla: 'Jika kalian takut tidak berbuat adil kepada anak yatim.. (An Nisa: 3) Aisyah berkata; 'wahai anak saudariku, yang dimaksud adalah seorang gadis yatim yang berada di peliharaan walinya, ia membantu dalam mengurus hartanya, lalu walinya takjub dengan harta dan kecantikannya hingga ia ingin menikahinya namun tidak bisa berbuat adil dalam maharnya sehingga Ia memberinya seperti yang diberikan oleh orang selainnya. Maka mereka dilarang untuk menikahi gadis-gadis itu kecuali jika berbuat adil dan memberi sebaik-baik mahar kepada mereka, sehingga mereka bisa memperoleh setinggi-tinggi mahar seukuran kondisi yang berlaku. Akhirnya mereka diperintahkan untuk menikahi wanita yang baik selain anak-anak perempuan yatim itu. Urwah berkata; lalu 'Aisyah berkata; sesungguhnya orang-orang meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam setelah turun ayat tersebut, lalu Allah Azza wa Jalla menurunkan: dan mereka meminta fatwa kepadamu tentang wanita-wanita, katakanlah bahwa Allah memberi fatwa kepada kalian sampai firman Allah: dan kalian ingin menikahi mereka. 'Aisyah berkata; maksudnya, ketika terjadi ketidak senangan seseorang diantara kalian kepada anak yatim yang ia pelihara karena harta dan kecantikannya sedikit, maka mereka dilarang untuk menikahinya karena dorongan niyat untuk menguasai harta gadis-gadis yatim itu. Kecuali jika bisa menegakkan keadilan meskipun ada ketidak senangan kepada mereka",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 96
			}
		}
	]
}