{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4607,
			"arabicnumber": 4607,
			"text": "Telah menceritakan kepada kami [Isma'il] dia berkata; Telah menceritakan kepadaku [Malik] dari ['Abdur Rahman bin Al Qasim] dari [Bapaknya] dari ['Aisyah radliallahu 'anha] isteri Nabi shallallahu 'alaihi wasallam berkata; \"Kami pernah bersama Rasulullah Shallallahu'alihi wasallam dalam sebagian perjalanannya, dan saat kami sampai di Al Baida -atau di Dzatuljaisy- kalungku hilang, maka Rasulullah Shallallahu'alihi wasallam berhenti untuk mencarinya dan para sahabat juga ikut bersamanya. Mereka tidak mempunyai air dan juga Rasulullah Shallallahu'alihi wasallam. Para sahabat datang kepada Abu Bakar Radliyallhu'anhu dan berkata, 'Apakah kamu tidak melihat apa yang diperbuat Aisyah?! Ia menghentikan (menahan) Rasulullah Shallallahu'alihi wasallam dan para sahabat, padahal mereka tidak pada tempat yang ada airnya dan mereka juga tidak mempunyai air'. Abu Bakar Radliyallahu'anhu lalu datang (kepadaku) dan Rasulullah Shallallahu'alihi wasallam berbaring meletakkan kepalanya diatas pahaku dan beliau tertidur. Ia berkata, 'Kamu menahan Rasulullah Shallallahu'alihi wasallam dan manusia pada tempat yang tidak ada airnya dan mereka juga tidak mempunyai air?\" Aisyah berkata, \"Abu Bakar mencelaku dan beliau mengatakan sebagaimana yang dikehendaki Allah dan ia menekan lambungku dengan tangannya. Tidak ada yang menghalangiku untuk bergerak kecuali keadaan Rasulullah Shallallahu'alihi wasallam yang berada diatas pahaku! Rasulullah Shallallahu'alihi wasallam tertidur hingga pagi, tanpa ada air. Kemudian Allah Azza wa Jalla menurunkan ayat tayamum, maka mereka pun bertayamum.\" Usaid bin Hudhair berkata; \"Ini bukan keberkahan keluargamu yang pertama wahai keluarga Abu Bakar!\" Aisyah berkata, \"Lalu kami membangunkan unta yang kami tunggangi, dan kalung tersebut ternyata ada dibawahnya",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 129
			}
		}
	]
}