{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4610,
			"arabicnumber": 4610,
			"text": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] Telah menceritakan kepada kami [Muhammad bin 'Abdullah Al Anshari] Telah menceritakan kepada kami [Ibnu 'Aun] dia berkata; Telah menceritakan kepadaku [Salman Abu Raja'] mantan budak Abu Qilabah dari [Abu Qilabah] bahwasanya ia pernah duduk di belakang 'Umar bin 'Abdul 'Aziz lalu mereka berbincang-bincang tentang para khalifah. Abu Qilabah berkata; para khalifah itu telah memimpin. Umar pun menoleh kepadanya -pada waktu itu Abu Qilabah berada dibelakangnya.- seraya berkata; apa yang kamu katakan wahai Abdullah bin Zaid, -atau ia mengatakan-, apa yang kamu katakan wahai Abu Qilabah? Aku menjawab; Aku tidak mengetahui seseorang jiwa boleh dibunuh dalam Islam, kecuali seseorang yang telah menikah kemudian berzina, atau ia membunuh secara tidak benar, atau ia memerangi Allah dan Rasul-Nya shallallahu 'alaihi wasallam. ['Anbasah] berkata; Telah menceritakan kepada kami [Anas] mengenai hal ini dan itu. Aku berkata; dan kepadaku Anas menceritakannya, ia berkata; suatu kaum pernah menemui Nabi shallallahu 'alaihi wasallam seraya berkata; Cuaca kota ini sudah tidak cocok bagi kami. Maka Nabi shallallahu 'alaihi wasallam bersabda: ini ada beberapa hewan ternak milik kami, maka keluarlah kalian dan minumlah dari susu dan air kencingnya. Lalu mereka pun meminum susu dan air kencing unta hingga mereka segar kembali. Lalu mereka mendekati pengembala dan membunuhnya serta mengusir bintang ternaknya. Tak lama kemudian, diantara mereka ada yang membunuh jiwa secara tidak benar, dan memerangi Allah dan Rasu-Nya serta menakut-nakuti Rasulullah shallallahu 'alaihi wasallam. kemudian Umar berkata; Maha suci Allah, lalu berkata; 'Apakah kamu menuduhku? Abu Qilabah berkata; Anas telah menceritakan kepada kami mengenai hal ini, dan dia berkata; wahai penduduk ini (Syam), sesungguhnya kalian akan senantiasa dalam kebaikan selama orang ini ada pada kalian. -atau yang serupa dengan hal itu",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 132
			}
		}
	]
}