{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4640,
			"arabicnumber": 4640,
			"text": "Telah menceritakan kepada kami ['Abdullah] Telah menceritakan kepada kami [Sulaiman bin 'Abdur Rahman] dan [Musa bin Harun] dia berkata; Telah menceritakan kepada kami [Al Walid bin Muslim] Telah menceritakan kepada kami ['Abdullah bin Al A'laa bin Zabr] dia berkata; Telah menceritakan kepadaku [Busr bin 'Ubaidillah] dia berkata; Telah menceritakan kepadaku [Abu Idris Al Khaulani] dia berkata; Aku mendengar [Abu Darda] berkata; Abu Bakr dan Umar pernah berdebat hingga Abu Bakr marah kepada Umar. Umar pun berpaling darinya dalam keadaan marah. Lalu Abu Bakr mengejarnya untuk meminta maaf. Namun Umar tidak memberi maaf hingga ia menutup pintu rumahnya dihadapan Abu Bakr. Abu Bakr kemudian menemui Rasulullah shallallahu 'alaihi wasallam. Abu Darda berkata; pada waktu itu aku berada disamping Rasulullah shallallahu 'alaihi wasallam. kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya temanmu ini telah berbuat baik lebih dahulu.\" Abu Darda berkata; maka Umar menyesal atas apa yang telah dia perbuat. Lalu ia datang dan mengucapkan salam serta duduk di samping Rasulullah shallallahu 'alaihi wasallam seraya menceritakan kepada Rasulullah shallallahu 'alaihi wasallam apa yang telah ia perbuat. Abu Darda berkata; Rasulullah shallallahu 'alaihi wasallam pun marah, hingga Abu Bakr berkata; 'Demi Allah ya Rasulullah, Akulah yang telah berbuat zhalim. Rasulullah shallallahu 'alaihi wasallam bersabda: 'Bukankah kalian pernah meninggalkan sahabatku untukku, Bukankah kalian pernah meninggalkan sahabatku untukku?. Sesungguhnya aku pernah berkata; Wahai sekalian manusia, sesungguhnya aku adalah utusan kepada kalian semua, lalu kalian katakan; 'Anda telah berdusta, namun Abu Bakr berkata; 'Anda benar.' Abu Abdullah berkata; Ghamara artinya; telah berbuat baik lebih dahulu",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 162
			}
		}
	]
}