{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4726,
			"arabicnumber": 4726,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Musa] Telah mengabarkan kepada kami [Hisyam bin Yusuf] bahwa [Ibnu Juraij] Telah mengabarkan kepada mereka, dia berkata; Telah mengabarkan kepadaku [Ya'la bin Muslim] dan ['Amru bin Dinar] dari [Sa'id bin Jubair] salah satu dari mereka menambahkan yang lainnya, aku mendengarnya bercerita dari Sa'id bin Jubair dia berkata; sesungguhnya pada suatu saat aku berada di sisi Ibnu 'Abbas di rumahnya. Lalu ia berkata; 'Bertanyalah kepadaku, maka aku berkata; Wahai Ibnu 'Abbas semoga Allah menjadikanku sebagai tebusanmu, sungguh di Kufah ada seseorang yang bercerita, ia biasa di panggil Nauf, ia menganggap bahwa Musa 'Alaihis Salam yang berada di tengah kaum Bani Israil bukanlah Musa yang menyertai Nabi Khidhir.\" Sedangkan [Amru] berkata kepadaku; Ibnu Abbas berkata; Berdustalah musuh Allah. sedangkan [Ya'la] berkata kepadaku; bahwa [Ibnu Abbas] berkata; Telah menceritakan kepadaku [Ubay bin Ka'ab], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: “Musa adalah Utusan Allah, suatu ketika Nabi Musa 'Alaihis Salam berdiri untuk berpidato mengingatkan kaum Bani israil, hingga semua mata mencucurkan airnya dan semua hati pun merasa terharu. Setelah itu, seseorang bertanya kepadanya; “Wahai utusan Allah, Apakah dibumi ini ada orang lain yang lebih berilmu darimu?” Nabi Musa menjawab; “Tidak ada”. Oleh karena itu, Allah sangat mencela Musa 'Alaihis Salam. Karena ia tidak mengembalikan ilmu itu kepada Allah. Lantas ada suara \"Bahkan ada\". Musa bertanya \"Wahai Rabb-ku dimana orang itu?\" \"Ia berada di pertemuan dua lautan.' Nabi Musa 'Alaihis Salam bertanya; 'Ya Rabb-ku, berikan aku tanda-tanda agar dapat mengenalinya?'. [Amru] berkata kepadaku: “Allah berfirman: 'di tempat seekor ikan memisahkan diri darimu.” Sedangkan [Ya'la] berkata kepadaku; “Allah berfirman: 'Ambillah Nun yang sudah mati hingga ditiupkan ruh padanya'. Maka musa mengambilnya dan menempatkannya di dalam keranjang, kemudian dia berkata kepada pembantunya, aku tidak membebanimu kecuali engkau memberitahukan kepadaku tempat ikan tersebut memisahkan diri darimu. Maka pembantunya menjawab: “Engkau tidak membebaniku dengan sesuatu yang berat”. Yang demikian itu adalah firman Azza wajalla: “Dan ketika Musa berkata kepada pembantunya”. Yaitu Yusa bin Nun. Sedangkan riwayat selain dari Sa'id menerangkan: Ketika mereka berada di bayang-bayang batu besar di tempat yang airnya mengalir, pada saat itu ikan yang ada di dalam keranjang melompat-lompat, sedang Musa tertidur. Maka pembantunya berkata: “Aku tidak akan membangunkannya sampai ia bangun sendiri”, tetapi pembantunya rupanya lupa untuk memberitahukan kepada Musa sehingga ikan itu melompat-lompat hingga keluar dari keranjang dan terjebur ke laut. Tapi Allah subhanahu wa ta'ala menahan laju air laut itu, sehingga bekas laju ikan tersebut terbentuk. Sedangkan menurut ['Amru] dengan redaksi: “Seakan-akan bekasnya itu di atas batu”, kemudian dia melingkarkan dua ibu jarinya dan dua jari lainnya (hingga membentuk seperti lubang). Firman Allah subhanahu wata'ala: “(Musa berkata) Sesungguhnya kita sudah letih karena perjalanan kita ini”. Pembantunya berkata: “Allah subhanahu wata'ala telah menghilangkan kelelahan darimu. Dan redaksi ini bukan dari riwayat Sa'id. Kemudian mereka berdua kembali dan mereka menemukan Khidir. [Utsman bin Abi Sulaiman] berkata kepadaku: “Di atas permadani hijau di tengah-tengah laut”. Sedang [Sa'id bin Jubair] menerangkan: “Berselimutkan baju yang salah satu ujung bajunya diletakkan di bawah kedua kakinya, dan ujung lainnya di bawah kepalanya. Maka Musa mengucapkan salam kepadanya dan Khidir menyingkap wajahnya dan menjawab: “Apakah di bumiku keselamatan? Siapa anda?” Musa menjawab: “Saya Musa”, Khidir bertanya: “Musa bani Isra'il?” Nabi Musa menjawab; 'Ya.' Khidir bertanya lagi: “Apa keperluanmu?” Musa menjawab: “Aku mendatangimu agar engkau mengajarkan kepadaku ilmu-ilmu yang diajarkan kepadamu.” Khidir berkata: “Apakah tidak cukup dengan Taurat di tanganmu? Dan wahyu pun turun kepadamu wahai Musa. Sesungguhnya aku memiliki ilmu yang tidak layak bagimu untuk mengetahuinya, dan kamupun memiliki ilmu yang tidak layak bagiku untuk mengetahuinya”. Tiba-tiba seekor burung menukik dengan paruhnya mengambil setetes air di tengah laut. Khidir melanjutkan: “Demi Allah ilmumu dan ilmuku tidak ada apa-apanya dengan ilmu Allah subhanahu wata'ala kecuali seperti burung ini yang menukik dengan paruhnya mengambil setetes air di tengah laut. Sehingga ketika mereka menaiki perahu mereka berdua menemukan kapal kecil yang mengantarkan penduduk yang berada di tepi pantai ini menuju ke tepi pantai lainnya, dan rupanya mereka mengenali Khidir maka mereka berkata: “Hamba Allah yang shaleh”. Ya'la berkata: Kami bertanya kepada Sa'id; “Khidir?” ia menjawab: “Ya”. Maka mereka berkata kami membawanya dengan tidak mengambil upah. Tetapi Khidir membakarnya dan melubanginya, maka Musa bertanya kepadanya; “kepana kamu membakarnya untuk menenggelamkan penumpangnya. Sungguh kamu telah melakukan sesuatu yang sangat berbahaya.” Mujahid menerangkan; Mungkar. Allah berfirman; “bukankah aku telah berkata kepadamu; bahwasanya kamu tidak akan mampu untuk bersabar bersamaku?” ini merupakan kejadian pertama tentang lupanya Musa terhadap perjanjian awwalnya, sedang yang pertengahan adalah syarat, sedang yang ketiga adalah kesengajaan. Allah berfirman; “Musa berkata; “ janganlah kamu menghukumku karena kelupaanku, dan janganlah kamu membebani aku dengan kesuslitan dalam urursanku.” Kemudian mereka berjumpa dengan seorang anak kecil, maka Khidir membunuhnya. Ya'la berkata; menurut fersi Sa'id, dengan redaksi; anak-anak kecil yang sedang bermain, kemudian Khidir mengambil seorang anak kecil yang kafir, kemudian dia membaringkannya dan menyembelihnya dengan pisau. Allah berfirman; “maka (Musa) berkata; apakah kamu membunuh jiwa yang suci (padahal dia) tidak (membunuh) jiwa.” Jiwa itu tidak melakukan perbuatan keji. [Ibnu Abbas] membacanya dengan lafazh; “Zakiyyatan” sedang dalam Mushhaf tertulis “Zaakiyatan” yang suci lagi muslim, sebagaimana perkataanmu; ghulaaman zakiyyan. Kemudian keduanya bergegas pergi, (di tengah perjalanan mereka) menemukan tembok yang hendak roboh, maka Khidir menegakkannya kembali. Menurut riwayat [Sa'id] dengan redaksi; dengan tangannya, seperti ini. Dia mengangkat tangannya dan meluruskannya. [Ya'la] berkata; aku mengira Sa'id berkata; maka dia mengusapnya dengan tangannya, sehingga menjadi tegak berdiri. Allah berfirman: “(musa berkata;) sekiranya kamu mau, maka kamu dapat menambil upah dari itu.” [Sa'id] menjelaskan; “upah yang dapat kita makan.” Allah berfirman; “dan di belakang mereka” dan di hadapan mereka. Sedang [Ibnu Abbas] membacanya dengan lafazh; amamahum malikun. Para perawi selain Sa'id menjelaskan, bahwa (raja tersebut) adalah Hudad bin Budad, sedang anak kecil yang di bunuh namanya Jaisur. Allah berfirman; “seorang raja yang merampas setiap perahu secara paksa.” Maka aku ingin jika perahu ini melewatinya, raja tersebut meninggalkannya karena terdapat cacat di perahu tersebut. Maka apabila mereka dapat melewatinya mereka dapat membenahinya dan dapat memanfa'atkannya kembali. Dan diantara mereka ada yang berkata; tutuplah denan botol, dan diantara mereka ada yang berkata; tutuplah dengan al Qaar. Allah berfirman; “dan kedua orang tuanya adalah mu`min” sedang anaknya kafir, Allah berfirman ”maka kami khawatir dia akan memaksa kedua orang tuanya untuk berbuat kesesatan dan kekafiran.” Kecintaan kepadanya akan mendorong keduanya untuk mengikuti anak tersebut dalam agamanya. Allah berfirman: “maka kami ingin Rabb orang tuanya menggantikan anak tersebut dengan yang lebih baik dan lebih suci” untuk jawaban pertanyaan Musa; “apakah kamu membunuh jiwa yang suci?” “dan lebih dalam kasih sayang” keduanya kepada anaknya lebih sayang dari keduanya terhadap yang pertama yang telah di bunuh oleh Khidir.” Sedang selain Sa'id mengira bahwa keduanya di berikan ganti dengan seorang anak perempuan. Sedangkan Daud bin Abi 'Ashim berkata; dari beberapa orang berpendapat bahwasa (penggantinya) adalah seorang anak perempuan",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 248
			}
		}
	]
}