{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4809,
			"arabicnumber": 4809,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Dluha] dari [Masruq] dia berkata; Ketika aku menemui [Abdullah bin Mas'ud], ia berkata; Barang siapa yang mengetahui sesuatu hendaklah ia mengatakan apa yang diketahuinya. Dan barang siapa yang tidak mengetahuinya maka hendaklah ia mengatakan Allah yang Maha Tahu. Karena termasuk dari ilmu ketika ia tidak mengetahuinya, ia mengatakan; 'Allah Maha tahu.' Allah Azza wa Jalla berfirman kepada Nabi shallallahu 'alaihi wasallam: Katakanlah (hai Muhammad): \"Aku tidak meminta upah sedikitpun padamu atas da'wahku dan bukanlah aku termasuk orang-orang yang mengada-adakan. (Shaad: 86). Dan Aku akan menyampaikan kepada kalian tentang Kabut, sesungguhnya Rasulullah shallallahu 'alaihi wasallam menyeru orang-orang Quraisy untuk memeluk Islam, namun menangguhkan untuk menerimanya. Maka Nabi shallallahu 'alaihi wasallam shallallahu 'alaihi wasallam berdo'a: Ya Allah, tolonglah aku menghadapi mereka dengan mengirimkan kepada mereka tujuh tahun kelaparan sebagaimana tujuh tahun Yusuf. Maka mereka diserang tahun kelaparan hingga mereka makan bangkai dan kulit. Seseorang dari mereka melihat ada kabut antara dia dengan langit kerena rasa laparnya. Allah Azza Wa Jalla berfirman: Maka tunggulah hari ketika langit membawa kabut yang nyata yang meliputi manusia. Inilah azab yang pedih. (Ad Dukhan: 10-11). Abdullah berkata; maka mereka pun berdo'a: \"Ya Tuhan kami, lenyapkanlah dari kami azab itu. Sesungguhnya kami akan beriman.\" Bagaimanakah mereka dapat menerima peringatan, padahal telah datang kepada mereka seorang rasul yang memberi penjelasan, kemudian mereka berpaling daripadanya dan berkata: \"Dia adalah seorang yang menerima ajaran (dari orang lain) lagi pula seorang yang gila Sesungguhnya (kalau) Kami akan melenyapkan siksaan itu agak sedikit sesungguhnya kamu akan kembali (ingkar). (Ad Dukhan: 12-15). Apakah Adzab mereka akan dihentikan pada hari kiamat. Ibnu Mas'ud berkata; Maka adzab dihentikan, tetapi mereka kembali kepada kekufuran. Hingga Allah pun menghancurkan mereka pada perang Badar sebagaimana firman-Nya: \"(Ingatlah) hari (ketika) Kami menghantam mereka dengan hantaman yang keras. Sesungguhnya Kami adalah Pemberi balasan.\" (Ad Dukhan: 16)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 331
			}
		}
	]
}