{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4921,
			"arabicnumber": 4921,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] Telah menceritakan kepada kami [Abu Awanah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah keluar bersama sekelompok orang dari sahabatnya menuju Pasar 'Ukazh. Sedangkan para setan telah dihalangi untuk mencuri berita langit. Bahkan, mereka dilempari dengan bintang (meteor) dan mereka pun kembali. Maka mereka (sahabat setan) pun bertanya, \"Ada apa dengan kalian?\" Mereka menjawab, \"Kami telah dihalangi untuk mencuri berita langit. Dan kami juga dilempari dengan bintang (meteor).\" Mereka berkata, \"Tidaklah kalian dihalangi untuk mencuri berita langit kecuali karena suatu kejadian. Karena itu, cermatilah ke seluruh penjuru bumi dari barat dan timur, lihatlah peristiwa apa yang sebenarnya telah terjadi.\" Akhirnya mereka pun pergi menelusuri penjuru bumi, barat dan timur guna melihat peristiwa apa yang telah terjadi sehingga menghalangi antara mereka dan berita langit. Mereka berjalan ke arah Tihamah menuju Rasulullah shallallahu 'alaihi wasallam yang sedang berada pada sebatang pohon kurma hendak menuju ke pasar 'Ukazh. Saat itu, beliau sedang shalat Fajar (Shalat subuh) bersama para sahabatnya. Maka ketika para setan mendengar Al Qur`an, mereka pun menyimaknya dan berkata, \"Inilah yang menghalangi antara kalian dan berita langit.\" Akhirnya mereka kembali kepada kaumnya dan berkata, \"Wahai kamu kami (Sesungguhnya kami telah mendengar Al Qur'an yang begitu menakjubkan, yang memberi petunjuk kepada jalan yang benar, hingga kami pun beriman kepadanya dan kami tidak akan menyekutukan Rabb kami dengan sesuatu apa pun).\" (QS. Aljin 1-2). Dan Allah 'azza wajalla pun menurunkan wahyu kepada Nabi-Nya shallallahu 'alaihi wasallam, \"Katakanlah: 'Telah diwahyukan kepadaku, bahwasanya sekelompok jin telah mendengarkan (Al Qur`an).'\" (QS. Aljin 1). Yang diwahyukan kepada beliau adalah perkataan Jin",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 441
			}
		}
	]
}