{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4970,
			"arabicnumber": 4970,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] Telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata; Suatu ketika Umar mengajakku masuk berkumpul bersama para syaikh pemuka-pemuka Badar, dan sepertinya, sebagian dari mereka memendam sesuatu pada dirinya. Maka salah seorang dari mereka pun bertanya, \"Kenapa Anda mengikutsertakan anak ini bersama kami, padahal kami juga memiliki anak-anak yang sebaya dengannya?\" Maka Umar pun berkata, \"Sesungguhnya anak itu mempunyai kecerdasan tersendiri seperti yang telah kalian kenal.\" Kemudian pada suatu hari, Umar memangilnya dan mengingutsertakannya bersama mereka. Ibnu Abbas berkata; Aku tahu, bahwa tidak ada maksud lain Umar memanggilku, kecuali untuk memperlihatkan aku pada mereka. Umar berkata, \"Bagaimanakah pendapat kalian berkenaan dengan ayat ini: 'IDZAA JAA`A NASHRULLAHI WAL FATH.'\" Maka sebagian dari mereka berkata, \"Kita diperintahkan untuk memuji Allah dan meminta maghfirah-Nya, yakni ketika kita diberi pertolongan dan kekuatan untuk menaklukkan suatu negeri.\" Lalu sebagian yang lain diam tak berkata sepatah kata pun. Setelah itu, Umar bertanya padaku, \"Apakah seperti itu juga pendapatmu wahai Ibnu Abbas?\" Aku menjawab, \"Tidak.\" Umar bertanya lagi, \"Lalu bagaimanakah pendapatmu?\" Aku menjawab, \"Hal itu terkait dengan ajal Rasulullah shallallahu 'alaihi wasallam, Allah telah memberitahukan padanya. Firman Allah: 'IDZAA JAA`A NASHRULLAHI WAL FATH.' Itu adalah alamat akan ajalmu. 'FASABBIH BIHAMDI RABBIKA WAS TAGHFIRHU INNAHU KAANA TAWWAABAA (Karena itu, sucikanlah Rabbu dengan memuji-Nya. Dan mintalah ampunan dari-Nya, sesungguhnya Dia Maha Menerima taubat).'\" Umar berkata, \"Tidak ada jawaban yang lebih tepat, kecuali apa yang telah kamu katakan",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 492
			}
		}
	]
}