{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4987,
			"arabicnumber": 4987,
			"text": "Telah menceritakan kepada kami [Musa] Telah menceritakan kepada kami [Ibrahim] Telah menceritakan kepada kami [Ibnu Syihab] bahwasanya [Anas bin Malik] telah menceritakan kepadanya, bahwasanya; Hudzaifah bin Al Yamani datang kepada Utsman setelah sebelumnya memerangi Ahlus Syam yakni pada saat penaklukan Armenia dan Azerbaijan bersama penduduk Irak. Dan ternyata perselisihan mereka dalam Qira`ah mengejutkan Hudzaifah. Maka Hudzaifah pun berkata kepada Utsman, \"Rangkullah ummat ini sebelum mereka berselisih tentang Al Qur`an sebagaimana perselisihan yang telah terjadi pada kaum Yahudi dan Nasrani.\" Akhirnya, Utsman mengirim surat kepada Hafshah yang berisikan, \"Tolong, kirimkanlah lembaran alquran kepada kami, agar kami dapat segera menyalinnya ke dalam lembaran yang lain, lalu kami akan segera mengembalikannya pada Anda.\" Maka Hafshah pun mengirimkannya kepada Utsman. Lalu Utsman memerintahkan kepada Zaid bin Tsabit, Abdullah bin Zubair, Sa'id bin Al Ash dan Abdurrahman bin Al Harits bin Hisyam, sehingga mereka pun menyalinnya ke dalam lembaran shuhuf yang lain. Utsman berkata kepada tiga orang Quraisy dari mereka, \"Jika kalian berselisih dengan Zaid bin Tsabit terkait dengan Al Qur`an, maka tulislah dengan bahasa Quraisy, sebab Al Qur`an turun dengan bahasa mereka.\" Kemudian mereka mengindahkan perintah itu hingga penyalinan selesai dan Utsman pun mengembalikannya ke Hafshah. Setelah itu, Utsman mengirimkan sejumlah Shuhuf yang telah disalin ke berbagai penjuru negeri kaum muslimin, dan memerintahkan untuk membakar Al Qur`an yang terdapat pada selain Shuhuf tersebut. Ibnu Syihab berkata; [Kharijah bin Zaid] telah mengabarkan kepadaku bahwa ia mendengar [Zaid bin Tsabit] berkata, \"Kami kehilangan satu ayat dari surat Al Ahzab saat kami menyalinnya, yang sungguh aku telah mendengarnya langsung dari Rasulullah shallallahu 'alaihi wasallam saat beliau membacanya. Lalu kami pun mencarinya, dan ternyata kami menemukannya pada Khuzaimah bin Tsabit Al Anshari. Yakni ayat, \"MINAL MUKMINIINA RIJAALUN SHADAQUU MAA 'AAHADUU ALLAAHA 'ALAIHI.\" Maka kami pun menggabungkannya di dalam mushhaf",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 9
			}
		}
	]
}