{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5030,
			"arabicnumber": 5030,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Ya'qub bin Abdurrahman] dari [Abu Hazim] dari [Sahl bin Sa'd] bahwasanya, ada seorang wanita mendatangi Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, aku datang untuk menyerahkan diriku padamu.\" Lalu Rasulullah shallallahu 'alaihi wasallam pun memandangi wanita dari atas hingga ke bawah lalu beliau menunduk. Dan ketika wanita itu melihat, bahwa beliau belum memberikan keputusan akan dirinya, ia pun duduk. Tiba-tiba seorang laki-laki dari sahabat beliau berdiri dan berkata, \"Wahai Rasulullah, jika Anda tidak berhasrat dengannya, maka nikahkanlah aku dengannya.\" Lalu beliau pun bertanya: \"Apakah kamu punya sesuatu (untuk dijadikan sebagai mahar)?\" Laki-laki itu menjawab, \"Tidak, demi Allah wahai Rasulullah.\" Kemudian beliau bersabda: \"Kembalilah kepada keluargamu dan lihatlah apakah ada sesuatu?\" Laki-laki itu pun pergi dan kembali lagi seraya bersabda: \"Tidak, demi Allah wahai Rasulullah, aku tidak mendapatkan apa-apa?\" beliau bersabda: \"Lihatlah kembali, meskipun yang ada hanyalah cincin besi.\" Laki-laki itu pergi lagi, kemudian kembali dan berkata, \"Tidak, demi Allah wahai Rasulullah, meskipun cincin emas aku tak punya, tetapi yang ada hanyalah kainku ini.\" Sahl berkata, \"Tidaklah kain yang ia punyai itu kecuali hanya setengahnya.\" Maka Rasulullah shallallahu 'alaihi wasallam pun bertanya: \"Apa yang dapat kamu lakukan dengan kainmu itu? Bila kamu mengenakannya, maka ia tidak akan memperoleh apa-apa dan bila ia memakainya, maka kamu juga tak memperoleh apa-apa.\" Lalu laki-laki itu pun duduk agak lama dan kemudian beranjak. Rasulullah shallallahu 'alaihi wasallam melihatnya dan beliau pun langsung menyuruh seseorang untuk memanggilkannya. Ia pun dipanggil, dan ketika datang, beliau bertanya, \"Apakah kamu punya hafalan Al Qur`an?\" laki-laki itu menjawab, \"Ya, aku hafal surat ini dan ini.\" Ia sambil menghitungnya. Beliau bertanya lagi, \"Apakah kami benar-benar menghafalnya?\" ia menjawab, \"Ya.\" Akhirnya beliau bersabda: \"Kalau begitu, perigilah. Sesungguhnya kau telah kunikahkan dengannya dengan mahar apa yang telah kamu hafal dari Al Qur`an",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 52
			}
		}
	]
}