{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5126,
			"arabicnumber": 5126,
			"text": "Telah menceritakan kepada kami [Qutaibah] Telah menceritakan kepada kami [Ya'qub] dari [Abu Hazim] dari [Sahl bin Sa'd] bahwa ada seorang wanita datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, aku datang untuk menghibahkan diriku untuk Anda.\" Maka Rasulullah shallallahu 'alaihi wasallam mengamati wanita dengan cermat dan setelah itu beliau menundukkan kepala. Ketika wanita itu melihat, bahwa beliau belum memberikan putusan apa-apa terhadapnya, ia pun duduk. Tiba-tiba berdirilah seorang laki-laki dari sahabat beliau dan berkata, \"Wahai Rasulullah, bila Anda tak berhasrat pada wanita itu, maka nikahkanlah aku dengannya.\" Beliau bertanya: \"Apakah kamu punya sesuatu (sebagai mahar)?\" ia menjawab, \"Tidak, demi Allah wahai Rasulullah.\" Beliau bersabda: \"Kalau begitu, pergilah kepada keluargamu, dan lihatlah apakah ada sesuatu yang kamu dapatkan.\" Laki-laki itu pun pergi, lalu kembali dan berkata, \"Tidak, demi Allah wahai Rasulullah, aku tidak mendapatkan sesuatu.\" Beliau bersabda: \"Lihatlah meskipun itu hanya cincin dari besi.\" Laki-laki itu pergi lagi, lalu kembali dan berkata, \"Tidak ada, demi Allah wahai Rasulullah, meskipun hanya cincin besi. Tetapi, ini adalah kainku.\" Sahl berkata; Ia tidaklah memiliki baju, maka calon isterinya berilah setengah sarungnya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang bisa kamu lakukan jika kau gunakan setengah sarungmu. Bila kamu memakainya, maka separoh badanmu tak tertutup kain, dan bila calon isterimu memakainya, separoh badannya pun tak tertutup kain.\" Akhirnya laki-laki itu pun duduk hingga lama, lalu ia beranjak hendak pergi. Kemudian Rasulullah shallallahu 'alaihi wasallam melihatnya, beliau pun memeritahkan agar orang itu dipanggil. Dan ketika laki-laki itu datang beliau bertanya: \"Apa yang kamu hafal dari Al Qur`an?\" laki-laki itu menjawab, \"Aku menghafal surat ini dan ini.\" Ia menghitungnya. Kemudian beliau bersabda: \"Bacalah dari hafalanmu itu untuknya.\" Ia menjawab, \"Baik.\" Beliau bersabda: \"Pergilah, sesungguhnya aku telah menikahkanmu dengan wanita itu dan hafalan Al Qur`anmu sebagai mahar",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 62
			}
		}
	]
}