{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5189,
			"arabicnumber": 5189,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Abdurrahman] dan [Ali bin Hujr] keduanya berkata, Telah mengabarkan kepada kami [Isa bin Yunus] Telah menceritakan kepada kami [Hisyam bin Urwah] dari [Abdullah bin Urwah] dari [Urwah] dari [Aisyah] ia berkata; Sebelas wanita duduk-duduk kemudian berjanji sesama mereka untuk tidak mnyembunyikan sedikitpun seluk-beluk suami mereka. Wanita pertama berkata, \"Suamiku adalah daging unta yang kurus, berada di puncak gunung yang sulit, tidak mudah didaki, dan tidak gemuk sehingga mudah diangkat.\" Wanita kedua berkata, \"Suamiku? Aku tidak akan menyebarkan seluk-beluk tentang dirinya. Aku takut tidak bisa meninggalkannya jika aku menyebutnya, aku menyebutkan kebaikan dan keburukannya sekaligus.\" Wanita ketiga berkata, \"Suamiku jangkung. Jika aku berkata, ia menceraikanku. Jika aku diam, ia menggantungkan (urusanku).\" Wanita keempat berkata, \"Suamiku sedang, seperti cuaca Gunung Tihamah. Ia tidak panas, dingin, menakutkan, dan membosankan.\" Wanita kelima berucap, \"Suamiku? Jika ia masuk, ia seperti anak singa. Jika ia keluar, ia seperti singa. Ia tidak pernah bertanya apa yang ia ketahui.\" Wanita keenam mengemukakan, \"Suamiku? Jika makan, ia mencampur semua jenis makanan. Jika minum, ia menghabiskan seluruh air. Jika tidur, ia berselimut. Ia tidak memasukkan telapak tangan untuk mengetahui kesedihan (tidak penyayang kepadanya).\" Wanita ketujuh berkata, \"Suamiku tidak tahu kemaslahatan dirinya dan bodoh. Baginya, semua penyakit adalah obat. Ia membelah kepalamu atau memecahkanmu, atau melakukan kedua-duanya terhadapmu.\" Wanita kedelapan berkata, \"Suamiku halus sehalus kelinci dan harum seharum zarrab (tanaman yang harum).\" Wanita kesembilan mengatakan, \"Suamiku tinggi tiangnya, panjang bantuannya, besar asapnya, dan rumahnya dengan api.\" Wanita kesepuluh mengemukakan, \"Suamiku adalah majikan dan tidak ada majikan sebaik dia. Ia mempunyai unta yang banyak sekali dan dekat pengembalaannya. Jika unta-unta tersebut mendengar suara rebana sebagai tanda kedatangan tamu, unta-unta tersebut merasa yakin bahwa mereka akan disembelih.\" Wanita kesebelas berkata, \"Suamiku adalah Abu Zar'in. Tahukah kamu siapakah Abu Zar'in? Ia menggerak-gerakkan perhiasan kedua telingaku, memenuhi lemak kedua lenganku, dan membahagiakanku hingga jiwaku berbahagia. Ia mendapatiku di tempat pemilik kambing kecil di gunung kemudian membawaku ke pemilik kuda yang banyak, unta yang banyak, penggiling makanan, dan pengusir burung. Di tempatnya, aku berkata dan tidak menjelek-jelekkan, tidur hingga pagi, dan minum hingga puas. Ibu Abu Zar'in. siapakah ibu Abu Zar'in? Tempat makanannya besar dan rumahnya luas. Anak laki-laki Abu Zar'in. Siapakah anak laki-laki Abu Zar'in? Tempat tidurnya seperti pedang yang diambil dari sarungnya (ringan) dan ia dibuat kenyang dengan lengan kambing yang berusia empat bulan. Anak perempuan Abu Zar'in. Siapakah anak perempuan Abu Zar'in? Ia patuh kepada ayah ibunya dan membuat marah tetanggganya. Budak wanita Abu Zar'in. Siapakah budak wanita Abu Zar'in? Ia tidak merusak pembicaraan kami, tidak memindahkan warisan kami, dan tidak memenuhi rumah kami dengan kotoran seperti rumput. Abu Zar'in keluar sedang tempat-tempat susu digerak-gerakkan dengan keras, kemudian ia bertemu dengan seorang wanita bersama dua anaknya seperti anak singa yang sedang bermain di bawah pinggangnya dengan dua buah delima, kemudian Abu Zar'in menceraikanku dan menikahi wanita tersebut. Sesudahnya aku menikah dengan seorang laki-laki yang mulia, mengendarai dengan cepat, mengambil tombak, mengembalikan hewan ternak kepadaku, dan memberiku bau harum semuanya sepasang. Ia berkata, 'Makanlah hai Ummu Zar'in dan berilah makan keluargamu.' Jika aku kumpulkan semua yang diberikan suami keduaku tersebut, tidak mencapai bejana terkecil Abu Zar'in. Aisyah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Terhadapmu aku seperti Abu Zar'in terhadap Ummu Zar'in.\" berkata Abu Abdullah; berkata [Sa'id bin Salamah] dari [Hisyam] dan janganlah engkau penuhi rumah kami dengan sisa-sisa rumah (sampah). Abu Abdullah mengatakan, sebagian mengatakan \"Maka aku minum hingga puas.\". Dan ini lebih sahih",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 123
			}
		}
	]
}