{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5191,
			"arabicnumber": 5191,
			"text": "Telah menceritakan kepada kami [Abu Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] ia berkata; Telah mengabarkan kepadaku [Ubaidullah bin Abdullah bin Abu Tsaur] dari [Abdullah bin Abbas] radliallahu 'anhuma, ia berkata; Aku selalu bersikeras untuk menanyakan kepada Umar bin Al Khaththab tentang dua orang wanita dari isteri-isteri Nabi shallallahu 'alaihi wasallam, yang Allah berfirman terhadap mereka berdua: \"IN TATUUBAA ILALLAHI FAQAD SHAGHAT QULUUBUKUMAA.\" Hingga suatu saat, ia menunaikan haji dan aku pun ikut menunaikan haji bersamanya. Dalam perjalanan ia menyingkir hendak buang hajat, lalu aku mengikutinya dengan membawakan kantong air. Ia pun buang air besar, dan ia kembali aku pun menuangkan air pada kedua tangannya, lalu ia pun berwudlu. Saat itulah aku bertanya, \"Wahai Amirul Mukminin, siapakah dua orang wanita dari isteri-isteri Nabi shallallahu 'alaihi wasallam yang Allah Ta'ala berfirman kepada keduanya, 'IN TATUUBAA ILALLAHI FAQAD SHAGHAT QULUUBUKUMAA (Jika kamu berdua bertaubat kepada Allah, Maka Sesungguhnya hati kamu berdua Telah condong (untuk menerima kebaikan..).'\" [Umar] pun menjawab, \"Sungguhnya mengherankan kamu ini wahai Ibnu Abbas. Kedua wanita itu adalah Aisyah dan Hafshah.\" Kemudian Umar menceritakan haditsnya dengan lebih luas, ia berkata; Dulu, aku mempunyai seorang tetangga dari kalangan Anshar di Bani Umayyah bin Zaid yang mereka adalah para penduduk Manidah yang fakir. Kami saling bergantian untuk menghadiri majelis Nabi shallallahu 'alaihi wasallam. Aku hadir sehari dan ia pun hadir sehari. Bila aku yang hadir, maka aku akan menyampaikan hal-hal yang disampaikan oleh beliau berupa wahyu atau yang lainnya di hari itu. Dan jika gilirannya yang hadir, ia pun melakukan hal yang sama. Kami adalah bangsa Quraisy yang posisinya selalu di atas kaum wanita. Dan setelah kami bertemu dengan kaum Anshar, ternyata mereka adalah kaum yang banya dipengaruhi oleh kaum wanitanya. Maka para isteri-isteri kami pun mulai meniru dan mengambil adab dan kebiasaan wanita-wanita Anshar. Kemudian aku mengajak isteriku berdiskusi, lalu ia pun mendebat argumentasiku. Aku mengingkari akan perlakuannya itu, ia pun berkata, \"Kenapa kamu tidak mengajakku berdiskusi? Demi Allah, sesungguhnya para isteri-isteri Nabi shallallahu 'alaihi wasallam mengajak beliau berdiskusi. Bahkan pada hari ini hingga malam nanti, salah seorang dari mereka mendiamkan beliau.\" Aku pun kaget akan hal itu. Kukatakan padanya, \"Sesungguhnya telah merugilah bagi siapa di antara mereka yang melalukan hal itu.\" Setelah itu, aku bergegas memberesi pakaianku lalu menemui Hafshah. Kukatakan padanya, \"Wahai Hafshah, apakah salah seorang dari kalian telah menyebabkan Nabi shallallahu 'alaihi wasallam marah di hari ini hingga malam?\" Ia menjawab, \"Ya.\" Aku berkata, \"Sesungguh, kamu telah merugi. Apakah engkau merasa sekiranya Allah menjadi marah lantaran marahnya Rasulullah shallallahu 'alaihi wasallam lalu kamu akan binasa? Janganlah kamu menuntut banyak kepada Nabi shallallahu 'alaihi wasallam dan jangan pula kamu membantahnya dalam sesuatu apa pun. Dan janganlah kamu mendiamkannya. Pintalah padaku apa yang kamu mau. Janganlah kamu merasa cemburu terhadap madumu yang lebih dicintai oleh Nabi shallallahu 'alaihi wasallam -maksudnya adalah Aisyah-.\" Umar berkata; Sebelumnya, kami telah saling berbincang bahwa Ghassan tengah mempersiapkan pasukan berkuda untuk memerangi kami. Pada hari gilirannya hadir, sahabatku yang Anshari menghadiri majelis lalu kembali menemuiku setelah sahalat Isya'. Ia mengetuk pintu rumahku dengan sangat keras seraya berkata, \"Cepatlah buka!\" maka aku pun segera keluar menemuinya. Ia berata, \"Sesungguhnya pada hari ini telah terjadi perkara yang besar.\" Aku bertanya, \"Peristiwa apa itu? Apakah Ghassan telah datang?\" Ia menjawab, \"Tidak, bahkan yang lebih besar dari itu. Nabi shallallahu 'alaihi wasallam telah menceraikan isteri-isterinya.\" [Ubaid bin Hunain] berkata; Ia mendengar [Ibnu Abbas], dari [Umar], ia berkata; Nabi shallallahu 'alaihi wasallam meninggalkan isteri-isterinya, maka aku pun berakata, \"Sungguh, Hafshah telah merugi.\" Aku telah menduga hal ini akan terjadi. Aku pun segera mengemasi pakaianku, lalu shalat Fajar bersama Nabi shallallahu 'alaihi wasallam. Setelah itu, Nabi shallallahu 'alaihi wasallam memasuki tempat minumnya dan berdiam diri situ. Kemudian aku masuk menemui Hafshah, ternyata ia sedang menangis. Aku berkata padanya, \"Apa yang menyebabkanmu menangis. Bukankah aku telah mengingatkanmu akan hal ini? Apakah Nabi shallallahu 'alaihi wasallam telah menceraikan kalian?\" Ia menjawab, \"Aku tidak tahu, itu beliau sedang minggat di tempat minum.\" Maka aku pun segera keluar dan mendatangi mimbar, ternyata di sekeliling itu ada beberapa orang yang sebagian dari mereka juga sedang menangis, lalu aku pun duduk bersama mereka sebentar kemudian aku tak kuasa lagi akan suasana itu. Maka aku datang ke tempat minum yang dipergunakan Nabi shallallahu 'alaihi wasallam untuk berdiam. Aku pun berkata kepada budaknya yang hitam, \"Mintakanlah izin untuk Umar.\" Lalu sang budak pun masuk dan berbicara kepada Nabi shallallahu 'alaihi wasallam kemudian kembali dan berkata, \"Aku telah berbica dengan Nabi shallallahu 'alaihi wasallam dan juga telah menyebutmu, namun beliau diam.\" Akhirnya aku pun kembali dan duduk lagi bersama sekelompok orang yang tadi berada di sekitar mimbar. Setelah itu, aku tak sabaran lagi, maka aku mendatangi sang budak itu lagi dan berkata padanya, \"Mintakanlah izin untuk Umar.\" Ia pun masuk lalu kembali seraya berkata, \"Aku telah menyebutmu, namun beliau tetap diam.\" Aku kembali lagi dan duduk bersama beberapa orang yang ada di mimbar. Namun, aku tak sabaran lagi dan mendatangi sang budak itu lalu berkata, \"Mintakanlah ini untuk Umar.\" Ia pun masuk dan kembali seraya berkata, \"Sungguh, aku telah menyebut namamu, namun beliau tetap diam.\" Maka ketika aku berpaling hendak pergi, tiba-tiba sang budak itu memanggilku seraya berkata, \"Sesungguhnya Nabi shallallahu 'alaihi wasallam telah mengizinkanmu.\" Akhirnya aku pun menemui Rasulullah shallallahu 'alaihi wasallam yang sedang berbaring di atas pasir beralaskan tikar tanpa kasur. Pasir-pasir itu telah berbekas pada sisi badan beliau. beliau berbantalkan kulit yang berisikan sabut. Aku mengucapkan salam atasnya dan berkata sambil berdiri, \"Wahai Rasulullah, apakah Anda telah menceraikan isteri-isteri Anda?\" Maka beliau pun mengangkat pandangannya ke arahku dan menjawab: \"Tidak.\" Maka aku pun berkata, \"Allahu Akbar.\" Kukatakan lagi sambil berdiri, \"Aku mendengar wahai Rasulullah, sekiranya Anda melihatku. Kita adalah bangsa Quraisy yang selalu mengatur wanita. Namun, ketika kita mendatangi Madinah, ternyata mereka adalah kaum yang didominasi oleh kaum wanita.\" Kemudian Nabi shallallahu 'alaihi wasallam tersenyum. Lalu aku berkata lagi, \"Wahai Rasulullah, sekiranya Anda mau melihatku. Aku telah menemui Hafshah dan berkata padanya, 'Janganlah sekali-kali kamu merasa cemburu bilamana tetanggamu lebih dicintai oleh Nabi shallallahu 'alaihi wasallam -maksudnya adalah Aisyah-.'\" Kemudian Nabi shallallahu 'alaihi wasallam tersenyum lagi. Maka ketika itu, aku pun duduk dan mengangkat pandanganku ke arah rumahnya. Maka demi Allah, aku tidak melihat sedikit pun di rumah beliau kecuali tiga kulit yang telah disamak. Aku berkata pada beliau, \"Wahai Rasulullah, berdo'alah kepada Allah untuk ummat Anda. Karena orang-orang Persi dan Romawi telah diberi keleluasaan, dan mereka juga telah diberi dunia, padahal mereka tidak menyembah Allah.\" Akhirnya Nabi shallallahu 'alaihi wasallam duduk yang sebelumnya berbaring. Kemudian beliau bersabda: \"Beginikah sikapmu wahai Ibnul Khaththab? Sesungguhnya mereka itu adalah suatu kaum yang kebaikan mereka disegerakan di dunia.\" Aku pun berkata, \"Mintakanlah ampun untukku.\" Jadi, Nabi shallallahu 'alaihi wasallam meninggalkan isteri-isterinya karena perkara itu. Yakni, ketika Hafshah menyebarkannya pada Aisyah, yaitu selama dua puluh sembilan hari. Saat itu, beliau bersabda: \"Aku tidak akan masuk menemui mereka selama satu bulan.\" Demikian itu, karena kerasnya rasa kesal beliau pada mereka, yakni saat Allah menegur dirinya. Dan ketika telah berlalu dua puluh sembilan hari, beliau menemui Aisyah dan beliau memulai darinya. Maka Aisyah pun berkata pada beliau, \"Wahai Rasulullah, sesungguhnya Anda telah bersumpah untuk tidak menemui kami selama satu bulan penuh. Sedangkan hari ini Anda baru memasuki hari yang kedua puluh sembilan, sebagaimana yang aku hitung.\" Kemudian beliau pun bersabda; \"Sesungguhnya hitungan bulan itu adalah dua puluh sembilan hari.\" Dan memang jumlah hari pada bulan itu adalah dua puluh sembilan malam. Aisyah berkata; Kemudian Allah Ta'ala menurunkan ayat At Takhyir (ayat yang berisi pilihan untuk tetap menjadi isteri nabi atau tidak). Beliau memulai dariku, wanita yang pertama dari isteri-isterinya. Dan aku pun lebih memilih beliau. setelah itu, beliau memberi pilihan kepada para isterinya semuanya, dan mereka pun menjawab sebagaimana yang dikatakan Aisyah",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 125
			}
		}
	]
}