{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5381,
			"arabicnumber": 5381,
			"text": "Telah menceritakan kepada kami [Isma'il] ia berkata; Telah menceritakan kepadaku [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] bahwa ia mendengar [Anas bin Malik] berkata; Abu Thalah berkata kepada Ummu Sulaim, \"Aku mendengar suara Rasulullah shallallahu 'alaihi wasallam telah melemah, dan aku tahu bahwa beliau sedang lapar. Apakah kamu mempunyai sesuatu?\" Maka Ummu Sulaim pun mengeluarkan beberapa bulatan gandum, dan mengeluarkan tudungnya lalu menutup roti itu dan meletakkannya di balik pakaianku. Ia juga memberikan sebagiannya padaku lalu mengutusku untuk menemui Rasulullah shallallahu 'alaihi wasallam. Aku pun membawa dan aku dapati Rasulullah shallallahu 'alaihi wasallam sedang berada di dalam masjid yang sedang bersama orang-orang. Aku berdiri di tengah-tengah mereka, maka Rasulullah shallallahu 'alaihi wasallam bertanya padaku: \"Apakah kamu diutus oleh Abu Thalhah?\" Aku menjawab, \"Ya.\" Beliau bertanya lagi: \"Dengan membawa makanan?\" Aku berkata, \"Ya.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam bersabda kepada orang-orang yang saat itu sedang bersamanya: \"Beranjaklah.\" Maka mereka pun segera beranjak pergi (ke tempat Abu Thalhah) dan aku segera bergegas ke hadapan mereka, hingga aku sampai di tempat Abu Thalhah. Maka Abu Thalhah pun berkata, \"Wahai Ummu Sulaim. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah datang bersama orang-orang sementara kita tidak memiliki persediaan makanan untuk menjamu mereka.\" Ummu Sulaim berkata, \"Allah dan Rasul-Nya yang lebih mengetahui.\" Akhirnya Abu Thalhah pergi hingga bertemu dengan Rasulullah shallallahu 'alaihi wasallam. Maka Abu Thalhah menyambut Rasulullah shallallahu 'alaihi wasallam hingga keduanya masuk. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Ummu Sulaim, keluarkanlah makanan yang kamu punyai.\" Maka Ummu Sulaim pun mengeluarkan roti itu. Lalu Nabi shallallahu 'alaihi wasallam menyuruh untuk diremukkan sementara Ummu Sulaim meremas-remas samin untuk lauk roti. Kemudian Rasulullah Shallallah membacakan sesutu padanya sekehendak Allah. Sesudah itu beliau bersabda: \"Izinkanlah untuk sepuluh orang.\" Lalu ia pun mengizinkan mereka dan mereka pun makan hingga kenyang dan keluar. Beliau bersabda lagi: \"Izinkan untuk sepuluh orang lagi.\" Ia pun mengizinkan mereka hingga mereka makan sampai kenyang dan keluar. Beliau bersabda lagi: \"Izinkan untuk sepuluh orang lagi.\" Ia pun mengizinkan mereka hingga mereka semua makan sampai kenyang lalu keluar. Setelah itu, beliau mengizinkan lagi untuk sepuluh orang. Akhirnya mereka semua makan dan kenyang. Padahal jumlah mereka adalah delapan puluh orang",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 9
			}
		}
	]
}