{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5443,
			"arabicnumber": 5443,
			"text": "Telah menceritakan kepada kami [Sa'id bin Abu Maryam] berkata, telah menceritakan kepada kami [Abu Ghassan] ia berkata; telah menceritakan kepadaku [Abu Hazim] dari [Ibrahim bin 'Abdurrahman bin Abdullah bin Abu Rabi'ah] dari [Jabir bin Abdullah] radliallahu 'anhuma, ia berkata, \"Di Madinah ada seorang Yahudi yang meminjamiku setandan kurma-dan Jabir sendiri memiliki kebun yang ada di jalan menuju Ruumah (nama tempat), namun tidak berbuah selama setahun-, orang Yahudi itu kemudian datang kepadaku meminta pembayaran kurma, namun aku tidak mendapatkannya. Maka aku minta tenggang waktu hingga tahun mendatang tetapi ia menolak. Maka aku mengabarkan hal itu kepada Nabi shallallahu 'alaihi wasallam, beliau lalu bersabda kepada para sahabatnya: \"Berjalanlah. Kita minta penangguhan kepada Yahudi itu untuk Jabir.\" Mereka kemudian mendatangiku di kebun milikku, beliau lalu berbicara dengan Yahudi tersebut hingga Yahudi itu pun berkata, \"Wahai Abul Qasim, aku tidak akan memberinya tenggang waktu.\" Ketika Nabi shallallahu 'alaihi wasallam melihat hal itu, beliau lalu bangkit dan mengelilingi kebun kurma tersebut, kemudian beliau mendatangi Yahudi itu dan bernegosisasi, namun Yahudi itu tetap tidak mau (memberi penangguhan). Aku lalu berdiri dan membawakan sedikit kurma dan meletakkan di depan Nabi shallallahu 'alaihi wasallam, lalu beliau pun memakannya. Setelah itu beliau bersabda: \"Wahai Jabir, dimana tenda tempat kamu berteduh?\" Aku lalu mengabarkannya. Beliau berkata lagi: \"Siapkanlah untukku.\" Maka aku pun menyiapkan tenda tersebut untuk beliau, beliau kemudian masuk dan tidur. Setelah bangun, aku kembali menemui beliau dengan membawa segenggam kurma, beliau lalu memakannya. Kemudian beliau berdiri dan bernegoisasi dengan orang Yahudi tersebut namun ia tetap menolak. Kemudian beliau kembali mengelilingi kebun kurma tersebut dan berkata: \"Wahai Jabir, goyangkanlah (pohon kurma) dan gantilah untuknya.\" Aku lalu menghampiri batang kurma dan menggoyangnya dan mengambil sesuatu yang akan aku gunakan untuk menggantinya. Dan ternyata lebih, aku lalu keluar dan menemui Nabi shallallahu 'alaihi wasallam untuk mengabarkan kepadanya. Beliau lalu bersabda: \"Sesungguhnya aku bersaksi bahwa aku adalah utusan Allah. lafazh 'Urusy dan 'Arisy bisa berarti sebuah bangunan. Ibnu Abbas berkata mengenai firman Allah: MA'RUSYAAT, (Al An'am: 141): apa saja yang bisa menaungi dari pepohonan",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 72
			}
		}
	]
}