{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"72": "Hunting, Slaughtering"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5492,
			"arabicnumber": 5492,
			"text": "Telah menceritakan kepada kami [Yahya bin Sulaiman Al Ju'fi] berkata; telah menceritakan kepadaku [Ibnu Wahb] berkata, telah mengabarkan kepada kami [Amru] bahwa [Abu An Nadlr] menceritakan kepadanya dari [Nafi] mantan budak Abu Qatadah, dan [Abu Shalih] mantan budak At Tau`amah ia berkata, Aku mendengar [Abu Qatadah] berkata, \"Aku bersama Nabi shallallahu 'alaihi wasallam berada di suatu daerah antara Makkah dan Madinah, saat itu para sahabat sedang ihram. Sementara aku tidak melakukan ihram, dan sedang di atas kuda. Ketika aku sedang berada di atas gunung, aku melihat orang-orang berkerumun melihat sesuatu, kemudian aku pergi ke arah mereka dan ternyata yang mereka lihat itu adalah keledai liar. Aku lalu bertanya kepada mereka, \"Apa ini?\" Mereka menjawab, \"Kami tidak tahu.\" Aku pun berkata, \"Itu adalah keledai liar.\" Mereka lantas berkata, \"Ya itu adalah sebagaimana yang kamu lihat.\" Saat itu aku lupa dengan cambukku, maka aku pun berkata kepada mereka, \"Tolong ambilkan cambukku.\" Mereka menjawab, \"Kami tidak akan menolong kamu dalam masalah itu.\" Aku lalu turun dan mengambilnya sendiri, kemudian aku mengikuti jejak keledai liar tersebut hingga dapat menangkap dan menyembelihnya. Kemudian aku datang menemui mereka dan kukatakan, \"Bangun dan angkatlah.\" Mereka menjawab, \"Kami tidak akan menyentuhnya.\" Maka aku pun membawa ke hadapan mereka, lalu sebagian mereka ada yang makan dan sebagian lain tidak mau memakannya. Aku lalu berkata kepada mereka, \"Aku akan sampaikan kepada Nabi shallallahu 'alaihi wasallam akan keberatan kalian.\" Kemudian aku menyusul beliau dan menceritakan kejadian tersebut, beliau pun bersabda kepadaku: \"Apakah kalian masih mempunyai sisa dagingnya?\" Aku jawab, \"Ya.\" Beliau bersabda lagi: \"Itu adalah makanan yang Allah berikan kepada kalian",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 18
			}
		}
	]
}