{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"73": "Al-Adha Festival Sacrifice (Adaahi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5550,
			"arabicnumber": 5550,
			"text": "Telah menceritakan kepada kami [Muhammad bin Salam] telah menceritakan kepada kami [Abdul Wahab] telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Ibnu Abu Bakrah] dari [Abu Bakrah] radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya zaman itu terus berputar sama seperti saat Allah menciptakan langit dan bumi, setahun ada dua belas bulan, dan empat di antaranya adalah bulan-bulan haram, dan tiga di antaranya adalah bulan-bulan yang berurutan yaitu; Dzul Qa'dah, Dzul Hijjah, Muharram dan Rajab. Sedangkan bulan Rajab adalah bulan Mudzar yaitu bulan yang terletak antara Jumadil Akhir dan Sya'ban.\" (beliau bertanya): \"Bulan apakah sekarang ini?\" kami menjawab; \"Allah dan Rasul-Nya yang lebih mengetahui.\" Beliau terdiam beberapa saat, hingga kami menduga bahwa beliau akan menyebutnya dengan nama yang lain, lalu beliau bersabda: \"Bukankah sekarang bulan Dzul Hijjah?\" kami menjawab; \"Benar.\" Beliau bertanya lagi: \"Negeri apakah ini?\" kami menjawab; \"Allah dan Rasul-Nya yang lebih mengetahui.\" Beliau terdiam beberapa saat, hingga kami menduga beliau akan menyebutnya dengan nama yang lain, lalu beliau bersabda: \"Bukankah sekarang kita berada di negeri Baldah?\" kami menjawab; \"Benar.\" Beliau kembali bertanya: \"Hari apakah ini?\" kami menjawab; \"Allah dan Rasul-Nya yang lebih mengetahui.\" Beliau terdiam beberapa saat, hingga kami mengira beliau akan menyebutnya dengan nama yang lain. Kemudian beliau bersabda: \"Bukankah sekarang adalah hari Nahr (kurban)?\" kami menjawab; \"Benar.\" Beliau kemudian bersabda: \"Sesungguhnya darah kalian, harta bendamu -Muhammad berkata; saya kira beliau juga bersabda: dan kehormatan kalian- adalah haram atas diri kalian, seperti haramnya harimu sekarang ini, di negerimu ini, dan di bulan kalian ini. Sesungguhnya kalian pasti akan bertemu dengan Rabb kalian (di hari kiamat kelak), dan Dia akan menanyakan tentang semua amal perbuatan kalian. Oleh karena itu, sepeninggalku nanti, janganlah kalian kembali kepada kesesatan -dimana sebagian dari kalian membunuh sebagian yang lain-, hendaknya orang yang hadir pada saat ini menyampaikan kepada orang yang tidak hadir! bisa jadi orang yang mendengar dari mulut kedua justru lebih menjaga apa-apa yang di dengarnya daripada orang yang mendengarnya secara langsung.\" Sedangkan apabila Muhammad menyebutkan hadits tersebut, dia berkata; \"Nabi shallallahu 'alaihi wasallam benar.\" Setelah itu beliau bersabda: \"Bukankah aku telah menyampaikannya, bukankah aku telah menyampaikannya?! Hingga dua kali",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 6
			}
		}
	]
}