{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5729,
			"arabicnumber": 5729,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Ibnu Syihab] dari [Abdul Hamid bin Abdurrahman bin Zaid bin Al Khatthab] dari [Abdullah bin Abdullah bin Al Harits bin Naufal] dari [Abdullah bin Abbas] bahwa Umar bin Khatthab pernah bepergian menuju Syam, ketika ia sampai di daerah Sargha, dia bertemu dengan panglima pasukan yaitu Abu 'Ubaidah bersama sahabat-sahabatnya, mereka mengabarkan bahwa negeri Syam sedang terserang wabah. Ibnu Abbas berkata; \"Lalu Umar bin Khattab berkata; 'Panggilkan untukku orang-orang muhajirin yang pertama kali (hijrah), ' kemudian mereka dipanggil, lalu dia bermusyawarah dengan mereka dan memberitahukan bahwa negeri Syam sedang terserang wabah, merekapun berselisih pendapat. Sebagian dari mereka berkata; 'Engkau telah keluar untuk suatu keperluan, kami berpendapat bahwa engkau tidak perlu menarik diri.' Sebagian lain berkata; 'Engkau bersama sebagian manusia dan beberapa sahabat Rasulullah Shalla Allahu 'alaihi wa sallam. Kami berpendapat agar engkau tidak menghadapkan mereka dengan wabah ini, ' Umar berkata; 'Keluarlah kalian, ' dia berkata; 'Panggilkan untukku orang-orang Anshar'. Lalu mereka pun dipanggil, setelah itu dia bermusyawarah dengan mereka, sedangkan mereka sama seperti halnya orang-orang Muhajirin dan berbeda pendapat seperti halnya mereka berbeda pendapat. Umar berkata; 'keluarlah kalian, ' dia berkata; 'Panggilkan untukku siapa saja di sini yang dulu menjadi tokoh Quraisy dan telah berhijrah ketika Fathul Makkah.' Mereka pun dipanggil dan tidak ada yang berselisih dari mereka kecuali dua orang. Mereka berkata; 'Kami berpendapat agar engkau kembali membawa orang-orang dan tidak menghadapkan mereka kepada wabah ini.' Umar menyeru kepada manusia; 'Sesungguhnya aku akan bangun pagi di atas pelana (maksudnya hendak berangkat pulang di pagi hari), bagunlah kalian pagi hari, ' Abu Ubaidah bin Jarrah bertanya; 'Apakah engkau akan lari dari takdir Allah? ' maka Umar menjawab; 'Kalau saja yang berkata bukan kamu, wahai Abu 'Ubaidah! Ya, kami lari dari takdir Allah menuju takdir Allah yang lain. Bagaimana pendapatmu, jika kamu memiliki unta kemudian tiba di suatu lembah yang mempunyai dua daerah, yang satu subur dan yang lainnya kering, tahukah kamu jika kamu membawanya ke tempat yang subur, niscaya kamu telah membawanya dengan takdir Allah. Apabila kamu membawanya ke tempat yang kering, maka kamu membawanya dengan takdir Allah juga.' Ibnu Abbas berkata; \"Kemudian datanglah [Abdurrahman bin 'Auf], dia tidak ikut hadir (dalam musyawarah) karena ada keperluan. Dia berkata; \"Saya memiliki kabar tentang ini dari Rasulullah Shalla Allahu 'alaihi wa sallam beliau bersabda: \"Jika kalian mendengar suatu negeri terjangkit wabah, maka janganlah kalian menuju ke sana, namun jika dia menjangkiti suatu negeri dan kalian berada di dalamnya, maka janganlah kalian keluar dan lari darinya.\" Ibnu 'Abbas berkata; \"Lalu Umar memuji Allah kemudian pergi",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 44
			}
		}
	]
}