{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5749,
			"arabicnumber": 5749,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Abu Al Mutawakkil] dari [Abu Sa'id] bahwa beberapa orang dari sahabat Rasulullah shallallahu 'alaihi wasallam pergi dalam suatu perjalanan, ketika mereka singgah di suatu perkampungan dari perkampungan Arab, mereka meminta supaya diberi jamuan, namun penduduk perkampungan itu enggan untuk menjamu mereka, ternyata salah seorang dari tokoh mereka tersengat binatang berbisa, mereka sudah berusaha menerapinya namun tidak juga memberi manfa'at sama sekali, maka sebagian mereka mengatakan; \"Sekiranya kalian mendatangi sekelompok laki-laki (sahabat Nabi) yang singgah di tempat kalian, semoga saja salah seorang dari mereka ada yang memiliki sesuatu, lantas mereka mendatangi para sahabat Nabi sambil berkata; \"Wahai orang-orang, sesungguhnya pemimpin kami tersengat binatang berbisa, dan kami telah berusaha menerapinya dengan segala sesuatu namun tidak juga membuahkan hasil, apakah salah seorang dari kalian memiliki sesuatu (sebagai obat)?\" Salah seorang sahabat Nabi menjawab; \"Ya, demi Allah aku akan meruqyahnya (menjampinya), akan tetapi demi Allah, sungguh kami tadi meminta kalian supaya menjamu kami, namun kalian enggan menjamu kami, dan aku tidak akan meruqyah (menjampinya) sehingga kalian memberikan imbalan kepada kami.\" Lantas penduduk kampung itu menjamu mereka dengan menyediakan beberapa ekor kambing, lalu salah satu sahabat Nabi itu pergi dan membaca al hamdulillahi rabbil 'alamin (al fatihah) dan meludahkan kepadanya hingga seakan-akan pemimpin mereka terlepas dari tali yang membelenggunya dan terbebas dari penyakit yang dapat membinasakannya. Abu Sa'id berkata; \"Lantas penduduk kampung tersebut memberikan imbalan yang telah mereka persiapkan kepada sahabat Nabi, dan sahabat Nabi yang lain pun berkata; \"Bagilah.\" Namun sahabat yang meruqyah berkata; \"Jangan dulu sebelum kita menemui Rasulullah shallallahu 'alaihi wasallam dan memberitahukan apa yang terjadi dan kita akan melihat apa yang beliau perintahkan kepada kita.\" Setelah itu mereka menemui Rasulullah shallallahu 'alaihi wasallam dan memberitahukannya kepada beliau, beliau bersabda: \"Apakah kamu tidak tahu bahwa itu adalah ruqyah? Dan kalian telah mendapatkan imbalan darinya, maka bagilah dan berilah bagian untukku",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 64
			}
		}
	]
}