{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5843,
			"arabicnumber": 5843,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari ['Ubaid bin Hunain] dari [Ibnu Abbas] radliallahu 'anhuma dia berkata; telah setahun lamanya saya hendak bertanya kepada [Umar bin Khattab] tentang dua isteri Nabi shallallahu 'alaihi wasallam yang bersekongkol menentang kebijaksanaan beliau, tiba-tiba aku merasa segan kepadanya. Suatu hari, ia singgah di suatu tempat, lalu dia masuk ke semak-semak (untuk buang hajat), ketika dia keluar, akupun langsung menanyakan hal itu kepadanya, dia menjawab; \"Mereka adalah Aisyah dan Hafshah.\" Lalu dia melanjutkan kisahnya; Di masa Jahiliyah dulu, kami tidak pernah mengikut sertakan wanita dalam suatu urusan, namun ketika Islam datang, sehingga Allah menyebutkan kebenaran peranan mereka atas kami daripada kami tidak mengikut sertakan mereka pada urusan kami, suatu ketika terjadi percekcokan antara aku dan istriku yang menyebabkan istriku bersikeras kepadaku, maka kukatakan padanya; \"Kamu tidak usah ikut campur memikirkan urusanku.\" istriku berkata; \"Kamu mengatakan seperti ini! Padahal putrimu tengah menyakiti hati Nabi shallallahu 'alaihi wasallam.\" kemudian saya pergi menemui Hafshah dan bertanya kepadanya; \"Sesungguhnya aku memperingatimu, betulkah kamu telah bermaksiat kepada Allah dan Rasul-Nya (maksudnya membantah Nabi)? Lalu aku pun memperingatkan kepadanya akibat dari menyakiti nabi. Kemudian saya menemui Ummu Salamah, dan kuceritakan (kasus tersebut) kepadanya; maka dia berkata kepadaku; \"Sungguh aneh kamu wahai Umar, kamu telah mencampuri segala urusan sampai kepada urusan rumah tangga Rasulullah shallallahu 'alaihi wasallam dan para istrinya.\" perkataan (Ummu Salamah) sangat menyinggung perasaanku. Dan saya memiliki seorang sahabat dari Anshar, apabila dia tidak hadir dari Rasulullah shallallahu 'alaihi wasallam sementara aku hadir, maka aku menemuinya dan memberitahukannya sesuatu yang kudapat dari beliau, begitu sebaliknya, bila saya tidak hadir dari Rasulullah shallallahu 'alaihi wasallam sedangkan dia hadir, maka dia akan menemuiku dan menyampaikan apa yang ia dapat dari Rasulullah shallallahu 'alaihi wasallam. Ketika itu kami sedang berjaga-jaga di sekitar Rasulullah shallallahu 'alaihi wasallam dari raja Ghassan yang berada di Syam, kami sangat khawatir bila raja Ghassan tiba-tiba menyerang kami. Hati kami waktu itu terpusat (pada serangan tersebut), tiba-tiba sahabat Ansharku datang sambil berkata; \"Telah terjadi suatu perkara yang penting!.\" Aku pun bertanya kepadanya; \"apakah perkara itu? Apakah pasukan Ghassan telah datang? Dia menjawab; bahkan lebih dari itu, Rasulullah shallallahu 'alaihi wasallam telah menceraikan para istri beliau.\" Maka aku pun datang, dan aku mendengarkan tangisan dari kamar-kamar mereka (isteri Nabi) sementara Nabi shallallahu 'alaihi wasallam tengah berada di suatu ruangan yang dapat naik dengan tangga, dan pelayan beliau berada di depan ruangan itu, lalu saya mendatanginya dan berkata; \"Izinkanlah saya!.\" Lalu beliau memberi izin, setelah itu saya masuk, tiba-tiba saya melihat Nabi shallallahu 'alaihi wasallam berada di atas alas, terlihat jelas bekas tikar pada pinggang beliau dan di bawah kepala beliau terdapat bantal kulit yang terbuat dari sabut, sementara dekat kepalanya tergantung kulit yang baru disamak. Setelah itu aku sampaikan ucapanku terhadap Hafshah dan Ummu Salamah, serta jawaban Ummu Salamah terhadapku, mendengar itu Rasulullah shallallahu 'alaihi wasallam tersenyum, akhirnya beliau menetap di ruangan itu selama dua sembilan hari, setelah itu beliau turun",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 60
			}
		}
	]
}