{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"9": "Times of the Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 602,
			"arabicnumber": 602,
			"text": "Telah menceritakan kepada kami [Abu An Nu'man] berkata, telah menceritakan kepada kami [Mu'tamin bin Sulaiman] berkata, telah menceritakan kepada kami [bapakku] berkata, telah menceritakan kepada kami [Abu 'Utsman] dari ['Abdurrahman bin Abu Bakar], bahwa para Ashhabush Shuffah adalah orang-orang yang berasal dari kalangan fakir miskin. Nabi Shallallahu 'alaihi wa Sallam bersabda: \"Barangsiapa memiliki makanan cukup untuk dua orang, maka ajaklah orang yang ketiga. Jika memiliki makanan untuk empat orang hendaklah mengajak orang yang kelima atau keenam.\" Maka Abu Bakar datang dengan membawa makanan yang cukup untuk tiga orang. Nabi Shallallahu 'alaihi wa Sallam lalu datang dengan membawa makanan yang cukup untuk sepuluh orang.\" 'Abdurrahman bin Abu Bakar berkata, \"Mereka itu adalah aku, bapakku, ibuku, -perawi berkata; aku tidak tahu ia mengatakan- isteriku dan pelayan yang biasa membantu kami dan keluarga Abu Bakar. Saat itu Abu Bakar makan malam di sisi Nabi Shallallahu 'alaihi wa Sallam hingga waktu isya, dan ia tetap di sana hingga shalat dilaksanakan. Ketika Abu Bakar pulang di waktu yang sudah malam isterinya (ibuku) berkata, \"Apa yang menghalangimu untuk menjamu tamu-tamumu?\" Abu Bakar balik bertanya, \"Kenapa tidak engkau jamu mereka?\" Isterinya menjawab, \"Mereka enggan untuk makan hingga engkau kembali, padahal mereka sudah ditawari.\" 'Abdurrahman berkata, \"Kemudian aku pergi dan bersembunyi.\" Abu Bakar lantas berkata, \"Wahai Ghuntsar (kalimat celaan)!\" Abu Bakar terus saja marah dan mencela (aku). Kemudian ia berkata (kepada tamu-tamunya), \"Makanlah kalian semua.\" Kemudian tamunya mengatakan, \"Selamanya kami tidak akan makan. Demi Allah, tidaklah kami ambil satu suap kecuali makanan tersebut justru bertambah semakin banyak dari yang semula.\" 'Abdurrahman berkata, \"Mereka kenyang semua, dan makanan tersebut menjadi tiga kali lebih banyak dari yang semula. Abu Bakar memandangi makanan tersebut tetap utuh bahkan lebih banyak lagi. Kemudian ia berkata kepada isterinya, \"Wahai saudara perempuan Bani Firas, bagaimana ini?\" Isterinya menjawab, \"Tak masalah, bahkan itu suatu kebahagiaan, ia bertambah tiga kali lipatnya.\" Abu Bakar kemudian memakannya seraya berkata, \"Itu pasti dari setan-yakni sumpah yang ia ucapkan-.\" Kemudian ia memakan satu suap lantas membawanya ke hadapan Nabi Shallallahu 'alaihi wa Sallam. Waktu itu antara kami mempunyai perjanjian dengan suatu kaum dan masanya pun telah habis. Kemudian kami membagi orang-orang menjadi dua belas orang, dan setiap dari mereka diikuti oleh beberapa orang -dan Allah yang lebih tahu berapa jumlah mereka-. Kemudian mereka menyantap makanan tersebut hingga kenyang",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 77
			}
		}
	]
}