{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6140,
			"arabicnumber": 6140,
			"text": "Telah menceritakan kepada kami [Ayyasy bin Al Walid] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Sa'id Al Jurairi] dari [Abu Utsman] dari [Abdurrahman bin Abu Bakr] radliallahu 'anhuma bahwa Abu Bakar kedatangan tamu beberapa orang, lalu dia berkata kepada Abdurrahman; \"Layani tamu-tamumu dengan baik, karena aku hendak menemui Nabi shallallahu 'alaihi wasallam, pergilah untuk menjamu mereka sebelum aku kembali.\" Lantas Abdurrahman beranjak dan menjamu apa yang dia miliki kepada mereka, lalu dia berkata; \"Silahkan makan.\" Namun mereka berkata; \"Kemanakah tuan rumah?\" Abdurrahman berkata; \"Makanlah.\" Mereka tetap berkata; \"Kami tidak akan menyantap makanan sampai tuan rumah datang.\" Abdurrahman berkata; \"Terimalah jamuan kalian ini, karena bila ia datang, sedangkan kalian belum memakannya, dia akan membuangnya.\" Namun mereka tetap menolaknya, maka akupun tahu kalau Abu Bakr akan memarahiku, ketika dia datang, aku langsung menghidar darinya, Abu Bakr berkata; \"Apakah kalian telah memakannya?\" maka mereka mengabarinya (bahwa mereka belum menjamahnya), maka Abu Bakr menyeru; \"Wahai Abdurrahman?\" aku pun terdiam, kemudian dia berkata lagi; \"Wahai Abdurrahman?\" aku tetap diam, lalu dia berkata; \"Wahai Ghuntsar (sebutan untuk Abdurrahman), aku bersumpah kepadamu, jika kamu mendengar suaraku.\" Ketika aku datang dan keluar, aku langsung berkata; \"Tanyalah kepada para tamumu.\" Mereka pun menjawab; \"Dia benar, dia telah menyodorkannya kepada kami.\" Abu Bakr berkata; \"Apakah kalian menungguku?, demi Allah aku tidak akan makan malam ini.\" Dan yang lain pun menimpali; \"Demi Allah, kami tidak akan memakannya hingga kamu memakannya lebih dulu.\" Abu Bakr berkata; \"Aku sama sekali tidak pernah melihat keburukan seperti yang terjadi malam ini.' Celakalah kalian kenapa kalian tidak mau menerima hidangan kami? Berikanlah makananmu kepadaku, \" lalu disodorkanlah makanan tersebut kepadanya kemudian dia meletakkan di tangannya dan berkata; \"Dengan nama Allah, (sumpah) yang pertama adalah untuk syetan.\" Lalu Abu Bakr memakannya dan mereka pun ikut makan",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 167
			}
		}
	]
}