{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6238,
			"arabicnumber": 6238,
			"text": "Telah menceritakan kepada kami [Yahya bin Sulaiman] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku [Anas bin Malik] bahwa ketika Rasulullah shallallahu 'alaihi wasallam tiba di Madinah ia masih berusia sepuluh tahun. (Ia mengkisahkan); Maka aku menjadi pelayan Rasulullah shallallahu 'alaihi wasallam selama sepuluh tahun semasa hayat beliau. Dan akulah orang yang paling mengerti tentang hijab ketika perintah itu diturunkan, Ubay bin Ka'b juga pernah bertanya kepadaku tentang hal itu. Perintah itu pertama kali turun di waktu pernikahan Rasulullah shallallahu 'alaihi wasallam dengan Zainab binti Jahsyi. Saat itu Rasulullah shallallahu 'alaihi wasallam tengah mengadakan pesta walimah, beliau mengundang orang-orang dan mereka pun menikmati makanan yang dihidangkan. Setelah itu, mereka pun keluar pergi, kecuali beberapa orang yang masih tetap berada di sisi Rasulullah shallallahu 'alaihi wasallam, mereka sengaja memperlama duduk di situ. Maka Rasulullah shallallahu 'alaihi wasallam pun beranjak dan keluar, lalu aku pun ikut keluar bersama beliau agar orang-orang itu juga ikut keluar. Kemudian Rasulullah shallallahu 'alaihi wasallam berjalan, dan aku juga ikut berjalan hingga sampai di ambang pintu rumah Aisyah. Lalu Rasulullah shallallahu 'alaihi wasallam mengira, bahwa mereka yang duduk tadi telah keluar, maka beliau kembali lagi dan aku juga ikut kembali hingga beliau sampai di tempat Zainab, ternyata orang-orang itu masih ada di tempat semula dan belum beranjak pergi. Akhirnya Rasulullah shallallahu 'alaihi wasallam pun kembali lagi dan aku juga ikut kembali bersamanya, ketika sampai di ambang pintu Aisyah, beliau menduga bahwa mereka pasti sudah pergi, maka beliau kembali lagi dan aku juga ikut kembali bersama beliau, ternyata orang-orang itu telah beranjak pergi, lalu turunlah ayat hijab hingga beliau meletakkan pembatas antara aku dan beliau",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 12
			}
		}
	]
}