{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6254,
			"arabicnumber": 6254,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Hisyam] dari [Ma'mar] dari [Az Zuhri] dari ['Urwah bin Zubair] dia berkata; telah mengabarkan kepadaku [Usamah bin Zaid] bahwa Nabi shallallahu 'alaihi wasallam mengendarai keledai milik beliau, di atasnya ada pelana bersulam beludru Fadaki, sementara Usamah bin Zaid membonceng di belakang beliau ketika hendak menjenguk Sa'ad bin 'Ubadah di Bani Al Harits Al Khazraj, peristiwa itu tersjadi sebelum perang Badar, lalu beliau berjalan hingga melewati suatu majlis yang di majlis tersebut bercampur antara kaum Muslimin, orang-orang musyrik, para penyembah patung, dan orang-orang Yahudi, dan dalam majlis tersebut terdapat pula Abdullah bin Ubay bin Salul dan Abdullah bin Rawahah, saat majlis itu dipenuhi kepulan debu hewan kendaraan, 'Abdullah bin Ubai menutupi hidungnya dengan selendang sambil berkata: \"Jangan mengepuli kami dengan debu, \" kemudian Nabi shallallahu 'alaihi wasallam mengucapkan salam pada mereka lalu berhenti dan turun, Nabi shallallahu 'alaihi wasallam mengajak mereka menuju Allah sambil membacakan al-Qur'an kepada mereka. 'Abdullah bin Ubay bin Salul berkata kepada beliau: \"Wahai saudara! Sesungguhnya apa yang kamu katakan tidak ada kebaikannya sedikit pun, bila apa yang kau katakan itu benar, maka janganlah kamu mengganggu kami di majlis ini, silahkan kembali ke kendaraan anda, lalu siapa saja dari kami mendatangi anda, silahkan anda bercerita padanya.\" Abdullah bin Rawahah berkata; \"Wahai Rasulullah, bergabunglah dengan kami di majlis ini karena kami menyukai hal itu.\" Maka Kaum muslimin, orang-orang musyrik dan orang-orang Yahudi pun saling mencaci hingga mereka hendak saling menyerang, Nabi shallallahu 'alaihi wasallam terus menenangkan mereka hingga mereka semuanya diam, kemudian beliau naik kendaraan hingga masuk ke kediaman Sa'd bin 'Ubadah, lalu beliau bersabda: \"Hai Sa'd! Apa kau tidak mendengar ucapan Abu Hubab?\" maksud beliau tentang ucapan 'Abdullah bin Ubay. Beliau bersabda: \"Dia telah mengatakan ini dan ini.\" Sa'ad berkata; \"Maafkan dia wahai Rasulullah dan berlapang dadalah kepadanya, demi Allah, Allah telah memberi anda apa yang telah diberikan pada anda. (dahulu) Penduduk telaga ini (penduduk Madinah -red) bersepakat untuk memilihnya dan mengangkatnya, namun karena kebenaran yang diberikan kepada anda itu muncul, sehingga menghalanginya (Abdullah bin Ubay) menjabat sebagai pemimpin, maka seperti itulah perbuatannya sebagaimana yang anda lihat.\" Akhirnya beliau pun mema'afkannya",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 28
			}
		}
	]
}