{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6268,
			"arabicnumber": 6268,
			"text": "Telah menceritakan kepada kami [Umar bin Hafsh] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada kami [Zaid bin Wahb] demi Allah, telah menceritakan kepada kami [Abu Dzar] ketika berada di Rabdzah, dia berkata; \"Aku pernah jalan-jalan bersama Nabi shallallahu 'alaihi wasallam di Harrah Madinah (tempat yang banyak bebatuan hitam) saat malam hari, lalu kami menghadap ke arah gunung Uhud, beliau pun bersabda: \"Wahai Abu Dzar! Aku tidak suka bila emas sebesar gunung Uhud itu menjadi milikku dan bermalam di rumahku hingga tiga malam, kemudan aku mempunyai satu dinar darinya, kecuali satu dinar tersebut akan kupersiapkan untuk membayar hutangku. Lalu aku akan mengatakannya pada hamba-hamba Allah begini, begini dan begini.\" -Beliau lantas mendemontrasikan dengan genggaman tangannya. Beliau bersabda: \"Wahai Abu Dzar, sungguh orang-orang yang berbanyak-banyak (mengumpulkan harta) akan menjadi sedikit (melarat) pada hari kiamat, kecuali orang yang berkata seperti ini, dan seperti ini!\" lalu beliau bersabda kepadaku: \"Wahai Abu Dzar, kamu tunggu di sini hingga aku datang.\" \"Setelah itu beliau pergi hingga hilang dari pandanganku, lalu aku mendengar gemuruh suara, dan aku khawatir jangan-jangan terjadi sesuatu terhadap Rasulullah shallallahu 'alaihi wasallam, serentak aku hendak pergi, namun aku segera teringat sabda Rasulullah shallallahu 'alaihi wasallam \"Tunggulah kamu di sini, \" maka aku pun segera diam di tempat, lalu aku berkata; \"Wahai Rasulullah, tadi aku mendengar suaru gemuruh, dan aku khawatir akan terjadi sesuatu kepada anda, lalu aku segera teringat pesan anda, maka aku tetap diam di tempat.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Itu adalah Jibril, ia datang dan memberitahukan kepadaku bahwa 'siapa saja yang mati dari ummatku dan tidak mensekutukan Allah dengan sesuatu pun, maka ia akan masuk ke surga'.\" Aku lalu bertanya, \"Wahai Rasulullah, walaupun ia berzina dan mencuri?\" Beliau menjawab: \"Walaupun berzina dan mencuri.\" Aku lalu berkata kepada Zaid telah sampai kepadaku bahwa dia adalah Abu Darda`, lalu Zaid mengatakan; \"Aku bersaksi bahwa yang menceritakan itu kepadaku adalah Abu Dzar ketika di Rabdzah. [A'masy] berkata; telah menceritakan kepadaku [Abu Shalih] dari [Abu Darda`] seperti hadits di atas, dan [Abu Syihab] berkata; dari [Al A'masy] bahwa dia pernah menginap di tempatku selama lebih dari tiga hari",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 42
			}
		}
	]
}