{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"3": "Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 63,
			"arabicnumber": 63,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] berkata, telah menceritakan kepada kami [Al Laits] dari [Sa'id Al Maqburi] dari [Syarik bin Abdullah bin Abu Namir] bahwa dia mendengar [Anas bin Malik] berkata: Ketika kami sedang duduk-duduk bersama Nabi shallallahu 'alaihi wasallam didalam Masjid, ada seorang yang menunggang unta datang lalu menambatkannya di dekat Masjid lalu berkata kepada mereka (para sahabat): \"Siapa diantara kalian yang bernama Muhammad?\" Pada saat itu Nabi shallallahu 'alaihi wasallam bersandaran di tengah para sahabat, lalu kami menjawab: \"orang Ini, yang berkulit putih yang sedang bersandar\". Orang itu berkata kepada Beliau; \"Wahai putra Abdul Muththalib\" Nabi shallallahu 'alaihi wasallam menjawab: \"Ya, aku sudah menjawabmu\". Maka orang itu berkata kepada Nabi shallallahu 'alaihi wasallam: \"Aku bertanya kepadamu persoalan yang mungkin berat buatmu namun janganlah kamu merasakan sesuatu terhadapku.\" Maka Nabi shallallahu 'alaihi wasallam menjawab: \"Tanyalah apa yang menjadi persoalanmu\". Orang itu berkata: \"Aku bertanya kepadamu demi Rabbmu dan Rabb orang-orang sebelummu. Apakah Allah yang mengutusmu kepada manusia seluruhnya?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Demi Allah, ya benar!\" Kata orang itu: \"Aku bersumpah kepadamu atas nama Allah, apakah Allah yang memerintahkanmu supaya kami shalat lima (waktu) dalam sehari semalam?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Demi Allah, ya benar!\" Kata orang itu: \"Aku bersumpah kepadamu atas nama Allah, apakah Allah yang memerintahkanmu supaya kami puasa di bulan ini dalam satu tahun?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Demi Allah, ya benar!\" Kata orang itu: \"Aku bersumpah kepadamu atas nama Allah, apakah Allah yang memerintahkanmu supaya mengambil sedekah dari orang-orang kaya di antara kami lalu membagikannya kepada orang-orang fakir diantara kami?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Demi Allah, ya benar!\" Kata orang itu: \"Aku beriman dengan apa yang engkau bawa dan aku adalah utusan kaumku, aku Dlamam bin Tsa'labah saudara dari Bani Sa'd bin Bakr.\" Begitulah (kisah tadi) sebagaimana yang diriwayatkan oleh [Musa bin Isma'il] dan [Ali bin Abdul Hamid] dari [Sulaiman bin Al Mughirah] dari [Tsabit] dari [Anas] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 5
			}
		}
	]
}