{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6373,
			"arabicnumber": 6373,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Ibrahim bin Sa'd] telah mengabarkan kepada kami [Ibnu Syihab] dari ['Amir bin Sa'd] bahwa [Ayahnya] berkata; \"Ketika Rasulullah Shallallahu 'alahi wasallam haji wada', beliau datang menjengukku ketika aku terbaring sakit yang menyebabkan kematianku, lalu saya berkata; \"Wahai Rasulullah, keadaan saya semakin parah, seperti yang telah anda lihat saat ini, sedangkan saya adalah orang yang memiliki banyak harta, sementara saya hanya memiliki seorang anak perempuan yang akan mewarisi harta peninggalan saya, maka bolehkah saya menyedekahkan dua pertiga dari hartaku?\" beliau bersabda: \"Jangan.\" Saya bertanya lagi; \"Kalau begitu, bagaimana jika separuhnya?\" beliau menjawab: \"Jangan, (namun sedekahkanlah sepertiganya saja), dan sepertiganya pun sudah banyak, sebenarnya bila kamu meninggalkan ahli warismu dalam keadaan kaya, itu lebih baik daripada kamu meninggalkan mereka dalam keadaan serba kekurangan dan meminta-minta kepada orang lain. Tidakkah Kamu menafkahkan suatu nafkah dengan tujuan untuk mencari ridla Allah, melainkan kamu akan mendapatkan pahala lantaran dari nafkah pemberianmu itu, hingga sesuap makanan yang kamu suguhkan kemulut istrimu juga merupakan sedekah darimu.\" Saya bertanya lagi; \"Apakah saya masih tetap hidup, sesudah teman-teman saya meninggal dunia?\" beliau menjawab: \"Sesungguhnya kamu tidak akan panjang umur, kemudian kamu mengerjakan suatu amalan dengan tujuan untuk mencari ridla Allah, kecuali derajatmu akan semakin bertambah, semoga kamu dipanjangkan umurmu sehingga kaum Muslimin mendapatkan manfa'at darimu dan orang-orang (kafir) menderita kerugian karenamu. Ya Allah… sempurnakanlah hijrah para sahabatku dan janganlah Engkau kembalikan mereka kepada kekufuran, akan tetapi alangkah kasihannya Sa'd bin Khaulah.\" Sa'd berkata; \"Kemudian Nabi shallallahu 'alaihi wasallam mendo'akannya agar ia meninggal di kota Makkah",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 70
			}
		}
	]
}