{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6391,
			"arabicnumber": 6391,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Mundzir] telah menceritakan kepada kami [Anas bin 'Iyadl] dari [Hisyam] dari [ayahnya] dari [Aisyah] radliallahu 'anha bahwa Rasulullah shallallahu 'alaihi wasallam terkena sihir, sehingga beliau pun dibuat seakan-akan telah melakukan sesuatu pekerjaan yang beliau tidak kerjakan. Sampai beliau selalu berdo'a kepada Rabbnya, kemudian beliau bersabda: \"Wahai Aisyah, apakah kamu telah merasakan bahwa Allah telah memberikan fatwa (menghukumi) dengan apa yang telah aku fatwakan (hukumi)?\" Aisyah berkata; 'Apa itu wahai Rasulullah? ' Beliau menjawab: 'Dua orang laki-laki telah datang kepadaku, lalu salah seorang dari keduanya duduk di atas kepalaku dan satunya lagi di kakiku. Kemudian salah seorang berkata kepada yang satunya; 'Menderita sakit apakah laki-laki ini? ' temannya menjawab; 'Terkena sihir.' Salah seorang darinya bertanya; 'Siapakah yang menyihirnya? ' Temannya menjawab; 'Labid bin Al A'sham.' Salah seorang darinya bertanya; 'Dengan benda apakah (dia menyihir)? ' Temannya menjawab; 'Dengan rambut yang terjatuh (ketika disisir) dan seludang mayang kurma.' Salah seorang darinya bertanya; 'Di manakah benda itu di letakkan?\" Temannya menjawab; 'Di dalam sumur Dzarwan.' -Dzarwan adalah sumur yang terletak di Bani Zuraiq- Aisyah melanjutkan; 'Kemudian Rasulullah shallallahu 'alaihi wasallam mendatanginya, lalu beliau kembali menemui Aisyah, beliau lalu bersabda: 'Demi Allah, seakan-akan airnya berubah bagaikan rendaman pohon inai dan seakan-akan pohon kurmanya bagaikan kepala syetan.' Aisyah berkata; 'Lalu Rasulullah shallallahu 'alaihi wasallam datang dan memberitahukan mengenai sumur tersebut, lantas aku bertanya; 'Wahai Rasulullah, tidakkah anda mengeluarkannya? ' Beliau menjawab: 'Tidak, sesungguhnya Allah telah menyembuhkanku dan aku tidak suka bila memberikan kesan buruk kepada orang lain dari peristiwa itu.' [Isa bin Yunus] dan [Al Laits bin Sa'd] menambahkan; dari [Hisyam] dari [Ayahnya] dari [Aisyah] dia berkata; 'Nabi shallallahu 'alaihi wasallam disihir, lalu beliau selalu berdo'a dan berdo'a ….' Kemudian dia melanjutkan hadits tersebut",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 86
			}
		}
	]
}