{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6452,
			"arabicnumber": 6452,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] seperti sepenggal hadits ini; telah menceritakan kepada kami ['Umar bin Dzar] telah menceritakan kepada kami [Mujahid] bahwa [Abu Hurairah] pernah mengatakan; \"Demi Allah yang tidak ada Tuhan selain Dia, aku pernah menempelkan lambungku di atas tanah karena rasa lapar, aku juga pernah mengikatkan beberapa batu diperutku karena rasa lapar. Pada suatu hari aku pernah duduk di jalan yang biasa para sahabat lewati, kemudian lewatlah Abu Bakar, lalu aku bertanya kepadanya tentang ayat dari kitabullah, dan aku tidaklah menanyakannya kecuali hanya agar ia menjamuku namun ia tidak melakukannya. Setelah itu lewatlah Umar, kemudian aku bertanya kepadanya tentang suatu ayat di kitabullah, tidaklah aku bertanya kepadanya kecuali hanya agar ia menjamuku namun ia tidak melakukannya. Setelah itu lewatlah Abul Qasim shallallahu 'alaihi wasallam, ketika melihatku beliau tersenyum dan mengetahui apa yang tergambar dari wajah dan hatiku, beliau lalu bersabda: 'Wahai Abu Hurairah? ' Aku menjawab; 'Aku penuhi panggilanmu wahai wahai Rasulullah.' Beliau bersabda: 'Ikutlah.' Lalu aku mengikuti beliau, aku lalu minta izin untuk masuk dan beliau mengizinkanku, ternyata aku mendapatkan susu di dalam mangkok, beliau bersabda: 'Dari mana kalian mendapatkan susu ini? ' Orang-orang rumah menjawab; 'Fulan atau fulanah menghadiahkannya kepada anda.' Beliau bersabda: 'Wahai Abu Hurairah! ' Aku menjawab; 'Aku penuhi panggilanmu wahai Rasulullah.' Beliau bersabda: 'Temuilah ahli suffah (para sahabat yang tinggal di pelataran masjid) dan ajaklah mereka kemari.' Abu Hurairah berkata; 'Ahli Suffah adalah para tamu kaum muslimin, mereka tidak tinggal bersama keluarga dan tidak memiliki harta, jika Nabi mendapatkan hasil dari sedekah, maka beliau tidak akan memakannya dan akan mengirimnya kepada ahli suffah, dan apabila beliau diberi hadiyah, maka mereka akan mendapatkan bagian dan kadang beliau mengirim sebagiannya untuk mereka.' Lalu aku berkata; 'Hal itu membuatku sedih, lalu aku berkata (dalam hati); 'Apa perlunya ahli suffah dengan susu tersebut, karena akulah yang berhak daripada mereka, aku berharap dapat minum seteguk susu sekedar bisa bertahan dari sisa waktuku, apabila ada kaum yang datang maka akulah yang menyuguhi mereka, (kataku selanjutnya). Apalah artinya susu yang tersisa jika bukan untuk suatu ketaatan kepada Allah dan Rasul-Nya, lalu aku pergi dan mengundang mereka, mereka akhirnya datang dan meminta izin, beliau kemudian mengizinkan, sehingga mereka pun mengambil posisi tempat duduk mereka masing-masing, beliau bersabda: 'Hai Abu Hurairah.' Aku menjawab; 'Aku penuhi panggilanmu wahai Rasulullah.' Beliau bersabda: 'Ambil dan berikanlah kepada mereka.' Akupun mengambil mengkok tersebut dan memberikannya kepada seorang laki-laki, maka laki-laki itu meminumnya hingga kenyang, setelah itu ia mengembalikannya kepadaku, kemudian aku berikan kepada yang lain, dan ia pun minum hingga kenyang kemudian ia mengembalikan mangkok tersebut kepadaku hingga aku kembalikan mangkok itu kepada Nabi shallallahu 'alaihi wasallam, sehingga mereka semua sudah merasa kenyang. Beliau kemudian mengambil mangkok itu dan menaruhnya di tangan, lalu beliau melihatku sembari tersenyum, beliau bersabda: 'Wahai Abu Hurairah! ' Aku menjawab; 'Aku penuhi panggilanmu wahai Rasulullah.' Beliau bersabda: 'Sekarang tinggal aku dan kamu.' Aku menjawab; 'Benar wahai Rasulullah.' Beliau bersabda: 'Duduk dan minumlah.' Lalu aku duduk dan meminumnya, beliau bersabda kepadaku; 'Minumlah.' Lalu aku minum lagi dan beliau terus menyuruhku untuk minum, hingga aku berkata; 'Tidak, demi Dzat yang mengutusmu dengan kebenaran, aku sudah tidak sanggup lagi.' Beliau bersabda: 'Berikan bejana itu.' Aku lalu memberikannya kepada beliau, setelah memuji Allah dan menyebut nama-Nya beliau akhirnya meminum sisanya",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 41
			}
		}
	]
}