{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6573,
			"arabicnumber": 6573,
			"text": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabariku [Sa'id] dan ['Atho' bin Yazid], bahwasanya [Abu Hurairah] mengabari keduanya dari Nabi shallallahu 'alaihi wasallam -lewat jalur periwayatan lain-Telah mengabariku [Mahmud] telah menceritakan kepada kami [Abdurrazaq] Telah mengabari kami [Ma'mar] dari [Az Zuhri] dari ['Atho' bin Yazid Al Laitsi] dari [Abu Hurairah] mengatakan; Beberapa orang bertanya, 'wahai Rasulullah, apakah kami bisa melihat Tuhan kami pada hari kiamat? ' Nabi menjawab: \"Apakah kalian mendapat kesulitan melihat matahari ketika tidak ada mendung?\" 'Tidak wahai Rasulullah' Jawab mereka. Nabi shallallahu 'alaihi wasallam bertanya lagi; \"Apakah kalian menadapat kesulitan melihat rembulan ketika purnama?\" Mereka menjawab; 'Tidak wahai Rasulullah'. Nabi bersabda: \"Sungguh kalian melihat-Nya pada hari kiamat. Allah kemudian menghimpun seluruh manusia kemudian berfirman; 'Siapa yang menyembah sesuatu, hendaklah ia mengikuti sesembahannya, ' Orang-orang pun mengikuti yang pernah disembahnya, ada yang mengikuti matahari karena menyembahnya, ada yang mengikuti bulan karena menyembahnya, ada yang mengikuti thaghut (segala sesembahan selain Allah) karena menyembahnya, sehingga yang tersisa adalah umat ini yang didalamnya terdapat orang-orang munafiknya. Allah kemudian mendatangi mereka dengan bentuk yang belum pernah mereka kenal, dan mengatakan; 'Aku adalah Tuhan kalian' Namun mereka malah menjawab; 'kami berlindung kepada Allah dari-MU, inilah tempat kami, sampai Tuhan kami mendatangi kami, kalaulah Tuhan kami mendatangi kami, niscaya kami mengenal-NYA.' Kemudian Allah mendatangi mereka dengan bentuk yang mereka kenal dan mengatakan; 'AKU tuhan kalian! ' 'Betul, engkau tuhan kami' Jawab mereka. Mereka lantas mengikuti-Nya dan dipasanglah jembatan jahannam.\" Rasulullah Shallallahu'alaihiwasallam bersabda: \"Akulah manusia pertama-tama yang menyeberangi. Dan doa para rasul ketika itu ialah; 'Allahumma Sallim-sallim (ya Allah selamatkanlah, selamatkanlah).' Dalam jembatan itu terdapat sekian banyak besi-besi pengait seperti pohon yang berduri tajam. Bukankah kalian pernah melihat pohon berduri tajam?\". 'betul, ya Rasulullah, ' jawab mereka. Nabi meneruskan; 'Besi-besi pengait itu bagaikan pohon berduri tajam, hanya tidak ada yang tahu besarannya selain Allah. Besi-besi pengait itu menyambar manusia tergantung dengan amalan mereka, ada diantara mereka yang celaka lantaran amalannya, ada diantara mereka yang tercabik kemudian selamat. Hingga jika Allah selesai memutuskan diantara hamba-Nya, dan ingin mengeluarkan yang dikehendaki-NYA dari neraka dari mereka yang mengucapkan laa-ilaaha-illallah, Dia perintahkan malaikat untuk mengentaskan mereka, dan para malaikat mengenali mereka dengan bekas-bekas sujud, dan Allah mengharamkan neraka untuk memakan bekas-bekas sujud yang ada pada diri anak Adam, malaikat pun mengentaskan mereka setelah mereka gosong terbakar, mereka diguyur air yang disebut dengan air kehidupan, sehingga mereka tumbuh bagaikan tumbuhnya biji di tepi sungai, dan ada seseorang diantara mereka menghadapkan wajahnya kearah neraka dan mengatakan; 'Ya tuhanku, bau neraka telah menyesakkan hidungku dan nyalanya telah membakarku, maka palingkanlah wajahku dari neraka.' Hamba itu tiada henti memanjatkan doa untuk dipalingkan wajahnya dari neraka. Maka Allah berfirman; 'bisa jadi engkau jika AKU kabulkan permintaanmu, kamu minta yang lain lagi! ' hamba itu menjawab; 'Tidak, demi kebesaran -MU, aku tidak akan meminta yang lain lagi'. Allah pun memalingkan wajahnya dari neraka. Tetapi setelah itu ia meminta kembali; 'ya Tuhanku, dekatkanlah aku ke pintu surga!.' Allah menegur; 'Bukankah engkau telah menyatakan sanggup untuk tidak meminta-KU selainnya, celaka engkau wahai anak adam, betapa banyaknya alasanmu! ' hamba itu tiada henti memohon, sehingga Allah pun menjawab; 'bisa jadi jika AKU kabulkan permintaanmu, kamu akan meminta-KU yang lain lagi'. Hamba menjawab; 'Tidak, demi kebesaran-MU, saya tidak akan meminta-MU selainnya.' Maka Allah meminta janji dan ikrar agar ia tidak meminta-NYA selain itu, sehingga Allah mendekatkannya ke pintu surga. Namun setelah hamba tadi melihat isinya, ia diam beberapa saat sesuai kehendak Allah, kemudian ia berkata; 'Ya Tuhanku, masukkanlah aku ke dalam surga! ' Allah menjawab; 'Bukankah engkau telah menyatakan sanggup untuk tidak meminta-KU selainnya, celaka engkau wahai anak Adam, alangkah banyaknya alasanmu'. Hamba terus merengek dengan mengucapkan; 'Wahai Tuhanku, janganlah Engkau jadikan aku menjadi manusia yang paling sengsara.' Hamba tiada henti memanjatkan doanya hingga Allah tertawa. Dan jika Allah telah tertawa, berarti ia mengizinkan hamba-NYA masuk surga. Setelah hamba memasukinya, dikatakan kepadanya; 'mengkhayallah seperti ini! ' maka ia pun mengkhayal, kemudian dikatakan kepadanya lagi; 'mengkhayallah seperti ini! ' maka ia pun mengkhayal sampai khayalannya benar-benar habis, kemudian Allah berkata kepadanya; 'Inilah bagimu dan semisalnya'.\" Kata Abu Hurairah; 'itulah laki-laki penghuni surga yang terakhir kali masuk.' Kata 'Atho`; Dan Abu Sa'id Al Khudzri sedang duduk bersama Abu Hurairah, dan ia tidak merubah haditsnya sedikitpun hingga ketika sampai sabdanya; 'Ini bagimu dan semisalnya bersamanya.' Maka [Abu Sa'id] menyelah; aku pernah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: 'Ini bagimu dan sepuluh kali semisalnya.' [Abu Hurairah] menjawab; 'yang aku hafal adalah semisalnya bersamanya",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 161
			}
		}
	]
}