{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 664,
			"arabicnumber": 664,
			"text": "Telah menceritakan kepada kami ['Umar bin Hafsh bin Ghiyats] berkata, telah menceritakan kepadaku [Bapakku] berkata, telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] dari [Al Aswad] berkata, \"Kami pernah bersama ['Aisyah] ketika kami menceritakan tentang masalah menekuni shalat berjama'ah dan mengutamakannya. Maka Aisyah pun berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam sedang sakit yang membawa pada ajalnya, waktu shalat tiba dan dikumandangkanlah adzan. Beliau lalu bersabda (kepada para isterinya): \"Suruhlah Abu Bakar untuk memimpin shalat bersama orang-orang.\" Lalu dikatakan kepada beliau, \"Sesungguhnya Abu Bakr adalah orang yang lemah dan mudah menangis (saat membaca Al Qur'an). Dia tidak akan mampu menggantikan posisi Tuan untuk memimpin orang-orang shalat.\" Beliau kembali mengulangi ucapannya, dan mereka juga memberi jawaban yang sama. Hal itu terus berulang hingga tiga kali, akhirnya beliau pun bersabda: \"Kalian ini seperti isteri-isteri Yusuf! Perintahkanlah Abu Bakr agar memimpin shalat.\" Maka keluarlah Abu Bakr memimpin shalat jama'ah. Beliau kemudian merasa agak segar badannya, sehingga beliau keluar ke masjid dengan diapit oleh dua orang, seolah aku kedua kaki beliau menyentuh tanah karena sakit. Melihat kehadiran beliau, Abu Bakar berniat untuk mundur namun Nabi shallallahu 'alaihi wasallam mencegahnya dengan isyarat agar ia tetap pada posisinya. Kemudian beliau di dudukkan di sisi Abu Bakar.\" Dikatakan kepada Al A'masy, \"Apakah beliau shalat kemudian Abu Bakar shalat mengikuti shalatnya beliau, dan orang-orang shalat dengan mengikuti shalatnya Abu Bakar?\" Lalu Al A'masy menjawab 'Ya' dengan anggukkan kepalanya.\" [Abu Daud] juga meriwayatkannya dari [Syu'bah] dari [Al A'masy] sebagiannya, dan [Abu Mu'awiyah] menambahkan, \"Beliau shalat dengan duduk di sebelah kiri Abu Bakar, sementara Abu Bakr shalat dengan berdiri",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 58
			}
		}
	]
}