{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"88": "Apostates"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6939,
			"arabicnumber": 6939,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Abu 'Awanah] dari [Hushain] dari [fulan] mengatakan, Abu Abdurrahman dan Hibban bin 'Uthayyah bersengketa. [Abu Abdurrahman] kemudian mengatakan kepada Hibban; 'Aku tahu alasan yang memotivasi kawanmu untuk menumpahkan darah.' Maksudnya [Ali bin Abi Thalib]. 'Apa itu? ' Tanya Hibban. Abu Abdurrahman menjawab; 'Sesuatu yang aku mendengar darinya secara langsung.' 'Apa itu? ' Tanya Hibban. Abu Abdurrahman melanjutkan; dia berkata; Rasulullah shallallahu 'alaihi wasallam mengutusku bersama Zubair dan Abu Murtsad. Masing-masing kami ketika itu menunggang kuda. Nabi berpesan: \"Berangkatlah kalian hingga kalian sampai ke Raudah Haj.\" Kata Abu Salamah demikian, namun Abu Awanah mengatakan dengan redaksi; 'Haj'.\"disana ada seorang wanita yang membawa surat Hathib bin Abi Baltha'ah kepada kaum musyrikin, bawalah surat itu kepadaku.\" Lantas kami berangkat menunggang kuda kami hingga kami menemukan wanita itu sebagaimana yang disabdakan Nabi kepada kami, yaitu ia berada diatas untanya. Ketika itu Hathib bin Abi Baltha'ah telah berkirim surat kepada penduduk Makkah yang isinya mengabarkan keberangkatan Rasulullah Shallallahu'alaihiwasallam kepada mereka. Maka kami bertanya kepada wanita tersebut; 'Mana surat yang ada bersamamu? ' 'Saya tak membawa surat apapun' Jawab wanita tersebut. Maka kami menderumkan untanya, Kami mencari-cari surat itu di barang-barang bawaannya namun tidak kami dapatkan apa-apa. Kedua kawan kami mengatakan; 'Menurut hemat kami, dia tak membawa surat! ' Saya jawab; 'Kita sama-sama tahu bahwa Rasulullah shallallahu 'alaihi wasallam tak mungkin bohong.' Maka Ali bersumpah dengan mengatakan; 'Demi Dzat yang dijadikan untuk bersumpah, sekarang kamu harus mengeluarkan surat itu, atau kami benar-benar menelanjangimu.' Spontan wanita tersebut meraih ikat pinggangnya dan pada saat itu dia mengenakan ikat pinggang terbuat dari kain, dan mengeluarkan surat tersebut. Kemudian mereka membawa surat itu kepada Rasulullah Shallallahu'alaihiwasallam. Umar berkata; 'ya Rasulullah, sungguh Hathib telah mengkhianati Allah dan rasul-NYA dan juga orang-orang mukmin, biarkan diriku memenggal lehernya.' Rasulullah shallallahu 'alaihi wasallam bertanya kepada Hathib: \"Hai Hathib, apa yang mendorongmu untuk berbuat seperti itu?\" Hathib menjawab; 'ya Rasulullah, Bukan berarti saya tidak beriman kepada Allah dan rasul-NYA, akan tetapi saya ingin mempunyai di tengah-tengah kaum (di Makkah) tangan yang membela keluarga dan hartaku, dan saya berpikir tak ada satupun dari sahabatmu melainkan dia juga disana mempunyai keluarga yang lewat perantaraannya Allah menjaga keluarga dan hartanya dari kaumnya.' Maka Nabi menjawab; \"Ia jujur, maka janganlah kalian berkomentar terhadapnya selain kebaikan.\" Namun Umar belum juga reda kemarahannya sehingga kembali mengatakan; 'ya Rasulullah, ia telah berkhianat kepada Allah dan rasul-Nya dan juga orang-orang mukmin, biarkan aku memenggal kepalanya.' Spontan Nabi shallallahu 'alaihi wasallam menegur: \"bukankah dia termasuk orang yang mengikuti perang Badar? apakah kamu tahu, barangkali Allah telah melihat orang-orang yang mengikuti perang badar lantas mengatakan; 'lakukanlah sekehendak kalian, Aku telah mewajibkan surga bagi kalian!\" Kedua mata Umar pun berlinang, dan berujar; 'Allah dan Rasul-Nya-lah yang lebih tahu! ' Abu Abdullah mengatakan mengenai tempat diatas; 'Khah adalah lebih sahih, namun beginilah Abu 'Awanah mengatakan, haj. Padahal haj adalah kesalahan tulis. Haj adalah nama tempat, sedang [Husyaim] mengatakan Khah (dengan huruf akhir Kha' bukan jim)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 21
			}
		}
	]
}