{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7046,
			"arabicnumber": 7046,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Yunus] dari [Ibnu Syihab] dari [Ubaidullah bin Abdullah] bahwasanya [Ibnu Abbas] radliallahu 'anhuma menceritakan; Ada seorang laki-laki mendatangi Rasulullah Shallallahu'alaihiwasallam mengatakan; 'Tadi malam aku bermimpi melihat segumpal awan yang meneteskan minyak samin dan madu, lantas kulihat orang banyak memintanya, ada yang meminta banyak dan ada yang meminta sedikit, tiba-tiba ada tali yang menghubungkan antara langit dan bumi, kulihat engkau memegangnya kemudian engkau naik, kemudian ada orang lain memegangnya dan ia pergunakan untuk naik, kemudian ada orang yag mengambilnya dan dipergunakannya untuk naik namun tali terputus, kemudian tali tersambung.' Spontan Abu Bakar berujar; 'Wahai Rasulullah, ayah dan ibuku untuk tebusanmu, demi Allah, biarkan aku untuk mentakwilkannya! ' \"takwilkanlah\" Kata Rasulullah Shallallahu'alaihiwasallam. Abu Bakar mengatakan; 'Adapun awan, itulah Islam, adapun madu dan minyak samin yang menetes, itulah Alquran, karena alqur'an manisnya menetes, maka silahkan ada yang memperbanyak atau mempersedikit, adapun tali yang menghubungkan langit dan bumi adalah kebenaran yang engkau pegang teguh sekarang ini, yang karenanya Allah meninggikan kedudukanmu, kemudian ada seseorang sepeninggalmu mengambilnya dan ia pun menjadi tinggi kedudukannya, lantas ada orang lain yang mengambilnya dan terputus, kemudian tali itu tersambung kembali sehingga ia menjadi tinggi kedudukannya karenanya, maka beritahulah aku ya Rasulullah, ayah dan ibuku sebagai tebusanmu, saya benar ataukah salah? ' Nabi shallallahu 'alaihi wasallam menjawab: \"Engkau benar sebagian dan salah sebagian!\" Abu Bakar mengatakan; 'Demi Allah ya Rasulullah, tolong beritahukanlah kepadaku takwilku yang salah! ' Nabi menjawab: \"Janganlah engkau bersumpah",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 60
			}
		}
	]
}