{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7047,
			"arabicnumber": 7047,
			"text": "Telah menceritakan kepadaku [Mu`ammal bin Hisyam Abu Hisyam] telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami ['Auf] telah menceritakan kepada kami [Abu Raja'] telah menceritakan kepada kami [Samurah bin Jundab] radliallahu 'anhu, Rasulullah Shallallahu'alaihiwasallam seringkali mengatakan kepada para sahabatnya; \"Apakah diantara kalian ada yang bermimpi?\" Kata Samurah; maka ada diantara mereka yang menceritakan kisahnya. Suatu saat ketika subuh, beliau berkata: \"Semalaman aku didatangi dua orang, keduanya mengajakku pergi dan berujar; 'Ayo kita berangkat! ' Aku pun berangkat bersama keduanya, dan kami mendatangi seseorang yang berbaring dan yang lain berdiri disampingnya dengan membawa batu besar, lalu ia menjatuhkan batu tersebut di kepalanya sehingga kepalanya pecah dan batu menggelinding disini. Orang tadi terus mengikuti batu dan mengambilnya, namun ketika dia belum kembali kepada yang dijatuhi, tetapi kepalanya telah kembali seperti sedia kala. Lantas orang tadi kembali menemuinya dan mengerjakan sebagaimana semula. Sayapun bertanya kepada dua orang yang membawaku; 'Subhanallah, mengapa kedua orang ini seperti ini? ' keduanya menjawab; 'Mari kita berangkat ke tempat lain dahulu! ' Kami pun berangkat, lantas kami mendatangi seseorang yang terlentang diatas kedua tengkuknya sedang ada orang lain yang berdiri di sampingnya sambil membawa pengait besi, ia memegang salah satu samping wajahnya dan memotong-motong dagunya hingga tengkuknya, dan tenggorokannya hingga tengkuknya, dan matanya hingga tengkuknya\" -Kata Auf, terkadang Abu Raja' menggunakan redaksi; 'lantas membelah-belah dagunya, bukan memotong- \"kemudian orang yang memotong berpindah ke sisi dagu lain dan memperlakukan korbannya sebagaimana ia lakukan pada sisi dagu pertama. Belum ia selesai memotong-mogong dagu kedua, maka dagu samping pertama kembali seperti semula, maka orang itu memperlakukannya sebagaimana semula. Maka saya bertanya; 'Subhanallah, kenapa dua orang ini? ' Namun kedua orang yang membawaku hanya berujar; 'Mari kita pindah ke tempat lain dulu! ' Maka kami berangkat, hingga kami mendatangi suatu tempat seperti tungku.\" Kata Abu Raja, seingatku Samurah mengatakan; \"Tungku tersebut mengeluarkan suara gemuruh.- Lantas kami melihat isinya, tak tahunya disana ada laki-laki dan wanita telanjang, mereka didatangi oleh sulut api dari bawah mereka, jika sulutan api mengenai mereka, mereka mengerang-ngerang. Maka saya bertanya kepada dua orang yang membawaku; 'apa sebenarnya dengan orang-orang ini? Namun kedua orang yang membawaku hanya berujar; 'Ayo kita berpindah ke tempat lain! ' Maka kami terus berangkat, dan kami mendatangi sebuah sungai.\" Dan setahuku Samurah mengatakan; 'sungai merah seperti darah-, \"tak tahunya di sungai ada laki-laki yang berenang, sedang ditepi sungai ada orang yang mengumpulkan banyak bebatuan, apabila yang berenang tadi sampai ke tepian sungai, ke tempat orang yang mengumpulkan bebatuan, maka ia membuka mulutnya dan orang yang di tepi tadi memasukkan batu ke mulutnya, lantas ia berenang kemudian kembali lagi, setiap kali ia kembali ke tepi, mulutnya membuka dan orang yang di tepi menyuapinya dengan batu itu. Saya bertanya kepada dua orang yang membawaku; 'kenapa dua orang ini? ' keduanya menjawab; 'Ayo kita pindah ke tempat lain dulu! ' Maka kami pun berangkat, lantas kami mendatangi seseorang yang wajahnya menyeramkan sebagaimana seseorang yang paling menyeramkan yang pernah kalian lihat. Dan di dekatnya terdapat api yang terus ia nyalakan dan dia berlari di sekitarnya. Saya bertanya kepada dua orang yang membawaku; 'mengapa orang ini? ' kedua orang yang membawaku berujar; 'Ayo kita pindah ke tempat lain dahulu! ' Lantas kami berangkat. Lalu kami mendatangi sebuah kebun yang secara merata berisi warna musim semi, diantara dua tepi kebun terdapat seseorang yang jangkung, yang nyaris aku belum pernah melihat manusia yang kepalanya memanjang di langit seperti itu, dan sekitar orang itu terdapat banyak anak-anak kecil yang pernah aku lihat. Saya bertanya; 'Apa ini sebenarnya, mereka ini siapa? ' kedua orang yang membawaku berujar; 'Ayo kita pindah ke tempat lain dulu! ' Kami pun berangkat melanjutkan perjalanan, hingga kami mendatangi sebuah kebun besar yang sebelumnya aku belum pernah melihat kebun lebih besar dan lebih indah daripadanya sama sekali, Keduanya berkata; 'Naiklah engkau! ' Kami pun naik, dan kami berakhir ke sebuah kota yang dibangun dari batu bata emas dan perak, lalu kami tiba di pintu kota. Kami minta di buka, maka pintu pun dibuka untuk kami, kami masuk dan kami disambut oleh beberapa orang yang separo tubuhnya seperti orang paling tampan yang pernah anda lihat, dan separohnya seperti manusia paling jelek yang pernah engkau lihat. Keduanya mengatakan kepada mereka; 'Pergilah kalian semua! ' Lantas mereka sampai di sebuah sungai. Tak tahunya sungai itu terbentang mengalir, airnya sangat putih bersih, mereka pun pergi dan mandi-mandi disana, kemudian kembali menemui kami dan kotorannya telah hilang di sungai tempat mereka mandi, sehingga mereka menjadi manusia paling tampan. Keduanya mengatakan kepadaku; 'Inilah surga Aden dan di sini hunianmu! ' lantas pandanganku menatap ke atas, tak tahunya ada sebuah istana seperti awan putih yang menyendiri. Keduanya berkata; 'Inilah hunianmu! ' Saya menjawab; 'Semoga Allah memberkati kalian berdua, sekarang biarkanlah aku untuk memasukinya! ' Keduanya menjawab; 'kalau sekarang jangan dulu, namun pasti engkau akan memasukinya! ' Saya mengatakan; 'Semenjak semalaman aku telah melihat peristiwa-peristiwa aneh nan mencengangkan, tolong kabarilah aku apa arti sebenarnya yang kulihat! ' Keduanya berujar; 'Sekarang baiklah kuberitakan kepadamu peristiwa-peristiwa itu! Adapun laki-laki pertama yang kamu datangi sedang kepalanya pecah dengan batu, itu adalah seseorang yang mempelajari alquran namun ia menolaknya, dan ia tidur sampai meninggalkan shalat wajib. Adapun orang yang kamu datangi membelah dagu kawannya hingga tengkuknya, tenggorokannya hingga dagunya, dan matanya hingga tengkuknya, itu adalah seseorang yang berangkat dari rumahnya lantas ia dusta, dan kedustaannya menembus cakrawala. Adapun laki-laki dan wanita yang telanjang dalam bangunan seperti tungku, mereka adalah laki-laki dan wanita pezina. Adapun laki-laki yang berenang dalam sungai dan disuapi batu besar, mereka adalah pemakan riba, adapun laki-laki yang raut mukanya menyeramkan di neraka sambil menyalakan api dan berlari-lari di sekitarnya, itu adalah Malik, penjaga Jahannam, adapun laki-laki jangkung dalam taman, ia adalah Ibrahim 'alaihissalam, adapun anak-anak di sekitarnya adalah bayi yang mati diatas fitrah.\" Lantas sebagian sahabat bertanya; 'ya Rasulullah, juga anak orang-orang musyrik? ' Rasulullah shallallahu 'alaihi wasallam bersabda: \"Juga anak-anak orang-orang musyrik! Adapun orang yang separoh berwajah tampan dan separohnya lagi jelek, mereka adalah orang yang mencampuradukkan amal shalih dan lainnya jelek, lantas Allah mengampuni kesalahannya",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 61
			}
		}
	]
}