{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7084,
			"arabicnumber": 7084,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Ibnu Jabir] telah menceritakan kepadaku [Busr bin Ubaidullah Al Khadrami], ia mendengar [Abu Idris alkhaulani], ia mendengar [Khudzaifah Ibnul yaman] mengatakan; Orang-orang bertanya Rasulullah Shallallahu'alaihiwasallam tentang kebaikan sedang aku bertanya beliau tentang keburukan karena khawatir jangan-jangan aku terkena keburukan itu sendiri. Maka aku bertanya 'Hai Rasulullah, dahulu kami dalam kejahiliyahan dan keburukan, lantas Allah membawa kebaikan ini, maka apakah setelah kebaikan ini ada keburukan lagi? Nabi menjawab 'Tentu'. Saya bertanya 'Apakah sesudah keburukan itu ada kebaikan lagi? 'Tentu' Jawab beliau, dan ketika itu ada kotoran, kekurangan dan perselisihan. Saya bertanya 'Apa yang anda maksud kotoran, kekurangan dan perselisihan itu? Nabi menjawab 'Yaitu sebuah kaum yang menanamkan pedoman bukan dengan pedomanku, engkau kenal mereka namun pada saat yang sama engkau juga mengingkarinya. Saya bertanya 'Adakah steelah kebaikan itu ada keburukan? Nabi menjawab 'O iya,,,,, ketika itu ada penyeru-penyeru menuju pintu jahannam, siapa yang memenuhi seruan mereka, mereka akan menghempaskan orang itu ke pintu-pintu itu. Aku bertanya 'Ya Rasulullah, tolong beritahukanlah kami tentang ciri-ciri mereka! Nabi menjawab; Mereka adalah seperti kulit kita ini, juga berbicara dengan bahasa kita. Saya bertanya 'Lantas apa yang anda perintahkan kepada kami ketika kami menemui hari-hari seperti itu? Nabi menjawab; Hendaklah kamu selalu bersama jamaah muslimin dan imam mereka! Aku bertanya; kalau tidak ada jamaah muslimin dan imam bagaimana? Nabi menjawab; hendaklah kau jauhi seluruh firqah (kelompok-kelompok) itu, sekalipun kau gigit akar-akar pohon hingga kematian merenggutmu kamu harus tetap seperti itu",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 35
			}
		}
	]
}