{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7097,
			"arabicnumber": 7097,
			"text": "Telah menceritakan kepada kami [Sa'id bin Abu Maryam] Telah mengabarkan kepada kami [Muhammad bin Ja'far] dari [Syarik bin Abdullah] dari [Sa'id bin Al Musayyab] dari [Abu Musa Al Asy'ari] menuturkan, Nabi shallallahu 'alaihi wasallam suatu hari keluar ke sebuah kebun Madinah untuk suatu keperluannya, dan aku mengikuti di belakang beliau. Tatkala beliau masuk kebun, aku duduk di pintunya dan kukatakan dalam hati; 'Hari ini aku menjadi penjaga pintu Nabi shallallahu 'alaihi wasallam sekalipun beliau tidak memerintahkanku.' Nabi shallallahu 'alaihi wasallam terus pergi dan menuntaskan hajatnya, beliau duduk diatas emper sumur dan menyingkap kedua betisnya dan memasukkan keduanya ke dalam sumur (kolam). Abu Bakar datang dan meminta izin kepada beliau untuk masuk, maka aku berkata; 'kamu tetap di tempatmu sampai aku meminta izin untukmu! ' Abu bakar pun berhenti hingga aku menemui Nabi shallallahu 'alaihi wasallam dan kukatakan; 'ya Nabiyullah, Abu Bakar memintamu izin kepadamu.' Nabi menjawab: \"berilah dia izin, dan berilah kabar gembira kepadanya dengan surga!\" Abu bakar pun masuk kebun dan datang dari sebelah kanan Nabi shallallahu 'alaihi wasallam. Lalu ia menyingkap kedua betisnya dan masukkannya kedalam sumur (kolam). Kemudian datanglah Umar, maka aku berkata; 'kamu tetap di tempatmu sampai aku meminta izin untukmu! ' Nabi shallallahu 'alaihi wasallam lantas berkata; \"Berilah dia izin, dan berilah kabar gembira dengan surga, \" maka dia pun datang dari sebelah kiri Nabi shallallahu 'alaihi wasallam dan menyingkap kedua betisnya kemudian memasukkannya kedalam sumur, maka emperan sumur telah menjadi sesak, sehingga tak ada lagi ruangan sumur yang luang. Kemudian datanglah Utsman, maka aku katakan 'kamu tetap di tempatmu sampai aku meminta izin untukmu! ' Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Berilah dia izin, dan berilah kabar gembira dengan surga, dan bersama surga itu terdapat malapetaka yang akan menimpanya.\" Utsman pun masuk tetapi dia tidak menemukan tempat duduk bersama mereka maka dia pun berputar sehingga datang dari arah depan mereka di mulut sumur (kolam), kemudian dia menyingkap kedua betisnya dan memasukkan kedua kakinya kedalam sumur. Maka aku berkhayal saudaraku, dan aku berdoa kepada Allah agar cepat-cepat datang. Ibnul Musayyab berkata; 'maka aku takwilkan dari peristiwa itu, kuburan mereka akan menyatu disini, sedang kuburan Utsman akan tersendiri",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 48
			}
		}
	]
}