{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7294,
			"arabicnumber": 7294,
			"text": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri]. (dalam jalur lain disebutkan) telah menceritakan kepadaku [Mahmud] telah menceritakan kepada kami [Abdurrazaq] Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] telah mengabarkan kepadaku [Anas bin Malik] radliallahu 'anhu, Nabi shallallahu 'alaihi wasallam berangkat ketika matahari telah miring, lalu beliau shalat zhuhur, selesai salam beliau berdiri di atas mimbar dan mengingatkan kiamat, beliau ceritakan bahwa menjelang kiamat terjadi peristiwa-peristiwa besar, kemudian berkata: \"Siapa yang ingin bertanya sesuatu, silahkan! Demi Allah, tidaklah kalian bertanya kepadaku tentang sesuatu, selain kuberitakan kepada kalian selama aku masih berada di tempatku ini.\" Anas berkata, \"Lantas Orang-orang menangis terisak-isak dan Rasulullah shallallahu 'alaihi wasallam memperbanyak bertanya: \"Bertanyalah kalian kepadaku!\" Anas melanjutkan, \"Lantas ada seseorang berdiri menuju beliau dan bertanya, \"Dimanakah tempat tinggalku ya Rasulullah?\" Beliau menjawab: \"Kamu di neraka.\" Lantas Abdullah bin Khudzaifah berdiri dan bertanya, \"Siapa ayahku ya Rasulullah?\" Nabi menjawab: \"Ayahmu Hudzaifah.\" Anas melanjutkan perkataannya, \"Nabi memperbanyak bertanya: \"Bertanyalah kalian kepadaku, bertanyalah kalian kepadaku.\" Lantas Umar meletakkan kedua lututnya dan berkata, 'Kami ridla Allah sebagai Rabb, Islam sebagai agama, dan Muhammad shallallahu 'alaihi wasallam sebagai Rasul.\" Rasulullah shallallahu 'alaihi wasallam lantas terdiam ketika Umar mengucapkan yang demikian. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang diriku berada di tangan-Nya, tadi telah diperlihatkan kepadaku surga dan neraka dibalik tembok ini ketika aku shalat, dan belum pernah kulihat kebaikan dan keburukan seperti hari ini",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 25
			}
		}
	]
}