{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7305,
			"arabicnumber": 7305,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah menceritakan kepada kami [Al Laits] telah menceritakan kepadaku ['Uqail] dari [Ibn Syihab] berkata, telah mengabarkan kepadaku [Malik bin Aus an Nashri], dan [Muhammad bin Jubair bin Muth'im] pernah mengingatkan aku tentang hal itu. AKu menemui Malik dan aku bertanya kepadanya.\" Ia meneruskan, \"Aku terus bertolak hingga kutemui [Umar], kemudian penjaga rumahnya bertanya, \"Apakah engkau berkenan memberi ijin [Utsman], [Abdurrahman bin Auf], [Zubair], dan [Sa'd] untuk bertemu?\" Umar menjawab, \"Ya.\" Mereka pun masuk, mengucapkan salam dan duduk. Si penjaga pintu bertanya lagi, \"Apakah anda memberi ijin untuk [Ali] dan [Abbas]\" Umar pun mengijinkan keduanya. Abbas kemudian bertanya, \"Wahai Amirul Mukminin, putuskanlah antara aku dan orang yang zhalim yang mencela.\" Sekelompok orang yang di antaranya Utsman dan para sahabatnya kemudian berkata, \"Wahai Amirul Mukminin, putuskanlah antara keduanya dan nyamankanlah salah satunya dari yang lain.\" Umar menjawab, \"Tolong kalian yang bijak, aku bersumpah atas kalian dengan nama Allah yang karena ijin-Nya langit dan bumi tegak. Tahukah kalian bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: 'Kami tidak diwarisi, apa yang kami tinggalkan adalah sedekah (bukan warisan) '? Maka kumpulan sahabat tadi menjawab, \"Memang beliau pernah bersabda yang demikian ini.\" Umar lalu menemui Ali dan Abbas seraya berkata, \"Aku bersumpah atas kalian dengan nama Allah, bukankah kalian berdua tahu bahwa Rasulullah pernah bersabda yang sedemikian tadi?\" Keduanya menjawab, \"Ya.\" Umar lalu berkata, \"Karenanya aku sekarang bicara kepada kalian tentang masalah (harta nabi). Sesungguhnya Allah mengkhususkan hanya untuk rasul-Nya shallallahu 'alaihi wasallam dalam hal harta ini, suatu yang tak akan diberikan-Nya kepada seorang pun, sebab Allah berfirman: '(Apa yang Allah berikan kepada rasul-Nya dari para tawanan, yang kamu dapatkan dengan tanpa mengerahkan… dan seterusnya (Qs. Al Hasyr; 6), kesemuanya ini adalah khusus bagi Rasulullah shallallahu 'alaihi wasallam. Kemudian demi Allah, beliau tidak memberikannya dan tidak pula menganugerahkanya secara khusus untuk kalian. Dahulu Rasul telah memberikannya kepada kalian dan membagikannya di tengah-tengah kalian, hingga harta ini masih tersisa. Dan Nabi shallallahu 'alaihi wasallam memberi belanja tahunan kepada keluarganya dari harta ini, kemudian beliau tarik sisanya dan beliau jadikan sebagai harta Allah, dan begitulah beliau mengelola hartanya semasa hidupnya. Aku bersumpah atas kalian dengan nama Allah, bukankah kalian tahu terhadap itu semua? Mereka menjawab, \"Ya.\" Kemudian Umar berkata kepada Ali dan Abbas, \"Aku bersumpah atas kalian dengan nama Allah, bukankah kalian berdua tahu tentang ini semua?\" keduanya menjawab, \"Ya.\" Umar meneruskan bicaranya, \"Kemudian Allah mewafatkan nabi-Nya shallallahu 'alaihi wasallam, lantas Abu Bakar mengatakan aku adalah wali Rasulullah shallallahu 'alaihi wasallam sehingga Abu Bakar mewenanginya dan mengelolanya sebagaimana Rasulullah shallallahu 'alaihi wasallam mengelolanya, dan kamu ketika itu juga ada.\" Lantas Umar menghadap Ali dan Abbas dengan mengatakan, \"Kalian beranggapan bahwa Abu Bakar seperti ini dan seperti ini, padahal Allah tahu bahwa dia terhadap harta itu betul-betul jujur, baik, lurus, dan mengikuti kebenaran. Kemudian Allah mewafatkan Abu bakar, maka aku (Umar) katakan bahwa aku sekarang adalah wali Rasulullah shallallahu 'alaihi wasallam dan juga wali Abu bakar, maka aku mewenangi harta itu dua tahun yang aku kelola sebagaimana Rasulullah shallallahu 'alaihi wasallam dan Abu Bakar mengelola, lantas anehnya kalian berdua mendatangi aku sedang kalian kompak, sama-sama sepakat, kamu menemuiku untuk meminta bagianmu dari anak saudaramu (ucapan ini Umar tujukan kepada Abbas, sebab ia adalah paman Rasulullah), sedang si ini (maksudnya Ali) datang kepadaku memintaku bagian isterinya dari ayahnya (Ucapan ini Umar tujukan kepada Ali, sebab ia adalah menantu Rasulullah). Maka aku katakan, 'Jikalah kalian berkenan, harta itu aku serahkan kepada kalian berdua, hanya kalian harus menerima resiko tanggung jawab dari janji Allah dan ikrar-Nya, yaitu agar kalian berdua mengelolanya sebagaimana Rasulullah shallallahu 'alaihi wasallam mengelola, dan juga sebagaimana Abu Bakar mengelola, dan juga sebagaimana aku mengolala semenjak aku mewenanginya. Kalaulah kamu berdua tidak bisa, tolong jangan kalian berdua mengajakku bicara tentang harta itu, jangan kalian berdua berkata, 'Serahkan harta itu kepada kami berdua' lantas aku katakan, 'kuserahkan kepadamu berdua'. Adapun sekarang, aku bersumpah kepada kalian dengan nama Allah, bukankah telah aku serahkan sekarang kepada keduanya?\" Beberapa kumpulan sahabat yang hadir menjawab, \"Benar, \" lantas Umar menghadap Ali dan Abbas seraya berkata, \"Aku bersumpah atas kalian berdua (dengan nama Allah), bukankah telah aku serahkan kepada kalian berdua masalah harta itu?\" Keduanya menjawab, \"Benar.\" Umar kemudian berkata, \"Apakah kalian berdua mencari-cari keputusan selain itu setelah memperolehnya dariku? Demi Dzat yang karena seijin-Nya bumi dan langit menjadi tegak, selama-lamanya aku tidak akan memutuskan keputusan selain itu hingga kiamat tiba. Maka jika kalian berdua tidak mampu, serahkan saja kepadaku, sebab aku bisa mengganti kalian berdua",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 36
			}
		}
	]
}