{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7432,
			"arabicnumber": 7432,
			"text": "Telah menceritakan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Ayahnya] dari [Ibn Abu Nu'm] -atau Abu Nu'm, Qabishah masih ragu antara keduanya- dari [Abu Sa'id Al Khudzri] berkata, \"Beberapa potongan emas didatangkan kepada nabi shallallahu 'alaihi wasallam, lantas beliau membaginya di antara empat orang.\" Dan telah menceritakan kepadaku [Ishaq bin Nashr] telah menceritakan kepada kami ['Abdurrazaq] telah mengabarkan kepada kami [Sufyan] dari [Ayahnya] dari [Ibn Abu Nu'm] dari [Abu Sa'id Al Khudzri] berkata, \"Ali, yang ketika itu di Yaman mengirimkan beberapa potongan emas yang masih dengan tanahnya kepada nabi shallallahu 'alaihi wasallam, lantas beliau membagi-bagikannya antara Al aqra' bin Habis Al Hanzhali, lalu salah seorang Bani Majasyi', lalu 'Uyainah bin Badar Al Fazari, Alqamah bin 'Al Atsah Al 'Amiri, kemudian seorang Bani Kilab dan Zaid Al Khail Ath Thai, kemudian salah seorang Bani Nabhan. Maka beberapa orang qurasy dan Anshar pun marah, mereka berkata, 'Nabi berikan emas itu kepada pemuka-pemuka penduduk Nejed dan ia meninggalkan kita-kita'. Nabi terus berkata: 'Hanyasanya aku beri mereka untuk menjinakkan hati mereka.' Kemudian datanglah seseorang yang kedua matanya menjorok ke dalam, dahinya menjorok keluar, jenggotnya lebat, dua keningnya menjorok keluar dan berkepala gundul, orang itu kemudian berkata, 'Hai Muhammad, bertakwalah kepada Allah (maksudnya bertindaklah hati-hati dan adil)! ' Spontan Nabi shallallahu 'alaihi wasallam menjawab: \"Siapa lagi yang menaati Allah jika aku membangkang-Nya, sesungguhnya Allah telah memberiku kepercayaan untuk memimpin penduduk bumi sedang kalian tidak percaya kepadaku.\" Lantas ada seorang sahabat yang meminta beliau untuk membunuh orang itu, dan seingatku orang sahabat itu adalah Khalid bin Al Walid, namun nabi mencegahnya. Tatkala orang itu pergi nabi shallallahu 'alaihi wasallam bersabda: \"Diantara keturunan orang ini ada suatu kaum yang membaca al quran yang tidak melebihi tenggorokan mereka (membaca alquran tidak meresap dalam hati), mereka keluar dari Islam sebagaimana anak panah keluar dari busurnya, mereka membantai pemeluk Islam dan membiarkan pemuja patung-patung, kalaulah aku temui mereka, niscaya aku bunuh mereka sebagaimana pembunuhan terhadap kaum 'Ad",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 59
			}
		}
	]
}