{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7517,
			"arabicnumber": 7517,
			"text": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah] telah menceritakan kepadaku [Sulaiman] dari [Syarik bin Abdullah] berkata, \"Aku mendengar [Anas bin Malik] berkata, \"Tatkala Rasulullah shallallahu 'alaihi wasallam diisra'kan dari masjid Ka'bah, beliau didatangi oleh tiga orang -yang ketika itu beliau belum menerima wahyu- ketika di masjidil haram. Laki-laki pertama berkata, 'Mana orangnya? ' Laki-laki kedua berkata, 'Itu, orang terbaik di antara mereka! ' Lantas laki-laki ketiga berkata, 'Ambillah orang terbaik mereka', pada malam itu beliau tidak bisa melihat mereka bertiga. Hingga pada malam berikutnya mereka mendatangi beliau lagi, yang ketika itu hati (beliau) melihat, mata beliau tidur namun tidak untuk hatinya. Demikian pula para nabi, mata mereka tertidur namun hati mereka tidak tidur. Para malaikat itu tidak mengajak bicara beliau hingga mereka membawa dan meletakkan beliau di sisi sumur zamzam, Jibril lantas memimpin mereka untuk menyucikan nabi. Jibril kemudian membelah antara tenggorokan beliau hingga pangkal lehernya, sampai dadanya dan perutnya. Jibril kemudian memandikan beliau dengan air zamzam dengan tangannya hingga sampai pada bagian perut, setelah itu didatangkanlah bejana besar dari emas yang di dalamnya ada bejana yang terbuat dari tanah liat dari emas yang diisi dengan keimanan dan hikmah. Dengannya, Jibril mengisi dada dan urat-urat kerongkongannya lalu menjahitnya kembali. Kemudian Jibril membawanya ke langit dunia dan ia ketuk salah satu pintunya sehingga penghuni langit bertanya, 'Siapakah ini? ' Jibril berkata, 'Para malaikat bertanya, 'Siapa yang bersamamu? ' Jibril menjawab, 'Bersamaku Muhammad.' Penghuni langit bertanya, 'Dia telah diutus? ' Jibril menjawab, 'Benar.' Penghuni langit lalu berkata, 'Selamat datang, selamat atas kunjungannya.' Maka penghuni langit sedemikian bergembira, mereka tidak tahu apa yang Allah inginkan terhadap diri Muhammad di muka bumi, hingga Allah memberitahu mereka. Lantas di langit dunia nabi bertemu Adam, Jibril memperkenalkan kepada beliau, 'Ini adalah ayahmu, Adam. Ucapkanlah salam kepadanya. Dia (Muhammad) lalu mengucapkan salam yang kemudian dijawab oleh Adam seraya, 'Selamat datang, selamat berkunjung wahai anakku, sungguh engkau anak yang terbaik.' Ternyata di langit dunia ada dua sungai yang mengalir, Nabi Muhammad bertanya, 'Dua sungai apa ini wahai Jibril? ' Jibril menjawab, 'Ini adalah Nil dan Eufrat.' Kemudian Jibril terus membawa Nabi ke langit, tiba-tiba ada sungai lain yang di atasnya ada istana dari mutiara dan intan, Nabi memukulnya dengan tangannya, tiba-tiba baunya seperti minyak wangi adlfar. Nabi bertanya, 'Ini apa wahai Jibril? ' Jibril menjawab, 'Ini adalah telaga al Kautsar yang sengaja disimpan oleh Tuhanmu untukmu.' Kemudian Jibril membawanya naik ke langit kedua, dan malaikat bertanya kepadanya seperti yang ditanyakan malaikat pada langit pertama. Mereka bertanya, 'Siapa ini? ' Jibril menjawab, 'Ini Jibril.' Mereka bertanya lagi, 'Dan siapa ini yang bersamamu? ' Jibril menjawab, 'Muhammad shallallahu 'alaihi wasallam.' Mereka bertanya, 'Apakah dia telah diutus? ' Jibril menjawab, 'Benar.' Malaikat (langit tersebut) lalu berkata, 'Selamat datang, selamat atas kunjungannya.' Jibril kemudian membawanya naik ke langit ketiga dan para malaikat bertanya kepadanya sebagaimana yang ditanyakan malaikat di langit pertama dan kedua, kemudian Jibril membawanya naik ke langit keempat, dan mereka bertanya seperti halnya pertanyaan malaikat sebelumnya, setiap langit berisikan para nabi yang Jibril sebutkan nama-namanya. Dan seingatku di antara mereka ada Idris di langit kedua, Harun di langit keempat, dan lain di langit ke lima yang aku tak hapal namanya, Ibrahim di langit keenam, dan Musa di langit ketujuh karena diberi kelebihan bisa berbicara langsung dengan Allah. Lantas Musa berkata, 'Wahai Rabb, setahuku tak ada orang yang lebih ditinggikan daripada aku, ' kemudian Jibril membawanya naik di atas kesemuanya yang tidak satupun yang tahu selain Allah hingga tiba di Sidratul Muntaha. Kemudian Jibril mendekati Allah, Al Jabbar, Rabb pemilik kemuliaan, Nabi terus mendekat hingga jarak antara keduanya sebatas dua busur panah atau lebih dekat lagi, dan Allah memberinya wahyu, yang di antara wahyunya, Allah mewajibkan lima puluh kali shalat untuk umatmu (Muhammad) siang-malam. Kemudian Nabi turun hingga bertemu Musa, Musa menahannya dan berkata, 'Hai Muhammad, apa yang diikrarkan Tuhanmu kepadamu? ' Nabi menjawab, 'Allah mewajibkan aku untuk mendirikan lima puluh kali shalat sehari semalam.' Musa berkata, 'Umatmu tak bakalan kuat melakukan sedemikian itu, kembalilah kamu agar Tuhanmu memberi keringanan untkmu dan umatmu.' Maka Nabi menoleh ke Jibril seolah-olah meminta saran tentang saran Musa, dan Jibril memberi isyarat, 'Silahkan, kalau kau berkenan.' Maka Jibril kembali menaikannya ke Allah Yang Maha Jabbar yang ketika itu masih berada di singgahsana-Nya, Nabi katakan, 'Wahai Rabb, berilah kami keringanan, sebab umatku tak bakalan mampu melakukan shalat lima puluh kali dalam sehari! ' Lantas Allah mengurangi sepuluh kali, dan Nabi kembali bertemu Musa dan Musa menahannya, Musa terus-menerus membujuknya agar Nabi menegoisasi ulang kepada Rabbnya, sehingga Allah hanya mewajibkan lima kali shalat sehari-semalam. Musa kemudian menahannya ketika kewajiban shalat tinggal lima, Musa mengatakan, 'Hai Muhammad, pernah aku membujuk Bani Israil, kaumku, untuk suatu yang lebih rendah daripada ini namun mereka meninggalkannya, padahal umatmu lebih lemah fisiknya, badannya, hatinya, pandangan dan pendengarannya, maka temuilah kembali Rabbmu agar Dia memberi keringanan.' Dan atas semua instruksi itu, Nabi menoleh kepada Jibril untuk memberi saran, namun Jibril tidak membenci atas itu semua. Lantas Jibril kembali membawanya naik untuk kali kelima, lalu Nabi berkata, 'Ya Rabb, umatku adalah orang-orang lemah fisiknya, hatinya, pendengarannya, pandangannya, dan badannya, maka berilah kami keringanan.' Allah Yang Maha Jabbar menjawab, 'Hai Muhammad! ' Nabi menjawab, 'Aku penuhi panggilan-Mu.' Allah meneruskan firman-Nya, 'Sesungguhnya tidak ada lagi pergantian titah-Ku sebagaimana Aku wajibkan atasmu dalam ummul kitab.' Allah meneruskan titah-Nya, setiap satu kebaikan dibalas sepuluh kali lipatnya, maka lima kali shalat itu tercatat lima puluh kali dalam ummul kitab, sekalipun hanya dilaksanakan lima kali olehmu.' Maka Nabi kembali menemui Musa dan Musa bertanya, 'Apa yang telah kamu lakukan? ' Nabi menjawab, 'Allah betul-betul telah memberi kami keringanan, karena setiap kebaikan dibalas sepuluh kali lipatnya.' Musa berkata, 'Demi Allah, aku pernah membujuk bani israil untuk yang lebih remeh daripada itu namun mereka meninggalkannya, maka kembalilah kau temui Tuhanmu agar Dia memberi keringanan terhadapmu.' Rasulullah shallallahu 'alaihi wasallam menjawab, 'Hai Musa, demi Allah, aku telah malu kepada Tuhanku terhadap protes yang kulakukan terhadap-Nya.' Musa pun berkata, 'Baik kalau begitu, silahkan engkau turun dengan nama Allah.' Maka Nabi bangun (tidur) yang ketika itu beliau di Masjidil Haram",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 142
			}
		}
	]
}