{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7555,
			"arabicnumber": 7555,
			"text": "Telah menceritakan kepada kami [Abdullah bin Abdul Wahhab] telah menceritakan kepada kami ['Abdul Wahhab] telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah], dan [Al Qasim At Tamimi] dari [Zahdam] ia berkata, \"Antara penduduk Jurum dan orang-orang Asy'ari terdapat kecintaan dan persaudaraan. Ketika itu kami berada bersama [Abu Musa] Al Asy'ari, lantas seporsi hidangan didekatkan kepadanya yang di antaranya ada daging ayam. Sementara di sisi Abu Musa ada seorang laki-laki dari bani Taimullah - seorang mawali (bangsa non arab) -. Abu Musa pun mengundangnya.\" Zahdam berkata, \"Kulihat laki-laki dari bani Taimullah itu menyantap makanan yang kuanggap jijik sehingga saya bersumpah untuk tidak memakannya. Maka Abu Musa berkata, 'Hei, datanglah kemari, saya akan sampaikan kepada kalian sebuah hadits kepadamu! Sungguh akan saya ceritakan kepadamu tentang sumpahmu itu. Dahulu aku menemui nabi shallallahu 'alaihi wasallam bersama beberapa orang Asy'ari dengan harapan beliau bisa mengangkut kami dengan kendaraan, namun beliau bersumpah: 'Demi Allah, saya tidak akan mengangkut kalian, dan memang saya tidak punya kendaraan untuk mengangkut kalian.' Ternyata nabi kemudian memperoleh rampasan unta dan menanyakan kami dengan berujar: 'Mana orang-orang Asy'ari tadi? ' Beliau perintahkan agar kami diberi sekitar lima dzaud (satu dzaud antara tiga hingga sepuluh) unta yang putih punggungnya, kemudian kami pun berangkat. Dalam keberangkatan, kami berkata, 'Heih…apa yang kita perbuat ini? Kita telah tahu bahwa Rasulullah shallallahu 'alaihi wasallam telah bersumpah untuk tidak mengangkut kita yang ketika itu beliau tidak mempunyai kendaraan untuk mengangkut kita, namun sekarang beliau menyediakan kendaraan untuk kita. Rupanya Rasulullah shallallahu 'alaihi wasallam lalai terhadap sumpahnya atas kita, demi Allah, kalau demikian, kita tak bakalan aman! Kami pun pulang dan kami temui beliau dan kami utarakan uneg-uneg kami. Beliau lalu bersabda: 'Bukan saya yang menyediakan kendaraan untuk kalian, namun Allah sematalah yang menyediakan kendaraan untuk mengangkut kalian. Demi Allah, tidaklah saya bersumpah kemudian aku melihat yang lebih baik dari sumpah tersebut, kecuali aku akan melakukan yang lebih baik dan kubayar kaffarat sumpahku",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 180
			}
		}
	]
}