{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"27": "Fara'id"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1076,
			"arabicnumber": 1076,
			"text": "Yahya related to me from Malik that he had heard that Sulayman ibn Yasar said, ''Umar ibn al-Khattab, Uthman ibn Affan, andZayd ibn Thabit gave the grandfather a third with full siblings\". Malik said, \"The generally agreed on way of doing things among us and what I have seen the people of knowledge in our city doing is that the paternal grandfather does not inherit anything at all with the father. He is given a sixth as a fixed share with the son and the grandson through a son. Other than that, when the deceased does not leave a mother or a paternal aunt, one begins with whoever has a fixed share, and they are given their shares. If there is a sixth of the property left over, the grandfather is given a sixth as a fixed share.\" Malik said, \"When someone shares with the grandfather and the full siblings in a specified share, one begins with whoever shares with them of the people of fixed shares. They are given their shares. What is left over after that belongs to the grandfather and the full siblings. Then one sees which is the more favourable of two alternatives for the portion of the grandfather. Either a third is allotted to him and the siblings to divide between them, and he gets a share as if he were one of the siblings, or else he takes a sixth from all the capital. Whichever is the best portion for the grandfather is given to him. What is left after that, goes to the full siblings. The male gets the portion of two females except in one particular case. The division in this case is different from the preceding one. This case is when a woman dies and leaves a husband, mother, full sister and grandfather. The husband gets a half, the mother gets a third, the grandfather gets a sixth, and the full sister gets a half. The sixth of the grandfather and the half of the sister are joined and divided into thirds. The male gets the share of two females. Therefore, the grandfather has two thirds, and the sister has one third.\" Malik said, \"The inheritance of the half-siblings by the father with the grandfather when there are no full siblings with them, is like the inheritance of the full siblings (in the same situation). The males are the same as their males and the females are the same as their females. When there are both full siblings and half-siblings by the father, the full siblings include in their number the number of half-siblings by the father, to limit the inheritance of the grandfather, i.e., if there was only one full sibling with the grandfather. They would share, after the allotting of the fixed shares, the remainder of the inheritance between them equally. If there were also two half-siblings by the father, their number is added to the division of the sum, which would then be divided four ways. A quarter going to the grandfather and three-quarters going to the full siblings who annex the shares technically allotted to the half-siblings by the father. They do not include the number of half-siblings by the mother, because if there were only half-siblings by the father they would not inherit anything with the grandfather and all the capital would belong to the grandfather, and so the siblings would not get anything after the portion of the grandfather. \"It belongs to the full siblings more than the half-siblings by the father, and the half-siblings by the father do not get anything with them unless the full siblings consist of one sister. If there is one full sister, she includes the grandfather with the half-siblings by her father in the division, however many. Whatever remains for her and these half-siblings by the father goes to her rather than them until she has had her complete share, which is half of the total capital. If there is surplus beyond half of all the capital in what she and the half-siblings by the father acquire it goes to them. The male has the portion of two females. If there is nothing left over, they get nothing",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1076
			}
		}
	]
}