{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"27": "Fara'id"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1080,
			"arabicnumber": 1080,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam that Umar ibn al-Khattab asked the Messenger of Allah, may Allah bless him and grant him peace, about someone who died without parents or offspring, and the Messenger of Allah, may Allah bless him and grant him peace, said to him, \"The ayat which was sent down in the summer at the end of the Surat an-Nisa (Sura 4) is enoughfor you.\" Malik said, \"The generally agreed on way of doing things among us, in which there is no dispute, and which I saw the people of knowledge in our city doing, is that the person who leaves neither parent or offspring can be of two types. As for the kind described in the ayat which was sent down at the beginning of the Surat an-Nisa in which Allah, the Blessed, the Exalted! said, 'If a man or a woman has no direct heir, but has a brother or a sister by the mother, each of the two has a sixth. If there are more than that, they share equally in a third.' (Sura 4 ayat 12) This heirless one does not have heirs among his mother's siblings since there are no children or parents. As for the other kind described in the ayat which comes at the end of the Surat an-Nisa, Allah, the Blessed, the Exalted, said in it, 'They will ask you for a decision. Say, \"Allah gives you a decision about the indirect heirs. If a man perishes having no children, but he has a sister, she shall receive a half of what he leaves, and he is her heir if she has no children. If there are two sisters, they shall receive two-thirds of what he leaves. If there are brothers and sisters, the male shall receive the portion of two females. Allah makes clear to you that you might not go astray. Allah has knowledge of everything\" ' \" (Sura 4 ayat 176). Malik said, \"If this person without direct heirs (parents) or children has siblings by the father, they inherit with the grandfather from the person without direct heirs. The grandfather inherits with the siblings because he is more entitled to the inheritance than them. That is because he inherits a sixth with the male children of the deceased when the siblings do not inherit anything with the male children of the deceased. How can he not be like one of them when he takes a sixth with the children of the deceased? How can he not take a third with the siblings while the brother's sons take a third with them? The grandfather is the one who overshadows the half-siblings by the mother and keeps them from inheriting. He is more entitled to what they have because they are omitted for his sake. If the grandfather did not take that third, the half-siblings by the mother would take it and would take what does not return to the half-siblings by the father. The half-siblings by the mother are more entitled to that third than the half-siblings by the father while the grandfather is more entitled to that than the half- siblings by the mother",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1080
			}
		}
	]
}