{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"28": "Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "Malik related to me from Ibn Shihab that he had heard that in the time of the Messenger of Allah, may Allah bless him and grant him peace, women were becoming muslim in their own lands and they did not do hijra while their husbands were still kafirun although they themselves had become muslim. Among them was the daughter of al-Walid ibn al-Mughira and she was the wife of Safwan ibn Umayya. She became muslim on the day of the conquest (of Makka), and her husband, Safwan ibn Umayya fled from Islam. The Messenger of Allah, may Allah bless him and grant him peace, sent Safwan's paternal cousin, Wahb ibn Umayr with the cloak of the Messenger of Allah, may Allah bless him and grant him peace, as a safe-conduct for Safwan ibn Umayya, and the Messenger of Allah, may Allah bless him and grant him peace, called him to Islam and asked for him to come to him and if he was pleased with the matter to accept it. If not he would have a respite for two months. When Safwan came to the Messenger of Allah, may Allah bless him and grant him peace, with his cloak, he called out to him over the heads of the people, \"Muhammad! Wahb ibn Umayr brought me your cloak and claimed that you had summoned me to come to you and if I was pleased with the matter, I should accept it and if not, you would give me a respite for two months. \"The Messenger of Allah, may Allah bless him and grant him peace, said, \"Come down, Abu Wahb.\" He said, \"No, by Allah! I will not come down until you make it clear to me.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"You have a respite of four months.\" The Messenger of Allah, may Allah bless him and grant him peace, went out toward Hawazin at Hunayn. He sent to Safwan ibn Umayya to borrow some equipment and arms that he had. Safwan said, \"Willingly or unwillingly?\" He said, \"Willingly.\" Therefore he lent him the equipment and arms which he had. Then Safwan went out with the Messenger of Allah, may Allah bless him and grant him peace, while he was still a kafir. He was present at the battles of Hunayn and at-Ta'if while he was still a kafir and his wife was a muslim. The Messenger of Allah, may Allah bless him and grant him peace, did not separate Safwan and his wife until he had become muslim, and his wife was settled with him by that marriage",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1136
			}
		}
	]
}