{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"29": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1170,
			"arabicnumber": 1170,
			"text": "Yahya related to me from Malik that he had heard that Marwan ibn al-Hakam decided about a man who had made a vow to abstain from intercourse with his wife, that when four months had passed, it was a divorce and he could return to her as long as she was in her idda. Malik added, \"That was also the opinion of Ibn Shihab.\" Malik said that if a man made a vow to abstain from intercourse with his wife and at the end of four months he declared his intent to continue to abstain, he was divorced. He could go back to his wife, but if he did not have intercourse with her before the end of her idda, he had no access to her and he could not go back to her unless he had an excuse - illness, imprisonment, or a similar excuse. His return to her maintained her as his wife. If her idda passed and then he married her after that and did not have intercourse with her until four months had passed and he declared his intent to continue to abstain, divorce was applied to him by the first vow. If four months passed, and he had not returned to her, he had no idda against her nor access because he had married her and then divorced her before touching her. Malik said that a man who made a vow to abstain from intercourse with his wife and continued to abstain after four months and so divorced her, but then returned and did not touch her and four months were completed before her idda was completed, did not have to declare his intent and divorce did not befall him. If he had intercourse with her before the end of her idda, he was entitled to her. If her idda passed before he had intercourse with her, he had no access to her. This is what Malik preferred of what he had heard on the subject. Malik said that if a man made a vow to abstain from intercourse with his wife and then divorced her, and the four months of the vow were completed before completion of the idda of the divorce, it counted as two pronouncements of divorce. If he declared his intention to continue to abstain and the idda of the divorce finished before the four months the vow of abstention was not a divorce. That was because the four months had passed and she was not his on that day. Malik said, \"If someone makes a vow not to have intercourse with his wife for a day or a month and then waits until more than four months have passed, it is not ila. Ila only applies to someone who vows more than four months. As for the one who vows not to have intercourse with his wife for four months or less than that, I do not think that it is ila because when the term enters into it at which it stops, he comes out of his oath and he does not have to declare his intention.\" Malik said, \"If someone vows to his wife not to have intercourse with her until her child has been weaned, that is not ila. I have heard that Ali ibn Abi Talib was asked about that and he did not think that it was ila",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1170
			}
		}
	]
}