{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"29": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1188,
			"arabicnumber": 1188,
			"text": "Yahya related to me from Malik from Ibn Shihab that Sahl ibn Sad as-Saidi told him that Uwaymir al-Ajlani came to Asim ibn Adi al- Ansari and said to him, \"Asim! What do you think a man who finds another man with his wife should do? Should he kill him and then be killed himself, or what should .he do? Asim! ask the Messenger of Allah, may Allah bless him and grant him peace, about that for me.\" Asim asked the Messenger of Allah, may Allah bless him and grant him peace, about it. The Messenger of Allah, may Allah bless him and grant him peace, was revolted by the questions and reproved them until what he heard from the Messenger of Allah, may Allah bless him and grant him peace. was intolerable for Asim. When Asim returned to his people, Uwaymir came to him and said, \" Asim! what did the Messenger of Allah, may Allah bless him and grant him peace, say to you?\" Asim said to Uwaymir, \"You didn't bring me any good. The Messenger of Allah, may Allah bless him and grant him peace, was revolted by the question which I asked him.\" Uwaymir said, \"By Allah! I will not stop until I ask him about it!\" Uwaymir stood up and went to the Messenger of Allah, may Allah bless him and grant him peace, in the middle of the people and said, \"Messenger of Allah! What do you think a man who finds another man with his wife should do? Should he kill him and then be killed himself, or what should he do?\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"Something has been sent down about you and your wife, so go and bring her.\" Sahl continued, \"They mutually cursed one another in the presence of the Messenger, may Allah bless him and grant him peace, and I was present with the people. When they finished cursing each other, Uwaymir said, 'I shall have lied about her, Messenger of Allah, if I keep her,' and pronounced the divorce three times before the Messenger of Allah, may Allah bless him and grant him peace, ordered him to do it.\" Malik said that Ibn Shihab said, \"That was how the sunna of a couple mutually cursing each other was established (lian)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1188
			}
		}
	]
}