{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"29": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1189,
			"arabicnumber": 1189,
			"text": "Yahya related to me from Malik from Nafic from Abdullah ibn Umar that a man cursed his wife in the time of the Messenger of Allah, may Allah bless him and grant him peace, and disowned her child. The Messenger of Allah, may Allah bless him and grant him peace, separated them and gave the child to the woman. Malik said, \"Allah the Blessed, the Exalted, said, 'The testimony of men who accuse their wives but do not have any witnesses except themselves is to testify by Allah four times that he is being truthful, and a fifth time, that the curse of Allah will be upon him, if he should be a liar. She will avoid punishment if she testifies by Allah four times that he is a liar, and a fifth time, that the wrath of Allah shall be upon her, if he should be telling the truth. ' \"(Sura 24 ayat 6). Malik said, \"The sunna with us is that those who curse each other are never to be remarried. If the man calls himself a liar, (i.e. takes back his accusation), he is flogged with the hadd-punishment, and the child is given to him, and his wife can never return to him. There is no doubt or dispute about this sunna among us. \" Malik said, \"If a man separates from his wife by an irrevocable divorce by which he cannot return to her, and then he denies the paternity of the child she is carrying, whilst she claims that he is the father, and it is possible by the timing, that he be so, he must curse her, and the child is not recognised as his.\" Malik said, \"That is what is done among us, and it is what I have heard from the people of knowledge.\" Malik said that a man who accused his wife after he had divorced her trebly while she was pregnant, and he had at first accepted being the father but then claimed that he had seen her committing adultery before he separated from her, was flogged with the hadd-punishment, and did not curse her. If he denied the paternity of her child after he had divorced her trebly, and he had not previously accepted it, then he cursed her. Malik said, \"This is what I have heard.\" Malik said, \"The slave is in the same position as the free man as regards making accusations and invoking mutual curses (lian). He acts in the lian as the free man acts although there is no hadd applied for slandering a female-slave.\" Malik said, \"The muslim slave-girl and the christian and jewish free woman also do lian when a free muslim marries one of them and has intercourse with her. That is because Allah - may He be blessed and Exalted, said in His Book, 'As for those who accuse their wives,' and they are their wives. This is what is done among us. Malik said that a man who did the lian with his wife, and then stopped and called himself a liar after one or two oaths and he had not cursed himself in the fifth one, had to be flogged with the hadd-punishment, but they did not have to be separated. Malik said that if a man divorced his wife and then after three months the woman said, \"I am pregnant,\" and he denied paternity, then he had to do lian. Malik said that the husband of a female slave who pronounced the lian on her and then bought her, was not to have intercourse with her, even if he owned her. The sunna which had been handed down about a couple who mutually cursed each other in the lian was that they were never to return to each other. Malik said that when a man pronounced the lian against his wife before he had consummated the marriage, she only had half of the bride price",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1189
			}
		}
	]
}