{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"30": "Suckling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1284,
			"arabicnumber": 1284,
			"text": "Yahya related to me from Malik from Ibn Shihab that he was asked about the suckling of an older person. He said, ''Urwa ibn az-Zubayr informed me that Abu Hudhayfa ibn Utba ibn Rabia, one of the companions of the Messenger of Allah, may Allah bless him and grant him peace, who was present at Badr, adopted Salim (who is called Salim, the mawla of Abu Hudhayfa) as the Messenger of Allah, may Allah bless him and grant him peace, adopted Zayd ibn Haritha. He thought of him as his son, and Abu Hudhayfa married him to his brother's sister, Fatima bint al-Walid ibn Utba ibn Rabia, who was at that time among the first emigrants. She was one of the best unmarried women of the Quraysh. When Allah the Exalted sent down in His Book what He sent down about Zayd ibn Haritha, 'Call them after their true fathers. That is more equitable in the sight of Allah. If you do not know who their fathers were then they are your brothers in the deen and your mawali,' (Sura 33 ayat 5) people in this position were traced back to their fathers. When the father was not known, they were traced to their mawla. \"Sahla bint Suhayl who was the wife of Abu Hudhayfa, and one of the tribe of Amr ibn Luayy, came to the Messenger of Allah, may Allah bless him and grant him peace, and said, 'Messenger of Allah! We think of Salim as a son and he comes in to see me while I am uncovered. We only have one room, so what do you think about the situation?' The Messenger of Allah, may Allah bless him and grant him peace, said, 'Give him five drinks of your milk and he will be mahram by it.' She then saw him as a foster son. A'isha umm al-muminin took that as a precedent for whatever men she wanted to be able to come to see her. She ordered her sister, Umm Kulthum bint Abi Bakr as-Siddiq and the daughters of her brother to give milk to whichever men she wanted to be able to come in to see her. The rest of the wives of the Prophet, may Allah bless him and grant him peace, refused to let anyone come in to them by such nursing. They said, 'No! By Allah! We think that what the Messenger of Allah, may Allah bless him and grant him peace, ordered Sahla bint Suhayl to do was only an indulgence concerning the nursing of Salim alone. No! By Allah! No one will come in upon us by such nursing!' \"This is what the wives of the Prophet, may Allah bless him and grant him peace, thought about the suckling of an older person",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 1284
			}
		}
	]
}