{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "Yahya related to me from Malik that he had heard that Muhammad Sirin used to say, \"Do not sell grain on the ears until it is white.\" Malik said, \"If someone buys food for a known price to be delivered at a stated date, and when the date comes, the one who owes the food says, 'I do not have any food, sell me the food which I owe you with delayed terms.' The owner of the food says, 'This is not good, because the Messenger of Allah, may Allah bless him and grant him peace, forbade selling food until the deal was completed.' The one who owes the food says to his creditor, 'Sell me any kind of food on delayed terms until I discharge the debt to you.' This is not good because he gives him food and then he returns it to him. The gold which he gave him becomes the price of that which is his right against him and the food which he gave him becomes what clears what is between them. If they do that, it becomes the sale of food before the deal is complete.\" Malik spoke about a man who was owed food which he had purchased from a man and this man was owed the like of that food by another man. The one who owed the food said to his creditor, \"I will refer you to my debtor who owes me the same amount of food as I owe you, so that you may obtain the food which I owe you .\" Malik said, \"If the man who had to deliver the food, had gone out, and bought the food to pay off his creditor, that is not good. That is selling food before taking possession of it. If the food is an advance which falls due at that particular time, there is no harm in paying off his creditor with it because that is nota sale. It is not halal to sell food before receiving it in full since the Messenger of Allah, may Allah bless him and grant him peace, forbade that. However, the people of knowledge agree that there is no harm in partnership, transfer of responsibility and revocation in sales of food and other goods.\" Malik said, \"That is because the people of knowledge consider it as a favour rendered. They do not consider it as a sale. It is like a man lending light dirhams. He is then paid back in dirhams of full weight, and so gets back more than he lent. That is halal for him and permitted. Had a man bought defective dirhams from him as being the full weight, that would not be halal. Had it been stipulated to him that he lend full weight in dirhams, and then he gave faulty ones, that would not be halal for him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1344
			}
		}
	]
}