{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1362,
			"arabicnumber": 1362,
			"text": "Yahya related to me from Malik from Abu Hazim ibn Dinar from Said ibn al-Musayyab that the Messenger of Allah, may Allah bless him and grant him peace, forbade the sale with uncertainty in it. Malik said, \"An example of one type of uncertain transaction and risk is that a man intends the price of a stray animal or escaped slave to be fifty dinars. A man says, 'I will take him from you for twenty dinars.' If the buyer finds him, thirty dinars goes from the seller, and if he does not find him, the seller takes twenty dinars from the buyer.\" Malik said, \"There is another fault in that. If that stray is found, it is not known whether it will have increased or decreased in value or what defects may have befallen it. This transaction is greatly uncertain and risky.\" Malik said, \"According to our way of doing things, one kind of uncertain transaction and risk is selling what is in the wombs of females - women and animals - because it is not known whether or not it will come out, and if it does come out, it is not known whether it will be beautiful or ugly, normal or disabled, male or female. All that is disparate. If it has that, its price is such-and-such, and if it has this, its price is such-and-such.\" Malik said, \"Females must not be sold with what is in their wombs excluded. That is that, for instance, a man says to another, 'The price of my sheep which has much milk is three dinars. She is yours for two dinars while I will have her future offspring.' This is disapproved because it is an uncertain transaction and a risk.\" Malik said, \"It is not halal to sell olives for olive oil or sesame for sesame oil, or butter for ghee because muzabana comes into that, because the person who buys the raw product for something specified which comes from it, does not know whether more or less will come out of that, so it is an uncertain transaction and a risk.\" Malik said, \"A similar case is the selling of ben-nuts for ben-nut oil. This is an uncertain transaction because what comes from the ben-nut is ben-oil. There is no harm in selling ben-nuts for perfumed ben because perfumed ben has been perfumed, mixed and changed from the state of raw ben-nut oil.\" Malik, speaking about a man who sold goods to a man on the provision that there was to be no loss for the buyer, (i.e. if the buyer could not re-sell the goods they could go back to the seller), said, \"This transaction is not permitted and it is part of risk. The explanation of why it is so, is that it is as if the seller hired the buyer for the profit if the goods make a profit. If he sells the stock at a loss, he has nothing, and his efforts are not compensated. This is not good. In such a transaction, the buyer should have a wage according to the work that he has contributed. Whatever there is of loss or profit in those goods is for and against the seller. This is only when the goods are gone and sold. If they do not go, the transaction between them is null and void.\" Malik said, \"As for a man who buys goods from a man and he concludes the sale and then the buyer regrets and asks to have the price reduced and the seller refuses and says, 'Sell it and I will compensate you for any loss.' There is no harm in this because there is no risk. It is something he proposes to him, and their transaction was not based on that. That is what is done among us",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1362
			}
		}
	]
}