{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "Malik related to me from Musa ibn Maysara that he heard a man ask Said ibn al-Musayyab, \"I am a man who sells for a debt.\" Said said, \"Do not sell except for what you take to your camel.\" Malik spoke about a person who bought goods from a man provided that he provide him with those goods by a specific date, either in time for a market in which he hoped for their saleability, or to fulfil a need at the time he stipulated. Then the seller failed him about the date, and the buyer wanted to return those goods to the seller. Malik said, \"The buyer cannot do that, and the sale is binding on him. If the seller does bring the goods before the completion of the term, the buyer cannot be forced to take them.\" Malik spoke about a person who bought food and measured it. Then some one came to him to buy it and he told him that he had measured it for himself and taken it in full. The new buyer wanted to trust him and accept his measure. Malik said, \"Whatever is sold in this way for cash has no harm in it but whatever is sold in this way on delayed terms is disapproved of until the new buyer measures it out for himself. The sale with delayed terms is disapproved of because it leads to usury and it is feared that it will be circulated in this way without weight or measure. If the terms are delayed it is disapproved of and there is no disagreement about that with us.\" Malik said, \"One should not buy a debt owed by a man whether present or absent, without the confirmation of the one who owes the debt, nor should one buy a debt owed to a man by a dead person even if one knows what the deceased man has left. That is because to buy that is an uncertain transaction and one does not know whether the transaction will be completed or not completed.\" He said, \"The explanation of what is disapproved of in buying a debt owed by someone absent or dead, is that it is not known what unknown debtor may be connected to the dead person. If the dead person is liable for another debt, the price which the buyer gave on strength of the debt may become worthless.\" Malik said, \"There is another fault in that as well. He is buying something which is not guaranteed for him, and so if the deal is not completed, what he paid becomes worthless. This is an uncertain transaction and it is not good.\" Malik said, \"One distinguishes between a man who is only selling what he actually has and a man who is being paid in advance for something which is not yet in his possession. The man advancing the money brings his gold which he intends to buy with. The seller says, 'This is 10 dinars. What do you want me to buy for you with it?' It is as if he sold 10 dinars cash for 15 dinars to be paid later. Because of this, it is disapproved of. It is something leading to usury and fraud",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1370
			}
		}
	]
}