{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"36": "Judgements"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1408,
			"arabicnumber": 1408,
			"text": "Malik related to me that he heard that Abu Salama ibn Abd ar- Rahman and Sulayman ibn Yasar were both asked, \"Does one pronounce judgement on the basis of an oath with one witness?\" They both said, \"Yes.\" Malik said, \"The precedent of the sunna in judging by an oath with one witness is that if the plaintiff takes an oath with his witness, he is confirmed in his right. If he draws back and refuses to take an oath, the defendant is made to take an oath. If he takes an oath, the claim against him is dropped. If he refuses to take an oath, the claim is confirmed against him.\" Malik said, \"This procedure pertains to property cases in particular. It does not occur in any of the hadd-punishments, nor in marriage, divorce, freeing slaves, theft or slander. If some one says, 'Freeing slaves comes under property,' he has erred. It is not as he said. Had it been as he said, a slave could take an oath with one witness, if he could find one, that his master had freed him. \"However, when a slave lays claim to a piece of property, he can take an oath with one witness and demand his right as the freeman demands his right.\" Malik said, \"The sunna with us is that when a slave brings somebody who witnesses that he has been set free, his master is made to take an oath that he has not freed him, and the slave's claim is dropped.\" Malik said, \"The sunna about divorce is also like that with us. When a woman brings somebody who witnesses that her husband has divorced her, the husband is made to take an oath that he has not divorced her. If he takes the oath, the divorce does not proceed . \" Malik said, \"There is only one sunna of bringing a witness in cases of divorce and freeing a slave. The right to make an oath only belongs to the husband of the woman, and the master of the slave. Freeing is a hadd matter, and the testimony of women is not permitted in it because when a slave is freed, his inviolability is affirmed and the hadd punishments are applied for and against him. If he commits fornication and he is a muhsan, he is stoned. If he kills a slave, he is killed for it. Inheritance is established for him, between him and whoever inherits from him. If somebody disputes this, arguing that if a man frees his slave and then a man comes to demand from the master of the slave payment of a debt, and a man and two women testify to his right, that establishes the right against the master of the slave so that his freeing him is cancelled if he only has the slave as property, inferring by this case that the testimony of women is permitted in cases of setting free. The case is not as he suggests (i.e. it is a case of property not freeing). It is like a man who frees his slave, and then the claimant of a debt comes to the master and takes an oath with one witness, demanding his right. By that, the freeing of the slave would be cancelled. Or else a man comes who has frequent dealings and transactions with the master of the slave. He claims that he is owed money by the master of the slave. Someone says to the master of the slave, 'Take an oath that you don't owe what he claims'. If he draws back and refuses to take an oath, the one making the claim takes an oath and his right against the master of the slave is confirmed. That would cancel the freeing of the slave if it is confirmed that property is owed by the master.\" Malik said, \"It is the same case with a man who marries a slave-girl and then the master of the slave-girl comes to the man who has married her and claims, 'You and so-and-so have bought my slave-girl from me for such an amount of dinars. The husband of the slave-girl denies that. The master of the slave-girl brings a man and two women and they testify to what he has said. The sale is confirmed and his claim is considered true. So the slave-girl is haram for her husband and they have to separate, even though the testimony of women is not accepted in divorce.\" Malik said, \"It is also the same case with a man who accuses a free man, so the hadd falls on him. A man and two women come and testify that the one accused is a slave. That would remove the hadd from the accused after it had befallen him, even though the testimony of women is not accepted in accusations involving hadd punishments.\" Malik said, \"Another similar case in which judgement appears to go against the precedent of the sunna is that two women testify that a child is born alive and so it is necessary for him to inherit if a situation arises where he is entitled to inherit, and the child's property goes to those who inherit from him, if he dies, and it is not necessary that the two women witnesses should be accompanied by a man or an oath even though it may involve vast properties of gold, silver, live-stock, gardens and slaves and other properties. However, had two women testified to one dirham or more or less than that in a property case, their testimony would not affect anything and would not be permitted unless there was a witness or an oath with them.\" Malik said, \"There are people who say that an oath is not acceptable with only one witness and they argue by the word of Allah the Blessed, the Exalted, and His word is the Truth, 'And call in to witness two witnesses, men; or if the two be not men, then one man and two women, such witnesses as you approve of.' (Sura 2 ayat 282). Such people argue that if he does not bring one man and two women, he has no claim and he is not allowed to take an oath with one witness.\" Malik said, \"Part of the proof against those who argue this, is to reply to them, 'Do you think that if a man claimed property from a man, the one claimed from would not swear that the claim was false?' If he swears, the claim against him is dropped. If he refuses to take an oath, the claimant is made to take an oath that his claim is true, and his right against his companion is established. There is no dispute about this with any of the people nor in any country. By what does he take this? In what place in the Book of Allah does he find it? So if he confirms this, let him confirm the oath with one witness, even if it is not in the Book of Allah, the Mighty, the Majestic! It is enough that this is the precedent of the sunna. However, man wants to recognise the proper course of action and the location of the proof. In this there is a clarification for what is obscure about that, if Allah ta'ala wills",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1408
			}
		}
	]
}