{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"36": "Judgements"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1439,
			"arabicnumber": 1439,
			"text": "Yahya said that he heard Malik say, \"What is done in our community about injury to a domestic animal, is that the one who injures it must pay the amount by which he has diminished the animal's price.\" Yahya said that he heard Malik speak about a camel who attacked a man and he feared for himself and killed it or hamstrung it. He said, \"If he has a clear proof that it was heading for him and had attacked him, there are no damages against him. If there is no clear proof except his word, he is responsible for the camel.\" Yahya related that he heard Malik say that if a man gave a washer a garment to dye and he dyed it, and then the owner of the garment said, \"I did not order you to use this dye,\" and the washer protested that he had done so, then the washer was to be believed. It was the same with the tailor and the gold-smith. They took an oath about it unless they produced something they would not normally have been employed to do. In that situation their statement was not allowed and the owner of the garment had to take an oath . If he rejected it and refused to swear, then the dyer was made to take an oath. Yahya said, \"I heard Malik speak about a dyer who was given a garment and he made a mistake and gave it to another man and the one to whom he gave it wore it. He said, 'The one who wore it has no damages against him, and the washer pays damages to the owner of the garment. That is when the man wears the garment which was given him without recognizing that it is not his. If he wears it knowing that it is not his garment, he is responsible for it.' \" Yahya said that he heard Malik say, \"What is done in our community about a man who refers a creditor to another man for the debt he owes him is that if the one referred to goes bankrupt or dies, and does not leave enough to pay the debt, then the creditor has nothing against the one who referred him and the debt does not return to the first party.\" Malik said, \"This is the way of doing things about which there is no dispute in our community.\" Malik said, \"If a man has his debt to somebody taken on for him by another man and then the man who took it on dies or goes bankrupt, then whatever was taken on by him returns to the first debtor.\" Yahya said that he heard Malik say, \"If a man buys a garment which has a defect, a burn or something else, which the seller knows about and that is testified against him or he confirms it, and the man who has bought it causes a new tear which decreases the price of the garment, and then he learns about the original defect, he can return it to the seller and he is not liable for his tearing it. \"If a man buys a garment which has a defect of a burn or flaw, and the one who sold it to him claims that he did not know about it, and the buyer has cut the garment or dyed it, then the buyer has an option . If he wishes, he can have a reduction according to what the burn or flaw detracts from the price of the garment and he can keep the garment, or if he wishes to pay damages for what the cutting or dyeing has decreased of the price of the garment and return it, he can do so. \"If the buyer has dyed the garment with a dye which increases the value, the buyer has an option. If he wishes, he has a reduction from the price of the garment according to what the defect diminishes or if he wishes to become a partner with the one who sold the garment he does so. The price of the garment with a burn or flaw is looked at. If the price is ten dirhams, and the amount by which the dyeing increased the value is five dirhams, then they are partners in the garment, each according to his share. In this reckoning is the amount by which the dyeing increases the price of the garment.\" Yahya related to us from Malik from Ibn Shihab from Humayd ibn Abd ar-Rah man ibn Awf and from Muhammad ibn an-Numan ibn Bashir that they related to him that an-Numan ibn Bashir said that his father Bashir brought him to the Messenger of Allah, may Allah bless him and grant him peace, and said, \"I have given this son of mine one of my slaves.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"Have you given each of your children the same as this?\" He said, \"No.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"Then take the slave back",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1439
			}
		}
	]
}