{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"36": "Judgements"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1442,
			"arabicnumber": 1442,
			"text": "Yahya said that he heard Malik say, \"What is done in our community about some one who gives a gift not intending a reward is that he calls witnesses to it. It is affirmed for the one to whom it has been given unless the giver dies before the one to whom it was given receives the gift.\" He said, \"If the giver wants to keep the gift after he has had it witnessed, he cannot. If the recipient claims it from him, he takes it.\" Malik said, \"If some one gives a gift and then withdraws it and the recipient brings a witness to testify for him that he was given the gift, be it goods, gold, silver or animals, the recipient is made to take an oath. If he refuses, the giver is made to take an oath. If he also refuses to take an oath, he gives to the recipient what he claims from him if he has at least one witness. If he does not have a witness, he has nothing . \" Malik said, \"If someone gives a gift not expecting anything in return and then the recipient dies, the heirs are in his place. If the giver dies before the recipient has received his gift, the recipient has nothing. That is because he was given a gift which he did not take possession of. If the giver wants to keep it, and he has called witnesses to the gift, he cannot do that. If the recipient claims his right he takes it.\" Malik related to me from Da'ud ibn al-Husayn from Abu Ghatafan ibn Tarif al-Muriyi that Umar ibn al-Khattab said, \"If someone gives a gift to strengthen ties with a relative or as sadaqa, he cannot have it returned. If some one, however, gives a gift seeking by it favour or reward, he has his gift and can reclaim it if he does not have satisfaction from it.\" Yahya said that he heard Malik say, \"The generally agreed-on way of doing things in our community is that if the gift is returned to the one who gave it for recompense, and its value has been either increased or decreased, the one to whom it has been given gives the owner its value on the day he received it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1442
			}
		}
	]
}