{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"38": "Setting Free and Wala'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"text": "Malik said, \"The generally agreed-on way of doing things among us in the case of slave whose master makes a bequest to free part of him - a third, a fourth, a half, or any share after his death, is that only the portion of him is freed that his master has named. This is because the freeing of that portion is only obliged to take place after the death of the master because the master has the option to withdraw the bequest as long as he lives. When the slave is freed from his master, the master is a testator and the testator only has access to free what he can take from his property, being the third of the property he is allowed to bequeath, and the rest of the slave is not free because the man's property has gone out of his hands. How can the rest of the slave which belongs to other people be free when they did not initiate the setting free and did not confirm it and they do not have the wala' established for them? Only the deceased could do that. He was the one who freed him and the one for whom the wala' was confirmed. That is not to be borne by another's property unless he bequeaths within the third of his property what remains of a lave to be freed. That is a request against his partners and inheritors and the partners must not refuse the slave that when it is within the third of the dead man's property because there is no harm in that to the inheritors.\" Malik said, \"If a man frees a third of his slave while he is critically ill, he must complete the emancipation so all of him is free from him, if it is within the third of his property that he has access to, because he is not treated in the same way as a man who frees a third of a slave after his death, because had the one who freed a third of his slave after his death lived, he could have cancelled it and the slave's being set free would be of no effect. The master who made the freeing of the third of the slave irrevocable in his illness, would still have to free all of him if he lived. If he died, the slave would be set free within the third of the bequest. That is because the command of the deceased is permissible in his third as the command of the healthy is permissible in all his property.\" Malik said, \"A master who frees a slave of his and settles his emancipation so that his testimony is permitted, his inviolability complete, and his right to inherit confirmed, cannot impose stipulations on him like what he imposes on a slave about property or service, nor get him to do anything of slavery, because the Messenger of Allah, may Allah bless him and grant him peace, said, \"If a man frees his share of a slave and has enough money to cover the full price of the slave justly evaluated for him, he must give his partners their shares so the slave is completely free.\" Malik commented, \"If he owns the slave completely, it is more proper to free him completely and not mingle any slavery with it.\" Malik related to me from Yahya ibn Said and somebody else from al-Hasan ibn Abi al-Hasan al-Basri and from Muhammad ibn Sirin that a man in the time of the Messenger of Allah, may Allah bless him and grant him peace, freed six of his slaves while he was dying. The Messenger of Allah, may Allah bless him and grant him peace, drew lots between them and freed a third of those slaves. Malik added that he had heard that the man did not have any property other than them",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1465
			}
		}
	]
}