{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"39": "The Mukatab"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1491,
			"arabicnumber": 1491,
			"text": "Malik related to me from Humayd ibn Qays al-Makki that a son of al-Mutawakkil had a mukatab who died at Makka and left (enough to pay) the rest of his kitaba and he owed some debts to people. He also left a daughter. The governor of Makka was not certain about how to judge in the case, so he wrote to Abd al-Malik ibn Marwan to ask him about it. Abd al-Malik wrote to him, \"Begin with the debts owed to people, and then pay what remains of his kitaba. Then divide what remains of the property between the daughter and the master.\" Malik said, \"What is done among us is that the master of a slave does not have to give his slave a kitaba if he asks for it. I have not heard of any of the Imams forcing a man to give a kitaba to his slave. I heard that one of the people of knowledge, when someone asked about that and mentioned that Allah the Blessed, the Exalted, said, 'Give them their kitaba, if you know some good in them' (Sura 24 ayat 33) recited these two ayats, 'When you are free of the state of ihram, then hunt for game.' (Sura 5 ayat 3) 'When the prayer is finished, scatter in the land and seek Allah's favour.' \" (Sura 62 ayat 10) Malik commented, \"It is a way of doing things for which Allah, the Mighty, the Majestic, has given permission to people, and it is not obligatory for them.\" Malik said, \"I heard one of the people of knowledge say about the word of Allah, the Blessed, the Exalted, 'Give them of the wealth which Allah has given you,' that it meant that a man give his slave a kitaba and then reduce the end of his kitaba for him by some specific amount.\" Malik said, \"This is what I have heard from the people of knowledge and what I see people doing here.\" Malik said, \"I have heard that Abdullah ibn Umar gave one of his slaves his kitaba for 35,000 dirhams, and then reduced the end of his kitaba by 5,000 dirhams.\" Malik said, \"What is done among us is that when a master gives a mukatab his kitaba, the mukatab's property goes with him but his children do not go with him unless he stipulates that in his kitaba.\" Yahya said, \"I heard Malik say that if a mukatab whose master had given him a kitaba had a slave- girl who was pregnant by him, and neither he nor his master knew that on the day he was given his kitaba, the child did not follow him because he was not included in the kitaba. He belonged to the master. As for the slave-girl, she belonged to the mukatab because she was his property.\" Malik said that if a man and his wife's son (by another husband) inherited a mukatab from the wife and the mukatab died before he had completed his kitaba, they divided his inheritance between them according to the Book of Allah. If the slave paid his kitaba and then died, his inheritance went to the son of the woman, and the husband had nothing of his inheritance. Malik said that if a mukatab gave his own slave a kitaba, the situation was looked at. If he wanted to do his slave a favour and it was obvious by his making it easy for him, that was not permitted. If he was giving him a kitaba from desire to find money to pay off his own kitaba, that was permitted for him. Malik said that if a man had intercourse with a mukataba of his and she became pregnant by him, she had an option. If she liked she could be an umm walad. If she wished, she could confirm her kitaba. If she did not conceive, she still had her kitaba. Malik said, \"The generally agreed on way of doing things among us about a slave who is owned by two men is that one of them does not give a kitaba for his share, whether or not his companion gives him permission to do so, unless they both write the kitaba together, because that alone would effect setting him free. If the slave were to fulfil what he had agreed on to free half of himself, and then the one who had given a kitaba for half of him was not obliged to complete his setting free, that would be in opposition to the words of the Messenger of Allah, may Allah bless him and grant him peace. 'If someone frees his share in a slave and has enough money to cover the full price of the slave, justly evaluated for him, he must give his partners their shares, so the slave is completely free . ' \" Malik said, \"If he is not aware of that until the mukatab has met the terms or before he has met them the owner who has written him the kitaba returns what he has taken from the mukatab to him, and then he and his partner divide him according to their original shares and the kitaba is invalid. He is the slave of both of them in his original state.\" Malik spoke about a mukatab who was owned by two men and one of them granted him a delay in the payment of the right which he was owed, and the other refused to defer it, and so the one who refused to defer the payment exacted his part of the due. Malik said that if the mukatab then died and left property which did not complete his kitaba, \"They divide it according to what they are still owed by him. Each of them takes according to his share. If the mukatab leaves more than his kitaba, each of them takes what remains to them of the kitaba, and what remains after that is divided equally between them. If the mukatab is unable to pay his kitaba fully and the one who did not allow him to defer his payment has exacted more than his associate did, the slave is still divided equally between them, and he does not return to his associates the excess of what he has exacted, because he only exacted his right with the permission of his associate. If one of them remits what is owed to him and then his associate exacts part of what he is owed by him and then the mukatab is unable to pay, he belongs to both of them. And the one who has exacted something does not return anything because he only demanded what he was owed. That is like the debt of two men in one writing against one man. One of them grants him time to pay and the other is greedy and exacts his due. Then the debtor goes bankrupt. The one who exacted his due does not have to return any of what he took",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 1491
			}
		}
	]
}