{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"39": "The Mukatab"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1493,
			"arabicnumber": 1493,
			"text": "Malik said, \"The generally agreed on way of doing things among us is that when slaves write their kitaba together in one kitaba, and some are responsible for others, and they are not reduced anything by the death of one of the responsible ones, and then one of them says, 'I can't do it,' and gives up, his companions can use him in whatever work he can do and they help each other with that in their kitaba until they are freed, if they are freed, or remain slaves if they remain slaves.\" Malik said, \"The generally agreed on way of doing things among us is that when a master gives a slave his kitaba, it is not permitted for the master to let anyone assume the responsibility for the kitaba of his slave if the slave dies or is incapable. This is not part of the sunna of the muslims. That is because when a man assumes responsibility to the master of a mukatab for what the mukatab owes of his kitaba, and then the master of the mukatab pursues that from the one who assumes the responsibility, he takes his money falsely. It is not as if he is buying the mukatab, so that what he gives is part of the price of something that is his, and neither is the mukatab being freed so that the price established for him buys his inviolability as a free man. If the mukatab is unable to meet the payments he reverts to his master and is his slave. That is because kitaba is not a fixed debt which can be assumed by the master of the mukatab. It is something which, when it is paid by the mukatab, sets him free. If the mukatab dies and has a debt, his master is not one of the creditors for what remains unpaid of the kitaba. The creditors have precedence over the master. If the mukatab cannot meet the payments, and he owes debts to people, he reverts to being a slave owned by his master and the debts to the people are the liability of the mukatab. The creditors do not enter with the master into any share of the price of his person.\" Malik said, \"When people are written together in one kitaba and there is no kinship between them by which they inherit from each other, and some of them are responsible for others, then none of them are freed before the others until all the kitaba has been paid. If one of them dies and leaves property and it is more than all of what is against them, it pays all that is against them . The excess of the property goes to the master, and none of those who have been written in the kitaba with the deceased have any of the excess. The master's claims are overshadowed by their claims for the portions which remain against them of the kitaba which can be fulfilled from the property of the deceased, because the deceased had assumed their responsibility and they must use his property to pay for their freedom. If the deceased mukatab has a free child not born in kitaba and who was not written in the kitaba, it does not inherit from him because the mukatab was not freed until he died.\" Malik related to me that he heard that Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, made a settlement with her mukatab for an agreed amount of gold and silver. Malik said, \"The generally agreed on way of doing things among us in the case of a mukatab who is shared by two partners, is that one of them cannot make a settlement with him for an agreed price according to his portion without the consent of his partner. That is because the slave and his property are owned by both of them, and so one of them is not permitted to take any of the property except with the consent of his partner. If one of them settled with the mukatab and his partner did not, and he took the agreed price, and then the mukatab died while he had property or was unable to pay, the one who settled would not have anything of the mukatab's property and he could not return that for which he made settlement so that his right to the slave's person would return to him. However, when someone settles with a mukatab with the permission of his partner and then the mukatab is unable to pay, it is preferable that the one who broke with him return what he has taken from the mukatab for the severance and he can have back his portion of the mukatab. He can do that. If the mukatab dies and leaves property, the partner who has kept hold of the kitaba is paid in full the amount of the kitaba which remains to him against the mukatab from the mukatab's property. Then what remains of property of the mukatab is between the partner who broke with him and his partner, according to their shares in the mukatab. If one of the partners breaks off with him and the other keeps the kitaba, and the mukatab is unable to pay, it is said to the partner who settled with him, 'If you wish to give your partner half of what you took so the slave is divided between you, then do so. If you refuse, then all of the slave belongs to the one who held on to possession of the slave.' \" Malik spoke about a mukatab who was shared between two men and one of them made a settlement with him with the permission of his partner. Then the one who retained possession of the slave demanded the like of that for which his partner had settled or more than that and the mukatab could not pay it. He said, \"The mukatab is shared between them because the man has only demanded what is owed to him. If he demands less than what the one who settled with him took and the mukatab can not manage that, and the one who settled with him prefers to return to his partner half of what he took so the slave is divided in halves between them, he can do that. If he refuses then all of the slave belongs to the one who did not settle with him. If the mukatab dies and leaves property, and the one who settled with him prefers to return to his companion half of what he has taken so the inheritance is divided between them, he can do that. If the one who has kept the kitaba takes the like of what the one who has settled with him took, or more, the inheritance is between them according to their shares in the slave because he is only taking his right.\" Malik spoke about a mukatab who was shared between two men and one of them made a settlement with him for half of what was due to him with the permission of his partner, and then the one who retained possession of the slave took less than what his partner settled with him for and the mukatab was unable to pay. He said, \"If the one who made a settlement with the slave prefers to return half of what he was awarded to his partner, the slave is divided between them. If he refuses to return it, the one who retained possession has the portion of the share for which his partner made a settlement with the mukatab.\" Malik said, \"The explanation of that is that the slave is divided in two halves between them. They write him a kitaba together and then one of them makes a settlement with the mukatab for half his due with the permission of his partner. That is a fourth of all the slave. Then the mukatab is unable to continue, so it is said to the one who settled with him, 'If you wish, return to your partner half of what you were awarded and the slave is divided equally between you.' If he refuses, the one who held to the kitaba takes in full the fourth of his partner for which he made settlement with the mukatab. He had half the slave, so that now gives him three-fourths of the slave. The one who broke off has a fourth of the slave because he refused to return the equivalent of the fourth share for which he settled.\" Malik spoke about a mukatab whose master made a settlement with him and set him free and what remained of his severance was written against him as debt, then the mukatab died and people had debts against him. He said, \"His master does not share with the creditors because of what he is owed from the severance. The creditors begin first.\" Malik said, \"A mukatab cannot break with his master when he owes debts to people. He would be set free and have nothing because the people who hold the debts are more entitled to his property than his master. That is not permitted for him.\" Malik said, \"According to the way things are done among us, there is no harm if a man gives a kitaba to his slave and settles with him for gold and reduces what he is owed of the kitaba provided that only the gold is paid immediately. Whoever disapproves of that does so because he puts it in the category of a debt which a man has against another man for a set term. He gives him a reduction and he pays it immediately. This is not like that debt. The breaking of the mukatab with his master is dependent on his giving money to speed up the setting free. Inheritance, testimony and the hudud are obliged for him and the inviolability of being set free is established for him. He is not buying dirhams for dirhams or gold for gold. Rather it is like a man who having said to his slave, 'Bring me such-and-such an amount of dinars and you are free', then reduces that for him, saying, 'If you bring me less than that, you are free.' That is not a fixed debt. Had it been a fixed debt, the master would have shared with the creditors of the mukatab when he died or went bankrupt. His claim on the property of the mukatab would join theirs",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 1493
			}
		}
	]
}