{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"39": "The Mukatab"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1494,
			"arabicnumber": 1494,
			"text": "Malik said, \"The best of what I have heard about a mukatab who injures a man so that blood-money must be paid, is that if the mukatab can pay the blood-money for the injury with his kitaba, he does so, and it is against his kitaba. If he cannot do that, and he cannot pay his kitaba because he must pay the blood-money of that injury before the kitaba, and he cannot pay the blood-money of that injury, then his master has an option. If he prefers to pay the blood-money of that injury, he does so and keeps his slave and he becomes an owned slave. If he wishes to surrender the slave to the injured, he surrenders him. The master does not have to do more than surrender his slave.\" Malik spoke about people who were in a general kitaba and one of them caused an injury which entailed blood-money. He said, \"If any of them does an injury involving blood-money, he and those who are with him in the kitaba are asked to pay all the blood-money of that injury. If they pay, they are confirmed in their kitaba. If they do not pay, and they are incapable then their master has an option. If he wishes, he can pay all the blood-money of that injury and all the slaves revert to him. If he wishes, he can surrender the one who did the injury alone and all the others revert to being his slaves since they could not pay the blood-money of the injury which their companion caused.\" Malik said, \"The way of doing things about which there is no dispute among us, is that when a mukatab is injured in some way which entails blood-money or one of the mukatab's children who is written with him in the kitaba is injured, their blood-money is the blood-money of slaves of their value, and what is appointed to them as their blood-money is paid to the master who has the kitaba and he reckons that for the mukatab at the end of his kitaba and there is a reduction for the blood-money that the master has taken for the injury.\" Malik said, \"The explanation of that is say, for example, he has written his kitaba for three thousand dirhams and the blood-money taken by the master for his injury is one thousand dirhams. When the mukatab has paid his master two thousand dirhams he is free. If what remains of his kitaba is one thousand dirhams and the blood-money for his injury is one thousand dirhams, he is free straightaway. If the blood-money of the injury is more than what remains of the kitaba, the master of the mukatab takes what remains of his kitaba and frees him. What remains after the payment of the kitaba belongs to the mukatab. One must not pay the mukatab any of the blood- money of his injury in case he might consume it and use it up. If he could not pay his kitaba completely he would then return to his master one eyed, with a hand cut off, or crippled in body. His master only wrote his kitaba against his property and earnings, and he did not write his kitaba so that he would take the blood-money for what happened to his child or to himself and use it up and consume it. One pays the blood-money of injuries to a mukatab and his children who are born in his kitaba, or their kitaba is written, to the master and he takes it into account for him at the end of his kitaba.\" Malik said, \"The best of what is said about a man who buys the mukatab of a man is that if the man wrote the slave's kitaba for dinars or dirhams, he does not sell him unless it is for merchandise which is paid immediately and not deferred, because if it is deferred, it would be a debt for a debt. A debt for a debt is forbidden.\" He said, \"If the master gives a mukatab his kitaba for certain merchandise of camels, cattle, sheep, or slaves, it is more correct that the buyer buy him for gold, silver, or different goods than the ones his master wrote the kitaba for, and that must be paid immediately, not deferred.\" Malik said, \"The best of what I have heard about a mukatab when he is sold is that he is more entitled to buy his kitaba than the one who buys him if he can pay his master the price for which he was sold in cash. That is because his buying himself is his freedom, and freedom has priority over what bequests accompany it. If one of those who have written the kitaba for the mukatab sells his portion of him, so that a half, a third, a fourth, or whatever share of the mukatab is sold, the mukatab does not have the right of pre-emption in what is sold of him. That is because it is like the severance of a partner, and a partner can only make a settlement for a partner of the one who is mukatab with the permission of his partners because what is sold of him does not give him complete rights as a free man and his property is barred from him, and by buying part of himself, it is feared that he will become incapable of completing payment because of what he had to spend. That is not like the mukatab buying himself completely unless whoever has some of the kitaba remaining due to him gives him permission. If they give him permission, he is more entitled to what is sold of him.\" Malik said, \"Selling one of the instalments of a mukatab is not halal. That is because it Is an uncertain transaction. If the mukatab cannot pay it, what he owes is nullified. If he dies or goes bankrupt and he owes debts to people, then the person who bought his instalment does not take any of his portion with the creditors. The person who buys one of the instalments of the mukatab is in the position of the master of the mukatab. The master of the mukatab does not have a share with the creditors of the mukatab for what he is owed of the kitaba of his slave. It is also like that with the kharaj, (a set amount deducted daily from the slave against his earnings), which accumulates for a master from the earnings of his slave. The creditors of his slave do not allow him a share for what has accumulated for him from those deductions.\" Malik said, \"There is no harm in a mukatab paying off his kitaba with coin or merchandise other than the merchandise for which he wrote his kitaba if it is identical with it, on time (for the instalment) or delayed. \" Malik said that if a mukatab died and left an umm walad and small children by her or by someone else and they could not work and it was feared that they would be unable to fulfil their kitaba, the umm walad of the father was sold if her price would pay all the kitaba for them, whether or not she was their mother. They were paid for and set free because their father did not forbid her sale if he feared that he would be unable to complete his kitaba. If her price would not pay for them and neither she nor they could work, they all reverted to being slaves of the master. Malik said, \"What is done among us in the case of a person who buys the kitaba of a mukatab, and then the mukatab dies before he has paid his kitaba, is that the person who bought the kitaba inherits from him. If, rather than dying, the mukatab cannot pay, the buyer has his person. If the mukatab pays his kitaba to the person who bought him and he is freed, his wala' goes to the person who wrote the kitaba and the person who bought his kitaba does not have any of it.\" Malik related to me that he heard that Urwa ibn az-Zubayr and Sulayman ibn Yasar when asked whether the sons of a man, who had a kitaba written for himself and his children and then died, worked for the kitaba of their father or were slaves, said, \"They work for the kitaba of their father and they have no reduction at all for the death of their father.\" Malik said, \"If they are small and unable to work, one does not wait for them to grow up and they are slaves of their father's master unless the mukatab has left what will pay their instalments for them until they can work. If there is enough to pay for them in what he has left, that is paid for on their behalf and they are left in their condition until they can work, and then if they pay, they are free. If they cannot do it, they are slaves.\" Malik spoke about a mukatab who died and left property which was not enough to pay his kitaba, and he also left a child with him in his kitaba and an umm walad, and the umm walad wanted to work for them. He said, \"The money is paid to her if she is trustworthy with it and strong enough to work. If she is not strong enough to work and not trustworthy with property, she is not given any of it and she and the children of the mukatab revert to being slaves of the master of the mukatab.\" Malik said, \"If people are written together in one kitaba and there is no kinship between them, and some of them are incapable and others work until they are all set free, those who worked can claim from those who were unable, the portion of what they paid for them because some of them assumed the responsibility for others",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 1494
			}
		}
	]
}