{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"41": "Hudud"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "Yahya related to me from Malik that Abu'z-Zinad informed him that a governor of Umar ibn Abd al-Aziz took some people in battle and had not killed any of them. He wanted to cut off their hands or kill them, so he wrote to Umar ibn Abd al-Aziz about that Umar ibn Abd al-Aziz wrote to him, \"Better to take less than that.\" Yahya said that he heard Malik say, \"What is done among us about a person who steals the goods of people which are placed under guard in the markets, and their owners put them in their containers and store them together is that if anyone steals any of that from where it is kept, and its value reaches that for which cutting off the hand is obliged, his hand must be cut off, whether or not the owner of the goods is with his goods and whether it is night or day.\" Malik said about some one who stole something for which cutting off the hand was obliged and then what he stole was found with him and he returned it to its owner, \"His hand is cut off.\" Malik said, \"If someon says, 'How can his hand be cut off when the goods have been taken from him and returned to their owner?', it is because he is in the same position as the wine drinker when the smell of the wine is found on his breath and he is not drunk. He is flogged with the hadd. \"The hadd is imposed for drinking wine even if it does not make the man intoxicated. That is because he drank it to become intoxicated. It is the same as that with cutting off the hand of the thief for theft when it is taken from him, even if he has not profited from it and it was returned to its owner. When he stole it, he stole it to take it away.\" Malik said that if some people came to a house and robbed it together, and then they left with a sack or box or a board or basket or the like of that which they carried together, and when they took it out of its guarded place, they carried it together, and the price of what they took reached that for which cutting off the hand was obliged, and that was three dirhams and upwards, each of them had his hand cut off. \"If each of them takes out something by himself, whoever of them takes out something whose value reaches three dirhams and upwards must have his hand cut off. If any of them takes out something whose value does not reach three dirhams, he does not have his hand cut off.\" Yahya said that Malik said, \"What is done among us is that when a man's house is locked and he is the only one living in it, cutting off the hand is not obliged against the one who steals something from it until he takes it out of the house completely. That is because all of the house is a place of custody. If someone other than him lives in the house and each of them locks his door, and it is a place of custody for each of them, whoever steals anything from the apartments of that house must have his hand cut off when he leaves the apartment and goes into the main house. He has removed it from its place of custody to another place and he must have his hand cut off.\" Malik said, \"What is done in our community about a slave who steals from the property of his master is that if he is not in service and among those trusted in the house and he enters secretly and steals from his master something that for which cutting off the hand is obliged, his hand is not cut off. It is like that with a slave-girl when she steals from her master's property. Her hand is not cut off.\" Malik then spoke about a slave who was not in service and not one of those trusted in the house, and he entered secretly and stole from the property of his master's wife that for which cutting off the hand was obliged. He said, \"His hand is cut off.\" \"It is like that with the wife's slave-girl when she does not serve her or her husband nor is she trusted in the house and she enters secretly and steals from her mistress's property that for which cutting off the hand is obliged. Her hand is not cut off.\" \"It is like that with the wife's slave-girl who is not in her service and is not trusted in the house and she enters secretly and steals from the property of her mistress's husband something for which cutting off the hand is obliged. Her hand is cut off.\" It is like that with the man who steals from his wife's goods or the wife who steals from her husband's goods something for which cutting off the hand is obliged. If the thing which one of them steals from his spouse's property is in a room other than the room which they both lock for themselves, or it is in a place of custody in a room other than the room which they are in, whichever of them steals something for which cutting off the hand is obliged, their hand should be cut off.\" Malik spoke about a small child and a foreigner who does not speak clearly. He said, \"If they are robbed of something from its place of custody or from under a lock, the one who stole it has his hand cut off. If the property is outside of its place of custody or locked room(when it is stolen), the one who robbed them does not have his hand cut off. It is then in the position of sheep stolen from the mountain and uncut fruit hanging on the trees \" Malik said, \"What is done among us about a person who robs graves is that if what he takes from the grave reaches what cutting off the hand is obliged for, his hand is cut off . That is because the grave is a place of custody for what is in it just as houses are a place of custody for what is in them. \" Malik added, \"Cutting off the hand is not obliged for him until he takes it out of the grave",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1532
			}
		}
	]
}