{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"41": "Hudud"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "Yahya related to me from Malik that Yahya ibn Said said that Abu Bakr ibn Muhammad ibn Amr ibn Hazm informed him that he had taken a Nabatean who had stolen some iron rings and jailed him in order to cut off his hand. Amra bint Abd ar-Rahman sent a girl mawla to him called Umayya. Abu Bakr said that she had come to him while he was among the people and said that his aunt Amra sent word to him saying, \"Son of my brother! You have taken a Nabatean for something insignificant which was mentioned to me. Do you want to cut off his hand?\" He had said, \"Yes.\" She said, ''Amra says to you not to cut off the hand except for a quarter of a dinar and upwards.\" Abu Bakr added, \"So I let the Nabatean go.\" Malik said, \"The generally agreed on way of doing things among us about the confession of slaves is that if a slave confesses something against himself, the hadd and punishment for it is inflicted on his body. His confession is accepted from him and one does not suspect that he would inflict something on himself.\" Malik said, \"As for the one of them who confesses to a matter which will incur damages agains this master, his confession is not accepted against his master.\" Malik said, \"One does not cut off the hand of a hireling or a man who is with some people to serve them, if he robs them, because his state is not the state of a thief. His state is the state of a treacherous one. The treacherous one does not have his hand cut off.\" Malik said about a person who borrows something and then denies it, \"His hand is not cut off. He is like a man who owes a debt to another man and denies it. He does not have his hand cut off for what he has denied.\" Malik said, \"The generally agreed-on way of dealing among us, with the thief who is found in a house and has gathered up goods and has not taken them out, is that his hand is not cut off. That is like the man who places wine before him to drink it and does not do it. The hadd is not imposed on him. That is like a man who sits with a woman and desires to have haram intercourse with her and does not do it and he does not reach her. There is no hadd against that either.\" Malik said, \"The generally agreed-on way of doing things among us is that there is no cutting off the hand for what is taken by chance, openly and in haste, whether or not its price reaches that for which the hand is cut off",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1536
			}
		}
	]
}