{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "Malik related to me that the generally agreed on way of doing things amongst the community about an accident is that there is no blood-money until the victim is better. If a man's bone, either a hand, or a foot, or another part of his body, is broken accidentally and it heals and becomes sound and returns to its form, there is no blood-money for it. If the limb is impaired or there is a scar on it, there is blood-money for it according to the extent that it is impaired. Malik said, \"If that part of the body has a specific blood-money mentioned by the Prophet, may Allah bless him and grant him peace, it is according to what the Prophet, may Allah bless him and grant him peace, specified. If it is part of what does not have a specific blood-money for it mentioned by the Prophet, may Allah bless him and grant him peace, and if there is no previous sunna about it or specific blood-money, one uses ijtihad about it.\" Malik said, \"There is no blood-money for an accidental bodily injury when the wound heals and returns to its form. If there is any scar or mark in that, ijtihad is used about it except for the belly-wound. There is a third of the blood-money of a life for it. \" Malik said, \"There is no blood-money for the wound which splinters a bone in the body, and it is like the wound to the body which lays bare the bone.\" Malik said, \"The generally agreed on way of doing things in our community is that when the doctor performs a circumcision and cuts off the glans, he must pay the full blood-money. That is because it is an accident which the tribe is responsible for, and the full blood money is payable for all that in which a doctor errs or exceeds, when it is not intentional.\" Yahya related to me from Malik from Yahya ibn Said that Said ibn al-Musayyab said, \"The blood-money for a woman is the same as for a man up to one third of the blood-money. Her finger is like his finger, her tooth is like his tooth, her injury which lays bare the bone is like his, and her head wound which splinters the bone is like his",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1558
			}
		}
	]
}