{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "Yahya related to me from Malik that Rabia ibn Abi Abd ar-Rahman said, \"The slave of fair complexion and excellence is estimated at fifty dinars or six hundred dirhams. The blood-money of a free muslim woman is five hundred dinars or six thousand dirhams.\" Malik said, \"The blood-money of the foetus of a free woman is a tenth of her blood-money. The tenth is fifty dinars or six hundred dirhams.\" Malik said, \"I have not heard anyone dispute that there is no slave in compensation for the foetus until it leaves its mother's womb and falls still-born from her womb . \" Malik said, \"I heard that if the foetus comes out of its mother's womb alive and then dies, the full blood-money is due for it.\" Malik said, \"The foetus is not alive unless it cries at birth. If it comes out of its mother's womb and cries out and then dies, the complete blood-money is due for it. We think that the slave- girl's foetus has a tenth of the price of the slave-girl.\" Malik said, \"When a woman murders a man or woman, and the murderess is pregnant, retaliation is not taken against her until she has given birth. If a woman who is pregnant is killed intentionally or unintentionally, the one who killed her is not obliged to pay anything for her foetus. If she is murdered, then the one who killed her is killed and there is no blood-money for her foetus. If she is killed accidentally, the tribe obliged to pay on behalf of her killer pays her blood-money, and there is no blood-money for the foetus.\" Yahya related to me, \"Malik was asked about the foetus of the christian or jewish woman which was aborted. He said, 'I think that there is a tenth of the blood-money of the mother for it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1563
			}
		}
	]
}