{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"45": "Madina"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "Yahya related to me from Malik from Ibn Shihab from Abd al-Hamid ibn Abd ar-Rahman ibn Zayd ibn al-Khattab from Abdullah ibn Abdullah ibn al-Harith ibn Nawfal from Abdullah ibn Abbas that Umar ibn al- Khattab set out for ash Sham and when he was at Sargh, near Tabuk, the commanders of the army, Abu Ubayda ibn al-Jarrah and his companions, met him and told him that the plague had broken out in ash-Sham. Ibn Abbas said, \"Umar ibn al-Khattab said, 'all the first Muhajir unto me.' He assembled them and asked them for advice, informing them that the plague had broken out in ash Sham. They disagreed. Some said, 'You have set out for something, and we do not think that you should leave it.' Others said, 'You have the companions of the Prophet, may Allah bless him and grant him peace, and the rest of the people with you, and we do not think that you should send them towards this plague.' Umar said, 'Leave me.' Then he said, 'Summon the Ansar to me.' They were summoned and he asked them for advice. They acted as the Muhajirun had and disagreed as they had disagreed. He said, 'Leave me.' \"Then he said, 'Summon to me whoever is here of the aged men of Quraysh from the Muhajirun of the conquest.' He summoned them and not one of them differed. They said, 'We think that you should withdraw the people and not send them towards the plague.' Umar called out to the people, 'I am leaving by camel in the morning,' so they set out. Abu Ubayda said, 'Is it flight from the decree of Allah?' Umar said, 'Better that someone other than you had said it, Abu Ubayda. Yes. We flee from the decree of Allah to the decree of Allah. What would you think if these camels had gone down into a valley which had two slopes, one of them fertile, and the other barren. If you pastured in the fertile part, wouldn't you pasture them by the decree of Allah? If you pastured them in the barren part, wouldn't you pasture them by the decree of Allah?' ''Abd ar-Rahman ibn Awf arrived and he had been off doing something and he said, 'I have some knowledge of this. I heard the Messenger of Allah, may Allah bless him and grant him peace, say, \"If you hear about it in a land, do not go forward to it. If it comes upon a land and you are in it, then do not depart in flight from it.\" ' Umar praised Allah and then set off",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1618
			}
		}
	]
}