{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"49": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "Yahya related to me from Malik that Ishaq ibn Abdullah ibn Abi Talha heard Anas ibn Malik say that Abu Talha had said to Umm Sulaym, \"I have just been listening to the Messenger of Allah, may Allah bless him and grant him peace, and his voice was very weak. I recognised hunger in it, so, do you have anything?\" She replied, \"Yes,\" and brought out some barley loaves. She took her long head scarf and wrapped up the bread with part of it and put it into my (Anas's) hand and gave me part of it to wear. Then she sent me to the Messenger of Allah, may Allah bless him and grant him peace.\" Anas continued, \"I took it, and I found the Messenger of Allah, may Allah bless him and grant him peace, sitting in the mosque with some people. I watched them. The Messenger of Allah, may Allah bless him and grant him peace, said, 'Did Abu Talha send you?' I replied, 'Yes.' He said, 'For food?' I said, 'Yes.' The Messenger of Allah, may Allah bless him and grant him peace, said to those with him, 'Let us go.' He set off and I went among them until I came to Abu Talha and told him. Abu Talha said, 'Umm Sulaym! The Messenger of Allah, may Allah bless him and grant him peace, has brought people and we have no food. What shall we give them to eat?' She said, 'Allah and His Messenger know best.' \" Anas continued, \"Abu Talha went out and met the Messenger of Allah, may Allah bless him and grant him peace, and the Messenger of Allah, may Allah bless him and grant him peace, approached with Abu Talha until they entered. The Messenger of Allah, may Allah bless him and grant him peace, said, 'Come now, Umm Sulaym, what have you got?' She brought out bread. The Messenger of Allah, may Allah bless him and grant him peace, ordered it to be broken into pieces, and Umm Sulaym squeezed out onto it a container of clarified butter which she had seasoned. Then the Messenger of Allah, may Allah bless him and grant him peace, said whatever Allah wished him to say, and said, 'Will you give permission for ten of them to come in?' He gave them permission, and they ate until they were full and then left. He said, 'Give permission to ten more.' He gave them permission, and they ate until they were full and left. Then he said, 'Give permission to ten more.' He gave them permission and they ate until they were full and left. Then he said, 'Give permission to ten more.' He gave permission and they ate until they were full and left. There were seventy or eighty men",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1689
			}
		}
	]
}