{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"12": "The Eclipse Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 446,
			"arabicnumber": 446,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn Yasar that Abdullah ibn Abbas said, \"There was an eclipse of the sun and the Messenger of Allah, may Allah bless him and grant him peace, prayed, and the people prayed with him. He stood for a long time, nearly as long as (it takes to recite) Surat al-Baqara (Sura 2), and then went into ruku for a long time. Then he rose and stood for a long time, though less than the first time.Then he went into ruku for a long time, though less than the first time. Then he went down into sajda. Then he stood for a long time, though less than the first time. Then he went into ruku for a long time, though less than the first time. Then he rose and stood for a long time, though less than the firsttime. Then he went into ruku for a long time, though less than the first time. Then he went down into sajda, and by the time he had finished the sun had appeared. Then he said, 'The sun and the moon are two of Allah's signs. They do not eclipse for anyone's death nor for anyone's life. When you see an eclipse, remember Allah.' They said, 'Messenger of Allah, we saw you reach out for something while you were standing here and then we saw you withdraw.' He said, 'I saw the Garden and I reached out for a bunch of grapes from it, and if I had taken it you would have been able to eat from it for as long as this world lasted. Then I saw the Fire - and I have never seen anything more hideous than what I saw today - and I saw that most of its people were women.' They said, 'Why, Messenger of Allah?' He said, 'Because of their ungratefulness (kufr).' Someone said, 'Are they ungrateful toAllah?' He said, 'They are ungrateful to their husbands and they are ungrateful for good behaviour (towards them) . Even if you were to behave well towards one of them for a whole lifetime and then she were to see you do something (that she did not like) she would say that she had never seen anything good from you",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 446
			}
		}
	]
}