{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 600,
			"arabicnumber": 600,
			"text": "Yahya related to me from Malik from Humayd ibn Qays al-Makki from Tawus al Yamani that from thirty cows, Muadh ibn Jabal took one cow in its second year, and from forty cows, one cow in its third or fourth year, and when less than that (i.e. thirty cows) was brought to him he refused to take anything from it. He said, \"I have not heard anything about it from the Messenger of Allah, may Allah bless him and grant him peace. When I meet him, I will ask him.\" But the Messenger of Allah, may Allah bless him and grant him peace, died before Muadh ibn Jabal returned. Yahya said that Malik said, \"The best that I have heard about some one who has sheep or goats with two or more shepherds in different places is that they are added together and the owner then pays the zakat on them. This is the same situation as a man who has gold and silver scattered in the hands of various people. He must add it all u p and pay whatever zakat there is to pay on the sum total.\" Yahya said that Malik said, about a man who had both sheep and goats, that they were added up together for the zakat to be assessed, and if between them they came to a number on which zakat was due, he paid zakat on them. Malik added, \"They are all considered as sheep, and in Umar ibn al-Khattab's book it says, 'On grazing sheep and goats, if they come to forty or more, one ewe.' \" Malik said, \"If there are more sheep than goats and their owner only has to pay one ewe, the zakat collector takes the ewe from the sheep. If there are more goats than sheep, he takes it from the goats. If there is an equal number of sheep and goats, he takes the ewe from whichever kind he wishes.\" Yahya said that Malik said, \"Similarly, Arabian camels and Bactrian camels are added up together in order to assess the zakat that the owner has to pay. They are all considered as camels. If there are more Arabian camels than Bactrians and the owner only has to pay one camel, the zakat collector takes it from the Arabian ones. If, however, there are more Bactrian camels he takes it from those. If there is an equal number of both, he takes the camel from whichever kind he wishes.\" Malik said, \"Similarly, cows and water buffaloes are added up together and are all considered as cattle. If there are more cows than water buffalo and the owner only has to pay one cow, the zakat collector takes it from the cows. If there are more water buffalo, he takes it from them. If there is an equal number of both, he takes the cow from whichever kind he wishes. So if zakat is necessary, it is assessed taking both kinds as one group.\" Yahya said that Malik said, \"No zakat is due from anyone who comes into possession of livestock, whether camels or cattle or sheep and goats, until a year has elapsed over them from the day he acquired them, unless he already had in his possession a nisab of livestock. (The nisab is the minimum amount on which zakat has to be paid, either five head of camels, or thirty cattle, or forty sheep and goats). If he already had five head of camels, or thirty cattle, or forty sheep and goats, and he then acquired additional camels, or cattle, or sheep and goats, either by trade, or gift, or inheritance, he must pay zakat on them when he pays the zakat on the livestock he already has, even if a year has not elapsed over the acquisition. And even if the additional livestock that he acquired has had zakat taken from it the day before he bought it, or the day before he inherited it, he must still pay the zakat on it when he pays the zakat on the livestock he already has \" Yahya said that Malik said, \"This is the same situation as some one who has some silver on which he pays the zakat and then uses to buy some goods with from somebody else. He then has to pay zakat on those goods when he sells them. It could be that one man will have to pay zakat on them one day, and by the following day the other man will also have to pay.\" Malik said, in the case of a man who had sheep and goats which did not reach the zakatable amount, and who then bought or inherited an additional number of sheep and goats well above the zakatable amount, that he did not have to pay zakat on all his sheep and goats until a year had elapsed over them from the day he acquired the new animals, whether he bought them or inherited them.This was because none of the livestock that a man had, whether it be camels, or cattle, or sheep and goats, was counted as a nisab until there was enough of any one kind for him to have to pay zakat on it. This was the nisab which is used for assessing the zakat on what the owner had additionally acquired, whether it were a large or small amount of livestock. Malik said, \"If a man has enough camels, or cattle, or sheep and goats, for him to have to pay zakat on each kind, and then he acquires another camel, or cow, or sheep, or goat, it must be included with the rest of his animals when he pays zakat on them \" Yahya said that Malik said, \"This is what I like most out of what I heard about the matter.\" Malik said, in the case of a man who does not have the animal required of him for the zakat, \"If it is a two-year-old she-camel that he does not have, a three-year-old male camel is taken instead. If it is a three- or four- or five-year-old she-camel that he does not have, then he must buy the required animal so that he gives the collector what is due. I do not like it if the owner gives the collector the equivalent value.\" Malik said, about camels used for carrying water, and cattle used for working water-wheels or ploughing, \"In my opinion such animals are included when assessing zakat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 600
			}
		}
	]
}