{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 601,
			"arabicnumber": 601,
			"text": "Yahya said that Malik said, concerning two associates, \"If they share one herdsman, one male animal, one pasture and one watering place then the two men are associates, as long as each one of them knows his own property from that of his companion If someone cannot tell his property apart from that of his fellow, he is not an associate, but rather, a co-owner \" Malik said, \"It is not obligatory for both associates to pay zakat unless both of them have a zakatable amount (of livestock). If, for instance, one of the associates has forty or more sheep and goats and the other has less than forty sheep and goats, then the one who has forty has to pay zakat and the one who has less does not. If both of them have a zakatable amount (of livestock) then both of them are assessed together (i.e the flock is assessed as one) and both of them have to pay zakat. If one of them has a thousand sheep, or less, that he has to pay zakat on, and the other has forty, or more, then they are associates, and each one pays his contribution according to the number of animals he has - so much from the one with a thousand, and so much from the one with forty. Malik said, \"Two associates in camels are the same as two associates in sheep and goats, and, for the purposes of zakat, are assessed together if each one of them has a zakatable amount (of camels). That is because the Messenger of Allah, may Allah bless him and grant him peace, said, 'There is no zakat on less than five head of camels,' and Umar ibn al-Khattab said, 'On grazing sheep and goats, if they come to forty or more - one ewe.' \" Yahya said that Malik said, \"This is what I like most out of what I have heard about the matter.\" Malik said that when Umar ibn al-Khattab said, \"Those separated should not be gathered together nor should those gathered together be separated in order to avoid paying zakat,\" what he meant was the owners of livestock. Malik said, \"What he meant when he said, 'Those separated should not be gathered together' is, for instance, that there is a group of three men, each of whom has forty sheep and goats, and each of whom thus has to pay zakat. Then, when the zakat collector is on his way ,they gather their flocks together so that they only owe one ewe between them. This they are forbidden to do. What he meant when he said, 'nor should those gathered together be separated,' is, for instance, that there are two associates, each one of whom has a hundred and one sheep and goats, and each of whom must therefore pay three ewes. Then, when the zakat collector is on his way, they split up their flocks so that they only have to pay one ewe each. This they are forbidden to do. And so it is said, 'Those separated should not be gathered together nor should those gathered together be separated in order to avoid paying zakat.' \" Malik said, \"This is what I have heard about the matter.\" Yahya related to me from Malik from Thawr ibn Zayd ad-Dili from a son of Abdullah ibn Sufyan ath-Thaqafi from his grandfather Sufyan ibn Abdullah that Umar ibn al-Khattab once sent him to collect zakat. He used to include sakhlas (when assessing zakat), and they said, \"Do you include sakhlas even though you do not take them (as payment)?\" He returned to Umar ibn al-Khattab and mentioned that to him and Umar said, \"Yes, you include a sakhla which the shepherd is carrying, but you do not take it. Neither do you take an akula, or a rubba, or a makhid, or male sheep and goats in their second and third years, and this is a just compromise between the young of sheep and goats and the best of them.\" Malik said, \"A sakhla is a newborn lamb or kid. A rubba is a mother that is looking after her offspring, a makhid is a pregnant ewe or goat, and an akula is a sheep or goat that is being fattened for meat.\" Malik said, about a man who had sheep and goats on which he did not have to pay any zakat, but which increased by birth to a zakatable amount on the day before the zakat collector came to them, \"If the number of sheep and goats along with their (newborn) offspring reaches a zakatable amount then the man has to pay zakat on them. That is because the offspring of the sheep are part of the flock itself. It is not the same situation as when some one acquires sheep by buying them, or is given them, or inherits them. Rather, it is like when merchandise whose value does not come to a zakatable amount is sold, and with the profit that accrues it then comes to a zakatable amount. The owner must then pay zakat on both his profit and his original capital, taken together. If his profit had been a chance acquisition or an inheritance he would not have had to pay zakat on it until one year had elapsed over it from the day he had acquired it or inherited it.\" Malik said, \"The young of sheep and goats are part of the flock, in the same way that profit from wealth is part of that wealth. There is, however, one difference, in that when a man has a zakatable amount of gold and silver, and then acquires an additional amount of wealth, he leaves aside the wealth he has acquired and does not pay zakat on it when he pays the zakat on his original wealth but waits until a year has elapsed over what he has acquired from the day he acquired it. Whereas a man who has a zakatable amount of sheep and goats, or cattle, or camels, and then acquires another camel, cow, sheep or goat, pays zakat on it at the same time that he pays the zakat on the others of its kind, if he already has a zakatable amount of livestock of that particular kind.\" Malik said, \"This is the best of what I have heard about this",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 601
			}
		}
	]
}