{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 609,
			"arabicnumber": 609,
			"text": "Yahya related to me from Malik from Ziyad ibn Sad that Ibn Shihab said, \"Neither jurur, nor musran al-fara, nor adhq ibn hubayq should be taken as zakat from dates. They should be included in the assessment but not taken as zakat. \" Malik said, \"This is the same as with sheep and goats, whose young are included in the assessment but are not (actually) taken as zakat. There are also certain kinds of fruit which are not taken as zakat, such as burdi dates (one of the finest kinds of dates), and similar varieties. Neither the lowest quality (of any property) nor the highest should be taken. Rather, zakat should be taken from average quality property.\" Malik said, \"The position that we are agreed upon concerning fruit is that only dates and grapes are estimated while on the tree. They are estimated when their usability is clear and they are halal to sell. This is because the fruit of date-palms and vines is eaten straightaway in the form of fresh dates and grapes, and so the assessment is done by estimation to make things easier for people and to avoid causing them trouble. Their produce is estimated and then they are given a free hand in using their produce as they wish, and later they pay the zakat on it according to the estimation that was made.\" Malik said, \"crops which are not eaten fresh, such as grains and seeds, which are only eaten after they have been harvested, are not estimated. The owner, after he has harvested, threshed and sifted the crop, so that it is then in the form of grain or seed, has to fulfil his trust himself and deduct the zakat he owes if the amount is large enough for him to have to pay zakat. This is the position that we are all agreed upon here (in Madina).\" Malik said, \"The position that we are all agreed upon here (in Madina) is that the produce of date palms is estimated while it is still on the tree, after it has ripened and become halal to sell, and the zakat on it is deducted in the form of dried dates at the time of harvest. If the fruit is damaged after it has been estimated and the damage affects all the fruit then no zakat has to be paid. If some of the fruit remains unaffected, and this fruit amounts to five awsuq or more using the sa of the Prophet, may Allah bless him and grant him peace, then zakat is deducted from it. Zakat does not have to be paid, however, on the fruit that was damaged . Grapevines are dealt with in the same way. If a man owns various pieces of property in various places, or is a co-owner of various pieces of property in various places, none of which individually comes to a zakatable amount, but which, when added together, do come to a zakatable amount, then he adds them together and pays the zakat that is due on them",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 609
			}
		}
	]
}