{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 610,
			"arabicnumber": 610,
			"text": "Yahya related to me from Malik that he asked Ibn Shihab about olives and he said, \"There is a tenth on them.\" Malik said, \"The tenth that is taken from olives is taken after they have been pressed, and the olives must come to a minimum amount of five awsuq and there must be at least five awsuq of olives. If there are less than five awsuq of olives, no zakat has to be paid. Olive trees are like date palms insofar as there is a tenth on whatever is watered by rain or springs or any natural means, and a twentieth on whatever is irrigated. However, olives are not estimated while on the tree. The sunna with us as far as grain and seeds which people store and eat is concerned is that a tenth is taken from whatever has been watered by rain or springs or any natural means, and a twentieth from whatever has been irrigated, that is, as long as the amount comes to five awsuq or more using the aforementioned sa, that is, the sa of the Prophet, may Allah bless him and grant him peace. Zakat must be paid on anything above five awsuq according to the amount involved.\" Malik said, \"The kinds of grain and seeds on which there is zakat are:wheat, barley, sult (a kind of barley), sorghum, pearl millet, rice, lentils, peas, beans, sesame seeds and other such grains and seeds which are used for food. Zakat is taken from them after they have been harvested and are in the form of grai n or seed.\" He said, \"People are entrusted with the assessment and whatever they hand over is accepted .\" Malik was asked whether the tenth or the twentieth was taken out of olives before they were sold or after and he said, \"The sale is not taken into consideration. It is the people who produce the olives that are asked about the olives, just as it is the people who produce foodstuffs that are asked about it, and zakat is taken from them by what they say. Someone who gets five awsuq or more of olives from his olive trees has a tenth taken from the oil after pressing. Whereas someone who does not get five awsuq from his trees does not have to pay any zakat on the oil.\" Malik said, \"Someone who sells his crops when they are ripe and are ready in the husk has to pay zakat on them but the one who buys them does not. The sale of crops is not valid until they are ready in the husk and no longer need water.\" Malik said, concerning the word of Allah the Exalted, \"And give its due on the day of its harvesting,\" that it referred to zakat, and that he had heard people saying that. Malik said, \"If someone sells his garden or his land, on which are crops or fruit which have not yet ripened, then it is the buyer who has to pay the zakat. If, however, they have ripened, it is the seller who has to pay the zakat, unless paying the zakat is one of the conditions of the sale",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 610
			}
		}
	]
}