{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 611,
			"arabicnumber": 611,
			"text": "Malik said, \"If a man has four awsuq of dates he has harvested, four awsuq of grapes he has picked, or four awsuq of wheat he has reaped or four awsuq of pulses he has harvested, the different categories are not added together, and he does not have to pay zakat on any of the categ ries - the dates, the grapes, the wheat or the pulses - until any one of them comes to five awsuq using the sa of the Prophet, may Allah bless him and grant him peace, as the Messenger of Allah, may Allah bless him and grant him peace, said, 'There is no zakat (to pay) on anything less than five awsuq of dates. 'lf any of the categories comes to five awsuq, then zakat must be paid. If none of the categories comes to five awsuq, then there is no zakat to pay. The explanation of this is that when a man harvests five awsuq of dates (from his palms), he adds them all together and deducts the zakat from them even if they are all of different kinds and varieties. It is the same with different kinds of cereal, such as brown wheat, white wheat, barley and sult, which are all considered as one category. If a man reaps five awsuq of any of these, he adds it all together and pays zakat on it. If it does not come to that amount he does not have to pay any zakat. It is the same (also) with grapes, whether they be black or red. If a man picks five awsuq of them he has to pay zakat on them, but if they do not come to that amount he does not have to pay any zakat. Pulses also are considered as one category, like cereals, dates and grapes, even if they are of different varieties and are called by different names. Pulses include chick- peas, lentils, beans, peas, and anything which is agreed by everybody to be a pulse. If a man harvests five awsuq of pulses, measuring by the aforementioned sa, the sa of the Prophet, may Allah bless him and grant him peace, he collects them all together and must pay zakat on them, even if they are of every kind of pulse and not just one kind.\" Malik said, ''Umar ibn al-Khattab drew a distinction between pulses and wheat when he took zakat from the Nabatean christians. He considered all pulses to be one category and took a tenth from them, and from cereals and raisins he took a twentieth.\" Malik said, \"If some one asks, 'How can pulses be added up all together when assessing the zakat so that there is just one payment, when a man can barter two of one kind for one of another, while cereals can not be bartered at a rate of two to one?', then tell him, 'Gold and silver are collected together when assessing the zakat, even though an amount of gold dinars can be exchanged for many times tha tamount of silver dirhams.' \" Malik said, regarding date palms which are shared equally between two men, and from which eight awsuq of dates are harvested, \"They do not have to pay any zakat on them. If one man owns five awsuq of what is harvested from one piece of land, and the other owns four awsuq or less, the one who owns the five awsuq has to pay zakat, and the other one, who harvested four awsuq or less, does not have to pay zakat. This is how things are done whenever there are associates in any crop, whether the crop is grain or seeds that are reaped, or dates that are harvested, or grapes that are picked . Any one of them that harvests five awsuq of dates, or picks five awsuq of grapes, or reaps five awsuq of wheat, has to pay zakat, and whoever's portion is less than five awsuq does not have to pay zakat. Zakat only has to be paid by someone whose harvesting or picking or reaping comes to five awsuq.\" Malik said, \"The sunna with us regarding anything from any of these categories, i.e. wheat, dates, grapes and any kind of grain o rseed, which has had the zakat deducted from it and is then stored by its owner for a number of years after he has paid the zakat on it until he sell sit, is that he does not have to pay any zakat on the price he sells it for until a year has elapsed over it from the day he made the sale, as long as he got it through (chance) acquisition or some other means and it was not intended for trading. Cereals, seeds and trade-goods are the same, in that if a man acquires some and keeps them for a number of years and then sells them for gold or silver, he does not have to pay zakat on their price until a year has elapsed over it from the day of sale. If, however, the goods were intended for trade then the owner must pay zakat on them when he sells them, as long as he has had them for a year from the day when he paid zakat on the property with which he bought them.\" Malik said, \"The sunna that we are all agreed upon here (in Madina) and which I have heard from the people of knowledge, is that there is no zakat on any kind of fresh (soft) fruit, whether it be pomegranates, peaches, figs or anything that is like them or not like them as long as it is fruit.\" He continued, \"No zakat has to be paid on animal fodder or herbs and vegetables of any kind, and there is no zakat to pay on the price realised on their sale until a year has elapsed over it from the day of sale which counts as the time the owner receives the sum.\" Yahya related to me from Malik from Abdullah ibn Umar from Sulayman ibn Yasar from Irak ibn Malik from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"A muslim does not have to pay any zakat on his slave or his horse",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 611
			}
		}
	]
}