{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"18": "Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 681,
			"arabicnumber": 681,
			"text": "Yahya said that he heard Malik say, \"Someone who eats or drinks out of neglect or forgetfulness during a voluntary fast does not have to repeat his fast, but he should continue fasting for the rest of the day in which he eats or drinks while voluntarily fasting, and not stop fasting. Someone to whom something unexpected happens which causes him to break his fast while he is fasting voluntarily does not have to repeat his fast if he has broken it for a reason, and not simply because he decided to break his fast. Just as I do not think that someone has to repeat a voluntary prayer if he has had to stop it because of some discharge which he could prevent and which meant that he had to repeat his wudu.\" Malik said, \"Once a man has begun doing any of the right actions (al-amal as-saliha) such as the prayer, the fast and the hajj, or similar right actions of a voluntary nature, he should not stop until he has completed it according to what the sunna for that action is. If he says the takbir he should not stop until he has prayed two rakas. If he is fasting he should not break his fast until he has completed that day's fast. If he goes into ihram he should not return until he has completed his hajj, and if he begins doing tawaf he should not stop doing so until he has gone around the Kaba seven times. He should not stop doing any of these actions once he has started them until he has completed them, except if something happens such as illness or some other matter by which a man is excused. This is because Allah, the Blessed and Exalted, says in His Book, 'And eat and drink until the white thread becomes clear to you from the black thread of dawn, (and) then complete the fast until night-time,' (Sura 2 ayat 187), and so he must complete his fast as Allah has said. Allah, the Exalted, (also) says, 'And complete the hajj and the umra for Allah,' and so if a man were to go into ihram for a voluntary hajj having done his one obligatory hajj (on a previous occasion), he could not then stop doing his hajj having once begun it and leave ihram while in the middle of his hajj. Anyone that begins a voluntary act must complete it once he has begun doing it, just as an obligatory act must be completed . This is the best of what I have heard.\" Yahya related to me from Malik that he had heard that Anas ibn Malik used to pay fidya when he had grown old and could no longer manage to do the fast. Malik said, \"I do not consider that to do so is obligatory, but what I like most is that a man does the fast when he is strong enough. Whoever pays compensation gives one mudd of food in place of every day, using the mudd of the Prophet, may Allah bless him and grant him peace",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 681
			}
		}
	]
}