{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"20": "Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 788,
			"arabicnumber": 788,
			"text": "Malik said, \"It is not halal to eat any game that has been hunted in the Haram, or has had a dog set after it in the Haram and then been killed outside the Haram. Anyone that does that has to pay a forfeit for what has been hunted. However, some one that sets his dog after game outside the Haram and then follows it until it is hunted down in the Haram does not have to pay any forfeit, unless he set the dog after the game near to the Haram. The game should not be eaten, however. If he set the dog loose near the Haram then he has to pay a forfeit for the game.\" Malik said, \"Allah, the Blessed and Exalted, says, 'O you who trust, do not kill game while you are in ihram. Whoever of you kills game intentionally has to pay a forfeit commensurate with what he has killed in cattle which two men from among you shall judge, a sacrificial animal which reaches the Kaba, or else he makes a kaffara of either feeding poor people or the equivalent of that in fasting, so that he may taste the consequences of what he has done.' \" (Sura 5 ayat 95). Malik said, \"Someone who hunts game when he is not in ihram and then kills it while he is in ihram is in the same position as someone who buys game while he is in ihram and then kills it. Allah has forbidden killing it, and so a man who does so has to pay a forfeit for it. The position that we go by in this matter is that a forfeit is assessed for anyone who kills game while he is in ihram.\" Yahya said that Malik said, \"The best that I have heard about someone who kills game and is assessed for it is that the game which he has killed is assessed and its value in food is estimated and with that food he feeds each poor man a mudd, or fasts a day in place of each mudd. The number of poor men is considered, and if it is ten then he fasts ten days, and if it is twenty he fasts twenty days, according to how many people there are to be fed, even if there are more than sixty.\" Malik said, \"I have heard that a forfeit is assessed for someone who kills game in the Haram while he is not in ihram in the same way that it is assessed for some one who kills game in the Haram while he is in ihram .\" Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"There are five kinds of animal which it is not wrong for some one in ihram to kill:crows, kites, scorpions, rats and mice, and wild dogs",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 788
			}
		}
	]
}