{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"20": "Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 804,
			"arabicnumber": 804,
			"text": "Yahya related to me from Malik from Yahya ibn Said from Sulayman ibn Yasar that Said ibn Huzaba al-Makhzumi was thrown off his mount while he was in ihram on the road to Makka. He asked after the person in charge of the relay station where he was injured and he found Abdullah ibn Umar, Abdullah ibn az-Zubayr and Marwan ibn al-Hakam there. He told them what had happened to him and all of them said that he should take whatever medicine he had to take and pay compensation for it. Then, when he got better again, he should do umra and come out of his ihram, after which he had to do hajj another year and to offer whatever sacrificial animal he was able to in the future. Malik said, \"This is what we do here (in Madina) if someone is detained by something other than an enemy. And when Abu Ayyub al- Ansari and Habbar ibn al-Aswad came to the day of the sacrifice and had missed the hajj, Umar ibn al-Khattab told them to come out of ihram by doing umra and then to go home free of ihram and do hajj some time in the future and to sacrifice an animal, or, if they could not find one, to fast three days during the hajj and seven days after they had returned to their families.\" Malik said, \"Anyone who is detained from doing hajj after he has gone into ihram, whether by illness or otherwise, or by an error in calculating the month or because the new moon is concealed from him is in the same position as some one who is hindered from doing the hajj and must do the same as he does.\" Yahya said that Malik was asked about the situation of someone from Makka who went into ihram for hajj and then broke a bone or had severe stomach pain, or of a woman who was in labour, and he said, \"Someone to whom this happens is in the same situation as one who is hindered from doing the hajj, and he must do the same as people from outlying regions do when they are hindered from doing the hajj.\" Malik said, about someone who arrived in the months of the hajj with the intention of doing umra, and completed his umra and went into ihram in Makka to do hajj, and then broke a bone or something else happened to him which stopped him from being present at Arafa with everybody else, \"I think that he should stay where he is until he is better and then go outside the area of the Haram, and then return to Makka and do tawaf of the House and say between Safa and Marwa, and then leave ihram. He must then do hajj again another year and offer a sacrificial animal .\" Malik said, about someone who left ihram in Makka, and then did tawaf of the House and say between Safa and Marwa, and then fell ill and was unable to be present with everybody at Arafa, \"If the hajj passes someone by he should, if he can, go out of the area of the Haram and then come back in again to do umra and do tawaf of the House and say between Safa and Marwa, because he had not intended his initial tawaf to be for an umra, and so for this reason he does it again. He must do the next hajj and offer a sacrificial animal. If he is not one of the people of Makka, and something happens to him which stops him from doing the hajj, but he does tawaf of the House and say between Safa and Marwa, he should come out of ihram by doing an umra and then do tawaf of the House a second time, and say between Safa and Marwa, because his initial tawaf and say were intended for the hajj. He must do the next hajj and offer a sacrificial animal",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 804
			}
		}
	]
}