{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"20": "Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 908,
			"arabicnumber": 908,
			"text": "Yahya related to me that Malik said, \"Someone who comes to Makka at or before the new moon of Dhu'l-Hij ja and goes into ihram for the hajj should do the full prayer until he leaves Makka for Mina, and then he should shorten the prayer. This is because he has decided to stay there for more than four nights.\" Yahya related to me from Malik from Yahya ibn Said that he had heard that on the day after the day of sacrifice Umar ibn al-Khattab went out a little after the sun had risen and said the takbir, and everyone repeated it after him. Then he went out a second time the same day when the sun was well up and said the takbir, and everyone repeated it after him. Then he went out a third time after mid-day and said the takbir, and everyone repeated it after him until it resounded from group to group until it reached the House and people knew that Umar had left to throw the stones. Malik said, \"What we do here (in Madina) is to say the takbir during the days of tashriq after each prayer. The first time is when the imam and everyone with him says the takbir after the dhuhr prayer on the day of sacrifice, and the last is when the imam and everyone with him says the takbir after subh on the last of the days of tashriq, after which he stops saying the takbir.\" Malik said, \"The takbirs during the days of tashriq should be done by both men and women, whether they are in a group or by themselves, at Mina or elsewhere, and all of the takbirs should be done. In this everyone follows the imam of the hajj and the people at Mina, because when everyone returns (to Makka) and comes out of ihram they keep the same people as imams while out of ihram (as they did when they were in ihram). Some one who is not doing hajj does not follow them except for the takbirs during the days of tashriq.\" Malik said, \"The 'limited number of days' are the days of tashriq",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 908
			}
		}
	]
}