{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"20": "Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 944,
			"arabicnumber": 944,
			"text": "Malik said, concerning someone who wishes to wear clothes that a person in ihram must not wear, or cut his hair, or touch perfume without necessity, because he finds it easy to pay the compensation, \"No-one must do such things. They are only allowed in cases of necessity, and compensation is owed by whoever does them.\" Malik was asked whether the culprit could choose for himself the method of compensation he makes, and he was asked what kind of animal was to be sacrificed, and how much food was to be given, and how many days were to be fasted, and whether the person could delay any of these, or if they had to be done immediately. He answered, 'Whenever there are alternatives in the Book of Allah for the kaffara, the culprit can choose to do whichever of the alternatives he prefers. As for the sacrifice - a sheep, and as for the fasting - three days. As for the food - feeding six poor men, for every poor man two mudds, by the first mudd, the mudd of the Prophet, may Allah bless him and grant him peace.\" Malik said, \"I have heard one of the people of knowledge saying, 'When a person in ihram throws something and hits game unintentionally and kills it, he must pay compensation. In the same way, someone outside the Haram who throws anything into the Haram and hits game he did not intend to, killing it, has to pay compensation, because the intentional and the mistaken are in the same position in this matter.' \" Malik said, concerning people who kill game together while they are muhrim or in the Haram, \"I think that each one of them owes a full share. If a sacrificial animal is decided for them, each one of them owes one, and if fasting is decided for them, the full fasting is owed by each one of them. The analogy of that is a group of people who kill a man by mistake and the kaffara for that is that each person among them must free a slave or fast two consecutive months.\" Malik said, \"Anyone who stones or hunts game after stoning the jamra and shaving his head but before he has performed the tawaf al-ifada, owes compensation for that game, because Allah the Blessed, the Exalted said, 'And when you leave ihram, then hunt,' and restrictions still remain for someone who has not done the tawaf al-ifada about touching perfume and women.\" Malik said, \"The person in ihram does not owe anything for plants he cuts down in the Haram and it has not reached us that anyone has given a decision of anything for it, but O how wrong is what he has done! \" Malik said, concerning some one who was ignorant of, or who forgot the fast of three days in the hajj, or who was ill during them and so did not fast them until he had returned to his community, \"He must offer a sacrificial animal (hady) if he can find one and if not he must fast the three days among his people and the remaining seven after that.\" Yahya related to me from Malik from Ibn Shihab from clsa ibn Talha that Abdullah ibn Amr ibn al-As said, \"The Messenger of Allah, may Allah bless him and grant him peace, stopped for the people at Mina, and they questioned him and a man came and said to him, 'Messenger of Allah, I was unclear about what to do and I shaved before sacrificing,' and the Messenger of Allah, may Allah bless him and grant him peace, said, 'Sacrifice, and don't worry.' Then another came to him and said 'Messenger of Allah, I was unclear about what to do and I sacrificed before throwing the stones.' He advised, 'Throw, and don't worry.' \" Amr continued, saying that the Messenger of Allah, may Allah bless him and grant him peace, was not asked about anything done before or after without his saying, \"Do it, and don't worry",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 944
			}
		}
	]
}