{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4494,
			"arabicnumber": 4494,
			"text": "Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] berkata, telah menceritakan kepada kami [Ubaidullah] -maksudnya Ubaidullah bin Musa- dari [Ali bin Shalih] dari [Simak bin Harb] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Antara bani Quraidhah dan bani Nadhir yang lebih mulia adalah bani Nadhir. Jika seorang laki-laki bani Quraidhah membunuh laki-laki dari bani Nadhir maka harus diqishah, sementara jika seorang laki-laki dari bani Nadhir membunuh laki-laki dari bani Quraidhah, cukup dengan memberikan tebusan seratus gantang kurma. Ketika Nabi shallallahu 'alaihi wasallam diutus, lalu ada seorang laki-laki dari bani Nadhir membunuh laki-laki dari bani Quraidhah, maka orang-orang dari bani Quraidhah berkata, \"Berikan pembunuh itu kepada kami sehingga kami dapat membunuhnya.\" Orang-orang bani Nadhir kemudian berkata, \"Antara kami dengan kalian ada Nabi Muhammad shallallahu 'alaihi wasallam!\" mereka lalu mendatangi beliau. Kemudian Allah menurunkan ayat: '(dan jika kamu memutuskan perkara mereka, maka putuskanlah perkara itu di antara mereka dengan adil..) ' -Al Maidah: 42-. Al Qisth (adil) itu adalah jiwa dibalas dengan jiwa.\" Kemudian setelah itu turun ayat: '(Apakah hukum Jahilliyah yang mereka kehendaki) ' -Al Maidah: 50-. Abu Dawud berkata, \"Bani Quraidhah dan bani Nadhir keduanya dari keturunan Nabi Harun Alaihis Salam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4495,
			"arabicnumber": 4495,
			"text": "Telah menceritakan kepada kami [Ahmad bin yunus] berkata, telah menceritakan kepada kami [Ubaidullah] -maksudnya Ubaidullah bin Iyad- berkata, telah menceritakan kepada kami [Iyad] dari [Abu Rimtsah] ia berkata; Aku dan bapakku berangkat menemui Nabi shallallahu 'alaihi wasallam, lalu Rasulullah shallallahu 'alaihi wasallam bertanya kepada bapakku: \"Apakah ini anakmu?\" bapakku menjawab, \"Benar, demi Tuhannya Ka'bah.\" Beliau bertanya lagi: \"Apakah itu benar?\" bapakku menjawab, \"Aku bersaksi atasnya.\" Abu Rismtsah berkata, \"Rasulullah shallallahu 'alaihi wasallam lalu tersenyum karena aku mirip dengan bapakku dan karena sumpah yang dilakukannya atas diriku. Kemudian beliau bersabda: \"Ketahuilah, dia tidak akan memikul dosamu dan kamu tidak akan memikul dosanya.\" Lalu beliau membaca ayat: '(dan orang yang berdosa tidak akan memikul dosa orang lain) ' -Qs. Al Isra: 15",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4496,
			"arabicnumber": 4496,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami [Muhammad bin Ishaq] dari [Al Harits bin Fudhail] dari [Sufyan bin Abu Al 'Auja] dari [Abu Syuraih Al AKhuza'i] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendapat musibah berupa pembunuhan atau cacat anggota badan maka ia mempunyai tiga pilihan; minta qishas, memberi maaf, atau meminta tebusan denda. Jika ia menginginkan yang keempat maka halangilah, dan barangsiapa melampaui batas setelah itu maka baginya siksa yang pedih",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4497,
			"arabicnumber": 4497,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Abdullah bin bakr bin Abdullah Al Muzani] dari [Atha bin Abu Maimunah] dari [Anas bin Malik] ia berkata, \"Aku tidak pernah melihat Nabi shallallahu 'alaihi wasallam mendapat pengaduan yang padanya ada Qishas, kecuali beliau menganjurkan untuk memaafkan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4498,
			"arabicnumber": 4498,
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Ada seorang laki-laki dibunuh pada masa Rasulullah shallallahu 'alaihi wasallam. Maka kasus itu diajukan kepada Nabi shallallahu 'alaihi wasallam. Nabi lantas melimpahkan kasus ini kepada wali korban. Si pembunuh lantas menyampaikan uneg-unegnya kepada Nabi ' Wahai Rasulullah, sungguh aku semula tidak berniat membunuhnya! Rasulullah shallallahu 'alaihi wasallam lalu bersabda kepada wali korban: \"Jika ucapan pembunuh itu benar, kemudian kamu membunuhnya, maka kamu masuk neraka.\" Abu Hurairah berkata, \"Lantas wali korban itu pun membebaskan sang pembunuh.\" Abu Hurairah melanjutkan lagi, \"Sang pembunuh saat itu sudah diikat tali, ia pun pulang dengan keadaan terikat tali hingga dijuluki 'Orang terikat tali",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4499,
			"arabicnumber": 4499,
			"text": "Telah menceritakan kepada kami [Ubaidullah bin Umar bin Maisarah Al Jusyami] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Auf] berkata; telah menceritakan kepada kami [Hamzah Abu Umar Al 'Aidzi] berkata, telah menceritakan kepadaku [Alqamah bin Wail] berkata, telah menceritakan kepadaku [Wail bin Hujr] ia berkata, \"Aku pernah di sisi Nabi shallallahu 'alaihi wasallam, lalu didatangkan ke hadapan beliau seorang pembunuh yang pada lehernya telah diikat dengan tali.\" Wail berkata, \"Beliau lalu mengundang wali korban dan bertanya: \"Apa kamu tidak memberi maaf?\" Ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Apa kamu tidak ingin mengambil tebusan?\" ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Apa kamu ingin membunuhnya?\" ia menjawab, \"Benar.\" Beliau bersabda: \"Kalau begitu bawalah ia pergi.\" Ketika wali korban itu beranjak pergi, beliau kembali bertanya: \"Apa kamu tidak memberi maaf?\" ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Apa kamu tidak ingin mengambil tebusan?\" ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Apa kamu ingin membunuhnya?\" ia menjawab, \"Benar.\" Beliau bersabda: \"Kalau begitu bawalah ia pergi.\" Maka pada kali keempatnya beliau bersabda: \"Jika engkau memberinya maaf, maka ia akan menanggung dosanya sendiri dan dosa saudaramu.\" Wail berkata, \"Wali korban itu akhirnya memaafkannya.\" Wail berkata, \"Aku melihat pembunuh melepas tali pengikatnya.\" Telah menceritakan kepada kami [Ubaidullah bin Umar bin Umar bin Maisarah] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] ia berkata; telah menceritakan kepadaku [Jami' bin Mathar] berkata, telah menceritakan kepadaku [Alqamah bin Wail] dengan sanad dan maknanya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4500,
			"arabicnumber": 4500,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4501,
			"arabicnumber": 4501,
			"text": "Telah menceritakan kepada kami [Muhammad bin Auf Ath Tha`i] berkata, telah menceritakan kepada kami [Abdul Qudus Ibnul Hajjaj] berkata, telah menceritakan kepada kami [Yazid bin Atha Al Wasithi] dari [Simak] dari [Alqamah bin Wail] dari [Bapaknya] ia berkata, \"Seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam dengan membawa seorang habsyi, ia berkata, \"Sesungguhnya orang habsyi ini telah membunuh anak saudaraku!\" Beliau bertanya kepada habsyi tersebut: \"Bagaimana kamu membunuhnya?\" Ia menjawab, \"Aku memukul kepalanya dengan kapak, tetapi aku tidak bermaksud membunuhnya.\" Beliau bertanya lagi: \"Apa kamu mempunyai harta untuk membayar tebusan?\" Ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Bagaimana menurutmu jika aku bebaskan kamu, lalu kamu mencari bantuan dana kepada orang-orang?\" Ia menjawab, \"Tidak perlu.\" Beliau bertanya lagi: \"Apa barangkali wali-walimu yang akan memberikan uang tebusannya?\" Ia menjawab, \"Tidak.\" Beliau lalu bersabda kepada laki-laki (wali korban): \"Bawalah ia.\" Maka laki-laki membawa pergi orang habsyi tersebut untuk dibunuh. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Sebenarnya jika laki-laki itu membunuh orang habsyi tersebut, maka kedudukannya akan sama dengan orang habsyi itu.\" Ucapan Rasulullah itu akhirnya sampai ke telinganya laki-laki tersebut, ia lalu berkata, \"Ini aku serahkan kembali. Maka berilah perintah sesukamu.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Bebaskanlah orang habsyi itu.\" Dalam riwayat lain beliau mengatakan, \"Biarkanlah, maka ia akan menanggung dosa temannya (korban) dan dosanya sendiri. Lalu ia akan masuk ke dalam neraka.\" Wali korban itu lantas membebaskannya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4502,
			"arabicnumber": 4502,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari [Abu Umamah bin Sahl] ia berkata, \"Aku pernah bersama [Utsman] saat ia dikepung dalam rumahnya. Dalam rumahnya ada sebuah lorong, jika seseorang masuk ke dalamnya maka ia akan dapat mendengar percakapan orang yang berada di atasnya. Utsman masuk ke dalam lorong itu, lalu ia keluar dengan wajah telah berubah pucat. Ia berkata, \"Mereka berkeinginan untuk membunuhku.\" Ia (perawi) berkata, \"Lalu kami berkata, \"Cukuplah Allah sebagai pelindungmu wahai Amirul Mukminin.\" Utsman bertanya (bingung), \"Kenapa mereka ingin membunuhku?, padahal aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang muslim kecuali karena tiga hal; kafir setelah beriman, zina setelah nikah, dan membunuh jiwa orang lain.\" Demi Allah, aku tidak pernah melakukan perzinaan baik di masa Jahilliyah atau setelah Islam, aku juga tidak pernah berharap untuk mengganti agamaku setelah Allah memberi petunjuk kepadaku, dan aku juga tidak pernah membunuh jiwa seorang pun (tanpa hak). Lalu dengan alasan apa mereka akan membunuhku?\" Abu Dawud berkata, \"Utsman dan Abu Bakar radliallahu 'anhuma tidak pernah minum khamer pada masa Jahilliyah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4503,
			"arabicnumber": 4503,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] ia berkata; telah menceritakan kepada kami [Muhammad bin Ishaq] berkata, telah menceritakan kepadaku [Muhammad bin Ja'far bin Az Zubair] ia berkata; Aku mendengar [Ziyad bin Dhamrah Adh Dhumari]. (dalam jalur lain disebutkan) Telah mengabarkan kepada kami [Wahb bin Bayan] dan [Ahmad bin Sa'id Al Hamdani] keduanya berkata; telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku ['Abdurrahman bin Abu Az Zinad] dari ['Abdurrahman Ibnul Harits] dari [Muhammad bin Ja'far] Bahwasanya ia pernah mendengar [Ziyad bin Sa'd bin Dhumairah As Sulami] -ini adalah hadits Wahb, dan hadits ini lebih lengkap, ia menceritakan kepada Urwah bin Az Zubair- dari [Bapaknya] ia berkata, \" [Musa] dan [kakeknya] pernah mengikuti perang Hunain bersama Rasulullah shallallahu 'alaihi wasallam. ' kemudian kami kembali kepada hadits Wahb, bahwa Muhallim bin Jatstsamah Al Laitsi pernah membunuh seorang laki-laki dari Asyja' (nama tempat) padahal ia telah masuk Islam, dan itu adalah diyat pertama yang ditebus oleh Rasulullah shallallahu 'alaihi wasallam. Uyainah lalu memperbincangkan tentang pembunuhan Al Asyja'I, sebab ia berasal dari Ghathafan. Sementara Al Aqra' bin Habis berbicara membela Muhallim, sebab ia berasal dari Khindiq. Suara mereka meninggi hingga banyak terjadi perselisihan dan kegaduhan. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Wahai Uyainah, tidakkah kamu mau menerima diyat (tebusan)?\" Ia menjawab, \"Demi Allah, tidak! Sehingga kami dapat mendatangkan kerugian dan kesedihan untuk wanita-wanitanya sebagaimana ia telah mendatangkan kerugian dan kesedihan untuk wanita-wanitaku.\" Sa'd berkata, \"Kemudian suara mereka kembali meninggi hingga banyak terjadi perselisihan dan kegaduhan.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Wahai Uyainah, tidakkah kamu mau menerima diyat (tebusan)?\" Uyainah menjawab seperti jawabannya semula, sehingga berdirilah seorang laki-laki dari bani Laits yang bernama Mukaitil, ia membawa senjata dan perisai. Lalu ia berkata, \"Wahai Rasulullah, dalam Islam aku belum pernah mendapatkan tebusan untuk pelanggaran yang dilakukan oleh orang ini (Muhallim si pembunuh) kecuali seperti serombongan kambing yang minum (di sungai) karena haus. Lalu barisan pertama dilempar hingga barisan yang terakhir lari menjauh (maksudnya; adanya qishah itu agar yang lain takut dan mengambil pelajaran sebagaimana kambing yang dilempar agar yang lain takut dan pergi). Tegakkanlah sunnah sekarang dan rubahlah esok hari.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Lima puluh (unta) dibayar tunai dan lima puluh lagi ketika tiba di Madinah.\" Itu terjadi dalam salah satu safar beliau. Sementara Muhallim adalah seorang laki-laki tinggi yang berkulit coklat, ia duduk di antara orang banyak. Dan kawan-kawannya masih saja menolongnya hingga ia terbebas dari pembunuhan (qishas). Muhallim lalu duduk di sisi Rasulullah shallallahu 'alaihi wasallam dengan meneteskan air mata. Ia lalu berkata, \"Wahai Rasulullah, aku telah melakukan sesuatu sebagaimana yang engkau telah ketahui (membunuh), aku sekarang bertaubat kepada Allah Tabaaraka Wa Ta'ala, maka mintakan aku ampunan kepada Allah Azza Wa Jalla.\" Rasulullah shallallahu 'alaihi wasallam lantas bersabda: \"Apakah kamu membunuhnya dengan senjatamu padahal ia masih diawalmula keislamannya? Ya Allah, jangan engkau ampuni Muhallim.\" Beliau ucapkan kata-kata itu dengan suara yang keras.\" Abu Salamah menambahkan, \"Muhallim lalu bangkit dan mengusap air matanya dengan ujung selendang.\" Ibnu Ishaq berkata, \"Kaumnya merasa yakin bahwa Rasulullah shallallahu 'alaihi wasallam akan memintakan ampun untuk Muhallim setelah itu.\" Abu Dawud berkata, \"An Nadhr bin Syumail mengatakan bahwa Al Ghiyar adalah diyat (tebusan)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4504,
			"arabicnumber": 4504,
			"text": "Telah menceritakan kepada kami [Musaddad bin Musarhad] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi`b] ia berkata; telah menceritakan kepadaku [Sa'id Ibnu Abu Sa'id] ia berkata; Aku mendengar [Abu Syuraih Al ka'bi] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai penduduk Khuza'ah! Ketahuilah oleh kalian semua, kalian telah membunuh orang Hudzail ini, sesungguhnya aku adalah penggantinya (yang akan membayarkan diyatnya), karena itu siapa yang terbunuh setelah perkataanku ini, maka bagi ahli warisnya aku beri dua pilihan; minta tebusan atau balas bunuh",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4505,
			"arabicnumber": 4505,
			"text": "Telah menceritakan kepada kami [Abbas Ibnul Walid bin Mazyad] berkata, telah mengabarkan kepadaku [Bapakku] berkata, telah menceritakan kepada kami [Al Auza'i] berkata, telah menceritakan kepadaku [Yahya]. (dalam jalur lain disebutkan) telah menceritakan kepada kami [Ahmad bin Ibrahim] berkata, telah menceritakan kepadaku [Abu Dawud] berkata, telah menceritakan kepada kami [Harb bin Syaddad] berkata, telah menceritakan kepada kami [Yahya bin Abu Katsir] berkata, telah menceritakan kepadaku [Abu Salamah bin 'Abdurrahman] berkata, telah menceritakan kepada kami [Abu Hurairah] ia berkata, \"Saat pembukaan kota Makkah Rasulullah shallallahu 'alaihi wasallam berdiri dan berkhutbah, beliau bersabda: \"Barang siapa di antara kalian ada yang (keluarganya) terbunuh, maka ia mempunyai dua pilihan terbaik; minta tebusan atau balas bunuh.\" Lalu seorang laki-laki dari penduduk Yaman yang bernama Abu Syah berdiri dan berkata, \"Wahai Rasulullah, tuliskanlah untukku.\" Al Abbas berkata, \"Kalian menulislah untukku.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Buatlah tulisan untuk Abu Syah.\" Dan ini adalah lafadz hadits dari Ahmad. Abu Dawud berkata, \"kalian menulislah untukku' maksudnya adalah khutbah yang disampaikan oleh Nabi shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4506,
			"arabicnumber": 4506,
			"text": "Telah menceritakan kepada kami [Muslim] berkata, telah menceritakan kepada kami [Muhammad bin rasyid] berkata, telah menceritakan kepada kami [Sulaiman bin Musa] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang mukmin tidak boleh dibunuh karena orang kafir (sebagai qishas). Maka barangsiapa membunuh seorang mukmin dengan sengaja, perkaranya diserahkan kepada wali korban; jika mereka berkehendak maka mereka boleh balas membunuh, dan jika mereka berkehendak maka mereka boleh minta tebusan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4507,
			"arabicnumber": 4507,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami [Mathar Al Warraq] dan aku mengira itu dari [Al Hasan] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku tidak akan memberi maaf kepada orang yang membunuh setelah ia mengambil tebusannya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4508,
			"arabicnumber": 4508,
			"text": "Telah menceritakan kepada kami [Yahya bin Habib bin Arabi] berkata, telah menceritakan kepada kami [Khalid Ibnul Harits] berkata, telah menceritakan kepada kami [Syu'bah] dari [Hisyam bin Zaid] dari [Anas bin Malik] berkata, \"Seorang wanita Yahudi datang kepada Rasulullah shallallahu 'alaihi wasallam dengan membawa daging kambing yang telah diberi racun, lalu beliau memakannya. Setelah itu, wanita Yahudi tersebut dibawa ke hadapan Rasulullah shallallahu 'alaihi wasallam. beliau lantas menanyakan tentang hal tersebut, wanita itu menjawab, \"Aku ingin membunuhmu!\" beliau bersabda: \"Allah tidak akan memberikan kemudahan bagimu untuk melakukan itu, atau beliau mengatakan, \"untuk melakukan (hal itu) terhadapku.\" Para sahabat berkata, \"Bagaimana jika kami membunuhnya saja?\" beliau bersabda: \"Jangan.\" Anas berkata, \"Dan aku masih melihat sisa-sisa racun itu di tenggorokan Rasulullah shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4509,
			"arabicnumber": 4509,
			"text": "Telah menceritakan kepada kami [Dawud bin Rasyid] berkata, telah menceritakan kepada kami [Abbad Ibnul Awwam]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Harun bin Abdullah] berkata, telah menceritakan kepada kami [Sa'id bin Sulaiman] berkata, telah menceritakan kepada kami [Abbad] dari [Sufyan bin Husain] dari [Az Zuhri] dari [Sa'id] dan [Abu Salamah]. [Harun] berkata; dari [Abu Hurairah] ia berkata, \"Seorang wanita Yahudi memberi hadiah Nabi shallallahu 'alaihi wasallam daging kambing yang telah diberi racun.\" Abu Hurairah melanjutkan, \"Tetapi Nabi shallallahu 'alaihi wasallam tidak menyentuh wanita itu sama sekali (yakni dengan qishash).\" Abu Dawud berkata, \"Wanita ini adalah saudara perempuan dari perempuan Yahudi yang meracuni Nabi shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4510,
			"arabicnumber": 4510,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Dawud Al Mahri] berkata, telah menceritakan kepada kami [Ibnu Wahb] ia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata, \" [Jabir bin Abdullah] pernah menceritakan bahwa seorang wanita Yahudi dari penduduk Khaibar menaburi racun pada daging kambing panggang. Kemudian ia menghadiahkan daging itu kepada Rasulullah shallallahu 'alaihi wasallam. Rasulullah shallallahu 'alaihi wasallam lantas mengambil lengan kambing tersebut dan memakannya bersama para sahabatnya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka semua: \"Angkatlah tangan kalian semuanya (jangan dimakan lagi).\" Rasulullah shallallahu 'alaihi wasallam kemudian mengirim utusan untuk memanggil wanita Yahudi tersebut. Lalu beliau bertanya kepada wanita itu: \"Apakah kamu memberi racun pada daging ini?\" wanita Yahudi itu menjawab, \"Siapa yang memberimu kabar?\" beliau menjawab: \"Yang memberiku kabar adalah apa yang ada di tanganku ini.\" wanita Yahudi itu berkata, \"Benar.\" Beliau bertanya lagi: \"Apa yang kamu inginkan?\" wanita Yahudi itu menjawab, \"Dalam hati aku berkata, 'Jika dia memang seorang Nabi maka dia tidak akan mendapatkan bahaya, tetapi jika bukan seorang Nabi maka kami dapat beristirahat darinya'. Rasulullah shallallahu 'alaihi wasallam lalu memaafkan wanita Yahudi tersebut dan tidak menghukumnya. Para sahabat beliau yang ikut makan daging kambing itu meninggal, sementara Rasulullah shallallahu 'alaihi wasallam membekam pada bagian tengkuknya karena daging yang dimakannya. Lalu beliau dibekam oleh Abu Hind -seorang mantan budak bani Bayadhah dari kaum Anshar- dengan menggunakan tanduk dan pisau tajam.\" Telah menceritakan kepada kami [Wahb bin Baqiyyah] berkata, telah menceritakan kepada kami [Khalid] dari [Muhammad bin Amru] dari [Abu Salamah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah diberi hadiah kambing panggang oleh seorang wanita Yahudi Khaibar, seperti dalam hadits Jabir. Ia (perawi) berkata, \"Bisyr bin Al Bara bin Ma'rur Al Anshari meninggal dunia (karena makan daging kambing), maka Rasulullah mengutus seseorang untuk menjemput wanita Yahudi tersebut. Beliau bersabda: \"Apa yang mendorongmu untuk melakukan itu?\" kemudian disebutkan sebagaimana dalam hadits Jabir. Rasulullah shallallahu 'alaihi wasallam kemudian memerintahkan supaya wanita itu dihukum, maka wanita itu pun dibunuh. Namun ia tidak menyebutkan tentang cerita bekam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4511,
			"arabicnumber": 4511,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4512,
			"arabicnumber": 4512,
			"text": "Telah menceritakan kepada kami [Wahab bin Baqiyyah] dari [Khalid] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menerima hadiah namun tidak makan zakat.\" Telah menceritakan kepada kami [Wahb bin Baqiyyah] -dalam riwayat lain- dari [Khalid] dari [Muhammad bin Amru] dari [Abu Salamah] -namun ia tidak menyebutkan Abu Hurairah, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menerima hadiah namun tidak makan zakat.\" Ia menambahkan, \"Maka ada seorang wanita Yahudi Khaibar yang memberi hadiah daging guling yang telah dilumuri racun kepada beliau. Rasulullah shallallahu 'alaihi wasallam dan para sahabatnya lalu makan daging kambing tersebut. Namun kemudian, beliau bersabda: \"Angkatlah tangan kalian (berhenti makan), karena sesungguhnya daging kambing ini telah memberiku kabar bahwa ia telah dibubuhi racun.\" Bisyr Ibnul Al Bara bin Ma'rur Al Anshari akhirnya meninggal dunia. Rasulullah kemudian mengutus utusan kepada wanita Yahudi tersebut. Beliau bertanya: \"Apa yang mendorongmu untuk melakukan hal itu?\" Wanita itu menjawab, \"Jika engkau seorang Nabi, maka apa yang aku lakukan tidak akan membahayakanmu. Namun jika engkau hanya seorang raja, maka dengan begitu aku telah mengistirahatkan manusia darimu.\" Rasulullah shallallahu 'alaihi wasallam lantas memerintahkan agar wanita itu dibunuh, maka ia pun dibunuh. Kemudian beliau berkata pada saat sakit yang membawanya kepada kematian: \"Aku masih merasakan apa yang pernah aku makan di Khaibar, dan sekarang adalah waktu terputusnya punggungku (kematianku)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4513,
			"arabicnumber": 4513,
			"text": "Telah menceritakan kepada kami [Makhlad bin Khalid] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ibnu Ka'b bin Malik] dari [Bapaknya] berkata, \"Ummu Mubasysyir berkata kepada Nabi shallallahu 'alaihi wasallam pada saat sakit yang menghantarkan beliau kepada kematian, \"Apa yang engkau keluhkan ya Rasulullah? Aku tidak mengeluhkan apapun atas anakku kecuali daging kambing beracun yang ia makan bersamamu waktu di Khaibar.\" Nabi shallallahu 'alaihi wasallam lalu menjawab: \"Aku juga tidak mengeluhkan apapun selain daging kambing beracun itu, dan sekarang adalah waktu terputusnya punggungku (kematian).\" Abu Dawud berkata, \"Barangkali Abdurrazaq menceritakan hadits ini secara mursal dari Ma'mar, dari Az Zuhri, dari Nabi shallallahu 'alaihi wasallam. Dan barangkali ia juga menceritakan hadits dari Az Zuhri, dari 'Abdurrahman bin Ka'b bin Malik.\" Abdurrazaq menyebutkan bahwa Ma'mar menceritakan hadits ini kepada mereka sekali waktu secara mursal. Namun, sekali waktu mereka yang menulisnya sedangkan dia menceritakannya kepada mereka. Dan semua itu menurut kami shahih\" Abdurrazaq berkata, \"Ketika Ibnul Mubarak datang kepada Ma'mar, maka Ma'mar menyandarkan kepada Ibnu Mubarak beberapa hadits yang ia mauqufkan.\" Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Ibrahim bin Khalid] berkata, telah menceritakan kepada kami [Rabah] dari [Ma'mar] dari [Az Zuhri] dari ['Abdurrahman bin Abdullah bin ka'b bin malik] dari ibunya Ummu Mubasysyir. Abu Sa'id Ibnul A'rabi berkata; demikian ia berkata dari ibunya. Namun yang benar adalah; dari [bapaknya], dari [Ummu Mubasysyir], ia berkata, \"Aku masuk menemui Nabi shallallahu 'alaihi wasallam... lalu ia menyebutkan sesuai makna hadits Makhlad bin Khalid, seperti hadits Jabir. Ia (perawi) berkata, \"Bisyr Ibnul Bara bin Ma'rur meninggal, maka beliau mengutus seseorang kepada wanita Yahudi tersebut. Beliau bertanya: \"Apa yang mendorongmu untuk melakukan hal itu?\" -lalu ia menyebutkan seperti hadits Jabir- Rasulullah shallallahu 'alaihi wasallam lalu memerintahkan untuk menghukum wanita tersebut, maka wanita itu pun dibunuh.\" Dan ia tidak menyebutkan tentang cerita bekam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4514,
			"arabicnumber": 4514,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4515,
			"arabicnumber": 4515,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4516,
			"arabicnumber": 4516,
			"text": "Telah menceritakan kepada kami [Ali Ibnul Ja'd] berkata, telah menceritakan kepada kami [Syu'bah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Qatadah] dari [Al Hasan] dari [Samurah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membunuh budaknya maka kami akan membunuhnya, dan barangsiapa memotong hidung budaknya maka kami akan memotong hidungnya.\" Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Mu'adz bin Hisyam] berkata, telah menceritakan kepadaku [Bapakku] dari [Qatadah] dengan sanadnya yang sama. Ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengebiri budaknya maka kami akan mengebirinya.\" Kemudian ia menyebutkan sebagaimana hadits Syu'bah dan Hamamd.\" Abu Dawud berkata, \" [Abu Dawud Ath Thayalisi] meriwayatkannya dari [Hisyam] seperti hadits [Mu'adz]. Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Sa'id bin Amir] dari [Ibnu Abu Arubah] dari [Qatadah] dengan sanad [Syu'bah] seperti hadits itu. Hanya saja ia menambahkan, bahwa Al Hasan melupakan hadits ini. Ia menyebutkan, \"Orang merdeka tidak boleh dibunuh karena seorang budak (yakni qishas)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4517,
			"arabicnumber": 4517,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4518,
			"arabicnumber": 4518,
			"text": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Al Hasan] ia berkata, \"Orang merdeka tidak boleh diqishas karena (membunuh) seorang budak",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4519,
			"arabicnumber": 4519,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Hasan bin Tasnim Al 'Ataki] berkata, telah menceritakan kepada kami [Muhammad bin Bakr] berkata, telah mengabarkan kepada kami [Sawwar Abu Hamzah] berkata, telah menceritakan kepada kami [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam sambil berteriak, ia mengatakan, \"Wahai Rasulullah, budak wanitanya!\" beliau bersabda: \"Celaka kamu, ada apa denganmu?\" ia menjawab, \"Keburukkan, ia (budak) melihat budak wanita milik tuannya. Lalu tuannya cemburu hingga ia memotong kemaluannya.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Bawa kemari laki-laki itu.\" Laki-laki itu kemudian dicari namun tidak ketemu. Rasulullah shallallahu 'alaihi wasallam lantas bersabda: \"Engkau sekarang merdeka, silahkan pergi.\" Ia lalu bertanya, \"Wahai Rasulullah, kepada siapa aku minta pertolongan?\" beliau menjawab: \"Kepada setiap mukmin, atau beliau mengatakan, \"Kepada setiap muslim.\" Abu Dawud berkata, \"Budak yang dimerdekakan itu namanya adalah Rauh bin Dinar.\" Abu Dawud berkata lagi, \"Sementara orang yang memotong kemaluan budak itu namanya adalah Zinba'.\" Abu Dawud berkata, \"Zinba' Abu Rauh juga mantan budak",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4520,
			"arabicnumber": 4520,
			"text": "Telah menceritakan kepada kami [Ubaidullah bin Umar bin Masarah] dan [Muhammad bin Ubaid] secara makna, keduanya berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] dan [Rafi' bin Khadij] berkata, \"Muhayishah bin Mas'ud dan Abdullah bin Sahl berangkat menuju Khaibar, namun keduanya berpisah di perkebunan kurma. Lalu Abdullah bin Sahl mati terbunuh, dan mereka menuduh orang-orang Yahudilah yang telah membunuhnya. Kemudian saudaranya bernama 'Abdurrahman bin Sahl datang bersama dua orang anak pamannya, Huwayishah dan Muhayishah kepada Nabi shallallahu 'alaihi wasallam. Lantas 'Abdurrahman menceritakan perihal saudaranya -dia adalah yang paling kecil di antara saudaranya-, beliau pun bersabda; \"Hendaknya dimulai dari yang lebih besar, hendaknya dimulai dari yang lebih besar. Atau beliau bersabda; \"Hendaknya yang lebih besar yang memulai.\" Lalu keduanya menceritakan perihal saudaranya (yang terbunuh), Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaklah lima puluh orang dari kalian bersumpah atas seorang dari mereka (Yahudi yang membunuh), dengan demikian maka akan dapat menebus tulang belulang saudaramu yang telah rapuh.\" Mereka menjawab, \"Kami tidak melihat peristiwanya secara langsung, lalu bagaimana kami akan bersumpah!\" beliau bersabda: \"Orang-orang yahudi itu akan bersih dari tuduhan kalian jika mereka bisa memberikan sumpah dari lima puluh orang dari kalangan mereka.\" Para sahabat menimpali, \"Mereka itu orang-orang kafir!\" Ia (perawi) berkata, \"Lantas Rasulullah shallallahu 'alaihi wasallam menebus (diyat) jiwa korban itu dengan harta pribadinya sendiri.\" Sahl berkata, \"Suatu hari aku masuk ke dalam kandang unta mereka, tiba-tiba aku aku ditendang oleh seekor unta betina dengan kakinya.\" Hammad berkomentar, \"Beginilah haditsnya, atau seperti inilah kira-kira.\" Abu Dawud berkata, \" [Bisyr Ibnul Mufadhdhal] dan [Malik] meriwayatkannya dari [Yahya bin Sa'id]. Ia menyebutkan dalam hadits tersebut, \"Apakah kalian bersedia bersumpah dengan lima puluh kali sumpah, kemudian kalian berhak untuk menuntut balas atas pembunuhan sahabat kalian ini?\" namun Bisyr tidak menyebutkan kata 'darah'. [Abdah] juga berkata dari [Yahya] sebagaimana yang dikatakan oleh [Hammad].\" [Ibnu Uyainah] juga meriwayatkan dari [Yahya], namun ia memulai dengan kalimat, \"Mereka orang-orang Yahudi akan bersih dari tuduhan kalian jika mereka memberikan lima puluh sumpah kepada kalian, dan ia tidak menyebutkan lafadh 'berhak'. Abu Dawud berkata, \"Dan inilah kesamaran dari Ibnu Uyainah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4521,
			"arabicnumber": 4521,
			"text": "Telah menceritakan kepada kami [Ahmad bin Amru bin As Sarh] berkata, telah mengabarkan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Malik] dari [Abu Laila bin Abdullah bin 'Abdurrahman bin Sahl] dari [Sahl bin Abu Hatsmah] Bahwasanya ia dan beberapa tokoh kaumnya mengabarkan kepadanya, bahwa Abdullah bin Sahl dan Muhayishah keluar menuju Khaibar karena penderitaan yang mereka alami. Muhayyishah lalu didatangkan, lalu dikabarkan bahwa Abddullah bin Sahl dibunuh dan dibuang ke dalam lubang atau sumur. Muhayishah lalu mendatangi orang-orang Yahudi dan bertanya, \"Demi Allah, kalian yang telah membunuhnya?\" orang-orang Yahudi itu menjawab, \"Demi Allah, kami tidak membunuhnya.\" Muhayishah lalu pergi hingga sampai ke Madinah, ia lantas ceritakan semua kejadian tersebut kepada kaumnya. Kemudian, ia bersama saudaranya Huwayishah -dan ia umurnya lebih tua- serta 'Abdurrahman bin Sahl pergi menghadap Rasulullah shallallahu 'alaihi wasallam. Muhayishah angkat bicara -karena dialah yang waktu itu di Khaibar-, namun Rasulullah shallallahu 'alaihi wasallam bersabda: \"Yang tua dahulu, yang tua dahulu.\" Huwayishah lalu berbicara dan diteruskan oleh Muhayishah, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mereka mau mambayar diyat untuk temanmu atau mereka mengumumkan peperangan!\" Rasulullah shallallahu 'alaihi wasallam kemudian menulis surat kepada mereka menuntut perkara tersebut, lalu mereka membalas (surat beliau) dengan menulis jawaban, \"Demi Allah kami tidak membunuhnya.\" Rasulullah shallallahu 'alaihi wasallam lalu berkata kepada Huwayishah, Muhayishah dan 'Abdurrahman bin Sahl, \"Apakah kalian mau bersumpah, sehingga kalian berhak mendapatkan hak atas pembunuhan saudara kalian?\" mereka menjawab, \"Tidak.\" Beliau bersabda: \"(Padahal) orang-orang Yahudi akan bersumpah atas tuduhan kalian.\" Mereka menimpali, \"Mereka bukan orang-orang muslim!\" Rasulullah shallallahu 'alaihi wasallam lalu menebus diyat itu dengan harta pribadinya, beliau kirimkan unta hingga unta-unta tersebut di masukkan ke dalam rumah mereka.\" Sahl berkata, \"Salah satu unta tersebut bahkan telah menendangku, yakni unta merah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4522,
			"arabicnumber": 4522,
			"text": "Telah menceritakan kepada kami [Mahmud bin Khalid] dan [Katsir bin Ubaid] keduanya berkata; telah menceritakan kepada kami. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Ash Shabbah bin Sufyan] berkata, telah mengabarkan kepada kami [Al Walid] dari [Abu Amru] dari [Amru bin Syu'aib] dari Rasulullah shallallahu 'alaihi wasallam bahwasanya beliau membunuh laki-laki dari bani Nashr bin Malik karena sumpah, yaitu di suatu tempat dataran rendah bernama Rugha, di sisi pantai. Ia (Mahmud) berkata, \"Baik yang membunuh atau yang dibunuh adalah dari mereka (bani Nashr).\" Ini adalah lafadz Mahmud, yaitu Mahmud mempunyai lafdh sendiri (dalam riwayatnya berupa; \"di suatu tempat dataran rendah bernama Rugha', di sisi pantai)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4523,
			"arabicnumber": 4523,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Muhammad bin Ash Shabbah Az Za'farani] berkata, telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Sa'id bin Ubaid Ath Tha`i] dari [Busyair bin Yasar] ia berkeyakinan bahwa seorang laki-laki Anshar yang bernama [Sahl bin Abu Hatsmah] mengabarkan kepadanya, bahwa seorang laki-laki dari kaumnya berangkat menuju Khaibar. Lalu mereka mereka berpencar, hingga mereka mendapati salah seorang dari mereka telah terbunuh. Mereka pun berkata kepada orang-orang yang mereka temui, \"Kalian telah membunuh saudara kami!\" orang-orang itu menjawab, \"Kami tidak membunuhnya, dan kami juga tidak melihat seorang pembunuh.\" Maka kami pun berangkat menuju Nabi shallallahu 'alaihi wasallam. Ia (perawi) berkata, \"Beliau bertanya kepada mereka, \"Apakah kalian datang kepadaku dengan membawa bukti, siapa yang membunuhnya (temanmu)?\" mereka menjawab, \"Kami tidak punya bukti.\" Beliau menimpali: \"Mereka (orang-orang Yahudi) akan bersumpah atas kalian!\" mereka berkata, \"Kami tidak ridha dengan sumpahnya orang-orang yahudi.\" Nabi shallallahu 'alaihi wasallam tidak ingin kematiannya itu menjadi sia-sia, maka beliau pun membayar diyat tersebut dengan seratus ekor unta dari unta-unta sedekah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4524,
			"arabicnumber": 4524,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Ali bin Rasyid] berkata, telah mengabarkan kepada kami [Husyaim] dari [Abu hayyan At taimi] berkata, telah menceritakan kepada kami [Abayah bin Rifa'ah] dari [Rafi' bin Khadij] ia berkata, \"Seorang laki-laki Anshar terbunuh di Khaibar, maka para walinya datang menemui Nabi shallallahu 'alaihi wasallam. Mereka menceritakan kepada beliau perihal terbunuhnya saudaranya tersebut. Beliau lantas bertanya: \"Apakah kalian mempunyai dua saksi yang melihat pembunuhan itu?\" mereka menjawab, \"Wahai Rasulullah, tidak ada seorang muslim pun, mereka semua orang-orang Yahudi! Dan mungkin mereka akan lebih berani lagi untuk melakukan yang lebih besar dari ini.\" Rafi' bin Khadij berkata, \"Beliau lalu memilih lima puluh orang dari mereka untuk disumpah, namun mereka menolak. Maka diyat itu akhirnya dibayar oleh Nabi shallallahu 'alaihi wasallam dari harta sendiri",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4525,
			"arabicnumber": 4525,
			"text": "Telah menceritakan kepada kami [Abdul Aziz bin Yahya Al Harrani] berkata, telah menceritakan kepadaku [Muhammad] -maksudnya Muhammad bin Salamah- dari [Muhammad bin Ishaq] dari [Muhammad bin Ibrahim Ibnul Harits] dari ['Abdurrahman bin Bujaid] ia berkata; Demi Allah, Sahl masih samar dalam haditsnya. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam menulis surat kepada orang-orang Yahudi, 'Telah didapati di antara kalian korban pembunuhan, maka tebuslah diyatnya'. Lalu orang-orang Yahudi itu memberi balasan dengan memberikan sumpah sebanyak lima puluh kali, 'kami tidak membunuhnya, dan kami juga tidak tahu siapa pembunuhnya'. Ia (perawi) berkata, \"Rasulullah shallallahu 'alaihi wasallam lalu menebus diyat itu dengan seratus ekor unta miliknya sendiri",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4526,
			"arabicnumber": 4526,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah bin 'Abdurrahman] dan [Sulaiman bin Yasar] dari [Beberapa lelaki] Anshar bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada orang-orang Yahudi, dan beliau memulai dari mereka, \"Apakah ada lima puluh orang dari kalian yang mau bersumpah?\" namun mereka tidak ada yang bersedia. Lalu beliau berkata kepada orang-orang Anshar: \"Kalian berhak (untuk balas bersumpah).\" Mereka bertanya, \"Wahai Rasulullah, apakah kami harus bersumpah untuk sesuatu yang kami tidak ketahui!\" Rasulullah shallallahu 'alaihi wasallam memberi putusan bahwa diyat itu menjadi tanggungan bagi orang-orang Yahudi, sebab korban pembunuhan itu ada pada mereka",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4527,
			"arabicnumber": 4527,
			"text": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Hammam] dari [Qatadah] dari [Anas] berkata, \"Seorang budak wanita ditemukan dalam keadaan kepalanya telah retak di antara dua batu, ia lalu ditanya, \"Siapa yang melakukan ini? Apakah si fulan, apakah si fulan?\" Hingga disebutlah nama seorang Yahudi dengan isyarat kepalanya. Maka yahudi itu ditangkap dan Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk meremukkan kepalanya dengan batu (sebagaimana yang dilakukannya kepada budak tersebut)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4528,
			"arabicnumber": 4528,
			"text": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Ayyub] dari [Abu Qilabah] dari [Anas] berkata, \"Seorang Yahudi membunuh serang wanita Anshar untuk merebut perhiasannya. Yahudi itu lalu membuang budak wanita tersebut ke dalam sumur tua dan menghimpit kepalanya dengan batu. Yahudi itu akhirnya ditangkap dan dibawa ke hadapan Nabi shallallahu 'alaihi wasallam, beliau lalu memerintahkan agar yahudi itu dirajam hingga mati, maka yahudi itu dirajam hingga mati.\" Abu Dawud berkata, \" [Ibnu Juraij] meriwayatkannya dari [Ayyub] seperti itu pula",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4529,
			"arabicnumber": 4529,
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ibnu Idris] dari [Syu'bah] dari [Hisyam bin Zaid] dari kakeknya [Anas] ia berkata, \"Seorang budak wanita memiliki perhiasan dari perak, lalu seorang Yahudi memukul kepalanya dengan batu hingga retak. Rasulullah shallallahu 'alaihi wasallam kemudian masuk menemui budak wanita itu di saat akhir dari hidupnya. Beliau bertanya: \"Siapa yang membunuhmu, apakah si fulan yang melakukannya?\" Dengan isyarat kepalanya ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Siapa yang membunuhmu, apakah si fulan yang melakukannya?\" Dengan isyarat kepalanya ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Siapa yang membunuhmu, apakah si fulan yang melakukannya?\" Dengan isyarat kepala ia menjawab, \"Benar.\" Rasulullah shallallahu 'alaihi wasallam kemudian memerintahkan untuk menangkap pembunuh tersebut, maka pembunuh itu pun dibunuh dengan dihimpit (dibenturkan kepalanya) antara dua batu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4530,
			"arabicnumber": 4530,
			"text": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Musaddad] keduanya berkata; telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah mengabarkan kepada kami [Sa'id bin Abu Arubah] dari [Qatadah] dari [Al Hasan] dari [Qais bin Ubad] ia berkata, \"Aku bersama Al Asytar berangkat menemui [Ali radliallahu 'anhu]. Kami lalu bertanya, \"Apakah Rasulullah shallallahu 'alaihi wasallam memberimu suatu wasiat yang tidak disampaikan kepada manusia secara umum?\" Ali menjawab, \"Tidak, kecuali apa yang ada dalam catatanku ini -Musaddad menyebutkan- \"Ali lalu mengeluarkan sebuah catatan.\" -Dan Ahmad menyebutkan- \"catatan yang ada pada sarung pedangnya.\" Dalam catatan itu disebutkan, \"orang-orang yang beriman itu darahnya sama (dalam hal qishash dan tebusan), mereka saling membantu dengan sesamanya untuk menghadapi orang lain (kafir), dan orang-orang yang paling dekat dengan mereka yang mukmin itu dapat menanggung mereka. Ketahuilah, seorang mukmin tidak boleh dibunuh karena membunuh seorang kafir (sebagai qishas), dan juga tidak boleh membunuh seseorang yang berada dalam ikatan perjanjiannya. Siapa saja yang berbuat kejahatan maka dosanya ia tanggung sendiri, dan barangsiapa berbuat kejahatan atau melindungi seorang penjahat, maka ia akan mendapat laknat Allah, malaikat dan semua manusia.\" [Musaddad] menyebutkan dari [Ibnu Abu Arubah], \"Lalu Ali mengeluarkan catatan.\" Telah menceritakan kepada kami [Ubaidullah bin Umar] berkata, telah menceritakan kepada kami [Husyaim] dari [Yahya bin Sa'id] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda, lalu beliau menyebutkan sebagaimana hadits Ali. Hanya saja perawi menambahkan, \"Orang-orang yang ada di tempat yang jauh (perbatasan) memberikan perlindungannya, yang kuat melindungi yang lemah dan ikut perang melindungi mereka yang berada di rumah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4531,
			"arabicnumber": 4531,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4532,
			"arabicnumber": 4532,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abdul Wahhab bin Najdah Al Hauthi] dengan satu makna, keduanya berkata; telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] bahwa Sa'd bin Ubadah berkata, \"Wahai Rasulullah, jika seorang laki-laki mendapati laki-laki (lain) bersama isterinya, apakah ia boleh membunuhnya?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidak.\" Sa'd berkata, \"Baiklah, demi Dzat yang memuliakanmu dengan kebenaran.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Dengarkanlah apa yang disampikan oleh pemimpinmu.\" Abdul Wahhab berkata dengan redaksi, \"Yakni kepada apa yang disampaikan oleh Sa'd",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4533,
			"arabicnumber": 4533,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] bahwa Sa'd bin Ubadah berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Apa pendapatmu jika aku mendapati isteriku bersama laki-laki asing, apakah aku harus menahan diri hingga aku dapat menghadirkan empat orang saksi?\" Beliau menjawab: \"Ya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4534,
			"arabicnumber": 4534,
			"text": "Telah menceritakan kepada kami [Muhammad bin Dawud bin Sufyan] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] berkata, \"Nabi shallallahu 'alaihi wasallam mengutus Abu Jahm bin Hudzaifah sebagai penengah dalam persengketaan. Namun ada seorang laki-laki laki-laki yang memutar balikkan fakta hingga Abu jahm memukulnya hingga cidera. Mereka pun mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, kami minta qishsash! ' Rasulullah shallallahu 'alaihi wasallam kemudian berkata, \"Bagi kalian begini dan begini, \" namun mereka tidak rela. Beliau bersabda lagi: \"Bagi kalian begini dan begini, \" namun mereka tidak rela. Beliau bersabda lagi: \"Bagi kalian begini dan begini, ' mereka akhirnya rela. Setelah itu Nabi shallallahu 'alaihi wasallam bersabda: \"Aku akan berpidato di hadapan orang-orang petang nanti dan mengabarkan kepada mereka bahwa kalian telah rela.\" Mereka menjawab, \"Ya.\" Rasulullah shallallahu 'alaihi wasallam lalu berpidato: \"Orang-orang bani Laits telah mendatangiku menginginkan qishsas, lalu aku tawarkan kepada mereka begini dan begini hingga mereka rela, maka apakah kalian juga rela?\" Mereka menjawab, \"Tidak.\" Orang-orang Muhajirin ingin menghajar mereka, namun Rasulullah shallallahu 'alaihi wasallam melarang mereka melakukan hal itu, sehingga mereka pun menahan diri. Kemudian beliau memanggil mereka semua dan berpidato lagi: \"Apakah kalian ridha?\" Mereka menjawab, \"Ya.\" Beliau bersabda: \"Aku akan berpidato di hadapan orang-orang untuk mengabarkan kepada mereka bahwa kalian telah ridha.\" Para sahabat menjawab, \"Ya.\" maka Nabi shallallahu 'alaihi wasallam berpidato seraya berkata: \"Apakah kalian ridha?\" Mereka menjawab, \"Ya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4535,
			"arabicnumber": 4535,
			"text": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Anas] berkata, \"Seorang budak wanita ditemukan dalam keadaan kepalanya terhimpit antara dua batu, maka ditanyakan kepadanya, \"Siapa yang melakukan ini kepadamu? Apakah si fulan yang melakukannya?\" Hingga ketika nama seorang Yahudi disebut, dengan kepalanya ia menjawab, \"Ya.\" Yahudi itu kemudian dijemput dan ia mengakuinya. Maka Nabi shallallahu 'alaihi wasallam memerintakah agar kepala yahudi itu juga dipecahkan dengan dihipit antara dua batu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4536,
			"arabicnumber": 4536,
			"text": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Ibnu Wahb] dari [Amru] -maksudnya Amru bin harits- dari [Bukair Ibnul Asyaj] dari [Ubaidah bin Musafi'] dari [Abu Sa'id Al Khudri] ia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam sedang membagi-bagikan sesuatu, tiba-tiba datang seorang laki-laki ke arah beliau hingga beliau pun memukul dengan tongkat yang dibawanya sehingga timbul luka di wajahnya. Rasulullah shallallahu 'alaihi wasallam lalu berkata kepadanya: \"Kemarilah, silahkan kamu qishas.\" Laki-laki itu menjawab, \"Tidak ya Rasulullah, aku telah memaafkanmu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4537,
			"arabicnumber": 4537,
			"text": "Telah menceritakan kepada kami [Abu Shalih] berkata, telah mengabarkan kepada kami [Abu Ishaq Al Fazari] dari [Al Jurairi] dari [Abu Nadhrah] dari [Abu firas] ia berkata, \" [Umar Ibnul Khaththab] radliallahu 'anhu berkhutbah di hadapan kami, ia mengatakan, \"Aku tidak mengutus para petugasku untuk memukul badan atau mengambil harta kalian, maka siapa di antara kalian yang mendapatkan perlakukan seperti itu hendaklah ia datang kepadaku, sehingga aku dapat mengqishasnya.\" Amru Ibnul Ash berkata, \"Jika ada seorang laki-laki yang mendidik (dengan memukul) sebagian orang yang ada dalam pengawasannya apakah ada qishasnya?\" Umar menjawab, \"Benar. Demi Dzat yang jiwaku ada dalam tangan-Nya, aku tetap akan mengqishasnya. Sebab aku pernah melihat Rasulullah shallallahu 'alaihi wasallam mengqishas karena (kesalahan) dirinya sendiri",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4538,
			"arabicnumber": 4538,
			"text": "Telah menceritakan kepada kami [Dawud bin Rusyaid] berkata, telah menceritakan kepada kami [Al Walid] dari [Al Auza'i] Bahwasanya ia mendengar [Hishn] bahwa ia mendengar [Abu Salamah] mengabarkan dari ['Aisyah radliallahu 'anha] dari Rasulullah shallallahu 'alaihi wasallam, Bahwasanya beliau bersabda tentang orang-orang yang saling bunuh: \"Hendaklah mereka menahan dari meminta qishas dari orang yang lebih dekat, meskipun itu seorang wanita.\" Abu Dawud berkata, \"Telah sampai kabar kepadaku bahwa memaafkan wanita dalam perkara qishas itu di bolehkan jika ia termasuk salah satu dari sekian wali yang ada. Dan telah sampai kabar kepadaku tentang sabda Nabi 'hendaklah mereka meminta mundur dari qishash', artinya menahan diri dari meminta qihsas",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4539,
			"arabicnumber": 4539,
			"text": "Telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Hammad]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu As Sarh] berkata, telah menceritakan kepada kami [Sufyan] -dan ini adalah haditsnya- dari [Amru] dari [Thawus] ia berkata, \"Barangsiapa terbunuh dalam keadaan gelap (tidak jelas siapa pembunuh dan bagaimana caranya), yaitu ketika saling lempar di antara mereka, baik itu dengan batu, cambuk, atau tongkat, maka itu adalah pembunuhan karena kesalahan, dan diyatnya adalah diyat (tebusannya) pembunuhan karena salah. Maka barangsiapa membunuh dengan sengaja, diyatnya adalah qishas - [Ibnu Ubaid] menyebutkan dalam riwayat lain- \"qishas dengan tangan. Kemudian riwayat itu sepakat pada lafadz, \"Barangsiapa menghalangi terlaksananya qishas, maka ia akan mendapat laknat dan murka Allah, serta tidak akan diterima ibadahnya baik amalam sunnah atau wajib.\" Dan hadits Sufyan redaksinya lebih lengkap. Telah menceritakan kepada kami [Muhammad bin Abu Ghalib] berkata, telah menceritakan kepada kami [Sa'id bin Sulaiman] dari [Sulaiman bin Katsir] berkata, telah menceritakan kepada kami [Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda, lalu ia menyebutkan makna hadits Sufyan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4540,
			"arabicnumber": 4540,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4541,
			"arabicnumber": 4541,
			"text": "Telah menceritakan kepada kami [Muslim bin Ibrahim] ia berkata; telah menceritakan kepada kami [Muhammad bin rasyid]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Harun bin Zaid bin Abu Az Zaqa] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Muhammad bin rasyid] dari [Sulaiman bin Musa] dari [Amru bin Syu'aib] dari [bapaknya] dari [kakeknya] berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi putusan bahwa orang yang membunuh karena salah maka diyatnya (tebusannya) adalah seratus ekor unta; tiga puluh anak unta makhadh, tiga puluh anak unta betina labun, tiga puluh hiqqah dan sepuluh anak unta jantan labun laki-laki",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4542,
			"arabicnumber": 4542,
			"text": "Telah menceritakan kepada kami [Yahya bin hakim] berkata, telah menceritakan kepada kami ['Abdurrahman bin Utsman] berkata, telah menceritakan kepada kami [Husain Al Muallim] dari [Amru bin Syu'aib] dari [Bapaknya] dari [kakeknya] ia berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam nilai tebusan diyat adalah delapan ratus dinar, atau delapan ribu dirham, sedangkan diyat bagi ahli kitab adalah setengah dari diyat kaum muslimin.\" Ia (perawi) berkata, \"Hal itu terus berlangsung hingga Umar diangkat menjadi khalifah, dan saat berpidato ia berkata, \"Ketahuilah, sesungguhnya harta unta telah naik.\" Perawi berkata lagi, \"Maka Umar mewajibkan bagi pemilik emas untuk membayar diyat sebanyak seribu dinar, bagi pemilik perak dua belas ribu dirham, bagi pemilik sapi sebanyak dua ratus ekor sapi, bagi pemilik kambing sebanyak dua ribu kambing, dan bagi pemilik pakaian sebanyak dua ratus pasang baju.\" Ia (perawi) berkata, \"Sementara diyat untuk ahli dzimmah tidak dinaikkan sebagaimana diyat yang lainnya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4543,
			"arabicnumber": 4543,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami [Muhammad bin Ishaq] dari [Atha bin Abu Rabah] berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi putusan bahwa besaran diyat bagi pemilik unta adalah seratus ekor unta, pemilik sapi adalah dua ratus ekor sapi, pemilik kambing adalah dua ribu ekor kambing, pemilik pakaian adalah dua pasang baju, pemilik gandum adalah sesuatu-muhammad tidak menghafalnya-.\" Abu Dawud berkata, \"Aku membaca di hadapan [Sa'id bin Ya'qub Ath Thalqani], ia berkata; telah menceritakan kepada kami [Abu Tumailah] berkata, telah menceritakan kepada kami [Muhammad bin Ishaq] ia berkata; Atha menyebutkan dari [Jabir bin Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam mewajibkanlalu ia menyebutkan sebagaimana hadits Musa. Ia berkata, \"Bagi pemilik makanan adalah sesuatuaku tidak menghafalnya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4544,
			"arabicnumber": 4544,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4545,
			"arabicnumber": 4545,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abdul Wahid] berkata, telah menceritakan kepada kami [Al Hajjaj] dari [Zaid bin Jubair] dari [Khisyf bin Malik Ath Tha`i] dari [Abdullah bin Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda tentang pembunuhan yang tidak sengaja; dua puluh hiqqah, ditambah dua puluh jadz'ah, ditambah dua puluh anak unta betina makhadh, ditambah dua puluh anak unta betina labun, dan dua puluh anak unta jantan makhadh. ' Ini adalah perkataan Abdullah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4546,
			"arabicnumber": 4546,
			"text": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] berkata, telah menceritakan kepada kami [Zaid Ibnul Hubab] dari [Muhammad bin Muslim] dari [Amru bin Dinar] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Seorang laki-laki dari bani Adi terbunuh, lalu Nabi shallallahu 'alaihi wasallam menetapkan bahwa diyatnya adalah dua belas ribu.\" Abu Dawud berkata, \" [Ibnu Uyainah] meriwayatkannya dari [Amru], dari [Ikrimah], dari Nabi shallallahu 'alaihi wasallam, namun ia tidak menyebutkan nama Ibnu Abbas",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4547,
			"arabicnumber": 4547,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] dan [Musaddad] secara makna, keduanya berkata; telah menceritakan kepada kami [Hammad] dari [Khalid] dari [Al Qasim bin Rabi'ah] dari [Uqbah bin Aus] dari [Abdullah bin Amru] bahwa Rasulullah shallallahu 'alaihi wasallam -Musaddad menyebutkan- berkhutbah pada hari penaklukan kota Makkah. Beliau bertakbir sebanyak tiga kali kemudian mengatakan: \"Tidak ada Tuhan selain Allah Yang Maha Esa, Maha Benar janji-Nya, dan menolong hamba-Nya, serta satu-satunya yang mengalahkan golongan musuh yang bersekutu -sampai kalimat ini aku menghafalnya dari Musaddad, kemudian keduanya sepakat pada lafadz- Ketahuilah, semua peninggalan masa Jahilliyah baik itu yang diperoleh karena diyat pembunuhan atau pencurian, maka semua itu ada di bawah telapak kakiku (yakni bathil), kecuali apa-apa yang dihasilkan dari usaha memberi minum jamaah haji dan pengabdian kepada ka'bah.\" Kemudian beliau bersabda: \"Ketahuilah, diyat untuk pembunuhan yang tidak sengaja (yang menyerupai sengaja), seperti memukul dengan cambuk atau tongkat adalah seratus ekor unta, yang di antaranya adalah empat puluh ekor yang sedang hamil.\" Hadits Musaddad ini lebih sempurna. Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Wuhaib] dari [Khalid] dengan sanad ini, seperti makna hadits tersebut. Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abdul Warits] dari [Ali bin Zaid] dari [Al Qasim bin Rabi'ah] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan makna yang sama. Ia (perawi) berkata, \"Pada hari penaklukan kota Makkah Rasulullah shallallahu 'alaihi wasallam berkhutbah di atas undakan rumah atau ka'bah.\" Abu Dawud berkata, \"Seperti ini pula [Ibnu Uyainah] meriwayatkan dari [Ali bin Zaid], dari [Al Qasim bin Rabi'ah], dari [Ibnu Umar] dari nabi shallallahu 'alaihi wasallam.\" [Ayyub As Sakhtiyani] juga meriwayatkan dari [Al Qasim bin Rabi'ah], dari [Abdullah bin Amru] sebagaimana hadits Khalid, dan [Hammad bin Salamah] juga meriwayatkannya dari [Ali bin Zaid] dari dari [Ya'qub As Sadusi], dari [Abdullah bin Amru], dari Nabi shallallahu 'alaihi wasallam.\" Dan perkataan Zaid dan Abu Musa seperti hadits Nabi shallallahu 'alaihi wasallam dan hadits Umar radliallahu 'anhu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4548,
			"arabicnumber": 4548,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4549,
			"arabicnumber": 4549,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4550,
			"arabicnumber": 4550,
			"text": "Telah menceritakan kepada kami [An Nufaili] berkata, telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dari [Mujahid] ia berkata, \" [Umar] memberi putusan bahwa pembunuhan semi sengaja diyatnya adalah tiga puluh hiqqah, ditambah tiga puluh jadz'ah dan empat puluh khalifah dari unta yang umurnya antara enam hingga sembilan tahun",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4551,
			"arabicnumber": 4551,
			"text": "Telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Abu Al Ahwash] dari [Abu Ishaq] dari [Ashim bin Dhamrah] dari [Ali radliallahu 'anhu] Bahwasanya ia pernah berkata; \"tentang diyat pembunuhan semi sengaja (pembunuhan tidak sengaja menyerupai sengaja) adalah sepertiga, sepertiga yaitu, tiga puluh tiga unta yang berumur tiga tahun dan masuk tahun keempat, dan tiga puluh tiga unta betina yang berumur lima tahun, serta tiga puluh empat unta hamil yang berumur enam tahun hingga umur sembilan tahun",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4552,
			"arabicnumber": 4552,
			"text": "dengan sanad itu juga, dari [Abu Ishaq] dari [Alqamah] dan [Al Aswad], [Abdullah] berkata tentang diyat pembunuhan semi sengaja, \"Dua puluh lima hiqqah, di tambah dua puluh lima jadz'ah, ditambah dua puluh lima bintu labun dan dua puluh lima bintu makhadh",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4553,
			"arabicnumber": 4553,
			"text": "Telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Abu Al Ahwash] dari [Sufyan] dari [Abu Ishaq] dari [Ashim bin Dhamrah] ia berkata, \" [Ali radliallahu 'anhu] berkata tentang diyat pembunuhan tidak sengaja, \"Yakni seperempat, seperempat; dua puluh lima hiqqah, di tambah dua puluh lima jadz'ah, ditambah dua puluh lima bintu labun dan dua puluh lima bintu makhadh",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4554,
			"arabicnumber": 4554,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4555,
			"arabicnumber": 4555,
			"text": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Muhammad bin Abdullah] berkata, telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Abdu Rabbih] dari [Abu Iyadh] dari [Utsman bin Affan] dan [Zaid bin Tsabit] tentang pembunuhan semi sengaja adalah empat puluh Jadz'ah, tiga puluh hiqqah, dan tiga puluh bintu labun. Sedangkan pembunuhan tidak sengaja adalah tiga puluh hiqqah, tiga puluh bintu labun dan dua puluh banu labun laki-laki dan dua puluh bintu makhadh.\" Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Muhammad bin Abdullah] berkata, telah menceritakan kepada kami [Said] dari [Qatadah] dari [Sa'id Ibnul Musayyab] dari [Zaid bin Tsabit] tentang tebusan pembunuhan semi sengaja. Lalu beliau menyebutkan persis sebagaimana hadits tersebut.\" Abu Dawud berkata, \"Abu Ubaid dan beberapa orang lainnya menyebutkan, \"Jika umur unta telah masuk pada tahun keempat maka ia disebut hiqqun atau hiqqah, sebab ia telah boleh untuk membawa barang atau ditunggangi. Jika umurnya telah masuk pada tahun kelima, maka ia disebut Jadza' atau jadz'ah. Jika umurnya telah masuk pada tahun keenam dan gigi serinya telah tanggal, maka ia disebut tsaniyun atau tsaniyah. Jika umurnya telah masuk pada tahun ketujuh, maka ia disebut ruba' atau ruba'iyah. Jika umurnya telah masuk pada tahun kedelapan dan gigi setelah gigi gerahamnya telah tanggal, maka ia disebut sadis atau sadas. Jika umurnya telah masuk pada tahun kesembilan dan gigi taringnya telah tanggal namun tumbuh kembali, maka ia disebut dengan bazil. Jika umurnya telah masuk pada tahun kesepuluh, maka ia disebut mukhlif. Dan setelah itu tidak ada lagi penyebutan secara khusus, akan tetapi cukup disebut dengan bazil 'am (bazil lebih setahun) atau bazil 'ammaini (bazil lebih dua tahun), mukhlif 'am (Mukhlif lebih setahun) atau mukhlif 'ammaini (mukhlif lebih dua tahun) dan seterusnya.\" An Nadhr bin Syumail berkata, \"Bintu makhadh untuk unta yang berumur satu tahun, bintu labun untuk unta yang berumur dua tahun, hiqqah untuk unta yang berumur tiga tahun, jadza' untuk unta yang berumur empat tahun, tsaniyun untuk unta yang berumur lima tahun, raba' untuk unta yang berumur enam tahun, sadis untuk unta yang berumur tujuh tahun, dan bazil untuk unta yang berumur delapan tahun.\" Abu Dawud berkata, \"Abu Hatim dan Al Ashma'ie berkata, \"Al Judzu'ah adalah untuk waktu, bukan umur.\" Abu Hatim berkata, \"Sebagian ulama berkata, \"Jika unta tersebut telah tanggal gigi gerahamnya maka ia disebut raba', dan jika gigi serinya telah tanggal maka ia disebut tsaniyun.\" Abu Ubaid berkata, \"Jika ia telah siap menerima seperma maka disebut khalifah, dan hal itu tetap berlangsung hingga berlalu sepuluh bulan. Jika telah lewat sepuluh bulan maka ia disebut dengan 'usyara.\" Abu Hatim berkata, \"Jika telah tanggal gigi serinya maka disebut tsaniyun, dan jika gigi derahamnya telah tanggal maka disebut raba",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4556,
			"arabicnumber": 4556,
			"text": "Telah menceritakan kepada kami [Ishaq bin Isma'il] berkata, telah menceritakan kepada kami [Abdah] -maksudnya Abdah bin Sulaiman- berkata, telah menceritakan kepada kami [Said bin Abu Arubah] dari [Ghalib At Tammar] dari [Humaid bin Hilal] dari [Masruq bin Aus] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Semua jari diyatnya sama; puluh ekor unta",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4557,
			"arabicnumber": 4557,
			"text": "Telah menceritakan kepada kami [Abul Walid] berkata, telah menceritakan kepada kami [Syu'bah] dari [Ghalib At Tammar] dari [Masruq bin Aus] dari [Al Asy'ari] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jemari itu diyatnya sama.\" Aku bertanya, \"Setiap jari sepuluh ekor unta?\" beliau menjawab: \"Ya.\" Abu Dawud berkata, \" [Muhammad bin Ja'far] meriwayatkannya dari [Syu'bah], dari [Ghalib], ia berkata, \"aku mendengar [Masruq bin Aus].\" [Isma'il] juga meriwayatkannya, ia berkata, \" [Ghalib At Tammar] menceritakan kepadaku dengan sanad Abu Al Walid.\" Dan [Hanzhalah bin Abu Shafiah] juga meriwayatkan dari [Ghalib] dengan sanad Isma'il",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4558,
			"arabicnumber": 4558,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Mu'adz] berkata, telah menceritakan kepada kami [Bapakku]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Nashr bin Ali] berkata, telah mengabarkan kepada kami [Yazid bin Zurai'] semuanya dari [Syu'bah] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ini dengan ini (tebusannya) sama, yakni ibu jari dengan jari kelingking",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4559,
			"arabicnumber": 4559,
			"text": "Telah menceritakan kepada kami [Abbas Al 'Anbari] berkata, telah menceritakan kepada kami [Abdu Ash Shammad bin Abdul Warits] berkata, telah menceritakan kepadaku [Syu'bah] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semua jari itu sama (diyatnya), semua gigi sama (diyatnya), gigi seri dan gigi geraham sama, serta ini dan ini diyatnya sama.\" Abu Dawud berkata, \" [An Nadhr bin Syumail] meriwayatkannya dari [Syu'bah] dengan makna [Abdu Ash Shamad].\" Abu Dawud berkata lagi, \" [Ad Darimi] meriwayatkan kepada kami dari [An Nadhr]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4560,
			"arabicnumber": 4560,
			"text": "Telah menceritakan kepada kami [Muhammad bin Hatim bin Bazi'] berkata, telah menceritakan kepada kami [Ali Ibnul hasan] berkata, telah mengabarkan kepada kami [Abu Hamzah] dari [Yazid An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semua gigi sama diyatnya, dan semua jari jemari sama diyatnya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4561,
			"arabicnumber": 4561,
			"text": "Telah menceritakan kepada kami [Abdullah bin Umar bin Muhammad bin Aban] berkata, telah menceritakan kepada kami [Abu Tumailah] dari [Husain Al Muallim] dari [Yazid An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menjadikan diyat kedua tangan dan kedua kaki sama",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4562,
			"arabicnumber": 4562,
			"text": "Telah menceritakan kepada kami [Hudbah bin Khalid] berkata, telah menceritakan kepada kami [Hammam] berkata, telah menceritakan kepada kami [Husain Al Mu'allim] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] bahwa Nabi shallallahu 'alaihi wasallam bersabda dalam pidatonya -sambil menyandarkan punggungnya ke Ka'bah-: \"(setiap) Jemari tangan diyatnya adalah sepuluh (unta)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4563,
			"arabicnumber": 4563,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4564,
			"arabicnumber": 4564,
			"text": "Abu Dawud berkata, \"Aku mendapatkan dalam bukuku; dari [Syaiban] -namun aku belum pernah mendengarnya darinya- [Abu Bakr] -sahabat kami yang terpercaya- mengabarkannya kepada kami, ia berkata; telah menceritakan kepada kami [Muhammad] -maksudnya Muhammad bin Rasyid- dari [Sulaiman] -maksudnya Sulaiman bin Musa- dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menetapkan bahwa diyatnya pembunuh yang tidak sengaja bagi penduduk kampung adalah empat ratus dinar, atau dirham yang sebanding, serta menetapkan sesuai dengan harga unta. Jika harga unta naik maka beliau menaikkan nilainya dan jika turun maka beliau menurunkan nilainya. Sehingga, diyat pada masa Rasulullah shallallahu 'alaihi wasallam berkisar antara empat ratus dinar hingga delapan ratus dinar, atau sebanding dengan delapan ribu dirham. Rasulullah shallallahu 'alaihi wasallam menetapkan bahwa bagi pemilik sapi dendanya adalah dua ratus ekor sapi, jika diyat itu dibayarkan berupa kambing maka dengan dua ribu ekor kambing.\" Ia (perawi) berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tebusan diyat adalah harta warisan untuk semua ahli waris korban untuk dibagi dengan kerabatnya, jika sisa maka itu untuk ashabah (orang-orang yang mendapatkan bagian sisa dalam warisan).\" Ia (perawi) berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi putusan pada hidung bahwa; jika dipotong maka dendanya adalah diyat secara sempurna, jika hanya ujungnya maka diyatnya setengahnya, yaitu lima puluh ekor unta, atau nilai yang sebanding dengannya baik itu emas atau perak. Atau dengan seratus sapi atau seribu kambing. Dan jika tangan dipotong, maka dendanya adalah setengah diyat, pada kaki dendanya setengah diyat, muka sepertiga diyat; tiga puluh tiga unta dan sepertiga atau yang senilai baik itu berupa emas atau perak. Atau sapi, atau kambing, dan pada rongga juga seperti itu pula. Pada jemari, maka setiap jarinya adalah sepuluh unta, dan setiap gigi adalah lima unta. Rasulullah shallallahu 'alaihi wasallam juga telah menetapkan bahwa diyat yang harus ditanggung oleh seorang wanita ditanggung oleh para ashabahnya (wanita), yaitu kelompok orang yang tidak mendapatkan harta waris kecuali sisa dari ahli warinya. Jika ia dibunuh maka diyatnya bagi ahli warisnya atau mereka membunuh pembunuhnya. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pembunuh tidak mendapatkan apa-apa, jika ia tidak mempunyai ahli waris, maka warisannya jatuh kepada orang yang paling dekat dengannya, dan bagi pembunuh tidak mendapatkan warisan sedikitpun.\" Muhammad berkata, \"Semua riwayat itu diceritakan kepadaku oleh Sulaiman bin Musa dari Amru bin Syu'aib, dari bapaknya, dari kakeknya, dari Nabi shallallahu 'alaihi wasallam.\" Abu Dawud berkata, \"Muhammad bin rasyid berasal dari Damaskus, ia melarikan diri ke Bashrah untuk menghindari pembunuhan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4565,
			"arabicnumber": 4565,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Muhammad bin Bakkar bin Bilal Al 'Amili] berkata, telah mengabarkan kepada kami [Muhammad] -maksudnya Muhammad bin Rasyid- dari [Sulaiman] -maksudnya Sulaiman bin Musa- dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"tebusan (diyat) untuk pembunuhan semi sengaja diperberat seperti pembunuhan sengaja, namun pembunuhnya tidak dibunuh -Abu Dawud berkata; Kahlil menambahkan dari Ibnu Rasyid- \"Sebab hal itu akan membantu setan dalam menguasai manusia, hingga hukum darahnya itu adalah seperti pembunuhan yang dilakukan dalam kegelapan (tidak tahu siapa pembunuh dan bagaimana membunuhnya), bukan karena permusuhan atau peperangan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4566,
			"arabicnumber": 4566,
			"text": "Telah menceritakan kepada kami [Abu Kamil Fudhail bin Husain] bahwa [Khalid Ibnul Harits] menceritakan kepada mereka, ia berkata; telah mengabarkan kepada kami [Husain] -maksudnya Husain Al Mu'allim- dari [Amru bin Syu'aib] bahwa [Bapaknya] mengabarkan kepadanya dari [Abdullah bin Amru] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diyat untuk tiap gigi yang nampak saat tertawa adalah lima (ekor unta)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4567,
			"arabicnumber": 4567,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4568,
			"arabicnumber": 4568,
			"text": "Telah menceritakan kepada kami [Hafsh bin Umar An Namari] berkata, telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Ibrahim] dari [Ubaid bin Nadhlah] dari [Al Mughirah bin Syu'bah] berkata, \"Ada dua orang wanita yang menjadi isteri seorang laki-laki Hudzail, lalu salah seorang dari isteri itu memukul isteri yang lainnya hingga tewas beserta janin yang ada di perutnya. Akhirnya mereka mengadukan hal itu kepada Nabi shallallahu 'alaihi wasallam, seorang dari dua laki-laki berkata, \"Bagaimana kami harus menebus diyat bagi jiwa yang belum lahir dari perut ibunya, belum makan, belum minum dan belum menangis!\" Beliau lalu menjawab: \"Apakah ini sajak seperti sajak orang-orang Arab badui?\" Beliau kemudian menetapkan diyatnya berupa pembebasan seorang budak yang ditanggung oleh wali wanita (pembunuh) tersebut.\" Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [jarir] dari [Manshur] dengan sanad dan maknanya, ia menambahkan, \"Nabi shallallahu 'alaihi wasallam lalu menetapkan bahwa tebusan bagi wanita yang dibunuh itu ditanggung oleh keluarga wanita (yang membunuh), dan membebaskan budak sebagai diyat dari janin yang ada dalam perut.\" Abu Dawud berkata, \" [Al Hakam] juga meriwayatkannya dari [Mujahid] dari [Al Mughirah]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4569,
			"arabicnumber": 4569,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4570,
			"arabicnumber": 4570,
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Harun bin Abbad Al Azdi] secara makna, keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Hisyam] dari [Urwah] dari [Al Miswar bin Makhramah] berkata, \"Umar bermusyawah dengan orang-orang tentang hukum penguguran janin dalam perut wanita. Maka [Al Mughirah bin Syu'bah] berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam memberi putusan dalam hal itu dengan membebaskan seorang budak; laki-laki atau perempuan.\" Umar berkata, \"Datangkanlah kepadaku saksi yang pernah ikut bersamamu.\" Maka Al Mughirah menghadirkan [Muhammad bin Maslamah].\" [Harun] menambahkan, \"Lalu ia memberikan bukti dengan kisah seorang laki-laki yang memukul perut isterinya.\" Abu Dawud berkata, \"Telah sampai kepadaku dari Abu Ubaid bahwa dinamakan penguguran karena seorang wanita melahirkan (menjatuhkan dengan paksa) sebelum waktu kelahirannya.\", Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Wuhaib] dari [Hisyam] dari [Bapaknya] dari [Al Mughirah] dari Umar secara makna. Abu Dawud berkata, \" [Hammad bin Zaid] dan [Hammad bin Salamah] meriwayatkannya dari [Hisyam bin Urwah], dari [bapaknya], bahwa Umar berkata",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4571,
			"arabicnumber": 4571,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4572,
			"arabicnumber": 4572,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4573,
			"arabicnumber": 4573,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4574,
			"arabicnumber": 4574,
			"text": "Telah menceritakan kepada kami [Muhammad bin Mas'ud Al Mishishi] berkata, telah menceritakan kepada kami [Abu Ashim] dari [Ibnu Juraij] ia berkata; telah mengabarkan kepadaku [Amru bin dinar] bahwa ia mendengar [Thawus] dari [Ibnu Abbas] dari [Umar] bahwa ia bertanya tentang keputusan Nabi shallallahu 'alaihi wasallam dalam urusan tersebut. [Haml bin Malik bin An Nabighah] lalu bangkit dan berkata, \"Aku mempunyai dua isteri, lalu salah seorang dari keduanya memukul yang lain dengan tongkat hingga membunuhnya berserta janin yang ada dalam perutnya. Rasulullah shallallahu 'alaihi wasallam kemudian memberi putusan bahwa tebusan bagi janinnya adalah dengan membebaskan seorang budak, sementara wanita itu dibunuh.\" Abu Dawud berkata, \"An Nadhr bin Syumail berkata, \"Al Misthah adalah Ash Shaubaj (semacam alat untuk meratakan tanah), \" Abu Dawud berkata lagi, \"Abu Ubaid berkata, \"Al Misthah adalah katu untuk meyangga kemah.\" Telah menceritakan kepada kami [Abdullah bin Muhammad Az Zuhri] berkata, telah menceritakan kepada kami [Sufyan] dari [Amru] dari [Thawus] ia berkata, \"Umar berdiri di atas mimbarlalu ia menyebutkan sebagaimana hadits tersebut secara makna. Namun ia tidak menyebutkan, \"dan wanita itu harus dibunuh.\" Ia (sufyan) menambahkan, \"Dengan memberikan budak laki-laki atau perempuan.\" Ia berkata, \"Umar lalu berkata, \"Allah Maha Besar, sekiranya aku tidak mendengar ini, sungguh pasti aku akan memberi keputusan dengan yang selain ini.\" Telah menceritakan kepada kami [Sulaiman bin 'Abdurrahman At Tammar] bahwa [Amru bin Thalhah] menceritakan kepada mereka, ia berkata; telah menceritakan kepada kami [Asbath] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas] berkenaan dengan kisah [Haml bin Malik] ia berkata, \"Wanita itu lalu melahirkan (keguguran) janin yang rambutnya telah tumbuh, janin itu meninggal sebagaimana ia juga meninggal. Rasulullah shallallahu 'alaihi wasallam kemudian memberi keputusan bahwa wali (pembunuh) harus memberikan diyat. Lalu paman (wanita yang keguguran lalu meninggal) itu berkata, \"Wahai Nabi Allah, ia itu telah melahirkan bayi yang rambutnya telah tumbuh dalam keadaan meninggal!\" lalu ayah wanita yang membunuh berkata, \"Dia dusta! Demi Allah, belum menangis, belum minum, dan belum makan. Maka (membayar dendanya) adalah kesia-siaan.\" Nabi shallallahu 'alaihi wasallam lantas bersabda: \"Apakah ini sajak jahilliyah dan perdukunannya. Bayarlah denda janin itu dengan memberikan seorang budak.\" [Ibnu Abbas] berkata, \"Wanita itu bernama Mulaikah dan yang lainnya bernama Ummu Ghuthaif",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4575,
			"arabicnumber": 4575,
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yunus bin Muhammad] berkata, telah menceritakan kepada kami [Abdul Wahid bin Ziyad] berkata, telah menceritakan kepada kami [Mujalid] ia berkata; telah menceritakan kepada kami [Asy Sya'bi] dari [Jabir bin Abdullah] berkata, \"Dua orang wanita dari Hudzail, salah seorang dari keduanya membunuh wanita yang lainnya. Setiap dari wanita tersebut telah mempunyai suami dan anak. Rasulullah shallallahu 'alaihi wasallam kemudian memberi keputusan bahwa wanita yang terbunuh itu dendanya harus dibayar oleh wali dari wanita yang membunuhnya. Dan membebaskan suami serta anaknya.\" Jabir bin Abdullah berkata, \"Wali wanita yang terbunuh itu berkata, \"Harta warisanya untuk kami.\" Jabir bin Abdullah berkata, \"Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Tidak, warisannya untuk suami dan anaknya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4576,
			"arabicnumber": 4576,
			"text": "Telah menceritakan kepada kami [Wahb bin Bayan] dan [Ibnu As Sarh] keduanya berkata; telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Sa'id Ibnul Musayyab] dan [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Dua orang wanita dari Hudzail saling bunuh, kemudian salah seorang dari mereka memlempar yang lainnya dengan batu hingga tewas. Maka orang-orang mengadukan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam memberi keputusan bahwa diyat bagi janin tersebut adalah budak laki-laki atau perempuan, dan menetapkan bahwa diyat bagi wanita itu harus dibayar oleh para ahli waris atau anak berserta orang-orang yang bergabung dengan mereka.\" Haml bin Malik bin An Nabighah Al Hudzli berkata, \"Wahai Rasulullah, bagaimana aku harus membayar diyat seseorang yang belum minum, belum makan, belum berbicara dan belum menangis? Apa semacam itu tidak memberatkan?\" Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Orang ini termasuk kawan-kawan dukun. Hal itu karena ungkapan yang ia katakan.\" Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Ibnul Musayyab] dari [Abu Hurairah] berkenaan dengan kisah dalam hadits tersebut, ia berkata, \"Kemudian wanita yang diberi putusan untuk membayar dengan seorang budak meninggal, maka Rasulullah shallallahu 'alaihi wasallam memberi putusan bahwa harta warisannya diberikan kepada anak-anaknya, sedangkan denda itu kepada ashabahnya (ahli waritsnya yang terdekat yang mendapatkan sisa warisan)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4577,
			"arabicnumber": 4577,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4578,
			"arabicnumber": 4578,
			"text": "Telah menceritakan kepada kami [Abbas bin Abdul Azhim] berkata, telah menceritakan kepada kami [Ubaidullah bin Musa] berkata, telah menceritakan kepada kami [Yusuf bin Shuhaib] dari [Abdullah bin Buraidah] dari [Bapaknya] berkata, \"Seorang wanita melempar wanita lain hingga bayi yang ada dalam perutnya keguguran. Maka hal itu kemudian disampaikan kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau memutuskan bahwa diyat bagi bayinya adalah lima ratus kambing. Kemudian saat itu pula beliau melarang untuk melempar.\" Abu Dawud berkata, \"Demikianlah, hadits tersebut menyebutkan lima ratus ekor kambing, padahal yang benar adalah seratus kambing.\" Abu Dawud melanjutkan, \"Demikianlah, Abbas mengatakan bahwa itu (riwayat yang menyebutkan lima ratus kambing) adalah riwayat yang masih diragukan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4579,
			"arabicnumber": 4579,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] berkata, telah menceritakan kepada kami [Isa] dari [Muhammad] -maksudnya Muhammad bin Amru- dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi putusan bahwa diyat bagi janin adalah senilai budak laki-laki, atau perempuan, atau kuda, atau bighal.\" Abu Dawud berkata, \" [Hammad bin Salamah] dan [Khalid bin Abdullah] meriwayatkan hadits ini dari [Muhammad bin Amru], namun keduanya tidak menyebutkan 'kuda atau bighal",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4580,
			"arabicnumber": 4580,
			"text": "Telah menceritakan kepada kami [Muhammad bin Sinan Al 'Awaqi] berkata, telah menceritakan kepada kami [Syarik] dari [Mughirah] dari [Ibrahim] dan [Jabir] dari [Asy Sya'bi] berkata, \"ghurrah (terbusan memerdekakan budak) sama nilainya dengan lima ratus dirham.\" Abu Dawud berkata, \"Rabi'ah menyebutkan, \"ghurrah (tebusan memerdekakan budak) sama nilainya dengan lima puluh dinar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4581,
			"arabicnumber": 4581,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dan Telah menceritakan kepada kami [Isma'il] dari [Hisyam] dan Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ya'la bin Ubaid] berkata, telah menceritakan kepada kami [Hajjaj Ash Shawwaf] semuanya dari [Yahya bin Abu Katsir] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi keputusan bahwa diyat Mukatib (budak yang ingin menebus dirinya supaya merdeka) yang terbunuh adalah dibayar sesuai dengan uang yang telah ia berikan untuk menebus kebebasan dirinya, dan selebihnya adalah diyat sebagai seorang budak",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4582,
			"arabicnumber": 4582,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad bin Salamah] dari [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang budak Mukatab (budak yang ingin menebus dirinya supaya merdeka) mendapatkan hukuman had, atau mewarisi harta warisan, maka ia menerima warisannya sesuai dengan harga kebebasan dirinya dari perbudakan.\" Abu Dawud berkata, \" [Wuhaib] meriwayatkannya dari [Ayyub], dari [Ikrimah], dari [Ali] dari Nabi shallallahu 'alaihi wasallam. [Hammad bin Zaid] dan [Isma'il] memursalkannya dari [Ayyub], dari [Ikrimah] dari Nabi shallallahu 'alaihi wasallam. Dan Isma'il bin Ulayyah memposisikan bahwa itu adalah ucapan Ikrimah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4583,
			"arabicnumber": 4583,
			"text": "Telah menceritakan kepada kami [Yazid bin Khalid bin Mauhab Ar Ramli] berkata, telah menceritakan kepada kami [Isa bin Yunus] dari [Muhammad bin Ishaq] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Diyat budak itu setengah dari diyat orang yang mereka.\" Abu Dawud berkata, \" [Usamah bin Zaid Al Laitsi] dan ['Abdurrahman Ibnul Harits] meriwayatkannya dari [Amru bin Syu'aib] seperti ini",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4584,
			"arabicnumber": 4584,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] ia berkata; telah mengabarkan kepadaku [Atha] dari [Shafwan bin Ya'la] dari [Bapaknya] ia berkata, \"Seorang pekerjaku menyerang seorang laki-laki, lalu ia mengigit tangannya. Laki-laki itu menarik tangannya hingga giginya tanggal. Lalu ia mendatangi Nabi shallallahu 'alaihi wasallam, namun beliau tidak menggubrisnya. Beliau bersabda: \"Apakah kamu ingin ia meletakkan tangannya pada mulutmu hingga kamu dapat mengigitnya seperti unta jantan!\" Ia berkata, \"Telah menceritakan kepadaku Ibnu Abu Mulaikah dari Kakeknya bahwa Abu Bakar radliallahu 'anhu tidak menggubrisnya dan berkata, \"Semoga giginya tanggal.\" Telah menceritakan kepada kami [Ziyad bin Ayyub] berkata, telah mengabarkan kepada kami [Husyaim] berkata, telah menceritakan kepada kami [Hajjaj] dan [Abdul Malik] dari [Atha] dari [Ya'la bin Umayyah] dengan sanad ini. Namun ia menambahkan, \"Kemudian Nabi shallallahu 'alaihi wasallam bersabda kepada orang yang mengigit: \"Jika kamu mau serahkanlah tanganmu kepadanya hingga ia dapat mengigitnya, lalu kamu tarik tanganmu dari mulutnya.\" Kemudian beliau menghapus diyat giginya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4585,
			"arabicnumber": 4585,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4586,
			"arabicnumber": 4586,
			"text": "Telah menceritakan kepada kami [Nashr bin Ashim Al Anthaki] dan [Muhammad bin Ash Shabbah bin Sufyan] bahwa [Al Walid bin Muslim] mengabarkan kepada mereka, dari [Ibnu Juraij] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengobati sedangkan ia dikenal bukan sebagai seorang dokter, maka ia harus bertanggung jawab (jika terjadi kecelakaan).\" Nashr berkata, \"Ibnu Juraij menceritakan kepadaku, Abu Dawud berkata, \"Hadits ini tidak ada yang meriwayatkannya kecuali Al Walid, dan kami tidak tahu hadits ini shahih atau tidak",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4587,
			"arabicnumber": 4587,
			"text": "Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] berkata, telah menceritakan kepada kami [Hafsh] berkata, telah menceritakan kepada kami [Abdul Aziz bin Umar bin Abdul Aziz] berkata, telah menceritakan kepadaku [beberapa utusan] yang datang kepada bapakku, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dokter mana saja yang mengobati suatu kaum, padahal sebelum itu ia tidak dikenal sebagai dokter, kemudian memberi kecelakaan maka ia bertanggung jawab.\" Abdul Aziz berkata, \"Ketahuilah bukanlah maksud mengobati di sini secara umum, tetapi khusus dalam memotong urat, membelah perut atau mengobati dengan menempelkan besi yang dibakar pada luka",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4588,
			"arabicnumber": 4588,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] dan [Musaddad] secara makna, keduanya berkata; telah menceritakan kepada kami [Hammad] dari [Khalid] dari [Al Qasim bin Rabi'ah] dari [Uqbah bin Aus] dari [Abdullah bin Amru] bahwa Rasulullah shallallahu 'alaihi wasallam -Musaddad menyebutkan 'berkhutbah saat hari pembukaan (penaklukan) kota Makkah- lalu keduanya sepakat pada lafadz, lalu beliau mengatakan: \"Ketahuilah, setiap peninggalan masa Jahilliyah, baik itu yang diperoleh karena diyat pembunuhan atau pencurian, maka semua itu ada di bawah kakiku (bathil), kecuali apa-apa yang dihasilkan dari usaha memberi minum jamaah haji dan pengabdian kepada ka'bah.\" Kemudian beliau meneruskan: \"Ketahuilah, sesungguhnya diyat pembunuhan semi sengaja, yang dilakukan dengan cambuk atau tongkat adalah seratus unta, yang di antaranya terdiri dari empat puluh unta yang sedang hamil.\" Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Wuhaib] dari [Khalid] dengan sanad dan makna ini",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4589,
			"arabicnumber": 4589,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4590,
			"arabicnumber": 4590,
			"text": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Mu'adz bin Hisyam] berkata, telah menceritakan kepadaku [Bapakku] dari [Qatadah] dari [Abu Nadhrah] dari [Imran bin Hushain] berkata, \"Bahwasanya ada budak laki-laki milik orang miskin memotong telinga budak laki-laki milik orang kaya. Lalu keluarga budak (milik orang miskin) tersebut mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, 'Wahai Rasulullah, kami ini adalah orang-orang yang miskin! ' Beliau akhirnya tidak memberikan hukuman apapun",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4591,
			"arabicnumber": 4591,
			"text": "Abu Dawud berkata, \"Aku mendapat cerita dari [Sa'id bin Sulaiman] dari [Sulaiman bin Katsir] berkata, telah menceritakan kepada kami [Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membunuh dalam keadaan gelap (tidak jelas siapa pembunuh dan bagaimana caranya), atau ketika terjadi saling lempar antara mereka baik dengan batu, cambuk, maka tebusannya adalah tebusan (pembunuhan) karena salah. Dan barangsiapa membunuh dengan sengaja, hukumannya adalah qishas. Barangsiapa menghalangi terlaksananya qishas, maka ia akan mendapat laknat Allah, para malaikat dan manusia",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4592,
			"arabicnumber": 4592,
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Yazid] berkata, telah menceritakan kepada kami [Sufyan bin Husain] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Kaki adalah sia-sia (tidak ada tebusan).\" Abu Dawud berkata, \"Maksudnya Binatang yang menginjak dengan dengan kakinya, sementara ia (pemilik) menungganginya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4593,
			"arabicnumber": 4593,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dan [Abu Salamah] keduanya mendengar bahwa [Abu Hurairah] menceritakan dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesuatu yang dirusak oleh binatang tidak ada tebusannya, barang tambang tidak ada tebusannya, dan pada harta yang terpendam zakatnya adalah seperlima.\" Abu Dawud berkata, \" Al 'Ajma` maksudnya adalah hewan yang tidak ada penunggangnya atau penuntunnya, dan yang sesuatu yang dirusak oleh hewan di waktu siang tidak sama dengan sesuatu yang dirusak di waktu malam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4594,
			"arabicnumber": 4594,
			"text": "Telah menceritakan kepada kami [Muhammad Ibnul Mutawakkil Al 'Asqalani] berkata, telah menceritakan kepada kami [Abdurrazaq]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ja'far bin Musafir At Tinnisi] berkata, telah menceritakan kepada kami [Zaid Ibnul Mubarak] berkata, telah menceritakan kepada kami [Abdul Malik Ash Shan'ani] keduanya dari [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Api adalah sia-sia (tidak ada tebusan bagi apa yang dirusak oleh api yang menjalar)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4595,
			"arabicnumber": 4595,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Al Mu'tamir] dari [Humaid Ath Thawil] dari [Anas bin Malik] ia berkata, \"Ruba' -saudara wanita Anas bin An Nadhr- memecahkan gigi seorang wanita, mereka lalu mendatangi Nabi shallallahu 'alaihi wasallam, lantas beliau memutuskan dengan kitab Allah, yakni qishas. Anas bin An Nadhr berkata, \"Demi Dzat yang mengutusmu dengan kebenaran, hari ini giginya tidak akan dipecah (qishas)!\" beliau bersabda: \"Wahai Anas, ketentuan Kitabullah adalah qishas!\" Kemudian mereka pun rela dengan mengambil diyatnya. Dengan ta'ajub Nabi shallallahu 'alaihi wasallam bersabda: \"Sungguh, di antara hamba Allah ada seseorang yang jika ia bersumpah pasti akan dikabulkan.\" Abu Dawud berkata, \"Aku mendengar Ahmad bin Hanbal ditanya, \"Bagaimana mengqishas gigi?\" Ia menjawab, \"Dirampalkan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 102
			}
		}
	]
}