{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"21": "Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 959,
			"arabicnumber": 959,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan mujahid yang berperang di jalan Allah, seperti orang yang berpuasa dan shalat; ia tidak buka dari puasanya dan tidak berhenti dari shalat hingga ia kembali (perang)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 959
			}
		},
		{
			"hadithnumber": 960,
			"arabicnumber": 960,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah menjamin orang yang berjihad di jalan-Nya; ia tidak keluar dari rumahnya kecuali berjihad di jalan-Nya dan membenarkan kalimat-Nya, untuk memasukkannya ke dalam surga. Atau mengembalikannya ke tempat asalnya saat ia berangkat dengan memperoleh dan atau ghanimah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 960
			}
		},
		{
			"hadithnumber": 961,
			"arabicnumber": 961,
			"text": "Telah menceritakan kepadaku dari dari Malik dari [Zaid bin Aslam] dari [Abu Shalih As Samman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kuda bagi seorang laki-laki bisa menjadi pahala, bagi laki-laki lain bisa menjadi penutup, dan bagi laki-laki lain bisa menjadi dosa. Adapun kuda yang mendatangkan pahala adalah; seorang laki-laki membawa kudanya di jalan Allah, lalu ia membiarkannya di padang rumput atau di sebuah taman yang indah. Maka apapun yang menempel pada kuda tersebut dalam pengembalaannya di padang rumput, atau taman tersebut, maka pemiliknya akan mendapatkan kebaikan. Seandainya kuda tersebut terputus dari pengembalaannya kemudian dia terus mengikuti jejak melalui tempat-tempat yang tinggi, maka jejak-jejak dan kotoran-kotoran kudanya itu akan dibalas dengan kebaikan-kebaikan. Seandainya kuda tersebut melewati sebuah sungai lalu meminum airnya, sedang pemiliknya tidak menghendakinya minum, maka itu akan menjadi kebaikan-kebaikan bagi dirinya, dan semuanya itu menjadi pahala bagi pemiliknya. Sedangkan orang yang telah mengikat kudanya karena dia ingin menjauhkan dari ketergantungan dari manusia dan menjaga diri dari dosa, dengan tidak melupakan hak Allah di dalam leher-lehernya atau punggung-punggungnya, maka hal itu menjadi penutup. Adapun seseorang yang telah mengikat kudanya karena perasaan bangga, riya' dan menentang kepada orang Islam maka baginya dosa.\" Rasulullah shallallahu 'alaihi wasallam ditanya tentang keledai, maka beliau menjawab: \"Belum turun kepadaku sesuatu pun tentang itu kecuali hanya ayat yang global ini, yaitu ayat: '(Barangsiapa yang beramal kebaikan sebesar biji sawi maka dia akan melihatnya kelak. Dan barangsiapa yang beramal kejelekan sebesar biji sawi maka dia juga akan melihatnya kelak) '. (Qs. Az Zalzalah: 7-8)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 961
			}
		},
		{
			"hadithnumber": 962,
			"arabicnumber": 962,
			"text": "Telah menceritakan kepadaku dari [Abdullah bin Abdurrahman bin Ma'mar Al Anshari] dari ['Atha bin Yasar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maukah saya beritahukan kepada kalian tentang manusia yang paling bagus kedudukannya? Yaitu seseorang yang memegang tali kekang kuda untuk berjihad di jalan Allah. Maukah saya beritahukan kepada kalian tentang manusia yang paling bagus kedudukannya setelah itu? Yaitu seseorang yang berdiam di tempat kesendiriannya, ia senantiasa shalat malam, menunaikan zakat serta beribadah kepada Allah dengan tidak menyekutukan-Nya dengan sesuatu pun",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 962
			}
		},
		{
			"hadithnumber": 963,
			"arabicnumber": 963,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata, telah mengabarkan kepadaku ['Ubadaah bin Al Walid bin Ubadah bin Ash-Shamit] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Kami telah berbai'at kepada Rasulullah shallallahu 'alaihi wasallam untuk selalu mendengar dan taat, baik pada waktu mudah ataupun sulit, dalam keadaan semangat ataupun terpaksa, untuk tidak menentang pemerintahnya, serta selalu berkata atau menegakkan kebenaran di mana pun kami berada, untuk tidak takut dalam menegakkan urusan karena Allah meskipun mendapat celaan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 963
			}
		},
		{
			"hadithnumber": 964,
			"arabicnumber": 964,
			"text": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] berkata; \"Abu Ubaidah bin Al Jarrah menulis surat kepada Umar bin Al Khattab tentang jumlah pasukan Ramawi dan ketakutan (kaum muslimin) terhadap mereka. Lalu [Umar bin Khattab] membalas kepadanya; \"Amma ba'du: Sekiranya turun penderitaan kepada seorang hamba yang beriman, niscaya Allah akan menjadikan kemudahan setelah itu. Sesungguhnya satu kesulitan tidak akan bisa mengalahkan dua kemudahan, Allah berfirman dalam kitab-Nya: '(Hai orang-orang yang beriman, Bersabarlah kamu dan kuatkanlah kesabaranmu dan tetaplah bersiap siaga (di perbatasan negerimu) dan bertakwalah kepada Allah, supaya kamu beruntung) ' (Qs. Ali Imran: 200)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 964
			}
		},
		{
			"hadithnumber": 965,
			"arabicnumber": 965,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang seseorang bepergian dengan membawa Al Qur'an ke tempat musuh.\" Malik berkata; \"Yang demikian itu dikhawatirkan bahwa musuh akan mengambilnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 965
			}
		},
		{
			"hadithnumber": 966,
			"arabicnumber": 966,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [salah seorang anak Ka'ab bin Malik] berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang orang-orang yang telah membunuh Ibnu Abu Al Huqaiq untuk membunuh wanita dan anak-anak.\" 'Abdurrahman berkata; \"Salah seorang dari mereka berkata, \"Isteri Ibnu Abu Al Huqaiq telah menyusahkan kita dengan teriakannya, aku lalu mengangkat pedangku untuk membunuhnya, namun aku teringat dengan larangan Rasulullah shallallahu 'alaihi wasallam. Maka aku pun mengurungkan niatku. Seandainya tidak ada larangan itu niscaya aku akan membunuhnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 966
			}
		},
		{
			"hadithnumber": 967,
			"arabicnumber": 967,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Ibnu 'Umar] berkata, \"Pada sebagian peperangannya, Rasulullah shallallahu 'alaihi wasallam melihat wanita (terbunuh), lalu beliau mengingkari hal tersebut. kemudian beliau melarang membunuh kaum wanita dan anak-anak",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 967
			}
		},
		{
			"hadithnumber": 968,
			"arabicnumber": 968,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa [Abu Bakar Ash Shiddiq] mengirim pasukan ke negeri Syam, lalu dia ikut keluar bersama Yazid bin Abu Sufyan yang saat itu memimpin seperempat dari tentara tersebut. Orang-orang berkeyakinan bahwa Yazid pernah berkata kepada Abu Bakar, \"Engkau naik, atau aku yang turun.\" Abu Bakar berkata; \"Janganlah kamu turun agar saya mengendarai kendaraan. Saya telah meniatkan langkah-langkahku ini hanya di jalan Allah.\" Kemudian Abu Bakar berkata kepadanya; \"Kalian akan mendapatkan suatu kaum yang mengklaim bahwa mereka telah menahan dirinya untuk Allah, maka jauhilah mereka dan apa yang mereka sangkakan. Kamu juga akan mendapatkan suatu kaum yang menggunduli bagian tengah kepala mereka, maka pukullah apa yang mereka cukur tersebut dengan pedang. Sungguh saya berwasiat kepadamu dengan sepuluh perkara: jangan sekali-kali kamu membunuh wanita, anak-anak dan orang yang sudah tua. Jangan memotong pohon yang sedang berbuah, jangan merobohkan bangunan, jangan menyembelih kambing ataupun unta kecuali hanya untuk dimakan, jangan membakar pohon kurma atau menenggelamkannya. Dan janganlah berbuat ghulul atau menjadi seorang yang penakut",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 968
			}
		},
		{
			"hadithnumber": 969,
			"arabicnumber": 969,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 969
			}
		},
		{
			"hadithnumber": 970,
			"arabicnumber": 970,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 970
			}
		},
		{
			"hadithnumber": 971,
			"arabicnumber": 971,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa jika dia memberikan sesuatu di jalan Allah, dia akan berkata kepada yang menggunakannya: Jika kamu telah sampai di sebuah lembah sebuah desa maka itu terserah kamu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 971
			}
		},
		{
			"hadithnumber": 972,
			"arabicnumber": 972,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa [Sa'id Ibnul Musayyab] berkata; \"Jika seseorang diberi sesuatu dalam sebuah peperangan, lalu dia sampai lokasi keberangkatan perang, maka barang itu menjadi miliknya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 972
			}
		},
		{
			"hadithnumber": 973,
			"arabicnumber": 973,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengutus pasukan yang di dalamnya ada Abdullah bin Umar menuju Najd, lalu mereka mendapatkan rampasan perang berupa unta yang banyak. Sehingga mereka mendapatkan bagian sebanyak dua belas atau sebelas unta, dan mereka juga diberi tambahan satu unta per orang",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 973
			}
		},
		{
			"hadithnumber": 974,
			"arabicnumber": 974,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa ia mendengar [Sa'id bin Musayyab] berkata; \"Orang-orang (kaum muslimin) jika membagi harta ghanimah dari peperangan, mereka mensetarakan satu ekor unta dengan sepuluh kambing",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 974
			}
		},
		{
			"hadithnumber": 975,
			"arabicnumber": 975,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 975
			}
		},
		{
			"hadithnumber": 976,
			"arabicnumber": 976,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari ['Amru bin Katsir bin Aflah] dari [Abu Muhammad] mantan budak Abu Qatadah bin Rib'i, dari [Abu Qatadah bin Rib'i] ia berkata; \"Kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam pada perang Hunain, tatkala kami bertemu (dengan musuh), kaum muslimin bercerai-berai.\" Abu Qatadah berkata; \"Aku melihat seorang musyrik tengah mengincar seorang muslim, maka aku mencarinya hingga mendapatinya dari arah belakang. Aku lalu menebasnya dengan pedang tepat pada bagian leher. Orang musyrik tadi menghadap ke arahku dan merangkulku dengan kuat hingga aku dapat merasakan hawa kematiannya. Dan tidak lama kemudian iapun mati. Lalu saya pergi membawanya.\" Abu Qatadah berkata; \"Lalu aku bertemu Umar bin Khattab, maka aku pun berkata, \"Apa yang terjadi dengan orang-orang musyrik? ' Umar menjawab; \"Ini sudah menjadi ketentuan Allah Ta'ala.\" Kemudian orang-orang muslim kembali pulang. Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barangsiapa membunuh musuh dan bisa membuktikannya, maka baginya harta yang dibawa musuh itu.\" Abu Qatadah berkata; \"Aku lalu berdiri dan bertanya; 'Siapa yang bisa menjadi saksi bagiku?\" Kemudian aku duduk kembali. Beliau bersabda lagi: 'Barangsiapa membunuh musuh dan bisa membuktikannya, maka baginya harta yang dibawa musuh itu.'\" Abu Qatadah berkata; \"Aku lalu berdiri dan berkata; 'Siapa yang bisa menjadi saksi bagiku?\" Kemudian aku duduk kembali. Rasulullah shallallahu 'alaihi wasallam bersabda untuk yang ketiga kalinya, lalu aku berdiri, ketika itu Rasulullah shallallahu 'alaihi wasallam bertanya: 'Apa yang terjadi padamu wahai Abu Qatadah? '.\" Abu Qatadah berkata, \"Lalu aku ceritakan kisah tersebut. Tiba-tiba ada seorang laki-laki berdiri dan berkata; \"Benar wahai Rasulullah, dan harta rampasan yang dibunuh itu ada padaku. Relakankan barang itu untukku, wahai Rasulullah! ' Abu Bakar berkata; 'Tidak, demi Allah. Kalau begitu caranya, itu berarti ada salah satu dari singa-singa Allah berperang karena Allah dan Rasul-Nya, tetapi hartanya diberikan kepada kamu! \" Rasulullah shallallahu 'alaihi wasallam bersabda: 'Benar kata dia, berikanlah kepadanya harta itu, ' laki-laki tersebut lalu memberikan harta rampasannya kepadaku. Maka senjata-senjata tersebut aku jual dan aku belikan sebidang kebun yang hendak panen di Bani Salimah. Harta itu adalah harta pertama yang saya peroleh dalam Islam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 976
			}
		},
		{
			"hadithnumber": 977,
			"arabicnumber": 977,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [al Qasim bin Muhammad] ia berkata; Aku mendengar seorang lelaki bertanya kepada [Abdullah bin Abbas] tentang Al Anfal (harta rampasan) . Ibnu Abbas menjawab, \"Seekor kuda itu termasuk ghanimah, begitu juga senjata atau perhiasan yang di dapat dari orang yang dibunuh.\" al Qasim berkata; \"Laki-laki tadi mengulang pertanyaannya.\" Ibnu Abbas juga menjawab dengan jawaban yang sama. Kemudian lelaki itu bertanya lagi tentang Al Anfal yang termaktub di dalam Al Qur'an, lelaki itu terus saja bertanya, sehingga hampir-hampir saja Ibnu Abbas mengusirnya pergi. Setelah itu Ibnu Abbas berkata, \"Apakah kamu tahu perumpamaan orang ini? Yaitu seperti Shabigh yang dipukul oleh Umar bin Khattab",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 977
			}
		},
		{
			"hadithnumber": 978,
			"arabicnumber": 978,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zinad] dari [Sa'id bin Musayyab] berkata; \"Orang-orang (peserta Perang) juga diberi tambahan harta dari yang seperlima.\" Malik berkata; \"Itu adalah hadits terbaik yang saya dengar dalam masalah ini",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 978
			}
		},
		{
			"hadithnumber": 979,
			"arabicnumber": 979,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 979
			}
		},
		{
			"hadithnumber": 980,
			"arabicnumber": 980,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdu Rabbih bin Sa'id] dari ['Amru bin Syu'aib] berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam kembali dari Hunain, beliau menuju Ji'ranah. Orang-orang bertanya kepada beliau hingga unta beliau mendekat pada sebuah pohon lalu selendang beliau tersangkut, beliau pun terjatuh dari punggung untanya. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Kembalikan selendangku, apakah kalian takut saya tidak membagi kepada kalian apa yang telah Allah kembalikan kepadamu. Demi Dzat yang jiwaku berada di tangan-Nya. Jika Allah mengembalikan kepada kalian, seperti pohon samur (salah satu jenis tumbuhan gurun) Tihamah dalam bentuk ternak, niscaya saya akan membagikan binatang itu kepada kalian. Sehingga kalian tidak mendapatiku sebagai seorang yang pelit, penakut dan pendusta.\" Tatkala Rasulullah shallallahu 'alaihi wasallam turun, beliau berdiri di depan manusia dan bersabda: \"Kembalikanlah jarum dan pakaiannya, sesungguhnya ghulul (mengambil rampasan perang sebelum dibagi) pada hari kiamat adalah kecacatan, neraka, dan aib bagi pengambilnya.\" 'Amru bin Syu'aib berkata; \"Beliau lalu mengambil bulu unta atau sesuatu yang lain dari tanah. Kemudian beliau bersabda: 'Demi Dzat yang jiwaku berada di tangan-Nya. Saya tidak mempunyai sesuatupun dari apa yang Allah berikan kepada kalian yang berupa rampasan Perang kecuali hanya seperlima, dan seperlima itupun dikembalikan kepada kalian",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 980
			}
		},
		{
			"hadithnumber": 981,
			"arabicnumber": 981,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] bahwa [Zaid bin Khalid Al Juhani] berkata; \"Seorang laki-laki meninggal saat perang Hunain, lalu mereka menyampaikan hal itu kepada Rasulullah shallallahu 'alaihi wasallam. Zaid menyatakan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: 'Shalatilah teman kalian itu.\" Maka berubahlah wajah orang-orang karena ucapan Rasulullah. Lalu Zaid mengatakan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: 'Teman kalian itu telah berbuat ghulul di jalan Allah.\" Zaid bin Khalid berkata; \"Kami membuka barang-barangnya, ternyata kami menemukan marjan (mutiara mahkota) Yahudi yang nilainya tidak sampai dua dirham",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 981
			}
		},
		{
			"hadithnumber": 982,
			"arabicnumber": 982,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Abdullah bin Mughirah bin Abu Burdah Al Kinani] bahwa telah sampai kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam menemui manusia di kabilah-kabilah mereka seranya mendoakan mereka semua, kecuali satu kabilah. Abudallah berkata, \"Dan ternyata kabilah tersebut menemukan sebuah kalung marjan pada pelana milik salah seorang dari penduduknya hasil pencurian harta ghanimah. Setelah itu Rasulullah shallallahu 'alaihi wasallam mendatangi mereka dan bertakbir atas mereka sebagaimana beliau bertakbir atas orang mati",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 982
			}
		},
		{
			"hadithnumber": 983,
			"arabicnumber": 983,
			"text": "Telah menceritakan kepadaku dari Malik dari [Tsaur bin Zaid Ad-Dili] dari [Abu Al Ghaits Salim] mantan budak Ibnu Muthi', dari [Abu Hurairah] ia berkata; \"Kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam pada Perang Khaibar, namun kami tidak mendapatkan ghanimah yang berupa emas ataupun uang. Kami hanya mendapatkan harta berupa pakaian dan perkakas.\" Abu Hurairah berkata, \"Rifa'ah bin Zaid lalu memberi hadiah Rasulullah shallallahu 'alaihi wasallam seorang budak hitam yang bernama Mid'am. Rasulullah shallallahu 'alaihi wasallam kemudian menuju Wadil Qura. Ketika kami tiba di Wadil Qura, tiba-tiba muncul anak panah yang tidak diketahui pemiliknya mengenai Mid'am yang sedang menuntun unta Rasulullah shallallahu 'alaihi wasallam hingga tewas. Orang-orang berkata; \"Mudah-mudahan dia masuk surga.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekali-kali tidak, demi dzat yang jiwaku berada di tangan-Nya, mantel yang telah dia ambil pada Perang Khaibar itu adalah termasuk ghanimah yang belum dibagi, dan itu akan akan menyalakan api pada dirinya.\" Abu Hurairah berkata; \"Tatkala orang-orang mendengar ucapan Rasulullah, datang seseorang dengan membawa satu tali sandal atau dua tali sandal kepada Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Satu tali sandal atau dua (yang belum dibagi) bagian dari neraka",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 983
			}
		},
		{
			"hadithnumber": 984,
			"arabicnumber": 984,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa telah sampai kepadanya dari [Abdullah bin Abbas] ia berkata; \"Tidaklah ghulul menyebar pada suatu kaum, kecuali akan ditimpakan kepada mereka rasa ketakutan. Tidaklah perzinaan itu tersebar pada suatu kaum, kecuali akan banyak kematian menimpa mereka. Tidaklah suatu kaum mengurangi takaran dan timbangan kecuali akan diputus rizki kepada mereka. Tidaklah suatu kaum berhukum kepada selain Al Haq kecuali akan tersebar pembunuhan. Dan tidaklah suatu kamu mengkhianati janji kecuali Allah akan menguasakan musuh atas mereka",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 984
			}
		},
		{
			"hadithnumber": 985,
			"arabicnumber": 985,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, sungguh aku ingin berperang di jalan Allah hingga terbunuh, lalu aku dihidupkan kembali dan terbunuh, kemudian aku dihidupkan kembali dan terbunuh.\" Abu Hurairah mengatakannya sampai tiga kali; \"Saya bersaksi, demi Allah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 985
			}
		},
		{
			"hadithnumber": 986,
			"arabicnumber": 986,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Ta'ala tertawa terhadap dua orang laki-laki, salah satu di antara keduanya membunuh yang lain. Tapi keduanya masuk syurga. Yang satu berperang di jalan Allah lalu terbunuh, kemudian Allah menerima taubat seorang pembunuh, lalu pembunuh tersebut berjihad dan terbunuh",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 986
			}
		},
		{
			"hadithnumber": 987,
			"arabicnumber": 987,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, tidaklah seseorang terluka di jalan Allah -dan Allah lebih tahu siapa yang terluka di jalan Nya-, kecuali dia akan datang pada Hari Kiamat sedang lukanya tersebut mengalirkan darah segar, warnanya warna darah namun baunya bau kasturi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 987
			}
		},
		{
			"hadithnumber": 988,
			"arabicnumber": 988,
			"text": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari [Umar bin Khattab] ia berdo'a: \"Ya Allah, janganlah Kau jadikan kematianku pada tangan seorang laki-laki yang menunaikan shalat kepada-Mu meskipun hanya sekali sujud, yang dengan hal itu aku akan berhujah di depan-Mu pada hari kiamat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 988
			}
		},
		{
			"hadithnumber": 989,
			"arabicnumber": 989,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Abdullah bin Abu Qatadah] dari [Bapaknya] berkata; \"Seorang laki-laki menemui Rasulullah shallallahu 'alaihi wasallam dan bertanya, \"Wahai Rasulullah, jika saya terbunuh di jalan Allah dalam keadaan sabar mengharap ridla-Nya, terus maju tanpa lari dari peperangan, apakah Allah akan mengampuni dosa-dosaku'. Rasulullah shallallahu 'alaihi wasallam bersabda: 'Ya benar'. Tatkala lelaki tadi pergi, Rasulullah memanggilnya kembali, atau memerintahkan seseorang untuk memanggilnya. Beliau bertanya kepadanya: \"Apa yang telah kamu katakan tad?\" laki-laki itu lalu mengulangi ucapannya. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Ya, kecuali hutang. Hal itulah yang dikatakan JIbril kepadaku",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 989
			}
		},
		{
			"hadithnumber": 990,
			"arabicnumber": 990,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Nadlr] mantan budak 'Umar bin 'Ubaidullah, telah sampai kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam berkata kepada para syuhada' Uhud: \"Mereka adalah orang-orang yang telah saya saksikan kematiannya.\" Abu Bakar Ash Shiddiq bertanya; \"Wahai Rasulullah, bukankah kami saudara-saudara mereka juga, kami masuk Islam sebagaimana mereka masuk Islam, dan berjihad sebagaimana mereka berjihad?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Benar, tapi saya tidak tahu apa yang akan kalian lakukan sepeninggalku?\" Abu Bakar menangis, dan beliau juga menangis. Abu Bakar berkata; \"Apakah kami akan menjadi orang-orang yang seperti itu setelah engkau?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 990
			}
		},
		{
			"hadithnumber": 991,
			"arabicnumber": 991,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata; \"Rasulullah shallallahu 'alaihi wasallam sedang duduk-duduk, sementara kuburan yang ada di Madinah sedang digali. Ada seseorang mengamati kuburan tersebut sambil berkata; \"Alangkah buruknya pembaringan seorang mukmin.\" Rasulullah shallallahu 'alaihi wasallam lantas bersabda: \"Alangkah jeleknya apa yang kamu katakan itu.\" Lelaki itu berkata; 'Wahai Rasulullah, bukan itu yang aku maksud. Tetapi orang-orang yang meninggal di jalan Allah.\" Rasulullah shallallahu 'alaihi wasallam bersabda: 'Kematian di medan perang itu tidak ada bandingannya. Tidak ada satu jengkal tanah pun di bumi ini yang lebih aku sukai untuk menjadi kuburanku kecuali darinya.\" -tiga kali- maksudnya adalah di kota Madinah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 991
			}
		},
		{
			"hadithnumber": 992,
			"arabicnumber": 992,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] bahwa [Umar bin Khattab] pernah berdo'a: \"Ya Allah, saya meminta kepada-Mu mati syahid di jalan-Mu, dan wafat di negeri Rasul-Mu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 992
			}
		},
		{
			"hadithnumber": 993,
			"arabicnumber": 993,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa [Umar bin Khattab] berkata; \"Kemuliaan seorang mukmin adalah ketakwaannya, agamanya adalah kehormatannya, wibawanya adalah akhlaknya, sedangkan keberanian dan jiwa pengecut adalah adalah naluri yang Allah tanamkan kepada siapa yang Ia kehendaki. Orang yang takut akan lari dari membela bapak dan ibunya, sedang orang yang berani akan berperang membela sesuatu yang tidak akan dibawa ke dalam rumahnya. Gugur dalam peperangan adalah salah satu jenis kematian, sedangkan syahid adalah orang yang menyerahkan jiwanya kepada Allah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 993
			}
		},
		{
			"hadithnumber": 994,
			"arabicnumber": 994,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Umar bin Khattab dimandikan, lalu dikafani dan dishalatkan, padahal dia adalah seorang syahid, mudah-mudahan Allah merahmatinya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 994
			}
		},
		{
			"hadithnumber": 995,
			"arabicnumber": 995,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] berkata, \"Dalam setahun [Umar bin Khattab] bisa membawa empat puluh ribu unta, yang mana seekor unta membawa seorang lelaki ke syam, dan seekor unta membawa dua orang laki-laki ke Irak. Lalu seorang warga Irak mendatanginya dan berkata; \"Bawalah aku dan Suhaim.\" Maka Umar bin Khattab berkata; \"Aku bersumpah dengan nama Allah atas kamu, apakah suhaim itu tempat air yang terbuat dari kulit?\" laki-laki itu menjawab; \"Ya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 995
			}
		},
		{
			"hadithnumber": 996,
			"arabicnumber": 996,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam pergi ke Quba, beliau menemui Ummu Haram binti Milhan, lalu Ummu Haram menyuguhi beliau makanan, Ummu Haram adalah isteri 'Ubadah bin Shamit. Pada suatu hari Rasulullah shallallahu 'alaihi wasallam menemuinya, lalu ia memberi makanan kepada beliau. Ummu Haram kemudian duduk menyangga kepala Rasulullah shallallahu 'alaihi wasallam hingga beliau tertidur. Kemudian beliau bangun sambil tertawa, Ummu Haram berkata, \"Aku lalu bertanya, \"Wahai Rasulullah, apa yang membuat anda tertawa?\" Beliau menjawab: \"Telah diperlihatkan kepadaku beberapa orang dari umatku yang berperang di jalan Allah, mereka unggul di atas lautan laksana para raja di atas dipan.\" atau \"Seperti raja-raja di atas dipan.\" -Ishaq ragu akan hal ini- Ummu Haram berkata; \"Aku lalu bertanya kepada Rasulullah, 'Wahai Rasulullah, doakanlah agar aku termasuk dari mereka.\" Beliau lantas mendoakan Ummu Haram dan kembali melerakkan kepalanya untuk tidur. Kemudian beliau bangun dan tertawa, Ummu Haram bertanya, \"Wahai Rasulullah, apa yang membuat anda tertawa?\" beliau menjawab; \"Telah diperlihatkan kepadaku sekelompok orang dari umatku yang berjuang di jalan Allah, mereka seperti para raja di atas dipan.\" atau \"Seperti raja-raja yang berada di atas dipan…sebagaimana yang disabdakan pertama tadi. Ummu Haram berkata; \"Wahai Rasulullah, berdoalah agar aku termasuk dari mereka.\" Beliau bersabda: \"Kamu termasuk orang-orang yang pertama dari mereka.\" Anas bin Malik berkata; \"Ummu Haram mengarungi lautan pada masa Mu'awiyah, lalu ketika hendak menepi ke pantai, dia terlempar dari kendaraannya dan meninggal dunia",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 996
			}
		},
		{
			"hadithnumber": 997,
			"arabicnumber": 997,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Abu Shalih As-Saman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya tidak khawatir memberatkan umatku, sungguh aku tidak ingin tertinggal dari pasukan yang keluar untuk jihad di jalan Allah, tapi aku stidak menemukan sesuatu yang dapat aku persiapkan untuk mereka, dan mereka juga tidak mendapatkan sesuatu pun yang dapat mereka bawa hingga mereka dapat keluar berperang. Berat perasaan mereka untuk tidak ikut perang setelah kepergianku. Sungguh, ingin sekali aku berperang di jalan Allah hingga terbunuh, kemudian dihidupkan dan terbunuh, kemudian dihidupkan dan terbunuh",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 997
			}
		},
		{
			"hadithnumber": 998,
			"arabicnumber": 998,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata, \"Saat terjadi perang uhud Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang dapat memberitahuku tentang keadaan Sa'ad bin Rabi' Al Anshari? ' lalu ada seorang lelaki berkata; \"Saya, wahai Rasulullah! \" laki-laki itu lantas pergi mencari Sa'ad di antara para syuhada'. Sa'ad bin Rabi' bertanya; \"Sedang apa kamu?\" Laki-laki itu menjawab; \"Rasulullah shallallahu 'alaihi wasallam mengutusku kepadamu supaya aku mendapatkan khabar tentangmu.\" Sa'd berkata; \"Pergilah kepada beliau, sampaikan salam dariku dan kabarkan kepada beliau bahwa aku mendapat luka tusukan sebanyak dua belas tusukan. Aku merasa bahwa kematianku telah dekat. Kabarkanlah kepada kaummu bahwa tidak ada udzur bagi mereka di sisi Allah, jika Rasulullah shallallahu 'alaihi wasallam terbunuh sementara salah satu dari mereka masih ada yang hidup",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 998
			}
		},
		{
			"hadithnumber": 999,
			"arabicnumber": 999,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata, \"Rasulullah shallallahu 'alaihi wasallam selalu memotivasi para sahabat untuk berjihad dan mengingatkan mereka akan keindahan syurga. Saat itu ada seorang laki-laki Anshar sedang makan beberapa biji kurma yang ada di tangannya, laki-laki itu lalu berkata; \"Saya termasuk orang yang tamak terhadap dunia, jika saya sampai menghabiskan kurma ini.\" Laki-laki itu kemudian membuang kurma yang ada di tangannya seraya meraih pedang dan maju untuk berperang hingga terbunuh",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 999
			}
		},
		{
			"hadithnumber": 1000,
			"arabicnumber": 1000,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Mu'adz bin Jabal] berkata; \"Perang itu ada dua macam; perang yang didanai dengan harta yang berharga (halal), bagi orang-orang yang bergabung dimudahkan, panglima ditaati, dan dijauhinya segala bentuk pengrusakan, maka itulah perang yang semuanya bernilai kebaikan. Adapun perang yang di dalamnya: tidak diinfakkannya harta yang berharga, orang-orang yang bergabung tidak dimudahkannya, panglima tidak ditaati, dan segala bentuk pengrusakan tidak dijauhi, maka perang semacam itu tidak akan bermanfaat bagi bala tentaranya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1000
			}
		},
		{
			"hadithnumber": 1001,
			"arabicnumber": 1001,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada ubun-ubun kuda terdapat kebaikan hingga Hari Kiamat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1001
			}
		},
		{
			"hadithnumber": 1002,
			"arabicnumber": 1002,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mempertandingkan kuda yang telah dipersiapkan untuk pacuan dari Haifa' hingga Tsaniyyatul Wada'. Beliau juga pernah mempertandingkan kuda yang tidak dipersiapkan untuk pacuan, dimulai dari Tsaniyyah sampai ke masjid Bani Zuraiq. Dan Abdullah bin Umar termasuk salah seorang pemenangnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1002
			}
		},
		{
			"hadithnumber": 1003,
			"arabicnumber": 1003,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa ia mendengar [Sa'id bin Musayyab] berkata, \"Tidak mengapa pacuan kuda dilakukan apabila ada penghalalnya. Jika dia menang maka dia berhak mengambil taruhan, dan jika kalah maka dia tidak wajib membayar sesuatupun",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1003
			}
		},
		{
			"hadithnumber": 1004,
			"arabicnumber": 1004,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata, \"Rasulullah shallallahu 'alaihi wasallam bermimpi sedang mengusap wajah kudanya dengan selendangnya. Ketika ditanyakan tentang hal itu, beliau menjawab; \"Tadi malam aku diberi diteguran tentang kuda",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1004
			}
		},
		{
			"hadithnumber": 1005,
			"arabicnumber": 1005,
			"text": "Telah menceritakan kepadaku dari Malik dari [Humaid Ath Thawil] dari [Anas bin Malik] berkata, \"Tatkala Rasulullah shallallahu 'alaihi wasallam keluar ke Khaibar, beliau memasuki kota itu pada waktu malam. Jika beliau mendatangi suatu kaum pada malam hari, beliau tidak akan menyerang mereka hingga terbit fajar. Tatkala pagi hari, orang-orang Yahudi keluar membawa cangkul dan keranjang mereka. Ketika mereka melihat Rasulullah shallallahu 'alaihi wasallam, mereka berkata; \"Muhammad! Demi Allah, Muhammad dan tentaranya (datang)! \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allahu Akbar, hancurlah Khaibar, jika kami memasuki halaman suatu kaum niscaya '(…Maka amat buruklah pagi hari yang dialami oleh orang-orang yang diperingatkan itu) '.\" (Qs. Ash Shaffaat: 177)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1005
			}
		},
		{
			"hadithnumber": 1006,
			"arabicnumber": 1006,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Humaid bin Abdurrahman bin 'Auf] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menginfakkan sepasang barang di jalan Allah, maka di surga ia akan diseru, 'Wahai Abdullah, ini adalah sebuah kebaikan.' Bila dia ahli shalat maka dia akan dipanggil dari pintu shalat. Bila dia ahli jihad, maka dia akan dipanggil dari pintu jihad. Bila dia ahli sedekah, maka akan dipanggil dari pintu sedekah. Bila dia ahli puasa, maka dia akan dipanggil dari pintu Ar Rayyan.\" Abu Bakar Ash Shiddiq berkata; \"Wahai Rasulullah, jika seseorang dipanggil dari salah satu pintu dari pintu-pintu yang ada, itu sebuah kepastian, namun mungkinkah jika seseorang dipanggil dari keseluruhan pintu yang ada? Nabi menjawab, \"Itu sangat mungkin, dan aku yakin engkau di antara mereka yang dipanggil dari kesemua pintunya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1006
			}
		},
		{
			"hadithnumber": 1007,
			"arabicnumber": 1007,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdurrahman bin Abu Sha'sha'ah] telah sampai kepadanya bahwa kuburan 'Amru bin Jamuh dan Abdullah bin 'Amru -keduanya dari Anshar dari Bani Salam- rusak akibat hujan yang merendamnya. Hal itu karena kuburan berada di area banjir, keduanya dikubur dalam satu liang, dan mereka termasuk kurban yang terbunuh dalam perang uhud. Lalu digalilah kuburan mereka untuk dipindahkan, namun jasad keduanya tidak berubah sama sekali, seakan-akan keduanya baru meninggal kemarin. Salah seorang dari mereka terluka dan melerakkan tangannya pada lukanya, lalu ia dikuburkan dalam kondisi seperti itu. Setelah digali, tangannya berusaha untuk diluruskan namun tidak bisa (kembali ke tempatnya semula) . Padahal jarak antara perang uhud dan saat penggalian itu dilakukan adalah empat puluh enam tahun",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1007
			}
		},
		{
			"hadithnumber": 1008,
			"arabicnumber": 1008,
			"text": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] berkata; \"Harta ghanimah dari Bahrain tiba di hadapan Abu Bakar Ash Shiddiq, lalu ia berkata; 'Barangsiapa mempunyai janji di sisi Rasulullah shallallahu 'alaihi wasallam, maka hendaklah ia datang kemari.\" Lalu Jabir bin Abdullah datang menemuinya, lalu Abu Bakar memberinya tiga genggam harta",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1008
			}
		}
	]
}