{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"23": "Sacrificial Animals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1028,
			"arabicnumber": 1028,
			"text": "Telah menceritakan kepadaku Yazid dari Malik dari ['Amru bin Al Harits] dari ['Ubaid bin Fairuz] dari [Barra bin 'Azib] berkata, \"Rasulullah shallallahu 'alaihi wasallam ditanya, 'Apa yang harus dijauhi untuk hewan kurban? ' Beliau memberikan isyarat dengan tangannya lantas bersabda: \"Ada empat.\" Barra' lalu memberikan isyarat juga dengan tangannya dan berkata; \"Tanganku lebih pendek daripada tangan Rasulullah shallallahu 'alaihi wasallam: (empat perkara tersebut adalah) hewan yang jelas-jelas pincang kakinya, hewan yang jelas butanya, hewan yang sakit dan hewan yang kurus dan lemah yang tidak ada dagingnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1028
			}
		},
		{
			"hadithnumber": 1029,
			"arabicnumber": 1029,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] menjauhi hewan kurban yang belum cukup umur dan unta yang masih kecil. Malik berkata; \"Ini yang aku sukai dari apa yang pernah aku dengar",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1029
			}
		},
		{
			"hadithnumber": 1030,
			"arabicnumber": 1030,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] pernah menyembelih binatang kurban di Madinah. Nafi' berkata; \"Dia lalu menyuruhku untuk membelikan kambing jantan yang bertanduk. Kemudian aku menyembelihnya pada hari Idul Adlha di tempat shalat orang-orang.\" Nafi' melanjutkan, \"Kemudian aku melaksanakannya, binatang tersebut lalu dibawa kepada Abdullah bin Umar. Dia memotong rambutnya saat kambing tersebut disembelih, sebab waktu itu ia sedang sakit hingga tidak bisa mengikuti shalat idul adlha bersama orang-orang. Nafi' berkata; \"Abdullah bin Umar pernah berkata; 'Orang yang berkurban tidak wajib mencukur rambutnya.\" Namun Ibnu Umar melakuakannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1030
			}
		},
		{
			"hadithnumber": 1031,
			"arabicnumber": 1031,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Busyair bin Yasar] bahwa [Abu Burdah bin Niyar] telah menyembelih kurbannya sebelum Rasulullah Shalla Allahu 'alaihi wa sallam menyembelih kurban pada hari Idul Adlha. Abu Burdah beranggapan bahwa Rasulullah Shalla Allahu 'alaihi wa sallam menyuruhnya untuk mengulang kembali. Maka Abu Burdah pun berkata; \"Wahai Rasulullah, aku tidak mempunyai kecuali hanya seekor kambing?\" Rasulullah Shalla Allahu 'alaihi wa sallam) bersabda: \"Jika kamu tidak mempunyai kecuali hanya seekor jadza' (kambing yang masuk umur dua tahun), maka sembelihlah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1031
			}
		},
		{
			"hadithnumber": 1032,
			"arabicnumber": 1032,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Abbad bin Tamim] bahwa [Uwaimir bin Asyqar] telah menyembelih kurbannya sebelum shalat Idul Adlha. Lalu dia menyampaikan hal tersebut kepada Rasulullah Shalla Allahu 'alaihi wa sallam, hingga beliau menyuruhnya untuk menyembelih lagi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1032
			}
		},
		{
			"hadithnumber": 1033,
			"arabicnumber": 1033,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zubair Al Maki] dari [Jabir bin Abdullah] berkata, \"Rasulullah Shalla Allahu 'alaihi wa sallam melarang untuk makan daging kurban setelah tiga hari, setelah itu beliau bersabda: \"Makanlah kalian, sedekahkanlah, berbekallah dengannya dan simpanlah sisanya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1033
			}
		},
		{
			"hadithnumber": 1034,
			"arabicnumber": 1034,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar] dari [Abdullah bin Waqid] ia berkata; \"Rasulullah Shalla Allahu 'alaihi wa sallam melarang memakan daging kurban setelah tiga hari.\" Abdulah bin Abu Bakar berkata; \"Kemudian hal itu aku sampaikan kepada ['Amrah binti Abdurrahman] ia berkata; 'Benar, aku telah mendengar ['Aisyah], isteri Nabi Shalla Allahu 'alaihi wa sallam berkata; 'Pada masa Rasulullah shallallahu 'alaihi wasallam sekelompok orang-orang Badui memukul rebana menyambut kehadiran hari Idul Adlha, lalu Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: 'Simpanlah daging kurban untuk tiga hari dan sedekahkanlah sisanya.' Aisyah berkata; \"Setelah itu ada yang bertanya kepada Rasulullah Shalla Allahu 'alaihi wa sallam; 'Orang-orang telah memanfaatkan binatang kurban tersebut dengan menghilangkan lemaknya dan menjadikan (kulit-kulitnya) sebagai tempat air?\" Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: 'Kenapa begitu?\" atau yang semisal itu. Mereka pun menjawab, \"Anda telah melarang daging kurban setelah tiga hari.\" Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: 'Saya melarang kalian karena adanya orang-orang yang datang. Makanlah daging tersebut, sedekahkanlah dan simpanlah sisanya, untuk diberikan pada kaum miskin yang datang ke Madinah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1034
			}
		},
		{
			"hadithnumber": 1035,
			"arabicnumber": 1035,
			"text": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] dari [Abu Sa'id Al Khudri] Bahwa ia baru datang dari suatu perjalanan, lalu keluarganya menyuguhkan daging kepadanya. Abu Sa'id lalu berkata; \"Lihatlah ini, apakah ini daging kurban?\" Mereka menjawab; \"Ya, ini adalah daging kurban.\" Abu Sa'id berkata; \"Bukankah Rasulullah shallallahu 'alaihi wasallam telah melarangnya?\" Mereka menjawab; \"Telah ada perintah yang lain dari Rasulullah Shalla Allahu 'alaihi wa sallam setelah kepergianmu.\" Abu Sa'id lalu keluar dan bertanya mengenai hal itu, kemudian dia diberi tahu bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya telah melarang kalian memakan daging kurban setelah tiga hari, sekarang makanlah, sedekahkanlah dan simpanlah sisanya. Saya juga telah melarang kalian menyimpan perasan anggur, sekarang lakukan hal itu, dan setiap yang memabukkan itu haram. Saya juga telah melarang kalian untuk berziarah kubur, sekarang ziarahlah dan janganlah kalian mengatakan ucapan yang jelek (saat berziarah)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1035
			}
		},
		{
			"hadithnumber": 1036,
			"arabicnumber": 1036,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zubair Al Maki] dari [Jabir bin Abdullah] ia berkata; \"Pada peristiwa Hudaibiyah kami pernah berkurban bersama Rasulullah shallallahu 'alaihi wasallam; satu ekor unta untuk tujuh orang dan satu sapi untuk tujuh orang",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1036
			}
		},
		{
			"hadithnumber": 1037,
			"arabicnumber": 1037,
			"text": "Telah menceritakan kepadaku dari Malik dari ['Umarah bin Shayyad] bahwa ['Atha bin Yassar] mengabarkan kepadanya bahwa [Abu Ayyub Al Anshari] mengabarkan kepadanya, ia berkata, \"Kami pernah berkurban satu ekor kambing untuk satu orang dan keluarganya, setelah itu orang-orang saling berbangga-bangga dan berlaku sombong",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1037
			}
		},
		{
			"hadithnumber": 1038,
			"arabicnumber": 1038,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] berkata; \"Rasulullah shallallahu 'alaihi wasallam tidak pernah menyembelih untuk dirinya dan keluarganya kecuali satu ekor unta atau satu ekor sapi.\" Malik berkata; \"Saya tidak tahu yang mana yang dikatakan oleh Ibnu Syihab",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1038
			}
		},
		{
			"hadithnumber": 1039,
			"arabicnumber": 1039,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata; \"Menyembelih bisa dilakukan hingga dua hari setelah hari Idul Adlha.\" Telah menceritakan kepadaku dari Malik Bahwasanya telah sampai kepadanya, dari Ali bin Abu Thalib seperti hadits tersebut",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1039
			}
		},
		{
			"hadithnumber": 1041,
			"arabicnumber": 1041,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] tidak pernah berkurban untuk sesuatu yang masih di dalam perut ibunya.\" Malik berkata; \"Kurban hukumnya sunnah dan tidak wajib, namun saya tidak suka bagi orang yang mampu membelinya tapi dia meninggalkannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1041
			}
		}
	]
}