{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"28": "Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1091,
			"arabicnumber": 1091,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Muhammad bin Yahya bin Habban] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \"Janganlah salah seorang dari kalian melamar pinangan saudaranya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1091
			}
		},
		{
			"hadithnumber": 1092,
			"arabicnumber": 1092,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \"Janganlah salah seorang dari kalian melamar pinangan saudaranya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1092
			}
		},
		{
			"hadithnumber": 1093,
			"arabicnumber": 1093,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Qasim] dari [Bapaknya] bahwa dia berkata mengenai firman Allah Ta'ala: '(Dan tidak ada dosa bagi kamu meminang wanita-wanita itu dengan sindiran atau kamu menyembunyikan (keinginan mengawini mereka) dalam hatimu. Allah mengetahui bahwa kamu akan menyebut-nyebut mereka, dalam pada itu janganlah kamu mengadakan janji kawin dengan mereka secara rahasia, kecuali sekedar mengucapkan (kepada mereka) perkataan yang ma'ruf) ' (Qs. Al Baqarah: 235) yaitu seorang laki-laki yang berkata kepada seorang wanita yang masih berada pada masa iddah dari kematian suaminya, 'Kamu begitu mulia bagiku, saya ada rasa cinta terhadapmu, semoga Allah menuntunmu kepada kebaikan dan jalan rezki', atau ucapan lain yang semisalnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1093
			}
		},
		{
			"hadithnumber": 1094,
			"arabicnumber": 1094,
			"text": "Telah menceritakan kepadaku Malik dari [Abdullah bin Al Fadl] dari [Nafi' bin Jubair bin Muth'im] dari [Abdullah bin 'Abbas] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \"Seorang janda itu lebih berhak memilih suami daripada walinya sedang seorang gadis harus dimintai persetujuannya, dan tanda persetujuannya adalah sikap diamnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1094
			}
		},
		{
			"hadithnumber": 1095,
			"arabicnumber": 1095,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1095
			}
		},
		{
			"hadithnumber": 1096,
			"arabicnumber": 1096,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1096
			}
		},
		{
			"hadithnumber": 1097,
			"arabicnumber": 1097,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1097
			}
		},
		{
			"hadithnumber": 1098,
			"arabicnumber": 1098,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Hazm bin Dinar] dari [Sahal bin Sa'ad As Sa'idi] berkata, \"Seorang wanita datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, saya telah menyerahkan diriku sepenuhnya kepada anda.\" Beliau lalu berdiri lama, hingga ada seorang laki-laki berdiri seraya mengatakan, \"Wahai Rasulullah, jika anda tidak berkenan dengannya, maka nikahkanlah aku dengannya.\" Rasulullah Shalla Allahu 'alaihi wa sallam lalu bertanya kepada laki-laki tersebut: \"Apakah kamu mempunyai sesuatu yang dapat dijadikan mahar untuknya?\" laki-laki itu menjawab; \"Saya tidak mempunyai sesuatu kecuali kain sarung ini.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kamu memberikan kain sarung itu padanya, maka kamu akan duduk tanpa sarung. Carilah yang lain.\" Laki-laki itu mengadu; \"Saya tidak mempunyai sesuatupun.\" Beliau bersabda lagi: \"Carilah walau hanya sekedar cincin besi! .\" Laki-laki itu lalu mencari namun tidak mendapatkannya. Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apakah kamu mempunyai hafalan dari Al Qur'an?\" laki-laki itu menjawab; \"Ya, saya telah hafal surat ini dan ini.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Maka aku nikahkah kamu dengan wanita itu, dengan mahar apa yang telah engkau hafal dari surat Al-Qur'an",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1098
			}
		},
		{
			"hadithnumber": 1099,
			"arabicnumber": 1099,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] ia berkata; [Umar bin Khattab] berkata; \"Laki-laki mana saja yang menikahi wanita yang terkena gila, atau lepra, atau kusta, lalu ia menyetubuhinya, maka wanita itu berhak mendapatkan mahar secara penuh. Dan hal itu berakibat walinya yang wajib menanggung hutang atas suaminya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1099
			}
		},
		{
			"hadithnumber": 1100,
			"arabicnumber": 1100,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] berkata, \"Puteri Ubaidullah bin Umar - ibunya adalah puteri Zaid bin Al Khattab- adalah isteri dari puteranya Abdullah bin Umar, lalu ia (putera Abdullah bin Umar) meninggal dunia dan belum sempat menyetubuhinya serta belum disebutkan maharnya. Maka ibu dari isterinya menginginkan mahar puterinya, [Abdullah bin Umar] lalu berkata; \"Tidak ada mahar baginya, sekiranya ia berhak tentu kami tidak akan menahan mahar tersebut atau berbuat zhalim kepadanya.\" Ibunya merasa keberatan menerima keputusan itu, lalu orang-orang mengambil seseorang yang bisa menjadi penengah, yaitu Zaid bin Tsabit. Lalu [Zaid] memutuskan bahwa wanita tersebut tidak mendapatkan mahar, tetapi ia mendapatkan warisan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1100
			}
		},
		{
			"hadithnumber": 1101,
			"arabicnumber": 1101,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1101
			}
		},
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] bahwa [Umar bin Khattab] memberi putusan tentang wanita yang telah dinikahi oleh seorang laki-laki: \"Jika tirai telah diturunkan, maka mahar wajib dibayarkan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1102
			}
		},
		{
			"hadithnumber": 1103,
			"arabicnumber": 1103,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] bahwa [Zaid bin Tsabit] berkata; \"Jika seorang laki-laki menemui isterinya dan tirai telah diturunkan, maka mahar wajib dibayarkan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1103
			}
		},
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1104
			}
		},
		{
			"hadithnumber": 1105,
			"arabicnumber": 1105,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdullah bin Abu Bakar bin Muhammad bin 'Amru bin Hazm] dari [Abdul Malik bin Abu Bakar bin Abdurrahman bin Al Harits bin Hisyam Al Makhzumi] dari [Bapaknya] berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam menikahi Ummu Salamah dan telah bersama, beliau berkata kepadanya: \"Tidak ada peremehan atas keluargamu. Jika kamu mau, saya akan tinggal selama tujuh hari untukmu dan tujuh hari untuk isteriku yang lain. dan jika kamu mau, saya akan tinggal selama tiga hari bersamamu, lalu saya menggilir.\" Ummu salamah lantas menjawab, \"Berikan aku tiga hari",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1105
			}
		},
		{
			"hadithnumber": 1106,
			"arabicnumber": 1106,
			"text": "Telah menceritakan kepadaku dari Malik dari [Humaid Ath Thawil] dari [Anas bin Malik] berkata; \"Bagi seorang gadis tujuh hari, sedangkan bagi seorang janda cukup tiga hari.\" Malik berkata; \"Itulah pendapat yang kami pakai",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1106
			}
		},
		{
			"hadithnumber": 1107,
			"arabicnumber": 1107,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1107
			}
		},
		{
			"hadithnumber": 1108,
			"arabicnumber": 1108,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Al Miswar bin Rifa'ah Al Quradli] dari [Zubair bin Abdurrahman bin Zubair] berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam Rifa'ah bin Simwal mentalak isterinya yang bernama Tamimah binti Wahab sebanyak tiga kali. Kemudian bekas isterinya menikah dengan Abdurrahman bin Zubair. Namun Abdurrahman mempunyai masalah karena tidak mampu menyetubuhinya, sehingga ia kembali mencerikan Tamimah. Maka Rifa'ah ingin menikahinya kembali, karena dia adalah suami pertama yang pernah menceraikannya. Lalu hal itu disampaikan kepada Rasulullah shallallahu 'alaihi wasallam, namun beliau melarangnya seraya bersabda: \"Tidak halal bagimu untuk menikahinya lagi, hingga ia merasakan nikmatnya madu laki-laki yang lain (bersetubuh)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1108
			}
		},
		{
			"hadithnumber": 1109,
			"arabicnumber": 1109,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Al Qasim bin Muhammad] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, dia pernah ditanya tentang laki-laki yang menceraikan isterinya dengan thalaq ba'in (thalaq tiga), kemudian ada laki-laki lain menikahinya dan mencerikannya lagi sebelum melakukan persetubuhan dengannya. Maka apakah boleh bagi suaminya yang pertama untuk menikahinya lagi? 'Aisyah menjawab; \"Tidak boleh, hingga suaminya (yang kedua) dapat merasakan nikmatnya hubungan intim dengannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1109
			}
		},
		{
			"hadithnumber": 1110,
			"arabicnumber": 1110,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1110
			}
		},
		{
			"hadithnumber": 1111,
			"arabicnumber": 1111,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh menikahi seorang perempuan bersamaan dengan bibinya dari pihak bapak dan tidak boleh menikahi perempuan bersamaan dengan bibinya dari pihak ibunya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1111
			}
		},
		{
			"hadithnumber": 1112,
			"arabicnumber": 1112,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] berkata; \"Tidak boleh menyatukan wanita dengan bibinya dari pihak bapaknya atau dari pihak ibunya. Tidak boleh juga seseorang menyetubuhi isterinya yang sedang mengandung janin orang lain",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1112
			}
		},
		{
			"hadithnumber": 1113,
			"arabicnumber": 1113,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] berkata; \" [Zaid bin Tsabit] ditanya tentang seseorang yang menikahi wanita kemudian menceraikannya sebelum menyetubuhinya, apakah ibunya halal untuk dinikahi?\" Zaid bin Tsabit menjawab; \"Tidak boleh. Karena setatus ibu tidak dirinci, dan tidak ada syarat padanya. Adapun yang disebutkan syaratnya adalah pada anak tiri",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1113
			}
		},
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1114
			}
		},
		{
			"hadithnumber": 1115,
			"arabicnumber": 1115,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang tentang nikah Syighar. Syighar adalah seseorang yang menikahkan puterinya dengan orang lain dengan syarat orang tersebut menikahkan puterinya dengan dirinya tanpa mahar antara keduanya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1115
			}
		},
		{
			"hadithnumber": 1116,
			"arabicnumber": 1116,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] dari [Abdurrahman] dan [Mujamma'] keduanya adalah anak Yazid bin Jariyah Al Anshari, dari Khansa binti Khidam Al Anshariyah waktu itu ia adalah seorang janda, lalu bapaknya menikahkannya tetapi ia tidak mau menerima pernikahan tersebut. Lalu ia menemui Rasulullah shallallahu 'alaihi wasallam hingga beliau membatalkan pernikahan tersebut",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1116
			}
		},
		{
			"hadithnumber": 1117,
			"arabicnumber": 1117,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zubair Al Maki] berkata, \"Pernah dihadapkan kepada Umar Ibnul Khattab suatu pernikahan yang hanya disaksikan oleh seorang laki-laki dan seorang wanita, maka [Umar] berkata, \"Ini adalah nikah sirri, saya tidak membolehkannya. Sekiranya saya menemukannya, niscaya saya akan merajamnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1117
			}
		},
		{
			"hadithnumber": 1118,
			"arabicnumber": 1118,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Sa'id Ibnul Musayyab] dari [Sulaiman bin Yasar] berkata, \"Thulaihah Al Asadiyah adalah isteri Rusyaid Ats Tsaqafi, tetapi kemudian ia menceraikannya. Thulaihah kemudian menikah pada masa iddahnya. ' [Umar Ibnul Khattab] lantas memukulnya, demikianjuga dengan suaminya, ia memukul Thulaihah dengan cambuk berkali-kali. Umar kemudian memisahkan antara Thulaihah dengan suaminya (yang kedua) . Setelah itu ia berkata, \"Wanita mana saja yang menikah pada masa iddahnya, jika suaminya yang menikahinya belum menyetubuhinya maka keduanya harus dipisahkan, lalu ia harus melanjutkan sisa masa iddahnya dari suami yang pertama. Dan suami yang kedua itu setatusnya sebagai pelamar saja. Tetapi jika ia (suami kedua) telah menggaulinya, maka keduanya dipisahkan, lalu Isterinya melakukan iddah pada sisa masa iddahnya dari suaminya yang pertama kemudian ditambah dengan iddah dari suaminya yang kedua, dan keduanya tidak boleh bersama lagi untuk selamanya.\" Malik berkata; \"Sa'id Ibnul Musayyab berkata; 'Perempuan tersebut berhak mendapatkan mahar (dari suami kedua), karena ia telah mensetubuhinya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1118
			}
		},
		{
			"hadithnumber": 1119,
			"arabicnumber": 1119,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1119
			}
		},
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id Ibnul Musayyab] ia berkata; \"Hamba sahaya tidak boleh dinikahi untuk dimadu dengan wanita merdeka, kecuali jika wanita merdeka tersebut ridla. Jika wanita merdeka tadi menyetujui maka dia berhak mendapatkan dua pertiga dalam pembagian",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1120
			}
		},
		{
			"hadithnumber": 1121,
			"arabicnumber": 1121,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Abu Abdurrahman] dari [Zaid bin Tsabit] Bahwasanya ia berkata tentang seorang laki-laki yang mentalak budak wanitanya dengan talak tiga, kemudian membelinya kembali, \"Budak wanita itu tidak halal baginya sehingga ia menikah dengan laki-laki lain",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1121
			}
		},
		{
			"hadithnumber": 1122,
			"arabicnumber": 1122,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1122
			}
		},
		{
			"hadithnumber": 1123,
			"arabicnumber": 1123,
			"text": "Telah menceritakan kepadaku dari Malik Bahwasanya ia pernah bertanya kepada [Ibnu Syihab] tentang laki-laki yang mempunyai isteri seorang budak, lalu ia membelinya setelah ia mentalaknya dengan talak satu. Ibnu Syihab menjawab, \"Budak itu tetap halal baginya karena status kepemilikan budak, selama ia tidak menjatuhkan talak ba'in. Tetapi jika ia telah menjatuhkan talak ba'in, maka tidak halal baginya walau statusnya sebagai budak miliknya, hal itu hingga budak tersebut menikah dengan laki-laki lain",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1123
			}
		},
		{
			"hadithnumber": 1124,
			"arabicnumber": 1124,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari ['Ubaidullah bin Abdullah bin 'Utbah bin Mas'ud] dari [Bapaknya] bahwasanya [Umar bin Khattab] ditanya tentang seorang budak wanita dan puterinya, yang telah disetubuhi salah satunya setelah yang lainnya juga. Umar berkata; \"Saya tidak suka jika menggauli keduanya.\" 'Umar Ibnul Khattab melarang perbuatan tersebut",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1124
			}
		},
		{
			"hadithnumber": 1125,
			"arabicnumber": 1125,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Qabishah bin Dzu`aib] bahwa ada seorang laki-laki bertanya kepada [Utsman bin Affan] tentang dua perempuan yang bersaudara berada di bawah kepemilikan seseorang, apakah keduanya boleh digauli? Utsman menjawab; \"Ayat Al Qur'an telah menghalalkan keduanya, namun ada juga ayat lain mengharamkan keduanya (untuk digauli) . Tetapi aku sendiri tidak suka untuk melakukan hal itu (menggauli dua-duanya) .\" Qabishah berkata; \"Laki-laki tersebut kemudian keluar meninggalkan kediaman Utsman dan berjumpa dengan [seorang sahabat] Nabi shallallahu 'alaihi wasallam, lalu ia tanyakan hal itu kepadanya. Sahabat itu lalu menjawab, \"Sekiranya aku mempunyai wewenang dalam hal itu, lalu aku mendapati orang yang melakukannya niscaya aku akan memberinya hukuman.\" Ibnu Syihab berkata; \"Menurutku sahabat tersebut adalah Ali bin Abu Thalib",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1125
			}
		},
		{
			"hadithnumber": 1126,
			"arabicnumber": 1126,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1126
			}
		},
		{
			"hadithnumber": 1127,
			"arabicnumber": 1127,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1127
			}
		},
		{
			"hadithnumber": 1128,
			"arabicnumber": 1128,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Mujabbar] berkata; \" [Salim bin Abdullah] pernah memberikan hadiah berupa budak wanita kepada anak laki-lakinya sambil mengatakan, \"Kamu jangan mendekatinya, aku ingin menggaulinya, hanya saja aku belum bernafsu terhadapnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1128
			}
		},
		{
			"hadithnumber": 1129,
			"arabicnumber": 1129,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa Abu Nahsyal bin Al Aswad berkata kepada [Al Qasim bin Muhammad], \"Saya melihat pakaian budak wanitaku tersingkap, lalu aku mendudukinya layaknya seorang suami menduduki isterinya (posisi senggama) . Lantas ia berkata, \"Saya sedang haid! \" Aku lalu berdiri dan tidak mendekatinya setelah itu, maka apakah aku boleh memberikan budak tersebut kepada anakku supaya menyetubuhinya?\" Tetapi Al Qasim melarangnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1129
			}
		},
		{
			"hadithnumber": 1130,
			"arabicnumber": 1130,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibrahim bin Abu 'Ablah] dari [Abdul Malik bin Marwan] bahwa dia pernah memberi hadiah kepada sahabatnya seorang budak wanita. Kemudian dia bertanya tentang perihal budak wanita tersebut, sahabatnya lalu berkata, \"Aku punya keinginan untuk memberikan budak tersebut kepada anakku hingga dia dapat melakukan ini dan itu.\" Abdul Malik berkata; \"Sungguh [Marwan] lebih wara' (menjaga diri) darimu, dia pernah memberikan budak perempuan kepada anaknya seraya berkata; \"Kamu jangan mendekati budak wanita itu, karena aku pernah melihat betisnya tersingkap",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1130
			}
		},
		{
			"hadithnumber": 1131,
			"arabicnumber": 1131,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] ia berkata; \"Yang dimaksud dengan '(Perempuan-perempuan yang menjaga kehormatan) ' adalah perempuan-perempuan yang memiliki suami. Demikian ini karena Allah mengharamkan hukum zina",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1131
			}
		},
		{
			"hadithnumber": 1132,
			"arabicnumber": 1132,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] telah sampai kepadanya, dari [Al Qasim bin Muhammad] keduanya berkata; \"Jika seorang laki-laki merdeka menikahi budak wanita lalu menyetubuhinya, maka budak itu telah menjaga kehormatannya.\" Malik berkata; \"Hampir semua orang yang saya temui mengatakan, 'budak wanita itu menjaga kehormatan laki-laki merdeka; yaitu jika ia menikahi lalu menggaulinya, maka artinya budak itu budak tersebut telah menjaga kehormatannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1132
			}
		},
		{
			"hadithnumber": 1133,
			"arabicnumber": 1133,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Abdullah] dan [Hasan] keduanya adalah anak Muhammad bin Ali bin Abu Thalib, dari [Bapaknya] dari [Ali bin Abu Thalib] berkata, \"Pada perang Khaibar Rasulullah shallallahu 'alaihi wasallam melarang nikah mut'ah makan daging keledai jinak",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1133
			}
		},
		{
			"hadithnumber": 1134,
			"arabicnumber": 1134,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Urwah bin Zubair] bahwa Khaulah binti Hakim menemui Umar bin Khattab dan berkata; \"Rabi'ah bin Umayyah telah menikah secara mut'ah dengan seorang wanita, lalu wanita itu hamil! \" [Umar bin Khattab] kemudian keluar dengan membawa selendangnya, lalu ia berkata, 'Ini adalah Nikah mut'ah, sekiranya aku mendapatinya, maka akan aku rajam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1134
			}
		},
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"text": "Telah menceritakan kepadaku Yazid dari Malik telah mendengar [Rabi'ah bin Abu Abdurrahman] ia berkata; \"Seorang budak itu boleh menikahi empat wanita.\" Malik berkata; \"Pendapat ini adalah pendapat yang paling baik yang telah saya dengar dalam masalah itu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1135
			}
		},
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] telah sampai kepadanya, bahwa para wanita pada masa Rasulullah shallallahu 'alaihi wasallam telah masuk Islam di tanah kelahirannya dan mereka tidak termasuk orang yang berhijrah. Ketika mereka masuk Islam, suami-suami mereka masih dalam keadaan kafir. Di antara mereka adalah puteri Al Walid bin Mughirah. Ia adalah isteri Shafwan bin Umayyah, lalu ia masuk Islam pada waktu Fathu Makkah, sedangkan suaminya, Shafwan bin Umayyah belum mau masuk Islam. Rasulullah shallallahu 'alaihi wasallam mengutus keponakannya, Wahab bin Umair kepadanya dengan membawa selendang Rasulullah shallallahu 'alaihi wasallam sebagai bentuk jaminan keamanan untuk Shafwan bin Umayyah. Rasulullah shallallahu 'alaihi wasallam kemudian mengajaknya masuk Islam dan menginginkan agar ia menemui beliau. Jika ia setuju dengan hal itu maka ia akan menerimanya, jika tidak setuju maka beliau akan memberi waktu dua bulan.\" Tatkala Shafwan menghadap Rasulullah shallallahu 'alaihi wasallam dengan membawa selendang beliau, dia memanggil Rasulullah shallallahu 'alaihi wasallam di depan para tokoh. Ia mengatakan, \"Wahai Muhammad, Wahab bin Umair telah menemuiku dengan membawa selendangmu, dia menyatakan bahwa engkau menyuruh agar aku menghadapmu, jika aku menyetujui hal tersebut maka pasti aku terima. Jika tidak, kamu akan memberi waktu penangguhan selama dua bulan?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Abu Wahab, turunlah (dari kendaraan) .\" Dia menjawab; \"Tidak, Demi Allah, saya tidak akan turun hingga engkau menjelaskannya kepadaku.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Bahkan penangguhanmu selama empat bulan.\" Selanjutnya Rasulullah shallallahu 'alaihi wasallam berangkat menghadapi Hawazin di daerah Hunain. Beliau mengirim utusan kepada Shafwan bin Umayyah untuk meminjam peralatan perang dan senjata miliknya.\" Shafwan berkata; \"Berdasarkan paksaan atau kerelaan.\" Beliau menjawab; \"Kerelaan.\" Lalu Shafwan meminjamkan peralatan perang dan senjata miliknya. Kemudian Shafwan pun ikut berangkat bersama Rasulullah shallallahu 'alaihi wasallam, sementara ia masih dalam keadaan kafir. Ia pernah mengikuti peperangan Hunain dan Tha'if. Waktu itu dia masih kafir sedang isterinya telah masuk Islam, tetapi Rasulullah shallallahu 'alaihi wasallam tidak memisahkan antara ia dan isterinya hingga Shafwan masuk Islam, dan isterinya masih mengakuinya dengan pernikahan yang lama.\" Telah menceritakan kepadaku dari Malik dari Ibnu Syihab berkata; \"Jarak waktu antara Islamnya Shafwan dan Islamnya isterinya itu sekitar dua bulan.\" Ibnu Syihab berkata; \"Tidak ada kabar yang sampai kepada kami, bahwa jika seorang perempuan berhijrah kepada Allah dan Rasul-Nya sedang suaminya kafir dan masih menetap di Darul Kufr, kecuali hijrahnya akan menjadi pemisah antara dirinya dengan suaminya, kecuali jika suaminya datang untuk berhijrah sebelum habis masa iddah isterinya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1136
			}
		},
		{
			"hadithnumber": 1137,
			"arabicnumber": 1137,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1137
			}
		},
		{
			"hadithnumber": 1138,
			"arabicnumber": 1138,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] ia bahwa: \"Ummu Hakim binti Al Harits bin Hisyam adalah isteri Ikrimah bin Abu Jahl, lalu dia masuk Islam pada waktu Fathu Makkah sedang suaminya, Ikrimah bin Abu Jahl kabur karena tidak mau masuk Islam, sehingga ia (Ikrimah) sampai ke kota Yaman. Ummu Hakim lantas menyusulnya hingga ke Yaman, lalu ia mengajak suaminya masuk ke dalam Islam. Akhirnya Ikrimah pun masuk Islam, ia lalu menemui Rasulullah shallallahu 'alaihi wasallam saat terjadi pembukaan kota Makkah. Tatkala Rasulullah shallallahu 'alaihi wasallam melihatnya, beliau menyambutnya dengan gembira, sementara Ikrimah tidak membawa selendang (sebagai tanda jaminan) hingga ia membaiat Rasulullah shallallahu 'alaihi wasallam. Setelah itu beliau menetapkan kembali pernikahan mereka berdua",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1138
			}
		},
		{
			"hadithnumber": 1139,
			"arabicnumber": 1139,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Humaid Ath Thawil] dari [Anas bin Malik] berkata, \"Abdurrahman bin 'Auf menemui Rasulullah shallallahu 'alaihi wasallam, sementara pada dirinya terdapat waran kuning bekas za'faran. Sehingga Rasulullah shallallahu 'alaihi wasallam menanyakan sebabnya, lalu dia memberitahukan bahwa dirinya baru saja menikah. Rasulullah shallallahu 'alaihi wasallam bertanya: \"Berapa mahar yang kamu berikan kepadanya?\" 'Abdurrahman menjawab; \"Emas sebesar biji kurma.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Adakanlah walimah walau hanya dengan menyembelih seekor kambing",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1139
			}
		},
		{
			"hadithnumber": 1140,
			"arabicnumber": 1140,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata; \"Telah sampai kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam pernah mengadakan walimah, sementara di dalamnya tidak terdapat roti maupun daging sama sekali",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1140
			}
		},
		{
			"hadithnumber": 1141,
			"arabicnumber": 1141,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin 'Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang di antara kalian diundang untuk mendatangi acara walimah, hendaklah dia mendatanginya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1141
			}
		},
		{
			"hadithnumber": 1142,
			"arabicnumber": 1142,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Al A'raj] dari [Abu Hurairah] ia berkata; \"Seburuk-buruk makanan ialah makanan walimah yang di dalamnya hanya diundang orang-orang kaya, tanpa orang-orang miskin. Barangsiapa tidak mendatangi undangan walimah, berarti dia telah bermaksiat kepada Allah dan Rasul-Nya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1142
			}
		},
		{
			"hadithnumber": 1143,
			"arabicnumber": 1143,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ishaq bin Abdullah bin Abu Thalhah] Bahwasanya ia mendengar [Anas bin Malik] ia berkata; \"Seorang penjahit mengundang Rasulullah shallallahu 'alaihi wasallam menghadiri masakan yang telah buat.\" Anas berkata; \"Aku lalu pergi bersama beliau menghadiri undangan tersebut. Beliau dipersilahkan menikmati hidangan berupa roti dari gandum beserta kuah yang di dalamnya terdapat sejenis labu.\" Anas melanjutkan, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam mencari-cari labu tersebut di dalam nampan kuah tersebut. Maka semenjak hari itu, sayapun menyukai sejenis labu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1143
			}
		},
		{
			"hadithnumber": 1144,
			"arabicnumber": 1144,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang di antara kalian menikahi seorang wanita atau membeli budak wanita, hendaklah dia memegang ubun-ubunnya dan berdo'a agar diberkahi oleh Allah Ta'ala. Apabila salah seorang di antara kalian membeli seekor unta, hendaklah dia memegang bagian atas punuknya dan berlindung kepada Allah Ta'ala dari kejahatan setan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1144
			}
		},
		{
			"hadithnumber": 1145,
			"arabicnumber": 1145,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zubair Al Maki] berkata, \"Seorang lelaki melamar seorang wanita melalui saudaranya. Saudara wanita itu memberitahukan bahwa saudara wanitanya dahulu pernah berzina. Hal itu disampaikan kepada [Umar bin Khattab], maka dipukullah saudara laki-laki perempuan itu, atau hampir saja dia dipukul. Kemudian Umar berkata; \"Apa urusanmu memberi kabar itu?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1145
			}
		},
		{
			"hadithnumber": 1146,
			"arabicnumber": 1146,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1146
			}
		},
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"text": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] bahwa [Al Qasim bin Muhammad] dan [Urwah bin Zubair] berkata mengenai seorang laki-laki yang memiliki empat isteri, lalu ia menceraikan salah satu isterinya dengan talak tiga: \"Dia boleh menikah lagi sesuai kehendaknya tanpa harus menunggu 'iddah isterinya selesai.\" Telah menceritakan kepadaku dari Malik dari Rabi'ah bin Abu Abdurrahman bahwa Al Qasim bin Muhammad dan Urwah bin Zubair menfatwakan demikian kepada Al Walid bin Abdul Malik ketika dia datang ke Madinah, hanya saja Al Qasim bin Muhammad mengatakan, \"Talaklah ia dalam beberapa majlis (tidak dengan talak tiga sekaligus)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1147
			}
		},
		{
			"hadithnumber": 1148,
			"arabicnumber": 1148,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] berkata; \"Ada tiga perkara yang tidak ada kata 'main-main' di dalamnya; nikah, talak dan membebaskan hamba sahaya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1148
			}
		},
		{
			"hadithnumber": 1149,
			"arabicnumber": 1149,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Rafi' bin Khudaij] bahwa dia menikahi anak gadis Muhammad bin Maslamah Al Anshari. (gadis itu) tinggal bersamanya sampai tua. Kemudian Rafi' menikah lagi dengan seorang gadis yang masih muda. Ternyata dia lebih mengutamakan sang gadis itu daripada (isterinya yang lama) . Sehingga isterinya yang lama menggugat cerai kepadanya. Lalu Rafi' menceraikannya dengan talak satu, dia berlaku baik dan lembut kepada (isterinya yang lama) hingga menjelang masa iddahnya habis, ia ruju' kembali. Setelah ruju', dia masih memperlakukannya sama seperti semula (lebih mengutamakan isteri mudanya) sehingga (isteri lamanya) menggugat cerai, maka jatuhlah talak dua. Kemudian dia ruju' kembali, namun dia tetap mengulangi tindakannya dengan mengutamakan yang gadis sehingga isteri tuanya menggugat cerai. Rafi' bin Khudaij berkata; \"Sekarang terserah kamu, jatah talak hanya tinggal satu. Jika kamu mau, kamu boleh tetap tinggal dan menerima apa adanya. Jika tidak, saya akan menceraikanmu.\" (wanita itu) berkata; \"Saya akan tetap tinggal walau kamu berlaku demikian.\" Akhirnya Rafi' tidak jadi menceraikan isterinya. Rafi' tidak melihat bahwa hal itu berdosa ketika dia menetapkannya untuk tetap tinggal (isteri lamanya) dengan perlakuan yang demikian",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1149
			}
		}
	]
}