{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"29": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1150,
			"arabicnumber": 1150,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1150
			}
		},
		{
			"hadithnumber": 1151,
			"arabicnumber": 1151,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1151
			}
		},
		{
			"hadithnumber": 1152,
			"arabicnumber": 1152,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Abu Bakar bin Hazm] bahwa [Umar bin Abdul Aziz] berkata kepadanya; \"Apa yang dikatakan orang-orang tentang talaq ba'in?\" Abu bakar menjawab; \" [Aban bin Utsman] menganggapnya sebagai talak satu.\" Umar bin Abdul Aziz pun berkata; \"Kalau seandainya talak dibolehkan sampai seribu kali, niscaya tidak akan tersisa talak bain sedikitpun. Barangsiapa mengatakan talak ba'in, berarti dia telah sampai pada batas akhir",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1152
			}
		},
		{
			"hadithnumber": 1153,
			"arabicnumber": 1153,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] bahwa [Marwan bin Al Hakam] memberi putusan bahwa suami yang menceraikan isterinya dengan talak ba'in, maka itu adalah talak tiga. Malik berkata; \"Ini adalah pendapat yang paling saya sukai",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1153
			}
		},
		{
			"hadithnumber": 1154,
			"arabicnumber": 1154,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1154
			}
		},
		{
			"hadithnumber": 1155,
			"arabicnumber": 1155,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1155
			}
		},
		{
			"hadithnumber": 1156,
			"arabicnumber": 1156,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] mengatakan tentang khaliyyah dan bariyyah, \"Kedua-duanya adalah talak tiga",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1156
			}
		},
		{
			"hadithnumber": 1157,
			"arabicnumber": 1157,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Al Qasim bin Muhammad] berkata, \"Seorang lelaki yang mempunyai isteri dari suatu kaum. Kemudian dia berkata kepada keluarga isteri; \"Tentang dia terserah kalian.\" Maka orang-orang menganggap itu sebagai talak satu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1157
			}
		},
		{
			"hadithnumber": 1158,
			"arabicnumber": 1158,
			"text": "Telah menceritakan kepadaku dari Malik bahwa ia mendengar [Ibnu Syihab] berkata tentang seorang suami yang berkata kepada isterinya; 'Kamu berlepas diri dariku dan saya berlepas diri darimu', ucapan itu kedudukannya sama dengan talak tiga",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1158
			}
		},
		{
			"hadithnumber": 1159,
			"arabicnumber": 1159,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1159
			}
		},
		{
			"hadithnumber": 1160,
			"arabicnumber": 1160,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata; \"Jika seorang suami menyerahkan urusannya kepada isterinya, maka keputusan akhirnya ada di tangan isteri. Kecuali bila suami mengingkarinya (ucapannya) dan berkata; 'Saya tidak menginginkannya kecuali talak satu, ' maka ia wajib bersumpah hingga ia tetap berhak atas diri siterinya selama masih dalam masa iddah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1160
			}
		},
		{
			"hadithnumber": 1161,
			"arabicnumber": 1161,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Sa'id bin Sulaiman bin Zaid bin Tsabit] dari [Kharijah bin Zaid bin Tsabit] bahwa ia mengabarkan kepadanya, bahwa ia pernah duduk-duduk bersama [Zaid bin Tsabit], tiba-tiba Muhammad bin Abu 'Atiq menemuinya dengan kedua mata meneteskan air mata. Zaid lalu bertanya kepadanya; \"Ada apa denganmu?\" Dia menjawab; \"Aku telah menyerahkan keputusan (talak) kepada isteriku, dan ia memutuskan untuk berpisah dariku.\" Zaid bertanya lagi; \"Kenapa kamu lakukan hal itu?\" ia menjawab, \"Karena faktor ekonomi.\" Zaid berkata; \"Jika mau, ruju'lah ia. Karena yang demikian itu hanya talak satu, dan kamu lebih berhak atas dirinya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1161
			}
		},
		{
			"hadithnumber": 1162,
			"arabicnumber": 1162,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] ia berkata, \"Seorang lelaki dari suku Tsaqif menyerahkan keputusan talak kepada isterinya. Isterinya llau berkata; \"Kamu saya ceraikan.\" laki-laki dari Tsaqif itu terdiam. Isterinya berkata lagi, \"Kamu saya ceraikan.\" laki-laki itu berkata; \"Di mulutmu ada batu.\" Kemudian isterinya berkata lagi, \"Kamu saya ceraikan.\" laki-laki itu berkata; \"Di mulutmu ada batu.\" Lalu keduanya mengadu dan meminta Marwan bin Hakam untuk memutuskan perselisihan mereka. [Marwan] kemudian meminta laki-laki tersebut bersumpah bahwa yang dia inginkan hanyalah talak satu. Lalu Marwan menyerahkan wanita tersebut kepada suaminya.\" Malik berkata; Abdurrahman berkata; \"Al Qasim sangat menyukai keputusan itu. Dia memandangnya sebagai keputusan yang paling baik.\" Malik berkata; \"Ini adalah pendapat yang paling baik, dan pandapat yang saya pilih",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1162
			}
		},
		{
			"hadithnumber": 1163,
			"arabicnumber": 1163,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] dari ['Aisyah] Ummul Mukminin, Bahwasanya ia pernah melamar Qaribah binti Umayyah untuk Abdurrahman bin Abu Bakar. Mereka lalu menikahkan 'Abdurrahman (dengan wanita tersebut), tetapi kemudian mereka mencela 'Abdurrahman bin Abu Bakr. Mereka berkata, \"Kami tidak menikahkannya kecuali karena (kedudukan) 'Aisyah.\" 'Aisyah lalu mengirim (utusan) kepada Abdurrahman untuk menceritakan hal tersebut, kemudian Abdurrahman menyerahkan keputusan talaknya pada isterinya. Lantas isterinya memutuskan untuk memilih suaminya, sehingga hal itu tidak dianggap sebagai talak",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1163
			}
		},
		{
			"hadithnumber": 1164,
			"arabicnumber": 1164,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] bahwa ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam menikahkan Hafshah binti Abdurrahman dengan Al Mundzir bin Zubair, padahal Abdurrahman sedang berada di Syam. Ketika Abdurrahman kembali, dengan nada kecewa dia berkata; \"Orang sepertiku memang pantas diperlakukan seperti ini, dan tidak pantas dimintai pertimbangan.\" Aisyah memberitahukan kekecewaan Abdurrahman kepada Mundzir bin Zubair. Mundzir pun balik berkata; \"Hal itu terserah kepada Abdurrahman.\" Abdurrahman berkata; \"Aku tidak mungkin menolak sesuatu yang telah kau putuskan.\" Maka Hafshah pun tetap menjadi isteri Mundzir, dan perkataannya tidak dianggap talak",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1164
			}
		},
		{
			"hadithnumber": 1165,
			"arabicnumber": 1165,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1165
			}
		},
		{
			"hadithnumber": 1166,
			"arabicnumber": 1166,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] ia berkata; \"Apabila seorang suami menyerahkan keputusan cerai kepada isterinya, kemudian sang isteri tidak menghendaki untuk berpisah dan masih tetap tinggal bersama suaminya, maka hal itu tidak dianggap talak",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1166
			}
		},
		{
			"hadithnumber": 1167,
			"arabicnumber": 1167,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ja'far bin Muhammad] dari [Bapaknya] dari [Ali bin Abu Thalib] ia berkata; \"Bila seorang laki-laki bersumpah untuk tidak menyetubuhi isterinya, maka belum dianggap talak walaupun telah berlalu empat bulan lamanya sampai dia diminta untuk mempertegas perkataannya. Baik dia menceraikannya atau tidak.\" Malik berkata; \"Begitulah yang berlaku di antara kami",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1167
			}
		},
		{
			"hadithnumber": 1168,
			"arabicnumber": 1168,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata; \"Seorang laki-laki yang bersumpah untuk tidak menyetubuhi isterinya, jika hal itu telah melampaui batas empat bulan. Maka ia diminta ketegasan dari perkataannyaa; menceraikannya atau ataukah tidak. Dan belum terjadi talak sampai laki-laki tersebut mempertegas perkataannya walaupun telah melewati batas empat bulan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1168
			}
		},
		{
			"hadithnumber": 1169,
			"arabicnumber": 1169,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] bahwa [Sa'id bin Musayyab] dan [Abu Bakar bin Abdurrahman] berkata tentang seorang laki-laki yang bersumpah untuk tidak menyetubuhi isterinya, \"Jika telah melampaui batas empat bulan berarti dia telah menjatuhkan talak satu, dan dia boleh ruju' kepada isterinya selama masih dalam masa iddah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1169
			}
		},
		{
			"hadithnumber": 1170,
			"arabicnumber": 1170,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1170
			}
		},
		{
			"hadithnumber": 1172,
			"arabicnumber": 1172,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dia bertanya kepada [Ibnu Syihab] mengenai ila' hamba sahaya. Ibnu Syihab menjawab; \"Ila' hamba sahaya sama seperti ila' orang merdeka. Hukumnya juga wajib. Masa ila' hamba sahaya batasnya adalah dua bulan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1172
			}
		},
		{
			"hadithnumber": 1173,
			"arabicnumber": 1173,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Sa'id bin 'Amru bin Sulaim Az Zuraqi] bahwasanya ia pernah bertanya kepada [Al Qasim bin Muhammad] tentang seorang laki-laki yang akan menceraikan isterinya jika dia menyetubuhinya. Al Qasim bin Muhammad lalu menjawab; \"Pernah seorang lelaki menganggap isterinya seperti punggung ibunya jika dia menyetubuhinya. Maka [Umar bin Khattab] menyuruhnya untuk tidak mendekatinya, kecuali jika ia membayar denda zhiharnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1173
			}
		},
		{
			"hadithnumber": 1174,
			"arabicnumber": 1174,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1174
			}
		},
		{
			"hadithnumber": 1175,
			"arabicnumber": 1175,
			"text": "Telah menceritakan kepada kami dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] Bahwasanya ia berkata tentang seorang laki-laki yang melakukan zhihar terhadap empat orang isterinya dengan satu kalimat, \"Dia hanya wajib membayar kaffarah satu kali saja.\" Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] seperti di atas",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1175
			}
		},
		{
			"hadithnumber": 1177,
			"arabicnumber": 1177,
			"text": "Telah menceritakan kepada kami dari Malik dari [Hisyam bin Urwah] Bahwasanya ia mendengar seorang laki-laki bertanya kepada [Urwah bin Az Zubair] tentang seorang laki-laki yang berkata kepada isterinya; \"Setiap wanita yang aku nikahi setelah kamu dan kamu masih hidup, maka dia seperti punggung ibuku\". Urwah bin Zubair menjawab; \"Untuk menebus ucapannya itu, ia cukup membebaskan budak",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1177
			}
		},
		{
			"hadithnumber": 1178,
			"arabicnumber": 1178,
			"text": "Telah menceritakan kepadaku Yahya dari Malik Bahwasanya ia pernah bertanya kepada [Ibnu Syihab] tentang zhiharnya hamba sahaya, maka dia menjawab; \"Zhiharnya seperti zhihar orang yang merdeka",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1178
			}
		},
		{
			"hadithnumber": 1179,
			"arabicnumber": 1179,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Rabi'ah bin Abu Abdurrahman] dari [Al Qasim bin Muhammad] dari [Aisyah] Ummul Mukminin, ia berkata; \"Ada tiga pelajaran yang berkenaan dengan Barirah, salah satunya ialah ketika dimerdekakan dia diberi pilihan atas suaminya padahal Rasulullah shallallahu 'alaihi wasallam bersabda: 'Hak perwalian ada pada orang yang memerdekakan'. Suatu kali Rasulullah shallallahu 'alaihi wasallam menemuinya, dan saat itu ada panci dari batu sedang mendidih berisi daging, tetapi beliau hanya dihidangi roti beserta lauk pauknya. Rasulullah shallallahu 'alaihi wasallam bertanya; \"Bukankah panci tadi berisi daging?\" Mereka menjawab; 'Benar wahai Rasulullah, tapi daging itu adalah daging yang disedekahkan kepada Barirah, sedangkan anda tidak boleh memakan sedekah? ' Rasulullah shallallahu 'alaihi wasallam menjawab; \"Bagi Barirah daging itu berstatus sedekah, tapi bagi kita itu adalah hadiah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1179
			}
		},
		{
			"hadithnumber": 1180,
			"arabicnumber": 1180,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata tentang seorang budak wanita yang menjadi isteri seorang budak laki-laki, kemudian wanita itu dimerdekakan, \"Budak wanita tersebut berhak memilih selama belum disetubuhi.\" Malik berkata; \"Jika suaminya telah menyetubuhinya dan ia mengklaim bahwa dirinya tidak mengetahui jika ia mempunyai hak pilih, maka ia disangsikan dan pengakuannya bahwa ia tidak tahu tidak bisa dibenarkan. Dan ia tidak mempunyai hak pilih lagi setelah disetubuhi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1180
			}
		},
		{
			"hadithnumber": 1181,
			"arabicnumber": 1181,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Urwah bin Zubair] bahwa mantan budak wanita Bani 'Adi yang bernama [Zabra'] mengabarkan kepadanya, bahwa ketika ia masih berstatus budak, ia adalah isteri dari seorang budak lelaki. Kemudian ia dimerdekakan (oleh tuannya, pent) . Lalu ia berkata, \"Hafshah isteri Nabi shallallahu 'alaihi wasallam mengutus seseorang agar aku menemuinya, [Hafshah] lalu berkata, 'Aku akan mengabarkan kepadamu sebuah kabar, tapi aku tidak ingin kamu melakukan hal yang buruk. Sesungguhnya sekarang ini putusan ada di tanganmu selama suamimu belum pernah menidurimu. Jika suamimu telah menidurimu, maka kamu tidak memiliki hak lagi.\" Zabra menuturkan; \"Saya pun segera mengatakan; 'Talak, talak dan talak'. Dia telah menjatuhkan talak kepada suaminya tiga kali",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1181
			}
		},
		{
			"hadithnumber": 1182,
			"arabicnumber": 1182,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1182
			}
		},
		{
			"hadithnumber": 1183,
			"arabicnumber": 1183,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] Bahwasanya ia mendengarnya berkata, \"Jika seorang suami memberikan pilihan kepada isterinya, kemudian isterinya memilih untuk tetap bersama suami, maka yang demikian itu tidak dianggap talak.\" Malik berkata; \"Ini adalah sebaik-baik pendapat yang pernah aku dengar",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1183
			}
		},
		{
			"hadithnumber": 1184,
			"arabicnumber": 1184,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari ['Amrah binti Abdurrahman] Bahwasanya ia mengabarkan kepadanya, dari [Habibah binti Sahl Al Anshari] bahwasanya ia adalah isteri Tsabit bin Qais bin Syammas. Suatu kali Rasulullah shallallahu 'alaihi wasallam keluar rumah hendak menunaikan shalat subuh, lalu beliau mendapati Habibah binti Sahl berada di depan pintu rumah beliau, padahal saat itu hari masih gelap. Rasulullah shallallahu 'alaihi wasallam lalu bertanya kepadanya: \"Siapa itu?\" Habibah menjawab; \"Wahai Rasulullah, saya Habibah binti Sahl.\" Beliau bertanya lagi: \"Apa keperluanmu?\" Habibah menjawab; \"Bukan salahku juga bukan salah Tsabit bin Qais.\" -Ketika itu Tsabit bin Qais masih menjadi suaminya- Saat Tsabit bin Qais datang, Rasulullah shallallahu 'alaihi wasallam lantas bertanya kepadanya: \"Ini Habibah binti Sahl telah mengadukan permasalahannya, sesuai kehendak Allah apa yang dia sebutkan.\" Habibah lalu berkata; \"Wahai Rasulullah, semua yang diberikannya kepadaku masih ada padaku.\" Rasulullah shallallahu 'alaihi wasallam kemudian berkata kepada Tsabit bin Qais: \"Ambillah darinya.\" Maka Tsabit bin Qais mengambil darinya, sehingga hari itu Habibah binti Sahl tinggal bersama keluarganya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1184
			}
		},
		{
			"hadithnumber": 1185,
			"arabicnumber": 1185,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari Mantan budak Shafiyyah binti 'Ubaid Bahwasanya ia telah melakukan khulu' atas suaminya dengan semua harta yang ia miliki, dan [Abdullah bin 'Umar] tidak mengingkari hal itu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1185
			}
		},
		{
			"hadithnumber": 1186,
			"arabicnumber": 1186,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] bahwa [Rubai' binti Mu'awwadz bin 'Afra] dan pamannya menemui [Abdullah bin Umar] dan mengabarkan kepadanya bahwa ia pernah minta khulu' cerai kepada suaminya pada masa khalifah Utsman bin 'Affan. Hal? itu sampai kepada [Utsman] dan ia tidak mengingkarinya. Abdullah bin Umar berkata; \"Iddahnya seperti iddah wanita yang ditalak",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1186
			}
		},
		{
			"hadithnumber": 1187,
			"arabicnumber": 1187,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1187
			}
		},
		{
			"hadithnumber": 1188,
			"arabicnumber": 1188,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] bahwa [Sahl bin Sa'id As Sa'idi] mengabarkan kepadanya, bahwa 'Uwaimir Al 'Ajlani menemui 'Ashim bin 'Adi Al Anshari dan berkata; \"Wahai 'Ashim, bagaimana pendapatmu jika ada seorang laki-laki mendapati isterinya berselingkuh dengan lelaki lain. apakah ia boleh membunuhnya sehingga mereka membunuhnya (sebagai qishah) . Atau apa yang harus dilakukannya? Wahai 'Ashim, tolong tanyakan hal ini kepada Rasulullah shallallahu 'alaihi wasallam.\" 'Ashim lalu menanyakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, tapi beliau malah membenci pertanyaan tersebut dan mencelanya sehingga apa yang didengarnya dari Rasulullah shallallahu 'alaihi wasallam membuatnya semakin berat. Ketika 'Ashim pulang kepada isterinya, Uwaimir menemuinya dan bertanya; \"Wahai 'Ashim, apa jawaban Rasulullah shallallahu 'alaihi wasallam kepadamu?\" 'Ashim menjawab; \"Tidak ada yang baik, bahkan beliau malah membenci pertanyaan yang saya lontarkan kepada beliau.\" 'Uwaimir berkata; \"Demi Allah, saya tidak akan puas sampai saya menanyakan sendiri kepada beliau! \" Kemudian Uwaimir segera beranjak menemui Rasulullah shallallahu 'alaihi wasallam yang sedang berada di tengah-tengah kerumunan orang-orang. Ia lalu bertanya; \"Wahai Rasulullah, bagaimana pendapat anda, jika ada seorang suami yang mendapati isterinya berselingkuh dengan lelaki lain. Bolehkah dia membunuhnya, sehingga keluarga iipihak isteri membujuhnya sebagai qishah, atau bagaimana?\" Rasulullah shallallahu 'alaihi wasallam lantas menjawab; \"Telah diturunkan ayat yang berkenaan dengan dirimu dan isterimu. Maka pergi dan bawalah isterimu kemari.\" Sahl berkata; \"Mereka berdua akhirnya saling melaknat, sementara aku bersama orang-orang berada di sisi Rasulullah shallallahu 'alaihi wasallam. Ketika mereka selesai dari mula'anah (saling laknat), Uwaimir pun berkata, \"Wahai Rasulullah, saya telah berbohong atasnya jika saya tetap mempertahankannya.\" Uwaimi lalu menjatuhkan talak tiga kali kepada isterinya sebelum Rasulullah shallallahu 'alaihi wasallam memerintahkannya.\" Malik berkata; Ibnu Syihab berkata, \"Peristiwa itu terjadi setelah turun wahyu tentang bermula'anah (saling laknat bahwa dirinya tidak berzina)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1188
			}
		},
		{
			"hadithnumber": 1189,
			"arabicnumber": 1189,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Pada zaman Rasulullah shallallahu 'alaihi wasallam ada seorang laki-laki melakukan li'an atas isterinya dan meminta anaknya. Rasulullah shallallahu 'alaihi wasallam lalu memisahkan keduanya dan memberikan anaknya kepada sang isteri",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1189
			}
		},
		{
			"hadithnumber": 1190,
			"arabicnumber": 1190,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1190
			}
		},
		{
			"hadithnumber": 1192,
			"arabicnumber": 1192,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Muhammad bin Abdurrahman bin Tsauban] dari [Muhammad bin Iyas bin Bukair] ia berkata; \"Seorang lelaki menjatuhkan talak tiga kepada isterinya sebelum dia menyetubuhinya. Lalu ia berkeinginan untuk menikahinya. Maka dia ingin meminta fatwa, lalu saya menemaninya pergi untuk memintakan fatwa. Lalu ia menanyakannya kepada [Abdullah bin 'Abbas] dan [Abu Hurairah], mereka berdua kemudian menjawab; \"Kami berpendapat bahwa kamu tidak boleh menikahinya lagi hingga mantan isterimu tersebut menikah dengan lelaki lain.\" laki-laki itu pun membantah; \"Talakku kepadanya itu hanya talak sekali saja.\" Dan Ibnu 'Abbas balik menyanggah; \"Kamu telah melepaskan keutamaan yang telah berada di tanganmu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1192
			}
		},
		{
			"hadithnumber": 1193,
			"arabicnumber": 1193,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Bukair bin Abdullah bin Al Asyaj] dari [An-Nu'man bin Abu 'Ayyasy Al Anshari] dari ['Atha bin Yasar] ia berkata, \"Seorang lelaki menemui Abdullah bin 'Amr bin Al 'Ash bertanya tentang seorang lelaki yang menceraikan isterinya tiga kali, padahal dia belum pernah menyetubuhinya.\" 'Atha berkata; \"Lalu aku berkata, \"Hanyasanya talak untuk gadis adalah satu kali.\" [Abdullah bin 'Amru bin Al 'Ash] kemudian berkata kepadaku, \"Kamu ini tukang dongeng! (tidak tahu hukum) Satu kali itu bain, dan tiga kali menjadikannya haram hingga ia menikah dengan laki-laki lain",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1193
			}
		},
		{
			"hadithnumber": 1194,
			"arabicnumber": 1194,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Bukair bin Abdullah bin Al Asyaj] Bahwasanya ia mengabarkan kepadanya, dari [Mua'wiyah bin Abu 'Ayyasy Al Anshari] bahwasanya ia pernah duduk-duduk bersama Abdullah bin Zubair dan 'Ashim bin Umar bin Khattab.\" Mua'wiyah berkata; \"Muhammad bin Iyas bin Al Bukair menghampiri mereka berdua dan bertanya; \"Ada seorang lelaki Badui menceraikan isterinya tiga kali, padahal dia belum pernah menyetubuhinya. Bagaimana pendapat kalian berdua? ' Abdullah bin Zubair pun menjawab; 'Dalam masalah ini, kami belum mempunyai pendapat. Temuilah [Abdullah bin 'Abbas] dan [Abu Hurairah], aku telah meninggalkan mereka berdua di tempat 'Aisyah. Bertanyalah kalian berdua kepada kepada mereka, setelah itu kembalilah dan kabarkan kepada kami! ' Muhammad bin Iyas lalu pergi dan menanyakan hal itu kepada mereka berdua, Ibnu Abbas lalu berkata kepada Abu Hurairah; \"Wahai Abu Hurairah, berilah fatwa kepadanya. Ia telah datang kepadamu dengan membawa suatu persoalan yang rumit.\" Abu Hurairah lantas menjawab; 'Talak sekali bagi isteri yang masih gadis berarti talak ba'in, dan talak tiga kali dapat mengharamkannya untuk dinikahi sampai dia menikah dengan lelaki lain.' Dan Ibnu Abbas juga mengatakan seperti itu.\" Malik berkata; \"Itulah yang kami gunakan dalam pendapat kami",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1194
			}
		},
		{
			"hadithnumber": 1195,
			"arabicnumber": 1195,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Thalhah bin Abdullah bin Auf] ia berkata; -dan dia adalah orang yang paling tahu- dan dari [Abu Salamah bin Abdurrahman bin 'Auf] bahwa [Abdurrahman bin 'Auf] menceraikan isterinya dengan talak tiga, padahal dirinya waktu itu sedang sakit. [Utsman bin Affan] kemudian memberikan hak warisan kepada isterinya setelah masa iddahnya selesai",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1195
			}
		},
		{
			"hadithnumber": 1196,
			"arabicnumber": 1196,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Al Fadll] dari [Al A'raj] bahwa [Utsman bin Affan] menetapkan hak waris kepada mantan isteri-isteri Ibnu Mukmil, Ibnu Mukmil menceraikan mereka pada waktu dia masih sakit",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1196
			}
		},
		{
			"hadithnumber": 1197,
			"arabicnumber": 1197,
			"text": "Telah menceritakan kepadaku dari Malik bahwa ia telah mendengar [Rabi'ah bin Abu Abdurrahman] berkata; telah sampai kepadaku, bahwa isteri [Abdurrahman bin 'Auf] meminta kepada Abdurrahman untuk menceraikannya. Abdurrahman bin 'Auf berkata; \"Jika kamu telah haid lalu suci kembali, maka beritahukanlah kepadaku.\" Namun isterinya tidak kunjung haid hingga 'Abdurrahman bin Auf jatuh sakit. Ketika isterinya telah suci dari haid dan memberitahukan kepadanya, 'Abdurrahman lalu menceraikannya dengan talak ba'in, padahal Abdurrahman bin Auf saat itu masih dalam keadaan sakit. Kemudian [Utsman bin Affan] menetapkan warisan wanita itu setelah selesai masa iddahnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1197
			}
		},
		{
			"hadithnumber": 1198,
			"arabicnumber": 1198,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] ia berkata; \"Kakekku, Habban memiliki dua orang isteri, yang satu dari keturunan bani Hasyim dan yang lain dari kaum Anshar. Dia menceraikan isterinya yang berasal dari Anshar, padahal isterinya sedang menyusui. Setelah setahun berlalu Habban meninggal dunia dan isterinya belum haid sama sekali. Isteri itu berkata; \"Saya berhak mewarisi hartanya karena aku belum pernah haid sejak diceraikannya.\" Kedua isteri itupun berselisih pendapat dan mengadukannya kepada Utsman bin 'Affan. [Utsman bin 'Affan] memutuskan untuk memberikan warisan itu pada wanita Anshar, hingga isteri dari keturunan bani Hasyim mencelanya. Utsman bin 'Affan berkata; \" [Anak pamanmu] juga melakukan hal yang sama, bahkan dia menyarankan kepada kami untuk melakukannya.\" Yang dia maksud ialah 'Ali bin Abu Thalib",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1198
			}
		},
		{
			"hadithnumber": 1199,
			"arabicnumber": 1199,
			"text": "Telah menceritakan kepadaku dari Malik bahwa ia mendengar [Ibnu Syihab] berkata; \"Jika seorang laki-laki menceraikan isterinya tiga kali sedang dia dalam keadaan sakit, maka isterinya berhak mewarisinya.\" Malik berkata; \"Jika suami menceraikannya dalam keadaan sakit, sedang dia belum pernah menyetubuhinya, maka isterinya berhak menerima setengah dari maharnya, juga berhak atas harta warisannya, serta dia tidak perlu menjalani masa iddah. Jika suami pernah menyetubuhinya lalu dia menceraikannya, maka isteri berhak menerima maharnya secara penuh dan berhak mewarisinya. Dalam hal ini, gadis maupun janda hukumnya sama saja",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1199
			}
		},
		{
			"hadithnumber": 1200,
			"arabicnumber": 1200,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1200
			}
		},
		{
			"hadithnumber": 1201,
			"arabicnumber": 1201,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] ia berkata; \"Setiap isteri yang diceraikan berhak menerima mut'ah, kecuali wanita yang maharnya telah ditentukan dan dia belum pernah disetubuhi oleh suaminya, maka dia hanya berhak menerima setengah dari mahar yang telah ditentukan untuknya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1201
			}
		},
		{
			"hadithnumber": 1202,
			"arabicnumber": 1202,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] ia berkata; \"Setiap isteri yang diceraikan, dia berhak menerima mut'ah.\" Malik berkata; \"Telah sampai kepadaku kabar dari Al Qasim bin Muhammad seperti ini.\" Malik berkata; \"Bagi kami mut'ah tidak ada batasan minimal dan maksimalnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1202
			}
		},
		{
			"hadithnumber": 1204,
			"arabicnumber": 1204,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zinad] dari [Sulaiman bin Yasar] berkata, \"Nufai' adalah seorang mukatab atau budak milik Ummu Salamah, isteri Nabi shallallahu 'alaihi wasallam. Nufai' memiliki seorang isteri orang merdeka, ia telah mentalaknya dua kali dan ingin meruju'nya kembali. Maka para isteri Nabi shallallahu 'alaihi wasallam pun menganjurkannya untuk menemui Utsman bin 'Affan guna menanyakan hal itu kepadanya. Nufai' lantas menemui [Utsman] yang saat itu sedang berada di Darj (nama tempat), menggandeng tangan [Zaid bin Tsabit] . Ia lalu bertanya kepada mereka berdua, keduanya kemudian menjawab; \"Dia haram bagimu, dia haram bagimu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1204
			}
		},
		{
			"hadithnumber": 1205,
			"arabicnumber": 1205,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] berkata, \"Nufai' adalah seorang mukatab milik Ummu Salamah, isteri Nabi shallallahu 'alaihi wasallam. Ia mentalak isterinya dua kali, seorang wanita merdeka. Kemudian ia minta fatwa kepada Utsman bin Affan, lalu [Utsman] menjawab, \"Dia haram bagimu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1205
			}
		},
		{
			"hadithnumber": 1206,
			"arabicnumber": 1206,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdu Rabbih bin Sa'id] dari [Muhammad bin Ibrahim bin Al Harits At-Taimi] berkata, \"Nufai' adalah seorang mukatab milik Ummu Salamah, isteri Nabi shallallahu 'alaihi wasallam. Dia minta fatwa kepada Zaid bin Tsabit seraya berkata; \"Isteriku seorang wanita merdeka, aku telah mencerainya dua kali?\" [Zaid bin Tsabit] lalu berkata; \"Dia haram bagimu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1206
			}
		},
		{
			"hadithnumber": 1207,
			"arabicnumber": 1207,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata; \"Jika seorang budak menceraikan isterinya sebanyak dua kali, maka isterinya menjadi haram baginya hingga ia dinikahi oleh laki-laki lain, baik isterinya seorang budak atau wanita yang merdeka. Dan masa iddah wanita merdeka adalah tiga kali haid sedangkan masa iddah budak wanita adalah dua kali haid",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1207
			}
		},
		{
			"hadithnumber": 1208,
			"arabicnumber": 1208,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata; \"Barangsiapa mengizinkan budaknya untuk menikah, maka keputusan talak juga ada padanya dan tidak ada orang lain yang berhak memutuskan talak atasnya. Jika seorang lelaki mengambil budak wanita milik anak lelakinya atau milik anak perempuannya, maka hal itu tidak ada dosa baginya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1208
			}
		},
		{
			"hadithnumber": 1209,
			"arabicnumber": 1209,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] bahwa [Umar bin Khattab] berkata; \"Seorang wanita yang kehilangan suaminya dan tidak mengetahui keberadaannya, maka hendaklah dia menunggunya selama empat tahun. Kemudian menjalani masa iddah selama empat bulan sepuluh hari dan setelah itu boleh menikah lagi.\" Malik berkata; \"Jika dia menikah setelah masa iddah selesai, kemudian suaminya (kedua) telah menggaulinya atau belum menggaulinya, maka suami pertama tidak berhak lagi atasnya.\" Malik melanjutkan, \"Inilah yang berlaku di kalangan kami selama ini. Namun jika suaminya datang sementara dia belum menikah lagi, maka suaminya lebih berhak atas dirinya.\" Malik kembali melanjutkan, \"Saya mendapati sekelompok orang mengingkari pendapat yang dilontarkan sebagian kelompok terhadap Umar bin Khattab, ketika ia mengatakan 'Diberikan pilihan bagi suaminya yang pertama, untuk mengambil maharnya atau kembali pada isterinya'.\" Malik berkata; \"Telah sampai pula kepadaku pendapat Umar bin Khattab mengenai seorang wanita yang diceraikan suaminya yang sedang pergi, lalu dia ruju' lagi kepadanya. Namun ruju'nya tersebut tidak sampai pada pihak isteri, dan hanya kabar talaknya sampai kepada isterinya, kemudian isteri menikah lagi dengan lelaki lain. Jika suami yang kedua telah menggaulinya atau belum menggaulinya, maka suami yang pertama yang telah mentalaknya, tidak ada lagi hak atasnya.\" Malik berkata; \"Pendapat ini adalah pendapat yang aku pandang paling baik dalam hal ini dan dalam hal suami yang hilang",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1209
			}
		},
		{
			"hadithnumber": 1210,
			"arabicnumber": 1210,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1210
			}
		},
		{
			"hadithnumber": 1211,
			"arabicnumber": 1211,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] bahwa Abdullah bin Umar menceraikan isterinya dalam keadaan haid pada masa Rasulullah shallallahu 'alaihi wasallam. Umar bin Khattab menanyakan Rasulullah shallallahu 'alaihi wasallam mengenai hal itu. Beliau menjawab; \"Suruhlah dia ruju' kembali kepada isterinya dan hendaklah dia menahannya sehingga ia suci, kemudian haid, dan suci lagi. kemudian jika mau ia boleh menahannya, dan jika mau ia boleh menceraikannya sebelum ia mensetubuhinya kembali. Begitulah aturan iddah yang ditetapkan oleh Allah dalam menceraikan kaum wanita",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1211
			}
		},
		{
			"hadithnumber": 1212,
			"arabicnumber": 1212,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Urwah bin Zubair] dari ['Aisyah] Ummul Mukminin, bahwa dia menyuruh Hafshah binti Abdurrahman bin Abu Bakar Ash Shiddiq pindah tempat tinggal ketika memasuki masa haid yang ketiga. Ibnu Syihab berkata; \"Hal itu lalu diadukan kepada 'Amrah binti Abdurrahman. [Amrah] berkata, \"Urwah benar.\" Waktu itu banyak orang yang mendebatnya. [Mereka mengatakan], \"Sungguh Allah Ta'ala telah berfirman dalam kitab-Nya: \"Tiga kali quru' (Qs. Al Baqarah: 228) 'Aisyah lalu menjawab; \"Kalian benar, dan tahukah kalian apa itu quru`? Quru` adalah suci.\" Telah menceritakan kepadaku dari Malik dari Ibnu Syihab berkata; Aku mendengar [Abu Bakar bin Abdurrahman] berkata; \"Aku tidak mendapati seorang ahli fikih pun dari kalangan kita kecuali dia sependapat dengan hal itu.\" maksudnya pendapat 'Aisyah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1212
			}
		},
		{
			"hadithnumber": 1213,
			"arabicnumber": 1213,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1213
			}
		},
		{
			"hadithnumber": 1214,
			"arabicnumber": 1214,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dan [Zaid bin Aslam] dari [Sulaiman bin Yasar] berkata, \"Al Ahwash meninggal dunia di Syam, sementara isterinya telah memasuki masa haid yang ketiga dari masa iddahnya, karena ia telah menceraikannya.\" Mu'awiyah bin Abu Sufyan lantas mengirim surat kepada Zaid bin Tsabit menanyakan tentang hal itu, [Zaid bin Tsabit] kemudian membalas dan mengatakan bahwa bila wanita tersebut telah memasuki haid yang ketiga dari masa iddah, berarti dia telah bercerai dari suaminya dan suaminya pun telah bercerai darinya, dia tidak mewarisi harta suaminya, dan suaminya tidak mewarisi hartanya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1214
			}
		},
		{
			"hadithnumber": 1215,
			"arabicnumber": 1215,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1215
			}
		},
		{
			"hadithnumber": 1216,
			"arabicnumber": 1216,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata; \"Bila seorang suami menceraikan isterinya, lalu isterinya telah memasuki masa haid yang ketiga, berarti keduanya telah bercerai.\" Malik berkata; \"Beginilah yang berlaku di kalangan kami",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1216
			}
		},
		{
			"hadithnumber": 1217,
			"arabicnumber": 1217,
			"text": "Telah menceritakan kepadaku dari Malik dari [Al Fudlail bin Abu Abdullah] budak Al Mahri, bahwa [Al Qasim bin Muhammad] dan [Salim bin Abdullah] berkata; \"Jika seorang isteri diceraikan kemudian dia memasuki masa haid yang ketiga, maka dia telah bercerai dari suaminya dan halal untuk menikah lagi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1217
			}
		},
		{
			"hadithnumber": 1218,
			"arabicnumber": 1218,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1218
			}
		},
		{
			"hadithnumber": 1219,
			"arabicnumber": 1219,
			"text": "Telah menceritakan kepadaku dengan Malik telah mendengar [Ibnu Syihab] berkata; \"Iddahnya wanita yang diceraikan adalah beberapa quru', walaupun jaraknya berjauhan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1219
			}
		},
		{
			"hadithnumber": 1220,
			"arabicnumber": 1220,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari seorang laki-laki Anshar, bahwa isterinya pernah meminta talak kepadanya, lalu ia berkata kepadanya, \"Jika kamu datang bulan (haid), beritahukanlah kepadaku! \" Ketika datang haid wanita itu pun memberitahukan kepadanya. Suaminya berkata, \"Jika kamu telah suci, beritahukanlah kepadaku! \" Ketika telah suci wanita itu kembali memberitahukan kepada suaminya. Setelah itu suaminya pun menceraikannya.\" Malik berkata; \"Ini adalah pendapat yang paling baik yang aku dengar",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1220
			}
		},
		{
			"hadithnumber": 1221,
			"arabicnumber": 1221,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Al Qasim bin Muhammad] dan [Sulaiman bin Yasar] bahwasanya ia mendengar keduanya menyebutkan bahwa Yahya bin Sa'id bin 'Ash menceraikan puteri Abdurrahman bin Hakam dengan talak ba'in, lalu Abdurrahman bin Hakam menyuruh puterinya untuk pindah rumah.\" ['Aisyah], Ummul Mukminin lalu mengirim utusan kepada Marwan bin Al Hakam yang ketika itu menjabat sebagai gubernur Madinah, ia mengatakan, \"Bertakwalah kepada Allah dan kembalikan wanita itu ke rumahnya.\" Dalam hadits Sulaiman, Marwan menjawab, \"Abdurrahman telah mengalahkanku (tidak taat) .\" Atau dalam hadits Al Qasim Marwan memberi jawaban, \"Tidakkah kamu telah mendengar peristiwa yang terjadi pada Fatimah binti Qais?\" 'Aisyah menjawab; \"Tidak penting engkau sebutkan hadits Fatimah.\" Marwan berkata; \"Jika pada pendapatmu ada keburukkan, maka cukuplah bagimu pada dua permasalah itu saja",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1221
			}
		},
		{
			"hadithnumber": 1222,
			"arabicnumber": 1222,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] berkata, \"Anak perempuan Sa'id bin Zaid bin 'Amru bin Nufail adalah isteri Abdullah bin 'Amru bin Utsman bin Affan, lalu ia menjatuhkan talak bain kepada isterinya. Isterinya kemudian pindah, namun [Abdullah bin Umar] mengingkari hal itu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1222
			}
		},
		{
			"hadithnumber": 1223,
			"arabicnumber": 1223,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] mencerai salah satu isterinya di kediaman Hafshah, isteri Nabi shallallahu 'alaihi wasallam, padahal di situ adalah jalan yang biasa dilewatinya menuju masjid. Setelah itu dia menempuh jalan lain di belakang perumahan karena dia tidak mau harus selalu izin kepadanya (Hafshah) hingga ia meruju'nya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1223
			}
		},
		{
			"hadithnumber": 1224,
			"arabicnumber": 1224,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa [Sa'id Ibnul Musayyab] ditanya mengenai seorang isteri yang diceraikan suaminya, padahal dia sedang tinggal di sebuah rumah kontrakan. Maka siapa yang harus membayar sewa kontrakannya? Sa'id Ibnul Musayyab lalu menjawab; \"Suaminya.\" Orangyang bertanya itu kembali berkata, \"Bagaimana jika suaminya tidak mampu?\" Sa'id Ibnul Musayyab menjawab, \"Kalau begitu isterinya.\" Orang yang bertanya itu berkata lagi, \"Bagaimana jika isterinya juga tidak mampu?\" Sa'id Ibnul Musayyab menjawab, \"Maka pemimpinnya yang harus membayarnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1224
			}
		},
		{
			"hadithnumber": 1225,
			"arabicnumber": 1225,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdullah bin Yazid] mantan budak Al Aswad bin Sufyan, dari [Abu Salamah bin Abdurrahman bin Auf] dari [Fatimah binti Qais] bahwa Abu 'Amru bin Hafsh menjatuhkan talak ba'in kepadanya, padahal dia sedang berada di Syam. Lalu Abu Amru mengutus wakilnya untuk mengirimkan gandum kepadanya, hingga menjadikan Fatimah marah kepada. Abu Amru berkata, \"Demi Allah, kamu tidak berhak atas apapun dariku.\" Fatimah bin Qais lantas mendatangi Rasulullah shallallahu 'alaihi wasallam dan mengkisahkan kejadian itu kepada beliau. Beliau lalu bersabda: \"Kamu tidak berhak mendapatkan nafkah darinya.\" Kemudian beliau menyuruhnya untuk menunggu masa iddahnya di rumah Ummu Syarik. setelah itu beliau bersabda: \"Dia adalah wanita yang sering dikunjungi oleh para sahabatku. Maka tunggulah masa iddahmu di rumah Abdullah bin Ummi Maktum, dia adalah seorang yang buta, sehingga kamu dapat meletakkan pakaianmu di sisinya. Jika masa iddahmu telah selesai maka beritahukanlah kepadaku.\" Fatimah berkata, \"Ketika masa iddahku telah selesai, aku ceritakan kepada beliau bahwa Mu'awiyah bin Abu Sufyan dan Abu Jahm bin Hisyam telah melamarku. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Jahm itu seorang laki-laki yang tidak pernah meletakkan tongkat dari pundaknya, sedangkan Mu'awiyah adalah seorang laki-laki miskin yang tidak mempunyai harta. Nikahlah dengan Usamah bin Zaid.\" Fatimah berkata, \"Sebenarnya aku tidak menyukainya.\" Kemudian beliau berkata lagi: \"Nikahlah dengan Usaman bin Zaid.\" Maka aku pun menikah dengannya, dan ternyata Allah menjadikan kebaikan di dalam pernikahan itu, hingga aku merasa bahagia",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1225
			}
		},
		{
			"hadithnumber": 1226,
			"arabicnumber": 1226,
			"text": "Telah menceritakan kepadaku dari Malik bahwa ia pernah mendengar [Ibnu Syihab] berkata; \"Wanita yang dicerai dengan talak ba'in tidak boleh keluar rumah sampai masa iddahnya selesai. Dia tidak mendapatkan nafkah dari mantan suaminya kecuali apabila dia sedang hamil. Jika ia dalam keadaan hamil, maka mantan suami wajib menafkahinya sampai dia melahirkan.\" Malik berkata; \"Pendapat itulah yang dipakai pada kami",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1226
			}
		},
		{
			"hadithnumber": 1227,
			"arabicnumber": 1227,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dan dari [Yazid bin Abdullah bin Qusaith Al Laitsi] dari [Sa'id Ibnul Musayyab] ia berkata, [Umar Ibnul Khattab] berkata; \"Wanita mana saja yang dicerai kemudian dia mengalami sekali atau dua kali haid dan setelah itu dia monopause (tidak lagi haid), maka hendaklah dia menunggu sampai sembilan bulan. Jika dia dalam keadaan hamil maka ia menjadi halal setelah melahirkan, tetapi jika tidak hamil maka ia harus menjalani masa iddah lagi selama tiga bulan. Setelah itu dia boleh menikah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1227
			}
		},
		{
			"hadithnumber": 1228,
			"arabicnumber": 1228,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] ia berkata; \"Talak adalah hak laki-laki dan 'iddah adalah hak wanita",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1228
			}
		},
		{
			"hadithnumber": 1229,
			"arabicnumber": 1229,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1229
			}
		},
		{
			"hadithnumber": 1230,
			"arabicnumber": 1230,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1230
			}
		},
		{
			"hadithnumber": 1231,
			"arabicnumber": 1231,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1231
			}
		},
		{
			"hadithnumber": 1232,
			"arabicnumber": 1232,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1232
			}
		},
		{
			"hadithnumber": 1233,
			"arabicnumber": 1233,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Sa'id Ibnul Musayyab] berkata; \"Barangsiapa menikahi seorang wanita kemudian dia tidak bisa menyetubuhinya, maka dia diberi tenggang waktu satu tahun. Jika dia mampu menyetubuhinya (maka pernikahannya diteruskan), jika tidak mampu maka keduanya dipisahkan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1233
			}
		},
		{
			"hadithnumber": 1234,
			"arabicnumber": 1234,
			"text": "Telah menceritakan kepadaku Malik dia bertanya kepada [Ibnu Syihab], \"Semenjak kapan masa tenggang suami dihitung, sejak hari pertama tinggal satu rumah dengannya? Atau sejak hari ia diajukan kepada penguasa?\" Ibnu Syihab menjawab; \"Sejak diajukan kepada penguasa.\" Malik berkata; \"Adapun suami yang tadinya mampu menyetubuhi isterinya kemudian terhalangi (tidak mampu), maka dalam hal ini aku belum pernah mendengar pendapat yang menyatakan bahwa laki-laki tersebut diberi waktu tenggang, atau dipisahkan dari isterinya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1234
			}
		},
		{
			"hadithnumber": 1235,
			"arabicnumber": 1235,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] berkata, \" Telah sampai kabar kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada seorang lelaki dari suku Tsaqif yang masuk Islam sedangkan saat itu dia mempunyai sepuluh orang isteri: \"Pilihlah empat orang dari isteri-isterimu, dan ceraikanlah sisanya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1235
			}
		},
		{
			"hadithnumber": 1236,
			"arabicnumber": 1236,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] ia berkata; Aku mendengar [Sa'id Ibnul Musayyab] dan [Humaid bin Abdurrahman bin Auf] dan ['Ubaidullah bin Abdullah bin 'Utbah bin Mas'ud] dan [Sulaiman bin Yasar] semuanya berkata; aku mendengar [Abu Hurairah] berkata; Aku mendengar [Umar Ibnul Khattab] berkata; \"Wanita mana saja yang diceraikan suaminya dengan talak satu atau dua, kemudian ia dibiarkan hingga masa iddahnya habis, lalu ia menikah lagi dengan lelaki lain. Kemudian suaminya (yang kedua) meninggal dunia atau mencerikannya, kemudian ia dinikahi lagi oleh suaminya yang pertama, maka ia tetap melanjutkan sisa talak yang pernah dijatuhkan oleh suaminya yang pertama.\" Malik berkata; \"Beginilah sunnah yang berlaku di antara kami, dan tidak ada perselisihan di dalamnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1236
			}
		},
		{
			"hadithnumber": 1237,
			"arabicnumber": 1237,
			"text": "Telah menceritakan kepadaku dari Malik dari [Tsabit bin Al Ahnaf] bahwa dia menikahi ummu walad milik Abdurrahman bin Zaid bin Khattab. Tsabit berkata, \"Abdullah bin Abdurrahman bin Zaid bin Khattab memanggilku, lalu aku datang dan masuk menemuinya. Dan ternyata di dalam telah ada cambuk tergeletak, dua rantai besi dan dua budak miliknya yang didudukkan. Abdullah bin 'Abdurrahman lalu berkata, \"Ceraikanlah isterimu, jika tidak maka demi Dzat yang nama-Nya digunakan untuk bersumpah, aku akan memperlakukanmu begini dan begini.\" Aku lantas berkata, \"Dia aku ceraikan seribu kali! \" kemudian aku keluar dari kediamannya, dan di jalanan Makkah aku bertemu dengan [Abdullah bin Umar] . Kemudian aku ceritakan kepadanya peristiwa yang baru aku alami. Maka Abdullah bin Umar pun marah dan berkata, 'Itu bukanlah talak, dan dia masih halal bagimu. Maka pulanglah kepada isterimu'.\" Tsabit bin Al Ahnaf berkata; \"Namun hatiku belum tenang, maka aku pun menemui Abdullah bin Zubair, yang ketika itu menjadi gubernur Makkah. Aku lalu menceritakan peritiwa yang terjadi padaku serta respon Abdullah bin Umar akan hal itu. [Abdullah bin Zubair] lalu berkata; \"Dia masih halal bagimu. Kembalilah kepada isterimu.\" Kemudian ia menulis surat kepada Jabir bin Aswad Az Zuhri yang ketika itu menjabat sebagai gubernur Madinah, ia meminta kepadanya agar menghukum Abdullah bin Abdurrahman dan membiarkan aku kembali kepada isteriku.\" Setelahitu aku kembali ke Madinah, lalu Shafiyyah, isteri Abdullah bin Umar, menyiapkan isteriku untuk diserahkan kepadaku atas sepengetahuan Abdullah bin Umar. Lalu aku mengundang Abdullah bin Umar pada hari pernikahanku, dan ia pun datang",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1237
			}
		},
		{
			"hadithnumber": 1238,
			"arabicnumber": 1238,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Dinar] berkata, aku mendengar [Abdullah bin Umar] membaca ayat: '(Hai nabi, apabila kamu menceraikan Isteri-isterimu, maka hendaklah kamu ceraikan mereka\" (Qs. Ath Thalaq: 1) pada permulaan masa iddah mereka.\" Malik berkata; \"Maksudnya hendaklah menceraikan satu kali pada setiap dalam keadaan suci",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1238
			}
		},
		{
			"hadithnumber": 1239,
			"arabicnumber": 1239,
			"text": "Telah menceritakan kepada kami dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] berkata; \"Jika seorang laki-laki menceraikan isterinya, dia berhak ruju' lagi kepadanya selagi masa iddahnya belum habis, meski dia menceraikannya sampai seribu kali. Seorang laki-laki sengaja menceraikan isterinya, hingga ketika masa iddahnya akan selesai ia kembali meruju'nya, lalu kembali menceraikannya. Setelah itu ia berkata, \"Tidak, demi Allah, aku tidak akan menggaulimu dan kamu selamanya tidak akan menjadi halal (tidak pernah habis masa iddahnya karena selalu diruju') .\" Kemudian Allah Tabaraka Wa Ta'ala menurunkan ayat: '(Talak (yang dapat dirujuki) dua kali. Setelah itu, boleh ruju' lagi dengan cara yang ma'ruf atau menceraikan dengan cara yang baik) ' (Qs. Al Baqarah: 231) Semenjak turunnya ayat ini, orang-orang menghitung talak dari awal lagi, baik yang sudah pernah mentalak ataupun yang belum pernah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1239
			}
		},
		{
			"hadithnumber": 1240,
			"arabicnumber": 1240,
			"text": "Telah menceritakan kepadaku dari Malik dari [Tsaur bin Zaid Ad Dili] berkata, \"Seorang lelaki menceraikan isterinya kemudian meruju'nya lagi padahal ia sudah tidak membutuhkannya dan tidak ingin menjadikannya isteri lagi. Ia hanya ingin memperpanjang masa iddahnya sehingga isteri merasakan penderitaan. Kemudian Allah Tabaraka Wa Ta'ala menurunkan ayat: '(Janganlah kamu rujuki mereka untuk memberi kemudharatan, Karena dengan demikian kamu menganiaya mereka) ' (Qs. Al Baqarah: 231) Allah menasehatkan demikian kepada mereka",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1240
			}
		},
		{
			"hadithnumber": 1241,
			"arabicnumber": 1241,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1241
			}
		},
		{
			"hadithnumber": 1242,
			"arabicnumber": 1242,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1242
			}
		},
		{
			"hadithnumber": 1243,
			"arabicnumber": 1243,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdu Rabbih bin Sa'id bin Qais] dari [Abu Salamah bin Abdurrahman] ia berkata; \" [Ibnu Abbas] dan [Abu Hurairah] ditanya tentang seorang wanita hamil yang ditinggal mati oleh suaminya. Ibnu Abbas menjawab, \"Iddahnya adalah yang paling lama waktunya di antara dua masa iddah.\" Dan Abu Hurairah menjawab, \"Jika ia telah melahirkan bayinya, berarti masa iddahnya telah habis.\" Abu Salamah kemudian menemui Ummu Salamah, isteri Nabi shallallahu 'alaihi wasallam dan menanyakan hal tersebut kepadanya. [Ummu Salamah] lalu menjawab; \"Subai'ah Al Aslamiyah telah melahirkan anaknya setengah bulan setelah ditinggal mati suaminya, lalu ada dua orang lelaki melamarnya, yang satu masih muda dan yang satu sudah tua. Lalu Subai'ah cenderung telah kepada laki-laki yang umurnya lebih muda, maka laki-laki yang umurnya lebih tua berkata, \"Masa iddahmu belum selesai.\" (ia mengatakan begitu karena) Keluarga Shubai'ah sedang pergi, sehingga ketika mereka telah datang, mereka akan mengutamakan dirinya (atas laki-laki yang lebih muda) . Subai'ah kemudian menemui Rasulullah shallallahu 'alaihi wasallam, beliau pun bersabda: 'Masa iddahmu sudah lewat, nikahlah dengan siapa yang kamu mau",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1243
			}
		},
		{
			"hadithnumber": 1244,
			"arabicnumber": 1244,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] Bahwasanya ia pernah ditanya tentang seorang wanita yang ditinggal mati suaminya, padahal ia sedang hamil. Abdullah bin Umar lalu menjawab; \"Bila dia telah melahirkan bayinya, berarti masa iddahnya telah berakhir.\" Lalu [seorang lelaki Anshar] yang sedang bersamanya mengabarkan kepadanya, bahwa [Umar bin Khattab] pernah berkata; \"Seandainya ia telah melahirkan sementara jasad suaminya masih terbaring di atas tempat tidur dan belum dikuburkan, maka ia telah menjadi halal",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1244
			}
		},
		{
			"hadithnumber": 1245,
			"arabicnumber": 1245,
			"text": "Telah menceritakan kepada kami dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] dari [Al Miswar bin Makhramah] ia mengabarkan bahwa Subai'ah Al Aslamiyah masih mengeluarkan darah nifas setelah beberapa hari meninggalnya sang suami. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Masa iddahmu telah usai, kamu boleh menikah dengan lelaki yang kamu mau",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1245
			}
		},
		{
			"hadithnumber": 1246,
			"arabicnumber": 1246,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sulaiman bin Yasar] bahwa [Abdullah bin Abbas] dan [Abu Salamah bin Abdurrahman bin 'Auf] pernah berselisih pendapat mengenai iddahnya seorang wanita yang melahirkan setelah beberapa hari ditinggal mati suaminya. Abu Salamah berpandangan; \"Jika dia telah melahirkan bayinya, berarti dia sudah boleh menikah lagi dengan lelaki lain.\" Sedangkan Ibnu Abbas berpendapat; \"Iddahnya adalah (iddah) yang paling lama masa waktunya.\" [Abu Hurairah] datang lalu berkata; \"Aku sependapat dengan anak saudaraku, Abu Salamah.\" Kemudian mereka mengutus Kuraib, mantan budak Abdullah bin Abbas untuk menemui Ummu Salamah, isteri Nabi shallallahu 'alaihi wasallam, untuk menanyakan hal tersebut. [Kuraib] kemudian datang kepada mereka, mengabarkan bahwa [Ummu Salamah] berkata, \"Subai'ah Al Aslamiyah pernah melahirkan anaknya setelah beberapa hari ditinggal mati suaminya, kemudian hal itu ditanyakan kepada Rasulullah shallallahu 'alaihi wasallam, beliau lalu bersabda kepadanya; 'Masa iddahmu telah usai, nikahlah dengan siapa saja yang kau mau.\" Malik berkata; \"Menurut kami pendapat inilah yang masih dijadikan pegangan oleh ahli ilmu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1246
			}
		},
		{
			"hadithnumber": 1247,
			"arabicnumber": 1247,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Sa'ad bin Ishaq bin Ka'b bin 'Ujrah] dari bibinya [Zainab binti Ka'b bin 'Ujrah] bahwa [Furai'ah binti Malik bin Sinan] -yaitu saudara perempuan Abu Sa'id Al Khudri- mengabarkan kepadanya, bahwa ia pernah menemui Rasulullah shallallahu 'alaihi wasallam meminta izin agar ia dibolehkan pulang ke rumah keluarganya di Bani Khudrah. Sebab ketika suaminya pergi mencari budak-budaknya yang melarikan, sampai di perbatasan dan menemukan mereka, justru mereka beramai-ramai membunuhnya.\" Furai'ah binti Malik berkata; \"Aku minta izin Rasulullah shallallahu 'alaihi wasallam pulang ke rumah keluargaku di bani Khudrah, karena suamiku tidak meninggalkanku di rumah miliknya dan tidak memberi nafkah.\" Rasulullah shallallahu 'alaihi wasallam kemudian mengatakan: \"Ya.\" aku kemudian kembali, dan ketika aku sedang berada di kamar Rasulullah shallallahu 'alaihi wasallam memanggilku atau mengutus seseorang untuk memanggilku. Beliau lalu bertanya: \"Apa yang kamu katakan tadi? ' aku lalu mengulang kisah tentang suamiku tadi, lantas beliau bersabda: 'Berdiamlah di rumahmu sampai masa yang diwajibkan atasmu selesai'.\" Furai'ah binti Malik berkata; \"Aku menjalani masa iddah selama empat bulan sepuluh hari.\" Maka saat pemerintahan Utsman bin Affan, ia mengutus seseorang menemuiku untuk menanyakan hal tersebut, lalu aku kabarkan kepadanya, sehingga Utsman pun mengikutinya dan memutuskan seperti ini",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1247
			}
		},
		{
			"hadithnumber": 1248,
			"arabicnumber": 1248,
			"text": "Telah menceritakan kepadaku dari Malik dari [Humaid bin Qais Al Maki] dari ['Amru bin Syu'aib] dari [Sa'id Ibnul Musayyab] bahwa [Umar Ibnul Khattab] pernah menyuruh pulang para wanita dari Baida yang ditinggal mati suami mereka, dia melarang mereka melaksanakan haji",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1248
			}
		},
		{
			"hadithnumber": 1249,
			"arabicnumber": 1249,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] telah sampai kabar kepadanya bahwa As Sa`ib bin Khabbab wafat. Kemudian isterinya menemui [Abdullah bin Umar] dan mengabarkan kepadanya bahwa suaminya telah wafat, dan ia juga menceritakan bahwa keluarganya mempunyai kebun di sebuah lahan. Kemudian ia berkata, \"Apakah dia boleh bermalam di lahan tersebut?\" Ibnu Umar pun melarangnya. Akhirnya wanita tersebut berangkat dari Madinah menuju ladang miliknya di waktu sahur, dan sepanjang siang ia berada di sana, lalu kembali lagi ke Madinah di sore hari sehingga ia bisa bermalam di rumahnya sendiri",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1249
			}
		},
		{
			"hadithnumber": 1250,
			"arabicnumber": 1250,
			"text": "Telah menceritakan kepada kami dari Malik dari [Hisyam bin Urwah] Bahwasanya ia berkata tentang seorang wanita Badui yang ditinggal mati suaminya, \"Ia boleh berpindah-pindah mengikuti keluarganya.\" Malik berkata; \"Itulah pendapat yang kami pakai",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1250
			}
		},
		{
			"hadithnumber": 1251,
			"arabicnumber": 1251,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] ia berkata; \"Wanita yang ditinggal mati suaminya dan wanita yang dicerai dengan talak bain, ia tidak boleh menginap kecuali di rumah miliknya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1251
			}
		},
		{
			"hadithnumber": 1252,
			"arabicnumber": 1252,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] ia berkata; Aku mendengar [Al Qasim bin Muhammad] berkata; \"Suatu ketika Yazid bin Abdul Malik memisahkan para suami dari isteri-isteri mereka. Para wanita itu adalah para ibu dari anak-anak yang ditinggal mati bapaknya, lalu mereka menikahinya wanita-wanita itu ketika baru berlalu satu atau dua kali haid. Kemudian Yazid memisahkan mereka sampai para wanita itu menjalani masa 'iddah selama empat bulan sepuluh hari.\" Al Qasim bin Muhammad berkata; \"SUBHANALLAH, Allah berfirman dalam kitab-Nya: \"Orang-orang yang meninggal dunia di antaramu dengan meninggalkan isteri-isteri (hendaklah para isteri itu) ...\" (Qs. Al Baqarah: 234) padahal mereka itu tidak mempunyai suami sebelumnya?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1252
			}
		},
		{
			"hadithnumber": 1253,
			"arabicnumber": 1253,
			"text": "Telah menceritakan kepadaku Malik dari [Nafi'] dari [Abdullah bin Umar] ia berkata; \"Iddah ummul walad jika ditinggal mati oleh majikannya ialah satu kali haid",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1253
			}
		},
		{
			"hadithnumber": 1254,
			"arabicnumber": 1254,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Al Qasim bin Muhammad] ia berkata; \"Iddahnya ummul walad jika ditinggal mati oleh majikannya ialah satu kali haid.\" Malik berkata; \"Begitulah pendapat kami.\" Malik menambahkan, \"Jika dia tidak lagi haid (monopause), maka iddahnya ialah tiga bulan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1254
			}
		},
		{
			"hadithnumber": 1255,
			"arabicnumber": 1255,
			"text": "Telah menceritakan kepadaku Yahya dari Malik telah sampai kepadanya bahwa [Sa'id Ibnul Musayyab] dan [Sulaiman bin Yasar] berkata, \"Masa iddah budak wanita yang ditinggal mati suaminya ialah dua bulan ditambah lima hari.\" Telah menceritakan kepadaku dari Malik dari Ibnu Syihab seperti hadits tersebut",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1255
			}
		},
		{
			"hadithnumber": 1256,
			"arabicnumber": 1256,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1256
			}
		},
		{
			"hadithnumber": 1257,
			"arabicnumber": 1257,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Rabi'ah bin Abu Abdurrahman] dari [Muhammad bin Yahya bin Habban] dari [Ibnu Muhairiz] ia berkata; \"Suatu hari aku memasuki masjid dan melihat Abu Sa'id Al Khudri. Aku lalu duduk bersamanya dan bertanya tentang 'azl. [Abu Sa'id Al Khudri] lalu menjawab; 'Kami pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam pada saat perang Bani Musthaliq. Lalu kami mendapat tawanan (anak-anak dan para wanita) Arab, lalu kami berhasrat kepada para wanita tersebut, dan hasrat kami semakin kuat hingga kami ingin menebus (membeli) mereka. Lalu kami merencanakan 'azl, kemudian kami berkata, \"Apakah kita akan melakukan 'azl sebelum bertanya, sementara Rasulullah shallallahu 'alaihi wasallam ada di antara kita? kemudian kami menanyakan kepada beliau tentang hal itu. Beliau bersabda: \"Kenapa kalian tidak melakukannya, tidak ada jiwa yang ditakdirkan hidup kecuali dia akan hidup hingga Hari Kiamat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1257
			}
		},
		{
			"hadithnumber": 1258,
			"arabicnumber": 1258,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Nadlr] mantan budak 'Umar bin 'Ubaidullah, dari ['Amir bin Sa'd bin Abu Waqqash] dari [bapaknya] bahwa dia pernah melakukan 'azl",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1258
			}
		},
		{
			"hadithnumber": 1259,
			"arabicnumber": 1259,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Nadlr] budak 'Umar bin 'Ubaidullah, dari [Ibnu Aflah] mantan budak Abu Ayyub Al Anshari, dari [Ummu Walad] milik [Abu Ayyub Al Anshari], bahwa dia pernah melakukan 'azl",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1259
			}
		},
		{
			"hadithnumber": 1260,
			"arabicnumber": 1260,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa dia tidak melakukan 'azl dan dia membencinya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1260
			}
		},
		{
			"hadithnumber": 1261,
			"arabicnumber": 1261,
			"text": "Telah menceritakan kepadaku dari Malik dari [Dlamrah bin Sa'id Al Mazini] dari [Al Hajjaj bin 'Amru bin Ghaziyyah] Bahwasanya ia pernah duduk-duduk di sisi [Zaid bin Tsabit] . Lalu Ibnu Qahd, seorang laki-laki dari Yaman, datang menemuinya dan berkata, \"Wahai Abu Sa'id, aku mempunyai beberapa budak wanita. Dan isteri-isteriku tidak lebih menarik cantik dari mereka, tetapi tidak semua dari mereka yang aku inginkan hamil dariku. Maka apakah aku boleh melakukan 'azl?\" Zaid bin Tsabit lalu berkata; \"Wahai Hajjaj, berilah fatwa kepadanya! \" Al Hajjaj bin 'Amru berkata; \"Aku lalu berkata, \"Semoga Allah mengampunimu. Padahal tidaklah kami duduk di sini kecuali untuk belajar darimu.\" Zaid bin Tsabit kembali berkata; \"Berilah fatwa kepadanya! \" Al Hajjaj bin 'Amru berkata; \"Maka aku pun berkata, 'Itu adalah ladangmu. Jika mau, kamu bisa menyiraminya dan jika mau kamu boleh membiarkannya tandus.\" Al hajjaj meneruskan, \"Aku dengar hal itu dari Zaid.\" Zaid menyahut, \"Dia benar",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1261
			}
		},
		{
			"hadithnumber": 1262,
			"arabicnumber": 1262,
			"text": "Telah menceritakan kepadaku dari Malik dari [Humaid bin Qais Al Makki] dari seseorang yang bernama [Dzafif] berkata; \" [Ibnu Abbas] pernah ditanya perihal 'azl, lalu ia memanggil salah seorang budak wanitanya, seraya berkata; 'Kabarkan pada mereka.\" -budak wanita itu terlihat malu- Ibnu Abbas lalu berkata; \"Itu boleh, aku juga melakukannya.\" Yakni, Ibnu Abbas juga melakukan 'azl",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1262
			}
		},
		{
			"hadithnumber": 1263,
			"arabicnumber": 1263,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdullah bin Abu Bakar bin Muhammad bin 'Amru bin Hazm] dari [Humaid bin Nafi'] dari [Zainab binti Abu Salamah] Bahwasanya ia mengabarkan ketiga hadits ini kepadanya, Zainab berkata; \"Aku menjenguk Ummu Habibah, isteri Nabi shallallahu 'alaihi wasallam ketika bapaknya, Abu Sufyan bin Harb meninggal dunia. [Ummu Habibah] lalu meminta minyak wangi yang agak kekuning-kuningan, lalu melumurkannya kepada salah satu budak wanitanya, setelah itu dia mengusapkannya pada kedua pipinya dan berkata; 'Demi Allah, saya tidak memerlukan minyak wangi ini, tapi saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Wanita yang beriman kepada Allah dan hari Akhir tidak boleh berkabung atas kematian seseorang lebih dari tiga hari kecuali atas suaminya, yaitu empat bulan sepuluh hari",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1263
			}
		},
		{
			"hadithnumber": 1264,
			"arabicnumber": 1264,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1264
			}
		},
		{
			"hadithnumber": 1265,
			"arabicnumber": 1265,
			"text": "(Masih dari jalur periwayatan yang sama dengan hadits sebelumnya), [Zainab] berkata; \" [Ummu Salamah], isteri Nabi shallallahu 'alaihi wasallam berkata, \"Ada seorang wanita datang menemui Rasulullah shallallahu 'alaihi wasallam lalu bertanya: 'Wahai Rasulullah, suami anak perempuanku meninggal dunia hingga kedua matanya sakit (karena banyak nangis), apakah dia boleh memakai celak? ' Rasulullah shallallahu 'alaihi wasallam menjawab: \"Jangan, \" -dua atau tiga kali-, dan setiap ditanya beliau menjawab: \"Jangan.\" Kemudian beliau bersabda: \"Berkabung itu hanya selama empat bulan sepuluh hari. Sungguh, pada masa Jahilliyah dahulu salaj seorang dari kalian melempar kotoran unta di awal tahun.\" Humaid bin Nafi' berkata; \"Aku lalu bertanya kepada Zainab, 'Apa maksud 'melempar kotoran unta pada awal tahun?\" Zainab menjawab; \"Dahulu jika seorang wanita ditinggal mati oleh suaminya, ia masuk ke rumah jelek dan mengenakan seburuk-buruk pakaian serta tidak menyentuh wewangian selama setahun. Setelah itu akan didatangkan kepadanya seekor keledai, atau kambing, atau burung, lalu ia menyentuh kulitnya sebagai bentuk terapi, dan tidak ada yang ia sentuh kecuali akan mati. Kemudian ia keluar dan diberikan kepadanya kotoran unta, ia lalu melemparkan kotoran tersebut sebagai tanda habisnya masa penantian. Kemudian ia kembali menjalani kehidupan seperti biasa, memakai wewangia dan selainnya.\" Malik berkata; \"Al Hifsy ialah rumah kecil yang jelek atau gubug reot, dan taftadldlu ialah mengusap kulitnya semacam jampi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1265
			}
		},
		{
			"hadithnumber": 1266,
			"arabicnumber": 1266,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1266
			}
		},
		{
			"hadithnumber": 1267,
			"arabicnumber": 1267,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1267
			}
		},
		{
			"hadithnumber": 1268,
			"arabicnumber": 1268,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1268
			}
		},
		{
			"hadithnumber": 1269,
			"arabicnumber": 1269,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Shafiyyah binti Abu 'Ubaid] menderita sakit pada kedua matanya, sementara saat itu ia sedang berkabung karena kematian suaminya, Abdullah bin Umar, sehingga ia tidak mengenakan celak. Sehingga kedua matanya hampir tertutup oleh kotoran",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1269
			}
		},
		{
			"hadithnumber": 1270,
			"arabicnumber": 1270,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1270
			}
		},
		{
			"hadithnumber": 1271,
			"arabicnumber": 1271,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1271
			}
		}
	]
}