{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"41": "Hudud"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1500,
			"arabicnumber": 1500,
			"text": "Telah menceritakan kepada kami Malik dari [Nafi'] dari [Abdullah bin Umar] berkata; \"Orang-orang Yahudi menemui Rasulullah shallallahu 'alaihi wasallam dan menyebutkan bahwa ada seorang laki-laki dan wanita dari mereka telah berbuat berzina. Rasulullah shallallahu 'alaihi wasallam bertanya: 'Apa yang kalian dapatkan dalam Taurat tentang rajam? ' Mereka menjawab, \"Kami akan membuka aib mereka dan menjilidnya.\" Abdullah bin Salam pun berkata; \"Kalian dusta! Sesungguhnya di dalamnya ada hukum rajam.' Maka mereka pun menghadirkan kitab Taurat seraya membukanya, namun salah seorang dari mereka meletakkan tangannya pada ayat rajam. Kamuidan ia membaca ayat yang sebelumnya dan sesudahnya. Abdullah bin Salam lalu berkata orang itu, \"Angkatlah tanganmu! ' Orang Yahudi itu lantas mengangkat tangannya dan ternyata di dalamnya ada ayat rajam. Mereka berkata; 'Wahai Muhammad, ia benar. Dalam Taurat memang ada ayat rajam.\" Maka Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk merajam mereka berdua.\" Abdullah bin Umar berkata; \"Saya melihat lelaki itu membungkuk ke arah wanita untuk melindunginya dari lemparan batu.\" Malik berkata; \"Laki-laki itu melindungi wanita tersebut dengan tubuhnya hingga batu yang dilempar mengenai tubuhnya sendiri",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1500
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": 1501,
			"text": "Telah menceritakan kepadaku Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] bahwa seorang pemuda Aslam menemui Abu Bakar As Shiddiq. Dia berkata; \"Sungguh Al Akhir telah berzina.\" Abu Bakar bertanya; \"Apakah engkau telah mengatakan hal itu kepada selainku?\" dia menjawab; \"Tidak.\" Abu Bakar berkata kepadanya; \"Bertaubatlah kepada Allah dan tutupilah dengan penjagaan Allah. Allah menerima taubat hamba-hamba Nya.\" Namun hatinya belum puas hingga dia menemui Umar bin Khattab, lalu dia mengatakan seperti yang dikatakannya kepada Abu Bakar, dan dia pun menjawab seperti yang dikatakan Abu Bakar. Hati laki-laki itu tetap belum puas hingga dia mendatangi Rasulullah shallallahu 'alaihi wasallam. Ia sampaikan, \"Al Akhir berzina! \" Sa'id kembali menceritakan; \"Rasulullah shallallahu 'alaihi wasallam berpaling darinya sampai tiga kali. Setiap dia mengatakan maka beliau berpaling darinya, sampai beberapa kali. Rasulullah shallallahu 'alaihi wasallam lalu mengutus kepada keluarganya dan bertanya: \"Apakah dia suka mengadu atau dia memang sudah gila?\" Mereka berkata: \"Ya Rasulullah, demi Allah dia adalah orang yang sehat.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah dia masih bujang atau sudah menikah?\" mereka menjawab; \"Sudah menikah, wahai Rasulullah.\" Maka beliau memerintahkan untuk merajamnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1501
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": 1502,
			"text": "Telah menceritakan kepadaku Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] berkata; telah sampai kabar kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada seorang pemuda Aslam yang bernama Hazzal: \"Wahai Hazzal, Jika engkau menutupinya dengan selendangmu, niscaya itu lebih baik bagimu.\" Yahya bin Sa'id berkata; \"Saya menceritakan hadits ini di suatu majelis yang di dalamnya ada [Yazid bin Nu'aim bin bin Hazzal Al Aslami], lalu Yazid berkata; 'Hazzal adalah kakekku dan hadits ini adalah benar",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1502
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": 1503,
			"text": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] bahwa ia mengabarkan kepadanya, bahwa ada seorang laki-laki yang mengaku telah berbuat zina pada masa Rasulullah Shalla Allahu 'alaihi wa sallam, dan ia bersumpah atas dirinya sendiri sebanyak empat kali. Maka Rasulullah Shalla Allahu 'alaihi wa sallam kemudian memerintahkan untuk merajamnya.\" Ibnu Syihab berkata; \"Oleh karena itu, seorang laki-laki boleh dihukum berdasarkan pengakuannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1503
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": 1504,
			"text": "Telah menceritakan kepadaku Malik dari [Ya'qub bin Zaid bin Thalhah] dari papaknya [Zaid bin Thalhah] dari [Abdullah bin Abu Mulaikah] Bahwasanya ia mengabarkan kepadanya, bahwa ada seorang wanita menemui Rasulullah shallallahu 'alaihi wasallam, mengabarkan bahwa dirinya telah berzina dan hamil. Rasulullah shallallahu 'alaihi wasallam kamudian bersabda: \"Pergilah hingga engkau melahirkannya! \" ketika telah melahirkan, ia kembali datang kepada beliau. Beliau lalu bersabda: \"Pergilah hingga engkau menyusuinya.\" Ketika telah menyusui, ia kembali menemui beliau lagi. Beliau pun bersabda: \"Pergi dan titipkanlah anak itu.\" Wanita itu lalu menitipkan anaknya, setelah itu ia mendatangi Rasulullah shallallahu 'alaihi wasallam, kemudian beliau memerintahkan untuk merajamnya dan ia pun dirajam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1504
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": 1505,
			"text": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari ['Ubaidullah bin Abdullah bin Utbah bin Mas'ud] dari [Abu Hurairah] dan [Zaid bin Khalid Al Juhani] mereka berdua mengabarkan, bahwa ada dua orang yang mengadukan perkaranya kepada Rasulullah Shalla Allahu 'alaihi wa sallam. Salah seorang dari mereka berkata; \"Wahai Rasulullah, putuskanlah perkara kami sesuai kitab Allah, \" sedang yang lainnya -dan dia lebih fakih- berkata; \"Benar, ya Rasulullah! Putuskanlah perkara kami ini sesuai dengan kitabullah, namun ijinkan saya untuk berbicara.\" Beliau bersabda: \"Bicaralah.\" Laki-laki itu lantas berkata; \"Sesungguhnya anakku adalah buruh yang bekerja kepada orang ini, lalu dia berzina dengan isterinya. Lalu ia mengabarkan kepadaku bahwa anakku harus dirajam. Maka aku segera menebusnya dengan membayar seratus ekor kambing, dan membebaskan budakku. Setelah itu aku bertanya beberapa ahli ilmu mengenai hal itu, mereka mengatakan bahwa seharusnya anakku didera seratus kali dan diasingkan selama setahun, sedangkan wanita itu harus dirajam.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi yang jiwaku berada ditangan-Nya, sungguh akan saya putuskan perkara kalian dengan kitabullah. Kambing dan budakmu, maka akan dikembalikan.\" Beliau kemudian mendera anak orang itu seratus kali dan diasingkan selama satu tahu. Kemudian beliau menyuruh Unais Al Aslami agar mendatangkan isteri tersebut, jika mengakuinya maka ia akan dirajam. Wanita itu lalu mengakuinya, maka Unais pun merajamnya. Malik berkata; \"'Asif adalah pekerja",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1505
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": 1506,
			"text": "Telah menceritakan kepadaku Malik dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] bahwa Sa'd bin 'Ubadah bertanya kepada Rasulullah shallallahu 'alaihi wasallam; \"Bagaimana pendapat anda, jika saya mendapati isteriku bersama seorang laki-laki lain, apakah saya harus menunggunya hingga saya mendatangkan empat orang saksi?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Ya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1506
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": 1507,
			"text": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari ['Ubaidullah bin Abdullah bin 'Utbah bin Mas'ud] dari [Abdullah bin Abbas] ia berkata, \"Aku mendengar [Umar bin Khattab] berkata; \"Rajam dalam kitabullah adalah sesuatu yang hak, yaitu untuk laki-laki atau perempuan yang berzina; jika mereka telah menikah; jika ada bukti; atau jika wanita tersebut hamil; atau adanya pengakuan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1507
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": 1508,
			"text": "Telah menceritakan kepadaku Malik dari [Yahya bin Sa'id] dari [Sulaiman bin Yasar] dari [Abu Waqid Al Laitsi] bahwa ada seseorang menemui Umar bin Khattab ketika sedang berada di Syam. Laki-laki itu menuturkan bahwa dia telah mendapati isterinya bersama laki-laki lain. Umar bin Khattab kemudian mengirim Abu Waqid Al Laitsi kepada isteri orang itu untuk menanyakan perihal tersebut. Abu Waqid lalu menemui wanita tersebut saat ia sedang bersama beberapa orang wanita. Kemudian Abu Waqid menuturkan semua yang dikatakan suaminya kepada [Umar bin Khattab], dan bahwa dia tidak akan dihukum hanya dengan perkataan suaminya. Abu Waqid lalu mengatakan sesuatu agar wanita itu membela diri, tapi wanita itu menolaknya. Bahkan akhirnya justru ia mengakui perbuatannya. Umar kemudian memerintahkan untuk merajamnya, wanita itupun dirajam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1508
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": 1509,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1509
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": 1510,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1510
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": 1511,
			"text": "Telah menceritakan kepadaku Malik dari [Zaid bin Aslam] berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam ada seorang laki-laki mengaku telah berbuat zina, Rasulullah shallallahu 'alaihi wasallam lalu minta diambilkan sebuah cambuk, maka dibawakanlah sebuah cambuk yang telah rusak. Beliau bersabda: \"Yang lebih besar dari ini.\" Lalu diberikan cambuk masih bagus dan belum dipotong ujungnya. Beliau bersabda: \"Yang lebih ringan dari ini.\" Kemudian diberikan cambuk yang telah dirangkai dan agak lunak. Rasulullah shallallahu 'alaihi wasallam kemudian memerintahkan untuk menjilidnya, maka laki-laki itu pun dijilid. Setelah itu beliau bersabda: \"Wahai para manusia, sungguh telah sampai waktunya kalian untuk berhenti (melakukan pelanggaran terhadap) larangan-larangan Allah. Barangsiapa terjerumus pada perbuatan kotor ini maka hendaknya dia menutupinya dengan perlindungan Allah, Barangsiapa memberitahukan perbuatannya kepada kami, maka akan kami tegakkan atasnya hukum Allah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1511
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": 1512,
			"text": "Telah menceritakan kepadaku Malik dari [Nafi'] bahwa [Shafiyah binti 'Ubaid] mengabarkan kepadanya, bahwa pernah dihadapkan kepada [Abu Bakar As Shiddiq] seorang laki-laki yang menggauli budak wanita yang masih perawan hingga hamil, Laki-laki itu mengakui perbuatannya, padahal ia belum menikah. Abu Bakar lalu memerintahkan untuk menjilidnya kemudian mengasingkannya ke Fadak",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1512
			}
		},
		{
			"hadithnumber": 1513,
			"arabicnumber": 1513,
			"text": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari [Ubaidullah bin Abdullah bin 'Utbah bin Mas'ud] dari [Abu Hurairah] dan [Zaid bin Khalid Al Juhani] bahwa Rasulullah shallallahu 'alaihi wasallam ditanya tentang seorang budak wanita yang berzina dan belum belum menikah. Beliau menjawab: \"Jika dia berzina maka jilidlah dia, jika dia berzina lagi maka jilidlah ia, jika dia berzina lagi maka jilidlah ia. Kemudian juallah dia walaupun seharga dlafir (tali pengikat rambut) \". Ibnu Syihab berkata; \"Aku tidak tahu apakah setelah perbuatan zina yang ketiga atau yang keempat.\" Yahya berkata; \"Aku telah mendengar Malik mengatakan bahwa dlafir adalah tali",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1513
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": 1514,
			"text": "Telah menceritakan kepadaku Malik dari [Nafi'] bahwa ada seseorang meminta seorang budak dari bagian seperlima, lalu dia mengambil paksa seorang budak wanita dari bagian seperlima tersebut lantas menggaulinya. Kemudian [Umar bin Khattab] menjilid dan mengasingkannya, sementara budak wanita itu tidak dijilid karena dalam kondisi dipaksa",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1514
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": 1515,
			"text": "Telah menceritakan kepadaku Malik dari [Yahya bin Sa'id] bahwa [Sulaiman bin Yasar] mengabarkan kepadanya bahwa [Abdullah bin Ayyasy bin Abu Rabi'ah Al Makhzumi] berkata; \"Aku diperintah [Umar bin Khattab] untuk mengeksekusi seorang pemuda Quraisy, lalu kami menjilid beberapa budak wanita dari para budak pemerintah limapuluh-limapuluh untuk perkara zina",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1515
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": 1516,
			"text": "Telah menceritakan kepadaku Malik dari [Abu Az Zinad] berkata; Umar bin Abdul Azis mendera seorang budak laki-laki yang menyebarkan fitnah zina tanpa disertai saksi dengan delapan puluh kali dera.\" Abu Zinad berkata; \"Aku lalu menanyakan hal itu kepada [Abdullah bin 'Amir bin Rabi'ah], ia menjawab; 'Aku hidup bersama [Umar bin Khattab], [Utsman bin 'Affan] dan khalifah-khalifah yang lain, saya tidak mendapati seorangpun di antara mereka yang mendera budak yang menyebarkan fitnah zina tanpa disertai saksi lebih banyak dari empat puluh dera",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1516
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": 1517,
			"text": "Telah menceritakan kepadaku Malik dari [Zuraiq bin Hakim Al Aili] seorang laki-laki yang bernama Misbah meminta pertolongan kepada anaknya, namun seakan-akan anaknya tersebut memperlambat diri. Ketika anaknya datang ia berkata, \"Dasar pezina! \" Zuraiq (perawi) berkata; \"Anaknya lalu minta pertolongan kepadaku (berkenaan dengan tuduhan bapaknya kepada dirinya) . Ketika aku akan mendera bapaknya, anaknya berkata; \"Demi Allah, jika engkau menderanya, maka aku akan mengaku berbuat zina.\" Ketika dia mengatakan hal itu, maka perkaranya kian sulit bagiku. Aku kemudian menulis surat kepada Umar bin Abdul Azis yang saat itu menjadi khalifah. [Umar bin Abdul Aziz] kemudian menulis balasan agar aku mengabulkan permaafan anaknya kepada sang bapak.\" Zuraiq berkata; \"Aku kemudian kembali menulis surat kepadanya, 'Apa pendapatmu tentang seorang laki-laki atau kedua orang tuanya dituduh telah berzina, sedangkan keduanya atau salah satu dari orang tuanya meninggal dunia? ' Zuraiq berkata; \"Maka Umar menjawab; \"Jika laki-laki (yang tertuduh) itu memberi maaf kepada penuduh, maka kabulkanlah maafyang ia berikan. Dan jika yang dituduh adalah kedua orang tuanya, sementara keduanya atau salah seorang dari keduanya telah meninggal, maka putuskanlah sesuai dengan Kitabullah, kecuali jika ia ingin merahasiakannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1517
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": 1518,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1518
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": 1520,
			"text": "Telah menceritakan kepadaku Malik dari [Rabi'ah bin Abu Abdurrahman] bahwa [Umar bin Khattab] pernah berkata kepada seorang laki-laki yang melakukan perjalanan bersama budak wanita milik isterinya yang kemudian ia menggaulinya. Isterinya lalu merasa cemburu hingga melaporkannya kepada Umar bin Khattab. 'Umar bin Khattab lantas bertanya kepada laki-laki tersebut tentang persetubuhan yang dilakukannya dengan budak wanita tersebut, laki-laki itu menjawab, \"Dia telah menghibahkannya kepadaku! \" Umar berkata (kepada sang isteri); \"Engkau berikan bukti atau aku akan melemparimu dengan batu?\" Rabi'ah berkata; \"Maka isterinya mengakui bahwa dia telah menghibahkannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1520
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": 1521,
			"text": "Telah menceritakan kepadaku Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah memotong (tangan) karena perisai yang harganya tiga dirham",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1521
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": 1522,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abdurrahman bin Abu Husain Al Maki] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada hukum potong tangan pada buah yang masih menggantung atau yang terjaga dalam pagar di pegunungan. Jika tempat berlindungnya hewan ternak atau tempat penumbukan padi terlindungi, maka hukuman potong (tangan) berlaku selama barang yang dicuri mencapai harga perisai",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1522
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": 1523,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar] dari [Bapaknya] dari ['Amrah binti Abdurrahman] bahwa ada seorang pencuri yang mencuri buah Utrujah (buah yang rasanya agak masam) pada masa Utsman. [Utsman] lalu menyuruh untuk menghitung harganya. Buah itu dihargai dengan tiga dirham dengan kurs dua belas dirham seharga satu dinar, kemudian 'Utsman memotong tangannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1523
			}
		},
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari ['Amrah binti Abdurrahman] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata; \"Belum lama bagiku dan belum hilang dari ingatanku bahwa pemotongan (tangan pencuri) pada seperempat dinar atau lebih",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1524
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar bin Hazm] dari ['Amrah binti Abdurrahman] berkata; \" [Aisyah], isteri Nabi shallallahu 'alaihi wasallam pergi ke Makkah bersama dua budak wanitanya, serta seorang pelayan laki-laki dari Bani Abdullah bin Abu Bakar As Shiddiq. Kemudian Aisyah mengirim kain selimut bergambar yang telah dijahit dengan sobekan kain hijau, lewat kedua budak wanitanya.\" 'Amrah binti Abdurrahman berkata; \"Pelayan laki-laki yang bersamanya mengambil selimut itu dan merusak jahitan lalu mengeluarkan isinya, budak laki-laki itu kemudian menggantinya dengan kain alas pelana atau sejenis jubah yang berlapis kulit, lalu ia menjahitnya. Ketika dua budak wanita itu sampai di Madinah, mereka menyerahkannya kepada keluarga Aisyah. Dan saat mereka membukanya, mereka menemukan al labd dan tidak menemukan selimut. Mereka lalu menanyakannya kepada dua budak wanita tersebut, hingga akhirnya keduanya menyampaikan hal itu kepada Aisyah, isteri Nabi shallallahu 'alaihi wasallam, atau mereka berdua mengirim surat kepadanya. Kedua budak wanita itu menduga bahwa budak laki-laki itulah yang telah melakukannya. Maka budak laki-laki tersebut ditanya dan dia mengakuinya. Aisyah, isteri Nabi shallallahu 'alaihi wasallam memerintahkan untuk memotong tangannya dan berkata; \"Potong tangan dilakukan jika mencapai seperempat dinar atau lebih",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1525
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa budak Abdullah bin Umar mencuri lalu dia kabur, kemudian Abdullah bin Umar menyerahkan (perkara ini) kepada Sa'id bin Al Ash yang menjabat Gubernur Madinah agar memotong tangannya. Sa'id menolaknya dan berkata; \"Tangan seorang pencuri yang kabur, tidak dipotong.\" [Abdullah bin Umar] bertanya; \"Di kitabullah yang mana, kamu menemukan hal ini?\" Abdullah bin Umar lalu memerintahkan untuk memotong tangannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1526
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "Telah menceritakan kepadaku dari Malik dari [Zuraiq bin Hakim] ia mengabarkan kepadanya, bahwa ia menemukan seorang budak yang kabur setelah mencuri. Zuraiq melanjutkan; \"Hal ini mengundang masalah bagiku. Maka aku menulis surat kepada Umar bin Abdul Aziz yang saat itu menjadi gubernur, untuk menanyakan hal tersebut. Aku kabarkan kepadanya bahwa aku mendengar seorang hamba yang melarikan diri jika mencuri dan kabur, maka tangannya tidak dipotong.\" Zuraiq melanjutkan, \" [Umar bin Abdul Aziz] lalu membalas suratku dan mengatakan; 'Kamu menulis surat kepadaku bahwasanya kamu telah mendengar, jika seorang hamba yang melarikan diri mencuri lalu dia kabur, maka tidak dipotong tangannya, sedangkan Allah Tabaraka Wa Ta'ala dalam kitab-Nya berfirman; \"Seorang pencuri baik laki-laki maupun perempuan maka potonglah tangannya sebagai balasan dari perbuatannya dan hukuman dari Allah, dan Allah Maha Mulia dan Maha Bijaksana) ' (Qs. Al Maidah: 38) jika barang curiannya mencapai seperempat dinar atau lebih, maka potonglah tangannya.\" Telah menceritakan kepadaku dari Malik, bahwasanya telah sampai kepadanya, bahwa Al Qasim bin Muhammad dan Salim bin Abdullah dan 'Urwah bin Zubair mereka mengatakan; \"Jika budak yang melarikan diri mencuri sesuatu yang mencapai kewajiban untuk dipotong, maka tangannya dipotong.\" Malik berkata; \"Itu adalah perkara yang tidak ada perbedaan pendapat di antara kami, yaitu jika seorang hamba yang kabur mencuri barang yang mencapai kewajiban potonga tangan, maka tangannya harus dipotong",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1527
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Shafwan bin Abdullah bin Shafwan] dikatakan kepada Shafwan bin Umayyah; \"Barangsiapa tidak berhijrah maka akan binasa.\" Saat Shafwan bin Umayyah tiba di Madinah, dia tidur di masjid dengan menggunakan selendangnya sebagai bantal. Lalu ada seorang pencuri yang mengambil selendangnya tersebut, Shafwan langsung menangkapnya dan membawanya menghadap Rasulullah shallallahu 'alaihi wasallam. Beliau lalu menyuruh untuk memotong tangannya, namun Shafwan berkata; \"Wahai Rasulullah, saya tidak bermaksud demikian. Pakaian ini saya anggap sedekah untuknya.\" Rasulullah shallallahu 'alaihi wasallam lantas bersabda: \"Kenapa tidak kamu katakan sebelum kamu membawanya kepadaku?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1529
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] bahwa [Zubair bin Al Awwam] pernah menjumpai seorang laki-laki menangkap seorang pencuri dan ingin membawanya kepada penguasa. Zubair lalu meminta agar pencuri itu diampuni dan melepaskannya. Namun laki-laki itu berkata; \"Tidak, hingga aku membawanya kepada penguasa.\" Zubair berkata; \"Jika kamu telah sampai kepada pihak penguasa, maka Allah akan melaknat orang yang memberi maaf dan yang diberi maaf",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1530
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] bahwa seorang laki-laki Yaman yang telah dipotong kaki dan tangannya, tiba dan singgah di tempat Abu Bakar As Shiddiq. Dia mengeluhkan bahwa seorang pejabat Yaman telah berbuat aniaya terhadapnya, ketika itu dia sedang shalat malam. [Abu Bakar] bertanya; \"Demi ayahmu, bagaimana malammu dengan seorang pencuri.\" Kemudian mereka kehilangan cincin Asma` binti 'Umais, isteri Abu Bakar As Shiddiq, dan lelaki (pencuri) itu ikut mencari bersama-sama mereka seraya berdoa; \"Ya Allah, hukumlah orang yang telah melakukan pencurian pada malam hari ini terhadap pemilik rumah yang shalih ini.\" Mereka mendapatkan perhiasan itu pada seorang tukang emas. dan tukang emas itu mengatakan bahwa orang yang tangannya terpotong-lah yang telah membawanya. Dan laki-laki yang tangannya telah dipotong itu pun mengakuinya, atau diajukanlah beberapa saksi kepadanya. Maka Abu Bakar As Shiddiq memerintahkan untuk memotong tangan kirinya, lalu mengatakan, \"Demi Allah, sungguh doanya untuk dirinya lebih hebat bagiku daripada tindak pencuriannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1531
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "Telah menceritakan kepadaku dari Malik bahwa [Abu Zinad] mengabarkan kepadanya, bahwa pekerja Umar bin Abdul Aziz menangkap beberapa perampok dan tidak membunuh seorang pun. Dan ia berkeinginan untuk memotong tyangan mereka atau membunuhnya, lalu dia menulis surat kepada Umar bin Abdul Aziz tentang perkara itu. [Umar bin Abdul Aziz] menjawab; \"Sekiranya engkau hukum dengan yang lebih ringan dari itu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1532
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] bahwa seorang budak laki-laki mencuri pohon kurma yang masih kecil dari kebun seseorang, lalu dia menanamnya di kebun tuannya. Pemilik pohon tadi keluar mencari pohon kurmanya dan mendapatkannya. Dia lantas mengadukan kepada Marwan bin Al Hakam atas tindakan budak tersebut. Maka Marwan pun memenjarakan budak itu, dan berkeinginan untuk memotong tangannya. Majikan budak itu lalu pergi menemui Rafi' bin Khadij dan menanyakan tentang permasalahan itu. [Rafi'] kemudian mengabarkan kepadanya bahwa ia pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada potong tangan dalam kurma dan katsar, dan katsar adalah bejana dari mayang (pohon kurma) .\" Orang itu berkata; \"Marwan bin Al Hakam menangkap pelayanku dan dia ingin memotong tangannya. Maka aku berharap jika engkau sudi untuk pergi bersamaku menemuinya, agar engkau bisa menyampaikan apa yang telah engkau dengar dari Rasulullah Shalla Allahu 'alaihi wa sallam.\" Maka Rafi' pergi bersamanya menghadap Marwan bin Al Hakam, kemudian dia bertanya kepada Marwan; \"Apakah kamu telah menangkap budak orang ini?\" dia menjawab; \"Ya.\" Rafi' bertanya lagi; \"Apa yang akan kamu perbuat terhadapnya?\" Dia menjawab; \"Aku hendak memotong tangannya.\" Kemudian Rafi' berkata; kepadanya; \"Saya telah mendengar Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: 'Tidak ada potong tangan dalam kurma dan katsar.' lalu dia menyuruh agar membebaskan budak itu, dan (budak itupun) dibebaskan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1533
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [As Sa`ib bin Yazid] bahwa Abdullah bin Amru bin Al Hadlrami datang dengan pembantunya kepada Umar bin Khattab, seraya berkata; \"Potonglah tangan pembantuku ini, dia telah mencuri! \" Umar bertanya; \"Apa yang dia curi?\" dia menjawab; \"Dia mencuri cermin isteriku yang harganya enam puluh dirham.\" [Umar] berkata; \"Bebaskan dia, karena tidak ada potong tangan untuk pembantumu yang mencuri hartamu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1534
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] bahwa seorang pencopet dibawa ke hadapan Marwan bin Al Hakam, sehingga Marwan berkeinginan untuk memotong tangannya. Namun kemudian dia mengirim surat kepada Zaid bin Tsabit menanyakan hal itu, maka [Zaid bin Tsabit] menjawab; \"Tidak ada potong tangan dalam hal pencopetan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1535
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata; telah mengabariku [Abu Bakar bin Muhammad bin Amru bin Hazm] bahwa dia menangkap seseorang petani non arab yang telah mencuri beberapa cincin besi, lalu dia mengurungnya untuk memotong tangannya. 'Amrah bin Abdurrahman mengutus mantan budaknya yang bernama [Umayyah] untuk menemuinya. Abu Bakar berkata; \"Budak wanita itu datang saat aku sedang bersama orang banyak, ia lalu berkata; ' [Amrah], bibimu menitip pesan kepadamu, 'Wahai anak saudaraku, kamu telah menangkap seorang petani yang mencuri sesuatu yang murah harganya dan ingin memotong tangannya? ' Saya menjawab; 'Benar'. Budak wanita itu berkata, \"Amrah berkata kepadamu, \"Amrah memesankan kepadamu bahwa tidak ada potong tangan kecuali pada seperempat dinar atau lebih'.\" Abu Bakar berkata; \"Maka aku membebaskan petani tadi",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1536
			}
		}
	]
}