{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"49": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1671,
			"arabicnumber": 1671,
			"text": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] dari [Anas bin Malik] bahwa Rabi'ah bin Abu Abdurrahman mendengarnya berkata; \"Rasulullah shallallahu 'alaihi wasallam bukanlah seorang yang terlalu tinggi juga tidak terlalu pendek. Tidak putih pucat juga tidak pula coklat kelam. Rambutnya tidak keriting juga tidak lurus. Allah mengutusnya ketika beliau berusia empat puluh tahun. Beliau tinggal di Makkah selama sepuluh tahun dan di Madinah sepuluh tahun. Allah Azza Wa Jalla mewafatkannya ketika berumur enam puluhan, pada kepala dan jenggotnya tidak ada kecuali dua puluh helai rambut putih",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1671
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": 1672,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada suatu malam aku mimpi di dekat Ka'bah. Aku melihat seseorang yang kulitnya sawo matang, seakan-akan dia adalah sebaik-baik orang yang berkulit sawo matang. Dia memiliki rambut, seakan-akan ia adalah sebaik-baik orang yang mempunyai rambut seperti itu. Dia membiarkannya terurai dan air itupun menetes darinya. Ia bersandar pada dua orang laki-laki, atau \"Dua bahu laki-laki, dia mengelilingi Ka'bah, lalu aku bertanya, siapakah dia? Maka dikatakan bahwa dia Al masih bin Maryam. Kemudian aku melihat orang yang rambutnya sangat keriting, buta mata kanannya seperti anggur yang menggelembung. Aku bertanya; siapakah ini, dikatakan kepadaku bahwa ia Almasih Dajjal",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1672
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": 1673,
			"text": "Telah menceritakan kepadaku dari Malik dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Bapaknya] dari [Abu Hurairah] berkata; \"Lima macam sunnah fitrah: memotong kuku, memendekkan kumis, mencabut bulu ketiak, mencukur bulu kemaluan, dan berkhitan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1673
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": 1674,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] berkata; \"Ibrahim shallallahu 'alaihi wasallam adalah orang pertama yang memuliakan tamu. Orang pertama yang berkhitan. Orang pertama yang memendekkan kumis dan orang pertama yang melihat uban. Ibrahim bertanya, \"Wahai Rabbku, apa ini?\" Allah Tabaraka wa Ta'ala berfirman: \"Wahai Ibrahim, itu adalah kewibawaan.\" Ibrahim berkata, \"Ya Rabb, tambahkanlah kewibawaan bagiku! \" Yahya berkata; \"Aku mendengar Malik berkata; 'kumis diambil hingga nampak ujung bibir -yaitu bibir itu sendiri-, dan dia tidak mencukur habis, sehingga tetap terlihat kumis tersebut",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1674
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": 1675,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zubair] dari [Jabir bin Abdullah As Sulami] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang seseorang makan dengan tangan kirinya, atau berjalan dengan memakai satu sandal. Beliau melarang berselimut dengan tidak mengeluarkan satupun anggota badannya, dan beliau melarang duduk ihtiba dengan mengenakan satu pakaian, sehingga tersingkap kemaluannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1675
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": 1676,
			"text": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari [Abu Bakar bin 'Ubaidullah bin Abdullah bin Umar] dari [Abdullah bin 'Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian makan, hendaklah ia makan dengan tangan kanannya dan minum dengan tangan kanannya. Sesungguhnya setan makan dan minum dengan tangan kirinya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1676
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": 1677,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukanlah orang miskin itu yang berkeliling mengitari orang-orang lalu dia mendapatkan satu atau dua suapan, sebutir atau dua butir kurma.\" Para sahabat bertanya, \"Wahai Rasulullah, lalu siapakah orang miskin itu?\" Beliau menjawab: \"(Yaitu) orang yang tidak mendapatkan kecukupan bagi dirinya, namun orang-orang tidak menyadarinya sehingga memberinya sedekah, dan dia tidak meminta-minta kepada manusia",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1677
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": 1678,
			"text": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari [Ibnu Bujaid Al Anshari Al Haritsi] dari [Neneknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berilah orang miskin, walaupun hanya dengan kuku (kaki kambing) yang telah dibakar",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1678
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": 1679,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang muslim makan dengan satu usus sedangkan orang kafir makan dengan tujuh usus",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1679
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": 1680,
			"text": "Telah menceritakan kepadaku dari Malik dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] berkata, \"Seorang kafir datang bertamu kepada Rasulullah shallallahu 'alaihi wasallam. Maka beliau memerintahkan untuk kambing mendatangkan seekor kambing untuk diperah, orang kafir itu lalu memimun perahan susunya. Lalu diperahkan dari kambing yang lain, dan ia meminumnya. Lalu diperahkan dari kambing lain lain, dan ia meminumnya lagi, hingga menghabiskan susu dari tujuh kambing. Keesoakan harinya orangitu masuk Islam. Rasulullah shallallahu 'alaihi wasallam menyuruh agar kambing beliau diperah. Diapun minum air susunya, kemudian beliau memerahkannya lagi namun dia tidak sanggup menghabisinya. Sehingga Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang mukmin minum dengan satu usus sedangkan orang kafir minum dengan tujuh usus",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1680
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": 1681,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Zaid bin Abdullah bin Umar bin Khattab] dari [Abdullah bin Abdurrahman bin Abu Bakar Ash Shidhiq] dari [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang minum dari bejana perak, sungguh akan terdengar gemuruh api neraka di dalam perutnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1681
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": 1682,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ayyub bin Habib] mantan budak Saad bin Abu Waqqash, dari [Abu Al Mutsanna Al Juhani] berkata, \"Ketika aku berada di samping Marwan bin Al Hakam, datanglah Abu Sa'id Al Khudri. Marwan bin Hakam bertanya kepadanya, \"Apakah engkau pernah mendengar Rasulullah shallallahu 'alaihi wasallam melarang bernafas meniup ketika minum?\" [Abu Sa'id Al Khudri] menjawab, \"Ya.\" Lalu ada seorang laki-laki bertanya kepada beliau, \"Wahai Rasulullah, aku tidak bisa kenyang dengan satu nafas! \" Rasulullah shallallahu 'alaihi wasallam bersabda: 'Jauhkan gelas dari mulutmu, lalu bernafaslah! \"' Laki-laki itu berkata, \"Aku melihat ada kotoran di dalamnya! \" Beliau menjawab: \"Tumpahkanlah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1682
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": 1683,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1683
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": 1684,
			"text": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari bahwa [Aisyah] Ummul Mukminim dan [Sa'd bin Waqqas] berpendapat bahwa tidaklah mengapa seorang minum sambil berdiri",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1684
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": 1685,
			"text": "Telah menceritakan kepadaku Malik dari [Abu Ja'far Al Qari] berkata, \"Aku melihat [Abdullah bin Umar] minum sambil berdiri",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1685
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": 1686,
			"text": "Telah menceritakan kepadaku dari Malik dari ['Amir bin Abdullah bin Az Zubair] dari [Bapaknya] bahwa dia minum sambil berdiri",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1686
			}
		},
		{
			"hadithnumber": 1687,
			"arabicnumber": 1687,
			"text": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari [Anas bin Malik] berkata, \"Pernah disuguhkan kepada Rasulullah shallallahu 'alaihi wasallam disuguhkan susu yang telah dicampur dengan air sumur. Di samping kanan beliau ada seorang Badui sedang di samping kirinya Abu Bakar As Shiddiq. Beliau meminum minuman tersebut lalu memberikan kepada orang Badui tersebut dan bersabda: \"Yang kanan, yang kanan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1687
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": 1688,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Hazm bin Dinar] dari [Sahl bin Sa'd Al Anshari] berkata, \"Saat disuguhkan minuman kepada Rasulullah shallallahu 'alaihi wasallam, beliau meminumnya. Di sisi kanan beliau ada seorang anak kecil, sementara di sisi kirinya ada beberapa orang yang sudah tua. Beliau bertanya kepada anak tadi: \"Apakah kamu mengizinkanku, jika aku berikan air ini kepada mereka dahulu?\" Anak itu menjawab: \"Wahai Rasulullah, Demi Allah, tidak! Aku tidak akan mengutamakan jatah untukku dari anda kepada seorangpun.\" Sahl bin Sa'ad berkata; \"Maka Rasulullah shallallahu 'alaihi wasallam meletakkan di tangan anak itu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1688
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ishaq bin Abdullah bin Abu Thalhah] telah mendengar [Anas bin Malik] berkata, \"Abu Thalhah berkata kepada Ummu Sulaim, \"Aku mendengar suara Rasulullah shallallahu 'alaihi wasallam sangat lemah dan lirih, aku tahu bahwa beliau merasa lapar. Apakah kamu mempunyai sesuatu?\" Ummu Sulain menjawab, \"Ya.\" Kemudian Ummu Sulaim mengeluarkan beberapa roti pipih dari gandum seraya meraih kerudung miliknya. Ummu SUlaim lantas memasukkan roti itu ke dalam kain kerudung dan menyelempangkannya di bawah tanganku. Ia lalu mengutusku untuk mengantar makanan itu kepada Rasulullah shallallahu 'alaihi wasallam.\" Anas berkata; \"Aku membawanya menemui Rasulullah shallallahu 'alaihi wasallam. Saya mendapati beliau sedang duduk di masjid bersama para sahabat, lalu aku berdiri di hadapan mereka. Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apakah Abu Thalhah yang telah menyuruhmu?\" Anas berkata, \"Aku menjawab; \"Ya.\" Beliau bertanya: \"Untuk membawakan makanan? ' Aku menjawab, \"Ya.\" maka Rasulullah shallallahu 'alaihi wasallam berkata kepada orang-orang yang sedang bersamanya: \"Berdirilah! '\" Anas berkata, \"Beliau berangkat dan saya berada di bagian depan mereka, hingga aku menemui Abu Thalhah dan mengabarkan hal itu.\" Abu Thalhah berkata, \"Wahai Ummu Sulaim, Rasulullah shallallahu 'alaihi wasallam datang bersama orang-orang, sedangkan kita tidak memiliki makanan yang cukup untuk menyuguh mereka! \" Ummu Sulaim menjawab, \"Allah dan Rasul-Nya lebih mengetahui.\" Anas berkata; \"Abu Thalhah menemui Rasulullah shallallahu 'alaihi wasallam. Lalu beliau dan Abu Thalhah memasuki rumahnya, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Ummu Sulaim, kemarilah! apa yang kau miliki?\" Ummu Sulaim kemudian datang dengan membawa roti, kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan agar roti tersebut dilumatkan. Maka roti pun dilumatkan dan Ummu Sulaim menuangkan minyak samin pada wadah tersebut hingga menjadi lauk. Rasulullah shallallahu 'alaihi wasallam mengucapkan sesuatu ucapan sebagaimana yang dikehendaki Allah untuk beliau ucapkan. Setelah itu beliau bersabda: \"Persilahkanlah sepuluh orang untuk masuk.\" Abu Thalhah lantas mempersilahkan sepuluh orang untuk masuk, lalu mereka masuk dan menyantap makanan hingga merasa kenyang, kemudian keluar. Beliau bersabda lagi: \"Persilahkanlah sepuluh orang untuk masuk.\" Abu Thalhah lantas mempersilahkan sepuluh orang untuk masuk, lalu mereka masuk dan menyantap makanan hingga merasa kenyang, kemudian keluar. Beliau bersabda lagi: \"Persilahkanlah sepuluh orang untuk masuk.\" Abu Thalhah lantas mempersilahkan sepuluh orang untuk masuk, lalu mereka masuk dan menyantap makanan hingga merasa kenyang, kemudian keluar. Beliau bersabda lagi: \"Persilahkanlah sepuluh orang untuk masuk.\" Abu Thalhah lantas mempersilahkan sepuluh orang untuk masuk, lalu mereka masuk dan menyantap makanan hingga merasa kenyang, kemudian keluar. Beliau bersabda lagi: \"Persilahkanlah sepuluh orang untuk masuk.\" Sehingga seluruh kaum semua makan dan kenyang. Jumlah mereka ada tujuh puluh orang atau delapan puluh orang",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1689
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": 1690,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Makanan dua orang cukup untuk tiga orang, dan makanan tiga orang cukup untuk empat orang",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1690
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": 1691,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Zubair Al Maki] dari [Jabir bin Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kuncilah pintu dan pasanglah tutup tempat air kalian, baliklah bejana kalian atau tutuplah bejana kalian. Matikan lampu, karena setan tidak mampu membuka pintu yang terkunci, tidak bisa melepas ikatan, tidak bisa membuka bejana. Sesungguhnya tikus itu dapat menyalakan (membakar) rumah-rumah sehingga mencelakakan mereka",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1691
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": 1692,
			"text": "Telah menceritakan kepadaku dari Malik dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Syuraih Al Ka'bi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa beriman kepada Allah dan hari Akhir hendaknya dia berkata yang baik atau diam. Barangsiapa beriman kepada Allah dan hari Akhir hendaknya dia memuliakan tetangganya. Barangsiapa beriman kepada Allah dan hari Akhir maka hendaknya dia memuliakan tamunya; yang wajib yaitu sehari semalam, sedang hak bertamunya adalah tiga hari, adapun selebihnya maka itu adalah sedekah. Tidak halal bagi (tamu) untuk tinggal di rumah pemiliknya, hingga membuat pemiliknya susah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1692
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": 1693,
			"text": "Telah menceritakan kepadaku dari Malik dari [Sumayya] mantan budak Abu Bakar, dari [Abu Shalih As Saman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Suatu ketika, ada seorang lelaki yang berjalan di sebuah jalan. Dia sangat merasa kehausan, lalu dia mendapatkan sebuah sumur. Lalu dia turun ke dalamnya dan meminum airnya. Tatkala keluar, dia mendapati seekor anjing yang menjulurkan lidahnya memakan tanah yang basah karena kehausan. Lalu lelaki itupun berkata; 'Sungguh anjing ini sangat kehausan seperti aku tadi kehausan, ' lalu dia turun lagi ke sumur. Lalu mengisi sepatunya dengan air, ia pegang dengan mulutnya, hingga dia naik dari sumur, setelah itu ia memberi minum anjing tersebut. Allah berterima kasih kepadanya dan mengampuninya.\" Para sahabat bertanya: \"Wahai Rasulullah, karena kita memberi sesuatu pada hewan mendapat pahala?\" Beliau bersabda: \"Pada setiap yang memiliki nyawa ada pahala",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1693
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": 1694,
			"text": "Telah menceritakan kepadaku dari Malik dari [Wahab bin Kaisan] dari [Jabir bin Abdullah] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengutus delegasi menuju ke arah pantai. Beliau mengangkat Abu Ubaidah bin Jarrah sebagai pemimpin pasukan, sementara jumlah mereka adalah tiga ratus orang.\" Jabir berkata; \"Dan aku termasuk dari mereka. Kami lalu berangkat, hingga ketika sampai di suatu jalan kami hampir kahabisan bekal. Abu Ubaidah memerintahkan untuk mengumpulkan perbekalan pasukan yang tersisa, dan perbekalanpun dikumpulkan. Bekal yang terkumpul berjumlah dua kantung kurma.\" Jabir berkata; \"(Bekal itulah) yang menjadi makanan pokok kami setiap hari, maka sedikit demi sedikit makanan itu pun habis. Dan kami tidak mendapatkan jatah lagi kecuali hanyalah sebuah kurma tiap orang. Aku bertanya; 'Apalah artinya sebiji kurma.' Abu 'Ubaidah menjawab; 'Kita telah mendapatkan pengganti perbekalan kita yang habis.\" Jabir berkata; \"Kemudian tibalah kami di sebuah pantai, dan ternyata di sana telah ada ikan paus sebesar anak bukit. Maka pasukanpun memakannya selama delapan belas malam. Abu Ubaidah memerintahkan untuk mengambil dua tulang rusuknya, lalu dipancangkan. Dia memerintahkan untuk mendatangkan seekor unta tunggangan. Ternyata unta tersebut dapat melewati bawah tulang rusuk ikan itu dan ia tidak mengenainya.\" Malik berkata; \"Azh Zharb adalah gunung kecil",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1694
			}
		},
		{
			"hadithnumber": 1695,
			"arabicnumber": 1695,
			"text": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari ['Amr bin Sa'ad bin Mu'adz] dari [neneknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai para wanita mukminah, janganlah seseorang dari kalian merasa rendah untuk memberi tetangganya walau hanya tulang betis kambing yang sudah dibakar",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1695
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": 1696,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga Allah melaknat orang-orang Yahudi, mereka dilarang memakan lemak, tapi mereka menjualnya dan memakan hasil penjualnya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1696
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": 1697,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1697
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": 1698,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1698
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": 1699,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa [Umar bin Khattab] memakan roti dengan minyak samin, lalu ia memanggil salah seorang Badui. 'Umar bin Khattab mulai makan dan mengikutkan laki-laki itu dengan suapan piring besar. Umar berkata; \"Sepertinya kamu tidak memiliki makanan.\" Ia menjawab; \"Demi Allah, aku sudah lama tidak makan dengan minyak samin dan tidak pernah mengunyah dengannya semenjak ini dan itu.\" Kemudian Umar berkata; \"Aku tidak akan makan samin hingga orang-orang bisa hidup sejak dari permulaan kehidupan mereka",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1699
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": 1700,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] berkata; \"Aku melihat [Umar bin Khattab] diberi satu sha' kurma, saat itu ia sebagai Amirul Mukminin. Umar pun memakannya hingga memakan kurma yang paling jelek",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1700
			}
		},
		{
			"hadithnumber": 1701,
			"arabicnumber": 1701,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Dinar] dari [Abdullah bin Umar] berkata; \" [Umar bin Khattab] ditanya tentang belalang, dia menjawab; 'Aku benar-benar ingin mempunyai sekeranjang belalang yang bisa kita makan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1701
			}
		},
		{
			"hadithnumber": 1702,
			"arabicnumber": 1702,
			"text": "Telah menceritakan kepadaku dari Malik dari [Muhammad bin 'Amru bin Halhalah] dari [Humaid bin Hasyim bin Khutsaim] berkata; \"Aku duduk bersama Abu Hurairah di daerahnya yaitu 'Aqiq. Lalu datanglah beberapa orang dari penduduk Madinah dengan mengendarai tunggangan dan berhenti di sisinya.\" Humaid berkata; [Abu Hurairah] berkata; \"Pergilah ke ibuku, dan katakan 'Anakmu menyampaikan salam'.\" Orang itu berkata, \"Berilah kami sedikit makan.\" Humaid bin Hasyim berkata; \"Ibunya menaruh tiga potong roti pipih dalam piring besar dan sedikit minyak dan garam. Ia meletakkannya di atas kepalaku, aku lantas membawanya kepada mereka. Ketika aku letakkan di hadapan mereka, serta merta Abu Hurairah bertakbir dan berkata; 'Segala puji bagi Allah yang telah mengenyangkan kita dengan roti setelah kami tidak makan kecuali Al Aswadain; air putih dan kurma.\" Dan orang-orang itu belum makan sama sekali. Ketika mereka pergi, ia berkata; \"Wahai anak saudaraku, berbuat baiklah dengan kambingmu, hapuslah ingusnya, dan harumkan baunya serta shalatlah di sampingnya karena hewan itu adalah salah satu hewan syurga. Demi dzat yang jiwaku berada di tangan-Nya, sungguh hampir-hampir akan datang suatu zaman kepada manusia, yang mana sekelompok kambing lebih disukai pemiliknya daripada rumah Marwan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1702
			}
		},
		{
			"hadithnumber": 1703,
			"arabicnumber": 1703,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Nua'im Wahb bin Kaisan] berkata; \"Disuguhkan makanan kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersama anak tirinya Umar bin Abu Salamah. Rasulullah shallallahu 'alaihi wasallam lalu bersabda kepadanya: 'Sebutlah nama Allah dan makanlah yang dekat denganmu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1703
			}
		},
		{
			"hadithnumber": 1704,
			"arabicnumber": 1704,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] ia berkata, \"Aku mendengar [Al Qasim bin Muhammad] berkata; \"Seseorang datang kepada Abdullah bin Abbas, lalu ia berkata kepadanya; 'Aku memiliki anak yatim, anak itu mempunyai seekor unta. Apakah aku boleh minum dari susu unta itu? ' [Ibnu Abbas] menjawab; 'Jika kamu mau mencarikan untanya saat hilang, mengecat kudisnya dan menempelinya dengan tanah sehingga tertutup lubangnya serta memberinya minum di saat unta itu haus. Maka minumlah susunya tanpa merusak nasl atau menghabiskannya saat memerah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1704
			}
		},
		{
			"hadithnumber": 1705,
			"arabicnumber": 1705,
			"text": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin 'Urwah] dari [Bapaknya] bahwa tidaklah pernah dihidangkan kepadanya makanan, minuman hingga obat yang ia makan atau minum kecuali ia membaca; \"Segala puji bagi Allah yang telah memberi kami petunjuk, memberi kami makan, minum dan segala kenikmatan. Allah Maha Besar. Ya Allah, Nikmat-Mu datang kepada kami sarat dengan kejahatan-kejahatan, namun karenanya kami bisa berpagi dan bersore hari dalam keadaan baik. Maka kami memohon kepada-Mu kesempurnaan dan syukurnya, tidak ada kebaikan kecuali dari-Mu. Tidak ada tuhan selain-Mu, tuhan orang-orang shalih dan Rabb semesta Alam. Segala puji bagi Allah dan tidak ada tuhan yang berhak disembah kecuali Allah, apa yang Allah kehendaki dan tidak ada kekuatan kecuali kepada Allah. Ya Allah, berkahilah kami dengan apa yang telah engkau rizkikan kepada kami, dan lindungilah kami dari api neraka",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1705
			}
		},
		{
			"hadithnumber": 1706,
			"arabicnumber": 1706,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa [Umar bin Khattab] berkata; \"Hati-hatilah dengan daging, sesungguhnya ia memiliki candu seperti halnya khamer",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1706
			}
		},
		{
			"hadithnumber": 1707,
			"arabicnumber": 1707,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa [Umar bin Khattab] bertemu Jabir bin Abdullah yang sedang membawa daging. Lalu Umar bertanya; \"Apa ini?\" Jabir menjawab, \"Wahai Amirul Mukminin, kami sedang berselera untuk makan daging, lalu aku membelinya dengan satu dirham.\" Umar bertanya; 'Apakah salah seorang dari kalian mengisi perutnya dengan mengabaikan tetangga atau anak pamannya? Lalu akan kalian apakan ayat Allah ini: '(Kalian jauhkan kebaikan-kebaikan kalian pada kehidupan dunia sedang kalian bersenang-senang dengannya) ' (Qs. Al Ahqaaf: 20)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1707
			}
		},
		{
			"hadithnumber": 1708,
			"arabicnumber": 1708,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Dinar] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam memakai cincin emas, kemudian Rasulullah shallallahu 'alaihi wasallam berdiri dan melepasnya. Setelah itu beliau bersabda: \"Selamanya aku tidak akan mengenakanya lagi.\" Abdullah bin 'Umar berkata; \"Orang-orang pun melepas cincin-cincin mereka",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1708
			}
		},
		{
			"hadithnumber": 1709,
			"arabicnumber": 1709,
			"text": "Telah menceritakan kepadaku dari Malik dari [Shadaqah bin Yasar] berkata, \"Aku bertanya [Sa'id bin Musayyab] tentang hukum memakai cincin, lalu dia menjawab; \"Pakailah cincin dan kabarkan kepada orang-orang bahwa aku berfatwa demikian",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1709
			}
		},
		{
			"hadithnumber": 1710,
			"arabicnumber": 1710,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar] dari ['Abbad bin Tamim] bahwa [Abu Basyir Al Anshari] mengabarkan kepadanya, bahwa ia pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan. Ia (perawi) berkata; \"Rasulullah shallallahu 'alaihi wasallam kemudian mengirim seorang utusan.\" Abdullah bin Abu Bakar berkata; \"Aku mengira beliau bersabda saat manusia berada di tempat peristirahatan mereka; \"Janganlahlah kalian biarkan gantungan dari jahitan pada lutut unta, atau kalung -perawi ragu-, kecuali dipotong.\" Yahya berkata; \"Aku mendengar Malik berkata; \"Aku melihat bahwa hal itu bagian dari 'Ain",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1710
			}
		}
	]
}