{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"50": "The Evil Eye"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Muhammad bin Abu Umamah bin Sahl bin Hunaif] ia mendengar [Bapaknya] berkata; \"Abu Sahl bin Hunaif mandi di sungai, lalu ia melepaskan jubah yang dikenakannya, sementar 'Amir bin Rabi'ah melihatnya.\" As'ad bin Sahl berkata; \"Sahl adalah seorang pemuda yang putih dan bagus kulitnya. Amir bin Rabi'ah berkata kepadanya; \"Aku tidak pernah melihat kulit yang sebagus ini, bahkan kulit seorang gadis sekalipun.\" Kemudian Sahl terserang demam, dan penyakit tersebut bertambah parah. Rasulullah shallallahu 'alaihi wasallam kemudian didatangi dan dikabarkan kepada beliau 'Sesungguhnya Sahl sakit, ia tidak bisa datang bersama anda, Wahai Rasulullah! ' Rasulullah shallallahu 'alaihi wasallam lalu menemuinya, kemudian Sahl mengabarkan tentang apa yang telah dilakukan Amir terhadapnya. Rasulullah shallallahu 'alaihi wasallam bertanya: 'Kenapa salah seorang dari kalian hendak membunuh saudaranya? Tidaklah (sebaiknya) engkau mendo'akan agar diberkati. Sesungguhnya penyakit 'ain itu benar adanya. Berwudlulah kamu untuknya! ' Amir lantas berwudlu untuk Sahl. Setelah itu Sahl dan Rasulullah shallallahu 'alaihi wasallam berangkat dengan keadaan sehat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1711
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari [Abu Umamah bin Sahl bin Hunaif] berkata; \"Amir bin Rabi'ah melihat Sahl bin Hunaif mandi lalu ia berkata; 'Tidak pernah kulihat seperti (yang kulihat) hari ini, bahkan kulit seorang gadis dalam pingitannya sekalipun.' Kemudian Sahl terkapar di atas tanah, maka dibawalah ia ke hadapan Rasulullah shallallahu 'alaihi wasallam. kemudian kepada Rasulullah dikatakan, \"Wahai Rasulullah, apakah anda mengetahui sesuatu yang menimpa Sahl bin Hunaif? Demi Allah, ia tidak dapat mengangkat kepalanya.\" Beliau bertanya: 'Apakah kalian menduga ada seseorang yang melakukan hal itu kepadanya? ' Mereka menjawab, \"Kami menuduh bahwa yang melakukannya adalah Amir bin Rabi'ah.\" Abu Umamah bin Sahl berkata; \"Kemudian beliau memanggil Amir dan memarahinya. Beliau bertanya: \"Atas dasar apa salah seorang di antara kalian membunuh saudaranya. Tidakkah kalian mendoakannya agar dia diberkati? Bersihkanlah dirimu segera untuknya! ' Lalu Amir mencuci wajah dan kedua tangannya sampai sikunya, kedua lutut dan ujung-ujung kakinya, lalu apa yang ada di dalam sarungnya dalam sebuah bejana. Kemudian air sisa mandinya tersebut disiramkan ke tubuh Sahl. Maka setelah itu, Sahl pun berangkat bersama orang-orang dalam keadaan sehat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1712
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "Telah menceritakan kepadaku dari Malik dari [Humaid bin Qais Al Makki] berkata; \"Suatu ketika dua anak Ja'far bin Abu Thalib dibawa ke hadapan Rasulullah shallallahu 'alaihi wasallam. Beliau bertanya kepada perawatnya: \"Kenapa aku melihat keduanya sangat kurus?\" penjaganya menjawab, \"Wahai Rasulullah, penyakit 'ain telah menyerang mereka berdua dengan cepat. Tidak ada yang menghalangi kami untuk meminta mereka diruqyah, hanya saja kami tidak mengetahui apakah anda menyetujuinya.' Rasulullah shallallahu 'alaihi wasallam lalu bersabda: 'Ruqyahlah mereka, karena sesungguhnya jika ada yang dapat mendahului takdir, niscaya penyakit 'ain-lah yang akan mendahuluinya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1713
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sulaiman bin Yasar] bahwa [Urwah bin Zubair] menceritakan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam memasuki rumah Ummu Salamah, isteri Nabi shallallahu 'alaihi wasallam, sementara di dalam ada seorang bayi sedang menangis. Mereka lalu menceritakan bahwa anak itu terkena penyakit 'Ain.\" 'Urwah berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah kalian tidak meruqyahnya untuk menanggkal 'Ain?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1714
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari ['Atha bin Yasar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang hamba sakit, Allah Ta'ala mengirim kepadanya dua orang Malaikat seraya berfirman; 'Lihatlah apa yang ia katakan terhadap para penjenguknya, jika ia bertahmid dan memuji Allah, ' maka mereka berdua akan mengangkatnya ke hadapan Allah 'azza wajalla -dan Dia Maha Tahu-, lalu Allah berfirman; 'Aku berjanji kepada hamba-Ku, jika Aku mewafatkannya, maka Aku akan memasukkan ia ke surga. Jika Aku menyembuhkannya, niscaya Aku akan mengganti untuknya daging yang lebih baik dari dagingnya, dan darah yang lebih baik dari darahnya. Dan Aku akan ampuni keburukan-keburukan dirinya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1715
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yazid bin Khushaifah] dari [Urwah bin Zubair] ia berkata, \"Aku mendengar [Aisyah] isteri Nabi shallallahu 'alaihi wasallam berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidaklah seorang mukmin mendapatkan musibah sampai duri sekalipun, kecuali akan dikurangi dosa-dosanya, atau 'dihapus darinya kesalahan-kesalahannya'.\" Yazid tidak tahu mana di antara keduanya yang dikatakan Urwah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1716
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "Telah menceritakan kepadaku Malik dari [Muhammad bin Abdullah bin Abu Sha'sha'ah] ia berkata; Aku mendengar [Abu Hubab Sa'id bin Yasar] berkata; Aku mendengar [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang Allah inginkan kebaikan baginya, maka Dia akan memberinya musibah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1717
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam ada seorang laki-laki didatangi kematian, lalu ada seseorang berkata; \"Selamat untuknya, dia meninggal tanpa diuji dengan penyakit.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Celaka kamu! Tidakkah kamu tahu, kalau Allah mengujinya dengan penyakit niscaya dengan penyakit itu akan dilebur keburukan-keburukannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1718
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yazid bin Khushaifah] bahwa ['Amru bin Abdullah bin Ka'b Al Aslami] mengabarkan kepadanya, bahwa [Nafi' bin Jubair] mengabarkan kepadanya, dari [Utsman bin Abu Al 'Ash] bahwasanya ia pernah menemui Rasulullah shallallahu 'alaihi wasallam. Utsman berkata, \"Saat itu aku sedang sakit yang hampir-hampir membuatku meninggal.\" Utsman bin Abu Al 'Ash kembali bercerita, \"Rasulullah shallallahu 'alaihi wasallam lalu bersabda: 'Usaplah ia dengan tangan kananmu tujuh kali, dan bacalah; A'UUDZU BI IZZATILLAHI WA QUDRATIHI MIN SYARRI MA AJIDU (Aku berlindung dengan kemuliaan Allah dan kekuatannya dari kejelekan yang aku dapatkan) '.\" Utsman berkata, \"Lalu hal itu aku baca, hingga Allah pun menghilangkan sakitku. Setelah itu, aku selalu menyarankan kepada keluargaku dan selainnya untuk selalu membacanya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1719
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari ['Urwah bin Zubair] dari [Aisyah] berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam merasa sakit, maka beliau membaca untuk dirinya al mu'awidzat (doa perlindungan) dan meniupkannya. Aisyah berkata; \"Tatkala sakit beliau semakin parah, aku yang membacakan doa-doa itu untuk beliau, lalu kuusapkan di tangan kanannya agar mendapatkan berkah darinya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1720
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari ['Amrah binti Abdurrahman] bahwa [Abu Bakar As Shiddiq] pernah menemui Aisyah yang saat itu sedang sakit, sementara di sisinya ada seorang wanita Yahudi sedang meruqyahnya. Kemudian Abu Bakar berkata; \"Ruqyahlah dia dengan Kitabullah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1721
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "Telah menceritakan kepadaku dari Malik dari dari [Zaid bin Aslam] bahwa pada masa Rasulullah shallallahu 'alaihi wasallam ada seorang laki-laki menderita luka yang mengeluarkan darah. Kemudian dia memanggil dua orang dari Bani Anmar, keduanya lalu menjenguk seraya becerita bahwa Rasulullah shallallahu 'alaihi wasallam pernah bertanya kepada mereka berdua: \"Siapa di antara kalian yang pandai mengobati?\" Mereka bertanya, \"Adakah kebaikan dalam pengobatan ya Rasulullah?\" Zaid beranggapan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dzat yang menurunkan obat adalah Dzat yang menurunkan penyakit",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Isnaad Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1722
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] ia berkata, \"Telah sampai kabar kepadaku bahwa pada masa Rasulullah shallallahu 'alaihi wasallam Sa'd bin Zurarah berobat dengan cara kay karena sakit yang ada di tenggorokannya lalu meninggal",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1723
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berobat dengan cara kay karena sakit pada wajahnya, dan ia juga pernah diruqyah karena sengatan kalajengking",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1724
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin 'Urwah] dari [Fatimah binti Mundzir] berkata, \"Jika seorang wanita yang mengalami demam didatangkan ke hadapan [Asma binti Abu Bakar], maka ia menyuruhnya mengambil air lalu menyiramkannya antara tubuh hingga kerah bajunya. Kemudian ia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami agar mendinginkannya dengan air",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1725
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin 'Urwah] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demam itu dari luapan api neraka maka dinginkanlah dengan air",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1726
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"text": "Telah menceritakan kepadaku Malik dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demam itu dari luapan neraka Jahannam maka padamkanlah dengan air",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1727
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1728
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1729
			}
		}
	]
}