{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"55": "The Oath of Allegiance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"text": "Telah menceritakan kepadaku Malik dari [Abdullah bin Dinar] bahwa [Abdullah bin Umar] berkata; \"Jika kami berbaiat kepada Rasulullah shallallahu 'alaihi wasallam untuk mendengar dan taat, maka beliau akan bertitah kepada kami: 'Semampu kalian",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 55,
				"hadith": 1808
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"text": "Telah menceritakan kepadaku Malik dari [Muhammad bin Al Munkadir] dari [Umaimah binti Ruqaiqah] berkata; \"Aku menemui Rasulullah shallallahu 'alaihi wasallam ketika para wanita membaiatnya untuk Islam. Kami mengatakan; 'Wahai Rasulullah, kami membaiat anda untuk tidak menyekutukan Allah dengan sesuatupun, tidak mencuri, tidak berzina, tidak membunuh anak-anak kami, tidak mendatangi kejahatan yang telah kami lakukan antara kedua tangan dan kaki kami, dan tidak bermaksiat terhadap anda dalam kebaikan.\" Kemudian Rasulullah shallallahu 'alaihi wasallam menambahkan: \"Semampu dan sekuat kalian.\" Umaimah berkata, \"Kami menyahutnya, \"Allah dan Rasul-Nya lebih kami sayangi daripada diri kami. Wahai Rasulullah, kemarilah, kami akan membaiatmu.\" Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku tidak akan bersalaman dengan wanita. Perkataanku terhadap seratus wanita adalah seperti perkataanku terhadap seorang wanita, atau seperti perkataanku untuk satu wanita",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 55,
				"hadith": 1809
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "Telah menceritakan kepadaku Malik dari [Abdullah bin Dinar] bahwa [Abdullah bin Umar] menulis surat kepada Abdul Malik bin Marwan untuk membaiatnya, dia menulis; \"Bismillahhi arrahman arrahim; amma ba'du, untuk Abdullah, Abdul Malik Amirul mukminin, semoga kesejahteraan atasmu, aku memuji Allah untukmu, yang tidak ada ilah yang patut disembah kecuali Dia, dan aku nyatakan untuk mendengar dan taat kepadamu di atas sunnah Allah dan sunnah Rasul-Nya semampuku",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 55,
				"hadith": 1810
			}
		}
	]
}