{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"8": "Prayer in Congregation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 287,
			"arabicnumber": 287,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Shalat berjama'ah lebih utama dua puluh tujuh derajat daripada shalat sendirian",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 288,
			"arabicnumber": 288,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Shalat berjama'ah lebih utama dua puluh lima bagian daripada shalat salah seorang dari kalian sendirian",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 289,
			"arabicnumber": 289,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi dzat yang jiwaku berada di tangan-Nya. Sungguh, saya sangat berkeinginan memerintahkan seseorang untuk mengumpulkan kayu bakar, kemudian aku perintahkan seseorang mengumandangkan adzan, kemudian iqmah dikumandangkan. Setelah itu aku perintahkan seseorang untuk menjadi imam bagi manusia, sementara aku pergi menuju beberapa laki-laki, sehingga aku bisa membakar rumah-rumah mereka. Demi dzat yang jiwaku berada di tangan-Nya, kalau saja salah seorang dari mereka tahu bahwa mereka akan mendapatkan tulang kambing yang gemuk (banyak sisa dagingnya), atau dua tulang rusuk yang enak, niscaya dia akan mengikuti shalat Isya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 290,
			"arabicnumber": 290,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Nadlr] mantan budak Umar bin Ubaidullah, dari [Busr bin Sa'id] dari [Zaid bin Tsabit] berkata; \"Sebaik-baik shalat kalian adalah yang kalian lakukan di rumah, kecuali shalat wajib",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 291,
			"arabicnumber": 291,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdurrahman bin Harmalah Al-Aslami] dari [Sa'id bin Musayyab] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Pembeda) antara kita dengan orang munafik adalah menghadiri shalat isya dan subuh. Mereka tidak bisa melaksanakannya.\" atau dengan lafad lain yang semisal",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 292,
			"arabicnumber": 292,
			"text": "Telah menceritakan kepadaku dari Malik dari [Sumayya] budak Abu Bakar bin Abdurrahman, dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika seorang laki-laki sedang berjalan di sebuah jalan, tiba-tiba ia mendapatkan duri, lalu ia ambil dan menyingkirkannya. Maka Allah berterima kasih padanya dan mengampuni dosa-dosanya\". Beliau bersabda lagi: \"Mati syahid itu ada empat macam: orang yang mati karena wabah tha'un, orang yang mati karena sakit perut, orang yang mati karena tenggelam, orang yang mati karena reruntuhan dan orang yang mati karena berperang di jalan Allah.\" Beliau lalu melanjutkan sabdanya: \"Seandainya manusia mengetahui pahala yang ada pada adzan dan shaf pertama, lalu mereka tidak bisa mendapatkannya kecuali dengan mengundi, niscaya mereka akan berebut undian. Seandainya mereka tahu pahala bersegera dalam menghadiri shalat berjama'ah, niscaya mereka akan berlomba-lomba menujunya. Dan seandainya mereka tahu pahala shalat isya dan subuh, niscaya mereka akan mendatanginya walau dengan merangkak",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 293,
			"arabicnumber": 293,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Abu Bakar bin Sulaiman bin Abu Hatsmah], bahwa [Umar bin Khatthab] pernah kehilangan (tidak melihat) Sulaiman bin Abu Hatsmah dalam shalat subuh. Maka pada gai menjelang siang Umar bin Khatthab pagi menuju pasar, sementara tempat tinggal Sulaiman terletak antara pasar dan Masjid Nabawi. Umar lalu bertemu dengan Asy Syifa, ibu Sulaiman. Umar lalu berkata, \"Saya tidak melihat Sulaiman saat shalat subuh?\" Wanita itu menjawab, \"Dia telah shalat semalaman, hingga dia terlelap tidur.\" Umar berkata; \"Mengikuti shalat subuh berjama'ah lebih saya sukai daripada shalat semalam suntuk",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 294,
			"arabicnumber": 294,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Muhammad bin Ibrahim] dari [Abdurrahman bin Abu 'Amrah Al Anshari] dia berkata; \" [Utsman bin Affan] mendatangi shalat Isya, namun ia melihat orang-orang yang hadir hanya sedikit sekali, maka ia pun berbaring di tepi masjid menunggu agar yang datang lebih banyak. Ibnu Abu 'Amrah lalu menghampirinya dan duduk di dekatnya. Abu Amrah lalu bertanya diri Utsman, lalu Utsman pun mengebarkan kepadanya. Lalu Amrah bertanya kembali, \"Apa saja yang kamu ketahui dari al qur'an? ' Utsman kembali menagabarkan kepadanya. Setelah itu Utsman berkata kepadanya, \"Barangsiapa mengikuti shalat isya seakan dia telah shalat separuh malam. Barangsiapa mengikuti shalat subuh, seakan-akan dia telah shalat seluruh malam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 294
			}
		},
		{
			"hadithnumber": 295,
			"arabicnumber": 295,
			"text": "Telah menceritakan kepadaku dari Yahya dari Malik dari [Zaid bin Aslam] dari seorang laki-laki dari Bani Ad Dil yang bernama [Busr bin Mihjan] dari bapaknya [Mihjan], Bahwasanya ia pernah berada dalam majlis Rasulullah shallallahu 'alaihi wasallam. Lalu dikumandangkanlah adzan shalat, Rasulullah shallallahu 'alaihi wasallam kemudian berdiri mengerjakan shalat dan kembali. Sedangkan Mihjan masih berada di majlis dan tidak shalat bersamanya. Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apa yang menghalangimu shalat bersama orang-orang? Bukankah kamu seorang muslim?\" Mihjan menjawab, \"Benar wahai Rasulullah! Tapi saya sudah shalat bersama keluargaku.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kamu datang ke masjid, maka shalatlah bersama orang-orang walau sudah shalat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 295
			}
		},
		{
			"hadithnumber": 296,
			"arabicnumber": 296,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'], bahwa ada seorang laki-laki bertanya kepada Abdullah bin Umar, \"Saya sudah shalat di rumah, lalu saya mendapati shalat bersama imam. Apakah saya harus shalat lagi bersama mereka?\" [Abdullah bin 'Umar] menjawab, \"Ya.\" Laki-laki itu berkata, \"Mana di antara keduanya yang menggugurkan kewajibanku?\" Ibnu Umar menjawab, \"Apakah itu urusanmu? Yang demikian itu adalah urusan Allah. Dia yang berhak dalam menentukannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 296
			}
		},
		{
			"hadithnumber": 297,
			"arabicnumber": 297,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa ada seorang laki-laki yang bertanya kepada [Sa'id bin Musayyab]; \"Saya sudah shalat di rumahku. Kemudian saya mendatangi masjid, maka saya mendapati imam sedang shalat. Apakah saya harus shalat bersamanya?\" Lalu Sa'id menjawab; \"Ya\" laki-laki itu bertanya; \"Mana dari keduanya yang menggugurkan kewajibanku?\" Sa'id menjawab, \"Apakah itu hak kamu? Itu adalah hak Allah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 297
			}
		},
		{
			"hadithnumber": 298,
			"arabicnumber": 298,
			"text": "Telah menceritakan kepadaku dari Malik dari [Afif As-Sahmi] dari [seorang laki-laki dari Bani Asad] dia bertanya kepada [Abu Ayub Al Anshari], \"Saya sudah shalat di rumahku, lalu saya mendatangi masjid dan saya mendapati imam sedang shalat. Maka apakah saya harus shalat lagi bersamanya?\" Abu Ayub menjawab; \"Ya, shalatlah bersamanya. Siapa saja yang mengerjakan itu, maka ia akan mendapatkan pahala jama'ah, atau seperti pahala jama'ah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 298
			}
		},
		{
			"hadithnumber": 299,
			"arabicnumber": 299,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata; \"Barangsiapa telah melaksanakan shalat maghrib atau subuh, lalu dia mendapatkan imam sedang melaksanakannya, maka janganlah ia mengulanginya.\" Malik berkata; \"Saya berpendapat: tidak masalah shalat bersama imam bagi siapa yang telah shalat, kecuali shalat maghrib. Karena jika dia mengulanginya, maka akan menjadi genap",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 299
			}
		},
		{
			"hadithnumber": 300,
			"arabicnumber": 300,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian mengimami orang-orang, maka hendaklah ia ringankan. Karena di antara mereka terdapat orang lemah, sakit dan tua. Jika salah seorang dari kalian shalat sendirian, maka ia boleh memanjangkannya sekehendaknya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 300
			}
		},
		{
			"hadithnumber": 301,
			"arabicnumber": 301,
			"text": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dia berkata; \"Saya berdiri di belakang [Abdullah bin Umar] dalam suatu shalat. Sementara tidak ada seorang pun yang shalat di belakangnya selain aku, lalu Abdullah menarikku dengan tangannya dan menjadikanku sejajar dengannya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 301
			}
		},
		{
			"hadithnumber": 302,
			"arabicnumber": 302,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id], bahwa ada seorang laki-laki mengimami orang-orang di 'Aqiq. Lalu [Umar bin Abdul Aziz] mengirimkan utusan kepadanya dan melarangnya menjadi imam. Malik berkata, \"'Umar bin Abdul Aziz melarangnya menjadi imam karena laki-laki tersebut tidak diketahui siapa bapaknya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 302
			}
		},
		{
			"hadithnumber": 303,
			"arabicnumber": 303,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam menunggang kuda, lalu kuda beliau tersungkur hingga lengan kanannya retak. Beliau kemudian mengerjakan shalat dengan duduk, dan shalat kami mengikutinya dengan duduk. Kamipun shalat di belakang beliau dengan duduk. Selesai shalat beliau bersabda: \"Dijadikannya seorang imam adalah untuk diikuti. Jika dia shalat dengan berdiri, shalatlah dengan berdiri. Jika dia rukuk, maka ikutlah rukuk. Jika dia bangkit, maka ikutlah bangkit. Jika dia membaca; SAMI'A ALLAHU LIMAN HAMIDAH (Allah Maha Mendengar terhadap orang yang memuji-Nya), maka ucapkan; RABBANAA WALAKAL HAMDU (Wahai Rab kami hanya untuk-Mu segala pujian) . Jika dia shalat dengan duduk, maka shalatlah dengan duduk semuanya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 303
			}
		},
		{
			"hadithnumber": 304,
			"arabicnumber": 304,
			"text": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam shalat ketika sakit. Beliau shalat dengan duduk, sementara orang-orang yang shalat dibelakangnya shalat sambil berdiri. Kemudian beliau memberi isyarat agar mereka shalat sambil duduk, setelah selesai shalat beliau bersabda: \"Hanyasanya dijadikannya imam adalah untuk diikuti. Jika dia rukuk, maka rukuklah bersamanya. Jika dia bangkit, maka ikutlah bangkit bersamanya. Dan jika dia shalat dengan duduk, maka shalatlah dengan duduk",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 304
			}
		},
		{
			"hadithnumber": 305,
			"arabicnumber": 305,
			"text": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya], bahwa Rasulullah shallallahu 'alaihi wasallam keluar untuk melaksanakan shalat ketika sedang sakit. Saat datang, beliau mendapati Abu Bakar sedang shalat mengimami orang-orang, maka Abu Bakar pun mundur ke belakang. Tetapi Rasulullah shallallahu 'alaihi wasallam berisyarat kepadanya, agar tetap pada posisinya.\" Rasulullah shallallahu 'alaihi wasallam kemudian duduk di sebelah Abu Bakar. Abu Bakar shalat dengan mengikuti shalat Rasulullah shallallahu 'alaihi wasallam, sedang beliau duduk. Dan orang-orang mengikuti shalat Abu Bakar",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 305
			}
		},
		{
			"hadithnumber": 306,
			"arabicnumber": 306,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Isma'il bin Muhammad bin Sa'd bin Abu Waqqash] dari [mantan budak 'Amru bin Al-Ash atau Abdullah bin 'Amru bin Al Ash] dari [Abdullah bin 'Amr bin Al Ash], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Shalat salah seorang dari kalian dengan duduk seperti separuh shalat berdiri",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 306
			}
		},
		{
			"hadithnumber": 307,
			"arabicnumber": 307,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Abdullah bin 'Amru bin Al Ash] berkata; \"Tatkala kami datang di Madinah, kami terkena wabah penyakit karena panas Madinah yang menyengat. Rasulullah shallallahu 'alaihi wasallam kemudian keluar menemui orang-orang, sementara orang-orang sedang mengerjakan shalat nafilah dengan duduk. Rasulullah shallallahu 'alaihi wasallam bersabda: 'Shalatnya seorang yang dikerjakan dengan duduk, seperti nilainya setengah dari shalatnya seseorang yang dikerjakan dengan berdiri",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 307
			}
		},
		{
			"hadithnumber": 308,
			"arabicnumber": 308,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [As-Sa`ib bin Yazid] dari [Abdul Muthallib bin Abu Wada'ah As-Sahmi] dari [Hafshah] isteri Nabi shallallahu 'alaihi wasallam, dia berkata; \"Saya tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam shalat sunnah dengan duduk sama sekali, hingga setahun sebelum beliau meninggal. Beliau shalat sunnah dengan duduk dan membaca surat dengan tartil hingga menjadi sangat lama, lebih lama dari biasanya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 308
			}
		},
		{
			"hadithnumber": 309,
			"arabicnumber": 309,
			"text": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, dia mengabarkan kepadanya, bahwa dia tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam shalat malam dengan duduk sama sekali, kecuali saat usianya telah tua. Beliau membaca dengan duduk, hingga ketika akan rukuk beliau berdiri dan membaca ayat antara tiga samapi atau empat puluh ayat, setelah itu baru beliau rukuk",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 309
			}
		},
		{
			"hadithnumber": 310,
			"arabicnumber": 310,
			"text": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Yazid Al-Madani] dan dari [Abu Nadlr] dari [Abu Salamah bin Abdurrahman] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, bahwasanya Rasulullah shallallahu 'alaihi wasallam shalat dan membaca dengan duduk. Jika masih tersisa dari bacaanya sekitar tiga puluh atau empat puluh ayat, beliau berdiri dan membacanya dengan berdiri. Setelah itu beliau rukuk dan sujud. Lalu pada rakaat kedua beliau juga mengerjakannya seperti itu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 310
			}
		},
		{
			"hadithnumber": 311,
			"arabicnumber": 311,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 311
			}
		},
		{
			"hadithnumber": 312,
			"arabicnumber": 312,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] dari [Al-Qa'qa' bin Hakim] dari [Abu Yunus] mantan budak Aisyah Ummul Mukminin, dia berkata; \" [Aisyah] menyuruhku menulis mushaf untuknya, kemudian ia berkata, \"Apabila kamu telah sampai pada ayat ini, maka kabarkanlah saya: '(Peliharalah semua shalat(mu), dan (peliharalah) shalat wusthaa. Berdirilah untuk Allah (dalam shalatmu) dengan khusyu') ' (Qs. Al Baqarah: 238) Tatkala saya sampai pada ayat itu, saya pun menyampaikan hal itu kepdanya. Lalu ia mendiktekan kepadaku; '(Peliharalah semua shalat(mu), dan (peliharalah) shalat wusthaa dan shalat asar. Kerjakanlah shalat dengan khusyu' karena Allah) ' Aisyah lantas berkata, \"Saya mendengarnya dari Rasulullah shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 312
			}
		},
		{
			"hadithnumber": 313,
			"arabicnumber": 313,
			"text": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari ['Amru bin Rafi'] dia berkata; \"Saya menulis mushaf untuk [Hafshah] Ummul Mukminin. Dia berkata; \"Apabila kamu telah sampai pada ayat ini, maka beritahukanlah kepadaku: '(Peliharalah semua shalat(mu), dan (peliharalah) shalat wusthaa. Berdirilah untuk Allah (dalam shalatmu) dengan khusyu) ' (As. Al Baqarah: 238) Tatkala saya sampai pada ayat tersebut, maka saya pun memberitahukan kepadanya. Lalu ia mendiktekan kepadaku: '(Peliharalah semua shalat(mu), dan (peliharalah) shalat wusthaa dan shalat asar dan kerjakanlah shalat dengan khusyu' karena Allah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 313
			}
		},
		{
			"hadithnumber": 314,
			"arabicnumber": 314,
			"text": "Telah menceritakan kepadaku dari Malik dari [Daud bin Al Hushain] dari [Ibnu Yarbu' Al Makhzumi] dia berkata, \"Saya mendengar [Zaid bin Tsabit] berkata, 'Shalat wustha adalah shalat zhuhur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 314
			}
		},
		{
			"hadithnumber": 315,
			"arabicnumber": 315,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 315
			}
		},
		{
			"hadithnumber": 316,
			"arabicnumber": 316,
			"text": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] dari [Umar bin Abu Salamah], Bahwasanya ia pernah melihat Rasulullah shallallahu 'alaihi wasallam shalat di rumah Ummu Salamah dengan memakai sehelai pakaian, beliau menyelimutkan kain tersebut ke tubuh dan meletakkan kedua ujungnya pada kedua pendaknya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 316
			}
		},
		{
			"hadithnumber": 317,
			"arabicnumber": 317,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dari [Abu Hurairah], bahwa ada seseorang bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang shalat memakai sehelai pakaian. Rasulullah shallallahu 'alaihi wasallam menjawab: \"Apakah setiap dari kalian memiliki dua pakaian?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 317
			}
		},
		{
			"hadithnumber": 318,
			"arabicnumber": 318,
			"text": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dia berkata, \" [Abu Hurairah] pernah ditanya, 'Apakah boleh seorang laki-laki shalat dengan memakai sehelai pakaian? ' dia menjawab, \"Ya.\" Ditanyakan kepadanya, \"Apakah kamu juga melakukannya?\" Dia menjawab, \"Ya. Saya shalat memakai sehelai pakaian. Bajuku yang lain tergantung di atas jemuran",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 318
			}
		},
		{
			"hadithnumber": 319,
			"arabicnumber": 319,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 319
			}
		},
		{
			"hadithnumber": 320,
			"arabicnumber": 320,
			"text": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] bahwa [Muhammad bin 'Amru bin Hazm] shalat dengan satu baju",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 320
			}
		},
		{
			"hadithnumber": 321,
			"arabicnumber": 321,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 321
			}
		},
		{
			"hadithnumber": 322,
			"arabicnumber": 322,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 322
			}
		},
		{
			"hadithnumber": 323,
			"arabicnumber": 323,
			"text": "Telah menceritakan kepadaku dari Malik dari [Muhammad bin Zaid bin Qunfudz] dari [Ibunya], Bahwasanya ia pernah bertanya kepada [Ummu Salamah], isteri Nabi shallallahu 'alaihi wasallam tentang baju yang dikenakan wanita dalam shalat? dia menjawab; \"Dia shalat dengan kerudung, dan baju yang menutupi telapak kakinya",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 323
			}
		},
		{
			"hadithnumber": 324,
			"arabicnumber": 324,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 324
			}
		},
		{
			"hadithnumber": 325,
			"arabicnumber": 325,
			"text": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya], bahwa ada seorang wanita yang meminta fatwa kepadanya, wanita itu mengatakan, \"Ikatan sarungku membuat sulit diriku. Apakah saya boleh shalat hanya dengan memakai baju dan kerudung?\" dia menjawab, \"Ya, jika baju tersebut menutupi seluruh tubuh",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 325
			}
		}
	]
}