{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"3": "The Book of Menstruation and Istihadah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 369,
			"arabicnumber": 369,
			"text": "Enes (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Yahudiler hayız gören kadınlarla birlikte yiyip içmezler ve evlerinde bile birlikte olmazlardı. Bu durumu Rasûlüllah (sallallahü aleyhi ve sellem)’e sordular da, bunun üzerine Allah, Bakara sûresi 222. ayetini indirdi. (Sana kadınların ay halleri hakkında soruyorlar. De ki: O bir sıkıntı, kirlilik, ve rahatsızlık halidir. Bu yüzden ay hali sırasında kadınların kadınlıklarından yararlanmayın, uzak durun ve onlar temizleninceye kadar kendileriyle cinsel ilişkide bulunmayın. Temizlendiklerinde ise Allah’ın buyurduğu şekilde onlara yaklaşın. Doğrusu Allah, pişmanlıkla kendisine yönelenleri ve tertemiz olanları sever.) Sonra, Rasûlüllah (sallallahü aleyhi ve sellem); Müslümanların hayız gören hanımlarıyla yiyip içmelerini ve evlerde birlikte kalmalarını ve cinsel ilişki dışında her şeyi yapmalarını emretti. Bunun üzerine Yahudiler: Rasûlü, bize aykırı davranmadık hiçbir şey bırakmadı) dediler. b. Hudayr ve Abbad b. Bişr, kalkıp bunu Rasûlüllah (sallallahü aleyhi ve sellem)’e bildirdiler ve: günlerinde hanımlarımızla cinsel ilişkide bulunacak mıyız?) dediler. Rasûlüllah (sallallahü aleyhi ve sellem), bu söz üzerine bir anda değişti, öyle ki kızdığını zannettik. Useyd b. hudayr ve Abbad b. Bişr kalkıp gittiler. Bu arada Rasûlüllah (sallallahü aleyhi ve sellem)’e hediye olarak süt getirilmişti. Onların arkasından adam gönderip çağırdı ve onlara süt içirdi. Böylece Rasûlüllah (sallallahü aleyhi ve sellem)’in onlara kızmadığı anlaşılmış oldu. (Buhârî, Hayz: 1; Müslim, Hayz: 3)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 21
			}
		}
	]
}