{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"5": "The Book of Salah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 450,
			"arabicnumber": 450,
			"text": "Enes b. Mâlik (radıyallahü anh)’ten rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: katırdan küçük eşekten büyük bir binek getirildi, adımını gözünün görebildiği yere atıyordu. Cibril (aleyhisselâm) ile birlikte bindim ve biraz yol aldık, Cibril dedi ki: ve namaz kıl.) Ben de aynen yaptım. Cibril şöyle dedi: kıldığın yer neresidir biliyor musun? Taybe (Medine’de) namaz kıldın, Oraya hicret edilecektir.) Sonra tekrar: ve namaz kıl) dedi. Ben de inip namaz kıldım. Bunun üzerine Cibril dedi ki: namaz kıldığını biliyor musun? Allah’ın, Mûsâ (aleyhisselâm) ile konuştuğu Tur-ı Sina’da namaz kıldın. Daha sonra tekrar, (İn ve namaz kıl) dedi. İndim ve namaz kıldım. Yine dedi ki: kıldığın yer neresidir biliyor musun? Îsa (aleyhisselâm)’ın doğduğu yer olan Beyti Lahm’da kıldın.) Sonra Beyti Makdis’e girdim, tüm Peygamberler (sallallahü aleyhi ve sellem) yanımda toplandı. Cibril beni öne geçirdi, onlara imamlık yaptım. Sonra en yakın sema olan dünya semasına çıkarıldım, orada Adem (aleyhisselâm) vardı. Sonra ikinci semaya çıkarıldım, orada teyze çocukları olan Îsa ve Yahya (aleyhisselâm) vardı. Sonra Üçüncü semaya çıktım, orada da Yusuf (aleyhisselâm)’ı gördüm. Sonra dördüncü semaya çıkarıldım, orada Harun (aleyhisselâm) vardı. Sonra beşinci semaya yükseltildim, orada da İdris (aleyhisselâm) vardı. Sonra altıncı semaya yükseltildim, orada da Mûsâ (aleyhisselâm) vardı. Sonra yedinci semaya yükseltildim, orada da İbrahim (aleyhisselâm) vardı. Sonra yedi semanın yukarısına çıkarılıp Sidret-ül müntehaya ulaştım, orada Beni bulut gibi bir şey kaplayınca secdeye kapandım ve bana şöyle denildi: kat semayı ve arzı yarattığım gün Sana ve ümmetine elli vakit namazı farz kıldım, Sen ve ümmetin o namazı kılın.) Hemen İbrahim (aleyhisselâm)’a vardım, bana bir şey sormadı sonra Mûsâ’nın yanına varınca; (Allah sana ve ümmetine ne kadar namaz farz kıldı?) dedi. Ben de: vakit namaz farz kıldı) dedim. Mûsâ da dedi ki: ve ümmetin bu elli vakti eda etmeye dayanamazsınız, Rabbine dön bunu hafifletmesini iste.) Ben de, Rabbime döndüm on vakit indirdi. Sonra Mûsâ’ya tekrar gelince, tekrar dönüp bu yükün hafifletilmesini istememi emretti. Ben de tekrar döndüm on daha indirdi. Sonra da beş vakte indirildi. Mûsâ (aleyhisselâm), tekrar: Rabbinden hafifletilmesini iste, çünkü Allah İsrailoğullarına günde iki vakit namaz farz kıldı onu bile eda edemediler) dedi. Tekrar Rabbime döndüm, hafifletmesini istedim o da şöyle buyurdu: ve yeri yarattığım gün sana ve ümmetine elli vakit namaz farz kıldım bu beş vakit; elli vakit yerindedir. Sen ve Ümmetin bu beş vakti eda edin.) Böyle olunca bu işin Allah tarafından kesinleştiğini anladım. Mûsâ (aleyhisselâm)’a döndüm. O da yine: dön) dediğinde beş vaktin kesinleştiğini ve hafifletilmeyeceğini bildiğim için tekrar dönmedim.) (Müslim, İman: 74; İbn Mâce, İkametü’s Salat; 194)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 3
			}
		}
	]
}