{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"7": "The Book of the Adhan (The Call to Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 632,
			"arabicnumber": 632,
			"text": "Abdullah b. Muhayriz (radıyallahü anh) anlatıyor. Ebû Mahzüre’nin yanında büyümüş bir yetimdim. Beni Şam’a gönderirken kendisine: Ben Şam’a gidiyorum, oradaki insanların bana senin nasıl ezan okuduğunu sormalarından korkarım dedim. Bunun üzerine bana şunları anlattı: Rasûlüllah (sallallahü aleyhi ve sellem), Huneyn savaşından dönerken, biz de bir topluluk olarak Huneyn yolunda ilerliyorduk, yolda Rasûlüllah (sallallahü aleyhi ve sellem) bizimle karşılaşmıştı. Müezzini O’nun yanında namaz için ezan okumaya başlamıştı. Müezzinin sesini işitince, onun okumasıyla alay ederek kendi kendimize onun söylediklerini tekrar etmeye başladık. Rasûlüllah (sallallahü aleyhi ve sellem), bizim sesimizi işitince bizi yanına çağırtmıştı. Huzuruna varınca: duyduğum kimse hanginizdi?) diye sordu: Arkadaşlarım beni göstermişlerdi, bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) onları göndererek beni yanına alıkoymuştu. Sonra: ezan oku) buyurdu. Hemen ayağa kalktım ve Rasûlüllah (sallallahü aleyhi ve sellem) bana ezanı şöyle öğretti. O kendisi (ezan lafızlarını) söylüyor bana da aynen şöyle söyle diyordu: ekber, Allahü ekber, Allahü ekber, Allahü ekber en lâ ilâhe illallâh, Eşhedü enlâ ilâhe illallâh enne Muhammeden Rasûlüllâh, Eşhedü enne Muhammeden Rasûlüllâh gelince şöyle buyurdu: ve sesini alçaltarak tekrar et en lâ ilâhe illallâh, Eşhedü en lâ ilâhe illallâh enne muhammaden Rasûlüllâh, Eşhedü enne Muhammeden Rasûlüllâh alessalâh, Hayye alessalâh alel felâh, Hayye alel felâh ekber Allahü ekber Lâ ilâhe illallâh) ezanı okuduktan sonra beni çağırdı ve içinde bir miktar gümüş olan bir kese verdi. Ben de: Allah’ın Rasûlü! Bana Mekke’de ezan okumamı emret) dedim. O da: bu işle görevlendirdim) buyurdu. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem)’in Mekke Valisi olan Attab b. Esid’e gelerek, Rasûlüllah (sallallahü aleyhi ve sellem)’in emriyle onunla birlikte ezan okudum. (İbn Mâce, Ezan: 2; Dârimi, Salat: 6)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 7
			}
		}
	]
}