{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"8": "The Book of the Masjids"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 731,
			"arabicnumber": 731,
			"text": "Abdullah b. Ka’b (radıyallahü anh)’tan rivâyete göre, şöyle demiştir: Ka’b b. Mâlik’in Tebük seferine katılamayışını anlatırken şöyle söylediğini işittim: Rasûlüllah (sallallahü aleyhi ve sellem) bir sabah Tebük gazvesinden dönüp Medine’ye geldi. Bir savaştan dönünce önce mescide girer iki rekat namaz kılar sonra insanların dertlerini dinlemek için otururdu. Yine aynı şekilde yapıp oturunca: Tebük seferine katılmayanlar özür dileyip yemin etmeye başladılar. Bunlar seksenden fazla idiler. Rasûlüllah (sallallahü aleyhi ve sellem) bunların söyledikleri özürlerini ve biatlarını kabul etti, onlar için istiğfar etti, onların iç yüzlerini de Allah’a havale etti. Bu sırada ben de geldim ve selâm verdim, Rasûlüllah (sallallahü aleyhi ve sellem) bana gazablı bir şekilde tebessüm etti ve şöyle dedi: Ben de gelip önüne oturdum, bana dedi ki: savaşa katılmaktan geri bırakan sebep Nedir? Sen Akabe’de biat etmemiş miydin?) Ben de: Allah’ın Rasûlü! Vallahi dünyada sizden başka kimin yanına otursam özür beyan ederek O’nun gazabından kurtulacağımı tahmin ederim. Çünkü ikna kabiliyetim çok fazladır. Fakat, Allah’a yemin olsun ki; şunu iyice anladım; bugün beni affetmeniz için yalan söylesem Allah benim yalan söylediğimi sana bildirerek bana karşı senin kızgınlığını artırır. Eğer size doğruyu söylesem yine bana kızarsınız ama doğruyu söylemekle Allah’ın beni affadeceğini umarım. Vallahi ben sizinle savaşa katılmayıp geri kaldığım günlerdeki kadar hiçbir vakit sağlam ve bolluk içerisinde olmadım.) Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): bu doğru söyledi dedi. Kalk ve; Allah senin hakkında bir hüküm verinceye kadar bekle) dedi. Bende belli bir süre bekledim. Bu hadis buradakinden daha uzuncadır. (Buhârî, Cihad ve Siyer: 197; Müslim, Salat-ül Müsafirin: 12)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 44
			}
		}
	]
}