{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"6": "Chapters Regarding Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "حدثنا نصر بن علي الجهضمي، أنبأنا وهب بن جرير، حدثنا أبي، عن محمد بن إسحاق، حدثني حسين بن عبد الله، عن عكرمة، عن ابن عباس، قال لما أرادوا أن يحفروا، لرسول الله ـ صلى الله عليه وسلم ـ بعثوا إلى أبي عبيدة بن الجراح وكان يضرح كضريح أهل مكة وبعثوا إلى أبي طلحة وكان هو الذي يحفر لأهل المدينة وكان يلحد فبعثوا إليهما رسولين وقالوا اللهم خر لرسولك ‏.‏ فوجدوا أبا طلحة فجيء به ولم يوجد أبو عبيدة فلحد لرسول الله ـ صلى الله عليه وسلم ـ ‏.‏ قال فلما فرغوا من جهازه يوم الثلاثاء وضع على سريره في بيته ‏.‏ ثم دخل الناس على رسول الله ـ صلى الله عليه وسلم ـ أرسالا ‏.‏ يصلون عليه حتى إذا فرغوا أدخلوا النساء حتى إذا فرغوا أدخلوا الصبيان ولم يؤم الناس على رسول الله ـ صلى الله عليه وسلم ـ أحد ‏.‏ لقد اختلف المسلمون في المكان الذي يحفر له فقال قائلون يدفن في مسجده ‏.‏ وقال قائلون يدفن مع أصحابه ‏.‏ فقال أبو بكر إني سمعت رسول الله ـ صلى الله عليه وسلم ـ يقول ‏ \"‏ ما قبض نبي إلا دفن حيث يقبض ‏\"‏ ‏.‏ قال فرفعوا فراش رسول الله ـ صلى الله عليه وسلم ـ الذي توفي عليه فحفروا له ثم دفن رسول الله ـ صلى الله عليه وسلم ـ وسط الليل من ليلة الأربعاء ‏.‏ ونزل في حفرته علي بن أبي طالب والفضل وقثم ابنا العباس وشقران مولى رسول الله ـ صلى الله عليه وسلم ـ ‏.‏ وقال أوس بن خولي وهو أبو ليلى لعلي بن أبي طالب أنشدك الله وحظنا من رسول الله ـ صلى الله عليه وسلم ـ ‏.‏ قال له علي انزل ‏.‏ وكان شقران مولاه أخذ قطيفة كان رسول الله ـ صلى الله عليه وسلم ـ يلبسها فدفنها في القبر وقال والله لا يلبسها أحد بعدك أبدا ‏.‏ فدفنت مع رسول الله ـ صلى الله عليه وسلم ـ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 196
			}
		}
	]
}