{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"25": "Chapters on Hajj Rituals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3074,
			"arabicnumber": 3074,
			"text": "حدثنا هشام بن عمار، حدثنا حاتم بن إسماعيل، حدثنا جعفر بن محمد، عن أبيه، قال دخلنا على جابر بن عبد الله فلما انتهينا إليه سأل عن القوم، حتى انتهى إلى فقلت أنا محمد بن علي بن الحسين، ‏.‏ فأهوى بيده إلى رأسي فحل زري الأعلى ثم حل زري الأسفل ثم وضع كفه بين ثديى وأنا يومئذ غلام شاب فقال مرحبا بك سل عما شئت ‏.‏ فسألته وهو أعمى فجاء وقت الصلاة فقام في نساجة ملتحفا بها كلما وضعها على منكبيه رجع طرفاها إليه من صغرها ورداؤه إلى جانبه على المشجب فصلى بنا فقلت أخبرنا عن حجة رسول الله ـ صلى الله عليه وسلم ـ ‏.‏ فقال بيده فعقد تسعا وقال إن رسول الله ـ صلى الله عليه وسلم ـ مكث تسع سنين لم يحج فأذن في الناس في العاشرة أن رسول الله ـ صلى الله عليه وسلم ـ حاج فقدم المدينة بشر كثير كلهم يلتمس أن يأتم برسول الله ـ صلى الله عليه وسلم ـ ويعمل بمثل عمله فخرج وخرجنا معه فأتينا ذا الحليفة فولدت أسماء بنت عميس محمد بن أبي بكر فأرسلت إلى رسول الله ـ صلى الله عليه وسلم ـ كيف أصنع قال ‏\"‏ اغتسلي واستثفري بثوب وأحرمي ‏\"‏ ‏.‏ فصلى رسول الله ـ صلى الله عليه وسلم ـ في المسجد ثم ركب القصواء ‏.‏ حتى إذا استوت به ناقته على البيداء - قال جابر نظرت إلى مد بصري من بين يديه بين راكب وماش وعن يمينه مثل ذلك وعن يساره مثل ذلك ومن خلفه مثل ذلك ورسول الله ـ صلى الله عليه وسلم ـ بين أظهرنا وعليه ينزل القرآن وهو يعرف تأويله ما عمل من شىء عملنا به فأهل بالتوحيد ‏\"‏ لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك ‏\"‏ ‏.‏ وأهل الناس بهذا الذي يهلون به فلم يرد رسول الله ـ صلى الله عليه وسلم ـ عليهم شيئا منه ولزم رسول الله ـ صلى الله عليه وسلم ـ تلبيته ‏.‏ قال جابر لسنا ننوي إلا الحج لسنا نعرف العمرة حتى إذا أتينا البيت معه استلم الركن فرمل ثلاثا ومشى أربعا ثم قام إلى مقام إبراهيم فقال ‏\"‏ ‏{واتخذوا من مقام إبراهيم مصلى}‏ ‏\"‏ ‏.‏ فجعل المقام بينه وبين البيت فكان أبي يقول - ولا أعلمه إلا ذكره عن النبي ـ صلى الله عليه وسلم ـ - إنه كان يقرأ في الركعتين ‏{قل يا أيها الكافرون}‏ و ‏{قل هو الله أحد }‏ ‏.‏ ثم رجع إلى البيت فاستلم الركن ثم خرج من الباب إلى الصفا حتى إذا دنا من الصفا قرأ ‏\"‏ ‏{إن الصفا والمروة من شعائر الله ‏)‏ ‏.‏ نبدأ بما بدأ الله به ‏\"‏ ‏.‏ فبدأ بالصفا ‏.‏ فرقي عليه حتى رأى البيت فكبر الله وهلله وحمده وقال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شىء قدير لا إله إلا الله وحده لا شريك له أنجز وعده ونصر عبده وهزم الأحزاب وحده ‏\"‏ ‏.‏ ثم دعا بين ذلك وقال مثل هذا ثلاث مرات ثم نزل إلى المروة فمشى حتى إذا انصبت قدماه رمل في بطن الوادي حتى إذا صعدتا - يعني قدماه - مشى حتى أتى المروة ففعل على المروة كما فعل على الصفا فلما كان آخر طوافه على المروة ‏.‏ قال ‏\"‏ لو أني استقبلت من أمري ما استدبرت لم أسق الهدى وجعلتها عمرة فمن كان منكم ليس معه هدى فليحلل وليجعلها عمرة ‏\"‏ ‏.‏ فحل الناس كلهم وقصروا إلا النبي ـ صلى الله عليه وسلم ـ ومن كان معه الهدى فقام سراقة بن مالك بن جعشم فقال يا رسول الله ألعامنا هذا أم لأبد الأبد قال فشبك رسول الله ـ صلى الله عليه وسلم ـ أصابعه في الأخرى وقال ‏\"‏ دخلت العمرة في الحج هكذا - مرتين - لا بل لأبد الأبد ‏\"‏ ‏.‏ قال وقدم علي ببدن إلى النبي ـ صلى الله عليه وسلم ـ ‏.‏ فوجد فاطمة ممن حل ولبست ثيابا صبيغا واكتحلت فأنكر ذلك عليها علي فقالت أمرني أبي بهذا ‏.‏ فكان علي يقول بالعراق فذهبت إلى رسول الله ـ صلى الله عليه وسلم ـ محرشا على فاطمة في الذي صنعته مستفتيا رسول الله ـ صلى الله عليه وسلم ـ في الذي ذكرت عنه وأنكرت ذلك عليها ‏.‏ فقال ‏\"‏ صدقت صدقت ماذا قلت حين فرضت الحج ‏\"‏ ‏.‏ قال قلت اللهم إني أهل بما أهل به رسولك ـ صلى الله عليه وسلم ـ ‏.‏ قال ‏\"‏ فإن معي الهدى فلا تحل ‏\"‏ ‏.‏ قال فكان جماعة الهدى الذي جاء به علي من اليمن والذي أتى به النبي ـ صلى الله عليه وسلم ـ من المدينة مائة ثم حل الناس كلهم وقصروا إلا النبي ـ صلى الله عليه وسلم ـ ومن كان معه هدى فلما كان يوم التروية وتوجهوا إلى منى أهلوا بالحج ‏.‏ فركب رسول الله ـ صلى الله عليه وسلم ـ فصلى بمنى الظهر والعصر والمغرب والعشاء والصبح ثم مكث قليلا حتى طلعت الشمس وأمر بقبة من شعر فضربت له بنمرة فسار رسول الله ـ صلى الله عليه وسلم ـ لا تشك قريش إلا أنه واقف عند المشعر الحرام أو المزدلفة كما كانت قريش تصنع في الجاهلية فأجاز رسول الله ـ صلى الله عليه وسلم ـ حتى أتى عرفة فوجد القبة قد ضربت له بنمرة فنزل بها حتى إذا زاغت الشمس أمر بالقصواء فرحلت له فركب حتى أتى بطن الوادي فخطب الناس فقال ‏\"‏ إن دماءكم وأموالكم عليكم حرام كحرمة يومكم هذا في شهركم هذا في بلدكم هذا ألا وإن كل شىء من أمر الجاهلية موضوع تحت قدمى هاتين ودماء الجاهلية موضوعة وأول دم أضعه دم ربيعة بن الحارث - كان مسترضعا في بني سعد فقتلته هذيل - وربا الجاهلية موضوع وأول ربا أضعه ربانا ربا العباس بن عبد المطلب فإنه موضوع كله فاتقوا الله في النساء فإنكم أخذتموهن بأمانة الله واستحللتم فروجهن بكلمة الله وإن لكم عليهن أن لا يوطئن فرشكم أحدا تكرهونه فإن فعلن ذلك فاضربوهن ضربا غير مبرح ولهن عليكم رزقهن وكسوتهن بالمعروف وقد تركت فيكم ما لم تضلوا إن اعتصمتم به كتاب الله وأنتم مسئولون عني فما أنتم قائلون ‏\"‏ ‏.‏ قالوا نشهد أنك قد بلغت وأديت ونصحت ‏.‏ فقال بإصبعه السبابة إلى السماء وينكبها إلى الناس ‏\"‏ اللهم اشهد اللهم اشهد ‏\"‏ ‏.‏ ثلاث مرات ثم أذن بلال ثم أقام فصلى الظهر ثم أقام فصلى العصر ولم يصل بينهما شيئا ثم ركب رسول الله ـ صلى الله عليه وسلم ـ حتى أتى الموقف فجعل بطن ناقته إلى الصخرات وجعل حبل المشاة بين يديه واستقبل القبلة فلم يزل واقفا حتى غربت الشمس وذهبت الصفرة قليلا حتى غاب القرص وأردف أسامة بن زيد خلفه فدفع رسول الله ـ صلى الله عليه وسلم ـ وقد شنق القصواء بالزمام حتى إن رأسها ليصيب مورك رحله ويقول بيده اليمنى ‏\"‏ أيها الناس السكينة السكينة ‏\"‏ ‏.‏ كلما أتى حبلا من الحبال أرخى لها قليلا حتى تصعد ثم أتى المزدلفة فصلى بها المغرب والعشاء بأذان واحد وإقامتين ولم يصل بينهما شيئا ثم اضطجع رسول الله ـ صلى الله عليه وسلم ـ حتى طلع الفجر فصلى الفجر حين تبين له الصبح بأذان وإقامة ثم ركب القصواء حتى أتى المشعر الحرام فرقي عليه فحمد الله وكبره وهلله فلم يزل واقفا حتى أسفر جدا ثم دفع قبل أن تطلع الشمس وأردف الفضل بن العباس وكان رجلا حسن الشعر أبيض وسيما فلما دفع رسول الله ـ صلى الله عليه وسلم ـ مر الظعن يجرين فطفق الفضل ينظر إليهن فوضع رسول الله ـ صلى الله عليه وسلم ـ يده من الشق الآخر فصرف الفضل وجهه من الشق الآخر ينظر حتى أتى محسرا حرك قليلا ثم سلك الطريق الوسطى التي تخرجك إلى الجمرة الكبرى حتى أتى الجمرة التي عند الشجرة فرمى بسبع حصيات يكبر مع كل حصاة منها مثل حصى الخذف ورمى من بطن الوادي ثم انصرف إلى المنحر فنحر ثلاثا وستين بدنة بيده وأعطى عليا فنحر ما غبر وأشركه في هديه ثم أمر من كل بدنة ببضعة فجعلت في قدر فطبخت فأكلا من لحمها وشربا من مرقها ثم أفاض رسول الله ـ صلى الله عليه وسلم ـ إلى البيت فصلى بمكة الظهر فأتى بني عبد المطلب وهم يسقون على زمزم فقال ‏\"‏ انزعوا بني عبد المطلب لولا أن يغلبكم الناس على سقايتكم لنزعت معكم ‏\"‏ ‏.‏ فناولوه دلوا فشرب منه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 193
			}
		}
	]
}