{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4077,
			"arabicnumber": 4077,
			"text": "حدثنا علي بن محمد، حدثنا عبد الرحمن المحاربي، عن إسماعيل بن رافع أبي رافع، عن أبي زرعة السيباني، يحيى بن أبي عمرو عن أبي أمامة الباهلي، قال خطبنا رسول الله ـ صلى الله عليه وسلم ـ فكان أكثر خطبته حديثا حدثناه عن الدجال وحذرناه فكان من قوله أن قال ‏\"‏ إنه لم تكن فتنة في الأرض منذ ذرأ الله ذرية آدم أعظم من فتنة الدجال وإن الله لم يبعث نبيا إلا حذر أمته الدجال وأنا آخر الأنبياء وأنتم آخر الأمم وهو خارج فيكم لا محالة وإن يخرج وأنا بين ظهرانيكم فأنا حجيج لكل مسلم وإن يخرج من بعدي فكل امرئ حجيج نفسه والله خليفتي على كل مسلم وإنه يخرج من خلة بين الشام والعراق فيعيث يمينا ويعيث شمالا ‏.‏ يا عباد الله أيها الناس فاثبتوا فإني سأصفه لكم صفة لم يصفها إياه نبي قبلي إنه يبدأ فيقول أنا نبي ولا نبي بعدي ثم يثني فيقول أنا ربكم ‏.‏ ولا ترون ربكم حتى تموتوا وإنه أعور وإن ربكم ليس بأعور وإنه مكتوب بين عينيه كافر يقرؤه كل مؤمن كاتب أو غير كاتب وإن من فتنته أن معه جنة ونارا فناره جنة وجنته نار فمن ابتلي بناره فليستغث بالله وليقرأ فواتح الكهف فتكون عليه بردا وسلاما كما كانت النار على إبراهيم وإن من فتنته أن يقول لأعرابي أرأيت إن بعثت لك أباك وأمك أتشهد أني ربك فيقول نعم ‏.‏ فيتمثل له شيطانان في صورة أبيه وأمه فيقولان يا بنى اتبعه فإنه ربك ‏.‏ وإن من فتنته أن يسلط على نفس واحدة فيقتلها وينشرها بالمنشار حتى يلقى شقتين ثم يقول انظروا إلى عبدي هذا فإني أبعثه الآن ثم يزعم أن له ربا غيري ‏.‏ فيبعثه الله ويقول له الخبيث من ربك فيقول ربي الله وأنت عدو الله أنت الدجال والله ما كنت بعد أشد بصيرة بك مني اليوم ‏\"‏ ‏.‏ قال أبو الحسن الطنافسي فحدثنا المحاربي حدثنا عبيد الله بن الوليد الوصافي عن عطية عن أبي سعيد قال قال رسول الله ـ صلى الله عليه وسلم ـ ‏\"‏ ذلك الرجل أرفع أمتي درجة في الجنة ‏\"‏ ‏.‏ قال قال أبو سعيد والله ما كنا نرى ذلك الرجل إلا عمر بن الخطاب حتى مضى لسبيله ‏.‏ قال المحاربي ثم رجعنا إلى حديث أبي رافع قال ‏\"‏ وإن من فتنته أن يأمر السماء أن تمطر فتمطر ويأمر الأرض أن تنبت فتنبت وإن من فتنته أن يمر بالحى فيكذبونه فلا تبقى لهم سائمة إلا هلكت وإن من فتنته أن يمر بالحى فيصدقونه فيأمر السماء أن تمطر فتمطر ويأمر الأرض أن تنبت فتنبت حتى تروح مواشيهم من يومهم ذلك أسمن ما كانت وأعظمه وأمده خواصر وأدره ضروعا وإنه لا يبقى شىء من الأرض إلا وطئه وظهر عليه إلا مكة والمدينة لا يأتيهما من نقب من نقابهما إلا لقيته الملائكة بالسيوف صلتة حتى ينزل عند الظريب الأحمر عند منقطع السبخة فترجف المدينة بأهلها ثلاث رجفات فلا يبقى منافق ولا منافقة إلا خرج إليه فتنفي الخبث منها كما ينفي الكير خبث الحديد ويدعى ذلك اليوم يوم الخلاص ‏\"‏ ‏.‏ فقالت أم شريك بنت أبي العكر يا رسول الله فأين العرب يومئذ قال ‏\"‏ هم يومئذ قليل وجلهم ببيت المقدس وإمامهم رجل صالح فبينما إمامهم قد تقدم يصلي بهم الصبح إذ نزل عليهم عيسى ابن مريم الصبح فرجع ذلك الإمام ينكص يمشي القهقرى ليتقدم عيسى يصلي بالناس فيضع عيسى يده بين كتفيه ثم يقول له تقدم فصل فإنها لك أقيمت ‏.‏ فيصلي بهم إمامهم فإذا انصرف قال عيسى عليه السلام افتحوا الباب ‏.‏ فيفتح ووراءه الدجال معه سبعون ألف يهودي كلهم ذو سيف محلى وساج فإذا نظر إليه الدجال ذاب كما يذوب الملح في الماء وينطلق هاربا ويقول عيسى عليه السلام إن لي فيك ضربة لن تسبقني بها ‏.‏ فيدركه عند باب اللد الشرقي فيقتله فيهزم الله اليهود فلا يبقى شىء مما خلق الله يتوارى به يهودي إلا أنطق الله ذلك الشىء لا حجر ولا شجر ولا حائط ولا دابة - إلا الغرقدة فإنها من شجرهم لا تنطق - إلا قال يا عبد الله المسلم هذا يهودي فتعال اقتله ‏\"‏ ‏.‏ قال رسول الله ـ صلى الله عليه وسلم ـ ‏\"‏ وإن أيامه أربعون سنة السنة كنصف السنة والسنة كالشهر والشهر كالجمعة وآخر أيامه كالشررة يصبح أحدكم على باب المدينة فلا يبلغ بابها الآخر حتى يمسي ‏\"‏ ‏.‏ فقيل له يا رسول الله كيف نصلي في تلك الأيام القصار قال ‏\"‏ تقدرون فيها الصلاة كما تقدرونها في هذه الأيام الطوال ثم صلوا ‏\"‏ ‏.‏ قال رسول الله ـ صلى الله عليه وسلم ـ ‏\"‏ فيكون عيسى ابن مريم عليه السلام في أمتي حكما عدلا وإماما مقسطا يدق الصليب ويذبح الخنزير ويضع الجزية ويترك الصدقة فلا يسعى على شاة ولا بعير وترفع الشحناء والتباغض وتنزع حمة كل ذات حمة حتى يدخل الوليد يده في في الحية فلا تضره وتفر الوليدة الأسد فلا يضرها ويكون الذئب في الغنم كأنه كلبها وتملأ الأرض من السلم كما يملأ الإناء من الماء وتكون الكلمة واحدة فلا يعبد إلا الله وتضع الحرب أوزارها وتسلب قريش ملكها وتكون الأرض كفاثور الفضة تنبت نباتها بعهد آدم حتى يجتمع النفر على القطف من العنب فيشبعهم ويجتمع النفر على الرمانة فتشبعهم ويكون الثور بكذا وكذا من المال وتكون الفرس بالدريهمات ‏\"‏ ‏.‏ قالوا يا رسول الله وما يرخص الفرس قال ‏\"‏ لا تركب لحرب أبدا ‏\"‏ ‏.‏ قيل له فما يغلي الثور قال ‏\"‏ تحرث الأرض كلها وإن قبل خروج الدجال ثلاث سنوات شداد يصيب الناس فيها جوع شديد يأمر الله السماء في السنة الأولى أن تحبس ثلث مطرها ويأمر الأرض فتحبس ثلث نباتها ثم يأمر السماء في السنة الثانية فتحبس ثلثى مطرها ويأمر الأرض فتحبس ثلثى نباتها ثم يأمر الله السماء في السنة الثالثة فتحبس مطرها كله فلا تقطر قطرة ويأمر الأرض فتحبس نباتها كله فلا تنبت خضراء فلا تبقى ذات ظلف إلا هلكت إلا ما شاء الله ‏\"‏ ‏.‏ قيل فما يعيش الناس في ذلك الزمان قال ‏\"‏ التهليل والتكبير والتسبيح والتحميد ويجرى ذلك عليهم مجرى الطعام ‏\"‏ ‏.‏ قال أبو عبد الله سمعت أبا الحسن الطنافسي يقول سمعت عبد الرحمن المحاربي يقول ينبغي أن يدفع هذا الحديث إلى المؤدب حتى يعلمه الصبيان في الكتاب ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 152
			}
		}
	]
}