{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4127,
			"arabicnumber": 4127,
			"text": "حدثنا أحمد بن محمد بن يحيى بن سعيد القطان، حدثنا عمرو بن محمد العنقزي، حدثنا أسباط بن نصر، عن السدي، عن أبي سعد الأزدي، وكان، قارئ الأزد عن أبي الكنود، عن خباب، في قوله تعالى ‏{ولا تطرد الذين يدعون ربهم بالغداة والعشي}‏ إلى قوله ‏{فتكون من الظالمين}‏ قال جاء الأقرع بن حابس التميمي وعيينة بن حصن الفزاري فوجدوا رسول الله ـ صلى الله عليه وسلم ـ مع صهيب وبلال وعمار وخباب قاعدا في ناس من الضعفاء من المؤمنين فلما رأوهم حول النبي ـ صلى الله عليه وسلم ـ حقروهم فأتوه فخلوا به وقالوا إنا نريد أن تجعل لنا منك مجلسا تعرف لنا به العرب فضلنا فإن وفود العرب تأتيك فنستحيي أن ترانا العرب مع هذه الأعبد فإذا نحن جئناك فأقمهم عنك فإذا نحن فرغنا فاقعد معهم إن شئت ‏.‏ قال ‏\"‏ نعم ‏\"‏ ‏.‏ قالوا فاكتب لنا عليك كتابا ‏.‏ قال فدعا بصحيفة ودعا عليا ليكتب ونحن قعود في ناحية فنزل جبرائيل عليه السلام فقال ‏{ولا تطرد الذين يدعون ربهم بالغداة والعشي يريدون وجهه ما عليك من حسابهم من شىء وما من حسابك عليهم من شىء فتطردهم فتكون من الظالمين}‏ ثم ذكر الأقرع بن حابس وعيينة بن حصن فقال ‏{وكذلك فتنا بعضهم ببعض ليقولوا أهؤلاء من الله عليهم من بيننا أليس الله بأعلم بالشاكرين}‏ ‏.‏ ثم قال ‏{وإذا جاءك الذين يؤمنون بآياتنا فقل سلام عليكم كتب ربكم على نفسه الرحمة }‏ ‏.‏ قال فدنونا منه حتى وضعنا ركبنا على ركبته وكان رسول الله ـ صلى الله عليه وسلم ـ يجلس معنا فإذا أراد أن يقوم قام وتركنا فأنزل الله ‏{واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه ولا تعد عيناك عنهم}‏ ولا تجالس الأشراف ‏{تريد زينة الحياة الدنيا ولا تطع من أغفلنا قلبه عن ذكرنا}‏ - يعني عيينة والأقرع - ‏{واتبع هواه وكان أمره فرطا }‏ - قال هلاكا - قال أمر عيينة والأقرع ‏.‏ ثم ضرب لهم مثل الرجلين ومثل الحياة الدنيا ‏.‏ قال خباب فكنا نقعد مع النبي ـ صلى الله عليه وسلم ـ فإذا بلغنا الساعة التي يقوم فيها قمنا وتركناه حتى يقوم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 28
			}
		}
	]
}