{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4336,
			"arabicnumber": 4336,
			"text": "حدثنا هشام بن عمار، حدثنا عبد الحميد بن حبيب بن أبي العشرين، حدثني عبد الرحمن بن عمرو الأوزاعي، حدثني حسان بن عطية، حدثني سعيد بن المسيب، أنه لقي أبا هريرة فقال أبو هريرة أسأل الله أن يجمع، بيني وبينك في سوق الجنة ‏.‏ قال سعيد أوفيها سوق قال نعم أخبرني رسول الله ـ صلى الله عليه وسلم ـ أن أهل الجنة إذا دخلوها نزلوا فيها بفضل أعمالهم فيؤذن لهم في مقدار يوم الجمعة من أيام الدنيا فيزورون الله عز وجل ويبرز لهم عرشه ويتبدى لهم في روضة من رياض الجنة فتوضع لهم منابر من نور ومنابر من لؤلؤ ومنابر من ياقوت ومنابر من زبرجد ومنابر من ذهب ومنابر من فضة ويجلس أدناهم - وما فيهم دنيء - على كثبان المسك والكافور ما يرون أن أصحاب الكراسي بأفضل منهم مجلسا ‏.‏ قال أبو هريرة قلت يا رسول الله هل نرى ربنا قال ‏\"‏ نعم هل تتمارون في رؤية الشمس والقمر ليلة البدر ‏\"‏ ‏.‏ قلنا لا ‏.‏ قال ‏\"‏ كذلك لا تتمارون في رؤية ربكم عز وجل ولا يبقى في ذلك المجلس أحد إلا حاضره الله عز وجل محاضرة حتى إنه يقول للرجل منكم ألا تذكر يا فلان يوم عملت كذا وكذا - يذكره بعض غدراته في الدنيا - فيقول يا رب أفلم تغفر لي فيقول بلى فبسعة مغفرتي بلغت منزلتك هذه ‏.‏ فبينما هم كذلك غشيتهم سحابة من فوقهم فأمطرت عليهم طيبا لم يجدوا مثل ريحه شيئا قط ثم يقول قوموا إلى ما أعددت لكم من الكرامة فخذوا ما اشتهيتم ‏.‏ قال فنأتي سوقا قد حفت به الملائكة فيه ما لم تنظر العيون إلى مثله ولم تسمع الآذان ولم يخطر على القلوب ‏.‏ قال فيحمل لنا ما اشتهينا ليس يباع فيه شىء ولا يشترى وفي ذلك السوق يلقى أهل الجنة بعضهم بعضا فيقبل الرجل ذو المنزلة المرتفعة فيلقى من هو دونه - وما فيهم دنيء - فيروعه ما يرى عليه من اللباس فما ينقضي آخر حديثه حتى يتمثل له عليه أحسن منه وذلك أنه لا ينبغي لأحد أن يحزن فيها ‏\"‏ ‏.‏ قال ‏\"‏ ثم ننصرف إلى منازلنا فيتلقانا أزواجنا فيقلن مرحبا وأهلا لقد جئت وإن بك من الجمال والطيب أفضل مما فارقتنا عليه فنقول إنا جالسنا اليوم ربنا الجبار عز وجل ويحقنا أن ننقلب بمثل ما انقلبنا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 237
			}
		}
	]
}