{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2175,
			"arabicnumber": 2175,
			"text": "আল্ হাসান ইবন আলী .... আবূ হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ সে ব্যক্তি আমাদের দলর্ভূক্ত নয়, যে কোন স্ত্রীলোককে তার স্বামীর বিরূদ্ধে এবং কোন দাসকে তার মনিবের বিরূদ্ধে প্ররোচিত করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2176,
			"arabicnumber": 2176,
			"text": "আল কা‘নবী .... আবূ হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন, কোন স্ত্রীলোক যেন নিজের স্বার্থ ও সুবিধার জন্য তার ভগ্নির তালাক কামনা না করে, নিজে তার সাথে বিবাহবদ্ধ হওয়ারা জন্য। কেননা, তার জন্য তা-ই যা তার তাকদীরে আছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2177,
			"arabicnumber": 2177,
			"text": "আহমদ ইবন ইউনুস ..... মুহারিব (রহঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন, আল্লাহ্ তা‘আলার নিকট হালাল বিষয়সমূহের মধ্যে তালাকের চাইতে অধিক নিকৃষ্ট বস্তু আর কিছুই নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2178,
			"arabicnumber": 2178,
			"text": "কাসীর ইবন উবায়দ ..... ইবন উমার (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন যে, আল্লাহ্ তা‘আলার নিকট নিকৃষ্টতম হালাল বস্তু হল তালাক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2179,
			"arabicnumber": 2179,
			"text": "আল্ কা‘নবী ...... আবদুল্লাহ্ ইবন উমার (রাঃ) হতে বর্ণিত। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে, তাঁর স্ত্রীকে হায়েয অবস্থায় তালাক প্রদান করেন। তখন উমার ইবনুল খাত্তাব (রাঃ) এ ব্যাপারে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করলে তিনি বলেন, তুমি তাকে তার স্ত্রীকে ফিরিয়ে আনতে বল এবং হায়েয হতে পবিত্র না হওয়া পর্যন্ত তাকে নিজের কাছে রাখতে বল। এরপর সে (মহিলা) পুনরায় হায়েযা এবং পুনরায় হায়েয হতে পবিত্র হলে সে তাকে চাইলে রাখতেও পারে এবং যদি চায় তাকে তালাক দিতে পারে, এই তালাক অবশ্য তার সাথে সহবাসের পূর্বে পবিত্রতাবস্থায় দিতে হবে। আর এ ইদ্দত (সময়সীমা) আল্লাহ্ তা'আলা মহিলাদের তালাক প্রদানের জন্য নির্ধারিত করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2180,
			"arabicnumber": 2180,
			"text": "কুতায়বা ইবন সাঈদ ...... নাফে' (রহঃ) হতে বর্ণিত যে, ইবন উমার (রাঃ) তার স্ত্রীকে ঋতুমতী অবস্থায় তালাক প্রদান করেন। এরপর রাবী কর্তৃক মালিক বর্ণিত উপরোক্ত হাদীসের অর্থে বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2181,
			"arabicnumber": 2181,
			"text": "উসমান ইবন আবূ শায়বা ...... ইবন উমার (রাঃ) হতে বর্ণিত যে, তিনি তার স্ত্রীকে হায়েয অবস্থায় তালাক দেন। তখন উমার (রাঃ) এতদসম্পর্কে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করলে তিনি বলেন, তুমি তাকে (ইবন উমারকে) তার স্ত্রীকে ফিরিয়ে আনতে বলো। এরপর সে যখন (হায়েয হতে) পবিত্র হয়, কিংবা সে গর্ভবতী হয়, তখন যেন তাকে তালাক দেয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2182,
			"arabicnumber": 2182,
			"text": "আহমদ ইবন সালিহ ..... সালিম ইবন আবদুল্লাহ্ (রহঃ) তাঁর পিতা হতে বর্ণনা করেছেন। তিনি তাঁর স্ত্রীকে হায়েয অবস্থায় তালাক দেন। তখন উমার (রাঃ) এ সম্পর্কে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করলে তিনি রাগান্বিত হন এবং বলেন, তুমি তাকে তার স্ত্রীকে ফিরিয়ে আনতে বলো। অতঃপর যতক্ষণ না সে হায়েয হতে পবিত্র হয়, ততক্ষণ নিজের নিকট রাখতে বলো। অতঃপর পুনরায় সে ঋতুমতী হয়ে পাবিত্র হলে, সে ইচ্ছা করলে তাকে সহবাসের পূর্বে পবিত্রাবস্থায় তালাক প্রদান করতে পারে। আর এ তালাক (পবিত্রবস্থায়) ইদ্দতের জন্য, যেরূপ আল্লাহ্ তা‘আলা নির্দেশ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2183,
			"arabicnumber": 2183,
			"text": "আল্ কা‘নবী আল্ হাসান ইবন আলী ...... ইবন সিরীন (রহঃ) হতে বর্ণিত। তিনি বলেন, ইউনুস ইবন জুবায়র আমার নিকট বর্ণনা করেছেন যে, একদা তিনি ইবন উমার (রাঃ)-কে জিজ্ঞাসা করেন, আপনি আপনার স্ত্রীকে কয়টি তালাক প্রদান করেছেন? তিনি বলেন, একটি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2184,
			"arabicnumber": 2184,
			"text": "আল্ কা-নবী ..... মুহাম্মাদ ইবন সিরীন (রহঃ) হতে বর্ণিত। তিনি বলেন, ইউনুস ইবন জুবায়র আমার নিকট বর্ণনা করেন যে, একদা আমি আবদুল্লাহ্ ইবন উমার (রাঃ)-কে জিজ্ঞাসা করি। এক ব্যক্তি হায়েয অবস্থায় তার স্ত্রীকে তালাক প্রদান করেছে। তখন তিনি জিজ্ঞাসা করেন, তুমি কি ইবন উমারকে চেন? আমি বলি, হ্যাঁ। তিনি বলেন, আবদুল্লাহ্ ইবন উমার (রাঃ) তার স্ত্রীকে হায়েয অবস্থায় তালাক প্রদান করে। তখন উমার (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপস্থিত হয়ে তাকে এতদসম্পর্কে জিজ্ঞাসা করেন। তিনি বলেন, তাকে তার স্ত্রীকে ফিরিয়ে আনতে বলো। এরপর সে যেন তাকে তার হায়েয আসার পূর্বে তালাক প্রদান করে। তখন আমি বলি, এটা হতে কি তার ইদ্দত গণনা করতে হবে? তখন জবাবে তিনি বলেন, হ্যাঁ। আর সে যদি এরূপ করতে অপারগ হয়, তবে সে আহমকের মত কাজ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2185,
			"arabicnumber": 2185,
			"text": "আহমাদ ইবন সালিহ্ ...... আবদুর রাযযাক (রহঃ) হতে বর্ণিত। তিনি বলেন, আমাকে ইবন জুবায়র আবূ জুবায়র হতে খবর দিয়েছেন। তিনি আবদুর রহমান আয়মনকে যিনি উরওয়ার আযাদকৃত গোলাম ছিলেন, ইবন উমার (রাঃ)-কে জিজ্ঞাসা করতে শুনেন এবং আবূ যুবায়রও তা শ্রবণ করেন। তিনি জিজ্ঞাসা করেন, যে ব্যক্তি তার স্ত্রীকে হায়েয অবস্থায় তালাক দেয়, সে ব্যক্তি সম্পর্কে আপনার অভিমত কী? তিনি বলেন, আবদুল্লাহ্ ইবন উমার (রাঃ) রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে তাঁর স্ত্রীকে হায়েয অবস্থায় তালাক দেয়। উমার (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এ সম্পর্কে জিজ্ঞাসা করলে, তখন তিনি আমাকে পুনরায় তাকে (স্ত্রীকে) গ্রহণ করার নির্দেশ দেন এবং বলেন, এত দোষের কিছু নেই। অতঃপর তিনি বলেন, তাকে পুনঃগ্রহণের পর যখন সে পবিত্র হবে, তখন তাকে তালাক দিবে বা তোমার নিকট রাখবে। অতঃপর ইবন উমার (রাঃ) বলেন, তখন নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ আয়াত পাঠ করেনঃ ‘‘হে নবী! যখন তোমরা তোমাদের স্ত্রীদের তালাক দিবে, তখন তাদের উদ্দত (গণনার সীমা) আসার পূর্বে তালাক দিবে।’’ ইমাম আবূ দাঊদ ... আবূ ওয়ায়েল হতে অন্যান্য রাবীদের বর্ণিত হাদীসের অর্থে হাদীস বর্ণনা করেছেন। তারা বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে (ইবন উমার) তার স্ত্রীকে পুনরায় গ্রহণের জন্য নির্দেশ দেন, যতক্ষণ না সে পবিত্র হয়। এরপর যদি ইচ্ছা করে, তাকে তালাক দিতে বা গ্রহণ করতে নির্দেশ দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2186,
			"arabicnumber": 2186,
			"text": "বিশর ইবন হিলাল ...... মুতাররিফ ইবন আবদুল্লাহ্ (রহঃ) হতে বর্ণিত। তিনি বলেন, একদা ইমরান ইবন হুসায়ন এমন এক ব্যক্তি সম্পর্কে জিজ্ঞাসিত হন যে তার স্ত্রীকে তালাকে রিজ‘ঈ প্রদান করে, এরপর সে তার সাথে সহবাস করে। আর তার তালাক প্রদান ও পুনঃগ্রহণের সময় কাউকে সাক্ষী রাখেনি। তিনি বলেন, তুমি তাকে সুন্নাত তরীকার বিপরীতে তালাক প্রদান করেছ এবং সুন্নাতের বিপরীতে পুনঃগ্রহণ করেছ। (আর জেনে রাখ) তাকে তালাক প্রদানের সময় এবং পুনঃগ্রহণের সময় সাক্ষী রাখবে (এটাই সুন্নাত তরীকা)। আর তালাক দেওয়ার পর পুনরায় তার কাছেও যাবে না, পুনঃগ্রহণও করবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2187,
			"arabicnumber": 2187,
			"text": "যুহায়র ইবন হারব ..... বনী নাওফলের আযাদকৃত গোলাম আবূ হাসান বলেন, তিনি ইবন আব্বাস (রাঃ)-কে এমন একজন দাস সম্পর্কে জিজ্ঞাসা করেন, যার অধীনে একজন দাসী স্ত্রী ছিল। আর সে তাকে দু‘তালাক প্রদান করেছিল। এরপর তারা উভয়েই আযাদ হয়। এমতাবস্থায় দাসীটি কি তাকে পুনরায় বিবাহ করতে পারবে? তিনি বলেন, হ্যাঁ, পারবে। কেননা, এতদসম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ ফয়সালা প্রদান করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2188,
			"arabicnumber": 2188,
			"text": "মুহাম্মদ ইবন আল্ মুসান্না ...... আলী (রাঃ) হতে পূর্বোক্ত হাদীসের সনদে ও অর্থে হাদীস বর্ণনা করেছেন। ইবন আব্বাস (রাঃ) বলেন, তোমার জন্য একটি তালাক বাকী ছিল। আর এর জন্যই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ ফায়সালা দিয়েছেন। (অর্থাৎ মুক্ত হওয়ার পর তুমি তিন তালাক পর্যন্ত দেয়ার অধিকারী হয়েছ। এখন বাকী তালাকটি না দিয়ে ফেরত গ্রহণের সুযোগ তোমার রয়েছে।)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2189,
			"arabicnumber": 2189,
			"text": "মুহাম্মদ ইবন মাসঊদ ...... আয়েশা (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন যে, দাসীর জন্য তালাক হল দু‘টি এবং তার ইদ্দতের সময় হল দু' হায়েয পর্যন্ত। আবূ আসিম আয়েশা (রাঃ) হতে এবং তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ বর্ণনা করেছেন। তবে তিনি অতিরিক্ত বলেন, তার ইদ্দত হল দু' হায়েয। [ইমাম আবু দাউদ (রহঃ) বলেন এ হাদিসটি মাজহুল",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2190,
			"arabicnumber": 2190,
			"text": "মুসলিম ইবন ইবরাহীম ..... আমর ইবন শু‘আয়ব (রহঃ) তাঁর পিতা হতে তাঁর দাদা হতে বর্ণনা করেছেন। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ স্ত্রীর অধিকারী হওয়া ব্যতীত তালাক হয় না। কোন দাস-দাসীর মালিক হওয়া ব্যতীত তাদের আযাদ করা যায় না। আর কোন জিনিস-পত্রের মালিক হওয়া ছাড়া উহা বিক্রি করা যায় না। রাবী ইবন আল্ সাব্বাহ অতিরিক্ত বর্ণনা করেন, কোন মালিক হওয়া ব্যতীত উহার মান্নত করা যায় না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2191,
			"arabicnumber": 2191,
			"text": "মুহাম্মদ ইবন আল্ ‘আলা ...... আমর ইবন শু‘আয়ব (রহঃ) হতে পূর্বোক্ত হাদীসের সনদ ও অর্থে হাদীস বর্ণিত হয়েছে। তবে তিনি (মুহাম্মদ) ইহা অতিরিক্ত বর্ণনা করেছেন যে, যদি কেহ কোনরূপ গোনাহের কাজের জন্য শপথ করে, তবে উহা তার জন্য আদায় করা প্রয়োজনীয় নয়, আর যে ব্যক্তি আত্মীয়তা ছিন্ন করার জন্য শপথ (হলফ) করে, তার শপথও পালনীয় নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2192,
			"arabicnumber": 2192,
			"text": "ইবন আল্ সারহ ...... আমর ইবন শু‘আয়ব (রহঃ) তাঁর পিতা হতে, তিনি তাঁর দাদা হতে, তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে পূর্বোক্ত হাদীসের অনুরূপ হাদীস বর্ণনা করেছেন। তবে রাবী ইবন আল্ সারহ অতিরিক্ত বর্ণনা করেছেন যে, কেবল আল্লাহ্ তা‘আলার ইবাদত সংক্রান্ত মান্নত ছাড়া অপর কোন মান্নতই হয় না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2193,
			"arabicnumber": 2193,
			"text": "উবায়দুল্লাহ্ ইবন সা‘দ আল যুহরী ..... মুহাম্মদ ইবন উবায়দ ইবন আবূ সালিহ (রহঃ) হতে বর্ণিত, যিনি (সিরিয়ার) ইলিয়া নামক স্থানে বসবাস করতেন। তিনি বলেন, আমি সিরিয়া হতে আদী ইবন আদী আল কিনদীর সাথে বের হই। এরপর আমরা মক্কায় উপনীত হলে, আমাকে সাফিয়্যা বিন্ত শায়বার নিকট তিনি প্রেরণ করেন। যিনি আয়েশা (রাঃ) হতে এ হাদীসটি সংগ্রহ করেন। রাবী বলেন, আমি আয়েশা (রাঃ)-কে বলতে শুনেছি যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ গিলাক অবস্থায় কোন তালাক হয় না বা দাস মুক্ত করা যায় না। ইমাম আবূ দাঊদ (রহঃ) বলেন, আমরা ধারণা غلاق অর্থ হল রাগান্বিত অবস্থায় তালাক প্রদান করা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2194,
			"arabicnumber": 2194,
			"text": "আল্ কা‘নবী ..... আবূ হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ তিনটি এমন কাজ আছে, যার জন্য চেষ্টা করা দরকার। যথাঃ বিবাহ, তালাক এবং পরিত্যক্ত স্ত্রীকে পুনঃগ্রহণ সম্পর্কে। (অর্থাৎ হাসি-ঠাট্টাচ্ছলে এরূপ কোনো করা যায় না।)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2195,
			"arabicnumber": 2195,
			"text": "আহমদ ইবন মুহাম্মদ আল মারওযাযী .... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, (আল্লাহ্ তা‘আলার বাণীঃ) ‘‘তালাকপ্রাপ্তা মহিলাগণকে নিজ গৃহে তিন হায়েয পর্যন্ত আবদ্ধ রাখবে। আর তাদের জন্য আল্লাহ্ তা‘আলা তাদের গর্ভে যা সৃষ্টি করেছেন, তা গোপন রাখা বৈধ নহে’’ (আর এ আয়াত নাযিলে উদ্দেশ্য হল) যখন কোন লোক তার স্ত্রীকে ইতিপূর্বে তালাক প্রদান করতো, তখন সে তাকে পুনঃগ্রহণের অধিক হকদার হতো; যদিও সে তাকে তিন তালাক প্রদান করতো। এরপর এ আয়াতটি, পরবর্তী আয়াতের দ্বারা মানসুখ (রহিত) হয়। এরপর তিনি তিলিাওয়াত করেনঃ (অর্থ) ‘‘তালাক দু‘ধরনের ... আয়াতের শেষ পর্যন্ত।’’ অর্থাৎ ১. তালাকে রিজ‘ঈ: এক বা দু‘তালাক দেয়ার পর ফেরত নেয়া চলে। ২. তালাকে মুগালালাযাঃ তিন তালাক দেয়ার পর পুনঃগ্রহণ চলে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2196,
			"arabicnumber": 2196,
			"text": "আহমদ ইবন সালিহ্ ..... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রুকানার পিতা আব্‌দ ইয়াযীদ উম্মে রুকানাকে তালাক প্রদান করেন এবং মুযায়না গোত্রের জনৈক স্ত্রীলোককে বিবাহ করেন। সেই মহিলা নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপস্থিত হয়ে বলে, সে সহবাসে অক্ষম, যেমন আমার মাথার চুল অন্য চুলের কোন উপকারে আসে না। কাজেই আপনি তার ও আমার মধ্যে বিচ্ছেদ ঘটিয়ে দিন। এটা শুনে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাগান্বিত হন এবং তিনি রুকানা ও তার ভাইদিগকে আহবান করেন। এরপর তিনি সেখানে উপস্থিত করে সাথীদের সম্বোধন করে বলেন, তোমরা লক্ষ্য করে দেখ যে, এদের মধ্যে অমুক অমুকের বিশেষ অঙ্গ-প্রত্যঙ্গ তাদের পিতা আবদ ইয়াযীদের অঙ্গ প্রত্যঙ্গের সঙ্গে কি মিল খাচ্ছে না? তখন তারা বলেন, হ্যাঁ। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবদ ইয়াযীদকে বলেন, তুমি তাকে তালাক দিয়ে দাও। তিনি তাকে তালাক দিলেন। এরপর তিনি তাকে নির্দেশ দেন যে, তুমি উম্মে রুকানাকে পুনরায় গ্রহণ কর। তখন তিনি বলেন, আমি তো তাকে তিন তালাক প্রদান করেছি, হে আল্লাহ্‌র রাসুল! তখন তিনি বলেন আমি তোমার তালাক প্রদানের কথা অবগত আছি। তুমি তাকে পুনরায় গ্রহণ কর। এরপর তিনি কুরআনের আয়াত তিলাওয়াত করেন, হে নবী! যখন তোমাদের স্ত্রীদের তালাক প্রদান করবে, তখন তাদেরকে ইদ্দত পালনের জন্য তালাক দিবে।’’ ইমাম আবূ দাঊদ (রহঃ) বলেন, আবদ ইয়াযীদ তার স্ত্রীকে তালাক প্রদান করলে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে পুনরায় ঐ স্ত্রীকে গ্রহণের জন্য নির্দেশ প্রদান করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2197,
			"arabicnumber": 2197,
			"text": "হুমায়দ ইবন মাস‘আদা .... মুজাহিদ (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি ইবন আব্বাস (রাঃ) এর নিকট উপস্থিত ছিলাম। এক ব্যক্তি সেখানে উপস্থিত হয়ে বলে যে, সে তার স্ত্রীকে তিন তালাক প্রদান করেছে। তখন তিনি চুপ করে থাকেন, যাতে আমার মনে হয়, তিনি (ইবন অব্বাস) তাকে ঐ স্ত্রী পুনরায় গ্রহণের জন্য নির্দেশ দিবেন। এরপর তিনি কিছুক্ষণ চুপ করে থাকার পর বলেন, তোমাদের কেউ যেন এখান থেকে গমনপূর্বক আহমকের মত কাজ না করে এবং বলে, হে ইবন আব্বাস! হে ইবন আব্বাস! আল্লাহ্ তা‘আলা ইরশাদ করেছেনঃ ‘‘আর যে ব্যক্তি আল্লাহ্ কে ভয় করে, তার জন্য পরিত্রাণের কোন পথ দেখছি না। তুমি তোমার রবের নাফরমানী করেছ এবং তোমার স্ত্রীকে তোমার নিকট হতে পৃথক করে দিয়েছ। অথচ আল্লাহ্ তা‘আলার নির্দেশঃ ‘‘হে নবী! যখন তোমরা তোমাদের স্ত্রীদের তালাক দিবে, তখন তাদের ইদ্দতের মধ্যে তাদের তালাক দিবে।’’ আবূ দাঊদ (রহঃ) বলেন, শু‘বা, আইয়ুব, ইবন জুরায়জ ও আ‘মাশ প্রমুখ রাবীগণ সকলেই ইবন আব্বাস (রাঃ) হতে উক্ত হাদীস বর্ণনা প্রসঙ্গে বলেন যে, তিনি এটাকে তিন তালাক হিসাবে গ্রহণ করেছেন। ইমাম আবূ দাঊদ (রহঃ) বলেন, হাম্মাদ ইবন যায়িদ ইবন আব্বাস (রাঃ) হতে বর্ণনা করেন যে, যখন কোন ব্যক্তি তার স্ত্রীকে একই সাথে তিন তালাক প্রদান করবে তাতে এক তালাকই হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2198,
			"arabicnumber": 2198,
			"text": "আহমদ ইবন সালিহ্ ..... মুহাম্মদ ইবন ইয়াস (রহঃ) হতে বর্ণিত। তিনি বলেন, একদা ইবন আব্বাস, আবূ হুরায়রা ও আবদুল্লাহ্ ইবন আমর ইবনুল ‘আস (রাঃ)-কে ঐ কুমারী স্ত্রীলোক সম্পর্কে জিজ্ঞাসা করা হয়, যাকে তার স্বামী তিন তালাক প্রদান করেছে। এর জবাবে তাঁরা সকলেই বলেন, ঐ স্ত্রী তার জন্য ততক্ষণ হালাল হবে না, যতক্ষণ না তাকে অন্য স্বামীর সাথে বিবাহ দেয়া হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2199,
			"arabicnumber": 2199,
			"text": "মুহাম্মদ ইবন আবদুল মালিক ইবন মারওয়ান ..... তাঊস (রহঃ) হতে বর্ণিত। তিনি বলেন, আবূ সাহবা নামক জনৈক ব্যক্তি ইবন আব্বাস (রাঃ) এর নিকট অধিক প্রশ্ন জিজ্ঞাসা করতেন। একদা সে বলে, আপনি কি এ ব্যাপার সম্পর্কে অবহিত আছেনযে, এক ব্যক্তি তার স্ত্রীর সাথে সহবাসের পূর্বে তাকে তিন তালাক প্রদান করে, একে তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে এবং উমার (রাঃ) এর যুগে এক তালাক হিসাবে গণ্য করতো? ইবন আব্বাস (রাঃ) বলেন, হ্যাঁ। যদি কোন ব্যক্তি তার স্ত্রীর সাথে সহবাসের পূর্বে তাকে তিন তালাক প্রদান করতো; তাঁরা একে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ বাকর (রাঃ) উমার (রাঃ) এর খিলাফতের প্রথম দিকে, এক তালাক গণ্য করতো। এরপর তিনি (উমার) যখন দেখেন যে, মানুষ অধিক হারে তিন তালাক দিচ্ছে তখন তিনি বলেন, এতে তাদের উপর তিন তালাক বর্তাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2200,
			"arabicnumber": 2200,
			"text": "আহমদ ইবন সালিহ ...... একদা আবূস সাহবা (রাঃ) ইবন আব্বাস (রাঃ)-কে জিজ্ঞাসা করেন, আপনি কি অবগত আছেন যে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে, আবূ বাকর (রাঃ) এর যুগে এবং উমার (রাঃ) এর খিলাফতের তিন বছর কাল পর্যন্ত তিন তালাক কে এক তালাক গণ্য করা হতো? ইবন আব্বাস (রাঃ) বলেন, হ্যাঁ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2201,
			"arabicnumber": 2201,
			"text": "মুহাম্মদ ইবন কাসীর ..... আলকামা ইবন ওয়াক্কাস আল্ লায়সী হতে বর্ণিত। তিনি বলেন, আমি উমার ইবনুল খাত্তাব (রাঃ)-কে বলতে শুনেছি, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ সমস্ত কাজ নিয়্যাতের উপর নির্ভরশীল।আর প্রত্যেক ব্যক্তি যে কাজের জন্য যে নিয়্যাত করে, তা তদ্রুপ হয়ে থাকে। যে ব্যক্তি আল্লাহ্ ও রাসূলের সন্তুষ্টির জন্য হিজরত করে, তার হিজরত আল্লাহ্ ও রাসূলের জন্য হয়। আর যে ব্যক্তি দুনিয়ার কিছু লাভের উদ্দেশ্যে হিজরত করে বা কোন স্ত্রীলোককে বিবাহের উদ্দেশ্যে হিজরত করে, এমতাবস্থায় সে যে নিয়্যাতে হিজরত করে, সে তা-ই প্রাপ্ত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2202,
			"arabicnumber": 2202,
			"text": "আহমদ ইবন আমর ...... ইবন শিহাব (রাঃ) হতে বর্ণিত। তিনি বলেন, আমাকে আবদুর রহমান ইবন আবদুল্লাহ্ ইবন কা‘ব মালিক (রাঃ) বলেছেন। আর কা‘ব (রাঃ) যখন অন্ধ হয়ে যান, তখন তাঁর গোত্রের লোকেরা তাঁকে নিয়ে চলাফেরা করতো। রাবী বলেন,আমি কা‘ব ইবন মালিককে বলতে শুনেছি। এরপর তাবুকের ঘটনা সম্পর্কে বিধৃত হয়েছে। তিনি বলেন, এরপর যখন পঞ্চাশ দিনের মধ্যে চল্লিশ দিন অতিবাহিত হয়, তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দূত আমার নিকট আগমন করেন এবং বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আপনাকে আপনার স্ত্রীর নিকট হতে দূরে অবস্থান করতে বলেছেন। তখন তিনি (কা‘ব) জিজ্ঞাসা করেন, আমি কি তাকে তালাক দিব, না কি রাখব? দূত বলেন, না, (তালাক দিবেন না) বরং তার নিকট হতে দূরে থাকুন এবং তার সাথে সহবাস করবেন না। এতদশ্রবণে আমি আমার স্ত্রীকে বলি, তুমি তোমার (পিতার) পরিবারের নিকট গমন করো এবং তাদের সাথে অবস্থান করো, যতক্ষণ না আল্লাহ্ তা‘আলা এ ব্যাপার সম্পর্কে ফায়সালা প্রদান করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2203,
			"arabicnumber": 2203,
			"text": "মুসাদ্দাদ ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সময় আমাদের তালাকের ইখতিয়ার প্রদান করেন। তখন আমরা তাঁর নির্দেশ পালন করি এবং তালাকের ইখতিয়ার সম্পর্কে কিছু ঘটেনি। (অর্থাৎ কেউই তালাক গ্রহণ করেননি, বরং নবীজীর স্ত্রী হিসাবে থাকাই পছন্দ করেছেন।)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2204,
			"arabicnumber": 2204,
			"text": "আল্ হাসান আলী ..... হাম্মাদ ইবন যায়িদ (রহঃ) হতে বর্ণিত। তিনি বলেন, একদা আমি আইয়ুবকে বলি, তোমরা কি হাসান বর্ণিত ঐ হাদীসটি সম্পর্কে কেউ জ্ঞাত আছ? তোমার ব্যাপার তোমার হাতে? তিনি বলেন, না। তবে কাতাদা ... আবূ হুরায়রা (রাঃ) হতে, তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এরূপ হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2205,
			"arabicnumber": 2205,
			"text": "মুসলিম ইবন ইবরাহীম ..... হাসান (রহঃ) হতে বর্ণিত। তিনি বলেন, ‘‘তোমার ব্যাপার তোমার হাতে’’ এর দ্বারা তিন তালাকের নিয়্যাত করলে, তিন তালাক বর্তাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2206,
			"arabicnumber": 2206,
			"text": "ইবন আল্ সারহ্ ..... নাফি' ইবন ‘উজায়র ইবন আব্‌দ ইয়াযীদ ইবন রুকানা (রাঃ) হতে বর্ণিত। রুকানা ইবন আব্‌দ ইয়াযীদ তাঁর স্ত্রী সুহায়মাকে ‘আলবাত্তাতা’ শব্দের দ্বারা তালাক প্রদান করে। তখন এতদসম্পর্কে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে অবহিত করা হয়। তখন তিনি বলেন, আল্লাহর শপথ! আমি এর দ্বারা এক তালাকের ইচ্ছা করি। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে জিজ্ঞাসা করেন, আল্লাহর শপথ, তুমি কি এর দ্বারা এক তালাকের ইচ্ছা করেছ? তখন জবাবে রুকানা বলেন, আল্লাহর শপথ! আমি এর দ্বারা এক তালাকের ইচ্ছা করি। এতদশ্রবণে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে স্বীয় স্ত্রী পুনরায় গ্রহণের নির্দেশ প্রদান করেন। অতঃপর তিনি (উমার) (রাঃ) এর খিলাফতকালে তাকে দ্বিতীয় তালাক দেন এবং তৃতীয় তালাক প্রদান করেন উসমান (রাঃ) এর খিলাফতকালে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2207,
			"arabicnumber": 2207,
			"text": "মুহাম্মদ ইবন ইউনুস ...... রুকানা ইবন ইয়াযীদ (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে পূবোর্ক্ত হাদীসের অনুরূপ হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2208,
			"arabicnumber": 2208,
			"text": "২২০৫ . সুলায়মান ইবন দাঊদ ...... আবদুল্লাহ্ ইবন আলী ইবন ইয়াযীদ ইবন রুকানা তার পিতা হতে, তিনি তাঁর দাদা হতে বর্ণনা করেছেন। তিনি তাঁর স্ত্রীকে ‘আলবাত্তাতা’ শব্দের দ্বরা তালাক প্রদান করেন। এরপর তিনি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপস্থিত হলে, তিনি তাঁকে জিজ্ঞাসা করেন, এর দ্বারা তুমি কী ইচ্ছা করেছ? তিনি বলেন, এক তালাকের ইচ্ছা করেছি। তখন তিনি বলেন, আল্লাহ শপথ! তিনিও বলেন, আল্লাহ্‌র শপথ! অতঃপর বললেন তুমি যা নিয়ত করেছ তাই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2209,
			"arabicnumber": 2209,
			"text": "মুসলিম ইবন ইবরাহীম ..... আবূ হুরায়রা (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। তিনি বলেন, আল্লাহ্ তা‘আলা আমার উম্মতের অন্তরে যা উদয় হয়, উহা যতক্ষণ না সে মুখে বলে ও কাজে বাস্তবায়িত করে তা মার্জনা করেছেন। (অর্থাৎ মুখে কিছু না বলে মনে তালাকের ধারণা পোষণ করলে তালাক হয় না।)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2210,
			"arabicnumber": 2210,
			"text": "মূসা ইবন ইসমাঈল ..... আবূ তামীমা আল্ হুজায়মী (রহঃ) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি তার স্ত্রীকে হে আমার ভগ্নি বলে সন্বোধন করে। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে জিজ্ঞাসা করেন, সে কি তোমার (সত্যই) ভগ্নি? তিনি তা অপছন্দ করেন এবং তাকে এরূপ বলতে নিষেধ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2211,
			"arabicnumber": 2211,
			"text": "মুহাম্মদ ইবন ইবরাহীম ...... আবূ তামীমা (রহঃ) তার গোত্রের এক ব্যক্তি হতে বর্ণনা করেছেন। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন এক ব্যক্তিকে তার স্ত্রীকে ‘হে আমার ভগ্নি’ সন্বোধন করতে শুনে তাকে এরূপ করতে নিষেধ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2212,
			"arabicnumber": 2212,
			"text": "মুহাম্মদ ইবন আল্ মুসান্না .... আবূ হুরায়রা (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। তিনি বলেন, ইরবরাহীম (আঃ) তিনবার (আপাত) মিথ্যা বলেছিলেন। যার দুটি ছিল আল্লাহ্ তা‘আলার সত্ত্বা সম্পর্কে। যেমনঃ তাঁর কথাঃ আমি পিড়ীত এবং তাঁর কথা: বরং এদের বড়টাই (মূর্তি) তা করেছে। আর তিনি যখন অত্যাচারী শাসকদের মধ্যে কোন এক অত্যাচারী রাজার ভিতর দিয়ে গমণ করেছিলেন, এমতাবস্থায় তিনি (তাঁর স্ত্রী সারা সহ) যখন কোন এক স্থানে অবতরণ করেন; তখন ঐ অত্যাচারী রাজার জনৈক ব্যক্তি সেখানে আসে। এরপর সে তাকে (রাজাকে) গিয়ে বলে, এখানে এক ব্যক্তি এসেছে যার সাথে সুন্দরী রমনী আছে। এরপর তিনি বলেন, তখন সে (অত্যাচারী রাজা) তাঁর (ইবরাহীমের) নিকট একজন অনুচর পাঠিয়ে দেয়। তখন তিনি তাঁর নিকট উপস্থিত হলে, সে তাঁর (সারার) সম্পর্কে জিজ্ঞাসা করে যে, সে কে? জবাবে তিনি বলেন, সে আমার ভগ্নি। অতঃপর তিনি (ইবরাহীম) তাঁর (সারার) নিকট ফিরে এসে বলেন, এই ব্যক্তি আমাকে তোমার সম্পর্কে জিজ্ঞাসা করেছে; আমি তাকে বলেছি, তুমি আমার ভগ্নি। আর অবস্থা এই যে, বর্তমান দুনিয়াতে তুমি এবং আমি ব্যতীত আর কোন মুসলিম নেই। আর আল্লাহ কিতাব অনুযায়ী তুমি আমার বোন। কাজেই, আমি তোমার সম্পর্কে তার নিকট মিথ্যা বলেছি এরূপ মনে করবে না। এরূপে হাদীস বর্ণিত হয়েছে। ইমাম আবূ দাঊদ (রহঃ) বলেন, এ হাদীসটির অনুরূপ হাদীস শু‘আয়ব ইবন আবূ হামযা আবূ হুরায়রা (রাঃ) হতে, তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত হয়েছে। (অর্থাৎ আদম সন্তান হিসাবে সকল মুসলিম স্ত্রী-পুরুষ পাস্পর ভাই-বোন। আত্মরক্ষার প্রয়োজনে সমার্থবোধক শব্দ ব্যবহারকে তাওরিয়্যাহ বলে, তা মিথ্যা নয়)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2213,
			"arabicnumber": 2213,
			"text": "উসমান ইবন আবূ শায়বা .... সালামা ইবন সাখার হতে বর্ণিত। তিনি বলেন, ইবনুল ‘আলা আল্-বায়াদবী বলেছেন, স্ত্রীদের সাথে সহবাসে আমি খু্বই সক্ষম ছিলাম। আর আমার মতো সহবাসে সামর্থ ব্যক্তি আর কেউ ছিল না। এরপর মাহে রামাযান সমাগত হওয়াতে আমার আশংকা হয় যে, হয়ত আমি সকাল বেলাতেও আমার স্ত্রীর সাথে সহবাসে লিপ্ত হতে পারি। তখন আমি তার সাথে যিহার করি এবং এমতাবস্থায় মাহে রামাযান প্রায় শেষ পর্যায়ে পোঁছে। কিন্তু একদা রাতে সে আমার খিদমতের সময়, তার সৌন্দর্য আমার সম্মুখে উন্মোচিত হওয়ায় আমি নিজেকে নিয়ন্ত্রন করতে অসমর্থ হই এবং তার সাথে সহবাস করি। এরপর সকালবেলা আমার কাওমের লোকদের নিকট গমণ করি এবং তাদের এ ঘটনা ব্যক্ত করি তাদেরকে বলিঃ তোমরা আমার সাথে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট চলো এবং তাঁকে সব খুলে বলি। তিনি জিজ্ঞাসা করেন, হে সালামা! তুমি কি এরূপ কাণ্ড করেছ? আমি বলি, হে আল্লাহ্‌র রাসুল! আমি এরূপই করেছি এবং তা দু‘বার বলি। আর এমতাবস্থায় আমি আল্লাহ্ তা‘আলা নির্দেশের প্রতি ধৈয্য ধারণ করি। এখন আল্লাহ্ যা বলেছেন, এখন সে হিসাবে আমার উপর হুকুম জারী করুন। তিনি বলেন, তুমি একজন দাসী মুক্ত করো। আমি বলি, ঐ আল্লাহর শপথ! যিনি আপনাকে সত্যসহ প্রেরণ করেছেন, এ ব্যতীত আমার আর কোন দাসী নেই এবং এই বলে আমি তার শরীর স্পর্শ করি। তিনি বলেন, তবে তুমি দু' মাস একাধারে রোযা রাখো। সে বলে, রোযার মধ্যে আমি যে মুসীবতে পড়েছি, হয়ত সেরূপ মুসীবতে আবার পড়তে পারি। তিনি বলেন,এমতাবস্থায় তুমি ষাটজন মিসকীনকে তৃপ্তি সহকারে খুরমা খাওয়াও। সে বলে, ঐ আল্লাহ শপথ! যিনি আপনাকে সত্য নবী হিসাবে প্রেরণ করেছেন, আমরা (স্ত্রী, পরিবার) তো রাতে খালি পেটে উপোস করি, আর আমাদের কোনো খাবরই নেই। তিনি বলেন, তুমি বনী যারীক গোত্রের সাদকা আদায়কারী ব্যক্তির নিকট গমন করো, সে তোমাকে খুরমা প্রদান করবে। আর তদ্বারা তুমি ষাটজন মিসকীনকে তৃপ্তি সহকারে খাওয়াবে এবং তুমি ও তোমার পরিজনবর্গও বাকি অংশ খাবে। তখন আমি আমার কাওমের নিকট ফিরে এসে বলি, আমি তোমাদের নিকট সংকীর্ণতা ও খারাপ ব্যাবহার পেয়েছি এবং আমি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উদারতা, ভাল ব্যবহার পেয়েছি। তিনি আমাকে তোমাদের সাদকার মাল গ্রহণের নির্দেশ দিয়েছেন। রাবী ইবনুল ‘আলা অতিরিক্ত বর্ণনা করেছেন যে, ইবন ইদরীস বলেছেন, বায়াদা বনী যুরাইক গোত্রের একটি শাখা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2214,
			"arabicnumber": 2214,
			"text": "আল্ হাসান ইবন আলী ..... খুওয়ায়লা বিনত মালিক ইবন সা'লাবা (রাঃ) হতে বর্ণিত। তিনি বলেন, আমার সাথে আমার স্বামী আওস ইবনুস সামিত (রাঃ) যিহার করে। আমি এ সম্পর্কে অভিযোগ পেশের জন্য রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গমণ করি। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ ব্যাপারে আমার সাথে বচসা করেন এবং বলেন, তুমি আল্লাহকে ভয় করো, সে তো তোমার চাচার ছেলে। এরপর আমার বেরিয়ে আসার সাথে সাথেই কুরআনের এ আয়াত নাযিল হয়ঃ (অর্থ) ‘‘আল্লাহ্ তা‘আলা ঐ মহিলার কথা শ্রবণ করেছেন, যে তার স্বামী সম্পর্কে তোমার সাথে ঝগড়া করছে ... এখান থেকে কাফফারা (প্রদান) পর্যন্ত আয়াত নাযিল হয়। তিনি বলেন, সে যেন একটি দাস আযাদ করে। তখন সে (মহিলা) বলে, তাঁর কোন দাস নেই। তিনি বলেন, সে যেন একাধারে দু' মাস রোযা রাখে। সে (মহিলা) বলে, হে আল্লাহ্‌র রাসুল! সে তো খুবই বৃদ্ধ। তার রোযা রাখার সামর্থ নাই। তিনি বলেন, সে যেন ষাটজন মিসকীনকে খানা খাওয়ায়। সে (মহিলা) বলে, তার নিকট সাদকা (কাফফারা) দেওয়ার মত কিছুই নেই। সে (মহিলা) বলে, সে সময় তাঁর নিকট থলে ভর্তি খুরমা আসে, যাতে এক ইর্‌ক পরিমাণ খুরমা ছিল। তিনি তা তাকে প্রদান করেন। সে বলে, হে আল্লাহ্‌র রাসুল! কাফফারার জন্য দেয়া বাকি আরো এক ইর্‌ক পরিমাণ খুরমা দিতে সে অপারগ। তিনি বলেন, তুমি খুব ভালই বলেছ। তুমি এর দ্বারাই ষাটজন মিসকীনকে খাওয়াও এবং তুমি তোমার চাচাত ভাইয়ের নিকট ফিরে যাও। রাবী বলেন, এক ইর্‌ক হল ষাট সা' এর সমান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2215,
			"arabicnumber": 2215,
			"text": "আল্ হাসান ইবন আলী .... ইবন ইসহাক (রহঃ) হতে পূর্বোক্ত হাদীসের সনদে হাদীস বর্ণিত হয়েছে। তবে তাঁর মতে ইর্‌ক হলো তিরিশ সা' এর সমান। ইমাম আবূ দাঊদ (রহঃ) বলেন, ইয়াহ্ইয়া ইবন আদম বর্ণিত হাদীসের চেয়ে এ হাদীসে বর্ণিত অভিমতটি অধিক সত্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2216,
			"arabicnumber": 2216,
			"text": "মূসা ইবন ইসমাঈল .... আবূ সালামা ইবন আবদুর রহমান (রাঃ) হতে বর্ণিত। তিনি বলেন, আরাক এমন একটি থলে, যা পনের সা‘য়ের সামান ধারণ করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2217,
			"arabicnumber": 2217,
			"text": "ইবন আল সারহ্ ..... সুলায়মান ইবন ইয়াসার (রাঃ) হতে পূর্বোক্ত হাদীসের অনুরূপ হাদীস বর্ণিত হয়েছে। রাবী বলেন, তখন রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে কিছু খেজুর এলে তিনি তা তাকে দান করেন, যার পরিমাণ ছিল পনের সা' এর মতো। তিনি বলেন, তুমি এটা সাদকা করে দাও। তিনি (সালামা) বলেন, হে আল্লাহ্‌র রাসুল! আমি ও আমার পরিবারের চাইতে নিঃস্ব আর কেউই নেই। রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তুমি ও তোমার পরিবারের লোকেরা তা খাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2218,
			"arabicnumber": 2218,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2219,
			"arabicnumber": 2219,
			"text": "মূসা ইবন ইসমাঈল ..... হিশাম ইবন উরওয়া (রহঃ) হতে বর্ণিত। তিনি বলেন, খাওলা (রাঃ) আওস ইবন সামিতের স্ত্রী ছিল। আর সে ছিল পাগল প্রকৃতির পুরুষ। এমতাবস্থায় পাগলামী বৃদ্ধি পাওয়ায়, সে তার স্ত্রী হতে যিহার করে। তখন আল্লাহ্ তা‘আলা এ ব্যাপারে যিহারের কাফফারার আয়াত নাযিল করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2220,
			"arabicnumber": 2220,
			"text": "হারূন ইবন আবদুল্লাহ্ ..... আয়েশা (রাঃ) হতে পূর্বোক্ত হাদীসের অনুরূপ হাদীস বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2221,
			"arabicnumber": 2221,
			"text": "ইসহাক ইবন ইসমাঈল .... ইকরামা (রহঃ) হতে বর্ণিত। জনৈক ব্যক্তি তার স্ত্রীর সাথে যিহার করার পর কাফফারা দেওয়ার পূর্বে তার সাথে সহবাস করে। সে ব্যক্তি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে হাযির হয়ে তাঁকে এতদসম্পর্কে অবহিত করে। তিনি তাকে জিজ্ঞাসা করেন, তোমাকে এরূপ করতে কিসে উদ্বুদ্ধ করেছে? সে ব্যক্তি বলে, চন্দ্রলোকে তার স্ত্রীর পায়ের গোছাদ্বয়। তিনি বলেন, তুমি (যিহারের) কাফফারা না দেওয়া পর্যন্ত তার নিকট হতে দূরে অবস্থান কর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2222,
			"arabicnumber": 2222,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2223,
			"arabicnumber": 2223,
			"text": "যিয়াদ ইবন আইয়ূব ..... ইবন আব্বাস (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে পূর্বোক্ত হাদীসের অনুরূপ হাদীস বর্ণনা করেছেন। কিন্তু সেখানে পায়ের গোছার কথা উল্লেখ নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2224,
			"arabicnumber": 2224,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2225,
			"arabicnumber": 2225,
			"text": "আবূ কামিল ...... ইকরিমা (রহঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে পূর্বোক্ত হাদীসের অনুরূপ হাদীস বর্ণনা করেছেন। ইমাম আবূ দাঊদ (রহঃ) বলেন, ইকরিমা (রহঃ) ইবন আব্বাস (রাঃ) হতে, তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে পূর্বোক্ত হাদীসের অর্থে হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2226,
			"arabicnumber": 2226,
			"text": "সুলায়মান ইবন হারব ..... সাওবান (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ কোন স্ত্রীলোক যদি অহেতুক তার স্বামীর নিকট তালাক চায়, তবে তার জন্য জান্নাতের ঘ্রাণ লাভও হারাম হয়ে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2227,
			"arabicnumber": 2227,
			"text": "আল্ কা-নবী ..... হাবীবা বিনত সাহাল আনসারীয়্যাহ (রাঃ) হতে বর্ণিত। আর তিনি ছিলেন, সাবিত ইবন কায়স ইবন শাম্‌মাসের স্ত্রী। একদা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের নামায আদায়ের জন্য বের হন। তখন তিনি হাবীবাবিনত সাহালকে হালকা অন্ধকারের মধ্যে তাঁর দরজার নিকট দন্ডায়মান দেখতে পান। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসা করেনঃ কে? সে বলে, আমি হাবীবা বিনত সাহাল। তিনি জিজ্ঞাসা করেনঃ তোমার কী হয়েছে? এ সময় এখানে কেন? সে বলে সাবিত ইবন কায়সের সাথে দাম্পত্য জীবন অতিবাহিত করা আমার পক্ষে সম্ভব নয়। এরপর সাবিত ইবন কায়স, আগমণ করলে, রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বলেন, এ তো হাবীবা বিনত সাহাল। এরপর সে যা বলেছিল পুনরায় সব খুলে বলে। হাবীবা বলেন, হে আল্লাহ্‌র রাসুল! সে আমাকে যা প্রদান করেছে, তা আমার সাথেই আছে। (ফেরত নিতে পারে) রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাবিত ইবন কায়সকে বলেন, তুমি তার নিকট হতে তা গ্রহণ করো। সে (সাবিত) তার নিকট হতে সব গ্রহণ করে এবং হাবীবা তার পিত্রালয়ে গিয়ে অবস্থান করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2228,
			"arabicnumber": 2228,
			"text": "মুহাম্মদ ইবন মু‘আম্মার ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, হাবীবা বিনত সাহাল (রাঃ) সাবিত ইবন কায়স ইবন শাম্‌মাসের স্ত্রী ছিলেন। সে তাকে মারধর করলে তার শরীররে কোনো অঙ্গ ভেঙ্গে আয়। সে (হাবীবা) ফজরের নামাযের পর নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসে এবং সাবিতের বিরূদ্ধে তাঁর নিকট অভিযোগ করে। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাবিতকে ডাকেন এবং বলেন, তুমি তোমার প্রদত্ত মাহরের মাল গ্রহণ করো এবং তাকে ত্যাগ করো। সে (সাবিত) জিজ্ঞাসা করে, হে আল্লাহ্‌র রাসুল! তা কি উত্তম হবে? তিনি বলেন, হ্যাঁ। তখন সে বলে, আমি তাকে তার মাহর স্বরূপ দু‘টি বাগান প্রদান করেছিলাম এবং সে এখন তার মালিক, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তুমি তা গ্রহণ করো এবং তাকে ত্যাগ করো। সে (সাবিত) এরূপই করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2229,
			"arabicnumber": 2229,
			"text": "মুহাম্মদ ইবন আবদুর রহীম ...... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, সাবিত ইবন কায়সের স্ত্রী তার নিকট হতে খুলা তালাক গ্রহণ করে। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার ইদ্দতের সময় একটি হায়েয নির্ধারণ করেন। ইমাম আবূ দাঊদ (রহঃ) বলেন, এ হাদীসটি ইকরামা (রহঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে মুরসাল (হাদীস হিসাবে) বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2230,
			"arabicnumber": 2230,
			"text": "আল্ কা‘নবী .... ইবন উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, খুলা তালাকপ্রাপ্তা মহিলার ইদ্দত হলো এক হায়েয মাত্র।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2231,
			"arabicnumber": 2231,
			"text": "মূসা ইবন ইসমাঈল ..... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, মুগীস একজন ক্রীতদাস ছিল (আর সে ছিল বুরায়রার স্বামী) সে বলে, ইয়া রাসূলাল্লাহ্ ! আপনি তাকে (বুরায়রাকে) আমার জন্য একটু সুপারিশ করুন! রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বলেন, হে বুরায়রা! তুমি আল্লাহকে ভয় করো। আর সে তোমার স্বামী এবং তোমার সন্তানদের পিতা (কাজেই তোমার জন্য বিচ্ছিন্ন হওয়া উচিত হবে না)। সে বলে, ইয়া রাসূলাল্লাহ্! আপনি কি আমাকে তার সাথে থাকতে নির্দেশ দিচ্ছেন? তিনি বলেন, না, বরং আমি একজন সুপারিশকারী। এ সময় মুগীসের অশ্রু গড়িয়ে তাঁর গন্ডদেশে পড়তে থাকলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আব্বাস (রাঃ)-কে বলেন, তুমি কি বুরায়রার প্রতি মুগীসের ভালবাসা এবং মুগীসের প্রতি বুরায়রার ক্রোধ দেখে আশ্চর্য হবে না?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2232,
			"arabicnumber": 2232,
			"text": "উসমান ইবন আবূ শায়বা .... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, বুরায়রার স্বামী ছিল একজন হাবশী ক্রীতদাস. যার নাম ছিল মুগীস। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে (বুরায়রাকে) তার স্বামীকে পরিত্যাগ করার ইখতিয়ার প্রদান করেন এবং তাকে ইদ্দত গণনার নির্দেশ দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2233,
			"arabicnumber": 2233,
			"text": "উসমান ইবন আবূ শায়বা বুরায়রার ঘটনা সম্পর্কে বলেন, তার স্বামী ছিল ক্র্যীতদাস। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে ইখতিয়ার (ইচ্ছাধিকার) প্রদান করেন; সে সেচ্ছায় বিচ্ছিন্ন হয়ে যায়। আর যদি সে (বুরায়রার স্বামী) আযাদ হতো তবে তার ইখতিয়ার থাকতো না। [\"স্বামী আযাদ হতো তবে তার ইখতিয়ার থাকতোনা\" এ অংশটুকু মুদরাজ]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2234,
			"arabicnumber": 2234,
			"text": "উসমান ইবন আবূ শায়বা ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বুরায়রাকে ইখতিয়ার (ইচ্ছাধিকার) প্রদান করেন; এমতাবস্থায় যে, তার স্বামী ছিল ক্রীতদাস।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2235,
			"arabicnumber": 2235,
			"text": "ইবন কাসির ...... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, বুরায়রার স্বামী (মুগিস) আযাদ ব্যক্তি ছিল,যখন সেও মুক্ত হয়, আর তাকে ইখতিয়ার প্রদান করা হলে সে বলে, আমি তার (স্বামীর) সাথে থাকতে পছন্দ করিনা। আর আমার অসুবিধা এরূপ সেরূপ। [স্বামী আযাদ হওয়ার কথাটি মুদরাজ। যা আসওয়াদের উক্তি থেকে এসেছে।]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2236,
			"arabicnumber": 2236,
			"text": "আবদুল আযীয ইবন ইয়াহ্ইয়া ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, বুরায়রা সে সময় মুক্ত হয়, যখন সে আবূ আহমদ গোত্রের ক্রীতদাস মুগীসের স্ত্রী ছিল। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে ইখতিয়ার প্রদান করে বলেন, এখন যদি সে তোমার সাথে সহবাস করে, তবে তোমার ইখতিয়ার বাতিল হয়ে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2237,
			"arabicnumber": 2237,
			"text": "যুহায়র ইবন হারব ও নাসর ইবন আলী ..... আয়েশা (রাঃ) হতে বর্ণিত। একদা তিনি তাঁর দু‘জন দাস-দাসীকে আযাদ করার ইচ্ছা করেন, যারা পরস্পরে বিবাহিত ছিল। রাবী (কাসিম) বলেন, তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এতদসম্পর্কে জিজ্ঞাসা করলে, তিনি তাঁকে প্রথমে দাস (পুরুষ) কে ও পরে দাসীকে আযাদ করার নির্দেশ দেন। (কারণ প্রথমে দাসীকে মুক্ত করা হলে দাসের সাথে তার বিবাহে বিচ্ছেদ ঘটানোর অধিকার সে হয়ত প্রয়োগ করতে পারে। কিন্তু পুরুষকে মুক্ত করলে এ আশংকা থাকে না)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2238,
			"arabicnumber": 2238,
			"text": "উসমান ইবন আবূ শায়বা .... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে প্রথমে এক ব্যক্তি ইসলাম গ্রহণ করে, পরে তার স্ত্রী ইসলাম কবূল করে। সে ব্যক্তি বলে, হে আল্লাহ্‌র রাসুল! সে তো আমার সাথেই ইসলাম কবূল করেছে। তিনি তাকে (স্ত্রীকে) তার নিকট ফিরিয়ে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2239,
			"arabicnumber": 2239,
			"text": "নাসর ইবন আলী .......... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে জনৈকা মহিলা ইসলাম গ্রহণ করে। এরপর সে (মদীনাতে) একজনকে বিবাহ করে। এরপর তার (পূর্বের ) স্বামী নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আগমণ করে বলে, ইয়া রাসূলাল্লাহ্! আমি তো ইসলাম কবূল করেছি। আর আপনি আমার ইসলাম কবূল করা সম্পর্কে অবহিত আছেন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উক্ত মহিলাকে, তার পরবর্তী স্বামীর নিকট হতে নিয়ে প্রথম স্বামীর নিকট প্রদান করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2240,
			"arabicnumber": 2240,
			"text": "আবদুল্লাহ্ ইবন মুহাম্মদ আল্ নুফায়লী .... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কন্যা যায়নাবকে (তার স্বামী) আবুল আসের নিকট প্রথম বিবাহের সূত্রে ফিরিয়ে দেন এবং এ জন্য নতুন কোন মাহর ধার্য করেননি। রাবী মুহাম্মদ ইবন আমর তাঁর হাদীসে বলেন, (এ প্রত্যাবর্তন ছিল) ছয় বছর পর। তবে হাসান ইবন আলী (রাঃ) বলেন, দু‘বছর পর (ঐ পর্যন্ত যায়নাবের অপর কোন বিবাহ হয়নি।)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2241,
			"arabicnumber": 2241,
			"text": "মুসাদ্দাদ ..... ওয়াহব আল্-আসাদী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি যখন ইসলাম কবুল করি তখন আমার আটজন স্ত্রী ছিল। তিনি বলেন, আমি এ সম্পর্কে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে অবহিত করলে তিনি বলেন, তুমি এদের মধ্যে চারজনকে গ্রহণ করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2242,
			"arabicnumber": 2242,
			"text": "আহমাদ ইবরাহীম ..... কায়স ইবন আল্-হারিস (রাঃ) হতে পূর্বোক্ত হাদীসের অনুরূপ হাদীস বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2243,
			"arabicnumber": 2243,
			"text": "ইয়াহইয়া ইবন মু‘ঈন ..... আদ দাহহাক ইবন ফায়রুয তাঁর পিতা হতে বর্ণনা করেছেন। তিনি বলেন, একদা আমি বলি, হে আল্লাহ্‌র রাসুল! আমি ইসলাম কবুল করেছি এবং দুই বোন একই সঙ্গে আমার স্ত্রী হিসাবে আছে। তিনি বলেন, এদের মধ্যে যাকে খুশি তুমি তালাক প্রদান করো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2244,
			"arabicnumber": 2244,
			"text": "ইব্রাহীম ইবন মূসা ..... আবদুল হামীদ ইবন জা‘ফর হতে বর্ণিত। তিনি বলেন, আমার পিতা আমার দাদা রাফি' ইবন সিনান (রহঃ) হতে বর্ণনা করেছেন যে, তিনি ইসলাম গ্রহণ করলেও তাঁর স্ত্রী ইসলাম কবুল করতে অস্বীকার করে। তখন সে (তার স্ত্রী) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপস্থিত হয়ে বলে, সে আমার কন্যা সন্তান! আর সে আমারই মতো। অপর পক্ষে রাফি' দাবি করেন, সে আমার কন্যা! নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে এক পার্শ্বে এবং তার স্ত্রীকে অপর পার্শ্বে বসতে বলেন এবং কন্যা সন্তানটিকে তাদের মাঝখানে বসিয়ে দেন। এরপর তিনি বলেন, এখন তোমরা উভয়ে তাকে আহবান করো। কন্যাটি তার মাতার প্রতি আকৃষ্ট হলে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ইয়া আল্লাহ্! তুমি একে (কন্যাকে) হিদায়াত দান করো। তখন সে তার পিতার প্রতি আকৃষ্ট হয়ে পড়ে এবং সে (রাফি‘) তাকে গ্রহণ করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2245,
			"arabicnumber": 2245,
			"text": "উবায়দুল্লাহ্ ইবন মাসলামা আল্ কা‘নবী ..... ইবন শিহাব (রহঃ) হতে বর্ণিত। তিনি বলেন, সাহল ইবন সা‘দ আস সাঈদী তাকে খবর দিয়েছেন যে, উওয়াইমির ইবন আশকার আল্ আজলানী (রাঃ) আসিম ইবন আদীর নিকট আগমন করেন এবং বলেন, হে আসিম! আমাকে বলুন, যদি কেউ স্ত্রীর সাথে কোন অপরিচিত লোককে এক বিছানায় দেখে সে কি তাকে হত্যা করবে? আর কিসাস্ (বদলা) হিসাবে কি তোমরা তাকে হত্যা করবে নাকি করবে না? তুমি এ সম্পর্কে আমার জন্য হে আসিম! রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে একটু জিজ্ঞাসা করো। আসিম এ সম্পর্কে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করলে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা শুনে অসন্তুষ্টি প্রকাশ করেন এবং তাকে দোষারোপ করেন। এমনকি আসিম রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে যা শ্রবণ করেন তা তার জন্য খুবই ভয়ানক মনে হয়। এরপর আসিম তার পরিবার-পরিজনের নিকট প্রত্যাবর্তন করলে উওয়াইমির তাঁর নিকট গমন করেন এবং বলেন, হে আসিম! রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাকে কী বলেছেন? আসিম বলেন, তুমি আমার নিকট কোনো ভাল বিষয় নিয়ে আগমন করোনি। আমি ঐ মহিলা সম্পর্কে রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে যে প্রশ্ন করেছিলাম তাতে তিনি অসুন্তুষ্টি প্রকাশ করেন। এতদশ্রবণে উয়াইমির বলেন, আল্লাহর শপথ! আমি তার (মহিলার) সম্পর্কে এ প্রশ্নটি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা না করা পর্যন্ত ক্ষান্ত হবো না। উওয়াইমের এমন সময় রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গমন করেন, যখন তিনি মানুষের মাঝে উপবিষ্ট ছিলেন। তিনি বলেন, ইয়া রাসূলাল্লাহ্! যদি কেউ তার স্ত্রীর সাথে অপরিচিত কোনো লোক পায়, তবে এ সম্পর্কে আপনার অভিমত কী? সে কি তাকে হত্যা করবে? আর এজন্য কি তাকে কিসাস্ হিসাবে হত্যা করবেন? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আল্লাহ্ তা‘আলা তোমার ও তোমার স্ত্রীর জন্য কুরআন (আয়াত) নাযিল করেছেন। তুমি যাও এবং তাকে (স্ত্রীকে) নিয়ে এসো। রাবী সাহল বলেন, তারা উভয়ে একে অপরের প্রতি শপথ করে ব্যভিচারের দোষারোপ করতে থাকে এবং আমিও অন্যান্য লোকদের সাথে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট ছিলাম। তারপর তারা যখন অভিসম্পাত ও দোষারোপ করা হতে বিরত হয়, তখন উয়াইমির বলে, যদি এখন আমি তাকে আমার নিকট রাখি, তবে ইয়া রাসুলাল্লাহ্! তার ব্যাপারে আমি লোকদের নিকট মিথ্যুক প্রতিপন্ন হবো। উওয়াইমির নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অনুমতি প্রদানের পূর্বে তাকে (স্ত্রীকে) তিন তালাক প্রদান করেন। রাবী ইবন শিহাব বলেন, আর তাদের মধ্যকার এ বিচ্ছেদ, শপথ করে ব্যভিচারের অপবাদকারীদের জন্য সুন্নাত স্বরূপ হয়ে যায়। (কারণ, এতে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মৌন সম্মতি ছিল।)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2246,
			"arabicnumber": 2246,
			"text": "আবদুল আযীয ইবন ইয়াহ্ইয়া ....... আব্বাস ইবন সাহল (রহঃ) তাঁর পিতা হতে বর্ণনা করেছেন যে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসিম ইবন আদীকে বলেন, তুমি তাকে তোমার নিকট রাখ, যতদিন না সে সন্তান প্রসব করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2247,
			"arabicnumber": 2247,
			"text": "আহমদ ইবন সাহিল ..... সাহল ইবন সা‘আদ আল্ সাঈদী বলেন, তাদের (উয়াইমির ও তার স্ত্রীর) লি‘আনের বিষয়টি যখন রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে পেশ করা হয়, তখন আমি পনের বছরের যুবক ছিলাম। এরপর (রাবী ইউনুস বর্ণিত) হাদীসটি বর্ণিত হয়েছে। তিনি (ইউনুস) অতিরিক্ত বর্ণনা করেছেন যে, এরপর সে গর্ভবতী হওয়া প্রকাশ পায়। আর যে সন্তান সে প্রসব করে তাকে তার মাতার সাথে সম্পর্কিত করা হয়, (পিতার সাথে নয়)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2248,
			"arabicnumber": 2248,
			"text": "মুহাম্মদ ইবন জা‘ফর ..... সাহল ইবন সা‘আদ (রহঃ) হতে, লি‘আন সম্পর্কিত হাদীসটি বর্ণনা হয়েছে। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সব কিছু শ্রবনের পর ইরশাদ করেন, উক্ত মহিলার দিকে তোমার দৃষ্টি রাখ; যদি সে কৃষ্ণবর্ণ চক্ষুবিশিষ্ট এবং পৃষ্ঠে ও রানে অধিক গোশতবিশিষ্ট সন্তান প্রসব করে, যেন সে তারই অংশ; তবে আমার ধারণায় সে (উয়াইমির) মিথ্যাবাদী প্রতিপন্ন হবে। তিনি (সাহল) বলেন, এরপর সে এমন সন্তান প্রসব করে, যাতে উওয়াইমের সত্যবাদী হিসাবে প্রতিপন্ন হয়, (এবং সে মহিলা মিথ্যাবাদী প্রতিপন্ন হয়)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2249,
			"arabicnumber": 2249,
			"text": "মাহমুদ ইবন খালিদ ..... সাহল ইবন সা‘দ আস সাঈদী (রাঃ) হতে পূর্বোক্ত হাদীসের অনুরূপ হাদীস বর্ণিত হয়েছে। রাবী যুহরী (রহঃ) বলেন, এরপর সে সন্তানকে তার মাতার সাথে সম্পর্কিত করে ডাকা হতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2250,
			"arabicnumber": 2250,
			"text": "আহমদ ইবন আমর ইবন সারহ্ .... সাহল ইবন সা‘আদ (রাঃ) হতে পূর্বোক্ত হাদীসের অনুরূপ হাদীস বর্ণিত হয়েছে। রাবী বলেন, তখন সে (উয়াইমির) তাকে রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সম্মুখেই তিন তালাক প্রদান করে। আর রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে তালাক হিসাবে গণ্য করেন। আর সে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর খিদমতে এরূপ করাতে তা সুন্নাতরূপে পরিগণিত হয়। রাবী সাহল বলেন, তা (লি‘আনের ব্যাপারটি) রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হওয়াতে তা পরস্পর ব্যভিচারের দোষারোপকারীদের জন্য সুন্নাত হিসাবে পরিগণিত হয় যে, তাদের মধ্যে বিচ্ছেদ ঘটাতে হবে এবং আর কখনও তাদেরকে একত্রিত করা যাবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2251,
			"arabicnumber": 2251,
			"text": "মুসাদ্দাদ সূত্রে মিলিত সনদে ..... সাহল ইবন সা‘দ (রহঃ) হতে বর্ণিত। রাবী মুসাদ্দাদ তার হাদীসে বর্ণনা করেছেন যে, তিনি (সাহল) বলেন, রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে দু‘জন পরস্পর অভিসম্পাত ও দোষারোপকারীর ব্যাপারটা যখন উপস্থাপিত হয়, তখন আমি সেখানে উপস্থিত ছিলাম এবং এ সময় আমার বয়স ছিল পনর বছর। এরপর তারা শপথ করে পরস্পর অভিসম্পাত ও যিনার দোষারোপ করার পর রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের মধ্যে বিচ্ছেদ ঘটিয়ে দেন। এরূপে মুসাদ্দাদ বর্ণিত হাদীসের বর্ণনা সমাপ্ত হয়েছে। আর অন্যের (সাহলের) বর্ণনা এই যে, তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে তাদের পরস্পরের মধ্যে বিচ্ছেদ ঘটাতে দেখেন। তখন ঐ ব্যক্তি (উওয়াইমির) বলেন, যদি আমি তাকে আমার নিকট রাখি, তবে লোকদের নিকট আমি মিথ্যাবাদী বিবেচিত হব। তবে কোনো কোনো শায়খ,عَلَيْهَا শব্দটির উল্লেখ করেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2252,
			"arabicnumber": 2252,
			"text": "সুলায়মান ইবন দাঊদ আল্ উতাকী ..... সাহল ইবন সা‘দ (রাঃ) হতে এ হাদীসটি বর্ণনা করেছেন। আর সে (মহিলা) ছিল গর্ভবতী, যা সে অপছন্দ করতো। আর তার ভূমিষ্ট সন্তানকে, তার (মহিলার) দিকে সম্পর্কিত করা হতো। এরপর মীরাসে (উত্তরাধিকার আইনে) এটা সুন্নাত হিসাবে নির্ধারিত হয় যে, সে সন্তান তার মায়ের সম্পত্তির এবং মাতা তার (সন্তানের) সম্পত্তির ওয়ারিস হবে। আর তা ঐ হিসাবে, যা আল্লাহ্ তা‘আলা নির্ধারিত করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2253,
			"arabicnumber": 2253,
			"text": "উসমান ইবন আবূ শায়বা .... আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক জুমু‘আর রাতে আমি মসজিদে উপস্থিত ছিলাম। তখন সেখানে জনৈক আনসার প্রবেশ করে এবং বলে, যদি কোন ব্যক্তি তার স্ত্রীর নিকট কোন অপরিচিত ব্যক্তিকে অবৈধ কর্মে লিপ্ত দেখে, এরপর সে তা ব্যক্ত করে, তবে এজন্য কি তোমরা তাকে (মিথ্যাবাদী সাব্যস্ত করে) তার উপর হদ্ (শারী‘আতের শাস্তি বিধান) প্রয়োগ করবে? অথবা তাকে (যিনাকারীকে) হত্যা করার অভিযোগে, তাকেও হত্যা করবে? আর যদি সে এ ব্যাপারে চুপ থাকে, তবে সে গযবের উপর চুপ থাকবে। আল্লাহর শপথ! আমি এ ব্যাপারে অবশ্যই রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞাসা করবো। পরদিন সে ব্যাক্তি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপস্থিত হয়ে জিজ্ঞাসা করে, যদি কোন ব্যক্তি তার স্ত্রীর সাথে কোন ব্যক্তিকে অবৈধ কাজে (যিনায়) লিপ্ত অবস্থায় দেখে, আর সে যদি এ সম্পর্কে কিছু বলে, তখন কি তাকে (মিথ্যা দোষারোপ করার অভিযোগে) শাস্তি দেওয়া হবে? অথবা সে যদি তাকে হত্যা করে তবে হত্যার অভিযোগে কিসাস হিসাবে কি তাকেও হত্যা করা হবে? আর সে যদি এ ব্যাপারে চুপ থাকে, তবে সে গযবের উপরে চুপ থাকবে। তিনি বলেনঃ ইয়া আল্লাহ্! এ ব্যাপারে কী হুকুম আমাকে জ্ঞাত করুন। এরূপ তিনি দু‘আ করতে থাকেন। তখন লি‘আন সম্পর্কীয় আয়াতটি নাযিল হয়ঃ ‘‘যারা তাদের স্ত্রীদের ব্যাপারে যিনার দোষারোপ করে, আর এ ব্যাপারে তারা নিজেরা ব্যতীত কোন সাক্ষ্যদাতা না থাকে’’ ... আয়াতের শেষ পর্যন্ত। তখন লোকদের মধ্য হতে সে ব্যক্তিকে এ ব্যাপারে পরীক্ষা করা হয়। সে ব্যক্তি ও তার স্ত্রী রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে হাযির হয় এবং একে অপরকে হলফ করিয়ে দোষারোপ করে অভিসম্পাত দিতে থাকে। তখন সে ব্যক্তি চারবার আল্লাহকে সাক্ষী রেখে সাক্ষ্য প্রদান করে যে, সে সত্যবাদীদের অন্তর্ভূক্ত, এরপর পঞ্চমবারে সে নিজের উপরই অভিসম্পাত করে, যদি সে মিথ্যাবাদী হয়। রাবী বলেন, এরপর সেই মহিলা শপথ করে অভিসম্পাত করতে গেলে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে ধমক দিয়ে তা করা হতে বিরত থাকতে বলেন। কিন্তু সে তা মানতে অস্বীকার করে এবং অভিসম্পাত করে। এরপর সে যখন প্রত্যাবর্তন করতে থাকে, তখন তিনি বলেনঃ অবশ্যই সে একটি কৃষ্ণকায় স্থুলদেহী সন্তান প্রসব করবে। (কারণ, যার সাথে সে ব্যভিচারে লিপ্ত হয়ে এ সন্তান গর্ভে ধারণ করেছে, তার দৈহিক রূপ ও আকার এরূপই ছিল)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2254,
			"arabicnumber": 2254,
			"text": "মুহাম্মদ ইবন বাশশার ..... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা হিলাল বিন উমাইয়া, তার স্ত্রীর সাথে শুরায়ক ইবন সাহমর অবৈধ প্রণয় সম্পর্কে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট অভিযোগ করে। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বলেন, তুমি এ সম্পর্কে প্রমাণ পেশ করো, নতুবা তোমার উপর হদ্ কায়েম করা হবে। সে বলে, ইয়া রাসূলাল্লাহ্! যখন আমাদের কেউ স্বচক্ষে তার স্ত্রীকে এরূপ কাজে লিপ্ত দেখে, সেখানেও কী সাক্ষীর প্রয়োজন? নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি সাক্ষী পেশ করো, নতুবা মিথ্যা দোপষারোপের অভিযোগে তোমার উপর হদ্ (শাস্তি) কায়েম করা হবে। হিলাল (রাঃ) বলেন, যিনি আপনাকে সত্যসহ প্রেরণ করেছেন, তাঁর শপথ করে বলছি, নিশ্চই আমি সত্যবাদী। আর নিশ্চই আল্লাহ্ তা‘আলা আমার ব্যাপারে এমন আয়াত নাযিল করবেন, যা আমার পৃষ্ঠকে শাস্তি হতে রক্ষা করবে। তখন এ আয়াত নাযিল হয়ঃ (অর্থ) ‘‘যারা তাদের স্ত্রীদের উপরে যিনার দোষারোপ করে, এ ব্যাপারে তারা নিজেরা ব্যতীত আর কোন সাক্ষী না থাকে ... হতেمِنَ الصَّادِقِينَ (বা তারাই সত্যবাদী) পর্যন্ত তিলাওয়াত করেন। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রত্যাবর্তন করেন এবং জনৈক ব্যক্তিকে তাদের ডাকার জন্য নির্দেশ দেন। তারা উভয়ে সেখানে উপস্থিত হলে, হিলাল ইবন উমায়্যা দণ্ডায়মান হন এবং সাক্ষ্য প্রদান করেন। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ্ই অবগত, নিশ্চয় তোমাদের দু‘জনের মধ্যে একজন মিথ্যাবাদী। কাজেই তোমাদের মধ্যে কেউ তাওবাকারী আছ কি? সে যখন পঞ্চমবার সাক্ষ্য প্রদান করে, তখন বলে, তার (নিজের) উপর আল্লাহর গযব (অভিসম্পাত), যদি সে ( তার স্বামী) সত্যবাদীদের অর্ন্তভুক্ত হয়। আর তখন তারা তাকে (মহিলাকে) পঞ্চমবার সাক্ষ্য প্রদানের পরিণতি হিসাবে সতর্ক করে বলেন, অবশ্যই এটা আল্লাহর গযবকে নির্দিষ্ট করবে। ইবন আব্বাস (রাঃ) বলেন, এটা শুনে সে থমকে দাঁড়ায় এবং মুখ ফিরিয়ে নেয়, যাতে আমরা ধারণা করি যে, নিশ্চই সে এহেন অভিশাপের সাক্ষ্য প্রদান হতে বিরত থাকবে। কিন্তু পরক্ষণেই সে বলে, না আমি আমার বংশের কলঙ্ক হব না। সে মহিলা শপথ করে সাক্ষ্য প্রদান করে। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমরা এর দিকে সজাগ দৃষ্টি রাখবে। যদি সে সুরমারঞ্জিত ভ্রু এবং স্থুলগোছা বিশিষ্ট সন্তান প্রসব করে, তবে তা হবে শুরায়ক ইবন সাহমের ঔরসজাত সন্তান। সে মহিলা তদ্রুপ সন্তান প্রসব করলে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যদি এ ব্যাপারে নির্দিষ্টভাবে কুরআনের নির্দেশ না আসত, তবে আমার ও তার (মহিলার) মধ্যকার ফায়সালার ব্যাপারটি সংকটজনক হতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2255,
			"arabicnumber": 2255,
			"text": "মুখাল্লাদ ইবন খালিদ ..... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জনৈক সাহাবীকে নির্দেশ প্রদান করেন, যখন তিনি পরস্পর অভিসম্পাতকারীদ্বয়কে পরস্পর অভিসম্পাত করার জন্য বলেছিলেন, যেনঅভিসম্পাতকারী পঞ্চমবার অভিসম্পাত করার সময় তার মুখে হাত রেখে বলেঃ নিশ্চয় এত (সে মিথ্যাবাদী হলে) শাস্তি অবধারিত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2256,
			"arabicnumber": 2256,
			"text": "আল্ হাসান ইবন আলী .... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা হিলাল ইবন উমাইয়্যা, যিনি ঐ ব্যক্তির একজন ছিলেন, (যারা অকারণে তাবুক যুদ্ধে গমণ করনেনি, যার ফলে অপরাধী সাব্যস্ত হন এবং কান্নাকাটির পর) আল্লাহ্‌তাদের তাওবা কবুল কনে। একদা তিনি তার খামার হতে রাতে প্রত্যাবর্তনের পর তার স্ত্রীর সাথে এক ব্যক্তিকে (শুরায়ক ইবন সাহমকে) যিনায় লিপ্ত দেখতে পান এবং তার দু'কর্ণে তাদের কথোপকথন শ্রবণ করেন। কিন্তু তিনি এতদসত্ত্বেও কোনরূপ বাড়াবাড়ি না করে রাতযাপন করেন। সকালবেলা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে হাযির হয়ে বলেন, ইয়া রাসূলাল্লাহ্! আমি রাতে আমার স্ত্রীর নিকট গমণপূর্বক তার সাথে এক ব্যক্তিকে (ব্যভিচারে লিপ্তবস্থায়) আমার স্বচক্ষে অবলোকন করি এবং তার কথাও আমি স্বকর্ণে শ্রবণ করি। এতে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অসন্তুষ্টি প্রকাশ করেন এবং তার নিকট ইহা খুবই গুরুতর মনে হয়। তখন এ আয়াত নাযিল হয়ঃ (অর্থ) ‘‘যারা তাদের স্ত্রীদের ব্যাপারে যিনার দোষারোপ করে, আর এব্যাপারে (স্ত্রী ব্যভিচারের) তাদের কোন সাক্ষী থাকে না নিজে ব্যতীত’’ ... আয়াতের শেষ পর্যন্ত নাযিল হয়। আর ঐ সময় রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর ওহী নাযিল হওয়াকালীন সময়ের কাঠিন্যতা প্রকাশ পায়। এরপর তিনি বলেনঃ হে হিলাল! তুমি সুসংবাদ গ্রহণ কর। আল্লাহ্ তা‘আলা তোমার ব্যাপারে স্বস্তির বিধান জারি করেছেন। তখন হিলাল (রাঃ) বলেন, আমি আমার রবের নিকট এ রকম কিছুর প্রত্যাশা করেছিলাম। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তাকে এখানে নিয়ে এসো! তখন সে (হিলালের স্ত্রী) সেখানে আসে। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের (উভয়ের) সম্মুখে ঐ আয়াত তিলাওয়াত করেন এবং বলেন, আখিরাতের আযাব দুনিয়ার আযাবের চাইতে ভয়াবহ। হিলাল (রাঃ) বলেন, আল্লাহর শপথ! আমি তার (স্ত্রীর) ব্যাপারে যা বলছি, সত্য বলছি। তার স্ত্রী বলে, সে মিথ্যা বলছে। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সাহাবীদের বলেন, তোমরা তাদের পরস্পরের মধ্যে লি‘আন করতে বল। হিলালকে বলা হয়, তুমি সাক্ষ্য প্রদান কর। তিনি আল্লাহর শপথপূর্বক চারবার বলেন যে, তিনি সত্যবাদীদের অন্তর্ভুক্ত। এরপর তিনি পঞ্চমবারের জন্য সাক্ষ্য দিতে প্রস্তুত হলে তাঁকে বলা হয়, তুমি আল্লাহকে ভয় করো। কেননা, আখিরাতের আযাবের চেয়ে দুনিয়ার আযাব খুবই নগন্য। আর এ সাক্ষ্য (পঞ্চমবারের) তোমার শাস্তিকে অবধারিত করবে (যদি তুমি মিথ্যাবাদী হও)। তিনি বলেন, আল্লাহর শপথ! তিনি আমাকে এজন্য শাস্তি প্রদান করবেন না, যেমন তিনি তার সম্পর্কে বলাতে আমাকে শাস্তি প্রদান করনেনি। অতঃপর তিনি পঞ্চমবারের শাস্তি প্রদানের সময় বলেন, যদি সে (নিজে) মিথ্যাবাদীদের অন্তর্ভূক্ত হয়, তবে তার উপর আল্লাহর লা‘নত (যেন বর্ষিত হয়)। এরপর তার স্ত্রীকে সাক্ষ্য প্রদান করতে বলা হলে, সে চারবার আল্লাহ নামে এরূপ সাক্ষ্য প্রদান করে যে, সে (তার স্বামী) মিথ্যাবাদীদের অন্তর্ভূক্ত। এরপর সে পঞ্চমবার শপথবাক্য উচ্চারণের জন্য প্রস্তুত হলে তাকে বলা হয়, তুমি আল্লাহকে ভয় করো এবং (জেনে রাখ) আখিরাতের আযাবের তুলনায় দুনিয়ার আযাব খুবই নগণ্য। আর এটা তোমার জন্য শাস্তিকে অবধারিত করবে। এতদশ্রবণে সে ক্ষণকালের জন্য থেমে যায় এবং পরে বলে, আমি আমার কাওমের লোকদের হেয় করব না। এরপর সে পঞ্চমবারের মতো সাক্ষ্য প্রদানের সময় বলে, তার (নিজের) উপর আল্লাহর গযব (যেন লালায়িত হয়), যদি সে (তার স্বামী) সত্যবাদীদের অন্তর্ভূক্ত হয়। অতঃপর রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের উভয়ের মধ্যে বিচ্ছেদ ঘটিয়ে দেন এবং ফায়সালা দেন যে, তার গর্ভস্থিত সন্তান যেন তার পিতার সাথে সম্পর্কিত না করা হয়। আর সেই মহিলাকে যেন যিনাকারী হিসাবে এবং তার সন্তানকে যেন ব্যভিচারের ফসল হিসাবে আখ্যায়িত করা না হয়। আর যে ব্যক্তি তাকে (মহিলাকে) ব্যভিচারীর দোষারোপ করবে অথবা তার সন্তানের প্রতি এরূপ দোষারোপ করবে তার উপর হদ (শরী‘আতের শাস্তি বিধান) জারি করা হবে। আর তিনি এরূপ সিদ্ধান্ত ব্যক্ত করেন যে, তার উপর (স্বামীর) ঐ মহিলার থাকার জন্য এবং ভরণ পোষণের জন্য কোনরূপ দায়-দায়িত্ব বর্তাবে না। কেননা, তারা তালাক ব্যতীত উভয়েই বিচ্ছিন্ন হয়েছে। আর সে (স্বামী) তার প্রতি দৃষ্টিপাতও করতে পারবেনা। এরপর তিনি বলেনঃ সে যদি স্থুল (পায়ের) গোছাবিশিষ্ট, লাল চুল বিশিষ্ট (যার উপরিভাগ কালো) এবং হালকা পাতলা গড়নের সন্তান প্রসব করে তবে তা হবে হিলালের সন্তান। অপর পক্ষে, সে যদি স্বাস্থ্যবান, মোটাতাজা সন্তান প্রসব করে, তবে তার গর্ভজাত সন্তান হবে, যার প্রতি দোষারোপ করা হয়েছে। সে (মহিলা) মোটাতাজা, স্বাস্থ্যবান একটি সন্তান প্রসব করল। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যদি সে আল্লাহর নামে সাক্ষ্য প্রদান না করতো, তবে তার ও আমার মধ্যকার ফায়সালার ব্যাপারটি অন্যরকম হতো। রাবী ইকরামা বলেন, পরবর্তীকালে সে (সন্তান) মুদের গোত্রের আমীর হয়। কিন্তু তাকে তার পিতার সাথে সম্পর্কিত করা হতো না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2257,
			"arabicnumber": 2257,
			"text": "আহমাদ ইবন হাম্বল ..... আমর ইবন সাঈদ ইবন জুবায়র বলেন, আমি ইবন উমার (রাঃ)-কে বলতে শুনেছি, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ব্যভিচারের পরস্পর অভিসম্পাতকারীদের সম্পর্কে ইরশাদ করেছেনঃ তোমাদের হিসাব আল্লাহর উপর ন্যস্ত। আর অবশ্যই তোমাদের দুজনের মধ্যে একজন মিথ্যাবাদী। আর তোমার তার (স্ত্রীর) উপর কোন অধিকার নেই। তখন সে (স্বামী) জিজ্ঞাসা করে, ইয়া রাসূলাল্লাহ্! আমার প্রদত্ত মালের (মাহর) বিষয় কী? তিনি বলেনঃ যদি তুমি তার ব্যাপারে সত্য কথাও বলে থাকো, তবুও তোমার দেয়া মাল (মাহর) তুমি ফেরত পাবে না আর তা এজন্য যে, তুমি তার যৌনাঙ্গ এর বিনিময়ে হালাল করেছিলে। আর যদি তুমি তার সম্পর্কে মিথ্যা বলে থাকো তবে তো এ সম্পর্কে কোন কথাই ওঠতে পারে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2258,
			"arabicnumber": 2258,
			"text": "আহমাদ ইবন হাম্বল .... সাঈদ ইবন জুবায়র বলেন, আমি ইবন উমার (রাঃ)-কে বলি, যদি কেউ তার স্ত্রীর উপর মিথ্যে দোষারোপ করে, তবে কি তাদের মধ্যে বিচ্ছেদ ঘটাতে হবে? তিনি বলেন, রাসুলুল্লহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনী আজলান গোত্রস্থিত আমার ভাই ও তার স্ত্রীর মধ্যে বিচ্ছেদ ঘটিয়ে দেন। এরপর তিনি বলেন, আল্লাহ সবই অবগত। তবে নিশ্চই তোমাদের মধ্যে একজন মিথ্যেবাদী, কাজেই তোমাদের দু'জনের মধ্যে কেউ তওবাকারী আছে কি? এরূপ তিনি তিনবার উচ্চারন করলেন। এরপর তারা উভয়ে এরূপ করতে অস্বীকার করলে তিনি তাদের মধ্যে বিচ্ছেদ ঘটিয়ে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2259,
			"arabicnumber": 2259,
			"text": "আল্ কা‘নবী ..... ইবন উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে জনৈক ব্যক্তি তার স্ত্রী সম্পর্কে লি‘আন করে এবং স্ত্রীর গর্ভস্থিত সন্তানকে তার ঔরসজাত নয় বলে। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের মধ্যে বিচ্ছেদ ঘটিয়ে দেন এবং সন্তানের সম্পর্ক মায়ের সাথে স্থির করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2260,
			"arabicnumber": 2260,
			"text": "ইবন আবূ খালফ ..... আবূ হুরায়রা হতে বর্ণিত। তিনি বলেন, একদা বনূ ফাযারা গোত্রের জনৈক ব্যক্তি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপস্থিত হয়ে বলেন, আমার স্ত্রী কৃষ্ণবর্ণের একটি সন্তান প্রসব করেছে (যাকে আমার সন্তান হিসাবে আমি অস্বীকার ও সন্দেহ করি)। তিনি তাকে জিজ্ঞাসা করেন, তোমার কি কোন উট আছে? সে বলে, হ্যাঁ, আছে। পুনরায় তিনি জিজ্ঞাসা করেন, এর রং কিরূপ? সে বলে, প্রায় লাল বর্ণের। তিনি পুনরায় তাকে জিজ্ঞাসা করেন, আচ্ছা, এর মধ্যে কাল রংয়ের কিছু পশম আছে কি? সে বলে, হ্যাঁ, এর দেহে অনেক কালো পশমও আছে। তিনি বলেন, আচ্ছা তা কোথা হতে এলো? সে বলে, হয়ত তা তার বংশের কারণে। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, এ সন্তানও হয়ত তার আসল বংশের প্রভাবে এরূপ হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2261,
			"arabicnumber": 2261,
			"text": "হাসান ইবন আলী ..... ইমাম যুহরী (রহঃ) হতে পূর্বোক্ত হাদীসের সনদ ও অর্থে হাদীস বর্ণিত হয়েছে। তবে মা‘মার অতিরিক্ত বর্ণনা করেছেন যে, ঐ ব্যক্তি তখনও তার ঔরসজাত সন্তান হিসাবে তাকে গ্রহণ করতে অস্বীকার করতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2262,
			"arabicnumber": 2262,
			"text": "আহমাদ ইবন সালিহ .... আবূ হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, জনৈক বেদুঈন নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে এসে বলে, আমার স্ত্রী একটি কাল রং বিশিষ্ট সন্তান প্রসব করেছে, আর আমি তাকে অস্বীকার করি (যে, সে আমার ঔরসজাত নয়)। এরপর রাবী ইউনুস, পূর্বোক্ত হাদীসের অনুরূপ অর্থে হাদীস বর্ণনা করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2263,
			"arabicnumber": 2263,
			"text": "আহমদ ইবন সালহ্ ..... আবূ হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, তিনি রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে ইরশাদ করতে শুনেছেন, যখন পরস্পর অভিসম্পাতকারীদের সম্পর্কে আয়াত নাযিল হয়ঃ যে স্ত্রীলোক কোন কাওমের মধ্যে প্রবেশ করায় (এমন সন্তান) যা তাদের নয়; (অর্থাৎ অন্যের সাথে ব্যভিচারের ফলে গর্ভবতী হয়); সে আল্লাহর রহমত প্রাপ্ত হবে না এবং আল্লাহ্ তাকে কখনই জান্নাতে প্রবেশ করাবেন না। আর যে ব্যক্তি তার ঔরসজাত সন্তানকে অস্বীকার করে, অথচ সে (সন্তান) তার দিকেই চেয়ে থাকে; আল্লাহ্ তা‘আলা তাকেও তাঁর রহমত হতে বঞ্চিত করবেন এবং তাকে (কিয়ামতের দিন) পূর্বাপর সমস্ত মাখলুকের সম্মুখে অপমানিত করবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2264,
			"arabicnumber": 2264,
			"text": "ইয়া‘কুব ইবন ইবরাহীম .... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ ইসলামের মধ্যে ব্যভিচারের কোন স্থান নেই। জাহিলিয়াতের যুগে যারা ব্যভিচারে লিপ্ত হয়েছে, এর ফলে সৃষ্ট সন্তানেরা তাদের সাথে সম্পর্কিত হবে। যে ব্যক্তি ব্যভিচারের কারণে সৃষ্ট সন্তানের দাবি করবে, সে তার ওয়ারিস হবে না এবং সে সন্তানও তার উত্তরাধিকারী হতে পারবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2265,
			"arabicnumber": 2265,
			"text": "শায়বান ইবন ফাররুখ .... ‘আমর ইবন শু‘আয়ব তাঁর পিতা হতে, তিনি তাঁর দাদা হতে বর্ণনা করেছেন। তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইসলামের প্রথম যুগে ফায়সালা করতেন যে, প্রত্যেক উত্তরাধিকারী, তার পিতার মৃত্যুর পর তার সম্পত্তির উত্তরাধিকারী হবে, যাকে সে তার উত্তরাধিকারী হিসাবে স্বীকার করে। আর তিনি এরূপ ফায়সালা করতেন, যে ব্যক্তির কোন দাসীর গর্ভে সন্তান লাভ করবে, সে তার (সন্তানের) মালিক হবে তার সাথে সহবাসের দিন হতে। আর সে তারই সাথে সম্পর্কিত হবে, যদি সে তাকে জীবিতাবস্থায় অস্বীকার না করে। (আর যদি তাকে অস্বীকার করে) এমতাবস্থায় সে তার সম্পত্তির ওয়ারিস হবে না। আর বণ্টনের পূর্বে সে যে সম্পদের উত্তরাধিকারী হবে, তা তারই প্রাপ্য। আর সে (সন্তান) যার সাথে সম্পর্কিত হয়, সে যদি তাকে (সন্তান হিসাবে গ্রহণ করতে) অস্বীকার করে তবে সে সম্পত্তি পাবে না। আর যদি সে সন্তান কোন দাসীর হয়, যার সে মালিক নয় অথবা কোন স্বাধীন স্ত্রীলোকের, যার সাথে সে যিনা করে; এমতাবস্থায় সে তার ওয়ারিস হবে না এবং তার পরিত্যক্ত সম্পদও পাবে না। আর যাকে তার সাথে সম্পর্কিত করা হয়, আর সেও সম্পর্কিত হয়— সে ব্যভিচারের ফলে সৃষ্ট (সন্তান), চাই সে দাসীর গর্ভেই হোক বা স্বাধীন স্ত্রীলোকের গর্ভে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2266,
			"arabicnumber": 2266,
			"text": "মাহমূদ ইবন খালিদ ..... মুহাম্মাদ ইবন রাশেদ হতে পূর্বোক্ত হাদীসের সনদে ও অর্থে হাদীস বর্ণিত হয়েছে। তবে রাবী খালিদ অতিরিক্ত বর্ণনা করেছেন যে, সে ব্যভিচারের কারণে সৃষ্ট মায়ের কারণে সন্তান হবে, চাই সে দাসী হোক বা স্বাধীন স্ত্রীলোক। আর এরূপ নির্দেশ ছিল ইসলামের প্রাথমিক যুগে। আর ইসলাম পূর্বে যে মাল বণ্টিত হয়েছে, তা তো গত হয়ে গেছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2267,
			"arabicnumber": 2267,
			"text": "মুসাদ্দাদ .... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট প্রবেশ করেন, রাবী মুসাদ্দাদ ও ইবন সারহ্ বলেন, সন্তুষ্টচিত্তে। রাবী উসমান বলেন, তাঁর চেহারায় সন্তুষ্টির আভা প্রকাশ পেয়েছিল। এরপর তিনি বলেনঃ হে আয়েশা! তুমি কি দেখনি, মুজরায় মুদলেজী দেখতে পেল যে, যায়িদ ও উসামা (রাঃ) তাদের মস্তক চাদর দিয়ে আবৃত করে রেখেছেন; আর তাদের উভয়ের পা ছিল খোলা, তখন সে বলল, নিশ্চই এ পাগুলো, একে অপরের থেকে। (অর্থাৎ এদের মধ্যে রক্ত সম্পর্ক রয়েছে।) ইমাম আবূ দাঊদ (রহঃ) বলেন, উসামা (রাঃ) ছিলেন কালো আর যায়িদ (রাঃ) ছিলেন গৌর বর্ণের।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2268,
			"arabicnumber": 2268,
			"text": "কুতায়বা ..... ইবন শিহাব হতে পূর্বোক্ত হাদীসের সনদে ও অর্থে হাদীস বর্ণিত হয়েছে। তিনি বলেন, তাঁর চেহারায় সন্তুষ্টির ভাব প্রকাশ ছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2269,
			"arabicnumber": 2269,
			"text": "মুসাদ্দাদ .... যায়িদ ইবন আরকাম (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা আমি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপবিষ্ট ছিলাম। তখন ইয়ামান হতে জনৈক ব্যক্তি আগমণ করে এবং বলে, ইয়ামানের তিন ব্যক্তি আলী (রাঃ) এর নিকট উপস্থিত হয়ে একটি সন্তানের (মালিকানা) সম্পর্কে ঝগড়ায় লিপ্ত হয়, যারা একটি স্ত্রীলোকের সাথে একই তুহুরে উপগত হয়। তিনি (আলী) বলেন, বেশ তাহলে সন্তানটি তোমাদের দু‘জনের। এ সিদ্ধান্ত গ্রহণেও তারা অস্বীকৃতি জানায়। তিনি (আলী) বলেন, তোমরা পরস্পর ঝগড়াকারী, কাজেই আমি তোমাদের মধ্যে লটারীর ব্যবস্থা করব। আর লটারীতে যার নাম ওঠবে, সে সন্তানের পিতা সাব্যস্থ হবে। আর সে ব্যক্তিকে অপর দু‘ব্যক্তির জন্য দু‘তৃতীয়াংশ ক্ষতিপূরণ হিসাবে প্রদান করতে হবে। এরপর তিনি তাদের মধ্যে লটারীর ব্যবস্থা করেন এবং লটারীতে যার নাম আসে, তাকে তিনি সন্তান প্রদান করেন। এতদশ্রবণে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এত জোরে হেসে ওঠেন যে, তাঁর সম্মুখের ও পার্শ্ববর্তী দাঁতসমূহ প্রকাশিত হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2270,
			"arabicnumber": 2270,
			"text": "হাশীশ্ ইবন আসরাম .... যায়িদ ইবন আরকাম (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা আলী (রাঃ) এর নিকট ইয়ামানের তিন ব্যক্তি আগমণ করে, যারা একই তুহরের মধ্যে জনৈকা স্ত্রীলোকের সাথে সহবাস করে। তিনি তাদের দু‘জনকে বলেন, আমি এ সন্তানকে তৃতীয় ব্যক্তির জন্য নির্ধারিত করেছি। তারা উভয়ে তা মানতে অস্বীকার করে, বরং তারা সকলে তাকে স্বীয় ঔরসজাত সন্তাস হিসাবে দাবি করে। তিনি বলেন, তবে তা তোমাদের দু‘জনের সন্তান। তিনি সে সন্তানকে তার জন্য নির্ধারিত করেন এবং সে ব্যক্তির উপর দু‘তৃতীয়ংংশ ক্ষতিপূরণ হিসাবে ধার্য করেন। এ ঘটনা নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট বর্ণনা করা হলে তিনি এত জোরে হাসেন যে, তাঁর সম্মুখদিকের দাঁত দেখা যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2271,
			"arabicnumber": 2271,
			"text": "উবায়দুল্লাহ্ ইবন মু‘আয .... খলীল অথবা ইবন খলীল (রহঃ) হতে বর্ণিত। তিনি বলেন, আলী (রাঃ) এর নিকট একটি স্ত্রীলোকের ব্যাপারে পেশ করা হয়, যে তিনজন পুরুয়ের সাথে সহবাসের ফলে সন্তান প্রসব করে। এরপর পূর্ববর্তী হাদীসের অনুরূপ হাদীস বর্ণিত হয়েছে। আর তিনি ইয়ামান ও নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সম্পর্কে কিছুই উল্লেখ করেননি এবং তিনিطِيبَا بِالْوَلَدِ শব্দটিরও উল্লেখ করেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2272,
			"arabicnumber": 2272,
			"text": "আহমদ ইবন সালিহ্ .... উরওয়া ইবন যুবায়র (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়েশা (রাঃ) তাঁকে বলেছেন, জাহিলিয়াতের যুগে চার বিবাহ চালু ছিল। এর মধ্যে এক ধরণের বিবাহ এরূপ ছিল, যেমন আজকালের বিবাহ। বিবাহ ইচ্ছুক পুরুষ পাত্রীর পুরুষ অভিভাবকের নিকট বিবাহের প্রস্তাব করতো। এপর সে এর মাহর নির্দ্ধারণ করতো এবং পরে তাকে (স্ত্রীলোককে) মাহর দিয়ে বিবাহ করতো। আর দ্বিতীয় প্রকারের বিবাহ ছিল, যখন কোন পুরুষ তার স্ত্রীকে বলত, যখন তুমি তোমার হায়য হতে পবিত্র হবে, তখন তুমি অমুক ব্যক্তির নিকট গমন করে তার সাথে সহবাস করবে। এ সময় তার স্বামী তার নিকট হতে দূরে সরে থাকত, যতক্ষণ না সে ঐ ব্যক্তির সাথে সহবাসের ফলে সন্তান-সম্ভবা হতো, ততক্ষণ সে তার সাথে সহবাস করতো না। আর যখন সে গর্ভবতী হতো, তখন স্বামী তার সাথে ইচ্ছা হলে সহবাস করতো। আর এরূপ করা হতো সন্তানের বিশেষ বৈশিষ্ট নিরূপনের জন্য। এ বিবাহকে নিকাহে ইস্তিবযা বলা হতো। আর তৃতীয় প্রকারের বিবাহ ছিল, অনধিক দশজন পুরূষ একজন স্ত্রীলোককে বিবাহ করতো আর তারা সকলেই পর্যায়করমে তার সাথে সহবাস করতো। এরপর সে গর্ভবতী হয়ে সন্তান প্রসবের পর কিছুদিন অতিবাহিত হলে, সে সকলকে তার নিকট আসার জন্য পত্র প্রেরণ করতো, যা প্রাপ্তির পর তারা সকলেই সেখানে আসতে বাধ্য হতো। এরপর তারা সকলে সমবেত হলে, সে নারী বলতো, তোমরা তোমাদের কর্ম সম্পর্কে অবশ্যই অবগত আছ, যার ফলে আমি এ সন্তান প্রসব করেছি। তখন সে তাদের মধ্য হতে তার পছন্দমত একজনের নাম ধরে সম্বোধন করে বলতো, হে অমুক! এ তোমার সন্তান। তখন সে তার সাথে ঐ সন্তানকে সম্পর্কিত করতো। আর চতুর্থ প্রকারের বিবাহ ছিল, বহু লোক একত্রিত হয়ে পর্যায়করমে একটি মহিলার নিকট গমণ করতো। আর যে কেউ তার নিকট সহবাসের উদ্দেশ্যে গমণ করতো, সে কাউকে বাধা প্রদান করতো না। আর এ ধরণের মহিলারা ছিল বেশ্যা। এরা তাদের স্ব-স্ব গৃহের দরজার উপর নিশান লাগিয়ে রাখত, যা তাদের জন্য নিদর্শন স্বরূপ ছিল। যে কেউ তাদের নিকট গমণ করে তাদের সাথে সহবাসে করতে পারত। এরপর সে গর্ভবতী হওয়ার পর, সন্তান প্রসবের পরে তাদের সকলকে তাদের নিকট একত্রিত করতো এবং তাদের নিকট হতে সাযুজ্যতা দাবি করতো। এরপর সে তার সন্তানকে ঐ ব্যক্তির সাথে সম্পর্কিত করতো, যার সাথে সন্তানের সামঞ্জস্যতা পরিদৃষ্ট হতো। আর তাকে তার সন্তান হিসাবে ডাকা হতো এবং সে ব্যক্তি এতে নিষেধ করতো না। এরপর আল্লাহ্ তা‘আলা যখন মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে রাসূল হিসাবে প্রেরণ করেন, তখন তিনি জাহিলিয়াতের যুগে প্রচলিত ঐসব বিবাহ প্রথাকে বাতিল ঘোষণা করেন। আর বর্তমানে ইসলামের অনুসারীদের জন্য যে বিবাহ পদ্ধতি চালু আছে, তিনি তা বলবৎ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2273,
			"arabicnumber": 2273,
			"text": "সাঈদ ইবন মানসূর ও মুসাদ্দাদ ইবন মুসারহাদ ...... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা সা‘দ ইবন আবি ওয়াক্কাস ও আব্‌দ ইবন যাম্‘আ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকটে উপস্থিত হয়ে যাম‘আর দাসীর পুত্র আবদুর রহমান সম্পর্কে ঝগড়া শুরু করেন। সা‘দ বলেন, আমার ভ্রাতা উতবা আমাকে এ মর্মে ওসীয়ত করেছেন যে, যখন আমি মক্কায় আসি তখন আমি যেন অবশ্যই যাম্‘আর দাসী পুত্রের দিকে খেয়াল রাখি। তখন তিনি তাকে ধরে ফেলেন, কেননা সে ছিল তাঁর ভাই উতবার পুত্র। অপরপক্ষে আদ ইবন যাম্‘আ বলেন, সে (আবদুর রহগমান) আমার ভাই। কেননা সে আমার পিতার (ঔরসজাত) দাসী-পুত্র, যে আমার পিতার বিছানায় জন্ম নিয়েছে। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উতবার সাথে তার স্পষ্ট মিল আছে দেখে বলেনঃ সন্তান হলো যার বিছানায় জন্ম নিয়েছে তার এবং যিনাকারীর জন্য প্রস্তর। আর তিনি বলেন, হে সাওদা! তুমি তার থেকে পর্দা করো। মুসাদ্দাদ (রহঃ) তাঁর হাদীসে অতিরিক্ত বর্ণনা করেছেন যে, নবীজীসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হে আবদা! সে তোমার ভাই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2274,
			"arabicnumber": 2274,
			"text": "যুহায়ব ইবন হারব ...... আমর ইবন শু‘আয়ব তাঁর পিতা হতে, তিনি তাঁর দাদা হতে বর্ণনা করেছেন যে, একদা একব্যক্তি দন্ডায়মান হয়ে বলে, হে আল্লাহ্‌র রাসুল! অমুক ব্যক্তি আমার সন্তান। কেননা, জাহিলিয়াতের যুগে আমি তার মায়ের সাথে যিনা করেছিলাম। এতদশ্রবণে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ইসলাম-যুগে এরূপ কোন আহবান করা উচিত নয়। জাহিলিয়াত যুগের কাজকর্ম শেষ হয়ে গেছে। এখন সন্তান যার বিছানায় জন্ম নিয়েছে, তার। আর যিনাকারীর জন্য প্রস্তর (অর্থাৎ বঞ্চনা, সে পিতৃত্ব হতেও বঞ্চিত আর উত্তরাধিকার হতেও বঞ্চিত)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2275,
			"arabicnumber": 2275,
			"text": "মূসা ইবন ইসমাঈল ..... রাবাহ (রহঃ) হতে বর্ণিত। তিনি বলেন, আমাকে আমার পরিবার পরিজনেরা তাদের একটি রোম দেশীয় দাসীর সাথে বিবাহ দেয়। এরপর আমি তার সাথে সহবাস করলে সে আমার ন্যায় একটি কৃষ্ণাকায় পুত্র সন্তান প্রসব করে। আমি তার নাম রাখি আবদুল্লাহ্! এরপর আমি তার সাথে পুনরায় সহবাস করলে সে আমার মতো আরো একটি কৃষ্ণকায় পুত্র সন্তান প্রসব করে। আমি তার নাম রাখি উবাদুল্লাহ্! এরপর তাকে আমার গোত্রের ইউহান্না নামক জনৈক গোলাম ফুঁসলিয়ে তার সাথে অবৈধ সম্পর্ক স্থাপন করে, যার ভাষা ছিল দুর্বোধ্য। এরপর তার সাথে অবৈধ মিলনের ফলে সে যে সন্তান প্রসব করে, সে ছিল ঐ গোলামের সাথে সামঞ্জস্যপূর্ণ। আমি তাকে (দাসীকে) জিজ্ঞাসা করি, ব্যাপার কি? সে স্বীকার করে যে, এটা ইউহান্নার ঔরসজাত সন্তান। এ ব্যাপারটি আমি উসমানের নিকট পেশ করি। রাবী মাহদী বলেন, তিনি (উসমান) তাদের ঊভয়কে এ সম্পর্কে জিজ্ঞাসা করলে, তারা এর (ব্যাভিচারের) সত্যতা স্বীকার করে। তিনি (উসমান) তাদেরকে জিজ্ঞাসা করেন, তোমরা কি এতে রাযী আছ যে, আমি তোমাদের উভয়ের ব্যাপারে ঐরূপ ফায়সালা করব, যেরূপ রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফায়সালা করতেন? আর এ ধরণের ব্যাপারে রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফায়সালা করতেন যে, সন্তান ঐ ব্যক্তির, যে বিছানার মালিক, (অর্থাৎ স্বামীর জন্য)। রাবী বলেন, আমার ধারণা, এরপর তিনি সেই দাসী ও দাসকে, যারা আযাদকৃত ছিল দোররা মারার ব্যাস্থা করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2276,
			"arabicnumber": 2276,
			"text": "মাহমূদ ইবন খালিদ আস সালমী ..... আমর ইবন শু‘আয়ব তাঁর পিতা হতে, তিনি তার দাদা আবদুল্লাহ্ ইবন উমার (রাঃ) হতে বর্ণনা করেছেন যে, একদা জনৈক স্ত্রীলোক বলে, হে আল্লাহ্‌র রাসুল! এ সন্তানটি আমার গর্ভজাত আর সে আমার স্তনের দুগ্ধ পান করছে এবং আমার কোল-ই তার আশ্রয়স্থল। আর তার পিতা আমাকে তালাক দিয়েছে এবং সে একে আমার নিকট হতে ছিনিয়ে নিতে চাচ্ছে। তখন রাসুলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বলেন, তুমি যতদিন না পুনরায় বিবাহ করবে, ততদিন তুমি তার অধিক হকদার।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2277,
			"arabicnumber": 2277,
			"text": "আল্ হাসান ইবন আলী ..... হিলাল ইবন উসামা (রহঃ) হতে বর্ণিত। তিনি বলেন, আবূ মায়মূনা সাল্‌মা যিনি মদীনার কোন এক সত্যবাদী ব্যক্তির আযাদকৃত গোলাম ছিলেন। তিনি বলেন, একদা আমি যখন আবূ হুরায়রা (রাঃ) এর নিকট উপস্থিত ছিলাম, তখন সেখানে পারস্য দেশীয় জনৈক স্ত্রীলোক, তার সাথে একটি পুত্র নিয়ে আগমন করে; যাকে (পুত্র সন্তানকে) সে এবং তার স্বামী, যে তাকে তালাক দিয়েছিল, সন্তান হিসাবে দাবি করতে থাকে। এরপর সে (মহিলা) ফরাসী ভাষায় বলে, হে আবূ হুরায়রা! আমার স্বামী আমার পুত্রকে নিয়ে যেতে চায়। আবূ হুরায়রা (রাঃ) বলেন, তোমরা উভয়ে এর (সন্তানের) ব্যাপারে লটারী করো। এরপর তিনি (আবূ হুরায়রা) যখন তার নিকট জবাবের প্রত্যাশ্যায় ছিলেন, তখন তার স্বামী সেখানে আগমন করে এবং বলে, আমার পুত্রের ব্যাপারে কে আমার সাথে ঝগড়া করতে চায়? আবূ হুরায়রা (রাঃ) বলেন, ইয়া আল্লাহ! আমি এ সম্পর্কে যা শুনেছি, তা ব্যাতীত অধিক কিছু বলব না। একদা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপবিষ্ট থাকাকালে জনৈক মহিলাকে তাঁর নিকট এসে বলতে শুনিঃ ইয়া রাসূলাল্লাহ্! আমার স্বামী আমার সন্তানকে নিয়ে যেতে চায়। আর অবস্থা এই যে, সে (সন্তান) আমাকে আবূ উকবার কুপ হতে এনে পানি পান করায় এবং সে আমার অন্যান্য খিদমতও করে। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, এদের উভয়ের মধ্যে সন্তানের ব্যাপারে লটারীর ব্যাবস্থা করো। তখন তার স্বামী বলে, আমার থেকে আমার সন্তানকে কে ছিনিয়ে নিতে চায়? তখন নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে সন্তানকে সম্বোধন করে বলেন, এ তোমার পিতা এবং এ তোমার মাতা। তুমি এদের মধ্যে যার হস্ত খুশি ধারণ করো। তখন সে (সন্তান) তা মাতার হস্ত ধারণ করলে তাকে নিয়ে সে (মাতা) চলে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2278,
			"arabicnumber": 2278,
			"text": "আল্ আব্বাস ইবন আবদুল আযীম ...... আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, যায়িদ ইবন হারিস মক্কা অভিমুখে রওয়ানা হন। এরপর তিনি মক্কা হতে হামযার কন্যাকে নিয়ে (মাওকিফের দিকে) রওনা হলে জা‘ফর ইবন আবূ তালিব (রাঃ) বলেন, আমি এর (লালন-পালনের) অধিক হকদার, কেননা সে আমার চাচার মেয়ে এবং আমার স্ত্রী হল তার খালা। আল খালা হল মায়ের সমতুল্য। তখন আলী (রাঃ) বলেন, আমি এর অধিক হকদার। কেননা সে আমার চাচার মেয়ে। আর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কন্যা (ফাতিমা) আমার স্ত্রী। আর সেও (ফাতিমা) তার (লালন-পালনের) অধিক হকদার। যায়িদ (রাঃ) বলেন, আমি এর অধিক হকদার। কেননা, আমি তার-ই জন্য বের হয়েছি এবং সফর শেষে মাওকিফে উপনীত হয়েছি। এমন সময় নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বের হলে তাঁর নিকট এ সমস্যা পেশ করা হয়। তখন তিনি সে মেয়ে সম্পর্কে এরূপ ফায়সালা দেন যে, সে জা‘ফরের সাথে অবস্থান করবে। আর এমতাবস্থায় সে তার খালার সাথে অবস্থান করতে পারে। বস্তুত খালা তো মায়েরই মতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2279,
			"arabicnumber": 2279,
			"text": "মুহাম্মদ ইবন ঈসা ...... আবদুর রহমান ইবন আবূ লায়লা (রহঃ) হতে পূর্বোক্ত হাদীসের অনুরূপ হাদীস বর্ণিত হয়েছে। কিন্তু এতে ঘটনার সম্পূর্ণ বর্ণনা নেই। রাবী বলেন, তখন তিনি তাঁর সম্পর্কে এরূপ সিদ্ধান্ত প্রদান করেন যে, সে জা‘ফরের সাথে অবস্থান করবে। কেননা তার খালা তার (জা‘ফরের) নিকটে আছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2280,
			"arabicnumber": 2280,
			"text": "আব্বাস ইবন মূসা ..... আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন আমরা মক্কা হতে বের হই, তখন হামযার কন্যা আমাদের অনুসরণ করে এবং বলতে থাকে, হে চাচা! হে চাচা! তখন আলী (রাঃ) তাকে, তার হস্ত ধারণপূর্বক গ্রহণ করেন এবং ফাতিমা (রাঃ)-কে বলেন, তুমি একে গ্রহণ করো! কেননা, সে তো তোমার চাচার কন্যা। তখন তিনি (ফাতিমা) তার হস্ত ধারণ করেন। এরূপে হাদীস বর্ণিত হয়েছে। রাবী বলেন, অপর পক্ষে জা‘ফর (রাঃ) বলেন, সে তো আমার চাচার মেয়ে এবং তার খালা আমার স্ত্রী। তখন নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে (হামযার কন্যাকে) তার খালার (নিকট থাকার) ফায়সালা প্রদান করেন। তিনি আরো বলেন, খালা মায়ের সমতুল্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2281,
			"arabicnumber": 2281,
			"text": "সুলায়মান ইবন আবদুল হামীদ বাহরানী .......... আসমা বিনত ইয়াযীদ ইবন আল - সাকান আল আনসারীয়া (রাঃ) হতে বর্ণিত। তিনি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে তালাকপ্রাপ্তা হন, আর সে সময় তালাকপ্রাপ্তা রমনীর জন্য ইদ্দত পালনের কোন প্রয়োজন ছিল না। এরপর আল্লাহ্ তা‘আলা আসমার তালাক প্রাপ্তির পর ইদ্দত সম্পর্কিয় আয়াত নাযিল করেন। আর তিনিই ছিলেন সরবপ্রথম মহিলা, যার সম্পর্কে তালাকপ্রাপ্তা মহিলাদের জন্য ইদ্দত পাল প্রয়োজন এ আয়াত নাযিল হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2282,
			"arabicnumber": 2282,
			"text": "আহমদ ইবন মুহাম্মাদ আল মারূযী .... ইবন আব্বাস (রাঃ) হতে বর্নিত। তিনি বলেন, তালাকপ্রাপ্তা মহিলাগণ তিন হায়েয পর্যন্ত নিজেদেরকে নিয়ন্ত্রিত রাখবে (অন্য কারো সাথে বিবাহ হতে)। তিনি আরো বলেন, তোমাদের স্ত্রীদের মধ্যে যারা তাদের হায়েয হতে নিরাশ হয়েছে। (অর্থাৎ যাদের বন্ধ হয়ে গেছে।) তাদের ইদ্দতের সময়সীমা হল তিন মাস। আর পরবর্তী আয়াতের দ্বারা পূরববর্তী আয়াতের নির্দেশ রহিত (বা সংশোধিত) হয়েছে। তিনি আরো বলেন, যদি তোমরা তাদেরকে (স্ত্রীদেরকে) তাদের সাথে সহবাসের পূর্বে তালাক প্রদান করো, তবে তজ্জন্য তাদের উপর তালাকের কারণে কোন ইদ্দত পালনের প্রয়োজন নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2283,
			"arabicnumber": 2283,
			"text": "সাহল ইবন মুহাম্মদ ইবন যুবায়র আসকারী ...... ইবন আব্বাস (রাঃ) ও উমার (রাঃ) হতে বর্ণনা করেছেন যে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হা্ফসা (রাঃ)-কে তালাক প্রদান করেন। এরপর তিনি তাঁকে পুনরায় স্বীয় স্ত্রী হিসাবে গ্রহণ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2284,
			"arabicnumber": 2284,
			"text": "আল্ কা‘নবী ..... ফাতিমা বিনত কায়স (রাঃ) হতে বর্ণিত। তিনি বলেন, নিশ্চই আবূ আমর ইবন হাফস তাকে তিন তালাক বায়েন প্রদান করেন এমতাবস্থায় যে, তিনি অনুপস্থিত ছিলেন। এরপর তিনি তার উকিল মারফত তার (ফাতিমার) নিকট কিছু আটা প্রেরণ করেন, যাতে তিনি অসন্তুষ্টি প্রকাশ করেন। তিনি বলেন, আল্লার শপথ! এর অধিক তোমার কিছুই আমার নিকট পাওনা নেই। তিনি রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপস্থিত হয়ে এ সম্পর্কে তাঁকে অবহিত করেন। তিনি বলেন, তার নিকট তোমার কিছুই পাওনা নেই। এরপর তিনি তাকে উম্মে শুরায়কের ঘরে অবস্থানপূর্বক তার ইদ্দত পূর্ণ করার নির্দেশ দেন। এরপর তিনি বলেন, এ স্ত্রীলোকটি তার অধিক খরচের দ্বারা আমার সাহাবীকে ঢেকে ফেলেছে। তুমি উম্মে মাক্‌তুমের ঘরে অবস্থান কর, আর সে হল একজন অন্ধ লোক, কাজেই সে তোমাকে দেখবে না। এরপর তুমি যখন তোমার ইদ্দত পূর্ণ করবে, তখন আমাকে এ সম্পর্কে খবর দিবে। তিনি বলেন, এরপর আমি আমার ইদ্দত পূর্ণ করে তাঁকে এ সম্পর্কে অবহিত করি এবং বলি যে, মু‘আবিয়া ইবন আবূ সুফিয়ান ও আবূ জাহাম উভয়ে আমার নিকট আমাকে বিবাহের উদ্দেশ্যে পয়গাম পাঠিয়েছে। রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আবূ জাহাম তো তার কাঁধ হতে লাঠি সরায় না (অর্থাৎ অধিক মারধরকারী)। আর মু‘আবিয়া সে তো ফকীর এবং তার কোন মাল নেই। তুমি বরং উসামা ইবন যায়িদকে বিবাহ করো। তিনি বলেন, তা আমার নিকট অপছন্দনীয় মনে হয়। তিনি পুনরায় বলেন, তুমি উসামা ইবন যায়িদকে বিবাহ করো। এরপর তিনি তাকে বিবাহ করেন। এরপর আল্লাহ্ তা‘আলা তার জন্য এতে এত মঙ্গল প্রদান করেন, যা অন্যের জন্য ঈর্ষার বস্তুত পরিনত হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2285,
			"arabicnumber": 2285,
			"text": "মূসা ইবন ইসমাঈল ..... আবূ সালামা ইবন আবদুর রহমান (রহঃ) বলেন, ফাতিমা বিনত কায়স তাকে বলেছেন যে, আবূ হাফস ইবন মুগীরা (তার স্বামী) তাকে তিন তালাক (বায়েন) প্রদান করেন। এরপর পূর্বোক্ত হাদীসের অনুরূপ হাদীস বর্ণিত হয়েছে। তখন খালিদ ইবন ওয়ালীদ এবং বনূ মাখযূম গোত্রের কিছু লোক নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসে এবং বলে, হে আ্ল্লাহর নবী! নিশ্চই আবূ হাফস ইবন মুগীরা তার স্ত্রীকে তিন তালাক দিয়েছে এবং তার জন্য সামান্য খোরপোষ দিয়েছে। এতদশ্রবণে তিনি বলেন, তার জন্য কোন খোরপোষ নেই। এরপর হাদীস বর্ণিত হয়েছে। তবে (ইয়াহইয়া হতে বর্ণিত) রাবী মালিকের হাদীস অধিক সম্পূর্ণ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2286,
			"arabicnumber": 2286,
			"text": "মাহমূদ ইবন খালিদ ..... ইয়াহইয়া (রহঃ) হতে বর্ণিত। তিনি আবূ সালামা হতে, তিনি ফাতিমা বিনত কায়স হতে বর্ণনা করেছেন। তিনি বলেন, আবূ আমর ইবন হাফস আল্ মাখযূমী (রাঃ) তাকে তিন তাক দেন। এরপর পূর্বোক্ত হাদীসের অনুরূপ হাদীস বর্ণিত হয়েছে। তবে খালিদ ইবন ওয়ালীদ (রাঃ) হতে বর্ণিত হাদীসে উল্লেখ আছে যে, রাবী বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তার (ফাতিমার) নিকট এই খবর প্রেরণ করেন যে, সে যেন আমার সাথে পরামর্শের পূর্বে কারও সাথে বিবাহ বন্ধনে আবদ্ধ না হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2287,
			"arabicnumber": 2287,
			"text": "কুতায়বা ইবন সাঈদ ..... ফাতিমা বিনত কায়স (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি বনী মাখযূম গোত্রের জনৈক ব্যক্তির স্ত্রী ছিলাম। তবে সেখানে এরূপ উল্লেখ আছে যে, সে যেন কারও নিকট বিবাহের পয়গাম প্রেরণ না করে। ইমাম আবূ দাঊদ (রহঃ) বলেন, এভাবেই হাদীসটি শা‘বী, বাহী ও আতা (রহঃ) আবদুর রহমান ইবন আসিম, আবূ বাকর ইবন আবূ জাহাম হতে, যারা সকলেই ফাতিমা বিনত কায়স (রাঃ) হতে বর্ণনা করেছেন যে, তার স্বামী তাকে তিন তালাক দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2288,
			"arabicnumber": 2288,
			"text": "মুহাম্মদ ইবন কাসীর ...... ফাতিমা বিনত কায়স (রাঃ) হতে বর্ণিত। তিনি বলেন, তার স্বামী তাকে তিন তালাক প্রদান করেন। তখন নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার থাকার ও খোরপোষের জন্য কিছুই নির্ধারিত করেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2289,
			"arabicnumber": 2289,
			"text": "ইয়াযীদ ইবন খালিদ ..... ফাতিমা বিনত কায়স (রাঃ) হতে বর্ণিত। তিনি বলেন, তিনি আবূ হাফস ইবন আল-মুগীরার স্ত্রী ছিলেন। এরপর আবূ হাফস ইবন আল-মুগীরা তাকে তিন তালাক (বায়েন) দেন। তিনি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপস্থিত হয়ে তার ঘর হতে বহির্গত হওয়া সম্পর্কে ফাওয়া জিজ্ঞাসা করেন। তিনি তাকে ইবন উম্মে মাকতুমের ঘরে (যিনি অন্ধ ছিলেন) গিয়ে থাকার নির্দেশ দেন। রাবী মারওয়ান ইবন হাকাম, তালকপ্রাপ্তা মহিলার জন্য তার ঘর হতে বহিষ্কার সম্পর্কিত ফাতিমা বর্ণিত হাদীসটিকে সত্য বলে গ্রহণ করতে অস্বীকার করেছেন। রাবী উরওয়া বলেন, আয়েশা (রাঃ) ও ফাতিমা বিন্ত কায়সের হাদীসকে অস্বীকার করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2290,
			"arabicnumber": 2290,
			"text": "মুখাল্লাদ ইবন খালিদ ..... ইমাম যুহরী (রহঃ) হতে বর্ণিত। তিনি আবদুল্লাহ্ হতে বর্ণনা করেছেন। তিনি বলেন, মারওয়ান ফাতিমার নিকট কিছু জিজ্ঞাসা করার জন্য প্রেরিত হন। তিনি তাকে অবহিত করেন যে, তিনি আবূ হাফসের স্ত্রী ছিলেন। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলী ইবন আবূ তালিব (রাঃ)-কে ইয়ামানের কোন এক অঞ্চলের আমীর হিসাবে প্রেরণ করেন। আর এ সময় তার (ফাতিমার) স্বামী (আবূ হাফস)ও তাঁর সাথে সেখানে গমণ করে। এরপর সে তাকে (তৃতীয়) তালাক প্রদান করে, যা (তিন তালাকের মধ্যে) অবশিষ্ট ছিল। এরপর সে আয়্যাশ ইবন আবূ রাবী‘আ এবং হারিস ইবন হিশামকে তার খোরপোষ প্রদানের জন্য অনুরোধ করে। তারা বলে, আল্লাহর শপথ! সে গর্ভবতী না হলে, তার জন্য কোন খোরপোষ নেই। সে তাঁর নিকট হতে তার স্বামীর ঘর হতে বের হওয়ার জন্য অনুমতি চাইলে তিনি তাকে অনুমতি প্রদান করেন। এরপর সে জিজ্ঞাসা করে, ইয়া রাসূলাল্লাহ্! আমি কোথায় যাব? রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তুমি ইবন উম্মে মাকতুমের ঘরে গমন করো, কেননা সে অন্ধ। কাজেই তুমি যদি তার নিকট তোমার কাপড় খুলেও রাখ, তবুও সে খেদতে পাবে না (অর্থাৎ সে তোমার ব্যাপারে কিছুই জানতে পারবে না)। এরপর সে তার নিকট অবস্থানকালে তার ইদ্দত অতিক্রান্ত হয়। অবশেষে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে উসামার সাথে বিবাহ দেন। কাবীসা মারওয়ানের নিকট প্রত্যাবর্তন করে এ সম্পর্কে তাকে অবহিত করেন। মারওয়ান বলেন, আমি এ হাদীসটি মাত্র একজন মহিলা ব্যতীত আর কারো হতে শ্রবণ করিনি। কাজেই তার পবিত্রতা সম্পর্কে যারা জানে তাদের নিকট হতে খোঁজ-খবর সংগ্রহ করবো। ফাতিমা তার (মারওয়ানের) এ বক্তব্য শ্রবণের পর বলেন, আমার ও তোমাদের মধ্যে আল্লাহর কিতাব আছে। ‘‘তোমরা তাদেরকে, তাদের ইদ্দতের (অতিক্রান্ত হওয়ার) জন্য তালাক প্রদান করো। এমনকি তোমরা অবহিত নও যে, এরপর আল্লাহ্ কোনো কিছুর সৃষ্টি করবেন। ফাতিমা বলেন, তিনি হায়েয অতিক্রান্ত হওয়ার পর আর কী সৃষ্টি হতে পারে? (অর্থাৎ সন্তান-সম্ভবা হওয়ার কোন কারণই থাকে না।)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2291,
			"arabicnumber": 2291,
			"text": "নাসর ইবন আলী ..... আবূ ইসহাক হতে বর্ণিত। তিনি বলেন, আমি একদা (কুফার) জামে মসজিদে আসওয়াদের সাথে (উপবিষ্ট) ছিলাম। তিনি বলেন, এরপর ফাতিমা বিন্তে কায়স উমার ইবনুল খাত্তব (রাঃ) এর নিকট উপস্থিত হয়ে এ সম্পর্কে অবহিত করলে তিনি বলেন, আমরা আমাদের রবের কিতাব (কুরআন) ও আমাদের রাসূলের সুন্নাতকে একজন মহিলার বক্তব্য অনুসারে পরিত্যাগ করতে পারি না। যে সম্পর্কে আমি জ্ঞাত নই যে, সে সঠিকভাবে উহা (হাদীস) হিফাযত করেছে কিনা?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2292,
			"arabicnumber": 2292,
			"text": "সুলায়মান ইবন দাঊদ ..... হিশাম ইবন উরওয়া তাঁর পিতা হতে বর্ণনা করেছেন। তিনি বলেন, আয়েশা (রাঃ) ফাতিমা বিন্ত কায়স বর্ণিত হাদীসকে কঠোরভাবে সমালোচনা করেছেন এবং তিনি বলেছেন, ফাতিমা একটি ভীতিপ্রদ স্থানে বসবাস করতেন, আর তিনি এর আশেপাশের ভীতি সংকুল পরিবেশের জন্য শংকিত ছিলেন। এমতাবস্থায় রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে এরেূপ অনুমতি প্রদান করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2293,
			"arabicnumber": 2293,
			"text": "মুহাম্মদ ইবন কাসীর ..... উরওয়া ইবন যুবায়র (রাঃ) হতে বর্ণিত। তিনি বলেন, আয়েশা (রাঃ)-কে বলা হয় যে, ফাতিমা বর্ণিত হাদীস সম্পর্কে আপনার অভিমত কী? তিনি বলেন, তার জন্য এ হাদীস বর্ণনা করা কল্যাণকর নয় (কেননা, মানুষ এতে ভুলে পতিত হতে পারে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2294,
			"arabicnumber": 2294,
			"text": "হারূন ইবন যায়দ ...... সুলায়মান ইবন ইয়াসার হতে ফাতিমার বহিস্কৃত হওয়ার হাদীস সম্পর্কে বর্ণিত হয়েছে। রাবী বলেন, তার এ বহিস্কার ছিল তার বদঅভ্যাসের পরিণতিস্বরূপ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2295,
			"arabicnumber": 2295,
			"text": "আল্ কা‘নবী .... কাসিম ইবন মুহাম্মদ ও সুলায়মান ইবন ইয়াসার হতে বর্ণিত। তিনি তাদের নিকট হতে শ্রবণ করেছেন যে, ইয়াহ্ইয়া ইবন সাঈদ ইবনুল ‘আস আবদুর রহমান ইবন আল-হাকামের কন্যাকে তালাক (বায়েন) প্রদান করেন। (তার পিতা) আবদুর রহমান তাকে স্বামীর বাড়ী হতে নিয়ে আসেন। আয়েশা (রাঃ) তাকে মারওয়ানের নিকট প্রেরণ করেন, যিনি (মু‘আবিয়ার পক্ষ হতে) মদীনার গভর্নর ছিলেন। এরপর তিনি তাকে বলেন, আল্লাহকে ভয় করো এবং এ মহিলাকে তার ঘরে অবস্থান করতে দাও। মারওয়ান বলেন, আবদুর রহমান এ ব্যাপারে আমার উপর প্রভাব বিস্তার করেছে। এরপর মারওয়ান রাবী কাসিম বর্ণিত হাদীস সম্পর্কে বলেন, ফাতিমা বিনত কায়স বর্ণিত হাদীস সম্পর্কে আপনার অভিমত কী? তিনি তাকে বলেন, তুমি যদি ফাতিমা বর্ণিত হাদীস বর্ণনা না করো, তবে তাতে দোষের কিছু নেই। মারওয়ান বলেন, যদি আপনি (ফাতিমা ও তার স্বামীর মধ্যকার ব্যাপারটি) কোন খারাপ কাজের পরিণতি হিসাবে মনে করেন, তবে তা আপনার জন্য যথেষ্ট হবে যে এ ব্যাপারটিকেও (উমারা ও তার স্বামীর মধ্যকার ব্যাপার) আপনি তদ্রুপ মনে করবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2296,
			"arabicnumber": 2296,
			"text": "আহমদ ইবন ইউনুস ..... মায়মূন ইবন মিহরান (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি মদীনায় আগমন করি এবং সাঈদ ইবনুল মুসাইয়্যাবের নিকট উপস্থিত হয়ে বলি, ফাতিমা বিনত কায়সকে তালাক দেয়া হয়েছে এবং তাকে তার ঘর হতে বহিস্কার করা হয়েছে। সাঈদ বলেন, সে স্ত্রীলোক তো মানুষকে বিপদে ফেলেছে আর সে মুখোরা রমনী। এরপর তাকে অন্ধ ইবন উম্মে মাকতুমের হস্তে সোর্পদ করা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2297,
			"arabicnumber": 2297,
			"text": "আহমদ ইবন হাম্বল ..... জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, আমার খালাকে তিন তালাক (বায়েন) প্রদান করা হয়। এরপর তিনি খেজুর কর্তনের জন্য গমন করলে জনৈক ব্যক্তির সাথে তার সাক্ষাত হয়, যিনি তাকে (ইদ্দতের সময়ে) ঘর থেকে বের হতে নিষেধ করেন। তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপস্থিত হন এবং এ সম্পর্কে তাঁকে জিজ্ঞাসা করেন। তিনি তাকে বলেন, তুমি বের হও এবং খেজুর কর্তন করো। আর তা হতে কিছু সাদকা করবে অথবা ভাল কাজ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2298,
			"arabicnumber": 2298,
			"text": "আহমাদ ইবন মুহাম্মদ আল মারওয়াযী ..... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহ্ তা‘আলার বাণীঃ ‘‘তোমাদের মধ্যে যারা মৃত্যুবরণ করে এবং তাদের স্ত্রীদের ছেড়ে যায় এরূপ অসীয়াত করে যে, তাদের এক বছর ঘর হতে বহিস্কার না করে খোরপোষ দিতে হবে।’’ এ আয়াতটি মীরাসের আয়াত নাযিলের কারণে মানসূখ বা রহিত হয়ে যায়। সেখানে তাদের এক চতুর্থাুংশ এবং এক অষ্টমাংশ ফরয করা হয়। আর এক বছরের সময়সীমা বাতিল হয় এ জন্য যে, তাদের ইদ্দতের সময়সীমা চার মাস দশদিন নির্ধারিত হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2299,
			"arabicnumber": 2299,
			"text": "আল্ কা‘নবী .... যায়নাব বিনত আবূ সালামা (রাঃ) হতে বর্ণিত। তিনি তাকে (হামিদ ইবন রাফি‘) এ তিনটি হাদীস সম্পর্কে খবর দিয়েছেন। যায়নাব (রাঃ) বলেন, একদা আমি উম্মে হাবীবার নিকট গমন করি। আর এ সময় তার পিতা আবূ সুফইয়ান (রাঃ) মৃত্যুবরণ করেছিলেন। এ সময় তিনি হলুদ রং বিশিষ্ট সুগন্ধি তেল অথবা অন্য কিছুর জন্য আহবান করেন। তদ্দরা একজন দাসী তাঁর কেশে তেল মেখে দেয়। এরপর তিনি চেহারায় তেল মর্দন করেন। অবশেষে তিনি বলেন, আল্লাহর শপথ! সুগন্ধি দ্রব্য ব্যবহারের আমার কোন প্রয়োজন নেই; তবে আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে ইরশাদ করতে শুনেছিঃ যে সমস্ত মহিলা আল্লাহর প্রতি এবং শেষ দিবসের প্রতি ঈমান রাখে, তাদের জন্য মৃত ব্যক্তির উদ্দেশ্যে তিনরাতের অধিক শোক প্রকাশ করা হালাল নয়। তবে স্বামীদের জন্য চারমাস দশদিন শোক প্রকাশ করবে। যায়নাব বিনতে আবূ সালামা (রাঃ) আরো বলেন, একদা আমি যায়নাব বিনতে জাহশের নিকট উপস্থিত হই এবং এ সময় তার ভাই মৃত্যুবরণ করে। তিনি সুগন্ধি দ্রব্য চান এবং তা ব্যবহার করেন। এরপর বলেন, আমার সুগন্ধি দ্রব্য ব্যবহারের কোন প্রয়োজন নেই, তবে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে মিম্বরের উপর ইরশাদ করতে শুনেছি, যে সমস্ত মহিলা আল্লাহ্ ও শেষ দিবসের প্রতি ঈমান রাখে, তাদের জন্য কোন মৃত ব্যক্তির উদ্দেশ্যে তিন রাতের অধিক শোক প্রকাশ করা বৈধ নয়। অবশ্য তারা স্বামীদের জন্য চার মাস দশ দিন শোক প্রকাশ করবে। যায়নাব বিনত আবূ সালামা (রাঃ) আরো বর্ণনা করেন, আমি আমার মাতা উম্মে সালামাকে বলতে শুনেছি, একদা জনৈকা রমনী রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বলে, ইয়া রাসূলাল্লাহ্! আমার কন্যার স্বামী মৃত্যুবরণ করেছে এবং তার চক্ষু অভিযোগ করছে। কাজেই আমি কি তাকে পুনরায় বিবাহ দিব? রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু‘বার বা তিনবার বলেন, না। আর তিনি এ ‘না’ শব্দটি নিষেধাজ্ঞার জন্য ব্যবহার করেন। এরপর রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, বরং তার জন্য ইদ্দতের সময়সীমা হল চার মাস দশ দিন। আর জাহিলিয়াতের যুগে তোমাদের স্ত্রীকে (যাদের স্বামী মারা যেত) বু‘রাতে এক বছরের জন্য নিক্ষেপ করা হতো। রাবী হামিদ বলেন, তখন আমি যায়নাবকে জিজ্ঞসা করি, বু‘রাতে এক বছরের জন্য নিক্ষেপের অর্থ কী? যায়নাব (রাঃ) বলেন, যখন কোন স্ত্রীলোকের স্বামী মারা যেত, তখন সে একটি কুঁড়ে ঘরের মধ্যে প্রবেশ করতো, খারাপ কাপড় পরিধান করতো এবং সুগন্ধি দ্রব্য ব্যবহার করতো না। আর এরূপে এক বছর কাটিয়ে দিত। এরপর তার নিকট কোন প্রাণী যেমন গাধা, বকরী অথবা পক্ষী আনা হতো এবং উহা তার শরীর স্পর্শ করতো, তবে খুব কমই এমন হতো যে, জন্তুটি জীবিত থাকত, বরং অধিকাংশই মরে যেত। তারপর তাকে বের করে এনে জন্তুুর একটি বিষ্ঠা দেয়া হতো, সে উহা নিক্ষেপ করতো। তারপর ইদ্দতান্তে সে সে স্থান হতে বের হয়ে আসতো। এরপর সে হালাল হতো এবং তার খুশিমতো সুগন্ধি দ্রব্য ইত্যাদি ব্যবহার করতে পারত। ইমাম আবূ দাঊদ (রহঃ) বলেন,حفش (হাফস) হল ছোট ঘর বা কুঁড়ে ঘর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2300,
			"arabicnumber": 2300,
			"text": "আবদুল্লাহ্ ইবন মাসলামা আল কা‘নবী ...... সা‘দ ইবন ইসহাক ইবন কা‘ব উজরা তার ফুফু যায়নাব বিনত কা‘ব ইবন উজরা হতে বর্ণনা করেছেন যে, ফারী'আহ বিনত মালিক ইবন সিনান, যিনি আবূ সাঈদ আল- খুদরী (রাঃ) এর বোন ছিলেন, তাকে বলেছেন যে, একদা তিনি রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপস্থিত হয়ে তার গোত্র বনী খাদরাতে প্রত্যাবর্তনের জন্য অনুমতি প্রার্থনা করেন। কেননা, তার স্বামী পলায়নপর গোলামদের অনুসন্ধানে বের হলে, তিনি তাদেরকে কুদুম নামক স্থানে দেখতে পান। এরপর তারা (গোলামেরা) তাকে হত্যা করে। এমতাবস্থায় আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে নিজ পরিবারে নিকট ফিরে যাওয়া সম্পর্কে জিজ্ঞাসা করি। কেননা, সে তার ঘরে আমার জন্য খোরপোষের কোন ব্যবস্থা রেখে যায়নি। রাবী বলেন, রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ হ্যাঁ। রাবী বলেন, এরপর আমি তাঁর নিকট হতে বের হয়ে, হুজরা কিংবা (রাবীর সন্দেহ) মসজিদের মধ্যেই ছিলাম। এমতাবস্থায় তিনি আমাকে ডাকেন অথবা (রাবীর সন্দেহ) ডাকার জন্য নির্দেশ দেন। এরপর আমি তাঁর নিকট ফিরে গেলে, তিনি জিজ্ঞাসা করেন, তুমি কী বলেছিলে? আমি পুনরায় তাঁর নিকট আমার স্বামীর ব্যাপারটি বর্ণনা করি। রাবী বলেন, এতদশ্রবণে তিনি বলেনঃ তোমার ইদ্দত শেষ না হওয়া পর্যন্ত তুমি তোমার (স্বামীর) ঘরে অবস্থান করবে। রাবী বলেন, এরপর আমি সেখানে চারমাস দশদিন অতিবাহিত করি। রাবী বলেন, উসমান (রাঃ) এর খিলাফত কালে, তিনি এ হাদীসটি আমার নিকট হতে শ্রবণের উদ্দেশ্যে এক ব্যক্তিকে পাঠান। সে আমার নিকট এ সম্পর্কে জিজ্ঞাসা করলে আমি তাকে সে সম্পর্কে অবহিত করি। আর তিনি উসমান (রাঃ) এর অনুসরণ করেন এবং ঐ অনুসারে ফায়সালাও দিতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2301,
			"arabicnumber": 2301,
			"text": "আহমদ ইবন মুহাম্মদ ..... ইবন আব্বাস (রাঃ) হতে বর্নিত। তিনি বলেন, এ আয়াতটি মানসুখ হয়ে গিয়েছে, যেখানে উল্লেখ আছে যে, সে তার ইদ্দত তার পরিবারের নিকট পুরা করবে। এরপ নাযিল হয়ঃ ‘‘সে ইদ্দত যেখানে খুশি পুরা করবে’’ এবং তা হল আল্লাহর বাণী, ‘‘বহিস্কার না হয়ে ।’’ (বাকারাঃ ২৪০) রাবী ‘আতা বলেন, যদি সে ইচ্ছা করে, তবে সে তার স্বামীর পরিবারের সাথে অবস্থান করতে পারে, আর যদি সে ইচ্ছা করে, তবে সেখান হতে বের হতে পারে। যেমন আল্লাহর বাণীঃ আর যদি তারা বের হয়ে যায়, তবে এত তোমাদের কোন গুনাহ্ নেই, তাদের কৃত কাজের ব্যাপারে। রাবী ‘আতা বলেন, এরপর মীরাসের আয়াত নাযিল হওয়ার ফলে তাদের অবস্থানকালে নির্দেশ বাতিল হয় এবং যেখানে খুশি ইদ্দত পালনের জন্য থাকতে পারে বলে নির্দেশ দেয়া হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2302,
			"arabicnumber": 2302,
			"text": "ইয়া‘কূব ইবন ইব্রাহীম দাওরিকী ..... উম্মে আতীয়্যা (রাঃ) হতে বর্ণনা করেছেন যে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করছেন, কোন স্ত্রীলোক স্বামী ব্যতীত অন্য কারো মৃত্যুতে তিন দিনের অধিক শোক প্রকাশ করবে না। অবশ্য স্বামীর মৃত্যুতে চার মাস দশদিন শোক পালন করবে। আর এ সময় কোন রঙিন কাপড় পরিধান করবে না, সাদা কাপড় ছাড়া। আর সুরমা ব্যবহার করবে না এবং কোনরূপ সুগন্ধি দ্রব্য ব্যবহার করবে না। অবশ্য হায়েয হতে পবিত্র হওয়ার পর সামান্য সুগন্ধি বস্তু ব্যবহার করতে পারে। রাবী ইয়াকুব ‘আসব’ শব্দের পরিবর্তে ‘মাগ্‌সূলান’ শব্দ ব্যবহার করেছেন। রাবী ইয়া‘কূব আরো বর্ণনা করেছেন যে, সে কোনরূপ খিযাব লাগাতে পারবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2303,
			"arabicnumber": 2303,
			"text": "হারূন ইবন আবদুল্লাহ ..... উম্মে ‘আতিয়্যা (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে পূর্বোক্ত হাদীসের অনুরূপ হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2304,
			"arabicnumber": 2304,
			"text": "যুহায়র ইবন হারব .... নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী উম্মে সালামা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ যে স্ত্রীলোকের স্বামী মৃত্যুবরণ করে সে যেন ইদ্দতকালীন সময়ে রঙিন এবং কারুকার্যমণ্ডিত কাপড় ও অলংকার পরিধান না করে। আর সে যেন খিযাব ও সুরমা ব্যবহার না করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2305,
			"arabicnumber": 2305,
			"text": "আহমদ ইবন সাহিল ..... উম্মে হাকীম বিনত উসায়দ তাঁর মাতা হতে বর্ণনা করেছেন। তিনি বলেন, তাঁর স্বামী মৃত্যুবরণ করে, এ সময় তার চোখে অসুখ থাকায় ‘আসমাদ’ নামীয় সুরমা ব্যবহার করেন। রাবী আহমাদ বলেন, উত্তম হল জালা নামীয় সুরমা। এরপর তিনি তাঁর জনৈক আযাদকৃত গোলামকে উম্মে সালামার নিকট জালা নামীয় সুরমা ব্যবহার সম্পর্কে জানার জন্য প্রেরণ করেন। তিনি বলেন, একান্ত প্রয়োজন এবং কঠিন অবস্থা ব্যতীত তুমি এই সুরমা ব্যবহার করবে না। আর এমতাবস্থায় তুমি তা রাতে ব্যবহার করবে এবং দিনের বেলায় মুছে ফেলবে। এ প্রসংগে উম্মে সালামা (রাঃ) বলেন, যখন আবূ সালামা (রাঃ) ইনতিকাল করেন, তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট আগমণ করেন। আর এই সময় আমি আমার চোখে সুব্‌র নামক বৃক্ষের রস নিংড়িয়ে ব্যবহার করি। তিনি জিজ্ঞাসা করেন, হে উম্মে সালামা! এটা কী? আমি বলি, ইয়া রাসূলাল্লাহ্! এটা সু্বর এবং এতে কোন সুবাস নেই। তিনি বলেন, তা চেহারাকে রঞ্জিত করে। কাজেই তুমি রাতে ব্যতীত তা ব্যবহার করো না এবং দিনে তা মুছে ফেলবে। আর তুমি সুগন্ধি দ্রব্য দ্বারা চিরুনী করবে না এবং মেহেদীও ব্যবহার করবে না, কেননা তা খিযাব স্বরূপ। রাবী বলেন, আমি জিজ্ঞাসা করি, ইয়া রাসূলাল্লাহ্! আমি কোন বস্তু দ্বারা চিরুনী করবো? তিনি বলেন, তুমি কুলের পাতা ব্যবহার করবে এবং একে গেলাফের ন্যায় তোমার মাথায় রাখবে। (অর্থাৎ শোক প্রকাশের নিদর্শন স্বরূপ রঙ্গিন জামা কাপড় ব্যবহার ও প্রসাধনী গ্রহণে বিরত থাকবে।)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2306,
			"arabicnumber": 2306,
			"text": "সুলায়মান ইবন দাঊদ আল্ মাহরী .... ইবন শিহাব যু্হরী (রহঃ) হতে বর্ণিত। তিনি বলেন, উবায়দুল্লাহ্ ইবন আবদুল্লাহ্ ইবন উতবা তাঁকে বলেছেন যে, তাঁর পিতা উমার ইবন আবদুল্লাহ্ ইবন আরকাম আয যুহরীর নিকট এ মর্মে পত্র লেখেন, যেন তিনি তাকে সুবাইয়া বিনত আল হারিস আল্ আসলামীর নিকট গিয়ে তাঁর পক্ষ হতে বর্ণিত হাদীসটির ঘটনা শ্রবণ করতে নির্দেশ দেন। আর তাঁকে রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন কী বলেছেন, যখন তিনি তাঁর নিকট একটি ফাতওয়া জিজ্ঞাসা করেছিলেন, তা জানার জন্য পাঠান। উমার ইবন আবদুল্লাহ্ জবাবে আমাকে লেখেন যে, আবদুল্লাহ্ ইবন উতবা তাঁকে বলেছেন, সুবাইয়া তাঁর নিকট বর্ণনা করেছেন, তিনি সা‘আদ ইবন খাওলার স্ত্রী ছিলেন, যিনি বনী আমের লুয়ী গোত্রের লোক ছিলেন। আর তিনি বদর যুদ্ধে অংশ গ্রহণকারী (সাহাবী) ছিলেন এবং তিনি বিদায় হজ্জের সময় মৃত্যুবরণ করেন, যখন তিনি (সুবাইয়া) গর্ভবতী ছিলেন। আর তাঁর মৃত্যুর পরপরই তিনি সন্তান প্রসব করেন। এরপর নিফসের রক্ত হতে পবিত্রতা হাসিলের পর তিনি বিবাহের পয়গাম প্রেরণের জন্য নিজেকে সুসজ্জিত করেন। এ সময় তাঁর নিকট আবূ সানাবিল ইবন বা‘কা, যিনি বনী আবদুদ্-দার গোত্রের লোক ছিলেন, এসে বলেন, আমি তোমাকে সুসজ্জিত অবস্থায় দেখেছি, মনে হয় তুমি পুনঃবিবাহের ইচ্ছা করছ? আল্লাহর শপথ! তুমি ততক্ষণ পুণঃবিবাহ করতে পারবে না, যতক্ষণ না তুমি তোমার (মৃত স্বামীর) ইদ্দতকাল চার মাস দশদিন পূর্ণ না কর। সুবাইয়া বলেন, তার এরূপ উক্তি শ্রবণের পর, আমি রাতে কাপড়-চোপড় পরিধান করে রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গমণ করি এবং এ সম্পর্কে তাঁকে জ্ঞিাসা করি। তিনি এরূপ ফাতওয়া দেন যে, আমি তখনই হালাল হয়েছি, যখন আমি সন্তান প্রসব করেছি। এরপর তিনি আমাকে প্রয়োজনে বিবাহ করার নির্দেশ দেন। রাবী ইবন শিহাব (রহঃ) বলেন, যদি সে এখন বিবাহ করে, তবে আমি এতে দোষের কিছু দেখি না; যখন সে তার সন্তান প্রসব করেছে। আর এখনও যদি তার নিফাসের রক্ত থাকে, এতেও বিবাহ বন্ধনে কোন বিপত্তি নেই। অবশ্য সে তা হতে পবিত্রতা হাসিলের পর তার স্বামীর সাথে সহবাস করতে পারবে। (অর্থাৎ গর্ভবতীর ইদ্দত সন্তান প্রসব করা পর্যন্ত। প্রসবের পর তার ইদ্দত শেষ হয়ে যায়।)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2307,
			"arabicnumber": 2307,
			"text": "উসমান ইবন আবূ শায়বা ও মুহাম্মদ ইবন ‘আলা ...... আবদুল্লাহ্ ইবন মাসঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, যে ব্যক্তি লি‘আন (পরস্পর অভিসম্পাত) করতে চায়, আমি তার সাথে তা করতে প্রস্তুত। আল্লাহ শপথ! সূরা নিসা, যা তালাকের সূরা হিসাবেও পরিচিত, (স্বামীর মৃত্যুর পর স্ত্রীর ইদ্দত সীমা) \"চার মাস দশ দিন\" এ আয়াত অবতীর্ণ হওয়ার পর নাযিল হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2308,
			"arabicnumber": 2308,
			"text": "কুতায়বা ইবন সাঈদ ..... ‘আমর ইবনুল ‘আস (রাঃ) হতে বর্ণিত। তিনি বলেন, তোমরা আমাদের উপর তাঁর সুন্নাতকে মিশ্রিত করো না। রাবী বলেন,سُنَّةَ نَبِيِّنَا আমাদের নবীর সুন্নাতকে। অর্থাৎ উম্মে ওলাদের ইদ্দত হল, যখন তার স্বামী (বা মনিব) মৃত্যুবরণ করে- চার মাস দশ দিন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2309,
			"arabicnumber": 2309,
			"text": "মুসাদ্দাদ .... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এমন এক ব্যক্তি সম্পর্কে জিজ্ঞাসা করা হয়, যে তার স্ত্রীকে তিন তালাক (বায়েন) প্রদান করে। এরপর সে (মহিলা) অপর একজনের আথে বিবাহ বন্ধনে আবদ্ধ হয় এবং তার সাথে নির্জনবাসও করে। এরপর তার সাথে সহবাসের পূর্বে তাকে তালাক প্রদান করে। এ মহিলা কি প্রথম স্বামীর জন্য হালাল হবে? তিনি (আয়েশা) বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ ঐ মহিলা ততক্ষণ র্পন্ত প্রথম স্বামীর জন্য (পুনরায় গ্রহণ করা) হালাল হবে না, যতক্ষণ না সে দ্বিতীয় সবামীর সহবাস সুখ ভোগ করে এবং সে ব্যক্তিও (দ্বিতীয় স্বামী) তার সাথে দৈহিক মিলনের সুখানুভব করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2310,
			"arabicnumber": 2310,
			"text": "মুহাম্মদ ইবন কাসীর ..... আবদুল্লাহ্ ইবন মাস্ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি জিজ্ঞাসা করি, ইয়া রাসূলাল্লাহ্! সবচাইতে বড় গুনাহ্ কোনটি? তিনি বলেন, যদি তুমি তোমার রবের সাথে শরীক করো, আর অবস্থা এই যে, তিনি তোমার স্রষ্টা। তিনি বলেন এরপর আমি জিজ্ঞাসা করি, এরপর কোনটি? তিনি বলেন, তুমি যদি তোমার সন্তানকে এই ভয়ে হত্যা করো যে, সে তোমার সাথে খাবে। তিনি বলেন, এরপর কোনটি? তিনি বলেন, যদি তুমি তোমার প্রতিবেশীর স্ত্রীর সাথে যিনা করো। এরপর তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বক্তব্যবের সত্যতা প্রতিপাদনে কুরআনের এ আয়াত নাযিল হয়েছেঃ (অর্থ) ‘‘যারা আল্লাহর সাথে অন্য কোন ইলাহকে আহবান করে না, আর তারা হত্যার অধিকার ব্যতীত কোন জীবকে হত্যা করে না এবং যিনায় লিপ্ত হয় না’’ ... আয়াতের শেষ পর্যন্ত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2311,
			"arabicnumber": 2311,
			"text": "আহমাদ ইবন ইব্রাহীম .... জাবির ইবন আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, কোন একজন আনসার সাহাবীর মুসায়কা নামক দাসী নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে উপস্থিত হয়ে অভিযোগ পেশ করে যে, তার মনিব তাকে ব্যভিচারে লিপ্ত হওয়ার জন্য বাধ্য করেছে। তখন এ আয়াত নাযিল হয়ঃ (অর্থ) ‘‘তোমাদের দাসীদেরকে যিনায় লিপ্ত হওয়ার জন্য বাধ্য করোনা।’’",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2312,
			"arabicnumber": 2312,
			"text": "উবায়দুল্লাহ্ ইবন মু‘আয মু‘তামির থেকে এবং তিনি তার পিতা হতে (কুরআনের এ আয়াত) বর্ণনা করেছেন যে, ‘‘আর তাদের মধ্যে যারা অপছন্দনীয় কাজ করে, নিশ্চই আল্লাহ্ তার এ অপছন্দনীয় কাজের পরেও মার্জনাকারী, অনুগ্রহশীল।’’ রাবী বলেন, সাঈদ ইবন আবুল হাসান বলেন, যারা বাধ্য হয়ে অপকর্ম করে, সেই সমস্ত নারীদের জন্য আল্লাহ্ মার্জনাকারী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 138
			}
		}
	]
}