{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"16": "Sacrifice (Kitab Al-Dahaya)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2788,
			"arabicnumber": 2788,
			"text": "মুসাদ্দাদ ..... মাহনাফ ইবন সুলায়মান (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে আরাফায় অবস্থান করছিলাম। রাবী বলেন, তখন তিনি বলেনঃ হে লোক সকল! আমাদের প্রত্যেক গৃহবাসীর উপর প্রতি বছর কুরবানী করা ওয়াজিব এবং ‘আতীরাও’। তোমরা কি জান ‘আতীরা কি? এ হলো সেই জিনিস, যাকে লোকেরা রাজবিয়্যা বলে। [আবু দাউদ (রহঃ) বলেন আতিরাহ রহিত এবং এর হাদিসও রহিত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2789,
			"arabicnumber": 2789,
			"text": "হারূন ইবন ‘আবদুল্লাহ্ (রহঃ) ..... ‘আবদুল্লাহ্ ইবন ‘আমর ইবন ‘আস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার প্রতি আযহার (১০ই যিলহজ্জ) দিন ঈদ করার জন্য নির্দেশ দেওয়া হয়েছে, যাকে আল্লাহ তা'আলা এই উম্মতের জন্য (ঈদ হিসেবে) নির্ধারণ করেছেন। তখন এক ব্যক্তি জিজ্ঞাসা করেঃ [ইয়া রাসুলাল্লাহ]! আপনি বলুন, (যদি আমার কুরবানির পশু ক্রয়ের সামর্থ না থাকে), কিন্তু আমার কাছে এমন উষ্ট্রী বা বকরী থাকে যার দুধ পানকরার জন্য বা মাল বহন করার জন্য তা প্রতিপালন করি। আমি কি তাকে কুরবানি করতে পারি? তিনি বললেনঃ না। বরং তুমি তোমার মাথার চুল, নখ ও গোঁফ কেটে ফেল এবং নাভির নীচের চুল পরিষ্কার কর। এ-ই আল্লাহর নিকট তোমার কুরবানী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2790,
			"arabicnumber": 2790,
			"text": "‘উছমান ইবন আবী শায়বা (রহঃ) ..... হানাশ (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি ‘আলী (রাঃ)-কে দু‘টি দুম্বা যবাহ করতে দেখে জিজ্ঞাসা করি, ব্যাপার কি? তখন তিনি বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে এরূপ ওসীয়ত করে গেছেন যে, আমি যেন (তাঁর ইনতিকালের পর) তাঁর পক্ষে কুরবানি করি। তাই আমি তাঁর পক্ষ হতে এ কুরবানী করছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2791,
			"arabicnumber": 2791,
			"text": "‘উবায়দুল্লাহ্ ইবন মু‘আয (রহঃ) ..... উম্মু সালামা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যার কাছে কুরবানীর পশু থাকবে এবং সে তাকে কুরবানী করতে চায়, তার উচিত হবে যিলহাজ্জের চাঁদ দেখার পর হতে কুরবানী করার আগ পর্যন্ত তার চুল ও নখ না কাটা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2792,
			"arabicnumber": 2792,
			"text": "আহমদ ইবন সালিহ্ (রহঃ) .... ‘আয়শা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ দুম্বা কুরবানী করতে নির্দেশ দিয়েছেন, যার দুটি শিং হবে নিখুঁত, আর পেট, বক্ষদেশ এবং পা হবে কাল রংয়ের। অতঃপর এরূপ দুম্বা তাঁর নিকট আনা হলে, তিনি বলেনঃ হে ‘আয়শা! ছুরি নিয়ে এস। পরে তিনি বলেনঃ একে পাথরের উপর ঘষে ধারাল কর। অবশেষে তিনি ছুরি নেন এবং দুম্বাকে ধরে যমীনে শুইয়ে দেন এবং তাকে যবাহ করার সময় এ দু‘আ পাঠ করেনঃ بِسْمِ اللَّهِ اللَّهُمَّ تَقَبَّلْ مِنْ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَمِنْ أُمَّةِ مُحَمَّدٍ অর্থাৎ আমি আল্লাহর নামে শুরু করছি। ইয়া আল্লাহ্! আপনি একে মুহাম্মাদ, আলে মুহাম্মদ এবং উম্মতে মুহাম্মদ এর পক্ষে কবুল করূন। অতঃপর তিনি উক্ত দুম্বাকে কুরবানী করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2793,
			"arabicnumber": 2793,
			"text": "মূসা ইবন ইসমা‘ঈল (রহঃ) ..... আনাস (রাঃ) থেকে বর্ণিত। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাতটি উটকে দাঁড়িয়ে থাকা অবস্থায় নহর (কুরবানী) করেন এবং মদীনাতে এমন দু‘টি দুম্বা যবাহ করেন, যার শিং ছিল নিখুঁত এবং তার রং ছিল কালো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2794,
			"arabicnumber": 2794,
			"text": "মুসলিম ইবন ইবরাহীম (রহঃ) ..... আনাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুটি শিং বিশিষ্ট কাল ও সাদা মিশ্রিত দুম্বা যবাহ করেন। তিনি যবাহের সময় তাকবীর (আল্লাহু আকবর) বলেন এবং বিসমিল্লাহ পাঠ করেন এবং তিনি তাঁর বাম পাটি দুম্বার কাঁধের উপর রাখেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2795,
			"arabicnumber": 2795,
			"text": "ইবরাহীম ইবন মূসা রাযী (রহঃ) ..... জাবির ইবন আবদুল্লাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ কুরবানীর দিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু‘টি শিং বিশিষ্ট সাদা ও কালো মিশ্রিত দুম্বাকে কুরবানীর উদ্দেশ্যে কিবলামুখী করে শোয়ান এবং এই দু‘আ পাঠ করেনঃ إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ عَلَى مِلَّةِ إِبْرَاهِيمَ حَنِيفًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ إِنَّ صَلاَتِي وَنُسُكِي وَمَحْيَاىَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لاَ شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ اللَّهُمَّ مِنْكَ وَلَكَ عَنْ مُحَمَّدٍ وَأُمَّتِهِ بِاسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ অর্থাৎ ‘‘আমি আমার চেহারা তাঁর দিকে ফিরাচ্ছি, যিনি এককভাবে যমীন ও আসমান সৃষ্টি করেছেন এবং আমি মুশরিকদের অর্ন্তর্ভূক্ত নই। নিশ্চই আমার সালাত, আমার কুরবানী, আমার জীবন এবং আমার মৃত্যু আল্লাহ্ রাব্বুল আলামীনের জন্য, যাঁর কোন শরীক নেই এবং আমি এরূপ করার জন্য আদিষ্ট হয়েছি এবং আমি মুসলিমদের শামিল। হে আল্লাহ্! এটি তোমারই পক্ষে এবং তোমারই জন্যে মুহাম্মদ ও তাঁর উম্মতের তরফ হতে। বিসমিল্লাহ্ আল্লাহু আকবর।\" অতঃপর তিনি সে দুম্বাকে যবাহ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2796,
			"arabicnumber": 2796,
			"text": "ইয়াহ্ইয়া ইবন মু‘ঈন (রহঃ) ..... আবূ সা‘ঈদ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ শিং বিশিষ্ট মোটাতাজা দুম্বা কুরবানী করতেন, যার চোখ, মুখ ও পা কালো রং মিশ্রিত হতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2797,
			"arabicnumber": 2797,
			"text": "আহমদ ইবন আবী শু‘আয়ব হাররানী (রহঃ) ...... জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা ‘মুসিন্না’[১] ছাড়া (কম বয়সের পশু) কুরবানী করবে না। তবে যদি তা সংগ্রহ করা তোমাদের জন্য কষ্টকর হয়, তবে তোমরা ভেড়ার জাযা‘আহ[২]-ও যবেহ করতে পার।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2798,
			"arabicnumber": 2798,
			"text": "মুহাম্মদ ইবন সাদরান (রহঃ) .... যায়দ ইবন খালিদ জুহনী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সাহাবীদের মাঝে কুরবানীর পশু বণ্টণ করেন। তখন তিনি আমাকে বকরীর এক বছর বয়সের একটি জাযা‘আ প্রদান করেন। তখন আমি সেটি নিয়ে তাঁর নিকট হাযির হই এবং বলিঃ এতো একটা জাযা‘আ মাত্র। তখন তিনি বলেনঃ তুমি ওটিকে যবাহ কর। তখন আমি সেটিকে যবাহ করি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2799,
			"arabicnumber": 2799,
			"text": "হাসান ইবন ‘আলী (রহঃ) ...... আসিম ইবন কুলায়ব (রাঃ) তাঁর পিতা হতে বর্ণনা করেছেন। তিনি বলেনঃ একদা আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জনৈক সাহাবীর সঙ্গে ছিলাম, যার নাম ছিল মুজাশী’ এবং তিনি ছিলেন বনূ সুলায়ম গোত্রের অধিবাসী। হঠাৎ এক বছর বকরী প্রায় দুষ্প্রাপ্র হয়ে পড়লে তিনি একজন ঘোষককে এ মর্মে ঘোষণা দিতে বলেন যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ ঐ ব্যাক্তির জন্য ছ‘মাস বয়সের দুম্বা কুরবানী করা যথেষ্ট হবে, যার জন্য এক বছর বয়সের বকরী যবাহ করার দরকার ছিল (এক বছর বয়সের বকরী না পাওয়ার কারণে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2800,
			"arabicnumber": 2800,
			"text": "মুসাদ্দাদ (রহঃ) .... বারা’আ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুরবানীর দিন ঈদের সালাত আদায়ের পর আমাদের সামনে খুতবা দেন এবং বলেন, ‘‘যে ব্যক্তি আমাদের মত সালাত আদায় করেছে, সে তো ঠিকমতই কুরবানী করেছে। কিন্তু যে ব্যক্তি সালাতের আগে কুরবানী করেছে, (সে কুরবানীর সওয়াব পাবে না;) বরং তা হবে বকরীর গোশত মাত্র। তখন আবূ বুরদা ইবন নিয়ার (রাঃ) দাঁড়ান এবং বলেনঃ ইয়া রাসূলুল্লাহ্! আমি তো সালাত আদায়ের উদ্দেশ্যে বের হওয়ার আগেই কুরবানী করে ফেলেছি এবং আমার এরূপ ধারণা ছিল যে, আজ তো পানাহারের দিন মাত্র। সে কারণে আমি জলদি করেছি এবং তা নিজে খেয়েছি এবং আমার পরিবার-পরিজন ও আমার প্রতিবেশীদেরও খেতে দিয়েছি। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এতা বকরীর গোশত খাওয়া হয়েছে মাত্র। তখন আবূ বুরদা (রাঃ) বলেনঃ আমাদের নিকট এক বছর বয়সের এমন একটি বকরী আছে, যা দু‘টি বকরীর গোশতের চাইতেও উত্তম, তা কুরবানী করা কি আমার জন্য যথেষ্ট হবে? তিনি বললেনঃ হ্যাঁ। তবে তুমি ব্যতীত আর কারো জন্য এ ধরনের কুরবানী করা বৈধ হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2801,
			"arabicnumber": 2801,
			"text": "মুসাদ্দাদ (রহঃ) ..... বারা ‘ইবন ‘আযিব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আবূ বুরদা নামক আমার জনৈক মামা ঈদের সালাতের আগে কুরবানী করেন। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তঁকে বলেনঃ তোমার বকরী তো গোশত হয়েছে (কুরবানী হয়নি)। তখন তিনি বলেনঃ ইয়া রাসূলাল্লাহ্ ! আমার নিকট মোটা-তাজা ভেড়ার বাচ্চা আছে (আমি কি তা যবাহ করতে পারি)? তিনি বলেনঃ তুমি ঐটিকে যবাহ কর। তবে তুমি ছাড়া আর কারও জন্য এরূপ বৈধ নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2802,
			"arabicnumber": 2802,
			"text": "হাফস ইবন ‘উমার নামরী (রহঃ) ..... ‘উবায়দ ইবন ফাইরূয (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি বারা’আ ইবন ‘আযিব (রাঃ)-কে জিজ্ঞাসা করেছিলাম যে, কুরবানীর জন্য কোন ধরনের পশু অবৈধ (অর্থাৎ যবাহের অযোগ্য)? তখন তিনি বলেনঃ একদা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের মাঝে দাঁড়ান। আমার আংগুলগুলো তাঁর আংগুল হতে ছোট ছিল এবং আমার আংগুলগুলোর গিরাগুলোও তাঁর আংগুলের গিরার চাইতে ছোট ছিল। তিনি চারটি আংগুল দিয়ে ইশারা করে বললেন, চার ধরণের পশু কুরবানী করা বৈধ নয়, যথাঃ ১। স্পষ্ট কানা, ২। অসুস্থ বা রোগগ্রস্থ, যা স্পষ্ট বুঝা যায়, ৩। লেংড়া, যা বাহ্যত দেখা যায় এবং ৪। এত দুর্বল যে, হাঁড় বেরিয়ে গেছে। রাবী‘ বলেন, আমি বললাম, আমি তো ঐ ধরনের পশুকেও অযোগ্য বলে মনে করি, যাদের বয়স কম। তখন তিনি বলেনঃ যা তোমার পছন্দ হয় না, তা তুমি পরিত্যাগ কর। তবে তুমি অন্যকে এ ব্যাপারে নিষেধ করবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2803,
			"arabicnumber": 2803,
			"text": "ইবরাহীম ইবন মূসা রাযী (রহঃ) ..... ইয়াযীদ মিসরী (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি ‘উতবা ইবন আবদুস সুলামীর নিকট উপস্থিত হয়ে জিজ্ঞাসা করি, ‘‘হে আবূ ওয়ালীদ! আমি কুরবানীর পশুর সন্ধানে গিয়েছিলাম কিন্তু আমি পছন্দসই কোন পশু পাইনি একটি ছাড়া, যার কিছু দাঁত পড়ে গেছে। আমি সেটিকে ক্রয় করা ভাল মনে করিনি। এখন এ সম্পর্কে আপনি কি বলেন? তখন তিনি বলেনঃ তুমি সেটিকে আমার জন্য আন নাই কেন? আমি বললামঃ সুবহানাল্লাহ্! সেটি আপনার জন্য জায়িয এবং আমার জন্য নাজায়িয? তিনি বললেনঃ হ্যাঁ। তুমি তো সন্দেহ করছ, আর আমি তো সন্দেহ করছি না। বস্তুত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুসফারা, মুস্‌তাসিলা, বাখকা, মুশায়‘ইয়া ও কাসরা পশুকে কুরবানী দিতে নিষেধ করেছেন। ১. মুসফারা ঐ পশুকে বলা হয়, যার কান এমনভাবে কাটা যে, কানের ছিদ্র দেখা যায়। ২. মুসতাসিলা ঐ পশুকে বলা হয়, যার শিং গোড়া থেকে উপড়ানো। ৩. বাখকা ঐ পশুকে বলা হয়, যার একটা চোখের দৃষ্টিশক্তি সম্পূর্ণ নষ্ট হয়ে গেছে। ৪. মুশায়ইয়া ঐ পশুকে বলা হয়, যে অত্যান্ত দুর্বল ও কৃষ্ণকায়, এমনকি সেটি বকরীর সাথেও চলতে অক্ষম এবং ৫. কাসরা ঐ পশুকে বলা হয়, যার হাত বা পা ভেঙে গিয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2804,
			"arabicnumber": 2804,
			"text": "‘আবদুল্লাহ্ ইবন মুহাম্মদ নুফায়লী (রহঃ) ...... ‘আলী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের কুরবানীর পশুর চোখ, কান ভাল করে দেখতে বলেছেন। আর আমরা যেন কোন কানা পশু কুরবানী না করি, আর আমরা যেন এমন পশুও কুরবানী না করি যার কান সামনের বা পেছনের দিক হতে কাটা, অথবা যার কান লম্বালম্বিভাবে চিরে গেছে। রাবী যুহাইর বলেন, তখন আমি আবূ ইসহাক (রাঃ)-কে জিজ্ঞাসা করি যে, তিনি কি ‘আয্‌বা সম্পর্কে কিছু বলেছেন? তিনি বলেন, না। তখন আমি তাঁকে জিজ্ঞাসা করিঃ মুকাবিলা কি? তিনি বলেনঃ ঐ পশু, যার কানের পিছনের দিক কাটা। তখন আমি তাকে আবার জিজ্ঞাসা করিঃ মুদারিবা কি? তিনি বলেন, ঐ পশু যার কানের পিছনের দিক কাটা। তখন আমি তাকে আবার জিজ্ঞাসা করিঃ শুরাকা কি? তিনি বলেনঃ ঐ পশু, যার কান সম্পূর্ণরূপে কাটা। তখন আমি পুনরায় জিজ্ঞাসা করিঃ খারকা কি? তিনি বলেনঃ ঐ পশু, যার কানের কোন চিহ্ন-ই নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2805,
			"arabicnumber": 2805,
			"text": "মুসলিম ইবন ইবরাহীম (রহঃ) ...... ‘আলী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কান কাটা এবং শিং ভাঙা পশু কুরবানী করতে নিষেধ করছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2806,
			"arabicnumber": 2806,
			"text": "মুসাদ্দাদ (রহঃ) .... কাতাদা (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি সা‘ঈদ ইবন মুসাঈয়্যাব (রহঃ)-কে জিজ্ঞাসা করেছিলাম যে, আ‘যাব কি? তিনি বলেনঃ যে পশুর কান বা শিং ইত্যাদি অর্ধেকের বেশী কাটা বা ভাঙা এরূপ পশু।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2807,
			"arabicnumber": 2807,
			"text": "আহমদ ইবন হাম্বাল (রহঃ) ..... জাবির ইবন আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে হজ্জে তামাত্তু আদায় করতাম এবং একটি গাভী কুরবানীতে সাত ব্যক্তি শরীক হতাম এবং আমরা উট কুরবানী করতেও সাত ব্যক্তি শরীক হতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2808,
			"arabicnumber": 2808,
			"text": "কানবী (রহঃ) ...... জাবির ইবন আবদুল্লাহ (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ গাভী ও উট সাত ব্যক্তির পক্ষ হতে কুরবানী হয়ে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2809,
			"arabicnumber": 2809,
			"text": "মূসা ইবন ইসমা‘ঈল (রহঃ) ..... জাবির ইবন আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা হুদায়বিয়াতে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে সাত ব্যক্তির পক্ষ হতে উট এবং সাত ব্যক্তির তরফ হতে গাভী কুরবানী করেছিলাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2810,
			"arabicnumber": 2810,
			"text": "কুতায়বা ইবন সা‘ঈদ (রহঃ) ..... জাবির ইবন ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি ঈদুল আযহার দিন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ঈদগাহে উপস্থিত হই। তিনি খুতবা শেষ করার পর যখন মিম্বর হতে অবতরণ করেন, তখন তাঁর নিকট একটি বকরী আনা হয়। অতঃপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজ হাতে সেটি যবাহ করেন এবং এ সময় বলেনঃ বিসমিল্লাহ-হি আল্লাহু আকবার। এটি আমার তরফ হতে এবং আমার উম্মতের ঐ ব্যক্তিদের পক্ষ হতে, যারা কুরবানী করেনি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2811,
			"arabicnumber": 2811,
			"text": "উছমান ইবন আবী শায়বা (রহঃ) .... ইবন ‘উমার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কুরবানী পশুকে ‘ঈদগাহে কুরবানী করতেন এবং ইবন উমার (রাঃ)-ও এরূপ করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2812,
			"arabicnumber": 2812,
			"text": "কা‘নবী (রহঃ) ..... আয়িশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যামানায় জঙ্গলে বসবাসকারী কিছু লোক ঈদুল আযহার সময় মদীনায় আসে। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা কুরবানীর গোশত তিন দিনের পরিমাণ মত সঞ্চিত রাখ এবং বাকী গোশত সাদকা করে দাও। ‘আয়শা (রাঃ) বলেনঃ এ ঘটনার বেশ কিছু দিন পর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করা হয় যে, ইয়া রাসূলাল্লাহ্! ইতিপূর্বে লোকেরা তাদের গোশত দ্বারা অনেক দিন পর্যন্ত ফায়দা হাসিল করতো, তার চর্বি উঠিয়ে রাখত এবং তার চামড়া দিয়ে মশক তৈরী করত? তখন রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আসলে ব্যাপর কি বলতো, অথবা এ ধরনের কোন কিছু তিনি বলেন। তখন তাঁরা বলেনঃ ইয়া রাসূলাল্লাহ্! এখন তো অপনি তিনদিনের বেশী কুরবানীর গোশত জমা রাখতে নিষেধ করলেন। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি তো তোমাদের এজন্য নিষেধ করছিলাম যে, জঙ্গল হতে কিছু লোক এসেছে, (তাই তারা যেন সাহায্যপ্রাপ্ত হতে থাকে)। অতএব এখন তোমরা খাও, সাদকা কর এবং কিছু জমাও রাখ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2813,
			"arabicnumber": 2813,
			"text": "মুসাদ্দাদ .... নুবাইশা (রাঃ) থেকে বর্ণিত। একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন যে, আমি তোমাদের তিন দিনের অধিক কুরবানির গোশত খেতে এ জন্য নিষেধ করেছিলাম, যাতে তোমাদের সকলের কাছে তা পৌঁছে যায়। এখন আল্লাহ্‌ তোমাদের প্রাচুর্য দান করেছেন। কাজেই এখন তোমরা খাও, জমা রাখ, এবং সওয়াব হাসিলের জন্য দান করো। জেনে রাখ! এই দিনগুলো হল বিশেষ পানাহারের জন্য এবং মহান আল্লাহ্‌র স্মরণের জন্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2814,
			"arabicnumber": 2814,
			"text": "‘আবদুল্লাহ্ ইবন মুহাম্মদ নুফায়লী (রহঃ) ..... ছাওবান (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফরের সময় কুরবানী করেন এবং বলেন, হে ছাওবান! তুমি আমাদের জন্য এই বকরীর গোশত পরিষ্কার কর। রাবী [ছাওবান (রাঃ)] বলেনঃ আমি সেই গোশত তাঁকে মদীনায় ফিরে আসা পর্যন্ত খাওয়াতে থাকি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2815,
			"arabicnumber": 2815,
			"text": "মুসলিম ইবন ইবরাহীম (রহঃ) .... শাদ্দাদ ইবন আওস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ দু‘টি অভ্যাস, যে সম্পর্ক আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শ্রবণ করেছিঃ ১। আল্লাহ্ তা‘আলা প্রতিটি জিনিসের প্রতি ইহসান করাকে ফরয করেছেন। অতএব যখন তোমরা (কোন জীব-জন্তুকে) হত্যা করবে, তখন উত্তমরূপে হত্যা করবে। ২। যখন তোমরা (কোন জন্তুকে) যবাহ করবে, তখন উত্তমরূপে যবাহ করবে। তোমাদের উচিত হবে, যবাহের সময় ছুরিকে ধারাল করা এবং কুরবানীর পশুকে (সহজে যবাহ করে) তাকে আরাম দেওয়া।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2816,
			"arabicnumber": 2816,
			"text": "আবূ ওয়ালীদ তায়ালিসী (রহঃ) .... হিশাম ইবন যায়িদ (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি আনাস (রাঃ) এর সঙ্গে হাকাম ইবন আয়্যুব (রাঃ) এর নিকট গিয়েছিলাম। তখন আমরা সেখানে দেখতে পাই যে, কয়েকজন যুবক অথবা কিশোর একটা মুরগীকে লক্ষ্যস্থল বানিয়ে তার প্রতি তীর নিক্ষেপ করছে। তখন আনাস (রাঃ) বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জীব-জন্তুকে কষ্ট দিয়ে মারতে নিষেধ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2817,
			"arabicnumber": 2817,
			"text": "আহমদ ইবন মুহাম্মদ ইবন ছাবিত মারওয়ারী (রহঃ) ..... ইবন ‘আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ (আল্লাহর নির্দেশ) যে পশুর উপর আল্লাহর নাম উচ্চারণ হয়, তা খাও। পক্ষান্তরে যার উপর আল্লাহর নাম নেওয়া হয় না, তা খেও না। পরে এ হুকুম বাতিল হয়ে গেছে, অর্থাৎ এর থেকে আহলে কিতাবদের যবাহকৃত পশু আলাদা হয়ে গেছে, তাদের যবাহকৃত পশু হালাল। আল্লাহ্ বলেছেনঃ তাদের খাদ্য, যাদের কিতাব দেওয়া হয়েছে, তোমাদের জন্য হালাল এবং তোমাদের খাদ্যও তাদের জন্য হালাল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2818,
			"arabicnumber": 2818,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) ..... ইবন ‘আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আল্লাহর বাণীঃ (وَإِنَّ الشَّيَاطِينَ لَيُوحُونَ إِلَى أَوْلِيَائِهِمْ) অর্থাৎ নিশ্চয় শয়তান তার বন্ধুদের অন্তরে একথা নিক্ষেপ করে-’’ এই আয়াতের শানে-নুযূলে তিনি বলেনঃ লোকেরা এরূপে বলে যে, যা আল্লাহ্ কর্তৃক যবাহকৃত (অর্থাৎ যে জন্তু মারা গেছে), তাকে তোমরা ভক্ষণ করবে না। আর যা তোমরা নিজেরা যবাহ কর, তা তোমরা ভক্ষণ কর। অতঃপর আল্লাহ্ এ আয়াত নাযিল করেনঃ (وَلاَ تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ اللَّهِ عَلَيْهِ) অর্থাৎ ‘‘যে পশুর উপর কুরবানীর সময় আল্লাহর নাম উচ্চারণ করা হয় না, তোমরা তা ভক্ষণ কর না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2819,
			"arabicnumber": 2819,
			"text": "‘উছমান ইবন আবী শায়বা (রহঃ) .... ইবন ‘আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা ইয়াহূদীরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট হাযির হয়ে বলে, আমরা তো সে পশুকে ভক্ষণ করি, যাকে আমরা হত্যা করি। আর আমরা তাকে ভক্ষণ করি না, যাকে আল্লাহ হত্যা করেন। তখন আল্লাহ্ তা‘আলা এই আয়াত নাযিল করেনঃ وَلاَ تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ اللَّهِ عَلَيْهِ ‘‘ঐ পশুকে তোমরা ভক্ষণ করবে না, যার উপর আল্লাহর নাম উচ্চারিত হয়নি।’’ [\"ইয়াহূদীদের\" উল্লেখ মুনকার। মাহফুয হল \"মুশরিকরা]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2820,
			"arabicnumber": 2820,
			"text": "হারূন ইবন ‘আবদিল্লাহ্ (রহঃ) .... ইবন ‘আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঐ সমস্ত পশুর গোশত ভক্ষণ করতে নিষেধ করেছেন, যাকে আরবের লোকেরা নিজেদের মাঝে গৌরব ও অহংকার প্রকাশের নিমিত্ত হত্যা করে থাকে। আবূ দাঊদ (রহঃ) বলেনঃ গুনদর এই রিওয়ায়াতটি ইবন ‘আব্বাস (রাঃ) এর উপর ‘মাউকুফ হিসাবে বর্ণনা করেছেন। আবূ দাঊদ (রহঃ) আরো বলেনঃ আবূ রায়হানার আসল নাম হলো ‘আবদুল্লাহ্ ইবন মাত্তার।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2821,
			"arabicnumber": 2821,
			"text": "মুসাদ্দাদ (রহঃ) ... রাফি' ইবন খাদীজ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে বলি, ইয়া রাসূলাল্লাহ! আমরা আগামীকাল আমাদের শত্রুদের সাথে মুকাবিলা করব। কিন্তু আমাদের সংগে কোন ছুরি নেই। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ দেখ অথবা জলদি কর যাতে রক্ত প্রবাহিত হয় এবং যে পশু যবাহর সময় তার উপর আল্লাহ নাম উচ্চারিত হয়, সেটি ভক্ষণ কর, সে যবাহর হাতিয়ার যেন নখ ও দাঁত না হয়। আমি এর কারণ তোমাদের কাছে বর্ণনা করছি। কেননা, দাঁত সে তো একটি হাড় এবং নখ হলো হাবশীদের ছুরি। অতঃপর সেনাবহিনীর কিছু লোক ত্বরিত (আক্রমনের জন্য) অগ্রসর হয় এবং গনীমতের মাল লুটে নেয়। এ সময় রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকদের (বাহিনীর) শেষাংশে অবস্থান করছিলেন। লোকেরা রন্ধনের জন্য ডেগ চাপিয়ে দেয়। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঐ ডেগের পাশ দিয়ে যাচ্ছিলেন এবং তাঁর নির্দেশে ঐ ডেগগুলি উল্টিয়ে দেওয়া হয় এবং গণীমতের মাল তাদের মাঝে বণ্টন করে দেন। একটি উটকে দশটি বকরীর সমান হিসাবে মূল্যায়ন করা হয়। সে সময় কোন এক ব্যক্তির একটি উট পালিয়ে যায় কিন্তু তাদের কাছে কোন ঘোড়া না থাকায় (যাতে সওয়ার হয়ে উটকে ধরতে পারে) তাদের মধ্যকার জনৈক ব্যক্তি (পলায়নপর) উটটির প্রতি তার তীর নিক্ষেপ করে; যাতে আল্লাহ্ উটটিকে থামিয়ে দেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এই চতুষ্পদ জন্তুর মাঝে এমন পলায়নপর পশুও আছে, যেমন জংলী পশুদের মাঝেও আছে। কাজেই এই পশুদের মধ্য হতে যে এরূপ পলায়ন করবে, তোমরা সেটির সাথে এরূপ আচরণ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2822,
			"arabicnumber": 2822,
			"text": "মুসাদ্দাদ (রহঃ) ..... মুহাম্মদ ইবন সাফওয়ান অথবা সাফওয়ান ইবন মুহাম্মদ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি দুটি খরগোশ শিকার করি, অতঃপর আমি সে দু‘টিকে সাদা পাথর দ্বারা যবাহ করি। পরে আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এ সম্পর্কে জিজ্ঞাসা করি। তখন তিনি আমাকে তা ভক্ষণ করার অনুমতি দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2823,
			"arabicnumber": 2823,
			"text": "কুতায়বা ইবন সা‘ঈদ (রহঃ) ..... আতা ইবন ইয়াসার (রহঃ) হারিছ গোত্রের জনৈক ব্যক্তি হতে বর্ণনা করেছেন। সে ব্যক্তি উহুদ পর্বতের একটি গিরিতে উট চরাচ্ছিল। হঠাৎ উটটি মরার মত অবস্থায় এসে পড়ে, কিন্তু কারো কাছে এমন কিছু ছিল না, যা দিয়ে সে সেটিকে যবাহ করতে পারে। অবশেষে সে ব্যক্তি একটি লোহার পেরেক নিয়ে তার সূচালো মুখ দিয়ে উষ্ট্রীর বুকে আঘাত করে। ফলে সেখান হতে রক্ত প্রবাহিত হয়। পরে সে ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট হাযির হয়ে তাঁকে এ খবর দেয়। তখন তিনি তাকে তার গোশত ভক্ষনের অনুমতি দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2824,
			"arabicnumber": 2824,
			"text": "মূসা ইবন ইসমা‘ঈল (রহঃ) ..... আদী ইবন হাতিম (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি জিজ্ঞাসা করি, ইয়া রাসূলাল্লাহ্! আপনি বলুন, যদি আমাদের কেউ শিকার করে, কিন্তু তার কাছে (যবাহের জন্য) কোন ছুরি না থাকে। এমতাবস্থায় সে সাদা ধারালো পাথর অথবা খন্ডিত কাষ্ঠখন্ড দিয়ে কি সেটিকে যবাহ করতে পারে? তখন তিনি বলেনঃ আল্লাহর নাম নিয়ে যা দিয়ে পার রক্ত প্রবাহিত কর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2825,
			"arabicnumber": 2825,
			"text": "আহমদ ইবন ইউনুস (রহঃ) .... আবূল উশরা (রহঃ) তাঁর পিতা থেকে বর্ণনা করেছেন। একদা তিনি বলেনঃ ইয়া রাসূলাল্লাহ্! যবাহ কি কেবল গলা এবং সিনায় করতে হবে? রাবী বলেন, তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যদি তুমি তার রানে বল্লমের আঘাত কর, তবে তা ভক্ষণ করা তোমার জন্য বৈধ হবে। আবূ দাঊদ (রহঃ) বলেনঃ এরূপ করা কেবলমাত্র পলায়নপর পশুর জন্য বৈধ, (যাদের নিয়ন্ত্রণে আনা যায় না); অন্যদের বেলায় নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2826,
			"arabicnumber": 2826,
			"text": "হান্নাদ ইবন সারী ও হাসান ইবন ‘ঈসা (রহঃ) ..... ইবন ‘আব্বাস ও আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তাঁরা বলেনঃ রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তাঁরা বলেনঃ রাসূলুল্লাহ্সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘শারীতাতে শয়তান’ হতে নিষেধ করেছেন। রাবী ইবন ঈসা (রহঃ) তাঁর বর্ণিত হাদীছে এরূপ অতিরিক্ত বর্ণনা করেছেন যে, ‘শারীতাতে শয়তানের’ অর্থ হলোঃ কোন পশুকে যবাহের সময় কেবল তার উপরের চামড়া কেটে ছেড়ে দেওয়া এবং রগ কর্তন না করা। ফলে সে (অধিক কষ্ট পেয়ে) এ অবস্থায় মারা যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2827,
			"arabicnumber": 2827,
			"text": "কা‘নবী (রহঃ) ...... আবূ সাঈদ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে কুরবানীর পশুর গর্ভস্থিত বাচ্চা সম্পর্কে জিজ্ঞাসা করি। তিনি বলেনঃ যদি তোমরা চাও, তবে তা খেতে পার। মুসাদ্দাদ (রহঃ) বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট জিজ্ঞাসা করি, ইয়া রাসূলাল্লাহ্! আমরা উট যবাহ করি, গাভী যবাহ করি এবং বকরী যবাহের পর অনেক সময় তাদের গর্ভে মৃত বাচ্চা দেখতে পাই, আমরা কি তা ফেলে দেব, না ভক্ষণ করব? তিনি বলেনঃ যদি তোমরা চাও, তবে তা খেতে পার। কেননা ঐ বাচ্চার মাতার যবাহ, ঐ বাচ্চার যবাহর মত, (অর্থাৎ মাতার যবাহে বাচ্চাও যবাহ হয়ে যায়)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2828,
			"arabicnumber": 2828,
			"text": "মুহাম্মদ ইবন ইয়াহইয়া ইবন ফারিস (রহঃ) ..... জাবির ইবন আবদিল্লাহ্ (রাঃ) সূত্রে রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেনঃ পেটের বাচ্চার যবাহ, সেটির মাতার যবাহ দ্বারাই হয়ে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2829,
			"arabicnumber": 2829,
			"text": "মূসা ইবন ইসমাঈল (রহঃ) ...... আয়িশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, একদা তাঁরা (সাহাবীরা) জিজ্ঞাসা করেন, ইয়া রাসূলাল্লাহ! আমাদের কওমের লোকেরা জাহিলিয়াতের যুগের খুবই নিকটবর্তী (অর্থাৎ তারা কেবলই ইসলাম কবুল করেছে)। তারা আমাদের কাছে গোশত নিয়ে আসে, অথচ আমরা জানি না,, তারা যবাহের সময় ঐ পশুর উপর ‘বিসমিল্লাহ্’ পাঠ করেছে কিনা? আমরা কি এ গোশত থেকে ভক্ষণ করব? তখন রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা ‘বিসমিল্লাহ্’ বলে তা ভক্ষণ কর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2830,
			"arabicnumber": 2830,
			"text": "মুসাদ্দাদ (রহঃ) .... নুবায়শা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা জনৈক ব্যক্তি উচ্চকন্ঠে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞসা করে, আমরা জাহিলিয়াতের যুগে রজব মাসে ‘আতীরা’ করতাম। এখন এ সম্পর্কে আমাদের কি নির্দেশ দেন? তখন তিনি বলেনঃ তোমরা আল্লাহর জন্য যে কোন মাসে কুরবানী করতে পার। তোমরা আল্লাহর নির্দেশের অনুসরণ কর এবং অন্যকে খানা খাওয়াও। অতঃপর সে ব্যক্তি আবার জিজ্ঞাসা করেঃ আমরা তো জাহিলিয়াতের যুগে ফারাআ' করতাম (অর্থাৎ পশুর প্রথম বাচ্চা মূর্তির নামে যবাহ্ করতাম)। এখন এ সম্পর্কে আপনার অভিমত কি? তিনি বলেনঃ বিচরণকারী প্রত্যেক পশুর মাঝেই ফারাআ আছে। তোমরা তোমাদের পশুদের খাদ্য দিয়ে থাক, এমন কি তারা হাজীদের বহনে সক্ষম হবে, তখন তুমি তাকে যবাহ্ করবে এবং তার গোশত সাদকা করে দেবে। রাবী খালিদ (রহঃ) বলেনঃ আমি মনে করি, মুসাফিরদের জন্য এটি উত্তম। রাবী খালিদ (রহঃ) পুনরায় বলেনঃ আমি আবূ কিলাবকে জিজ্ঞাসা করেছিলামঃ কয়টি পশুর জন্য এ হুকুম? তিনি বলেনঃ একশতটির জন্য (অর্থাৎ একশতটি পশুর মধ্যে একটা আল্লাহর নামে যবাহ্ করে দান করবে।)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2831,
			"arabicnumber": 2831,
			"text": "আহমদ ইবন ‘আবদা (রহঃ) ...... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইসলামে ফারাআ' ও ‘আতীরা’ কিছুই নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2832,
			"arabicnumber": 2832,
			"text": "হাসান ইবন ‘আলী (রহঃ) ..... সা‘ঈদ (রাঃ) থেকে বর্ণিত। ফারাআ' হলো পশুর ঐ প্রথম বাচ্চা, যা তাদের নিকট ভূমিষ্ট হতো এবং তারা তাকে (দেবতার) উদ্দেশ্যে কুরবানী করতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2833,
			"arabicnumber": 2833,
			"text": "মূসা ইব ইসমাঈল (রহঃ) ..... ‘আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের প্রতি পঞ্চাশটি বকরী হতে একটি বকরী (মুসাফির ও গরীবের জন্য) যবাহ্ করার নির্দেশ দিয়েছেন। আবূ দাউদ (রহঃ) বলেনঃ কেউ কেউ ফারাআ' সম্পর্কে বলেছেন যে, সেটি হলো উটের ঐ বাচ্চা, যা সর্বপ্রথম জন্ম নিত এবং লোকেরা সেটিকে তাদের দেবতার সন্তুষ্টির জন্য কুরবানী করতো। কিন্তু সেটির গোশত তারাই ভক্ষণ করতো এবং এর চামড়া গাছের উপর নিক্ষেপ করতো। আর ‘আতীরা হলো, রজব মাসের প্রথম দশ দিনের মধ্যে সেটিকে কুরবানী করতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2834,
			"arabicnumber": 2834,
			"text": "মুসাদ্দাদ (রহঃ) .... উম্মু কুরয্ কা‘বিয়া (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এরূপ বলতে শুনেছি, ছেলের জন্য দু‘টি একই ধরণের বকরী এবং মেয়ের জন্য একটি বকরী দিয়ে ‘আকীকা দেওয়া যথেষ্ট হবে। আবূ দাঊদ (রহঃ) বলেনঃ আমি ইমাম আহমদ (রহঃ)-কে বলতে শুনেছি যে, ‘মুকাফিআতানে ’অর্থ হলোঃ দু‘টি এক ধরনের হবে অথবা সে দুটি একই বয়সের হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2835,
			"arabicnumber": 2835,
			"text": "মুসাদ্দাদ (রহঃ) .... উম্মু কুরয (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছি, তোমরা পাখীদের তাদের বাসায় থাকতে দেবে (তাড়িয়ে দেবে না)। রাবী উম্মু কুর্‌য (রাঃ) আরো বলেনঃ আমি তাঁকে এরূপ বলতে শুনেছি, ছেলের (আকীকার জন্য) দু‘টি বকরী এবং মেয়ের জন্য একটি বকরী যবাহ্ করতে হবে। আর এতে তোমাদের কোন ক্ষতি নেই, চাই বকরী নর হোক কিংবা মাদী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2836,
			"arabicnumber": 2836,
			"text": "মুসাদ্দাদ ..... উম্মু কুরয (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ছেলের আকিকার জন্য সমান-সমান দুটি বকরী এবং মেয়ের আকিকার জন্য একটা বকরী কুরবানি করাই যথেষ্ট। আবু দাউদ (রহঃ) বলেনঃ এ হাদিসটি সহিহ এবং সুফিয়ানের হাদিস সন্দেহযুক্ত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2837,
			"arabicnumber": 2837,
			"text": "হাফস ইবন ‘উমার নামরী (রহঃ) ..... সামুরা (রাঃ) সূত্রে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেন, প্রত্যেক শিশু ‘আকীকার বিনিময়ে বন্ধকস্বরূপ থাকে। কাজেই তার পক্ষ হতে (জন্মের) সপ্তম দিনে কুরবানী করতে হবে এবং মাথা মুন্ডন করতে হবে, আর কুরবানীর রক্ত তার মাথায় লাগাতে হবে। অতঃপর কাতাদা (রাঃ)-কে রক্ত লাগান সম্পর্কে যখন জিজ্ঞাসা করা হয়, রক্ত কিরূপে লাগাতে হবে? তিনি বলেনঃ যখন আকীকার পশু কুরবানী করা হবে, তখন তার কিছু লোম নিয়ে কাটা-শিরার সামনে রাখতে হবে এবং সেগুলো রক্তে প্রবাহিত হয়। পরে তার মাথা ধুয়ে ফেলে মাথা মুন্ডন করতে হবে। [আবু দাউদ রহঃ বলেন \"রক্তমাখার\" শব্দটি হাম্মামের ধারনামুলক, অন্যরা তা বর্জন করেছেন। আবু দাউদ (রহঃ) বলেনঃ এখন এ হাদিস আমলযোগ্য নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2838,
			"arabicnumber": 2838,
			"text": "ইবন মুছান্না (রহঃ) ...... সামুরা ইবন জুনদুব (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রত্যেক শিশু তার ‘আকীকার বিনিময়ে (আল্লাহর নিকট) বন্ধকস্বরূপ থাকে। কাজেই সপ্তম দিনে তার পক্ষ হতে কুরবানী করবে এবং তার মাথা মুন্ডন করে নাম রাখবে। আবূ দাঊদ (রহঃ) বলেনঃ يُسَمَّى শব্দটি অধিক সঠিক। এভাবেই সালাম ইবন আবূ মূতী' কাতাদা (রহঃ) এর মাধ্যমে এবং আয়াস ইবন যাগফাল ও আশআছ (রহঃ) হাসান থেকে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2839,
			"arabicnumber": 2839,
			"text": "হাসান ইবন ‘আলী (রহঃ) .... সালমান ইবন ‘আমির যাব্বী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পুত্র সন্তান জন্ম নিলে তার ‘আকীকা করা সুন্নত। কাজেই তার পক্ষ হতে রক্ত প্রবাহিত করবে (অর্থাৎ ‘আকীকার জন্তু কুরবানী করবে) এবং তার থেকে দুঃখ-কষ্ট বিদূরিত করবে (অর্থাৎ তার মাথা মুন্ডন করে দেবে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2840,
			"arabicnumber": 2840,
			"text": "আবূ দাঊদ (রহঃ) .... হাসান (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ দুঃখ-কষ্ট বিদূরিত করার অর্থ হলো, তার মাথা মুন্ডন করে দেওয়া।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2841,
			"arabicnumber": 2841,
			"text": "আবূ মা‘মার ‘আবদুল্লাহ্ ইবন ‘আমর (রহঃ) ..... ইবন ‘আব্বাস (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাসান (রাঃ) ও হুসায়ন (রাঃ) এর পক্ষ হতে একটি করে দুম্বা তাদের ‘আকীকায় কুরবানী করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2842,
			"arabicnumber": 2842,
			"text": "কা‘নবাী (রহঃ) ..... আমর ইবন শু‘আয়ব (রহঃ) তাঁর পিতা হতে এবং তিনি তার দাদা থেকে বর্ণনা করেছেন। তিনি বলেনঃ একদা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে ‘আকীকা সম্পর্কে জিজ্ঞাসা করা হয়। তিনি বলেনঃ আল্লাহ্ ‘উকূক (মাতাপিতার নাফরমানী করা)-কে পছন্দ করেন না। কেননা তিনি ‘উকুক শব্দটিকে পছন্দ করেননি। রাবী বলেন, যার কোন শিশু সন্তান জন্ম নেয়, আর সে তার পক্ষ হতে কুরবানী করতে চায়, তবে তার উচিত হবে পুত্র সন্তানের জন্য দু'টি একই ধরনের বকরী এবং কন্যা সন্তানের পক্ষে একটি বকরী কুরবানী করা। অতঃপর তাঁকে ফারা‘আ সম্পর্কে জিজ্ঞাসা করা হয়। তিনি বলেনঃ ফারা‘আ তো জায়িয এবং বৈধ (যদি তা আল্লাহর নামের উপর করা হয়)। কিন্তু ঐ শিশু সন্তানকে এতদিন ছেড়ে রাখা, যাতে ঐ উটটি এক বা দু‘বছরের হয়ে যায়। অতঃপর তোমরা সেটিকে নিঃস্ব, সম্বলহীন ব্যক্তিদের দিয়ে দেবে অথবা মুজাহিদদের বাহনের উদ্দেশ্যে আল্লাহর ওয়াস্তে দিয়ে দেবে। এটা তা থেকে উত্তম যে, তোমরা সেটিকে এমন অবস্থায় কুরবানী করবে যে, এর পশমগুলি তার চামড়ার সাথে লেপ্টে থাকবে। এভাবে তোমাদের পাত্রগুলি উপুড় করে দেবে এবং নিজেদের উষ্ট্রীদের পাগল বানিয়ে দেবে; (কেননা, ছোট্ট বাচ্চা যবাহের ফলে মায়ের কষ্ট হয় এবং সে পাগলপারা হয়ে ওঠে।)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2843,
			"arabicnumber": 2843,
			"text": "আহমদ ইবন মুহাম্মদ ইবন ছাবিত (রহঃ) .... ‘আবদুল্লাহ্ ইবন বুরায়দা (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি আবূ বুরায়দা (রাঃ)-কে বলতে শুনেছি যে, জাহিলিয়াতের যুগে যখন আমাদের কারও পুত্র সন্তান জন্ম নিত, তখন বকরী যবাহ করা হতো এবং ঐ পশুর রক্ত সে সন্তানের মাথায় লাগানো হত। অতঃপর আল্লাহ্ যখন দীন-ইসলাম প্রেরণ করেন, তখন আমরা বকরী যবাহ্ করতাম, সন্তানেরা মাথা মুন্ডন করতাম এবং তাতে জাফরান লাগিয়ে দিতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 56
			}
		}
	]
}