{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"19": "Shares of Inheritance (Kitab Al-Fara'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2885,
			"arabicnumber": 2885,
			"text": "আহমদ ইবন ‘আমর ইবন সারহ (রহঃ) .... আবদুল্লাহ্ ইবন ‘আমর ইবন ‘আস (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রকৃত জ্ঞান তিন প্রকার, এগুলো ব্যতীত আর সবই বাহুল্য। যথা- (১) আল-কুরআনের মুহকাম আয়াত (যার হুকুম মানসূখ বা বতিল হয়নি), (২) সহীহ ও সঠিক হাদীছ এবং (৩) ইনসাফের সাথে পরিত্যক্ত সম্পত্তি বণ্টনের জ্ঞান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2886,
			"arabicnumber": 2886,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ..... জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি অসুস্থ ছিলাম, তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং আবূ বকর (রাঃ) উভয়ে পদব্রজে আমাকে দেখার জন্য আগমন করেন। এ সময় আমি বেঁহুশ হয়ে যাওয়ায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে কোন কথা বলতে পারিনি। তখন তিনি উযূ করেন এবং উযূর পানি আমার উপর ছিটিয়ে দেন, ফলে আমি চেতনা ফিরে পাই। তখন আমি জ্ঞিাসা করিঃ ইয়া রাসূলাল্লাহ্! আমি আমার ধন-সম্পদ কি করব? আমার তো কেবল বোনেরা আছে। তখন মীরাছ সম্পর্কিত এ আয়াত নাযিল হয়ঃ লোকেরা আপনার কাছে (‘কালালা’ সম্পর্কে) জিজ্ঞাসা করে। আপনি বলুনঃ আল্লাহ্ তোমাদের কালালা সম্পর্কে জানিয়ে দিচ্ছেন ... [নিসাঃ ১৭৬]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2887,
			"arabicnumber": 2887,
			"text": "উছমান ইবন আবী শায়বা (রহঃ) .... জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি রোগাক্রান্ত হয়ে পড়ি এবং এ সময় আমার সাতটি বোন ছিল। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট আগমন করেন এবং আমার চেহারার উপর ফুঁ দেন, ফলে আমি চেতনা ফিরে পাই। তখন আমি জিজ্ঞাসা করিঃ ইয়া রাসূলাল্লাহ্! আমি কি আমার বোনদের জন্য (আমার সম্পদের) এক-তৃতীয়াংশ ওসীয়াত করব? তিনি বলেনঃ উত্তম কাজ কর। তখন আমি আবার জিজ্ঞাসা করিঃ তবে কি অর্ধেক সম্পদের জন্য ওসীয়াত করব? তিনি বলেনঃ উত্তম কাজ। অতঃপর তিনি আমাকে রেখে বেরিয়ে যাওয়ার সময় বলেনঃ হে জাবির! এ পীড়ায় তুমি মারা যাবে বলে আমার মনে হচ্ছে না। আর নিশ্চই আল্লাহ্ তা‘আলা তাঁর কালাম নাযিল করেছেন, যাতে (তোমার বোনদের) জন্য অংশ হিসেবে দুই তৃতীয়াংশ নির্ধারণ করেছেন। রাবী বলেনঃ জাবির (রাঃ) বলতেন যে, এই আয়াতটি আমার ব্যাপারে নাযিল হয়ঃ লোকেরা আপনার কাছে (কালালা সম্পর্কে) জিজ্ঞাসা করে। আপনি বলুন, আল্লাহ্ তোদের কলালা সম্পর্কে জানিয়ে দিচ্ছেন ...। [নিসাঃ ১৭৬]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2888,
			"arabicnumber": 2888,
			"text": "মুসলিম ইবন ইবরাহিম (রহঃ) .... বারাআ‘ ইবন ‘আযিব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ (সুরা নিসার) শেষ আয়াতটি কালালা সম্পর্কে নাযিল হয়ঃ লোকেরা আপনার কাছে (কালালা সম্পর্কে) জিজ্ঞাসা করে। আপনি বলুনঃ আল্লাহ্ তোমাদের কালালা সমপর্কে জানিয়ে দিচ্ছেন ... (নিসাঃ ১৭৬)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2889,
			"arabicnumber": 2889,
			"text": "মানসুর ইবন আবী মূযাহিম (রহঃ) ..... বারাআ’ ইবন ‘আযিব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা জনৈক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট হাযির হয়ে জিজ্ঞাসা করে, ইয়া রাসূলাল্লাহ্! আল-কুরআনের (يَسْتَفْتُونَكَ فِي الْكَلاَلَةِ) এ আয়াতে যে ‘কালালা’ শব্দের উল্লেখ আছে, বলুনঃ কালালা শব্দের অর্থ কি? তিনি বলেনঃ তোমার জন্য সেই আয়াতটি যথেষ্ঠ, যা গরমের সময় নাযিল হয়। (রাবী আবূ বকর বলেনঃ) আমি এ সম্পর্কে আবূ ইসহাকের নিকট জিজ্ঞাসা করি। (তিনি বলেন) কালালা হলো, যার মৃত্যুর পর সে কোন সন্তান এবং পিতামাতাকে রেখে যায় না। তখন তিনি বলেনঃ লোকদের ধারণাও এরূপ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2890,
			"arabicnumber": 2890,
			"text": "‘আবদুল্লহ্ ইবন ‘আমির ইবন যুরারা (রহঃ) ..... হুযাইল ইবন শুরাহবীল আওদী (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা জনৈক ব্যক্তি আবূ মূসা আশ‘আরী এবং সালমান ইবন রাবীআ (রাঃ) এর নিকট হাযির হয়ে উভয়কে জিজ্ঞাসা করেন যে, মেয়ে, ছেলের মেয়ে (নাতনী) এবং আপন বোনের অংশ কি? তখন তাঁরা বলেনঃ মেয়ে অর্ধেক পাবে এবং আপন বোন পাবে বাকী অর্ধেক এবং নাতনীকে তাঁরা উত্তরাধিকারী করেননি। (উপরন্তু তারা বলেন) তুমি এ সম্পর্কে ইবন মাসঊদ (রাঃ)-কে জিজ্ঞাসা কর, হয়তো তিনি এ ব্যাপারে আমাদেরই অনুসরন করবেন। তখন সে ব্যক্তি তাঁর নিকট গমণ করে এবং তাঁকে এ সম্পর্কে জিজ্ঞাসা করে, আর তাঁকে সে দু‘জনের কাথাও বলে। তখন তিনি [ইবন মাসঊদ (রাঃ)] বলেনঃ (আমি যদি তাদের অভিমতকে সমর্থন করি), তবে অবশ্যই আমি গুমরাহদের শামিল হয়ে যাব এবং আমি হেদায়াতপ্রাপ্তদের শামিল থাকব না। বস্তুত আমি এ ব্যাপারে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ফয়সালা অনুযায়ী ফতওয়া দেব। (তা হলো) মেয়ে পাবে অর্ধেক এবং নাতনী পাবে এক-ষষ্ঠমাংশ যাতে উভয়ে মিলে দুই-তৃতীয়াংশ পূর্ণ হয় এবং বাকী এক তৃতীয়াংশ পাবে আপন বোন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2891,
			"arabicnumber": 2891,
			"text": "মুসাদ্দাদ (রহঃ) .... জাবির ইবন ‘আবদিল্লাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে বের হয়ে আসওয়াফ নামক স্থানে একজন আনসার মহিলার নিকট উপস্থিত হই। তখন সে মহিলা তার দু‘টি কন্যা সন্তান নিয়ে এসে বললঃ ইয়া রাসূলাল্লাহ্! এ কন্যা দুটি সাবিত ইবন কায়স (রাঃ) এর, যিনি আপনার সাথী থাকাকালে উহুদের যুদ্ধে শহীদ হন। এখন এদের চাচা এদের সমস্ত মাল ও মীরাছ দখল করে নিয়েছে। এদের দু‘জন কিছুই দেয়নি; বরং সবই সে গ্রাস করেছে। ইয়া রাসূলাল্লাহ্! এখন এ ব্যাপারে আপনি কি বলেন? আল্লাহর শপথ! যতক্ষণ এরা সম্পদের অধিকারী না হবে, ততক্ষণ এদর বিবাহ হবে না। তখন রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ্ তা‘আলা এব্যাপারে ফয়সালা করে দেবেন। অতঃপর এ আয়াত নাযিল হয়ঃ (يُوصِيكُمُ اللَّهُ فِي أَوْلاَدِكُمْ) অর্থাৎ আল্লাহ্ তা‘আলা তোমাদের সন্তানদের ব্যাপারে ওসীয়াত করেছেন ...। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমার নিকট ঐ মহিলা এবং তার দেবরকে ডেকে আন। অতঃপর তিনি মেয়ে দুটির চাচাকে ডেকে বলেনঃ তুমি এদের দুই-তৃতীয়াংশ দিয়ে দাও এবং এদের মাকে এক-অষ্টমাংশ দিয়ে দাও; আর যা অবশিষ্ট থাকে তা তোমার। আবূ দাঊদ (রহঃ) বলেনঃ এ ব্যাপারে বিশর ভুল করেন। ঐ মেয়ে দু‘টি ছিল সা‘দ ইবন রাবী' এর। আর ছাবিত ইবন কায়স (রাঃ) ইয়ামামার যুদ্ধে শহীদ হয়েছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2892,
			"arabicnumber": 2892,
			"text": "ইবন সারহ (রহঃ) ..... জাবির ইবন ‘আবদিল্লাহ্ (রাঃ) থেকে বর্ণিত। সা‘দ ইবন রাবী' এর স্ত্রী বলেন, ইয়া রাসূলাল্লাহ! সা‘দ মারা গিয়েছে এবং এ দু‘টি মেয়ে রেখে গিয়েছে। অতঃপর পূর্বোক্ত হাদীছের অনুরূপ বর্ণিত হয়েছে। আবূ দাঊদ (রহঃ) বলেনঃ এ হাদীছটি সহীহ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "মূসা ইবন ইসমাঈল (রহঃ) .... আসওয়াদ ইবন ইয়াযীদ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ মু‘আয ইবন জাবাল (রাঃ) তাঁর উত্তরাধিকার এক বোন ও এক মেয়েকে তাঁর সম্পত্তির অর্ধাংশ করে ভাগ করে দেন এবং এ সময় তিনি ইয়ামনে ছিলেন। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও সে সময় জীবিত ছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2894,
			"arabicnumber": 2894,
			"text": "আল- কা‘নবী (রহঃ) ..... কাবীসা ইবন যুওয়ায়ব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ জনৈক মৃত ব্যক্তির দাদী আবূ বকর সিদ্দীক (রাঃ) এর নিকট উপস্থিত হয়ে তার মীরাছ (প্রাপ্য অংশ) দাবি করে। তখন তিনি বলেনঃ আল্লাহর কিতাবে তোমার কোন অংশের কথা উল্লেখ করেননি এবং আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সুন্নাত হতে তোমার ব্যাপারে কোন কিছু অবহিত নই। অতএব এখন তুমি ফিরে যাও, এ সম্পর্কে আমি লোকদের কাছে জিজ্ঞাসা করব। তখন মুগীরা ইবন শু‘বা (রাঃ) বলেনঃ আমি তখন রাসূলূল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত ছিলাম, যখন তিনি দাদীকে এক-ষষ্ঠমাংশ প্রদান করেন। তখন আবূ বকর (রাঃ) জিজ্ঞাসা করেনঃ এ সময় তোমার সঙ্গে আর কেউ ছিল কি? তখন মুহাম্মদ ইবন মাসলামা (রাঃ) দন্ডায়মান হন এবং ঐরূপ বলেন, যেরূপ মুগীরা ইবন শু‘বা (রাঃ) বলেন। তখন আবু বকর (রাঃ) তার জন্য এক-ষষ্ঠমাংশ প্রদান করেন। অতঃপর অন্য এক মৃত ব্যক্তির দাদী (বা নানী) ‘উমার ইবন খাত্তাব (রাঃ) এর নিকট (তাঁর খিলাফতকালে) উপস্থিত হয়ে মীরাছ দাবি করে। তখন তিনি বলেনঃ আল্লাহর কিতাবে তো তোমার কোন অংশের কথা উল্লেখ নেই, তবে ইতপূর্বে তুমি ব্যতীত অন্যদের ব্যাপারে যে সিদ্ধান্ত হয়েছে (অর্থাৎ এক-ষষ্ঠমাংশ), আর যেহেতু ফারাইযের ব্যাপারে আমার পক্ষে বাড়াবাড়ি করাও সম্ভব নয়, কাজেই ঐ এক-ষষ্ঠমাংশ তুমি নিয়ে যাও। আর যদি নানী ও দাদী উভয়ই একত্রে জীবিত থাকে, তবে ঐ এক-ষষ্ঠমাংশ তোমাদের দুজনের জন্য। আর তোমাদের একজন যদি হও, তবে সে ঐ অংশ পাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2895,
			"arabicnumber": 2895,
			"text": "মুহাম্মদ ইবন আবদিল আযীয (রহঃ) .... ইবন বুরায়দা (রহঃ) তাঁর পিতা হতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সূত্রে বর্ণনা করেছেন যে, তিনি দাদী (বা নানীর) জন্য এক-ষষ্ঠমাংশ নির্ধারণ করেছেন, তবে এ শর্তে যে, যদি মৃত ব্যক্তির মা প্রতিবন্ধকতা সৃষ্টি না করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2896,
			"arabicnumber": 2896,
			"text": "মুহাম্মদ ইবন কাছীর(রহঃ) .... ‘ইমরান ইবন হুসাইন (রাঃ) থেকে বর্ণিত যে, একদা জনৈক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট হাযির হয়ে বলেঃ আমার ছেলের ছেলে (পৌত্র) ইনতিকাল করেছে, এখন আমি তার মীরাছ থেকে কিরূপ অংশ পাব? তিনি বলেনঃ তোমার অংশ হবে এক-ষষ্ঠমাংশ। অতঃপর সে লোক যখন ফিরে যাচ্ছিল, তখন তিনি ডাকেন এবং বলেনঃ তুমি এক-ষষ্ঠমাংশ পাবে। আবূ কাতাদা (রাঃ) বলেনঃ তারা (সাহাবীরা) জানত না যে দাদা কোন সময় এক-ষষ্ঠমাংশ পায়। আবূ কাতাদা (রাঃ) আরো বলেনঃ দাদার প্রাপ্ত সর্বনিম্ন মীরাছের অংশ হলো এক-ষষ্ঠমাংশ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2897,
			"arabicnumber": 2897,
			"text": "ওয়াহব ইবন বাকীয়্যা (রহঃ) ..... হাসান (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ উমর (রাঃ) জিজ্ঞাসা করলেন, তোমাদের মাঝের কে জানে যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাদাকে মীরাছ হিসাবে কি দিয়েছেন? তখন মা‘কিল ইবন ইয়াসার (রাঃ) বলেনঃ আমি এ সম্পর্কে জানি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাদাকে মীরাছ হিসাবে এক-ষষ্ঠমাংশ প্রদান করেছেন। তখন তিনি [উমার (রাঃ)] জিজ্ঞাসা করেনঃ কোন কোন ওয়ারিছের সাথে এক-ষষ্ঠমাংশ পাবে? তখন মাকিল (রাঃ) বলেনঃ এতো আমার জানা নেই। তখন ‘উমার (রাঃ) বলেনঃ যদি তুমি না-ই জান, তবে এতে কি লাভ",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "আহমেদ ইবন সালেহ (রহঃ) .... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আহলে ফারায়েজের মাঝে, আহলে কিতাবের বিধান অনুযায়ী ধন-সম্পদ বন্টন কর। আর এদের মাঝে বন্টনের পর যে মাল অবশিষ্ট থাকবে, তার সবই নিকটাত্মীয় পুরুষ প্রাপ্ত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2899,
			"arabicnumber": 2899,
			"text": "হাফস ইবন ‘উমার (রহঃ) ..... মিকদাম (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলইউল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি দেনা বা নাবালক সন্তান-সন্ততি রেখে যাবে, তার যিম্মাদারী আমার। অথবা তিনি বলেছেনঃ আল্লাহ এবং তার তাঁর রাসূলের উপর। আর যে মাল রেখে মারা যাবে, তা তার উত্তরাধিকারীদের। আর যার কোন ওয়ারিছ নেই, আমি তার ওয়ারিছ। আমি তার পক্ষে দিয়্যাত (রক্তপণ) আদায় করব এবং পরিত্যক্ত সম্পত্তির ভাগও দেব। আর মামা তার ওয়ারিছ হবে, যার কোন ওয়ারিছ নেই। সে তার দিয়্যাত আদায় করবে এবং তার পরিত্যক্ত সম্পত্তির ওয়ারিছ হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2900,
			"arabicnumber": 2900,
			"text": "সুলায়মান ইবন হারব (রহঃ) ..... মিকদাম কিনদী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি প্রত্যেক মুসলিমের জন্য তার নিজের সত্তা হতেও অধিক নিকটবর্তী। তাই যে ব্যক্তি দেনা বা সন্তান রেখে মারা যাবে, তার যিম্মাদারী আমার উপর (অর্থাৎ আমি তার দেনা পরিশোধ করব এবং তার সন্তানদের রক্ষনাবেক্ষণ করব)। আর যে ব্যক্তি মাল রেখে মারা যাবে, তা তার ওয়ারিছের জন্য। আর যার কোন মালিক নেই, আমি তার মালিক এবং তার মালেরও মালিক হব, (অর্থাৎ তার মাল বায়তুল মালে সংরক্ষণ করব।) এবং তার কয়েদীদের মুক্ত করব। আর যার কোন ওয়ারিছ নেই, মামা তার ওয়ারিছ হবে। সে তার মালের উত্তরাধিকারী হবে এবং কয়েদীদের মুক্ত করবে। আবূ দাঊদ (রহঃ) বলেনঃ ‘‘যায়‘আ’’ শব্দের অর্থ সন্তান-সন্ততি। আবূ দাঊদ (রহঃ) আরো বলেনঃ যুবায়দী রাশিদ থেকে এরূপ বর্ণণা করেছেন। ইবন আইয মিকদাম থেকে এবং মু‘আবিয়া ইবন সালিহ-রাশিদ থেকে বর্ণনা করেছেন। রাবী বলেছেনঃ আমি মিকদাম (রাঃ) থেকে শুনেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2901,
			"arabicnumber": 2901,
			"text": "আবদুস সালাম ইবন ‘আতীক দিমাশকী (রহঃ) ..... সালিহ্ ইবন ইয়াহইয়া ইবন মিকদাম (রাঃ) তাঁর পিতা থেকে এবং তিনি তাঁর দাদা হতে বর্ণনা করেছেন। তিনি বলেনঃ আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এরূপ বলতে শুনেছিঃ আমি তার ওয়ারিছ যার কোন ওয়ারিছ নেই, তার কয়েদীদের মুক্তি করি এবং তার পরিত্যক্ত মালের উত্তরাধিকারী হই। আর যার কোন ওয়ারিছ নেই, তার মামা তার ওয়ারিছ হবে, যে তার কয়েদীদের মুক্ত করবে এবং তার মালের উত্তরাধিকারীও হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2902,
			"arabicnumber": 2902,
			"text": "মুসাদ্দাদ (রহঃ) .... ‘আইশা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আযাদকৃত গোলাম মারা গেলে সে কিছু মাল রেখে গেল কিন্তু তার কোন ওয়ারিছ ছিল না। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তার পরিত্যক্ত মাল তার গ্রামের কোন এক ব্যক্তিকে দিয়ে দাও। আবূ দাঊদ (রহঃ) বলেনঃ সুফয়ান কর্তৃক বর্ণিত হাদীসটি পূর্ণ হাদীস। তাঁর রাবী মুসাদ্দাদ (রহঃ) বলেন, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসা করেনঃ তার স্বদেসী কোন লোক কি এখানে আছে? তখন তারা (সাহাবীরা) বলেনঃ হ্যাঁ, আছে। তিনি বলেনঃ তবে তাঁর মীরাছ তাকেই দিয়ে দাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2903,
			"arabicnumber": 2903,
			"text": "আবদুল্লাহ্ ইবন সাঈদ কানদী (রহঃ) .... আবদুল্লাহ্ ইবন বুরায়দা (রহঃ) তাঁর পিতা থেকে বর্ণনা করেছেন। তিনি বলেনঃ একদা জনৈক ব্যক্তি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে জিজ্ঞাসা করে যে, আমার কাছে ‘‘আযাদ গোত্রের’’ জনৈক ব্যক্তির কিছু পরিত্যক্ত সম্পদ আছে। কিন্তু আমি এমন কাউকে পাচ্ছি না, যার কাছে আমি তা দিতে পারি। তিনি বলেনঃ তুমি এক বছর পর্যন্ত কোন আযাদী লোককে তালাশ করতে থাক। রাবী বলেনঃ সে ব্যক্তি এক বছর পর তাঁর নিকট হাযির হয়ে বললোঃ ইয়া রাসূলাল্লাহ! আমি কোন আযাদী লোককে পাইনি, যার কাছে এ মাল দিতে পারি। তখন তিনি বলেনঃ তুমি খাযাঈ গোত্রের যে লোকের সাথে সর্বপ্রথম মিলিত হবে, তা তাকে দিয়ে দেবে। অতঃপর যখন সে (লোক) ফিরে চললো, তখন তিনি বললেনঃ ঐ ব্যক্তিকে আমার কাছে ডেকে আনো। অতঃপর সে ব্যক্তি যখন তাঁর নিকট হাযির হলো, তখন তিনি বললেনঃ তুমি খাযাঈ গোত্রের কোন বৃদ্ধ ব্যক্তিকে ওগুলো দিয়ে দেবে। তখন সে ব্যক্তি তাকে তা দিয়ে দেয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2904,
			"arabicnumber": 2904,
			"text": "হাসান ঈন আসওয়াদ ‘আজালী (রহঃ) .... বুরায়দা (রাঃ) তাঁর পিতা থেকে বর্ণনা করেন। তিনি বলেনঃ খুযা‘আ গোত্রের জনৈক ব্যক্তি মারা গেলে তাঁর ধন-সম্পদ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত করা হয়। তখন তিনি বলেনঃ তোমরা কোন ওয়ারিছকে অন্বেষণ কর, অথবা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এই মীরাছ খুযা‘আ গোত্রের কোন বৃদ্ধ লোককে দিয়ে দেবে। রাবী ইয়াহ্ইয়া বলেনঃ আমি তাঁকে মাত্র একবার এরূপ বলতে শুনছছি যে, খুযা‘আ গোত্রের কোন বৃদ্ধ লোককে তা দিয়ে দাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2905,
			"arabicnumber": 2905,
			"text": "মূসা ইবন ইসমাঈল (রহঃ) .... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। জনৈক ব্যক্তি মারা যায় এবং সে একটি আযাদকৃত গোলাম ব্যতীত আর কাউকে ওয়ারিছ হিসাবে রেখে যায়নি। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসা করেনঃ তার কি কোন ওয়ারিছ আছে? তাঁরা (সাহাবীরা) বলেনঃ না, তবে তার একটি আযাদকৃত গোলাম আছে। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেই ব্যক্তিকে ঐ ব্যক্তির পরিত্যক্ত সম্পদ দিয়ে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2906,
			"arabicnumber": 2906,
			"text": "ইবরাহীম ইবন মুসা রাযী (রহঃ) ..... ওয়াসিলা ইবন আসকা' (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেনঃ মহিলারা তিন ব্যক্তির উত্তরাধিকারী হতে পারে, যথাঃ (১) স্বীয় আযাদকৃত গোলামের, (২) পথে কুড়িয়ে পাওয়া সন্তানের এবং (৩) নিজের ঐ সন্তানের, যার ব্যাপারে স্বামীর সাথে লি‘আন করা হয়েছে (অর্থাৎ পিতা যার পিতৃত্বের অস্বীকার করেছে এমন সন্তান)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2907,
			"arabicnumber": 2907,
			"text": "মাহমূদ ইবন খালিদ ও মূসা (রহঃ) .... মাকহূল (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ব্যভিচারের অপবাদে অভিযুক্ত স্ত্রীলোকের সন্তানের উত্তরাধিকারী তার মাতাকে করেছেন, এরপর তার মাতার নিকটাত্মীয়দের।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2908,
			"arabicnumber": 2908,
			"text": "মূসা ইবন ‘আমির (রহঃ) ..... আমর ইবন শু'আয়ব (রহঃ) তাঁর পিতা হতে এবং তিনি তাঁর দাদা সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে পূর্বোক্ত হাদীসের অনুরূপ বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2909,
			"arabicnumber": 2909,
			"text": "মুসাদ্দাদ (রহঃ) ...... উসামা ইবন যায়দ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেনঃ কোন মুসলিম কোন কাফিরের ওয়ারিছ হতে পারে না এবং কোন কাফিরও কোন মুসলিমের ওয়ারিছ হতে পারে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2910,
			"arabicnumber": 2910,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ..... উসামা ইবন যায়দ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি জিজ্ঞাসা করলাম, ইয়া রাসূলাল্লাহ্! আগামীকাল হজ্জের সময় আপনি কোথায় অবতরণ করবেন? তখন তিনি জিজ্ঞাসা করেনঃ ‘আকীল কি আমাদের জন্য কোন ঘর অবশিষ্ট রেখেছে? অতঃপর তিনি বলেনঃ আমরা বনূ কিনানার খায়ফ নামক স্থানে অবতরণ করব, যেখানে কুরাইশগণ কাফিরদের সাথে শপথ করেছিল অর্থাৎ মুহাসসাব নামক স্থানে। আর ঘটনাটি এরূপঃ বনূ কিনানা কুরাশদের থেকে এ মর্মে শপথ নিয়েছিল যে, তারা বনূ হাশিমের সাথে কোন বৈবাহিক সম্পর্ক স্থাপন করবে না এবং তাদের সাথে কোনরূপ বেচাকেনা করবে না, আর না তাদের কোনরূপ আশ্রয় দেবে। যুহরী (রহঃ) বলেনঃ খায়ফ হলো একটি উপত্যকার নাম- যেখানে উক্ত শপথ সংঘটিত হয়েছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2911,
			"arabicnumber": 2911,
			"text": "মূসা ইবন ইসমা‘ঈল (রহঃ) ...... ‘আবদুল্লাহ্ ইবন ‘আমর (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন যে, দুটি ভিন্ন মিল্লাতের (জাতির) অনুসারীরা একে অপরের ওয়ারিছ হতে পারে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2912,
			"arabicnumber": 2912,
			"text": "মুসাদ্দাদ (রহঃ) .... ‘আবদুল্লাহ্ ইবন বুরাইদা (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা দু‘ভাই ইয়াহইয়া ইবন ইয়ামুর (রাঃ) এর নিকট মোকদ্দমা পেশ করে, যার একজন ছিল ইয়াহুদী এবং অপরজন মুসলিম। তিনি ঐ দু‘জনের মধ্য হতে মীরাছ প্রদান করলেন এবং বললেনঃ আমার কাছে আবুল আসওয়াদ হাদীস বর্ণনা করেছেন, যা তার নিকট জনৈক ব্যক্তি বর্ণনা প্রসঙ্গে বলেন, একদা মু‘আয (রাঃ) বর্ণনা করেন যে, আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ ইসলাম বর্ধিত হয়, কমেনা। অতঃপর তিনি মুসলিম ব্যক্তিকে মীরাছ দিয়ে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2913,
			"arabicnumber": 2913,
			"text": "মুসাদ্দাদ (রহঃ) ...... আবু আসওয়াদ আদ দীলী (রাঃ) থেকে বর্ণিত। একদা মু‘আয এমন একজন ইয়াহুদীর পরিত্যক্ত সম্পত্তি নিয়ে আসেন, যার ওয়ারিছ ছিল মুসলিম। অতঃপর তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাদীছের আলোকে তা মুসলিম ব্যক্তিকে দিয়ে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2914,
			"arabicnumber": 2914,
			"text": "হাজ্জাজ ইবন আবূ ইয়াকূব (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে পরিত্যক্ত ধন-সম্পদ জাহিলিয়াতের যুগে বণ্টন হয়েছে, তার বণ্টন এরূপই থাকবে। পক্ষান্তরে, যে ধন-সস্পদ ইসলামের যুগে বন্টিত হবে, তা ইসলামের বিধান অনুসারে বণ্টন করতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2915,
			"arabicnumber": 2915,
			"text": "কুতায়বা ইবন সা'ঈদ (রহঃ) .... ইবন উমার (রাঃ) থেকে বর্ণিত। একবার উম্মুল মু'মিনীন আইশা (রাঃ) আযাদ করে দেওয়ার জন্য একটি দাসী খরিদ করতে মনস্থ করেন। তখন সে দাসীর মালিক বলেনঃ আমি একে এ শর্তে বিক্রি করতে চাই যে, তার মৃত্যুর পর তার পরিত্যক্ত সস্পদের মালিকানা যেন আমরা হয়। তখন আইশা (রাঃ) ব্যাপারটি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট বর্ণনা করেন। তখন তিনি বলেনঃ সে তোমাকে তা থেকে বঞ্চিত করতে পারবে না। কেননা দাসীর পরিত্যক্ত মালের মালিক সে হবে, যে তাকে মুক্ত করেছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2916,
			"arabicnumber": 2916,
			"text": "উছমান ইবন আবী শায়বা (রহঃ) .... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আযাদকৃত দাস-দাসীর পরিত্যক্ত মাল সে পাবে, যে তার মুক্তির জন্য মূল্য পরিশোধ করবে এবং তার উপর ইহসান করবে (অর্থাৎ তাকে খরিদ করে আযাদ করে দেবে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2917,
			"arabicnumber": 2917,
			"text": "আবদুল্লাহ ইবন আমর ইবন আবী হাজ্জাজ আবূ মা'মার (রহঃ) .... আমর ইবন শু'আয়ব (রহঃ) তার পিতা হতে এবং তিনি তার দাদা থেকে বর্ণনা করেছেন যে, রাবাব ইবন হুযায়ফা (রাঃ) জনৈক মহিলাকে বিবাহ করেন। যার গর্ভে তাঁর ঔরসে তিনটি সন্তান জন্ম নেয়। অতঃপর তাদের মাতা মারা গেলে, তারা (বাচ্চারা) তাদের মাতার পরিত্যক্ত বাড়ী ও আযাদকৃত দাস-দাসীর ওয়ারিছ হয়। আর আমর ইবন আস (রাঃ) ছিলেন এদের 'আসাবা' যিনি তাদেরকে শাম দেশে পাঠালে তারা সবাই সেখানে মারা যায়। অতঃপর আমর ইবন আস (রাঃ) সেখানে গমন করেন। তখন সে মহিলার একটি আযাদকৃত গোলাম মারা যায়, যে তার কিছু ধন-সম্পদ রেখে যায়। তখন সে মহিলার ভাই এ ব্যাপারে ফয়সালার জন্য উমার ইবন খাত্তাব (রাঃ) এর নিকট উপস্থিত হয়। সে সময় উমার (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন যে, আযাদকৃত দাস-দাসীর পরিত্যক্ত মাল, যা সন্তান-সন্ততি বা পিতা পেয়েছে, তা তার 'আসাবা' যারা থাকবে, তাদের প্রাপ্য। অতঃপর তিনি [উমার (রাঃ)] এ ব্যাপারে একটি রায় লিপিবদ্ধ করেন, যাতে আবদুর রহমান ইবন আওফ, যায়দ ইবন ছাবিত (রাঃ) এর দস্তখত ছাড়াও আরো এক ব্যক্তির দস্তখত নেওয়া হয়। অতঃপর আবদুল মালিক ইবন মারোয়ান যখন খলীফা নিযুক্ত হন, তখন লোকেরা এ ধরনের একটি মোকদ্দমা হিশাম ইবন ইসমা'ঈল বা ইসমা'ঈল ইবন হিশামের কাছে পেশ করে। যিনি সেটি খলীফা আবদুল মালিকের নিকট পাঠিয়ে দেন। যা দেখে তিনি বলেনঃ ব্যাপারটি আমার কাছে এমনই মনে হচ্ছে যে, যেন আমি তা দেখেছি। রাবী বলেনঃ তখন তিনি (আবদুল মালিক) উমার ইবন খাত্তাব (রাঃ) এর ফয়সালার অনুরূপ মোকদ্দমাটি নিষ্পত্তি করে দেন। আর ঐ পরিত্যক্ত সস্পত্তি এখনও আমাদের কাছে মওজুদ আছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2918,
			"arabicnumber": 2918,
			"text": "ইয়াযীদ ইবন খালিদ ইবন মাওহাব রামলী ও হিশাম ইবন আম্মার (রহঃ) .... তামীম দারী (রাঃ) থেকে বর্ণিত। একদা তিনি বলেন, ইয়া রাসূলাল্লাহ! রাবী ইয়াযীদ বলেনঃ জনৈক ইয়াতীম বলে, ইয়া রাসূলাল্লাহ! ঐ ব্যক্তি সম্পর্কে বিধান কি, যে কোন মুসলিমের হাতে হাত রেখে ইসলাম কবুল করেছে? তিনি বলেনঃ সে ব্যক্তি তার জীবন ও মৃত্যুর জন্য উত্তম ব্যক্তি (যদি সে ব্যক্তির কোন ওয়ারিছ না থাকে, তবে সে-ই ওয়ারিছ হয়ে যাবে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2919,
			"arabicnumber": 2919,
			"text": "হাফস ইবন উমার (রহঃ) .... ইবন উমার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আযাদকৃত দাস-দাসীদের পরিত্যক্ত মাল বিক্রি করতে এবং হেবা বা দান করতে নিষেধ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2920,
			"arabicnumber": 2920,
			"text": "হুসায়ন ইবন মু'আয (রহঃ) .... আবূ হুরায়রা (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেনঃ সন্তান যদি ভূমিষ্ঠ হয়ে কাঁদে, তবে তাকে ওয়ারিছ করা হবে (অর্থাৎ সন্তানের মাঝে জীবনের চিহ্ন প্রকাশের সাথে সাথেই সে মীরাছের অধিকারী হবে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2921,
			"arabicnumber": 2921,
			"text": "আহমদ ইবন মুহাম্মদ ইবন ছাবিত (রহঃ) .... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আল্লাহ তা'আলার বিধানঃ (وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ فَآتُوهُمْ نَصِيبَهُمْ) অর্থাৎ \"তোমরা শপথপূর্বক যাদের সাথে ওয়াদা করেছ, তাদের হক তাদের দিয়ে দাও।\" জাহিলিয়াতের যুগে এক ব্যক্তি অন্য ব্যক্তির সাথে শপথপূর্বক এরূপ ওয়াদা করত, যদিও তাদেরর মাঝে আত্নীয়তার সম্পর্ক থাকতো না। ফলে, তারা একে অন্যের ওয়ারিছ হয়ে যেত। এ হুকুমটি সূরা আনফালের এ আয়াত দ্বারা বাতিল হয়ে যায়ঃ (وَأُولُو الأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ) অর্থাৎ নিকট আত্মীয়রাই একে অন্যের সস্পদের অধিক হকদার।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2922,
			"arabicnumber": 2922,
			"text": "হারুন ইবন আবদুল্লাহু (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি এই আয়াতঃ অর্থাৎ \"তোমরা শপথপূর্বক যাদের সাথে ওয়াদা করেছ, তাদের হক তাদের দিয়ে দাও\"-এর ব্যাখ্যায় বলেন যে, যখন মুহাজিরগণ (মক্কা হতে হিজরত করে) মদীনায় আসেন, তখন আনসারগণ তাদের ওয়ারিছ হতেন এবং আত্মীয়রা মাহরুম হতেন। কেননা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের মাঝে আত্মীয়তার সম্পর্ক স্থাপন করে দেন। কিন্তু যখন এ আয়াত নাযিল হয়ঃ অর্থাৎ পিতামাতা যে সম্পদ রেখে যাবে, তাতে আমি তাদের প্রত্যেকের জন্য অংশ নির্ধারণ করে দিয়েছি। রাবী ইবন আব্বাস (রাঃ) বলেন, এই আয়াতটি পূর্ববর্তী আয়াতঃ অর্থাৎ \"যাদের সাথে তোমরা ওয়াদাবদ্ধ তাদের প্রাপ্য তাদের প্রদান করো।\" এর হুকুম, যাতে আনসারদের প্রতি সাহায্য-সহানুভূতি ও ভ্রাতৃত্ববোধের নির্দেশ ছিল, তা বাতিল হয়ে যায়। অবশ্য তাদের জন্য মালের এক-তৃতীয়াংশ ওসীয়ত করা যেতে পারে, কিন্ত উত্তরাধিকারিত্ব বাতিল হয়ে গেছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2923,
			"arabicnumber": 2923,
			"text": "আহমদ ইবন হাম্বল ও আবদুল আযীয ইবন ইয়াহ্‌ইয়া (রহঃ) .... দাঊদ ইবন হুসাইন (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি উম্মু সা'দ বিনত রাবী'র কাছে কুরআন মাজীদ পড়তাম, যিনি ইয়াতীম ছিলেন এবং আবূ বকর (রাঃ) এর তত্ত্বাবধানে লালিত-পালিত হন। অতঃপর যখন আমি এই আয়াতঃ (وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ) অর্থাৎঃ \"যাদের সাথে তোমরা ওয়াদাবদ্ধ তাদের প্রাপ্য তাদের প্রদান করো\" তিলাওয়াত করি, তখন তিনি বলেনঃ তুমি এ আয়াত পড়বে না (অর্থাৎ এর উপর আমল করবে না)। কেননা এ আয়াত আবূ বকর (রাঃ) এবং তাঁর পুত্র আব্দুর রহমান এর শানে নাযিল হয়। যখন আবদুর রহমান ইসলাম কবুল করতে অস্বীকার করেন, তখন আবূ বকর (রাঃ) এরূপ শপথ করেন যে, তিনি তাকে মীরাছের অংশ দিবেন না। পরে যখন তিনি [আবদুর রহমান (রাঃ)] ইসলাম কবুল করেন, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে তাঁর হিসসা দেওয়ার জন্য নির্দেশ দেন। রাবী আবদুল আযীয এরূপ অতিরিক্ত বর্ণনা করেছেনঃ তিনি তখন ইসলাম কবুল করেন, যখন ইসলামে তরবারির আধিপত্য প্রতিষ্ঠিত হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2924,
			"arabicnumber": 2924,
			"text": "আহমদ ইবন মুহাম্মদ (রহঃ) .... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি এই আয়াত সম্পর্কে বলেনঃ (وَالَّذِينَ آمَنُوا وَهَاجَرُوا وَالَّذِينَ آمَنُوا وَلَمْ يُهَاجِرُوا) অর্থাৎ \"যারা ঈমান এনেছে এবং হিজরত করেছে, তারা একে অপরের ওয়ারিছ হবে। পক্ষান্তরে, যারা ঈমানে এনেছে, কিন্তু হিজরত করেনি, তোমরা তাদের ওয়ারিছ হবে না, যতক্ষণ না তারা হিজরত করে।\" এ সময় যে মুসলিমরা কোন কাফিরের দেশে অবস্থান করত, তারা মুহাজিরদের ওয়ারিছ হতো না এবং মুহাজিরগণও তাদের উত্তরাধিকারী হতো না। পরে যখন এ আয়াত নাযিল হয়ঃ (وَأُولُو الأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ) অর্থাৎ নিকট আত্মীয়রাই একে অন্যের সম্পওির অধিক হকদার, তখন আগের আয়াতের হুকুম বাতিল হয়ে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2925,
			"arabicnumber": 2925,
			"text": "উছমান ইবন আবী শায়বা (রহঃ) ..... জুবায়র ইবন মুত'ইম (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইসলামে জাহিলী যুগের শপথের কোন মূল্য নেই। আর জাহিলী যুগের শপথের মাঝে উত্তম কথার ব্যাপারে যে ওয়াদা ও অঙ্গীকার ছিল, ইসলাম তাকে আরো মযবূত করে দিয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2926,
			"arabicnumber": 2926,
			"text": "মুসাদ্দাদ (রহঃ) ..... আসিম আহওয়াল (রহঃ) থেকে বর্ণিত। তিনি বলেন, আমি আনাস (রাঃ)-কে এরূপ বলতে শুনেছি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের দেশে (মদীনাতে) আনসার ও মুহাজিরদের মাঝে সৌভ্রাত্র স্থাপন করে দেন। তখন আনাস (রাঃ)-কে জিজ্ঞাসা করা হয়, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি এরূপ নির্দেশ দেননি যে, ইসলামে জাহিলী যুগের ওয়াদা-অঙ্গীকারের কোন মূল্য নেই? তখন তিনি (আনাস) দুই বা তিনবার বলেনঃ আমাদের দেশে (মদীনাতে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসার ও মুহাজিরদের মাঝে ভ্রাতৃত্বের সম্পর্ক স্থাপন করে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2927,
			"arabicnumber": 2927,
			"text": "আহমদ ইবন সালিহ (রহঃ) .... সা'ঈদ (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ উমার ইবন খাত্তাব (রাঃ) এরূপ বলতেন যে, দিয়্যাত বা রক্তপণে বংশের লোকদের হিসসা আছে। আর স্ত্রী স্বামীর দিয়্যাতের মালের কিছুই পাবে না। তখন যাহহাক ইবন সুফিয়ান তাঁকে বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার কাছে এরূপ লিখিত নির্দেশ পাঠান যে, আমি যেন আশ'আম যুবাবীর স্ত্রীকে তার স্বামীর দিয়্যাত হতে মীরাছ প্রদান করি। তখন উমার (রাঃ) তাঁর সিদ্ধান্ত প্রত্যাহার করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 43
			}
		}
	]
}