{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2928,
			"arabicnumber": 2928,
			"text": "আবদুল্লাহ ইবন মাসলামা (রহঃ) ..... আবদুল্লাহ্‌ ইবন উমার (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সাবধান! তোমরা সকলে রাখালের ন্যায় দায়িত্বশীল এবং (কিয়ামতের দিন) প্রত্যেক ব্যক্তিকে তার অধীনস্থদের প্রতি দায়িত্ব পালনের ব্যাপারে জিজ্ঞাসাবাদ করা হবে। সুতরাং যে ব্যক্তি আমীর (নেতা) হয়েছে, তাকে তাদের ব্যাপারে জিজ্ঞাসাবাদ করা হবে যে, (সে তার অধীনস্থদের সাথে) কিরূপ ব্যবহার করেছে। আর প্রত্যেক পুরুষ তার পরিবার-পরিজনদের রক্ষণাবেক্ষণকারী। তাকে তাদের ব্যাপারে জিজ্ঞাসাবাদ করা হবে। আর স্ত্রী, তার স্বামীর ঘর-সংসার ও তার সন্তানাদির রক্ষণাবেক্ষণকারিনী, তাকে এসব ব্যাপারে জিজ্ঞাসাবাদ করা হবে। কাজেই, তোমরা সকলে দায়িত্বশীল রক্ষণাবেক্ষণকারী এবং তোমাদের সকলকে তোমাদের অধীনস্থদের ব্যাপারে জিজ্ঞাসাবাদ করা হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2929,
			"arabicnumber": 2929,
			"text": "মুহাম্মদ ইবন সাব্বাহ বাযযায (রহঃ) ..... আবদুর রহমান ইবন সামুরা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেন যে, হে আবদুর রহমান ইবন সামুরা! তুমি নেতৃত্ব চাবে না। কেননা যদি তোমার চাওয়ার প্রেক্ষিতে তা তোমাকে দেওয়া হয়, তবে তার দায়িত্ব তোমার উপর বর্তাবে। আর যদি চাওয়া ব্যতীত তা তোমাকে দেওয়া হয়, তবে তুমি তাতে সাহায্যপ্রাপ্ত হবে (অর্থাৎ আল্লাহ্‌ তোমাকে সাহায্য করবেন)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2930,
			"arabicnumber": 2930,
			"text": "ওয়াহব ইবন বাকীয়্যা (রহঃ) ..... আবূ মূসা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি দু'ব্যক্তিকে সঙ্গে নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গমন করি। তখন তাদের এক ব্যক্তি প্রারম্ভিক বক্তব্য পেশের পর বললোঃ আমরা এজন্য এসেছি যে, আপনি আমাদের দিয়ে রাষ্ট্র পরিচালনার ব্যাপারে সাহায্য নিবেন। আর দ্বিতীয় জনও তার সাথীর অনুরূপ বক্তব্য পেশ করলো। তখন তিনি বললেনঃ তোমাদের মাঝে যে ব্যক্তি নেতৃত্ব চায়, সে আমাদের দৃষ্টিতে অধিক খিয়ানতকারী। তখন আবূ মূসা (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উযর পেশ করে বলেনঃ আমি জানতে পারিনি যে, তারা এ উদ্দেশ্য নিয়ে এসেছে। অতঃপর তিনি আমৃত্যু তাদের দিয়ে কোন কাজে সাহায্য নেন নি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2931,
			"arabicnumber": 2931,
			"text": "মুহাম্মদ ইবন আবদুল্লাহ মুখাররামী (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু'বার ইবন উম্মু মাকতুম (অন্ধ সাহাবী)-কে (যুদ্ধে যাওয়ার সময়) মদীনাতে তাঁর খলীফা হিসাবে নিয়োগ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2932,
			"arabicnumber": 2932,
			"text": "মূসা ইবন আমির মুররী (রহঃ) .... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন যে, আল্লাহ্‌ তা'আলা কোন নেতার জন্য যখন কল্যাণের ফয়সালা করেন, তখন তিনি তাকে সত্যবাদী, ন্যায়নিষ্ঠ উযীর প্রদান করেন। যদি তিনি (নেতা) কিছু ভুলে যান, তখন সে (উযীর) তাকে তা স্মরণ করিয়ে দেয়। আর আমীর যদি তা স্মরণ রাখেন, তখন উযীর তাকে সাহায্য করে। পক্ষান্তরে আল্লাহ তা'আলা কোন নেতার জন্য যখন অকল্যাণের ফয়সালা করেন, তখন তিনি তাকে অযোগ্য উযীর প্রদান করেন। ফলে যখন তিনি (আমীর) কিছু ভুলে যান, তখন সে (উযীর) তাকে তা স্মরণ করিয়ে দেয় না। আর আমীর যদি স্মরণ রাখেন, তখন সে তাকে সাহায্য করে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2933,
			"arabicnumber": 2933,
			"text": "আমর ইবন উছমান (রহঃ) ..... মিকদাম ইবন মা'দীকারিব (রাঃ) থেকে বর্ণিত। একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার দু'কাঁধে হাত রেখে বলেন, হে কুদায়ম! তুমি নাজাত পাবে, যদি তুমি আমীর, মুনশী (কেরানী) এবং আরাফা (সমাজপতি) হওয়ার আগে মারা যাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2934,
			"arabicnumber": 2934,
			"text": "মুসাদ্দাদ (রহঃ) ..... গালিব কাত্তান (রাঃ) জনৈক ব্যক্তি হতে বর্ণনা করেছেন। যিনি তাঁর পিতা হতে এবং তাঁর দাদা হতে বর্ণনা করেছেন যে, তারা একটি ঝর্ণার নিকট বসবাস করত। যখন তারা দীন-ইসলাম সম্পর্কে জানতে পারে, তখন ঝর্ণার মালিক তার অধীনস্থ লোকদের এ শর্তে একশটি উট দিতে চায় যে, তারা ইসলাম কবুল করবে। তখন তারা ইসলাম কবুল করলে তাদের মাঝে একশটি উট বন্টন করে দেন। কিন্তু পরবর্তীকালে তিনি তাদের থেকে সেগুলো ফেরত নেওয়ার খেয়াল করেন এবং স্বীয় পুত্রকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট প্রেরণ করেন। তিনি তাঁর পুত্রকে এ মর্মে নির্দেশ দেন যে, সে যেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট হাযির হয়ে তাকে বলেঃ আমার পিতা আপনাকে সালাম জানিয়েছেন, আর তিনি তাঁর কওমের লোকদের মাঝে এ উদ্দেশ্যে একশটি উট বিতরণ করতে চান, যাতে তারা ইসলাম কবুল করে। অতঃপর তারা ইসলাম কবুল করেছে এবং তিনিও তাদের মাঝে শত উট বিতরণ করেছেন। এখন তাদের থেকে সেগুলি ফেরত নেওয়ার ইচ্ছা করছেন। তাই তিনি কি এগুলির অধিক হকদার, না ঐ ব্যক্তিরা? তখন তিনি বললেনঃ যদি তিনি সেগুলো তাদের দিয়ে দিতে চান, তবে তিনি দিতে পারেন। আর যদি তিনি সেগুলো ফিরত নিতে চান তাহেলেও এ ব্যাপারে তিনি অধিক হকদার। আর তারা যদি সত্য-সত্যই মুসলিম হয়ে থাকে, তবে তারা এর বিনিময় (আল্লাহ্‌র নিকট) পাবে। আর যদি তারা সত্যিকারভাবে মুসলিম না হয়ে থাকে, তবে তাদেরকে ইসলামের জন্য কতল করা হবে। অতঃপর সে (ছেলে) বলেঃ আমার পিতা একজন অতি বৃদ্ধ লোক, আর তিনি পানির আরীফও। তিনি আপনার নিকট এরূপ দরখাস্ত করেছেন যে, আপনি আমাকে তার পরে ঐ পানির আরীফ নিয়োগ করবেন। তখন তিনি বলেনঃ নিশ্চয় ইরাফা (প্রতিনিধিত্ব) খুবই জরুরী বিষয়। আর লোকজনের উপকারার্থেই তাদের নির্বাচিত প্রতিনিধি প্রয়োজন। কিন্তু প্রতিনিধিত্বকারী নেতারাই জাহান্নামে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2935,
			"arabicnumber": 2935,
			"text": "কুতায়বা ইবন সাঈদ (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ 'সিজিল্লু' নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর একজন ওয়াহী লেখকের নাম ছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2936,
			"arabicnumber": 2936,
			"text": "মুহাম্মদ ইবন ইব্‌রাহীম আসবাতী (রহঃ) .... রাফে ইবন খাদীজ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, সঠিকভাবে সাদকা (যাকাত) আদায়কারী হলো আল্লাহ্‌র রাস্তায় জিহাদকারীর মত, যতক্ষণ না সে তার ঘরে ফিরে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2937,
			"arabicnumber": 2937,
			"text": "আবদুল্লাহ্‌ ইবন মুহাম্মদ নুফায়লী (রহঃ) .... উকবা ইবন আমির (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, যাকাতের মালের নিদিষ্ট পরিমাণের চাইতে অধিক গ্রহণকারী ব্যক্তি জান্নাতে প্রবেশ করবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2938,
			"arabicnumber": 2938,
			"text": "মুহাম্মদ ইবন আবদুল্লাহ কাত্তান (রহঃ) ..... ইবন ইসহাক (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ 'সাহেবে-মাক্‌স' ঐ ব্যক্তি, যে লোকদের নিকট হতে উশর এক-দশমাংশ আদায় করার সময় (যাকাত হিসাবে) কিছু বেশী আদায় করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2939,
			"arabicnumber": 2939,
			"text": "মুহাম্মদ ইবন দাউদ ইবন সুফআন ও সালামা (রহঃ) ..... ইবন উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, উমার (রাঃ) ঘোষণা দেনঃ আমি খলীফা (আমার পরের) মনোনীত করব না। কেননা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন খলীফা মনোনীত করেন নি। আর আমি যদি কাউকে খলীফা মনোনীত করি, (তবে এতে দোষের কিছুই নেই)। কেননা আবূ বকর (রাঃ) খলীফা মনোনীত করেছিলেন। আবদুল্লাহ ইবন উমার (রাঃ) বলেনঃ আল্লাহ্‌র শপথ! তিনি [উমার (রাঃ)] রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং আবূ বকর (রাঃ) সম্পর্কে উল্লেখ করায় আমি বুঝতে পারি যে, তিনি কাউকেও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সমান মনে করেন না এবং তিনি কাউকেও তাঁর খলীফা মনোনীত করবেন না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2940,
			"arabicnumber": 2940,
			"text": "হাফ্‌স ইবন উমার (রহঃ) .... ইবন উমার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এ মর্মে বায়'আত গ্রহণ করতাম যে, আমরা তাঁর কথা শুনব এবং আমল করব। আর তিনি আমাদেরকে এরূপ শিক্ষা দিতেন যে তোমরা তোমাদের সাধ্যমত দীনের কাজ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2941,
			"arabicnumber": 2941,
			"text": "আহমদ ইবন সালিহ (রহঃ) .... উরওয়া (রহঃ) থেকে বর্ণিত। আইশা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কর্তৃক মহিলাদের বায়'আত করা সম্পর্কে তাঁকে এরূপ বলেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কখনো কোন বেগানা স্ত্রীলোককে তাঁর হাত দিয়ে স্পর্শ করেননি। অবশ্য তিনি তাদের নিকট হতে বায়'আতের অঙ্গীকার গ্রহণ করতেন। আর যখন তিনি অঙ্গীকার নিতেন, তখন তারা তাঁর নিকট অঙ্গীকারবদ্ধ হতো। এ সময় তিনি বলতেনঃ যাও, আমি তোমাকে বায়'আত করেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2942,
			"arabicnumber": 2942,
			"text": "উবায়দুল্লাহ ইবন উমার ইবন মায়সারা (রহঃ) ..... আবদুল্লাহ্‌ ইবন হিশাম (রাঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যামানা পেয়েছিলেন। তিনি বলেনঃ তাকে নিয়ে তার আম্মা যয়নব বিনত হুমাইদ (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট যান এবং বলেনঃ ইয়া রাসূলাল্লাহ! একে বায়'আত করুন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ সে তো খুবই ছোট। এরপর তিনি তার মাথায় হাত দিয়ে স্নেহের পরশ বুলিয়ে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2943,
			"arabicnumber": 2943,
			"text": "যায়দ ইবন আখযাম আবূ তালিব (রহঃ) ..... আবদুল্লাহ্‌ ইবন বুরায়দা (রহঃ) তাঁর পিতা সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেনঃ আমি যাকে যে কাজের জন্য নিয়োগ করব এবং তার জন্য যে বেতন নির্ধারণ করব, এর অতিরিক্ত যদি সে কিছু গ্রহণ করে, তবে তা আত্মসাৎরূপে গণ্য হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2944,
			"arabicnumber": 2944,
			"text": "আবূ ওয়ালীদ তায়ালিসী (রহঃ) ..... ইবন সা'ইদী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমাকে উমার (রাঃ) যাকাত আদায়ের দায়িত্বে নিয়োগ করেন। যখন আমি এ কাজ হতে মুক্ত হই, তখন তিনি আমাকে এর বিনিময় দেওয়ার জন্য নির্দেশ দেন। এ সময় আমি বলিঃ আমি তো আল্লাহ্‌র ওয়াস্তে এ কাজ করেছি। তখন তিনি বলেনঃ তোমাকে যা দেওয়া হচ্ছে, তা গ্রহণ কর। কেননা আমিও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যামানায় এ দায়িত্ব পালন করেছিলাম। তখন তিনি আমাকে এর মজুরী দিয়েছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2945,
			"arabicnumber": 2945,
			"text": "মূসা ইবন মারওয়ান রুকী (রহঃ) ..... মুসতাওরিদ ইবন শাদ্দাদ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এরূপ বলতে শুনেছি যে, যে ব্যক্তি আমাদের সরকারী কর্মচারী হবে, সে একজন বিবি রাখতে পারবে (যার ভরণ-পোষণ বায়তুল মাল হতে দেওয়া হবে)। আর তার যদি কোন খাদিম না থাকে, তবে সে একটি খাদিমও রাখতে পাররে এবং যদি তার থাকার মত কোন ঘর না থাকে,তবে সে একটি বাসস্থান পাবে। রাবী বলেনঃ আবূ বকর (রাঃ) বলেন যে, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছি, তিনি বলেছেনঃ যে ব্যক্তি এর অতিরিক্ত কিছু গ্রহন করবে, সে হবে খিয়ানতকারী এবং চোর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2946,
			"arabicnumber": 2946,
			"text": "ইবন সারহ ও ইবন আবী খালাফ (রহঃ) .... হুমায়দ সা'ইদী (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আযদ গোত্রের জনৈক ব্যক্তিকে যার নাম ছিল লুতবিয়াহ ইবন সারহ বলেন, তাকে ইবন উতবিয়াও বলা হতো, যাকাত আদায়ের জন্য কর্মচারী হিসাবে নিয়োগ করেন। যখন সে যাকাত আদায় করে ফিরে আসলো, তখন সে বললোঃ এগুলো তোমাদের জন্য এবং এগুলো আমাকে হাদিয়ারূপে দেওয়া হয়েছে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বরের উপর দাঁড়ালেন এবং আল্লাহ্‌র প্রশংসা ও গুণগান আদায়ের পর বললেনঃ কর্মচারীর জন্য এ বিধেয় নয় যে, আমি তাকে কর্মচারী নিয়োগ করে পাঠাব, আর সে ফিরে এসে বলবেঃ এই মাল তোমাদের এবং এই হাদিয়া আমাকে দেওয়া হয়েছে। যদি সে তার পিতার বা মাতার গৃহে বসে থেকে দেখতো যে, তাকে হাদিয়া দেওয়া হয় কিনা? তোমাদের কেউ তা থেকে অতিরিক্ত কিছু গ্রহণ করলে, সে কিয়ামতের দিন তা নিয়ে উপস্থিত হবে। যদি তা উট হয়, তবে সে উটের আওয়াজ করতে থাকবে। যদি বলদ অথবা গাভী হয়, তখন সে গরুর মত হাম্বা-হাম্বা ডাক দিতে দিতে আসবে। আর যদি বকরী হয়, তবে তাও বকরীর মত ডাকতে থাকবে। এরপর তিনি তাঁর দু'হাত (দু'আর জন্য) এত উপরে উঠালেন যে, আমরা তাঁর বগলের সাদা অংশ দেখতে পেলাম। অতঃপর তিনি বলেনঃ ইয়া আল্লাহ্‌! আমি কি (তোমার হুকুম) পৌছে দিয়েছি? ইয়া আল্লাহ্‌! আমি কি (তোমার নির্দেশ) পৌছে দিয়েছি?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2947,
			"arabicnumber": 2947,
			"text": "উছমান ইবন আবী শায়বা (রহঃ) ..... আবূ মাস'ঊদ আনসারী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে যাকাত আদায় করার জন্য প্রেরণ করেন। এ সময় তিনি বলেনঃ হে আবূ মাসঊদ তুমি যাও। কিন্তু আমি যেন তোমাকে কিয়ামতের দিন পিঠের উপর চীৎকাররত উট বহন করে আনতে না দেখি। কারণ দুনিয়াতে যাকাতের মাল আত্নসাৎ করার জন্য এরূপ শাস্তি হবে। রাবী বলেনঃ যদি ব্যাপার এরূপ হয়, তবে আমি এ দায়িত্ব গ্রহণ করব না। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এমতাবস্থায় আমি তোমাকে এ কাজের জন্য জবরদস্তি করব না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2948,
			"arabicnumber": 2948,
			"text": "সুলায়মান ইবন আবদুর রহমান দিমাশকী (রহঃ) ..... আবূ মারয়াম আযদী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি মু'আবিয়া ইবন আবী সুফিয়ানের নিকট গমন করি। তখন তিনি বলেনঃ আমাদের কাছে তোমার আগমনে স্বাগতম, হে অমুক! আরবরা মেহমানদের এভাবে খোশ আমদেদ জানাত। তখন আমি তাকে বলিঃ আমি একটা হাদীছ শুনেছি, যা আমি আপনাকে অবহিত করছি। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ যে ব্যক্তিকে মহান আল্লাহ্‌ কোন কাজের দায়িত্বে নিয়োগ করেছেন, সে যদি লোকদের প্রয়োজনে সাড়া দিয়ে তাদের জরুরী ব্যাপারগুলি পূর্ণ করে, তবে আল্লাহ্‌ও তার প্রয়োজনের সময় সাড়া দিয়ে তার কাজকে পূর্ণ করে দেন। রাবী বলেনঃ এ কথা শোনার পর তিনি মু'আবিয়া (রাঃ) লোকদের প্রয়োজন মেটানোর জন্য একজন লোক নিয়োগ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2949,
			"arabicnumber": 2949,
			"text": "সালামা ইবন শাবীব (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি আমার তরফ হতে তোমাদেরকে না কিছু দেই এবং না কিছু আটকিয়ে রাখি। বরং আমি তো বণ্টনকারী মাত্র। যেখানে হুকুম হয়, আমি সেখানেই খরচ করি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2950,
			"arabicnumber": 2950,
			"text": "নুফায়লী (রহঃ) ...... মালিক ইবন আওস ইবন হাদাসান (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা উমার ইবন খাত্তাব (রাঃ) মালে গনীমত সম্পর্কে আলোচনা প্রসঙ্গে বলেন যে, আমি তোমাদের চাইতে অধিক মালে গনীমতের হকদার নই এবং আমাদের কেউ-ই একের চাইতে অপরের অধিক হক রাখে না। বরং আমরা সবাই আল্লাহ তা'আলার কিতাবে বর্ণিত বিধান অনুযায়ী স্ব স্ব স্থানে অবস্থিত আছি। অবশ্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বন্টন অনুযায়ী কোন ব্যক্তি ইসলাম কবুলের দিক হতে পুরাতন কেউ বীর যোদ্ধা, কেউ অধিক পরিবার-পরিজনের মালিক এবং কেউ মুখাপেক্ষী। কাজেই তিনি সকলের প্রয়োজন অনুযায়ী মালে গনীমত বন্টন করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2951,
			"arabicnumber": 2951,
			"text": "হারুন ইবন যায়দ ইবন আবী যারকা (রহঃ) ..... যায়দ ইবন আসলাম (রহঃ) থেকে বর্ণিত। একদা আবদুল্লাহ ইবন উমার (রাঃ) মু'আবিয়া (রাঃ)-এর নিকট উপস্থিত হন। তখন তিনি মু'আবিয়া (রাঃ) তাকে জিজ্ঞাসা করেনঃ হে আবূ আবদুর রহমান! তোমার কি প্রয়োজন? তখন তিনি বলেনঃ আপনি আযাদপ্রাপ্ত গোলামদের হিসসা প্রদান করুন। কেননা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এরূপ করতে দেখেছি যে, তিনি আযাদপ্রাপ্ত গোলামদের অংশ, গনীমতের মাল হিসাবে আগত সম্পদ হতে আগে দেওয়া শুরু করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2952,
			"arabicnumber": 2952,
			"text": "ইবরাহীম ইবন মূসা রাযী (রহঃ) ...... আইশা (রাঃ) থেকে বর্ণিত। একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এমন একটি থলে আসে, যাতে একটি আংটিও ছিল। তখন তিনি তা আযাদকৃত দাস ও দাসীদের মাঝে বন্টন করে দেন। আইশা (রাঃ) আরো বলেনঃ আমার পিতা [আবূ বকর সিদ্দীক (রাঃ)]ও আযাদ ও গোলামদের মাঝে গনীমতের অতিরিক্ত সম্পদ বন্টন করে দিতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2953,
			"arabicnumber": 2953,
			"text": "সাঈদ ইবন মানসূর (রহঃ) .... আওফ ইবন মালিক (রাঃ) থেকে বর্ণিত যে, যখনই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট কোন মালে-গনীমত আসতো, তখন তিনি সেদিনই তা বন্টন করে দিতেন। তিনি বিবাহিত ব্যক্তিদের দু'অংশ এবং অবিবাহিত ব্যক্তিদের এক অংশ দিতেন। রাবী ইবন মুসাফফা এরূপ অতিরিক্ত বর্ণনা করেছেন যে, আমাকে আহবান করা হতো এবং আম্মার (রাঃ)-এর আগেই আমাকে ডাকা হতো। অতঃপর যখন আমাকে ডাকা হলো, তখন তিনি আমাকে দু'অংশ প্রদান করেন। কেননা আমার পরিবার পরিজন ছিল। এরপর আম্মার ইবন ইয়াসিরকে ডাকা হয় এবং তাকে একটি অংশ দেওয়া হয়, (এ জন্য যে, তার পরিবার-পরিজন ছিল না।)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2954,
			"arabicnumber": 2954,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) ...... জাবির ইবন আবদুল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেন, আমি মুমিনদের জন্য তাদের নিজের সওার চাইতেও অধিক নিকটবর্তী। যে ব্যক্তি কোন মাল রেখে মারা যায়, তা তার পরিবার-পরিজনের। আর যে ব্যক্তি কোন দেনা ও সন্তান-সন্ততি রেখে মারা যাবে, তা আমার এবং আমি তাদের যিম্মাদার।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2955,
			"arabicnumber": 2955,
			"text": "হাফস ইবন উমার (রহঃ) ...... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি কোন ধন-সম্পদ রেখে মারা যাবে, তা হবে তার উওরাধিকারীদের। আর যে কেউ পরিবার-পরিজন ও সন্তান-সন্ততি রেখে মারা যাবে, তাদের সার্বিক দায়িত্ব আমার।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2956,
			"arabicnumber": 2956,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ..... জাবির ইবন আবদুল্লাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত যে, তিনি বলতেনঃ আমি প্রত্যেক মুমিনদের জন্য তার নিজের সত্তার চাইতেও অধিক নিকটবর্তী। তাই, যদি কেউ মারা যায় এবং সে দেনা রেখে যায়, তা পরিশোধ করার দায়িত্ব আমার। পক্ষান্তরে যে ব্যক্তি ধন-সম্পদ রেখে মারা যাবে, তবে তা তাঁর পরিবার-পরিজন বা ওয়ারিছদের জন্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2957,
			"arabicnumber": 2957,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ..... ইবন উমার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ উহুদের যুদ্ধের সময় তাঁকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির করা হয় এবং সে সময় তার বয়স ছিল চৌদ্দ বছর। তিনি তাঁকে অনুমতি দেন নি। এরপর পনের বছর বয়সে খন্দকের যুদ্ধের সময় যখন তাকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির করা হয়, তখন তিনি তাকে অনুমতি দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2958,
			"arabicnumber": 2958,
			"text": "আহমদ ইবন আবী হুয়ারী (রহঃ) ....... আবূ মুতয়ার (রাঃ) থেকে বর্ণিত। একবার তিনি হজ্জের উদ্দেশ্যে রওয়ানা হয়ে 'সুওয়ায়দা' নামক স্থানে পৌছে দেখতে পান যে, জনৈক ব্যক্তি ঔষধ অথবা তিক্ত-ওষুধ অন্বেষণ করছে। তখন সে ব্যক্তি বলেঃ আমাকে এমন এক ব্যক্তি খবর দিয়েছেন, যিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শ্রবণ করেছেন যে, তিনি বিদায় হজ্জের সময় লোকদের ওয়ায করছিলেন এবং তিনি তাদেরকে আদেশ ও নিষেধ সম্পর্কে বলতে গিয়ে বলেনঃ হে লোক সকল! তোমরা নেতার দান ততক্ষণ গ্রহণ করবে, যতক্ষণ তা দান থাকে, (অর্থাৎ শরীয়ত মত যতক্ষণ তা বণ্টিত হবে)। আর কুরাইশরা যখন নেতৃত্ব পাওয়ার আশায় পরস্পর যুদ্ধে লিপ্ত হবে এবং দান কর্জের আকারে পাওয়া যাবে, তখন তোমরা তা পরিত্যাগ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2959,
			"arabicnumber": 2959,
			"text": "হিশাম ইবন আম্মার (রহঃ) .... সুলায়ম ইবন মুতায়র (রহঃ), যিনি ''কুরা'' নামক উপত্যকার অধিবাসী, তিনি তাঁর পিতা হতে বর্ণনা করেছেন, তিনি বলেনঃ আমি জনৈক ব্যক্তিকে এরূপ বলতে শুনেছি যে, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বিদায় হজ্জের সময় বলতে শুনেছি, যখন তিনি লোকদের আদেশ ও নিষেধাবলী সম্পর্কে অবহিত করার এক পর্যায়ে বললেনঃ ইয়া আল্লাহ্‌! আমি কি আপনার পয়গাম পৌছে দিয়েছি? তখন তারা (সাহাবীরা) বলেনঃ হ্যাঁ, আপনি পৌছে দিয়েছেন। এরপর তিনি বলেনঃ যখন কুরাইশরা পরস্পর যুদ্ধ-বিগ্রহে লিপ্ত হবে এবং দান ঘুষের পর্যায়ে চলে আসবে, তখন তোমরা ঐ দান গ্রহণ করা হতে বিরত থাকবে। তখন জনৈক ব্যক্তি প্রশ্ন করেঃ ইনি কে? তারা বলেঃ ইনি হলেন যুয-যাওয়াইদ যিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জনৈক সাহাবী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2960,
			"arabicnumber": 2960,
			"text": "মূসা ইবন ইসমা'ঈল (রহঃ) ...... আবদুল্লাহ ইবন কা'ব ইবন মালিক আনসারী (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ একদল আনসার সৈন্য তাদের সিপাহসালারের নেতৃত্বে পারস্য দেশে মোতায়েন ছিল। উমার (রাঃ) প্রতি বছর একদল সেনাকে তাদের অবস্থান থেকে ফিরিয়ে আনতেন এবং অন্য একদল সেখানে পাঠাতেন। একবার উমার (রাঃ) তাদের ব্যাপারে (কর্ম-ব্যস্ততার দরুন) উদাসীন হয়ে পড়েন। ফলে নির্দিষ্ট সময় অতিক্রম হওয়ায় উক্ত সেনাবাহিনী তাঁর নির্দেশ ছাড়াই তাদের অবস্থান পরিত্যাগ করে চলে আসে। এতে তিনি (উমার) তাদের প্রতি রাগান্বিত হন এবং তাদের ভীতি প্রদর্শন করেন, অথচ তারা ছিলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাহাবী। তখন তারা বলেনঃ হে উমার! আপনি তো আমাদের ব্যাপারে উদাসীনতা দেখিয়েছেন এবং আপনি আমাদের ব্যাপারে ঐ নিয়ম পরিত্যাগ করেছেন, যা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটা বাহিনী প্রেরণ এবং অপরটি ফিরিয়ে আনার ব্যাপারে পালন করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2961,
			"arabicnumber": 2961,
			"text": "মাহমূদ ইবন খালিদ (রহঃ) ..... আদী কিনদী (রহঃ) থেকে বর্ণিত। একদা উমার ইবন আবদুল আযীয (রহঃ) এ মর্মে একটা লিখিত নির্দেশ জারী করেন যে, যে ব্যক্তি জানতে চায় যে, গনীমতের মাল কোথায় খরচ করতে হবে, সে যেন যেনে রাখে, (তা ঐ সব স্থানে ব্যয় করতে হবে), যে স্থানে উমার ইবন খাওাব (রাঃ) ব্যয় করতে হুকুম দিয়েছিলেন। কেননা মুসলিমরা তার নির্দেশকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর হুকুম অনুযায়ী ইনসাফের দৃষ্টিতে দেখেছেন। আল্লাহ তা'আলা হক বা সত্যকে উমার (রাঃ)-এর যবান ও হৃদয়ে প্রতিষ্ঠিত করে দিয়েছিলেন। বস্তুত তিনি দানের খাত নির্ধারত করেন, জিযিয়ার বিনিময়ে বিভিন্ন ধর্মাবলম্বীদের শান্তি ও নিরাপওার যিম্মাদারী গ্রহন করেন। এতে তিনি খুমুস (এক-পঞ্চমাংশ) নির্ধারিত করেন নি এবং একে গনীমতের মালের মধ্যেও শামিল করেন নি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2962,
			"arabicnumber": 2962,
			"text": "আহমদ ইবন ইুউনুস (রহঃ) ..... আবূ যার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, আল্লাহ্‌ তা'আলা উমার (রাঃ) এর যবানে সত্যকে প্রতিষ্ঠিত করেছেন, যা দিয়ে তিনি কথা বলে থাকেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2963,
			"arabicnumber": 2963,
			"text": "হাসান ইবন আলী ও মুহাম্মদ ইবন ইয়াহ্‌ইয়া ইবন ফারিয মা'না (রহঃ) .... মালিক ইবন হাদাসান (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা উমার (রাঃ) দিনের কিছু অংশ অতিবাহিত হওয়ার পর আমাকে ডেকে পাঠান। আমি তখন তাঁর কাছে উপস্থিত হই এবং তাকে চাদর শূন্য একটা বিছানার উপর উপবিষ্ট দেখতে পাই। যখন আমি তাঁর কাছে পৌছাই, তখন তিনি আমাকে বলেনঃ হে মালিক! তোমার সম্প্রদায়ের কিছু লোক আমার কাছে এসেছিল। আমি তাদের কিছু মাল দেওয়ার জন্য নির্দেশ দিয়েছি। এখন তুমি তা তাদের মাঝে বণ্টন করে দাও। আমি বললামঃ আমাকে বাদ দিয়ে যদি অন্য কাউকে একাজের নির্দেশ দিতেন, (তবে ভাল হতো)। তখন তিনি বললেনঃ তুমি-ই এ দায়িত্ব গ্রহণ কর। এ সময় ইয়ারফা (রাঃ) সেখানে হাযির হয়ে বলেনঃ হে আমীরুল মু'মিনীন! আপনার নিকট উপস্থিত হওয়ার জন্য উছমান ইবন আফফান (রাঃ), আবদুর রহমান ইবন আওফ (রাঃ), যুবায়র ইবন আওয়াম (রাঃ) এবং সা'দ ইবন আবী ওয়াককাস (রাঃ) অনুমতি চাচ্ছেন। তিনি বললেনঃ হ্যাঁ, তাদেরকে আমার কাছে আসতে দাও। তখন তাঁরা সেখানে প্রবেশ করে। পরে ইয়ারফা উপস্থিত হয়ে বলেনঃ হে আমীরুল মু'মিনীন! আপনার নিকট আব্বাস (রাঃ) ও আলী (রাঃ) আসার জন্য অনুমতি চাচ্ছেন। তখন তিনি [উমার (রাঃ)] বললেনঃ তাদের আসতে দাও। পরে এ দু'জনও তাঁর নিকট হাযির হন। আব্বাস (রাঃ) বলেনঃ হে আমীরুল মু'মিনীন! আপনি আমার ও এর মধ্যকার ব্যাপারটি ফয়সালা করে দিন। তখন উপস্থিত লোকদের থেকে জনৈক ব্যক্তি বলেনঃ হে আমীরুল মু'মিনীন! এদের ব্যাপারটি মীমাংসা করে দিন এবং এদের উপর রহম করুন।(১) মালিক ইবন আওস (রাঃ) বলেনঃ আমার ধারণা আব্বাস (রাঃ) এবং আলী (রাঃ) এ ব্যাপারের জন্য পূর্বোক্ত ব্যক্তিদের আগেই প্রেরণ করেন। তখন উমার (রাঃ) বলেনঃ ব্যস্ত হবেন না, ধৈর্য ধরুন, শান্ত হন। অতঃপর তিনি উছমান (রাঃ) ও অন্যদের সম্বোধন করে বলেনঃ আমি আপনাদের সেই আল্লাহর শপথ দিয়ে জিজ্ঞাসা করছি, যাঁর হুকুমে আসমান ও যমীন স্থির আছে। আপনারা কি জানেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমরা (নবীরা) কোন মীরাছ রেখে যাই না; বরং আমরা যা রেখে যাই, তা হলো সাদকা। তখন তাঁরা বলেনঃ হ্যাঁ। অতঃপর আলী (রাঃ) ও আব্বাস (রাঃ)-কে সম্বোধন করে বলেনঃ আমি আপনাদের উভয়কে সে আল্লাহ্‌র শপথ দিয়ে জিজ্ঞানা করছি, যাঁর হুকুমে আসমান ও যমীন কায়েম আছে, আপনারা কি অবগত আছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ বলেছেনঃ আমরা মীরাছ রেখে যাই না, বরং আমরা যা রেখে যাই, তা হলো সাদকা। তখন তারা উভয়ে বলেনঃ হ্যাঁ। তিনি [উমার (রাঃ)] বলেনঃ আল্লাহ তা'আল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এমন কিছু খাস বৈশিষ্ট প্রদান করেন, যা অন্য আর কাউকে দেননি। যেমন, আল্লাহ বলেছেনঃ وَمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلاَ رِكَابٍ وَلَكِنَّ اللَّهَ يُسَلِّطُ رُسُلَهُ عَلَى مَنْ يَشَاءُ وَاللَّهُ عَلَى كُلِّ شَىْءٍ قَدِيرٌ অর্থাৎ আর যা কিছু আল্লাহ তাঁর রাসূলকে দিয়েছেন, তাদের নিকট হতে, তা লাভের জন্য তোমরা ঘোড়া এবং উট পরিচালিত করনি; বরং আল্লাহ্‌ তাঁর রাসূলদের বিজয়ী করেন যার উপর তিনি ইচ্ছা করেন। আর আল্লাহ্‌ হলেন সব কিছুর উপর ক্ষমতাবান। বস্তুত আল্লাহ্‌ তাঁর রাসূলকে বনূ নযীর গোত্রের মাল প্রদান করেছিলেন। আল্লাহ্‌র শপখ! তিনি এই মালের উপর তোমাদের একচেটিয়া প্রাধান্য প্রদান করেননি এবং তোমাদের বাদ দিয়ে অন্য কেউ তা গ্রহণ করেনি। বরং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তো এই মাল হতে তাঁর ও তাঁর পরিবারবর্গের ভরণ-পোষণের নিমিত্ত এক বছরের খরচের পরিমাণ সম্পদ গ্রহণ করতেন এবং অবশিষ্ট মাল অন্যান্য গনীমতের মালের অনুরূপ হতো। অতঃপর তিনি [উমার (রাঃ)] তাঁদের সম্বোধন করে বলেনঃ আমি আপনাদের সেই আল্লাহ্‌র শপথ দিয়ে জিজ্ঞাসা করছি, যার হুকুমে আসমান ও যমীন কায়েম আছে, আপনারা কি এটা অবগত আছেন? তখন তাঁরা বলেনঃ হ্যাঁ। তখন তিনি আব্বাস (রাঃ) ও আলী (রাঃ) কে সম্বোধন করে বলেনঃ আমি আপনাদের উভয়কে সেই আল্লাহ্‌র শপথ দিয়ে জিজ্ঞাসা করছি, যার হুকুমে আসমান ও যমীন স্থির আছে, আপনারা কি এটা অবগত আছেন? তখন তাঁরা (দু'জনে) বলেনঃ হ্যাঁ। বস্তুত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ইন্তিকালের পর [আবূ বকর (রাঃ) যখন খলীফা নির্বাচিত হন], তখন আবূ বকর (রাঃ) বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর খলীফা। তখন আপনি (হে আব্বাস) এবং এ ব্যক্তি [আলী (রাঃ)] আবূ বকর (রাঃ)-এর নিকট উপস্থিত হয়েছিলেন। এ সময় আপনি আপনার ভাতিজার পরিত্যক্ত সস্পদের উত্তরাধিকারিত্বের দাবি করছিলেন এবং ইনি তাঁর স্ত্রীর সম্মানিত পিতা (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর মীরাছ দাবি করছিলেন। তখন তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমরা (নবীরা) মীরাছ রেখে যাই না; বরং আমরা যা ছেড়ে যাই, তা হলো সাদকা। আর আল্লাহ্‌ জানেন, আবূ বকর (রাঃ) ছিলেন সত্যবাদী, নেকবখত, সত্য পথের দিশারী এবং সত্যের অনুসারী। এরপর আবূ বকর (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সম্পদের তত্ত্বাবধায়ক ছিলেন। আবূ বকর (রাঃ)-এর ইনতিকালের পর, আমি খলীফা মনোনীত হওয়ার পর বলিঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পক্ষ হতে এ মালের তত্ত্বাবধায়ক। আর আমি মালের তত্ত্বাবধায়ক ততদিন থাকব, যতদিন আল্লাহ্‌ চান। এখন আপনারা দু'জন এসেছেন এবং আপনারা একই খেয়ালের অধিকারী। আপনারা আমার নিকট উক্ত মাল দাবী করছেন। আমার বক্তব্য এই যে, যদি আপনারা চান, তবে এ শর্তের উপর আমি এ মাল আপনাদের দেব যে, আপনারা আল্লাহ্‌র নামে শপথ করে বলবেন যে আপনারা এ মালের দেখাশুনা এরূপই করবেন, যেমনভাবে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম করতেন। আপনারা এ শর্তের উপর এ মাল আমার নিকট থেকে গ্রহণ করেছেন। আর এখন আপনারা উভয়ে আমার নিকট এ জন্য হাযির হয়েছেন যে, আমি যেন এর বিপরীত কোন ফয়সালা করি। আল্লাহ্‌র শপথ! আমি যে ফয়সালা দিয়েছি, তাছাড়া অন্য কোন ফয়সালা আমি কিয়ামত পর্যন্ত দেব না। অবশ্য আপনারা যদি এ সম্পদ যথাযথরূপে দেখাশুনা করতে অপারগ হন, তবে এর দেখাশুনার দায়িত্ব আবার আমার উপর ন্যস্ত করুন। আবূ দাউদ (রহঃ) বলেনঃ তাঁরা দু'জন তাঁর কাছে এ দরখাস্ত করেন যে, এর দেখাশুনার দায়িত্ব আমাদের মাঝে বণ্টন করে দেন। আর এরূপ নয় যে, তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর হাদীছঃ আমরা মীরাছ রেখে যাই না; বরং আমরা যা ছেড়ে যাই, তা হলো সাদাকা'', সম্পর্কে অবহিত ছিলেন না। বস্তুত তাঁরা উভয়ে তাদের প্রাপ্যের প্রত্যাশায় ছিলেন। তখন উমার (রাঃ) বলেনঃ আমি এ সম্পদের উপর বণ্টনের নাম আসতে দেব না, বরং আমি একে এর প্রথম অবস্থার উপর ছেড়ে দেব।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2964,
			"arabicnumber": 2964,
			"text": "মুহাম্মদ ইবন উবায়দ (রহঃ) ...... মালিক ইবন আওস (রাঃ) উপরোক্ত হাদীসে বর্ণিত ঘটনার প্রেক্ষিতে বলেনঃ তাঁরা উভয়ে অর্থাৎ আলী (রাঃ) ও আব্বাস (রাঃ) ঐ মালের ব্যাপারে পরস্পর ঝগড়ায় লিপ্ত হন, যা আল্লাহ্‌ তাঁর রাসূলকে বনূ নযীর গোত্রের ধন-সম্পদ হতে প্রদান করেছিলেন। আবূ দাঊদ (রহঃ) বলেনঃ উমার (রাঃ)-এর উদ্দেশ্য ছিল যে, তাতে যেন বণ্টনের নাম না আসে। কেননা বণ্টনযোগ্য তো ঐ সম্পদ, যাতে মালিকানা বর্তায়। আর এ মালে মালিকনা বর্তায়নি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2965,
			"arabicnumber": 2965,
			"text": "উছমান ইবন আবী শায়বা ও আহমদ ইবন আবদা (রাঃ) .... উমার (রাঃ) হতে বর্ণিত। তিনি বলেনঃ বনূ নযীর গোত্রের মালামাল ঐ ধন-সস্পদের অন্তর্ভুক্ত ছিল, যা আল্লাহ্‌ তাঁর রাসূলকে প্রদান করেছিলেন এবং ঐ সম্পদ হাসিলের জন্য মুসলিমরা তাদের ঘোড়া ও উট পরিচালিত করেন নি (অর্থাৎ বিনাযুদ্ধে ঐ মাল হস্তগত হয়েছিল)। বস্তুত ঐ সমস্ত মালামাল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্য খাস ছিল। তিনি ঐ সম্পদ নিজের পরিবার-পরিজনদের ভরণ-পোষণের জন্য ব্যয় করতেন। রাবী ইবন আবদা বলেনঃ তিনি ঐ মাল হতে তার পরিবার-পরিজনদের জন্য এক বছরের খরচ নির্বাহ করতেন এবং অবশিষ্ট মাল আল্লাহ্‌র রাস্তায় যুদ্ধের জন্য ঘোড়া, উট ইত্যাদি পশু ক্রয়ের জন্য ব্যয় করতেন। রাবী ইবন আবদা আরো বলেনঃ তিনি অবশিষ্ট মাল দিয়ে যুদ্ধের নিমিত্ত উট, ঘোড়া ইত্যাদি এবং যুদ্ধাস্ত্র ক্রয় করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2966,
			"arabicnumber": 2966,
			"text": "মুসাদ্দাদ (রাঃ) .... যুহরী (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ উমার (রাঃ) বলেছেন যে, আল্লাহ্‌র বানীঃ আর আল্লাহ্‌ যা কিছু তাঁর রাসূলকে প্রদান করেছেন, তাদের নিকট হতে তা লাভের জন্য তোমরা ঘোড়া এবং উট পরিচালিত করনি। যুহরী বলেন, উমার (রাঃ) বলেছেনঃ এই ধন-সম্পদ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য খাস ছিল, যা হলো-উরায়না নামক গ্রাম, ফিদাক ইত্যাদি। আর দ্বিতীয় আয়াত-যার অর্থ হলোঃ \"আল্লাহ তাঁর রাসূলকে গ্রামবাসীদের নিকট হতে যা কিছু প্রদান করেছেন, তা হলো-আল্লাহর, তাঁর রাসূলের, নিকটাত্মীয়দের, ইয়াতীমদের, মিসকীনদের এবং মুসাফিরদের জন্য। আর ঐ সমস্ত ফকীরের জন্য, যারা তাদের ঘরবাড়ী ও ধন-সস্পদ হতে বিতাড়িত হয়েছে এবং যারা তাদের পরে এসেছে (ইসলাম কবুলের পর, দারুল ইসলামে)।\" উক্ত আয়াতের বর্ণিত হুকুম সমস্ত শ্রেণীর লোকেরা শামিল আছে এবং মালে গনীমতের হকদার কোন মুসলিম বাদ পড়েনি। রাবী আইয়ূব অথবা যুহরী বলেনঃ এই গনীমতের মালে সকলের হক আছে, তবে তারা ব্যতীত, যে সব দাস-দাসীর তোমরা মালিক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2967,
			"arabicnumber": 2967,
			"text": "হিশাম ইবন আম্মার (রাঃ) ..... মালিক ইবন আওস ইবন হাদাছান (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ উমার (রাঃ)-এর দলীল হলো যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্য তিন প্রকারের মালে গনীমত খাস ছিল-যা বনু নযীর, খায়বর ও ফিদাক নামে পরিচিত। সুতরাং যে মাল তিনি বনূ নযীর থেকে প্রাপ্ত হন, তা তাঁর প্রয়োজনের জন্য খাস ছিল। আর তিনি ফিদাক হতে যা লাভ করেছিলেন, তা ছিল মুসলিমদের প্রয়োজন মিটাবার জন্য এবং খায়বরে প্রাপ্ত ধন-সম্পদ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তিন ভাগে বিভক্ত করতেন, যার দু'অংশ সাধারণ মুসলিমদের কল্যাণে ব্যয় হতো এবং অপর ভাগ তাঁর পরিবার-পরিজনদের ভরণ-পোষণের জন্য ব্যয় হতো। আর তাঁর পরিবার-পরিজনদের ব্যয় নির্বাহের পর যে মাল বাকী থাকত, তা তিনি গরীব মুহাজিরদের মাঝে বণ্টন করে দিতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2968,
			"arabicnumber": 2968,
			"text": "ইয়াযীদ ইবনে খালিদ ইবন আবদুল্লাহ ইবন মাওহাব হামদানী ..... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিনী আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কন্যা ফাতিমা (রাঃ) কোন এক ব্যক্তিকে আবূ বকর সিদ্দীক (রাঃ)-এর নিকট রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মাল হতে নিজের মীরাছ চাওয়ার জন্য প্রেরণ করেন। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আল্লাহ্‌ মদীনাতে ও ফিদাকে যা প্রদান করেছিলেন এবং খায়বরে প্রাপ্ত মালের এক-পঞ্চমাংশ বাদে বাকী যে অংশ রেখে গিয়েছেন তা থেকে প্রাপ্ত আমার অংশ যেন আবূ বাকর (রাঃ) আমাকে দিয়ে দেন। তখন আবূ বকর (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমরা (নবীরা) মীরাছ রাখি না; বরং আমরা যা রেখে যাই, তা হলো সাদকা। মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পরিবার-পরিজন এ মাল হতে খেতে পারবে। কিন্তু আল্লাহ্‌র শপথ! আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাদকা হতে কোন কিছুই পরিবর্তন করতে পারব না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগে যেরূপ ছিল, সেরুপই থাকবে। এ ব্যাপারে আমি শুধু এতটুকু করতে পারি, যা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম করতেন। এভাবে আবূ বকর (রাঃ) ঐ মাল হতে ফাতিমা (রাঃ)-কে কোন কিছু দিতে অস্বীকার করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2969,
			"arabicnumber": 2969,
			"text": "আমর ইবন উছমান হিমসী (রাঃ) .... নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিনী আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ যখন ফাতিমা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মদীনা ও ফিদাকের সাদকা এবং খায়বরের সম্পওির এক-পঞ্চমাংশের পর বাকী অংশ দাবী করেন, আইশা (রাঃ) বলেনঃ তখন আবূ বকর (রাঃ) বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমরা (নবীরা) মীরাছ রেখে যাই না; বরং আমরা যা রেখে যাই, তা হলো সাদকা। অবশ্য মুহাম্মদ এর পরিবারবর্গ এ মাল হতে ভক্ষণ করতে পারবে, অর্থাৎ আল্লাহ্‌র মাল হিসাবে। আর তারা খাদ্যদ্রব্য ছাড়া কিছুই পাবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2970,
			"arabicnumber": 2970,
			"text": "হাজ্জাজ ইবন আবী ইয়াকূব (রহঃ) ..... উরওয়া (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আইশা (রাঃ) এ হাদীস বর্ণনা প্রসঙ্গে বলেছেন যে, যখন ফাতিমা (রাঃ) তাঁর মীরাছ দাবী করেন, তখন আবূ বকর (রাঃ) তাঁকে মীরাছ দিতে অস্বীকার করেন এবং বলেনঃ যে কাজ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম করতেন, আমি কখনো তা পরিত্যাগ করব না। কেননা আমার ভয় হয়, যদি আমি তার কিছু পরিত্যাগ করি, তবে হয়তো গুমরাহ হয়ে যাব। (আবূ বাকর (রাঃ)-এর ইন্তিকালের পর) উমার (রাঃ) তাঁর মদীনার সাদকার মাল আব্বাস (রাঃ) এবং আলী (রাঃ)-এর নিকট সোপর্দ করেন, যার উপর আলী (রাঃ) দখল নিয়েছিলেন। আর ফিদাক ও খায়বরের মাল উমার (রাঃ) নিজের কতৃত্বে রেখে দেন এবং বলেনঃ এ দু'প্রকারের মালামাল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাদকা, যা তাঁর বিভিন্ন প্রয়োজনে খরচ হতো। একই ভাবে এ দু'প্রকারের মাল খরচ করার ইখতিয়ার তাঁকে দেওয়া হয়, যিনি রাষ্ট্রের কর্ণধার হবেন। বস্তুত এ সময় হতে খিলাফতের শেষ সময় পর্যন্ত ফিদাক ও খায়বরের মাল এভাবে খরচ হতে থাকে, যেভাবে তিনি তা খরচের জন্য নির্দেশ দিয়েছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2971,
			"arabicnumber": 2971,
			"text": "মুহাম্মদ ইবন উবায়দ (রহঃ) ....... যুহরী (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আল্লাহ্‌র বাণীঃ তোমরা যারা তার জন্য ঘোড়া এবং উট পরিচালিত করনি; (বরং আল্লাহ্‌ স্বীয় অনুগ্রহে তা তাঁকে প্রদান করেন)। এ আয়াত সম্পর্কে রাবী বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফিদাক এবং গ্রামবাসীদের সাথে তখন সন্ধি করেন, যখন তিনি অপর একটা সম্প্রদায়কে অবরোধ করেছিলেন। তখন সেখানকার লোকেরা সন্ধির উদ্দেশ্যে তাঁর কাছে প্রস্তাব পেশ করে। এ ঘটনা সম্পর্কে আল্লাহ্‌ বলেনঃ তোমরা ঐ মাল হাসিল করার জন্য ঘোড়া এবং উট পরিচালিত করনি; বরং বিনাযুদ্ধে তোমরা তা লাভ করেছিলে। যুহরী (রহঃ) বলেনঃ বনূ নযীর গোত্র থেকে প্রাপ্ত মাল নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য খাস ছিল। কেননা তা যুদ্ধের দ্বারা হাসিল হয়নি; বরং সন্ধির দ্বারা হয়েছিল। বস্তুত নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঐ সম্পদ মুহাজিরদের মাঝে বণ্টন করে দেন এবং আনসারদের অভাবী দু'ব্যক্তি ছাড়া তিনি আর কাউকে কিছুই প্রদান করেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2972,
			"arabicnumber": 2972,
			"text": "আবদুল্লাহ ইবন জাররাহ (রহঃ) ..... মুগীরা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ উমার ইবন আবদুল আযীয খলীফা নির্বাচিত হওয়ার পর বনূ মারোয়ানকে সমবেত করে বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ফিদাকের আয় হতে পরিবার-পরিজন ও ফকীর-মিসকীনদের ব্যয় নির্বাহ করতেন, বনূ হাশিম গোত্রের ছোট বাচ্চাদের প্রতি ইহসান করতেন, বিধবা এবং অবিবাহিত নারীদের জন্য খরচ করতেন। একবার ফাতিমা (রাঃ) তাঁর নিকট ফিদাকের সস্পদপ্রাপ্তির জন্য আবেদন করলে তিনি তা দিতে অস্বীকার করেন। বস্তুত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জীবদ্দশায় ঐ সম্পদ ঐরূপেই অবশিষ্ট ছিল। এমনকি তাঁর ইন্তিকালের সময় পর্যন্ত এ পদ্ধতি চালু ছিল। অতঃপর আবূ বকর (রাঃ) খলীফা নির্বাচিত হওয়ার পর ফিদাকের ধন-সম্পত্তির ব্যাপারে ঐ নিয়ম চালু রাখেন, যা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যামানায় চালু ছিল। এরপর উমার (রাঃ) যখন এর মুতাওয়াল্লী নির্বাচিত হন, তখন তিনিও ঐ মালের ব্যাপারে একই নীতি অবলম্বন করেন, যা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও আবূ বকর (রাঃ) গ্রহণ করেছিলেন। এমনকি উমার ইবন খাত্তাব (রাঃ) এর মৃত্যু সময়ও ঐ নীতি চালু ছিল। পরে মারোয়ান একে নিজের জায়গীর বানিয়ে নেন। অবশেষে তা উমার ইবন আবদুল আযীয (রহঃ)-এর নিয়ন্ত্রণে আসে। তখন তিনি এ খেয়াল করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন এ মাল ফাতিমা (রাঃ) কে প্রদান করেননি, তখন আমার জন্যও তা ভোগ করা উচিত হবে না। সে জন্য আমি তোমাদের সাক্ষী রেখে বলছিঃ আমি ঐ সম্পদ তার মূল অবস্থায় ফিরিয়ে দিচ্ছি, যেমন তা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যামানায় ছিল। (আর আগে যেভাবে যাদের প্রয়োজনে তা ব্যবহৃত হতো, তেমনি পরেও তা ঐভাবেই ব্যবহৃত হবে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2973,
			"arabicnumber": 2973,
			"text": "উছমান ইবন আবী শায়বা (রহঃ) .... আবূ তুফায়ল (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা ফাতিমা (রাঃ) আবূ বকর (রাঃ) এর নিকট উপস্থিত হয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পরিত্যক্ত সম্পত্তিতে নিজের হিসসা দাবী করেন। তখন আবূ বকর (রাঃ) বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এরূপ বলতে শুনেছি যে, যখন আল্লাহ্‌ তাঁর কোন নবীকে কোন জীবিকা প্রদান করেন, তা তাঁর পরবর্তী স্থলাভিষিক্ত ব্যক্তির অধিকারে চলে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2974,
			"arabicnumber": 2974,
			"text": "আবদুল্লাহ্‌ ইবন মাসলামা (রহঃ) ...... আবূ হুরায়রা (রাঃ) সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেনঃ আমার ওয়ারিছরা আমার পরিত্যক্ত সম্পদ হতে এক দীনারও বন্টন করতে পারবে না। আমি যা কিছু রেখে যাব, তা আমার স্ত্রীদের ভরণ-পোষণের ব্যয় নির্বাহ এবং আমার কর্মচারীর পারিশ্রমিক প্রদানের পর সাদকা হিসাবে পরিগণিত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2975,
			"arabicnumber": 2975,
			"text": "আমর ইবন মারযূক (রহঃ) ....... আবূ বুখতারী (রাঃ) হতে বর্ণিত। তিনি বলেনঃ আমি জনৈক ব্যক্তি হতে এমন একটি হাদীছ শুনেছিলাম, যা আমার খুবই পসন্দ হয়। তখন আমি তাকে বলিঃ হাদীসটি আমাকে লিখে দিন। তিনি তা স্পষ্টভাবে লিখে আনেন এবং আব্বাস (রাঃ), আলী (রাঃ) এবং উমার (রাঃ)-এর কাছে আনেন। এ সময় তালহা (রাঃ), যুবায়র (রাঃ), আবদুর রাহমান (রাঃ) এবং সা'দ (রাঃ) তাঁর কাছে উপস্থিত ছিলেন। সেখানে আব্বাস (রাঃ) এবং আলী (রাঃ) পরস্পর ঝগড়ায় লিপ্ত হলে উমার (রাঃ) তালহা, যুবায়র, আবদুর রাহমান এবং সা'দ (রাঃ)-কে বলেনঃ আপনারা কি জানেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নবীদের যাবতীয় সম্পদ তাঁর পরিবার-পরিজনদের ভরণ-পোষণের খরচ বাদে বাকী সবই সাদকা। আমরা কোন মীরাছ রেখে যাই না। তখন তাঁরা বলেনঃ হ্যাঁ, ঠিক। তখন উমার (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বীয় মাল হতে নিজের পরিবারদের জন্য খরচ করার পর বাকী অংশ সাদকা করে দিতেন। পরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ইন্তিকালের পর আবূ বকর (রাঃ) দু'বছরের জন্য এর মুতাওয়াল্লী হন। আর তিনি ঐ নীতিই অনুসরণ করেন, যা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম করেছিলেন। এরপর রাবী মালিক ইবন আওস (রাঃ)-এর হাদীছের কিছু অংশ বর্ণনা করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2976,
			"arabicnumber": 2976,
			"text": "কা'নবী (রহঃ) ...... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইনতিকাল করেন, তখন তার স্ত্রীগণ উছমান (রাঃ) কে আবূ বাকর সিদ্দীকের নিকট এ জন্য প্রেরণ করেন যে, যাতে তাঁর নিকট তাঁর স্ত্রীদের 'ছুমুন' বা এক-অষ্টমাংশ মীরাছ দাবী করেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মাল হতে। তখন আইশা (রাঃ) তাঁদের ডেকে বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি এরূপ বর্ণনা করেন নি যে, আমরা মীরাছ রেখে যাই না, বরং আমরা যা রেখে যাই, তা হলো সাদকা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2977,
			"arabicnumber": 2977,
			"text": "মুহাম্মদ ইবন ইয়াহ্‌ইয়া ইবন ফারিস (রহঃ) ..... ইবন শিহাব (রহঃ) উপরোক্ত হাদীছের ন্যায় হাদীছ বর্ণনা প্রসঙ্গে বলেন যে, একদা আইশা (রাঃ) বলেনঃ তোমরা কি আল্লাহ্‌কে ভয় করবে না? তোমরা কি শোননি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ আমরা মীরাছ রেখে যাই না, বরং আমরা যা রেখে যাই, তা হলো সাদকা। আর এ ধন-সস্পদ তো কেবল মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পরিবার পরিজনদের ভরণ-পোষণের জন্য এবং তাঁর নিজস্ব প্রয়োজন ও মেহমানদের মাঝে বিতরণের জন্য। আমার ইন্তিকালের পর এ ধন-সম্পদ তাঁর তত্ত্বাবধানে থাকবে, যিনি খলীফা মনোনীত হবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2978,
			"arabicnumber": 2978,
			"text": "উবায়দুল্লাহ ইবন আমর ইবন মায়সারা (রহঃ) ..... জুবায়র ইবন মুত'ইম (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি এবং উছমান (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট খুমুসের ব্যাপারে আলোচনার জন্য যাই, যা তিনি বনূ হাশিম ও বনূ মুত্তালিবের মাঝে বণ্টন করেন। এ সময় আমি জিজ্ঞেস করিঃ ইয়া রাসূলাল্লাহ! আপনি তো আমাদের ভাই বনূ মুত্তালিবকে অংশ দিলেন, কিন্তু আমাদের তো কিছু দিলেন না? অথচ আমাদের ও তাদের সস্পর্ক আপনার সঙ্গে একই ধরনের! তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ বনূ হাশিম ও বনূ মুত্তালিব তো একই। রাবী জুবায়র (রাঃ) বলেনঃ তিনি বনূ আবদুশ শামস ও বনূ নওফলকে এ খুমুস হতে অংশ প্রদান করেননি, যেমন বনূ হাশিম ও বনূ মুত্তালিবকে অংশ প্রদান করেছিলেন। আর আবূ বকর (রাঃ)-ও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ন্যায় খুমুসের অংশ বন্টন করতেন। কিন্তু তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর আত্নীয়দের অংশ প্রদান করতেন না, যেমন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজে তাদের অংশ দিতেন। রাবী বলেনঃ উমার ইবন খাত্তাব (রাঃ) তাদের খুমুস থেকে অংশ দিতেন এবং তারপর উছমান (রাঃ)-ও এরূপ করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2979,
			"arabicnumber": 2979,
			"text": "উবায়দুল্লাহ ইবন উমার (রহঃ) ..... জুবায়র ইবন মুত'ইম (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনূ আবদুশ শামস ও বনূ নওফলকে খুমুস হতে কোন অংশ দেন নি, যেমন তিনি বনূ হাশিম ও বনূ মুত্তালিবকে দিয়েছিলেন। আর আবূ বাকর (রাঃ)-ও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বণ্টন নীতির ন্যায় (খুমুস) বন্টন করতেন। তবে তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট-আত্মীয়দের কোন অংশ দিতেন না, যেমন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বয়ং তাদের দিতেন। অবশ্য উমার (রাঃ) এবং তাঁর পরবর্তী খলীফারা সকলেই তাদের অংশ প্রদান করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2980,
			"arabicnumber": 2980,
			"text": "মুসাদ্দাদ (রহঃ) .... জুবাইর ইবন মুত'ইম (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ খায়বর যুদ্ধের পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর নিকটাত্মীয়ের অংশ বনূ হাশিম ও বনূ মুত্তালিবের মাঝে বন্টন করে দেন এবং বনূ আবদুশ শামস ও বনূ নওফলকে পরিত্যাগ করেন। এ সময় আমি (রাবী) এবং উছমান ইবন আফফান (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হই এবং বলিঃ ইয়া রাসূলাল্লাহ! এই তো বনূ হাশিম, আমরা এদের ফযীলত অস্বীকার করতে পারি না। কেননা আল্লাহ আপনাকে এ বংশে পয়দা করেছেন। কিন্তু আমাদের ভাই বনূ মুত্তালিবের অবস্থা কী যে, আপনি তাদের অংশ দিলেন অথচ আমাদের দিলেন না? তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি এবং বনূ মুত্তালিব জাহিলিয়াতের যুগে এবং ইসলামের যুগে বিছিন্ন হই নি। বরং আমরা এবং তারা একই। অতঃপর তিনি তার এক হাতের আংগুল অন্য হাতের আংগুলে প্রবেশ করিয়ে দিয়ে বললেনঃ আমরা এবং তারা তো এভাবে অঙ্গাঙ্গিভাবে জড়িত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2981,
			"arabicnumber": 2981,
			"text": "হুসায়ন ইবন আলী আজালী (রহঃ) ..... হাসান ইবন সালিহ সুদ্দী সূত্রে বর্ণিত। তিনি বলেনঃ (কুরআনে বর্ণিত) নিকটাত্মীয় হলো বনূ আবদুল মুওালিব।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2982,
			"arabicnumber": 2982,
			"text": "আহমদ ইবন সালিহ (রহঃ) .... ইয়াযীদ ইবন হুরমুয (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নাজদা-হারুরী ইবন জুবায়রের ফিতনার (শাহাদাতের) বছর হজ্জ শেষে এক ব্যক্তিকে ইবন আব্বাস (রাঃ)-এর কাছে নিকটাত্মীয়দের প্রাপ্য অংশের ব্যাপারে জিজ্ঞাসা করার জন্য প্রেরণ করেন যে, এদের ব্যাপারে তাঁর অভিমত কী? তিনি বলেনঃ যাবিল-কুরবা বা নিকটাত্মীয়ের অর্থ হলো, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর আপন জনেরা, যাদের রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বয়ং অংশ প্রদান করেছিলেন। আর উমার (রাঃ) আমাদেরকে তা হতে অংশ প্রদান করেছিলেন। কিন্তু আমরা তাকে আমাদের প্রাপ্য অংশ হতে কম মনে করে ফিরিয়ে দেই এবং আমরা তা গ্রহণে অসম্মতি প্রকাশ করি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2983,
			"arabicnumber": 2983,
			"text": "আব্বাস ইবন আবদুল আযীম (রহঃ) ..... আবদুর রাহমান ইবন আবূ লায়লা (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি আলী (রাঃ)-কে এরূপ বলতে শুনেছি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে 'খুমুস'-এর 'খুমুস' অংশে মুতাওয়ালী বানান, যা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জীবদ্দশায় তাঁর খাস ব্যক্তিদের জন্য ব্যয় করতেন। আর এ ভাবেই আমি সে মাল আবূ বকর (রাঃ) এবং উমার (রাঃ)-এর খিলাফত আমল পর্যন্ত খরচ করতে থাকি। এরপর উমার (রাঃ)-এর শাসনামলে তাঁর নিকট কিছু মাল আসে, তখন তিনি আমাকে বলেনঃ তুমি এই মাল গ্রহণ কর। আমি বলিঃ আমি এটা গ্রহণ করতে চাই না। তখন তিনি পুনরায় বলেনঃ তুমি এটা গ্রহণ কর। কেননা, তুমিই এর যোগ্য পাত্র। তখন আমি বলিঃ এতে আমার কোন প্রয়োজন নেই। অবশেষে উমার (রাঃ) সে মাল বায়তুল মালে জমা দিয়ে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2984,
			"arabicnumber": 2984,
			"text": "উসমান ইবন আবী শায়বা (রহঃ) ..... আলী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি, আব্বাস (রাঃ), ফাতিমা এবং যায়দ ইবন হারিছা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত ছিলাম। তখন আমি বলিঃ ইয়া রাসূলাল্লাহ! যদি আপনি ভাল মনে করেন, তবে আল্লাহ্‌র কিতাবের নির্দেশ অনুযায়ী 'খুমুস' হতে আমাদের প্রাপ্য অংশটি আমার ইখতিয়ারে দিয়ে দিন, যাতে আমি তা আপনার জীবদ্দশায় বণ্টন করে দিতে পারি এবং আপনার ইন্তিকালের পর আমাদের কেউ যেন আমার সঙ্গে ঝগড়া করতে না পারে। আলী (রাঃ) বলেনঃ তখন তিনি এরূপ করেন। অতঃপর আলী (রাঃ) বলেনঃ তখন আমি তা (খুমুস) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জীবদ্দশায় বণ্টন করে দেই। এরপর আবূ বকর (রাঃ)-ও আমাকে ইখতিয়ার প্রদান করেন। অবশেষে উমার (রাঃ)-এর খিলাফতের শেষ বর্ষ যখন আসে, তখন তাঁর নিকট অনেক ধন-সম্পদ আসে। তিনি আমাদের হক আলাদা করে রাখেন এবং আমাকে ডেকে নেন। তখন আমি বলিঃ এ বছরে আমাদের ধন-সম্পদের কোন প্রয়োজন নেই, আর সাধারণ মুসলিমদের প্রয়োজন আছে কাজেই আপনি এটা তাদের দিয়ে দিন। তখন উমার (রাঃ) সে সম্পদ মুসলিমদের মাঝে বণ্টন করে দেন। উমার (রাঃ)-এর পরে কেউ আমাকে এ মাল গ্রহণের জন্য আহবান করেনি। আমি উমার (রাঃ)-এর নিকট হতে ফিরে এসে আব্বাস (রাঃ)-এর সংগে সাক্ষাত করি। তখন তিনি বলেনঃ হে আলী! তুমি তো আগামীকাল হতে আমাদের বঞ্চিত করে দিলে। এখন আমরা আর কিছুই পাব না। আর আব্বাস (রাঃ) ছিলেন খুবই জ্ঞানী লোক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2985,
			"arabicnumber": 2985,
			"text": "আহমদ ইবন সালিহ (রহঃ) ..... আবদুল মুত্তালিব ইবন রাবী'আ ইবন হারিছ ইবন আবদিল মুত্তালিব (রহঃ) হতে বর্ণিত। তিনি বলেনঃ তাঁর পিতা রাবী'আ ইবন হারিছ এবং আব্বাস ইবন আবদিল মুত্তালিব, আবদুল মুত্তালিব ইবন রাবী'আ এবং ফযল ইবন আব্বাস (রাঃ)-কে বলেন যে, তোমরা উভয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হয়ে বলঃ ইয়া রাসূলাল্লাহ! আমাদের বয়স হয়েছে, সে সম্পর্কে তো আপনি অবহিত। আমরা বিবাহ করতে ইচ্ছুক। আর হে আল্লাহ্‌র রাসূল! আপনি তো সকলের চাইতে অধিক নেককার ও পরোপকারী। আমাদের পিতার কাছে আমাদের বিবাহের দেনমোহর পরিশোধের মত অর্থ নেই। তাই আপনি আমাদের সাদকা আদায়ের অফিসার হিসাবে নিয়োগ করুন। অন্য অফিসাররা যা দিয়ে থাকে, আমরাও আপনাকে তা দেব এবং তার মুনাফা আমরা গ্রহণ করব। রাবী বলেনঃ এ সময় আলী (রাঃ) সেখানে আসেন। আমরা যখন এ অবস্থায় ছিলাম, তখন আলী (রাঃ) আমাদেরকে বলেনঃ আল্লাহ্‌র শপথ করে বলি যে, নিশ্চয়ই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাদের কাউকেও সাদকা আদায়ের অফিসার নিয়োগ করবেন না। তখন রাবী'আ বলেনঃ এতো আপনি নিজের পক্ষ থেকে বলছেন। আপনি তো রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জামাতা হয়েছেন, এতে আমরা আপনার প্রতি ঈর্ষান্বিত নই। তখন আলী (রাঃ) তাঁর চাদর বিছিয়ে সেখানে শুয়ে পড়েন এবং বলেনঃ আমি আবুল হাসান, সকলের চাইতে জ্ঞানী। আল্লাহ্‌র শপথ! আমি এ স্থান পরিত্যাগ করব না যতক্ষণ না তোমাদের সন্তানেরা ঐ কাজ হতে বঞ্চিত হয়ে ফিরে আসে, যার জন্য তোমরা তাদের নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট প্রেরণ করেছ। আবদুল মুত্তালিব (রাঃ) বলেনঃ আমি এবং ফযল ইবন আব্বাস (রাঃ) যখন তাঁর নিকটে পৌছাই, তখন যুহরের সালাতের তাকবীর শুরু হয়ে যায়। তখন আমরা লোকদের সাথে (জামাআতে) সালাত আদায় করি। অতঃপর আমি এবং ফযল দ্রুত নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর হুজরার দিকে ধাবমান হই। এদিন তিনি যয়নব বিনত জাহশ (রাঃ)-এর ঘরে অবস্থান করছিলেন। আমরা দরওয়াযার নিকট দাঁড়ালে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাইরে এসে (স্নেহবশত) আমার ও ফযলের কান ধরে বললেনঃ বল তোমরা কি বলতে চাচ্ছ। অতঃপর তিনি হুজরার মাঝে ফিরে যান এবং আমাকে ও ফযলকে ভিতরে ঢোকার অনুমতি দেন। তখন আমরা ভিতরে প্রবেশ করি এবং একে অন্যকে কথা শুরু করার জন্য বলতে থাকি। অবশেষে আমি কথা শুরু করি অথবা ফযল শুরু করে। রাবী আবদুলাহ (রাঃ) এ ব্যাপারে সন্দেহ প্রকাশ করেছেন। আবদুল মুত্তালিব ইবন রাবী'আ বলেনঃ তখন ফযল ঐ কথা পেশ করেন, যা বলার জন্য আমাদের পিতা আমাদের নির্দেশ দিয়েছিলেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুপ থাকেন এবং তাঁর দৃষ্টি ছাদের প্রতি নিবদ্ধ করেন। এভাবে অনেক সময় অতিবাহিত হওয়ায় আমরা মনে করি যে, তিনি এখন কোন জওয়াব দিবেন না। এ সময় আমরা লক্ষ্য করি যে, যয়নব পর্দার পিছন হতে হাতের ইশারায় আমাদের বলছেন যে, আমরা যেন ব্যস্ত না হই। কেননা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের ব্যাপারে চিন্তা করছিলেন। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাথা নীচু করে আমাদের বললেনঃ এ সাদকা তো মানুষের ময়লা-আবর্জনা (অর্থাৎ মালের ময়লা), যা মুহাম্মদ এবং তাঁর পরিবার-পরিজনদের জন্য হালাল নয়। তোমরা নওফল ইবন হারিছকে আমার কাছে ডেকে আন। তখন তাঁকে তাঁর নিকট ডেকে আনা হয়। তিনি তাকে বলেনঃ হে নওফল! তুমি আবদুল মুত্তালিবকে তোমার মেয়ের সাথে বিয়ে দাও। তখন নওফল তার মেয়েকে আমার সাথে বিবাহ দেন। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা মুহমিয়্যা ইবন জাযাকে আমার কাছে ডেকে আন, যিনি ছিলেন যুবায়দ গোত্রের লোক। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে মালে-গনীমতের খুমুস (এক-পঞ্চমাংশ) আদায়ের জন্য নিয়োগ করেন। (মুহমিয়্যা আসলে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বললেনঃ তুমি তোমার (মেয়ের সাথে) ফযলের বিয়ে দাও। তখন তিনি বিবাহ দিয়ে দেন। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি দাঁড়াও এবং খুমুস হতে এ পরিমাণ, এ পরিমাণ সস্পদ মোহর বাবদ দিয়ে দাও। (রাবী বলেন) আবদুল্লাহ্‌ ইবন হারিছ (রাঃ) আমার নিকট মোহরের পরিমাণ উল্লেখ করেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2986,
			"arabicnumber": 2986,
			"text": "আহমদ ইবন সালিহ (রহঃ) .... আলী ইবন আবী তালিব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ বদর যুদ্ধের গনীমতের মাল হতে আমার ভাগে একটা মোটাতাজা উষ্ট্রী পড়ে। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুমুস হতেও আমাকে একটি হৃষ্টপুষ্ট উষ্ট্রী প্রদান করেন। অতঃপর আমি যখন ফাতিমা (রাঃ) এর সংগে বাসর যাপনের ইচ্ছা করি, তখন আমি একজন কর্মকারের সাথে, যিনি বনূ কায়নুকার অন্তর্ভুক্ত ছিলেন, এ ওয়াদা করি যে, সে আমার সাথে যাবে এবং আমি তার কাছে আয্‌খার (এক ধরনের সুগন্ধযুক্ত ঘাস) বিক্রয় করব, যাতে আমি আমার নব-পরিণীতা স্ত্রীর ওয়ালীমার ব্যবস্থা করতে পারি। বস্তুত এ উদ্দেশ্যে যখন আমি আমার উটের জন্য পালান, ঘাস ও রশির যোগাড়ে ব্যস্ত ছিলাম, তখন আমার উষ্ট্রী দুটি এক আনসার সাহাবীর হুজরার পাশে বসা ছিল। এরপর এদের জন্য যা প্রয়োজন ছিল, তা সংগ্রহ করে যখন আমি ফিরে আসি, তখন দেখি যে, তাদের কুঁজ কেটে ফেলা হয়েছে, কোমর ফেড়ে ফেলা হয়েছে এবং কলিজা বের করা হয়েছে। এ অবস্থা দেখে আমি আমার অশ্রু সম্বরণ করতে অক্ষম হই। তখন আমি জিজ্ঞাসা করিঃ এ কাজ কে করলো? তখন লোকেরা বললোঃ হামযা ইবন আবদিল মুত্তালিব এ কাজ করেছে। যিনি কয়েকজন আনসার সাহাবীর সঙ্গে এ ঘরে আছেন, যারা শরাব পান করেছেন এবং জনৈকা গায়িকা তাঁর ও তাঁর সাথীদের সামনে এরূপ গান গাইছেঃ ''হে হামযা! উঠ, এবং যে মোটাতাজা উষ্ট্রী উঠানে বাধা আছে, ওর হলকুমে ছুরি চালিয়ে ওকে হত্যা করে ফেল এবং ওর পবিত্র অংশ (অর্থাৎ কুঁজ ও কলিজা) ডেগে পাকিয়ে বা ভুনা করে শরাব পানকারীদের জন্য জলদি তৈরী করে দাও।” হামযা এ গান শুনে তখনই তরবারি দিয়ে ওদের কুঁজ কেটেছে এবং ওদের পেট ফেড়ে ওদের কলিজা বের করে ফেলেছে। আলী (রাঃ) বলেনঃ এ খবর জেনে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হই। তখন যায়দ ইবন হারিছা (রাঃ) সেখানে উপস্থিত ছিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার চেহারা দেখে আমার অবস্থা বুঝতে পারেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসা করেনঃ তোমার কি হয়েছে? তিনি বলেন, আমি বললামঃ ইয়া রাসূলাল্লাহ! আজকের মত কোন অবস্থা আমার জীবনে আর আসেনি। হামযা আমার উষ্ট্রীর উপর এরূপ অত্যাচার করেছে যে, ওদের কুঁজ ফেড়ে ফেলেছে এবং পেট কেটে ফেলেছে। আর সে শরাবীদের সাথে এ ঘরে উপস্থিত আছে। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর চাদর চান এবং তা গায়ে চড়িয়ে রওয়ানা হন। আমি এবং যায়দ ইবন হারিছা তাঁর অনুসরণ করতে থাকি। অবশেষে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেই ঘরের কাছে পৌঁছান, যেখানে হামযা (রাঃ) ছিলেন। তিনি সেখানে প্রবেশের জন্য অনুমতি চাইলে তাঁকে অনুমতি দেওয়া হয়। তিনি ভিতরে ঢুকে দেখতে পান যে, সবাই শরাব পান করে মাতাল অবস্থায় আছে। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হামযাকে এ কাজের জন্য ভর্ৎসনা করতে থাকেন। তিনি দেখতে পান যে, সে নেশায় বুঁদ হয়ে আছে এবং তার দুটি চোখ নেশাগ্রস্ত হওয়ার কারণে লাল হয়ে গেছে। হামযা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর দিকে চেয়ে দেখেন, তারপর চোখ উঠিয়ে তাঁর নাভির প্রতি দৃষ্টিপাত করেন। সবশেষে চোখ উঠিয়ে তাঁর চেহারার প্রতি তাকান এবং বলেনঃ তোমরা তো আমার বাবার গোলাম মাত্র। এ অবস্থা দেখে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অনুধাবন করতে পারেন যে, হামযা নেশায় বুঁদ হয়ে আছে। সুতরাং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখান হতে পেছনে ফিরে আসেন এবং আমরাও তাঁর সংগে বেরিয়ে আসি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2987,
			"arabicnumber": 2987,
			"text": "আহমদ ইবন সালিহ (রহঃ) ..... ফযল ইবন হাসান যামরী (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ যুবায়র ইবন আবদিল মুত্তালিবের দুই কন্যা উম্মু হাকাম অথবা যুবা'আ হতে একজন এ বর্ণনা করেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে কিছু যুদ্ধবন্দী আসে। তখন আমি, আমার বোন এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কন্যা ফাতিমা (রাঃ) তাঁর নিকট উপস্থিত হয়ে আমাদের দরিদ্রতার অভিযোগ করি, যাতে আমরা ছিলাম। আর আমরা তাঁর নিকট এ দরখাস্ত করি যে, তিনি যেন আমাদের কিছু বাঁদী (দাস-দাসী) প্রদান করেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের চাইতে ঐ সব ইয়াতীম মেয়েরা অধিক হকদার, যাদের পিতা বদর যুদ্ধে শহীদ হয়েছে। তবে আমি তোমাদের এর চাইতে উত্তম জিনিস বলে দিচ্ছি, যা তোমাদের জন্য কল্যাণকর হবে। তোমরা প্রত্যেক সালাতের পর ৩৩ বার আল্লাহু আকবার, ৩৩ বার সুবহানাল্লাহ এবং ৩৩ বার আল-হামদু লিল্লাহ পাঠ করবে এবং একবার পড়বেঃ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ অর্থাৎ আল্লাহ ছাড়া আর কোন ইলাহ নেই, তিনি একক, অদ্বিতীয়। তারই রাজত্ব বিশ্বব্যাপী, সব প্রশংসা তারই এবং তিনি সব কিছুর উপর ক্ষমতাবান। রাবী আয়্যাশ (রহঃ) বলেনঃ উম্মু হাকাম ও যুবা'আ উভয়েই ছিলেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর চাচাতো বোন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2988,
			"arabicnumber": 2988,
			"text": "ইয়াহইয়া ইবন খালাফ (রহঃ) .... ইবন আ'বূদ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আলী (রাঃ) আমাকে বলেন যে, আমি কি তোমাকে আমার ও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর প্রিয়পাত্রী ফাতিমা (রা) সম্পর্কে কিছু বলব না? তখন আমি বলিঃ হ্যাঁ অবশ্যই। তিনি বলেনঃ তার (ফাতিমার) হাতে যাতা পেষার কারনে ফোসকা পড়ে গেছে। আর কূপ থেকে মশকে পানি ঊঠাবার কারণে তাঁর বুকে ব্যথা অনুভূত হচ্ছে এবং ঘর ঝাড়ু দেওয়ার কারণে তাঁর সমস্ত কাপড়-চোপড় নোংরা হয়ে গিয়েছে। কেননা ঘরের সব কাজ একাই করে থাকেন। আর তাঁর কোন দাস-দাসী ছিল না। একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট কিছু গোলাম আসে। তখন আমি তাকে বলিঃ যদি তুমি তোমার পিতার নিকট উপস্থিত হয়ে গোলাম চাইতে, (তবে ভাল হতো)। তখন তিনি ফাতিমা (রা) তাঁর নিকট গমন করেন। কিন্তু তিনি তাঁর সংগে অন্য ক'জন ব্যক্তিকে আলাপ করতে দেখে ফিরে আসেন। পরদিন আবার তিনি তাঁর নিকট উপস্থিত হলে তিনি জিজ্ঞাসা করেনঃ তোমার কিসের প্রয়োজন? এতে তিনি চুপ করে থাকলে আমি বলিঃ ইয়া রাসূলাল্লাহ! আমি আপনাকে বলছি যে, যাঁতা পিষতে পিষতে তাঁর হাতে ফোসকা পড়ে গেছে। আর পানির মশক ভরতে ভরতে তার বুক ব্যথা হয়ে গেছে। এখন যখন আপনার নিকট কিছু খাদিম এসেছে, তখন আমিই তাঁকে বলিঃ তিনি যেন আপনার নিকট হাযির হয়ে একজন দাসের জন্য আবদার করেন, যাতে তিনি এ কষ্ট হতে রেহাই পান। তখন তিনি বলেনঃ হে ফাতিমা! আল্লাহ্‌কে ভয় কর এবং স্বীয় রব্বের ফরয হুকুম আদায় কর এবং নিজের ঘরের কাজ নিজেই কর। আর (দিন শেষে) যখন বিছানায় যাবে, তখন ৩৩ বার সুবহানাল্লাহ, ৩৩ বার আল-হামদুলিল্লাহ এবং ৩৪ বার আল্লাহু আক্‌বার পড়বে। যার সর্বমোট সংখ্যা হলো ১০০ বার। বস্তুত তোমার জন্য এই তাসবীহ খাদিমের চাইতেও উত্তম। তিনি (ফাতিমা) বলেনঃ আমি আল্লাহ্‌ এবং তাঁর রাসূলের উপর রাযী এবং খুশী (অর্থাৎ আমাকে যে হুকুম দেওয়া হয়েছে, তাতে আমি রাযী আছি)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2989,
			"arabicnumber": 2989,
			"text": "আহমদ ইবন মুহাম্মদ মারওয়াযী (রহঃ) ..... আলী ইবন হুসায়ন (রহঃ) থেকে বর্ণিত। তিনি উপরোক্ত হাদীছে বর্ণিত ঘটনা সম্পর্কে বলেনঃ তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁকে কোন খাদিম দেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2990,
			"arabicnumber": 2990,
			"text": "মুহাম্মদ ইবন ঈসা (রহঃ) .... আনবাসা ইবন আবদিল ওয়াহিদ কুরাশী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আবূ জা'ফর অর্থাৎ ইবন ঈসা বলেছেন যে, আমরা আনবাসা ইবন আবদিল ওয়াহিদ (রাঃ)-কে আবদাল বলতাম-এ শোনার আগে যে, আবদাল মাওয়ালীদের থেকে হয়। রাবী বলেনঃ আমার নিকট দাখীল ইবন আয়াস ইবন নূহ ইবন মুজজা'আ, তিনি তাঁর পিতা ও দাদা হতে বর্ণনা করেছেন যে, একদা মুজজা'আ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আসেন তাঁর ভাইয়ের দিয়্যাত (রক্তপণ) চাওয়ার জন্য, যাকে বনূ সাদূস-যারা বনূ যুহলের অন্তর্ভুক্ত ছিল, হত্যা করেছিল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যদি আমি কোন মুশরিকের দিয়্যাত দিতাম, তবে তোমার ভাইয়ের দিয়্যাতের ব্যবস্থা অবশ্যই করতাম। তবে আমি তোমাকে এর বিনিময়ের ব্যবস্থা করছি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জন্য বনূ যুহল থেকে প্রথম বার আদায়কৃত খুমুস হতে একশত উট দেওয়ার জন্য ফরমান লিখে দেন। যা থেকে কিছু উট তিনি (মুজ্‌জা'আ) গ্রহণ করেন। অতঃপর বনূ যুহল ইসলাম গ্রহণ করলে মুজ্‌জা'আ বাকী উট পাওয়ার জন্য আবূ বকর (রাঃ)-এর নিকট দাবী জানান এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ফরমান তাঁর খিদ্‌মতে পেশ করেন। তখন আবূ বকর (রাঃ) তাকে (মুজ্‌জা'আকে) ইয়ামামার সাদকা হতে বার হাজার সা'আ ক্ষতিপূরণ দেওয়ার জন্য হুকুম দেন। যা থেকে চার হাজার সা'আ যব, চার হাযার সা'আ গম এবং চার হাযার সা'আ খেজুর তাঁকে দেওয়া হয়। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ফরমানে এরূপ লেখা ছিলঃ বিসমিল্লাহির রাহমানির রাহীম। এ ফরমান মুহাম্মদ নবী (সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের) পক্ষ হতে মুজজা'আ ইবন মুরারার জন্য-যিনি বনূ সালমার অন্তর্ভুক্ত। আমি তাকে একশো উট দিচ্ছি। বনূ যুহলের মুশরিকদের নিকট হতে খুমুস বাবদ প্রথম বার যা আদায় হবে, সেখান থেকে এটা দেওয়া হবে, তার মৃত ভাইয়ের রক্তপণের বিনিময়ে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sanad Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2991,
			"arabicnumber": 2991,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) ..... আমির শা'বী (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্য গনীমতের মালে নির্ধারিত অংশ ছিল, যাকে 'সাফী' বলা হতো। তিনি খুমুস গ্রহণের আগে দাস, দাসী অথবা ঘোড়া হতে যা তাঁর পসন্দ হতো, তা নিয়ে নিতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2992,
			"arabicnumber": 2992,
			"text": "মুহাম্মদ ইবন বাশশার (রহঃ) ..... ইবন আওন (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি মুহাম্মদের নিকট নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য নির্ধারিত অংশ ও সাফী সম্পর্কে জিজ্ঞাসা করি। তিনি বলেনঃ সাধারণ মুসলিমদের সাথে তাঁরও একটা অংশ নির্ধারণ করা হতো, যদিও তিনি যুদ্ধে অনুপস্থিত থাকতেন। আর সাফী হলো খুমুসের সেই বাছাই করা মাল, যা সবার আগে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য নেওয়া হতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2993,
			"arabicnumber": 2993,
			"text": "মাহমূদ ইবন খালিদ সুলামী (রহঃ) ...... কাতাদা (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজে যুদ্ধে অংশগ্রহণ করতেন, তখন তাঁর জন্য সাফী নির্ধারিত থাকতো। তিনি যেখান হতে ইচ্ছা করতেন, সেখান হতে পসন্দ মত গ্রহণ করতেন। বস্তুত সাফিয়্যা (রাঃ), (যাঁকে তিনি খায়বরের যুদ্ধের সময় পেয়েছিলেন), এ ধরনের অংশ ছিলেন। আর যখন তিনি নিজে যুদ্ধে অংশগ্রহণ করতেন না, তখনও তাঁর নির্ধারিত অংশ আলাদা করা হতো; কিন্তু সেটা তাঁর পসন্দ করা অংশ হতো না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2994,
			"arabicnumber": 2994,
			"text": "নাসর ইবন আলী (রহঃ) ..... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ সাফিয়্যা ছিলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পসন্দ করা মালের অংশ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2995,
			"arabicnumber": 2995,
			"text": "সা'ঈদ ইবন মানসূর (রহঃ) ..... আনাস ইবন মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা খায়বর আক্রমণ করি। অতঃপর মহান আল্লাহ্‌ যখন এ দুর্গ জয় করিয়ে দেন, তখন সাফিয়্যা বিনত হুয়াই এর সৌন্দর্যের কথা তাঁর নিকট বর্ণিত হয়। (এ যুদ্ধে) তার স্বামী নিহত হয়, যখন তিনি ছিলেন নববধূ মাত্র। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে পসন্দ করেন। অতঃপর তিনি তাকে নিয়ে রওয়ানা হন, এমনকি যখন 'সাদ্দা-সাহবা' নামক স্থানে পৌছান, তখন তিনি হালাল হয়ে যান। অতঃপর তিনি তার সাথে সহবাস করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2996,
			"arabicnumber": 2996,
			"text": "মুসাদ্দাদ (রহঃ) ..... আনাস ইবন মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ সাফিয়্যা প্রথমে দাহিয়া-কালবীর অংশে পড়েন। পরে তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর অংশভুক্ত হন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2997,
			"arabicnumber": 2997,
			"text": "মুহাম্মদ ইবন খাল্লাদ বাহিলী (রহঃ) .... আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ দাহিয়া কালবীর ভাগে (খায়বরের যুদ্ধে) একজন সুশ্রী যুবতী আসে, যাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাতটি গোলামের বিনিময়ে খরিদ করেন। অতঃপর তিনি (দাহিয়া কালবী) ঐ দাসীকে উম্মু-সুলায়মের নিকট সোপর্দ করেন, যাতে তিনি তাকে গোসল করিয়ে সুন্দর বসন-ভূষণে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্য সুসজ্জিত করে দেন। রাবী হাম্মাদ বলেনঃ আমার ধারণা, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফিয়্যাকে ইদ্দতকাল অতিবাহিত না হওয়া পর্যন্ত উম্মু-সুলায়মের নিকট অবস্থান করতে নির্দেশ দেন। [সহীহঃ কিন্তু তার এ কথাঃ আমার মনে হয় ...... এতে প্রশ্ন রয়েছে। কেননা ইতিপূর্বে গত হয়েছে যে, সাদ্দুস সাহাবা নামক জায়গাতে পৌছলে তিনি পবিত্র হন এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সাথে নির্জানাবাস করেন।]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2998,
			"arabicnumber": 2998,
			"text": "দাঊদ ইবন মু'আয (রহঃ) ..... আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ খায়বর যুদ্ধশেষে যখন যুদ্ধ-বন্দীদের একত্রিত করা হয়, তখন দাহিয়া-কালবী এসে বলেনঃ ইয়া রাসূলাল্লাহ! আমাকে বন্দীদের থেকে একটা দাসী প্রদান করুন। তিনি বলেনঃ যাও একজন দাসী নিয়ে যাও। তখন তিনি সাফিয়্যা বিনত হুয়াইকে নিয়ে যান। অতঃপর জনৈক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হয়ে বলেঃ ইয়া রাসূলাল্লাহ! আপনি কি সাফিয়্যাকে দাহিয়া-কালবীকে প্রদান করলেন? রাবী ইয়াকূব বলেনঃ সাফিয়্যা বিনত হুয়াই ছিলেন কুরায়যা ও নযীর গোত্রের সর্দার কন্যা, তিনি তো আপনারই যোগ্যা। তখন তিনি বলেনঃ দাহিয়াকে তাকে (সাফিয়্যা) সহ ডেকে আন। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে দেখে দাহিয়াকে বলেনঃ তুমি এর বদলে বন্দীদের মধ্য হতে অন্য যে কোন দাসী নিয়ে নাও। অবশেষে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে আযাদ করে দেন এবং তাঁকে বিবাহ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2999,
			"arabicnumber": 2999,
			"text": "মুসলিম ইবন ইব্‌রাহীম (রহঃ) ..... ইয়াযীদ ইবন আবদিল্লাহ (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা মিরবাদ নামক স্থানে ছিলাম। তখন সেখানে এমন এক ব্যক্তি আসে, যার মাথার চুল ছিল এলোমেলো এবং তার হাতে ছিল এক টুকরা লাল চামড়া। আমরা তাকে বলিঃ মনে হয় তুমি জংগলের বাসিন্দা? তখন সে বলেঃ হ্যাঁ। আমরা তাকে বলিঃ তোমার হাতে যে লাল চামড়ার টুকরা আছে, তা আমাদের দিয়ে দাও। তখন সে তা আমাদের দিয়ে দেয়। ঐ চামড়ার উপর যা লেখা ছিল, আমরা তা পড়তে থাকি। তাতে লেখা ছিলঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পক্ষ হতে বনূ যুহায়র ইবন উকায়শ গোত্রের প্রতি-যদি তোমরা এরূপ সাক্ষ্য দাও যে, আল্লাহ্‌ ছাড়া আর কোন ইলাহ নেই এবং মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহ্‌র রাসূল, তোমরা সালাত কায়েম করবে, যাকাত প্রদান করবে, আর তোমরা মালে গনীমতের খুমুস এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর হিসসা ও সাফী প্রদান করবে। যদি তোমরা এরূপ কর, তবে তোমরা আল্লাহ্‌ ও তাঁর রাসূলের নিরাপত্তায় থাকবে। তখন আমরা তাকে জিজ্ঞাসা করিঃ তোমার কাছে এ ফরমান কে লিখে পাঠিয়েছে? সে বলেঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, (এটি লিখে আমার কাছে পাঠিয়েছেন)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3000,
			"arabicnumber": 3000,
			"text": "মুহাম্মদ ইবন ইয়াহ্‌ইয়া ইবন ফারিস (রহঃ) ..... কা'ব ইবন মালিক (রাঃ) থেকে বর্ণিত। তিনি ছিলেন ঐ তিনজনের একজন যার তাওবা (তাবূকের যুদ্ধের পর) কবুল করা হয়। কা'ব ইবন আশরাফ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সম্পর্কে ব্যাঙ্গাত্তক কবিতা রচনা করত এবং কাফির কুরায়শদের তাঁর বিরুদ্ধে যুদ্ধ করার জন্য প্ররোচিত করত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদীনায় আসেন, তখন সেখানে সব ধরনের লোকের বসবাস ছিল, যেমনঃ কিছু ছিল মুসলিম, কিছু ছিল মূর্তি-পূজারী মুশরিক এবং কিছু ছিল ইয়াহূদী, যারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর সাহাবীদের খুবই কষ্ট দিত। তখন মহান আল্লাহ্‌ তাঁর সবর করার জন্য এবং ক্ষমা করার জন্য হুকুম নাযিল করেন। তখন তাদের শানে আল্লাহ্‌ এ আয়াত নাযিল করেনঃ وَلَتَسْمَعُنَّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلِكُمْ অর্থাৎ তোমরা অবশ্যই তোমাদের পূর্ববর্তী আহলে কিতাব ও মুশরিকদের নিকট হতে বহু কষ্টদায়ক কথাবার্তা শ্রবণ করবে। এরপর যখন কা'ব ইবন আশরাফ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সম্পর্কে ব্যাঙ্গ ও বিদ্রূপাত্মক কবিতা রচনা করা হতে বিরত থাকতে অস্বীকার করে, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সা'দ ইবন মু'আয (রাঃ)-কে তাকে হত্যা করার জন্য একটি দল পাঠাবার জন্য নির্দেশ দেন। যিনি মুহাম্মদ ইবন মাসলামাকে এ উদ্দেশ্যে প্রেরণ করেন। রাবী কা'ব (রাঃ) তার (কা'ব ইবন আশরাফের) হত্যার কাহিনী বর্ণনা করেছেন। অবশেষে প্রেরিত বাহিনী যখন কা'ব ইবন আশরাফকে হত্যা করে, তখন ইয়াহূদী ও মুশরিকরা ভীত-সন্ত্রস্ত হয়ে সকাল বেলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট হাযির হয় এবং তারা বলেঃ রাত্রিতে কেউ আক্রমণ করে আমাদের নেতাকে হত্যা করে ফেলেছে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কা'ব ইবন আশরাফের হিজু বা ব্যাঙ্গ-বিদ্রূপ করার কথা তাদের কাছে ব্যক্ত করেন। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের নিকট হতে এমন একটি অঙ্গীকার পত্র লিখে নিতে বলেন, যাতে দু'পক্ষের কেউ কাউকে কোনরূপ কষ্ট না দেওয়ার কথা উল্লেখ থাকে। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজের, তাদের ও সমস্ত মুসলিমদের পক্ষ হতে একটি ইকরারনামা বা অঙ্গীকার-পত্র লিখিয়ে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3001,
			"arabicnumber": 3001,
			"text": "মুসাররিফ ইবন আমর আয়ামী (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বদর যুদ্ধে কুরাইশদের উপর বিজয়ী হয়ে মদীনায় ফিরে আসেন, তখন তিনি বনূ কায়নুকার বাজারে ইয়াহূদীদের একত্রিত করে বলেনঃ ওহে ইয়াহূদীরা! তোমরা এর আগে মুসলিম হয়ে যাও যে, তোমাদের উপর এরূপ মুসীবত আসে, যেরূপ কুরাইশদের উপর এসেছে। তখন তারা বলেঃ হে মুহাম্মদ! তুমি এতে বিভ্রান্ত হয়ো না যে, তুমি কুরাইশদের কয়েকজন যুদ্ধে অনভিজ্ঞ ব্যক্তিকে হত্যা করেছ। যদি তুমি আমাদের সাথে যুদ্ধ করতে, তবে বুঝতে পারতে আমরা কিরূপ মানুষ বা যোদ্ধা। আর তুমি আমাদের মত (বীর যোদ্ধা) কাউকে পাবে না। তখন আল্লাহ্‌ এ আয়াত নাযিল করেনঃ قُلْ لِلَّذِينَ كَفَرُوا سَتُغْلَبُونَ অর্থাৎ আপনি তাদের বলুন, যারা কুফরী করেছে, অচিরেই তোমরা পরাজিত হবে এবং তোমাদের জাহান্নামে একত্রিত করা হবে। আর তা হলো অতি নিকৃষ্ট আবাসস্থল। রাবী মুসাররিফ আয়াতের এ পর্যন্ত তিলাওয়াত করেনঃ فِئَةٌ تُقَاتِلُ فِي سَبِيلِ اللَّهِ অর্থাৎ একটি দল যুদ্ধ করেছিল আল্লাহর রাস্তায়, আর তা হলো বদর প্রান্তর এবং আর অন্য দলটি ছিল কাফির (অর্থাৎ মক্কার কুরায়শরা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3002,
			"arabicnumber": 3002,
			"text": "মুসাররিফ ইবন আমর (রহঃ) ..... মুহাইয়াসা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন যে, তোমরা ইয়াহূদীদের যে কেউকে কব্জার মাঝে পাবে, তাকে হত্যা করবে। তখন মুহাইয়াসা (রাঃ) শুবায়বা নামক জনৈক ইহাহূদী ব্যবসায়ীর উপর হামলা করেন এবং তাকে হত্যা করে ফেলেন। এ সময়েও মুহাইয়াসার সাথে ইহাহূদীদের মেলামেশা ছিল। (যখন তিনি শুবায়বাকে হত্যা করেন), তখন হুওইয়সা, যিনি তখনও ইসলাম কবুল করেননি এবং মুহাইয়াসার বড় ভাই ছিলেন, তিনি যখন ঐ ইয়াহূদীকে হত্যা করেন, তখন হুওইয়সা তাকে (মুহাইয়াসা) মারপিট করেন এবং বলেনঃ হে আল্লাহ্‌র দুশমন! আল্লাহর শপথ, তোমার পেটের চর্বি তো তার মাল দিয়ে তৈরী।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3003,
			"arabicnumber": 3003,
			"text": "কুতায়বা ইবন সা'ঈদ (রহঃ) ...... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমরা মসজিদে উপবিষ্ট ছিলাম। তখন হঠাৎ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট উপস্থিত হয়ে বলেনঃ ইয়াহূদীদের সাথে মুকাবিলার জন্য বের হও। তখন আমরা তাঁর সঙ্গে বের হয়ে ইয়াহূদীদের নিকট পৌঁছাই। সে সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখানে দাঁড়িয়ে ইয়াহূদীদের লক্ষ্য করে বলেনঃ হে ইয়াহূদীদের দল! তোমরা ইসলাম কবুল কর, যাতে শান্তিতে থাকতে পার। তখন তারা বলেঃ হে আবুল কাসিম! তুমি তো পয়গাম পৌছিয়ে দিয়েছ। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবার তাদের বলেনঃ তোমরা ইসলাম কবুল কর, শান্তিতে বসবাস কর। তখন তারা আবার বলেঃ তুমি তো বাণী পৌছিয়ে দিয়েছ, হে আবুল কাসিম! তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি তো এটাই চাচ্ছিলাম। অতঃপর তিনি তৃতীয় বার তাদের বলেনঃ তোমরা ভাল করে জেনে রাখ, এ যমীন আল্লাহ্‌র ও তাঁর রাসূলের। আমি তোমাদের এ যমীন (স্থান) হতে বের করে দিতে চাই। কাজেই তোমাদের যার তার মালের প্রতি মহব্বত আছে, সে যেন তা বিক্রি করে দেয়। অন্যথায় জেনে রাখ, এ যমীন আল্লাহর এবং তাঁর রাসূলের।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3004,
			"arabicnumber": 3004,
			"text": "মুহাম্মদ ইবন দাঊদ ইবন সুফইয়ান (রহঃ) ....... আবদুর রহমান ইবন কা'ব ইবন মালিক (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জনৈক সাহাবী হতে বর্ণনা করেছেন যে, কুরায়শ কাফিররা আবদুল্লাহ ইবন উবাই এবং তার মূর্তি-পূজক সাথীদের, যারা আওস ও খাযরাজ গোত্রের লোক, এ মর্মে পত্র লেখে, যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বদর যুদ্ধের আগে মদীনায় অবস্থান করছিলেনঃ তোমরা আমাদের সাথী (মুহাম্মদ) কে জায়গা দিয়েছ। এ জন্য আমরা আল্লাহ্‌র নামে শপথ করে বলছি, হয়তো তাঁর সাথে যুদ্ধ কর, নয়তো তাঁকে বের করে দাও। অন্যথায় আমরা সম্মিলিতভাবে আক্রমণ করে তোমাদের যোদ্ধাদের হত্যা করব এবং তোমাদের স্ত্রীদের আমাদের দখলে আনব। আবদুল্লাহ ইবন উবাই এবং তার মূর্তিপূজারী সাথীরা এ খবর পাওয়ার পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সংগে যুদ্ধের জন্য প্রস্তুত হয়। এ খবর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে পৌছবার পর তিনি তাদের সাথে সাক্ষাত করেন এবং বলেনঃ তোমরা কুরায়শদের নিকট হতে উত্তেজনা সৃষ্টিকারী চিঠি পেয়েছ, কিন্তু তা তোমাদের জন্য এত মারাত্মক নয়, যত না ক্ষতি তোমরা নিজেরা নিজেদের করবে। কেননা, তোমরা তো তোমাদের সন্তান-সন্ততি ও ভাইদের বিরুদ্ধে যুদ্ধ করার সংকল্প করছ। তারা যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এরূপ কথা শুনলো, তখন তারা বিচ্ছিন্ন হয়ে পড়লো। এ খবর কুরায়শ কাফিরদের কাছে পৌছলে তারা বদর যুদ্ধের পর ইয়াহুদীদের নিকট লিখলোঃ তোমরা ঘরবাড়ী ও দুর্গের অধিকারী। কাজেই তোমাদের উচিত আমাদের সাথী মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে যুদ্ধ করা। অন্যথায় আমরা তোমাদের সাথে এরূপ করব, সেরূপ করব। আর আমাদের ও তোমাদের স্ত্রীদের মাঝে কোন পার্থক্য থাকবে না। যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সম্পর্কে তারা এরূপ চিঠি পেল, তখন বনূ নযীরের ইয়াহুদীরা বিদ্রোহ ঘোষণা করলো এবং তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এ মর্মে অবহিত করে যে, আপনি আপনার সাথীদের থেকে ত্রিশজন নিয়ে আমাদের কাছে আসুন এবং আমাদের ত্রিশজন আলিম আপনার সংগে এক আলাদা স্থানে দেখা করবে। তারা আপনার কথা শুনবে, যদি তারা আপনার উপর ঈমান আনে এবং বিশ্বাস স্থাপন করে, তবে আমরা আপনার উপর ঈমান আনব। পরদিন সকাল বেলা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদল সেনাবাহিনী নিয়ে তাদের উপর হামলা করেন এবং তাদের অবরোধ করে বলেনঃ আল্লাহ্‌র শপথ! তোমরা যতক্ষণ অঙ্গীকার না করবে, ততক্ষণ আমি তোমাদের ব্যাপারে নিশ্চিত নই। তখন তারা (ইয়াহুদীরা) অঙ্গীকার করতে অস্বীকার করে। ফলে তিনি সেদিন তাদের সাথে দিনভর যুদ্ধে রত থাকেন। পরদিন তিনি বনূ নযীরকে বাদ দিয়ে বনূ কুরাইযার উপর আক্রমণ করেন এবং তাদের অঙ্গীকারবদ্ধ হতে বলেন। ফলে তারা তাঁর সংগে অঙ্গীকারবদ্ধ হয়। তখন তিনি তাদের নিকট হতে প্রত্যাবর্তন করে পুনরায় বনূ নযীরকে অবরোধ করেন এবং তাদের সাথে ততক্ষণ যুদ্ধ করেন, যতক্ষণ না তারা দেশত্যাগে বাধ্য হয়। বনূ নযীরের লোকেরা তাদের উটের পিঠে ঘরের দরজা, চৌকাঠ ইত্যাদি যে পরিমাণ মালামাল নেওয়া সম্ভব ছিল, তা নিয়ে যায়। এবার বনূ নযীরের খেজুরের বাগান রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর অধিকারে আসে, যা আল্লাহ্‌ তা'আলা বিশেষভাবে প্রদান করেন। যেমন আল্লাহ্‌ বলেনঃ وَمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلاَ رِكَابٍ অর্থাৎ আল্লাহ্‌ কাফিরদের মাল হতে যে সস্পদ তাঁর রাসূলকে প্রদান করেন, তা হাসিলের জন্য তোমরা তোমাদের ঘোড়া অথবা উট হাঁকাও নি, অর্থাৎ ঐ সম্পদ বিনা যুদ্ধে হাসিল হয়। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঐ মালের অধিকাংশই মুহাজিরদের মাঝে বণ্টন করে দেন এবং অভাবগ্রস্ত দু'জন আনসারকে তা হতে অংশ প্রদান করেন। এ দু'জন ছাড়া অন্য আনসার সাহাবীদের মাঝে এ মাল বিতরণ করা হয়নি। অবশিষ্ট মাল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্য সাদকা স্বরূপ ছিল, যা বনূ ফাতিমার নিয়ন্ত্রণে ছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3005,
			"arabicnumber": 3005,
			"text": "মুহাম্মদ ইবন ইয়াহইয়া ইবন ফারিস (রহঃ) ..... ইবন উমার (রাঃ) থেকে বর্ণিত। বনূ নযীর ও বনূ কুরায়যার ইয়াহূদীরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বিরুদ্ধে যুদ্ধ করেছিল। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনূ নযীরকে (দেশ হতে) বের করে দেন এবং বনূ কুরায়যার লোকেরা, যারা তাদের অংগীকার পূর্ণ করেছিল, তারা তাদের স্বস্থানে অবস্থিত ছিল। অবশেষে বনূ কুরায়যার ইয়াহূদীরা যখন যুদ্ধে লিপ্ত হয়, তখন তাদের পুরুষদের হত্যা করা হয় এবং তাদের স্ত্রী, মালামাল ও সন্তানদের মুসলিমদের মাঝে বণ্টন করে দেওয়া হয়। কিন্তু তাদের কিছু লোক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে সাক্ষাত করলে, তিনি তাদের নিরাপত্তা প্রদান করেন এবং পরে তারা ইসলাম কবুল করে। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনূ কায়নুকার ইয়াহূদী, যারা আবদুল্লাহ ইবন সালামের গোত্রের লোক ছিল, তাছাড়া বনূ হারিছার ইয়াহূদী এবং অন্যান্য যে ইয়াহূদীরা মদীনায় বসবাস করতো, সকলকে মদীনা হতে বের করে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3006,
			"arabicnumber": 3006,
			"text": "হারূন ইবন যায়দ ইবন আবূ যারকা (রহঃ) ..... ইবন উমার (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বরবাসীদের বিরুদ্ধে যুদ্ধ করে তাদের পরাজিত করেন এবং তাদের খেজুর বাগান ও যমীনের উপর আধিপত্য স্থাপন করেন এবং তাদেরকে তাদের গৃহে অবরোধ করেন। তখন তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে এ শর্তে সন্ধি করে যে, সোনা, রূপা এবং যাবতীয় হাতিয়ার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অধিকারে থাকবে এবং অবশিষ্ট মালামাল হতে তাদের উট যা বহন করতে পারবে, তা তারা নিয়ে যাবে। কিন্তু তা এ শর্তে যে, তারা কিছুই গোপন করবে না এবং সরিয়েও রাখবে না। আর যদি তারা এরূপ করে, তবে মুসলিমদের পক্ষ হতে কোনরূপ যিম্মাদারী অথবা অঙ্গীকার (কার্যকর) থাকবে না। এ সময় তারা হুয়াই ইবন আখতাবের (স্বর্ণমুদ্রাপূর্ণ) চামড়ার থলি গায়েব করে দেয়, যে খায়বরের যুদ্ধের আগে নিহত হয়েছিল। আর সে বনূ নযীরের দেশ ত্যাগের সময় তাদের বহু গহনা-পত্র আত্মসাৎ করেছিল। রাবী বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সা'ইয়াকে জিজ্ঞাসা করেন যে, হুয়াই ইবন আখতাবের থলি কোথায়? সে বলেঃ তা যুদ্ধে খরচ হয়ে শেষ হয়ে গেছে। কিন্তু সাহাবীরা ঐ থলি পেয়ে যান। তখন তিনি ইবন আবূ হাকীককে (ইয়াহূদী) হত্যা করে তার স্ত্রী ও সন্তানদের বন্দী করেন এবং তাদের দেশ হতে বের করে দেওয়ার সিদ্ধান্ত নেন। তখন তারা বলেঃ হে মুহাম্মদ! আমাদের এখানে বসবাসের অনুমতি দিন। আমরা এ যমীনের উপর পরিশ্রম করে উপার্জন করব এবং এর অর্ধেক আমাদের এবং বাকী অর্ধেক আপনার। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (খায়বরের এ সম্পদ হতে) তাঁর সব স্ত্রীদের আলাদাভাবে আশি ওসাক খেজুর এবং বিশ ওসাক যব প্রদান করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3007,
			"arabicnumber": 3007,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ...... আবদুল্লাহ ইবন উমার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা উমার (রাঃ) বলেনঃ হে জনগণ! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বরের ইয়াহূদীদের সাথে এরূপ চুক্তি করেন যে, আমরা যখনই ইচ্ছা করব, তখনই তাদের বের করে দেব। কাজেই যদি কারও ধন-সস্পদ তাদের কাছে থাকে, তবে সে যেন তা নিয়ে নেয়। কেননা, আমি ইয়াহূদীদের দেশ হতে বের করে দেব। অবশেষে তিনি তাদের বের করে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3008,
			"arabicnumber": 3008,
			"text": "সুলায়মান ইবন দাঊদ মাহরী (রহঃ) ..... আবদুল্লাহ্‌ ইবন উমার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ যখন খায়বর বিজয় হয়, তখন ইয়াহূদীরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এ মর্মে দরখাস্ত পেশ করে যে, আপনি আমাদের এ শর্তে এখানে বসবাসের অনুমতি দিন, যা আমরা উপার্জন করব, আপনি তার অর্ধেক পাবেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি তোমাদের এখানে এ শর্তে বসবাসের অনুমতি দিচ্ছি যে, আমরা যখনই চাব, তখনই তোমাদের বহিষ্কার করতে পারব। পরে তারা এ শর্ত অনুযায়ী সেখানে বসবাস করতে থাকে। খায়বরের খেজুর দু'ভাগে বিভক্ত হতো এবং খুমুস রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গ্রহণ করতেন। আর খুমুস হতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সব বিবিকে একশত ওসাক খেজুর এবং বিশ ওসাক যব প্রদান করতেন। অবশেষে উমার (রাঃ) যখন ইয়াহূদীদের বহিষ্কারের সিদ্ধান্ত গ্রহণ করেন, তখন তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বিবিদের কাছে এ মর্মে খবর পাঠান যে, আপনারা যে কেউ চাইলে, আমি তাঁকে এতগুলি খেজুর গাছ দেব, যা থেকে একশত ওসাক খেজুর পাওয়া যাবে এবং ঐ গাছ ও যমীন আপনাদের মালিকানায় থাকবে এবং তার পানিও এর শামিল থাকবে। একই রূপে কৃষিক্ষেত্র হতে এ পরিমাণ যমীন দেব, যা থেকে বিশ ওয়াক পরিমাণ যব উৎপন্ন হবে। আর আপনাদের থেকে যদি কেউ চান যে, আমি খুমুস হতে আপনাদের অংশ দেই, তবে আমি তা দেব।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3009,
			"arabicnumber": 3009,
			"text": "দাঊদ ইবন মু'আয (রহঃ) ...... আনাস ইবন মালিক (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বরের উপর যুদ্ধ পরিচালনা করেন। আমরা যুদ্ধ করে তা জয় করি। অবশেষে বন্দীদের একত্রিত করা হয় (যাতে মুসলিমদের মাঝে তা সহজে বন্টন করা যায়)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3010,
			"arabicnumber": 3010,
			"text": "রাবী ইবন সুলায়মান মুআয্‌যিন (রহঃ) .... সাহল ইবন আবী হাছমা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বর যুদ্ধে প্রাপ্ত সমস্ত মালামাল দু'ভাগে বিভক্ত করেন। যার একাংশ তিনি তাঁর নিজের প্রয়োজন পূরণের জন্য গ্রহণ করেন এবং বাকী অংশটি আঠার ভাগে বিভক্ত করে মুসলিমদের মাঝে বন্টন করে দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3011,
			"arabicnumber": 3011,
			"text": "হুসায়ন ইবন আলী ইবন আসওয়াদ (রহঃ) ..... বাশীর ইবন ইয়াসার (রহঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কয়েকজন সাহাবী থেকে শুনেছেন। তাঁরা এ হাদীছ বর্ণনা প্রসঙ্গে বলেছেনঃ খায়বরে প্রাপ্ত অর্ধেক মালে সমস্ত মুসলিমের অংশ ছিল এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরও হিসসা ছিল। আর বাকী যে অর্ধেক মাল ছিল, তা মুসলিমদের বিশেষ প্রয়োজনে (বিপদাপদ, যুদ্ধ ইত্যাদি) রাখা হতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3012,
			"arabicnumber": 3012,
			"text": "হুসায়ন ইবন আলী (রহঃ) ..... বাশীর ইবন ইয়াসার (রাঃ), যিনি একজন আনসার সাহাবীর গোলাম ছিলেন, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কতিপয় সাহাবী হতে বর্ণনা করেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন খায়বর জয় করেন, তখন তিনি (সেখানে প্রাপ্ত মালকে) ছত্রিশ ভাগে বিভক্ত করেন। তিনি প্রত্যেক অংশকে একশত ভাগে বণ্টন করেন। এর থেকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও মুসলিমদের জন্য অর্ধেক মাল রাখা হয়, আর বাকী অর্ধেক তাদের জন্য আলাদা সংরক্ষণ করা হয়, যারা প্রতিনিধি দলের সাথে আসবে এবং মানুযের বিপদাপদ ও প্রয়োজনে ব্যয় করা হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3013,
			"arabicnumber": 3013,
			"text": "আবদুল্লাহ ইবন সা'ইদ কিনদী (রহঃ) ..... বশীর ইবন ইয়াসার (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আল্লাহ্‌ তা'আলা যখন খায়বরকে তাঁর নবীর জন্য গনীমত হিসাবে প্রদান করেন, তখন তিনি তাকে ৩৬ ভাগে বিভক্ত করেন। এর প্রত্যেক ভাগে একশো অংশ ছিল। এর অর্ধেক অংশ তিনি তাঁর নিজের প্রয়োজনের জন্য রাখেন-যার মাঝে অতীহা ও কুতায়বা নামক দুটি গ্রাম ছিল আর এর সংলগ্ন অন্যান্য সস্পদও। আর বাকী অর্ধাংশ মুসলিমদের মাঝে বণ্টন করে দেন, যার মাঝে শাক ও নাতা নামক দু'টি গ্রাম ছিল এবং এর সাথে সংশ্লিষ্ট অন্যান্য সম্পদও। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর অংশ এ দু'টি ভাগের সাথে সংশ্লিষ্ট ছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3014,
			"arabicnumber": 3014,
			"text": "মুহাম্মদ ইবন মিসকীন ইয়ামামী (রহঃ) .... বাশীর ইবন ইয়াসার (রহঃ) থেকে বর্ণিত। নিশ্চয় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, যখন আল্লাহ্‌ তাঁকে খায়বরকে মালে গনীমত হিসাবে প্রদান করেন, তখন তিনি এর সমস্ত মালামাল ছত্রিশ ভাগে বিভক্ত করেন। এরপর তিনি মুসলিমদের জন্য আঠার ভাগ আলাদা করে রাখেন, যার প্রত্যেক ভাগে একশ ব্যক্তি ছিল। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও অন্যান্য সাহাবীদের ন্যায় ছিলেন, অর্থাৎ তিনিও একটি অংশ পান, য়েমন অন্য সাহাবীরা পেয়েছিলেন। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আঠার অংশ, অর্থাৎ বাকী অর্ধাংশ তাদের জন্য বরাদ্দ করেন, যারা ছিল দুঃস্থ ও বিপদগ্রস্ত এবং মুসলিমদের বিশেষ প্রয়োজনের জন্য। এ অর্ধাংশে ওয়াতীহ, কুতায়বা ও সালালিম (খায়বরের কিছু গ্রামের নাম) ছিল এবং এর সংশ্লিষ্ট অন্যান্য সম্পদও। অবশেষে খায়বরের সমস্ত মালামাল যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও মুসলিমদের করতলগত হয়, তখন এর তদারকির জন্য আর কোন কর্মচারী ছিল না। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইয়াহূদীদের ডাকেন এবং তাদের এ শর্তে যমীন তোগ করতে দেন যে, তারা এর দেখাশুনা করবে এবং উৎপন্ন দ্রব্যের অর্ধেক তাঁকে দেবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3015,
			"arabicnumber": 3015,
			"text": "মুহাম্মদ ইবন ঈসা (রহঃ) ..... মুজাম্মি ইবন ই'য়াকূব ইবন মুজাম্মি ইবন ইয়াযীদ আনসারী (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি আমার পিতা ই'য়াকূব ইবন মুজাম্মি'কে কে বর্ণনা করতে শুনেছি। তিনি তাঁর চাচা আবদুর রহমান ইবন ইয়াযীদ আনসারী হতে বর্ণনা করেছেন এবং তিনি তাঁর চাচা মুজাম্মি ইবন জারিয়া আনসারী হতে, আর তিনি আল-কুরআনের কারীদের মাঝে একজন কারী ছিলেন। তিনি বলেনঃ খায়বরের ধন-সম্পদ হুদায়বিয়ায় অংশগ্রহণকারী সাহাবীদের মাঝে বণ্টন করা হয়। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একে আঠার ভাগে বিভক্ত করেন। আর যুদ্ধে অংশগ্রহণকারী সৈন্য সংখ্যা ছিল এক হাজার পাঁচ'শ, যার তিন'শ ছিল অশ্বারোহী, (এবং বাকী পদাতিক)। তিনি অশ্বারোহী সৈন্যদের দু'অংশ এবং পদাতিক বাহিনীর প্রত্যেককে এক অংশ হিসাবে প্রদান করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3016,
			"arabicnumber": 3016,
			"text": "হুসায়ন ইবন আলী আজালী (রহঃ) ..... আবদুল্লাহ ইবন আবী বকর এবং মুহাম্মদ ইবন মাসলামা (রাঃ) এর কোন এক ছেলে থেকে বর্ণিত। তাঁরা বলেনঃ খায়বর বিজয়ের পর সেখানে কিছু লোক অবশিষ্ট ছিল, যারা দূর্গের মাঝে অন্তরীণ ছিল। তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এ মর্মে আবেদন করে যে, তিনি যেন তাদের জীবনের নিরাপত্তা দিয়ে ছেড়ে দেন। তিনি এ আবেদন গ্রহণ করেন। ফিদাকের অধিবাসীরা এ খবর জানতে পেরে, তারাও এ শর্তের উপর আত্মসমর্পণ করে। ফলে ফিদাকের মালামাল খাসভাবে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর প্রাপ্য হয়। কেননা, তা বিজয়ের জন্য ঘোড়া বা উট কিছুই দৌড়াতে হয়নি (অর্থাৎ কোন যুদ্ধ হয়নি)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3017,
			"arabicnumber": 3017,
			"text": "মুহাম্মদ ইবন ইয়াহইয়া (রহঃ) ...... যুহরী থেকে বর্ণিত। সা'ঈদ ইবন মুসাইয়াব (রহঃ) তাঁর নিকট বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বরের কিছু অংশ শক্তি প্রয়োগের মাধ্যমে জয় করেন। আবূ দাঊদ বলেনঃ হারিছ ইবন মিসকীন হতে বর্ণিত, যার সাক্ষী আমি। ইবন ওয়াহব তোমাদের নিকট বর্ণনা করেছেন। রাবী বলেনঃ মালিক ইবন শিহাব থেকে বর্ণনা করেছেন যে, খায়বরের কিছু অংশ শক্তি প্রয়োগের মাধ্যমে জয় করা হয় এবং কিছু সন্ধির মাধ্যমে। কুতায়বা নামক স্থানটির অধিকাংশ শক্তি প্রয়োগের মাধ্যমে বিজিত হয় এবং কিছু সন্ধির দ্বারা। (রাবী বলেন,) আমি মালিককে জিজ্ঞাসা করিঃ কুতায়বা কি? তিনি বলেনঃ তা হলো, খায়বরের একটা জায়গা, যেখানে চল্লিশ হাজার খেজুর গাছ আছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3018,
			"arabicnumber": 3018,
			"text": "ইবন সারহা (রহঃ) ..... ইবন শিহাব (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি জানতে পেরেছি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুদ্ধ-বিগ্রহের পর শক্তি প্রয়োগের মাধ্যমে খায়বার জয় করেন। আর সেখান থেকে যারা বহিষ্কৃত হওয়ার জন্য বের হয়েছিল, তারা যুদ্ধের পর বেরিয়ে গিয়েছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3019,
			"arabicnumber": 3019,
			"text": "ইবন সারহা (রহঃ) .... ইবন শিহাব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বরের মাল হতে (যা গনীমত হিসাবে পান) এক-পঞ্চমাংশ আলাদা করে নেন। এরপর বাকী সমস্ত মালামাল যুদ্ধে অংশগ্রহণকারী সকলের মাঝে এবং হুদায়বিয়ার যুদ্ধে অংশগ্রহণকারী ঐ সমস্ত ব্যক্তির মাঝে বণ্টন করে দেন, যারা এ যুদ্ধে অনুপস্থিত ছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3020,
			"arabicnumber": 3020,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ..... উমার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি যদি পরবর্তীকালের মুসলিমদের কথা খেয়াল না করতাম, তবে আমি যে শহর জয় করতাম, তা ঐভাবে বন্টন করে দিতাম, যেভাবে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বরের মালামাল বন্টন করে দিয়েছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3021,
			"arabicnumber": 3021,
			"text": "উছমান ইবন আবী শায়বা (রহঃ) .... ইবন আব্বাস (রাঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট, যে বছর মক্কা বিজয় হয়েছিল, আব্বাস ইবন আবদুল মুত্তালিব (রাঃ) সুফয়ান ইবন হারবকে নিয়ে আসেন। তিনি 'মাররা-যাহরান' নামক স্থানে ইসলাম কবুল করেন। তখন তাঁকে আব্বাস (রাঃ) বলেনঃ ইয়া রাসূলুল্লাহ! আবূ সুফইয়ান এমন এক ব্যক্তি, যে নেতৃত্বের গৌরব পছন্দ করে। কাজেই আপনি যদি তাঁর জন্য এরূপ কিছু করতেন (তবে ভাল হতো)। তিনি বলেনঃ আচ্ছা, যে ব্যক্তি আবূ সুফয়ানের ঘরে প্রবেশ করবে সে নিরাপদ থাকবে। আর যে ব্যক্তি নিজের ঘরের দরজা বন্ধ করে রাখবে, সেও নিরাপদে থাকবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3022,
			"arabicnumber": 3022,
			"text": "মুহাম্মদ ইবন আমর (রহঃ) ...... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন (মক্কা বিজয়ের সময়) 'মাররা-যাহরান' নামক স্থানে অবস্থান করছিলেন, তখন আমার মনে হয়, আল্লাহ্‌র শপথ! যদি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের (কুরায়শদের) শাস্তি প্রস্তাবের আগে, তাঁর বাহিনীসহ জোর পূর্বক মক্কায় প্রবেশ করেন, তবে সমস্ত কুরাইশ ধ্বংস হয়ে যাবে। অতঃপর আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর খচ্চরের পিঠে সওয়ার হয়ে রওয়ানা হই। এ সময় আমি এরূপ ধারণা করি যে, সম্ভবত আমার সংগে মক্কার কোন লোকের সাক্ষাত হয়ে যাবে। তখন আমি তাকে বলবঃ সে যেন তাদেরকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর অবস্থান সম্পর্কে জানিয়ে দেয়, যাতে তারা তাঁর নিকট হাযির হয়ে নিরাপত্তার আবেদন করতে পারে। আমি যখন এরূপ মনে করে যাচ্ছিলাম, তখন হঠাৎ আমি আবূ সুফইয়ান ও বুদায়ল ইবন ওয়ারাকার কথোপকথন শুনতে পাই। তখন আমি বলিঃ হে আবূ হানযালা! (আবূ সুফয়ানের কুনিয়াত)! তখন সে আমার কণ্ঠস্বর চিনতে পেরে বলেঃ আবূল ফযল নাকি? এটি আব্বাস (রাঃ)-এর কুনিয়াত। তখন আমি বলিঃ হ্যাঁ। তখন সে বলেঃ আমার মাতাপিতা আপনার জন্য কুরবানী হোক, অবশেষে ব্যাপার কি? তখন আমি বলিঃ এই তো রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং অন্যান্য লোকেরা। তখন সে (আবূ সুফইয়ান) জিজ্ঞাসা করেঃ এখন বাঁচার জন্য বাহানা কি? তিনি (ইবন আব্বাস) বলেনঃ তখন সে (আবূ সুফইয়ান) আমার বাহনের পশ্চাতে আরোহণ করে এবং তাঁর সাথী (বুদায়ল) ফিরে যায়। পরদিন সকালে আমি তাঁকে নিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হই। তখন আমি বলিঃ ইয়া রাসূলাল্লাহ! আবূ সুফইয়ান এমন এক ব্যক্তি যে নেতৃত্বের গৌরব পছন্দ করে। কাজেই তাঁর জন্য গৌরবজনক কিছু করুন। তিনি বলেনঃ ঠিক আছে, যে ব্যক্তি আবূ সুফয়ানের ঘরে প্রবেশ করবে, সে নিরাপদ। আর যে ব্যক্তি নিজের ঘরের দরজা বন্ধ করে থাকবে, সে-ও নিরাপদ, আর যে মাসজিদুল হারামে প্রবেশ করবে, সে-ও নিরাপদ। রাবী বলেনঃ এ ঘোষনা শোনার পর লোকেরা তাদের ঘরে এবং মসজিদে আশ্রয় গ্রহণ করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3023,
			"arabicnumber": 3023,
			"text": "হাসান ইবন সাব্বাহ (রহঃ) .... ওয়াহাব (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি জাবির (রাঃ)-কে জিজ্ঞাসা করেছিলাম যে, তারা (মুসলিমরা) কি মক্কা বিজয়ের দিন গনীমতের মাল পেয়েছিল? তিনি বলেনঃ না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3024,
			"arabicnumber": 3024,
			"text": "মুসলিম ইবন ইবরাহীম (রহঃ) ....... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মক্কায় প্রবেশ করেন, তখন তিনি যুবায়র ইবন আওয়াম, আবূ উবায়দা ইবন জাররাহ এবং খালিদ ইবন ওয়ালীদ (রাঃ)-কে অশ্বপৃষ্ঠে আরোহিত অবস্থায় ছেড়ে দেন। এরপর তিনি বলেনঃ হে আবূ হুরায়রা! আনসারদের ডেকে বলে দাও, তারা যেন এ রাস্তা ধরে অগ্রসর হয়। আর যে কেউ (এ রাস্তায়) তোমাদের সম্মুখীন হবে, তাকে হত্যা করে ফেলবে। এ সময় জনৈক ব্যক্তি এরূপ ঘোষণা দেয় যে, আজকের দিনের পর আর কোন কুরাইশ অবশিষ্ট থাকবে না। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি তার গৃহে প্রবেশ করবে সে নিরাপদ, যে ব্যক্তি তার অস্ত্রশস্ত্র সমর্পণ করবে, সে নিরাপদ। এ সময় কুরাইশ নেতারা কা'বা শরীফের মধ্যে (নিরাপত্তার আাশায়) প্রবেশ করে, ফলে কা'বা শরীফ ভরে যায়। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাওয়াফ সম্পন্ন করেন এবং মাকামে ইবরাহীমের পেছনে সালাত আদায় করেন। এরপর তিনি কা'বা ঘরের দরজার চৌকাঠ ধরেন। তখন তারা (কুরায়শ নেতারা) বেরিয়ে আসে এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ইসলামের উপর বায়'আত গ্রহণ করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3025,
			"arabicnumber": 3025,
			"text": "হাসান ইবন সাব্বাহ (রহঃ) ...... ওয়াহব (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি জাবির (রাঃ)-কে জিজ্ঞাসা করি যে, যখন বনূ ছাকীফ বায়'আত করেছিল, তখন কি শর্ত করেছিল? তিনি বলেনঃ তারা এ শর্তের উপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট বায়'আত গ্রহণ করেছিল যে, তাদের উপর যাকাত দেওয়া এবং জিহাদে অংশ গ্রহণ করার দরকার হবে না। অতঃপর তিনি (জাবির) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এরূপ বলতে শোনেনঃ অচিরেই তারা ইসলাম কবুলের পর যাকাত দেবে এবং জিহাদে অংশ গ্রহণ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3026,
			"arabicnumber": 3026,
			"text": "আহমদ ইবন আলী ইবন সুওয়ায়দ (রহঃ) .... আফফান ইবন আবূল আস (রাঃ) থেকে বর্ণিত যে, যখন ছাকীফ গোত্রের প্রতিনিধিদল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়, তখন তিনি তাদের মসজিদে অবস্থানের অনুমতি দেন, যাতে তাদের অন্তর নরম হয়। সে সময় তারা তাঁর সঙ্গে এরূপ শর্ত করে যে, তাদের জিহাদে শরীক হওয়ার জন্য বের হওয়ার নির্দেশ দেওয়া হবে না এবং তাদের নিকট হতে উশর বা দশমাংশও গ্রহণ করা হবে না। আর না তাদের সালাতও আদায় করতে হবে। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এটা হতে পারে যে, এখন তোমাদের জিহাদে অংশ গ্রহণের জন্য বের করা হবে না, তোমাদের থেকে উশর নেওয়া হবে না। কিন্তু সেই দীনে কোন মঙ্গল, যাতে রুকূ নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3027,
			"arabicnumber": 3027,
			"text": "হান্নাদ ইবন সারী (রহঃ) ..... আমির ইবন শাহর (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন (দীনের দাওয়াত দেওয়ার জন্য) বের হন, তখন হামদান গোত্রের লোকেরা আমাকে বলেঃ তুমি কি এ ব্যক্তির (মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) নিকট গমন করে আমাদের ব্যাপারে কথাবার্তা বলবে? যদি তুমি আমাদের সস্পর্কীয় কোন ব্যাপারে রাযী হও, তবে আমরাও তা কবূল করব, আর যদি তুমি কোন কিছু অপসন্দ কর, তবে আমরাও তা অপসন্দ করব। আমি বলিঃ হ্যাঁ। অতঃপর আমি রওয়ানা হই এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হই। আমি তাঁর কথাবার্তা পসন্দ করি এবং আমার কওমের লোকেরা ইসলাম কবুল করে নেয়। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ পত্রখানা উমায়র যু-মাররানের নিকট প্রেরণ করেন। রাবী বলেনঃ এরপর তিনি মালিক ইবন মুরারা রাহাবী (রাঃ)-কে সমস্ত ইয়ামনবাসীর নিকট (ইসলামের পয়গাম পৌছানের জন্য) প্রেরণ করেন। তখন আক্‌কু যূ-খায়ওয়ান নামক জনৈক ব্যক্তি ইসলাম কবুল করে। রাবী বলেনঃ তখন আক্‌কু-কে বলা হয়, তুমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট যাও এবং তাঁর নিকট হতে তোমার গ্রামবাসী ও তোমার মালের জন্য নিরাপত্তা চাও। তখন সে ব্যক্তি তাঁর নিকট উপস্থিত হলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জন্য এ ফরমান লিখে দেনঃ ''বিস্‌মিল্লাহির রাহমানির রাহীম'' এ ফরমান রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পক্ষ হতে আক্‌কু যূ-খাওয়ানের জন্য। যদি সে (তার বক্তব্য) সত্যবাদী হয়, তবে তার জন্য নিরাপত্তা—তার যমীনে, মালে ও গোলামে এবং সে আল্লাহ্‌র যিম্মায় ও মুহাম্মাদুর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যিম্মায় থাকবে। এ ফরমানটি লিখেছিলেন খালিদ ইবন সাঈদ ইবন আস (রাঃ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3028,
			"arabicnumber": 3028,
			"text": "মুহাম্মদ ইবন আহমদ কুরাশী ও হারুন ইবন আবদিল্লাহ (রহঃ) ...... আবইয়ায ইবন হাম্মাল (রাঃ) থেকে বর্ণিত। তিনি প্রতিনিধি দলের সাথে উপস্থিত থাকার সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে সাদাকার ব্যাপারে কথাবার্তা বলেন। তখন তিনি বলেনঃ হে সাবার ভ্রাতৃবৃন্দ! সাদাকা দেওয়া তো একটা জরুরী ব্যাপার। তখন সে বলেঃ ইয়া রাসূলাল্লাহ! আমাদের উৎপাদিত শস্য তো কেবল তূলা। আর সাবা শহর তো এখন উজাড় হয়ে গেছে এবং তাদের মাত্র কয়েক ব্যক্তি সাবা শহরে মারিব নামক স্থানে বসবাস করেছে। অবশেষে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের সাথে প্রতি বছর মুআফির নামক স্থানের তাঁতীদের তৈরী কাপড়ের সমদামের সত্তর জোড়া দামী কাপড় রাজস্ব খাতে আদায় করার চুক্তিতে আবদ্ধ হন, যারা 'সাবা'-ওয়ালাদের থেকে 'মারিব' নামক স্থানে অবশিষ্ট ছিল। যা তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ইনতিকালের সময় পর্যন্ত সব সময় আদায় করতো। কিন্তু রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ইন্তিকালের পর সাদাকা আদায়কারী প্রতিনিধিগণ ঐ চুক্তি লংঘন করেন, যা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবয়ায ইবন হাম্মালের সাথে সত্তর জোড়া কাপড় গ্রহণের ব্যাপারে করেছিলেন। পরে আবূ বকর (রাঃ) ঐ নির্দেশ ঐরূপে রাখার হুকুম দেন, যেমন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হুকুম করেছিলেন। অবশেষে আবূ বাকর (রাঃ) ইনতিকাল করার পর ঐ চুক্তি বাতিল হয়ে যায় এবং নিয়মিত সাদাকা আদায় প্রথা চালু হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3029,
			"arabicnumber": 3029,
			"text": "সাঈদ ইবন মানসূর (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (ইন্তিকালের সময়) তিনটি বিষয়ে ওসীয়ত করেন। তিনি বলেনঃ মুশরিকদের আরবভূমি হতে বের করে দেবে, তোমরা রাষ্ট্রদূতদের সাথে সদ্ব্যবহার করবে, যেমন আমি তাদের সাথে করে থাকি। রাবী বলেনঃ ইবন আব্বাস (রাঃ) তৃতীয় বিষয়টি সম্পর্কে চুপ থাকেন, অথবা তিনি বলেনঃ আমি তা ভুলে গিয়েছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3030,
			"arabicnumber": 3030,
			"text": "হাসান ইবন আলী (রহঃ) .... উমার ইবন খাত্তাব (রাঃ) থেকে বর্ণিত। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এরূপ বলতে শুনেছেনঃ আমি ইয়াহূদ ও নাসারাদের অবশ্যই আরবভূমি হতে বের করে দেব এবং এখানে মুসলিম ছাড়া আর কেউ থাকবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3031,
			"arabicnumber": 3031,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ..... উমর (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপই বলেছেন। তবে প্রথমে বর্ণিত হাদীছটি পরিপূর্ণ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3032,
			"arabicnumber": 3032,
			"text": "সুলায়মান ইবন দাঊদ আতকী (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ একই শহরে দুটি কিবলা হতে পারবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3033,
			"arabicnumber": 3033,
			"text": "মাহমূদ ইবন খালিদ (রহঃ) ..... সা'ঈদ অর্থাৎ ইবন আবদিল আযীয (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আরবভূমি 'ওয়াদী-কুররা' হতে ইয়ামনের শেষ প্রান্ত পর্যন্ত বিস্তৃত এবং ইরাক হতে সমুদ্র পর্যন্ত বিস্তৃত। আবূ দাঊদ (রহঃ) বলেনঃ হারিছ ইবন মিসকীনের নিকট এরূপ পড়া হয়েছিল, যখন আমি সেখানে উপস্থিত ছিলাম যে, মালিক (রহঃ) থেকে বর্ণিত। উমার (রাঃ) নাজরানবাসীদের বহিষ্কার করেছিলেন, তবে তিনি তাদেরকে তায়মা থেকে বহিষ্কার করে নি। কেননা, তা আরবভূমির অন্তর্ভুক্ত ছিল না। আর 'ওয়াদী-কুররা'র ইয়াহূদীদের এ জন্য বহিষ্কার করা হয়নি, আমার ধারণায়, তাঁরা 'ওয়াদী-কুররাকে' আরবভূমি হিসাবে মনে করেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3034,
			"arabicnumber": 3034,
			"text": "ইবন সারাহ (রহঃ) ..... মালিক (রহঃ) থেকে বর্ণিত। উমার (রাঃ) নাজরান এবং ফিদাকের ইয়াহূদীদের বের করে দিয়েছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3035,
			"arabicnumber": 3035,
			"text": "আহমদ ইবন ইয়ূনুস (রহঃ) ...... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (এমন এক সময় আসবে) যখন ইরাকবাসীরা তাদের যমীন ও তার উৎপাদিত ফসল-কাফীয ও দিরহাম হতে বঞ্চিত হবে (অর্থাৎ এ সব সেখানকার অধিবাসীরা পাবে না, বরং তোমরা এ সবের মালিক হবে)। আর শামবাসীরা তাদের যমীন ও উৎপাদিত ফসল ও অর্থ-মুদ এবং স্বর্ণমুদ্রা হতে বঞ্চিত হবে এবং মিসরবাসীরা তাদের যমীন ও উৎপাদিত দ্রব্য ও অর্থ-আরদাব ও দীনার হতে বঞ্চিত হবে (অর্থাৎ তোমরাই এ সবের মালিক ও অধিকারী হবে)। এরপর তোমরা সেখানে ফিরে যাবে, যেখানে তোমরা প্রথমে ছিলে (অর্থাৎ ধন-দওলত তোমাদের হাতছাড়া হয়ে পুনরায় কাফিরদের হাতে চলে যাবে)। রাবী যুহায়র তিনবার এরূপ উক্তি করেন যে, আবূ হুরায়রা (রাঃ)-এর গোশত এবং রক্ত এর সাক্ষী আছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3036,
			"arabicnumber": 3036,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূত্রে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে গ্রামে গিয়ে তোমরা বসবাস করবে এবং যেখানেই তোমরা যাবে, তার অংশ তোমাদের হয়ে যাবে। আর যে গ্রামের লোকেরা আল্লাহ্‌ এবং তাঁর রাসূলকে অস্বীকার করবে, নিশ্চয়ই তার এক-পঞ্চমাংশ আল্লাহ্‌ এবং তাঁর রাসূলের। উক্ত অংশ বের করার পর বাকী অংশ তোমাদের হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3037,
			"arabicnumber": 3037,
			"text": "আব্বাস ইবন আবদুল আযীম (রহঃ) .... উছমান ইবন আবী সুলায়মান (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খালিদ ইবন ওয়ালীদ (রাঃ) কে দুমার শাসক উকায়দারের নিকট প্রেরণ করেন। তখন খালিদ ও তাঁর সঙ্গিরা তাঁকে গ্রেফতার করে তাঁর নিকট নিয়ে আসে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর মৃত্যুদণ্ড মওকূফ করেন এবং জিযিয়া কর দেওয়ার শর্তে তাঁর সাথে সন্ধি করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3038,
			"arabicnumber": 3038,
			"text": "আবদুল্লাহ্‌ ইবন মুহাম্মদ নুফায়লী (রহঃ) ..... মু'আয (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মু'আয (রাঃ)-কে ইয়ামনে প্রেরণ করেন, তখন তাঁকে এরূপ নির্দেশ দেন যে, প্রত্যেক প্রাপ্তবয়স্ক ব্যক্তির নিকট হতে এক দীনার অথবা এক দীনার মূল্যের মু'আফিরী নামক কাপড়, যা ইয়ামনে উৎপন্ন হয় (তা জিযিয়া হিসাবে গ্রহণ করবে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3039,
			"arabicnumber": 3039,
			"text": "নুফায়লী (রহঃ) .... মুয়ায (রাঃ) থেকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূত্রে পূর্বোক্ত হাদীছের অনুরূপ হাদীছ বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3040,
			"arabicnumber": 3040,
			"text": "আব্বাস ইবন আবদিল আযীম (রহঃ) ...... যিয়াদ ইবন জাদীর (রাঃ) থেকে বর্ণিত। আলী (রাঃ) বলেনঃ যদি আমি বেঁচে থাকি, তবে বনূ তাগলীবের যুদ্ধক্ষম নাসারাদের হত্যা করব এবং তাদের সন্তান-সন্ততিদের বন্দী করব। কেননা, তাদের ও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মাঝে যে চুক্তি সম্পাদিত হয়েছিল, তা আমি লিখেছিলাম। যাতে এরূপ শর্ত ছিল যে, তারা তাদের সন্তান-সন্ততিদের সাহায্য করবে না। আবূ দাঊদ (রহঃ) বলেনঃ এ হাদীছটি 'মুনকার' বা অগ্রহনীয়। (তিনি আরো বলেনঃ) আমি জানতে পেরেছি যে, আহমদ ইবন হাম্বল (রহঃ)-ও এ হাদীছটি দৃঢ়ভাবে অস্বীকার করতেন। অন্যদের মতে এ হাদীছটি মাতরুক বা পরিত্যক্ত। লোকেরা এ হাদীছকে মুনকার জেনেছে-আব্দুর রহমান ইবন হানী-এর উপর। রাবী আবূ আলী বলেনঃ আবূ দাঊদ (রহঃ) যখন এ কিতাব শোনান, তখন তাতে এ হাদীছ পড়েননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3041,
			"arabicnumber": 3041,
			"text": "মুসাররিফ ইবন আমর ইয়ামী (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নাজরানের খৃস্টানদের সাথে দু'হাজার জোড়া কাপড়ের বিনিময়ে এ শর্তে সন্ধি করেন যে, তারা এর অর্ধেক কাপড় সফর মাসে মুসলিমদের নিকট হস্তান্তর করবে এবং বাকী অর্ধেক রজব মাসে দেবে। তাছাড়া ত্রিশটি লৌহবর্ম, ত্রিশটি অশ্ব, ত্রিশটি উট এবং সব ধরনের ত্রিশটি যুদ্ধোপকরণ ধারস্বরূপ (মুসলিমদের) প্রদান করবে, যা দিয়ে যুদ্ধ-বিগ্রহ করা হয়। আর মুসলিমরা এ মর্মে যিম্মাদারী গ্রহণ করবে যে, এ সব অস্ত্রশস্ত্র আবার তাদের নিকট ফিরিয়ে দেবে, যদি ইয়ামনে কেউ বিদ্রোহ ঘোষণা করে। তাছাড়া এ শর্তও ছিল যে, তাদের কোন গীর্জা ধ্বংস করা হবে না এবং কোন পাদ্রীকেও বহিষ্কার করা হবে না। আর যতক্ষণ না তারা নতুন কথা বলবে এবং সুদ না খাবে, ততক্ষণ তাদের অভ্যন্তরীণ ব্যাপারে কোনরূপ হস্তক্ষেপ করা হবে না। রাবী ইসমাঈল বলেনঃ পরে তারা সুদ খাওয়া শুরু করে, (ফলে চুক্তি ভংগের কারণে তাদের দেশ থেকে বের করে দেওয়া হয়)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3042,
			"arabicnumber": 3042,
			"text": "আহমদ ইবন সানান ওয়াসিতী (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত যে, যখন পারসিকদের নবী ইনতিকাল করেন, তখন ইবলিস তাদের অগ্নিপূজায় লাগিয়ে দেয় (অর্থাৎ গুমরাহ করে ফেলে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3043,
			"arabicnumber": 3043,
			"text": "মুসাদ্দাদ (রহঃ) .... আবূ শা'ছা (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি জাযা ইবন মু'আবীয়ার লেখক ছিলাম, যিনি আহনাফ ইবন কায়েসের চাচা ছিলেন। একবার উমার (রাঃ)-এর মৃত্যুর এক বছর আগে আমাদের নিকট (তাঁর লিখিত) এ মর্মের পত্র আসে; (যাতে এরূপ নির্দেশ ছিল যে), প্রত্যেক জাদুকরকে হত্যা করবে, অগ্নি-উপাসকদের প্রত্যেক মুহরিম ব্যক্তির সাথে বিবাহিত (তার বোন, খালা ইত্যাদি) কে বিচ্ছিন্ন করে দেবে, আর তাদের গুনগুন শব্দ করা হতে বিরত থাকতে বলবে। তখন একদিনে আমরা তিনজন জাদুকরকে হত্যা করি এবং যে সব অগ্নি-উপাসকের সাথে কোন মুহরিম স্ত্রীলোকের বৈবাহিক সম্পর্ক ছিল, আল্লাহর কিতাব অনুসারে তাদের মাঝের বৈবাহিক সম্পর্ক ছিন্ন করে দেই। রাবী বলেনঃ একদা তিনি (আহনাফ ইবন কায়স) অনেক খাদ্য পাক করে অগ্নি-উপাসকদের ডাকেন এবং তরবারি নিজের রানের উপর রাখেন। তখন তারা খাওয়ার পর কোন রূপ গুনশুন শব্দ করিনি। এরপর তারা এক বা দু'খচ্চরের বোঝা পরিমাণ রৌপ্য প্রদান করেন। আর উমার (রাঃ) অক্ষম অগ্নি-উপাসকদের থেকে জিযিয়া কর গ্রহণ করেননি, যতক্ষণ না আব্দুর রহমান ইবন আওফ (রাঃ) এরূপ সাক্ষ্য প্রদান করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম 'হাজার' নামক স্থানের অগ্নি-উপাসকদের থেকে জিযিয়া কর গ্রহণ করেছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3044,
			"arabicnumber": 3044,
			"text": "মুহাম্মদ ইবন মিসকীন ইয়ামামী (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ হাজার নামক স্থানে বসবাসকারী অগ্নি-উপাসকদের থেকে বাহরায়নের আসবাযিয়্যীন এর জনৈক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে কিছুক্ষণ অপেক্ষা করে। এরপর সে যখন বেরিয়ে আসে, তখন আমি তাকে জিজ্ঞাসা করিঃ আল্লাহ্‌ এবং তাঁর রাসূল তোমাদের ব্যাপারে কী ফয়সালা দিয়েছেন? তখন সে বলেঃ খারাপ ফয়সালা দিয়েছেন। তখন আমি ধমক দিয়ে বলিঃ চুপ থাক। তখন সে বলেঃ (তিনি এরূপ ফয়সালা দিয়েছেন যে), মুসলিম হয়ে যাও, নয়ত কতল করা হবে। রাবী বলেনঃ আব্দুর রহমান ইবন আওফ (রাঃ) বর্ণনা করেছেন যে, তিনি তাদের নিকট হতে জিযিয়া কবূল করেন। ইবন আব্বাস (রাঃ) আরো বলেনঃ লোকেরা আব্দুর রহমান ইবন আওফ (রাঃ)-এর কথার উপর আমল করতে শুরু করে, আর আমি যা আস্‌বাযীর নিকট হতে শুনেছিলাম, তা পরিত্যাগ করে।[1] ১৭০. অনুচ্ছেদঃ জিযিয়া কর আদায়ের ব্যাপারে কঠোরতা আরোপ সম্পর্কে। ৩০৩৪. সুলায়মান ইবন দাঊদ মাহরী (রহঃ) ... উরওয়া ইবন যুবায়র (রাঃ) থেকে বর্ণিত। একদা হিশাম ইবন হাকীম ইবন হাযাম, জনৈক ব্যক্তিকে দেখতে পান, যিনি হিমসের গভর্নর ছিলেন যে, তিনি কয়েকজন কিবতীকে জিযিয়া আদায়ের জন্য রৌদ্রে দাঁড় করিয়ে রেখেছেন। তখন তিনি (হিশাম) জিজ্ঞাসা করেনঃ ব্যাপার কি? আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ নিশ্চয় মহান আল্লাহ্‌ (আখিরাতে) তাদের শাস্তি দিবেন, যারা দুনিয়াতে লোকদের (অকারণে) শাস্তি দেয়। সনদ সহিহ",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3045,
			"arabicnumber": 3045,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3046,
			"arabicnumber": 3046,
			"text": "মুসাদ্দাদ (রহঃ) .... হারব ইবন উবায়দিল্লাহ (রহঃ) তাঁর নানা হতে, তিনি তাঁর পিতা হতে বর্ণনা করেছেন। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ উশর ইয়াহূদ ও নাসারাদের নিকট হতে নিতে হবে এবং মুসলিমদের উপর উশর নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3047,
			"arabicnumber": 3047,
			"text": "মুহাম্মদ ইবন আবদ মুহারিবী (রহঃ) ..... হারব ইবন উবায়দুল্লাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে পূর্বোক্ত হাদীছের অর্থের অনুরূপ হাদীছ বর্ণনা করেছেন, যাতে তিনি 'উশর' শব্দের পরিবর্তে 'খারাজ' শব্দের উল্লেখ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3048,
			"arabicnumber": 3048,
			"text": "মুহাম্মদ ইবন বাশশার (রহঃ) ..... আতা (রহঃ) বাকর ইবন ওয়াইল সম্প্রদায়ের জনৈক ব্যক্তি হতে শ্রবণ করেছেন, যিনি তার মামার নিকট হতে বর্ণনা করেছেন। তিনি বলেনঃ আমি জিজ্ঞাসা করি, ইয়া রাসূলাল্লাহ! আমি কি আমার কওমের নিকট হতে উশর আদায় করব? জবাবে তিনি বলেনঃ উশর তো কেবল ইয়াহূদ ও নাসারাদের (তিজারতী মালের) উপর ধার্য হয়ে থাকে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3049,
			"arabicnumber": 3049,
			"text": "মুহাম্মদ ইবন ইবরাহীম বাযযার (রহঃ) ...... হারব ইবন উবায়দিল্লাহ ইবন উমাইর ছাকাফী তাঁর দাদা থেকে বর্ণনা করেছেন, যিনি বনূ তাগলীবের লোক ছিলেন। তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট হাযির হয়ে ইসলাম কবূল করি এবং তিনি আমাকে ইসলাম সম্পর্কে জ্ঞান দান করেন। আর তিনি আমাকে এ-ও শিক্ষা দেন যে, আমার কওম থেকে যারা ইসলাম কবূল করবে, আমি তাদের নিকট হতে কিরূপে সাদাকা আদায় করব। এরপর আমি তাঁর নিকট ফিরে আসি এবং বলিঃ ইয়া রাসূলাল্লাহ! আপনি আমাকে যা শিখিয়েছিলেন, তা সবই আমার মনে আছে, তবে সাদাকার ব্যাপারটি আমি ভুলে গেছি। আমি কি তাদের নিকট হতে উশর (এক-দশমাংশ) গ্রহণ করব? তিনি বলেনঃ না, বরং উশর তো ইয়াহূদ ও নাসারাদের (তিজারতী মালের জন্য) ধার্যকৃত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3050,
			"arabicnumber": 3050,
			"text": "মুহাম্মদ ইবন ঈসা (রহঃ) ..... ইরবায ইবন সারিয়া সুলামী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে খায়বরে অবতরণ করি, তখন তাঁর সঙ্গে তাঁর অন্যান্য সাহাবীও উপস্থিত ছিলেন। সে সময় খায়বরের নেতা ছিল একজন দুষ্টপ্রকৃতির বিদ্রোহী ব্যক্তি। সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে বলেঃ হে মুহাম্মদ! এটা কি তোমার উচিত যে, তুমি আমাদের গাধাগুলো যবাহ করবে, ফলগুলো খেয়ে ফেলবে এবং আমাদের স্ত্রীদের মারধর করবে? এ কথা শুনে অর্থাৎ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাগান্বিত হন এবং বলেনঃ হে ইবন আওফ! তুমি তোমার ঘোড়ার পিঠে আরোহণ কর এবং এরূপ ঘোষণা করে দাও যে, মুসলিম ছাড়া আর কারো জন্য জান্নাত হালাল নয়। আর তোমরা সালাতের জন্য সমবেত হও। রাবী বলেনঃ তখন সবাই সালাতের জন্য একত্রিত হয় এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের নিয়ে সালাত আদায় করেন। এরপর তিনি দাঁড়ান এবং বলেনঃ তোমাদের কেউ কি তার খাটের উপর হেলান দিয়ে বসে এরূপ ধারণা করছে যে, আল্লাহ্‌ তা'আলা ঐ সমস্ত জিনিস ব্যতীত, যার উল্লেখ কুরআনে আছে, আর কিছুই হারাম করেননি? জেনে রাখ, আল্লাহ্‌র শপথ! আমিও হুকুম দিয়েছি যাতে কিছু করার জন্য নসীহত করেছি এবং কিছু না করার জন্যও নির্দেশ দিয়েছি। এগুলিও কুরআনের আদেশ ও নিষেধের অনুরূপ এমনকি তা থেকেও অতিরিক্ত। (জেনে রাখ,) নিশ্চয় আল্লাহ্‌ তা'আলা তোমাদের জন্য এ বৈধ করেননি যে, তোমরা আহলে কিতাবদের ঘরে তাদের অনুমতি ব্যতীত প্রবেশ করবে, তাদের স্ত্রীদের মারধর করবে এবং তাদের ফলমূল ভক্ষণ করবে। (বস্তুত এ নির্দেশ ততক্ষণ কার্যকর থাকবে), যতক্ষণ তারা তোমাদের (ঐ জিযিয়া প্রদান করবে), যা আদায় করা তাদের উপর ওয়াজিব।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3051,
			"arabicnumber": 3051,
			"text": "মুসাদ্দাদ ও সাঈদ ইবন মানসূর (রহঃ) .... জুহায়না গোত্রের জনৈক ব্যক্তি হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সম্ভবত তোমরা এমন এক কওমের সাথে যুদ্ধ করবে, যাদের উপর তোমরা বিজয়ী হওয়ার পর তারা তোমাদের কিছু মাল দিয়ে নিজেদের এবং নিজেদের সন্তান-সন্ততিদের রক্ষা করবে। রাবী সাঈদ (রহঃ) তাঁর বর্ণিত হাদীছে এরূপ উল্লেখ করেছেন যে, তারা (কিছু মালের বিনিময়ে) তোমাদের সঙ্গে সন্ধি করবে। এরপর উভয় রাবী ঐকমত্যে এরূপ বর্ণনা করেছেনঃ তোমরা তাদের নিকট হতে এর অধিক মাল গ্রহণ করবে না। কেননা, তা তোমাদের জন্য বৈধ নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3052,
			"arabicnumber": 3052,
			"text": "সুলায়মান ইবন দাউদ মাহরী (রহঃ) .... রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীদের কিছু ছেলে তাদের পিতা থেকে বর্ণনা করেছেন, যারা পরস্পর ঘনিষ্ঠ ছিলেন। তাঁরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সূত্রে বর্ণনা করেন যে, তোমাদের যে কেউ কোন যিম্মীর উপর অত্যাচার করবে, বা তার হক নষ্ট করবে, কিংবা তার সামর্থের বাইরে তাকে কষ্ট দিবে, অথবা ইচ্ছার বিরুদ্ধে (জোরপূর্বক) তার কোন জিনিস নিবে, আমি কিয়ামতের দিন তার বিরুদ্ধে মামলা দায়ের করব।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3053,
			"arabicnumber": 3053,
			"text": "আবদুল্লাহ ইবন জাররাহ (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুসলিমদের উপর কোন জিযিয়া কর নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3054,
			"arabicnumber": 3054,
			"text": "মুহাম্মদ ইবন কাছীর (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ কেউ সুফয়ানের নিকট এ হাদীছের ব্যাখ্যা জিজ্ঞাসা করলে তিনি বলেন যে, যখন কোন যিম্মী মুসলিম হয়ে যায়, তখন তার উপর আর কোন জিযিয়া কর নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3055,
			"arabicnumber": 3055,
			"text": "আবূ তাওবা রবী ইবন নাফি (রহঃ) ..... আবদুল্লাহ্‌ হাওযানী (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমার সঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুআয্‌যিন বিলাল (রাঃ) এর হালব শহরে দেখা হয়। তখন আমি তাকে জিজ্ঞাসা করি, হে বিলাল! আপনি আমার কাছে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ভরণ-পোষণের ব্যয় নির্বাহের ব্যবস্থা কিরূপ ছিল, তা বর্ণনা করুন। তখন তিনি বলেনঃ যখন থেকে আল্লাহ্‌ তাঁকে রাসূল হিসাবে প্রেরণ করেন, তখন থেকে তাঁর ইনতিকালের সময় পর্যন্ত তাঁর কাজ-কর্মের ব্যবস্থাপনার দায়িত্ব আমার উপরই ন্যস্ত ছিল। যখনই তাঁর নিকট মুসলিম আসতেন এবং তিনি তাকে বিবস্ত্র অবস্থায় দেখতেন, তখন আমাকে তার ব্যাপারে প্রয়োজনীয় ব্যবস্থা গ্রহণের জন্য নির্দেশ দিতেন। তখন আমি কর্য নিয়ে তার জন্য চাদর খরিদ করে তাকে পরাতাম এবং তাকে খানাও খাওয়াতাম। এমতাবস্থায় একদা জনৈক মুশরিক আমার সঙ্গে সাক্ষাত করে বলে যে, হে বিলাল! আমার কাছে অনেক ধন-দওলত আছে। কাজেই তুমি আমি ব্যতীত আর কারো থেকে ধার নিও না। তখন আমি এরূপ করতে থাকি। এ অবস্থায় একদা আমি উযূ করে যখন আযান দেওয়ার জন্য প্রস্তুত হচ্ছি, তখন আমি দেখতে পাই যে, সে মুশরিক লোকটি একদল ব্যবসায়ী সমভিব্যাহারে আমার দিকে আসছে। সে আমাকে দেখেই বলে উঠলঃ হে হাবশী! আমি বললামঃ বলুন, আমি তো হাযির। সে সময় সে উত্তেজিত হয়ে আমাকে গালমন্দ করতে লাগল এবং বললঃ তোমার কি জানা আছে, মাসের আর কতদিন বাকী আছে? তখন আমি বললামঃ মাস তো প্রায় শেষ। তখন সে বলেঃ তোমার মাস পূর্ণ হতে আর মাত্র চার দিন বাকী আছে। আমি তোমার নিকট হতে আমার পাওনা টাকা আদায় করে ছাড়ব, আর আমি তোমাকে তোমার পূর্বাবস্থায় নিয়ে ছাড়ব, যেরূপ তুমি আগে বকরীর পাল চরাতে। বিলাল (রাঃ) বলেনঃ তার এরূপ কথাবার্তায় আমি মর্মাহত হই, এরূপ ক্ষেত্রে মানুষের যেমন হয়ে থাকে। অবশেষে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈশার সালাত আদায় শেষে যখন স্বগৃহে প্রত্যাবর্তন করলেন, তখন আমি তাঁর নিকট উপস্থিত হওয়ার জন্য অনুমত চাইলাম। তখন তিনি আমাকে তাঁর খিদ্‌মতে হাযির হওয়ার জন্য অনুমতি দেন। আমি তাঁর নিকট আরয করিঃ ইয়া রাসূলুল্লাহ! আমার পিতা-মাতা আপনার জন্য উৎসর্গ হোক, আমি যে মুশরিক ব্যক্তির নিকট হতে ধার নিতাম, সে আমাকে এরূপ এরূপ কথা বলেছে। এখন তো আপনার নিকট এমন কোন ধন-সম্পদ নেই যা দিয়ে আপনি আমার করয পরিশোধ করতে পারেন। আর আমার কাছেও কিছু নেই; ওদিকে সে তো আমাকে বেইযযত করতে চায়। সুতরাং আপনি আমাকে অনুমতি দিন, যাতে আমি পালিয়ে গিয়ে ঐ গোত্রের কোন লোকের নিকট আশ্রয় গ্রহণ করতে পারি, যারা মুসলিম হয়েছে। আর আমি ততদিন এ অবস্থায় থাকব, যতদিন না আল্লাহ্‌ তা'আলা তাঁর রাসূলের জন্য এ পরিমাণ মালের সংস্থান করে দেন, যা দিয়ে আমি আমার করয পরিশোধ করতে পারি। একথা বলে আমি আমার ঘরে ফিরে আসি এবং আমার তরবারি, মোজা, জুতা এবং ঢাল আমার শিয়রে রাখি (যাতে অতি ভোরে আমি চলে যেতে পারি)। এমতাবস্থায় যখন আমি অতি প্রত্যুষে পলায়ন করার জন্য তৈরী হলাম, তখন হঠাৎ দেখতে পাই যে, এক ব্যক্তি দৌড়ে আমার কাছে এসে বললঃ হে বিলাল! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাকে ডাকছেন। তখন আমি তাঁর নিকট উপস্থিত হয়ে দেখতে পাই যে, পিঠে মাল বোঝাই চারটি উট বসে আছে। এরপর আমি তাঁর সঙ্গে সাক্ষাতের অনুমতি চাইলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ (হে বিলাল!) তুমি সুসংবাদ গ্রহণ কর। তোমার করয পরিশোধের জন্য আল্লাহ্‌ তা’আলা এ মাল পাঠিয়ে দিয়েছেন। এরপর তিনি আরো বলেনঃ তুমি কি দেখছ না যে, চারটি মাল-বোঝাই উট বসে আছে? তখন আমি বলিঃ হ্যাঁ দেখছি। এরপর তিনি বলেনঃ এ পশুগুলো এবং এদের পিঠে যে মালামাল আছে, তা সবই তোমার। এতে কাপড় এবং খাদ্যশস্য আছে, যা ফিদাকের বিশিষ্ট ধনী নেতা হাদিয়া-স্বরূপ আমার জন্য পাঠিয়েছে। সুতরাং তুমি এসব বুঝে নাও এবং তোমার যাবতীয় দেনা পরিশোধ কর। বিলাল (রাঃ) বলেনঃ তখন আমি এরূপ করি। অতঃপর পূর্ণ হাদীছ বর্ণনা প্রসঙ্গে বিলাল (রাঃ) বলেনঃ পরে আমি মসজিদে গিয়ে দেখতে পাই যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদে বসে আছেন। তখন আমি তাকে সালাম করলে তিনি জিজ্ঞাসা করেনঃ তুমি যে সম্পদ পেয়েছ তা কি করেছ? তখন আমি বলিঃ মহান আল্লাহ্‌ ঐ সমস্ত দেনাই পরিশোধ করে দিয়েছেন, যা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর ছিল। বস্তুত ঐ দেনার আর কিছুই অবশিষ্ট নেই। তখন তিনি জিজ্ঞাসা করেনঃ ঐ মাল হতে কিছু কি অবশিষ্ট আছে? তখন আমি বলিঃ হ্যাঁ, কিছু মাল অবশিষ্ট আছে। তখন তিনি বলেনঃ আমি এও চাই যে, তুমি অবশিষ্ট মাল হতেও আমাকে চিন্তামুক্ত করবে (অর্থাৎ তা অতি সত্তর বিতরণ করে দেবে)। কেননা, যতক্ষণ না তুমি আমাকে তা হতে চিন্তামুক্ত করবে, ততক্ষণ আমি আমার স্বজনদের কারো কাছে ফিরে যাব না। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার সালাত আদায় শেষে আমাকে ডেকে জিজ্ঞাসা করলেনঃ অবশিষ্ট মাল কি করেছ? তখন আমি বলিঃ তা আমার কাছেই আছে, তা গ্রহণের জন্য কেউ-ই আমার নিকট আসেনি। একথা শুনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে রাত মসজিদেই কাটালেন। এ হাদীছ বর্ণনা প্রসঙ্গে বিলাল (রাঃ) আরো বলেনঃ এরপর দ্বিতীয় দিন ইশার সালাত আদায় শেষে তিনি আমাকে ডেকে জিজ্ঞাসা করলেনঃ যে মাল অবশিষ্ট ছিল, তুমি তা কি করেছ? তখন আমি বলিঃ ইয়া রাসূলাল্লাহ! আল্লাহ্‌ তা'আলা ঐ মাল হতে আপনাকে চিন্তামুক্ত করেছেন। একথা শুনে তিনি তাকবীর (আল্লাহু আকবর) পাঠ করলেন এবং আল্লাহ্‌র প্রশংসা করলেন। এ ভয়ে যেন এরূপ না হয় যে, ঐ মাল তাঁর নিকট থাকে এবং তিনি ইনতিকাল করেন। এরপর তিনি তাঁর গৃহে ফিরে যান এবং আমিও তাঁর পশ্চাতে গমন করি। পরে তিনি তাঁর প্রত্যেক স্ত্রীকে আলাদাভাবে সালাম করেন এবং পরিশেষে নিজের বিশ্রামাগারে প্রবেশ করেন। এ-ই ছিল তার ব্যয় নির্বাহের ঘটনা, যে সম্পর্কে তুমি আমাকে জিজ্ঞাসা করেছ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3056,
			"arabicnumber": 3056,
			"text": "মাহমূদ ইবন খালিদ (রহঃ) .... মু'আবিয়া (রাঃ) আবূ তাওবার সনদে যে হাদীছ বর্ণনা করেছেন, তাতেও এ ঘটনা বিধৃত হয়েছে। তিনি তাঁর বর্ণিত হাদীছে এরূপ ব্যক্ত করেছেনঃ যখন আমি তাঁকে বলি, আমার নিকট এবং আপনার নিকট এত পরিমাণ মাল নেই, যা দিয়ে দেনা পরিশোধ করা যায়, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুপ করে থাকেন। ব্যাপারটি আমার নিকট খুবই অসহনীয় ছিল (কেননা, আমার মনে হচ্ছিল, তিনি আমার কথায় কর্ণপাত করেননি)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3057,
			"arabicnumber": 3057,
			"text": "হারূন ইবন আবদুল্লাহ্‌ (রহঃ) .... ইয়ায ইবন হিমার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট হাদিয়া হিসাবে একটি উট পেশ করি। তখন তিনি আমাকে জিজ্ঞাসা করেনঃ তুমি কি ইসলাম কবূল করেছ? তখন আমি বলিঃ না। এ সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মুশরিকদের নিকট হতে হাদিয়া গ্রহণ করতে আমাকে নিষেধ করা হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3058,
			"arabicnumber": 3058,
			"text": "আমর ইবন মারযূক (রহঃ) .... আল্‌কামা ইবন ওয়াইল (রাঃ) তাঁর পিতা হতে বর্ণনা করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে হাযরামাওতে একখন্ড যমীন বন্দোবস্ত দিয়েছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3059,
			"arabicnumber": 3059,
			"text": "হাফস ইবন আমর (রহঃ) ..... আলকামা ইবন ওয়াইল (রহঃ)-এর সনদে উপরোক্ত হাদীছের অনুরূপ হাদীছ বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3060,
			"arabicnumber": 3060,
			"text": "মুসাদ্দাদ (রহঃ) .... আমর ইবন হুরাইছ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে মদীনাতে ধনুকের সাহায্যে রেখা টেনে একখন্ড যমীন প্রদান করেন এবং তিনি বলেনঃ আমি তোমাকে আরো দেব, আমি তোমাকে আরো দেব।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3061,
			"arabicnumber": 3061,
			"text": "আবদুল্লাহ ইবন মাসলামা (রহঃ) .... রবী'আ ইবন আবী আবদির রহমান (রাঃ) কয়েক ব্যক্তি হতে শ্রবণ করেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফার'আর পার্শ্ববর্তী স্থানে অবস্থিত কিবলিয়া খনিটি বিলাল ইবন হারিছ মুযানীকে বন্দোবস্ত প্রদান করেন। ঐ খনি হতে আজও পর্যন্ত যাকাত ছাড়া আর কিছুই নেওয়া হয় না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3062,
			"arabicnumber": 3062,
			"text": "আব্বাস ইবন মুহাম্মদ ইবন হাতিম (রহঃ) .... কাছীর ইবন আবদিল্লাহ ইবন আমর ইবন আওফ মুযানী (রহঃ) তাঁর পিতা হতে এবং তিনি তাঁর দাদা হতে বর্ণনা করেছেন। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিলাল ইবন হারিছ মুযানীকে কিবলিয়ার উঁচু এবং নীচু খনিটি এবং তার পার্শ্ববর্তী চাষাবাদযোগ্য যমীন বন্দোবস্ত দেন। উপরন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে এরূপ ফরমান লিখে দেনঃ বিসমিল্লাহির রাহমানির রাহীম। এটি ঐ ফরমান, যা মুহাম্মাদুর রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়াসাল্লাম বিলাল ইবন হারিছ মুযানীকে প্রদান করেছেন যে, কিবলিয়ার উঁচু এবং নীচু খনি, এর পার্শ্ববর্তী চাষাবাদযোগ্য যমীন তাঁকে বন্দোবস্ত দেওয়া হলো। এতে আর কোন মুসলিমের হক থাকলো না। রাবী আবূ উওয়ায়স বলেনঃ আমার নিকট বনূ দায়লের আযাদকৃত গোলাম ছাওর ইবন যায়দ-ইকরামা এবং তিনি ইবন আব্বাস (রাঃ) হতে উপরোক্ত হাদীছের অনুরূপ হাদীছ বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3063,
			"arabicnumber": 3063,
			"text": "মুহাম্মদ ইবন নযর (রহঃ) হতে বর্ণিত। তিনি বলেনঃ আমি হুনায়নীকে এরূপ বলতে শুনেছি যে, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বন্দোবস্তু সস্পর্কিত ফরমানটি কয়েকরার পাঠ করেছি। আবূ দাঊদ (রহঃ) বলেনঃ আমার নিকট কয়েক ব্যক্তি হুসায়ন ইবন মুহাম্মদ (রাঃ) এর হাদীছটি বর্ণনা করেছেন। তিনি বলেনঃ আবূ ওয়ায়স আমাকে বলেছেন যে, আমার নিকট কাছীর ইবন আবদিল্লাহ (রাঃ) তাঁর পিতা হতে, তিনি তাঁর দাদা হতে হাদীছ বর্ণনা করেছেন। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিলাল ইবন হারিছ মুযানীকে কিবলিয়ার উঁচু এবং নীচু খনিটি বন্দোবস্ত দেন। ইবন নযর বলেনঃ জুরস এবং যাত-ই-নুসুবের যমীন এবং পবিত্র পাহাড়ের চাষাবাদযোগ্য যমীনও তাঁকে প্রদান করেন। বিলাল ইবন হারিছ কোন মুসলিমকে (এর থেকে) কোন হক প্রদান করতেন না। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে এরূপ ফরমানও লিখে দেনঃ এটি ঐ ফরমান, যা মুহাম্মাদুর রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়াসাল্লাম বিলাল ইবন হারিছ মুযানীকে প্রদান করছেন যে, কিবলিয়ার উঁচু এবং নীচু খনি, তার পার্শ্ববর্তী চাষাবাদযোগ্য যমীন তাঁকে বন্দোবস্ত দেওয়া হলো। এতে আর কোন মুসলিমের হক রইলো না। আবূ উওয়ায়স বলেনঃ আমার নিকট ছাওর ইবন যায়দ-ইকরামা হতে, তিনি ইবন আব্বাস (রাঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ হাদীছ বর্ণনা করেছেন। ইবন নযর এটুকু অতিরিক্ত বর্ণনা করেছেন যে, উক্ত ফরমানটি উবায়্যা ইবন কা'ব (রাঃ) লিখেছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3064,
			"arabicnumber": 3064,
			"text": "কুতায়বা ইবন সা'ঈদ সাকাফী এবং মুহাম্মদ ইবন মুতাওয়াককিল আসকালানী (রহঃ) ..... আবইয়ায ইবন হাম্মাল (রাঃ) থেকে বর্ণিত। তিনি একটি প্রতিনিধিদল নিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হন এবং লবণ খনির কিছু জমি বন্দোবস্ত নেওয়ার জন্য দরখাস্ত করেন। ইবন মুতাওয়াককিল বলেনঃ সেটি মা'আরিব নামক স্থানে অবস্থিত ছিল। তখন তিনি তা তাঁকে প্রদান করেন। যখন তিনি (ইবন হাম্মাল) ফিরে যাচ্ছিলেন, তখন মজলিসের জনৈক ব্যক্তি বলেনঃ আপনি কি অবগত আছেন, কোন যমীন তাকে বন্দোবস্ত দিলেন? আপনি তো তাঁকে এমন যমীন দিলেন, যাতে সব সময় পানি থাকে। রাবী বলেনঃ তখন তিনি তাঁর নিকট হতে সে যমীন ফিরিয়ে নেন। রাবী বলেনঃ আর তিনি তাঁকে জিজ্ঞাসা করেন, পীলু ক্ষেতে বেড়া দিতে হবে কি না? তিনি বলেনঃ বেড়া দিতে হবে, যাতে সেখানে পদচারণা না হতে পারে। ইবন মুতাওয়াককিল বলেনঃ উটের পদচারণা (না হয়)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3065,
			"arabicnumber": 3065,
			"text": "হারুন ইবন আবদিল্লাহ (রহঃ) ..... মুহাম্মদ ইবন হাসান মাখযূমী (রাঃ) থেকে বর্ণিত। (তিনি বলেন): উটের পদচারণা হবে না, এর অর্থ হলো, উট তো গাছের উপরিভাগ খায়, কাজেই তা রক্ষার জন্য তার উপরে বেড়া দিতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3066,
			"arabicnumber": 3066,
			"text": "মুহাম্মদ ইবন আহমদ কুরাশী (রহঃ) .... আবয়ায ইবন হাম্মাল (রাঃ) থেকে বর্ণিত। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট চারণ ভূমির জন্য পীলু বৃক্ষ সংরক্ষণের আবেদন জানান। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ পীলু বৃক্ষে বেড়া দেওয়া সম্ভব নয়। তখন তিনি (ইবন হাম্মাল) বলেনঃ আমার ক্ষেতের পীলু গাছ। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ পীলু বৃক্ষ বেড়া দিয়ে সংরক্ষণ করা যায় না। রাবী ফারাজ বলেনঃ এ পীলু বৃক্ষ দ্বারা ঐ যমীনের গাছের কথা বলা হয়েছে, যা তার ফসলের ক্ষেত্রের চারদিকের সীমানায় লাগান ছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3067,
			"arabicnumber": 3067,
			"text": "উমর ইবন খাত্তাব আবূ হাফস (রহঃ) .... সাখার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছাকীফের উপর জিহাদ পরিচালনা করেন। সাখার (রাঃ) এ খবর শুনে কিছু সৈন্য-সামন্ত নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাযার্থে সেখানে পৌছান। তিনি সেখানে পৌছে দেখতে পান যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছাকীফ গোত্রের অবস্থান দুর্গ জয় না করে ফিরে আসছেন। এ সময় সাখার (রাঃ) মহান আল্লাহ্‌র নিকট এরূপ ওয়াদা করেন এবং তার যিম্মাদারী নেন যে, যতক্ষণ না এ দুর্গের লোকজন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আনুগত্য স্বীকার করে, ততক্ষণ আমি এ দুর্গ পরিত্যাগ করব না (অর্থাৎ অবরোধ করে রাখব)। বস্তুত যতক্ষণ না ঐ দুর্গের লোকজন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর আনুগত্য স্বীকার করলো, ততক্ষণ সাখার (রাঃ) সেখান হতে সরলেন না। অবশেষে সে দুর্গ বিজয়ের পর তিনি তাঁর নিকট এরূপ পত্র লিখেনঃ ইয়া রাসূলুল্লাহ! ছাকীফ গোত্রের লোকেরা আপনার নির্দেশ মত দুর্গ হতে অবতরণ করেছে। এখন আমি তাদের নিকট যাচ্ছি, তাদের কাছে অনেক ঘোড়া আছে। (এ খবর পাওয়ার পর) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সকলকে জামাআতে সালাত আদায়ের জন্য নির্দেশ দেন এবং (সালাত শেষে) দশ বার আহমাস গোত্রের জন্য এরূপ দু'আ করেনঃ ইয়া আল্লাহ্‌! আপনি আহমাসের ঘোড়ায় এবং লোকে বরকত দান করুন। এরপর সাখার (রাঃ) এবং তাঁর সাথীরা তাঁর নিকট আসেন। তখন মুগীরা ইবন শো'বা (রাঃ) বলেনঃ ইয়া নবীয়াল্লাহ! সাখার আমার ফুফীকে বন্দী করেছেন অথচ সে মুসলিম হয়েছে। তখন তিনি তাঁকে ডেকে বলেনঃ হে সাখার! যখন কোন কওম মুসলিম হয়, তখন তাদের জান-মালের হিফাযত করবে। তুমি মুগীরার ফুফীকে তাঁর নিকট ফিরিয়ে দাও। তখন তিনি তাকে (ফুফীকে) তাঁর (মুগীরার) হাতে প্রত্যর্পণ করেন। এরপর তিনি (সাখার) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এরূপ আবেদন করেন যে, বনূ সালীমের একটি পুকুর আছে। তারা ইসলাম পরিত্যাগ করায় তা ছেড়ে চলে গেছে। অতএব, হে আল্লাহ্‌র নবী! আপনি আমাকে এবং আমার কওমকে ঐ পুকুরের নিকট বসবাসের অনুমতি দিন। তখন তিনি বলেনঃ হ্যাঁ, ঠিক আছে। অতঃপর তিনি সেখানে বসবাস করতে থাকেন। অবশেষে বনূ-সালীম ইসলাম গ্রহণ করার পর সাখার (রাঃ)-এর নিকট উপস্থিত হলো এবং তাঁর কাছে তাদের পুকুরটি ফেরত পাওয়ার জন্য আবেদন করল। কিন্তু তিনি তা ফিরিয়ে দিতে অস্বীকার করেন। এরপর তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হয় এবং বলেঃ হে আল্লাহ্‌র নবী! আমরা ইসলাম কবূলের পর সাখারের কাছে গিয়েছিলাম, যাতে তিনি আমাদের পুকুরটি আমাদের ফিরিয়ে দেন। কিন্তু তিনি তা দিতে অস্বীকার করছেন। তখন তিনি তাঁকে (সাখার) ডাকান এবং বলেনঃ হে সাখার! যখন কোন কওম ইসলাম গ্রহণ করে, তখন তাদের জান-মাল নিরাপদ হয়ে যায়। সুতরাং ঐ কওমের পুকুরটি তাদের ফিরিয়ে দাও। তখন তিনি বলেনঃ হ্যাঁ দেব হে আল্লাহর নবী! সাখার বলেনঃ তখন আমি দেখতে পাই যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চেহারার রং লাজ-বিনম্রতার কারণে সাখার (রাঃ) হতে দাসী এবং পুকুর ফিরিয়ে দেওয়ায় পরিবর্তিত হয়ে লালবর্ণ ধারণ করেছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3068,
			"arabicnumber": 3068,
			"text": "সুলায়মান ইবন দাউদ মাহরী (রহঃ) ..... সাবুরা ইবন আবদিল আযীয ইবন রবী জুহানী (রহঃ) তাঁর পিতা হতে, তিনি তাঁর দাদা হতে বর্ণনা করেছেন। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (জুহানিয়াদের এলাকায়) মসজিদের স্থানে একটি গাছের ঝাড়ের নীচে তিন দিন অবস্থান করেন। এরপর সেখান থেকে তিনি তাবুক অভিমুখে যাত্রা করেন। এ সময় জুহায়নারা তাঁর সঙ্গে রাহবা নামক স্থানে সাক্ষাত করে। তখন তাদের জিজ্ঞাসা করেনঃ এখানে কারা বসবাস করে? তারা জওয়াবে বলেঃ জুহায়না সম্প্রদায়ের বনূ রিফা'আ গোত্রের লোকেরা। তখন তিনি বলেনঃ আমি এ যমীন বনূ বিফাআ গোত্রের লোকদের প্রদান করছি। তারা ঐ যমীন হতে স্ব স্ব অংশ বন্টন করে নেয়, যার কিছু অংশ তারা পরবর্তীকালে বিক্রি করে দেয় এবং কিছু লোক তা চাষাবাদ করতে থাকে। রাবী ইবন ওয়াহব বলেনঃ আমি পরে আবদুল আযীযকে এ হাদীছ সম্পর্কে জিজ্ঞাসা করি। তখন তিনি এর কিছু অংশ আমার নিকট বর্ণনা করেন। তিনি পূর্ণ হাদীছটি আমার কাছে বর্ণনা করেন নি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3069,
			"arabicnumber": 3069,
			"text": "হুসায়ন ইবন আলী (রহঃ) .... আসমা বিনত আবূ বকর (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুবায়র (রাঃ)-কে একটি খেজুর বাগান বন্দোবস্ত দেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3070,
			"arabicnumber": 3070,
			"text": "হাফ্‌স ইবন উমর ও মূসা ইবন ইসমাঈল (রহঃ) ..... আবদুল্লাহ্‌ ইবন হাসসান আনবারী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমার নিকট আমার দাদী এবং নানী, যাঁদের যথাক্রমে নাম হলোঃ সাফিয়া এবং দুহায়বা, যারা উলায়বার কন্যা ছিলেন, তাঁরা উভয়ে বর্ণনা করেছেন যে, একদা আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট হাযির হই। তিনি বলেনঃ আমাদের সাথী হারিছ ইবন হাসসান-যিনি বাকর ইবন ওয়াইল গোত্রের তরফ হতে প্রতিনিধিত্ব নিয়ে আসেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসেন। এরপর তিনি তাঁর নিকট নিজে এবং তার কওমের পক্ষ হতে বায়'আত গ্রহণ করেন। অতঃপর তিনি বলেনঃ ইয়া রাসূলাল্লাহ! আপনি আমাদের এবং বনূ তামীম গোত্রের মধ্যকার সীমান্ত 'দুহনা' নামক স্থানকে চিহ্নিত করে দিন, যা অতিক্রম করে মুসাফির এবং সামনে অগ্রগামী ব্যক্তি ব্যতীত, ওদের কেউ-ই যেন আমাদের নিকটে না আসতে পারে। তখন তিনি বলেনঃ হে বৎস! তার জন্য 'দুহনাকে' লিখে দাও। রাবী বলেনঃ যখন আমি দেখতে পাই যে, তিনি 'দুহনা' নামক স্থানটি তাকে দিয়ে দিলেন, তখন আমার খুব দুঃখ হয়। কেননা দুহনা ছিল আমার জন্মভূমি। তখন আমি বলিঃ ইয়া রাসূলুল্লাহ! ঐ ব্যক্তি ইনসাফের ভিওিতে আপনার নিকট সীমানা চিহ্নিত করার জন্য আবেদন করেনি। কেননা দুহনা হলো উট বাঁধার স্থান ও বকরী চরাবার স্থান এবং এর পেছনেই বনূ তামীমের স্ত্রীলোক ও বাচ্চারা বসবাস করে। এতদশ্রবণে তিনি বলেনঃ হে বৎস! একটু অপেক্ষা কর। এ দুর্বল বৃদ্ধা ঠিকই বলেছে। এক মুসলিম অপর মুসলিমের ভাই। তারা একে অপরের পানি ও গাছপালা হতে উপকার নিতে পারে। তাদের উচিত, বিপদের সময় একে অন্যের সাহায্য করা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3071,
			"arabicnumber": 3071,
			"text": "মুহাম্মদ ইবন বাশশার (রহঃ) ..... আসমার ইবন মুয়াররিস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে তাঁর নিকট বায়'আত গ্রহণ করি। তখন তিনি বলেনঃ যে ব্যক্তি এমন কোন পানির (কূপ বা ঝরনা) নিকট পৌছায়, যেখানে তার আগে আর কোন মুসলিম পৌছেনি, সে ব্যক্তি তার মালিক হবে। রাবী বলেনঃ (এ কথা শুনে ) তখন লোকেরা একে অপরকে অতিক্রম করে, দ্রুতগতিতে পানির সন্ধানে বেরিয়ে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3072,
			"arabicnumber": 3072,
			"text": "আহমদ ইবন হাম্বাল (রহঃ) ..... ইবন উমার (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুবাইর (রাঃ)-কে এত পরিমাণ জায়গীর দেন, যতদূর তাঁর ঘোড়া দৌড়ে যেতে পারে। এরপর তিনি তাঁর ঘোড়া দৌড়ান এবং দৌড়ের পর থেমে তাঁর হাতের চাবুক ফেলে দেন। তখন তিনি বলেনঃ যতদূর তাঁর চাবুক গিয়েছে, ততদূর তাঁকে দিয়ে দাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3073,
			"arabicnumber": 3073,
			"text": "মুহাম্মদ ইবন মুছান্না (রহঃ) ..... সাঈদ ইবন যায়দ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেনঃ যে ব্যক্তি কোন অনাবাদী যমীন আবাদ করবে, সে তার মালিক হবে। আর যদি কোন যালিম অন্যের জমিতে গাছ লাগায়, তবে সে তার মালিক হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3074,
			"arabicnumber": 3074,
			"text": "হান্নাদ ইবন সারী (রহঃ) ... উরওয়া (রহঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি কোন অনাবাদী যমীন আবাদ করবে, সে তার মালিক হবে। এরপর তিনি পূর্বোক্ত হাদীছের অনুরূপ হাদীছ বর্ণনা করে বলেনঃ আমার নিকট ঐ ব্যক্তি বর্ণনা করেছেন, যিনি আমার কাছে এ হাদীছটি বর্ণনা করেছেন যে, দু'ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে একটি মামলা পেশ করে। (যা ছিল) এদের এক ব্যক্তি অপর ব্যক্তির যমীনে একটি খেজুর গাছ লাগায়। তখন তিনি এরূপ ফয়সালা দেনঃ জমির মালিক তার যমীন পাবে এবং গাছের মালিক তার গাছ সেখান থেকে উঠিয়ে নিয়ে যাবে। রাবী বলেনঃ এরপর আমি দেখি যে, কুড়াল দিয়ে সে গাছটি কাটা হচ্ছে। কেননা তা বেশ বড় ছিল। পরে তা সেখান হতে সরিয়ে নেওয়া হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3075,
			"arabicnumber": 3075,
			"text": "আহমদ ইবন সাঈদ দারিমী (রহঃ) .... ইবন ইসহাক (রহঃ) হতে উপরোক্ত হাদীছের সনদে ও অর্থে হাদীছ বর্ণনা করা হয়েছে। অবশ্য তিনি বলেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাহাবীদের থেকে জনৈক সাহাবী বর্ণনা করেছেন। রাবী বলেনঃ আমার ধারণা, তিনি হলেন আবূ সাঈদ খুদ্‌রী। তিনি বলেনঃ আমি তাকে কুড়াল দিয়ে গাছের গোড়ায় আঘাত করতে দেখেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3076,
			"arabicnumber": 3076,
			"text": "আহমদ ইবন আবদা আমিলী (রহঃ) .... উরওয়া (রহঃ) হতে বর্ণিত। তিনি বলেনঃ আমি এরূপ সাক্ষ্য দিচ্ছি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফয়সালা দিয়েছেনঃ সমস্ত যমীনই আল্লাহ্‌র এবং বান্দারা সবাই আল্লাহ্‌র বান্দা। কাজেই, যে ব্যক্তি কোন অনাবাদী যমীন আবাদ করবে, সে ব্যক্তি তার মালিক হবে। রাবী বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর এ হাদীছটি আমার নিকট তারা বর্ণনা করেছেন, যারা তাঁর নিকট হতে সালাতের হাদীছ বর্ণনা করেছেন (অর্থাৎ সাহাবাগণ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3077,
			"arabicnumber": 3077,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ..... সামুরা (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেনঃ যে ব্যক্তি কোন অনাবাদী জমির সীমানা চিহ্নিত করবে বা দেওয়াল দিবে, সে তার মালিক হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3078,
			"arabicnumber": 3078,
			"text": "আহমদ ইবন আমর ইবন সারহা (রহঃ) ..... মালিক (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ হিশাম বলেছেনঃ ইরকুয-যালিম বা যবরদখলকারী যালিম ঐ ব্যক্তি, যে অন্যের যমীনে গাছ লাগিয়ে তার মালিক হতে চায়। রাবী বলেনঃ ইরকুয-যালিম হলোঃ অন্যের যমীন হতে কিছু যবরদখল করা, তাতে গর্ত করা এবং না-হক বৃক্ষ রোপণ করা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3079,
			"arabicnumber": 3079,
			"text": "সাহল ইবন বাককার (রহঃ) ...... আবূ হুমায়দ সা'ঈদী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সংগে তাবুকের যুদ্ধে গমন করেছিলাম। যখন তিনি 'ওয়াদিয়ে কুরা' নামক স্থানে পৌছান, তখন তিনি একজন মহিলাকে দেখতে পান, যে তার বাগানে বসা ছিল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সাহাবীদের বলেনঃ এ বাগানে কত ফল আছে, তা তোমরা অনুমান কর। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখানে 'দশ-ওয়াসাক' পরিমাণ ফল আছে বলে অনুমান করেন। পরে তিনি সে মহিলাকে বলেনঃ এ বাগানে কত ফল উৎপন্ন হয়, তুমি তার হিসাব রাখবে। অবশেষে আমরা তাবূক পৌছাই। তখন 'ঈলা' নামক স্থানের নেতা একটা সাদা বর্ণের খচ্চর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে হাদিয়া হিসাবে প্রদান করেন। আর তিনি তাঁকে একটি চাদর দেন এবং তাকে বাহর এলাকার যমীনের লিখিত বন্দোবস্ত প্রদান করেন। রাবী বলেনঃ ফেরার পথে আমরা ওয়াদিয়ে কুরা'তে যখন পৌছাই, তখন তিনি তাকে (সে মহিলাকে) জিজ্ঞাসা করেনঃ তোমার বাগানে কি পরিমাণ ফল উংপন্ন হয়েছে? সে (মহিলা) বলেঃ 'দশ ওয়াসাক' পরিমাণ, যা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আগে অনুমাণ করেছিলেন। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি দ্রুত মদীনায় ফিরে যেতে চাই। কাজেই তোমাদের যে আমার সঙ্গে দ্রুত চলতে চায়, সে যেন দ্রুত করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3080,
			"arabicnumber": 3080,
			"text": "আবদুল ওয়াহিদ ইবন গায়াছ (রহঃ) ..... যয়নব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর চুলে উকুন তালাশ করছিলেন। এ সময় তাঁর নিকট উছমান (রাঃ) এর স্ত্রী ও কয়েকজন মুহাজির মহিলা বসা ছিলেন, যারা তাদের ঘর-বাড়ীর ব্যাপারে অভিযোগ করছিল যে, সেখান বসবাস করতে আমাদের কষ্ট হয় এবং (স্বামীর মৃত্যুর পর) তাদের সেখান হতে বের করে দেওয়া হয়। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ নির্দেশ দেনঃ মুহাজিরদের স্ত্রীরা তাদের ঘরের উত্তরাধিকারী হবে। ফলে, আবদুল্লাহ ইবন মাস'ঊদ (রাঃ)-এর মৃত্যুর পর তাঁর স্ত্রী তাঁর ঐ বাড়ীর উত্তরাধিকারী হন, যা মদীনাতে ছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3081,
			"arabicnumber": 3081,
			"text": "হারুন ইবন মুহাম্মদ (রহঃ) ..... মু'আয (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ যে ব্যক্তি নিজের উপর জিযিয়া কর ধার্য করল, সে ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর তরীকা হতে মুক্ত হয়ে দূরে সরে গেল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 3082,
			"arabicnumber": 3082,
			"text": "হায়ওয়া ইবন শুরায়হ হাযরামী (রহঃ) ..... আবূ দারদা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি জিযিয়া কর দেওয়ার শর্তে কোন যমীন ক্রয় করলো, সে যেন নিজের হিজরতের শর্ত ভংগ করলো। আর যে ব্যক্তি কাফিরের অমর্যাদা তার গর্দান হতে টেনে নিজের গর্দানে পরাল, সে যেন ইসলাম হতে তার পিঠ ফিরিয়ে নিল। রাবী বলেনঃ খালিদ ইবন মা'দান (রহঃ) আমার নিকট হতে এ হাদীছ শ্রবণ করে আমাকে জিজ্ঞাসা করেনঃ শুবায়ব কি তোমার নিকট উক্ত হাদীছ বর্ণনা করেছেন? তখন আমি বলিঃ হ্যাঁ। এরপর তিনি বলেনঃ তুমি যখন তাঁর কাছে যাবে, তখন তাঁকে বলবে, তিনি যেন উক্ত হাদীছ লিখে আমার কাছে পাঠিয়ে দেন। রাবী বলেনঃ অতঃপর শুবায়ব উক্ত হাদীছ খালিদের জন্য লিখে দেন। পরে আমি ফিরে আসলে খালিদ ইবন মা'দান (রহঃ) ঐ কাগজটি আমার নিকট চান। তখন সেটি আমি তাকে প্রদান করি। যখন তিনি তা পাঠ করেন, তখন তিনি তাঁর কাছে যত খারাযী যমীন ছিল, তার সবই ছেড়ে দেন। আবূ দাঊদ (রহঃ) বলেনঃ ইনি ছিলেন ইয়াযীদ ইবন খুমায়র ইয়াযান্নী, তিনি নন, যিনি শোবার ছাত্র ছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 3083,
			"arabicnumber": 3083,
			"text": "ইবন সারহ (রহঃ) ...... সা'ব ইবন জাছছামা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পতিত চারণভূমি আল্লাহ্‌ এবং তাঁর রাসূলের। রাবী ইবন শিহাব বলেনঃ আমি জানতে পেরেছি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম 'নাকী' নামক স্থানে চারণভূমি তৈরী করেছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 3084,
			"arabicnumber": 3084,
			"text": "সা'ঈদ ইবন মানসূর (রহঃ) ..... সা'ব ইবন জাছছামা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম 'নাকী' নামক স্থানে চারণভূমি তৈরী করে বলেছিলেনঃ চারণভূমি কেবল মহান আল্লাহ্‌র-ই (এতে আর কারো মালিকানা নেই)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 3085,
			"arabicnumber": 3085,
			"text": "মুসাদ্দাদ (রহঃ) .... আবূ হুরায়রা (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেনঃ খনিজ দ্রব্য হতে খুমুস (এক-পঞ্চমাংশ) নেওয়া হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 3086,
			"arabicnumber": 3086,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 3087,
			"arabicnumber": 3087,
			"text": "জা'ফর ইবন মুসাফির (রহঃ) ..... যায়াআ' বিনত যুবায়র ইবন আবদিল মুত্তালিব ইবন হাশিম (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ মিকদাদ (রাঃ) প্রকৃতির ডাকে 'নাকীয়ে খাবখাবা' নামক স্থানে গমন করেন। হঠাৎ তিনি দেখতে পান যে, একটা ইঁদুর একটা গর্ত হতে একটা দীনার বের করে আনলো। এরপর সে একটার পর একটা দীনার বের করে আনতে লাগলো, এমনকি সে সতেরটি দীনার বের করে আনে। অবশেষে সে (ইঁদুরটি) একটা লালবর্ণের থলি বের করে আনে, তাতেও একটি দীনার ছিল। সব মিলিয়ে দীনারের সংখ্যা হয় আঠারটি। তখন তিনি (মিকদাদ) তা নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হন এবং তাঁকে বিষয়টি অবহিত করেন। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলেনঃ আপনি এর যাকাত গ্রহণ করুন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে জিজ্ঞাসা করেনঃ তুমি নিজে কি এ সব গর্ত থেকে বের করেছ? তিনি বলেনঃ না। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বলেনঃ আল্লাহ্‌ এতে তোমাকে বরকত দিন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 3088,
			"arabicnumber": 3088,
			"text": "ইয়াহইয়া ইবন মাঈন (রহঃ) ..... আবদুল্লাহ ইবন আমর (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ যখন আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে তায়েফ গমনকালে একটা কবরের পাশ দিয়ে যাচ্ছিলাম, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এ কবরটি 'আবূ রিগাল' নামক জনৈক ব্যক্তির। যে আযাব থেকে নাজাতের আশায় এ হেরেমে বসবাস করত। এরপর সে যখন হেরেম থেকে বের হয়, তখন তাকে আযাবে গ্রেফতার করে, যা তার কওমের উপর এ স্থানে আপতিত হয়েছিল। তাকে এ স্থানে দাফন করা হয়েছে। আর এর নিদর্শন হলোঃ তার সাথে সোনার পাতও এখানে দাফন করা আছে। যদি তোমরা তার কবর খুঁড়ে ফেল, তবে তোমরা তা পেয়ে যাবে। এ খবর শুনে লোকেরা কবরের কাছে গেল এবং সোনার পাত বের করে নিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 161
			}
		}
	]
}