{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"21": "Funerals (Kitab Al-Jana'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3089,
			"arabicnumber": 3089,
			"text": "আবদুল্লাহ্‌ ইবন মুহাম্মদ নুফায়লী (রহঃ) ....... আমের রাম (যিনি খুযর সম্প্রদায়ের লোক ছিলেন) থেকে বর্ণিত। তিনি বলেনঃ আমি আমাদের শহরে ছিলাম। হঠাৎ আমরা কিছু নিশান ও পতাকা দেখতে পাই। তখন আমি জিজ্ঞাসা করিঃ এ সব কি? লোকেরা বলেঃ এ সব রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিশান। তখন আমি তাঁর কাছে আসি। এ সময় তিনি একটি গাছেব নীচে কম্বলের উপর বসা ছিলেন এবং তাঁর সাহাবীরাও চারদিকে উপবিষ্ট ছিলেন। আমিও তাঁদের সঙ্গে সেখানে বসে পড়ি। এ সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিভিন্ন ধরনের অসুখ সম্পর্কে আলোচনা প্রসংগে বলেনঃ যখন কোন মুমিন রোগগ্রস্ত হয়, এরপর আল্লাহ্‌ তাকে রোগমুক্ত করেন, ঐ অসুখ তার বিগত জীবনের গুনাহের জন্য কাফফারা হয়ে যায় এবং তার ভবিষ্যত জীবনের জন্য তা নসীহতস্বরূপ হয়। অপরপক্ষে, যখন কোন মুনাফিক অসুস্থ হওয়ার পর সুস্থ হয়ে উঠে, তার উদাহরণ ঐ উটের ন্যায়, যাকে তার মালিক বেঁধে রাখার পর পুনরায় বন্ধনমুক্ত করে দেয়। অথচ সে জানে না, তাকে কি জন্য বাঁধা হয়েছিল এবং কেন বন্ধনমুক্ত করা হলো। তখন তাঁর পাশের জনৈক ব্যক্তি জিজ্ঞাসা করেঃ ইয়া রাসূলাল্লাহ! অসুখ কি জিনিস? আল্লাহ্‌র শপথ! আমি তো কখনো অসুস্থ হইনি! তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি এখান থেকে উঠে যাও, তুমি আমাদের দলভুক্ত নও। এমতাবস্থায় আমরা যখন তাঁর কাছে উপস্থিত ছিলাম, তখন সেখানে কম্বল পরিহিত জনৈক ব্যক্তি হাযির হয়, যার হাতে কিছু জিনিস ছিল। তখন সে বলেঃ ইয়া রাসূলাল্লাহ! আমি আপনাকে দেখার পর যখন আপনার নিকট আসছিলাম, তখন পথিমধ্যে একটা ঝোপের পাশ দিয়ে অতিক্রম করছিলাম। তখন সেখানে আমি চড়ুই পাখির বাচ্চার কিচিরমিচির শব্দ শুনতে পাই, যাদের ধরে আমি আমার কম্বলের মাঝে রাখি। এ সময় এদের মা এসে আমার মাথার উপর ঘুরতে থাকে। তখন আমি বাচ্চাদের উপর হতে কম্বল সরিয়ে নিলে তৎক্ষণাৎ চড়ুই পাখিটি তার বাচ্চাদের উপর আছড়ে পড়ে। ফলে আমি এদের সকলকে আমার কম্বলের মাঝে জড়িয়ে ফেলি। তখন তিনি বলেনঃ তুমি ওদের এখানে রেখে দাও। তখন আমি ওদের সেখানে রেখে দেই, কিন্তু সে সময়ও ওদের মা বাচ্চার কাছেই ছিল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা কি চড়ুই পাখিটির তার শাবকের প্রতি ভালবাসা দেখে বিস্মিত হয়েছ? তখন তারা বলেনঃ হ্যাঁ, ইয়া রাসূলাল্লাহ! তিনি বলেনঃ ঐ যাতের শপথ! যিনি আমাকে সত্য নবী হিসাবে পাঠিয়েছেন। আল্লাহ্‌ তাঁর বান্দাদের উপর এর চাইতেও বেশী স্নেহশীল, যতটুকু এ পাখি তার বাচ্চাদের প্রতি স্নেহপ্রবণ। তুমি এদের সেখানে রেখে এস, যেখান থেকে তাদের নিয়ে এসেছ এবং ওদের মাতাকেও রেখে এসো। এরপর তিনি তাদের (বাসায়) ফেরত দিয়ে আসেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3090,
			"arabicnumber": 3090,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3091,
			"arabicnumber": 3091,
			"text": "মুহাম্মদ ইবন ঈসা ও মুসাদ্দাদ (রহঃ) .... আবূ মূসা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বহুবার এরূপ বলতে শুনেছিঃ যখন কোন ব্যক্তি কোন নেক কাজ করে, কিন্তু অসুখ বা সফরের কারণে তা আদায়ে অক্ষম হয়, তখন তার জন্য ঐ পরিমাণ নেকী লেখা হয়, যে পরিমাণ নেকী তার সুস্থতার সময় বা বাড়ীতে থাকার সময় নেক কাজ করার পরিবর্তে লেখা হতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3092,
			"arabicnumber": 3092,
			"text": "সাহল ইবন বাককার (রহঃ) .... উম্মু আলা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একদা আমি অসুস্থ হয়ে পড়লে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার সেবা-শুশ্রূষা করতে এসে বলেনঃ হে উম্মু আলা! তুমি সুসংবাদ গ্রহণ কর। কেননা, মুসলিমদের অসুখের দ্বারা আল্লাহ্‌ তাদের গুনাহ তেমনি দূর করে দেন, যেমনি অগ্নি সোনা-রুপার মরিচা দূর করে দেয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3093,
			"arabicnumber": 3093,
			"text": "মুসাদ্দাদ (রহঃ) ..... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি জিজ্ঞাসা করি, ইয়া রাসূলাল্লাহ! আমি কুরআনের সব চাইতে কঠিন আয়াত সম্পর্কে অবহিত আছি। তখন তিনি জিজ্ঞাসা করেনঃ হে আইশা! তা কোন আয়াত? তিনি বলেনঃ তা আল্লাহ্‌র এ বাণীঃ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ অর্থাৎ যে ব্যক্তি কোন খারাপ কাজ করবে, তাকে এর বিনিময় দেওয়া হবে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হে আইশা! তুমি কি এ অবগত নও যে, যখন কোন মুসলিমের উপর কোন বিপদ আসে, বা সে কাঁটাবিদ্ধ হয়, তখন তা তার বদ-আমলের জন্য কাফফারা স্বরূপ হয়ে যায়? অবশ্য যার হিসাব (কিয়ামতের দিন) নেওয়া হবে, তাকে আযাব দেওয়া হবে। তখন আমি জিজ্ঞাসা করিঃ আল্লাহ্‌ কি এরূপ বলেন নিঃ فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا অচিরেই সহজভাবে হিসাব নেওয়া হবে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হে আইাশা! এর অর্থ হলোঃ আমল পেশ করে দেওয়া। অবশ্য যার হিসাব গ্রহণের ব্যাপারে কঠোরতা অবলম্বন করা হবে, তাকে অবশ্যই আযাব দেওয়া হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3094,
			"arabicnumber": 3094,
			"text": "আবদুল আযীয ইবন ইয়াহ্‌ইয়া (রহঃ) ...... উসামা ইবন যায়দ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবদুল্লাহ্‌ ইবন উবাই (মুনাফিক) কে মৃত্যু শয্যায় তাকে দেখার জন্য গমন করেন। তিনি যখন তার নিকট প্রবেশ করেন, তখন তিনি তার মাঝে মুত্যুর আলামত দেখে বলেনঃ আমি তোমাকে ইয়াহূদীদের সাথে মহব্বত রাখতে নিষেধ করতাম! তখন সে বলেঃ আস'আদ ইবন যুরারা তাদের সাথে শত্রুতা পোষণ করে কি পেয়েছে? সেও তো মারা গেছে। আর সে মারা গেলে, তার ছেলে (যিনি খাঁটি মু'মিন ছিলেন) তাঁর নিকট এসে বলেঃ হে আল্লাহ্‌র নবী! আবদুল্লাহ ইবন উবাই মারা গেছে। সুতরাং আপনি আপনার জামাটা আমাকে দিন, যা দিয়ে আমি তার কাফন দিতে পারি। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জামা খুলে তাঁকে প্রদান করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3095,
			"arabicnumber": 3095,
			"text": "সুলায়মান ইবন হারব (রহঃ) ..... আনাস (রাঃ) থেকে বর্ণিত যে, একবার এক ইয়াহূদীর ছেলে রোগাক্রান্ত হলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে দেখতে যান। তিনি তার শিয়রে বসে বলেনঃ তুমি ইসলাম কবূল কর। তখন ছেলেটি তার পিতার দিকে তাকায়, যে তার শিয়রে বসা ছিল। তখন তার পিতা তাকে বলেঃ তুমি আবুল কাসিমের আনুগত্য স্বীকার করে নাও। তখন ছেলেটি ইসলাম কবূল করে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ বলতে বলতে দাঁড়ানঃ সব প্রশংসা আল্লাহ্‌রই, যিনি আমার কারণে তাকে দোযখের আগুন হতে মুক্তি দিয়েছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3096,
			"arabicnumber": 3096,
			"text": "আহমদ ইবন হাম্বল (রহঃ) .... জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার রোগাক্রান্ত হওয়ার সময় আমাকে দেখতে আসতেন। এ সময় তিনি খচ্চর বা তুর্কী ঘোড়ায় সওয়ার হয়ে আসতেন না, বরং পায়ে হেঁটে আসতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3097,
			"arabicnumber": 3097,
			"text": "মুহাম্মদ ইবন আওফ তাঈ (রহঃ) ..... আনাস ইবন মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি ভালভাবে উযূ করে সওয়াবের নিয়্যতে তার রোগগ্রস্ত মুসলিম ভাইকে দেখতে যাবে, তাকে জাহান্নাম হতে ৭০ খারীফ দূরে রাখা হবে। রাবী বলেনঃ আমি আবূ হামযাকে জিজ্ঞাসা করলামঃ খারীফ কি? তিনি বললেনঃ এর অর্থ হলো এক বছর। আবূ দাউদ বলেন, বসরাবাসীরা ব্যতীত উযূ অবস্থায় রোগী দেখতে যাওয়ার প্রবক্তা কেউ নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3098,
			"arabicnumber": 3098,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) .... আলী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ যদি কোন ব্যক্তি সন্ধ্যা বেলা কোন রোগগ্রস্ত ব্যক্তিকে দেখতে যায়, তবে তার সঙ্গে সত্তর হাজার ফেরেশ্‌তা নির্গত হয়, যারা তার জন্য সকাল পর্যন্ত মাগফিরাত কামনা করতে থাকে এবং বেহেশতে তার জন্য একটি বাগান নির্ধারিত করা হয়। আর যে ব্যক্তি সকাল বেলা কোন রোগাক্রান্ত ব্যক্তিকে দেখতে যায়, তার সংগেও সত্তর হাজার ফেরেশতা বের হয়, যারা সন্ধ্যা পর্যন্ত তার জন্য মাগফিরাত কামনা করতে থাকে এবং বেহেশতে তার জন্য একটি বাগান নির্ধারিত করা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3099,
			"arabicnumber": 3099,
			"text": "উসমান ইবন আবী শায়বা (রহঃ) ..... আলী (রাঃ) থেকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূত্রে উপরোক্ত হাদীছের অর্থে হাদীছ বর্ণনা করেছেন। এতে 'খারীফের' কথা উল্লেখ নেই। আবূ দাঊদ (রহঃ) বলেনঃ মানসূর হাকাম থেকে এ রিওয়ায়াত এভাবে বর্ণনা করেছেন, যেমন শু'বা বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3100,
			"arabicnumber": 3100,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3101,
			"arabicnumber": 3101,
			"text": "উসমান ইবন আবী শায়বা (রহঃ) ..... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ যখন সা'দ ইবন মু'আয (রাঃ) খন্দকের যুদ্ধে জনৈক ব্যক্তির তীরের আঘাতে আহত হয়েছিলেন, যা তাঁর হাতের শিরায় বিদ্ধ হয়েছিল, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জন্য মসজিদে (নববীতে) একটা তাঁবু খাটিয়ে দিয়েছিলেন, যাতে তিনি নিকটে থেকে বারবার তাঁর দেখাশুনা করতে পারেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3102,
			"arabicnumber": 3102,
			"text": "আবদুল্লাহ ইবন মুহাম্মদ নুফায়লী (রহঃ) ..... যায়দ ইবন আরকাম (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার দু'চোখ উঠে বেদনা হলে দেখার জন্য এসেছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3103,
			"arabicnumber": 3103,
			"text": "আল-কা'নবী (রহঃ) ..... আবদুর রহমান ইবন আওফ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, যখন তোমরা কোন স্থানে মহামারীর খবর পাও, তখন সেখানে যাবে না। আর যখন তোমাদের বসতি এলাকায় মহামারীর প্রকোপ দেখা দেয়, তখন তা হতে রক্ষা পাওয়ার জন্য অন্যত্র গমন করবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3104,
			"arabicnumber": 3104,
			"text": "হারূন ইবন আবদিল্লাহ (রহঃ) .... আইশা বিনত সা’দ (রাঃ) থেকে বর্ণিত। তাঁর পিতা বর্ণনা করেছেনঃ মক্কাতে আমি অসুস্থ হয়ে পড়লে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে দেখতে আসেন এবং তাঁর পবিত্র হাত আমার কপালের উপর রাখেন। এরপর তিনি দু’আ করেনঃ ইয়া আল্লাহ্‌! আপনি সা’দকে রোগমুক্ত করুন এবং তাঁর হিজরত পূর্ণ করুন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3105,
			"arabicnumber": 3105,
			"text": "ইবন কাছীর (রহঃ) ...... আবূ মূসা আশ'আরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা ক্ষুধার্তকে আহার করাবে, রোগীর খোঁজ-খবর নেবে এবং কয়েদীকে মুক্ত করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3106,
			"arabicnumber": 3106,
			"text": "রাবী ইবন ইয়াহইয়া (রহঃ) .... ইবন আব্বাস (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেনঃ যে ব্যক্তি এমন কোন রোগীকে দেখতে যায়, যার মৃত্যুর সময় উপস্থিত হয়নি, সে যেন তার নিকট বসে এ দু’আটি সাতবার পাঠ করেঃ أَسْأَلُ اللَّهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ অর্থাৎ আমি মহান আল্লাহ্‌র নিকটে দু’আ করছি, যিনি মহান আরশের অধিপতি, যেন তিনি তোমাকে রোগমুক্ত করেন। এ দু'আর ফলে অবশ্যই আল্লাহ্‌ তাকে রোগমুক্ত করবেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3107,
			"arabicnumber": 3107,
			"text": "ইয়াযীদ ইবন খালিদ ইবন রামলী (রহঃ) ..... ইবন আমর (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন কোন ব্যক্তি কোন রোগীকে দেখতে যায়, তখন সে যেন এ দু'আ পাঠ করেঃ اللَّهُمَّ اشْفِ عَبْدَكَ يَنْكَأُ لَكَ عَدُوًّا أَوْ يَمْشِي لَكَ إِلَى جَنَازَةٍ অর্থাৎ ইয়া আল্লাহ্‌! আপনি আপনার বান্দাকে রোগমুক্ত করুন, যে আপনার দুশমনকে যখম করবে এবং আপনার সন্তুষ্টি লাভের জন্য কোন (মৃতের) জানাযার সাথে চলবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3108,
			"arabicnumber": 3108,
			"text": "বিশর ইবন হিলাল (রহঃ) .... আনাস ইবন মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যেন কোন কষ্টের কারণে মৃত্যুর জন্য দু’আ না করে; বরং সে যেন এরূপ দু'আ করেঃ اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي অর্থাৎ ইয়া আল্লাহ্‌! আমাকে ততদিন জীবিত রাখুন, যতদিন জীবিত থাকা আমার জন্য কল্যাণকর হয় এবং আমাকে তখন মৃত্যু দান করুন, যখন তা আমার জন্য মঙ্গলময় হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3109,
			"arabicnumber": 3109,
			"text": "মুহাম্মদ ইবন বাশশার (রহঃ) ..... আনাস ইবন মালিক (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যেন মৃত্যুর আকাংখা না করে। অতঃপর পূর্বোক্ত হাদীছের অনুরূপ বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3110,
			"arabicnumber": 3110,
			"text": "মুসাদ্দাদ (রহঃ) ..... উবায়দ ইবন খালিদ সালামী (রাঃ) থেকে বর্ণিত, যিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জনৈক সাহাবী ছিলেন। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হঠাৎ মারা যাওয়া আল্লাহ্‌র গযবের পাকড়াও স্বরূপ, (যাতে সে তওবার সুযোগ না পায়)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3111,
			"arabicnumber": 3111,
			"text": "আল-কা'নবী (রহঃ) ..... জাবির ইবন আতীক (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবদুল্লাহ্‌ ইবন ছাবিত (রাঃ)-এর রোগের খোঁজ-খবর নেওয়ার জন্য আসেন। এ সময় তিনি তাঁকে বেহুশ অবস্থায় পান। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে জোরে ডাকেন, কিন্তু তিনি কোন জওয়াব দেননি। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম 'ইন্না লিল্লাহে ওয়া ইন্না ইলায়হি রাজিঊন' পাঠ করেন এবং বলেনঃ হে আবূ রাবী! আমি তোমার ব্যাপারে পরাস্ত হয়েছি। এ কথা শুনে মহিলারা চীৎকার দিয়ে কাঁদা শুরু করে। তখন ইবন আতীক (রাঃ) তাদের শান্ত হতে বলেন। এমতাবস্থায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তাদের ছেড়ে দাও, (অর্থাৎ কাঁদতে দাও)। অবশ্য যখন ওয়াজিব হবে, তখন যেন কোন ক্রন্দনকারী আর না কাঁদে। তখন তারা জিজ্ঞাসা করেনঃ ইয়া রাসূলাল্লাহ! ওয়াজিব হওয়ার অর্থ কি? তিনি বলেনঃ মৃত্যু। (রাবী বলেনঃ) তখন আবদুল্লাহ্‌ ইবন ছাবিত (রাঃ)-এর কন্যা বললঃ আল্লাহ্‌র শপথ! আমার তো এরূপ ধারণা ছিল যে, তুমি শহীদ হবে। কেননা, তুমি যুদ্ধের জন্য যাবতীয় সরঞ্জাম সংগ্রহ করছিলে। একথা শুনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ নিশ্চয় আল্লাহ্‌ তাকে তার নিয়্যতের ছাওয়াব প্রদান করবেন। তোমরা শাহাদত বলতে কি মনে কর? তিনি বলেনঃ আল্লাহ্‌র রাস্তায় কতল হয়ে যাওয়াকে। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ্‌র রাস্তায় শহীদ হওয়া ছাড়াও আরো সাত ধরনের শহীদ আছে যথাঃ (১) মহামরীতে মৃত্যু বরণকারীও শহীদ; (২) পানিতে ডুবে মৃত্যু বরণকারীও শহীদ; (৩) পক্ষাঘাতে মৃত্যু বরণকারীও শহীদ; (৪) পেটের রোগের কারণে (কলেরা, ডায়রিয়া ইত্যাদিতে) মৃত্যু বরণকারীও শহীদ; (৫) অগ্নিদগ্ধ হয়ে মৃত্যু বরণকারীও শহীদ; (৬) কোন কিছুর নীচে চাপা পড়ে মৃত্যু বরণকারীও শহীদ এবং (৭) যে মহিলা গর্ভাবস্থায় মারা যাবে, সেও শহীদ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3112,
			"arabicnumber": 3112,
			"text": "মূসা ইবন ইসমাঈল (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ বনূ-হারিছ ইবন আমির ইবন নওফল খুবায়ব (রাঃ) কে ক্রয় করেন। আর খুবায়ব (রাঃ) হারিছ ইবন আমিরকে বদরের যুদ্ধে হত্যা করেন। এরপর (ঘটনাক্রমে) যুবায়ব (রাঃ) তাদের হাতে বন্দী হন, তখন তারা তাকে হত্যা করার জন্য একত্রিত হয়। তখন খুবায়ব (রাঃ) হারিছের কন্যার কাছে তার লজ্জাস্থানের লোম পরিষ্কার করার জন্য একখানা ক্ষুর চান। তখন সে (মহিলা) তাঁকে একখানা ক্ষুর প্রদান করে। সে সময় সে মহিলার এক বাচ্চা খুবায়ব (রাঃ)-এর কাছে গিয়ে পৌছায়, যার সম্পর্কে তার মাতা গাফিল ছিল। যখন সে মহিলা এসে দেখল যে, সে বাচ্চাটি যুবায়ব (রাঃ)-এর জানুর উপর বসে আছে এবং যুবায়ব (রাঃ) এর হাতে ক্ষুর ও আছে, তখন সে ভীত-সন্ত্রন্ত হয়ে উঠে। যা খুবায়ব (রাঃ) অনুধাবন করতে পারেন। তখন তিনি বলেনঃ তুমি কি এরূপ ধারণা করছ যে, আমি তাকে হত্যা করে ফেলব? আমি কখনই এরূপ করব না। আবূ দাউদ (রাঃ) বলেনঃ এ ঘটনাটি শুআয়ব ইবন আবী হামযা (রহঃ) যুহরী (রহঃ) হতে বর্ণনা করেছেন। তিনি বলেনঃ আমার কাছে আবদুল্লাহ ইবন ইয়ায (রহঃ) বর্ণনা করেছেন যে, হারিছের কন্যা তার কাছে এরূপ বলেছেনঃ যখন তারা তাকে (খুবায়ব (রাঃ)-কে) হত্যার জন্য একত্রিত হয়, তখন তিনি তার কাছে স্বীয় লজ্জাস্থানের পশম পরিষ্কার করার জন্য একখানা ক্ষুর চান। যা সে (মহিলা) তাঁকে দিয়েছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3113,
			"arabicnumber": 3113,
			"text": "মুসাদ্দাদ (রহঃ) .... জাবির ইবন আবদিল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে তাঁর মৃত্যুর তিন দিন পূর্বে এরূপ বলতে শুনেছি, তিনি বলেনঃ তোমাদের সকলের উচিত আল্লাহ্‌ সম্পর্কে ভাল ধারণা পোষণ করা (অর্থাৎ তাঁর রহমত ও মাগফিরাত কামনা করা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3114,
			"arabicnumber": 3114,
			"text": "হাসান ইবন আলী (রহঃ) ..... আবূ সাঈদ খুদরী (রহঃ) থেকে বর্ণিত। যখন তাঁর মৃত্যুর সময় উপস্থিত হয়, তখন তিনি নতুন বস্ত্র চেয়ে নিয়ে তা পরিধান করেন এবং বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এরূপ বলতে শুনেছি যে, মৃত ব্যক্তিকে ঐ কাপড়ে (কবর হতে) উঠানো হবে, যে কাপড়ে সে মারা যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3115,
			"arabicnumber": 3115,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) .... উম্মু সালামা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা কোন মৃত্যুবরণকারী ব্যক্তির নিকট উপস্থিত হবে, তখন ভাল কথাবার্তা বলবে। কেননা, তোমাদের কথার সমর্থনে ফেরেশতারা আমীন বলেন। এরপর আবূ সালামা (রাঃ) যখন ইনতিকাল করেন, তখন আমি বলিঃ ইয়া রাসূলুল্লাহ! আমি (এখন) কি বলব? তখন তিনি বলেনঃ তুমি বলঃ اللَّهُمَّ اغْفِرْ لَهُ وَأَعْقِبْنَا عُقْبَى صَالِحَةً অর্থাৎ ইয়া আল্লাহ্‌! আপনি একে ক্ষমা করুন এবং আমাদের উত্তম প্রতিদান প্রদান করুন। উম্মু সালাম (রাঃ) বলেনঃ আল্লাহ্‌ আমাকে এর বিনিময়ে মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে প্রদান করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3116,
			"arabicnumber": 3116,
			"text": "মালিক ইবন আবদিল ওয়াহিদ মাসমাঈ (রহঃ) .... মুআয ইবন জাবাল (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তির সর্বশেষ কালিমা (কথা) হবে, লা-ইলাহা ইল্লাল্লাহু, সে জান্নাতে প্রবেশ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3117,
			"arabicnumber": 3117,
			"text": "মুসাদ্দাদ (রহঃ) ..... আবূ সাঈদ খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা তোমাদের মৃত্যুপথযাত্রীকে কালিমার তালকীন দিবেন (অর্থাৎ তার কানের কাছে আস্তে আস্তে 'লা-ইলাহা ইল্লাল্লাহু' পাঠ করতে থাকবে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3118,
			"arabicnumber": 3118,
			"text": "আব্দুল মালিক ইবন হাবীব আবূ মারওয়ান (রহঃ) ..... উম্মু সালামা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আবূ সালামা (রাঃ)-এর মৃত্যুর সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর নিকট হাযির হন। এ সময় তাঁর চোখ খোলা ছিল। তিনি তাঁর চোখ বন্ধ করে দেন। এ দেখে তাঁর পরিবার-পরিজন চীৎকার দিয়ে কাঁদতে থাকে। তখন তিনি বলেনঃ তোমরা তোমাদের ক্রন্দনের মাঝে তার জন্য (মৃতের) কল্যাণ ছাড়া আর কিছুই চাবে না। কেননা, ফেরেশতারা তোমাদের কথার সমর্থনে 'আমীন' বলে থাকেন। এরপর তিনি বলেনঃ اللَّهُمَّ اغْفِرْ لأَبِي سَلَمَةَ وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّينَ وَاخْلُفْهُ فِي عَقِبِهِ فِي الْغَابِرِينَ وَاغْفِرْ لَنَا وَلَهُ رَبَّ الْعَالَمِينَ اللَّهُمَّ افْسَحْ لَهُ فِي قَبْرِهِ وَنَوِّرْ لَهُ فِيهِ অর্থাৎ ইয়া আল্লাহ্‌! আপনি আবূ সালামাকে মাফ করে দিন এবং তাঁর মর্যাদা, যারা হিদায়াতপ্রাপ্ত হয়েছে, তাদের ন্যায় সমুন্নত করুন। তাঁর পরিবার-পরিজন, যারা তাঁর পশ্চাতে আছে, আপনি তাদের যিম্মাদারী গ্রহণ করুন। হে সারা জাহানের রব! আপনি আমাদের এবং একে ক্ষমা করুন। ইয়া আল্লাহ্‌! আপনি তাঁর জন্য তাঁর কবরকে প্রশস্ত করে দিন এবং তা তাঁর জন্য আলোকিত করুন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3119,
			"arabicnumber": 3119,
			"text": "মূসা ইবন ইসমাঈল (রহঃ) .... উম্মু সালামা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমাদের কারো উপর কোন বিপদ আসে, তখন এরূপ বলবেঃ إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ ‏ اللَّهُمَّ عِنْدَكَ أَحْتَسِبُ مُصِيبَتِي فَآجِرْنِي فِيهَا وَأَبْدِلْ لِي خَيْرًا مِنْهَا অর্থাৎ আমরা আল্লাহ্‌রই জন্য এবং আমরা অবশ্যই তাঁর দিকে প্রত্যাবর্তনকারী। ইয়া আল্লাহ্‌! আমি আমার মুসীবত তোমারই কাছে পেশ করছি। তুমি আমাকে এর ছাওয়াব দান কর এবং এর বিনিময়ে আমাকে উত্তম প্রতিফল প্রদান কর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3120,
			"arabicnumber": 3120,
			"text": "আহমদ ইবন হাম্বল (রহঃ) .... আইশা (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ইন্তিকালের পর তাঁর দেহ মুবারক ইয়ামনের তৈরী চাদর দিয়ে আবৃত করা হয়েছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3121,
			"arabicnumber": 3121,
			"text": "মুহাম্মদ ইবন আলা ও মুহাম্মদ ইবন মাক্কী (রহঃ) ..... মা'কাল ইবন ইয়াসার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা তোমাদের মৃত্যু বরণকারী ব্যক্তির নিকট 'সূরা ইয়াসীন' পাঠ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3122,
			"arabicnumber": 3122,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) ...... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ যখন যায়দ ইবন হারীছ (রাঃ) জা'ফর এবং আবদুল্লাহ ইবন রাওয়াহা (রাঃ) শহীদ হন, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ খবর জানার পর মসজিদে গিয়ে বসেন। তখন তাঁর চেহারা মুবারকে বিষাদের চিহ্ন দেখা দেয়। এরপর অবশিষ্ট ঘটনা বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3123,
			"arabicnumber": 3123,
			"text": "ইয়াযীদ ইবন খলিদ ইবন আবদিল্লাহ ইবন মাওহাব হামদানী (রহঃ) ..... আবদুল্লাহ ইবন আমর ইবন আস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে থেকে জনৈক মৃত ব্যক্তিকে দাফন করি। আমরা দাফনের কাজ সম্পন্ন করলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফিরে আসেন এবং আমরও তাঁর সংগে ফিরে আসি। এরপর তিনি মৃত ব্যক্তির বাড়ীর দরওয়াযার নিকট পৌছে দাঁড়িয়ে যান। হঠাৎ আমরা সামনের দিক থেকে জনৈক মহিলাকে আসতে দেখি। রাবী বলেনঃ আমার ধারণা, তিনি তাকে চিনতে পারলেন। সে মহিলা চলে যাওয়ার পর জানা গেল যে, তিনি ছিলেন ফাতিমা (রাঃ)। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে জিজ্ঞাসা করেনঃ কিসে তোমাকে তোমার ঘর থেকে বের করে এনেছে? তিনি বললেনঃ ইয়া রাসূলাল্লাহ! আমি এ মৃত ব্যক্তির পরিবারদের কাছে এ জন্য গিয়েছিলাম যে, আমি তাদের সান্ত্বনা দেব এবং তাদের সাথে শোকে অংশ গ্রহণ করব। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে জিজ্ঞাসা কর, সম্ভবত তুমি তাদের সঙ্গে কবরস্থানেও গিয়েছিলে? এর জওয়াবে ফাতিমা (রাঃ) বলেনঃ আল্লাহ পানাহ! আমি তো আপনার কাছ থেকে মহিলাদের কবরস্থানে যাওয়ার নিষেধাজ্ঞা শ্রবণ করেছি। তখন তিনি বলেনঃ যদি তুমি তাদের সংগে যেতে, (তবে এর পরিণতি খারাপ হতো)। এরপর তিনি এ সম্পর্কে আরো কঠোর বক্তব্য পেশ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3124,
			"arabicnumber": 3124,
			"text": "মুহাম্মদ ইবন মুছান্না (রহঃ) ..... আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন একজন মহিলার কাছে গেলেন, যে তার বাচ্চার শোকে ক্রন্দন করছিল। তখন তিনি তাকে বললেনঃ তুমি আল্লাহ্‌কে ভয় কর এবং সবর কর। সে মহিলা বলেঃ আপনি তো আমার মত মুসীবতে পতিত হননি। তখন তাকে বলা হলোঃ ইনি তো নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! তখন সে মহিলা তাঁর নিকট উপস্থিত হলো এবং তাঁর দরওয়াযায় কোন দারোয়ান পেল না। এরপর সে বলেঃ ইয়া রাসূলাল্লাহ! আমি তো আপনাকে চিনতে পারিনি, (কাজেই আমার বেয়াদবী নেবেন না)। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ দুঃখ-বেদনা শুরু হলে অথবা শোকের প্রথম হতে সবর করা প্রয়োজন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3125,
			"arabicnumber": 3125,
			"text": "আবূ ওলীদ তিয়ালিসী (রহঃ) ..... উসামা ইবন যায়দ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কন্যা (যয়নব) এক ব্যক্তিকে তাঁর নিকট প্রেরণ করেন। এ সময় আমি, সা'দ এবং আমার ধারণা আমার পিতাও তাঁর নিকট উপস্থিত ছিলেন। যয়নব (রাঃ) বলে পাঠান যে, আমার ছেলে বা মেয়ে মৃত্যু যন্ত্রণায় কষ্ট পাচ্ছে। আমরা সবাই তাঁর কাছে হাযির হই। অতঃপর তিনি তাঁকে সালাম পৌছান এবং দূতকে এরূপ বলতে বলেনঃ যা কিছু আল্লাহ্‌ নিয়ে নেন, তা তাঁর এবং তিনি যা কিছু প্রদান করেন তাও তাঁর। তাঁর (আল্লাহ্‌র) নিকট প্রত্যেক জিনিসের জন্য একটা সময়কাল নির্ধারিত আছে। অতঃপর যয়নব (রাঃ) শপথ পূর্বক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আহবান করেন। তখন তিনি তার নিকট উপস্থিত হলে যয়নব (রাঃ) বাচ্চাকে তার কোলে সমর্পণ করেন। এ সময় বাচ্চার মৃত্যু-কষ্ট হাচ্ছিল, যা দেখে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চোখ থেকে পানি বেরিয়ে আসে। তখন সা’দ (রাঃ) জিজ্ঞাসা করেনঃ এটা কি? তিনি বললেনঃ এতো রহমত, আল্লাহ্‌ যার অন্তরে চেয়েছেন এ রহমত রেখে দিয়েছেন। আর আল্লাহ্‌ তাঁর বান্দাদের মাঝে যারা দয়ালু, তিনি তাদের প্রতি রহম করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3126,
			"arabicnumber": 3126,
			"text": "শায়বান ইবন ফাররুখ (রহঃ) ..... আনাস ইবন মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আজ রাতে আমার ঘরে একটা পুত্র সন্তান জন্মগ্রহণ করেছে। আমি আমার দাদার নামানুসারে তার নাম রেখেছি ইব্‌রাহীম। অতঃপর উক্ত হাদীছ বর্ণনা প্রসঙ্গে আনাস (রাঃ) বলেনঃ আমি দেখেছি, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সামনে সে বাচ্চার জান বের হচ্ছিল এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চোখ হতে অশ্রু নির্গত হচ্ছিল। এ সময় তিনি বলছিলেনঃ চোখ থেকে পানি বের হচ্ছে এবং অন্তর বেদনাতুর, তবু আমরা তা-ই বলব, যাতে আমাদের রব রাযী এবং খুশী থাকেন (অর্থাৎ ইন্নালিল্লাহ....)। হে ইব্‌রাহীম! আমরা সত্যিই তোমার জন্য ব্যথিত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3127,
			"arabicnumber": 3127,
			"text": "মুসাদ্দাদ (রহঃ) .... উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের বিলাপ করতে নিষেধ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3128,
			"arabicnumber": 3128,
			"text": "ইব্‌রাহীম ইবন মূসা (রহঃ) .... আবূ সাঈদ খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিলাপকারী এবং বিলাপ শ্রবণকারী মহিলাদের উপর লা'নত করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3129,
			"arabicnumber": 3129,
			"text": "হান্নাদ ইবন সারী (রহঃ) .... ইবন উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মৃত ব্যক্তিকে তার পরিবার-পরিজনদের ক্রন্দন হেতু আযাব দেওয়া হয়। এ সম্পর্কে আইশা (রাঃ)-কে জিজ্ঞাসা করা হলে তিনি বলেনঃ আবদুল্লাহ ইবন উমর (রাঃ) ভুলে গেছেন। বরং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা একটা কবরের পথ দিয়ে গমনকালে বলেনঃ এ কবরবাসীর উপর আযাব হচ্ছে এবং এর পরিজনরা এর জন্য ক্রন্দন করছে। এরপর আইশা (রাঃ) এ আয়াত তিলাওয়াত করেনঃ وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى অর্থাৎ কোন বোঝা বহনকারী, অন্য কারও বোঝা বহন করবে না। রাবী আবূ মু'আবিয়া (রাঃ)-এর বর্ণনায় এরূপ আছে যে, ঐটি ছিল একটি ইয়াহূদীর কবর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3130,
			"arabicnumber": 3130,
			"text": "উছমান ইবন আবী শায়বা (রহঃ) ..... ইয়াযীদ ইবন আওস (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি আবূ মূসা (রাঃ) এর কাছে গিয়েছিলাম, যিনি তখন অসুস্থ ছিলেন। এ সময় তাঁর স্ত্রী কাঁদছিল অথবা কাঁদার উপক্রম করছিল। তখন আবূ মূসা (রাঃ) তাকে বলেনঃ তুমি কি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নির্দেশ শ্রবণ করনি? সে বলেঃ হ্যাঁ। এরপর সে চুপ হয়ে যায়। রাবী বলেনঃ আবূ মূসা যখন মারা যান, তখন আমি (ইয়াযীদ) সে মহিলার সাথে দেখা করে জিজ্ঞাসা করি যে, আবূ মূসা তোমাকে কি বলেছিল? (যখন তিনি বলেছিলেনঃ) তুমি কি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নির্দেশ শোননি-এরপর তুমি চুপ হয়ে গিয়েছিলে? তখন সে মহিলা বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সে ব্যক্তি আমাদের দলভুক্ত নয়, (যে মৃতের জন্য শোকাতুর হয়ে) তার মাথা মুড়ায় এবং চীৎকার দিয়ে কাঁদে, নিজের কাপড় ছিঁড়ে ফেলে এবং স্বীয় মুখের উপর আঘাত করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3131,
			"arabicnumber": 3131,
			"text": "মুসাদ্দাদ (রহঃ) .... জনৈক বায়'আত গ্রহণকারী মহিলা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের কাছ থেকে যে সব ব্যাপারে অংগীকার গ্রহণ করেন, তার মাঝে উত্তম ব্যাপার এ ছিল যে, আমরা তাঁর নাফরমানী করব না, আমাদের চেহারা নখ দিয়ে আঁচড়ে ক্ষত-বিক্ষত করব না, ধ্বংসের আহবান করব না, জামার বক্ষদেশ ফেঁড়ে ফেলব না এবং মাথার চুল অবিন্যস্ত করব না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3132,
			"arabicnumber": 3132,
			"text": "মুসাদ্দাদ (রহঃ) ..... আবদুল্লাহ্‌ ইবন জাফর (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা বলেন, তোমরা জা'ফরের পরিবার-পরিজনদের জন্য খাবার জিনিস তৈরী কর। কেননা, তাদের উপর এমন মুসীবত নাযিল হয়েছে, যা তাদের ব্যস্ত রেখেছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3133,
			"arabicnumber": 3133,
			"text": "কুতায়বা ইবন সাঈদ (রহঃ) ...... জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ জনৈক ব্যক্তির গলায় অথবা বুকে তীর বিঁধেছিল, ফলে সে মারা যায়। অতঃপর তাকে ঐভাবে কাপড় পেঁচিয়ে দাফন করা হয়, যেভাবে সে ছিল। জাবির (রাঃ) বলেনঃ এ সময় আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে ছিলাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3134,
			"arabicnumber": 3134,
			"text": "যিয়াদ ইবন আয়্যূব (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উহুদ যুদ্ধের শহীদদের ব্যাপারে এরূপ নির্দেশ দেন যে, তাদের দেহ হতে অস্ত্রশস্ত্র ও লৌহবর্ম খুলে তাদের রক্তমাখা বস্ত্রসহ দাফন করা হোক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3135,
			"arabicnumber": 3135,
			"text": "আহমদ ইবন সালিহ (রহঃ) ..... আনাস ইবন মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ উহুদ যুদ্ধের শহীদদের গোসল দেওয়া হয়নি এবং রক্তমাখা কাপড়সহ দাফন করা হয়, আর তাদের উপর জানাযার নামাযও পড়া হয়নি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3136,
			"arabicnumber": 3136,
			"text": "উছমান ইবন আবী শায়বা (রহঃ) ...... আনাস ইবন মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উহুদের যুদ্ধ শেষে হামযা (রাঃ) এর পাশ দিয়ে গমন করেন, যাঁর নাক ও কান (হিন্দা) কেটে নিয়েছিল। তখন তিনি বলেনঃ আমি যদি সুফিয়া (রাঃ) এর কষ্টের কথা চিন্তা না করতাম, যিনি হামযা (রাঃ)-এর বোন ছিলেন, তাহলে আমি তাঁর লাশকে পড়ে থাকতে দিতাম, যাতে পশু-পাখিরা তা ভক্ষণ করতে পারত এবং হাশরের দিন তিনি তাদের পেট হতে বের হতেন। এ সময় কাপড় কম থাকায় এক-এক, দুই-দুই এবং তিন-তিন ব্যক্তিকে একই কাপড়ে কাফন দেওয়া হয়। রাবী কুতায়বা (রহঃ) এরূপ অতিরিক্ত বর্ণনা করেছেন যে, এরপর তাঁদের একই কবরে দাফন করা হয়। এ সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ জিজ্ঞাসা করতে থাকেন যে, এদের মাঝে কোন ব্যক্তি কুরআন বেশী জানতো? এরপর তাকে আগে কিবলার দিকে রাখা হতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3137,
			"arabicnumber": 3137,
			"text": "আব্বাস আনবারী (রহঃ) ..... আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হামযা (রাঃ)-এর পাশ দিয়ে যান, যার নাক-কান কেটে ফেলা হয়। আর তিনি হামযা (রাঃ) ব্যতীত অন্য কারো জানাযার নামায পড়াননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3138,
			"arabicnumber": 3138,
			"text": "কুতায়বা ইবন সাঈদ ও ইয়াযীদ ইবন খালিদ ইবন মাওহিব (রহঃ) ...... জাবির ইবন আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উহুদ যুদ্ধের শহীদদের দু-জনকে একই কবরে দাফনের নির্দেশ দেন এবং এ সময় তিনি জিজ্ঞাসা করেনঃ এদের মাঝে কে অধিক কুরআনের হাফিয? অতঃপর যখন তাদের একজনের প্রতি ইশারা করা হতো, তখন তিনি তাঁকে আগে কবরে রাখতে বলতেন। অবশেষে তিনি বলেনঃ আমি কিয়ামতের দিন এদের ব্যাপারে সাক্ষী দেব। তিনি তাঁদের রক্তমাখা অবস্থায় দাফনের নির্দেশ দেন এবং তাঁদের গোসল দেওয়া হয়নি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3139,
			"arabicnumber": 3139,
			"text": "সুলায়মান ইবন দাঊদ মাহরী (রহঃ) .... লায়ছ উপরোক্ত হাদীছের অর্থে হাদীছ বর্ণনা করে বলেনঃ তিনি উহুদ যুদ্ধের শহীদদের দু-দু ব্যক্তিদের একই কাপড়ে দাফন করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3140,
			"arabicnumber": 3140,
			"text": "আলী ইবন সাহল রামলী (রহঃ) ..... আলী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তুমি তোমার নিজের রান খুলবে না এবং জীবিত বা মৃত ব্যক্তির রানের প্রতি দৃষ্টিপাত করবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3141,
			"arabicnumber": 3141,
			"text": "নুফায়লী (রহঃ) .... আবদুল্লাহ্‌ ইবন যুবায়র (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি আইশা (রাঃ)-কে এরূপ বলতে শুনেছিঃ যখন সাহাবীরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে গোসল দেওয়ার জন্য সিদ্ধান্ত নেন, তখন তাঁরা বলেনঃ আল্লাহ্‌র শপথ! আমরা বুঝতে পারছি না যে, আমরা কি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাপড় খুলে ফেলব, যেমন আমরা আমাদের অন্যান্য মৃত ব্যক্তির কাপড় খুলে ফেলি অথবা আমরা তাকে কাপড় পরা অবস্থায় গোসল দেব? যখন তারা মতভেদ করলো, তখন আল্লাহ্‌ তাদের সকলকে তন্দ্রাচ্ছন্ন করে ফেলেন, এমন কি তাদের একজনও এমন ছিল না (নিদ্রার কারণে) যার থুতনী তার বক্ষের উপর আপতিত হয়নি। এ সময় জনৈক ব্যক্তি ঘরের এক কোণা হতে বলল, তাঁরা জানত না-তিনি কে? তোমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে তাঁর পরিধেয় কাপড়সহ গোসল দাও। তখন সাহাবীগণ উঠে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে কাপড়সহ গোসল দিতে শুরু করেন। এ সময় তাঁর দেহ তাঁর পবিত্র জামা ছিল। তাঁরা জামার উপর পানি ঢেলে, ঐ জামা দিয়ে তাঁর দেহ ঘর্ষণ করেন এবং তাঁরা তাঁর দেহে হাত লাগান নি। আইশা (রাঃ) বলেনঃ আমি যদি আগে বুঝতে পারতাম, যা আমি পরে বুঝতে পারি, তবে তাঁকে তাঁর বিবিগণ ছাড়া আর কেউ-ই গোসল দিতে পারত না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3142,
			"arabicnumber": 3142,
			"text": "আল-কা'নবী (রহঃ) .... উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন আমাদের নিকট উপস্থিত হন, যখন তাঁর কন্যা ইনতিকাল করেন। তিনি বলেনঃ তোমরা তাঁকে তিন বা পাঁচবার, আর যদি প্রয়োজন মনে কর, তবে এর থেকেও অধিক বার কুলপাতা মিশান সিদ্ধ পানি দিয়ে গোসল দেবে এবং শেষবার গোসল দেওয়ার সময় পানিতে কর্পূর মিশিয়ে নেবে অথবা কর্পূরের মত অন্য কোন সুগন্ধ বস্তু মিশিয়ে নেবে। তোমরা তাঁর গোসল দেওয়ার কাজ শেষ করে আমাকে খবর দেবে। অতঃপর তাঁর গোসল দেওয়ার কাজ শেষ করে আমরা তাঁকে এ খবর দিলে, তিনি তাঁর ব্যবহৃত তহবন্দ আমাদের দিয়ে বলেনঃ এটি তাঁর শরীরে জড়িয়ে দাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3143,
			"arabicnumber": 3143,
			"text": "আহমদ ইবন আবদা ও আবূ কামিল (রহঃ) ..... উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা তাঁর [যয়নব (রাঃ)]-এর চুল আঁচড়িয়ে তিন ভাগে বিভক্ত করে বেণী বেঁধে দেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3144,
			"arabicnumber": 3144,
			"text": "মুহাম্মদ ইবন মুছান্না (রহঃ) ...... উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা তাঁর [যয়নব (রাঃ)] এর চুল তিন ভাগে বিভক্ত করে তাঁর পিছনের দিকে রেখে দেই। যার একটি অংশ ছিল মধ্য মাথার এবং বাকী দু'অংশ ছিল মাথার দু'পাশের।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3145,
			"arabicnumber": 3145,
			"text": "আবূ কামিল (রহঃ) ..... উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কন্যার গোসলদানকারী মহিলাদের বলেনঃ তোমরা তাঁর ডান পাশের উযূর অঙ্গ-প্রত্যঙ্গ হতে গোসল দেওয়া শুরু করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3146,
			"arabicnumber": 3146,
			"text": "মুহাম্মদ ইবন উবায়দ (রহঃ) ...... উম্মু আতিয়্যা (রাঃ) এভাবে বর্ণনা প্রসঙ্গে এটুকু অতিরিক্ত বলেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা তাকে সাত বার গোসল দেবে এবং প্রয়োজনে এর চাইতে অধিক বারও গোসল দিতে পার।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3147,
			"arabicnumber": 3147,
			"text": "হুদবা ইবন খালিদ (রহঃ) ..... মুহাম্মদ ইবন সীরীন (রহঃ) থেকে বর্ণিত। তিনি উম্মু 'আতিয়্যা (রাঃ) হতে মৃত ব্যক্তির গোসল দেওয়ার পদ্ধতি শিক্ষা করেন। তখন তিনি তাকে বলেনঃ প্রথম দুবার কুলপাতা মিশান পানি দিয়ে গোসল দিতে হবে এবং তৃতীয় বার কর্পূর মিশান পানি দিয়ে গোসল দিতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3148,
			"arabicnumber": 3148,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ..... জাবির ইবন আবদিল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুতবা দেওয়ার সময় তাঁর জনৈক সাহাবী সম্পর্কে উল্লেখ করেন, যিনি ইনতিকাল করেন। লোকেরা রাতের বেলায় ত্রুটিপূর্ণ কাফনে তাঁকে দাফন করেছিল। বস্তুত নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জানাযার নামায আদায়ের আগে রাতের বেলায় কোন মৃত ব্যক্তিকে দাফন করা হতে কঠোরভাবে নিষেধ করেন। অবশ্য বিশেষ কারণে তিনি রাতের বেলায় দাফনের অনুমতিও প্রদান করেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরো বলেনঃ যখন তোমাদের কেউ তার ভাইকে কাফন প্রদান করবে, তখন তার উচিত হবে তাকে উত্তম কাফন দেওয়া।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3149,
			"arabicnumber": 3149,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ..... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রথমে ডোরাদার ইয়ামানী চাদরে কাফন দেওয়া হয়েছিল। পরে তা পাল্টিয়ে সাদা চাদর দেওয়া হয়েছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3150,
			"arabicnumber": 3150,
			"text": "হাসান ইবন সাব্বাহ বাযযার (রহঃ) .... জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এরূপ বলতে শুনেছিঃ যখন তোমাদের থেকে কেউ ইনতিকাল করে এবং তার সামর্থও আছে, তখন উচিত হবে ইয়ামানী চাদর দিয়ে সে মৃত ব্যক্তিকে দাফন দেওয়া (অর্থাৎ মূল্যবান কাপড় দিয়ে তাকে দাফন করতে হবে)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3151,
			"arabicnumber": 3151,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ..... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ইয়ামানে তৈরী তিনটি সাদা কাপড়ে দাফন দেওয়া হয়েছিল, সেখানে কোন কামীস এবং পাগড়ী ছিল না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3152,
			"arabicnumber": 3152,
			"text": "কুতায়বা ইবন সা'ঈদ (রহঃ) .... আইশা (রাঃ) থেকে এরূপ বর্ণিত আছে। তবে একটু অতিরিক্ত বর্ণনা আছে যে, ঐ কাপড় ছিল তুলার-সুতার তৈরী। অতঃপর জনৈক ব্যক্তি আইশা (রাঃ)-কে জিজ্ঞাসা করেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাফনে কি দুটি সাদা কাপড় এবং একটা ডোরাদার ইয়ামানী চাদর ছিল? তিনি বলেনঃ ইয়ামানী চাদর দেওয়া হয়েছিল, তবে সাহাবীরা তা ফিরিয়ে দেন এবং ঐ কাপড় কাফনের মাঝে শামিল করা হয়নি (বরং কাফনের তিনটি কাপড়ই ছিল সাদা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3153,
			"arabicnumber": 3153,
			"text": "আহমদ ইবন হাম্বল ও উছমান ইবন আবী শায়বা (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে নাজরানে তৈরী তিনটি কাপড় দিয়ে কাফন দেওয়া হয়েছিল। ঐ কাপড়ের মাঝে একটা ছিল চাদর, একটা তহবন্দ এবং অন্যটি ছিল ঐ জামা, যা গায়ে থাকা অবস্থায় তিনি ইনতিকাল করেন। আবূ দাঊদ (রহঃ) বলেনঃ উছমান (রাঃ) হতে বর্ণিত যে, তিনটি কাপড়ের মাঝে দুটি ছিল লাল এবং ঐ জামা, যা গায়ে থাকা অবস্থায় তিনি ইনতিকাল করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3154,
			"arabicnumber": 3154,
			"text": "মুহাম্মদ ইবন উবায়দ মুহারিবী (রহঃ) ..... আলী ইবন আবী তালিব সূত্রে বর্ণিত। তিনি বলেনঃ তোমরা বেশী দামী কাফন ব্যবহার করবে না। কেননা, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ বেশী দামী কাফন ব্যবহার করবে না। কেননা, তা অতি তাড়াতাড়ি নষ্ট হয়ে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3155,
			"arabicnumber": 3155,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) ..... খাব্বাব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ মুস'আব ইবন উমায়র (রাঃ) উহুদের যুদ্ধে শাহাদত লাভ করেন। এ সময় তাঁর কাছে (কাফনের জন্য) একটা কম্বল ছাড়া আর কিছুই ছিল না। (আর তা এত ছোট ছিল যে,) যখন তা দিয়ে আমরা তাঁর মাথা ঢাকছিলাম, তখন তার দু'টি পা বেরিয়ে যাচ্ছিল এবং আমরা যখন তার পা দুটি ঢাকছিলাম, তখন তাঁর মাথা বেরিয়ে যাচ্ছিল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা ঐ কম্বল দিয়ে তাঁর মাথা ঢেকে দাও এবং পা দুটির উপর ইযখার (এক ধরনের সুগন্ধিযুক্ত ঘাস) দিয়ে দাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3156,
			"arabicnumber": 3156,
			"text": "আহমদ ইবন সালিহ (রহঃ) ..... উবাদা ইবন সামিত (রাঃ) সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেনঃ উত্তম কাফন হলো হুল্লা অর্থাৎ চাদর এবং তহবন্দ এবং উত্তম কুরবানীর পশু হলো শিংওয়ালা দুম্বা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3157,
			"arabicnumber": 3157,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ..... লায়লা বিনতে কায়েফ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ যে মহিলারা উম্মু কুলছুম বিনতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাঁর ইন্তিকালের পর গোসল দিয়েছিল, আমিও তাদের একজন ছিলাম। (তাঁর গোসল সম্পন্ন হওয়ার পর) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কাফনের জন্য সর্বপ্রথম আমাদের তহবন্দ প্রদান করেন, এরপর জামা, সিরবন্দ, চাদর এবং শেষে এমন একটা কাপড় প্রদান করেন, যা উপরে জড়িয়ে দেওয়া হয়। রাবী বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দরওয়াযার উপর বসা ছিলেন এবং কাফনের কাপড় তাঁর কাছেই ছিল। তিনি সেখান হতে এক-একটা কাপড় প্রদান করছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3158,
			"arabicnumber": 3158,
			"text": "মুসলিম ইবন ইবরাহীম (রহঃ) .... আবূ সাঈদ খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের জন্য সব চাইতে উত্তম খোশবু হলো মিশক।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3159,
			"arabicnumber": 3159,
			"text": "আবদুর রহীম ইবন মুতাররিফ রুয়াসী আবূ সুফয়ান ও আহমদ ইবন জানাব (রহঃ) .... হুসায়ন ইবন ওয়াহূজ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ তালহা ইবন বারাআ অসুস্থ হয়ে পড়লে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে দেখার জন্য আসেন। তখন তিনি বলেনঃ আমার ধারণা, শীঘ্রই তালহা প্রাণত্যাগ করবে। কাজেই তোমরা আমাকে এ খবর দেবে এবং তার দাফন-কাফনের ব্যাপারে জলদি করবে। কেননা, মুসলিমদের লাশ তাদের পরিবার-পরিজনদের কাছে বেশীক্ষণ রাখা উচিত নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3160,
			"arabicnumber": 3160,
			"text": "উসমান ইবন আবী শায়বা (রহঃ) ..... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চারটি ব্যাপারে গোসল করতেনঃ (১) স্ত্রী-সহবাসের পর, (২) জুম'আর দিন, (৩) শিংগা লাগানোর পর এবং (৪) মৃত ব্যক্তিকে গোসল দেওয়ার পর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3161,
			"arabicnumber": 3161,
			"text": "আহমদ ইবন সালিহ (রহঃ) .... আবূ হুরায়রা (রাঃ) সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেনঃ যে ব্যক্তি কোন মৃতকে গোসল করায়, সে যেন নিজে গোসল করে। আর যে তা বহন করে, সে যেন উযূ করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3162,
			"arabicnumber": 3162,
			"text": "হামিদ ইবন ইয়াহইয়া (রহঃ) ..... আবূ হুরায়রা (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এরূপেই বর্ণিত হয়েছে। আবূ দাঊদ (রহঃ) বলেনঃ এ হাদীছটি মানসুখ বা বাতিল। আমি আহমদ ইবন হাম্বল (রহঃ)-এর কাছে শুনেছি, যখন তাকে মৃত ব্যক্তির গোসল সম্পর্কে জিজ্ঞাসা করা হয়, তখন তিনি বলেনঃ তার জন্য কেবল উযূ করাই যথেষ্ট।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3163,
			"arabicnumber": 3163,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) ..... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে উছমান ইবন মাযঊন (রাঃ)-কে তাঁর মৃত্যুর পর চুম্বন করতে দেখেছি। এমনকি আমি তাঁর চোখ থেকে পানিও বের হতে দেখেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3164,
			"arabicnumber": 3164,
			"text": "মুহাম্মদ ইবন হাতিম ইবন বুযায় (রহঃ) ...... জাবির ইবন আবদিল্লাহ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা লোকেরা কবরস্থানে আলো দেখতে পেয়ে সেখানে গমন করে। তখন তারা দেখতে পায় যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজে কবরের মাঝে দাঁড়িয়ে বলছেনঃ তোমরা তোমাদের সাথীকে (মৃত ব্যক্তিকে) আমার কাছে দাও। আর তিনি ছিলেন সেই ব্যক্তি, যিনি উচ্চস্বরে আল্লাহর যিকির করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3165,
			"arabicnumber": 3165,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) ..... জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা উহুদ যুদ্ধের শহীদদের লাশ অন্যত্র নিয়ে যাচ্ছিলাম দাফনের জন্য। এ সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ঘোষক এসে বলেনঃ তিনি তোমাদের এ নির্দেশ দিয়েছেন যে, তোমরা শহীদদের লাশ তাদের শাহাদতের স্থানে দাফন করবে। তখন আমরা তাদের লাশ সেখানে দাফন করি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3166,
			"arabicnumber": 3166,
			"text": "মুহাম্মদ ইবন উবায়দ (রহঃ) ....... মালিক ইবন হুবায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে কোন মুসলিম ব্যক্তির জন্য জীবিত মুসলিমরা তিন কাতার করে (তার জানাযার) নামায পড়লে, আল্লাহ্‌ তার জন্য জান্নাত ওয়াজিব করে দেন। রাবী বলেনঃ এ জন্য মালিক (রহঃ) যখন কোন ব্যক্তির জানাযায় লোক কম দেখতেন, তখন তাদের তিন কাতারে বিভক্ত করে দিতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3167,
			"arabicnumber": 3167,
			"text": "সুলায়মান ইবন হারব (রহঃ) ..... উম্মু আতীয়া (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমাদের জানাযার অনুগমন করতে নিষেধ করা হয়েছে। কিন্তু এ ব্যাপারে আমাদের উপর কঠোরতা আরোপ করা হয়নি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3168,
			"arabicnumber": 3168,
			"text": "মুসাদ্দাদ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি কোন জানাযার অনুগমন করে, তার সালাতুল জানাযা আদায় করে, সে এক কীরাত ছওয়াব পায়। আর যে ব্যক্তি জানাযার সাথে গমন করে তার দাফনেও শরীক হয়, সে ব্যক্তি দু'কীরাত ছওয়াব পায়। ঐ দু'কীরাতের ছোট কীরাতের পরিমাণ হলো উহুদ পাহাড়ের সমান, অথবা দু'কীরাতের মাঝে এক কীরাত হলো উহুদ পাহাড় সমতুল্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3169,
			"arabicnumber": 3169,
			"text": "হারুন ইবন আবদিল্লাহ ও আবদুর রহমান ইবন হুসায়ন হারবী (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শ্রবণ করেছেন, যিনি বলেছেনঃ যে ব্যক্তি কোন জানাযার সাথে তার ঘর থেকে বের হবে, তার সালাতুল জানাযা আদায় করবে, সে ব্যক্তি এক কীরাত ছাওয়াব পাবে। আর যে ব্যক্তি দাফনেও শরীক থাকবে, সে দু'কীরাতের সমান ছাওয়াব পাবে। যখন ইবন উমার (রাঃ) এ হাদীছ শ্রবণ করেন, তখন এর সত্যতা যাচাইয়ের জন্য জনৈক ব্যক্তিকে আইশা (রাঃ) এর নিকট প্রেরণ করেন। তখন আইশা (রাঃ) বলেনঃ আবূ হুরায়রা (রাঃ) সত্য বলেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3170,
			"arabicnumber": 3170,
			"text": "ওয়ালীদ ইবন সূজা সাকূনী (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, যখন কোন মুসলিম লাশের উপর এমন চল্লিশজন লোক তার জানাযার নামায পড়ে, যারা আল্লাহ্‌র সংগে কাউকে শরীক করে না, তাদের সুপারিশ ঐ মৃত ব্যক্তির পক্ষে কবূল করা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3171,
			"arabicnumber": 3171,
			"text": "হারূন ইবন আবদিল্লাহ (রহঃ) ...... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জানাযার পেছনে চীৎকার করতে করতে এবং আগুন নিয়ে যাবে না। রাবী হারুন অতিরিক্ত বর্ণনা করেছেনঃ জানাযার আগে আগেও গমন করবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3172,
			"arabicnumber": 3172,
			"text": "মুসাদ্দাদ (রহঃ) ..... আমির ইবন রাবী'আ (রাঃ) থেকে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন যে, যখন তোমরা কোন জানাযা (মৃত ব্যক্তির লাশ) দেখবে, তখন তোমরা তার সম্মানে দাঁড়াবে, যতক্ষণ না তা তোমাদের অতিক্রম করে অথবা দাফনের জন্য রাখা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3173,
			"arabicnumber": 3173,
			"text": "আহমদ ইবন ইউনুস (রহঃ) .... আবূ সাঈদ খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা যখন কোন জানাযার অনুগমন করবে, তখন তোমরা ততক্ষণ বসবে না, যতক্ষণ না তাকে (যমীনে) রাখা হয়। আবূ দাঊদ (রহঃ) বলেনঃ ছাওরী উক্ত হাদীছ সুহায়ল হতে, তিনি তাঁর পিতা হতে, তিনি আবূ হুরায়রা (রাঃ) থেকে বর্ণনা করেছেন। যাতে এরূপ বর্ণিত আছেঃ যতক্ষণ না সে জানাযাকে যমীনে রাখা হয়। রাবী আবূ মু'আবিয়া (রহঃ) সুহায়ল হতে এরূপ বর্ণনা করেছেনঃ যতক্ষণ না সে জানাযাকে (লাশকে) কবরে রাখা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3174,
			"arabicnumber": 3174,
			"text": "মুআম্মাল ইবন ফযল হাররানী (রহঃ) ...... জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সংগে ছিলাম। এ সময় একটা জানাযা আমাদের পাশ দিয়ে নেওয়া হচ্ছিল। তখন তিনি দাঁড়িয়ে যান। আমরা সে জানাযা বহনের উদ্দেশ্যে সেখানে পৌছে জানতে পারি যে, তা একজন ইয়াহূদীর জানাযা (লাশ)। তখন তিনি বলেনঃ নিশ্চয় মৃত্যু তো ভয়ের জিনিস। কাজেই তোমরা যখন কোন জানাযা দেখবে, তখন তোমরা দাঁড়িয়ে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3175,
			"arabicnumber": 3175,
			"text": "আল-কা'নবী (রহঃ) ...... আলী ইবন আবী তালিব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রথম দিকে কোন জানাযা দেখার পর দাঁড়াতেন কিন্তু পরে তিনি বসে থাকতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3176,
			"arabicnumber": 3176,
			"text": "হিশাম ইবন বাহরাম মাদাইনী (রহঃ) .... উবাদা ইবন সামিত (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কোন জানাযার উদ্দেশ্যে দাঁড়াতেন, তখন তিনি ততক্ষণ বসতেন না, যতক্ষণ না সে লাশকে কবরে রাখা হতো। অতঃপর জনৈক ইয়াহূদী আলিম তাঁর নিকট দিয়ে গমনকালে বলেঃ আমরাও এরূপ করে থাকি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বসে পড়েন এবং বলেনঃ তোমরাও বস এবং তাদের (ইয়াহূদীদের) বিপরীত কাজ কর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3177,
			"arabicnumber": 3177,
			"text": "ইয়াহ্‌ইয়া ইবন মূসা বালখী (রহঃ) ..... ছাওবান (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনৈক ব্যক্তির জানাযার অনুগমন করাকালে তাঁর জন্য একটা বাহন আনা হয়। তখন তিনি তার পিঠে চড়তে অস্বীকার করেন। অতঃপর তিনি যখন সেখান হতে ফিরে আসতে ইচ্ছা করেন, তখন তাঁর জন্য বাহন আনা হলে তিনি তাতে আরোহণ করেন। তখন তাকে এ সম্পর্কে জিজ্ঞাসা করা হলে তিনি বলেনঃ উক্ত জানাযার সংগে ফেরেশতারা পায়ে হেঁটে চলছিল, তাই আমি বাহনে সওয়ার হওয়া ভাল মনে করিনি। এখন তাঁরা চলে গেছেন, তাই আমি বাহনে আরোহণ করেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3178,
			"arabicnumber": 3178,
			"text": "উবায়দুল্লাহ ইবন মুআয (রহঃ) ..... জাবির ইবন সামুরা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলী ইবন দাহদাহ নামক জনৈক সাহাবীর জানাযার নামায আদায় করেন। আর এ সময় আমরা সেখানে উপস্থিত ছিলাম। অতঃপর তাঁর আরোহণের জন্য একটা ঘোড়া আনা হলে তিনি সেটিকে বেঁধে রাখেন। এরপর তিনি তার পিঠে সওয়ার হলে সেটি লাফালাফি করে চলতে থাকে। এ সময় আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পাশাপাশি দৌড়ে চলছিলাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3179,
			"arabicnumber": 3179,
			"text": "আল-কা'নবী (রহঃ) ..... সালিম (রহঃ) তাঁর পিতা হতে বর্ণনা করেছেন। তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, আবূ বকর এবং উমার (রাঃ)-কে জানাযার আগে আগে যেতে দেখেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3180,
			"arabicnumber": 3180,
			"text": "ওয়াহব ইবন বাকিয়্যা (রহঃ) .... মুগীরা ইবন শু'বা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ ইউনুস বলেছেনঃ আমার ধারণা, যিয়াদের অধিবাসীরা এরূপ বর্ণনা করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আরোহীর উচিত জানাযার পশ্চাতে পশ্চাতে গমন করা। আর পদব্রজে গমনকারী জানাযার আগে, পিছে, ডানে ও বামে যেতে পারে এবং সাথে সাথেও চলতে পারে। গর্ভপাত হওয়ার ফলে যে শিশু ভূমিষ্ঠ হয়, তার জানাযার নামায পড়তে হবে এবং তার মাতাপিতার জন্য মাগফিরাত ও রহমতের দু’আ করতে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3181,
			"arabicnumber": 3181,
			"text": "মুসাদ্দাদ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জানাযাকে দ্রুত নিয়ে যাবে। কেননা যদি সে নেককার হয়, তবে তোমরা তাকে তার কল্যাণের দিকে দ্রুত পৌছে দেবে। আর যদি সে বদকার হয়, তবে তোমরা একটা অকল্যাণ তোমাদের গরদান হতে দ্রুত নামিয়ে দিলে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3182,
			"arabicnumber": 3182,
			"text": "মুসলিম ইবন ইব্‌রাহীম (রহঃ) ..... আবদুর রহমান (রাঃ) তাঁর পিতা হতে বর্ণনা করেন। তিনি বলেনঃ তিনি উসমান ইবন আবিল আসের জানাযায় শরীক ছিলেন। আমরা তার জানাযা নিয়ে আস্তে আস্তে যাচ্ছিলাম। এ সময় আবূ বকরা (রাঃ) আমাদের সাথে যোগ দেন। তিনি আমাদের আস্তে আস্তে চলতে দেখে লাঠি উঁচিয়ে বলেনঃ তোমরা তো দেখেছ, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে জানাযা (লাশ) নিয়ে দ্রুত গমন করেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3183,
			"arabicnumber": 3183,
			"text": "হুমায়দা ইবন মাস'আদা (রহঃ) .... উয়ায়না উপরিউক্ত হাদীছ বর্ণনা প্রসঙ্গে বলেন, উক্ত জানাযা ছিল আবদুর রহমান ইবন সামুরার। রাবী বলেনঃ আবূ বাকরা (রাঃ) দ্রুত তাঁর খচ্চর হাঁকিয়ে আসেন এবং লাঠির ইশারায় লাশ দ্রুত বহন করতে বলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3184,
			"arabicnumber": 3184,
			"text": "মুসাদ্দাদ (রহঃ) ..... ইবন মাসঊদ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা আমাদের নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জানাযার সাথে চলার ব্যাপারে জিজ্ঞাসা করেছিলাম। তিনি বলেনঃ দৌড়ের চাইতে কিছু কম গতিতে চলবে। যদি সে নেককার হয়, তবে তাকে পৌছানোর জন্য জলদি করবে। আর যদি সে নেককার না হয়, তবে জাহান্নামীদের থেকে দূরে থাকাই ভাল এবং জানাযার পেছনে যাওয়াই শ্রেয়। আর তার লাশের আগে যাবে না। যে ব্যক্তি জানাযার আগে যায়, সে ঐ জানাযার সাথীদের অন্তর্ভুক্ত হয় না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3185,
			"arabicnumber": 3185,
			"text": "ইবন নুফায়ল (রহঃ) ..... জাবির ইবন সামুরা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ জনৈক ব্যক্তি অসুস্থ হয়ে পড়েছিল। পরে তার মৃত্যু খবর ছড়িয়ে পড়ে। তখন তার প্রতিবেশী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হয়ে বলেঃ সে ব্যক্তি মারা গেছে। তখন তিনি জিজ্ঞাসা করেনঃ তুমি কিরূপে এ খবর জানলে? সে বলেঃ আমি তাকে দেখে এসেছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ সে মারা যায়নি। রাবী বলেনঃ তখন সে ব্যক্তি ফিরে যায়। ইত্যবসরে তাঁর জন্য কান্নার রোল শোনা গেলে, সে ব্যক্তি (প্রতিবেশী) আবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হয়ে বললঃ অমুক ব্যক্তি মারা গেছে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ না, সে মারা যায়নি। রাবী বলেনঃ তখন সে ব্যক্তি ফিরে যায়। তখন তার জন্য আবার কান্নার রোল শোনা গেল এবং সে মৃত ব্যক্তির স্ত্রী তাকে (প্রতিবেশী) বললঃ আপনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে গিয়ে এ খবর দিন। তখন সে ব্যক্তি বললঃ ইয়া আল্লাহ্‌! আপনি এর উপর লা'নত করুন! রাবী বলেনঃ তখন সে ব্যক্তি মৃত ব্যক্তির কাছে হাযির হয়ে দেখতে পেল যে, সে তীরের ফলা দিয়ে নিজের গলা কেটে আত্মহত্যা করেছে। তখন সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে গিয়ে খবর দিল যেঃ সে ব্যক্তি মারা গেছে। তিনি জিজ্ঞাসা করলেনঃ তুমি কিরূপে এ খবর জানলে? সে বলেঃ আমি দেখে এসেছি যে, সে ব্যক্তি তার নিজের তীরের ফলা দিয়ে গলা কেটে আত্মহত্যা করেছে। তিনি বলেনঃ তুমি কি তাকে এরূপই দেখে এসেছ? তখন সে বলেঃ হ্যাঁ। তিনি বলেনঃ তাহলে আমি তার জানাযার নামায পড়ব না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3186,
			"arabicnumber": 3186,
			"text": "আবূ কামিল (রহঃ) .... আবূ বারযা আসলামী (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাইয ইবন মালিক (রাঃ)-এর জানাযার নামায পড়েননি। তবে তিনি অন্যদের তার জানাযার নামায পড়তে নিষেধ করেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3187,
			"arabicnumber": 3187,
			"text": "মুহাম্মদ ইবন ইয়াহ্‌ইয়া ইবন ফারিস (রহঃ) .... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পুত্র ইব্‌রাহীম আঠার মাস বয়সের সময় মারা যান। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সালাতুল জানাযা পড়েননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3188,
			"arabicnumber": 3188,
			"text": "হান্নাদ ইবন সারী (রহঃ) ..... ওয়াল ইবন দাঊদ (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি বাহী থেকে শ্রবণ করেছি, যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পুত্র ইব্‌রাহীম মারা যান, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর বসার স্থানে তাঁর (ইবরাহীমের) জানাযার নামায পড়েন। আবূ দাঊদ (রহঃ) বলেনঃ আমি সাঈদ ইবন ইয়া'কূব তালেকানীর নিকট হাদীছটি পড়ে শোনানোর পর জানতে পারি যে, ইবন মুবারক ইয়াকূব ইবন কা'কা হতে, তিনি আতা হতে বর্ণনা করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর পুত্র ইবরাহীমের জানাযার নামায পড়েছিলেন এবং এ সময় তাঁর বয়স ছিল সত্তর রাত (অর্থাৎ দু'মাস দশ দিন) মাত্র।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3189,
			"arabicnumber": 3189,
			"text": "সাঈদ ইবন মানসূর (রহঃ) .... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সুহায়ল ইবন বায়যা (রাঃ) এর জানাযার নামায মসজিদেই পড়েছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3190,
			"arabicnumber": 3190,
			"text": "হারুন ইবন আবদিল্লাহ (রহঃ) .... আইশা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আল্লাহ্‌র শপথ! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বায়যা (রাঃ)-এর দুই ছেলে সুহায়ল এবং তাঁর ভাইয়ের জানাযার নামায মসজিদেই পড়েছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3191,
			"arabicnumber": 3191,
			"text": "মুসাদ্দাদ (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি মসজিদে কোন ব্যক্তির জানাযার নামায পড়বে, তার কোন গুনাহ হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3192,
			"arabicnumber": 3192,
			"text": "উছমান ইবন আবী শায়বা (রহঃ) ..... উকবা ইবন আমির (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের তিনটি সময়ে সালাত আদায় করতে এবং আমাদের মৃতদের দাফন করতে নিষেধ করেছেনঃ (১) সূর্যোদয়ের সময় হতে সূর্য উপরে উঠার আগ পর্যন্ত, (২) ঠিক দুপুর হতে সূর্য পশ্চিম আকাশে না হেলা পর্যন্ত এবং (৩) সূর্যাস্তের সময় হতে সূর্য সম্পূর্ণ অস্ত না যাওয়া পর্যন্ত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3193,
			"arabicnumber": 3193,
			"text": "ইয়াযীদ ইবন খালিদ ইবন মাওহাব রামলী (রহঃ) .... হারিছ ইবন নওফলের আযাদকৃত গোলাম আম্মার (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ তিনি উম্মু কুলছূম (রাঃ) এবং তাঁর পুত্রের জানাযায় শরীক ছিলেন। তখন পুত্রের জানাযা (লাশ) ইমামের নিকটবর্তী রাখা হয় (এবং মহিলার লাশ দূরে)। রাবী বলেনঃ ব্যাপারটি আমার কাছে প্রিয় মনে হয়নি। এ সময় লোকদের মাঝে ইবন আব্বাস (রাঃ), আবূ সাঈদ খুদরী (রাঃ), আবূ কাতাদা (রাঃ) ও আবূ হুরায়রা (রাঃ) উপস্থিত ছিলেন। তাঁরা বলেনঃ এটাই সুন্নাত তরীকা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3194,
			"arabicnumber": 3194,
			"text": "দাঊদ ইবন মু'আয (রহঃ) ..... নাফি আবূ গালিব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি সিক্কাতুল মিওবাদ নামক স্থানে ছিলাম। এ সময় সেখান দিয়ে একটি জানাযা (লাশ) অতিক্রম করছিল, যার সাথে অনেক লোক ছিল। লোকেরা বলাবলি করছিলঃ এটা আবদুল্লাহ ইবন উমার (রাঃ)-এর জানাযা। তখন আমিও তাদের অনুসরণ করি। এ সময় আমি এমন এক ব্যক্তিকে দেখতে পাই, যিনি পাতলা চাদর মুড়ি দিয়ে একটি ছোট মুখ বিশিষ্ট অশ্বে সওয়ার ছিলেন। আর রোদের তাপ থেকে বাঁচার জন্য তাঁর মাথার উপর একখণ্ড কাপড়ও ছিল। তাঁকে দেখে আমি জিজ্ঞাসা করিঃ ইনি কোন জমিদার? লোকেরা বলেঃ ইনি আনাস ইবন মালিক (রাঃ)। অতঃপর যখন জানাযা (লাশ) রাখা হয়, তখন আনাস (রাঃ) দাঁড়ান এবং জানাযার নামায পড়ান। এ সময় আমি তাঁর পেছনে ছিলাম এবং তাঁর ও আমার মাঝে আর কোন অন্তরায় ছিল না। তিনি তাঁর (মৃত ব্যক্তির) মাথা বরাবর দাঁড়ান এবং চার তাকবীরে নামায শেষ করেন, যা অধিক দীর্ঘ ও সংক্ষিপ্ত ছিল না। অতঃপর তিনি বসার জন্য গমন করেন। তখন লোকেরা তাঁকে বলেঃ হে আবূ হামযা! এটি একটি আনসার মহিলার জানাযা। তখন তারা সেটি নিকটে নিয়ে আসে এবং সেটি সবুজ গিলাফে ঢাকা ছিল। তখন তিনি [আনাস (রাঃ)] তাঁর কোমর বরাবর খাড়া হয়ে ঐরূপে জানাযা নামায আদায় করেন, যেরূপ তিনি পুরুষ লোকটির নামায পড়িয়েছিলেন। অতঃপর তিনি উপবেশন করেন। তখন আলা ইবন যিয়াদ তাঁকে জিজ্ঞাসা করেনঃ হে আবূ হামযা! আপনি যেভাবে জানাযার নামায আদায় করলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি আপনার মত করে সালাতুল-জানাযা আদায় করতেন? তিনি কি চার তাকবীর বলতেন এবং পুরুষের জানাযার মাথা বরাবর ও স্ত্রীলোকদের জানাযার কোমর বরাবর দণ্ডায়মান হতেন? তিনি বলেনঃ হ্যাঁ। অতঃপর তিনি (আলা) বলেনঃ হে আবূ হামযা! আপনি কি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে জিহাদে শরীক হয়েছিলেন? তিনি বলেনঃ হ্যাঁ। আমি তার সঙ্গে হুনায়নের যুদ্ধে শরীক হয়েছিলাম। এ সময় মুশরিকরা (তাদের দুর্গ হতে) বেরিয়ে এসে আমাদের উপর (প্রচণ্ড) হামলা করে। ফলে আমরা আমাদের ঘোড়াকে আমাদের পেছনে দেখতে পাই। আর মুশরিকদের মাঝে এমন এক ব্যক্তি ছিল, যে আমাদের উপর (তীব্র) হামলা করেছিল এবং তরবারির আঘাতে আমাদের ক্ষত-বিক্ষত করছিল। অবশেষে আল্লাহ্‌ তাদের পরাজিত করেন। তিনি তাদের নিয়ে আসেন এবং তারা এসে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট ইসলামের উপর বায়'আত গ্রহণ করতে থাকে। এ সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জনৈক সাহাবী এরূপ মানত করেন যে, সে দিন যে ব্যক্তি আমাদের তরবারির আঘাতে ক্ষত-বিক্ষত করেছিল, আল্লাহ্‌ যদি তাকে এনে দেন, তবে আমি তার শিরশ্ছেদ করব। এ কথা শুনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুপ থাকেন। অতঃপর সে ব্যক্তিকে আনা হয়। সে ব্যক্তি যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখে, তখন বলেঃ ইয়া রাসূলাল্লাহ! আমি আল্লাহ্‌র কাছে তাওবা করেছি। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বায়'আত করা হতে বিরত থাকেন, যাতে অপর ব্যক্তি (সাহাবী) তাঁর মানত পুরা করার সুযোগ পায়। অপরপক্ষে সে সাহাবী এ অপেক্ষায় ছিল যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে হত্যার নির্দেশ দিবেন। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন দেখলেন যে, সে (সাহাবী) কিছুই করছে না, তখন তাকে বায়'আত করেন। তখন সে ব্যক্তি (সাহাবী) বললঃ ইয়া রাসূলাল্লাহ! আমার মানত কিরূপে পূর্ণ হবে? তিনি বলেনঃ আমি তাকে আজকের পূর্ব পর্যন্ত বায়'আত করাতে এ জন্য বিরত ছিলাম, যাতে তুমি তোমার মানত পুরা করতে পার। তখন সে (সাহাবী) বলেঃ ইয়া রাসূলাল্লাহ! আপনি আমাকে কেন ইশারা করলেন না? তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ইশারা করা নবীর শান নয়। রাবী আবূ গালিব বলেনঃ অতঃপর আমি লোকদের কাছে আনাস (রাঃ) মহিলার জানাযার নামায পড়বার সময় কেন তার কোমর বরাবর দাঁড়ালেন, এর কারণ জিজ্ঞাসা করি। তখন তারা আমাকে বলেনঃ প্রথম যুগে খাটিয়ার প্রচলন ছিল না, (যাতে মহিলাদের লাশ ঢেকে রাখা যেত)। এ জন্য ইমাম মহিলা জানাযার (লাশের) কোমর বরাবর দাঁড়াতেন, যাতে তা মুকতাদীদের দৃষ্টির আড়ালে থাকে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3195,
			"arabicnumber": 3195,
			"text": "মুসাদ্দাদ (রহঃ) ..... সামুরা ইবন জুনদুব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পেছনে এমন একজন মহিলার জানাযার নামায পড়েছিলাম, যিনি নিফাসের অবস্থায় ইনতিকাল করেন। তিনি তাঁর জানাযার নামায পড়বার সময় তার (লাশের) মাঝখান বরাবর দাঁড়িয়েছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3196,
			"arabicnumber": 3196,
			"text": "মুহাম্মদ ইবন আলা (রহঃ) ..... শা'বী (রহঃ) থেকে বর্ণিত। একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটা নতুন কবরের পাশ দিয়ে যাচ্ছিলেন। তখন সাহাবীগণ কাতারবদ্ধ হয়ে দাঁড়ালে তিনি চার তাকবীরের সাথে জানাযার নামায আদায় করেন। রাবী আবূ ইসহাক বলেনঃ আমি শা'বী (রহঃ)-কে জিজ্ঞাসা করি, আপনার নিকট এ হাদীছ কে বর্ণনা করেছেন? তিনি বলেনঃ একজন নির্ভরযোগ্য ব্যক্তি, যিনি সেখানে নবীজীর সঙ্গে উপস্থিত ছিলেন। তিনি হলেন আবদুল্লাহ্‌ ইবন আব্বাস (রাঃ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3197,
			"arabicnumber": 3197,
			"text": "আবু ওয়ালিদ তায়ালীসি (রহঃ) ..... ইবন আবী লায়লা (রহঃ) থেকে বর্ণিত। তিনি বলেন যায়দ ইবন আকরাম (রাঃ) আমাদের জানাযার নামায পড়ানোর সময় চার তাকবির বলতেন। একবার তিনি এক নামাজে পাচ তাকবির বলেন। তখন আমি তাঁকে জিজ্ঞেস করলে তিনি বলেনঃ রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন কোন সময় পাচ তাকবির বলতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3198,
			"arabicnumber": 3198,
			"text": "মুহাম্মদ ইবন কাসির (রহঃ) .... আবদুল্লাহ ইবন আওফ (রহঃ) হতে বর্ণিত। তিনি বলেন আমি ইবন আব্বাস (রাঃ) এর সঙ্গে জনৈক ব্যক্তির জানাযার নামায আদায় করি। সে সময় তিনি সূরা ফাতিহা পাঠ করেন এবং বললেন এটি সুন্নাত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3199,
			"arabicnumber": 3199,
			"text": "আবদুল আযিয ইবন ইয়াহয়া হুররানি (রহঃ) ..... আবু হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ যখন তোমরা কোন মৃত ব্যক্তির জানাযার নামায আদায় করবে, তখন তার জন্য ইখলাস বা আন্তরিকতার সাথে দু‘আ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3200,
			"arabicnumber": 3200,
			"text": "আবূ মা'মার আবদুল্লাহ ইবন আমর (রহঃ) ..... আলী ইবন শাম্‌মাখ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি মারওয়ানের নিকট উপস্থিত ছিলাম। সে সময় তিনি আবূ হুরায়রা (রাঃ)-কে জিজ্ঞাসা করেনঃ আপনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মৃত ব্যক্তির জন্য কিরূপে দু’আ করতে শুনেছেন? তিনি বলেনঃ আপনি কি আমাকে ঐ সম্পর্কে জিজ্ঞাসা করছেন, যা আপনি বলেছেন? মারওয়ান বলেনঃ হ্যাঁ। রাবী বলেনঃ ইতিপূর্বে এ ব্যাপারে উভয়ের মাঝে কিছুটা বাদানুবাদ হয়। আবূ হুরায়রা (রাঃ) বলেনঃ তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) এরূপ দু’আ করতেনঃ اللَّهُمَّ أَنْتَ رَبُّهَا وَأَنْتَ خَلَقْتَهَا وَأَنْتَ هَدَيْتَهَا لِلإِسْلاَمِ وَأَنْتَ قَبَضْتَ رُوحَهَا وَأَنْتَ أَعْلَمُ بِسِرِّهَا وَعَلاَنِيَتِهَا جِئْنَاكَ شُفَعَاءَ فَاغْفِرْ لَهُ অর্থাৎ ইয়া আল্লাহ্‌! আপনি এর রব। আপনি একে পয়দা করেছিলেন। আপনিই তাকে ইসলামের উপর হিদায়াত দিয়েছিলেন। এখন আপনি তার রুহ কবয করে নিয়েছেন এবং আপনি তার প্রকাশ্য ও অপ্রকাশ্য ব্যাপারে অধিক অবহিত। আমরা তার জন্য সুপারিশকারী হিসাবে এসেছি। আপনি তাকে ক্ষমা করুন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3201,
			"arabicnumber": 3201,
			"text": "মূসা ইবন মারওয়ান রুককী (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনৈক ব্যক্তির জানাযার নামায আদায়ের পর এরূপ দু'আ করেনঃ ইয়া আল্লাহ্‌! আপনি আমাদের জীবিত ও মৃতদের ক্ষমা করুন। আমাদের ছোট ও বড়, পুরুষ ও স্ত্রী, উপস্থিত ও অনুপস্থিত সকলকে ক্ষমা করুন। ইয়া আল্লাহ্‌! আপনি আমাদের মাঝে যাকে জীবিত রাখেন, তাকে ঈমানের উপর জীবিত রাখুন এবং যাকে মৃত্যু দেন, তাকে ইসলামের উপর মৃত্যু দান করুন। ইয়া আল্লাহ্‌! আপনি আমাদের বিনিময় হতে মাহরূম করবেন না এবং এরপর আর আমাদের গুমরাহ করবেন না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3202,
			"arabicnumber": 3202,
			"text": "আবদুর রহমান ইবন ইব্‌রাহীম দিমাশকী (রহঃ) ..... ওয়াছিলা ইবন আসকা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে জনৈক ব্যক্তির জানাযার নামায আদায় করি। তখন আমি তাঁকে এরুপ দু'আ করতে শুনিঃ \"ইয়া আল্লাহ্‌! নিশ্চয় অমুকের পুত্র অমুক আপনার যিম্মায়। আপনি তাকে কবরের আযাব হতে রক্ষা করুন।\" রাবী আবদুর রহমান এরূপ দু'আর কথা বলেছেনঃ \"এ ব্যক্তি আপনার যিম্মায় এবং আপনার প্রতিবেশী। আপনি একে কবরের আযাবের ফিতনা ও জাহান্নামের আগুন হতে রক্ষা করুন। আপনি ওয়াদা পূর্ণকারী এবং সত্যের প্রতীক। ইয়া আল্লাহ্‌! আপনি একে ক্ষমা করুন এবং তার উপর রহম করুন। আপনি মহাক্ষমাশীল, মেহেরবান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3203,
			"arabicnumber": 3203,
			"text": "সুলায়মান ইবন হারব ও মুসাদ্দাদ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ জনৈক কালো বর্ণের মহিলা বা পুরুষ মসজিদে নববী ঝাঁড়ু দিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে দেখতে না পেয়ে লোকদের নিকট তার সম্পর্কে জিজ্ঞাসা করেন। তখন তাকে বলা হয়ঃ সে মারা গেছে। তখন তিনি বলেনঃ তোমরা আমাকে এ সম্পর্কে কেন অবহিত করলে না? তিনি বলেনঃ তোমরা আমাকে তার কবর দেখিয়ে দাও। তখন লোকেরা কবর দেখিয়ে দিলে তিনি তার কবরের উপর জানাযার নামায আদায় করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3204,
			"arabicnumber": 3204,
			"text": "আল-কানা'বী (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকদের নাজ্জাশীর মৃত্যুর দিনে তার ইন্তিকালের খবর জানিয়ে দেন। তিনি তাঁদের সঙ্গে নিয়ে ঈদগাহে সমবেত হন এবং তাঁদের কাতারবন্দী করে চার তাকবীরের সাথে (নাজ্জাশীর) সালাতুল জানাযা আদায় করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3205,
			"arabicnumber": 3205,
			"text": "আব্বাদ ইবন মূসা (রহঃ) .... আবূ বুরদা তাঁর পিতা (রাঃ) হতে বর্ণনা করেছেন। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের এ মর্মে নির্দেশ দেন যে, আমরা যেন নাজ্জাশীর দেশে গমন করি। অতঃপর তাঁর কথা বর্ণনা করেন। নাজ্জাশী বলেনঃ আমি সাক্ষ্য দিচ্ছি যে, তিনি আল্লাহর রাসূল। আর তিনি সেই ব্যক্তি, যাঁর সম্পর্কে ঈসা ইবন মারয়াম সুসংবাদ দিয়েছেন। আমি যদি রাষ্ট্র পরিচালনার কাজে ব্যস্ত না থাকতাম, তবে অবশ্যই তাঁর নিকট হাযির হতাম, এমনকি তাঁর জুতাজোড়া বহন করতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3206,
			"arabicnumber": 3206,
			"text": "আবদুল ওয়াহহাব ইবন নাজদা (রহঃ) .... মুত্তালিব (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ যখন উছমান ইবন মায'ঊন (রাঃ) ইনতিকাল করেন, তখন তাঁর জানাযা (লাশ) বের করা হয়, অতঃপর দাফন করা হয়। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনৈক ব্যক্তিকে একখণ্ড পাথর আনার জন্য নির্দেশ দেন। কিন্তু সে তা বহন করতে অক্ষম হয়। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেটি নিজে আনার জন্য অগ্রসর হন এবং তাঁর দু'হাতের জামার আস্তিন গুটিয়ে ফেলেন। রাবী কাছীর বলেনঃ মুত্তালিব (রহঃ) বলেছেন, যে ব্যক্তি আমার কাছে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ হাদীছ বর্ণনা করেছেন, তিনি বলেছেনঃ এ সময় আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উভয় বগলের সাদা অংশ দেখতে পাই, যখন তিনি তাঁর দু'হাতের জামার আস্তিন গুটান এবং সে পাথর বয়ে নিয়ে এসে তার (উছমান ইবন মাযঊনের) শিয়রে রাখেন। আর তিনি বলেনঃ এর দ্বারা আমি আমার ভাইয়ের কবর চিহ্নিত করছি। আমি এর পাশে তাদের দাফন করব, যারা আমার পরিবার থেকে মারা যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3207,
			"arabicnumber": 3207,
			"text": "আল-কা'নবী (রহঃ) ..... আইশা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মৃত ব্যক্তির হাঁড় চূর্ণ করা, জীবিত ব্যক্তির হাঁড় চূর্ণ করার মত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3208,
			"arabicnumber": 3208,
			"text": "ইসহাক ইবন ইসমাঈল (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ 'লাহাদ' (বুগলী বা পাশ কবর) আমাদের জন্য এবং 'শাক' (খোলা বা সিন্দুক কবর) আমাদের ব্যতীত অন্যদের।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3209,
			"arabicnumber": 3209,
			"text": "আহমদ ইবন ইউনুস (রহঃ) ...... আমির (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আলী (রাঃ), ফযল (রাঃ) এবং উসামা ইবন যায়দ (রাঃ) গোসল দিয়েছিলেন এবং এরাই তাকে কবরে নামিয়েছিলেন। রাবী বলেনঃ আমার নিকট মারহাব অথবা ইবন আবী মারহাব বর্ণনা করেছেন যে, তাঁরা আবদুর রহমান ইবন আওফ (রাঃ)-কেও তাদের সংগে নিয়েছিলেন। তাঁরা দাফনক্রিয়া শেষ করলে আলী (রাঃ) বলেনঃ প্রত্যেক ব্যক্তির (দাফনের) কাজ তার স্বজনদের করা উচিত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3210,
			"arabicnumber": 3210,
			"text": "মুহাম্মদ ইবন সাব্বাহ (রহঃ) .... আবূ মারহাব (রাঃ) থেকে বর্ণিত। আবদুর রহমান ইবন আওফ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কবরে অবতরণ করেছিলেন। রাবী মারহাব বলেনঃ আমি এখনও তাঁদের চারজনকে দেখছি, অর্থাৎ আলী (রাঃ), ফযল ইবন আব্বাস (রাঃ), উসামা (রাঃ) এবং আবদুর রহমান ইবন আওফ (রাঃ)-কে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3211,
			"arabicnumber": 3211,
			"text": "উবায়দুল্লাহ ইবন মু'আয (রহঃ) .... আবূ ইসহাক (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ হারিছ (রাঃ) এরূপ ওসীয়ত করেন যে, আবদুল্লাহ ইবন ইয়াযীদ যেন তাঁর জানাযার নামায পড়ান। সে মতে তিনি [আবদুল্লাহ্‌ (রাঃ)] তাঁর জানাযার নামায পড়ান এবং তাঁর পায়ের দিক হতে তাঁকে কবরে নামান, আর বলেনঃ এটাই সুন্নাত তরীকা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3212,
			"arabicnumber": 3212,
			"text": "উছমান ইবন আবী শায়বা (রহঃ) ..... বারা ইবন আযিব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সংগে জনৈক আনসার সাহাবীর জানাযার নামায পড়ার জন্য গমন করি। আমরা কবরের নিকট পৌছে দেখতে পাই যে, তখনও কবর খোঁড়া শেষ হয়নি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখানে কিব্‌লার দিকে মুখ করে বসে পড়েন এবং আমরাও তাঁর সঙ্গে বসে পড়ি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3213,
			"arabicnumber": 3213,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) .... ইবন উমার (রাঃ) থেকে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মৃত ব্যক্তিকে কবরে রাখতেন, তিনি বলতেনঃ بِسْمِ اللَّهِ وَعَلَى سُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم অর্থাৎ আল্লাহ্‌র নামের সাথে এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সুন্নাত তরীকায় (এ ব্যক্তিকে কবরে রাখছি)। এটি মুসলিম (রহঃ)-এর ভাষ্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3214,
			"arabicnumber": 3214,
			"text": "মুসাদ্দাদ (রহঃ) ..... আলী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ মর্মে অবহিত করি যে, আপনার বৃদ্ধ পথভ্রষ্ট চাচা (আবূ তালিব) মারা গেছেন। তখন তিনি বলেনঃ যাও এবং তোমার পিতাকে মাটির মধ্যে দাফন করে এস। আমার কাছে ফিরে আসার আগে আর কিছু করবে না। এরপর আমি যাই এবং তার লাশকে দাফন করি এবং তাঁর কাছে ফিরে আসি। তখন তিনি আমাকে গোসলের নির্দেশ দেন। আমি গোসল শেষ করলে তিনি আমার জন্য দু’আ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3215,
			"arabicnumber": 3215,
			"text": "আবদুল্লাহ্‌ ইবন মাসলামা কা'নবী (রহঃ) .... হিশাম ইবন আমির (রাঃ) থেকে বর্ণিত। উহুদের যুদ্ধ শেষে আনসার সাহাবীগণ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হয়ে বলেনঃ আমরা আহত হয়েছি এবং খুবই ক্লান্ত; এখন আপনি আমাদের কি করতে বলেন? তিনি বলেনঃ তোমরা প্রশস্ত করে কবর খোঁড় এবং প্রত্যেক কবরে দুই-দুই এবং তিন-তিন ব্যক্তিকে দাফন কর। তখন তাঁকে জিজ্ঞাসা করা হয়ঃ আগে কাকে রাখব? তিনি বলেনঃ যে ব্যক্তি কুরআন সম্পর্কে অভিজ্ঞ, তাকে আগে রাখবে। রাবী বলেনঃ আমার পিতা আমির (রাঃ)-ও সেদিন শাহাদতপ্রাপ্ত হন, যাঁকে দুই অথবা এক ব্যক্তির সঙ্গে (একই কবরে) দাফন করা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3216,
			"arabicnumber": 3216,
			"text": "আবূ সালিহ (রহঃ) .... হুমায়দ ইবন হিলাল (রহঃ) উপরিউক্ত সনদে ও অর্থে হাদীছ বর্ণনা করেছেন। যাতে এরূপ অতিরিক্ত বর্ণনা করেছেনঃ তোমরা গভীর গর্ত করে কবর খুঁড়বে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3217,
			"arabicnumber": 3217,
			"text": "মূসা ইবন ইসমাঈল (রহঃ) ... সা'দ ইবন হিশাম ইবন আমির (রহঃ) থেকে পূর্বোক্ত হাদীছের অনুরুপ বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3218,
			"arabicnumber": 3218,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) ..... আবূ হায়্যাজ আসদী (রহঃ) থেকে বর্ণিত। তিনি বলেন, একদা আলী (রাঃ) আমাকে পাঠান এবং বলেনঃ আমি কি তোমাকে এমন একটি কাজের জন্য প্রেরণ করবো যে কাজের জন্য আমাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাঠান? (তা হলোঃ) আমি যেন কোন উঁচু কবর সমান করা ছাড়া এবং কোন মূর্তি ভেঙ্গে যমীনের সাথে মিশিয়ে দেওয়া ছাড়া, নিবৃত্ত না হই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3219,
			"arabicnumber": 3219,
			"text": "আহমদ ইবন আমর ইবন সারহা (রহঃ) .... আবূ আলী হামদানী (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা ফুযালার সঙ্গে রোম দেশের রাওযেস নামক স্থানে ছিলাম। সেখানে আমাদের একজন সাথী ইনতিকাল করেন। তখন ফুযালার নির্দেশে সে ব্যক্তির কবর মাটির সমান করে দেওয়া হয়। এরপর তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কবর সমান করে দেওয়ার হুকুম দিতে শুনেছি। আবূ দাউদ (রহঃ) বলেনঃ রাওযেস হলো সমুদ্রের মাঝে অবস্থিত একটি দ্বীপের নাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3220,
			"arabicnumber": 3220,
			"text": "আহমদ ইবন সালিহ (রহঃ) ...... কাসিম (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি আইশা (রাঃ)-এর নিকট উপস্থিত হয়ে বলি যে, হে আমার প্রিয় মাতা! আপনি আমার জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং তাঁর দু'জন সঙ্গী [আবূ বকর সিদ্দীক (রাঃ) ও উমার (রাঃ)]-এর কবর উন্মোচন করুন। তখন তিনি আমার জন্য তিনটি কবরের (আবরণ) উন্মোচন করেন, যা বেশী উঁচু ছিল না এবং বেশী নীচুও ছিল না; (বরং মাটি হতে এক বিঘত উঁচু ছিল)। আর এগুলের উপর ময়দানের লাল কাঁকর ছড়ানো ছিল। রাবী আবূ আলী বলেনঃ এরূপ বলা হতো যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সম্মুখ ভাগে; আবূ বাকর (রাঃ) তাঁর পবিত্র মাথার নিকট এবং উমার (রাঃ) তাঁর কদম বরাবর অবস্থিত। অর্থাৎ উমার (রাঃ)-এর মাথা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর দু' পা বরাবর অবস্থিত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3221,
			"arabicnumber": 3221,
			"text": "ইবরাহীম ইবন মূসা রাযী (রহঃ) .... উছমান ইবন আফফান (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কোন মৃত ব্যক্তির দাফন পক্রিয়া সম্পন্ন করতেন, তখন তিনি কবরের পাশে দাঁড়িয়ে বলতেনঃ তোমরা তোমাদের ভাইয়ের জন্য মাগফিরাত কামনা কর এবং সে যেন সুদৃঢ় থাকতে পারে, তার জন্য দু’আ কর। কেননা, এখনই তাকে জিজ্ঞাসাবাদ করা হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3222,
			"arabicnumber": 3222,
			"text": "ইয়াহ্‌ইয়া ইবন মূসা বালখী (রহঃ) ...... আনাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইসলামে কোন আকর নেই। রাবী আবদুর রাযযাক (রহঃ) বলেনঃ জাহিলিয়াতের যুগে লোকেরা (মৃত ব্যক্তির) কবরের পাশে গিয়ে গরু বা ছাগল যবাহ করতো এ ধরনের কাজকে আকর বলা হয়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ করতে নিষেধ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3223,
			"arabicnumber": 3223,
			"text": "কুতায়বা ইবন সাঈদ (রহঃ) ..... উকবা ইবন আমির (রাঃ) থেকে বর্ণিত। একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদীনা হতে বের হন এবং উহুদ-যুদ্ধের শহীদদের (কবরের উপর) জানাযার নামায আদায় করে ফিরে আসেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3224,
			"arabicnumber": 3224,
			"text": "হাসান ইবন আলী (রহঃ) ..... ইয়াযীদ ইবন আবী হাবীব (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উহুদ যুদ্ধের শহীদদের (কবরের উপর) আট বছর পরে গিয়ে এভাবে জানাযার নামায পড়েন, যেন তিনি জীবিত এবং মৃত ব্যক্তিদের নিকট হতে বিদায় নিচ্ছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3225,
			"arabicnumber": 3225,
			"text": "আহমদ ইবন হাম্বল (রহঃ) ...... জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি এরূপ শুনেছি যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কবরের উপর উপবেশন করতে, কবর পাকা করতে এবং কবরের উপর সৌধ নির্মাণ করতে নিষেধ করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3226,
			"arabicnumber": 3226,
			"text": "মুসাদ্দাদ ও উছমান ইবন আবী শায়বা (রহঃ) ..... জাবির (রাঃ) থেকে এরূপ বর্ণিত আছে। আবূ দাঊদ (রহঃ) বলেন, উছমান (রহঃ) বলেছেনঃ এর থেকে কিছু অধিক বর্ণনা আছে। সুলায়মান ইবন মূসা (রহঃ) এ অতিরিক্ত বিষয় বর্ণনা করেছেন যে, তার (কবরের) উপর বসে কিছু লিখতে নিষেধ করেছেন। রাবী মুসাদ্দাদ (রহঃ) তাঁর হাদীছে এ বাক্যটি উল্লেখ করেননি। রাবী আবূ দাউদ (রহঃ) বলেনঃ মুসাদ্দাদ (রহঃ)-এর বর্ণনায় এ শব্দটির অর্থ আমার নিকট অজ্ঞাত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3227,
			"arabicnumber": 3227,
			"text": "আল-কা'নবী (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ্‌ তা'আলা ইয়াহূদীদের ধ্বংস করুন। কেননা, তারা তাদের নবীদের কবরকে মাসজিদ বানিয়ে নিয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3228,
			"arabicnumber": 3228,
			"text": "মুসাদ্দাদ (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যদি কোন আগুনের ফুলকির উপর উপবেশন করে, ফলে তার কাপড় পুড়ে আগুন চামড়া পর্যন্ত পৌছে যায়-এটি তার জন্য কবরের উপর বসার চাইতে উত্তম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3229,
			"arabicnumber": 3229,
			"text": "ইবরাহীম ইবন মূসা রাযী (রহঃ) ..... বুসর ইবন উবায়দিল্লাহ (রহঃ) বলেন, আমি ওযাসেলা ইবন আসকা (রহঃ)-কে বলতে শুনেছি যে, আমি আবূ মারছাদ গানবী (রাঃ)-কে এরূপ বলতে শুনেছি, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা কবরের উপর বসবে না এবং কবরের দিকে মুখ ফিরিয়ে সালাত আদায় করবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3230,
			"arabicnumber": 3230,
			"text": "সাহল ইবন বাক্কার (রহঃ) ..... রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আযাদকৃত গোলাম বাশীর (রাঃ) থেকে বর্ণিত। জাহিলিয়াতের যুগে তার নাম ছিল যাহম ইবন মা'বাদ। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে হিজরত করেন। এ সময় তিনি তাকে জিজ্ঞাসা করেনঃ তোমার নাম কি? তখন তিনি বলেনঃ যাহম। এতদশ্রবণে তিনি বলেনঃ বরং তুমি হলে বাশীর। তিনি বলেনঃ যখন আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সংগে হাঁটছিলাম এবং তিনি মুশরিকদের কবরের পাশ দিয়ে যাচ্ছিলেন, তখন তিনি বলেনঃ এরা অধিক কল্যাণপ্রাপ্তির আগে চলে গেছে। তিনি এরূপ তিন বার বলেন। অতঃপর তিনি মুসলিমদের কবরের পাশ দিয়ে গমনকালে বলেনঃ এরা অধিক কল্যাণ হাসিল করেছে। ইত্যবসরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দেখতে পান যে, জনৈক ব্যক্তি দুপায়ে জুতা দিয়ে কবরস্থানের মাঝে হাঁটছে। তখন তিনি তাকে বলেনঃ হে দু'পায়ে জুতা পরিহিত ব্যক্তি! তোমার জন্য আফসোস! তুমি তোমার দু'পায়ের জুতা খুলে ফেল! সে ব্যক্তি লক্ষ্য করে যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে চিনতে পারলো, তখন সে তার দু'পায়ের জুতা খুলে দূরে নিক্ষেপ করলো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3231,
			"arabicnumber": 3231,
			"text": "মুহাম্মদ ইবন সুলায়মান আনবারী (রহঃ) .... আনাস (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেনঃ যখন কোন বান্দাকে কবরে রাখা হয় এবং তার সাথীরা তার থেকে ফিরে আসে, তখনও সে তাদের জুতার শব্দ শুনতে পায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3232,
			"arabicnumber": 3232,
			"text": "সুলায়মান ইবন হারব (রহঃ) ...... জাবির (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমার পিতার সঙ্গে অপর এক ব্যক্তিকে একই কবরে দাফন করা হয়। এজন্য আমার ধারণা ছিল যে, আমি তাঁর লাশ অন্যত্র সরিয়ে নেব। সে মতে ছ’মাস পর আমি তাঁর (পিতার) লাশ সরিয়ে নেই। এ সময় তাঁর শরীরের আকৃতিতে কোনরূপ পরিবর্তন আসেনি। অবশ্য তাঁর কয়েকটি দাঁড়ি, যা মাটির সাথে মিশে ছিল, তা পরিবর্তিত হয়ে গিয়েছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3233,
			"arabicnumber": 3233,
			"text": "হাফস ইবন উমার (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ কয়েক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে একটা জানাযার (লাশের) পাশ দিয়ে গমনকালে মৃত ব্যক্তির প্রশংসা করেন। তখন তিনি বলেনঃ ওয়াজিব হয়ে গেছে (অর্থাৎ তাঁর জন্য জান্নাত ওয়াজিব)। অতঃপর তাঁরা অন্য একটি জানাযার পাশ দিয়ে গমনকালে সে ব্যক্তি সম্পর্কে খারাপ উক্তি করলে তিনি বলেনঃ ওয়াজিব হয়ে গেছে (অর্থাৎ তার জন্য জাহান্নাম ওয়াজিব)। এরপর তিনি বলেনঃ তোমরা একজন অপর জনের জন্য সাক্ষী স্বরূপ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3234,
			"arabicnumber": 3234,
			"text": "মুহাম্মদ ইবন সুলায়মান আনবারী (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর আম্মাজানের কবর যিয়ারত করার জন্য গমন করেন। এ সময় তিনি কাঁদেন এবং তাঁর সাথীরাও কাঁদেন। এরপর তিনি বলেনঃ আমি আমার রবের কাছে, আমার মায়ের জন্য ইস্তিগফার করতে চাইলে তিনি আমাকে অনুমতি দেননি। অতঃপর আমি তাঁর কবর যিয়ারত করতে চাইলে তিনি এর অনুমতি দিয়েছেন। কাজেই তোমরা কবর যিয়ারত করবে। কেননা, এ মৃত্যুকে স্মরণ করিয়ে দেয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3235,
			"arabicnumber": 3235,
			"text": "আহমদ ইবন ইউনুস (রহঃ) ..... ইবন বুরায়দা (রহঃ) তাঁর পিতা হতে বর্ণনা করেছেন। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইতিপূর্বে আমি তোমাদের কবর যিয়ারত করতে নিষেধ করেছিলাম। এখন তোমরা কবর যিয়ারত করবে। কেননা, কবর যিয়ারতের ফলে মৃত্যুর কথা স্মরণ হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3236,
			"arabicnumber": 3236,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কবর যিয়ারতকারিণী মহিলাদের উপর লা'নত করেছেন। আর যারা কবরের উপর মসজিদ বানায় এবং বাতি জ্বালায়, তাদের উপরও তিনি অভিসম্পাত করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3237,
			"arabicnumber": 3237,
			"text": "আল-কা'নবী (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কবরস্থানে গমন করেন। তখন তিনি বলেনঃ السَّلاَمُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ অর্থাৎ তোমাদের উপর শান্তি বর্ষিত হোক, হে মু'মিনদের গৃহে বসবাসকারী। আর অবশ্যই আমরা ইনশাআল্লাহ্‌ তোমাদের সাথে মিলিত হব।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3238,
			"arabicnumber": 3238,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) .... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এমন এক ব্যক্তিকে আনা হয়, যার উট তার ঘাড় ভেঙ্গে দিয়েছিল। ফলে সে মারা যায়, আর সে ব্যক্তি ইহরাম অবস্থায় ছিল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তাঁকে দু'টি কাপড়ে কাফন দেবে এবং কুলের পাতা মিশান পানি দিয়ে তাঁর গোসল দেবে এবং তাঁর মাথা ঢাকবে না। কেননা, আল্লাহ্‌ তা'আলা তাঁকে কিয়ামতের দিন তালবিয়া (লাব্বায়েক, আল্লাহুমা লাব্বায়েক) পাঠরত অবস্থায় উঠাবেন। আবূ দাঊদ (রহঃ) বলেনঃ আমি আহমদ ইবন হাম্বল (রহঃ)-কে এরূপ বলতে শুনেছি যে, উক্ত হাদীছে পাঁচটি সুন্নাতের কথা উল্লেখ আছে। যথাঃ (১) মৃত ব্যক্তিকে দুটি কাপড়ে কাফন দেওয়া, (২) কুলের পাতা মিশান পানি দিয়ে গোসল দেওয়া, (৩) ইহরাম অবস্থায় মৃত্যু বরনকারীর মাথা না ঢাকা, (৪) তার দেহে খোশবু না লাগান এবং (৫) (ইহরাম অবস্থায় মৃত ব্যক্তির কাছে যে টাকা থাকে) সে টাকা হতে প্রথমে তার দাফন-কাফনের ব্যবস্থা করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3239,
			"arabicnumber": 3239,
			"text": "সুলায়মান ইবন হারব ও মুহাম্মদ ইবন উবায়দ (রহঃ) ..... ইবন আব্বাস (রাঃ) থেকে এরূপ বর্ণিত আছে। তিনি বলেছেনঃ তাঁকে (ইহরাম অবস্থায় মৃত ব্যক্তি) দুটি কাপড়ে কাফন দেবে। আবূ দাঊদ (রহঃ) বলেন, সুলায়মান বলেছেন যে, আবূ আইয়ুব বর্ণনা করেছেনঃ তাঁকে (মৃত মুহরিম ব্যক্তি) দুটি কাপড়ে কাফন দিতে হবে। রাবী আমর (রহঃ) বলেছেনঃ দুটি কাপড়ে কাফন দিতে হবে। ইবন উবাইদ বলেন, রাবী আইয়ুব বলেছেনঃ দুটি কাপড়ে কাফন দিতে হবে। আমর (রাঃ) বলেছেনঃ দুটি কাপড়ে কাফন দিতে হবে। রাবী সুলায়মান একা এরূপ অতিরিক্ত বর্ণনা করেছেন যে, তার দেহে খোশবু লাগাবে না (কারণ ইহরাম অবস্থায় খোশবু ব্যবহার নিষেধ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3240,
			"arabicnumber": 3240,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3241,
			"arabicnumber": 3241,
			"text": "উছমান ইবন আবী শায়বা (রহঃ) .... ইবন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ জনৈক ব্যক্তিকে তার উট ঘাড় ভেঙ্গে মেরে ফেলে। তখন সে ব্যক্তিকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আনা হলে তিনি বলেনঃ তাঁকে গোসল দিয়ে কাফন পরাও এবং তার মাথা ঢাকবে না। আর তার দেহে খোশবু লাগাবে না। কেননা, কিয়ামতের দিন সে তালবিয়া পাঠ করতে করতে উঠবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 153
			}
		}
	]
}