{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"37": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4240,
			"arabicnumber": 4240,
			"text": "উছমান ইব্‌ন আবূ শায়বা (রহঃ) ..... হুযায়ফা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সামনে দাঁড়িয়ে কিয়ামত পর্যন্ত যা ঘটবে, সে সব ঘটনার বর্ণনা দেন। যারা তা হিফাজত করেছে, তারা উত্তম কাজ করেছে; আর যারা তা ভুলে গেছে, তারা ভুলেই গেছে। আমার সাথীগণ তা জানে এবং চিনে। যখন তাদের সামনে ঐ ধরনের কিছু সংঘটিত হয়, তখন তাদের তা ঐরূপ স্মরণ আসে, যেরূপ কোন পরিচিত ব্যক্তি বহুদিন অনুপস্থিত থাকার পর তাকে দেখা মাত্রই চিনে ফেলে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4241,
			"arabicnumber": 4241,
			"text": "হারূন ইব্‌ন আবদুল্লাহ্‌ (রহঃ) .... আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এ উম্মতের মধ্যে চারটি বড় ফিতনা সৃষ্টি হবে, এরপর কিয়ামত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4242,
			"arabicnumber": 4242,
			"text": "ইয়াহ্‌ইয়া ইব্‌ন উছমান (রহঃ) .... আবদুল্লাহ্‌ ইব্‌ন উমার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদিন আমরা রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে বসে ছিলাম। এ সময় তিনি ফিত্‌না সম্পর্কে দীর্ঘ আলোচনা করেন; এমন কি তিনি ‘ইহ্‌লাসের’ ফিত্‌নার কথাও উল্লেখ করেন। এ সময় জনৈক ব্যক্তি জিজ্ঞাসা করেঃ ইয়া রাসূলাল্লাহ্‌! ‘ইহ্‌লাসের’ ফিত্‌নাটা কিরূপ? তিনি বলেনঃ তা হলো-পলায়ন ও ধ্বংস। এরপর তিনি সারা’ ফিত্‌নার কথা উল্লেখ করে বলেনঃ তা এমন এক ব্যক্তির দ্বারা সংঘটিত হবে, যাকে লোকেরা আমার বংশের লোক বলে মনে করবে, কিন্তু আসলে সে আমার বংশের লোক হবে না। কেননা, আমার বন্ধু-বান্ধব তো মুত্তাকী লোকেরাই। এরপর লোকেরা এমন এক ব্যক্তির নেতৃত্বের উপর একমত হবে, যে দুর্বল চিত্ত ও লেংড়া হবে। (তার শাসনকাল দীর্ঘ হবে না।) এরপর চরম ফিত্‌তা প্রকাশ পাবে, যা এ উম্মতের কাউকে এক চড় না দিয়ে ছাড়বে না। এরপর লোকেরা যখন বলাবলি করতে থাকবে যে, ফিত্‌নার সময় শেষ হয়ে গেছে, তখন তা আরো বৃদ্ধি পাবে। তখন এমন অবস্থার সৃষ্টি হবে, সকালে যে মু’মিন থাকবে, সে সন্ধ্যায় কাফির হয়ে যাবে। এ সময় লোকেরা বিভিন্ন দুর্গে আশ্রয় গ্রহণ করবে। আর মুসলিমরা যে দুর্গে অবস্থান করবে, সেখানে কোন মুনাফিক থাকবে না এবং যেখানে মুনাফিকরা থাকবে, সেখানে কোন মু’মিন লোক থাকবে না। তোমরা যখন এ অবস্থায় পৌঁছবে, তখন দাজ্জাল বের হওয়ার অপেক্ষা করবে-ঐ দিন থেকেই বা পরের দিন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4243,
			"arabicnumber": 4243,
			"text": "মুহাম্মদ ইব্‌ন ইয়াহ্‌ইয়া (রহঃ) .... হুযায়ফা (রাঃ) থেকে বর্ণিত যে, আল্লাহ্‌র শপথ! আমি জানি না, আমার সাথীরা ভুলে গেছে কিনা? আল্লাহ্‌র কসম! রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিয়ামত পর্যন্ত ফিতনা সৃষ্টিকারী কোন ব্যক্তির কথা উল্লেখ করতে বাদ দেননি, যাদের সংখ্যা হবে তিন শ’রও বেশী। তিন তাদের নাম, তাদের পিতার নাম এবং তাদের গোত্রের নাম আমাদের নিকট উল্লেখ করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4244,
			"arabicnumber": 4244,
			"text": "মুসাদ্দাদ (রহঃ) .... সুবাই’ ইব্‌ন খালিদ (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ যখন ‘তাস্‌তুর’ নামক স্থান বিজিত হয়, তখন আমি একটি খচ্চর কেনার জন্য কূফায় গমন করি। সেখানে মসজিদে প্রবেশ করে সেখানে কিছু লোককে বসে থাকতে দেখি। আর সেখানে এমন একজনকে বসা দেখতে পাই, যাকে দেখে আমার মনে হয়, লোকটি হিজাযের অধিবাসী। তিনি বলেনঃ আমি জিজ্ঞাসা করি, ইনি কে? এরূপ জিজ্ঞাসা করাতে লোকেরা আমার প্রতি বিরক্ত হয়ে বলেঃ তুমি এ ব্যক্তিকে চিন না? ইনি তো রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবী হুযায়ফা ইবন ইয়ামান (রাঃ)। তখন হুযায়ফা (রাঃ) বলেনঃ লোকেরা রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট কল্যাণ ও মঙ্গলের বিষয়াদী সম্পর্কে জিজ্ঞাসা করতো এবং আমি তাঁর নিকট অকল্যাণের বিষয়াদী সম্পর্কে জিজ্ঞাসা করতাম। এ কথা শুনে লোকেরা তাঁর প্রতি বিস্ময়ের দৃষ্টিতে তাকাতে থাকলে, তিনি বলেনঃ আমার কথা যারা খারাপ মনে করে, আমি তাদের দেখতে পাচ্ছি। এরপর তিনি বলেন, একদা আমি বলিঃ ইয়া রাসূলাল্লাহ্‌! মহান আল্লাহ্‌ আমাদের যে কল্যাণ ও মঙ্গল দান করেছেন, এরপর কি আবার খারাপ অবস্থার সৃষ্টি হবে, যেমন আগে ছিল? তিনি বলেনঃ হ্যাঁ। আমি বলিঃ এর থেকে বাঁচার ব্যবস্থা কি? তিনি বলেনঃ তরবারি। আমি জিজ্ঞাসা করিঃ ইয়া রাসূলাল্লাহ্‌! এরপর কি হবে? তিনি বলেনঃ এ সময় পৃথিবীতে যদি আল্লাহ্‌র কোন প্রতিনিধি থাকে এবং সে জুলুম করে তোমার পিঠ ভেঙ্গে দেয়, তোমার ধন-সম্পদ লুট করে নেয়, তবুও তুমি তার আনুগত্য করবে। আর যদি এরূপ কেউ না থাকে, তবে তুমি জঙ্গলে চলে যাবে এবং গাছের লতা-পাতা খেতে খেতে মরে যাবে। আমি আরো জিজ্ঞাসা করিঃ এরপর কি হবে? তিনি বলেনঃ এরপর দাজ্জাল বের হবে, যার সাথে নহর ও আগুন থাকবে। যে তার আগুনে নিক্ষিপ্ত হবে, সে অবশ্যই ছওয়াব পাবে এবং তার গুনাহ মাফ হয়ে যাবে। আর যে তার নহরে নিক্ষিপ্ত হবে, সে অবশ্যই গুনাহ্‌গার হবে এবং তার নেকী বরবাদ হবে। রাবী বলেনঃ আমি বললামঃ এরপর কি হবে? তিনি বললেনঃ এরপর কিয়ামত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4245,
			"arabicnumber": 4245,
			"text": "মুহাম্মদ ইব্‌ন ইয়াহ্‌ইয়া (রহঃ) ...... খালিদ ইব্‌ন ইয়াশ্‌কুরী (রহঃ) থেকে বর্ণিত। রাবী হুযায়ফা (রাঃ) বলেনঃ আমি জিজ্ঞাসা করিঃ তরবারির পরে কি অবস্থা হবে? (অর্থাৎ তরবারি দিয়ে কাফির মুশরিকদের ধ্বংসের পর কি হবে?) তিনি বলেনঃ এমন লোক অবশিষ্ট থাকবে, যাদের অন্তর ফিতনা-ফ্যাসাদে পরিপূর্ণ থাকবে। এরপর হাদীছের শেষ পর্যন্ত বর্ণিত হয়েছে। রাবী বলেনঃ কাতাদা (রহঃ) এ ফিতনাকে ঐ সময়ের ঘটনারূপে উল্লেখ করেন, যা আবূ বকর (রাঃ)-এর সময় ধর্মত্যাগীদের সাথে অনুষ্ঠিত হয় অর্থাৎ রিদ্দার যুদ্ধ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4246,
			"arabicnumber": 4246,
			"text": "আবদুল্লাহ্‌ ইব্‌ন মাসলামা (রহঃ) .... নাসর ইব্‌ন আসিম লায়ছি (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমরা লায়ছ-গোত্রের প্রতিনিধিদের সাথে ইয়াশ্‌কুরী (রহঃ) এর নিকট উপস্থিত হলে, তিনি জিজ্ঞাসা করেনঃ তোমরা কারা? আমরা বলিঃ আমরা লায়ছ গোত্রের লোক। আমরা আপনার কাছে হুযায়ফা (রাঃ) এর হাদীছ সম্পর্কে জিজ্ঞাসা করার জন্য এসেছি। তিনি হাদীছ বর্ণনা প্রসঙ্গে বলেনঃ আমি বলিঃ ইয়া রাসূলাল্লাহ্‌! এ ভাল অবস্থার পর কি খারাপ অবস্থার সৃষ্টি হবে? তিনি বলেনঃ ফিতনার সৃষ্টি হবে। তিনি জিজ্ঞাসা করেনঃ ইয়া রাসূলাল্লাহ্‌! ফিতনা-ফ্যাসাদের পর পুনরায় কি ভালো অবস্থার সৃষ্টি হবে? তিনি বলেনঃ হে হুযায়ফা! আল্লাহ্‌র কিতাবের জ্ঞান অর্জন কর এবং এতে যা আছে তার অনুসরণ কর। তিনি তিনবার একথা বলেন। রাবী হুযায়ফা (রাঃ) বলেনঃ আমি জিজ্ঞাসা করি, ইয়া রাসূলাল্লাহ্‌! এ খারাপ অবস্থার পর কি আবার ভালো অবস্থার সৃষ্টি হবে? তিনি বলেনঃ هُدْنَةٌ عَلَى دَخَنٍ আর এরা হবে এমন এক জামাআত, যাদের দিল অন্ধকারাচ্ছন্ন হবে। রাবী বলেনঃ আমি জিজ্ঞাসা করিঃ هُدْنَةٌ عَلَى دَخَنٍ এর অর্থ কি? ইয়া রাসূলাল্লাহ্‌! তিনি বলেনঃ মানুষের অন্তর বা দিল যে অবস্থায় থাকবে, তা থেকে পরিবর্তিত হবে না। রাবী বলেনঃ তখন আমি বলিঃ ইয়া রাসূলাল্লাহ্‌! এ ভালো অবস্থার পর কি আবার খারাপ অবস্থার সৃষ্টি হবে? তিনি বলেনঃ এরপর সর্বগ্রাসী ফিতনার সৃষ্টি হবে, তখন লোকদের আগুনের দরজার দিকে আহবান করা হবে। অতএব হে হুযায়ফা! যদি তুমি সে সময় পাও, তবে তাদের কারো আনুগত্য করার চাইতে, তোমার জন্য উচিত হবে জঙ্গলে গিয়ে গাছের শিকড়, ফল-মূল ইত্যাদি খেতে খেতে মারা যাওয়া।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4247,
			"arabicnumber": 4247,
			"text": "মুসাদ্দাদ (রহঃ) .... হুযায়ফা (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি তুমি সে ফিতনার যুগে কোন খলীফা না পাও, তবে সেখান থেকে পালিয়ে যাবে। যতক্ষণ না তুমি মারা যাবে, ততক্ষণ জঙ্গলে গিয়ে ফল-মূল খেয়ে জীবন-ধারণ করবে। রাবী হুযায়ফা (রাঃ) বলেনঃ এরপর আমি জিজ্ঞাসা করিঃ (ইয়া রাসূলাল্লাহ্‌!) তারপর কি হবে? তিনি বলেনঃ এ সময় যদি কেউ তার ঘোড়ার-বাচ্চা প্রসব করাতে চায়, তবে সে ব্যক্তি সে সময়ও পাবে বা, বরং এর মধ্যেই কিয়ামত অনষ্ঠিত হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4248,
			"arabicnumber": 4248,
			"text": "মুসাদ্দাদ (রহঃ) ..... আবদুল্লাহ্‌ ইব্‌ন আমর (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি কোন ইমামের নিকট বায়আত গ্রহণ করে, তার উচিত, সাধ্যমত তার আনুগত্য করা। এ সময় যদি অন্য কোন নেতা এসে তাঁর সাথে ঝগড়া শুরু করে দেয়, তবে তাকে হত্যা করবে। রাবী আবদুর রাহমান (রহঃ) বলেনঃ তখন আমি তাঁকে জিজ্ঞাসা করিঃ তুমি কি ইহা রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট থেকে শুনেছ? তিনি বলেনঃ অবশ্যই আমার দু’টি কান তা শ্রবণ করেছে এবং আমার অন্তর তা হিফাজত করেছে। রাবী বলেন, আমি বলিঃ তোমার এই চাচার ছেলে মুআবিয়া আমাদের এরূপ-এরূপ করতে বলে? (অর্থাৎ সে আলী (রাঃ)-এর বিরুদ্ধে যুদ্ধ করতে বলে।) তিনি বলেনঃ সে যেখানে আল্লাহ্‌র আনুগত্য করে, সেখানে তার আনুগত্য করবে এবং সে যেখানে আল্লাহ্‌র নাফরমানী করে, সেখানে তার আনুগত্য করবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4249,
			"arabicnumber": 4249,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4250,
			"arabicnumber": 4250,
			"text": "মুহাম্মদ ইহ্‌ন ইয়াহ্‌ইয়া (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আরবের ঐ ফিতনার প্রতি আফসোস! যা খুবই নিকটবর্তী। যে ব্যক্তি নিজের হাতকে তা থেকে ফিরিয়ে রাখবে, সে নাজাত পাবে। ইমাম আবূ দাঊদ (রহঃ) বলেন, ইব্‌ন ওয়াহাব, জারির, উবায়দুল্লাহ্‌ নাফি’ (রহঃ) সূত্রে ইব্‌ন উমার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সে সময় অতি নিকটবর্তী, যখন মুসলিমদের মদীনাতে ঘিরে ফেলা হবে, এমনকি সব চাইতে দূরে, সালাহ নামক স্থানে, তাদের পতাকাবাহী নেতা হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4251,
			"arabicnumber": 4251,
			"text": "আহমদ ইব্‌ন সালিহ (রহঃ) .... যুহরী (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ সালাহ্‌ হলো-খায়বরের নিকটবর্তী একটি স্থানের নাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4252,
			"arabicnumber": 4252,
			"text": "সুলায়মান ইব্‌ন হার্‌ব (রহঃ) .... ছাওবান (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিশ্চয় আল্লাহ্‌ তা’আলা আমার জন্য যমীনকে সংকুচিত করে দেন। অথবা তিনি বলেনঃ মহান আল্লাহ্‌ যমীনকে আমার জন্য ছোট করে দেন। আর এ সময় আমাকে যমীনের পূর্ব ও পশ্চিম দিক দেখানো হয়। আমার উম্মতের হুকুমত অবশ্যই সে পর্যন্ত পৌঁছবে, যা আমাকে দেখানো হয়েছে। আর আমাকে দু’টি ধন-ভাণ্ডার দেওয়া হয়েছে, লাল এবং সাদা অর্থাৎ সোনা ও রূপা। আমি আমার মহান রবের নিকট এরূপ দু’আ করি, তিনি যেন আমার উম্মতকে এক সাথে ধ্বংস না করেন এবং তাদের উপর এমন কোন শত্রুকে বিজয়ী না করেন, যে তাদের সমূলে ধ্বংস করবে। আমার রব আমাকে বলেনঃ হে মহাম্মদ! আমি যখন কোন হুকুম জারি করে, কখন তা রদ হয় না। তবে আমি তোমার উম্মতকে একই দুর্ভিক্ষের বছর এক সাথে ধ্বংস করবো না এবং তাদের উপর এমন কোন শত্রুকে বিজয় প্রদান করবো না, যে তাদের সমূলে ধ্বংস করবে; তবে তোমার উম্মতের মধ্যে এমন লোক সৃষ্টি হবে, যারা একে অন্যকে ধ্বংস ও বন্দী করবে। তিনি আরো বলেনঃ আমার উম্মতের মধ্যে মধ্যেকার গুমরাহ্‌কারী নেতাদের ব্যাপারে খুবই ভীত-সন্ত্রস্থ। যখন আমার উম্মতের লোকেরা পরস্পর যুদ্ধ-বিগ্রহে লিপ্ত হবে, তখন তা কিয়ামত পর্যন্ত নিরস্ত হবে না। আর কিয়ামত ততক্ষণ পর্যন্ত আনুষ্ঠিত হবে না, যতক্ষণ না আমার উম্মতের সমস্ত গোত্র মুশ্‌রিকদের সাথে মিলে যাবে এবং মূর্তি পূজায় লিপ্ত হবে। তিনি বলেনঃ আমার উম্মতের মধ্যে ত্রিশ জন ভণ্ড নবীর আবির্ভাব ঘটবে, যাদের প্রত্যেকে নিজেকে নবী হিসাবে দাবী করবে। অথচ আমি-ই শেষ নবী, আমার পরে আর কোন নবির আবির্ভাব ঘটবে না। বস্তুত আমার উম্মতের এক জামা’আত সব সময় সত্য ও ন্যায়ের উপর প্রতিষ্ঠিত থাকবে, তাদের বিরোধীপক্ষ তাদের কোনই ক্ষতি করতে পারবে না। এ অবস্থায় মহান আল্লাহ্‌র নির্দেশ অর্থাৎ কিয়ামত এসে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4253,
			"arabicnumber": 4253,
			"text": "মুহাম্মদ ইব্‌ন আওফ (রহঃ) .... আবূ মালিক আশআরী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ্‌ তোমাদের তিন ধরনের ফিত্‌না থেকে বাঁচিয়েছেন। যথাঃ ১। তোমাদের নবী তোমাদের জন্য বদ-দু’আ করবেন না, যাতে তোমরা সবাই এক সাথে হালাক হয়ে যাবে; ২। বাতিলের অনুসারীরা কখনই হকের অনুসারীদের উপর বিজয়ী হতে পারবে না, এবং ৩। তোমরা সবাই এক সাথে গুম্‌রাহ্‌ হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4254,
			"arabicnumber": 4254,
			"text": "মুহাম্মদ ইব্‌ন সুলায়মান (রহঃ) .... আবদুল্লাহ্‌ মাসঊদ (রাঃ) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইসলামের চাকা পঁয়ত্রিশ, ছত্রিশ বা সাইত্রিশ বছর আবরতিত হবে। এ সময় যদি তারা ধ্বংস হয়, তবে তাদের রাস্তা হবে পূর্ববর্তীদের রাস্তার ন্যায়। আর এ সময় যদি তাদের দীন কায়েম হয়, তবে তা তাদের জন্য সত্তর বছর কায়েম থাকবে। রাবী বলেনঃ এ সময় আমি তাঁকে জিজ্ঞাসা করিঃ এ গণনার শুরু কি অতীত কাল হতে শুরু হবে, না সামনে থেকে? তিনি বলেনঃ এ হিসাবের শুরু অতীত থেকে হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4255,
			"arabicnumber": 4255,
			"text": "আহমদ ইব্‌ন সালিহ্‌ (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামত নিকটবর্তী হবে, ‘ইলম (ধর্মীয় জ্ঞান)’ ততই কম হবে এবং ফিতনা প্রকাশ পাবে, লোকজন অধিক কৃপন হবে এবং ‘হারাজ’ বৃদ্ধি পাবে। তখন বলা হয়ঃ ইয়া রাসূলাল্লাহ্‌! হারাজ কি? তিনি বলেন, হত্যা, আর হত্যা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4256,
			"arabicnumber": 4256,
			"text": "উছমান ইব্‌ন আবূ শায়বা (রহঃ) .... মুসলিম (রহঃ) তার পিতা আবূ বকর (রাঃ) থেকে বর্ণনা করেন। তিনি বলেনঃ রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অদূর ভবিষ্যতে এমন একটি ফিতনা প্রকাশ পাবে, যখন শায়িত ব্যক্তি উপবেশনকারীর চাইতে, উপবেশনকারী দণ্ডায়মান ব্যক্তির চাইতে এবং দণ্ডায়মান ব্যক্তি পথচারীর চাইতে উত্তম হবে। তিনি জিজ্ঞাসা করেনঃ ইয়া রাসূলাল্লাহ্‌! আপনি সে সময়ে আমাদের কি করার নির্দেশ দেন? তিনি বলেনঃ সে সময় যার কাছে উট থাকবে, সে যেন তার উটের সাথে গিয়ে মিশে; যার কাছে বকরী থাকবে, সে যেন তার বকরীর সাথে গিয়ে মিশে এবং যার কোন ক্ষেত থাকবে, সে যেন সেদিকে মনোসংযোগ করে বেঁচে থাকার চেষ্টা করে। তিনি বলেনঃ যার এ সবের কিছুই থাকবে না, তার উচিত হবে, তার তরবারির ধার পাথরের উপর আঘাত করে নষ্ট করে ফেলা এবং যথাসম্ভব সে ফিতনা থেকে বেঁচে থাকা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4257,
			"arabicnumber": 4257,
			"text": "ইয়াযীদ ইব্‌ন খালিদ (রহঃ) .... সাঈদ ইব্‌ন আবী ওয়াক্‌কাস (রাঃ) এ হাদিস নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন। তিনি বলেনঃ আমি বলিঃ ইয়া রাসূলাল্লাহ্‌! তখন যদি কেউ আমার ঘরে ঢুকে আমাকে হত্যা করতে চায়, তখন আমি কি করবো? রাবী বলেনঃ তখন রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি আদমের উত্তম সন্তান (হাবিল)-এর মত হবে। এরপর ইয়াযীদ (রহঃ) এ আয়াত তিলাওয়াত করেনঃ (لَئِنْ بَسَطْتَ إِلَىَّ يَدَكَ) অর্থাৎ যদি তুমি আমাকে হত্যার জন্য তোমার হাত আমার দিকে সম্প্রসারিত কর, তবুও আমি তোমাকে হত্যার জন্য আমার হাত বিস্তার করবো না। (মায়িদাঃ ২৮)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4258,
			"arabicnumber": 4258,
			"text": "আমর ইব্‌ন উছমান (রহঃ) .... ইব্‌ন মাসঊদ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এরূপ বলতে শুনেছি। এরপর তিনি আবূ বাক্‌রা (রাঃ) বর্ণিত হাদীছের অনুরূপ বর্ণনা করে বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এ ফিতনায় যারা যারা মারা যাবে, তারা জাহান্নামে যাবে। রাবী বলেনঃ তখন আমি ইব্‌ন মাস’উদ (রাঃ)-কে জিজ্ঞাসা করিঃ এ অবস্থার সৃষ্টি কখন হবে? তিনি বলেনঃ যখন ব্যাপক হত্যা শুরু হবে, এমনকি বন্ধু ও বন্ধুর হাত থেকে রক্ষা পাবে না। আমি বলিঃ যদি আমি সে সময় পাই, তবে আপনি আমাকে কি করতে বলেন? তিনি বলেনঃ তুমি তোমার হাত ও মুখকে নিয়ন্ত্রিত করবে এবং নিজ ঘরে জড়-পদার্থের ন্যায় অবস্থান করবে। এরপর উছমান (রাঃ)-কে যখন শহীদ করা হয়, তখন আমার ধারণা হয় যে, সে ফিতনা শুরু হয়েছে। তখন আমি আমার বাহনে সওয়ার হয়ে দামিশকে চলে যাই এবং সেখানে হুরায়ম ইব্‌ন ফাতিক (রাঃ)-এর সাথে সাক্ষাৎ করি এবং তাঁর কাছে এ হাদীছ বর্ণনা করি। তখন তিনি আল্লাহ্‌র নামে শপথ করেন, যিনি ছাড়া আর কোন ইলাহ্‌ নেই এবং বলেনঃ আমি ও রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এরূপ শুনেছি, যেরূপ তুমি ইব্‌ন মাসঊদ (রাঃ) থেকে বর্ণনা করলে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4259,
			"arabicnumber": 4259,
			"text": "মুসাদ্দাদ (রহঃ) .... আবূ মূসা আশআরী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের আগে ফিতনা এরূপ ধারন করবে, যেরূপ রাতের গভীর আধার। সে সময় লোক সকালে মু’মিন হলে, সন্ধ্যায় কাফিরে পরিণত হবে এবং সন্ধ্যায় মু’মিন হলে, সকালে কাফির হয়ে যাবে। এ সময় উপবেশনকারী দণ্ডায়মান ব্যক্তির চাইতে এবং পদচারী দ্রুতগামী ব্যক্তির চাইতে উত্তম হবে। এ ফিতনার সময় তোমরা তোমাদের তীর-ধনুক ভেঙে ফেলবে এবং তরবারি পাথরের উপর আঘাত করে ভোতা করে ফেলবে। এরপরও যদি কেউ তোমাদের উপর হামলা করতে চায়, তবে সে যেন আদমের উত্তম সন্তান (হাবিল) এর মত হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4260,
			"arabicnumber": 4260,
			"text": "আবুল ওয়ালীদ তায়ালিসী (রহঃ) .... আবদুর রহমান (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি মদীনার এক রাস্তায় ইব্‌ন উমার (রাঃ) এর হাত ধরে ছিলাম। এ সময় ঝলন্ত একটা মাথা দেখে তিনি বলেনঃ এ ব্যক্তির হন্তা চরম হতভাগ্য! সে স্থান অতিক্রম করার পর তিনি বলেনঃ আমি তো তাকে হতভাগ্য বলে মনে করি। কেননা, আমি রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ যে ব্যক্তি আমার কোন উম্মতের কাছে তাকে হত্যার উদ্দেশ্যে যায়, আর সে এরূপ বলে, তবে হত্যাকারী জাহান্নামী হবে এবং নিহত ব্যক্তি জান্নাতে প্রবেশ করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4261,
			"arabicnumber": 4261,
			"text": "মুসাদ্দাদ (রহঃ) .... আবূ যার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেনঃ হে আবূ যার! আমি বলিঃ ইয়া রাসূলাল্লাহ্‌! আমি আপনার খিদমতে হাযির। এরপর তিনি হাদীছ বর্বনা প্রসঙ্গে বলেনঃ তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসা করেন, হে আবূ যার! যখন (মড়কের কারণে) বহু লোক মারা যাবে এবং (লোক না থাকার কারণে) একটি গোলামের বিনিময়ে একটি বাড়ি পাওয়া যাবে, তখন তুমি কি করবে? আমি বলিঃ এ ব্যাপারে আল্লাহ্‌ এবং তাঁর রাসূল সমধিক অভিজ্ঞ; বা আল্লাহ্‌ এবং তাঁর রাসূল আমাকে যা নির্দেশ দেন, (আমি তাই করবো)। তিনি বলেনঃ সে সময় তুমি সবর করবে, অথবা তিনি বলেনঃ তুমি সবর কর। এরপর তিনি বলেনঃ হে আবূ যার! আমি বলিঃ আমি আপনার খিদমতে হাযির। তিনি বলেনঃ যখন তুমি আহ্‌যার-যায়ত’ নামক স্থানটিকে রক্ত-প্লাবিত দেখবে, তখন কি করবে? আমি বলিঃ আল্লাহ্‌ এবং তাঁর রাসূল যা বলেন, আমি তাই করবো। তিনি বলেনঃ তখন তুমি নিজের লোকদের কাছে ফিরে যাবে। রাবী বলেনঃ এরপর আমি জিজ্ঞাসা করিঃ ইয়া রাসূলাল্লাহ্‌! সে সময় আমি তরবারি নিয়ে তা কি কাঁধে ঝুলিয়ে রাখবো না? তিনি বলেনঃ তবে তো তুমি তাদের অন্তর্ভুক্ত হয়ে যাবে। রাবী বলেন, তখন আমি জিজ্ঞাসা করিঃ সে সময় আপনি আমাকে কি করতে বলেন? তিনি বলেনঃ তুমি তোমার ঘরে অবস্থান করবে। আমি বলিঃ তখন যদি হামলা করার জন্য কেউ সেখানে প্রবেশ করে? তিনি বলেনঃ যদি তুমি আক্রমণের আশংকা কর, তবে তোমার মুখ চাদর দিয়ে ঢেকে নেবে (এবং নিহত হয়ে যাবে); ফলে, সে হত্যাকারী তার ও তোমার সমস্ত গুনাহের ভাগী হবে। ইমাম আবূ দাঊদ (রহঃ) বলেনঃ ‘মুশআছ’-কে এ হাদীছে হাম্মাদ ইব্‌ন যায়দ ছাড়া আর কেউ উল্লেখ করেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4262,
			"arabicnumber": 4262,
			"text": "মুহাম্মদ ইব্‌ন ইয়াহ্‌ইয়া (রহঃ) .... আবূ মূসা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের সামনে রাতের গভীর অন্ধকারের ন্যায় ফিতনা-ফ্যাসাদ সংঘটিত হবে। সে সময় একজন সকালে মুসলিম হবে, সন্ধ্যায় কাফিরে পরিণত হবে এবং সে সময় উপবেশনকারী দণ্ডায়মান ব্যক্তি হতে, দণ্ডায়মান ব্যক্তি-চলাফেরাকারী ব্যক্তি হতে এবং চলমান ব্যক্তি দৌড়াদৌড়িকারী ব্যক্তি হতে উত্তম হবে। সাহাবীগণ জিজ্ঞাসা করেনঃ সে সময় আপনি আমাদের কি করতে বলেন? তিনি বলেনঃ তখন তোমরা তোমাদের ঘরের বিছানার ন্যায় (নির্জিব) হয়ে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4263,
			"arabicnumber": 4263,
			"text": "ইব্‌রাহীম ইব্‌ন হাসান (রহঃ) ..... মিকদাদ ইব্‌ন আসওয়াদ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আল্লাহ্‌র শপথ! অবশ্যি আমি রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম–কে বলতে শুনেছি যে, ঐ ব্যক্তি নেক্‌কার, যে ফিতনা থেকে দূরে থাকে; ঐ ব্যক্তি নেক্‌কার, যে ফিতনা থেকে দূরে থাকে, ঐ ব্যক্তি সৌভাগ্যবান যে ফিতনা থেকে দূরে থাকে। আর যে ব্যক্তি ফিতনাগ্রস্ত হওয়ার পর সবর করবে, সে খুবই ভাগ্যবান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4264,
			"arabicnumber": 4264,
			"text": "আবদুল মালিক ইব্‌ন শুআয়ব (রহঃ) .... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত যে, রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অচিরেই মুক, বধির ও অন্ধরূপ ফিতনা প্রকাশ পাবে। যে ব্যক্তি তা দেখবে, সে ফিতনা তাঁর নিকটবর্তী হবে। আর এ সময় মুখ খোলা, তরবারি চালনার ন্যায় হবে, (অর্থাৎ তা বিপদের কারণ হবে।)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4265,
			"arabicnumber": 4265,
			"text": "মুহাম্মদ ইব্‌ন উবায়দ (রহঃ) .... আবদুল্লাহ্‌ ইব্‌ন আমর (রাঃ) থেকে বর্ণিত। তিনি বলেন রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অচিরেই এমন এক ফিতনা-ফ্যসাদ প্রকাশ পাবে, যা গোটা আরবকে ঘিরে ফেলবে। আর এ সময় যারা নিহত হবে, তারা জাহান্নামী। এ সময় মুখ খোলা (বেহুদা কথাবার্তা বলা), তরবারির আঘাতের চাইতেও নিকৃষ্ট হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4266,
			"arabicnumber": 4266,
			"text": "মুহাম্মদ ইব্‌ন ঈসা (রহঃ) .... আবদুল্লাহ্‌ ইব্‌ন আবদুল কুদ্দূস (রহঃ) থেকে বর্ণিত। যিয়াদ (রহঃ) তাঁর কান সাদা থাকার কারণে ‘সামীনুন্‌-কুশুন’ বলে তাকে আখ্যায়িত করতো।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4267,
			"arabicnumber": 4267,
			"text": "উবায়দুল্লাহ্‌ ইবন মাসলামা (রহঃ) .... আবূ সাঈদ খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অচিরেই মুসলিমদের উত্তম সম্পদ হবে ঐ বকরিসমূহ, যাদের চরানোর জন্য তারা পর্বতের চূড়ায় ও পানির স্থানসমূহে থাকবে এবং এভাবে তারা দীন রক্ষার জন্য ফিতনা থেকে পালিয়ে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4268,
			"arabicnumber": 4268,
			"text": "আবূ কামিল (রহঃ) .... আহ্‌নাফ্‌ ইব্‌ন কায়স (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি যুদ্ধের নিয়তে (আলী (রাঃ) এর পক্ষে) বের হলে, আমার সাথে আবূ বাক্‌রা (রাঃ)-এর দেখা হয়। তিনি বলেনঃ তুমি ফিরে যাও। কেননা, আমি রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ যখন দু’জন মুসলিম তাদের তরবারি নিয়ে, একজন অপরজনকে মারতে প্রস্তুত হবে, তখন হত্যাকারী ও নিহত ব্যক্তি জাহান্নামে যাবে। তিনি বলেনঃ ইয়া রাসূলাল্লাহ্‌! হত্যাকারী তো জাহান্নামে যাবে, কিন্তু নিহত ব্যক্তির অপরাধ কি? তিনি বলেনঃ এ জন্য যে, সেও তো তাঁর ভাইকে হত্যা করার ইচ্ছা করেছিল।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4269,
			"arabicnumber": 4269,
			"text": "মুহাম্মাদ ইব্‌ন মুতাওয়াক্‌কিল (রহঃ) .... হাসান (রহঃ) থেকে সংক্ষিপ্তভাবে এ হাদীস বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4270,
			"arabicnumber": 4270,
			"text": "মুআম্মাল ইব্‌ন ফযল (রহঃ) .... খালিদ ইব্‌ন দিহ্‌কান (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা যখন কুস্‌তুন্‌তুনিয়ার যুদ্ধে ‘যালকা’ নামক স্থানে ছিলাম, তখন ফিলিস্তিনের একজন গণ্য-মান্য ব্যক্তি, যাকে সকলে চিনতো এবং তার নাম ছিল ‘হানি ইব্‌ন কুলছূম ইব্‌ন শারীক কিনানী। তিন এসে আবদুল্লাহ্‌ ইব্‌ন আবূ যাকারিয়া (রাঃ)-কে সালাম করেন, যার মর্যাদা সম্পর্কে তিনি অবহিত ছিলেন। রাবী বলেনঃ খালিদ (রহঃ) আমার নিকট বর্ণনা করেন যে, আবদুল্লাহ্‌ ইব্‌ন যাকারিয়া (রহঃ) আমাকে বলেছেনঃ আমি উম্মু দারদা (রাঃ)-কে বলতে শুনেছি, যিনি আবূ দারদা (রাঃ)-কে বলতে শোনেনঃ আমি রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, তিনি বলেনঃ মহান আল্লাহ্‌ মুশরিক অবস্থায় মৃত্যুবরণকারী ব্যক্তি এবং যে মু’মিন অন্য মু’মিনকে ইচ্ছাকৃতভাবে হত্যা করে, এরা ব্যতীত অন্য সকলের গুনাহ মাফ করবেন। এরপর হানী ইব্‌ন কুলছূম (রহঃ) বলেনঃ আমি মাহমূদ ইব্‌ন রাবী’ (রহঃ)-কে উবাদা ইব্‌ন সামিত (রাঃ) থেকে বর্ণনা করতে শুনেছি, যিনি রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন। তিনি বলেনঃ যে ব্যক্তি কোন মু’মিনকে ইচ্ছাকৃতভাবে হত্যা করবে এবং তাকে হত্যা করে খুশী হবে, তার কোন ফরয এবং নফল ইবাদত আল্লাহ্‌ কবূল করবেন না। রাবী বলেনঃ এরপর খালিদ আমাদের বলেন, ইব্‌ন আবূ যাকারিয়া (রহঃ) আবূ দারদা (রাঃ) সূত্রে রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন, তিনি বলেনঃ যতক্ষণ কোন মু’মিন অকারণে কাউকে হত্যা করে না, ততক্ষণ সে নিশ্চিত ও নেক্‌কার থাকে। কিন্তু যখন সে কাউকে হত্যা করে, তখন সে নির্ভীক ও জ্ঞান শূন্য হয়ে যায়। হানী ইব্‌ন কুলছূম (রহঃ) মাহমূদ ইব্‌ন রাবী’ (রহঃ) থেকে তিনি উবাদা ইব্‌ন সামিত (রাঃ) থেকে, তিনি রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এরূপ বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4271,
			"arabicnumber": 4271,
			"text": "আবদুর রহমান ইব্‌ন আমর (রহঃ) .... খালিদ ইব্‌ন দিহ্‌কান (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি ইয়াহ্‌ইয়া ইব্‌ন ইয়াহ্‌ইয়া গাস্‌সানী (রহঃ)-কে জিজ্ঞাসা করি اعْتَبَطَ بِقَتْلِهِ এ শব্দের অর্থ কি? তিনি বলেনঃ এর অর্থ হলো- যারা ফিত্‌নার যুগে পরস্পর মারামারি-কাটাকাটি করে এবং তাদের একজন অপরজনকে হত্যা করার পর এরূপ মনে করে যে, সে ন্যায়ের উপর প্রতিষ্ঠিত আছে! আর সে ঐ হত্যার পর তাওবা ইস্‌তিগ্‌ফারও করে না",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4272,
			"arabicnumber": 4272,
			"text": "মুসলিম ইব্‌ন ইবরাহীম (রহঃ) ..... খারিজা ইব্‌ন যায়দ (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ আমি যায়দ ইব্‌ন সাবিত (রাঃ)-কে এ স্থানে বলতে শুনেছি। তিনি বলেনঃ এ আয়াতঃ ‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمঅর্থাৎ “যে ব্যক্তি কোন মু’মিনকে ইচ্ছাকৃতভাবে হত্যা করবে, তার শান্তি হলো জাহান্নাম যেখানে সে চিরস্থায়ী হবে”, সূরা ফুরকানের এ আয়াতঃ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ অর্থাৎ “যারা আল্লাহর সাথে অন্য কিছুর শরীক করে না এবং আল্লাহ যাদের হত্যা করতে নিষেধ করেছেন, তাদের হত্যা করে না- তবে হক ব্যতীত”- এর ছয় মাস পর নাযিল হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4273,
			"arabicnumber": 4273,
			"text": "ইউসুফ ইব্‌ন মূসা (রহঃ) ..... সাঈদ ইব্‌ন জুবায়ের (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমি ইব্‌ন আব্বাস (রাঃ)-কে উপরোক্ত আয়াত সম্পর্কে জিজ্ঞাসা করলে, তিনি বলেনঃ যখন সূরা ফুরকানের এ আয়াতঃ যারা আল্লাহ্‌র সাথে অন্য কিছুর শরীক করে না এবং অন্য্যায়ভাবে কাঊকে হত্যা করে না”-নাযিল হয়, তখন মক্কার (নও-মুসলিম) মুশরিকরা এরূপ বলতে থাকে যে, আমরা তো আল্লাহ্‌র সাথে শরীক করেছি, অন্যায়ভাবে হত্যাও করেছি; এ ছাড়া আমরা আরো অনেক গুনাহ্‌ করেছি, (এমতাবস্থায় আমাদের নাজাতের ব্যবস্থা কি?) তখন আল্লাহ্‌ এ আয়াত নাযিল করেনঃ “আর যে তাওবা করবে, ঈমান আনবে এবং নেক আমল করবে, আল্লাহ্‌ তাদের গুনাহ্‌কে নেকীতে পরিবর্তিত করে দেবেন”। আর সূরা নিসার এ আয়াতঃ যে ব্যক্তি ইচ্ছাকৃতভাবে কোন মু’মিনকে হত্যা করবে, সে জাহান্নামে যাবে”, ঐ ব্যক্তি সম্পর্কে নাযিল হয়, যে ইসলামী শরীআতের হুকুম-আহকাম সম্পর্কে জ্ঞাত হওয়া সত্ত্বেও কোন মু’মিনকে ইচ্ছাকৃতভাবে হত্যা করে, সে অবশ্যই জাহান্নামে যাবে এবং তার তাওবা কবূল হবে না। রাবী সাঈদ (রহঃ) বলেনঃ আমি এ সম্পর্কে মুজাহিদ (রহঃ)-এর সাথে আলোচনা করলে, তিনি বলেনঃ তবে কেউ যদি যথার্থ-লজ্জিত হয়ে তাওবা করে, তবে তা কবূল হবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4274,
			"arabicnumber": 4274,
			"text": "আহমদ ইব্‌ন ইবরাহীম (রহঃ) .... ইব্‌ন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ এ আয়াতঃ الَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ অর্থাৎ “যারা আল্লাহ্‌র সাথে অন্য কিছুর শরীক করে না ...” এর অর্থ ঐসব লোক, যারা শির্‌ক করেছে এবং শিরক করা অবস্থায় অন্যায়ভাবে হত্যা করেছে; তাদের গুনাহ ঈমান আনার পর এবং তাওবা করার পর মাফ হয়ে যাবে। এর দলীল হলো এ আয়াতঃ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ “বলুনঃ হে আমার বান্দাগণ! যারা তাদের নিজেদের উপর বাড়াবাড়ি করেছে ...।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4275,
			"arabicnumber": 4275,
			"text": "আহমদ ইব্‌ন হাম্বল (রহঃ) .... ইব্‌ন আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ এ আয়াত (وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا) অর্থাৎ “যে ব্যক্তি কোন মু’মিনকে ইচ্ছাকৃতভাবে হত্যা করে ...” অন্য কোন আয়াত দ্বারা রহিত হয়নি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4276,
			"arabicnumber": 4276,
			"text": "আহমদ ইব্‌ন ইউনুস (রহঃ) .... আবূ মাজ্‌লায (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ এ আয়াতঃ “যে ব্যক্তি কোন মু’মিনকে ইচ্ছাকৃতভাবে হত্যা করবে, তার ঠিকানা হলো জাহান্নাম”, এর অর্থঃ জাহান্নাম-ই তার প্রাপ্য। তবে আল্লাহ্‌ যদি ইচ্ছা করেন, তবে তাকে ক্ষমাও করে দিতে পারেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4277,
			"arabicnumber": 4277,
			"text": "মুসাদ্দাদ (রহঃ) ..... সাঈদ ইব্‌ন যায়দ (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত ছিলাম। এ সময় তিনি ভয়াবহ একটি ফিতনার কথা উল্লেখ করেন। সাহাবীগণ জিজ্ঞাসা করেনঃ ইয়া রাসূলাল্লাহ্‌! যদি আমরা এ সময় জীবিত থাকি, তবে কি তা আমাদের তা ধ্বংস করে দেবে? তখন রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ না, এরূপ নয়; বরং সে সময় তোমরা নিহত হলে, তা তোমাদের জন্য যথেষ্ঠ হবে। রাবী সাঈদ (রহঃ) বলেনঃ এরপর আমি আমার ভাইদের (সে ফিতনায়) নিহত হতে দেখি। (অর্থাৎ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উষ্ট্রের ও সিফ্‌ফীনের যুদ্ধের প্রতি ইংগিত করেন।)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4278,
			"arabicnumber": 4278,
			"text": "উছমান ইব্‌ন আবূ শায়বা (রহঃ) .... আবূ মূসা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার এ উম্মতের উপর আল্লাহ্‌র রহমত আছে। আখিরাতে তারা (স্থায়ী) আযাব ভোগ করবে না। বরং তাদের কাফ্‌ফারা এভাবে হবে যে, দুনিয়াতে তাদের শাস্তি হবে-ফিতনা, ভূমিকম্প এবং হত্যা।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 39
			}
		}
	]
}