{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1250,
			"arabicnumber": 1250,
			"text": "মুহাম্মাদ ইবন ঈসা (রহঃ) .... উম্মে হাবীবা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন, যে ব্যাক্তি দৈনিক বার রাকাত নফল নামায আদায় করবে, এর বিনিময়ে আল্লাহ্‌ তাআলা তাঁর জন্য বেহেশতের মধ্যে একটি প্রাসাদ নির্মাণ করবেন। (মুসলিম, তিরমিযি, নাসাঈ, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1251,
			"arabicnumber": 1251,
			"text": "আহমাদ ইবন হাম্বল ও মুসাদ্দাদ (রহঃ) ...... আব্দুল্লাহ ইবন শাকীক (রহঃ) হতে বর্ণিত। তিনি বলে, একদা আমি আয়েশা (রাঃ)-কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নামায (সুন্নাত/নফল) সম্পর্কে জিজ্ঞাসা করি। তিনি বলেন, তিনি যুহরের পূর্বে ঘরে চার রাকাত নামায আদায় করতেন। পুনরায় ঘরে ফিরে এসে তিনি দুই রাকাত নামায আদায় করতেন। তিনি মাগরিবের ফরয নামায জামায়াতে আদায়ের পর ঘরে ফিরে এসে তিনি দুই রাকাত (সুন্নাত) নামায আদায় করতেন। তিনি রাতে দীর্ঘ সময় দাঁড়িয়ে ও বসে (নফল) নামায পড়তেন। তিনি দাঁড়িয়ে কিরাআত পাঠ করলে রুকু ও সিজদাও ঐ অবস্থায় করতেন এবং যখন তিনি বসে কিরাত পাঠ করতেন তখন রুকু সিজদাও ঐ অবস্থায় আদায় করতেন। তিনি সুবহে সাদিকের সময় দুই রাকাত (সুন্নাত) নামায আদায় করতেন। অতঃপর তিনি ঘর হতে বের হয়ে (মসজিদে গিয়ে) জামায়াতে ফজরের নামায আদায় করতেন। (মুসলিম, তিরমিযি, নাসাই, ইবন মাজাহ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1252,
			"arabicnumber": 1252,
			"text": "আল-কানবী (রহঃ) ..... আবদুল্লাহ ইবন উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুহরের পূর্বে কোন কোন সময় দুই রাকাত নামায আদায় করতেন এবং যুহরের ফরয নামায আদায়ের পরও দুই রাকাত নামায আদায় করতেন। তিনি মাগরিবের ফরযের পর ঘরে ফিরে দুই রাকাত নামায আদায় করতেন। তিনি এশার ফরয নামায আদায়ের পর দুই রাকাত নামায আদায় করতেন। তিনি জুমুআর নামায আদায়ের পর ঘরে ফিরে দুই রাকাত নামায আদায় করতেন। (বুখারি, মুসলিম, নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1253,
			"arabicnumber": 1253,
			"text": "মুসাদ্দাদ (রহঃ) .... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুহরের ফরযের পূর্বে চার রাকাত এবং ফজরের ফরযের পূর্বে দুই রাকাত নামায কখনও ত্যাগ করতেন না। (বুখারি, নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1254,
			"arabicnumber": 1254,
			"text": "মুসাদ্দাদ (রহঃ) .... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের নামাযের পূর্বে দুই রাকাত নামায আদায়ের ব্যপারে যে কঠোর নিয়মানুবর্তিতা পালন করেছেন তা অন্য কোন নামাযের (সুন্নাত বা নফল) ব্যাপারে পালন করেন নি। (বুখারি, মুসলিম)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1255,
			"arabicnumber": 1255,
			"text": "আহমাদ ইবন আবু শুয়ায়ব (রহঃ) ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের ফরয নামাযের পূর্বের দুই রাকাত নামায এত সংক্ষেপ করতেন যে, আমি ধারনা করতাম, তিনি কি তাতে কেবলমাত্র সূরা ফাতিহা পাঠ করেছেন। (বুখারী, মুসলিম, নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1256,
			"arabicnumber": 1256,
			"text": "ইয়াহিয়া ইবন মাইন (রহঃ) .... আবু হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের দুই রাকাত সুন্নাত নামাযে “সূরা কাফিরুন” ও “সূরা কুল হুআল্লাহু আহাদ” তিলাওয়াত করতেন। (মুসলিম, নাসাঈ, ইবন মাজাহ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1257,
			"arabicnumber": 1257,
			"text": "আহমাদ ইবন হাম্বল (রহঃ) ..... বিলাল (রাঃ) হতে বর্ণিত। তিনি বলেন, তিনি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে ফজরের নামাযের সময় সম্পর্কে জ্ঞাত করতে আসেন। এ সময় আয়েশা (রাঃ) বিলাল (রাঃ)-কে একটি প্রশ্ন করে ব্যাস্ত রাখা অবস্থায় আকাশ পরিষ্কার হয়ে যায়। অতঃপর বিলাল (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে পুনঃ দুইবার ফজরের নামাযের সময় সম্পর্কে অবহিত করেন, কিন্তু তিনি তখন বাইরে আসেন নাই। কিছুক্ষন পরে তিনি বাইরে বের হয়ে এসে লোকদের নিয়ে নামায আদায় করেন। বিলাল (রাঃ) তাঁকে বলেন, (অদ্য নামাযে বিলম্ব হওয়ার কারন এই যে) আয়েশা (রাঃ) তাঁকে একটি প্রশ্ন জিজ্ঞেস করে আটকে রাখেন এবং অপরপক্ষে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও বের হতে বিলম্ব করেন। ফলে পূর্বাকাশ অধিক পরিষ্কার হয়ে গিয়েছে। মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, (আমার বিলম্বের কারন এই যে) আমি তোমার আহবানের সময় ফজরের ফরয নামাযের পূর্বের দুই রাকাত নামায আদায়ে মশগুল ছিলাম। তিনি বলেন, ইয়া রাসুলাল্লাহ! আপনিও আজ অধিক বিলম্ব করেছেন। তিনি বলেনঃ আমি আজ যত দেরি করেছি এই চাইতে অধিক বিলম্ব হলেও দুই রাকাত অত্যন্ত সুন্দরভাবে আদায় করতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1258,
			"arabicnumber": 1258,
			"text": "মুসাদ্দাদ (রহঃ) .... আবু হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ তোমরা কোন সময় ঐ দুই রাকাত নামায (ফজরের সুন্নাত) ত্যাগ করবেনা, ঘোড়ায় তোমাদের পিষে ফেললেও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1259,
			"arabicnumber": 1259,
			"text": "আহমাদ ইবন ইউনুস (রহঃ) ...... আবদুল্লাহ ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অধিকাংশ সময় ফজরের দুই রাকাত নামাযের (সুন্নাত) প্রথম রাকাতে “আমান্না বিল্লাহি ওয়ামা উনযিলা ইলাইনা” এবং দ্বিতীয় রাকাতে “আমান্না বিল্লাহি ওয়াশহাদ বিয়ান্না মুসলিমুন” এই আয়াতদ্বয় পাঠ করতেন। (মুসলিম, নাসাই)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1260,
			"arabicnumber": 1260,
			"text": "মুহাম্মাদ ইবনুস সাব্বাহ (রহঃ) ...... আবু হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের দুই রাকাত (সুন্নাত) নামাযের প্রথম রাকাতে “কুল আমান্না বিল্লাহি ওয়ামা উনযিলা ইলাইনা” এবং দ্বিতীয় রাকাতে “রাব্বানা আমান্না বিমা আনযালতা ওয়াত্তাবানার রাসুলা ফাকতুবনা মাআশশাহিদীন” অথবা “ইন্না আরসালনাকা বিল হাক্কি বাশীরাও ওয়া নাযিরা ওয়ালা তুসয়ালু আন আসহাবিল জাহিম” তিলাওয়াত করতে শুনেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1261,
			"arabicnumber": 1261,
			"text": "মুসাদ্দাদ, আবু কামিল এবং উবায়দুল্লাহ ইবন আমর (রহঃ) ...... আবু হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ তোমাদের কেউ ফজরের সুন্নাত নামায পড়ার পর যেন কাত হয়ে শুয়ে ক্ষণিক বিশ্রাম নেয়। এ সময় মারওয়ান ইবনুল হাকাম তাঁকে বলেন, যদি কেউ মসজিদে গিয়ে ডান পাঁজরে ভর দিয়ে বিশ্রাম গ্রহন করে তবে কি তা যথেষ্ট হবে? তিনি বলেন, না (এটা রাবী উবায়দুল্লাহ-র বর্ণনা অনুযায়ী)। রাবী বলেন, অতঃপর এই সংবাদ ইবন উমার (রাঃ) এর নিকট পৌঁছলে তিনি বলেন, আবু হুরায়রা (রাঃ) এই বর্ণনায় নিজের তরফ থেকে কিছু বৃদ্ধি করেছেন কি? তখন ইবন উমার (রাঃ) কে জিজ্ঞাসা করা হয়, আপনি কি তা অস্বীকার করেন? তিনি বলেন, না। আবু হুরায়রা (রাঃ) সাহসের সাথে তা বলেছেন এবং আমরা এতে দুর্বলতা প্রকাশ করেছি। এই সংবাদ আবু হুরায়রা (রাঃ) এর নিকট পৌঁছলে তিনি বলেন, কোন কিছু স্মরণে থাকা ও ভুলে যাওয়া কোন দোষের ব্যপার নয়। (তিরমিযী)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1262,
			"arabicnumber": 1262,
			"text": "ইয়াহিয়া ইবন হাকিম (রহঃ) ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাজ্জুদ নামায আদায়ের পর আমাকে জাগ্রত অবস্থায় পেলে আমার সাথে (দ্বীন সম্পর্কীয়) আলাপ আলোচনা করতেন। আমি ঘুমন্ত অবস্থায় থাকলে তিনি আমাকে ঘুম থেকে উঠাতেন। অতঃপর তিনি দুই রাকাত নামায আদায়ের পর কাত হয়ে শুয়ে বিশ্রাম নিতেন এবং মুয়াজ্জিনের আগমন পর্যন্ত ঐ ভাবে থাকতেন। মুয়াজ্জিন এসে ফজরের নামাযের খবর দিলে তিনি ফজরের দুই রাকাত (সুন্নাত) হাল্কাভাবে আদায় করতেন। অতঃপর ফজরের ফরয নামায আদায়ের জন্য মসজিদে যেতেন। (বুখারি, মুসলিম, তিরমিযি)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1263,
			"arabicnumber": 1263,
			"text": "মুসাদ্দাদ (রহঃ) ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের দুই রাকাত সুন্নাত নামায আদায়ের পর আমাকে ঘুমন্ত অবস্থায় পেলে তিনিও একটু আরাম করতেন। তিনি আমাকে জাগ্রত অবস্থায় দেখলে আমার সাথে দীন সম্পর্কে আলোচনা করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1264,
			"arabicnumber": 1264,
			"text": "আব্বাস আল আনবারী এবং যিয়াদ ইবন ইয়াহিয়া (রহঃ) ...... আবু বাকরা (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ফজরের নামাযে যাই। এই সময় তিনি কোন ব্যাক্তির পাশ দিয়ে যাওয়ার সময় তাঁকে নামাযের জন্য আহবান করতেন অথবা তাঁর পা দিয়ে স্পর্শ করতেন (সাধারণত ফজরের সুন্নাত নামায আদায়ের পর যারা আরামের জন্য ক্ষণিক শয়ন করত, তিনি তাদেরকে এইরূপে ডাকতেন)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1265,
			"arabicnumber": 1265,
			"text": "সুলায়মান ইবন হারব (রহঃ) .... আবদুল্লাহ ইবন সারজিস (রাঃ) হতে বর্ণিত। তিনি বলেন, এক ব্যাক্তি মসজিদে এসে দেখতে পায় যে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জামায়াত শুরু করে দিয়েছেন। লোকটি একাকী দুই রাকাত নামায পড়ার পর নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে জামায়াতে শরীক হয়। নামায শেষে তিনি বলেনঃ তুমি কোন নামায আদায়ের উদ্দেশে মসজিদে এসেছ? যে নামায একাকী পড়েছ না যা আমাদের সাথে আদায় করেছ? (মুসলিম, নাসাই, ইবন মাজাহ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1266,
			"arabicnumber": 1266,
			"text": "মুসলিম ইবন ইবরাহীম, আহমাদ ইবন হাম্বল ও আল হাসান ইবন আলী (রহঃ) ..... মুহাম্মাদ ইবনুল মুতাওাক্কিল প্রমুখ সূত্রে আবু হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ ফরজ নামাযের ইকামত হয়ে যাওয়ার পর ফরয ব্যাতিত আর কোন নামায পড়া দুরস্ত নয়। (মুসলিম, তিরমিযি, নাসাই, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1267,
			"arabicnumber": 1267,
			"text": "উসমান ইবন আবু শায়বা (রহঃ) ..... কায়েস ইবন আমর (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দেখতে পান যে, এক ব্যাক্তি ফজরের ফরয নামায আদায়ের পর দুই রাকাত নামায আদায় করছে। মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ফজরের নামায দুই রাকাত। তখন ঐ ব্যাক্তি বলেন, আমি ইতিপূর্বে ফজরের দুই রাকাত সুন্নাত আদায় করতে পারিনি, তা এখন আদায় করছি। তাঁর কথায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিরব থাকেন। (তিরমিযি, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1268,
			"arabicnumber": 1268,
			"text": "হামেদ ইবন ইয়াহিয়া আল-বালখী (রহঃ) ..... আতা ইবন আবু রাবাহ (রহঃ) সাদ ইবন সাইদ (রাঃ) হতে উপরোক্ত হাদিসের অনুরূপ বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1269,
			"arabicnumber": 1269,
			"text": "মুয়াম্মাল ইবনুল ফাদল (রহঃ) ..... রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী উম্মে হাবীবা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ যে ব্যাক্তি যুহরের ফরয নামাযের পূর্বে এবং পরে চার রাকাত করে নামায পড়বে তাঁর জন্য দোযখের আগুন হারাম হবে। (তিরমিযি, নাসাই, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1270,
			"arabicnumber": 1270,
			"text": "ইবনুল মুসান্না (রহঃ) ..... আবু আইয়ুব (রাঃ) নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন যে, যুহরের ফরয নামাযের পূর্বে এক সালামের সাথে যে ব্যাক্তি চার রাকাত নামায পড়বে এর বদৌলতে তাঁর জন্য আকাশের দরজাসমূহ উন্মুক্ত হবে। (তিরমিযি, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1271,
			"arabicnumber": 1271,
			"text": "আহমাদ ইবন ইবরাহীম (রহঃ) ...... ইবন উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুলল্লাহ সালল্লালল্লাহু আলাইহে ওয়াসালল্লাম বলেছেনঃ যে ব্যক্তি আসরের ফরয নামাযের পূর্বে চার রাকাত নামায পড়বে আল্লাহ তাআলা তার উপর রহমত বর্ষণ করুন। (তিরমিযী)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1272,
			"arabicnumber": 1272,
			"text": "হাফস ইবন উমার (রহঃ) ..... আলী (রাঃ) থেকে বর্ণিত। মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসরের (ফরয) নামাযের পূর্বে দুই রাকাত (নফল) নামায পড়তেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1273,
			"arabicnumber": 1273,
			"text": "আহমাদ ইবন সালেহ (রহঃ) .... ইবন আব্বাস (রাঃ) এর আযাদকৃত গোলাম কুরায়েব (রহঃ) হতে বর্ণিত। তিনি বলেন, একদা আবদুলল্লাহ ইবন আব্বাস (রাঃ), আব্দুর রহমান ইবন আযহার (রাঃ) এবং মিসওয়ার ইবন মাখরামা (রাঃ) তাকে রাসূলুলল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্ত্রী আয়েশা (রাঃ) এর খিদমতে এই সংবাদসহ প্রেরণ করেন যে, তুমি তাঁকে আমাদের সকলের পক্ষ হতে সালাম দিবে অতঃপর আসরের পর দুই রাকাত নামায পড়া সম্পর্কে জিজ্ঞাসা করবে। তাঁকে এও বলবে যে, আমরা জানতে পেরেছি যে, রাসূলুলল্লাহ সালল্লালল্লাহু আলাইহে ওয়াসালল্লাম আসরের পর নামায পড়তে নিষেধ করেছেন। কুরায়েব বলেন, আমি আয়েশা (রাঃ)-এর নিকট উপস্থিত হয়ে তাঁকে সালাম জানিয়ে বিষয়টি অবহিত করি। তিনি বলেন, তুমি এই সম্পর্কে উম্মে সালামা (রাঃ) কে জিজ্ঞাসা কর। অতএব আমি তাঁদের নিকট ফিরে আসি। অতঃপর তাঁরা আবার আমাকে ঐ বার্তাসহ উম্মে সালামা (রাঃ) এর নিকট প্রেরণ করেন, যা নিয়ে তাঁরা আমাকে আয়েশা (রাঃ) এর নিকট প্রেরণ করেছিলেন। আমি উম্মে সালামা (রাঃ) এর নিকট উপস্থিত হয়ে এ ব্যাপারে জিজ্ঞাসা করলে তিনি বলেন, আমি রাসূলুলল্লাহ সালল্লালল্লাহু আলাইহে ওয়াসালল্লামকে দুই রাকাত নামায (আসরের পরে) পড়তে নিষেধ করতে শুনেছি এবং আমি তাঁকে ঐ দুই রাকাত নামায পড়তেও দেখেছি। ঐ দুই রাকাত নামায আদায়ের ঘটনা এই যে, একদা তিনি আসরের নামাযের পর ঘরে ফিরে নামাযে দন্ডায়মান হন। এই সময় আনসারদের বনী হারাম গোত্রের কিছু সংখ্যক মহিলা আমার নিকট উপস্থিত ছিল। আমি তাঁর নিকট জনৈক দাসীকে প্রেরণ করে বলি, তুমি তাঁর পাশে দাঁড়িয়ে বলবে, উম্মে সালামা (রাঃ) বলেছেন, ‘‘ইয়া রাসূলাল্লাহ! আমি আপনাকে এই দুই রাকাত নামায আদায়ের ব্যাপারে নিষেধ করতে শুনেছি এবং আমি এখন তা আপনাকে আদায় করতে দেখছি।’’ তিনি যদি হাত দ্বারা ইশারা করেন, তবে তুমি অপেক্ষা করবে। উম্মে সালামা (রাঃ) বলেন, অতঃপর দাসীটি আমার নির্দেশমত কাজ করলে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশারা করলে সে অপেক্ষা করে। তিনি নামায শেষে বলেনঃ হে আবূ উমায়্যার কন্যা! তুমি আমাকে আসরের পর দুই রাকাত নামায সম্পর্কে জিজ্ঞাসা করেছ। প্রকৃত ব্যাপার এই যে, আজ আব্দুল কায়েস গোত্রের কিছু সংখ্যক লোক ইসলামের ব্যাপারে জানবার জন্য আমার নিকট আগমন করে, তাদের সাথে কথাবার্তায় মশগুল থাকায় আমি যুহরের পরের দুই রাকাত নামায আদায় করতে পারিনি, এখন তা আদায় করলাম। (বুখারী, মুসলিম)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1274,
			"arabicnumber": 1274,
			"text": "মুসলিম ইবন ইবরাহীম (রহঃ) .... আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুলল্লাহ সালল্লালল্লাহু আলাইহে ওয়াসালল্লাম আসরের পর (নফল) নামায পড়তে নিষেধ করেছেন; তবে যদি সূর্য উপরে থাকে। (নাসাঈ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1275,
			"arabicnumber": 1275,
			"text": "মুহাম্মাদ ইবন কাছীর (রহঃ) .... আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুলল্লাহ সালল্লালল্লাহু আলাইহি ওয়াসালল্লাম প্রত্যেক ফরয নামায আদায়ের পর দুই রাকাত নামায আদায় করতেন। তবে তিনি ফজর ও আসরের ফরয নামাযের কোন নামায পড়তেন না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1276,
			"arabicnumber": 1276,
			"text": "মুসলিম ইবন ইবরাহীম (রহঃ) .... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, কতিপয় নির্ভরযোগ্য ব্যক্তি যাদের মধ্যে উমার ইবনুল খাত্তাব (রাঃ)-ও ছিলেন এবং তিনিই আমার নিকট অধিক প্রিয় ছিলেন, বলেন, নবী করীম সালল্লালল্লাহু আলাইহে ওয়াসালল্লাম ইরশাদ করেছেনঃ ফজরের নামাজের পর সূর্যোদয়ের পূর্ব পর্যন্ত কোন নামায নাই। একইরূপে আসরের ফরয নামাযের পর সূর্যাস্ত পর্যন্ত কোন নামায নাই। (বুখারী, মুসলিম, তিরমিযী, নাসাঈ, ইবন মাজা)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1277,
			"arabicnumber": 1277,
			"text": "আর-রবী ইবন নাফে (রহঃ) .... আমর ইবন আনবাসা আস-সুলামী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি বললাম, ইয়া রাসূলাল্লাহ! রাতের কোন অংশে আল্লাহ পাক দু’আ অধিক কবুল করেন? তিনি বলেনঃ রাতের শেষাংশে। অতএব তখন তুমি তোমার ইচ্ছামত নামায আদায় করবে। কেননা ঐ সময়ের নামাযে বিশেষ ফেরেশতারা উপস্থিত হয়ে তা তাদের নিকট রক্ষিত আমলনামায় লিপিবদ্ধ করে নেয় এবং তারা ফজরের সূর্য উঠা পর্যন্ত উপস্থিত থাকে। অতঃপর তুমি সূর্য উঠা পর্যন্ত অপেক্ষা করবে এবং এর পরিমাণ হল, এক বা দুই তীরের সমান। কেননা সূর্য শয়তানের দুই শিংয়ের মাঝখান দিয়ে উদিত হয় এবং ঐ সময় কাফিররা শয়তানের পূজা করে। অতঃপর তোমার ইচ্ছানুযায়ী নামায আদায় করবে। কেননা প্রত্যেক নামাযের সময়ই ফেরেশতারা দফতরসহ উপস্থিত হয়ে থাকে এবং ঠিক দ্বিপ্রহরের পূর্ব পর্যন্ত নামায আদায় করা যায়। অতঃপর সূর্য পশ্চিমাকাশে ঢলে না যাওয়া পর্যন্ত অপেক্ষা করবে। কেননা এই সময় জাহান্নামের আগুন প্রবলভাবে উদ্দীপিত হতে থাকে এবং এর দরজাসমূহ উন্মুক্ত করে দেয়া হয়। অতঃপর সূর্য পশ্চিমাকাশে ঢলে যাওয়ার পর তুমি তোমার খুশীমত আসরের পূর্ব পর্যন্ত নামায আদায় করতে পার। কেননা প্রত্যেক নামাযের সময় ফেরেশাতার হাযির হয়ে থাকে। আসরের ফরয নামায আদায়ের পর হতে সূর্যাস্ত পর্যন্ত কোনরূপ নামায পড়া থেকে বিরত থাকবে। কেননা শয়তানের দুই শিংয়ের মধ্যবর্তী স্থান দিয়ে সূর্য অস্তচলে যায় এবং কাফিররা ঐ সময় শয়তানের পূজা করে থাকে। অতঃপর রাবী দীর্ঘ হাদীছ বর্ণনা করেন। রাবী আব্বাস ইবন সালিম (রহঃ) বলেন, আবু সালামা (রহঃ) ... আবু উমামা (রাঃ) হতে আমার নিকট ঐরূপ হাদীছ বর্ণনা করেছেন। তবে অনিচ্ছাকৃতভাবে যদি আমার বর্ণনায় কোন ভুলত্রুটি হয়ে থাকে সেজন্য আমি আল্লাহর নিকটে তওবা ও ক্ষমা প্রার্থনা করছি। (তিরমিযী, মুসলিম)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1278,
			"arabicnumber": 1278,
			"text": "মুসলিম ইবন ইবরাহীম (রহঃ) ..... ইয়াসার (রহঃ) হতে বর্ণিত। তিনি বলেন, একদা সুবহে সাদিকের পর ইবন উমার (রাঃ) আমাকে নামায পড়তে দেখে বলেন, হে ইয়াসার! একদা আমরা এই নামায আদায়কালে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকটবর্তী হয়ে বলেছিলেনঃ তোমরা এখন যারা উপস্থিত আছ, তারা আমার এই নির্দেশ অনুপস্থিত লোকদের নিকট পৌঁছায়ে দিও যে, সুবহে সাদিকের পর ফজরের ফরযের পূর্বে দুই রাকাত সুন্নাত নামায ছাড়া আর কোন নামায পড়বে না। (তিরমিযী, ইবন মাজা)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1279,
			"arabicnumber": 1279,
			"text": "হাফস ইবন উমার (রহঃ) ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসরের ফরয নামায আদায়ের পর সব সময়ই দুই রাকাত নামায পড়তেন। (সম্ভবতঃ তা তাঁর জন্য নির্দিষ্ট ছিল। কিন্তু তাঁর উম্মাতের জন্য উপরোক্ত নিষেধ বাণী প্রযোজ্য)। (বুখারী, মুসলিম, নাসাঈ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1280,
			"arabicnumber": 1280,
			"text": "উবায়দুলল্লাহ (রহঃ) .... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসরের ফরয নামায আদায়ের পর অন্য নফল নামাযও পড়তেন। তবে তিনি তাঁর উম্মতকে তা পড়তে নিষেধ করতেন এবং তিনি (কোন কোন সময়) একই সঙ্গে বহু দিন রোযা (সাওমে বিসাল) রাখতেন, কিন্তু তিনি উম্মাতকে এভাবে রোযা রাখতে নিষেধ করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1281,
			"arabicnumber": 1281,
			"text": "উবায়দুলল্লাহ ইবন উমার (রহঃ) .... আবদুলল্লাহ ইবনুল-মুযানী (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ তোমরা যে ইচ্ছা কর মাগরিবের পূর্বে দুই রাকাত নামায আদায় করতে পার। তিনি দুইবার এরূপ বলেন এবং তিনি তা আদায়ে কঠোরতা না করার কারণ এই ছিল, যাতে লোকেরা এটাকে সুন্নাত হিসাবে মনে না করে। (বুখারী)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1282,
			"arabicnumber": 1282,
			"text": "মুহাম্মাদ ইবন ইবরাহীম (রহঃ) ..... আনাস ইবন মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সময় আমরা মাগরিবের নামাযের পূর্বে দুই রাকাত নামায আদায় করতাম। রাবী বলেন, আমি এ সম্পর্কে আনাস (রাঃ)-কে জিজ্ঞাসা করি, আপনি কি রাসূলুল্লাহকে এই নামায আদায় করতে দেখেছেন? তখন তিনি বলেন, হ্যাঁ, এবং তিনি আমাদেরকেও তা আদায় করতে দেখেছেন। কিন্তু তিনি এব্যাপারে কোন আদেশ বা নিষেধ প্রদান করেননি। (মুসলিম)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1283,
			"arabicnumber": 1283,
			"text": "আবদুলল্লাহ ইবন মুহাম্মাদ (রহঃ) ..... আবদুলল্লাহ ইবন মুগাফফাল (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেনঃ দুই আযানের (আযান ও ইকামতের) মধ্যবর্তী সময়ে যে ইচ্ছা করে, নামায আদায় করতে পারে। তিনি দুইবার এরূপ বলেন। (বুখারী, মুসলিম, তিরমিযী, ইবন মাজা, নাসাঈ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1284,
			"arabicnumber": 1284,
			"text": "ইবন বাশশার (রহঃ) .... তাউস (রহঃ) হতে বর্ণিত। তিনি বলেন, উমার (রাঃ)-কে মাগরিবের নামাযের পূর্বে দুই রাকাত নামায আদায় সম্পর্কে জিজ্ঞাসা করা হলে তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে আমি কাউকেও তা আদায় করতে দেখিনি এবং আমি কাউকেও আসরের পরে দুই রাকাত নামায আদায়ের ব্যাপারে অনুমতি দিতে দেখিনি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1285,
			"arabicnumber": 1285,
			"text": "আহমাদ ইবন মানী ও মুসাদ্দাদ (রহঃ) .... আবু যার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রত্যেক মানুষের জন্য প্রত্যহ সকালে সদকা দেওয়া প্রয়োজন। কোন ব্যক্তির সাথে সাক্ষাত হলে তাকে সালাম দেয়াও একটি সদকা। কোন ব্যক্তিকে ভালো কাজের নির্দেশ দেয়াও একটি সদকা এবং খারাপ কাজ হতে বিরত থাকাও একটি সদকা, রাসত্মার উপর হতে কষ্টদায়ক বস্ত্ত অপসারণ করাও একটি সদকা, নিজের স্ত্রীর সাথেও সহবাস করাও একটি সদকা। যদি কেউ দুই রাকাত চাশতের নামায আদায় করে, তবে সে উপরোক্ত কাজগুলির অনুরূপ ছওয়াব প্রাপ্ত হবে। রাবী ইবন মানী (রহঃ) তাঁর র্বণনায় আরও উল্লেখ করেছেন যে, এসময় সাহাবায়ে কিরাম বলেন, ইয়া রাসূলাল্লাহ! আমাদের কেউ নিজ স্ত্রীর সাথে সংগম করে তার কামস্পৃহা চরিতার্থ করবে এবং একেও কি সদকা বলা হবে? তিনি বলেনঃ তুমি কি দেখ না, যদি সে তা কোন অবৈধ স্থানে ব্যবহার করত তবে সে গুনাহগার হত না?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1286,
			"arabicnumber": 1286,
			"text": "ওয়াহব ইবন বাকিয়া (রহঃ) .... আবুল আসাদ আদ-দায়লামী (রহঃ) হতে বর্ণিত। তিনি বলেনঃ আমরা আবু যার (রাঃ) এর নিকটে বসে থাকা অবস্থায় তিনি বলেনঃ তোমাদের প্রত্যেকের উচিত, প্রত্যহ সকালে নিজেদের জন্য কিছু সদকা করা। তার প্রত্যেকটি নামাযই সদকা স্বরূপ, রোযাও সদকা, হজ্জও সদকা, তাসবীহ পাঠও সদকা, তাকবীর (আল্লাহু আকবার) পাঠও সদকা, তাহমীদ (আলহামাদু লিল্লাহ) পাঠও সদকাস্বরূপ! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উপরোক্ত কাজগুলিকে পুন্যের কাজসমূহের মধ্যে গণ্য করেছেন। অতঃপর বলেছেন, কেউ চাশতের সময়ে দুই রাকাত নামায আদায় করলে সে ঐ ব্যক্তির ঐগুলির অনুরূপ ছওয়াব পাবে। (মুসলিম)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1287,
			"arabicnumber": 1287,
			"text": "মুহাম্মাদ ইবন সালামা (রহঃ) ..... সাহল ইবন মুআয (রহঃ) থেকে তাঁর পিতার সূত্রে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি কোন ব্যক্তি ফজরের নামাযের পর ভালো কাজে লিপ্ত থেকে সূর্য একটু উপরে উঠার পর দুই রাকাত নামায আদায় করে, তবে তার সমস্ত গুনাহ মার্জিত হবে। যদিও এর পরিমাণ সাগরের ফেনার চাইতেও অধিক হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1288,
			"arabicnumber": 1288,
			"text": "আবু তাওবা (রহঃ) ..... আবু উমামা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক নামায আদায়ের পর হতে অন্য নামায আদায় করা পর্যন্ত সময়ের মধ্যে যদি কেউ কোনরূপ অন্যায় অপকর্মে লিপ্ত না হয় তবে ঐ ব্যক্তির ‘‘আমলনামা’’ ইল্লীন নামক স্থানে সংরক্ষিত থাকবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1289,
			"arabicnumber": 1289,
			"text": "দাউদ ইবন রাশীদ (রহঃ) .... নুআয়ম ইবন হাম্মার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ আল্লাহ রব্বুল আলামীন বলেনঃ হে বনী আদম! তোমরা দিনের প্রথমাংশে চার রাকাত নামায আদায় না করে আমাকে দিনের শেষ ভাগ পর্যন্ত তোমাদের ভালোবাসা হতে বঞ্চিত রেখ না। (তিরমিযী)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "আহমাদ ইবন সালেহ (রহঃ) .... উম্মে হানী বিনত আবু তালিব (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা বিজয়ের দিন দুপুরের পূর্বে প্রতি দুই রাকাতে সালাম ফিরিয়ে আট রাকাত নামায আদায় করেন। ইমাম আবু দাউদ (রহঃ) বলেন, আহমাদ ইবন সালেহ (রহঃ)-এর বর্ণনায় আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা বিজয়ের দিন দ্বিপ্রহরের পূর্বে (চাশতের সময়) নামায আদায় করেছিলেন। অতঃপর পূর্ববর্তী হাদীছের অনুরূপ বর্ণিত হয়েছে। রাবী ইবনুস সারহ (রহঃ)-এর বর্ণনায় আরো আছে, উম্মে হানী (রাঃ) বলেছেন, রাসূলুল্লাহ আমার নিকট আসেন। অতঃপর তিনি রাবী ইবন সালেহ হতে বর্ণিত উপরোক্ত হাদীছের অনুরূপ বর্ণনা করেন। (ইবন মাজা)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": 1291,
			"text": "হাফস ইবন উমার (রহঃ) ..... ইবন আবু লায়লা (রহঃ) হতে বর্ণিত। তিনি বলেন, উম্মে হানী (রাঃ) ব্যতীত আর কেউই এরূপ বর্ণনা করেননি যে, সে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে দ্বিপ্রহরের পূর্বে নামায পড়তে দেখেছে। উম্মে হানী (রাঃ) বর্ণনা করেছেন যে, মক্কা বিজয়ের দিন নবী করী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ঘরে প্রবেশ করে গোসল করেন, অতঃপর আট রাকাত নামায পড়েন। পরবর্তীকালে আর কেউই তাঁকে কখনও এরূপ নামায পড়তে দেখেনি। (বুখারী, মুসলিম, তিরমিযী)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": 1292,
			"text": "মুসাদ্দাদ (রহঃ) ..... আবদুলল্লাহ ইবন শাকীক (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি আয়েশা (রাঃ)-কে জিজ্ঞাসা করি, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি দুপুরের সময় কোন নামায পড়তেন? তিনি বলেন, না, অবশ্য ঐ সময় যদি তিনি কোন সফর হতে প্রত্যাবর্তন করতেন (তবে নামায পড়তেন)। রাবী বলেন, অতঃপর আমি তাঁকে জিজ্ঞাসা করি, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি একই রাকাতের মধ্যে দুটি সূরা মিলিয়ে পড়তেন? তিনি বলেন, হ্যাঁ, তিনি কুরআনের মুফাসসাল (হুজুরাত থেকে নাস) সূরা মাঝে মাঝে মিলিয়ে নামায পড়তেন। (মুসলিম, তিরমিযী, নাসাঈ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "আল-কানবী (রহঃ) ..... নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্ত্রী আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কখনই নিয়মিতভাবে চাশতের নামায পড়েননি। কিন্তু আমি তা আদায় করি এবং তিনি তা আমল করতে পছন্দ করলেও (মাঝে মাঝে) তার পরিত্যাগের কারণ এই ছিল যে, তিনি নিয়মিতভাবে আদায় করলে লোকদের উপর তা ফরয হয়ে যেতে পারে। (বুখারী, মুসলিম)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": 1294,
			"text": "ইবন নুফায়েল (রহঃ) ..... সিমাক (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি জাবের ইবন সামুরা (রাঃ)-কে জিজ্ঞাস করি, আপনি কি অধিক সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে থাকতেন? তিনি বলেন, হ্যাঁ, আমি বহু সময় তাঁর সাথে থাকতাম। তিনি ফজরের নামাজের পর ঐ স্থানে সূর্যোদয় পর্যন্ত বসে থাকতেন। অতঃপর সূর্য উপরে উঠলে তিনি ইশরাকের নামায আদায় করতেন। (মুসলিম, নাসাঈ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "আমর ইবন মারযূক (রহঃ) ..... ইবন উমার (রাঃ) থেকে বর্ণিত। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ দিন ও রাতের (নফল) নামায দুই দুই রাকাত। (তিরমিযী, নাসাঈ, ইবন মাজা)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": 1296,
			"text": "ইবনুল মুছান্না (রহঃ) ..... আল-মুত্তালিব (রাঃ) থেকে বর্ণিত। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ নফল নামায দুই দুই রাকাত এবং তুমি প্রতি দুই রাকাতের পর তাশাহহুদ পড়বে, অতপর নিজের বিপদাপদ ও দারিদ্রের কথা প্রকাশ করে দুই হাত তুলে দু’আ করবেঃ আল্লাহুম্মা, আল্লাহুম্মা - ইত্যাদি। যে ব্যক্তি এরূপ করবে না তার নামায ত্রুটিপূর্ণ। (নাসাঈ, ইবন মাজা) ইমাম আবু দাউদ (রহঃ)-কে রাতের নফল নামায দুই রাকাত করে আদায় সম্পর্কে জিজ্ঞাসা করা হলে তিনি বলেন, তুমি ইচ্ছা করলে দুই বা চার রাকাত করেও আদায় করতে পার।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": 1297,
			"text": "আব্দুর রহমান ইবন বিশর (রহঃ) ..... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর চাচা আব্বাস ইবন আবদুল মুত্তালিব (রাঃ)-কে বলেনঃ হে আব্বাস ইবন আব্দুল মুত্তালিব! হে আব্বাস! হে আমার প্রিয় চাচা! আমি কি আপনাকে এমন একটি জিনিস দেব না যার মাধ্যমে আপনি দশটি বৈশিষ্ট্যের অধিকারী হবেন? যখন আপনি এরূপ করবেন, তখন আল্লাহ তাআলা আপনার পূর্বাপরের সমস্ত গুনাহ মাফ করবেন। চাই তা প্রথম বারের হোক বা শেষ বারের পুরাতন হোক কিংবা নতুন হোক, ভুলেই হোক অথবা ইচ্ছাকৃতভাবে, বড়ই হোক অথবা ছোট, প্রকাশ্যেই হোক অথবা গোপনে- আপনি এই দশটি বৈশিষ্ট্যের অধিকারী হবেন, যদি আপনি চার রাকাত নামায নিম্নে বর্ণিত পদ্ধতিতে আদায় করেন। আপনি এর প্রতি রাকাতে সূরা ফাতিহা পাঠের পর এর সাথে অন্য একটি সূরা মিলাবেন। অতঃপর যখন আপনি কিরাআত পাঠ শেষ করবেন তখন দাঁড়ানো অবস্থায় এই দু’আ পাঠ করবেনঃ ‘সুবহানালল্লাহ আলহামদু লিলল্লাহ ওয়া লা ইলাহা ইল্লাল্লাহু ওয়াল্লাহু আকবার।’ অতঃপর আপনি রুকূ করবেন এবং সেখানেও ঐ দু’আ দশবার পাঠ করবেন। পরে রুকূ হতে মাথা তুলে সোজা হয়ে দাঁড়িয়ে ঐ দু্’আ দশবার পাঠ করবেন। অতঃপর সিজদায় গিয়েও তা দশবার পাঠ করবেন এবং প্রথম সিজদার পর মাথা তুলে বসবার সময় ঐ দু’আ দশবার পাঠ করবেন। অতঃপর দ্বিতীয় সিজদায়ও তা দশবার পাঠ করবেন, পরে সিজদা হতে মাথা তুলে ঐ দু’আ দশবার পাঠ করা পর্যন্ত বসে থাকার পর দাঁড়াবেন (দ্বিতীয় রাকাতের জন্য)। অতঃপর আপনি প্রতি রাকাতে এরূপ পঁচাত্তর বার ঐ দু’আ পাঠ করবেন এবং এরূপ চার রাকাত নামায আদায় করবেন। যদি আপনার পক্ষে সম্ভব হয় তবে আপনি এই নামায দৈনিক একবার আদায় করবেন। যদি তা সম্ভব না হয় তবে প্রতি সপ্তাহে শুক্রবারে একবার; যদি তাও সম্ভব না হয় হবে প্রতি মাসে একবার; যদি তাও অসম্ভব হয়, তবে প্রতি বছরে একবার; যদি তাও সম্ভব না হয় তবে গোটা জীবনে অন্ততঃ একবার আদায় করবেন। (ইবন মাজা)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "মুহাম্মাদ ইবন সুফিয়ান (রহঃ) .... আবদুল্লাহ ইবন আমর (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একদা নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেন, তুমি আগামীকাল আমার নিকট আসবে। আমি তোমাকে একটি উপাদেয় বস্ত্ত দেব। তিনি বলেনঃ আমি মনে মনে ধারণা করলাম যে, তিনি নিশ্চয়ই আমাকে কোন জিনিসি প্রদান করবেন। (পরদিন আমি তাঁর খিদমতে হাজির হলে) তিনি বলেনঃ যখন সূর্য পশ্চিমাকাশে ঢলে পড়বে, তখন তুমি চার রাকাত নাময আদায় করবে। অতঃপর রাবী পূর্ববর্তী হাদীছের অনুরূপ বর্ণনা করেন। তিনি আরো বলেনঃ অতঃপর তুমি দ্বিতীয় সিজদা হতে মাথা উঠিয়ে সোজা হয়ে বসবে এবং দাঁড়ানোর পূর্বেই দশবার তাসবীহ, দশবার তাহমীদ, দশবার তাকবীর ও দশবার তাহলীল পাঠ করবে (অর্থাৎ সুবহানাল্লাহ, আলহামদু লিল্লাহ, লা ইলাহা ইল্লাল্লাহু ও আল্লাহু আকবার)। তুমি চার রাকাত নমাযেই এরূপ দু’আ পাঠ করবে। যদি তুমি যমীনের সর্বাপেক্ষা অধিক গুনাহগার ব্যক্তিও হও, তবুও তোমার গুনাহ মার্জিত হবে। রাবী বলেনঃ আমি তাঁকে জিজ্ঞাসা করি, যদি আমি তা ঐ সময়ে আদায় করতে না পারি? তিনি বলেনঃ তুমি দিবারাত্রির মধ্যে যখনই সুযোগ পাবে তখনই তা আদায় করবে। (তিরমিযী, ইবন মাজা)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": 1299,
			"text": "আবু তাওবা আর-রাবী (রহঃ) .... উরওয়া (রহঃ) হতে বর্ণিত। তিনি বলেনঃ জনৈক আনসার আমার নিকট বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জাফর (রাঃ) এর নিকট এই হাদীছটি বর্ণনা করেন। অতঃপর উপরোক্ত হাদীছের অনুরূপ বর্ণিত হয়েছে। রাবী আরো বলেনঃ প্রথম রাকাতের দ্বিতীয় সিজদা সম্পর্কে রাবী মাহদী ইবন মায়মূন হতে যেরূপ উক্ত হয়েছেন, তদ্রূপ এই স্থানেও বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": 1300,
			"text": "আবু বাকর ইবন আবুল আসওয়াদ (রহঃ) ..... কা’ব ইবন উজরা (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনী আবদুল আশহালের মসজিদে মাগরিবের নামায আদায় করেন। তিনি এসে নামায শেষে তাদের দেখতে পান যে, তাঁরা আরো নামায আদায় করছে। এতদ্দর্শনে তিনি বলেনঃ এটা (সুন্নাত) তো গৃহে আদায় করার নামায। -(তিরমিযী, ইবন মাজা)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": 1301,
			"text": "হুসায়েন ইবন আব্দুর রহমান (রহঃ) ..... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাগরিবের ফরয নামায আদায়ের পর দুই রাকাত সুন্নাত নামাযের কিরাআত এত দীর্ঘ করতেন যে, মসজিদে আগত লোকেরা বিচ্ছিন্ন হয়ে চলে যেত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": 1302,
			"text": "আহমাদ ইবন ইউনুস (রহঃ) ..... সাঈদ ইবন যুবায়ের (রহঃ) হতে এই সনদে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উপরোক্ত হাদীসের অনুরূপ বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "মুহাম্মাদ ইবন রাফে (রহঃ) .... উম্মে শুরায়হ (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা আমি আয়েশা (রাঃ)-কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নামায সম্পর্কে জিজ্ঞাসা করলে তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার ফরয নামায আদায়ের পর আমার আমার গৃহে প্রবেশ করে সব সময় চার রাকাত অথবা ছয় রাকাত নফল নামায আদায় করতেন। একদা রাত্রির প্রবল বর্ষণে গৃহের খেজুর পাতার চাল নষ্ট হয়ে ঐ ছিদ্র দিয়ে যে পানি পড়ছিল, তা আমি দেখছিলাম। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে নামাযের সময় স্বীয় বস্ত্রকে ধূলা, ময়লা, কাদা ইত্যাদি হতে রক্ষা করবার জন্য কোন সময় টানতে দেখি নাই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": 1304,
			"text": "আহমাদ ইবন মুহাম্মাদ (রহঃ) .... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেনঃ সূরা মুযযামমিলের “অর্ধরাত্রি অপেক্ষা কিছু কম সময়ের জন্য জেগে থেকে (দণ্ডায়মান হয়ে) নামায আদায় কর” আয়াতটি ঐ সূরায় পরবর্তী আয়াত “তোমাদের জন্য এটা নির্ণয় করা অসম্ভব” দ্বারা বাতিল করা হয়েছে। আল্লাহ্‌ তোমাদের কষ্ট অনুধাবন করে তোমাদের জন্য এটা সহজ করে দিয়েছেন যে, তোমরা নামাযের মধ্যে কুরআন হতে সহজে পঠিতব্য অংশ পাঠ করতে পার এবং রাতের কিছু অংশেও নামায আদায় করবে এবং রাত্রের প্রথমাংশে তাদের জন্য এই নামায আদায় খুবই সহজ। অতএব আল্লাহ্‌ তাআলা তোমাদের জন্য রাতে আদায়ের জন্য যা নির্ধারিত করে দিয়েছেন, তা তোমরা সঠিকভাবে আদায় কর। কেননা মানুষ যখন রাতে নিদ্রা হতে কখন সে জাগ্রত হবে, তা সে জানে না। এবং “আকওয়ামু কীলা” শব্দের অর্থ এই যে, কুরআনের মূল অর্থ উপলব্ধি করবার জন্য এটাই উত্তম সময়। অতঃপর আল্লাহ তাআলার বাণীঃ “লাকা ফিন- নাহারে সাভহান তাবীলা” কেননা দিনের বেলায় আপনি পার্থিব কাজকর্মে অধিক সময় ব্যস্ত থাকেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "আহমাদ ইবন মুহাম্মাদ (রহঃ) .... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেনঃ সূরা মুযযামমিলের প্রথমাংশ অবতীর্ণ হওয়ার পর সাহাবাগণ রোযার মাসের মত রাত জেগে নামায আদায় করতেন। অতঃপর উক্ত সূরার শেষাংশ অবতীর্ণ হয় এবং সূরা মুযযামমিলের প্রথম ও শেষাংশের অবতীর্ণ হওয়ার মধ্যে সময়ের ব্যবধান ছিল এক বছরের।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "আবদুল্লাহ ইবন মাসলামা (রহঃ) .... আবু হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ইরশাদ করেছেনঃ তোমাদের কেউ যখন ঘুমায় তখন শয়তান তার মাথার পেছনের চুল তিনটি গিরা দিয়ে রাখে এবং প্রত্যেক গিরা দেওয়ার সময় সে বলেঃ তুমি ঘুমাও রাত এখনও অনেক বাকী। অতঃপর ঐ ব্যক্তি ঘুম থেকে জেগে যদি আল্লাহ তাআলার যিকির করে, তবে একটি গিরা খুলে যায়। অতঃপর সে যখন উযু করে তখন আরেকটি গিরা খুলে যায় এবং সে যখন নামায আদায় করে তখন সর্বশেষ গিরাটিও খুলে যায়। অতঃপর সে ব্যক্তি (ইবাদাতের) মাধ্যমে তার দিনের শুভসূচনা করে, অথবা অলসতার মাধ্যমে খারাপভাবে তার দিনটি শুরু করে (বুখারী, মুসলিম, নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": 1307,
			"text": "মুহাম্মাদ ইবন বাশশার (রহঃ) ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ তোমরা তাহাজ্জুদের নামায পরিত্যাগ কর না। কেননা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম একে কোন সময় পরিত্যাগ করতেন না। যখন তিনি অসুস্থ হতেন অথবা আলস্য বোধ করতেন তখন তিনি তা বসে আদায় করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": 1308,
			"text": "ইবন বাশশার (রহঃ) ...... আবু হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ আল্লাহ ঐ ব্যক্তির উপর রহম করুন, যে রাত জেগে নামায আদায় করে; অতঃপর সে স্বীয় স্ত্রীকে ঘুম হতে জাগ্রত করে। আর যদি সে ঘুম হতে উঠতে না চায় তখন সে তার চোখে পানি ছিটিয়ে দেয় ( নিদ্রাভঙ্গের জন্য)। আল্লাহ ঐ মহিলার উপর রহম করুন যে রাতে উঠে নামায আদায় করে এবং স্বীয় স্বামীকে জাগ্রত করে। যদি সে ঘুম হতে উঠতে অস্বীকার করে, তখন সে তার চোখে পানি ছিটিয়ে দেয়। (নাসাঈ, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": 1309,
			"text": "ইবন কাছীর (রহঃ) .... আবু সাঈদ ও আবু হুরায়রা (রাঃ) হতে বর্ণিত। তারা বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ যখন কোন ব্যক্তি রাত্রিতে স্বীয় স্ত্রীকে ঘুম হতে জাগিয়ে একত্রে নামায আদায় করে অথবা তারা পৃথক পৃথকভাবে নামায আদায় করে, তখন তাদের নাম যিকিরকারী পুরুষ ও যিকিরকারিণী স্ত্রী হিসাবে আমলের খাতায় লিপিবদ্ধ করা হয়। রাবী। রাবী ইবন কাছীর আবু হুরায়রা (রাঃ) এর নাম উল্লেখ করেন নাই, বরং আবু সাঈদ (রাঃ) এর নাম উল্লেখ করেছেন। (নাসাঈ, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": 1310,
			"text": "আল-কানবী (রহঃ) .... নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্ত্রী আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনঃ যখন তোমাদের কারও নামাযের মধ্যে তন্দ্রাভাব আসে, সে যেন তখন নিদ্রা যায়; যাতে তার নিদ্রা পূর্ণ হওয়ার পর ঐ ভাব চলে যায়। কেননা তোমাদের কেউ যখন তন্দ্রা অবস্থায় নামায আদায়কালে ‘ইস্তিগফার’ (গোনাহ মাফের জন্য প্রার্থনা) করে তখন হয়ত সে (অজান্তে) নিজকে নিজেই গালি দেয়। (বুখারী, মুসলিম, তিরমিযী, নাসাঈ, ইবন মাজা )।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": 1311,
			"text": "আহমাদ ইবন হাম্বল (রহঃ) ..... আবু হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসুলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ইরশাদ করেনঃ তোমাদের কেউ রাত্রিতে তাহাজ্জুদ নামায পাঠের জন্য দণ্ডায়মান হয়, তখন তন্দ্রার কারণে কুরআনের আয়াত পাঠ করছে তা বুঝতে না পারে, এমতাবস্থায় সে নিদ্রার জন্য শয়ন করবে। (মুসলিম, তিরমিযী)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": 1312,
			"text": "যিয়াদ ইবন আইউব (রহঃ) ..... আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম মসজিদে প্রবেশ করে দেখতে পান যে, দুটি খুটির সাথে একটি রশি বাঁধা আছে। তিনি জিজ্ঞাসা করেনঃ এটা কেন? তখন জনৈক ব্যক্তি বলেনঃ এটা হামনা বিনতে জাহাশ (রাঃ) এর রশি। তিনি রাত্রিতে নামায আদায়কালে যখন ক্লান্তিবোধ করেন, তখন তিনি নিজেকে এর দ্বারা আটকে রাখেন। এতদশ্রবণে রাসূলুল্লাহ সাল্লাল্লাহু অলাইহে ওয়াসাল্লাম বলেনঃ সামর্থ অনুযায়ী নামায আদায় করবে এবং যখন ক্লান্তি বোধ করবে, তখন বিশ্রাম গ্রহণ করবে। রাবী যিয়াদ বলেনঃ তিনি জিজ্ঞাসা করেনঃ এটা কি? জবাবে তাঁরা বলেনঃ এটা যয়নব (রাঃ) এর রশি। তিনি রাত্রিতে নামায আদায়কালে যখন ক্লান্তিবোধ করেন, তখন তিনি এর দ্বারা নিজেকে আটকে রাখেন। তখন তিনি নির্দেশ দেন, এটা খুলে ফেল। অতঃপর তিনি বলেনঃ তোমরা আনন্দের সাথে নামায আদায় করবে এবং যখন ক্লান্তি বোধ করবে তখন বিশ্রাম নিবে। (বুখারী, মুসলিম, নাসাঈ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": 1313,
			"text": "কুতায়বা ইবন সাঈদ (রহঃ) ..... উমার ইবনুল খাত্তাব (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ইরশাদ করেছেনঃ যে ব্যক্তি রাত্রিতে নামায আদায়কালে নিদ্রার কারণে তার সম্পূর্ণ বা আংশিক অযীফা পরিত্যক্ত হয়; অতঃপর সে যদি তা ফজর ও যোহরের মধ্যবর্তী সময়ে পাঠ করে, তবে রাত্রিতে পাঠের ফলে যেরূপ ছওয়াব ঐ ব্যক্তির আমলনামায় লেখা হত তদ্রুপ ছওয়াব লেখা হয়। (মুসলিম, নাসাঈ, তিরমিযী, ইবন মাজা )।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": 1314,
			"text": "আল-কানবী (রহঃ) .... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ইরশাদ করেছেনঃ যে ব্যক্তি রাত্রিতে নিয়মিত নামায আদায় করে থাকে সে যদি কোন রাত্রিতে নিদ্রাচ্ছন্ন হওয়ার কারণে নামায আদায়ে ব্যর্থ হয় তবুও আল্লাহ তাআলা তার আমলনামায় উক্ত নামায আদায়ের অনুরূপ ছাওয়াব প্রদান করবেন এবং তার ঐ নিদ্রা সদকাস্বরূপ হবে। (নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "আল-কানবী (রহঃ) .... আবু হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ইরশাদ করেছেনঃ প্রত্যহ আল্লাহ রব্বুল আলামীন রাত্রির এক-তৃতীয়াংশ অবশিষ্ট থাকতে দুনিয়ার আকাশে অবতীর্ণ হয়ে বলতে থাকেনঃ তোমাদের কেউ আমার নিকট কোন কিছুর জন্য প্রার্থনা করবে, আমি তার ঐ দুআ কবুল করব, যে কেউ আমার নিকট কিছু যাচ্ঞা করবে, আমি তা তাকে প্রদান করব এবং যে আমার নিকট গোনাহ মাফের জন্য কান্না করবে, আমি তার গোনাহ মাফ করব (এতে বুঝা গেল যে, দু’আ কবুলের জন্য রাত্রির তিনভাগের শেষ ভাগ সময়টি উত্তম)। (বুখারী, মুসলিম, তিরমিযী, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": 1316,
			"text": "হুসায়েন ইবন য়াযীদ (রহঃ) .... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহ তাআলা নবী করীম সাল্লাল্লাহু আলাইহে ওয়াসাল্লামকে রাতের এমন সময় ঘুম হতে জাগাতেন যে, তিনি তাঁর আশানুরূপ ওযীফা শেষ না করা পর্যন্ত সাহরীর সময় হত না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": 1317,
			"text": "ইবরাহীম ইবন মূসা ও হান্নাদ (রহঃ) .... মাসরূক (রহঃ) হতে বর্ণিত। তিনি বলেন, একদা আমি আয়েশা (রাঃ)-কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নামায সম্পর্কে জিজ্ঞাসা প্রসঙ্গে বলিঃ তিনি রাতের কোন অংশে নামায আদায় করতেন? জবাবে তিনি বলেনঃ তিনি রাতে মোরগের ডাক শুনে জাগরিত হয়ে নামায আদায় করতেন (অর্থাৎ অর্ধরাত্রির পর)। (বুখারী, মুসলিম)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": 1318,
			"text": "আবু তাওবা (রহঃ) ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাধারণত (ভোর রাতে তাহাজ্জুদ পাঠের পর কিছুক্ষণ) ঘুমাতেন। (বুখারী, মুসলিম,ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": 1319,
			"text": "মুহাম্মাদ ইবন ঈসা (রহঃ) .... হুযায়ফা (রাঃ) হতে বর্ণিত। তিনি বলেন নবী করীম সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম কোন কঠিন সমস্যার সম্মুখীন হলে নামাযে মশগুল হয়ে যেতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": 1320,
			"text": "হিশাম ইবন আম্মার (রহঃ) ..... রবীআ ইবন কাব আল-আসলামী (রাঃ) হতে বর্ণিত। তিনি বলেনঃ আমি প্রায়ই সফরকালীন সময়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লামের সাথে অবস্থান করে তাঁর উযুর পানি ও অন্যান্য প্রয়োজনীয় দ্রব্যাদি সরবরাহ করতাম। একদা তিনি আমাকে বলেনঃ তুমি আমার নিকট কিছু চাও? তখন আমি বলিঃ আমি জান্নাতের মধ্যে আপনার সঙ্গী হিসেবে থাকতে চাই। তিনি বলেনঃ এ ছাড়াও অন্য কিছু চাও? আমি বলিঃ এটাই আমার একমাত্র কামনা। তিনি বলেনঃ তুমি অধিক সিজদা আদায়ের দ্বারা তোমার দাবী পূরণে আমাকে সাহায্য কর। (মুসলিম, নাসাঈ, তিরমিযী, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": 1321,
			"text": "আবু কামিল (রহঃ) ..... আনাস ইবন মালিক (রাঃ) হতে বর্ণিত। তিনি এই আয়াত সম্পর্কেঃ “তারা তাদের পৃষ্ঠদেশকে বিছানা হতে আল্লাহ্‌র ভয় ও আশায় দূরে রাখে এবং তাদের জন্য প্রদত্ত রিযিক হতে তারা আল্লাহ্‌র রাস্তার খরচ করে” বলেন যে, সাহাবীগণ মাগরিব ও ইশার মধ্যবর্তীকালীন সময়ে নামায আদায় করতেন (অর্থাৎ তারা মাগরিবের নামায আদায়ের পর না ঘুমিয়ে ইশার নামাযের জন্য অপেক্ষা করতেন)। রাবী হাসান বলেনঃ এর দ্বারা তাহাজ্জুদ নামায বুঝানো হয়েছে",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1322,
			"arabicnumber": 1322,
			"text": "মুহাম্মাদ ইবনুল মুছান্না (রহঃ) .... আনাস (রাঃ) হতে বর্ণিত। তিনি বলেনঃ আল্লাহ্‌র বানী \"তারা রাত্রিতে খুব কম সময়ই আরাম করত\" এই আয়াতের অর্থ হলঃ তারা মাগরিব ও ইশার মধ্যবর্তী সময়ে নামায আদায় করত। রাবী ইয়াহইয়া তাঁর বর্ণিত হাদীছে আরও বর্ণনা করেছেন যে, “তাদের পৃষ্ঠদেশ বিছানা হতে দূরে অবস্থান করত\" – এই আয়াতের অর্থও পূর্বের আয়াতের অনুরূপ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1323,
			"arabicnumber": 1323,
			"text": "আর-রাবী ইবন নাফে (রহঃ) ..... আবু হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ইরশাদ করেছেনঃ যখন তোমাদের কেউ রাত্রিতে তাহাজ্জুদ নামাযের জন্য উঠে তখন সে যেন হালকাভাবে দুই রাকাত (নফল) নামায আদায় করে। (মুসলিম)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1324,
			"arabicnumber": 1324,
			"text": "মাখলাদ ইবন খালিদ (রহঃ) ..... আবু হুরায়রা (রাঃ) হতে এই সনদেও উপরোক্ত হাদীছের অনুরূপ বর্ণিত হয়েছে। তবে এতে আরও বর্ণিত হয়েছে যে, অতঃপর তুমি তোমার ইচ্ছানুযায়ী দীর্ঘ কিরাআত দ্বারা নামায আদায় করতে পার। ( মুসলিম)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1325,
			"arabicnumber": 1325,
			"text": "আহমাদ ইবন হাম্বল (রহঃ) ..... আবদুল্লাহ ইবন হাবশী আল খাছাআমী (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একদা নবী করীম সাল্লাল্লাহু আলাইহে ওয়াসাল্লামকে উত্তম আমল সম্পর্কে জিজ্ঞাসা করা হলে তিনি বলেনঃ উত্তম আমল হল দীর্ঘক্ষণ দাঁড়িয়ে থেকে নামায আদায় করা। (মুসলিম)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1326,
			"arabicnumber": 1326,
			"text": "আল-কানবী ..... আবদুল্লাহ ইবন উমার (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একদা জনৈক ব্যক্তি রাসূলুল্লাহ সাল্লল্লাহু আলাইহে ওয়াসাল্লামকে রাতের নামাযের রাকাত সংখ্যা সম্পর্কে জিজ্ঞাসা করলে তিনি বলেনঃ রাতের নামায হল-দুই দুই রাকাতের। অতঃপর তোমরা কেউ যখন নামায আদায়কালে ‘সুবহে সাদিকের’ আশংকা করবে (তখন পাঠিত দুই রাকাতের সাথে) এক রাকাত মিলিয়ে নামায শেষ করবে এবং এটা তোমার জন্য বিতির হিসাবে পরিগণিত হবে। (বুখারী, মুসলিম, নাসাঈ, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1327,
			"arabicnumber": 1327,
			"text": "মুহাম্মাদ ইবন জাফর (রহঃ) ..... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেনঃ নবী করীম সালাল্লাহু আলাইহে ওয়াসাল্লাম স্বগৃহে নামায আদায়কালে এতটা উচ্চস্বরে কিরাআত পাঠ করতেন যে, বাইরের লোকেরা শুনতে পেত।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1328,
			"arabicnumber": 1328,
			"text": "মুহাম্মাদ ইবন বাককার (রহঃ) .... আবু হুরায়রা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম রাতের (নফল) নামায আদায়কালে কখনও কিরাআত আস্তে এবং কখনও জোরে পাঠ করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1329,
			"arabicnumber": 1329,
			"text": "মূসা ইবন ইসমাঈল ও হাসান ইবনুস সাব্বাহ (রহঃ) .... আবু কাতাদা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একদা নবী করীম সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ঘর হতে বের হয়ে আবু বাকর (রাঃ)-কে আস্তে আস্তে (নিঃশব্দে কিরাআত দ্বারা) নামায আদায় করতে দেখেন। অতঃপর তিনি উমর (রাঃ) এর পাশ দিয়ে গমনকালে দেখতে পান যে, তিনি শব্দ করে (জোর কিরাআত পাঠ করে) নামায আদায় করছেন। রাবী বলেনঃ অতঃপর তাঁরা উভয়ে নবী কারিম সাল্লাল্লহু আলাইহে ওয়াসাল্লামের খিদমতে হাযির হলে তিনি বলেনঃ হে আবু বাকর! আমি তোমার পাশ দিয়ে গমনকালে তোমাকে নিঃশব্দে নামায করতে দেখেছি। তখন তিনি (আবু বাকর) বলেনঃ ইয়া রাসুলাল্লাহ! আমি আমার রবের সাথে গোপনে আলাপ করেছি এবং তিনি তা শ্রবণকারী (কাজেই আমি সশব্দে নামায আদায়ের প্রয়োজন বোধ করি নাই)। রাবী বলেনঃ অতঃপর তিনি উমার (রাঃ)-কে বলেনঃ আমি তোমার পাশ দিয়ে গমনকালে তোমাকে সশব্দে নামায আদায় করতে দেখেছি। উমার (রাঃ) বলেনঃ এর দ্বারা আমার ইচ্ছা ছিল ঘুমন্ত ব্যক্তিকে জাগ্রত করা এবং শয়তানকে বিতাড়িত করা। রাবী হাসান তাঁর বর্ণিত হাদীছে এরূপ অতিরিক্ত বর্ণনা করেছেন যে, তখন নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হে আবু বাকর! তুমি তোমার কিরাআতকে একটু শব্দ করে পাঠ করবে। অতঃপর তিনি উমার (রাঃ)-কে বলেনঃ তুমি তোমার কিরাআত একটু নিম্ন শব্দে পাঠ করবে। (তিরমিযী)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1330,
			"arabicnumber": 1330,
			"text": "আবু হুসায়েন (রহঃ) ..... আবু হুরায়রা (রাঃ) হতে বর্ণিত। তিনি নবী করীম সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম হতে উপরোক্ত হাদীছের অনুরূপ বর্ণনা করেছেন। তবে এই বর্ণনায় আবু বাকর (রাঃ)-কে একটু শব্দ করে এবং উমার (রাঃ)-কে একটু শব্দ ছোট করে পড়ার কথার উল্লেখ নাই। আবু হুরায়রা (রাঃ) এর বর্ণনায় অতিরিক্ত উল্লেখ আছে যে, তিনি বলেনঃ হে বিলাল! তুমি নামাযের মধ্যে এই সুরা পাঠ করে থাক। তখন বিলাল (রাঃ) বলেনঃ আল্লাহ তাআলা কুরআনের আয়াতকে সুন্দররূপে সুসজ্জিত করেছেন (কাজেই তা পাঠ করতে আমার ভালো লাগে)। এতদশ্রবনে নবী সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম বলেনঃ তোমরা সকলেই সঠিক কাজ করেছ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1331,
			"arabicnumber": 1331,
			"text": "মুসা ইবন ইসমাইল (রহঃ) ...... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একদা এক ব্যক্তি রাতে নামায আদায় করাকালে উচ্চস্বরে কিরআত পাঠ করে। অতঃপর সকালে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম বলেনঃ আল্লাহ ঐ ব্যক্তির উপর রহম করুন। সে আমাকে গতরাতে কয়েকটি আয়াত স্মরণ করিয়ে দিয়েছে যা আমি ভুলতে বসেছিলাম। (বুখারী, মুসলিম, নাসাঈ)। রাবী আবু দাউদ (রহঃ) বলেন, তা ছিল সূরা আল ইমরান এই আয়াতটিঃ (وَكَأَيِّنْ مِنْ نَبِيٍّ)...।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1332,
			"arabicnumber": 1332,
			"text": "হাসান ইবন আলী (রহঃ) ..... আবু সাঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম মসজিদে “ইতিকাফ” করাকালীন সাহাবীদেরকে উচ্চস্বরে কিরআত পাঠ করতে শুনে পর্দা উঠিয়ে বলেনঃ জেনে রাখ। তোমরা প্রত্যেকেই তোমাদের রবের সাথে গোপন আলাপ রত আছ। অতএব তোমরা (উচ্চস্বরে কিরআত পাঠের দ্বারা) একে অন্যকে কষ্ট দিও না তোমরা একে অন্যের চাইতে উচ্চস্বরে কিরআত পাঠ কর না। (নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1333,
			"arabicnumber": 1333,
			"text": "উছমান ইবন আবু শায়বা (রহঃ) ..... উকবা ইবন আমের আল-জুহানী (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ইরশাদ করেছেনঃ কুরআন উচ্চস্বরে পাঠকারী প্রকাশ্যে দান-খয়রাতকারীর অনুরূপ এবং গোপনে কুরআন পাঠ-কারী গোপন দানকারীর মত। (তিরমিযী, নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1334,
			"arabicnumber": 1334,
			"text": "ইবনুল মুছান্না (রহঃ) ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম রাত্রিতে দশ রাকাত নামায আদায় করতেন এবং এর সাথে আরো এক রাকাত মিলিয়ে ‘বিতির’ পূর্ণ করতেন। অতঃপর তিনি ফজরের দুই রাকাত (সুন্নাত) আদায় করতেন। এইরূপে মোট তের রাকাত হত। (বুখারী, মুসলিম, নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1335,
			"arabicnumber": 1335,
			"text": "আল-কানবী (রহঃ) ...... রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) রাত্রিতে এক রাকাত বিতির সহ মোট এগার রাকাত নামায আদায় করতেন। অতঃপর নানায শেষে তিনি বিশ্রামের জন্য ডানপাশের উপর ভর করে শুয়ে যেতেন। (বুখারী, মুসলিম, তিরমিযী, নাসাঈ, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1336,
			"arabicnumber": 1336,
			"text": "আব্দুর রহমান ইবন ইবরাহীম (রহঃ) ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার নামাযের পর হতে সুবহে সাদিকের পূর্ব পর্যন্ত মধ্যেবর্তী সময়ে এগার রাকাত নামায আদায় করতেন এবং প্রতি দুই রাকাতে তিনি সালাম ফিরাতেন। অতঃপর তিনি শেষ দুই রাকাতের সাথে আরো এক রাকাত মিলিয়ে বিতির পূর্ণ করতেন। তিনি এত দীর্ঘ সময় সিজদাতে অবস্থান করতেন এবং প্রতি দুই রাকাতে তিনি সালাম ফিরাতেন। অতঃপর তিনি শেষ দুই রাকাতের সাথে আরো এক রাকাত মিলিয়ে বিতির পূর্ণ করতেন। তিনি এত দীর্ঘ সময় সিজদাতে অবস্থান করতেন যে, তাঁর মাথা উঠাবার পূর্বে তোমরা যে কেউ পঞ্চাশ আয়াত পরিমাণ পাঠ করতে পারতে। অতঃপর মুয়াযযিন যখন ফজরের আযান শেষ করতেন, তখন তিনি দণ্ডায়মান হয়ে হাল্কাভাবে দুই রাকাত নামায আদায় করতেন। পরে মুয়াজ্জিন পুনরায় আসা পর্যন্ত ডান পাশের উপর ভর করে শুয়ে থাকতেন। (বুখারী, মুসলিম, নাসাঈ, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1337,
			"arabicnumber": 1337,
			"text": "সুলায়মান ইবন দাউদ (রহঃ) ..... ইবন শিহাব (রহঃ) হতে উপরোক্ত হাদীছের সনদ ও অর্থে বর্ণিত হয়েছে। রাবী বলেনঃ তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) শেষ দুই রাকাত নামাযের সাথে আরো এক রাকাত মিলিয়ে বিতির পূর্ণ করতেন। তিনি এত দীর্ঘক্ষণ সিজদায় অবস্থান করতেন যে, এই সময় তোমারা যে কেউ পঞ্চাশ আয়াত পরিমাণ তিলওয়াত করতে পারতে। অতঃপর মুআযযিন যখন আযান শেষ করতেন এবং আকাশও পরিষ্কার হয়ে যেত ... পূর্ববর্তী হাদীছের অনুরূপ বর্ণিত হয়েছে। (বুখারী, মুসলীম, নাসাঈ, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1338,
			"arabicnumber": 1338,
			"text": "মূসা ইবন ইসমাইল (রহঃ) ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম রাতে বিতির সহ তের রাকাত নামায আদায় করতেন। বিতির নামাযের পঞ্চম রাকাতে তিনি নামায শেষ করতেন। তিনি নামাযের মধ্যে মাঝখানে না বসে সর্বশেষ রাকাতে বসে সালাম ফিরাতেন। (বুখারী, মুসলিম, তিরমিযী, নাসাঈ, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1339,
			"arabicnumber": 1339,
			"text": "আল-কানবী (রহঃ) ...... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম রাতে তের রাকাত নামায আদায় করতেন এবং ফজরের আযানের পর হালকাভাবে দুই রাকাত (সুন্নাত) আদায় করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1340,
			"arabicnumber": 1340,
			"text": "মূসা ইবন ইসমাঈল (রহঃ) ...... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাতের বেলায় তের রাকাত নামায আদায় করতেন এবং তাঁর আট রাকাত হত তাহাজ্জুদ বা নফল। অতঃপর তিনি বিতিরের নামায আদায় করতেন। পরে তিনি ফজরের দুই রাকাত সুন্নাত আদায় করতেন। ইমাম মুসলিম (রহঃ) বলেনঃ তিনি বিতিরের পরে দুই রাকাত নামায বসে আদায় করতেন। অতঃপর ফজরের আযান ও ইকামাতের মাঝখানে দুই রাকাত ফজরের সুন্নাত নামায আদায় করতেন। (মুসলিম, নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1341,
			"arabicnumber": 1341,
			"text": "আল-কানবী (রহঃ) ..... আবু সালামা ইবন আব্দুর রহমান (রহঃ) হতে বর্ণিত। একদা তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্ত্রী আয়েশা (রাঃ)-কে জিজ্ঞাসা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম রমযান মাসে কিরূপ নামায আদায় করতেন? তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযান মাস ও অন্যান্য সময়েও রাত্রিতে এগার রাকাত নামায আদায় করতেন। প্রথমে তিনি সুদীর্ঘ কিরাআতের দ্বারা সুন্দরভাবে চার রাকাত নামায আদায় করতেন অতঃপর তিনি আরো চার রাকাত আনুরূপভাবে আদায় করতেন এবং সবশেষে তিনি বিতিরের তিন রাকাত নামায আদায় করতেন। আয়েশা (রাঃ) বলেনঃ একদা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লামকে জিজ্ঞাসা করি, ইয়া রাসূলাল্লাহ! আপনি কি বিতির নামায পাঠের পূর্বে নিদ্রা যান? জবাবে তিনি বলেনঃ হে আয়েশা! আমার চক্ষু তো নিদ্রা যায়, কিন্তু আমার অন্তর জাগ্রত থাকে ( বুখারী, মুসলিম, তিরমিযী, নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "হাফস ইবন উমার (রহঃ) .... সা’দ ইবন হিশাম (রহঃ) হতে বর্ণিত। তিনি বলেনঃ একদা আমি আমার স্ত্রীকে তালাক দেওয়ার পর (বসরা) হতে মদীনায় আমার যে যমীনটি ছিল, তা বিক্রয় করে যুদ্ধস্ত্র খরিদের উদ্দেশ্যে মদীনায় গমন করি এবং এ কাজে আমার উদ্দেশ্য ছিল (রোমকদের) বিরুদ্ধে যুদ্ধ করা। ঐ সময়ে আমি নবী করীম সাল্লাল্লাহু আলাইহে ওয়াসাল্লামের সাহাবীদের সাথে সাক্ষাত করি। তখন তাঁরা বলেনঃ আমাদের মধ্যেকার ছয় ব্যক্তিও তোমার ন্যায় স্বীয় স্ত্রীকে পরিত্যাগ করে যুদ্ধে গমনের ইচ্ছা করেছিল। তখন নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁদেরকে এরূপ করতে নিষেধ করেন এবং ইরশাদ করেনঃ “তোমাদের জন্য আল্লাহ্‌র রাসূলের জীবনে উত্তম আদর্শ নিহিত আছে।\" রাবী বলেনঃ অতঃপর আমি ইবন আব্বাস (রাঃ) এর খিদমত উপস্থিত হয়ে তাঁর নিকট নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বিতির নামায আদায় সম্পর্কে জিজ্ঞাস করি। তিনি বলেনঃ এসম্পর্কে যিনি সবচাইতে অভিজ্ঞ আমি তোমাকে তাঁর ঠিকানা প্রদান করছি। কাজেই তুমি এব্যাপারে জানার জন্য আয়েশা (রাঃ)-এর নিকট গমন কর। তখন আমি তাঁর নিকট গমনের জন্য ইবন আফলাহকে অনুরোধ করি। কিন্তু তিনি অস্বীকৃতি জ্ঞাপন করেন। এমতবস্থায় আমি তাঁকে আল্লাহ্‌র নামে শপথ প্রদান করে আমার সাথে যেতে অনুরোধ করি। তখন হাকীম ইবন আফলাহ আমাকে নিয়ে আয়েশা (রাঃ)-এর কাছে গমন করে সাক্ষাতের জন্য অনুমতি প্রার্থনা করেন। আয়েশা (রাঃ) জিজ্ঞাসা করেনঃ কে? জবাবে তিনি বলেনঃ (আমি) হাকীম ইবন আফলাহ। তখন তিনি বলেনঃ তোমার সঙ্গী কে? আমি বলিঃ সা’দ ইবন হিশাম। তখন তিনি জিজ্ঞেস করেনঃ ঐ হিশাম না কি, যিনি ওহোদের যুদ্ধে মারা যান? তখন হাকিম বলেনঃ হ্যাঁ। আয়েশা (রাঃ) বলেনঃ হিশাম ইবন আমের তো অত্যন্ত ভালো লোক ছিল। তখন সাদ বলেনঃ হে উম্মুল মুমেনীন! আপনি আমার নিকট রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লামের পুতঃ চরিত্র সম্পর্কে কিছু বলুন। তিনি বলেনঃ তুমি কুরআন পাঠ কর না? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পবিত্র জীবন মুকুরই ছিল কুরআন। আমি তাঁকে বলিঃ আপনি তাঁর রাত জাগরন সম্পর্কে কিছু বলুন। তিনি বলেনঃ তুমি কি সূরা মুযযামমিল পাঠ কর নাই? জবাবে আমি বলিঃ হ্যাঁ। তিনি (আয়েশা) বলেনঃ এই সূরায় প্রথমাংশ যখন নাযিল হয়, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণ দীর্ঘ বারটি মাস সারা রাত এমনভাবে দাঁড়িয়ে (নামাযে) কাটাতেন যে, তাঁদের পা ফুলে যেত। অতঃপর ঐ সূরার শেষাংশ অবতীর্ণ হলে, এই রাত্রির দাঁড়ান (অবস্থা) ফরয হতে নফলে পরিবর্তিত হয়। অতঃপর আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বিতির নামায পাঠ সম্পর্কে কিছু বলতে বললে তিনি ইরশাদ করেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম রাতে প্রথম নয় রাকাত নামাযের শেষ তিন রাকাত বিতির হিসাবে আদায় করে সালাম ফিরাতেন অতঃপর তিনি বসে দুই রাকাত নামায আদায় করতেন। কাজেই হে প্রিয় বৎস! এটাই তাঁর সর্বমোট এগার রাকাত নামায পাঠের বর্ণনা। অতঃপর বয়োঃবৃদ্ধির কারণে তিনি সাত রাকাত নামাযের শেষ তিন রাকাত বিতির আদায় করে সালাম ফিরাতেন। অতঃপর বসে দুই রাকাত নামায আদায় করতেন। হে বৎস। এটাই তার নয় রাকাত নামায আদায়ের বর্ণনা। তিনি আরো বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সারা রাত জেগে থেকে কোন সময়ই ইবাদত করেন নাই এবং তিনি এক রাতে কুরআন খতম কোন সময়ই করেন নাই এবং রমযান ব্যতীত অন্য মাসে তিনি সারা মাস রোযা রাখেন নাই এবং যখন তিনি কোন নামায আদায় করা শুরু করতেন, তখন তিনি তা নিয়মিতভাবে আদায় করতেন। আর রাত্রিতে যখন তিনি কোন কারনবশত নিদ্রাছন্ন হয়ে পড়তেন, তখন তিনি দিনের বেলা ঐ বার রাকাত নামায আদায় করতেন। রাবী বলেনঃ অতঃপর আমি ইবন আব্বাস (রাঃ) এর নিকট গমন করে এরূপ বর্ণনা করায় তিনি বলেনঃ আল্লাহ্‌র শপথ! এটাই আসল হাদীস। আমি যদি তাঁর (আয়েশা) সাথে আলাপ করতাম তবে এব্যাপারে আমি সরাসরি তাঁর সাথে বাক্যবিনিময় করতাম। অতঃপর রাবী বলেনঃ যদি আমি জানতাম যে, আপনি তাঁর সাথে বাক্যালাপ করেন তবে এটা আমি আপনার নিকট বর্ণনা করতাম না। (মুসলিম, নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1343,
			"arabicnumber": 1343,
			"text": "মুহাম্মাদ ইবন বাশশার (রহঃ) ..... আবু কাতাদা (রাঃ) হতে উপরোক্ত সনদে অনুরূপ হাদীস বর্ণিত হয়েছে। রাবী বলেনঃ তিনি একই সঙ্গে (বিনা বৈঠকে) আট রাকাত নামায আদায় করে বসতেন এবং পরে আল্লাহ্‌র যিকির ও দু’আ পাঠ করে এমনভাবে সালাম ফিরাতেন, যা আমরা শুনতে পেতাম। অতঃপর তিনি বসে দুই রাকাত নাময আদায় করতেন। পরে তিনি এক রাকাত নামায আদায় করতেন। হে বৎস! এটাই তাঁর আদায়কৃত এগার রাকাত নামাযের বর্ণনা। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সপ্তম রাকাতের সময় বিতির সমাপ্ত করতেন। অতঃপর তিনি বসে দুই রাকাত নামায আদায় করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "উছমান ইবন আবু শায়বা (রহঃ) ..... সাইদ (রহঃ) হতে পূর্ববর্তী হাদীসের অনুরূপ বর্ণিত হয়েছে। তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) এমনভাবে সালাম ফিরাতেন, যা আমরা শুনতে পেতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1345,
			"arabicnumber": 1345,
			"text": "মুহাম্মাদ ইবন বাশশার (রহঃ) .... সাঈদ (রহঃ) হতে পূর্ববর্তী হাদীসের অনুরূপ বর্ণিত হয়েছে। ইবন বাশশার ইয়াহহিয়া ইবন সাঈদ হতে বর্ণিত হাদীসের অনুরূপ হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1346,
			"arabicnumber": 1346,
			"text": "আলী ইবন হুসায়েন (রহঃ) .... যুরারাহ ইবন আওফ (রহঃ) হতে বর্ণিত। তিনি বলেনঃ একদা আয়েশা (রাঃ)-কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লামের মধ্যরাত্রির নামায পাঠ সম্পর্কে জিজ্ঞাসা করা হলে তিনি বলেনঃ তিনি ইশার নামায জামাআতে আদায়ের পর গৃহে আসতেন। অতঃপর তিনি চার রাকাআত নামায আদায় করে বিছানায় গমন করে ঘুমিয়ে পড়তেন। এ সময় উযুর পানির বদনা তাঁর শিয়রে ঢাকা অবস্থায় থাকত এবং মিসওয়াকও তাঁর পাশে থাকত। অতঃপর তিনি রাত্রির বিশেষ সময়ে আল্লাহ্‌র নির্দেশে জাগ্রত হয়ে মিসওয়াক করত ভালোভাবে উযু করতেন। পরে তিনি জায়নামাযে গমন করে আট রাকাত নামায আদায় করতেন। তিনি এই নামাযের রাকাআতসমুহে সূরা ফাতিহা এবং কুরআনের অন্য সূরা পাঠ করতেন, যা আল্লাহর ইচ্ছা হত এরূপ আরো আয়াত পাঠ করতেন। তিনি এই আট রাকাত নামায আদায়কালে মাঝখানে না বসে শেষ রাকাতের পরে বসতেন এবং সালাম ফিরাবার পূর্বে দণ্ডায়মান হয়ে নবম রাকাত আদায় করে বসতেন। অতঃপর আল্লাহ্‌র ইচ্ছানুযায়ী দু’আ করতেন এবং তাঁর নিকট প্রার্থনা করতেন এবং তাঁর প্রতি আকৃষ্ট হতেন। পরিশেষে তিনি স্বশব্দে সালাম ফিরাতেন যার ফলে গৃহের লোকেরা জাগ্রত হবার উপক্রম হত। অতঃপর তিনি বসে দুই রাকাত নামায আদায় করতেন এবং এখানে সূরা ফাতেহা পাঠের পর বসাবস্থায় রুকূ করতেন, অতঃপর দ্বিতীয় রাকাত রুকূ ও সিজদার সাথে বসে আদায় করতেন। পরে তিনি আল্লাহ্‌র মর্জি অনুযায়ী দুআ করতঃ সালাম ফিরিয়ে নামায শেষ করতেন। তাঁর শরীর মোবারক ভারী ও দুর্বল হয়ে পড়লে তিনি নয় রাকাতের স্থলে দুই রাকাত বাদ দিয়ে ছয় এবং তার সাথে এক রাকাত যোগ করে সাত রাকাত আদায় করতেন এবং তাঁর ইন্তেকালের পূর্বে পর্যন্ত এরূপে নামায আদায় করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1347,
			"arabicnumber": 1347,
			"text": "হারূন ইবন আবদুল্লাহ (রহঃ) ..... বাহয ইবন হাকীম (রহঃ) উপরোক্ত হাদিসের সনদে হাদিস বর্ণনা করেছেন। তিনি বলেনঃ তিনি ইশার নামায শেষে বিছানায় গমন করতেন এবং উক্ত বর্ণনায় তাঁর চার রাকাত নামায আদায় সম্পর্কে কিছু উল্লেখ নাই। তিনি বর্ণনা করেন যে, তিনি আট রাকআত নামায আদায় করবার সময় কিরাআত, রুকূ ও সিজদার মধ্যে সমতা রক্ষা করতেন এবং এই নামাযের কেবলমাত্র শেষ রাকাতে তিনি বসতেন। অতঃপর দণ্ডায়মান হয়ে বিতিরের এক রাকাত আদায় করে এমন সশব্দে সালাম ফিরেতেন যে, আমরা জাগ্রত হয়ে যেতাম। অতঃপর পূর্ববর্তী হাদীসের অনুরূপ অর্থে বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1348,
			"arabicnumber": 1348,
			"text": "আমর ইবন উছমান (রহঃ) .... আয়েশা (রাঃ) হতে বর্ণিত। একদা তাঁকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নামায সম্পর্কে জিজ্ঞাসা করা হলে তিনি বলেনঃ তিনি ইশার নাময জামাআতে আদায়ের পর গৃহে প্রত্যাবর্তন করতেন। অতঃপর তিনি চার রাকাত নামায আদায় করে বিছানায় যেতেন। অতঃপর পূর্ববর্তীর হাদীসের অনুরূপ বর্ণিত হয়েছে এবং এই বর্ণনায় তিনি যে কিরআত, রুকূ ও সিজদার মধ্যে সমতা রক্ষা করতেন, এর উল্লেখ নাই এবং তাঁর সশব্দ সালাম আমাদের যে নিদ্রাভংগ হত, তারও উল্লেখ নেই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1349,
			"arabicnumber": 1349,
			"text": "মূসা ইবন ইসমাঈল (রহঃ) ..... আয়েশা (রাঃ) হতে উপরোক্ত হাদীসের অনুরূপ বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1350,
			"arabicnumber": 1350,
			"text": "মূসা ইবন ইসমাঈল (রহঃ) .... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসুলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম রাত্রিতে তের রাকাত নামায আদায় করতেন এবং তিনি নবম রাকাতে বিতির পাঠ শেষ করতেন অথবা তিনি (আয়েশা) যেরূপ বর্ণনা করেছেন। অতঃপর তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বসাবস্থায় দুই রাকাত নামায আদায় করতেন। তিনি ফজরের দুই রাকাত সুন্নাত নামায আযান ও ইকামতের মধ্যবর্তী সময়ে আদায় করতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1351,
			"arabicnumber": 1351,
			"text": "মূসা ইবন ইসমাঈল (রহঃ) .... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ নবম রাকাতে তিনি বিতির সমাপ্ত করতেন। অতঃপর তিনি তাঁর পরিণত বয়সে সপ্তম রাকাতের সময় বিতির শেষ করতেন এবং এর পর বসে দুই রাকাত নামায আদায় করতেন। তিনি এই দুই রাকাতে রুকূর ইরাদায় দণ্ডায়মান হতেন এবং রুকূ ও সিজদা আদায় করতেন। (মুসলিম)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1352,
			"arabicnumber": 1352,
			"text": "ওয়াহাব ইবন বাকিয়্যা (রহঃ) .... সা’দ ইবন হিশাম (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি মদীনায় গমনের পর আয়েশা (রাঃ) এর খিদমতে উপস্থিত হয়ে তাঁকে জিজ্ঞাসা করি আমাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নামায সম্পর্কে কিছু বলুন। তখন তিনি বলেনঃ তিনি ইশার নামায জামাআতে আদায়ের পর বিছানায় গিয়ে ঘুমাতেন। অতঃপর মধ্যরাত্রিতে তিনি গাত্রোত্থান করে পেশাব-পায়খানা করার উদ্দেশ্যে গমন করতেন। অতঃপর পানি দ্বারা উযু করে মসজিদে গমন করতেন এবং সেখানে আট রাকাত নামায আদায় করতেন। সম্ভবতঃ তিনি এই নামাযের কিরাআত, রুকূ ও সিজদা আদায়ের মধ্যে সমতা রক্ষা করতেন। অতঃপর তিনি বিতিরের উদ্দেশ্যে আরো এক রাকাত আদায় করতেন এবং পরে বসাবস্থায় দুই রাকাত নামায আদায় করে কাত হয়ে শুয়ে থাকতেন। অতঃপর কখনো কখনো বিলাল (রাঃ) এসে তাঁকে নামাযের জন্য আহবান করতেন। আয়েশা (রাঃ) বলেনঃ প্রথমাবস্থায় আমি তাঁর এরূপ নিদ্রার জন্য শিকায়েত (অভিযোগ) করতাম, যেহেতু নামাযের জন্য পুনরায় তাঁকে ডাকতে হত। তিনি শেষ বয়স পর্যন্ত এরূপে নামায আদায় করেন। (নাসাঈ)। রাবী ইবন ঈসা বলেনঃ বিতিরের নামায আদায়ের পর সুবহে সাদিক হলে বিলাল (রাঃ) তাঁর নিকট উপস্থিত হয়ে নামাযের সংবাদ দিতেন। তখন তিনি ফজরের দুই রাকাত সুন্নাত আদায় করে মসজিদে গমন করতেন। অতঃপর দুই রাবী (উছমান ও ঈসা) একমত হয়ে বলেনঃ অতঃপর তিনি বলতেনঃ ইয়া আল্লাহ! আমার কলবে নূর দান করুন, আমার জিহ্বায় নূর দান করুন, আমার কানে নূর দান করুন, আমার উপরে ও নীচে নূর দান করুন, আমার অস্থিতে নূর দান প্রদান করুন। (মুসলিম, নাসাঈ, বুখারী)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1353,
			"arabicnumber": 1353,
			"text": "মুহাম্মাদ ইবন ঈসা (রহঃ) .... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একদা তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে রাত যাপন করেন। অতঃপর তিনি তাঁকে দেখতে পান যে, তিনি রাতে ঘুম থেকে উঠে মিসওয়াক শেষে উযু করে কুরআনের (সূরা আলে ইমরানের) এই আয়াত পাঠ করেছেনঃ নিশ্চয় আসমান ও যমীনের সৃষ্টির মধ্যে ... সূরার শেষ আয়াত পর্যন্ত। অতঃপর তিনি দণ্ডায়মান হয়ে সুদীর্ঘ কিরআত ও রুকূ-সিজদার মাধ্যমে দুই রাকাআত নাময আদায় করে ঘুমিয়ে পড়েন। অতঃপর তিনি এরূপে তিনবার ছয় রাকাত নামায আদায় করেন এবং প্রতি দুই রাকাত নামায আদায়ের পূর্বে তিনি মিসওয়াক করতঃ উযু করার পর এই আয়াতসমূহ পাঠ করেন। অতঃপর তিনি বিতিরের নামায আদায় করেন। রাবী উছমান (রহঃ) বলেনঃ তিনি বিতিরের নামায তিন রাকাত আদায় করতেন। অতঃপর যখন তাঁর নিকট মুয়াযযিন আসতেন তিনি ফজরের নামায আদায়ের জন্য মসজিদে গমন করেন এবং এ দুয়া পাঠ করেনঃ \"হে আল্লাহ্‌! আমার অন্তরে নূর দাও, আমার জবানে নূর দাও, আমার কানে নূর দাও, আমার চোখে নূর দাও, নূর দান করো আমার পিছন ও সম্মুখভাগে এবং আমার উপরে ও নিচে। হে আল্লাহ্‌! আমাকে পর্যাপ্ত নূর দান কর।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1354,
			"arabicnumber": 1354,
			"text": "১৩৫৪। ওয়াহব ইবন বাকিয়্যা (রহঃ) .... হুসায়েন হতেও অনুরূপ বর্ণিত হয়েছে। তিনি বলেনঃ (ইয়া আল্লাহ) আমার অস্থিতে নূর দান করুন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1355,
			"arabicnumber": 1355,
			"text": "মুহাম্মাদ ইবন বাশশার (রহঃ) ...... ফাদাল ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একদা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লামের নামায পাঠের পদ্ধতি আবলোকনের উদ্দেশ্যে রাতে তাঁর সাথে অবস্থান করি। তিনি রাতে উঠে উযু করার পর দুই রাকাত নামায আদায় করেন এবং তাঁর দাঁড়ানোর সময়টুকু তাঁর রুকূর অনুরূপ ছিল এবং তাঁর রুকূর পরিমাণ ছিল সিজদার অনুরূপ। অতঃপর তিনি ঘুমিয়ে পড়েন এবং পরে ঘুম থেকে উঠে মিসওয়াক ও উযু করতঃ সূরা আলে-ইমরানের এই পাঁচটি আয়াত তিলাওয়াতের করেনঃ “নিশ্চয়ই আসমান ও যমীনের সৃষ্টির মধ্যে এবং দিন-রাতের পরিক্রমার মধ্যে ...। তিনি অনুরূপভাবে দশ রাকাত নামায আদায় করেন এবং শেষ দুই রাকাতের সাথে এক রাকাত মিলিয়ে বিতির আদায় করেন। এসময় মুয়াজ্জিন আযান দেওয়া শেষ করলে তিনি দণ্ডায়মান হয়ে ফজরের দুই রাকাত সুন্নাত হাল্কাভাবে আদায় করেন। অতঃপর কিছুক্ষণ বসার পর জামাআতের সাথে ফজরের নামায আদায় করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1356,
			"arabicnumber": 1356,
			"text": "উছমান ইবন আবু শায়বা (রহঃ) .... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা রাতে আমি আমার খালা মায়মূনা (রাঃ) এর গৃহে অবস্থান করি। রাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম এসে জিজ্ঞাসা করেনঃ ছেলেটি কি নামায আদায় করেছে? তাঁরা বলেনঃ হ্যাঁ। তখন তিনি শয়ন করেন এবং রাত্রির কিছু অংশ আল্লাহ্‌র ইচ্ছায় আতিবাহিত হওয়ার পর তিনি ঘুম থেকে উঠে উযু করার পর পাঁচ অথবা সাত রাকাত নামায আদায় করেন; যার মধ্যে বিতিরও শামিল ছিল। ঐ সময় তিনি সর্বশেষ রাকাতে সালাম ফিরান।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1357,
			"arabicnumber": 1357,
			"text": "ইবনুল মুছান্না (রহঃ) ...... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা রাত্রিতে আমি আমার খালা মায়মূনা বিনতুল হারিছ (রাঃ) এর গৃহে অবস্থান করি। এ সময় নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশার নামায আদায়ের পর গৃহে আগমন করে চার রাকাত নামায আদায় করে ঘুমিয়ে পড়েন। অতঃপর তিনি ঘুম থেকে উঠে উযু করার পর নামাযের জন্য দণ্ডায়মান হন। এ সময় আমি তাঁর বাম পাশে দাঁড়াই। তিনি আমাকে ঘুরিয়ে ডান পাশে দাঁড় করান এবং পাঁচ রাকাত নামায আদায় করেন। অতঃপর পুনরায় নিদ্রা যান, ঐ সময় আমি তাঁর নাসিকা ধ্বনি শুনতে পাই। অতঃপর তিনি নিদ্রা হতে উঠে দুই রাকাত নামায (ফজরের সুন্নাত) আদায় করেন এবং মসজিদে গিয়ে ফজরের নামায আদায় করেন। (বুখারী, নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "কুতায়বা (রহঃ) .... সাঈদ ইবন যুবায়ের (রহঃ) হতে বর্ণিত। তিনি বলেনঃ একদা ইবন আব্বাস (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লামের এরূপ নামায পাঠের ঘটনা আমার নিকট বর্ণনা করেন। রাবী বলেনঃ তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) দুই দুই রাকাত করে মোট আট রাকাত নামায আদায় করেন। অতঃপর পাঁচ রাকাত বিতির আদায় করেন এবং এর মাঝখানে বসেননি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1359,
			"arabicnumber": 1359,
			"text": "আব্দুল আযীয ইবন ইয়াহহিয়া (রহঃ) ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ফজরের সুন্নাত সহ মোট তের রাকাত নামায আদায় করতেন। তিনি প্রথমত দুই দুই রাকাত করে ছয় রাকাত আদায় করতেন। অতঃপর তিনি বিতির নামায পাঁচ রাকাত আদায় করতেন এবং শেষ রাকাতে বসতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1360,
			"arabicnumber": 1360,
			"text": "কুতায়বা (রহঃ) .... উরওয়া (রহঃ) আয়েশা (রাঃ) হতে বর্ণনা করেছেন। তিনি বলেন, আয়েশা (রাঃ) তাঁকে এই মর্মে অবহিত করেন যে, নবী করীম সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ফজরের সুন্নাত সহ রাত্রিতে মোট তের রাকাত নামায আদায় করতেন। (মুসলিম)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1361,
			"arabicnumber": 1361,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1362,
			"arabicnumber": 1362,
			"text": "আহমাদ ইবন সালেহ (রহঃ) ..... আবদুল্লাহ ইবন আবু কায়েস (রহঃ) হতে বর্ণিত। তিনি বলেনঃ একদা আমি আয়েশা (রাঃ)-কে জিজ্ঞেস করি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম রাত্রিতে বিতির সহ কত রাকাত নামায আদায় করতেন? তিনি বলেনঃ তিনি চার রাকাত ও তিন রাকাত বিতির আদায় করতেন এবং কখনও ছয় রাকাআত ও তিন রাকাত ও বিতির আদায় করতেন এবং কখনও আট রাকাত আদায় করতেন এবং (কোন কোন সময়) তিনি মোট তের রাকাত নামায আদায় করতেন। তবে সাধারণতঃ তিনি সাত রাকাতের কম এবং তের রাকাতের অধিক নামায আদায় করতেন না। তিনি ফজরের সুন্নাত কোন সময় ত্যাগ করতেন না – এটা রাবী আহমদের বর্ণনা। রাবী আহমাদের বর্ণনায় ছয় এবং তিন রাকাতের কথা উল্লেখ নাই।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1363,
			"arabicnumber": 1363,
			"text": "মুআম্মাল ইবন হিশাম (রহঃ) ..... আসওয়াদ ইবন ইয়াযীদ (রহঃ) হতে বর্ণিত। তিনি আয়েশা (রাঃ) এর খিদমতে উপস্থিত হয়ে তাঁকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লামের রাত্রিকালীন নামায পাঠ সম্পর্কে জিজ্ঞাসা করেন। তিনি বলেন, তিনি রাত্রিতে তের রাকাত নামায আদায় করতেন। অতঃপর শেষ বয়সে তিনি দুই রাকাত কম করে মোট এগার রাকাত আদায় করতেন এবং তাঁর ইন্তিকালের পূর্বে তিনি নয় রাকাত নামায আদায় করতেন এবং তাঁর রাত্রির শেষ নামায ছিল বিতিরের নামায। (তিরমিযী, নাসাঈ, মুসলিম)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1364,
			"arabicnumber": 1364,
			"text": "আব্দুল মালিক ইবন শুআইব (রহঃ) ...... মাখরামা ইবন সুলায়মান (রহঃ) হতে বর্ণিত। তিনি বলেনঃ তাঁকে ইবন আব্বাস (রাঃ) এর আযাদকৃত গোলাম কুরাইব আবহিত করেন যে, একদা তিনি তাঁকে জিজ্ঞাসা করেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম রাত্রিতে কিরূপ নামায আদায় করতেন? তখন তিনি বলেনঃ একদা রাত্রিতে আমি তাঁর সাথে অবস্থান করি, ঐ সময় তিনি মায়মূনা (রাঃ) এর গৃহে ছিলেন। অতঃপর তিনি নিদ্রা যান এবং রাতের এক-তৃতীয়াংশে অথবা অর্ধেক অতিক্রান্ত হওয়ার পর তিনি গাত্রোত্থান করে পানির বদনায় কাছে গিয়ে উযু করেন এবং আমিও তাঁর সাথে উযু করি। অতঃপর তিনি নামাযে দণ্ডায়মান হলে আমি তাঁর বাম পাশে গিয়ে দাঁড়লে তিনি আমাকে টেনে ডান পাশে নিয়ে আসেন। পরে তিনি তাঁর হস্ত মোবারক আমার মস্তকের উপর স্থাপন করেন, তিনি আমার কান মলে আমাকে সতর্ক করেন। এই সময় তিনি হাল্কাভাবে দুই রাকাত নামায আদায় করেন। আমার মনে হয় যে, তিনি প্রতি রাকাতে সূরা ফাতিহা পাঠ করেন। অতঃপর তিনি সালাম ফিরান এবং পরে বিতির সহ এগার রাকাত নামায আদায় করে ঘুমিয়ে পড়েন। অতঃপর বিলাল (রাঃ) এসে আস-সালাতু ইয়া রাসুলাল্লাহ বলায় তিনি উযু করে দাঁড়িয়ে দুই রাকাত নামায (ফজরের সুন্নাত) আদায় করেন, পরে মসজিদে গিয়ে লোকদের সাথে জামাআতে ফজরের নামায আদায় করেন। (বুখারী, মুসলিম, তিরমিযী, নাসাঈ, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1365,
			"arabicnumber": 1365,
			"text": "নূহ ইবন হাবীব (রহঃ) ..... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একদা রাত্রিতে আমি আমার খালা মায়মূনা (রাঃ) এর গৃহে অবস্থান করি। এই সময় নবী করীম সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম রাত্রিতে উঠে নামাযের জন্য দণ্ডায়মান হন এবং তিনি ফজরের দুই রাকাত সুন্নাত সহ মোট তের রাকাত নামায আদায় করেন। আমি অনুমান করলাম যে, তাঁর প্রতি রাকাতে দাঁড়ানোর সময় ছিল “সূরা-মুযযাম্মিল” পাঠের সময়ের অনুরূপ। রাবী নূহ তাঁর বর্ণনায় দুই রাকাত ফজরের সুন্নাত নামাযের কথা উল্লেখ করেন নাই। (নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1366,
			"arabicnumber": 1366,
			"text": "আল-কানবী (রহঃ) ..... যায়দ ইবন খালিদ আল-জুহনী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লামের প্রতি নজর রাখব তিনি রাতের নামায কিভাবে পড়েন। আমি আমার মস্তক দরজা বা তাবুর চৌকাঠের উপর রেখে শুয়ে থাকলাম। তিনি হালকাভাবে দুই রাকাত নামায আদায় করার পর আরো দুই রাকাত নামায অতি দীর্ঘ করে পড়েন। অতঃপর তিনি আরো দুই রাকাত নামায আদায় করেন, যা পূর্বের দুই রাকাত অপেক্ষা কম দীর্ঘ ছিল। পরে তিনি এর চাইতে আরো কম দীর্ঘ দুই রাকাত নামায আদায় করেন এবং পরে আরো দুই রাকাত নামায আদায় করেন, যা পূর্বের নামাযের চাইতে আরো কম দীর্ঘ ছিল। অতঃপর তিনি পূর্বের চাইতে কম দীর্ঘ করে আরো দুই রাকাত নামায আদায় করেন এবং তাঁর সাথে এক রাকাত মিলিয়ে বিতির সহ মোট তের রাকাত আদায় করেন। (মুসলিম, তিরমিযী, নাসাঈ, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1367,
			"arabicnumber": 1367,
			"text": "আল-কানবী (রহঃ) ...... ইবন আব্বাস (রাঃ) এর আযাদকৃত গোলাম কুরায়েব (রহঃ) হতে বর্ণিত। তিনি বলেনঃ আবদুল্লাহ ইবন আব্বাস (রাঃ) তাঁর নিকট বর্ণনা করেন যে, এক রাতে তিনি তাঁর খালা এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লামের স্ত্রী মায়মূনা (রাঃ) এর গৃহে আবস্থান করেন। তিনি বলেনঃ আমি বালিশের পাশে মাথা রেখে শয়ন করি এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ও তাঁর পত্নি বালিশের লম্বা ভাগের উপর মাথা রেখে শয়ন করেন। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম নিদ্রাভিভূত হয়ে পড়েন। তিনি রাতের অর্ধেক বা এর চাইতে একটু কম বা বেশী সময়ের পর জাগ্রত হয়ে হাতের সাহায্যে তাঁর চক্ষু রগড়াতে থাকেন এবং সূরা আলে ইমরানের শেষ দশ আয়াত তিলাওয়াত করেন। অতঃপর আমিও উঠে তাঁর মত উযু করে তাঁর পাশে গিয়ে দাঁড়াই। এ সময় তিনি তাঁর ডান হাত দ্বারা আমার কান স্পর্শ করেন। অতঃপর তিনি দুই রাকাত, পরে দুই রাকাত, আরো পরে দুই রাকাত, পুনঃ দুই রাকাত, আবার দুই রাকাত এবং সবশেষে আরো দুই রাকাত নামায আদায় করেন। রাবী আল-কানবী বলেনঃ এরূপ তিনি ছয় বার নামায আদায় করেন। অতঃপর তিনি শেষ রাকাতের সাথে এক রাকাত মিলিয়ে বিতির আদায় করে শুয়ে পড়েন। অবশেষে মুআযযিন এসে তাঁকে নামাযের খবর দিলে তিনি হালকাভাবে দুই রাকাত নামায (ফজরের সুন্নাত) আদায় করে গৃহ হতে বের হয়ে ফজরের ফরয নামায (মসজিদে) জামাআতের সাথে আদায় করেন। (বুখারী, মুসলিম, তিরমিযী, নাসাঈ, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1368,
			"arabicnumber": 1368,
			"text": "কুতায়বা (রহঃ) ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ইরশাদ করেছেনঃ তোমরা সাধ্যানুযায়ী আমল কর। কেননা আল্লাহ তাআলা তোমাদের কোন আমলকে বন্ধ করেন না, যতক্ষণ না তোমারা নিজেরাই তা বন্ধ কর। কেননা আল্লাহ তাআলার নিকট ঐ আমলই অধিক পছন্দনীয় যা নিয়মিত আদায় করা হয়ে থাকে, যদিও পরিমানে তা কম হয়। তিনি যখন কোন আমল শুরু করতেন, তখন তা নিয়মিতভাবে আদায় করতেন। (বুখারী, মুসলিম, নাসাঈ, ইবন মাজা)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1369,
			"arabicnumber": 1369,
			"text": "উবায়দুল্লাহ ইবন সাদ (রহঃ) ..... আয়েশা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ সাল্লাল্লাহু আলইহি ওয়াসাল্লাম উছমান ইবন মাযউন (রাঃ)-কে ডেকে পাঠান। তিনি আগমন করলে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হে উছমান। তুমি আমার সুন্নাতের বিরোধিতা করছ? তিনি আল্লাহ্‌র শপথ করে বলেনঃ ইয়া রাসূলাল্লাহ। না, বরং আমি আপনার সুন্নাতের অন্বেষণকারী। তখন তিনি বলেনঃ আমি ঘুমাই এবং নামাযও আদায় করি, রোযা রাখি এবং ইফতারও করি, এবং স্ত্রীও গ্রহণ করি। হে উছমান! তুমি আল্লাহকে ভয় কর। তোমার প্রতি তোমার বিবির হক আছে, তোমার মেহমানের হক আছে, তোমার নফসের হক আছে। অতএব তুমি রোযাও রাখ এবং রোযাহীনও থাক, নামায আদায় কর এবং নিদ্রাও যাও।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "উছমান ইবন আবু শায়বা (রহঃ) ..... আলকামা (রহঃ) হতে বর্ণিত। তিনি বলেনঃ একদা আয়েশা (রাঃ)-কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লামের আমল সম্পর্কে জিজ্ঞাস করি যে, তিনি বিশেষ কোন দিনে নির্ধারিত কোন ইবাদত করতেন কি? তখন জবাবে তিনি বলেন, না, বরং তিনি যা আমল করতেন, তা সর্বদাই করতেন। আর তিনি যা করতে সক্ষম ছিলেন, তোমরা সেরূপ করতে কিরূপ সক্ষম? (বুখারী, মুসলিম, তিরমিযী)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 121
			}
		}
	]
}