{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"14": "The Book of I'tikaf"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2780,
			"arabicnumber": "1171.01",
			"text": "Bize Muhammed b. Mihrân Er-Râzi rivayet etti. (Dediki): Bize Hatim b. İsmail, Musa b. Ukbe'den, o da Nâfi'den, o da İbni Ömer (Radiyallahü anhüma)'dan naklen rivayet ettiki, Nebi (Sallallahu Aleyhi ve Sellem) Ramazan'in son on gününde î'tikâf yaparmış",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2781,
			"arabicnumber": "1171.02",
			"text": "Bana Ebu't-Tâhir rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus b. Yezîd haber verdi. Ona da Abdullah b. Ömer (Radiyallayü anhüma)'dan naklen Nâfi' rivayet etmiş ki Resûlûllah (Sallallahu Aleyhi ve Sellem) Ramazan'ın son on gününde î'tikâfa girermiş. Nâfi'i demiş ki: «Bana, Abdullah (Radiyallahû anh), Resûlullah (Sallallahu Aleyhi ve Sellem)'in mescidde î'tikâf yaptığı yeri gösterdi.» İzah 1172 de",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2782,
			"arabicnumber": "1172.01",
			"text": "Bize Sehl b. Osman rivayet etti. (Dediki): Bize Ukbetü'bnü Hâlid Es-Sekûni, Ubeydullah b. Ömer'den, o da Abdurrahman b, Kaasim'den, o da babasından, o da Âişe (Radiyallahû anha)'dan naklen rivayet etti. Âişe: «Resûlullah (Sallallahu Aleyhi ve Sellem) Ramazan'ın son on gününde î'tikâfa girerdi.» demiş",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2783,
			"arabicnumber": "1172.02",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Ebû Muâviye haber verdi. H. Bize Sehl b. Osman da rivayet etti. (Dediki): Bize Hafs b. Giyâs haber verdi. Bu ravilerin ikisi de Hişâm'dan rivayet etmişlerdir. H. Bize Ebû Bekir b. Ebî Şeybe ile Ebû Kureyb dahi rivayet ettiler. Bu lâfız onlarındır. (Dedilerki): Bize İbni Numeyr, Hişâm b. Urve'den, o da babasından, o da Âişe (Radiyallahû anha)'dan naklen rivayet etti. Âişe: «Resûlullah (Sallallahu Aleyhi ve Sellem) Ramazanın son on gününde i'tikafa girerdi.» demiş",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2784,
			"arabicnumber": "1172.03",
			"text": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Leys, Ukayl'den, o da Zührî'den, o da Urve'den, o da Âişe (Radiyalîahû anha)'dan naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) Allah Azze ve Celle ruhunu kabzedinceye kadar hep Ramazan'ın son on gününde î'tikâfa girmiş. Onu vefatından sonra zevceleri î'tîkâf yapmışlar. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2785,
			"arabicnumber": "1173.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Ebû Muâviye, Yahya b. Saîd'den, o da Amra'dan, o da Âişe (Radiyallahû anha)'dan naklen haber verdi. Âişe şöyle demiş: «Resûlullah (Sallallahu Aleyhi ve Sellem) î'tikâfa girmek istediği vakit sabah namazını kılar, sonra î'tikâf yerine girerdi. (Bîr defa) Ramazanın son on gününde î'tikâfa girmek istedi de çadırının kurulmasını emir buyurdu ve kendisine çadır kuruldu. Müteakiben Zeyneb de çadırının kurulmasını emretti, ona da çadır kuruldu. Nebi (Sallallahu Aleyhi ve Sellem)'in zevcelerinden bir başkası da çadırının kurulmasını emretti. Onun çadırı da kuruldu. Resûlullah (Sallallahu Aleyhi ve Sellem) sabah namazını kılınca baktı ki çadırlar kurulmuş : «(Acaba bu yaptıklarınızla) hayır mı kastediyorsunuz?» buyurdu ve derhal çadırının sökülmesini emretti, çadır söküldü. Artık o ramazan ayında îtikâfı terketti de iaa Şevval ayının ilk on gününde î'tikafa girdi",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2786,
			"arabicnumber": "1173.02",
			"text": "{…} Bize, bu hadîsi İbni Ebî Ömer de rivayet etti. (Dediki): Bize Süfyân rivayet etti. H. Bana, Amr b, Sevvâd da rivayet etti. (Dediki): Bize îbni Vehb haber verdi. (Dediki): Bize Amr b. Haris haber verdi. H. Bana Muhammed b. Râfi* dahî rivayet etti, (Dediki): Bize Ebû Ahmed rivayet etti. (Dediki): Bize Süfyân rivayet etti. H. Bana Selemetü'bnü Şebîb dahî rivayet etti. (Dediki): Bize Ebu'l-Muğîra rivayet etti. (Dediki): Bize Evzaî rivayet eyledi. H. Bana Züheyr b. Harb da rivayet etti. (Dediki): Bize Ya'kub b. İbrahim b. Sa'd rivayet etti. (Dediki): Bize babam, İbni İshâk'dan rivâyet etti. Bu râvilerin hepsi Yahya b. Said'den, o da Amra'dan, o da Aişe (Radiyallahû anha) 'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den Ebû Muaviye hadîsi mânâsı ile rivayette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2787,
			"arabicnumber": "1174",
			"text": "Bize İshak b. İbrahim El-Hanzali ile İbni Ebî Ömer hep birden İbni Uyeyne'den rivayet ettiler. İshâk (Dediki); Bize Süfyân b. Uyeyne, Ebû Ya'fûr'dan, o da Müslim b. Subeyh'den, o da Mesrûk'dan, o da Âişe {Radiyallahu anha)'dan naklen haber verdi. Aişe şöyle demiş: . «Ramazan'ın son on günü girince Resûlullah (Sallallahu Aleyhi ve Sellem) geceleri ihya eder, ailesini uyandırır, ibadete karşı daha ciddiyet gösterir ve paçaları sıvardı.» İzah 1175 te",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2788,
			"arabicnumber": "1175",
			"text": "Bize Kuteybetü'bnü Saîd ile Ebû Kâmil-i Cahderi ikisi birden Abdülvâhid b. Ziyâd'dan rivayet ettiler. Kuteybe (Dediki): Bize Abdülvâhid, Hasen b. Ubeydillah'dan rivayet etti. (Demişki): Ben, İbrahim'i şunu söylerken işittim : Ben, Esved b. Yezîd'i şöyle derken işittim: Âişe (Radtyallahu anha) : «Resûlullah (Sallallahu Aleyhi ve Sellem) Ramazan'ın son on gününde, başka zamanlarda ibâdet hususunda göstermediği cehd-u gayreti gösterirdi.» dedi",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2789,
			"arabicnumber": "1176.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Ebû Kureyb ve İshâk rivayet ettiler. îshâk: (Ahberanâ), öiekîler: (Haddenenâ) tâbirlerini kuliandılar. (Dedilerki): Bize Ebû Muâviye, A'meş'den, o da İbrahim'den, o da Esved'den, o da Âişe {Radiyallahû anha)'dan naklen rivayet etti. Aişe : «Ben, Resûlullah (Sallallahu Aleyhi ve Sellem)'in on günlerde hiç oruç tuttuğunu görmedim.» demiş",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2790,
			"arabicnumber": "1176.02",
			"text": "Bana Ebû Bekir b. Nâfi' El-Abdî rivayet etti. (Dediki): Bize Abdurrahman rivayet etti. (Dediki): Bize Süfyan, A'meş'den, o da İbrahim'den, o da Esved'den, o da Âişe (Radiyallahû anfıa)'dan naklen rivayet ettiki, Nebi (Sallallahu Aleyhi ve Sellenı), Zi*l-Hîece'nin ilk on gününde oruç tutmamış",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 11
			}
		}
	]
}