{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 388,
			"arabicnumber": "154.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3398,
			"arabicnumber": "1400.01",
			"text": "Bize Yahya b. Yahya Et-Temîmi ile Ebu Bekir b. Ebi Şeybe ve Muhammed b. Alâ' EI-Hemdânî hep birden Ebu Muâviye'den rivayet ettiler. Lâfız Yahya'nındır. (Dedilerki): Bize Ebu Muâviye, A'meş'ten, o da İbrahim'den, o da A!kame'den naklen haber verdi. Alkame şöyle demiş: Abdullah ile birlikte Mina'da yürüyordum. Derken ona Osman rastladı ve onunla konuşmaya başladı. Osman ona : «Yâ Ebâ Abdirrahman! Seni genç bir hanımla evlendirsek ya. Olur ki sana geçmiş zamanından bir kısmını hatırlatır, dedi. Abdullah şu cevâbı verdi: — Sen böyle dedinse Resulullah (Sallallahu Aleyhi ve Sellem) de bize: «Ey gençler cemâati! Sizden kimin evlenmeye gücü yetiyorsa hemen evlensin. Zira evlilik gözü (haramdan) daha yumdurucu, namusu daha koruyucudur. Kimin gücü yetmiyorsa o da oruç tutmayı iltizam etsin. Çünkü oruç onun için hayaların! kesmek (mesabesinde) dîr.» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3399,
			"arabicnumber": "1400.02",
			"text": "Bize Osman b. Eli Şeybe rivayet etti. (Dediki): Bize Cerîr, Â'meş'den, o da İbrahim'den, o da Aîkame'den naklen rivayet etti. Alkame şöyle demiş: Ben Abdullah b. Mes'ud ile Mina'da yürüyordum birden ona Osman b. Affan rastladı. Ve : — Beri gel ya Ebâ Abdirrahman! diyerek onu tenhaya çekti. Abdullah onun bir haceti olmadığını görünce bana : — Gel ya Alkame! dedi. Ben de gittim. Osman ona : — Seni bakire bir kızla evlendirsek ya ey Ebâ Abdirrahman! Olurki, nefsinden kaybettiğin bazı şeyleri sana döner, dedi. Bunun üzerine Abdullah : — Sen böyle dedinse... diyerek Ebu Muâviye hadîsi gibi anlattı",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3400,
			"arabicnumber": "1400.03",
			"text": "Bize Ebu Bekir b. Ebî Şeybe ile Ebu Kureyb rivayet ettiler. (Dedilerki): Bize Ebu Muaviye, Â'meş'den, o. da Umâratu'bnu Umeyr'den, o da Abdurrahman b. Yezîd'den, o da Abdullah'dan naklen rivayet etti. Abdullah şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) bize: «Ey gençler cemâati! Sizden kimin evlenmeye gücü yeterse hemen evlensin. Zira evlilik gözü (haramdan) daha yumdurucu, namusu daha koruyucudur. Kimin gücü yetmezse o da oruç tutmayı iltizam etsin. Çünkü oruç onun için hayalarını kesmek (mesabesinde) dir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3401,
			"arabicnumber": "1400.04",
			"text": "Bize Osman b. Ebî Şeybe rivayet etti. (Dediki): Bize Cerîr, Â'meş'den, o da Umaratu'bnu Umeyr'den, o da Abdurrahman b. Yezîd'den naklen rivayet etti. Abdurrahman şöyle demiş : Ben, amcam Alkame ve Esved, Abdullah b. Mes'ud'un yanına girdik. Ben o gün (henüz) gençdim. İbni Mes'ud bir hadîs söyledi ki, zannederim onu benîm için rivayet etti. «ResuluIIah (Sallallahu Aleyhi ve Sellem) şöyle buyurdular dedi.» Râvi Ebu Muâviye hadîsi gibi rivayette bulundu. Şunu da ziyâde etti: «Abdurrahman: Artık durmayıp evlendim, dedi.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3402,
			"arabicnumber": "1400.05",
			"text": "{…} Bana Abdullah b. Saîd El-Eşecc rivayet etti. (Dediki): Bize Vekî rivayet etti. (Dediki): Bize Â'meş, Umâretu'bnu Umeyr'den, o da Abdurrahman h. Yezid'den, o da Abdullah'daıı naklen rivayet etti. Abdullah şöyle demiş: «îbni Mes'ud'un yanına girdik. Ben girenlerin en genci idim...» Râvi yukardakilerin hadîsi gibi rivayette buîunmuş. Fakat: «Artık durmayıp evlendim» cümlesini söylememiştir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3403,
			"arabicnumber": "1401",
			"text": "(Bana Ebû Bekir b. Nafir El-Abd' rivâyet etti. ki): Bize Beliz rivâyet etti. ki): Bize Hammâd b. Seleme, Sâbit'den, o da Enes'den naklen rivâyet eyledi ki, Peygamber (sallallahü aleyhi ve sellem)’in ashabından birkaç kişi' Nebiyyi (sallallahü aleyhi ve sellem)'in zevcelerine onun gizlice yaptığı ibâdetini sormuşlar. Neticede bunlardan biri: Ben kadınlarla evlenmeyeceğim; diğeri: Ben et yemeyeceğim; öteki: Ben döşekte uyumayacağım, demiş. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) Allah'a hamdû sena ederek: kimselere ne oluyor ki, şöyle şöyle dediler. Ama ben hem namaz kılar, hem uyurum. Hem oruç tutar, hem tutmam. Kadınlarla da evlenirim. imdi kim benim sünnetimden yüz çevirirse benden değildir.» buyurmuşlar. hadîsi Buhârî «Nikâh» bahsinde tahriç etmiştir. Onun rivâyeti buradakinden daha tafsilâtlı olup şöyledir: kişi evzâcı tâhirâlın evlerine gelerek Peygamber (sallallahü aleyhi ve sellem)’in (gizli) ibâdetini sormuşlar. Kendilerine haber verilince herhalde bunu az görerek: Biz nerede, Peygamber (sallallahü aleyhi ve sellem) nerede! Allah onun gelmiş geçmiş bütün (mütesavver) günahlarını af etmiştir demişler. Bunlardan biri: Bana gelince, ben geceleri ilel ebed namaz kılacağım; diğeri ben de ömrüm boyunca oruç tutacağım, orucu hiç bırakmayacağım; öteki, ben de kadınlardan uzak kalacağım. Ve ebediy-yen evlenmiyeceğim, demiş. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) gelerek: şöyle diyenler sizler misiniz? Dikkat edin. Vallahi sizin Allah'dan en ziyade korkan ve sakınanınız benim. Lâkın ben hem oruç tutar, hem tutmam. Hem namaz kılar, hem uyurum. Kadınlarla da evlenirim, imdi her kim benim sünnetimden yüz çevirirse benden değildir.» buyurmuşlar. rivâyetinde «nefer» yerine «raht» buyrulmuştur. Bu iki kelime arasında mânâ itibariyle cüz'i fark vardır. Üçden ona; Nefer: Üçden dokuza kadar kimselere denilir: Bu kelimelerin ikisi de birer ismi cemi olup müfretleri yoktur. b. El-Müseyyeb'in rnürsel olarak rivâyet ettiği bir hadîse göre Peygamber (sallallahü aleyhi ve sellem)’in ibâdetini sormaya gelenler Ali b. Ebî Tâlib, Abdullah b. Amr bir. Âsve Osman b. Maz'ûn (radıyallahü anh) Hazerâtıdır. Bu zevat Peygamber (sallallahü aleyhi ve sellem)’in evinde gizlice yaptığı ibâdeti az bulunca Allah'ın affû mağfiretine nail olan bir zâtın fazla ibâdete ihtiyacı olmadığı kanâatine varmışlarsa da Resûl-i Ekrem (sallallahü aleyhi ve sellem): sîzin Allah'dan en ziyade korkan ve sakınanızım.» buyurarak bunu reddetmiş, kendisinin ibâdette son derece dikkat ve şiddet gösterdiğini ve Allah korkusunun kendisinde herkesten fazla olduğunu bildirmiştir. kim benim sünnetimden yüz çevirirse benden değildir» cümlesinden murâd, sünnetimden yüz çeviren benim yolumda değildir, demektir. Yani buradaki sünnetten murâd tarikat ve yoldur. Bu da farz, nafile bütün amellere ve akaide şâmildir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3404,
			"arabicnumber": "1402.01",
			"text": "Bize Ebu Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdullah b. Mübarek rivayet etti. H. Bize Ebu Kureyb Muhammed b. Alâ' dahi rivayet etti. Lâfız onundur. (Dediki): Bize ibni Mübarek, Ma'mer'den, o da Zuhri'den, o da Saîd b. El-Müseyyeb'den. o da Sa'd b. Ebî Vakkâas'dan naklen haber verdi. Sâ'd şöyle demiş: «Resulullah (Sallallahu Aleyhi ve Sellem) Osman b. Maz'un'un tebettülünü (bekârlığı) kabul etmedi. Şayet ona izin verseydi biz de hayalarımızı çıkarırdık.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3405,
			"arabicnumber": "1402.02",
			"text": "Bana Ebu Imrân Muhammed b. Câ'fer b. Ziyâd rivayet etti. (Dediki): Bize ibrahim b. Sa'd, ibni Şihâb Zühri'den, o da Saîd b. El-Müseyyeb'den naklen rivayet etti. Sâîd şöyle demiş: Ben Sa'd'ı: «Osman b. Mazun'un bekârlığı kabul edilmedi; şayet ona izin verilseydi biz de hayalarımızı çıkarırdık.» derken işittim",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3406,
			"arabicnumber": "1402.03",
			"text": "Bize Muhammed b. Râîi' rivayet etti. (Dediki): Bize Huceyn b. Müsennâ rivayet elti. (Dediki): Bize Leys, Ukayl'den, o da ibni Şihab'dan naklen rivayet ettiki. ibni Şihab şöyle demiş: Bana Saîd b, El-Müscyyeb haber verdi. Kendisi Sa'd b. Ebî Vakkâa'ı şunu söylerken işitmiş : «Osman b. Mazun bekâr kalmak istedi de Resulullah (Sallalluhu Aleyhi ve Sellem) kendisini (bundan) nehi buyurdu. Şayet ona bekârlığı tecviz etseydi biz de hayalarımızı çıkarırdık.» izah: Bu hadisi Buhârî, Tirmizî, Nesâî ve ibni Mâce «Nikâh» bahsinde muhtelif râvilerden tahric etmişlerdir. Tebettul esas itibariyle inkıta' mânâsına gelir. Hz, Meryem ile Fâtıme (Radiyallahu anha)'ya «Betul» denilir. Bunun sebebi dîn, fazilet ve âhirete rağbet hususunda zamanlarındaki kadınlardan mümtaz ve münkatı' olmalarıdır. Ulemânın beyânına göre' bu hadisteki tebettul'den murâd sırf Allah'ı ibâdet maksadı ile kadınlardan alâkayı keserek bekâr kalmaktır. Taberî : «Tebettul dünya ile, dünya şehvetlerini terk ederek kendini Alîah Teâlâ'nın ibâdetlerine vermektir.» diyor. Hz. Sa'd'ın: «Şayet ona izin verseydi biz de hayalarımızı çıkarırdık sözünden murâd bekârlığa ve sâir dünya lezzetlerinden alâkayı kesmeye izin verilseydi, biz de şehvetimizi kırmak için hayalarımızı çıkartır, şu suretle bekârlık bize âsân olurdu demektir. Bekârlık hıristiyanlıkta meşru' idi. Resulullah (Sallallahu Aleyhi ve Sellem) Efendimiz neslin çoğalması ve cihâd'ın devam edebilmesi için ümmetini bundan nehiy buyurmuştur. insanın hayalarını çıkarmak ve tenasül uzvunu kesmek bilittifak yasak'tır. Binâenaleyh bugün moda haline getirilmeye çalışılan umumî doğum kontrolü de dînen yasaktır. Çünkü bunun neticesi müslümanlar azalacaktır. Halbuki dînen müslümanların azalması değil, çoğaltılmaya çalışılması emir buyrulmuştur. Gerçi islâm hukukunda «az!» denilen bir fiilin meşruiyyetinden bahsolunmyştur. Fakat bu iş bâzı hallerde karı ile kocanın anlaşmasına bırakılmış bir istisnadır. Tamimine müsaade yoktur. Azl: Çocuk yapmamak için karı-koca anlaşarak erkeğin menisini dışarıya atmaktır. îbni Abdilberr'in «El-istîab» nâm eserinde' Aişe binti' Kudâme'den rivayet ettiği bîr hadisde şöyle denilmektedir: «Osman b. Mazun: Yâ Resulallah! Bize gazalarda bekârlık güç geliyor. Bana müsaade buyurur musun hayalarımı çıkartayım yâ Resulaliah? demiş. Resulullah (Sallallahu Aleyhi ve Sellem) : — Hayır îbni Mazunn! Sen oruç tutmalısın. Çünkü oruç şehveti keser; buyurmuş.» Rivayete göre Osman b. Mazunn. Hz. Ali ve Ebu Zer (Radiyallahu anhum) hayalarını çıkararak bekâr yaşamak istemişler. Fakat Resulullah (Sallallahu Aleyhi ve Sellem) kendilerini bundan men etmiştir. Bütün bunlar gösteriyor ki, dinimiz müslumanların azalmasını hedef tutan hiç bir vasıtayı meşru' görmemiştir. Gerçi: «ikiyüz tarihinden sonra sizin en hayırlınız hafif ve ailesiyle çoluk çocuğu olmayan bekârlarımzdır» mealinde bir hadîs rivayet olunursa da bu hadîs uydurmadır. Binâenaleyh ona asla iltifat olunamaz. Hz. Huzeyfe'nin üzerinden söylenen: «Sene yüz, yüzelli oldu mu sizden birinizin bir köpek eniği terbiye etmesi, çocuk terbiye etmesinden daha hayırlıdır.» sözü de bu kabil uydurmalardandır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3407,
			"arabicnumber": "1403.01",
			"text": "Bize Amr b. Ali rivayet etti. (Dediki): Bize Abdul'â'lâ rivâyct. ctti. (Dediki): Bize Hişam b. Ebî Abdillâh, Ebu'z-Zübeyr'den, o da Câbîr'den naklen rivayet eyledi ki: Resulullah (Sallallahu Aleyhi ve Sellem) bir kadın görmüş. Müteakiben zevcesi Zeyneb'e gelmiş. Zeyneb kendine ait bir deri ovuyormuş. Resulullah (Sallallahu Aleyhi've Sellem) hemen hacetini bitirmiş. Sonra Ashabının yanına çıkarak: «Şüphesiz ki kadın şeytan suretinde gelir, şeytan suretinde gider. Biriniz bir kadın gördü mü hemen ailesine gelsin. Çünkü bu onun nefsinde olan şeyi giderir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3408,
			"arabicnumber": "1403.02",
			"text": "{…} Bize Züheyr b. Harb rivayet etti. (Dediki): Bize Abdüssanıed Abdilvâris rivayet etti. (Dediki): Bize Harb b. Ebi'l-Âliye rivayet eyIedi. (Dediki): Bize Ebu'z-Zübeyr, Câbir b. Abdillâh'dan naklen rivayet ettiki, Nebi (Sallallahu Aleyhi ve Sellenı) bir kadın görmüş. Râvi yukarda hadîsin mislini rivayet etmiş. Yalmz: «Zevcesi Zeyneb'e gelmiş. Zeyneb bir deri ovuyornıuş» demiş «Şeytan suretinde gider» cümlesini söylememiştir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3409,
			"arabicnumber": "1403.03",
			"text": "Bana Selemetu'bnü Şebîbb rivayet etti. (Dediki): Bize Hasan b. Â'yen rivayet etti. (Dediki): Bize Ma'kıl, Ebu'z-Zübeyr'den naklen rivayet eyledi. (Demişki): Câbir şunu söyledi: Ben Nebi (Sallallahu Aleyhi ve Sellemj'i: «Birinizin bir kadın hoşuna gider de gönlüne girerse, hemen kendi karısına giderek onunla cima' etsin. Çünkü bu nefsindeki şeyi giderir.» buyururken işittim)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3410,
			"arabicnumber": "1404.01",
			"text": "Bize Muhammed b. Abdillah b. Numeyr El-Hemdânî rivayet etti. (Dediki): Bize babam ile Veki' ve İbnu Bisr, İsmail'den, o da Kays'dan naklen rivayet ettiler. Kays şöyle demiş: Ben Abdullah'ı şunu söylerken işittim: «Resulullah (Sallallahu Aleyhi ve Sellem) ile birlikte gaza ediyorduk. Kadınlarımız yoktu. Bu sebeble hayalarımızı çıkarsak mı ki dedik. Fakat Resulullah (Sallallahu Aleyhi ve Sellem) bizi bundan nehyetti. Sonra bize elbise mukabilinde muayyen bir zamaııa kadar bir kadınla evlenmemiz için ruhsat verdi. Bundan sonra Abdullah: «Ey îman edenler! Allah'ın size helâl kıldığı şeylerin iyi, hoş olanlarını (kendinize) haram kılmayın. Hakka da tecavüz etmeyin. Çünkü Allah mütecavizleri sevmez.» [ Maide 87 ] âyet-i kerîmesini okudu.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3411,
			"arabicnumber": "1404.02",
			"text": "{…} Bize Osman bin Ebî Şeybe rivayet etti. (Dediki); Bize Cerîr, İsmail b. Ebî Hâlid'den bu isnâdla bu hadîsin mislini rivayet etti. Ve: «Sonra bize şu âyeti okudu» dedi; «Abdullah okudu» demedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3412,
			"arabicnumber": "1404.03",
			"text": "Bize E!îu Bekir b. Ebu Şeybe rivayet etti. (Dediki): Bize Vekî' İsmail'den bu isnâdla rivayetle bulundu. «Biz genç olduğumuz haldeydik ve yâ Resulallah! Hayalarımızı çıkaralım mı diye sorduk?» dedi. «Gaza ediyorduk demedi.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3413,
			"arabicnumber": "1405.01",
			"text": "Bize Muhammed b. Beşşâr rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Şu'be, Amr b. Dinar'dan, rivayet eyledi. (Demişki): Ben Hasan b. Muhammed'i, Câbir b. Abdillah ile Selemetü'bnü Ekva'dan naklen rivayet ederken dinledim. Şöyle demişler: «Resulullah (Sallallahu Aleyhi ve Sellem)'in dellâlı yanımıza çıkarak: Resulullah (Sallallahu Aleyhi ve Sellem) istimta' yâni kadınlarla mut'a nikâhı yapmamız için size izin vermiştir, dedi.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3414,
			"arabicnumber": "1405.02",
			"text": "Bana Ümeyyetu'bnu Bimtâm El-Ayşî rivayet etti. (Dediki): Bize Yezîd yâni ibni Zurey' rivayet etti. (Dediki): Bize Ravh yâni ibni Kasım, Amr b. Dinar'dan, o da Hasan b. Muhammed'den, o da Selemetu'bnu Ekvâ' ile Câbîr b. Abdillah'tan naklen rivayet eylediki : «Resululah (Sallallahu Aleyhi ve Sellem) yanımıza geldi de Mut'a için bize izin verdi» demişler",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3415,
			"arabicnumber": "1405.03",
			"text": "Bize Hasan El-Hulvâni rivayet etti. (Dediki): Bize Abdürrezzâk rivayet etti. (Dediki): Bize ibni Cüreyc haber verdi. (Dediki): Ata' şunu söyledi: Câbir b. Abdillah Umre yaparak geldi. Biz de evinde onun yanına vardık. Derken cemaat ona bazı şeyler sordular. Sonra mut'a'dan söz açtılar. Câbir : «Evet, Resulullah (Sallallahu Aleyhi ve Sellem) ile Ebu Bekir ve Ömer zamanlarında biz mut'a yaptık.» dedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3416,
			"arabicnumber": "1405.04",
			"text": "Bana Mulıammed b. Rafi' rivayet etti. (Dediki): Bize Abdürrezzâk rivayet etti. (Dediki): Bize ibni Cüreyc haber verdi. (Dediki): Bana Ebu'z-Zübeyr haber verdi. (Dediki): Câbir b. Abdillâh'ı şunu söylerken işittim. Biz Resulullah (Sallallahu Aleyhi've Sellem) ile Ebu Bekir devirlerinde bir avuç kuru hurma ve un mukabilinde birkaç günlüğüne mut'a yapardık. Nihayet Amr b. Hureys hâdisesinde Ömer bundan nehyetti",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3417,
			"arabicnumber": "1405.05",
			"text": "Bize Hâmid b. Ömer E!-Bekrâvî rivayet etti. (Dediki): Bize Abdülvâhid yâni ibni Ziyâd, Âsım'dan, o da Ebu Nadrâ'dan naklen rivayet eyledi. (Demişki): Câbir b. Abdillah'ın yanındaydım. Ona biri gelerek: îbni Abbâs ile ibni Zübeyr iki mut'a hakkında ihtilâf ettiîer, dedi. Bunun üzerine Câbir şunu söyledi: «Biz bunları Resulullah (Sallallahu Aleyhi ve Sellem) zamanında yaptık. Sonra Ömer onlardan bizi nehyetti",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3418,
			"arabicnumber": "1405.06",
			"text": "Bize Ebu-Bekir b. Ebi Şeybe rivayet etti. (Dediki): Bize Yunus b. Muhammed rivayet etti. (Dediki): Bize Abdulvâhid b. Ziyâd rivayet etti. (Dediki): Bize Ebu Umeys. lyâz b. Seleme'den, o da babasından naklen rivayet eyledi. Babası şöyle demiş : «Resulullah (Sallallahu Aleyhi ve Sellem) Evtâs yılında bize mut'a için üç gece ruhsat verdi. Sonra ondan nehî buyurdu. izah: Bu hadîsi Buhârî «Nikâh» bahsinde tahric etmiştir. îbni Abdilberr nikâh-ı mut'a hakkında öteden beri hilaf olduğunu kaydettikten sonra: «Sahabeye gelince: Onlar nikâhı mut'a hakkında ihtilâf etmişlerdir. ibni Abbâs bunun caiz ve helâl olduğuna kaaildir. Bu hususta ondan rivayet edenler arasında hilaf yoktur. Atâ' b. Ebî Rabah, Saîd b. Cübeyr ve Tavus da dahil olmak üzere ibni Abbâs'in ekseri ashabı bu kanaattedirler, Ebu Saîd-i Hudrî ile Câbir b. Abdillah (Radiyallahu anhuma) Hazerâtının dahi nikâh-ı mut'a'yı caiz ve helâî gördükleri rivayet olunur.» diyor. Evtâs: Tâif'de bir vadidir. islâm târihinde feth-i Mekke ile Evtâs günü aynı vak'a sayılır. Hz. Câbir hadîsinin birinci rivayetinde zikri geçen dellâlın Hz. Bilâl-i Habeşî olması muhtemel görülmektedir. Muteâkib rivayette Resulullah (Sallallahu Aleyhi ve Sellem)'in bizzat gelerek mut'a için izin verdiği beyân edilmiştir. Mamafih o rivayette de dellâlının gelmiş olması ihtimal dahilindedir. Hz. Câbir'in: «Resulullah (Sallallahu Aleyhi ve Sellem) ile Ebu Bekir ve Ömer zamanlarında biz mut'a yaptık. Nihayet Ömer biai bundan nehyetti» şeklindeki beyanatı Hz. Ömer zamanına kadar nikâhı mut'a'nın nesh edildiğini duymadıklarına hamîedilmiştîr",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3419,
			"arabicnumber": "1406.01",
			"text": "Bize Kutaybetü'bsnü Saîd rivayet etti. (Dediki): Bize Kabi' b. Sabrate'l-Cühenî'den, o da babası Sebrâ'dan naklen rivayet etti ki. (Şöyie demiş): Resulullah (Sallallahu Aleyhi ve Sellem) mut'a için bize izin verdi. Bunun üzerine bir zat ile ben Benî Âmîr'den bir kadına gittik. Kadın uzun boyunlu dişi deve gibi bîr şeydi. Ona kendimizi arz ettik. Kadın (bana): Ne vereceksin? dedi. Ben: — Kaftanımı cevâbını verdim. Arkadaşım da: — Kaftanımı veririm, dedi. Arkadaşımın kaftanı benimkinden daha güseldi. Ama ben arkadaşımdan daha genç îdim. Kadın arkadaşımın kaftanına bakınca onu, bana bakınca da benî beğendi. Sonra : — Sen ve kaftanın bana kâfidir, dedi. Bunun üzerine onunla üç gece bîr arada kaldım. Sonra Resulullah (Sallallahu Aleyhi ve Sellem): «Kimin yanında şu mut'a yaptığı kadınlardan biri varsa, ona hemen yol versin» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3420,
			"arabicnumber": "1406.02",
			"text": "Bize Ebu Kâmil Fudayl b. Hüseyin El-Cahterî rivayet etti. (Dediki): Bize Bişr yani ibni Mufaddal rivayet etti. (Dediki): Bize Umâratu'bnu Gaziyye, Rabi' b. Semra'dan naklen rivayet eyledi ki, Babası Mekke'nin fethinde Resulullah (Sallallahu Aleyhi ve Sellem) ile birlikte gaza etmiş. (Demişki): «Orada onbeş gece —yani geceleri de sayılırsa otuz gün— kaldık; Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) bize kadınlarla mut'a yapmak için izin verdi. Derken ben kavmimden bir zat ile birlikte dışarı çıktım. Güzellik hususunda benim ona üstünlüğüm vardı. Arkadaşım çirkine yakın bir adamdı. Her birimizin kaftanı vardı. Fakat benim kaftanım eski, amcaoğlunun kaftanı ise yepyeni bir şeydi. Mekke'nin alt tarafına yahut üst tarafına vardığımız vakit bize uzun boyunlu dişi deve gibi (endamlı) bir kadın rastladı. (Kendisine) : — Bizden birimizle mut'a yapmaya razı olur musun? dîye sorduk. Kadın: — Ne verirsiniz? dedi. Biz de her birimiz kaftanımızı yaydık. Kadın her ikimize bakmaya başladı. Arkadaşım kadının yanıbaşına baktığını görünce : — Bunun kaftanı eskidir. Benim kaftanım ise yepyenidir, dedi. Kadın ise iki veya üç defa : — Onun kaftanının zararı yok mukabelesinde bulundu. Sonra kadınla ben mut'a yaptım ve Resulullah (Sallallahu Aleyhi ve Sellem) mut'a'yı haram edinceye kadar yanından çıkmadım.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3421,
			"arabicnumber": "1406.03",
			"text": "{…} Bana Ahmed b. Saîd b. Sahr Ed-Dârimî rivayet etti. (Dediki): Bize Ebu Nu'man rivayet etti. (Dediki): Bize Vüheyb rivayet etti. (Dediki): Bize Umaretü'bnü Gaziyye rivayet eyledi. (Dediki): Bana Rabi' b. Sebrate'l-Cühenî, babasından rivayet etti. (Şöyle demiş): «Fetih yılında Resulullah (Sallallahu Aleyhi ve Sellem) ile birlikte Mekke'ye müteveccihen yola çıktık...» Râvî Beşir hadîsi gibi rivayette bulunmuş. Şunu da ziyâde etmiştir: «Kadın bu işe yarar mı? dedi.» Bu hadisde: «Bunun kaftanı eski püsküdür, dedi» cümlesi de vardır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3422,
			"arabicnumber": "1406.04",
			"text": "Bize Muhammed b. Abdillah b. Numeyr rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Abdil Azız b. Ömer rivayet etti. (Dediki): Bana Rabi' b. Sebrete'l-Cühenî rivayet etti. Ona da babası anlatmış ki; kendisi Resulullah (Sallallahu Aleyhi ve Sellem) ile berabermiş. Efendimiz şöyle buyurmuşlar : «Ey cemâat! Ben size kadınlarla mut'a hususunda izin vermiştim. Ama artık Allah bunu kıyamet gününe kadar haram kılmıştır. imdi kimin de yanında bu gunâ kadınlardan biri varsa ondan hemen arınsın. Hem o kadınlara verdiğiniz şeylerden hiç birini geri almayın.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3423,
			"arabicnumber": "1406.05",
			"text": "{…} Bize bu hadisi Ebu Bekr b. Ebu Şeybe de rivayet etti. (Dediki): Bize Abdetu'bnu Süleyman, Abdul Aziz b. Ömer'den naklen bu isnadla rivayette bulundu. Sebra: «Resulullah (Sallallahu Aleyhi ve Sellem)'i Kabe'de rükün ile kapının arasında ayakta gördüm.» demiş. ibni Numeyr hadîsinde olduğu gibi söylüyormuş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3424,
			"arabicnumber": "1406.06",
			"text": "Bize ishâk b. ibrahim rivayet etti. (Dediki): Bize Yahya b. Âdem haber verdi. (Dediki): Bize ibrahim b. Sa'd, Abdülmelik b. Rabi' b. Sebrate'l-Cuhenî'den, o da babasından, o da dedesinden naklen rivayet etti. (Şöyle demiş): «Fetih yılında Mekke'ye girdiğimiz vakit Resulullah (Sallallahu Aleyhi ve Sellem) mut'a yapmamızı emir buyurdu. Artık ondan bizi nehyedinceye kadar mut'a'dan çıkmadık.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3425,
			"arabicnumber": "1406.07",
			"text": "Bize Yahya b. Yahya rivayet etts, (Dediki): Bize Azîz b. Rabi' b. Sebrate'bni Ma'bed haber verdi. (Dediki); Babam Rabi' b. Sebra'yi, babası Sebratü'bnu Ma'bed'den naklen rivayet ederken dinledim. Mekke'nin fethi yılında Nebiyyullah (Sallallahu Aleyhi ve Sellem} kadınlarla mut'a yapmayı emir buyurmuş. Sebra demişki: Bunun üzerine ben ve Benî Suley kabilesinden bir arkadaşım dışarı çıktık. Nihayet Benî Âmir kabilesinden bir kadın bulduk. Kadın uzun boyunlu dişi deve gibi (endamlı) idî. Kadın'a mut'a teklifinde kulunduk. Ve kendisine kaftanlarımızı arz ettik. Kadın bana bakıyor, benî. arkadaşımdan güzel görüyor; arkadaşımın kaftanını da benim kaftanımdan güzel görüyordu. Bu hususta bir müddet nefsiyle istişareden sonra beni arkadaşıma tercih etti. Bu suretle kadınlar bizimle beraber üç gece kaldılar. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) onlardan ayrılmayı bize emir buyurdu",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3426,
			"arabicnumber": "1406.08",
			"text": "Bîze Amrun-Nâkid ile Ibni Numeys rivâyeî ettiler. (Dediierki): Bize Süfyan b. Uyeyne, Zuhrî'den, o da Rabi' b. Sebra:dan. o da babasıbdan naklen rivayet elti ki. Nebi (Sallallahu Aleyhi ve Sellem) Mut’a nikahından nehi buyurmuş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3427,
			"arabicnumber": "1406.09",
			"text": "Bize Ebu Bekir b. Ebî Şeybe rivayet etti. (Dediki}: Bize ibni Uleyye, Ma'mer'den o da Zühri'den, o da Rabi b. Sebra'dan o da babasından naklen rivayet etti ki, Resulullah (Sallallahu Aleyhi ve Seltem) kadınlarla mut'a yapmayı fetih gününde nehi buyurmuş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3428,
			"arabicnumber": "1406.10",
			"text": "Bana bu hadîsi Hasan El-Hulvanî ile Abd b. Humeyd, Ya'kub b. ibrahim b. Sa'd'dan rivayet ettiler. (Demişki): Bana babam, Sâlih'den naklen rivayet elti. (Demişki): Bize ibni Şihâb, Rabi' b. Sebrate'l-Cuheni'den, o da babasından naklen haber verdi. Babası Rabi'a, Resulullah (Sallallahu Aleyhı've Sellem)'in fetih zamanında mut'a'dan yani kadınlarla mut'a yapmaktan nehi buyurduğunu ve kendisinin iki kırmızı kaftan mukabilinde mut'a yapmış olduğunu haber vermiş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3429,
			"arabicnumber": "1406.11",
			"text": "Bana Harmeletu'bnu Yahya rivayet etti. (Dediki): Bize ibni Vehb haber verdi. (Dediki): Bana Yunus haber verdi, ibni Şihâb şöyle demiş: Bana Urvetü'bnü Zubeyr haber verdi ki, Abdullah b. Zübeyr Mekke'de ayağa kalkmış ve bir zat'a ta'rizde bulunarak: «Şüphesiz ki, bazı insanların Allah gözlerini kör ettiği gibi, kalblerini de kör etmiş. Nikâhı mut'a'ya fetva veriyorlar.» demiş. Bunun üzerine o zât kendisine nida ederek: «Sen hakikaten kaba saba bir adamsın. Ömrüme yemin ederim ki, mut'a imâmül-müttekin zamanında yapılırdı.» demiş. Bununla Resulullah (Sallallahu Aleyhi ve Sellemj'i kasdetmiş. ibni Zübeyr ona şu mukabelede bulunmuş — Öyle ise kendini bir dene. Vallahi sen bunu yaparsan seni taşlarınla recm ederim. ibni Şihâb şöyle demiş: Bana Halid b. Muhacir b, Seyfullah haber verdi ki. kendisi bir zâtın yanında otururken o zât'a bir adam gelerek mut'a hususunda fetva istemiş. O da mut'a yapmasını emretmiş. Bunun üzerine ibni Ebî Amrate'l-Ensâri ona : — Ağır ol! demiş. O zât: — Ne o? Vallahi mut'a imamul muttekîn zamanında yapılmıştır. Mukabelesinde bulunmuş. ibni Ebî Amra: «Mut'a islâm'ın ilk zamanlarında muztar kalanlar için iaşe, kan ve domuz eti (yemek) gibi bir ruhsattı. Sonra Allah dîni muhkem kıldı ve bundan nehi buyurdu.» demiş. ibni Şîhâb şöyle demiş : Bana Rabi' b. Sebrate'I-Cuheni haber verdi ki, babası şunu söylemiş: «Ben Resulullah (Sallallahu Aleyhi ve Sellem) zamanında iki kırmızı kaftan mukabilinde Benî Âmir kabilesinden bir kadınla mut'a yapmıştım. Sonra bizi Resulullah (Sallallahu Aleyhi ve Sellem) mut'a'dan nehi buyurdu.» ibni Şîhâb demişki: «Ben Rabi' b. Sebra'yı, Ömer b. Abdil Azîz'e bunu anlatırken oturduğum yerden dinledim.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3430,
			"arabicnumber": "1406.12",
			"text": "Bana Selemetü'bnü Şebîb rivayet etti. (Dediki): Bize Hasen b. A'yen rivayet etti. (Dediki): Bize Ma'kıl, ibni Ebî Able'den, o da Ömer b. Abdilâzîz'den naklen rivayet eyledi. Şöyle demiş: Bize Rabî' b. Sebrate'l-Cühenî, babasından naklen rivayet eyledi ki, Resulullah (Sallallahu Aleyhi ve Sellem) mut'a'dan nehyetmiş ve: «Dikkat edin! Mut'a şu gününüzden kıyâmet gününe kadar haramdır; kim bîr şey verdi ise onu (geri) almasın!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3431,
			"arabicnumber": "1407.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, ibni Şihâb'dan dinlediğim, onun da Muhammed b. Alî'nin oğulları Abdullah ile Hasen'den, onların da babalarından, onun da Ali b. Ebî Talib'den naklen rivayet ettiği şu hadîsi okudum: «Resulullah (Sallallahu Aleyhi ve Sellem) Hayber günü kadınlarla mut'a yapmaktan ve ehli eşeklerin etlerini yemekten nehi buyurdular.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3432,
			"arabicnumber": "1407.02",
			"text": "{…} Bize hu hadîsi Abdullah b. Muhammed b. Esma' Ed-Dubaî dahi rivayet etti. (Dediki): Bize Cüveyriye, Mâlik'den bu isnadla rivayette bulundu. Mâlik: «Ali b. Ebi Talib'in birine sen gerçekten şaşkın bir adamsın; Resulullah (Sallallahu Aleyhi ve Sellem) bizi nehiy buyurdu derken işittiğini söylemiş.» Râvi hadîsi, Yahya b. Yahya'nın Mâlik'den rivayet ettiği hadîs gibi rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3433,
			"arabicnumber": "1407.03",
			"text": "Bize Ebü Bekir b. Ebî Şeybe ile ibni Numeyr ve Züheyr b. Harb toptan îbni Uyeyne'den rivayet ettiler. Züheyr (Dediki): Bize Süfyân b. Uyeyoe, Zührî'den, o da Muhammed b. Ali'nin oğulları Hasen ile Abdullah'dan, onlar da babalarından, o da Ali'den nakien rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) Hayber günü hem nikâhı müt'a-dan, hem de ehli eşeklerin etlerin(i yemek) den nehiy buyurmuş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3434,
			"arabicnumber": "1407.04",
			"text": "Bize Muhammed b. Abdillah b. Numeyr rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Ubeydullah, ibni Şihab'-dan, o da Muhammed b. Alî'nin oğulları Hasen ile Abdullah'dan, onlar da babalarından, o da Ali'den naklen rivayet eyledi ki, Hz. Ali îbni Abbâs'ı kadınlara mut'a yapmak hususunda müsamahakâr konuşurken işiterek : — Yavaş ol ey îbnü Abbâs! Çünkü Resulullah (Sallallahu Aleyhi ve Seilem): Hayber günü hem mut'a'dan, hem de ehli eşeklerin etlerin (i yemek) den nehiy buyurdu; demiş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3435,
			"arabicnumber": "1407.05",
			"text": "Bana Ebu't-Tâhir ile Harmeletu'bnu Yahya rivayet etti (Dedilerki): Bize ibni Vehb haber verdi. (Dediki): Bana Yunus, Şihâb'dan, o da Muhammed b. Ali b. Ebi Tâîib'in oğulları Hasen ile Abdullah'dan, onîar da babalarından naklen haber verdi. Muhammed, Ali b. Ebi Tâlib'i îbni Abbâs'a şunları söylerken işitmiş : «Resulullah (Sallallahu Aleyhi ve Sellem) Hayber günü hem kadınlara mut'a yapmaktan, hemde ehli eşeklerin etlerini yemekden nehiy buyurdular.» İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3436,
			"arabicnumber": "1408.01",
			"text": "Bize Abdullah b. Meslemete'I-Ka'nebi rivayet etti. (Dediki): Bize Mâlik, Ebu'z-Zinad'dan, o da A'rac'dan, o da Ebu Hureyre'den naklen rivayet etti. Ebu Hureyre şöyle demiş: ResuluIIah (Sallallahu Aleyhi ve Sellem) «Bir kadınla halası ve yine bir kadınla teyzesi bir nikâh altında toplanamaz» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3437,
			"arabicnumber": "1408.02",
			"text": "Bize Muhammed b. Rumh b. EI-Muhâcir rivayet etti. (Dediki): Bize Leys, Yezîd b. Ebî Habîb'den, o da Irak b. Maik'den, o da Ebu Hureyre'den naklen haber verdi ki, Resulullah (Sallallahu Aleyhi ve Sellem) dört kadının bir nikâh altında toplanmasını (yâni) bir kadınla onun halasını ve yine bir kadınla onun teyzesini beraberce nikâh etmeyi nehiy buyurmuş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3438,
			"arabicnumber": "1408.03",
			"text": "Bize Abdullah b. Meslemete'bni Ka'neb rivayet etti. (Dediki): Bize Abdurrahman b. Abdilazîz rivayet etti. (Müslim der ki, îbni Mesleme, Ebu Umâmete'bni Sehl b. Huneyfin neslinden Medîneli bir Ensârîdir.) o da ibni Şihâb'dan, o da Kabîsatü'bnu Züeyb'den, o da Ebu Hureyre'den naklen rivayet etti. Ebu Hureyre şöyle demiş: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i: «Hala kardeş kızı üzerine, kız kardeş kızı da teyze üzerine nikâh edilemez.» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3439,
			"arabicnumber": "1408.04",
			"text": "Bana Harmeletü'bnu Yahya rivayet etti. (Dediki): Bize ibni Vehb haber verdi. (Dediki): Bana Yunus, ibni Şîhâb'dan naklen habeı verdi. (Demişki): Bana Kabîsatü'bnu Züeyb el-Kâ'bî haber verdi. Kendisi Ebu Hureyre'yi şöyle derken işitmiş : «Resulullah (Sallallahu Aleyhi ve Sellem) erkeğin bir kadınla onun halasını ve bîr kadınla onun teyzesini bîr nikâh altında toplamasını yasak etti.» îbni Şihab: «Biz kadının babasının teyzesi île babasının halasını da aynı hükümde olduğunu zannediyoruz.» demiş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3440,
			"arabicnumber": "1408.05",
			"text": "Bana Ebu Ma'n Er-Rakâşî rivayet etti. (Dediki): Bize Hâlid b. Haris rivayet etti. (Dediki): Bize Hişam Yahya'dan naklen rivayet etti ki, Yahya kendisine Ebu Seleme'den, o da Ebu Hureyre'den naklen yazmış. Ebu Hureyre şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) : «Bir kadın halasının ve teyzesinin üzerine nikah edilemez» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3441,
			"arabicnumber": "1408.06",
			"text": "{…} Bana îshak b. Mensur rivayet etti. (Dediki): Bize Ubeydullah b. Musa, Şeyban'dan, o da Yahya'dan naklen rivayet eyledi. (Demişki): Bana Ebu Seleme rivayet etti. Kendisi Ebu Hureyre'yi: «Resulullah (Sallallahu Aleyhi ve Sellem) buyurdu» derken işitmiş. Râvî bu hadîsi yukardaki hadîs gibi rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3442,
			"arabicnumber": "1408.07",
			"text": "Bize Ebu Bekir b. Ebi Şeybe rivayet etti. (Dediki): Bize Ebu Usâme, Hişam'dan, o da Muhammed b. Sîrîn'den, o da Ebu Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet eyledi. Efendimiz : «Bir adam din kardeşinin dünürlüğünün üzerine dünür göndermez. Dîn kardeşinin pazarlığı üzerine pazarlığa girişmez; kadın halasının ve teyzesinin üzerine nikâh edilemez. Kadın kız kardeşinin kabını boşaltmak için onun boşanmasını isteyemez. Kadın isteyene varmalıdır. Onun nasibi ancak Allah'ın kendisine takdir ettiği şeydir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3443,
			"arabicnumber": "1408.08",
			"text": "Bana Muhriz b. Avn b. Ebî Avn rivayet etti. (Dediki): Bize Aliyyü'bnü Müshir, Davud b. Ebî Hind'den, o da ibni Sîrîn'den, o da Ebu Hureyre'den naklen rivayet eyledi. Ebu Hureyre şöyle demiş : «Resulullah (Sallallahu Aleyhi ve Sellem) kadının halası veya teyzesinin üzerine nikâh edilmesini yahud kadının kız kardeşinin kabında olanı boşaltmak için onun boşanmasını istemesini yasak etti. Zîra Allah (Azze ve Celle) onun rızkını verir.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3444,
			"arabicnumber": "1408.09",
			"text": "Bize Muhammed b. el-Müsennâ ile ibni Beşşâr ve Ebu Bekr b. Nâfi' rivayet ettiler. Lâfız ibnî'l-Müsennâ ile ibni Nâfi'indir. (Dedilerki): Bize ibni Ebu Adiyy, Şu'be'den, o da Amr b. Dinar'dan, o da Ebu Seleme'den, o da Ebu Hureyre'den naklen haber verdi. Ebu Hureyre şöyle demiş : «Resulullah (Sallallahu Aleyhi ve Sellem) bir kadınla halasının ve bir kadınla teyzesinin bir nikâh altında toplanmasını yasak etti.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3445,
			"arabicnumber": "1408.10",
			"text": "{…} Bana Muhammed b. Hatim rivayet eti. (Dediki): Bize Şebâte rivayet etti. (Dediki); Bize Verkaa', Amr b. Dinar'dan bu isnâdla bu hadîsin mislini rivayet eyledi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3446,
			"arabicnumber": "1409.01",
			"text": "Bize Yahya b. Yahya rivayet etti, (Dediki): Mâlik'e, Nâfi'den dinlediğim, onun da Nubeyh b. Vehb'den naklen rivayet ettiği şu hadîsi okudum. Ömer b. Ubeydillah, Talhatu'bnıü Ömer'e, Şeybetü'bnü Cübeyr'in kızını nikâh etmek istemiş de o gün hacc emiri bulunan Ebân b. Osman'ın bu nikâhta bulunması için kendisinle haber göndermiş. Bunun üzerine Ebân şunu söylemiş : «Ben Osman b. Affân'ı: «Resulullah (Sallallahu Aleyhi ve Sellem) : «İhrâmlı olan bir kimse ne nikâh edebilir; ne nikâh olunur; ne de dünür gönderir.» buyurdu, derken işittim",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3447,
			"arabicnumber": "1409.02",
			"text": "Bize Muhammed b. Ebî Bekr EI-Mukaddemî rivayet etti. etti. (Dediki): Bize Hammad b. Zeyd, Eyyub'dan, o da Nafi'den naklen rivayet eyledi. (Nafi' şöyle demiş) : Bana Nubeyh b. Vehb rivayet etti. (Dediki): Beni Ömer b. Ubeydullah b. Ma'mer gönderdi. Kendisi Şeybetü'bnu Osman'ın kızını oğluna istiyordu. Bu sebeble beni hacc emiri bulunan Ebân b. Osman'a yolladı. Ebân : «Beri bak. Ben bu adamı bedevi sanıyorum. Çünkü ihrâmîı bir kimse ne nikâh edebilir, ne de nikâh olunur. Bunu bize Osman, Resulullah (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi.» dedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3448,
			"arabicnumber": "1409.03",
			"text": "Bana Ebu Gassân El-Mismaî rivayet etti, (Dediki): Bize Abdi'l â'lâ rivayet etti. H. Bana Ebu'l-Hattâb, Ziyâd b. Yahya dahi rivayet etti. (Dediki): Bize Muhammed b. Sevâ' rivayet etti. Her iki râvi demişler ki: Bize Saîd, Matar ile Ya'lâ b. Hakim'den, onlar da Nafi'den, o da Nubeyh b. Vehb'den, o da Eben b. Osman'dan, o da Osman b. Affan'dan naklen rivayet etti ki, Resulullah (Sallallahu Aleyhi ve Sellem): «İhrâmlı bir kimse ne nikâh edebilir; ne nikah olunur, ne dünür gönderir» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3449,
			"arabicnumber": "1409.04",
			"text": "Bize Ebu Bekir b. Ebî Şeybe ile Amru'n-Nâkıd ve Züheyr b. Harb toptan ibni Uyeyne'den rivayet etliler. Zuheyr (Dediki): Bize Süfyan b. Uyeyne, Eyyub b. Musa'dan, o da Nubeyb b. Vehb'den, o da Eban b. Osman'dan, o da Osman'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'e vardırmak suretiyle rivayet etti. Efendimiz : «ihrâmlı bir kimse nikâh yapamaz; dünür de gönderemez» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3450,
			"arabicnumber": "1409.05",
			"text": "Bize Abdül Melik b. Şuayb b. Leys rivayet etti. (Dediki): Bana babam, dedemden rivayet etti. (Demişki): Bana Hâlid b. Yezîd rivayet etti. (Dediki): Bana Saîd b. Ebî Hilâl, Nubeyh b. Vehb'den naklen rivayet eyledi ki, Ömer b. UbeydiIIah b. Ma'mer oğlu Talha'ya, Şeybetü'bnu Cübeyr'in kızını hacda nikahlamak istemiş. Ebân b. Osman da o gün hacc cmiri bulunuyormuş. Ebân'a: Ben Talhatu'bnu Ömer'i evlendirmeye niyet ettim; senin de bu cemiyette bulunmanı dilerim, diye haber göndermiş. Ebân ona şu cevâbı vermiş : — Beri bak! Seni kof bir Iraklı sanıyorum. Ben Osman b. Affân'ı şunu söylerken işittim: Besulullah (Sallallahu Aleyhi ve Sellem) : «ihrâmlı bir kimse nikâh yapamaz» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3451,
			"arabicnumber": "1410.01",
			"text": "Bize Ebu b. Ebî Şeybe ile ibni Numeyr. ve ishâk-i Hanzalî hep birden ibni Uyeyne'den rivayet ettiler. ibni Numeyr (Dediki:) Bize Süfyan b. Uyeyne, Amr b. Dinar'dan, o da Ebu'ş-Şah'sâ'dan naklen rivayet etti. Ebu'ş-Şah'sâ'ya da ibni Abbâs haber vermiş ki, Nebi (Sallallahu Aleyhi ve Sellem) kendisi ihrâmlı olduğu halde Meymune ile evlenmiş. ibni Numeyr şunu da ziyade etti : «Ben bu hadîsi Zuhri'ye söyledim de: (Bana Yezîd b. Esam haber verdi ki, Nebi (Sallallahu Aleyhi ve Selle/n) onu kendisi ihrâmsızken nikâh etmiş) dedi.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3452,
			"arabicnumber": "1410.02",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Dâvud b. Abdirrahman, Amr b. Dinar'dan, o da Ebu'ş-Şah'sa Câbir b. Zeyd'den, o da ibni Abbâs'dan naklen haber verdi. ibni Abbâs şöyle demiş : «Resulullah (Sallallahu Aleyhi ve Sellem) kendisi ihrâmlı olduğu halde Meymune ile evlendi.» İzah 1411 de",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3453,
			"arabicnumber": "1411",
			"text": "Bize Ebu Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Yahya b. Âdem rivayet etti. (Dediki): Bize Cerîr b. Hâzim rivayet etti. (Dediki): Bize Ebu Fezâre, Yezid b. Esam'dan naklen rivayet eyledi. (Demiş ki) ; Bana Meymune binti Haris anlattı ki, Resulullah {Sallallahu Aleyhi re Sellem) kendisi ihrâmsızken onunla evlenmiş. Yezîd: «Meymune benim ve ibnî Abbâs'ın teyzemizdi.» demiş. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3454,
			"arabicnumber": "1412.01",
			"text": "Bize Kutaybetü'bnu Saîd rivayet etti. (Dediki): Bize Leys rivayet etti. H. Bize ibni Rumh dahi rivayet etli. (Dediki): Bize Leys, Nafi'den, o da ibni Ömer'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi: «Biriniz diğerinin satışı üzerine satış yapmasın. Ve biriniz diğerinin dünürlüğü üzerine dünür göndermesin.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3455,
			"arabicnumber": "1412.02",
			"text": "Bana Züheyr b. Harb ile Muhammed b. El-Müsennâ hep bîrden Yahya EI-Kattân'dan rivayet ettiler. Züheyr (Dediki): Bize Yahya, Ubeydullah'dan rivayet etti. (Demişki): Bana Nâfi, ibni Ömer'den, o da Nebi {Sallallahu Aleyhi ve Sellem)'den naklen haber verdi. Efendimiz : «Bir kimse din kardeşinin satışı üzerine satış yapmasın; din kardeşinin dünürlüğü üzerine dünür de göndermesin. Ancak kendisine izin verirse o başka» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3456,
			"arabicnumber": "1412.03",
			"text": "{…} Bize bu hadîsi Ebu Bekr b. Ebî Şeybe de rivayet etti. (Dediki): Bize Aliyyü'bnu Müshir, Ubeydullah'dan bu isnadla rivayette bulundu",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3457,
			"arabicnumber": "1412.04",
			"text": "{…} Bana bu hadîsi Ebu Kâmil El-Cahderî dahi rivayet etti. (Dediki): Bize Hammâd rivayet etti. (Dediki): Eyyub. Nâfi'den bu isnadla rivayette bulundu",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3458,
			"arabicnumber": "1413.01",
			"text": "Bana Amru'n-Nâkıd ile Zuheyr b. Harb ve ibni Ebî Ömer rivayet ettiler. Züheyr (Dediki): Bize Süfyân b. Uyeyne, Zühri'den, o da Saîd'den, o da Ebu Hureyre'den naklen rivayet etti ki, Peygamber (Sallallahu Aleyhi ve Sellem) şehirlinin köylü nâmına mal satmasını, satıcıların müşteriyi aldatmak için fiat yükseltmelerini, bir kimsenin din kardeşinin dünürlüğü üzerine dünür göndermesini veya onun satışı üzerine satış yapmasını nehyetmiş ve: Kadın, kız kardeşinin kabındakini yahut tabağındakini boşaltmak için onun boşanmasını istemesin, buyurmuşlar. Amr kendî rivayetinde: «Bir kimse kardeşinin pazarlığı üzerine pazarlık da yapmasın» cümlesini ziyâde etti",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3459,
			"arabicnumber": "1413.02",
			"text": "Bana Harmaletü'bnu Yahya rivayet etli. (Dediki): Bize ibni Vehb haber verdi. (Dediki): Bana Yunus, îbni Şihâb'dan naklen haber verdi. (Demişki): Bana Saîd b. EI-Müseyyeb rivayet ettiki, Ebu Hureyre şunu söylemiş: Resulullah (Sallallahu Aleyhi ve Sellem) : «Fiyat yükseltmeyin! Bir kimse kardeşinin satışı üzerine satış yapmasın. Şehirli köylü namına mal satmasın! Bir kimse kardeşinin dünürlüğü üzerine dünür göndermesin! Kadın da başka bîr kadının kabındakini boşaltmak için onun boşanmasını istemesin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3460,
			"arabicnumber": "1413.03",
			"text": "Bize Ebu Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdulâ'lâ rivayet etti. H. Bana Muhammed b. Rafi' de rivayet etti. (Dediki): Bize Abdürrazzâk rivayet eyledi. Her iki râvi Ma'mer'den, o da Zuhri'den bu isnâdla yukarki hadîsin mislini rivayet etmişlerdir. Ancak Mâmer'in hadîsinde : «Bir kimse kardeşinin satışı üzerine arttırma yapmasın» cümlesi de vardır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3461,
			"arabicnumber": "1413.04",
			"text": "Bize Yahya b. Eyyub ile Kuteybe ve ibni Hucr hep birden ismail b. Ca'fer'den rivayet ettiler. îbni Eyyub (Dediki): Bize ismail rivayet etti. (Dediki): Bana Alâ', babasından, o da Ebu Hureyre'den naklen haber verdiki, Resulullah (Sallallahu Aleyhi ve Sellem) : «Bir müslüman, kardeşinin pazarlığı üzerine pazarlık yapmasın, onun dünürlüğü üzerine dünür de göndermesin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3462,
			"arabicnumber": "1413.05",
			"text": "Bana Ahmed b. ibrahim Ed-Devrakî rivayet etti. (Dediki): Bize Abdussamed rivayet etti. (Dediki): Bize Şu'be, Alâ ile Süheyl'den babalarından, onîar da Ebu Hureyre'den. o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet eyledi. H, Bize bu hadisi Muhammed b. El-Müsenna da rivayet etti. (Dediki): Bize Abdussamed rivayet etti. (Dediki): Bize Şu'be, A'meş'den, o da Ebu Sâlih'den, o da Ebu Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayette bulundu. Şu kadar var ki, bu râviler: «Kardeşinin pazarlığı ve kardeşinin dünürlüğü üzerine» tâbirlerini kullanmışlardır. İzah 1414 te",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3464,
			"arabicnumber": "1414",
			"text": "Bana Ebu't-Tâhir rivayet etti. (Dediki): Bize Abdullah b. Vehb, Leys ile başkasından, onlarda Ebu Habib'den. o da Abdurrahman b. Şumâse'den naklen haber verdiki, Abdurrahman Ukbetü'bnu Âmir'i minber üzerinde şunları söylerken işitmiş: Resulullah Sallallahu Aleyhi ve Sellem: «Mu'min Mu'minin kardeşidir. Binâenaleyh bîr Mu'min için kardeşinin satışı üzerine satış yapması ve o vazgeçmedikçe dünürlüğü üzerine dünür göndermesi helâl değildir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3465,
			"arabicnumber": "1415.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, Nâfi'den dinlediğim, onun da ibni Ömer'den naklen rivayet ettiği bu hadîsi okudum : «Resulullah (Sallallahu Aleyhi ve Sellem) nikâh-ı şiğar'dan nehiy buyurdular.» Şiğâr: Aralarında mehîr olmamak üzere bir kimsenin kızını başkasına, o da kızını kendisine vermek şartıyla nikâh etmesidir.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3466,
			"arabicnumber": "1415.02",
			"text": "Bana Züheyr b. Harb ile Muhammed b. El-Müsennâ ve Ubeydullah b. Said rivayet ettiler. (Dedilerki): Bize Yahya, Ubeydullah'dan, o da Nâfi'den, o da ibni Ömer'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den yukarki hadîsin mislini rivayet etti. Yalnız Ubeydullah'ın hadîsinde : «Dediki: Ben Nafi'ye şîğar nedir? diye sordum» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3467,
			"arabicnumber": "1415.03",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Hammâd b. Zeyd, Abdurrahman Es-Serrâc'dan, o da Nâfi'den, o da ibni Ömer'den naklen haber verdi ki, Resulullah (Sallallahu Aleyhi\\ ve Sellem) Şiğar'dan nehiy buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3468,
			"arabicnumber": "1415.04",
			"text": "Bana Muhammed b. Râfi' rivayet etti. (Dediki): Bize Abdürrezzâk rivayet etti. (Dediki): Bize Ma'mer, Eyyub'dan, o da Nâfi'den, o da ibni Ömer'den naklen haber verdi ki, Nebi (Sallallahu Aleyhi ve Sellem): «İslâm'da şiğar yoktur.» buyurmuşlar. İzah 1417 de",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3469,
			"arabicnumber": "1416.01",
			"text": "Bize Ebu Bekir b. Ebî Şeybe rivayet etli. (Dediki): Bize ibni Numeyr ile Ebu Usame, Ubeydullah'dan, o da Ebu'z-Zinad'dan, o da A'rec'den, o da Ebu Hureyre'den naklen rivayet eyledi. Ebu Hureyre: «Resulullah (Sallallahu Aleyhi ve Sellem) Şiğar'dan nehiy buyurdu.» demiş. ibni Numeyr şunu da ziyâde etmiş: «Şiğar, bir kimsenin diğerine: Sen bana kızını tezvic et; ben de sana kızımı tezvic edeyim, yahut bana kız kardeşini ver, ben de sana kız kardeşimi vereyim demesidir.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3470,
			"arabicnumber": "1416.02",
			"text": "{…} Bize bu hadîsi Ebu Kureyb dahi rivayet etti. (Dediki): Bize Abde, Ubeydullah'dan —ki ibni Ömer'dir.— Bu isnadla rivayette bulundu. Ama ibni Numeyr'in ziyadesini zikretmedi. İzah 1417 de",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3471,
			"arabicnumber": "1417",
			"text": "Bana Harun b. Abdillah rivayet etti. (Dediki): Bize Haccâc b. Muhammed rivayet etti. Haccâc, ibni Cüreyc (Dediki) tâbirini kullandı. H. Bize bu hadîsi îshâk b. ibrahim ile Muhammed b. Rafi' de, Abdürrezzâk'dan rivayet ettiler. (Demişki): Bize ibni Cüreyc haber verdi. (Dediki): Bana Ebu'z-Zübeyr haber verdi ki, Câbir b. Abdillâh'ı şunu söylerken işitmiş: «Resulullah (Sallallahu Aleyhi ve Sellem) Şiğar'dan nehiy buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3472,
			"arabicnumber": "1418",
			"text": "Bize Yahya b. Eyyub rivayet etti. (Dediki): Bize Hüşeym rivayet etti. H. Bize ibni Numeyr de rivayet etti, (Dediki): Bize Veki' rivayet etti. H. Bize Ebu Bekr b. Ebî Şeybe de rivayet etti. (Dediki): Bize Ebu Hâlid El-Ahmer rivayet etti. H. Bize Muhammed b. El-Müsennâ dahi rivayet etti. (Dediki): Bize Yahya yâni El-Kattân, Abdulhamid b. Ca'fer'den, o da Yezid b. Ebî Habib'den, o da Mersed b. Abdillah El-Yezeni'den, o da Ukbetü'bnu Âmir'den naklen rivayet eyledi. Ukbe şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) : «Şübhesiz ki, en ziyade ifâsı gereken şart, kendisi ile kadınları helâl yaptığınız mehirdiı» buyurdular. Ebu Bekir ve ibnu'l-Müsennâ hadîsinin lâfzı budur. Yalnız ibnu'l-Müsennâ (şart yerine) şurut dedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3473,
			"arabicnumber": "1419.01",
			"text": "Bana Ubeydullah b. Ömer b, Meyserete'I-Navârîri rivayet etti (Dediki): Bize Hâlid b. Haris rivayet etti. (Dediki): Bize Hişâm. Yahya b. Ebî Kesir'den rivayet etti. (Demişki): Bize Ebu Seleme rivayet etti. (Dediki): Bize Ebu Hureyre rivayet eylediki. Resulullah (Sallallahu Aleyhi ve Sellem): «Dul kadın kendisiyle istişare edilmedikçe nikâh edilemez. Kız da kendisinden izin alınmadıkça nikâh olunamaz.» buyurmuşlar. Ashâb : — Yâ Resulallah! Onun izni nasıl olur? demişler.Resulullah (Sallallahu Aleyhi ve Sellenı) : «Susmasıdır» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3474,
			"arabicnumber": "1419.02",
			"text": "{…} Bana Züheyr b. Harb rivayet etti. (Dediki): Bize ismail b. ibrahim rivayet etti. (Dediki): Bize Haccâc b. Ebî Osman rivayet eyledi. H. Bana ibrahim b. Musa da rivayet etti. (Dediki): Bize isâ yâni ibnî Yunus, Evzâî'den naklen haber verdi. H. Bana Züheyr b. Harb dahî rivayet etti. (Dediki): Bize Hüseyin b. Muhammed rivayet etti. (Dediki): Bize Şeybân rivayet eyiedi. H. Bana Amru'n-Nâkıd ile Muhammed b. Rafi' dahi rivayet ettiler. (Dedilerki): Bize Abdurrezzâk, Ma'mer'den rivayet etti. H. Bize Abdullah b. Abdirrahman Ed-Dârimi de rivayet etti. (Dediki): Bize Yahya b. Hassan haber verdi. (Dediki): Bize Muâviye rivayet etti. Bu râvilerin hepsi Yahya b. Ebî Kesîr'den Hişâm hadîsi mânâsında ve onun isnadı ile rivayette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3475,
			"arabicnumber": "1420",
			"text": "Bize Ebu Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdullah b. idris, ibnî Ciireyc'den rivayet etti. H. Bize ishâk b. ibrahim ile Muhammed b. Rafi' dahi hep birden Abdurrezzak'dan rivayet ettiler. Lâfız ibni Rafi'nindir. (Dedilerki): Bize Abdurrezzâk rivayet etti. (Dediki): Bize ibnî Cüreyc haber verdi. (Dediki): ibni Ebî Müleyke'yi şunu söylerken işittim. Âişe'nin âzathsı Zekvân dediki, ben Âişe'yi şöyle derken işittim: Resulullah (Sallallahu Aleyhi ve Sellem)'e, ailesinin evlendirdiği bîr kızdan nikâh hususunda enir alınacak mı alınmıyacak mı? diye sordum.» Resulullah (Sallallahu Aleyhi ve Sellem) Âişe'ye : «Evet, ondan emîr alınacak.» cevâbını vermiş. Âişe dedikî: Bunun üzerine ben kendisine: — Ama kız utanır, dedim. Resulullah (Sallallahu Aleyhi ve Sellem) : «Kız sustu mu işte bu onun iznidir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3476,
			"arabicnumber": "1421.01",
			"text": "Bize Saîd b. Mensur ile Kutaybe'tübnü Saîd rivayet ettiler. (Dedilerki): Bize Mâlik rivayet etti. H. Bize Yahya b. Yahya dahî rivayet etti. Bu lâfız onundur. (Dediki): Mâlik'e: Sana Abdullah b. Fadl, Nafi' b. Cübeyr'den, o da ibni Abbâs'dan naklen, Nebi (Sallallahu Aleyhi ve Selkm)'in : «Dul kadın kendisi için velisinden daha ziyade hak sahibidir. Kızdan ise nefsi hakkında izin istenir; onun izni de susmasıdır.» buyurduğunu rivayet etti mi? diye sordum. Mâlik, evet, cevâbını verdi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3477,
			"arabicnumber": "1421.02",
			"text": "Bize Kutaybetü'bnü Saîd rivayet etti. (Dediki): Bize Süfyân, Ziyâd b. Sad'dan, o da Abdullah b. Fadl'dan naklen rivayet etti. Abdullah Nafi' b. Cübeyr'i, ibni Abbâs'dan naklen haber verirken dinlemiş ki, Nebi (Sallallahu Aleyhi ve Sellem): «Dul kadın kendisi içîn velisinden daha ziyade hak sahibidir. Kızdan ise emir istenir; onun izni susmasıdır.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3478,
			"arabicnumber": "1421.03",
			"text": "Bize ibni Ebî Ömer rivayet etti. (Dediki): Bize Süfyân bu isnâdla rivayette bulundu ve : «Dul kadın kendisi için velisinden daha ziyade hak sahibidir. Kızdan nefsi hakkında babası izin ister. Onun iznide susmasıdır.» Dedi. Galiba: «Susması ikrardır.» da dedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3479,
			"arabicnumber": "1422.01",
			"text": "Bize Ebu Kureyb Muhammed b. EI-Alâ rivayet etti. (Dediki): Ebu Üsâme rivayet etti. H. Bize Ebu Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Kitabımda Ebu Usâme'den naklettiğini, onun da Hişâm'dan, onun da babasından, onun da Âişe'den rivayet eylediği şu hadîsi buldum. Âişe şöyle demiş : «Resulullah (Sallallahu Aleyhi ve Sellem) beni altı yaşımda iken nikâh etti; dokuz yaşımda iken de benimle zifaf'a girdi. Müteakiben Medîne'ye geldik. Ben bir ay sıtmaya tutuldum. (Bu sebeble saçlarım döküldü) nihayet saçlarım (tekrar büyüyerek) omuzlarıma indi. Derken bana Ümmü Rumân geldi. Ben kız arkadaşlarımla birlikte tahtaravalli oynuyordum. Bana seslendi. Hemen yanına vardım. Beni ne yapacağını bilmiyordum. Elimden tutarak beni kapıda durdurdu. Nefesim kesilmiş, heh heh diye soluyordum. Nihayet hızlı solumam zail oldu. Ümmü Kuman beni bir odaya aldı. Bir de ne göreyim Ensardan bir takım kadınların huzurundayım. Kadınlar: Hayırlı, uğurlu ve mübarek olsun, dediler. Ümmü Rumân da beni onlara teslim etti. Kadınlar taşımı yıkadılar. Beni çekip çevirdiler. Bir de Resulullah (Sallallahu Aleyhi ve Sellem) kuşluk zamanı ansızın çıka geldi. Kadınlar beni ona teslim ettiler",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3480,
			"arabicnumber": "1422.02",
			"text": "Muâviye, Hişâm b. Urve'den naklen haber verdi. H. Bize ibni Numeyr de rivayet etti. Bu lâfız onundur. (Dediki): Bize Abde yâni ibni Süleyman, Hişâm'dan, o da babasından, o da Âişe'den naklen rivayet eyledi. Âişe şöyle demiş: «Nebi (Sallallahu Aleyhi ve Selleml beni altı yaşımda iken nikâh etti. Dokuz yaşımda iken de zifaf'a girdi)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3481,
			"arabicnumber": "1422.03",
			"text": "Bize Abd b. Humeyd rivayet etti. (Dediki): Bize Abdürrezzâk haber verdi. (Dediki): Ma'mer, Zührî'den, o da Urve'den, o da Âişe'den naklen haber verdi ki, Peygamber (Sallallahu Aleyhi ve Sellem) kendisini yedi yaşında iken nikâh etmiş dokuz yaşında iken de zifaf yapılmış (oyuncak) bebekleri beraberinde imiş. On sekiz yaşında iken de Resulullah {Sallallahu Aleyhi ve Sellem) vefat etmiş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3482,
			"arabicnumber": "1422.04",
			"text": "Bize Yahya b, Yahya ile ishak b. ibrahim, Ebu Bekir b. Ebî Şeybe ve Ebu Kureyb rivayet ettiler. Yahya ile ishak (Bize haber verdi) tâbirini kullandılar. Ötekiler: Bize Ebu Muâviye, A'meş'den, o da ibrahim'den, o da Esved'den, o da Âişe'den naklen rivayet etti; dediler. Âişe Resulullah (Sallallahu Aleyhi ve Sellem) ile altı yaşında iken evlendiğini; dokuz yaşında iken zifaf edildiğini, onsekiz yaşında iken de Resululiah (Sallallahu Aleyhi ve Sellem)'in vefat ettiğini söylemiş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3483,
			"arabicnumber": "1423.01",
			"text": "Bize Ebu Bekr b. Ebi Şeybe ile Züheyr b. Harb rivayet ettiler. Lâfız Züheyr'indir. (Dedilerki): Bize Vekî' rivayet etti. (Dediki); Bize Süfyân, ismail b. Ümeyye'den. o da Abdullah b. Urve'den, o da Urve'den, o da Âişe'den naklen rivayet eyledi. Âişe şöyle demiş: «Resulullah (Sallallahu Aleyhi ve Sellem) benimle Şevvâl'de nikahlandı ve (yine) Şevvâl'de zifaf oldu. Binâenaleyh Resulullah (Sallallahu Aleyhi ve Sellem)'in kadınlarından hangisi onun indinde benden daha bahtlı olabilirdi?» . Uve demişki: «Âişe akrabası kadınları Şevvâl'de zifaf etmeyi severdi.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3484,
			"arabicnumber": "1423.02",
			"text": "{…} Bize bu hadîsi ibni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Süfyân bu isnadla rivayette bulundu. Ama Âişe'nin fiilini söylemedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3485,
			"arabicnumber": "1424.01",
			"text": "Bize ibni Ebî Ömer rivayet etti. (Dediki): Bize Süfyan, Yezîd b. Keysan'dan, o da Ebu Hâzim'den, o da Ebu Hureyre'den naklen rivayet etti. Ebu Hureyre şöyle demiş : Nebi (Sallallahu Aleyhi ve Sellem)'in yanındaydım. Ona bir adam gelerek kendisinin Ensar'dan bir kadınla evlenmek istediğini haber verdi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Selleın) kendisine: — «O kadına baktın mı?» diye sordu. Gelen zkt: — «Hayır!» dedi. Resulullah (Sallallahu Aleyhi ve Sellem): — «Öyle ise git de ona bir bak! Çünkü Ensarın gözlerinde bir şey vardır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3486,
			"arabicnumber": "1424.02",
			"text": "Bana Yahya b. Main rivayet etti. (Dediki): Bize Mervân b. Muâviyete'l-Fezârî rivayet etti. (Dediki): Bize Yezîd b. Keysân, Ebu Hâzim'den. o da Eb» Hureyre'den naklen rivayet eyledi. (Şöyle demiş) : Bir adam Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: — Ben ensardan bir kadınla evlendim; dedi. Bunun üzerine Peygamber (Sallallahu Aleyhi ve Sellem) kendisine: — «O kadın'a baktın mı? Zira Ensâr'ın gözlerinde bir şey vardır.» diye sordu. O zât: — Kadına baktım; dedi.Resulullah (Sallallahu Aleyhi ve Sellem) : — «Onu kaç'a nikahladın?» dedi. Adam: — Dört okiyye'ye; cevabını verdi. Nebi (Sallallahu Aleyhi ve Sellem): — «Dört okiyye'ye mî? Siz galiba gümüşü şu dağın cephesinden yontuyorsunuz. Bizde sana verecek bir şey yok. Lâkin belki seni bir ordu ile göndeririz de ondan ganimet alırsın.» buyurdu. Az sonra Benî Abs kabilesine bir ordu gönderdi, Ordu ile beraber bu adamı da yolladı",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3487,
			"arabicnumber": "1425.01",
			"text": "Bize Kuteybetü'bnu Saîd Es-Sakafî rivayet etti. (Dediki): Bize Yakub yâni ibni Abdirrahman Eî-Kaarî; Ebu Hâzim'den, o da Sehl b. Sa'd'dan naklen rivayet eyledi. H. Bize bu hadîsi yine Kuteybe rivayet etti. (Dediki): Bize Abdulaziz b. Ebî Hâzim babasından, o da Sehi b. Sa'd Es-Sâidî'den naklen rivayet etti. Sehl şöyle demiş : Bir kadın Resulullah (Sallallahu Aleyhi ve Sellem)'e gelerek : — Yâ Resulallah! Kendimi sana hibe etmeye geldim; dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) kadına bakarak onu tepeden tırnağa süzdü. Sonra başını eğdi. Kadın kendi hakkında bir hüküm vermediğini görünce oturdu. Derken Resulullah (Sallallahu Aleyhi ve Sellem)'in ashabından bir zât kalkarak : — Yâ Resulallah! Eğer senin bu kadına bir ihtiyacın yoksa, onu benimle evlendiriver! dedi. Resulullah (Sallallahu Aleyhi ve Sellem) : — «Sende (verecek) bir şey var rm?» diye sordu. O zât: — Yok vallahi ya Resulallah! dedi. Resulullah (Sallallahu Aleyhi ve Sellem) : — «Sen evine git de bir şey bulabilecek misin bak» buyurdu. Bunun üzerine o zât gitti. Sonra dönerek: — Yok vallahi! Hiç bir şey bulamadım, dedi. Resulullah (Sallallahu Aleyhi ve Sellem) : — «Demirden bir yüzük olsun (bulmaya) bak!» dedi. O zât yine gitti. Sonra dönerek; yok vallahi yâ Resulallah! Demirden bir yüzük de bulamadım. Lâkin işte kaftanım (Râvi Sehl malı bir kaftandan ibaretti, demiş). Bunun yarısı kadının olsun, dedi. Resulullah (Sallallahu Aleyhi ve Sellem) : — «Senin kaftanını ne yapsın? Onu sen giymiş olsan, kadının üzerinde bir şey kalmıyacak; kadın giyse senin üzerinde ondan bir şey kalmıyacak!» buyurdular. Bunun üzerine o zat oturdu. Bir hayli oturduktan sonra kalktı. Dönüp giderken Resulullah (Sallallahu Aleyhi ve Sellem) onu görerek çağrılmasını emir buyurdu. Adamı çağırdılar. Geldiği vakit Resulullah (Sallallahu Aleyhi ve Sellem) : — «Ezberinde Kur'ân'dan neler var?» diye sordu. O zât: — Filân ve filân sureler ezberimdedir; diyerek (bildiği) sureleri saydı. Resulullah (Sallallahu Aleyhi ve Sellem): — «Onları ezberden okuyabilir misin?» dedi. O zât: — Evet! cevâbını verdi. Resulullah (Sallallahu Aleyhi ve Sellem) : — «Haydi git! Kadın sana ezber bildiğin Kur'ân ile temlik olundu.» buyurdular. Bu hadîs ibni Ebî Hâzim'indir. Lâfız itibariyle Yâkub'un rivayeti dahî buna yakındır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3488,
			"arabicnumber": "1425.02",
			"text": "Bize bu hadîsi Halef b. Hişam dahi rivayet etti. (Dediki): Bize Hammâd b. Zeyd rivayet eyledi. H. Bana bu hadîsi Zuheyr b. Harb de rivayet etti. (Dediki): Bize Süfyân b. Uyeyne rivayet etti. H. Bize ishâk b. ibrahim de, Derâverdî'den rivayet etti. H. Bize Ebu Bekir b. Ebî Şeybe dahi rivayet etti. (Dediki); Bize Hüseyin b. Aliyy, Zâide'den rivayet eyledi. Bu râvilerin, hepsi Ebu Hâzim'-den, o da Sehl b. Ebî Sa'd'dan naklen birbirlerinden fazla olmak üzere rivayette bulunmuşlardır. Şu kadar var ki, Zâide hadîsinde: «Haydi git! Onu sana tezvic ettim. Ona Kur'ân öğret! buyurdu.» ifâdesi vardır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3489,
			"arabicnumber": "1426",
			"text": "Bize ishâk b. ibrâhîm rivayet etti. (Dediki: Bize Abdülâzîz b. Muhammed haber verdi. (Dediki): Bana Yezîd b. Abdillâh b. Üsâmete'bni'î-Hâd rivayet etti. H. Bana Muhammed b. Ebî Ömer el-Mekkî de rivayet etti. Bu lâfız onundur. (Dediki): Bize Abdülâzîz, Yezîd'den, o da Muhammed b. ibrahim'den, o da Ebu Selemete'bnü Ahdirrahmân'dan naklen rivayet eyledi, ki şöyle demiş : Nebi (Sallallahu Aleyhi ve Sellem)'în zevcesi Aişe'ye: Resulullah (Sallallahu Aleyhi ve Sellem)'in mehri ne kadardı? diye sordum. Âişe : — Onun zevcelerine (verdiği) mehri on iki okiyye i!e bir neşş idi. Neşş nedir bilir misin? dedi. Ben : — Hayır, cevâbını verdim. — Yarın okiyyedir. Bunların mecmu'u beşyüz dirhem eder; işte Resulullah (Sallallahu Aleyhi ve Sellem)'in zevcelerine (verdiği) mehri bundan ibaretti; dedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3490,
			"arabicnumber": "1427.01",
			"text": "Bize Yahya b. Yahya et-Temîmî ile Ebu'r-Rabî' Süleyman b. Dâvud el-Atekî ve Kuteybetu'bnu Soîd rivayet ettiler. Lâfız Yahya'nındır. Yahya (bize haber verdi) tâbirini kullandı. Ötekiler: Bize Hammâd b. Zeyd Sâbit'den, o da Enes b. Mâlik'den naklen rivayet etti; dediler. Nebi (Sallallahu Aleyhi ve Sellem) Abdurrahmân b. Avf'in üzerinde sarı renk eseri görerek : — «Bu ne?» diye sormuş. Abdurrahmân : — Yâ Resulâîlah! Ben bir nevât altın mikdarı mehir vererek bir kadınla evlendim; demiş. Resulullah (Sallallahu Aleyhi ve Sellem): — «Öyîe ise Allah sana mübarek eylesin! Bir koyunla bile olsa da'vet yap!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3491,
			"arabicnumber": "1427.02",
			"text": "Bize Muhammed b. Ubeyd el-Guberi rivayet etti. (Dediki) Bize Ebu Avâne, Katâde'den, o da Enes b. Mâlik'den naklen rivayet eyledi ki, Abdurrahmân b. Avf, Resulullah (Sallallahu Aleyhi ve Sellem) devrinde bir nevât ağırlığı altın mehir vererek evlenmiş de, Resulullah ona : — «Bîr koyunla bile olsa davet yap!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3492,
			"arabicnumber": "1427.03",
			"text": "Bize ishâk b. ibrahim rivayet etti. (Dediki): Bize Vekî' haber verdi, (Dediki): Bize Şu'be, Katâde ile Humey'den, onlar da Enes'den nakletmiş olmak üzere rivayet etti ki, Abdurrahmân b. Avf bîr nevât ağırlığı altın mehir vererek bir kadınla evlenmiş; Nebi (Sallallahu Aleyhi ve Sellem) ona : — «Bir koyunla bile olsa da'vet yap!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3493,
			"arabicnumber": "1427.04",
			"text": "{…} Bize bu hadîsi Muhammed b. el-Müsennâ da rivayet etti. (Dediki): Bize Ebu Dâvud rivayet eyledi. H. Bize Muhammed b. Râfi' ile Hârun b. Abdillâh da rivayet ettiler. (Dedilerki): Bize Vehb b. Cerir rivayet eyledi. H. Bize Ahıned b. Hirâş dahî rivayet etti. (Dediki): Bize Şebâbe rivayet etti. Bunların hepsi Şu'be'den, o da Humeyd'den bu isnâdla rivayette bulunmuşlardır. Yalnız Vehb hadisinde râvi şöyle demiştir : «Abdurrahman: Bir kadınla evlendim; dedi.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3494,
			"arabicnumber": "1427.05",
			"text": "Bize ishâk b. ibrahim ile Muhammed b. Kudâme rivayet ettiler. (Dedilerki): Bize Nadr b. Şümeyl haber verdi. (Dediki): Bize Şu'be rivayet etti. (Dediki): Bize Abdüiâzîz b. Suheyb rivayet eyledi. (Dediki): Enes'i şunu söylerken işittim. Ahdurrahman b. Avf (Dediki): Beni Resulullah (Sallallahu Aleyhi ve Sellem) gördü. Üzerimde dâmadlık sevinci vardı. Bunun üzerine : — Ben Ensâr'dan bir kadınla evlendim; dedim. Nebi (Sallallahu Aleyhi ve Sellem) : — «Ona ne kadar mehir verdin.» diye sordu. — «Bir nevât,» cevâbını verdim. ishâk'ın hadîsinde : «Altından» kaydı vardır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3495,
			"arabicnumber": "1427.06",
			"text": "Bize ibnu'l-Müsennâ rivayet etti. (Dediki): Bize Ebu Dâvud rivayet etti. (Dediki): Bize Şu'be, Ebu Hamza'dan rivayet eyledi. Şu'be: Ebu Hamza'nın ismi Abdurrahmân b. Ebî Abdillâh'dır; demiş.) Ebu Hamza da Enes b. Mâlik'den naklen rivayet etmiş ki, Abdurrahmân (b. Avf) bir nevât ağırlığı altm mehir vererek bir kadınla evlenmiş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3496,
			"arabicnumber": "1427.07",
			"text": "{…} Bana bu hadîsi Muhammed b. Râfi' de rivayet etti. (Dediki): Bize Vehb rivayet etti. (Dediki): Bize Şu'be bu isnadla haber verdi. Ancak o şöyle dedi: «Bunun üzerine Abdurrahman b. Avfın torunlarından bir zât : Altından dedi.» İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3497,
			"arabicnumber": "1365.03",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize ismail yâni ibni Uleyye, Abdülaziz'den, o da Enes'den naklen rivayet etti ki. Resulullah (Sailallahu Aleyhi've Sellem) Hayber gazasını yapmış. Enes demiş ki: Sabah namazını alaca karanlıkta Hayber'de kıldık. Müteakiben Peygamber (Sallallahu Aleyhi ve Sellem) ile Ebu Talha hayvanlarına bindiler. Ben Ebu Talha'nın terkisinde idim. Derken Nebiyyullah (Sallallahu Aleyhi ve. Sellem) hayvanını Hayber yoluna doğru sürdü. Benim dizim Nebiyyullâh (Sallallahu Aleyhi ve Sellem)'in uyluğuna dokunuyordu. Uyluğundan elbisesi açıldı. Ben Nebiyyullah (Sallallahu Aleyhi ve Sellem)'în uyluğunun beyazını iyiden iyiye gördüm. Şehre girdiği vakit : — «Allah her şeyden büyüktür. Hayber harabdır. Biz bir kavmin beldesine indik mi tehdid edilenlerin sabahı kötü olur, buyurdu. Bunu üç defa tekrarladı. Ahâli işlerine çıkmışlardı. (Bizi görünce) : — Vallahi Muhammed, dediler. Râvi Abdülâziz: «Arkadaşlarımızdan bâzıları da ordu ile Muhammed dediler.» şeklinde rivayet etmiştir. Enes (Radiyallalıu anh) (sözüne devamla) şunları söylemiş: «Hayber'i kahren aldık. Esirler toplandı, derken Dihye gelerek: Ya Resulallah! Bana esirlerden bir carîye ver, dedi. Resulullah (Sallallahu Aleyhi ve Sellem): — «Git bir carîye al!» buyurdu. O da Safiyye b. Huyeyy'i aldı. Bunun üzerine Nebiyyullah (Sallallahu Aleyhi ve Sellem)'e bir adam gelerek: — Yâ Nebiyyaüah! Dihye'ye Kurayza ile Nâdîr'in reisi Huyeyy'in kızı Safiyye'yi mi verdin? O ancak sana yaraşır; dedi. ResuIullah (Sallallahu Aleyhi ve Sellem): — «Onu Safiye iie birlikte çağırın!» buyurdu. Müteakiben Dihye Safiyye'yi getirdi. Nebi (Sallallahu Aleyhi ve Sellem) Safiyye'yi görünce : — «Sen esirlerden bundan başka bir cariye al! buyurdu. Ve Safiyye'yi âzad ederek onunla evlendi. Sâbit. Enes'e : Ey Ebu Hamza! Resulullah (Sallallahu Aleyhi ve Sellem) ona mehir olarak ne verdi? diye sormuş. Enes (Radiyallahu anh} şu cevâbı vermiş : — Safiyye'nin nefsini (verdi) onu azâd etti. Ve kendisi ile evlendi. Hattâ yolda giderken Safiyye'yi Resulullah (Sallallahu Aleyhi ve Sellem)'e (annem) Ünımü Süleym hazırladı ve geceleyin ona zifaf eyledi. Böylece Nebi (Sallallahu Aleyhi ve Sellem) damad olarak sabahladı. Sonra: — «Kimin yanında bir şey varsa onu getirsin!» buyurdu. Ve yere deriden bir yaygı serdi. Artık öteki kuru süt, beriki kuru hurma, kimisi yağ getiriyordu. Derken hurma karıştırması yaptılar. Bu da ResuluIIah (Sallallahu Aleyhi ve Sellem)'in düğün daveti oldu",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3498,
			"arabicnumber": "1365.04",
			"text": "Bana Ebu'r-Rabî'Ez-Zehrânî rivayet etti. (Dediki): Bize Hammâd yâni îbni Zeyd, Sabit ile Abdulaziz b. Suheyb'den, onlar da Enes'den naklen rivayet etti. H. Bize bu hadîsi Kuteybetü'bnu Saîd dahi rivayet etti. (Dediki): Bize Hammâd yâni îbni Zeyd, Sabit ile Şuayb b. Hab Hâb'dan, onlar da Enes'den nakîen rivayet eyledi. H. Bize Kuteybe de rivayet etti. (Dediki): Bize Ebu Avâne, Katâde ile Abdulaziz'den, onlar da Enes'den naklen rivayet etti. H. Bize Muhammed b. Ubeyd El-Guberî de rivayet etti. (Dediki): Bize Ebu Avâne, Ebu Osman'dan, o da Enes'den naklen rivayet eyledi. H. Bana Züheyr b. Harb dahi rivayet etti. (Dediki): Bize Muâz b. Hişâm rivayet etti. (Dediki): Bana babam, Şuayb Habhâb'dan, o 'da Enes'den naklen rivayet eyledi. H. Bana Muhammed b. Rafi'de rivayet etti. (Dediki): Bize Yahya b. Âdem ile Ömer b. Sa'd ve Abdurrezzak toptan Süfyan'dan, o da Yunus b. Ubey'den, o da Şuayb b. Habhâb'dan, o da Enes'den naklen rivayet ettiler. Bu râvilerin her biri Nebi (Sallallahu Aleyhi ve Sellem)'den naklen onun Safiyye'yi azâd ettiğini ve azâd buyurmasını, ona mehir yaptığını rivayet etmişlerdir. Muâz'ın babasından rivayet ettiği hadîste; «Resulullah (Sallallahu Aleyhi ve Sellem) Safiyye ile evlendi de azâd buyurmasını ona mehir yaptı.» ifâdesi vardır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3500,
			"arabicnumber": "1365.05",
			"text": "Bize Ebu Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Affân rivayet etti. (Dediki): Bize Hammâd b. Seleme rivayet etti. (Dediki): Bize Sabit, Enes'den naklen rivayet eyledi. Enes şöyle elemiş: Hayber günü ben Ebu Talha'nın terkisinde idim. Ayağım Resulullah (Sallallahu Aleyhi ve Sellem)'in ayağına dokunuyordu. Hayberliler'in yanına güneş doğarken vardık. Hayvanlarını çıkarmışlar (kendileri de) baltaları, zenbilleri ve kürekleriyle dışarı çıkmışlardı. (Bizi görünce: Vay) Muhammed ile ordusu!., dediler. Resulullah (Sallallahu Aleyhi ve Sellem): «Hayber harabdır! Biz bir kavmin beldesine indikmi tehdit edilenlerin sabahı kötü olur» buyurdular. Allah Azze ve Celle Hayberliler'i hezimete uğrattı. Dihye'nin hissesine güzel bir cariye düştü. Müteakiben Resulullah (Sallallahu Aleyhi ve Sellem) onu beş kişi mukabilinde satın aldı. Sonra çekip çevirmek ve hazırlamak (Râvi demişki: Zannederim Enes şunu da söyledi) ve evinde istibra yapmak için onu Ümmü Süleym'e verdi. Bu câriye Safîyye bihti Huyeyy idi. Resulullah {Sallallahu Aleyhi ve Sellem) onun düğün davetini kuru hurma, kuru süt ve yağ ile yaptı. Yer bir parça kazılarak düzeltildi; deri yaygılar getirilerek oraya yayıldı. Ve kuru süt ile yağ getirildi Halkın karnı doydu. Cemaat (birbirlerine): Bilmiyoruz acaba Resulullah (Sallallahu Aleyhi ve Sellem) bu kadınla evlendi mi, yoksa onu Ümmü veled mi yaptı? Şayet onu örttü ise, bu cariye onun karısı olmuştur. Örtmedi ise, cariye Ümmü veleddir; dediler. Resulullah (Sallallahu Aleyhi ve Sellem) hayvanına binmek isteyince Safiyye'yi örttü. Safiyye devenin arka tarafına oturdu. Cemaat da anladılar ki, Resulullah (Sallallahu Aleyhi ve Sellem) onunla evlenmiş Medine'ye yaklaştıkları vakit Resulullah (Sallallahu Aleyhi ve Sellem) hayvanını sürdü. Biz de hayvanlarımızı sürdük. Derken (Adbâ) yirik kulak deve süredü. Ve hem Resulullah (Sallallahu Aleyhi ve Sellem) hem de Safiyye yere düştüler. Resulullah (Sallallahu Aleyhi ve Sellem) hemen kalkarak Safiyye'yi örttü. Kadınlar bunu görmüşlerdi Allah yahudi kadınını ırak eylesin, dediler. Râvi demişki: Ben (Enes'e) ya Ebâ Hamza! Resulullah (Sallallahu Aleyhi ve Sellem) düştü mü? diye sordum, Enes: — îyvallah! Hakikaten düşdü; cevâbını verdi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3501,
			"arabicnumber": "1365.06",
			"text": "Bize Ebu Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Şebâbe rivayet etti. (Dedikî): Bize Süleyman, Sâbit'ten, o da Enes'âen naklen rivayet eyledi. H. Bana bu hadîsi Abdullah b. Hâşim b. Hayyân da rivayet etti. Lâfız onundur. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Süleyman b. Muğira, Sâbit'ten rivayet etti. (Demişki): Bize Enes rivayet eyledi. (Dediki): Safiyye taksimde Dihye'ye düştü. Cemaat onu Resulullah (Sallallahu Aleyhi ve Sellem)'in yanında medh etmeye ve: Esirler içinde onun gibisini görmedik, demeye başladılar. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) Dihye'ye haber gönderdi. Ve Safiyye'ye bedel ne isterse verdi. Sonra Safiyye'yi anneme teslim ederek : «Bunu çek çevir!» buyurdu. Bilâhare Resulullah (Sallallahu Aleyhi ve Sellem) Hayber'den çıktı. Hayber'i arkasında bıraktığı vakit konakladı. (Sallallahu Aleyhi ve Sellem): Sonra Safiyye'nin üzerine çadır kurdu. Sabaha çıkınca Resulullah (Sallallahu Aleyhi ve Sellem): «Kimin yanında fazla yiyecek varsa onu bize getirsin!» buyurdular. Artık kimi hurmanın, kimi kavrulmuş unun fazlasını getirmeye başladılar. Hattâ bundan bir karıştırma yığını yaptılar. Ve bu karıştırmadan yemeğe, yanıbaşlarındaki yağmur suyundan birikmiş havuzlardan da su içmeye başladılar. Sabit demiş ki: Müteakiben Enes şunu söyledi: işte bu Resulullah (Sallallahu Aleyhi ve Sellem)'in Safiyye için düğün daveti oldu. Sonra yola revan olduk. Medine'nin duvarlarını görünce ona olan iştiyakımız arttı da hayvanlarımızı sürdük. Resulullah (Sallallahu Aleyhi ve Sellem) de hayvanını sürdü. Safiyye arkasindaydı. Resulullah (Sallallahu Aleyhi ve Sellem) onu terkisine almıştı. Derken Resulullah (Sallallahu Aleyhi ve Sellem)'in hayvanı sürçtü. Ve hem kendisi hem Safiyye yere düştüler. Halkdan ne Peygamber (Sallallahu Aleyhi ve Sellem)'e, ne de Safıyye'ye bakan hiç bir kimse yoktu. Nihayet Resulullah (Sallallahu Aleyhi ve Sellem) kalkdı da Safiyye'yi örttü. Müteakiben biz yanına geldik. (Bize) : «Bîr şeyimiz yok!» dedi. Az sonra Medine'ye girdik. Hemen Medine'nin genç kadınları dışarı çıktılar. Safiyye'yi birbirlerine gösteriyor. Onun yere düşmesine seviniyorlardı",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3502,
			"arabicnumber": "1428.01",
			"text": "{…} Enes demişki : Ben Zeyneb'in düğün davetinde de bulundum. Resulullah (Sallallahu Aleyhi ve Sellem) halkı ekmek ve etle doyurdu. Beni cemâati çağırmak için gönderiyordu. Bu iş bitince Resulullah (Sallallahu Aleyhi ve Sellem) kalktı. Ben de kendisini takib ettim. (Davetlilerden) iki kişi muhabbete dalmış dışarı çıkmamışlardı. Resulullah (Sallallahu Aleyhi ve Sellem) kadınlarının yanına uğruyor, her birine selâm vererek : — «Selâm sîze! Nasılsınız ey ehl-i beyt?» diyor, onlar da: ----iyiyiz yâ Resulallah! Aileni nasıl buldun? diye soruyorlardı. Resulullah (Sallallahu Aleyhi ve Sellem) «iyi buldum!» diyordu. Bu işi bitirdikten sonra geri döndü. Ben de onunla beraber döndüm. Kapıya varınca baktı ki, o iki adam hâlâ orada... Muhabbete dalmışlar. Onun döndüğünü görünce kalkıp çıktılar. Vallahi bu adamların çıktıklarını ona benmi haber verdim yoksa bu hususta vahi mi indi bilmiyorum. Hâsılı Peygamber (Sallallahu Aleyhi ve Sellem) döndü. Ben de onunla beraber döndüm. Ayağını kapının eşiğine koyunca benimle kendisi arasına perde çekti. Allah Teâlâ da şu âyeti indirdi : «Nebiin evlerine gitmeyin! Meğerki size izin verilmiş ola!., [ Ahzab 53]",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3503,
			"arabicnumber": "1428.02",
			"text": "Bize Muhammed b. Hatim b. Meyraun rivayet etti. (Dediki): Bize Behz rivayet etti. H. Bana Muhammed b. Rafi' de rivayet etti. (Dediki): Bize Ebu'n-Nadr Hâşim b. Kasım rivayet eyledi. Behz ile Hâşim ikisi birden demişlerki : Bize Süleyman b. Muğira, Sabit'ten, o da Enes'den naklen rivayet eyledi. Bu hadîs Behz'indir. (Demişki): Zeyneb'in iddeti bitince Resulullah (Sallallahu Aleyhi ve Sellem) Zeyd'e : «Onu bana iste!» buyurmuş. Zeyd gitmiş. Zeyneb'e vardığında onu hamurunu mayalarken bulmuş. Zeyd şöyle demiş: Zeyneb'i görünce kalbimde büyüdü. Hattâ Resulullah (Sallallahu Aleyhi ve Sellem) kendisini istedi diye yüzüne bile bakamadım da ona sırtımı çevirdim. Ve ters döndüm. Sonra : — Yâ Zeyneb! (Beni) Resulullah (Sallallahu Aleyhi ve Sellem) seni istemeye gönderdi, dedim. Zeyneb : — Rabbimden emir almadıkça ben bir şey yapamam, diyerek kalktı namazgahına gitti ve Kur'ân indi. Resulullah (Sallallahu Aleyhi ve Sellem) gelerek Zeyneb'in yanına izinsiz girdi. Vallahi öyle halimizi gördüm ki, Resulullah (Sallallahu Aleyhi ve Sellem) güneş yükseldiği zaman bîze ekmek ve et yedirdi. Müteakiben halk dışarı çıktı. Yemekten sonra evde birkaç kişi kalmış konuşuyorlardı. Derken Resulullah (Sallallahu Aleyhi ve Sellem) de çıktı. Ben kendisini takib ettim. Kadınlarının hücrelerini dolaşarak onlara selâm veriyor, onlar da kendisine : — Yâ Resulallah! Aileni nasıl buldun? diye soruyorlardı. Bilmiyorum cemâatin evden çıktıklarını ben mi ona haber verdim; yoksa o mu bana haber verdi. Bunun üzerine giderek eve girdi. Ben de onunla beraber girmek üzere gittim. Ama benimle kendi arasına perde çekti ve tesettür âyeti indi. Halka (bu âyetlerde) alabildiğine vaz edildi. ibni Râfi' kendi hadîsinde: «Allah hakkı söylemekten utanmaz» âyet-i kerîmesine kadar şu âyeti ziyade etti: «Nebiin hanelerine girmeyin! Meğerki size pişmesini beklememek şartıyla yemeğe kalmaya izin verilmiş ola.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3504,
			"arabicnumber": "1428.03",
			"text": "Bize Ebu'r-Ram' Ez-Zehrâni ile Ebu Kâmil Fudayl b. Hüseyin ve Kuteybetü'bnu Saîd rivayet ettiler. (Dedilerki): Bize Hammâd yâni ibni Zeyd, Sabit'ten, o da Enes'den naklen rivayet eyledi. (Ebu Kâmil'in rivayetinde: Enes'den işittim ifadesi vardır.) Enes şöyle demiş: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'in kadınlarından hiç birine Zeyneb için yaptığı kadar düğün daveti yaptığını görmedim. Çünkü (o davette) bir koyun kesmişti. Ebu Kâmil: (Kadınlarından hiç birine) ifâdesinin yerine (hiç bir şeye) tâbirini kullanmıştır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3505,
			"arabicnumber": "1428.04",
			"text": "Bize Muhammed b. Amr b. Abbâd b. Cebele b. Ebi Revvâd ile Muhammed b. Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed yâni ibni Ca'fer rivayet etti. (Dediki): Bize Şu'be, Abdülaziz b. Suhayb'den rivayet eyledi. (Demişki): Ben Enes b. Mâlik'i şunu söylerken işittim: «Resulullah (Sallallahu Aleyhi ve Sellem) kadınlarından hiç biri için, Zeyneb'e yaptığı düğün davetinden daha çok yahut daha üstün davet yapmamıştır.» Sâbit-i Bünânî, Enes'e: «Ney ile davet yaptı?» diye sormuş. Enes (Radiyallahu anh): Davetlilere ekmek ve et yedirdi. Hatta (bitiremedilerde) bıraktılar bile demiş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3506,
			"arabicnumber": "1428.05",
			"text": "Bize Yahya b. Habîb El-Hârisi ile Âsim b. Nadr El-Teymî ve Muhammed b. Abdilâlâ hep birden Mu'temir'den rivayet ettiler. Lâfız ibni Habib'indir. (Dediki): Bize Mu'temir b. Süleyman rivayet etti. (Dediki): Ben babamdan işittim. (Dediki): Bize Ebu Rîiclez, Enes b. Mâlik'den naklen rivayet eyledi. Enes şöyle demiş : «Nebi (Sallallahu Aleyhi ve Sellem), Zeyneb binti Cahş ile evlendiği vakit cemaatı davet etti de yemek yediler. Sonra oturup sohbet ettiler. Resulullah (Sallallahu Aleyhi ve Sellem) sanki kalkmağa hazırlanırmış gibi yaptı, fakat cemaat kalkmadılar, Bımu görünce Resulullah (Sallallahu Aleyhi ve Sellem) kalktı O kalkınca cemaatdan bazıları da kalktılar.» Âsim ile ibni Abdilâlâ kendi hadîslerinde «Üç kişi oturup kaldılar.» demişlerdir. «Nebi (Sallallahu Aleyhi ve Sellem) içeriye girmek için geldi. Bir de baktı ki, cemaat oturuyorlar. Sonra onlar da kalkıp gittiler. Ben Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek cemaatın gittiklerini haber verdim. Bunun üzerine geldi ve içeri girdi. Ben de içeriye girmeye hazırlandım ama Resulullah (Sallallahu Aleyhi ve Sellem) kendisi ile benim arama perdeyi çekti. Allah (Azze ve- Celle) hazretleri de; (Ey îman edenler! Nebiin hanelerine girmeyin. Meğer ki size pişmesini beklememek şarfıyle yemeğe kalmaya izin verilmiş ola!) âyet-i kerîmesini (Şüphesiz ki, böyle yapmamz Allah indinde büyük günahdır.) kavli kerimine kadar inzal buyurdu",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3507,
			"arabicnumber": "1428.06",
			"text": "Bana Amru'n-Nâkid rivayet etti. (Dediki): Bize Yâkub b. ibrahim b. Sâd rivayet eyledi. (Dediki): Bize babam, Salih'ten rivayet etti. ibni Şihâb demiş ki, Enes b. Mâlik şunu söyledi: «Ben tesettür (hicab) âyetinin sebebi nüzulünü en iyi bilen bir insanım. Ubeyyü'bnü Ka'b onu bana soruyordu. Resulullah (Sallallahu Aleyhi ve Sellem) Zeyneb binti Cahş'a zifafa girerek sabahladı. Onunla Medine'de evlenmişti. Güneş yükseldikten sonra halkı yemeğe davet etti. Resulullah (Sallallahu Aleyhi ve Sellem) oturmuştu. Cemaat kalkıp gittikten sonra bir takım adamlar onunla beraber oturup kaldılar. Nihayet Resulullalı (Sallallahu Aleyhi ve Sellem) kalkarak yürüdü. Onunla beraber ben de yürüdüm. Hattâ Aişe'nin hücresi kapısına kadar vardı. Sonra kalan cemaatın çıktıklarını tahmin ederek geri döndü. Onunla birlikte ben de döndüm. Bir de baktı ki cemaat hâlâ yerlerinde oturuyorlar. Bunun üzerine tekrar döndü. Ben de döndüm. Aişe'nin hücresine kadar vardı. Ve yine geri döndü. Ben de döndüm. Bir de baktık cemaat kalkıp gitmişler. Müteakiben ResuluIIah (Sallallahu Aleyhi ve Sellem) benimle kendisi arasına perde çekti. Allah Teâlâ da tesettür (hicab) âyetini indirdi.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3508,
			"arabicnumber": "1428.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3509,
			"arabicnumber": "1429.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, Nâfi'den dinlediğim, onun da ibni Ömer'den naklen rivayet ettiği şu hadîsi okudum. ibni Ömer (Demişki): Resulullah (Sallallahu Aleyhi ve Sellem): «Biriniz davet'e çağırılırsa hemen ona gitsin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3510,
			"arabicnumber": "1429.02",
			"text": "Bize Muhammed b. El-Müsennâ rivayet etti. (Dediki): Bize Halid b. Haris, Ubeydullah'dan, o da Nâfi'den, o da ibni Ömer'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti kî: «Biriniz davete çağırılırsa hemen icabet etsin!» buyurmuşlar. Hâlid demiş ki: «Bir de baktım Ubeydullah bu icabeti düğün dâvetine hamlediyor.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3511,
			"arabicnumber": "1429.03",
			"text": "Bize îbni Numeyr rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Ubeydullah, Nâfi'den, o da ibni Ömer'den naklen rivayet eyledi ki, Nebi (Sallallahu Aleyhi ve Sellem): «Biriniz bir düğün davetine çağrılırsa hemen icabet etsin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3512,
			"arabicnumber": "1429.04",
			"text": "Bana Ebu'r-Rabi' ile Ebu Kâmil rivayet ettiler. (Dedilerki): Bize Hammad rivayet etti. (Dediki): Bize Eyyub rivayet etti. H. Bize Kuteybe de rivayet etti. (Dediki): Bize Hammâd, Eyyub'dan. o da Nâfi'den, o da ibni Ömer'den naklen rivayet etti. Şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem): Çağrıldığınız zaman davete gidin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3513,
			"arabicnumber": "1429.05",
			"text": "Bana Muhammed b. Rafi' rivayet etti. (Dediki): Bize Abdurrezzak rivayet etti. (Dediki): Bize Ma'mer, Eyyub'dan, o da Nâfi'den, naklen haber verdi ki, ibni Ömer, Nebi (Sallallahu Aleyhi ve Sellem)'den naklen şunu söylüyormuş: «Bîriniz düğün davetine olsun veya benzeri bir davet için olsun din kardeşini davet ederse hemen icabet eylesin!»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3514,
			"arabicnumber": "1429.06",
			"text": "Bana îshak b. Mensur rivayet etti. (Dediki): Bana isâ b. Munzir rivayet etti. (Dediki): Bize Bakiyye rivayet eyledi. (Dediki): Bize Zübeydî, Nafi'den, o da ibni Ömer'den naklen rivayette bulundu. ibni Ömer şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Bir kimse düğün davetine veya benzerî bir şeye çağrılırsa hemen icabet etsin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3515,
			"arabicnumber": "1429.07",
			"text": "Bana Humeyd b. Mes'adete'I-Bâhilî rivayet etti, (Dediki): Bize Bişr b. Mufaddal rivayet etti. (Dediki); Bize ismail b. Ümeyye, Nafi/den, o da Abdullah b. Ömer'den naklen rivayet eyledi. ibni Ömer şoyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Çağrıldığınız zaman davete gidin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3516,
			"arabicnumber": "1429.08",
			"text": "Bana Harun b. Abdillah rivayet etti.(Dediki): Bize Haccâc b. Muhammed, ibni Cüreyc'den rivayet etti. (Demişki): Bana Musa b. Ukbe, Nafi'den naklen haber verdi. (Demişki): Ben Abdullah b. Ömer'i şunu söylerken işittim: Resulullah (Sallallahu Aleyhi ve Sellem): «Çağrıldığınız taktirde bu davete icabet edin!» buyurdular. Kura'da olsa dahi. Nafi' demiş ki : «Abdullah b. Ömer düğünde olsun, düğünden başka bir hususta olsun davete gelirdi. Oruçlu iken dahi davete gelirdi.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3517,
			"arabicnumber": "1429.09",
			"text": "Bana Harmeletü'bnu Yahya rivayet etti. (Dediki): Bize îbni Vehb haber verdi. (Dediki): Bana Ömer b. Muhammed, Nafi'den, o da ibni Ömer den naklen rivayette bulundu ki, Nebi (Sallallahu Aleyhi ve Sellem) «Paça yemeğe çağrılırsanız hemen icabet edin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3518,
			"arabicnumber": "1430.01",
			"text": "Bize Muhammed b. El-Müsennâ rivayet etti. (Dediki): Bize Abdurrahman b. Mehdi rivayet etti. H. Bize Muhammed b. Abdillah b. Numeyr de rivayet etti. (Dediki): Bzei babam rivayet etti. Abdurrahman ile ibni Numeyr demişlerki: Bize Süfyan, Ebu'z-Zübeyr'den, o da Câbir'den nakieıı rivayet eyledi. Câbir şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) : «Biriniz bir yemeğe davet olunursa hemen icabet eylesin! Artık isterse yer, isterse yemez.» buyurdular. ibnul Müsennâ: «Yemeğe» kaydını zikretmedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3519,
			"arabicnumber": "1430.02",
			"text": "{…} Bize ibni Numeyr rivayet etti. (Dediki): Bize Ebu Âsim, îbni Cüreyc'den, o da Ebu'z-Zübeyr'den bu isnadla bu hadîsin mislini rivayet eyledi. İzah 1432 de",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3520,
			"arabicnumber": "1431",
			"text": "Bize Ebu Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Hafs b. Ğiyâs, Hişâm'dan, o da ibni Sîrîn'den, o da Ebu Hureyre'den naklen rivayet eyledi. Şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Biriniz çağrılırsa hemen davete icabet etsin. Şayet oruçlu bulunursa salât eylesin. Oruçsuz ise yesin!» buyurdular. İzah 1432 de",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3521,
			"arabicnumber": "1432.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, ibni Şihab'dan dinlediğim, onun da A'rac'dan, onun da Ebu Hureyre'den naklen rivayet ettiği şu hadîsi okudum. Ebu Hureyre : «Kendisine zenginler çağrılıp fakirler çağrılmayan davet yemeği ne kötü yemektir. Davete geîmiyen muhakkak Allah ve Resulüne isyan etmiştir.» Dermiş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3522,
			"arabicnumber": "1432.02",
			"text": "Bize îbni Ebî Ömer rivayet etti. (Dediki): Bize Süfyân rivayet etti. (Dediki): Zührî'ye : — Ey Ebu Bekir! Şu hadîs nasıldır? (Yemeğin en kötüsü zenginlerin yemeğidir.) dedim. Zührî güldü de: — Bu hadîs (yemeğin en kötüsü zenginlerin yemeğidir) şeklinde değildir, cevabını verdi. Süfyân demiş ki, babam zengindi. Bu hadisi işittiğim zaman beni ürküttü de onu Zührî'ye sordum. Zührî şunu söyledi: Bana Abdurrahman'ı A'rac rivayet etti. O da Ebu Hureyre'yi şöyle derken işitmiş: «Yemeğin en kötüsü davet yemeğidir...» sonra râvi hadîsi, Mâlik hadîsi tarzında zikretmiştir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3523,
			"arabicnumber": "1432.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3524,
			"arabicnumber": "1432.04",
			"text": "Bize ibni Ebî Ömer rivayet etti. (Dediki): Bize Süfyân rivayet etti. (Dediki): Ben Ziyad b. Sa'd-ı şunu söylerken işittim : Ben Sâbit-i, A'rac'ı Ebu Hureyre'den naklen rivayet ederken dinledim. Nebi (Sallallahu Aleyhi ve Sellem) : «Yemeğin en kötüsü gelene verilmeyen, gelmeyecek kimsenin çağrıldığı davet yemeğidir. Her kim davete icabet etmezse Allah ve Resulüne isyan etmiştir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3526,
			"arabicnumber": "1433.01",
			"text": "Bize Ebu Bekr b. Ebî Şeybe ile Amr b. Nakıd rivayet ettiler. Lafız Amr'ındır. (Dedilerki): Bize Süfyan, Zührî'den, o da Urve'den, o da Aişe'den naklen rivayet etiî. Aişe (Radiyallahu anha) şöyle demiş : Rifaa'nın karısı Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: Ben Rifaa'nın nikahında idim. Beni üç talakla boşadı da Abdurrahman b. Zebîr'le evlendim. Ama ondakini elbisenin saçağı gibi buldum; dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) gülümseyerek; «Rifaa'ya dönmek mi istiyorsun? Hayır, sen onun balcağızını, o da senin balcağızını tatmadıkça dönemezsin» buyurdu. Aişe (Radiyallahu anha) (Demişki): Ebu Bekir de ResuluIIah (Sallallahu Aleyhi ve Sellem)'in yanında idi. Halid ise kapıda kendisine izin verilmesini bekliyordu. Derken : Ya Eba Bekr! Bu kadının Resulullah (Sallallahu Aleyhi ve Sellem)'in huzurunda alenen ne konuştuğunu işitmiyor musun? dedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3527,
			"arabicnumber": "1433.02",
			"text": "Bana Ebu't-Tahir ile Harmeletü'bnu Yahya rivayet ettiler. Lafız Harmele'nindir. Ebu't-Tahir (Bize rivayet etti.) Harmele ise (Bize îbnî Vehb haber verdi) tabirlerini kullandılar. (ibni Vehb demiş ki): Bana Yunus, ibni Şihab'dan naklen haber verdi. (Demişki): Bana Urvetü'bnu Zübeyr rivayet etti. Ona da Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Aişe haber vermiş ki, Rifaatü'I-Kurazî karısını Üç talakla boşamiş da, kadın ondan sonra Abdurrahman b. Zebîr ile evlenmiş. Sonrasında kadın Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: Ya Resulallah, ben Rifaa'nın nikahı altında idim. Sonunda beni üç talakla boşadı; ben de ondan sonra Abdurrahman b. Zebîr ile evlendim. Ama hakikatte vallahi ondakini ancak elbisenin saçağı gibi buldum: demiş; ve çarşafından bir saçak koparmış. Bunun üzerine ResuluIIah (Sallallahu Aleyhi ve Sellem) gülerek tebessüm buyurmuş ve : «Galîba sen Rifaa'ya dönmek istiyorsun! Hayır, o senin balcağızını, sen de onun balcağızını tatmadıkça (dönemezsin)» buyurmuşlar, Ebu Bekir de ResuluIIah (Sallallahu Aleyhi ve Sellem)'in yanında oturuyormuş. Halid b. Saîd b. As ise hücrenin kapısında oturmakta imiş: (içerî girmek için) kendisine izin verilmemiş imiş. Bunun üzerine Halid Ebu Bekr'e: Bu kadını Resulullah (Sallallahu Aleyhi ve Sellem)'in huzurunda aşikare konuşmaktan men'etsen a! diye seslenmeğe başlamış",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3528,
			"arabicnumber": "1433.03",
			"text": "Bize Abd b. Humeyd rivayet etti. (Dedikî): Bize Abdürrazzak haber verdi. (Dediki): Bize Ma'mer, Zührî'den, o da Urve'den, o da Aişe'den naklen haber verdi ki, Rifaatü'I-Kurazî karısını boşamış da kadını Abdurrahman b. Zebîr almış. Sonrasında kadın Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: Ya Resülallah! Rifaa beni üç talakın sonuna kadar boşadı... demiş. Ravi hadîsi Yunus, hadîsi gibi rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3529,
			"arabicnumber": "1433.04",
			"text": "Bize Muhammed b. A'la' El-Hamdanî rivayet etti. (Dediki): Bize Ebu Usame, Hişam'dan, o da babasından, o da Aişe'den naklen rivayet etti ki, Resulullah (Sallallahu Aleyhi ve Sellem)'e bir adamın evlenip de boşadığı bir kadın başka kocaya varır da o kocası cinsî münasebetten evvel onu boşarsa birinci kocasına helal olur mu? diye sorulmuş da : «Hayır, ikinci kocası onun balcağızını tutmadıkça helal olmaz.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3530,
			"arabicnumber": "1433.05",
			"text": "{…} Bize Ebu Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize îbni Fudayl rivayet etti. H. Bize Ebu Kureyb de rivayet etti. (Dediki): Bize Ebu Muaviye rivayet eyledi. Bu raviîer hep birden Hişam'dan bu isnadla rivayette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3531,
			"arabicnumber": "1433.06",
			"text": "Bize Ebu Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Aliyu'bnu Müshir, UbeyduIIah b. Ömer'den, o da Kaasım b. Muhammedi'den, o da Aişe'den naklen rivayet eyledi. Aişe şöyle demiş: Bir adam karısını üç defa boşadı da kadmı başka bir adam aldı. Sonra onu cinsî münasebette bulunmadan boşadı. Bunun üzerine ilk kocası onunla tekrar evlenmek istedi. Ve mes'ele Resulullah (Sallalluhu Aleyhi ve Sellem)'e soruldu. O: «Hayır! ikinci kocası onun baîcağızından, birincinin tatdığı gibi tatmadıkça onunla evlenemez.» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3532,
			"arabicnumber": "1433.07",
			"text": "{…} Bize bu hadîsi Muhammed b. AbdiIIah b. Numeyr de rivayet etti. (Dediki): Bize babam rivayet eyledi. H. Bize bu hadisi Muhammed b. El-Müsenna dahi rivayet etti. (Dediki): Bize Yahya yani ibni Saîd rivayet etti. Bunlar hep birden Ubeydullah'dan bu isnadla yukarki hadisin mislini rivayet etmişlerdir. Yahya'nın Ubeydullah'dan rivayet ettiği hadîste: «Bize Kasım, Aişe'den rivayet etti.» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3533,
			"arabicnumber": "1434.01",
			"text": "Bize Yahya b. Yahya ile ishâk b. ibrahim rivayet ettiler. Lâftz Yahya'nındır. (Dedilerki): Bize Cerîr, Mansur'dan, o da Sâlim'den, o da Kureyb'den, o da ibni Abbas'dan naklen haber verdi. ibni Abbâs şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Ümmetimden biri ehline yakınlık etmek istediği vakit: Bismillah, Yarabbi! Bizi şeytandan ırak eyle! Bize ihsan edeceğin (zürriyet)'den de şeytanı ırak eyle! demiş olsa aralarındaki o cimadan çocuk mukadderse o çocuğa şeytan ebediyyen zarar veremez.» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3534,
			"arabicnumber": "1434.02",
			"text": "{…} Bize Muhammed b. El-Müsennâ ile ibni Beşşar rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. H. Bize ibni Numeyr de rivayet etti. (Dediki): Bize babam rivayet eyledi. H. Bize Abd b. Humeyd dahi rivayet etti. (Dediki): Bize Abdurrezzâk haber verdi. Bunlar toptan Sevrî'den ve her ikisi Mansur'dan, Cerîr hadîsi mânâsında rivayette bulunmuşlardır. Şu kadar var ki, Şu'be'nin hadîsinde Bismillah zikredilmemiştir. Abdurrezzak'ın Sevrî'den rivayetinde Bismillah kaydı vardır. ibni Numeyr rivayetinde ise: «Mansur, zannederim Bismillah dedi.» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3535,
			"arabicnumber": "1435.01",
			"text": "Bize Kuteybetü'bnu Saîd, Ebu Bekr b. Ebî Şeybe ve Amru'n-Nâkıd rivayet ettiler. Lâfız Ebu Bekr'indir. (Dedilerki): Bize Süfyân, ibni'l-Münkedir'den rivayet etti. O da Câbir'i şunu söylerken işitmiş: Yahudiler: Bir adam karısının fercine arkasından cima' ederse çocuk şaşı gözlü olur; derlerdi. Sonra : «Kadınlarınız sizin tarlanızdır. imdi tarlanıza nereden isterseniz gidin) [ Bakara 223 ] âyet-i kerîmesi indi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3536,
			"arabicnumber": "1435.02",
			"text": "Bize Muhammed b. Rumh rivayet etti. (Dediki): Bize Leys, ibni'I-Hâd'dan, o da Ebu Hâzim'den, o da Muhammed b. Münkedir'den, o da Câbir b. Abdillâh'dan naklen haber verdiki, Yahudiler: Kadının fercine arkasından cima' edilir de sonra gebe kalırsa çocuğu şaşı gözlü olur; derlermiş. Nihayet: (Kadınlarınız sizin tarlanızdır; imdi tarlanıza nereden isterseniz gidin) âyet-i kerîmesi indirilmiş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3537,
			"arabicnumber": "1435.03",
			"text": "Bize bu hadîsi Kuteybetü'bnu Saîd de rivayet etti. (Dediki): Bize Ebu Avâne rivayet etti. H. Bize Abdülvâris b. Abdissamed dahî rivayet eyledi. (Dedikî): Bana babam, dedemden, o da Eyyub'dan naklen rivayet etti. H. Bize Muhammed b, El-Müsennâ da rivayet etti. (Dediki): Bana Vehb b. Cerîr rivayet etti. (Dediki): Bize Şu'be rivayet eyledi. H. Bize yine Muhammed b. el-Müsennâ rivayet etti. (Dediki): Bize Abdurrahmân rivayet etti. (Dediki): Bize Süfyân rivayet etti. H. Bana Ubeydullah b. Saîd ile Hârun b. Abdillâh ve Ebu Ma'ne'r-Rakaaşî dahî rivayet ettiler. (Dedilerki): Bize Vehb b. Cerir rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Nu'mân b. Râşid'i, Zührî'den naklen rivayet ederken dinledim. H. Bana Süleyman b. Ma'bed'de rivayet etti. (Dediki): Bize Muallâ b. Esed rivayet etti. (Dediki): Bize Abdülazîz yâni ibni'I-Muhtâr, Süheyl b. Ebî Salih'den rivayet etti. Bu râvilerin hepsi Muhammed b. Münkedir'den, o da Câbir'den bu hadîsi rivayet etmişlerdir. Nu'man'ın Zührî'den rivayet ettiği hadîsde: «isterse yüzükoyun, isterse daha başka şekilde yalnız bir deliğe olmak şartı ile...» ifâdesini ziyade etmiştir. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3538,
			"arabicnumber": "1436.01",
			"text": "Bize Muhammed b. El-Müsennâ ile ibni Beşşâr rivayet ettiler. Lâfız îbni Müsenna'nındır. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Katade'yi, Zurâratü'bnu Evfâ'dan, o da Ebu Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet ederken dinledim. Nebi (Sallallahu Aleyhi ve Sellem) Efendimiz: «Kadın, kocasının döşeğini terk ederek sabahlarsa, o'na melekler sabah'a kadar la'net ederler.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3539,
			"arabicnumber": "1436.02",
			"text": "{…} Bu hadîsi bana Yahya b. Habîb dahi rivayet etti. (Dediki): Bize Hâlid yâni ibnil Haris rivayet etti. (Dediki): Bize Şu'be bu isnadla rivayette bulundu. O: «Yatağına dönünceye kadar» cümlesini de söyledi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3540,
			"arabicnumber": "1436.03",
			"text": "Bize îbni Ebî Ömer de rivayet etti. (Dediki): Bize Mervân, Yezid'den yâni îbni Keysan'dan, o da Ebu Hâzım'dan, o da Ebu Hureyre'den naklen rivayette bulundu. Ebu Hureyre şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Nefsim yed-i kudretinde olan Allah'a yemin ederim ki, eğer bir adam karısını yatağına davet ederde kadın razı olmazsa, kocası ondan razı oluncaya kadar Yüce Altah ona gazâb eder.» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3541,
			"arabicnumber": "1436.04",
			"text": "Bize Ebu Bekr b. Ebi Şeybe ile Ebu Kureyb rivayet ettiler. (Dedilerki): Bize Ebu Muâviye rivayet etti. H. Bana Ebu Saîd-i Eşecc dahi rivayet etti. (Dediki): Bize Vekî' rivayet eyledi. H, Bana Züheyr b. Harb da rivayet etti. Lâfız onundur. (Dediki): Bize Cerîr rivayet etti. Bu râvilerin hepsi A'meş'den, o da Ebu Hâzim'den, o da Ebu Hureyre'den naklen rivayette bulunmuşlardır. Ebu Hureyre şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Bir adam karısını döşeğine davet eder de döşeğe gelmez; bu sebeble ona dargın olarak yatarsa, sabahlayıncaya kadar melekler o kadın'a la'net ederler.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3542,
			"arabicnumber": "1437.01",
			"text": "Bize Ebu Bekr b. Ebî Şeybe rivayet etti. (Dediki: Bize Mervân b. Muâviye, Ömer b. Hamzete'l-Ömerî'den rivayet etti. (Demişki); Bize Abdurrahman b. Sa'd rivayet etti. (Dediki): Ebu Saîd-i Hudrî'yi şunu söylerken işittim: Resulullah (Salhahlahu Aleyhi ve Sellem): «Şüphesiz ki kıyamet gününde Allah indinde mevkii en kötü olacak insanlardan biri, karısı ile haşır neşir olup da sonra onun sırrını yayandır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3543,
			"arabicnumber": "1437.02",
			"text": "Bize Muhammed b. Abdillah b. Numeyr ile Ebu Kureyb rivayet ettiler. (Dedilerki): Bize Ebu Üsâme, Ömer b. Hamza'dan, o da Abdurrahman b. Sa'd'dan naklen rivayet etti. (Demişki): Ebu Saîdi Hudrî'yi şunu söylerken işittim: Resulullah (Salhahlahu Aleyhi ve Sellem): «Şüphesiz ki kıyamet gününde Allah indinde emanete hiyanetin en büyüklerinden biri, karı ile koca beraberce haşır neşir olduktan sonra, kocasının kadının sırrını yaymasıdir.» buyurdular. îbni Numeyr: «Emaneti hiyanetin en büyüğü» demiştir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3544,
			"arabicnumber": "1438.01",
			"text": "Bize Yahya b. Eyyub ile Kuteybetü'bnü Saîd ve Aliyyü'bnü Hucr rivayet ettiier. (Dedilerki): Bize îsmaîl b. Ca'fer rivayet etti. (Dediki): Bana Rabîa, Muhammed b. Yahya b. Habbân'dan, o da ibni Muhayrîz'den naklen haber verdi. ibni Muhayrîz şöyle demiş: Ebu Sirme ile ben Ebu Saîd-i Hudrî'nin yanına girdik. Ebu Sırme ona suâl sorarak: — Yâ Ebâ Saîd! Resulullah (Sallallahu Aleyhi ve Sellem)'i hiç azil'den bahsederken işittin mi? dedi. Ebu Saîd şu cevâbı verdi: — Evet, Resulullah (Sallallahu Aleyhi ve Sellem) ile birlikte Bel mustalik gazasında bulunduk; ve Arapların güzel kızlarını esir aldık. Derken bekârlığımız uzun sürdü de fidyeye razı olduk. Bunun üzerine cinsî münasebette bulunarak azil yapmak istedik. Arkacığından da şöyle konuştuk : — Biz bu işi Resulullah (Sallallahu Aleyhi ve Sellem) aramızda iken yapacak da ona sormayacak mıyız? Sonra Resulullah (Sallallahu Aleyhi ve Sellem)'e sorduk: — «Bunu yapmamanızda size bir zarar yoktur. Allah kıyamet gününe kadar kaç can yaratmayı takdir buyurdu ise, o mutlaka olacaktır.» buyurdu",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3545,
			"arabicnumber": "1438.02",
			"text": "Bana Benî Hâşim'in âzâdlısı Muhammed b. el-Ferec rivayet etti. (Dediki): Bize Muhammed b. Zibrikaan rivayet etti. (Dediki): Bize Musâ b. Ukbe, Muhammed b, Yahya b. Habbân'dan şu isnâdla Rabîa hadîsi mânâsında rivayette bulundu. Şu kadar var ki, o : «Çünkü Atlah kıyamet gününe kadar kimleri yaratacağını takdir buyurmuştur.»dedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3546,
			"arabicnumber": "1438.03",
			"text": "Bize Abdullah b. Muhammed b. Esmâ'ed-Dubaî rivayet etti. (Dediki): Bize Cüveyriye, Mâlik'den, o da Zührî'den, o da ibni Muhayrîz'den, ona da Ebu Saîd-i Hudrî haber vermiş olmak üzere rivayet eyledi. Ebu Saîd şöyle demiş : — Bir takım esîr kadınlar ele geçirdik. Artık (onlarla cima' ederken) azil yapıyorduk. Sonra Resulullah (Sallallahu Aleyhi ve Sellem)'e bunun hükmünü sorduk da, bize: — «Siz bunu hakîkaten yapıyor musunuz? Siz bunu hakikaten yapıyor musunuz? Siz bunu hakikaten yapıyor musunuz? Kıyamet gününe kadar yaratılması mukadder hiç bir can yoktur ki, dünyaya gelmiş olmasın.» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3547,
			"arabicnumber": "1438.04",
			"text": "Bize Nasr b. Aliy el-Cahdamî rivayet etti. (Dediki): Bize Bişr b, Mufaddal rivayet etti. (Dediki): Bize Şu'be, Enes b. Sîrîn'-den, o da Ma'bed b. Sîrîn'den, o da Ebu Saîd-i Hudrî'den naklen rivâyet eyledi. Enes demiş ki: (Ma'bede) sen bu hadîsi Ebu Saîd'den mi işittin? diye sordum: — Evet, o da Nebi (Sallallahu Aleyhi ve Selem)'den nakletti: «Bunu yapmamanızda size bir zarar yoktur. Çünkü bu ancak kadere bağlı bir şeydir.» buyurmuşlar, cevâbını verdi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3548,
			"arabicnumber": "1438.05",
			"text": "Bize Muhammed b. el-Müsennâ ile ibni Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. H. Bize Yahya b. Habîb de rivayet etti. (Dedikî): Bize Hâlid yâni ibni'l Haris rivayet etti. H. Bana Muhammed b. Hatim dahî rivayet etti. (Dediki): Bize Abdurrahmân b. Mehdi ile Behz rivayet ettiler. Bu râvilerin hepsi: Bize Şu'be, Enes b. Sîrîn'den bu isnâdla bu hadîsin mislini rivayet eyledi; demişlerdir. Yalnız bunların hadîsinde: «Nebi (Sallallahu Aleyhi ve Sellem)'den rivayet olunmuştur. Azil hakkında : \"Bunu yapmamanızda size bîr zarar yoktur; çünkü bu ancak kader (e bağlı bir şey) dir; buyurmuşlar.» denilmiştir. Behz'in rivayetinde: «Şu'be dediki: Enes'e : — Sen bu hadîsi Ebu Saîd'den mi işittin? diye sordum. — Evet, cevâbını verdi.» ifâdesi de vardır",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3549,
			"arabicnumber": "1438.06",
			"text": "Bana Ebu'r-Rabî'ez-Zehrânî ile Ebu Kâmil el-Cahderî rivayet ettiler. Lâfız Ebu Kâmil'indir. (Dedilerki): Bize Hammâd yâni îbni Zeyd rivayet etti. (Dediki): Bize Eyyub, Muhammed'den. o da Abdurrahman b. Bişr b. Mes'ud'dan. o da Ebu Saîd-i Hudrî'ye isnâd etmek suretiyle rivayette bulundu. Ebu Saîd şöyle demiş : Nebi (Sallallahu Aleyhi ve Sellem)'e azlin hükmünü sordular da: «Bunu yapmamalısınız; çünkü bu ancak bir kaderden ibarettir.» buyurdular. Râvi Muhammed: «Yapmamalısınız» sözü nehye daha yakındır; demiş",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3550,
			"arabicnumber": "1438.07",
			"text": "Bize Muhammed b. el-Müsennâ rivayet etti. (Dediki): Bize Muâz b. Muâz rivayet etti. (Dediki): Bize ibni Avn, Muhammed'den, o da Abdurrahman b. Bişr el-Ensârî'den naklen rivayet eyledi. Muhammed demiş ki: Abdurrahman hadîsi geriye isnâd ede ede tâ Ebu Saîd-i Hudrî'ye vardırdı. Ebu Saîd şunları söylemiş: Nebi (Sallallahu Aleyhi ve Sellem)'in yanında azlin lâfı oldu da: «Ne konuşuyorsunuz?» diye sordu. Ashâb: — Bir adamın karısı emzikli olur da onunla cinsî münâsebette bulunur; ve gebe kalmasını istemezse; yine bir adamın cariyesi olur; onunla cima' ederek gebe kalmamasını isterse ne yapması lâzım geldiğini (konuşuyoruz) dediler. Resulullah (Sallallahu Aleyhi ve Sellem): «Bunu yapmamalısınız; çünkü bu ancak bir kaderden ibarettir.» buyurdular. İbni Avn demişki: «Ben bu hadîsi Hasen'e söyledim de : — Vallahi bu söz tıpkı nehye benziyor; dedi.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3551,
			"arabicnumber": "1438.08",
			"text": "{…} Bana Haccâc b. Şaîr rivayet etti. (Dediki): Bize Süleyman b. Harb rivayet etti. (Dediki): Bize Hammâd b. Zeyd, ibni Avn'dan rivayet etti. (Demişki): Muhammed'e, ibrahim'den dinlediğim Abdurrahmân b. Bişr hadîsini (yâni azil hadîsini) anlattım da: Abdurrahmân b. Bişr onu ancak bana rivayet etti; dedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3552,
			"arabicnumber": "1438.09",
			"text": "{…} Bize Muhammed b. el-Müsennâ rivayet etti. (Dediki): Bize Abdül â'lâ rivayet eyledi. (Dediki): Bize Hişâm, Muhammed'den, o da Mâ'bed b. Sîrîn'den naklen rivayette bulundu. Ma'bed şöyle demiş : Ebu Saîd'e: Sen Resulullah (Sallallahu Aleyhi ve Sellem)'i azil hakkında bir şey söylerken işittin mi? diye sorduk. — Evet, cevâbını verdi. Râvi bu hadîsi «kader» kelimesine kadar, ibni Avn hadîsi mânâsında rivayet eylemiştir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 3553,
			"arabicnumber": "1438.10",
			"text": "Bize Ubeydullah b. Ömer el-Kavârîrî ile Ahmed b. Abde rivayet ettiler. ibni Abde «Bize haber verdi» tâbirini kullandı. Ubeydullah ise: Bize Süfyân b. Uyeyne, ibni Ebî Necîh'den, o da Mücâhid'den, o da Kaza'a'dan, o da Ebu Saîd-i Hudrî'den naklen rivayet eyledi; dedi. Ebu Saîd şunları söylemiş : Resulullah (Sallallahu Aleyhi ve Sellem)'in yanında azil lâfı oldu da: «Sizden bîriniz bunu niçin yapıyor? Çünkü yaratılmış hiç bir nefs yoktur ki, yaratanı Allah olmasın!» buyurdu. «Bunu sizden hiç biriniz yapmasın» demedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 3554,
			"arabicnumber": "1438.11",
			"text": "Bana Harun b. Saîd el-Eylî rivayet etti. (Dediki): Bize Abdullah b. Vehb rivayet etti. (Dediki): Bana Muâviye yâni ibni Salih, Aliy b. Ebî Talha'dan, o da Ebu'l-Veddâk'dan, o da Ebu Saîd-i Hudrî'den naklen haber verdi. Veddâk Ebu Saîd'i şunu söylerken işitmiş : Resulullah (Sallallahu Aleyhi ve Sellem)'e azlin hükmü soruldu da: «Her meniden çocuk olmaz; Allah bir nesneyi yaratmak isterse onu hiç bir şey men edemez.» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 3555,
			"arabicnumber": "1438.12",
			"text": "{…} Bana Ahmed b. el-Münzir el-Basri rivayet etti. (Dedikî): Bize Zeyd b. Hubâb rivayet etti. (Dediki): Bize Muâviye rivayet etti. (Dediki): Bana Aliy b. Ebî Talhate'l-Hâşimî, Ebu'l-Veddâk'dan, o da Ebu Saîd-i Hudrî'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den bu hadîsin mislini haber verdi. İzah 1440 da",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 3556,
			"arabicnumber": "1439.01",
			"text": "Bize Ahmed b. Abdillâh b. Yunus rivayet etti. (Dediki): Bize Züheyr rivayet etti. (Dediki): Bize Ebu'z-Zübeyr, Câbir'den naklen haber verdi ki, Bir adam Resullullah (Sa!lallahu Aleyhi ve Sellem)'e gelerek : Benim bir cariyem var ki, hizmetçimiz ve su taşıyan devemiz hep odur. Ben onunla cinsî münâsebette de bulunuyorum; ama gebe kalmasını istemiyorum; demiş. Bunun üzerine Resul-i Ekrem (Sa!lallahu Aleyhi ve Sellem): «istersen ondan azil yap; çünkü ona mukadder olan başına gelecektir.» buyurmuşlar. Adam bir müddet durmuş; sonra tekrar Nebi (Sa!lallahu Aleyhi ve Sellem)'e gelerek: — Câriye gebe kaldı; demiş. O zaman Resulullah (Sa!lallahu Aleyhi ve Sellem); «Ben o'na mukadder olanın başına geleceğini sana haber vermiştim.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 3557,
			"arabicnumber": "1439.02",
			"text": "Bize Saîd b. Amr EI-Eş'asî rivayet etti. (Dediki): Bize Süfyân b. Uyeyne, Saîd b. Hassân'dan, o da Urvetü'bnu Iyâz'dan, o da Câbir b. Abdillâh'dan naklen rivayet etti. Câbir şöyle demiş : Bir adam Nebi (Sa!lallahu Aleyhi ve Sellem)'e suâl sordu; ve: Yanımda bir cariyem var; ondan azil yapıyorum; dedi. Bunun üzerine Resulullah (Sa!lallahu Aleyhi ve Sellem): «Şüphesiz kî, bu hareket Allah'ın irâde ettiği bir şey'e mâni olamaz.» buyurdu. Sonrasında o adam tekrar gelerek: — Yâ Resulâllah! Sana anlattığım câriye gebe kaldı; dedi. O zaman Resulullah (Sa!lallahu Aleyhi ve Sellem): «Ben Allah'ın kul'u ve Resulüyüm!» buyurdular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 3558,
			"arabicnumber": "1439.03",
			"text": "{…} Bize Haccâc b. Şâir rivayet etti. (Dediki): Bize Ebu Ahmed Ez-Zübeyrî rivayet etti. (Dediki): Bize Mekkeliler'in hikayecisi Saîd b. Hassan rivayet etti. (Dediki): Bana Urvetübnu lyâz b. Adiy b. Hıyar En-Nevfelî, Câbir b. Abdillâh'dan naklen haber verdi. Câbir: «Nebi (Sa!lallahu Aleyhi ve Sellem)'e bir adam geldi...» demiş. Râvi, Süfyân hadîsi mânâsında rivayette bulunmuştur. İzah 1440 da",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 3559,
			"arabicnumber": "1440.01",
			"text": "Bize Ebu Bekr.b. Ebî Şeybe ile ishâk b. ihrâhîm rivayet ettiler. ishâk (Bize haber verdi) tâbirini kullandı. Ebu Bekr ise: Bize Süfyân, Amr'dan, o da Atâ'dan, o da Câbir'den naklen rivayet etti; dedi. Câbir: «Biz Kur'ân inerken azil yapardık.» demiş. ishâk şunu da ziyâde etti: «Süfyân: Azil yasak edilecek bir şey olsa idi, bizi ondan Kur'ân nehyederdi; dedi.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 3560,
			"arabicnumber": "1440.02",
			"text": "Bana Selemetü'bnü Şebîb rivayet etti. (Dediki): Bize Hasen b. A'yen rivayet etti. (Dediki): Bize Ma'kıl, Atâ'dan rivayet etti. (Demişki): Ben Câbiri şunu söylerken işittim : «Biz Resulullah (Sallallahu Aleyhi ve Sellem) zamanında hakîkaten azil yapardık.»",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 3561,
			"arabicnumber": "1440.03",
			"text": "Bana Ebu Gassân el-Mismaî rivayet etti. (Dediki): Bize Muâz yâni ibni Hişâm rivayet etti. (Dediki): Bana babam, Ebu'z-Zübeyr'den, o da Câbir'den naklen rivayette bulundu. Câbir: «Biz Resulullah (Sallallahu Aleyhi ve Sellem) zamanında azil yapardık. Derken Nebi (Sallallahu Aleyhi ve Sellem) bunu duydu; ama bizi nehyetmedi.» İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 3562,
			"arabicnumber": "1441.01",
			"text": "Bana Muhammed b. EI-Müsenna rivayet etti. (Dedikî): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Yezîd b. Humeyr'den rivayet etti. (Demişki): Ben Abdurrahman b. Cübeyri babasından, o da Ebu'd-Derdâ'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet ederken dinledim. Resulullah (Sallallahu Aleyhi ve Sellem) bir çadır kapısında hemen hemen doğurmak üzere bulunan bir kadının yanına uğramış da : — «Galiba bu adam bu kadınla cima' etmek istiyor» demiş. Ashâb; — Evet, cevabını vermişler. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): — «Vallahi içimden geldi, bu adam'a öyle bir la'net edeyimkî (bu lanet) onunla beraber kabrine girsin! Acaba bu adam çocuğu mirasçı yapmak kendisine helâl olmadığı halde, onu nasıl mirasçı yapar. Çocuğu köle gibi kullanmak kendisine helâl olmadığı halde onu nasıl hizmetçi olarak kullanır?» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 3563,
			"arabicnumber": "1441.02",
			"text": "{…} Bize bu hadîsi Ebu Bekr b. Ebî Şeybe de rivayet etti. (Dediki): Bize Yezid b. Harun rivayet etti. H. Bize Muhammed b. Beşşar dahi rivayet etti. (Dediki): Bize Ebu Dâvud rivayet eyledi. Bu râviler toptan Şu'be'den bu îsnadda rivayette bulundular",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 3564,
			"arabicnumber": "1442.01",
			"text": "Bise Halef b. Hişam rivayet etti. (Dediki): Bize b. Enes rivayet etti. H. Bize Yahya b. Yahya dahi rivayet etti. Lafız onundur. (Dediki): Malik'e, Muhammed b.. Abdirrahman b. Nefel'den dinlediğim, onun da Urve'den, onun da Aişe'den, onun da Cüdame binti Vehb El-Esediyye'den naklen rivayet ettiği şu hadîsi okudum: Cüdame Resulullah {Sallallahu Aleyhi ve Sellem)'i şöyle buyururken işitmiş: «Vallahi gileyi yasak etmek içimden geçti. Nihayeî Romalılarla iranlıların bunu yaptıklarını, fakat çocuklarına bir zarar vermediğini hatırladım. Müslim derki: Halefe gelince, o Cüzametü'î-Esedîyye dedi. Ama doğrusu Yahya'nın dediği gibi «de» ile Cüzame'dir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 3565,
			"arabicnumber": "1442.02",
			"text": "Bize Ubeydullah b. Saîd iîe Muhammed b. Ebî Ömer rivayet ettiler. (Dedilerki): Bize El-Mukri rivayet etli. (Dediki): Bise Saîd b. Ebu Eyyub rivayet etli. (Dediki): Bana Ebu'l-Esved, Urve'den, o da Aişe'den, o da Ukkaşe'nin kız kardeşi Cüdame binti Vehb'den naklen rivayet eyledi. Cüdame şunu söylemiş: ResuIullah (Sallallahu Aleyhi ve Sellem) bir takım insanların arasındayken yanına vardım. Şöyîe buyuruyordu : «Vallahi gîle'yi yasak etmek içimden geldi. Derken Romalılarla iranlılara bîr baktrm. Gördüm ki, onbr çocuklarına gîle yapıyor, fakat bu onların çocuklarına hiç bîr zarur getirmiyormuş.» Sonra kendisine azli sordular. Resulullah (Sallallahu Aleyhi ve Sellem) : «Bu bir kız çocuğunu gizlice diri diri mezara gömmektir.» buyurdular. Ubeydullah El-Muhrî'den rivayet ettiği hadîsinde: « O (diri diriye mezara gömülen kız çocuğuna sorulduğu vakît) [ Tekvir 8 ] ayet-î kerîmesîdir.» cümlesini ziyade etti",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 3566,
			"arabicnumber": "1442.03",
			"text": "Bize bu Ebu Bekr b. Ebi Şeybe de rivayet etti. (Dediki): Bize Yahya b. ishak rivayet etti. (Dediki): Bize Yahya b. Eyyub, Muhammed b. Abdirrahman b. Nevfel EI-Kuraşi'den, o da Urve'den, o da Aişe'den, o da Cüdame binti Vehb El-Esediyye'den naklen rivayet eyledi. Cüdame: «Ben Resulullah (Sallallahu Aleyhi ve Sellemj'den dinledim...» demiş. Ravi hadîsi Saîd b. Ebî Eyyub'un azil ve Gîle hakkındaki hadîsi gibi nakletmîştir. Yalnız o (Gîle yerine) Gıyal demiştir. İzah 1443 te",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 3567,
			"arabicnumber": "1443",
			"text": "Bana Muhammed b. Abdîllâh b. Numeyr ile Züheyr b. Harb rivayet ettiler. Lâfız ibni Numeyr'indir. (Dedilerki): Bize Abdullah b. Yezîd el-Makburî rivayet etti. (Dediki): Bize Hayve rivayet etti. (Dediki): Bana Ayyaş b. Abbâs rivayet etti. Ona da Ebu'n-Nadr, Âmir b. Sa'd'dan naklen rivayet etmiş kî, Üsâmetü'bnu Zeyd'in, babası Sa'd b. Ebî Vakkaas'a haber verdiğine göre, Bir adam Resulullah (Sallallahu Aleyhi ve Sellem)'e gelerek: — Ben karımdan azil yapıyorum; demiş. Resulullah (Sallallahu Aleyhi ve Sellem); — «Bunu niçin yapıyorsun?» diye sormuş. Adam: — Kadının çocuğuna veya çocuklarına zarar geleceğinden korkuyorum (da onun için) cevâbını vermiş. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): — «Bu zararlı bir iş olsa idi, iranlılarla Romalılara zarar verirdi.» buyurmuşlar. Züheyr kendi rivayetinde : «Eğer bunun için ise yapma! Bu îşi iranlılarla Romalılara zarar vermemiştir.» dedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 169
			}
		}
	]
}