{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"17": "The Book of Suckling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3568,
			"arabicnumber": "1444.01",
			"text": "Bize Yahya b. Yahyâ rivayet etti. (Dediki): Abdullah b. Ebî Bekriden dinlediğim, onun da Amra'dan naklettiği, ona da Âişe'den haber verdiği şu hadîsi okudum : Resulullah (Sallallahu Aleyhi ve Sellem) Âişe'nin yanında bulunuyormuş. Âişe, Hafsa'nın evîne girmek için izin isteyen bîr adamın sesini işitmiş, Âişe demiş ki: Bunun üzerine ben: Yâ Resulallah! Bu senin evine girmek için izin isteyen bîr adam... dedim. Resulullah (Sallallahu Aleyhi ve Sellem) Hafsa'nın süt amcasını kasdederek : «Zannederim filân olacak!» dedi Müteakiben Âişe, kendi süt amcasını kasdederek: — Yâ Resulâllah! Filân sağ olsa benim yanıma girebilirmi idi? diye sormuş. Resulullah (Sallallahu Aleyhi ve Sellem): «Evet, çünkü süî, doğumun haram kıldıği her şeyi haram kılar.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3569,
			"arabicnumber": "1444.02",
			"text": "Bize bu hadîsi Ebu Kureyb de rivayet etti. (Dediki): Bize Ebu Usâme rivayet etti. H. Bana Ebu Ma'mer İsmail E. İbrahim El-Hiizelî dahî rivayet etti. (Dediki): Bize Aliy b. Hâşim b. El-Berîd rivayet eyledi. Bunlar hep birden, Hişâm b. Urve'den, o da Abdullah b. Ebî Bekr'den, o da Amra'dan, o da Âişe'den naklen rivayette bulunmuşlardır, Âişe şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem} bana : «Doğumdan haram olan her şey süt'ten de haram olur.» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3570,
			"arabicnumber": "1444.03",
			"text": "{…} Bu hadîsi bana îshâk b. Mansur da rivayet etti. (Dediki): Bize Abdurrazzâk haber verdi. (Dediki): Bize İbni Cüreyc haber verdi. (Dediki): Bana Abdullah b. Ebi Bekr bu isnâdla Hişâm b. Urve hadîsi gibi rivayette bulundu. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3571,
			"arabicnumber": "1445.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, İbni Şihab'dan dinlediğim, onun da Urvetü'bnü Zübeyr'den, naklen rivayet ettiği, ona da Âişe'nin haber verdiği şu hadîsi okudum: Tesettür âyetleri indirildikten sonra Ebu'l-Kuays'in kardeşi Eflâh gelerek Âişe'nin yanına girmek için izin istemiş, Eflâh, Âişe'nin süt amcası imiş. Âişe (Radiyallahu anha) demişki: «Ben ona izin vermeğe razı olmadım. Resulullah (Sallallahu Aleyhi ve Sellem) gelince bu yaptığımı kendisine haber verdim de; onun yanıma girmesine izin vermemi emir buyurdu.»",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3572,
			"arabicnumber": "1445.02",
			"text": "Bize bu hadîsi Ebu Bekr b. Ebî Şeybe de rivayet etti. (Dediki): Bize Süfyân b. Uyeyne, Zührî'den, o da Urve'den, o da Âişe'den naklen rivayet eyledi. Âişe (Radîyallahu anfıa) şöyle demiş: «Bana süt amcam Eflâh b. Ebî Kuays geldi...» Râvi hadîsi, Mâlik hadîsi mânâsında rivayette bulunmuş; şunu da ziyâde eylemiştir : «Beni emzirdi ise kadın emzirdi; erkek emzirmedi ya! dedim. Resulullah (Sallallahu Aleyhi ve Sellem) : — Ellerin topraklansın! yahud: Sağ elin topraklansın! buyurdu",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3573,
			"arabicnumber": "1445.03",
			"text": "Bana Harmeletü'bnu Yahya rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Yunus, ibni Şihâb'dan, o da Urve'den naklen haber verdi. Ona da Âişe haber vermişki, tesettür âyetleri indikten sonra Ebul-Kuays'in kardeşi Eflâh gelerek onun yanına girmek için izin istemiş. Ebu'l-Kuays, Hz. Âişe'nin süt babası imiş. Âişe demiş ki : — Ben: Vallahi Resulullah (Sallallahu Aleyhi ve Sellem) sormadıkça Eflâh'a izin veremem! Zîra beni emziren Ebu'l-Kuays değil, karısıdır; dedim. Resulullah (Sallallahu Aleyhi ve Sellem) içeri girince ona: Yâ Resulâllah! Ebu'I-Kuays'in kardeşi Eflâh gelerek yanıma girmek için izin istedi. Ben de senden izin almadıkça ona izin vermeyi doğru bulmadım; dedim. Bunun üzerme: — Sen ona izin ver! Buyurdular.» Urve demişki: «Bundan dolayıdır ki, Âişe: Neseben haram gördüğünüz şeyleri süt cihetinden de haram sayın! derdi.»",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3574,
			"arabicnumber": "1445.04",
			"text": "Bize bu hadîsi Abd b. Humeyd de rivayet etti. (Dediki): Bize Abdürrezzak haber verdi. (Dediki): Bize Ma'mer Zührî'den bu isnâdla rivayette bulundu. Ve yukarıkilerin hadîslerinde olduğu gibi: «Ebu'I-Kuays'in kardeşi Eflâh gelerek yanıma girmek için izin istedi...» dedi. Bu hadîsde: «Sağ elin topraklansın! O senin amcandır.» cümlesi de vardır. Ebu'I-Kuays, Âişe'yî emziren kadının kocası idi",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3575,
			"arabicnumber": "1445.05",
			"text": "Bize Ebu Bekr b. Ebî Şeybe ile Ebu Kureyb rivayet ettiler. (Dedilerki) : Bize îbni Numeyr, Hişâm'dan, o da babasından, o da Âişe'den naklen rivayet eyledi. Âişe şöyle demiş; Süt amcam gelerek yanıma girmek için izin istedi. Ben de Resulullalı (Sallallahu Aleyhi ve Sellem)'den emir almadıkça ona izin vermeğe razı olmadım. ResululIah (Sallallahu Aleyhi ve Sellem) gelince : «Süt amcam yanıma girmek için izin istedi; ama ben kendisine izin vermekten çekindim; dedim. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem}: «Amcan senin yanına girsin!» buyurdu. — Beni emzirdi ise kadın emzirdi; erkek emzirmedi ya! dedim. «O senîn amcandır; varsın senin yanına girsin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3576,
			"arabicnumber": "1445.06",
			"text": "{…} Bana Ebu'r-Rabi'ez-Zehrânî rivayet etti, (Dediki): Bize Hammâd yâni İbnİ Zeyd rivayet etti. (Dediki): Bize Hişârn bu isnâdla rivayette bulundu ki, Ebu'l-Kuays'ın kardeşi Âişe'nin yanına girmek için izin istemiş. Râvi yukarıki hadîs gibi rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3577,
			"arabicnumber": "1445.07",
			"text": "{…} Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Ebu Muâviye, Hişam'dan bu isnâdla bu hadîsin benzerini rivayet eyledi. Şu kadar var ki, o «Ebu'l-Kuays, Âişe'nin yanına girmek için izin istedi.» demiştir",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3578,
			"arabicnumber": "1445.08",
			"text": "Bana Hasan b. Aliy el-Hulvânî ile Muhammed b. Râfi' rivayet ettiler. (Dedilerki) : Bize Abdürrezzak haber verdi. (Dediki): Bize İbni Cüreyc, Atâ'dan naklen haber verdi, (Demişki): Bana Urvetü'bnu Zübeyr haber verdi. Ona da Âİşe haber vermiş. (Demişki): Süt amcam Ebu'l-Ca'd yanıma girmek için izin istedi. Ben kendisini kabul etmedim. Nebi (Sallallahu Aleyhi ve Sellem) gelince bunu ona haber verdim. «Ona izin verseydin ya! Sağ eli topraklanan! yahut: Elin topraklanası!» buyurdular. Râvi der ki: «Hişam bana: Bu zât olsa olsa Ebu'î-Kuays'dir; dedi.»",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3579,
			"arabicnumber": "1445.09",
			"text": "Bize Kuteybetü'bnu Saîd rivayet etti. (Dediki): Bize Leys rivayet etti. H. Bize Muhammed b. Rumh dahî rivayet etti. (Dediki): Bize Leys, Yezîd b. Ebî Habîb'den, o da îrâk'dan, o da Âişe'den naklen haber verdiki, Âişe'nin Eflâh ismi verilen süt amcası onun yanına girmek için izin istemiş de Âişe kendisine izin vermemiş; müteakiben (bunu) Resulullah (Sallallahu Aleyhi ve Sellem)'e haber vermiş. Nebi (Sallallahu Aleyhi ve Sellem) kendisine : «Ondan korunma! Çünkü neseben haram olan, süt cihetîyle de haramdır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3580,
			"arabicnumber": "1445.10",
			"text": "Bize Ubeydullah b. Muâz el-Anbarî rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, Hakem'den, o da Irak b. Mâlik'den, o da Urve'den, o da Âişe'den naklen rivayet eyledi. Âişe şöyle demiş: Eflâh b. Kuays benim yanıma girmek için izin istedi. Ben ona izin vermekten çekindim. Müteakiben : — Ben senin amcanım; seni kardeşimin karısı emzirdi, diye haber gönderdi. Ben yine kendisine izin vermekten çekindim. Derken Resulullah (SallaIlahu Aleyhi ve Sellem) geldi. Bunu ona anlattım da: «O senin yanına girsin! Zîra amcandır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3581,
			"arabicnumber": "1446.01",
			"text": "Bize Ebu Bekr b. Ebî Şeybe ile Züheyr b. Harb ve Muhammed b. Alâ' rivayet ettiler. Lâfız Ebu Bekr'indir. (Dedilerki): Bize Ebu Muâviye, A'meş'den, o da Sa'd b. Ubeyde'den, o da Ebu Abdirrahmân'dan, o da Alî'den naklen rivayette bulundu. Alî (Radiyallahu anh) şöyle demiş: — Yâ Resulâllah! Neden bizi bırakıp da daima Kureyş'i ihtiyar ediyorsun? dedim. — «Sizde bir şey var mı ya?» buyurdu. — Evet, Hamza'nın kızı (var) dedim. Bunun üzerine Resulullah (Sallallahu Aîeyhi ve Sellem): — «O bana helâl olamaz; çünkü o benim süt kardeşimin kızıdır,» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3582,
			"arabicnumber": "1446.02",
			"text": "{…} Bize Osman b. Ebî Şeybe île İshâk b. İbrâhîm, Cerîr'den rivayet ettiler. H. Bize îbni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize Muhammed b. Ebî Bekr el-Mukaddemî dahî rivayet eyledi. (Dedik): Bize Abdurrahmân b. Mehdî, Süfyân'dan rivayet etti. Bu râvilerin hepsi A'meş'den bu isnadla bu hadîsin mislini rivayet etmişlerdir. İzah 1448 de",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3583,
			"arabicnumber": "1447.01",
			"text": "Bize Heddâb b. Hâlîd rivayet etti. (Dediki): Bize Hemmâm rivayet etti. (Dediki): Bize Katâde, Câbir b. Zeyd'den, o da İbni Abbâs'dan naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem)'e Hamza'nın kızını almak istemişler. Bunun üzerine : «O bana helâl olmaz; çünkü süt kardeşimin kızıdır. Rahim i'tibarı ile haram olan, süt cihetîle de haram olur.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3584,
			"arabicnumber": "1447.02",
			"text": "Bize bu hadîsi Züheyr b. Harb da rivayet etti. (Dediki): Bize Yahya yâni el-Kattân rivayet etti. H. Bize Muhammed b. Yahya b. Mihrân el-Kutâî de rivayet etti. (Dediki): Bize Bişr b. Ömer rivayet etti. Bunlar hep Şu'be'den rivayet etmişlerdir. H. Bize bu hadîsi Ebu Bekr b. Ebî Şeybe dahî rivayet elti. (Dediki): Bize Aliyyü'bnu Miishir, Saîd b. Ebî Arube'den rivayet etti. Bunların ikisi de Katâde'den tamamen Hemmam'ın isnadı ile rivayette bulunmuşlardır. Yalnız Şu'be'nin hadîsi «Süt kardeşimin kızıdır.» cümlesinde biter. Saîdin hadîsinde: «Neseben haram olan süt cihetîle ele haram olur.» ifâdesi de vardır. İzah 1448 de",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3585,
			"arabicnumber": "1448",
			"text": "Bize Hâruıı b. Saîd El-Eylî ile Ahmed b. îsâ rivayet ettiler. (Dedilerki): Bize İbni Vehb rivayet etti, (Dediki): Bize Mahramatü'bnu Bükeyr, babasından naklen haber verdi. (Demişki): Ben Abdullah b. Müslim'i şunu söylerken işittim: Ben Muhammed b. Müslim'i şöyle derken işittim: Ben Humeyd b. Abdirrahman'ı şöyle derken işittim: Ben Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Ümmü Seleme'yi şunu söylerken işittim Resulullah (Sallallahu Aleyhi ve Sellem): — Hamza'nın kızını bırakıp da nereye gidiyorsun yâ Resulâllah? — Hamzatü'bnu Abdilmuttalib'in kızını istemez misini? dediler. Resulullah (Sallallahu Aleyhi ve Sellem): «Hamza benîm süt kardeşimdir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3586,
			"arabicnumber": "1449.01",
			"text": "Bize Ebu Kureyb Muhammed b. el-Ala' rivayet etti. (Dediki): Bize Ebu Usâme rivayet etti. (Dediki): Bize Hişâm haber verdi. (Dediki): Bana, babam, Zeyneb binti Ümmi Seleme'den, o da Ümmü Habîbe binti Ebî Süfyân'dan naklen haber verdi. Ümmü Habîbe şunu söylemiş : Resulullah (Sallallahu Aleyhi ve Sellem) yanıma girdi de kendisine: — Kız kardeşimi, Ebu Süfyân'ın kızını istermisin? dedim. — Ne yapacağım? diye sordu. — Nikâh edersin, dedim. Resulullah (Sallallahu Aleyhi ve Sellem): — Sen bunu diler misin? dedi. — Ben senin bir tanen değilim. Şu halde bana hayırda kız kardeşimin ortak olmasını dilerim; dedim. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): — O bana helal olmaz! buyurdu. — Ama ben senin Dürre binti Ebî Seleme'yi istemekte olduğunu haber aldım; dedim. — Ummü Seleme'nin kızını mı? diye sordu. — Evet, dedim. — O benim terbiyem altında bulunan üvey kızım bile olmasa bana yine helâl değildir; çünkü o benim süt kardeşimin kızıdır. Onun babası ile benî Süveybe emzirmişn'r. Artık bana kızlarınızı ve kız kardeşlerinizi arzetmeyin! buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3587,
			"arabicnumber": "1449.02",
			"text": "{…} Bana bu hadîsi Süveyd b. Saîd de rivayet etti. (Dediki): Bize Yahya b. Zekeriyyâ b. Ebî Zaide rivayet etti. H. Bize Amru'n-Nâkıd dahî rivayet etti. (Dediki): Bize Esved b. Âmir rivayet etti. (Dediki): Bize Züheyr haber verdi. Bu râvilerin ikisi de Hişâm b. Urve'den tamamen bu isnâdla rivayette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3588,
			"arabicnumber": "1449.03",
			"text": "Bize Muhammed b, Rumh b. Muhacir rivayet etti. (Dediki: Bize Leys, Yezid b. Ebî Habîb'den naklen haber verdiki, Muhammed b. Şihâb, kendisine Urve'nin, ona da Ebu Seleme'nin kızı Zeyneb'in, ona da Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Ümmü Habîbe'nin anlatmış olduğunu bildirerek mektub yazmış. Ümmü Habîbe Resulullah (Sallallahu Aleyhi ve Sellem)'e : — Yâ Resulâllah! Kız kardeşim Azze'yi al! demiş. Resulullah (Sallallahu Aleyhi ve Sellem): — Sen bunu dilermisin? diye sormuş. Ümmü Habibe : — Evet yâ Resulâllah, ben senin bir tanen değilim, onun için bana hayırda kız kardeşimin ortak olmasını dilerim, demiş. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): — O bana hela! olmaz; buyurmuş. Ümmü Habîbe (Radiyallahu anha) demişki: — Ben, Ya Resulâllah! Ama biz (aramızda) senin Dürre binti Ebî Seleme'yi almak istediğini konuşuyoruz; dedim. — Ebu Seleme'nin kızını mı? diye sordu. — Evet, dedim. Resulullah (Sallallahu Aleyhi ve Sellem): — O benim terbiyem altrnda bulunan üvey kızım bile olmasa bana yine helâl olmaz; çünkü benim süt kardeşimin kızıdır. Ebu Seleme ile beni Süveybe emzirmıştir. Artık bana kızlarınızı ve kız kardeşlerinizi arzetmeyin! buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3589,
			"arabicnumber": "1449.04",
			"text": "{…} Bana bu hadîsi Abdülnıelik b. Şuayb b. Leys de rivayet etti. (Dediki): Bana babam, dedemden rivayet etti. (Demişki): Bana Ukayl b. Hâlid rivayet eyledi. H. Bize Abd b. Humeyd de rivayet etti. (Dediki): Bana Ya'kub b. İbrâhîm ez-Zührî haber verdi. (Dediki): Bize Muhammed b. Abdillâh b. Müslim rivayet eyledi. Bu râvilerin ikisi de Zührî'den, İbni Ebî Habîb'in isnadı ile onun hadisi gibi rivayette bulunmuşlar; fakat Yezîd b, Ebî Habib'den başka hiç biri hadîsinde Azze'yi adlandırmamıştir",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3590,
			"arabicnumber": "1450",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize îsmâîl b. İbrahim rivayet etti. H. Bize Muhammed b. Abdillâh b. Numeyr de rivayet etti. (Dediki): Bize İsmâîl rivayet etti. H. Bize Süveyd b. Saîd dahî rivayet etti. (Dediki): Bize Mu'temir b. Süleyman rivayet etti. Her iki râvi Eyyub'dan, o da İbni Ebî Müleyke'den, o da Abdullah b, Zübeyr'den, o da Âişe'den naklen rivayette bulunmuşlardır. Âişe şöyle demiş: Resulullah {Sallallahu Aleyhi ve Sellem) : «Bir ve iki defa emmek hürmet isbât etmez.» buyurdular. Süveyd ile Züheyr: «Şüphesizki Nebi (Sallallahu Aleyhi ve Sellem) buyurdu» tâbirini kullandılar. İzah 1451 de",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3591,
			"arabicnumber": "1451.01",
			"text": "Bize Yahya b. Yahya ile Amru'n-Nâkıd ve îshâk b. Ibrâhîm hep birden Mu'temir'den rivayet ettiler. Lâfız Yahya'nındır. (Dedilerki): Bize Mu'temir b. Süleyman, Eyyub'dan naklen haber verdi. O da Ebu'l-Halîl'den, o da Abdullah b. Hâris'den, o da Ümmü'l-Fadl'dan naklen rivayette bulunmuş. Ümmü'l-Fadl şunu söylemiş : Bir bedevi Nebi (Sallallahu Aleyhi ve Sellem) benim evimde iken, onun yanına girdi de : Yâ Nebiyyallâh! Benim bir karım vardı; üzerine bir daha evlendim. Derken birinci karım yeni zevcemi bir veya iki defa emzirmiş olduğunu söyledi; dedi. Bunun üzerine Nebiyyullah (Sallallahu Aleyhi ve Sellem) : «Bir ve iki defa emzirmek hürmet isbât eimez.» buyurdular. Amr kendi rivayetinde : «Abdullah b. Haris b. Nevfel'den naklen» dedi",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3592,
			"arabicnumber": "1451.02",
			"text": "Bana Ebu Gassân el-Mismaî rivayet etti. (Dediki): Bize Muâz rivayet etti. H. Bize Îbnü'l-Müsennâ ile îbnü Beşşâr da rivayet ettiler. (Dedilerki): Bize Muâz b. Hişâm rivayet etti. (Dediki): Bana babam, Katâde'den, o da Ebu'I-Halîl Salih b. Ebî Meryem'den, o da Abdullah b. Hâris'den, o da Ümmü'l-Fadl'dan naklen rivayet eyledi ki, Benî Âmir b. Sa'saa'dan bir zât: — Yâ Nebiyyâllah, bir defa emmek hürmet isbât eder mi? diye sormuş, Resulullah (Sallallahu Aleyhi ve Sellem): — «Hayır!» cevâbını vermiş",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3593,
			"arabicnumber": "1451.03",
			"text": "Bize Ebu Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Muhammed b. Bişr rivayet etti. (Dediki): Bize Saîd b. Ebî Arube, Katâde'den, o da Ebu'I-Halil'den, o da Abdullah b. Hâris'den naklen rivayet etti ki, Ümmü'l-Fadl Nebiyyullah (Sallallahu Aleyhi ve Sellem)’in : — «Bir veya iki rad'a yahud bir veya iki massa hürmet isbât etmez.» buyurduğunu rivayet etmiş",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3594,
			"arabicnumber": "1451.04",
			"text": "Bize bu hadîsi yine Ebu Bekr b. Ebî Şeybe ile İshâk b. İbrahim hep birden Abdetü'bnu Süleyman'dan, o da İbni Ebî Arube'den bu isnâdla rivayette bulundular, İshâk, İbni Bişr rivayeti gibi: «İki rad'a yâhud iki massa» dedi. îbnü Ebî Şeybe ise: «İki rad'a ve iki massa» şeklinde söyledi",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3595,
			"arabicnumber": "1451.05",
			"text": "Bize İbni Ebî Ömer rivayet etti. (Dediki); Bize Bişr b. Seriy rivayet etti. (Dediki); Bize Hammâd b. Seleme, Katâde'den, o da Ebu'l-Halîl'den, o da Abdullah b. Haris b. Nevfel'den, o da Ümmü'l-Fadl'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayette bulundu. Resulullah (Sallallahu Aleyhi ve Sellem): «Bir ve ikİ imlâca hürmet isbât etmez» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3596,
			"arabicnumber": "1451.06",
			"text": "Bana Ahmed b. Saîd ed-Dârimî rivayet etti, (Dediki): Bize Habbâri rivayet etti. (Dediki): Bize Hemmâm rivayet etti. (Dediki): Bize Katâde, Ebu'l-Halil'den, o da Abdullah b. Hâris'den, o da Ümmü'l-FadlJdan naklen rivayet etti. Bir adam Nebi (Sallallahu Aleyhi ve Sellem). Bir defa emmek hürmet isbât edermi? diye sormuş da Resulullah (Sallallahu Aleyhi ve Sellem) : «Hayır!» cevâbını vermiş",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3597,
			"arabicnumber": "1452.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, Abdullah b. Ebî Bekr'den dinlediğim, onun da Amra'dan, onun da Âişe'den naklen rivayet ettiği şu hadîsi okudum : Âişe: (Bilinen on defa emzirme hürmet isbât eder.) âyeti, indirilen Kur'ân meyânında idi; sonra bu adet beş ma'lum emme ile neshedildi; hattâ Resulullah (Sallallahu Aleyhi ve Sellem) bu on sayısı Kur'ân meyânında okunurken vefat etti; demiş",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3598,
			"arabicnumber": "1452.02",
			"text": "Bize Abdullah b. Meslemete'l-Ka'nebî rivayet etti. (Dediki); Bize Süleyman b. Bilâl, Yahya yâni İbni Saîd'den, o da Amra'dan naklen rivayet etti. Amra Hz. Âişe'yi, haram kılan süt'ü anlatırken dinlemiş. (Demişki): Âişe şunu söyledi: «Ma'lum on defa emme.» âyeti Kur'ân'da nazil olmuştur. Sonra «Beş ma'lum emme.» âyeti de nazil oldu",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3599,
			"arabicnumber": "1452.03",
			"text": "{…} Bize bu hadîsi Muhammed b. El-Müsennâ da rivayet etti. (Dediki): Bize Abdülvehhâb rivayet etti. (Dediki): Ben Yahya b. Saîd'den dinledim. (Dediki): Bana Amra: Bu hadîsin mislini söylerken Aişe'den dinledim, diye haber verdi",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3600,
			"arabicnumber": "1453.01",
			"text": "Bize Amru'n-Nâkıd ile îbni Ebî Ömer rivayet ettiler. (Dedilerki): Bize Süfyân b. Uyeyne, Abdurrahman b. Kaasim'den, o da babasından, o da Âîşe'den naklen rivayet etti. Âişe (Radiyallahu anka) şöyle demiş : — Sehle binti Süheyl Nebi (Sallallahu-Aleyhi ve Sellem)'e gelerek: Yâ Resulâllah! Ben Ebu Huzeyfe'nin âzâdlısı Sâlim'in yanıma girmesinden Ebu Huzeyfe'nin yüzünde hoşnudsuzluk görüyorum; dedi. Resulullah (Sallallahu Aleyhi ve Sellem): — «Onu emzir!» buyurdu. Sehle — Koskoca adam olduğu halde onu nasıl emziririm? dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) gülümsedi ve: — «Onun koskoca odam olduğunu biliyorum.» cevâbını verdi. Amr kendi hadîsinde: «Salim Bedir gazasında bulunmuştu.» cümlesini ziyâde etti. îböi Ebî Ömer'in rivayetinde ise: «Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) güldü» ibaresi vardır",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3601,
			"arabicnumber": "1453.02",
			"text": "Bize îshâk b. İbrahim El-Hanzalî ile Mubammed b. Ebî Ömer hep birden Sekafî'den rivayet ettiler. İbni Ebî Ömer dediki: Bize Abdülvehhâb Es-Sekafî, Eyyub'dan, o da İbni Ebî Müleyke'den, o da Kaasim'den, o da Âişe'den naklen rivayet ettiki, Ebu Huzeyfe'nin âzâdlısı Salim, evlerinde Ebu Huzeyfe ile ailesinin yanında bulunuyormuş. Derken Sehle binti Süheyl, Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: — Salim artık erkeklik çağına geldi; ve erkeklerin akıl ettikleri şeylere akıl erdirmeye başladı ama hâlâ yanımıza giriyor. Zannediyorum ki, bundan mutlaka Ebu Huzeyfe'nin hatırına bir şey geliyor; demiş. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) ona: «Salim'i emzır; ona haram o! da Ebu Huzeyfe'nin hatırına gelen şey gitsin!» buyurmuş. (Sehle bunu yapmış; ve) dönerek: — Ben o'nu emzirdim; Ebu Huzeyfe'nin hatırına gelen şey de gitti; demiş",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3602,
			"arabicnumber": "1453.03",
			"text": "Bize îshâk b. İbrahim ile Muhammed b. Râfi' rivayet ettiler. Lâfız İbni Râfi'indir. (Dediki): Bize Abdürrezzak rivayet etti. (Dediki): Bize İbni Cüreyc haber verdi. (Dediki): Bize İbni Ebî Müleyka haber verdi. Ona da Kaasim b. Muhammed b. Ebî Bekr; ona da Aişe haber vermişki, Sehle binti Süheyl b. Amr, Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek Ebu Huzeyfe'nin âzâdlısı Sâlim için: — Yâ Resulâllah! Sâlim evimizde bizimle beraber bulunmaktadır. Ama artık erkeklik çağına erişti. Erkeklerin bildiğini biliyor; demiş. Resulullah (Sallallahu Aleyhi ve Sellem) . — «Onu emzir; kendisine haram ol ! buyurmuş. İbni Ebî Müleyke demiş ki: — Bunun üzerine Kaasim'e hürmeten bir sene yâhud bir seneye yakın bir müddet bu hadîsten kimseye bahsetmeden durdum. Sonra Kaasim'e rastlayarak: Sen bana bir hadîs söylemiştin; ben onu hâlâ kimseye rivayet etmedim; dedim. Kaasim : — Nedir o? diye sordu. Ben de kendisine haber verdim. Kaasim: — Sen onu bana da Âişe haber vermiş olmak üzere benden rivayet et; dedi",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3603,
			"arabicnumber": "1453.04",
			"text": "Bize Muhammed h. El-Müsennâ rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etli. (Dediki): Bize Şu'be, Humeyd b. Nâfi'den, o da Zeyneb binti Ümmi Seleme'den naklen rivayette bulundu. Zeyneb şunu söylemiş: — Ümmü Seleme Âişe'ye dediki: Kendi yanıma girmesini istemediğim o sabî-i murahik [buluğa yaklaşmış çocuk] senin yanına giriyor. Âişe şu cevabı verdi: — Senin için Resulullah (Sallallahu Aleyhi ve Sellem)'de örnek yokmudur? Ebu Huzeyfe'nin karısı : — «Yâ Resulâllah! Salim artık adam olduğu halde yanıma girmeye devam ediyor. Ebu Huzeyfe'nin nefsinde bundan bir hoşnudsuzluk var; dedi de, Resulullah (Sallallahu Aleyhi ve Sellem): — «Onu emzir ki, yanına girebilsin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3604,
			"arabicnumber": "1453.05",
			"text": "Bana Ebu't-Tâhir ile Hârun b. Saîd el-Eylî rivayet ettiler. Lâfız Harun'undur. (Dedilerki): Bize İbni Vehb rivayet etti. (Dediki): Bana Mahramatü'bnü Bükeyr, babasından naklen haber verdi. (Demişki): Ben Humeyd b. Nâfi'i şöyle derken işittim : Ben Zeyneb binti Ebî Seîeme'yi şunu söylerken işittim: Ben Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Ümmü Seleme'yi Âişe'ye şunu söylerken dinledim: — Vallahi memeden ayrılmış çocuğun beni görmesine gönlüm razı olmuyor. Âişe şu cevabı verdi : — Neden? Sehle binti Süheyl Resulullah (Sallallahu Aleyhi ve Sellem)'e geldi de: Yâ Resulâllah! Vallahi Sâlim'in (yanıma) girmesinden Ebu Huzeyfe'nin yüzünde hoşnudsuzluk görüyorum, dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): — «Onu emzir!» buyurdu. Sehle : — Ama o saçlı sakallı (adam) dır; dedi. Resulullah (Sallallahu Aleyhi ve Sellem): — «Onu emzirki, Ebu Huzeyfe'nin yüzündeki hoşnudsuzluk gitsin!» buyurdular. İzah 1454 te",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3605,
			"arabicnumber": "1454",
			"text": "Bana Abdülmelik b. Şuayb b. Leys rivayet etti, (Dediki): Bana babam, dedemden rivayet etti. (Demişki): Bana Ukayl b. Hâlid, İbni Şihâb'dan rivayet etti. (Demişki): Bana Ebu Ubeydetü'bnü AbdiIIâh b. Zem'a haber verdi. Ona da Zeyneb binti Ebî Seleme haber vermişki, annesi ve Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Ümmü Seleme şunu söylüyormuş : — Nebi (Sallallahu Aleyhi ve Sellem)'in diğer zevceleri bu şekilde süt emmek ile bir kimsenin yanlarına girmesine razı olmamış; ve Aişe'ye: Vallahi biz bunu ancak Resulullah (Sallallahu Aleyhi ve Sellem)'in hassaten Sâlim'e verdiği bir ruhsat addediyoruz; bu nedenle bu şekilde süt emmekle yanımıza ne bir kimse girebilir, ne de bizi görebilir; demişlerdir. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3606,
			"arabicnumber": "1455.01",
			"text": "Bize Hennâd b. Seriy rivayet etti. (Dediki): Bize Ebu'I-Ahvas, Eş'as b. Ebi'ş-Şa'sâ'dan, o da babasından, o da Mesruk'dan naklen rivayet etti. (Demişki): Âişe şunu söyledi : — Resulullah (Sallallahu Aleyhi ve Sellem) yanıma girdi. Yanımda bir adam oturuyordu. Bu onun gücüne gitti. Ben gadab eserini yüzünde görerek : Yâ Resulâllah! Bu zât benim süt kardeşimdir; dedim. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Süt kardeşlerinizi iyi düşünün! Zîra süt hükmü ancak açlıktan dolayı sabit olur.» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3607,
			"arabicnumber": "1455.02",
			"text": "{…} Bize bu hadîsi Muhammed b. el-Müsennâ ile İbni Beşşâr da rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. H. Bize Ubeydullah b. Muâz da rivayet etti. İki râvi hep birden; Bize Şu'be rivayet etti, dediler. H. Bize Ebu Bekr b. Ebî Şeybe dahî rivayet etti. (Dediki): Bize Vekî' rivayet etti. H. Bana Züheyr b. Harb da rivayet etti. (Dediki): Bize Abdurrahmân b. Mehdî rivayet etti. Bunlar toptan Süfyân'dan rivayette bulunmuşlardır. H. Bize Abd b. Humeyd dahî rivayet etti. (Dediki): Bize Hüseyn el-Cu'fi, Zâide'den rivayet etti. Bunların hepsi Ebu'l-Ahvas'ın isnadı ile onun hadîsi mânâsında rivayette bulunmuşlardır. Yalnız bunlar (radâa yerine) mecâattan» demişlerdir",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3608,
			"arabicnumber": "1456.01",
			"text": "Bize Ubeydullah b. Ömer b. Meyserate'î-Kavârirî rivayet etti. (Dediki): Bize Yezîd b. Zürey' rivayet etti. (Dediki): Bize Saîd b. Ebî Arube, Katâde'den, o da Ebu'I-Halîl Sâlih'den, o da Ebu AIkametel-Hâşimî'den, o da Ebü Saîd-i Hudrî'den naklen rivayet etti ki, Resulullah (Sallallahu Aleyhi ve Sellem) Huneyn günü Evtâs'a bir ordu göndermiş. Bunlar düşman'a tesadüf ederek onlarla çarpışmış ve muzaffer olmuşlar. Bir takım esirler de almışlar. Galiba Resulullah (Sallallahu Aleyhi ve Sellem)'in ashabından bazı kimseler, müşriklerden kocaları bulunmaları hasebiyle esîr kadınlara yakınlık etmekten çekinmişler. Bunun üzerine Allah (Azze ve Celle) bu bâbta şu âyet-i kerîmeyi indirmiş : «Kadınların evli olanları da (size haramdır), ancak mâlik olduklarınız müstesna...» [ Nisa 24 ] yâni, îddetleri geçtikten sonra onlar size helâldır",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3609,
			"arabicnumber": "1456.02",
			"text": "Bize Ebu Bekr b. Ebî Şeybe ile Muhammedü'bnü'l-Müsennâ ve İbni Beşşâr rivayet ettiler. (Dedilerki): Bize Abdülalâ, Saîd'den, o da Katâde'den, o da Ebu'l-Halîl'den naklen rivayet ettiki, Ebu Alkamete'l-Hâşimî'nin nakline göre Ebu Saîd-i Hudrî kendilerine Nebiyyullah (Sallallahu Aleyhi ve Sellem)'in Huneyn günü bir seriyye gönderdiğini Yezîd b. Zürey' hadîsi mânâsında rivayet etmiş. Yalnız o : «Ancak o kadınlardan sizin mülkünüz olanlar müstesna! Böyleleri size helâldir.» demiş; «iddetleri bittiği vakit...» cümlesini zikrelmemiştir",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3610,
			"arabicnumber": "1456.03",
			"text": "{…} Bana bu hadîsi Yahya b. Habîb el-Hârisî de rivayet etti. (Dediki): Bize Hâlid yâni İbni'l-Hâris rivayet etti. (Dediki): Bize Şu'be, Katâde'den bu isnâdla bu hadîsin benzerini rivayet etti",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3611,
			"arabicnumber": "1456.04",
			"text": "Bana bu hadîsi (yine) Yahya b. Habib el-Hârisî rivayet etti. (Dediki): Bize Hâlid b. el-Hâris rivayet etti. (Dediki): Bize Şu'be, Katâde'den, o da Ebu'l-Halil'den, o da Ebu Saîd'den naklen rivayet eyledi. Ebu Saîd şöyle demiş : Ashâb, Evtâs günü kocaları olan bir takım kadınlar esîr ettiler de endîşeye düştüler. Bunun üzerine şu âyet indirildi: «Kadınlardan evli olanlar da (size haramdır) ancak mülkünüz olanlar müstesna!»",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3612,
			"arabicnumber": "1456.05",
			"text": "{…} Bana (yine) Yahya b. Habîb rivayet etti. (Dediki): Bîze Hâlid yâni İbni'l-Hâris rivayet etti. (Dediki): Bize Saîd, Katâde'den bu isnâdla bu hadîsin benzerini rivayet etti. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3613,
			"arabicnumber": "1457.01",
			"text": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Leys rivayet etti. H. Bize Muhammed b. Rumh da rivayet etti. (Dediki); Bize Leys, İbni Şihâb'dan, o da Urve'den, o da Âİşe'den naklen haber verdiki, şöyle demiş: Sa'dubnu Ebî Vakkas ile Abd b. Zem'a bir çocuk hakkında münakaşa ettiler. Sa'd: — Yâ Resulâllah! Bu çocuk benim kardeşim Utbetü'bnü Ebî Vakkaas'ın oğludur. Oğlu olduğunu bana vasîyyet etti. O'na benzeyişine bak! dedi. Abd b. Zem'a da: — Bu benim kardeşimdir yâ Resulâllah! Babamın döşeği üzerinde onun cariyesinden doğmuştur; iddiasında bulundu. Derken Resulullah (Sallallahu Aleyhi ve Sellem) çocuğun benzerliğine baktı ve Utbe'ye apaçık benzeriik gördü. Bunun üzerine: — «O senindir yâ Abd Çocuk firâş sahibinindir. Zânî'ye de taş vardır. Sen de ondan kaç yâ Sevde btnti Zem'a!» buyurdular. Hz. Âişe: «Artık bu çocuk Sevde'yi hiç görmedi» demiş. Muhammed b. Rumh: «Yâ Abd!» sözünü zikretmemiştir. Diğer tahric: Hadisi Buhari (2053, 2218, 2421, 2533, 2745, 4303, 6749, 6765, 6817, 7182), Ebu Davud (2273), Nesai s-küb. (5648, 5651); İbn Mace (2004), Ahmed, Müsned (24086) ve İbn Hibban (4105) rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3614,
			"arabicnumber": "1457.02",
			"text": "{…} Bize Saîd b. Mansur ile Ebu Bekr b. Ebî Şeybe ve Amru'n-Nâkıd rivayet ettiler. (Dedilerki): Bize Süfyân b. Uyeyne rivayet etti. H. Bize Abd b. Humeyd de rivayet etti. (Dediki): Bize Abdurrezzâk haber verdi. (Dediki): Bize Ma'mer haber verdi. Her iki râvi Zührî'den bu isnâdla bu hadîsin benzerini rivayet etmişlerdir. Şu kadar var ki, Ma'mer ile İbni Uyeyne kendi rivayetlerinde: «Çocuk firaş sahibinindir.» demiş; «Zânîye taş gerekir» cümlesini zikretmemişlerdir. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3615,
			"arabicnumber": "1458.01",
			"text": "Bana Muhammed b. Râfi' ile Abd b. Humeyd rivayet ettiler. İbni Râfi' (Dediki): Bize Abdürrezzak rivayet etti. (Dediki): Bize Ma'mer, Zührî'den, o da İbni'l-Müseyyeb ile Ebu Seleme'den, onlar da Ebu Hureyre'den naklen haber verdiki. Resulullah (Sallallahu Aleyhi ve Sellem): «Çocuk firâş sahibinindir; Zânî'ye de taş vardır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3616,
			"arabicnumber": "1458.02",
			"text": "{…} Bize Saîd b. Mansur ile Züheyr b. Harb, Abdü'l âlâ b. Hammâd ve Amru'n-Nâkıd rivayet ettiler. (Dedilerki): Bize Süfyân, Zührî'den rivayet etti. İbni Mansur: Saîd'den, o da Ebu Hureyre'den naklen dedi. Abdülâlâ: Ebu Seleme'den yâhud Saîd'den. o da Ebu Hureyre'den naklen dedi. Züheyr: Saîd'den yâhud Ebu Seleme'den bîri yâhud her ikisi Ebu Hureyre'den naklen ifâdesini kullandı. Amr ise: Bize Süfyân bir defa. Zührî'den, o da Saîd ile Ebu Seleme'den diyerek; bir defa, Saîd'den yâhud Ebu Seleme'den ifadesiyle; başka bir defa da: Saîd'den, o da Ebu Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellemj'den, ibaresi ile rivayet etti; dedi. Bunlar Ma'mer'in hadîsi gibi rivayette bulunmuşlardır)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3617,
			"arabicnumber": "1459.01",
			"text": "Bize Yahya b. Yahya ile Muhammed b. Rumh rivayet ettiler. (Dedilerki): Bize Leys haber verdi. H. Bize Kuteybetü'bnü Saîd de rivayet etti. (Dediki): Bize Leys, İbni Şihab'dan, o da Urve'den, o da Aişe'den naklen rivayet eyledi. Aişe (Radiyallahu anha) şöyle demiş : Resulullah (Sallallahu Aleyhi ve Sellem) sevinçli, yüzünün hatları parlar bir halde yanıma girdi ve : «Gördün mü! Demin Mücezziz Zeyd b. Harisa ile Usame ibmi Zeyd'e baktı da: ‘Şüphesiz bu ayaklar birbirindendir’; dedi.» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3618,
			"arabicnumber": "1459.02",
			"text": "Bana Amru'n-Nakid ile Züheyr b. Harb ve Ebu Bekr b. Ebî Şeybe rivayet ettiler. Lafız Amr'ındir. (Dedilerki): Bize Süfyan, Zührî'den, o da Urve'den, o da Aişe'den naklen rivayet etti. Aişe şöyle demiş: Bir giin Resulullah (Sallallahu Aleyhi ve Sellem) sevinçle yanıma girdi ve: «Ya Aişe! Görmedin mi! Mücezziz el-Müdlicî yanıma girdi de Usame ile Zeyd'i gördü. Üzerlerinde bir kadife vardı. Onunla başlarını örtmüşler; ayakları açık kalmıştı. Mücezziz: Şüphesiz bu ayaklar birbirinden (meydana gelmiş) dır, dedi.» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3619,
			"arabicnumber": "1459.03",
			"text": "Bize bu hadîsi Mansur b. Ebî Müzahim dahî rivayet etti. (Dediki): Bize İbrahim b. Sa'd, Zührî'den, o da Urve'den, o da Aişe'den naklen rivayet etti, Aişe (Radiyallahu anha) şöyle demiş: Usame ibn-i Zeyd ile Zeyd b. Harise yatarlarken içeri bir kaif girmiş. Resulullah (Sallallahu Aleyhi ve Sellem) de orada imiş. Kaif: Şüphesiz bu ayaklar birbirinden olmadır; demiş. Nebi (Sallallahu Aleyhi ve Sellem) buna sevinerek hoşnud kalmış da; Aişe'ye (bana) haber verdi",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3620,
			"arabicnumber": "1459.04",
			"text": "{…} Bana Harmeletübnü Yahya rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Yunus haber verdi. H. Bize Abd b. Humeyd de rivayet etti. (Dediki): Bize Abdürrezzak haber verdi. (Dediki): Bize Ma'mer ile îbnü Cüreyc haber verdiler. Bu ravilerin hepsi Zührî'den bu isnadla yukarıkilerin hadîsi manasında rivayette bulunmuşlardır. Yunus hadîsinde: «Mücezziz kaif idi» ziyadesi vardır. Diğer tahric: Buhari Feraiz; Ebu Davud ile Nesaî Talak; Tirmizî Vela",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3621,
			"arabicnumber": "1460.01",
			"text": "Bize Ebu Bekr b. Ebî Şeybe ile Muhammed b. Hatim ve Yâkub b. İbrahim rivayet etliler. Lâfız Ebu Bekr'indir. (Dedilerki): Bize Yahya b. Saîd, Süfyân'daıı. o da Muhammed b. Ebî Bekr'den, o da Abdülnıelik b. Ebî Bekr b. Abdirrahmân b. Haris b. Hişâm'dan, o da babasından, o da Ümmü Seleme'den naklen rivayet ettiki, Resulullah (Sallallahu Aleyhi ve Sellem) Ümmü Seleme ile evlendiği vakit yanında üç gece kalmış ve : «Şüphesiz kİ sana ehlinden bîr hakaret yoktur, istersen sana yedi geceyi tamamlarım. Ama sana yediyi tamamlarsam (diğer) kadınlarıma da tamamlarım.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3622,
			"arabicnumber": "1460.02",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, Abdullah b. Ebî Bekr'den, onun da Abdülmelik b. Ebî Bekr b. Abdirrahman'dan naklen rivayet ettiği şu hadîsi okudum: Resulullah (Sallallahu Aleyhi ve Sellem) Ümmü Seleme ile evlenerek Hz. Ümmü Seleme yanında sabahladığı vakit ona şöyle buyurmuşlar: «Sana ehlinden bir hakaret yoktur, istersen senin yanında yedi geceyi tamamlarım. dilersen üç gece kalır, sonra (diğer kadınlarımı) dolaşırım.» Ümmü Seleme: «Üç gece kal!» demiş",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3623,
			"arabicnumber": "1460.03",
			"text": "{…} Bize Abdullah b. Meslemete'l-Ka'nebî rivayet etti. (Dediki): Bize Süleyman yâni İbni Bilâl, Abdurrahmân b. Humeyd'den, o da Abdülmelik b. Ebî Bekr'den, o da Ebu Bekr b. Abdirrahmân'dan naklen rivayet etti ki, Resulullah {Sallallahu Aleyhi ve Sellem) Ümmü Seleme ile evlenerek zifaf'a girdiği zaman yanından çıkmak istediğinde Ümmü Seleme elbisesinden tutmuş. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) «İstersen senin yanında daha fazla kalayım ve bunu senin nevbetine sayayım. Bakire'ye yedi, dul'a üç gece (zifaf hakkı) vardır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3624,
			"arabicnumber": "1460.04",
			"text": "{…} Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Ebu Damre, Abdurrahmân b. Humeyd'den bu isnâdla bu hadîsin mislini haber verdi",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3625,
			"arabicnumber": "1460.05",
			"text": "Bana Ebu Kureyb Muhammed b. Alâ' rivayet etti. (Dediki): Bize Hafs yâni İbni Gıyâs, Abdülvâhid b. Eymen'den, o da Ebu Bekr b. Abdirrahmân b. Haris b. Hişâm'dan, o da Ümmü Seleme'den naklen rivayette bulundu. Resulullah {Sallallahu Aleyhi ve Sellem)'in Ümmü Seleme ile evlendiğini ve daha bazı şeyler anlattı. Şu da anlattıkları meyamndadır. Nebi (Sallallahu Aleyhi ve Sellem): «İstersen sana da diğer kadınlarıma da yedi geceyi tamamlarım. Sana yedi'yi tamamlarsam öteki kadınlarıma da tamamlarım.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3626,
			"arabicnumber": "1461.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Hüşeym, Hâlid'den, o da Ebu Kılâbe'den, o da Enes h. Mâlik'den naklen haber verdi. Enes şöyle demiş : «Bir adam bakire kızı dul kadının üzerine alırsa onun yanında yedi gece kalır. Dulu bakirenin üzerine alırsa yanında üç gece kalır.» Hâlid demişki: «Enes bu hadîsi merfu' olarak rivayet etmiştir desem doğru söylemiş olurum. Lâkin o: Sünnet böyledir, dedi.»",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3627,
			"arabicnumber": "1461.02",
			"text": "Bana Muhammed b. Râfi' rivayet etti. (Dediki): Bize Abdürrezzâk rivayet etti. (Dediki): Bize Süfyân. Eyyub ile Hâlid-i Hazzâ'dan, onlar da Ebu Kılâbe'den. o da Enes'den naklen haber verdi. Enes (Radiyallahu anh): «Evlenen bir kimsenin bakire olan karısının yanında yedi gece kalması sünnettendir.» demiş. Hâlid: «İstesem: Enes bu hadîsi Nebi (Sallallahu Aleyhi ve Sellem)'e ref etti, derdim.» demiş",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3628,
			"arabicnumber": "1462",
			"text": "Bize Ebu Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Şebâbetü'bnü Sevvâr rivayet etti. (Dediki): Bize Süleyman b. Muğîre, Sâbit'den, o da Enes'den naklen rivayet etti. Enes şöyle demiş : Nebi (Sallallahu Aleyhi ve Sellem)'in dokuz zevcesi vardı. Bunlar arasında kasim yaptığı zaman ilk kadın'a ancak dokuzuncudan sonra varırdı. Zevceleri her gece onun geleceği evde toplanırlardı. Bir defa Aişe'nin evinde bulunuyormuş. Derken Zeyneb gelmiş. Resulullah (Sallallahu Aleyhi ve Sellem) ona elini uzatmış. Aîşe (Radiyallahu anha): O Zeynebtir, demiş. Nebi (Sallallahu Aleyhi ve Sellem) de elini çekmiş. Müteakiben iki kadın atışmaya başlamışlar, o derece ki sesleri birbirine karışmış. Bu sırada ezan okunmuş. Ebu Bekr bu gürültünün yanından geçerek kadınların seslerim işitmiş ve : — Yâ Resulâllah namaz'a çık! Onların da ağızlarına toprak saç! demiş. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) çıkmış. Arkasından Âişe: Şimdi Nebi (Sallallahu Aleyhi ve Sellem) namazını bitirir. Ve Ebu Bekr gelerek bana yapacağını yapar; demiş. (Filhakika) Nebi (Sallallahu Aleyhi ve Sellem) namazını bitirdiği vakit Ebu Bekr Âişe'nin yanına gelerek kendisine ağır lâf söylemiş: «Sen böyle mi yapıyorsun?» demiş",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3629,
			"arabicnumber": "1463.01",
			"text": "Bize Züheyr b. Harb rivayet etti. (Dediki): Bize Cerîr, Hişâm b. Urve'den, o da babasından, o da Âişe'den naklen rivayet etti. Âişe şöyle demiş : Ben Sevde binti Zem'a'dan daha ziyâde kendi teninde olmak istediğim bir kadın görmedim. Kendisinde salâbet bulunan bîr kadın: Yaşlanınca Resulullah (Sallallahu Aleyhi ve Sellem)'den olan nevbet gününü Âişe'ye verdi Yâ Resulâllah. senden olan günümü Aişe'ye verdim; dedi. Bundan sonra Resulullah {Sallallahu Aleyhi ve Sellem) Âişe'ye bîri kendinin biri de Sevde'nin günü olmak üzere iki gün ayırıyordu",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3630,
			"arabicnumber": "1463.02",
			"text": "Bize Ebu Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Ukbetü'bnü Hâlid rivayet ettî. H. Bize Amru'n-Nâkıd da rivayet etti. (Dediki): Bize Esved b. Âmir rivayet etti. (Dediki): Bize Züheyr rivayet eyledi. H. Bize Mücâhid b. Müsâ daîıî rivayet etti. (Dediki): Bize Yunus b. Muhammed rivayet etti. (Dediki): Bize Şerik rivayet etti. Bu râvilerin hepsi Hişâm'dan bu isnâdla «Sevde yaşlandığı vakit...» diyerek Cerîr hadîsi mânâsında rivayette bulunmuşlardır. Şerîk'in hadîsinde: «Âişe dediki: Sevde Resulullah (Sallallahu Aleyhi ve Sellem)'in benden sonra aldığı ilk kadındı.» cümlesini ziyâde etmiştir",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3631,
			"arabicnumber": "1464.01",
			"text": "Bize Ebu Kureyb Muhammed b. Alâ' rivayet etti. (Dediki): Bize Ebu Usâme Hişâm'dan, o da babasından, o da Âişe'den naklen rivayet etti. Âişe şöyle demiş : «Ben kendilerini Resulullah (Sallallahu Aleyhi ve Sellem)'e bağışlayan kadınları ayıplar da: Hiç kadın kendini hibe eder mi! derdim, Allah (Azze ve Celle) : (O kadınlardan dilediğini geriye bırakır, dilediğini kendine alırsın. Boşadıklarından arzu ettiğini almanda sana bir mes'uliyet yoktur.) [ Ahzab 51 ] âyet-i kerimesini indirince : Vallahi Rabbinin senin arzunu hemen yerine getirdiğini görüyorum, dedim.»",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3632,
			"arabicnumber": "1464.02",
			"text": "Bize bu hadîsi Ebu Bekr b. Ebî Şeybe de rivayet etti. (Dediki): Bize Abdetü'bnü Süleyman, Hişâm'dan, o da babasından, o da Âişe'den naklen rivayet etti. Âişe şöyle dermiş : «Ben: Hiç kadın kendini bir erkeğe hibe etmekten utanmıyor mu? diyordum. Nihayet Allah (Azzc ve Celle) (O kadınlardan dilediğini geriye bırakır; dilediğini kendine alırsın!..) âyet-i kerîmesini indirince: Hakikaten Rabbin senin arzunu hemen yerine getiriyor, dedim.» Diğer tahric: Hadisi Buhari (4788, 5113), Müslim 1464 (49, 50), İbn Mace (2000), Mesai, (5287, 8878 ile 11350.)Ahmed, Müsned (25026), Tahavi, Şerh Müşkili'l-Asar (6063, 6064, 6065) İbn Hibban (6367) rivayet etti",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3633,
			"arabicnumber": "1465.01",
			"text": "Bize İshâk b. İbrahim ile Muhammed b. Hatim rivayet ettiler. Muhammed b. Hatim (Dediki): Bize Muhammed b. Bekr rivayet etti. (Dediki): Bize İbni Cüreyc haber verdi. (Dediki): Bana Atâ' haber verdi. (Dediki): İbni Abbâs ile birlikte Şerif'de Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Meymune'nin cenazesinde bulunduk, îbni Abbâs: «Bu kadın Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesidir. İmdi tabutunu kaldırdığımız zaman sarsmayın, sallamayın, hoş tutun! Filhakika ResululIah (Sallallahu Aleyhi ve Sellem)'in nikâhında dokuz kadın vardı. (Bunların) sekizine kasm yapar; birine yapmazdı.» dedi. Atâ': «Kendisine kasim yapmadığı zevcesi Safîyye binti Huyey b. Âhtab idi» demiş",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3634,
			"arabicnumber": "1465.02",
			"text": "Bize Muhammed b. Râfi' ile Abd b. Humeyd hep birden Abdürrezazk'dan, o da İbni Cüreyc'den bu isnâdla rivayette bulundular. İbnî Cüreyc şunu da ziyade etmiş: «Atâ' dediki: Ezvâc-ı tâhirâtın en son vefat edeni bu kadın idi; Medine'de vefat etmiştir.»",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3635,
			"arabicnumber": "1466",
			"text": "Bize Züheyr b. Harb ile Muhammedü'bnü'l-Müsennâ ve Ubeydullah b. Saîd rivayet ettiler. (Dedilerki): Bize Yahya b. Saîd, UbeyduUah'dan naklen rivayet etti. (Demişki): Bana Saîd b. Ebî Saîd babasından, o da Ebu Hureyre'den. o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi, «Kadın dört şey için nikâh edilir: Malı, asaleti, güzelliği ve dîni için. Sen dindarına zaferyâb ol ellerin topraklansın!» buyurmuşlar. İzah için bir sonraki sayfaya geçin",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3636,
			"arabicnumber": "715.04",
			"text": "Bize Muhammed b. Abdillah b. Numeyr rivayet etti. (Dekiki): Bize babam rivayet etti. (Dediki): Bize Abdülmelik b. Ebî Süleyman, Ata'dan naklen rivayet etti. (Demişki): Bana Cabir b. Abdillah haber verdi. (Dediki): Resulullah (Sallallahu Aleyhi ve Sellem) zamanında bir kadınla evlendim. Sonra Nebi (Sallallahu Aleyhi ve Sellem)'e tesadüf ettim. (Bana): «Ya Cabir, evlendin mi?» diye sordu. — Evet, cevabını verdim. «Bakire mi, dul mu?» dedi. — Dul, dedim. «Bakire olsaydın ya! Onunla oynaşırdın!» buyurdu. Ben: — Ya Resulallah. benim kız kardeşlerim vardır; onlarla aramıza girer diye korktum, dedim. «O halde öyle olsun. Zira kadın ya dîni, ya malı, yahud güzelliği için alınır. Sen dindarını almağa bak, ellerin topraklansın!» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3637,
			"arabicnumber": "715.05",
			"text": "Bize Ubeydullah b. Muaz rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, Mubarib'den, o da Cabir b. Abdillah'dan naklen rivayet etti. Cabir şöyle demiş : — Ben bir kadınla evlendim. Derken Resulullah (Sallallahu Aleyhi ve Sellem) bana : «Evlendin mi?» diye sordu. Ben: — Evet, cevabını verdim. «Bakire mi, dul mu?» dedi, — Dul, dedim. . «Bakireler ve onların cilveleri varken sen nerede geziyorsun?» buyurdular. Şu'be demiş ki : «Ben bu hadîsi Amr b. Dinar'a söyledim de bana şu cevabı verdi : Onu Cabir'den ben de işittim; ancak o : «Kız alsaydın ya! Sen onunla, o seninle oynaşırdınız» dedi",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3638,
			"arabicnumber": "715.06",
			"text": "Bize Yahya b. Yahya ile Ebu'r-Rabî'ez-Zehranî rivayet ettiler. Yahya dediki: Bize Hammad b. Zeyd, Amr b. Dinar'dan, o da Cabir b. Abdillah'dan naklen haber verdi. (Demişki): Babam Abdullah vefat ederek dokuz kız bıraktı —yahud yedi kız demiş—. Derken ben dul bir kadınla evlendim. Resulullah (Sallallahu Aleyhi ve Sellem) bana; «Ya Cabir, evlendin mi?» diye sordu. — Evet, cevabını verdim. «Bakîre mi aldın, dul mu?» dedi. — Hayır, dul aldım ya Resulallah! dedim. «Bakire alsaydın ya! Sen onunla, o seninle oynaşırdınız!» buyurdular. —Yahud birbirinizi güldürürdünüz— buyurdu. Resulullah (Sallallahu Aleyhi ve Sellem)'e dedim ki: — Gerçekten Abdullah helak oldu ve dokuz —yahud yedi— kız bıraktı. Ben de onlara kendileri gibi bir kız getirmeyi yahud bîr kızla gelmeyi doğru bulmadım. Onlara bakış görüş edecek bir kadın getirmek istedim. Resulullah (Sallallahu Aleyhi ve Sellem): «Öyle ise Allah sana mübarek eylesin!» buyurdu; yahud bana hayır duada bulundu. Ebu'r-Rabî'in rivayetinde: «Sen onunla, o seninle oynaşır; ve birbirinizi güldürürdünüz.» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3639,
			"arabicnumber": "715.07",
			"text": "{…} Bu hadîsi bize Kuteybetü'bnü Saîd de rivayet etti. (Dediki): Bize Süfyan, Amr'dan, o da Cabir b. Abdillah'dan naklen rivayet etti. Cabir şöyle demiş: «Resulullah (Sallallahu Aleyhi ve Sellem) bana: «Evlendin mi ya Cabir?» dedi. Ravi hadîsi: «Onlara bakacak ve saçlarını tarayacak bîr kadın...» cümlesine kadar rivayet etmiş; Resulullah (Sallallahu Aleyhi ve Sellem)'in : «isabet etmişsin!» buyurduğunu söylemiş; sonrasını zikretmemiştir",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3640,
			"arabicnumber": "715.08",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Hüşeym, Seyyar'dan, o da Şa'bî'den, o da Cabir b. AbdiIIah'dan naklen haber verdi. Cabir şöyle demiş: Bir gazada Resulullah (Sallallahu Aleyhi ve Seîlem) ile beraber idik. Döndüğümüz vakit ben yavaş giden bir deveme binerek (herkesten) acele davrandım. Derken arkamdan bana bir suvari yetişerek elindeki sopa ile dürttü. Bunun üzerine hayvanım görmüş olduğun en iyi develer gibi koşmağa başladı. Bir de baktım Resulullah (Sallallahu Aleyhi ve Seîlem)'in huzurunda değil miyim! (Bana) : «Neye acele ediyorsun ya Cabir?» dedi, — Ya Resulallah, ben yeni evliyim, dedim. vBakİre ile mi evlendin, dul ile mi?» dîye sordu, — Dul aldım, dedim. «Bakire alsadyın ya! Sen onunla, o seninle oynaşırdınız!» buyurdu. Medine'ye geldiğimizde şehre girmeye hazırlandık. Resulullah (Sallallahu Aleyhi ve Seîlem): «Ağır olun! Ta ki dağınık saçlı kadının taranması; kocası evde olmayanın kasıklarını tıraş edebilmesi için şehre geceleyin yani yatsı zamanı girelim!» buyurdular ve şunu ilave ettiler: «Medine'ye vardığın zaman cima' etmeye bak, cima' etmeye!»",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3641,
			"arabicnumber": "715.09",
			"text": "{…} Bize Muhammedu'bnü'l-Müsenna rivayet etti. (Dediki): Bize Abdülvehhab yani İbni Abdümecîd es-Sekafî rivayet etti. (Dediki): Bize UbeyduIIah, Vehb b. Keysan'dan, o da Cabir b. Abdillah'dan naklen rivayet etti. Cabir şöyle demiş : Resulullah (Sallallahu Aleyhi ve Sellem) ile birlikte bir gazaya çıktım. Devem beni geri bıraktı. Derken yanıma Resulullah (Sallallahu Aleyhi ve Sellem) gelerek bana : «Ya Cabir!» diye seslendi. — Efendim, dedim. «Ne haldesin?» dedi. — Devem beni geri bıraktı ve bîtab düştü de arkada kaldım; cevabını verdim. Bunun üzerine hayvanından inerek bastonu ile devemi çekti. Sonra (bana) : «Bin!» dedi. Ben de bindim, Yemin olsun hayvanım Resulullah (Sallallahu Aleyhi ve Seîlem)'in devesini geçmesin diye onu durdurmağa çalıştığımı bilirim. Resulullah (Sallallahu Aleyhi ve Sellem) ; «Evlendin mi?» diye sordu. — Evet, cevabını verdim. «Bakire mi aldın, dul mu?» dedi. — Dul aldım, dedim. «Bakire alsaydın ya! Sen onunla, o seninle oynaşırdınız!» buyurdular. — Benim kız kardeşlerim vardır. Bu sebeple onları toplayıp başlarını tarayacak, kendilerine bakacak bir kadınla evlenmek istedim; dedim. «Dikkat et! işte geliyorsun! Evine vardığında cima' etmeye bak, cima' etmeye!» buyurdu. Sonra : «Deveni satıyor musun?» diye sordu. — Evet, dedim. Onu bir okıyye mukabilinde benden satın aldı. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) (Medine'ye) geldi. Ben ertesi gün geldim. Az sonra mescide geldim; ve onu mescidin kapısında buldum. (Bana) : «Şimdimi geldin?» dîye sordu. — Evet, dedim. «Öyle ise deveni bırak da gir iki rek'at namaz kıl!» buyurdular. Hemen içeri girerek namaz kıldım. Sonra döndüm. Resulullah (Sallallahu Aleyhi ve Sellem) Bilal'a benim için bir okıyye tartmasını emir buyurdu. Bilal de dolu dolu tarttı. Ben oradan çekildim. Uzaklaştığım vakit: «Bana Cabir'i çağır!» emrini vermiş. Beni çağırdılar. (İçimden) şimdi deveyi bana iade edecek, dedim. Bu hayvan kadar kendisinden hoşlanmadığım hiç bir şey yoktu. «Al deveni! Parası da senîn olsun!» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3642,
			"arabicnumber": "715.10",
			"text": "Bize Muhammed b. Abdila'la rivayet etti. (Dediki): Bize Mu'temir rivayet etti. (Dediki): Ben babamdan işittim. (Dediki): Bize Ebu Nadra, Cabir b. Abdilîah'dan naklen rivayet etti. Cabir şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) ile birlikte bir seferde idik. Ben su taşıyan bir devenin üzerinde idim, O da ordunun gerisinde bulunuyordu... (Ravi diyorki) : Cabir, Resulullah (Sallallahu Aleyhi ve Sellem)'in kendisine çarptığını yahud dürttüğünü söyledi. Zannederim: elindeki bir şeyle dedi. (Ve sözüne devamla) şunları anlattı: Bundan sonra Nebi (Sallallahu Aleyhi ve Seîlem), herkesi geçmeğe başladı. Beni çekiştiriyor hatta kendisine mani' oluyordum. Derken Resulullah (Sallallahu Aleyhi ve Seîlem): «Bu deveyi bana şu kadara satar mısın? Allah da seni mağfiret buyursun!» diye sordu. — O senindir ya Nebiyyalîah! dedim. (Tekrar) : «Bu deveyi bana şu kadara satar mısın? Allah da seni mağfiret buyursun!» dedi. — O senindir ya Nebiyyallah! dedim. Bana: «Baban öldükten sonra evlendin mi?» diye sordu. — Evet, dedim. «Dul mu «aldın, bakire mi?» buyurdu. «Bakire alsaydın ya! Birbirinizi güldürür; o seninle sen onunla oynaşırdınız!» buyurdular. Ebu Nadra demiş ki : Artık bu söz müslümanların diline tesbih oldu: Şöyle şöyle yap! Allah da seni mağfiret buyursun! demeye başladılar",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3643,
			"arabicnumber": "715.11",
			"text": "Bana Muhammed b. Abdillah b. Numeyr el-Hemdanî rivayet etti. (Dediki): Bize Abdullah b. Yezîd rivayet etti. (Dediki): Bize Hayve rivayet etti. (Dediki): Bana Şurahbîl b. Şerîk haber verdi; o da Ebu Abdirrahman el-Hubulî'yi, Abdullah b. Amr'dan naklen rivayette bulunurken işitmiş ki, Resulullah (Sallallahu Aleyhi ve Sellem); «Dünya bir meta'dır; dünya meta'ının en hayırlısı ise saliha kadındır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3644,
			"arabicnumber": "715.12",
			"text": "Bana Harmeletü'bnü Yahya rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Yunus, İbni Şihâb'dan naklen haber verdi. (Demişki): Bana İbni'l-Müseyyeb, Ebu Hureyre'den nak!en rivayet etti. Ebu Hureyre şöyle demiş: Resulullah (Sallallahu Aleyhi vi Sellem) : «Gerçekten kadın kaburga kemiği gibidir. Onu doğrultmağa kalkarsan kırarsın. Hâli üzere bırakırsan kendisinden, eğrilik bulunduğu halde istifâde edersin.» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3645,
			"arabicnumber": "1467.01",
			"text": "{…} Bana Züheyr b. Harb ile Abd b. Humeyd ikisi birden Ya'kub b, İbrâhîm b. Sa'd'dan, o da Zührî'niıı kardeşi oğlundan, o da amcasından bu isnâdla bu hadîsin tamamiyle mislini rivayet ettiler",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3646,
			"arabicnumber": "1467.02",
			"text": "Bize Amru'n-Nâkıd ile İbni Ebî Ömer rivayet ettiler. Lâfız İbni Ebî Ömer'indir. (Dedilerki) : Bize Süfyân, Ebu'z-Zinâd'dan, o da A'rec'den, o da Ebu Hureyre'den naklen rivayet etti. Ebu Hureyre şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) : «Şüphesiz ki, kadın kaburga kemiğinden yaratılmıştır. Senin için yeknasak bir şekilde doğrulmaz. Ondan istifade etmek istersen kendisinde eğrilik olduğu halde istifâde edersin; doğrultmaya kalkarsan kırarsın. Kadının kırılması boşanmasıdır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3647,
			"arabicnumber": "1468.01",
			"text": "Bize Ebu Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Hüseyn b. Alî, Zâide'den, o da Meysera'dan, o da Ebu Hâzim'den, o da Ebu Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Se!lem)'den naklen rivayette bulundu; «Her kim Allah'a ve âhiret gününe îmân ederse bir şey gördüğü zaman yâ hayır söylesin; yahud sussun! Kadınlar hakkındaki vasiyyeti (mi) tutun! Çünkü kadın kaburga kemiğinden yaratılmışıtır. Kaburganın en eğri yeri de üst kısmıdır; doğrultmağa kalkarsan kırarsın; (hâli üzere) bırakırsan eğri kalmakta devam eder. Kadınlar hakkında birbirinize hayır tavsiye edin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3648,
			"arabicnumber": "1468.02",
			"text": "Bana İbrahim b. Musa er-Râzî rivayet etti. (Dediki): Bize îsâ yâni İbni Yunus rivayet etti. (Dediki): Bize Abdülhamid b. Ca'fer, İmrân b. Ebî Enes'den, o da, Ömer b. Hakem'den, o,da Ebu Hureyre'den naklen rivayette bulundu. Ebu Hureyre şöyle demiş; Resulullah (Sallallahu Aleyhi ve Sellem): «Bîr mü'min bir mü'mine'ye buğzetmesin; (çünkü) onun bir huyunu beğenmezse başka bîr huyunu beğenir.» Yahud «Başkasını beğenir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3649,
			"arabicnumber": "1469",
			"text": "{…} Bize Muhammed b. el-Müsennâ rivayet etti. (Dediki): Bize Ebu Âsim rivayet etti. (Dediki): Bize Abdülhamid b. Ca'fer rivayet etti. (Dediki): Bize İmrân b, Ebî Enes, Ömer b. Hakem'den, o da Ebu Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsin mislini rivayet eyledi",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3650,
			"arabicnumber": "1470.01",
			"text": "Bize Hâruıı b. Ma'ruf rivayet etti. (Dediki): Bize Abdullah b. Vehb rivayet etti. (Dediki): Bana Amr b. Hâris haber verdi. Ona da Ebu Hureyre'nin âzâdlısı Ebu Yunus, Ebu Hureyre'den, o da Resulullah (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etmişki. Nebi (Sallallahu Aleyhi ve Sellem) Efendimiz : «Eğer Havva' olmasa idi, hiç bir kadın ebediyyen kocasına hıyanet etmezdi.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3651,
			"arabicnumber": "1470.02",
			"text": "Bize Muhammed b. Râfi' rivayet etti. (Dediki): Bize Abdürrezzâk rivayet etti. (Dediki): Bize Ma'mer, Hemmam b. Münebbih'den naklen haber verdi. Hemmam: Bize Ebu Hureyre'nin Resulullah (Sallallahu Aleyhi ve Sellem)'den rivayeti budur, diyerek bir takım hadîsler zikretmiştir. Onlardan biri de şudur: Resulullah (Sallallahu Aleyhi ve Sellem): «Eğer Benî İsrail olmasa idi yemek bozulmayacak, et de kokmayacaktı. Havva olmasa hiç bir kadın ebediyyen kocasına hıyanet etmezdi.» buyurdular",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 84
			}
		}
	]
}