{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 534,
			"arabicnumber": "223",
			"text": "(Bize İshâk b. Mansur rivâyet etti. ki): Bize Habban b. Hilâl rivâyet etti. ki): Bize Ebân rivâyet etti. ki): Bize Yahya rivâyet etti, ona da Zeyd rivâyet etmiş, ona da Ebû Sellâm , Ebû Malik-i Eşârî'den naklen rivâyet etmiş; Ebû Malik Şöyle dedi! Resulullâh (sallallahü aleyhi ve sellem): îmanın yarısıdır. Elhamdülillah mizanı doldurur. Sübhanellâh ve elhamdülillah göklerle yer arasını doldururlar. (Yahut doldurur.) Namaz bir nurdur. Sadaka bir burhandır. Sabır bir ziyadır. Kur'ân da senin ya lehine, ya aleyhine bir hüccettir. Bütün insanlar sabahleyin kalkarlar, kimisi nefsini satar, kimisi de onu ya azad eder, yahut helâk!..» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 535,
			"arabicnumber": "224.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 536,
			"arabicnumber": "224.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 537,
			"arabicnumber": "225",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 538,
			"arabicnumber": "226.01",
			"text": "Bana Ebû't-Tahir Ahmed b. Amr b. Abdillâh b. Amr b. Şerh ile Harmeletü'bnü Yahya Et-Tücîbî rivâyet ettiler. (Dediler ki): Bize İbn Vehb Yunus'tan, o da İbn Şihap'tan naklen haber verdi. İbn Şihâb' ada Atâ' b. Yezîd el-Leysi, ona da Osman'ın mevlâsı Humrân haber vermiş ki Osman b. Affan (radıyallahü anh) abdest suyu isteyerek abdest almış ve ellerini üç defa yıkamış sonra mazmaza ve istinsar yapmış. Sonra yüzünü üç defa yıkamış sonra sağ kolunu dirsekleri ile beraber üç defa sonra sol kolunu aynı şekilde üç defa yıkamış sonra başına mesh etmiş sonra sağ ayağını topuklarıyla beraber üç defa sonra sol ayağımda aynı şekilde (üç defa) yıkamış sonra şöyle dedi: Ben Resûlüllah (sallallahü aleyhi ve sellem)'in şu benim abdestim gibi abdest aldığını gördüm. Sonra Resulullâh (sallallahü aleyhi ve sellem): kim benim şu abdestim gibi abdest alır da kalkar ve aklından bir şey geçirmeyerek iki rekât namaz kılarsa, geçmiş günahları affolunur.» buyurdular. Şihâb: «Ulemâmız bu abdest bir kimsenin namaz için aldığı en güzel abdesttir derlerdi» demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 539,
			"arabicnumber": "226.02",
			"text": "(Bana Züheyr b. Harb da rivâyet etti. ki): Bize Yakub b. İbrahim rivâyet etti. ki): Bize babam İbn Şihâp'tan, o da Atâ' b. Sezici el-Leysî'den, o da Osman'ın mevlâsı Humran'dan rivâyet etti ki: Osman'ın bir kab istediğini görmüş (bu kabtan) avuçlarına üç defa su dökerek onları yıkamış sonra sağ avucunu kabın içine daldırarak mazmaza ve istin sar yapmış sonra yüzünü üç defa; ellerini de dirsekleri ile beraber üç defa yıkamış. Sonra başına mesh etmiş. Sonra ayaklarını üçer defa yıkamış sonra şöyle dedi. Resulullâh (sallallahü aleyhi ve sellem) kim benim şu abdestim gibi abdest alır da gönlünden hiç bir şey geçirmeyerek iki rekât namaz kılarsa geçmiş günahları affolunur.» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 540,
			"arabicnumber": "227.01",
			"text": "Bize Kuteybetü'bnü Sa'id ile Osman b. Muhammed b. Ebi Şeybe ve İshâk b. İbrahim El-Hanzalî rivâyet ettiler. Lâfız kuteybe'nindir. İshâk (Ahberena) tabirini, Ötekiler (Haddesena) yi kullandılar. Dediler ki: Bize Cerir, Hişâm b. Urveden, o da Babasından, o da Osman'ın âzadlısı Humran'dan naklen rivâyet etti. Humran Şöyle dedi Osman b. Affan'ı mescid avlusunda iken dinledim. İkindi zamanı müezzin onun yanına geldi. Osman ondan abdest suyu isteyerek abdest aldı. Sonra dedi ki: Vallahi size bir hadis rivâyet edeceğim. Eğer Allah'ın kitabında bir âyet olmasaydı onu size rivâyet etmezdim. Ben Resûlüllah (sallallahü aleyhi ve sellem):«Hiç bir Müslüman yoktur ki; tertemiz abdest alarak namaz kılsın da Allah onun o namazla ondan sonra gelecek namaz arasındaki günahlarını affetmesin.» buyururken İşittim",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 541,
			"arabicnumber": "227.02",
			"text": "(Bize bu hadisi Ebû Kureyb de rivâyet etti. ki): Bize Ebû Usame rivâyet etti. H. bize Züheyr b. Harb ile Ebû Kureyb rivâyet ettiler. Dediler ki: Bize Vekî' rivâyet etti. H. İbn Ebi Ömer dahi rivâyet etti. ki): Bize Süfyan rivâyet etti. Bunların hepsi bu isnadla Hişâm'dan rivâyet etmişler. Ebû Üsame hadisinde: abdest alır; sonra farz namazı kılarsa.» cümlesi de vardır",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 542,
			"arabicnumber": "227.03",
			"text": "(Bize Züheyr b. Harb de rivâyet etti. ki): Bize Yakub b. İbrahim rivâyet etti. ki): Bize babam, Sâlih’den rivâyet etti. İbn Şihâb Şöyle dedi: «Lâkin Urve'nin Humran'dan rivâyetine göre Humran Şöyle dedi: Osman abdest aldığı vakit: Vallahi size bir hadis rivâyet edeceğim. Vallahi Allah'ın kitabında bir âyet olmasaydı onu size rivâyet etmezdim. Gerçekten ben Resulullâh (sallallahü aleyhi ve sellem)'i:— «Hiç bir kimse yoktur ki; güzel güzel abdest alarak sonra namazı kılsın da o namazla ondan sonra gelen namaz arasındaki günahları affolunmasın.» buyururken işittim; dedi Urve:— «Bu âyet: indirdiği açık açık âyetleri ve doğruyu gizleyenler yok mu?...\" diye başlayan ve: de lânet ederler.\" cümlesine kadar devam eden âyettir.» dedi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 543,
			"arabicnumber": "228",
			"text": "(Bize Ahd b. Humeyd ile Haccac b. Eş-Şâir ikisi de Ebû'l Velid’den rivâyet ettiler. Abd dedi ki. Bana Ebû'l Vehd rivâyet etti ki): Bize Ishâk b. Sa'id b. Amr b. Saîd b. El-Âs rivâyet etti ki) Bana babam, babamdan rivâyet etti. Şöyle dedi\"! Osman'ın yanındaydım. Abdest almak İçin su istedi ve şöyle dedi: Ben Resûlüllah (sallallahü aleyhi ve sellem) i «Hiç bir Müslüman yoktur ki; farz bir namazın vakti geldiğinde o namazı tertemiz abdest alarak huşu’u ve rükü'û ile kılsın da büyük günah işlemedikçe o namaz ondan önceki günahlarına keffaret olmasın. Bu her zaman için böyledir.» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 544,
			"arabicnumber": "229",
			"text": "Bize Kuteybetü'bnü Sa'id ile Ahmed b. Abdete'd-Dabbî rivâyet ettiler. Dediler ki: Bize Abdilaziz — ki Derâverdîdir — Zeyd b. Eşlemden, o da Osman'ın azadlısı Humran'dan naklen rivâyet etti. Humran Şöyle dedi: Osman b. Affan'a abdest suyu getirdim de abdest aldı sonra şunları söylem: Hakikaten bazı insanlar Resûlüllah (sallallahü aleyhi ve sellem)’den bazı hadisler rivâyet ediyorlar ki; ben bunların mahiyetini bilmiyorum. Yalnız ben Resûlüllah (sallallahü aleyhi ve sellem)’in şu benim abdestim gibi abdest aldığını gürdüm sonra söyle buyurdular: «Her kim böylece abdest alırsa; geçmiş günahları affolunur. Kıldığı namazla mescide kadar yürümesi de (kendisine) nafile (ibâdet) olur.» Abde'nin rivâyetinde: «Osman'a geldimde abdest aldı» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 545,
			"arabicnumber": "230",
			"text": "Bize Kuteybetü'bnü Sa'id ile Ebû Bekr b. Ebî Şeybe ve ZÜheyr b. Harb rivâyet ettiler. Lâfız Kuteybe ile Ebû Bekr'indir. Dediler ki: Bize Vekî' Süfyân' dan, o da Ebû'n-Nadr' dan, o da Ebû Enes' ten naklen rivâyet etti ki; Osman peykeler üzerinde abdest almış ve: Size Resûlüllah (sallallahü aleyhi ve sellem)'in abdest ini göstereyim mi? Demiş sonra (her azayı) üçer defa (yıkayarak) abdest almış. kendi rivâyetinde şunu ziyade etti: «Süfyan ki: Ebû'n-Nadr Ebû Enes'ten naklen rivâyet etti. Ebû Enes: Osman'ın yanında Resûlüllah (sallallahü aleyhi ve sellem)’in ashabından bazı kimseler vardı» demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 546,
			"arabicnumber": "231.01",
			"text": "Bize Ebû Küreyb Muhammed b. El-Alâ', ile İshâk b. İbrahim hep birlikte Veki'den rivâyet ettiler. Ebû Küreyb dedi ki: Bize Veki', Mis'ar' dan, o da Ebû Sahra Cami' b. Şeddâd'dan naklen rivâyet etti. ki: Ben Humran b. Ebandan dinledim. Şöyle dedi: Ben Osman'a abdest suyu koyardım gün geçmezdik! üzerine biraz su dökünmesin. Osman dedi ki: Resulullâh (sallallahü aleyhi ve sellem) şu namazımızdan çıktıktan sonra (Mis'ar zannederim bu namaz ikindiydi demiş) Bizimle konuşarak şöyle buyurdu: «Size bir şey söylesem mi? Yoksa sükût mu etsem? bilmiyorum?» Biz:— «Ya Resulallâh! Hayırsa söyle başka bir şeyse Allah ve Rasulu bilir.» dedik. Resulullâh (sallallahü aleyhi ve sellem): «Temizlenerek Allah'ın farz kıldığı temizliği tastamam yapan ve şu beş vakit namazı kılan hiç bir Müslüman yoktur ki; bu namazlar aralarındaki günahlara keffaret olmasınlar.» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 547,
			"arabicnumber": "231.02",
			"text": "(Bize Ubeydullah b. Muâz rivâyet etti. ki): Bize babam rivâyet etti. H. Muhammed b. el-Müsennâ İle İbn Beşşâr da rivâyet ettiler. Dediler ki: Bize Muhammed b. Ca'fer rivâyet etti. Muâz'la Muhammed'in ikisi de: Bize Şu'be, Cami’ b. Şeddâd'dan rivâyet etti. Demişler Câmî' şunları söylemiş: Bişr'in imareti zamanında şu mescidde Humran b. Ebanı Ebû Bürde’ye şunları anlatırken işittim: Osman b. Aftan: (sallallahü aleyhi ve sellem): «Her kim Allah'ın emrettiği gibi tastamam abdest alırsa farz namazlar, aralarındaki günahlara keffaret olurlar.» buyurdular; demiş. hadîs Muâz'ındır. Gunder'in hadîsinde «Bişr'in emirliği zamanında ve farz kılınmış» tâbirleri yoktur",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 548,
			"arabicnumber": "232.01",
			"text": "(Bize Harun b. Sa'id el-Eyli rivâyet etti. ki): Bize İbn Vehb rivâyet etti. ki: Bana Mahremetü'bnü Bükeyr, babasından, o da Osman'ın azatlısı Humran'dan naklen haber verdi. ki: Osman b. Affan bir gün güzel bir abdest aldı. Sonra şunları söyledi: Ben Resulullâh (sallallahü aleyhi ve sellem)’in çok güzel bir şekilde abdest aldığını gördüm. Sonra şöyle buyurdular: kim bu şekilde abdest alır da kendisini ancak namaz harekete geçirerek mescide çıkarsa geçmiş günahları affolunur.»",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 549,
			"arabicnumber": "232.02",
			"text": "Bana Ebû't-Tahîr ile Yunus b. Abdil A'lâ da rivâyet ettiler: Dediler ki: Bize Abdullah b. Vehb, Amr b. El-Hûristen naklen haber verdi, ona da Hukeym b. Abdillâh el-Kureşî rivâyet etmiş. Ona da Nafî' b. Cübeyr ile Abdullah b. Ebi Seleme rivâyet etmişler, onlara da Muâz b. Abdirrahman Osman b. Affan'ın azatlısı Humran'dan , o da Osman b. Affan'dan naklen rivâyet etmiş. Osman Şöyle dedi: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: «Her kim namaz için yerli yerince abdest alır; sonra farz namazı kılmak için gider de onu insanlarla, yahut cemaatla, yahut mescitte kılarsa Allah o kimsenin günahlarını affeder.» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 550,
			"arabicnumber": "233.01",
			"text": "Bana Ebû't-Tahir ile Harun b. Sa'id el-Eyli rivâyet ettiler. Dediler ki: Bize İbn Vehb, Ebû Sahır' dan naklen haber verdi. Ona da Zaide'nin azadlısı Ömer b. İshâk babasından, o da Ebû Hüreyre’den naklen haber vermiş ki Resulullâh (sallallahü aleyhi ve sellem) şöyle buyururlarmış: günahlardan kaçınıldığı takdirde beş vakit namaz, iki cuma ve iki Ramazan, aralarındaki günahlara keffârettirler.» beri sıraladığımız bu rivâyetlerin bazılarında abdestin bazılarında abdestten sonra.: iki rekat namazın; bir kısmında beş vakit namazın diğerlerinde iki cum'a ile iki Ramazanın küçük günahlara, keffâret olacakları bildirilmektedir Neyevî diyor ki: «Burada şöyle bir sual hatıra gelebilir. Mademki abdest geçmiş küçük günahlara keffâret oluyor o halde namaz neye keffâret olacaktır? Namaz küçük günahlara keffâret olursa cum'alarla ramazanlar neye keffâret olacaktır? Hatta Arife günü oruç tutulursa; iki senenin\" küçük günahlarına; Aşura günü oruç tutulursa bir senenin günahlarına keffâret olacağı keza bir kulun âmin demesi meleklerin âminine tesadüf ederse geçmiş günahları affolunacağı bildiriliyor. Bunlar neye keffâret olacaktır? diye sorulabilir. Ulemâ bu suale şu cevabı vermişlerdir: Bu zikredilenlerin her biri keffâret olmaya elverişlidir. Eğer keffâret olacak küçük günahlar bulunursa onlara keffâret olurlar. Kulun büyük veya küçük hiç bir günahı yoksa mezkûr abdest ve namazlarla kula hasenat yazılır. Dereceleri yükseltilir. Küçük günahı yokta büyük günahı bulunursa büyük günahların cezasını hafifleteceklerini ümit ederiz Allah-u A'lem",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 551,
			"arabicnumber": "233.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 552,
			"arabicnumber": "233.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 553,
			"arabicnumber": "234.01",
			"text": "Bana Ebû Osman dahi Cübeyr b. Nüfeyr' den, o da Ukbetü'bnü Â'mir'den naklen rivâyet etti. Ükbe şöyle dedi. Üzerimizde deve gütme vazifesi vardı. Nevbetim gelince akşamlayın develeri ağıllarına götürdüm. Resulullâh (sallallahü aleyhi ve sellem)'e ayakta cemaata bir şeyler söylerken yetiştim. Yetiştiğim sözü şudur: bir Müslüman tertemiz abdest alır, sonra kalkarak iki rekât namaz kılar, kalbi ve yüzüyle o iki rekâta yönelirse o kimseye cennet vacip olur.» buyurdular. Ben: Bu ne güzel şey dedim. Birde baktım Önümde biri: Bundan önceki daha güzeldi diyor!... ki Ömer'miş (bana): Ben seni demin gelirken gördüm Resulullâh (sallallahü aleyhi ve sellem) sen gelmezden Önce şöyle buyurdular, dedi. sizden biriniz abdest alır, onu yerli yerince yapar, yahut tastamam icra eder de sonra: \"Ben Allah'tan başka ilâh olmadığına; Muhammed'in Allah'ın kulu ve resulü olduğuna şahadet ederim.\" derse o kimseye cennetin sekiz kapısı (birden) açılır. Onların hangisinden dilerse ondan girer.»",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 554,
			"arabicnumber": "234.02",
			"text": "(Bize bu hadisi Ebû Bekr b. Ebi Şeybe'de rivâyet etti. ki): Bize Zeyd b. Hubab, rivâyet etti. ki): Bize Muâviyetü'bnü Salih, Rabiatü'bnü Yezid'den, o da Ebû İdris el-Havlânî ile Ebû Osman'dan, onlarda Cübeyr b. Nüfeyr b. Malik el-Hadremi'den. o da Ukbetü'bnü Âmir el-Cühenîden naklen rivâyet etti. Ukbe Resulullâh (sallallahü aleyhi ve sellem) şöyle buyurdu diyerek bu hadisin mislini rivâyet etmiş. Şu kadar var ki o: kim abdest alır da bir Allah'tan başka ilâh yoktur, onun şeriki yoktur; ben Muhammed'in onun kulu ve resulü olduğuna şahadet ederim.» buyurdu demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 555,
			"arabicnumber": "235.01",
			"text": "Bana Muhammed b. Sabbah rivâyet etti. (Dedi ki): Bize Halid b. Abdillâh , Amr b. Yahya b. Uinarâ'dan, o da babasından, o da Abdullah b. Zeyd b. Âsim el-Ensarî' den — ki bu zat sahabedir. Naklen rivâyet etti. Abdullah'a: Resulullâh (sallallahü aleyhi ve sellem)'in abdesti gibi abdest al» demişler. Bunun üzerine Abdullah bir kap isteyerek ondan ellerine su dökmüş ve onları üç defa yıkamış sonra elini kaba daldırarak ondan su almış ve bir avucundan hem mazmaza hem istinşak yapmış. Bunu üç defa tekrarlamış. Sonra elinî kaba daldırarak su almış ve yüzünü üç defa yıkamış sonra elini kaba daldırarak su almış ve ellerini dirsekleriyle beraber ikişer ikişer yıkamış. Sonra yine elini kaba daldırarak su çıkarmış ve başına mesh etmiş. (Mesh ederken) iki elini öne ve arkaya götürmüş. Sonra ayaklarını topukları ile beraber yıkamış bundan sonra: (sallallahü aleyhi ve sellem)'in abdesti işte böyle idi.» demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 556,
			"arabicnumber": "235.02",
			"text": "(Bana Kasım b. Zekeriyya'da rivâyet etti. ki): Bize Hâlid b. Mahled, Süleyman'dan —ki İbn Bilâl'dır—, o da Amr b. Yahya'dan bu isnadla bu hadisin mislini rivâyet etti. (Yalnız) o topukları zikretmedi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 557,
			"arabicnumber": "235.03",
			"text": "(Bana İshâk b. Mûsa el-Ensârî de rivâyet etti. ki): Bize Ma'n rivâyet etti. ki): Bize Malik b. Enes, Amr b. Yahya'dan bu isnadla rivâyet etti. Ve: defa mazmaza ve istinşak yaptı.» dedi. «Bir avuçtan» kaydını söylemedi, «Ellerini öne ve arkaya doğru» çekti» sözünden sonra: «Başının ön tarafından başladı sonra ellerini kafasına doğru çekti. Sonra onları başladığı yere döndürdü. Ayaklarınıda yıkadı» ibaresini ziyade eyledi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 558,
			"arabicnumber": "235.04",
			"text": "(Bize Abdurrahman b. Bişr el-Abdiy rivâyet etti. ki): Bize Behz rivâyet etti. ki): Bize Vüheyb rivâyet etti ve: Bize Amr b. Yahya yukarıkilerin isnadları gibi bir isnadla rivâyet etti. diyerek hadisi söyledi. O bu hadiste: avuçtan mazmaza ve istinşak yaparak burnunu attı» dedi şunu dahi söyledi: «Başınada öne ve arkaya giderek bir defa mesh etti.» «Bana bu hadisi Vüheyb yazdırdı» demiş Vüheyb de: Bana bu hadisi Amr b. Yahya iki defa yazdırdı demiştir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 559,
			"arabicnumber": "236",
			"text": "(Bize Hârûn b. Ma'ruf rivâyet etti. H. Hârûn b. Said el-Eylî ile Ebû't-Tâhir de rivâyet ettiler. Dediler ki: Bize İbn Vehb rivâyet etti. ki) Bana Amr b. El-Hâris haber verdi. Ona da Habbân b. Vasî' rivâyet etmiş; ona da babası rivâyet etmiş. Babası Abdullah b. Zeyd b. Asım El Mâzinîyî şunları anlatırken dinlemiş Abdullah ki: Resulullâh (sallallahü aleyhi ve sellem) abdest alırken gördüm. Mazmaza ve istinşak yaptı. Sonra yüzünü üç defa, sağ elini üç defa, öteki elini de üç defa yıkadı. Elinin artığı olmayan bir su ile başına mesh etti. Ayaklarınıda temiz pak edinceye kadar yıkadı. Ebû't-Tahir: «Bize İbn Vehb, Amr b. Haris'den rivâyet etti.» dedi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 560,
			"arabicnumber": "237.01",
			"text": "Bize Kuteybetü'bnü Said ile Amru'n-nâkid ve Muhammed b. Abdillâh b. Nümeyr toptan İbn Uyeyne'den rivâyet ettiler. Ku-teybe dedi ki: Bize Süfyan, Ebû'z-zinâd'dan, o da A'rac'dan, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen rivâyet etti. Şöyle buyurmuşlar: taşla taharetlenirse; tek taşla taharetlensin. Abdest aldığı zaman da burnuna su çeksin, sonra sümkürsün.»",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 561,
			"arabicnumber": "237.02",
			"text": "(Bana Muhammed b. Rafi’ rivâyet etti. ki): Bize Abdurrazzak b. Hemmam rivâyet etti. ki): Bize Ma'mer, Hemmâm b. Münebbih'den naklen haber verdi. Hemmam: «Bize Ebû Hüreyre'nin Muhammed Resulullâh (sallallahü aleyhi ve sellem)’den rivâyet ettiği budur.» diyerek bir takım hadisler zikretmiş ez-cümle Resulullâh (sallallahü aleyhi ve sellem): abdest alırsa her iki burun deliğine su çeksin; sonra sümkürsün.» buyurdular, demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 562,
			"arabicnumber": "237.03",
			"text": "Bize Yahya bin Yahya rivâyet etti. ki: İbn Şihâb'dan dinlediğim, onun da Ebi İdris Elhavlâni'den, onun da Ebû Hüreyre'den naklen rivâyet ettiği şu hadisi Malik'e okudum. Resulullâh (sallallahü aleyhi ve sellem): kim ab dest alırsa burnunu atsın; kim taşla taharetlenirse (taş adedini) tek yapsın.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 563,
			"arabicnumber": "237.04",
			"text": "(Bize Sa'id b. Mansur rivâyet etti, ki): Bize Haspan b. İbrahim rivâyet etti. ki): Bize Yunus b. Yezid rivâyet etti. H: Harmeletü'bnü Yahya dahi rivâyet etti, ki): Bize Ibnû Vehb haber verdi. ki): Bana Yunus, İbn Şihâb'dan naklen haber verdi. İbn Şihâb: Bana Ebü İdris El Havlâni haber verdi ki, Ebû Hüreyre ile Ebû. Sa'id-i Hudrîyi Resulullâh (sallallahü aleyhi ve sellem) Şöyle buyurmuş diyerek bu hadisin mislini rivâyet ederlerken dinlemiş dedi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 564,
			"arabicnumber": "238",
			"text": "(Bana Bişr b. Hakem el-Abdi rivâyet etti. ki) ; Bize Abdülaziz yani ed-Deraverdi, İbn'l Hâddan, o da Muhammed b. İbrahim'den, o da İsâ b. Talha' dan, o da Ebû Hüreyre'den naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem): uykusundan uyandığı vakit hemen üç defa burnunu atsın; çünkü şeytan onun genizlerinde geceler.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 565,
			"arabicnumber": "239",
			"text": "(Bize İshâk b. İbrahim ile Muhammed b. Rafi' rivâyet ettiler. İbn Rafî' dedi ki: Bize Abdurrezzak rivâyet etti. ki): Bize İbn Cüreyc haber verdi. ki): Bana Ebû'z-Zubeyr haber verdi ki Cabir b. Abdillâhi şöyle derken işitmiş: Resulullâh (sallallahü aleyhi ve sellem): taşla taharetlenirse tek adetle taharetlensin.» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 566,
			"arabicnumber": "240.01",
			"text": "Bize Harun b. Sa'id el-Eylî ile Ebû't-Tahir ve Ahmed b. İsa rivâyet ettiler. Dediler ki: Bize Abdullah b. Vehb, Mahremeti'bni Bükeyr den, o da babasından o da şeddad'in azatlısı Salim den naklen haber verdi. Salim Şöyle dedi: Sa'd b. Ebî Vakkas'ın vefat ettiği gün peygamber (sallallahü aleyhi ve sellem)’in zevcesi Âişe’nin yanına girdim. (Benimle birlikte) Abdurrahman b. Ebi Bekr de girdi ve onun yanında abdest aldı. Âişe: Ya Abdurrahman Abdesti tes tekmil al; çünkü ben Resulullâh (sallallahü aleyhi ve sellem)'i ateşten ökçelerin haline!..» buyururken işittim dedi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 567,
			"arabicnumber": "240.02",
			"text": "Bana Harmeletü'bnü Yahya da rivâyet etti (Dediki): Bize İbn Vehb rivâyet etti: (Dediki): Bana Hayve haber verdi ki): Bana Muhammed b. Abdurrahman haber verdi, ona da şeddad b. Hâd'ın azatlısı Ebû Abdillâh rivâyet etmiş ki; kendisi Âişe’nin yanına girmiş ve ondan naklen peygamber (sallallahü aleyhi ve sellem)'in; yukarıdaki gibi bir hadis söylediğini rivâyet etmiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 568,
			"arabicnumber": "240.03",
			"text": "(Bana Muhammed b. Hatim ile Ebû Mamer-er-Rakaaşî de rivâyet ettiler. Dedilerki: Bize Ömer b. Yunus rivâyet etti. ki): Bize İkrimetü'bnü Ammâr rivâyet etti. ki): Bana Yahya b. Ebi Kesir rivâyet etti ki): Bana (yahut bize) Ebû Selemete-bni Abdirrahman rivâyet etti. ki): Bana Mehrî'nin azadlısı Salim rivâyet etti, Dediki; Abdurrahman b. Ebi Bekr ile ben Sa'dü'bnü Ebî Vakkas'ın cenazesine çıktık. Ve Âişe’nin evinin kapısı önünden geçtik. Salim peygamber (sallallahü aleyhi ve sellem)’den naklen Âişe'den bu hadisin mislini dinlediğini söyledi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 569,
			"arabicnumber": "240.04",
			"text": "(Bana Selemetü'bnü Şebîb rivâyet etti. ki): Bize Hasan b. A'yen rivâyet etti. ki): Bize Füleyh rivâyet etti. ki): Bana Nuaym b. Abdillâh Şeddâd b. Hâd'ın azadlısı Salim'den naklen rivâyet etti. Sâlim Âişe (radıyallahü anha)'nın yanındaydım» diyerek peygamber (sallallahü aleyhi ve sellem)’den naklen ondan bu hadisin mislini dinlediğini söylemiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 570,
			"arabicnumber": "241.01",
			"text": "(Bana Züheyr b. Harb da rivâyet etti. ki): Bize Cerir rivâyet etti. H. İshâk da rivâyet etti. ki): Bize Cerir Mansur'dan o da Hilâl b. Yesâf dan, O da Ebû Yahya dan, o da Abdullah b. Amr'dan naklen haber verdi. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) ile birlikte Mekke'den Medine'ye döndük. Nihayet yol üzerinde bir suya varınca: cemaat ikindi zamanı acele ederek çar çabuk abdest aldılar. Biz de onların yanına vardık. Ökçelerine su değmediği görünüyordu. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): ökçelerin ateşten başına gelene!.. Abdesti testekmil alın» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 571,
			"arabicnumber": "241.02",
			"text": "(Bize bu hadisi Ebû Bekr b. Ebi Şeybe'de rivâyet etti. ki): Bize Vekî', Süfyân'dan rivâyet etti. H. İbn'l-Müsenna ile İbn Beşşâr da rivâyet ettiler. Dediler ki: Bize Muhammed b. Ca'fer rivâyet etti. ki: Bize Şu'be rivâyet etti. Süfyân'la şu'be ikisi birden Mansur'dan bu isnadla rivâyet etmişler. Şu'benin hadisinde: «Abdesti testekmil alın» cümlesi yoktur. Onun hadisinde: «Ebû Yahya el-A'rac'dan...» kaydı vardır",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 572,
			"arabicnumber": "241.03",
			"text": "Bize Şeyban b. Ferruh ile Ebû Kâmil -el câhderi hep birden Ebû Avâne'den rivâyet ettiler. Ebû Kâmil dedi ki: Bize Ebû Avâne Ebû Bişr'den, o da Yûsuf b. Mâhek'ten, o da Abdullah b. Amr'dan naklen rivâyet etti. Abdullah Şöyle dedi: Yola çıktığımız bir seferde Peygamber (sallallahü aleyhi ve sellem) bizden geri kaldı. Bize yetiştiği zaman ikindi namazının vakti gelmişti. Biz hemen ayaklarımızın üzerine mesh ederek acele abdest almağa başladık. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): ökçelerin ateşten başına gelene» diye nida buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 573,
			"arabicnumber": "242.01",
			"text": "(Bize Abdurrahman b. Sellâm el-Cumahî rivâyet etti. ki): Bize Rabî' yani İbn Müslim Muhammed'den ki İbn Ziya’dır o da Ebû Hüreyreden naklen rivâyet etti ki Peygamber (sallallahü aleyhi ve sellem) ökçelerini yıkamamış bir adam görerek: ökçelerin ateşten başına gelene» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 574,
			"arabicnumber": "242.02",
			"text": "Bize Kuteybe ile Ebû Bekr b. Ebi Şeybe ve Ebû Küreyb rivâyet ettiler. Dedilerki: Bize Vekî', Şu'be'den o da Muhammed b. Ziyad'dan, o da Ebû Hüreyre'den naklen rivâyet etti ki; Ebû Hüreyre mataradan abdest alan bir cemaat görmüşde: testekmîl alın. Çünkü ben Ebû'l Kâsım (sallallahü aleyhi ve sellem): ökçelerin (urkub) ateşten başına gelene» buyururken işittim demiş. yahut mathara abdest alınan her nevi kabdır. Mithara okunduğu takdirde bu kelime ismi alet; mathara okunursa ismi mekân olur. Kâsım Peygamber (sallallahü aleyhi ve sellem)’in künyesi dir. Urkûb'un cem'ıdır. Urkûb ökçenin, üzerindeki kaim sinirdir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 575,
			"arabicnumber": "242.03",
			"text": "(Bana. Züheyr b. Harb rivâyet etti. ki): Bize Cerir, Süheyl'den, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti. Şöyle dedi. Resûlüllah (sallallahü aleyhi ve sellem):«Vay ökçelerin ateşten başına gelene!..» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 576,
			"arabicnumber": "243",
			"text": "(Bana Selemetü'bnü Şebîb rivâyet etti. ki): Bize Hasen b. Muhammed b. A'yen rivâyet etti. ki): Bize Mâ'kıl, Ebû'z-Zübeyr'den, o da Câbir'den naklen rivâyet etti. Cabir Şöyle dedi: Bana Ömer b. Hattab haber verdi ki; bir adam abdest almışda ayağının üzerinde (yıkanmadık) tırnak kadar bir yer bırakmış Peygamber (sallallahü aleyhi ve sellem) onu görerek: de abdestini güzel al» buyurmuşlar. Bunun üzerine o zat dönerek (tekrar abdest almış) ve namaz kılmış",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 577,
			"arabicnumber": "244",
			"text": "(Bize Süveyd b. Said Malik b. Enes’ten rivâyet etti. H. Ebû't-Tâhir'de rivâyet etti. Bu lâfız onun’dur. ki): Bize Abdullah b. Vehb, Malik b. Enes'ten, o da Süheyl b. Ebi Salih'ten, o da babasın’dan, o da Ebû Hüreyre'den naklen haber verdi ki: Resûlüllah (sallallahü aleyhi ve sellem): yahut mü'min bir kul abdest alır da yüzünü yıkarsa, gözleri ile baktığı her günah suyla yahut suyun son damlası ile yüzünden çıkar. Ellerini yıkadığı vakit ellerinin tuttuğu her günah su ile yahut suyun son damlası ile beraber ellerinden çıkar; ayaklarını yıkadığı vakit ayaklarının yürüyerek işlediği her günah su ile yahut suyun son damlasiyle birlikte çıkar. Nihayet o kul günahlardan temiz pâk olup çıkar” buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 578,
			"arabicnumber": "245",
			"text": "(Bize Muhammed b. Ma'mer b. Rıb'î el-Kaysî rivâyet etti. ki): Bize Ebû Hişâm el-Mahzûmî Abdulvahid'ten —ki; İbn Ziyad'dır— rivâyet etti ki): Bize Osman b. Hakim rivâyet etti, ki): Bize Muhammed b. Münkedir , Humran'dan, o da Osman b. Affan'dan naklen rivâyet etti. Osman Şöyle dedi. Resûlüllah (sallallahü aleyhi ve sellem): kim abdest alır da onu tertemiz yaparsa; vücudundan günahları çıkar. Hattâ tırnaklarının altından bile» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 579,
			"arabicnumber": "246.01",
			"text": "(Bana Ebû Küreyb Muhammed b. Ala' ile Kâsım b. Zekeriyyâ b. Dinar ve Abd b. Humeyd rivâyet ettiler. Dediler ki: Bize Halid b. Mahled, Süleyman b. Bilâl'dan rivâyet etti. ki): Bana Umaratü'-bnü Gaziyyete'l-Ensarî , Nuaym b. Abdillah el-Mücmir'den rivâyet etti. Şöyle dedi: «Ebû \"Hureyre'yi abdest alırken gördüm yüzünü yıkadı. Ve abdesti tertemiz aldı. Sonra sağ elini ta bazuya geçinceye kadar yıkadı. Sonra sol elini bazuya geçinceye kadar yıkadı. Sonra başına mesh etti. Sonra sağ ayağını tâ baldırlarına kadar yıkadı, sonra sol ayağını da baldırına geçinceye kadar yıkadı sonra: Resûlüllah (sallallahü aleyhi ve sellem)'in işte böyle abdest aldığını gördüm» dedi ve şunu söyledi: Resûlüllah (sallallahü aleyhi ve sellem): abdesti yerli yerince aldığınızdan dolayı kıyâmet gününde alınlarınız sakar, bacaklarınız sekir (olarak) haşredileceksiniz. Binaenaleyh sizden kim yapabilirse sakar ve sekirliğini uzatsın!..» buyurdu",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 580,
			"arabicnumber": "246.02",
			"text": "(Bana Harun b. Said el-Eyli'de rivâyet etti. ki): Bana İbn Vehb rivâyet etti. ki): Bana Amr b. Haris, Said b. Ebi Hilâl den o da Nuaym b. Abdillâh'tan naklen haber verdi ki Nuaym Ebû Hureyre'yi Abdest alırken görmüş yüzünü ve iki elini nerdeyse omuzlarına varacak kadar yıkamış Sonra ayaklarını ta baldırlarına kadar yıkamış. Sonra şunları söylemiş: Ben Resûlüllah (sallallahü aleyhi ve sellem): kıyâmet gününde abdest eserinden yüzleri sakar, ayakları sekir olarak gelecekler. Binaenaleyh sizden hanginiz sakarlığını uzatabilirse bunu hemen yapsın» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 581,
			"arabicnumber": "247.01",
			"text": "Bize Süveyd b. Sa'id ile İbn Ebi Ömer hep birden mervan el-Fezari'den rivâyet ettiler. İbn Ebi Ömer dediki bize Mervan Ebû Malik el-Eşca'ı Said b. Târik dan o da Ebû Hazımdan o da Ebû Hureyre den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuşlaı: havzım Eyle ile Aden arasından daha uzundur. O kardan daha beyaz, sütle karışık baldan daha tatlıdır. Kabları yıldızların adedinden çoktur. Ben bir kimsenin kendi havuzundan başkalarının develerini kovduğu gibi insanları ondan kovacağım.» Ashab: Ya Resûlâllâh! O gün sen bizi tanıyabilecekmisin? demişler Peygamber (sallallahü aleyhi ve sellem): «Evet, sizin (o gün) hiç bir ümmette bulunmayan bir simanız olacak. Benim yanıma abdest eserinden yüzleriniz ve ayaklarınız nur içinde geleceksiniz.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 582,
			"arabicnumber": "247.02",
			"text": "Bize Ebû Küreyb ile Vasıl b. Abdil A'lâ da rivâyet ettiler. Lâfız Vâsıl’ındır. Dediler ki bize İbn Fudayl, Ebû Malik-i Eşca'ı'den, o da Ebû Hâzim'den, o da Ebû Hüreyre'den naklen rivâyet etti. Ebû Hüreyre şöyle dedi; Resûlüllah (sallallahü aleyhi ve sellem): «Ümmetim havza, benim yanıma gelecek. Ben de tıpkı bir adamın kendi develerinden başkasının develerini kovduğu gibi insanları havuzumdan kovacağım.» buyurdular. Ashab: «Ya Nebiyyallah! Sen bizi taniyabilecekmisin?» dediler. «Evet, sizin başka hiç kimsede bulunmayan bir simanız olacak, benim yanıma abdest eserinden yüzleriniz ve ayaklarınız nurlu olarak geleceksiniz. Ama sizden bir taife benim yanıma gelmekten mutlaka men edilecek ve gelemeyecekler. Ben: Ya Rabbi! Bunlar benim ashabınıdandır, diyeceğim bana bir melek cevap verecek: «Onların senden sonra ne (bidat) ler çıkardıklarını biliyor musun? diyecek.» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 583,
			"arabicnumber": "248",
			"text": "(Bize Osman b. Ebi Şeybe dahi rivâyet etti. ki) Bize Ali b. Müshir, Sa'd b. Tarık'tan o da Rib'ı b. Hıraş'tan o da Huzeyfe'den naklen rivâyet etti. Huzeyfe şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): benim havzım Eyle ile Aden arasından daha uzundur. Nefsim yed’i kudretinde olan Allah'a yemin ederim ki, ben bir takım insanları kişinin yabani develeri havuzundan kovduğu gibi ondan kovacağım.» buyurdu. Ashab: «Ya Resulallâh! Sen bizi tanıyabilecekmisin ki?» dediler Fahr-i Kainat (sallallahü aleyhi ve sellem): «Evet, siz benim yanıma abdest eserinden yüzleriniz ayaklarınız nur içinde geleceksiniz, bu hal sizden başka kimsede olmayacak.» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 584,
			"arabicnumber": "249.01",
			"text": "(Bize Yahya b. Eyyûb ile Süreyc b. Yunus, Kuteybetü'bnü Said ve Ali b. Hucur toptan İsmail b. Ca'ferden rivâyet ettiler. İbn Eyub dedi ki bize İsmail rivâyet etti. ki): Bana Alâ' babasından o da Ebû Hüreyre'den naklen haber verdi: Resûlüllah (sallallahü aleyhi ve sellem) Kabristana gelerek: size ey mü'minler diyarı! İnşaallah biz de size katılacağız, din kardeşlerimizi görmüş olmayı çok arzu ederdim.» buyurmuş Ashab: senin din kardeşlerin değilmiyiz Ya Resûlüllah» demişler Resûlüllah (sallallahü aleyhi ve sellem): benim ashabınsınız, kardeşlerimizse henüz gelmeyenlerdir.» buyurmuşlar. Bunun üzerine ashab: Henüz (saha-i cihana) gelmeyenleri nasıl tanıyacaksın ya Resûlüllah?» demişler. Resûlüllah (sallallahü aleyhi ve sellem): dersin, bir adamın yağız ve doru at sürüsü içinde sakar ve sekir bir takım atları olsa, o adam atlarını tanımaz mı?» buyurmuş. Ashab: hay tanır Ya Resûlüllah» demişler. onlar da abdestten dolayı böyle sakar ve sekir gelecekler. Ben havuza onlardan önce varacağım. Dikkat edin ki, bir takım adamlar benim havuzumun başından kayıp develerin kovulduğu gibi kovulacaklar. Ben onlara Hey, beri gelin! diye nida edeceğim. Bunun üzerine bana onlar senden sonra hakikaten (dinde) tebdilât yaptılar, denilecek, ben de (öyleyse) uzak olsunlar! Uzak olsunlar! Diyeceğim.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 585,
			"arabicnumber": "249.02",
			"text": "(Bize Kuteybetü'bnü Said rivâyet etti ki): Bize Abdülâziz yanî Derâverdi rivâyet etti H. İshak b. Mûsa el-Ensari de rivâyet etti. ki): Bize Ma'n rivâyet etti. ki) ; Bize Malik rivâyet etti. Bunlar hep birden Alâ' b. Abdirrahman'dan, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etmişler ki Resûlüllah (sallallahü aleyhi ve sellem) kabristana çıkarak: size ey mü'minler diyarı: İnşallah biz de size katılacağız.» buyurmuş. Râvi hadisi İsmail b. Ca'fer hadisi gibi rivâyet etmiştir. Ancak Malik hadisi: havuzumdan bir takım kişiler behemahal kovulacaklardır.» şeklindedir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 586,
			"arabicnumber": "250",
			"text": "(Bize Kuteybetü'hnü Said rivâyet etti. ki): Bize Halef yani İbn Halife, Ebû Mâlik el-Eşcaî'den o da Ebû Hazim'den naklen rivâyet etti. Ebû Hâzini Şöyle dedi. Ebû Hüreyre'nin arkasında idim. Namaz için abdest alıyordu. Elini ta koltuğuna kadar ulaştırarak yıkıyordu. Kendisine: Ya Eba Hüreyre bu abdest ne dedim o da (bana): Ya benî Ferrûhî Siz buradamısınız? Eğer sizin burada olduğunuzu bilsem böyle abdest almazdım. Ben Halilim (sallallahü aleyhi ve sellem)’i ; «Mü'minin nuru abdest suyunun ulaştığı yere kadar varır.» buyururken işittim dedi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 587,
			"arabicnumber": "251.01",
			"text": "(Bize Yahya b. Eyyüb ile Kuteybe ve İbn Hucr toptan İsmail b. Ca'fer'den rivâyet ettiler, İbn Eyüb dedi ki: Bize İsmail rivâyet etti. ki): Bana Ala' babasından, o da Ebû Hüreyre'den naklen haber verdi ki: Resûlüllah (sallallahü aleyhi ve sellem): «Size Allah'ın günahları neyle imlıa ettiğini ve dereceleri neyle yükselttiğini göstereyim mi?» buyurmuş Ashab: «Hay hay ya Resûlüllah!» demişler. «Güçlüklere rağmen abdesti yerli yerince almak, mescidlere doğru adımı çok atmak ve namazdan sonra (diğer) namazı beklemektedir. İşte sizin ribatınız budur.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 588,
			"arabicnumber": "251.02",
			"text": "(Bana İshâk b. Mûsâ el-Ensari rivâyet etti. ki): Bize ma'n rivâyet etti. ki: Bize Malik rivâyet etti. H. Muhammed b. el-Müsenna da rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'b rivâyet etti. Bunlar ikisi birden Ala' b. Abdirrahman'dan bu isnadla rivâyet etmişler. (Yalnız) Şu'be'nin hadisinde ribatın zikri geçmemiştir. Malik'in hadisinde iki defa: sizin ribatınız budur, işte sizin ribatınız budur.» buyurulmuştur",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 589,
			"arabicnumber": "252",
			"text": "Bize Kuteybetü'bnü Said ile Amr en-Nâkıd ve Züheyr b. Harp rivâyet ettiler. Dediler ki; Bize Süfyan, Ebû'z-Zinad'dan, o da A'rac'dan, o da Ebû Hüreyre'den o da, Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti. Şöyle buyurmuşlar: mü'minlere —Züheyr'in rivâyetinde ümmetime— meşakkat vermeseydim her namaz için misvak tutunmalarını onlara mutlaka emrederdim”",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 590,
			"arabicnumber": "253.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 591,
			"arabicnumber": "253.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 592,
			"arabicnumber": "254",
			"text": "(Bize Yahya b. Habib el-Hârisî rivâyet etti. ki): Bize Hammad b. Zeyd Gaylân'dan —ki İbn Cerîr ma'velidir— O da Ebû Bürde'den, o da Ebû Mûsa'dan naklen rivâyet etti. Ebû Mûsa: «Peygamber (sallallahü aleyhi ve sellem)'in yanına girdim, Misvakinin bir ucu dilinin üzerinde idi» demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 593,
			"arabicnumber": "255.01",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Hüşeym Husayn'dan. o da Ebû Vail'den, o da Huzeyfe'den naklen rivâyet etti. Huzeyfe: (sallallahü aleyhi ve sellem) teheccüd namazı kılmaya kalktığı zaman ağzını misvakla ovalardı» demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 594,
			"arabicnumber": "255.02",
			"text": "(Bize İshak b. İbrahim rivâyet etti. ki): Bize Cerir Mansur'dan naklen haber verdi. H. İbn Nümeyr'de rivâyet etti. ki) ; Bize babamla Ebû Muâviye A'meş'ten rivâyet ettiler. Mansurla A'meş'in ikiside Ebû vail'den, o da Huzeyfe'den naklen rivâyet etmişler. Huzeyfe: (sallallahü aleyhi ve sellem) geceleyin kalktığı vakit...» diyerek bu hadisin mislini rivâyet etmiş. (Yalnız) bu raviler: «Teheccüd namazı kılmak için» dememişler",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 595,
			"arabicnumber": "255.03",
			"text": "(Bize Muhammed b. el-Müsenna ile İbn Beşşar rivâyet ettiler. Dediler ki: Bize Abdurrahman rivâyet etti. ki): Bize Süfyân, Mansur'dan, Husayn ile A'meş'de Ebû Vail'den, o da Huzeyfeden naklen rivâyet ettiler ki Resûlüllah (sallallahü aleyhi ve sellem) geceleyin (namaza) kalktığı zaman ağzını misvakla ovalarmış.»",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 596,
			"arabicnumber": "256",
			"text": "(Bize Abd b. Humeyd rivâyet etti. ki): Bize Ebû Nuaym rivâyet etti. ki): Bize İsmail b. Müslim rivâyet etti. ki): Bize Ebû'l Mütevekkil rivâyet etti. O’nada İbn Abbâs anlatmış. İbn Abbâs bir akşam Peygamber (sallallahü aleyhi ve sellem)’in evinde yatmış gecenin sonuna doğru Nebiyullah (sallallahü aleyhi ve sellem) kalkarak dışarı çıkmış ve gökyüzüne bir bakmış. Sonra Al-i îmran süresindeki şu âyeti okumuş: ki göklerle yerin yaradılışında gece ile gündüzün gelip geçişinde akıl sahipleri İçin alınacak ibretler vardır.\" Ta \"Bizi cehennemin azabından koru.\" cümlesine kadar. Sonra eve dönerek misvaklanmiş ve abdest almış. Sonra kalkarak namaz kılmış. Ve yatmış, sonra tekrar kalkarak dışarı çıkmış ve almış ve semaya bakmış da bu âyeti yine okumuş, sonra dönerek misvaklanmış, abdest almış kalkıp namaz kılmıştır",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 597,
			"arabicnumber": "257.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 598,
			"arabicnumber": "257.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 599,
			"arabicnumber": "258",
			"text": "Bize Yahya b. Yahya ile Kuteybetü'bnü Said ikisi birden Ca'ferden rivâyet ettiler. Yahya dedi ki bize Ca'fer b. Süleyman, Ebû İmran el-Cevni den, o da Enes b. Malikten naklen haber verdi. ki: Enes; Şunları söyledi. kısaltmak, tırnak kesmek, koltuk altlarını yolmak ve kasıkları tıraş etmek hususunda bunları kırk geceden fazla bırakmamamız bize müddet olarak tayin edildi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 600,
			"arabicnumber": "259.01",
			"text": "(Bize Muhammed b. el-Müsenna rivâyet etti. ki): Bize Yahya yani İbn Said rivâyet etti. H. İbn Nümeyr de rivâyet etti. ki): Bize babam rivâyet etti. Her iki râvî Ubeydullah'tan, o da Nâfî'den o da İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen rivâyet etmişler. Peygamber (sallallahü aleyhi ve sellem): traş edin, sakalları uzatın.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 601,
			"arabicnumber": "259.02",
			"text": "Bize bu hadisi Kuteybetü'bnü Said ve Malik b. Enes'ten, o da Ebû Bekr b. Nafî'den, o da babasından, o da İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti ki. Peygamber (sallallahü aleyhi ve sellem) bıyıkların tıraş edilmesini sakalında uzatılmasını emir buyurmuş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 602,
			"arabicnumber": "259.03",
			"text": "(Bize Sehl b. Osman rivâyet etti. ki): Bize Yezid b. Zürey', Ömer b. Muhammed’ den rivâyet etti. ki): Bize Nâfî', İbn Ömer'den naklen rivâyet etti. Dedi ki! Resûlüllah «Müşriklere muhalefet edin; bıyıkları kısaltın; sakalları uzatın.» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 603,
			"arabicnumber": "260",
			"text": "(Bana Ebû Bekr b. İshak rivâyet etti. ki): Bize İbn Ebi Meryem haber verdi. ki): Bize Muhammed b. Ca'fer haber verdi. ki): Bana Hurâka'nın azadlısı Alâ' b. Abdirrahman b. Ya'kub babasından, o da Ebû Hüreyre'den naklen haber verdi. Ebû Hüreyre şöyle dedi. Resûlüllah (sallallahü aleyhi ve sellem): «Bıyıkları kesin, sakalları salın, Mecusilere muhalefet edin.» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 604,
			"arabicnumber": "261.01",
			"text": "Bize Kuteybetü'bnü Said ile Ebû Bekr b. Ebi Şeybe ve Züheyr b. Harb rivâyet ettiler. Dediler ki: Bize Vekî', Zekeriyya b. Ebi Zaide den, o da Mus'ab b. Şeybe'den , o da Talk b. Habîb'den , o da Abdullah b. Zübeyr'den, o da Âişe'den naklen rivâyet etti; Şöyle dedi Resûlüllah (sallallahü aleyhi ve sellem): «On şey (vardır ki bunlar) fıtrattandır: Bıyığı kesmek, sakalı uzatmak, misvak tutunmak, buruna su çekmek, tırnak kesmek, parmak mafsallarını yıkamak, koltuk altını yolmak, kasıkları traş etmek ve suyla taharetlenmek.» buyurdular. ki: .«Mus'ab: Onuncuyu unuttum meğerki mazmaza ola dedi.» «Vekî' intikasu’l-ma' yanı istinca' dedi» ibaresini ziyade etmiştir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 605,
			"arabicnumber": "261.02",
			"text": "(Bize bu hadisi Ebû Küreyb de rivâyet etti. ki): Bize İbn Ebi Zaide, babasından, o da Mus'ab b. Şeybe'den bu isnadda bu hadisin mislini haber verdi. Şu kadar varki o babasının; «onuncuyu unuttum» dediğini söylemiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 606,
			"arabicnumber": "262.01",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Ebû Muâviye ile Vekî', A'meşten rivâyet ettiler H. Yahya b. Yahya da rivâyet etti. Lâfız onundur. ki): Bize Ebû Muâviye, A'meşten, o da İbrahim'den, o da Abdurrahman b. Yezid’den, o da Selman'dan naklen haber verdi. Selmana: Peygamberiniz (sallallahü aleyhi ve sellem) size her şey'i hattâ kaza-i haceti bile öğretti (değil mi?) demişler. Selman: «Evet, gerçekten Resûlüllah (sallallahü aleyhi ve sellem) kıbleye karşı kaza-i hacet veya bevl etmekten, sağ elle taharetlenmekten, üçten az taşla taharetlenmekten, hayvan tezeği veya kemikle taharetlenmekten bizi men etti.» demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 607,
			"arabicnumber": "262.02",
			"text": "(Bize Muhammed b. el-Müsenna rivâyet etti. ki): Bize Abdurrahman rivâyet etti. ki): Bize Süfyân, A'meşle Mansurdan, onlarda İbrahim'den, o da Abdurrahman b. Yezid'den, o da Selman dan rivâyet etti. Selman Şöyle dedi: «Bize Müşrikler (den biri): Görüyorum ki; sahibiniz size herşeyi öğretiyor. Hatta kaza-i haceti bile öğretiyor.» dedi. Selman şu cevabı vermiş: «Evet. Hakikaten o bizden birimizin sağ elle taharetlenmesini ve kıbleye karşı kaza-i hacet etmesini men etti. Hayvan tersi ve kemiklerle taharetlenmekten de men etti. Hem: biriniz üçten aşağı taşla taharetlenmesin.» buyurdu",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 608,
			"arabicnumber": "263",
			"text": "(Bize Züheyr b. Harb rivâyet etti. ki): Bize Ravh b. Ubade rivâyet etti. ki): Bize Zekeriyya b. İshâk rivâyet etti ki): bize Ebû'z-Zübeyr rivâyet etti, ki Cabiri: «Resûlüllah (sallallahü aleyhi ve sellem) bizi kemik veya hayvan tezeği ile taharetlenmekten men etti» derken işitmiştir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 609,
			"arabicnumber": "264",
			"text": "Bize Züheyr b. Harb ile İbn Nümeyr de rivâyet ettiler. Dediler ki: Bize Süfyan b. Uyeyne rivâyet etti. H. Yahya b. Yahya da rivâyet etti. Lâfız onundur. Dedi ki Süfyân b. Uyeyne'ye: Sen Zühriyi Ata' b. Yezid el-Leysiden, o da Ebû Eyyûb'dan o da Peygamber (sallallahü aleyhi ve sellem)’den naklen şu hadisi rivâyet ederken işitmişsin. Resûlüllah (sallallahü aleyhi ve sellem): «Helaya geldiğiniz zaman küçük veya büyük abdest bozarken kıbleyi karşınıza veya arkanıza almayın. Lâkin şarka veya garba dönün.» buyurmuşlar. Eyyûb: «Müteakiben Şama geldik (orada) kıbleye karşı yapılmış helalar bulduk. Artık onların içinde kıbleden dönüyor ve Allaha istiğfar ediyorduk demiş. (Öyle mi?) » dedim. Süfvan:— «Evet» cevabını verdi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 610,
			"arabicnumber": "265",
			"text": "(Bize Ahmed b. Hasen b. Hıraş da rivâyet etti. ki): Bize Ömer b. Abdilvahhab rivâyet etti. ki): Bize Yezid yani İbn Zürey' rivâyet etti!. ki): Bize Ravh Süheyl'den, o da Ka'kaa'dan o da, Ebû Salih'den, o da Ebû Hüreyre'den, o da Resûlüllah (sallallahü aleyhi ve sellem)’den naklen rivâyet etti. Şöyle buyurmuşlar: biriniz hacetine oturduğu vakit kıbleyi karşısına veya arkasına almasın.»",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 611,
			"arabicnumber": "266.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 612,
			"arabicnumber": "266.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 613,
			"arabicnumber": "267.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 614,
			"arabicnumber": "267.02",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Veki’ Hişam ed-Destevai'den, o da Yahya b. Ebi Kesirden, o da Abdullah b. Ebi Katâdeden, o da babasından naklen haber verdi. Şöyle dedi. Resûlüllah (sallallahü aleyhi ve sellem): «Biriniz helaya girdiği vakit zekerini sağ etiyle tutmasın.» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 615,
			"arabicnumber": "267.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 616,
			"arabicnumber": "268.01",
			"text": "(Bize Yahya b. Yahya et-Temimî de rivâyet etti. ki): Bize Ebû'l Ahvas, Eş'as'tan, o da babasından, o da Mesruk'dan, o da Âişe'den naklen haber verdi Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) temizleneceği zaman temizliğinde taranacağı zaman taranışında ve ayakkabı giyeceği zaman onları giymede sağdan başlamayı pek severdi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 617,
			"arabicnumber": "268.02",
			"text": "(Bize Ubeydullah b. Mu'az dahi rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Şu'be, Eş'as'dan, o da babasından, o da Mesruk'tan, o da Âişe'den naklen rivâyet etti. Âişe şöyle dedi: Resûlül-lâh (sallallahü aleyhi ve sellem) her işinde: Ayakkabı giymesinde, taranmasında ve temizlenmesinde sağdan başlamayı severdi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 618,
			"arabicnumber": "269",
			"text": "(Bize Yahya b. Eyyûb ile Kuteybe ve İbn Hucur toptan İsmail b. Ca'ferden rivâyet ettiler. İbn Eyyüb dedi ki bize İsmail rivâyet etti. ki): Bana Alâ, babasından ,o da Ebû Hüreyre'den naklen haber verdi ki Resûlüllah (sallallahü aleyhi ve sellem): «Çok lanet ettiren iki şeyden sakının.» buyurmuş Ashab: «Bu çok lanet ettiren iki şey nedir Ya Resûlüllah?» demişler Resûlüllah (sallallahü aleyhi ve sellem): «İnsanların yoluna veya gölgesine kaza-i hacet edendir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 619,
			"arabicnumber": "270",
			"text": "(Bize Yahya b. Yahya rivâyet etti ki): Bize Halid b. Abdillah, Halidden, o da Ata' b. Ebi Meymune den, o da Enes b. Malikten naklen haber verdi ki Şöyle dedi. Resûlüllah (sallallahü aleyhi ve sellem) bir bahçeye girdi. Arkasından bir çocuk bir ibrikle onu takib ediyordu bu çocuk bizim en küçüğümüzdü. İbriği bir sedir ağacının yanına koydu Resûlüllah (sallallahü aleyhi ve sellem)'de kaza-i hacet eyledi. Müteakiben su ile taharetlenerek bizim yanımıza geldi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 620,
			"arabicnumber": "271.01",
			"text": "(Bize Ebû Bekr b. Ebi Şeybede rivâyet etti. ki): Bize Veki' ile Gunder, Şu'beden rivâyet ettiler. H. Muhammed b. El-Müsenna dahi rivâyet etti., Lâfız onundur. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be Atâ' b. Ebi Meymune'den rivâyet etti. O da Enes b. Maliki şöyle derken işitmiş: Resûlüllah (sallallahü aleyhi ve sellem) helaya girer ben ve benim kadar bir çocukta bir su kabı ile ucu demirli bir değnek taşırdık bu su ile istinca ederdi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 621,
			"arabicnumber": "271.02",
			"text": "Bana Züheyr b. Harb ile Ebû Küreyb de rivâyet ettiler. Lâfız Züheyr'indir. (Dediler ki): Bize İsmail yani İbn Uleyye rivâyet etti. ki): Bana Ravh b. Kâsım, Ata' b. Ebi Meymune'den, o da Enes b. Malik'ten Naklen rivâyet etti. Enes şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) defi hacet için sahraya çıkar bende kendisine su getirirdim. O bununla taheretlenirdi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 622,
			"arabicnumber": "272.01",
			"text": "(Bize Yahya b. Yahya et-Temimî ile ishâk b. İbrahim ve Ebû Küreyb toptan Ebû Muâviye de rivâyet ettiler. H. Ebû Bekr b. Ebi Şeybe de rivâyet etti. ki): Bize Ebû Muâviye ile Veki' rivâyet ettiler. Lâfız Yahya'nındır. ki: Bize Ebû Muâviye, A'meş'ten, o da İbrahim den, o da Hemmamdan naklen haber verdi. Şöyle dedi: Cerir bevl etti sonra abdest aldı ve mestlerinin üzerine mesh etti. Kendisine sen böylemi yapıyorsun dediler. Evet, ben Resûlüllah (sallallahü aleyhi ve sellem)’in bevl ettiğini sonra abdest alarak mestleri üzerine mesh ettiğini gördüm dedi. A'meş Şöyle dedi: «İbrahim dedi ki: Bu hadis onların hoşuna gidiyordu. Çünkü Cerir'in İslama girmesi Maide sûresinin nüzulünden sonra idi.»",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 623,
			"arabicnumber": "272.02",
			"text": "Bu hadisi bize İshâk b. İbrahim ile Ali b. Haşrem dahi rivâyet ettiler. Dediler ki: Bize İsa b. Yunus haber verdi. H",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 624,
			"arabicnumber": "273.01",
			"text": "(Bize Yahya b. Yahya et-Temîmi rivâyet etti. ki): Bize Ebû Hayseme, A'meş'ten, o da Şakîk'tan, o da Huzeyfe'den naklen haber verdi. Huzeyfe şöyle dedi. Peygamber (sallallahü aleyhi ve sellem) ile birlikte idim bir kavmin çöplüğüne vararak ayakta bevl etti. Ben bir tarafa çekildim. Bunun üzerine (bana): buyurdular. Bende yaklaştım ve ökçelerinin yanında durdum. (Müteakiben) Abdest aldı ve mestlerinin üzerine mesh etti",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 625,
			"arabicnumber": "273.02",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Cerir, Mansurdan, o da Ebû Vâilden naklen haber verdi. Ebû Vail Şöyle dedi: Ebû Mûsa bevl hususunda pek şiddetli davranırdı. Bir şişeye bevl eder ve şöyle derdi. Beni İsrail'den birinin cildine bevl bulaşırsa onu makaslarla kesermiş. Bunun üzerine Huzeyfe şunları söyledi: Arkadaşınızın bu derece şiddet göstermemesini isterdim. Vallahi Ben Resûlüllah (sallallahü aleyhi ve sellem) ile beraber yürüdüğümü görmüşümdür. Baktım ki; bir duvarın arkasındaki bir çöplüğe gitti, ve sizden birinin yaptığı gibi ayakta bevletti. Ben kendisinden biraz öteye çekildim. Fakat o bana işaret buyurdu. Bende gelerek hacetini defedinceye kadar arkasında durdum",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 626,
			"arabicnumber": "274.01",
			"text": "(Bize Kuteybetü'bnü Sa'id rivâyet etti. ki): Bize Leys rivâyet etti. H. Muhammed b. Rumh b. el-Muhacir de rivâyet etti. ki): Bize Leys, Yahya b. Sa'id'den, o da Sa'd b. İbrahim'den, o da Nafi' b. Cübeyr'den, o da Urvetü'bnü Mugira'dan, o da babası Mugîre b. Şu'be'den, o da Resûlüllah (sallallahü aleyhi ve sellem)’den naklen haber verdi ki Peygamber (sallallahü aleyhi ve sellem) def-i hacet için dışarı çıkmış Mugirada içinde su bulunan bir kapla onu takip etmiş. Kaza-i hacetten sonra ona su dökmüş Resûlüllah (sallallahü aleyhi ve sellem) abdest almış ve mestleri üzerine mesh etmiş. Rumh'un rivâyetinde «Hîyne» kelimesinin yerine «Hattâ». vardır",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 627,
			"arabicnumber": "274.02",
			"text": "(Bize Yahya b. Yahya et-Temîmî de rivâyet etti. ki): Bize Ebû'l Ahvas, Eş'as'dan, o da Esved b. Hilâl'dan, o da Mugiretü'bni Şu'be'den naklen haber verdi. Mugira şöyle dedi: Bir gece ben Resûlüllah (sallallahü aleyhi ve sellem) île beraber bulunuyordum. Ansızın indi, ve kaza-i hacet etti. Sonra geldi. Ben yanında bulunan bir kabdan ona su döktüm abdest aldı ve mestlerinin üzerine mesh etti",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 628,
			"arabicnumber": "274.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 629,
			"arabicnumber": "274.04",
			"text": "Bize Ebû Bekr b. Ebi Şeybe ile Ebû Küreyb de rivâyet ettiler. Ebû Bekr dedi ki: Bize Ebû Muâviye. Ameş'den, o da Müslim den, o da Mesruk'tan, o da Mugîre b. Şu'beden naklen rivâyet etti. Mugira şöyle dedi: Bir seferde Peygamber (sallallahü aleyhi ve sellem) ile beraberdim. (Bana): «Ya Mugire ibriği al dedi.» Bende aldım sonra onunla beraber çıktım. Resûlüllah (sallallahü aleyhi ve sellem) gözümden kayboluncaya kadar gitti. Ve kaza-i hacet etti. Sonra geldi. Üzerinde dar yenli bir şam cübhesi vardı. Ellerini onun yenlerinden çıkarmaya çalıştı. Fakat dar geldiği (için çıkaramadı) ve elini cübbenin aşağısından çıkardı. Ben kendisine su döktüm. Namaz abdesti gibi abdest aldı. Sonra mestlerine mesh etti. Sonra namaz kıldı",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 630,
			"arabicnumber": "274.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 631,
			"arabicnumber": "274.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 632,
			"arabicnumber": "274.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 633,
			"arabicnumber": "274.08",
			"text": "(Bana Muhammed b. Abdillâh b. Bezi de rivâyet etti ki) Bize Yezîd (yani İbn Zürey') rivâyet etti. ki): Bize Humeyd et Tavîl rivâyet etti. ki): Bize Bekr b. Abdillâh el - Müzenî, Urvetü'bnü Mugireti'bni Şu'be'den, o da babasından naklen rivâyet etti. Şöyle dedi. Resûlüllah (sallallahü aleyhi ve sellem) (bir seferde ordudan) geri kaldı ben de onunla beraber kaldım. Kaza-i hacet ederek (bana): «Yanında su var mı?» dedi. Kendilerine bir matara getirdim. Ellerini ve yüzünü yıkadı sonra kollarını sıvamaya çalıştı. Fakat cübbenin yeni dar geldi. Bunun üzerine elini cübbenin altından çıkardı ve cübbeyi omuzlarına attı da kollarını yıkadı. Alnına sarığının üzerine ve mestlerine mesh etti. Sonra hayvanına bindi. Bende bindim; Nihayet cemaatin yanına vardık. Ama onlar namaza durmuşlardı. Namazı onlara Abdurrahman b. Avf kıldırıyordu. Bir rekat ta kıldırmıştı. Peygamber (sallallahü aleyhi ve sellem)’in (geldiğini) hissedince gerilemeye başladı. Resûlüllah (sallallahü aleyhi ve sellem) işaret etti; o da cemaata namazı kıldırdı. Selâm verince Peygamber (sallallahü aleyhi ve sellem) ayağa kalktı. Bende kalktım ve yetişemediğimiz rekatı kıldık",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 634,
			"arabicnumber": "274.09",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 635,
			"arabicnumber": "274.10",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 636,
			"arabicnumber": "274.11",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 639,
			"arabicnumber": "276.01",
			"text": "(Bize İshak b. İbrahim el-Hanzalî de rivâyet etti. ki): Abdürrezak haber verdi. ki): Bize Sevrî Amr b. Kays el-Mülâî'den , o da Hakem b. Uteybe'den, o da Kâsım b. Muhaymire'den, o da şureyh b. Hânı den naklen haber verdi, Şüreyh Şöyle dedi: Mest üzerine mesh meselesini sormak için Âişe'ye geldim. (Bana): İbn Ebî Talib'e gitte ona sor. Çünkü o Resûlüllah (sallallahü aleyhi ve sellem) ile birlikte sefer ediyordu dedi. Bizde ona sorduk. Resûlüllah (sallallahü aleyhi ve sellem) misafir İçin üç gün üç geceyi, Mukim içinde bir gün bir geceyi müddet tayin etti» dedi, «Süfyan Amr'i andıkça onu medih ederdi, demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 640,
			"arabicnumber": "276.02",
			"text": "(Bize ishak da rivâyet etti ki): Bize Zekeriyyâ b. Adiy, Ubeydullah b. Amr'dan, o da Zeyd b. Ebi Üneyse' den, o da Hakemden bu isnadla bu hadisin mislini haber verdi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 641,
			"arabicnumber": "276.03",
			"text": "(Bana Züheyr b. Harb da rivâyet etti. ki): Bize Ebû Muâviye, A'meş'den, o da Hakem'den o da Kâsım b. Muhaymire'den, o da şureyh b. Hâni'den naklen rivâyet etti, Şöyle dedi: mestler üzerine mesih meselesini sordum da: — Ali'ye git!.. Çünkü o bunu benden daha iyi bilir; dedi. Ben de Ali'ye gittim... Şüreyh (radıyallahü anh) Peygamber (sallallahü aleyhi ve sellem)’den bu hadisin mislini rivâyet etmiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 642,
			"arabicnumber": "277",
			"text": "(Bize Muhammed b. Abdillah b. Nümeyr rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Süfyan Alkamatü'bnü Mersed'den rivâyet etti. H. Muhammed b. Hatim de rivâyet etti. Lâfız onundur. ki): Bize Yahya b. Said süfyandan rivâyet etti; Dedi ki Bana Alkametü'bnü Mersed, Süleyman b. Büreyde, den, o da babasından naklen rivâyet etti ki: Peygamber (sallallahü aleyhi ve sellem) fetih günü bütün namazları bir abdestle kılmış ve mestlerinin üzerine mesh eylemiş. Ömer kendilerine: Vallahi sen bugün şimdiye kadar yapmadığın bir şeyi yaptın demiş. Resûlüllah (sallallahü aleyhi ve sellem): «Ben bunu kasten yaptım ya Ömer.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 643,
			"arabicnumber": "278.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 644,
			"arabicnumber": "278.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 645,
			"arabicnumber": "278.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 646,
			"arabicnumber": "278.04",
			"text": "Bize Nasr b. Ali el-Cehdamî ile Hâmid b. Ömer el-Bekrâvi de rivâyet ettiler. Dediler ki: Bize Bişr b. el- Müfaddal Halid'den, o da Abdullah b. Şâkiktan, o da Ebû Hüreyre'den naklen rivâyet, etti ki: Peygamber «Biriniz uykudan uyandı mı elini üç defa yıkamadan kaba daldırmasın. Çünkü elinin nerede gecelediğini bilmez.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 647,
			"arabicnumber": "278.05",
			"text": "(Bana Muhammed b. Hatim de rivâyet etti. ki): Bize Muhammed b. Bekr rivâyet etti. H. Hulvânî ile İbn Râfi' dahi rivâyet ettiler. Dediler ki: Bize Abdürrezzâk rivâyet etti, ikiside dediler ki: Bize İbn Cüreyc haber verdi. ki): Bana Ziyâd haber verdi. Ona da Abdurrahman b. Zeyd'in âzâdlısı Sabit haber vermiş. Bütün bu râvîlerin rivâyetlerine göre Sabit Ebû Hüreyreyi Peygamber (sallallahü aleyhi ve sellem)’den bu hadisi rivâyet ederken dinlemiş. râvilerin hepsi hadisi: «Elini kaba daldırmadan önce yıkamadan...» diyerek rivâyet etmişler. «Uç defa... » tâbirini hiç biri söylememiştir. Yalnız yukarıda arz ettiğimiz Câbir, İbn’l-Müseyyeb, Ebû Seleme, Abdullah b. Şakîk, Ebû Salih ve Ebû Rezîn rivâyetleri müstesna. Çünkü onların hadislerinde «üç defa» tabiri zikredilmiştir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 648,
			"arabicnumber": "279.01",
			"text": "(Bana Ali b. Hucr es-Sa'dî rivâyet etti. ki): Bize Alî b. Müshir rivâyet etti. ki): Bize A'meş Ebû Rezîn ile Ebû Salih'ten, onlarda Ebû Hüreyre'den naklen haber verdi. Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): kabına köpek ağzını sokarsa onu hemen döksün. Sonra onu yedi defa yıkasın.» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 649,
			"arabicnumber": "279.02",
			"text": "Bana Muhammed b. Sabbah'ta rivâyet etti. ki: Bize İsmail b. Zekeriyya A'meş'den bu isnadla bu hadisin mislini rivâyet etti. «onu döksün» demedi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 650,
			"arabicnumber": "279.03",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlike Ebû'z-Zinâd'dan duyduğum, onunda A'ractan, onunda Ebû Hüreyre'den naklen rivâyet ettiği şu hadisi okudum. (sallallahü aleyhi ve sellem): kabından köpek içti mi onu hemen yedi defa yıkasın.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 651,
			"arabicnumber": "279.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 652,
			"arabicnumber": "279.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 653,
			"arabicnumber": "280.01",
			"text": "(Bize Ubeydullah b. Muâz'da rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Şu'be, Ebû't, Teyyah' dan rivâyet etti. O da mutarrif b. Abdillâhı İbn Mugaffel' den naklen rivâyet ederken işitmiş. İbn Mügaffel: (sallallahü aleyhi ve sellem) köpekleri öldürmeyi emretti. Sonra: «Onların köpeklerle ne işi var?» buyurdu. Sonra av köpeği ile çoban köpeğine ruhsat verdi ve bir kabı yalarsa onu hemen yedi defa yıkayın, sekizincide toprakla ovalayın.» buyurdular demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 654,
			"arabicnumber": "280.02",
			"text": "(Bu hadisi bana Yahya b. Habib El - Harisi de rivâyet etti. ki): Bize Hâlid Yani İbn'l - Haris rivâyet etti. H. Muhammed b. Hatim de rivâyet etti. ki): Bize Yahya b. Said rivâyet etti. H. Muhammed b. Velid dahi rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. Bu râvilerin hepsi Şu'be'den bu isnâdla bu hadîsin mislini rivâyet etmişlerdir. Şu kadar var ki Yahya b. Said'in rivâyetinde: köpeği ile av ve ziraaf köpeği hakkında ruhsat verdi.» Ziyâdesi vardır. Rivâyette Yahya'dan başka «ekin» kaydını zikreden yoktur",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 655,
			"arabicnumber": "281",
			"text": "(Bize Yahya b. Yahya ile Muhammed b. Rumh rivâyet ettiler. Dediler ki: Bize Leys haber verdi. H. Kuteybe de rivâyet etti. ki): Bize Leys, Ebû'z-Zübeyr’den o da Cabir'den, o da Resûlullâh (sallallahü aleyhi ve sellem)’den naklen rivâyet etti ki Peygamber (sallallahü aleyhi ve sellem) Durgun suya bevl edilmesini nehiy buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 656,
			"arabicnumber": "282.01",
			"text": "(Bana Züheyr b. Harb da rivâyet etti. ki): Bize Cerir Hişâm'dan, o da İbn Şîrîn'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti: «Sakın biriniz durgun suya bevl etmesin. Sonra ondan yıkanır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 657,
			"arabicnumber": "282.02",
			"text": "(Bize Muhammed b. Râfi'de rivâyet etti. ki): Bize Abdürrezzâk rivâyet etti. ki): Bize Ma'mer, Hemmâm b. Münebbih'ten rivâyet etti. ki: Ebû Hüreyre'nin Resûlüllah Muhammed (sallallahü aleyhi ve sellem)’den rivâyet ettikleri şunlardır. Diyerek bir takım hadisler zikretmiştir. Onlardan biride şudur. Resûlüllah (sallallahü aleyhi ve sellem): «Akmayan durgun suya bevl etme, sonra ondan yıkanırsın.» Buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 658,
			"arabicnumber": "283",
			"text": "(Bize Harun b. Said El-Eylî ile Ebû't-Tahir ve Ahmed b. İsa toptan İbn Vehb den rivâyet ettiler. Harun dedi ki: Bize İbn Vehb rivâyet etti ki): Bana Amr b. Haris, Bükeyr b. Eşecc den naklen haber verdi. Bükeyre de Hişâm b. Zühre'nin âzadlısı Sâib rivâyet etmiş ki; Ebû Hureyreyi şöyle derken işitmiş: Resûlüllah (sallallahü aleyhi ve sellem): «Sizden biriniz cünüp iken durgun suda yıkanamaz.» buyurdular",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 659,
			"arabicnumber": "284.01",
			"text": "(Bize Kuteybetü'bnü Said rivâyet etti, ki): Bize Hammâd ki İbn Zeyddir Sâbit'ten, o da Enes'den naklen rivâyet etti ki bedevinin biri mescide bevl etmiş cemaatın bir kısmı (Döğmek için) ona doğru ayaklanamışlar bunun Üzerine Resûlüllah (sallallahü aleyhi ve sellem)«Bırakın onu, bevlini kestirmeyin!» buyurmuşlar. «A'rabi bevlini bitirince (sallallahü aleyhi ve sellem) bir kova su istedi ve onu bevilin üzerine döktü». Demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 660,
			"arabicnumber": "284.02",
			"text": "(Bize Muhammed b. El-Müsennâ rivâyet etti ki): Bize Yahya b. Saîd El-Kattan, Yahya b. Saîd El Ensâriden rivâyet etti. H. Yahya b. Yahya ile Kuteybetü'bnü Saîd hep birden Derâverdî'den rivâyet ettiler. Yahya b. Yahya dedi ki: Bize Abdülâziz b. Muhammed El - Medenî, Yahya b. Saîd'den naklen haber verdi ki Enes b. Mâlikî şunları söylerken işitmiş: A'rabînin biri mescidin bir tarafına durarak oraya bevl etti de cemâat kendisine seslendiler. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): onu!» dedi. A'rabi işini bitirince Resûlüllah (sallallahü aleyhi ve sellem) bir kova (su) getirilmesini emir buyurdu ve kova bevlinin üzerine döküldü.»",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 661,
			"arabicnumber": "285",
			"text": "(Bize Züheyr b. Harb rivâyet etti. ki): Bize Ömer b. Yûnus El-Hanefî rivâyet etti. ki) bize İkrimetü'bnü Ammâr rivâyet etti. ki): Bize İshâk b. Ebî Talha rivâyet etti. ki): Bana Enes b. Malik - ki İshâkın amcasıdır - rivâyet etti. ki): Bir defa biz mescidde Resûlüllah (sallallahü aleyhi ve sellem) birlikte bulunuyorduk. Ansızın bir bedevi çıka geldi ve mescidin içine bevletmeğe kalkıştı. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem)’in Ashabı: Heey!... dediler. Resûlüllah (sallallahü aleyhi ve sellem): bevlini kesmeyin: Bırakın onu!» buyurdular. da bevlini bitirinciye kadar onu bıraktılar. Sonra Resûlüllah (sallallahü aleyhi ve sellem) onu çağırarak kendisine şunları söyledi. ki, bu mescidler ne şu bu bevlden, ne de pislikten hiç bir şeye yaramazlar. Bunlar ancak Allah azze ve celleyi anmak, namaz kılmak ve Kur'ân okumak için (bina edilmişler) dîr.» Yahut Resûlüllah (sallallahü aleyhi ve sellem)’in dediği gibidir. Müteakiben peygamber (sallallahü aleyhi ve sellem) cemaattan birine emir buyurdu o da bir kova su getirerek bevlin üzerine serpti",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 662,
			"arabicnumber": "286.01",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb rivâyet ettiler. Dediler ki: Bize Abdullah b. Nümeyr rivâyet etti. ki): Bize Hişâm babasından, o da Peygamber (sallallahü aleyhi ve sellem)’in zevcesi Âişe'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem)'e küçük çocuklar getirilir o da onlara bereket duasında bulunur ve hurma çiğneyerek çocuğun damağını onunla oğarmış. (birgün) Bir çocuk getirmişler. Çocuk Resûlüllah (sallallahü aleyhi ve sellem)’in üzerine bevl etmiş. Resûlüllah (sallallahü aleyhi ve sellem) hemen su istiyerek suyu çocuğun bevlinin üzerine dökmüş, onu yıkamamış",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 663,
			"arabicnumber": "286.02",
			"text": "(Bize Züheyr b. Harb da rivâyet etti ki): Bize Cerîr Hişâm'dan o da babasından, o da Âişe'den naklen rivâyet etti. Âişe şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem)’e henüz meme emen bir çocuk getirdiler. Çocuk onun kucağına bevl etti. Resûlüllah (sallallahü aleyhi ve sellem) hemen su istiyerek onu bevlin üzerine döktü.»",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 664,
			"arabicnumber": "286.03",
			"text": "(Bize İshâk b. İbrahim de rivâyet etti, ki): Bize İsa haber verdi. ki): Bize Hişâm bu isnâdla İbn Nümeyr hadisinin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 665,
			"arabicnumber": "287.01",
			"text": "(Bize Muhammed b. Rumh b. el-Muhâcir rivâyet etti. ki): Bize Leys, İbn Şihap'tan, o da Ubeydullah b. Abdillâh'tan, o da Ümmü Kays binti Mihsan'dan naklen haber verdi ki Ümmü Kays Resûlüllah (sallallahü aleyhi ve sellem)'e henüz yemek yemiyen bir oğlan çocuğunu getirerek onun kucağına oturtmuş. Çocuk bevl etmiş, fakat Resûlüllah (sallallahü aleyhi ve sellem) bevlin üzerine su serpmekten fazla bir şey yapmamış",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 666,
			"arabicnumber": "287.02",
			"text": "Bu hadisi bize Yahya b. Yahya ile Ebû Bekr b. Ebi Şeybe, Amru'n-Nâkıd ve Züheyr b. Harb dahi toptan İbn Uyeyne'den o da Zühriden naklen bu isnadla rivâyet ettiler. Râvî: (sallallahü aleyhi ve sellem) su istedi ve onu bevlin üzerine serpti» demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 667,
			"arabicnumber": "287.03",
			"text": "Bu hadisi bana Harmelete’bnü Yahya haber verdi (ded ki) bize İbn-i Vehb haber verdi ki) bize Yunus b. Yezid haber verdi ona da İbn-i Şihab haber verdi ki) bana Abeydullah ibn-i Abdillah b. Utbete'bni Mes'ûd haber verdi. onada Ümmü Kays binti Mihsan haber vermiş. (Bu kadın Resûlüllah (sallallahü aleyhi ve sellem)’e bey'at eden ilk muhacirlerdendir. Kendisi Ben-i Esed b. Huzeyme'den bir zât olan Ukkâşetü'bnü Mihsan'ın kız kardeşidir) Ubeydullah ki: Kays'ın bana haber verdiğine göre; kendisi Resûlüllah (sallallahü aleyhi ve sellem)'e henüz yemek yiyecek çağa gelmeyen bir çocuğunu getirmiş. Bana haber verdi ki bu çocuk Resûlüllah (sallallahü aleyhi ve sellem)’in kucağına bevl etmiş. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) su isteyerek onu elbisesinin üzerine serpmiş; elbiseyi iyice yıkamamış",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 668,
			"arabicnumber": "288.01",
			"text": "(Bize Yahya b. Yahya da rivâyet etti. ki): Bize Hâlid b. Abdillâh, Hâlid den, o da Ebû Ma'şer' den, o da İbrahim'den, o da Alkame ile Esved'den naklen haber verdi ki; bir zat Âişe'ye misafir olmuş ve sabahleyin elbisesini yıkamaya başlamış. Âişe (ona): «Eğer onu (menîyî) gördünse yerini yıkaman sana yeterdi. Görmedinse etrafını yıkardın. Vallahi ben onu Resûlüllah (sallallahü aleyhi ve sellem)’in elbisesinden ovalayarak çıkardığını bilirim. Sonra o elbise ile namaz kılardı» demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 669,
			"arabicnumber": "288.02",
			"text": "(Bize Ömer bin Hafs b. Gıyâs da rivâyet etti. ki): Bize babam, A'meş'ten, o da İbrahim'den, o da Esved ile Hemmâm'dan onlarda Âişe'denı menî hakkında rivâyet ettiler: Âişe: onu Resûlüllah (sallallahü aleyhi ve sellem)’in elbisesinden ovalardım» demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 670,
			"arabicnumber": "288.03",
			"text": "(Bize Kuteybetü'bnü Saîd rivâyet etti. ki): Bize Hammâd yânî İbn Zeyd, Hişam b. Hassân'dan rivâyet etti. H. İshâk b. İbrahim de rivâyet etti. ki): Bize Abdetü'bnû Süleyman haber verdi. ki): Bize İbn Ebî Arûbe rivâyet etti. Bunlar hep beraber Ebû Ma'şer'den, rivâyet etmişler. H. Ebû Bekr b. Ebi Şeybe de rivâyet etti. ki): Bize Hüşeym, Mugire'den rivâyet etti. H. Muhammed b. Hatim de rivâyet etti. ki): Bize Abdurrahman b. Mehdi Mehdi b. Meymun'dan, o da Vasıl el-Ahdep'ten naklen rivâyet etti. H. (yine) İbn Hatim rivâyet etti. ki): Bize İshâk b. Mansur rivâyet etti. ki): Bize İsrail, Mansur ile Mugire'den rivâyet etti. Bunların hepsi İbrahim'den oda Esved'dan o da Âişe'den naklen onun Resûlüllah (sallallahü aleyhi ve sellem)’in elbisesinden meniyi ovuşturması hakkında Halid'in Ebû Ma'şer'den rivâyet ettiği hadis gibi rivâyette bulunmuşlar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 671,
			"arabicnumber": "288.04",
			"text": "(Bana Muhammed b. Hatim de rivâyet etti. ki): Bize İbn Uyeyne Mansur'dan, o da İbrahim'den, o da Hemmâm'dan, o da Âişe'den naklen yukandakilerin hadisi gibi rivâyette bulundu",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 672,
			"arabicnumber": "289.01",
			"text": "(Bize Ebû Bekr b. Ebi Şeybe rivâyet etti. ki): Bize Muhammed b. Bişr. Amr b. Meymun'dan rivâyet etti. ki: Süleyman b. Yesare bir adamın elbisesine bulaşan meniyi sordum. Onu Yıkayacak mı? yoksa elbiseyi mi yıkayacak? (dedim) Süleyman şu cevabı verdi!. Âişe haber verdi. ki): «Resûlüllah (sallallahü aleyhi ve sellem) meniyi yıkar sonra o elbise ile namaza çıkardı. Ben elbisede yikamanın eserini görürdüm",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 673,
			"arabicnumber": "289.02",
			"text": "(Bize Ebû Kâmil el-Cahderî de rivâyet etti. ki): Bize Abdülvâhid yani İbn Ziyâd rivâyet etti. H. Ebû Küreyb de rivâyet etti. ki): Bize İbn Mübarek İbn Ebi Zaide'den naklen haber verdi. Bunlar Amr b. Meymun'dan bu isnadla rivâyet etmiştir. Ebi Zaide'nin hadisi İbn Bişr'in dediği gibi: «Resûlüllah (sallallahü aleyhi ve sellem) meniyi yıkardı» şeklindedir. İbn Mübarek ile Abdül Vahidin rivâyetlerinde ise Âişe (radıyallahu anhâ) onu Resûlüllah (sallallahü aleyhi ve sellem)’in elbisesinden yıkardım» demiştir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 674,
			"arabicnumber": "290",
			"text": "(Bize Ebû Âsim Ahmed b. Cevvâs el-Hanefî dahi rivâyet etti. ki): Bize Ebû'l-Ahvas, Şebib b. Garkâde'den , o da Abdullah b. Şihâb el-Havlâniden naklen rivâyet etti, Abdullah Şöyle dedi: misafirliğe gitmiştim. İki elbiseme birden ihtilâm olmuşum. Bunun üzerine onları suya batırdım. Derken Âişe'nin bir cariyesi beni görerek ona haber verdi o da bana haber göndererek (beni çağırttı ve) şöyle dedi: böyle yapmaya seni ne şevketti?»: «Uyuyan kimsenin uyku halinde gördüğünü gördüm» dedim. «Elbiselerde bir şey gördün mü?» dedi. «Hayır» cevabını verdim. «Eğer bir şey görmüş olsaydın onu yıkarmiydın. Vallahi ben bizzat kendimin onu Resûlüllah (sallallahü aleyhi ve sellem)’in elbisesinden kuru olarak tırnağımla iyice kazıdığımı bilirim» dedi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 675,
			"arabicnumber": "291.01",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Veki rivâyet etti. ki): Bize Hişam b. Ürve rivâyet etti. H. Muhammed b. Hatim de rivâyet etti. Lâfız onundur. ki): Bize Yahya b. Said. Hişam b. Urve'den rivâyet etti ki: Bana Fatima, , Esma dan rivâyet etti: Esma şöyle dedi: Peygamber (sallallahü aleyhi ve sellem)’e bir kadın gelerek. Bizden birimizin elbisesine Hayz kanı bulaşıyor. Onu ne yapacak?.. Dedi. Resûlüllah (sallallahü aleyhi ve sellem): ovalar; sonra su ile (ovalayıp) yıkar. Sonra üzerine su dökerek yıkar ve onunla namaz kılar.» buyurdu",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 676,
			"arabicnumber": "291.02",
			"text": "(Bize Ebû Küreyb de rivâyet etti ki): Bize İbn Nümeyr rivâyet etti. H. Ebû't - Tâhir'de rivâyet etti. ki): Bana İbn Vehb haber verdi. ki): Bana Yahya b. Abdillah b. Salim ile Mâlik b. Enes ve Amr b. Haris hep birden Hişam b. Urve'den bu isnâdla Yahya b. Said hadisinin mislini haber verdiler",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 677,
			"arabicnumber": "292.01",
			"text": "Bize Ebû Sa'îdel-Eşecc ile Ebû Küreyb Muhammed b. Alâ ve İshâk b. İbrahim rivâyet ettiler. İshâk bize haber verdi tâbrini kullandı. Ötekiler bize Vekî' A'meşten rivâyet etti, dediler. A'meş: Mücâhidi Tâ-vus'tan, o da İbn Abbâs'tan naklen rivâyet ederken işittim demiş İbn Abbâs şunları söylemiş; Resûlüllah (sallallahü aleyhi ve sellem) iki kabrin yanına uğradı ve «Dikkat edin, bunlar muhakkak azab görüyorlar. Hemde büyük bir şeyden dolayı azap görmüyorlar. Bunlardan biri koğuculuk yapardı; diğeri de bevlinden korunmazdı.» buyurdular. yaş bir hurma dalı isteyerek onu ikiye yardı ve birini birinin diğerini de diğerinin üzerine dikti ve: «Umulur ki, bu dallar kurumadıkça/yaş kaldıkça onların azapları hafifletilir.» buyurdu",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 678,
			"arabicnumber": "292.02",
			"text": "(Bana bunu Ahmed b. Yûsuf el-Ezdî rivâyet etti. ki): Bize Muallâ b. Esed rivâyet etti. ki): Bize Abdülvâhid, Süleyman el-A'meş'den bu isnadla rivâyet etti. Yalnız o: bevlden dolayı yahut bevlden temizlenmezdi.» demiş",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 144
			}
		}
	]
}