{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3962,
			"arabicnumber": "1551.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3963,
			"arabicnumber": "1551.02",
			"text": "(Bana Alî b. Hucr es-Sa'dî rivâyet etti. ki): Bize Ali yani İbn Müshir rivâyet etti. ki): Bize Ubeydullah, Nâfi'den, o da İbn Ömer'den naklen haber verdi. İbn Ömer Şöyle dedi: (sallallahü aleyhi ve sellem) Hayber'i, çıkan meyve veya ekinin yarısı mukabilinde verdi. Zevcelerine her sene kuru hurmadan seksen, arpadan yirmi vesk olmak üzere yüz vesk veriyordu. Ömer hilâfete geçince Peygamber (sallallahü aleyhi ve sellem)’in zevcelerini ya kendilerine arazî ve su bölmek yahut her yıl onlara veskları ödemek şartiyle muhayyer bıraktı. Onlar muhtelif hareket ettiler. Bâzısı arazî ile suyu, bâzısı da her yıl vesklerin verilmesini ihtiyar ettiler. Âişe ile Hafsa, arâ-tî ve suyu ihtiyar edenlerdendi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3964,
			"arabicnumber": "1551.03",
			"text": "(Bize İbn Nümeyr rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Ubeydullah rivâyet etti. ki): Bana Nâfi', Abdullah b. Ömer'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem) Hayber halkına oradan çıkan ekin veya meyvenin yarısı mukabilinde muamele yapmış. hadîsi Alî b. Müshir rivâyeti gibi nakletmiş; yalnız: «Âişe ile Hafsa, arazî ve suyu ihtiyar edenlerdendi.» cümlesini zikretmemiş: «Peygamber (sallallahü aleyhi ve sellem)’in zevcelerini, kendilerine yer bölmek şartiyle muhayyer bıraktı.» demiş; suyu da zikretmemiştir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3965,
			"arabicnumber": "1551.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3966,
			"arabicnumber": "1551.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3967,
			"arabicnumber": "1551.06",
			"text": "(Bana Ebû't-Tâhir rivâyet etti. ki): Bize Abdullah b. Vehb rivâyet etti. ki): Bana Üsâme b. Zeyd el-Leysî, Nafî'den, o da Abdullah b. Ömer'den naklen haber verdi. Şöyle dedi: fethedilince yahudîler Resûlüllah (sallallahü aleyhi ve sellem) den, Hayber'de çıkan meyve ve ekinin yansını vermek şartiyle çalışmak üzere kendilerini orada bırakmasını istediler. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): şartla dilediğimiz müddetçe sizi burada bırakıyorum...» buyurdu. Sonra râvi hadîsi İbn Nümeyr'le İbn Müshir'in Ubeydallah'dan rivâyet ettikleri gibi rivâyette bulunmuştur. Bu rivâyette: «Hayber'in yan gelirinden meyve iki paya bölünür; Resûlüllah (sallallahü aleyhi ve sellem) beşte birini alırdı» ifâdesini ziyade etmiştir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3968,
			"arabicnumber": "1552.01",
			"text": "(Bize İbn Nümeyr rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Abdülmelik, Atâ'dan, o -da Câbir'den naklen rivâyet etti. Câbir Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): müslüman bir ağaç dikerse, o ağaçtan yenilen (yemiş) mutlaka onun için sadakadır. O ağaçtan çalınan (yemiş) onun için sadaka, yabanî hayvanların yediği sadaka, kuşların yediği dahi onun için sadakadır. (Hasılı) bir kimse o ağacı (n yemişini yeyip) azaltırsa, bu onun için mutlaka sadaka olur.» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3969,
			"arabicnumber": "1552.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3970,
			"arabicnumber": "1552.03",
			"text": "Bana Muhammed b. Hatim ile İbn Ebî Halef rivâyet ettiler. (Dediler ki): Bize Ravh rivâyet etti. ki): Bize İbn Cüreyc rivâyet etti. ki): Bana Ebû'z-Zübeyr haber verdi ki, Câbir b. Ab-dillah'ı şunu söylerken işitmiş: Ben Resûlüllah (sallallahü aleyhi ve sellem): müslüman bir adam bir fidan diker veya ekin eker de, ondan bir yabanî hayvan, kuş yahut başka bir şey yerse, bunda onun için mutlaka sevab vardır.» buyururken işittim. Ebî Halef (Kuş yahut başka bir şey yerine): «Kuş bir şey» dedi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3971,
			"arabicnumber": "1552.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3972,
			"arabicnumber": "1552.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3973,
			"arabicnumber": "1553.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3974,
			"arabicnumber": "1553.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3975,
			"arabicnumber": "1554.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3976,
			"arabicnumber": "1554.02",
			"text": "(Bize Hasan El-Hulvânî rivâyet etti. ki): Bize Ebû Âsim, İbn Cüreyc'den bu is» adla bu hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3977,
			"arabicnumber": "1555.01",
			"text": "Bize Yahya b. Eyyûb ile Kuteybe ve Alî b. Hucr rivâyet ettiler. (Dediler ki): Bize İsmail b. Ca'fer, Humeyd'den, o da Enes’den naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem) kemâle gelmedikçe hurmanın yemişini satmaktan nehî buyurmuş. Humeyd ki: Bunun üzerine biz Enes'e: Yemişin kemâli nedir? diye sordu. Enes: Kızarması ve sararmasidir. Ne dersin; Allah yemişi vermeyive-rirse, din kardeşinin malını kendine ne ile helâl kılarsın? dedi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3978,
			"arabicnumber": "1555.02",
			"text": "(Bana Ebû't-Tâhir rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Mâlik, Humeyd-i Tavil'den, o da Enes b. Mâlik'den naklen haber verdi ki, Resûlüllah (sallallahü aleyhi ve sellem) meyveyi kemâl buluncaya kadar satmaktan nehî buyurmuş. (Oradakiler Enes'e): Kemâl bulmak nedir? diye sordular. Enes: Kızarmasıdır; dedi ve şunu ilâve etti: Allah meyveyi vermezse dîn kardeşinin malını kendine ne ile helâl kılacaksın?",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3979,
			"arabicnumber": "1555.03",
			"text": "(Bana Muhammed b. Abbâd rivâyet etti. ki): Bize Abdülazîz b. Muhammed, Humeyd'den, o da Enes'den naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem): o hurmalığa yemiş vermezse bir hanginiz dîn kardeşinin malını kendine ne ile helâl kılar?» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3980,
			"arabicnumber": "1554.03",
			"text": "Bize Bişr b. Hakem ile İbrâhîm b. Dînâr ve Abdülceb-bâr b. Alâ' rivâyet ettiler, lâfız Bişr'indir. (Dediler ki): Bize Süfyân b. Uyeyne, Humeyd-i A'rac'dan, o da Süleyman b. Atîk'dan, o da Câbir'den naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem) âfât (telefatın)'ı hesaptan düşmeyi emir buyurmuş. İshâk —ki Müslim'in arkadaşıdır—: Bize Abdurrahman b. Bişr, Siifyân'dan bu isnadla rivâyette bulundu; dedi. hadîsin Hazret-i Enes rivâyetini Buhârî «Büyü'» bahsinde tahrîc etmiştir. Hazret-i Enes'in kitabımızdaki üçüncü rivâyeti Peygamber (sallallahü aleyhi ve sellem)'e muttasıl ve merfu' gösterilmişse de Dârekutnî bunu «Râvilerden birinin vehmi» diye vasıflandırmış; hadîsin Resûlüllah (sallallahü aleyhi ve sellem)’in değil, Hazret-i Enes'in sözü olduğunu beyân etmiştir. Câihanın cem'idir. Câiha: Yemiş ve diğer malları helâk eden âfettir. Büyük musibet ve fitne mânâlarına da gelir. meyve henüz müşteri toplamadan dolu gibi semavî bir âfet sebebiyle telef olursa.'zararı satıcı mı çeker; yoksa müşteri mi? meselesinde ulemâ ihtilâf etmişlerdir. İbn Kudâme «El-Muğnî» nâm eserinde şunları söylüyor: mesele üzerinde birkaç vecihle söz edilmiştir:",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3981,
			"arabicnumber": "1556.01",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Leys, Bükeyrden, o da Iyâz b. Abdillâh'dan, o da Ebû Saîd-i Hudrî'den naklen rivâyet etti. Ebû Saîd Şöyle dedi: (sallallahü aleyhi ve sellem) zamanında bir adamın satın aldığı yemiş sebebiyle başına belâ geldi; borcu çoğaldı. Derken Resûlüllah sadaka verin!» buyurdu; ve halk ona sadaka verdi. Ama bu onun borcuna yetmedi. Bunun üzerine Rcsûlüîlah (sallallahü aleyhi ve sellem) o zâtın alacaklılarına: alın; size bundan başka bir şey yoktur!» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3982,
			"arabicnumber": "1556.02",
			"text": "(Bana Yûnus b. Abdilâlâ' rivâyet etti. ki): Bize Abdullah b. Vehb haber verdi. ki): Bana Amr b. Haris, Bükeyr b. Eşecc’den bu isnâdla bu hadisin mislini haber verdi. müşteriye teslim ettikten sonra semavî bir âfetle telef olan meyvenin parasını müşteri geri alamaz diyenlerin delili bu hadîstir. Zira bu hadîste Resûlüllah (sallallahü aleyhi ve sellem) zarar gören müşteriye sadaka yerilmesini emir buyurmuştur. Eğer parasını geri almaya hakkı olsaydı buna hacet kalmazdı. Onlar geçen hadîsteki âfet zararına tekabül eden meblâğın geri verilmesi emrini istihbâb mânâsına hamletmişlerdir. bu emir meyve kemâle gelmeden satıldığı zamana mahsustur; derler. Âfet sebebiyle zayi' olan meyvenin zararını satıcıya yükleyenler bu hadîsteki borçlanma meselesine kargı şu cevabı vermişlerdir: İhtimal meyve kemâle geldikten sonra müşterinin ihmâl ederek toplamaması yüzünden telef olmuştur. Bu takdirde zararı müşteri çeker. Bundan dolayıdır ki, Peygamber (sallallahü aleyhi ve sellem) hadisin sonunda: bundan başka bir şey yoktur.» buyurmuştur. Âfet zararlarının bedeli iade edilmeyecek olsa. alacaklılar kalan paralarını da isterlerdi. Muhalifleri de bunlara cevap vermiş ve: «Hadîs-i şerif: «Size şimdilik bundan başka bir şey yoktur. Bu zât fakir kaldığı müddetçe ondan alacak istemeniz size helâl olmaz; vakti hali düzelinceye kadar beklemelisiniz; mânâsını ifade eder.» demişlerdir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3983,
			"arabicnumber": "1557",
			"text": "Bana arkadaşlarımızdan birçok kimseler rivâyet ettiler. (Dediler ki): Bize İsmâîl b. Ebî Üveys rivâyet etti. ki): Bana kardeşim, Süleyman yani İbn Bilâl'den, o da Yahya b. Saîd'den, o da Ebû'r-Ricâl Muhammed b. Abdirrahmâıvdan naklen rivâyet etti ki, annesi Amra binti Abdirrahmân şunları söylemiş: Ben Âişe'yi şöyle derken işittim: (sallallahü aleyhi ve sellem) kapıda yüksek sesle konuşan davacı sesleri işitti. Bir de baktı ki, biri diğerinden borcunu indirmesini istiyor; ondan bir şey hakkında hoş muamele rica ediyordu. O da: Vallahi yapamam, diyordu. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) yanlarına çıkarak: o iyilik yapmayacağına Allah'a yemin veren?» diye sordu. O zât: Benim yâ Resûlallah! (Borç indirimi ile hoş muameleden) hangisini dilerse onun olsun! dedi. hadîs İmâm Müslim'in «Sahîh»inde maktu' olarak rivâyet ettiği on iki hadisten biridir. Kâdî Iyâz bu hususta şunları söylemiştir: «Râvi (Bana birçok kimseler rivâyet etti) yahut (bana sika bir zat rivâyet etti) veya (bana arkadaşlarımızdan bâzısı rivâyet etti) derse o hadis, bu fennin ulemasınca ne maktû'dur; ne de mürsel veya mu'dal; belki meçhul bir kimseden rivâyet kabîlindendir.» Kâdî'nin sözünü tasdik ettikten sonra: «Lâkin ne olursa olsun bu hadîs başka bir tarîkten sabit olmasa bu metinde bu rivâyetle ihticâc olunamazdı. Ama başka tarikten sabit olmuştur. Buhârî onu «Sahîh»mde İsmâîl b. Ebî Üveys'den rivâyet etmiştir. İhtimâl Müslim (birçok kimseler) sözü ile Buhârî ve başkalarım kasdetmiştir. Müslim bu İsmâîl'den «Hacc» bahsinde ve «Cihâd»m sonunda vasıtasız olarak rivâyette bulunmuştur. ..» diyor. Hadîsi Nesâî dahi rivâyet etmiştir. gibi rivâyetlere Bazıları «munkati'» Bazıları «muallâk» demiş; Ebû Dâvûd ise onları «mürsel» saymıştır",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3984,
			"arabicnumber": "1558.01",
			"text": "(Bize Harmele b. Yahya rivâyet etti. ki): Bize Abdullah b. Vehb haber verdi. ki): Bana Yûnus, İbn Şihâb'dan naklen haber verdi. ki): Bana Abdullah b. Kâ'b b. Mâlik rivâyet etti. Abdullah ona babasından naklen haber vermiş ki, babası, İbn Ebî Hadred'de olan bir alacağını Resûlüllah (sallallahü aleyhi ve sellem) zamanında mescidde ondan istemiş. Bu münasebetle gürültü kaldırmışlar: hattâ Resûlüllah (sallallahü aleyhi ve sellem) evinde olduğu halde seslerini duymuş da yanlarına çıkmış; odasının kapı perdesini faile açmış. Ve Kâ'b b. Mâlik'e seslenerek: Kâ'b!» demiş. Kâ'b: Lebbeyk yâ Resûlallah! mukabelesinde bulunmuş. Resûlüllah (sallallahü aleyhi ve sellem) ona eliyle: Alacağının yansını bırak, diye işaret etmiş. Kâ'b: Bıraktım yâ Resûlallah! demiş. Resûlüllah (sallallahü aleyhi ve sellem) Ebî Hadred'e: borcunu öde!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3985,
			"arabicnumber": "1558.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3986,
			"arabicnumber": "1558.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3987,
			"arabicnumber": "1559.01",
			"text": "(Bize Ahmed b. Abdillâh b. Yûnus rivâyet etti. ki): Bize Züheyr b. Harb rivâyet etti. ki): Bize Yahya b. Saîd rivâyet etti. ki): Bana Ebû Bekr b. Muhammed b. Amr b. Hazm haber verdi. Ona da Ömer b. Abdilâziz, ona da Ebû Bekr b. Abdirrahman b. Haris b. Hişâm haber vermiş, ki Ebû Bekr, Ebû Hüreyre'yi şunu söylerken işitmiş: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu (yahut şöyle buyururken işittim): kimse İflâs eden bir adamın (veya iflâs eden bir insanın) elinde İken malına olduğu gibi yetişirse, ol mal İçin o kimse başkasından daha haklıdır.»",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3988,
			"arabicnumber": "1559.02",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Hüseyin haber verdi. H. Kuteybe b. Saîd ile Muhammed b. Rumh da hep birden Leys b. Sa'd'dan rivâyet ettiler. H. Ebû'r-Rabî' ile Yahya b. Habîb el-Hârisî dahi rivâyet ettiler. (Dediler ki): Bize Hammâd yani İbn Zeyd rivâyet etti. H. Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Süfyân b. Uyeyne rivâyet etti. H. Muhammed b. Müsennâ da rivâyet etti. ki): Bize Abdül-vehhâb, Yahya b. Saîd ve Hafs b. Giyâs rivâyet ettiler. râvilerin hepsi Yahya b. Saîd'den bu isnâdla Züheyr hadîsi mânâsında rivâyette bulunmuşlardır. İçlerinden İbn Rumh kendi rivâyetinde: bir kimsenin iflâsı teşhir edilirse...» dedi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3989,
			"arabicnumber": "1559.03",
			"text": "(Bize İbn Ebî Ömer rivâyet etti. ki): Bize Hişâm b. Süleyman —ki İbn İkrime b. Hâlid el-Mahzûmî'dir— İbn Cüreyc’den rivâyet etti. ki): Bana İbn Ebî Hüseyn rivâyet etti. Ona da Ebû Bekr b. Muhammed b. Amr b. Hazm haber vermiş; ona da Ömer b. Abdilâzîz, Ebü Bekr b. Abdirrahmân’ın hadîsinden, o da Ebû Hüreyre'nin hadîsinden, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen, malından olan bir kimsenin elinde meta' bulunduğu zaman (ne yapılacağı) hakkında rivâyette bulunmuş; ama elde bulunan malın o malı satan sahibine mahsus olduğunu ayırmamıştir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3990,
			"arabicnumber": "1559.04",
			"text": "(Bize Muhammed b. Müsennâ rivâyet etti. ki): Bize Muhammed b. Ca'fer ile Abdurrahmân b. Mehdî rivâyet ettiler. (Dediler ki): Bize Şu'be, Katâde'den, o da Nadr b. Enes'den, o da Beşîr b. Nehîk'den, o da Ebû Hüreyre'den, oo da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyette bulundu: kimse iflâs eder de biri malını aynen (onun yanında) bulursa o mal (ı almay) a (başkasından) daha haklıdır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3991,
			"arabicnumber": "1559.05",
			"text": "(Bana Züheyr b. Harb da rivâyet etti. ki): Bize İsmâîl b. îbrâhîm rivâyet etti. ki): Bize Saîd rivâyet etti. H. Züheyr b. Harb dahi rivâyet etti. ki): Bize Muâz b. Hişâm rivâyet etti. ki): Bana babam rivâyet etti. iki râvi Katâde'den bu isnâdla bu hadîsin mislini rivâyet etmiş ve: kimse o malda alacaklılardan daha ziyâde hak sahibidir.» demişlerdir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3992,
			"arabicnumber": "1559.06",
			"text": "Bana Muhammed b. Ahmed b. Ebî Halef ile Haccâc b. Şâir de rivâyet ettiler. (Dediler ki): Bize Ebû Selemete’l-Huzâî rivâyet etti. (Haccâc: Mansûr b. Seleme, dedi.) ki): Bize Süleyman b. Bilâl, Huseym b. Irâk'dan, o da babasından, o da Ebû Hüreyre'den naklen haber verdi ki, Resûlüllah (sallallahü aleyhi ve sellem): kimse iflâs eder de, biri malını onun elinde aynen bulursa, o mal (ı almay) o (başkasından) daha haklıdır.» buyurmuşlar. hadîsi Buhârî «Kitâbül-istikrâz»da; Ebû Dâvûd, Tirmizî ve Nesâî «Buyû'»da; İbn Mâce «Ahkâm»da muhtelif râvilerden tahrîc etmişlerdir. şerif Şâfiiler'e göre satış; Hanefîler'ce ise gasb, emanet ve emsali hakkında; vârid olmuştur. Bu bâbta: İbn Huzeyme, İbn Hibbân ve İmâm Mâlik dahi hadisler rivâyet etmişlerdir. Bir mal satın alıp da iflâs eden yahut Ödemeden ölen ve aldığı mal olduğu gibi durduğu halde başka malı olmayan bir kimse hakkında ulema ihtilâf etmişlerdir. b. Ebî Rabâh, Urvetü'bnü Zübeyr, Tâvûs, Şa'bî, Evzâî, Ubeydullah b. Hasen, İmâm Mâlik, Şafiî, Ahmed b. Hanbel, İshâk ve Dâvûd-u Zahirî bu hadisin zahiri ile istidlal ederek: «Bir adam iflâs eder de elinde satın aldığı bir maî bulunursa, o malı satan şahıs malını almaya diğer alacaklılardan daha haklıdır.» demişlerdir. Ebû Ömer İbn Abdilberr, Hicaz fuka-hâsı île muhadişlerin, bâzı feri' meselelerinde ihtilâf etmekle beraber bu hadisin umumu ile istidlal hususunda ittifak hâlinde olduklarını kaydettikten sonra şunları söylemiştir: «Sattığı malı olduğu gibi müflisin elinde bulan bir kimse malını geri almak ister de diğer alacaklılar buna razı olmaz, ona malının parasını ceplerinden vererek o malı kendileri almak ister; alırken fazlasına da el koyarlarsa caiz olur mu olmaz mı meselesinde Mâlik Me Şafiî ihtilâf etmişlerdir. İmâm Mâlik: Alacaklıların buna hakkı vardır; onlar malın parasını verirlerse mal sahibi malını geri alamaz, demiş; Şafiî ise bu hususta alacaklılara söz hakkı olmadığını söylemiş ve ; Bu malı müflis ile mirasçılarının almaya haklan yoksa alacaklıların hiç de olmaz; burada ancak malı satana muhayyerlik vardır, isterse malını ahr; dilerse almaz da diğer alacaklılarla birlikte o mala ortak olur; çünkü Peygamber (sallallahü aleyhi ve sellem) o malda sahibine, alacaklılardan daha fazla hak tanımıştır; demiştir. Ebû Sevr ile İmâm Ahmed'in ve bir cemaatin kavilleri de budur. Şafiî, mal sahibi parasının bir kısmını alırsa ne hüküm verileceğinde de ihtilâf etmişlerdir. İbn Vehb ile başkalarının Mâlik'den rivâyetlerine göre mal sahibi dilerse'aldığı meblağı iade ederek malını alabilir. Şafiî Şöyle deditir: Satılan mal bir köle olur da yarı parasını aldıktan sonra iflâs vuku' bulursa, kölenin yansı sahibinin olur; zîra para kölenin aynına mukabildir. Kalan yansım da alacaklılar nâmına satar. Aldığı paradan bir şey iade edemez; çünkü alacağını almıştır. İmâm Ahmed'in kavli de budur. tevkif edilmeden ve mahkemece iflâsına hüküm verilmeden ölmesi hâlinde dahi ihtilâf etmişlerdir. İmâm Mâlik, müflisin ölü hükmünde olmadığını, ölüm hâlinde mal sahibi malını aynen bulduğu takdirde diğer alacaklılarla beraber olacağın;, iflâs halininse böyle olmadığını söylemiştir. İmâm Ahmed'in kavli de budur. nâm eserde: Hadîsin muktezâsı, mal sahibinin dönebil-mesidir; ister paranın bir kısmım almış olsun; çünkü hadîs mutlaktır; deniliyor. Şafiî'nin yeni kavli budur. Eski kavlinde buna muhalefet etmiş, sadece paranın kalan kısmında alacaklılarla ortak olacağını söylemiştir.» hadîsin: «Bir kimse malını olduğu gibi bulursa...» cümlesiyle istidlal ederek mal sahibinin malını alabilmesi için onu olduğu gibi, hiç değişmemiş bulmasını şart koşmuşlardır. Mal azalmak gibi zâtında yahut sıfatlarından birinde değişikliğe uğramışsa, sahibi diğer alacaklılarla beraber olur. Buhârî şârihi Aynî, Şâfiîler’den birinin bu bâbta uzun tafsilât verdiğini söylemiş ve bu tafsilâtı kitabında nakletmiştir. Nehâî. Hasan-ı Basrî, bir rivâyette Şa'bî, Vekî' b. Cerrah, Abdullah b. Şubrume , Ebû Hanîfe, Ebû Yûsuf, Muhammed b. Hasen ve Züfer'e göre malı satan kimse sair alacaklılar gibidir, Ömer b. Abdilâzîz'den sahih senetle rivâyet olunmuştur ki: kimse sattığı malın parasından bir miktarını alır da sonra müşteri iflâs ederse, satanla diğer alacaklılar müsavî olur.» demiştir. Zührî'nin kavli de budur. Böyle bir kavil Hazret-i Alî'den de rivâyet olunmuştur. Katâde'nin Ha1Iâs b. Amr vasıtasiyle Ali (radıyallahü anh) dan tahrîc ettiği bu rivâyette: satan onu olduğu gibi bulursa, alacaklılarla beraber olur.» denilmektedir. Hazret-i Ali'nin bu sözü: «Bu hususta sahabeden Osman'ın kavline muhalefet eden bilmiyoruz.» diyen İbn Münzir'in kavlini reddeder. Hazret-i Osmanin kavli şudur: Bir kimse birindeki alacağını aldıktan sonra hâkim borçluyu müflis ilân etse, artık o kimsenin aldığı kendinindir. Çünkü hassaten alacaklıların o mala karışma, haklan yoktur. Kim hak isbât ederse o alır. Fakat sattığı malı aynen müflisin elinde bulan onu almaya diğer alacaklılardan daha haklıdır. İşte İmâm Mâlik, Şafiî ve Ahmed b. Hanbel bu kaville amel etmişlerdir, ler'den Tahâvî Bâbımız hadîsi hakkında şunları söylemiştir: «Bu hadîste bir kimsenin aynen kendi malını bulmasından bahsediliyor; halbuki satılmış mal artık satanın kendi malı değildir; bu mal satmazdan önce onun idi. Bir adamın kendi malı ancak ondan gasber dilen yahut ödünç veya emaneten verdiği şeylerdir. Bu gibi mallarda o kimse diğer alacaklılardan daha haklı olur. Hadîs-i şerîf işte bu mânâda vârid olmuştur. Nitekim Hazret-i Semuratü'bnü Cündeb'den rivâyet olunan bir hadîs de buna delâlet etmektedir. Hadîs şudur: Resûlüllah \" (sallallahü aleyhi ve sellem) ; kimsenin eşyası çalınır yahut kaybolur da, onu bir adamın elîn-de olduğu gibi bulursa, o kimse aynen o eşyayı almaya en ziyade hak sahibidir. Müşteri parasını satıcıdan geri alır.» buyurdular.) hadîsi Taberân'î dahi tahrîc etmiştir. Hadîs-i şerif, Ebû Hüreyre hadîsinden murâd: Emânet, ödünç ve mağsub gibi mallar olduğunu beyan ediyor; böyle bir malı sahibi, olduğu gibi bir kimsenin elinde bulursa almağa hakkı vardır. Diğer alacaklıların onda hakkı yoktur; zîra sahibinin miîkinde bakîdir; gâsıbm ve keza hırsızın elinde bulunması zulüm ve tecâvüz yolu ile olduğu için milkiyet ifâde etmez. Ama malı satarak müşteriye'teslim etmek böyle değildir. Satış, malı sahibinin milkinden çıkarır velev ki parasını almamış olsun.» Hazret-i Semûra hadîsinin râvilerinden Haccâc b. Ertat hakkında söz edenler olmuşsa da yersizdir. Ondan İmâm A'zam, Sevrî, Şu'be ve İbn Mübarek gibi büyükler hadîs rivâyet etmiş; Iclî , Ebû Zür'a, İbn Hibbân ve Hatîb gibi birçok hadis uleması onun sika. sadûk, fakîh ve hafız olduğunu söylemişlerdir. beyânına göre kendilerinde teassub eseri görülen bâzı zevat Hane filer hakkında âdaba aykırı sözler söylemişlerdir. Meselâ: Kurtubî; «Hanef iler'den Bazıları bu hadisi hiç bir esasa dayanmayan bir takım te'vîllerce tefsire kalkışmışlardır.» demiş; «Hanefîler onu zaif ve merdûd bir takım te'vîllerle tefsir ettiler.» mütâleasında bulunmuş: İbn Battal: Hanefîler satıcının alacaklılarla müsavi olduğunu söylerler. Tefsir hadîsini kıyâsla reddederek: Satılan mal müşterinindir; parası da onun zimmetindedir, derler.» şeklinde söze başlayarak Hanefîler'e cevaplar vermiş; hattâ «Tevdîh» sahibi: «Ebû Hanîfe bu hadisi, içinde satış zikredilmemiştir bahanesiyle gasb ve emânete hamletmiş; onu zaif, merdûd te'vîllerle tefsir etmiş; Alî ile İbn Mes'ûd'dan rivâyet olunan sübût bulmamış bir şeye takılmış kalmıştır..,» diyecek kadar ileri gitmiştir. Hanefîler tarafından bu zevatın her birine ilmî ve rcmknf cevaplar vermiştir. Bunlar «Umdetül-Kaarî»nin «İstikraz» bahsinde görülebilir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3993,
			"arabicnumber": "1560.01",
			"text": "(Bize Ahmed b. Abdillâh b. Yûnus rivâyet etti. ki): Bize Züheyr rivâyet etti. ki): Bize Mansûr, Ribl b. Hırâş’dan rivâyet etti. Onlara da Huzeyfe rivâyet etmiş. ki: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular: sizden öncekilerden bir adamın ruhunu karşıladılar da: \"Hayır nâmına bir şey İşledin mi?\" diye sordular. O zât: Yok (işlemedim) cevâbını verdi. Düşün! dediler. Adam: Ben insanlara veresiye mal verir; hizmetkârlarıma: Fakire mühlet vermelerini, zengine de müsamahakâr davranmalarını emrederdim; dedi. (azze ve celle): \"O kulumu affedin!\"» buyurur",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3994,
			"arabicnumber": "1560.02",
			"text": "Bize Alî b. Hucr ile İshâk b. İbrahim rivâyet ettiler. Lâfız İbn Hucr'undur. (Dediler ki): Bize Cerir, Mugîre\"den, o da Nuaym b. Ebî Hrâd'den, o da Bibi b. Hırâş'dan naklen rivâyet etti. Ribt şöyle demij: ile Ebû Mes'ûd bir araya geldiler de Huzeyfe şunları söyledi: Bir adam Rabbine kavuştu. Rabib ona: Ne yaptın? diye sordu. Adam: Hayır nâmına hiç bir şey yapmadım; ancak ben servet sahibi bir adamdım. Bu sebeple insanlardan alacak isterdim. Ama miimkin olanı alır; olmayana da müsamaha gösterirdim; cevabını verdi. (Teâlâ Hazretleri meleklerine): affedin!» buyurdu. Mes'ûd: «Ben Resûlüllah (sallallahü aleyhi ve sellem)'i böyle buyururken işittim, demiş",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3995,
			"arabicnumber": "1560.03",
			"text": "(Bize Muhammed b. Müsennâ rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be, Abdülmelik b. Umeyr'den, o da Rib'î b. Hırâş'dan, o da Huzeyfe'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti ki: Bir adam ölmüş de cennete girmiş. Kendisine: (Dünyada) ne yapıyordun? diye sormuşlar. Ya hatırlamış yahut hatırlatılmış da: Ben insanlarla alış-veriş yapardım. Fakire mühlet verir; para pul hususunda müsamaha gösterirdim; cevâbını vermiş. Bu sebeple de affolunmuş. . üzerine (orada bulunan) Ebû Mes'ûd: «Bunu Resûlüllah (sallallahü aleyhi ve sellem)’den ben -de işittim.» demiş",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3996,
			"arabicnumber": "1560.04",
			"text": "(Bize Ebû Saîd-i Eşecc rivâyet etti. ki): Bize Ebû Hâlid-i Ahmar, Sa'd b. Târık'dan, o da Rib'î b. Hırâş'dan, o da Huzeyfe'den naklen rivâyet etti. Huzeyfe şöyle dedi: (in huzurun)a kullarından Allah'ın kendisine mal verdiği bir kul getirilmiş de ona: Dünyada ne yaptın diye sormuş. Kullar Allah'dan hiç bir söz gizleyemezler ya! O kul: Yâ Rabbi! Bana malını verdin. Bu sebepten insanlarla alış veriş yapıyordum. Âdetim (alış verişte) müsamaha göstermek idi. Binâenaleyh zengine kolaylık gösterir; fakre de mühlet verirdim; demiş. Bunun üzerine Allah (azze ve celle): buna senden daha layı ki m; kulumu affedin!» buyurmuş. üzerine Ukbetü'bnü Âmir-i Cühenî ile Ebû Mes'ûd-i Ensârî: «Biz bunu Resûlüllah (sallallahü aleyhi ve sellem)’in ağzından işittik.» demişler",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3997,
			"arabicnumber": "1561",
			"text": "Bize Yahya b. Yahya ile Ebû Bekr b. Ebt Şeybe, Ebû Küreyb ve İshâk b. İbrâhîm rivâyet ettiler. Lâfız Yahya'nındır. Yahya (Bize haber verdi) tâbirini kullandı. Ötekiler: Bize Ebû Muâviye, A'meş’den, o da Şakîk'den, o da Ebû Mes'ûd'dan naklen rivâyet etti, dediler. Ebû Mes'ûd şunu söylemiş: Resûlüllah (sallallahü aleyhi ve sellem) buyurdular ki: Önceki ümmetlerden bir zât (kabirde) hesaba çekildi; ama hayır namına hiç bir şeyi bulunmadı. Yalnız insanlarla düşüp kalkardı; zengindi. Hizmetkârlarına fakiri (borcundan) affetmelerini emreylerdi. Allah (azze ve celle): Bİz buna ondan daha lâyıkız; onu affedin! buyurdu",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3998,
			"arabicnumber": "1562.01",
			"text": "Bize Mansûr b. Ebî Müzâhim ile Muhammed b. Cafer b. Ziyâd rivâyet ettiler. Mansûr: Bize İbrahim b. Sa'd, Zühri'den rivâyet etti, dedi. İbn Ca'fer ise: Bize İbrahim —ki İbn Sa'd'dır— İbn Şi-hâb'dan, o. da Ubeydullah b. Abdillâh b. Utbe'den, o da Ebû Hüreyre'den naklen haber verdi, ki Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuşlar; dedi: bir adam insanlara borç para verir; hizmetkârına: Bir fakîre varırsan onu affediver; umulur ki Allah da bizi affeder; derdi. Nihayet bu zât Allah'a kavuştu; Allah da onu affetti.»:",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3999,
			"arabicnumber": "1562.02",
			"text": "(Bana Harmele b. Yahya rivâyet etti. ki): Bize Abdullah b. Vehb haber verdi. ki): Bana Yûnus, İbn Şihâb'dan naklen haber verdi. Ona da Ubeydullah b. Abdillâh b. Utbe rivâyet etmiş. Ubeydullah da Ebû Hüreyre'yi: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i bu hadisin mislini irâd buyururken işittim; derken dinlemiş",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4000,
			"arabicnumber": "1563.01",
			"text": "(Bize Ebul-Heysem Hâlid b. Hidâş b. Aclân rivâyet etti. ki): Bize Hammâd b. Zeyd, Eyyûb'dan, o da Yahya b. Ebî Kesîr'den, o da Abdullah b. Ebî Katâde'den naklen rivâyet etti, ki Ebû Katâde bir borçlusunu aramış da borçlu ondan gizlenmiş. Sonra onu bulmuş. Borçlu: Ben fakirim, demiş. Ebû Katâde: Allah'a yemin eder misin? diye sormuş. Borçlu: Billahi, diye yemin etmiş. Ebû Katâde: Zîrâ ben Resûlüllah (sallallahü aleyhi ve sellem)'i: kimi Allah'ın kıyâmet gününün dehşetinden kurtarması memnun ederse fakire nefes aldırsın; yahut alacağını ona bağışlasın!» buyururken işittim; demiş. işi; deş",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4001,
			"arabicnumber": "1563.02",
			"text": "(Bu hadîsi bana Ebû't-Tâhir de rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Cerîr b. Hâzim, Eyyûb'dan naklen bu hadîsin benzerini haber verdi. Huzeyfe rivâyetini Buhârî «Kitâbü’l-Buyû'», «Benî îsrâîl» ve «İstikraz» bahislerinde; İbn Mâce «Ahkâm»da; Ebû Hüreyre (radıyallahü anh) rivâyetini Buhârî «Büyü'» ve «Benî İsrâîl», bahislerinde; Nesâî «Buyû'»da muhtelif râvilerden tahrîc etmişlerdir. Fetânın cem'idir. Fetâ: Hür veya köle hizmetçi demektir. Rivâyetlerdeki tecevvüz ve tecâvüz tâbirleri: Alacak isterken müsamaha göstermek; affetmek mânâlarmadır. hadîsler borçlu fakire mühlet vermenin ve borcunun ya tamamını vâhut bir kısmını bağışlamanın; borç isterken zengin, fakır kim olursa olsun herkese müsamaha göstermenin faziletine delildirler. zenginliğin hududunu tâyinde ihtilâf etmişlerdir. Bazıları: Nafakası üzerine vacib olan kimselerin geçimini te'mîn eden zengin sayılır, demişlerdir. Sevrî, İbn Mübarek, İmâm Ahmed ve İshâk'a göre elli dirhem gümüşe veya o kıymette altına sahip olan zengin sayılır. İmâm Şafiî: «Bir kimse bâzan kazandığı bir dirhemle zengin, bâzan da bedenen zayıf ve aile efradı kalabalık olması sebebiyle bin dirhem kazansa fakır olur.» demiştir. Bir takımları zenginliği zekâttaki nisâb miktarına Mâlik olmakla, Bazıları da zekât almağa ehil olmamakla tahdîd etmişlerdir. Elbisesinden, meskeninden, hizmetçisinden, borcundan ve aile nafakasından İazla malı bulunan kimsedir; diyenler de olmuştur. göre zenginlik üç mertebedir: Zekât îcâbeden zenginlik; Sâdaka-i fıtır ve kurban îcâbeden, zekât almayı haram kılan zenginlik; ve Dilenmeyi haram kılan zenginlik. Bazıları bunu elli dirhem, kıymetinde malı olmakla tahdîd etmişlerse de ekseriyete göre günlük yiyeceğini ve avret yerini örtecek elbisesini te'mîn eden kimseye dilenmek haramdır. Kazanmaya kudreti olan fakirin hükmü de budur. diyor ki: «Bütün bunlar dilemesi ve sadaka alması caiz olup olmayan kimse hakkındadır. Burada yani fakire mühlet verilmesi hususunda îtimad edilen cihet zenginliğin, fakirliğin Örfü âdete râci' olmasıdır. Emsaline nisbetle vakti hâli yerinde plan, zengin; böyle olmayan fakirdir.»",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4002,
			"arabicnumber": "1564.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Malik'e, Ebû’l-Zinâd'dan dinlediğim, onun da A'rac'dan, onun da Ebû Hüreyre’den naklen rivâyet ettiği şu hadîsi okudum: Resûlüllah (sallallahü aleyhi ve sellem): borcunu sallantıda bırakması zulümdür. Biriniz bir zengine havale olunursa, havaleyi kabul etsin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4003,
			"arabicnumber": "1564.02",
			"text": "(Bize İshâk b. İbrahim rivâyet etti. ki): Bize Îsâ b. Yûnus haber verdi. H. Muhammed b. Râfi' de rivâyet etti. ki): Bize Abdürrezzâk rivâyet etti. Her iki râvi birden: Bize Ma'mer, Hemmâm b. Münebbih'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini rivâyet etti. hadîsi Buhârî «Havale» bahsinin iki yerinde; Tirmizî, Nesâî ve İbn Mâce «Buyû'»da muhtelif râvilerden tah-rîc etmişlerdir. bâbda İbn Mâce, Hazret-i Abdullah b. Ömerden; Ebû Dâvûd, Nesâî ve İbn Mâce, Şerîd b. Süveyd (radıyallahü anh)'dan; Bezzâr , Hazret-i Câbir'den hadîsler rivâyet etmişlerdir. Aslında demiri uzatmak için yaymaktır. Burada ha bugün vereceğim ha yarın diyerek borcu sonraya bırakmak; müddetini uzatmaktır. «Matl: ödemesi gereken borcunu, imkânı varken ödememektir.» demiştir. Ezherî'ye göre matl müdâfaadır. Ganîye izafe edilmesi masdarm faile izâfesidir. Bâzan masdar me'fûle de izafe olunursa da burada mânâ: ödemeye iktidarı olan zenginin borcunu ödemeyip sallantıda bırakmasıdır. Âcizin hükmü böyle değildir. Mâmâfîh burada masdarın mef'ûlüne muzâf olduğunu söyleyenler de vardır. Bu takdirde mânâ şöyle olur: Alacaklı zengin bile olsa borcu ödemek îcâbeder; onun zenginliği, hakkının geciktirilmesine sebep teşkil edemez. Zengine olan borcun hâli böyle olunca fakire olan borç meselesi evleviyette kalır. Görülüyor ki, masdarı mef'ûlüne muzâf kabul edenlerin kavli tekellüf ve teassüften hâlî değildir. şerifte zenginin borcunu ödemeyip sallantıda bırakmasının zulüm olduğu bildiriliyor. Kurtubî'nin ta'rîfine göre lügatte zulüm: Bir şeyi îcâbettiği yere koymamaktır; şerîatte ise haram ve mez-mûm olan şeydir. Mâlikîler'den Sühnûn: «Zengin bir adam borcunu ödemeyip sallantıda bırakırsa şehâdeti kabul olunmaz; çünkü kendisine zâlim adı verilmiştir.» demiştir. Bazıları İmâm Şafiî'ye göre bu işi tekrarlamış olmak şartiyle şehâdeti reddedildiğini söylemişlerdir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4004,
			"arabicnumber": "1565.01",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Veki' haber verdi. H. Muhammed b. Hatim de rivâyet etti. ki): Bize Yahya b. Saîd rivâyet etti. râviler hep birden İbn Cüreyc'den, o da Ebû'z-Zübeyr'den, o da Câbir b. Abdillâh'dan naklen rivâyette bulunmuşlardır. Câbir: (sallallahü aleyhi ve sellem) suyun fazlasını satmaktan nehî buyurdu.» demiş",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4005,
			"arabicnumber": "1565.02",
			"text": "(Bize İshâk b. İbrahim rivâyet etti. ki): Bize Bavh b. Ubâde haber verdi. ki): Bize İbn Cüreyc rivâyet etti. ki): Bana Ebû'z-Zübeyr haber verdi ki, kendisi Câbir b. Abdillâh'ı şunları söylerken işitmiş: (sallallahü aleyhi ve sellem) devenin çiftleşmesini satmaktan, suyu- ve ziraat yapmak için yeri satmaktan nehî buyurdu. (Evet) Resûlüllah (sallallahü aleyhi ve sellem) işte bunları nebi buyurdu.»",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4006,
			"arabicnumber": "1566.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Ben Mâ-Jik'e okudum. H. Kuteybe de rivâyet etti. ki): Bize Leys rivâyet etti. râvilerin ikisi de Ebû'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hüre yre'den naklen rivâyet etmişlerdir ki, Resûlüllah (sallallahü aleyhi ve sellem): ottan menedilmeye varacağı için suyun fazlası (başkasına) men'edilmez.» buyurmuş",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4007,
			"arabicnumber": "1566.02",
			"text": "Bana Ebû't-Tâhir ile Harmele rivâyet ettiler. Lâfız Har-mele'nindir. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihâb'dan naklen haber verdi. ki) ; Bana Saîd b. Müseyyeb ile Ebû Seleme b. Abdirrahmân rivâyet ettiler ki, Ebû Hüreyre şunu söylemiş: Resûlüllah (sallallahü aleyhi ve sellem): otu menetmiş olacağınız için, suyun fazlasını başkasından esirgemeyin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4008,
			"arabicnumber": "1566.03",
			"text": "(Bize Ahmed b. Osman En-Nevfelî rivâyet etti. ki): Bize Ebû Âsim Dahhâk b. Mahled rivâyet etti. ki): Bize İbn Cü-reyc rivâyet etti. ki): Bana Ziyâd b. Sa'd haber verdi. Ona da Hilâl b. Üsâme, ona da Ebû Seleme b. Abdirrahmân haber vermiş ki, kendisi Ebû Hüreyre'yi şunu söylerken işitmiş: Resûlüllah (sallallahü aleyhi ve sellem): ot satılmış olacağı için, suyun fazlası satılamaz.» buyurdular. hadîsin Hazret-i Ebû Hüreyre rivâyetini Buhârî «Kitâbü’l-Müsâkaat» ile «Terkü'l-Hıyel»de, Nesâî «İhyâü'l-MevâUda tahrîc ettikleri gibi, diğer Kütüb-ü Sitte sahipleri de rivâyet etmişlerdir. İbn Mâce'nin tahrîc ettiği bir rivâyette: şey vardır ki, bunları başkasına vermemek olmaz: Su, ot ve ateş!» buyurulmuştur. İbn Merdeveyh'in tefsirinde Hazret-i Vasile b. Eska'dan şu hadîs rivâyet olunmuştur: (sallallahü aleyhi ve sellem): kullarından suyun fazlasını, otu ve ateşi esirgemeyin, zîra Allah bunları kuvvetlilere menfaat, zayıflara kuvvet olmak üzere yaratmıştır.» Yaş olsun kuru olsun ot manasınadır. Kuru ota Araplar ha-Şİş ve heşîm; yaş ota da uşb ve rutb derler. rivâyetlerde: Fazla suyu satmak, hayvanı çiftleştirmek için kiraya vermek ve ziraat için yeri kiralamak yasak edilmektedir. suyun satilamamasına sebep, dolayısiyle merayı satmış olmaktır. Bu mesele şöyle îzâh olunur: Bir kimse kendine milk olmak üzere kırda mera kenarında bir su kuyusu kazar. Kuyudan ihtiyacına yetip artacak kadar su çıkar. Etrafındaki merada ise başka su yoktur. Hayvan sahipleri sürülerini bu merada otlatabilmek için bu kuyudan istifade etmeye mecburdurlar. Aksi takdirde meradan istifâde edemezler; çünkü hayvanları susuzluktan ölür. Bu hâl karşısında suyu vermemek, hayvanların otlamasına mâni' olmak mânâsına geleceği için fazlasını parasızca hayvan sahiplerine vermek emrolunmuştur. İbn Bezîze fazla suyu ihtiyaç sahiplerinden esirgemenin büyük günahlardan sayılacağını söylemiştir. son rivâyetinde: ot satılmış olacağı için, suyun fazlası satılamaz.» buyurulmuştur. Zîra kuyu sahibi suyun'fazlasını parasız vermezse o merada hayvan otlatmağa imkân kalmayacaktır. Şu halde hayvan otlatabilmek için suyu satmak, milki olmayan merayı satmak gibidir. nehyin tahrîm mi yoksa tenzih mi ifâde ettiğinde ihtilâf olunmuştur. Tıybî: «Suyun milk olup olmamasını da bu esâsa bina etmişlerdir; evlâ olan: Nehyi kerahete hamletmektir.» diyor. Şafiîler'in «Et-Tevdîh» adlı fıkhında bu mesele hakkında şu îzâhât verilmiştir: «Buradaki nehî İmâm Mâlik ile Evzâi\"ye göre tah-rîme hamledilmiştir. Hattâbî ile İbn Tîn bu kavli Şâfii'den de nakletmişlerdir. Bazıları su vermeyi müstehap görerek nedb mânâsına hamletmişlerse de bizce esah olan kavle göre ekin için değil hayvanlar için suyu vermek vaciptir.» Bu meselede Hanefîler'in mezhebi de budur. sahibinin suyu ihtiyâcına sarf etmek hususunda haklı olduğu ittifâkî bir meseledir. Çünkü Peygamber (sallallahü aleyhi ve sellem) suyun fazlasını esirgemekten menetmiştir. Fazlası olmayan su bu nehîde dahil değildir. Kaplara doldurulan suyun fazlasını vermek vâcib değildir; meğer ki suyu isteyen muztar kalmış, ola! diyor ki: «Kuyu sahibinin ihtiyacından artan suyunu ekin sulamak için başkasına vermesi vâcib değil; hayvan sulamak için vermesi vaciptir. Vücubun da şartları vardır. Bunların birincisi: Hayvan sahibinin mubah su bulamaması; ikincisi: Suyun hayvan ihtiyacı için verilmesi; üçüncüsü.: Kuyu sahibinin ihtiyacı olmamasıdır.» ve hayvanlarına su verilir. O yerde oturmak isteyenler hakkında iki vecih vardır. Birinci veçhe göre onlara su vermek vâcib değildir; zira orada kalmalarına zaruret yoktur. Esah olan ikinci veçhe göre ise vaciptir. Bu takdirde su için onlardan para alınıp alınmayacağı hususunda da iki kavil vardır. Esah olan kavle göre para alınmaz; çünkü Resûlüllah (sallallahü aleyhi ve sellem) suyun fazlasını satmayı yasak etmiştir. çiftleşmesini satmak...»dan murad: Boğa ve aygır gibi hayvanları çiftleştirmek için kiralamaktır. İmâm A'zam, Şafiî, Ebû Sevr ve diğer bir takım ulema bunun bâtü ve haram olduğunu söylemişlerdir. Hayvanı kira ile alan kimse onu kendi hayvanı ile çiftleştirse bile hiç bir ücret vermesi lâzım gelmez; çünkü satılan şey meçhul ve teslimi, imkânsızdır. ve tabiînden bir cemaat, İmâm Mâlik ve diğer bâzı ulemâ malûm bir müddet yahut malûm sayıda çiftleştirme için hayvan kiralanabileceğine kail olmuşlardır. Onlara göre bu bir ihtiyaç ve menfaattir; bu bâbtaki nehl tenzihe hamledilir. için yeri satmak» arazîyi kâra vermektir. Ulemânın bu husustaki kavillerini «Yeri kiraya verme» bahsinde görmüştük",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4009,
			"arabicnumber": "1567.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlik'e, İbn Şihâb'dan dinlediğim, onun da Ebû Bekr b. Abdirrahmân'dan, onun da Ebû Mes'ûdu Ensârî'den naklen rivâyet ettiği şu hadîsi okudum: Resüllallah (sallallahü aleyhi ve sellem), köpeğin parasını, fahişenin mehrini ve kâhinin ücretini yasak etmişler",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4010,
			"arabicnumber": "1567.02",
			"text": "(Bize Kuteybe b. Saîd ile Muhammed b. Rumh, Leys b. Sa'd'dan rivâyet ettiler. H. Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Süfyân b. Uyeyne rivâyet etti. Her iki râvi Zührî'den bu isnâdla bu hadîsin mislini rivâyet etmişlerdir. İbn Rumh'un rivâyet ettiği Leys hadîsinde «Leys'in Ebû Mes'ûd'dan işittiği» zikredilmiştir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4011,
			"arabicnumber": "1568.01",
			"text": "(Bana Muhammed b. Hatim rivâyet etti. ki): Bize Yahya b. Saîd El-Kattân, Muhammed b. Yûsui'dan rivâyet etti, ki): Sâib b. Yezîd'i, Bati' b. Hadîc'den naklen rivâyet ederken işittim. ki): Ben Peygamber (sallallahü aleyhi ve sellem)’i: en kötüsü fahişenin mehr-i, köpeğin parası ve haccâmın kazancıdır.» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4012,
			"arabicnumber": "1568.02",
			"text": "(Bize İshâk b. İbrahim rivâyet etti. ki): Bize Velîd b. Müslim, Evzâî'den, o da Yahya b. Ebî Kesîr'den naklen haber verdi. ki): Bana İbrahim b. Kaarız, Sâib b. Yezîd'den rivâyet etti, ki): Bana Râfi' b. Hadîc, Resûlüllah (sallallahü aleyhi ve sellem)’den rivâyet etti. parası habistir; fahişenin mehri habistir; haccâmın kazancı da habistir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4013,
			"arabicnumber": "1568.03",
			"text": "(Bize İshâk b. İbrâhîm rivâyet etti. ki): Bize Abdürrezzâk haber verdi. ki): Bize Ma'mer, Yahya b. Ebî Kesîr'den bu isnâdla bu hadîsin mislini rivâyet eyledi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4014,
			"arabicnumber": "1568.04",
			"text": "(Bize İshâk b. İbrâhîm rivâyet etti. ki): Bize Nadr b. Şü-meyl haber verdi. ki): Bize Hişâm, Yahya b. Ebî Kesîr'den rivâyet etti. ki): Bana İbrahim b. Abdillâh, Sâib b. Yezîd'den rivâyet etti. ki): Bize Râfi' b. Hadîc, Resûlüllah (sallallahü aleyhi ve sellem)'den bu hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4015,
			"arabicnumber": "1569",
			"text": "(Bana Seleme b. Şehîb rivâyet etti. ki): Bize Hasen b. A'yen rivâyet etti. ki): Bize Ma'kil, Ebû'z-Zübeyr'den rivâyet etti. ki): Cabir'e (satılan) köpekle kedinin paralarını sordum: (sallallahü aleyhi ve sellem) bundan menetti.» dedi. hadîsin Ebû Mes'ûd-u Ensâri rivâyetini Buhârî «Büyü'», «İcâre», «Talâk» ve «Tıbb» bahislerinde; Ebû Dâvûd «Kitâbü'l-Buyû'»da; Tirmizî «Büyü'» ile «Nikâh» bahislerinde; Nesâî «Nikâh» ve «Sayd»da; İbn Mâce «Ticârât»da muhtelif râvilerden tahrîc etmişlerdir. Tirmizî bu bâbda: Ömer, Ali, İbn Mes'ûd, Câbir, Ebû Hüreyre, İbn Abbâs, İbn Ömer ve Abdullah b. Ca'fer (radıyallahü anhûm) hazerâtından da hadîsler rivâyet olunduğunu söyle-. miş; kendisi Bâbımız rivâyetlerinden Sâib b. Yezîd'in Râfi' b. Hadîc'den naklettiği hadîsi de tahrîc etmiştir. Mezkûr hadîsi Ebû Dâvud, Nesâî ve İbn Mâce dahi rivâyet etmişlerdir: sarihi Aynî, Tirmizî'nin işaret ettiği zevatın hadîslerini ve bu hadîsleri kimlerin tahrîc ettiğini göstermiş; bu bâbda: Ebû Cuheyfe, Abdullah b. Amr, Enes b. Mâlik, Sâib b. Yezîd ve Meymûne binti Sa'di (radıyallahü anhüm)'dan da hadîsler rivâyet olunduğunu söylemiştir. Hülâsası şudur: Ömer hadîsini Taberânî «El-Kebîr»inde; Ali (radıyallahü anh) hadîsini İbn Adiy «El-Kâmil» adlı eserinde tahrîc etmişlerdir. İbn Mes'ûd hadîsini kimin tahrîc ettiği beyan edilmemiştir. (radıyallahü anh) hadîsini Müslim,- Ebû Dâvûd ve Tirmizî tahrîc etmişlerdir. Bâbımızın son rivâyeti bu hadîstir. Hüreyre hadîsini Ebû Dâvûd, Nesâî, İbn Mâce ve Hâkim; İbn Abbâs (radıyallahü anh) hadîsini Ebû Dâvûd ile Nesâî; İbn Ömer hadî'sini İbn Ebî Hatim tahrîc etmişlerdir. Fakat İbn Ömer rivâyeti hakkında: «Bu hadîs münkerdîr.» denilmiştir. b. Ca'fer hadîsini İbn Ebî Adiy «El-Kâmil» nâm eserinde rivâyet etmiştir; bu hadîs de zaîftir. Cuheyfe hadîsini Buhârî, Abdullah b. Amr hadîsini Hâkim «El-Müstedrek» adlı eserinde; Enes (radıyallahü anh) hadîsini İbn Adiy; Sâib b. Yezîd hadîsini Nesâî, Meymûne hadîsini de Taberâhî tahrîc etmişlerdir. Bu rivâyetlerin bâzılarında az çok ziyadeler vardır. Fakat köpek satmanın, fahişe mehrinin, kâhin ücretinin ve haccâmın kazancının yasak edilmesi hususunda hemen hepsi müttefiktir. mehrinden murâd: zinâ mukabilinde yahut haram olan nikâh karşılığında ona verilen paradır. Buna mehir denilmesi şeklen benzediği içindir. Hattâbî'nin beyânına göre kâhin: Gelecekte olacak şeyleri ve sırlan bildiğini iddia eden kimsedir. Çalınan şeyleri ve bunları kimin çalıp nereye götürdüğünü bilmekle meşgul olanlara «Arrâf» denir. Araplar arasında birçok kâhinler vardı. Bunların Bazıları gaibten kendilerine haber getiren cinnî arkadaşları olduğunu söyler; bir takımları gaib İşlerini anlamak için kendilerine hâs bir anlayışa sahip olduklarını iddia ederlerdi. Müneccimlere kâhin, tabîblere arrâf ve kâhin diyenler de vardır. Bunlar nehîde dâhil değillerdir. Bahşiş, rüşvet mânâlarına gelir. Burada maksat, kâhine verilen ücrettir. Bu kelime: Kızının mehrinden babasının kendine pay ayırması mânâsında da kullanılır",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4016,
			"arabicnumber": "1570.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlik'e, Nâfi'den dinlediğim, onun da İbn Ömer'den rivâyet ettiği şu hadîsi okudum: (sallallahü aleyhi ve sellem) köpeklerin öldürülmesini emir buyurdu",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4017,
			"arabicnumber": "1570.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Ebû Usâme rivâyet etti. ki): Bize Ubeydullah, Nâfi'den, o da İbn Ömer'den naklen rivâyet eyledi. İbn Ömer şunu söylemiş: (sallallahü aleyhi ve sellem) köpeklerin öldürülmesini emir buyurdu ve köpekler Öldürülsün diye Medine'nin nahiyelerine haber gönderdi.»",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4018,
			"arabicnumber": "1570.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4019,
			"arabicnumber": "1571",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Hammâd b. Zeyd Amr b. Dinar'dan, o da İbn Ömer'den naklen haber verdi kij Resûlüllah (sallallahü aleyhi ve sellem) av köpeği yahut koyun veya hayvan köpeği müstesna olmak üzere köpeklerin öldürülmesini emir buyururdu. üzerine İbn Ömer'e: Ebû Hüreyre (yahut ekin köpeği) diyor; demişler. İbn Ömer: «Şüphesiz Ebû Hüreyre'nin ekini var!» cevâbını vermiş",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4020,
			"arabicnumber": "1572",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4021,
			"arabicnumber": "1573.01",
			"text": "(Bize Ubeydullah b. Muâz rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Şu'be, Ebû't-Teyyâh'dan rivâyet etti. O da Mutarrif b. Abdillah'ı İbn Mugaffel'den naklen rivâyet ederken dinlemiş. İbn Mugaffel ki: (sallallahü aleyhi ve sellem) köpekleri öldürmeyi emreyledi. Sonra: onların ne işine giriyor!» buyurdu. Sonra av köpeği ile çoban köpeği hakkında ruhsat verdi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4022,
			"arabicnumber": "1573.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4023,
			"arabicnumber": "1574.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4024,
			"arabicnumber": "1574.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Züheyr b. Harb ve İbn Nümeyr rivâyet ettiler. (Dediler ki): Bize Süfyân, Zührî'den, o da Sâ-lim'den, o da babasından, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyette bulundu. veya çoban köpeği müstesna, bir kimse köpek edinirse ecrinden her gün iki kîrât eksilir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4025,
			"arabicnumber": "1574.03",
			"text": "Bize Yahya b. Yahya ile Yahya b. Eyyûb, Kuteybe ve İbn Hucr rivâyet ettiler. Yahya b. Yahya (Bize haber verdi) tâbirini kullandı, ötekiler: Bize İsmâîl yani İbn Ca'fer, Abdullah b. Dinar'dan naklen rivâyet etti ki, Abdullah, İbn Ömer'i şunu söylerken işitmiş dediler: Resûlüllah (sallallahü aleyhi ve sellem):. yahut çoban köpeği müstesna, bir kimse köpek edinirse amelinden her gün İki kîrât eksilir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4026,
			"arabicnumber": "1574.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4027,
			"arabicnumber": "1574.05",
			"text": "(Bize İshâk b. İbrahim rivâyet etti. ki): Bize Vekî' haber verdi. ki): Bize Hanzale b. Ebî Sülyân, Sâlim'den, o da babasından, o da Resûlüllah (sallallahü aleyhi ve sellem)'den naklen rivâyette bulundu: yahut çoban köpeği müstesna, bir kimse köpek edinirse amelinden her gün iki kîrât eksilir.» buyurmuşlar. ki: «Ebû Hüreyre: Yahut ekinlik köpeği, derdi. Kendisi arazî sahibi- idî.»",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4028,
			"arabicnumber": "1574.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4029,
			"arabicnumber": "1574.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4030,
			"arabicnumber": "1575.01",
			"text": "Bana Ebû't-Tâhir Üe Harmele rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihâb’dan, o da Saîd b. Müseyyeb'den, o da Ebû Hüreyre'den, o da Resûlüllah (sallallahü aleyhi ve sellem)’den naklen haber verdi: kimse av, koyun veya araz? köpeği olmayan bir köpek edinirse gerçekten o kimsenin ecrinden her gün iki kîrât eksilir.» buyurmuşlar. Ebû't-Tâhir'in hadîsinde «Arazî köpeği» yoktur",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4031,
			"arabicnumber": "1575.02",
			"text": "(Bize Abd b. Humeyd rivâyet etti. ki) ; Bize Abdurrezzâk rivâyet etti. ki): Bize Ma'mer, Zührî'den, o da Ebû Seleme'den, o da Ebû Hüreyre'den naklen haber verdi. Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): av veya ekinlik köpeği müstesna, bir kimse köpek edinirse ecrinden her gün bir kîrât eksilir.» buyurdular. şunu söylemiş: «İbn Ömer'e Ebû Hüreyre'nin sözünü andılar da: Allah Ebû Hüreyre'ye rahmet eylesin, ziraat sahibi idi; dedi.»",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4032,
			"arabicnumber": "1575.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4033,
			"arabicnumber": "1575.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4034,
			"arabicnumber": "1575.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4035,
			"arabicnumber": "1575.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4036,
			"arabicnumber": "1576.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4037,
			"arabicnumber": "1576.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4038,
			"arabicnumber": "1577.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4039,
			"arabicnumber": "1577.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4040,
			"arabicnumber": "1577.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4041,
			"arabicnumber": "1202.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4042,
			"arabicnumber": "1202.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4043,
			"arabicnumber": "1578",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4044,
			"arabicnumber": "1579.01",
			"text": "(Bize Ebû't-Tâhir de rivâyet etti. Lâfız onundur. ki): Bize İbn Vehb haber verdi. ki): Bana Mâlik b. Enes ve başkası Zeyd b. Eslem'den, o da Mısırlı Abdurrahmân b. Va'lete's-Sebeî'den naklen haber verdi. Kendisi Abdullah b. Abbâs'a üzümden sıkılan (şarab)’in hükmünü sormuş da İbn Abbâs şunu söylemiş: adam Resûlüllah (sallallahü aleyhi ve sellem)'e; bir tulum şarap hediyye etti. Resûlüllah (sallallahü aleyhi ve sellem): misin ki, Allah bunu haram kılmıştır?» buyurdu. Adam: Hayır, cevâbını verdi ve hemen birine birşeyler fısıldadı. Resûlüllah (sallallahü aleyhi ve sellem): ne fısıldadın?» diye sordu. Adam: Şarabı satmasını emrettim; dedi. içilmesini haram kılan (Allah), satılmasını da haram kılmıştır.» buyurdular. Bunun üzerine adam tulumu açarak içindeki (akıp) gitti",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4045,
			"arabicnumber": "1579.02",
			"text": "(Bana Ebû't-Tâhir rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Süleyman b. Bilâl, Yahya b. Saîd'd en, o da Ab Tahman b. Va'le'den, o da Abdullah b. Abbâs'dan, o da Resûlüllah (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4046,
			"arabicnumber": "1580.01",
			"text": "Bize Züheyr b. Harb ile İshâk b. İbrahim rivâyet ettiler, Züheyr (Bize rivâyet etti) tâbirini kullandı. İshâk: Bize Cerîr, Mansûr'dan, o da Ebû'd-Duhâ'dan, o da Mesrûk'dan, o da Âişe'den naklen haber verdi, dedi. Âişe şunu söylemiş: sûresinin sonundaki âyetler inince Resûlüllah (sallallahü aleyhi ve sellem) çıkıp onları halka okudu. Sonra şarap ticâretini yasak etti.»",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4047,
			"arabicnumber": "1580.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb ve İshâk b. İbrahim rivâyet ettiler. Lâfız Ebû Küreyb'indir. İshâk (Bize haber verdi) tâbirini kullandı. Ötekiler: Bize Muâviye, A'meş'den, o da Müslim'den, o da Mesrûk'dan, o da Âişe'den naklen rivâyet etti, dediler. Âişe şöyle dedi: sûresinin sonunda ribâ hakkındaki âyetler indirilince Resûlüllah (sallallahü aleyhi ve sellem) mescide çıkarak şarap ticâretini haram kıldı.» hadîsin Hazret-i Âişe rivâyetini Buhârî «Salât», «Büyü'» ve «Tefsir» bahislerinde; Ebû Dâvûd «Buyû'»da; Nesâî «Büyü'» ve «Tefsir» bahislerinde; İbn Mâce «Eş'ribe»de muhtelif râvilerden tahrîc etmişlerdir. elinde ondan bir şey bulunduğu halde bu âyet kendisine ulaşırsa...» ifâdesindeki âyetten murâd: Mâide süresindeki: îmân edenler! Şarap, kumar, putlar ve fal okları ancak ve ancak şeytan işi pis şeylerdir...\" Sure-i Mâide, âyet: 90 âyet-i kerîmesidir. İçki bu âyetle haram kilınmıştır. Hazret-i Âişe (radıyallahü anha)’nın işaret ettiği Bakare âyeti faiz hakkındadır. Bu âyet-i kerîme'de: yiyenler kabirlerinden ancak şeytanın çarptığı bir kimsenin kalktığı gibi kalkacaklardır. Buna sebep onların: Alış-veriş ancak faiz gibidir, demeleridir. Halbuki Allah alış-verişi helâl, faizi haram kılmıştır.\" Sure-i Bakare, âyet: 275 buyurulmaktadır. âyeti faiz âyetinden hayli zaman önce inmiştir. Faiz âyeti ya en son inen âyettir; yahut son âyetlerden biridir. Şu halde içkinin ticâreti ya şarab haram edildikten bir müddet sonra yasak edilmiştir; yahut içilmesi ve ticâreti aynı zamanda haram kılınmış; bilâhare İ'âiz âyeti inince içki ticâretinin yasak edildiği te'kîd ve mübâlega ile duyurulmuş olmak için tekrar haber verilmiştir. O mecliste içki ticâretinin yasak edildiğini bilmeyen kimseler bulunması sebebiyle tekrarlanmış olması da muhtemeldir. «Zahire bakılırsa bu mesele şarabın haram edilmesinden az bir müddet sonra henüz içki yasağı şöhret bulmadan olmuştur.» diyor",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4048,
			"arabicnumber": "1581.01",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Leys, Yezîd b. Ebî Habîb'den, o da Atâ' b. Ebî Rabâh'dan, o da Câbir b. Abdillâh'dan naklen rivâyet etti ki, Câbir fetih yılında Resûlüllah (sallallahü aleyhi ve sellem)'i Mekke'de: Allah ve Resûlü, şarap, İaşe, domuz ve putların satılmasını haram kılmıştır.» buyururken işitmiş. Bunun üzerine: Yâ Resûlüllah, ölü hayvan yağlarına ne buyurursun? Bunlarla gemiler boyanır; deriler yağlanır; halk onlardan kandil yapar! demişler. Resûlüllah (sallallahü aleyhi ve sellem): o haramdır.» cevâbını vermiş ve o esnada: yahudîlerin belâsını versin! Allah (azze ve celle) onlara ölü hayvan yağlarını haram edince yağı erittiler; sonra saftılar da parasını yediler.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4049,
			"arabicnumber": "1581.02",
			"text": "Bize Ebû Bekr b. Ebî Şey be ile İbn Nümeyr rivâyet ettiler. (Dediler ki): Bize Ebû Üsâme, Abdülhamîd b. Ca'fer'den, o da Yezîd b. Ebî Habîb'den, o da Ata'dan, o da Câbir'den naklen rivâyet etti. Câbir: Ben fetih yılında Resûlüllah (sallallahü aleyhi ve sellem)’den işittim, demiş. H. Muhammed b. Müsennâ rivâyet etti. ki): Bize Dahhâk yani Ebû Âsim, Abdülhamîd'den rivâyet etti. ki): Bana Yezîd b. Ebî Habîb rivâyet etti. ki): Bana Ata', Câbir b. Abdillâh'ı şunları söylerken işittiğini yazdı: «Ben fetih yılında Resûlüllah (sallallahü aleyhi ve sellem)’i Leys hadîsinin mislini îrâd buyururken dinledim.» hadîsi Buhârî «Kitâbü’l-Buyû'», «Kitâbü'l-Megâzî» ve «Kitâbü't-Tefsîr»de; Ebû Dâvûd; Tirmizî ve Nesâî «Buyû'»da; İbn M'âce «Ticârât-da muhtelif râvilerden tahrîc etmişlerdir. Hadîsin metninden de anlaşıldığı vecihle hadîs-i şerif hicretin sekizinci yılı ramazanında Mekke'nin fethi esnasında şerefsadır olmuştur. bazılarına göre hadîste beyân buyurulan şeyler ihtimâl daha evvel haram kılınmış; Resûlüllah (sallallahü aleyhi ve sellem) o zamana kadar duymamış olanların işitmesi için burada onları tekrarlamıştır. esas nüshalarınde ve Nesâî île İbn Mâce'nin «Sünen»lerinde fi'li müfred olarak kullanılmıştır. Ebû Davûd'un «Sünen»inde -fi'li kullanılmış, fakat denilmemiştir. Bâzı kitaplarda ise fiil tesniye sîgasiyle kullanılarak denilmiştir. Kıyas olan da budur. Nitekim İbn Merdeveyh de tefsirinde bu şekilde rivâyet etmiş; birçok sahîh rivâyetlerde fiil tesniye sîgasiyle kullanılmıştır. rivâyetin vechi şudur: Allahü teâlâ'nın emri Resûlü zîşân’l-nın da emri demektir; çünkü o ancak Allah'ın emrettiği şeyi emreder; binâenaleyh emir birmiş gibidir; bu sebeple fiil müfred kullanılmıştır. haramdır.» cümlesindeki zamir, bazılarına göre satışa râcidir. Bu takdirde mânâ: «Ölü hayvan yağlarının satışı haramdır.» demek olur. İmâm Şafiî'nin kavli budur. Bir takım ulema buradaki zamiri intifâa irca' etmişlerdir. Onlara göre cümlenin mânâsı: «Ölü hayvan yağlarından faydalanmak haramdır.» demektir. Bu zevat ölü hayvandan faydalanmayı esas itibariyle caiz görmezler; meğer ki caiz olduğuna delîl buluna. Nitekim tabaklanan derinin temiz olacağı hakkında delil hadîs vardır. hadîste Peygamber (sallallahü aleyhi ve sellem)’e üç şey sorulmuştur: Ölü hayvan yağları ile gemilerin yağlanması, Derilerin yağlanması ve Bunların kandillerde yakılması. kirâmın «Bu yağlar satılabilir mi?» diye sormaları bunun caiz olduğunu zannettikleri içindir; çünkü böyle bir satışta birçok faydalar vardır. Nasıl ki ehlî eşeklerin etleri yenmese bile satılması birçok menfaatlerden dolayı mubah kılınmıştır. Fakat Peygamber (sallallahü aleyhi ve sellem),ıkendilerine cevap vererek meselenin zannettikleri gibi olmadığını haber vermiş; Ölü hayvan yağlarının satışının da, parasının da haram olduğunu bildirmiştir; çünkü bu yağlar kanla şarap gibi satışı ve satış bedeli haram olan necis şeylerdendir. yağları kandillerde, gemi ve deri yağlamalarında kullanmak satıp da paralarını yemek kabilinden değildir; zira yağ olarak sürülen bir şey, pislik bulaşan eşya gibi su ile yıkanıp temizlenebilir. Atâ'b. Ebî Rebâh ile ulemâdan bir cemaatin kavilleri budur. Sahâbe-i kirâmdan Ali, İbn Abbâs ve İbn Ömer (radıyallahü anhûm) hazerâtınm kavillerine göre içine fare düşen yağı kandilde yakmak caizdir. diyor ki: «Yememek ve bedende kullanmamak şartiyle bu yağlardan kandil, pis zeytin yağından sabun yapmak, pis baldan arılara yedirmek, murdar Ölen hayvanı köpeklere yedirmek gibi meseleler ihtilaflıdır. Bizim mezhebe göre bunların hepsi caizdir. Iyâz bu Kavli Mâlik, Şafiî, Sevrî, Ebû Hanîfe ve arkadaşlarından da nakletmiş tir.» hayvan ile putları satmanın caiz olmadığına icmâ-ı ümmet vardır; çünkü bunlardan istifade edilmez; binâenaleyh mukabillerinde para vermek malı israf olur; bunu şeriat yasak etmiştir. Bu ta'lüe bakarak Şâfiîler'le Hanefîler'den Bazıları putlar kırılır da istifâde edilir hale getirilirse parçalarını satmak caizdir demişlerdir. Münzir: «Madem ki, ulemâ ölü hayvanı satmanın haram olduğuna ittifak etmişlerdir, o halde dâr-ı harbden bir kâfirin leşi de aynı hükümdedir.» diyor. Filhakika ulemâ bu hadîsle istidlal ederek insan ölüsünün mutlak surette satılamayacağına kail olmuşlardır. Müs-iümanın cenazesi şeref ve faziletinden dolayı satılamaz; hatta saçından, derisinden ve hiç bir uzvundan faydalanmak caiz değildir. gelince: Hendek harbinde Nevfel b. Abdillâh b. Muğîre müslümanlar tarafından öldürülüp elde edilince müşrikler onu satın almak istemiş, fakat Resûlü Ekrem (sallallahü aleyhi ve sellem): onun cesedine ve cesedinin kıymetine ihtiyacımız yoktur.» buyurarak bu satışı reddetmiş; cesedi karşılıksız müşriklere terk etmiştir. Hatta siyer ulemasından İbn Hişâm'ın beyanına göre müşrikler Nevfel'in cesedine mukabil Peygamber (sallallahü aleyhi ve sellem)'e on bin dirhem vermek istemişlerdi. bu hadîsle insan Ölüsünün pis olduğuna istidlal etmişlerdir. Ancak müslümanın ne dirisinin, ne de ölüsünün pis olamayacağını bildiren sahîh bir hadîs Bâbımız hadîsinin umumunu tahsis etmiştir. Mezkûr hadîsi Hâkim «El-Müstedrek»inde İbn Abbâs (radıyallahü anh)'dan rivâyet etmiştir. Bu hadîs hakkında Hâkim: «Buhârî ve Müslim'in şartları üzere sahihtir; yalnız onlar bunu tahrîc etmemişlerdir.» demektedir. , insan ve hayvan pislikleri gibi faydalı necasetlerin satılıp satılamayacağı hususunda ihtilâf edildiğini, Şafiî’ye göre caiz olmadığını söylemiş: «Bunu İmâm Mâlik ile Kûfeliler ve Taberî caiz görmüşlerdir.» demiştir. Bir takım ulemâ bu meseleyi müşteriye caiz, satıcıya memnu' görmüş, müşteri buna mecbur olduğu için satıcıdan daha ma'zur sayıldığım söylemişlerdir. Bu kavil bâzı Şâfiîler'den rivâyet olunmuştur. hadîsi Ölü hayvanın et, kıl, tırnak, diş ve deri gibi cüzlerinin de necis olduğunu söyleyenlerin delilidir. İmâm Şafiî ile İmâm Ahmed'in kavilleri budur. A'zam ile İmâm Mâlik'e göre kıl, tırnak, boynuz ve kemik gibi içine hayât girmeyen âzâ ölümle pis olmaz, Peygamber (sallallahü aleyhi ve sellem)’in fildişinden bir tarağı vardı. Fil, eti yenilmeyen bir hayvandır; binâenaleyh bu da gösterir ki, diş ve kemik gibi şeyler temizdir. Hazret-i İbn Abbâs'tan rivâyet ettiği bir hadîste: (sallallahü aleyhi ve sellem) ölü hayvanın yalnız etini haram kıldı; deri, kıl ve yünde ise beis yoktur.» denildiği gibi, yine Dârekutnî'nin Hazret-i Ümmü Seleme (radıyallahü anh)'dan rivâyet ettiği bir hadîste de Ümmü Seleme (radıyallahü anh): «Resûlüllah (sallallahü aleyhi ve sellem)'i: şartiyle ölü hayvan;n derisinde; su ile yıkanmak şartı ile yün, kıl ve boynuzlarında bir beis yoktur» buyururken işittim.» demektedir. sanemin cem'idir. Cevheri'nin beyanına göre sanem ile vesen aynı mânâya gelirler; put demektirler. Diğer lügat uleması bu iki kelime arasında mânâ itibariyle fark görmüş: «Vesen: Cüssesi olan puttur; sanem ise sadece resmedilendir.» demişlerdir. Bu hususta daha başka sözler de söylenmiştir. Bazan vesen: Haç mânâsına dahi kullanılır. şer'î usûle riâyetle kesilmeyip eceliyle ölen hayvandır. Eceliyle ölen hayvan bilicmâ' yenmez. Bundan yalnız balık ile çekirge istisna edilmiştir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4050,
			"arabicnumber": "1582.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4051,
			"arabicnumber": "1582.02",
			"text": "(Bize Ümeyye b. Bistam rivâyet etti. ki): Bize Yezîd b. Zürey' rivâyet etti. ki): Bize Ravn yani İbn Kasım, Amr b. Di-nâr'dan bu isnâdla bu hadîsin mislini rivâyet eyledi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4052,
			"arabicnumber": "1583.01",
			"text": "(Bize İshak b. İbrahim El-Hanzalî rivâyet etti. ki): Bize Ravh b. Ubâde haber verdi. ki): Bize İbn Cüreyc rivâyet etti. ki): Bana İbn Şihâb, Saîd b. el-Müseyyeb'den naklen haber verdi. Saîd de ona Ebû Hüreyre'den, o da Resûlüllah (sallallahü aleyhi ve sellem)'den naklen rivâyette bulunmuş ki: yahudîlerin belâsını versin! Allah kendilerine İç yağlarını haram kıldı; onlarsa bu yağları satıp paralarını yediler.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4053,
			"arabicnumber": "1583.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4054,
			"arabicnumber": "1584.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlik'e, Nâfi’den dinlediğim, onun da Ebû Saîd-i Hudrî'den naklen rivâyet ettiği şu hadîsi okudum. Resûlüllah (sallallahü aleyhi ve sellem): misline olmadıkça altını altınla satmayın! Birini diğerinden zî-yade yapmayın! Misli misline olmadıkça gümüşü de gümüşle satmayın! Birini diğerinden ziyade yapmayın! Bunlardan halen mevcut olmayanı mevcut olanla satmayın!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4055,
			"arabicnumber": "1584.02",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Leys rivâyet etti. H. Muhammed b. Rumh da rivâyet etti. ki): Bize Leys, Nâfi’den naklen haber verdi ki, İbn Ömer'e Benî Leys (kabilesin)’den bir zât Ebû Saîd-i Hudrî'nin bunu Kuteybe'nin rivâyetinden naklederdiğini söylemiş. Bunun üzerine Abdullah (İbn Ömer) beraberinde Nâfi' olduğu hâlde (Ebû Saîd'e) gitmiş. İbn Rumh hadîsinde (şöyle denilmektedir): Nâfi' dedi ki: Bunun. üzerine Abdullah, yanında ben ve Leysî olduğumuz halde Ebû Saîdi Hudrî'ye giderek yanına girdi; ve: Bana şu zâtın haber verdiğine göre sen Resûlüllah (sallallahü aleyhi ve sellem)’m, misli misline olmadıkça gümüşü gümüşle ve misli misline olmadıkça altını altınla satmaktan nehî buyurduğunu haber veri yormuşsun! dedi. Saîd, iki parmağı ile gözlerine ve kulaklarına işaret ederek: Şu iki gözüm görmüş ve kulaklarım Resûlüllah (sallallahü aleyhi ve sellem)'i: altınla satmayın; gümüşü de gümüşle satmayın! Ancak misli misline olursa o başka! Birini diğerinden ziyâde yapmayın! Bunlardan mevcut olmayanı mevcut olanla satmayın! Ancak peşin olarak satın!» buyururken işitmiştir; dedi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4056,
			"arabicnumber": "1584.03",
			"text": "(Bize Şeybân b. Ferrûh rivâyet etti. ki): Bize Cerîr yani İbn Hâzim rivâyet etti. H. Muhammed b. El-Müsennâ da rivâyet etti. ki): Bize Abdilvehhâb rivâyet etti. ki): Ben Yahya b. Saîd'den dinledim. H. yine Muhammed b. el-Müsennâ rivâyet etti. ki): Bize İbn Ebî Adiy, İbn Avn'dan naklen rivâyet eyledi. Bu râvilerin hepsi Nâfi'den, Leys'in Nâfi'den, onun da Ebû Saîd-i Hudrî'den, onun da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet ettiği hadîs gibi rivâyette bulundular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4057,
			"arabicnumber": "1584.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4058,
			"arabicnumber": "1585",
			"text": "Bize Ebû't-Tâhir ile Hârûn b. Saîd El-Eylî ve Ahmed b. Îsâ rivâyet ettiler. (Dediler ki): Bize İbn Vehb rivâyet etti. ki): Bana Mahrame, babasından naklen haber verdi. ki): Ben Süleyman b. Yesâr'i kendisinin Mâlik b. Ebî Âmir'e, Osman b. Affân’dan naklen Resûlüllah (sallallahü aleyhi ve sellem): dînârı iki dînara, bir dirhemi dahi iki dirheme satmayın!» buyurduğunu dinlediğini rivâyet ederken işittim. altın para, dirhem de gümüş paradır, Hadîs-i şerif hüküm i'tibâriyle yukarıki rivâyetler gibidir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4059,
			"arabicnumber": "1586.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4060,
			"arabicnumber": "1586.02",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb ve İshâk, İbn Uyeyne'den, o da Zührî'den naklen bu isnadla rivâyette bulundular. hadisi Buhârî, Ebû Dâvûd, Tirmizî, Nesai «Buyû'» bahsinde; İbn Mâce «Ticârât»da muhtelif râvilerden tahrîc etmişlerdir kelimesi med ve kasırla yani hai çekerek ve çekmiyerek iki Şekilde okunmuştur. Çekerek okunması daha meşhurdur. Bu kelimenin aslı «Hâke» olup, al şunu, manasınadır. Malı alan da aynı kelimeyi söyler. Şu halde kelimenin sonundaki hemze kâfdan bedel olarak değiştirilmiştir. Bu takdirde kelime «Hâe» ve «Hâi» şekillerinde okunabilir. yani sonuna hemze getirmeksizin kelimeyi çekmeden okuyanlara göre vezni «Hâfe» gibidir. Müfredinde «Hâ», tesniyesinde «Hâ-â», ceminde «Hâû» denilir. Bazıları bu kıraate göre kelimenin tesniye cemi ve müennes yapılamayıp, bu şekillerin her birinde «Hâ» diye okunacağını iddia etmişlerdir. Bu takdirde kelime «sus» mânâsına gelen «Sah» gibi bir ses ismi olur. Kâdî Iyâz'ın beyanına göre bu kelimede üçüncü bir kıraat daha vardır ki «Hâeke» denilir; mânâsı iki tarafın kabzı yani mallan ellerine almasıdır. şerîf ribâ malları satılırken her iki malda aynı ribâ illeti bulunursa, tekabuz yani her iki tarafın teslim alması şart olduğuna delildir. Meselâ: Altın verip altın almak isteyen kimse karşısındakine «Şunu al», o da «Ver» diyerek ikisi de almak istedikleri malı tesellüm edeceklerdir. cümlesi zarf olmak üzeri mahallen mansubtur. Müstesna minh mukadder olup: şeklinde takdir edilir. Bu şekildeki diğer cümlelerin i'rabı hep böyledir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4061,
			"arabicnumber": "1587.01",
			"text": "(Bize Ubeydullah b. Ömer el-Kavârîrî rivâyet etti. ki): Bize Hammâd b. Zeyd Eyyûb'dan, o da Ebû Kılâbe'den naklen rivâyette bulundu. Şöyle dedi: Müslim b. Yesâr'ın bulunduğu bir halkada oturuyordum. Derken Ebû'l-Eş'as geldi. Cemaat: Ebû'l-Eş'as (geliyor) Ebû'l-Eş'as dediler... Ebul-Eş'as oturdu. Ben kendisine: Ey kardeşimiz (bize) Ubâde b. Sâmit'in hadîsini naklet, dedim. Hay hay dedi (ve şunları söyledi: Bir gazaya çıktık; ordunun başında Muâviye vardı. Birçok ganimetler aldık. Aldığımız ganimetler arasında bir gümüş kap da vardı. Muâviye bu kabı halkın bağışları arasında satmasını bir adama emretti. Halk bu alış-verişe koşuştular. Derken Ubâde b. Sâmit bunu duyarak ayağa kalktı ve şunları söyledi: Resûlüllah (sallallahü aleyhi ve sellem)’i altına mukabil altın, gümüşe mukabil gümüş, buğdaya mukabil buğday, arpaya mukabil arpa, hurmaya mukabil hurma, tuza mukabil tuz satmayı yasak ederken işittim; ancak misli misline peşin olarak satılırsa o başka... Her kim ziyade verir veya alırsa muhakkak ribâ yapmıştır... üzerine halk aldıklarını geri verdiler. Bu iş Muâviye'nin kulağına vardı. Hemen hitabede bulunmak üzere ayağa kalkarak şunları söyledi: Bazı kimselere ne oluyor ki, Peygamber (sallallahü aleyhi ve sellem)'den bir takım hadisler rivâyet ediyorlar!.. Biz de onu görüyor, sohbetinde bulunuyorduk, ama bunları ondan işitmedik. Derken Ubâde kalktı ve kıssayı tekrarladı. Sonra: Muâviye hoşlanmasa da (yahut Muâviye çatlasa da) biz Resûlüllah (sallallahü aleyhi ve sellem)’den işittiklerimizi mutlaka söyleyeceğiz. Ordusunun içinde onunla bir karanlık gece (bile) beraber bulunmamak umurumda değil!.. Bunu yahut benzerini söyledi, demiştir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4062,
			"arabicnumber": "1587.02",
			"text": "Bize İshâk b. İbrahim ile İbn Ebî Ömer beraberce Abdülveh-hâb es-Sekafî'den, o da Eyyûb'dan bu isnadla bu hadîsin benzerini rivâyet ettiler",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4063,
			"arabicnumber": "1587.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4064,
			"arabicnumber": "1584.05",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe rivâyet etti. ki): Bize Vekî' rivâyet etti. ki): Bize İsmail b. Müslim el-Abdî rivâyet etti. ki): Bize Ebû'l-Mütevekkil En-Nâcî, Ebû Saîd El-Hudrî’den rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): mukabil altın, gümüşe mukabil gümüş, buğdaya mukabil buğday, arpaya mukabil arpa, hurmaya mukabil hurma, tuza mukabil tuz misli misline peşin satılır. Her kim ziyade verir veya alırsa muhakkak ribâ yapmıştır. Alanla veren bu hususta müsavidir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4065,
			"arabicnumber": "1584.06",
			"text": "(Bize Amr en-Nâkıd rivâyet etti. ki): Bize Yezîd b. Hârûn rivâyet etti. ki): Bize Süleyman er-Rab'î haber verdi. ki): Bize Ebû'l-Mütevekkil En-Nâcî, Ebû Saîd El-Hudrî'den rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): mukabil altın misli misline satılır...» buyurdular ve râvi yukarıki hadîsin, mislini rivâyet etmiştir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4066,
			"arabicnumber": "1588.01",
			"text": "Bize Ebû Küreyb Muhammed b. El-Alâ ile Vâsıl b. Abdilâ'la rivâyet ettiler. (Dediler ki): Bize İbn Fudayl, babasından, o da Ebû Zür'a'dan, o da Ebû Hüreyre'den naklen rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): mukabilinde hurma, buğday mukabilinde buğday, arpa mukabilinde arpa ve tuz mukabilinde tuz misli misline peşin satılır. Her kim ziyade verir veya alırsa, muhakkak ribâ yapmıştır. Ancak cinsleri değişirse o başka!» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4067,
			"arabicnumber": "1588.02",
			"text": "(Bana bu hadîsi Ebû Saîd el-Eşecc de -rivâyet etti. ve dedi ki): Bize el-Muhâribî, Fudayl b. Gazvân'dan bu isnâd ile rivâyette bulundu, yalnızla, » kaydını zikretmedi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4068,
			"arabicnumber": "1588.03",
			"text": "Bize Ebû Küreyb ile Vâsıl b. Abdilâ'lâ rivâyet ettiler. (Dediler ki): Bize İbn FudayI, babasından, o da İbn Ebî Nu'm'dan, o da Ebû Hüreyre'den naklen rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) ; mukabilinde altın, tartısı tartısına, misli misline; gümüş mukabilinde gümüş dahi tartısı tartısına, misli misline satılır. Her kim ziyade verir veya alırsa bu (yaptığı) ribâdır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4069,
			"arabicnumber": "1588.04",
			"text": "(Bize Abdullah b. Mesleme El-Ka'nebî rivâyet etti. ki): Bize Süleyman yani İbn Bilâl, Mûsâ b. Ebî Temîm'den, o da Said b. Yesâr'dan, o da Ebû Hüreyre'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem): dînâr mukabilinde satılır; aralarında fazlalık yoktur. Dirhem de dirhem mukabilinde satılır; aralarında fazlalık yoktur.» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4070,
			"arabicnumber": "1588.05",
			"text": "(Bize Muhammed b. Hatim b. Meymûn rivâyet etti. ki): Bize Süfyân b. Uyeyne, Amır'dan, o da Ebû'l-Minhâl'den naklen rivâyet etti. ki): Benim bir ortağım bir gümüşü mevsime (yahut hacca) kadar veresiye sattı. Müteakiben bana gelerek haber verdi. Ben: Bu caiz olmayan bir iştir; dedim. O: Ama ben bunu pazarda sattım da bana kimse caiz olmayacağını söylemedi; dedi. Ben hemen Berâ' b. Âzib'e giderek (meseleyi) sordum. Şu cevabı verdi: (sallallahü aleyhi ve sellem) Medine'ye geldiğinde biz bu ahş-verişi yapıyorduk. Bunun üzerine şöyle buyurdular: mal peşin olarak satılıyorsa onda bir beis yoktur; fakat veresiye satılan ribâdır.» (Berâ'): Sen bir de Zeyd b. Erkam'a git, zîra o benden daha büyük tacirdir; (Dedi.) Ona giderek sordum. O da bunun gibi söyledi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4071,
			"arabicnumber": "1589.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4072,
			"arabicnumber": "1589.02",
			"text": "(Bize Ubeydullah b. Muâz El-Anberî rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Şu'be, Habîb'den naklen rivâyet etti ki Habîb, Ebû'l-Minhâl'i şöyle derken işitmiş: Berâ' b. Âzib'e sarfı sordum. Zeyd b. Erkam'a sor; o benden daha iyi bilir, dedi. Bunun üzerine Zeyd'e sordum. O da: Berâ'a sor; o benden daha iyi bilir, dedi. Sonra ikisi birden: Peygamber (sallallahü aleyhi ve sellem) gümüşü altın mukabilinde veresiye satmayı yasak etti; dediler. hadîsi Buhârî «Büyü'» ve «Hicret» bahislerinde; Nesâî «Buyû'»da muhtelif râvilerden tahrîc etmişlerdir. şerif ashâb-ı kirâmın tevazu', insaf ve hakşinaslıklarına delildir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4073,
			"arabicnumber": "1590.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4074,
			"arabicnumber": "1590.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4075,
			"arabicnumber": "1591.01",
			"text": "(Bana Ebû't-Tâhir Ahmed b. Amr b. Şerh rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Ebû Hânî El-Havlânî haber verdi ki, kendisi Alî b. Babâh el-Lahmî'yi şunu söylerken işitmiş: Fadâle b. Ubeyd El-Ensârî'yi şöyle derken işittim: Resûlüllah (sallallahü aleyhi ve sellem)’e Hayber'de bulunduğu sırada içinde boncuk ve altın bulunan bir gerdanlık getirdiler. Bu gerdanlık satılık ganimet mallarındandı. Resûlüllah (sallallahü aleyhi ve sellem) emir buyurdular ve gerdanlığın içinden sâdece altını çıkarıldı. Sonra Peygamber (sallallahü aleyhi ve sellem) ashabına: mukabil altın tartısı tartısına (satılır).» buyurdu",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4076,
			"arabicnumber": "1591.02",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Leys, Ebû Şucâ' Saîd b. Yezîd'den, o da Halid b. Ebî İmi ân'dan, o da Haneş Es-San'ânî'den, o da Fadâle b. Ubeyd’den naklen rivâyet etti. Fadâle şöyle dedi: gazası günü on iki dinara, içinde boncuk ve altın bulunan bir gerdanlık satın aldım; ve bunun boncuğunu, altınını ayırarak on iki dinardan daha fazla kıymeti olduğunu anladım. Müteakiben bunu Resûlüllah (sallallahü aleyhi ve sellem)’e anlattığımda: ayırmadan satılmaz.» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4077,
			"arabicnumber": "1591.03",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Ebû Küreyb rivâyet ettiler. (Dediler ki): Bize İbn Mübarek, Saîd b. Yezid'den bu isnâdla bu hadisin benzerini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4078,
			"arabicnumber": "1591.04",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Leys, İbn Ebî Ca'fer'den, o da Cülâh Ebû Kesîr'den naklen rivâyet etti. ki): Bana Haneş es-San'ânî, Fadâle b. Ubeyd'den, rivâyet etti. Şöyle dedi: gazası günü Resûlüllah (sallallahü aleyhi ve sellem) ile beraber bulunuyor; yahudîlerden bir okıyye altını iki-üç dinara satın alıyorduk. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): mukabilinde altını ancak tartısı tartısına satın!» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4079,
			"arabicnumber": "1591.05",
			"text": "(Bana Ebû't-Tâhir rivâyet etti. ki): Bize İbn Vehb, Kurre b. Abdirrahman El-Ma'âfirî ile Amr b. El-Hâris ve başkalarından naklen haber verdi; onlara da Âmir b. Yahya El-Ma'âfirî, Haneş'den naklen haber vermiş ki, Haneş Şöyle dedi: gazada Fadâle b. Ubeyd ile beraber bulunuyorduk. Derken bana ve arkadaşlarıma içinde altın, gümüş ve cevher bulunan bir gerdanlık isabet etti. Ben bunu satm almak isteyerek Fadâle b. Ubeyd'e sordum. Şu cevabı verdi: Bunun altınını çıkar da bir kefeye koy, kendi altınını da bir kefeye koy. Sonra sakın misli mislinden fazla bir şey alma! Zira ben Resûlüllah (sallallahü aleyhi ve sellem)'i: kim Allah'a ve âhiret gününe îmân ediyorsa sakın misti mislinden fazla bir şey almasın!» buyururken işittim. Müslim'in mu'temed nüshalarında gerdanlık ifadesiyle beyân olunmuştur. Birçok nüshalarda ise denilmiştir. Hatta Kâdî Iyâz ekseri üstadlannin nüshalarında bu şekilde zikredildiğini, fakat Ebû Alî El-Gasiânî'nin arkadaşında bu ifadenin kitabımızdaki şekilde tashih edilmiş gördüğünü, doğrusunun da bu olduğunu söyler. Fadâle (radıyallahü anh) hadîsiyle istidlal ederek: Başka bir şeyle karışık olan altın, gümüş az olsun çok olsun ayrılmadıkça satılamaz; ayrıldıkta altın tartısı tartısına yani kendi ağırlığınca; gümüş dahi aynı şekilde satılır; buğday ve tuz gibi sair ribâ mallarının hükmü de budur; derler. Bu kavil ashâb-ı kirâmdan Hazret-i Ömer (radıyallahü anh) ile oğlundan nakledilmiştir. Selef ulemâsından bir cemaat ile İmâm Ahmed, İshâk ve Mâlikîler'den Muhammed b. El-Hakem'in mezhepleri budur. A'zam'a göre başka madenle karışık bulunan altım, miktarca ondan daha fazla altın mukabilinde satmak caizdir. Bu'fazlalık altınla karışık bulunan diğer maden veya taşa mukabil verilir. Satılan karışık altınla safî altın birbirlerine müsâvî olursa akid caiz değildir. Safî altın karışıktan az olduğu takdirde dahi hüküm budur. Sevrî ile Hasen b. Salih bu meselede İmâm A'zam'la beraberdirler. diğer bir takım ulema karışık altın üçte bir veya daha az nisbette olmak şartiyle hâlis altın mukabilinde satılabilir; bu tekdirde satılan madendeki karışık altın o madene tâbi' olur; derler. Mâlikîler'den Hammâd b. Ebî Süleyman: «Karışık altını safî altın mukabilinde mutlak surette satmak caizdir; safî altının az veya çok yahut karışık olana müsavi olması hükmen müsavidir.» demiş ise de bu kavil hadîsin sarahati karşısında hatâ sayılmıştır",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4080,
			"arabicnumber": "1592",
			"text": "(Bize Hârûn b. Ma'rûf rivâyet etti. ki): Bize Abdullah b. Vehb rivâyet etti. ki): Bana Amr haber verdi. H Ebû't-Tâhir de rivâyet etti. ki) ; Bize İbn Vehb Amr b. Hâris'den naklen haber verdi. Ona da Ebû'n-Nadr, ona da Büsr b. Saîd, Ma'mer b. Abdillah'dan naklen rivâyet etmiş ki, Ma'mer uşağını bir ölçek buğdayla (pazara) göndererek: Bunu sat da arpa al, demiş, Uşak gitmiş bir ölçek ve biraz da ziyade zahire almış. Ma'mer'e geldiğinde bunu ona haber vermiş. Ma'mer kendisine: Bunu neye yaptın? Git bu zahireyi iade et! Sakın mislinden fazla bir şey alma! Zîra ben Resûlüllah (sallallahü aleyhi ve sellem)’i: mukabil zahire misli misline satılır.» buyururken işitirdim. O gün bizim zahiremiz arpa idi; demiş. Kendisine: Ama bu (arpa) o buğdayın misli değildir, demişler. benzemesinden korkarım.» cevâbını vermiş. Yudâriu: Benzer ve müşterek olur manasınadır. Buradaki benzeyişten murâd: îkisi bir cins sayılarak faiz hükmüne girmeleridir. Mâlik bu hadîsle istidlal ederek buğdayla arpayı bir cins saymıştır. Ona göre biri fazla olmak üzere buğdayla arpa birbiri mukabilinde satılamaz. Cumhûra göre ise buğdayla arpa ayrı ayrı iki cinstirler. Resûlüllah (sallallahü aleyhi ve sellem): muhtelif olunca nasıl isterseniz öyle satın!»- buyurmuşlardır. Zaten Ma'mer (radıyallahü anh) hadîsinde buğdayla arpanın bir cins sayıldığına dair sarahat yoktur. Hazret-i Ma'mer takvasından dolayı ihtiyat göstermiştir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4081,
			"arabicnumber": "1593.01",
			"text": "(Bize Abdullah b. Mesleme b. Ka'neb rivâyet etti. ki): Bize Süleyman yani İbn Bilâl Abdülmecîd b. Süheyl b. Abdirrahman'dan naklen rivâyet eti. O da Saîd b. El-MÜseyyeb'i, Ebû Hüreyre ile Ebû Saîd'den naklen rivâyet ederken dinlemiş ki, Resûlüllah (sallallahü aleyhi ve sellem) Benî Adiy El-Ensari'nin kardeşini Hayber'e Vali göndermiş. O zât (oradan) a'lâ hurma getirmiş. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) ona: butun hurmaları böyle midir?» diye sormuşlar. Hayır! Vallahi yâ Resûlallah! Biz bunun bir ölçeğini bayağı hurmanın iki ölçeği ile satın alıyoruz; demiş. (sallallahü aleyhi ve sellem): yapmayın! Ve lâkin misli misline alın! Yahut bunu satın; karşılığı İle ötekinden alın! Tartı da böyledir!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4082,
			"arabicnumber": "1593.02",
			"text": "(Bize Yahya b. Yahya rivâyet etti, ki): Mâlik'e, Ab-. dülmecîd b. Süheyl b. Abdirrahman b. Avf'dan dinlediğim, onun da Saîd b. El-Müseyyeb'den, onun da Ebû Saîd El-Hudrî ile Ebû Hüreyre'den naklen rivâyet ettiği şu hadîsi okudum: Resûlüllah (sallallahü aleyhi ve sellem) bir zâtı Hayber'e vâlî göndermiş; o da kendilerine a'lâ cinsten hurma getirmiş. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): butun hurmaları böyle midir?» diye sormuşlar. O zât: Hayır, vallahi yâ Resûlallah! Biz bunun bir ölçeğini iki ölçeğe; iki ölçeği' ni üç ölçeğe alıyoruz, cevâbını vermiş. Resûlüllah (sallallahü aleyhi ve sellem): yapma! Bayağı hurmayı para ile sat; sonra bu para ile a'lâ hurma satın al!» buyurmuşlar. hadîsi Buhârî «Büyü'», «Vekâle», «Megâzî» ve «İ'tisâm» bahislerinde, Nesâî «Buyû'»da muhtelif râvilerden tahrıc etmişlerdir. (sallallahü aleyhi ve sellem)’in Hayber'e gönderdiği zatın ismi bir kavle göre Sevâd b. Gaziyye olup Ensardandır. Başka bir kavle göre ise Mâlik b. Sa'sa'a'dır. Bu zât Hazrec kabilesine mensuptur. îyi cins bir hurmadır. Bazıları: Katı hurmadır; demiş; bir takımları, kötüsü ayıklanmış hurma mânâsına geldiğini söylemişlerdir. «Bu hurma Araplarca malûm olandan başka garîb bir hurmadır.» diyor. Hülâsa, Arapların en güzel hurması bu imiş. Her nevi hurmadır; ismi belli değildir. Bazıları: Muhtelif hurmaların karıştırılmasından meydana gelen bayağı hurmadır; buna rağbet yoktur; zaten bayağı olduğu için karıştırılır; demişlerdir. Resûlüllah (sallallahü aleyhi ve sellem)’in o zâta bayağı hurmayı para ile satmasını, sonra o para ile iyi hurma almasını emir buyurması araya iki tane pazarlık girsin de işe ribâ karışmasın diyedîr",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4083,
			"arabicnumber": "1594.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4084,
			"arabicnumber": "1594.02",
			"text": "(Bize Seleme b. Şebîb rivâyet etti. ki): Bize El-Hasen b. A'yen rivâyet etti. ki): Bize Ma'kıl, Ebû Kazeat'el-Bâhilî’den, o da Ebû Nadra'dan, o da Ebû Saîd'den naklen rivâyette bulundu. Ebû Saîd Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem)'e hurma getirdiler: «Bu hurma bizim hurmamızdan değil!» dedi. Bunun üzerine (getiren) adam: Yâ Resûlallah! Biz kendi hurmamızın iki ölçeğini bunun bir ölçeği mukabilinde sattık; dedi. Resûlüllah (sallallahü aleyhi ve sellem) ribâ budur; onu hemen iade edin! Sonra bizim hurmayı satıp onun parasından bize (hurma) satın alın!» buyurdular. hadîsi Buhârî «Vekâle» bahsinde; Nesai «Buyû'»da tahrîc etmişlerdir. hurması: Bir nevi ufak ve yuvarlak hurmadır; hurma nevi'-lerinin en iyisi sayılır. kelimesi hüzün ve şikâyet bildirir; Türkçede bunun karşılığı evyah'dır. Bu kelime «evvahan, evhin, evhi» ve «evin» şekillerinde okunabilir. Resûlüllah (sallallahü aleyhi ve sellem)’in onu burada kullanması ya bu işten elem duyduğu için yahut Bilâl (radıyallahü anh) ribâ işini iyi anlamamış diyedir. şeriften murâd: tki Ölçek bayağı hurma vererek bir ölçek iyi hurma almanın ribâ olmasıdır. Ayrıca ribânın haram olduğuna da delildir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4085,
			"arabicnumber": "1595",
			"text": "(Bana İshâk b. Mansûr rivâyet etti. ki): Bize Ubeydullah b. Mûsa, Seyhan'dan, o da Yahya'dan, o da Ebû Seleme'den, o da Ebû Saîd'den naklen rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) devrinde bayağı hurmayı —ki muhtelif kuru hurmanın karışığıdır— bir ölçek mukabilinde iki Ölçek vererek satardık. Resûlüllah (sallallahü aleyhi ve sellem) bunu duydu ve: ölçek hurmaya bir ölçek hurma; iki Ölçek buğdaya bir ölçek buğday ve iki dirheme bir dirhem olmaz!» buyurdular. hadîsi Buhârî «Büyü'» bahsinde tahrîc etmiştir. ölçek hurmaya bir ölçek hurma olmaz ilâh...» cümlesinden mu-râd: iki ölçek hurma vererek bir ölçek hurma almak haramdır; demektir. Arapların «cem'» dedikleri bayağı hurma elli çeşit hurmanın bir araya getirilmesinden meydana gelirmiş. Bununla beraber yine de hurma cinsi olmaktan çıkmadığı için Peygamber (sallallahü aleyhi ve sellem) bunda fark gözeterek fazlalıklı satış yapmayı yasak etmiştir; çünkü fazlalık ribâ olur. «Onu hemen iade edin» cümlesi fâsid satışla alınan bir malın iadesi vacib olduğuna delildir. mallarından olan dirhemin yani gümüşün hükmü de böyledir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4086,
			"arabicnumber": "1594.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4087,
			"arabicnumber": "1594.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4088,
			"arabicnumber": "1596.01",
			"text": "(Bana Muhammed b. Abbâd ile Muhammed b. Hatim ve İbn Ebî Ömer hep birden Süfyân b. Uyeyne'den rivâyet ettiler. Lâfız İbn Abbâd'ındır. ki): Bize Süfyân, Amr'dan, o da Ebû Salih’den naklen rivâyet etti. Ebû Salih şunları söylemiş: Ebû Saîd El-Hudrî'yİ: Dinar mukabilinde dînâr; dirhem mukabilinde dirhem misli misline satılır. Kim fazla verir veya alırsa muhakkak ribâ yapmıştır; derken işittim de \"kendisine: Ama İbn Abbâs böyle söylemiyor; dedim. Bunun üzerine: Ben İbn Abbâs'la görüştüm; ve: Söylediğin lâfı gördün mü? Bu senin Resûlüllah (sallallahü aleyhi ve sellem), ûen işittiğin bir şey midir, yoksa bunu Allah (azze ve celle)'nin kitabında mı buldun? diye sordum. Bunu ne Resûlüllah (sallallahü aleyhi ve sellem)'den işittim; ne de Allah'ın kitabında buldum. Lâkin bana Üsâme b. Zeyd rivâyet etti, ki Peygamber (sallallahü aleyhi ve sellem): nesîededir.» buyurmuşlar, cevabını verdi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4089,
			"arabicnumber": "1596.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Amr en-Nâkıd, Ishak b. İbrahim ve İbn Ebî Ömer rivâyet ettiler. Lâfız Amr'mdır. İshâk: Bize haber verdi, tâbirini kullandı. Ötekiler şöyle dediler: Bize Süfyân b. Uyeyne, Ubeydullah b. Ebî Yezîd'den naklen rivâyet etti ki, İbn Abbâs'ı şunları söylerken işitmiş. Bana Üsâme b. Zeyd haber verdi ki, Peygamber (sallallahü aleyhi ve sellem): ancak nesîededir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4090,
			"arabicnumber": "1596.03",
			"text": "(Bize Züheyr b. Harb rivâyet etti. ki): Bize Affan rivâyet etti. H. Muhammed b. Hatim de rivâyet etti. ki): Bize Behz rivâyet etti. Her iki râvi demişler ki: Bize İbn Tâvûs, babasından, o da İlmi Abbâs'dan, o da Üsâme b. Zeyd'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem): olan şeyde ribâ yoktur.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4091,
			"arabicnumber": "1596.04",
			"text": "(Bize El-Hakem b. Mûsâ rivâyet etti. ki): Bize Hikl, Evzâî'den rivâyet etti. ki): Bana Ata' b. Ebî Rab âh rivâyet etti ki, Ebû Saîd El-Hudrî İbn Abbâs'a rast gelerek kendisine: Sarf hakkındaki sözünü gördün mü! Bunu Resûlüllah (sallallahü aleyhi ve sellem)’den işittiğin bir şey olarak mı, yoksa Allah (azze ve celle)’nin kitabında bulduğun bir şey olarak mı söyledin? diye sormuş. İbn Abbâs: Asla söylemem! Bir kere Resûllüllah (sallallahü aleyhi ve sellem)'i siz benden daha İyi bilirsiniz; Kitâbullaha gelince: Onu da bilmiyorum. Yalnız bana Üsâme b. Zeyd rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem): Ribâ ancak nesîededir.» buyurmuşlar; cevabını vermiş. hadîsi Buhârî, Nesâî ve İbn Mâce «Büyü1» bahsinde muhtelif râvilerden tahrîc etmişlerdir. bundan evvel sözü geçen Üsâme hadîsi budur. Bu hadîse dair ulemânın beyanâtının ekserisi orada görüldü. Hazret-i İbn Abbâs (radıyallahü anh)'in: (sallallahü aleyhi ve sellem)'i siz benden iyi bilirsiniz...» sözünden muradı: Onun sohbetinde bulunduğunuz vakit siz yetişkin adamlardınız; ben henüz küçük çocuktum; demektir. Kitâbullahı bilmemesi de Kur'ân-i Kerîm'de o meselenin hükmünü bilmiyormuş manasınadır; yoksa onun hiç bir hükmünü bilmem demek değildir; çünkü kendisi Kur'ân-ı Kerîm'i en güzel tefsir eden ve Sul-tânu'l-Müfessirîn unvanına bihakkın lâyık olan sahâbî-i celîldir. Ulemâ Üsâme (radıyallahü anh) hadîsinin sahih olduğuna ittifak etmişlerdir. İhtilâf ettikleri cihet bu hadîsle yukarıda geçen Ebû Saîd (radıyallahü anh) hadîsinin aralarını bulmak hususudur ki, onu da Ebû Saîd hadîsinin izahı sırasında gördük, Hattâbî (319-388) diyor ki: «Hazret-i Üsâme'nin naklettiği ancak nesîededir.) hadîsi Resûlüllah (sallallahü aleyhi ve sellem)'in bu bâbtaki beyanâtın son cümlesini işitip bellediğine hamledilir. Hadîsin baş tarafına yetişememiştir. Herhalde Peygamber (sallallahü aleyhi ve sellem)'e ribâ mallarından iki cinsin ziyâdeli olarak satışı sorulmuş; o da: cinsler ayrı olursa ziyâdeli satış peşin olmak şartiyle caizdir; ribâ ancak veresiye satılırsa o zaman bu işe dâhil olur; buyurmuşlardır.»",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4092,
			"arabicnumber": "1597",
			"text": "Bize Osman b. Ebî Şeybe ile İshâk b. İbrahim rivâyet ettiler. Lâfız Osman'ındır. İshâk (Bize haber verdi) tâbirini kullandı. Osman: Bize Cerîr, Muğîre'den naklen rivâyet etti; dedi. Muğîre şunu söylemiş: Şibâk, İbrahim'e sordu da İbrahim, Alkame'den, o da Abdullah’dan naklen rivâyette bulundu. ki): (sallallahü aleyhi ve sellem) ribâyı yiyene de, yedirene de lanet buyurdu. Râvi diyor ki: Ben, kâtibine de, şahidlerine de (lanet etmedi) mi? dedim. (Abdullah): Biz ancak İşittiğimizi söyleriz; cevabını verdi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4093,
			"arabicnumber": "1598",
			"text": "Bize Muhammed b. Es-Sabbâh ile Züheyr b. Harb ve Osman b. Ebî Şeybe rivâyet ettiler. (Dediler ki): Bize Hüşeym rivâyet etti. ki): Bize Ebû'z-Züheyr, Câbir'den naklen haber verdi. Câbir Şöyle dedi: (sallallahü aleyhi ve sellem): Ribâyi yiyene, yedirene, kâtibine ve şahidlerine lanet etti ve: «Onlar müsavidirler.» buyurdu. iki rivâyet ribâ yemenin, yedirmenin, ribâ muamelesi yapanlar arasında kâtiplik ve şahidlik yapmanın haram olduğuna açık delildirler. İmâm A'zam'la İmâm Muhammed'e göre dâr-ı harpde yaşayan bir harbî yani o memleket teb'asından bir gayri müslim ile müslüman arasında ribâ muamelesi caizdir. Kumar dahi aynı hükümdedir. İmâm Ebû Yûsuf bunları tecviz etmemiştir. şerif bâtıla yardımın haram olduğuna da delildir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4094,
			"arabicnumber": "1599.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4095,
			"arabicnumber": "1599.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Vekî' rivâyet eyledi. H. İshâk b. İbrahim dahi rivâyet etti. ki): Bize Îsâ b. Yûnus haber verdi. Her iki râvi: Bize. bu isnâdla bu hadîsin mislini Zeke-rîyyây rivâyet etti, demişlerdir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4096,
			"arabicnumber": "1599.03",
			"text": "(Bize İshâk b. İbrahim de rivâyet etti. ki): Bize Cerîr, Mutarrif'le Ebû Ferva El-Hemdânî'den naklen haber verdi. H. Kuteybe b. Said dahi rivâyet etti. ki): Bize Ya'kûb yani İbn Abdirrahmân El-Kaarî, İbn Aclân'dan, o da Abdurrahman b. Said’den naklen rivâyette bulundu. Bu râvilerin hepsi Şa'bî'den, o da Nu'-mân b. Beşîr'den, o da Peygamber (sallallahü aleyhi ve sellem)’den bu hadîsi rivâyet etmişlerdir. Şu kadar var ki, Zekeriyya'nın hadîsi onların rivâyetinden daha tamam ve daha uzundur",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4097,
			"arabicnumber": "1599.04",
			"text": "(Bize Abdühnelik b. Şüayb b. Leys b. Sa'd rivâyet etti.'Dedi ki): Bana babam, dedemden rivâyet etti. ki): Bana Hâlid b. Yezîd rivâyet etti. ki): Bana Saîd b. Ebî Hilâl, Avn b. Abdillah'dan, o da Âmir Eş-Şa'bî'den naklen rivâyette bulundu, ki Şa'bî' Resûlüllah (sallallahü aleyhi ve sellem)'in sahabisi Nu'mân b. Beşîr b. Sa'd'ı Hıms'da halka hutbe îrâd ettiği sırada şunları söylerken işitmiş: Ben Resülullah (sallallahü aleyhi ve sellem): aşikâr, haram da aşikârdır. .» buyururken işittim... Müteakiben Zekeriyya'nın Şa'bî'den rivâyet ettiği hadîs gibi tâ «İçine düşmesi yakıncacıktır...» cümlesine kadar rivâyette bulunmuştur. hadîsi Buhârî «îmân» ve «Büyü'» bahislerinde; Ebû Dâvûd, Tirmizî ve Nesâî «Büyu'»da; İbn, Mâce «Fiten» bahsinde muhtelif râvilerden tahrîc etmişlerdir. kelimelerin îzâhı: Müştebihât, şüpheli şeyler demektir. Bu kelime beş şekilde rivâyet olunmuştur: Müştebihât, müteşebbihât, müşebbehât, müşebbihât ve müşbihât. Bunlardan birinci ile ikincinin mânâları müşkilât demektir. Zira birbirine zıd olan iki tarafa da benzer mânâsmadırlar. Yalnız ikinci rivâyette tekellüf vardır. Üçüncü rivâyetin mânâsı hükmü yakînen bilinmeyen şeylere benzeyen demektir. Dördüncü ve beşinci rivâyetler: Kendini helâle benzeten mânâsına gelirler. Ebû'l-Abbâs'ın beyânına göre, insanın medih ve zemm yeri demektir. Meselâ: Birisi birinin ırzından bahsetti denirse bunun mânâsı o kimseyi yükselten veya düşüren husûsatını söylemiş demektir. Bu sebeple de ya medholunur ya zemm. Korunan yer mânâsına gelen bir isimdir. bu hadîsin İslâm'da pek büyük bir mevkii olduğuna ittifak etmişlerdir. Bâzılarına göre İslâm'ın üç temel hadîsinden biridir. Diğer ikisi: «Ameller niyetlere göredir.» mânâsına gelen « hadîsiyle: işine girmeyen şeylere karışmaması iyi müslüman olduğundandır.» mânâsına gelen hadîs-i şerifidir. Dâvûd'a göre İslâmiyet dört temel hadîs etrafında devreder. Bunların üçü saydıklarımız; dördüncüsü de: biriniz kendisi için sevdiğini dîn kardeşi işin de sevmedikçe (tam) îmân etmiş sayılamaz.» mealindeki hadîs-i şerifidir. beyanına göre bu hadîsin yüksek mertebede olmasına sebep ; Peygamber (sallallahü aleyhi ve sellem)’in bunda yiyecek, içecek, giyecek gibi şeylere, nikâh ve sâireye tenbîh buyurmuş olması ve bunların helâlden olmasına dikkati çekmesi; helâlin nasıl bilineceğine irşâd buyurması; şüpheli şeyleri terk etmeye teşvik etmesidir. Resûlüllah (sallallahü aleyhi ve sellem) bunları korunan bir yeri misal alarak izah etmiş; sonra dikkati gereken en mühim noktaya temas ile bunun kalb olduğunu bildirmiştir. (468-543); «Bütün hükümleri yalnız bu hadîsten çıkarmak mümkündür.» demiş; bu sözü îzâh eden Kurtubi de: «Çünkü bu hadîs, helâl, haram ve sair hükümlere; bütün amellerin kalbe bağlı olduğuna tafsüâtiyle şâmildir; işte bu cihetle bütün ahkâmın ona ircaî mümkün olur.» şeklinde mütalâada bulunmuştur. aşikârdır...» cümlesinden nıurâd: deliline bakarak helâlin hükmü beyan' edilmiştir demektir. Haram meselesi de öyledir; yalnız bu iki nev'in delilleri arasında kalmış bir takım şüpheli şeyler vardır ki, bun lar hakkında hangi tarafın delili tercih edileceğini kestirmek güçtür; bunu ulemanın pek azı yapabilmiştir. «631-676» bu cümleyi şöyle îzâh ediyor: «Eşya helâl, haram ve şüpheli şeyler olmak üzere üç kısımdır. Helâlin hükmü mpv-dandadır; gizli bir tarafı yoktur; ekmek ve meyve yemek, konuşmak, yürümek ve saire bu kabildendir. Haramın hükmü de açıktır; içki içmek, kan dökmek, zina etmek, yalan söylemek ve saire gibi. şeylere gelince: Bunlardan murâd: Helâl veya haram olduğu açık açık belli olmayan şeylerdir. Bundan dolayıdır ki, bunların hükmünü çok kimseler bilmez. Fakat ulemâ yâ nasla, ya kıyâs ve istishâb gibi bir delille bunları bilirler. Bir şey helâl ile haram arasında tereddütte kalır da hakkında nass veya icmâ' bulunmazsa o mesele hakkında müctehid ictihad eder; ve onu şer'î bir delille helâl ve haramdan birine katar. Bundan sonra o şey helâl veya haram hükmünü alır. Bâzan meselenin delili de ictihaddan hâlî kalmaz; bu takdirde vera' ve takva o şeyi yapmamayı gerektirir. mesele hakkında müctehid hiç bir karara varamazsa ne hüküm verilir? Iyâz’ın usûlü fıkıh ulemâsından naklettiğine göre bu hususta üç mezhep vardır. Bunlardan birinci mezhebe göre o meseleye helâl; ikinciye göre haram hükmü verilir. Üçüncüye göre tevakkuf olunur; yani hiç bir hüküm verilemeyip durulur...» şârihi Aynî bu ihtilâfın meşhur ilmî kelâm meselesine yani şeriat gelmezden önce eşyanın hükmü meselesine ait olduğunu söylüyor. Bu hususta dört mezhep vardır:",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4098,
			"arabicnumber": "715.13",
			"text": "(Bize Muhammed b. Abdillâh b. Nümeyr rivâyet etti. ki): Bize babam rivâyet etti, ki): Bize Zekeriyyâ, Âmir’den rivâyet etti. ki): Bana Câbir b. Abdillâh rivâyet etti ki: Kendisi hastalanmış bir devesinin üzerinde gidiyormuş; derken deveyi başı boş bırakmak istemiş. Câbir diyor ki: bana Peygamber (sallallahü aleyhi ve sellem) yetişti; ve benim için dua ederek hayvana vurdu. Bunu müteâkıb deve öyle yürüdü ki (o ana kadar) böyle yürüdüğü olmamıştı. bana bir okıyyeye sat!» buyurdular. Olmaz, dedim. Sonra: «Sat onu bana!» buyurdu. Ben de bir okıyyeye sattım; ama üzerindeki yükü evime götürmeyi istisna ettim. Yükü götürdüğümde deveyi kendilerine getirdim. Bana parasını saydılar. Sonra döndüm. Hemen arkamdan birini göndererek: deveni alayım diye sana fiyat kırdım mı dersin? Dirhemlerinle birlikte deveni de al! O senindir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4099,
			"arabicnumber": "715.14",
			"text": "(Bize bu hadîsi Aliy b. Haşrem de rivâyet etti. ki): Bize Îsâ yani İbn Yûnus, Zekeriyyâ'dan, o da Âmir'den naklen haber verdi. Âmir; Bana Câbir b. AbdİHâh İbn Nümeyr hadîsi gibi rivâyet etti, demiş",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4100,
			"arabicnumber": "715.15",
			"text": "Bize Osman b. Ebî Şeybe ile İshâk b. İbrahim rivâyet ettiler. Lâfız Osman'ındır, (İshâk: Bize haber verdi; tâbirini kullandı.) Osman: Bize Cerîr, Mugîre'den, o da Şa'bî'den, o da Câbir b. Abdillâh'dan naklen rivâyette bulundu, dedi. Câbir Şöyle dedi: (sallallahü aleyhi ve sellem)'le birlikte gazada bulundum. Altımda nerdeyse yürüyemez hâle gelmiş hasta bir sucu devem olduğu halde bana yetiştiler; ve bana: ne oldu?» diye sordular. Hastadır; dedim. Bunun üzerine Re- (sallallahü aleyhi ve sellem) ilerleyerek hayvanı sürdü ve ona dua etti. Bundan sonra hayvan bütün develerin önünde gitmeye başladı. Resûlüllah (sallallahü aleyhi ve sellem) bana: nasıl görüyorsun?» diye sordu. Afiyette (görüyorum), ona senin bereketin isabet etti; dedim. bana satar mısın?» buyurdu. Ben utandım. Ondan başka su taşıyan devemiz yoktu. Ama: Evet, dedim; ve Medine'ye varıncaya kadar sırtı benim olmak şartiyle deveyi kendilerine sattım. Ona: Yâ Resûlallah, ben damadım; diyerek kendilerinden izin istedim. Bana izin verdiler. Bunun Üzerine Medine'ye müteveccihen oradan ilerledim. Nihayet Medine'ye vardım. Beni dayım (Cedd b. Kays) karşıladı ve deveyi sordu. Onun hakkında ne yaptığımı kendisine haber verince beni ayıpladı. (sallallahü aleyhi ve sellem), kendisinden izin istediğim vakit: aldın, bakire mi, dul mu?» diye sormuştu. Ben kendilerine dul aldım; cevâbını verdim. oynaşacağınız bir bakire ile evfense idin ya!» buyurdu. Yâ Resûlallahî Babam vefat etti (yahut şehîd oldu). Küçük küçük kız kardeşlerim var. Onların emsaliyle evlenip de (karımın) onları terbiye edemiyeceğinden, onlara bakamayacağından korktum da onlara baksın ve terbiye etsin diye dul ile evlendim, dedim. ; (sallallahü aleyhi ve sellem) Medine'ye gelince deveyi kendilerine götürdüm. Bana parasını verdiler, deveyi de iade buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4101,
			"arabicnumber": "715.16",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4102,
			"arabicnumber": "715.17",
			"text": "(Bize Ebû Kâmil El-Cahderî rivâyet etti. ki): Bize Abdülvâhid b. Ziyâd rivâyet etti. ki): Bize Cüreyrî, Ebû Nadra’dan, o da Câbir b. Abdillâh'dan naklen rivâyet etti. Şöyle dedi: Bir seferde Peygamber (sallallahü aleyhi ve sellem)'e beraber bulunuyorduk. Derken benim devem geri kaldı... hadîsi hikâye etmiş. Bu hadîste şunu da söylemiştir: Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) onu dürttü. Sonra bana: ile bin!» buyurdular. Şunu da ziyâde etmiştir: Durmadan bana ziyâde ediyor ve: «Allah seni mağfiret buyursun!» diyordu",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4103,
			"arabicnumber": "715.18",
			"text": "(Bana Ebû'r-Rabî' El-Atekî de rivâyet etti. ki): Bize Hammâd rivâyet etti. ki): Bize Eyyûb, Ebû'z-Zübeyr'den, o da Câbir'den naklen rivâyette bulundu. Câbir Şöyle dedi: Vaktaki Peygamber (sallallahü aleyhi ve sellem) yanıma geldi, devem de hastalanmıştı. Onu dürttü. Deve sıçrayıverdi. Bundan sonra artık Resûl-ü Ekrem'in sözünü işiteyim diye dizginini kasıyor, fakat onu durduramıyordum. Nihayet Resûlüllah (sallallahü aleyhi ve sellem) bana yetişti; ve; bana sat!» dedi. Ben de deveyi ona beş okıyyeye sattım. Ama: «Medine'ye kadar sırtı benim olmak şartiyle!» dedim. kadar sırtı senin olsun!» buyurdular. Medine'ye geldiğimde deveyi ona getirdim. Bana bir okıyye ziyade verdi. Sonra deveyi bana hibe etti",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4104,
			"arabicnumber": "715.19",
			"text": "(Bize Ukbe b. Mükrem El-Anı mî rivâyet etti. ki): Bize Ya'kûb b. İshâk rivâyet etti. ki): Bize Beşir b. Ukbe, Ebû'l-Mütevekkil en-Nâcî'den, o da Câbir b. Abdillâh'dan naklen rivâyet etti. Câbir: Resûlüllah (sallallahü aleyhi ve sellem)’le birlikte seferlerinin birinde (zannederim gâfcî olarak dedi) yola çıktını... diyerek hadîsi nakletti. Bu hadîste şunu da ziyade eyledi. Efendimiz: Câbir! Parayı tastamam aldın mı?» dedi. Ben, evet, cevâbını verdim. da senin, deve de senin olsun! Para da senin, deve de senin olsun!» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4105,
			"arabicnumber": "715.20",
			"text": "(Bize Ubeydullah b. Muâz El-Anberî rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Şu'be, Muhârib'den naklen rivâyette bulundu ki, kendisi Câbir b. Abdillâh'ı şunları söylerken dinlemiş: (sallallahü aleyhi ve sellem) benden iki okıyye bir dirheme yahut iki okıyye iki dirheme bir deve satın aldı. Sırar'a geldiğinde bir inek kesilmesini emir buyurdular. İnek kesildi ve cemaat ondan yediler. Medine'ye teşriflerinde mescide gelerek iki rek'at namaz kılmamı emir buyurdu; ve devenin kıymetini fazlasiyle tartıp verdi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4106,
			"arabicnumber": "715.21",
			"text": "(Bana Yahya b. Habîb El-Hârisî rivâyet etti. ki): Bize Hâlid b. El-Hâris rivâyet etti. ki): Bize Şu'be rivâyet etti. ki): Bize Muhârib, Câbir'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen bu kıssayı haber verdi. Şu kadar var ki: benden adını koyduğu bir para ile satın aldı.» dedi; iki okıyye bir dirhem veya iki dirhemi zikretmedi. Bir de: inek kesilmesini emir buyurdu. İnek kesildi; sonra etini taksim etti.» dedi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4107,
			"arabicnumber": "715.22",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4108,
			"arabicnumber": "1600.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4109,
			"arabicnumber": "1600.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4110,
			"arabicnumber": "1601.01",
			"text": "(Bize Muhammed b. Beşşâr b. Osman El-Abdiy rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be, Seleme b. Küheyl'den, o da Ebû Seleme'den, o da Ebû Hüreyre’den naklen rivâyette bulundu. Şöyle dedi: adamın Resûlüllah (sallallahü aleyhi ve sellem)'de alacağı vardı. Bu sebeple ona ağır lâkırdı söyledi. Derken Peygamber (sallallahü aleyhi ve sellem)’hı ashabı onu paylamak istediler. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) i sahibinin gerçekten konuşma hakkı vardır.» diyerek onlara: adam için bir baş deve satın alın da kendisine verin!» buyurdu. Biz ancak onun devesinden daha a'lâsını buluyoruz; dediler. ise onu satın alın da kendisine verin; zira sizin en hayırlılarınızdan biriniz (yahut sizin en hayırlınız) borcu hususunda en iyi olanınızdır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4111,
			"arabicnumber": "1601.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4112,
			"arabicnumber": "1601.03",
			"text": "(Bize Muhammed b. Abdillâh b. Nümeyr rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Süfyân, Seleme b. Küheyl'den, o da Ebû Seleme'den, o da Ebû Hüreyre'den naklen rivâyette bulundu. Şöyle dedi: adam Resûlüllah (sallallahü aleyhi ve sellem)'den alacaklı olduğu bir deveyi istemeğe geldi de: kendi devesinden daha üstün bir baş deve verin!» buyurdu. Bir de: en hayırlınız, borç ödeme hususunda en iyi olanmizdır.» buyurdular. mânâda olan bu hadîslerden Ebû Hüreyre (radıyallahü anh) rivâyetini Buhârî «Vekâle» ve «İstikraz» bahislerinde; Nesâî «Buyû'»da; İbn Mâce «Ahkâm»da muhtelif râvilerden tahrîc etmişlerdir. Zâtü's-sinn yani muayyen bir yaş sahibi mânâsına gelir. Lügat kitaplarında devenin on yaşma kadar her yaşta ayrı isim taşıdığı zikredilir. Ebû Dâvûd bunları «Sünen»inde şöyle sıralamıştır: Huvar: Süt emen yavru deve; Fasîl: Memeden ayrılmış deve yavrusu; İbn mehâd: İki yaşına girmiş erkek yavru; dişisine Bintü mehâd derler. İbn Lebûn: Üç yaşma girmiş erkek yavru, dişisine Bintü Lebûn denilir. Hıkk: Dört yaşma girmiş erkek yavru, dişisine Hikka derler. Ceza': Beş yaşma girmiş erkek yavru, dişisine Cezea derler. Seniy: Altı yaşma girmiş erkek deve, dişisine Seniyye denir. Rabâi: Yedi yaşına girmiş deve, dişisine Rabâıyye derler. Sedîs yahut Sedes: Sekiz yaşına girmiş deve; Bâzilt Dokuz yaşına'girmiş deve; Muhallef: On yaşına girmiş deve demektir. Bu yaştan sonra devenin ayrıca adı yoksa da: «Bâ-zilu âm; Bâzilü âmeyn»; «Muhallefü âm, Muhallefü âmeyn, Muhallefü selâseti a'vâm...» diye isimler vererek on beş yaşına kadar çıkarlar. Devenin küçüğü mânâsına gelir. İnsanın küçüğüne çocuk denildiği gibi, devenin küçüğüne de Bekr, dişisine Bekra ve Kalûs denilmiştir. Kâdî Iyâz'ın beyânına göre mahsenin cem'idir; iyiler demektir, fakat ekseriyetle (ensen)’in cem'i olan (ehâsin) şeklinde kullanılır. Mehâsin aslında bedenin güzel yerleri demek olduğuna göre bu kelimenin «zevu'l-mehâsin» yani- güzel uzuvlara Mâlik mânâsında kullanılmış olması da ihtimâl dahilinde görülmüştür",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4113,
			"arabicnumber": "1602",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4114,
			"arabicnumber": "1603.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4115,
			"arabicnumber": "1603.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4116,
			"arabicnumber": "1603.03",
			"text": "(Bize bu hadisi Ebû Bekir b. Ebî Şeybe dahi rivâyet etti. ki): Bize Hafs b. Gıyâs, A'meş'den, o da İbrahim'den naklen rivâyet etti Esved, Âişe'den, o da Peygamber (sallallahü aleyhi ve sellem)’den bu hadisin mislini rivâyet eyledi» demiş; demirden kaydını zikret-raemiş. hadîsi Buhârî «Büyü'», «İstikraz», «Cihâd», «Şerike», «Selem» ve «Megâzî» bahislerinin on bir yerinde; Nesâî «Buyû'»da; İbn Mâce «Ahkâm»da muhtelif râvilerden tahrîc etmişlerdir. Bu rivâyetlerden anlaşıldığına göre Peygamber (sallallahü aleyhi ve sellem) Efendimiz Ebû Şahme yahut Ebû Şahm denilen yahudîden ailesi efradı için bir miktar arpa alarak ona «Zâtü'l-fudûl» nâmındaki harp zırhını rehin vermiştir. Aldığı arpanın miktarı hususunda rivâyetler muhteliftir. Bir rivâyete göre otuz, diğerine göre yirmi, başka bir rivâyetle kırk ölçektir. Resûlüllah (sallallahü aleyhi ve sellem)’in bu arpayı, yahudîden alış-veriş caiz olduğunu anlatmak için almış olması da bir ihtimâldir. Arpa mukabilinde zırhını rehin etmesi verecek başka bir şey bulamadığındandır. Peygamber (sallallahü aleyhi ve sellem)’in ailesi efradı için senelik zahiresini bir yerde biriktirirdiği sahih rivâyetlerle sabit olmuştur, fakat bu borçlanma o zahire bittikten sonra olmuştur. Ulemâdan bazıları borçlanmanın gelen misafirler sebebiyle yapıldığını söylemişlerdir; bilâhare bunu Hazret-i Ebû Bekir ödemiştir. Ekrem (sallallahü aleyhi ve sellem)’in arpayı ashabının zenginlerinden almayıp yahudîye. müracaat buyurması, ya ondan başka kimsede bulunmadığından yahut sahabe arpayı kendisine teberru' ederek minnet altında kalmamak içindir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4117,
			"arabicnumber": "1603.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4118,
			"arabicnumber": "1604.01",
			"text": "Bize Yahya b. Yahya ile Amru'n-Nâkıd rivâyet ettiler. Lâfız Yahya'nındır. (Amr: Bize rivâyet etti, tâbirini kullandı.) Yahya: Bizel Süfyân b. Uyeyne, İbn Ebî Necîh'den, o da Abdullah b. Kesîr'den, o da Ebû'l-Minhâl'den, o da İbn Abbâs'dan naklen haber verdi, dedi. Ibnİ Abbâs şöyle dedi: (sallallahü aleyhi ve sellem) Medine'ye geldiğinde Medîneli-ler meyvelerde bir ve İki seneliğine selem yapıyorlardı. Bunun üzerine: kim hurmada selem yapacaksa malûm ölçüde, malûm tartıda, malûm bir müddete kadar yapsın!» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4119,
			"arabicnumber": "1604.02",
			"text": "(Bize Şeybân b. Ferrûh rivâyet etti. ki): Bize Abdülvaris, İbn Ebî Necîh'den rivâyet etti. ki): Bana Abdullah b. Kesir, Ebû'l-Minhâl'den, o da İbn Abbâs'dan naklen rivâyette bulundu. Şöyle dedi: (sallallahü aleyhi ve sellem) geldiğinde halk selem yaparlardı. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) onlara: setem yapacaksa ancak malûm bir ölçüde ve malûm tartıda yapsın!» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4120,
			"arabicnumber": "1604.03",
			"text": "Bize Yahya b. Yahya ile Ebû Bekir b. Ebî Şeybe ve İsmâîl b. Salim hep birden İbn Uyeyne'den, o da İbn Ebî Necîh'den bu isnâdla Abdülvaris'in hadisi gibi rivâyette bulundu; yalnız \"malûm bir müddete kadar» kaydını zikretmedi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4121,
			"arabicnumber": "1604.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4122,
			"arabicnumber": "1605.01",
			"text": "(Bize Saîd b. Amr El-Eş'asî rivâyet etti. ki): Bize Hatim b. İsmail, Muhammed b. Aclân'dan, o da Muhammed b. Amr b. Atâ'dan, o da Said b. El-Müseyyeb'den, o da Ma'mer b. Abdillâh'dan, o da Resûlüllah (sallallahü aleyhi ve sellem)'den naklen rivâyet etti ki: başka kimse ihtikâr yapmaz!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4123,
			"arabicnumber": "1605.02",
			"text": "(İbrahim dedi ki: Müslim şunları söyledi: Bana arkadaşlarımızdan biri, Amr b. Avn'dan naklen rivâyette bulundu. ki): Bize Hâlid b. Abdillâh, Amr b. Yahya'dan, o da Muhammed b. Amr'dan, o da Saîd b. El-Müseyyeb'den, o da Benî Adiy İbn Kâ'b kabilesinden biri olan Ma'mer b. Ebî Ma'mer'den naklen haber verdi. Ma'mer: (sallallahü aleyhi ve sellem) şöyle buyurdular; diyerek Süleyman b. Bitâl'in, Yahya'dan rivâyet ettiği hadîsin mislini zikretmiş. ve diğer hadîs âlimlerinin beyânına göre bu hadîsin son rivâyeti Müslim'in tahrîc ettiği on dört maktu' hadîsten biridir. Fakat Kâdî Iyâz: «Evvelce de söylediğimiz gibi böyle hadîse maktu' denilmez; bu ancak meçhulün rivâyeti kabîlindendir.» diyor ki, doğrudur. Bu rivâyetin zaran yoktur; çünkü İmâm Müslim onu mütabeat olarak getirmiştir. Asıl hadîsi mevsuk râvilerin rivâyet-leriyle muttasıl olarak zikretmiştir. Buradaki meçhul râviyi Ebü Dâvûd ve\" diğer hadîs İmâmları ismiyle rivâyet etmişlerdir. Âsî, günahkâr demektir. İhtikâr' lügatte: Toplamak ve hapsetmektir. Şerîatte ise: Şehirden veya erzak celbettiği yerden zahire satın alarak, pahalanıncaya kadar hapsetmesidir. İhtikârın şartı, umuma zarar veren bir şehirde yapılmasıdır. Bazıları ihtikâr sayılmak için pahalılık zamanında satın alıp daha ziyade pahalanmasını beklemeyi şart koşmuşlardır. göre umuma zararı olan yerde insan ve hayvan yiyeceklerinde ihtikâr yapmak mekruhtur. Umûma zararı olmayan yerde malım satmayıp pahalılaşmasını beklemek ihtikâr . sayılmadığı gibi, tarlasından çıkan mahsulünü veya uzak yerden getirdiği zahiresini satmamak da ihtikâr değildir. bu hadîsle istidlal ederek hassaten yiyecek şeylerde ihtikârın haram olduğuna kaildirler. Yiyecek kabilinden olmayan şeylerde bilittifak ihtikâr yoktur. İhtikârın men' edilmesindeki hikmet âmmeden zararı defetmektir. Hattâ bir kimsenin elinde zahîre bulunsa da halk Gna muhtaç olsalar başka zahîre bulamadıkları takdirde o kimse zahiresini satmaya mecbur edilir. Hazret-i Ömer (radıyallahü anh)’ın: «Mekke'de zahîre ihtikâr etmeyin; zîra zulmü ilhâddır.» dediği rivâyet olunur. Gerçi hadîs-i şeriften Saîd b. El-Müseyyeb ile râvi Ma'mer'in ihtikâr yapardıklan anlaşılıyorsa da İbn Abdilberr ile diğer bir takım ulemâ bunların zahîre değil, zeytinyağı ihtikâr ettiklerini söylemişler; hadîsi ihtiyaç zamanında yiyecek saklamaya hamletmişlerdir. Nitekim Hanefîler'le Şâfiîler'in mezhepleri de budur",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4124,
			"arabicnumber": "1605.03",
			"text": "(Bize Züfaeyr b. Harb rivâyet etti. ki): Bize Ebû Safvân- El-Emevî rivâyet etti. H. Ebû't-Tâhir ile Harmele b. Yahya da rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. Her iki râvi Yûmıs'dan, o da İbn Şi-hâb'dan, o da İbn'l-Müseyyeb'den naklen rivâyet etmişlerdir ki, Ebû Hüreyre, ben Resûlüllah (sallallahü aleyhi ve sellem)'i: malın harcanmasına, kazancının elden gitmesine sebeptir.» buyururken işittim, demiş",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4125,
			"arabicnumber": "1606",
			"text": "Bize Ebû Bekir b. Ebi Şeybe ile Ebû Küreyb ve İshâk b. İbrahim rivâyet ettiler. Lâfız İbn Ebî Şeybe'nindir. (İshâk: Bize haber verdi, tâbirini kullandı.) Ötekiler: Bize Ebû Usâine, Velid b. Kesir'den, o da Ma'faed b. Kâ'b b. Mâlik'ten, o da Ebû Katâdete'l-Ensârî’den naklen rivâyet etti ki, Ebû Katâde Resûlüllah (sallallahü aleyhi ve sellem)'i çok çok yemîn etmekten sakinini Zira yemîn (matı) har-çattırır; sonra yok eder.» buyururken işitmiş, dediler. Hüreyre (radıyallahü anh) rivâyetini Buhari, Ebû Dâvûd ve Nesâî «Bûyû'» bahsinde tahrîc etmişlerdir. Ebû Katâde rivâyeti de aynı mânâdadır. rivâyetlerdeki yeminden naurâd: Yalan yere yemîn etmektir. Menfeka: Harcamaya sebep, Memlıaka: Bereketine gidermeye sebep mânâlannadır. Bu kelimeler birer ismi mekân olup mübalega için kullanılmışlardır. Asılları masdar-ı mîmîdir. Aynı kelimeler: Münfika ve Mümlıika şekillerinde ismi fail olarak da rivâyet edilmişlerdir. şeriV her iki rivâyetiyle ahş-verişte çok yemin etmenin memnu' olduğuna delildir. Çünkü lüzumsuz yere yemîn etmek mekruhtur. Burada ona bir de malın revâc bulması inzİmâm etmektedir. Bir de müşteri çok defa yemine aldanır. yeminle mal satmak satıcının zannına göre malın harcanmasına sebep olursa da hakîkatta bereketinin elden gitmesine sebep olur. Bu hem dünyevî, hem uhrevî tasavvur edilebilir. Dünyada malı telef olabilir; yahut faydasız yere harcanır. Âhirette ise sevabı kalmaz",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4126,
			"arabicnumber": "1607",
			"text": "(Bize Ahmed b. Yûnus rivâyet etti. ki): Bize Züheyr rivâyet etti. ki): Bize Ebû'z-Zübeyr, Câbir'den naklen rivâyette bulundu. H",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4127,
			"arabicnumber": "1608.01",
			"text": "(Bize Yahya b. Yahya da rivâyet etti. ki): Bize Ebü Hayseme, Ebû'z-Zübeyr'den, o da Câbir'den naklen haber verdi. Câbir Şöyle dedi: (sallallahü aleyhi ve sellem): kimsenin bir yurdda veya hurmalıkta ortağı varsa o kimse ortağına bildirmedikçe satış yapamaz. (Ortağı) isterse alır; istemezse terk eder.» buyurdular",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4128,
			"arabicnumber": "1608.02",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe ile Muhammed b. Abdillâh b. Nümeyr ve İshâk b. İbrahim rivâyet ettiler. Lâfız İbn Nümeyr'indir. İshâk bize haber verdi tâbirini kullandı. Ötekiler: Bize Abdullah b. İdrîs rivâyet etti, dediler. ki): Bize İbn Cüreyc, Ebû'z-Zübeyr'den, o da Câbir'den naklen rivâyette bulundu. Câbir Şöyle dedi: (sallallahü aleyhi ve sellem) taksim edilmemiş bulunan her ortaklıkta yurd olsun, bahçe olsun şuf'a hakkını hüküm buyurdu. Şerikine haber vermeden (ortağın) satış yapması kendisine helâl olmaz. (Şeriki) isterse alır; dilerse terkeder. Şayet satar da şerikine haber vermezse şeriki o mala -en lâyık kimsedir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4129,
			"arabicnumber": "1608.03",
			"text": "(Bana Ebû't-Tâhir dahi rivâyet etti. ki): Bize İbn Vehb İbn Cüreyc'den naklen haber verdi. Ona da Ebû'z-Zübeyr haber yermiş ki, kendisi Câbir b. Abdillah'ı şunları söylerken işitmiş: (sallallahü aleyhi ve sellem): hakkı yere, yurda veya bahçeye ait her ortalıkta vardır. (Ortağın) şerikine arzedip o da ya alıp yahut terk etmedikçe satışı muteber değildir. Bunu yapmazsa kendisine haber verinceye kadar şeriki o mala en lâyık kimsedir.» buyurdular. hadîsi Buhârî «Büyü'», «Şerike», «Şufa» ve «Terkü'l-Hıyel» bahislerinde; Ebû Dâvûd «Buyû'»da; Tirraizi ile İbn Mâce «Ahkâm»da muhtelif râvilerden tahrîc etmişlerdir. Katmak, çift yapmak mânâsına gelen «şefea» fiilinden alınma bir isimdir. Fukahâya göre şuf'a: Bir kimsenin milkine bitişik bir akar satılırken kararlaştırılan kıymetini Ödemek şartiyle onu müşteriden cebren almasıdır. Buna şuf'a denilmesi, bir hisseyi diğerine kattığı içindir. Yurd, mesken ve yer mânâlarına gelir. Asıl itibariyle bu kelime bahar mevsiminde oturulan yerdir. Rab'a: Rab'ın müennesidir. Bazıları müfredi olduğunu söylemişlerdir. Onlara göre rab' ismi cinstir. edilmemiş bir akarda ortak olan kimsenin o akarda şufa hakkı olduğunda bütün ulemâ müttefiktir. Hadîs-i şerîfde geçen «taksim edilmemiş her ortaklıkta...» ibaresinden murâd akardır. kıyâsa muhalif olarak hadîslerle sabit olmuştur. Bundaki hikmet ortağın zararını önlemektir. Şufanın akara mahsus olması en ziyâde zarar ondan geleceği içindir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4130,
			"arabicnumber": "1609.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlik'e, İbni Şihâb'dan dinlediğim, onun da A'rec'den, onun da Ebû Hüreyre’den naklettiği şu hadîsi okudum: Resûlüllah (sallallahü aleyhi ve sellem) biriniz komşusunu duvarına mertek çakmaktan menetmesin.» buyurmuşlar. Bundan sonra Ebû Hüreyre şunları söylemiş: neden sizleri buna yanaşmaz görüyorum? Vallahi bunu sizin omuzlarınız arasına atacağım!»",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4131,
			"arabicnumber": "1609.02",
			"text": "(Bize Züheyr b. Harb rivâyet etti. ki): Bize Süfyân b. Uyeyne rivâyet eyledi. H. Ebû't-Tâhir ile Harmele b. Yahya da rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus haber verdi. H. Abd b. Humeyd dahi rivâyet etti. ki): Bize Abdürrezzâk haber verdi. ki): Bize Ma'mer haber verdi. râvilerin hepsi Zührî'den bu isnâdla bu hadîsin benzerini rivâyet etmişlerdir. hadîsi Buhâri «Mezâlim» bahsinde; Ebû Dâvûd «Kazâda; Tirmizî «Ahkâm»da muhtelif râvilerden tahrîc etmişlerdir. başka rivâyetlerinden anlaşıldığına göre Hazret-i Ebû Hüreyre bu hadîsi Medîne valisi bulunduğu sırada nakletmiş. Ashab başlarını önlerine eğmişler. Bunun üzerine: «Vallahi bunu sizin omuzlarınız arasına atacağım!» Bir rivâyette: «Hoşunuza gitmese de gözlerinizin önüne sereceğim!» demiş. diyor ki: «Bu sözün mânâsı: Eğer siz bu hükmü kabul ve birrizâ onunla amel etmezseniz ben o merteği zorla sizin boynunuza yükleyeceğim, demektir. Ebû Hüreyre bununla mubâlega kasdet-miştir.» göre bu sözün mânâsı: «Bu hükmü sizin aranızda açıkça söyleyip; omuzlarınızın arasına ağır bir şeyle vurur gibi onunla sizin canımu sıkacağım!» demektir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4132,
			"arabicnumber": "1610.01",
			"text": "Bize Yahya b. Eyyûb ile Kuteybe b. Saîd ve Aliy b. Hucr rivâyet ettiler. (Dediler ki): Bize İsmail yani İbn Ca'fer, Alâ' b. Abdirrahmân'dan, o da Abbâs b. Sehl b. Sa'd Es-Sâid'den, o da Saîd b. Zeyd İbn Amr b. Nüfeyl'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem) kim zulüm yolu ile bir karış yer alırsa, Allah onu kıyâmet gününde yedi kat yer (in dibin)’den itibaren boynuna dolar.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4133,
			"arabicnumber": "1610.02",
			"text": "(Bana Harmele b. Yahya rivâyet etti. ki): Bize Abdullah b. Vehb haber verdi. ki): Bana Ömer b. Muhammed rivâyet etti. Ona da babası, Saîd b. Zeyd b. Amr b. Nüfeyl'den naklen rivâyette bulunmuş ki, Ervâ evinin bir kısmı hakkında kendisinden dâ-vâcı olmuş da (Saîd): Evi ona bırakın! Zîra ben Resûlüllah (sallallahü aleyhi ve sellem)’l: kim hakkı olmaksızın bir karış yer alırsa kıyâmet gününde yedi kat yer (in dibin)’den boynuna dolanacak!» buyururken işittim. Allahım! Eğer bu kadın yalancı ise gözünü kör et! Kabrini de evinde yap! demiş. diyor ki: Sonra ben bu kadını kör olmuş; duvarları yoklarken gördüm. Bana Saîd b. Zeyd'in (bed) duası isabet etti; diyordu. Bir defa bu kadın evde dolaşırken bir kuyunun üzerine uğrayarak içine düşmüş; o da onun kabri olmuş",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4134,
			"arabicnumber": "1610.03",
			"text": "(Bize Ebû'r-Rabî' El-Atekî rivâyet etti. ki): Bize Hammâd b. Zeyd, Hişâm b. Urve'den, o da babasından naklen rivâyette bulundu ki, Ervâ binti Üveys, Saîd b. Zeyd'in kendi yerinden bir parça aldığım iddia etmiş ve onu Mervân b. Hakem'e da'vaya vermiş. Bunun Üzerine Saîd; Ben Resûlüllah (sallallahü aleyhi ve sellem)'den işittiğim şeyden sonra hiç onun yerinden bir şey alır mıyım? demiş. Mervân: Resûlüllah (sallallahü aleyhi ve sellem)’den ne işittin? deyince: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: kim zulüm yolu ile bir karı? yer alırsa, yedi kat yer (in dibin) tt kadar boynuna dolanır.» buyururken işittim; cevabını vermiş. Bunun üzerine Mervân kendisine: Bundan sonra senden bir hangi beyyine istemiyorum; demiş. Saîd de: Allahım, eğer bu kadın yalancı ise gözünü kör et; ve kendisini kendi yerinde öldür! diye bed duâ etmiş. diyor ki: Bu kadın kör olmadan ölmedi. Sonra bir defa kendi yerinde dolaşırken birden bir çukura düşerek öldü",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4135,
			"arabicnumber": "1610.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4136,
			"arabicnumber": "1611",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe rivâyet etti. ki): Bize Yahya b. Zekeriyyâ b. Ebî Zaide, Hİşâm'dan, o da babasından, o da Saîd b. Zeyd'den naklen rivâyet etti. Şöyle dedi: Ben Peygamber (sallallahü aleyhi ve sellem)'i: kim zulüm yolu ile bir kan; yer alırsa, o yer kıyâmet gününde yedi kat yer (in dibin)’den (başlayarak) o kimsenin boynuna dolanacaktır.» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4137,
			"arabicnumber": "1612.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4138,
			"arabicnumber": "1612.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 4139,
			"arabicnumber": "1613",
			"text": "(Bana Ebû Kâmil Fudayl b. Hüseyn El-Cahderî rivâyet etti. ki): Bize Abdülazîz b. Muhtar rivâyet etü. ki): Bize Hâlid El-Hazzâ', Yûsuf b. Abdillâhdan, o da bahasından, o da Ebû Hüreyre'den naklen rivâyette bulundu ki, Peygamber (sallallahü aleyhi ve sellem): hakkında ihtilâfa düşerseniz, yolun genişliği yedi arşın yapılır.» buyurmuşlar. hadîsi Buhârî «Mezâlim» bahsinde tahrîc etmiştir. Arşın demektir; hem nıüzekker hem müennes bir kelimedir. Bazı rivâyetlerde müzekker, bazılarında müennes olarak zikredilmesi bundandır. Burada zirâ'dan murâd: Her beldede âdet olan arşın ve metre gibi şeylerdir. yol hakkında Nevevî şunları söylüyor: «Bir kimse mülkü olan yerin bir kısmını gelip geçenlere yol ayırsa, bu yolun miktarı o kimsenin ihtiyarına bırakılır. Efdal olan yolu geniş bırakmaktır. Ama hadîsten murâd bu değildir. Şayet yol, bir cemaatin arazîsi arasında bulunur da onu yenilemek isterler ve şu kadar olsun diye bir miktar üzerinde anlaşırlarsa, bu anlaşma mu'teber olur; yolun ne kadar olacağında ihtilâf ederlerse o zaman yol yedi arşın bırakılır. îşte hadîsten murâd budur. Ama yedi arşından daha geniş olarak yapılmış bir yol bulursak, bu yolun az da olsa hiç bir yerini benimsemeye kalkışmak hiç bir kimseye caiz değildir. Yalnız etrafındaki hâli yerleri işlemek caizdir. Yoldan geçenlere zarar vermemek şartiyle bu yeri ihya suretiyle mülk edinebilir...» bu hadîsin yeni açılacak yollar hakkında olduğunu söylemiş; El-Mühelleb (-83): «Bu hüküm evlerin arasındaki yollır hakkındadır. Ev sahipleri aralarında yol açmak isterlerse yedi arşın genişliğinde yapmaları îcâbeder, tâ ki gelip geçenlere ve yük getirip götürenlere zarar vermesin.» demiştir. bu hükmün ulemâya göre vücûp ifade ettiğini bildiriyor. bu hadîsin ana caddeler hakkında olduğunu, mahalleler, arasında yeni açılacak yolların anlaşmaya bağlı olup yedi arşından daha az da olabileceğini söylemişlerdir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 178
			}
		}
	]
}