{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"23": "The Book of the Rules of Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4140,
			"arabicnumber": "1614",
			"text": "Bize Yahya b. Yahya ile Ebû Bekir b. Ebî Şeybe ve Is-hâk b. İbrâhîra rivâyet ettiler. Lâfız Yahya'nındır. Yahya (Bize haber verdi) tâbirini kullandı. Ötekiler: Bize İbn Uyeyne, Zührî'den, o da Aliy b. Hüseyn'den, o da Amr b. Osman'dan, o da Üsâme b. Zeyd'den naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem): kâfire; kâfir de müslümana mirasçı olamaz.» buyurmuş, dediler. beyânına göre irs ve mîrâs: Asıl itibariyle akıbet demektir. Bunun mânâsı bir kimseden diğerine intikaldir. müslümana mirasçı olamayacağı hususunda bütün İslâm uleması itt,ifâk halindedir. diyor ki: «Sahabe, tabiîn ve onlardan sonra gelen ulemanın cumhûruna göre müslüman da kâfire mî-rasç: olamaz. Bir taife müslümanı kâfire mirasçı yapmaya kail olmuşlardır. Bu kavil Muâz b. Cebel, Muâviye (radıyallahü anh) ile Saîd b. El-Müseyyeb, Mesrûk ve başkalarının mezhebidir. Aynı kavil Ebû'd-Derdâ', Şa'bî, Zührî ve İbrahim Nehaî'den de —aralarında bu hususta hilaf olmak üzere— rivâyet olunmuşsa da doğrusu bu zevatın kavilleri de cumhûrun kavli gibidir. Muhalifler «İslâm yücedir; onun üstüne geçilmez.» hadîsiyle istidlal etmişlerdir. Cumhûrun delili ise sadedinde bulunduğumuz sahîh ve sarih hadîstir. İslâm hadîsinde onlara hüccet yoktur. Zîra ondan murâd İslâm'ın başka dînlere olan üstünlüğüdür. Onda mirastan söz yoktur. Şu halde onunla amel ederek «Müslüman kâfire mirasçı olamaz...» hadîsinin nassi nasıl terk edilebilir? Her halde o taife bu hadîsi duymamış olacak!.. (yani müslümanlığı bırakıp başka bir dîne dönen kimse) bilicmâ' müslümana mirasçı olamaz. İmâm Şafiî, Mâlik, Rabîa, İbn Ebî Leylâ ve başkalarına göre müslüman da mürtedde mirasçı olamaz; mürtedin malı müslümanlar arasında ganimet olur. Hanife ile Küfe ulemâsı ve İshâk müslüman olan veresesinin mürtedde mirasçı olacaklarına kaildirler. Bu kavil Hazret-i Ali ile İbn Mes'ud (radıyallahü anh)'dan ve seleften bir cemaattan rivâyet olunmuştur. Lâkin Sevrî ile Ebû Hanîfe: Mürtedin riddet hâlinde kazandığı şeyler müslümanîann malıdır, demişlerdir, ötekilerine göre bütün malı müslüman olan veresesinin olur. birbirlerinden mirasçı olmalarına gelince: İmâm A'zam'la İmâm Şafiî ve diğer bir takım ulema yahudînin hı-ristiyana, hıristiyanın yahudîye, bunların mecûsîye ve mecûsînin bu iki millete mirasçı olabileceğine kaildirler. İmâm Mâlik bunu caiz görmemiştir. İmâm Şafiî: «Lâkin harbî zimmîye; zimmî harbîye mirasçı olamaz» demiştir. Ayrı ayrı memleketlerde bulunan iki harbî dahi birbirlerine mîrasçı olamazlar. Hanefîler'in kavli de budur",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4141,
			"arabicnumber": "1615.01",
			"text": "(Bize Abdülâ'lâ b. Hammâd —ki Nevsî'dir— rivâyet etti. ki): Bize Vüheyb, İbn Tâvûs'dan, o da babasından, o da İbn Abbâs'dan naklen rivâyet etti. Şöyle dedi: (sallallahü aleyhi ve sellem): hisselerini ehillerine verin! Kalanı en yakın erkeğindir.»buyurdular",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4142,
			"arabicnumber": "1615.02",
			"text": "(Bize Ümeyye b. Bistâm el-Ayşî rivâyet etti. ki): Bize Yezîd b. Zürey' rivâyet etti. ki): Bize Ravh b. Kâsım, Abdullah b. Tâvûs'dan, o da babasından, o da İbn Abbâs'dan, o da Resûlüllah (sallallahü aleyhi ve sellem)’den naklen rivâyette bulundu: hisselerini ehillerine verin, bu hisselerden artan erkek kişinindir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4143,
			"arabicnumber": "1615.03",
			"text": "(Bize İshâk b. İbrahim ile Muhammed b. Râfi' ve Abd b. Humeyd rivâyet ettiler. Lâfız İbn Râfi'uıdir. İshâk: Bize rivâyet etti tâbirini kullandı. Ötekiler: Bize Abdürrezzâk haber verdi, dediler. ki): Bize Ma'mer, İbn Tâvûs'dan, o da babasından, o da İbn Abbâs'dan naklen haber verdi. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): ferâız ehli arasında Allah'ın kitabına göre taksim edin; miras hisselerinden artanı en yalcın erkek kişinindir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4144,
			"arabicnumber": "1615.04",
			"text": "(Bana bu hadîsi Muhammed b. Ala' Ebû Küreyb El-Hemdâni de rivâyet etti. ki): Bize Zeyd b. Hubâb, Yahya b. Eyyûb'dan, o da İbn Tâvûs'dan bu isnâdla Vüheyb ve Ravh b. Kâsım'in hadîsleri gibi rivâyette bulundu. hadîsi Buhârî, Ebû Dâvûd, Tirmizî ve Nesâî «Ferâiz» bahsinde muhtelif râvilerden tahrîc etmişlerdir. adı ile anılan mîras hisseleri Kur'ân'ı Kerîm'de: Yarı, çeyrek, sekizde bir, üçte iki, üçte bir ve altıda bir olmak üzere altı nevi'dir. Bu hisselerin kimlere verileceği dahi nass-ı Kur'ânüa beyân edilmiştir. Tafsilâtı fıkıh kitaplarındadır. şerifte geçen «evlâ» tâbiri daha lâyık mânâsına değil, daha yakın manasınadır. Bu kelime yakınlık mânâsına gelen «veyl»den alınmıştır. Nevevî şunları söylüyor: «Çünkü bu kelime burada (daha lâyık) mânâsına alınsa hiç bir faydası kalmaz; zira kimin daha lâyık olduğunu biz bilemeyiz.» Iyâz'ın beyânına göre bu hadîsin İbn Hâmân rivâyetinde «evlâ» yerine «ednâ» denilmiştir ki, bu da evlâ tâbirinin en yakın mânâsına kullanıldığını gösterir; çünkü ednâ: en yakın demektir. bir de bu hadîsteki «zeker» kelimesi üzerinde durmuşlardır. Zeker: erkek demektir. Bu kelimeden önce zikredilen «racûl» dahi erkek kişi mânâsına gelir. Şu halde mânâ: «Mîras hisselerinden artanı erkek olan erkeğindir.» demek olur. Onun için İbn'l-Cevzî ile Münzirî bu kelimenin mahfuz olmadığını söylemişler; İbn Salâh: «Rivâyet şöyle dursun bu kelime sahîh bile değildir.» demiştir. Ulemâdan bâzılarına göre burada erkeğin erkeklikle tavsif buyurulması mîras istihkakının sebebine tenbîh içindir. Bu sebep onun erkek oluşudur. Bir takımları te'kîd için getirildiğini iddia etmiş; daha başkaları, ra-cül kelimesinden şahıs mânâsı anlaşılmasın diye zikredildiğini söylemişlerdir. Hünsâdan ihtiraz için getirildiğini iddia edenler bile olmuştur. Fakat bu sözler i'tirazdan hali değildir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4145,
			"arabicnumber": "1616.01",
			"text": "(Bize Amr b. Muhammed b. Bükeyr En-Nâkıd rivâyet etti. ki): Bize Süfyân b. Uyeyne, Muhammed b. Münkedir'den naklen rivâyette bulundu. O da Câbir b. Abdillâh'ı şunları söylerken işitmiş: Hastalandım da Resûlüllah (sallallahü aleyhi ve sellem) Ebû Bekir'le birlikte yaya olarak beni dolaşmaya geldiler. Derken bayıldım. Bunun üzerine abdest aldı; sonra abdest suyundan üzerime döktü; ben de ayılarak: Yâ Resûlallah, malım hususunda nasıl hüküm vereyim? dedim» fakat bana bir cevap vermedi. Nihayet mîrâs âyeti (olan): fetva istiyorlar. De ki: Kelale\" hakkında size Allah fetvâ veriyor.\" Nisa sûresi, âyet: 176. nazm-ı celîli indi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4146,
			"arabicnumber": "1616.02",
			"text": "(Bana Muhammed b. Hatim b. Meymun rivâyet etti. ki): Bize Haccâc b. Muhammed rivâyet etti. ki): Bize İbn Cüreyc rivâyet etti. ki): Bana İbn Münkedir, Câbir b. Abdillâh'dan naklen haber verdi. Câbir söyle demiş: Seleme (kabilesin) de (rahatsız bulunduğumda) Peygamber (sallallahü aleyhi ve sellem) Ebû Bekir'le birlikte yaya olarak beni dolaşmaya geldiler. Beni aklımı kaybetmiş halde buldu. Bunun Üzerine su isteyerek abdest aldı. Sonra o sudan üzerime serpti. Ben de ayıldim ve: Malım hususunda ne yapayım yâ Resûlallah? dedim. Bunun üzerine: size çocuklarınız hakkında erkeğe iki kadın hissesi tavsiye ediyor.» âyet-i kerîmesi indi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4147,
			"arabicnumber": "1616.03",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4148,
			"arabicnumber": "1616.04",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4149,
			"arabicnumber": "1616.05",
			"text": "(Bize İshâk b. İbrahim rivâyet etti. ki: Bize Nadr b. Şü-meyl ile Ebû Âmir El-Akadî hale er verdiler. H. Muhammed b. El-Müsenna dahi rivâyet etti. ki): Bize Vehb b. Cerîr rivâyet etti. râvilerin hepsi Şu'be'den bu isnâdla rivâyette bulunmuşlardır. Vehb b. Cerîr hadîsinde: «Bunun merine feraiz âyeti indi.» ibaresi; Nadr ile Akadî hadîsinde; «Bunun üzerine farz âyeti indi.» cümlesi vardır. Ama bunlardan hiç birinin rivâyetinde Şu'be'nin İbn Münkedir'e söylediği söz yoktur. hadîsi Buhârî «Taharet», «Tefsir», «Ferâiz» ve «Merdâ» bahislerinde; Nesâî «Taharet», «Tefsir». «Ferâiz» ve «Tıbb»da muhtelif râvilerden tahrîc etmişlerdir. Abdest suyu demektir. Burada ondan murâd, ya Peygamber (sallallahü aleyhi ve sellem)’in abdest aldığı su, yahut bu suyun artığıdır. Câbir (radıyallahü anh): «Malım hususunda ne yapayım?» sualiyle mirasının kime kalacağını anlamak istemiştir. Nitekim Buhârî'nin rivâyetinde bunu tasrîh etmiştir. Rivâyetlerin birinde Câbir (radıyallahü anh): «Bana ancak yedi kız kardeşim mirasçı oluyor.» demiştir. beyanlarına göre kelâle: Hem mirasçıya, hem de mîras bırakılan şeye verilen bir isimdir. Mirasçı mânâsında kullanılırsa bu kelimeden murâd: Baba ile evlâddan başka kimselerdir. Miras bırakılan mânâsına alınırsa, öldüğünde kendisine anne ve babasından ve evlâdından hiç biri mirasçı olamayan kimsedir. diyor ki: «Ulemâ kelâle sözünün hangi kelimeden müştak olduğu hususunda ihtilâf etmişlerdir. Ekseriyet (tekellül)’den iştikak ettiğine kaildir. Tekellül: Kenara kalmak, yan düşmek demektir. Meselâ; amca oğluna kelâle denilir; çünkü nesebin doğru inen amudu üzerinde değil, yanda kalır. Bazıları ihata mânâsına gelen (kelle)’den alındığını söylerler; iklîl tâbiri bundan alınmıştır, îklîl: Cevherle süslenmiş sargıya benzeyen (baş tacı gibi) bir şeydir... Kelâlenin uzaklık ve inkıta1 mânâsına gelen (kelle) fiilinden müştak olduğunu söyleyenler de vardır.» Bazıları kelâlenin anne bir kardeşler demek olduğunu iddia etmiş; bir takımları amca oğullarıdır, demiş, hattâ bütün asabelere kelâle denildiğini söyleyenler olmuştur. Süre kelâle üç mânâda yani: Geride evlâd ve baba bırakmayan, kalanlardan evlâd ve baba olmayanları ve baba yahut evîâd tarafından olmayan akraba mânâlarında kullanılır. verilen muhtelif mânâlar arasında Aynî'nin beyânına göre en sahihi baba ile evlâttan başka akraba mânâsıdır",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4150,
			"arabicnumber": "1617.01",
			"text": "Bize Muhammed b. Ebî Bekr El-Mukaddemî ile Muhammed b. El-Müsennâ rivâyet ettiler. Lâfız İbn Müsennâ'nındır. (Dediler ki): Bize Yahya b. Saîd rivâyet etti. ki): Bize Hişâm rivâyet etti. ki): Bize Katâde, Salim b. Ebî'l-Ca'd'dan, o da Ma'dân b. Ebî Tal-ha'dan naklen rivâyette bulundu ki, Ömer b. El-Hattâb bir cuma günü hutbe okuyarak Peygamber (sallallahü aleyhi ve sellem)’i ve Ebû Bekri anmış; sonra şunları söylemiş: arkamda kendimce kelâleden daha mühim bir şey bırakmıyorum. Resûlüllah (sallallahü aleyhi ve sellem)'e kelâle hakkında müracaat ettiğim kadar hiç bir şey hakkında müracaat etmemişimdir. O da bana kelâle hakkında yaptığı kadar hiç bir şey hakkında ağır söz söylememiştir. Hattâ parmağı ile göğsüme dokunmuş ve: Ömer! Sana Nisa sûresinin sonundaki yaz âyeti yetmiyor mu?» demiştir. sağ olursam bu mesele hakkında öyle bir hüküm vereceğim ki (artık) Kur'ân'ı okuyan da, okumayan da onunla hükmetsin",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4151,
			"arabicnumber": "1617.02",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe de rivâyet etti. ki): Bize İsmail b. Uleyye, Saîd b. Ebî Arûbe'den rivâyet etti. H. Züheyr b. Harb ile İshâk b. İbrahim ve İbn Râfi' dahi Şebâbe b. Sevvâr'dan, o da şu'be'den, her iki râvi Katâde'den bu isnâdla bu hadîsin benzerini rivâyet etti. âyetinden murâd Sûre-i Nisa'nın son âyetidir. Bundan önceki rivâyetlerde zikri geçen mîrâs veya kelâle âyeti budur. Yazın indirildiği için ona yaz âyeti de denilmiştir. sağ olursam ilâh...» cümlesi Hazret-i Ömer'in sözüdür. Bu mesele hakkında o anda hüküm vermeyip sonraya bırakması içtihadı tamam olup iyice kalbi yatışmadığındandır. (sallallahü aleyhi ve sellem)'in kelâle hakkında Ömer (radıyallahu anh)'a ağır lâf söylemesi hadîsin ibaresine bel bağlayıp da delillerden hüküm çıkarmayı terk etmek âdet olur endîşesindendir. Halbuki Teâlâ Hazretleri: o meseleyi Peygambere ve kendilerinden olan ülülemre arzetselerdi, içlerinden onu delilinden çıkaranlar pek âlâ bilirlerdi.\" Âyet-i kerîme buyurmuştur. Demek oluyor ki, bir hükmü delilinden anlayıp çıkarmaya dikkat etmek en mühim vâcibâttan biridir. Zîra nass olan deliller pek az meselelere yetecek mahiyettedirler. Delilden hüküm çıkarma meselesi ihmâl edilirse başa gelen hâdiselerin ekserisi veya bir kısmı hakkında istinbât (yani hüküm çıkarma) işi suya düşecektir. yaz âyetindeki kelâleden ne murâd edildiği hususunda ihtilâf etmişlerdir. Bir kavle göre bundan murâd: Ölen kimsenin evlâdı ve babası bulunmamak şartiyle mirasıdır. Şu hâlde âyetteki (kelâle) sözü takdirinde mansûb olmuştur. İkinci bir kavle göre Geride evlâd ve baba bırakmadan Ölen kimsedir. Bunun erkek veya kadın olması hükmen hep birdir. Bu kavle göre âyet-i kerîme: takdirindedir. Mezkûr kavil Ebû Bekir, Ömer, Alî, İbn Mesûd, İbn Abbâs ve Zeyd b. Sabi (radıyallahü anhüm) hazerâtından rivâyet olunmuştur. kelâlenin, içlerinde evlâd ve baba olmayan mirasçılar mânâsına geldiğini söylemişlerdir. Bunların delili Hazret-i Cabir'in: «Bana ancak kelâle mirasçı oluyor...» sözüdür; çünkü Câbir (radıyallahü anh)’ın evlâdı ve babası yoktu. Bir takım ulemâ: «Kelâle miras kalan maldır.» demişlerdir. göre kelâle: Geride evlâd bırakmadan ölen kimsedir. Babası veya dedesi olması onu kelâle olmaktan çıkarmaz. Şu halde kız kardeşler baba ile birlikte mirasçı olurlar. Kâdî Iyâz bu kavlin İbn Abbâs (radıyallahü anh) hazretlerinden rivâyet edildiğini, fakat aslı olmayan bâtıl bir uydurma olduğunu, İbn Abbâs Hazretlerinin bu meselede cumhûrla beraber bulunduğunu söylemektedir. Yine Kâdî'nin beyânına göre ulemâdan Bazıları kelâlenin çocuğu ve babası olmayan mânâsına geldiğine dair icmâ' bulunduğunu ileri sürmüşlerdir. arasında dede bulunursa bu mirasçılar kelâle sayılırlar mı, sayılmazlar mı? meselesi ihtilaflıdır. Dedeyi baba hükmünde saymayanlara göre kelâledirler. Dedeyi baba hükmünde tutanlara göre kelâle sayılmazlar. arasında kız varsa cumhûr-u ulemâya göre bu mirasçılar kelâle sayılırlar. Çünkü kardeşler, kız kardeşler ve diğer asabeler kızla birlikte mirasçı olurlar. İbn Abbâs (radıyallahü anh): «Kız kardeş, kızla birlikte mirasçı olamaz; zira Teâlâ Hazretleri: yok da kız kardeşi varsa) buyuruyor.» demiştir. Dâvûd-u Zahirî'nin mezhebi de budur. göre mirasçılar arasında kız bulunması onların kelâle olmasına mânidir; zîra onlar kızla birlikte kardeşe ve kız kardeşe miras vermezler; bütün malı kıza tahsis ederler. Delilleri: kimse ölür de çocuğu bulunmaz, kız kardeşi bulunursa, bıraktığı mirasın yarısı kız kardeşinin olur.\" Nisa sûresi. âyet-i kerîmesidir. mezhebine göre bu âyetin mânâsı şudur: Kız kardeşe mukadder olan yarı hisseyi vermek ancak ölenin çicuğu olmaması şartına bağlıdır. Şu halde çocuk bulunmaması onun mirasçı olması için değil, mukadder olan yarı hiseyi vermek ancak ölenin çocuğu olmaması şartına bulunmaması zikredildiği halde baba bulunmamasının zikredilmemesi temel ferâiz kaidesinden malûm olduğu içindir. Yoksa baba ile birlikte kardeş ve kız kardeş mirasçı olamazlar. kaideye göre bir kimse bir şahıs vâsıtasiyle mirasçı olursa o şahıs mevcutken mîras alamaz. Bundan yalnız anne bir kardeşler müstesnadır. Onlar anneleriyle birlikte mirasçı olurlar. Sûre-i Nisa'nın son âyetindeki kardeşlerle kız kardeşlerden murâd: Anne, baba bir yahut böyleler! yoksa baba bir kardeşler olduğuna ittifak etmişlerdir. Aynı sûrenin baş taraflarındaki: adama veya kadına Kelâle suretiyle mirasçı olunur da kardeşi veya kız kardeşi bulunursa...\" Nisa sûresi, âyet: 12. âyetindeki kardeşlerle kız kardeşlerse bilittifak anne bir kardeşlerdir. Bunlara hususî tabiriyle evlâd-ı ümm derler",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4152,
			"arabicnumber": "1618.01",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4153,
			"arabicnumber": "1618.02",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4154,
			"arabicnumber": "1618.03",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4155,
			"arabicnumber": "1618.04",
			"text": "(Bize Ebû Küreyb rivâyet etti. ki): Bize Yahya yânı İbn Âdem rivâyet etti. ki): Bize Ammâr —ki İbn Züreyk'tir—, Ebû İshak'tan, o da Berâ'dan bu hadîsin mislini rivâyet etti. Şu kadar var ki o: «Kâmil olarak indirilen son sûre...» dedi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4156,
			"arabicnumber": "1618.05",
			"text": "(Bize Abdülmelik b. Şuayb b. Leys rivâyet etti. ki): Bana babam, dedemden rivâyet etti. ki): Bana Ukayl rivâyet etti. H. Züheyr b. Harb da rivâyet etti. ki): Bize Ya'kûb b. ,ibrahim rivâyet etti. ki): Bize İbn Şihâb'ın kardeşi oğlu rivâyet etti. H. İbn Nümeyr dahi rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize İbn Ebî Zi'b rivâyet etti. râvilerin hepsi bu hadîsi Zührî'den bu isnâdla irvâyet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4157,
			"arabicnumber": "1619.01",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4158,
			"arabicnumber": "1619.02",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4159,
			"arabicnumber": "1619.03",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4160,
			"arabicnumber": "1619.04",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4161,
			"arabicnumber": "1619.05",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4162,
			"arabicnumber": "1619.06",
			"text": "(Bana bu hadisi Ebû Bekr b. Nâfi' de rivâyet etti. ki): Bize Gunder rivâyet etti, H. Züheyr b. Harb dahi rivâyet etti. ki): Bize Abdurrahmân yani İbn Mehdi rivâyet etti. iki râvi: Bize Şu'be bu isnadla rivâyette bulundu, demişlerdir. Ancak Gunder'in hadîsinde: «Her kim yük bırakırsa ona ben veli olurum.» ibaresi vardır. hadîsi Buhârî «Kefalet» ve «Nafakaat» bahislerinde; Tirmizî «Cenâiz»de muhtelif râvilerden tahrîc etmişlerdir. şerifte geçen (daya') ve (day'a) tâbirleri: Yoksulluk mânâsına gelen masdarlardır. Burada ölen kimsenin mirasçıları masdarla sı-fatlanmıjlardır. Maksad: Fakru zaruret sahibi, muhtaç ve mahvolmuş çoluk çocuk bırakırsa demektir. Asıl İtibariyle ağırlık demekse de burada ondan da murâd: Çoluk-çocuktur. Fütuhattan murâd: Alınan ganimetlerdir. zamanlarda Peygamber (sallallahü aleyhi ve sellem)’in borçlu kimselerin cenaze namazlarını kılmaması, sağlıklarında borçlarını ödemeye teşvik içindi. Fütuhattan sonra böylelerin namazlarını kılmağa başladı. beyanına göre hadîs-i şerifin: borçlu olarak Ölürse, o borcun ödemesi bana aittir...» cümlesi, borçlu Ölenlerin namazlarım kılmadığını bildiren hadîsleri neshetmiştir. Bu bâbta İbn Abbâs (radıyallahü anh)'dan rivâyet olunan bir hadîste şöyle deniliyor: «Peygamber (sallallahü aleyhi ve sellem) borçlu olarak ölen kimsenin namazını kılmıyordu. Derken Ensârdan bir zât vefat etti. Resûlüllah (sallallahü aleyhi ve sellem): borcu var mı?» diye sordu. Evet, dediler. ise cenazenizin namazını kılın! buyurdu. üzerine Cebrail (aleyhisselâm) inerek şunları söyledi: (azze ve celle) buyuruyor ki: Benim indimde zâlim ancak zulüm, israf ve isyan hususunda borçlanandır; çoluk çocuk sahibi namuslu kimseye gelince: Onun namına ben ödeyeceğime kefilim.» işitince Peygamber (sallallahü aleyhi ve sellem) hemen o zâtın cenaze namazını kıldı ve bundan sonra: kim yoksulluk veya borç bırakırsa bana yahut benim üzerime kalır; kim mîras bırakırsa ailesi efradına kalır.» buyurdu. Bir daha böy-lelerinin namazlarım kıldı.» diyor ki: «Peygamber (sallallahü aleyhi ve sellem)’in Ölen bir kimsenin borcunu üzerine alması ihtimâl yüksek ahlâkı iktizası bir teberru' olup vâcib değildi.» (sallallahü aleyhi ve sellem)'in bu borcu nereden ödediği ihtilaflıdır. Kendi malından ödediğini söyleyenler olduğu gibi, müslüman-lar yararına gelen mallardan ödediğini ileri sürenler de vardır. Keza bu ödemenin ona vâcib olduğunu söyleyenler bulunduğu gibi teberru' suretiyle verdiğine kail olanlar da vardır",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 23
			}
		}
	]
}