{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"24": "The Book of Gifts"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4163,
			"arabicnumber": "1620.01",
			"text": "Bize Abdullah b. Mesleme b. Ka'neb rivayet etti. (Dediki): Bize Mâlik b. Enes, Zeyd b. Eslem'den, o da babasından naklen rivayet ettiki, Ömer b. Hattâb şunları söylemiş : İyi cins bir atımı Hak yolunda tesadduk ettim. Az sonra sahibi onu ziyan etmiş. Ben onu ucuza satacağını anlayarak Resûlullah (Sallallahu Aleyhi ve Sellem)'e hükmünü sordum da: «Onu ne satın al, ne de sadakandan dön; zira sadakasından donen kusmuğuna dön (üp yiy) en köpek gibidir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4164,
			"arabicnumber": "1620.02",
			"text": "{…} Bana bu hadîsi Züheyr b. Harb da rivayet etti. (Dediki): Bize Abdurrahmân yâni ibni Mehdi, Mâlik b. Enes'den bu isnâdla rivayette bulundu. Şunu da ziyade etti: «Onu satın alma; velevki onu sana bîr dirheme versin!»",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4165,
			"arabicnumber": "1620.03",
			"text": "Bana Ümeyye b. Bistâm rivayet etti. (Dediki): Bize Yezîd yâni İbni Zürey' rivayet etti. (Dediki): Bize Ravh —ki İbni'l-Kaasîm'dir—, Yezîd b. Eslem'den, o da babasından, o da Ömer'den naklen rivayette bulundu ki, Ömer bir atını Hak yolunda tesadduk etmiş; sonra onu sahibinin ziyan ettiğini görmüş. Bu zâtın malı azmış. Bu sebeple atı satın almak isteyerek Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelmiş ve meseleyi kendilerine arz etmiş. Peygamber (Sallallahu Aleyhi ve Sellem) «Onu satın olma, velevki sana bir dirheme versin; zîra sadakasından dönenin misali kusmuğuna dönen köpek gibidir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4166,
			"arabicnumber": "1620.04",
			"text": "{…} Bize bu hadîsi İbni Ebî Ömer de rivayet etti. (Dediki): Bize Süfyân, Zeyd b. Eslem'den bu İsnâdla rivayette bulundu. Ancak Mâlik ile Ravh'ın hadîsleri daha tamam ve daha uzundur. İzah 1621 de",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4167,
			"arabicnumber": "1621.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, Nâfi'den dinlediğim, onun da İbni Ömer'den naklen rivayet ettiği şu hadîsi okudum: Ömer b. El-Hattâb bir atını Hak yolunda tesaduk etmiş. Sonra onun satılacağını anlamış da satın almak istemiş; ve Resûlullah (Sallallahu Aleyhi ve Sellem)'e bu meseleyi sormuş. Efendimiz: «Onu satın alma ! Sadakandan da dönme!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4168,
			"arabicnumber": "1621.02",
			"text": "{…} Bize bu hadisi Kuteybe b. Saîd ile ibni Rumh dahi hep birden Leys b. Sa'd'dan rivayet ettiler. H. Bize El-Mukaddemî ile İbni'I-Müsennâ da rivayet ettiler. (Dedilerki): Bize Yahya —ki El-Kattân'dır— rivayet etti. H. Bize İbni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize Ebû Bekr b. Ebî Şeybe dahî rivayet etti. (Dediki): Bize Ebû Usâme rivayet etti. Bu râvilerin hepsi Ubeydullah'dan ve ikisi Nâfi'den, o da İbni Ömer'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den Mâlik'in hadîsi gibi rivayette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4169,
			"arabicnumber": "1621.03",
			"text": "Bize İbni Ebî Ömer ile Abd b. Humeyd rivayet ettiler. Lâfız Abd'ındır. (Dediki): Bize Abdürrazzâk haber verdi. (Dediki): Bize Ma'mer, Zührî'den, o da Sâlim'den, o da İbui Ömer'den naklen haber verdi ki, Ömer bir atını Hak yolunda tesaduuk etmiş. Sonra onun satılırdığını görerek satın almak istemiş ve Nebi (Sallallahu Aleyhi ve Sellem)'e sormuş. Resûlullah (Sallallahu Aleyhi ve Sellem): «Sadakandan dönme yâ Ömer!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4170,
			"arabicnumber": "1622.01",
			"text": "Bana İbrahim b. Musa Er-Râzî ile ishâk b. İbrahim ri­vayet ettiler. (Dedilerki): Bize îsâ b. Yunus haber verdi. (Dediki): Bize Evzâî, Ebû Ca'fer Muhammed b. Ali'den, o da İbnil-Müseyyeb'den, o da İbni Abbâs'dan naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem): «Sadakasından dönen kimsenin misâli, kusup da sonra kusmuğuna dönerek onu yiyen köpek gibidir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4171,
			"arabicnumber": "1622.02",
			"text": "{…} Biz» bu hadîsi Ebû Kureyb Muhammed b. Ala' da rivayet etti. (Dediki): Bize İbni'l-Mubârek, Evzâî'den naklen haber verdi. Evzâî: Ben Muhammed b. Alî b. Hüseyn'i bu isnâdla bu hadîs gibi rivayette bulunurken işittim; demiş",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4172,
			"arabicnumber": "1622.03",
			"text": "{…} Bana bu hadîsi Haccâc b. Şâir dahî rivayet etti. (Dediki): Bize Abdüssamed rivayet etti. (Dediki): Bize Harb rivayet etti. (Dediki): Bize Yahya —ki İbni Ebî Kesîr'dir—- rivayette bulundu. (Dediki): Bana Abdurrahman b. Amr rivayet ettiki, Muhammed b. Fâtıme binti Resûlullâh kendisine bu isnadla yukarıkilerin hadîsleri gibi rivayette bulunmuş",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4173,
			"arabicnumber": "1622.04",
			"text": "Bana Hârûn b. Saîd El-Eylî ile Ahmed b. Isa da rivayet ettiler. (Dedilerki): Bize İbni Vehb rivayet etti. (Dediki): Bana Amr —ki İbni'l-Hâris'dir— Bükeyr'den naklen haber verdi. O da Saîd b. EI-Müseyyeb'i: Ben İbni Abbas'i şunları söylerken dinledim derken işitmiş: Ben ResûluIIah (Sallallahu Aleyhi ve Sellem)'i: «Bir sadaka verip de sonra sadakasından dönen kimsenin misâli, kusup da sonra kusmuğunu yiyen köpek gibidir.» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4174,
			"arabicnumber": "1622.05",
			"text": "Bize bu hadîsi Muhammed b. El-Müsennâ ile Muhammed b. Beşşâr da rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivâyet etti. (Dediki): Bize Şu'be rivayet etti. (Dedi ki); Ben Katâde'yi, Saîd b. El-Müseyyeb'den, o da ibni Abbas'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen onun ; «Hibesinden dönen kusmuğuna dön (üp yiy) en gibidir.» buyurduğunu rivayet ederken dinledim",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4175,
			"arabicnumber": "1622.06",
			"text": "{…} Bize bu hadîsi Muhammed b. El-Müsennâ da rivayet etti. (Dediki): Bize İbni Ebi Adiy, Saîd'den, o da Katâde'den bu isnâdla bu hadisin mislini rivayet etti",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4176,
			"arabicnumber": "1622.07",
			"text": "Bize İshâk b. İbrahim dahî rivayet etti. (Dediki): Bize Mahzunu haber verdi. (Dediki): Bize Vüheyb rivayet etti. (Dediki): Bize Abdullah b. Tavus, babasından, o da İbni Abbas'dan, o da Resûlullah iSallallahu Aleyhi ve Sellem)'ûen naklen rivayette bulundu: «Hibesinden dönen, kusup da sonra kusmuğuna don (erek yiy) en köpek gibidir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4177,
			"arabicnumber": "1623.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, ibni Şihâb'dan dinlediğim, onun da Humeyd b. Abdirrahmân ile Muhammed ,b. Nu'mân b. Beşîr'den, onların da Nu'mân b. Beşir'den naklen rivayet ettikleri şu hadîsi okudum: Nu'mân şunları söylemiş: Babam beni Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirerek: Ben şu oğluma bir kölemi bağışladım, dedi. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Her çocuğuna bunun mislini bağışladın mı?» diye sordu. Babam; hayır, deyince Resûlullah (Sallallahu Aleyhi ve Sellem): «Öyle ise onu dön!» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4178,
			"arabicnumber": "1623.02",
			"text": "Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize lbrahim b. Sa'd, ibni Şihâb'dan, o da Humeyd b. Abdirrahmân ile Muhammed b. Nu'mân'dan, onlar da Nu'mân b. Beşîr'den naklen haber verdi. Nu'mân şöyle demiş: Babam beni Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirerek: Ben şu oğluma bir köle bağışladım; dedi. Bunun üzerine: «Bütün oğullarına da bağışladın mı?» diye sordu. Babam: Hayır! deyince : «Dyle ise onu dön!» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4179,
			"arabicnumber": "1623.03",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile ishâk b. İbrahim ve İbni Ebî Ömer, İbni Uyeyne'den naklen rivayette bulundular. H. Bize Kuteybe ile İbni Rumh da Leys b. Sa'd'dan rivayet ettiler. H. Bana Harmele b. Yahya dahî rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus haber verdi. H. Bize İshâk b. İbrahim ile Abd b. Humeyd de rivayet ettiler. (Dedilerki): Bize Abdürrazzak haber verdi. (Dediki): Bize Ma'mer haber verdi. Bu râvilerin hepsi Zühri'den bu isnâdla rivayette bulunmuşlardır. Yûnus'Ia Ma'mer'in hadîslerinde: «Bütün oğullarına da mı?» ibaresi; Leys ile İbni Uyeyne hadîsinde: «Evlâdının hepsine mi?» cümlesi vardır. Leys'in Muhammed b. Nu'mân ile Humeyd b. Abdirrahman'dan naklettiği rivayette: «Beşir Nu'man'ı getirmiş. denilmiştir",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4180,
			"arabicnumber": "1623.04",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bise Cerîr, Hişâm b. Urve'den, o da babasından naklen rivayette bulundu. Babası şöyle demiş: Bize Nu'mân b. Beşîr rivayet etti. (Dediki): Babası ona bir köle vermişti. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) ona: «Bu köle nedir?» diye sordu. Nu'man: Onu bana babam verdi, dedi. Resûlullah (Sallallahu Aleyhi ve Sellem) (babasına) : «Bunun bütün kardeşlerine de buna verdiğin gibi verdin mi?» dedi. Hayır! cevâbını verince: «Öyle ise onu dön!» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4181,
			"arabicnumber": "1623.05",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti, (Dediki): Bize Abbâd b. El-Avvâm, Huşayn'dan, o da Şa'bî'den naklen rivayet etti. Şa'-bi: Ben Nu'mân b. Beşîr'den işittim, demiş. H. Bize Yahya b. Yahya da rivayet etti. Lâfız onundur. (Dediki): Bize Ebul-Ahvas, Husayn'dan, o da Şa'bî'den, o da Nu'mân b. Beşîr'den naklen rivayet etti. Şöyle demiş: Babam malının bîr kısmını bana tesadduk etti. Bunun üzerine annem Amra biati Ravâha; Resûlullah (Sallallahu Aleyhi ve Sellem)'i şâhid göstermedikçe ben razı olamam, dedi. Babam da sadakama şâhid yapmak için beni Nebi (Sallallahu Aleyhi ve Sellem)'e götürdü. Resûlullah (Sallallahu Aleyhi ve Sellem) ona: «Bunu bütün çocuklarına yaptın mı?» diye sordu. Babam: Hayır: cevabını verdi. Efendimiz: «Allah'tan korkun, çocuklarınız arasında adalet gösterin!» buyurdular. Bunun üzerine babam döndü ve o sadakayı geri aldı",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4182,
			"arabicnumber": "1623.06",
			"text": "Bize Ebû Bekir b. Ett Şeybe rivayet etti. (Dediki): Bize Alî b. Müshir, Ebû Hayyân'dan, o da Şa'bî'den, o da Nu'mân b. Begüm'den naklen rivayet etti. H. Bize Muhammed b, Abdillâh b. Numeyr de rivayet etti. Lâfız onundur. (Dediki): Bize Muhammed b; Bişr rivayet etti. (Dediki): Bize Ebû Hayyân Et-Teymî, Şa'bî'den rivayet etti. (Demişki): Bana Nu'mân b. Beşîr rivayette bulundu ki, Annesi Binti Revâha babasına malından oğluna hibe edilen bâzı şeyleri sormuş. Babası onu bir sene bekletmiş. Sonra aklına pişmanlık gelmiş. Ama kadın: Oğluma hibe ettiğin şeye Resûlullah (Sallallahu Aleyhi ve Sellem)'i şâhid tutmadıkça ben razı olamam, demiş. (Nu'mân diyorki:) Bunun üzerine babam elimden tuttu. O gün ben çocuktum. Beni Resûlullah (Sallallahu Aleyhi ve Sellem)'e götürerek: Yâ Resûlâllah, bunun annesi Binti Revâha, oğluna yaptığım hibeye seni şâhid tutmamı diledi, dedi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Yâ Beşîr, bundan başka çocuğun var mı?» diye sordu. Evet, cevabını alınca: «Hepsine buna yaptığın kadar bağışta bulundun mu?» dedi. Babam (yine) hayır, cevâbını verince: «O halde beni şâhid tutma! Zîrâ ben adaletsizliğe şâhid olamam!» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4183,
			"arabicnumber": "1623.07",
			"text": "Bine İbni Numeyr rivayet etti. (Dediki): Bana babam rivayet etti. (Dediki); İsmail, Şa'bî'den, o da Nu'mân b. Beşîr'den rivayet etti. Şöyle demi;: Resûlullah (Sallallahu Aleyhi ve Sellem) babama: «Senin başka oğulların var mı?» dîye sordu. O: Evet! dedi. Nebi (Sallallahu Aleyhi ve Sellem): «Öyle ise onların her birine buna verdiğin gibi verdin mi?» dedi. Babam: Hayır! dedi. Nebi (Sallallahu Aleyhi ve Sellem); «O halde ben dürüst ve âdil olmayan bir iş üzerine şâhid olmam.» buyurdu",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4184,
			"arabicnumber": "1623.08",
			"text": "Bize ishâk b. İbrahim rivayet etti. (Dediki): Bize Cerîr, i El-Ahvel'den, o da Şa'bî'den, o da Nu'mân b. Beşîr'den naklen haber verdiki, Resûlullah (Sallallahu Aleyhi ve Sellem), babasına: «Beni adaletsizliğe şahid tutma!» demiş",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4185,
			"arabicnumber": "1623.09",
			"text": "Bize Muhammed b. El-Müsennâ rivayet etti. (Dediki): Bize Abdülvehhâb ile Abdülâlâ rivayet ettiler. H. Bize lshâk b. İbrahim ile Ya'kûb Ed-Devraki de hep birden İbni Uleyye'den rivayet ettiler. Lâfız Yâkûb'undur. Dediki: Bize İsmail b. İbrahim, Dâvûd b. Ebî Hind'den, o da Şa'bî'den, o da Nu'mân b. Beşîr'den naklen rivayette bulundu. Şöyle demiş: Babam beni alarak Resulullah (Sallallahu Aleyhi ve Sellem) götürdü ve: Yâ Resulâllah! Şahid ol ki, ben Nu'man'a malımda şunu ve şunu bağışladım, dedi. Bunun üzerine Efendimiz: «Oğullarının hepsine Nu'man'a bağışladığın kadar bağışta bulundun mu?» diye sordu. Hayır! deyince: «Öyle ise buna benden başkasını şahid yap!» buyurdu. Sonra; «Sana iyilik yapma hususunda oğullarının müsâvî olmalarını dilermisin?» diye sordu. Babam: Hay hay! cevâbını verdi. «O halde olmaz!» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4186,
			"arabicnumber": "1623.10",
			"text": "Bize Ahmed b. Osman En-Nevfelî rivayet etti. (Dediki): Bize Ezher rivayet etti. (Dediki): Bize İbni Avn, Şa'bî'den, o da Nu*mân b. Beşir'den rivayet etti. Şöyle demiş: Babam bana bir bağışta bulundu. Sonra şahid yapmak için beni Resûlullah (Sallallahu Aleyhi ve Sellem)'e götürdü. Fahr-i Kâinat Efendimiz: «Bunu bütün çocuklarına verdin mİ?» diye sordu. Babam: Hayır! cevâbını verdi. «Bundan dilediğin kadar, onlardan iyilik dilemez misin?» buyurdu. Babam: Hay hay (dilerim) dedi. «O halde ben şâhid olmuyorum.» buyurdular. (Râvi) İbni Avn diyor ki: Ben bunu Muhammed'e anlattım da: Biz ancak Resûlullah (Sallallahu Aleyhi ve Sellem)'in-: «Çocuklarınız arasında müsavat yapın.» buyurduğunu rivayet ettik, dedi. İzah 1624 te",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4187,
			"arabicnumber": "1624",
			"text": "Bize Ahmed b. Abdillâh b. Yûnus rivayet etti. (Dediki): Bize Zübeyr rivayet etti. (Dediki): Bize Ebu'z-Zübeyr, Câbir'den naklen rivayette bulundu. (Dediki): Beşîr'in karısı; Oğluma köleni bağışla, hem bana Resûlullah (Sallallahu Aleyhi ve Sellem)'i şâhîd getir, demiş. Bunun üzerine Beşîr Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek şunları söylemiş: Filânın kızı benden, oğluna kölemi bağışlamamı istedi ve: Bana Resûlullah (Sallallahu Aleyhi ve Sellem)'i şâhid yap, dedi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Bu çocuğun kardeşleri var mı?» diye sormuş. Beşîr: Evet, demiş. «Buna verdiğinin mislini onların hepsine verdin mi?» buyurmuş. Hayır, cevâbını alınca : «Bu iş yaramaz; ben ancak hak üzerine şâhid olurum!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4188,
			"arabicnumber": "1625.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, İbni Şihâb'dan dinlediğim, onun da Ebû Seleme b. Abdirrahman'dan, onun da Câbir b.' Abdillâh'dan naklettiği şu hadîsi okudum: Resûlullah (Sallallahu Aleyhi ve Sellem) : «Herhangi bir kimseye ve çocuklarına ömürlük bir mülk verilirse o mülk verilen kimsenindir; verene dönmez; çünkü o öyle bir şey vermiştir ki, onda miraslar câri olmuştur.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4189,
			"arabicnumber": "1625.02",
			"text": "Bize Yahya b. Yahya ile Muhammed b. Rumh rivayet ettiler. (Dedilerki): Bize Leys haber verdi. H. Bize Kuteybe de rivayet etti. (Dediki): Bize Leys, İbni Şihâb'dan, o da Ebû Seleme'den, o da Câbir b. Abdillâh'dan naklen rivayet ettiki, şöyle demiş: Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i: «Her kim bir adama ve çocuklarına ömürlük bir mülk verirse, kendi sözü o mülkteki hakkını kesmiştir. Artık o mülk ömürlük olarak verilen kimseye ve çocuklarına aittir.» buyururken işittim. Yalnız Yahya hadisinin başında: «Herhangi bir kimseye bir ömürlük verilirse, artık o mülk onun ve çocuklarının olur.» dedi",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4190,
			"arabicnumber": "1625.03",
			"text": "Bana Abdurrahman b. Bişr El-Abdî rivayet etti. (Dediki): Bize Abdürrazzak haber verdi. (Dediki): Bize İbni Cüreyc haber verdi. (Dediki): Bana İbni Şihâb umrâ ve umranın yolu hakkında Ebû Seleme b. Abdirrahmân hadîsinden naklen haber verdi; ona da Câbir b. Abdillâh El-Ensârî haber vermiş ki, Resûlullah (Sallallahu Aleyhi ve Sellem): «Herhangi bir adam bir kimseye, kendine ve çocuklarına ömürlük bir mülk verir de: Bunu sana ve sizden bîr kişi kaldığı müddetçe çocuklarına verdim, derse; artık o mülk verilen kimsenin olur; sahibine, dönmez; çünkü o öyle bir şey vermiştir ki, onda miraslar câri olmuştur.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4191,
			"arabicnumber": "1625.04",
			"text": "Bize İshâk b. İbrahim ile Abd b. Humeyd rivayet ettiler. Lâfız Abd'indir. (Dedilerki): Bize Abdürrazzâk haber verdi. (Dediki): Bize Ma'mer, Zührî'den, o da Ebû Seleme'den, o da Câbir'den naklen haber verdi. Câbir şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem)'in cevaz verdiği umrâ: «Bu senin ve çocuklarının olsun!» demekle yapılır. Fakat: «Bu mülk yaşadığın müddetçe senin olsun!» derse mülk, sahibine döner: Ma'mer: «Zührî bununla fetva verirdi.» demiş",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4192,
			"arabicnumber": "1625.05",
			"text": "Bize Muhammed b. Râfi' rivayet etti. (Dediki): Bize ibni Ebî Fudeyk, İbni Ebî Zi'b'den, o da İbni Şihâb'dan, o da Ebû Seleme b. Abdirrahmân'dan, o da Câbir'den —ki İbni Abdillâh'dir— naklen rivayette bulundu ki, Resûlullah (Sallallahu Aleyhi ve Sellem): «Kendisine ve çocuklarına ömürlük mülk verilen kimse hakkında : Bu mülk kat'i olarak onundur; veren içîn o mülk hususunda şart ve istisna caiz değildir.» diye hüküm vermiş. Ebû Seleme: «Çünkü bu adam öyle bir şey verdiki, onda miraslar câri olmuş; ve miraslar onun şartını kesmiştir.» demiş",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4193,
			"arabicnumber": "1625.06",
			"text": "Bize Ubeydullah b. Ömer El-Kavârîrî rivayet etti. (Dediki): Bize Hâlid b. Haris rivayet etti. (Dediki): Bize Hişâm, Yahya b. Ebî Kesîr'den rivayet etti. (Demişki): Bana Ebû Seleme b. Abdirrahmân rivayet etti. (Dediki): Ben Câbir b. Abdillâh'ı: Resûlullah (Sallallahu Aleyhi ve Sellem): «Umrâ kime hibe edildi ise onundur.» buyurdu; derken işittim",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4194,
			"arabicnumber": "1625.07",
			"text": "{…} Bize bu hadîsi Muhammed b. El-Müsennâ da rivayet etti. (Dediki): Bize Muâz b. Hişâm rivayet etti. (Dediki): Bana babam, Yahya b. Ebî Kesîr'den rivayet etti. (Dediki): Bize Ebû Seleme b. Abdirrahmân, Câbir b. Abdillâh'dan naklen rivayette bulundu ki, Nebiyyullah (Sallallahu Aleyhi ve Sellem) bu hadîsin mislini söylemiştir",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4195,
			"arabicnumber": "1625.08",
			"text": "{…} Bize Ahmed b. Yûnus rivayet etti. (Dediki): Bize Züheyr rivayet etti. (Dediki): Bize Ebu'z-Zübeyr, Câbir'den Nebi (Sallallahu Aleyhi ve Sellem)'e ref ederek rivayette bulundu",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4196,
			"arabicnumber": "1625.09",
			"text": "Bize Yahya b. Yalıya rivayet etti. Lâfız onundur. (Dediki): Bize Ebû Hayseme, Ebu'z-Zübeyr'den, o da Câbir'den naklen haber verdi, Câbir şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Mallarınızı elinizde tutun;-onları batırmayın; zîra kim bir ömürlük verirse, o mülk ölü iken de, diri iken de verilen kimsenin ve çocuklarının olur!» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4197,
			"arabicnumber": "1625.10",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Muhammed b. Bişr rivayet etti. (Dediki): Bize Haccâc b. Ebi Osman rivayet etti. H. Bize Ebû Bekir b. Ebî Şeybe ile İshâk b. İbrahim, Vekî'dan, o da Süfyân'dan naklen rivayet etti. H. Bize Abdülvâris b. Abdissamed de rivayet etti. (Dediki): Bana babam, dedemden, o da Eyyûb'dan naklen rivayet etti. Bu râvilerin hepsi Ebu'z-Zübeyr'den, o da Câbir'den, o da Nebi (Sallallahu Aleyhi ve Sellem)*den Ebû Hayseme hadîsi mânâsında rivayette bulunmuşlardır. Eyyûb'un hadisinde şu ziyâde vardır: (Dediki): Ensâr muhacirlere ömürlük vermeğe başladılar. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Mallarınızı elinizde tutun!» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4198,
			"arabicnumber": "1625.11",
			"text": "Bana Muhammed b. Râfi' ile İshâk b. Mansûr da rivayet ettiler. Lâfız İbni Râfi'indir. (Dedilerki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize ibni Cüreyc haber verdi. (Dediki): Bana Ebu'z-Zübeyr, Câbir'den naklen haber verdi. Câbir şöyle demiş: Medine'de bir kadın bir bahçesini bir oğluna ömürlük verdi. Sonra oğlu öldü. Arkasından kadın da öldü ve geride bir çocuk bıraktı; bu çocuğun umrâ sahibesinin oğullan olan kardeşleri vardı. Umrâ sahibesinin oğlu bahçe bize dönecek, dedi. Ömürlük verilenin oğulları: Hayır, bahçe hayâtında memâtında babamızındı, dediler; ve Osman'ın azadlısı Tarık'ın huzuruna dâvaya çıktılar. Tarık Câbir'i çağırdı. Câbir umrânın (verilen) sahibine aid olduğuna Resûlullah (Sallallahu Aleyhi ve Sellem) üzerine şehâdet etti. Târik da böylece hüküm verdi. Sonra Abdülmelik'e mektup yazarak ona bu meseleyi ve Câbir'in şâhidliğini haber verdi. Abdülmelik: Câbir doğru söylemiş demiş. Bunun üzerine Târik hükmünü yürürlüğe koydu. Bu bahçe bugüne kadar ömürlük verilenin oğullarına ait kalmıştır",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4199,
			"arabicnumber": "1625.12",
			"text": "Bize Ebû Bekir b. Ebi Şeybe ile İshâk b. İbrahim rivayet ettiler. Lâfız Ebû Bekr'indir. İshâk (Bize haber verdi) tâbirini kullandı. Ebû Bekir: Bize Süfyân b. Uyeyne, Amr'dan, o da Süleyman b. Yesâr'dan naklen rivayet ettiki, Târik, Câbir b. Abdîllâh'ın Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen söylediklerine istînad ederek umrânın mirasçıya aîd olduğuna hüküm vermiş; dedi",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4200,
			"arabicnumber": "1625.13",
			"text": "Bize Muhammed b. El-Müsennâ ile Muhammed b. Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Katâde'yi Atâ'dan, o da Câbir b. Abdillâh'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivâyette bulunurken dinledim. (Efendimiz) : «Umrâ caizdir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4201,
			"arabicnumber": "1625.14",
			"text": "Bize Yahya b. Habîb El-Hârisî rivayet etti. (Dediki): Bize Hâlid yâni Îbni'l-Hâris rivayet etti. (Dediki): Bize Saîd, Katâde'den, o da Ata'dan, o da Câbir'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayette bulundu ki: «Umrâ, sahibine mirastır.» buyurmuşlar. İzah 1626 da",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4202,
			"arabicnumber": "1626.01",
			"text": "Bize Muhammed b. EI-Müsennâ ile İbni Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Katâde'den, o da Nadr b. Enes'den, o da Beşîr b. Nehîk'den, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti: «Umrâ caizdir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4203,
			"arabicnumber": "1626.02",
			"text": "{…} Bana bu hadîsi Yahya b. Habîb de rivayet etti. (Dediki): Bize Hâlid yâni İbni'I-Hâris rivayet etti. (Dediki): Bize Said, Katâde'den bu isnâdla rivayette bulundu; yalnız o ya: «Ehline mirastır.» yâhud: «Caizdir.» dedi",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 41
			}
		}
	]
}