{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"24": "The Book of Gifts"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4163,
			"arabicnumber": "1620.01",
			"text": "(Bize Abdullah b. Mesleme b. Ka'neb rivâyet etti. ki): Bize Mâlik b. Enes, Zeyd b. Eşlem'den, o da babasından naklen rivâyet etti ki, Ömer b. Hattâb şunları söylemiş: cins bir atımı Hak yolunda tesadduk ettim. Az sonra sahibi onu ziyan etmiş. Ben onu ucuza satacağını anlayarak Resûlüllah (sallallahü aleyhi ve sellem)'e hükmünü sordum da: ne sahn al, ne de sadakandan dön; zira sadakasından donen kusmuğuna dön (üp yiy) en köpek gibidir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4164,
			"arabicnumber": "1620.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4165,
			"arabicnumber": "1620.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4166,
			"arabicnumber": "1620.04",
			"text": "Bize bu hadisi Kuteybe b. Saîd ile İbn Rumh dahi hep birden Leys b. Sa'd'dan rivâyet ettiler. H. El-Mukaddemî ile İbn'l-Müsennâ da rivâyet ettiler. (Dediler ki): Bize Yahya —ki El-Kattân'dır— rivâyet etti. H. İbn Nümeyr de rivâyet etti. ki): Bize babam rivâyet etti. H. Ebû Bekr b. Ebî Şeybe dahi rivâyet etti. ki): Bize Ebû Üsâme rivâyet etti. râvilerin hepsi Ubeydullah'dan ve ikisi Nâfi'den, o da İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)’den Mâlik'in hadîsi gibi rivâyette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4167,
			"arabicnumber": "1621.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlik'e, Nâfi'den dinlediğim, onun da İbn Ömer'den naklen rivâyet ettiği şu hadîsi okudum: . .. j b. El-Hattâb bir atını Hak yolunda tesadduk etmiş. Sonra onun satılacağını anlamış da satın almak istemiş; ve Resûlüllah (sallallahü aleyhi ve sellem)'e bu meseleyi sormuş. Efendimiz: satın almal Sadakandan da dönme!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4168,
			"arabicnumber": "1621.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4169,
			"arabicnumber": "1621.03",
			"text": "(Biz» bu hadîsi Ebû Küreyb Muhammed b. Ala' da rivâyet etti. ki): Bize İbn’l-Mubârek, Evzâî'den naklen haber verdi. Evzâî: Ben Muhammed b. Alî b. Hüseyn'i bu isnâdla bu hadîs gibi rivâyette bulunurken İşittim; demiş",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4170,
			"arabicnumber": "1622.01",
			"text": "(Bana bu hadîsi Haccâc b. Şâir dahi rivâyet etti. ki): Bize Abdüssamed rivâyet etti. ki): Bize Harb rivâyet etti. ki): Bize Yahya —ki İbn Ebî Kesîr'dir—- rivâyette bulundu. ki): Bana Abdurrahman b. Amr rivâyet etti ki, Muhammed b. Fâtıme binti Resûlillâh kendisine bu isnadla yukarıkilerin hadîsleri gibi rivâyette bulunmuş",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4171,
			"arabicnumber": "1622.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4172,
			"arabicnumber": "1622.03",
			"text": "Bize bu hadîsi Muhammed b. El-Müsennâ ile Muhammed b. Beşşâr da rivâyet ettiler. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be rivâyet etti. ki); Ben Katâde'yi, Saîd b. El-Müseyyeb'den, o da İbn Abbâs'dan, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen onun ; dönen kusmuğuna dön (üp yiy) en gibidir.» buyurduğunu rivâyet ederken dinledim",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4173,
			"arabicnumber": "1622.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4174,
			"arabicnumber": "1622.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4175,
			"arabicnumber": "1622.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4176,
			"arabicnumber": "1622.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4177,
			"arabicnumber": "1623.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4178,
			"arabicnumber": "1623.02",
			"text": "(Bize Yahya b. Yahya da rivâyet etti. ki): Bize lb-rahim b. Sa'd, İbn Şihâb'dan, o da Humeyd b. Abdirrahmân ile Muhammed b. Nu'mân'd an, onlar da Nu'mân b. Beşîr'den naklen haber verdi. Nu'mân Şöyle dedi: Babam beni Resûlüllah (sallallahü aleyhi ve sellem)'e getirerek: Ben şu oğluma bir köle bağışladım; dedi. Bunun üzerine: oğullarına da bağışladın mı?»diye sordu. Babam: Hayır! deyince: ise onu dön!» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4179,
			"arabicnumber": "1623.03",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe rivâyet etti, ki): Bize Abbâd b. El-Avvâm, Huşa yn'dan, o da Şa'bî'den naklen rivâyet etti. Şa'-bf: Ben Nu'mân b. Beşîr'den işittim, demiş. H",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4180,
			"arabicnumber": "1623.04",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Cerîr, Hişâm b. Urve'den, o da babasından naklen rivâyette bulundu. Babası Şöyle dedi: Bize Nu'mân b. Beşîr rivâyet etti. ki): Babası ona bir köle vermişti. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) ona: kol» nedir?» diye sordu. Nu'man: Onu bana babam verdi, dedi. Resûlüllah (sallallahü aleyhi ve sellem) (babasına): butun kardeşlerine de buna verdiğin gibi verdin mi?» dedi. Hayır! cevâbını verince: ise onu dön!» Duyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4181,
			"arabicnumber": "1623.05",
			"text": "(Bize Ebû Bekir b. Ebi Şeybe rivâyet etti. ki): Bize Alî b. Müshir, Ebû Hayyân'dan, o da Şa'bî'den, o da Nu'mân b. Begümden naklen rivâyet etti. H",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4182,
			"arabicnumber": "1623.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4183,
			"arabicnumber": "1623.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4184,
			"arabicnumber": "1623.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4185,
			"arabicnumber": "1623.09",
			"text": "(Bize Muhammed b. El-Müsennâ rivâyet etti. ki): Bize Abdülvehhâb ile Abdülâlâ rivâyet ettiler. H. İshâk b. İbrahim ile Ya'kûb Ed-Devraki de hep birden İbn Uleyye'den rivâyet ettiler. Lâfız Yâkûb'undur. ki: Bize İsmail b. İbrahim, Dâvûd b. Ebî Hind'den, o da Şa'bî'den, o da Nu'mân b. Beşîr'den naklen rivâyette bulundu. Şöyle dedi: beni alarak Resûlüllah (sallallahü aleyhi ve sellem) götürdü re: Resûlüllah! Şahid ol ki, ben Nu'man'a malımda şunu ve şunu bağışladım, dedi. Bunun üzerine Efendimiz: hepsine Nu'man'a bağışladığın kadar bağışta bulundun mu?» diye sordu. Hayır! deyince: ise buna benden başkasını şahid yap!» buyurdu. Sonra; İyilik yapma hususunda oğullarının müsâvî olmalarını diler misin?» diye sordu. Babam: Hay hay! cevâbını verdi. «O halde olmaz!» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4186,
			"arabicnumber": "1623.10",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4187,
			"arabicnumber": "1624",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4188,
			"arabicnumber": "1625.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4189,
			"arabicnumber": "1625.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4190,
			"arabicnumber": "1625.03",
			"text": "(Bana Abdurrahman b. Bişr El-Abdî rivâyet etti. ki): Bize Abdürrazzak haber verdi. ki): Bize İbn Cüreyc haber verdi. ki): Bana İbn Şihâb umrâ ve ümranın yolu hakkında Ebû Seleme b. Abdirrahmân hadîsinden naklen haber verdi; ona da Câbir b. Abdillâh El-Ensârî haber vermiş ki, Resûlüllah (sallallahü aleyhi ve sellem): bir adam bir kimseye, kendine ve çocuklarına ömürlük bir milk verir de: Bunu sana ve sizden bir kişi kaldığı müddetçe çocuklarına verdim, derse; artık o milk verilen kimsenin olur; sahibine, dönmez; çünkü o Öyle bir şey vermiştir ki onda miraslar câri olmuştur.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4191,
			"arabicnumber": "1625.04",
			"text": "Bize İshâk b. İbrahim ile Abd b. Humeyd rivâyet ettiler. Lâfız Abd'indir. (Dediler ki): Bize Abdürrazzâk haber verdi. ki): Bize Ma'mer, Zührî'den, o da Ebû Seleme'den, o da Câbir'den naklen haber verdi. Câbir Şöyle dedi: (sallallahü aleyhi ve sellem)’in cevaz verdiği umrâ: senin ve çocuklarının olsun!» demekle yapılır. Fakat: milk yaşadığın müddetçe senin olsun!» derse milk, sahibine döner: bununla fetva verirdi.» demiş",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4192,
			"arabicnumber": "1625.05",
			"text": "(Bize Muhammed b. Râfi' rivâyet etti. ki): Bize İbn Ebî Füdeyk, İbn Ebî Zi'b'den, o da İbn Şihâb'dan, o da Ebû Seleme b. Abdirrahmân'dan, o da Câbir'den —ki İbn Abdillâh'dir— naklen rivâyette bulundu ki, Resûlüllah (sallallahü aleyhi ve sellem): ve çocuklarına ömürlük milk verilen kimse hakkında: Bu milk kati olarak onundur; veren için o milk hususunda şart ve istisna caiz değildir.» diye hüküm vermiş. Seleme: «Çünkü bu adam öyle bir şey verdi ki, onda miraslar câri olmuş; ve miraslar onun şartmı kesmiştir.» demiş",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4193,
			"arabicnumber": "1625.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4194,
			"arabicnumber": "1625.07",
			"text": "(Bize bu hadîsi Muhammed b. El-Müsennâ da rivâyet etti. ki): Bize Muâz b. Hişâm rivâyet etti. ki): Bana babam, Yahya b. Ebî Kesîr'den rivâyet etti. ki): Bize Ebû Seleme b. Abdirrahmân, Câbir b. Abdillâh'dan naklen rivâyette bulundu ki, Nebiyyullah (sallallahü aleyhi ve sellem) bu hadîsin mislini söylemiştir",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4195,
			"arabicnumber": "1625.08",
			"text": "(Bize Ahmed b. Yûnus rivâyet etti. ki): Bize Züheyr rivâyet etti. ki): Bize Ebû'z-Zübeyr, Câbir'den Peygamber (sallallahü aleyhi ve sellem)'e ref ederek rivâyette bulundu",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4196,
			"arabicnumber": "1625.09",
			"text": "(Bize Yahya b. Yahya rivâyet etti. Lâfız onundur. ki): Bize Ebû Hay seme, Ebû'z-Zübeyr'den, o da Câbir'den naklen haber verdi, Câbir Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): elinizde tutun;-onları batırmayın; zîra kim bir örn urluk verirse, o mitle ölü iken de, diri iken de verilen kimsenin ve çocuklarının olur!» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4197,
			"arabicnumber": "1625.10",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe rivâyet etti. ki): Bize Muhammed b. Bişr rivâyet etti. ki): Bize Haccâc b. Ebi Osman rivâyet etti. H. Ebû Bekir b. Ebî Şeybe ile İshâk b. İbrahim, Vekî'dan, o da Süfyân'dan naklen rivâyet etti. H. Abdülvâris b. Abdissamed de rivâyet etti. ki): Bana babam, dedemden, o da Eyyûb'dan naklen rivâyet etti. râvilerin hepsi Ebû'z-Zübeyr'den, o da Câbir'den, o da Peygamber (sallallahü aleyhi ve sellem)’den Ebû Hayseme hadîsi mânâsında rivâyette tutunmuşlardır. hadisinde şu ziyâde vardır: ki): Ensâr muhacirlere ömürlük vermeğe başladılar. Bunun üzerine Resûlülah (sallallahü aleyhi ve sellem): elinizde tutun!» buyurdular",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4198,
			"arabicnumber": "1625.11",
			"text": "Bana Muhammed b. Râfi' ile İshâk b. Mansûr da rivâyet ettiler. Lâfız İbn Râfü'ndir. (Dediler ki): Bize Abdürrazzâk rivâyet etti. ki): Bize İbn Cüreyc haber verdi. ki): Bana Ebû'z-Zübeyr, Câbir'den naklen haber verdi. Câbir Şöyle dedi: bir kadın bir bahçesini bir oğluna ömürlük verdi. Sonra oğlu öldü. Arkasından kadın da öldü ve geride bir çocuk bıraktı; bu çocuğun umrâ sahibesinin oğullan olan kardeşleri vardı. Umrâ sahibesinin oğlu bahçe bize dönecek, dedi. Ömürlük verilenin oğulları: Hayır, bahçe hayâtında1 memâtında babamızındı, dediler; ve Osman'ın azadlısı Tarık'ın huzuruna dâvaya çıktılar. Tarık Câbir'i çağırdı. Câbir umrânm (verilen) sahibine aid olduğuna Resûlüllah (sallallahü aleyhi ve sellem) üzerine şehâdet etti. Târik da böylece hüküm verdi. Sonra Abdülmelik'e mektup yazarak ona bu meseleyi ve Câbir'in şâhidliğini haber verdi. Abdülmelik: Câbir doğru söylemiş demiş. Bunun üzerine Târik hükmünü yürürlüğe koydu. Bu bahçe bugüne kadar Ömürlük verilenin oğullarına ait kalmıştır",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4199,
			"arabicnumber": "1625.12",
			"text": "Bize Ebû Bekir b. Ebi Şeybe ile İshâk b. İbrahim rivâyet ettiler. Lâfız Ebû Bekr'indir. İshâk (Bize haber verdi) tâbirini kullandı. Ebû Bekir: Bize Süfyân b. Uyeyne, Amr'dan, o da Süleyman b. Yesâr’dan naklen rivâyet etti ki, Târik, Câbir b. Abdîllâh'ın Resûlüllah (sallallahü aleyhi ve sellem)’den naklen söylediklerine istînad ederek ura-rânın mirasçıya aîd olduğuna hüküm vermiş; dedi",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4200,
			"arabicnumber": "1625.13",
			"text": "Bize Muhammed b. El-Müsennâ ile Muhammed b. Beşşâr rivâyet ettiler. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be rivâyet etti. ki): Katâde'yi Atâ'dan, o da Câbir b. Abdillâh'dan, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen rivâyetet bulunurken dinledim. (Efendimiz): caizdir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4201,
			"arabicnumber": "1625.14",
			"text": "(Bize Yahya b. Habîb El-Hârisî rivâyet etti. ki): Bize Hâlid yani İbn'l-Hâris rivâyet etti. ki): Bize Saîd, Katâde’den, o da Ata'dan, o da Câbir'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen rivâyette bulundu ki: sahibine mirastır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4202,
			"arabicnumber": "1626.01",
			"text": "Bize Muhammed b. El-Müsennâ ile İbn Beşşâr rivâyet ettiler. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be, Katâde'den, o da Nadr b. Enes'den, o da Beşîr b. Nehîk'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)'-'den naklen rivâyet etti: caizdir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4203,
			"arabicnumber": "1626.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 24,
				"hadith": 41
			}
		}
	]
}