{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4398,
			"arabicnumber": "1684.01",
			"text": "Bize Yahya b. Yahya ile İshfik b. İbrahim ve ibni Ebî Ömer rivayet ettiler. Lâfız Yahya'nındır, ibni Ebî Ömer: Bize rivayet etti ta'bîrini kullandı. Ötekiler: Bize Siifyân b. Uyeyne Zührî'den, o da Aınra'dan, o da Aişe'den naklen haber verdi, dediler. Aişe şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) çeyrek altında ve fazlasında hırıızın elini keserdi",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4399,
			"arabicnumber": "1684.02",
			"text": "{…} Bize İshâk b. İbrahim ile Abd b. Humeyd de rivayet ettiler. (Dedilerki): Bize Abdûrrazzak haber verdi. (Dediki): Bize Ma'mer haber verdi. H. Bize Ebû Bekir b. Ebî Şeybe dahi rivayet etti. (Dediki): Bize Yezîd b. Hârûn rivayet etti. (Dediki): Bize Süleyman b. Kesir ile İbrahim b. Sa'd haber verdi. Bunların hepsi Zühri'den bu hadîsin mislini bu isnâdda rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4400,
			"arabicnumber": "1684.03",
			"text": "Bana Ebû't-Tâhir ile Harmele b. Yahya rivayet ettiler. (Dedilerki): Bize Velîd b. Şucâ' dahî rivayet etti. Lâfız Velîd ile Harmele'nindir. (Dedilerki): Bize İbni Vehb rivayet etti. (Dediki): Bana Yûnus, İbni Şihâb'dan, o da Urve ile Amra'dan, onlar da Âişe'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi. «Hırsızın eli ancak çeyrek altında veya daha fazlada kesilir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4401,
			"arabicnumber": "1684.04",
			"text": "Bana Ebû't-Tâhir ile Hârûn b. Saîd El-Eylî ve Ahmed b. İsa rivayet ettiler. Lâfız Harun ile Ahmed'indir. Ebû't-Tâhir: Bize haber verdi ta'bîrini kullandı. Ötekiler: Bize İbni Vehb rivayet etti dediler. (Demişki): Bana Mahrame, babasından, o da Süleyman b. Yesâr'dan, o da Amra'dan, o da Âişe'yi rivayet ederken dinlemiş olmak üzere haber verdi, ki Âişe Resûlullah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken dinlemiş: «El ancak çeyrek altında ve onun yukarısında kesilir.»",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4402,
			"arabicnumber": "1684.05",
			"text": "Bana Bişr b. Hakem El-Abdî rivayet etti. (Dediki): Bize Abdülâzîz b. Muhammed, Yezid b. Abdillâh b. Hâd'dan, o da Ebû Bekir b. Muhammed'den, o da Amra'dan, o da Âişe'den naklen rivayet etti ki, Âişe Peygamber (Sallallahu Aleyhi ve Sellem)'i: «Hırsızın eli ancak çeyrek altında ve daha fazlada kesilir.» buyururken işitmiş",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4403,
			"arabicnumber": "1684.06",
			"text": "{…} Bize İshâk b. İbrahim ile Muhammed b. El-Müsennâ ve İshâk b. Mansûr toptan Ebû Âmir El-Akadî'den rivayet ettiler. (Dedilerki): Bize Misver b. Mahreme oğullarından Abdullah b. Ca'fer, Yezîd b. Abdillâh b. Hâd'dan bu isnâdla bu hadîsin mislini rivayet etti",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4404,
			"arabicnumber": "1685.01",
			"text": "Bize Muhammed b. Abdillâh b. Nuraeyr rivayet etti. (Dediki): Bize Humeyd b. Abdirrahmân El-Ruâsî, Hişâm b. Urve'den, o da babasından, o da Âişe'den naklen rivayet etti. Âişe şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) zamanında hırsızın eli çelik veya deriden mamul bir kalkan kıymetinden —ki İkisi de kıymet sahibidir— daha azda kesilmemiştir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4405,
			"arabicnumber": "1685.02",
			"text": "{…} Bize Osman b. Ebî Şeybe de rivayet etti. (Dediki): Bize Abde b. Süleyman ile Humeyd b. Abdirrahmân haber verdiler. H. Bize Ebû Bekir b. Ebi Şeybe dahî rivayet etti. (Dediki): Bize Abdurrahîm b. Süleyman rivayet etti. H. Bize Ebû Kureyb de rivayet etti. (Dediki): Bize Ebû Usâme rivayet etti. Bu râvilerin hepsi Hişâm'dan bu isnâdla ibni Numeyr'in, Humeyd b. Abdirrahmân Er-Ruasî'den naklettiği hadis gibi rivayette bulunmuşlardır. Abdurrahîm ile Ebû Usâme'nin hadîslerinde: O gün o kıymet sahibi idi.» cümlesi de vardır. İzah 1687 de",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4406,
			"arabicnumber": "1686.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, Nâfî'den dinlediğim, onun da İbni Ömer'den naklen rivayet ettiği şu hadîsi okudum: Resûlullâh (SalIallahu Aleyhi ve Sellem) bir hırsızın elini, kıymeti üç dirhem olan bir kalkandan dolayı kesmiştir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4407,
			"arabicnumber": "1686.02",
			"text": "{…} Bize Kuteybe b. Saîd île İbni Rumh, Leys b. Sa'd'dan rivayet ettiler. H. Bize Züheyr b. Harb ile Îbni'l-Müsennâ dahî rivayet ettiler. (Dedilerki): Bize Yahya —ki El-Kattân'dır— rivayet etti. H. Bize İbni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize Ebû Bekir b. Ebî Şeybe de rivayet etti, (Dediki): Bize Aliy b. Müshir rivayet etti. Bunların hepsi Ubeydullah'dan rivayet etmişlerdir. H. Bana Züheyr b. Harb dahî rivayet etti. (Dediki): Bize İsmail (yâni İbni Uleyye) rivayet etti. H. Bize Ebû'r-Rabî' ile Ebû Kâmil de rivayet ettiler. (Dedilerki): Bize Hammâd rivayet etti. H. Bana Muhammed b. Râfi' dahî rivayet etti, (Dediki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize Süfyân, Eyyûb-i Sahtiyanı ile Eyyûb b. Mûsâ ve İsmail b. Ümeyye'den naklen haber verdi. H. Bana Abdullah b. Abdirrahmân Ed-Dârimî de rivayet etti. (Dediki): Bize Ebû Nuaym haber verdi. (Dediki): Bize Süfyân, Eyyûb ile İsmâîl b. Ümeyye'den ve Ubeydullah ile Mûsâ b. Ukbe'den rivayet etti. H. Bize Muhammed b. Râfi' dahî rivayet etti. (Dediki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize İbni Cüreyc haber verdi. (Dediki): Bana İsmâîl b. Ümeyye haber verdi. H. Bana Ebû't-Tâhir de rivayet etli. (Dediki): Bize İbni Vehb, Hanzale b. Ebi Süfyân El-Cümahî ile Ubeydullah b. Ömer, Mâlik b. Enes ve Usâme b. Zeyd El-Leysî'den naklen haber verdi. Bu râvİIerin hepsi Nâfi'den, o- da İbni Ömer'den, o da Peygamber (Sallallahu Aleyhi ve Sellem)'den naklen Yahya'nın, Mâlîk'den naklettiği hadîs gibi rivayette bulunmuşlardır. Şu kadar var ki, bazısı (sadece) «kıymeti» demiş; bazıları: «kıymeti üç dirhem olan» demişlerdir. İzah 1687 de",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4408,
			"arabicnumber": "1687.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Ebû Kureyb rivayet ettiler. (Dedilerki): Bize Ebû Muâviye, A'meş'den, o da Ebû Sâlih'den, o da Ebû Hureyre'den naklen rivayet etti. Ebû Hureyre göyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Allah hırsıza lanet eylesin! Bir yumurtayı çalar da eli kesilir; ipi çalar da eli kesilir!» buyurdular",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4409,
			"arabicnumber": "1687.02",
			"text": "{…} Bize Amrû'n-Nâkıd ile ishâk b. İbrahim ve Aliy b. Haşrem hep birden îsâ b. Yûnus'dan, o da A'meş'den naklen bu isnâdla bu hadîsin mislini rivayet ettiler. Yalnız o: «Bir ip çalsa... ve bir yumurta çalsa...» diyormuş. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4410,
			"arabicnumber": "1688.01",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Leys rivayet etti. H. Bize Muhammed b. Rumh da rivayet etti. (Dediki): Bize Ley», İbni Şihâb'dan, o da Urve'den, o da Âişe'den naklen haber verdi ki : Hırsızlık eden Mahzûmiyye kadının hâli Kureyş'i üzmüş; ve : Bunun hakkında Resûlullah (Sallallahu Aleyhi ve Sellem)'le kim konuşacak? demişler : (Bâzıları) : Buna kim cesaret edebilir! Meğer ki Resulullah (Sallallahu Aleyhi ve Sellem)'in habîbi Umâme ola! demişler. Bunun üzerine onunla Usâme konuşmuş. Resûlullah (Sallallahu Aleyhi ve Sellem): «Allah'ın hadlerinden bîr hadd hakkında şefaat mı ediyorsun?» buyurmuş. Sonra ayağa kalkarak hutbe okumuş ve şunları söylemiş : «Ey nâs! Sizden öncekileri (Allah) ancak şunun için helak etmiştir ki, onlar aralarından şerefti biri hırsızlık ederse onu bırakırlar; zayıf olan çalarsa üzerine haddi tatbik ederlerdi. Allah'a yemin olsun ki. Muhammed'in kızı Fâtıme hırsızlık etse mutlaka elini keserdim!..» İbni Rumh'un hadîsinde : «Sizden öncekiler helak oldu.» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4411,
			"arabicnumber": "1688.02",
			"text": "Bana Ebû't-Tâhir ile Harmele b. Yahya da rivayet ettiler. Lâfız Harmele'nindir. (Dedilerki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus b. Yezîd, İbni Şihâb'dan naklen haber verdi. (Demişki): Bana Urve b. Zübeyr, Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Âişe'den naklen haber verdi ki: Nebi (Sallallahu Aleyhi ve Sellem) zamanında Fetih gazasında hırsızlık eden kadının hali Kureyş'i üzmüş de : Bunun hakkında Resulullah (Sallallahu Aleyhi ve Sellem)'le kim konuşacak? demişler. (Bâzıları): Buna kim cesaret edebilir! Meğer ki Resûlullah (Sallallahu Aleyhi ve Sellem)'in habîbi Usâme ola! demişler. Bunun üzerine kadın Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirilerek onun hakkında kendileri ile Usâme b. Zeyd konuşmuş. Derken Resûlullah (Sallallahu Aleyhi ve Sellem)'in yüzü renklenmiş; ve : «Allah'ın hadlerinden bir hadd hakkında şefâaf mı ediyorsun?» buyurmuş. Bunun üzerine Usâme kendilerine : — Benim için mağfiret dile yâ Resûlâllah! demiş. Akşam olunca Resûlullah (Sallallahu Aleyhi ve Sellem) ayağa kalkarak hutbe okumuş: Allah'a gerektiği gibi senada bulunmuş. Sonra şunları söylemiş: «Bundan sonra (malum ola ki) : (Allah) sizden öncekileri ancak şunun için helak etmiştir ki, onlar aralarından şerefli biri hırsızlık ederse onu bırakırlar; zayıf olan çalarsa üzerine haddi tatbik ederlerdi. Hiç şüphe yoîc ki ben —nefsim yed-i kudretinde bulunan Allah'a yemin olsun!— Muhammed'İn kızı Fâtıme hırsızlık etse mutlaka elini keserdim!» Bundan sonra emir buyurmuş ve hırsızlık eden o kadının eli kesilmiş. Yûnus şunları söylemiş: İbni Şihâb dedi ki: Urve şunu söyledi: Aişc: — Sonraları kadın güzelce tevbe etti; ve evlendi. Bu işten sonra bana gelir; ben de onun hacetini Resûlullah (Sallallahu Aleyhi ve Sellem)'e arz ederdim.» dedi",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4412,
			"arabicnumber": "1688.03",
			"text": "Bize Abd b. Humeyd dahî rivayet etti. (Dediki): Bize Abdürrazzâk haber verdi. (Dediki): Bize Ma'mer, Zührî'den, o da Urve'den, o da Aişe'den naklen haber verdi. Şöyle demiş: «Mahzûm kabilesinden bir kadın eşyayı âriyeten alır; ve bunu inkâr ederdi. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) elinin kesilmesini emir buyurdu. Derken ailesi Usâme b. Zeyd'e gelerek onunla konuştular. O da kadın hakkında Resûlullah (Sallallahu Aleyhi ve Sellem) le konuştu.» Bundan sonra râvi hadîsi, Leys ve Yûnus hadîsi gibi rivayet etmiştir. İzah 1689 da",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4413,
			"arabicnumber": "1689",
			"text": "Bana Seleme b. Şebîb de rivayet etti. (Dediki): Bize Hasen b. A'yen rivayet etti. (Dediki): Bize Ma'kıl, Ebû'z-Zübeyr'den, o da Câbir'den naklen rivayet etti ki, Benî Mahzûm kabilesinden bir kadın hırsızlık etmiş de Nebi (Sallallahu Aleyhi ve Sellem)'e getirilmiş; ve hemen Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Ümmü Seleme'ye sığınmış. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): «Vallahi bu kadın Fâtıme olsa mutlaka elini keserdim!» buyurmuş; ve kadının eli kesilmiş",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4414,
			"arabicnumber": "1690.01",
			"text": "Bize Yahya b. Yahya Et-Temîmî rivayet etti. (Dediki): Bize Hüseyin, Mansûr'dan, o da El-Hasen'den, o da Hıttân b. Abdillâh Er-Rakaaşî'den, o da Ubâde b. Sâmit'den naklen haber verdi. Ubâde şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Benden Öğrenin! Benden öğrenin!.. Allah o (kadı) nlara (çıkar) bir yol haIketti. Bekârla bekâr (zina ederse) yüz dayakla bir sene sürgün; evli ile evliye yüz dayak ve recim (var!)» buyurdular",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4415,
			"arabicnumber": "1690.02",
			"text": "{…} Bize Amru'n-Nâkıd da rivayet etti. (Dediki): Bize Hüseyni rivayet etti. (Dediki): Bize Mansûr bu isnâdla bu hadîsin mislini haber verdi",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4416,
			"arabicnumber": "1690.03",
			"text": "Bize Muhammed b. El-Müsennâ ile İbni Beşşâr hep birden Abdülâlâ'dan rivayet ettiler. İbni'I-Müsennâ (Dediki): Bize Abdil-âla rivayet etti. (Dediki): Bize Saîd, Katâde'den, o da El-Hasen'dcn, o da Hittân b. Abdillâh Er-Rakaaşî'den, o da Ubâde b. Sâmil'den naklen rivayet ettî. Şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem) üzerine vahy indirildiği zaman bundan dolayı gussalamr ve yüzü rengini atardı. Bir gün kendisine vahy indirildi de yine böyle oldu. Açıldığı vakit: «Benden öğrenin! Allah o (kadı) nlara (çıkar) bir yol haIk etti. Evli ile evli, bekârla bekâr!.. Eliyle yüz dayak... sonra taşlarla recim! Bekâra yüz dayak... sonra bir sene sürgün!..» buyurdu",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4417,
			"arabicnumber": "1690.04",
			"text": "Bize Muhammed b. El-Müsennâ ile İbni Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. H. Bİze Muhammed b. Beşşar da rivayet etti. (Dediki): Bize Muâz b. Hişâm rivayet etti. (Dediki): Bana babam rivayet eyledi. Bu râvilerin ikisi de Katâde'den bu isnadla rivayette bulunmuşlardır. Yalnız onların hadîsinde: «Bekâra dayak vurulur ve sürgün edilir. Evli ise döğülerek recmolunur.» ibaresi vardır. Sene ve yüz kelimelerini zikretmezler. İzah «Benden öğrenin» diye terceme ettiğimizt cümlesinin lügat mânâsı: «Benden alın!» demekse de bu cümle «an» edatı ile kullanılırsa: Benden öğrenin, benden nakledin! mânâsına gelir. ResûIallah (Sallallahu Aleyhi ve Sellem): «Allah onlara çıkar bir yol halketti...» buyurmakla Teâlâ Hazretlerinin : «Ölüm canlarını alıncaya yahut Allah kendilerine çıkar bir yol halkedinceye kadar o (kadı) nları evlerde tutun!» âyet-i kerîmesine işaret ederek çıkar yolun bu olduğunu anlatmıştır. Ulemâ bu âyet hakkında ihtilâf etmişlerdir. Bazılarına göre muhkemdir; bu hadîs onu tefsir etmiştir. Bir takımları Nûr sûresinin ilk âyeti ile neshedildiğini söylemiş; başkaları Nûr âyetinin bekârlar hakkında, bunun da evliler hususunda nazil olduğunu bildirmişlerdir. Bekârdan murâd: Henüz sahîh nikâhla cima' etmemiş âkil baliğ ve hür olan kimsedir. Ömründe bir defa olsun sahîh nikâhla cima' edene Araplar «seyyib» derler. Bu kelime Türkçede evli ve dul mânâlarına gelir. Aynı mânâda «muhsan» kelimesi de kullanılır. Zina eden bekâra yüz dayak, evliye recim cezası verileceği hususunda ulemâ ittifak etmişlerdir. Keadî İyâd'ın beyanına göre bu meselede ehl-i kıbleden bir tek muhalif çıkmamış; yalnız Hariciler'le Mu'tezile'den Nazzâm ve arkadaşları recme kail olmamışlardır. Recim: Bir kimseyi taşlayarak öldürmektir. Zina eden muhsana recimle birlikte dayak cezası verilip verilmiyeceğinde ihtilâf olunmuştur. Bir kısım ulemâya göre bunların ikisi de tatbîk edilir. Hz. Alî (Radiyallahu anh)'in, Hasan-ı Basrî, îshâk b. Râhuye ve Zahirîler'le bâzı Şâfiîler'in kavli budur. Cumhûr-u ulemâya göre yalnız recimle iktifa edilir. Delilleri: Peygamher Ayet : Beyine, delil, alamet. 'in muhsanı sadece recmettiğini bildiren hadîslerdir. Muhsan hakkında hem recim hem dayak cezası verileceğini bildiren hadîs mensuhtur. İlk zamanlarda tatbîk edilmiş; sonra hükmü kalkmıştır. Bekâr zânînin sürgün edilip edilmiyeceği meselesi de ihtilaflıdır. Şâfiîlerle diğer birçok ulemâya göre bekâr zânî erkek olsun kadın olsun dayaktan sonra bir sene sürgün edilir. Hanefîler'le diğer ulema sürgüne muhaliftirler. Delilleri Kur'ân-ı Kerîm'in zahiridir. Âyette sürgünden bahsedilmemiştir. îmam Mâlik ile Evzâî sürgünün erkeğe mahsus olduğuna kaildirler. Kadın avret olduğu, sürgün ise fitneye sebebiyet vereceği için bu ceza ona tatbik edilmez. Bu kavlin benzeri Hz. Alî (Radiyallahu anh)'dan da rivayet olunmuştur. Köle ve cariyelere gelince: Onlar recmedilmezler. Çünkü kendilerine verilecek cezanın hürlerinkinin yarısı kadar olacağı nass-ı Kur'ân'la bil­dirilmiştir. Recim ise yarıya bölünen şeylerden değildir. Binâenaleyh Hanefîler'e göre muhsan olmayan köle ve cariyelere ellişer dayak vurulur. îmam Şafiî'den bu hususta üç kavil nakledilmiştir: a) Köle ve câriye birer sene sürgün edilirler. Süfyân-ı Sevrî, Ebû Sevr, Dâvûd-u Zahirî ve İbni Cerîr'in kavilleri de budur. b) Altı ay sürgün edilirler. Çünkü ALLAH Teâlâ onlara hürlerinkinin yarısı kadar ceza ta'yîn etmiştir. Şâfiîler'ce esah olan kavil budur. c) Köle ve cariyeler asla sürgün edilemezler. Hasan-ı Basrî, Hammâd, îmam Mâlik, İmam Ahmed ve îshak’ın mezhepleri de budur. Resûlullah (Sallallahu Aleyhi ve Sellem)'in : «Bekârla bekâr zina ederse... ilâ ahir » sözü şartıyet bildirmek için değil, bekârla muhsanın haddlerini tayin için sevkedilmiştir. Yâni bekâr bir kimse gerek bekâr gerekse evli bir kadınla zina etsin, onun cezası yüz dayakla, bir yıl sürgün; keza evli bir kimse, evli veya bekâr bir kadınla zina etsin, cezası recimdir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4418,
			"arabicnumber": "1691.01",
			"text": "Bana Ebû't-Tâhir ile Harmele b. Yahya rivayet ettiler. (Dedilerki): Bize îbnî Vehb rivayet etti. (Dediki): Bana Yûnus, İbni Şihâb'dan naklen haber verdi. (Demişki): Bana Ubeydullah b. Abdİllâh b. Utbe haber verdi ki, kendisi Abdullah b. Abbâs'ı şunu söylerken işitmiş: Ömer b. Hattâb, Resûlullah (Sallallahu Aleyhi ve Sellem)'in minberi üzerinde otururken şöyle dedi: «Hiç şüphe yok ki Allah, Muhammed (Sallallahu Aleyhi ve Sellem)'i Hak (din) ile göndermiş ve kendisine kitabı indirmiştir. Ona indirilenlerden biri de recim âyetidir. Biz bu âyeti okuduk, belledik ve anladık. Resûlulllah (Sallallahu Aleyhi ve Sellem), recmetti; ondan sonra biz de recmetttk. Ama insanların üzerinden uzun zaman geçerse korkarım biri: Biz Allah'ın kitabında recmi bulamıyoruz, der de Allah'ın indirdiği bir farizayı terk etmekle dalâlete düşerler : Gerçekten erkek ve kadınlardan zina eden kimse üzerine —muhsan olmak, beyyine veya gebelik yahut i'tirâf bulunmak şartı ile— recim Allah'ın kitabında haktır",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4419,
			"arabicnumber": "1691.02",
			"text": "{…} Bize bu hadisi Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb ve İbni Ebî Ömer de rivayet ettiler. (Dedilerki) Bize Süfyân, Zührî'den bu isnadla rivayet etti",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4420,
			"arabicnumber": "1691.03",
			"text": "Bana Abdülmelik b. Şuayb b. Leys b. Sa'd rivayet etti. (Dediki): Bana babam, dedemden rivayet etti. (Demişki): Bana Ukayl, İbni Şihâb'dan, o da Ebû Seleme b. Abdirrahmân b. Avf ile Saîd b. El-Müseyyeb'den, onlar da Ebû Hureyre'den naklen rivayet etti ki, Ebû Hureyre şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem)'e mescidde iken müslümanlardan bir adam geldi ve kendilerine seslenerek: Yâ Resûlâllah, ben zina ettim; dedi. Resûlullah (Sallallahu Aleyhi ve Sellem) ondan yüzünü çevirdi. Fakat adam yüzünü çevirdiği tarafa dönerek kendilerine (tekrar) : Yâ Resûlâllah, ben zina ettim; dedi. Ondan yine yüzünü çevirdi. Tâ ki bunu dört defa tekrarladı. Adam kendi aleyhine dört defa şehâdette bulununca Resûlullah (Sallallahu Aleyhi ve Sellem) kendisini çağırdı; ve: «Sende delilik var mı?» diye sordu. Adam: — Hayır! cevâbını verdi. «Hiç evlendin mi?» diye sordu. Adam: — Evet! dedi. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Bunu götürün de recmedin!» buyurdular. İbni Şihâb (Demişki): Bana Câbir b. Abdillâh'ı dinleyen biri haber verdi. Câbir: «Onu recmedenler arasında ben de vardım. Onu musalla'da recmettik. Taşlar kendisini yaraladığı zaman kaçtı. Fakat biz ona Harra'da yetişerek kendisini recmettik.» diyormuş",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4421,
			"arabicnumber": "1691.04",
			"text": "Bu hadîsi Leys dahi Abdurrahmân b. Hâlid b. Müsâfir'den, o da İbn Şihâb'dan bu isnadla bunun gibi rivâyet etti",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4422,
			"arabicnumber": "1691.05",
			"text": "(Bana bu hadisi Abdullah b. Abdirrahmân Ed-Dârimî de rivâyet etti. ki): Bize Ebû'l-Yemân rivâyet etti. ki): Bize Şuayb, Zührî'den yine bu isnâdla haber verdi. ikisinin hadîsinde Ukayl'in zikrettiği gibi: «İbn Şihâb ki): Bana Câbir b. Abdillâh'ı dinleyen biri haber verdi.» ibaresi vardır",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4423,
			"arabicnumber": "1691.06",
			"text": "{…} Bana Ebû't-Tâhir ile Harmele b. Yahya da rivayet ettiler. (Dedilerki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus haber verdi. H. Bize İshâk b. İbrahim dahi rivayet etti. (Dediki): Bize Abdürrazzâk haber verdi. (Dediki): Bize Ma'mer ile İbni Cüreyc haber verdi. Bu râvilerin hepsi Zührî'den, o da Ebû Seleme'den, o da Câbir b. Abdillâh'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen Ukayl'in, Zührî'den, onun da Saîd ile Ebû Seleme'den, onların da Ebû Hureyre'den naklettikleri gibi rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4424,
			"arabicnumber": "1692.01",
			"text": "Bana Ebû Kâmil Fudayl b. Huseyn El-Cahderî rivayet etti. (Dediki): Bize Ebû Avâne, Simâk b. Harb'dan, o da Câbir b. Semura'dan naklen rivayet etti. Şöyle demiş : Mâiz b. Mâlik'i Nebi (Sallallahu Aleyhi ve Sellem)'e getirildiği vakit gördüm. Kısa tıknaz bir adam! üzerinde cübbe yok! Zina ettiğine nefsi aleyhine dört defa şâhidlik etti. Resûlullah (Sallallahu Aleyhi ve Sellem): «Olabilir ki sen...» buyurdu. Mâiz: — Hayır vallahi! Bu alçak gerçekten zina etti... dedi. Bunun üzerine onu recmetti(rdi). Sonra hutbe okuyarak: «Dikkat! Biz Allah yolunda her gazaya gidişimizde bunlardan biri kalır; onun teke melemesi gibi bir meleyişi vardır. Bunlardan biri (karıya) bir şeyler veriri.. Beri bakın! Vallahi, Allah bunlardan bîri hakkında bana imkân verse bu işten dolayı onu mutlaka İbretlik ederdim!..» buyurdular",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4425,
			"arabicnumber": "1692.02",
			"text": "Bize Muhammed b. El-Müsennâ ile İbni Beşşâr da rivayet ettiler. Lafız İbni'l-Müsennâ'nındır. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Simâk b. Harb'dan rivayet etti. (Demişki): Câbir b. Semura'yı şunları söylerken işittim: Resûlullah (Sallallahu Aleyhi ve Sellem)'e kısa, dağınık saçlı, adaleli bir adam getirdiler. Üzerinde bir gömlek vardı; zina etmişti. Nebi (Sallallahu Aleyhi ve Sellem) onu iki defa reddetti. Sonra emir verdi de recm-olundu. Müteakiben Resûlullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdular: «Biz Allah yolunda her gazaya gittiğimizde biriniz kalır; teke meleyişi gibi meler; o karılardan birine bir şeyler verir! Allah bunlardan biri hakkında bana imkân vermez ki!.. Yoksa onu ibret yapardım! (Yahut: Onu tenkil ederdim!» Simâk demiş ki: Ben bu hadîsi Saîd b. Cübeyr'e rivayet ettim de: Nebi (Sallallahu Aleyhi ve Sellem) onu dört defa reddetti... dedi",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4426,
			"arabicnumber": "1692.03",
			"text": "{…} Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Şebâbe rivayet etti. H. Bize İshâk b. İbrahim de rivayet etti. (Dediki): Bize Ebû Âmir El-Akadî haber verdi. Bunların ikisi de Şu'be'den, o da Simâk'den, o da Câbir b. Semûra'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den İbni Ca'fer'in hadîsi gibi rivayette bulunmuşlardır. Şebâbe: «Onu iki defa reddetti.» cümlesinde İbni Ca'fer'e muvafakat etmiştir. Ebû Âmir'in hadîsinde: «Onu iki yahut üç defa reddetti.» ibaresi vardır. İzah 1696 da",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4427,
			"arabicnumber": "1693",
			"text": "Bize Kuteybe b. Saîd ile Ebû Kâmil El-Cahderî rivayet ettiler. Lâfız Kuteybe'nindir. (Dedilerki): Bize Ebû Avâne, Simâk'den, o da Saîd b. Cübeyr'den, o da İbni Abbâs'dan naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) Mâiz b. Mâlik'e : «Senin hakkında kulağıma gelen doğru mudur?»diye sormuş. Mâiz: — Benim hakkımda duyduğun nedir? demiş. «Duydum ki filân oğullarının cariyesi ile cinsî münasebette bulunmuşsun!» buyurmuşlar. Mâiz: — Evet! demiş. Bunun üzerine kendisi dört defa şehâdette bulunmuş. Sonra emir buyurarak recmolunmuş. İzah 1696 da",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4428,
			"arabicnumber": "1694.01",
			"text": "Bana Muhammed b. El-Müsennâ rivayet etti. (Dediki): Bana Abdüla'Iâ rivayet etti. (Dediki): Bize Dâvûd, Ebû Nadra'dan, o da Ebû Sad'den naklen rivayet etti ki, Eslem kabilesinden Mâiz b. Mâlik denilen bir adam Resûlüllah (Sallallahu Aleyhi ve Sellem)'e gelerek: — Ben bir kötülük işledim; onun haddini bana vur! demiş. Peygamber (Sallallahu Aleyhi ve Sellem) kendisini birkaç defa reddetmiş. Râvi diyor ki: Sonra kavmine sordu. Onlar: — Biz onu zararsız biliriz; yalnız başına bir iş geldi ki, ondan kendisini badd vurulmaktan başka bir şey kurtaramayacağını sanıyor! dediler. Müteakiben (Mâiz) Nebi (Sallallahu Aleyhi ve Sellem)'e: döndü. O da bize kendisini recmetmemizi emir buyurdu. Onu Bakî-i Garkad'e götürdük. Kendisini ne bağladık, ne de kuyu kazdık. Ona kemik, topaç ve tuğla parçaları attık. Koşmaya başladı. Biz de arkasından koştuk. Nihayet Harra kenarına geldi ve karşımıza dikildi. Biz de kendisine Harra'nın kayalarını (yâni taşları) attık; nihayet sustu. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) akşamlayın hutbe okumak üzere ayağa kalktı ve : «Acaba biz Allah yolunda her gazaya gittikçe çoluk çocuğumuz arasında, teke meleyişi gibi melemesi olan bir adam kalacak mı! Şu boynuma borç olsun ki, Bunu yapan bir adam bana getirilmeye görsün! Yoksa onu (âleme) ibret yaparım!» buyurdular. Artık onun için ne istiğfar etti, ne de söğdü",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4429,
			"arabicnumber": "1694.02",
			"text": "Bana Muhammed b. Hatim rivayet etti. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Yezîd b. Zürey' rivayet etti. (Dediki): Bize Dâvûd bu isnâdla bu hadîsin mânâsı gibi rivayette bulundu. Bu hadîste şunu da söyledi: Derken akşamsı Nebi (Sallallahu Aleyhi ve Sellem) ayağa kalkarak Allah'a hamdü sena etti. Sonra şöyle buyurdular: «Bundan sonra! Acep bâzı kavimlere ne oluyor ki, biz gazaya gittiğimiz vakit bunlardan, teke melemesi gibi meleyişi olan birisi arkamızda kalıyor!..» «Çoluk çocuğumuz arasında» demedi",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4430,
			"arabicnumber": "1694.03",
			"text": "{…} Bize Süreye b. Yûnus da rivayet etti. (Dediki): Bize Yahya b. Zekeriyyâ b. Ebî Zaide rivayet etti. H. Bize Ebû Bekir b. Ebi Şeybe dahî rivayet etti. (Dediki): Bize Mııâviye b. Hişâm rivayet etti. (Dediki): Bize Süfyân rivayet etti. Bu râvilerin ikisi de Dâvûd'dan bu isnâdla bu hadîsin bir kısmını rivayet etmişlerdir. Yalnız Süfyân'ın hadîsinde : «Ve zinayı üç defa i'tîrâf etti.» ibaresi vardır. İzah 1696 da",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4431,
			"arabicnumber": "1695.01",
			"text": "Bize Muhammed b. El-AIâ' El-Hemdânî rivayet etti. (Dediki): Bize Yahya b. Ya'lâ —kî İbni'l-Hâris El-Muhâribî'dir— Gaylân'dan (bu zât Câmiu'l-Muhâribî'nin oğludur.), o da Alkame b. Mersed'den, o da Süleyman b. Büreyde'den, o da babasından naklen rivayet etti. Babası şöyle demiş: Mâiz b. Mâlik Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: — Yâ Resûlâllah! Beni temizle! dedi. Bunun üzerine: «Vah sana! Dön de Allah'tan mağfiret dîlel Ona tevbe et!» buyurdu. (Mâiz) uzağa gitmemek üzere geri döndü. Sonra gelerek: — Yâ Resûlâllah! Beni temizle! dedi. Resulullah (Sallallahu Aleyhi ve Sellem) tekrar: «Vah sana! Dön de Allah'tan mağfiret dile! Ona tevbe et!» buyurdu. Mâiz yine uzağa gitmemek üzere geri döndü. Sonra gelerek: — Yâ Resûlâllah! Beni temizle! dedi. Nebi (Sallallahu Aleyhi ve Sellem) ona : «Seni ne hususta temizliyeyim?» diye sordu. Mâiz: — Zina'dan! dedi. Bunu müteâkib Resulullah (Sallallahu Aleyhi ve Sellem): «Bunda delilik var mı?» diye sordu. Kendilerine onun deli olmadığı haber verildi. «Şarab içmiş mi?» diye sordu. Hemen bir zât kalkarak onun ağzını kokladı; fakat şarap kokusu bulamadı. Resulullah (Sallallahu Aleyhi ve Sellem) tekrar: «Sen zina mı ettin?» diye sordu. Mâiz: — Evet! cevâbını verdi. Artık emir buyurdular ve Mâiz recmedildi. Onun hakkında cemaat iki fırka olmuştu. Kimisi: Helak oldu! Onu günahı kuşattı!., diyor; bazısı da: Mâiz'in tevbesinden efdal tevbe olmaz.!.. Zira o Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek elini onun eline koydu. Sonra: Benî taşlarla öldür! dedi... diyordu. Bu minval üzere iki veya üç gün durdular. Bilâhare onlar otururken Resûlullah (Sallallahu Aleyhi ve Sellem) gelerek selâm verdi ve oturdu. Arkacığından: «Mâiz b. Mâlik için istiğfar edin!» buyurdular. Ashâb: — Allah Mâiz b. Mâlik'e mağfiret eylesin! dediler. Resûlullah (Sallallahu Aleyhi ve Sellem) de : «Gerçekten öyle bir tevbe etti ki, bu tevbe bir ümmet arasında taksim edilse onlara yeterdi.» buyurdu. Sonra Ezd kabilesinin Gâmid kolundan bir kadın geldi; ve : — Ya Resûlâllah! Beni temizle! dedi. «Vah sana!.. Dön de Allah'tan mağfiret dile! Ona tevbe et!» buyurdular,. Kadın: Görüyorum beni, Mâiz'i çevirdiğin gibi geri çevirmek istiyorsun, dedi. «Ne oldu sana?» diye sordu. Kadın kendisinin zinadan gebe olduğunu söyledi. Bunun üzerine: «Sen mi?» buyurdu. Kadın : — Evet! cevâbını verdi. Ona: «Karnındakini doğuruncaya kadar...» buyurdular. Derken kadın doğuruncaya kadar geçimini Ensârdan bir zât üzerine aldı. Bilâhare Peygamber (Sallallahu Aleyhi ve Sellem)'e gelerek: — Gâmid'li kadın doğurdu; dedi. Efendimiz : «O halde onu recmedip de çocuğunu küçük olduğu halde emzirecek kimsesiz bırakamayız!» buyurdu. Bunun üzerine Ensâr'dan bir zât ayağa kalkarak: — Çocuğun bakımı bana âid olsun ya Nebiyyaîlah! dedi. O da kadını recmetti(rdi)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4432,
			"arabicnumber": "1695.02",
			"text": "Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Abdullah b. Numeyr rivayet etti. H. Bize Muhammed b. Abdillâh b. Numeyr dahî rivayet etti. Hadîsin lâfzı hususunda birbirlerine yakındırlar. (Dediki): Bize babam rivayet etti. (Dediki): Bize Büşeyr b. El-Muhâcîr rivayet etti. (Dediki): Bize Abdullah b. Büreyde, babasından naklen rivayet etti ki: Mâiz b. Mâlik El-Eslemî, Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek : — Yâ Resûlâllah! Ben nefsime zulmettim; zina ettim. Beni temizlemeni dilerim! demiş. Nebi (Sallallahu Aleyhi ve Sellem) onu geri çevirmiş. Ertesi gün olunca (tekrar) gelerek: — Yâ Resûlâllah! Ben gerçekten zina ettim! demiş. O da kendisini ikinci defa geri çevirmiş. Derken Resûlullah (Sallallahu Aleyhi ve Sellem) onun kavmine haber göndererek : «Bunun aklında yadırgadığınız bir kusur biliyor musunuz?» diye sormuş. — Biz onu ancak aklı başında, kendi görüşümüze göre sulehâmızdan biliriz! cevabını vermişler. Mâiz üçüncü defa (tekrar) gelmiş. Resûlullah (Sallallahu Aleyhi ve Sellem) yine kavmine haber göndererek onu soruşturmuş. Onlar da : — Ne kendinde bir kusur vardır, ne aklında! diye haber vermişler Dördüncü gün gelince onun için bir çukur kaz(dır)nuş: Sonra emir buyurarak recmedilmiş. Bilâhare Gâmid'li kadın gelmiş; ve : — Yâ Resûlâllah! Ben zina ettim, imdi beni temizle! demiş. Peygamber (Sallallahu Aleyhi ve Sellem) onu da geri çevirmiş. Ertesi gün gelince kadın : — Yâ Resûlâllah! Beni neye geri çeviriyorsun? Galiba beni, Mâiz'i Çevirdiğin gibi geri çevireceksin! Vallahi ben gebeyim! demiş. Efendimiz: «Olmazsa haydi doğuruncaya kadar git (buradan!) » buyurmuşlar. Kadın doğurduğu zaman çocuğu bir bez parçası içinde getirmiş; ve : — İşte! Onu doğurdum; demiş. (Yine) : «Git de bu çocuğu sütten kesilinceye kadar emzîr!» buyurmuş. Kadın onu memeden ayırdıktan sonra çocuğu, elinde bir parça ekmek olduğu halde getirmiş ve: — İşte yâ Nebiyyâllah! Onu memeden ayırdım. Yemek yemeğe de başladı... demiş. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) çocuğu müslümanlardan birine vermiş. Sonra emir buyurarak kadın için göğsüne kadar bir çukur kazılmış. Cemaate de emir vermiş ve kadını recmetmişler. Hâlid b. Velîd bir taşla gelerek başına atmış da kan Hâlid'in yüzüne sıçramış; Hâlid de ona söğmüş. Nebi (Sallallahu Aleyhi ve Sellem) onun kadına söğdüğünü işiterek: «Yavaş ol yâ Hâlid! Nefsim yed-i kudretinde olan Allah'a yemîn ederim! Bu kadın öyle bir tevbe etti ki, onu bir baççı yapsaydı mutlaka mağfiret olunurdu!» buyurmuşlar. Sonra kadın (in ihzarın) ı emrederek cenazesini kılmış ve kadın defnedilmiş. İzah 1696 da",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4433,
			"arabicnumber": "1696.01",
			"text": "Bana Ebû Gassân Mâlik b. AbdiIvâhİd El-Mismaî rivayet etti. (Dediki): Bize Muâz (yâni İbni Hişâm) rivayet etti. (Dediki): Bana babam, Yahya b. Ebî Kesirden rivayet etti. (Demişki): Bana Ebû Kılâbe rivayet etti. Ona da Ebû'l-Mühelleb, İmrân b. Husayn'dan naklen rivayet etmiş ki, Cüheyne (kabilesin) den bîr kadın zinadan gebe olarak Nebi (Sallallahu Aleyhi ve Sellem)'e gelmiş ve: — Yâ Nebiyyâllah! Ben haddi hak ettim. Onu bana tatbik ediver! demiş. Nebiyyullah (Sallallahu Aleyhi ve Seliem) de velîsini çağırarak: «Buna iyi bak, doğurduğu zaman onu bana getir!» buyurmuş. Velisi de öyle yapmış. Bunun üzerine Nebiyyullah (Sallallahu Aleyhi ve Sellem) kadın hakkında emir vererek üzerine elbisesi bağlanmış. Sonra emir buyurarak recmedilmiş; ve cenazesini kılmış. Ömer kendisine : — Bunun cenazesini kılacak mısın yâ Nebiyyâllah? Halbuki zina etmiştir; demiş. Efendimiz: «Gerçekten o öyle bir tevbe etti kî, bu tevbe Medinelilerden yetmiş kişi arasında taksim edilse onlara yeterdi. Sen Allah için canını vermekten daha faziletli bir tevbe gördün mü?» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4434,
			"arabicnumber": "1696.02",
			"text": "{…} Bize bu hadîsi Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Affân b. Müslim rivayet etti. (Dediki): Bize Ebân El-Attâr rivayet etti. (Dediki): Bize Yahya b. Ebî Kesir bu isnadla bu hadîsin mislini rivayet etti",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4437,
			"arabicnumber": "1699.01",
			"text": "Bana Hakem b. Mûsâ Ebû Salih rivayet etti. (Dediki): Bize Şuayb b. İshak rivayet etti. (Dediki): Bize UbeyduIIah, Nâfi'den naklen haber verdi. Ona da Abdullah b. Ömer haber vermiş ki, Resûlullah (Sallallahu Aleyhi ve Sellem)'e zina etmiş bir yahudi erkekle bir yahudi kadın getirmişler. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) kalkarak yahudilere gelmiş ve: «Zina eden bir kimseye siz Tevrat'ta ne (ceza) buluyorsunuz?» diye sormuş. Yahudiler: — Yüzlerini karaya boyar; kendilerini yük üzerine bindirir; yüzlerini birbirlerine ters döndürürüz ve (sokaklarda) dolaştırılırlar! demişler. «Doğru söylüyorsanız o halde Tevrat'ı getirin!» buyurmuş. Yahudiler hemen Tevrat'ı getirerek okumuşlar. Recim âyetine gelince, okuyan genç elini recim âyetinin üzerine koymuş ve onun evvelindekini ve sonundakini okumuş. Abdullah b. Selâm —ki Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte bulunuyormuş. (Efendimize) : — Buna emir buyur da elini kaldırsın! demiş. Yahudi elini kaldırınca bakmışlar ki altında recm âyeti var! Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) her ikisi için de emir vererek recmedilmişler. Abdullah b. Ömer: — Ben de onları recmedenler arasında idim. Yemin olsun yahûdînin kadını kendi vücudu ile koruduğunu gördüm! demiş",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4438,
			"arabicnumber": "1699.02",
			"text": "Bize Züheyr b. Harb da rivayet etti. (Dediki): Bize İsmail (yâni İbni Uleyye), Eyyûb'dan rivayet etti. H. Bana Ebû't-Tâhir dahî rivayet etti. (Dediki): Bize Abdullah b. Vehb haber verdi. (Dediki): Bana ehl-i ilimden bâzı zevat haber verdi ki, Mâlik b. Enes de onlardan biridir. Onlara da Nâfi', İbni Ömer'den naklen haber vermiş ki, Resûlullah (Sallallahu Aleyhi ve Sellem) zina sebebi ile iki yahudiyi recmetmiş. Zina eden bir erkekle bir kadını! Yahudiler onları Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirmişler... Raviler hadîsi yukarı ki hadîs gibi nakletmişlerdir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4439,
			"arabicnumber": "1699.03",
			"text": "{…} Bize Ahmed b. Yûnus da rivayet etti. (Dedikî): Bize Züheyr rivayet etti. (Dediki): Bize Mûsâ b. Ukbe, Nâfi'den, o da İbni Ömer'­den naklen rivayet etti ki, Yahudiler içlerinden zina eden bir erkekle bir kadını Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirmişler... Ravi hadîsi, Ubeydullah'ın Nâfi'den rivayeti tarzında nakletnıiştir. İzah 1702 de",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4440,
			"arabicnumber": "1700.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4441,
			"arabicnumber": "1700.02",
			"text": "{…} Bize İbni Numeyr ile Ebû Saîd El-Eşecc rivayet ettiler. (Dedilerki): Bize Vekî' rivayet etti. (Dediki): Bize A'meş bu isnâdla bu hadisin mislini: -Ve emir vererek yahudi recmolundu.» cümlesine kadar rivayet etti. Ama ondan sonra âyetin inmesi kısmını anmadı. İzah 1702 de",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4442,
			"arabicnumber": "1701.01",
			"text": "mükerr ancak hem Arapça orjinalde hem türk nüshasında böyle!!! Bana Hârûn b. Abdillâh da rivayet etti. (Dediki): Bize Haccâc b. Muhanmed rivayet etti. (Dediki): İbni Cüreyc şunu söyledi: Bana Ebû'z-Zübeyr haber verdi ki, kendisi Câbir b. Abdillâh'ı şöyle derken işitmiş: — Nebi (Sallallahu Aleyhi ve Sellem) Eslem (kabilesin)'den bir adamla, yahudîlerden bîr erkek ve kadınını recmetti",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4443,
			"arabicnumber": "1701.02",
			"text": "{…} Bize İshâk b. İbrahim rivayet etti. (Dediki): Bize Ravh b. Ubâde haber verdi. (Dediki): Bize İbni Cüreyc bu isnadla bu hadîsin mislini rivayet etti. Yalnız o: «Bir de kadın» demiştir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4444,
			"arabicnumber": "1702",
			"text": "Bize Ebû Kâmil El-Cahderî rivayet etti. (Dediki): Bize Abdülvâhtd rivayet etti. (Dediki): Bize Süleyman Eş-Şeybânî rivayet etti. (Dediki): Ben Abdullah b. Ebî Evfa'ya sordum. H. Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. Lâfız onundur. (Dediki): Bize Aliy b. Mtishir, Ebû İshâk Eş-Şeybânî'den rivayet etti. (Demişki): Abdullah b. Ebî Evfa'ya: Resûlullah (Sallallahu Aleyhi ve Sellem) hiç recim yaptı mı? diye sordum. — Evet! cevabım verdi. — Nûr sûresi indirildikten sonra mı, ondan önce mi? dedim. — Bilmiyorum! dedi",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4445,
			"arabicnumber": "1703.01",
			"text": "Bana îsâ b. Hammâd El-Mısri rivayet etti. (Dediki): Bize Leys, Saîd b. Ebî Saîd'den, o da babasından, o da Ebû Hureyre'den naklen haber verdi, ki onu şöyle derken işitmiş: Ben Resûlullah (Sallellahu Aleyhi ve Sellem): «Birinizin cariyesi zina eder de zinası sübut bulursa ona (lâyık olan) haddi vursun! Ama (suçunu) başına kakmasın! Sonra yine zina ederse ona (lâyık olan) haddi vursun! Fakat (suçunu) başına kakmasın! Sonra üçüncü defa tekrar zina eder de zinası sübût bulursa artık onu velev kıldan bir ip mukabilinde olsun salıversin!» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4446,
			"arabicnumber": "1703.02",
			"text": "Bize Ebû Bekir b, Ebî Şeybe ile İshâk b. İbrahim hep bîrden İbni Uyeyne'den rivayet ettiler. H. Bize Abd b. Humeyd de rivayet etti. (Dediki): Bize Muhammed b. Bekr El-Bursânî haber verdi. (Dediki): Bize Hişâm b. Hassan haber verdi. Bunların ikisi de Eyyûb b. Musa'dan rivayet etmişlerdir. H. Bize Ebû Bekir b. Ebî Şeybe dahî rivayet etti. (Dediki): Bize Ebû Usâme ile İbni Numeyr, Ubeydullah b. Ömer'den rivayet ettiler. H. Bana Hârûn b. Saîd El-Eylî de rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Usâme b. Zeyd rivayet etti. H. Bize Hennâd b. Seriy ile Ebû Kureyb ve İshâk b. İbrahim de Abde b. Süleyman'dan, o da Muhammed b. İshâk'dan naklen rivayet ettiler. Bu râvilerin hepsi Said El-Makburî'den, o da Ebû Hureyre'den, o da Peygamber (Sallallahu Aleyhi ve Sellem)'den naklen rivayette bulunmuşlardır. Şu kadar var ki İbni İshâk kendi hadîsinde: «Saîd'den, o da babasından, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen üç defa zina ettiği vakit cariyeye dayak atılması hususun, da: «Sonra dördüncüde onu satsın!» demiştir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4447,
			"arabicnumber": "1703.03",
			"text": "Bize Abdullah b. Meslemete'l-Ka'nebî rivayet etti. (Dediki): Bize Mâlik rivayet etti. H. Bize Yahya b. Yahya da rivayet etti. Lâfız onundur. (Dediki): Mâlik'e, İbni Şihâb'dan dinlediğim, onun da Ubeydullah b. Abdillâh'dan, onun da Ebû Hureyre'den naklettiği şu hadîsi okudum: Resûlullah (Sallallahu Aleyhi ve Sellem)'e muhsan olmayan câriye zina ederse hükmü ne olacağı sorulmuş. «Zina ederse ona dayak vurun! Sonra yine zina ederse dayak vurun! Sonra tekrar zina ederse dayak vurun! Sonra onu velev bir dafİr mukabilinde olsun satın!» buyurmuşlar. İbnî Şihâb: «Üçüncüden sonra mı, dördüncüden sonra mı bilmiyorum.» demiş. Ka'nebî kendi rivayetinde şöyle demiştir: «İbni Şihâb: Dafır iptir, dedi.» İzah 1704 te",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4448,
			"arabicnumber": "1704.01",
			"text": "Bize Ebû't-Tâhir de rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Mâlik'i şunları söylerken işittim: Bana İbni Şihâb, Ubeydullah b. Abdillâh b. Utbe'den, o da Ebû Hureyre ile Zeyd b. Hâlid El-Cüheni'den naklen rivayet etti ki, Resûlullah (Sallallahu Aleyhi ve Sellem)'e cariyenin hükmü sorulmuş... Râvi yukarıki iki râvinin hadîsi (1703) gibi rivayette bulunmuş; fakat İbni Şihâb'ın : «Dafîr iptir.» sözünü anmamıştır",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4449,
			"arabicnumber": "1704.02",
			"text": "{…} Bana Amru'h-Nâkıd rivayet etti. (Dediki): Bize Ya'kûb b. İbrahim b. Sa'd rivayet etti. (Dediki): Bana babam, Salih'den rivayet etti. H. Bize Abd b. Humeyd de rivayet etti. (Dediki): Bize Abdurrazzâk haber verdi. (Dediki): Bize Ma'mer haber verdi. Bu râvilerin ikisi de Zührî'den, o da Ubeydullah'dan, o da Ebû Hureyre ile Zeyd b. Hâlid El-Cühenî'den, onlar da Nebi (Sallallahu Aleyhi ve Sellem)'den Mâlik'in hadîsi gibi rivayette bulunmuşlardır. Her ikisinin hadisinde şek, cariyenin üçüncüde mi yoksa dördüncüde mi satılacağı hususundadır",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4450,
			"arabicnumber": "1705.01",
			"text": "Bize Muhammed b. Ebi Bekir El-Mukaddemi rivayet etti. (Dediki): Bize Süleyman Ebû Dâvûd rivayet etti. (Dediki): Bize Zaide, Süddî'den, o da Sa'd b. Ubeyde'den, o da Ebû Abdirrahmân'dan naklen rivayet etti. (Demişki): Ali hutbe okuyarak şunları söyledi: Ey nâs! Memlüklerinize, muhsan olsunlar olmasınlar, haddi tatbik edin! Zîra Resulullah (Sallallahu Aleyhi ve Sellem)'in bir cariyesi zina etti de, ona dayak vurmamı bana emretti. Bir de baktık yeni nifâs olmuş. Ben ona dayak vurursam öldürürüm dîye korktum; ve keyfiyeti Peygamber (Sallallahu Aleyhi ve Sellem)'e andım. Bunun üzerine: «İyi ettin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4451,
			"arabicnumber": "1705.02",
			"text": "{…} Bu hadîsi bize İshâk b. İbrahim de rivayet etti. (Dediki): Bize Yahya b. Âdem haber verdi. (Dediki): Bize İsrail, Süddî'den bu isnâd-la rivayet etti. Yalnız «Memlüklerden muhsan olanı da olmayanı da» cümlesini zikretmedi. O hadîste: «İyileşinceye kadar onu bırak!» cümlesini ziyade etti",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4452,
			"arabicnumber": "1706.01",
			"text": "Bize Muhammed b. El-Müsennâ ile Muhammed b. Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Katâde'yi, Enes b. Mâlik'-den naklen rivayet ederken dinledim ki, Nebi (Sallallahu Aleyhi ve Sellem)'e şarap içmiş bir adam getirmişler de ona iki hurma dalı ile kırk kadar dayak vur (dur) muş. Enes: — Bunu Ebû Bekir de yaptı. Ömer halife olunca insanlarla istişare etti de Abdurrahmân : — Hududun en hafifini seksen (değnek)'i vur! dedi. Bunun üzerine Ömer de onu emretti; demiş",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4453,
			"arabicnumber": "1706.02",
			"text": "{…} Bize Yahya b. Habîb El-Hârisî de rivayet etti. (Dediki): Bize Hâlid (yâni İbni'l-Hâris) rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Bize Katâde rivayet etti. (Dedik): Enes'i: — Resûlullah (Sallallahu Aleyhi ve Sellem)'e bir adam getirdiler... derken işittim. Râvi hadisi yukanki gibi zikretmiştir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4454,
			"arabicnumber": "1706.03",
			"text": "Bize Muhammed b. EI-Müsennâ rivayet etti. (Dediki): Bize Muâz b. Hişâm rivayet etti. (Dediki): Bana babam, Katâde'den, o da Enes b. Mâlik'den naklen rivayet etti ki, Nebiyyullah (Sallallahu Aleyhi ve Sellem) şarap hakkında hurma dalları ve ayakkaplan ile had vurmuş. Sonra Ebû Bekir 40 değnek hadd vurmuş. Ömer halîfe olup insanlar verimli yerlere ve köylere sarkınca: — Şarabın haddi hususunda ne diyorsunuz? diye sormuş. Abdurrahmân b. Avf: — Onu cezaların en hafifi gibi yapman fikrindeyim; demiş. Enes: Ömer de 80 değnek hadd vurdu; demiş",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4455,
			"arabicnumber": "1706.04",
			"text": "{…} Bize Muhammed b. El-Müsennâ rivayet etti. (Dediki): Bize Yahya b. Saîd rivayet etti. (Dediki): Bize Hişâm bu isnâdla bu hadisin mislini rivayet etti",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4456,
			"arabicnumber": "1706.05",
			"text": "Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Vckî' Hişâm'dan, o da Katâde'den, o da Enes'den naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) şarap için ayak kapları ve hurma dalları ile 40 değnek (hadd) vururmuş... Bundan sonra râvi yukarıdakilerin hadisi gibi rivayette bulunmuş yalnız «verimli yerlerle köylere» cümlesini anmamıştır",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4457,
			"arabicnumber": "1707.01",
			"text": "Bize, Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb ve Aliy b. Hucr rivayet ettiler. (Dedilerki): Bize İsmail (yâni İbni Uleyye), İbni Ebî Arûbe'den, o da Abdullah Ed-Dânâc'dan naklen rivayet etti. H. Bize İshâk b. İbrahim El-Hanzali de rivayet etti. Lâfız onundur. (Dediki): Bize Yahya b. Hammâd haber verdi. (Dediki): Bize Abdülaziz b. Muhtar rivayet etti. (Dediki): Bize İbni Âmir Ed-Dânâc'ın âzâdlısı Abdullah b. Feyrûz rivayet etti. (Dediki): Bize Hudayn b. Münzir Ebû Sâsân rivayet etti. (Dediki): Osman b. Affân'a şâhid oldum. Kendisine Velid getirilmişti. Velîd sabah namazını iki rek'at kıldırmış; sonra: Size daha ziyâde edeyim mî? demişti. Onun aleyhine iki zât şehâdet etti. Biri Humran olup şarap içtiğine; diğeri de onu kusarken gördüğüne şehadette bulundu. Bunun üzerine Osman: — Bu adam şarabı içmese kusmazdı! dedi. Ve: Yâ Ali! Kalk da şuna dayak vur! emrini verdi. Alî de: — Kalk yâ Hasan şuna dayak vur! dedi. Hasan : — Sen onun cefâsını, sefasını sürene yükle! dedi. Galiba Osman'a dargındı. Nihayet Alî: — Yâ Abdullah b. Ca'fer! Kalk da şuna dayak vur! dedi. O, dayağı vurdu. Alî de sayıyordu. Kırka varınca : — Kes! dedi. Sonra şunları söyledi. Nebi (Sallallahu Aleyhi ve Sellem) kırk değnek (hadd) vurdu. Ebû Bekir de kırk değnek vurdu, Ömer ise 80 değnek vurdu. Bunların hepsi sünnettir. Ama bence bu daha makbuldür. Aliy b. Hucr kendi rivayetinde şunu ziyâde etti: «İsmail (Dedikî): Ben ondan Dânâc'ın hadîsini de dinledim ama onu bellemedim.» Dikkat izahtan sonra da rivayetler var",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4458,
			"arabicnumber": "1707.02",
			"text": "Bana Muhammed b. Minhâl Ed-Darîr rivayet etti. (Dediki): Bize Yezîd b. Zürey' rivayet etti. (Dediki): Bize Süfyân-ı Sevrî, Ebû Hasîn'den, o da Umeyr b. Saîd'den, o da Alî'den naklen rivayet etti. (Şöyle demiş): Ben bir kimseye hadd vurur da bu sebeple ölürse ona acımam! Yalnız sarhoş müstesna! O Ölürse diyetini veririm. Çünkü Resûlüllah (Sallallahu Aleyhi ve Sellem): onu (n hakkında mazbut bir) sünnet bırakmadı. {…} Bize Muhammed b. El-Müsennâ rivayet etti. (Dediki): Bize Abdurrahmân rivayet etti. (Dediki): Bize Süfyân bu isnâdla bu hadîsin mislini rivayet etti",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4459,
			"arabicnumber": "1707.03",
			"text": "(Bize Muhammed b. El-Müsennâ rivâyet etti. ki): Bize Abdurrahmân rivâyet etti. ki): Bize Sütyân bu isnâdla bu hadîsin mislini rivâyet etti. hadîsi Buhârî, Ebû Dâvûd ve İbn Mâce «Hudûd» bahsinde muhtelif râvilerden tahrîc etmişlerdir. murâd: «Bu hususta mazbut bir miktar tayîn etmedi.» demektir. Alînin bu hadîsi «hadd vurulurken ölen kimsenin diyeti ödenmez.» diyenlerin delilidir. Nevevî'nin beyanına göre bu hususta ulemânın ittifakı vardır. Yalnız ta'zîr edilirken ölen hakkında ihtilâf edilmiştir. Şâfiîler'e göre böylesinin diyeti hâkimin âkılesine ödettirilir. Hâkime de keffâret îcâb eder! Bazıları diyetin Beytülmâlden verileceğini söylemişlerdir. Cumhûr-u ulemaya göre kimsenin bir şey ödemesi lâzım gelmez. hadîsteki cümlesinin doğrusu şeklinde olacağını söylemişlerdir. Nitekim Sahîh-i Buhârî'de öyledir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4460,
			"arabicnumber": "1708",
			"text": "Bize Ahmed b. îsâ rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Amr, Bükeyr b. El-Eşecc'den naklen haber verdi. (Demişki): Bir defa biz Süleyman b. Yesâr'ın yanında otururken aniden Abdurrahmân b. Câbir gelerek onunla konuştu. Derken Süleyman bize dönerek şunları söyledi: Bana Abdurrahmân b. Câbir, babasından, o da Ebî Bürdete'l-Ensârî'den naklen rivayet etti ki Ebû Bürde: Resûlullah (Sallallahu Aleyhi ve Sellem)'i: «Hiç bir kimseye on kamçıdan fazla vurulmaz. Meğer ki Allah'ın haddlerinden bir hadd hakkında ola!» buyururken işitmiş",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4461,
			"arabicnumber": "1709.01",
			"text": "Bize Yahya b. Yahya Et-Temîmî ile Ebû Bekir b. Ebî Şeybe, Amru'n-Nâkıd, İshâk b. İbrahim ve İbni Numeyr hep birden İbni Uyeyne'den rivayet ettiler. Lâfız Amr'ındır. (Dediki): Bize Süfyân b. Uyeyne, Zührî'den, o da Ebû İdrîs'den, o da Ubâde b. Sâmit'den naklen rivayet etti. Ubâde şöyle demiş: Bir mecliste Resulullah (SalIallahu Aleyhi ve Sellem)'le beraberdik. Şöyle buyurdular: «Allah'a hiç bîr şeyi şerik koşmayacağınıza, zina yapmayacağınıza hırsızlık ehniyeceğinize, Allah'ın haram kıldığı nefsi haksız yere öldürtmyeceğinize dair bana bey'at ediyorsunuz. İmdi siz’den her kim sözünde durursa onun ecri Allah'a aiddir. Kim bunlardan birini yapar da o sebeple cezalanırsa bu da onun için keffârettir. Ve kim bunlardan bir şey yapar da Allah onu ört bas ederse onun işi de Allah'a kalmıştır. Dilerse kendisini affeder; dilerse azâb eyler!»",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4462,
			"arabicnumber": "1709.02",
			"text": "Bize Abd b. Humeyd rivayet etti. (Dediki): Bize Abdurrazzâk haber verdi. (Dediki): Bize Ma'mer, Zührî'den bu isnâdla haber verdi. O bu hadiste şunu da ziyade etti: «Arkacığından bize kadınlar ayetini okudu: Mü'min kadınlar Allah'a hiç bir şeyi şerik koşmayacaklarına dâir sana bey'at'a gelirlerse...» [Mümtehine 12]",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4463,
			"arabicnumber": "1709.03",
			"text": "Bana İsmail b. Salim de rivayet etti. (Dediki): Bize Hüşeym haber verdi. (Dediki): Bize Hâlid, Ebû Kilâbe'den, o da Ebû'l-Eş'as Es-San'ânî'den, o da Ubâde b. Sâmit'den naklen haber verdi. Şöyle demiş: Bizden Resûlullah (SalIallahu Aleyhi ve Sellem) kadınlardan aldığı gibi: Allah'a hiç bir şeyi şerik koşmayacağınıza, çalmıyacağınıza, zina etmiyeceğinize, çocuklarınızı öldürmeyeceğinize, birbirimize bühtanda bulunmıyacağımiza dair söz aldı. Ve: «Sizden her kim sözünde durursa onun ecri Allah'a âiddir. Her kim haddi mucip bîr şey yapar da kendisine hadd vurulursa bu onun keffâretidir. Kimi Allah örtbas ederse onun işi de Allah'a kalmıştır. Dilerse kendisini azâb eder; dilerse mağfiret eyler.» buyurdu",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4464,
			"arabicnumber": "1709.04",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Leys rivayet etti. H. Bize Muhammed b. Rumh da rivayet etti. (Dediki): Bize Leys, Yezîd b. Eb! Habîb'den, o da Ebûl-Hayr'dan, o da Sunâbihî'den, o da Ubâde b. Sâmit'den naklen onun şöyle dediğini haber verdi: Ben Resulullah (SalIallahu Aleyhi ve Sellem)'e bey'at eden nakîblerdenim! Ona: Allah'a hiç bir şeyi şerik koşmayacağımıza, zina etmiyeceğimize, çalmayacağımıza, Allah'ın haram kıldığı nefsi haksız yere öîdürmiyeceğimize, yağmacılık yapmayacağımıza ve isyan etmlyeceğimize (dair) bey'at ettik. Bunu yaparsak cennet!.. Bunlardan birinde bozuk çalarsak onun hükmü Allah kalmıştır. İbni Rumh: «Onun hükmü Allah'a kalır.» dedi",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4465,
			"arabicnumber": "1710.01",
			"text": "Bize Yahya b. Yahya ile Muhammed h. Rumh rivayet ettiler. (Dedilerki): Bize Leys haber verdi. H. Bize Kuteybe b. Saîd de rivayet etti. (Dediki): Bize Leys, İbni Şihâb'dan, o da Saîd b. El-Müseyyeb ile Ebû Seleme'den, onlar da Ebû Hureyre'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen onun şöyle buyurduğunu rivayet etti: «Hayvanın yaralaması hederdir. Kuyu da hederdir; ma'den de hederdir. Rikâzda ise beşte bir vardır.»",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4466,
			"arabicnumber": "1710.02",
			"text": "{…} Bize Yahya b. Yahya ile Ebû Bekir b. Ebî Şeybe, Züheyr b. Harb ve Abdülâ'lâ b. Hammad dahî hep birden İbni Uyeyne'den rivayet ettiler. H. Bize Muhammed b. Râfi' de rivayet etti. (Dediki): Bize İshâk (yâni îbni îsâ) rivayet etti. (Dediki): Bize Mâlik rivayet etti. Her iki râvi Zührî'den, Leys'in isnadı ile onun hadîsinin mislini rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4467,
			"arabicnumber": "1710.03",
			"text": "{…} Bana Ebû't-Tâhir ile Harmele de rivayet ettiler. (Dedilerki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus, İbni Şihâb'dan, o da İbnil-Müseyyeb ile Ubeydullah b. Abdillâh'dan, onlar da Ebû Hureyre'den, o da Resulullah (Sallallahu Aleyhi ve Sellem)'den naklen bu hadisin mislini haber verdi",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4468,
			"arabicnumber": "1710.04",
			"text": "Bize Muhammed h. Runıh b. El-Muhâcir rivayet etti. (Dediki): Bize Leys, Eyyûb b. Musa'dan, o da Esved b. EI-Alâ'dan, o da Ebû Seleme b. Abdirrahmân'dan, o da Ebû Hureyre'den, o da Resulullah (Sallallahu Aleyhi ve Sellem)'den naklen onun şöyle .buyurduğunu haber verdi: «Kuyunun yaralaması hederdir; ma'denin yaralaması da hederdir; hayvanın yaralaması da hederdir. Rikâzda ise beşte bir vardır.»",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4469,
			"arabicnumber": "1710.05",
			"text": "{…} Bize Abdurrahmân b. Sellâm El-Cumah! de rivayet etti. (Dediki): Bize Rabi' (yâni İbni Müslim) rivayet etti. H. Bize Ubeydullah b. Muâz dahî rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize İbni Beşşâr da rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. Her iki râvi: Bize Şu'be rivayet etti; demişler; ikisi de Muhammed b. Ziyâd'dan, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsin mislini rivayet etmişler dir",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 72
			}
		}
	]
}