{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 679,
			"arabicnumber": "293.01",
			"text": "Bize Ebu Bekr b. Ebî Şeybe ile Züheyr b. Harb ve İshak b. İbrahim rivayet ettiler. İshak: Bize haber verdi tabirini kullandı. Ötekiler: Bize Cerir Mansur'dan, o da İbrahim'den, o da Esved'den, o da Aişe'den naklen rivayet etti. dediler. Aişe (r.anha) dedi ki: Bizden birimiz ay hali olmuşsa Resulullah (Sallallahu aleyhi ve Sellem)'in ona emri üzerine bir izar (peştamal)a bürünür sonra ona mübaşeret ederdi. Diğer tahric: Buhari, 300 -buna yakın-, 2031 -buna yakın-; Ebu Davud, 268; Tirmizi, 132 -buna yakm-; Nesai, 285, 372; İbn Mace, 636; Tuhfetu'I-Eşraf, 15982",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 680,
			"arabicnumber": "293.02",
			"text": "Bize yine Ebu Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Ali b. Müshir Şeybani'den rivayet etti. H. Bana Ali b. Hucur es-Sa'dî dahî rivayet etti. Lafız onundur. (Dedi ki): Bize Ali b. Müshir haber verdi. (Dediki): Bize Ebu İshak, Abdurrahman b. el-Esved babasından, o Aişe (r.anha)'dan şöyle dediğini nakletti: Bizden herhangi birisi ay hali olduğu zaman Rasulullah (Sallallahu aleyhi ve Sellem) ona ay hali kanının arttığı zamanda bir peştamal sarmasını emreder sonra ona mübaşeret ederdi. (Aişe) dedi ki: Rasulullah (Sallallahu aleyhi ve Sellem)'in kendisine hakim olduğu gibi hanginiz kendisine hakim olabilir ki? Diğer tahric: Buhari, 302; Ebu Davud, 273; İbn Mace, 635; Tuhfetu'l-Eşraf, 16008 AÇIKLAMALAR 294.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 681,
			"arabicnumber": "294",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Halid b. Abdiîlah Şeybani'den o da Abdullah b. Şeddad'dan, o da Meymune'den naklen haber verdi. Meymune dedi ki: Resulullah (Sallallahu aleyhi ve Sellem) hanımları ile ay hali oldukları halde peştamalin üzerinden mübaşeret ederdi. Diğer tahric: Buhari, 303; Ebu Davud, 2167 DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın NEVEVİ ŞERHİ (677-679): Bu babta (678) \"Aişe (r.anha) dedi ki: Bizden birimiz ay hali olduğunda ... hakim olabilir\" hadisi ile \"Meymline (r.anha) dedi ki: ... \" hadisi yer almaktadır. Aişe (r.anha)'dan rivayet edilen hadiste asıl nüshalardaki rivayet \"bizden birimiz ... \" ifadesindeki (.....) fiili (müennesten bahsetmesi dolayısıyla te'li de kullanılması sözkonusu iken) te'siz kullanılmıştır. Bu kullanım da doğru bir kullanımdır çünkü Sibeveyh \"el-Kitab\"ında konu ile ilgili başlıkta bazı Arapların \"bir kadın, dedi\" cümlesinde fiili müenneslik alameti olarak sonunda gelmesi gereken te harfi olmaksızın kullandıklarını nakletmektedir. İşte İmam Sibeveyh böyle bir kullanımı nakletmiş ve bu şekilde bir kullanımın caiz olduğunu belirtmiş bulunmaktadır. Bunu aynı şekilde İmam Ebu'l-Huseyn b. Haruf da nakletmiş, başkaları da zikretmiş bulunmaktadır. Ayrıca hadiste geçen \"kane\"nin burada durum ve olay (kıssa) fiili olması da mümkündür. Yani durum ve vaziyet şöyle idi, demek olur, sonra olayı anlatarak: Bizden birimiz ay hali olunca ... ona emrederdi, demiştir. Allah en iyi bilendir. \"Ay halinin arttığı zamanda\" ay hali kanının çoğaldığı zamanda demektir. (3/203) \"Peştamal bürünmesi\" ise göbeği ve göbeğinden aşağısını diz kapağına ve daha aşağısına kadar örten bir peştamal bağlamasını emrederdi, demektir. Aişe (r.anha)'nın: \"Hanginiz kendisine hakim olabilir\" sözünde \"irb\" kelimesi hemze kesreli olarak kendisi ile faydalandığı organı yani ferci demektir. Bir topluluk ise bunu \"ereb\" olarak rivayet etmişlerdir bu da kendi ihtiyacı anlamındadır. Bu ise cima arzusudur. Maksat ise O aranızda kendisine en ileri derecede hakim olandi. Bu şekilde mübaşerete rağmen harama düşmekten yana kendisinden emin idi. Haram olan iş ise ay hali olan kadının fercine mübaşeretlir. Hatlabi bu rivayeti tercih etmiş, birinci rivayeti reddetmiş ve muhaddislerin bunu bu şekilde nakletmelerini bir kusur olarak değerlendirmiştir. Allah en iyi bilendir. Hayz (ay hali) sözlükteki asıl anlamı akmak demektir. Vadinin seli akacak olursa bunu anlatmak için bu fiil kullanılır. Eıheri, Herevi ve onların dışındaki imamlar şöyle demektedir: Hayz kadının belli vakitlerde kanının akması demektir. Bu kanı kadın rahmi büluğundan sonra akıtır. İstihaza ise kanın zamansız akması demektir. Ay hali kanı rahmi n dibinden çıkar, istihaza kanı ise el-azil denilen ve rahmin ön taraflarında bulunan bir damardan akan kandır. Dilbilginlerinin dediklerine göre hayz, mahiı ve mehaz kelimeleri 'ay hali olmak' demek olup, ay hali olan kadına da \"haiz\" denilir. Bu şekilde sonuna te getirmemek fasih ve meşhur olan söyleyiştir. Cevheri, Ferra'dan \"haiza: ay hali kadın\" söyleyişini de nakletmektedir. Hadat, tehayyadat, dereset, tamiset, ariket, dahiket, nefiset şeklindeki bütün fiiller aynı anlamda (ay hali oldu) demektir. Bazıları da ay hali oldu anlamında ekbarat ve a'sarat kelimelerini de ilave etmişlerdir. Babtaki Hadislerden Çıkarılan Hükümler Ay hali olan kadınla mübaşeret birkaç kısımdır: Birinci kısım: Ay hali olan kadınla fercinde cima ile mübaşeret etmek: Bu Kur'an-ı azimuşşanın nassı ve sahih sünnet ile ve Müslümanların icmaı ile haramdır. Mezhep alimlerimiz der ki: Müslüman bir kimse ay hali olan bir kadın ile fercinde cima etmenin helal olduğuna inanırsa kafir ve mürted olur. Bir kimse bunun helal olduğuna inanmaksızın bu işi yapacak olursa, şayet bunu unutmuş yahut ay hali olduğunu bilmeyen ya da haram olduğunu bilmeyen yahut zorlanan bir kimse ise onun için vebalde kefaretle sözkonusu değildir. Şayet kasten ay hali olduğunu ve haramlığını bilerek kendi isteği ile ay hali olan kadın ile cima ederse pek büyük bir günah işlemiş olur. Şafii bunun büyük bir günah olduğunu ve bu işi yapanın tövbe etmesinin icap ettiğini açıkça ifade etmiştir. Bu işi yapan kimseye kefaretin vücubu hususunda Şafii'nin iki görüşü vardır. Daha sahih olana göre -ki bu onun yeni görüşüdür. Malik, Ebu Hanife, iki rivayetten birisine göre Ahmed'in ve selefin çoğunluğunun da görüşüdür- bundan dolayı ona kefaret düşmez. Seleften bu görüşü benimseyenler arasında Ata, İbn Ebu Muleyke, Şa'bi, Nehai, Mekhul, Zühri, Ebu'z-Zinad, Rabia, Hammad b. Süleyman, Eyyub es-Sahtiyani, Süfyan es-Sevri, Leys b. Sa' d -yüce Allah hepsine rahmet buyursun- vardır. İkinci görüş ise Şafii'nin eski ve zayıf görüşü olup, böyle birisine kefaret icap eder. Bu görüş İbn Abbas, Hasan-ı Basri, Said b. Cubeyr, Katade, Evzai, İshak ve ondan gelen ikinci rivayette Ahmed bu görüştedir. Bunlar kefaret hususunda ise farklı görüşlere sahiptirler. Hasan ve Said kefaretin bir köleyi hürriyetine kavuşturmak olduğunu söylerken diğerleri bir ya da yarım dinardır demişlerdir. Bununla birlikte hangi durumda bir dinar, hangi durumda yarım dinar kefaret ödemesi gerektiği hususunda da aralarında ihtilaf vardır. Acaba bir dinar kefaret kanın ilk geldiği sırada, yarısı da son zamanlarında olursa mı yoksa dinar kanın geldiği zamanda, yarısı ise kesildiğinden sonra mı kefaret olarak verilecektir. Bu hususta görüş ayrılıkları vardır. (3/204) Bu kefaretin verileceği ni kabul edenler İbn Abbas'ın rivayet ettiği şu merfu hadisi delil alırlar: \"Kim ay hali iken hanımına yaklaşacak olursa, bir yahut yarım dinar sadaka versin. \" Ancak bu hafızların ittifakı ile zayıf bir hadistir. Doğrusu kefaretin sözkonusu olmadığıdır. Allah en iyi bilendir. İkinci kısım: Göbeğin üst tarafı ile diz kapağının alt tarafı arasına zekeriyle sürtünmek yahut öperek, kucaklaşarak, dokunarak ve daha başka şekilde mübaşeret etmek (temas etmek, dokunmak}.Bu da ilim adamlarının ittifakı ile helaldir. Şeyh Ebu Hamid el-İsferayini ile çok sayıda bir topluluk bu hususta icma olduğunu nakletmiş bulunmaktadırlar. Abide es-Selmani' den ve diğerlerinden erkeğin hiçbir yanı ay hali olan karısının hiçbir yanına değmez diye gelen nakil aslında şaz, münker, bilinmeyen ve kabulolunmayan bir görüştür. Ondan bu görüş sahih olarak nakledilse bile Buhari ve Müslim'in sahihleri ile başka hadis kaynaklarından zikredilmiş bulunan Nebi (Sallallahu aleyhi ve Sellem)'in peştamalin üstünden mübaşereti, bu hususa dair izin vermesi ile ilgili meşhur sahih hadislerle ve ondan önce olsun sonra olsun muhalefete kalkışanlardan önce Müslümanların icmaı ile reddolunur. Diğer taraftan yararlandığı ve fnübaşeret ettiği yerde bir miktar kanın bulunup bulunmaması arasında da fark yoktur. İşte mezhep alimlerimizin ve onların dışındaki diğer alimlerin pek büyük çoğunluğunun mutlak hadisler dolayısıyla kesin olarak söylediği meşhur ve doğru hüküm budur. Mezhebimize mensup el-Mehamill ise bazı mezhep alimlerimizin bu hususta bir görüşünü nakletmektedir. Buna göre göbeğin üstü ile diz kapağının altındaki bölgede eğer ay hali kanından bir şeyler varsa ona mübaşeret (dokunmak) haram olur fakat bu görüşün batıl olduğunda şüphe yoktur. Üçüncü kısım: Ön ve arka dışında göbek ile diz kapağı arasındaki yerlerde mübaşeret (temas ve dokunmak). Bu hususta mezhep alimlerimizin üç görüşü vardır. Onların büyük çoğunluğuna göre daha sahih, mezhepte daha meşhur olan görüş bunun haram olduğudur. İkinci görüş bu haram değildir ama tenzihen mekruhtur. Bu görüş ise delil bakımından daha güçlü bir görüş olup, tercih edilen de budur. Üçüncü görüş eğer mübaşeret eden kişi kendisini fercden alıkoyabiliyor ve ondan uzak kalacağı hususunda kendisine güveniyorsa -bu ister arzusunun azlığından, ister ileri derecede vera sahibi oluşundan olsun- caizdir, değilse caiz olmaz. Bu görüş de güzel bir görüştür. Bunu mezhep alimlerimizden Ebu'l-Abbas el-Basri ifade etmiştir. Birinci görüş olan kayıtsız şartsız haram olduğu görüşünü kabul edenler arasında Malik ve Ebu Hanife de vardır. İlim adamlarının çoğunluğunun görüşü de budur. Said b. el-Müseyyeb, Şureyh, Tavus, Ata, Süleyman b. Yesar ve Katade bunlar arasındadır. Caiz olduğunu kabul edenler arasında ise İkrime, Mücahid, Şa'bi, Nehai, Hakem, Sevri, Evzai, Ahmed b. Hanbel, Muhammed b. el-Hasan, Esbağ, İshak b. Rahuye, Ebu Sevr, İbnu'l-Münzir ve Davud da bulunmaktadır. Delil itibariyle bu görüşün daha güçlü olduğunu da belirtmiştik. Bunlar ayrıca biraz sonra gelecek Enes (r.a.)'ın rivayet ettiği: \"Nikah (cima) dışında her şeyi yapabilirsiniz\" hadisini delil göstermişlerdir. Nebi (Sallallahu aleyhi ve Sellem)'in peştamalden yukarısına mübaşeret etmekle yetinmesi ise müstehaplık olarak yorumlanır demişlerdir. Allah en iyi bilendir. Şunu da bilelim ki, ilişkiyi ve mübaşereti haram kabul edenlere göre bu hüküm ay hali süresince ve ay halinden kesilip de gusledinceye yahut şartına uygun olarak suyu bulamayacak olursa teyemmüm edinceye kadar devam eder. Bizim,Malik, Ahmed, selef ve halefin büyük çoğunluğunun görüşü budur. Ebu Hanife ise: Ay halinin azami süresi gelip, kanın kesilmesi halinde anında onunla ilişki kurmak helal olur. Cumhur yüce Allah'ın: \"Temizleninceye kadar onlara yaklaşmayın. İyice temizlendiler mi o zaman Allah'ın size emrettiği yerden onlara varın. \" (Bakara, 2/222) buyruğunu delil göstermişlerdir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 682,
			"arabicnumber": "295",
			"text": "Bana Ebu't-Tahir tahdis etti. Bize İbn Vehb, Mahreme'den haber verdi. (H) Bize Harun b. Said el-Eyl! ve Ahmed b. İsa da tahdis edip dediler ki: Bize İbn Vehb tahdis etti. Bana Mahreme babasından haber verdi. O İbn Abbas'ın azatlısı Kureyb'den şöyle dediğini nakletti: Nebi (Sallallahu aleyhi ve Sellem)'in zevcesi Meymune'yi: Resulullah (Sallallahu aleyhi ve Sellem) ben ay hali olduğum halde benimle onun arasında da bir elbise varken benimle birlikte (aynı yorgan altındalyatardı, derken dinledim. Yalnız Müslim rivayet etmiştir; Tuhfetu'I-Eşraf, 18081 AÇIKLAMALAR 296.sayfada)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 683,
			"arabicnumber": "296",
			"text": "Bize Muhammed b. el-Müsenna rivayet etti. (Dediki): Bize Muaz b. Hîşam rivayet etti. (Dediki): Bana babam, Yahya b. Ebi Kesîrden rivayet etti. (Demiş ki) : Bize Selemetü'bnü Abdirrahman rivayet etti. Onada Zeynep binti Ümmü seleme rivayet etmiş. onada Ümmü Seleme rivayet etmiş. Demişki: Ben kadife bir örtü altında Resulullah (Sallallahu aleyhi ve Sellem) ile birlikte yatıyorken ay hali oluverdim. Derhal sıvışıp ay hali olduğum zaman giyindiğim elbiselerimi aldım. Resulullah (Sallallahu aleyhi ve Sellem) bana: ''Ay hali mi oldun?\" dedi. Ben, evet dedim. O beni çağırdı ve kadife örtünün altında onunla birlikte yattım. Ümmü Seleme (r.anha) dedi ki: Kendisi Resulullah (Sallallahu aleyhi ve Sellem) ile birlikte cünüplükten aynı kapta yıkanırlardı. Diğer tahric: Buhari, 298, 322 -uzunca-, 323,1929 -uzunca-; Nesai, 282, 369 DAVUDOĞLU AÇIKLAMA: Bu hadisi Buhari «Kitabu'l Hayz'ın bir iki yerinde ve «Kitab't-Tahare»de; Nesaî dahi «Kitabu't-Tahare»de muhtelif ravilerden tahriç etmişlerdir. Gerçi Ebu Davud Hz. Aişe'den buna muarız bir hadis rivayet etmişdir. O Hadiste Hz, Aişe: «Ben hayzımı gördüğüm zaman yataktan hasırın üzerine inerdim. Resulullah (Sallallahu Aleyhi ve Sellem) bana yaklaşmazdı; ben de temizleninceye kadar ona yaklaşmazdım. demişsede de Aliyyu-l' Kaarî: İhtimal bu hadis mensuhdur; diyor. İbni Kesir ise onun tenezzüh ve ihtiyata hamledildiğini söylüyor. İbni Abbas (R.A.) Hayz zamanında karısından uzaklaşırmış. Halası Meymune (R.A.) bunu duyunca; ona haber göndererek: «Sen Resulullah'ın sünnetinden yüz mü çeviriyorsun! Vallahi o hayızlı kadınlarından biri ile yatar aralarında dizleri geçecek kadar bir Örtüden başka bir şey bulunmazdı.» demiş Hamile yahut hamil: Saçaklı kadife demektir. Hadîsin bazı rivayet lerinde kelimenin yerine «hamîsa» zikredilmiştir. Hamîsa dört köşeli ve iki çizgili çarşaftır. Bazıları siyah ve kırmızı çizgili bir kumaş olduğunu söylerler. Nifas: Çocuk doğurduktan sonra gelen kandır. Azı için hudud yoksada son haddi kırk gündür. Ondan sonra kan gelse bile hastalıktan dolayı olduğu için kadının namaz oruç gibi ibadetlerine manî değildir. Ekseri ulema ve fukahanm kavilleri budur. Hasan-ı Basrî'den nifaslı kadının elli gün namaz kılamayacağı rivayet olunmuştur. Ata' ise bu müddeti altmış güne çıkarmıştır. NEVEVİ ŞERHİ: Bu babta Meymune (r.anha)'nın: \"Ben ay hali olduğum halde ... \" hadisi ile Ümmü Seleme (r.anha)'nın: \"Ben Resulullah (Sallallahu aleyhi ve Sellem) ile birlikte kadife bir örtünün altında yatarken ... \" hadisleri yer almaktadır. Dilcilerin belirttiğine göre \"ham1le\" ve \"ham1l\" kadife demektir. Neden olursa olsun havı bulunan her bir elbiseye hamıle denilir. Siyah elbiselere ham1le denildiği de söylenmiştir. (Um Seleme'nin): \"İnseleltu\" ifadesi gizlice çekip gittim, sıvıştım demektir. Onun bu şekilde uzaklaşması muhtemelen Nebi (Sallallahu aleyhi ve Sellem)'e kanın bulaşmasından korkması idi yahut (3/206) kendisi tiksindiği için Resulullah (Sallallahu aleyhi ve Sellem) ile beraber yatmayı uygun görmediği yahut kendisi kendisinden yararlanması imkan bulunmayan bu halde kendisinden faydalanmayı isteyeceğinden korktuğu için olmuştur. \"Ay hali olduğunda giydiğim elbiselerimi aldım\" yani ay hali zamanı için hazırlanmış elbiselerimi aldım. Ay halini anlatmak için \"nefise\" fiili kullanılır, loğusalık halini anlatmak için ise \"nüfise\" diye kullanılır. Herevı'nin naklettiğine göre ise loğusalık halinde nufise ve nefise şekilleri, ay hali hakkında ise sadece nefise şekli kullanılır demiştir. Kadı İyaz der ki: Bizim burada Müslim'deki rivayetimiz nun harfi dammeli (nufise) şeklidir. Hadis ehlinin rivayeti de budur ve bu sahihtir. Ebu Hatim de el-Esmal'den ay hali ve doğum (loğusalık) hakkında her iki şekli de nakletmiş olup, bunu daha başkaları da zikretmiş bulunmaktadır. Bütün bu şekillerin ifade ettikleri asıl anlam ise kan ın çıkmasıdır. Kana da \"nefs\" adı verilir. Allah en iyi bilendir. Babtaki Hadislerden Çıkartılan Hükümler 1- Ay hali olan kadın ile birlikte uyumak, onunla aynı yorgan altında yatmak -göbek ile diz kapağı arasında tenlerin birbirlerine değmesini önleyecek yahut yalnız ferci haram kabul edenlere göre- ise ferce değmeyi önleyecek bir engelin bulunması hu.linde caizdir. 2- İlim adamları der ki: Ay hali olan kadınla aynı yatakta yatmak, öpmek, göbekten yuka'ısı ve diz kapağının altındaki yerlerinden yararlanmak mekruh olmadığı gib 3- Elini sıvı herh,mgi bir şeye daldırması 4- Kocasının başinı ya da mahremlerinden olan birisinin başını yıkaması ve taraması da mekruh değildir. 5- Ay hali olan kadının yemek pişirmesi, hamur yoğurması ve daha baş- ka işleri yapması mekruh değildir. 6- Arttırdığı su ve yemek ve teri temizdir. Bütün bu hususlar üzerinde ittifak vardır. İmam Ebu Cafer Muhammed b. Cerir, Mezahibu'l-Ulema adlı eserinde Müslümanların bütür. bu hususlarda icma ettiklerini nakletmektedir. Bunların sünnetten delilleri ise açık ve meşhurdur. (3/207) Yüce Allah'ın: '1\\y halinde iken kadınlardan ayrı durun, temizleninceye kadar onlara yaklaşmayın. \" (Bakara, 2/222) buyruğuna gelince: Bundan maksat onlarla cinsel ilişkiden uzak durun ve onlarla cinsel ilişkiye yakınlaştıncı halleriniz olmasın, demektir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 684,
			"arabicnumber": "297.01",
			"text": "Bize Yahya b. Malik tahdis edip dedi ki: Malik'e, İbn Şihab'dan diye okudu. O Urve'den, o Amre'den, o Aişe'den şöyle dediğini nakletti: Resulullah (Sallallahu aleyhi ve Sellem) itikafa girdiği zaman başını bana doğru yaklaştırır, ben de saçlarını tarardım. Eve de insanın bir ihtiyacı dışında bir sebeple girmezdi. Diğer tahric: Ebu Davud, 2467, 2468",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 685,
			"arabicnumber": "297.02",
			"text": "Bize Kuteybe b. Said de tahdis etti. Bize Leys tahdis etti. (H) Bize Muhammed b. Rumh da tahdis edip dedi ki: Bize Leys, İbn Şihab'dan haber verdi. O Urve ve Abdurrahman kızı Amre' den rivayet ettiğine göre Nebi (Sallallahu aleyhi ve Sellem)'in zevcesi Aişe (r.anha) dedi ki: Ben (itikafta iken) ihtiyacım için eve girerdim. Evde hasta bulunduğu halde onun halini ancak geçip giderken sorardım. Resulullah (Sallallahu aleyhi ve Sellem)'de mescitte bulunduğu halde başını benim bulunduğum tarafa doğru (mescitten dışarı çıkarır odamdan içeriye) sokar, ben de onun saçlarını tarardım. İtikafta bulunduğu zaman ancak bir ihtiyaç için eve girerdi. İbn Rumh dedi ki: (Bu işleri) itikafta bulundukları zaman (yaparlardı). Diğer tahric: Buhari, 2029; Ebu Davud, 2468; Tirmizi, 804; İbn Mace, 1776",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 686,
			"arabicnumber": "297.03",
			"text": "Bana Harun b. Sa'îd el-Eylî dahî rivayet etti. (Dediki): Bize Vehb rivayet etti. (Dedi ki): Bana Amr b. Haris Muhammed b. Abdirrahman b. Nevfel'den o da Urve b. Zübeyr'den o da Nebi (Sallallahu Aleyhi ve Sellem)’in zevcesi Aişe'den naklen haber verdi. Aişe şöyle demiş: Resulullah (Sallallahu aleyhi ve Sellem) mücavir (itikafta) iken mescitten dışarıya başını bana doğru uzatır, ben de ay hali olduğum halde başını yıkardım. Diğer tahric: Nesai, 275 -muhtasar olarak",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 687,
			"arabicnumber": "297.04",
			"text": "Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Ebu Hayseme Hişam'dan naklen haber verdi. (Demişki): Bize Urve Aişe'den naklen haber verdi. Aişe şöyle demiş: Resulullah (Sallallahu aleyhi ve Sellem) ben odamda iken başını bana yaklaştırır, ben de ay hali olduğum halde onun başının saçlarını tarardım. Yalnız Müslim rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 688,
			"arabicnumber": "297.05",
			"text": "Bize Ebu Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Hüseyin b. Ali, Zaide'den, o da Mansurdan, o da İbrahim'den, o da Esved'den, o da Aişe'den naklen rivayet etti. Aişe (r.anha dediki): Ben hayz (ay hali) olduğum halde Resulullah (Sallallahu aleyhi ve Sellem)'in başını yıkardım. Diğer tahric: Buhari, 301, 299, 2031; Ebu Davud, 77; Nesai, 274 -buna yakın-, 234, 235, 411, 385 DAVUDOĞLU AÇIKLAMASI 299.sayfada. NEVEVİ ŞERHİ: Bu başlıkta Aişe (r.anha)'nın rivayet ettiği (682) \"Resulullah (Sallallahu aleyhi ve Sellem) itikafta olduğu zaman ... saçlarını tarardım ... \" Bir diğer rivayette (684) \"başını yıkardım\" denilmektedir. Yine bu babta seccadeyi eliyle uzatına hadisi (687) ve daha başka hadisler de yer almaktadır. Bu babta sözkonusu olabilecek fıkhi hususlar bundan önceki babta geçmiş bulunmaktadır. Hadiste saçların taranması ile başını yıkaması birbirine yakındır. Sözlükte itiMfın asıl anlamı alıkoymaktır. Şer'i bir terim olarak kişinin kendisini niyet ile birlikte özelolarak mescitte alıkoyması demektir. \"Mücavir\" itikaf yapan, itikafta bulunan demektir. Hadisten Çıkan Hükümler Bu hadisten itikaf ile ilgili pek çok hüküm çıkmaktadır. Yüce Allah'ın izniyle ilgili babta bunlar gelecektir. Burada öncelikle anlaşılan husus da şudur: 1- İtikafta bulunan kimsenin eli, ayağı, başı gibi vücudunun bir bölümü mescidin dışına çıkacak olursa itikafı batıl olmaz. 2- Bir eve girmeyeceğine ya da oradan çıkmayacağına dair yemin eden bir kimse şayet vücudunun bir kısmını o eve sokacak ya da çıkartacak olursa yeminini bozmuş olmaz. Allah en iyi bilendir. 3- Yıkamak, yemek pişirmek, ekmek pişirmek ve daha başka işlerde zevcenin rızası ile çalıştırılması caizdir. Sünnetteki deliller seletin uygulaması ve ümmetin İcmaı bu hususta birbirini desteklemektedir. (3/208) Rızası olmadan ona bu işlerin yaptırılması ise caiz değildir. Çünkü kadının yerine getirmekle yükümlü olduğu görevi kocasının kendisinden yararlanmasına imkan vermesi ve onun evinde kalmasından ibarettir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 689,
			"arabicnumber": "298.01",
			"text": "Bize Yahya b. Yahya, Ebu Bekr b. Ebi Şeybe ve Ebu Kureyb de tahdis etti. Yahya rivayetinde bize Ebu Muaviye, A'meş'ten haber verdi derken, diğer ikisi tahdis etti, dediler. (A'meş) Sabit b. Ubeyd'den, o Kasım b. Muhammed'den, o Aişe'den şöyle dediğini nakletti: Resulullah (Sallallahu aleyhi ve Sellem) mescitten bana: \"Seccadeyi bana uzatıver\" buyurdu. Ben: Ay haliyim dedim. O: \"Şüphesiz ay hali (kanı)n elinde yoktur \" buyurdu. Diğer tahric: Ebu Davud, 261; Tirmizi, 134,271,382 NEVEVİ ŞERHİ: \"Resulullah (Sallallahu aleyhi ve Sellem) mescitten bana: Bana seccadeyi uzat. .. buyurdu ... \" Seccade (el-humra) ile ilgili olarak Herevi ve başkaları der ki: Humra seccade denilen bildiğimiz şeydir. Bu da bir kimsenin se cde ederken yüzünü üzerine koyduğu hasır ya da ince hurma çubuklarından dokunmuş parçaya denilir. Herevi ve çoğunluk böyle açıklamışlardır. Aralarından bir topluluk ise bunun ancak denilen bu miktarda olanına bu adın verileceği ni açıkça ifade etmişlerdir. el-Hattabi dedi ki: Humra, namaz kılanın üzerinde secde ettiği seccadedir. Ebu Davud'un Süneninde İbn Abbas (r.a.)'dan şöyle dediği rivayet edilmektedir: Bir fare gelip kandil fitilini çekmeye başladı, onu sürükleyip, Resulullah (Sallallahu aleyhi ve Sellem)'in önünde üzerinde oturmuş olduğu seccadenin üzerine bıraktı. Onun bir dirhem kadarlık bir yerini de yaktı.\" İşte bu rivayet \"humra (denilen seccade)\"nin yüzün miktarından daha fazla bir yer tutan böyle bir örtü hakkında kullanıldığını açıkça ifade etmektedir. (3/209) Buna humra denilmesinin sebebi ise yüzü tahmir etmesi yani örtmesi dolayısıyladır; çünkü tahmirin asıl anlamı örtmektir. Kadının başörtüsüne \"himar\" denilmesi de bundan dolayıdır. Aklı örttüğünden ötürü de şaraba \"hamr\" adı verilmiştir. Aişe (r.anha)'nın: \"Mescitten\" sözü ile ilgili olarak Kadı İyaz (r.a.) şunları söylemektedir: Yani Nebi (Sallallahu aleyhi ve Sellem) ona bu sözlerini mescitten söylemiştir. Yani Allah Resulü (Sallallahu aleyhi ve Sellem) mescitte bulunuyorken seccadeyi kendisine mescidin dışından uzatmasını söylemiştir. Yoksa Nebi (Sallallahu aleyhi ve Sellem) ona bu seccadeyi kendisi için mescitten çıkartmasını emretmiş değildir. Çünkü Allah Resulü zaten mescitte itikatta idi, Aişe (r.anha) ise kendi odasında ve ay hali idi. Bunun delili de Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Senin elinde ay hali yoktur\" demiş olmasıdır; çünkü o elini mescide sokmaktan korkmuştu. Eğer Resulullah (Sallallahu aleyhi ve Sellem) ona mescide girmesini emretmiş olsaydı, özelolarak eli sözkonusu etmesinin bir anlamı olmazdı. Allah en iyi bilendir. Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Senin elinde ay hali yoktur\" buyruğunda \"haydatuki: senin ... ay hali\" lafzında ha harfi fethalıdır. Rivayette meşhur olan ve sahih olan da budur. İmam Ebu Süleyman el-Hattabt şöyle demektedir: Muhaddisler bu kelimeyi \"hayda\" şeklinde ha harfi fethalı olarak söylerler ama bu hatadır. Doğrusu ise durum ve vaziyet bildirmek üzere ha harfinin kesreli okunmasıdır. Ancak Kadı lyaz, Hattabl'nin bu açıklamasını kabul etmeyerek burada doğrusu muhaddislerin söylediği gibi fethalı okunacağıdır; çünkü maksat kandır. Buna da ha harfi fethalı olarak \"hayz\" denildiğinde şüphe yoktur. Çünkü Nebi (Sallallahu aleyhi ve Sellem)'in: \"Senin elinde değildir, yoktur\" demesi ise, mescitten uzak tutulması gereken necaset olan ay hali kanı senin elinde değildir demektir. Bu ise (3/210) Ümmü Seleme'nin rivayet ettiği: \"Ay hali iken giyindiğim elbiselerini aldım\" şeklindeki sözlerinden farklıdır. Buradaki \"ay hali\" kelimesinde ha harfinin doğru okunuşu kesreli okuyuştur demiştir. Kadı lyaz'ın yaptığı bu fethalı okuyuş tercihi burada zahir olan okuyuştur. Bununla birlikte Hattabi'nin sözlerinin de açıklanabilir bir tarafı vardır. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 690,
			"arabicnumber": "298.02",
			"text": "Bize Ebu Kureyb rivayet etti. (Dediki): Bize İbni Ebî Zaide Haccac ile Ebu Ganiyye'den, onlarda Sabit b. Ubeyt'ten o da Kaasım b. Muhammed'den o da Aişe'den naklen rivayet etti. Şöyle demiş: Resulullah (Sallallahu aleyhi ve Sellem) mescitten bana seccadeyi uzatmamı emretti. Ben: Ay haliyim dedim. O: \"Sen onu bana uzat. Çünkü senin elinde ay hali yoktur\" buyurdu.468 DAVUDOĞLU AÇIKLAMASI: 299.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 691,
			"arabicnumber": "299",
			"text": "Bana Zuheyr b. Harb, Ebu Kamil ve Muhammed b. Hatim hepsi Yahya b. Said'den tahdis etti. Zuheyr dedi ki: Bana Yahya, Yezid b. Keysan'dan tahdis etti. O Ebu Hazim'den, o Ebu Hureyre'den şöyle dediğini nakletti: Resulullah (Sallallahu aleyhi ve Sellem) mescitte iken \"Ey Aişe elbiseyi bana uzat\" buyurdu. Aişe: Ben ay haliyim, dedi. Allah Resulü: \"Senin elinde ay hali yoktur\" buyurdu. Aişe de ona elbiseyi uzattı. Diğer tahric: Nesai, 381 DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 692,
			"arabicnumber": "300",
			"text": "Bize Ebu Bekr, b. Ebî Şeybe ile Züheyr b. Harb rivayet ettiler. (Dedilerki): Bize Vekî' Mis'arla Süfyan'dan, onlarda Mikdam b. Şüreyc'den o babasından, o da Âişe'den naklen rivayet etti. Âişe şöyle demiş: Ben ay hali olduğum halde (kaptan) su içer sonra onu Nebi (Sallallahu aleyhi ve Sellem)'e uzatırdım. O da ağzımı koyduğum yere kendi ağzını koyar ve öyle içerdi. Ay hali iken kemiğin etini ısım sonra onu Nebi (Sallallahu aleyhi ve Sellem)'e uzatırdım, o da ağzımı koyduğu m yere ağzını koyardı. Zuheyr rivayetinde \"içerdi\" ibaresini zikretmemiştir. Diğer tahric: Ebu Davud, 259; Nesai, 70,278 -uzunca-, 279, 280, 281,340,375 -uzunca-, 376, 377, 378; İbn Mace, 643 NEVEVİ ŞERHİ: \"Ark\" üzerinde bir miktar et kalmış kemik demektir. Daha meşhur olan anlamı budur. Ebu Ubeyd ise: Bir miktar et demektir derken, el-Halil: Üzerinde et olmayan kemiktir demiştir, çoğulu \"urak\" olarak gelir. Kemik üzerindeki etin dişlerle sıyrılıp alınması halini anlatmak için bu fiil kullanılır. DAVUDOĞLU AÇIKLAMA: Ark: Üzerinde et bakiyyesi bulunan kemiktir. Kelimenin meşhur manası budur. Bazılarına göre; bir miktar et demektir. İmam Halil b. Ahmed'e göre ark etsiz kemik demektir. «Etearraku» kemiğin etlerini dişlerimle ısırırdım. Manasınadır. Hadis-i Şerif hayızlı kadının artığı ile bedeninin temiz olduğuna delildir. Bazıları İmam Ebü Yusuf'a göre bedeninin necis olduğunu söylemişlersede bu rivayet doğru değildir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 693,
			"arabicnumber": "301",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Davud b. Abdurrahman el-Mekkî, Mansur'dan, o da annesinden, o da Aişe'den naklen haber verdi. Âişe şöyle demiş: Resulullah (Sallallahu aleyhi ve Sellem) ay hali olduğum halde benim kucağıma yaslanır ve Kur'an okurdu, dedi. Diğer tahric: Buhari, 297, 7549 -buna yakın-; Ebu Davud, 260; Nesai, 273 -buna yakın-, 379; İbn Mace, 634 NEVEVİ ŞERHİ: Aişe (r.anha)'nın: \"Resuluilah (Sallallahu aleyhi ve Sellem) ben ay hali iken kucağıma yaslanır ve Kur'an okurdu\" ifadelerinden Kur'an-ı Kerim'in yatarak, ay hali olan bir kadına yaslanarak ve necaset bulunan bir yere yakın bir yerde okunmasının caiz olduğu anlaşılmaktadır. Allah en iyi bilendir . DAVUDOĞLU AÇIKLAMA: Bu hadîsi Buharî «Kitabu'l-Hayz» ile «Kitabu't Tevhidi» de Ebu Davud, Nesa-i ve îbni Mace dahi «Kitabu't-Tahare» da muhtelif ravîlerden tahric etmişlerdir. Hadisi Şerif Şu Hükümleri İhtiva Eder. 1- Hayzlı kadına dokunmak caizdir. Çünkü temizdir. 2- Nevevî: «Bu hadiste necaset mahalline yakın yerlerde Kur'an okumanın caiz olduğuna delil vardır» demişsede, Aynî buna itiraz etmiş ve: «Hayzlı kadın temizdir. Pis olan ondan gelen kandır. Kan hayz zamanlarının hepsinde pistir. Nevevî'nin dediğine bakılırsa helaya karşı Kur'an okumakta mekruh olmamak îcab eder halbuki kur'an-ı kerîme ta'zim için helaya karşı onu okumamak gerekir. Çünkü bir şeye yakın olan onun hükmünü alır.» demiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 694,
			"arabicnumber": "302",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Abdurrahman b. Mehdi rivayet etti. (Dediki): Bize Hammad b. Seleme rivayet etti (Dediki): Bize Sabit, Enes'den naklen rivayet ettiki: Yahudiler aralarından bir kadın ay hali oldu mu onunla birlikte yemek yemez, evlerde onlarla birlikte bir arada bulunmazlardı. Nebi (Sallallahu aleyhi ve Sellem)'in ashabı bunun üzerine Nebi (Sallallahu aleyhi ve Sellem)'e soru sordular, yüce Allah da: \"Sana ay hali hakkında sorarlar. Deki: O bir ezadır, onun için ay halinde iken kadınlardan ayrı durun. \" (Bakara, 222) ayetini sonuna kadar indirdi. Bunun üzerine Resulullah (Sallallahu aleyhi ve Sellem): \"Cima dışında her şeyi yapabilirsiniz\" buyurdu. Onun böyle dediği Yahudilere ulaşınca: Bu adam bize muhalefet etmediği hiçbir işimizi bırakmak istemiyor, dediler. Bu sefer Useyd b. Hudayr ve Abbad b. Bişr gelip: Ey Allah'ın Resulü Yahudiler böyle böyle diyorlar. Biz onlarla cima etmeyelim mi, dediler. Resulullah (Sallallahu aleyhi ve Sellem)'in yüzü değişiverdi. Hatta bizler bu sözlerinden dolayı içinden onlara kızdığını dahi zannettik. Onlar çıkıp gittiklerinde Nebi (Sallallahu aleyhi ve Sellem)'e hediye olarak bir miktar süt (getiren birileri) ile karşılaştılar. Allah Resulü onların arkasından birisini gönderdi (onlar geldikten sonra) kendilerine (o sütten) içirince kendilerine kızmamış olduğunu anladılar. Diğer tahric: Ebu Davud, 258, 2165; Tirmizi, 2977, 2978; Nesai, 287, 367; İbn Mace, 644 -buna yakın NEVEVİ ŞERHİ: \"Kadınlarla evlerde bir arada bulunmazlardı.\" Aynı evde onlarla birlikte oturup kalkmaz, durmazlardı. \"Sana ay hali hakkında soru sorar/ar ... \" Ayette ilk olarak geçen \"elmahid (ay hali)\"den maksat kandır. İkincisinden ne kastedildiği hususunda ise görüş ayrılığı vardır. Bizim mezhebimize göre o da ay hali yani kanın kendisidir. (3/211) Bazı ilim adamları ise ondan kasıt feredir. Diğer başkaları da maksat ay hali süresi ve zamanıdır demişlerdir. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Hadistende anlaşılıyorki ashab-ı kiramın hayzlı kadın hakkındaki sualleri bu babtaki ayet nazil olmazdan evveldir. Onlar bunu; bizden önceki şeriatlar bizim içinde şeriattır» zannederek sormuşlardı. Nevevî diyorki hadiste zikredilen ayetteki birinci mahîzdan murad kandır. İkinci mahîz ihtilaflıdır. Bizim mezhebimize göre hayzdır. Bazı Ulema bundan muradın fere olduğunu diğer bazılarıda hayz zamanı olduğunu söylemişlerdir. Üseyd ile Abbad (R.A.)'nin; «Hayızlı kadınlarla düşüp kalkmayalım mı?» şeklindeki suallerinden neyi kasdettikleri Ulema arasında ihtilaflıdır. Bazıları: Bundan maksad; kadınlarla bir arada yaşamak, beraber yiyip içmektir. Übbî'ye göre bu suali eski şeriatleri kendileri içinde şeriat zannettikleri için sormuşlardır. İhtimal bu zevat Hayzlı kadınları ile cinsi münasebetde bulunmak istemiş ve bu suretle yahudilere muhalefet kasdetmişler; Fakat dilekleri şeriata aykırı olduğu için Nebi (Sallallahu Aleyhi ve Sellem)'in canı sıkılmıştı diyenler vardır. Resulullah (Sallallahu Aleyhi ve Sellem) in Useyd ile Abbad (R.A.)'nın arkalarından kendilerine süt göndermesi hatırlarını hoş etmek ve gönüllerini almak içindir. Yani yüzündeki değişikliği görerek canının sıkıldığını anlayınca üzülmüşlerdir diye göndermiştir. Bu Fahr-i Kainat (Sallallahu Aleyhi ve Sellem)'efendimizin son derece müşvik ve merhametli olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 695,
			"arabicnumber": "303.01",
			"text": "Bize Ebu Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Veki' ile Ebu Muaviye ve Hüşeym, A'meş'den o da Münzir b. Ya'la'dan -ki bu zat Ebu Ya'la künyesini taşır- o da İbni'l Hanefiyye'den, o da Ali'den şöyle dediğini nakletti: Ben çokça mezisi gelen bir adam idim. Nebi (Sallallahu aleyhi ve Sellem)'e de kızı zevcem olduğundan ötürü (hükmünü) sormaktan haya ederdim. Bu sebeple Mikdad b. Esved'e emrettim, o da O'na hükmünü sorunca: \"Erkeklik organını yıkar ve abdest alır\" buyurdu. Diğer tahric: Buhari, 132, 178; Nesai, 157",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 696,
			"arabicnumber": "303.02",
			"text": "Bana Yahya b. Habib el-Harisı de tahdis etti. Bize Halid -yani b. Haris- tahdis etti. Bize Şu'be tahdis etti. Bana Süleyman haber verip dedi ki: Ben Münzir'i, Muhammed b. Ali'den, o Ali'den şöyle dediğini naklederken dinledim: Nebi (Sallallahu aleyhi ve Sellem)'e Fatıma'dan dolayı mezi hakkında soru sormaktan haya ettim. Bundan dolayı Mikdad b. Esved'e söylemem üzerine o O'na sordu, Allah Resulü: \"Ondan dolayı abdest gerekir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 697,
			"arabicnumber": "303.03",
			"text": "Bana Harun b. Said el-Eyll ve Ahmed b. İsa da tahdis edip dediler ki: Bize İbn Vehb tahdis etti. Bana Mahreme b. Bukeyr babasından haber verdi. O Süleyman b. Yesar'dan, o İbn Abbas'tan şöyle dediğini nakletti: Ali b. Ebi Talib (r.a.) dedi ki: Mikdad b. Esved'i Resulullah (Sallallahu aleyhi ve Sellem)'e gönderdik. O da O'na insandan çıkan mezi hakkında, bundan dolayı nasıl yapmalıdır, diye sordu. Resulullah (Sallallahu aleyhi ve Sellem)'de: ''Abdest al ve fercini yıka\" buyurdu. Diğer tahric: Nesai, 434, 435, 437, 438 NEVEVİ ŞERHİ AŞAĞIDA DAVUDOĞLU AÇIKLAMA: Bu hadisi Buharî Taharet ve İlim bahislerinde Nesaî Taharet bahsinde Ebu Davud ile Tirmizî'de ayni bahiste tahrîc etmişlerdir. Müslim'in Harun'dan tahriç ettiği ikinci rivayetin senedindeki Mahreme hakkında söz edilmiş ve babasından işitmediği söylenmişsede hadisin metni sahihtir. Nitekim diğer rivayetleride bunu gösterir. Hadîsin rivayetleri muhteliftir. Nesai'nin rivayetinde Hz. Ali (R.A.)'ın: «Ben çok mezî gören bir adam idim. Nebi (Sallallahu Aleyhi ve Sellem) in kızı da nikahım altında idi. Bu sebeple sormaya utandım da yanı başımda oturan bir zat'a: Şunu sor dedim. O da sordu Resulullah (Sallallahu Aleyhi ve Sellem): «Mezide abdest vardır.» buyurdular» dediği; Tîrmizî'nin. rivayetinde meseleyi bizzat kendi sorduğu Resulullah (Sallallahu Aleyhi ve Sellem)'in cevaben: «Meziden abdest, menidense gusul lazım gelir.» buyurduğu; Ebu Davud'un rivayetinde Ali (R.A.) in: «Ben çok mezi gören bir adamdım. Bu sebeple her mezi gördükçe yıkamaya başladım. Hatta sırtım çatladı. Nihayet bunu Nebi (Sallallahu Aleyhi ve Sellem)'e söyledim. Yahut söylendi. Resulullah (Sallallahu Aleyhi ve Sellem): «Bunu yapma, mezî gördüğün zaman zekerini yıkayı ver ve abdestini al.» buyurdular.» dediği; İmam-ı Ahmet Taberanî ve Nesaî'nin bir rivayetinde soran zat'ın Ammar olduğu bildirilmektedir. Görülüyor ki bazı rivayetlerde Resulullah'a soranın Mikdad b. Esved, bazılarında Ammar (R.A.) bir rivayettede bizzat Ali (R.A.) olduğu zikredilmektedir. İbni Hibban bu rivayetlerin arasını te'lif ederek: « Hz. Ali (R.A.) Mikdad'a sormasını emretmiş fakat sonra kendisi sormuştur. Yahut sorduğu için mecazen kendisi sordu denilmiştir.» diyor. Hz. Ali (R.A.)'ın hem Mikdad'a hem Ammar'a sordurmuş olmasıda mümkündür. Mezi: Ekseriya zevcesi ile oynaşırken gelen berrak sudur. Kadınlarda erkeklerden daha çok görülür. Bu kelime mezy ve meziy şekillerinde de okunabilir. Hatta bazıları şedde ile meziyy şeklinde okunmasını daha fasih görünürler. Vedy: Bevlden sonra gelen sudur. Bunu da şedde ile vediyye şeklinde okuyanlar vardır. Hz. Ali (R.A.)'ın buradaki arkadaşlarına emri vücüb ifade eden emir değildir. Buna ilmi tabiri ile İltimas denilir: Hadiste zikri geçen fercten murad zekerdir. Lafzın mutlak zikredilmesi bütün zekerin yıkanmasını İcab edersede burada murad küllü zikir cüz'ü irade kabilinden yalnız pisliğin çıktığı yerdir. Maamafih bütün zekeri yıkamak lazımdır diyenlerde olmuştur. NEVEVİ ŞERHİ: Bu babta (693) \"Muhammed b. el-Hanefiyye, Ali (r.a.)'dan ... zekerini yıkar ve abdest alır buyurdu\" Diğer rivayette (694) ''ondan dolayı abdest alınır\"; Diğer rivayette (695) ise: \"abdest al ve fereini yıka\" buyurulmaktadır. (3/212) \"Mezi\" kelimesinin çeşitli söyleyişleri sözkonusudur: Mezy şeklinde mim fethalı, zel sakin, meziyy şeklinde zel kesreli, ye şeddeli, bir de mezı şeklinde zel kesreli, ye şeddesiz söyleyişleridir. İlk iki söyleyiş meşhur ve ikisinin de birincisi daha fasih ve daha meşhur olanlarıdır, üçüncü söyleyişi Ebu Amr ez-Zahid, İbnu'l-A'rabl'den nakletmiştir. Mezi yapışkan, beyaz ve ince bir su olup, şehvet halinde ama şiddetle, şehvetle akmaksızın ve akabinde bir durgunluk sözkonusu olmaksızın çıkar. Bazen çıktığının farkına dahi varılmayabilir. Erkek ve kadından gelmesi sözkonusudur. Kadınlarda erkeklerden daha çok görülür. Allah en iyi bilendir. Nebi (Sallallahu aleyhi ve Sellem)'in (695) ''Jereini yıka\" buyruğunda geçen emrin kökü olan \"nadh\" hem yıkamak, hem su serpmek anlamındadır. Diğer rivayette (693) zekerini yıkaması emredildiğinden ötürü bu durumda nadhın yalnızca o anlamda alınması gerekmektedir. Mezinin çıkmasının hükmüne gelince, ilim adamlarının icmaı ile mezinin çıkması gusletmeyi gerektirmez. Ebu Hanife, Şafii, Ahmed ve büyük çoğunluk bu hadis dolayısıyla abdest almayı gerektirir, demişlerdir. Hadisten Anlaşılan Diğer Hükümlere Gelince: 1 - Mezi gusletmeyi gerektirmez ama abdest almayı gerektirir. 2- Mezi necistir. Bu sebeple Nebi (Sallallahu aleyhi ve Sellem) erkeklik organını yıkamayı gerekli kılmıştır. şam ve büyük çoğunluğa göre bundan maksat ise erkeklik organının tamamını yıkamak değil, mezinin isabet ettiği yerleri yıkamaktır. Malik ve Ahmed' den gelen bir rivayete göre erkeklik organının tamamını yıkamayı vacip gördükleri nakl~dilmiştir. 3- Taşla istinca yapılabilir ve alışılmış necasetler olan küçük abdest ve büyük abdestte yalnızca taşla yetinmek caizdir ama kan, mezi ve buna benzer nadiren görülen necasetler için su kullanmak zorunludur. Mezhebimizdeki iki görüşten daha sahih olanı budur. Mutat olan necaset türlerine kıyasen mezi için de taşla yetinmenin caiz olduğunu kabul eden diğer görüş sahiplerinin bu hadise buradaki hüküm çoğunlukla su ile istinca yapan bir beldede yaşayanlar hakkındadır yahut bu müstehaplık ifade eder diye yorumlayıp, cevap vermeleri mümkündür. 4- Fetva sormak için başkasını görevlendirmek caizdir ve kesin bir bilgi elde edebilecek durumda olmakla birlikte doğru olması zannedilen bir habere dayanmak caizdir. Çünkü Ali (r.a.) bizzat Nebi (Sallallahu aleyhi ve Sellem)'e soru sorma imkanına sahip olmakla birlikte Mikdad'ın ona soru sorması ile yetinmiştir. Ancak bu husus tartışma konusu edilerek şöyle denilebilir: Resulullah (Sallallahu aleyhi ve Sellem)' e soru sorulduğu zaman Ali (r.a.)'ın da mecliste bulunmuş olma ihtimali vardır. (3/213) Ancak o bizzat kendisi soru sormaktan haya etmiştir. 5- Kadınlarla güzel bir şekilde geçinmek müstehaptır. 6- Kocanın karısının babası, kardeşi, oğlu ve buna benzer yakınlarının huzurunda kadınlarla cima ve onlardan istifade etmek ile ilgili hususları sözkonusu etmemesi müstehaptır. İşte bundan dolayı Ali (r.a.): Kızının durumu dolayısıyla Resulullah (Sallallahu aleyhi ve Sellem)'e bizzat soru sormaktan haya ediyordum, demiştir. Yani mezi çoğunlukla kişinin zevcesiyle oynaşması, öpmesi ve buna benzer çeşitli şekillerde yararlanması halinde sözkonusu olur. Allah en iyi bilendir. (695) Müslim'in başlıktaki son hadisin isnadında \"ve bana Harun b. Said el-Eyl! ile Ahmed b. İsa da tahdis etti ... \" şeklindeki isnad Darakutni'nin tenkitlerde bulunduğu isnadlardan birisidir. Darakutni şöyle diyor: Hammad b. Halid dedi ki: Mahreme'ye: Babandan hadis dinledin mi, diye sordum. O, hayır dedi. Ayrıca bu hadiste Leys, Bukeyr' den diye naklettiği rivayetinde ona muhalefet ederek senedinde İbn Abbas'ı zikretmemiş, Malik, Ebu'n-Nadr'dan rivayetinde ona mutabaatta bulunmuştur. Darakutni'nin ifadeleri bunlardır. Aynı şekilde Nesai de Süneninde şöyle diyor: Mahreme babasından hiçbir şey işitmemiştir. Nesai bu hadisi çeşitli yollardan rivayet etmiş olup, bunların birisi Müslim'in burada zikredilen rivayet yolu ile aynıdır. Bazılarında ise Leys b. Sa'd, Bukeyr'den, o Süleyman b. Yesar'dan şöyle dedi: Ali, Mikdad'ı gönderdi. Bu şekilde hadisi mürselolarak rivayet etmektedir. İlim adamları Mahreme'nin babasından hadis dinleyip dinlemediği hususunda ihtilaf etmişlerdir. Malik (r.a.) dedi ki: Mahreme'ye senin babandan diye naklettiğin hadisleri bizzat ondan dinledin mi, dedim. O, Allah adına andolsun ki ben onu dinledim, diye yemin etti. Malik dedi ki: Mahreme salih bir adamdı. Aynı şekilde Ma'n b. İsa da: Mahreme babasından hadis dinlemiş olmakla birlikte pek çok topluluk ondan hadis dinlemediği kanaatindedir. Ahmed b. Hanbel dedi ki: Mahreme babasından hiçbir şey dinlememiştir. Ama o babasının kitabından rivayet nakleder. Yahya b. Main ile İbn Ebu Hayseme dedi ki: Denildiğine göre babasının kitabı onun eline geçmiş olup, babasından hadis dinlememiştir. Musa b. Seleme dedi ki: Mahreme'ye baban sana hadis nakletti mi dedim. O: Ben babama yetişmedim ama bunlar onun kitaplarıdır, dedi. Ebu Hatim dedi ki: Mahreme eğer babasından hadis dinlemiş ise hadisi salih (uygun) birisidir demiştir. Ali b. el-Medini de: Mahreme'nin babasından Süleyman b. Yesar'ın kitabını dinlemiş olduğunu zannetmiyorum. Bununla birlikte o kitaptan çok az bir şey dinlemiş de olabilir. Ben Medine' de Mahreme'nin rivayet ettiği herhangi bir hadiste babamı dinledim diye dediğini haber veren hiçbir kimse bulmadım. Allah en iyi bilendir. İşte bunlar bu teknik alanın önder imamlarının sözleridir. Durum ne olursa olsun hadisin metni Müslim'in bu yoldan önce zikretmiş olduğu diğer rivayet yollarından ve Müslim' den başkalarının zikrettiği yoldan sahih olarak sabittir. (3/214) Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 698,
			"arabicnumber": "304",
			"text": "Bize Ebu Bekr b. Ebi Şeybe ile Ebu Kureyb rivayet ettiler. Dedilerki: Bize Vekî' Süfyan'dan, o da Selemetü'bnü Küheyl'den, o da Kureyb'den, o da İbni Abbas'tan naklen rivayet ettiki: Nebi (Sallallahu aleyhi ve Sellem) geceleyin kalktı, ihtiyacını giderdikten sonra yüzünü ve ellerini yıkadı sonra da uyudu. Diğer tahric: Buhari, 6316; Müslim, 1785, 1791, 1793, 1794; Ebu Davud, 5043; Nesai, 1120; İbn Mace, 508 NEVEVİ ŞERHİ: Bu babta \"İbn Abbas {r.a.)'ın rivayet ettiği Nebi (Sallallahu aleyhi ve Sellem)'in geceleyin kalkıp ihtiyacını görmesi. .. \" ile ilgili hadisi yer almaktadır. Allah en iyi bilendir. Göründüğü kadarıyla ihtiyacını gidermekten kasıt hadestir (abdest bozmaktır). Kadı İyaz böyle demiştir. Yüzü yıkamanın hikmeti uyuklamayı ve uykunun etkilerini ortadan kaldırmaktır. Elleri yıkamak hakkında da Kadı İyaz, ellerine bulaşmış olan bir şey dolayısıyla olabilir, demiştir. Bu hadiste geceleyin uyandıktan sonra uyumanın mekruh olmadığına delil vardır. Bununla birlikte seleften zahid bazı kimselerin bunu mekruh gördükleri de rivayet edilmiştir. Muhtemelen onlar yaptığı gece ibadetini kaçırmayacak ve Nebi (Sallallahu aleyhi ve Sellem)'in yaptıklarına aykırı bir davranış yapmayacak şekilde derin bir uyku uyumayacağından emin olamayan kimseleri kastetmişlerdir. Çünkü O (sallallahu a1eyhi ve sellem) yapageldiği vird ve ibadetlerini kaçırmayacağından emin idi. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Bu hadisin şerhinde Nevevî şunları söylemiştir: Allah-u A'lem kaza-i hacetten murad abdest bozmak olacaktır. Kaadi lyaz'da aynı şeyi söylemektedir. Yüzü yıkamaktaki hikmet uyku eserini gidermektir el yıkamaya gelince Kaadi lyaz: «İhtimal ellerine bulaşan bir şey­den dolayıdır» demiştir. Bu hadis geceleyin uyandıktan sonra tekrar uyumanın mekruh olmadığına delildir. Selefin bazı zahid ve abid zevatından bunun mekruh olduğu nakledilmiştir. İhtimal onlar bundan vazifeye mani olacak derecede dalarak uyumayı kastedmişlerdir. Bu takdirde uykuyu kerih görmeleri Resulullah (Sallallahu Aleyhi ve Sellem) in fi'line muhalif değildir. Çünkü (Aleyhisselatu vesselam)'efendimiz vazife ve evradına mani olacak derecede uykuya dalmazdı.»",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 699,
			"arabicnumber": "305.01",
			"text": "Bize Yahya b. Yahya Et-Temîmî ile Muhammed b. Rumh rivayet ettiler: Dedilerki: Bize Leys haber verdi. H. Bize Kuteybetü'bnü Saîd de rivayet etti. (Dediki): Bize Leys, İbni Şihab'dan, oda Ebu Selemete'bni Abdirrahman'dan, o da Aişe'den naklen rivayet ettiki, Resulullah (Sallallahu aleyhi ve Sellem) cünüp olup, uyumak istediği zaman uyumadan önce namaz abdesti gibi abdest alırdı. Diğer tahric: Ebu Davud, 222, 223; Nesai, 256, 257, 258; İbn Mace, 593 -muhtasar olarak-, 584",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 700,
			"arabicnumber": "305.02",
			"text": "Bize Ebu Bekr b. Ebi Şeybe rivayet etti. (Dediki): Bize Uleyye ile Vekî' ve Gunder, Şu'be'den, o da Hakem'den, o da İbrahim'den o da Esved'den, o da Aişe'den naklen rivayet etti. Şöyle demiş: Resulullah (Sallallahu aleyhi ve Sellem) cünüp olup, bir şeyler yemek yahut uyumak isterse namaz abdesti gibi abdest alırdı. Diğer tahric: Ebu Davud, 224; Nesai, 255; İbn Mace, 591, 467",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 701,
			"arabicnumber": "305.03",
			"text": "Bize Muhammed b. el-Müsenna ile İbni Beşşar rivayet ettiler. Dedilerki: Bize Muhammed b. Ca'fer rivayet etti. H. Bize Ubeydullah b. Muaz dahi rivayet etti. Dediki: Bize babam rivayet etti. Dedi ki: Bize Şu'be bu isnadla rivayet etti. İbnü'I Müsenna kendi rivayetinde: «Bize Hakem rivayet etti. İbrahîmi rivayet ederken işittim dedi» ibaresini kullandı. NEVEVİ ŞERHİ 309.sayfada. DAVUDOĞLU AÇIKLAMA: Bu hadisi Buharî «Kitabul-gusl» de muhtelif ravîlerden tahriç etmiştir. Nitekim Müslim de burada muhtelif ravîler vasıtasiyle onu Hz. Aişe. İbnî Ömer Ebu Saîd-i Hudrî ve Ene (R.A.) dan tahriç etmiştir. Bu babta Ebu Davud ve başkaları Hz. Ali (R.A.) dan merfu' bir hadis rivayet etmişlerdir. O hadiste: «Şüphesiz ki içinde köpek, suret ve cünüb bulunan eve melekler girmez.» denilmektedir: Bazıları babımız hadisi için: «Buharî bunu Ebu Davud hadîsinin zayıf olduğuna işaret olmak üzere tahrîc etmiştir» demişlerdir. Fakat bu söz doğru değildir. Çünkü evvela Ebu Davud hadisi zayıf değil sahihtir. Onun sahih olduğunu İbni Hıbban ve Hakim tasrih etmişlerdir. Zayıf olduğunu söyleyenler isnadında Nüceyy-i Hadramî bulunduğunu bu zattan yalnız oğlu Abdullah rivayet ettiğini onunda meçhul olduğunu söylersede mezkur Abdullahın meçhul değil mevsuk bir zat olduğunu Iclî beyan etmiştir. Binaenaleyh hadisin sıhhatına bir diyecek yoktur. Sonra bu hadîsten murad yıkanmaya kulak asmayıpta cünüp gezmeyi adet edinen ve cünüb olduğu halde üzerinden bir veya birkaç vakit namaz geçenlerdir ki zamanımız hakkında pek mühim bir hüccettir. Çünkü bu gün bir çok kimselerin boyuna cünüb gezdiklerini hatta bir çoklarının cünüblük nedir; bu babta ne gibi bir vazife vardır bilmediklerini kimi gıyaben kimi şifahen işitiyoruz. İşte hadis-i şerif böyle müslümanlara şiddetli bir ihtardır. Ve adeta kulaklarından çekercesine: «Eğer müslümansanız müslümanlığın şerait ve adabını Öğrenin! Bu perişan halinizle sizin evlerinize melekler girmez. Müslüman olduğunuza şehadet edecek kimse bulunmaz; tuttuğunuz şeytanî yol göz göre göre sizi esfel-i safilî'ne götürür...» demektir. Hadisin maazallah dinden dönmüş mürtedlerle yahut müslüman olmayanlarla alakası yoktur. Onun ihtarı müslüman olduğu halde bu gibi cürümleri irtikab edenlerdir. Babımız hadîsine gelince; o da muhtelif rivayetleri ile cünüblüğün hükmünü bildirmektedir. Hulaseten söylemek lazım gelirse hüküm, şudur. Cünüb olan bir kimseye derhal yıkanmak müstehab olmakla beraber farz değildir. Yıkanmayı namaz vakti gelinceye kadar yahut Kur'an-ı kerimi ele almak, okumak. Kabeyi tavaf etmek ve secde-i tilavet gibi cünüp olarak yapılması yasak olan bir ibadeti yapmak isteyinceye kadar tehir edilir. Fakat bunlardan hiç birini cünüb olarak yapamayacağı için o anda yıkanması farz olur",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 702,
			"arabicnumber": "306.01",
			"text": "Bana Muhammed b. Ebî Bekr el-Mukaddemi İle Züheyr b. Harb da rivayet ettiler. Dedilerki: Bize Yahya -ki İbni Saîd'dir- Ubeydullah'tan rivayet etti H. Bize Ebu Bekr b. Ebî Şeybe ile İbni Nümeyr dahî rivayet ettiler. Lafız onlarındır. İbni Nümeyr: Bize babam rivayet etti dedi. Ebu Bekr ise: Bize Ebu Usame rivayet etti dedi. Her ikisi: Bize Ubeydullah, Nafi'den, o da İbni Ömer'den, o da (babası) Ömer'den naklen rivayet etti dediler. Ömer: Ey Allah'ın Resulü bizden bir kimse cünüp olduğu halde uyuyabilir mi, dedi. Allah Resulü: ''Abdest alması halinde evet\" buyurdu. Diğer tahric: Nesai, 259; Tirmizi, 120",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 703,
			"arabicnumber": "306.02",
			"text": "Bize Muhammed b. Rafi'de rivayet etti. (Dediki): Bize Abdurrezzak, İbni Cüreyc'den rivayet etti. (Demiş ki) : Bana Nafi', İbni Ömer'den naklen haber verdi ki: (babası): Ömer, Nebi (Sallallahu aleyhi ve Sellem)'den fetva sorarak: Bizden bir kişi cünüp olduğu halde uyuyabilir mi, dedi. Allah Resulü: \"Evet (ama önce) abdest alsın, sonra -dilerse- gusledinceye kadar uyusun\" buyurdu. Yalnız Müslim rivayet etmiştir; Tuhfetu'l-fşraf, 7781",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 704,
			"arabicnumber": "306.03",
			"text": "Bana Yahya b. Yahya da tahdis edip dedi ki: Malik'e, Abdullah b. Dinar'dan rivayet ile okudum. O İbn Ömer'den şöyle dediğini nakletti: Ömer b. el-Hattab, Resulullah (Sallallahu aleyhi ve Sellem)'e geceleyin cünüp olduğundan söz etti. Resulullah (Sallallahu aleyhi ve Sellem) ona: \"Abdest al, erkeklik organını yıka, sonra uyu\" buyurdu. Diğer tahric: Buhari, 290; Ebu Davud, 221; Nesai, 260 NEVEVİ ŞERHİ 309.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 705,
			"arabicnumber": "307.01",
			"text": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Leys, Muaviyetü'bnü Salih'den, o da Abdullah b. Ebî Kays'tan naklen rivayet etti. Abdullah: Aişe (r.anha)'ya Resulullah (Sallallahu aleyhi ve Sellem)'in vitir namazı hakkında soru sordum deyip, hadisi zikretti. Ben: Peki, cünüplük halinde nasıl yapardı? Uyumadan önce gusleder miydi yoksa gusletmeden önce uyur muydu, dedim. O: Her ikisini de yapardı, bazen gusleder uyurdu, bazen abdest alır uyurdu, dedi. Ben: Bu işte genişlik takdir buyuran Allah'a hamdolsun, dedim. Diğer tahric: Ebu Davud, 1437; Tirmizi, 449 -muhtasar olarak-, 2924",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 706,
			"arabicnumber": "307.02",
			"text": "Bana bu hadisi Züheyr b. Harb da rivayet etti. (Dediki): Bize Abdurrahman b. Mehdî rivayet etti. H. Bana bunu Harun b. Said el-Eylî dahi rivayet etti. (Deki ki) : Bize İbni Vehb. rivayet etti. Bunların ikisi de Muaviyetü'bnü Salih'ten bu isnadla bu hadisin mislini rivayet etmişlerdir. NEVEVİ ŞERHİ 309.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 707,
			"arabicnumber": "308",
			"text": "Bİze Ebu Bekr b. Ebî Şeybe de rivayet etti. (Dediki): Bize Hafs b. Gısas rivayet etti. H. Bize Ebu Kureyb de rivayet etti. (Dediki): Bize İbni Ebî Zaide haber verdi, H. Bana Amru'n-Nakid ile îbni Nümeyr dahî rivayet ettiler. Dedilerki: Bize Mervan b. Muaviyete'I-Fezarî rivayet etti. Bunların üçü de Âsım'dan, o da Ebu'l Mütevekkil' den, o da Ebu Said-i Hudrî'den naklen rivayet etmişler. Ebu Said şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) : \"Biriniz hanımına yaklaştıktan sonra tekrar yaklaşmak isterse abdest alsın\" buyurdu. Ebu Bekr hadisi rivayetinde: İkisi arasında bir abdest (alsın) ibaresini ekledi ve: Sonra bir daha yaklaşmak isterse, dedi. Diğer tahric: Ebu Davud, 220; Tirmizi, 141; Nesai, 262; İbn Mace, 587 NEVEVİ ŞERHİ 309.sayfada. DAVUDOĞLU AÇIKLAMA: Hadis’in muhtelif rivayetlerinden anlaşıldığına göre Hz. Ömer (R.A.) Resulullah (Sallallahu Aleyhi ve Sellem)'e cünüb olarak uyumanın hükmünü sormuştur. Buradaki rivayetlerin zahirine bakılırsa bazı geceler cünüp olan Hz. Ömer'in kendisi isede Nesaî'nin rivayet ettiği bir hadisten bunun İbni Ömer olduğu anlaşılıyor. Çünkü o hadiste: «İbni Ömer cünüb olmuş da (babası) Ömer'e gelerek bunu söylemiş. Ömer (R.A.)'da Resulullah (Sallallahu Aleyhi ve Sellem)'e giderek bu hususta ne emir buyuracağını sormuş. Resulullah (Sallallahu Aleyhi ve Sellem): «Abdesf alsın da öyle uyusun.» buyurmuşlar, deniliyor. Binaenaleyh babımızın 306 nolu Hadis'in 3.rivayetinde Resulullah (Sallallahu Aleyhi ve Sellem)'in «Abdest al; zekerini yıka; sonra uyu.» emri Hz. Ömer'e değil oğlu Abdullahadır. Anlaşılan mes'eleyi sormak için Resul-i Ekrem (Sallallahu Aleyhi ve Sellem)'evvla Ömer (R.A.) gitmiş sonradan oğluda gelmiş ve Resulullah (Sallallahu Aleyhi ve Sellem) cevabı doğrudan doğruya ona vermiştir. Böyle olmasa bile bu emir babası vasıtasiyle yine Hz. Abdullah'a aid olmuş olur. Çünkü verilen cevab bizzat sorana hitaben söylenmiş de olsa sordurana aiddir. Mezkur rivayette: «Abdest al; zekerini yıka; sonra uyu.» buyurulmuş yani evvela abdest sonra zekerini yıkama zikredilmişsede cümleler biribirinin üzerine (vav) la atfedildiği için evvela abdest almak ondan sonra zekerini yıkamak icab etmez. Çünkü atıf edatı olan vav tertibe delalet etmez o yalnız iki şey'in bir araya toplanmasını ifade eder. Şu halde ma'na «Abdest almakla zekerini yıkama işlerinin ikisini birden yap» demek olur. Evvela zeker yıkanıp sonra abdest alınacağı malumdur. Hatta hadisin İmam Malik'ten rivayet edilen lafzı: «Zekerini yıka; sonra abdest al; sonra uyu.» şeklindedir. Asıl olanda budur. Bu rivayet kitabımızdaki rivayetin zahirine göre hüküm vererek: «Evvela abdest alınır; sonra zeker yıkanır.» diyenlerin sözünü reddeder. Çünkü bu abdest hadesle bozulan abdest değil sırf teabdüd için alınan hususi bir abdesttir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 708,
			"arabicnumber": "309",
			"text": "Bize Hasan b. Ahmed b. Ebî Şuayb el-Harranî rivayet etti (Dediki): Bize Miskin yani Bükeyr el-Hazza', Şu'be'den, o da. Hişam b. Zeyd'den o da Enes'den naklen rivayet etti ki, Enes'ten rivayete göre Nebi (Sallallahu aleyhi ve Sellem) bütün hanımlarını dolaşır ve bir defa gusül ederdi. Yalnız Müslim rivayet etmiştir DAVUDOĞLU ŞERHİ AŞAĞIDA NEVEVİ ŞERHİ (697-706) : (697) Aişe (r.anha)'nın rivayet ettiği hadiste: \"Resulullah (Sallallahu aleyhi ve Sellem) cünüp olup uyumak isterse ... \"; (698) \"Cünüp olup bir şeyler yemek yahut uyumak isterse ... \" (700) Ömer (r.a.)'ın rivayetinde: \"Ey Allah'ın Rasuıü ... evet buyurdu.\" (701) rivayetinde \"evet, abdest alsın ... \" (3/216) (702) Bir diğer rivayette \"abdest al ve erkeklik organını yıka sonra uyu\"; (703) rivayetinde \"Resulullah (Sallallahu aleyhi ve Sellem) ... \" (705) rivayetinde \"biriniz ai/esine yaklaştıktan sonra \"; (706) Diğer rivayette \"Resulullah (Sallallahu aleyhi ve Sellem) bütün hanımlarını \" hadisleri yer almaktadır. Bütün bu hadislerden anlaşılan cünüp bir kimsenin gusletmeden önce uyumasının, bir şeyler yiyip içmesinin ve bir daha cima etmesinin caiz olduğudur. Bu hususta icma vardır. İlim adamları ayrıca cünüp olan kimsenin bedeninin ve terinin de tahir olduğunu icma ile kabul etmişlerdir. Bu Hadislerden Ayrıca Şu Hükümler de Anlaşılmaktadır: 1- Bütün bu hususları yapmak için abdest alması ve fercini yıkaması müstehaptır. Özellikle de bundan önce kendisiyle cima etmemiş olduğu hanımı ile cima etmek isterse erkeklik organını yıkamasının müstehap oluşu daha da pekişir. Mezhep alimlerimiz abdest almadan önce bir şeyler yiyip içmenin ve cimaın mekruh olduğunu açıkça ifade etmiş olmakla birlikte, bu hadisler de buna delildir. Bununla birlikte bu abdestin vacip olmadığı hususunda da mezhebimizde görüş ayrılığı yoktur. Malik ve fukahimın cumhuru da böyle demişlerdir. (3/217) Maliki mezhebine mensup İbn Habib ise bu abdestin vacip olduğu kanaatindedir. Davud ez-Zahirl'nin mezhebi de budur. 2- Abdestten maksat namaz için alınan tam bir abdesttir. Bundan önceki babta geçen İbn Abbas'ın rivayet ettiği yalnızca yüzü ve elleri yıkamak ile ilgili hadisin sözkonusu ettiği bu uygulamanın cünüplükte değil de, küçük hadesten dolayı yapıldığını açıklamış idik. Ebu İshak es-Sebli'nin, el-Esved'den, onun Aişe (radıyall&hu anh&)'dan diye rivayet ettiği \"Nebi (Sallallahu aleyhi ve Sellem) cünüp olduğu halde elini suya değdirmeden uyurdu\" şeklindeki hadisi Ebu Davud, Tirmizi, Nesai, İbn Mace ve başkaları rivayet etmiş olup, Ebu Davud: Yezid b. Harun'dan diye rivayette Ebu İshak bu hususta yanılmıştır, demektedir. Kastettiği ise \"elini suya değdirmeden\" ibaresidir. Tirmizi de ilim adamları bunun Ebu İshak'ın bir yanlışlığı olduğu görüşündedirler, demiştir. Beyhaki de şöyle demektedir: Hadis hafızları bu lafzı tenkit etmişlerdir. Böylelikle sözünü ettiğimiz bu ifadelerle hadisin zayıf olduğu açıkça ortaya çıkmaktadır. Zayıf olduğu sabit olduktan sonra bu hadis ile az önce zikrettiklerimize yapılacak bir itiraz kalmamaktadır. Sahih dahi olsa bu hadislere aykırı olmaz. Aksine buna iki şekilde cevap verilebilir: Birincisi, iki büyük imam Ebu'l-Abbas b. Şureyh ile Ebu Bekr elBeyhaki'nin verdikleri şu cevaptır: Bundan kasıt gusletmek maksadıyla elini suya değdirmezdi, ikincisi ise -ki bu bana göre güzel bir cevaptır- maksat caiz olanı da beyan etmek için bazı hallerde kesinlikle elini suya değdirmezdi, şeklindedir; çünkü bu işi ısrarla devam ettirseydi, bunun farz olduğu zannına kapılmak mümkün idi. Allah en iyi bilendir. 3- Resulullah (Sallallahu aleyhi ve Sellem)'in bütün hanımlarını dolaşmakla birlikte sadece bir defa gusletmesine gelince, hanımlarının birinin yanından öbürüne giderken arada abdest alıyor olması ihtimali vardır. Yahut bundan maksat abdest almamanın caiz olduğunu beyan etmekti. Ebu Davud'un Sünenindeki rivayete göre Resulullah (Sallallahu aleyhi ve Sellem) bir gece hanımları nı dolaştı. Bunun yanında da yıkanıyordu, öbürünün yanında da yıkanıyordu. Ey Allah'ın Resulü niçin hepsi için bir defa gusletmiyorsun diye sorulunca, O: \"Böylesi daha temiz, daha hoş ve daha paktır\" buyurdu. Ebu Davud dedi ki: Ama birinci hadis daha sahihtir. Derim ki: Bu hadisin sahih olduğu kabul edilecek olursa bir zaman böyle, bir zaman da böyle yaptığı anlamına gelir. Allah en iyi bilendir. İlim adamları bu abdestin hikmeti hususunda farklı kanaatlere sahiptir. Mezhep alimlerimiz bunun hadesi hafiflettiğini söylemişlerdir; çünkü abdest ile abdest azalarının hadesi (abdestsizliği, gusulsüzlüğü)nü kaldırır. Ebu Abdullah el-Mazerı (r.a.) dedi ki: Bunun hikmeti hususunda farklı görüşler vardır. Uyurken ölür korkusu ile iki temizlik halinden birisi üzere uyumak için denildiği gibi, organlarına su değmesi halinde gusletme şevkini artırma ihtimali dolayısıyladır da denilmiştir. el-Mazerı devamla şöyle der: Sözkonusu bu görüş ayrılığı ay hali olanın uyumadan önce abdest alması hakkında da geçerlidir. Bunun abdest1i olarak uyuma hikmetine bağlı olduğunu kabul edenler bu durumdaki bir kadının abdestli uyumasını müstehap kabul etmişlerdir. Mazerl' nin sözleri bunlardır ama bizim mezhep alimlerimiz ay hali ve loğusa kadının abdest almasının müstehap olmadığı üzerinde ittifak etmişlerdir. Çünkü abdest almanın onların hadeslerinde herhangi bir etkisi yoktur; ama ay hali olanın şayet kanı kesilmiş ise cünüp bir kimse gibi olur. Allah en iyi bilendir. Nebi (Sallallahu aleyhi ve Sellem)'in hanımlarını dolaşıp, tek bir defa gusletmesi ise bunun onların rızası ile olduğu yahut eğer onlardan birisinin sırası ise sırası olanın rızasıyla olduğu şeklinde yorumlanır. Böyle bir yoruma ise, bize vacip olduğu gibi, zevceleri arasında paylaştırmak Resulullah (Sallallahu aleyhi ve Sellem)' e de vacip idi, diyenlerin ihtiyaç duyacağı bir yorumdur. Onun hakkında bunun farz olmadığını kabul edenlerin ise böyle bir yoruma ihtiyaçları yoktur; çünkü O bu gibi hususlarda dilediğini yapmakta serbesttir. Günleri paylaştırmanın vücubu ile ilgili (3/218) bu görüş ayrılığı aynı zamanda bizim mezhep alimlerimizin de bu husustaki iki farklı görüşünü ifade eder. Allah en iyi bilendir. 4- Bu babta sözkonusu edilmiş hadislerde cünüplükten dolayı derhal gusletmenin gerekmediğini ancak namaza kalkılması halinde insan için gusletmenin sözkonusu olduğunu ortaya koymaktadır. Bu hususta da Müslümanlar icma halindedir. 5- Mezhep alimlerimiz cünüplük guslünü neyin icap ettirdiği hususunda farklı görüşlere sahiptirler. Acaba cünüplük iki sünnet yerinin birbirine kavuşmasıyla mı gerçekleşir yoksa meninin inzali ile mi yoksa namaza kalkmakla mı, yoksa cünüplük namaza kalkmak ile birlikte mi sözkonusu olur? Bu hususta mezhep alimlerimizin üç görüşü vardır. Gusletmeyi gerektiren cünüplüktür diyenler bu vakti geniş (muvassa') bir vücub ifade eder derler. Aynı şekilde abdest almayı gerektiren husus hakkında da ihtilaf etmişlerdir. Bu hades midir yoksa namaza kalkmak isteği midir yoksa her ikisinin toplamı mıdır? Aynı zamanda ay hali guslünü neyin gerektirdiği hususunda ihtilaf etmişlerdir. Acaba onu gerektiren kanın çıkması mıdır yoksa kesilmesi midir? Allah en iyi bilendir. Babın senetleri ile ilgili söyleneceklere gelince (699) \"İbnu'l-Müsenna hadisi rivayetinde: Hakem'den ben İbrahim'i tahdis ederken dinledim, dedi\" sözlerinin anlamı şudur: İbnu'l-Müsenna, Muhammed b. Cafer'den, o Şu'be'den rivayetinde Şu'be dedi ki: Bize Hakem tahdis edip dedi ki: Ben İbrahim'i tahdis ederken dinledim. Önceki rivayette ise Şu'be, Hakem'den, o İbrahim' den şeklindedir. İkinci rivayetten maksat birincisinden daha güçlüdür; çünkü birinci rivayette iki defa \"an\" lafzı kullanılırken, ikinci rivayette bize tahdis etti ve dinledim denilmektedir. Tahdis etti ve dinledim ifadelerinin \"an\" tabirinden daha güçlü olduğu bilinen bir husustur. Bununla birlikte ilim adamlarından bir topluluk \"an\" lafzı senedin muttasıl olmasını gerektirmez, isterse tedlis yapmayan bir ravi tarafından kullanılmış olsun, derler. Bizler bunun açıklamasını baştaki fasıllarda ve ondan sonraki pek çok yerde yapmış bulunmaktayız. Allah en iyi bilendir. \"Muhammed b. Ebu Bekr el-Mukaddemi dedesi \"Mukaddem\"e nispetlidir. Bunun açıklaması daha önce birkaç defa geçti. Ayrıca senette Ebu'lMütevekkil, Ebu Said'den isnadı vardır ki buradaki Ebu'l-Mutevekkil enNaci nispetli olup, adı Ali b. Davud'dur. Dal harfi ötreli \"bin Duvad\" da denilmiştir. Bilinen bir kabile olan Naciye oğullarına mensuptur. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Bu hadisi Buharî biraz lafız farkiyle «Kitabu'I Gusul» de bir iki yerde Nesaî dahi «Işratü'n-Nisa» bahsinde tahrîc etmişlerdir. Buharî 'nin bir rivayetinde o gün Resulullah (Sallallahu Aleyhi ve Sellem) in dokuz zevcesi diğer rivayetinde onbir zevcesi olduğu beyan ediliyor. Bu cihet ulema arasında ihtilaflıdır. Hadîs-i Şerifteki tavaftan murad cima'dir. Buharî 'nin rivayetinde Katade'nin: «Enes'e Resulullah (Sallallahu Aleyhi ve Sellem) buna dayanabîliyormuydu ? dedim Enes: Biz aramızda ona otuz erkek kuvveti verildiğini konuşuyorduk cevabını verdi» demeside bunu gösterir. Resulullah (Sallallahu Aleyhi ve Sellem) in bir gusulle bütün kadınlarını dolaşmasının birkaç veçhe ihtimali vardır, Şöyleki: 1- Bunu seferden geldiği zaman yapmıştır. Çünkü o zaman Kasm denilen zevceler arasında adalete riayet lazım değildir. Nebi (Sallallahu Aleyhi ve Sellem) sefere çıkarken zevceleri arasında kur'a çektirir; kur'a kime düşerse beraberine onu alırdı. Döndüğü zaman kasme yine başlardı. Fakat başlarken bu hakta bütün zevceleri müsavi olduğu için hiç birini tercih etmez bir defada hepsinin yanına uğrar kasme ondan sonra başlardı. 2- Birden tavaf meselesi zevcelerinin rızası ile olmuştur. 3- Mühelleb'e göre bu iş zevceleri arasında kur'a çektirerek sefere çıkacağı gün olmuştur. Çünkü kur'a dan sonra kasme riayet lazım değildir. Ancak bu te'viller Resulullah (Sallallahu Aleyhi ve Sellem)'e zevceleri arasında devam üzre müsavata riayet farzdır diyenlere göredir, ki ekseri ulemanın kavli budur. Ona kasm vacip değildir diyenlere göre hadisi te'vile hacet yoktur. İbnü'l Arabî diyor ki: Allah nikah babında bazı şeyleri Nebiine tahsis buyurmuştur. Onlardan biride kendisine bir saat tahsis etmesidir o vakitte zevcelerinin onun üzerinde hakkı yoktur. Onların hepsinin yanına, girer kendilerine dilediği muameleyi yapar sonra nevbet sırası hangisinin ise ona döner. Müslim'in kitabında İbn-i Abbas'tan rivayet edilen bir hadiste bu saati'n ikindiden sonra .olduğu bildirilmektedir.» Resulullah (Sallallahu Aleyhi ve Sellem)'in zevcelerini bir gusulle fakat ayrı ayrı abdest alarak tavaf etmiş olması muhtemeldir. Yahut abdest almadan bir gusulle hepsini dolaşmış ve bununda caiz olduğunu göstermek istemiştir. Ebu Davud'un «Sünen» inde rivayet ettiği bir hadîste: «Nebi (Sallallahu. Aleyhi ve Sellem) bir gece bütün kadınlarını ziyaret etti ve her birinin yanında ayrı ayrı yıkandı. Kendisine: Ya Resulallah (Sallallahu Aleyhi ve Sellem) Neden bir defa yıkanmakla iktifa etmiyorsun? dediler. Resulullah (Sallallahu Aleyhi ve Sellem): «Böyle yapmak daha pak daha temiz ve daha iyidir.» buyurdular, denilmektedir. Ebu Davud evvelki rivayetin bu rivayetten daha sahih olduğunu söylemiştir. Rivayetlerin ikisi de sahih olduğuna göre bazan arada yıkanmış bazan yıkanmamış demek olur. Nevevî cima'dan evvel alınan abdestin hikmeti hakkında şunları söylüyor: «Ulemamız hikmeti ;hadesi hafifletmesidir. Çünkü abdest azadan hadesi giderir. Diyorlar. Ebu Abdillah Mazirî diyorki: Bu abdestin sebeb-i hikmeti ihtilaflıdır. Bazıları uyku esnasında ölürüm korkusu ile iki taharetten biriyle gecelemiş olmak için almıştır, demiş; bir- takımları da ihtimal abdest alması yıkanmaya neşatı açılsın içindir demişlerdir. Aynı hilaf hayzlı kadının uykudan önce abdest alması hususunda da mevcuttur. Geceyi temiz geçirmekle ta'lil edenlere göre kadının abdest alması müstehabtır. Mazirinin sözü budur. Ulemamıza gelince: Onlar Hayz ve nifaslı kadınlara abdest almanın müstehab olmadığında ittifak etmişlerdir. Çünkü bu kadınların hadeslerine abdestin bir tesiri yoktur. Kadının hayzı kesildimi cünüb gibi olur.» Babımız hadisleri cünüblükten yıkanmanın fevrî olmadığına yani derhal yıkanmak farz değil namaz gibi temizliğe mütevakkıf bir ibadet yapılacağı zaman farz olduğuna delildirler. Bu babta bütün ulema müttefiktir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 709,
			"arabicnumber": "310",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Ömer b- Yunus el Hanefî rivayet etti. (Dediki): Bize İkrimetü'bnü Ammar rivayet etti. Dediki: İshak b. Ebî Talha: Enes b. Malik bana şunu rivayet etti dedi. Enes şöyle demiş. Ümmü Suleym -ki İshak'ın büyük annesidir- Resulullah (Sallallahu aleyhi ve Sellem)'e gelerek -Aişe de yanında bulunuyorken- ona: Ey Allah'ın Resulü, kadın erkeğin rüyada gördüğünü görür, erkeğin kendisinden hissettiğini kadın da hisseder (ise durum ne olacak), dedi. Aişe (r.anha): Ey Ümmü Suleym sağ elin toprağa değsin kadınları rezil ettin, dedi. Allah Resulü Aişe'ye: \"Hayır, asıl senin sağ elin toprağa değsin. Evet, ey Ümmü Suleym, o dediğini görecek olursa kadın gusletsin\" buyurdu. Yalnız Müslim rivayet etmiştir AÇIKLAMALAR 314.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 710,
			"arabicnumber": "311",
			"text": "Bize Abbas b. Velid tahdis etti. Bize Yezid b. Zurey' tahdis etti. Bize Said, Katade'den tahdis ettiğine göre Enes b. Malik kendilerine şunu tahdis etti: Ümmü Suleym'in tahdis ettiğine göre o Allah'ın nebisine rüyasında erkeğin gördüğünü gören kadın hakkında Resulullah (Sallallahu aleyhi ve Sellem)'de: \"Kadın onu görecek olursa gusletsin\" buyurdu. Ümmü Suleym: Ben bundan dolayı haya ettim, dedi. (Yine Ümmü Suleym) dedi ki: Peki, böyle şey olur mu, dedi. Allah'ın Nebisi: \"Evet, yoksa benzerlik nereden gelecek. Çünkü erkeğin suyu kalın ve beyaz, kadının suyu ince ve sarıdır. Bunların hangisi üste çıkar, yahut daha öne geçerse, ondan dolayı benzerlik de ortaya çıkar\" buyurdu. Diğer tahric: Nesai, 195 -muhtasar olarak-, 200; İbn Mace, 601 AÇIKLAMALAR 314.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 711,
			"arabicnumber": "312",
			"text": "Bize Davud b. Ruşeyd rivayet etti. (Dediki): Bize Salih b. Ömer rivayet etti. (Dediki): Bize Ebu Malik-i Eşcaî, Enes h, Malik'ten naklen rivayet etti. Enes şöyle demiş: Bir kadın Resulullah (Sallallahu aleyhi ve Sellem)'e erkeğin rüyasında gördüğünü rüyasında gören kadının durumu hakkında soru sordu, O: \"(Böyle bir durumda) erkekten görülen hal onda da görülürse guslediversin\" buyurdu. Yalnız Müslim rivayet etmiştir AÇIKLAMALAR 314.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 712,
			"arabicnumber": "313.01",
			"text": "Bize Yahya b. Yahya et-Temimî de rivayet etti. (Dediki): Bize Ebu Muaviye, Hişam b, Urveden, o da babasından, o da Zeyneb binti Ebî Seleme'den, o da Ümmü Seleme'den naklen haber verdi. Ümmü Seleme şöyle demiş: Ümmü Suleym, Nebi (Sallallahu aleyhi ve Sellem)'e gelip: Ey Allah'ın Rasulü, muhakkak ki Allah haktan haya etmez. İhtilam olduğu takdirde kadının gusletme yükümlülüğü var mı, dedi. Rasulullah (Sallallahu aleyhi ve Sellem): \"Suyu gördüğü takdirde evet\" buyurdu. Ümmü Seleme: Ey Allah'ın Resulü, kadın ihtilam olur mu, dedi. Allah Resulü: \"İki elin toprağa değsin. çocuğu ona ne ile benzer ki?\" buyurdu. Diğer tahric: Buhari, 130,282 -muhtasar olarak-, 3328, 6091, 6121 -muhtasar olarak-; Tirmizi, 122 -buna yakın-, 600",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 713,
			"arabicnumber": "313.02",
			"text": "Bize Ebu Bekr b. Ebi Şeybe ve Zuheyr b. Harb da tahdis edip dediler ki: Bize Vekl' tahdis etti. (H) Bize İbn Ebu. Ömer de tahdis etti, bize Süfyan tahdis etti. Hepsi Hişam b. Urve'den aynı manada bu isnadla hadisi rivayet etti. Ayrıca: (Um Seleme) dedi ki: Ben de: Kadınları rezil ettin, dedim. AÇIKLAMALAR 314.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 714,
			"arabicnumber": "314.01",
			"text": "Bize Abdülmelik b. Şuayb b. Leys de rivayet etti. (Dediki): Bana babam dedemden rivayet etti.. (Demişki): Bana Ukayl b. Halid, ibnî Şihab'dan rivayet etti. İbnî Şihab şöyle demiş: Urve b. Zubeyr'in haber verdiğine göre Nebi (Sallallahu aleyhi ve Sellem)'in zevcesi Aişe ona şunu haber verdi: Ebu Talha'nın oğullarının annesi olan Ümmü Suleym, Resulullah (Sallallahu aleyhi ve Sellem)'in huzuruna girdi ve Hişam'ın hadisi ile aynı manada hadisi rivayet etti. Ancak onun rivayetinde o şöyle dedi: Aişe dedi ki: Ben de ona: Üf senden, kadın böyle bir şey görür mü, dedim. Diğer tahric: Ebu Davud, 237; Nesai, 196",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 715,
			"arabicnumber": "314.02",
			"text": "Bize İbrahim b. Musa er-Razi, Se hı b. Osman ve Ebu Kureyb -ki lafız Ebu Kureyb' e attir- tahdis etti. Sehl bize İbn Ebu Zaide, babasından tahdis etti derken, diğer ikisi haber verdi, dediler. Babası Mus'ab b. Şeybe'den, oMusafi b. Abdullah'tan, o Urve b. ez-Zubeyr'den, o Aişe'den rivayet ettiğine göre bir kadın Resulullah (Sallallahu aleyhi ve Sellem)'e kadın ihtilam olup, suyu görürse gusleder mi, dedi. Allah Rasülü: \"Evet\" buyurdu. Aişe ona: Ellerin toprağa değsin ve harbe sana isabet etsin, dedi. Rasülullah (Sallallahu aleyhi ve Sellem): \"Onu bırak. Zaten {çocuğun} benzemesi bundan başka bir sebepten dolayı mı 'olur? Kadının suyu erkeğin suyundan yukarı çıkarsa çocuk dayılarına benzer, erkeğin suyu kadının suyu üzerine çıkarsa amcalarına benzer\" buyurdu. Yalnız Müslim rivayet etmiştir NEVEVİ ŞERHİ AŞAĞIDA DAVUDOĞLU AÇIKLAMA: Bu hadisi Buhari «Kitabu't-Tahare», «Kitabu'l Edep» ve «Halk-ı Adem» de Ebu Davud, Tirmîzî, Nesaî ve İbni Mace «Kitabu't-Tahare» de muhtelif ravîlerden tahrîc etmişlerdir. Hadîsin muhtelif rivayetlerinden anlaşılıyor ki Resulullah (Sallallahu Aleyhi ve Sellem)'e Suali soran kadın Ünımü Süleym'dir. Müslim'in Abbas b. Velid .den tahriç ettiği 311 numaralı hadiste: «Ünımü Süleym ben bundan utandım (ama yinede) Bu olurmu diye sordum dedi.» buyuruluyor. Hafız Ebu Ali el-Gassanî bunun yerine bazı nüshalarda Ümmü Seleme zikredildiğini söylemişsede Kaadî Iyaz: «Doğrusu Ümmü Süleym'dir. Çünkü bu hadiste suali soran Ümmü Süleym, ona itiraz eden Ümmü Seleme'dir. Önceki hadiste ise itirazı yapan Aişe (R.A.)'dır. Âişe ile Ümmü Selemenin hep birden itiraz etmiş olmaları da muhtemeldir» diyor. Ümmü Süleym (R.A.) Resulullah (Sallallahu Aleyhi ve Sellem)'e uyku esnasında kadının ihtilam olmasının hükmünü sormuştur. Kadınların bu meseleyi erkeklere açması adeten ayıp ve utanılacak bir şey sayıldığı için Hz, Ümmü Süleym sualini kendine hass bir nezaketle kapalı bir şekilde sorduğu halde Aişe ve Ümmü Seleme (R.A.) dayanamayıp itiraz etmişlerdir. Hz. Âişe'nin: «Ya Ümme Süleym kadınları kepaze ettin» diyerek onların daima sakladıkları utanılacak bir sıfatlarını söylediğinden dolayı Ümmü Süleym'i muahaze etmiştir. Çünkü kadınlardan menî gelmesi onların erkeklere karşı fazla şehvetli olduklarına delalet eder. Hazreti Ümmi Süleym'in sorduğu suali Resulullah (Sallallahu Aleyhi ve Sellem) 'e Havle binti Hakîm, Sehle binti Süheyl ve daha başka kadınlarda sormuşlardır. Resulullah (Sallallahu Aleyhi ve Sellem) in cevaben «Evet! Ya benzerlik nereden geliyor?» sözünün manası: Çocuk erkekle kadının menilerinin karışmasından meydana gelir. Bunların hangisi galebe çalarsa çocuk ona benzer demektir. Bu sözü müteakip: «Erkeğin suyu (menisi) koyu beyazdır; kadınınla İse sıvı ve sarı.» buyurmuştur. Bu îzahat meninin sıfatı hakkında büyük bir kaide olmuştur. Sağlam olan erkek ve kadınların ekseriyetle menilerinin sıfatı budur. Ulemanın beyanına göre erkek menisinin üç hassası vardır. 1- Yaş olduğu zaman kokusu hamur kokusuna; kuru olduğu zaman ise yumurta kokusuna benzer. 2- Atıla atıla gelir. 3- Dışarıya lezzetle çıkar; çıktıktan sonra da bir gevşeklik arız olur. Ekseri ulemaya göre bu üç sıfatta erkekle kadın menileri arasında fark yoktur. Mezkur sıfatların bir tanesi meniyi İspat için kafidir. Bu sıfatlardan hiç biri bulunmazsa çıkan suya meni hükmü verilmez. NEVEVİ ŞERHİ (707-713) : Bu babta (707) \"Um Suleym (r.a.)'ın Ai'şe (r.anha) yanında iken Resulullah (Sallallahu aleyhi ve Sellem)'e ... \" (3/219) hadisi yer almaktadır. Sözü geçen bu babta geri kalan rivayetler de yer almıştır. Yüce Allah'ın izniyle yeri geldikçe bunları göreceğiz. Şunu bilmek gerekir ki, kadının menisi dışarı çıkacak olursa erkeğe dışarı çıkması sebebiyle gusletmek icab ettiği gibi, kadının da gusletmesi icab eder. Esasen Müslümanlar meninin çıkması yahut erkeklik organının ferce sokulması ile kadına da, erkeğe de gusletmenin vacip olduğu üzerinde icma ettikleri gibi, ay hali ve loğusalık sebebiyle de kadının gusletmesinin icab ettiğinin üzerinde icma etmişlerdir. Fakat doğum yapmakla birlikte hiçbir şekilde kan görmeyen kadına guslün icap edip etmediği hususunda farklı görüşlere sahiptirler. Ancak mezhep alimlerimize göre daha sahih olan gusletmenin vacip olduğudur. Şayet kadın bir çiğnem et yahut bir parça kan düşük yapacak olursa aynı şekilde görüş ayrılığı sözkonusudur. Daha sahih olan gusletmesinin vacip olduğudur. Bununla birlikte bu gibi kimseler hakkında guslün vacip olmadığını söyleyenler abdest almasının vacip olduğunu söylemişlerdir. Allah en iyi bilendir. Diğer taraftan bizim mezhebimizde kabul edilen görüş, ister şehvetle ve hızlıca çıksın, ister bakarak, ister rüyada iken, ister uyanıkken çıksın, ister aklı başında olan birisinden çıksın, ister deliden çıksın meninin çıkması ile guslün vacip olduğudur. Ayrıca meninin çıkmasından maksat ise dışarıya çıkmasıdır. Eğer dışarıya çıkmamışsa gusletmek icap etmez. Şöyle ki, uyuyan bir kimse cima' ettiğini yahut inzal yaptığını görmekle birlikte uyandığında bir şey görmeyecek olursa Müslümanların icmaı ile gusletmek yükümlülüğü yoktur. Aynı şekilde meninin çıkmasının başlangıç hali sebebiyle vücudu harekete geçmiş olmakla birlikte, meni dışarı çıkmazsa yine meni erkeklik organının dibine indikten sonra dışarı çıkmayacak olursa gusül gerekmez. Hatta meni -kendisi namazda iken- erkeklik organının ortasına gelse ve bir şey üzerinden eliyle erkeklik organını tutsa namazından selam verinceye kadar men i dışarı çıkmazsa namazı sahih olur ve meni dışarı çıkıncaya kadar abdest1i kalmaya devam eder. Bu hususta kadın da erkek gibidir. Ancak kadın dul yahut evlenmiş olup, meni fercine inip, cünüplük ve istinca sırasında yıkaması gereken yere bulaşacak olursa -bu yer ise ihtiyacını karşılamak için oturması halinde görünen kısımdır- meninin bu yere ulaşması sebebiyle gusletmesi gerekir; ünkü bu yer zahir (görünen) kısım hükmündedir. Şayet bakire ise, fercinden dışarıya çıkmadıkça gusletmesi de gerekmez; çünkü onun fercinin iç kısmı erkeğin ihlilinin498 iç kısmı gibidir. Allah en iyi bilendir. Babtaki Lafızlar ve Babın İhtiva Ettiği Anlamlar Um Suleym, Enes b. Malik'in annesidir. Adı hakkında ilim adamları ihtilaf etmişlerdir. Sehle, Muleyke, Rumeysa, Uneyfe olduğu (3/220) söylendiği gibi, er-Rumeyda, el-Gumeyda olduğu da söylenmiştir. Kendisi kadın sahabilerin faziletlilerinden ve meşhurlarından idi. Milhan kızı Ümmü Haram'ın kızkardeşidir. Allah her ikisinden de razı olsun. Allah en iyi bilendir. Aişe (r.anha)'nın: \"Kadınları rezil (rüsvay) ettin\" demesi de sen onlar hakkında kendilerinin gizledikleri ve onunla nitelenmekten haya ettikleri bir hususlarını anlattın, demektir. Bu ise onlardan meninin gelmesidir ki bu da erkekleri ileri derecede arzuladıklarını gösterir. \"Sağ elin toprağa değsin\" sözü hakkında selefin ve halefin bütün fırka ve kesimlerinin oldukça yaygın ve pek çok farklı açıklamaları vardır. Anlamı ile ilgili muhakkiklerin benimsedikleri daha güçlü ve daha sahih olan görüşe göre bunun asıl anlamı fakir olasın demek olduğudur ama Araplar asıl anlamının hakikatini kastetmemek üzere bunu kullanmayı adet edinmişlerdir. Bu sebeple Araplar elleri n toprağa değsin, Allah onu kahretsin, ne kahramandır, annesiz kalasıca, babasız kalasıca, annesi onu kaybedesice, vayanasının haline ve buna benzer lafızları bir şeye karşı tepkilerini ortaya koymak yahut o işten vazgeçilmesini ya da o iş yapıldığı için yermeyi yahut büyük gördüklerini anlatmayı ya da o işe teşvik etmeyi yahut onu beğenmeyi ifade etmek üzere kullanırlar. Allah en iyi bilendir. (707) Resulullah (Sallallahu aleyhi ve Sellem)'in Aişe'ye: \"Hayır, asıl senin sağ elin toprağa değsin\" sözünün anlamı: Bu sözlerin sana söylenmesi daha uygundur çünkü o dini ile ilgili sorması gerekeni sordu, bu sebeple tepki gösterilmeyi hak etmedi ama sen tepki gösterilmemesi gereken bir işe tepki gösterdiğin için tepki gösterilmeyi hak ettin. 498 Erkek tenasül organının deliği, sidik yolu. Sidik deliği. \"Sağ elin toprağa değsin\" (ve) \"hayrolsun\" evet çoğu asıllarda bu şekildedir ve bu (hayrolsun) bir tefsirdir. Bununla birlikte bu tefsir pek çok asıl nüshada yer almamıştır. Aynı şekilde Kadı İyaz da bu tefsirin bulunup bulunmaması hususundaki ihtilMı sözkonusu etmiştir. Diğer taraftan bu kelimenin bulunduğunu söyleyenler nasıl okunacağı hususunda ihtilM etmişlerdir. Metali' sahibi ve başkaları çoğunluk bunu şerrin zıttı \"hayr\" diye okumuşlardır. Bazıları ise bunu \"haber\" diye okumuşlardır. Kadı İyaz der ki: Bu ikinci okuyuşun kıymeti yoktUr. Derim ki: Her ikisi de doğrudur, o bu sözü ile ona ağır söz söylemek istememişti ama söylenmesi alışkanlık haline getirildiği için dilden dökülüveren bir söz olarak söylemişti. ikincisine göre bu bir beddua değildir, aksine gerçek anlamı kastedilmeyen bir haberdir, demektir. (708) \"Bize Abbas b. Velid tahdis etti. Bize Yezid b. Zurey' tahdis etti.\" Müslim'in kitabını rivayet eden bazı kimseler \"Abbas\" ismini ye ve şın harfi ile \"Ayyaş\" olarak tashif etmişlerdir. Bu ise apaçık bir yanlıştır çünkü sözü edilen bu Ayyaş, Ayyaş b. Velid er-Rakkam el-Basri' dir. Müslim ise ondan hiçbir rivayet nakletmemiştir (3/221) ama Buhari ondan rivayet almıştır. Abbas da b. Velid el-Basri et-Tirsi'dir. Ondan hem Buhari, hem Müslim rivayet etmişlerdir. Bu hakkında görüş aynlığı bulunmayan hususlardandır. Ayyaş diyen kimsenin bu yanlışlığı ise her ikisinin babasının nesebinin ve yaşadıkları çağın ortak olmasından kaynaklanmaktadır. Allah en iyi bilendir. \"Um Suleym dedi ki: Ben bundan utandım.\" Asıl yazmalarda bu şekildedir. Hafız Ebu Ali el-Gassanıde nüshaların birçoğunda bu şekilde olduğunu ama bunun bazı nüshalarda değişikliğe uğratılarak: \"Um Seleme dedi ki\" şekline sokulduğunu söylemiştir. Halbuki değişik yollardan mahfuz olan \"Um Seleme\" dir. Kadı İyaz der ki: işte doğrusu da budur çünkü bu soruyu soran Ümmü Suleym'dir, ona bu hadiste karşılık veren de Ümmü Seleme'dir, önceki hadiste ise Aişe' dir. Hadis ehli alimler burada sahih olan Aişe değil, Ümmü Seleme'dir demekte iseler de Aişe ve Ümmü Seleme'nin birlikte ona tepki göstermiş olmaları da ihtimal dahilindedir. Allah en iyi bilendir. Resulullah {Sallallahu aleyhi ve Sellem)'in: \"Benzer/ik nerede?\" buyruğu şu demektir: Çocuk hem erkeğin, hem kadının suyundan doğar. Hangisi daha galip gelirse ona benzer. Kadının menisi olduğuna göre onun inzali ve ondan dışarıya çıkması da mümkündür. \"Erkeğin suyu ka/ın ve beyazdır ... \" Bu meninin niteliğinin açıklanmasında pek büyük bir esas dayanaktır. Sağlıklı iken ve çoğunlukla niteliği budur. ilim adamları der ki: Sağlıklı iken erkeğin menisi beyaz, katı ve arka arkaya hızlıca çıkan, şehvetle çıkıp, çıkması ile lezzet ve zevk alınan bir sudur. Çıkmasının akabinde ise bir rahatlama ve gevşeklik ile hurmanın yeni meyvesi gibi bir kokusu olur. Bu koku ise hamur kokusuna yakındır. Kokusunun taze hurma ağacı fidanına benzediği de söylenir. Kuruduğu takdirde ise kokusunun sidik kokusuna benzediği söylenmektedir. Bunlar meninin nitelikleridir. Bazı nitelikleri de farklı olabilir. Mesela kişi hastalanacak olursa menisi ince ve sarı olabilir, yahut meninin bulunduğu yerde gevşeklik olduğundan ötürü zevk almadan ve şehvet olmadan da akabilir, ya da çokça cima yaptığı için etsuyu gibi kırmızı bir renk alır. Hatta bazen pıhtılaşmış bir kan gibi de çıkabilir. Meni kırmızı renkte çıkacak olursa tahirdir ve tıpkı beyaz olması halinde olduğu gibi gusletmeyi gerektirir. Meninin Meni Olarak Kabul Edilmesi İçin Dayanak Alınan Üç Özelliği Vardır: 1 - Akabinde bir rahatlama ile birlikte şehvetle çıkması 2- Az önce geçtiği gibi kokusunun taze hurma kokusuna benzemesi 3- Kısım kısım defalarca arka arkaya dışarı çıkması Bu üç özellikten her birisi o suyun meni olduğunu ispatlamaya yeterlidir. Bütün bu üç özelliğin onda bulunması şartı yoktur. Fakat bunların hiçbirisi bulunmayacak olursa, onun meni olduğuna hükmedilmez ve zannı galible meni olmadığı kanaatine sahip olunur. Söylediğimiz bütün bu hususlar erkeğin menisi ile ilgilidir. Kadının menisine gelince, o sarımtrak ve incedir. Bazı hallerde kadının gücünden ötürü beyaz da olabilir. Bunun iki özelliği vardır ki, bu ikisinden birisiyle meni olduğu anlaşılır. Birincisi kokusu erkeğin menisinin kokusu gibidir, ikincisi ise çıkması sebebiyle zevk almak ve çıkmasından sonra şehvetinin dinmesidir. ilim adamları der ki: Meni hangi nitelik ve durumda çıkarsa çıksın gusletmek icap eder. Allah en iyi bilendir. \"Hangilerinden üste çıkar ya da öne geçerse ... \" diğer rivayette (713) \"kadının suyu erkeğin suyunun üstüne çıkarsa ... \" buyurulmuştur. ilim adamları der ki: Burada üste çıkmaktan kasıt öne geçmek de olabilir, şehvetin gücüne göre çokluk ve güç de kastedilmiş olabilir. (709) \"Eğer erkekte görülen halonda da olursa gusletsin\" sözlerinin anlamı şudur: Kadının menisi dışarı çıkarsa o da gusletsin. Nitekim erkeğin de menisi dışarıya çıkacak olursa gusleder. Bu şekildeki tabir güzel ve latif hitabın bir neticesi, adeten utanılan bir lafzı kullanmak yerine güzel lafzın kullanılması türündendir. Allah en iyi bilendir. (710) \"MuhakkakAllah haktan haya etmez.\" ilim adamIarı der ki: (3/223) Yani AlI ah hakkı açıklamaktan imtina etmez. O sivrisinek ve benzerierini de örnek verir. Nitekim yüce AlIah şöyIe buyurmaktadır: \"Gerçekten Allah bir sivrisineği yahut ondan daha üstün herhangi bir şeyi misal vermekten çekinmez. \" (Bakara, 2/26) işte ben de aynı şekilde ihtiyacım oIan bir husus hakkında soru sormaktan çekinmiyorum. AnIamının şu olduğu da söyIenmiştir: AlIah hak ile ilgili hususIarda utanmayı emretmez ve mübah da görmez. O, bu sözIerini adeten kadınIarın hakkında soru sorup, erkeklerin önünde sözkonusu etmekten haya edip, utandıkları ama sorma ihtiyacını duyduğu sorusundan önce mazeret oImak üzere söyIemiştir. Bundan da: 1- Bir meseIe ile karşı karşıya gelen bir kimsenin ona dair soru sorması gerektiği 2- Haya edip utanması onu o meselesini sözkonusu etmekten alıkoymaması gerektiği anIaşılmaktadır. 3- Böyle bir soru sormaktan çekinmek gerçek bir haya değildir; çünkü hayanın tamamı hayırdır ve hayırdan başka bir şey getirmez. Ama böyIe bir duruma dair soru sormaktan uzak durmak hayır değildir, aksine şerdir. Bu nasıl haya olabilir ki? iman kitabının baştaraflarında bu meseIenin açıkIamasl geçmiş idi. Aişe (r.anha)'da Ensar'ın kadınları ne iyi kadınIardır. Haya etmek onIarın dinde iyi bir bilgi sahibi aImaIarını engellemedi.\" Allah en iyi bilendir. (712) \"Aişe dedi ki: Ben ona üf senden dedim.\" Bu onu ve söyIedikIerini küçük görmesi anIamındadır. Bu söz bir şeyi küçümsemek, ondan tiksinmek ve ona tepki göstermek için kullanılır. (3/224) eI-Bad dedi ki: Burada bu söz ile kastedilen tepki göstermektir. Üf'ün asıI anIamı tırnak kiridir. On ayrı söyIeyişi vardır. Tenvinsiz olarak ufi, ufe ve ufu ayrıca tenvinli oIarak söyIeyişIeri ile aItı söyIeyiş oIur. Yedincisi ife, sekizincisi uf, dokuzuncusu ufi, onuncusu da ufe'dir. BunIar meşhur olan söyleyişIer oIup, bunIarın hepsini ibnu'I-Enbari ve birçok ilim adamı zikretmiştir. Delilleri de oldukça meşhurdur. Bu husustaki açıklamaların en kısa olanları ez-Zeccac ve İbnu'l-Enbari'nin zikrettikleridir. Ebu'l-Beka da bunu kısaltarak şöyIe demiştir: Kesreli okuyan asIına göre bina etmiş, fethalı okuyan kolay söyleyişi tercih etmiş, dammeli okuyan da hemzeye tabi olarak dammeli söylemiş, tenvinli söyleyen nekreyi kastetmiş, tenvinli söylemeyen marifeliği kastetmiş, fe'yi şeddesiz okuyan kolaylık olsun diye birbirinin misli olan iki harften birisini hazfetmiş olur. Ahfeş ve İbnu'lEnbari, dokuzuncu söyleyiş olan ya'lı söyleyiş hakkında sanki o bu sözü kendisine izafe etmiş gibi söylemiş olur, demişlerdir. Allah en iyi bilendir. (713) \"Elin toprağa değsin ve harbe sana isabet etsin.\" Harbe sana isabet etsin \"ullet\" şeklinde rivayet edilmiştir. Bu da \"el-elle\" denilen harbe ona isabet etsin anlamındadır; fakat bazı imamlar bu lafzı kabul etmeyip, bunun doğru şeklinin \"elilti\" olduğunu söylemişlerdir. Ancak bu doğru olmayan bir tepkidir, aksine sahih olarak rivayet edilen lafız doğrudur ve bunun aslı \"elilet\" şeklindedir. Ancak \"iki elin\" deyip, ellafzını tesniye kullanmakla birlikte \"ellet\"i tekil kullanması iki sebepten dolayıdır: Birincisi cinsi kastetmiş olması, ikincisi iki eli olanı kastetmiş olmasıdır; yani harbe sana isabet etsin demek olur ki, bu durumda bir arada iki (bed)dua yapmış olur. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 716,
			"arabicnumber": "315.01",
			"text": "Bana Hasan b. Ali el-Hulvfmı tahdis etti. Bize Ebu Tevbe -ki o Rab!' b. Nafi\"dir- tahdis etti. Bize Muaviye -yani b. Sellam- Zeyd'den -yani kardeşinden- tahdis ettiğine göre o Ebu Sellam'ı şöyle derken dinlemiştir: Bana Ebu Esma er-Rahab!'nin tahdis ettiğine göre Resulullah (Sallallahu aleyhi ve Sellem)'in azatlısı Sevban kendisine tahdis edip dedi ki: Resulullah (Sallallahu aleyhi ve Sellem)'in yanında ayakta duruyordum. Yahudi hahamlarından bir haham gelip: Selam sana ey Muhammed, dedi. Ben onu öyle bir ittim ki, ondan dolayı neredeyse yere düşecekti. Beni neden ittin, dedi. Ben: Neden ey Allah'ın Resulü demiyorsun, dedim. Yahudi: Biz onu ancak ailesinin kendisine vermiş olduğu ismiyle çağırırız, dedi. Resulullah (Sallallahu aleyhi ve Sellem) bunun üzerine: \"Şüphesiz ailemin bana verdiği ismim Muhammed'dir\" buyurdu. Bu sefer Yahudi: Sana soru sormak için geldim, dedi. Resulullah (Sallallahu aleyhi ve Sellem): \"Eğer sana (cevabını) söyleyecek olursam sana bir faydası olur mu?\" buyurdu. Yahudi: Kulaklarımla duymuş olurum, dedi. Resulullah (Sallallahu aleyhi ve Sellem) beraberindeki bir sapa ile düşünceli bir şekilde yere bir şeyler çizdi sonra: \"Sor\" buyurdu. Yahudi: Yer başka bir yere değişeceği semaların da değişeceği günde insanlar nerede olacaktır, dedi. Resulullah (Sallallahu aleyhi ve Sellem): \"Onlar köprünün berisindeki karanlıkta olacaklar\" buyurdu. Yahudi: İnsanlar arasından (o köprüyü) ilk olarak kimler geçecek dedi. Allah Resulü: \"Muhacirlerin fakirleri\" buyurdu. Yahudi: Cennete girecekleri zaman onlara ne ikram edilecek, dedi. Allah Resulü: \"Balığın ciğerinin fazlalık kısmı\" buyurdu. Yahudi: Hemen onun arkasındaki gıdaları ne olacak, dedi. Resulullah (Sallallahu aleyhi ve Sellem): \"Cennetin kenarlarından yiyen bir öküz onlar için kesilecek\" buyurdu. Yahudi: Bunun üzerine ne içecekler, dedi. Allah Resulü: \"Orada Selsebil diye adlandırılan bir pınardan (içecekler)\" buyurdu. Yahudi: Doğru söylüyorsun, dedi şunları ekledi: Bir de sana yeryüzü halkı arasında bir nebinin yahut bir ya da iki adamdan başka hiç kimsenin bilmediği bir şey hakkında soru sormak üzere geldim, dedi. Allah Resulü: \"Sana söylersem (bunun) sana faydası olur mu\" buyurdu. Yahudi: Kulaklarımla işitmiş olurum, dedi. Sana çocuk hakkında sormaya geldim (dedi). Allah Resulü: \"Erkeğin suyu beyaz, kadının suyu sarıdır. Her ikisi bir araya gelip de erkeğin menisi, kadının menisinin üstüne çıkarsa Allah'ın izniyle erkek çocukları olur. Eğer kadının menisi erkeğin menisinin üstüne çıkarsa Allah'ın izniyle kız çocukları olur\" buyurdu. Yahudi: Andolsun doğru söyledin ve muhakkak sen bir nebisin dedi, sonra dönüp gitti. Sonra Resulullah (Sallallahu aleyhi ve Sellem): \"Bu adam bana hakkında cevap istediği bu soruları sorduğu zaman yüce Allah bana onların bilgisini bildirinceye kadar onların hiçbirisi hakkında bir bilgim yoktu\" buyurdu. Yalnız Müslim rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 717,
			"arabicnumber": "315.02",
			"text": "Bunu bana Abdullah b. Abdurrahman ed-Darimi de tahdis etti, bize Yahya b. Hassan haber verdi, bize Muaviye b. Sellam bu isnadta aynısını tahdis etti. Ancak o(nun rivayetinde Sevban): Resulullah (Sallallahu aleyhi ve Selleml'in yanında oturuyordum, dedi. Ayrıca o rivayetinde \"balığın ciğerinin fazlalığı\" derken (ziyade lafzı yerine zaide lafzını) söyledi,yine onun erkek ve kız çocuğu olur dediği halde ikisinin erkek ve kız çocuğu olur demedi. Yalnız Müslim rivayet etmiştir DAVUDOĞLU ŞERHİ AŞAĞIDA NEVEVİ ŞERHİ: Bu babta Sevban (r.a.)'ın Yahudi hahamının kıssası ile ilgili rivayet ettiği hadis yer almaktadır. Bundan önceki babta ise meninin nitelikleri açıklanmıştı. Habr (haham) kelimesi habr ve hibr olarak söylenir ve bunlar iki meşhur söyleyiştir, alim kişi demektir. \"Ebu Esma er-Rahabı\"nin adı Amr b. Mersed eş-Şam i ed-Dımeşki'dir. Ebu Süleyman b. Zeyd dedi ki: Ebu Esma er-Rahabı Dımaşk Rahabesinden idi. Burası da Dımaşk'ın kasabalarından bir kasaba olup, onunla Dımaşk arasında bir millik mesafe vardır. Ben onun bayındır bir kasaba olduğunu gördüm. Allah en iyi bilendir. \"Resuluilah (Sallallahu aleyhi ve Sellem) bir değnek ile düşünceli olarak bir şeyler çizdi.\" (3/226) Yani elindeki değnek ile yere izleri belli bazı çizgiler çizdi. Böyle bir işi düşünen bir kişi yapar. Bu da benzeri bir iş yapmanın caiz olduğuna ve bunun insanın mürüwetini ihlal etmediğine delildir. Allah en iyi bilendir. \"Köprüden berideki bir karanlık içinde\" Köprü kelimesi \"cisr\" ve \"cesr\" olarak telaffuz edilir, bunlar meşhur iki söyleyiştir. Burada köprüden kasıt da Sırattır. \"Onlara ne ikram edilecektir.\" Tuhfe, kişiye sunulan hediye özelolarak verilen ve onunla taltif olunan şeye (ikrama) denilir. İbrahim el-HalEbi dedi ki: Bu meyvenin bir yanı demektir. Allah en iyi bilendir. \"Balığın ciğerinin ziyadesi (fazla k/smı)dır.\" (Hadisteki lafzıyla) nun balık demektir, çoğulu \"nınan\" diye gelir. Diğer rivayette ise \"balığın ciğerinin zaidesi\" denilmektedir. Ziyade ve zaide aynı şeydir, bu da ciğerin kenan demek olup, onun en lezzetli ve hoş kısmıdır. \"Gıdalan\" iki şekilde rivayet edilmiştir. Birisi kesreli gayn ve zel ile diğeri ise fethalı gayn ve dal \"gada\"olarak. Kadı İyaz der ki: Bu ikinci rivayet sahih olandır, çoğunluğun rivayeti de budur. Birincisinin bir değeri yoktur. Derim ki: Ama onun açıklanabilir bir tarafı vardır. O zamanda gıdaları ne olacaktır takdirindedir. Yoksa maksat her zaman için onların gıdalarının ne olacağını sormak değildir. Allah en iyi bilendir. \"Orada selsebil diye adlandırılan bir pınardan\" buyruğu ile ilgili olarak dilbilgini ve müfessirlerden bir topluluğun dediğine göre, Selsebil pınarın adıdır. Mücahid ve başkaları ise selsebil hızlıca akmak demektir. Yumuşak ve rahat akan anlamında olduğu da söylenmiştir .. '1illah'ın izniyle erkek çocukları olur, Allah'ın izniyle kız çocukları olur\" ibarelerinde birincisinin anlamı çocuk erkek olur, ikincisinin anlamı da çocuk kız olur şeklindedir. (3/227) \"Kız çocukları olur\" anlamındaki lafız hemzesi uzatılıp, nun harfi şeddesiz olarak \"fınesa\" diye okunmakla birlikte hemzesi uzatılmadan ve nun harfi şeddeli olarak \"ennesa\" şeklinde de rivayet edilmiştir. Allah en iyi bilendir . DAVUDOĞLU AÇIKLAMA: Yahudi aliminin Resulullah (Sallallahu Aleyhi ve Sellem)'e gelmesi ya onun doğruluğunu deneyerek îman etmek için yahut sırf imtihan maksadı iledir. Zahire bakılırsa cevaplarını tastik ettiği halde iman etmeden oradan ayrılmıştır. Resulullah (Sallallahu Aleyhi ve Sellem) selam vermesi ve Hz. Sevban (R.A.) kendisini ittiği halde ona unf-u şiddetle cevap vermemesi ilminin kendisine kazandırdığı edep ve terbiyeye delalet eder: Biz onu ancak ailesinin verdiği ismiyle çağırırız» demesi de alime yakışan bir cevaptır. Halbuki Kureyş Hudeybiye musalehasmda; «Senin hakikaten Resulullah olduğunu bilsek seninle harb etmezdik» demişlerdi. Maamafih Yahudi aliminin nezaket göstermesi o anda başka bir şey elinden gelmediği için de olabilir; «Kulaklarımla dinlerim» demesi: «Senin söylediklerini dinler doğrumu dcgilmi düşünürüm» manasınadır. Yoksa bununla senin sözlerin bir kulağımdan girer bir kulağımdan çıkar manasını kastedmemiştir. Resulullah (Sallallahu Aleyhi ve Sellem)'in elindeki değnekle yeri kazması öteden beri arap büyüklerinin adeti olan,bir iştir. Onlar mühim bir mesele karşısında düşünceye daldıkları zaman böyle yaparlardı. Yahudi aliminin, ilk Suali kıyamete dair olmuştur. Gerek onun sualinden gerekse Fahr-i kainat (Sallallahu Aleyhi ve Sellem)'efendimizin verdiği cevaptan anlaşilıyorki kıyamet gününde yer yüzünün yalnız sıfatı değil bizzat kendisi değişecektir. Çünkü yeryüzünün yalnız sıfatı değişse mesela dağlar vadiler dümdüz edilmek sureti ile yeryüzü bugünkünden başka bir hal alsa yahudî alimine bunu anlamak müşkil gelmezdi. Aynı suali Resulullah (Sallallahu Aleyhi ve Sellem)'e Aişe (R.A.)'nın dahi sorduğu rivayet olunur. Resulullah (Sallallahu Aleyhi ve Sellem) in: «Onlar köprünün yanında karanlıkta olacaklardır.» buyurmasıda bu değişmenin zat itibarı ile olacağına delildir. Köprüden murad sırattır. Nitekim Âişe (R.A.)'a. verilen cevapda tasrih edilmiştir. Değişen yerin dümdüz beyaz olacağı gizlenecek hiçbir yeri bulunmayacağı Hz. Sehl (R.A.)'ın rivayet ettiği bir hadiste beyan buyurulmuştur. Bunun keyfiyetini Allah bilir. Yahudinin: «Sıratı ilk defa kimler geçecek?» sualine Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) «fakır muhacirler.» cevabını vermiştir. Bu sözün umumu fakir muhacirlerin zenginlerden efdal olmasını iktiza edersede Hz. Osman ve Abdurrahman b. Avf {R.A.) gibi zenginlerin Ebu Hureyre ve Ebu Zerr (R.A.) gibi fakirlerden efdal olduğuna icma'ı ümmet vardır. Bazan bir zat kendisine hass bir meziyetten dolayı üstünlük vasfı . ile zikrolunabilir. Bu onun mutlak surette başkalarından üstün olduğuna delalet etmez. Bu sebepledir ki böyle hadislerle fakirliğin zenginlikten daha makbul olduğuna istidlal edilemez. Ashab-ı kiramın kendi aralarında fakirlikmi daha makbul dür, Zenginlik mi? meselesini münakaşa ettikleri ve neticede zenginliği daha makbul buldukları rivayet olunur. Çünkü zenginlerin malları ile kazandıkları dereceleri fakirler kazanamaz. Fakirle zenginin ibadet ve taat hususunda müsavi olduklarını kabul edersek zengin mali ibadetleri sayesinde fakiri geçer. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) in zikrettiği fakirler kendi zamanındaki fakirlerdir. Yoksa sırattan önce geçmek için muhacirlerin aleddevam fakir kalmaları şart değildir. Yahudinin üçüncü suali cennete girerken ehl-i cennete ne gibi izzet-ü ikramda bulunulacağı meselesidir. Tuhfe: ikram için bir kimseye verilen hediyedir. Bu suale cevaben Resul-i Zîşan (Sallallahu Aleyhi ve Sellem) bir rivayette «Balık ciğerinin ziyadesi.» diğer bir rivayette «Balık ciğerinin zaidesi.» buyurmuştur. Bu iki kelime manaca birdir. Ve ciğerin kenarındaki çıkıntı demektir ki; ciğerin en güzel yeri de orasıdır. Cennete girer girmez yiyecekleri şey evvelce kendileri için tahsis edilip cennet bahçelerinde otlamakta olan öküzün eti, içecekleri de selsebil ismindeki kaynağın suyu olacaktır. Bunların hakikatlarını Allah bilir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 718,
			"arabicnumber": "316.01",
			"text": "Bize Yahya b. Yahya et-Temîmi rivayet etti. (Dediki): Bize Ebu Muaviye, Hişam b. Urveden, o da babasından, o da Âişe'den naklen rivayet etti. Aişe şöyle demiş: Resulullah (Sallallahu aleyhi ve Sellem) cünüplükten dolayı guslettiği zaman ilk olarak ellerini yıkamakla başlar sonra sağ eliyle soluna su döker, fercini yıkar sonra namaz abdesti gibi abdest alır sonra suyu alıp parmaklarını saçının diplerine sokardı. Artık saçının tamamını ıslattığı kanaatine varırsa üç avuç su alıp başına döker, sonra, vücudunun diğer kısımlarına su döker, sonra da ayaklarını yıkardı. Yalnız Müslim rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 719,
			"arabicnumber": "316.02",
			"text": "Bize Kuteybe b. Said ve Zuheyr b. Harb da tahdis edip dediler ki: Bize Cerir tahdis etti (H). Bize Ali b. Hucr de tahdis etti. Bize Ali b. Mushir tahdis etti (H). Bize Ebu Kureyb de tahdis etti. Bize İbn Numeyr tahdis etti. Hepsi Hişam'dan bu isnadta (hadisi rivayet ettiler) (4/17a) ama onların hadisi rivayetlerinde ayakların yıkanması sözkonusu edilmemiştir. Yalnız Müslim rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 720,
			"arabicnumber": "316.03",
			"text": "Bize Ebu Bekr b. Ebi Şeybe de rivayet etti. (Dediki): Bize Veki' rivayet ettit (Dediki): Bize Hişam, babasından, o da Âişe'den naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) «cünüblükten yıkanmış ve evvela üç defa ellerini yıkamış...» Bundan sonra ravi hadîsi Ebu Muaviyeninki gibi rivayet etmiş. Fakat (o da) ayakların yıkanacağını zikretmemiştir. Yalnız Müslim rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 721,
			"arabicnumber": "316.04",
			"text": "Bize bu hadisi Amru'n-Nakid dahî rivayet etti. (Dediki): Bize Muaviyetü'bnü Amr rivayet etti. (Dediki): Bize Zaide Hişam'dan rivayet etti. Demişki: Bana Urve, Âişe'den naklen rivayet ettiki: Resulullah (Sallallahu aleyhi ve Sellem) cünüplükten yıkandığı zaman, işe elini kaba daldırmadan önce ellerini yıkamakla başlardı, sonra da namaz için abdest aldığı gibi, abdest alırdı. Yalnız Müs\\im rivayet etmiştir NEVEVİ ŞERHİ AŞAĞIDA DAVUDOĞLU AÇIKLAMA: Resulullah (Sallallahu Aleyhi ve Sellem) in evvela ellerini yıkaması ya temizlik; yahut uykudan uyandıktan sonra elleri yıkamanın meşru olduğunu göstermek içindir. «Namaz abdesti gibi abdest alırdı» cümlesiyle lugaten abdest denilebilen el yıkamadan ihtiraz olunmuştur. Bu babta Nevevî şunları söylemiştir: «Ulemamız diyor ki cünüblükten temizlenmenin kemali şöyle olur. Yıkanan kimse ellerini kaba daldırmazdan önce onları üç defa yıkayarak taharet mahallerini ve bedeninin sair yerlerini pislikten temizledikten sonra tamamiyle namaz abdesti gibi abdest alır. Sonra parmaklarının hepsini suya daldırarak bir avuç su alır. Onunla başının ve sakalının saçlarını hilallar ve başına üç avuç su atar. Bedeninin koltuk altı, kulak ve göbek gibi çukur yerlerine, ayak parmaklarına dikkat eder. Bunların her yerine suyu ulaştırır. Sonra başına üç avuç su döker sonra da vücudunun sair yerlerine üçer defa su dökünür; ve her defasında elinin erebildiği yerleri ovalar. Eğer nehirde veya gölde yıkanıyorsa üç defa suya dalar ve suyu vücudunun her yerine, sık veya seyrek bütün saçlarının dışına ve içine ta saç bittiği yerlere kadar ulaştırır. Müstehab olan sağ taraflardan ve bedeninin üst kısımlarından başlamaktır. Kıbleye karşı durmalı ve gusul sona erdikten sonra şehadet getirmelidir. Gusle başlarken niyet etmeli ve niyet gusul bitinceye kadar devam etmelidir. İşte guslün kemali budur: Bütün bu vazifelerin içinde farz olanı suyun ilk cüz'ü vücuda temas ettiği anda niyet etmek ve suyu bütün bedenine, saçlarına ta'mim etmektir. Bedenin necasetten temiz olması guslün şartıdır. Bundan geriye kalanlar sünnettir. İbrik gibi bir kabla yıkanan kimsenin şu inceliğe dikkati gerekir. İstinca edecek istinca yerini su ile temizledkten sonra o yeri birde cünüblükten temizlemek niyetiyle yıkamalıdır. Çünkü onu o anda yıkamazsa sonra unutabilir. Ve yeri yıkamadığından dolayı da guslü sahih olmaz...» Nevevî şafiîlere göre bu izahatı verdikten sonra: «Bizim mezhebimiz ve bir çok imamların mezhebi budur. Yıkanırken veya abdest alırken ovunmanın farz olduğuna İmam Malik ile Müzenî'den başka kail olan yoktur. Diğer ulemaya göre ovunmak sünnettir; onu terkedenin abdesti de, guslü de sahihtir. Cünüblükten yıkanılacağı zaman abdest almak yalnız Davud-u Zahirîye göre farzdır. Sair ulema onun sünnet oldugunu söylemişler. Bir kimse abdest almadan bütün vücuduna su dökünse guslü sahihtir; onunla namaz kılması ve diğer ibadetleri yapması caiz olur. Lakin efdal olan yukarıda zikrettiğimiz gibi guslün ya başında ya sonunda abdest alarak onun faziletini kazanmaktır. Guslün başında abdest alan sonunda almaz. Bir gusülde iki defa abdest almanın müstahab olmadığında bütün ulema müttefiktir.\" diyor. Hanefîlere göre gerek abdest de gerekse gusül de niyet farz değil sünnettir. NEVEVİ ŞERHİ (716-719): Aişe (r.anha)'nın Buhari ve Müslim'in sahihlerinde yer alan rivayetlerinde geçen \"Resulul\\ah (Sallallahu aleyhi ve Sellem) üzerine su dökmeden önce namaz abdesti gibi abdest aldı\" hadisinin zahirinden anlaşıldığına göre Allah Resulü (Sallallahu aleyhi ve Sellem) ayakları da yıkayarak abdesti tamamlıyordu. Meymune (r.anha)' nın naklettiği rivayetlerin birçoğunda ise \"abdest aldı sonra üzerine su döktÜ sonra bir kenara çekilerek e..yaklarını yıkadı\" denilmektedir. (Bk. 720 numaralı hadis) Onun rivayet ettiği hadisin Buhari tarafından nakledilen rivayetinde: \"Ayakları(nı yıkama)nın dışında namaz abdesti gibi abdest aldı sonra üzerine su döktü sonra bir başka tarafa çekilip ayaklarını yıkadı\" denilmektedir. Bu da ayakların sonradan yıkandığını açıkça ifade eder. Şafii (r.a.)'ın iki görüşü vardır. Bunların daha sahih, daha meşhur ve tercih edilenlerine göre abdestini ayaklarını yıkayarak tamamlar. İkincisine göre ise ayakları yıkamayı sonraya bırakır. Zayıf görüşe göre Aişe (radıyallShu anha)'nın naklettiği rivayetler tevil edilir. Meymune' den gelen rivayetlerin çoğunluğu da namaz abdestinden kastın da onun çoğunluğu olduğu şeklinde yorumlanır. Bu da Meymune'nin, Buhari' deki rivayette açıkladığı gibi ayakları yıkamanın dışında kalan abdesttir. Bu rivayet sarihtir, öbür rivayet ise tevil ihtimali bulunan bir rivayettir. Böylelikle belirttiğimiz şekilde iki rivayet bir arada tevil edilir. (İmam Şafil'nin) meşhur ve sahih olan görüşüne göre ise hem Aişe' den, hem Meymune' den gelen ve namaz abdestinin önce alındığını belirten meşhur ve niüstefız (yaygın) rivayetlerin zahirı ile amel olunur. (3/229) Çünkü bunların zahirinden anlaşılan abdestin kemalidir. Çoğunlukla görülen ve onun (Sallallahu aleyhi ve Sellem) bilinen adeti bu idi, fakat cünüplük için değil de, çamuru gidermek maksadıyla guslü bitirdikten sonra bir daha ayaklarını yıkardı. Bu durumda ayakları iki defa yıkanmış olurdu. Daha mükemmel ve daha faziletli olan budur ve Nebi (Sallallahu aleyhi ve Sellem) bunu devam etlirirdi. Buhari'nin Meymune'den naklettiği rivayete gelince, bu caiz oluşu açıklamak için bir ya da birkaç kere olmuş bir iştir. Bu da onun abdest azalarını üçer defa ve birer defa yıkadığının sabit oluşuna benzer. Üçer defa yıkaması -daha faziletli olduğundan ötürü- çoğunlukla yaptığı bir işti. Birer defa yıkaması ise caizliği açıklamak üzere bazı zamanlarda nadiren yaptığı bir işti. Bunun benzerleri de pek çoktur. Allah en iyi bilendir. Bu şekilde alınan abdestin niyetine gelince, bununla küçük hadesi kaldırmayı niyet eder. Ancak abdestli ve cünüp olması hali müstesnadır. O takdirde bu abdesti alırken guslün sünneti olarak niyet eder. Allah en iyi bilendir. \"Parmaklarını saçlarının dibine sokardı.\" Bunu yapmasının sebebi saçlarını yumuşatmak, ıslatmak ve böylelikle üzerinden suyun geçmesini kolaylaştırmak idi. \"Saçını tamamen ıslatlığını görünce ... \" İstebrae: Tamamen ıslattı, saçının her tarafını ıslattı, demektir. Hafene: Avuçladı, iki eliyle birlikte suyu aldı, demektir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 722,
			"arabicnumber": "317.01",
			"text": "Bana Ali b. Hucr es-Sa'dî rivayet etti. (Dediki): Bana İsa b. Yunus rivayet etti. (Dediki): O Bize A'meş Salim bin Ebi'l- Ca'd'dan o da Kureyb'den, o da İbni Abbas'tan naklen rivayet etti. Demiş ki: Bana teyzem Meymune rivayet etti. Dedikİ: Resulullah (Sallallahu aleyhi ve Sellem)'e cünüplükten dolayı gusletmesi için suyunu getirdim. Ellerini iki ya da üç defa yıkadıktan sonra elini kab'a soktu sonra onunla fercine su döküp sol eliyle de onu yıkadı. Sonra sol elini yere vurdu onu iyice ovaladı sonra namaz abdesti gibi abdest aldı, sonra avuçlarını doldurarak başına üç avuç su boşalttı sonra vücudunun geri kalan kısmını yıkadı sonra o durduğu yerden çekilerek ayaklarını yıkadı sonra ona (kurulanması için) mendil (havlu) getirdim, ama onu istemedi. Diğer tahric: Buhari, 260, 249, 257 -buna yakın muhtasar olarak-, 259 -buna yakın-, 265 -buna yakın muhtasar olarak-, 266 -buna yakın-, 274 -buna yakın-, 276, 281 -muhtasar olarak buna yakın-; Müs!im, 765 -muhtasar olarak-; Ebu Davud, 245 -uzunca-; Tırmizi, 103 -buna yakın muhtasar olarak-; Nesai, 253, 416 -buna yakın muhtasar olarak-, 417, 406 -muhtasar olarak-; İbn Mace, 467 -muhtasar olarak",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 723,
			"arabicnumber": "317.02",
			"text": "Bize Muhammed b. es-Sabbah, Ebu Bekr b. Ebli Şeybe, Ebu Kureyb, el-Eşe c ve İshak hepsi Vekl\"den tahdis etti (H). Bunu bize Yahya b. Yahya ve Ebu Kureyb de tahdis edip dediler ki: Bize Ebu Muaviye ve Vekl' tahdis etti, her ikisi A'meş'ten bu isnad ile hadisi rivayet etti ama bu ikisinin hadisi rivayetlerinde başa üç avuç su dökmek sözkonusu edilmemektedir. Vekl\"in hadisi rivayetinde ise abdestin tamamı anlablmakta ve bu abdest alışta mazmaza ve istinşakı da zikretmiş bulunmaktadır. Hadisin Ebu Muaviye rivayetinde ise mendilden (havludan) söz edilmemektedir. DAVUDOĞLU AÇIKLAMA: Bu hadisi Buharî gusl bahsinin «Mazmaza ve istinşak» babında tahriç etmiştir. Bazıları «Buhari'nin onu burada Gusl bahsinde zikretmekten muradı Mazmaza ile İstinşakın Gusulde farz olmadığına işaret içindir. Gusül için abdest almak bilicma' farz değildir. Mazmaza ile istinşak ise abdest de tabî olan şeylerdir. Asıl olan abdest farz olmayınca onun tabileri bulunan mazmaza ile istinşak ta farz değildir.» demişlerdir. Fakat bu istidlal doğru değildir. Zira hadîsin bir rivayetinde mazmaza ile istinşak tasrih edilmişlerdir. Resulullah (Sallallahu Aleyhi ve Selleın) in onlara devam üzere yaptığı şüphesizdir. Bu ise vücub ifade eder. Hadîsin buradaki rivayetinde Resullullah (Sallallahu Aleyhi ve Sellem)'in kurulanmak için getirilen havluyu kabul etmediği; Buharî'nin rivayetinde ise onunla kurulanmadığı bildiriliyor ki mana itibariyle ikiside birdir. Hz. Âişe (R.A.) dan rivayet olunan bir hadîste Resulullah (Sallallahu Aleyhi ve Sellem) in yıkandıktan sonra kurulanmak için bir bezi bulunduğu bildirilmektedir, NEVEVİ ŞERHİ (720-721): \"Resulullah (Sallallahu aleyhi ve Sellem)' e cünüplükten yıkanması için suyunu yaklaşbrdım.\" Buradaki gusl kelimesinden kasıt kendisiyle yıkanılacak, gusledilecek sudur. \"Sonra elini yere vurdu ve onu iyice ovaladı.\" Bundan su ile istinca yapan kimsenin işini bitirdikten sonra elini toprak ya da çöven ile yıkamasının yahut onu üzerindeki pisliklerin gitmesi için toprak veya duvara ovalamasının müstehap olduğu hükmü anlaşılmaktadır. \"Sonra avucunu doldurarak başına üç avuç su döktü.\" Bizim ülkemizdeki asıl nüshalarında bu şekilde \"avuç\" anlamındaki lafız tekil olarak zikredilmiştir. Kadı İyaz da bunu bu şekilde çoğunluğun rivayeti olarak nakletmiş bulunmaktadır. Taberi'nin rivayetinde ise tesniye olarak iki eli (avucu) şeklindedir ki, bu da çoğunluğun rivayetini tefsir eder. Avuç ise bir arada iki elin dolu halini ifade eder. \"Sonra ona (kurulanması için) mendil getirdim ama onu istemedi.\" Bundan organları kurutmamanın müstehap olduğu anlaşılmaktadır. Ama abdest ve gusül aldıktan sonra azalan kurutmak hususunda mezhep alimlerimizin farklı beş görüşü bulunmaktadır. 1- En meşhur görüşe göre müstehap olan, kurulanm,'!ı terk etmektir fakat kurulanmak da mekruhtur denilemez. 2- Kurulanmak mekruhtur. 3- Yapılması da, terk edilmesi de eşit mübah bir iştir. Bizim tercih ettiğimiz de budur. Çünkü bunu yasaklamak veya müstehap olduğunu söylemek için açık bir delile gerek vardır. 4- Kirlerden sakınma özelliği dolayısıyla müstehaptır. 5- Kışın değil de yazın kurulanmak mekruhtur. Bunlar bizim mezhep alimlerimizin sözünü ettiği hükümlerdir. Ashab da, başkaları da kurulanmak hususunda üç farklı görüş ortaya atmışlardır: 1 - Abdest aldıktan sonra da, guslettikten sonra da kurulanmakta bir beis yoktur. Bu Enes b. Malik ve es-Sevri'nin görüşüdür. 2- Her ikisi için de mekruhtur. Bu da İbn Ömer ve İbn Ebi Leyla'nın görüşüdür. 3- Abdest aldıktan sonra mekruhtur, gusülden sonra değildir. Bu da İbn Abbas (radıyallShu anh)'ın görüşüdür. (3/231) Kurulanılmayacağı ile ilgili bu hadis ile sahihteki: \"Nebi (Sallallahu aleyhi ve Sellem) gusletti ve başından su damladığı halde dışarı çıktı.\" Şeklindeki diğer bir hadis daha rivayet edilmiş bulunmaktadır. Kurulanmanın fiilen yapıldığı ile ilgili hadisi ise ashab (r.a.)'dan bir topluluk değişik yollardan rivayet etmiş olmakla birlikte, bu rivayetlerin senetleri zayıftır. Tirmizi dedi ki: Bu babta Nebi (Sallallahu aleyhi ve Sellem)'den sahih bir şey yoktur. Bazı ilim adamları kurulanmanın mübahlığına Meymune (r.anha)'nın bu hadiste (722) \"suyu şöyle şöyle yapmaya başladı\" yani onu üzerinden silkti demesidir. Suyun silkelenmesi mübah olduğuna göre onu kurulamak da onun gibi ya da ondan daha evla olmalıdır; çünkü her ikisi de suyu izale etmek gibi ortak bir özelliğe sahiptir. Allah en iyi bilendir. \"Mendil (mindil)\"in ne demek olduğu bilinmektedir. İbn Faris dedi ki: Bu kelime nakletmek demek olan \"en-nedl\"den alınmış olabilir. Başkası ise bu kelime kir demek olan \"en-nedl\"den alınmıştır; çünkü mendil ile kirler nedl edilir (giderilir). Nitekim \"teneddeltu fi'l-mindil: mendil ile temizlendim\" denilir. Cevherı dedi ki: Temendeltu bi'l-mindil: mendil ile temizlendim de denilir. Ancak Kisaı bu kullanımı kabul etmemiştir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 724,
			"arabicnumber": "317.03",
			"text": "Bize Ebu Bekr b. Ehî Şcybe de rivayet etti. (Dediki): Bize Abdullah b. İdıis, A'meş'den, o da Salim'den o da Kureyb'den, o da İbni Abbas'dan, o da Meymune'den naklen rivayet ettiki Nebi (Sallallahu aleyhi ve Sellemı'e mendil getirildi, ona hiç dokunmadı ve suyu şöyle yaptı, yani onu silkti. Diğer tahric: Buhari, 260, 249, 257 -buna yakın muhtasar olarak-, 259 -buna yakın-, 265 -buna yakın muhtasar olarak-, 266 -buna yakın-, 274 -buna yakın-, 276, 281 -muhtasar olarak buna yakın-; Müs!im, 765 -muhtasar olarak-; Ebu Davud, 245 -uzunca-; Tırmizi, 103 -buna yakın muhtasar olarak-; Nesai, 253, 416 -buna yakın muhtasar olarak-, 417, 406 -muhtasar olarak-; İbn Mace, 467 -muhtasar olarak- NEVEVİ ŞERHİ: \"Suyu böyle yapmaya yani onu silkmeye başlad!.\" Bu da abdest ve gusülden sonra el ile silkmenin sakıncasız olduğuna delildir. Bu hususta mezhep alimlerimizin farklı görüşleri vardır. 1- Bunların en meşhuruna göre müstehap olan onu terk etmektir. Fakat mekruh olduğu da söylenmez. 2- Mekruhtur. 3- Yapılması da, terk edilmesi de eşit olmak üzere mübahtır. Daha güçlü ve tercih edilen görüş de budur. Çünkü bu sahih hadis mübahlığı ifade etmekle birlikte, bunu yasaklamak ile ilgili kesinlikle hiçbir şey sabit olmamıştır. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Bu rivayet Abdest ve Gusülden sonra elleri silkmekte bir beis olmadığına delildir. Nevevî'nin beyanına göre Şafiîyye uleması bu hususta ihtilaf etmişlerdir. Meşhur kavle göre elleri silkmemek müstehabdır. Fakat mekruh değildir. İkinci kavle göre elleri silkmek mekruhtur. Üçüncü kavle göre mubahtır. Bizzat Nevevî'de bunu ihtiyar etmekte; el silkmenin mekruh olduğunu bildiren hiç bir hadis sabit olmadığını söylemektedir)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 725,
			"arabicnumber": "318",
			"text": "Bize Muhammed ibnü'l-Müsenna el-Anezî rivayet etti. (Dediki): Bana Ebu Âsim Hanzaletü'bnü Ebî Süfyan'dan o da Kaasım'dan, o da Âişe'den naklen rivayet etti. Âişe şöyle demiş: Rasınullah (Sallallahu aleyhi ve Sellem) cünüplükten yıkandığı zaman hilab {denilen süt kabı)e yakın bir şey (kap) getirilmesini isterdi. Avucuna su alıp, başının sağ tarafını sonra sol tarafını yıkardı sonra elleriyle su alır ve onu başına dökerdi. Diğer tahric: Buhari, 258; Ebu Davud, 240; Nesai, 422 NEVEVİ ŞERHİ: \"Hilabe yakın bir şey (kap) getirilmesini isterdi.\" Hilab içine süt sağılan kaba denilir. Ona mihlab de denilir. Hattabi dedi ki: Bir dişi deveden sağılan sütü alacak genişlikteki kaba denilir. Rivayette meşhur, sahih ve bilinen budur. Herevi ise el-Ezheri' den naklen onun cullab denilen kab olduğunu zikretmektedir. el-Ezheri der ki: Bununla gülsuyunu kastetmektedir ki, bu Farsçadan Arapçalaştırılmış bir kelimedir. Ancak Herevi bunu kabul etmeyerek benim görüşüme göre bu el-Hilab'br deyip, bizim az önce söylediklerimize yakın açıklamalar zikretmektedir. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Bu hadîsi Buharî «Kitabü'I Gusl» de tahrîc etmişdir. Buharî onun için bir bab tahsis ederek: «Yıkanmaya hilab veya koku sürünme ile başlayanın babı» demişsede bu hususta kendisine üç fırka tarafı îtîraz edilmiştir. Birinci fırka: Bu hususta Buharî'nin vehm ve hataya düştüğünü İddia ederler. Hatta İsmaîlî «Müstahrec» inde şöyle der: «Allah Ebu Abdillah Buharî'ye rahmet eylesin. Hatadan kim salim olabilir ki? Hazret, hilabı koku sanmış. Gusülden önce kokulanmanın ne manası olabilir? Hilab ancak içine süt sağılan kab demektir. Buna Mihleb de derler...» İkinci Fırka : Hadis'te tashif yapıldığını iddia ederler. Onlara göre kelimenin aslı hilab değil cüllab yani gülsuyu demektir. Kelimenin aslı Farisîdir. Ezherî'de bu fırkadandır. Üçüncü fırka : Buharî'nin sözünü te'vil ederek: Kokudan, örfî manasını kasdetmediğini bu sözle bedeni temizleyerek, kiri pası ve necaseti gidermeyi, hilab kelimesiyle de su kabını muiad ettiğini söylerler. Taberî'de bunlardandır. Aynî bu üç fırkanın kavillerini sıraladıktan sonra her birine ayrı ayrı cevap vermiştir. Şöyleki: 1- Buharî hilab kelimesiyle koku sürünmeyi kasdetmemiştir. Çünkü koku sürünmeyi hilabm üzerine atfetmiştir. Matufla, matufun aleyhin hükümleri ise başka başka şeylerdir. Onun hilab'dan maksadı su kabıdır. Hattabî'nin beyanına göre hilab bir devenin sütünü alacak kadar kabtır. 2- Ezherî'nin de dahil olduğu ikinci fırkanın tashif iddiası doğru değildir. Kelime hilab şeklinde rivayet olunmuştur. Hatta Kurtubî: Bu kelime ancak ha'nın kesri ile hilab okunur. Başka türlü okumak doğru değildir. Onu koku zanneden vehmetmiştir. Farisî'de gülsuyuna cüllab değil, Cülab derler. Aslı gülabdır. Bu da maruf çiçeğin adı olan gül ile su manasına gelen «ab» kelimelerinden mürekkebdir. Onlarda kaide muzafun ileyhin muzaftan önce gelmesidir. Keza sıfat da mevsufundan önce gelir. Cüllab içilen meşrubatın ismidir.» demektedir. 3- Buharî biri kab diğeri koku olmak üzere iki şey zikretmiş; bunları biri biri üzerine atfeylemiştir. Fakat maksadı onlardan birini anlatmaktır. Onu adeti, ekseriya babın evvelinde bir şey zikretmek, sonra bir sebebten dolayı o şeye dair hadis rivayet etmemektir. Burada da Öyle yapmıştır. Hasılı hilabdan murad koku sürünmek değil su kabıdır. Kabı zikretmekle gusl için ne kadar su harcanacağı beyan edilmek istenilmiştir. Hadisin buradaki rivayetinde: «Eliyle aldı» denilerek, el müfred olarak zikredilmişse de diğer rivayetlerde «elleriyle» denildiğine göre buradaki elden murad iki elidir. Resulullah (Sallallahu Aleyhi ve Sellem) in elleriyle suyu alarak başına dökmesi «kaale» kelimesiyle ifade edilmiştir. Bu kelimenin asıl manası söylemekse de, arablar onu yapmak manasında bütün işlerde kullanırlar. Mesela: «Kaale bi yedihî keza» derler ve «eliyle şöyle yaptı» manasını kasdederler. Burada da öyledir. Hadis-i Şerif yıkanan kimseye su hazırlamanın ve yıkanırken evvela başın sağ tarafına; sonra sol tarafına; sonra da ortasından dökerek yıkamanın müstehab olduğuna delildir. Hz. Âişe'nin: «Resulullah (Sallallahu Aleyhi ve Sellem) yıkanmak istediği vakit şunu isterdi» demesi, adetinin devam üzere bu olduğunu gösterir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 726,
			"arabicnumber": "319.01",
			"text": "Bize Yahya b. Yahya da tahdis edip dedi ki: Malik'e, İbn Şihab'dan naklen okudum. O Urve b. ez-Zubeyr'den, o Aişe'den rivayet ettiğine göre Resulullah (Sallallahu aleyhi ve Sellem) cünüplükten dolayı ferak denilen bir kaptan guslederdi. Diğer tahric: Ebu Davud, 238ı.»",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 727,
			"arabicnumber": "319.02",
			"text": "Bize Kuteybe b. Said tahdis etti, bize Leys tahdis etti (H). Bize İbn Rumh da tahdis etti, bize Leys haber verdi (H). Bize Kuteybe b. Said, Ebu Bekr b. EbuŞeybe, Amr en-Nakid ve Zuheyr b. Harb tahdis edip dediler ki: Bize Süfyan tahdis etti. İkisi (Leys ile Süfyan) ez-Zührı'den, o Urve'den, o Aişe'den şöyle dediğini nakletti: Resulullah (Sallallahu aleyhi ve Sellem) ferak ile aynı şeyolan kadeh denilen kapta guslederdi. Ben ve o aynı kapta (kaptan su alarak) guslederdik. Süfyan'ın hadisi rivayetinde \"aynı kaptan\" şeklindedir. Kuteybe dedi ki: Süfyan, ferak üç sa' dır, dedi. Diğer tahric: İbn Mace, 376 DAVUDOĞLU AÇIKLAMA: Ferak: On altı rıtl su alan kabtır. Hadis uleması bu kelimeyi «fark» şeklinde okurlar. İbni Esîr'in beyanına göre ferak on-altı, fark ise yüz yirmi rıtl su alan kablardır. Müslim'in buradaki rivayetine göre Süfyan b. Uyeyne ferakı üç sa' alan kaptır, diye ta'rif etmiştir. Nevevî cumhur-u ulemanın bu kavli tercih ettiğini söyler. Bazıları: «Farak: İki sa' alan kaptır» demişlerdir. Üç sa'takriben dokuz litre eder. Rıtl: Takriben dört yüz altmış gramlık bir ölçüdür. Müdd: İki rıtl alan ölçüdür. Hadîsin bir rivayetinde «Kabdan», diğer rivayetinde «Kabda» yıkanıyordu, denilmişsede ikisindende maksat bir kaptan yıkanmasıdır. Zaten «Kabdan» manasını ifade eder «min» edatı burada cinsi beyan eder. Yani o kabdaki sudan yıkanıyordu, demektir. Kabdaki suyun hepsini sarfediyordu manasına değildir. NEVEVİ ŞERHİ (724-725): Müslümanlar, abdest ve gusülde yeterli olan su miktarının tespit edilmemiş olduğu üzerinde icma etmişlerdir. Aksine bunun için azı da, çoğu da -yıkama şartı gerçekleştiği takdirde- yeterlidir. Bu şart ise suyun yıkanması gereken organlar üzerinden akmasından ibarettir. Şafii -yüce Allah'ın rahmeti ona- bazen az miktardaki su iktisatIı kullanılarak yetebilir, çok miktardaki su da israf edilerek yeterli gelmeyebilir, demiştir. İlim adamları der ki: Müstehab olan gusülde kullanılacak suyun bir sa'dan,5Iz abdest için kullanılacak suyun da bir mud'den az olmamasıdır. Bir sa', beş tam, bir bölü üç Bağdadi rıt1dır. Bir mud ise, bir tam bir bölü üç rıtldır. Bu da tam bir miktar değil, takribi olarak böyle itibar edilmiştir. Doğru ve meşhur olan budur. Mezhep alimlerimizden bir topluluk bazı alimlerimizin bir başka görüşünü zikretmektedir ki, bu görüşe göre burada sözü geçen sa' sekiz rıtl, mud ise iki rıtldır. İlim adamları suyun is raf ile kullanılmasının yasaklığını icma ile kabul etmişlerdir, isterse deniz kenarında bulunsun. Daha güçlü olan görüş ise bunun tenzihen mekruh olduğudur. Kimi mezhep alimimiz is raf haramdır, demiştir. Allah en iyi bilendir. Erkek ve kadının aynı kaptan temizlenmelerine (abdest ve gusül almalarına) gelince, bu da bu başlıktaki bu hadisler dolayısıyla Müslümanların icmaı ile caizdir. Erkeğin arttırdığı su ile kadının temizlenmesi de aynı şekilde icma ile caizdir. Kadının arttırdığı sudan erkeğin temizlenmesi ise mezhebimizde Malik, Ebu Hanife ve ilim adamlarının büyük çoğunluğuna göre caizdir. Kadının yalnız başına kalarak o suyu kullanması ile, yalnız başına kalmaksızın kullanması arasında bir fark yoktur. Bazı ilim adamlarımız bu hususta gelmiş sahih hadisler dolayısıyla bunda mekruhluk yoktur derken, Ahmed b. Hanbel ve Davud ez-Zahiri' nin kanaatine göre eğer kadın yalnız başına kalıp suyu kullanacak olursa, arttırdığı suyu erkeğin kullanması caiz değildir. Bu görüş Abdullah b. Sereis ve Hasan-ı Basri'den de rivayet edilmiştir. Bununla birlikte Ahmed b. Hanbel'den -yüce Allah'ın rahmeti ona- bizim mezhebimiz gibi bir görüş de rivayet edilmiştir. Hasan ve Said b. el-Müseyyeb' den kadının arttırdığı suyu kullanmanın kayıtsız ve şartsız mekruh olduğu görüşü de rivayet edilmiştir ama tereih edilen büyük çoğunluğun söyledikleridir. Buna delil ise Resulullah (Sallallahu aleyhi ve Sellem)'in zevceleri ile birlikte gusletmesine ve onların her birinin diğerinin arttırdığını kullanmasına dair varid olmuş bu sahih hadislerdir. Bu hadislere göre onların her biri diğerinin arttırdığını kullanıyordu. Kadının yalnız başına su ile kalmasının da bir tesiri yoktur. Çünkü diğer hadiste Nebi (Sallallahu aleyhi ve Sellem)'in zevcelerinden birisinin arttırdığı su ile guslettiği sabittir. Bu hadisi Ebu Davud, Tirmizi, Nesai ve Sünen sahipleri rivayet etmiş olup, Tirmizi: Bu hasen, sahih bir hadistir demiştir. Yasağın sözkonusu edildiği hadise gelince, bu Hakem b. Amr'ın rivayet ettiği bir hadis olup, ilim adamları buna dair çeşitli cevaplar vermişlerdir. Bu cevaplardan birisine göre bu hadis zayıftır. Aralarında Buhari ve başkalarının bulunduğu hadis imamları zayıf olduğunu söylemişlerdir, ikinci cevaba göre ise burada maksat onun organlarından artan (müsta'mel) sudur. Üçüncü cevap ise burada yasak müstehaplık ve daha faziletli olanı ifade eder. Allah en iyi bilendir. Süfyan dedi ki: \"Ferak üç sa'dır.\" Ferak'ın üç sa' olduğunu büyük çoğunluk söylemiştir. Ferak, fark olarak da söylenir. Bu iki söyleyişi İbn Bureyd ve ondan başka bir topluluk nakletmiş olmakla birlikte, ferak söyleyişi daha fasih ve daha meşhurdur. el-Bad doğrusunun bu olduğunu iddia etmiş olmakla birlikte durum dediği gibi değildir, aksine bunlar iki ayrı söyleyiştir. Üç sa'dır ifadesi de doğrudur ve fasihtir. \"Sa\"'ın çoğulunun (Süfyan'ın söylediği gibi) \"asu'\" olarak kullanılmasını kabul etmeyip, ancak \"esvu\" şeklinin caiz olduğunu iddia eden kişi ise, bilgisizliğini ortaya koymuştur. Böyle diyen bir kişi ya apaçık bir gaflet içindedir yahut apaçık bir bilgisizlik çünkü sa' ın çoğulu asvu' da gelir, asu' da gelir. Birincisi asıl şekildir, ikincisi ise kalb iledir. Vav, sad'a öncelenerek elif'e kalb edilir (çevrilir). Aişe (r.anha)'nın söylediği: \"Feraktan yıkanırdı\" ibaresindeki \"min (dan)\" lafzından burada kasıt cinsin beyanı ve suyun kendisinden alınıp, kullanıldığı kabı beyan etmektir. Yoksa maksat fe rak denilen kabın suyu ile yıkanıyordu demek değildir. Buna delil de diğer hadisteki: \"Ben ve Resulullah (Sallallahu aleyhi ve Sellem) kendisine ferak denilen bir kaptan yıkanırdık\" rivayeti ile diğer hadisteki: \"Bir sa' su ile yıkanırdık\" hadisi buna delildir. \"Resuluilah (Sallallahu aleyhi ve Sellem) bir kapta yıkanırdı\" ifadesi bu şekilde asıl nüshalarda \"bir kapta\" şeklindedir, bu da doğru olup, kaptan (o kaptaki sudan) yıkanırdı, demektir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 728,
			"arabicnumber": "320",
			"text": "Bana Ubeydııllah b. Muaz el-Anberî rivayet etti. Dedi ki Bize babam rivayet etti. Dedi ki: Bize Şu'be Ebu Bekr b. Hafs'dan, o da Ebu Seleme bin Abdirrahman'dan naklen rivayet etti. Şöyle demiş: Ben ve Aişe (r.anha)'nın sütkardeşi onun huzuruna girdik. Sütkardeşi kendisine Nebi (Sallallahu aleyhi ve Sellem)'den cünüplükten dolayı nasıl guslettiğini sordu. O da bir sa' kadar bir kabın getirilmesini istedi, bizimle onun arasında bir perde bulunduğu halde yıkandı. Başına üç defa su döktü. (Ebu Seleme) dedi ki: Nebi (Sallallahu aleyhi ve Sellem)'in zevceleri saçlarını perçem gibi oluncaya kadar (4/19b) kısaltırlardı. Diğer tahric: Buhari, 251; Nesai, 227 -muhtasar olarak buna yakın- DAVUDOĞLU AÇIKLAMA: Bazıları Hz. Âişe’nin yanına giren zatın kardeşi Abdurrahman, diğer bazıları anne bir kardeşi Tufeyl olduğunu söylemişlersede doğru değildir. Buradaki rivayet o iddiaların fasid olduğunu gösteriyor. Hakikatta onun yanına giren zat süt kardeşidir. Bazıları onun Abdullah b. Yezîd olduğunu söylerler ve bu hususta Müslim'in Cenaze bahsinde rivayet ettiği bir hadisle istidlal ederlersede bu da doğru değildir. Çünkü o hadîs bu hadiseye ait değildir. Gerçi onda süt kardeşi Abdullah b. Yezid zikredilmiştir. Fakat orada zikredildi diye buradakinin de aynı zat olması icab etmez. Çünkü; Âişe (R.A.)'nın Kesir isminde bir süt kardeşi daha vardır. Bu sebeple buradakinin hangisi olduğunu ta'yine imkan yoktur. Âişe (R.A.)'nın süt kardeşi ile birlikte yanına gelen Ebu Seleme onun kız kardeşi Ümmü Külsüm'ün süt oğludur. Yani Âişe (R.A.) onun teyzesidir. Kaadi Iyaz diyor ki: «Anlaşılan bu iki zat Hz. Âişe'nin başını ve vücudunun mahrem zevata haram olmayan üst kısmını yıkarken görmüşlerdir. Çünkü görmeyecek olsalar su istiyerek onların huzurunda temizlik yapmasının manası kalmazdı. Onların görmiyeceği bir yerde olsa bu sefer de: «Bize şöyle anlattı» diye hikaye ederlerdi. Demekki mahrem zevatın görmesi helal olmayan yerlerini örtmek için araya bir perde koymuştur. Vefre: Kulakları geçmeyen salınmış saç demektir. Bazıları vefre limme'den daha çok olan saçtır, demiş. Bir takımları bilakis, vefrenin, limmeden daha az olduğunu söylemişlerdir. Limme omuz başlarına kadar sarkan Örülmedik saçtır. Kaadî Iyaz (Rahimehullah)'ın beyanına göre; arap kadınlarının adeti saçlarını pelik yaparak örmekti. İhtimal Nebi (Sallallahu Aleyhi ve Sellem)'in zevceleri onun vefatından sonra ziyneti terk ettikleri için pelik uzatmaktan vaz geçmişlerdir. Kaadî'nin bu kavli başkalarından da rivayet olunmuştur. Ümmehat-ı mü'minin Resulullah (Sallallahu Aleyhi ve Sellem)'in hayatında böyle bir şey yaptıkları nakledilmediği gibi vuku'u tahmin dahi olunmamıştır",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 729,
			"arabicnumber": "321.01",
			"text": "Bize Harun b. Saîd el-Eylî rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Mahremetü'bnü Bükeyr, babasından, o da Ebu Selemte'bni Abdirrahman'dan naklen haber verdi. Ebu Seleme şöyle demiş: Âişe dedi ki: Resulullah (Sallallahu aleyhi ve Sellem) guslettiği zaman sağından başlar ve onun üzerine su döküp, yıkardı sonra vücudundaki pisliğin üzerine sağ eliyle su döker ve onu sol eliyle yıkardı. Bu işi bitirdikten sonra da başına su dökerdi. Aişe dedi ki: Ben ve Resulullah (Sallallahu aleyhi ve Sellem) her ikimiz de cünüp olduğumuz halde aynı kaptan guslederdik. Yalnız Müslim rivayet etmiştir NEVEVİ ŞERHİ (726-727): \"Ebu Seleme b. Abdurrahman dedi ki. .. Başına üç defa su döktü.\" Kadı İyaz -yüce Allah'ın rahmeti ona- dedi ki: Hadisin zahirinden anlaşıldığı üzere her ikisi de Aişe (r.anha)'nın başını ve (4/3) mahrem olan bir kimsenin yine kendi mahremi olan bir kadının bakması helal olan kadarıyla vücudunun üst taraflarını görmüşlerdir. Çünkü bu iki zalın birisi kendisinin de belirttiği gibi Aişe (r.anha)'nın sütkardeşi idi. Adının Abdullah b. Yezid olduğu söylenir. Ebu Seleme ise kızkardeşinin süt oğlu idi. Ebu Bekir'in kızı Ümmü Kulsum ona süt emzirmişti. Kadı İyaz der ki: Eğer onlar buna tanık olmayıp, görmemiş olsalardı, Aişe (r.anha)'nın su getirilmesini isteyip, onların önünde gusletmesinin bir anlamı olmazdı. Eğer o bütün bu yaplıklarını onların görmeyecekleri şekilde perde arkasında yapmış olsaydı, bu anlamsız bir iş olurdu ve durum Aişe'nin guslü sadece sözlü olarak anlatması ile kalırdı. Onun perde arkasına çekilmesi sadece bedeninin alt taraflarını ve mahrem olan bir kimsenin bakması helal olmayan kısımlarını örtmesi içindi. Allah en iyi bilendir. Aişe (r.anha)'nın bu yaplığından fiili olarak öğretmenin müstehab olduğuna delil vardır. Çünkü uygulamalı olarak öğretmek sözden daha iyi etki bırakır ve sözden daha çok hafızada yer eder. Allah en iyi bilendir. \"Resulullah (Sallallahu aleyhi ve Sellem)'in zevceleri perçem gibi olana kadar saçlarını kısallırlardı.\" Vefra limme' den daha uzundur. Limme omuzlara kadar ulaşmayan saça denilir. Bu açıklama el-Esmai'ye aittir. Başkası ise şöyle demektedir: Vefra, limme'den daha azdır. Kulakları geçmeyen saça denilir (tercümede perçem). Ebu Hatim dedi ki: Vefra kulaklar üzerine kadar gelen saça denilir. (4/4) Kadı İyaz (yüce Allah'ın rahmeti ona) dedi ki: Bilinen şu ki, Arap kadınları saçlarını kısım kısım örederdi. Muhtemelen Nebi (Sallallahu aleyhi ve Sellem)'in zevceleri bu işi Rasillullah (Sallallahu aleyhi ve Selleml'in vefalından sonra yapmışlardır; çünkü onlar vefatından sonra süslenmeyi bırakmış ve saçlarını uzatmaya ihtiyaçları kalmamıştı. Ayrıca saçlarının bakımıarını kolaylaşlırmak için de saçlarını kısaltmışlardı. Kadı İyaz'ın sözünü ettiği müminlerin annelerinin bu işi Resulullah (Sallallahu aleyhi ve Sellem) hayatta iken değil de vefalından sonra yaplıklarına dair açıklamayı aynı şekilde başkası da yapmış olup, bunun zaten başka türlü olması sözkonusu değildir. Onların Resulullah (Sallallahu aleyhi ve Sellem)'in hayatta iken böyle bir iş yapmış olmaları asla düşünülemez. Bunda kadınların saçlarını kısaltmalarının caiz oluşuna delil vardır. Allah en iyi bilendir. \"İkimiz cünüp olduğumuz halde\" Burada \"cünubani\" (ikimiz cünüp olduğumuz) ifadesi \"cünüp\" lafzının ikil ve çoğul yapılacağını gösteren iki söyleyişten birisine göredir. Diğer söyleyişte ise bütün kullanım şekillerinde \"cünüp\" lafzı değişmeden tekil olarak gelir. Nitekim yüce Allah'ın: \"Eğer cünüp iseniz\" (Maide, 5/6) buyruğu ile \"bir de cünüp iken\" (Nisa, 4/43) buyruklarında böyledir. Bu söyleyiş ise daha fasih ve daha meşhurdur. Sözlükte cünüplüğün asıl anlamı uzaklıktır. Cima ya da meninin çıkışı dolayısıyla gusletmesi kap eden kişi hakkında kullanılır; çünkü o bu sebeple namazdan, Kur'an okumaktan, mescitten uzak kalır ve bunlardan uzak durur. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 730,
			"arabicnumber": "321.02",
			"text": "Bana Muhammed b. Rafi' de rivayet etti. (Dediki): Bize Şebabe rivayet etti. (Dediki): Bize Leys, Yezîd' den o da Irak'dan, o da Hafsa binti Abdirahman b. Ebî Bekr'den — bu kadın Münzirü'bnü Zübeyr'in zevcesidir— naklen rivayet etti. onada Aişe haber vermiş ki: Kendisi Nebi (Sallallahu Aleyhi ve Sellem) ile üç müdd yahut ona yakın (su) alacak bir kabdan yıkanırlarmış. Yalnız Müslim rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 731,
			"arabicnumber": "321.03",
			"text": "Bize Abdullah b. Mesleme b. Ka'neb rivayet etti. Dedi ki: Bize Eflah b. Humeyd, Kaasım b. Muhammed'den, o da Âişe'den naklen rivayet etti. Aişe dedi ki: Ben Resulullah (Sallallahu aleyhi ve Sellem) ile birlikte aynı kaptan cünüplükten dolayı yıkanıp, ellerimiz o kabın içine girip çıkardı. Diğer tahric: Buhari,261",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 732,
			"arabicnumber": "321.04",
			"text": "Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Ebu Haysem'e, Âsım-ı Ahvelden, o da Muaze'den, o da Âişe'den naklen haber verdi: Aişe dedi ki: Ben ve Resulullah (Sallallahu aleyhi ve Sellem) benimle onun arasında bulunan aynı kaptan guslederdik. O benden önce su alır hatta ben: Bana bırak, bana bırak, derdim. Aişe: Her ikisinin de eünüp olduğunu söylemiştir. Diğer tahric: Nesai, 238, 412 AÇIKLAMALAR 324.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 733,
			"arabicnumber": "322",
			"text": "Bize Kuteybe b. Said ve Ebu Bekr b. Ebi Şeybe birlikte İbn Uyeyne'den tahdis ettiler. Kuteybe dedi ki: Bize Süfyan, Amr'dan, o Ebu'şŞa'sa'dan tahdis etti. O İbn Abbas'tan şöyle dediğini nakletti: Meymline'nin bana haber verdiğine göre o Nebi (Sallallahu aleyhi ve Sellem) ile birlikte aynı kapta guslederdi. Diğer tahric: Tirmizi, 62; Nesai, 236; İbn Mace, 377 AÇIKLAMALAR 324.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 734,
			"arabicnumber": "323",
			"text": "Bize İshak b. İbrahim ve Muhammed b. Hatim tahdis etti. İshak: Bize Muhammed b. Bekr haber verdi derken, İbn Hatim bize tahdis etti, dedi. Bize İbn Cureyc haber verdi, bana Amr b. Dinar haber verip dedi ki: Büyük bir ihtimalle bildiğim veya hatırladığım kadarıyla Ebu'ş-Şa'sa'nın bana haber verdiğine göre İbn Abbas kendisine Resulullah (Sallallahu aleyhi ve Sellem) Meymline'nin arttırdığı su ile guslederdi, diye haber vermiştir. Diğer tahric: Buhari, 253 AÇIKLAMALAR 324.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 735,
			"arabicnumber": "324",
			"text": "Bıze Muhammed b. el-Müsenna rivayet etti. (Dediki): Bize Muaz b. Hışam rivayet etti. Dediki: Bana babam, Yahya b. Ebî Kesir'den rivayet etti. (Demişki): Bize Ebu Selemete'bni Abdirrahman rivayet ett, onada Zeyneb binti ümmi Seleme rivayet etmiş. onada Ümmü Seleme anlatmışki: Kendisi Resulullah (Sallallahu aleyhi ve Sellem) ile birlikte cünüplükten dolayı aynı kaptan guslederlerdi. Diğer tahric: Buhari, 322 -uzunca-, 1929 -uzunca-; İbn Mace, 380 NEVEVİ ŞERHİ AŞAĞIDA DAVUDOĞLU AÇIKLAMA: Bütün bu rivayetler erkekle kadının bir kabtan beraberce veya biri diğerinden artan suyla yıkanmalarının caiz olduğunu göstermektedir. Ulemanın bu husustaki kavillerini gördük. Ebu Ömer Bu Hususta Beş Mezheb Olduğunu Söylüyor. Şöyleki : 1- Kadın cünüb veya hayzlı değilse; ondan artan suyla erkeğin yıkanmasında beis yoktur. 2- Erkek ve kadının birbirlerinden artan suyla yıkanmaları mekruhtur. 3- Kadından artan suyla erkeğin yıkanması mekruh ise de erkekten artan suyla kadının yıkanmasında kerahet yoktur. 4- Erkekle kadının beraberce başlıyarak abdest almalarında beis yoktur. Kadından artan su da zararsızdır. İmam Ahmed b. Hambel'in mezhebi budur. 5- Erkekle kadının birbirlerinden artan suyla yıkanmalarında beis yoktur. Bu hususta beraberce yahut ayrı ayrı aynı kaptan yıkanmaları hükmen müsavidir. Cumhur-u Fukahanın kavli budur. Erkekle kadının bir kabdan yıkanabileceği hususunda Tahavî, Kurtubî ve Nevevî ulemanın müttefik olduklarını nakletmişlerdir. Bu mes'ele Ashab-ı Kiramdan Ali b. Ebi Talib, İbni Abbas, Cabir, Enes, Ebu Hureyre, Âişe, Ümmü Seleme, Ümmü Hani ve Meymune (R.A.) hazeratmdan rivayet olunmuştur. Hz. Ali hadisini İmam Ahmed b. Hanbel, İbn-i Abbas hadisini «El Kebir» inde Tabaranî, Cabîr hadisini «Musannef» inde İbni Ebî Şeybe, Enes hadisini Buharî, Ebu Hureyre hadisini « Müsned» inde Bezzar, Âişe hadisini Tahavî ile Beyhakî, Ümmü Seleme hadisini İbnî Mace ile Tahavi, Ümmu Hani hadisini Nesaî, Meymune hadisini Tirmîzî tahrîc etmişlerdir. Mezkur hadislerin hepsi sahih olup «erkekle kadın birbirlerinden artan su ile yıkanamaz» diyenlerin aleyhine delildirler. Erkekle kadının aynı kaptan hangisinin evvel başlıyacağı meselesine gelince bir hadiste Nebi (Sallallahu Aleyhi ve Sellem)'in zevcelerinden birinin cünüblükten yıkandığı ve Resulullah (Sallallahu Aleyhi ve Sellem)'in ondan artan su ile sbdest almak ve yıkanmak istediği zevcesinin: «Ya Resulallah! Ben cünübtüm» dediği Fahr-i kainat efendimizin ona: «Su cünüb olmaz» buyurduğu rivayet edilmiştir. İbnî Mace ile Tahavî de abdest hakkında buna benzer hadisler rivayet etmişlerdir. Hatta Tahavî, hadîsi rivayet ettikten sonra: «Bu gösteriyor ki suyu biri diğerinden sonra alırmış» demektedir. Vakıa Resul-i Ekrem (Sallallahu Aleyhi ve Sellem)'in erkekle kadının birbirinden artan suyla yıkanmalarını men ettiğini bildiren rivayetler de vardır. Fakat bu rivayetler itirazdan salim değildirler. Hatta bazıları hakkında hadîs uleması «Sahih değildir» demişlerdir. İbni Tîn bazı ulemadan naklen eskiden erkeklerle kadınların bir kaptan ayrı ayrı abdest aldıklarını rivayet edersede mezkur zevat her halde ecnebi erkeklerle ecnebi kadınları kasdetmiş olsalar gerektir. Çünkü bir adamın kendi ailesiyle bir kabdan beraberce yıkanabileceğini babımız hadîsleri göstermektedir. NEVEVİ ŞERHİ (728-733): (728) \"Aişe (r.anha) Nebi (Sallallahu aleyhi ve Sellem) ile birlikte üç mudd alan bir kapta yıkanırdı.\" Diğer (729) rivayette \"aynı kaptan ... ellerimiz bir iner, bir kalkardı\" denilmektedir. Kadı İyaz birinci rivayetin tefsirinde iki açıklama zikretmektedir: Birincisine göre onların her biri guslü için ayrı ayrı üçer mudd su kullanırdı. İkinci açıklamaya göre burada mud'dan kasıt sa' dır, o takdirde ferak'ın sözkonusu edildiği hadise uygun olur. Bunun bazı hallerde böyle olduğu ve her ikisinin üç mudd alan bir kaptan gusletmiş olmaları, suyu boşalınca da ona ayrıca su katmış olmaları da mümkündür. Allah en iyi bilendir. Diğer taraftan bu (728) numaralı hadiste \"üç mudd ya da ona yakın\" ibaresi diğer (724) rivayette \"ferak'ın kendisi olan bir kaptan yıkanırdı\" başka (726) rivayette: \"Bir sa' kadar bir kap istedi ve onunla yıkandı.\" Öteki (733) rivayette \"beş mekkuk ile gusleder, bir mekkuk ile abdest alırdı.\" Öteki (736) rivayette \"bir sa' onun guslüne yeter, bir mudd de abdestine yeterdi.\" Diğer (735) rivayette \"bir mudd ile abdest alır, bir sa' ile beş mudde kadar su ile de guslederdi\" denilmektedir. İmam Şafii ve ondan başka birtakım ilim adamları şöyle demişlerdir: Bu rivayetleri bir arada telif etmek şöyle olur: Burada sözü edilen gusüller en fazla suyu bulup kullandığı ve en azını bulup kullandığı çeşitli durumlarda sözkonusu olmuştur. İşte bu da taharette tam olarak kullanılması kap eden su miktarının bir sınırının bulunmadığına delildir. Allah en iyi bilendir. (731) Ebu'ş-Şa'sa'nın adı Cabir b. Zeyd'dir. (732) \"Büyük bir ihtimalle bildiğim ve habrladığım şu ki. .. \" (4/6) Hatınmdan geçen, içimden geçen demek istiyor. Bal ise kalp ve zihin demektir. el-Ezherı der ki: Hatara bi bali va ala bali (hatırımdan geçti) denilir. Başkası da habr insanın içinden geçiveren duygudur demişlerdir, çoğulu havabr gelir. Bu hadisi Müslim -yüce Allah'ın rahmeti ona- mutabaat olmak üzere zikretmiştir. Yoksa ona itimat etmek maksadıyla bunu zikretmiş değildir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 736,
			"arabicnumber": "325.01",
			"text": "Bize Ubeydullah b. Muk tahdis etti, bize babam tahdis etti. (H) Bize Muhammed b. el-Müsenna da tahdis etti. Bize Abdurrahman -yani b. Mehdi- tahdis edip (Muk ile birlikte) dediler ki: Bize Şu'be b. Abdullah b. Abdullah b. Cebr tahdis edip dedi ki: Enes'i şöyle derken dinledim: Resulullah (Sallallahu aleyhi ve Sellem) beş mekkuk ile gusleder, bir mekkuk ile abdest alırdı. (Abdullah b. Muk rivayetinde beş mekkuk derken mekkuk'un çoğulunu mekakik olarak zikretmiş olup) İbnu'l-Müsenna ise (bunu) beş mekkuk (anlamında çoğulolmak üzere) mekaki diye (kullanmıştır). Ayrıca İbn Muaz, Abdullah b. Abdullah demiş olup, b. Cebr dememiştir. Diğer tahric: Buhari, 201 -bu anlamda-; Ebu Davud, 95 -bu anlamda- yine 95 -mükerrer- muallak olarak; Tirmizi, 609 -muallak olarak-; Nesai, 73, 229, 344 DAVUDOĞLU AÇIKLAMA: Görülüyor ki rivayetlerin birinde İbnî Cebr lafzı zikredilmiş diğerinde edilmemiştir. Nevevî bunların ikisinin de sahih olduğunu söylüyor. Ulemadan bazıları İbnî Cebr'in yanlışlıkla zikredildiğini, doğrusunun İbnî Cabîr olacağını söylemişsede buradaki hata itiraz edendedir. Çünkü Abdullah b. Abdillah'a hem İbnî Cebr hemde İbnî Cabir denilir. Bu iki vechi İmam Buharî beyan etmiş; ona Mis'ar b. Kidani, Şu'be ve Abdullah b. İsa gibi zevatın İbnî Cebr dediklerini söy­lemiştir. Mekkukün cem'i Mekakîk ve Mekakiy gelir. Nevevî burada on­dan «Müdd» kast edilmiş olmasını muhtemel görüyor. Übbî: «Mekkuk Iraklıların kullandığı bir ölçektir. Medine sa'i ile bir buçuk sa' alır» diyor",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 737,
			"arabicnumber": "325.02",
			"text": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Vekî', Mis'ar'dan o da İbnî Cebir'den, o da Enes'den naklen rivayet etti. Enes şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem) bir müd (su) ile abdest alır. Bir sa' dan beş müdde kadar (su ile) yıkanırdı. NEVEVİ ŞERHİ 326.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 738,
			"arabicnumber": "326.01",
			"text": "Bize Ebu Kamil el-Cahderi ve Amr b. Ali her ikisi Bişr b. el-Mufaddal'dan tahdis etti. Ebu Kamil: Bize Bişr tahdis etti, dedi. Bize Ebu Reyhane, Sefine' den şöyle dediğini tahdis etti: Resulullah (Sallallahu aleyhi ve Sellem)'e cünüplükten gusletmek için bir sa' su, abdest alması için de bir mudd yeterdi. Diğer tahric: Tirmizi, 56; İbn Mace, 267 NEVEVİ ŞERHİ (734-736): (734) \"Abdullah b. Abdullah b. Cebr\" diğer (735) rivayette \"İbn Cebr\" denilmiştir, her ikisi de sahihtir. Ancak bazı imamlar onun böyle demesini kabul etmeyerek doğrusu b. Cabir'dir demişlerdir. Ancak böyle denilmesi bu şekilde itiraz yapanın bir yanlışlığıdır. Aksine onun (babasının) adının Cabir olduğu da Cebr olduğu da söylenmiştir. Tam adı Abdullah b. Abdullah b. Cabir b. Atik'tir. Her iki şekli sözkonusu edenler arasında İmam Ebu Abdullah el-Buhari de vardır. Ayrıca Mis'ar, Ebu'l-Uneys, Şu'be ve Abdullah b. İsa da onun rivayetinde \"Cebr\" demişlerdir. Allah en iyi bilendir. \"ResuluIlah (Sallallahu aleyhi ve Sellem) beş mekkuk (mekakık) ile guslederdi ... \" Diğer rivayette ise \"mekakı\" denilmektedir. Mekkukun çoğulu mekakık ve mekakı diye gelir. Burada muhtemelen mekkukten kasıt muddur. Nitekim diğer rivayette (735) \"bir mudd ile abdest alır, bir sa'dan beş mudde kadar su ile de guslederdi\" denilmektedir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 739,
			"arabicnumber": "326.02",
			"text": "Bize Ebu Bekr b. Ebi Şeybe de tahdis etti. Bize İbn Uleyye tahdis etti (H). Bana Ali b. Hucr de tahdis etti. Bize İsmail, Ebu Reyhane'den tahdis etti. O Sefine'den -Ebu Bekr, Resulullah (Sallallahu aleyhi ve Sellem)'in arkadaşı (Sefine'den) dedi- dedi ki: Resulullah (Sallallahu aleyhi ve Sellem) bir sa' ile gusleder bir mudd ile abdest alırdı. Hadisin İbn Hucr yoluyla gelen rivayetinde: Ya da şöyle dedi: Bir mudd onun abdestine yeterdi. (Ebu Reyhane) ayrıca: O (Sefine) yaşlanmıştı ve ben onun hadisine pek güvenmiyordum, dedi. Diğer tahric: Tirmizi, 56; İbn Mace, 267 NEVEVİ ŞERHİ: \"Bize Ebu Reyhane, Sefine' den tahdis etti.\" Ebu Reyhane' nin adı Abdullah b. Matar'dır. Ziyad b. Matar olduğu da söylenir. Sefine ise hem Resulullah (Sallallahu aleyhi ve Sellem)'in arkadaşı, hem onun azatlısıdır. Adının Mihran b. Ferruh olduğu söylendiği gibi, Mahran, Ruman, Kays, Umeyr, Şenbe olduğu da söylenir. Meşhur künyesi ise Ebu Abdurrahman'dır. Ebu'l-Bahteri olduğu da söylenmiştir. Ona Sefine deniliş sebebine gelince, o bir gazada arkadaşlarına ait çok miktardaki eşyayı taşımıştı. Bundan dolayı Nebi (Sallallahu aleyhi ve Sellem) ona: \"Sen Sefine (bir gemi}sin\" buyurmuştu. \"Bize Ebu Bekr b. Ebi Şeybe tahdis etti ... Onun hadisine güvenmiyordum.\" Bu rivayette geçen \"Resulullah (Sallallahu aleyhi ve Sellem)'in arkadaşı idi\" sıfatı Sefine'ye aittir. Sözü geçen bu sözü söyleyen Ebu Bekr ise Ebu Bekr b. Ebi Şeybe'dir. Yani onu bu şekilde nitelendiren yalnızca Ebu Bekr b. Ebi Şeybe'dir. Ali b. Hucr ise onu bu şekilde nitelendirmeyip, sadece Sefine'den demekle yetinmiştir demek istemektedir. \"Hadisine güvenmiyordum\" ibaresinde güvenmek anlamındaki fiil peltek \"se\" harfi ile \"vüsuk\"tan gelmektedir. Asıl nüshaların çoğunda da böyledir. Bununla birlikte bir topluluk da bu fiili beğenmek ve ondan hoşnut olmak anlamında hemzeden sonra ye ve nun ve kaf harfleri ile rivayet etmişlerdir ki bu da beğenmek, razı olmak demektir. (4/8) \"Yaşlanmışb\" diyen zat Ebu Reyhane' dir. Yaşlandığı söylenen kişi de Sefine'dir. Müslim -yüce Allah'ın rahmeti ona- ise onun bu hadisini yalnız ona güvenerek zikretmiş değildir. Aksine o bu hadisi daha önce zikretmiş olduğu diğer hadislere mutabaat olmak üzere sözkonusu etmiştir. Allah en iyi bilendir. * Hayz Kitabı 3. ciltte devam etmektedir * DAVUDOĞLU AÇIKLAMA: Hadis-i şerif muhtelif rivayetleri ile Resulullah (Sallallahu Aleyhi ve Sellem) abdest ve guslü için ne kadar su sarf ettiğini göstermektedir. Müdd ile Sa'ın neler olduğu yukarıda kısaca arz edilmişti. Ancak sa' hakkında muhtelif rivayetler vardır. Bu husustaki tafsilatı «Tecrid-i Sarîh» mütercimi merhum Ahmed Naîm beyden dinleyelim. Naîm bey şöyle diyor: «Sa': Beş rıtl-ı Bağdadî ile bir sülüs rıtl (1/3) istîab eden kaba denir. Bir müdd de bir sa'ın dörtte biri miktarıdır. Bu Şafiîler-den Nevevî 'nin verdiği hesaptır. Ancak bu ölçek pek ihtilaflı olduğundan ihtilafların derecesini anlamak istiyenler Kamus Tercemesi'nden müdd, sa', mekkuk, rıtl kelimelerine müracaat edebilirler. (Aleyhisselatü vesselam)'efendimiz hazretlerinin muhtelif miktarlarda su ile abdest alıp iğtisal buyurduklarına dair diğer pek çok rivayetler de vardır. Buradaki miktarlar orta yapılı bir kimsenin yıkanacak azası üzerinden akacak suyun en az miktarını gösterir. Bedenin azası üzerinden su aktıktan sonra bu mikdarlardan da az su ile hades giderilebilir. İsraf dedirtmeyecek ziyadesiyle de caizdir. Medine-i Münevvere'de kullanılan müdd -ki fukaha arasında «Müdd-ü Nebevi» namıyla maruftur- (4/3) rıtıl miktan alan bir hacim ölçüsüdür. Dört müdd bir sa'dır. Ancak müdd ile sa'ın miktarlarını anlamak, mikyas tutulan rıtl'ın ne miktar olduğunu bilmeye bağlıdır. Rıtl'ın ise Bağdadîsi, Şamîsi vardır. Yani birinin küsuru İran, diğerinin ki Roma ölçüleri olup hesap edilince takrîbî bir miktar gösteren iki ölçektir. Rıtl-ı Bağdadî (130) daha doğrusu İmam Nevevî'nin tahkikine göre (900/7 ) dirhemdir. Esah olan ikinci takdir isede kesirli olduğundan buna (10/7) dirhem; diğer tabirle bir miskal katarak kesirsiz (130) dirhem itibar edilmiştir, deniliyor. (4/3) rıtl olan bir müdd-ü nebevi bu hesaba göre (1200/7) veya (130) dirhem hesabına göre (520/3) dirhem eder ki en doğru hesap ve takdire göre bir dirhem (3.0898) gram ettiğinden bu miktar su (0,530) yani yarım litreden biraz ziyadece bir şey tutar. Bu miktar bu gün sucuların kullandıkları su bardaklarından üçünün aldığı sudan azdır. Bu, İmam Şafîî ile Hîcaz fukahasının takdiri olup Ebu Hanife ile Irak fukahasına göre ise müdd, iki rıtl olduğundan abdest suyunun miktarı (1,06) litre eder ki; beş kadehten biraz ziyadecedir. Rıtl-ı Şamî : Kamus Tercümesi'nin rıtl maddesinde beyan edildiğine göre (12) okiyye ve her okiyye (40) dirhem olduğundan bu hesaba göre (480) ve bir müdd (620) dirhem olmak lazım gelirse de yine kamusun mekkük maddesinde tafsil edildiğine göre bir okiyye (5/3) istar bir istar (9/2 ) mıskal, bir miskal de (10/7) dirhem olduğundan bir rıtl yine İmam Nevevi'nin bildirdiği üzere (900/7) ve bir müdd (1200/7) dirhem olmuş olur. Bu hesaba göre okiyye Kamus müterciminin rıtl maddesinde dediği gibi kırk dirhem değil Hicazlılarm takdirine göre (75/7) ve Iraklıların takdirine göre (150/7) dirhem olmuş olur. Meğer ki o maddede dirhem namıyla gösterdiği, başka ölçü ola. Resul-i Ekrem (S.A.V.)'efendimiz hazretlerinin buradaki rivayete nazaran abdest suyu işte bu kadar az miktardadır. Gusül için kullandıkları su da bu rivayete nazaran dörtten beş müdd kadardır ki; o da (4800/7) den (6000/) dirhem eder ki aşağı yukarı (2,120) den (2,650) litreye kadar eder. Irak fukahasının müddu iki rıtl itibar ettiklerine göre ise bu miktar takriben (4,24) den (5,3) litreye kadardır. Müslim'in burada Ebu Bekr b. Ebî Şeybe 'den rivayet ettiği son hadisdeki tefsirinden anlaşılıyorki Ebu Bekr b. Ebi Şeybe Sefine'yi Resulullah (Sallallahu Aleyhi ve Sellem)'in sahabisi olmakla vasıflandırmış; Ali b. Hucr ise bu tavsifi yapmayarak sadece ismini anmakla iktifa etmiştir. Hadisin sonundaki: «Ihtiyarlamişti da ben onun hadisine itimad edemiyordum» cümlesini söyleyen Ebu Reyhane ihtiyarlıyandan maksad da Hz. Sefine'dir. Müslim (Rahimehullah) bu Hadisi ssir hadislere mütabaat için rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 740,
			"arabicnumber": "327.01",
			"text": "Bize Yahya b. Yahya, Kuteybe b. Said ve Ebu Bekr b. Ebi Şeybe tahdis etti. Yahya: Bize Ebu'l-Ahvas, Ebu İshak'tan haber verdi derken -diğer ikisi, tahdis etti, dedi.- O Süleyman b. Surad'dan, o Cubeyr b. Mut'im'den şöyle dediğini nakletli: Resulullah (Sallallahu aleyhi ve Sellem)'in huzurunda gusül hakkında tartıştılar. Oradakilerden biri: Ben başımı şöyle şöyle yıkarım, dedi. Resulullah (Sallallahu aleyhi ve Sellem)'de: \"Ben de başımın üzerine üç avuç su dökerim\" buyurdu. Diğer tahric: Buhari, 254 -muhtasar olarak-; Ebu Davud, 239; Nesai, 250, 423; İbn Mace, 575 -muhtasar olarak DAVUDOĞLU AÇIKLAMA: İfada: Suyu akıtmak, dökünmek demektir. Hadeste taksime delalet eden «Emma» kullanılmış, fakat ibarenin bazı kısımları hazfedilmiştir. Mana şudur.: «Bana gelince: Ben suyu başıma üç avuç döküyorum, fakat başkalarının ne yaptığını bilmiyorum. Yahut başkaları böyle yapmıyor.» Maamafih mezkur edat tahkik edilirse mahzuf takdirine dahi hacet kalmadığı görülür. Çünkü «Emma» şart tafsil ve te'kid bildiren bir edatdır. Te'kid bildirdiğini Zemahşerî beyan etmiştir. Burada da te'kid içindir. Binaenaleyh taksime giderek mahzuf takdirine hacet yoktur. Ashab-ı kiram'ın münakaşası guslün sıfatı hakkındadır. Bazısı gusül şöyle yapılır; bazısı böyle yapılır demiş Resulullah (Sallallahu Aleyhi ve Sellem) de sünnet vecihle guslün nasıl yapılacağını kendilerine öğretmiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 741,
			"arabicnumber": "327.02",
			"text": "Bize Muhammed b. Beşşar da rivayet etti. (Dedi ki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be Ebu ishakdan, o da Süleyman b. Surad, Cubeyr b. Mut'im'den, o Nebi (Sallallahu aleyhi ve Sellem)'den rivayet ettiğine göre Allah Resulünün huzurunda cünüplükten dolayı gusletmek sözkonusu edilince \"Ben ise başıma üç defa (su) boşaltırım\" buyurdu. NEVEVİ ŞERHİ 329.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 742,
			"arabicnumber": "328",
			"text": "Bize Yahya b. Yahya ile İsmail b. Salim tahdis edip dediler ki: Bize Huşeym, Ebu Bişr'den haber verdi, o Ebu Süfyan'dan, o Cabir b. Abdullah'tan rivayet ettiğine göre Sakiflilerin heyeti Nebi (Sallallahu aleyhi ve Sellem)'e sorarak: Bizim yaşadığımız yerler soğuk yerlerdir, guslü nasıl yapacağız dediler. Allah Resulü (Sallallahu aleyhi ve Sellem): \"Bana gelince, başımın üzerine üç defa (su) boşaltırım\" buyurdu. İbn Salim rivayetinde dedi ki: Bize Huşeym tahdis etti, bize Ebu Bişr haber verdi. Ayrıca dedi ki: Sakifliler heyeti ey Allah'ın Resulü dediler. Yalnız Müslim rivayet ebniştir DAVUDOĞLU AÇIKLAMA: İmam Müslim (Rahimehullah) bu hadîsin rivayetinde de zaman zaman gösterdiği ilmî dirayet ve vukufunu göstermiştir. Şöyleki: Kavilerden Hüşeym müdellistir ve Ebu Bişr'den rivayet ederken hadis imamlarınca ihtilaflı olan «an» sığasını kullanmıştır. Bir müdellisin bu siga ile rivayet ettiği hadis hüccet olarak kabul edilmez. Meğer ki o hadisi şeyhinden işittiğini ispat eylesin. İşte Müslim, Salim'in rivayetinde Hüşeym'in bize Ebu Bişr haber verdi dediğini göstermekle şeyhinden işittiğini ispat etmiştir. Bu rivayetler de yukarıkilerin delalet ettikleri Ahkamın delillerindendir. NEVEVİ ŞERHİ 329.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 743,
			"arabicnumber": "329",
			"text": "Bize Muhammed b. El Müsenna da rivayet etti (Dediki): Bize Abdülvehhab yani Es-Sekafî rivayet etti (Dediki): Bize Ca'fer babasından, o da Cabir b. Abdillahtan naklen rivayet eyledi. Cabir b. Abdullah dedi ki: Resulullah (Sallallahu aleyhi ve Sellem) bir cünüplükten gusledeceği zaman başının üzerine üç avuç su dökerdi. el-Hasan b. Muhammed ona: Benim saçım çok fazladır deyince, Cabir dedi ki: Ben de ona: Kardeşimin oğlu Nebi (Sallallahu aleyhi ve Sellem)'in saçı senin saçından daha çok ve daha temizdi, dedim. Diğer tahric: İbn Mace, 577 -buna yakın DAVUDOĞLU AÇIKLAMA: Hasan b. Muhammed Hz. Cabir'e «Benim saçım çoktur» demekle başını yıkamak için üç avuç suyun yetmiyeceğini anlatmak istemiştir. Hz. Cabir de ona «Be kardeşim oğlu Resulullah (Sallallahu Aleyhi ve Sellem)in saçı senin saçından daha güzel ve daha temizdi» Cevabını vererek üç avuç su ona bile yeterdi sana'mı yetmeyecek demek istemiştir. NEVEVİ ŞERHİ (738-741): (738) \"Süleyman b. Surad\" meşhur bir sahabidir. \"Surad\" ismi munsariftir. \"Resulullah (Sallallahu aleyhi ve Sellem)'in huzurunda gusül hakkında tartıştılar.\" Yani bu hususta kendi aralarında çekiştiler, kimisi gusül şöyle olur derken, başkaları böyle olur dediler. Bu hadisten ilmi konularda münakaşa ve tartışmanın caiz olduğu anlaşıldığı gibi fazilet itibariyle daha alt mertebede olanların daha faziletli kimsenin huzurunda tartışmalarını ve arkadaşların imamları ve büyükleri huzurunda çekişmelerinin caiz olduğu da anlaşılmaktadır. Resulullah (Sallallahu aleyhi ve Sellem)'in: \"Ben de başıma üç avuç su dökerim. \" Burada üç avuçtan maksat her bir seferde iki avucun dolu halidir. Hadiste guslederken başa üç defa su dökmenin müstehab olduğu anlaşılmaktadır ve bu üzerinde ittifak edilmiş bir husustur. Bizim mezhep alimlerimiz başa ve abdest azalarına kıyas yaparak vücudun diğer bölümlerini de bunun gibi değerlendirmişlerdir. Hem gusülde vücudun üç defa yıkanması abdeste göre daha evladır. Çünkü abdestin temeli külfetin hafifletilmesidir ve bir günde birkaç defa tekrarlanılabilen bir ameldir. Böyle bir am elde azalan üç defa yıkamak müstehab olduğuna göre gusülde bu öncelikle sözkonusudur. Bu hususta ayrıca görüş ayrılığı olduğunu da bilmiyoruz. Şu kadar var ki, kadılar kadısı mezhebimize mensup ve el-Havi adlı büyük eserin sahibi Ebu'l-Hasan el-Maverdi gusülde su dökmenin tekrar edilmesi müstehab değildir demiştir, bu ise şaz ve terkedilmiş bir görüştür. Bundan önceki babta da gusül için kullanılacak suyun en azı ile ilgili açıklamaları zikretmiş bulunmaktayız. Allah en iyi bilendir. (740) \"Bize Yahya b. Yahya ve İsmail b. Salim tahdis edip dediler ki ... Cabir'den \" Daha sonra Müslim bu hadisin nihayetinde: \"İbn Salim rivayetinde dedi.\" Demektedir. Müslim' in bu ifadelerinde bu ilmin inceliklerinden pek büyük faydalı bir özellik vardır. Bu özellik de Müslim'in -yüce Allah'ın rahmeti ona- ilminin ne kadar geniş olduğunu da, bakış açısının ne kadar incelikli olduğunu da açıkça ortaya koymaktadır. O da şudur: Huşeym -yüce Allah'ın rahmeti ona- tediis yapan bir ravi idi. Önceki rivayette \"an Ebi Bişr\" demişti. Tediis yapan ravi ise \"an\" lafzı ile rivayette bulunacak olursa onun o hadisi kendisinden \"an\" diyerek rivayette bulunduğu kişiden sema' yoluyla aldığı tespit edilmedikçe bu şekildeki rivayeti delil gösterilemez. Böylelikle Müslim onun bu hadisi sema' yoluyla başka bir yoldan dinlediğinin sabit olduğunu beyan etmiş olmaktadır. Bu ise İbn Salim' in yapbğı rivayettir. O rivayetinde: Bize Ebu Bişr haber verdi, demiştir. Bu gibi inceliği bundan önce defalarca zikretmiş bulunuyoruz. Ebu Bişr'in adı Cafer b. Iyas'dır. Cafer b. Ebi Vahşiye de odur. Burada sözü geçen Ebu Süfyan'ın adı ise Talha b. Nafi\"dir. Daha önce de açıklanmıştı. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 744,
			"arabicnumber": "330.01",
			"text": "Bize Ebu Bekr b. Ebi Şeybe, Amr en-Nakid, İshak b. İbrahim ve İbn Ebu Ömer tahdis etti. Hepsi İbn Uyeyne' den rivayet etti. İshak dedi ki: Bize Süfyan, Eyyub b. Musa'dan haber verdi, o Said b. Ebi Said el-Makburi'den, o Ümmü Seleme'nin azatlısı Abdullah b. Rafi\"den, o Ümmü Seleme'den şöyle dediğini nakletti: Ben ey Allah'ın Rasulü saçımın örgülerini bağlayan bir kadınım. Cünüplükten gusletmek için onu çözeyim mi dedim. O: \"Hayır, başına üç defa su dökmen sana yeter sonra üzerine su dökersin ve böylece temizlenirsin\" buyurdu. Diğer tahric: Ebu Davud, 251 -buna yakın-; Tirmizi, 105; Nesai, 241; İbn Mace, 603 -buna yakın",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 745,
			"arabicnumber": "330.02",
			"text": "Bize Amr en-Nakid de tahdis etti, bize Yezid b. Harun tahdis etti (H). Bize Abd b. Humeyd de tahdis etti. Bize Abdurrezzak haber verdi. (Yezid ile birlikte) dediler ki: Bize es-Sevri, Eyyub b. Musa'dan bu isnad ile haber verdi. Abdurrezzak'ın hadisi rivayetinde ay halinden ve cünüplükten dolayı gusletmek için onu çözeyim mi, diye sordu, Allah Rasulü: \"Hayır\" buyurdu. Sonra hadisi İbn Uyeyne'nin hadisi rivayet ettiği manada zikretti",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 746,
			"arabicnumber": "330.03",
			"text": "Bu Hadîs-î bana Ahmed ed-Darimi dahî rivayet etti. (Dediki) Bize Zekeriya b. Adiy rivayet etti. (D.edi ki): Bize yezîd yanî İbni Zürey, Ravh b. Kaasim'den rivayet etti. (Dediki): Bize Eyyüb b. Musa bu isnadla rivayet etti. ve: «Onu cünüplükten dolayı çözerek yıkayayımmı?» dedi Hayzı zikretmedi. AÇIKLAMALAR 331.sayfada",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 747,
			"arabicnumber": "331",
			"text": "Bana Yahya b. Yahya, Ebu Bekr b. Ebi Şeybe ve Ali b. Hucr birlikte İbn Uleyye'den tahdis ettiler. Yahya dedi ki: Bize İsmail b. Uleyye, Eyyub'dan haber verdi. O Ebu'z-Zubeyr'den, o Ubeyd b. Umeyr'den şöyle dediğini nakletti: Aişe (r.anha}'ya Abdullah b. Amr'ın gusledecekleri zaman saçlarını (örgülerini) çözmelerini kadınlara emrettiği haberi ulaşınca: Şu İbn Amr'a hayret doğrusu! Kadınlara gusledecekleri zaman başlarını (saç örgülerini) çözmelerini emrediyor. O halde niçin onlara saçlarını tıraş etmelerini emretmiyor. Andolsun ben Resulullah (Sallallahu aleyhi ve Sellem) ile birlikte aynı kaptan guslederdim de başıma üç defa su dökmekten fazla bir şey yapmıyordum. Diğer tahric: Nesai, 414 -buna yakın-; İbn Mace, 604 NEVEVİ ŞERHİ AŞAĞIDA DAVUDOĞLU AÇIKLAMA: Bu rivayetler gusül ederken kadının saçını çözmesi îcap etmediğini bildirmektedir. Dafr: Saç örgüsü yani pelik demektir. Bazıları bu kelimenin «Dufur» şeklinde okunacağını, dafr kıraetinin yanlış olduğunu iddia etmişlerse de bu iddia doğru değildir. Kelime iki şekilde de okunabilir. Ancak sabit ve muttasıl Hadislerde «Dafr» şeklinde zaptedildiği için o şekilde okunması tercih olunur. Hafne: Avuç dolusu demektir. Hadis-i rivayet eden Ümmül Müminin Seleme (Radiyallahu anha)'nın ismi Hind'dir. Hadîs'in ahkamı hakkında Nevevî şunları söyler.: «Cumhur ulema ile bizim mezhebimize göre yıkanan kadının saçlarının içine ve dışına su işlediği zaman onları çözmek vacip değildir. Peliklerini çözmeden içlerine su işlemiyecekse çözmek vacip olur. Ümmü Seleme Hadisi onun saçlarına çözmeden su işlediğine hamledilir. Çünkü suyu saçların her tarafına vardırmak vaciptr. Hatta İbrahim Nehai'den rivayet olunduğuna göre saçların içine su işlesin, işlemesin her halde onları çözmek vaciptir. Hasan-ı Basrî ile Tavus «Hayzdan yıkanırken saçların çözülmesi vacip, cünüplükten yıkanırken vacip değildir, demişlerdir. Bizim delilimiz Ümmü Seleme Hadis'idir. Erkeğin başında peliği bulunursa onun hükmü de kadın gibidir.» Hanefîlere göre yıkanırken su saçların dibine işlemek şartıyla kadının peliklerini çözmesi vacip değildir. Hatta Sahîh rivayete göre peliklerini ıslatmak dahî lazım değildir. «Hanefîlere» Bu Hadis haber-i vahittir. Binaenaleyh onunla Teala hazretlerinin «Cünüp olursanız tertemiz yıkanın.» ayet-i kerimesine ziyade edilemez, şeklinde bir itiraz da varid olamaz. Çünkü saç her cihetle bedenden değildir. Âyet-i Kerîmedeki emirse bedenin temizlenmesine aittir. Bir de gözlerin içi gibi zaruret yerleri yıkamaktan istisna edilmiştir. Zira bunda güçlük ve zarar vardır. Kadının saçını çözmesinde zarar yoksada güçlük vardır. Peliklerin ıslatılmasına gelince: Sahîh Kavle göre bu da vacip değildir çünkü bunda da güçlük vardır. İmam Hasan b. Ziyad'ın Ebu Hanîfe‘den bir rivayetine göre saçlar üç defa ıslanır ve her defasında sıkılır. Bu suretle aralarına suyun işlemesi temin edilir. Pelikler zaten çözülmüş ise Fakîh Ebu Cafer'den bir rivayete göre onları ıslatmak vacip olur. Erkeğin başında pelik bulunursa çözüp çözmeyeceği ihtilaflıdır. İhtiyaten çözmesi vaciptir. Nevevî diyorki; «Gerek cünüplükten gerekse hayz ve nifas gibi şeylerden yıkanma hususunda erkekle kadının hükmü birdir. Yalnız hayz ve nifastan yıkanan kadınların misk kullanmaları müstehabdır. Erkekler'e Misk kullanmak müstehab değildir. Kadın bakire ise yıkanırken suyu fercinin dahiline ulaştırması vacip değildir. Bakire değilse fercinin kaza-i hacete oturduğu zaman açılan yerlerini yıkaması vacip olur. Çünkü o yerler bedenin dış kısmı hükmündedir. İmam Şafiî ile ulemamızın ekserisi bu ciheti nassan beyan etmişlerdir. Ulemamızdan bazılarına göre bakire olmayan kadın'ın dahili fercini yıkaması vacip değildir. Bazıları da bunun hayz ve nifastan temizlenirken vacip olduğunu, cünüplükten temizlenirken vacip olmadığını söylerler. Fakat Sahîh olan birinci kavildir. Hanefilere göre kadının fercinin dış kısmını yıkaması vaciptir. Zira ağız hükmündedir. Parmağını dahile sokarak yıkaması vacip değildir. Fetvada buna göredir. Yani bu meselede Hanefilerle Şafiiler hemen hemen ittifak etmiş gibidirler. Sünnetsiz erkeğin avret mahallindeki kılıfın içini yıkaması müstehabtır. Hatta «En-Nevazil» nam eserde yıkanmasının vacip olduğu bildiriliyorsa da esah olan birinci kavildir. Hz. Abdullah b. Amr'in yıkanırken kadınlarına saçlarını çözmelerini emretmesi bunu vacip gördüğüne hamledilir. Şu halde yıkama emrini vermesi ya suyun ulaşması îcap eden saç diplerinin yıkanması içindir. Yahut onun mezhebine göre yıkanacak kadının mutlaka saçını çözmesi vaciptir. Nitekim İbrahim Nehai'nin mezhebi de budur. Bu takdirde İbni Amr (Radiyallahu anh) Ümmü Seleme ve Âişe (Radiyallahu Anhuma) hadîslerini duymamış demektir. Mamafih İbni Amr'm bu emri müstehab olmak üzere ihtiyaten vermiş olması da ihtimal dahilindedir. -Allahu A'lem- NEVEVİ ŞERHİ (742-745): (Bu babta) Ümmü Seleme (r.anha}'nın: \"Ey Allah'ın Resulü, dedim ... buyurdu.\" Diğer (743) rivayette: \"Ay hali ve cünüplük dolayısıyla çözeyim mi\" hadisi ile bu manaya yakın (745) Aişe (r.anha}'nın rivayet ettiği hadis yer almaktadır. (742) \"Saçımın 'örgülerini bağlıyorum\" sözündeki \"dafr: örgüler\" kelimesinin bu şekildeki söylenişi muhaddisler, fakihler ve bagkaları nezdinde hadisin bilinen meşhur ve yaygın rivayeti bu şekildedir. Bu.da,ben saçımı sıkı ve sağlam örüyorum, demektir. İmam İbn Berri ise fukahanın lahni (yanlış telaffuzları) 'hakkında tasnif ettiği küçük kitapçığında şunları söylemektedir: Onların Ümmü Seleme'nin rivayet ettiği hadiste \"saçımın örgülerini 'bağlıyorum\" derken, -dat harfini fethalı, fe harfini sakin olarak \"dafr\" demeleri de bu tür yanlışiıklarındandır. Bunun doğrusu ise \"dufur\" olup, çoğulu \",dafira\",dır. Ama onun bunu kabul.etmeyip, yanlış olduğunu ileri sürdüğü şekil •doğru değildir. Aksine doğrusu her iki şeklin de caiz olduğudur, bunların her birinin doğru bir anlamı vardır ama bizim önce sözünü ettiğimiz şeklin doğruluğu daha ağırlık kazanmaktadır. çünkü sabit ve muttasıl rivayetlerde sema yoluyla alınan odur. Allah en iyi bilendir. \"Başına üç avuç su dökersin\" buyruğu, diğer rivayetteki ile aynı anlamdadır. \"Hafne\" ne olursa olsun iıki avuç dolusu şeye denilir. Ümmü Seleme'nin adı Hind'dir. Ramke olduğu da söylenmiş ise de bunun hiçbir kıymeti yoktur. Bu Babtaki Hadislerden Çıkartılan Hükümlere Gelince: Bizim ve cumhurun mezhebine göre gusleden kadının, eğer su içten ve dıştan saçının dibine tamamen ulaşıyor ise saç örgülerini çözmesi vacip değildir. Eğer örgülerini çözmeden su ulaşamıyorsa o takdirde çözmesi icab eder. Um Seleme (r.anha) validemizin rivayet ettiği hadis de örgülerini çözmeksizin suyun saçının tamamına ulaşmış olduğu şeklinde yorumlanır; çünkü suyun bu şekilde ulaştırılması vaciptir. en-NehaI' den ise durum ne olursa olsun saçını çözmesinin vacip olduğu nakledilmiştir. Hasan ve Tavus'tan ise cünüplükte değil de, ay halinden guslederken çözülmenin vacip olduğunu söyledikleri nakledilmiştir. Delilimiz ise Ümmü Seleme'nin rivayet ettiği bu hadistir. Şayet erkeğin saçı da örgü yapılmışsa hükmü kadının hükmü gibidir. Allah en iyi bilendir. Erkeğin cünüplükten gusletmesi ile kadının cünüplükten, ay halinden ve loğusalıktan dolayı gusletmesi ve diğer meşru bütün gusül şekillerinde erkek ile kadının gusülleri aynıdır. Bundan ileride geleceği üzere ay halinden ve loğusalıktan dolayı gusleden kadın ile ilgili onun misk ile kokulandırılmış bir parça kullanması müstesnadır. Bundan önceki babta guslün eksiksiz nasıl yapılacağına dair açıklama geçmiş bulunmaktadır. Eğer gusleden kadın bakire ise, suyu fercinin içine ulaştırması vacip değildir. Eğer bakire değilse suyun ihtiyacını gidermesi için oturması halimde fercinin görünen kısmına ulaştırılması icap eder; çünkü bu durumda vücudunun dışı hükmünü alır. Şafil ve mezhebimize mensup ilim adamlarının çoğunluğu bunu böylece ifade etmişlerdir. Mezhebimize mensup bazı ilim adamları ise fercin içini yıkamak bakire olmayan kadına vacip değildir, demişlerdir. Bazıları ise bu, ay halinden ve loğusalıktan dolayı gusletmek halinde vaciptir, cünüplükten dolayı gusletmek halinde değildir demiştir; ama doğru olanı birincisidir. Allah en iyi bilendir. (745) Abdullah b. Amr (r.anh)'ın kadınlara gusledecekleri zaman saçlarının örgülerini çözmelerini emretmesi ise kadınlara bunu yapmalarının vacip olduğunu kastettiği ve bunun ise suyun saçlarının dibine varmadığı kimseler hakkında olduğu şeklinde yorumlanır yahut onun mezhebine (görüşüne) göre -en-Nehaı' den naklettiğimiz üzere- her durumda saçını çözmek icap eder ve Ümmü Seleme ile Aişe (r.anhuma)'nın rivayet ettikleri hadisin ona ulaşmamış olduğu kabul edilir. Bununla birlikte onun kadınlara böyle yapmalarının vacip olmak üzere değil de, müstehap olduğu ve ihtiyatlı olmak için emretmiş olma ihtimali de vardır. Şanı yüce Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 748,
			"arabicnumber": "332.01",
			"text": "Bize Amr b. Muhammed en-Nakid ve İbn Ebu Ömer birlikte İbn Uyeyne'den tahdis etti. Amr dedi ki: Bize Süfyan b. Uyeyne, Mansur b. Safiye'den tahdis etti. O annesinden, o Aişe (r.anha)'dan şöyle dediğini nakletti: Bir kadın Nebi (Sallallahu aleyhi ve Sellem)'e ay halinden nasıl gusledip, temizleneceğini sordu. Aişe (r.anha) Allah Resulünün o kadına nasıl gusledeceğini sonra bir misk parçasını alıp, onunla temizleneceğini anlattığını söyledi. Kadın: Onunla nasıl temizleneyim, deyince, Allah Resulü: \"Subhanallah, onunla temizlen işte\" buyurdu ve örtündü. -Süfyan b. Uyeyne de eliyle bize yüzünün üzerini işaret etti.- Aişe dedi ki: Ben de kadını kendime doğru çektim, Nebi (Sallallahu aleyhi ve Sellem)'in ne demek istediğini anlamıştım. Bunun için (kadına): O misk parçasını kanın geldiği yere sürersin, dedim. İbn Ebi Ömer hadisi rivayetinde: Onu kanın geldiği yerlere sürersin dedim, demiştir. Diğer tahric: Buhari, 314, 315, 7357; Nesai, 251, 425",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 749,
			"arabicnumber": "332.02",
			"text": "Bana Ahmed b. Said ed-Darimi de tahdis etti: Bize Habban tahdis etti, bize Vuheyb tahdis etti. Bize Mansur annesinden tahdis etti, onun Aişe'den rivayetine göre bir kadın Nebi (Sallallahu aleyhi ve Sellem)'e (ay halinden) temizlendiğim zaman nasıl gusledeyim, diye sordu. Allah Rasulü: \"Misk sürünmüş bir bez parçası alıp, onunla abdest al\" buyurdu sonra (Habban) hadisi Süfyan'ın rivayetine yakın olarak zikretti",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 750,
			"arabicnumber": "332.03",
			"text": "Bize Muhammed b. Müsenna ve İbn Beşşar tahdis etti. İbn Müsenna dedi ki: Bize Muhammed b. Cafer tahdis etti. Bize Şu'be, İbrahim b. Muhacir'den şöyle dediğini tahdis etti: Safiye'yi, Aişe'den tahdis ederken dinledim: Esma, Nebi (Sallallahu aleyhi ve Sellem)'e ay halinden dolayı gusletmek hakkında soru sordu. Allah Resulü: \"Sizden herhangi bir kadın (ay halinden dolayı gusledecek olursa) suyunu ve hoş kokulu sidresini (çöven otunu) alır ve iyice temizlenir. Sonra başının üzerine su dökerek su saçlarının diplerine varıncaya kadar iyice ovalar sonra üzerine su döker sonra misk ile kokulandırılmış bir bez parçası alarak onunla temizlenir\" buyurdu. Esma: Onunla nasıl temizlenir, dedi. Allah Resulü: \"Subhanallah! Onunla temizleniverirsin işte\" buyurdu. Aişe -sözünü gizlemek istercesine-:Kanın iz bıraktığı yere sürersin, dedi. Sonra Esma ona cünüplükten dolayı gusletmek hakkında soru sordu. Allah Resulü: \"Su alarak temizlenir, güzel bir şekilde temizliğini yapar -yahut- temizliğini ileri dereceye kadar götürür sonra başına su döküp saçının diplerine varıncaya kadar başını iyice ovalar sonra da üzerine su döker\" buyurdu. Aişe: Ensar kadınları ne iyi kadınlardır, haya etmek onları din hakkında gerektiği gibi bilgi sahibi olmalarını engellemedi, dedi. Diğer tahric: Ebu Davud, 314, 315, 316; İbn Mace, 642",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 751,
			"arabicnumber": "332.04",
			"text": "Bize Ubeydullah b. Muaz da tahdis etti, bize babam tahdis etti. Bize Şu'be bu isnad ile buna yakın olarak rivayet etti ve şöyle dedi: Resulullah (Sallallahu aleyhi ve Sellem): \"Subhanallah, onunla temizlenirsin işte\" buyurdu ve örtündü",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 752,
			"arabicnumber": "332.05",
			"text": "Bize Yahya b. Yahya ve Ebu Bekr b. Ebu Şeybe, ikisi Ebu'l-Ahvas'dan tahdis etti. O İbrahim b. Muhacir'den, o Şeybe kızı Safiye'den, o Aişe'den şöyle dediğini nakletti: Şekel kızı Esma Resulullah (Sallallahu aleyhi ve Sellem)'in huzuruna girdi ve: Bizden bir kadın ay halinden temizlenecek olursa nasıl gusleder, diye sordu ve hadisin geri kalan kısmını nakletti, ama rivayetinde cünüplükten gusletmeyi sözkonusu etmedi. DAVUDOĞLU ŞERHİ İÇİN buraya tıklayın NEVEVİ ŞERHİ: (746) Bundan önceki babta kadın ile erkeğin gusül şeklinin aynı olduğunu belirtmiş ve bunu yeteri kadarıyla açıklamıştık. Bu başlıkta gözetilen maksat ise, ay halinden gusledecek olan bir kadının bir miktar misk alıp, onu bir pamuk, bir bez ya da benzer bir şey arasına koyup, guslettikten sonra bunu fercine sürerek temizleneceğini anlatmaktır. Bu şekilde bir uygulama loğusa kadın için de müstehabtır. Çünkü loğusa kadın da ay hali kadın durumundadır. Mezhep alimlerimizden el-Mehamili'nin el-Mukanna'da ay halinden ve loğusalıktan dolayı gusleden bir kadının vücudunun kan değmiş bütün yerlerine hoş koku sürmesinin müstehab olduğunu ifade etmiştir. Onun sözünü ettiği vücudun kan değmiş her yerini kapsaması ile ilgili ifadeleri gariptir. Bunu araştırdıktan sonra ondan başka böyle bir şey diyen bir kimse olduğunu tespit edemedim. İlim adamları misk'in kullanılmasındaki hikmetin ne olduğu hususunda ihtilaf etmişlerdir. Bizim mezhep alimlerinden ve başkalarından büyük çoğunluğun söyleyip, tercih edilen sahih görüşe göre misk kullanmaktan maksat, belli yerin kokulandırılması ve hoş olmayan kokunun giderilmesidir. Mezhep alimlerimizden kadılar kadısı el-Maverdi de bu hususta mezhep alimlerimizin iki görüşü olduğunu nakletmiştir. Bu iki görüşten biri budur, ikincisi ise bundan maksat gebe kalmayı hızlandırmasına sebep oluşudur, demiştir. Açıklamasını şöyle sürdürmektedir: Eğer birinci görüşü kabul edecek olursak şayet misk bulamazsa onun yerini tutabilecek, kokusu hoş başka şeyler de kullanabilir. Eğer ikinci görüşü kabul edecek olursak bu hususta onun yerini tutan kust, ezfar ve benzeri şeyler kullanabilir. Ayrıca ilim adamlarımız bunun ne zaman kullanılacağı hususunda da farklı görüşlere sahiptir. Birinci görüşü kabul edenler bunu guslettikten sonra kullanır demişlerdir, ikinci görüşü kabul edenler ise gusletmeden önce kullanır demişlerdir. el-Maverdl'nin açıklamaları burada sona ermektedir. el-Maverdi'nin nakletmiş olduğu bunun gusülden önce kullanılacağı kanaatinin hiçbir kıymeti yoktur. Bunu çürütmek için Müslim'in kitabında rivayet ettiği Nebi (Sallallahu aleyhi ve Sellem)'in: \"Sizden biriniz suyunu ve hoş kokulu sidresini (çöven otunu) alır, onunla güzel bir şekilde temizlenir sonra başına su döküp, saçlarını ovalar sonra üzerine su döker sonra misk ile kokulandınımış bir bez parçası alarak onunla temizlenir\" buyruğudur. İşte bu ifadeler misk ile kokulandırılmış parçanın guslettikten sonra kullanılacağına dair apaçık bir delildir. Bundan maksadın gebe kalmanın hızlandırılmasına sebep olmasıdır, diyenıerin görüşleri ise zayıf yahut batııdır. Çünkü böyle diyen kimsenin bu görüşünün gereği olarak böyle bir uygulama emrinin o sırada hemen zevcesiyle cima etmesi ümit edilen, kocası yanında bulunan kadına özel olarak verilmesini gerektirir. Bu ise bildiğimiz kadarıyla kimsenin kabul ettiği bir görüş değildir. Ayrıca hadislerdeki mutlak ifadeler böyle bir kanaati kabul edenlerin görüşünü reddetmektedir. Aksine doğrusu şudur: Bundan maksat o yere hoş kokunun sürülmesi, hoş olmayan kokunun giderilmesidir. Böyle bir uygulama ay halinden ya da loğusalıktan dolayı gusleden her kadın için müstehabtır. İster kocası olsun, ister olmasın. Bunu da guslettikten sonra yapar. Şayet misk bulamayacak olursa bulabildiği herhangi bir kokuyu kullanabilir. Eğer hoş bir koku bulamazsa hoş olmayan kokuları izale eden özel kil ve benzerlerini kullanmak müstehab olur. Bunu mezhep alimlerimiz açıkça ifade etmişlerdir. Şayet bu söylenenlerden hiçbirisini bulamayacak olursa ona su yeterlidir ama imkanı olmakla birlikte hoş koku kullanmayı terk etmesi onun için mekruhtur. İmkanı olmazsa mekruh işlemesi sözkonusu değildir. Allah en iyi bilendir. \"Firsa\" parça demektir. Misk de bilinen bir kokunun adıdır. Muhakkiklerin rivayet edip, söylediği sahih ve tercih edilen budur, fukahanın ve onların dışında çeşitli ilim erbabının kabul ettikleri de budur. Bunun mim harfi üstün olarak \"mesk\" diye bir söyleyişi de nakledilmiştir. Ancak mesk, üzerinde kıl ve tüy bulunan deri demektir. Kadı lyaz'ın naklettiğine göre mim harfinin fethalı rivayeti çoğunluğun rivayetidir. Hatta Ebu Ubeyd ve İbn Kuteybe şöyle demişlerdir: Buradaki ifade ötreli bir kaf ve dat ile \"kurda\" ile fethalı mim ile \"mesk\" yani bir deri parçası şeklinde olduğudur. Fakat bütün bu açıklamalar zayıftır, doğrusu bizim daha önce kaydettiğimizdir. Ayrıca buna yine kitapta zikredilmiş ''firsatun mumesseketun: misk ile kokulandırılmış bir bez parçası\" ifadesi buna delil teşkil etmektedir ki, bu da daha önce açıkladığımız gibi misk ile kokulandırılmış bir parça pamuk, yün yahut bez demektir. Allah en iyi bilendir. \"Onunla temizlen işte, subhanallah!\" Daha önce bu ve benzeri yerlerde \"subhanallah\"ın hayret ve şaşkınlık ifade ettiğini söylemiştik. Aynı şekilde la ilahe illallah demek de böyledir. Burada hayret ve şaşkınlık da şu demektir: İnsanın anlamak için ayrıca düşünmeye ihtiyacı olmayacak kadar açık böyle bir husus nasıl anlaşılamaz ki? Bu ibareden bir şeye hayret edip, şaşırmak ve onu büyük bir iş görmek halinde subhanallah diyerek tesbihte bulunmanın caiz olduğu anlaşılmaktadır. Aynı şekilde bir şeyden emin olmak ve onu hatırlamak için de tesbih etmek caizdir. Hakkında edeplice konuşulması gereken hususlar ile ilgili olarak kinayeli ifadelerin kullanılmasının müstehab olduğu da anlaşılmaktadır. Defalarca bu kaide daha önce açıklanmıştı. Allah en iyi bilendir. \"Onu kanın geldiği yere sürersin\" buyruğu hakkında ilim adamlarının çoğunluğu bununla ferci kastetmektedir, demişlerdir. Bizler elMehamili' den: Vücudunun kan isabet etmiş olan her yerine hoş koku sürer, dediğini daha önce nakletmiştik. Hadisin zahiri ifadesinde onun lehine delil vardır. (747) \"Bize Habban tahdis etti, bize Vuheyb tahdis etti.\" Burada geçen Habban, Habban b. Hilal' dir. (748) Resulullah (Sallallahu aleyhi ve Sellem): \"Sizden biriniz suyunu alır ... üzerine su döker\" buyruğu hakkında Kadı lyaz -yüce Allah'ın rahmeti onaşöyle diyor: İlk olarak sözü edilen temizlik necasetten ve ona bulaşmış olan ay hali kanından temizlenmektir. Kadı lyaz böyle demiştir ama daha açık ve güçlü olan kanaat -ki Allah en iyi bilendir- birinci temizlenmekten maksadın Nebi (Sallallahu aleyhi ve Sellem)' in nasıl guslettiği ile ilgili rivayetlerde geldiği üzere abdest almaktır. Bizler abdest kitabının baş taraflarında güzelce abdest almanın anlamının tam ve eksiksiz olarak usulüne göre almak olduğunu belirtmiş idik. İşte bu hadiste kastedilen de budur. \"Saç dip/erine varıncaya kadar\" Kasıt, başındaki saçların diplerine kadar suyun ulaştırılmasıdır. \"Aişe bunu gizlemek ister gibi. .. dedi.\" Yani Aişe (r.anha) muhatabı olan kadına (4/15) duyacağı ama hazır bulunanların duyamayacağı bir şekilde gizlice söyledi, demektir. Allah en iyi bilendir. (750) \"Şekel kızı Esma\" Şekel isminde şın ve kef harfleri fethalıdır. Sahih ve meşhur olan da budur. Ama Metali' sahibi bu ismin kef harfi sakin olarak {Şeklı şeklinde okunduğunu da nakletmektedir. Hafız Hatib Ebu Bekr el-Bağdadı de e/-Esmau'/-Mübheme adlı eserinde ve ondan başka bir kısım ilim adamının belirttiklerine göre bu soruyu soran kadın hatibetu'n-nisa (kadınların sözcüsü) diye anılan Yezid b. Seken kızı Esma idi. Hatib ona bu ismin verildiği bir hadisi de rivayet etmiştir. Allah en iyi bilendir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 753,
			"arabicnumber": "333.01",
			"text": "Bize Ebu Bekr b. Ebî Şeybe ile Ebu Kureyb rivayet ettiler. Dedilerki Bize Vekî, Hişanı b. Urve'den, o da Babasından, o da Aişe'den naklen rivayet etti. Aişe şöyle demiş: Ebu Hubeyş'in kızı Fatıma Nebi (Sallallahu aleyhi ve Sellem)'e gelerek: Ey Allah'ın Resulü, ben istihazalı bir kadınım. Bir türlü temizlenemiyorum, namazı bırakayım mı, dedi. Allah Resulü: \"O ancak bir damar( dan gelen bir kanıdır. O ay hali değildir. Bu sebeple ay hali zamanın gelince namazı bırak. Ay hali vaktin bitince de üzerindeki kanı yıka ve namaz kıl\" buyurdu. Diğer tahric: Buhari, 228; Tirmizi, 125; Nesai, 357; İbn Mace, 621)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 754,
			"arabicnumber": "333.02",
			"text": "Bize Yahya b. Yahya rivayet etti (Dediki): Bize Abdülaziz b. Muhammed ile Ebu Muaviye haber verdiler. H. Bize Kuteybe ibni Saîd de rivayet etti (Dediki): Bize Cerîr rivayet eyledi H. Bize İbni Nümeyr dahî rivayet etti. (Dediki): Bize babam rivayet etti H. Bize Halef b. Hişam da rivayet etti. (Dediki): Bize Hamnıad b. Zeyd rivayet etti. Bunların hepsi Hişam b. Urve'den, Veki'in hadisi ve isnadı gibi rivayette bulunmuşlardır. Kuteybe'nin Cerîr'den naklen rivayet ettiği hadisde: «Fatıma binti Ebî Hubeyş b. Abdilmuttalip b. Esed geldi. O bizden bir kadındır» sözleri vardır. Hammad b. Zeyd hadisinde ise ziyade bir söz vardır, biz onu terk ettik. Diğer tahric: Cerir, İbn Numeyr ve Abdulaziz'in rivayetlerini Müslim yalnız başına rivayet etmiştir Halef b. Hişam'ın rivayetini Nesai, 214, 362; İbn Mace, 621 Ebu Muaviye'nin rivayetini Buhari, 228; Tirmizi, 125; Nesai, 212, 257 de rivayet etmişlerdir. 751 - 752",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 755,
			"arabicnumber": "334.01",
			"text": "Bize Kuteybetü-bnü Said rivayet etti. (Dediki): Bize Leys rivayet etti. H. Bize Muhammed b. Rumh da rivayet etti. (Dediki): Bize Leys, İbni Şihab'dan o da Urve'den, o da Aişe'den naklen haber verdi. Aişe şöyle demiş: Cahş kızı Ümmü Habibe Resulullah (Sallallahu aleyhi ve Sellem)'e fetva sorarak: Ben istihaza kanı görüyorum, dedi. Allah Resulü: \"O bir damar(dan gelen bir kan)'dır. Gusledip sonra namaz kıl\" buyurdu. Bundan dolayı o da her namaz için guslederdi. Leys b. Sa'd dedi ki: İbn Şihab Resulullah (Sallallahu aleyhi ve Sellem)'in, Cahş kızı Ümmü Habibe'ye her namaz için gusletmesini emrettiğini zikretmeyip, bunu kendisinin yaptığını söylemiştir. İbn Rumh ise rivayetinde Cahş kızı demek olan \"bint-i Cahş\" demeyip, yine aynı anlamda \"ibnet-i Cahş\" demiş ve ayrıca \"Ümmü Habibe'yi zikretmemiştir. Diğer tahric: Ebu Davud, 290; Tirmizi, 129; Nesai, 206, 350",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 756,
			"arabicnumber": "334.02",
			"text": "Bize Muhammed b. Selemete'I-Muradi de rivayet etti. (Dediki): Bize Abdullah b. Vehb, Amr b. el-Haris'ten, o da İbni Şihab'dan, o da Urvetü'bnü Zübeyr ile Amra Biııti Abdirrahman'dan, onlar da Nebi (s.a.v.)’in zevcesi Aişe'den naklen rivayet ettiler. Ki: Resulullah (Sallallahu aleyhi ve Sellem)'in baldızı ve Abdurrahman b. Avf'ın zevcesi olan Cahş kızı Ümmü Habibe yedi yıl süreyle istihaza kanı gördü. Resulullah (Sallallahu aleyhi ve Sellem)'den bu hususta fetva sordu. Resulullah (Sallallahu aleyhi ve Sellem): \"Bu ay hali değildir ama bu (kan akıtan) bir damardır. Bu sebeple gusledip, namaz kıl\" buyurdu. Aişe dedi ki: Kızkardeşi Cahş kızı Zeynep'in odasında bir leğen içinde yıkanıyordu. Öyle ki kanın kırmızı rengi suyun üstüne çıkıyordu. İbn Şihab dedi ki: Ben bunu Ebu Bekr b. Abdurrahman b. el-Haris b. Hişam'a tahdis ettim. O şöyle dedi: Allah Hind'e rahmet buyursun. Keşke bu fetvayı duymuş olsaydı. Allah'a yemin olsun ki o (bu hali dolayısıyla) namaz kılmadığı için ağlayıp, duruyordu. Diğer tahric: Buhari, 327 -buna yakın-; Ebu Davud, 285; Nesai, 203, 204, 205; İbn Mace, 626 -uzun olarak",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 757,
			"arabicnumber": "334.03",
			"text": "Bana Ebu İmran Muhammed b. Ca'fer b. Ziyad dahi rivayet etti. (Dediki): Bize İbrahim yani İbni Sa'd, İbni Şihab'dan, o da Amra binti Abdirrahman'dan, o da Âişe'den naklen haber verdi. Aişe şöyle demiş.: Ümmü Habibe binti Cahş Resulullah (Sallallahu aleyhi ve Sellem)'e geldi. Yedi yıl istihaza kanı görmüştü sonra da Amr b. el-Haris'in hadisi rivayet ettiği gibi \"kanın kırmızı rengi suyun üstüne çıkıyordu\" ibaresine kadar zikretti ondan sonrasını zikretmedi",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 758,
			"arabicnumber": "334.04",
			"text": "Bana Muhammed übnü'l Müsenna da rivayet etti. (Dediki): Bize Süfyan b. Uyeyııe, Zühri'den, o da Amra'dan, o da Âîşe'den naklen rivayet etti. Aişe bu rivayette de ötekilerin hadisinde olduğu gibi. Cahş kızı yedi yıl süreyle istihaza kanı görüyordu, diye hadisi onların hadislerine yakın rivayet etti",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 759,
			"arabicnumber": "334.05",
			"text": "Bize Muhammed b. Rumh rivayet etti (Dedi ki) Bize Leys, haber verdi. H. Bize Kuteybetüb'nü Saîd de rivayet etti. (Dediki): Bize Leys, Yezld b. Ebi Habib'den, o da Ca'ferden, o da. Irak'dan, o da Urve'den, o da Aişe'den naklen rivayet etti. Ki Aişe söyle demiş: Ümmü Habibe, Resulullah (Sallallahu aleyhi ve Sellem)'e kan'a dair soru sordu. Aişe: Ben onun (içinde yıkandığı) leğenini kanla dolmuş gördüm, dedi. Resulullah (Sallallahu aleyhi ve Sellem) ona: ''4y halin seni alıkoyduğu kadar bir süre bekle sonra guslet ve namaz kıl\" buyurdu. Diğer tahric: Ebu Davud, 279; Nesai, 207, 351 753 - 757",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 760,
			"arabicnumber": "334.06",
			"text": "Bana Musa b. Kureyş Et-Temimi rivayet etti. (Dediki): Bize İshak b. Bekir b. Mudar rivayet etti. (Dediki): Bana babam rivayet etti. (Dediki): Bana Ca'fer b. Rabia Irak b. Malik'den, o da Urvetü'bnü Zübeyr'den, o da Nebi (Sallallahu Aleyhi ve Sellem) in zevcesi Aişe'den naklen rivayet etti: Aişe şöyle demiş: Abdurrahman b, Avf'ın nikahı altındaki Cahş kızı Ümmü Habibe Resulullah (Sallallahu aleyhi ve Sellem)'e (istihaza halinde gelen) kan'dan şikayet etti. O'na: \"Daha önce ay halin seni alıkoyduğu kadar bir süre bekle, sonra guslet\" buyurdu. O da her namaz vakti gelince guslederdi. DAVUDOĞLU AÇIKLAMA: Bu hadisi bütün Kütübü - Sitte sahihleri tahric etmişlerdir. Hadis-i şerifte Resulullah (Sallallahu Aleyhi ve Sellem)'e sual sorduğu bildirilen Hz. Ümmü Habîbe Ümmehat-ı Mümininden Zeynep binti Cahş (R.A.)'nın kız kardeşidir. Vakidi ile Harbi isminin Habîbe, künyesinin Ümmü Habîb olduğunu söylemişler, Dare Kutni dahi bunu tercih etmiş isede sahih rivayetlerdeki meşhur künyesi Ümmü Habîbe'dir. İmam Malik'in (El-Muvatta) ında Hz. Abdurrahman b. Avf'ın zevcesi Zeyneb binti Cahş olduğu, istihaze kanını da onun gördüğü rivayet edilmiştir. Bazıları bunun vehmolduğunu, diğer bazıları da vehim değil, doğrusunun bu olduğunu iddia etmişlerdir. Onlara göre bu kadının ismi Zeyneb, künyesi Ümmü Habîbe 'dir. Ümü'l Mü'minin Zeynep (R.A.)'ya gelince Onun asıl isminin Birre olduğunu sonra Resulullah (Sallallahu Aleyhi ve Sellem) onu değiştirerek kız kardeşinin ismini verdiğini söylerler. Çünkü kız kardeşi künyesi ile meşhur olduğuna göre ona Zeyneb demekle bir iltibas vaki olmamıştır. Hz. Ümmü Habibe 'nin Hamne isminde bir kız kardeşi daha vardır. Ulemadan bazıları Ümmü Habibe ile Hamne 'nin ikisininde istihazalı olduğunu diğer bazıları Ümmül-Mü'minin Zeynep (R.A.) nın dahi istihazalı olduğunu söylerler. Resulullah (Sallallahu Aleyhi ve Sellem) zamanında on kadının istihazalı olduğu rivayet edilmiştir. Bunlar, Ümmü Habibe binti Cahş, Ümmü'l Mü'minin Zeynep binti Cahş, diğer kız kardeşi Hamne binti Cahş, Ümmü'l Mü'minin Meymune (R.A.)'nın anne bir kız kardeşi Esma, Fatime bin­ti Ebi Hubeyş, Sehle binti Süheyl, Ümmü'l Mü'minin Sevde binti Zem'a, Zeynep binti Ümmü Seleme, Esma el Harisiyye ve Badiye binti Gaylan'dır. Resulullah (Sallallahu Aleyhi ve Sellem) in Hz. Ümmü Habibe'ye verdiği yıkanma emri mutlaktır. Bunun her namaz için yahut bazan yıkanma ihtimali vardır. Ebu Davud 'un tahric ettiği bir rivayet her namaz için yıkanması lazım geldiğini bildirmektedir. Çünkü o rivayette «Resulullah (Sallallahu Aleyhi ve Sellem) Ona her namaz için yıkanmayı emretti» denilmiştir. Beyhaki bu rivayetin yanlış olduğunu söylemiştir. Müslim'in buradaki rivayetinde Resulullah (Sallallahu Aleyhi ve Sellem) in her namaz için yıkanmayı emretmediği Hz. Ümmü Habibe'nin kendiliğinden yıkandığı bildirliyor. Bu hususta rivayetler muhteliftir. Bazılarında Nebi (Sallallahu Aleyhi ve Sellem)'in Ümmül Mü'minin Zeynep Binti Cahş'a: «Her namaz için yıkan.» diye buyurduğu, diğer bazılarında : «Her namaz için abdest al.» dediği bildiriliyor. Hatta Muslîm'in Hammad b. Zeyd 'den rivayet ettiği hadiste, Hammad yalnız başına rivayet etmiştir diye kitabına almadığı cümle dahi bazılarınca budur. Mezkur cümleyi yalnız Hammad değil Ebu Avane ve başkaları dahi rivayet etmişlerdir. Bununla beraber onu yalnız Hammad rivayet etmiş olsa bile kabul edilmesi lazım gelir. Çünkü Hammad mütemed bir ravidir. Mutemed ravinin ziyadesi ise makbuldür. Bazıları bu hadisin Fatime binti Ebi Hubeyş hadisi ile nesh edildiğini söylerler. Çünkü Hz. Aişe, Nebi (Sallallahu Aleyhi ve Sellem) in vefatından sonra Fatime hadisiyle fetva vermiş, bu suretle Ümmü Habîbe hadisine muhalefette bulunmuştur. Bundan dolayı Ebu Muhammed el îşbîlî; «Fatime hadisi istihaza hakkında rivayet edilen en sahih hadistir.» demiştir. Az yukarıda İmam Şafii 'den naklen onun da; «Ümmü Habibe'nin her namaz için yıkanması Resulullah (Sallallahu Aleyhi ve Sellem) in emri ile değil kendi fiilidir.» dediğini söylemiştik. Cumhur'u Ulemanın kavli de budur. Yani istihazalı bir kadına her namaz için yıkanmak vacip değildir. Hattabi (319 - 388); «Bu haber muhtasar» dır. Onda kadının hal-u şanı beyan edilmemiştir. Her istihzalı kadına her namaz için yıkanmak vacib değildir. Yıkanmak ancak müptela kadına vaciptir. Müptela: Gelen kanın hayz'mı istihaza mı olduğunu ayıramıyan yahut gününü, vaktini ve sayısını unutan kadındır. Böylesi hiçbir namazını terk edemediği gibi her namaz için yıkanması da vacibtir, diyor. Ebu Bekr b. Abdirrahman'ın; «Allah rahmet eylesin» diyerek zikrettiği Hind'in onun zevcesimi yoksa akrabasımı olduğuna dair hiçbir yerde bir malumata tesadüf edilememiştir. İbni Hacer'in «El-İsabe» adlı eserinin sonunda bir Hind'den bahsedilmiş fakat kim olduğu beyan edilmemiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 761,
			"arabicnumber": "335.01",
			"text": "Bize Ebu'r Rabi'ez Zehram rivayet etti. (Dediki): Bize Hammad Eyyub'dan, o da Ebu Kılabe'den, o da Muaze'den naklen rivayet etti. H. Bize Hammad da Yezid er-Rişk'den, o da Muaze'den naklen rivayet etti ki bir kadın Aişe'ye bizden herhangi birisi ay hali olduğu günlerdeki namazı kaza etmeli mi, diye sordu. Aişe: Sen Haruri misin? Bizden herhangi birimiz Resulullah (Sallallahu aleyhi ve Sellem) döneminde ay hali olurdu sonra da (kılamadığı namazlarını) kaza etmesi emredilmezdi, dedi. Diğer tahric: Buhari, 321; Ebu Davud, 262, 263; Tirmizi, 130; Nesai, 380, 2317; İbn Mace, 631; Tuhfetu'l-Eşraf, 17964",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 762,
			"arabicnumber": "335.02",
			"text": "Bize Muhammedü'bnü'I - Müsenna da rivayet etti. (Dediki): Bize Muhammed b. Cafer rivayet etti: (Dediki): Bize Şu'be Yezid'den naklen rivayet eyledi. Demişki. Ben Muaze'den dinledim. Muaze, Aişe'ye: Ay hali kadın namazı kaza eder mi diye sordu. Aişe: Sen Haruri misin, dedi. Biz Resulullah (Sallallahu aleyhi ve Sellem)'in hanımları ay hali olurduk. Onun karşılığını (kılamadıkları namazlarını kaza etmelerini) emretti mi hiç, dedi. Muhammed b. Cafer dedi ki: Namazlarını kaza etmelerini kastetmektedir, dedi",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 763,
			"arabicnumber": "335.03",
			"text": "Bize Abd bin Humeyd de rivayet etti. (Dediki): Bize Abdürrezzak haber verdi. (Dediki): Bize Ma'mer, Asım'dan, o da Muaze'den naklen haber verdi demişki: Aişe'ye sorup: Ay hali kadın neden orucu kaza ettiği halde namazın kazasını yapmıyor, dedim. O: Haruri misin, dedi. Ben: Hayır Haruri değilim ama (öğrenmek maksadıyla) soruyorum, dedim. Aişe: Biz de ay hali olurduk ama bize orucu kaza etmemiz emredilir, namazı kaza etmemiz emredilmezdi, dedi. DAVUDOĞLU ŞERHİ AŞAĞIDA NEVEVİ ŞERHİ (759 - 761): (761) \"Orucu kaza etmemiz emredilir, namazı kaza etmemiz emredilmezdi.\" İşte bu ittifakla kabul edilmiş bir hükümdür. Müslümanların icma'ı ile ay hali kadına da, loğusa kadına da o halde ne namaz kılmaları, ne de oruç tutmaları farzdır. Yine icma' ile kabul ettiklerine göre bu durumdaki kadınların bu halde kılamadıkları namazlarını kılmaları icap etmez. Orucu kaza etmelerinin vacip olduğu üzerinde de icma etmişlerdir. İlim adamları der ki: ikisi arasındaki fark şudur: Namaz çokça tekrarlanan bir ibadet olduğundan orucun aksine onu kaza etmek meşakkatlidir. Oruç yılda bir defa farzdır. Bazen bir ya da iki günü adet haline rastlar. Mezhep alimlerimiz der ki: Ay hali iken geçen hiçbir namaz kaza edilmez, tavaf sonrası kılınması gereken iki rekat müstesnadır. Gerek mezhebimize mensup alimlerin, gerek diğer mezhep alimlerinin çoğunluğunun (cumhurun) kanaatine göre ay hali olan kadın adet döneminde oruç tutmak emrine muhatap değildir. Ona orucunu kaza etmesi yeni (farklı) bir emir ile vaciptir. Mezhep alimlerimizden kimisi başka bir görüşü sözkonusu ederek, adet halinde oruç tutmak emrine muhataptır ama onu ertelemesi emrolunur tıpkı namazda iken abdesti bozulan kimsenin durumu gibi. Her ne kadar abdestsiz halinde namaz kılması sahih değilse de (sonra kılmakla emrolunmuştur); fakat bu açıklamanın hiçbir değeri yoktur. Kendisinin ortadan kaldırabilme gücü bulunmadığı bir hali sebebiyle oruç tutmak, adet olan bir kadına nasıl aynı zamanda hem farz, hem haram olabilir? Onun bu durumu abdesti bozulan ın durumundan farklıdır çünkü o abdestsizlik halini ortadan kaldırabilir. (759) \"Ebu Kılabe\" adı Abdullah b. Zeyd olup, daha önce ona dair açıklama geçmişti. \"Yezid er-Rişk\" adı Yezid b. Ebi Yezid ed-Dubai'dir. Basralı olup, Ebu'l-Ezhert künyelidir, Dubaalıların mevlasıdır. ilim adamları ona \"er-Rişk\" lakabının veriliş sebebi hususunda farklı kanaatlere sahiptir. Farsça'da bunun Kasım (paylaştırıcı) anlamında olduğu söylendiği gibi çok gayretli olduğu, gür sakallı olduğu da söylenmiştir. Farsça akreb'in adıdır diye de söylenmiştir. Yezid'e er-Rişk lakabının verilmesinin sebebi ise şudur: Akrep onun sakalının içine girmiş, üç gün içinde kaldığı halde o bunun farkına varmamıştı. Buna sebep ise sakalının oldukça uzun ve büyük oluşu idi. Bu farklı görüşleri Metali' sahibi ve başkaları nakletmiş olduğu gibi, Ebu Ali el-Gassanide bunları nakletmiş ve bu son görüşü senedi ile birlikte zikretmiştir. Allah en iyi bilendir. Aişe (r.anha)'nın \"sen Haruri misin\" sorusuna gelince, Haruri \"Harura\"ya nispettir. Kufe yakınlarında bir kasaba'nın adıdır. es-Sem'ani'nin dediğine göre burası Kufe'den iki mil uzaklıkta bir yer olup, Hariciler ilk olarak burada toplanmıştı. Herevi dedi ki: Hariciler bu kasabada birbirleriyle ahitleştiklerinden ötürü oraya nispet edilmişlerdir. Buna göre Aişe (r.anha)'nın sözünün anlamı Haricilerden bir kesim ay hali olan kadına adet döneminde geçen namazlarını kaza etmesinin vacip olduğu kanaatindedirler, demektir. Bu ise Müslümanların icmaına aykırıdır. Aişe (r.anha}'nın bu şekilde soru sorması inkar (reddetmek) anlamındadır. Yani böyle bir yol Harurilerin (Haricilerin) yoludur ve bu çok kötü bir yoldur. \"Resulullah (Sallallahu aleyhi ve Sellem) döneminde birimiz ay hali olurdu da sonra ona namazını kaza etmesi emredilmezdi.\" Yani Nebi (Sallallahu aleyhi ve Sellem) ona, onun ay hali olduğunu ve bu dönem zarfında namazı kılmadığını bilmekle birlikte namazı kaza etmesini emretmezdi. Namazını kaza etmesi vacip (farz) olsaydı kesinlikle ona namazını kaza etmesini emrederdi. (760) \"Onlara karşılık vermelerini emretti mi?\" (4/27) Bu sözü Muhammed b. Cafer kitapta (hadisin sonunda) kaza etmeleri anlamında olduğunu söyleyerek açıklamıştır ve bu doğru bir açıklamadır. Nitekim karşılık vermek anlamını ihtiva eden (ceza) fiili kaza etti (ödedi) anlamındadır. Nitekim yüce Allah'ın: \"Hiçbir kimse bir başkasının yerine ceza (karşılık) görmez.\" (Bakara, 48) buyruğunu da böyle tefsir etmişlerdir. \"Bu şey şunun yerine geçer\" derken de bu kullanılır. DAVUDOĞLU AÇIKLAMA: Bu Hadis-i bütün Kütüb-ü Sitte sahipleri muhtelif ravilerden tahric etmişlerdir. Hadisin birinci rivayetinde Hz. Aişe'ye sual soran kadının ismi zikredilmemiş. Diğer rivayetlerinde soranın bizzat Muaze olduğu bildirilmiştir. Hadisin muhtelif rivayetlerinin ifade ettiği mana kadının suali ve Hz. Aişe (R.A.)'nın cevabıdır. Kadın: «hayzlılar neden orucu kaza ediyorda, namazı kaza etmiyorlar?» diye sormuş Aişe (R.A.)'da «Sen haruriyyemisin yoksa» diye söze başlayarak Sahib-i Şeriat Resulullah (Sallallahu Aleyhi ve Sellem)'efendimizin kendilerine böyle emrettiğini anlatmıştır. Harura: Kufe'ye yakın bir köydür, Hz. Aii (R.A.) aleyhine kıyam eden hariciler ilk defa burada toplanmışlardı. Bunlar Hz. Ali 'nin, Ebu Muse'l Eş'ari ile Amr b. Âs'ı hakem tayin etmesine şiddetle itiraz ediyorlardı. Hatta kendisine «Allah'ın emrinde şekk ettinde düşmanını hakem yaptın» demişlerdi. Husumetleri gitgide artarak nihayet bir sabah kumandanları Abdullah'ın idaresi altında 8.000 nefer toplanarak Hz.. Ali aleyhine kıyam ettiler. Hz. Ali kendilerine Abdullah İbni Abbas (R.A.)'i gönderdi. İbni Abbas (R.A.a) onlarla münazarada bulundu, kendilerine nasihatlar verdi. Bunun üzerine 2.000 nefer yaptıklarına pişman olarak muhalefetten vaz geçtiler. 6.000 i inatlarında ısrar ettiler Hz. Ali (R.A.) da üzerlerine ordu göndererek onlarla harb ve kendilerini perişan eyledi. Bunlar din babında pek şiddet gösterirler. Hayzlı kadının namazları kaza edeceğine kail olurlardı. Hariciler aslen altı fırka olup hepsi Hz. Ali ile Osman (R.A.) dan telerri ederler ve onlardan uzak kalmayı her ibadete tercih eylerlerdi. Nikahlarında bile bunu şart koşarlardı. Halbuki bu yaptıkları tamamıyla dalalet ve İcma'ı Ümmete muhalefet idi. İşte Aişe (R.A.)'nın (Sen haruriyemisin) diye sorması bundandır. Yani; bu sual dalalet fırkalarından haricilerin soracağı bir sualdir. Çünkü onlar hayzlı kadının namazları kaza edeceğini kaildirler. Sende bu çirkin tarikatamı mensupsun? demek istemiş sonra, Resulullah (Sallallahu Aleyhi ve Sellem) zamanında bütün ezvac-ı tahiratın hayz gördüklerini fakat Resulullah (Sallallahu Aleyhi ve Sellem) in yalnız orucu kaza etmelerini emir buyurduğunu, namazın kazasını emretmediğini, kazası lazım gelse onu da emrederdiğini anlatmıştır. Bunun üzerine kadın kendisinin Haruriye olmadığını yani haricilerle bir alakası bulunmadığını, yalnız meseleyi iyi anlamak için sorduğunu söyleyerek özür beyan etmiştir. Hayzlı kadının yalnız orucu kaza edip namazı kaza etmiyeceğine bütün müslümanların icma'ı vardır. Bu hususta nifaslılar da aynı hükümdedir. Yalnız hariciler Ehl-i Sünnetin bu icma'ına muhalefet etmişlerse de onların muhalefetinin hiçbir kıymeti yoktur. Ulema-i kiram namazla oruç arasındaki farkı şöyle izah ederler. Namazların sayısı çoktur. Çünkü onlar günde beş defa tekerrür ederler. Bu sebeple günlerce kalan namazları her hayızdan temizlendikçe kaza etmek güç olur. Oruçda ise bu güçlük yoktur. Çünkü oruç senede bir defa gelir. Hayz günleride ekseriyetle birkaç günü geçmez. Binaenaleyh orucun kazasında hiçbir güçlük yoktur. İşte orucun kaza edilip, namazın edilmemesi bu hikmete mebnidir. Selefi Salihinden bazıları namaz vakti geldikçe hayzlı kadına abdest almasını ve kıbleye karşı oturarak Allah'ı zikretmesini emrederlermiş. Bu kavil Ukbetübnü Âmir (R.A.) ile Mekhul'den rivayet olunmuştur. Ata'; «Ben böyle bir şey duymadım ama bu pek güzel bir iştir» demiştir. Ebu Ömer ise; «Bu emir fukaha indinde metruktür. Hatta onu mekruh görürler diyor.» Ebu Kılabe dahi; «Bu meseleyi soruşturduk fakat aslı olduğunu Öğrenemedik.» demiştir. Said b. Abdilaziz; «Biz bunu bilmiyoruz ve mekruh görüyoruz» mütelaasında bulunmuştur. Hanefilerin «Münyetül - Müfti» nam eserinde hayzlı kadının her namaz vakti abdest alarak evinin mescidinde bir namaz miktarı oturması, tesbih ve tehlilde bulunması müstehabdır.» denildiği gibi «Ed-Diraye» nam kitapda da; «Böyle yapan kadına kıldığı en güzel namazın sevabı yazılır» denilmektedir. Hayzlı kadın oruçla muhatap değildir; orucun kazası ona ayrı bir emirle lazım gelir. Bazıları onunda oruçla muhatap olduğunu fakat hayz halinde onu terketmesi emredildiğini söylerler. Bunlar «Abdestsiz bir kimsede namazla muhatabdır. Ama Abdestsiz olarak namazını kılamaz» derlersede bu doğru değildir. Çünkü kadına hayz halinde iken oruç tutmak haramdır. Bir kimsenin haramı işlemekle muhatap olması caiz değildir. Bu Mes'ele Abdestle kıyas edilemez, zira Abdestsiz bir kimsenin abdest alarak namazı kılması mümkündür. Lakin hayzlı bir kimsenin Abdest dahi alsa namaz kılması, caiz değildir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 764,
			"arabicnumber": "336.01",
			"text": "Bize Yahya b. Yahya rivayet etti dediki: Malike Ebu'n Nadr'dan duyduğum ona da.Ümmü Hanî binti Ebi Talib'in azadlısı Ebu Mürre'nin haber verdiği şu hadisi okudum. Ebu Mürre Ümmü Hani binti Ebi Talib'i şunları söylerken işitmiş. Mekke'nin fethedildiği sene Resulullah (Sallallahu aleyhi ve Sellem}'in yanına gitmiştim. Onun yıkanmakta olduğunu, kızı Fatıma'nın da bir elbise ile onu örttüğünü gördüm. Diğer tahric: Buhari, 280, 357 -uzunca-, 3171 -uzunca-, 6158 -uzunca-; Müslim, 6166; Tirmizi, 2734, 1579; Nesai, 225; İbn Mace, 465; Tuhfetu'l-Eşraf, 18018",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 765,
			"arabicnumber": "336.02",
			"text": "Bize Muhammed b. Rumh b. el Muhacir rivayet etti. (Dediki): Bize Leys Yezîd b. Ebî Habîb'den, o da Said b. Ebi Hind'den naklen haber verdi. Said'e de Akîl'in azadlısı Ebu Mürre rivayet etmiş, Ebu Talib'in kızı Ümmü Hani kendisine tahdis ettiğine göre Mekke'nin fethedildiği sene Resulullah (Sallallahu aleyhi ve Sellem) Mekke'nin üst taraflarında bulunuyorken yanına gitti. Resulullah (Sallallahu aleyhi ve Sellem) yıkanmak üzere kalktı. Fatıma onun önünü örtü ile kapattı sonra elbisesini alıp ona sarındı sonra sekiz rekM kuşluk namazını kıldı",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 766,
			"arabicnumber": "336.03",
			"text": "Bize bu hadisi Ebu Kureyb de rivayet etti. (Dediki): Bize Ebu Üsame, Velid b. Kesîr'den, o da Said b. Ebi Hind'den bu isnadla rivayet etti. Said: Allah Resulü (Sallallahu aleyhi ve Sellem) yıkandıktan sonra elbisesini alıp ona büründü sonra kalkıp beş rekat namaz kıldı. Bu kuşluk vaktinde idi. Diğer tahric: Buhari, 280, 357 -uzunca-, 3171 -uzunca-, 6158 -uzunca-; Müslim, 6166; Tirmizi, 2734, 1579; Nesai, 225; İbn Mace, 465; Tuhfetu'l-Eşraf, 18018 DAVUDOĞLU AÇIKLAMA: Tirmîzî İmam Ahmed'in. Bu babta varid olan en sahih şey Ümmu Han'i hadisidir.» dediğini nakleder, ki doğrudur. Hadisde de beyan olunduğu vecihle Ümmü Hani Resulullah (Sallallahu Aleyhi ve Sellem)'in Amcası Ebu Talib'in kızı ve Hz. Ali 'nin kız kardeşidir. İsmi ihtilaflıdır. Bazılarına göre Fahite diğer bazılarına göre Fatime 'dir. Hind olduğunu söyleyenlerde vardır. Hani ismindeki oğlunun adı ile künyelenmiştir. Ümmü Hanî (r.a.) Mekke'nin fethedildiği gün müsiüman olmuştur. Mekke hicretin 8 nci yılında fethedilmişti. Bu sayfanın başındaki 70 nolu Hadis’in tamamı ve başka tarikler için bu sayfanın devamı niteliğindeki sayfayı da görmenizi önemle tavsiye ederim. İstiyorsanız Buraya tıklayabilirsiniz",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 767,
			"arabicnumber": "337",
			"text": "Bize İshak b. İbrahim El-Hanzali rivayet etti. (Dediki): Bize Muse'I Kaari haber verdi. (Dediki), bize Zaide A'meş'den, o da Salim b. Ebil Ca'd'dan o da Kureyb'den, o da İbn Abbas'tan, o Meymune'den Nebi (Sallallahu aleyhi ve Sellem}'e su (hazırlayıp) koydum sonra onu örttüm O da yıkandı, dedi. Diğer tahric: Buhari, 260, 249, 257 -buna yakın muhtasar olarak-, 259 -buna yakın-, 265 -buna yakın muhtasar olarak-, 266 -buna yakın-, 274 -buna yakın-, 276, 281 -muhtasar olarak buna yakın-; Müs!im, 765 -muhtasar olarak-; Ebu Davud, 245 -uzunca-; Tırmizi, 103 -buna yakın muhtasar olarak-; Nesai, 253, 416 -buna yakın muhtasar olarak-, 417, 406 -muhtasar olarak-; İbn Mace, 467 -muhtasar olarak- (762 - 765) NEVEVİ ŞERHİ: (762) \"Ebu'n-Nadr'dan rivayete göre Ümmü Hani'nin azatlısı Ebu Murre\" denilmekte iken diğer rivayette (763) \"Akil'in azatlısı Ebu Murre\" denilmektedir. Ebu'n-Nadr'ın adı Salim b. Ebu Umeyye el-Kuraşi et-Teymi el-Medeni' dir. Ömer b. Abdullah et-Teymi'nin azatlısıdır. Ebu Murre'nin adı ise Yezid olup, Ümmü Hani'nin azatlısıdır. Ümmü Hani'nin kardeşi Akil ile birlikte bulunurdu. Bundan dolayı diğer rivayette onun mevlası (azatlısı) olduğunu ifade etmiştir. Ümmü Hani'nin adı ise Fahite'dir. Fatıma olduğu, Hind olduğu da söylenmiştir. Oğlu Hani b. Hubeyre b. Amr'ın adı ile künyelenmiştir. \"Hani\"nin sonunda hemze vardır. Ümmü Hani (r.a.) Mekke fethedildiği günü Müslüman olmuştur. \"Mekke'nin fethedildiği sene Resulullah (Sallallahu aleyhi ve Sellem)'in yanına gittim ... \" Bu buyrukta bir erkeğin kendisi ile arasında bir elbise, örtü ve buna benzer bir engel bulunması şartıyla mahremi olan bir kadının huzurunda yıkanmasının caiz olduğuna delil vardır. (763) \"Sonra sekiz rekat kuşluk namazı kıldı.\" Bu lafız oldukça incelikli bir hususu ihtiva etmektedir. O da kuşluk namazının sekiz rekat olduğudur. \"Kuşluk namazı\" demiş olması da buna delildir. Ayrıca bu ifade bunun bilinen ve karar kılmış bir sünnet olduğunu da Allah Resulünün bu namazı kuşluk namazı niyetiyle kıldığını da açıkça ifade etmektedir. Halbuki diğer rivayet (764) böyle değildir. Orada \"sekiz rekat namaz kıldı, o zaman kuşluk vakti idi\" demiştir. Buradan da birtakım kimseler doğru olmayan bir sonuca ulaşmakta ve: Bunda kuşluk namazının sekiz rekat olduğuna delil yoktur, diyerek Nebi (s.a.v.)'in bu vakitte kuşluk vakti olduğu için değil, Mekke'nin fethedilmesi sebebiyle sekiz rekat namaz kıldığını ileri sürmektedirler. Bu lafza dayanarak bu kanaati ileri süren bir kimse Ümmü Hani'nin: \"Kuşluk namazı\" ifadesinden hareketle bu sonucu çıkartamaz. İnsanlar da önceleri de, sonraları da bu hadisi kuşluk namazının sekiz rekat olduğuna delil gösterip durmuşlardır. Allah en iyi bilendir. (Hadisteki lafzıyla) \"subha\" nafile namaz demektir. Bu namazdaki tesbih (subhanallah) demek sebebiyle ona bu isim verilmiştir. (764) \"Sekiz rekat (secde) kıldı\" sözünden maksat sekiz rekat kıldığıdır. Rekata secde adının verilmesi secdeyi de kapsaması dolayısıyladır. Bu bir şeye onun bir kısmını teşkil eden şeyin adının verilmesi (tesniyetu'ş-şey'i bi cüz'ih) türündendir. DAVUDOĞLU AÇIKLAMA: Bu hadis de yukarıdakiler gibi yıkanırken başkalarının göremiyeceği şekilde kapalı bir yerde bulunmanın vücubuna delalet eder. Bir kimsenin zaruret olmadıkça başkasına avret yerlerini göstermesi caiz olmadığı gibi yine zaruret olmadıkça başkasının avret yerine bakması da caiz değildir. İbni Battal'ın da naklettiği vecihle peştemalsız hamama giren kimsenin şehadeti kabul edilmiyeceğine Fetva imamlarının ittifakı vardır. İmam A'zam (80-150), Malik (93-179), Şafii (150-204) ve Süfyanı Sevri 'nin kavilleri budur. Hatta hamamda yıkanacağı havuza girerken peştemalını atarak avreti görünen kimsenin şehadeti dahi İmam Malikle Şafii'ye göre sakıttır. İmam A'zam'la Sevri bu kadarını özür saymışlardır. Çünkü bundan korunmak imkansızdır. Ulema karı kocanın birbirlerinin avretlerini görebileceklerine ittifak etmişlerdir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 768,
			"arabicnumber": "338.01",
			"text": "Bize Ebu Bekr b. Ebi Şeybe rivayet etti. (Dediki): Bize zeyd b. Hubab, Dahhak b. Osman'dan naklen rivayet etti Demiş ki, Bana Zeyd b. Eslem, Abdurrahman b. Ebu Said el-Hudri'nin babasından rivayet ettiğine göre Resulullah (s.a.v.) şöyle buyurdu: \"Erkek erkeğin avretine, kadın kadın'ın avretine bakamaz. Erkek bir diğer erkek ile aynı elbiseye bürünemez, kadın da bir başka kadın ile aynı elbiseye bürünemez. \" Diğer tahric: Ebu Davud, 4018; Tirmizi, 2793; İbn Mace, 661; Tuhfetu'l-Eşraf, 4115",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 769,
			"arabicnumber": "338.02",
			"text": "Bana bu hadisi Harun b. Abdillah ile Muhamıned b. Rafi'de rivayet ettiler dediler ki bize ibni Ebî Fudeyk rivayet etti. (Dediki): Bize ed-Dahhak b. Osman bu isnad ile haber verdi. Yine ikisi \"avret\" lafzı yerine erkeğin uryeti ve kadının uryeti tabirlerini kullanmışlardır. (766 - 767) NEVEVİ ŞERHİ: \"Erkek erkeğin avretine bakamaz ... \"Diğer rivayette de \"erkeğin uryesi ve kadının uryesi\" denilmektedir ki bu son lafzı \"irye, urye\" ve \"ureyye\" olmak üzere üç şekilde zaptetmiş bulunuyoruz. Hepsi de doğrudur. Dilciler der ki: Urye lafzı çıplak ve elbisesiz olmak demektir. Ureyye ise onun küçültme ismidir. Bu babta ravi olarak ismi geçen Zeyd b. Hubab'ın babasının adı olan Hubab isminin ha harfi ötreli okunur. Bu Babın İhtiva Ettiği Hükümlere Gelince: 1- Erkeğin yabancı bir erkeğin avretine bakması, kadının da başka bir kadının avretine bakması haramdır. Bunda görüş aynlığı yoktur. Aynı şekilde erkeğin kadının avretine, kadının da erkeğin avretine bakması icma ile haramdır. Resulullah (Sallallahu aleyhi ve Sellem)'de erkeğin bir diğer erkeğin avretine bakmasını sözkonusu ederek erkeğin kadının avretine bakmasının hükmüne de dikkat çekmiş olmaktadır. Bunun haram olması ise öncelikle sözkonusudur. Bu haram oluş eşler ve cariye sahipleri dışındakiler içindir. Eşlerin ise birbirlerinin avretlerinin tamamına bakmaları mübahtır. Bundan yalnızca fercin kendisi müstesnadır. Onunla ilgili olarak mezhep alimlerimizin üç görüşü vardır. Bunların daha sahih olanı her bir eşin diğerinin fercine ihtiyaç olmaksızın bakmasının mekruh olduğudur ama haram değildir. İkinci görüş her ikisi için de haramdır, üçüncü görüşe göre erkek için haram, kadın için mekruhtur. Kadının fercinin içine bakmak ise daha ağır mekruh ve haramdır. Efendinin cariyesi ile ilgili durumuna gelince, eğer onunla ilişki kurmak hak ve mülkiyetine sahipse o takdirde her ikisinin durumu iki eş gibidir. Şayet kız kardeşi, halası ve teyzesi olması yahut sütkardeşi yahut zevcesinin annesi, kızı, oğlunun zevcesi gibi sıhri bir akrabalık sebebiyle ona haram ise hükmü tıpkı hür olması gibidir. Eğer cariye Mecusi, mürted, putperest, iddet bekleyen ya da kitabet akdi yapmış birisi ise yabancı bir cariye gibidir. 2- Erkeğin mahremlerine, onların da ona bakmasına gelince, sahih olan görüş göbeğin yukarısı ile diz kapağının altının mübah olduğudur. Ancak iş görürken ve bazı işlerde çalışırken avretin görünen kısmının helalolacağı da söylenmiştir. Allah en iyi bilendir. 3- Akraba olmayan yabancıların avretinin sınırına gelince, erkeğin erkeğe avreti göbek ile diz kapağı arasıdır. Kadının kadına avreti de bu şekildedir. Göbek ile diz kapağı hakkında da mezhebimizin (Şafii mezhep alimlerinin) üç görüşü vardır. Bunların en sahih olanına göre avret olmadıklarıdır. İkinci görüşe göre her ikisi de avrettir, üçüncü görüşe göre ise göbek avrettir, diz kapağı değildir. 4- Erkeğin kadına bakmasına gelince, bedeninin tamamına bakması haramdır. Aynı şekilde kadının da erkeğin bedeninin tamamına bakması haramdır. Bakışlarının şehvetle ya da şehvetsiz olması arasında fark yoktur. Bazı alimlerimiz şöyle demektedir: Kadının şehvetsiz olarak erkeğin yüzüne bakması haram değildir fakat bu görüşün hiçbir değeri yoktur. Aynı şekilde yabancı olmaları halinde cariye ya da hür kadın arasında da bir fark yoktur. Erkeğin, sureti güzel bir tüysüzün yüzüne bakması haramdır. Bakışının şehvetle olup olmaması ile fitneden emin olması ile korkması arasında da bir fark yoktur. Muhakkik ilim adamları nezdinde tercih edilen doğru görüş budur. İleri gelen Şafii fukahası da bunu açıkça ifade etmişlerdir. Yüce Allah'ın rahmeti onlara olsun. Delili ise, böyle birisinin kadın durumunda olmasından dolayıdır. Güzelliği kadının güzelliğini andırması sebebiyle kadına şehvetle bakıldığı gibi, ona da şehvetle bakılır. Hatta onların birçoğunun yüzü pek çok kadından da güzelolabilir. Daha da ileri olmak üzere bunların hakkındaki haramlık bir başka sebep dolayısıyla öncelikle sözkonusudur. Çünkü onlarla birtakım kötülükler yapma imkanı, kadına göre daha ileri derecede sözkonusu olabilmektedir. Allah en iyi bilendir. 5- Bütün bu meselelerde bakmanın haram oluşu ile ilgili söylediğimiz bu hükümler, bakmayı gerektiren bir ihtiyacın bulunmaması halinde sözkonusudur. Eğer şer'i bakımdan bir ihtiyaç bulunursa -alışveriş, tedavi, şahitlik ve buna benzer durumlarda olduğu gibi- bakmak caiz olur fakat bu halde de şehvetle bakmak haramdır çünkü ihtiyaç dolayısıyla bakmak mübahtır, şehvetle bakmak ise bir ihtiyaç değildir. Mezhep alimlerimiz der ki: Şehvetle bakmak koca ve efendi dışında herkese haramdır. Hatta bir kimsenin şehvetle annesine ve kızına bakması dahi haramdır. Allah en iyi bilendir. \"Erkek başka bir erkekle aynı elbise içinde bulunmaz.\" Kadının kadın ile birlikte tek elbiseye bürünmesinin hükmü de böyledir. Eğer aralarında herhangi bir hail (denilen bir örtü, bir engel) yoksa buradaki yasak haramlık bildirmektedir. Buyruk, bir kimsenin bedeninin herhangi bir yerinin başkasının avretine dokunmasının haram olduğuna delildir. Bu hususta ittifak vardır. Bu ise belva'nın genel bir şekilde yaygınlık gösterdiği ve pek çok kimsenin önemsemediği hususlardandır. İnsanların hamamlarda bir araya gelmesi gibi. Hamama giden bir kimsenin gözünü, elini ve vücudunun başka yerlerini başkalarının avretinden koruması ve kendi avretini de hamamda hizmet görenlerin (tellak) ve benzerlerinin de gözünden ve elinden korumalıdır. Bunlardan herhangi birisini ihlal eden bir kimseyi görecek olursa ona bu münkerden vazgeçmesi gerektiğini de söylemelidir. İlim adamları der ki: Söyleyeceği kabul edilmez düşüncesi ile onlara doğruyu emretmek yükümlülüğü üzerinden kalkmaz. Aksine kendisine ve başkasına bir fitne geleceğinden korkması hali dışında onlara doğru olanı söylemesi gerekir. Allah en iyi bilendir. 6- Bir erkeğin, kimsenin kendisini görmeyeceği bir halde yalnızken avretini açmasına gelince; eğer bu bir ihtiyaç sebebi ile olursa caizdir, ihtiyaç olmadan bunu yaparsa mekruh ve haram olduğu hususunda ilim adamlarının görüş ayrıiığı vardır. Bize göre daha sahih olan haram olduğudur. Bu meselelerin fıkıh kitaplarında bilinen çeşitli ayrıntıları tamamlayıcı bilgileri ve kayıtları vardır. Bu kitabımızın buna dair temel bilgilerinin yer almadığı bir kitap olmaması için bu hususlara burada işaret ettik",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 770,
			"arabicnumber": "339",
			"text": "Bize Muhammed b. Rafi rivayet etti. (Dediki): Bize Abdürrezzak rivayet etti. (Dediki): Bize Ma'mer, Hammam b. Münebbih'den rivayet etti. Hemmam bize Ebu Hureyre'nin Resulullah Muhammed (Sallallahu Aleyhi ve Sellem) den rivayeti şudur, diyerek çeşitli hadisler zikretti. Onlardan birisi de şudur: Resulullah (Sallallahu aleyhi ve Sellem) buyurdu ki: \"İsrailoğulları çıplak olarak yıkanırlar, biri diğerinin avretine bakardı. Musa (aleyhisselam) ise tek başına yıkanırdı. Bu sebeple (kendi aralarında): Allah'a yemin olsun ki Musa'yı bizimle birlikte yıkanmaktan alıkoyan husus onun hayalarının büyük olmasından (kasık fıtığı) başka bir sebebi yoktur, dediler. Bir defa Musa yıkanmaya gitmiş, elbiselerini bir taşın üzerine koymuştu. Taş elbisesi ile kaçıp gitti. Bunun üzerine Musa arkasından hızlıca koşarak: Ey taş elbisem, ey taş elbisem, demeye koyuldu. Sonunda İsrailoğulları Musa'nın avretini görünce, Allah'a yemin olsun ki Musa'nın herhangi bir hastalığı yoktur, dediler. Taş durdu ve o İsrailoğulları tarafından görüldü, sonra Musa elbisesini alıp taşa vurmaya başladı. \" Ebu Hureyre: Allah'a yemin olsun ki Musa'nın taşa vurması sebebiyle taşta altı ya da yedi tane iz kaldı, dedi. Diğer tahric: Buhari, 278; Müslim, 6098; Tuhfetu'l-Eşraf, 14708 DAVUDOĞLU AÇIKLAMASI AŞAĞIDA NEVEVİ ŞERHİ: Bu babta Musa (aleyhisselam)'ın kıssası yer almaktadır. Bundan önceki babta da kimsenin olmadığı bir yerde ihtiyaç halinde avretin açılmasının caiz olduğunu ifade etmiştik. Bu da yıkanmak, küçük abdest bozmak, zevcesi ile birlikte olmak ve buna benzer hallerdir. Bütün bu hallerde kimse yokken açılmak caizdir. İnsanların huzurunda ise bütün bu hallerde avreti açmak haramdır. İlim adamları der ki: Yalnızken yıkanmak esnasında peştamal ve benzeri bir şeyle örtünmek, üstünü açık bırakmaktan daha faziletlidir ama yıkanmak ve benzeri hallerde gereken süre kadar açık durmak caizdir. İhtiyaçtan fazla açık kalmak daha sahih kabul edilen görüşe göre haramdır. Nitekim bundan önceki babta belirttiğimiz üzere daha sahih olan görüşe göre yalnızken avretin örtülmesi vaciptir. İhtiyaç kadarını açmak müstesna. Allah en iyi bilendir. Bu hadisin hükme delaleti ise, Musa (aleyhisselam)'ın yalnız başına iken çıplak yıkanmış olduğudur. Bu da fıkıh usulü alimleri arasında bizden öncekilerin şeriatı bizim için de şeraittir diyenlerin görüşlerine uygun olarak delil olabilir. Allah en iyi bilendir. Nebi (Sallallahu aleyhi ve Sellem)'in: \"İsrailoğulları çıplak yıkanırlardı. Birbirlerinin avretlerine bakarlardı\" ibaresinin bunun onların şeriatlarında caiz olmakla birlikte Musa (aleyhisselam)'ın böyle bir halden kaçınmak maksadıyla ve bundan uzak durmak müstehap olduğu için,ayrıca haya ve edebinden bunu yapmaması ihtimali de vardır (4/32). Bizim şeriatımızda haram olduğu gibi, onların şeriatında da bu şeklin haram olma, bununla birlikte -bizim şeriatımıza iman edenlerin pek çoğunun bu hususta işi gevşek tuttukları gibi- onların da bu hususta gevşek davrandıkları ihtimali de vardır. (Kötülük anlamına gelen \"es-su\"'den türeyen) es-sev'e kelimesi avret demektir. Ona bu adın veriliş sebebi açılmasının kişiyi üzmesinden, hoşuna gitmemesinden dolayıdır. Allah en iyi bilendir. Hadiste geçen \"ader\" lafzını dilbilginleri hayaları iri, şişkin (fıtık) olarak açıklamışlardır. \"Musa (aleyhisselam) taş'ın arkasından hızlıca koştu.\" Cemaha: Oldukça hızlı koşmak demektir. \"Taşa vurmaya koyuldu.\" Yani Musa arka arkaya taşa vurup durdu. Musa'nın (aleyhisselam) taşa vurmak suretiyle taşta iz bırakarak kavmine bir mucize göstermek istemiş olması da mümkündür, mucize göstermesi için taşa vurmasının ona vahiy ile emredilmiş olma ihtimali de vardır. Allah en iyi bilendir. Ebu Hureyre'nin ifadesindeki \"taşta nedeb vardır\" sözü taşta iz vardır, iz kalmıştır demektir. Allah en iyi bilendir. DAVUDOĞLU AÇIKLAMA: Kaadi İyad'ın beyanına göre Beni İsrail'in çıplak yıkanarak birbirlerinin avret yerlerine bakmaları Hz. Musa'ya ve onun şer'iatına muhalefet içindir. Bu hadisin bizim için delil teşkil etmesi şer'atımızdan önce geçen seri'atların bizim içinde şeri'at olması esasına istinad eder. Mesele ihtilaflıdır. Esah olan kavle göre bizden önce geçen şeriatlar Allah veya Resulü tarafından red ve inkar edilmemek şartıyla bize hikaye edilirse bizim için de seri'attırlar. Beni İsrail: İsrail oğulları demektir. İsrail, Yakup (A.S.)'ın ismidir. Yakup (A.S.) İshak'ın, İshak'da Halilullah ibrahim (A.S.)'ın oğludur. Beni İsrail Yakup (A.S.)'ın oniki oğlundan türemiş ve üremişlerdir. A'der: Fıtıklı ve poluç demektir. Musa (A.S.)'ın taş’a hitab ederek, (Elbisemi ver ey taş) demesi taş elbisesini kaçırdığı için ona akıllılar muamelesi yaptığındandır. Taş elbisesini vermeyince onu dövmesi de bundandır. Ulemadan bazıları «Hz. Musa'nm taşı dövmesi, onda iz bırakarak mucize göstermek içindir. Bunun vahiy suretiyle yapılmış olması da muhtemeldir. Taşın beni İsrail'e doğru yuvarlanarak elbiseyi götürmesi Musa (A.S.)'ın ikinci bir mucizesidir.» diyorlar. Ebu Hureyre r.a.’ın taşta altı veya yedi darbe izi bulunduğunu yeminle ifade ettiğini söyleyen zat bazılarına göre Ravi Hemmam'dır. Fakat Kirmani bu söz doğrudan doğruya Ebu Hureyre'nin olduğuna kaildir Hemmam'ın sözü olarak kabul edildiğine göre bu söz müsneddir. Ebu Hureyre'nin sözü olduğuna göre ise mürseldir. Fakat her iki takdire gorede Hadis Merfu hükmündedir. Çünkü Ebu Hureyre (R.A.) Hazretlerinin böyle bir sözü kendiliğinden söylemesine imkan yoktur. Onu mutlaka ResulülIah (Sallallahu Aleyhi ve Sellem)’den duymuştur",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 771,
			"arabicnumber": "340.01",
			"text": "Bize İshak b. İbrahim el-Hanzali ve Muhammed b. Hatim b. Meymun da tahdis etti. İkisi birlikte Muhammed b. Bekr'den şöyle dediğini nakletti: Bize İbn Cureyc haber verdi (H). Bana İshak b. Mansur ile Muhammed b. Rafi' de tahdis etti. -Lafız bu son ikisinindir.- İshak Bize Abdurrezzak haber verdi derken, İbn Rafi': Bize tahdis etti demiştir. Bize İbn Cureyc haber verdi, bana Amr b. Dinar'ın haber verdiğine göre o Cabir b. Abdullah'ı şöyle derken dinledi: Kabe bina edildiğinde Nebi (Sallallahu aleyhi ve Sellem) ile Abbas taş taşımaya gittiler. Abbas, Nebi (Sallallahu aleyhi ve Sellem)'e: Taşın (iz bırakmaması) için elbiseni omuzuna koy, dedi. Allah Resulü bunu yapınca yere yığılıp, kaldı ve gözleri de semaya doğru bakakaldı. Sonra ayağa kalkınca: \"Elbisemi, elbisemi (verin)\" dedi ve elbisesini üzerine bağladı. İbn Rafi' rivayetinde: Elbiseni boynuna koy demiş, omuzuna koy, dememiştir. Diğer tahric: Buhari, 1582, 3829; Tuhfetu'l-Eşraf, 2555",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 772,
			"arabicnumber": "340.02",
			"text": "Bize Züheyr b. Harb'da rivayet etti. (Dediki): Bize Ravh. Ubade rivayet etti. (Dediki): Bize Zekeriyya b. İshak rivayet etti. (Dediki): Bize Amr b. Dînar rivayet etti. Dedi ki; Cabir b. Abdullah'ı şöyle tahdis ederken dinledim: Resulullah (Sallallahu aleyhi ve Sellem) üzerinde izarı bulunduğu halde onlarla birlikte Ka'be için taş taşıyordu. Amcası Abbas ona: Kardeşimin oğlu izarını çözüp de onu omuzuna, taşların altına koysan (iyi olur), dedi. Bunun üzerine Allah Resulü de izarını çözüp, onu omuzuna koyunca bayılıp yere düştü. O günden sonra bir daha çıplak görülmedL Diğer tahric: Buhari, 364; Tuhfetu'l-Eşraf, 2519 Ahmed Davudoğlu AÇIKLAMASI: Bu hadis-i Buharı «Kitabü's - Salat» ile «Bünyanü'l Kabe» de tahric etmiştir. İbni Battal ile İbni Tîn'in beyanlarına göre Kureyş Kabe'yi bina ederken Resulullah (Sallallahu Aleyhi ve Sellem) in yaşı onbeş idi. Hişam; «Kabe'nin bina edilmesi ile Resulullah (Sallallahu Aleyhi ve Sellem) in Nebi olarak gönderilmesi arasında beş senelik bir müddet vardır, demiştir. Bir rivayete göre Kabe Resullah (Sallallahu Aleyhi ve Sellem) doğumundan 36 sene sonra bina edilmiştir. Beyhaki; «Kabe'nin bina edilmesi, Peygamber (Sallallahu Aleyhi ve Sellem) in Hatice (R.A.) ile evlenmesinden öncedir» diyor. Meşhur kavle göre Kureyş Kabe'yi Hz. Hatice 'nin evlenmesinden 10 sene sonra bina etmiştir. Şu halde Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) in o zaman yaşı: 35 olur. Nitekim Muhammed b. İshak'ın kavli de budur. İbni İshak'ın beyanına göre Resulullah (Sallallahu Aleyhi ve Sellem) küçüklüğünde görüp geçirdiği ve Allah'ın kendisini muhafaza buyurduğu bazı şeyleri hikaye ederken şöyle demiştir. «Kendimin Kureyş çocuklarının arasında bulunduğumu hatırlarım.. Birbirimize oynamak için taş taşırdık, hepimiz soyunmuş, esvabını boynuna asmış, üzerlerinde taş taşıyorduk, ben de onlarla beraber aynı halde gidip geliyordum. Birden bana birisi bir tokat vurdu, kim olduğunu göremedim. Yalnız canımı yakan bir tokat olduğunu hatırlıyorum. Sonra bana (elbiseni kuşan) dedi, ben de elbisemi alarak kuşandım ve taşları elbisemi kuşanmış olarak arkadaşlarımın arasında ensemde taşımaya başladım.» Süheyli: « İbni İshak'in bu hadisi sahih ise vak'anın iki defa cereyan ettiğine hamledilir. Biri küçüklüğünde biride Kabe yapılırken vuk'u bulmuştur.» diyor. Buhari ile Müslîm'in tahric etmedikleri bir rivayette Resulullah (Sallallahu Aleyhi ve Sellem)'e bir melek inerek esvabını bağladığı bildiriliyor",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 773,
			"arabicnumber": "341",
			"text": "Bize Saîd b. Yahya el-Emevî rivayet etti. (Dediki): Bana babam rivayet etti. (Dediki): Bize Osman b. Hakun b. Abbad b. Huneyf el-Ensarî rivayet etti. (Dediki): Bana Ebu Ümamete'bnü Sehl b. Huneyf, Misver b. Mahreme'den naklen haber verdi. Misver şöyle demiş: Taşımakta olduğum ağır bir taşı getirdim. Üzerimde hafif bir esvab vardı. Taş üzerinde iken esvabım çözülüverdi. Taşı bırakamadım ve (o vaziyette) yerine kadar götürdüm. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) : «Don de elbiseni al. Çıplak gezmeyin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 774,
			"arabicnumber": "342",
			"text": "Bize Şeyban b. Ferruh ile Abdullah b. Muhammed b. Esma ed-Dubaî rivayet ettiler. Dedilerki: Bize Mehdî -ki İbni Meymun'dur- rivayet etti, (Dediki): Bize Muhammed b. Abdillah b. Ebi Yakup Hasan b. Alî'nin azadlısı, Hasan b. Sa'd'dan, o da Abdullah b. Ca'fer'den naklen rivayet etti. Demiş ki: Birgün Resulullah (Sallallahu Aleyhi ve Sellem) beni terkisine aldı. Bana sır olarak öyle bir söz soylediki ben onu insanlardan hiç bir kimseye söylemem. Resulullah (Sallallahu Aleyhi ve Sellem)'in def-i hacet için, kendisi ile siperlenmeyi en sevdiği şey ya bir tepecik yahut hurmalık idi. İbni Esma kendi rivayetinde «Yani bir hurma bahçesi» dedi",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 775,
			"arabicnumber": "343.01",
			"text": "Bize Yahya b. Yahya ile Yahya b. Eyyub, Kuteybe ve İbni Hucur rivayet ettiler. Yahyr. b. Yahya «Ahberana» diğerleri ise «Haddesana» tabirlerini kullandılar. (Dedilerki): Bize İsmail -ki İbni Ca'fer'dir- Şerik'ten yani ibni Ebi Nemr'den, o da Abdurrahman b. Ebi Saîd el-Hudrî'den, o da babasından naklen rivayet etti demiş ki: Pazartesi günü Resulullah (Sallallahu Aleyhi ve Sellenı) ile birlikte kuba'ya (gitmek üzere yola) çıktım Benî Salim (in bulunduğu yer)'e vardığımız zaman Resulullah (Sallallahu Aleyhi-ve Sellem) Itban'ın kapısı önünde durarak ona seslendi, İtban esvabını sürükleyerek çıktı. Resulullah (Sallallahu Aleyhi ve Sellem) : «Adama acele ettirdik.» buyurdu, İtban : «Ya Resulallah ne buyurursun, bir adam karısı ile cima halinde iken acele ettirilirde meni indirmezse ona ne lazım gelir? dedi. Resulullah (Sallallahu Aleyhi ve Sellem): «Su ancak su'dan dolayı icab eder.» buyurdular",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 776,
			"arabicnumber": "343.02",
			"text": "Bize Harun b. Said el-Eyli rivayet etti (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Amr b. Haris, İbni Şihab'dan naklen haber verdi. Ona da Ebu Selemete'bnü Abdirrahman, Ebu Saîd-i Hudrî'den o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etmişki,. Nebi (Sallallahu Aleyhi ve Sellem) : «Su ancak su'dan dolayı icab eder.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 777,
			"arabicnumber": "344",
			"text": "Bize Ubeydullah b. Muaz el-Anberi rivayet etti. (Dediki): Bize el- Mu'temir rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Ebu'l-A'la İbnü'ş-Şihhir rivayet etti Dedi ki: Kur'an'ın bazı ayetleri birbirini nasıl neshederse Resulullah (Sallallahu Aleyhi ve Sellem)'in bazı hadisleride birbirini neshederdi",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 778,
			"arabicnumber": "345",
			"text": "Bize Ebu Bekr b. Ebi Şeybe rivayet etti. (Dediki): Bize Gunder Şu'be'den rivayet etti. H. Bize Muhammedü'bnü'l-Müsenna ile İbni Beşşar da rivayet ettiler. Dediler ki. Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be Hakem'den, o da Zekvan'dan, o da Ebu Saîd'i Hudri'den naklen rivayet etti ki: Resulullah (Sallallahu Aleyhi ve Sellem)'ensar'dan bîr zatın yanına uğramış ta kendisini çağırtmış. O zat başından su damlayarak çıkmış bunun üzerine Nebi «Galiba sana acele ettirdik.» buyurmuş. O zat: «Evet Ya Resulullah» mukabelesinde bulunmuş, Resulullah (Sallallahu Aleyhi ve Sellem): «Şayet acele ettirilir veya meninin tıkanmasına maruz kalırsan, sana gusül lazım değil, yalnız abdest icab eder.» buyurmuşlar. İbni Beşşar : «Acele ettirilir veya meninin tıkanmasına maruz bırakilırsan.» demiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 779,
			"arabicnumber": "346.01",
			"text": "Bize Ebu'r-Rabî'ez-Zebram rivayet etti. (Dediki): Bize Hammad rivayet etti. (Dediki): Bize Hişam b. Urve rivayet etti. H. Bize Ebu Kureyb Muhammed b. A'la dahî rivayet etti. Lafız onundur. (Dediki): Bize Ebu Muaviye rivayet etti. (Dediki): Bize Hişam babasından, o da Ebu Eyyub'dan, o da Ubey b. Ka'b'dan naklen rivayet etti. Ubey şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem)'e kadınla cima' ederken menisini getirmeyen erkeğin hükmünü sordum. «Kadına temas eden nesneyi yıkar, sonra abdest alarak namaz kılar.» buyurdular",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 780,
			"arabicnumber": "346.02",
			"text": "Bize Muhammed b. El-Müsenna da rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Hişam b. Urve'den naklen rivayet etti. (Demişki): Bana babam mutemed bir zattan, -ki bununla Ebu Eyyub'u kastediyor- O da Ubey b. Ka'b'dan, o da Resulullah (Sallallahu Aleyhi ve Sellem) den naklen rivayet etti. Resulullah (Sallallahu Aleyhi ve Sellem), Ehliyle cima' edip de meni indirmeyen erkek hakkında : «Zekerini yıkar; ve abdest alır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 781,
			"arabicnumber": "347.01",
			"text": "Bana Züheyr b. Harb ile Abd b. Hümeyd rivayet ettiler. Dedilerki: Bize Abdüssamed b. Abdülvarîs rivayet etti. H. Bize Abdülvaris b. Abdüssamed'de rivayet etti. Lafız onundur. (Dediki): Bana babam, dedemden, o da Hüseyin b. Zekvan'dan, o da Yahya b. Ebî Kesir'den naklen rivayet etti. (Demişki): Bana Ebu Seleme haber verdi, ona da Ata' b. Yesar haber vermiş, ona da Zeyd b. Halid el-Cühenî haber vermişki: Kendisi Osman b. Affan'a sormuş ve şöyle demiş.: «Bir adam karısı ile cima' ederde menisini indirmezse ne buyurursun?» dedim. Osman: «Namaza abdest alır gibi abdest alır ve zekerini yıkar» dedi ve şunları ilave etti. : «Ben bunu Resulullah (Sallallahu Aleyhi ve Sellem)'den işittim.»",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 782,
			"arabicnumber": "347.02",
			"text": "{….} Bize yine Abdülvaris b. Abdüssamed rivayet etti. (Dediki): Bana babam dedemden, o da Hüseyin'den naklen rivayet etti. Yahya demişki: Bana Ebu Seleme'de haber verdi. Ona da Urvetü'bnü Zübeyr haber vermiş. Ona da Ebu Eyyub kendisinin bu hadîsi Resulullah (Sallallahu Aleyhi ve Sellem)'den işittiğini haber vermiş",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 783,
			"arabicnumber": "348.01",
			"text": "Bana Züheyr b. Harb ile Ebu Gassan el-Mismaî rivayet ettiler. H. Bize bu hadîsi Muhammed b. el-Müsenna ile ibni Beşşar dahi rivayet ettiler. Bu ravilerin hepsi dediler ki. Bize Muaz b. Hişam rivayet etti dedi ki: Bana babam, Katade'den, Matar'da Hasan'dan, o da Ebu Rafi'den, o da Ebu Hureyre'den naklen rivayet ettilerki: Nebiyullah (Sallallahu Aleyhi ve Sellem) : «Erkek kadının dört şu'besi arasına oturup da onu yorarsa kendisine yıkanmak vacib olur.» buyurmuşlar. Matar'ın hadîsinde : «Meniyi indirmese bile.» kaydı vardır. Ravilerden Züheyr : «Kadının dört eş'ubu arasına.» diye rivayet etti",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 784,
			"arabicnumber": "348.02",
			"text": "{….} Bize Muhammed b. Amr b. Abbad b. Cebele rivayet etti. (Dediki): Bize Muhammed b. Ebî Adiy rivayet etti. H. Bize Muhammed b. el-Müsenna dahi rivayet etti (Dediki): Bana Vehb b. Cerir rivayet etti. Bunların ikiside Şu'be'den, O da Katade'den bu isnadla bu Hadîs'in mislini rivayet ettiler. Ancak Şu'be'nin hadisinde: «Sonra varını yoğunu sarfederse.» kaydı vardır. «Meni indirmese bile.» dememiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 785,
			"arabicnumber": "349",
			"text": "Bize Muhammed b. el-Müsenna rivayet etti. (Dediki); Bize Muhammed b. Abdillah el Ensarı rivayet etti. (Dediki): Bize Hişam b. Hassan rivayet etti. (Dediki): Humeyd b. Hilal Ebu Bürde'den, o da Ebu Musa el-Eş'ari'den naklen rivayet etti. H. Bize yine Muhammed b. el-Müsenna rivayet ettj. (Dediki): Bize Abdül Â'la rivayet etti. Bu hadis onundur. (Dediki): Bize Hişam, Humeyd b. Hllal'den rivayet etti, o: Ebu Musa'dan demiş: Halbuki ben bu hadisin yalnız Ebu Bürde'de rivayet edildiğini bilirim. Ebu Musa şöyle demiş. Bu babta Muhacirlerle Ensar'dan bir cemaat ihtilaf ettiler. Ensar; «Gusl ancak deik'den yahut meniden dolayı lazım gelir, dediler Muhacirler ise: «Hayır, Cima' varmı? gusl vacibdir» mukabelesinde bulundular. Ravi diyorki, Ebu Musa şöyle dedi: «Ben sizi bu münakaşadan kurtarayım dedim ve kalkarak, Aişe'nin yanına girmek için izin istedim. Bana izin verildi. Aişe'ye dedim ki; Ey anneciğim; yahut ey müminlerin annesi! Ben sana birşey sormak istiyorum, ama senden de utanıyorum.» Aişe : «Seni doğuran annene sorabileceğin bîrşeyi bana sormaktan utanma; çünkü ben de senin annenim» dedi ben : «Öyle ise guslü icab eden nedir?» dedim Aişe : «Bilene rastladın; Resulullah (Sallallahu Aleyhi ve Sellem): «Erkek (kadının dört şu'besi arasına oturur da sünnet mahalli sünnet mahalline temas ederse gusl vacib olur.» buyurdular, dedi)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 786,
			"arabicnumber": "350",
			"text": "Bize Harun b. Maruf ile Harun b. Said el-Eylî rivayet ettiler. Dedilerki: Bize İbni Vehb rivayet etti. (Dediki): Bana İyaz b. Abdillah, Ebu Zübeyr'den o da jCabir b. AbdîIIah'dan, o da Ünımii Külsüm'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Âişe'deıı naklen haber verdi: Âişe şöyle demiş. «Bir adam Resulullah (Sallallahu Aleyhi ve Sellem)'e, zevcesi ile cima' yaparak menisini inzal etmiyen kimsenin hükmünü sordu. Bu karı kocaya gusl vacip olur mu? dedi, Aişe'de orada oturuyordu, Resulullah (Sallallahu Aleyhi ve Sellem): «Şununla ben, ikimiz bunu yapıyoruz, sonra yıkanıyoruz.»: buyurdular",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 787,
			"arabicnumber": "351",
			"text": "Bize Abdülmelîk b. Şuayb b. Leys rivayet etti. Dediki: Bana babam dedemden rivayet etti. Demişki: Bana UkayI b. Halici rivayet etti, dediki: İbni Şihab şunu söyledi. Bana Abdülmelik b. Ebî Bekr b. Abdurrahman b. Haris b. Hişam haber verdi, Ona da Haricetü'bnü Zeyd el-Ensari haber vermiş ki babası Zeyd b. Sabit şunları söylemiş: Resulullah (Sallallahu Aleyhi ve Sellem)'i: «Abdest; ateşte pişen şeylerden dolayı icab eder.» buyururken işittim. İzah 353 te",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 788,
			"arabicnumber": "352",
			"text": "{….} İbni Şihab dedi ki: Bana Ömer b. Abdilaziz haber verdi, ona da Abdulah b. İbrahim b. Kaariz haber vermişki kendisi Ebu Hureyre'yi mescidde abdest alırken bulmuş, Ebu Hureyre: «Ben sadece yediğim keş kırıntılarından dolayı abdest alıyorum. Çünkü Resulullah (Sallallahu Aleyhi ve Sellem)'i: «Ateşte pişen şeyleri yedikten sonra abdest alın.» buyururken işittim,» demiş. İzah 353 te",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 789,
			"arabicnumber": "353",
			"text": "{….} İbni Şihab dedi ki: ana Said b. Halid b. Amr b. Osman haber verdi. Ben kendisine bu hadîsi rivayet ederken o da: Ateşten pişen şeylerden dolayı abdest almak lazım gelip gelmiyeceğini Urvetü'bnü Zübeyr'e sorduğunu söyledi. Urve Şöyle demiş: Ben Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Aişe'yi «Resulullah (Sallallahu Aleyhi ve Sellem) : «Ateşte pişen şeyler den sonra abdest alın.» buyurdular, derken işittim",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 790,
			"arabicnumber": "354.01",
			"text": "Bize Abdullah b. Mesleme b. Ka'neb rivayet etti. (Dediki): Bize Malik, Zeyd b. Eslem'den, o da Ata b. Yesar'dan, o da İbni Abbas'dan naklen rivayet etti Ki: Resulullah (Sallallahu Aleyhi ve Sellem) bir koyun küreği yemiş sonra namaz kılmış abdest almamış",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 791,
			"arabicnumber": "354.02",
			"text": "{….} Bize Züheyr b. Harb'da rivayet etti, dediki: Bize Yahya b. Said, Hişam b. Urveden rivayet etti. (Demişki): Bana Vehb b. Keysan, Muhammed b. Amr b. Ata 'dan o da İbnİ Abbas'dan naklen haber verdi. H. Bana Zührî de Ali b. Abdillah b. Abbas'dan, o da İbni Abbas'dan naklen rivayet etti. H. Bana Muhammed b. Ali dahi babasından, o da İbni Abbas'dan naklen rivayet ettiki Nebi (Sallallahu Aleyhi ve Sellem) Etli bir kemik yahut et yemiş, sonra namaz kılmış fakat abdest almamış; suya da el değdirmemiş... İzah 359 nolu Hadiste",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 792,
			"arabicnumber": "355.01",
			"text": "Bize Muhammed b. Sabbah rivayet etti. (Dediki): Bize İbrahim b. Saîd rivayet etti. (Dediki): Bize Zühri, Ca'fer b. Amr b. Ümeyyete'd-Damrî'den o da, babasından naklen rivayet etti. Babası Resulullah (Sallallahu Aleyhi ve Sellem)'i bir (Koyun) kürek(in)den kesip yerken görmüş, sonra namaz kılmış, fakat abdest almamış",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 793,
			"arabicnumber": "355.02",
			"text": "Bana Ahmet b. İsa rivayet etti. (Dediki): Bana İbni Vehb rivayet etti. (Dediki): Bana Amr b. Haris, İbni Şihab'dan, o da Cafer b. Amr b. Ümeyyete'd Damri'den o da babasından naklen haber verdi. Babası şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem)'i bir koyun küreğinden kesip yerken gördüm, Müteakiben namaza davet edildi. Hemen kalkarak bıçağı attı ve namaz kıldı, fakat abdest almadı. İbni Şihab: «Bunu bana Ali b. Abdillah b. Abbas babasından, o da Resulullah (Sallallahu Aleyhi ve Sellem)'den bunu rivayet etti» demiş. İzah 359 nolu Hadiste",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 795,
			"arabicnumber": "356.01",
			"text": "{….} Amr demiş ki, Bana Bükeyr b. Eşec dahî İbni Abbas'ın azadlısı Kureyb'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Meymune'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet ettiki: Resulullah (Sallallahu Aleyhi ve Sellem) Meymune'nin yanında kürek yemiş. Sonra namaz kılmış, fakat abdest almamış",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 796,
			"arabicnumber": "356.02",
			"text": "{….} Amr: Bana Ca'fer b. Rabîa, Yakup b. Eşecc'den, o da İbni Abbas'ın azadlısı Kureyb'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Meymune'den naklen bunu rivayet etti» demiş. İzah 359 nolu Hadiste",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 797,
			"arabicnumber": "357",
			"text": "Amr demiş ki : Bana Said b. Ebi Hilal, Abdillah b. Ubeydillah b. Ebi Rafi'den, o da Ebu Gatafan'dan, o da Ebu Rafi'den naklen rivayet etti. Ebu Rafi: «Şahadet ederim ki: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'e koyuıuııı ciğerini kızartırdım. Sonra namaz kılar, fakat abdest almazdı» demiş. İzah 359 nolu Hadiste",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 798,
			"arabicnumber": "358.01",
			"text": "Bize Kuteybetü'bnü Said rivayet etti. (Dediki): Bize Leys, Ukayl'den o da Zührî'den, o da Ubeydullah b. Abdullah'dan, o da İbni Abbas'dan naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) süt içmiş sonra su isteyerek ağzını çalkalamış ve: «Bunun yağı vardır.» buyurmuş",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 799,
			"arabicnumber": "358.02",
			"text": "{….} Bana Ahmed b. İsa dahi rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana da Amr haber verdi. H. Bana Züheyr b. Harb'da rivayet etti. (Dediki): Bize Yahya b. Saîd, Evza'i'den rivayet etti. H. Bana Harmeletü'bnü Yahya dahî rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Yunus rivayet etti. Bunların hepsi ibni Şihab'dan Ukayl'in Zühri'den naklettiği isnadla bu hadisin mislini rivayette bulunmuşlardır. İzah 359 nolu Hadiste. DİKKAT! İzahın tamamını okuyun",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 800,
			"arabicnumber": "359.01",
			"text": "Bana Ali b. Hucr rivayet etti. (Dediki): Bize İsmail b. Cafer rivayet etti. (Dediki): Bize Muhamnıed b. Amr b. Halhale, Muhammed b. Amr b. Ata'dan, o da İbni Abbas'dan naklen rivayet ettiki, Resulullah (Sallallahu Aleyhi ve Sellem) Esvabını üzerine toplayarak namaza çıkmış. O esnada kendisine ekmekle etten müteşekkil bir hediye getirmişler. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) (ondan) üç lokma yiyerek cemaata namaz kıldırmış, hiçbir suya da el değdirmemiş",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 801,
			"arabicnumber": "359.02",
			"text": "{….} Bize bu hadisi Ebu Kureyb'de rivayet etti. (Dediki): Bize Ebu Üsame, Velid b. Kesir'den rivayet etti. (Dediki): Bize Muhammed b. Amr b. Ata rivayet etti. Ben İbni Abbas'Ia beraberdim...» diyerek hadîsi İbni Halhale hadisinin manası île rivayet etti.» Bu hadiste «İbni Abbas Nebi (Sallallahu Aleyhi ve Sellem)'in bunu yaptığına şahit olmuş» cümlesîde vardır. Birde «Namaz kıldı» demiş. Fakat «Cemaata kıldırdı» kaydını söylememiştir",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 802,
			"arabicnumber": "360.01",
			"text": "Bize Ebu Kamil Fudayl b. Hüseyin el-Cahderî rivayet etti. (Dediki): Bize Ebu Avane Osman b. AbdiIIah b. Mevheb'den, o da Ca'fer b. Ebu Sevr'den, o da Cabir b. Semure'den naklen rivayet ettiki. Bir zat Resulullah (Sallallahu Aleyhi ve Sellem)'e : — «Koyun eti yedikten sonra abdest alayım mı?» diye sormuş Resulullah (Sallallahu Aleyhi ve Sellem) : — «İstersen al, istersen alma.» cevabını vermiş. O zat : — Deve eti yedikten sonra abdest alayım mı?» diye sormuş Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): — «Evet, deve eti yedikten sonra abdost al.» buyurmuşlar. O zat : — «Koyun ağıllarında namaz kılabilirmiyim?» demiş Resulullah (Sallallahu Aleyhi ve Sellem) : — «Evet!» cevabını vermiş. — Deve ireklerinde namaz kılabilirmiyim?» diye sormuş Efendimiz (Buna) : — «Hayır!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 803,
			"arabicnumber": "360.02",
			"text": "{….} Bize Ebu Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Muaviye b. Amr rivayet etti. (Dedi(ki): Bize Zaide, Simak'tan rivayet etti. H. Bana Kaasim b. Zekeriya'da rivayet etti. (Dediki): Bize Ubeydullah b. Musa Şeyban'dan, o da Osman b. Abdillah b. Mevheb ile Eş'as b. Ebi'ş-Şa'sa'dan naklen rivayet etti. Bunların her biri Ca'fer b. Ebi Sevr'den, o da Cabir b. Semura'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen Ebu Kamil'in Ebu Avane'den rivayet ettiği hadis gibi rivayette bulunmuşlar",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 804,
			"arabicnumber": "361",
			"text": "Bana Amru'n-Nakid ile Züheyr b. Harb rivayet ettiler. H. Bize Ebu Bekr b. Ebî Şeybe dahî rivayet etti. Bunlar hep birden İbni Uyeyne'den rivayet ettiler. Amr dediki, bize Süfyan b. Uyeyne, Zührî'den, o da Saîd ile Abbad Temîm'den, Abbad da amcasından naklen rivayet ettiki : Nebi (Sallallahu Aleyhi ve Sellem)'e namazda iken; hayaline abdesti bozuldu gibi gelen kimsenin hükmü arz olumuş. Resulullah (Sallallahu Aleyhi ve Sellem): «Böyle bîr kimse ses işitmedikçe veya koku duymadıkça namazdan çıkamaz.» buyurmuşlar. Ebu Bekr ile Züheyr b. Harb kendi rivayetlerinde. «Soran zat Abdullah b. Zeyd'dir» dediler. İzah 362 de",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 805,
			"arabicnumber": "362",
			"text": "Bana Züheyr b. Harb'da rivayet etti. (Dediki): Bize Cerîr, Süheyl'den, o da babasından, o da Ebu Hureyre'den naklen rivayet etti. Ebu Hureyre şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) : «Biriniz karnında bir şey hisseder de ondan bir şey çıkıp çıkmadığını kestiremezse ses İşitmedikçe veya koku duymadıkça sakın mescidden çıkmasın.» buyurdular",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 806,
			"arabicnumber": "363.01",
			"text": "Bize Yahya b. Yahya ile Ebu Bekr b. Ebî Şeyhe, Amru'n-Nakıd ve İbni Ebu Ömer Toptan İbni Uyeyne'den rivayet ettiler, Yahya dedi ki, Bize Süfyan b. Uyeyne Zührî'den, o da Ubeydullah b. Abdillah'dan, o da İbni Abbas'dan naklen haber verdi. İbni Abbas şöyle demiş: Meymune'nin azadlı bir cariyesine bir koyun tasadduk edilmiş. Koyun ölmüş. Resulullah (Sallallahu Aleyhi ve Sellem) de onun yanından geçerek : «Bunun derisini alsanız da tabaklayıp ondan faydalansanız ya!» buyurmuş oradakiler. — «O ölüdür, dediler» bunun üzerine Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Onun ancak yenmesi haramdır.» buyurmuşlar. Ebu Bekr ile İbni Ebî Ömer kendi rivayetlerinde Meymune (R.A.)'dan dediler",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 807,
			"arabicnumber": "363.02",
			"text": "Bana Ebut' Tahir ile Harmele'de rivayet ettiler, Dedilerki: Bize İbni Vehb rivayet etti. (Dediki): Bana Yunus, İbni Şihab'dan, o da Ubeydullah b. Abdillah b. Utbe'den, o da İbni Abbas'dan naklen haber verdi ki: Resulullah (Sallallahu Aleyhi ve Sellem) Ölü bir koyun buldu. Bu koyun Meymunenin azadlı bir cariyesine sadaka malından verilmişti. Bunun üzerine: Resulullah (Sallallahu Aleyhi ve Sellem): — «Bunun derisinden istifade etseniz ya!» buyurdu. (Oradakiler) — «O ölüdür» dediler. Resulullah (Sallallahu Aleyhi ve Sellem): — «Onu.i ancak yenmesi haramdır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 808,
			"arabicnumber": "363.03",
			"text": "{….} Bize Hasan el-Hulvanî ile Abd b. Humeyd hep birden Ya'kup b. İbrahim b. Sa'd'dan rivayet ettiler. Demiş ki, Bana babam Salih'den, o da ibni Şihab'dan bu isnadla Yunusun rivayeti gibi rivayette bulundu",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 809,
			"arabicnumber": "363.04",
			"text": "Bize İbni Ebî Ömer ile Abdullah b. Muhammed ez Zührî'de rivayet ettiler. Lafız İbni Ebî Ömer'indir. Dediler ki Bize Süfyan, Amr'dan, o da Ata'dan, o da İbni Abbas'dan naklen rivayet ettiki: Resulullah (Sallallahu Aleyhi ve Sellem) atılmış bir koyun ölüsünün yanına uğradı. Bu koyun Meymunenin azadlı bir cariyesine sadaka malından verilmişti. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) : «Bunun derisini alarak tabaklasalar da ondan istifade etseler ya!» buyurdular. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 810,
			"arabicnumber": "364",
			"text": "Bize Ahmed b. Osman en-Nevfeli rivayet etti. (Dediki): Bize Ebu Âsim rivayet etti. (Dediki): Bize îbni Cüreyc rivayet etti. (Dediki): Bana Amr b. Dinar haber verdi. (Dediki): Bana hayli zaman önce Ata haber verdi. Dediki Bana İbni Abbas haber verdi. ona da Meymune haber vermiş ki: Resulullah (Sallallahu Aleyhi ve Sellem) zevcelerinden birinin bir koyunu varmış; koyun ölmüşde Resulullah (Sallallahu Aleyhi ve Sellem): «Onun derisini alsanız da ondan istifade etsenizdi ya!» buyurmuşlar. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 811,
			"arabicnumber": "365",
			"text": "Bize Ebu Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdürrahim b. Süleyman, Abdülmelik b. Ebi Süleymandan, o da İbni Abbas'dan naklen rivayet ettiki: Nebi (Sallallahu Aleyhi ve Sellem) Meymune'nin azadlı bir cariyesine aid (ölü) bir koyunun yanından geçmiş de.» «Bunun derisinden istifade efsenizdi ya!» buyurmuşlar. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 812,
			"arabicnumber": "366.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Süleyman b. Bilal, Zeyd b. Eslem'den naklen haber verdi. Ona da Abdurrahman b. Va'le haber vermiş ki Abdullah b. Abbas şöyle demiş: Ben Resulullah (Sallallahu Aleyhi ve Sellem): «Deri tabaklandığı vakit femiz olur.» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 813,
			"arabicnumber": "366.02",
			"text": "{….} Bize Ebu Bekr b. Ebî Şeybe ile Amru'n-Nakıd da rivayet ettiler. Dediler ki Bize İbni Uyeyne rivayet etti. H. Bize Kuteybetü'bnü Saîd'de rivayet etti. (Dediki): Bize Abdülaziz yani İbni Muhammed rivayet etti. H. Bize Ebu Kureyb ile İshak b. İbrahim dahî hep birden Veki'den, o da Süfyan'dan naklen rivayet ettiler. Bunların hepsi Zeyd b. Eslem'den, o da Abdurrahman b. Va'Ie'den, o da İbni Abbas'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den bunun yani Yahya b. Yahya hadîsinin mislini rivayet ettiler",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 814,
			"arabicnumber": "366.03",
			"text": "Bana İshak b. Mansur ile Ebu Bekr b. İshak rivayet ettiler Ebu Bekr Haddesena» İbni Mansur ise; «Ahberana» tabirini kullandılar İbni Mansur dedi ki. Bize Amr b. Rabî haber verdi dediki, bize Yahya b. Eyyüb, Yezid b. Ebî Habib'den naklen haber verdi. Ona da Ebu'l Hayır rivayet etmiş demiş ki. İbni Va'Iete's Sebe'î'nin üzerinde bir kürk gördüm, de ona dokundum. İbni Va'le : «Ona neden dokunuyorsun? Ben Abdullah b. Abbas'a sordum. Dedimki biz Mağrib'de bulunuyoruz yanımızda Berberîlerle, Mecusiler de var. Bazan onların kestikleri bir koç bize getiriliyor, ama biz onların kestiklerini yemiyoruz. Bize içine hayvan yağı koydukları tulumları da getiriyorlar» İbni Abbas şu cevabı verdi.» — Biz bu meseleyi Resulullah (Sallallahu Aleyhi ve Sellem)'e sorduk. «Deriyi tabaklayan şey, onun temizleyicisidir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 815,
			"arabicnumber": "366.04",
			"text": "Bana İshak b. Mansur ile Ebu Bekr b. İshak da Amr b. Rabî'dan rivayet ettiler. (Dedilerki); Bize Yahya b. Eyyüb, Ca'fer b. Rabîa'dan, o da Ebu'l Hayr'dan naklen haber verdi. Ebu'l Hayr demişki, Bana İbni Va'Iete's-Sebei rivayet etti dedi ki. Ben Abdullah b. Abbas'a sordum. Ve: — Biz Mağrib'de bulunuyoruz. (Ba'zan) bize Mecusîler içlerinde su ve hayvan yağları bulunan tulumlar getiriyorlar dedim. İbni Abbas sadece «iç» diye cevap verdi bunun üzerine ben : — «Bu senin düşündüğün bir reymidir?» dedim. îbni Abbas Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i : — «Deriyi tabaklayan şey, onu temizleyicisidir.» buyururken işittim dedi. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 816,
			"arabicnumber": "367.01",
			"text": "Bize Yahya b. Yahya rivayet etti, dedi ki, Malik'e Abdurrahman b. Kaasim'den dinlediğim, onunda babasından, onunda Aişe'den rivayet ettiği şu hadisi okudum. Âişe şöyle demiş: — Seferlerinin birinde Resulullah (Sallallahu Aleyhi ve Selleın) ile birlikte (yola) çıktık. Beyda yahut Zatü'l-Ceyş denilen yere vardığımızda gerdanlığım koptu. Onu aramak için Resulullah (Sallallahu Aleyhi ve Sellem) o yerde bekledi, Cemaat da onunla beraber beklediler. Halbuki su başında olmadıkları gibi yanlarında su da yoktu. Bunun üzerine halk Ebu Bekr'e gelerek: - Aişe'nin yaptığını görüyormusun? Hem Resulullah (Sallallahu Aleyhi ve Sellem)'i, hemde yanındaki insanları yollarından alıkoydu. Bunlar su başında değiller yanlarında su da yok, dediler. Derken Ebu Bekr yanıma geldi Resulullah (Sallallahu Aleyhi ve Sellem) başını dizime koymuş, uyumuştu. Ebu Bekir (bana): «Sen hem Resulullah (Sallallahu Aleyhi ve Sellem)'i, hem de yanındaki insanları yollarından alıkoydun. Bunlar su başında değiller, yanlarında su da yok!» dedi. (Hasılı) Ebu Bekr beni (adamakıllı) azarladı ve Allah'ın dilediği kadar söylendi. Eliyle de böğrüme vurmaya başladı. Kıpırdamama ancak Resulullah (Sallallahu Aleyhi ve Sellem)'in dizimde bulunması mani oluyordu. Böylece Resulullah (Sallallahu Aleyhi ve Sellem) uyudu ve susuz olarak sabahladı. Bunun üzerine Allah Teala teyemmüm ayetini indirdi ve Ashab teyemmüm ettiler. Nakîblerden biri olan Useyd b. Hudayr. — Bu sizin ilk bereketiniz değildir, Ey Ebu Bekr hanedanı! dedi. «Aişe demiş ki: Müteakiben üzerinde bulunduğum deveyi kaldırdık gerdanlığı da altında bulduk",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 817,
			"arabicnumber": "367.02",
			"text": "Bize Ebu Bekr b. Ebi Şeybe rivayet etti dediki, Bize Ebu Usame rivayet etti, H. Bize Ebu Kureyb'de rivayet etti. (Dediki): Bize Ebu Usame ile İbni Bişr, Hişam'dan o da babasından, o da Aişe'den naklen rivayet etti ki; Aişe kızkardeşi Esma'dan emaneten bir gerdanlık .almış bu gerdanlık kaybolmuş da Resulullah (Sallallahu Aleyhi ve Sellem) ashabından bazı zevatı onu aramaya göndermiş. Namaz vakti gelince gerdanlığı arayanlar abdestsiz olarak namaz kılmışlar ve Nebi (Sallallahu Aleyhi ve Sellem)'in yanına geldikleri vakit vaziyeti kendisine şikayet etmişler. Bunun üzerine teyemmüm ayeti inmiş, Useyd b. Hudayr (Hz. Aişe'ye : (R.A.) : «Allah sana hayır ihsan eylesin. Vallahi senin başına birşey gelmemiştir ki Allah sana ondan bir mahlas ve Müslümanlara onda bir bereket halk etmesin.» demiş. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 818,
			"arabicnumber": "368.01",
			"text": "Bize Yahya b. Yahya ile Ebu Bekr b. Ebî Şeybe ve İbni Nümeyr toptan Ebu Muaviye'den rivayet ettiler. Ebu Bekr dediki: Bize Ebu Muaviye A'meş'den, o da Şekîk'den naklen rivayet etti. demiş ki; Ben Abdullah ve Ebu Musa ile birlikte oturuyordum. Ebu Musa'ya: «Ya Eba Abdirrahman bir adam cünüp olsada bir ay su bulamasa ne buyurursun. «— Bu adam namazı ne yapacak.» dedi Abdullah: — «Bir ay suyu bulamasada teyemmüm edemez» cevabını verdi. Bunun üzerine Ebu Musa : — «Ya Maide süresindeki şu : (Eğer su bulamazsanız temiz toprağa teyemmüm [ Maide 6 ] ediverin) ayetine ne dersin?.» dedi Abdullah: — Eğer bu ayette bu adamlara ruhsat verilmiş olsa nerdeyse suyu soğuk buldukları zaman toprakla teyemmüme kalkışırlar.» dedi. Bu sefer Ebu Musa Abdullah'a şunu söyledi.: — «Sen Ammar'ın: Beni Resulullah (Sallallahu Aleyhi ve Sellem) bir hacet peşinde gönderdi. Ben cünüp oldumda su bulamadım ve toprakda hayvan yuvarlanır gibi yuvarlandım. Sonra Nebi (Sallallahu Aleyhi ve Selletn)'e gelerek bu vak'ayı kendisine anlattım. Resulullah (Sallallahu Aleyhi ve Sellem) : «Ellerinle şöyle yapman sana yeterdi.» buyurdular dediğini işittin mi? Sonra elerini bir defa yere vurarak sol eliyle sağ eline, avuçlarının dışına ve yüzüne mesh etti. Abdullah'da: — «Ya sen Ömer'in Ammar'ın sözüne kanaat getirmediğini görmedin mi?» Cevabını verdi",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 819,
			"arabicnumber": "368.02",
			"text": "Bize Ebu Kamil el-Cahderî dahî rivayet etti. (Dediki): bize Abdülvahid rivayet etti. (Dediki): Bize A'meş Şekik'ten rivayet etti. Şekik; Ebu Musa, Abdullah'a şöyle dedi diyerek. Hadîsi bütün kıssası ile Ebu Muaviye hadisi gibi rivayet etmiş şu kadar varki O: Resulullah (Sallallahu Aleyhi ve Sellem): «Şöyle yapman sana yeterdi.» buyurdu, demiş. Ve ellerini yere vurmuş. Sonra ellerini silkerek yüzüne ve kollarına mesh etmiş",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 820,
			"arabicnumber": "368.03",
			"text": "Bana Abdullah b. Haşimı el-Abdî rivayet etti. (Dediki): Bize Yahya yani İbni Saîd el-Kattan, Şu'be'den rivayet etti. Demişki bana Hakem Zerr'den o da Said b. Abdirrahman b. Ebza'dan, o da babasından naklen rivayet etti ki: ;Bir adam Ömer'e gelerek: — Ben cünüb oldum da su bulamadım, demiş. Ömer : — Namaz kılma, cevabını vermiş. Bunun üzerine Ammar : — Hatırlarmısın ya Emirel-Muminin! Hani senle ben bir seriyyedeydik ve ikimizde cünüb olmuş fakat su bulamamıştık, sen namaz kılmamıştın ama ben toprakda yuvarlanarak namazımı kılmıştım da Peygamber (Sallallahu Aleyhi ve Sellem) : «Sana sadece ellerini yere vurman, sonra üfürerek onlarla yüzüne ve kollarına mesh etmen yeterdi.» buyurmuştu, demiş. Bunun üzerine Ömer: — Allahtan kork ya Ammar» demiş Ammar: — İstersen bunu hiç söylemiyeyim mukabelesinde bulunmuş. Hakem diyor ki: Bu hadisi bana İbni Abdirrahman b. Ebza da babasından Zerr'in hadisi gibi rivayet etti (Dediki): Bana Seleme de Zerr'den naklen Hakem'in zikrettiği bu isnadla rivayet etti. Ömer: (Ammar'a) : «Üzerine aldığın mesuliyeti sana bırakıyoruz» demiş",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 821,
			"arabicnumber": "368.04",
			"text": "Bana Ishak b. Mansur'da rivayet etti (Dediki): Bize Nadr b. Şümeyl rivayet etti. (Dediki): Bize Şu'be Hakem'den naklen haber verdi demişki: Zerr'i İbni Abdurrahman b. Ebza'dan naklen rivayet ederken dinledim. Şunları söyledi: Hakem dedi ki: «Ben bu hadîsi İbni Abdurrahman b. Ebza'dan, o da babasından naklen rivayet ederken dinledim ki: Bir adam Ömer'e gelerek: — Ben cünüb oldum da su bulamadım; demiş, İbni Abdirrahman hadisi rivayet etti ve ona şunu ziyade eyledi. Ammar : — Ya Emîre'l Mü'min'in istersen Allah'ın üzerime farz kıldığı (İtaat) hakkın için ben bunul kimseye söylemiyeyim, demiş. Fakat «Bana Seleme Zerr'den rivayet etti.» cümlesini söylemedi",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 822,
			"arabicnumber": "369",
			"text": "Müslim derki: Leys b. Sa'd, Cafer b. Rabîa'dan, o da Abdurrahman b. Hürmüz'den, o da İbni Abbas'ın azadlısı Ümeyr'den naklen rivayet ettiki, Abdurrahman Umeyr'i şöyle derken işitmiş.: «Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Meymune'nin azadlısı Abdurrahman b. Yesar ile ikimiz geldik ve Ebu Cehm b. Haris b. Sımmete'l-Ensarî'nin yanına girdik. Ebu Cehm şunu söyledi, Resulullah (Sallallahu Aleyhi ve Sellem) Bi'r-i Cemel tarafından geldi, kendisine bir adam rast gelerek selam verdi, ise de; Resulullah (Sallallahu Aleyhi ve Sellem) hemen onun selamını almadı: (Oradaki) bir duvara varınca yüzüne ve ellerine mesh etti, sonra selamı aldı",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 823,
			"arabicnumber": "370",
			"text": "Bize Muhammed b. Abdillah b. Nümeyr rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Süfyan, Dahhak b. Osman'dan, o da Nafi'den, o da İbni Ömer'den naklen rivayet etti ki; Resulullah (Sallallahu Aleyhi ve Sellem) küçük abdest bozarken (yanından) bir zat geçmiş de kendilerine selam vermiş fakat Resulullah (Sallallahu Aleyhi ve Sellem) onun selamını almamış.:»",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 824,
			"arabicnumber": "371",
			"text": "{….} Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Yahya yani ibni Saîd rivayet etti. Dediki: Bize Humeyd rivayet etti. H. Bize Ebu Bekr b. Ebi Şeybe de rivayet etti lafız onundur. (Dediki): Bize İsmail b. Uleyye, Humeyd-i Tavü'den, o da Ebu Rafi'den, O da Ebu Hureyre'den naklen rivayet etti ki: Ebu Hureyre cünüp olarak Medine yollarından birinde Nebi (Sallallahu Aleyhi ve Sellem)'e rastlamış ve hemen sıvışarak gitmiş, yıkanmış, Nebi (Sallallahu Aleyhi ve Sellem) onu araştırmış, Ebu Hureyre geldiği zaman : «Nerede kaldın ya Eba Hureyre?» diye sormuş. Ebu Hureyre : «Ya Resulallah bana cünüp halimde tesadüf ettin. Ben de yıkanmadıkça senin yanında oturmayı doğru bulmadım; demiş. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) : «Sübhanallah! Mu'min necis olmaz.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 825,
			"arabicnumber": "372",
			"text": "Bize Ebu Bekir b. Ebî Şeybe ile Ebu Kureyb'de rivayet ettiler. Dediler ki Bİze Veki', Mis'ar'dan o da Vasıl'dan, o da Ebu Vail'den, o da Huzeyfe'den naklen rivayet ettiki, Huzeyfe cünüp iken kendisine Resulullah (Sallallahu Aleyhi ve Sellem) tesadüf etmiş. Huzeyfe hemen sıvışarak (Gitmiş) yıkanmış sonra gelerek: Ben cünüptüm demiş Resulullah (Sallallahu Aleyhi ve Sellem): «Müslüman necis olmaz.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 826,
			"arabicnumber": "373",
			"text": "Bize Ebu Kureyb Muhammed b. Ala ile İbrahim b. Musa rivayet ettiler dediler ki; Bize İbni Ebî Zaide babasından, O da Halid b. Seleme'den, o da Behiy' den, o da Urve'den, o da Âişe'den naklen rivayet etti. Aişe: Nebi (Sallallahu Aleyhi ve Sellem) (zamanının) her anında Allah'ı zikrederdi» demiş",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 827,
			"arabicnumber": "374.01",
			"text": "Bize Yahya b. Yahya et-Temîmî ile Ebu'r Rabî' Ez-Zehranî rivayet ettiler. Yahya: Bize Hammad haber verdi dedi. Ebu'r Rabî' ise; Bize Hammad, Amr b. Dinar'dan o da Saîd b. el-Huveyris'den o da İbni Abbas'dan naklen rivayet etti, ki: Nebi (Sallallahu Aleyhi ve Sellem) heladan çıkmış, kendisine yemek getirmişler ve Abdest lafı etmişler. Resulullah (Sallallahu Aleyhi ve Sellem) : «Ben namaz kılmak mı istiyorum ki, abdest alayım.» buyurmuşlar; dedi",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 828,
			"arabicnumber": "374.02",
			"text": "Bize Ebu Bekr b. Ebi Şeybe'de rivayet etti. (Dediki): Bize Süfyan b. Uyeyne, Anır'dan, o da Saîd b. el-Huveyris'den naklen rivayet etti. Demiş ki: Ben İbni Abbas'dan dinledim. Şöyle diyordu: Nebi (Sallallahu Aleyhi ve Sellem)'in yanında idik. Heladan gelmiş de kendisine yemek getirmişlerdi. Abdest almayacak mısın, dediler. Resulullah (Sallallahu Aleyhi ve Sellem): «Niçin? Namaz mı kılacağımki, abdest alayım.» buyurdular",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 829,
			"arabicnumber": "374.03",
			"text": "Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Muhammed b. Müslim et-Taifî, Amr b. Dinar'dan, o da Saib oğullarının azadlısı Saîd b. Huveyris'den naklen haber verdiki, Saîd, Abdullah b. Abbas'i şöyle derken işitmiş, Resulullah (Sallallahu Aleyhi ve Sellem) helaya gitti; geldiği zaman kendisine yemek takdim ettiler ve: — Ya Resulullah! Abdest almayacakmısın? dediler. Resulullah (Sallallahu Aleyhi ve Sellem) : — «Niçin? Namaz içinmi?» buyurdular",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 830,
			"arabicnumber": "374.04",
			"text": "Bana Muhammed b. Amr b. Abbad b. Cebele dahî rivayet etti. (Dediki): Bize Ebu Âsim, İbni Cüreyc'den rivayet etti. Demiş ki: Bize Saîd b. Huveyris rivayet etti. Saîd, İbni Abbas'ı şöyle derken işitmiş. Nebi (Sallallahu Aleyhi ve Sellem) helada kaza-i hacet etti de kendisine yemek getirildi. O (bundan) yedi, fakat suya falan dokunmadı. İbni Cüreye demişki: Bana Amr b. Dînar, Said b. Huveyris'den naklen şunu da ziyade etti. Nebi (Sallallahu Aleyhi ve Sellem)': — Sen abdest almadan, demişler. Resulullah (Sallallahu Aleyhi ve Sellem) : «Namaz kılmak istemedim'ki, abdest alayım.» buyurmuşlar. Amr bunu Said b. Huveyris'den dinlediğini söyledi",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 831,
			"arabicnumber": "375.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Hammad b. Zeyd haber verdi, Yahya şunu da söyledi. Bize Hüşeym haber verdi. Bunların ikisi de Abdulaziz b. Suheyb'den o da Enes'den naklen rivayet etmişler. Hammad'ın hadîsinde: «Resulullah (Sallallahu Aleyhi ve Sellem) helaya gireceği vakit...» Cümlesi, Hüseyin'in hadisinde: Resulullah (Sallallahu Aleyhi ve Sellem) kenîfe gireceği zaman...» ibareleri vardır. Resulullah (Sallallahu Aleyhi ve Sellem) helaya girerken : [Allahumme inni auzu bike mine'l Hubsi ve'l Hebaisi ] dermiş. Manası: «Ya Rabbi, Hubs ve Habaisden sana sığınırım.»",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 832,
			"arabicnumber": "375.02",
			"text": "{….} Bize Ebu Bekr b. Ebî Şeybe ile Züheyr b. Harb'da rivayet ettiler. Dedilerki: Bize İsmail-ki İbni Uleyye'dir- Abdulaziz'den bu isnadla rivayet etti ve Resulullah (Sallallahu Aleyhi ve Sellem)'in: «Hubs ve Habaisden Allah'a sığınırım.» dediğini söyledi",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 833,
			"arabicnumber": "376.01",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize ismail h. Uleyye rivayet ettu H. Bize Şeyban b. Ferruh dahî rivayet etti. (Dediki): Bize Abdülvaris rivayet etti, bunların ikisi de Abdülaziz'den, o da Enes'den, naklen rivayet etmişler. Enes şöyle demiş: — Resulullah (Sallallahu Aleyhi ve Sellem) birisine yavaşça birşey söylerken namaza ikamet getirildi. (Abdülvaris'in hadisinde: Nebiyullah (Sallallahu Aleyhi ve Sellem) birisiyle gizlice konuşurken denilmiştir) fakat cemaat uyuyuncaya kadar kendisi namaza kalkmadı",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 834,
			"arabicnumber": "376.02",
			"text": "Bize Ubeydullah b. Muaz el-Anberî rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be Abdülaziz b. Süheyb'den, o da Enes b. Malik'den işitmiş olmak üzere rivayet etti. Enes şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem) bir adamla gizlice konuşurken namaz için ikamet getirildi. Fakat kendileri ashabı uyuyuncaya kadar gizli konuşmaya devam ettiler, sonra gelerek onlara namaz kıldırdılar",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 835,
			"arabicnumber": "376.03",
			"text": "Bana Yahya b. Habîb el-Harisi dahî rivayet etti. (Dediki): Bize Halid —ki îbnil Haristir— rivayet etti. (Dediki): Bize Şu'be Katade'den, naklen rivayet etti. Demiş ki: Enes'i şöyle derken dinledim. Resulullah (Sallallahu Aleyhi ve Sellem)'in ashabı uyurlar sonra abdest almadan namaz kılarlardı. Şu'be demiş ki: Katade'ye «Sen bunu Enes'den mi işittin?» dedim: Evet İyvallah!» cevabını verdi",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 836,
			"arabicnumber": "376.04",
			"text": "Bana Ahmed b. Saîd b. Sahr ed - Darimî rivayet etti. (Dediki): Bize Habban rivayet etti. (Dediki): Bize Hammad, Sabit'den, o da Enes'den naklen rivayet etti ki şöyle demiş: Yatsı namazına ikamet getirildi. Bu sırada bir zat; benim bir hacetim var, dedi. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) onunla gizlice görüşmeye gitti. taki cemaat yahut cemaatten bazıları uyudular; sonra namazı kıldılar",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 157
			}
		}
	]
}