{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"31": "The Book of Lost Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4498,
			"arabicnumber": "1722.01",
			"text": "Bize Yahya b. Yahya Et-Temîmî rivayet etti. (Dediki): Mâlik'e Rabia b. Ebî Abdirrahmân'dan dinlediğim, onun da Münbais'in âzâdlısı Yezid'den, onun da Zcyd b. Hâlid El-Cühenî'den naklen rivayet ettiği şu hadîsi okudum. Zeyd şöyle demiş: Bir adam Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek ona lukata'nın hükmünü sordu. Resûlullah (Sallallahu Aleyhi ve Sellem): «Onun mahafazasını ve bağını belle! Sonra onu bir sene i'lân et! Sahibi gelirse ne âlâ! Aksi takdirde onu nasıl istersen öyle yap!» buyurdu. Adam: — Kaybolmuş koyun (un hükmü nedir?) dedi. «Senin yahut dîn kardeşinin yahut da kurdundur.» buyurdular. Adam: — Ya kaybolmuş deve ne olacak? dedi. «Ondan sana ne? Su tulumu ve çarığı beraberinde! Sahibi rastlayıncaya kadar suya gider ve ağaçları otlar!» buyurdular. Yahya: «Zannederim ifâsahâ okudum.» dedi",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4499,
			"arabicnumber": "1722.02",
			"text": "Bize Yahya b. Eyyûb ile Kuteybe ve İbni Hucr da rivayet ettiler. İbni Hucr «Bize haber verdi» ta'bîrini kullandı. Ötekiler: Bize İsmâîl —ki İbni Ca'fer'dir— tahdîs etti, dediler. O da Rabîa b. Ebî Abdirrahmân'dan, o da Münbais'in âzâdlısı Yezîd'den, o da Zeyd b. Hâlid El-Cühenî'den naklen rivayet etmişki, bir adam Resûlullah (Sallallahu Aleyhi ve Sellem)'e lukatanın hükmünü sormuş. O da : «Onu bir sene i'lân et! Sonra (bir de) onun bağını ve kabını bellel Sonra onu harca! Şayet sahibi gelirse onu kendisine veriver!» buyurmuş. Adanı: — Yâ Rcsûlâllah! Kaybolmuş koyunun hükmü nedir? demiş. «Onu al! Zîra o ya senin ya dîn kardeşinin yahut da kurdundur.» buyurmuş. Adam: — Yâ Resulâllah! Ya kaybolmuş develer ne olacak? diye sormuş. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) kızmış. Hattâ yanakları kızarmış. (Yahut yüzü kızarmış.) Sonra: «Onlardan sana ne? Sahibi rastlayıncaya kadar onun çarığı ve su tulumu beraberindedir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4500,
			"arabicnumber": "1722.03",
			"text": "Bana Ebû't-Tâhir de rivayet etti. (Dediki): Bize Abdullah b. Vehb El-Hâris ve başkaları haber verdiler. Onlara da Rabîa b. Ebî Abdirrahmân bu isnâdla Mâlik hadîsinin mislini rivayet etmiş. Yalnız o şunu ziyade etmiş: «Dediki: Resûlullah (Sallallahu Aleyhi ve Sellem)'e ben de beraberinde iken bir adam geldi; ve ona lukatanın hükmünü sordu. Bu hadîste Amr: Şayet lukatamn arayıcısı gelmezse onu harcayıver! cümlesini söyledi.»",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4501,
			"arabicnumber": "1722.04",
			"text": "Bana Ahmed b. Osman b. Hakîm El-Evdî dahî rivayet etti. (Dediki): Bize Hâlid b. Mahled rivayet etti. (Dediki): Bana Süleyman —ki İbni Bilâl'dir— Rabîa b. Ebî Abdirrahman'dan, o da Münbais'in âzâdlısı Yezîd'den naklen rivayet etti. Yezîd şöyle demiş: Ben Zeyd b. Hâlid El-Cühenî'yi şunları söylerken işittim: «Bir adam Resûlullah (Sallallahu Aleyhi ve Sellem)'e geldi...» arkacığından râvi hadîsi İsmail b. Ca'fer hadîsi gibi rivayet etmiştir. Yalnız o : «Yüzü ve alnı kıpkırmızı kesildi ve kızdı.» demiş. «Sonra onu bir sene i'lân et!» cümlesinden sonra: «Şayet sahibi gelmezse Iukata senin yannda emânet olur.» ibaresini ziyâde etmiştir",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4502,
			"arabicnumber": "1722.05",
			"text": "Bize Abdullah b. Mesleme b. Ka'neb rivayet etti. (Dediki): Bize Süleyman (yâni İbni Bilâl), Yahya b. Saîd'den, o da Münbais'in âzâdlısı Yezîd'den naklen rivayet ettiki, Yezîd, Resûlullah (Sallallahu Aleyhi ve Sellem)'in sahâbîsi Zeyd b. Hâlid El-Cühenî'yi şunu söylerken işitmiş : — Resûlullah (Sallallahu Aleyhi ve Sellem)'e altın veya gümüş lukatanın hükmü soruldu da: «Onun bağını ve mahfazasını belle! Sonra onu bir sene i'lân et! Şayet (sahibini) öğrenemezsen onu harca (ya bilirsin). Lukata senin elinde bir emânet olsun! Şayet günlerden bîr gün arayıcısı gelirse onu kendisine veri ver!» buyurdu. Soran zât ona kaybolan develeri de sordu. Bunun üzerine: «Onlardan sana ne? Bırak onları! Zîrâ onların çarıkları ve su tulumları yanlarındadır. Sahipleri onları buluncaya kadar suya gelirler, ağaçları otlarlar!» buyurdu. O zât koyunu da sordu. Efendimiz : «Onu al! Çünkü o ancak ya senin, ya dîn kardeşinin yahut da kurdundur.» buyurdular",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4503,
			"arabicnumber": "1722.06",
			"text": "Bana İshâk b. Mansûr da rivayet etti. (Dediki): Bize Habbân b. Hilâl haber verdi. (Dediki): Bize Hammâd b. Seleme rivâyet etti. (Dediki): Bana Yahya b. Saîd ile Rabîatü'r-Re'y b. Ebî Abdirrahmân, Münbais'in âzâdlısı Yezîd'den, o da Zeyd b. Hâlid El-Cühenî'den naklen rivayet ettiki, Bir adam Nebi (Sallallahu Aleyhi ve Sellem)'e kaybolan develerin hükmünü sormuş...» Rabîa şunu ziyade etmiş: «Bunun üzerine kızdı; hatta yanakları kızardı.» ve hadîsi yukarıdakilerin hadîsi gibi rivayet etmiş. Şunu da ziyade eylemiş: «Şayet sahibi gelir de mahfazasını, sayısını ve bağını bilirse onu kendisine veriver! Aksi takdirde o senindir.»",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4506,
			"arabicnumber": "1723.01",
			"text": "Bize Muhammed b. Beşşâr da rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. H. Bana Ebû Bekir b. Nâfi' dahî rivayet etti. Lâfız onundur. (Dedikî): Bize Gunder rivayet etti. (Dediki): Bize Şu'be, Seleme b. Küheyl'den naklen rivayet etti. (Demişki): Süveyd b. Gafele'yi dinledim; şunları söyledi: Ben, Zeyd b. Sûhân ve Selmân b. Rabîa gazaya çıktık. Ben bir kamçı bularak onu aldım. Arkadaşlarım bana: — Bırak onu! dediler. Ben: — Hayır (bırakmam) lâkin ben onu ilân ederim; sahibi gelirse ne âla! Gelmezse ondan kendim faydalanırım; dedim. Hasılı (bu işte) onlara karşı çıktım. Gazamızdan dönünce haccetmem mukaddermiş. Medine'ye geldim. Ve Übeyy b. Kâ'b'a rastlayarak kamçı meselesini ve arkadaşlarımın sözünü kendisine haber verdim, Übeyy şunu söyledi: — Ben Resûlullah (Sallallahu Aleyhi ve Sellem) zamanında, İçinde yüz altın bulunan bir kese buldum da onu Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirdim. «Onu bir sene i'lân et!» buyurdular. Ben de İ'lân ettim; fakat onu bilen bir kimse bulamadım. Sonra kendilerine vardım. Yine: «Onu bir sene i'lân et!» buyurdular. Tekrar i'lân ettim; fakat (yine) onu bilen bir kimse bulamadım. Bilâhare (tekrar) kendilerine vardım. (Yine) : «Onu bir sene i'lân et!» buyurdular. İlân ettim; fakat (yine) onu bilen bir kimse bulamadım. Bunun üzerine: «O altınların sayısını, mahfazasını ve bağını belle! Şayet sahibi gelirse ne âlâ! Gelmezse onlardan (kendin) istifâde et ! buyurdular. Artık ben de onlardan istifâde ettim. (Şu'be demişki): Bundan sonra Seleme'ye Mekke'de rast geldim. «Süveyd üç sene mi dedi, bir sene mi bilmiyorum.» dedi",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4507,
			"arabicnumber": "1723.02",
			"text": "{…} Bana Abdurrahmân b. Bişr El-Abdî dahî rivayet etti. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Baha Seleme b. Küheyl haber verdi; yahut ben de içlerinde olduğum halde cemaata haber verdi. (Dediki): Süveyd b. Gafele'yi dinledim. Şunu söyledi: «Zeyd b. Sûhân ve Selmân b. Rabîa ile birlikte yola çıktım; ve bir kamçı buldum...» Ravi hadîsi: «Artık ben de onlardan istifâde ettim.» sözüne kadar yukarki hadis gibi rivayet etmiştir. Şu'be demiş ki: — Seleme'yi on sene sonra dinledim: «»Onları bir sene ilân etti.» diyordu",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4508,
			"arabicnumber": "1723.03",
			"text": "Bize Kuteybetü'bnü Said de rivayet etti. (Dediki): Bize Cerîr, A'meş'den naklen rivayet etti. H. Bize Ebû Bekir b. Ebi Şeybe dahî rivayet etti. (Dediki): Bize Veki' rivayet etti. H. Bize ibni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. Bu râvilerin hepsi Süfyân'dan rivayet etmişlerdir. H. Bana Muhammed b. Hatim dahî rivayet etti. (Dediki): Bize Abdullah b. Ca'fer Er-Rakkî rivayet etti. (Dediki): Bize Ubeydullah (yâni İbni Amr Zeyd b. Ebî Üneyse'den) rivayet eyledi. H. Bana Abdurrahmân b. Bişr de rivayet etti. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Hammâd b. Seleme rivayet etti. Bu râvilerin hepsi Seleme b. Küheyl'den bu isnadla Şu'be Hadîsi gibi rivayette bulunmuşlardır. Her birinin hadîsinde «üç sene» kaydı vardır. Yalnız Hammâd b. Seleme müstesna! Zîrâ onun hadîsinde: -İki veya üç sene» kaydı vardır. Süfyân, Zeyd b. Ebî Üneyse ve Hammâd b. Seleme hadîsinde: «Şayet sana biri gelir, onun sayısını, mahfazasını ve bağını haber verirse onu kendisine veriver!» ifâdesi vardır. Vekî'in rivayetinde Süfyân: «Aksi takdirde o senin malının sebili gibidir.» cümlesini ziyâde eylemiştir. İbni Numeyr'in rivayetinde ise: «Aksi takdirde ondan (kendin) istifâde et!» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4509,
			"arabicnumber": "1724",
			"text": "Bana Ebû't-Tahir ile Yûnus b. Abdüâlâ rivayet ettiler. (Dedilerki): Bize Abdullah b. Vehb haber verdi. (Dediki): Bana Amr b. Haris, Bukeyr b. Abdillâh b. Eşecc'den, o da Yahya b. Abdirrahmân b. Hâtıb'dan, o da Abdurrahmân b. Osman b. Et-Teymî'den naklen haber verdiki, Resûlullah (Sallallahu Aleyhi ve Sellem) hacının lukatasından nehî buyurmuş",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4510,
			"arabicnumber": "1725",
			"text": "Bana Ebû't-Tâhir ile Yûnus b. Abdilâlâ da rivayet ettiler. (Dedilerki): Bize Abdullah b. Vehb rivayet etti. (Dediki): Bana Amr b. Haris, Bekir b. Sevâde'den, o da Ebû Salim El-Ceyşânî'den, o da Zeyd b. Hâlid El-Cühenî'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi ki: «Her kim kayıb bir hayvanı evine kaparsa onu i'Iân etmedikçe kendisi kayıptır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4511,
			"arabicnumber": "1726.01",
			"text": "{…} Bize bu hadîsi Kuteybetü'bnü Saîd ile Muhammed b. Rumh dahî hep birden Leys b. Sa'd'dan rivayet ettiler. H. Bize bu hadîsi Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Aliy b. Müshir rivayet etti. H. Bize İbnü Numeyr dahi rivayet etti. (Dediki): Bana babam rivayet etti. Her iki râvi Ubeydullah'dan rivayet etmişlerdir. H. Bana Ebû'r-Rabî' ile Ebû Kâmil de rivayet ettiler. (Dedilerki): Bize Hammâd rivayet etti. H. Bana Züheyr b. Harb da rivayet etti. (Dediki): Bize İsmâîl (yâni îbni Uleyye) rivayet etti. Bu râviler toptan Eyyûb'dan rivayet etmişlerdir. H. Bize İbni Ebî Ömer dahî rivayet etti. (Dediki): Bize Süfyân, İsmail b, Ümeyye'den naklen rivayet etti. H. Bize Muhammed b. Râfi' de rivayet etti. (Dediki): Bize Abdürrazzâk, Ma'mer'den, o da Eyyûb'dan, İbni Cüreyc dahî Musa'dan naklen rivayet etti. Bu râvilerin hepsi Nâfi'den, o da İbni Ömer'den, o da Peygamber (Sallallahu Aleyhi ve Sellem)'den naklen Mâlik'in hadîsi gibi rivayette bulunmuşlardır. Şu kadar varki her birinin hadîsinde «Fe yünte-sele» denilmiştir. Yalnız Leys b. Sa'd müstesna! Çünkü onun hadîsinde Mâlik'in rivayetinde olduğu gibi «fe* yüntekalü taâmuh» ibaresi vardır",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4512,
			"arabicnumber": "1726.02",
			"text": "Bu hadîsi Buhâri «lukata» bahsinde; Ebû Dâvûd «Cihad»da tahrîc etmişlerdir. Mâşiye: Deve, sığır, koyun, keçi mânâlarına gelirse de ekseriyetle koyun hakkında kullanılır. Meşrube ve meşrabe: İçerisinde zahire ve eşya muhafaza edilen kilerdir. Bu kelime hassaten meşrabe şeklinde kullanılırsa, su yeri; mişrabe de su kabı mânâsına gelir. Hızâne muhafazası istenilen şeyin yeri veya kabıdır. Fe yüntesele: Saçılmasını demektir. Bu kelime birinci rivayetteki «aşırılmasını» kelimesinin yerine kullanılmıştır. Duru': Dır'ın cem'idir. Dır' hayvanın yelini yâni sütünün toplandığı yerdir. Resulü Ekrem (Sallallahu Aleyhi ve Sellem) hayvanın yelinindeki sütü, kiler veya anbarda saklanan zahireye benzetmiştir. Yâni bir kimsenin izni olmaksızın anbarındaki zahiresini almak nasıl helâl değilse, davarının sütünü sağmak da helâl değildir. Bu hususta hurma, üzüm ve karpuz gibi şeylerin hüküm i'tibari ile sütten bir farkı yoktur. Ancak süt meselesinde insanlar daha lâkayıd davrandıkları için hassaten zikredilmiştir. Kurtubi diyor ki: «Cumhura göre sahibinin rızâsı olmadan ne davarın sütünden bir şey helâl olur ne de hurmadan! Bâzıları sahibinin haberi olmasa da bu gibi şeylerin helâl sayılacağını söylemiş; ve: Çünkü bu Şâri' hazretlerinin ona bahşettiği bir haktır; demişlerdir...» Sahibinden izin almadan onun davarını sağmayı, yemişinden yemeyi mubah hatta bir hak sayanlar bâzı hadîslerle istidlal ederler. Şöyle ki: Ebû Davud'un Semûra (Radiyallahu anh}'dan tahrîc ettiği bîr hadîste Nebi (Sallallahu Aleyhi ve Sellem): «Bîriniz bir davar sürüsünün yanına vardığı zaman şayet sahibi orada ise ondan izin istesin! Kendisine izin verirse ne âlâ! Vermezse hemen davarı sağıp sütünü içsin! Sahibi orada yoksa üç defa seslensin! Cevap verirse ondan izin istesin! İzin verirse ne âlâ! Vermezse hemen davarı sağıp sütünü içsin! Ama alıp götürmesin!» buyurmuşlardır. Bu hadîsi Tirmizi dahî rivayet etmiş; ve: «Semûra hadîsi hasen garîb, sahîh bir hadîstir. Ulemadan bazıları bununla âmel etmişlerdir...» demiştir. Filhakika İmam Ahmed'le îshâk'ın mezhepleri budur. Tirmizî ile ibni Mâce'nin «Sünen»lerinde buna benzer rivayetler vardır. Bunların birinde süt meselesinden sonra: «Bir bahçeye geldiğin vakit üç defa haykır! Şayet sana icabet ederse ne âlâ! Etmezse ifsad etmemek şartı ile hemen ye!» Buyurulmaktadır. Bir delilleri de hicret esnasında Nebi (Sallallahu Aleyhi ve Sellem) ile Hz. Ebû Bekr'in bir çobanın koyunlarından süt içmeleridir. Hanefîlerle, Şâfiîler'e, Mâlikıler'e ve cumhûr-u ulemâya göre izinsiz hiç bir kimse birinin bağ ve bahçesinden yemiş yiyemez; davarının sütünü içemez. Meğer ki muztar kala! O zaman zaruret miktarı yiyip içebilir. Bu zevat cevaz bildiren hadîsler hakkında muhtelif yönlerden cevaplar vermişlerdir. a) Kurtubî: «Malûm kaide ile amel etmek daha iyidir.» demiştir. b) Nehî bildiren hadîs, cevaz hadîsinden daha sahihtir. c) Cevaz bildiren hadîsler âdete nazaran mal sahiplerinin razı olduklarının bilinmesine hamledilirler. d) Cevaz meselesi zaruret zamanlarına hamledilir. Nitekim islâm'ın ilk zamanlannda hâl böyle idi. Bu hususta Tahâvi de şunları söylemiştir: «Bu hadîsler misafir kabul etmenin vâcib olduğu zamanlara mahsustur. Resûlullah (Sallallahu Aleyhi ve Sellem) bunu emir buyurmuş; gelen misafir için hane sahibine vacip kılmıştır. Bilâhare vücup neshedilerek hükmü kaldırılınca adı geçen hadîslerin hükmü de kalkmıştır.» Hicret esnasında Nebi (Sallallahu Aleyhi ve Sellem) ile Hz. Ebû Bekr'in içtikleri süt hakkmda Kurtubî: «Bu Koyun sahibine bir idlâl (yâni nazı geçme) idî. Çünkü Hz. Ebû Bekir onu tanıyordu. Yahut o çobanın oradan geçenlere süt takdim edilmesine izin verdiğini bilirdi. Yahut o süt, kendisine emân verilmemiş bir harbîye ait olduğu için içmişlerdi...» diyor. Bu hususta daha başka sözler de söylenmiştir",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4513,
			"arabicnumber": "48.02",
			"text": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Leys, Saîd b. Ebî Saîd'den, o da Ebû Şüreyh El-Adevî'den naklen rivayet etti ki, şöyle demiş : ResûluIIah (Sallallahu Aleyhi ve Sellem) konuşurken kulaklarım duydu ve gözlerim gördü; buyurdular ki: «Her kîm Allah'a ve son güne îmân ediyorsa misafirine caizesini ikram etsin!» Ashab: — Onun caizesi nedir yâ Resûlâllah? dediler. «Günü ile gecesîdir. Misafirlik üç gündür. Bundan ötesi ona sadakadır.» buyurdu. Birde: «Her kim Allah'a ve son güne îmân ediyorsa (ya) hayır söylesin yahut sussun!» buyurdular",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4514,
			"arabicnumber": "48.03",
			"text": "Bize Ebû Kureyb Muhammed b. El-Alâ' rivayet etti. (Dediki): Bize Vekî' rivayet etti. (Dediki): Bize Abdülhamîd b. Cafer, Said b. Ebî Saîd EI-Makburî'den, o da Ebû Şüreyh El-Huzâî'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Misafiriik üç gündür. Misafirin caizesi de bir gün bir gecedir. Müslüman bîr adama dîn kardeşinin yanında onu günaha sokacak kadar (fazla) kalması helâl olmaz!..» buyurdu. Ashâb: — Yâ Resûlâllah, onu nasıl günaha sokar? dediler. «Onun yanında oturur kalır; kendisini ağırlayacak bir şeyi de yoktur!» buyurdular",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4515,
			"arabicnumber": "48.04",
			"text": "Bize bu hadîsi Muhammed b. El-Müsennâ da rivayet etti. (Dediki): Bize Ebû Bekir (yâni El-Hanefî) rivayet etti. (Dediki): Bize Abdülhamîd b. Ca'fer rivayet etti. (Dediki): Bize Saîd El-Makburî ri­vayet etti. Kendisi Ebû Şüreyh El-Huzâî'yi şöyle derken İşitmiş: «Resûlullah (Sallallahu Aleyhi ve Sellem) bunu söylerken kulaklarım duydu, gözüm gördü ve kalbim belledi...» Müteakiben râvi, Leys'in hadîsi gibi nakletmiştir. Bu hadîste o Vekî'in hadîsinde olduğu gibi: «Hiç birinize dîn kardeşinin yanında onu günaha sokacak kadar katması helâl olmaz!» cümlesini de zikretti",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4516,
			"arabicnumber": "1727",
			"text": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Leys rivayet etti. H. Bize Muhammed b. Rumh da rivayet etti. (Dediki): Bize Leys, Yezîd b. Eb! Habîb'ten, o da Ebû'l-Hayr'dan, o da Ukbetü'bnü Amir'den naklen haber verdiki, şunları söylemiş: Biz: — Yâ Resûlâllah! Sen bizi gönderiyorsun; biz de bir kavme misafir oluyoruz; ama onlar bize ikramda bulunmuyorlar; ne buyurursun? dedik. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) bize : «Bir kavme misafir olur da sizin için misafire yaraşan şeyleri emrederlerse kabul edin ! Bunu yapmazlarsa kendilerine yaraşan misafir hakkını onlardan alın !» buyurdular",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4517,
			"arabicnumber": "1728",
			"text": "Bize Şeybân b. Ferrûh rivayet etti. (Dediki): Bize Ebû'l-Eşheb, Ebû Nadra'dan, o da Ebû Saîd-i Hudrî'den naklen rivayet etti. Şöyle demiş: Bir defa biz Nebi (Sallallahu Aleyhi ve Sellem)'le beraber bir seferde iken devesi üzerinde bir adam geliverdi. Ve gözünü sağa sola çevirmeye başladı. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Kimin yanında fazla hayvan varsa onu hayvanı olmayana versin! Ve kimin fazla azığı varsa onu azığı olmayana versin!» buyurdular. Râvi demiş ki: Mal çeşitlerinden söylediğini söyledi. Hattâ bir artan malda hiç birimizin hakkı olmadığı düşüncesine vardık",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4518,
			"arabicnumber": "1729",
			"text": "Bana Ahmed b. Yûsuf El-Ezdî rivayet etti. (Dediki): Bize Nadr (yâni İbni Muhammed El-Yemâmî) rivayet etti. (Dediki): Bize İkrime —ki İbni Ammâr'dır— rivayet etti. (Dediki): Bize İyâs b. Seleme, babasından naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte bir gazaya çıktık da bize kıtlık isabet etti. Hattâ bazı binek develerimizi boğazlamayı gönülden geçirdik. Derken Nebiyyullah (Sallallahu Aleyhi ve Sellem) emir buyurdu da yiyecek kaplarımızı topladık. Bunların mecmuu için de (yere) bir yaygı serdik. Artık cemaatin yiyecekleri yaygının üzerinde toplandı. Ben toplananın ne kadar olduğunu tahmin için uzandım: Ve onu keçi ağılı kadar tahmin ettim. Halbuki biz yüz ondört kişi idik. Hepimiz doyuncaya kadar yedik. Sonra dağarcıklarımızı doldurduk. Müteakiben Nebiyyullah (Sallallahu Aleyhi ve Sellem): «Abdest suyu var mı?» diye sordu. Bunun üzerine bir adam içinde biraz su bulunan matarasını getirdi; ve onu bir tasa boşalttı. Artık hepimiz abdest aldık. Yüz on dört kişi onu şarıl şarıl döküyorduk!.. Râvi demiş ki; Bundan sonra sekiz kişi daha geldi; ve abdest suyu var mı? diye sordular. Fakat Resûlullah (Sallallahu Aleyhi ve Sellem): «Abdest suyu bitti!» buyurdular",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 20
			}
		}
	]
}