{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4519,
			"arabicnumber": "1730.01",
			"text": "Bize Yahya b. Yahya Et-Temîmî rivayet etti. (Dediki): Bize Süleym b. Ahdar, ibni Avn'dan naklen rivayet etti. (Demişki): Nâfi'ye mektup yazarak harpten evvel (dine) nasıl davet edileceğini sordum. O da bana: «Bu ancak islâm'ın ilk zamanlarında idi. Resûlullah (Sallallahu Aleyhi ve Sellem) Benî Mustalik kabilesine gafil bulundukları, hayvanlarının suya götürüldüğü bir sırada baskın yapmış; savaşa yarayanlarını öldürmüş; geri kalanlarını da esir almıştır. Yahya demiş ki: Zannederim Süleym, Hâris'in kızı Cüveyriye'yi o gün aldı, dedi. (Yahut yüzde yüz Hâris'in kızı Cüveyriye'yi o gün aldı, dedi.) Bana bu hadîsi Abdullah b. Ömer de rivayet etti. Kendisi o orduda imiş» diye cevâp yazdı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4520,
			"arabicnumber": "1730.02",
			"text": "{…} Bize Muhammed b. El-Müsennâ da rivayet etti. (Dediki): Bize ibni Ebî Adiy, ibni Avn'dan bu isnadla bu hadisin mislini rivayet etti. Ve: «Hâris'in kızı Cüveyriye'yi» dedi. Şekk etmedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4523,
			"arabicnumber": "1731.03",
			"text": "Bana Haccâc b. Eş-Şâir de rivayet etti. (Dediki): Bana Abdüssamed b. Abdilvâris rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Bana Alkame b. Mersed rivayet etti. Ona da Süleyman b. Büreyde, babasından naklen rivayet etmiş. Babası şöyle demiş: «Resûlullah (Sallallahu Aleyhi ve Sellem) bir kumandan veya müfreze gönderdiği zaman onu çağırır da kendisine tavsiyede bulunurdu...» Râvi hadîsi, Süfyân'ın hadîsi mânâsında nakletmiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4524,
			"arabicnumber": "1731.04",
			"text": "Bize ibrahim rivayet etti. (Dediki): Bize Muhammed b. Abdilvehhâb El-Ferrâ' Hüseyn b. Velîd'den, o da Şu'be'den bu isnadla rivayette bulundu",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4525,
			"arabicnumber": "1732",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Ebû Kûreyb rivayet ettiler. Lâfız Ebû Bekr'indir. (Dedilerki): Bize Ebû Usâme, Büreyd b. Abdillâh'dan, o da Ebû Bürde'den, o da Ebû Musa'dan naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) ashabından birini bir hangi işi hususuna gönderdiği vakit: «Sevindirin; nefret ettirmeyin! Kolaylaştırın; güçleştirneyin!» buyururdu. İzah 1734 te",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4526,
			"arabicnumber": "1733.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Vekî', Şu'be'den, o da Saîd b. Ebî Bürde'den, o da babasından, o da dedesinden naklen rivayet ettiki, Nebi (Sallallahu Aleyhi ve Sellem) kendisini Muâz'Ia birlikte Yemen'e göndermiş; ve : «Kolaylaştırın! Güçleştirmeyin! Sevindirin! Nefret ettirmeyin! Uyuşun! ihtilâf etmeyin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4527,
			"arabicnumber": "1733.02",
			"text": "{…} Bize Muhammed b. Abbâd da rivayet etti. (Dediki): Bize Stifyân, Amr'dan naklen rivayet etti. H. Bize İshâk b. ibrahim ile ibni Ebî Halef de Zekeriyyâ b. Adiy'den rivayet ettiler. (Dedilerki): Bize Ubeydullah, Zeyd b. Ebî Üneyse'den naklen haber verdi Her iki râvi Saîd b. Ebî Bürde'den, o da babasından, o da dedesinden, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen Şu'be'nin hadîsi gibi rivayette bulunmuşlardır. Yalnız Zeyd b. Ebî Üneyse'nin hadîsinde: «Uyuşun! ihtilâf etmeyin!» cümlesi yoktur. İzah 1734 te Bu sayfanın devamı Emaret bahsinde geçiyor. O sayfa için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4528,
			"arabicnumber": "1734",
			"text": "Bize Ubeydullah b. Muâz El-Anberî rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, Ebû't-Teyyâh'dan, o da Enes'den naklen rivayet etti. H. Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Ubeydullah b. Saîd rivayet etti. H. Bize Muhammed b. Velîd de rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. Her iki râvi Şu'be'den, o da Ebû't-Teyyâh'dan naklen rivayette bulunmuşlardır. Ebû't-Teyyâh şöyle demiş: Ben Enes b. Mâlik'i şunu söylerken işittim: Resûlullah (Sallallahu Aleyhi ve Sellem): «Kolaylaştırın! Güçleştirmeyin! Teskin edin! Nefret ettirmeyin!» buyurdu",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4529,
			"arabicnumber": "1735.01",
			"text": "Bize Ebû Bekir b. Ebi Şeybe rivayet etti. (Dediki): Bize Muhammed b. Bişr ile Ebû Usâme rivayet ettiler. H. Bana Züheyr b. Harb ile Ubeydullah b. Saîd (yâni Ebû Kudâmete's-Serahsî) de rivayet ettiler. (Dedilerki): Bize Yahya —ki Kattân'dir— rivayet etti. Bunların hepsi Ubeydullah'dan rivayet etmişlerdir. H. Bize Muhammed b. Abdillâh b. Numeyr dahî rivayet etti. Lâfız onundur. (Dediki): Bize babam rivayet etti. (Dediki): Bize Ubeydullah, Nâfi'den, o da ibni Ömer'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Allah kıyamet gününde gelmiş geçmiş bütün insanları bir araya topladığı vakit her vefasız için bir sancak çekilecek; ve: işte fülân oğlu fülânın vefasızlığı budur! denilecektir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4530,
			"arabicnumber": "1735.02",
			"text": "{…} Bize Ebû'r-Rabi' El-Ateki rivayet etti. (Dediki): Bize Hammâd rivayet etti. (Dediki): Bize Eyyûb rivayet etti. H. Bize Abdullah b, Abdirrahmân Ed-Dârimî de rivayet etti. (Dediki): Bize Affân rivayet etti. (Dediki): Bize Sahr b. Cüveyriye rivayet etti. Bu râvilerin ikisi de Nâfi'den, o da ibni Ömer'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsi rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4531,
			"arabicnumber": "1735.03",
			"text": "Bize Yahya b. Eyyûb ile Kuteybe ve ibni Hucr da ismâîl b. Ca'fer'den, o da Abdullah b. Dinar'dan naklen rivayet ettiler ki, îbni Dinar, Abdullah b. Ömer'i şöyle derken işitmiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Şüphesiz ki vefasız için kıyamet gününde Allah bir sancak dikecek ve: Dikkati.. Bu fülânın vefasızlığıdır! denilecektir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4532,
			"arabicnumber": "1735.04",
			"text": "Bana Harmeletü'bnü Yahya rivayet etti. (Dedi ki: Bize ibni Vehb haber verdi. (Dediki): Bana Yûnus, ibni Şihâb'dan, o da Abdullah'ın iki oğlu Hamza ile Sâlim'den naklen haber verdi ki, Abdullah b. Ömer şöyle demiş: Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i: «Kıyamet gününde her vefasız için bir sancak olacaktır.» buyururken işittim. İzah 1738 de",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4533,
			"arabicnumber": "1736.01",
			"text": "Bize Muhammed b. El-Müsennâ ile ibni Beşşâr da rivayet ettiler. (Dedilerki): Bize ibni Ebî Adiy rivayet etti. H. Bana Bişr b. Halid dahî rivayet etti. (Dediki): Bize Muhammed (yâni ibni Ca'fer) haber verdi. Bunların ikisi de Şu'be'den, o da Süleyman'dan, o da Ebû Vâil'den, o da Abdullah'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etmişlerdir. «Kıyamet gününde her vefasız için bir sancak olacak: Bu fülânın vefasızlığıdır; denilecektir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4534,
			"arabicnumber": "1736.02",
			"text": "{…} Bize bu hadîsi ishâk b. ibrahim de rivayet etti. (Dediki): Bize Nadr b. Şümeyl haber verdi. H. Bana Ubeydullah b. Saîd dahî rivâyet etti. (Dediki): Bize Abdurrahmân rivayet etti. Bunların hepsi Şu'be'den bu isnâdla rivayette bulunmuşlardır. Yalnız Abdurrahmân'ın hadîsinde: «Bu fülânın vefasızlığıdır; denilecektir.» cümlesi yoktur",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4535,
			"arabicnumber": "1736.03",
			"text": "Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki); Bize Yahya b. Âdem, Yezîd b. Abdilâzîz'den, o da A'meş'den, o da Şakîk'dan, o da Abdullah'dan naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Kıyamet gününde her vefasız için bir sancak olacak; onunla tanınacak: Bu fülânın vefasızlığıdır; denilecektir.» buyurdular. İzah 1738 de",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4536,
			"arabicnumber": "1737",
			"text": "Bize Muhammed b. El-Müsennâ ile Ubeydullah b. Saîd rivayet ettiler. (Dedilerki): Bize Abdurrahman b. Mehdi, Şu'be'den, o da Sabit'den, o da Enes'den naklen rivayet etti. Enes şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Kıyamet gönünde her vefasız ign bir sancak olacak; onunla bilinecektir.» buyurdular. İzah 1738 de",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4537,
			"arabicnumber": "1738.01",
			"text": "Bize Muhammed b. El-Müsennâ ile Ubeydullah b. Saîd rivayet ettiler. (Dedilerki): Bize Abdurrahmân rivayet etti. (Dediki): Bize Şu'be, Huleyd'den, o da Ebû Nadra'dan, o da Ebû Saîd'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. «Kıyamet gününde her vefasız için arkasında bir sancak olacaktır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4538,
			"arabicnumber": "1738.02",
			"text": "Bize Züheyr b. Harb rivayet etti. (Dediki): Bize Abdüssamed b. Abdilvâris rivayet etti. (Dediki): Bize Müstemir b. Keyyân rivayet etti. (Dediki); Bize Ebû Nadra, Ebû Saîd'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Kıyamet gününde her vefasız için bir sancak olacak; kendisi için vefasızlığı mikdarı dikilecektir. Dikkat edin ki, gadir i'tibari ile âmmeyi idare edenden daha büyük vefasız yoktur.» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4539,
			"arabicnumber": "1739",
			"text": "Bize Aliyyü'bnü Hucr Es-Sa'dî ile Amru'n-Nâkıd ve Züheyr b. Harb rivayet ettiler. Lâfız Alî ile Züheyr'indir. (Alî: Ahberanâ tabirini kullandı, ötekiler: Haddesena dediler.) Süfyân şöyle demiş : Amr, Câbir'i şunları söylerken işitmiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Harb hileden ibarettir.» buyurdular. İzah 1740 da",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4540,
			"arabicnumber": "1740",
			"text": "Bize Muhammed b. Abdirrahmân b. Sehm de rivayet etti. (Dediki): Bize Abdullah b. Mübarek haber verdi. (Dediki): Bize Ma'mer, Hemmâm b. Münebbih'den, o da Ebû Hureyre'den naklen haber verdi. Ebû Hureyre şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Harb hileden ibarettir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4541,
			"arabicnumber": "1741",
			"text": "Bize Hasen b. Aliy El-Hulvanî ile Abd b. Humeyd ri­vayet ettiler. (Dedilerki): Bize Ebû Âmir El-Akadî, Muğîre'den —ki ibni Abdirrahnıan El-Hizâmî'dir— o da Ebû'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hureyre'den naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Seilem); «Düşmanla karşılaşmayı temenni etmeyin; ama onlarla karşılaştığınız vakit sabredin!» buyurmuşlar. İzah 1742 de",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4542,
			"arabicnumber": "1742.01",
			"text": "Bana Muhammed b. Râfi' de rivayet etti. (Dediki): Bize Abdürrezzâk rivayet etti. (Dediki): Bize ibni Cüreyc haber verdi. (Dediki): Bana Mûsâ b. Ukbe, Ebû'n-Nadr'dan, o da Eslem (kabilesinden Nebi (Sallallahu Aleyhi ve Sellm)'in ashabından Abdullah b. Ebî Evfâ denilen bir zatın kitabından naklen haber verdi. Ömer b. Ubeydillâh Harûriler üzerine yürüdüğü vakit Abdullah kendisine mektup yazarak, Resûlullah (Sallallahu Aleyhi ve Sellm)'in düşmanla karşılaştığı bir gününde beklediğini, tâ güneş (batıya) meylettiği zaman aralarında ayağa kalkarak: «Ey nâs! Düşmanla karşılaşmayı temenni etmeyin! Allah'dan afiyeti isteyin! Onlarla karşılaştığınız zaman da sabredin! Bilin ki, cennet kılıçların gölgeleri altındadır.» buyurduğunu; sonra Nebi (Sallallahu Aleyhi ve Sellm) (tekrar) kalkarak: «Allahım! Ey kitabı indiren, bulutu hareket ettiren ve hizibleri bozguna uğratan! Bunları perişan et! Ve bizi onlar üzerine muzaffer kıl!» dîye duâ ettiğini ona haber vermiş. Dikkat izah’tan sonra da hadis var",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4543,
			"arabicnumber": "1742.02",
			"text": "Bize Saîd b. Mansûr rivayet etti. (Dediki): Bize Hâlid b. Abdillâh, İsmâîl b. Ebî Hâlid'den, o da Abdullah b. Ebî Evfâ'dan nak­len rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem), Hiziblerin aleyhine dua etti ve: «Allahım! Ey kitabı indiren! Hesabı sür'atli olan! Bu hizibieri bozguna uğrat! Allahım! Bunları bozguna uğrat ve târu mâr et!» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4544,
			"arabicnumber": "1742.03",
			"text": "Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Veki' b. Cerrah, İsmâîl b. Ebî Hâlid'den naklen rivayet etti. (Demiş ki) : Ben îbni Ebî Evfâ'ya şöyle derken işittim: Resûlullah (Sallallahu Aleyhi ve Sellem) Hâlid'in hadîsi gibi dua etti. Yalnız o: «Hizibleri bozguna uğratan» demiş; «Allahım» sözünü zikretmemiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4545,
			"arabicnumber": "1742.04",
			"text": "{…} Bize bu hadîsi ishâk b. ibrahim ile ibni Ebî Ömer de hep beraber îbni Uyeyne'den, o da ismail'den bu isnâdla rivayet ettiler, İbni Ebî Ömer kendi rivayetinde «Rüzgârı hareket ettiren!» ifadesini ziyade etti",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4546,
			"arabicnumber": "1743",
			"text": "Bana Haccâc b. Eş-Şâir de rivayet etti. (Dediki): Bize Abdüssamed rivayet etti. (Dediki): Bize Hammâd, Sâbit'ten, o da Enes'den naklen rivayet ettiki, Resûlullah (Sallallahu Aleyhi ve Sellem), Uhud (harbi) gününde: «Allahım! Sen dilersen yeryüzünde sana ibâdet edecek kimse kalmaz!» diye duâ ediyormuş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4547,
			"arabicnumber": "1744.01",
			"text": "Bize Yahya fa. Yahya ile Muhammed b. Rumh rivayet ettiler. (Dedilerki): Bize Leys haber verdi. H. Bize Kuteybetü'bnü Saîd de rivayet etti. (Dediki): Bize Leys, Nâfi'den, o da Abdullah'dan naklen rivayet etti ki, Resûlullah (Sallallahu Aleyhi ve Sellem)'in gazalarından birinde bir kadın öldürülmüş olarak bulunmuş. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) kadınlarla çocukların öldürülmesini yasak etmiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4548,
			"arabicnumber": "1744.02",
			"text": "Bize Ebû Bekir b. Ebi Şeybe rivayet etti. (Dediki): Bize Muhammed b. Bişr ile Ebû Usâme rivayet ettiler. (Dedilerki): Bize Ubcydullah b. Ömer, Nâfi'den, o da İbni Ömer'den naklen rivayet etti. Şöyle demiş: Bu gazalardan birinde bir kadın öldürülmüş olarak bulundu. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) kadınlarla çocukları öldürmeyi yasak etti",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4549,
			"arabicnumber": "1745.01",
			"text": "Bize Yahya b. Yahya ile Saîd b. Mansur ve Amru'n-Nâkıd, toptan ibni Uyeyne'den rivayet ettiler. Yahya (Dediki): Bize Süfyân b. Uyeyne, Zührî'den, o da Ubeydullah'dan, o da ibni Abbas'dan, o da Sa'b b. Cessâme'den naklen haber verdi. Sa'b şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem)'e müşriklerden gece baskınına uğrayan zürriyetlerin hükmü soruldu. Bu suretle müslümanlar onların kadınlarına ve çocuklarına isabet ediyorlardı. Nebi (Sallallahu Aleyhi ve Sellem): «Onlar onlardandır.:) buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4550,
			"arabicnumber": "1745.02",
			"text": "Bize Abd b. Humeyd rivayet etti. (Dediki): Bize Abdürrazzâk haber verdi. (Dediki): Bize Ma'mer, Zührî'den, o da Ubeydullah b. Abdillâh b. Utbe'den, o da Ibni Abbâs'dan, o da Sa'b b. Cessâme'den naklen haber verdi. (Şöyle demiş) : — Yâ Resûlâllah! Biz gece baskınında müşriklerin zürriyetlerine isabet ediyoruz! dedim, «Onlar onlardandır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4551,
			"arabicnumber": "1745.03",
			"text": "Bana Muhammed b. Râfi' de rivayet etti. (Dediki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize ibni Cüreyc haber verdi. (Dediki): Bana Amr b. Dînâr haber verdi. Ona da ibni Şihâb, Ubeydullah b. Abdillâh b. Utbe'den, o da ibni Abbâs'dan, o da Sa'b b. Cessâme'den naklen haber vermişki, Nebi (Sallallahu Aleyhi ve Sellem)'e: Bir suvâri gurubu geceleyin baskın yapsa da müşriklerin çocuklarından bazılarına isabet etse ne buyurursun? demişler. «Onlar bobalarındandır!» buyurmuş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4552,
			"arabicnumber": "1746.01",
			"text": "Bize Yahya b. Yahya ile Muhammed b. Rumh rivayet ettiler. (Dedilerki): Bize Leys haber verdi. H. Bize Kuteybetü'bnü Saîd de rivayet etti. (Dediki): Bize Leys, Nâfi'den, o da Abdullah'dan naklen rivayet ettiki, Resûlullah (Sallallahu Aleyhi ve Sellem) Benî Nadîr'in hurmalarını yakmış ve kesmiş. Bu yer Büveyre'dir. Kuteybe ile ibni Rumh kendi hadîslerinde şunu ziyade ettiler: «Bunun üzerine Allah (Azze ve Celle): Yaş ağaç nâmına her neyi keser veya kökleri üstünde ayakta bırakırsanız (bu) Allah'ın izniyledir: Hemde yoldan çıkanları rezîl etsin diye! [Haşr 5] âyet-i kerîmesini indirdi.»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4553,
			"arabicnumber": "1746.02",
			"text": "Bize Saîd b. Mansûr ile Hennâd b. Seriy rivayet ettiler. (Dedilerki): Bize ibni'l-Mübârek, Mûsâ b. Ukbe'den, o da Nâfi'den, o da İbni Ömer'den naklen rivayet etti ki, Resûlullah (Sallallahu Aleyhi ve Sellem) Benî Nadîr'in hurmalarını kesmiş ve yakmıştır, Hassân şu beyti bu hâdise için söylemiştir: «Büveyre'de uçuşan yangın, Benî Lüey eşrafına ehemmiyetsiz geldi.» «Yaş ağaç nâmına her neyi keser veya kökleri üstünde ayakta bırakırsanız...» âyet-i kerîmesi de bu hususta indi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4554,
			"arabicnumber": "1746.03",
			"text": "Bize Sehl b. Osman da rivayet etti. (Dediki): Bana Ukbetü'bnü Hâlid Es-Sükûnî, Ubeydullah'dan, o da Nâfi'den, o da Abdullah b. Ömer'den naklen haber verdi. (Şöyle demiş) : Resûlullah (Sallallahu Aleyhi ve Sellem} Benî Nadîr'in hurmalarını yaktı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4555,
			"arabicnumber": "1747",
			"text": "Bize Ebû Kureyb Muhammed b. Alâ* rivayet etti. (Dediki): Bize ibni'I-Mubârek, Ma'merden naklen rivayet etti. H. Bize Muhammed b. Râfi' de rivayet etti. Lâfız onundur. (Dediki): Bize Abdürrazzâk, rivayet etti. (Dediki): Bize Ma'mer, Hemmâm b. Münebbih'den naklen haber verdi. Hemmâm : Bize Ebû Hureyre'nin Resûlullah (Sallallahu Aleyhi ve Sellem)'den rivayet ettiği budur, diyerek bir takım hadîsler zikretmiştir; ezcümle, Resûlullah (Sallallahu Aleyhi ve Sellem): «Nebilerden bir Nebi gazaya çıktı da kavmine şunları söyledi: Nikâhla bir kadına mâlik olup da onunla gerdeğe girmeyi istediği halde henüz girememiş bir adam benim arkamdan gelmesin! Başka biri ev yapmış, fakat tavanını çekememişse (o da gelmesin!) Bir başkası koyun veya gebe develer satın almış da doğurmalarını bekliyorsa (o da gelmesini). Bunu müteakib gazaya çıktı; ve o yere ikindi namazı vakti yahut ona yakın bir zamanda yaklaştı; ve güneşe: Sen me'mursun ama ben de me'murum! Allahım, bunu benim üzerimde biraz durdur! dedi. Bunu müteâkıb güneş onun üzerinde Allah o yeri kendisine fethedinceye kadar durduruldu. Derken aldıkları ganimetleri topladılar. Arkacığından onları yemek için ateş geldi: Fakat onları tatmaktan çekindi. Nebi: Sizin içinizde ganimete hiyanet var; o halde bana her kabileden bir adam bey'at etsin! dedi. Bu surette ona bey'at ettiler. Derken bir adamın eli onun eline yapıştı. Nebi: Ganimete hıyanet sizin içinizdedir, bana senin kabilen bey'at etsin! dedi. Bu sefer ona kabilesi bey'at etti. Fakat eli iki veya üç kişinin eline yapıştı; ve (yine): Ganimete hıyanet sizdedir; sizler hıyanet ettiniz! dedi. Nihayet ona inek başı kadar altın çıkardılar; ve onu yerde duran malın içine koydular. Arkasından ateş gelerek o malı yedi. işte ganimetler bizden önce hiç bir kimseye helâl olmamıştır. Bunun sebebi : Çünkü Allah Tebâreke ve Teâlâ bizim za'fımızı ve aczimizi bildi de onu bize tertemiz heiâi kıldı.» buyurmuşlardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4556,
			"arabicnumber": "1748.01",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Ebû Avâne, Simâk'dan, o da Mus'ab b. Sa'd'dan, o da babasından naklen rivayet etti. (Şöyle demiş): Babam (ganimetin) beşte bir (in) den bir kılıç aldı; ve onu Nebi (Sallallahu Aleyhi ve Sellem)'e getirerek: Bunu bana hibe et; dedi. Fakat o razı olmadı. Bunun üzerine Allah (Azze ve Celle); «Sana enfâlin hükmünü soruyorlar. Deki: Enfâi Allah ve Resulüne aiddir...» [Enfal 1] âyet-i kerimesini indirdi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4557,
			"arabicnumber": "1748.02",
			"text": "Bize Muhammed b. El-Müsennâ ile İbni Beşşâr rivayet ettiler. Lâfız Îbni'l-Müsennâ'nındır. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Simâk b. Harb'den, o da Mus'ab b. Sa'd'dan, o da babasından naklen rivayet etti. (Şöyle demiş) : Benim hakkımda dört âyet inmiştir. Bir kılıç ele geçirdim... (Sa'd) bu kılıcı Nebi (Sallallahu Aleyhi ve Sellem)'e getirerek: Yâ Resûlâllah, bu kılıcı bana nefel olarak ver! demiş. Nebi (Sallallahu Aleyhi ve Sellem): «Bırak onu!» buyurmuş. Sonra ayağa kalkmış. Nebi (Sallallahu Aleyhi ve Sellem) kendisine: «Onu aldığın yere koy!» buyurmuş. Sonra (tekrar) ayağa kalkarak: Bunu bana nefel olarak ver yâ Resûlâllah! demiş. (Yine) : «Bırak onu!» buyurmuşlar. (Sa'd tekrar) ayağa kalkarak: Yâ Resûlâllah! Bunu bana nefel olarak ver! Ben (harbde) yeteri olmayanlar gibi mi tutulacağım? demiş. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) kendisine (yine) : «Onu aldığın yere koy!» buyurmuşlar. Arkacığından şu âyet inmiş: Sana enfâlin hükmünü soruyorlar! Deki: Enfal, Allah ve Resulüne aittir!..»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4558,
			"arabicnumber": "1749.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, Nâfî'den dinlediğim, onun da îbni Ömer'den naklettiği şu hadîsi okudum!., İbni Ömer şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem), ten'im de içinde bulunduğum bir seriyyeyi Necid tarafına gönderdi. Asker birçok develeri ganimet olarak aldılar. (Bu ganimetten) hisseleri on ikişer yahut on birer deve idi; kendilerine birer deve de nefel olarak verildi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4559,
			"arabicnumber": "1749.02",
			"text": "Bize Kuteybe b. Saîd de rivayet etti. (Dediki); Bize Leys rivayet etti, H. Bize Muhammed b. Rumh dahî rivayet etti. (Dediki): Bize Leys, Nâfî'den, o da ibni Ömer'den naklen haber verdiki, Resûlullah (Sallallahu Aleyhi ve Sellem), içlerinde İbni Ömer de olduğu halde Necd tarafına bir seriyye göndermiş; ve bunların hisseleri onikişer deveye baliğ olmuş; bundan başka kendilerine birer deve de nefel olarak verilmiş. Resûlullah (Sallallahu Aleyhi ve Sellem) bunu değiştirmemiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4560,
			"arabicnumber": "1749.03",
			"text": "Bize Ebû Bekir b. Ebî Şeybe dahî rivayet etti. (Dediki): Bize Aliy b. Müshir ile Abdürrahîm b. Süleyman, Ubeydullah b. Ömer'den, o da Nâfi'den, o da ibni Ömer'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) Necd'e bir seriyye gönderdi. Ben de o seriyye de (gazaya) çıktım. Binnetîce birçok deve ve koyun ele geçirdik; ve hisselerimiz onikişer deveye baliğ oldu. Resûlullah (Sallallahu Aleyhi ve Sellem) bize birer deve de nefel olarak verdi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4561,
			"arabicnumber": "1749.04",
			"text": "{…} Bize Züheyr b. Harb ile Muhammed b. El-Müsennâ da rivayet ettüer. (Dedilerki): Bize Yahya —ki El-Kattân'dır— Ubeydullah'dan bu isnâdla rivayet etti",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4562,
			"arabicnumber": "1749.05",
			"text": "{…} Bize bu hadîsi Ebû'r-Rabî' ile Ebû Kâmil de rivayet ettiler. (Dedilerki): Bize Hammâd, Eyyûb'dan rivayet etti. H. Bize ibni'l-Müsenna dahî rivayet etti. (Dediki): Bize İbni Ebî Adiy, İbni Avn'dan rivayet etti. (Demişki): Nâfi'e mektub yazarak nefel'in ne olduğunu sordum. O da bana cevap yazdı ki, İbni Ömer bir seriyyede imiş. H. Bize ibni Râfi' de rivayet etti. (Dediki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize ibni Cüreyc haber verdi. (Dediki): Bana Mûsâ haber verdi. H. Bize Hârûn b. Saîd EI-Eylî dahi rivayet etti. (Dediki): Bize ibni Vehb rivayet etti. (Dediki): Bana Usâme b. Zeyd haber verdi. Bu râvilerin hepsi Nâfi'den bu isnâdla yukarıkilerin hadîsi gibi rivayette bulunmuşlardır. İzah 1750 de",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4563,
			"arabicnumber": "1750.01",
			"text": "Bize Süreye b. Yûnus ile Amru'n-Nâkıd da rivayet ettiler. Lâfız Süreye'nindir. (Dedilerki): Bize Abdullah b. Recâ', Yûnus'dan, o da Zührî'den, o da Sâlim'den, o da babasından naklen rivayet etti. (Şöyle demiş) : Bize Resûlullah (Sallallahu Aleyhi ve Şellem) beşte birdeki nasibimizden başka nefel verdi de bana bir şârif isabet etti. (Şârif yaşlı, büyük devedir)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4564,
			"arabicnumber": "1750.02",
			"text": "Bize Hennâd b. Seriy de rivayet etti. (Dediki): Bize ibni'l-Mübârek rivayet etti. H. Bana Harmeletü'bnü Yahya dahî rivayet etti. (Dediki): Bize ibni Vehb haber verdi. Her iki râvi Yûnus'dan, o da ibni Şihâb'dan naklen rivayette bulunmuşlardır. îbni Şihâb şöyle demiş : Bana ibni Ömer'den naklen ulaştı; şöyle demiş: «Resûlullah (Sallallahu Aleyhi ve Şellem) bir seriyyeye nefel verdi...» ibni Recâ' hadîsi gibi rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4565,
			"arabicnumber": "1750.03",
			"text": "Bize Abdülmelik b. Şuayb b. Leys de rivayet etti. (Dediki): Bana babam, dedemden rivayet etti. (Demişki): Bana Ukayl b. Halid, ibni Şihâb'dan, o da Salim'den, o da Abdullah'dan naklen rivayet etti ki, ResûlullIah (Sallallahu Aleyhi ve Sellem) gönderdiği bâzı seriyyelere, hassaten kendilerinin olmak üzere, umum ordunun hissesinden başka nefel verirmiş. Beşte bir de bütün bunda vâcibmiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4566,
			"arabicnumber": "1751.01",
			"text": "Bize Yahya b. Yahya Et-Temimi rivayet etti. (Dediki): Bize Huşeym, Yahya b. Saîd'den, o da Ömer b. Kesir b. Eflah'dan, o da Ebu Muhammed El-Ensari'den —ki bu zat Ebu Katâde'nin arkadaşı imiş— naklen haber verdi. (Demişki): Ebu Katade şunu söyledi... Ve hadîsi hikâye etmiştir. HADİS’İN METNİ EBU’T-TAHİR RİVAYETİNDEDİR",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4567,
			"arabicnumber": "1751.02",
			"text": "{…} Bize Kuteybe b. Saîd de rivayet «tti. (Dediki): Bize Leys, Yahya b. Saîd'den, o da Ömer b. Kesîr'den, o da Ebû Katâde'nin dostu Ebû Muhammed'den naklen rivayet ettiki, Ebû Katâde şunları söylemiş... Ve hadîsi nakletmiştir. HADİS’İN METNİ AŞAĞIDAKİ EBU’T-TAHİR RİVAYETİNDEDİR EBU’T-TAHİR RİVAYETİ:",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4568,
			"arabicnumber": "1751.03",
			"text": "{…} Bize Ebâ't-Tâhir ile Harmele de rivayet ettiler. Lâfız Harmele'nindir. (Bedilerki): Bize Abdullah b. Vehb haber verdi. (Dediki): Mâlik b. Enes'i şunları söylerken işittim: Bana Yahya b. Said, Ömer b. Kesir b. Eflâh'dan, o da Ebu Katâde'nin dostu Ebû Muhammed'den, o da Ebû Katâde'den naklen rivayet etti. Şöyle demiş: Huneyn (harbi) yılında Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte (gazaya) çıktık, iki ordu karşılaşınca müslümanlarda bir bozulma oldu. Derken müşriklerden bir adam gördüm ki, müslümanlardan bir zâtı alt etmişti. Hemen ona dönerek arkasından yanına geldim ve boynunu vurdum. Ama üzerime dönerek beni öyle bir sıktı ki bundan ölümün korkusunu duydum: Sonra can vererek beni bıraktı. Müteakiben Ömer b. Hattab'a yetiştim: — Bu insanlara ne oldu? dedi. Ben de: — Allah'ın emri! dedim. Sonra cemaat döndüler. Resûlullah (Sallallahu Aleyhi ve Sellem) de oturdu ve: «Bir kimse birini öldürürde onun aleyhine beyyinesi de bulunursa, olenîn üzerindeki eşyası onun olur.» buyurdular. Bunun üzerine ben ayağa kalkarak: — Bana kim şâhidlik edecek? dedim. Sonra oturdum. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) yine deminki gibi buyurdu. Ben hemen kalkarak: — Bana kim şâhidlik edecek? dedim; ve oturdum. Sonra Nebi (Sallallahu Aleyhi ve Sellem) o sözü üçüncü defa tekrarladı. Ben yine kalktım. Fakat Resûlullah (Sallallahu Aleyhi ve Sellem): «Sana ne oldu yâ Ebâ Katade?» diye sordu. Ben de kıssayı kendilerine anlattım. Derken cemaattan bir adam: — Doğru söyledi yâ Resûlâllah! Bu öldürülenin üzerindeki eşyası bendedir; hakkından dolayı Ebû Katâde'yi razı ediver! dedi. Ebû Bekr-i Sıddîk ise: —'Hayır vallahi! Bu olamaz! Resûlullah (Sallallahu Aleyhi ve Sellem) Allah ve Resulünün yolunda cenk eden Allah arslanlarından bir arslanın hakkını çiğneyerek onun eşyasını sana veremez! dedi. Artık Resûlullah (Sallallahu Aleyhi ve Sellem): «Doğru söyledi. Bunu ona ver!» buyurdu; ve bana verdi. Sonra zırhı sattım da onunla Benî Selime (kabilesin)'de bir bahçe satın aldım. işte islâm'da ilk edindiğim mal budur. Leys'in hadîsinde şu ibare vardır: «Ebû Bekir: Asla! Allah'ın arslanlarından bir arslanı bırakıp da onu Kureyş'ten bir sırtlancağiza veremez! dedi.» Yine Leys'in hadîsinde: «Edindiğim ilk maldır.» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4569,
			"arabicnumber": "1752",
			"text": "Bize Yahya b. Yahya Et-Temîmî rivayet etti. (Dediki): Bise Yûsuf b. Mâcişûn, Salih b. ibrahim b. Abdirrahmân b. Avf dan, o da babasından, o da Abdurrahmân b. Avf'dan naklen haber verdi ki, şunları söylemiş: Bedir (harbi) günü ben safta dururken sağıma ve soluma baktım. Gördüm ki Ensârdan iki çocuğun arasındayım! Yaşları genç! Keşke bunlardan daha kuvvetliler arasında olaydım temennisinde bulundum. Derken biri beni dürterek: Ey amca! Ebû Cehli tanırmısın? dedi. — Evet! Ona ne hacetin var ey kardeşim oğlu? dedim. — Haber aldım ki, Resûlullah (Sallallahu Aleyhi ve Sellem)'e söğermiş! Nefsim yed-i kudretinde olan Allah'a yemîn ederim ki, onu görürsem ikimizden eceli gelen ölmedikçe şahsım şahsından ayrılmayacaktır! dedi. Ben buna şaştım. Az sonra diğeri de beni dürttü ve berikinin söylediğinin mislini söyledi. Çok geçmeden Ebû Cehl'i halkın arasında bocalarken gördüm ve: — Görüyor musunuz, işte sorduğunuz sizinki! dedim. Hemen ona koştular ve kılıçları ile onu vurarak öldürdüler. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem)'e giderek kendisine haber verdiler. Nebi (Sallallahu Aleyhi ve Sellem): «Onu hanginiz öldürdü?» dîye sordu. iki gençten her biri: — Ben öldürdüm! cevâbını verdi. «Kılıçlarınızı sildiniz mi?» diye sordu. — Hayır! dediler. Bunun üzerine kılıçlara baktı; ve: «Onu ikiniz de öldürmüşsünüz!» buyurdu. Ve üzerindeki eşyanın Muâz b. Amr b. EI-Memûh'a verilmesine hükmetti. (Bu iki zât Muâz b. Arar b. El-Memûh ile Muâz b. Afrâ'dır)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4570,
			"arabicnumber": "1753.01",
			"text": "Bana Ebû't-Tâhir Ahmed b. Amr b. Şerh rivayet etti. (Dediki): Bize Abdullah b. Vehb haber verdi. (Dediki): Bana Muâviye b. Salih, Abdurrahman b. Cübeyr'den, o da babasından, o da Avf b. Mâlik'den naklen haber verdi. Şöyle demiş: Hımyer (kabilesin) den bîr adam, düşmandan birini öldürdü de eşyasını almak istedi. Hâlid b. Velîd onu men'etti. Hâlid onların üzerine vâlî idi. Derken Avf b. Mâlik, Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek (bunu) kendilerine haber verdi. Bunun üzerine Hâlid'e: «Onun eşyasını buna vermekten seni hangi şey menefti?» buyurdular. Hâlid: — Eşya gözüme çok göründü yâ Resûlâllah! dedi. «Onları kendisine veri» buyurdu. Az sonra Hâlid Avf'ın yanına uğradı. Avf onun cübbesini çekti. Sonra: (Nasıl) Sana Resûlullah (Sallallahu Aleyhi ve Sellem) için söylediğimi yerine getirdim mi? dedi. Resûlullah (Sallallahu Aleyhi ve Sellem) bunu işitti ve canı sıkıldı. Müteakiben: «Ona verme yâ Hâlid! Ona verme yâ Hâlid! Siz kumandanlarımı bana bırakırmısınız hiç! Onlarla sizin misâliniz öyle bir adam'a benzer ki, deve veya koyun çobanı tutulur da onları güder; sonra sulama zamanını kollayıp onları bir havuza getirir; ve oraya girip suyun temizini içer, bulanığını bırakırlar, işte temizi sizin olur, bulanığı da kumandanların üzerine kalır!» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4571,
			"arabicnumber": "1753.02",
			"text": "Bana Züheyr b. Harb da rivayet etti. (Dediki): Bize Velîd b. Müslim rivayet etti. (Dediki): Bize Safvân b. Amr, Abdurrahmân b. Cübeyr b. Nüfeyr'den, o da babasından, o da Avf b. Mâlik El-Eşcaî'den naklen rivayet etti. Şöyle demiş : Mûte gazasında Zeyd b. Hârise'nîn maiyyetinde (gazaya) çıkanlarla birlikte gazaya çıktım. Yemen'den (gelen) bir imdad gâzisi bana arkadaş oldu... Ve hadîsi Nebi (Sallallahu Aleyhi ve Sellem)'den yukarıki hadîs gibi rivayet etti. Yalnız o bu hadîste şunu söyledi: «Avf dediki: Ben de, Yâ Hâlid! Bilmez misin ki Resûlullah (Sallallahu Aleyhi ve Sellem} selebin öldürene verilmesini hüküm buyurdu; dedim. Evet, bilirim; lâkin o benim gözüme çok göründü, cevabını verdi.»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4572,
			"arabicnumber": "1754",
			"text": "Bize Züheyr b. Harb rivayet etti. (Dediki): Bize Ömer b. Yûnus EI-Hanefî rivayet etti. (Dediki): Bize ikrime b. Ammâr ri­vayet etti. (Dediki): Bana iyâs b. Seleme rivayet etti. (Dediki): Bana babam Seleme b. Ekva' rivayet etti. (Dediki): Resulullah (Sallallahu Aleyhi ve Sellem)'le birlikte Hevazin'de gaza ettik. Bir defa onunla beraber kahvaltı yaparken, ansızın kırmızı bir erkek deve üzerinde bîr adam çıkageldi. Devesini çöktürdü. Sonra heybesinden bir ip çıkararak onunla deveyi bağladı. Sonra cemaatla birlikte kahvaltı yapmağa geçti. Ama bakınmağa başladı. Bizde hayvan hususunda az'f ve yufkalık vardı. Bazılarımız piyade idik. Adam birden koşarak çıktı. Hemen devesine geldi ve bağını çözdü. Sonra çöktürdü ve üzerine oturarak onu ayağa kaldırdı. Deve onu koşa koşa götürdü. Derken boz bir dişi deve üzerinde bir adam onun peşine düştü. Seleme demiş ki: Ben de koşarak çıktım; ve dişi devenin çantısı hizasına vardım. Sonra ilerliyerek erkek devenin çantısı hizasına yetiştim. Sonra ilerledim; nihayet erkek devenin yularından tutarak onu çöktürdüm. Dizini yere koyunca kılıcımı çekerek herifin başını kestim; derhal düştü. Sonra deveyi yederek getirdim. Adamın eşyası ve silâhı onun üzerinde idi. Derken beni Resûlullah (Sallallahu Aleyhi ve Sellem)'le yanındaki insanlar karşıladılar. Efendimiz: «Bu adamı kim öldürdü?» diye sordu. — Ekva'ın oğlu! dediler. «Bunun bütün eşyası onundur!:» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4573,
			"arabicnumber": "1755",
			"text": "Bize Züheyr b. Harb rivayet etti. (Dediki); Bize Ömer b. Yûnus rivayet etti. (Dediki): Bize ikrime b. Ammâr rivayet etti. (Dediki): Bana iyâs b. Seleme rivayet etti. (Dediki): Bana babam rivayet etti (Dediki): Fezâre (kabilesi) ile harb ettik. Başımızda Ebû Bekir vardı. Resûlullah (Sallallahu Aleyhi ve Sellem) bize onu kumandan tâ'yin etmişti. Su ile aramızda bir saat mesafe kalınca Ebû Bekir bize emrederek sabaha karşı mola verdik. Sonra süvarileri (hücum için) dağıttı. Az sonra suya vardı; ve onun başında öldürdüğünü öldürdü; kimini de esir aldı. Ben halktan bir cemaata bakıyordum. içlerinde kadın ve çocuklar vardı. Bunların benden önce dağa varacaklarından endîşe ederek onlarla dağın arasına bir ok attım. Oku görünce durdular. Ben de kendilerini sürerek getirdim. içlerinde Beni Fezâre (kabilesinden) bir kadın bulunuyordu. Üzerinde sahtiyandan bir kaş' vardı. Kaş' sahtiyan yaygı demektir. Beraberinde bir kızı Vardı ki, a'rab'ın en güzellerin dendi. Ben bunları sürerek Ebû Bekr'e getirdim. Ebû Bekir de bana o kadının kızını nefel olarak bağışladı. Müteakiben Medine'ye geldik. Ama kızın elbisesini (bile) açmadım. Derken bana Resûlullah (Sallailahu Aleyhi ve Sellem) çarşıda tesadüf etti. Ve: «Yâ Seleme, bu kadını bana hibe et!» dedi. Ben: — Yâ Resûlâllah! Vallahi bu benim pek hoşuma gitti; ama onun elbisesini açmadım; dedim. Sonra ertesi gün çarşıda Resûlullah (Sallallahu Aleyhi ve Sellem): bana (tekrar) rastladı; ve bana: «Yâ Seleme, baban Allah'a emanet, bu kadını bana hibe el!» buyurdular. — O senindir yâ Resûlâllah! Vallahi onun elbisesini açmadım! dedim. Müteakiben Resûlullah (Sallallahu Aleyhi ve Sellem) onu Mekkelilere gönderdi; ve Mekke'de esir edilen bir takım müsliimanlara onu fidye yaptı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4574,
			"arabicnumber": "1756",
			"text": "Bize Ahmed b. Hanbel ile Muhammed b. Râfi' rivayet ettiler. (Dedilerki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize Ma'mer, Hemmâm b. Münebbih'den naklen haber verdi. Hemmâm: Bize Ebâ Hureyre'nin Resûlullah (Sallallahu Aleyhi ve Sellem)'den rivayet ettikleri şunlardır; diyerek bir takım hadîsler zikretmiş; ezcümle şöyle demiştir: Resûlullah (Sallallahu Aleyhi ve Sellem): «Herhangi bir beldeye varır da orada ikâmet ederseniz, hisseniz oradadır. Hangi belde Allah ve Resulüne isyan ederse, o beldenin beşte biri Allah ve Resulün'e âîddir. Sonra o (geri kalanı) sizindir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4575,
			"arabicnumber": "1757.01",
			"text": "Bize Kuteybe b. Saîd ile Muhammed b. Abbâd, Ebû Bekir b. Ebî Şeyi» ve ishâk b. ibrahim rivayet ettiler. Lâfız ibni Ebî Şeybe'nindir. ishâk: (Bize haber verdi): tâbirini kullandı. Ötekiler: Bize Süfyân, Amr'dan, o da Zührî'den, o da Mâlik b. Evs'den, o da Ömer'den naklen rivayet etti, dediler. Ömer şunları söylemiş: Beni Nadir (kabilesin)'in malları, Allah'ın Resulüne fey' olarak verdiği şeylerden olup müslümanlar bunların üzerine at ve deve koşturmamışlardı. Binâenaleyh yalnız Nebi (Sallallahu Aleyhi ve Sellem)'e mahsustular. O da ailesinin senelik nafakasını ayırır; kalanını Allah yolunda bir hazırlık olmak üzere hayvan ve silâha sarf ederdi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4576,
			"arabicnumber": "1757.02",
			"text": "{…} Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Süfyân b. Uyeyne, Ma'mer'den, o da Ziihrî'den bu isnâdla rivayet etti",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4577,
			"arabicnumber": "1757.03",
			"text": "Bana Abdullah b. Muhammet! b. Esma Ed-Dubaî de rivayet etti. (Dediki): Bize Cüveyriye, Mâlik'ten, o da Zührî'den naklen rivayet etti ki, Zührî'ye Mâlik b. Evs rivayet etmiş. (Demişki): Ömer b. Hattâb bana haber gönderdi. Ben de ona gün yükseldiği vakit geldim; ve kendisini evinde bir serîr Üzerine oturmuş; bazılarının üzerine yapışmış; deriden bir yastığa dayanmış olduğu halde buldum. Bana: — Yâ Mâlik! Mesele şu ki, senin kavminden birkaç hâne sahibi koşup geldiler. Ben de kendilerine biraz atıyye ayrılmasını emrettim. Şunu al da aralarında taksim ediver! dedi. Ben: — Bunu benden başkasına emretsen iyi edersin! dedim. — Al onu yâ Mâlik! dedi. Az sonra Yerfe geldi. Ve: — Osman, Abdurrahmân b. Avf, Zübeyr ve Sa'd için (içeri girme­lerine) iznin var mı yâ Emfrelmü'minîn? dedi. Ömer: — Evet! dedi. O da kendilerine izin vererek içeri girdiler. Sonra tekrar gelerek: — Abbâsla Alî için iznin var mı? dedi. Ömer (yine) : — Evet! cevâbını verdi. Onlara da izin verdi. Derken Abbâs: — Tâ Emirel-mü'minîn! Benimle şu yalancı, günahkâr, vefasız, hâin arasında hüküm ver! dedi. Cemaat dahi: — Evet, yâ Emirel-mü'minîn, aralarında hüküm ver de kendilerini rahata kavuştur! dediler. (Mâlik b. Evs: Bana öyle geliyor ki, onlar bu cemaati bunun için önceden göndermişler; demiş.) Bunun üzerine Ömer: — ikiniz durun! Size Allah aşkına soruyorum! O Allah'ın ki yerle gök ancak onun izniyle durmaktadır! ResûIullah (Sallallahu Aleyhi ve Sellem)'in: «Bize mirasçı olunmaz! Bıraktığımız sadakadır.» buyurduğunu biliyormusunuz? dedi. Cemâat: — Evet! cevâbını verdiler. Sonra Abbâs'la Âlî'ye dönerek: — Sizin ikinize (de) Allah aşkına soruyorum! O Allah'ın ki, yerle gök ancak onun izniyle durmaktadır! Resûlullah (Sallallahu Aleyhi ve Sellem)'in: «Bize mirasçı olunmaz! Bıraktığımız sadakadır.» buyurduğunu biliyor musunuz? diye sordu. — Evet! dediler. Bunun üzerine Ömer şunları söyledi: — «Hakîkaten Allah (Azze ve Cell), Resulü (Sallallahu Alâyhi ve Sellem)'e öyle bir hâssa bahsetmiştir ki, bunu ondan başka hiç bir kimseye tahsis etmemişti. Teâlâ Hazretleri: Allah Resulüne beldeler halkından ne ganimet verdi ise bu sadece Allah ve Resulüne aittir! buyurdu. (Râvi: Bundan önceki âyeti okudu mu, okumadı mı bilmiyorum! diyor.) Resûlullah (Sallallahu Alâyhi ve Sellem)'se Benî Nadîr'in mallarını sizin aranızda taksîm etti. Vallahi kendini size tercîh etmedi. Sizi bırakıp da onlan kendisi almadı. Ta ki şu mal kaldı! Resûlullah (Sallallahu Alâyhi ve Sellem) bundan senelik nafaka alır; bilâhare kalanı Beytü'l-mal'e yardım olarak koyardı.» Sonra şöyle dedi: «Sîze Allah aşkına soruyorum! O Allah'ın ki, yerle gök ancak onun izniyle durmaktadır! Bunu biliyor musunuz?» Cemâat: — Evet! dediler. Sonra Abbas'la Alî'ye de cemaata sorduğu gibi: «Bunu biliyor musunuz?» diye sordu. — Evet! dediler. Ömer (sözüne devamla) şunları söyledi: — Resûlullah (Sallallahu Alâyhi ve Sellem) vefat edince Ebû Bekir: Ben Resulullah (Sallallahu Alâyhi ve Sellem)'in velî-i ahdiyim, dedi. Siz geldiniz! Sen kardeşin oğlundan mirasını istiyordun; o da karısının mirasını babasından istiyordu. Ebû Bekir şöyle dedi: Resûlullah (Sallallahu Alâyhi ve Sellem), «Bize mirasçı olunmaz:Bıraktığımız sadakadır.» buyurdu. Siz ikiniz onu da yalancı, günahkâr, vefasız, hâin saydınız! Halbuki Allah onun doğrucu, iyi, aklı başında, hakka tâbi' bir zât olduğunu biliyor! Sonra Ebû Bekir vefat etti. Ben de Resûlullah (Sallallahu Alâyhi ve Sellem) ile Ebû Bekr'in velî-i ahidleri oldum. Siz beni de yalancı, günahkâr, vefasız, hâin gördünüz! Halbuki Allah benim doğrucu, iyi, aklı başında, hakka tâbi* bir kimse olduğumu biliyor. Ben de bu (hükümet) işi (ni) üzerime aldım. Sonra bana sen ve şu geldiniz. ikiniz birliksiniz; matbumuz bir! Onu bize ver, dediniz. Ben de derim ki: Dilerseniz onu size, vereyim! Şu şartla ki: Onu Resûlullah (Sallallahu Alâyhi ve Sellem) ne yapardı ise siz de öyle yapacağınıza Allah'a söz verin! Onu bu şartla alırsınız! Öyle mi? — Evet! dediler. (Ömer devamla) şunu söyledi: — Sonra bana, aranızda hüküm vereyim diye geldiniz! Hayır, vallahi! Sizin aranızda bundan başka bir şeyle kıyamet kopuncaya kadar hüküm veremem! Eğer ondan âciz kalırsanız bana iade ediverin",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4578,
			"arabicnumber": "1757.04",
			"text": "Bize ishâk b. ibrahim ile Muhammed b. Rafi' ve Abd b. Humeyd rivayet ettiler, İbni Râfi' (Bize tahdîs etti) ta'bîrini kullandı. Ötekiler: Bize Abdürrazzâk haber verdi, dediler. (Demişki): Bize Ma'mer, Zührî'den, o da Mâlik b. Evs b. Hadesân'dan naklen haber verdi. (Şöyle demiş): Ömer b. Hattâb bana haber gönderdi. (Dediki): Mesele şu! Senin kavminden birkaç hâne sahibi geldi... Râvi, Mâlik'in hadîsi gibi rivayette bulunmuştur. Yalnız bu hadîste şu ibare vardır: «Ondan ailesine bir sene nafaka veriyordu. Galiba Ma'mer: Ondan ailesinin senelik yiyeceğini saklıyordu; sonra ondan kalanı Allah (Azze ve Celle)'nin malının sarfedildiği yere veriyordu, dedi.» İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4579,
			"arabicnumber": "1758",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): M&lik'e, İbni Şihfib'tan dinlediğim, onun da Urve'den, onun da Aişe'den naklen rivayet ettiği şu hadisi okudum: Âişe şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) vefat ettiği vakit zevceleri, Osman b. Affan'ı Ebû Bekr'e gönderip, Nebi (Sallallahu Aleyhi ve Sellem)'den kalan miraslarını ondan isteyecek oldular. Âlşe onlara: Resûlullah (Sallallahu Aleyhi ve Sellem): «Bize mirasçı olunmaz; ne bırakırsak o sadakadır!» buyurmadı mı dedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4580,
			"arabicnumber": "1759.01",
			"text": "Bana Muhammed b. Râfi' rivayet etti. (Dediki); Bize Huceyn haber verdi. (Dediki): Bize Leys, Ukayl'den, o da ibni Şihâb'tan, o da Urve b. Zübeyr'den, o da Âişe'den naklen rivayet ettiki, Aişe kendisine şunu haber vermiş: Fâtıme binti Resûlullah (Sallallahu Aleyhi ve Sellem) Ebû Bekr'e haber göndererek Resûlullah (Sallallahu Aleyhi ve Sellem)'in, kendisine Allah'ın Medine ile Fedek'de fey' olarak tahsis buyurduğu mallardan ve Hayber'in beşte birinden kalanlardan mirasını ondan istedi. Ebû Bekir de şunu söyledi: — Şüphesiz ki Resûlullah (Sallallahu Aleyhi ve Sellem); «Bize mirasçı olunmaz! Bıraktığımız sadakadır. Ancak Muhammed (Sallallahu Aleyhi ve Sellem)'in ailesi bu maldan yer!» buyurmuştur. Vallahi ben, Resûlullah (Sallallahu Aleyhi ve Sellem)'in sadakasından hiç bir şeyi, Resûlullah (Sallallahu Aleyhi ve Sellem) zamanındaki hâlinden değiştiremem! Onun hakkında mutlaka Resûlullah (Sallallahu Aleyhi ve Sellem) ne yaptı ise onunla amel ederim! Hâsılı Ebû Bekir, Fâtıme'ye bir şey vermekten çekindi. Fâtıme de bu hususta Ebû Bekr'e gücendi; ve kendisini terk etti; Ölünceye kadar da onunla konuşmadı. Fâtıme, Resûlullah (Sallallahu Aleyhi ve Sellem)'den sonra altı ay yaşadı. Vefat ettiği vakit onu kocası Alî b. Ebî Tâlib geceleyin defnetti. Onun vefatını Ebû Bekr'e haber vermedi. Namazını Alî kıldı. Fâtıme'nin hayatı müddetince Alî insanlardan itibar görmüştü. O vefat edince Alî halkın i'tbarını kaybetti. Ve Ebû Bekir'le barışarak ona bey'at etmek istedi. O aylarda henüz bey'at etmemişti. Ve Ebû Bekr'e: Bize gel! Ama seninle beraber başka bir kimse gelmesin! diye haber gönderdi. (Bunu Ömer b. Hattâb gelmesin diye yapıyordu.) Bunun üzerine Ömer, Ebû Bekr'e: — Vallahi onların yanına yalnız başına girme! dedi. Ebû Bekir ise: — Bana ne yapabilirler ki! Vallahi ben onlara giderim! cevabını verdi. Müteakiben Ebû Bekir yanlarına girdi. Alî b. Ebî Talib bir şehâdet getirdi. Sonra şunları söyledi: — Biz yâ Ebâ Bekr, senin faziletini ve Allah'ın sana olan ihsanını biliriz! Allah'ın sana verdiği bir bayırı sana çok görmeyiz. Lakin sen bu (hilâfet) iş (in) de bize karşı istibdâd gösterdin. Biz Resûlullah (Sallallahu Aleyhi ve Sellem)'e olan karabetimizden dolayı kendimiz için bir hak görüyorduk... Alî, Ebû Bekr'Ie konuşmasına devam etti. Nihayet Ebû Bekr'in gözleri boşandı. Sözü Ebû Bekir alınca şunları söyledi: — Nefsim yed-i kudretinde olan Allah'a yemin ederim ki, Resûlullah (Sallallahu Aleyhi ve Sellem)'in yakınları benim için kendi yakınlarıma yardım etmemden daha iyidir! Benimle sizin aranızda şu mallar hususunda geçen ihtilâfa gelince: Hiç şüphe yoktur ki ben bunlar hakkında hakta kusur etmiş değilim! Resûlullah (Sallallahu Aleyhi ve Sellem)'in yaptığını gördüğüm bir şeyi yapmadan bırakmadım!.. Bunun üzerine Alî Ebû Bekr'e: — Bey'at için miadın öğleden sonradır! dedi. Ebû Bekir öğle namazını kılınca Alî minbere çıkarak şehâdet getirdi; ve Alî'nin hâlini, bey'attan niçin geciktiğini, Ebû Bekr'e i'tizârda bulunduğu özrünü anlattı. Sonra istiğfar etti. Ve Ali b. Ebî Tâlib şehâdet getirerek Ebû Bekr'in hakkını ta'zîm eyledi. Bu yaptığına kendisini sevk eden şey ne Ebû Bekr'i çekememezlik, ne de Allah'ın ona verdiği fazileti inkâr olduğunu söyledi. (Sözüne devamla): — Lâkin biz kendimiz için bu işte bîr nasîb görüyorduk; ama bize karşı istibdat gösterildi; biz de gücendik! dedi. Müslümanlar buna sevindi ve: — isabet ettin! dediler. Emr-i ma'rûfa döndüğü zaman artık müslümanlar Alî'ye yakın oldular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4581,
			"arabicnumber": "1759.02",
			"text": "Bize ishâk b. ibrahim ile Muhammed b. Râfi' ve Abd b. Humeyd rivayet ettiler. (İbni Râfi' haddesenâ tâbirini kullandı. Ötekiler: Bize Abdürrazıâk haber verdi, dediler.) (Demişki): Bize Ma'mer, Zührî'den, o da Urve'den, o da Âişe'den naklen haber verdi ki, Fâtıme ile Abbâs, Resûlullah (Sallallahu Aleyhi ve Sellem)'den (kalan) miraslarını istemek için Ebû Bekr'e gelmişler. O anda onlar Nebi (Sallallahu Aleyhi ve Sellem)'in Fedek'ten aldığı yeri ile Hayber'den aldığı hissesini istiyormuş. Ebû Bekir de kendilerine: — Ben Resülullah (Sallallahu Aleyhi ve Sellem)'i dinledim... demiş. Râvi hadisi Ukayl'in Zührî'den naklettiği hadis mânâsında rivayet etmiştir. Yalnız o şöyle demiştir: «Sonra Alî ayağa kalkarak Ebû Bekr'in hakkını ta'zim etti ve onun faziletini, sabık müslümanlardan oluşunu anlattı. Sonra Ebû Bekr'e doğru giderek ona bey'at etti. Bunun üzerine cemaat Ali'ye geldiler ve: isabet ettin; iyi yaptın! dediler. Alî emr-i ma'rufa yaklaştığı an halk da kendisine yakın oldu.»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4582,
			"arabicnumber": "1759.03",
			"text": "Bize ibni Numeyr rivayet etti. (Dediki): Bize Ya'küb b. tbrahîm rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize Züheyr b. Harb ile Hasan b. Aliy EI-Hulvânî de rivayet ettiler. (Dedilerki): Bize Ya'kûb —ki ibni ibrahim'dir— rivayet etti. (Dediki): Bize babam, Salih'den, o da ibni Şihâb'dan naklen rivayet etti (Demişki): Bana Urve b. Zübeyr haber verdi. Ona da Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Âişe haber vermiş ki, Fâtıme binti Resûlullah (Sallallahu Aleyhi ve Sellem) Resûlullah (Sallallahu Aleyhi ve Sellem)'in vefa­tından sonra onun kendisine Allah'ın fey' olarak tahsis buyurduğu mallardan ibaret terekesinden mirasını taksim etmesini Ebû Bekir'den istemiş. Ebû Bekir de ona: Şüphesiz Resûlullah (Sallallahu Aleyhi ve Sellem): «Bize mirasçı olunmaz; bıraktığımız sadakadır.» buyurmuşlardır; demiş. Râvi diyor ki: Fâtıme Resûlullah (Sallallahu Aleyhi ve Sellem)'den sonra altı ay yaşamıştır. Fâtıme Ebû Bekir'den, Resûlullah (Sallallahu Aleyhi ve Sellem)'in Hayber'le Fedek'te bıraktığı terikesinden ve Medine'deki sadakasından hissesini istiyormuş. Ebû Bekir bunu kabul etmemiş ve: — Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'in amel ettiği bir şeyi yapmadan bırakamam! Ben onun emirlerinden bir şey terk edersem sapacağımdan korkarım! demiş. Medine'deki sadakasına gelince: Onu Ömer, Ali ile Abbas'a vermiştir. O sadakada Ali Abbas'a galebe çalmıştır. Hayber'le Fedek'i ise Ömer elde tutmuş; ve: Bunlar Resûlullah (Sallallahu Aleyhi ve Sellem)'in sadakasıdır! Bunlar onun kargısına çıkan hakları ve hâdiseleri içindir. Onların işi halîfeye kalmıştır; demiş. Bunlar bu güne kadar aynı minval üzere kalmışlardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4583,
			"arabicnumber": "1760.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, Ebû'z-Zinâd'dan dinlediğim, onun da A'rac'dan, onun da Ebû Hureyre'-den naklen rivayet ettiği şu hadîsi okudum : Resûlullah (Sallallahu Aleyhi ve Sellem): «Benim mirasçılarım bir dînar bile üleşemezler. Kadınlarımın nafakasından ve amil’imin masrafından sonra ne bırakırsam sadakadır» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4584,
			"arabicnumber": "1760.02",
			"text": "{…} Bize Muhammed b. Yahya b. Ebî Ömer El-Mekkî rivayet etti. (Dediki): Bize Süfyân, Ebû'z-Zinâd'dan bu isnadla bu hadisin mislini rivayet etti. İzah 1761 de",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4585,
			"arabicnumber": "1761",
			"text": "Bana İbni Ebî Halef dahî rivayet etti. (Dediki): Bize Zekeriyyâ b. Adiy rivayet etti. (Dediki): Bize ibni'l-Mubarek, Yûnus'-dan, o da Zührî'den, o da A'rac'dan, o da Ebû Hureyre'den, o da Peygmmher (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi. «Bize mirasçı olunmaz; bıraktığımız sadakadır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4586,
			"arabicnumber": "1762.01",
			"text": "Bize Yahya b. Yahya ile Ebû Kâmil Fudayl b. Hüseyn ikisi birden Süleym'den rivayet ettiler. Yahya (Dediki): Bize Süleym b. Ahdar, Ubeydullah b. Ömer'den, naklen haber verdi. (Dediki): Bize Nâfi', Abdullah b. Ömer'den rivayet etti ki, Resulullah (Sallallahu Aleyhi ve Sellem) nefeli ata iki, adama bir sehim olarak taksim yapmış",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4587,
			"arabicnumber": "1762.02",
			"text": "{…} Bize bu hadîsi ibnü Numeyr rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Ubeydullah bu isnâdla bu hadîsin mislini rivayet etti. «Ama «nefeli» tâbirini zikretmedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4588,
			"arabicnumber": "1763",
			"text": "Bize Hennâd b. Seriy rivayet etti. (Dediki): Bize îbntil-Mübârek, ikrime b. Ammâr'dan rivayet etti. (Demişki): Bana Simâk EI-Hanefî rivayet etti. (Dediki): ibni Abbâs'ı şöyle derken işittim: Bana Ömer b. Hattâb rivayet etti. (Dediki): Bedir harbi olduğu gün... H. Bize Züheyr b. Harb da rivayet etti. Lâfız onundur. (Dediki): Bize Ömer b. Yûnus El-Hanefî rivayet etti. (Dediki): Bize ikrime b. Ammâr rivayet etti. (Dediki): Bana Ebû Zümeyl (bu zât Simâk El-Hanefî'dir) rivayet etti. (Dediki): Bana Abdullah b. Abbâs rivayet etti. (Dediki): Bana Ömer b. Hattâb rivayet etti. (Dediki): Bedir harbi olduğu gün Resûlullah (Sallallahu Aleyhi ve Sellenı) müşriklere baktı. Onlar bin nefer, ashabı ise üç yüz ondokuz kişi idiler. Bunun üzerine Nebiyyullah (Sallallahu Aleyhi ve Sellenı) kıbleye döndü. Sonra ellerini uzatarak Rabbine: «Allahım! Bana va'dettiğini yerine getir! Allahım, bana va'dettiğini ver! Allahım, eğer ehl-i Islâmdan olan şu cemaati helak edersen (bundan sonra) yeryüzünde sana ibâdet olunmaz!» diye niyaz etmeye başladı. Ellerini uzatarak kıbleye karşı Rabbine o derece niyazda bulundu ki, nihayet omuzlarından cübbesi düştü. Müteakiben Ebû Bekir, yanına gelerek cübbesini aldı ve omuzlarına koydu. Sonra arkasından ona sarılarak: — Yâ Nebiyyallah! Rabbine yaptığın dilek yeter! Şüphesiz o sana va'dettiğmî yerine getirecektir! dedi. Az sonra Allah (Azze ve Celle) : (Hani Rabbinizden imdat istiyordunuz! O da : Ben size birbiri ardınca gelecek bin melekle imdat göndereceğim! diye cevap vermişti!) [Enfal 9] âyetini indirdi ve Allah ona meleklerle imdat gönderdi. Ebû Zümeyl (Demişki): Sonra bana îbni Abbâs rivayet etti. (Dediki): O gün müslümanlardan bîr zât, önünde müşriklerden bir adamın peşinden koşarken ansızın üzerinde bir kırbaç darbesi işitti. Ye süvarinin: Dur yâ Hayzûm! diyen sesini duydu. Bir de önündeki müşrike baktı ki, boylu boyunca yere serilmiş! Burnu berelenmiş; yüzü de kırbacın vurduğu şekilde yarılmış olduğunu gördü. Bütün bunlar yemyeşil olmuştu. Az sonra Ensârî gelerek bu hâdiseyi Resûlullah (Sallallahu Aleyhi ve Sellenı)'e anlattı da: «Doğru söyledin; bu semâdan gelen üçüncü imdattandır!» buyurdular. Artık o gün (müslümanlar) yetmiş kişi öldürdüler; yetmiş de esîr aldılar. Ebû Zümeyl (Demişki): ibni Abbâs şunu söyledi: Müslümanlar esîrleri aldıktan sonra Resûlullah (Sallallahu Aleyhi ve Sellenı) Ebû Bekirle Ömer'e: «Bu esirler hakkında re'yiniz nedir?» diye sordu. Ebû Bekir: — Yâ Nebiyyallah! Bunlar amca oğulları ve akrabadırlar; ben onlardan fidye alman fikrindeyim! Bu suretle küffar üzerine kuvvetimiz olur. Umulur ki Allah onları islâm'a hidayet buyurur! dedi. Müteakiben Resûlullah (Sallallahu Aleyhi ve Sellenı): «Sen ne fikirdesin ey Hattâb oğlu?» diye sordu. (Ömer diyor ki); — Ben: Hayır, vallahi yâ Resûlâllah! Ben Ebû Bekr'in fikrinde değilim! Lâkin ben, bize müsaade buyursan da şunların boyunlarını vuruversek! fikrindeyim. Ukayl'e karşı Alî'ye müsaade buyurmalısın ki onun boynunu vursun! Bana da filâna (bir yakını) karşı müsaade buyurmalısın, ben de onun boynunu vurmalıyım! Zîra bunlar küfrün imamları ve eşrafıdırlar! dedim. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellenı) Ebü Bekr'in söylediğine meyletti. Benim söylediğimi beğenmedi. Ertesi gün olunca ben geldim. Bîr de ne göreyim! Resûlullah (Sallallahu Aleyhi ve Sellenı)'le Ebû Bekir oturmuş ağlıyorlar!.. — Yâ Resûlâllah! Bana haber ver; sen ve arkadaşın neden ağlıyorsunuz? Ağlayacak bir şey bulursam ben de ağlarım; ağlayacak bir şey bulmazsam siz ağladığınız için ben de ağlar görünürüm! dedim. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellenı): «Bana senin arkadaşlarının teklif ettiği fidye alma meselesine ağlıyorum. Gerçekten onların azapları bana şu ağaçtan daha yakın arzolundu.» buyurdu. (Sallallahu Aleyhi ve Sellenı) yakın bir ağaca işaret etmiş.) Ve Allah (Azze ve Celle) : (Yeryüzünde üstünlüğü sağlamadıkça hiç bir Nebiye esir almak yaraşmaz.) [Enfal 67-69] âyet-i kerîmesini (Artık aldığınız ganimetten helâl hoş olarak yeyînl) âyetine kadar indirdi. Ve Allah müslümanlara ganimeti helâl kıldı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4589,
			"arabicnumber": "1764.01",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Leys, Saîd b. Ebî Saîd'den naklen rivayet etti ki, Ebû Hureyre'yi şunu söylerken işitmiş: Resûlullah (Sallallahu A!eyhi ve Sellem) Necd tarafına suvari gönderdi. Bunlar Benî Hanîfe (kabilesin) den Sümame b. Usal denilen bir adam getirdiler. Bu zat Yemameliler'in reîsi idi. Onu mescidin direklerinden bir direğe bağladılar. Derken Resûlullah (Sallallahu A!eyhi ve Sellem) onun yanına çıkarak: «Ne haber ya Sümame?» dedi. Sümame şunları söyledi: — Bendeki ya Muhammed, hayırdır. Şayet öldürürsen kan sahibi birini öldürmüş olursun. ihsan edersen şükreden birine ihsan etmiş olursun! Eğer mal istiyorsan hemen dile! Sana dilediğin kadar mal verilir! Bunun üzerine Resûlullah (Sallallahu A!eyhi ve Sellem) onu terk etti. Ertesi günden sonraki gün gelince yine: «Ne haber ya Sümame?» diye sordu. O da: — Sana soylediğimdir! Eğer ihsan edersen şükreden birine ihsan etmiş olursun! öldürürsen kan sahibi birini öldürmüş olursun! Mal istiyorsan hemen dile! Sana dilediğin kadar mal verilir! dedi. Resûlullah (Sallallahu A!eyhi ve Sellem) onu yine terketti. Ertesi gün gelince (tekrar) : «Ne haber ya Sümame?» diye sordu. Sümame: — Bende sana söylediklerim var! Eğer ihsan edersen, şükreden birine ihsan etmiş olursun! öldürürsen kan sahibi birini öldürmüş olursun! Mal istiyorsan hemen dile! Sana dilediğin kadar mal verilecektir! dedi. Bunun üzerine Resûlullah (Sallallahu A!eyhi ve Sellem): «Sumame'yı serbest bırakın!» buyurdu. O da mescide yakın bir hurmalığa giderek yıkandı. Sonra mescide girdi. Ve: — Allah'tan başka ilah olmadığına şehadet ederim! Muhammed'in onun kulu ve resulü olduğuna da şehadet ederim! Ya Muhammed, vallahi yeryüzünde (şimdiye kadar) bana senin yüzünden daha sevimsiz bir yüz yoktu! Şimdi senin yüzün bana bütün yüzlerden daha sevimli oldu. Vallahi benim için senin dîninden daha sevimsiz bir dîn yoktu! Dînin de benim için bütün dînlerden daha sevimli oldu! Vallahi, benim için senin beldenden daha sevimsiz bir belde yoktu. Şimdi belden de benim için bütün beldelerden sevimli oldu! Süvarilerin beni yakaladığında ben umre yapmak istiyordum. Ne buyurursun? dedi. Bunun üzerine Resûlullah (Sallallahu A!eyhi ve Sellem) kendisini müjdeledi. Ve umre yapmasını emretti. Mekke'ye vardığında ona birisi: — Sen dininden mi döndün? diye sormuş. O da: — Hayır! Lakin ben Resulullah (Sallallahu A!eyhi ve Sellem)'le birlikte müslüman oldum! Hayır, vallahi! Size ResûluIIah (Sallallahu A!eyhi ve Sellem) izin vermedikçe Yemame'den bir buğday tanesi bile gelemez! demiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4590,
			"arabicnumber": "1764.02",
			"text": "Bize Muhammed b. EI-Müsenna rivayet etti. (Dediki): Bize Ebû Bekir El-Hanefî rivayet etti. (Dediki): Bana Abdülhamîd b. Ca'fer rivayet etti. (Dediki): Bana Saîd b. Ebî Saîd El-Makbûrî rivayet etti ki, Ebü Hureyre'yi şunu söylerken işitmiş: ResûlIalah (Sallallahu A!eyhi ve Sellem) Necd arazîsi taraflarına bir (böIük) süvarisini göndermiş. Bunlar Sümame b. Usal El-Hanefî denilen —Yemame halkının reisi— bir adamı getirmişler... Ve ravi hadîsi, Leys'in hadîsi gibi nakletmiş; yalnız o -öldürürsen yerine «beni öldürürsen, kan sahibi birini öldürmüş olursun!» demiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4591,
			"arabicnumber": "1765",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Leys, Saîd b. Ebî Saîd'den, o da babasından, o da Ebû Hureyre'den naklen rivayet etti, ki şöyle demiş; Bir defa biz mescidde iken anîden Resûlullah (Sallallahu Aleyhi ve Sellem) yanımıza cıkageldi. Ve: «Haydi yahudîlere gidelim!» dedi. Onunla birlikte biz de çıktık ve yahudilere vardık. Derken Resulullah (Sallallahu Aleyhı ve Sellem) ayağa kalkarak onlara seslendi; ve: «Ey yahudiler cemaati, müslüman olun, kurtulun!» buyurdu. Onlar! — Tebliğ ettin yâ Eba'l-Kaasim! dediler. Resûlullah (Sallallahu Aleyhı ve Sellem) onlara: «Bunu murad ediyorum! Müslüman olun, kurtulun!» buyurdu. Onlar (yine): Teblîg ettin yâ Eba'l-Kaasim! dediler. Resûlullah (Sallallahu Aleyhı ve Sellem) (tekrar) : «Bunu murâd ediyorum!» dedi; ve üçüncü defasında onlara şunu söyledi: «Bilmiş olun ki, bu yer Allah'ın ve Resûlünündür. Ben de sizi bu yerden sürgün etmek istiyorum. Sizden kim malına karşılık bir şey bulursa onu hemen satsın! Yoksa bilin ki, bu yer Allah'ın ve Resûlünündür!»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4592,
			"arabicnumber": "1766.01",
			"text": "Bana Muhammed b. Râfi' ile ishâk b. Mansûr rivayet ettiler, İbni Râfi' (haddesenâ) ta'bîrini kullandı. îshâk: Bize Abdürrazzâk haber verdi, dedi. (Demişki): Bize ibnü Cüreyc, Mûsâ b. Ukbe'den, o da Nâfi'den, o da İbni Ömer'den naklen haber verdi ki, Benî Nadîr ile Kureyza yahudileri Resûlullah (Sallallahu Aleyhi ve Sellem)'le harb etmişler de Resûlullah Benî Nadîr'i sürgün etmiş; Kureyza'yı ise yerinde bırakmış ve kendilerine serbesti vermiş. Nihayet bundan sonra Kureyza'da harb edince artık onların erkeklerini öldürmüş; kadınları ile çocuklarını ve mallarını müslümanlar arasında taksim etmiş. Yalnız bazıları Resûlullah (Sallallahu Aleyhi ve Sellem)'e iltihak etmişler. O da kendilerine emân vermiş; ve müslüman olmuşlar. Resûlullah (Sallallahu Aleyhi ve Sellem) bütün Medine yahudîlerini, Benî Kaynuka'yı (ki bunlar Abdullah b. Selâm'ın kavmidirler) ve Benî Harise yahudilerini, Medine'de bulunan her yahudiyi sürmüştür",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4593,
			"arabicnumber": "1766.02",
			"text": "{…} Bana Ebû't-Tahir de rivayet etti. (Dediki): Bize Abdullah b. Vehb rivayet etti. (Dediki): Bana Hafs b. Meysere, Musa'dan bu isndla bu hadisi haber verdi. Ama ibnü Cüreyc'in hadîsi daha uzun ve daha tamdır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4594,
			"arabicnumber": "1767.01",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Dehhâk b. Mahled, İbnü Cüreyc'den rivayet etti. H. Bana Muhammed b. Râfi' de rivayet etti. Lâfız onundur. (Dediki): Bize Abdürrazzak rivayet etti. (Dediki): Bize ibnü Cüreyc haber verdi. (Dediki): Bana Ebû'z-Zübeyr haber verdi, ki Câbir b. Abdillâh'ı şöyle derken işitmiş: Bana Ömer b. Hattâb haber verdi ki, Resûlullah (Sallallahu Aleyhi ve Sellem): «Yahudilerle hıristiyonları Arap yarımadasından mutlaka çıkaracağım! Tâ ki müslümandan başka kimseyi bırakmayacağım.! buyururken işitmiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4595,
			"arabicnumber": "1767.02",
			"text": "{…} Bana yine Züheyr b. Harb rivayet etti. (Dediki): Bize Ravh b. Ubâde rivayet etti. (Dediki): Bize Süfyân-ı Sevrî haber verdi. H. Bana Seleme b. Şebîb de rivayet etti. (Dediki): Bize Hasen b. A'yen rivayet etti. (Dediki): Bize Ma'kıl —ki ibni Ubeydillâh'dır— rivayet etti. Her iki râvi Ebû'z-Zübeyr'den bu isnâdla bu hadîsin mislini rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4596,
			"arabicnumber": "1768.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Muhammed b. El-Müsennâ ve ibni Beşşâr rivayet ettiler. Lâfızları birbirine yakındır. Ebû Bekir: Bize Gunder, Şu'be'den rivayet etti, dedi. Ötekilerse: Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Sa'd b. ibrahim'den naklen rivayet etti, dediler. Sa'd şöyle demiş: Ben Ebû Ünıâme b. Sehl b. Huneyfi şöyle derken işittim: Ben Ebû Saîd-i Hudrî'yi şunu söylerken işittim: Kureyzalılar (kalelerinden) Sa'd b. Muâz'ın hakemliğine indiler. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) Sa'd'a haber gönderdi. O da bir nıerkeb üzerinde yanlarına geldi. Mescide yaklaşınca Resûlullah (Sallallahu Aleyhi ve Sellem) Ensâr'a : «Ulunuza (yahut en hayırlınıza} ayağa kalkın!» buyurdu. Sonra: «Gerçekten bunlar senin hükmüne razı oldular!» dedi. Sa'd: — Harbe yarayanlarını öldürür; karı kızanlarını da esir edersin! dedi. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): «Allah'ın hükmü ile hükmettin!» ve galiba «Melik'in hükmü île hükmettin I» buyurdular, ibnü'l-Müsennâ: «Ve galiba Melik'in hükmü iie hükmettin buyurdu.» cümlesini zikretmedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4597,
			"arabicnumber": "1768.02",
			"text": "{…} Bize Züheyr b. Harb da rivayet etti. (Dediki): Bize Abdurrahman b. Mehdi, Şu'be'den bu isnâdla rivayet etti. Ve hadîsinde şöyle dedi: «Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) : «Gerçekten onlar hakkında Allah'ın hükmü ile hüküm verdin!» Buyurdu. Bir defa da: «Gerçekten Melik'in hükmü ile hükmettin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4598,
			"arabicnumber": "1769.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Muhammed b. Alâ El-Hemdânî ikisi birden ibnü Numeyr'den rivayet ettiler. İbnü'l-Alâ' dediki: Bize İbni Numeyr rivayet etti. (Dediki): Bize Hişâm, babasından, o da Âişe'den naklen rivayet etti. Şöyle demiş : Sa'd Hendek günü yaralandı. Onu Küreyş'ten İbni Arika denilen bir adam kolundaki şah damarından yaraladı. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) mescidde ona bir çadır kurdu; onu yakından dolaşıyordu. Resûlullah (Sallallahu Aleyhi ve Sellem) Hendek'ten dönünce silâhı bırakarak yıkandı. Az sonra Cibril geldi. Resûlullah (Sallallahu Aleyhi ve Sellem) onun başından tozu silkiyordu. Cibril: «Silâhı bıraktın mı? Vallahi biz onu bırakmadık! Onların karşısına çık!» dedi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Nereye?» diye sordu. O da Benî Kureyza'ya işaret etti. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) onlarla harb etti. Binnetice onun hükmüne boyun eğdiler. Resûlullah (Sallallahu Aleyhi ve Sellem) de onlar hakkındaki hakemliği Sa'd'a devretti. Sa'd: —Ben de onlar hakkında harbe yarayanlarının öldürülmesine, çocuk ve kadınlarının esir edilmesine ve mallarının taksimine hükmediyorum! dedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4599,
			"arabicnumber": "1769.02",
			"text": "Bize Ebû Kureyb de rivayet etti. (Dediki): Bize ibnü Numeyr rivayet etti. (Dediki): Bize Hişâm rivayet etti. (Dediki): Babam şunu söyledi: Bana da haber verildiki, Resûlullah (Sallallahu Aleyhi ve Sellem): «Gerçekten onlar hakkında Allah (Azze ve Celle) 'nin hükmü ile hükmettiril» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4600,
			"arabicnumber": "1769.03",
			"text": "Bize Ebû Kureyb rivayet etti. (Dediki): Bize ibnü Numeyr, Hişâm'dan rivayet etti. (Demişki): Bana babam, Âişe'den naklen haber verdikî, Sa'd yarası kuruyup iyileşmeye yüz tuttuğu sırada şunları söylemiş: — Allahım! Sen biliyorsun kî, benim için senin yolunda, Resulün (Sallallahu Aleyhi ve Sellem)'i yalanlayıp yurdundan çıkaran bir kavimle cihâd etmekten daha sevimli bir nesne yoktur. Allahım! Eğer Kureyş harbinden bir şey kaldı ise beni (sağ) bırak da senin uğrunda onlarla mücâhede edeyim! Allahım! Ben zannediyorum ki, sen bizimle onların arasındaki harbi bıraktın. Şayet onlarla aramızdaki harbi bıraktı isen şu yarayı patlat da ölümümü ondan yap! Derken yara gırtlağından patlamış. Oradakileri kanın kendilerine doğru akmasından başka ürküten bir şey olmamış. (Mescidde onunla beraber Benî Gifâr'dan bir çadır varmış.) Oradakiler: — Sizin tarafınızdan bize gelen bu nesne nedir? demişler. Bir de ne görsünler! Sa'd'ın yarasından kan fışkırıyor!.. Az sonra bundan vefat etmiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4601,
			"arabicnumber": "1769.04",
			"text": "Bize Aliy b. Hüseyn b. Süleyman El-Kûfî de rivayet etti. (Dediki): Bîze Abde, Hişâm'dan bu isnâdla bu hadîsin benzerini rivayet etti. Şu kadar var ki, o: «Yarası o akşam patladı. Ve ölünceye kadar akmaya devam etti.» dedi. Bir de hadîste şunu ziyade etti. (Dediki): «Bu, şâirin şunları söylediği zamandı: «Dikkat! Ey Sa'd, Benî Muâz'in Sa'd'ı! Kureyza ile Nadîr ne yaptı;» «ömrüne yemin olsun ki, Benî Muâz'ın Sa'd'ı; onların göçtükleri sabah sabreden yalnız o idi.» «Çömleğinizi, içi boş olarak bıraktınız! Halbuki bu kavmin çömleği kaynamış; taşıyor!» «Büyük Ebû Hubâb: Durun Kaynukaa gitmeyin! demişti.» «Bunlar memleketlerinde Meydân'daki kayalar kadar ağır idiler!»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4602,
			"arabicnumber": "1770",
			"text": "Bana Abdullah b. Muhammed b. Esma Ed-Dubaî rivayet etti. (Dediki): Bize Cüveyriye b. Esma', Nâfi'den, o da Abdullah'dan naklen rivayet etti. Şöyle demiş: Ahzâb muharebesinden döndüğü gün Resûlullnh (Sallallahu Aleyhi ve Sellem) bize : «Sakın kimse öğleyi Benî Kureyza'dan başka bir yerde kılmasın!» diye seslendi. Fakat bazı insanlar vaktin geçeceğinden korkarak namazı Beni Kureyza'dan başka yerde kıldılar. Ötekiler de: — Vakti geçirsek bile biz namazımızı ancak Resûlullah (Sallallahu Aleyhi ve Sellem)'in emrettiği yerde kılarız! dediler. Ama o, iki fırkadan hiç bir kimseyi azarlamadı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4603,
			"arabicnumber": "1771.01",
			"text": "Bana Ebû't-Tâhir ile Harmele rivayet ettiler. (Dedilerki): Bize ibni Vehb haber verdi. (Dediki): Bana Yûnus, ibni Şihâb'dan, o da Enes b. Mâlik'den naklen haber verdi. Şöyle demiş: Muhacirler Mekke'den Medine'ye geldikleri vakit, boş elle geldiler. Ensâr ise arazi ve akar sahibi idiler. Onun için Ensâr onlara her yıl mallarının yarı gelirini vermek, onlar da çalışma ve bakım cihetlerini üzerlerine almak şartı ile taksimde bulundular. Enes b. Mâlik'in annesi vardı —ki ona Ümmü Süleym denilirdi.— Abdullah b. Ebî Talha'nın annesi vardı; Abdullah, Enes'in anne bir dayısı idi. Enes'in annesi ResûIullah (Sallallahu Aleyhi ve Sellem)'e bir hurmalığını vermiş; Resûlullah (Sallallahu Aleyhi ve Sellem) de onu Ümmü Eymen'e (yâni) âzâdlısına, Usâme b. Zeyd'in annesine vermişti. ibni Şihâb şöyle demiş: Bana Enes b. Mâlik haber verdi ki, ResuIullah (Sallallahu Aleyhi ve Sellem) Hayberliler'le harbi bitirip Medine'ye çekildikten sonra Muhacirler Ensârın vermiş oldukları meyve bağışlarını kendilerine iade etmişler. Enes dedi ki: Resûlullah (Sallallahu Aleyhi ve Sellem) de anneme hurmalığını iade etti. Ama Resûlullah (Sallallahu Aleyhi ve Sellem) Ününü Eymen'e o hurmaların yerine kendi bahçesinden verdi. ibni Şihâb demiş ki: Ümmü Eymen'in (yâni) Usâme b. Zeyd'in annesinin halü şânı şu idi ki, kendisi Abdullah b. Abdilmuttalib'in hizmetçisi idi. Habeşlilerdendi. Âmîne Resûlullah (Sallallahu Aleyhi ve Sellem) babası öldükten sonra doğurunca ona Ümmü Eymen dadılık ediyordu. Nihayet Resûlullah (Sallallahu Aleyhi ve Sellem) büyüdü; ve onu âzâd etti. Sonra kendisini Zeyd b. Hârise'ye nikahladı. Bilâhare Ümmü Eymen, Resûlullah (Sallallahu Aleyhi ve Sellem)'in vefatından beş ay sonra vefat etti",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4604,
			"arabicnumber": "1771.02",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Hâmid b. Ömer El-Bekrâvî ve Muhammed b. Abdil alâ El-Kaysî hep birden Mu'temir'den rivayet ettiler. Lâfız ibni Ebî Şeybe'nindir. (Dediki): Bize Mu'temir b. Süleyman Et-Teymî, babasından, o da Enes'den naklen rivayet etti ki, Bir adam (Hâmid'Ie İbni Abdilâ'lâ: Adam dediler.) Nebi (Sallallahu Aleyhi ve Sellem)'e kendi arazîsinden hurmalıkları veriyordu. Nihayet ona Kureyza ile Nadir fethedildi. Artık bundan sonra, verdiklerini adama iade etmeye başladı. Enes demiş ki: Bana da ailem efradı, Nebi (Sallallahu Aleyhi ve Sellem)'e giderek o adamın ailesinin verdiklerini yahut bir kısmını istememi emrettiler. Nebiyyullah (Sallallahu Aleyhi ve Sellem) onları ÜmmÜ Eymen'e vermişti. Nebi (Sallallahu Aleyhi ve Sellem)'e geldim. O da bana bu hurmaları verdi. Derken Ümmii Eymen gelerek elbiseyi boynuma çaldı. Ve: — Vallahi onları sana vermeyiz! Onları bana vermişti! dedi. Bunun üzerine Nehiyyullah (Sallallahu Aleyhi ve Sellem); «Yâ Ummü Eymen! Bırak onu! Sana da filân ve filân şeyi veriyorum!» buyurdu. Ama Ümmü Eymen de: — Asla! Kendisinden başka ilâh olmayan Allah'a yemîn olsun! diyordu. Artık şunu da veriyorum diye diye nihayet kendisine o hurmaların on mislini yahut on misline yakınını verdi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4605,
			"arabicnumber": "1772.01",
			"text": "Bize Şeyban b. Ferruh rivayet etti. (Dediki): Bize Süleyman (yani ibni'l-Muğira) rivayet etti. (Dediki): Bize Humeyd b. Hilal, Abdullah b. Muğaffel'den rivayet etti. Şöyle demiş: Hayber harbi günü bir tulum iç yağı ele geçirdim. Ve onu benimseyerek: Ben bugün bundan kimseye bir şey vermem ! dedim. Derken bakındım. Bir de ne göreyim karşımda Resulullah (Sallallahu Aleyhi ve Sellem) gülümseyerek duruyor",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4606,
			"arabicnumber": "1772.02",
			"text": "Bize Muhammed b. Beşşar El-Abdi rivayet etti. (Dediki): Bize Behz b. Esed rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Bana Humeyd b. Hilal rivayet etti. (Dediki): Abdullah b. Muğaffel'i şunu söylerken işittim: Hayber harbi günü bize içi yiyecek ve iç yağı dolu bir tulum atıldı. Ben hemen onu alayım diye sıçradım. Bir bakındım. Ne göreyim Resulullah (Sallallahu Aleyhi ve Sellem) Ve ondan utandım",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4607,
			"arabicnumber": "1773.01",
			"text": "Bize ishâk b. ibrâhîm EI-Hanzalî ile ibni Ebî Ömer, Muhammed b. Râfi' ve Abd b. Humeyd rivayet ettiler. Lâfız İbni Râfi'-indir, İbni Râfi' ile îbni Ömer «haddesenâ» tâbirini kullandılar. Diğer ikisi: Bize Abdürrazzâk haber verdi, dediler. (Demişki): Bize Mamer Zührî'den, o da Ubeydullah b. Abdillâh b. Utbe'den, o da îbni Abbâs'dan naklen haber verdi ki, ona da Ebû Süfyân leb beleb haber vermiş. (De­miş ki).; Resûlullah (Sallallahu Aleyhi ve Sellem)'le aramızda geçen müddette seyahata çıktım. Ben Şam'da iken Resûlullah (Sallallahu Aleyhi ve Sellem)'den Hirakl'e yâni Roma imparatoruna bir mektub getiriverdiler. Mektubu Dihyetül-Kelbî getirmişti. Onu Busrâ emîrine verdi. Busrâ emîri de Hirakl'e verdi. Hirakl: — Kendisinin Nebi olduğunu söyleyen bu adamın kavminden burada kimse var mı? diye sordu. — Evet! dediler. Bunun üzerine Kureyş'den birkaç kişi ile birlikte beni de çağırdılar. Hirakl'in yanına girdik. Bizi huzuruna oturttu. Ve : — Kendisinin Nebi olduğunu söyleyen bu adama soyca hanginiz daha yakındır? dedi. Ebû Süfyân demiş ki: — Ben! diye cevap verdim. Ve beni onun önüne, arkadaşlarımı da benim arkama oturttular. Sonra tercümanını çağırarak ona şunu söyledi: — Bunlara söyle! Ben kendisinin Nebi olduğunu söyleyen bu adamın kim olduğunu soruyorum! Eğer bana yalan söyledi ise siz de onu yalanlayın! Râvi diyor ki: Bunun üzerine Ebû Süfyân: — Allah'a yemîn olsun ki, yalanım nakledileceğinden korkmasam mutlaka yalan söylerdim! dedi. Sonra Hirakl tercümanına : — Buna sor! Onun sizin aranızda asaleti nasıl? dedi. Ebû Süfyân demiş ki: Ben : — O aramızda asalet sahibidir; dedim. — Babalarından kıral olan var mı idi? — Hayır! — Onu bu söylediğini söylemezden önce yalanla itham eder mi idiniz? — Hayır! — Peki ona tâbi' olanlar kim? Halkın eşrafı mı yoksa zayıfları mı? — Yok, zayıfları! — Bunlar artıyorlar mı, eksiliyorlar mı? — Hayır, bilâkis artıyorlar! — Onlardan hiç biri onun dînine girdikten sonra beğenmeyerek dininden dönüyor mu? — Hayır! — Onunla hiç harb ettiniz mi? — Evet! — Onunla harbiniz nasıl olmuştu? — Onunla bizim aramızdaki harb nevbetleşe olur. Kimi o bizi mağlûb eder, kimi biz onu! — Vefasızlık eder mi? — Hayır! Ama biz onunla bir müddet (anlaşma) içindeyiz; o müddette ne yapacağını bilmeyiz! dedim. Vallahi içerisine bundan başka bir şey sokabileceğim bir söz söylemeye bana imkân vermedi. — Bu sözü ondan önce hiç bir kimse söyledi mi? diye sordu. — Hayır! dedim. Tercümanına dedi kî: — Buna söyle! Ben sana onun asaletini sordum; sen de onun aranızda asalet sahibi olduğunu söyledin. Nebiler de böyledir; kavimlerinin asaletlilerinden gönderilirler. Babalarının içerisinde kıral olan var mı? dedim. Hayır! diye cevap verdin, tmdi ben de derim ki: Babalarından kıral olan bulunsa idi, babalarının saltanatını arayan bir adam!., derdim. Sana onun tâbi'lerini sordum. Kavminin zayıfları mı, eşrafımı? dedim. Yok. zayıfları... dedin. Nebilerin tabileri de bunlardır! Sana: Onu bu söylediğini söylemezden önce yalanla itham edermi idiniz? diye sordum. Hayır! diye cevap verdin! Gerçekten anladım kî, bu zât inamlara yalan söylemeyi bırakıp da giderek Allah'a karşı yalan uyduracak 4eğildir. Sana: Onlardan hiç biri onun dînine girdikten sonra beğenmeyerek dîninden dönüyor niu? diye sordum! Hayır! diye cevap verdin! işte kalplerin hoşnûdisi ile karıştığı zaman îman da böyledir. Sana: Onun tabileri artıyorlar mı, eksiliyorlar mı? diye sordum; arttıklarını söyledin ! işte îmân da tamam oluncaya kadar böyledir. Sana: Onunla hiç harb ettiniz mî? diye sordum. Onunla harhettiğinizi, aranızda geçen harblerin nevbetleşe olduğunu, kimi onun sizi mağlûb ettiğini, kimi de sizin onu mağlûb ettiğinizi söyledin! Nebiler de böyledir; (evvelâ) ibtilâ edilirler; sonra akıbet onların olur! Sana: Vefasızlık eder mi?, diye sordum. Vefasızlık etmezdiğini söyledin. Nebiler de böyledir; vefasızlık etmezler. Sana: Bu sözü ondan önce hiç bir kimse söyledi mi? diye sordum. Hayır! diye eevâp verdin! imdi ben de derim ki: Eğer bu sözü ondan önce biri söylemiş olsaydı, ben: Kendinden önce söylenmiş bir söze uyan bir adam!., derdim. Ebû Süfyan demiş ki: Bundan sonra: — Size neyi emrediyor? diye sordu. Ben : — Bize namazı, zekâtı, akrabaya yardımı ve iffeti emrediyor; dedim. — Eğer onun hakkında söylediklerin doğru ise o hakîkaten Peygamberdir. Onun çıkacağını biliyordum; ama sizden olacağını zannetmezdim. Ona kavuşacağımı bilsem mutlaka onunla görüşmek isterdim. Yanında olsam ayaklarını yıkardım! Onun mülkü behemehal ayaklarımın altındaki yere erişecektir! dedi. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem)'in mektubunu istedi; ve onu okudu. Bir de baktı ki mektupta şunlar var : «Rahman ve Rahîm olan Allah'ın adiyle: Allah'ın Resulü Muhammed'den Romalıların büyüğü Hirakl'e: Doğru yola tâbi' olana selâm!.. Bundan sonra: (malûmun olsun ki :) Ben seni islâm daveti ile davet ediyorum. Müslüman ol, selâmet bul! Müslüman ol da Allah senin ecrini iki defa versin! Şayet, yüz çevirirsen ırgatların, çiftçilerin vebali de muhakkak senin üzerine olur! Ey kitap ehli! Sizinle aramızda dosdoğru bir kelimeye gelin! Allah'tan başka hiç bir şeye tapmayalım! Ona hiç bir şeyi şerik koşmayalım! Allah'ı bırakıp da birbirimizi Rabb ittihâz etmeyelim! Eğer yüz çevirirlerse! Şahid olunki biz müslümanlarız! deyiverin!» [Al-i İmran 64] Mektubu okumayı bitirince yanında sesler yükseldi ve gürültü çoğaldı. Bizim için de emir verdi ve dışarı çıkarıldık. Çıktığımız vakit ben arkadaşlarıma: Artık ibni Ebî Kebşe'nin işi iştir!.. Ondan Benî Asfar'ın kıralı bile korkuyor! dedim. Ve artık Resûlullah (Sallallahu Aleyhi ve Sellem)'in muzaffer olacağına yüzde yüz inanmaya devam ettim. Nihayet Allah İslâm'ı bana nasib etti",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4608,
			"arabicnumber": "1773.02",
			"text": "{…} Bize bu hadîsi Hasen El-Hulvânî ile Abd b. Humeyd de rivayet ettiler. (Dedilerki): Bize Ya'kûb —ki ibni ibrahim b. Sa'd'dır— rivayet etti. (Dediki): Bize babam, Sâlih'den, o da ibni Şihâb'dan bu isnâdla rivayet etti. «Allah Kayser'in başından Acem ordularını defettikten sonra Allah'ın lütfuna şükür için Hıms'dan Beyt-i Makdis'e gitti-» Yine bu hadîste : «Allah'ın kulu ve Resulü Muhammed'den» dedi. (Erîsiyyîn yerine) «yerîsiyyîn» tâbirini kullandı. (Dîâyeti'l-islâm yerine) «dâiyeti'l-isIâm» dedi. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4609,
			"arabicnumber": "1774.01",
			"text": "Bana Yusuf b. Hammâd El-Ma'nî rivayet etti. (Dediki): Bize Abdüla'lâ, Saîd'den, o da Katâde'den, o da Enes'den naklen rivayet etti ki, Nebiyyullah (Sallallahu Aleyhi ve Sellem) Kisrâ'ya, Kayser'e, Necâşî'-ye ve her diktatöre mektup yazarak kendilerini Allah Teâlâ'ya da'vet etmiştir. Bu Necâşî cenaze namazını Peygamber (Sallallahu Aleyhi ve Sellem)'in kıldığı Necâşî değildir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4610,
			"arabicnumber": "1774.02",
			"text": "{…} Bize bu hadîsi Muhammed b. AbdiIIâh Er-Ruzzî de rivayet etti. (Dediki): Bize Abdülvehhâb b. Atâ', Saîd'den, o da Katâde'den naklen rivayet etti. (Demişki): Bize Enes b. Mâlik, Nebi (Sallallahu Aleyhi ve Sellem)'den bu hadîsin mislini rivayet etti. Ama: « Bu Necâşî, cenaze namazını Nebi (Sallallahu Aleyhi ve Sellem)'in kıldığı Necâşî değildir.» demedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4611,
			"arabicnumber": "1774.03",
			"text": "{…} Bana bu hadîsi Nasr b. Aliy El-Cehdamî dahî rivayet etti. (Dediki): Bana babam haber verdi. (Dediki): Bana Hâlid b. Kays. Katâde'den, o da Enes b. Mâlik'ten naklen rivayet etti. Fakat: «Bu Necâşî, cenaze namazını Nebi (Sallallahu Aleyhi ve Sellem)in kıldığı Necâşî değildir.» ifadesini anmadı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4612,
			"arabicnumber": "1775.01",
			"text": "Bana Ebû't Tâhir Ahmed b. Amr b. Şerh rivayet etti. (Dediki): Bize ibni Vehb haber verdi. (Dediki): Bana Yûnus, ibni Şi-hâb'tan naklen haber verdi. (Demişki): Bana Kesir b. Abbâs b. Abdilmuttalib rivayet etti. (Dediki): Abbâs şunları söyledi: Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte Huneyn harbinde bulundum. Ebû Süiyân b. Haris b. Abdülmuttalib ile ben Resûlullah (Sallallahu Aleyhi ve Sellem)'in peşine takılarak ondan ayrılmadık. Resulullah (Sallallahu Aleyhi ve Sellem) beyaz bir katırının üzerinde idi. Onu kendisine Ferve b. Nüfâsete'l-Cüzâmî hediyye etmişti. Müslümanlarla küffâr karşılaşınca müslümanlar dönüp gerilediler. Resûlullah (Sallallahu Aleyhi ve Sellem) ise katırını kâfirlere doğru mahmuzlamaya başladı. Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'in katırının geminden tutuyor; onu kopmasın diye men' ediyordum. Ebû Süfyân da Resûlullah (Sallallahu Aleyhi ve Sellem)'in özengisinden tutuyordu. Derken Resûlullah (Sallallahu Aleyhi ve Sellem): «Ey Abbasi Ashâb-ı semurayi çağır!» dedi. Abbâs sesi kuvvetli bir zatmış. (Demişki): — Ben de sesim çıkabildiğine: Ashâb-ı semûra nerede? diye haykırdım. Vallahi sesimi işittikleri vakit (yerlerine) dönüşleri, ineğin yavrularına dönüşü gibi idi. Ve: — Yâ lebbeyk!.. Yâ lebbeyk!.. diyerek küffarla harbettiler. Ensârı çağırmak için : Ey Ensâr cemaati! Ey Ensâr cemaati! diyorlardı. Sonra da'yet Benî Haris İbni'I-Hazrec'e inhisar etti. Ve: Yâ Benî Haris ibni'l-Hazrec! Yâ Benî Haris ibni'l-Hazrec! dediler. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) katırının üzerinde uzanmış gibi bir vaziyette onların çarpışmasına baktı da : «Bu, tandırın kızıştığı zamandır!» buyurdu. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) birkaç çakıl alarak onları küffarın yüzlerine attı ve: «Muhammed'in Rabbine yemîn olsun bozguna uğradılar!» dedi. Az sonra ben bakmağa gittim. Ne göreyim harb onun dediği şekilde!.. Vallahi o küffara attığı çakıllarından başka bir şey yapmamıştı. Artık onların kuvvetinin zayıfladığını, işlerinin gerilediğini gördüm durdum",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4613,
			"arabicnumber": "1775.02",
			"text": "Bize bu hadîsi ishâk b. ibrahim ile Muhammed b. Râfi' ye Abd b. Humeyd de hep birden Abdtirrazzâk'tan rivayet ettiler. (Dedilerki): Bize Ma'mer, Zührî'den bu isnâdla bu hadîsin mislini haber verdi. Yalnız o: «Fervetü'bnü Nüâmete'l-Cüzamî» demiş; bir de: «Kâ'be'nin Rabbine yemin olsun bozguna uğradılar! Kâ'be'nin Rabbine yemîn olsun bozguna uğradılar! demiştir. Bu hadiste şunu da ziyade etmiştir: «Nihayet Allah onları bozguna uğrattı. Ben Peygamber (Sallallahu Aleyhi ve Sellem)'i onların arkasında katırının üzerinde onu mahmuzlarken hâlâ görür gibiyim!»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4614,
			"arabicnumber": "1775.03",
			"text": "{…} Bize bu hadîsi ibni Ebî Ömer de rivayet etti, (Dediki): Bize Süfyân b. Uyeyne, Zührî'den rivayet etti. (Demişki): Bana Kesîr b. Abbâs, babasından naklen haber verdi. (Demişki): Huneyn harbi günü ben Nebi (Sallallahu Aleyhi ve Sellem)'le beraberdim... ve râvî hadîsi nakletmiştir. Şu kadar var ki, Yûnus'Ia Ma'mer'in hadîsleri ondan daha uzun ve daha tamamdır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4615,
			"arabicnumber": "1776.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki); Bize Ebû Hayseme, Ebû ishâk'tan naklen haber verdi. (Şöyle demiş): Bir adam Berâ'a: — Yâ Ebâ Umara! Siz Huneyn günü (harbten) kaçtınız mı? diye sordu. Berâ' şu cevabı verdi: — Hayır, vallahi! Resûlullah (Sallallahu Aleyhi ve Sellem) dönüp gitmedi. Lâkin şu var ki, ashabının gençleri ve aceleci takımı zırhsız, üzerlerinde silâh olmaksızın yahut çok silâh olmaksızın (meydana) çıkmışlardı. Ve atıcı, okları yere düşmeyen bir kavimle Hevâzin ve Benî Nasr toplulukları ile karşılaştılar. Bunlar kendilerini öyle bir ok yağmuruna tuttular ki, nerde ise okları hiç boşa gitmiyordu. Orada Resûlullah (Sallallahu Aleyhi ve Sellem)'in de üzerine yürüdüler. Resûlullah (Sallallahu Aleyhi ve Sellem) beyaz katırının üzerinde idi. Ebû Süfyân b. Haris b. Abdilmuttalib de onu yediyordu. Hemen (yere) inerek Allah'tan zafer diledi ve : «Nebi benim; yalan yok! Abdülmuttalib'in oğlu benim!» dedi. Sonra askerini sıraya dizdi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4616,
			"arabicnumber": "1776.02",
			"text": "Bize Ahmed b. Cenâb EI-Missîsi rivayet etti. (Dediki): Bize îsâ b. Yûnus, Zekeriyyâ'dan, o da Ebû ishâk'dan naklen rivayet etti. (Şöyle demiş) : Berâ'a bir adam gelerek: — Siz Huneyn günü dönüp gittinizmi yâ Ebâ Umara? diye sordu. Bunun üzerine Berâ' şunları söyledi: — Nebiyyullah (Sallallahu Aleyhi ve Sellem)'e şehâdet ederim ki dönüp gitmedi. Lâkin insanların aceleci takımı ve zırhsızlar Hevâzin'in şu kabilesine gittiler. Halbuki onlar atıcı bir kavimdir. Kendilerini ok yağmuruna tuttular. Sanki bu oklar bir çekirge sürüsü idi. Derken bozuldular. Düşman ResûluIIah (Sallallahu Aleyhi ve Sellem)'e doğru yöneldi. Ebû Süfyân b. Haris katırını yediyordu. Derken (yere) indi. Dua etti ve zafer diledi. Hem: «Nebi benim; yalan yok! Abdülmuttalib'in oğlu benim! Allahım, yardımını indir !» diyordu. Berâ' demiş ki: «Vallahi harb kızıştı mı biz onunla korunuyorduk! Bizim cesurumuz onunla (yâni) Nebi (Sallallahu Aleyhi ve Sellem)'le bir hizada durandı.»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4617,
			"arabicnumber": "1776.03",
			"text": "Bize Muhammed b. El-Müsennâ ile ibni Beşşâr da rivayet ettiler. Lâfız ibni'l-Müsennâ'nındır. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Ebû ishâk'tan, rivayet etti. (Demişki): Berâ'dan dinledim; kendisine Kays (kabilesin) den bir adam: — Siz Huneyn günü Resûlullah (Sallallahu Aleyhi ve Sellem)'den kaçtınızmı? diye sordu da Berâ' şunları söyledi: — lâkin Resûlullah (Sallallahu Aleyhi ve Sellem) kaçmadı. O gün Hevâzin (kabilesi) atıcı idiler. Ama biz üzerlerine hücum edince bozuldular. Biz de ganimetlerin üzerine çullandık. Derken bizi oklarla karşıladılar. Gerçekten Resûlullah (Sallallahu Aleyhi ve Sellem)'i beyaz katırının üzerinde gördüm. Ebû Süfyân b. Haris de geminden tutmuştu. Kendisi: «Nebi benim; yalan yok! Abdölmuttalib'in oğlu benim!» diyordu",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4618,
			"arabicnumber": "1776.04",
			"text": "{…} Bana Züheyr b. Harb ile Muhammed b. El-Müsennâ ve Ebû Bekir b. Hellâd da rivayet ettiler. (Dedilerki): Bize Yahya b. Saîd, Süfyân'dan rivayet etti. (Demişki): Bana Ebû ishâk, Berâ'dan rivayet etti Berâ' kendisine bir adamın: Yâ Ebâ Umara! dediğini söylemiş... Ve râvi hadîsi anlattı. Ama onun hadîsi ötekilerden daha az; onların hadîsi daha tamamdır. İzah 1777 de",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4619,
			"arabicnumber": "1777",
			"text": "Bize yine Züheyr b. Harb rivayet etti. (Dediki): Bize Ömer b. Yûnus El-Hanefi rivayet etti. (Dediki): Bize ikrime b. Amrnâr rivayet etti. (Dediki): Bana lyâs b. Seleme rivayet etti. (Dediki): Bana babam rivayet etti. (Dediki): Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte Huneyn'de harbettik. Düşmanla karşılaşınca ben ilerledim; ve bir dağ yoluna çıktım. Derken karşıma düşmandan bir adam çıktı. Ben de kendisine bir ok attım. Hemen gözümden kayboldu. Ne yaptığını anlamadım. Bir de baktım; düşman o bir yoldan çıkıverdi! Ve derhal Nebi (Sallallahu Aleyhi ve Sellem)'in ashâbı dönüp çekildiler. Ben de bozulmuş olarak geri döndüm. Üzerimde iki elbise vardı. Birisi ile sarınmış, diğeri ile de bürünmüştüm. Derken peştemalim çözüldü. Ben de ikisini birden topladım. Ve bozulmuş olarak Resûlullah (Sallallahu Aleyhi ve Sellem)'in yanına uğradım. Kendisi benekli beyaz katırının üzerinde idi. Ve: «Ekva'ın oğlu muhakkak bir korku gördü!» dedi. Düşmanlar Resûlullah {Sallallahu Aleyhi ve Sellem)'i kuşatınca katırdan indi. Sonra yerden bir avuç toprak aldı. Ve yüzlerine karşı dönerek : «Bu yüzler kahrolsun!» buyurdu. Artık onlardan Allah'ın yarattığı hiç bir insan yoktu ki, bu avuç tan gözlerini toprakla doldurmasın! Az sonra savuşup gittiler. işte Allah (Azze ve Celle) onları bozguna uğrattı. Resûlullah (Sallallahu Aleyhi ve Sellem) de ganimetlerini müslümanlar arasında taksim etti",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4620,
			"arabicnumber": "1778",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb ve îbnü Numeyr, toptan Süfyân'dan rivayet ettiler. Züheyr (Dediki): Bize Süfyân b. Uyeyne, Amr'dan, o da a'mâ şâir Ebû'l-Abbâs'tan, o da Abdullah b. Amr'dan naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) Tâif halkını muhasara etti. Ama onlardan bir şey elde edemedi. Ve: «Biz Inşaallah dönüyoruz!» buyurdu. Ashabı: — Dönüyoruz ama onu fethetmedik! dediler. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) onlara «Sabahleyin harbe hazır olun!» buyurdu. Ertesi gün harbe hazırlandılar; fakat yaralandılar. Resûlullah (Sallallahu Aleyhi ve Sellem) (tekrar) : «Biz yarın dönüyoruz!» buyurdu. Bu söz onların hoşuna gitti. Resûlullah (Sallallahu Aleyhi ve Sellem) de güldü",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4621,
			"arabicnumber": "1779",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Affân rivayet etti. (Dediki): Bize Hammâd b. Seleme, Sâbit'den, o da Enes'den naklen rivayet etti ki, ResûlüIIah (Sallallahu Aleyhi ye Sellem) Ebû Süfyân'ın gelişini duyduğu vakit müşavere yapmış. Enes şöyle demiş : —Evvelâ Ebû Bekir konuştu; Nebi (Sallallahu Aleyhi ve Sellem), ona iltifat etmedi. Sonra Ömer konuştu; ona da iltifat etmedi. Bunun üzerine Sa'd b. Ubâde kalkarak: — Biz/mi kasdediyorsun yâ Resûlâllah? Nefsim yed-i kudretinde olan Allah'a yemin ederim ki, sen bize atlarımızı denize daldırmamızı emretsen daldırırız! Onları Berkü'l-Gemâd'a sürmemizi emretsen bunu da yaparız! dedi. Bunu müteakıb Resûlullah (Sallallahu Aleyhi ve Sellem) halkı davet etti. Onlar da yola revân olarak Bedr'e indiler. Derken yanlarına Kureyş'in sucuları geldi. içlerinde Benî Haccâc kabilesinin siyah bir kölesi de vardı. Hemen onu derdest ettiler. Resûlullah (Sallallahu Aleyhi ve Sellem)'in ashabı ona Ebû Süfyân'la arkadaşlarını soruyorlardı. O da: — Ebû Süfyân hakkında bilgim yok. Ama işte Ebû Cehil, Utbe, Şeybe ve Ümeyyetü'bnü Halef!., diyordu. Bunu söylediği vakit onu dövüyorlardı. O da : — Evet! Ben size haber vereceğim! işte Ebû Süfyân! diyordu. Kendisini bırakıp da sorarlarsa : — Ebû Süfyân hakkında bilgim yok! Ama işte Ebû Cehil, Utbe, Şeybe ve Ümeyyetü'bnü Halef insanların içinde!., diyordu. Bunu söyledi mi kendisini yine dövüyorlardı. Resûlullah (Sallallahu Aleyhi ve Sellem) de kalkmış namaz kılıyordu. Bunu görünce namazdan çıktı: «Nefsim yed-i kudretinde olan Allah'a yemîn ederim ki, size doğruyu söylediği vakit onu dövüyorsunuz; yalan söyledi mi bırakıyorsunuz!» buyurdular. Enes demiş ki: Bir de Resûlullah (Sallallahu Aleyhi ve Sellem): «Şurası filânın düşeceği yerdir!» diyor; ve elini yerde oraya buraya koyuyordu. Ve müşriklerden hiç biri Resûlullah (Sallallahu Aleyhi ve Sellem)'in elinin yerinden öteye geçmedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4622,
			"arabicnumber": "1780.01",
			"text": "Bize Şeybân b. Ferrûh rivayet etti. (Dediki): Bize Süleyman b. Muğîre rivayet etti. (Dediki): Bize Sabit EI-Bünânî, Abdullah b. Rabâh'dan, o da Etû Hureyre'den naklen rivayet etti. Abdullah şöyle demiş: — Muâviye'ye bir takım hey'etler geldi. Bu, ramazanda idi. Biz birbirimize yemek yapıyorduk. Ebû Hureyre bizi kendi menziline çok davet edenlerdendi. Ben de dedim ki : — Beri bakın! Ben yemek yapıyorum; cemaati de benim menzilime davet ediyorum! Müteakiben yemek yapılmasını emrettim. Sonra akşam üzeri Ebû Hureyre'ye tesadüf ettim; ve : — Bu gece davet bendedir! dedim. — Benî geçtin mi? dedi. — Evet! cevâbını verdim; ve kendilerini davet ettim. Derken Ebû Hureyre: — Sizlere sizin hadisinizden bir hadîs bildireyimmi ey Ensâr cemaati? dedi. Sonra Mekke'nin fethini anlattı ve şunları söyledi : — Resûlullah (Sallallahu Aleyhi ve Sellem) gelerek Mekke'ye, dayandı. Ve Zübeyr'i bir cenaha, Hâlid-i diğer cenaha gönderdi. Ebû Ubeyde'yi de zırhsızlara kumandan gönderdi. Bunlar vadinin ortasını tuttular. Resûlullah (Sallallahu Aleyhi ve Sellem) de bir bölüğün içinde idi. Bir baktı; beni gördü. Ve: «Ebû Hureyre!» dedi. Ben: — Buyurun ya Resûlâllah! dedim. «Bana ancak bîr Ensâri gelir!» buyurdu. Seyban'dan başkaları şunu da ziyade ettiler: «Bana Ensâri çağır!» dedi. Ensâr derhal etrafını sardılar. Kureyş kendine muhtelif kabilelerden bir takım serseriler ve tâbi'ler toplamıştı. — Bunları ileri sürelim. Şayet ellerine bir şey geçerse onlarla beraber oluruz. isabet alırlarsa bizden istenileni veririz! dediler. Resûlullah (Sallallahu Aleyhi ve Sellem) de : «Kureyş'in serserilerine ve tâbi'lerine bakın!» buyurdu. Ve iki elini birbiri üzerine kavuşturarak (onların toplu haline) işaret etti. Sonra : «Bana Safa'da yetişinceye kadar (Allah'a, emanet olun?)!..» buyurdu. Müteakiben yürüdük. Artık bizden kim birini öldürmek isterse onu öldürüyordu. Onlardan hiç bir kimse bize bir şey gönderemiyordu. Derken Ebû Süfyân gelerek: — Yâ Resûlâllah! Kureyş cemâati ifna edilmiştir. Bu günden sonra Kureyş yoktu! dedi. Bundan sonra Nebi (Sallallahu Aleyhi ve Sellem): «Kim Ebû Süfyân'ın evine girerse o emniyettedir!» buyurdular. Bunun üzerine Ensâr birbirlerine: — Bu zâta memleketi için rağbet, kabilesi için şefkat geldi! dediler. Etû Hureyre demiş ki: (Bu arada) vahiy geldi. Vahiy geldiği zaman bize gizli kalmazdı. Bir geldi mi artık o geçinceye kadar bizden birimiz gözünün ucunu Resûlullah (Sallallahu Aleyhi ve Sellem)'e kaldırmazdı, Vahiy geçtikten sonra Resûlullah (Sallallahu Aleyhi ve Sellem): «Ey Ensâr cemaati!» diye seslendi. — Buyurun yâ Resûlâllah! dediler. «Siz: Bu zata memleketi için rağbet geldi!., dediniz» Ensâr; — Böyle bir şey oldu! dediler. «Hakka ki, ben Allah'ın kulu ve Resulüyüm! Allah'a ve sizlere hicret ettim. Hayât sîzin hayâtınız; memat sizin memâtınızdır!» buyurdular. Bunun üzerine Ensâr ağlayarak yanına geldiler; ve: — Vallahi biz o söylediklerimizi ancak Allah ve Resulüne kıyamadığımız için söyledik! diyorlardı. Resûlullah (Sallallahu Aleyhi ve Sellem) de: «Şüphesiz Allah ye Resulü sizi tasdik ediyor ve ma'zûr görüyorlar!» buyurdu, Arkacığından halk Ebû Süfyân'ın evine yöneldiler. Herkes kapılarını kapadı. Resûlullah (Sallallahu Aleyhi ve Sellem) de geldi. Tâ Hacer (i esved) e yanaştı. Ve onu öptü. Sonra Beytî tavaf etti. Beytin yanı başında bir putun başına vardı —ki Mekkeliler bu puta taparlardı— Resûlullah (Sallallahu Aleyhi ve Sellem)'in elinde bir yay vardı: Yayın eğri tarafından tutmuştu. Bu putun başına varınca onu gözüne dürtüyor ve : «Hak geldi; bâtıl muzmahil oldu!» diyordu. Tavafını bitirince Safâ'ya geldi ve üzerine çıkarak Kâ'beye baktı. Ellerini kaldırarak Allah'a hamd etmeğe ve dilediği duayı okumaya başladı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4623,
			"arabicnumber": "1780.02",
			"text": "Bu hadîsi bana Abdullah b. Hâşim de rivayet etti. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Süleyman b. Mugîra bu isnadla rivayette bulundu. O bu hadîste şunu ziyâde etmiştir: «Sonra iki eli ile —biri diğerinin üzerinde olduğu halde— onları adam akıllı biçinl diye işaret etti.» Şunu da söylemiştir! «Ashâb:Biz bunu söyledik yâ Resûlâllah! dediler. «O halde benim ismim nedir? Hakka ki, ben Allah'ın kulu ve Resulüyüm! buyurdu.»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4624,
			"arabicnumber": "1780.03",
			"text": "Bana Abdullah b. Abdirrahmân Ed-Dârimî rivayet etti. (Dediki): Bize Yahya b. Hassan rivayet etti. (Dediki): Bize Hammâd b. Seleme rivayet etti. (Dediki): Bize Sabit Abdullah b. Rabâh'dan naklen haber verdi. Şöyle demiş: — Aramızda Ebû Hureyre de olduğu halde Muâviye b. Ebî Süfyân'a hey'et olarak geldik. Bizden herkes arkadaşlarına bir gün yemek yapıyordu. Benim nevbetimdi: — Yâ Ebâ Hureyre, bugün benim nevbetimdir! dedim. Müteakiben menzilime geldiler; fakat yemeğimiz yetişmedi. Ben: — Yâ Ebâ Hureyre, yemeğimiz yetişinceye kadar bize Resûlullah (Sallallahu Aleyhi ve Sellem)'den hadîs rivayet etsene! dedim. Bunun üzerine şunları söyledi: — Fetih günü Resûlullah (Sallallahu Aleyhi ve Sellem)'le beraberdik. Hâlid b. Velîd'i sağ cenaha, Zübeyr'i sol cenaha, Ebû Ubeyde'yi de piyadenin üzerine ve vadinin ortasına kumandan tayin etti. Az sonra : «Yâ Ebâ Hureyre! Bana Ensâr'ı çağır!» buyurdu. Ben de onları çağırdım. Hemen koşarak geldiler. (Onlara) : «Ey Ensâr cemaati! Kureyş'in serserilerini görüyor musunuz? buyurdu. — Evet! dediler. «Bakın! Yarın onlarla karşılaştığınızda onları adamakıllı biçmelisiniz!» buyurdu ve eliyle işaret ederek sağ elini sol elinin üzerine koydu. (Kumandanlara) : «Buluşma yeriniz Safâ'dır!» buyurdular. Artık o gün karşılarına kim çıktı ise onu uyuttular. Resûlullah (Sallallahu Aleyhi ve Sellem) Safâ'ya çıktı. Derken Ensâr gelerek Safâ'da tavaf ettiler. Müteakiben Ebû Süfyân geldi ve : — Yâ Resûlâllah! Kureyş cemaati ifna edilmiştir. Bugünden sonra Kureyş yoktur! dedi. Ebû Süfyân demiş ki: Resûlullah (Sallallahu Aleyhi ve Sellem): «Kim Ebû Süfyân'ın evine girerse o emindir! Kim silâhı bırakırsa o da emindir! Kim kapısını kaparsa o da emindir!» buyurdu. Bunun üzerine Ensar: — Bu zâta kabilesine karşı şefkat ve vatanına rağbet geldi!» dediler. Derken Resûlullah (Sallallahu Aleyhi ve Sellem)'e vahiy indi. «Siz: Bu adama kabilesine karşı şefkat ve vatanına rağbet geldi!.. dediniz. Beri bakın! O halde benim ismim nedir? dedi. Bunu üç defa tekrarladı. Ben Muhammed, Allah'ın kulu ve Resulüyüm! Allah'a ve sizlere hicret ettim. Binâenaleyh hayât sizin hayatınız; memat da sizin mematınızdır!» buyurdu. Ensâr: — Vallahi biz bu sözü Allah ve Resulüne kıyamadığımız için söyledik! dediler. «işte Allah ve Resulü de sîzi tasdik ediyor; ve sizi ma'zûr görüyorlar!» buyurdu. Resûlullah (Sallallahu Aleyhi ve Sellem)'in bu harbte Ensârı çağırtması onlara i'timâd ettiği içindir. Bir de mertebelerinin yüksekliğini, kıymet ve hususiyetlerini göstermek istemiştir. Resûlullah (Sallallahu Aleyhi ve Sellem):",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4625,
			"arabicnumber": "1781.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Amru'n-Nâkıd ve ibnl Ebî Ömer rivayet ettiler. Lâfız ibni Ebî Şeybe'nindir. (Dedilerki): Bize Süfyân b. Uyeyne, ibnı Ebî Necîh'dan, o da Mücâhid'den, o da Ebû Ma'mer'den, o da AbduIIah'dan naklen rivayet etti. Şöyle demiş : Nebi (Sallallahu Aleyhi ve Sellem) Mekke'ye, Kâ'be'nin etrafında üç yüz altmış put olduğu halde girdi. Ve onlara elinde bulunan bir sopa ile dokunarak: «Hak geldi; bâtıl muzmahil oldu! Bâtıl zâten müzmahiI olagelmiştir! Hak geldi; bâtıl ne yoktan var eder; ne de yok olanı iade!» diyordu. ibni Ebî Ömer: «Fetih günü» kaydını ziyâde etmiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4626,
			"arabicnumber": "1781.02",
			"text": "{…} Bize bu hadîsi Hasan b. Aliy EI-Hulvâni ile Abd b. Humeyd dahî ikisi birden Abdürrazzâk'dan rivayet ettiler. (Demişki): Bize Sevrî, ibnü Ebî Necîh'dan naklen bu isııâdla «zehûkân»'a kadar haber verdi. Diğer âyeti anmadı. Ve (hadîsteki) nusuben yerine sanemen dedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4627,
			"arabicnumber": "1782.01",
			"text": "Bize Ebû Bekir b. Ebî Şeyhe rivayet etti. (Dediki): Bize Aliy b. Müshir ile Vekî', Zekeriyyâ'daıı, o da Şa'bi'den naklen rivayet etti. (Demişki): Bana Abdullah b. Muti', babasından rivayet etti. (Şöyle demiş) : Mekke fethedildiği gün Peygambsr (Sallallahu Aleyhi ve Sellem)'i: «Bugünden sonra kıyamet gününe kadar hiç bir Kureyşli sabır yolu ila öldürülmiyecektir!» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4628,
			"arabicnumber": "1782.02",
			"text": "Bize İbnü Numeyr rivayet etti. (Dediki): Bize la anı rivayet etti. (Dediki): Bize Zekeriyyâ bu isnâdla rivayet etti. Şunu dn ziyade etti: «Dediki: Kureyş'in Asî (isimli) lerinden Mutî'den başka müslüman olan yoktu. Muti'in ismi Âsî idi. Resûlullah (Sallallahu Aleyhi ve Sellem) ona Muti* adını verdi.»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4629,
			"arabicnumber": "1783.01",
			"text": "Bana Ubeydullah b. Muâz El-Anberî rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, Ebû ishâk'dan naklen rivayet etti. (Demişki): Bera' b. Âzib'i şunları söylerken işittim: Aliy b. Ebî Tâlib Hudeybiye günü Nebi (Sallallahu Aleyhi ve Sellme)'le müşrikler arasındaki anlaşmayı yazdı ve: «Bu, Resûlullah Muhammed'in üzerine yazışma yaptığı sulhnâmedir.» diye yazdı. Müşrikler: — Resûlullah (kelimesini) yazma! Biz senin Resûlullah olduğunu bilsek seninle fıarbetmezdik! dediler. Bunun üzerine Nebiyyullah (Sallallahu Aleyhi ve Sellme) Alî'ye: «Sil onu!» buyurdu. Ali: — Onu silecek ben değilim! dedi. Artık onu Nebi (Sallallahu Aleyhi ve Sellme) kendi eli ile sildi. Koştukları şartlar arasında Mekke'ye girip orada üç gün kalmak, fakat oraya silâhla değil de ancak silâhın cülübhânı ile girmek de vardı. Ben Ebû ishâk'a : Silâhın cülübbânı nedir? diye sordum. — Dağarcık ve onun içindekidir; dedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4630,
			"arabicnumber": "1783.02",
			"text": "Bize Muhammed b. El-Müsennâ ile ibni Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti, (Dediki): Bize Şu'be, Ebû ishâk'dan rivayet etti. (Demişki): Berâ' b. Âzib'i şunları söylerken işittim : Resûlullah (Sallallahu Aleyhi ve Sellem) Hudeybiye halkı ile anlaşma yaptığı vakit Alî, aralarında bir nâme yazdı. Ve «Resûlullah Muhammed» diye kaydetti... Bundan sonra râvi Muâz hadîsi gibi nakletmiş; ancak o bu hadîste: «Üzerine yazışma yaptığı sulhnâme budur!» ifâdesini anmamıştır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4631,
			"arabicnumber": "1783.03",
			"text": "Bize ishâk b. ibrahim El-Hanzalî ile Ahmed b. Cenâb EI-Missîsî hep birden îsâ b. Yûnus'dan rivayet ettiler. Lâfız îshâk'ındır. (Dediki): Bize îsâ b. Yûnus haber verdi. (Dediki): Bize Zekeriyyâ, Ebû îshâk'dan, o da Berâ'dan naklen haber verdi. Berâ' şöyle demiş : Nebi (Sallallahu Aleyhi ve Sellem) Beyt-i Şerifin yanında durdurulunca Mekke halkı onunla : Mekke'ye girerek üç gün orada kalmak, oraya sadece silâh dağarcığı yâni bir kılıç ve kını île girmek, beraberin de Mekkeliler'den kimseyi çıkarmamak, yanındakilerden Mekke'de kalmak isteyen bir kimseye mâni olmamak şartı ile bir anlaşma yaptılar. Alî'ye : «Aramızdaki şartı yaz! Rahman ve Rahim olan Allah'ın adı ile : Bu, Resûlullah Muhammed'in imza ettiği sulhnâmedir!» buyurdu. Müşrikler: — Biz senin Resûlullah olduğunu bilsek sana tâbi' olurduk! Lâkin sen Muhammed b. Abdillâh yaz! dediler. O da Alî'ye bunu silmesini emretti. Fakat Alî: — Hayır, vallahi! Ben onu silemem! dedi. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) : «Bana onun yerini göster!» dedi. O da yerini gösterdi. Ve o cümleyi sildi de: «İbni Abdillâh» diye yazdı. Artık orada üç gün kaldı. Üçüncü gün olunca Alî'ye: — Bu seninkinin şartının son günüdür: Ona emret de çıksın! dediler. O da kendilerine bunu haber verdi. Fahr-i Kâinat: «Peki!» buyurdu ve çıktı. ibni Cenâb kendi rivayetinde «sana tâbi' olurduk» yerine «sana bey'at ederdik» demiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4632,
			"arabicnumber": "1784",
			"text": "Bize Ebû Bekir b. Ebi Şeybe rivayet etti. (Dediki): Bize Affân rivayet etti. (Dediki): Bize Hammâd b. Seleme, Sabit'den, o da Enes'den naklen rivayet etti ki, Kureyş, içlerinde Süheyl b. Amr olduğu halde Nebi (Sallallahu Aleyhi ve Sellem)'le sulh yapmışlar. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) Alî1'ye ; «Besmeleyi yaz!» buyurmuş. Süheyl: — Bismillâha gelince: Biz besmelenin ne olduğunu bilmiyoruz. Lâkin sen bizim bildiğimiz «Senin adınla Allahım!» İbaresini yaz! demiş. Sonra Peygamber (Sallallahu Aleyhi ve Sellem): «Allah'ın Resulü Muhammed'den yaz!» buyurmuş. Müşrikler: — Biz senin Resûlullah olduğunu bilsek sana tâbi' olurduk! Lâkin sen kendi isminle babanın ismini yaz! demişler. Bunun üzerine Peygamber (Sallallahu Aleyhi ve Sellem)'i: «Muhammed b. Abdillâh'dan diye yaz!» buyurmuş. Müşrikler Peygamber (Sallallahu Aleyhi ve Sellem)'e: Sizden (bize) gelen olursa onu size iade etmiyeceğiz; ama bizden size kim giderse siz onu bize iade edeceksiniz! dîye şart koşmuşlar. Ashâb: — Yâ Resûlâllah, bunu yazalım mı? diye sormuşlar. «Evet! Gerçekten bizden kim onlara giderse Allah onu ırak etsin! Onlardan bize gelene ise Allah bir ferahlık ve çıkar yol halkedecektir!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4633,
			"arabicnumber": "1785.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdullah b. Numeyr rivayet etti. H. Bize ibni Numeyr de rivayet etti. ikisinin lâfızları birbirine yakındır. (Dediki): Bize babam rivayet etti. (Dediki): Bize Abdülâzîz b. Siyah rivayet etti. (Dediki): Bize Habîb b. Ebî Sabit, Ebû Vail'den naklen rivayet etti. (Şöyle demiş) : Sıffîn (harbi) günü Sehl b. Huneyf ayağa kalkarak şunları söyledi: Ey insanlar! Kendinizi itham edin! Yemîn olsun biz Hudeybiye günü Resûlullah (Sallallahu Aleyhi ve Sellem)'le beraberdik! Şayet harbe lüzûm görseydik mutlaka harbederdik! Bu söylediğim, Resûlullah (Sallallahu Aleyhi ve Sellem)'le müşrikler arasındaki sulhda idi. Derken Ömer b. Hattâb gelerek Resûlullah (Sallallahu Aleyhi ve Sellem)'e vardı; ve: — Yâ Resûlâllah! Biz hak, onlar bâtıl üzerinde değil miyiz? dedi. «Evet, öyle!» buyurdular. — Bizim Ölülerimiz cennette, onların ölüleri cehennemde olacak değil mi? dedi. «Evet, öyle!» buyurdular. — Öyle ise neye dînimiz hususunda bu aşağılığı gösteriyoruz da henüz Allah onlarla bizim aramızda bir hüküm vermemişken geri dönüyoruz? dedi. Resulü Ekrem (Sallallahu Aleyhi ve Sellem) şöyle buyurdular : «Ey Hattâb oğlu! Ben gerçekten Allah'ın Resulüyüm! Allah beni ebediyyen zayi* etmezi» Bunun üzerine Ömer sabretmedi de kızarak oradan gitti ve Ebû Bekr'e gelerek: — Yâ Ebâ Bekr! Biz hak, onlar bâtıl üzerinde değil miyiz? dedi. Ebû Bekir: — Evet, öyle!» cevâbını verdi. — Bizim Ölülerimiz cennette, onların ölüleri cehennemde olacak değil mi? — Evet, öyle! — O halde neye dînimiz hususunda bu aşağılığı gösteriyoruz da henüz Allah onlarla bizim aramızda bir hüküm vermemişken geri dönüyoruz? dedi. Ebû Bekir şu karşılığı verdi: — Ey Hattâb oğlu! O gerçekten Allah'ın Resulüdür. Allah onu ebediyyen zayi' etmez!..» Arkacığından Resûlullah (Sallallahu Aleyhi ve Sellem)'e fetih (müjdesi) le Kur'ân indi. Ve Ömer'e haber göndererek onu kendisine okuttu. Ömer : — Yâ Resûlâllah! Bu fetih midir? dedi. «Evet!» cevâbını verdiler. Artık Ömer'in gönlü oldu ve döndü",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4634,
			"arabicnumber": "1785.02",
			"text": "Bize Ebû Kureyb Muhammed b. Alâ' ile Muhammed b. Abdillâh b. Numeyr rivayet ettiler. (Dedilerki): Bize Ebû Muâviye, A'meş'den, o da Şakîk'dan naklen rivayet etti. (Demişki): Ben Sehl b. Huneyfi Sıffin'de şunları söylerken işittim: Ey insanlar! Kendi re'yinizi itham edin! Vallahi ben kendimi Ebû Cendel günü görmüşüm dür! Şayet Resûlullah (Sallallahu Aleyhi ve Sellem)'in emrini reddetmek elimden gelseydi onu mutlaka reddederdim. Vallahi biz ne zaman bir işin neticesine kadar kılıçlarımızı boynumuza astı isek, bizi bildiğimiz bir şeye kolaycacık ulaştırmışlardır. Yalnız sizin şu işiniz müstesna! ibnü Numeyr «ilâ emrin kattu- ifadesini anmadı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4635,
			"arabicnumber": "1785.03",
			"text": "{…} Bize bu hadîsi Osman b. Ebi Şeybe ile ishâk da hep birden Cebîr'den rivayet ettiler. H. Bana Ebû Saîd El-Eşecc de rivayet etti. (Dediki): Bize Yeki' rivayet etti. Bu râvilerin ikisi birden A'meş'den bu isnadla rivayette bulunmuşlardır. ikisinin hadîsinde de : «Bizi kepaze edecek bir şeye kadar» fâdesi vardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4636,
			"arabicnumber": "1785.04",
			"text": "Bana ibrahîm b. Saîd El-Cevheri de rivayet etti. (Dediki): Bize Ebû Usâme, Mâlik b. Miğvel'den. o da Ebû Hasîn'den, o da Ebû Vaîl'den naklen rivayet etti. (Demişki): Ben Sehl b. Huneyf'i Siffîn'de şunları söylerken işittim: — Dîniniz üzerine (baş kaldıran) re'yimzi itham edin! Yemin olsun ben kendimi Ebû Cendel günü görmüşümdür. ResûlüllaK (Sallallahu Aleyhi ve Sellem)'in emrini reddetmeye bir gücüm yetse idi!.. Şu işinizin bir tarafını tıkar tıkamaz hemen o bir taraf üzerimize fışkırmıştır! İzah 1786 da",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4637,
			"arabicnumber": "1786.01",
			"text": "Bize Nasr b. Aliy El-Cehdamî rivayet etti. (Dediki): Bize Hâlid b. Haris rivayet etti. (Dediki): Bize Saîd b. Ebî Arûbe, Katâde'den naklen rivayet etti ki, kendilerine Enes b. Mâlik rivayet etmiş. (Demişki): Hudeybiye'den dönüşte: Biz sana apaçık bir fetih sağladık. Allah sana gelmiş geçmiş bütün günahlarını bağışlasın diyen âyet-i kerîmesi: Bu, Allah indinde büyük bir kurtuluştur! âyetine kadar indiği vakit ashabı gam ve gussa almıştı. Nebi (Sallallahu Aleyhi ve Sellem) hedy kurbanını Hudeybiye'de boğazlamıştı. işte o zaman : «Bana öyle bir âyet indirildi ki, benim için bütün dünyadan daha makbuldür!» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4638,
			"arabicnumber": "1786.02",
			"text": "{…} Bize Asım b. Nııdr El-Temîmî de rivayet etti. (Dediki): Bize Mu'temir rivayet etti. (Dedîki): Babamdan dinledim. (Dediki); Bize Katâde rivayet etti. (Dediki): Ben Enes b. Mâlik'ten dinledim. H. Bize ibnü'l-Müsennâ da rivayet etti. (Dediki): Bize Ebû Dâvûd rivayet etti. (Dediki): Bize Hemmâm rivayet etti. H. Bize Abd h. Humeyd dahî rivayet etti. (Dediki): Bize Yûnus b. Muhammed rivayet etti. (Dediki): Bize Şeybân rivayet etti. Bu râvHcrin hepsi Katâde'den, o da Enes'den naklen ibni Ebî Arûbe'nin hadîsi gibi rivayette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4639,
			"arabicnumber": "1787",
			"text": "Bize Ebû Bekir h. Ebî Şeybe rivayet etti. (Demişki): Bize Ebû Usâme, Velîd b. Cümey'den rivayet etti. (Demişki): Bize Ebû't-Tufeyl rivayet etti. (Dediki): Bize Huzeyfetü'bnü'I-Yemân rivayet etti. (Dediki): Bedir'de bulunmamdan beni meneden bir şey yoktu. Şu kadar var ki ben, babam Huseyl ile beraber (yola) çıktım da bizi Kureyş kâfirleri yakaladılar. — Siz muhakkak Muhammed'in yanına gitmek istiyorsunuz! dediler. — Biz onun yanına gitmek istemiyoruz; biz ancak Medine'ye gitmek istiyoruz! dedik. Bunun üzerine bizden mutlaka Medine'ye gideceğimize, onunla birlikte harb etmiyeceğimize Allah'a ahdü misâk aldılar. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek bu haberi kendisine ilettik de: «Haydi gidin! Biz onlara verdiğimiz sözü tutar; onlara galebe için Allah'tan yardım dileriz!» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4640,
			"arabicnumber": "1788",
			"text": "Bize Züheyr b. Harb ile ishâk b. ibrahim hep bîrden Cerîr'den rivayet ettiler. Züheyr (Dediki): Bize Cerîr, A'meş'den, o da ibrahim Et-Teymî'den, o da babasından naklen rivayet etti. Şöyle demiş: Huzeyfe'nin yanında idik. Bir adam: — Resûlullah (Sallallahu Aleyhi ve Sellem)'e yetişsem onunla birlikte harp eder; kendimi gösterirdim! dedi. Bunun üzerine Huzeyfe şunları söyledi: — Bunu sen mi yapacaktın? Vallahi ben kendimizi Ahzâb (harbi) gecesi Resûlullah (Sallallahu Aleyhi ve Sellem)'e birlikte görmüşümdür! Bizi şiddetli bir rüzgâr ve soğuk yakalamıştı. Derken Resûlullah (Sallallahu Aleyhi ve Sellem): «Bana bu kavmin haberini getirecek bir adam yok mu? Allah onu kıyamet gününde benimle beraber haşredecektir!» buyurdu. Biz sustuk. Kendisine bizden hiç bir kimse cevâb vermedi. Sonra (tekrar) : «Bize bu kavmin haberini getirecek bir adam yok mu? Allah onu kıyamet gününde benimle beraber haşredecektir!» buyurdular. Biz (yine) sustuk! Kendisine bizden hiç bir kimse cevap vermedi. Sonra (yine) : «Bize bu kavmin haberini getirecek bir adam yok mu? Allah onu kıyamet gününde benimle beraber haşredecektir!» buyurdu. Biz (yine) sustuk. Kendilerine bizden hiç bir kimse cevap vermedi. Bunun üzerine: «Kalk yâ Huzeyfe! Bize bu (düşman) kavmin haberini getir!» buyurdu. Çâre bulamadım; çünkü ismimle beni kalkmaya davet etmişti!.. «Git de bana bu kavmin haberini getir! Ama onları aleyhime kışkırtma!» buyurdu. Onun yanından çekildiğim zaman hamamda yürüyor gibi oldum. Nihayet düşmanlara vardım. Baktım ki, Ebû Süfyân sırtını ateşle ısıtıyor. Hemen yayın içine bir ok koydum ve ona atmak istedim. Fakat Resûlullah (Sallallahu Aleyhi ve Sellem)'in : «Ama onları aleyhime kışkırtma!» sözünü hatırladım. Atmış olsam onu mutlaka vururdum! Sonra döndüm ama yine hamamda yürüyor gibi idim. Resûlullah (Sallallahu Aleyhi ve Sellem)'e geldiğimde düşmanın haberini kendilerine iletip bitirdiğim vakit üşüdüm! Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) üzerinde bulunan ve içinde namaz kıldığı bir abanın artan yerini bana örttü. Artık sabahlayınca ya kadar uyudum kaldım. Sabahladığım zaman (bana): «Kalk ey uykucu!» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4641,
			"arabicnumber": "1789",
			"text": "Bize Heddâb b. Hâlid Ei-Ezdî rivayet ettî. (Dediki): Bize Hammâd b. Seleme, Alî b. Zeyd ile Sâbit-i Bünânî'den, onlar da Enes b. Mâlik'den naklen rivayet etlilerki, Resûlullah (Sallallahu Aleyhi ve Sellem) Uhud (harbi) günü Ensardan yedi, Kureyş'ten iki kişi arasında yalnız bırakılmış. Müşrikler kendisini kuşatınca : «Bunları bizden kim püskürtecek ki, cennet onun ola!» Yahut: «Cennette o benim refîkim ola?» buyurmuş. Bunun üzerine Ensardan bir zât ilerleyerek çarpışmış ve öldürülmüş. Sonra kendisini yine kuşatmışlar. Ve (tekrar) : «Bunları bizden kim püskürtecek ki, cennet onun ola!» Yahut: «Cennette o benim refikim ola?»buyurmuş. Ve (yine) Ensardan bir zât ilerleyerek çarpışmış, neticede öldürülmüş. Bu minval üzere devamla yedi kişi (nin hepsi) öldürülmüş. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) iki arkadaşına : «Arkadaşlarımıza insaf etmedik!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4642,
			"arabicnumber": "1790.01",
			"text": "Bize Yahya b. Yahya Et-Temîmî rivayet etti. (Dediki): Bize Abdülâzîz b. Ebî Hâzim, babasından rivayet ettiki, babası, Sehl b. Sa'd'a Uhud harbinde Resûlullah (Sallallahu Aleyhi ve Sellem)'in yaralanması sorulurken işitmiş. Sehl şöyle demiş : Resûlullah (Sallallahu Aleyhi ve Sellem)'in yüzü yaralandı; yan dişi kırıldı ve başındaki miğferi parçalandı. Resûlullah (Sallallahu Aleyhi ve Sellem)'in kızı Fâtıme kanı yıkıyordu. Aliy b. Ebî Tâlib de kalkanla üzerine su döküyordu. Fâtıme suyun kanı daha fazla akıttığını görünce bir hasır parçası alarak onu kül oluncaya kadar yaktı. Sonra onu yaraya yapıştırdı. Böylelikle kan kesildi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4643,
			"arabicnumber": "1790.02",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Ya'kub (yâni ibni Abdirrahmân El-Kaari), Ebû Hâzim'den rivayet etti ki, Ebû Hâzim, Sehl b. Sa'd'a Resûlullah (Sallallahu Aleyhi ve Sellem)'in yarası sorulurken dinlemiş. Sehl şöyle demiş : Vallahi ben Resûlullah (Sallallahu Aleyhi ve Sellem)'in yarasını kim yıkadığını, suyu kim döktüğünü ve yarasının ne ile tedavi edildiğini pek âlâ bilirim!.. Bundan sonra râvi, Abdülâzîz'in hadîsi gibi rivayette bulunmuş; yalnız o: «Yüzü de yaralandı.» cümlesini ziyade etmiş; «hüşimet» yerine «küsiret» demiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4644,
			"arabicnumber": "1790.03",
			"text": "Bize bu hadîsi Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb, ishâk b. ibrahim ve ibni Ebî Ömer de toptan ibni Uyeyne'den rivayet ettiler. H. Bize Amr b. Sevvâd EI-Âmirî dahî rivayet etti. (Dediki): Bize Abdullah b. Vehb haber verdi. (Dediki): Bana Amr b. Haris, Saîd b. Ebî Hilâl'den naklen haber verdi. H. Bana Muhammed b. Sehl Et-Temîmî de rivayet etti. (Dediki): Bana ibni Ebî Meryem rivayet etti. (Dediki): Bize Muhammed (yâni ibni Mutarrif) rivayet etti. Bunların hepsi Ebû Hâzim'den, o da Sehl b. Sa'd'dan bu hadîsi Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etmişlerdir. ibni Ebî Hilâl'in hadîsinde: -Yüzü isabet aldı.» İbni Mutarrif hadîsinde ise : «Yüzü yaralandı.» ibareleri vardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4645,
			"arabicnumber": "1791",
			"text": "Bize Abdullah b. Mesleme b. Ka'neb rivayet etti. (Dediki): Bize Hammâd b. Seleme, Sâbit'ten, o da Enes'den naklen rivayet ettiki, Uhud (harbi) gününde Resûlullah (Sallallahu Aleyhi ve Sellem)'in yan dişi kırılmış; başı da yarılmış. Artık hem yaradan kanı silmeye başlamış; hem: «Nebiinin başını yarıp yan dişini kıran bir kavim nasıl felah bulur! Halbuki o kendilerini Allah'a davet ediyordu!» diyormuş. Bunun üzerine Allah (Azze ve Celle) : «Sana bu işten bîr şey yoktur!» [Al-i İmran 128] âyetini indirmiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4646,
			"arabicnumber": "1792.01",
			"text": "Bize Muhammed b. Abdillâh b. Numeyr rivayet etti. (Dediki): Bize Vekî' rivayet etti. (Dediki): Bize A'meş, Şakîk'dan, o da Abdullah'dan naklen rivayet etti. Abdullah şöyle demiş: Sanki ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i görüyor gibiyim: Nebilerden birini kavminin doğduğunu hikâye ediyor, kendisi de hem yüzünden kanı siliyor hem de: «Yâ Rabbi! Kavmimi affet! Çünkü onlar bilmiyorlar!» diyordu",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4647,
			"arabicnumber": "1792.02",
			"text": "{…} Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Vekî' ile Muhammed b. Bişr, A'meş'den bu isnâdla rivayette bulundular. Şu kadar varki o: «Kendisi alnından kanı yıkıyordu.» demiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4648,
			"arabicnumber": "1793",
			"text": "Bize Muhammed b. Râfi' rivayet etti. (Dediki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize Ma'mer, Hemmâm b. Münebbih'den naklen rivayet etti. Hemmâm: Bize Ebû Hureyre'nin Resûlullah (Sallallahu Aleyhi ve Sellem)'den rivayet ettikleri şunlardır; diyerek bir takım hadîsler zikretmiş; ez cümle: Resûlullah (Sallallahu Aleyhi ve Sellem) şöyle de buyurdu : «Resûlullah (Sallallahu Aleyhi ve Sellem)'e bunu .yapan bir kavme Allah'ın gadabı şiddetli olur!» O anda kendisi yan dişine işaret ediyordu. Bir de Resûlullah (Sallallahu Aleyhi ve Sellem): «Resûlulloh'ın Allah (Azze ve Celle) yolunda öldürdüğü bir adama Allah'ın gadabı şiddetli olur!» buyurdular; demiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4649,
			"arabicnumber": "1794.01",
			"text": "Bize Abdullah b. Ömer b. Muhammen b. Ebân El-Cu'fî rivayet etti. (Dediki): Bize Abdurrahîm (yâni ibni Süleyman), Zekeriyyâ'dan, o da Ebû ishâk'dan, o da Amr b. Meymûn El-Evdî'den, o da ibni Mes'ûd'dan naklen rivayet etti. (Şöyle demiş) : Bir defa Resûlullah (Sallallahu Aleyhi ve Sellem) Beytin yanında namaz kılarken Ebû Cehil ile bazı arkadaşları da oturuyorlardı. Evveli gün bir dişi deve boğazlanmıştı. Ebû Cehil: —: Fülân oğullarının devesinin sargısını hanginiz kalkıp alacak ve onu secde ettiği vakit Muhammed'în omuzlarına koyacak? dedi. Hemen düşmanın en şakisi ileri atılarak onu aldı. Ve Peygamber (Sallallahu Aleyhi ve Sellem) secde edince omuzlarının arasına koydu. Bunun üzerine gülüştüler; ve birbirlerinin üzerine yanlamaya başladılar. Ben de ayakta bakıyordum. Bir kuvvetim olsa onu Rcsûlullah (Sallallahu Aleyhi ve Sellem)'in sırtından atardım! Nebi (Sallallahu Aleyhi ve Sellem) secdede idi; başını kaldırmıyordu. Nihayet bir insan giderek Fâtıme'ye haber verdi. Fâtıme yetişmiş bir kızcağız... hemen gelerek (babasının) üzerinden o sargıyı attı. Sonra onlara dönerek sitemde bulundu. Nebi (Sallallahu Aleyhi ve Sellem) namazını bitirince sesini kaldırdı; ve onlara bed dua etti. Dua ettiği zaman üç defa eder; bir şey dilediği zaman üç defa dilerdi. Sonra üç defa : «Allahım, Kureyş sana havale!» dedi. Müşrikler onun sesini işitince gülmeleri kesildi. Ve duasından korktular. Sonra: «Allahım, Ebû Cehil b. Hişâm ile Utbe b. Rabîa, Şeybe b. Rabîa, Velîd b. Ukbe, Umeyye b. Halef ve Ukbe b. Ebî Muayt sana havale!» dedi. (Yedinciyi de söyledi ama onu belleyemedim.) Muhammed (Sallallahu Aleyhi ve Sellem)'i hak (dîn) ile gönderen Allah'a yemîn ederim ki bu adlarını saydığı kimseleri Bedir harbinde yerlere serilmiş gördüm. Sonra çukura, Bedir çukuruna sürüklendiler. Ebû ishâk: «Bu hadîste Velîd b. Ukbe hatadır.» demiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4650,
			"arabicnumber": "1794.02",
			"text": "Bize Muhammed b. El-Müsennâ ile Muhammed b. Beşşâr rivayet ettiler. Lâfız ibni'l-Müsenna'nındır. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Ebû ishâk'ı, Amr b. Meymûn'dan, o da AbduIIah'dan naklen rivayet ederken dinledim. Abdullah şöyle demiş: Bir defa Resûlullah (Sallallahu Aleyhi ve Sellem) secdede, etrafında Kureyş'den bâzı insanlar bulunduğu bir sırada Ukbe b. Ebî Muayt bir dişi deve sargısı getiriverdi. Ve onu Resûlullah (Sallallahu Aleyhi ve Sellem)'in sırtına attı. O başını kaldırmadı. Az sonra Fâtıme gelerek onu sırtından aldı. Ve bunu yapana bed duâ etti. Resulü Ekrem (Sallallahu Aleyhi ve Sellem) de : «Allahım, Kureyş'ten bu cemâat, Ebû Cehil b. Hişâm, Utbe b. Rabîa, Ukbe b. Ebî Muayt, Şeybe b. Rabîa, Umeyye b. Halef yahut Ubey b. Halef (burda şüphe eden Şu'be'dir) sana havale!» dedi. Yemin olsun ki ben bunları Bedir günü öldürülmüş görmiişümdür. Arkacağından bir kuyuya atıldılar. Yalnız Ümeyye yahut Übeyy'in mafsalları kesildi, fakat kuyuya atılmadı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4651,
			"arabicnumber": "1794.03",
			"text": "Bize Ebü Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Ca'fer b. Avn rivayet etti. (Dediki): Bize Süfyân, Ebû İshâk'dan bu isnâdla bu hadîsin benzerini habrr verdi. Şunu da ziyade etmiş: -Üç defa söylemeyi seviyor üç defa : «Allahım! Kureyş sana havale! Allahım, Kureyş sana havale! Allahım, Kureyş sana havâle!» diyordu. Kureyş'în arasında Velîd b. Utbe ile Ümeyye b. Halefi de anmış; ve şekketmemiştir. Ebıı lshâk: «Yedinciyi unuttum.» demiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4652,
			"arabicnumber": "1794.04",
			"text": "Bana Seleme b. Şebîb de rivayet etti. (Dediki): Bize Hasen b. A'yen rivayet etti. (Dediki): Bize Züheyr rivayet etti. (Dediki): Bize Ebû ishâk, Amr b. Meymûn'dan, o da Abdullah'dan naklen rivayet etti. (Şöyle demiş) : Resûlullah (Sallallahu Aleyhi ve Sellem) Beyte karşı durarak Kureyş'den altı kişi aleyhine dua etti. Bunların içinde Ebû Cehil, Ümeyye b. Halef, Utbe b. Rabîa, Şeybe b. Rabîa ve Ukbe b. Ebî Muayt da vardı. Allah'a yemîn ederim ki, ben bunları Bedir harbinde yere serilmiş gördüm. Güneş kendilerini değiştirmişti. Sıcak bir gündü",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4653,
			"arabicnumber": "1795",
			"text": "Bana Ebû't-Tâhir Ahmed b. Amr b. Şerh ile Harmele b. Yahya ve Amr b. Sevvâd El-Âmirî rivayet ettiler. Lâfızları birbirine yakındır. (Dedilerki): Bize îbni Vehb rivayet etti. (Dediki): Bana Yûnus, İbni Şihab'dan naklen haber verdi. (Demişki): Bana Urvetü'bnü'z-Zübeyr rivayet ntti. Ona da Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Aişe rivayet etmiş ki, Kendisi Resûlullah (Sallallahu Aleyhi ve Sellem)'e: — Yâ Resûlâllah! Uhud gününden daha şiddetli bir gün başına geldi mi? diye sormuş da şöyle buyurmuşlar: «Gerçekten senin kavminden neler başıma geldi neler!.. Onlardan başıma gelenin en şiddetlisi Akabe günü gelmiştir. Kendimi Ibni Abdı Yâlîl b. Abdi Külâl'e arzetmiştim. Arzum hususunda bana icabet etmedi. Ben de üzgün olarak gözümün gördüğü tarafa yollandım. Ve ancak Karnü's-Seâlib'de kendime gelebildim de, başımı kaldırdım. Bîr de ne göreyim! Bîr bulut... Beni gölgelendirmiş! Baktım; içinde Cibril!.. Hemen bana seslenerek : — Muhakkak Allah (Azze ve Celle), kavminin sana söylediklerini ve sana verdikleri redd cevabını işitti de onlar hakkında dilediğini kendisine emretmen için sana dağlar meleğini gönderdi. Dedi. Arkacığından: Dağlar meleği bana seslendi ve selâm verdi. Sonra: — Yâ Muhammed ! Şüphesiz Allah, kavminin sana söylediklerini işitti. Ben de Dağlar meleğiyim) Rabbin beni sana dilediğini emretmen için gönderdi. imdi ne dilersen dile! Eğer üzerlerine iki Ahşebi kapamamı dilersen (kaparım) dedi. Resûlullah (Sallallahu Aleyhi ve Sellem) ona şunu söylemiş : «Bilâkis! Allah'ın onların sulblerinden sırf Allah'a ibâdet edecek, ona hiç bir şeyi şerik koşmayacak kimseler çıkarmasını dilerim!»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4654,
			"arabicnumber": "1796.01",
			"text": "Bize Yahya b. Yahya ile Kuteybe b. Saîd ikisi birden Ebû Avâne'deıı rivayet ettiler. Yahya (Dediki): Bize Ebû Avâne, Esved b. Kays'dan, o da Cündüb b. Süfyân'dan naklen haber verdi. Cündüb şöyle demiş : — Bu gazalardan birinde Resûlullah (Sallallahu Aleyhi ve Sellem)'in parmağı kanadı da şöyle buyurdular: «Sen kanayan parmaktan başka bir şey değilsin! Ama başına gelen Allah yolunda gelmiştir!»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4655,
			"arabicnumber": "1796.02",
			"text": "Bize bu hadîsi Ebû Bekir b. Ebî Şeybe ile ishâk b. ibrahim de hep birden ibni Uyeyne'den, o da Esved b. Kays'dan naklen bu isnadla rivayet ettiler. O şunu da söylemiş: «Resûlullah (Sallallahu Aleyhi ve Sellem) bir cemaatin içinde idi; ve parmağından isabet aldı.»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4656,
			"arabicnumber": "1797.01",
			"text": "Bize ishâk b. ibrahim rivayet etti. (Dediki): Bize Süfyân, Esved b. Kays'dan naklen haber verdi ki, kendisi Cündüb'ü şunu söylerken işitmiş : (Bir ara) Cibril, Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelmekte gecikti. Bunun üzerine müşrikler: Muhammed'e veda' edildi. Dediler. Allah (Azze ve Celle) de: «Kuşluk zamanına ve sakinleştiği vakit geceye yemîn ederim ki, Rabbin sana ne veda' etti, ne de küstü!» [Duha ilk 3 ] ayeti indirdi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4657,
			"arabicnumber": "1797.02",
			"text": "Bize ishâk b. ibrahim ile Muhammed b. Râfi' rivayet ettiler. Lâfız ibni Râfi'indir. (ishâk; Bize haber verdi ta'bîrini kullandı, İbni Râfi' ise: Bize Yahya b. Âdem rivayet etti, dedi.) (Yahya demişki:) Bize Züheyr, Esved b. Kays'dan rivayet etti. Demiş ki: Ben Cündüb b. Süfyân'ı şöyle derken işittim : Resûlullah (SallalIahu Aleyhi ve Sellem) rahatsızlandı da iki veya üç gece kalkamadı. Derken ona bir kadın gelerek : — Yâ Muhammed! Ben şeytanın seni terk etmiş olmasını cidden umarım! Onun iki veya üç gecedir sana yaklaştığını görmedim! Dedi. Bunun üzerine Allah (Azze ve Celle): «Kuşluk zamanına ve sakinleştiği vakit geceye yemîn ederim ki, Rabbin sana ne veda' etti; ne de küstü!» âyetlerini indirdi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4658,
			"arabicnumber": "1797.03",
			"text": "{…} Bize Ebû Bekir b. Ebî Şeybe ile Muhammed b. Müsennâ ve ibni Beşşâr da rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer, Şu'be'den rivayet etti. H. Bize ishâk b. ibrahim dahî rivayet etti. (Dediki): Bize Mülâî haber verdi. {Dediki): Bize Süfyân rivayet etti. Her iki râvi Esved b. Kays'dan bu isnadla ikisinin hadîsi gibi rivayette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4659,
			"arabicnumber": "1798.01",
			"text": "Bize ishâk b. ibrahim El-Hanzalî ile Muhammed b. Râfi' ve Abd b. Humeyd rivayet ettiler. Lâfız ibni Râfı'indir. (ibni Râfi'; haddesenâ ta'birini kullandı. Ötekiler: Bize Abdürrazzâk haber verdi dediler.) (Abdürrezzâk demiş ki:) Bize Ma'mer, Zühri'den, o da Urve'den naklen haber verdi. Ona da Usâme b. Zeyd haber vermiş ki, Nebi (SallalIahu Aleyhi ve Sellem) üzerinde semer bulunan bir eşeğe binmiş. Altında bir Fedek kadifesi varmış. Arkasına da Usâme'yi bindirmiş. Kendisi Haris b. Hazrec oğullarındaki Sa'd b. Ubâde'yi dolaşmağa gidiyormuş. Bu iş Bedir vak'asından önce olmuş. Nihayet müslümanlarla putperest müşriklerden ve içlerinde Abdullah b. Ubeyy de olduğu halde yahudîlerden müteşekkil karma bir toplantının yanına uğramış. Toplantıda Abdullah b. Revâha da varmış. Hayvanın kaldırdığı toz duman meclisi kaplayınca Abdullah b. Ubeyy elbisesi ile burnunu kapamış; sonra: Üzerimize tozatmayın! demiş. Müteakiben Nebi (SallalIahu Aleyhi ve Sellem) onlara selâm vermiş. Sonra durarak inmiş; ve kendilerini Allah'a (îmâna) da'vet etmiş; onlara Kur'ân okumuş. Bunun üzerine Abdullah b. Ubeyy: — Be adam! Bundan daha güzel bir şey yok!.. Eğer söylediklerin hak ise bizi toplantılarımızda rahatsız etme de evine dön!.. Artık bizden sana kim giderse ona anlat! demiş. Abdullah b. Revâha da: — Sen bize toplantılarımızda gel!.. Zira biz bunu istiyoruz! mukabelesinde bulunmuş. Derken müslümanlarla müşrikler ve yahudiler birbirlerine söğmüşler. Hattâ birbirlerinin üzerine atlamayı gönüllerinden geçirmişler. Nebi (SallalIahu Aleyhi ve Sellem) ise onları yatıştırmağa çalışıyormuş. Sonra hayvanına binerek Sa'd b. Ubâde'nin yanına girmiş ve şunları söylemiş: «Ey Sa'd! Ebû Hubab'ın {yâni Abdullah b. Ubeyy'in) ne söylediğini işitmedin mi? Şöyle... şöyle dedi.» Sa'd: — Onu affet yâ Resûlâllah, bağışla! Vallahi Allah sana verdiğini vermiştir. Gerçekten bu yerin ahâlisi ona tâç giydirmeye, sarık sarmaya ittifak etmişlerdi. Allah, sana verdiği hak ile bunu reddedince bu onun boğazına durdu. işte ona gördüğün şeyi yaptıran budur! demiş. Bunun üzerine Nebi (SallalIahu Aleyhi ve Sellem) onu affetmiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4660,
			"arabicnumber": "1798.02",
			"text": "{…} Bana Muhammed b. Râfi' rivayet etti. (Dediki): Bize Huceyn (yâni ibni'l-Müsennâ) rivayet etti. (Dediki): Bize Leys, Ukayl'den, o da ibni Şihâb'dan bu isnâdda bu hadîsin mislini rivayet etti. Şunu da ziyâde eyledi: «Bu mesele Abdullah müslüman olmazdan önce idi.»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4661,
			"arabicnumber": "1799",
			"text": "Bize Muhammed b. Abdilâla Ei-Kaysî rivayet etti. (Dediki): Bize Mu'temir, babasından, o da Enes b. Mâlik'ten naklen rivayet etti. (Şöyle demiş) :Nebi (SallalIahu Aleyhi ve Sellem)'e : — Abdullah b. Ubeyy'e gitsen (iyi olur) dediler. O da gitti. Ve bir eşeğe bindi. Müslümanlar da gittiler. O yer çoraktı. Nebi (SallalIahu Aleyhi ve Sellem) yanına varınca Abdullah: — Yanımdan çekil! Vallahi eşeğinin pis kokusu beni rahatsız etti! dedi. Bunun üzerine Ensârdan bir zât: — Vallahi Resûlullah (SallalIahu Aleyhi ve Sellem)'in eşeği koku i'tibârı ile senden daha güzeldir! cevabını verdi. Derken Abdullah namına, kavminden biri gadaba geldi. Ve her iki taraf namına arkadaşları gadaba geldiler. Aralarında hurma dalı ile, ellerle ve ayakkabıları ile kavga oldu. Duyduğumuza göre : «Eğer mü'minlerden iki taife çarpışırlarsa hemen onların arasını yatıştırın!» [Hucurat 9] âyeti onlar hakkında inmiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4662,
			"arabicnumber": "1800.01",
			"text": "Bize Aliy b. Hucr Es-Sa'dî rivayet etîi. (Dediki): Bize îsmâîl (yâni ibni Uleyye) haber verdi, (Dediki): Bize Süleyman Et-Teymî rivayet etti. (Dediki): Bize Enes b. Mâlik rivayet etti. (Dediki): Resûlullah (SallalIahu Aleyhi ve Sellem): «Bizim için kim bakacak; Ebû Cahil ne yapmış?» buyurdu. Bunun üzerine ibni Mes'ûd gitti. Ve onu Afrâ'nın iki oğlu vurmuş da yere serilmiş buldu. Hemen sakalından yakalayarak: — Ebû Cehil sen misin? dedi. O da : — Öldürdüğünüz (yahut: kavminin öldürdüğü) bir adamın üzerinde mi? cevâbını verdi. Râvi diyor ki : Ebû Miclez şöyle dedi: Ebû Cehil: Keşke beni çiftçiden başkası öldürseydi! demiş. {…} Bize Hâmid b. Ömer EI-Bekrâvî rivayet etti. (Dediki): Bize Mu'temir rivayet etti. (Dediki): Babamı şöyle derken işittim: Bize Enes rivayet etti. (Dediki): Resûlullah (SallalIahu Aleyhi ve Sellem): «Ebû Cehil'in ne yaptığını bana kim öğretecek?» buyurdular. Ravi, ibni Uleyye'nin hadîsi gibi rivayet etmiştir. Ebû Miclez'tn sözü de ismail'in zikrettiği gibidir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4663,
			"arabicnumber": "1800.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4664,
			"arabicnumber": "1801",
			"text": "Bize ishâk b. ibrâhîm El-Hanzalî ile Abdullah b. Muhammed b. Abdirrahmân b. Misver Ez-Zührî ikisi birden ibni Uyeyne'den rivayet ettiler. Lâfız Zührî'nindir. (Dedilerki): Bize Süfyân, Amr'dan rivayet etti. (Demişki): Ben Câbir'i şunu söylerken işittim: Resûlullah (SallalIahu Aleyhi ve Sellem): «Ka'b b. Eşref'e kim çıkacak? Çünkü o Allah ve Resulüne eza etmiştir!» buyurdu. Bunun üzerine Muhammed b. Mesleme : — Yâ Resûlâllah! Onu öldürmemi mi istiyorsun? dedi. «Evet!» buyurdular. ibni Mesleme : — Bana müsaade buyur da (söyleyeceğimi) söyleyeyim! dedi. «Söyle!» buyurdular. Müteakiben ona vararak (söyleyeceğini) söyledi. ikisinin aralarında olanları anlattı ve şöyle dedi: — Bu adam sadaka istedi ve bizi dara düşürdü. Kâ'b bunu işitince : — Vallahi ondan daha da yaka silkeceksiniz! dedi. ibni Mesleme : — Biz şimdi ona gerçekten tâbi* olduk! Onu bırakıp da halinin nereye varacağını görmekten çekiniyoruz. Bana biraz ödünç vermeni dilerim! Dedi. Kâ'b: — Bana rehin olarak ne vereceksin? diye sordu, İbni Mesleme : — Neyi dilersen! cevâbını verdi. — Bana kadınlarınızı rehin verirsin! dedi. ibni Mesleme: — Sen Arapların en güzelisin, sana kadınlarımızı rehnedebilirmiyiz hiç! dedi. Kâ'b: — Bana çocuklarınızı rehin verin! dedi. ibni Mesleme : — Birimizin oğluna söverler de: Bu iki yük hurma karşılığında rehnedildî; derler. Lâkin biz sana zırhları (yâni silâhları) rehnedelim! dedi. Kâb da: — Peki öyle ise! dedi. ibni Mesleme ona Haris, Ebû Abs b. Cebr ve Abbâd b. Bişr ile geleceğini va'detti. Bunlar geceleyin gelerek Kâb'ı çağırdılar. O da yanlarına indi. (Râvi) Süfyân (b. Uyeyne) şöyle demiş: Amr'dan başkası dedi ki: Karısı Kâ'b'a: Ben bir ses işitiyorum; sanki kan sesi! dedi, Kâ'b: — Bu (gelen) Muhammed b. Mesleme ile süt kardeşi ve Ebû Nâile'dir. Mert adam geceleyin yaralanmaya çağırılsa yine icabet eder! dedi. Muhammed (b. Mesleme) (dediki); — O geldiği vakit ben elimi başına uzatacağım. Onu alt etme imkânı buldum mu hemen tutun! Kâ'b indiği zaman kılıcını kuşanmış olarak indi. (Gelenler): Biz senden tîb kokusu duyuyoruz! dediler. Kâ'b: — Evet! Fülân hanım nikâhım altındadır. O Arapların en güzel kokulu kadınıdır; cevabını verdi, İbni Mesleme: — Bana bundan koklamaya müsaade eder misin? dedi. Kâ'b: __ Evet! Koklayabilirsin! cevâbını verdi. O da tutarak kokladı. Sonra; — Tekrarlamama müsaade eder misin? dedi; ve başına iyice hâkim oldu. Arkasından : Tutun! dedi. Onu hemen öldürdüler",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4665,
			"arabicnumber": "1365.07",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize ismâîl (yâni îbni Uleyye) Abdülâzîz b. Suheyb'den, o da Enes'den naklen rivayet etti ki, Resûlullah (Sallallahu Aleyhi ve Sellem) Hayber'e gaza etmiş, Enes şöyle demiş: Orada sabah namazını alaca karanlıkta kıldık. Müteakiben Nebiyyullah (Sallallahu Aleyhi ve Sellem) (hayvanına) bindi. Ebû Talha da bindi. Ben de Ebû Talha'nın terkisinde idim. Derken Nebiyyullah (Sallallahu Aleyhi ve Sellem) (hayvanını) Hayber'in sokağında koşturdu ve Nebiyyullah (Sallallahu Aleyhi ve Sellem)'in uyluğundan elbise açıldı. Ben Nebiyyullah (Sallallahu Aleyhi ve Sellem)'in uyluğunun beyazını görüyordum. Şehre girince: «Allah en büyüktür! Hayber harâb olmuştur. Biz bir kavmin sahasına indik mi artık inzar edilenlerin sabahı kötü olur!» buyurdu. Bunu üç defa tekrarladı. Millet işlerine çıkmıştı. «Muhammed!..» dediler. (Râvi) Abdülâzîz şöyle demiş: «Arkadaşlarımızdan bazısı: «Bir de ordu!..» dedi. Enes: «Biz Hayber'i cebren aldık!» demiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4666,
			"arabicnumber": "1365.08",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Affân rivayet etti. (Dediki): Bize Hammâd b. Seleme rivayet etti. (Dediki): Bize Sabit, Enes'den naklen rivayet etti. Şöyle demiş : Hayber günü ben Ebû Talha'nın terkisinde idim. Ayağım, Resûlullah (Sallallahu Aleyhi ve Sellem)'in ayağına dokunuyordu. Hayberlilere güneş doğduğu zaman vardık. Hayvanlarını (kıra) çıkarmışlardı. Kendileri de baltaları ile, zenbilleri ile ve kazmaları ile çıkmışlardı. (Bizi görünce :) — Muhammed ve ordu!., dediler. Resûlullah (Sallallahu Aleyhi ve Sellem) de: «Hayber harab oldu. Biz bir kavmin sahasına indik mi artık inzâr edilenlerin sabahı kötü olur!. buyurdu. Arkacığından Allah (Azze ve Celle) onları hezimete uğrattı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4667,
			"arabicnumber": "1365.09",
			"text": "Bize ishâk b. ibrahim ile ishâk b. Mansûr rivayet ettiler. (Dedilerki): Bize Nadir b. Şümeyl haber verdi. (Dediki): Bize Şu'be, Katâde'den, o da Enes b. Malik'den naklen haber verdi. (Şöyle demiş) : Resûlullah (Sallallahu Aleyhi ve Sellem) Hayber'e vardığında: «Biz bir kavmin sahasına indik mi artık inzâr edilenlerin sabahı kötü olur!» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4668,
			"arabicnumber": "1802.01",
			"text": "Bize Kuteybe b. Saîd ile Muhammed b. Abbâd rivayet ettiler. Lâfız ibni Abbâd'ındır. (Dedilerki): Bize Hatim —ki ibni ismail'dir— Seleme b. Ekva'ın âzâdlısı Yezid b. Ebî Ubeyd'den, o da Seleme b. Ekva'dan naklen rivayet etti. Seleme (Şöyle demiş) : Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte Hayber'e (müteveccihen yola) çıktık. Ve geceleyin yürüdük gittik. Derken cemaattan bir zât, Âmir b. Ekva'ya: (Usayd b. Hudayr r.a.) — Bize racezlerinden dinletmez misin? dedi. Âmir şâir bir zât idi. Hemen cemaat'i (n develerini) sürmek üzre hayvanından indi. Şöyle diyordu : «Allahım! Sen olmasan biz ne hidayete erer; ne sadaka verir; ne de namaz kılardık.» «O halde —can sana feda— biz günah irtikâb ettikçe affet! Düşmanla karşılaşırsak ayaklarımızı sabit kıl!» \"Bize mutlaka sckinet ver! Çünkü biz çağırılırsak geliriz!» «Yaygara ile aleyhimize yardım istediler!» Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Bu sürücü kim?» diye sordu. — Âmir! dediler. «Allah ona rahmet eylesin!» dedi. Cemaatten biri: (ki Ömer r.a.dır) — (Şehâdet) vâcib oldu yâ Resûlâllah! Bârî onunla bizleri faydalandırsa idin! dedi. Az sonra Hayber'e gelerek onları muhasara ettik. Nihayet bize şiddetli bir açlık çattı. Sonra : «Şüphesiz Allah onu size fethedecektir » buyurdular. Hayber'in fethedildiği günün akşamı cemaat geceledikleri vakit birçok ateşler yaktılar, Resûlullah (Sallallahu Aleyhi ve Sellem): «Bu âteşler ne? Ne üzerine yakıyorsunuz?» dedi. Ashâb: — Et üzerine! dediler. «Ne eti?» diye sordu. — Ehli eşeklerin eti! dediler. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Dökün onları ve kırın!» buyurdu. Bir zât; — Yoksa onları döksünler de yıkasınlar mı? diye sordu. «Yahut öyle yapsınlar!» buyurdu. Cemâat harb için saf bağladığı vakit Âmir'in kılıcında kısalık vardı. Onunla, bir yahudiyi vurmak için bacağını yakaladı. Fakat kılıcının keskin tarafı dönerek Âmir'in dizine isabet etti. Ve ondan öldü. Seleme demiş ki: Harbden döndüğümüz vakit Resûlullah (Sallallahu Aleyhi ve Sellem) elimden tutmuştu. Beni susmuş görünce : «Sana ne oldu?» diye sordu. Kendisine şunu söyledim : — Annem, babam sana feda olsun! Âmir'in ameli boşa gitti diycırlar!.. «Bunu kim söyledi?» diye sordu. — Filân, filân ve Üseyd b. Hudayr El-Ensârî dedim. «Bunu söyleyen hatâ etmiş! Ona gerçekten iki ecir vardır!» buyurdu. Ve iki parmağını bir araya topladı. (Sözüne devamla) : «O gerçekten câhid, mücâhiddir! Yeryüzünde yürüyen onun gibi bîr Arap pek az bulunur!» buyurdular. Bu hadîste Kuteybe Muhammed'e iki cümlede muhalefet etmiştir, İbni Abbâd'ın rivayetinde: «Bizim üzerimize sekînet ver!» cümlesi de vardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4669,
			"arabicnumber": "1802.02",
			"text": "Bana Ebû't-Tâhir de rivayet etti. (Dediki): Bize ibni Vehb haber verdi. (Dediki): Bana Yûnus, ibni Şihâb'dan naklen haber verdi. (Demişki): Bana Abdurrahmân (bunun nesebini ibni Vehb'den başkası bildirmiş ve: ibni Abdillâh b. Kâ'b b. Mâlik demiştir.) haber ver­di ki, Seleme b. Ekva' şöyle demiş: Hayber harbi olunca kardeşim, Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte şiddetli bir çarpışma yaptı da, kılıcı kendine dönerek onu öldürdü. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem)'in ashabı bu hususta söz ettiler ve onun hakkında şikâyette bulundular: Kendi silâhı ile ölen bir adam! dediler. Bâzı işlerinde de şüpheye düştüler. Seleme demişdi: Az sonra Resûlullah (Sallallahu Aleyhi ve Sellem) Hayber'den döndü. Ben: — Yâ Resûlullah! Bana müsaade buyur da sana racez okuyayım! dedim. Resûlullah (Sallallahu Aleyhi ve Sellem) kendisine izin vermiş. Ömer b. Hattâb: Ben senin ne söyleyeceğini biliyorum! demiş. Seleme şunları söylemiş: Ben de : «Vallahi Allah olmasa biz ne hidayete erer; ne sadaka verir, ne namaz kılardık! dedim. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem). «Doğru söyledin!» buyurdular. (Devam ettim) : «Bize mutlaka sekînet indir! Ve düşmanla karşılaşırsak ayaklarımızı sabit kıl!» «Müşrikler bize tecâvüz etmişlerdir!..» Ben racezimi bitirince Resûlullah (Sallallahu Aleyhi ve Sellem): «Bunu kim söyledi?» diye sordu. — Onu kardeşim söyledi! dedim. Resûlullah (Sallallahu Aleyhi ve Sellem): «Allah ona rahmet eylesin!» dedi. Ben de: — Yâ Resûlâllah! Bâzı insanlar ona rahmet okumaktan korkuyorlar: «Kendi silâhı ile ölmüş bir adam!» diyorlar! dedim. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «O câhid mücâhid olarak öldü!» buyurdular. ibni Şihâb demiş ki: Bilâhare ben Seleme b. Ekva'ın bir oğluna sordum da bana babasından naklen bunun gibi rivayette bulundu. Şu kadar var ki (ben: Bazı insanlar ona rahmet okumaktan korkuyorlar, dediğim vakit) Resûlullah (Sallallahu Aleyhi ve Sellem): «Hatâ etmişler! Câhid mücâhid olarak öldü. Binâenaleyh ona iki defa ecir vardır!» buyurdu ve parmağı ile işaret etti, dedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4670,
			"arabicnumber": "1803.01",
			"text": "Bize Muhammed b. El-Müsennâ ile ibni Beşşâr rivayet ettiler. Lafız ibni'l-Müsennâ'nındır. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Ebû îshâk'dan rivayet etti. (Demişki): Bera'ı dinledim; şöyle dedi: Resûlullah (Sallallahu Aleyhi ve Sellem) Ahzâb gününde bizimle birlikte toprak taşıyordu. Hakîkaten toprak, karnının beyazını örtmüştü. Kendisi şunları söylüyordu: «Vallahi sen olmasan biz ne hidayete erer; ne sadaka verir; ne de namaz kılardık.» «O halde üzerimize mutlaka sekînet indir! Çünkü bunlar bize karşı geldiler!» Râvi demiş ki: Bazan da şöyle derdi: «Bu adamlar bize karşı geldiler. Onlar fitne çıkarmak istediler mi biz karşıyız!» Bunları yüksek sesle okuyordu",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4671,
			"arabicnumber": "1803.02",
			"text": "{…} Bize Muhammed b. El-Müsennâ rivayet etti. (Dediki): Bize Abdurrahmân b. Mehdî rivayet etti. (Dediki): Bize Şu'be, Ebû İshâk'dan naklen rivayet etti. Demişki: Ben Berâ'dan dinledim... Ve râvi yukariki hadîs gibi anlatmış. Yalnız o : «Bunlar bize zulüm ettiler!» demiştir. İzah 1805 te",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4672,
			"arabicnumber": "1804",
			"text": "Bize Abdullah b. Mesleme El-Ka'nebi rivayet etti. (Dediki): Bize Abdülâzîz b. Ebî Hâzim, babasından, o da Sehl b. Sa'd'dan naklen rivayet etti. Sehl şöyle demiş : Biz hendeği kazıyor ve toprağı omuzlarımızda taşıyorken yanımıza Resûlullah (Sallallahu Aleyhi ve Sellem) geldi de: «Allahım! Âhiret hayâtından başka hayât yoktur. O halde sen Ensar'la Muhacirlere mağfiret eyle!» buyurdu. İzah 1805 te",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4673,
			"arabicnumber": "1805.01",
			"text": "Bize Muhammed b. El-Müsennâ ile ibni Beşşâr da rivayet ettiler. Lâfız ibni'l-Müsennâ'nındır. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Muâviye b. Karra'dan, o da Enes b. Mâlik'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti ki, şöyle buyurmuşlar : «Allahım! Âhiret hayâtından başka hayât yoktur. O halde sen Ensar'la Muhacirlere mağfiret eyle!»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4674,
			"arabicnumber": "1805.02",
			"text": "Bize Muhammed b. El-Müsennâ ile ibni Beşşâr rivayet ettiler. ibnü'l-Müsennâ (Dediki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Katâde'den naklen haber verdi. (Demişki): Bize Enes b. Mâlik rivayet etti ki, Resûlullah (Sallallahu Aleyhi ve Sellem): «Allahım! Gerçekten hayât, âhiret hayâtıdır.» dermiş. Şu'be demiş ki: Yahut şöyle buyurdu: «Allahım! Âhiret hayâtından başka hayât yoktur. O halde sen Ensar'la Muhacirlere ikram eyle!»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4675,
			"arabicnumber": "1805.03",
			"text": "Bize Yahya b. Yahya ile Şeybân b. Ferrûh da rivayet ettiler. Yahya: Bize haber verdi tâ'birini kullandı. Şeybân ise : Bize Abdülvâris, Ebû't-Teyyûh'dan rivayet etti, dedi. (Demişki): Bize Enes b. Mâlik rivayet etti. (Dediki): Resûlullah (Sallallahu Aleyhi ve Sellem) de beraberlerinde olduğu halde ashâb racez okurlar ve: «Allahım! Ahiret hayrından başka hayır yoktur. O halde sen Ensar'la Muhacirlere yardım eyle!» derlerdi. Seyban'ın hadîsinde «yardım eyle!» yerine «mağfiret eyle!» ifâdesi vardır",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4676,
			"arabicnumber": "1805.04",
			"text": "Bana Muhammed b. Hatim rivayet etti. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Hammâd b. Seleme rivayet etti. (Dediki): Bize Sabit, Enes'den naklen rivayet etti ki, Hendek (harbi) günü Muhammed (Sallallahu Aleyhi ve Sellem)'in ashabı: «Bizler sağ kaldıkça ebediyyen islâmiyet üzerine Muhammed'e bey'at edenleriz!» derlermiş. Yahut râvi Sabit «islâmiyet üzerine» yerine «Cihâd üzerine» demiştir. (Burada) Hammâd şekketmiştir. Nebi (Sallallahu Aleyhi ve Sellem) de : «Allahım! Gerçekten hayır, ahiret hayrıdır. O halde sen Ensarla Muhacirlere mağfiret eyle!» dermiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4677,
			"arabicnumber": "1806",
			"text": "Bize Kuteybe b. Said rivayet etti. (Dediki): Bize Hatim (yâni îbni îsmâîl) Yezîd b. Ebi Ubeyd'den rivayet etti. (Demişki): Ben Seleme b. Ekva'ı şöyle derken işittim : ilk namaz için ezan okunmadan yola çıktım. Resûlullah (Sallallahu Aleyhi ve Sellem)'in sağmal develeri Zû Kared'de otluyordu. Derken bana Abdurrahmân b. Avf in bir hizmetçisi rastlayarak: — Resûluliah (Sallallahu Aleyhi ve Sellem)'in sağmal develeri alındı! Dedi. — Onları kim aldı? Dedim. — Gatafân (kabilesi!) cevâbını verdi. Bunun üzerine ben : Yâ sabahım! diye üç defa nâra attım. Ve Medine'nin iki harrası arasındakilere işittirdim. Sonra yüzümün döndüğü tarafa hızlandım. Nihayet onlara Zû Kared'de yetiştim. Tam sudan içmeye başlamışlarmış. Hemen kendilerine okumu atmağa başladım. Atıcı idim. Hem: Ben Ekva'ın oğluyum! «Bugün alçakların (helak) günüdür!» diyor; racez okuyordum. Nihayet sağmal develeri onlardan kurtardım; ve onlardan otuz elbise ele geçirdim. Derken Nebi (Sallallahu Aleyhi ve Sellem)'le cemaat geldiler. Ben : __ Yâ Nebiyyallah! Ben susamış oldukları halde bu kavme suyu vermedim. Şimdi hemen onlara adam gönder! Dedim. «Ey Ekva' oğlu! Mâlik oldun; binâenaleyh merhametli davran!» buyurdular. Sonra döndük. Resûluliah (Sallallahu Aleyhi ve Sellem) Medine'ye girinceye kadar beni terkisine aldı",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4678,
			"arabicnumber": "1807.01",
			"text": "Ebu Bekir b. Ebi Şeybe, Hişam b. Kasim tarikiyle gelen tabi’ rivayetin Arapça metni bu hadisin Türkçe mealinden hemen sonra (تابع... 1): -132 - (1807) şeklinde geçmektedir. {132} Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Haşim b. Kaasim rivayet etti. H, Bize ishâk b. ibrahim de rivayet etti. (Dediki): Bize Ebû Âmir El-Akadî haber verdi. Her iki râvi Ikrime b. Ammâr'dan rivayet etmişlerdir. H. Bize Abdullah b. Abdirrahmân Ed-Dârimî dahî rivayet etti. Bu onun hadîsidir. (Dediki): Bize Ebû Aliy El-Hanefî UbeyduIIah b. Abdilmecîd haber verdi. (Dediki): Bize ikrime —ki ibni Ammâr'dır— rivayet etti. (Dediki): Bana iyâs b. Seleme rivayet etti. (Dediki): Bana babam rivayet etti. (Dediki): Hudeybiye'ye Resûlullah (Sallallahu Aleyhi ve Sellem)'le beraber geldik. 1400 kişi idik. Kuyunun başında elli koyun vardı. Kuyu bunları bile sulayamıyordu. Derken Resûlullah (Sallallahu Aleyhi ve Sellem) kuyunun kenarına oturdu da ya duâ etti yahut içine tükürdü. Bunun üzerine kuyu coştu, biz de hem su içtik hem hayvan suladık. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) bizi ağacın altında bey'ata da'vet etti. Ona cemaattan evvelâ ben bey'at ettim. Sonra birer birer herkes bey'at etti. Nihayet halkın ortasında kalınca: «Bey'at et yâ Seleme!» dedi. — Ben sana herkesten evvel bey'at ettim ya Resûlâllah! dedim. «Yine de!» buyurdu. Resûlullah (Sallallahu Aleyhi ve Sellem) beni çıplak gördü. (Beraberinde silâh olmadığını anlatmak istiyor.) Ve bana bir hacefe yahut deraka verdi. Sonra bey'at devam etti. Nihayet cemâatin sonunda kalınca: «Bana bey'at etmiyor musun yâ Seleme!» buyurdular. — Sana cemaatin başında ve ortasında bey'at ettim yâ Resûlâllah! Dedim. «Yine de!» buyurdu. Ben de kendisine üçüncü defa olarak bey'at ettim. Sonra bana: «Yâ Seleme! Sana verdiğim hacefen veya derakan nerede?» diye sordu. — Yâ Resûlâllah! Bana amcam Âmir çıplak olarak rastladı da, onu kendisine verdim; dedim. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) güldü. Ve: «Gerçekten son vaktiyle öbür adamın dediği gibisin: Allahım, bana öyle bir dost ver ki, benim için kendi nefsimden daha sevimli olsun! (demiş)» buyurdu. Bundan sonra müşrikler sulh hakkında bizimle haberleşmeye taşladılar. Hattâ birbirimize gittik ve barıştık. Ben Talha b. Ubeydillâh'ın hizmetçisi idim. Onun atını suluyor; kaşağılıyor ve kendisine hizmet ediyor; yiyeceğinden de yiyordum. Allah ve Resulü (Sallallahu Aleyhi ve Sellem)'e hicret ederek ailemi ve malımı terk etmiştim. Mekkeliler'le biz barış akdederek birbirimizle ihtilâf edince ben bir ağacın yanına geldim ve dikenlerini süpürerek kütüğüne yaslandım. Az sonra bana Mekkeli müşriklerden dört kişi geldi; ve Resûlullah (Sallallahu Aleyhi ve Sellem) hakkında atıp tutmaya başladılar. Ben bunlara kızdım; ve başka bir ağaca değiştim. Onlar da silâhlarını astılar; ve yaslandılar. Onlar bu halde iken birden vadinin aşağısından bir dellâl: Yetişin muhacirlere!.. Züneym oğlu öldürüldü!., diye seslendi. Hemen kılıcımı kuşandım. Sonra bu dört kişiye kendileri uyku halinde iken hücum ettim. Ve silâhlarını alarak elimde deste yaptım. Sonra şöyle dedim: — Muhammed'in yüzünü şereflendiren Allah'a yemîn olsun ki, sizden biriniz başını kaldırırsa üzerinde iki gözü bulunan uzvu [40] keserim! Sonra onları sürerek Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirdim. Amcam Âmir dahî Abelâttan Mikrez denilen bir adamı müşriklerden yetmiş kişinin içinde çukallı bir at üzerinde olduğu halde yederek Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirdi. Resûlullah (Sallallahu Aleyhi ve Sellem) onlara bir baktı ve: «Bırakın onları! Fücurun başı, sonu onların olsun!» buyurdu; ve kendilerini afvetti. Allah da: (Sizi onlar üzerine muzaffer kıldıktan sonra Mekke'nin içinde onların ellerini sizden, sizin ellerinizi de onlardan men'eden odur.) [Fetih 24] âyetinin tamâmını indirdi. Seleme demiş ki : Bundan sonra Medine'ye dönmek üzere yola çıktık. Ve öyle bir menzile indik ki, bizimle Benî Lehyân (kabilesi) arasında bir dağ vardı. Onlar müşriktiler. Resulullah (Sallallahu Aleyhi ve Sellem) bu gece bu dağa tırmanacak kimse için istiğfar etti. Sanki o zat Nebi (Sallallahu Aleyhi ve Sellem) ile ashabının karakolu olacaktı. Seleme şöyle demiş: O gece ben iki veya üç defa (dağa) çıktım. Sonra Medine'ye geldik. Resûlullah (Sallallahu Aleyhi ve Sellem) yük develerini, ben de beraber olmak üzere hizmetçisi Rabâh ile gönderdi. Ben onun maiyyetine Talha'nın atı ile çıktım. Atı develerle birlikte mer'aya suya getirip götürüyordum. Sabahladığımız vakit ne göreyim! Abdurrahman El-Fezârî, Resûlullah (Sallallahu Aleyhi ve Sellem)'m develerini yağma etmiş ve hepsini götürmüş! Çobanını da öldürmüş! Bunun üzerine: — Yâ Rabâh! Bu atı al da Talha b. Ubeydillâh'a götür! Resûlullah (Sallallahu Aleyhi ve Sellem)'e de haber ver ki, müşrikler mer'âdaki sürüsünü yağma etmişlerdir! Dedim. Sonra bir tepenin üzerine çıkarak Medine'ye doğru döndüm. Ve üç defa: Yâ sabahım! diye haykırdım. Sonra düşmanların arkasından onlara ok atarak çıktım. Hem racez okuyor ve: «Ben Ekva'ın oğluyum! Bugün alçakların (helak) günüdür!» diyordum. Az sonra onlardan, bir adama yetiştim. Ve semerine bir ok attım. Hattâ okun yüzü omuzuna erdi. Ben: Al bunu! «Ben de Ekva'ın oğluyum! Bugün alçakların (helak) günüdür!» dedim. Vallahi onlara attım durdum; atlarını vuruyordum. Bana bir atlı döndümü bir ağaca gelerek kütüğüne oturuyor; sonra ona ok atıyor hayvanını vuruyordum. Hattâ dağ daraldı da onun dar yerlerine girdiler mi ben dağa çıkıyor, üzerlerine taş yuvarlıyordum. Böylece devam ettim. Onları kovalıyordum. Hattâ Re«ûlulah (Sallallahu Aleyhi ve Sellem)'in hayvanlarından Allah'ın yarattığı hiç bir deve yoktu ki, onu arkama almış olmayayım! Müşrikler de benimle hayvanın arasını serbest bırakmasınlar! Sonra onlara ok atarak kendilerini ta'kîb ettim. Nihayet otuzdan fazla elbise ve otuz mızrak bıraktılar. Hafiflemek istiyorlardı. Bir şey attılar mı üzerine taşlardan nişanlar koyuyordum. Onları Resûlullah (Sallallahu Aleyhi ve Sellem) ile ashabı tanırdı. Nihayet dar bir dağ yoluna geldiler. Bir de baktılar ki, yanlarına Bedr El-Fezârî'nin oğlu filânca gelmiş! Az sonra kuşluk (yâni sabah) kahvaltısı yapmak için oturdular Ben de bir hüyükün tepesine oturdum. Fezârî: — Bu gördüğün nedir? dedi. (Müşrikler) : — Bu adamla belâya çattık! Vallahi, alaca karanlıktan beri bizden ayrılmadı. Bize ok atıyor; hattâ elimizdeki her şeyi aldı. Dediler. — O halde ona sizden dört kişi gitsin! Dedi. Derhal onlardan dört kişi dağa benim yanıma çıktı. Bana konuşma imkânı verdikleri vakit: — Beni tanıyor musunuz? diye sordum. — Hayır! Sen kimsin? Dediler. — Ben Seleme b. Ekva'yım. Muhammed (Sallallahu Aleyhi ve Sellem)'in yüzünü şereflendiren Allah'a yemin olsun ki, sizden bir adamı yakalamak istemeyeyim; yoksa ona yetişirim! Ama sizden biri beni yakalamak isterse bana yetişemez! Dedim. Onlardan biri: — Ben biliyorum! Dedi. Ve döndüler. Ben yerimden ayrılmadım. Tâ ki Resûlullah (Sallallahu Aleyhi ve Sellem)'in süvarilerini ağaçların arasına girerken gördüm. Bir de baktım. Başlarında Ahram El-Esedî!.. Onun peşinde Ebû Katâdete'l-Ensârî!.. Onun peşinde de Mikdâd b. Esved EI-Kindi!.. Hemen Ahram'ın gemini tuttum. Küffâr dönüp gittiler. — Yâ Ahramî Bunlardan sakın! ki Resûlullah (Sallallahu Aleyhi ve Sellem)'le ashabı yetişinceye kadar yolunu kesmesinler! Dedim. Ahram şunu söyledi: — Yâ Seleme! Eğer Allah'a ve son güne îmân ediyor ve cennetin hak, cehennemin hak olduğunu biliyorsan benimle şehidliğin arasına girme! Bunun üzerine onu bıraktım. O da Abdurrahman'la karşılaştı. Ve hemen Abdurrahman'ın atını öldürdü. Abdurrahmân da onu yaralayarak öldürdü ve onun atına geçti. Resûlullah (Sallallahu Aleyhi ve Sellem)'in atlısı Ebû Katâde Abdurrahmân'a yetişerek onu yaraladı ve öldürdü. Muhammed (Sallallahu Aleyhi ve Sellem)'in yüzünü şereflendiren Allah'a yemîn olsun ki, yaya koşarak onları ta'kîb ettim. Hattâ arkamdaki Muhammed (Sallallahu Aleyhi ve Sellem)'in ashabından ve onların tozundan bir şey görmüyordum. Nihayet güneş kavuşmazdan önce, içinde Zû Kared denilen su bulunan bir dağ yoluna saptılar. Susuz olduklarından ondan su içmek istiyorlardı. Bana baktılar; arkalarından koşuyorum. Ben onları bundan kovdum (yâni bertaraf ettim). Ondan bir damla tadamadılar. Ve çıkarak sarp bir yola çattılar. Ben de koştum; ve onlardan bir adama yetişerek ona omuz başı kemiğne bir ok yetiştirdim. — Al şunu! Ben Ekva'ın oğluyum! Bugün alçakların (helak) günüdür! dedim. — Ey anası ağlayasıca! Sabahki Ekva'ı mı? Dedi. — Evet, ey kendinin düşmanı! Sabahki Ekva'ın!.. cevabını verdim. Sarp bir yolda iki at bıraktılar. Ben bunları sürerek Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirdim. Âmir de birinde sulandırılmış süt, diğerinde su bulunan iki tulum ile bana yetişti. Ben abdest aldım ve su içtim. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem)'e geldim. Kendileri benim müşrikleri kovduğum suyun başında idi. Bir de ne göreyim! Resûlullah (Sallallahu Aleyhi ve Sellem) o develeri ve benim müşriklerden kurtardığım her şeyi, her oku ve her elbiseyi almış! Bilâl benim düşmandan kurtardığım develerden bir dişi deve boğazlamış bile! Kendisi onun ciğerinden, hörgücünden Resûlullah (Sallallahu Aleyhi ve Sellem)'e kızartıyor! — Yâ Resûlâllah! Bana müsaade buyur da şu cemaatten yüz adam seçeyim. Ve düşmanı ta'kîb edeyim de onlardan tepelemediğim hiç bir haberci kalmasın! Dedim. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) güldü. Hattâ gündüzün ışığında yan dişleri göründü. Ve: «Yâ Seleme! Acaba bir şey yapacağını sanıyor mu idin?» dedi. — Evet! Sana ikram buyuran Allah aşkına! cevâbını verdim. «Şüphesiz ki onlara şimdi Gatafan toprağında ziyafet verilmektedir.» buyurdular. Derken Gatafân'dan bir adam gelerek: — Onlar için filân bir deve boğazladı. Ama derisini açtıkları vakit bir toz gördüler. Bunun üzerine: Düşman size gelmiş! Dediler ve hemen çıkarak kaçtılar. Dedi. Sabahladığımızda Resûlullah (Sallallahu Aleyhi ve Sellem). «Bugün süvarilerimizin en hayırlısı Ebû Katade, piyadelerimizin en hayırlısı da Seleme idi.» buyurdular. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) bana iki hisse verdi. Biri süvâri hissesi, biri de piyade hissesi idi. Benim için bunların ikisini bir araya getirdi. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) Medine'ye dönmek üzere beni Adbâ'ın üzerinde arkasına aldı. Ensârdan bir zât vardı ki yaya koşusunda geçilmezdi. Biz yürümekte iken: Medine'ye kadar koşu yapacak yok mu? Koşucu var mı? demeye ve bunu tekrarlamaya başladı. Ben bunun sözünü işitince: — Sen hiç bir iyiye ikram etmez ve hiç bir şerefliyi savmaz mısın? dedim. — Hayır! Meğer ki Resûlullah (Sallallahu Aleyhi ve Sellem) olal cevâbını verdi. — Yâ Resûlâllah! Annem babam hakkı için! Müsaade buyurda şu adamla müsabaka edeyim! Dedim. «Dilersen !» buyurdu. — Kendine gel! Dedim. Ve ayaklarımı ayarlayarak bir sıçradım!.. Bir koştum!.. Nefesim tükenmesin, diye bir veya iki bayırda kendimi tuttum. Ve onun izinden koştum. Yine bir veya iki bayırda kendimi tuttum. Sonra ona yetişmek için eşkini kaldırdım. Ve onun iki omuzu arasına dokundum. Geçildin vallahi! dedim. — Ben biliyorum! dedi. Hasılı Medine'ye kadar onu geçtim. Vallahi üç geceden başka durmadık. Tâ ki Resûlullah (Sallallahu Aleyhi ve Sellem) le birlikte Hayber (seferin)'e çıktık. Ve amcam Âmir düşmana racez okumaya başladı: «Vallahi, Allah olmasa idi biz ne hidayete erer; ne sadaka verir; ne de namaz kılardık!» «Biz senin fadlından müstağni değiliz!;; «İmdi düşmanla karşılaşırsak, ayaklarımızı sabit kıl!» «Üzerimize mutlaka sekînet indir!» Resûlullah (Sallallahu Aleyhi ve Sellem): «Kim bu?» diye sordu. (Amcam): — Ben Âmir! cevabını verdi. «Rabbin sana mağfiret buyursun!» Dedi. Resûlullah (Sallallahu Aleyhi ve Sellem) hassaten bir insana mağfiret dilerse, o insan mutlaka şehîd olurdu! Bu sebeple Ömer b. Hattâb, bir devesinin üzerinde: — Ya Nebiyyallah! Âmir'le bizi faydaIandır saydım ya! diye seslendi. Hayber'e vardığımızda hükümdarları Marhab kılıcını bir kaldırıp bir indirerek çıktı. Hem: «Hayber benim Marhab olduğumu iyi bilir.» «Silahı tamam, denenmiş bir kahraman!..» ipIer geldi mi alev kesilir!» diyordu. Onun karşısına amcam Âmir çıktı. Ve şunları söyledi: «Hayber benim Âmir olduğumu iyi bilir.» «Silâhı tamam, bahâdir, kahraman!..» Derken iki vuruşla birbirlerine girdiler. Ve Marhab'ın kılıcı Âmir'in kalkanının içine düştü. Âmir onu alttan vurmaya kalkıştı. Fakat kılıcı kendine dönerek can damarını kesti. Ölümü de bundan oldu. Seleme demiş ki: Dışarı çıktım. Bir de baktım Nebi (Sallallahu Aleyhi ve Sellem)'in ashabından birkaç kişi: Âmir'in ameli bâtıl oldu! O kendini öldürdü! diyorlar. Hemen ağlayarak Peygamber (Sallallahu Aleyhi ve Sellem)'e geldim; ve; — Yâ Resûlâllah! Âmir'in ameli bâtılmı oldu? dedim. Resûlullah (Sallallahu Aleyhi ve Sellem): «Bunu kim söyledi?» diye sordu. — Senin ashabından bazı kimseler! Dedim. «Bunu söyleyen hatâ etmiş! Bilâkis onun için ecri iki defadır!» buyurdu. Sonra beni Alî'ye gönderdi. Ali gözlerinden rahatsızdı. Ve: «Bu sancağı behemehal Allah'ı ve Resulünü seven yahut Allah'ın ve Resulünün sevdiği bir adama vereceğim!» buyurdular. Müteakiben ben Alî'ye vardım. Ve onu, gözlerinden rahatsız olduğu halde yederek getirdim. Nihayet kendisini Resûlullah (Sallallahu Aleyhi ve Sellem)'e götürdüm. Gözlerine tükürdü; ve hemen iyileşti. Sancağı ona verdi. Marhab da çıkarak şunları söyledi: «Hayber benim Marhab olduğumu iyi bilir.» «Silâhı tamam, denenmiş bir kahraman!» «Harpler geldi mi alev kesilir!» Bunun Üzerine Alî de şöyle dedi: «Ben o kimseyim ki annem adımı arslan koymuştur.» -Ormanların arslanı gibi çirkin manzaralı düşmanlara ufak ölçekle, sendera kilesi ölçerim!» Arkacığından Marhab'ın başını vurarak onu tepeledi. Bilâhare fetih de onun eliyle müyesser oldu. Bâvi ibrahim demiş ki: Bize Muhammed b. Yahya rivayet etti. (Dediki): Bize Abdüssamed b. Abdilvâris, İkrime b. Ammâr'dan bu hadîsi bütün uzunluğu ile rivayet etti",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4679,
			"arabicnumber": "1808",
			"text": "Bana Amr b. Muhammed En Nâkıd rivayet etti. (Dediki): Bize Yezîd b. Hârûn rivayet etti. (Dediki): Bize Hammâd b. Seleme, Sâbit'den, o da Enes b. Mâlik'den naklen haber verdi ki, Mekkeillerden seksen kişi silâhlı olarak Ten'îm dağından Resûlullah (Sallallahu Aleyhi ve Sellem)'in üzerine inmişler. Nebi (Sallallahu Aleyhi ve Sellem)'le ashabını gafil avlamak istiyorlarmış. Fakat o kendilerini esir alarak sağ bırakmış. Bunun üzerine Allah (Azze ve Celle): (Sizi onlara muzaffer kıldıktan sonra Mekke içerisinde onların ellerini sizden, sizin ellerinizi de onlardan men' eden O'dur!) [Fetih 24] âyet-i kerîmesi­ni indirmiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4682,
			"arabicnumber": "1810",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Ca'fer b. Süleyman, Sâbit'ten, o da Enes b. Mâlik'den naklen haber verdi. Şöyle demiş : Rcsûlullah (Sallallahu Aleyhi ve Sellem) gazaya Ümmti Süleym'le birlikte giderdi. O gaza ettiği vakit Ensâr'dan bazı kadınlar da maiyyetinde bulunur; su verirler ve yaralıları tedâvî ederlerdi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4683,
			"arabicnumber": "1811",
			"text": "Bize Abdullah b. Abdirrahmân Ed-Dârimî rivayet etti. (Dediki): Bize Abdullah b. Amr rivayet etti —bu zât Ebû Ma'mer El-Minkârî'dir— (Dediki): Bize Abdülvâris rivayet etti, (Dediki): Bize Abdülazîz —ki ibni Suheyb'tir— Enes b. Mâlik'ten rivayet etti. Şöyle demiş: Uhud harbi kopunca insanlardan bazıları Nebi (Sallallahu Aleyhi ve Sellem)'in yanından bozguna uğradılar. Ebû Talha ise Nebi (Sallallahu Aleyhi ve Sellem)'in önünde onun üzerine deriden bir kalkan tutuyordu. Ebû Talha şiddetle ok atan atıcı bir adamdı. O gün iki veya üç yay kırdı. Beraberinde ok torbası bulunan bir adam geçerken hemen Peygamber (Sallallahu Aleyhi ve Sellem): «O okları EbO Talha'ya saç!» buyururdu. Nebiyyullah (Sallallahu Aleyhi ve Sellem) uzanıp düşmana bakıyor; Ebû Talha: — Yâ Nebiyyallah! Annem babam sana feda olsun, uzanıp bakma! Düşmanın oklarından sana bir ok isabet etmesin! Göğsüm onlara senin göğsünden daha yakın olsun! Diyordu. Yemin olsun ki, Âişe binti Ebî Bekir ile Ümmü Süleyrn'i paçalarını sıvamış halde gördüm. Baldırlarının bileziklerini görüyordum. Su tulumlarını sırtlarında taşıyor; sonra gazilerin ağızlarına boşaltıyor; bilâhare dönüp tekrar dolduruyor; ve gelerek yine cemaatin ağızlarına boşaltıyorlardı. Vallahi uyuklamaktan Ebû Talha'nın elinden ya iki yahut üç defa kılıç düştü",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4684,
			"arabicnumber": "1812.01",
			"text": "Bize Abdullah b. Mesleme b. Ka'neb rîvayet eti. (Dediki): Bize Süleyman (yâni ibrıi Bilâl) Ca'fer b. Muhammed'den, o da babasından, o da Yezîd b. Hürmüz'den naklen rivayet etti ki, Necdet, ibni Abbas'a mektup yazarak ona beş şey sormuş, ibni Abbâs: — Bir ilmi gizlemiş olmasam buna (cevap) yazmazdım! Demiş. Necdet ona şöyle yazmış: «Bundan sonra: Bana haber ver: Resûlullah (Sallallahu Aleyhi ve Sellem) kadınlarla birlikte gaza eder mi idi? Onlara hisse ayırır mı idi? Çocukları öldürür mü idi? Yetimin yetimlik müddeti ne zaman sona erer? Beşte bir kimin hakkıdır?» ibni Abbâs ona şu cevabı yazmış: «Bana mektup yazarak: Resûlullah (Sallallahu Aleyhi ve Sellem) kadınlarla birlikte gaza eder mi idi? diye sordun. (Evet) onlarla birlikte gaza ediyordu. Onlar da yaralıları tedâvî ediyor; kendilerine ganimetten bir şeyler veriliyordu. Hisseye gelince: Onlara hisse ayırmamışlar. Şüphesiz Resûlullah (Sallallahu Aleyhi ve Sellem) çocukları da öldürmezdi. O halde sen de çocukları öldürme! Bana yazarak: Yetimin yetimlik müddeti ne zaman sona erer? diye sordun. Ömrüme yemîn ederim ki, adam vardır, sakalı biter de hâlâ kendi hakkını almaktan zayıf, kendi nâmına vermekten zayıftır. işte kendisi için başkalarının aldığının elverişlisinden almağa başladı mı artık ondan yetimlik gitti demektir. Bana yazarak: Beşte birin kime verileceğini sordun. Biz: Bu bizim hakkımızdır derdik, fakat kavmimiz bunu bize kabul etmedi.»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4685,
			"arabicnumber": "1812.02",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile ishâk b. ibrahim ikisi birden Hatim b. ismail'den, o da Ca'fer b. Muhammed'den, o da babasından, o da Yezîd b. Hürmüz'den naklen rivayet etti ki, Necdet, ibni Abbâs'a mektup yazarak ona bir takım meseleler sormuş... Râvi, Süleyman b. Bilâl hadîsi gibi rivayet etmiştir. Yalnız Hâtim'in hadîsinde şu ifâde vardır: «Resûlullah (Sallallahu Aleyhi ve Sellem) çocukları öldürmezdi. Sen de çocukları öldürme! Meğer ki, Hadir'ın öldürdüğü çocuktan irildiğini bilmiş olasın!» ishâk, Hâtim'den rivayet ettiği hadîsinde; «Mü'mini ayırt edersin. Ve kâfiri öldürür: Mü'nini bırakırsın!» ifadesini ziyâde etmiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4686,
			"arabicnumber": "1812.03",
			"text": "Bize ibni Ebî Ömer de rivayet etti. (Dediki): Bize Süfyân. ismail b. Ümeyye'den, o da Saîd El-Makburî'den. o da Yezid b. Hürmüz'den naklen rivayet etti. Şöyle demiş : Necdet b. Ânıir El-Harûrj, ibni Abbâs'a mektup yazarak ona ganimet malının başında bulunan köle ile kadına taksim yapılıp yapılmayacağını, çocukların öldürülmesini, yetimden yetimlik hükmünün ne zaman kesileceğini yakın akrabanın kimler olduğunu sordu. O da Yezîd'e şuaları söyledi: «Yaz ona! Şayet bir ahmaklığa düşmeyecek olsa ona yazmazdım. Yaz! Sen bana mektup yazarak ganimet malının başında bulunan kadınla köleye bir şey taksim edilir mi? diye sordun. Onlara bir şey yoktur: Meğer ki kendilerine bir parça hediye verile! Bana yazarak çocukların öldürülmesi meselesini sordun! Şüphesiz ki Resûlullah (Sallallahu Aleyhi ve Sellem) onları öldürmemiştir. Sen dahî onları öldürme! Meğer ki Musa'nın arkadaşının öldürdüğü çocuktan bildiğini sen de onlardan bilesin! Bana yazarak yetimi, ondan yetimlik isminin ne zaman kesileceğini sordun. Muhakkak ki, bâlig oluncaya ve kendisinden erginlik sezilinceye kadar ondan yetimlik ismi kesilmez. Bana yazarak yakın akrabanın kimler olduğunu sordun. Biz. bunların kendimiz olduğunu söyledik. Ama kavmimiz bunu kabul etmedi.»",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4687,
			"arabicnumber": "1812.04",
			"text": "{…} Bize bu hadîsi Abdurrahmân b. Bişr El-Abdî de rivayet etti. (Dediki): Bize Sülyân rivayet etti. (Dediki): Bize ismail b. Ümeyye, Saîd b. Ebî Saîd'den, o da Vezîd b. Hürmüz'den naklen rivayet etti. Şöyle demiş: Necdet, îbni Abbâs'a yazdı... Ve râvi bu hadisi yukarki hadîs gibi rivayet etmiştir. Ebû ishâk dediki: Bana Abdurrahmân b. Bişr rivayet etti. (Dediki): Bize Süfyân bu hadîsi bütün uzunluğu ile rivayet etti",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4688,
			"arabicnumber": "1812.05",
			"text": "Bize ishâk b. ibrahim rivayet etti. (Dediki): Bize Vehb b. Cerîr b. Hâzim haber verdi. (Dediki): Bana babam rivayet etti. (Dediki): Ben Kays'ı, Yezîd b. Hürmüz'den rivayet ederken dinledim. H. Bana Muhammed b. Hatim dahî rivayet etti. Lâfız onundur. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Cerîr b. Hâzim rivayet etti. (Dediki): Bana Kays b. Sa'd, Yezîd b. Hürmüz'den naklen rivayet etti. Şöyle demiş: Necdet b. Âmir, İbni Abbâs'a mektup yazdı, lbni Abbâs onun mektubunu okurken ve cevâbını yazarken ben yanında idim. ibni Abbâs: «Vallahi, bu adamı içine düşeceği bir pislikten men'etmiş olmasam ona cevap yazmaz; memnun etmek istemezdim!» Dedi. Ve kendisine, şöyle yazdı: «Sen Allah'ın zikrettiği yakın akrabanın sehmini, bunların kimler olduğunu sordun. Gerçekten biz Resûlullah (Sallallahu Aleyhi ve Sellem)'in akrabası kendimiz olduğumuza kaildik. Ama bunu kavmimiz kabul etmedi. Sen yetimin yetimliğinin ne zaman geçeceğini de sordun. Yetim nikâh çağına erişir de kendisinden erginlik sezilir ve malı kendisine verilirse onun yetimliği geçmiş demektir. Resûlullah (Salllallahu Aleyhi ve Sellem) müşriklerin çocuklarından kimseyi öldürür mü idi? diye sordun. Şüphemiz ki, Resûlullah (Salllallahu Aleyhi ve Sellem) onlardan hiç bir kimseyi öldürmezdi. Sen dahî, onlardan kimseyi öldürme! Meğer ki Hızır'ın öldürdüğü vaki, o çocuk hakkında bildiği şeyi sen de onlardan bilir olasın! Sen bana kadın ve köle’nin ganimetten hissesi varmıdır? Diye sordun. Onlar için ma'lûm bir hisse yoktur. Meğer ki, cemaatinin payından veresin. Kadınla köle harbe iştirak ederlerse her birine ma'lûm bir hisse verile!» (Mahir: Bu paragraf kitapta eksik ve bozuk, bu paragrafın tercemesi bana ait)",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4689,
			"arabicnumber": "1812.06",
			"text": "Bana Ebû Kureyb de rlvâjet etti. (Dediki): Bize Ebû Usâme rivayet etti. (Dediki): Bize Zaide rivayet etti. (Dediki): Bize Süleyman El-A'meş, Muhtar b. Sayfî'den, o da Yezîd b. Hürmüz'den naklen rivayet etti. (Şöyle demiş) : Necdet, ibni Abbâs'a yazdı... Ve râvi hadîsin bir kısmını zikretmiş; fakat kıssayı, hadîslerini sıraladığımız râviler gibi tamamlamamıştır. DİKKAT İZAH’DAN SONRA BAŞKA RİVAYETLER DE VAR",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4690,
			"arabicnumber": "1812.07",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdürrahîm b. Süleyman, Hişâm'dan, o da Hafsa binti Sîrîn'den, o da Ensardan Ümmü Atıyye'den naklen rivayet etti. Ümmü Atıyye şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte yedi gazada bulundum. Menzillerinde onların arkalarında bulunur; kendilerine yemek yapar; yaralıları tedâvî eder; hastalara bakardım",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4691,
			"arabicnumber": "1812.08",
			"text": "{…} Bize Amru'n-Nâkıd dahî rivayet etti. (Dediki): Bize Yezîd b. Hârûn rivayet etti. (Dediki): Bize Hişâm b. Hassan bu isnâdla bu hadîsin benzerini rivayet etti",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4692,
			"arabicnumber": "1254.02",
			"text": "Bize Muhammed b. El-Müsennâ ile ibni Beşşâr riva­yet ettiler. Lafız ibnü'l-Mtisennâ'nındır. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Ebû ishâk'dan naklen îrivâyet etti ki, Abdullah b. Yezîd halkla yağmur duasına çıkmış. Ve iki rek'at namaz kılmış. Sonra yağmur duası yapmış. Abdullah şunları söylemiş: Derken o gün Zeyd b. Erkam'a tesadüf ettim. Onunla aramızda bir adamdan başka kimse yoktu. (Yahut onunla aramızda bir adam vardı.) Ona: — Resulullah (Sallallahu Aleyhi ve Sellem) kaç gaza yaptı? diye sordum. — On dokuz! cevâbını verdi. — Yâ sen onunla birlikte kaç gaza yaptın? Dedim. — On yedi gaza! cevâbını verdi. — Onun yaptığı ilk gaza hangisidir? diye sordum. — Zâtü'l-Useyr yahut Zâtü'l-Uşeyr'dir. Dedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4693,
			"arabicnumber": "1254.03",
			"text": "Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bire Yahya b. Âdem rivayet etti. (Dediki): Bize Züheyr, Ebû ishâk'dan, o da Zeyd b. Erkam'dan naklen rivayet etti. Ebû ishâk onu Zeyd b. Erkam'dan dinlemiş, ki Resûlullah (Sallallahu Aleyhi ve Sellem) ondokuz gaza yapmış, fakat hicret ettikten sonra bir defa hacc etmiş; Hacctü'l-Vedâı! Ondan başka haccetmemiş. İzah 1815 te",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4694,
			"arabicnumber": "1813",
			"text": "Bize Züheyr b. Harb rivayet etti. (Dediki): Bize Ravh b. Ubâde rivayet etti. (Dediki): Bize Zekeriyyâ rivayet etti. (Dediki): Bize Ebû'z-Zübeyr haber verdiki, Câbir b Abdillâh'ı: «Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'le tirlikte on dokuz gazaya iştirak ettim!» derken işitmiş. Câbir : — Bedir'Ie Uhud gazâlarında bulunamadım. Babam men'etii. Ama (babam) Abdullah Uhud günü öldürülünce bir daha hiç bir gazada Resûlullah (Sallallahu Aleyhi ve Sellem)'den geri kalmadım! Demiş. İzah 1815 te",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4695,
			"arabicnumber": "1814.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Zeyd b. Hubâb rivayet etti. H. Bize Saîd b. Muhammed El-Cermî de rivayet etti. (Dediki): Bize Ebû Tumeyle rivayet etti. Her iki râvi demişler ki: Bize Hüseyn b. Vâkid, Abdullah b. Büreyde'den, o da babasından naklen rivayet etti: «Resûlullah (Sallallahu Aleyhi ve Sellem) on dokuz gaza yaptı; bunların sekizinde harb etti.» demiş. Ebû Bekir «minhünne» demedi. O hadîsinde: «Bana Abdullah b. Büreyde rivayet etti.» dedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 4696,
			"arabicnumber": "1814.02",
			"text": "Bana Ahmed b. Hanbel de rivayet etti. (Dediki): Bize Mu'temir b. Süleyman, Kehmes'den, o da ibnü Büreyde'den, o da babasından naklen rivayet etti ki, babası, ResûluIIalı (Sallallahu Aleyhi ve Sellem)'le birlikte on altı gazada bulunduğunu söylemiş. İzah 1815 te",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 4697,
			"arabicnumber": "1815.01",
			"text": "Bize Muhammed b. Abbâd rivayet etti. (Dediki): Bize Hatim (yâni îbni ismail) Yezîd'den —ki ibni Ebî Ubeyd'dir— rivayet etti. (Demişki): Seleme'yi şunları söylerken işittim: Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'e birlikte on yedi gazada bulundum. Gönderdiği hcy'etler meyânında dokuz gazaya çıktım. Bir defa kumandanımız Ebû Bekir, bîr defa da Usâme b. Zeyd idi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 4698,
			"arabicnumber": "1815.02",
			"text": "{…} Bize Kuteybe b. Saîd de rivayet etti. (Dediki): Bize Hatim bu isnadla rivayet etti. Yalnız o her iki yerde de: «Yedi gaza» dedi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 4699,
			"arabicnumber": "1816",
			"text": "Bize Ebû Âmir Abdullah b. Berrâd El-Eş'arî ile Muhammed b. Alâ' El-Hemdânî rivayet ettiler. Lâfız Ebû Amirindir. (Dedilerki): Bize Ebû Usâme, Büreyd b. Ebî Bürde'den, o da Ebû Bürde'den o da Ebû Musa'dan naklen rivayet etti. (Şöyle demiş) : Altı nefer olduğumuz hâlde Resûlullah (Sallallahu Aleyhi ve Sellem)'Ie birlikte bir gazaya çıktık. Aramızda bir deve vardı ki, ona nevbetleşe biniyorduk. Derken ayaklarımız delindi. Benim ayaklarım da delindi ve tırnaklarım düştü. Artık ayaklarımıza çaput sarıyorduk. işte ayaklarımıza çaput sardığımız için bu gazaya: Zâtü'r-Rikaa gazası adı verildi. Ebû Bürde demiş ki: «Ebû Mûsâ bu hadîsi rivayet etti; sonra bunu karîh gördü. Gâlibâ amelinden bir şey ifşa etmiş olacağından kerih gordü.» Ebû Usâme: «Bana Büreyd'den başkası (Allah onun mükâfatını verir.) cümlesini ziyâde etti.» demiş",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 4700,
			"arabicnumber": "1817",
			"text": "Bana Zühyr b. Harb rivayet etti. (Dediki): Bize Abdurrahmân b. Mehdî, Mâlik'den rivayet etti. H. Bana bu hadîsi Ebû't-Tâhir de rivayet etti. Lâfız onundur. (Dediki): Bana Abdullah b. Vehb, Mâlik b, Enes'den, o da Fudayl b. Ebî Abdillâh'dan, o da Abdullah b. Niyâr EI-Eslemı'den, o da Urvetü'bnü-z Zübeyr'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Âişe'den naklen onun şöyle dediğini rivayet etti: Resûlullah (Sallallahu Aleyhi ve Sellem) Bedir tarafına yola çıktı. Harratü'l-Vetera'ya varınca kendisine bir adam yetişti ki, bu adamın cür'et ve cesareti söyleniyordu. Bu sebeple Resûlullah (Sallallahu Aleyhi ve Sellem)'in ashabı onu gördükleri vakit sevindiler. Resûlullah (Sallallahu Aleyhi ve Sellem)'e yetişince ona : — Sana tâbi' olmak ve seninle beraber yaralanmak için geldim, dedi. Resûlullah (Sallallahu Aleyhi ve Sellem) kendisine: «Allah'a ve Resulüne îmân ediyor musun?» diye sordu. — Hayır! dedi. «Öyle ise dön! Ben asla bir müşrikten yardım alamam!» buyurdular. Âişe demiş ki: Sonra gitti. Ağacın yanına vardığımızda o adam Resûlullah (Sallallahu Aleyhi ve Sellem)'e yine yetişti; ve ona ilk defa söylediği gibi söyledi. Peygamber (Sallallahu Aleyhi ve Sellem) de ona ilk defa söylediği gibi söyledi. «Öyle ise dön! Ben asla bir müşrikten yardım alamam!» buyurdu. Sonra döndü: Ve Resûlullah (Sallallahu Aleyhi ve Sellem)'e Beydâ'da yetişti. O da ilk defa dediği gibi: «Allah'a ve Resulüne îmân ediyor musun?» diye sordu. Adam: __ Evet! cevâbını verdi. Resûlullah (Sallallahu Aleyhi ve Sellem) ona: «O halde yürü!» buyurdular",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 182
			}
		}
	]
}