{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4701,
			"arabicnumber": "1818.01",
			"text": "Bize Abdullah b. Mesleme b. Ka'neb ile Kuteybr b. Said rivayet eltiler. (Dedilerki): Bİze Mugîra rivâyet etti. H. Bize Züheyr b. Harb ile Amru'n-Nâkıd da rivayet ettiler. (Dedilerki); Bize Süfyân b. Uyeyne rivayet etti. Her iki râvi Ebii'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hureyre'den naklen rivayet etmişlerdir. Ebû Hureyre şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem); (Züheyr'in hadîsinde: «Onu Nebi (Sallallahu Aleyhi ve Sellem)'e vardırarak» ibaresi vardır. Amr ise «rivayet itibarı ile» dedi.) [1] «İnsanlar bu işde Kureyş'e tâbi'dir. Müslümanı müslümanına, kâfiri de kâfirine!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4702,
			"arabicnumber": "1818.02",
			"text": "Bize Muhammed b. Râfi de rivayet etti. (Dediki): Bize Abdürrazzâk rivayet etti. (Dediki): Biae Ma'mer, Hemmâm b. Münebbih'den rivayet etti. Hemmâm: Bize Ebû Hureyre'nin Resûlullah (Sallallahu Aleyhi ve Sellem)'den rivayet ettiği budur... diyerek bir takım hadisler zikretti. Ez cümle: Resûlullah (Sallallahu Aleyhi ve Sellem): «İnsanlar bu işde Kureyş'e tâbi'dir. Müslümanları onların müslümanlarına, kâfirleri de onların kâfirlerine tâbidir.» buyurdular. Dedi. İzah 1819 da",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4703,
			"arabicnumber": "1819",
			"text": "Bana Yahya b. Habîb El-Hârisî rivayet etti. (Dediki): Bize Ravh rivayet etti. (Dediki): Bize İbni Cüreyc rivayet etti. (Dediki): Bana Ebû'z-Zübeyr rivayet etti ki, kendisi Câbir b. Abdillâh'ı şöyle derken işitmiş: Nebi (Sallallahu Aleyhi ve Sellem): «insanlar hayırda ve şerde Kureyş'e tûbi'dirler.» buyurdu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4704,
			"arabicnumber": "1820",
			"text": "Bize Ahmed b. Abdillâh b. Yûnus rivayet etti. (Dediki): Bize Âsim b. Muhammed b. Zeyd, babasından rivayet etti. (Demişki): Abdullah şunu söyledi: Resûlullah (Sallallahu Aleyhi ve Sellem): «İnsanlardan iki kişi kaldığı müddetçe bu iş Kureyş'de devam edecektir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4705,
			"arabicnumber": "1821.01",
			"text": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Cerîr, Husayn'dan, o da Câbir b. Semûra'dan naklen rivayet etti. Ben Peygamber (Sallallahu Aleyhi ve Sellem)'i buyururken işittim, demiş. H. Bize Rıfâa b. Heysem El-Vâsıtî de rivayet etti. Lâfız onundur. (Dediki): Bize Hâlid (yâni İbni Abdillâh Et-Tahhân) Husayn'dan, o da Câbir b. Semûra'dan naklen rivayet etti. Câbir şöyle demiş : Babamla birlikte Nebi (Sallallahu Aleyhi ve Sellem)'in yanına girdim. Ve onu: «Gerçekten bu iş onların aralarında on iki halîfe geçinceye kadar bitmeyecektir!» buyururken işittim. Sonra bana gizli kalan bir söz konuştu. Hemen babama : — Ne söyledi? diye sordum. — «Hepsi Kureyş'ten» (buyurdu) dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4706,
			"arabicnumber": "1821.02",
			"text": "Bize İbni Ebî Ömer rivayet etti. (Dediki): Bize Süfyân, Abdülmelik b. Umeyr'den, o da Câbir b. Semûra'dan naklen rivayet etti. Şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem)'i : «İnsanların (hilâfet) işi, kendilerine on iki zat hükmettiği müddetçe yürümekte devam edecektir.» buyurdu. Sonra Nebi (Sallallahu Aleyhi ve Sellem) bana gizli kalan bir söz konuştu. Hemen babama : — Resûlullah (Sallallahu Aleyhi ve Sellem) ne söyledi? diye sordum. — «Hepsi Kureyş'ten» (buyurdu) dHi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4707,
			"arabicnumber": "1821.03",
			"text": "{…} Bize Kuteybetü'bnü Saîd de rivayet etti. (Dediki): Bize Ebû Avâne, Simâk b. Câbir b. Semûra'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsi rivayet etti. Ama : «İnsanların işi yürümekte devam edecektir» cümlesini anmadı",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4708,
			"arabicnumber": "1821.04",
			"text": "Bize Heddâb b. Hâlid El-Ezdî rivayet etti. (Dediki): Bize Hammâd b. Seleme, Simâk b. Harb'dan rivayet etti. Şöyle demiş: Câbir b. Semura'yi şunu söylerken işittim: Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i: «İslâm on iki halîfeye kadar azîz olmakta devam edecektir!» buyururken işittim. Sonra bir kelime söyledi ki, onu anlamadım. Ve babama : — Ne söyledi? diye sordum. — «Hepsi Kureyş'ten» (buyurdu) dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4709,
			"arabicnumber": "1821.05",
			"text": "Bize Ebû Bekir b. Ebi Şeybe rivayet etti. (Dediki): Bize Ebû Muâviye, Dâvûd'dan, o da Şa'bî'den, o da Câbir b. Semûra'dan naklen rivayet etti. Câbir şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem): «Bu iş (hilâfet) on iki halîfeye kadar azîz olarak devam edecektir!» buyurdu. Sonra bir şey konuştu ki, onu anlamadım. Ve babama : — Ne söyledi? diye sordum. — «Hepsi Kureyş'ten» (buyurdu) dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4710,
			"arabicnumber": "1821.06",
			"text": "Bize Nasr b. Alî El-Cehdamî rivayet etti. (Dediki): Bize Yezîd b. Zürey' rivayet etti. (Dediki): Bize İbni Avn rivayet etti, H. Bize Ahmed b. Osman En-Nevfelî de rivayet etti. Lâfız onundur. (Dediki): Bize Ezher rivayet etti. (Dediki): Bize İbni Avn, Şa'bî'den, o da Câbir b. Semûra'dan naklen rivayet etti. Şöyle demiş : Beraberimde babam olduğu halde Resûlullah (Sallallahu Aleyhi ve Sellem)'e gittim. Ve onu: «Bu dîn on iki halîfeye kadar azız, muhkem devam edecektir!» buyururken işittim. Arkacığından bir kelime söyledi ki, halk onu işitmeme mâni oldu. Bunun üzerine babama: — Ne söyledi? diye sordum. — «Hepsi Kureyş'ten» (buyurdu) dedi. İzah 1822 de",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4711,
			"arabicnumber": "1822.01",
			"text": "Bize Kuteybetü'bnü Saîd ile Ebû Bekir b. Ebî Şcybe rivayet ettiler. (Dediler ki) : Bize Hatim —ki İbni İsmail'dir— Muhacir b. Mismâr'dan, o da Âmir b. Sa'd b. Ebî Vakkaas'dan naklen rivayet etti. (Demişki): Kölem Nâfi' ile birlikte Câbir b. Semûra'ya : Resûlullah (Sallallahu Aleyhi ve Sellem)'den işittiğim bir şeyi bana haber ver! diye yazdım. O da bana şunu yazdı: Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i cum2a günü, Eslemî'nin recmolunduğunun akşamı: «Bu dîn kıyamet kopuncaya yahut sizin üzerinize, hepsi Kureyş'ten olmak üzere on iki halîfe gelinceye kadar durmakta devam edecektir!» buyururken işittim. Onu: «Müslümanlardan bir çetecik Beyaz evi, Kisrâ'nın evini yahut Âl-i Kisrâ'nın evini fethedecekler!» buyururken de işittim. Onu: «Şüphesiz ki kıyametten önce yalancılar çıkacaktır; onlardan korunuverin!» buyururken de işittim. Onu: «Allah birinize bir hayır verir (ise) kendinden ve ailesi efradından başlasın!» buyururken de işittim. Onu: «Havzın başına ilk varacak benin!»buyururken de işittim",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4712,
			"arabicnumber": "1822.02",
			"text": "{…} Bize Muhammed b. Râfi' rivayet etti. (Dediki): Bize İbni Ebî Füdeyk rivayet etti. (Dediki): Bize İbni Ebi Zi'b, Muhacir b. Mismâr'dan, o da Amir b. Sa'd'dan naklen rivayet etti ki, Âmir Semuratü'l-Adevi'nin oğluna: Bize Resûlullah (Sallallahu Aleyhi ve Sellem) 'den işittiğini rivayet et! diye mektup göndermiş. O da : — Ben Resûlullah (Sallallahu Aleyhi ve Sellem) şöyle buyururken işittim... demiş. Ve râvi, Hatim'in hadîsi gibi rivayette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4713,
			"arabicnumber": "1823.01",
			"text": "Bize Ebû Kureyb Muhammed b. Alâ' rivayet etti. (Dediki): Bize Ebû Usâme, Hişâm b. Urve'den, o da babasından, o da İbni Ömer'den naklen rivayet etti. (Şöyle demiş): Babam yaralandığı zaman yanına vardım. Ashâb kendisini sena ederek: — Allah seni hayırla mükâfatlandırsın! Dediler. O da : — Uman ve korkan! dedi. Cemâat: — Kendine halîfe bırak! dediler. Bunun üzerine şunları söyledi: — Sizin işinizi diri iken de ölü iken de üzerimemi alayım? Hilâfetten nasibimin; lehime, aleyhime değil, (sadece) yetecek kadar olmasını dilerim! Halîfe bırakmış olsam, benden daha hayırlısı (yâni Ebû Bekir) kendine halîfe bırakmıştır. Sizi (halifesiz) bıraksam, benden daha hayırlı olan Resulullah (Sallallahu Aleyhi ve Sellem) sîzi (halifesiz) bıraktı! Abdullah şöyle demiş: Babam, Resûlullah (Sallallahu Aleyhi ve Sellem)'i anınca anladım ki kendine halîfe bırakmayacak",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4714,
			"arabicnumber": "1823.02",
			"text": "Bize İshâk b. İbrahim ile İbni Ebî Ömer, Muhammed b. Râfi' ve Abd b. Humeyd rivayet ettiler. Lâfızları birbirlerine yakındır. (İshak ile Abd' ahberanâ tâbirini kullandılar. Ötekiler: Bize Abdürrazzâk rivayet etti, dediler.) (Demişki): Bize Ma'mer, Zührî'den naklen haber verdi. (Demişki): Bana Salim, İbni Ömer'den naklen haber verdi. (Şöyle demiş) : — Hafsa'nın yanına girdim de : — Biliyor musun baban halîfe bırakmıyor, dedi. — O bunu yapacak değildir, dedim. — Muhakkak yapar! Dedi. Bunun üzerine onunla bu hususta konuşmaya yemîn ettim; ve sustum. Hattâ sabahleyin eve gittim; ama onunla konuşmadım. Sağ elimle bir dağ taşıyor gibi idim. Nihayet dönerek yanına girdim. Bana insanların hâlini sordu. Ben de kendisine haber verdim. Sonra ona: — Ben halkın bir söz söylediklerini işittim de onu sana söylemeye yemîn ettim! Diyorlar ki, sen kendine halîfe bırakmayacakmışsın. Gerçekten senin bir deve çobanın veya koyun çobanın olsa da onları bırakarak sana gelse, çobanın kaybetiğine kail olurdun. İnsanlara riâyet ise daha Çetindir. Dedim. Benim sözüm ona muvafık geldi. Ve bir müddet başını indirdi. Sonra onu bana kaldırarak şunları söyledi: — Muhakkak Allah (Azze ve Celle) dînini koruyacaktır. Ben kendime halîfe bırakmamış olsam, Resûlullah (Sallallahu Aleyhi ve Sellem) de halîfe bırakmamıştır. Halîfe bırakmış olsam, Ebû Bekir halîfe bırakmıştır, İbni Ömer demiş ki: — Vallahi, babam, Resûlullah (Sallallahu Aleyhi ve Sellem)'Ie Ebû Bekr'i anmaktan başka bir şey yapmadı. Ve anladım ki, Resûlullah (Sallallahu Aleyhi ve Sellem) bir kimse ile değişecek değil ve kendine halîfe bırakacak değildir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4715,
			"arabicnumber": "1652.03",
			"text": "Bize Şeybân b. Ferrûh rivayet etti. (Dediki): Bize Cerîr b. Hâzim rivayet etti. (Dediki): Bize Hasen rivayet etti. (Dediki): Bize Abdurrahmân b. Semûra rivayet etti. (Dediki): Bana Resûlullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdular: «Ya Abdurrahman! Emirliği isteme! Çünkü isteyerek sana verilirse onunla baş başa bırakılırsın! İstemeden sana verilirse onun uğrunda yardım görürsün.»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4716,
			"arabicnumber": "1652.04",
			"text": "{…} Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Hâlid b. Abdillâh Yûnus'dan rivayet etti. H. Bana Alî b. Hucr Es-Sadî dahî rivayet etti. (Dediki): Bize Hüseyin Yûnus'la Mansûr'dan ve Humeyd'den rivayet etti. H. Bize Ebû Kâmil El-Cahderî de rivayet etti. (Dediki): Bize Hammâd b. Zeyd, Simâk b. Atiyye ile Yûnus b. Ubeyd'den ve Hişâm b. Hassandan naklen rivayet eyledi. Bu râvilerin hepsi Hasen'den, o da Abdurrahmân b. Semura'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen Cerîr'in hadîsi gibi rivayette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4717,
			"arabicnumber": "1733.03",
			"text": "Bize Ebû Bekir b. Ebi Şeybe ile Muhammed b. El-Alâ' rivayet ettiler. (Dedilerki): Bize Ebû Usâme, Büreyd b. Abdillâh'dan, o da Ebû Bürde'den, o da Ebû Musa'dan naklen rivayet etti. (Şöyle demiş) : Ben ve amcam oğullarından iki zât. Nebi (Sallallahu Aleyhi ve Sellem)'in yanına girdik. O iki zâtın biri: — Yâ Resûlâllah! Bizi Allah (Azze ve Celle)'nin seni hâkim kıldığı yerlerden bazısına hâkim yap! Dedi. Öteki de bunun gibi bir şey söyledi. Bunun üzerine Efendimiz: «Vallahi biz bu işe ne onu isteyen bîrini tayîn ederiz; ne de ona hırs gösteren birini!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4718,
			"arabicnumber": "1733.04",
			"text": "Bize Ubeydullah b. Saîd ile Muhaınmed b. Hatim rivayet ettiler. Lâfız İbni Hâtim'indir. (Dedilerki): Bize Yahya b. Saîd El-Kattân rivayet etti. (Dediki): Bize Kurre b. Hâlid rivayet etti. (Dediki): Bize Humeyd b. Hilâl rivayet etti. (Dediki): Bana Ebû Bürde rivayet etti. (Dediki): Ebû Mûsâ şunu söyledi: — Yanımda Eş'arîlerden iki zât olduğu halde Nebi (Sallallahu Aleyhi ve Sellem)'e geldim. Biri sağımda diğeri solumda idi. Bunların ikisi de vazife istediler. Nebi (Sallallahu Aleyhi ve Sellem) misvaklanıyordu. Bunun üzerine : «Ne diyorsun yâ Ebâ Mûsâ?» yûhut «Yâ Abdallah b. Kays!» dedi. Ben de : — Seni hak (dîn) ile gönderen Allah'a yemîn ederim ki, bunlar kalplerinde olanı bana söylemediler. Ben bunların vazife isteyeceklerini bilemedim, dedim. Ama dudağının altında misvakînin yükseldiğini (hâlâ) görür gibiyim. Ya «Ien» edatı ile yahut «lâ» ile (konuşarak) : «Biz işimize, isteyeni tâyin etmeyiz! Lâkin sen git yâ Ebâ Mûsâ!» yahut «Yâ Abdallah b. Kays!» dedi. Ve onu Yemen'e gönderdi. Sonra onun peşinden Muâz b. Cebel'i yolladı. Muâz onun yanına varınca : — (Ebû Mûsâ ona) Buyur etti; ve ona bir yastık serdi. Bir de baktı ki, Ebû Musa'nın yanında bağlı bir adam var! — Bu kim? diye sordu. Ebû Mûsâ: — Bu bir yahudi idi; müslüman oldu. Sonra tekrar kendi dînine, kötülük dînine döndü ve yahudî oldu, dedi. Muâz: — Bu adam öldürülünceye kadar oturmam! Allah'ın ve Resulünün hükmü budur, dedi. Ebû Mûsâ : — Otur! Evet! Dedi. Muâz : — O öldürülünceye kadar oturmam! Allah'ın ve Resulünün hükmü budur! Dedi. Bu üç defa tekerrür etti. Nihayet onun öldürülmesini emretti; ve öldürüldü. Sonra (Muâz'la Ebû Mûsâ) geceleyin namaz kılmayı müzâkere ettiler, de biri (yâni Muâz) : — Bana gelince: Ben hem uyurum hem namaza kalkarım. Uykum esnasında da namazımda umduğumu umarım! Dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4719,
			"arabicnumber": "1825",
			"text": "Bize Abdülmelik b. Şuayb b. Leys rivayet etti. (Dediki): Bana babam Şuayb b. Leys rivayet etti. (Dediki): Bana Leys b. Sa'd rivayet etti. (Dediki): Bana Yezîd b. Ebî Habîb, Bekir b. Amr'dan, o da Haris b. Yezîd El-Hadrami'den, o da İbni Huceyrate'l-Ekber'den, o da Ebû Zerr'den naklen rivayet etti. Ehû Zerr şöyle demiş ; — Ya Resûlâllah! Beni vâlî yapmıyor musun? Dedim. Bunun üzerine eli ile omuzuma vurdu. Sonra : «Yâ Ebâ Zerr! Sen zayıfsın. Bu vâiîlik bir emânettir. Gerçekten kıyâmet gününde o kepazelik ve pişmanlıktır. Yalnız onu hakkı ile alarak o hususta üzerine düşeni yapan müstesna!» buyurdular. İzah 1826 da",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4720,
			"arabicnumber": "1826",
			"text": "Bize Züheyr b. Harb ile İshâk b. İbrahim, ikisi birden El-Mukrî'den rivayet ettiler. Züheyr (Dediki): Bize Abdullah b. Yezîd rivayet etti. (Dediki): Bize Saîd b. Ebî Eyyûb, Ubeydullah b. Ebî Ca'fer El-Kuraşî'den, o da Salim b. Ebî Salim El-Ceyşânî'den, o da babasından, o da Ebû Zerr'den naklen rivayet ettiki, ResûluIIah (Sallallahu Aleyhi ve Sellem): «Yâ Ebâ Zerr! Gerçekten ben seni zayıf görüyorum. Ben senin için kendime sevdiğim şeyi severim. Sakın iki kişî üzerine hâkim olma! Ve sakın yetîm malına velî olma!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4721,
			"arabicnumber": "1827",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb ve İbnü Numeyr rivayet ettiler. (Dedilerki): Bize Süfyân b. Uyeyne, Amr'dan (yâni İbni Dinar'dan), o da Amr b. Evs'den, o da Abdullah b. Amr'dan naklen rivayet etti. İbnü Numeyr ile Ebû Bekir: (Onu Nebi (Sallallahu Aleyhi ve Sellem)'e ref ederek) dediler. Züheyr'in hadîsinde ise şu ibare vardır: (Demişki): Resûlullah (Sallallahu Aleyhi ve Sellem): «Şüphesiz ki, adaletle iş görenler, Allah katında nurdan minberler üzerinde Rahman (Azze ve Celle)'nin yemininde olacaklardır. Onun her iki yed'i sağdır. Bunlar, hükümlerinde ve aileleri ile mütevellisi oldukları kimseler hakkında adalet gösterenlerdir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4722,
			"arabicnumber": "1828.01",
			"text": "Bana Hârûn b. Saîd El-Eylî rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Harmele, Abdurrahmân b. Şümâse'den rivayet etti. (Şöyle demiş) : Âişe'ye bir şey sormaya geldim. — Sen kimlerdensin? Diye sordu. Ben de: — Mısırlılardan bir adamım! Dedim. Müteakiben Âişe: — Bu gazanızda sizinkinin size karşı muamelesi nasıldı? Diye sormuş. O da: — Kendisinden bir fenalık görmedik. Bizden birimizin devesi ölse hemen ona deve verir; kölesi ölse köle verir; yiyeceğe muhtâc olsa yiyecek verirdi. Demiş. Bunun üzerine Âişe şunu söylemiş: — Beri bak! Resûlullah (Sallallahu Aleyhi ve Sellem)'den işittiğim bir şeyi sana haber vermekten, onun kardeşim Muhammed b. Ebî Bekr'e yaptıkları beni men'edemez! Şu evimde: «Allahım! Bir kimse ümmetimin umurundan bir vazîfe alır da onlara zorluk gösterirse sen de ona zorluk göster! Bir kimse ümmetimin umurundan bir vazife alır da onlara hoş muamele ederse, sen de ona hoş muamele eyle!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4723,
			"arabicnumber": "1828.02",
			"text": "{…} Bana Muhammed b. Hatim de rivayet etti. (Dediki): Bize İbni Mehdî rivayet etti. (Dediki): Bize Cerîr b. Hâzim, Harmeletü'l-Mısrî'den, o da Abdurrahmân b. Şümâse'den, o da Âişe'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsin mislini rivayet etti",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4724,
			"arabicnumber": "1829.01",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Leys rivayet etti. H, Bize Muhammed b. Rumh da rivayet etti. (Dediki): Bize Leys, Nâfi'den, o da İbni Ömer'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet ettiki, şöyle buyurmuşlar: «Hepiniz çobansınız; ve hepiniz sürüsünden mes'üldür. İnsanlara hükmeden emîr bir çobandır; o sürüsünden mes'üldür. Kişi ailesi fertlerine çobandır. O da onlardan mes'üldür. Kadın kocasının evine ve çocuklarına çobandır; o da onlardan mes'üldür. Köle, sahibinin malına çobandır; o da ondan mes'üldür. Dikkat!.. İmdi hepiniz çobansınız; ve hepiniz sürüsünden mes'üldür.»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4727,
			"arabicnumber": "1829.04",
			"text": "{…} Bize Yahya b. Yahya ile Yahya b. Eyyûb, Kuteybe b. Saîd ve İbnü Hucr, hep birden İsmail b. Ca'fer'den, o da Abdullah b. Dinar'dan, o da İbni Ömer'den naklen rivayet ettiler. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem) buyurdular ki... H. Bana Harmeletü'bnü Yahya da rivayet etti. (Dediki): Bize îbni Vehb haber verdi. (Dediki): Bana Yûnus, İbni Şihâb'dan, o da Salim b. Abdillâh'dan, o da babasından naklen haber verdi. Babası şöyle demiş: Ben ResûluIIah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken işittim... Râvi hadisi, Nâfi'in İbni Ömer'den rivayet ettiği hadîs mânâsında rivayet etmiştir. Zühli'nin hadîsinde: Zannederim : «Kişi babasının malında çobandır; ve sürüsünden mes'üldür.» buyurdu; dedi, ibaresini ziyade etmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4728,
			"arabicnumber": "1829.05",
			"text": "{…} Bana Ahmed b. Abdirrahman b. Vehb de rivayet etti. (Dediki): Bana amcam Abdullah b. Vehb haber verdi. (Dediki): Bana bir adam (adını söyledi) ve Amr b. Haris, Bükeyr'den, o da Büsr b. Saîd'den naklen haber verdiler; ona da Abdullah b. Ömer, Nebi (Sallallahu Aleyhi ve Sellem)'den bu mânâ ile rivayet etmiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4729,
			"arabicnumber": "142.05",
			"text": "Bize Şeybân b. Ferrûh rivayet etti. (Dediki): Bize Ebû'l-Eşheb, Hasen'den rivayet etti. (Demişki): Ubeydullah b. Ziyâd, Ma'kıl b. Yesâr El-Müzenî'yi ölüm döşeğinde iken dolaştı da Ma'kıl şunu söyledi: Ben sana Resûlullah (Sallallahu Aleyhi ve Sellem)'den işittiğim bir hadîsi söyleyeceğim. Benim için (daha) hayât olduğunu bilsem (onu) sana söylemezdim. Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i: «Allah'ın bîr sürüye çoban yaptığı hiç bîr kul yoktur ki, öldüğü gün sürüsüne hıyanet etmiş olarak ölsün de Allah ona cenneti haram kılmasın!» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4730,
			"arabicnumber": "142.06",
			"text": "{…} Bize bu hadîsi Yahya b. Yahya da rivayet etti. (Dediki): Bize Yezîd b. Zürey', Yûnus'dan, o da Hasan'dan naklen haber verdi. Şöyle demiş: Ma'kıl b. Yesâr hasta iken İbni Ziyâd onun yanına girdi... Râvi, Ebû'l-Eşbeb'in hadîsi gibi rivayette bulunmuş; şunu da ziyâde eylemiştir: «Bunu bana bu günden evvel söylemeli değil mi idin? Dedi. — Sana söylemedim (işte) yahut) : Sana söyleyecek değildim! cevâbını verdi.»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4731,
			"arabicnumber": "142.07",
			"text": "Bize Ebû Gassân El-Mismai ile İshâk b. İbrâhîm ve Muhammed b. El-Müsennâ da rivayet ettiler. (İshâk: Bize haber verdi, tâbirini kullandı. Ötekiler: Bize Muâz b. Hişâm rivayet etti; dediler.) (Demiş ki): Bana babam, Katâde'den, o da Ebû'l-Melîh'den naklen rivayet ettiki, hastalığında Ma'kıl b. Yesâr'ın yanına Ubeydullah b. Ziyâd girmiş. Ma'kıl ona: — Ben sana bîr hadis söyliyeceğim! ölüm hâlinde olmasam onu sana söylemezdim. Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i: «Eğer bir âmir müslümanların işini üzerine alır; sonra onlar için çalışıp samimiyet göstermezse onlarla birlikte cennete giremez!» buyururken işittim, demiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4732,
			"arabicnumber": "142.08",
			"text": "{…} Bize Ukbe b. Mükrem El-Ammî de rivayet etti. (Dediki): Bize Yâkûb b. İshâk rivayet etti. (Dediki): Bana Sevâde b. Ebî'l-Esved haber verdi. (Dediki): Bana babam rivayet etti, ki Ma'kıl b. Yesar hastalanmış da, Ubeydullah b. Ziyâd onu dolaşmaya gelmiş... Râvi, Hasen'in Ma'kıl'den rivayet ettiği hadîs gibi rivayette bulundu. İZah: Bu hadîsi Buhâri «Ahkâm» bahsinde tahrîc etmiştir. Hadîsin şerh ve îzâhi «îman» bahsinde geçmişti. Hulâsası şudur: Hı­yaneti helâl i'tikad eden kâfir olur; ve ebediyyen cennete giremez. Fa­kat helâl itikad etmezse dînden çıkmaz; ancak cennete ilk giren bahtiyar­larla beraber olamaz. Bu gecikme ona bir cezadır. Cezası ya cehennemde yanmakla, ya hesab anında yahut başka yerde verilir. Hz. Ma'kil'in: «Benim için (daha) hayât olduğunu bilsem (onu) sana söylemezdim» sözü o ana kadar bu hadîsi söylemekten çekindiğini gösteriyor. Buna sebep kendisine bir fenalık yapılacağından korkması olabilir. Öleceğini anlayınca bildiği bir şeyi müslümanlardan gizlemiş olmamak için söylemiştir. Çünkü ilmin başkalarına teblîği emrolunmuştur",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4733,
			"arabicnumber": "1830",
			"text": "Bize Şeybân b. Ferrûh rivayet etti. (Dediki): Bize Cerîr b. Hâzim rivayet etti. (Dediki): Bize Hasan rivayet ettiki: Âiz b. Amr Resûlullah (Sallallahu Aleyhi ve Sellem)'in ashâbındandı— Ubeydullah b. Ziyâd'ın yanına girerek şunları söylemiş: — Ey oğulcuğum! Ben Resûlullâh (Sallallahu Aleyhi ve Sellem)'i: «Şüphesiz çobanların en kötüsü insafsız deve bakıcılarıdır. Sakın onlardan olma!» buyururken işittim. Bunun üzerine (Ubeydullah) ona: — Otur! Sen ancak Muhammed (Sallallahu Aleyhi ve Sellem) ashabının kepeğindensin! Demiş. O da: — Onların kepeği varmı idi ki? Kepek ancak onlardan sonra hem de onlardan başkalarında oldu! cevabını vermiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4734,
			"arabicnumber": "1831.01",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Ismâîl b. İbrahim, Ebû Hayyân'dan, o da Ebû Zür'a'dan, o da Ebû Hureyre'den naklen rivayet etti. (Şöyle demiş) : Bir gün Resûlullah (Sallallahu Aleyhi ve Sellem) aramızda ayağa kalkarak hıyaneti andı. Onu büyüttü; onun hâlini de büyüttü. Sonra şöyle buyurdu: «Sakın sizden birinizi kıyamet günü, boynunda böğürmesi olan bir deve olduğu halde gelerek: Yâ Resûlâllaht Beni kurtar! Derken, kendimi de: Senin için bir şeye mâlik değilim; ben sana tebliğ ettim; diye cevap verirken bulmayayım! Sakın sizden birinizi kıyamet günü boynunda kişneyişi olan bîr at olduğu halde gelerek: Yâ Resûlâllah! Beni kurtar' Derken, kendimi de: Senin için hiç bîr şeye mâlik değilim; ben sana tebliğ ettim; diye cevap verirken bulmayayım! Sakın sizden birinizi kıyamet günü boynunda meleyişi olan bir koyun olduğu halde gelerek: Yâ Resûlâllah! Beni kurtar! Derken, kendimi de: Senin için hiç bir şeye mâlik değilim; ben sana tebliğ ettim; diye cevap verirken bulmayayım! Sakın sizden birinizi kıyamet günü boynunda çığlığı olan bir kimse olduğu hâlde gelerek: Yâ Resûlâllah: Beni kurtar! Derken, kendimi de: Senin için hiç bir şeye mâlik değilim; ben sana tebliğ ettim! diye cevap verirken bulmayayım! Sakın sizden birinizi kıyamet günü, boynunda dalgalanan giysiler olduğu halde gelerek: Yâ Resûlâllah! Beni kurtar! Derken, kendimi de: Senin için hiç bir şeye mâlik değilim; ben sana tebliğ ettim! Diye cevap verirken bulmayayım! Sakın sizden birinizi kıyamet günü, boynunda altın gümüş olduğu halde gelerek: Yâ Resûlâllah! Benİ kurtar! Derken, kendimi de: Senin için hiç bir şeye mâlik değilim; ben sana tebliğ ettim. Diye cevap verirken bulmayayım!»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4735,
			"arabicnumber": "1831.02",
			"text": "{…} Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Abdürrahîm b. Süleyman, Ebû Hayyân'dan rivayet etti. H. Bana Züheyr b. Harb dahî rivayet etti. (Dediki): Bize Cerîr, Ebû Hayyan ile Umara b. Ka'kaa'dan, bunların hepsi Ebû Zür'a'dan, o da Ebû Hureyre'den naklen İsmail'in Ebû Hayyân'dan rivayet ettiği hadîs gibi rivayette bulundu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4736,
			"arabicnumber": "1831.03",
			"text": "Bana Ahmed b. Saîd b. Sahr Ed-Dârimî de rivayet ettiJ, (Dediki): Bize Süleyman b. Harb rivayet etti, (Dediki): Bize Hammâd (yâni İbni Zeyd) Eyyûb'dan, o da Yahya b. Saîd'den, o da Ebû Zür'a b, Amr b. Cerîr'den, o da Ebû Hureyre'den naklen rivayet etti. (Şöyle demiş) : Resûlullah (Sallallahu Aleyhi ve Sellem) hıyaneti anarak onu büyüttü. Ve râvi hadîsi kıssa eylemiştir. Hammâd: «Bilâhare Yahya'yı bu hadîsi rivayet ederken işittim. Bize Eyyub'un kendisinden rivayet ettiği gibi rivayette bulundu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4737,
			"arabicnumber": "1831.04",
			"text": "{…} Bana Ahmed b. Hasan b. Hırâş da rivayet etti. (Dediki): Bize Ebû Ma'mer rivayet etti. (Dediki): Bize Abdülvâris rivayet etti. (Dediki): Bize Eyyûb, Yahya b. Saîd b. Hayyân'dan, o da Ebû Zür'a'dan, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen yukarıkilerin hadîsi gibi rivayette bulundu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4738,
			"arabicnumber": "1832.01",
			"text": "Bize Ebü Bekir b. Ebi Şeybe ile Amru'n-Nâkıd ve İbnü Ebî Ömer rivayet ettiler. Lâfız Ebû Bekir'indir. (Dedilerki): Bize Süfyân b. Uyeyne, Zührî'den, o da Urve'den, o da Ebû Humeyd Es-Saidî'den naklen rivayet etti. (Şöyle demiş) : Resûlullah (Sallallahu Aleyhi ve Sellem) Esd (kabilesin)'den İbnü'l-Lutbiyye denilen bir adamı me'mur yaptı. (Amır'la İbnü Ebî Ömer: Sadaka üzerine me'mur dediler.) (Bu zât vazifeden) geldiği zaman: — Bu sizin; bu da benim; bana hediyye edildi, dedi. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) minber üzerinde ayağa kalkarak Allah'a hamdü sena etti. Ve şunları söyledi : «Benim gönderdiğim bir me'mûra ne oluyor ki: Bu sizin; bu da bana hediyye edildi; diyor! Babasının yahut anasının evinde otursa da kendisine hediyye edilecek mi, edilmiyecek mi baksa idi ya! Muhammed'in nefsi yed-i kudretinde olan Allah'a yemin ederim ki, sizden biriniz o sadakadan bir şey ele geçirirse kıyamet gününde onu boynunda taşıyarak getirecektir. Böğürmesi olan bir deve, yahut öğürmesi olan bîr inek veya meleyen bir koyun!.. Sonra ellerini kaldırdı. Hattâ koltuklarının beyazını gördük. Sonra iki defa: «Allahım! Tebliğ ettim mi?» buyurdu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4739,
			"arabicnumber": "1832.02",
			"text": "{…} Bize İshâk b. İbrahim ile Abd b. Humeyd rivayet ettiler. (Dedilerki): Bize Abdürrazzâk haber verdi. (Dediki): Bize Ma'mer, Zühri'den, o da Urve'den, o da Ebû Humeyd Es-Sâıdî'den naklen rivayet etti. (Şöyle demiş) : Nebi (Sallallahu Aleyhi ve Sellem) Ezd (kabilesin)'den bir adam olan İbnü'l-Lutbiyye'yi sadaka üzerine me'mur tâyin etti. Sonra İbnü'l-Lutbiyye (zekât) malı (nı) getirerek Nebi (Sallallahu Aleyhi ve Sellem)'e verdi. Ve: — Bu sizin malınız; şu da bana verilen bir hediyyedir, dedi. Peygamber (Sallallahu Aleyhi ve Sellem) de ona: «Babanın ve ananın evinde otursan da sana hediyye edilecekmi, edilmiyecek mi baksa idin yâ!» buyurdular. Sonra Nebi (Sallallahu Aleyhi ve Sellem) hutbe okumak için ayağa kalktı... Bundan sonra râvi, Süfyan'ın hadisi gibi rivayette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4740,
			"arabicnumber": "1832.03",
			"text": "Bize Ebû Kureyb Muhammed b. Ala' rivayet etti. (Dediki): Bize Ebû Usâme rivayet etti. (Dediki): Bize Hişâm, babasından, o da Ebû Humeyd Es-Sâîdî'den naklen rivayet etti. (Şöyle demiş) : Resûlullah (Sallallahu Aleyhi ve Sellem) Ezd (kabilesin)'den İbnü'I-Lutbiyye denilen bir adamı Benî Süleym'in sadakalarına me'mur tâyin etti. Geldiği zaman onu hesaba çekti. Adam: — Şu sizin malınız; bu da hediyyedir, dedi. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Babanın ve ananın evinde otursaydın ya doğrucu isen hediyyen sana gelsin!» buyurdu. Sonra bize hutbe okudu. Ve Allah'a hamdü sena etti. Sonra şunları söyledi: «Bundan sonra (malûm ola ki)! Ben sizden bir adamı Allah'ın benim idareme verdiği yerlerden bir vazifeye ta'yîn ediyorum da, gelerek: Şu sizin malınız; bu da bana verilen bir hediyyedir; diyor. Babasının ve anasının evinde otursaydı ya doğrucu ise hediyyesi kendisine gelsin! Vallahi eğer sizden biriniz hakkı olmaksızın ondan bir şey alırsa kıyamet gününde Allah Teâlâ'ya, onu taşır hâlde kavuşur. Sizden birinizin böğüren bir deve yahut böğürmesi olan bir inek veya meleyen bîr koyun taşıyarak Allah'a kavuştuğunu ben mutlaka bileceğim!» Sonra ellerini kaldırdı. Hattâ koltuklarının beyazı göründü. Ve: «Allahım! Tebliğ etlim mî?» dedi. (Bunu) gözüm gördü; kulağım işitti",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4741,
			"arabicnumber": "1832.04",
			"text": "Bize Ebû Kureyb de rivayet etti. (Dediki): Bize Abde ile İbnü Numeyr ve Ebû Muâviye rivayet ettiler. H. Bize Ebû Bekir b. Ebî Şeybe dahî rivayet etti. (Dediki): Bize Abdürrahîm b. Süleyman rivayet etti. H. Bize İbni Ebî Ömer de rivayet etti. (Dediki): Bize Süfyân rivayet etti. Bunların hepsi Hişâm'dan bu isnâdla rivayette bulunmuşlardır. Abde ile İbnü Numeyr'in hadîslerinde Ebû Usâme'nin dediği gibi: «Geldiği zaman onu hesaba çekti.» cümlesi vardır. İbni Numeyr hadîsinde ise: «Vallahi iyi bilin! Nefsim yed-i kudretinde olan Allah'a yemîn ederim ki, sizden biriniz o sadakadan bir şey alırsa...» ibaresi vardır. Süfyan'ın hadîsinde: «Dediki: Gözüm gördü, kulağım işitti. Zeyd b. Sâbit'e de sorun! Çünkü benimle beraber orada idi.» ibaresini ziyade etmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4742,
			"arabicnumber": "1832.05",
			"text": "Bize bu hadîsi İshâk b. İbrahim de rivayet etti. (Dediki): Bize Cerîr, Şeybânî'den, o da Abdullah b. Zekvân'dan —ki bu zât Ebû'z-Zinâd'dır— o da Urve b. Zübeyr'den naklen haber verdi ki. Resûlullah (Sallallahu Aleyhi ve Sellem) sadaka üzerine bir adamı me'mûr tâyîn etmiş. O da birçok şeyler getirmiş. Ve: Şu sizin! Bu da bana hediyye edildi... demeye başlamış... Râvi yukarıki hadîs gibi rivayet etmiştir. Urve demiş ki: «Ebû Humeyd es-Sâidî'ye: Bunu Resûlullah (Sallallahu Aleyhi ve Sellem)'den mi işittin? diye sordum. — Ağzından kulağıma! Dedi.»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4743,
			"arabicnumber": "1833.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Veki' b. Cerrah rivayet etti. (Dediki): Bize İsmail b. Ebî Hâlid, Kays b. Ebî Hâzim'den, o da Adiy b. Amirate'l-Kindî'den naklen rivayet etti. (Demişki): Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken işittim: «Sîzden herhangi bir kimseyi biz me'mur ta'yîr» eder de bir iğneyi veya fazlasını bizden gizlerse bu hıyanet olur; kıyamet gününde onu getirir!» Bunun üzerine Ensâr'dan siyah bir zât kalkarak onun yanına gitti. Onu hâlâ görür gibiyim. Ve : — Yâ Resûlâllah! Vazifeni benden kabul eyle! Dedi. Efendimiz: «Sana ne oldu?» diye sordu. — Seni şöyle şöyle derken işittim! Dedi. Resûlullnh (Sallallahu Aleyhi ve Sellem); «Halbuki ben onu şimdi söylüyorum: Sizden kimi bir zekât işine memur tayin edersek onun azını çoğunu getirsin! Ondan kendisine ne verilirse alır; ne yasak edilirse vaz geçer!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4744,
			"arabicnumber": "1833.02",
			"text": "{…} Bu hadîsi bize Muhammed b. Abdillâh b. Numeyr de rivayet etti. (Dediki): Bize babamla Muhammed b. Bişr rivayet ettiler. H. Bana Muhammed b. Râfi' dahî rivayet etti. (Dediki): Bize Ebû Usâme rivayet etti. Bu râvilerin hepsi: Bize İsmail bu isnâdla bu hadîsin mislini rivayet etti; demişlerdir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4745,
			"arabicnumber": "1833.03",
			"text": "{…} Bu hadîsi bize İshâk b. İbrahim El-Hanzalî de rivayet etti. (Dediki): Bize Fadl b. Mûsâ haber verdi. (Dediki): Bize İsmâî! b. Ebî Hâlid rivayet etti. (Dediki): Bize Kays b. Ebî Hâzim haber verdi. (Dediki): Ben Adiy b. Amîrate'l-Kindî'yi şunu söylerken işittim: Ben Resûlullah'i şöyle buyururken işittim... Râvi, yukarıkilerin hadîsi gibi rivayette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4746,
			"arabicnumber": "1834",
			"text": "Bana Züheyr b. Harb ile Hârûn b. Abdillâh rivayet ettiler. (Dedilerki): Bize Haccâc b. Muhammed rivayet etti. (Dediki): İbnü Cüreyc şunu söyledi: (Ey îmân edenler! Allah'a itaat edin! Resulüne ve sizden olan emir sahiplerine de itaat edin!) [Nisa 59] âyeti Abdullah b. Huzâfe b. Kays b. Adiy Es-Sehmî hakkında inmiş. Nebi (Sallallahu Aleyhi ve Sellem) onu bir seriyyede göndermiş. Bana bunu Ya'lâ b. Müslim, Saîd b. Cübeyr'den, o da İbnî Abbâs'dan naklen haber verdi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4749,
			"arabicnumber": "1835.03",
			"text": "Bana Harmele b. Yahya dahî rivayet etti. (Dediki): Bize İbnü Vehb haber verdi. (Dediki): Bana Yûnus, kendisine haber veren İbni Şihâb'dan naklen haber verdi. (Demişki) : Bize Ebû Seleme b. Abdirrahmân, Ebû Hureyre'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti kî: «Kim bana İtaat ederse Allah'a itaat etmiş; her kim bana isyan ederse Allah'a isyan etmiş olur; ve kim benim emîrîme itaat ederse bana itaat etmiş; her kim benim emîrime İsyan ederse bana isyan etmiş olur!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4750,
			"arabicnumber": "1835.04",
			"text": "{…} Bana Muhammed b. Hatim de rivayet etti. (Dediki): Bize Mekkî b. İbrahim rivayet etti. (Dediki): Bize İbnü Cüreyc, Ziyâd'dan, o da İbni Şihâb'dan, naklen rivayet ettiki, ona da Ebû Seleme b. Abdirrahmân haber vermişki, kendisi Ebû Hureyre'yİ Resûlullah (Sallallahu Aleyhi ve Sellem) buyurdular... diyerek tamamiyle yukarıki hadisin mislini rivayet ederken dinlemiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4751,
			"arabicnumber": "1835.05",
			"text": "{…} Bana Ebû Kâmil El-Cahderî de rivayet etti. (Dediki): Bize Ebû Avâne, Yâ2lâ b. Atâ'dan, o da Ebû Alkame'den naklen rivayet etti. (Demişki): Bana Ebû Hureyre ağzından ağzıma rivayet etti. (Dediki): Resûlullah (Sallallahu Aleyhi ve Sellem)'den dinledim. H. Bana Ubeydullah b. Muâz dahî rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize Muhammed b. Beşşâr da rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. Her iki râvi demişler kî: Bize Şu'be, Ya'lâ b. Atâ'dan rivayet etti. O da Ebû Alkame'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den nakleden Ebû Hureyre'den yukarıkilerin hadîsi gibi dinlemiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4752,
			"arabicnumber": "1835.06",
			"text": "{…} Bize Muhammed b. Râfi' de rivayet etti. (Dediki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize Ma'mer, Hemmâm b. Münebhih'den, o da Ebû Hureyre'den, o da Peygamber (Sallallahu Aleyhi ve Sellem)'den naklen yukarıkilerirı hadîsi gibi rivayette bulundu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4753,
			"arabicnumber": "1835.07",
			"text": "Bana Ebû't-Tahir dahî rivayet etti. (Dediki): Bize İbni Vehb, Hayve'den, naklen haber verdi ki, ona da Ebû Hureyre'nin âzâdhsi Ebû Yûnus rivayet etmiş. (Demişki) : Ebû Hureyre'yi, Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen bunu rivayet ederken işittim. Ama: «Kim emîr'e itaat ederse» dedi. «Benim emîrime» demedi. Hemmâm'in Ebû Hureyre'den rivayet ettiği hadîsinde de böyledir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4754,
			"arabicnumber": "1836",
			"text": "Bize Saîd b. Mansûr ile Kuteybe b. Saîd ikisi birden Ya'kûb'dan rivayet ettiler. Saîd (Dediki): Bize Ya'kûb b. Abdirrahmân, Ebû Hâzim'den, o da Ebû Salih Es-Semmân'dan, o da Ebû Hureyre'den naklen rivayet eyledi. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem): «Darlığında, varlığında; neşatlı zamanında, kederli zamanında ve dünya işlerinin sana tercih edildiğinde dinleyip itaat etmelisin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4755,
			"arabicnumber": "1837.01",
			"text": "Bize Ebû Bekir b. Ebi Şeybe ile Abdullah b. Berrâd El-Eş'arî ve Ebû Kureyb rivayet ettiler. (Dedilerki): Bize İbni İdris, Şu'be'den, o da Ebû İmrân'dan, o da Abdullah b. Sâmit'den, o da Ebû Zerr'den naklen rivayet etti. (Şöyle demiş) : — Dostum bana dinleyip itaat etmemi vasiyyet etti. Velevki (âmir) kolları, bacakları kesilmiş bir köle olsun",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4756,
			"arabicnumber": "1837.02",
			"text": "{…} Bize Muhamnıed b. Bcşşâr da rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. H. Bize İshâk dahî rivayet etti. (Dediki): Bize Nadr b. Şumeyl haber verdi. Bu râvİter hep birden Şu'be'den, o da Ebû İmrân'dan bu isnâdla rivayette bulunmuşlar: Ve ikisi de hadîste: «Velev kolları, bacakları kesilmiş Habeşli bir köle olsun!» demişlerdir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4757,
			"arabicnumber": "1837.03",
			"text": "{…} Bize bu hadîsi Ubeydullah b. Muâz da rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, Ebû İmrân'dan bu isnâdla İbni İdrîs'in dediği gibi «Velev kolları, bacakları kesilmiş bir köle olsun!» şeklinde rivayet etti. İzah 1839 da",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4758,
			"arabicnumber": "1838.01",
			"text": "Bize Muhammed b. Müsennâ rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Yahya b. Husayn'dan rivayet etti. (Demişki): Nenemden rivayet ederken işittim. O da Nebi (Sallallahu Aleyhi ve Sellem)'i veda haccında hutbe okurken dinlemiş: «Üzerlerinize, sizi Allah'ın kitabı ile yöneten bîr köle bile vali tâyîn edilse onu dinleyin ve itaat edin!» buyuruyormuş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4759,
			"arabicnumber": "1838.02",
			"text": "{…} Bu hadîsi bize İbni Beşşâr da rivayet etti. (Dediki): Bize Muhammed b. Ca'fer ile Abdurrahmân b. Mehdî, Şu'be'den bu isnâdla rivayet ettiler. O «Habeşli bir köle olsa da!» demiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4760,
			"arabicnumber": "1838.03",
			"text": "{…} Bize Ebû Bekir b. Ebî Şeybe dahî rivayet etti. (Dediki): Bize Vekî' b. Cerrah, Şu'beden bu isnâdla rivayet etti. O: «Kolları, bacakları kesilmiş Habeşli bir köle bile olsa!» demiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4761,
			"arabicnumber": "1838.04",
			"text": "{…} Bize Abdurrahmân b. Bişr de rivayet etti. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Şu'be bu isnâdla rivayette bulundu. Ama «Kolları, bacakları kesilmiş Habeşli» ibaresini anmadı da, onun Resûluliah (Sallallahu Aleyhi ve Sellem)'i Mina'da veya Arafât'da dinlediğini ziyade etti",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4762,
			"arabicnumber": "1838.05",
			"text": "{…} Bana Seleme b. Şebîb de rivayet etti. (Dediki): Bize Hasen b. A'yen rivayet etti. (Dediki): Bize Ma'kıl, Zeyd b. Ebî Üneyse'den, o da Yahya b. Husayn'dan, o da nenesi Ümmü'l-Husayn'daıı naklen rivayet etti. (Demişki): Onu şunları söylerken işittim : Veda haccında Resûlullah (Sallallahu Aleyhi ve Sellem)'le beraber hacc ettim. Resûlullah (Sallallahu Aleyhi ve Sellem) çok sözler söyledi. Sonra onu: «Üzerinize, sizi Allah'ın kitabı ile yönetecek kolları bacakları kesilmiş —zannederim siyah dedi— bir köle vâlî tâyin edilse, onu dinleyin ve itaat buyururken işittim. İzah 1839 da",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4763,
			"arabicnumber": "1839.01",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Leys, Ubeydullah'dan, o da Nâfi'den, o da İbni Ömer'den, o da Nebi (Sailallahu Aleyhi ve Sellem)'den naklen rivayet etti ki: «Müslüman bir kimseye sevdiği, sevmediği (her) hususta (âmirini) dinleyip itaat etmek gerekir. Meğer ki, kendisine ma'sİyet emredile! Eğer ma'siyet emredilirse ne dinlemek vardır, ne de itaat!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4764,
			"arabicnumber": "1839.02",
			"text": "{…} Bu hadisi bize Ziiheyr b. Harb ile Muhammed b. Müsennâ da rivayet ettiler. (Dedilerki): Bize Yahya —ki El-Kattân'dır— rivayet etti. H. Bize İbnü Numeyr dahî rivayet etti. (Dediki): Bize babam rivayet dtı. Her iki râvi Ubeydullah'dan bu isnadla bu hadîsin mislini rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4765,
			"arabicnumber": "1840.01",
			"text": "Bize Muhammed b. Müsennâ ile İbni Beşşâr rivayet ettiler. Lâfız İbni Müsennâ'nındır. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Zübeyd'den, o da Sa'd b. Ubeyde'den, o da Ebû Abdirrahmân'dan, o da Alî'den naklen rivayet etti ki, Resûlullah (Sallallahu Aleyhi ve Sellem) bîr ordu göndermiş ve üzerlerine bir zâtı kumandan tâyin etmiş. Bunlar bir ateş yakmışlar. Kumandan : — Bu ateşe girin! Demiş. Bunun üzerine bir takım kimseler ateşe girmek istemiş; diğerleri: — Biz bundan kaçtık! Demişler. Bu iş Resûlullah (Sallallahu Aleyhi ve Sellem)'e söylenince, ateşe girmek isteyenlere: «Ona girseydiniz kıyamet gününe kadar onun içinde kalırdınız!» buyurmuş, ötekilere de güzel sözler söylemiş. Ve : «Allah'a isyan hususunda itaat yoktur. İtaat ancak meşru' (olan bir şey hususun) dadır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4766,
			"arabicnumber": "1840.02",
			"text": "Bize Muhammed b. Abdillâh b. Numeyr ile Züheyr b. Harb ve Ebû Saîd El-Eşecc de rivayet ettiler. Lâfızda birbirlerine yakındırlar. (Dedilerki): Bize Vekî' rivayet etti. (Dediki): Bize A'meş, Sa'd b. Ubeyde'den, o da Ebû Abdirrahmân'dan, o da Alî'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) bir seriyye gönderdi. Üzerlerine de Ensâr'dan bir zâtı kumandan tâyîn etti. Ve onlara bu zâtı dinleyip kendisine itaat etmelerini emir buyurdu. Derken bu zâtı kızdırdılar. O da : — Bana odun toplayın! Dedi. Hemen topladılar. Sonra : — Bir ateş yakın! Dedi. Yaktılar. Sonra: — Size Resûlullah (Sallallahu Aleyhi ve Sellem) beni dinleyip itaat etmenizi emir buyurmadı mı? Dedi. — Evet, buyurdu! cevâbını verdiler, — Öyle ise bu ateşe girin! Dedi. Bunun üzerine askerler birbirlerine bakıştılar. Ve: — Biz Resûlullah (Sallallahu Aleyhi ve Sellem)'e ancak ateşten kaçtık! Dediler. Hakîkaten öyle yapmışlardı. Kumandanın öfkesi de yatıştı; ve ateş söndürüldü. Döndükleri vakit buıu Nebi (Sallallahu Aleyhi ve Sellem)'e söylediler de: «Ona girseler {bir daha) çıkamazlardı. Tâat ancak meşru' (olan bir şey) hususundadır!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4767,
			"arabicnumber": "1840.03",
			"text": "{…} Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Vekî' ile Ebû Muâviye, A'meş'den bu isnâdla bu hadîsin benzerini rivayet etti",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4768,
			"arabicnumber": "1709.05",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet elti. (Dediki): Abdullah b. İdrîs, Yahya b. Saîd ile Ubeydulluh b. Ömer'den, onlar da Ubâde b. Velîd b. Ubâde'den. o da babasından, o da dedesinden naklen rivayet etti. Şöyle demiş : Biz Resûlullalı (Sallallahu Aleyhi ve Sellem)'e darlıkta, varlıkta, neşatlı ve kederli zamanlarımızda, bize tercih yapıldığında dinleyip itaat etmeye, emirlik hususunda ehil olanla kavga etmemeye ve nerede olsak hakkı söyleyeceğimize, Allah hakkında hiç bir kınayıcının zemminden korkmayacağımıza bey'at ettik",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4769,
			"arabicnumber": "1709.06",
			"text": "{…} Bu hadîsi bize İbni Numeyr de rivayet etti. (Dediki): Bize Abdullah (yâni İbni İdrîs) rivayet etti. (Dediki): Bize İbni Aclân ile Ubeydullah b. Ömer ve Yahya b. Saîd, Ubâde b. Velîd'den bu isnâdda hu hadîsin mislini rivayet ettiler",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4770,
			"arabicnumber": "1709.07",
			"text": "{…} Bize İbııü Ebî Ömer de rivayet etti. (Dediki): Bize Abdülâzîz (yâni Derâverdî) Yezîd'den —ki İbnül'-Hâd'dır—, o da Ubâde b. Velîd b. Ubâde b. Sâmit'den, o da babasından naklen rivayet etti. (Demişki): Bana babam rivayet etti. (Dediki): Resûlullah (Sallallahu Aleyhi ve Sellem)*e bey'at ettik... Râvi, İbni İdrîs'in hadîsi gibi rivayette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4771,
			"arabicnumber": "1709.08",
			"text": "Bize Ahmed b. Abdirrahmân b. Vehb b. Müslim rivayet etti, (Dediki): Bize Amcam Abdullah b. Vehb rivayet etti. (Dediki): Bize Amr b. Haris rivayet etti. (Dediki): Bana Bükeyr, Büsr b. Saîd'den, o da Cünâdeb. Ebi Ümeyye'den naklen rivayet etti. Şöyle demiş : Ubâde b. Samit hasta iken yanına girdik. Ve: Allah iyiliğini versin! Bize Resûlullah (Sallallahu Aleyhi ve Sellem)'den işittiğin bir hadîs rivayet etki, Allah onunla fayda versin! Dedik. Bunun üzerine şunu söyledi: — Resûlullah (Sallallahu Aleyhi ve Sellem) bizi davet etti. Biz de kendisine bey'at ettik. Bizden aldığı sözler arasında: Neşatlı zamanımızda, kederli zamanımızda, darlığımızda, varlığımızda, üzerimize tercih yapıldığında dinleyip itaat etmeye ve emirlik hususunda ehil olanla kavga etmeyeceğimize dâir aldığı bey'at da vardı. Ubâde : — Ancak hakkında elinizde Allah'tan bir hüccet bulunan aşikâr bir küfür görürseniz o başka!» dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4772,
			"arabicnumber": "1841",
			"text": "Bize îbrâhîm Müslim'den rivayet etti. (Demişki): Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Şebâbe rivayet etti. (Dediki): Bana Verkaa Ebu'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. «Kumandan ancak bir kalkandır. Arkasında harb edîlir; ve onunla korunulur. Eğer Allah azze ve celle'den korunmayı emreder ve adalet gösterirse bununla kendisine ecîr verilir; bundan başka bir şey emrederse ondan gelen aleyhine olur.» buyurmuşlar. Bu hadisi İbrahim b. Süfyân, Müslim'den işitmemiş; onun kendisinden icazet yolu ile rivayet etmiştir, «an Müslim» demesi bundandır. Mukaddimede bu hususta söz geçmişti. Kumandanın kalkan gibi olması düşmana karşı durup müslümanları kırdırmadığı ve İnsanlar onun satvetinden korkarak kendisinden çekindikleri ciheti iledir. Arkasında harb edilmekten murâd : Onunla beraber olup düşmanla harb etmektir. İzah 1842 de",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4773,
			"arabicnumber": "1842.01",
			"text": "Bize Muhammed b, Beşşâr rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Furât EI-Kazzâz'dan, o da Ebû Hâzim'den naklen rivayet etti. (Demişki): Ebû Hureyre ile beş sene düşüp kalktım. Ve onu Nebi (Sallallahu Aleyhi ve Sellem)'den hadîs rivayet ederken dinledim. Şöyle buyurmuşlar : «Beni İsrail'i Nebiler İdare ederdi. Bir Nebi vefat ettimi yerine (başka) bîr Nebi geçerdi. Şu muhakkaktır ki, benden sonra Nebi yoktur. Ama halîfeler gelecek hem de çok olacaklardır. Ashab: — O halde bize ne emredersin? demişler. «Birinciye ve ondan sonra gelene (sıra ile) yaptığınız bey'atı tutun! Onlara haklarını verin! Çünkü Allah raiyye yaptığı kimselerden dolayı onlara suâl soracaktır!» buyurmuş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4774,
			"arabicnumber": "1842.02",
			"text": "{…} Bize Ebû Bekir b. Ebî Şeybe ile Abdullah b. Berrâd El-Eş'ârî rivayet ettiler. (Dedilerki): Bize Abdullah b. İdrîs, Hasen b. Furât'dan, o da babasından bu hadîsin mislini rivayet etti",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4775,
			"arabicnumber": "1843",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Ebu'I-Ahvas ile Vekî' rivayet ettiler. H. Bana Ebû Saîd El-Eşecc de rivayet etti. (Dediki): Bize Vekî' rivayet etti. H. Bize Ebû Kureyb ile İbni Numeyr dahî rivayet ettiler. (Dedilerki). Bize Ebû Muâviye rivayet etti. H. Bize İshak b. İbrahim ile Aliy b. Haşrem de rivayet ettiler. (Dedilerki): Bize Cerîr, A'meş'den, o da Zeyd b. Vehb'den, o da Abdullah'dan naklen rivayet etti. Şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Mesele şu ki: benden sonra kayırma ve kabul edemeyeceğiniz işler olacaktır.» buyurdu. Ashâb : «— Yâ Resulâllah! Bizden buna yetişene ne emredersin? Dediler : «Borcunuz olan hakkı edâ edersiniz; lehinize olanı da Allah'dan istersiniz.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4776,
			"arabicnumber": "1844.01",
			"text": "Bize Züheyr b. Harb ile İshâk b. ibrahîm rivayet ettiler. (İshâk: Bize haber verdi tâbirini kullandı.) Züheyr: Bize Cerîr, A'meş'den, o da Zeyd b. Vehb'den, o da Abdurıahmân b. Abdi Rabbil-kâbe'den naklen rivayet etti dedi. Abdurrahnıân şöyle demiş: Mescide girdim. Bir de baktım Abdullah b. Amr b. As Kâbe'nin gölgesinde oturuyor! İnsanlar başına toplanmışlar: Ben de yanlarına gelerek onu dinlemeye oturdum. Şunları söyledi : — Bir seferde Resûlullah (Sallallahu Aleyhi ve Sellem) ile beraberdik. Bir menzile indik. Kimimiz çadırını düzeltiyor; Kimimiz ok atma yarışı yapıyor; bâzılarımız da mer'adaki hayvanlarının başında bulunuyordu. Derken Resûlullah (Sallallahu Aleyhi ve Sellem)'in münâdîsi: Namaza toplan! Diye seslendi. Biz de Resûlullah (Sallallahu Aleyhi ve Sellem)'in yanına toplandık. Şunları söyledi : «Gerçekten benden önce hiç bîr Nebi geçmemiştir ki. bildiklerinin hayırlısını ümmetine göstermesi ve bildiklerinin kötüsünden onları sakındırması boynuna borç olmasın! Şüphesiz sîzin şu ümmetinizin afiyeti evveline verilmiştir. Ahirine belâ ve yadırgadıkları bir takım şeyler İsabet edecektir. Bir fitne gelecek ki bazısı bazısını hafifletecek! Öyle fitne gelecek, mü'mîn: Bu benim helâkimdir diyecek! Sonra açılacak. Fitne gelecek, mü'mîn: Bu budur diyecek! İmdi kim cehennemden uzaklaştırılıp cennete sokulmak isterse ecel! Allah'a ve âhiret gününe îmân ettîği hâlde gelsin. Ve insanlara kendine yapılmasını dilediği şeyi yapsın! Bîr kimse bîr hükümdara bey'at eder de ona saklayan elini ve kalbinin semeresini verirse elinden geldiği takdîrde hemen ona itaat etsin! Başka bîri gelir de onunla çekişirse o gelenin boynunu vuruverîn!» Ben Abduîlaha yaklaşarak: Allah aşkına! Bunu Resûlullah (Sallallahu Aleyhi ve Sellem) 'den senmi işittin? Dedim. Bunun üzerine iki eli île kulaklarına ve kalbine uzandı. Ve: onu iki kulağım işitti; kalbim de belledi. Dedi. Ben kendisine: — İşte amcan oğlu Muâviye! Bize mallarımızı aramızda bâtılla yememizi ve kendimizi öldürmemizi emrediyor; halbuki Allah : Ey iman edenler! Mallarınızı aranızda haksızlıkla yemeyin. Ancak kendi rızanızla yaptığınız ticaretle yemeniz helaldir. Birbirinizin canına kıymayın. Şüphesiz Allah, size karşı çok merhametlidir. [Nisa 29] buyuruyor. Dedim. Biraz sustu. Sonra: — Sen ona Allah'a itaat hususunda itaat; Allah'a isyan hususunda da isyan et! Dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4777,
			"arabicnumber": "1844.02",
			"text": "{…} Bize Ebû Bekir b. Ebî Şeybe ile İbnü Numeyr ve Ebû Saîd El-Eşecc de rivayet ettiler. (Dedilerki): Bize Vekî, rivayet etti. H. Bize Ebû Kureyb dahî rivayet etti. (Dediki): Bize Ebû Muâviye rivayet etti. Her iki râvî A'meş'den bu isnadla bu hadîsin mislini rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4778,
			"arabicnumber": "1844.03",
			"text": "Bana Muhammed b. Râfi' dahi rivayet etti. (Dediki): Bize Ebu'l-Münzir İsmail b. Ömer rivayet etti. (Dediki); Bize Yûnus b. Ebî İshâk El-Hemdânî rivayet etti. (Dediki): Bize Abdullah b. Ebî's-Sefer, Amir.den, o da Abdurrahman b. Abdi Kabbilkâ'beti's-Sâidi'den [15] naklen rivayet etti. Şöyle demiş: Ben kâ'benin yanında bir cemâat gördüm... Ve râvî hadîsi A'meş'in hadîsi gibi rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4779,
			"arabicnumber": "1845.01",
			"text": "Bize Muhammed b. Müsennâ ile Muhammed b. Beşşâr rivayet ettiler. (Dediler ki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Katâde'yi, Enes b. Mâlik'den, o da Useyd b. Hudayr'dan naklen rivayet ederken dinledim, ki Ensâr'dan bir zât Resûlullah (Sallallahu Aleyhi ve Sellem) le baş başa kalarak: — Filânı vâlî tâyin ettiğin gibi beni de tayin etmez misin? Demiş. Bunun üzerine : «Gerçekten sîz benden sonra bîr kayırmaya rastlayacaksınız. Ama Havz üzerinde bana kavuşuncaya kadar sabredin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4782,
			"arabicnumber": "1846.01",
			"text": "Bize Muhammed b. Müsennâ ile Muhammed b. Beşşâr rivayet etliler (Dediler ki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Simâk b. Harb'dan, o da Alkame b. Vâil EI-Hadramî'den, o da babasından naklen rivayet etti. Şöyle demiş ; Seleme b. Yezid el-Cu'fî Resûlullah (Sallallahu Aleyhi ve Sellem)'e suâl sorarak : — Yâ Nebiyyallah! Lütfen söyle! Başımıza kendi haklarını bizden isteyen fakat bizim hakkımızı bize vermeyen âmirler gelirse bize ne emir buyurursun? Dedi. O kendisinden yüzünü çevirdi. Sonra tekrar sordu. Yine ondan yüzünü çevirdi. Sonra ikincide veya üçüncüde ona tekrar sordu, da Eş'as b. Kays onu çekti. Efendimiz (Sallallahu Aleyhi ve Sellem) de : «Dinleyin ve itaat edin! Onlara ancak yüklendikleri, size de yüklendikleriniz vardır.»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4783,
			"arabicnumber": "1846.02",
			"text": "Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Şebabe rivyâet etti. (Dediki): Bize Şu'be, Simâk'den bu isnâdla bu hadîsin mislini rivayet etti. Ve şöyle dedi: «Onu hemen Eş'as b. Kays çekti. Resûlullah (Sallallahu Aleyhi ve Sellem) de ; Dinleyin ve itaat edin! Onlara ancak yüklendikleri, size de yüklendiğiniz vardır! Buyurdu.»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4784,
			"arabicnumber": "1847.01",
			"text": "Bana Muhammed b. Müsennâ rivâvet etti. (Dediki); Bize Velîd b. Müslim rivayet etti. (Dediki): Bize Abdurrahmân b. Yezîd b. Câbir rivayet etti. (Dediki): Bana Büsr b. Ubeydullah. El-Hadramî rivayet etti ki, kendisi Ebû İdrîs EI-Havlânî'yi şunu Söylerken işitmiş: Ben Huzeyfe b. Yemân'ı şöyle derken dinledim : İnsanlar Resûlullah (Sallallahu Aleyhi ve Sellem)'e hayrı soruyor; ben de başıma gelir korkusu ile ona şerri soruyordum. Ve : — Yâ Resulâllah! Biz câhiliyyet ve kötülük içinde idik. Sonra iAllah bize bu hayrı getirdi. Acaba bu hayırdan sonra şerr var mı? Dedim. «Evet!» cevâbını verdi. — Ya bu şerrden sonra bir hayır olacak mı? Dedim. «Evet! Ama onda duman olacaktır!» buyurdu. Ben : — Onun dumanı nedir? Dedim. «Benim sünnetimden başka yol tutan; benim yolumdan başka yolda giden bir kavim! Onların kimini tanıyacak; kimini yadırgayacaksın!» buyurdu. Ben : — Bu hayırdan sonra bir şerr olacak mı? Diye sordum. «Evet! Cehennemin kapılarında bir takım dellâllar!.. Cehenneme gitmek üzere bunlara kim İcabet ederse onu oraya atarlar.» buyurdu. Ben : — Yâ Resulâllah! Onları bize tavsif eyle! Dedim. «Evet! Bizim aşiretimizden bir kavim! Btzim dilimizle de konuşurlar!» buyurdu. — Yâ Resulâllah! Bu başıma gelirse ne buyurursun? Dedim, «Müslümanların cemaati ile imamından ayrılmazsın!» buyurdu. (Ben tekrar) :\" — Şayet cemaatleri ve imamları yoksa? Dedim. «Bu fırkaların hepsinden uzaklaş! Velev bir ağacın kütüğünü ısırıp bu halde iken ecel sana yetişsin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4785,
			"arabicnumber": "1847.02",
			"text": "Bana Muhammed b. Sehl b. Asker Et-Temimî de rivayet etti. (Dediki): Bize Yahya b. Hassan rivayet etti. H. Bize Abdullah b. Abdirrahmân Ed-Dârimî dahi rivayet etti. (Dediki): Bize Yahya —ki İbni Hassândır— haber verdi. (Dediki): Bize Muâviye (yâni İbni Sellâm) rivayet etti. (Dediki): Bize Zeyd b. Sellâm, Ebû Sellâm'dan rivayet etti. (Demişki): Huzeyfe b. Yemân şunları söyledi: — Yâ Resûlallah! Biz fenalıkta idik. Allah hayır getirdi. Şimdi biz onun içindeyiz. Acaba bu hayrın ardında bir şerr var mıdır? Dedim. «Evet!» cevâbını verdi. — Bu şerrin arkasında bir hayır var mıdır? Dedim. «Evet!» buyurdular. — Yâ bu hayrın arkasında bir şerr var mıdır? Dedim. «Evet!» cevâbını verdi. — Nasıl? Dedim. «Benden sonra benim doğru yolumdan gitmeyen ve benîm sünnetimle amel etmeyen hükümdarlar olacak. İçlerinde bîr takım adamlar türeyecek kî, kalpler! insan cisminde şeytan kalbi olacak!» buyurdu. — Ben buna yetişirsem ne yapayım yâ Resûlallah! Dedim. «Dînler ve emîre itaat edersin. Sırtın dövülse ve malın alınsa bile yine dinle ve itaat eyle!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4786,
			"arabicnumber": "1848.01",
			"text": "Bize Şeybân b. Ferrûh rivayet etti. (Dediki): Bize Cerîr (yânî İbni Hâzim) rivayet etfi. (Dediki}: Bize Gaylân b. Cerîr, Ebû Kays b. Riyah'dan, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti ki: «Her kim tâattan çıkar ve cemaattan ayrılırsa câhiliyyeî ölümü ile ölür. Her kim körü körüne (çekilmiş) bîr sancağın altında harbeder bir asabe namına kızar yahud bîr asabeye davet eder veya bîr asabeye yardımda bulunur da öldürülürse bu da bir câhiliyyet ölümüdür. Ve her kim benim ümmetime karşı çıkar, iyisini kötüsünü vurur; mü'mininden çekinmez; ahid sahibine verdiği sözü de yerine getirmezse o benden değildir; ben de ondan değilim!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4787,
			"arabicnumber": "1848.02",
			"text": "{…} Bana Ubeydullah b. Ömer EI-Kavariri de rivayet etti. (Dediki): Bize Hamnıâd b. Zeyd rivayet etti. (Dediki): Bize Eyyûb, Gaylân b, Cerîr'den, o da Ziyâd b. Riyâh El-Kaysi'den, o da Ebû Hureyre'den naklen rivayet etti. Demişki: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdular... Ravi, Cerîr'in hadîsi gibi rivayette bulunmuş ve: لا يتحاشى من مؤمنها demiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4788,
			"arabicnumber": "1848.03",
			"text": "Bana Züheyr b. Harb da rivayet etti. (Dediki): Bize Abdurralımân b. Mehdi rivayet etti. (Dediki): Bize Mehdi b. Meymûn, Gaylân b. Cerîr'deıı, o da Ziyâd b. Riyâhî'den, o da Ebû Hureyre'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Her kim tâattan çıkar; cemaattan ayrılır da sonra ölürse, cahilîyyet ölümü ile ölür. Her kim körü körüne (çekilmiş) bir sancağın altında ölür; asabe namına kızar ve asabe için çarpışırsa benim ümmetimden değildir. Ve benim ümmetimden her kfm ümmetime karşı çıkar; iyisini kötüsünü vurur; mü'mİninden korunmaz; ahid sahibi olanına da verdiği sözü yerine getirmezse benden değildir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4789,
			"arabicnumber": "1848.04",
			"text": "{…} Bize Muhamnıed b. Müsennâ ile İbnü Beşşar da rivâyet ettiler. (Dedilerki): Bize Muhammed b. Cafer rivayet etti. (Dediki): Bize Şu'be, Gaylân b. Cerîr'den bu isnâdla rivayet etti. Ama îbnü'l-Müsennâ bu hadîsde Nebi (Sallallahu Aleyhi ve Sellem)'i anmadı, İbnü Beşşar'a gelince: O kendi rivayetinde yukarikilerin hadîsinde olduğu gibi «Resûlullah (Sallallahu Aleyhi ve Sellem) buyurdu.» dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4790,
			"arabicnumber": "1849.01",
			"text": "Bize Hasen b. Rabî rivayet etti. (Dediki): Bize Hammâd b. Zeyd, Ca'd'dan, o da Ebû OsmanJdan, o da Ebû Recâ'dan, o da îbnı Abbas'dan rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Bîr kimse emîrinden hoşlanmadığı bîr şey görürse sabretsin! Zira her kim cemaatten bir karış ayrılır da ölürse, bu bir cahiliyyet ölümüdür.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4791,
			"arabicnumber": "1849.02",
			"text": "Bize Şeybân b. Ferrûh da rivayet etti. (Dediki): Bize Abdülvâris rivayet etti, (Dediki): Bize Ca'd rivayet etti. (Dediki): Bize Ebû Recâ El-Utâridî, İbni Abbâs'dan, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. «Bir kimse emirinin bir şeyinden hoşlanmazsa buna sabretsin! Zira insanlardan hiç bir kimse yoktur kî, sultana bir karış karşı çıksın ve bu halde ölsün de câhiliyyet ölümü ile ölmüş olmasın!» buyurmuşlar. İzah 1850 de",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4792,
			"arabicnumber": "1850",
			"text": "Bize Hüreynı b. Abdilâ'lâ rivayet etti. (Dediki): Bize Mu'temir rivayet etti. (Dediki): Babam'ı, Ebû Miclez'den, o da Cündeb b. AbdiIIâh El-Becelîden naklen rivayet ederken işittim. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) : «Her kim körü körüne (dikilmiş) bir sancağın altında, asabiyyete davet veya bir asabiyyete yardım ederken öldürülürse, bu bir câhîliyyet ölümüdür!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4793,
			"arabicnumber": "1851.01",
			"text": "(Bize Ubeydullah b. Muâz El-Anberî rivayet etti. Dediki): Bize babam rivayet etti. (Dediki): Bize Âsim —ki İbni Muhammed b. Zeyd'dir— Zeyd b. Muhammed'den; o da Nâfi'den naklen rivayet etti. Şöyle demiş : Abdullah b. Ömer, Zeyd b. Muâviye zamanında Harra vak'ası olup bittikten sonra Abdullah b. Muti'a geldi. (îbni Muti) : — Ebû Abdirrahman'a bîr yastık atın! Dedi. (İbni Ömer) — Ben sana oturmak için gelmedim. Sana bir hadîs söylemeye geldim. Ben ResûluIIâh (Sallallahu Aleyhi ve Sellem)'i : «Her kim bîr eli taattan çıkarırsa kıyamet gününde Allah'a hiç bîr hücceti olmadığı halde kavuşur. Ve her kim boynunda bir bey'at olmadığı halde ölürse, câhiliyyet ölümü gibi (bir ölümle) ölür.» buyururken işittim. Dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4794,
			"arabicnumber": "1851.02",
			"text": "{…} Bize İbnü Numeyr de rivayet etti. (Dediki): Bize Yahya b. Abdillâh b. Bükeyr rivayet etti. (Dediki): Bize Leys, UbeydulIah b. Ebî Ca'ferden, o da Bükeyr b. Abdillâh b. Eşecc'den, o da Nâfi'den, o da İbni Ömer'den naklen rivayet etti ki. kendisi İbni Mutî'a gelmiş... Ve İbni Ömer Nebi (Sallallahu Aleyhi ve Sellem)'den yukariki hadîs gibî rivayette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4795,
			"arabicnumber": "1851.03",
			"text": "{…} Bize Amr b. Alî rivayet etti. (Dedikî): Bize İbni Mehdi rivayet etti. H. Bize Muhammed b. Amr b. Cebele de rivayet etti. (Dediki): Bize Bişr b. Ömer rivayet etti. Bunlar toptan Hişâm b. Sa'd'dan, o da Zeyd b. Eslem'den, o da babasından, o da İbni Ömer'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen Nafi'in, İbni Ömer'den naklettiği hadîs mânasında rivayette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4796,
			"arabicnumber": "1852.01",
			"text": "Bana Ebû Bekir b. Nâfi' ile Muhammed b. Beşşâr rivayet ettiler. (İbni Nâfi' Bize Gunder rivayet etti dedi. İbni Beşşâr ise; Bize Muhammed b. Ca'fer rivayet etti; dedi.) (Demişki): Bize Şu'be, Ziyâd b. Ilâka'dan rivayet etti. (Demişki): Ben Arfece'den dinledim. (Dediki): Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'İ şöyle buyururken işittim : «Hiç şüphesiz bir şeyler olacaktır! İmdi her kim bu ümmet derli toplu iken onun işini dağıtmak isterse, kim olursa olsun hemen kılıçla onu (n boynunu) vurun!»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4797,
			"arabicnumber": "1852.02",
			"text": "{…} Bize Ahmed b. Hırâş da rivayet etti. (Dediki): Bize Habbân rivayet etti. (Dediki): Bize Ebû Avâne rivayet etti. H. Bana Kaasîm b. Zekeriyyâ dahî rivayet etti. (Dediki): Bize Ubeydullah b. Musa, Seyban'dan rivayet etli. H. Bize İshâk b. İbrahim de rivayet etti. (Dediki): Bize Mus'ab b. Mikdâm El-Has'amî haber verdi. (Dediki): Bize İsrail rivayet etti. H. Bana Haccâc dahî rivayet etti. (Dediki): Bize Arim h. FadI rivayet etti. (Dediki): Bize Hanımâd b. Zeyd rivayet etti. (Dediki): Bize Abdullah b. Muhtar ile bir adam (adını vermiştir) rivayet etti. Bu râvîlerin hepsi Zeyd b. Ilâka'dan, o da Arfece'den, o da Peygamber (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsin mislini rivayet etmişlerdir. Şu kadar var ki hepsinin hadîsinde: «Onu hemen öldürün! denilmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4798,
			"arabicnumber": "1852.03",
			"text": "Bana Osman b. Ebî Şeybe de rivayet etti. (Dediki): Bize Yûnus b, Ebî Ya'fûr, babasından, o da Arfece'den naklen rivayet etti. Söyle demiş: Ben ResûIullah (Sallallahu Aleyhi ve Sellem)'i : «İşiniz bîr adam üzerinde toplu iken kim sizin sopanızı yarmak veya cemaatınızı dağıtmak İsterse onu hemen öldürün!» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4799,
			"arabicnumber": "1853",
			"text": "Bana Vehb b. Bakıyyetel-Vâsıtî rivayet etti. (Dediki): Bize Hâlid b. Abdillâh, Cüreyri'den, o da Ebû Nadra'dan o da Ebû Said-i Hudrî'den naklen rivayet etti. Şöyle demiş; Resûlullah (Sallallahu Aleyhi ve Sellem): «İki halîfeye (birden) bey'at edilirse onlardan ikinciyi öldürüverin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4800,
			"arabicnumber": "1854.01",
			"text": "Bize Heddâb b. Hâlid El-Ezdî rivayet etti. (Dediki): Bize Hemmâm b. Yahya rivayet etti. (Dediki): Bize Katâde Hasan'dan, o da Dabbe b. Mihsan'dan, o da Ümmü Seleme'den naklen rivayet etti ki, Resûlullah (Sallallahu Aleyhi ve Sellemj şöyle buyurmuş : «Bir takım emirler gelecck! Siz: bilip i'tîrâz edeceksiniz. İmdi kim bilirse beraet eder; kim İ'tirazda bulunursa kurtulur. Lâkin kim rıza gösterir de tâbi' olursa!..,» Ashâb: — Onlarla harb etmeyelim mi? Demişler. «Hayır! Namaz kıldıkları müddetçe!» buyurmuş)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4801,
			"arabicnumber": "1854.02",
			"text": "Bana Ebû Gassân El-Mismaî ile Muhammed b. Beşşâr da hep birden Muâz'dan rivayet ettiler. Lâfız Ebû Gassân'ındır. (Dediki): Bize Muâz —ki İbni Hişâm Ed-Destavâi'dir— rivayet etti. (Dediki): Bana babam, Katâbe'den rivayet etti. (Demişki): Bize Hasan, Dabbe b. Mihsan eI-Anezi'den; o da Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Ümmü Seleme'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti: «Sizin üzerinize bîr takım emirler tayin edilecektir. Sîz onları bilip itiraz edeceksiniz, İmdi her kim kerih görürse berâet etti; her kim itirazda bulunursa kurtuldu demektir. Lakin kim rızâ gösterir de tâbi' olursa!... buyurmuştur. Ashab: Yâ Resûlullah onlarla harpetmeyelim mi? demişler. «Hayır! Namaz kıldıkları müddetçe!» buyurmuş. (Yâni her kim kalbi ile kerih görür ve kalbi ile reddederse demektir)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4802,
			"arabicnumber": "1854.03",
			"text": "Bana Ebu'r-Rabi' El-Atekî de rivayet etti. (Dediki): Bize Hammâd (yâni İbni Zeyd) rivayet etti. (Dediki): Bize Muallâ b. Ziyâd ile Hjşâm, Hasan'dan, ada Dabbe b. Mihsan'dan, o da Ümmü Seleme'den naklen rivayet ettiler. Ümmü Seleme: Resûlullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu...» demiş. Râvî yukarki hadîs gribi rivayette bulunmuş; yalnız: «Her kim reddederse muhakkak beri olur; ve her kim kerîh görürse muhakkak kurtulur.» demiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4803,
			"arabicnumber": "1854.04",
			"text": "{…} Bize bu hadîsi Hasan b. Rabî' Ei-Beceli de rivayet etli. (Dediki): Bize İbnu''l-Mübârek, Hişâm'dan, o da Hasan'dan, o da Dabbe b. Mihsan'dan, o da Ümmü Seleme^den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) buyurdular... Râvî yukarıki hadîsin mislini söylemiş; yalnız «Lâkin rızâ gösterip tâbi' olan..» cümlesi müstesna! Onu anmamıştır",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4804,
			"arabicnumber": "1855.01",
			"text": "Bize İshâk b. İbrahim EI-Hanzalî rivayet etti. (Dediki): Bize îsâ b. Yûnus haber verdi. (Dediki): Bize Evzâî, Yezid b. Yezîd b. Câbir'den, o da Ruzeyk b. Hayyân'dan, o da Müslim b. Karaza'dan, o da Avf b. Mâlik'ten o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti : «Hükümdarlarınızın en hayırlısıdır birlerinizi sevdikleriniz ve birbirlerinîze duâ ettiklerinizdir. Hükümdarlarınızın en kötüleri de birbirinize buğz-u la'net etttklerinizdir. buyurmuşlar. — Yâ Resulâllah! Onlarla kılıçla çatışmayalım mıt? denilmiş. «Hayır! Aranızda namazı ikame etfikleri müddetçe!.. Şayet valilerimizden hoşlanmadığınız bir şey görürseniz onun yapılmasını kerîh görür ve bîr eli itâatdan çıkarmayın!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4805,
			"arabicnumber": "1855.02",
			"text": "Bize Dâvûd b. Ruşeyd rivayet etti. (Dediki): Bize Velîd (yânî İbni Müslim) rivayet etti. (Dediki); Bize Abdurrahmân b. Yezîd b. Câbir rivayet etti. (Dediki): Bana Beni Fezâre'nin âzâdlısı —ki bu Zât Ruzeyk b. Hayyân'dır— haber verdi ki. kendisi Avf b. Malikk El-Eşcaî'nin amcası oğlu Müslim b. Karaza'yı şöyle derken işitmiş: Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i : «Hükümdarlarınızın en hayırlısı bir birlerinizi sevdikleriniz ve bir birlerinize dua ettiklerinizdir. Hükümdarlarınızın en kötüleri de bir birinize buğz-u lâ'net ettiklerinizdir.» buyururken işittim. Ashâb dediler ki — Biz, yâ Resûlâllah! O anda onlarla atışmayalım mı? Dedik. «Hayır! Aranızda namazı ikâme ettikleri müddetçe! Hayır; Aranızda namazı ikâme ettikleri müddetçe!.. Dikkat! Bir kimseye bîri vâlî olur da onu Allah'a ma'sıyet olan bîr şey yaparken görürse, yaptığı ma'sıyetten ikrah etsin! Ama bir eli itâattan çıkarmasın !» buyurdular. İbni Câbir demiş ki: «Bana bu hadîsi rivayet ettiği zaman dedim ki: (yâni Ruzcyk'a demiş) Allah aşkına söylermisin yâ Ebe'I-Mikdâm, bunu sana rivayet mi etti; yoksa Müslim b. Karaza'yi: Ben Avf'i: Resûlullah (Sallallahu Aleyhi ve Sellem)'den işitttîm derken dinledim; diyordu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4806,
			"arabicnumber": "1855.03",
			"text": "{…} Bize İshâk b- Mûsâ El-Ensârî de rivayet etti. (Dediki): Bize Velid b. Müslim rivayet etti. (Dediki): Bize İbni Câbir bu isnâdla rivayet etti. Ve: Beni Fezâre'nİn âzâdlısı Ruzeyk dedi. Müslim b. Karaza'dan, o da Avf b. Mâlik'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsin mislini rivayet etti. Bu hadisin râvilerinden Ruzeyk b. Hayyân birçok nüshalarda burada olduğu gibi rivayet edilmişse de Ebû Zür'ate'r-Râzi ve Dimaşki gibi bazı ulema onu Züreyk şeklinde tesbit etmişlerdir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4807,
			"arabicnumber": "1856.01",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Leys Sa'd rivayet etti. H. Bize Muhammed b. Rumh da rivayet etti. (Dediki): Bize Leys. Ebu'z-Zübeyr'den, o da Câbir'den naklen haber verdi. Şöyle demiş ; Biz Hudeybiye günü bin dörtyüz kişi idik. Ve Ömer elinden tutmuş olduğu halde ağacın altında ona bey'st ettik. Bu ağaç bir büyük tiken ağacı idi. Câbir ; «Ona biz, kaçmayacağımıza dair bey'at ettik; ölüm üzerine bey'at etmedik.» demiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4808,
			"arabicnumber": "1856.02",
			"text": "Bize Ebu Bekir b. Ebî Şeybe de rivayet etti. (Dediki) Bize İbni Uyeyne rivayet eyledi. H. Bize İbni Numeyr dahi rivayet etli. (Dediki): Bize Süfyân, Ebu'z-Zübeyr'den, o da Câbir'den naklen rivayet etti : — lîiz Resûlullah (Sallallahu Aleyhi vt Sellem)'e ölüm üzerine bey'at etmedik. Biz ona ancak kaçmayacağımıza bey'at ettik! Demiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4809,
			"arabicnumber": "1856.03",
			"text": "Bize Muhammed b. Hatim dahî rivayet etli. (Dediki) Bize Haccâc, İbnü Cüreyc'den rivayet etti (Demişki): Bana Ebu'z-Zübeyr haber verdi. Câbir'e: Hudeybiye günü kaç kişi oldukları sorulurken işitmiş. Câbir şöyle demiş : — Bin dört yüz kişi idik. Ona, Ömer ağacın alımda —ki bu ağac büyük bir tiken ağacı idi— elinden tutmuş olduğu halde bey'at ettik İbnü Kays El-Ensarî'nin dedesinden başka hepimiz ona bey'at ettik. 0 devesinin karnı altına gizlendi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4810,
			"arabicnumber": "1856.04",
			"text": "Bana İbrahün b. Dînâr da rivayet etti. (Dediki): Bize Süleyman b. Mücâlid'in âzâdlısı Haccâc b. Muhammed EI-A'ver rivayet etti. (Dedikî): İbni Cüreyc şunu söyledi: Bana da Ebu'z-Zübeyr haber verdi, ki kendisi Câbire: Zülhuleyfe'de Nebi (Sallallahu Aleyhi ve Sellem) Hudeybiye kuyusuna duıâ etti... derken işitmiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4811,
			"arabicnumber": "1856.05",
			"text": "Bize Saîd b. Amr E-Eş'asî ile Süveyd b. Saîd, İshâk. îbrahîm ve Ahmed b. Abde rivayet ettiler. Lâfız Saîd'indir. (Saîd île tshâk: Bize haber verdi tâbirini kullandılar.) Ötekiler: Bize Süfyân, Anır'dan, o da Câbir'den naklen rivayet etti; dediler. Câbir şöyle demiş : Biz Hudeybiye günü bin dört yüz kişi idik. Nebi (Sallallahu Aleyhi ve Sellem) bize : «Bugün siz yer yüzü halkının en hayırlısısınız!» buyurdular. Câbir şunu da söylemiş: Gözüm görse size o ağacın yerini gösterdim. [20]",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4812,
			"arabicnumber": "1856.06",
			"text": "Bize Muhammed b. Eî-Müsennâ ile İbni Beşşâr da rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Amr b. Murra'dan, o da Salim b. Ebi'l-Ca'd'dan naklen rivayet etti. Şöyle demiş : Câbir b. Abdillâh'a ağaç ashabını sordum da: Yüz bin kişi olsak yine bize yeterdi. Biz bin beş yüz kişi idik; cevâbını verdi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4813,
			"arabicnumber": "1856.07",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile îbnü Numeyr dahi rivayet ettiler. (Dedilerki): Bize Abdullah b. İdrîs rivayet etti. H. Bize Rifâ'a b. Heysem de rivayet etti. (Dediki): Bize Hâlid (yâni Tahhân) rivayet etti. Her iki râvî Husayn'dan, o da Salim b. Ebi'l-Ca'd'-dan, o da Câbir'den naklen demişlerdir. Câbir : — Yüz bin kişi olsaydık yine bize yeterdi. Biz bin beş yüz kişi idik! Demiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4814,
			"arabicnumber": "1856.08",
			"text": "Bize Osman b. Ebî Şeybe ile İshâk b. İbrahim de rivayet ettiler. (İshâk: Bize haber verdi, tâbirini kullandı. Osman ise: Bize Cerîr, A'meş'den rivayet etti; dedi.) (Demişki): Bana Sâlirn b. Ebi'l-Ca'd rivayet etti. (Dediki): Câbir'e : — O gün kaç kişi idiniz? Diye sordum. — Bin dört yüz! Cevâbını verdi. İzah 1861 de",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4815,
			"arabicnumber": "1857.01",
			"text": "Bize Ubeydullah b. Muâz rivayet etfi. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, Amr'dan (yâni İbni Mürra'dan) rivayet etti. (Demişki): Bana Abdullah b. Ebî Evfâ rivayet etti. (Dediki): Şecere eshabı bin üçyüz kişi idi. Eslem Kabilesi, muhacirlerin sekizde biri idi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4816,
			"arabicnumber": "1857.02",
			"text": "{…} Bize Îbnü'l-Müsennâ da rivayet etti (Dedikî): Bize Ebû Dâvûd rivayet etti. H. Bize bu hadîsi İshâk b. İbrahim dahî rivayet etti. (Dediki): Bize Nadr b. Şümeyl haber verdi. Bunlar hep birden Şu'be'den bu isnadla bu hadîsin mislini rivayet etmişlerdir. İzah 1861 de",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4817,
			"arabicnumber": "1858.01",
			"text": "Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Yezîd b. Zürey' Hâlid'den, o da Hakem b. Abdillâh b. A'rac'dan, o da Ma'kıl b. Yesâr'dan naklen haber verdi. Şöyle demiş : Gerçekten kendimi ağaç gününde görmüşümdür. Nebi (Sallallahu Aleyhi ve Sellem) insanlardan bey'at alıyor; ben de ağacın dallarından bir dalı başından kaldırıyordum. Biz bin dört yüz kişi idik. Ona ölüm üzerine bey'at etmedik. Lâkin kaçmayacağımıza dair bey'ai ettik",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4818,
			"arabicnumber": "1858.02",
			"text": "{…} Bize bu hadîsi yine Yahya b. Yahya rivayet etti. (Dediki): Bize Hâlid b. Abdillah, Yûnus'dan bu isnâdla haber verdi. İzah 1861 de",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4821,
			"arabicnumber": "1859.03",
			"text": "Bana Haccâc b. Şâir ile Muhammed b. Râfi' de rivayet ettiler. (Dedilerki): Bize Şebâbe rivayet etti. (Dediki): Bize Şu'be, Katâde'den, o da Saîd b. EI-Müseyyeb'dcn. o da babasından naklen rivayet etli. Şöyle demiş: Gerçekten o ağac'ı gördüm. Sonra ona geldim; ama onu bilemedim. İzah 1861 de",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4822,
			"arabicnumber": "1860.01",
			"text": "Bize Kuteybe b. Saîd de rivayet etti. (Dediki): Bize Hatim (yânî İbni İsmail) Seleme b. Ekva'ın âzâdlısı Yezîd b. Ebî Ubeyd'den naklen rivayet etti. Şöyle demiş : Seleme'ye: Hudeybiye günü Resûlullah (Sallallahu Aleyhi ve Sellem)'e hangi şey üzerine bey'at ettiniz? Diye sordum. — Ölüm üzerine! Dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4823,
			"arabicnumber": "1860.02",
			"text": "{…} Bu hadîsi bize İshâk b. İbrahim de rivayet etti. (Dediki): Bize Hammâd b. Mes'ade rivayet etti. (Dediki): Bize Yezîd, Seleme'den bu hadîsin mislini rivayet etti. İzah 1861 de",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4824,
			"arabicnumber": "1861",
			"text": "Bize yine İshâk b. İbrahim rivayet etti. (Dediki): Bize Mahzumi haber verdi. (Dediki): Bize Vüheyb rivayet etti. (Dediki): Bize Amr b. Yahya, Abbâd b. Temîm'den, o da Abdullah b. Zeyd'den naklen rivayet etti. Şöyle demiş: Ona biri gelerek: İşte bu İbni Hanzale'dir; insanlardan bey'at alıyor! Demiş. O da: Ne üzerine? Diye sormuş. — Ölüm üzerine! cevâbını vermiş. — Hayır! Ben bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem)'den sonra hiçbir kimseye bey'at etmem! Demiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4825,
			"arabicnumber": "1862",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Hatim (yâni İbni İsmail) Yezîd b. Ebî Ubeyd'den, o da Seleme b. Ekva'dan naklen rivayet etti, kendisi Haccâc'ın yanına girmiş de (Haccâc) : — Ey Ekva' oğlu! Gerisin geriye döndün mü? Bedevîleştin mi? diye — Hayır! Ve lâkin Resûlullah (Sallallahu Aleyhi ve Sellem) bana çöle gitmeye izin verdi. Demiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4826,
			"arabicnumber": "1863.01",
			"text": "Bize Ebû Ca'fer Muhammed b. Sabbâh rivayet etti. (Dediki): Bize İsmâîl b. Zekeriyyâ, Âsim El-Ahvel'den, o da Ebû Osman En-Nehdî'den naklen rivayet etti. (Demiş ki): Bana Mücâşi' b. Mes'ûd Es-Sülemî rivayet etti (Dediki): Hicret üzerie bey'at etmek için Nebi (Sallallahu Aleyhi ve Sellem)'e geldim de: «Hicret, ehli için geçmiştir. Ve lâkin islâm, cihâd ve hayır üzerine (bey'at bakîdir) buyurdu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4827,
			"arabicnumber": "1863.02",
			"text": "Bana Süveyd b. Saîd de rivayet etti. (Dediki): Bize Alî b. Müshir, Asım'dan, o da Ebû Osman'dan naklen rivayet etti. (Demişki): Bana Mücâşi' b. Mes'ûd Es-Sülemî haber verdi. (Dediki): Kardeşim Ebu Ma'bed'le Resûlullah (Sallallahu Aleyhi ve Sellem)'e geldim. Ve : — Yâ Resûlâllah! Bundan hicret üzerine bey'at al! Dedim. «Hicret, ehli için geçmiştir!» buyurdu. «İslâm, cihâd ve hayır üzerine!» buyurdular. Ebû Osman demiş ki: Az sonra Ebû Ma'bed'e rastladım. Ve kendisine Mücâşi'in sözünü haber verdim. — Doğru söylemiş! Dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4828,
			"arabicnumber": "1863.03",
			"text": "{…} Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Muhammed b. Fudayl, Asım'dan bu isnâdla rivayet etti. (Dediki): Bunun üzerine kardeşine rastladım: Mücâşi' doğru söylemiş dedi. Ama Ebû Ma'bed'i anmadı. İzah 1864 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4829,
			"arabicnumber": "1353.03",
			"text": "Bize Yahya b. Yahya ile İshâk b. İbrâhîm rivayet ettiler. (Dedilerki): Bize Cerir, Mansûr'dan, o da Mücâhid'den, o da Tâvûs'dan, o da İbni Abbâs'dan naklen haber verdi. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) Fetih (yânî) Mekke'nin fethi günü : «Hicret yok! Ve lâkin crhâd ve niyet (var!) Sefere çağırıldığınız zaman hemen gıdın!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4830,
			"arabicnumber": "1353.04",
			"text": "{…} Bize Ebû Bekir b. Ebi Şeybe ile Ebû Kureyb de rivayet ettiler. (Dedilerki): Bize Vekî', Süfyân'dan rivayet etti. H. Bize İshâk b. Mansur ile İbni Râfi' dahi Yahya b. Âdem'den rivayet ettiler. (Demişkî): Bize Mufaddal (yânı îbni Mühelhil) rivayet etti. H. Bize Abd b. Humeyd de rivayet etti. (Dediki): Bize Ubeyduilah b. Mûsâ, İsrail'den naklen haber verdi. Bu râvilerin hepsi Mansûr'dan bu isnâdla bu hadîsin mislini rivayet etmişlerdir. İzah 1864 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4831,
			"arabicnumber": "1864",
			"text": "Bize Muhammed b. Abdillâh b. Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Abdullah b. Habîb b. Ebî Sabit, Abdullah b. Abdirrahmân b. Ebî Hüseyn'den, o da Atâ'dan, o da Âîşe'den, naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem)'e hicret (in hükmü) soruldu, da : «Fetihden sonra hicret yoktur. Ve lâkin cihâd ve niyet (vardır). Sefere çağırıldığınız zaman hemen gidin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4832,
			"arabicnumber": "1865.01",
			"text": "Bize Ebû Bekir b. Hallâd El-Bâhilî de rivayet etti. (Dediki): Bize Velîd b. Müslim rivayet etti. (Dediki): Bize Abdurrahmân b. Amr El-Evzâî rivayet etti. (Dediki): Bana İbni Şihâb E-Zührî rivayet etti. (Dediki): Bana Atâ' b. Yezîd El-Leysî rivayet etti, ki kendilerine rivayette bulunmuş. (Demişki): Bana Ebû Saîd El-Hudrî rivayet etti ki, Bedevinin biri Resûlullah (Sallallahu Aleyhi ve Sellem)'e hicreti (in hükmünü) sormuş da : «Vah sana! Hicretin hâli pek şiddetlidir! Senin develerin var mı?» buyurmuş. Bedevi : — Evet! Demiş. «Onların zekâtını veriyor musun?» diye sormuş. Bedevi (yine) — Evet! Cevâbını vermiş. «O hâlde köylerin ötesinden iş gör! Şüphesiz Allah senin amelinden hiç bir şeyi eksiltecek değildir!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4833,
			"arabicnumber": "1865.02",
			"text": "{…} Bize bu hadîsi Abdullah b. Abdirrahmân Ed-Dârimî dahî rivayet etti. (Dediki): Bize Muhammed b. Yûsuf, Evzâî'den bu isnadla bu hadîsin mislini rivayet etti. Şu kadar ki o: «Şüphesiz Allah senin amelinden hiç bir şeyi eksiltecek değildir.» dedi; ve hadîsde: «Suya geldikleri gün onları sağıyor musun? Diye sordu. Bedevi: — Evet! Dedi.» ibaresini ziyâde eyledi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4834,
			"arabicnumber": "1866.01",
			"text": "Bana Ebu't-Tâhir Ahmed b. Amr b. Şerh rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus b. Yezîd haber verdi. (Dediki): İbni Şihâb şunu söyledi: Bana Urve b. Zübeyr haber verdi ki, Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Âişe şunları söylemiş : Müzmin kadınlar Resûlullah (Sallallahu Aleyhi ve Sellem)'e hicret ettikleri vakit Allah (Azze ve Celle)'nin : Ey Nebi! Sana mü'min kadınlar Allah'a hiç bir şeyi şerîk koşmayacaklarına, çalmayacaklarına ve zina etmeyeceklerine dâir bey'at etmeye gelirlerse [Mümtehine 12]... Kavli ile —âyetin sonuna kadar— imtihan olunurlardı. Âişe (sözüne devamla) şöyle demiş: Mü'min kadınlardan bu şartı kim ikrar ederse mihneti ikrar etmiş, olurdu. Kadınlar bunu sözle ikrar ettikleri vakit Resûlulah (Sallallahu Aleyhi ve Sellem) onlara : «Haydi gidin! Sizin bey'atınızı kabul ettim!» derdi. Hayır! Vallahi Resûlullah (Sallallahu Aleyhi ve Sellem)'in eli hiç bir kadının eline dokunmamıştır. O kadınlardan yalnız sözle b«y'at alırdı. Âişe demiş ki : Vallahi Resûlullah (Sallallahu Aleyhi ve Sellem) kadınlardan, Allah Teâlâ'nın emrettiğinden başka hiç bir şey almamış; ve Resûlullah (Sallallahu Aleyhi ve Sellem)'in avucu asla bir kadının avucuna dokunmamıştır. Onlardan bey'at aldığı zaman kendilerine sözle: «Bey'atrnızı kabuj ettim!» derdi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4835,
			"arabicnumber": "1866.02",
			"text": "Bana Hârûn b. Saîd El-Eylî Ebu't-Tâhir de rivayet ettiler. (Ebu't-Tâhir: Bize haber verdi tâbirini kullandı. Hârûn ise: Bize İbni Vehb rivayet etti. Dedi.) (Demişki): Bana Mâlik, İbni Şihâb'dan, o da Urve'den naklen rivayet ettiki. ona da Âişe. kadınların bey'atını haber vermiş; ve : Resûlullah (Sallallahu Aleyhi ve Sellem) eli ile hiç bir kadına dokunmamıştir. Lâkin kadından bey'atı sözle alırdı. Onu sözle aldı da kadın da söz verdi mi «Git! Senin bey'atını aldım!» derdi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4836,
			"arabicnumber": "1867",
			"text": "Bize Yahya b. Eyyûb ile Kuieybe ve İbni Hucr rivayet ettiler. Lâfız İbni Eyyûb'undur. (Dedilerki): Bize İsmâîl —bu zât İbni Ca'ferdir— rivayet etti. (Dediki): Bana Abdulah b. Dînâr haber verdi, ki kendisi; Abdullah b. Ömer'i: Biz Resûlullah (Sallallahu Aleyhi ve Sellem)'e dinleyip itaat şartı ile bey'at ediyorduk. Bize: «Gücünün yettiği hususta» buyururdu; derken işitmiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4837,
			"arabicnumber": "1868.01",
			"text": "Bize Muhammed b. Abdillâh b. Numeyr rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Ubeydullah, Nâfi'den, o da İbni Ömer'den naklen rivayet etti. İbni Ömer şöyle demiş: Uhud harbi günü Resûlullah (Sallallahu Aleyhi ve Sellem) beni harbte teftiş etti. (O zaman) on dört yaşında idim. Bana müsaade etmedi. Beni Hendek günü de teftiş etti. (O zaman) onbeş yaşında idim. Ve bana müsâade etti. Nâfi' demiş ki: Bunun üzerine Ömer b. Abdilâzîz'in yanına gittim. O gün halîfe idi. Ve kendine bu hadîsi söyledim. Ömer: — Gerçekten bu, küçüklükle büyüklük arasında bir sınırdır. Dedi; ve me'murlarına: onbeş yaşında olan kimseye asker aylığı bağlamalarını yazdı. Bu yaştan aşağı olanı çocuklara katın! Dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4838,
			"arabicnumber": "1868.02",
			"text": "{…} Bize bu hadîsi Ebü Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Abdullah b. İdrîs ile Abdurrahîm b. Süleyman rivayet ettiler. H. Bize Muhammed b. Müsennâ dalıi rivayet etti. (Dediki): Bize Abdülvehlıâb (yâni Sekafi) rivayet etti. Bunlar hep birden Ubeydullah'dan bu İsnâdla rivayette bulunmuşlardır. Yalnız onların hadîsinde: «Ben on dört yaşında idim, de beni küçük gördü.» ifadesi vardı",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4839,
			"arabicnumber": "1869.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, Nâfi'den dinlediğim, onun da Abdullah b. Ömer'den naklettiği şu hadîsi okudum: Abdullah şöyle demiş : Resûlullah (Sallallahu Aleyhi ve Sellem) Kur'ânla düşman toprağına gidilmesini yasak etti",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4840,
			"arabicnumber": "1869.02",
			"text": "Bize Kuteybe de rivayet etti. (Dediki): Bize Leys rivayet etti. H. Bize İbnl Rumh dahî rivayet etli. (Dediki): Bize Leys, Nâfi'den, o da Abdullah b. Ömer'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi ki, düşmanın eline geçer endîşesi ile düşman toprağına Kur'ân-ı Kerimle gidilmesini yasak edermiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4841,
			"arabicnumber": "1869.03",
			"text": "Bize Ebu'r-Rabî' El-Atekî ile Ebû Kâmil de rivayet ettiler. (Dedilerki): Bize Hammâd, Eyyûb'dan o da Nâfi'den, o da İbni Ömer'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Kur'anla sefer etmeyin! Çünkü ben onun düşman eline geçmeyeceğinden emin değilim.» buyurdular. Eyyûb: «Gerçekten düşman onu ele geçirdi; ve onunla size münâzea ettiler.» demiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4842,
			"arabicnumber": "1869.04",
			"text": "{…} Bana Züheyr b. Harb rivayet etti. (Dediki): Bize İsmail (yâni İbni Uleyye) rivayet etti. H. Bize İbni Ebi Ömer de rivayet etti. (Dediki): Bize Süfyân ile Sekafî rivayet ettiler. Bunların hepsi Eyyûb'dan rivayet etmişlerdir. H. Bize İbni Râfî' dahî rivayet etti. (Dediki): Bize İbni Ebî Füdeyk rivayet etti. (Dediki): Bize Dahhâk (yâni İbni Osman) haber verdi. Bu râvîlerin hepsi Nâfi'den, o da İbni Ömer'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayette bulunmuşlardır. İbni Uleyye ile Sakafi'nin hadîsinde: «Çünkü ben korkarım.» cümle­si, Süfyân'Ia Dahhâk b. Osman'ın hadîslerinde ise : «Düşmanın elîne geçer korkusu ile..» ifâdesi vardır",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4843,
			"arabicnumber": "1870.01",
			"text": "Eize Yahya b. Yahya Et-Temimî rivayet etti. (Dediki) Resûlullah (Sallallahu Aleyhi ve Sellem) idmanlı atlarla Hafyâ'dan koşu yaptı. Müsabakanın sonu seniyyetü'I-Vedâ idi. İdman görmeyen atlar arasında da Seniyye'den Benî Züreyk mescidine kadar koşu yaptı. İbn Ömer, burada müsabaka yapanlar arasında idi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4844,
			"arabicnumber": "1870.02",
			"text": "{…} Bize yine Yahya b. Yahya ile Muhammed b. Rumh ve Kuteybe b. Saîd, Leys b. Sa'd'dan rivayet ettiler. H. Bize Halef b. Hİşâm ile Ebu'r-Rabî' ve Ebû Kâmil de rivayet ettiler. (Dedilerki): Bize Hammâd —bu zât İbni Zeyd'dir— Eyyûb'dan rivayet etti. H. Bize Züheyr b. Harb da rivayet elti. (Dediki): Bize İsmail, Eyyûb'dan rivayet etti. H. Bize İbni Numeyr dahî rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize Ebû Bekir b. Ebi Şeybe de rivayet etti, (Dediki): Bize Ebû Usâme rivayet etti. H. Bize Muhammed b. Müsennâ ile Ubeydullah b. Saîd dahî rivayet ettiler. (Dedilerki): Bize Yahya —ki El-Kattân'dır— rivayet etti. Bunların hepsi Ubeydullah'dan rivayet etmişlerdir. H. Bana Alî b, Hucr ile Ahmed b. Abde ve İbni Ebî Ömer de rivayet ettiler. (Dedilerki): Bize Süfyân, İsmâîl b. Ümeyye'den rivayet etti. H. Bana Muhammed b. Râfi' de rivayet etti. (Dediki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize İbni Cüreyc haber verdi. (Dediki): Bana Mûsâ b. Ukbe haber verdi. H. Bize Hârûn b. Saîd El-Eylî dahi rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Usâme (yânı İbni Zeyd) haber verdi. Bu râvilerin hepsi Nâfi'den, o da İbni Ömer'den, naklen Mâlik'in Nâfi'den rivayet ettiği hadîs mânâsında rivayette bulunmuşlardır. Eyyûb'un, Hammad'la İbni Uleyye tarafından rivayet olunan hadîsinde şuna ziyade etmiştir: «Abdullah Dediki: Ben geçmiş olarak geldim. At beni mescid'den atlattı.»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4845,
			"arabicnumber": "1871.01",
			"text": "Bize Yahya b. Yahya rivayet etli. (Dediki): Mâlik'e, Nâfi'den dinlediğim, onunda İbni Ömer'den rivayet ettiği şu hadîsi okudum: Resûlullah (Sallallahu Aleyhi ve Sellem): «Kıyamet gününe kadar hayır atların alınlarındadır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4846,
			"arabicnumber": "1871.02",
			"text": "{…} Bize Kuteybe ile Rumh da Leys b. Sa'd'dan rivayet ettiler. H. Bize Ebû Bekir b. Ebi Şeybe de rivayet etti. (Dediki): Bize Aliy b. Müshir'le Abdullah b. Numeyr rivayet ettiler. H. Bize îbni Numeyr dahî rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize Ubeydullah b. Saîd de rivayet etti. (Dediki): Bize Yahya rivayet etti. Bu râvîlerin hepsi Ubeydullah'dan rivayet etmişlerdir. H. Bize Hârûn b. Saîd El-Eylî dahî rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Usâme rivayet etti. Bunların hepsi Nâfi'den, o da îbni Ömer'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen Mâlikin Nâfiden rivayet ettiği hadîs gibi rivayette bulunmuşlardır. , İzah 1874 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4847,
			"arabicnumber": "1872.01",
			"text": "Bize Nasr b. Aliy El-Cehdamî ile Salih b. Hatim b. Verdân hepsi birden Yezîd'den rivayet ettiler. Cehdamî Dediki: Bize Yezîd b. Zürey' rivayet etti. (Dediki): Bize Yûnus b. Ubeyd, Amr b. Saîd'den, o da Ebû Zür'a b. Amr b. Cerîr'den, o da Cerîr b. Abdillâh'dan naklen rivayet etti. Şöyle demiş : Resûlullah (Sallallahu Aleyhi ve Sellem)'i parmağı ile bir atın alnını örüyor ve : «Atların alınlarına kıyamet gününe kadar hayır düğümlenmiştir. Ecir ve ganîmet!» buyuruyorken işittim",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4848,
			"arabicnumber": "1872.02",
			"text": "{…} Bana Züheyr b. Harb da rivayet etti. (Dediki): Bize İsmâîl b. İbrahim rivayet etti. H. Bize Ebû Bekir b. Ebî Şeybe dahî rivayet etti. (Dediki): Bize Vekî', Süfyân'dan rivayet etti. Her iki râvî Yûnus'dan bu isnâdfa bu hadîsin mislini rivayet etmişlerdir. İzah 1874 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4849,
			"arabicnumber": "1873.01",
			"text": "Bize Muhammed b. Abdillâh b. Numeyr rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Zekeriyyâ, Âmir'den, o da Urvetü'l-Bârikî'den naklen rivayet etti. Şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Atların alınlarına kıyamet gününe hayır düğümlenmiştir. Ecir ve ganimet!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4850,
			"arabicnumber": "1873.02",
			"text": "Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize İbni Fudayl ile İbnİ İdrîs, Husayn'dan, o da Şa'bî'den, o da Urvetü'l-Bârıkî'den naklen rivayet ettiler. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Hayır atların alınlarına düğümlenmiştir.» buyurdu. Kendilerine, — Yâ Resûlallah! Bu ne iledir? Denildi. «Kıyamet gününe kadar ecir ve ganimet!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4851,
			"arabicnumber": "1873.03",
			"text": "{…} Bize bu hadisi İshâk b. İbralıîm de rivayet etti. (Dediki): Bize Cerîr Husayn'dan bu isnâdla haber verdi . Şu kadar var ki O : «Urve b. Ca'd» dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4852,
			"arabicnumber": "1873.04",
			"text": "{…} Bize Yahya b. Yahya ile Halef b. Hişam ve Ebû Bekir b. Ebi Şeybe toptan Ebu'l-Ahvas'dan rivayet ettiler. H. Bize İshâk b, İbrahim ile İbni Ebî Ömer, ikisi birden Süfyân'dan ri­vayet ettiler. Bunların hepsi Şebîb b. Garkade'den, o da Urvetü'I-Bârikî'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etmişlerdir. Ama «Ecir ve ganimet!» cümlesini anmamıştır. Süfyân'ın hadîsinde: «Urvetü'l-Bârıkîden işitmiş; o da Nebi (Sallallahu Aleyhi ve Sellem) 'den işitmiş..» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4853,
			"arabicnumber": "1873.05",
			"text": "{…} Bize Ubeydullah b. Muâz da rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize İbni'l-Müsennâ ile ibni Beşşâr dahi rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. Her iki râvî Şu'be'den, o da Ebû İshâk'dan, o da Ayzâr b. Hureys'den, o da Urvetü'bnül-Ca'd'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu isnâdla rivayet etti. Ama: «Ecri ve ganimet !» ifâdesini anmadı. İzah 1874 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4854,
			"arabicnumber": "1874.01",
			"text": "Bize yine Ubeydullah b. Muâz rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize Muhammed b. Müsennâ ile İbni Beşşâr da rivayet ettiler. (Dedilerki): Bize Yahya b. Saîd rivayet etti. Her iki râvî Şube'den, o da Ebu'l-Tcyyâh'dan, o da Enes b. Mâlik'den naklen rivayet etmişlerdir. Enes şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Bereket atların alınlarındadır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4855,
			"arabicnumber": "1874.02",
			"text": "{…} Bize Yahya b. Habîb de rivayet etti. (Dediki): Bize Hâlid (yâni İbni'l-Harîs) rivayet etti. H. Bana Muhammed b. Velîd de rivayet elti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. Her iki râvî demişler ki: Bize Şu'be, Ebu't-Teyyâh'dan rivayet etti. O da Enes'i Nebi (Sallallahu Aleyhi ve Sellem)'den bu hadîsin mislini rivayet ederken dinlemiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4856,
			"arabicnumber": "1875.01",
			"text": "Bize Yahya b. Yalıya ile Ebû Bekir b. Ebî Şeybe, Züheyr b. Harb ve Ebû Kureyb rivayet ettiler. (Yahya: bize haber verdi tâbirini kullandı, ötekiler: Bize Vekî' rivayet etti dediler.) (Demişki); Bize Süfyân, Selm b. Abdirrahmân'dan, o da Ebû Zür'a'dan, o da Ebû Hureyre'den naklen rivayet etti : Resûlullah (Sallallahu Aleyhi ve Sellem), Atların üç ayağı sekir olanını sevmezdi. Demiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4857,
			"arabicnumber": "1875.02",
			"text": "Bize Muhammed b. Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. H. Bana Abdurrahmân b. Bişr dahî rivayet etti. (Dediki): Bize Abdurrazzâk rivayet etti. Bunlar hep birden Süfyân'dan bu îsnâdla bu hadîsin mislini rivayet etmişlerdir. Abdürrazzâk'ın hadîsinde: «Sekirlik, atın sağ arka ayağında ve sol ön ayağında yahud sağ ön ayağında ve sol arka ayağında beyazlık olmaktır.» ifâdesini ziyâde etti",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4858,
			"arabicnumber": "1875.03",
			"text": "{…} Bize Muhammed b. Beşşâr rivayet etti. (Dediki): Bize Muhammed (yânî İbni Ca'fer) rivayet etti. H. Bize Muhammed b. Müsennâ dahî rivayet etti. (Dediki): Bana Vehb b. Cerîr rivayet etti. Bunlar toptan Şu'be'den, o da Abdullah b. Yezîd En-Nehaî'den, o da Ebû Zür'a'dan, o da Ebû Hureyre'den, o da Peygamber (Sallallahu Aleyhi ve Sellem)'den naklen Vekî'in hadisi gibi rivayette bulunmuşlardır. Vehb'in rivayetinde: «Abdullah b. Yezîd'den..» ifâdesi vardır. Nehaî'yi anmamıştır",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4859,
			"arabicnumber": "1876.01",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Cerîr Umâre'den (ki bu zât İbnü'l-Ka'kaa'dır.) o da Ebû Zür'a'dan, o da Ebû Hureyre'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Allah kendi yolunda (gazaya) çıkan kimseye kefil olmuştur: (Buyurur ki): Onu (çıkaran) ancak benim yolumda cihâd etmek, bana inanmak ve Nebilerimi tasdîk eylemek için çıkarmıştır. Şu halde o, kendisini cennete koymamı yahud alabildiği kadar ecir veya ganimet olarak içinden çıktığı evine döndürmemi benim üzerime garantilemiştir. Muhammed'in nefsi yed-i kudretinde olan Allah'a yemîn ederim ki, şayet bir yara Allah yolunda açıtırsa kıyamet gününde açıldığı zamanki kılığında gelecek, rengi kan rengi, kokusu misk olacaktır. Muhammed'in nefsi yed-î kudretinde olan Allah'a yemîn olsun ki eğer müslümanlara zor gelmese, Allah yolunda gaza eden bir seriyyenin ardından ebediyyen oturmazdım! Lâkin varlık bulamıyorum ki, onları (hayvan üzerinde) taşıyayım! Onlar da varlık bulamıyorlar. Kendilerine benden geri kalmak zor geliyor! Muhammed'in nefsi yed-İ kudretinde olan Allah'a yemin ederim kî, ben Allah yolunda gaza ederek öldürülmeyi, sonra yine gaza ederek öldürül­meyi, sonra yine gaza ederek öldürülmeyi pek arzu ederim!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4860,
			"arabicnumber": "1876.02",
			"text": "{…} Bize bu hadîsi Ebû Bekir b. Ebi Şeybe ile Ebû Kureyb de rivayet ettiler. (Dedilerki): Bize İbni Fudayl, Umâre'den bu isnâdla rivayette bulundu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4861,
			"arabicnumber": "1876.03",
			"text": "Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Muğîre b. Abdirrahmân EI-Hizâmî, Ebu'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi: «Allah, kendî yolunda cihâd eden, evinden kendisini onun yolunda cihâdla onun kelimesini tasdıkde başka hiç bir şey çıkaramayan, kimseyi cennete koyacağına yahud İçinden çıktığı evine, kazandığı ecir veya ganimetle beraber döndüreceğine kefîl olmuştur!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4862,
			"arabicnumber": "1876.04",
			"text": "Bize Amru'n-Nâkid ile Züheyr b. Harb rivayet ettiler. (Dedilerki): Bize Süfyan b. Uyeyne, Ebu'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti : «Eğer bir kimse Allah yolunda yaralanırsa —ki Allah kendi yolunda yaralananı pekâlâ bilir— kıyamet gününde yarası fışkırarak gelir. Renk kan rengi, koku da misk kokusu!..» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4863,
			"arabicnumber": "1876.05",
			"text": "Bize Muhammed b. Râfi' de rivayet etti. (Dediki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize Ma'mer, Hemmâm b. Mümebbih'den naklen rivayet etti. Hemmâm: Bize Ebû Hureyre'nin Resûlullah (Sallallahu Aleyhi ve Sellem)'den rivayet ettikleri şudur: diyerek bir takım hadîsler zikretmiştir ki, onlardan biri de şudur: Resulullah (Sallallahu Aleyhi ve Sellem): «Müslümanın aldığı her yara Allah yolundadır. Sonra Kıyamet gününda bu yara, vurulduğu günkü kılığında olacak, kan fışkıracaktır. Renk kan rengi, koku misk kokusu!» buyurdu. Ve Resûlullah (Sallallahu Aleyhi ve Sellem) (sözüne devamla) : «Muhammed'in nefsi yed-i kudretinde olan Allah'a yemin ederim ki, mü'minlere meşakkat vermiş olmasam Allah yolunda gaza eden hiç bir seriyyenîn ardında oturmazdım! Ve lâkin varlık bulamıyorum kî, onları (hayvan üzerinde) taşıyayım! Onlar da varlık bulamıyorlarki, benim arkamdan gelebilsinler. Benîm ardımdan oturup kalmaya da gönülleri razı olmuyor.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4864,
			"arabicnumber": "1876.06",
			"text": "{…} Bize İbni Ebî Ömer de rivayet elti. (Dediki): Bize Süfyân, Ebu'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hureyre'den naklen rivayet etti. Şöyle demiş: Ben Resûlulîah (Sallallahu Aleyhi ve Sellem)'i : «Mü'minlere meşakkat vermiş olmasam hiç bîr seriyyenin arkasında oturmazdım!...» buyururken işittim. Râvî hadîsi yukarıkilerin hadîsi gibi ve bu isnâdla: «Nefsim yed-i kudretinde olan Allah'a yemîn ederim kî Allah yolunda öldürülüp sonra diriltilmeyi pek arzu ederdim...» şeklinde Ebû Zür'a'nın, Ebû Hureyre'den naklettiği hadîs gibi rivayette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4865,
			"arabicnumber": "1876.07",
			"text": "{…} Bize Muhammed b. Müsennâ da rivayet etti. (Dediki): Bize Abdülvehhâb (yânı Sekafî) rivayet etti. H. Bize Ebû Bekir b. Ebî Şeybe dahî rivayet etti. (Dediki): Bize Ebû Muâviye rivayet etti. H. Bize îbni Ebî Ömer de rivayet etti. (Dediki): Bize Mervân b. Muâviye rivayet etti. Bu râvîlerin hepsi Yahya b. Saîd'den, o da Ebû Sâlih'den, o da Ebû Hureyre'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Ümmetime meşakkat vermiş olmasam hiçbir seriyyeden geri kalmamak isterdim...» buyurdular. Râvî yukarıkilerin hadîsi gibi rivayette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4866,
			"arabicnumber": "1876.08",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Cerîr, Süheyl'den, o da babasından, o da Ebû Hureyre'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Allah kendi yolunda (gazaya) çıkan kimseye kefîl olmuştur...» buyurdu. Râvî hadîsi «Allah feâlâ yolunda gaza eden hiç bir seriyyeden geri kalmazdım!» ifâdesine kadar rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4867,
			"arabicnumber": "1877.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dedikî): Bize Ebû Hâlid EI-Ahmar, Şu'be'den, o da Katâde ile Humeyd'den, onlar da Enes b. Mâlik'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti : «Ölen hiç bîr nefis yoktur ki, Allah indînde bir hayrı olsun da dünyaya dönmeyi ve dünya ile onun içinde bulunan büfün varlıkların kendisinin olmasını arzu etsin. Yalnız şehîd müstesna! Çünkü o, şehîdliğin faziletini gördüğü için dönmeyi ve dünyâda tekrar öldürülmeyi temenni eder. buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4868,
			"arabicnumber": "1877.02",
			"text": "Bize Muhammed b. Müsennâ île İbni Beşşâr da rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Katâde'den naklen rivayet etti. (Demişki): Ben Enes b. Mâlik'i Nebi (Sallallahu Aleyhi ve Sellem)'den rivayet ederken dinledim. «Şehîdden başka cennete giren hiç bîr kimse yoktur ki, dünyaya dönmeyi ve yer yüzündeki her şeyin kendinin olmasını dilesin. Şehîd ise gördüğü ikramdan dolayı dönmeyi ve on defa öldürülmeyi temenni eder.» buyurmuş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4869,
			"arabicnumber": "1878.01",
			"text": "Bize Saîd b. Mansûr rivayet etti. (Dedikî): Bize Hâlid b. Abdillâh El-Vasitî, Süheyl b. Ebî Sâlih'den, o da babasından, o da Ebû Hureyre'den naklen rivayet etti. Şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem)'e: Allah azze ve cellenin yolunda cîhâd etmeye ne muâdil olabilir? Dediler. «Sizin ona gücünüz yetmez!» buyurdu. Bu sözü kendisine ikî veya üç defa tekrarladılar. Hepsinde: «Sizin ona gücünüz yetmez!» buyurdu. Üçüncüde: «Allah yolunda mücâhede eden kimsenin misâli, oruç tutan, namaz kılan, Allah'ın âyetlerine muti' bir kişi gibidir ki tâ Allah Teâlâ'nın yolundaki mücâhid donünceye kadar ne oruçtan gevşer ne namazdan! buyurdular:",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4870,
			"arabicnumber": "1878.02",
			"text": "{…} Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Ebû Avâne rivayet etti. H. Bana Züheyr b. Harb da rivâvet etti, (Dediki): Bize rivayet etti. H. Bize Ebû Bekir b. Ebî Şeybe dahî rivayet etti. (Dediki): Bize Ebu Muâviye rivayet etti. Bunların hepsi Süheyl'den bu isnâdla bu hadîsin mislini rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4871,
			"arabicnumber": "1879.01",
			"text": "Bana Hasan b. Aliy El-Hulvânî rivayet etti. (Dediki): Bize Ebû Tevbe rivayet etti. (Dediki): Bize Muâviye b. Sellâm, Zeyd b. Sellâm'dan naklen rivayet etti ki, kendisi Ebû Sellâm'ı şöyle derken işitmiş: Bana Nu'mân b. Beşîr rivayet etti. Dediki : Resûlullah (Sallallahu Aleyhi ve Sellem)'in minberinin yanında idim Bir adam: Ben müslüman olduktan sonra hiç bir amel işlememiş olmama aldırış etmem. Yalnız hacıları sulamam müstesna! Dedi. Bir başkası : — Ben müslüman olduktan sonra hiç bir amel işlememiş olmama aldırış etmem. Yalnız Mescid-i Haramı ta'mîr etmem müstesna! Dedi. Başka biri : — Allah yolunda cîhâd etmek sizin söylediğinizden efdaldiı; dedi. Bunun Üzerine Ömer kendilerini menetti. Ve — Bu gün cuma günüdür. Resûlullah (Sallallahu Aleyhi ve Sellem)''in minberinin yanında seslerinizi yükseltmeyin! Lâkin ben cumayı kıldığını zaman içeriye girer; sizin ihtilâf ettiğiniz hususu ona sorarım! Dedi. Arkacığından Allah (azze ve celle) : Siz hacıları sulamakla Mescİd-i Haramı tâmîr etmeyi Allah'a ve son güne îmân edip Allah yolunda cihâd eden kimse ile birmi tutuyorsunuz? [Tevbe 19] âyetini sonuna kadar indirdi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4872,
			"arabicnumber": "1879.02",
			"text": "{…} Bu hadîsi bana Abdullah b. Abdirrahmân Ed-Dârimî de rivayet etti. (Dediki): Bize Yahya b. Hassan rivayet etti. (Dediki): Bize Muâviye rivayet etti. (Dediki): Bana Zeyd haber verdi ki, kendisi Ebû Sellâm'i şeyle derken işitmiş: Bana Nu'mân b. Beşîr rivayet etti. (Dediki): Ben Resûlullah (Sallallahu Aleyhi ve Sellem)\"in minberi yanında idim... Râvî bu hadîsi, Ebû Tevbe'nin hadîsi gibi rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4873,
			"arabicnumber": "1880",
			"text": "Bize Abdullah b. Mesleme b. Ka'neb rivayet etti. (Dediki): Bize Hammâd b. Seleme, Sâbit'den, o da Enes b. Mâlik'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Allah yolunda bir sabah veya akşam seferi dünyâdan ve bütün dünya varlıklarından daha hayırlıdır.» buyurdular. İzah 1883 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4874,
			"arabicnumber": "1881.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Abdülâziz b. Ebî Hâzim, babasından, o da Sehl b. Sa'd Es-Sâıdî'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi! «Kulun Allah yolunda yürüdüğü sabah yürüyüşü dünyâdan ve bütün dünya varlıklarından daha hayırlıdır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4875,
			"arabicnumber": "1881.02",
			"text": "Bize Ebû Bekir b. Ebi Şeybe ile Züheyr b. Harb da ri­vayet ettiler. (Dedilerki): Bize Veki', Süfyân'dan, o da Ebû Hâzim'den, o da Sehl b. Sa'd Es-Sâidî'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. «Allah yolunda bîr sabah veya akşam yürüyüşü dünyadan ve bütün dünya varlıklarından daha hayırlıdır.» buyurmuşlar. İzah 1883 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4876,
			"arabicnumber": "1882",
			"text": "de de 114 var, ama kitap ta öyle! Bize îbni Ebî Ömer rivayet etti. (Dediki): Bize Mervân b. Muâviye, Yahya b. Said'den, o da Zekvân b. Ebî Sâlih'den, o da Ebû Hureyre'den, naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Ümmetimden bir takım adamlar olmasa...» buyurdular. Ve râvî hadîsi rivayet etmiştir. Bu hadîsde şu cümle de vardır: «Allah yolunda bir akşam veya sabah yürüyüşü dünyadan ve bütün dünya varlıklarından daha hayırlıdır.» İzah 1883 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4877,
			"arabicnumber": "1883.01",
			"text": "Bize Ebû Bekir b. Ebi Şeybe ile İshâk b. İbrahim ve Züheyr b. Harb da rivayet ettiler. Lâfız Ebû Bekir'le İshâk'ın'dır, (İshak: Bize haber verdi tâbirini kullandı. Ötekileri: Bize EI-Mukri' Abdullah b. Yezîd rivayet etti; dediler.) O Saîd b. Ebî Eyyûb'dan naklen rivayet etmiş: (Demişki): Bana Şurahbîl b. Şerîk El-Maâfirî, Ebû Abdirrahmân El-Hubulî'den rivayet etti. Şöyle demiş: Ben Ebû Eyyûb'u şöyle derken işittim; Resûlullah (Sallallahu Aleyhi ve Sellem) : «Allah yolunda bir sabah veya akşam yürüyüşü, üzerine güneş doğmuş batmış her şeyden daha hayırlıdır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4878,
			"arabicnumber": "1883.02",
			"text": "{…} Bana Muhammed b. Abdillâh b. Kuhzâz rivâyet etti. (Dediki): Bize Aliy b. Hasan, Abdullah b. Mübârek'den rivayet etti. (Demişki): Bize Saîd b. Ebî Eyyûb ile Hayve b. Şureyh haber verdiler. Bunlardan her biri Dediki: Bana Şurahbîl b. Şerîk, Ebû Abdirrahmân El-Hubuli'den naklen rivayet ettiki, kendisi Ebû Eyyûb EI-Ensârî'yi: Resûlullah (Sallallahu Aleyhi ve Sellem) buyurdu...» derken işitmiş. Hadîs yukarıkinin tamamîyle mislidir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4879,
			"arabicnumber": "1884",
			"text": "Bize Saîd b. Mansûr rivayet etti. (Dediki): Bize Abdullah b. Vehb rivayet etti. (Dediki): Bana Ebû Hânî El-Havlânî, Ebû Abdirrahmân EI-Hubulî'den, o da Ebû Saîd-i Hudrî'den naklen rivayet etti ki, Resûlullah (Sallallahu Aleyhi ve Sellem): «Yâ Ebu Said! Her kim Rabb olarak Allah'a, din olarak İslama, Peygamber olarak da Muhammed'e razı olursa o kimseye cennet vâcibtir.» buyurmuş. Ebû Saîd buna şaşmış ve: — Bunları bana tekrarla yâ Resûlâllah! Demiş. O da tekrarlamış. Sonra : «Başka bir şey var ki onunla cennete bir kul yüz derece yükseltilir. Her iki derecenin arası yerle gök arası gibidir.» buyurmuş. Ebû Saîd : — Nedir o yâ Resûlâllah? Diye sormuş. «Allah yolunda cihâddır; Allah yolunda cihâddır!» buyurmuşlar. Yukarıda geçen: رضي بالله ربا، وبالإسلام دينا، وبمحمد نبيا RIZA METNİNİN LATİN HARFLERİ İLE: = [Radiy BİLLAHİ Rabben ve bi’l-islami dinen ve bi Muhammedi Nebiyyen]",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4880,
			"arabicnumber": "1885.01",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Leys, Saîd b, Saîd'den, o da Abdullah b. Ebî Katâde'den, o da Ebû Katade'den, naklen rivayet ettiki, Abdullah, Ebû Katâde'yi Resûlullah (Sallallahu Aleyhi ve Sellem)'den rivayet ederken dinlemiş. Nebi (Sallallahu Aleyhi ve Sellem) aralarında ayağa kalkarak onlara : Allah yolunda cihâdla îmânın amellerin en faziletlisi olduğunu söylemiş Bunun üzerine bir adam kalkarak : — Yâ Resûlâllahî Ne buyurursun, ben Allah yolunda öldürülsenı günahlarım affolunur mu? Demiş. Resûlullah (Sallallahu Aleyhi ve Sellem) de ona : «Evet, ihlâsla sabrettiğin halde ileri gidip gerî dönmeyerek Allah yolunda öldürülürsen!» buyurmuş. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem): «Nasıl dedin?» diye sormuş. Adam: — Ne buyurursun, ben Allah yolunda öldürülürsem günahlarım affolunur mu? demiş. Resûlullah (Sallallahu Aleyhi ve Sellem): «Evet İhlâsla sabrettiğin halde, ileri gidip geri dönmeyerek Allah yolunda öldürülürsen!.. Yalnız borç müstesna! Gerçekten bunu bana Cibril aleyhisselâm söyledi.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4881,
			"arabicnumber": "1885.02",
			"text": "{…} Bize Ebû Bekir b. Ebî Şeybe ile Muhammed b. EI-Mösennâ rivayet ettiler. (Dedilerki): Bize Yezîd b. Hârûn rivayet etti. (Dediki): Bize Yahya (yânî İbni Saîd), Saîd b. Ebî Saîd El-Makburî'den, o da Abdullah b. Ebî Katâde'den, o da babasından naklen haber verdi. Şöyle demiş : Bir adam Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek: Ne buyurursun, ben Allah yolunda ödlürülürsem... dedi. Râvî, Leys'in hadîsi mânâsında rivayette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 4882,
			"arabicnumber": "1885.03",
			"text": "Bize Saîd b. Mansûr da rivayet etti. (Dediki): Bize Süfyân, Amr b. Dinar'dan, o da Muhammed b. Kays'dan naklen rivayet etti. H. Süfyan demiş ki: Bize Muhammed b. Aclân da, Muhammed b. Kays'dan, o da Abdullah b. Ebî Katâde'den, o da babasından, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen —biri diğerinden fazla ederek— rivayette bulundu ki, Nebi (Sallallahu Aleyhi ve Sellem) minberde iken bir adam gelerek : — Ne buyurursun, ben kılıcımla vurursam..,» demiş. Râvî hadîsi, Makburî'nin hadîsi gibi rivayet etmiştir. İzah 1885 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 4883,
			"arabicnumber": "1886.01",
			"text": "Bize Zekeriyyâ b. Yahya b. Salih Eİ-Misrî rivayet etti. (Dediki): Bize Mufaddal (yânî İbni Fadâle) Ayyaş'dan —Bu zât İhni Abbâs El-Kıtbânî'dir— o da Abdullah b. Yezîd Ebû Abdirrahmân EI-Hubulî'den, o da Abdullah b. Amr b. Âs'dan naklen rivayet etti ki, Resûllallah (Sallallahu Aleyhi ve Sellem) : «Şehidin her günahı affolunur. Yalnız borç müstesna! buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 4884,
			"arabicnumber": "1886.02",
			"text": "Bana Züheyr b. Harb da rivayet etti. (Dediki): Bize Abdullah b. Yezîd EI-Mukrî' rivayet etti. (Dediki): Bize Saîd b. Ebî Eyyûb rivayet etti. (Dediki): Bana Ayyaş b. Abbâs El-Kıtbânî, Ebû Abdirrahmân El-Hubulî'den, o da Abdullah b. Amr b. Âs'dan naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) : «Allah yolunda ölüm her şeye keffâret olur; yalnız borç müstesna!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 4885,
			"arabicnumber": "1887",
			"text": "Bize Yahya b. Yahya ile Ebû Bekir b. Ebî Şeybe ikisi birden Ebû Muâviye'den rivayet ettiler. H. Bize İshâk b. İbrahim de rivayet etti. (Dediki): Bize Cerîr ile İsâ b. Yûnus hep birden A'meş'den naklen haber verdiler. H. Bize Muhammed b. Abdillâh b. Numeyr dahî rivayet etti. Lâfız onundur. (Dediki): Bize Esbât ile Ebû Muâviye rivayet ettiler. (Dedilerki): Bize A'meş, Abdullah b. Mürra'dan, o da Mesrûk'dan naklen rivayet etti. Şöyle demiş: Abdullah'a —ki İbni Mes'ûd'dur— şu âyeti(n hükmünü) sorduk: Allah yolunda öldürülenleri asla ölü sanma! Bilâkis onlar Rabbleri katında diri olup rızıklanmaktadırlar. [Al-i İmran, 169] Abdullah şu cevabı verdi: Bakın buraya! Biz bunu (vakti ile Peygamber efendimize sorduk da : «Onların ruhları yeşil bir takım kuşların karnındadır. Onların Arş'a asılı kandilleri vardır. Cennette istedikleri yerde dolaşır; sonra bu kandillere inerler. Rabbleri onlardan öyle bir haberdâr olur ki!.. Ve kendilerine: Bir şey arzu edermisiniz? diye sorar. (Onlar) : — (Daha) ne isteyelim, işte cennette dilediğimiz yerde dolaşıyoruz! Derler. Bunu kendilerine üç defa tekrarlar. Sorulmaktan âzâde bırakılmayacaklarını görünce : —Yâ Rabb! Ruhlarımızı bedenlerimize iade buyurmanı dileriz! Tâ ki senin yolunda bîr defa daha öldürülelim! Derler. Ve bir hacetleri olmadığını görünce bırakılırlar.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 4886,
			"arabicnumber": "1888.01",
			"text": "Bize Mansur b. Ebî Müzâhim rivayet etti. (Dediki-: Bize Yahya b. Hamza, Muhammed b. Velîd Ez-Zübeydî'den, o da Zührîden, o da Atâ' b. Yezîd El-Leysî'den, o da Ebû Saîd-i Hudrî'den naklen rivayet ettiki, Bir adam Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek : — İnsanların hangisi efdaldir? diye sormuş da : «Allah yolunda malı ile canı ile mücâhede eden kimsedir.» buyurmuş. — Ondan sonra kim? demiş. «Kuytulardan bir kuytuda Rabbi olan Allah'a ibâdet eden ve insanları kendi şerrinden âzâde bırakan mü'mindir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 4887,
			"arabicnumber": "1888.02",
			"text": "Bize Abd b. Humeyd rivayet etti. (Dediki): Bize Abdürrazzâk haber verdi. (Dediki): Bize Ma'mer, Zührî'den, o da Atâ' b. Yezîd EI-Leysî'den, o da Ebû Saîd'den naklen haber verdi. Şöyle demiş : Bir adam: İnsanların en faziletlisi kimdir yâ Resûlâllah? Dedi. «Allah yolunda malı ile canı ile mücâhade eden mü'mindir.» buyurdu. — Ondan sonra kim? Diye sordu. «Sonra kuytulardan bîr kuytuya çekilmiş; Rabbine ibâdet eden ve insanları kendi şerrinden âzâde bırakan adamdır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 4888,
			"arabicnumber": "1888.03",
			"text": "Bize Abdulah b. Abdirrahmân Ed-Dârimî de rivayet etti. (Dediki): Bize Muhammed b. Yûsuf, Evzâî'den, o da İbni Şihâb'dan bu isnadla haber verdi. O : «Bir kuytuda bîr adam..» demiş; «sonra bir adam..» dememiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 4889,
			"arabicnumber": "1889.01",
			"text": "Bize Yahya fa. Yahya Et-Temîmî rivayet etti. (Dediki): Bize Abdülâzîz b. Ebî Hâzim, babasından, o da Ba'ce'den, o da Ebû Hureyre'den, o da Resûlullah {Sallallahu Aleyhi ve Sellem)'den onun şöyle buyurduğunu rivayet etti: «İnsanların en hayırlı yaşayanlarından biri: Allah yolunda atının dizginîn tutup onun sırtında uçan, düşman sesi veya düşmana hücum feryadı işittikçe o at üzerinde uçan, Öldürmeyi ve ölümü, ümîd edilen yerlerinde arayan adamdır. Yahud şu tepelerden bir tepenin üstünde veya şu vadilerden bir vâdînin içinde bir koyun sürücüğünün içinde bulunup namazını kılan, zekatını veren ve eceli gelinceye kadar Rabbına ibâdet eden, insanlara hayırdan başka bîr şey yapmayan kimsedir.»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 4890,
			"arabicnumber": "1889.02",
			"text": "Bize bu hadisi Kuteybe b. Saîd de, Abdülâzîz b, Ebî Hâzim ile Ya'kûb (yânî İbni Abdirrahmân El-Kaarî) den naklen rivayet etti. Her ikisi Ebû Hâzim'den bu isnadla bu hadîsin mislini rivayet et­mişlerdir. O Yahya'nın rivayeti hilâfına: «Ba'ce b. AbdulIâh b. Bedr'den» bir de: «Şu vadilerden bir vâdîde..» demiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 4891,
			"arabicnumber": "1889.03",
			"text": "Bize bu hadîsi Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb ve Ebû Kureyb de rivayet ettiler. (Dedilerki): Bize Vekî' Usâme b. Zeyd'den, o da Ba'ce b. AbdulIâh El Cühenî'den, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen Ebû Hâzim'in Ba'ce'den rivayet ettiği hadîs mânâsında rivayette bulunmuş ve : «Vadilerden bir vâdîde..» demiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 4892,
			"arabicnumber": "1890.01",
			"text": "Bize Muhammed b, Ebî Ömer El-Vekkî rivayet etti. (Dediki): Bize Süfyan, Ebu'z-Zinad'dan, o da A'rac'dan, o da Ebu Hureyre'den naklen rivayet etti ki, Resulullah (Sallallahu Aleyhi ve Sellem) : «Allah ki kimseye güler. Biri diğerini öldürür; ikisi de cennete girer.» buyurmuş. Ashab : — Nasıl ya Resulallah? Demişler. «Biri, Allah azze ve cellenin yolunda çarpışarak şehîd edilir; sonra Allah katilin tevbesini kabul eder de müslüman olur. Ve Allah azze ve cellenin yolunda çarpışarak şehîd düşer.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 4893,
			"arabicnumber": "1890.02",
			"text": "{…} Bize Ebu Bekir b, Ebî Şeybe ile Züheyr b. Harb ve Ebu Kureyb de rivayet ettiler. (Dedilerki): Bize Vekî', Süfyan'dan, o da Ebu'z-Zinad'dan bu isnadla bu hadîsin mislini rivayet etti",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 4894,
			"arabicnumber": "1890.03",
			"text": "Bize Muhammed b. Rafi' rivayet etti. (Dediki): Bize Abdürrazzak rivayet etti. (Dediki): Bize Ma'mer, Hemmam b. Münebbih'den naklen haber verdi. Hemmam: Bize Ebu Hureyre'nin Resulullah (Sallallahu Aleyhi ve Sellem)'den rivayet ettikleri budur: diyerek bir takım hadisler zikretmiştir. Onlardan biri de şudur: Resulullah (Sallallahu Aleyhi ve Sellem): «Allah iki kimseye güler. Bîri diğerini öldürür; ikisi de cennete girer!» buyurdu. Ashab : — Nasıl ya Resulallah: Dediler. «Bîri öldürülür de cennete girer; sonra Allah ötekinin tevbesinî kabul ederek onu İslama hidayet eyler. Sonra (o da) Allah yolunda mücahede ederek şehîd düşer!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 4895,
			"arabicnumber": "1891.01",
			"text": "Bize Yahya b. Eyyub ile Kuteybe ve Alî b. Hucr rivayet ettiler. (Dedilerki): Bize İsmail (yanî İbni Ca'fer) Ala'dan, o da babasından, o da Ebu Hureyre'den naklen rivayet etti ki, Resulullah (Sallalldhu Aleyhi ve Sellem) : «Bir kafir İle onun katili ebedîyyen cehennemde bir araya gelmez!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 4896,
			"arabicnumber": "1891.02",
			"text": "Bize Abdullah b. Avn El-Hilalî rivayet etti. (Dediki): Bize Ebu İshak El-Fezari ibrahim b. Muhammed, Süheyl b. Ebî Salih'den, o da babasından, o da Ebu Hureyre'den naklen rivayet etti. Şöyle demiş: Resulullah (Sallalldhu Aleyhi ve Sellem): «Cehennemde ikisi bir bîrine zarar verecek şekilde bir araya gelmezler.» buyurdu. — Kim onlar ya Resulaliah? Denildi. «Bir kafiri öldürüp sonra doğru yolu tutan mü'mini» cevabını verdi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 4897,
			"arabicnumber": "1892.01",
			"text": "Bize İshâk b. İbrahim El-Hanzalî rivayet etti. (Dediki): Bize Cerîr, A'meş'den, o da Ebû Amr Eş-Şeybânî'den, o da Ebû Mes'ûd El-Ensârî'den naklen haber verdi. Şöyle demiş: Bir adam yularlı bir dişi deve ile gelerek: Bu deve Allah yolunda (sadaka) dır., dedi. Bunun üzerine Resûlullah (Sallalldhu Aleyhi ve Sellem): «Onun sebebi ile kıyamet gününde, hepsi yularlı yedi yüz deve verilecek!» buyurdu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 4898,
			"arabicnumber": "1892.02",
			"text": "{…} Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dadiki): Bize Ebû Usâme, Zâide'den rivayet etti. H. Bana Bişr b Hâlid de rivayet etti. (Dediki):) Bize Muhammed (yânı İbni Ca'fer) rivayet etti. (Dediki): Bize Şu'be rivayet etti. Her iki râvî A'meş'den bu isnâdla rivayette bulunmuşlardır. izah: Ulemâdan bâzılarına göze bu hadîsden murâd: yedi yüz deve sevabıdır. Mâmâfîh zahirî mânâsı kasdedilmiş de olabilir. Bu takdirde o zâta cennette, her biri yularlı yedi yüz deve verilecek, onlar binerek istediği yerde gezecektir. Nitekim cennet atları hakkında da bu mânâda hadîs vardır. Nevevî bu ihtimâli daha kuvvetli görmektedir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 4899,
			"arabicnumber": "1893.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile Ebû Kureyb ve İbnİ Ebî Ömer rivayet ettiler. Lâfız Ebû Kureyb'indir. (Dedilerki): Bize Ebû Muâviye, A'meş'den, o da Ebû Amr Eş-Şeybânî'den, o da Ebû Mes'ûd El-Ensârî'den naklen rivayet etti. Şöyle demiş: Bir adam Nebi (Sallalldhu Aleyhi ve Sellem)'e gelerek: Benim hayvanım helak oldu; bana bir binek hayvanı ver! Dedi. Efendimiz: «Bende yok!» buyurdu. Bunun üzerine bir adam : — Yâ Resûlâllah! Ben ona binek hayvanı verecek kimseyi gösteririm! Dedi. Resûlullah (Sallalldhu Aleyhi ve Sellem) «Her kim bir hayra delâlet ederse ona da hayrı yapanın ecri kadar ecir verilir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 4900,
			"arabicnumber": "1893.02",
			"text": "{…} Bize İshâk b. İbrahim de rivayet etti. (Dediki): Bize İsa b. Yûnus haber verdi. H. Bana Bişr b. Hâlid dahî rivayet etti, (Dediki): Bize Muhammed b. Ca'fer, Şu'be'den naklen haber verdi. H. Bana Muhammed b. Râfi' de rivayet etti. (Dediki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize Süfyân haber verdi. Bu râvîlerin hepsi A'meş'den bu isnâdla rivayette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 4901,
			"arabicnumber": "1894",
			"text": "Bize Ebu Bekir b. Ebî Şeybe rivayet etti. (Dediki) Bize Affân rivayet etti. (Dediki): Bize Hammâd b. Seleme rivayet etti (Dediki): Bize Sabit, Enes b. Mâlik'den rivayet etti. H. Bana Ebû Bekir b. Nâfi' de rivayet etti. Lâfız onundur. (Dediki) Bize Behz rivayet etti. (Dediki): Bize Hammâd b. Seleme rivayet etti (Dediki): Bize Sabit, Enes b. Mâlik'den rivayet ettiki, Eslem (Kabilesin) den bir genç : — Yâ Resülâllah! Ben gaza etmek istiyorum ama yanımda hazırlık tutacak bîr şeyim yok Demiş. (Efendimiz) : «Filâna gît! Çünkü o hazırlık tutmuş da hastalanmıştı.» buyurmuş. O da giderek: Resûlullab (Sallallahu Aleyhi ve Sellem) sana selâm ediyor; ve yaptığın hazırlığı bana vermeni söylüyor! Demiş. O zât: —Ey filân hanım! Benim yaptığım hazırlığı buna ver! Ondan hiç bir şey saklama! Allah aşkına ondan bir şey saklama ki, sana onun hakkında bereket verilsin! Demiş",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 4902,
			"arabicnumber": "1895.01",
			"text": "Bize Saîd b. Mansûr ile Ebu't-Tâhir rivayet ettiler. (Ebu't-Tâhir: Bize İbni Vehb haber verdi., dedi. Said ise: Bize Abdullah b. Vehb rivayet etti., dedi.) (Demişki): Bana Amr b. Haris, Bükeyr b. Eşecc'den, o da Büsr b. Saîd\"den; o da Zeyd b. Hâlid El-Cüheni'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi ki: «Her kim Allah yolunda bir gâzîye hazırlık verirse o da gaza etti demektir. Ve her kîm gâzînin ailesi hakkında hayırla onun yerini tutarsa muhakkak gaza etti demektir!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 4903,
			"arabicnumber": "1895.02",
			"text": "Bize Ebu'r-Rabî' Ez-Zehrânî rivayet etti. (Dediki): Bize Yezîd (yânî İbni Zürey') rivayet etti. (Dediki): Bize Hüseyn El-Muallim rivayet etti. (Dediki): Bize Yahya b. Ebî Kesîr, Ebû Seleme b. Abdirrahman'dan, o da Büsr b. Saîd'den, o da Zeyd b. Hâlid El-Cühenî'den naklen rivayet etti. Şöyle demiş: Nebiyyullah (Sallallahu Aleyhi ve Sellem): «Her kim bir gâzîye hazırlık verirse o da gaza etti demektir; ve her kim bîr gâzînin ailesi hakkında onun yerini tutarsa muhakkak gaza etti demektir!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 4904,
			"arabicnumber": "1896.01",
			"text": "Bize Züheyr b. Harb rivayet etti. (Dedikî): Bize İsmâil b. Uleyye, Aliy b. Mübârek'ten rivayet etti. (Demişki): Bize Yahya b. Ebi Kesîr rivayet etti. (Dediki): Bana Mehrî'nin âzâdlısi Ebû Saîd, Ebû Saîd-i Hudrî'den naklen rivayet ettiki, Resûlullah (Sallallahu Aleyhi ve Sellem) Hüzeyî'in Benî Lahyân kabilesine bir müfreze göndermiş de : «Her iki kişiden biri ilerî atılsın! Sevabı aralarındadır!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 4907,
			"arabicnumber": "1896.04",
			"text": "Bize Saîd b. Mansûr da rivayet etti. (Dediki): Bize Abdullah b, Vehb rivayet etti. (Dediki): Bana Amr b. Haris, Yezîd b. Ebî Habîb.den o da Mehrî'nin âzâdlısı Yezîd b. Ebi Saîd'den, o da babasından, o da Ebû Saîd-i Hudrî'den naklen haber verdiki, Resulullah (Sallallahu Aleyhi ve Sellem) Beni Lâhyân'a müfreze göndermiş: «Her iki adamdan biri çıksın!» buyurmuş. Sonra oturana : «Çıkanın ailesi ve malı hakkında hanginiz hayırla yerini tutarsa çıkanın yarı ecri kadar ona verilir.» buyurmuşlar. İzah. Benî Lahyân veya Benî Lihyân; Hüzeyl kabilesinin bir koludur. O zaman henüz müslüman olmamışlardı. Nebi (Sallallahu Aleyhi ve Sellem) bunların üzerine gaza için asker göndermiş; ve giden gazilere: «Her kabileden yarrsr ceng'e çıksın!» diye ta'lmıât vermişti. Hadîsdeki «Her iki adamdan biri çıksın!» cümlesinden murâd budur. Sevabın aralarında paylaştırılması gazaya gidenin yerine kalan kimsenin onun ailesine hayırla muamele edip yardımda bulunduğuna göredir. Nitekim diğer rivayetlerde bu cihet tasrîh olunmuştur",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 4908,
			"arabicnumber": "1897.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Vekî' Süfyân'dan, o da Alkame b. Mersed'den, o da Süleyman b. Bürde'den, o da babasından naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) : «Mücâhîd kadınlarının (evlerinde) oturan erkeklere hürmeti, annelerinin hürmeti gibidir. (Evinde) oturanlardan bir erkek, mücahidlerden bîr adama ailesi hususunda halef olur da onlar hakkında kendisine hıyanet ederse kıyamet gününde durdurulur da onun amelînden dilediğini alır. Ne zannediyorsunuz!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 4909,
			"arabicnumber": "1897.02",
			"text": "{…} Bana Muhammed b. Râfi' de rivayet etti. (Dediki): Bize Yahya b. Adem rivayet etti. (Dediki): Bize Mis'ar, Alkame b. Mersed'den, o da İbni Büreyde'den, o da babasından naklen rivayet etti. Şöyle demiş: Buyurdular ki... (yânı Nebi (Sallallahu Aleyhi ve Sellem) Râvî, Sevrî'nin hadîsi manâsında rivayette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 4910,
			"arabicnumber": "1897.03",
			"text": "Bize bu hadîsi Saîd b. Mansûrda rivayet etti. (Dediki): Bize Süfyân, Ka'neb'den, o da Alkame b. Mersed'den bu İsnâdla rivayet etti. Ve: «Onun hasenatından dilediğini al, (Buyurulacak) dedi. Arkacığından Resûlullah (Sallallahu Aleyhi ve Sellem) bize bakarak: Ne zannediyorsunuz!» buyurdu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 4911,
			"arabicnumber": "1898.01",
			"text": "Bize Muhammed b. Müsennâ ile Muhammed b. Beşşâr rivayet ettiler. (Lâfız İbni Müsennâ'nındır.) (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Ebû îshâk'dan naklen rivayet ettiki, kendisi Berâ'ı: Mü'minlerden (evlerinde) oturanlarla Allah yolunda mücâhede edenler bir değildir. [Nisa, 95] âyeti hakkında şunları söylerken işitmiş: Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) Zeyd'e emir verdi. O da bu âyeti yazmak için bir kürek kemiği getirdi. Derken İbni Ümmi Mektûm ona körlüğünden şikâyet etti. Müteakiben: Mü'minlerden özürlü olanlardan başka (evlerinde) oturanlar bîr değildir. âyeti indi. Şır'be demiş ki : Bana Sa'd b. İbrahim de bir zâttan, o da Zeyd Sâbit'den naklen şu: Mü'minierden (evlerinde) oturanlar bîr değildir. âyeti hususunda Berâ hadîsinin mislini haber verdi. İbni Beşşâr kendi rivayetinde: Sa'd b. İbrahim, babasından, o bir zâttan, o da Zeyd b. Sabit'den naklen., dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 4912,
			"arabicnumber": "1898.02",
			"text": "Bize Ebû Kureyb de rivayet etti. (Dediki): Bize İbni Bişr, Mis'ar'dan rivayet etti. (Demişki): Bana Ebû İshâk, Berâ'dan rivâyet etti. Şöyle demiş : Mü'minierden (evlerinde) oturanlar bir değildir... âyeti inince İbni Ümmi Mektûm onunla konuştu. Bunun üzerine : Özür sahibi olanlardan başka!, âyeti indi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 4913,
			"arabicnumber": "1899",
			"text": "Bize Saîd b. Amr el-Eş'as ile Süveyd b. Saîd rivayet ettiler. Lâfız Saîd'indir. (Dediki): Bize Süfyân, Amr'dan naklen haber verdi. O da Câbir'i şunu söylerken işitmiş: Bir adam : — Ben öldürülürsem nerede olurum yâ Resulâllah? Dedi. «Cennette!» buyurdu. Bunun üzerine elinde bulunan hurmaları attı. Sonra öîdürülünceye kadar çarpıştı. Süveyd'in hadîsinde: Uhud harbi günü bir adam Nebi (Sallallahu Aleyhi ve Sellem)'e dedi ki...» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 4914,
			"arabicnumber": "1900",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Ebû Usâme, Zekeriyyâ'dan, o da Ebû İshâk'dan, o da Berâ'dan naklen rivayet etti. (Şöyle demiş) : Benî Nebît (kabilesin)'den bir zât Nebi (Sallallahu Aleyhi ve Sellem)'e geldi. H. Bize Ahmed b. Cenâb el-Missîsî de rivayet etti. (Dediki): Bize îsâ (yâni İbni Yûnus) Zekeriyyâ'dan, o da Ebû İshâk'dan, o da Berâ'dan naklen rivayet etti. Berâ' şöyle demiş : Ensar'ın bir kabilesi olan Benî Nebit'den bîr adam gelerek: Ben Allah'dan başka ilâh olmadığına; senin Allah'ın kulu ve Resulü olduğuna şehâdet ederim., dedi. Sonra ilerledi; ve öldürülünceye kadar harbetti. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): «Bu adam, az amel işledi ama çok ecir kazandı!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 4915,
			"arabicnumber": "1901",
			"text": "Bize Ebû Bekir b. Nadr b. Ebi'n-Nadr ile Harun b. Abdillâh, Muhammed b. Râfi' ve Abd b. Humeyd rivayet ettiler. Lâfızları birbirine yakındır. (Dedilerki): Bize' Hâşim b. Kaasim rivayet etti. (Dedikî): Bize Süleyman —ki, Ibni'l-Muğira'dır— Sâbit'den, o da Enes) b. Mâlik'den naklen rivayet etti. (ŞÖyle demiş) : Resûlullah (Sallallahu Aleyhi ve Sellem) Büseyse'yi, Ebû Süfyân'ın kervanı ne yaptığını görmek için casus olarak gönderdi. Büseyse evde ben ve Resûlullah (Sallallahu Aleyhi ve Sellem)'den başka kimse yokken geldi. (Râvî: Kadınlarından, birini istisna edip etmediğini bilmiyorum demiş.) Ve kendisine gördüğünü anlattı. Az sonra Resûlullah (Sallallahu Aleyhi ve Sellem) (dışarı) çıkarak konuştu ve şunları söyledi : «Bizim bîr isteğimiz var! Kimin hazır hayvanı varsa hemen bizimle birlikte binsin!..» «Bunun üzerine bazı kimseler Medine'nin yukarısında bulunan binek hayvanlarını almak için ondan izin istemeye başladılar. Fakat o: «Hayır! Yalnız hayvanı hazır oian (binecek)!» buyurdu. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem)'Ie ashabı yola çıktı. Ve müşriklerden önce Bedr'e vardılar. Müşrikler de geldi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Ben başında olmadıkça sakın sizden hiç bir kimse bir şeye ilerlemesin!» buyurdu. Derken müşrikler yaklaştı. Resûlullah (Sallallahu Aleyhi ve Sellem) de : «Kalkın! Genişliği göklerle yer kadar olan cennete!..» buyurdu. Umeyr b. Humâm El-Ensârî: — Yâ Resûlallah! Genişiği göklerle yer kadar olan cennet ha? Dedi. «Evet!» buyurdular. Umeryr : — Hele hele!.. Dedi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Seni hele hele demeye sevkeden nedir?» diye sordu. Umeyr: — Hayır vallahi yâ Resûlâllah! Cennet ehlinden olmamı ümîd etmekten başka bir şey yok! dedi. «Öyle ise sen onun ehlindensin!» buyurdular. Bunun üzerine Umeyr torbasından birkaç hurma çıkararak onlardan yemeye başladı. Sonra şunları söyledi : —Eğer ben bu hurmalarımı yiyinceye kadar yaşarsam bu gerçekten uzun bir hayâttır!.. Hemen elindeki hurmaları attı. Sonra öldürülünceye kadar müşriklerle harbetti",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 4916,
			"arabicnumber": "1902",
			"text": "Bize Yahya b .Yahya Et-Temîmî ile Kuteybe b. Saîd rivayet ettiler. Lâfız Yahya'nındır. (Kuteybe: Haddesena tâbirini kullandı.) Yahya: Bize Ca'fer b. Süleyman, Ebû Imrân El-Cevnî'den, o da Ebû Bekir b. Abdillâh b. Kays'dan, o da babasından naklen haber verdi., dedi. Babası şöyie demiş: Ben babamı düşman karşısında iken şunu söylerken dinledim: Resûlullah (Sollallahu Aleyhi ve Sellem) : «Muhakkak cennet kapıları kılıçların gölgeleri altındadır.» buyurdu. Bunun üzerine pejmurde kılıklı bir adam ayağa kalkarak: — Yâ Ebâ Mûsâ! Bunu Resûlullah (Sallallahu Aleyhi ve Sellem) söylerken sen mi işittin? Dedi. Ebû Mûsâ : — Evet! Cevabını verdi. Derken arkadaşlarına dönerek : — Sizlere selâm eylerim! Dedi. Sonra kılıcının kınını kırarak attı. Sonra kılıcı ile düşmana yürüyerek öldürülünceye kadar onunla vurdu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 4917,
			"arabicnumber": "677.11",
			"text": "Bize Muhammed b. Hatim rivayet etti. (Dediki): Bize Affân rivayet etti. (Dediki): Bize Hammâd rivayet etti. (Dediki): Bize Sabit, Enes b. Mâlik'den naklen haber verdi. Enes şöyle demiş : Bir takım insanlar Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: Bize Kur'ân ve sünneti öğretecek adamlar gönder! Dediler. O da kendilerine Ensardan Kurrâ' eenilen ve içlerinde dayım Haram da bulunan yetmiş kişi gönderdi. Bunlar Kur'ân okuyor; geceleri ders alıp öğreniyor, gündüzleri de su getirip mescide koyuyor; odun toplayıp satıyor; onunla Sofa halkına ve fakirlere yiyecek satın alıyorlardı. İşte bu zevatı Peygamber (Sallallahu Aleyhi ve Sellem) onlara gönderdi. Ama daha yerlerine varmadan önlerine çıkarak onları öldürdüler. Onlar da : — Allahım! Biz’den Nebiimize ilet ki, biz sana kavuştuk. Ve senden razı olduk; sen de bizden razı oldun! Dediler. Bir adam da Enes'in dayısı Harâm'a arkasından gelerek onu okla yaraladı: hattâ oku geçirdi. Bunun üzerine Haram: — Kâ'be'nin Rabbine yemin ederim ki muvaffak oldum! Dedi. Resûlullah (Sallallahu Aleyhi ve Sellem) de ashabına : «Şüphesiz ki dîn kardeşleriniz öldürüldüler. Hem de şunu söylediler: Allahım! Bizden Nebiimize ilet ki, biz sana kavuştuk: ve senden razı olduk. Sen de bizden razı oldun!» buyurdular. Bu hadis’in Buhari rivayeti için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 4918,
			"arabicnumber": "1903",
			"text": "Bana Muhammed b. Hatim de rivayet elti. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Süleyman b. Muğira, Sâbit'den rivayet etti. (Demişki): Enes şunları söyledi: Bana da kendi adı verilen amcam Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte Bedir'de bulunmadığını söyledi. Bu ona güç gelmiş. (Dediki): Resûlullah (Sallallahu Aleyhi ve Sellem)'in bulunduğu ilk harbde bulunmadım. Allah bana bundan sonra Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte bir harb gösterdi ise işte ne yaptığımı Allah görüyor!.. Başkasını söylemekten çekindi. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte Uhud gününde bulundu. Karşısına Sa'd b. Muâz çıktı. Enes ona : — Yâ Ebâ Amr, nereye? Ah (şu) cennetin kokusu!.. Onu Uhud'un yanında buluyorum! Dedi. Arkacığından küffarla harbetti. Nihayet öldürüldü. Ve cesedinde kimi vurmadan, kimi yaralama ve ok izinden seksen küsur yara bulundu. Kız kardeşi —halam— Rubeyyi' binti Nadr : — Kardeşimi ancak parmak uçlarından tanıyabildim! Dedi. Ve şu âyet indi: «Mu'minlerden öyle adamlar kî, Allah'a verdikleri sözde sâdık kaldılar. Onlardan bazısı vefat etti; bazısı da bekliyor. Ama hiç bir tebdil yapmadılar, [Ahzab,23]» Bu âyetin onunla arkadaşları hakkında indiğini sanırlardı. izah: Bu Hadîsin benzerini Buhârî «Cihâd» bahsinde tahrîc etmiştir. Hadîsin râvîsi Enes b. Mâlik, yararlıklarından bahsettiği amcası da Enes b. Nadr'dır. Hadîsin muhtelif rivayetlerinden anlaşılıyor ki, Hz. Enes b. Nadr Nebi (Sallallahu Aleyhi ve Sellem)'in ile iştirak ettiği gazada yâni Bedîr'de bulunamamasına çok üzülmüş ve: «Yâ Resûlâllah, senin müşriklerle yaptığın ilk cenkte bulunamadım ama Allah bana müşriklerle cengi nasib ederse ne yapacağımı görecektir!» demiş. Bilâhare kendisine Uhud harbî nasîb olmuş. Orada müslümanların bozulduğunu görünce: «Allahım, bunların yaptıklarından dolayı senden özür dilerim. Bu müşriklerin yaptıklarından da sana berâet arzederim!» demiş. Bu arada karşısına bozgun halde Sa'd b. Muâz çıkmış. Evs kabilesinin reîsi olan bu zât o gün Nebi (Sallallahu Aleyhi ve Sellem) ile beraber yerinden sabit kalanlardanmış. Enes (Radiyallahu anh) ona Müslîmin rivayetinde: «nereye?» Buhâri'nin rivayetinde: «Yâ Sa'd b. Muâz! Cenneti! (dilerim) Yemin olsun onun kokusunu Uhud'un yanında buluyorum.» diye seslenmiş. Ve harbe atılmış... Hz. Sa'd: «Yâ Resûlâllah! Ben onun yaptığını anlatmaya kaadir değilim demiş. «Onu (yâni cennetin kokusunu) Uhud dağının yanında buluyorum!» sözü hakkında ibni Battal ve başkaları şunları söylemişlerdir: «Bu sözün hakikat olması muhtemeldir; ve Hz. Enes hakîkaten cennetin kokusunu duymuştur. Yahud güzel bir koku hissetmiş de onu cennet kokusu diye anmıştır, Şehidler için hazırlanan cenneti gözünün önüne getirerek onun burada savaş meydanında olduğunu tasavvur etmiş olması da caizdir. Bu takdirde mânâ şöyle olur: «Ben pekâlâ biliyorum ki cennet bu yerde kazanılır. Bundan dolayı ona can atıyorum.» Hz, Enes'in tanınmaz hale gelmesi, aldığı seksen küsur yaradan ve müşrikler tarafından ağzı, burnu ve sair uzuvları kesildiğîndendir. Hadîs-i şerif: Enes b. Nadr (Radiyallahû anhj'ın faziletine ve cihadda bezli cân etmenin caiz olduğuna delildir)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 4919,
			"arabicnumber": "1904.01",
			"text": "Bize Muhammed b. El-Müsennâ ile ibni Beşşâr rivayet ettiler. Lâfız ibni'l-Müsennâ'nındır. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Amr b. Mürra'dan rivayet etti. (Demişki): Ebû Vail'i dinledim. (Dediki): Bize Ebû Mûse'l-Eş'arî rivayet etti kî, Bedevi bir adam Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek : — Yâ Resûlâllah! Adam (var) ganimet için çarpışıyor. Adam (var) anılsın diye çarpışıyor ve adam (var) mevk görülsün diye çarpışıyor. Aceb Allah yolunda çarpışan kim? Dedi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Kim kelimetullah yüce olsun diye çarpışırsa işte o Allah yolundadır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 4920,
			"arabicnumber": "1904.02",
			"text": "Bize Ebû Bekir b. Ebî Şeybe ile ibni Numeyr, ishâk b. ibrahim ve Muhammed b. Alâ' rivayet ettiler. (îshâk: Bize haber verdi) tâbirini kullandı. Ötekiler: Bize Ebû Muâviye rivayet etti. (Dediler.) O da A'nıeş'den, o da Şakîk'dan, o da Ebû Musa'dan nakletmiş. Ebû Mûsâ şöyle demiş : Resûlullah (Sallallahu Aleyhi ve Sellem)'e cesurluk, hamiyyet ve riya için çarpışan kimsenin hükmü soruldu. Bunların hangisi Allah yolundadır? (denildi.) Resûlullah (Sallallahu Aleyhi ve Sellem) de : «Kim yalnız kelimetullah yüce olsun diye çarpışırsa işte o Allah yolundadır.» buyurdu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 4921,
			"arabicnumber": "1904.03",
			"text": "{…} Bize bu hadisi ishâk b. ibrahim de rivayet etti. (Dedikî): Bize isâ b. Yûnus haber verdi. (Dediki): Bize A'meş, Şakik'dan, o da Ebû Musa'dan naklen rivayet etti. (Şöyle demiş) : Biz Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek : — Yâ Resûlâllah! Bizden bir adam şecaat için çarpışıyor... dedik... Râvî yukarki hadîsin mislini anlatmıştır",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 4922,
			"arabicnumber": "1904.04",
			"text": "Bize yine ishâk b. ibrahim rivayet etti. (Dediki): Bize Cerir, Mansur'dan, o da Ebû Vâil'den, o da Ebû Vâil'den, o da Ebû Mûse'l-Eş'ari'den naklen haber verdi ki, Bir adam Resûlullah (Sallallahu Aleyhi ve Sellem)'e Allah Azze ve Celle'nin yolunda çarpışmayı sormuş; ve: Bazı kimse öfkesinden çarpışıyor; bazısı hamiyyet için!., demiş. Bunun üzerine Efendimiz başını kaldırmış —başını sadece o ayakta olduğu için kaldırrrnş— ve : «Kim yalnız kelimetullah yüce olsun diye çarpışırsa işte o Allah yolundadır.» buyurmuşlar. izah: Bu hadisi bütün «Sahih» sahibleri «Cihâd» bahsinde muhtelif râvîlerden tahrîc etmişlerdir. Buhârî ayrıca «ilim» ve «Humüs»'de de rivayet etmiştir. Tirmizi: «Bu hadîs hasen sahihtir» demiştir. Hamiyyeti, Cevheri: arlanmak ve izzeti nefis manasına almış; bazıları: haramdan korunmaktır; bir takımları da izzeti nefis, gayret ve aşireti müdafaadır., diye izah etmişlerdir. Kelimetulîah'dan murad: islama da'vettir. Lâ ilahe illallah kelimesidir diyenler de olmuştur. Cümlenin «hüve» zamiri ile başlaması ihtisas bildirir. Bineanaleyh dünyalık için çarpışan kimse hakîkatta Allah yolunda cihâd etmiş olmaz. Gazilere verilen sevap ona verilmez. Fakat bir kimse i'lây-ı kelimetuîlahı düşünmeden sırf cennetlik olmak için cenk etse hükmen Allah yolunda gaza etmiş sayılır. Zîra maksad birdir; o da Allahm rızasını kazanmaktır. Onun içindir ki Nebi (Sallallahu Aleyhi ve Sellem) Bedir gazasında: «Haydin cennete!..» diye seslenmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 4923,
			"arabicnumber": "1905.01",
			"text": "Bize Yahya b. Habîb el-Hârisî rivayet etti. (Dediki): Bize Hâlid b. Haris rivayet etti. (Dediki): Bize îbni Cüreyc rivayet etti. (Dediki): Bana Yûnus b. Yusuf, Süleyman b. Yesân'dan rivayet etti. (Şöyle demiş): Halk Ebû Hureyre'nin yanından dağıldılar. Bunun üzerine Şamlıların Nâtil'i ona şunu söyledi: — Yâ şeyh! Bize Resûlullah (Sallallahu Aleyhi ve Sellem)'den işittiğin bir hadîs söyle! Ebû Hureyre : — Peki! Dedi. Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken işittim : «Kıyamet gününde insanların, üzerine ilk hüküm verilecek olanı şehîd edilen bir adamdır. Bu adam getirilerek ona Allah nî'metlerini ta'rîf edecek, o da onları tanıyacaktır. — Bu ni'metler hakkında ne yaptın? diye soracak; şehid : — Senin uğrunda çarpıştım. Nihayet şehîd edildim! Diyecektir. Hak Teâlâ : — Yalan söyledin! Lâkin sen cesur denilmek için çarpıştın. Gerçekten denildi de! Buyuracak. Sonra onun hakkında emir verecek ye yüz üstü sürüklenecek, nihayet cehenneme atılacaktır. Bir de ilmi öğrenip öğreten ve Kur'ânı okuyan bir adamdır. Bu da getirilerek kendisine ni'metlerinî ta'rîf edecek, o da onları tanıyacaktır. — Bunlar hakkında ne yaptın? Diye soracak. O adam : — ilmi öğrendim ve öğrettim. Senin rizân için Kur'ânı da okudum! Diyecek. Teâlâ : — Yalan söyledin! Lâkin sen ilmi âlim denilsin dîye öğrendin; Kur'ânı da o kaari'dir denilsin diye okudun; gerçekten denildi del Buyuracak. Sonra onun hakkında emir verecek ve yüzü üstü sürüklenecek; nihayet cehenneme atılacaktır. Bir de Allah'ın, yakasını genişlettiği ve kendisine malın her çeşidinden verdiği adamdır. Bu da getirilerek ona ni'metlerini ta'rîf edecek; o da onları tanıyacaktır. — Bunlar hakkında ne yaptın? Dîye soracak. O adam : — Uğrunda mal sarf edilmesini dilediğin hiç bir yol bırakmadım. Mutlaka senin için sarfettim! Diyecek. Teâlâ Hazretleri : — Yalan söyiedîn! Lâkin sen, o cömerttir desinler diye yaptın. Gerçekten denildi de! Buyuracak. Sonra onun hakkında emir verecek ve yüzü üstü sürüklenecek. Sonra cehenneme atılacaktır.»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 4924,
			"arabicnumber": "1905.02",
			"text": "{…} Bu hadîsi bize Alî b. Haşrem de rivayet elti. (Dediki): Bize Haccâc (yânı îbni Muhammed), ibnü Cüreyc'den naklen haber verdi. (Demişki): Bana Yûnus b. Yusuf, Süleyman b. Yesâr'dan rivayet etti. (Demişki): Halk Ebû Hureyre'nin yanından dağıldı da Nâtil-i Şâmî ona şunu söyledi... Ve hadîsi Hâlid b. Hâlis hadîsi gibi hikâye etmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 4925,
			"arabicnumber": "1906.01",
			"text": "Bize Abd b. Humeyd rivayet etti. (Dediki}: Bize Abdullah b. Yezîd Ebû Abdirrahmân rivayet etti. (Dediki): Bize Hayve b. Şureyh, Ebû Hânî'den. o da Ebû Abdirrahmân el-Hubulî'den, o da Abdullah b. Amr'dan naklen rivayet etti ki. ResûluIIah (Sallallahu Aleyhi ve Sellem): «Allah yolunda gaza ederek ganimet alan hiç bir ordu yoktur ki, âhirerte alacakları ecirlerinin üçte ikisini peşin almış olmasınlar. Kendileri için üçte bir kalır. Ganimet almazlarsa ecirleri kendilerine tamam verilir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 4926,
			"arabicnumber": "1906.02",
			"text": "Bana Muhammed b. Sehl et-Temîmî rivayet etti. (Dediki): Bize ibni Ebî Meryem rivayet etti. (Dediki): Bize Nâfi' b. Yezîd haber verdi. (Dediki): Bana Ebû Hâni' rivayet etti. (Dediki): Bana Ebû Abdirrahman el-Hubulî, Abdullah b. Amr'dan rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Gaza ederek ganîmet alan ve selâmette kalan hiç bîr ordu veya seriyye yoktur ki; ecirlerinin üçte ikisini peşin almış olmasınlar. Ve ganimet almadan gaza edip ele geçen hiç bir ordu veya serîyye yoktur ki, ecirleri tamam verilmesin!» buyurdular. izah: Seriyye: en çok dört yüz kişiden meydana gelen bir kıt'a askerdir. ihfâk: bir sey ele geçirememek, boş elle dönmek demektir. Hadîsin mânâsı şudur: Gaziler esîr edilmeden selâmetle döner yahud ganimet alırlarsa ecirleri esîr edilmeden selâmetle döner yahud ganimet alırlarsa ecirleri esîr düşenlerin yahut ganimet almayanların ecirlerinden az olur. Ganimet, gazadan elde edilecek ecrin mukabili bir cüz'dür. Gâzîler ganimet aldılarmı o gazadan dolayı kendilerine verilecek ecrin üçte ikisini peşin almış olurlar. Yani ganimet, ecir cümlesindendir. Sahih ve meşhur hadîslere muvafık olan budur. Nevevi: «Hadîsin zahirî manâsı budur; buna muhalif tek bir sahih ve sarih hadîs rivayet edilmemiştir. Binaenaleyh bu hadîsi bizim verdiğimiz bu manâya hamletmek teayyün eder!» diyor. Kaadî iyâd bu hadîsin tefsirinde bir takım fâsid kaviller hikâye ettikten sonra aynen bu mânâyı kabul etmiştir. Onun hikâye ettiği kavillerden biri şudur: «Bu hadis sahih değildir. Ganimet almakla gazilerin sevabı azalmaz. Nitekim Bedir gazilerinin sevabı ganimet aldılar diye azalmamıştır...» Bâzıları râvîlerden Ebû Hâni'in râvisini meçhul kabul etmişlerdir. Nevevî bu kavillerin fâsid olduğunu beyân etmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 4927,
			"arabicnumber": "1907.01",
			"text": "Bize Abdullah b. Mesleme b. Ka'neb rivayet etti. (Dediki): Bize Mâlik, Yahya b. Saîd, Muhammed b. ibrahim'den, o da AIkame b. Vakkas'dan, o da Ömer b. Hattâb'dan naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem): «Ameller ancak niyete göredir. Herkese ancak niyet ettiği şey yardır. Her kimin hicreti Allah'a ve Resulüne idi ise onun hicreti Allah ve Resûlünedir. Kimin hicreti elde edeceği bir dünya yshud evleneceği bir kadın içinse, onun hicreti de hicret ettiğinedir.» buyurdu. {…} Bize Muhammed b. Rumh b. Muhacir rivayet etti. (Dediki): Bize Leys haber verdi. H. Bize Ebû'r-Rabî' el-Atekî de rivayet etti. (Dediki); Bize Hammâd b. Zeyd rivayet etti. H. Bize Muhammed b. Müsennâ dahi rivayet etti. (Dediki): Bize Abdülvehhab (yânî Sekafî) rivayet etti. H. Bize ishâk b. ibrahim de rivayet etti. (Dediki): Bize Ebû Hâlid el-Ahmar Süleyman b. Hayyân haber verdi. H. Bize Muhammed b. Abdillâh b. Numeyr dahî rivayet etti. (Dediki): Bize Hafs (yânî ibni Gıyâs) ile Yezîd b. Hârûn rivayet ettiler. H. Bize Muhammed b. Alâ'el-Hemdânî de rivayet etti. (Dediki): Bize ibnü'l-Mübârek rivayet etti. H. Bize ibnü Ebî Ömer de rivayet etti. (Dediki): Bize Süfyân rivayet etti. Bu râvilerin hepsi Yahya b. Saîd'den, Mâlik'in isnadı ve onun hadisi mânâsında rivayet etmişlerdir. Süfyân'ın hadîsinde: «Ömer b. Hattâb'i minber üzerinde Nebi (Sallallahu Aleyhi ve Sellem) 'den naklen rivayet ederken işittim.» ibaresi vardır. izah: Bu hadisi Buhârî «îmân, Eymân, Itk, Hicret, Nikâh» ve «Terkül-hiyel» bahislerinde; Ebû Dâvûd «Talâk» da; Tirmizî «Hudûd»da, «Nesâi «imân, Taharet, Itâk» ve «Talâk» bahislerinde; ibnı Mâce «Zühd» de; imam Ahmed «Müsned»inde muhtelif râvîlerden tahrîc etmişlerdir. Mu'temed eser sahiplerinden onu kitabına almayan yalnız imâm Mâlik olmuştur. Allâme Aynî: «Bu hadîs bir i'tibârla ferd garîb, başka bir i'tibarla da meşhurdur. Ama bâzılarının dediği gibi mütevâür değildir. Zira yalnız Yahya b. Saîd'den nakledilmiştir.» diyor. Şeyh Kutbuddîn dahî: «Bu hadîs, bir çok tarîkleri bulunmakla beraber haber-i vahidlerden sayıldığı söylenir Mütevâür değildir; çünkü onun şartı bunda yoktur. Sahih olan şudur ki, onu Nebi (Sallallahu Aleyhi ve Sellem)'dan Hz. Ömer'den başka rivayet eden olmamıştır, Ömer'den de yalnız Alkame, Alkameden yalnız Muhammed b. ibrahim, Muhammed'den yalnız Yahya b. Said el-Ensârî rivayet etmiş; ondan sonra yaygınlaşmıştır. Şu halde hadis sonuna nisbetle meşhur; evveline nisbetle garibtir. Ama sahîh olduğunda ve mevkiinin büyüklüğünde ittifak edilmiştir.» demiştir. Ebû'l-Fütûh et-Tâî'nin beyanına göre Yahya b. Saîd'den onu iki yüzden fazla râvî nakletmiştir. Ancak müsned olarak yalnız bu tarîkden sahîh olduğunda ulema müttefiktir. Bezzâr, îbni Sükuti ve imâm Ebû Abdillâh Muhammed b. Hattâb gibi zevat dahî bu hadîsi Nebi (Sallallahu Aleyhi ve Sellem)'den Hz. Ömer'den başka rivayet eden olmadığını söyîemişlerse de hakîkatta onu Ömer (Radiyallahû anh)'dan başka onyedi sahabî rivayet etmiştir. îbni Mendeh şöyle diyor: «Bu hadîsi Ömer'den başka, Nebi (Sallallahu Aleyhi ve Sellem)'den: Sa'd b. Ebî Vakkaas, Alî b. Ebî Tâlib, Ebû Saîdi Hudri, Abdullah b. Mes'ûd, Abdullah b. Ömer, Enes, ibni Abbâs, Muâviye, Ebû Hureyre, Ubâde b. Samit, Utbe b. Abdil eslemi, Hezâl b. Süveyd, Utbe, b. Âmir, Câbir b. AbdiIlâh, Ebû Zerr, Utbe b. Münzir ve Ukbe b. Müslim (Radiyallahû anhûm) rivayet etmişlerdir...» Yine îbni Mendeh'in beyanına göre râvileri de münferid değil, hepsinin mütabi'leri vardır. Binaenaleyh hadîs şâzz değildir. Bâzıları şâzzı: «yalnız bir isnadı olup sika olsun olmasın râvîsinin münferid kaldığı hadîsdir.» diye ta'rif etmişse de bu ta'rîfe ı'tirâz olunmuş: «Hz. Ömer hadîsi ve emsali ile bilicmâ amel olunur. O sıhhat mertebelerinin en yükseğindedir. Dînin temellerinden bir temeldir.» denilmiştir, Halbuki imam Şafiî ile Hicaz uleması şâzzı şoyîe ta'rîf etmişlerdir:«Şâzz, sika râvi'nin başkalarına muhalif olarak rivayet ettiği hadîsdir.» yoksa başkalarının rivayet etmediğini rivayet etmek değildir. Bu hadîs ile emsalinde muhalefet diye bir şey yoktur. Bilâkis onun mânâsını doğrulayan Kitâb ve sünnetten bîr çok şahidleri vardır. Evet, hadîs-i şerifin sahîh olduğunda şüphe yoktur. Çünkü onu bu ilmin imamlarından Yahya b. Saîd el-Ensarî rivayet etmiştir. Ondan ise her biri bu ümmetin hafız ve imamlarından 250 kişi rivayette bulunmuşlardır. îbni Mendeh'in «el-Müstahrec»'inde bu sayı üç yüzün üzerine çıkarılmış; Hafız Ebû Mûsâ ve Şeyhülislâm Ebû îsmâîl el-Herevî gibi bâzı zevat ise Yahya'dan onu yediyüz kişinin rivayet ettiğini söyîemişlerdir. Müslüman, uleması bu hadîsin dinde pek büyük bir mevkii olduğuna ittifak etmişlerdir. imam-ı Şafii ile diğer bazı alimler; «Bu hadîs islâmın üçte biridir.» demişlerdir. îmam-ı Şafii fıkhın yetmiş bâbının bu hadîse racî olduğunu söylemiştir. Bazılarına göre islâm'ın dörtte biridir, Ebû Dâvud Şöyle diyor: «Nebi (Sallallahu Aleyhi ve Sellem)'den beş yü zbin Hadis yazdım. Bunlardan ahkam hususunda dört bin sekîz yüz hadîs seçtim. Zühd ve takvaya dair hadisler gelince: Onları kitabıma almadım. Bir insana bunlardan dini için dört tanesi yeter. 1) Ameller niyetlere göredir, 2) Helal ve haram beyan edilmiştir, 3) Kişinin güzel müslüman olması işine girmeyen şeyleri bırakmakladır, Ve 4) Mu'min kendisi için razı olduğu şeyi din kardeşi içinde istemedikçe, tam mu'min olmaz, hadisleri.» Hadîs-i Şerif niyeti tazammun ettiği için islâm'ın üçte birine şâmildir. Çünkü islam kavil, fiil ve amelden ibarettir. imam-ı Buhari kitabına bu hadisle başlamış bir çok ulema da bu hususda onun yolunu tutmuşlardır. Hafız Îbn-i Mehdi: «Kitap tasnifi etmek isteyen bu hadisle işe başlasın. Ben bir kitap tasnif etsem onun her babına bu hadisle başlardım» demiştir. Hadîsi Şerif de hasr ve kasra delalet eden «innemâ» edatı iki defa tekrarlanmıştır. Bunun faydası, hadis de zikredileni isbat, edilmeyeni nefiydir. Mânâ şudur: Bütün ameller ancak niyete göre hesabedilir niyetsiz amel hesaba konmaz. Bir de ikinci «innemâ» ile yapılacak amelin tayini şart olduğuna işaret buyrulmuştur. Meselâ: Nafile namazı kılmak isteyen bir kimsenin hangi namazı kılacağını belirtmesi gerekir. Bahsedilen hicret meselesine gelince: Bir kimse Allah rızası için yerini yurdunu terk ederek başka diyara göç ederse, bu hicretin sevabını alır. Evlenmek veya her hangi dünyevî bir menfaat için hicret ederse kazancı yalnız niyet ettiği şeydir. Âhirette bu hicretin hiçbir sevabını göremez. Hadisde dünya menfaati ile birlikte kadının da zikredilmesi îki ihtimalden hali değildir. Birinci ihtimale göre; hadis-î şerif evlenme hususunda varid olmuştur. Bir zat Ümm-ü Kays isminde ki bir kadınla evlenmek için kadının yaşadığı yere hicret etmiş. Evlendikten sonra artık o adama, Ummü Kays'ın muhaciri denilmiştir. îkinci ihtimale göre kadının zikredilmesi sırf bu iş için hicret etmekten sakındırmak içindir. Binaenaleyh edebiyat nazarında cümle ehemmiyetinden dolayı âmdan sonra hâssı zikr kabilindendir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 4928,
			"arabicnumber": "1907.02",
			"text": "(Bize Muhammed b. Rumh b. Muhacir rivâyet etti. ki): Bize Leys haber verdi. H. Ebû'r-Rabî' el-Atekî de rivâyet etti. ki); Bize Hammâd b. Zeyd rivâyet etti. H. Muhammed b. Müsennâ dahi rivâyet etti. ki): Bize Abdülvehhab (yânî Sekafî) rivâyet etti. H. İshâk b. İbrahim de rivâyet etti. ki): Bize Ebû Hâlid el-Ahmar Süleyman b. Hayyân haber verdi. H. Muhammed b. Abdillâh b. Nümeyr dahi rivâyet etti. ki): Bize Hafs (yânî İbn Gıyâs) ile Yezîd b. Hârûn rivâyet ettiler. H. Muhammed b. Alâ'el-Hemdânî de rivâyet etti. ki): Bize İbn'l-Mübârek rivâyet etti. H. İbn Ebî Ömer de rivâyet etti. ki): Bize Süfyân rivâyet etti. Bu râvilerin hepsi Yahya b. Saîd'den, Mâlik'in isnadı ve onun hadisi mânâsında rivâyet etmişlerdir. hadîsinde: «Ömer b. Hattâb'i minber üzerinde Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet ederken işittim.» ibaresi vardır. hadîsi Buhârî «îmân, Eymân, Itk, Hicret, Nikâh» ve «Terkül-hiyel» bahislerinde; Ebû Dâvûd «Talâk» da; Tirmizî «Hudûd»da, «Nesâî «İmân, Taharet, Itâk» ve «Talâk» bahislerinde; İbn Mâce «Zühd» de; İmâm Ahmed «Müsned»’inde muhtelif râvîlerden tahrîc etmişlerdir. Mu'temed eser sahiplerinden onu kitabına almayan yalnız imâm Mâlik olmuştur. Aynî: «Bu hadîs bir i'tibârîa ferd garîb, başka bir i'tibarla da meşhurdur. Ama bâzılarının dediği gibi mütevâür değildir. Zira yalnız Yahya b. Saîd'den nakledilmiştir.» diyor. Şeyh Kutbuddîn dahi: «Bu hadîs, bir çok tarîkleri bulunmakla beraber haber-i vahidlerden sayıldığı söylenir Mütevâür değildir; çünkü onun şartı bunda yoktur. Sahih olan şudur ki, onu Peygamber (sallallahü aleyhi ve sellem)'dan Hazret-i Ömer'den başka rivâyet eden olmamıştır, ömer-den de yalnız Alkame, Alkameden yalnız Muhammed b. İbrahim, Muhammed'den yalnız Yahya b. Said el-Ensârî rivâyet etmiş; ondan sonra yaygınlaşmıştır. Şu halde hadis sonuna nisbetle meşhur; evveline nisbetle garibtir. Ama sahîh olduğunda ve mevkiinin büyüklüğünde ittifak edilmiştir.» demiştir. Ebû’l -Fütûh et-Tâî'nin beyanına göre Yahya b. Saîd'den onu iki yüzden fazla râvî nakletmiştir. Ancak müsned olarak yalnız bu tarîkden sahîh olduğunda ulema müttefiktir. Bezzâr, İbn Sükuti ve imâm Ebû Abdillâh Muhammed b. Hattâb gibi zevat dahi bu hadîsi Peygamber (sallallahü aleyhi ve sellem)'den Hazret-i Ömer'den başka rivâyet eden olmadığını söylemişlerse de hakîkatta onu\" Ömer (radıyallahü anhûma)'dan başka on yedi sahabî rivâyet etmiştir. İbn Mendeh şöyle diyor: «Bu hadîsi Ömer'den başka, Peygamber (sallallahü aleyhi ve sellem)'âen: Sa'd b. Ebî Vakkaas, Alî b. Ebî Tâlib, Ebû Saîdi Hudri, Abdullah b. Mes'ûd, Abdullah b. Ömer, Enes, İbn Abbâs, Muâviye, Ebû Hüreyre, Habâde b. Samit, Utbe b. Abdileslemi, Hezâl b. Süveyd, Utbe, b. Âmir, Câbir b. Abdillâh, Ebû Zerr, Utbe b. Münzir ve Ukbe b. Müslim (radıyallahü anhûm) rivâyet etmişlerdir...» İbn Mendeh'in beyanına göre râvileri de münferid değil, hepsinin mütabi'leri vardır. Binaenaleyh hadîs şâzz değildir. Bazıları şâzzı: «yalnız bir isnadı olup sika olsun olmasın râvîsinin münferid kaldığı hadîsdir.» diye ta'rif etmişse de bu ta'rîfe ı'tirâz olunmuş: «Hazret-i Ömer hadîsi ve emsali ile bilicmâ' amel olunur. O sıhhat mertebelerinin en yük-seğindedir. Dînin temellerinden bir temeldir.» denilmiştir, Halbuki İmâm Şafiî ile Hicaz uleması şâzzı şoyîe ta'rîf etmişlerdir:«Şâzz, sika râvr nin başkalarına muhalif olarak rivâyet ettiği hadîsdir.» yoksa başkalarının rivâyet etmediğini rivâyet etmek değildir. Bu hadîs ile emsalinde muhalefet diye bir şey yoktur. Bilâkis onun mânâsını doğrulayan Kitâb ve sünnetten bir çok şahidleri vardır. hadîs-i şerifin sahîh olduğunda şüphe yoktur. Çünkü onu bu ilmin İmâmlarından Yahya b. Saîd el Edsarî rivâyet etmiştir. Ondan ise her biri bu ümmetin hafız ve İmâmlarından 250 kişi rivâyette bulunmuşlardır. İbn Mendeh'in «el-Müstahrec»'inde bu sayı üç yüzün üzerine çıkarılmış; Hafız Ebû Mûsâ ve Şeyhülislâm Ebû îsmâîl El-Herevî gibi bâzı zevat ise Yahya'dan onu yediyüz kişinin rivâyet ettiğini söylemişlerdir. uleması bu hadîsin dinde pek büyük bir mevkii olduğuna ittifak etmişlerdir. İmâm-ı Şafiî ile diğer bazı alimler; «Bu hadîs islâmm üçte bindir.» demişlerdir. îmam-ı Şafiî fıkhın yetmiş bâbınm bu hadîse racî olduğunu söylemiştir. Bazılarına göre islâm'ın dörtte biridir, Ebû Dâvud şöyle diyor: «Peygamber (sallallahü aleyhi ve sellem)’den beşyüzbin hadis yazdım. Bunlardan ahkam hususunda dörtbin sekîzyüz hadîs seçtim. Zühd ve takvaya dair hadisler gelince: Onlan kitabıma almadım. Bir insana bunlardan dini için dört tanesi yeter. Ameller niyetlere göredir, Helal ve haram beyan edilmiştir, Kişinin güzel müslüman olması işine girmeyen şeyleri bırakmakladır, Ve Mümin kendisi için razı olduğu şeyi din kardeşi İçinde işlemedikçe, tam mü'min olmaz, hadisleri.» Şerif niyeti tazammun ettiği için İslâm'ın üçte birine şâmildir. Çünkü İslam kavl, fiil ve amelden ibarettir. Buhârî kitabına bu hadisle başlamış bir çok ulema da bu hususda onun yolunu tutmuşlardır. Hafız İbn-i Mehdi: «Kitap tasnifi etmek isteyen bu hadisle işe başlasın. Ben bir kitap tasnif etsem onun her Bâbına bu hadisle başlardım» demiştir. Şerif de hasr ve kasra delalet eden «İnnemâ» edatı iki defa tekrarlanmıştır. Bunun faydası, hadis de zikredileni isbat, edilmeyeni nefiydir. Mânâ şudur: ameller ancak niyete göre hesabedilir niyetsiz amel hesaba konmaz. Bir de ikinci «İnnemâ» ile yapılacak amelin tayini şart olduğuna işaret buyrulmuştur. Meselâ: Kaza namazı kılmak isteyen bir kimsenin hangi günün hangi namazını kılacağını belirtmesi gerekir. hicret meselesine gelince: Bir kimse Allah rızası için yerini yurdunu terk ederek başka diyara göç ederse, bu hicretin sevabını ahr. Evlenmek veya her hangi dünyevî bir menfaat için hicret ederse kazancı yalnız niyet ettiği şeydir. Âhirette bu hicretin hiçbir sevabını göremez. Hadisde dünya menfaati ile birlikte kadının da zikredilmesi iki ihtimalden hali değildir. Birinci ihtimale göre; hadis-î şerif evlenme hususunda varid olmuştur. Bir zat Ümm-ü Kays isminde ki bir kadınla evlenmek için kadının yaşadığı yere hicret etmiş. Evlendikten sonra artık o adama, Ummü Kays'ın muhaciri denilmiştir. îkinci ihtimale göre kadının zikredilmesi sırf bu iş İçin hicret etmekten sakındırmak içindir. Binaenaleyh edebiyat nazarında cümle ehemmiyetinden dolayı âmdan sonra hâssı zikr kabilindendir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 4929,
			"arabicnumber": "1908",
			"text": "Bize Şeyban b. Ferruh rivayet etti. (Dediki): Bize Hammâd b. Seleme rivayet etti. (Dediki): Bize Sabit, Enes b. Malik'den rivayet etti. (Şöyle demiş): Resûlullah (Sallalîahu Aleyhi ve Sellem) : «Her kim şehid olmayı sadakatla isterse şehitlik kendisine verilir. Velevki isabet almasın» buyurdular İzah 1909 da",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 4930,
			"arabicnumber": "1909",
			"text": "Bana Ebû't-Tahir ile Harmele b. Yahya rivayet ettiler. Lafz Harmele'nindir. Ebû't-Tahir (bize haber verdi) tabirini kullandı. Harmele: Bize Abdullah b. Vehb rivayet etti dedi. (Demişki): Bana Ebû Şüreyh rivayet etti, ona da babasından o da dedesinden naklen Sehl b. Ebî Ümâme b. Sehl b. Huneyf rivayet etmişki, Nebi (Sallallahu Aleyhi ve Sellem): «Her kim sıdk ile Allah'dan şehidlik dilerse: Allah onu şehidlerin menzilesine ulaştırır. Velev ki döşeğinde ölmüş olsun.» buyurmuşlar. Ebû't-Tahir kendi hadisinde «sıdk» kelimesini anmamıştır. izah: Bu hadisin ikinci rivayeti birinciyi tefsir etmiştir. Her iki rivayetin manası: Bir kimse hulusi kalb ile şehit olmayı isterse döşeğinde bile ölse kendisine şehit sevabı verilir demektir. Burada şöyle bir sual hatıra gelebilir: Acaba şehit olmaya niyet etmek harbe başlarken mî şarttır, yoksa harbe çıkarken yapılan umumi niyyet kafimidir? Cevab: Umûmi niyyet kâfidir. Çünkü sahih hadisde sabit olmuştur ki bir kimse gaza etmek niyetiyle bir at beslese kendisine o hayvanı beslediği müddetçe gaza sevabı verilir. Halbuki o zat hayvanı her doyurup suladıkça ayrı ayrı gazaya niyet etmiş değildir. Bir de harbin başladığı an telaş ve dehşet zamanıdır. Şehit olmaya niyet o anda şarttır demek güçlük doğurur. Hadisi şerif şehit olmayı istemenin ve hayra niyetin müstehab olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 4931,
			"arabicnumber": "1910",
			"text": "Bize Muhammed b. Abdirrahman b. Sehmel-Antâki rivayet etti. (Dediki): bize Abdullah b. Mübarek Vüheyb El Mekkîî'den, o da Ömer b. Muhammed b. El Münkedir'den, o da Sümeyy'den, o da Ebû Salih'den, o da Ebû Hureyre'den naklen haber verdi. Ebû Hureyre şöyle demiş. Resûlullah (Sallallahu Aleyhi ve Sellem) : «Bir kimse gaza etmeden ve onu gönlünden geçirmeden ölürse nifakın bir şu'besi üzere ölür.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 4932,
			"arabicnumber": "1911.01",
			"text": "Bize Osman b. Ebi Şeybe rivayet etti. (Dediki): Bize Cerir A'meş'den, o da Ebû Süfyan'dan, o da Cabir'den naklen rivayet etti. Cabir şöyle demiş: Bir gazada Nebi (Sallallahu Aleyhi ve Sellem)'le birlikte idik : «Gerçekten Medine'de öyle adamlar var ki siz bir yolda yürür veya bîr vadiyi geçerseniz sizinie beraber olurlar. Kendilerini hastalık hapsetmiştir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 4933,
			"arabicnumber": "1911.02",
			"text": "{…} Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Ebû Muaviye haber verdi. H. Bize Ebû Bekr b. Ebî Şeybe ile Ebû Saîd el-Eşecc de rivayet ettiler (Dedilerki): Bize Vekî' rivayet etti. H. Bize ishak b. ibrahim dahi rivayet etti. (Dediki): Bize îsa b. Yûnus haber verdi. Bu râvilerin hepsi A'meş'den bu isnadla rivayette bulunmuşlardır. Ancak Vekî'in hadisinde: «Ecirde sîze ortak olurlar,» cümlesi vardır. izah: Hadisi Şerifde gönülden harbe giden gazilerle beraber olup hastalık veya başka bir sebeple fiilen iştirak edemeyenlerin hali beyan, edilmektedir. Veki’in rivayetinde böylelerinde fiilen harb eden gaziler gih sevaba nail olacakları bildirilmiştir. Hadisin zahiri âmm'dır. Şu halde cihada farz-ı kifaye yahut farz-ı ayn olarak yani umumi seferberlikte iştirak etmeye niyetlenmek her mü'mine farzdır. Cihadın farzı ayn olduğunu söyleyenler bu hadisle istidlal etmişlerdir. Hadisi şerif hayırlı bir işe niyet etmenin faziletine, gazaya veya her hangi bir ibadete niyet edipte bir özrden dolayı yapamayan kimsenin yapmış gibi sevap kazanacağına ve yapamadığına üzüldüğü nispette sevabının artırılacağına delildir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 4934,
			"arabicnumber": "1912.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Malik'e ishak b. Abdillah b. Ebi Talha'dan dinlediğim onun da Enes b. Malik'den rivayet ettiği şu hadisi okudum : Resûlullah (Sallallahu Aleyhi ve Sellem) Ümmü Haram Bînü Milhân'ın yanına girer o da kendisine yiyecek takdim edermiş. Ümmü Haram, Übade b. Sabitin nikâhı altında imiş. Bir gün Resûlullah (Sallallahu Aleyhi ve Sellem) yine onun yanına girmiş o da kendisine yemek takdim etmiş.. Sonra (Efendimizin) başını taramaya oturmuş. Derken Resûlullah (Sallallahu Aleyhi ve Sellem) uyumuş. Sonra gülerek uyanmış. Ümmü Haram diyor ki: Ben: — Seni güldüren nedir ya Resûlallah? dedim. «Ümmetimden bir takım insanlar!. Bana Allah yolunda gaza ederlerken arz olundular. Şu denizin enginine tahtlar üzerinde kırallar olarak yahut tahtlar üzerinde kırallar gibi bini (p gidi) yorlar. (Bu iki cümleden hangisini söylediğinde râvi şekk etmiştir.) Ümmü Haram demiş ki bunun üzerine ben : — Yâ Resûlallah Allah'a dua et beni onlardan eylesin. Dedim. Ona dua buyurmuş sonra başını (yastığa) koyarak uyumuş. Sonra gülerek uyanmış. Ümmü Haram diyor ki ben iyine : — Seni güldüren nedir ya Resûlallah dedim. O birinci defada dediği gibi : «Ümmetimden bir takım insanlar!.. Bana Allah yolunda gaza ederlerken arz olundular...» buyurdu. Ben: — Ya Resûlallah Allah'a dua et beni onlar'dan eylesin. Dedim. «Sen evvelkilerdensin!» buyurdular. Sonra Ümmü Haram Binti Milhân Muaviye zamanında (Gemiye) binmiş ve denizden çıktığı anda hayvanından düşerek vefat etmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 4935,
			"arabicnumber": "1912.02",
			"text": "Bize Halet b. Hişam rivayet etti. (Dediki): Bize Hammâd b. Zeyd, Yahya b. Saîd'den, o da Muhammed b. Yahya b. Habban'dan, o da Enes b. Malik'den, o da Ümmü Haram'dan -ki bu kadın Enes'in teyzesidir- naklen rivayet etti. Ümmü Haram şöyle demiş: — Nebi (Sallallahu Aleyhi ve Sellem) bir gün bize gelerek bizde kaylule yaptı, sonra gülerek uyandı. Ben: — Annem babam sana feda olsun. Seni güldüren nedir ya Resulellah? dedim. «Bana ümmetimden tahtlar üzerinde kırallar gibi denizin sırtına binen bir kavim gösterildi,» buyurdu. Bunun üzerine ben; — Allah'a dua et beni onlardan eylesin, dedim. «Şüphesiz sen onlardansın!» buyurdu. Sonra uyudu ve yine gülerek uyandı. Ben de kendisine sordum. Evvelki sözü gibi cevap verdi. Ben: — Allah'a dua et beni onlardan eylesin, dedim. «Sen evvelkiler densin» buyurdular. Enes demiş ki: Bundan sonra Ubâde bin Sâmit onunla evlendi ve denizde gazaya çıkarak onu da beraberinde götürdü, (varacakları yere) vardığında ona bîr katır takdim edildi o da bindi. Arkacığmdan katır kendisini yere düşürdü ve boynu kırıldı",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 4936,
			"arabicnumber": "1912.03",
			"text": "Bize bu hadisi Muhammed b. Rumh b. Muhacir ile Yahya b. Yahya rivayet ettiler. (Dedilerki): Bize Leys, Yahya b. Saîd'den, o da ibni Habban'dan, o da Enes b. Malik'den, o da teyzesi Ümmü Haram Binti Milhan'dan naklen onun söylediğini haber verdi: ResûlulIah (Sallallahu Aleyhi ve Sellem) bir gün bana yakın bir yerde uyudu. Sonra gülümseyerek uyandı. Ben: — Ya Resulallah seni güldüren nedir? dedim. «Ümmetimden bir takım insanlar bana arz olundular. Şu yeşil denizin sırtına biniyorlar...» buyurdu. Bundan sonra râvî, Hammâd b. Zeyd'in hadisi gibi rivayette bulunmuştur. {…} Bana Yahya b. Eyyub ile Kuteybe ve ibni Hucr da rivayet eltiler. (Dedilerki): Bize ismail -Bu zat ibni Ca'fer'dir- Abdullah b. Abdirrahman'dan rivayet ettiki o da Enes b. Malik'i şunu söylerken işitmiş: — Resûlullah (Sallallahu Aleyhi ve Sellem) Enes'in teyzesi Bint-i Milhana gelerek başını onıuı yanına koydu. Râvi hadîsi ishak b. Ebîralha ile Muhanımed b. Yahya b. Habbân hadîsleri mânasında rivayet eylemiştir. izah: Bu hadisi bütün kütüb-ü sıtte sahipleri «Cihad» bahsinde muhtelif râvilerden tahric etmişlerdir. Tirmizi onun hakkında: «Hasen Sahihtir» demiştir. Buhari onu «Rü'ya» ve «isti'zan» bahislerinde de rivayet etmiştir. İbni Abdılberr'e göre Ümmü Haram Nebi (Sallallahu Aleyhi ve Sellem)'in süt teyzelerinden biridir. Bazıları babasından yahut dedesinden teyzesi olduğunu söylemişlerdir. Ebü Ömer: «Bunların hangisi olursa olsun Ümmü Haram Nebi (Sallallahu Aleyhi ve Sellem)'in mahremidir» diyor. Kaylûle uyku olsun olmasın günün ortasında yapılan istirahattır. Nebi (Sallallahu Aleyhi ve Sellem)'in iki defasında da gülerek uyanması haber verdiklerini rü'yasmda gördüğüne Ümmü Haram va her iki defasında «Allah'a dua et beni onlardan eylesin» diye ricada bulunması rü'yaların ayrı ayrı şeyler hakkında görüldüğüne delalet eder. Nitekim birinci rü'yasında deniz, ikincide kara şehitlerini gördüğü rivayet olunur. Ulema Hz. Ummü Haram'ın şehit düştüğü bu gazanın ne zaman yapıldığında ihtilâf etmişlerdir. Buradaki rivâyetde Hz. Muaviye zamanında yapıldığı görülüyorsa da Kadi îyad ekseri siyer ulemasının kavillerine göre bunun Hz. Osman (Radiyallahu anh) zamanında yapıldığını .söylemektedir. Ümmü Haram hazretleri anhûma) zamanında yapıldığını söylemektedir. Ümmü Haram hazretler; kocası ile beraber gemiye binerek Kıbrıs'a gitmiş orada hayvanından düşerek vefat etmiştir. Kabri bugüne kadar «Hala Sultan Türbesi» namiyle ziyaret edilmektedir. Şu halde Müslim'in rivâyetindeki «Muaviye zamanında» tabirinden murad Muavîye'nin ordusunda bulunmuş manasına olup Muaviye'nin halifeliği zamanında manasına gelmez. Bununla beraber hadisi zahiri manasına hamlederek: «Bu hâdise Muaviye'nin hilafeti zamanında olmuştur» diyenler de vardır, Esahh kavle göre Kıbrıs adası harble alınmış Hz. Ümmü Haram adaya çıkacağı sırada katırdan düşerek vefat etmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 4937,
			"arabicnumber": "1912.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 4938,
			"arabicnumber": "1913.01",
			"text": "Bize Abdullah b. Abdirrahman b. Behram ed Dârimi rivayet etti. (Dediki): Bize Ebû'l-Velid Et-Tayâlisi rivayet etti. (Dediki): Bize Leys (Yani îbni Sa'd) Eyyub b. Musa'dan, o da Mekhûl'den, o da Şürahbil b. Semitden, o da Selman'dan naklen rivayet etti şöyle demiş: Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i: «Bir gün bir gece serhat bekçiliği bîr ayın orucu ile teravihinden daha hayırlıdır. Ölürse üzerine dünyada iken yaptığı ameli ve rızkı cereyan eder. Fettandan da emin olur.» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 4939,
			"arabicnumber": "1913.02",
			"text": "{…} Bana Ebût-Tahir rivayet etti. (Dediki): Bize ibni Vehb, Abdurrahman b. Şureyh'dan o da Abdulkerim b. Hâris'den, o da Ebû Übeyde b. Ukbe'den, o da Şurayhbil b. Semit'dan o da Selmanu'l-Hayr'dan, o da Resûlullah (Sallallâhu Aleyhi ve Sellem)'den naklen Leys'in Eyyub b. Musa'dan rivayet ettiği hadis manasında haber verdi. izah: Ribat; hayvanı bağlamaya yarayan ip demektir. Sonra bu kelime hudud muhafızına ıtlak olunmuştur. Hadisden murad şudur. Bir gün bir gece düşmana karşı hudud muhafızlığı yapmak bir ay nafile oruç tutmakla bir ay nafile namaz kılmaktan daha hayırlıdır. Şayet hudud muhafızlığı yaparken ölürse o vazifede iken yaptığı amelleri devam edermiş gibi ecir ve mükafat verilir. Hadis-i Şerif şehid hakkındaki âyetlerle hadislere muvafıktır. Şehit âyetlerinde şehitlerinin ölmediği Allah katında diri oldukları ve kendilerine rızk verildiği beyan buyrulduğu gibi yukarda geçen bazı hadislerde şehit ruhlarının cennet meyvelerinden yedikleri beyan olunmuştur. Fettan'dan murad, kabir fitnesidir. Bu kelime «Futtan» şeklinde cemi olarak rivayet edildiği gibi «Kabrin iki fettanı şeklinde tesniye olarak da rivayet edilmiştir. Kabrin fettanı Münker ve Nekir ismindeki meleklerdir. Hadisi Şerif: Hudud muhafızlığı yapan kimsenin faziletine ve amellerinin öldükten sonra da devam edeceğine, bu hal ona mahsus olup başka hiç bîr kimseye nasip olmayacağına delildir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 4940,
			"arabicnumber": "1914",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Malik'e Sümeyye'den dinlediğim onunda Ebû Salîh'den, onun da Ebû Hureyre'den naklen rivayet ettiği şu hadisi okudum. Resulullah (Sallallâhu Aleyhi ve Sellem): «Bir defa bir adam yolda yürürken yol üzerinde bir diken dalı buldu ve onu uzaklaştırdı. Bunun üzerine Allah kendisine teşekkür etti, ve onu affetti.» buyurmuşlar. Bir de: «Şehitler beş kısımdır. Vebadan, ishalden ve boğulmaktan ölenlerle yıkıntıdan ölen ve Allah azze ve cellenin yolunda şehit olandır.» buyurmuşlar. İzah 1916 da",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 4941,
			"arabicnumber": "1915.01",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Cerir, Süheyl'den, o da babasından, o da Ebû Hureyre'den naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallâhu Aleyhi ve Sellem): «Siz aranızda kimi şehid sayıyorsunuz?» diye sordu. Ashab: — Ya Resulellah kim Allah yolunda öldürülürse o şehittir, dediler. «O halde ümmetimin şehitleri pek azdır.» buyurdu. Ashab: — Öyle ise kimdir onlar yâ Resulellah? dediler. — «Kim Allah yolunda öldürülürse o şehiddir. Kim Allah yolunda ölürse o da şehittir. Kim vebadan ölürse o da şehittir. Kim ishalden ölürse o da şehittir.» buyurdular. İbni Miksem (Demişki): Baban üzerine şehadet ederim ki bu hadiste o şöyle demiştir: «Boğulan da şehiddir.»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 4942,
			"arabicnumber": "1915.02",
			"text": "{…} Bana Abdulhamid b. Beyan El Vasıtî de rivayet etti. (Dediki): Bize Halid, Süheyl'den bu isnadla bu hadisin mislini rivayet etti. Şu kadar var ki onun hadisinde: «Süheyl dedi ki: Ubeydullah b. Miksem şunu söyledi: Kardeşin üzerine şehadet ederim ki; o bu hadiste (kim boğulursa o da şehiddir) cümlesini ziyade etti.» ibaresi vardır",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 4943,
			"arabicnumber": "1915.03",
			"text": "{…} Bana Muhammed b. Hatim dahi rivayet etti. (Dediki): Bize Behz rivâyfct etti. (Dedîki): Bize Vüheyb rivayet etti. {Dediki): Bize Süheyl bu isnadla rivayet etti. Onan hadisinde şu da vardır: «Dediki Ubeydullah b. Miksem, Ebû Salih'den naklen haber verdi. Hadisde şunu da ziyade etti. «Boğulan da şehiddlr.» İzah 1916 da",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 4944,
			"arabicnumber": "1916.01",
			"text": "Bize Hamid b. Ömer El-Bekrâvî rivayet etti. (Dediki): Bize Abdülvahid (Yani îbni Ziyâd) rivayet etti. (Dediki): Bize Âsim, Hafsa binti Sîrîn'den rivayet etti. Şöyle demiş: Bana Enes b. Malik: — Yahya b. Ebî Amra neden öldü diye sordu. — Taun'dan dedim. Bunun üzerine: Resûlullah (Sallallâhu Aleyhi ve Sellem): «Taun her müslüman için şehitliktir.» buyurdu dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 4945,
			"arabicnumber": "1916.02",
			"text": "{…} Bize bu hadisi Velid b. Şüca'dah rivayet etti. (Dediki): Bize Ali b. Müshir, Asim'dan bu isnâdda bu hadisin mislini rivayet etti. izah: Bu hadislerin Ebû Hureyre rivayetini Buhari «Ezan» ve «Namaz» bahislerinde; Tirmizî «Kitabül birr» de tahric etmişlerdir. Tirmizi onun hakkında: «Bu hadis Hasen Sahihtir» demiştir. Enes rivayetini Buhârî «Cihâd» ve «Tib» bahislerinde tahrîc etmiştir. «Allah ona teşekkür etti.» cümlesinden murad: Onun yaptığından razı oldu fiilini kabul etti ve kendisine senada bulundu demektir. Şüheda: Şehidin cem'idir. Şehid faîl veznin de olduğu için hâzır bulunup gören manasına ismi fail olduğu gibi, görülen manasına ismi mef'ûl de olabilir. Burada her iki takdir caizdir. Şehidin ölümünde melekler hazır bulunduğu için o meşhûd yani görülmüş demekir. Bazıları şehidin cennet için kendisine şahidîik edilmiş manasına geldiğini söylemişlerdir. Bir takımları şehid Allah katında diri ve hazır olduğu için kendisine bu isim verildiğini, daha başkaları Allah'ın ikramını gördüğü için şehid denildîğini söylemişlerdir. Şehidler hakkında birçok hadisler vardır. Bunların bazısında şehidlerin beş nevi olduğu bazıların da yedi diğerlerin de sekiz hatta dokuz ve on bir olduğu bildirilmektedir. Bu muhtelif sayılara bakarak rivayetler arasında tenakuz olduğu iddia edilemez. Çünkü bu sayıların muhtelif oluşu Nebi (Sallallahu Aleyhi ve Sellem) efendimize gelen vahye göredir. Burada harb şehidlerinden başkâ veba'dan, ishalden ölenlerle boğularak ve üzerine bina yıkılarak ölenlerin de şehid oldukları bildiriliyor. Başka rivayetlerde yanarak ölenlerle zatürreden ölenlerin hamile olarak ölenlerin malı uğrunda ödürülenlerin de şehîd gittikleri bildirilmiştir. Ulemanın beyânına göre; bu suretle ölenlerin şehîd sayılması çektikleri büyük elem ve acılara mukabil bir lütfu ihsandır. Harb meydanında ölenlerden başk şehit hükmünde olanlar yıkanırlar ve cenaze namazları kılınır. Harbde ölenlerse yıkanmazlar. Hasılı şehitler üç kısma ayrılır. 1- Dünya ve ahiret şehitleri: Bunlar harbde öldürülenlerdir. 2- Dünya ahkâmı hakkında değilde yalnız ahiret hususunda şehid sayılanlar. 3- Yalnız dünya ahkâmı hususunda şehid sayılanlar: Bunlar ganimet aşıranlar ve harbden kaçarken öldürülenlerdir, ki insanlara göre şehid sayılırlar. Çünkü yaptıklarının iç yüzünü bilen yoktur. Bunu yalnız Allah bilir. Ve kendilerine ahirette şehid sevabı vermez",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 4946,
			"arabicnumber": "1917",
			"text": "Bize Harun b. Mâruf rivayet etti. (Dediki): Bize ibni Vehb haber verdi. (Dediki): Bana Amr b. Haris, Ebû Ali Sümâme b. Şüfiyy'den naklen haber verdiki Ukbe b. Âmiri şöyle derken işitmiş: Ben Resûlullah (Sallallâhu Aleyhi ve Sellem)'i minber üzerinde: «Onlar için gücünüzün yetebildiğî kadar kuvvet hazırlayın! Dikkat kuvvet atıcılıktır! Dikkat kuvvet atıcılıktır! Dikkat kuvvet atıcılıktır.» buyururken işittim. izah: Bu hadisde Resûlullah (Sallallâhu Aleyhi ve Sellem): «Onlar için gücünüzün yetebildfği kadar kuvvet hazırlayın» Ayeti Kerimesini tefsir etmiştir. Bu tefsir müfessirlerin hikâye ettikleri diğer kavilleri red etmektedir. Bazıları kuvvetten murad kal'alar bîr takımları da erkek atlar olduğunu söylemişlerdir. Bu ve emsali hadisler atıcılığın faziletine ve cihad niyetiyle silah kullanmaya atıcılığın her nev'ini öğrenmeye teşvik etmektedirler. Binaenaleyh bugünkü modern silâhların her çeşidini öğrenmek hatta hava kara ve su taşıtlarını kullanmak hükümde dahildir. Ata binmek ve harbe yarayacak yüzücülük nişancılık ve güreş nevileri gibi spor faaliyetleri de böyledir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 4947,
			"arabicnumber": "1918.01",
			"text": "Bize Harun b. Ma'ruf rivayet etti. (Dediki): Bize ibni Vehb rivayet etti. (Dediki): Bana Amr b. Haris, Ebû Ali'den, o da Ukbe Amir'den naklen haber verdi. (Şöyle demiş): Ben Resûlullah (Sallallâhu Aleyhi ve Sellem): «Size yerler feth edilecektir. Allah stze kâfidir. O halde sizden biriniz oklarıyla oynamaktan aciz değildir.» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 4948,
			"arabicnumber": "1918.02",
			"text": "{…} Bize bu hadîsi Davud b. Ruşeyd de rivayet etti. (Dediki): Bize Velid, Bekir b. Mudar'dan, o da Amr b. Hâris'den, o da Ebû Ali el Hemdanî'den naklen rivayet etti. Ben Ukbe b. Âmiri Nebi (Sallallâhu Aleyhi ve Sellem)'den naklen rivayet ederken dinledim. Demiş ve yukardaki hadîsin mislini rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 4949,
			"arabicnumber": "1919",
			"text": "Bize Muhammed b. Rumh b, Muhacir rivayet etti. (Dediki) Bize Leys, Haris b. Ya'kub'dan o da Abdurrahman b. Şumase' naklen haber verdiki Fukeym-i Lahmî, Ukbe b. Amir'e : — Şu iki hedef arasında gidip geliyorsun. Halbuki sen yaşlısın bu sana zor gelir demiş. Ukbe: —> Resûlullah (Sallallâhu Aleyhi ve Sellem)'den işittiğim bir soz olmasaydı ben buna katlanmazdım. Cevabını vermiş. Haris diyor ki; Bunun özerine ben ibnü Şumase'ye : — Ne o? diye sordum. — Nebi (Sallallâhu Aleyhi ve Sellem): «Her kîm atıcılığı öğrenir de sonra terkederse bizden değildir. Yahud muhakkak isyan etmiştir,» buyurdu dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 4950,
			"arabicnumber": "1920",
			"text": "Bize Saîd b. Mensur ile Ebû'r Rabi' El-Atekî ve Kuteyhe b. Saîd rivayet ettiler. (Dedilerki): Bize Hammad —ibni Zeyd'dir.— Eyyub'dan, o da Ebû Kılâbe'den, o da Ebû Esmâ'dan, o da Sevbân'dan naklen rivayet etti. Sevban şöyle demiş: Resûlullah (Sallallâhu Aleyhi ve Sellem): «Ümmetimden bir taife hakka yardımcı olmakta devam edecektir. Onlara muhalefette bulunanlar zarar veremiyecek. Nihayet Allah'ın emri onlar bu haldeyken gelecektir.» buyurdular. Kuteybe'nin hadisinde «Onlar bu haldeyken» kaydı yoktur. İzah 1925 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 4951,
			"arabicnumber": "1921.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Vekî' rivayet etti. H. Bize îbnü Numeyr de rivayet etti. (Dedîki): Bize Veki' ile Abde ikisi birden ismail b. Ebi Halid'den rivayet ettiler. H. Bize ibni Ebî Ömer dahi rivayet etti. Lafız onundur. (Dediki): Bize Mervan (yani El-Fezârî) ismail'den, o da Kays'den, o da Muğire'den naklen rivayet etti. (Şöyle demiş): Ben Resûlullah (Sallalldhu Aleyhi ve Sellem) «Ümmetimden bîr kavim insanlara yardımcı olmakta devam edecektir. Nihayet onlar yardımcı iken kendilerine Allah'ın emrî gelecektir.»",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 4952,
			"arabicnumber": "1921.02",
			"text": "{…} Bana bu hadisi Muhammed b. Rafi* dahi rivayet etti. (Dediki): Bize Ebû Usame rivayet etti. (Dediki): Bana ismail, Kays'dan rivayet etti. (Demişki): Muğire b. Şu'be'yi şunu söylerken dinledim: Ben Resûlullah (Sallalldhu Aleyhi ve Sellem)'i şöyle buyururken işittim... Ravi tamamiyle Mervan hadîsi gibi rivayette bulunmuştur. İzah 1925 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 4953,
			"arabicnumber": "1922",
			"text": "Bize Muhammed b. Müsenna ile Muhammed b. Beşşâr rivayet .ettiler. (Dediler kî): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Simâk b. Ha rk'den, o da Câbir b. Semura'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti ki: «Bu din kaim olmakta mutlaka devam edecektir. Onun namına ta kıyamet kopuncaya kadar müslümanlardan bir cemaat çarpışacaktır.» buyurmuşlar. İzah 1925 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 4954,
			"arabicnumber": "1923",
			"text": "Bana Hârûn b. Abdillah ile Haccâc b. Şâir rivayet ettiler. (Dedilerki): Bize Haccâc b. Muhammed rivayet etti. (Dediki): ibnü Cüreyc şunu söyledi: Bana Ebû'z-Zûbeyr haber verdi ki kendisi Câbir b. Abdillah, şunu söylerken işitmiş. Ben Resûlullah (Sallalldhu Aleyhi ve Sellem): «Ümmetimden bîr taife hak uğruna çarpışmakta kıyamet gününe kadar yardımcı olmakta devam edecektir.» buyururken işittim. İzah 1925 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 4955,
			"arabicnumber": "1037.03",
			"text": "Bize Mensur b. Ebi Müzâhim rivayet etü. (Dediki): Bize Yahya b. Hamza, Abdurrahman b. Yezid b, Câbir'den naklen rivayet etti. Ona da Umeyr b. Hani rivayet etmiş. (Demişki): Ben Muaviye'yi minber üzerinde şunu söylerken dinledim: Ben Resûlullah (Sallallahu Aleyhi ve Sellem), «Ümmetimden bir taife Allah'ın emrini tutmakta devam edecektir. Onları aşağılayan veya muhalefet edenler kendilerine zarar veremeyecek. Nihâyet Allah'ın emri, onlar insanlara yardım ederken gelecektir.» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 4956,
			"arabicnumber": "1037.04",
			"text": "Bana ishak b. Mansur da rivayet etti. (Dediki): Bize Kesir b. Hişâm haber verdi. (Dediki): Bize Ca'fer —Bu zât îbnü Burkân'dır— rivayet etti. (Dediki): Bize Yezid b. Esamm rivayet etti. (Dediki) Ben Muaviye b. Ebi Süfyan'i dinledim. Nebi (Sallallahu Aleyhi ve Sellem)'den rivayet ettiği bir hadis söyledi ki; ben kendisini Peygamber (Sallallahu Aleyhi ve Sellem)'in minberi üzerinde ondan bu Hadîsden başka hadis rivayet ettiğini işitmedim. (Dediki): Resûlullah (Sallallahu Aleyhi ve Sellem): «Allah bîr kimseye hayr (vermek) murad ederse onu dinde fakîh kılar. Müslümanlardan bir cemaat kendilerine düşmanlık edenlere karşı çıkacak tâ kıyamet gününe kadar Hakk uğruna çarpışmakta devam edecektir.» buyurdular. İzah 1925 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 4957,
			"arabicnumber": "1924",
			"text": "Bana Ahmed b. Abdîrrahman b. Vehb rivayet etti. (Dediki); Bize amcam Abdullah b. Vehb rivayet etti. (Dediki): Bize Amr b. Haris rivayet etti. (Dediki): Bana Yezid b. Ebî Habib rivayet etti. (Dediki): Bana Abdurrahman b. Şumaset'l-Mehri rivayet etti. (Dediki): Mesleme b. Muhalled'in yanındaydım. Abdullah b. Amr b, As da onun yanında idi. Abdullah şunu söyledi : — Kıyamet ancak halkın kötüleri üzerine kopacaktır. Onlar cahiliyyet halkından daha kötüdürlr. Allah'dan bir şey isterlerse onu üzerlerine reddeder. Onlar bu haldeyken Ukbe b. Âmir geldi. Mesleme ona : — Ya Ukbe! Dinle Abdullah ne diyor. Dedi. Ukbe de : — O daha iyi bilir. Amma ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i: «Ümmetimden bîr cemaat düşmanlarını kahr ederek Allah'ın emri uğrunda çarpışmakta devam edeceklerdir. Onlara muhalefet edenler kendilerine bîr zarar veremiyecek. Nihayef onlar bu halde iken kıyamet kendilerine gelecektir» buyururken işittim, cevabını verdi. Bunun üzerine Abdullah şunu söyledi — Evet, sonra Allah misk kokusu gibi bir koku gönderecek, teması ipeğin teması gibi olacak, ama kalbinde tane ağırlığı iman olan hiç bir kimseyi bırakmayıp öldürecek, Sonra insanların kötüleri kalacak, kıyamet onların üzerine kopacaktır. İzah 1925 te",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 4958,
			"arabicnumber": "1925",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Hüseyn, Davud b. Ebî Hind'den, o da Ebû Osman'dan, o da Sa'd b. Ebî Vakkâs'dan naklen haber verdi. Sa'd şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) : «Garb ehli kıyamet kopuncaya kadar Hakk üzere yardımcı olmakta devam edeceklerdir» buyurdular. izah: Bu rivayetlerin bazılarını Buhari Menakıb bahsinde tahri etmişir. Hadisi Şerifin izahı Kitabu-l-İman'ın sonlarında geçmişti. Buradaki kokudan murad kıyamete yakın Yemen taraflarından çıkarak kadın erkek her mu'minin ruhunu kabzedecek olan rüzgârdır. Bahsedilen taife veys cemaata gelince: Buhârî bunlardan murad ulemâ olduğunu söylemiş; imam Ahmed b. Hanbel ise: -«Bunlar ehli Hadîs değilseler kimler olacağını bende bilemiyorum» demiştir. Kadı iyâd imam Ahmed in bu sözüyle Ehl-i Sünnet vel-Cemaati, hadîs ulemasının mezhebinde olanları kasdettiğini söylemektedir. Nevevî diyor ki: «ihtimalki bu taife muhtelif mu'minler arasına dağılmıştır. Bazıları cengâver yiğitler, bir takımları fukaha ve hadîs uleması kimisi zâhıd kimisi Emri bil ma'rufu yapan zevattır. Hepsinin bir yerde toplu bulunmaları lâzım gelmez. Bilâkis muhtelif yerlerde bulunurlar.» Hadisin son rivayetinde zikri geçen «Garb ehlî»'nden murad Ali b. Medînî'ye göre araplardır. Garb: Büyük kova manasına gelir. Bunu ekseriyetle arablar kullandıkları için onlara «Garb Ehli» denilmiştir. Diğer ulemaya göre Garbdan murad batıdır. Muaz bunların Şamlılar olduğunu söylemiştir. Kudüslüler olduğunu bildiren hadisde vardır. Bazıları «Garb Ehlinden murad: Hiddet ve şiddet sahibi insanlardır. Hasılı yer yüzü kıyamete kadar cihaddan hâli kalmayacaktır. Bir yerde harb ve cidal bitse başka yerde yenisi patlayacak kıyamet yaklaşıncaya kadar bu böyle gidecek ve Hak yolunda mücahede eden halis müslümanlar bulunacaktır. Hadîsin bir rivayeti Allah'ın çok hayır vermek istediği kulunu fakih yaptığı bildirilmektedir.Yani o kimseye Şeriat sahibinin emirleriyle nehiylerinin sırrını ilâhi bir nûr ile anlatır. Bu rivâyet ilmin ve ulemanın faziletine, din âlimi olmanın imanı kurtarmaya bir alâmet sayıldığına delildir. Hadisi Şerifin bütün rivayetleri bir mucizeyi ispat etmektedir. Bu mucize Nebi (Sallallahu Aleyhi ve Sellem)'in haber verdiği cemaatlerin bugüne kadar her devirde zuhur edip hak din uğuruna mücadele etmeleridir Hadisi Şerif ayrıca icmaın hüccet olduğuna da delildir. Nevevî: ««Bu hadîs kendileriyle istidlal edilen en sahih hadislerdendir.» diyor",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 4959,
			"arabicnumber": "1926.01",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bîze Cerir, Süheyl'den, o da babasından, o da Ebû Hureyre'den naklen rivayet etti (Şöyle demiş): Resûlullah (Sallalldhu Aleyhi ve Sellem): «Verimli yerde sefer ettiğiniz zaman develere o yerde nasiblerini verin! Çorak yerde sefer ederseniz orada yürüyüşü süratlendirin! Geceleyin mola verirseniz yoldan sakının. Çünkü yol geceleyin böceklerin sığınağıdır» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 4960,
			"arabicnumber": "1926.02",
			"text": "{…} Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Abdulaziz (Yani ibnû Muhammed) Süheyl'den, o da babasından, o da Ebû Hureyre'den naklen rivayet etti ki: Resûlullah (Sallalldhu Aleyhi ve Sellem): «Verimli yerde sefer ettiğiniz zaman develere o yerden nasiblerini verin! Çorak yerde sefer ederseniz onları ilikleri çıkmadan acele yürütünüz. Mola verdiğiniz zamanda yoldan kaçınınız. Çünkü o hayvanların yolları ve geceleyin böceklerin sığınağıdır.» buyurmuşlar. izah: Bu hadis hayvanlara karşı müşfik davranmak gerektiğini bildirmektedir. Mer'ası bol yerlerde sefer edilirse zaman zaman hayvanlar otlatılarak doyurulacak, icabında sulanacak; mer'asiz yerlerden geçilirse menzili maksuda bir an evvel varmak için hızlı gidilecektir. Çünkü bu gibi yerlerde de mûtad yürüyüşle gidilirse yiyeceksîzlikten hayvanlar zayıflar; çok defa hastalanarak yolda kalır. Telef olur. Bir yerde konaklamak icabederse yol üstüne değil tenha bir yere çekilerek mola verilecektir. Yolculuğun âdabı budur. Çünkü geceleyin dolaşan sinek ve böcek gibi haşerat ile zehirli yılanlar ve yırtıcılar yollarda yürürler. Bu onlara hem bîr kolaylıkdır. Hem de geçen yolculardan düşen yiyecek kırıntılarıyla karınlarını doyururlar. Bu sebeple hem o hayvanlara mâni olmamak hem de onlardan gelecek zarara maruz kalmamak için yoldan uzak bir yere inmek emir buyurulmuştur",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 4961,
			"arabicnumber": "1927",
			"text": "Bize Abdullah b. Mesleme b. Ka'neb ile İsmâîl b. Ebi Üveys, Ebu Mus'ab Ez-Zührî, Mansur b. Ebû Müzahim ve Kuteybe b. Saîd rivayet ettiler. (Dedilerki): Bize Mâlik rivayet etti. H. Bize Yahya b. Yahya Et-Temîmî dahi rivayet etti lafız onundur. (Dediki): Mâlik'e, Sana Sümeyy, Ebû Salih'den, o da Ebû Hureyre'den naklen Resûlullah (Sallallahu Aleyhi ve Sellem)'in: «Sefer azabdan bir parçadır. Sizden birinize uykusunu ve yemesini içmesfnî men eder. Biriniz hacetini olduğu gibi gordümü hemen evine acele dönsün» buyurduğunu rivayet etti mi? Dedim. — Evet. Cevabını verdi. izah: Bu hadisi Buhârî «Hac»ve «Cihad» bahislerinde; Nesaî «Siyera'de muhtelif râvilerden tahric etmişlerdir. Seferin azabdan bîr parça olması meşakkatin verdiği elem dolayısiyledir. Seferin yolcuya uykusunu ve yiyeceğini ve içeceğini men etmesinden murad bunları vaktinde ve yeteri kadar alamamasıdır. Yoksa bunların hakikatlerini men etmesi mevzu bahis değildir. Hadisi Şerif; seferde bulunan bir kimsenin işini bitirdikten sonra lüzumsuz yere gecîkmeyip acele evine dönmesinin müstehab olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 4962,
			"arabicnumber": "1928.01",
			"text": "Bana Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Yezid b. Hârun, Hemmâm'dan, o da îshak b, Abdillah b. Ebî Talha'dan, o da Enes b, Malik'den naklen rivayet etti ki ResûluIIah (Sallallahu Aleyhi ve Sellem) ailesi nezdüıe geceleyin gelmezdi. Onlara ya sabah yahud akşamleyin gelirdi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 4963,
			"arabicnumber": "1928.02",
			"text": "{…} Bana bu hadisi Züheyr b. Harb de rivayet etti. (Dediki); Bize Abdüssemed b. Abdîlvâris rivayet etti. (Dediki): Bize Hemmam rivayet etti. (Dediki): Bize ishak b. Abdillah b. Ebî Talha Enes b. Malik'den o da Nebi (Sallalldhu Aleyhi ve Sellem)'den naklen bu hadisin mislini rivayet etti. Şu kadar var ki o «geceleyin girmezdi» dedi. İzah için bir sonraki sayfa’ya bak",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 4964,
			"arabicnumber": "715.23",
			"text": "Bana îsmâîl b. Salim rivayet etti. (Dediki): Bize Huşeym rivayet etti. (Dediki): Bize Seyyar haber verdi. H. Bize Yahya b. Yahya da rivayet etti lafız onundur. (Dediki): Bize Huseyni, Seyyâr'dan o da Şa'bî'den o da Câbir b. Abdillah'dan naklen rivayet etti. Cabir şöyle demiş: Bir gazada Resûlullah (Sallallahu Aleyhi ve Sellem)'Ie birlikte bulunuyorduk. Medine'ye geildiğimizde girmeye kalkıştık. Bunun üzerine: «Ağır olun da (oraya) geceleyin (yani yatsı zamanı) girelim. Tâki dağınık saçlı kadın taransın, kocası gurbette olan da usturasını kullansın!» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 4965,
			"arabicnumber": "715.24",
			"text": "Bize Muhammed b. Müsennâ rivayet etti. (Dediki): Bana Abdissamed rivayet etti. (Dedikî): Bize Şu'be, .Seyyâr'dan o da, Âmir'den, o da Câbir'den naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallalldhu Aleyhi ve Sellem): «Biriniz geceleyin (seferden) geldiği vakit hemen ailesi yanına daiıvermesin, Tâki kocası gurbette olan usturasını kullansın, dağınık saçlı da taransın» buyurdular",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 4966,
			"arabicnumber": "715.25",
			"text": "{…} Bu hadisi Yahya b. Habib de rivayet etti. (Dediki): Bize Ravh b. Ubade rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Bize Seyyar bu isnadla bu hadîsin mislini rivayet etti",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 4967,
			"arabicnumber": "715.26",
			"text": "Bize Muhammed b. Beşşâr da rivayet etti. (Dediki): Bize Muhammed (Yani ibni Ca'fer) rivayet etti. (Dediki); Bize Şu'be Âsım'dan, o da Şa'bî'den, o da Cabir b. Abdillah'dan naklen rivayet etti. Cabir şöyle demiş: ResûluIIah (Sallalldhu Aleyhi ve Sellem) Erkeğin gurbeti uzadığı zaman ailesinin yanına geceleyin gelmesini yasak etti",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 262
			}
		}
	]
}