{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"34": "The Book of Hunting, Slaughter, and what may be Eaten"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4972,
			"arabicnumber": "1929.01",
			"text": "Bize İshak b. İbrahim El-Hanzalî rivayet etti. (Dediki): Bize Cerir, Mansur'dan, o da İbrahim'den, o da Hemmam b. Haris'den, o da Adiyy b. Hâtim'den naklen haber verdi Adiyy şöyle demiş: — Ya Resulallah ben öğretilmiş köpekleri şalıyorumda bana (av) tutuyorlar. Üzerine besmelede çekiyorum dedim. Bunun üzerine «Öğretilmiş köpeğini saldığın üzerine besmelede çektiğin vakit ye!» boyarda. — Ya avı öldürürlerse? dedim. «isterlerse öldürsünler (ama) onlarla beraber olmayan köpek onlara iştirrak etmemek şartıyla» buyurdu. Kendilerine: — Bir de ben av'a ok atıyor ve vuruyorum, dedim. «Ok atar da hayvanı delerse onu yel Genişliğine isabet ederse onu yeme!» buyurdular",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4973,
			"arabicnumber": "1929.02",
			"text": "Bize Ebû Bekr b. Ebi Şeybe rivayet etti. (Dediki): Bize İbni Fudayl, Beyan'dan, o da Şa'bi'den ,o da Adiyy b. Hâtim'den naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem)'e sordum: — Biz bu köpeklerle av avlayan bir kavimiz, dedim. Bunun üzerine: «Öğretilmiş köpeklerini saldığın üzerlerine besmelede çektiğin vakit senin içîn tuttukları avdan ye! Velevkî öldürmüş olsunlar. Ancak köpek (avdan) yerse o başka! O yerse sen yeme. Çünkü avı sadece kendisi için tutmuş olmasından korkarım. Onlara başka köpekler karışırsa (o avdan) yeme!» buyurdular. «Köpeğini saldığında besmele de çektinse ye. Eğer köpek avdan yemişse sen yeme çünkü o sadece kendisi için tutmuş demektir.» buyurdu. — Ya köpeğimle beraber başka bir köpek bulurda avı hangisi tuttu bilemezsem? dedim. «Yine yeme. Sen ancak kendi köpeğin üzerine besmele çektin başkasına besmele çekmedin» buyurdular",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4974,
			"arabicnumber": "1929.03",
			"text": "KİTAPTA YOK ! 2’NİN BENZERİ ANCAK ŞİMDİLİK TERCÜMESİ YOK",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4975,
			"arabicnumber": "1929.04",
			"text": "{…} Bize Yahya b. Eyyub da rivayet etti. (Dediki): Bize İbnü Uleyye rivayet etti (Dediki): Bana Şu'be de Abdullah b, Ebî's-Sefer'den naklen haber verdi. (Demişki): Şa'bi'yi şöyle derken işittim. Ben Adiyy b. Hatim'i şunu söylerken dinledim: Resûlullah (Sallallahu Aleyhi ve Sellem)'e okun hükmünü sordum... Ve yukarki hadîsin mislini nakletmiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4976,
			"arabicnumber": "1929.05",
			"text": "{…} Bana Ebû Bekr b. Nafi'el-Abdî de rivayet etti. (Dediki): Bize Gunder rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Bize Abdullah b. Ebî's-Sefer rivayet etti. Şu'be'nin bir takım insanlardan da rivayet ettiğine göre Şa'bî'den rivayet olunmuş. (Demişki): Ben Adîyy b. Hâtim'i dinledim: «Resûlullah (Sallallahu Aleyhi ve Sellem)'e okun hükmünü sordum dedi...» Râvî yukarki gibi rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4977,
			"arabicnumber": "1929.06",
			"text": "Bize Muhammed b. AbdiIIah b. Numeyr de rivayet etti. (Dedîki): Bize babam rivayet etti; (Dediki): Bize Zekeriyya, Âmir'den, o da Adîyy b. Hatim'den naklen rivayet etti. (Şöyle demiş): ResuluIIah (Sallallahu Aleyhi ve Sellem)'e ok avının hükmünü sordum da: «Keskinliğine isabet ederse onu ye! genîşliğine isabet ederse o hayvan ezilerek ölmüştür.» buyurdu. Kendisine köpeğin avını sordum: «Senin için tutarda avdan yemezse onu ye! çünkü o hayvanın kesilmesi tutulmasından ibarettir. Avın yanında başka bir köpek bulur da kendi köpeğinle beraber tutmuş olmasından korkarsan avı da öldürmüşse yeme! Çünkü, sen yalnız kendi köpeğin üzerine besmele çektin başkasının üzerine onu anmadın.» buyurdular",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4978,
			"arabicnumber": "1929.07",
			"text": "{…} Bize İshak b. İbrahim dahî rivayet etti. (Dediki): Bize İsa b. Yunus haber verdi. (Dedikî): Bize Zekeriyya b. Ebî Zaide bu isnadla rivayette bulundu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4979,
			"arabicnumber": "1929.08",
			"text": "Bize Muhammed b. Velid b. Abdilhamîd de rivayet etti. (Dediki): Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Saîd b. Mesruk'dan rivayet etti. (Demişki): Bize Şa'bî rivayet etti. (Dediki): Adiyy b. Hatimi dinledim (bu zat Nehraynde bizim gidip geldiğimiz ve düşüp kalktığımız bir komşumuzdu) Adiyy Nebi (Sallallahu Aleyhi ve Sellem)'e sormuş: — Ben köpeğimi salıyorum. Sonra köpeğimle beraber avı tutmuş bir köpek buluyorum. Hangisinin tuttuğunu bilmiyorum demiş. Efendimiz: «O halde yeme. Çünkü sen ancak kendi köpeğin üzerine besmele çektin, başkası üzerine çekmedin» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4980,
			"arabicnumber": "1929.09",
			"text": "{…} Bize Muhammed b. Velid dahî rivayet etti. (Dediki): Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Hakem'den, o da Şa'bi'den, o da Âdiyy b. Hâtim'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bunun mislini rivayet etti",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4981,
			"arabicnumber": "1929.10",
			"text": "Bana Velid b. Şûca'es-Sekûnî rivayet etti. (Dediki): Bize Ali b. Müshir, Asım'dan, o da Şa'bî'den, o da Adîyy b. Hâtim'den naklen rivayet etti. (Şöyle demiş): Bana Resûlullah (Sallallahu Aleyhi ve Sellem), «Köpeğini saldığın vakit hemen üzerine besmele çek. Şayet senin için tutarda ava diri İken yetişirsen, onu kesiver. Öldürmüş de ondan yememiş olduğu halde yetişirsen onu ye! Köpeğinle beraber başka bîr köpek bulur san avı da öldürmüşse yeme. Çünkü onu hangisinin öldürdüğünü bilmezsin. Okunu atarsan besmeleyi çekiver. Eğer av senden bir gün kaybolur da onda senin okunun eserinden başka bir şey bulamazsan dilersen ye! Avı suda boğulmuş bulursan yeme!» buyurdular",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4982,
			"arabicnumber": "1929.11",
			"text": "Bize Yahya b. Eyyub rivayet etti. (Dediki): Bize Abdullah b. Mübarek rivayet etti (Dediki): Bize Âsim, Şa'bi'den, o da Adiyy b. Hatim'den naklen haber verdi. (Şöyle demiş): Resulullah (Sallallahu Aleyhi ve Sellem)'e avın hükmünü sordum: «Okunu attığın zaman üzerine besmele çekiver. Avı öldürmüş bulursan ye! Ancak onu suya düşmüş bulursan o başka! Çünkü onu su mu öldürdü yoksa senin okunmu bilemezsin.»",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4983,
			"arabicnumber": "1930.01",
			"text": "Bize Hennad b. Seriyy rivayet etti. (Dediki): Bize ibnû Mübarek, Hayve b. Şureyh'dan rivayet etti. (Demiki): Ben Rabîa b. Yeriz ed-Dimeşkî'yi şunu söylerken işittim: Bana Ebû idris Âizullah haber verdi. (Dediki): Ebû Sa'lebete'l-Huşeni'yî şöyle derken işittim: — Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek: Ya Resûlellah! Biz ehli kitap bir kavmin toprağındayız. Onların kaplarından yiyoruz. Bir de av yerindeyiz, yayımla avlanıyorum, öğretilmemiş köpeğimle de avlanıyorum. Binaenaleyh bundan bize neyin helal olduğunu bana haber ver. dedim. «Söylediğin ehli kitap bîr kavmin toprağında bulunuşunuz, kaplarından yemeniz meselesi (nin cevabı) şudur. Başkasını bulursanız onların kaplarından yemeyin! bulamazsanız o kapları yıkayın sonra onlardan yeyîn. Zikrettiğin av yerinde bulunman meselesine gelince: Yayınla elde ettiğin avı üzerine besmele çek sonra ye ! Öğretilmiş köpeğinle elde ettiğin ava dahi besmele çek sonra ye. Öğretilmemiş köpeğinle elde ettiğin ve kesmeye yetiştiğin avı da ye!» buyurdular",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4984,
			"arabicnumber": "1930.02",
			"text": "{…} Bana Ebû't-Tâhir de rivayet etti. (Dediki): Bize ibnü Vehb haber verdi. H. Bana Züheyr b. Harb dahi rivayet etti. (Dediki): Bize El-Mukrl rivayet etti. Her iki ravi Hayve'den bu isnadla ibnü Mübarek'in hadisi gibi rivayette bulunmuşlardır. Şu kadar varki İbnû Vehb hadîsinde yay avını zikretmemiştir. izah: Bu hadisi Buhârî «Zebaih» bahsinde; Ebû Dâvûd ile Nesâî ve ibnû Mâce «Kitâbu's-Sayd»'da; Tirmizî «Siyer» bahsinde muhtelif râvilerden tahric etmişlerdir. Hz. Ebû Sa'lebe «Bize ehli kitap bir kavmin toprağındayrz» sözüyle Şam'ı kastetmiştir. Arab kabilelerinden bazıları Şam'a yerleşmiş ve Hıristiyanlığı kabul etmişlerdi, Gassân ve Huzâa kabileleri bunlardandır. Ebû Sa'lebe (Radiyallahû anh) iki mes'ele sormuştur. Bunlardan birincisi ehli kitabın kaplarından yeyip içmenin helâl olup olmadığıdır. Resûlullah (Sallallahu Aleyhi ve Sellem) buna: «Başkasını bulursanız onların kaplarından yemeyin! bulamazsanız onları yikayın da öyle yiyin» diye cevab vermiştir. Bu tafsilât başka kab buldukları zaman ehli kitabın kaplarını kullanmanın mekruh olmasını iktiza eder. Halbuki fukaha ehli kitabın kaplarından başkası bulunsun bulunmasın yıkamak şartıyle bu kaplardan yeyip içmenin kerahetsiz caiz olduğunu söylemişlerdir. Bu mes'elenin cevabı şudur: Yasaklanmadan murad içerisinde domuz eti pişirilen kaplarla şarap kaplarıdır. Bunlar yıkandığı halde kullanılmasının yasak edilmesi iğrençliğinden ve pislik konmak için hazırlanmış olduklarmdandır. Fukahanın muradı ise, küffârın ekseriyetle necasette kullanmadıkları kaplarıdır. Bu meseleyi Allâme Aynî şöyle tahkik etmiştir: «Ebû Sa'lebe hadîsinde zahir asla tercih edilmiştir. Çünkü esas ehli kitap ile mecûsilerin kaplarının temiz olmasıdır. Bununla beraber başkası bulunmazsa bu kapları yıkayarak kullanmak emir buyurulmuştur. Doğrusu şudur ki; pis olduğu tahakkuk edinceye kadar hüküm asla göre verilir. Hadise cevap vermeye ondan sonra ihtiyaç messeder. Hadîse iki cevap verilmiştir: 1-Yıkama emri ihtiyat içindir. Yani yıkamak müstehabdır. 2- Hadisden murad kapların pis olduğu muhakkak, bulunduğuna göredir. Ebû Dâvud'un rivayetinde: «Biz ehli kitab ile komşu yaşıyoruz. Onlar tencerelerinde domuz pişiriyor, kaplarından şarap içiyorlar.» buyurulmasıda buna delalet eder. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Başkasını bulursanız onların kaplarından yiyip içmeyin bulamazsanız su ile yıkayın ondan sonra yiyip için» buyurmuştur. ikinci mesele: Yayla ve Öğretilmiş yahut Öğretilmemiş köpekle avlanmadır. Resûlullah (Sallallahu Aleyhi ve Sellem)'in bu suale verdiği cevapdan şu hükümler çıkarılmıştır. 1- Üzerine besmele çekmek şartıyîe yayla avlanmak caizdir. 2- Besmele şarttır. 3- Köpeğin öğretilmiş olması lâzımdır. Bu köpeğin getirdiği avın yenmesi için köpeği salarken üzerine besmele çekmek şarttır. Öğretilmemiş köpeğin getirdiği av diri olarak ele geçerde kesilirse yenir. Aksi taktirde yenmez. 4- Hadisi Şerifde köpek mutlak zikredilmiştir. Binaenaleyh beyaz siyah vs. her renkdeki köpeğe şâmildir. imam Ahmed kara köpekle öğretilmiş bile olsa avlanmak caiz değildir demiştir. Hadisi şerif onun aleyhine delildir. 5- Köpekle avcılıkta iki şart dermeyan edilmiştir. Biri köpeğin öğretilmiş oiması diğeri besmele. Binaenaleyh bir kimse öğretilmemiş köpeği ava salsa yahut öğretilmiş köpeği besmelesiz gönderse yahut kendinin salmadığı bir köpek ona av getirse bu avlar ancak kesilmek suretiyle helal olur",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4985,
			"arabicnumber": "1931.01",
			"text": "Bize Muhammed b. Mihran Er-Râzi rivayet etti. (Dediki) Bize Ebû Abdullah Hammâd b. Hâlid el Hayyad, Muaviye b. Salih'den o da Abdurrahman b. Cübeyr'den, o da babasından, o da Ebû Sa'lebe'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. (Şöyle buyurmuşlar): «Okunu attığın zaman av senden gâib olur da arkasından yetişirsen kokmadıkça onu ye",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4986,
			"arabicnumber": "1931.02",
			"text": "Bana Muhammed b. Ahmed b. Ebî Halef de rivayet etti. (Dediki): Bize Ma'n b. isa rivayet etti. (Dediki): Bana Muâviye, Abdurrahman. b. Cübeyr b. Nüfeyr'den o da babasından, o da Ebû Sa'lebe'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den üç günden sonra avına yetişen hakkında: «Öyle ise kokmadikça onu ye!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4987,
			"arabicnumber": "1931.03",
			"text": "Bana Mubammed b. Hatim dahi rivayet etfi. (Dediki): Bize Abdurrahman b. Mehdî, Muaviye b. Salih'den, o da Alâ'dan, o da Mekhûl'den, o da Ebû Salebet'el Huşenî'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen av hakkındaki hadisini rivayet etti. Sonra ibni Hatim şunu söyledi: Bize ibnî Mehdi Muâviye'den o da Abdurrahman b. Cübeyr ile Ebû'z-Zahiriyye'den o da Cübeyr b. Nüfeyr'den o da Ebû Sa'lebete-l'Huşeni'den Âlâ 'nın hadîsi gibi rivayette bulundu. Yalnız o kokusunu zikretmedi de köpek hakkında şöyle dedi: «Onu üç günden sonra ye meğerki kokmuş ola; o taktirde onu bırak!» izah: Bu hadisdeki yasaklama kerahat-i tenzihiye manasına hamledilmiştir. Çünkü kokmanın bir şeyin haram kılınmasında tesiri yoktur; İbn-i Melek: «Nebi (Sallallahu Aleyhi ve Sellem)efendimizin kokusu değişmiş bir yemek yediği rivayet olunmuştur.» diyor. Nevevî de şunları söylemiştir: «Kokmuş yemeği yemekten nehiy tahrim değil tenzih manasına hamledümiştir. Sair kokmuş etlerle yiyecekleri yemek de mekruh olup haram değildir. Meğer ki zararından korkmuş ola. Bazı ulemâmız kokmuş etin haram olduğunu söylemişlerse de bu kavil zayıftır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4988,
			"arabicnumber": "1932.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile ishak b. ibrahim ve ibni Ebi Ömer rivayet ettiler. (ishâk) «Ahberenâ» dedi. ötekiler: «Bize rivayet etti» tabirini kullandılar. (Dedilerki): Bize Süfyân b. Uyeyne, Zührî'den, o da Ebû idrîs'den, o da Ebû Sa'Iebe'den naklen rivayet etti. (Şöyle demiş): Nebi (Sallallahu Aleyhi ve Sellem) yırtıcı hayvanların azı dişlilerini yemekten nehiy buyurdu. ishâk ile İbni Ebi Ömer kendi hadislerinde şu cümleyi ziyade ettiler. Zühri Dediki: Ama biz bunu Şam'a gelinceye kadar işitmedik»",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4989,
			"arabicnumber": "1932.02",
			"text": "Bana Harmele b. Yahya da rivayet etti. (Dediki): Bize ibnû Vehb haber verdi. (Dediki): Bana Yûnus, ibni Şihab'dan o da Ebû idris el-Havlâni'den naklen haber verdi ki Ebû idris, Ebû Sa'lebetel Huşenî'yi şunu söylerken işitmiş: Resûlullah (Sallallahu Aleyhi ve Sellem) yırtıcı hayvanlardan azı dişlileri yemekten nehiy buyurdu. Ibnü Şinâb Demişki: «Ben bunu Hicazdaki ulemamızdan işitmedim. Nihayet bana Ebû idris rivayet etti. Kendisi Şamlıların fukahasından idi»",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4990,
			"arabicnumber": "1932.03",
			"text": "Bana Harun b. Saîd El-Eyli de rivayet etti. (Dediki): Bize ibni Vehb rivayet etti. (Dediki): Bize Amr (yani İbnül-Haris) haber verdi. Ona da İbnü Şihab, Ebû idris El-Havlânî'den, o da Ebû Sa'Iebetel Huşenî'den naklen rivayet etmiş ki: Resûlullah (Sallallahu Aleyhi ve Sellem) yırtıcı hayvanlardan her azı dişliyi yemeyi yasak etmiş",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4991,
			"arabicnumber": "1932.04",
			"text": "{…} Bana bu hadisi Ebû't-Tahir de rivayet etti. (Dediki): Bize ibnû Vehb haber verdi. (Dediki): Bana Malik b. Enes ile ibni Ebî Zi'b, Amr b. Haris, Yûnus b. Yezid ve başkaları haber verdi. H. Bana Muhammed b. Râfi' ile Abd b. Humeyd, Abdurrezzak'dan o da Ma'mer'den naklen rivayet ettiler. H. Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Yûsuf b. Mâcişûn haber verdi. H. Bize Hulvanî ile Abd b. Humeyd, Ya'kub b. ibrahim b. Sa'd'dan rivayet ettiler. (Demiki): Bize babam, Sâlih'den rviâyet etti. Bu râvîlerin hepsi bu isnadla Zührî'den Yûnus ve Amr'ın hadisleri gibi rivayette bulunmuş. Hepsi yemeyi zikretmiştir yalnız Salih ile Yûsuf müstesna. Zîra onların hadisi: «Yırtıcıların her azı dişlisinden nehiy buyurdu» şeklindedir. İzah 1934 te",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4992,
			"arabicnumber": "1933.01",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Abdurrahman (Yani ibni Mehdi) Malik'den, o da ismail b. Ebî Hakîm'den, o da Abide b. Süfyan'dan, o da Ebû Hureyre'den o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti: «Yırtıcılardan her azı dîşlinin yenmesi haramdır» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4993,
			"arabicnumber": "1933.02",
			"text": "{…} Bana bu hadisi Ebu't-Tahir de rivayet etti. (Dediki): Bize ibni Vehb haber verdi. (Dediki): Bana Malik b. Enes bu isnadla bu hadisin mislini haber verdi. İzah 1934 te",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4994,
			"arabicnumber": "1934.01",
			"text": "Bize übeydullah b. Muâz El-Anberî rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, Hakem'den, o da ibnû Abbas'dan naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem) yırtıcıların her azı dişlisinden ve kuşların her pençelisinden nehiy buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4995,
			"arabicnumber": "1934.02",
			"text": "{…} Bana Haccâc b. Şâir de rivayet etti. (Dediki): Bize Sehl b. Hammad rivayet etti. (Dediki): Bize Şu'be bu isnadîa bu hadisin mislini rivayet eyledi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4996,
			"arabicnumber": "1934.03",
			"text": "{…} Bize Ahmed b. Hanbel de rivayet etti. (Dediki): Bize Süleyman b. Davud rivayet etti. (Dediki): Bize Ebû Avâne rivayet etti. (Dediki): Bize Hakem île Ebû Bişr, Meymûn b. Mihrân'dan, o da îbnû Abbas'dan naklen rivâyet ettilerki: Resûlullah (Sallallahu Aleyhi ve Sellem) yırtıcıların her azı dişlisinden ve kuşların her pençelisinden nehîy buyurmuş",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4997,
			"arabicnumber": "1934.04",
			"text": "{…} Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Hüseyni, Ebû Bişr'den naklen haber verdi. H. Bize Ahmed b. Hanbeî de rivayet etti. (Dediki): Bize Hüşeym rivayet etti. Ebû Bişr Demişki: Bize Meymûn b. Mihrân, îbnû Abbas'dan naklen haber verdi. îbnû Abbas ise Nehiy buyurdu» demiş. H Bana Ebû Kâmil el-Cahderî dahi rivayet etti. (Dediki): Bize Ebû Avâne, Ebû Bişr'den. o da Meymûn b. Mihran'dan, o da ibni Abbas'dan naklen rivayet etti. ibnü Abbas Şu'be'nin Hakem'den rivayet ettiği hadis gibi: «Resûlullah (Sallallahu Aleyhi ve Sellenı) nehiy buyurdu.» demiş",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4998,
			"arabicnumber": "1935.01",
			"text": "Bize Ahmed b. Yûnus rivayet etti. (Dediki): Bize Züheyr rivayet etti. (Dediki): Bize Ebû'z-Zübeyr Câbir'den (rivayet etti.) H. Bize bu hadîsi Yahya b. Yahya da rivayet etti. (Dediki): Bize Ebû Hayseme, Ebû'z-Zübeyr'den o da Câbir'den naklen haber verdi. Câbir şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) bizi gönderdi üzerimize de Ebû Ubeyde'yi kumandan tayin etti. Kureyşin bir kervanı üe karşılaşacaktık. Bize azık olarak bir dağarcık kuru hurma verdi başkasını bulamadı. Ebû Ubeyde bize birer hurma veriyordu. (Ebû'z Zübeyr) diyor ki: Ben bununla ne yapıyordunuz diye sordum. — Onu çocuğun emdiği gibi emiyor; sonra üzerine su içiyorduk. Bu bize o gün geceye kadar yetiyordu. Bir de sopalarımızla selem ağacını yaprağını silkiyor sonra onu su ile ıslatarak yiyorduk -dedi- (ve devamla) şunları söyledi: — Deniz boyuna gittik derken denizin boyunda bize yüksek kum tepesi şeklinde bir şey yükseldi. Ona vardık. Bir de ne görelim. Balina denilen hayvan!.. Ebû Ubeyde: — Bu laşedir, dedi. Sonra: — Hayır. Biz Resûlullab (Sallallahu Aleyhi ve Sellem)'in elçileriyiz ve Allah yolundayız, siz muztar da kaldınız. Bimaenaleyh yeyin! dedi. Artık onun yanında bir ay kaldık. Üç yüz kişi idik. Hattâ semizledik. Vallahi kendimizi onun gözünün içinden testilerle iç yağı aldığımızı görmüşümdür. Ondan öküz gibi (yahut öküz kadar) parçalar kesiyorduk. Gerçekten Ebû Ubeyde bizden on üç kişi alarak bu hayvanın gözünün içine oturttu. Onun kaburgalarından bir kaburga alarak dikti. Sonra beraberimizdeki en büyük deveyi semerledi ve deve onun altından geçti. Onun etinden et haşlamaları yaptık. Medine'ye geldiğimiz vakit. Resûlullah (Sallallahu Aleyhi ve Sellem)'e giderek onu kendisine anlattık da: «O Allah'ın sîzin için çıkardığı bîr rızıktır. Yanınızda onun etinden bir şey var mı? bize de tatdırın.» buyurdular. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem)'e ondan bir parça gönderdik; o da yedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4999,
			"arabicnumber": "1935.02",
			"text": "Bize AbdûlCebbâr b. Alâ' rivayet etti. (Dediki): Bize Süfyân rivayet etti. (Dediki): Amr, Cabir b. Abdillah'i şöyle derken işitmiş: — Resûlullah (Sallallahu Aleyhi ve Sellem) bizi üç yüz süvari olarak gönderdi. Kumandanımızda Ebû Ubeyde b. Cerrah idi. Kureyşin bir kervanını gözetiyorduk. Bu sebeple sahilde yarım ay kaldık. Şiddetli bir açlığa maruz kaldık. Hattâ siikilmiş yaprak yedik. Bundan dolayı (ordumuza) yaprak ordusu denildi. Derken deniz bize balina denilen bir hayvan attı. Ondan yarım ay yedik. Yağı ile de yağlandık Hattâ vücutlarımız kendine geldi. Ebû Ubeyde onun kaburgalarından bir kaburga alarak dikti. Sonra ordudan en uzun bir adanı ve en uzun bir deve baktı da adamı o deveye bindirdi. Ve altından geçti. Balinanın gözünün içine bir kaç kişi oturdu. Gözünün içinden şu kadar testi yağ çıkardık. Yanımızda bir dağarcık kuru hurma vardı. Ebû Ubeyde (bundan) herbirimize birer fiske veriyordu. Sonra birer tane vermeye başladı. Hurma bitince onun kaybettiğini bulduk",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5000,
			"arabicnumber": "1935.03",
			"text": "Bize Abdulcebbar b. Alâ, rivayet etti. (Dediki): Bize Süfyân rivayet etti. (Dediki): Amr Câbir'i yaprak ordusunda şöyle derken dinlemiş: — Gerçekten bir adam üç tane deve boğazladı, sonra üç daha, sonra Üç daha... Sonra onu Ebû Ubeyde nehyetti",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5001,
			"arabicnumber": "1935.04",
			"text": "Bize Osman b. Ebi Şeybe de rivayet etti. (Dediki): Bize Abde (yani ibnü Süleyman) Hişâm b. Urve'den, o da Vehb b. Keysân'dan, o da Câbir b. Abdillah'dan naklen rivayet etti (Şöyle demiş): Nebi (Sallallahu Aleyhi ve Sellem) bizi üç yüz kişi olduğumuz halde gönderdi. Yiyeceklerimizi boyunlarımızda taşıyorduk",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5002,
			"arabicnumber": "1935.05",
			"text": "Bana Muhammed b. Hatim de rivayet etti. (Dediki): Bize Abdurrahman b. Mehdi, Mâlik b. Encs'den, o da Ebû Nuaym Vehb b. Keysân'dan naklen rivayet etti ona da Câbir b. Abdillah haber vermiş. (Demiki): — Resulullah (Sallallahu Aleyhi ve Sellem) üç yüz kişilik bir müfreze gönderdi. Üzerlerine de Ebû Ubeyde b. Cerrâh'ı kumandan tayin etti derken yiyecekleri bitti ve Ebû Ubeyde yiyeceklerini bir kab'a topladı. Bize yiyeceğimizi veriyordu. Hattâ her birimize günde bir hurma düşüyordu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5003,
			"arabicnumber": "1935.06",
			"text": "{…} Bize Ebû Kureyb dahî rivayet etti. (Dediki): Bize Ebû Usâme rivayet etti. (Dediki): Bize Velid (yani îbn-i Kesir) rivayet etti. (Dediki): Vehb b. Keysân'ı şunu söylerken işittim: Câbir b. Abdillah'ı dinledim. Şunları söylüyordu: — Resûlullah (Sallallahu Aleyhi ve Sellem) deniz sahiline içlerinde benimde bulunduğum bir müfreze gönderdi. Hadisin geri kalan kısmını bütün raviler Amr b. Dînâr ile Ebû'z-Zübeyr hadîsi gibi rivayet etmişlerdir. Yalnız Vehb b. Koysan'ın hadîsinde: «ve ordu ondan onsekiz gece yedi» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5004,
			"arabicnumber": "1935.07",
			"text": "{…} Bana Haccâc b. Şair de rivayet etti. (Dediki): Bize Osman b. Ömer rivayet etti. H. Bana Muhammed b. Rafı' dahi rivayet etti. (Dediki): Bize Ebû'I-Münzir El-Kazzâz rivayet etti. Her iki râvî Dâvud b. Kays'dan o da Ubeydullah b. Miksem'den, o da Câbir b. Abdillah'dan naklen rivayet etmişlerdir. Câbir şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) Cüheyne toprağına bir müfreze gönderdi. Üzerlerine de bir zâtı kumandan tayin etti... Râvî hadîsi yukarkilerin hadisi gibi rivayet etmiştir. izah: Bu hadisi Buhârî «Meğazî» bahsinde tahric etmiştir. Ashab’ın yanlarına aldıkları yiyecekler hususundaki rivayetler muhtelifdir. Bunların bâzısında: «Yiyeceklerimizi boynumuzda taşıyorduk» Diğer bazılarında: «Ebû Ubeyde yiyeceklerini bir kaba topladı*. Bir rivayette «Bize birer fiske verirdi, sonra birer hurma vermeye başladı.» deniliyor. Kaâdi İyâd bunların arasını şöyle bulmuştur. Peygamber (Sallallahu Aleyhi ve Sellem) bu zevatın yanlarında olan yiyeceklerden maada kendilerine bir kap kuru hurma vermiştir. ihtimal kî onların yiyecekleri arasında bu bir dağarcıkdan başka hurma yoktu. Hz. Ebû Ubeyde 'nin onlara birer hurma vermesi yanlarındaki yiyecekler bittikten sonradır. Şu halde hadisin birinci rivayeti hadisenin sonunu haber veriyor demektir. Çünkü zahire göre evvelâ hurmaları birer fiske olarak taksim etmiş; sonra azalınca her kese birer hurma vermeye başlamıştır. Nihayet hurma bitmiş, ashab açlıktan, son derece muzdarip olunca ağaç yaprağı yemiş; bundan sonra Allah Teâla kendilerine balina balığını ihsan etmiştir. Hz. Ebû Ubeyde'nin yiyecekleri bir araya toplaması ashabın rızasıyle olmuştur. O bu hususda Nebi (Sallallahu Aleyhi ve Sellem) Efendimize uymuştur. Resûlullah (Sallallahu Aleyhi ve Sellem) bir çok yerlerde bunu yapmıştır. Eş'arîlerde yiyeceklerini bir araya toplarlardı. Bundan dolayı Resûlullah (Sallallahu Aleyhi ve Sellem) onları medhü sena etmişti. Anber balina balığının bir nevidir. Buna mavi balina denildiği söylenir. Ki balina neviîerinin en büyüğü, olup yüz elli ton ağırlığında olabiliyormuş. Bugün bu hayvanın nesli tükenmek üzere bulunduğu söyleniyor. Hz. Ebû Ubeyde balinayı görünce laşe olduğuna kanaat getirmiş ve kendi içtihadı ile onun yenmesi haram olduğunu söylemiştir. Sonra içtihadı değişmiş ve.: «Bu hayvan ölü de olsa size helaldir, çünkü siz Allah yolunda çalışmaktasınız. Muztar da kaldınız. Muztar kalanlara haddi tecavüz etmemek şartiyle ölü hayvan eti yemeyi Allah Teâla mubah kılmıştır.» demiş, ashab da yemişlerdir. Bu hâdise Nebi (Sallallahu Aleyhi ve Sellem)'e haber verilince: «Bu Allah'ın size çıkardığı bir rızıktır.» buyurarak yediklerinin helal olduğunu bildirmiş. Kendisi de getirilen balina etinden yemiştir. Resûlullah (Sallallahu Aleyhi ve Sellem)'in bunu istemesi helal olduğunu bizzat yemek suretiyle göstererek ashabının kalblerini yatıştırmak içindir. Yahut balina Allah tarafından gönderilme bir yiyecek ve harikulade bir ikram olduğu için onunla teberrük etmek için yemiştir. Hadîsin bir rivayetinde üçer üçer deve boğazladığı bildirilen zât Kays b. Sa'd b. Ubâde (Radiyallahû anh)'dır. Ashabın deniz boyunda ne kadar kaldıkları muhtelif şekillerde rivayet olunmuştur. Bir rivayette bir ay, diğer rivayette on beş gün, başka bir rivayette onsekiz gün kaldıkları bildiriliyor. Bunların arası şöyle bulunmuştur. Esas itibariyle bulundukları yerde bir ay kalmışlardır. Bunu rivayet eden râvi hâdiseyi iyi biliyor demektir. Bîr aydan az kalındığını rivayet edenler de fazlasını nefiy etmemişlerdir. Usûlü fıkhın meşhur kaidesine göre mefhumu adedin hükmü yoktur. Yâni bir şeyde aded bildirmek o adedden fazla olmamasını iktiza etmez. Meselâ «sana bunu on kere söyledim» sözünden noksan ve fazlasız on kere söylemiş olmak lâzım gelmez. Onbeş kere söylemiş de olabilir. Bu kaide muarız delil bulunmadığı zaman böyledir. Halbuki burada fazlayı isbat eden delil vardır. Binaenaleyh onu kabul etmek gerekir. Kaadi İyâd rivayetlerin arasını bulmak için: «Yarım ay kaldık diyen bu müddet zarfında balinadan taze et yediklerini kasdetmiş; bir ay kaldıklarını söyleyen ondan pastırma yaparak ayın yarısından sonra pastırmasını yediklerini anlatmak istemiştir.» diyor",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5005,
			"arabicnumber": "1407.06",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki) Mâlik b. Enes'e, ibni Şihab'dan dinlediğim onunda Muhammed b. Ali'nin iki oğlu Abdullah ile Hasan'den, onlarında babalarından, onun da Ali b. Ebî Tâlib'den naklen rivayet ettiği şu hadisi okudum: «Resûlullah (Sallallalıu Aleyhi ve. Sellem) Hayber (vak'ası) günü kadınlara müi'a yapmaktan ve ehli eşeklerin elinden nehiy buyurdu.»",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5006,
			"arabicnumber": "1407.07",
			"text": "{…} Bize Ebû Bekr b. Ebî Şeybe ile ibnü Numeyr ve Züheyr b. Harb rivayet ettiler. (Dediler ki): Bize Süfyân rivayet etti. Bize ibn-ü Numeyr de rivayet etti. (Dediki): Bize babam rivayet elti. (Dediki): Bize Ubeydullah rivayet etti. H. Bana Ebû't-Tâhir ile Harmele dahî rivayet ettiler. (Dedilerki): Bize ibni Vehb haber verdi (Dedikî): Bana Yûnus haber verdi. H. Bize ishak ile Abd b. Humeyd de rivâyet ettiler. (Dedilerki): Bize Abdûrezzâk haber verdi. (Dediki): Bize Ma'mer haber verdi. Râvilerin hepsi Zührî'den bu isnâdla rivayette bulunmuşlardır. Yunus'un hadisinde: «Ehli eşek etlerini yemekten de» cümlesi vardır. İzah 1940 ta",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5007,
			"arabicnumber": "1936",
			"text": "Bize Hasen b. Aliyy EI-Hulvâni ile Abd b. Humeyd ikisi birden Ya'kub b. ibrahim b. Sa'd'dan rivayet ettiler. (Demişki): Bize babam, Salih'den, o da ibni Şihab'dan naklen rivayet etti. Ona da Ebû idris haber vermiş ki Ebû Sa'Iebe: «Resûlullah (Sallallahu Aleyhi ve Sellem) ehli eşeklerin etlerini haram kıldı.» demiş. İzah 1940 ta",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5008,
			"arabicnumber": "561.03",
			"text": "Bize Muhammed b. Abdillah b. Numeyr rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Ubeydullah rivayet etti. (Dediki): Bana Nafi' ile Salim, ibnü Ömer'den naklen rivayet ettilerki, Resûlullah (Sallallahu Aleyhi ve Sellem) Ehli eşek etlerinin yenmesini yasak etmiş",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5009,
			"arabicnumber": "561.04",
			"text": "Bana Harun b. Abdillah da rivayet etti. (Dediki): Bize Muhammed b. Bekr rivayet etti. (Dediki): Bize tbni Cüreyc haber verdi. (Dediki): Bana Nafi' haber verdi. (Dediki): ibni Ömer şunu söyledi... H. Bize ibni Ebi Ömer dahî rivayet etti. (Dediki): Bize babamla Ma'n b. isa, Malik b. Enes'den. o da Nafi'den o da ibni Ömer'den naklen rivayet ettiler. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem) Hayber (harbi) günü ehli eşekleri ('in yenmesini) yasak etti. insanlar onlara muhtaç olmuşlardı. İzah 1940 ta",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5010,
			"arabicnumber": "1937.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. (Dediki): Bize Alî b. Müshir Şeybânî'den rivayet etti. (Demişki): Abdullah b, Ebi Evfâ'ya ehli eşeklerin etlerini sordum da şunları söyledi: — Hayber günü Resûlullah (Sallallahu Aleyhi ve Sellem)'le beraber olduğumuz halde bize açlık isabet etti. Düşmanın şehirden çıkan eşeklerini ele geçirerek onları boğazladık. Gerçekten çömleklerimiz de kaynıyordu. Birden Resûlullah (Sallallahu Aleyhi ve Sellem)'in dellâlı «Çömlekleri devirin! Eşek etlerinden hiç bir şey yemeyin!» diye nida etti. Ben onları neden haram etti acaba? dedim. Abdullah: Biz aramızda söz ettik ve Onları kat'i surette haram etti: hem onları beşte biri alınmadığı için haram etti dedik",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5011,
			"arabicnumber": "1937.02",
			"text": "Bize Ebû Kâmil Fudayl b. Hüscyn de rivayet etti. (Dediki): Bize Abdülvâhit (yani ibni Ziyad) rivayet etti. (Dediki): Abdullah b. Ebî Evfâ'yı şunu söylerken işittim: — Hayber gecelerinde bize açlık isabet etti. Hayber (vak'ası) günü gelince, ehli eşeklere tesadüf ederek onları boğazladık. Çömlekler onlarla kaynarken Resûlullah (Sallallahu Aleyhi ve Sellem)'in dellâlı: — Çömlekleri devirin ve eşeklerin etlerinden hiç bir şey yemeyin! diye nida elti. Bunun üzerine bazı kimseler: Resûlullah (Sallallahu Aleyhi ve Sellem)'in bunu yasak etmesi ancak beşte biri alınmadığı içindir, dedi. Diğerleri de onları kat'i olarak yasak etti. dediler. İzah 1940 ta",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5012,
			"arabicnumber": "1938.01",
			"text": "Bize Uheydullah b. Muâz rivayet etti. (Dediki): Bize Şu'be. Adiy'den rivayet etti. (Bu zat ibnû Sabit'tir) Demişki: Bera' ile Abdullah b. Ebi Evfa'yi şunu söylerken işittim: Bir takım eşekler ele geçirdik ve onları pişirdik, bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem)'in dellâlı nida etti. «Çömlekleri devirin!..»",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5013,
			"arabicnumber": "1938.02",
			"text": "Bize ibni Müsenna ile ibni Beşşâr da rivayet ettiler, (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Ebû ishâk'dan rivayet etti. (Demşiki): Bera' şunu söyledi: Hayber günü bir takını eşekler ele geçirdik onun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem)'in dellalı: «Çömlekleri devirin!);- diye nida etti",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5014,
			"arabicnumber": "1938.03",
			"text": "Bize Ebû ile ishâk b. ibrahim de rivayet ettiler. Ebû Kureyb (Dediki): Bize ibni Bişr, Misar'dan, o da Sabit b. Ubeyd'den naklen rivayet etti. (Demşiki): Berâ'ı dinledim: «Biz ehli eşeklerin etlerinden nehyolunduk» diyordu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5015,
			"arabicnumber": "1938.04",
			"text": "Bize Züheyr b. Harb da rivayet etti. (Dediki): Bize Cerir, Âsim'dan, o da Şa'bî'den o da Bera' b. Âzib'den naklen rivayet etti. Bera şöyle demiş: Bize Resûlullah (Sallallahu Aleyhi ve Sellem) gerek çîğ, gerek pişmiş bütün ehli eşek etlerini atmamızı emir buyurdu. Sonra (bir daha) eşek yemeyi bize emretmedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5016,
			"arabicnumber": "1938.05",
			"text": "{…} Bana bu hadisi Ebû Saîd El-Eşecc dahi rivayet etti. (Dediki); Bize Hafs (yani ibni Gıyâs) Âsim'dan hu isnadla Bu hacdisin benzerini rivayet elti. İzah 1940 ta",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5017,
			"arabicnumber": "1939",
			"text": "Bana Ahmed b. Yûsuf El-Ezdî rivayet elti. (Dediki): Bize Ömer b. Hafs b. Gıyâs rivayet etti. (Dediki): Bize babam Asim'dan, o da Âmir'den, o da İbni Abbas'dan naklen rivayet etti. îbni Abbâs şöyle demiş: Bilmiyorum Resûlullah (Sallallahu Aleyhi ve Sellem)'in eşeği yasak etmesi ancak ve ancak insanların taşıma vasıtası olduğundandır. O halde yük taşıma vasıtalarının elden gideceğinden çekinmiştir. Yahut onu (yani) ehli eşek etlerini Hayber gününde haram kılmıştır. İzah 1940 ta",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5018,
			"arabicnumber": "1802.03",
			"text": "Bize Muhammed b. Abbâd ile Kuieybe b. Saîd rivayet ettiler. (Dedilerki): Bize Hatim -Bu zât Îbni ismail'dir- Yezîd b. Ebi Ubeyd'den, o da Seleme b. Ekva'dan naklen rivayet etti. Seleme şöyle demiş. «Resûlullah (Sallaîlahu Aleyhi ve Sellem) ile birlikte Hayber'e çıktık sonra gerçekten Allah onu müslümanlara açtı. Onun fethedildiği gün, cemaat akşamlayınca bir çok ateşler yaktılar. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) «Bu ateşler ne? (Onları) ne üzerine yakıyorsunuz?» diye sordu. Ashâb: — Et üzerine, dediler. «Ne eti üzerine?» buyurdu. — Ehli eşek etleri üzerine, cevabını verdiler. Resûlullah (Sallallahu Aleyhi ve Sellem): «Onları dökün ve kırın!» buyurdu. Bir adam: — Yâ Resûlullah yahut onları dökelim ve yıkayalım, dedi. «Yahut öyle olsun» buyurdular",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5019,
			"arabicnumber": "1802.04",
			"text": "{…} Bize ishâk b. ibrahim de rivayet etti. (Dediki): Bize Hammâd b. Mes'ade ile Safvan b. isâ haber verdiler. H. Bize Ebû Bekr b. Nadr da rivayet etti. (Dediki): Bize Ebû Âsim En-Nebîl rivayet etti. Bu râvilerin hepsi Yezid b. Ebî Ubeyd'den bu isnâd ile rivayette bulunmuşlardır. (Sallallahu Aleyhi ve Sellem) Ebû Talha'ya emir buyurdu. O da? İzah 1940 ta",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5020,
			"arabicnumber": "1940.01",
			"text": "Bize ibni Ebî Ömer de rivayet etti. (Dediki): Bize Süfyân Eyyûb'dan o da Muhammed'den, o da Enes'den naklen rivayet etti. Enes şöyle demiş: Resûluilah (Sallallahu Aleyhi ve Sellem) Hayberi feth edince şehrin dışında, bir takım eşekler ele geçirdik ve onlardan yemek yaptık. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem)'in dellalı: Dikkat!.. Allah ve Resulü sîzi bunlardan nehy ediyor lar. Çünkü bunlar şeytan işinden bir pisliktirler! diye nida etti. Hemen çömlekler içlerindeki ile devrildi. Onlar içlerinde olan etlerle kayniyorlardı",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5021,
			"arabicnumber": "1940.02",
			"text": "Bize Muhammed b. Miııhal Ed-Darîr rivayet etti. (Dediki) Bize Yezid b. Zürey' rivayet etti. (Dediki): Bize Hişam b. Hassan, Muhammed b. Sîrîn'den, o da Enes b. Mâlik'den naklen rivayet etti. Enes şöyle demiş Hayber gazası olunca bir zât gelerek: — Yâ Resûlullah, eşekler yenildi dedi. Sonra bir başkası gelerek: — Ya Resûlellah eşekler ifna edildi dedi. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) Ebû Talha'ya emir buyurdu. Oda; — Gerçekten Allah ve Resulü sizi eşek etleri yemekten nehyediyorlar. Çünkü onlar rics'dir. Yahut necistir! diye nida etti ve hemen çömlekler içlerinde olanlarla birlikte devrildiler",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5022,
			"arabicnumber": "1941.01",
			"text": "Bize Yahya b. Yahya ile Ebû'r-Rabi El-Ateki ve Kuteybe b. Saîd rivayet eltiler. Lafız Yahyanındir. (Yahya Bize haber verdi tabirini kullandı. Ötekiler bize Hammâd b. Zeyd rivayet etti dediler.) Hammad, Amr b. Dinar'dan, o da Muhammed b. Ali'den, o da Câbir b. Ahdillah'dan naklen rivayet etmişki: Resûlullah (Sallallahu Aleyhi ve Sellem) Hayber günü ehli eşeklerin etlerini yasak etmiş; at etlerine izin vermiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5023,
			"arabicnumber": "1941.02",
			"text": "Bana Muhammed b. Hatim de rivayet etti. (Dediki): Bize Muhammed b. Bekr rivayet etti. (Dediki): Bize ibnü Cüreyc haber verdi. (Dediki): Bana Ebû'z-Zübeyr haber verdi ki kendisi Câbir b. Abdillah'ı şunu söylerken işitmiş: — Biz Hayber zamanı at ve yaban eşeklerini yedik ama bizi Peygamber (Sallallahu Aleyhi ve Sellem) ehli eşekten nehy buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5024,
			"arabicnumber": "1941.03",
			"text": "{…} Bana bu hadisi Ehû't-Tahir dahi rivayet etti. (Dediki): Bize ibni Vehb haber verdi. H. Bana Ya'kub Ed-Devraki ile Ahmed b. Osman En-Nevfelî de rivayet ettiler. (Dedilerki): Bize Ebû Âsim rivayet etti. Her iki râvi îbrû Cüreyc'den bu isnadla rivayette bulunmuşlardır. İzah 1942 de",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5025,
			"arabicnumber": "1942.01",
			"text": "Bize Muhammed b. Abdillah b. Numeyr rivayet etti. (Dediki): Bize babamla Hafs b. Giyâs ve Veki', Hişam'dan o da Fatima'dan, o da Esmâ'dan, naklen rivayet ettiler. Esma şöyle demiş: — Biz Resûlullah (Sallallahu Aleyhi ve Sellem) zamanında bir at keserek yedik",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5026,
			"arabicnumber": "1942.02",
			"text": "{…} Bize bu hadisi Yahya b. Yahya dahi rivayet etti. (Dediki): Bize Ebû Muaviye haber verdi. H. Bize Ebû Kureyb de rivayet etti. {Dediki): Bize Ebû Usame rivayet etti. Her iki râvî Hişâm'dan bu isnadla rivayette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5027,
			"arabicnumber": "1943.01",
			"text": "Bize Yahya b. Yahya ile Yahya b. Eyyûb, Kuteybe ve ibni Hucr, ismail'den rivayet elliler. Yahya b. Yahya Dediki: Bize ismail b. Ca'fer, Abdullah b. Dinar'dan naklen haber verdi ki Abdullah, îbnü Ömer'i şunu söylerken işitmiş: Nebi (Sallallahu Aleyhi ve Sellem)'e kelerin hükmü soruldu da: «Ben onu ne yerim ne de haram kılarım» buyurdular",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5028,
			"arabicnumber": "1943.02",
			"text": "Bize Kuteybe b. Said de rivayet etti. (Dediki): Bize Leys rivayet etti. H. Bana Muhammed b. Rumh da rivayet etti. (Dediki): Bize Leys Nafi'den o da ibni Ömer'den naklen haber verdi. ibnü Ömer şöyle demiş: Bir adam Resûlullah (Sallallahu Aleyhi ve Sellem)'e kelerin yenilip yenilmiyeceğini sordu da: «Onu ben ne yerim ne de haram kılarım» buyurdular",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5029,
			"arabicnumber": "1943.03",
			"text": "Bize Muhammed b. Abdillah b. Numeyr dahi rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Ubeydullah, Nâfi'den, o da ibni Ömer'den naklen rivayet etti. (Şöyle demiş): Bir adam Resûlullah (Sallallahu Aleyhi ve Sellem)'e minberi üzerindeyken kelerin yenilip yenilmiyeceğini sordu da: «Onu ben ne yerim ne de haram kılarım» buyurdular",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5030,
			"arabicnumber": "1943.04",
			"text": "{…} Bize Ubeydullah b. Saîd de rivayet etti. (Dediki): Bize Yahya, Ubeydullah'dan bu hadisin mislini bu isnadda rivayet etti",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5031,
			"arabicnumber": "1943.05",
			"text": "{…} Bize bu hadîsi Ebu'r-Rabî' ile Kuteybe de rivayet ettiler. (Dedilerki): Bize Hammâd rivayet etti. H. Bana Züheyr b. Harb dahi rivayet etti. (Dediki): Bize ismail rivayet etti. Her rki râvi Eyyûbdan rivayet etmişlerdir. H. Bize ibni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Mâlik b. Miğvel rivayet tîtti. H. Bana Hârûn b. AbdilIah dahî rivayet etti. (Dsdiki): Size Muhammed b. Bekr haber verdi. (Dediki): Bize ibni Cüreyc haber verdi. H. Bize yine Hârûn b. Abdillah rivayet etti. (Dediki): Bize Şûca' b. Velid rivayet etti. (Dediki): Musa b. Ukhe'den dinledim. H. Bize Harun b, Saîd El-Eylî de rivayet etti. (Dediki): Bize ibnî Vehb rivayet etti. (Dediki): Bana Usâme haber verdi. Bu râviîerin hepsi Nâfi'den, o da ibnî Ömer'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den keler hakkında Leys'in Nâfi'den naklettiği hadis manasında rivayette bulunmuşlardır. Yalnız Eyyub'un hadisi: «Resûlullah (Sallallahu Aleyhi ve Sellem)'e bîr keler getirdiler de onu yemedi. Ama haram da kılmadı» tarzındadır. Usame'nin hadisinde ise: «Dediki Resûlullah (Sallallahu Aleyhi ve Sellem) minberde iken mescidde bir adanı ayağa kalktı» cümlesi vardır. İzah 1951 de",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5032,
			"arabicnumber": "1944.01",
			"text": "Bize Ubeydullah b. Muâz rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, Tevbetü'l-Anberî'den naklen rivayet etti. O da Şa'bî'den, o da ibni Ömer'den dinlemiş ki: Nebi (Sallallahu Aleyhi ve Sellem)'in yanında içlerinde Sa'd da olduğu halde ashabından bazı kimseler bulunuyormuş. Kendilerine keler eti getirmişler de Nebi (Sallallahu Aleyhi ve Sellem)'in kadınlarından biri: Bu keler eti'dir diye seslenmiş. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Yeyin! Çünkü o helaldir. Lâkin benim yiyeceğim de değildir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5033,
			"arabicnumber": "1944.02",
			"text": "{…} Bize Muhammed b. Müsenna da rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Tevbetul-Anberî'den rivayet etti (Demişki): Bana Şu'be şunu söyledi: Hasen'in Peygamber (Sallallahu Aleyhi ve Selleın)'den rivayet ettiği hadis'e ne dersin! Ben ibnü Ömer'le iki yahut bir buçuk seneye yakın beraber oturdum da onun Nebi (Sallallahu Aleyhi ve Selleın)'den bu hadtsden başka bir rivayetini duymadım. (Şöyle dedi): içlerinde Sa'd da olduğu halde Peygamber (Sallallahu Aleyhi ve Sellem)'în ashabından bazı kimseler... Râvi Muâz hadisi gibi rivayette bulunmuştur. İzah 1951 de",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5034,
			"arabicnumber": "1945.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e îbni Şihab'dan dinlediğim, onun da Ebû Ümâms b. Sehl b. Huneyf'den, onun da Abdullah b. Abbas'dan naklen rivayet ettiği şu hadisi okudum. ibnü Abbas şöyle demiş: Ben ve Hâlid b. Velîd Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte Meymûne'nin evine girdik. Az sonra kızartılmış keler getirildi ve Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte Meymûne'nin evine girdik. Az sonra kızartılmış keler getirildi ve Resûlullah (Sallallahu Aleyhi ve Sellem) eliyle ona uzandı bunun üzerine Meymûne'nin evinde bulunan kadınlardan biri: — Resûlullah (Sallallahu Aleyhi ve Sellem)'e yemek istediği şeyi ('n ne olduğunu) haber verin dedi. Resûlullah (Sallallahu Aleyhi ve Sellem) de elini kaldırdı. Ben: — Bu harammıdır Yâ Resûlallah? dedim. «Hayır lâkin bu hayvan benim kavmimin toprağında yoktu bundan dolayı kendimi ondan tiksinir buluyorum» buyurdular. Halid Demişki: Ben onu çekerek bir güzel yedim. Resûlullah (Sallallahu Aleyhi ve Sellem) de bakıyordu. İzah 1951 de",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5035,
			"arabicnumber": "1946.01",
			"text": "Bana Ebû't-Tahir ile Harmele hep birden ibni Vehb'den rivayet ettiler. Harmele Dediki. Bize ibnî Vehb haber verdi. (Dediki): Bana Yûnus, ibni Şihâb'dan, o da Ebû Ümame b. Sehl b. Huneyf El Ensâri'den naklen haber verdi. Ona da Abdullah b. Abbâs haber vermiş. Ona da kendisine Seyfullah denilen Hâlid b. Velid haber vermiş ki Kendisi Resûlullah (Sallallahu Aleyhi ve Selleın)'le birlikte Nebi (Sallallahu Aleyhi ve Selleın)'in zevcesi Meymûnenin yanına girmişler. Meymûne hem Hâlid'in hem ibni Abbas'ın teyzesîdir. Onun yanında kızartılmış keler bulmuş. Bunu Meymûne'nin kız kardeşi Hufeyde binti Haris Necid'den getirmemiş. Meymûne keleri Resûlullah (Sallallahu Aleyhi ve Sellem)'e sunmuş. Pek az olurdu ki ona bîr yiyecek sunulsun da o yiyecek'ten bahsedilsin ve ismi söylensin. Resûlullah (Sallallahu Aleyhi ve Sellem) de elîni kelere uzatmış. Bunun üzerine mevcut kadınlardan biri Resûlullah (Sallallahu Aleyhi ve Sellem)'e sunduğun şeyi haber verin! demiş. Kadınlar: — Bu kelerdir yâ Resûlellah! demişler. Resûlullah (Sallallahu Aleyhi ve Sellem) hemen elini kaldırmış. Bunun üzerine Hâlid b. Velid: — Keler harammıdır ya Resûlallah? diye sormuş. «Hayır, Lakin o benim kavmimin toprağında yoktur. Bundan dolayı kendimi ondan tiksinir (buluyorum» buyurmuşlar. Halid şöyle demiş: Ben keleri çekerek bir güzel yedim. Resûlullah da bakıyordu. Ama beni menetmedi)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5036,
			"arabicnumber": "1946.02",
			"text": "Bana Ebû Bekr b. Nadr ile Abd b. Humeyd de rivayet ettiler. Abd: Bana baber verdi tabirini kullandı. Ebû Bekir ise Bize Ya'kub b. îbrabim b. Sa'd rivayet etti, dedi. (Demişki): Bize babam Salih b. Keysân'dan o da Ebû Ümame b. Sehl'den, ona da ibni Abbâs haber vermiş olarak rivayet etti. Ona da Hâlid b. Velîd haber vermiş ki Kendisi Resûlullah (Sallallahu Aleyhi ve Sellem)'e keler eti sunulmuş. Bunu Ümmü Hufeyd binti Haris Necid'den getirmişmiş. Bu kadın Benî Ca'fer'den bir adamın nikâhı altında îdi. Resûlullah (Sallallahu Aleyhi ve Sellem) ne olduğunu bilmedikçe bir şey yemezdi... Sonra râvi Yûnus'un hadisi gibi anlatmış ve hadisin sonuna şunu ziyâde etmiştir: «Ona ibni Esamm da Meymûne'den naklen rivayet etmiş. Bu zât Meymûne'nin terbiyesi altında idi.»",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5037,
			"arabicnumber": "1945.02",
			"text": "{…} Bize Abd b. Humeyd rivayet etti. {Dediki): Bize Abdurrezzâk haber verdi. (Dediki): Bize Ma'mer Zührî'den, o da Ebû Ümame b. Huneyf'den, o da ibnü Abbâs'dan naklen haber verdi. (ŞÖyle demiş): Biz Meymûne'nin «evinde iken Nebi (Sallallahu Aleyhi ve Sellem)'e iki kızartılmış keler getirdiler... Hadîs yukarkilerin hadîsi gibi rivayet olunmuştur. Râvi : Yezîd b. Esamm'ın Meymûne'den rivayetini anmamıştır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5038,
			"arabicnumber": "1945.03",
			"text": "{…} Bize Abdülmelik b. Şuayb b. Leys de rivayet etti. {Dediki): Bize babam dedemden rivayet etti. (Demişki): Bana Hâlid b. Yezid riva­yet etti. (Dediki): Bana Saîd b. Ebi Hilal, ibni Münkedir'den rivayet etti. Ona da Ümame b. Sehl ibni Abbas'dan naklen haber vermiş. ibni Abbâs (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem)'e, Meymûne'nin evinde ve yanında Hâlid b. Velid bulunduğu halde keler eti getirildi... Ve Zührî'nin hadîsi ma'nasında rivayette bulunmuştur. İzah 1951 de",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5039,
			"arabicnumber": "1947",
			"text": "Bize Muhammed b. Beşşar ile Ebû Bekir b. Nâfi rivayet ettiler. ibnü Nâfi (Dediki): Bize Gunder haber verdi. (Dediki): Bize Şu'be Ebi Bişr'den o da, Sâid b. Cübeyr'den naklen rivayet etti. (Şöyle demiş): Ben ibni Abbâs'ı şunları söylerken işittim: Teyzem Ümnıü Hufeyd Resûlullah (Sallallahu Aleyhi ve Sellem)'e yağ, keş ve bir kaç keler hediyye etti. O yağ ile keş'den yedi ama keleri iğrendiği için bıraktı. Bu hayvan Resûlullah (Sallallahu Aleyhi ve Sellem)'in sofrasında yenmiştir. Haram olsaydı Resûlullah (Sallallahu Aleyhi ve Sellem)'in sofrasında yenmezdi. İzah 1951 de",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5040,
			"arabicnumber": "1948",
			"text": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Ali b. Müshir, Şeybânî'den o da Yezid b. Esamm'dan naklen rivayet etti. (Şöyle demiş): Medine'de bizi bir güveyi davet etti de bize on üç tane keler sundu. Kimimiz yedi kimimiz (yemeyip) bıraktı. Ertesi gün ben ibni Abbâs'a rastlayarak ona haber verdim. Etrafındaki cemaat sözü uzattı hatta bazıları: «Resûlullah (Sallallahu Aleyhi ve Sellem) ben onu ne yerim ne men ederim ne de haram kılarım buyurdu.» dediler. Bunun üzerine ibni Abbas: Ne fena söyledin!. Nebiyullah (Sallallahu Aleyhi ve Sellem) ancak helal ve haram kılmak için gönderilmiştir. Şüphesiz ki bir defa Resûlullah (Sallallahu Aleyhi ve Sellem) Meymûne'nin yanında iken beraberinde de Fadl b. Abbas ile Hâlid b. Velid ve bir başka kadın bulunduğu halde kendisine üzerinde et bulunan bir sofra sunuluverdi. Nebi (Sallallahu Aleyhi ve Sellem) yemek isteyince Meymûne ona: Bu keler etidir, dedi. O da elini çekti ve: «Bu benim hiç yememiş olduğum bir ettir.» buyurdu. Cemaat'a: «Siz yeyin» dedi. Ondan Fadl, Halid b. Velîd ve kadın yediler. Meymûne Demişki «Ben hiç bir şeyden yemem. Meğer ki Resûlullah (Sallallahu Aleyhi ve Sellem)'in yediklerinden bir şey ola.» İzah 1951 de",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5041,
			"arabicnumber": "1949",
			"text": "Bize ishak b. ibrahim ile Abd b. Humeyd rivayet ettiler. (Dedilerki): Bize Abdurrezzak, ibnü Cüreyc'den naklen haber verdi. (Demişki): Bana Ebû'z-Zübeyr haber verdi. Kendisi Câbir b. AbdulIah'ı şunu söylerken işitmiş: Resûlullah (Sallallahu Aleyhi ve Sellem)'e bir keler getirdiler, de ondan yemek istemedi. Ve: «Bilmiyorum belki bu sureti değiştirilen kavimlerdendir.» buyurdular. İzah 1951 de",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5042,
			"arabicnumber": "1950",
			"text": "Bana Seleme b. Şebîb rivayet etti. (Dediki): Bize Hasen b. A'yen rivayet etti. (Dediki): Bize Ma'kıl, Ebû'z-Zübeyr'den rivayet etti. Ebû-'z-Zübeyr şöyle demiş: Câbir'e kelerin hükmünü sordum da: Onu yemeyin dedi; onu iğrenç buldu ve şöyle dedi: Ömer b. Hattâb dediki şüphesiz Nebi (Sallallahu Aleyhi ve Sellem) onu haram kılmadı. Allah azze ve celle onunla bir çok kimseleri menfaatlendirir. Umumiyetle çobanların yiyeceği ondandır. Yanımda olsa idi onu bende yerdim. İzah 1951 de",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5043,
			"arabicnumber": "1951.01",
			"text": "Bana Muhammed b. Musenna rivayet etti. (Dediki): Bize îbni Ebi Adiyy Dâvud'dan, o da Ebû Nadra'dan, o da Ebû Saîd'den naklen rivayet etti. Şöyle demiş: Bir adam: Ya Resûlallah! Biz keleri çok bir yerdeyiz, şimdi bize ne emir buyurursun, yahut bize ne fetva verirsin? dedi. «Bana anlatıldığına göre Benî isrâîlden bir Ümmetin suretleri değiştirilmiştir» buyurdu. Fakat ne emretti ne de yasak etti. Ebû Saâd Demişki: Bundan bir kaç zaman sonra Ömer şunu söyledi: «Şüphesiz ki Allah azze ve celle onunla bir çok insanları fâidelendirir, o umumiyetle şu çobanların yiyeceğidir. Yanımda olsaydı ondan mutlaka yerdim. Resûlullah (Sallallahu Aleyhi ve Sellem) sadece ondan iğrenmiştir.»",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5044,
			"arabicnumber": "1951.02",
			"text": "Bana Muhammed b. Hatim rivayet etti. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Ebû Akîl-Ed-Devrakî rivayet etti. (Dediki): Bize Ebû Nadra, Ebû Saîd'den naklen rivayet etti ki: Bedevi'nin biri Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek: — Ben kelerli bir alçakta bulunuyorum. Bu hayvan umumiyetle benim yakınlarımın yiyeceğidir, dedi. Nebi (Sallallahu Aleyhi ve Sellem) ona cevap vermedi. Biz: —. Bu sözü tekrarla dedik, O da tekrarladı. Fakat yine cevap vermedi, (bu) üç defa tekerrür etti sonra üçüncüde Resûlullah (Sallallahu Aleyhi ve Sellem) ona seslenerek: Ey bedevi! Şüphesiz Allah benî isrâilden bir kuşağa lanet buyurmuş yahut gazab etmiş ve onları yer yüzünde debeleyen hayvan kılığına sokmuştur. Bilmiyorum belki bu onlardandır. Binaenaleyh ben onu yemem ama ondan nehiy de etmem.» buyurdular",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5045,
			"arabicnumber": "1952.01",
			"text": "Bize Ebû Kâmil El Cahderî rivayet etti. (Dediki) : Bize Ebû Âvâne, Ebû Ya'fûr'dan, o da Abdullah b. Ebî Evfa'dan naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte yedi gaza yaptık. (Hepsinde) çekirgeleri yiyorduk",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5046,
			"arabicnumber": "1952.02",
			"text": "{…} Bize bu hadîsi Ebû Bekr b. Ebî Şeybe ile ishak b. ibrahim ve ibni Ebî Ömer toptan ibni Uyeyne'den, o da Ebû Ya'fur'dan naklen bu isnadla rivayet ettiler. Ebû Bekr kendi rivayetinde «Yedi gazada» dedi. îshâk «altı gazada» dedi. ibni Ebi Ömer ise: Altı yahut yedi gazada» dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5047,
			"arabicnumber": "1952.03",
			"text": "{…} Bize bu hadîsi Muhammed b. Müsennâ da rivayet etti. (Dediki) : Bize ibni Ebî Adiyy rivayet etti. H. Bize ibni Beşşâr da Muhammed b. Ca'fer'den rivayet etti. Her iki râvi Şu'be'den, o da Ebû Ya'fur'dan bu isnadla rivayette bulunmuşlardır. (Ebû Yaf'ur) «Yedi gazada» demiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5048,
			"arabicnumber": "1953.01",
			"text": "Bize Muhammed b. Müsennâ rivayet etti. (Dediki) : Bize Muhammed b. Ca'fer rivayet etti. (Dediki) : Bize Şu'be, Hişam b. Zeyd'den, o da Enes b. Malik'den naklen rivayet etti. Enes şöyle demiş: — Yürüdük ve Merrü'z-Zahran'dan bir tavşan kaldırdık. Ashab üzerine koştular. Fakat âciz kaldılar. Ben de koştum. Ve ona yetiştim. Tavşanı Ebû Talha'ya getirdim. O hayvanı kesti ve buduyla iki uyluğunu Resûlullah (Sallallahu Aleyhi ve Sellem)'e gönderdi. Bunları Resûlullah (Sallallahu Aleyhi ve Sellem)'e ben götürdüm. O da kabul etti",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5049,
			"arabicnumber": "1953.02",
			"text": "{…} Bu hadîsi bana Züheyr b. Harb da rivayet etti. (Dediki): Bize Yahya b. Saîd rivayet etti. H. Bana Yahya b. Habib de rivayet etti. (Dediki) : Bize Hâlid (Yâni ibni'l Haris) rivayet etti. Her iki râvi Şu'be'den bu isnadla rivayette bulunmuşlardır. Yahya'nın hadîsinde: «Budunu yahut iki uyluğunu gönderdi.» ifadesi vardır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5050,
			"arabicnumber": "1954.01",
			"text": "Bize Ubeydullah b. Muâz El Anberî rivayet etti. (Dediki): Bize babam rivayet etti, (Dediki) : Bize Kehmes, ibnü Büreyde'den rivayet etti. Şöyle demiş: Abdullah b. Mugaffel arkadaşlarından bir adamın ufak taş attığını görmüş de ona : — Taş atma! Çünkü Resûlullah (Sallallahu Aleyhi ve Sellem) taş atmaktan hoşlanmazdı —yahut taş atmayı men ederdi—. Zîra bununla av avlanmaz, düşman da bozulmaz. Lâkin bu taş dişi kırar ve gözü çıkarır, dedi. Bundan bir müddet sonra o zatın taş attığını gördü ve ona şunu söyledi: — Ben sana Resûlullah (Sallallahu Aleyhi ve Sellm)'in taş atmaktan hoşlanmadığını —yahut taş atmaktan nehyettiğini— haber veriyorum, sonra senin taş attığını görüyorum. Seninle şu ve şu müddet zarfında bir tek kelime konuşmam",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5051,
			"arabicnumber": "1954.02",
			"text": "{…} Bana Ebû Dâvud, Süleyman b. Ma'bed rivayet etti. (Dediki): Bize Osman b. Ömer rivayet etti. (Dediki): Bize Kehmes bu isnadla bu hadîsin benzerini haber verdi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5052,
			"arabicnumber": "1954.03",
			"text": "Bize Muhammed b. Müsennâ da rivayet etti. (Dediki): Bize Muhammed b. Ca'fer ile Abdurralıman b. Mehdî rivayet ettiler. (Dedilerki): Bize Şu'be Katade'den, o da Ukbe b. Suhban'dan, o da Abdullah b. Mugaffel'den naklen rivayet etti. Şöyle demiş: — Resûlullah (Sallallahu Aleyhi ve Sellem) ufak taş atmaktan nehiy buyurdu. ibnü Ca'fer kendi hadîsinde şöyle demiştir: «Dediki: Çünkü bu taş ne düşmanı bozguna uğratır. Ne de avı öldürür; Lâkin o dişi kırar ve gözü çıkarır.» ibni Mehdî ise: «Bu taşlar düşmanı bozguna uğratamaz» demiş, «Gözü çıkarır» kaydını anmamıştır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5053,
			"arabicnumber": "1954.04",
			"text": "Bize Ebu Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize ismail b. Uleyye, Eyyub'dan, o da Said b. Cübeyr'den naklen rivayet etti ki; Abdullah b. Mugaffel'in bir yakını taş atmış, o da kendisini menetmiş ve: — Şüphesiz Resûlullah (Sallallahu Aleyhi ve Sellem) taş atmaktan menetmiş ve: «Bu faşlar ne bir av avlar, ne düşman bozar, lâkin bunlar dişi kırar ve gözü çıkarır.» buyurmuştur demiş. Fakat yakını taş atmayı tekrarlamış, o da: — Ben sana Resûlullah (Sallallahu Aleyhi ve Sellem)'in bundan nehiy buyurduğunu anlatıyorum; sonra sen (yine) taş atıyorsun! Seninle ebediyyen konuşmam! demiş",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5054,
			"arabicnumber": "1954.05",
			"text": "{…} Bize bu hadisi İbni Ebî Ömer de rivayet etti. (Dediki) ; Bize Sekafî, Eyyûb'dan bu isnad ile bu hadîsin benzerini rivayet etti. izah: Bu hadîsi Buhârî «Zebâih» bahsinde; Nesâi «Diyât'da tahric etmişlerdir. Hazf: Ufak taş veya çekirdek gibi şeyleri elin baş parmağı ile şehadet parmağının arasına alarak atmaktır. Bundan hiç bir fayda hasıl olmadığı, bilâkis zararından korkulduğu için yasak edilmiştir. Hadîs-i Şerîfte taş atmanın hiç bir fayda temin etmediği «Çünkü o ne düşmanı bozguna uğratır, ne de avı öldürür» cümleleriyle beyan buyurulmuştur. Bu babda ufak taşa benzeyen şeyler de taş hükmündedir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5055,
			"arabicnumber": "1955.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bi­ze ismail b. Uleyye Halid EI-Hazzâ'dan, o da Ebû Kılabe'den, o da Ebû'I-Eş'as'dan, o da Şeddâd b. Evs'den naklen rivayet etti. (Şöyle demiş): iki şey varki, bunları Resûlullah (Sallallahu Aleyhi ve Sellem)'den belledim. Buyurdular ki: «Şüphesiz Allah herşeyde iyiliği farz kılmıştır. O halde siz öldürdüğünüz vakit, öldürmeyi iyi yapın. Kestiğiniz zaman da kesmeyi iyi becerin. Her biriniz bıçağını bilesin. Ve kestiği hayvana rahat versin!»",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5056,
			"arabicnumber": "1955.02",
			"text": "{…} Bu hadîsi bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Huşeym rivayet etti. H. Bize ishâk b. ibrahim dahî rivayet etti. (Dediki): Bize AbdülVelıhab Es-Sekafi haber verdi. H. Bize Ebû Bekir b. Nâfi' de rivayet etti. (Dediki): Bize Gunder rivâyet etti. (Dediki): Bize Şu'be rivayet etti. H. Bize Abdullah b. Abdurrahman Ed-Dârimî de rivayet etti. (Dediki): Bize Muhammed b. Yûsuf Süfyan'dan naklen haber verdi. H. Bize ishâk b. ibrahim dahi rivayet etti. (Dediki): Bize Cerir, Mansûr'dan naklen haber verdi. Bu râvilerin hepsi Hâlid El-Hazzâ'dan İbni Uleyye hadîsinin isnadı ve mânasıyle rivayette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5057,
			"arabicnumber": "1956.01",
			"text": "Bize Muhammed b. Müsennâ rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Hişâm b. Zeyd b. Enes b. Mâlik'i dinledim. Şunları söyledi: — Dedem Enes b. Mâlik ile birlikte hakem b. Eyyub'un evine girdim. Bir de ne göreyim, bir takım adamlar bir tavuğu (hedef) dikmiş, ona ok atıyorlar. Bunun üzerine Enes: «Resûlullah (Sallallahu Aleyhi ve Sellem) hayvanların hapsedilerek öldürülmesini yasak etti.» dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5058,
			"arabicnumber": "1956.02",
			"text": "{…} Bu hadîsi bana Züheyr b. Harb da rivayet etti. (Dediki): Bize Yahya b. Saîd ile Abdurrahman b. Mehdî rivayet ettiler. H. Bana Yahya b. Habîb dahî rivayet etti. (Dediki): Bize Hâlid b. Haris rivayet etti. H. Bize Ebû Kureyb de rivayet etti. (Dediki): Bize Ebû Usâme rivayet etti. Bu râvilerin hepsi Şu'be'den bu isnadla rivayette bulunmuşlardır. İzah 1959 da",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5059,
			"arabicnumber": "1957.01",
			"text": "{M-} Bize Ubeydullah b. Muâz rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, Adiyy'den, o da Saîd b. Cübeyr'den, o da ibni Abbâs'dan naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem): «içinde canı bulunan bîr şeyi hedef ittihaz etmeyin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 5060,
			"arabicnumber": "1957.02",
			"text": "{…} Bize bu hadîsi Muhammed b. Beşşâr da rivayet etti. (Dediki): Bize Muhammed b. Ca'fer ile Abdurrahman b. Mehdî Şu'be'den bu isnadla bu hadîsin mislini rivayet ettiler. İzah 1959 da",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5061,
			"arabicnumber": "1958.01",
			"text": "Bize Şeyban b. Ferrûh ile Ebû Kâmil rivayet ettiler. Lâfız Ebû Kâmil'indir. (Dedilerki): Bize Ebû Avâne, Ebû Bişr'den, o da Saîd b. Cübeyr'den naklen rivayet etti. Saîd şöyle demiş: — îbni Ömer bir tavuğu (hedef) dikerek ona ok atan birkaç kişinin yanına uğradı. Bunlar ibn-i Ömer'i görünce tavuğun semtinden dağıldılar. ibni Ömer: — Bunu kim yaptı? Şüphesiz Resûlullah (Sallallahu Aleyhi ve Sellem) bunu yapana la'net buyurmuştur, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5062,
			"arabicnumber": "1958.02",
			"text": "{…} Bana Züheyr b. Harb da rivayet etti. (Dediki): Bize Huşeym rivayet etti. (Dediki): Bize Ebû Bişr, Saîd b. Cübeyr'den naklen haber verdi. (Şöyle demiş) : — ibni Ömer Kureyş'den birkaç gencin yanına uğradı. Bunlar bir kuş'u hedef dikmiş ona ok atıyorlardı. Oklarından her isabet etmeyeni kuşun sahibine veriyorlardı. ibni Ömer'i görünce dağıldılar. Bunun üzerine ibni Ömer : — Bunu kim yaptı? Bunu yapana Allah lanet eylesin. Şüphesiz Resûlullah (Sallallahu Aleyhi ve Sellem): «Içînde canı olan bir şeyi hedef ittihaz eden kimseyi lanet buyurmuştur.» dedi. İzah 1959 da",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5063,
			"arabicnumber": "1959",
			"text": "Bana Muhammed b. Hatim rivayet etti. (Dediki): Bize Yahya b. Saîd, ibnü Cüreyc'den rivayet etti. H. Bize Abd b. Humeyd de rivayet etti. (Dediki): Bize Muhammed b. Bekr haber verdi. (Dediki): Bize ibni Cüreyc haber verdi. H. Bana Harun b. Abdillah dahi rivayet etti. (Dediki): Bize Haccâc b. Muhammed rivayet etti. (Dediki): ibni Cüreyc şunu söyledi: Bana Ebû'z-Zübeyr haber verdiki; kendisi Câbir b. Abdillah'ı şunu söylerken işitmiş: — Resûlullah (Sallallahu Aleyhi ve Sellem) hayvanlardan birinin kapalı olarak öldürülmesini yasak etti",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 92
			}
		}
	]
}