{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5114,
			"arabicnumber": "977.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5115,
			"arabicnumber": "977.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5127,
			"arabicnumber": "1979.01",
			"text": "(Bize Yahya b. Yahya Et-Temimî rivâyet etti. ki): Bize Haccâc b. Muhammed, İbn-i Cüreyc'den naklen haber verdi. ki): Bana İbn-i Şihâb, Ali b. Hüseyn b. Ali'den, o da babası Hüseyin b. o da Alî b. Ebî Tâlib'den naklen rivâyet etti. (Şöyle dedi): (Harbi) günü Resûlüllah (sallallahü aleyhi ve sellem)'le birlikte ganimetden bana yaşlı bir deve isabet etti. Resûlüllah (sallallahü aleyhi ve sellem) bana bir yaşlı deve daha verdi. Bir gün ben bunları ensardan bir zâtın kapısı önünde çöktürdüm. Satmak için üzerlerine boya otu yüklemek istiyordum. Yanımda Benî Kaynûkaa' kabilesinden bir kuyumcu vardı. Ondan Fâtime'nin düğün daveti hususunda yardım görüyordum. Hamza b. Abdil Muttalip de bu evde içki içiyordu. Yanında şarkı söyleyen bir cariye vardı. Câriye: Yâ Hamza, semiz yaşlı develere dikkat!., dedi. Hamza hemen kılıcıyle onlara sıçrayarak hörgüçlerinî kesti, böğürtlerini yardı. Sonra karaciğerlerinden (birer parça) aldı. Cüreyc diyor ki): Ben İbn-i Şihâb'a: Hörgüçten de mi? diye sordum. Her ikisinin hörgüçlerini kesti ve götürdü, dedi. ibn-i Şihâb ki: Ali şunu söyledi: Beni çileden çıkaran bir manzara görmüştüm. Bunun üzerine Nebiyyullah (sallallahü aleyhi ve sellem)'e geldim. Yanında Zeyd b. Harise vardı. Kendisine haberi ilettim. O da beraberinde Zeyd olduğu halde (dışarı) çıktı. Onunla ben de gittim. Derken Hamza’nın yanına girerek ona öfkelendiğini belli etti. Hamza başını kaldırdı ve: Siz benim babalarımın kölelerinden başka bir şey misiniz? dedi. Resûlüllah (sallallahü aleyhi ve sellem) de gerisin geriye giderek yanlarından çıktı",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5128,
			"arabicnumber": "1979.02",
			"text": "(Bize Abd b. Humeyde rivâyet etti. ki): Bana Abdürrezzâk haber verdi. ki): Bana İbn-i Cüreyc bu isnadla bu hadîsin mislini haber verdi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5129,
			"arabicnumber": "1979.03",
			"text": "(Bana Ebû Bekr b. İshâk da rivâyet etti. ki): Bize Said b. Kesir b. Ufeyr Ebû Osman El-Misrî haber verdi. ki): Bize Abdullah b. Vehb rivâyet etti. ki): Bana Yûnus b. Yezid, İbn-i Şihab'dan rivâyet etti. ki): Bana Ali b. Hüseyn b. Ali haber verdi. Ona Hüseyn b. Ali haber vermiş ki: Ali Şöyle dedi: Benim Bedir günü alınan ganimetten hisseme düşen yaşlı bir devem vardı. Resûlüllah (sallallahü aleyhi ve sellem) o gün ganimetin beşte birinden bir yaşlı deve (daha vermişti. Ben Resûlüllah (sallallahü aleyhi ve sellem)'in kızı Fâtime ile evlenmek isteyince Benî Kaynukaâ kabilesinden kuyumcu bir adamdan benimle beraber geleceğine söz aldım. Boya otu getirecektik. Onu kuyumculara satarak zifaf davetimde menfaatlanmak istiyordum. Ben develerim için ip çuval ve semerlerden müteşekkil eşyayı toplarken, develerim ensardan bir adamın evinin yanı basına çökmüşlerdi. Toplayacağımı topladım, bir de baktım develerimin hörgüçleri kesilmiş; böğürleri delinmiş ve ciğerlerinden bir şeyler alınmış. Onların bu manzarasını görünce göz yaşlarımı tutamadım. Bunu kim yaptı? dedim. Onu Hamza b. Abdilmuttalip yaptı. Hamza şu evde ensardan içkiciler arasında bulunmaktadır. Ona ve arkadaşlarına bir cariye şarkı okudu ve şarkısı esnasında: Yâ Hamza, semiz yaşlı develere dikkat! dedi. Hamza hemen kılıçla kalkarak onların hörgünlerini kesti ve böğürlerini delerek, ciğerlerinden (birer parça) aldı, dediler. Ali ki: Bunun üzerine hen gittim hattâ Resûlüllah (sallallahü aleyhi ve sellem)'in yanına girdim. Yanında Zeyd b. Harise vardı. Resûlüllah (sallallahü aleyhi ve sellem) yüzümden ne ile karşılaştığımı anladı. Ve Resûlüllah (sallallahü aleyhi ve sellem): ne oldu?» dedi. Ya Resûlallah! Vallahi bugünkü gibi (şimdiye kadar) hiç görmedim. Hamza benim iki deveme tecavüz ederek hörgüçlerini kesmiş, böğürlerini de delmiş. İşte kendisi bir evde bulunuyor. Yanında içkiciler var, dedim. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) kaftanını isteyerek onu örtündü. Sonra yürümeye koyuldu. Kendisini Zeyd b. Harise ile ben takib ettik. Nihayet Hamza'nın bulunduğu evin kapışma geldi. Ve izin istedi. Kendisine izin verdiler. Bir de ne görsün hep îçkiciler. Derken Resûlüllah (sallallahü aleyhi ve sellem) yaptığından dolayı azarlamaya başladı. Birden Hamza'nın gözleri kızarmıştı. Hamza. Resûlüllah (sallallahü aleyhi ve sellem)'e baktı. Sonra gözünü onun dizlerine kaldırdı. Sonra gözünü daha kaldırarak göbeğine baktı. Sonra daha kaldırarak yüzüne baktı. Arkacığından Hamza şunu söyledi: Siz benim babamın kölelerinden başka bir şey misiniz? (sallallahü aleyhi ve sellem) onun sarhoş olduğunu anladı artık, Resûlüllah (sallallahü aleyhi ve sellem) döndü, gerisin geriye giderek dışarı çıktı. Biz de onunla beraber çıktık",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5130,
			"arabicnumber": "1979.04",
			"text": "(Bu hadîsi bana Muhammed b. Abdillah b. Kuhzâz da rivâyet etti. ki): Bana Abdullah b. Osman, Abdullah b. Mübârek'den, o da Yûnus'dan, o da Zührî'den naklen bu isnadîa bu hadîsin mislini rivâyet etti. hadîsi Buhârî «Kitâbu’l-Humus»'da tahrîc etmiştir. Hadîsin zahirine bakılırsa Hazret-i Ali’ye verilen yaslı develer Bedir'den alınan ganimetlerin beşte birindendir. Fakat İbn-i Battâl'ın beyanına göre siyer ulemâsı Bedir Harbinde ganimetin beşte birinin Peygamberimize tahsisi henüz meşru olmadığına ittifak etmişlerdir. Bu takdirde Hazret-i Ali'nin sözü te'vile muhtaç olur. Ve: «Bana Resûlüllah (sallallahü aleyhi ve sellem) Abdullah b. Cahş'in seriyyesinden bir yaşlı deve verdi» mânâsına alınır. Çünkü Abdullah b. Cahg seriyyesi Bedr'den önce hicretin ikinci senesinde Mekke ile Tâif arasındaki Nahle'ye gönderilmiş, orada bir Kureyş kervanı ile harbederek küffarı tepelemiş, kervanı ganimet almışlardı. Hazret-i Abdullah arkadaşlarına: «Aldığımız ganimetin beşte biri Resûlüllah (sallallahü aleyhi ve sellem)'nin olacak» demişti. Halbuki o zaman henüz ganimetlerin beşte biri meselesi hakkında âyet inmemişti. Abdullah (radıyallahü anh) ganimetin beşte birini Resûlillah (sallallahü aleyhi ve sellem)'a ayırmış, geri kalanını arkadaşlarına taksim etmişti. Beşte bir meselesinin Benî Kureyza gazasında meşru' olduğu söylenir. Daha sonra meşru olduğunu söyleyenler de vardır. hâlini görünce Hazret-i Ali'nin ağlaması Nevevî'ye göre. Hazret-i Fâtıma'ya karşı kusur edip çehizini tamamîayamıyacağın-dan korktuğu içindir. Bizce develerin hâline acıdığı için ağlamış olması daha vârid-i hatırdır. Hamza iyice sarhoş olmuş. Câriye oynatıyordu. Çünkü o zaman henüz içki ve şarkı gibi şeyler haram edilmemişti. Müslümanlar içki içiyor, şarkı dinliyorlardı. İçki ancak Uhud gazasında haram kılınmıştır. Hazret-i Hamza'nin: «Siz benim babamın kölelerinden başka bir şey misiniz?» sözünün mânâsı teşbihtir. Yani siz benim babamın köleleri gibisiniz demek istemiştir. Maksadı da Peygamber (sallallahü aleyhi ve sellem)'n babası Abdullah ile Hazret-i Ali'nin babası Ebû Tâlib'dir. Bunlar Abdulmuttalib'e itaat ve hürmet hususunda onun köleleriymiş gibi davranırmış. Ben Abdulmuttalib'e onlardan daha yakınım» demek istemiştir. Hamza'nin yaraladığı develerin kıymetini ödemesi icabeder. Bu babda bir rivâyet yoksa da Hazret-i Hamza'nin onları ödemiş olması, yahut onun namına Peygamber (sallallahü aleyhi ve sellem)’in vermiş olması yahut Hazret-i Ali'nin bedel istemekten vaz geçmiş olması muhtemeldir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5131,
			"arabicnumber": "1980.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5132,
			"arabicnumber": "1980.02",
			"text": "(Bize Yahya b. Eyyûb da rivâyet etti, ki): Bize İbn Uleyye rivâyet etti. ki): Bize Abdulaziz b. Suhayb haber verdi. ki): Enes b. Mâlik'e Fadîh'i sordular da şu cevâbı verdi: Sizin Fadıh ismini verdiğiniz şu Fadıh'ımızdan başka bizim bir şarabımız yoktu. Ben ayakta olduğum halde Ebû Talha ile Ebû Eyyüb'a ve evimizde Resûlüllah (sallallahü aleyhi ve sellem)’in ashabından bir takım adamlara onu sunuyordum. Aniden bir adam gelerek: Haber size ulaştı mı? dedî. Hayır! dedik. Gerçekten şarab haram kılınmış, dedi. Bunun üzerine (Ebû Talha): Yâ Enes! Bu küpleri akıt, dedi. Bu adamın haberinden sonra artık ne ona döndüler, ne de Sordular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5133,
			"arabicnumber": "1980.03",
			"text": "(Bize yine Yahya b. Eyyûb rivâyet etti. ki): Bize İbn Uleyye rivâyet etti! ki): Bize Süleyman Et-Teymî de haber verdi. ki): Bize Enes b. Mâlik rivâyet etti. ki): Ben cemaata, amcalarıma hizmet ediyordum. Kendilerinin fadıhm-dan onlara sunuyordum. Yaşça en küçükleriydim. Derken bir adam gelerek: Hiç şüphesiz şarap haram kılınmıştır, dedi. Bunun üzerine cemâat: Onu dök yâ Enes! dediler. Ben de onu döktüm. (Süleyman Dedi ki): Enes'e: O nedir? dedim. Koruk ve yaş hurmadır! dedi. Bunun üzerine Ebû Bekr b. Enes: Bu o gün onların şarabıydı, dedi. Süleyman ki: Bana bir adam dahi Enes b. Mâlik'ten rivâyet etti ki, Enes bunu söylemiş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5134,
			"arabicnumber": "1980.04",
			"text": "(Bize Muhammed b. Abdi’l-a'iâ rivâyet etti. ki): Bize Mu'temir babasından rivâyet etti. ki): Enes şunu söyledi: Ben cemâatin hizmetinde idim, onlara sunuyordum... İbn Uleyye hadîsi gibi rivâyet etmiştir. Yalnız o Şöyle deditir: «Ebû Bekr b. Enes: Bu o gün onların şarabıydı, dedi. Enes de mevcuttu. Ama Enes bunu inkâr etmedi.» Abdi’la'lâ dedi ki: «Bize Mu'temir babasından rivâyet etti. ki): Bana benimle birlikte bulunanlardan bîri anlattı ki, kendisi Enes'i: Bu o gün onların şarabıydı, derken işitmiş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5135,
			"arabicnumber": "1980.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5136,
			"arabicnumber": "1980.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5137,
			"arabicnumber": "1981",
			"text": "(Bana Ebû't-Tâhir Ahmed b. Amr b. Şerh rivâyet etti. ki): Bize Abdullah b. Vehb haber verdi. ki): Bana Amr b. Hâris haber verdi. Ona da Katâde b. Diâme rivâyet etmiş ki, kendisi Enes b. Mâlik'i şöyle derken işitmiş: Gerçekten Resûlüllah (sallallahü aleyhi ve sellem) kuru hurma ile renkti koruğu karıştırıp içmekten nehy buyurdu. Şarap haram kılındığı giin umumiyetle Arapların şarabı buydu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5138,
			"arabicnumber": "1980.07",
			"text": "(Bana yine EbÛ't-Tahir rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Mâlik b. Enes, İshâk b. Abdillah b. Ebî Talhâ'dan, o da Enes b. Mâlik'den naklen haber verdi ki (Şöyle dedi): Ben Ebû Ubeyde b. Cerrah ile Ebû Talha'ya ve Übeyy b. Ka'b'a fadıh ile kuru hurmadan şerbet sunuyordum. Derken onlara gelen gelerek: Gerçekten şarab haram kılındı, dedi. Bunun üzerine Ebû Talha: Yâ Enes! Kalk şu küpü kınver, dedi. Ben de taştan oyma küpümüze vararak onu dibi ile yere vurdum. Nihayet kırıldı",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5139,
			"arabicnumber": "1982",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5140,
			"arabicnumber": "1983",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Abdurrahman b. Mehdî haber verdi. H. Züheyr b. Harb da rivâyet etti. ki): Bize Abdurrahman, Süfyan'dan, o da Süddî'den, o da Yahya b. Abbâd'dan, o da Enes'den naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem)’e şarabdan sirke yapılır mı? diye sorulmuş da: diye cevap vermiş. hadis şarabdan sirke yapmayı caiz görmeyen İmâm Şafiî, İmâm Ahmed ve ekser ulemânın delilidir. Onlara göre şarabın içine ekmek, soğan, maya veya başka bir şey atmak suretiyle sirke yapılan şarab temiz olmaz. Necaseti bakidir. İçine atılan şey de pis olur. Artık bu sirke ebediyen temiz olmaz. Fakat şarab güneşten gölgeye yahut gölgeden güneşe nakletmek suretiyle sirke olursa temiz sayılıp sayılmayacağı hususunda şâfiîler'den iki kavil rivâyet olmuştur. Esah kavle göre temiz olur. İmâm A'zam ile Evzâi ve Leys sirke yapmakla şarabın temiz olacağına kaildirler., İmâm Mâlik’den üç rivâyet vardır. Bunların esah olanına göre şarabdan sirke yapmak haramdır. Sirkeyi yapan Allah'a âsî olur. Fakat yapılan sirke temizdir. İkinci kavle göre haramdır. Sirke yapmakla temiz olmaz. Üçüncüye göre helâldir, temiz olur. kendi kendine sirke olan şarabın temiz sayılacağına icma etmişlerdir. Mâlikîler'den Suhnûn'un; «Temizlenmez» dediği rivâyet olmuştur. -Eğer bu doğru ise kendinden evvel mun'akıd olan icma'la merduddur.» diyor",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5141,
			"arabicnumber": "1984",
			"text": "Bize Muhammed b. Müsennâ ile Muhammed b. Beşşâr rivâyet ettiler. Lâfız İbn-i Müsennâ'nındır. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. ki) ; Bize Şu'be, Simak b. Harb'den, o da Alkame b. Vâil'den, o da babası Vâil El-Hadramînden naklen rivâyet etti ki, Târik b. Süveyd El-Cu'fî, Peygamber (sallallahü aleyhi ve sellem)'e şarabın hükmünü sormuş; o da kendisini men etmiş. Yahut onu yapmasını kerih görmüş. Bunun üzerine Târik: Ben onu ancak ilâç için yapıyorum, demiş. Efendimiz (sallallahü aleyhi ve sellem): O ilâç değildir. Lâkin derddir,: buyurmuşlar. hadîs-i şerif şarabın deva olmadığım sarahaten ifâde ediyor. Binâenaleyh şarabla tedavi haramdır. diyor ki: «Ulemâmıza göre sahih olan budur. Şarabla tedavi haram olduğu gibi, susuzluktan dolayı içilmesi de haramdır. Ama bir kimsenin lokma boğazında kahr da şarabdan başka onu geçirecek bir şey bulamazsa şarabîa geçirmesi lâzım gelir. Çünkü bu takdirde şarabla şifa yüzde yüzdür. Tedavi meselesinde böyle değildir.\" îmam-î A'zam'a göre şarabla tedavi caiz değildir. Zira Cenâb-ı Hak haram olan bir şeyde şifâ halketmez. İmâ-meyne göre ise caizdir. Çünkü bu bir zarurettir. Zaruretlerse haram olan şeyleri mubah kılar. şerîf dolayısıyîe şarabdan sirke yapmanın caiz olmadığına da delildir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5142,
			"arabicnumber": "1985.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5143,
			"arabicnumber": "1985.02",
			"text": "(Bize Muhammed b. Abdullah b. Nümeyr de rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Evzâî rivâyet etti. ki): Bize Ebû Kesir rivâyet etti. ki): Ebû Hüreyre'yi şunu söylerken işittim: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: şu iki ağaçtandır- Hurma ve üzüm!» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5144,
			"arabicnumber": "1985.03",
			"text": "Bize Züheyr b. Harb ile Ebû Küreyb de rivâyet ettiler. (Dediler ki): Bize Veki', Evzâî ile İkrime b. Ammar ve Ukbe b. Tev'em'den, onlar da Ebû Kesir'den, o da Ebû Hüreyre'den naklen rivâyet etti. Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): şu iki ağaçtandır: Bağ ve hurma!» buyurdular. Ebû Küreyb'in rivâyetinde (Bu iki kelime müennes değil de) şeklinde (müzekker)'dir. hadîsin şerhinde Nevevî şunları söylemiştir: «Bu gösterir ki, kuru hurmadan, renkleşmeye başlamış koruktan, kuru üzümden ve başkalarından yapılan içkilere şarab denilir. Bu içkiler sarhoşluk veriyorsa haramdırlar. Yukarda da geçtiği gibi cumhûrun mezhebi budur. Hadîste mısırdan, baldan, arpadan ve daha başka şeylerden yapılan içkinin şarab olduğunu nefiy yoktur. Bu lâfızlarla bu içkilerin hepsinin şarab ve haram olduğunu bildiren sahih hadîsler sabit olmuştur. hadîste üzüme bağ denilmiştir. Sahih rivâyette ise bundan'nehiy buyurulmuştur. Binâenaleyh bu mânâda kullanılışı içki yasak edilmezden Önce olması ihtimali vardır. Bir ihtimal de onu cevazı bildirmek için kullanılmış olmasıdır. Şu halde ondan nehiy buyurması haram kılmak için değil, keraheti tenzihiye içindir. İhtimal bununla muhâtab olmaları ta'rif içindir. Çünkü onların dilinde ekseriyetle kullanılan malûm söz budur.» karşı Hanefîler'den Aynî Şöyle deditir: «Ebû Hanife'nin mezhebi şudur: Üzüm şırası kükreyip şiddetlenir de köpüğünü atarsa şarab olur. Üzümden başkalarından yapılan içki hakikî şarap değildir.» Filhakika Hanefîler'e göre rakı, bira, likör gibi içkilerin haram kılındığı nassı kitapla değil, kıyâs yoluyla anlaşıldığından hükümlerinde de az çok değişiklikler vardır. Meselâ: Şarâbın bir damlası had vurmayı icab ederken rakı ve emsalinin damlası değil, ancak sarhoş edecek miktarı had vurmayı gerektirir. Bunların hepsine birden hamr yani şarab hükmü vermeye imkân yoktur. Çünkü isimlerde kıyas cereyan etmez. Muhalifleri ise bu içkilere kıyas yoluyla şarab ismini vermişlerdir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5145,
			"arabicnumber": "1986.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5146,
			"arabicnumber": "1986.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5147,
			"arabicnumber": "1986.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5148,
			"arabicnumber": "1986.04",
			"text": "(Bize Şeyban b. Ferrûh rivâyet etti. ki): Bize Cerir b. Hâzini rivâyet etti. ki): Ata' b. Ebî Keban'dan dinledim. ki): Bize Câbir b. Abdillah El-Ensârî rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem) kuru üzümle kuru hurmanın ve korukla kuru huımanm karıştırılmasını yasak etmiştir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5149,
			"arabicnumber": "1987.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Yezid b. Zürey', Teymî'den, o da Ebû Nadra'dan, o da Ebû Saîd'den, naklen haber verdi ki: Peygamber (sallallahü aleyhi ve sellem) kuru hurma ile kuru üzümün bir araya karıştırılmasını ve kuru hurma ile koruk hurmanın bir araya karıştırılmasını yasak etmiştir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5150,
			"arabicnumber": "1987.02",
			"text": "(Bize Yahya b. Eyyûb rivâyet etti. ki): Bize İbn-i Uleyye rivâyet etti. ki): Bize Saîd b. Yezîd Ebû Mesleme, Ebû Nadra'dan, o da Ebû Saîd'den naklen rivâyet etti. Ebû Saîd: Resûlüllah (sallallahü aleyhi ve sellem) bize kuru üzümle kuru hurmayı ve koruk hurma ile kuru hurmayı karıştırmamızı yasak etti, demiştir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5151,
			"arabicnumber": "1987.03",
			"text": "(Bize Nasr b. Alî El-Cehdamı de rivâyet etti. ki): Bize Bişr (yani İbn-i Mufaddal) Ebû Mesleme'den bu isnadla bu hadîsin mis-lini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5152,
			"arabicnumber": "1987.04",
			"text": "(Bize Kuteybe b. Saîd de rivâyet etti. ki): Bize Veki', İsmail b. Müslim El-Abdî'den, o da Ebû’l-Mütevekkil En-Nâci'den, o da Ebû Saîd-i Hudrî'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): her kim nebîz içecekse, onu tek başına kuru üzüm olarak yahut tek başına kuru hurma veya tek başına koruk olarak içsin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5153,
			"arabicnumber": "1987.05",
			"text": "(Bu hadîsi hana Ebû Bekr b. Ishak dahi rivâyet etti. ki): Bize Ravh b. Ubade rivâyet etti. ki): Bize İsmail b. Müslim El-Abdî, bu isnadla rivâyet etti. ki): Resûlüllah (sallallahü aleyhi ve sellem) korukla kuru hurmayı yahut kuru üzümle kuru hurmayı veya kuru üzümle koruk hurmayı karıştırmayı bize yasak etti. Bu hadîste: onu kim içerse...» buyurmuş, Râvi hadîsi Vekî'in hadisi gibi rivâyet etmiştir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5154,
			"arabicnumber": "1988.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5155,
			"arabicnumber": "1988.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Muhammed b. Bişr El-Abdi, Haccâc b. Ebî Osman'dan, o da Yahya b. Ebî Kesîr'den bu isnadla bu hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5156,
			"arabicnumber": "1988.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5157,
			"arabicnumber": "1988.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5158,
			"arabicnumber": "1988.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5159,
			"arabicnumber": "1988.06",
			"text": "Bana Ebû Seleme b. Abdirrahman dahi Ebû Katâde'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5160,
			"arabicnumber": "1989.01",
			"text": "Bize Züheyr b. Harb ile Ebû Küreyb rivâyet ettiler. Lâfız Züheyr'indir. (Dediler ki): Bize Veki', İkrime b. Ammar'dan, o da Ebû Kesîr El-Hanefî'den, o da Ebû Hüreyre'den naklen rivâyet etti. dedi): Resûlüllah (sallallahü aleyhi ve sellem) kuru üzümle kuru hurmayı ve koruk hurma ile kuru hurmayı yasak etti de: her birinden yalnız başına nebiz yapılır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5161,
			"arabicnumber": "1989.02",
			"text": "(Bu hadîsi bana yine Züheyr b. Harb rivâyet etti. ki): Bize Haşim b. Kasım rivâyet etti. ki): Bize İkrime b. Ammâr rivâyet etti. ki): Bize Yezid b. Abdirrahman b. Üzeyne —ki bu zât Ebû Kesir El-Guberî'dir— rivâyet etti. ki): Bana Ebû Hüreyre rivâyet etti. ki): Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular...» Râvi yukarki hadîsin mislini rivâyet etmiştir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5162,
			"arabicnumber": "1990.01",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe dahi rivâyet etti. ki): Bize Alî b. Mushir, Şeyb'ânî'den, o da Habîb'den, o da Saîd b. Cübeyr'den, o da İbn Abbâs'dan naklen rivâyet etti. (Şöyle dedi): (sallallahü aleyhi ve sellem) kuru hurma ile kuru üzümün bir araya karıştırılmasını ve koruk hurma ile kuru hurmanın bir araya karıştırılmasını yasak etti. Ve Curaş ahâlisine mektup yazarak onları kuru hurma ile kuru Üzümü karıştırmaktan men etti",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5163,
			"arabicnumber": "1990.02",
			"text": "(Bana bu hadîsi Velıb b. Bakiyye de rivâyet etti. ki): Bize Haüd (yani Tahhan) Şeybânî'den bu isnadla kuru hurma ile kuru üzüm hakkında haber verdi. Ama koruk hurma ile kuru hurmayı anmadı",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5164,
			"arabicnumber": "1991.01",
			"text": "(Bana Muhammed b. Râfi' rivâyet etti. ki): Bize Abdurrezzâk rivâyet etti. ki): Bize İbn-i Cüreyc haber verdi. ki): Bana Mûsa b. Ukbe, Nâfi'den, o da İbn-i Ömer’den naklen haber verdi ki, şöyle diyormuş: koruk hurma ile olgun hurmanın beraberce ve kuru hurma ile kuru Üzümün beraberce nebiz yapılması yasak edildi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5165,
			"arabicnumber": "1991.02",
			"text": "(Bana Ebû Bekr b. İshak dahi rivâyet etti. ki): Bize Ravh rivâyet etti. ki): Bize İbn-i Cüreyc rivâyet etti. ki) ; Mûsa b. Ukbe, Nâfi'den, o da İbn-i Ömer'den, naklen haber verdi ki, Şöyle dedi: koruk hurma ile olgun hurmanın beraberce ve kuru hurma ile kuru üzümün beraberce nebiz yapılması yasak edildi. hadîsin Câbir rivâyetini Buhârî ile Nesâî «Eşribe» bahsinde; Ebû Katâde rivâyetini Buhârî, Ebû Dâvudve İbn-i Mâce «Eşribe»'de; Nesâî «Velîme» bahsinde muhtelif râvilerden tahric etmişlerdir. Hurma ve kuru üzümden yapılan bir nevi hoşafdır. Buna lisânımızda bazı yerlerde tükenmez diyorlar ki, muhtelif meyveleri küpe veya fıçıya doldurarak üzerine su koymak suretiyle yapılır. Birkaç gün bekledikten sonra tükenmez kemâle gelir, Meyvalarm tadı ve ekşisi suya çıkarak içilmesi hoş bir şerbet olur. îşte bu rivâyetlerde bahsedilen ne-bîz budur. Görülüyor ki, Resûlüllah (sallallahü aleyhi ve sellem) iki nev'i bir araya karıştırarak nebiz yapmayı yasak etmiştir. Kuru hurma ile kuru üzüm, kuru hurma ile yaş hurma, kuru hurma ile koruk hurma, yaş hurma ile koruk hurma karıştırılmıyacak, bunlardan yalnız bir tanesinden, meselâ; yalnız kuru hurmadan yahut yalnız kuru üzümden nebiz yapılabilecektir. Bunun sebebini ulemâ şöyle izah etmişlerdir: İki cins bir yere karıştırılınca tadı değişmeden hemen sarhoş etme hassası meydana çıkar, içen kimse onu müskir değil (sarhoş etmez), zannederek bilmeden içki içmiş olur. Buradaki yasaklama hakkında Nevevî şunları söylemiştir: «Bizim mezhebimizle cumhûrun mezhebine göre buradaki nehiy keraheti tenzîhiyye içindir. Sarhoşluk vermedikçe nebîzi içmek haram değildir. Cumhûr ulemâ buna kaildir. Mâli kiler'den bazısı haram olduğunu söylemiştir. Ebû Hanife ile bir rivâyette Ebû Yûsuf: «Bunda bir kerahet ve bir beis yoktur. Çünkü tek başına bir ne-vî'den yapıldığında içilmesi helâl olan nebiz başka nev'ile karıştırıldığı zaman da helâldir.» demişlerdir. Cumhûr, Ebû Hanîfe'nin bu sözünü reddetmiş: Bu şeriat sahibine muhalefettir, demişlerdir. Filhakika bunu yasaklayan sahih ve sarih hadîsler rivâyet olunmuştur. Haram değilse mekruh olur.» Aynî de şöyle demektedir: «Bu babda birkaç kavil vardır. Birinci kavle göre iki nev'i karıştırılarak yapılan nebiz haramdır. Bu kavil Ebû Mûsa El-Ensârî, Enes, Câbir, Ebû Saîd (radıyallahü anh) hazeratı ile tabiinden Atâ' ve Tavus'dan rivâyet olmuştur. İmâm Mâlik ile İmâm Şâfiî, İmâm Ahmed, İshâk ve Ebû Sevr'in mezhebleri de budur. İkinci kavle göre iki nevî'den yapılan karışımın sadece ne-biz yapılması haramdır. Nebiz olduktan sonra hiç bir şey diğerinden fark edilmez. Bu anlaşılmaz kavil bazı Mâlikîler'den rivâyet olunmuştur. Üçüncü kavle göre bu rivâyetlerdeki nehiy tenzih mânâsına hamledü-miştir. -Sarhoş etmedikçe haram sayılmaz. Nevevî’nin Şafiîler'in ve cumhûrun mezhebi olarak gösterdiği kavil budur. Dördüncü kavle göre kuru üzüm nebizi ile kuru hurma nebizini karıştırarak içmekte beis yoktur. Nehiy ancak beraberce nebiz yapılmaları hususundadır. Çünkü bunlardan biri diğerini takviye eder. Bu kavil Leys'den rivâyet olmuştur. Beşinci kavle göre bu hususta hiç bir kerahet ve hiç bir beis yoktur. Ebû Hanîfe ile bir rivâyette Ebû Yûsuf'un kavilleri budur. Nevevî cumhûrun bu kavli reddettiğini ve bunun şeriat sahibine muhalefet demek olduğunu söylediklerini kaydetmiş ve: Bundan nehiy hususunda sahih ve sarih hadîsler sabit olmuştur. Haram olmazsa mekruh olur, demiştir. derim ki, bu yaptıkları bundan daha çok büyük bir İmâma karşı pek kötü bir cüretkârlıktır. Ebû Hanîfe bunu kendi reyiyle söylememiştir. Onun bu hususta mesnedi bir takım hadislerdir...» Bundan sonra Aynî her türlü nebizin helâl olduğunu bildiren üç hadîs rivâyet etmiştir. Bunların birinde Safıyye binti Atıyye şöyle demektedir: «Abdü’l-Kays kabilesinden bazı kadınlarla birlikte Âişe (radıyallahü anhâ)'nın yanına girmiş, kendisine kuru hurma ile kuru üzümden sual açtık da şunları söyledi: Ben bir avuç kuru hurma, bir avuç da kuru üzüm alır, bunları bir kaba koyar, yumuşatırdım. Sonra bu nebizi Peygamber (sallallahü aleyhi ve sellem)'e sunardım.» Ayni bu hadîslerin istidlale elverişli olduklarını göstermek için râvilerden de bahsetmiştir. rivâyetlerde zikri geçen Zehv: Kızarmaya ve sararmaya başlamış hurma mânâsına gelir. Yemen'de bir beldenin ismidir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5166,
			"arabicnumber": "1992.01",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Leys İbn-i Şibab'dan, o da Enes b. Mâlik'den naklen rivâyet etti. Enes haber vermiş ki. Resûlüllah (sallallahü aleyhi ve sellem) müzeffei ve dübba' (denilen kaplar)'da nebiz yapılmasını yasak etmiş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5167,
			"arabicnumber": "1992.02",
			"text": "(Bana Amr'un-Nakıd da rivâyet etti. ki): Bize Süfyân b. Uyeyne, Zührî'den, o da Enes b. Mâlik'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem) cîübbs' ve müzellelde nebiz yapılmasını yasak etmiş. ki: Ona Ebû Seleme de haber vermiş ki, Ebû Hüreyre'yi şunu söylerken işitmiş: Resûlüllah (sallallahü aleyhi ve sellem): ile müzeffefte nebîz yapmayın!» buyurdular. Sonra Ebû Hüreyre: «Hantemlerden de sakının!» demiş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5168,
			"arabicnumber": "1993.01",
			"text": "(Bana Muhammed b. Hatim rivâyet etti. ki): Bize Behz rivâyet etti. ki): Bize Vüheyb Süheyl'den, o da babasından, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti ki, müzeffet, hantem ve nekîr (denilen kaplan kullanmak)'dan nehiy buyurmuş. diyor ki: Ebû Hüreyre'ye: Hantem nedir? diye soruldu. Yeşil küplerdir, cevabını verdi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5169,
			"arabicnumber": "1993.02",
			"text": "(Bize Nasr b. Alî El-Cehdamî rivâyet etti. ki): Bize Nuh b. Kays haber verdi. ki): Bize İbn-i Avn, Muhammed'den, o da Ebû Hüreyre'den naklen rivâyet etti ki: Peygamber (sallallahü aleyhi ve sellem) Abdul-Kays heyetine: dübbâ', hanîem, nekîr ve mukayyer'den men ediyorum. Hantem ağzı kesilmiş küptür. Lâkin tulumundan iç ve ağzını bağla!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5170,
			"arabicnumber": "1993.03",
			"text": "(Bize Said b. Amr El-Eş'asî rivâyet etti. ki): Bize Abser haber verdi. H. Züheyr b. Harb da rivâyet etti. ki): Bize Cerir rivâyet etti. H. Bişr b. Hâlid dahi rivâyet etti. ki): Bize Muhammed (yani, Ibn-i Ca'fer) Şu'be'den naklen haber verdi. Bu râvilerin hepsi A'meş'den, o da İbrahim Et-Teymî'den, o da Haris b. Süveyd'den, o da Ali'den naklen rivâyet etmişlerdir. Ali Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) dübbâ' ile müzeffetde nebiz yapılmasını yasak etti. Bu Cerir'in hadîsidir. ile Şu'be'nin hadîslerinde ise: «Peygamber (sallallahü aleyhi ve sellem) dübbâ' ile müzeffetden nehiy buyurdu.» ifadesi vardır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5171,
			"arabicnumber": "1994",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5172,
			"arabicnumber": "1995.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5173,
			"arabicnumber": "1995.02",
			"text": "(Bana Muhammed b. Hatim dahi rivâyet etti. ki): Bize Yahya (Bu zât Kattandır) rivâyet etti. ki): Bize Süfyân ile Şu'be rivâyet ettiler. (Dediler ki): Bize Mansûr ile Süleyman ve Hammâd, İbrahim'den, o da Esved'den, o da Âişe'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5174,
			"arabicnumber": "1995.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5175,
			"arabicnumber": "1995.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5176,
			"arabicnumber": "1995.05",
			"text": "(Bize bu hadîsi İshâk b. İbrahim dalıi rivâyet etti. ki): Bize Abdül Vehhab Es-Sekafî haber verdi. ki): Bize İshâk b. Süveyd bu isnadla rivâyette bulundu. Yalnız o, müzeffet'in yerine mukayyer'i koydu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5177,
			"arabicnumber": "1995.06",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Abbâd b. Abbâd, Ebû Cemre'den, o da İbn Abbâs'dan naklen haber verdi. H. Hanef b. Hişâm da rivâyet etti. ki): Bize Hammâd b. Zeyd, Ebû Cemre'den rivâyet etti. ki): İbn Abbâs'ı şunu söylerken işittim. Abdul Kays hey'eti Resûlüllah (sallallahü aleyhi ve sellem)’in yanına geldi de Peygamber (sallallahü aleyhi ve sellem) onlara): dübbâ', hantem, nekîr ve mukayyer'den nehy ediyorum!» buyurdular. hadîsinde mukayyer'in yerine müzeffet'i koymuştur",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5178,
			"arabicnumber": "17.04",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Alî b. Müshir, Şeybânî'den, o da Habîb'den, o da Saîd b. Cübeyr'den, o da İbn Abbâs'dan naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem) dübbâ' ile hantem, müzeffet ve nekîr'den nehiy buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5179,
			"arabicnumber": "17.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5180,
			"arabicnumber": "17.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5181,
			"arabicnumber": "17.07",
			"text": "(Bize Muhammed b. Beşşâr da rivâyet etti. ki): Bize Muhammed b. Cafer rivâyet etti. ki): Bize Şu'be Yahya b. Ebî Ömer den, o da İbn Abbâs'dan naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem) dübbâ', nekîr ve müzeffet'den nelıîy buyurdu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5182,
			"arabicnumber": "1996.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Yezid b. Zürey', Teymî'den nakien haber verdi. H. Yahya b. Eyyûb da rivâyet etîi. ki): Bize İbn-i Uleyye rivâyet etti. ki):. Bize Süleyman Et-Teymî Ebû Nadra'dan, o da Ebû Saîd'den naklen haber verdi ki, Resûlüllah (sallallahü aleyhi ve sellem) küplerde nebîz yapılmasını yasak etmiş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5183,
			"arabicnumber": "1996.02",
			"text": "(Bize Yahya b. Eyyûb rivâyet etti. ki): Bize İbn-i Uleyye rivâyet etti. ki): Bize Saîd b. Ebî Arûbe Katâde'den, o da Ebû Nadra'dan, o da Ebû Saîd-i Hudrî'den naklen haber verdi ki: Resûlüllah (sallallahü aleyhi ve sellem) dübbâ', hanlem, nekîr ve miizeffeften nehiy buyurmuş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5184,
			"arabicnumber": "1996.03",
			"text": "(Bize bu hadîsi Muhammed b. Müsennâ da rivâyet etti. ki): Bize Muâz b. Hişam rivâyet etti. ki) ; Bana babam, Katâde'den bu isnadla rivâyet etti ki, Nebiyyullah (sallallahü aleyhi ve sellem) nebiz yapılmasından nehiy buyurmuş. yukarki hadîsin mislini söylemiştir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5185,
			"arabicnumber": "1996.04",
			"text": "(Bize Nasr b. Ali El-Cehdami dahi rivâyet etti. ki): Bana babam rivâyet etti. ki): Bana El-Müsennâ (yani İbn-i Saîd) Ebû’l-Mütevekkîl'den, o da Ebû Saîd'den, naklen rivâyet etti. Saîd Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) Hantem'e, dühbâ' ve nekîrden içmeyi yasak etti",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5186,
			"arabicnumber": "1997.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Süreye b. Yûnus rivâyet ettiler. Lâfız Ebû Bekr'indir. (Dediler ki): Bize Mervân b. Muâviye, Mansûr b. Hayyan’dan, o da Saîd b. Cübeyr'den naklen rivâyet etti. (Şöyle dedi): İbn-ü Ömer'le İbn-i Abbâs'a şehadet ederim ki, bunlar Resûlüllah (sallallahü aleyhi ve sellem)’in dübbâ', hantem, müzeffet ve nekîr'den nehiy buyurduğuna şahit olmuşlardır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5187,
			"arabicnumber": "1997.02",
			"text": "(Bize Şeyban b. Ferrûh rivâyet etti. ki): Bize Cerir (yani İbn-i Hâzim) rivâyet etti. Dedi ki): Bize Ya'la b. Hâkim, Saîd b. Cübeyr'den rivâyet etti. Saîd Şöyle dedi: İbn Ömer'e küp nebizini sordum da: Resûlüllah (sallallahü aleyhi ve sellem) küp nebizini haram kıldı, dedi. Bunun üzerine İbn Abbâs'a geldim. Ve İbn-i Ömer'in ne dediğini işitmiyor musun? dedim. Ne diyor? dedi. Resûlüllah (sallallahü aleyhi ve sellem)’in küp nebizini haram kıldığını söyledi, dedim. O da: İbn-i Ömer doğru söylemiş. Resûlüllah (sallallahü aleyhi ve sellem) küp nebizini haram kıldı, dedi. Ben: Bu küp nebizi nedir? diye sordum. Çamurdan yapılan her şeydir, cevabını verdi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5188,
			"arabicnumber": "1997.03",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlik'e, Nâfi’den dinlediğim. Onun da İbn-i Ömer'den rivâyet ettiği şu hadîsi okudum: (sallallahü aleyhi ve sellem) gazalarının birinde cemaata hutbe okumuş... İbn-i Ömer ki): Ben ona doğru geldim. Fakat ben yanına varmadan oradan ayrıldı. (Oradakilere): Ne söyledi? diye sordum. Dübbâ' ile müzeffet'de nebiz yapılmasını yasak etti, dediler",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5189,
			"arabicnumber": "1997.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5190,
			"arabicnumber": "1997.05",
			"text": "(Bize Yahya b. Yahya da rivâyet etti. ki): Bize Hammâd b. Zeyd, Sabit'den naklen haber verdi. (Şöyle dedi): İbn-i Ömer'e (sallallahü aleyhi ve sellem) küp ner izini yasak etti mi? diye sordum. Öyle söylerler, dedi. Resûlüllah (sallallahü aleyhi ve sellem) onu yasak etti mi? dedim. Öyle söylerler, dedi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5191,
			"arabicnumber": "1997.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5192,
			"arabicnumber": "1997.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5193,
			"arabicnumber": "1997.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5194,
			"arabicnumber": "1997.09",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5195,
			"arabicnumber": "1997.10",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5196,
			"arabicnumber": "1997.11",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5197,
			"arabicnumber": "1997.12",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5198,
			"arabicnumber": "1997.13",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5199,
			"arabicnumber": "1997.14",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5200,
			"arabicnumber": "1997.15",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5201,
			"arabicnumber": "1997.16",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5202,
			"arabicnumber": "1998.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5203,
			"arabicnumber": "1998.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5205,
			"arabicnumber": "1999.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5206,
			"arabicnumber": "1999.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5209,
			"arabicnumber": "977.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5210,
			"arabicnumber": "2000",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5211,
			"arabicnumber": "2001.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5212,
			"arabicnumber": "2001.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5213,
			"arabicnumber": "2001.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5215,
			"arabicnumber": "1733.06",
			"text": "(Bize Muhammed b. Abbad rivâyet etti. ki): Bize Süfyân b. Amr'dan rivâyet etti. O da Saîd b. EH Bürde'den, o da babasından, o da dedesinden dinlemiş ki, Peygamber (sallallahü aleyhi ve sellem) dedesi ile Muâz'i Yemen'e göndermiş ve kendilerine: edin ve kolaylaştırın; öğretin, nefret ettirmeyin!» buyurmuşlar. Zannederim «Uyuşun» da buyurmuş. Râvi diyor ki: O gittiği zaman Ebû Mûsa dönerek: Yâ Resûlüllah! Onların baldan yapma bir içkisi var ki, tutununcaya kadar pişirilir. Bir de bira vardır ki, arpadan yapılır, dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) ı sarhoş eden her şey haramdır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5216,
			"arabicnumber": "1733.07",
			"text": "Bize İshâk b. İbrahim İle Muhammed b. Ahmed b. Ebî Hanef de rivâyet ettiler. Lâfız İbn-î Ebî Hanefindir. (Dediler ki): Bize Zekeriyya b. Adiyy rivâyet etti. ki): Bize Ubeydullah —Bu zât İbn-i Amr'ındır.— Zeyd b. Ebî Üleyse'den, o da Saîd b. Ebî Bürde'den naklen rivâyet etti. ki): Bize Ebû Bürde babasından rivâyet etti. Babası Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) beni Muâz'la birlikte Yemen'e gönderdi de: davet edin ama tebşir edin, nefret ettirmeyin! Kolaylaştırın, güçleştirmeyin!» buyurdular. Ben: Ya Resûlallah! Bize iki İçki hakkında fetva ver. Biz bunları Yemen’de yapıyorduk. Biri bit'dir. Bu baldandır. Şiddetlenînceye kadar ne-biz yapılır. Diğeri biradır. Bu darıdan ve arpadandır. Şiddetleninceye kadar nebîz yapılır, dedim. Resûlüllah (sallallahü aleyhi ve sellem)’e Cevâmiu'l-Kelim mühürleriyle verilmişti. namazdan sarhoş eden her müskiri yasak ediyorum:: buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5217,
			"arabicnumber": "2002",
			"text": "(Bize Kuteybe b. Saîd rivâyei etti. ki): Bize Abdülaziz (yani Deraverdi) Umara b. Gaziyye'den, o da Ebû'z-Zübeyr'den, o da Câbir'den naklen rivâyet etti ki, bir adam Ceyşan'dan gelmiş. (Ceyşan Yemen'dedir) ve Peygamber (sallallahü aleyhi ve sellem)'e, memleketlerinde içtikleri darıdan yapılan bira denilen bir içkinin hükmünü sormuş. Peygamber (sallallahü aleyhi ve sellem) de: verir mi o?» diye sormuş. Adam: Evet! cevâbını vermiş. Resûlüllah (sallallahü aleyhi ve sellem): «Her sarhoşluk veren şey haramdır. Müskirat içene Tıyneîu'l-Habâl sunacağına Allah (azze ve celle)'nin ahdi vardır.» buyurmuşlar. Ashâb: Ya Resûlüllah! Bu Tiynetü’l-Habâ! nedir? diye sormuşlar. «Cehennemliklerin teridir. Yahut Cehennemliklerin usaresidir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5218,
			"arabicnumber": "2003.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5219,
			"arabicnumber": "2003.02",
			"text": "Bize İsbâk b. İbrahim ile Ebû Bekr b. İshâk ikisi birden Ravh b. Ubade'den rivâyet ettiler. (Demiş ki): Bize İbn-i Cüreye rivâyet etti. ki): Bana Mûsa b. Ukbe Nâfi'den, o da İbn-i Ömer'den naklen haber verdi ki: Resûlüllah (sallallahü aleyhi ve sellem): sarhoşluk veren şey şarabdır ve her sarhoşluk veren şey haramdır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5220,
			"arabicnumber": "2003.03",
			"text": "(Bize Salih b. Mismar Es-Sülemî de rivâyet etti. ki): Bize Ma'n rivâyet etti. ki): Bize Abdü’l-Aziz b. Rluttalib, Mûsa b. Ukbe'den bu isnadla bu hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5221,
			"arabicnumber": "2003.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 5222,
			"arabicnumber": "2003.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 5223,
			"arabicnumber": "2003.06",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 5224,
			"arabicnumber": "2003.07",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Abdullah b. Nümeyr rivâyet etti. H. İbn-i NÜmeyr de rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Ubeydullah, Nâfi'den, o da İbn-i Ömer'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem); kim şarabı dünyada içerse, âhireile onu içmez. Meğer ki, tevbe ede!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 5225,
			"arabicnumber": "2003.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 5226,
			"arabicnumber": "2004.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 5227,
			"arabicnumber": "2004.02",
			"text": "(Bize Muhammed b. Beşşâr rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şıı'be Yahya El-Bebrâ'den rivâyet etti. ki): İbn Abbâs'ın yanında nebizin lâfını ettiler de şunu söyledi:' Resûlüllah (sallallahü aleyhi ve sellem) için bir tuluma nebiz yapılırdı. Şu'be şöyle dedi: Pazartesi gecesinde yapılır, artık onu pazartesi ile salı günü ikindiye kadar içerdi. Şayet ondan bir şey artarsa onu hizmetçiye içirir yahut dökerdi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 5228,
			"arabicnumber": "2004.03",
			"text": "Bize Ebü Bekr b. Ebî Şeybe ile Ebû Küreyb ve İshâk b. İbrahim de rivâyet ettiler. Lâfız Ebû Bekir'le Ebû Küreyb'indir. (İshâk «Aherenâ» tâbirini kullandı. Ötekiler «haddesenâ» dediler.) (Dediler ki): Bize Ebû Muâviye A'meş'den, o da Ebû Ömer'den, o da İbn Abbâs'dan naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem) için kuru üzüm ıslatılır. Onu o gün, ertesi gün, daha ertesi gün (yani) üçüncü günün akşamına kadar içerdi. Sonra emir buyurur da başkasına içirilir yâbut dökülürdü",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 5229,
			"arabicnumber": "2004.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 5230,
			"arabicnumber": "2004.05",
			"text": "(Bana Muhammed b. Ahmed b. Ebî Halef de rivâyet etti. ki): Bize Zekeriyya b. Adiyy rivâyet etti. ki): Bize Ubeydullah, Zeyd'den, o da Yabyâ Ebû Ömer Nehâi'den naklen rivâyet etti. Yahya şöyle dedi: Bir cemâat İbn Abbâs'a şarab alıp satmanın ve o hususta ticaret yapmanın hükmünü sordular. İbn Abbâs: Müslüman mısınız siz? diye sordu. Evet! dediler. Öyle ise o ahp satmaya ve ticaret yapmaya yaramaz, dedi. Bu sefer kendisine nebizi sordular. O da şunu söyledi: Resûlüllah (sallallahü aleyhi ve sellem) bir sefere çıktı. Sonra döndü. Ashabından bâzı kimseler küplere, hurma oymalarına ve kabaklara nebiz kurmuşlardı. O emir vererek bunları döktürdü. Sonra bir tulum hazırlanarak içine kuru üzüm ve su konmasını emir buyurdu. Ve geceden konularak sabahladı. Artık ondan o günü ve gelecek akşam, ertesi günü de ta akşama kadar içti. (Kalanı da) içti ve içirdi. Sabahlayınca emir verdi ve kalanı döküldü",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 5231,
			"arabicnumber": "2005.01",
			"text": "(Bize Şeycan b. Ferrûh rivâyet etti. ki): Bize Kâ-sim (yani İbn-i Fadl El-Huddânî) rivâyet etti. ki): Bize Sümâme (yani İbn-i Hazn El-Kuşeyrî) rivâyet etti. ki): Âişe'ye rastladım da kendisine nehizin hükmünü sordum. Âişe hemen Habeşli bir câriye çağırarak: Buna sor! Çünkü Resûlüllah (sallallahü aleyhi ve sellem)'e nebizi o yapıyordu, dedi. Bunun üzerine Habeşli câriye: Ben ona geceden bir tulum içinde nel;iz yapar ve ağzını bağlar onu asardım. Sabahladığı vakit ondan içerdi, dedi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 5232,
			"arabicnumber": "2005.02",
			"text": "(Bize Muhammed b. Müsennâ El-Anesî rivâyet etti. ki): Bize Abdulvehhab Es-Sekati, Yûnus'dan, o da Hasan'dan, o da annesinden, o da Âişe'den naklen rivâyet etti. (Şöyle dedi): Biz Resûlüllah (sallallahü aleyhi ve sellem)'e bir tulum içinde nebiz yapardık. Yukarısı bağlanırdı. Tulumun alt deliği vardı. Biz sabahleyin nebiz yapar, onu akşamleyin içerdi; akşamleyin nebiz yapar, onu sabahleyin içerdi. hadîsler nebiz yapmanın ve tadı değişip kükremedikçe o nebizi içmenin caiz olduğuna delildir. Nevevî ümmetin bütün ulemâsının bu hususta İcma ettiğini söylüyor. (sallallahü aleyhi ve sellem)'in kendilerine yapılan nebizi üç gün içtikten sonra ya hizmetçiye İçirmesi yahut dökmesi değişip değişmediğinden emin olmadığı içindir. Üç günden sonra nezâheti icabı kendisi içmez, şayet nebizin halinde bir değişiklik yoksa onu hizmetçisine içirir; dökmezdi. Çünkü nebiz israfı haram olan maldı. Eğer bir değişme ve içki alâmeti görürse onu dökerdi. Zira nebiz içki olduktan sonra haram ve necis olurdu. Bu hadîsin İbn-i Abbâs rivâyetinde üç güne kadar içerdi; Hazret-i Âişe rivâyetinde ise, sabahleyin hazırlananı akşam içer; akşamleyin hazırlananı sabahleyin içerdi, denilmesi birbirine muhalif sayılmaz. Çünkü bir günde içmek ondan daha fazla da içmeye mani değildir. Bazıları bu iki rivâyetin arasını şöyle bulmuşlardır: İhtimal Hazret-i Âişe yazın sıcağında yapılan nebizi haber vermiştir. Şiddetli sıcaklarda yapılan nebizin bir gün sonra bozulma ihtimâli vardır. İbn Abbâs hadîsi ise kış zamanına mahsustur. Bazıları da Âişe hadîsi ne-bizin azlığına hamlolımur. Az olunca bir günde bitiverir. İbn Abbâs hadîsi ise birkaç gün yetecek kadar çok olan nebize hamlolunur, demişlerdir. Tulumun dibindeki su akıtacak deliği yani musluğudur",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 5233,
			"arabicnumber": "2006.01",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Abdûlaziz (yani İbn-i Ebî Hâzim) Ebû Hazım'dan, o da Sehl b. Sa'd'dan naklen rivâyet etti. Sehl Şöyle dedi: Ebû Üseyd Es-Sâid-i zifafında Resûlüllah (sallallahü aleyhi ve sellem)'i davet etti. Karısı o gün hizmetçileri idi. Gelin de girdi. Sehl Şöyle dedi: Biliyor musunuz Resûlüllah (sallallahü aleyhi ve sellem)'e ne sundu? Onun için geceden bir çanağın içine birkaç hurma ıslattı. Yemeği ye-yince kendisine bunu sundu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 5234,
			"arabicnumber": "2006.02",
			"text": "(Bize Kuteybe b. Saîd de rivâyet etti. ki): Bize Ya'kub (yani İbn-i Abdurrahman) Ebû Hazim'den rivâyet etti. ki): Sehl'i dinledim. (Şöyle diyordu): Ebû Üseyd-i Sâid-i Resûlüllah (sallallahü aleyhi ve sellem)'e gelerek onu davet etti... yukarki hadîs gibi rivâyette bulunmuş. Ama «Yemek yedikten onra onu kendisine sundu» dememiştir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 5235,
			"arabicnumber": "2006.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 5236,
			"arabicnumber": "2007",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 5237,
			"arabicnumber": "2008",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 5238,
			"arabicnumber": "2009.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 5239,
			"arabicnumber": "2009.02",
			"text": "Bize Muhammed b. Müsennâ ile İbn-i Beşşâr rivâyet ettiler. Lâfız İbn-i Müsennâ'nındır. (Dediler ki): Bize Muhammed b. Cafer rivâyet etti. ki): Bize Şu'be rivâyet etti. ki): Ebû İshâk El-Hemdâni'yi şöyle derken işittim. Berâ'ı dinledim. Şunları söylüyordu. Resûlüllah (sallallahü aleyhi ve sellem) Mekke'den Medine'ye yöneldiği ve kendisini Suraka b. Mâlik b. Cu'ş'un takib ettiği vakit Resûlüllah (sallallahü aleyhi ve sellem) ona beddua etti. Bu sebeple atının ayakları yere battı. Bunun üzerine Sürâka: Allah'a benim için dua et! Sana zarar vermiyeceğim, dedi. O da Allah'a dua etti. Derken Resûlüllah (sallallahü aleyhi ve sellem) susadi. Ve bir koyun çobanının yanına uğradılar. Bekr Sıddîk diyor ki: Ben bir tas alarak ona Resûlüllah (sallallahü aleyhi ve sellem) için biraz süt sağdım da kendisine getirdim. O içti, ten de rahat oldum",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 5240,
			"arabicnumber": "168.02",
			"text": "Bize Muhammed b. Abbâd ile Züheyr b. Harb rivâyet ettiler. Lâfız İbn Abtâd'ındır. (Dediler ki): Bize Ebû Saffan rivâyet etti. ki): Bize Yûnus, Zührî'den naklen haber verdi. ki): İbn-i Müseyyeb şuna söyledi. Ebû Hüreyre ki): İsrâ' gecesi Peygamber (sallallahü aleyhi ve sellem)’e ilyada şarabla sütten iki kadeh getirildi. O bunlara bakarak sütü aldı. Bunun üzerine Cibrîl (aleyhisselâm) kendisine şunu söyledi. Seni fıtrata hidayet buyuran Allah'a hamd olsun. Şarabı almış olsaydın ümmetin sapardı",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 5241,
			"arabicnumber": "168.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 5242,
			"arabicnumber": "2010.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 5243,
			"arabicnumber": "2010.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb rivâyet ettiler. Lâfız Ebû Küreyb'indir. (Dediler ki): Bize Ebû Muâviye, Âmeş’den, o da Ebû Salih'den, o da Cabir b. Abdillah'dan naklen rivâyet etti. dedi): Resûlüllah (sallallahü aleyhi ve sellem)'e birlikte idik. Su istedi ve bir adam: Ya Resûlallah! Sana nebiz sunmayalım mı? dedi. Bunun üzerine: «Hay hay!» buyurdular. Adam hemen koşarak çıktı ve içinde nebiz bulunan bir tas getirdi. Resûlüllah (sallallahü aleyhi ve sellem): velev üzerine aykırı bir çırpı koymak suretiyle olsun örtseydin ya!» buyurdu ve içti",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 5244,
			"arabicnumber": "2011.01",
			"text": "(Bize Osman b. Ebî Şeybe de rivâyet etti. ki): Bize Cerir Âmeş'den, o da Ebû Süfyân ile Ebû Salih'den, onlar da Câbir'den naklen rivâyet etîi. Câbir (Şöyle dedi): Ebû Humeyd denilen bir adam Naki'den bir tas süt getirdi de Resûlüllah (sallallahü aleyhi ve sellem) kendisine: velev üzerine aykırı bir çırpı koymak suretiyle olsun Örtseydin ya!» buyurdular. hadîsi Buhârî «Kitâbu'l-Eşribe»'de tahrîc etmiştir, Va'dil Akik'de bir yerin ismidir. Resûlüllah (sallallahü aleyhi ve sellem)’in koyun otlatmak için koruduğu yerin burası olduğu söylenir. Ki Medine'den yirmi fersah uzaktadır. Resûlüllah (sallallahü aleyhi ve sellem)'in kabın üzerine hiç olmazsa aykırı bir çubuk konulmasını emir buyurması, Örtecek başka bir şey bulunmadığına göredir. Ulemâ, kapları Örtme emrinin birçok faideleri olduğunu söylemişlerdir. Bunlardan iki tanesi buradaki hadîslerde varid olmuştur. Biri şeytandan korumaktır. Çünkü şeytan kapak açamaz, bağ çözemez. İkincisi senenin bir gecesinde inen taundan korumaktır. Bunlardan maada pisliklerden korumak, muhtelif sinek ve böceklerden muhafaza gibi faydaları vardır. Zira açık bırakılan kabın içine geceleyin akreb gibi zehirli bir hayvan düşebilir. Bunu bilmeyen kimse kabın içindekini yer veya içerse zehirlenir. Ebû Humeyd'in kapları örtmek geceye mahsustu sözü hadîsin metninden değildir. diyor ki: «Ekseri usul ulemasının kavline göre —ki İmâm Şafiî ile diğer ulemanın mezhebleri de budur. Sahabinin tefsiri lâfzın zahir olan mânasına muhalif ise hüccet değildir. Bu tefsir konusunda başka müçtehidlerin ona uyması lâzım gelmez. Ama hadîsin zahiri mânâsında sahabinin sözüne muhalif bir şey yok, fakat mücmel olursa bu takdirde sahabinin te'viline müracaat olunur ve hadîs onun söylediğine hamledilir... örtme emri umumîdir. Binâenaleyh râvinin mezhebi ile amel ederek tahsisi kabul etmez. Umum üzere bırakılır.»",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 5245,
			"arabicnumber": "2011.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 5246,
			"arabicnumber": "2012.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 5247,
			"arabicnumber": "2012.02",
			"text": "(Bize Ahmed b. Yûnus dâhi rivâyet etti. ki): Bize Züheyr rivâyet etti. ki): Bize Ebû'z-Züheyr, Câbir'den rivâyet etti. ki): Resûlüllah (sallallahü aleyhi ve sellem): kapayın!..» buyurdular. Râvi, Leys'in hadîsi gibi nakletmiş tir. Yalnız o: örtün!» demiş. Bir de: halkının üzerine elbiselerini yakar!» demiştir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 5248,
			"arabicnumber": "2012.03",
			"text": "(Bana Muhammed b. Müsennâ da rivâyet etti. ki): Bize Abdurrahman rivâyet etti. ki): Bize Süfyân Ebû'z-Zübeyr'den, o da Câbir'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen yukarkilerin hadîsi gibi rivâyette bulundu ve: fâsık evi sahiplerinin üzerine yakar.» dedi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 5249,
			"arabicnumber": "2012.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 5250,
			"arabicnumber": "2012.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 5251,
			"arabicnumber": "2012.06",
			"text": "(Bize Ahmed b. Osman En-Nevfelî dahi rivâyet etti. ki): Bize Ebû Asım rivâyet etti. ki): Bize İbn-i Cüreyc bu hadîsi Afâ' ile Amr b. Dinar'dan Ravh’ın rivâyeti gibi haber verdi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 5252,
			"arabicnumber": "2012.07",
			"text": "(Bize Ahmed b. Yûnus rivâyet etti. ki): Bize Züheyr rivâyet etti. ki): Bize Ebû'z-Zübeyr, Câbir'den rivâyet etti. H",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 5253,
			"arabicnumber": "2013.01",
			"text": "(Bize Yahya b. Yahya dahi rivâyet etti. ki): Bize Ebû Hayseme Ebû'z-Zübeyr'den, o da Câbir'den naklen haber verdi. Câbir Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): kavuştuğu vakit yatsının koyu karanlığı gidinceye kadar çocuklarınızla hayvanlarınızı salmayın! Çünkü şeytanlar güneş kavuştuğu zaman yatsının koyu karanlığı gidinceye kadar yayılırlar.» buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 5254,
			"arabicnumber": "2013.02",
			"text": "(Bana Muhammed b. Müsennâ da rivâyet etti. ki): Bize Abdurrahman rivâyet etti. ki): Bize Süfyân, Ebû'z-Zübeyr'den, o da Câbir'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen Züheyr'in hadîsi gibi rivâyette bulundu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 5255,
			"arabicnumber": "2014.01",
			"text": "(Bize Amr'un-Nâkid rivâyet etti. ki): Bize Hâşim b. Kasını rivâyet etîi. ki): Bize Leys b. Sa'd rivâyet etti. ki): Bana Yezid b. Abdillah b. Üsâme b. Hâd El-Leysî, Yahya b. Saîd’den, o da Ca'fer b. Abdillah b. Hakem'den, o da Ka'kaa' b. Hakînı'den, o da Câbir b. Abdillah'dan naklen rivâyet etti. (Şöyle dedi): Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: örtün! Tulumu da bağlayın! Çünkü senede bir gece veba iner. Kapağı olmayan hiç bir kabın yahut üzerinde bağı olmayan hiç bir tulumun yanından geçmez ki, İçine bu vebadan bir şey inmesin.» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 5256,
			"arabicnumber": "2014.02",
			"text": "(Bize Nasr b. Ali El-Cehdamî de rivâyet etti. ki): Bana baham rivâyet etti. ki): Bize Leys b. Sa'd bu isnadla bu hadîsin mislini rivâyet etti. Yalnız o: «Çünkü senede bir gün vardır. O günde veba iner,» demiş; hadîsin sonuna şunu ziyade etmiştir: «Leys dedi ki: Bizde yabancılar bundan Aralık ayında korunurlar.»",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 5257,
			"arabicnumber": "2015",
			"text": "Bize Eim Bekr b. Ebî Şeybe ile Amru'n-Nâkid ve Züheyr b. Harb rivâyet ettiler. (Dediler ki): Bize Süfyân b. Uyeyne, Zührî’den, o da Sâlîm'den, o da babasından, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti: zaman ateşi evlerinizde bırakmayın!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 5258,
			"arabicnumber": "2016",
			"text": "Bize Saîd b. Amr El-Eş'asî ile Ebû Bekr b. Ebî Şeybe, Muhammed b. Abdillah b. Nümeyr, Ebû Amir El-Eş'arî ve Ebû Küreyb rivâyet ettiler. Lâfız Ebû Âmir'indir. (Dediler ki): Bize Ebû Üsâme, Kü-reyb'den, o da Ebû Bürde'den, o da Ebû Mûsa'dan naklen rivâyet etti. dedi): Medine'de bir ev geceleyin sâhiblerinîn üzerine yandı. Bunların hali Peygamber (sallallahü aleyhi ve sellem)'e anlatılınca: ki bu ateş size ancak düşmandır. O halde uyuduğunuz zaman onu yanınızdan söndürün!» buyurdular. hadîsini Buhârî «Bed'ül-Halk» bahsinde; İbn-i Ömer'le Ebû Mûsa rivâyetlerini «Kitâbu'l-isti'zan»'da. İbn-i Ömer rivâyetini Ebû Dâvud ile İbn-i Mâce «Kitâb'ul-Edeb»'de; Tirmizî «Etme» bahsinde; Ebû Mûsa hadîsini İbn-i Mâce «Kitâb'ul-Edeb»'de muhtelif râvilerden tahrîc etmişlerdir. Fare demektir. Bu kelime Fâsık'dan alınma ismi tasgirdir. Fâsık; yoldan çıkan demektir. Fare de geceleri deliğinden çıkarak çeşitli zararlar yaptığı için ona bu isim verilmiştir. Fâşiyenin cem'idir. Fâşiye, yayılan demektir ki, murad keçi, koyun, sığır ve deve gibi yayılarak otlayan hayvanlardır. Aslında kömür demektir. Arablar bir benzetme yaparak akşamla yatsı arasındaki karanlığa da fahme demişlerdir. diyor ki: «Bu hadiste dünya ve âhiret mesâlihini bir araya toplayan muhtelif hayır nevilerinden cümleler vardır. Şeytanın ezasından kurtulmanın yolu da bu âdabı Peygamber (sallallahü aleyhi ve sellem) emir buyurmuş, Allah Taûlâ dahi aynı esBâbı onun şerrinden kurtulmaya sebep halketmiştir. Binâenaleyh şeytan kapalı bir kabı açmaya, bağlı bir tulumu çözmeye, kilitli bir kapıyı açmaya ve bir çocuğa veya başkasına ezâ vermeye ancak bu esBâbı bulduğu zaman muktedir olabilir. Nitekim sahih bir hadîste: . evine girerken besmele çekerse, şeytan: Bize bunların yanında gecelemek yok (yani, bizim bu evdekiler üzerine bir sultamız yok) der.\" buyurulmuştur...» rivâyetlerde bilhassa şeytanın şerrinden korunmaya tenbih buyu-rulmakta, şeytanların geceleyin etrafa dağıldıkları bildirilerek çoluk çocuğun ve hayvanatın akşamla yatsı arası olur olmaz yerlere salınmaması tavsiye edilmektedir. Hadîs-i şerif bütün rivâyetleriyle şeytanların varlığına ve insanlara çeşitli zararlar verebileceğine delâlet etmektedir. Maalesef yirminci asır müslümanlarından birçok zavalıllar dinden istifa «etmiş mürtedlerin menfî propagandalarına kapılarak şeytan iddiasını istihfafla veya açık açık inkârla karşılıyorlar. Bizim vazifemiz bu zavallılara bu yaptıklarının açık açık küfür yani dinden çıkmak olduğunu hatırlatmaktır. İslâm'ı hiç kabul etmeyenlerle, ondan yeni yeni çıkmış olanlara Allah'dan hidâyet dilemekten başka sözümüz yoktur. Bizim kırkbeş milyon müslümanm yaşadığı Türkiye'nin radyolarından onbeş dakikalık bir yayın süresinde cin, şeytan, melek ve mucize gibi şeylere en azından onbeş defa efsâne diyen radyo memur ve amirleriyle de uğraşacak vaktimiz yoktur. Bunun hükümetin lâikliğine ne derecede aykırı bir cüretkârlık olduğunu hükümeti idare edenler düşünsün. Biz bir defa daha şunu te'kid etmek isteriz ki, şeytanlar vardır. Bunların varlığına inanmak bir müslüman için zarurîdir. İnanmayan veya alay edenler derhal dinden çıkarak mürtedler güruhuna dâhil olurlar. hadîste senenin bir gecesinde vebanın (yani taun hastalığının) yeryüzüne indiği bildiriliyor. vebayı: «Ekseriyetle Ölüme götüren umumî bir hastalıktır.» diye tarif etmiştir. sarihlerinden Übbî, Cevheri'nin bu tarifini beğenmemiş: «Cevherî'nin söylediği veba malûm olan hastalıktır. Hadîsten anlaşılan bu veba değildir. O başka bir vebadır» demişse de burada hatâ eden Cevheri değil, kendisi olmuştur. Çünkü yeryüzüne indirildiği bildirilen veba hastalıktan başka bir şey değildir. Übbî: «İnmenin hakikati cisimlere mahsustur.» diyor. Bu söz vebanın yere inen bir hastalık olduğuna münafî değildir. Çünkü hastalıkların mikrob denilen ufak hayvanlardan meydana geldiği bugün ispat edilmiş bir keyfiyettir. Mikroplar gözle görülmeyecek kadar ufak da olsalar birer cisimdirler. (sallallahü aleyhi ve sellem) yangına sebebiyet vermemek için evlerde yanan mum, kandil ve gaz lâmbası gibi şeylerin söndürülmesini emir buyuruyor. Yangına sebebiyet vermiyeceği kuvvetle kestirilirse söndürmeden bırakmak da caizdir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 5259,
			"arabicnumber": "2017.01",
			"text": "Bize Ebû Bekr b. Ebî Şeyfae İle Ebû Küreyb rivâyet ettiler. (Dediler ki): Bize Ebû Muâviye Âmeş'den, o da Hayseme'den, o da Ebû Huzeyfe'den, o da Huzeyfe'den naklen rivâyet etti. (Şöyle dedi): Peygamber (sallallahü aleyhi ve sellem)'le birlikte bir yemekte bulunduğumuz vakit, Resûlüllah (sallallahü aleyhi ve sellem) başlayıp elini sürünceye kadar biz ellerimizi sürmezdik. Bir defa onunla birlikte bir yemekte bulunduk, derken koğuluyor gibi (süratle) bir câriye geldi. Ve elini yemeğe sürmeğe kalkıştı. Resûlüllah (sallallahü aleyhi ve sellem) hemen onun elini tuttu, sonra koğuluyor gibi bir bedevi geldi, onun da elini tuttu. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) besmele çekilmeyen yemeği şüphesiz ki, şeytan helâl sayar. bu cariyeyi yemeği onunla helâl etmek için getirdi. Ben de elini tuttum. Bu Bedeviyi dahi yemeği onunla helâl yapmak için getirdi. Ben de elini futtum. Nefsim yed-i kudretinde olan Allah'a yemin olsun ki, onun efi cariyenin eliyle birlikte benim elimdedir.»",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 5260,
			"arabicnumber": "2017.02",
			"text": "(Bize bu hadîsi İshâk b. İbrahim El-Hanzalî de rivâyet etti. ki): Bize îsa b. Yûnus haber verdi. ki): Bize A'meş Hayseme b. Abdirrahman'dan, o da Ebû Huzeyfe El-Erhabî'den, o da Huzeyfe b. Yeraam'dan naklen haber verdi. (Şöyle dedi): «Biz Resûlüllah (sallallahü aleyhi ve sellem)’le birlikte bir yemeğe davet olunduğumuz vakit...» râvi, Ebû Muâvîye hadîsi mânâsında rivâyette bulunmuştur. O cariye ile bedevinin her ikisi hakkında «tard olunuyor gibi» demiş, hadîsinde bedevinin gelişini cariyenin gelişinden Önceye almıştır. Hadîsin sonuna da şunu ziyade etmiştir: «Sonra besmele çekti ve yedi.»",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 5261,
			"arabicnumber": "2017.03",
			"text": "(Bu hadîsi bana Ebû Bekr b. Nâfi' dahi rivâyet etti. ki): Bize Abdurrahman rivâyet etti. ki): Bize Süfyân Ameş'den bu is-nadla rivâyette bulundu ve cariyenin gelişini bedevinin gelişinden Önce zikretti. ile bedevinin arkadan koğuluyorlarmış gibi koşarak gelmeleri Resûlüllah (sallallahü aleyhi ve sellem) başlamadan ve besmele çekmeden yemeğe yetişmek içindir. Onları koşturan şeytandır. Ve maksadına ancak bu suretle erişecektir. Aksi takdirde o yemekten yemesine imkân yoktur. Resûlüllah (sallallahü aleyhi ve sellem) bunu görünce hem cariyenin, hem şeytanın ellerinden tutarak kendilerine mâni olmuştur. eli cariyenin eliyle birlikte benim elimdedir.» cümlesindeki eli»'nden murad, şeytanın elidir. Bazı rivâyetlerde ve bedevinin elleriyle birlikte onun eli benim elimdedir.» Kâdî Iyâz bu vechin daha doğru olduğunu rivâyet etmiştir. Maamafih burada olduğu gibi, müfred sigasıyle dani mânâ doğrudur. Çünkü cariyenin eüni zikretmek bedevinin elini tutmamış olmayı iktiza etmez. Rivâyet ne şekilde olursa olsun mânâ birdir. O da Resûlüllah (sallallahü aleyhi ve sellem)’in cariye ve bedevi ile birlikte şeytanın elini de tutmasıdır. yemeği helâl saymasından murad bâzılarına göre hakikaten helâl olacağını itikad etmesidir. Bir takımları bundan murad: «Yemeğin bereketini kaldırmaktır, böyle bir yemeği yiyen doymaz» demişlerdir. Nevevî de şunları söylemiştir: «Helâl sayar cümlesinin mânâsı yemeğe imkân bulur, demektir. Yani bir insanın besmelesiz başladığı yemeği şeytan yer. Fakat besmeleyle başlarsa veya sofradakilerden bazıları besmele çekerse, o yemekten yiyemediği gibi, henüz kimsenin yemediği yemekten de yiyemez. Sonra kelâm ve fıkıh ulemâsı ile muhaddislerin gelmiş geçmiş cumhûruna göre bu hadîs ile şeytanın yemek yediğine dâir vârid olan diğer hadîsler zahirî mânâlarına hamlediîmişlerdir. Yani şeytan hakikaten yemek yer. Çünkü bunu akıl imkânsız görmediği gibi, şeriat da inkâr etmemiş; bilâkis ispat eylemiştir. kabulü ve itikad olunması vâcibdir.» birinci rivâyetinde evvelâ cariyenin, sonra bedevinin geldiği, ikinci rivâyetinde ise bunun aksine olarak evvelâ bedevinin, sonra cariyenin geldiği bildiriliyor. Bu iki rivâyetin arası şöyle bulunur: İkinci rivâyette bedevinin evvel zikredilmesi sözdedir. Cariyenin gelişi bedevinin gelişi üzerine atıf harflerinden (vav) ile atfedilmiştir. Vav tertib icab etmez. Birinci rivâyette ise evvelâ cariyenin geldiği zikredilmiş; bedevinin gelişi onun üzerine atıf harflerinden (sümme) ile bağlanmıştır. Sümme tertib ifade eder. Binâenaleyh evvelâ cariyenin, sonra bedevinin geldiği açıkça anlaşılır. İkinci rivâyeti de bu mânâya hamletmek icab eder",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 5262,
			"arabicnumber": "2018.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 5263,
			"arabicnumber": "2018.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 5264,
			"arabicnumber": "2019",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Leys rivâyet etti. H, Muhammed b. Rumh da rivâyet etti. ki): Bize Leys, Ebû'z-Zübeyr'den, o da Câbir'den, o da Resûlüllah (sallallahü aleyhi ve sellem)'den naklen haber verdi: elle yemeyin; çünkü şeytan sol eliyle yer» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 5265,
			"arabicnumber": "2020.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 5266,
			"arabicnumber": "2020.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 5267,
			"arabicnumber": "2020.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 5268,
			"arabicnumber": "2021",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 5269,
			"arabicnumber": "2022.01",
			"text": "Bize Hasen b. Ali El-Hulvâni ile Ebû Bekr b. İshâk 1da rivâyet ettiler. (Dediler ki): Bize İbn-i Ebî Meryem rivâyet etti. ki): Bize Muhammed b. Cafer haber verdi. ki): Bana Muhammed b. Amr b. Halhale, Vehb b. Keysan'dan, o da Ömer b. Ebî Seleme'den naklen haber verdi ki, Şöyle dedi: Bir gün Resûlüllah (sallallahü aleyhi ve sellem)'le beraber yemek yedim de, sahanın kenarındaki etten almağa başladım. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem); «önünden ye!» buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 5270,
			"arabicnumber": "2022.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 5271,
			"arabicnumber": "2023.01",
			"text": "(Bize Amr'un-Nâkid rivâyet etti. ki): Bize Süfyân b. Uyeyhe, Zührî'den, o da Ubeydullah'dan, o da Ebû Saîd'den naklen rivâyet etti. Ebû Saîd: (sallallahü aleyhi ve sellem) tulumların hünsalaştırilmasım yasak etti, demiş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 5272,
			"arabicnumber": "2023.02",
			"text": "(Bana Harmele b. Yahya da rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus İbn Şihâb'dan, o da Ubeydullah b. Abdillah b. Utbe'den, o da Ebû Saîd-i Hudrî'den, naklen haber verdi ki, Şöyle dedi: (sallallahü aleyhi ve sellem) tulumların hünsalaştırilmasını, ağızlarından içilmesini yasak etti",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 5273,
			"arabicnumber": "2023.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 5274,
			"arabicnumber": "2024.01",
			"text": "(Bize Heddâb b. Hâlid rivâyet etti. ki): Bize Hemmam rivâyet etti. ki): Bize Katâde, Enes'den rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem) ayakta su içmekten men etmiş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 5275,
			"arabicnumber": "2024.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 5276,
			"arabicnumber": "2024.03",
			"text": "(Bize Heddâb b. Hâlid rivâyet etti. ki): Bize Hemmâm rivâyet etti. ki): Bize Katâde, Ebû îsa El-Üsvârî'den, o da Ebû Saîd-i Hudrî'den naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem) ayakta su içmekten men etmiş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 5277,
			"arabicnumber": "2025.01",
			"text": "Bize Züheyr b. Harb ile Muhammed b. Müsennâ ve İbn-i Beşşâr rivâyet ettiler. Lâfız Züheyr ile İbn-i Miisennâ'nındır. (Dediler ki): Bize Yahya b. Saîd rivâyet etti. ki): Bize Şu'be rivâyet etti. ki): Bize Katâde Ebü tsa El-Üsvarî'den, o da Ebû Saîd-i Hudrî'den, o da Resûlüllah (sallallahü aleyhi ve sellem)’den naklen rivâyet etti ki: Ayakta su İçmekten nehiy buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 5278,
			"arabicnumber": "2025.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 5279,
			"arabicnumber": "2026",
			"text": "(Bana Abdu'l-Cebbâr b. Ala' rivâyet etti. ki): Bize Mervân (yani El-Fezârî) rivâyet etti. ki): Bize Ömer b. Hamza rivâyet etti. ki): Bana Ebû Gatafan El-Mürrî haber verdi ki, kendisi Ebû Hüreyre'yi şöyle derken işitmiş. (sallallahü aleyhi ve sellem): biriniz ayakta su içmesin! Her kim unutursa kusuversin!» buyurdular. rivâyetler ayakta su içmenin yasak edildiğini gösteriyor. Ulemanın bu babdaki sözlerini az sonra göreceğiz. kim unutursa kusuversin...» cümlesi nedip ve istihbab mânâsına alınmıştır. Yani unutarak ayakta su içen kimsenin, o suyu kusması müstehab olur. Delili bu hadîsdir. Çünkü emri vücûba hamletmek mümkün olmazsa istihbab mânâsına alınır. ikinci rivâyetinde Katâde, Hazret-i Enes'in: O daha beter mi, yoksa daha kötü mü dediğinde şekketmiştir. Eşerr kelimesi ism-i tafdil olarak az kullanılmakla beraber fasihdir. Kelime birçok sahih hadişlerde bu tarzda kullanılagelmiştir. Binâenaleyh hakkında ileri geri söz söylemek doğru değildir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 5280,
			"arabicnumber": "2027.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 5281,
			"arabicnumber": "2027.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 5282,
			"arabicnumber": "2027.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 5283,
			"arabicnumber": "2027.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 5284,
			"arabicnumber": "2027.05",
			"text": "(Bize İbn-i Ebi Ömer rivâyet etti. ki): Bize Sekafî Eyyûb'dan, o da Yahya b. Ebî Kesir'den, o da Abdullah b. Ebî Katâde'den, o da babasından naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem) icabın içine solumaktan nehiy buyurmuş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 5285,
			"arabicnumber": "267.04",
			"text": "Bize Kuteybe b. Saıd ile Ebû Bekr b. Ebî Şeybe rivâyet ettiler. (Dediler ki): Bize Veki' Azra b. Sabit El-Ensârî'den, o da Sümâme b. Abdillah ta. Enes'den, o da Enes'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem) kabın İçine üç defa şolurmuş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 5286,
			"arabicnumber": "2028.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 5287,
			"arabicnumber": "2028.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 5288,
			"arabicnumber": "2028.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 5289,
			"arabicnumber": "2029.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlik'e, İbn-i Şihab'dan dinlediğim, onun da Enes b. Mâlik'den rivâyet ettiği şu hadîsi okudum: (sallallahü aleyhi ve sellem)'e su ile karıştırılmış süt getirdiler. Sağında bir bedevi, solunda da Ebû Bekr vardı. Sütü içti, sonra bedeviye verdi. Ve: Evvelâ sağ, sonra onun sağı... buyurdular.»",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 5290,
			"arabicnumber": "2029.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 5291,
			"arabicnumber": "2029.03",
			"text": "(Bize Abdullah b. Mesleme b. Ka'neb de rivâyet etti. Lâfız onundur. ki): Bize Süleyman (yani İbn-i Bilâl) Abdullah b. Abdirrahman’dan rivâyet etti. O da Enes b. Mâlik'i rivâyet ederken dinlemiş. Enes şunu söylemiş: Bize Resûlüllah (sallallahü aleyhi ve sellem) evimize geldi. Az sonra su istedi. Biz de onun için bir koyun sağdık. Sonra o süte şu kuyunun suyundan kattım da Resûlüllah (sallallahü aleyhi ve sellem)’e verdim. Resûlüllah (sallallahü aleyhi ve sellem) (sütü) İçti. Ebû Bekr solunda, Ömer karşısında, bir bedevi de sağında bulunuyordu. Resûlüllah (sallallahü aleyhi ve sellem) içmesini bitirdikten sonra, Ömer kendisine Ebû Bekr'i göstererek: İşte Ebû Bekr ya Resûlüllah! dedi. Fakat Resûlüallah (sallallahü aleyhi ve sellem) bedeviye verdi. Ebû Bekr'le Ömer'i bıraktı. Ve Resûlüllah (sallallahü aleyhi ve sellem) sağdakıler, sağ da kiler!» buyurdu. «Şu halde bu sünnettir; şu halde bu sünnettir; şu halde bu sünnettir!» demiş. hadîsi Buhârî «Hibe» bahsinde tahrîc etmiştir. bedevinin Hâlid b. Velid (radıyallahü anh) olduğu söylenir. Fakat Aynî bunu kabul etmek istememiştir. Hadîsin gerek «eymen» şeklinde müfred, gerekse «eymenûn» şeklinde cem' olarak rivâyet edilen cümleleri mansub ve merfu' şekillerde rivâyet olunmuştur. Mansûb okunduğuna göre cümle: «Sağdakine ver...» Merfu' okunduğuna göre: «Sağdaki daha lâyıktır...» diye takdir olunur. Ve her iki vecihle sahihtir. Fakat «El-Eymenûn» şeklindeki cem' rivâyeti müfred rivâyetinin de merfu' okunmasını tercih ettirir. Enes'in annelerinden murad hakikî annesi Ümmü Suleym ile teyzesi Ümmü Hıram ve diğer yakınlarıdır. Ömer'in Resûlüllah (sallallahü aleyhi ve sellem)'e seslenerek «îşte Ebû Bekr» demesi unutulacağından endişe ederek onu hatırlatmak, Resûlüllah (sallallahü aleyhi ve sellem)'in sağında oturan bedeviye de Ebû Bekr'in büyüklüğünü bildirmek içindir. Süte su katmanın hikmeti onu hafifletmek veya soğutmak yahut bütün cemaata yetsin diye çoğaltmaktır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 5292,
			"arabicnumber": "2030.01",
			"text": "Bize Kuteybe b. Saîd Mâlik b. Enes'den —ona okunanlar meyanında— o da Ebû Hâzim'den, o da Sehl b. Sa'd Es-Sâidî'den naklen rivâyet etti ki,: Resûlüllah (sallallahü aleyhi ve sellem)'e içecek bir şey getirmişler, o da ondan içmiş. Sağında bir çocuk solunda ise yaşlılar bulunuyormuş. Resûlüllah çocuğa: vermeme bana izin verir misin?» diye sormuş. Çocuk: Hayır! Vallahi senden gelen nasibime kimseyi tercih edemem! demiş. diyor ki: «Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) onu çocuğun eline bıraktı.»",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 5293,
			"arabicnumber": "2030.02",
			"text": "(Bize Yahya b. Yahyâ rivâyet etti. ki): Bize Abdül Aziz b. Ebî Hazim haber verdi. H. bu hadîsi Kuteybe b. Saîd de rivâyet etti. ki): Bize Yâkub, yani İbn-i Abdirrahman El-Kaarî rivâyet etti. Her iki râvi Ebû Hâzim’den, o da Sehl b. Sa'd'dan, o da Peygamber (sallallahü aleyhi ve sellem)’den bu hadîsin mislini rivâyet etmişler. Ama «Onu bıraktı» dememişlerdir. Lâkin Yâkub'un rivâyetinde: «Onu ona verdi dedi» cümlesi vardır. hadîsi Buhârî «Müsâkaat» bahsinde tahrîc etmiştir. hadîsteki içilecek şeyden murad dahi yukarkinde olduğu gibi, su katılmış süttür. Bahsedilen çocuk Fadl b. Abbâs (radıyallahü anh) dır. Bunu İbn-i Tin hikâye ettiği gibi, Abbâs’ın kardeşi Abdullah olduğunu da rivâyet etmiştir. diyor ki: «Bu hadîsler bu açık sünneti beyan etmektedirler. Mezkûr beyan şeriatın birçok delillerinden anlaşılan her nevi ikrama sağdan başlamanın müstehab olduğuna uygundur. Hadîs-i şerif içilen şeylerde ikrama —yaşça küçük veya mertebece düşük bile olsa — sağdakinden başlanacağına delildir. Çünkü Resûlüllah (sallallahü aleyhi ve sellem) sütü bedevi ile çocuğa Hazret-i Ebû Bekr'den önce vermiştir. Fazilet sahipleriyle büyüklerden başlanması meselesi başka sıfatlarda'birbirlerine denk oldukları zamandır...» rivâyetlerde bahsi geçen çocuğun tıbn-i Abbâs (radıyallahü anhı) olduğu kaydedilmektedir. Fakat İbn Abbâs'ın bulunduğu vak'a da Hazret-i Meymûne'nin evinde geçmiştir. Enes (radıyallahü anh) rivâyetindeki vak'a ise kendi evinde cereyan etmiştir. Binâenaleyh bunlar bir değil, ayrı ayrı vak'alardır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 5294,
			"arabicnumber": "2031.01",
			"text": "Bize Ebû Bekr b. Ebi Şeybe ile Amru'n-Nâkıd İshâk b. İbrahim ve İbn-i Ebî Ömer rivâyet ettiler. (İshâk: Ahberanâ Ötekiler ise: Haddesenâ tâbirlerini kullandılar.) (Dediler ki): Bize Süfyân, Amr’dan, o da Atâ'dan, o da İbn Abbâs'dan naklen rivâyet etti, (Şöyle dedi) ; Resûlüllah (sallallahü aleyhi ve sellem): bir yemek yediği vakit etini yalamadıkça yahut yalatmadıkça onu silmesin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 5295,
			"arabicnumber": "2031.02",
			"text": "(Bana Harun b. Abdillah rivâyet etti. ki): Bize Haccâc b. Muhammed rivâyet etü. H. Abd b. Humeyd de rivâyet etti. ki): Bana Ebû Asım haber verdi. Bunlar toptan İbn-i Cüreyc'den rivâyet etmişlerdir. H, Züheyr b. Harb da rivâyet etti. Lâfız onundur. ki): Bize Ravh b. Ubâde rivâyet etti. ki): Bize İbn-i Cüreyc rivâyet etti. ki): Ata' şunu söylerken işittim. İbn Abbâs'ı dinledim, şunu söylüyordu: (sallallahü aleyhi ve sellem): yemekten yediği vakit yalamadıkça veya yalatmadıkça elini silmesin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 5296,
			"arabicnumber": "2032.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 5297,
			"arabicnumber": "2032.02",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Ebû Muâviye, Hişam b. Urve'den, o da Abdurrahman b. Sa'd'dan, o da İbn-i Ka'b b. Mâlik'den, o da babasından naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem) üç parmakla (yemek) yer; elini silmeden Önce yalardı",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 5298,
			"arabicnumber": "2032.03",
			"text": "(Bize Muhammed b. Abdillah b. Nümeyr de rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Hişâm Abdurrahman b. Sa'd'dan rivâyet etti ki, ona da Abdurrahman b. Kâ'b b. Mâlik — yahut Abdullah b. Kâ'b— babası Ka'b'dan naklen haber vermiş. Babası kendilerine anlatmış ki: Resûlüllah (sallallahü aleyhi ve sellem) üç parmakla yemek yermiş. Yemekten kalktı mı parmaklarını yalarmış",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 5299,
			"arabicnumber": "2032.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 5300,
			"arabicnumber": "2033.01",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Süfyân b. Uyeyne Ebû’z-Zübeyr'den, o da Câbir'den naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem) parmaklarla sahfuım yıkanmasını emir buyurmuş: siz bereketin hangisinde olduğunu bilmezsiniz;) demiştir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 5301,
			"arabicnumber": "2033.02",
			"text": "(Muhammed b. Abdillah b. Nümeyr rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Süfyân Ebû’z-Züheyr’den, o da Câbir’den naklen rivâyet etti. Câbir Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) lokması düştüğü vakit hemen onu alsın ve Üzerindeki bulaşığı gidererek yesin, onu şeytana bırakmasın! Parmaklarını yalamadıkça elini mendile silmesin çünkü bereket yemeğinin hangisinde olduğunu bilmez.» buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 5302,
			"arabicnumber": "2033.03",
			"text": "(Bize bu hadîsi İshâk b. İbrahim dahi rivâyet etti. ki): Bize Ebû Dâvud El-Hâferi haber verdi. H. bu hadîsi Muhammed b. Râfi' de rivâyet etti. ki): Bize Abdürrezzâk rivâyet etti. Her iki râvi Süfyân'dan bu isnadla bu hadîsin mislini rivâyet etmişlerdir. ikisinin hadîsinde de: yalamadıkça yahut yalatmadıkça mendille silmesin.» ibaresi ve ondan sonrası vardır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 5303,
			"arabicnumber": "2033.04",
			"text": "(Bize Osman b. Ebî Şeybe rivâyet etti. ki): Bize Cerir, A'meş'den, o da Ebû Süfyân'dan, o da Câbir'den naklen rivâyet etti. Câbir Şöyle dedi: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i şöyle buyururken işittim: şeytan her halu sânında sizden birinize gelir. Hattâ yemeği esnasında da gelebilir. İmdi birinizden lokma düşerse hemen ondaki bulaşığı gidersin, sonra onu yesin! Onu şeytana bırakmasın. Yemekten ayrıldığı zaman parmaklarını yalarsın. Çünkü bereketin yiyeceğinin hangisinde olduğunu bilmez.»",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 5304,
			"arabicnumber": "2033.05",
			"text": "Bize bu hadîsi Ebû Küreyb ile İshâk b. İbrahim de hep birden Ebû Muâviye'den, o da A'nneş'den bu isnadla: lokması düşerse ilah...» şeklinde rivâyet ettiler. Râvi hadîsin başını: şeytan bîrinize gelir.» cümlesini anmamıştır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 5305,
			"arabicnumber": "2033.06",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Muhammed b. FudayI, A'meş'den, o da Ebû Salih ile Ebû Süfyân'dan, onlar da Câbir'den, o da Peygamber (sallallahü aleyhi ve sellem)’den parmak yalama hakkında... Bir de Ebû Süfyân'dan, o da Câbir'den, o da Peygamber (sallallahü aleyhi ve sellem)’den lokmayı da zikrederek yukarkilerin hadîsi gibi rivâyette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 5306,
			"arabicnumber": "2034",
			"text": "Bana Muhammed b. Hatim ile Ebû Bekr b. Nâfi' El-Abdî rivâyet ettiler. (Dediler ki): Bize Behz rivâyet etti. ki): Bize Hammad b. Seleme rivâyet etti, ki): Bize Sabit, Enes'den rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) yemek yediği vakit üç parmağını yıkar ve şöyle buyururmuş: lokması düştüğü vakit hemen omdan bulaşığı gidersin ve onu yesin, onu şeytana bırakmasın!» buyururdu. Bir de bize sahanı silmemizi emir buyurdu: siz bereketin hangi yiyeceğinizde olduğunu bilmezsiniz.» dedi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 5307,
			"arabicnumber": "2035.01",
			"text": "(Bana Muhammed bi Hatim rivâyet etti. ki): Bize Behz rivâyet etti. ki): Bize Vüheyb rivâyet etti. ki): Bize Süheyl babasından, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti: yemek yediği vakit parmaklarını yalasın. Çünkü bereketin bunların hangisinde olduğunu bilmez.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 5308,
			"arabicnumber": "2035.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 5309,
			"arabicnumber": "2036.01",
			"text": "Bize Kuteybe b. Saîd ile Osman b. Ebî Şeybe rivâyet ettiler. Ve lâfızda birbirlerine yaklaştılar. (Dediler ki): Bize Cerir, A'meş’den, o da Ebû Vâil'den, o da Ebû Mes'ûd-ı Ensârî'den naklen rivâyet etti. (Şöyle dedi): Ensardan bir adam vardı. Kendisine Ebû Şuayb denilirdi. Bu zâtın kasab bir kölesi vardı. Ebû Şuayb Resûlüllah (sallallahü aleyhi ve sellem)'i görerek yüzünden aç olduğunu anladı ve kölesine: Vah sana! Bize beş kişilik yemek yap, çünkü ben beş kişinin beşincisi olarak Peygamber (sallallahü aleyhi ve sellem)' davet etmek istiyorum, dedi. O da yaptı. Sonra Peygamber (sallallahü aleyhi ve sellem)’e geldi ve onu beş kişinin beşincisi olarak davet etti. Bunların arkasına bir adam takıldı. Kapıya vardığında Peygamber (sallallahü aleyhi ve sellem): zât bizim arkamazidan geldi. İstersen ona izin verirsin, dilersen geri döner.» buyurdular. Ebû Şuayb: Hayır! Bilâkis ona izin veriyorum ya Resûlallah! dedi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 5310,
			"arabicnumber": "2036.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 5311,
			"arabicnumber": "2036.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 5312,
			"arabicnumber": "2037",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Yezid b. Harun rivâyet etti. ki): Bize Hammad b. Seleme, Sâbit'den, o da Enes'den naklen haber verdi ki, Resûlüllah (sallallahü aleyhi ve sellem)’in îranlı bir komşusu güzel çorba yaparmış. Resûlüllah (sallallahü aleyhi ve sellem)'e de yapmış. Sonra onu davete gelmiş. Peygamber (sallallahü aleyhi ve sellem) Âişe için: da davet ediyor musun?» demiş. Komşusu: Hayır! cevâbını vermiş. Onun üzerine Resûlüllah (sallallahü aleyhi ve sellem): (Gidemem!)» cevabını vermiş. tekrar davete gelmiş. Resûlüllah (sallallahü aleyhi ve sellem) (yine): da davet ediyor musun?» diye sormuş. O zât: Hayır! cevâbını vermiş. Resûlüllah (sallallahü aleyhi ve sellem): «Hayır! (Gidemem!)» demiş. tekrar dönerek onu davet etmiş. Resûlüllah (sallallahü aleyhi ve sellem) (yine): da davet ediyor musun?» diye sormuş. Komşusu üçüncüde: — Evet! cevâbını vermiş. Bunun üzerine kalkarak peşpeşe yürümüşler ve komşunun evine varmışlar, diyor ki: «Bu hadîs ortada bir özür bulunup davete icabetin vücûbuna mâni olduğuna hamledilir. Bu sebeple Peygamber (sallallahü aleyhi ve sellem) icabet edip etmemekte muhayyer bulunuyordu. O da iki caizden birini seçti. Hazret-i Âişe'ye de izin verilmezse davete gitmeyecekti. Zira Hazret-i Âişe'de açlık veya benzeri bir şey vardı. Bundan dolayı Resûlüllah (sallallahü aleyhi ve sellem) onsuz yemeğe gitmeyi kabul etmedi. Bu adâb-ı muaşeretten, arkadaşlık hukukundan ve beraber düşüp kalkma adabından ma'duddur. Komşusu Hazret-i Âişe'nin gelmesine izin verince Peygamber (sallallahü aleyhi ve sellem) kendisi için caiz olan ikinci şıkkı seçmiştir. Çünkü maslahat yenilenmiştir. Bu da zevcesi için arzu ettiği ikramın husul bulmasıdır...» bahsinde ulemanın davete icabetin hükmü hususunda ihtilâf ettiklerini, davete gitmemek için ne gibi şeylerin, özür sayılacağını görmüştük. «İranlı zâtın Hazret-i Âişe'yi davet etmemesi, ihtimal yemeği az olduğu içindir» demişlerdir. Hadîs-i şerif çorba ve diğer mubah yemeklerin yenilmesi caiz olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 5313,
			"arabicnumber": "2038.01",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Halef b. Halîfe, Yezid b. Keysân'dan, o da Ebû Hâzım'dan, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem) bir gün yahut bir gece (dışarı) çıktı. Ve birden Ebû Bekir'le Ömer'e rastladı. bu saatte evlerinizden çıkaran nedir?» diye sordu. Açlık ya Resûlallah! dediler. de. Nefsim yed-i kudretinde olan Allah'a yemin ederim ki, beni de sizi çıkaran çıkarmıştır. Kalkın!» dedi. Hemen onunla birlikte kalktılar ve Ensâr'dan bir zâtın evine vardı. Bir de baktı ki, o zât evinde yok. Kadın onu görünce: Hoş geldiniz, safa geldiniz! dedi. Resûlüllah (sallallahü aleyhi ve sellem) de ona: «Fütân nerede?» diye sordu. Kadın: Bize tatlı su getirmeğe gitti, dedi. O anda ensâri geldi. Ve Resûlüllah (sallallahü aleyhi ve sellem) ile iki arkadaşını gördü. Sonra: Allah'a hamd olsun bugün benden müsafirleri daha şerefli olan kimse yoktur, dedi. Hemen giderek onlara bir hurma salkımı getirdi ki, içinde koruk, kuru ve olgun hurmalar vardı. Bundan buyurun! dedi ve bıçağı aldı. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) ona: sağmal koyuna dokunma1» buyurdu. Fakat o, onlar için kesti ve hem koyundan, hem o hurma salkımından yediler, içtiler. doyup, suya kandıkları vakit Resûlüllah (sallallahü aleyhi ve sellem) Ebû Bekir'le Ömer'e: yed-i kudretinde olan Allah'a yemin ederim ki, kıyâmet gününde bu nimetlerden mutlaka sorulacaksınız! Sizi evlerinizden açlık çıkardı. Sonra şu nimetlere kavuşmadan dönmediniz.» buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 5314,
			"arabicnumber": "2038.02",
			"text": "(Bana İshâk b. Mansûr da rivâyet etti. ki): Bize Ebû Hişâm (yani Muğıre b. Seleme) haber verdi. ki): Bize Abdulvâhid b. Ziyad rivâyet etti. Bize Yezid rivâyet etti. ki): Bize Ebû Hazım rivâyet etti. ki): Ebû Hüreyre'yi şunu söylerken işittim. Bir defa Ebû Bekir, Ömer yanında olduğu halde otururken, ansızın yanlarına Resûlüllah (sallallahü aleyhi ve sellem) geliverdi ve: burada oturtan nedir?» diye sordu. Bizi evlerimizden açlık çıkardı. Seni hakla gönderen Allah'a yemin ederiz... dediler. râvi Halef b. Halîfe'nin hadîsi gibi rivâyette bulundu. (sallallahü aleyhi ve sellem) ile iki arkadaşını misafir eden en sârinin ismi Ebûl-Heysem Mâlik b. Teyyihan'dır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 5315,
			"arabicnumber": "2039",
			"text": "(Bana Haccâc b. Şâir rivâyet etti. ki): Bana Dah-hâk b. Mahled bir kâğıttan —ki onunla evvelâ bana çatmış, sonra onu bana okumuştur— rivâyet etti. ki): Bize bunu Hanzala b. Ebî Süfyân haber verdi. ki): Bize Saîd b. Mînâ' rivâyet etti. ki): Câbir b. Abdillah'ı şunu söylerken işittim: kazıldığı vakit Resûlüllah (sallallahü aleyhi ve sellem)’de açlık gördüm. Hemen karıma dönerek ona Sende bir şey var mı? Çünkü ben Resûlüllah (sallallahü aleyhi ve sellem) de şiddetli açlık gördüm, dedim. Bana içinde bir Ölçek arpa bulunan bir dağarcık çıkardı. Evimizde beslediğimiz bir de kuzucuğumuz vardı. Ben onu kestim. Kadın da arpayı öğüttü. Ve benimle beraber o da işini bitirdi. Kuzuyu onun çömleğine parçaladım. Sonra Resûlüllah (sallallahü aleyhi ve sellem)'e döndüm. Kadın: Beni Resûlüllah (sallallahü aleyhi ve sellem)'le beraberindekilere karşı rezil etme! dedi. Ben Resûlüllah (sallallahü aleyhi ve sellem)'e gelerek (vaziyeti) gizlice kendisine söyledim. Ve: Ya Resûlallah! Biz bir kuzucuğumuzu kestik. Kaduı fla evimizde bulunan bir ölçek arpayı öğüttü. İmdi sen beraberinde biirkaç kişiyle beraber gel! dedim. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) seslendi. Ve: hendek ahalisi! Câbir sizin için davet tertib etmiş. Hemen buyrun!» dedi. (Bana da): gelinceye kadar sakın çömleğinizi ateşten indirmeyin! Hamurunuzdan da ekmek yapmayın!» buyurdular. (Eve) geldim. Resûlüllah (sallallahü aleyhi ve sellem) de cemaatın önünde geldiler. Kanının yanına vardım: Seni gidi seni! dedi. Ben de: Bana söylediğini yaptım, dedim. Peygamber (sallallahü aleyhi ve sellem)'e hamurumuzu çıkardı, ona tükürdü ve bereketlendirdi. Sonra çömleğimize giderek onun da içine tültürdü ve bereketlendirdi. Sonra (Kadına): ekmekçi çağır da seninle beraber ekmek yapsın! Çömleğinizden de kepçeyle al, onu (ateşten) indirmeyin!» buyurdu. Ordu bin kişi idi. Allah'a yemin ederim! Bir güzel yediler hattâ (doyarak) onu bırakıp gittiler. Çömleğimiz de olduğu gibi fıkırdıyordu. Hamurumuz dahi —yahut Dahhak’ın dediği gibi— ekmek yapılıyor (fakat) olduğu gibi duruyordu. hadîsi Buhârî «Kitâbu’l-Meğâzi» ile «Kitâbu'l-Cihad»'da tahric etmiştir. Hendek Harbini yerinde görmüştük. Burada da hülâsa olarak deriz ki: Bu harb kıtlık senesinde olmuştu. Müşrikler Ebû Süfyân’ın kumandasında dört bin kişilik bir ordu ile Medîne'ye gelmişlerdi. Müslümanlarsa bin kişiden ibaret idiler. Açlık ve yokluk sebebiyle Medine'nin harice açık bulunan yerine hendek kazarak müdafaa harbine karar vermişlerdi. Bu davet işi hendeğin kazıldığı zamana tesadüf etmiştir. Açlıktan karnın içeriye çekilmesidir. Ashâb-ı kirâm'la Resûlüllah (sallallahü aleyhi ve sellem)'in bu harbde açlıktan karınlarına taş bağladıkları rivâyet olunur. Davet yemeğidir. Mutlak yemek olduğunu söyleyenler de vardır. Bu kelime fârisidir. Birçok sahih hadislerden anlaşıldığına göre Peygamber (sallallahü aleyhi ve sellem) Arabça olmayan bazı sözler söylemiştir. Bu da onun cevazına delâlet eder. Resûlüllah (sallallahü aleyhi ve sellem)'in bu davete ordunun önünde gelmesi ashabı kendisi davet ettiği içindir. Burada kendisi davet sahibi makamındadir. Yoksa başka zamanlarda ordusunun Önünde gitmez; kimsenin ökçelerine basınasına sebebiyet vermezdi. Hazret-i Câbir'in hanımının ismi Süheyle binti Mes'ud olup, Resûlü Ekrem (sallallahü aleyhi ve sellem)'e bey'at eden ensardandır. kadının Câbir'e: «Bike ve fıike» sözü onu zemmetmekten kinayedir. Bâzılarına göre bundan murad: \"Başına kepazelik gelsin: Zem olunasın.» demektir. Bunun mânâsı ; «Bu senin reyinle ve tedbirsizliğinle oldu.» demektir, mütalâasında bulunanlar da vardır. Biz bu makamda: «Seni gidi seni» deriz",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 5316,
			"arabicnumber": "2040.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlik b. Enes'e, İshâk b. Abdillah b. Ebî Talha'dan dinlediğim, onun da Enes b. Mâlik'den dinlediği şu hadîsi okudum: Enes şöyle diyormuş: Talha Ümmü Süleym'e dedi ki: Ben Resûlüllah (sallallahü aleyhi ve sellem)’in sesini zayıf işittim. Onda açlık olduğunu biliyorum. Senin yanında bir şey var mı? Ümmü Süleym: Evet! dedi ve arpa ekmeğinden birkaç parça çıkardı. Sonra kendisinin bir baş örtüsünü alarak bir kısmına ekmeği sardı, sonra onu benim elbisemin altına tıktı. Bir kısmıyla da beni sardı. Sonra beni Resûlüllah (sallallahü aleyhi ve sellem)'e gönderdi. Ben ekmeği götürdüm ve Resûlüllah (sallallahü aleyhi ve sellem)’i mescidde otururken buldum. Beraberinde cemaat vardı. Başlarında durdum. Resûlüllah (sallallahü aleyhi ve sellem): Ebû Talha mı gönderdi?» diye sordu. Evet! dedim. «Yemek için mi?» dedi. Evet! cevâbını verdim. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) beraberindekilere ; dedi ve yürüdü. Ben de önlerinde yürüdüm ve Ebû TaJ-ha'ya gelerek ona haber verdim. Ebû Talha: Ey Ümmü Süleym! Resûlüllah (sallallahü aleyhi ve sellem) cemaatla geldi. Halbuki bizde onları doyuracak bir şey yoktur, dedi. Ümmü Süleym: Allah ve Resûlü bilir, cevâbını verdi. Derken Ebû Talha giderek, Resûlüllah (sallallahü aleyhi ve sellem)'in huzuruna çıktı. Resûlüllah (sallallahü aleyhi ve sellem) de onunla beraber gelerek eve girdiler. Müteakiben Resûlüllah (sallallahü aleyhi ve sellem) i varsa getir, ya Ümmü Süleym!» dedi. O da bu ekmeği getirdi. Resûlüllah (sallallahü aleyhi ve sellem) emir buyurai'ak ekmeği parçalattı. Üzerine de Ümmü Süleym tulumundan yağ sıkarak onu katıklath. Sonra bu ekmek hakkında Resûlüllah (sallallahü aleyhi ve sellem) Allah ne dilediyse onu söyledi. Sonra: kişiye izin ver!» dedi. Ebû Talha da onlara izin verdi. Ve yediler. Nihayet doydular, sonra çıktılar. Sonra (tekrar) ; kişiye izin ver!» buyurdu. Böylece cemaatın hepsi yediler ve doydular. Bu cemâat yetmiş yahut seksen kişi idi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 5317,
			"arabicnumber": "2040.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Abdullah b. Nümeyr rivâyet etti. H. İbn-i Nümeyr de rivâyet etti. Lâfız onundur. ki): Bize babam rivâyet etti. ki): Bize Sa'd fo. Saîd rivâyet etti. ki): Bana Enes b. Mâlik rivâyet etti. ki): Beni Ebû Talha davet için Resûlüllah (sallallahü aleyhi ve sellem)'e gönderdi. Yemek yapmıştı. Ben de gittim. Resûlüllah (sallallahü aleyhi ve sellem) cemaatla birlikte idi. Bana bir baktı, ben de utanarak: Ebû Talha'ya icabet buyur! dedim. Bunun üzerine cemaata: emrini verdi. Ebû Talha: Ya Resûlallah! Ben ancak senin için bir şey yapmıştım, dedi. çığından Resûlüllah (sallallahü aleyhi ve sellem) yiyeceğe dokundu ve onun hakkında bereket duasında bulundu. Sonra: on kişiyi İçeriye al!» buyurdu. Ve: dedi. Onlara parmaklarının arasından bir şey de çıkardı. Cemâat yediler, doydular ve çıktılar. (Yine): on kişi al!» buyurdu. Onlar da doyuncaya kadar yediler. İçeriye on kişi alıp, dışarıya on kişi çıkara çıkara, nihayet onlardan girmeyen ve doyuncaya kadar yemeyen tek bir kişi kalmadı. Sonra sofrayı hazırladı. Bir de ne görelim, sofra cemâatin yedikleri andaki gibidir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 5318,
			"arabicnumber": "2040.03",
			"text": "(Bana Saîd b. Yahya El-Ümevî de rivâyet etti. ki): Bana babam rivâyet etti. ki): Bize Sa'd b. Saîd rivâyet etti. ki): Enes b. Mâlik'i dinledim. Sunu söyledi: Ebû Talha Resûlüllah (sallallahü aleyhi ve sellem)'e gönderdi...» Râvi hadîsi İbn-i Nümeyr hadîsi gibi nakletmiştir. Yalnız o sonunda: «Sonra kalanı aldı da topladı. Sonra ona bereket duasında bulundu. Ve sofra evvelki haline döndü. Resûlüllah (sallallahü aleyhi ve sellem) de: «Bunu alın!» buyurdular.»",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 5319,
			"arabicnumber": "2040.04",
			"text": "(Bana Amru'n-Nâkıd da rivâyet etti. ki): Bize Abdullah b. Ca'fer Er-Rakkî rivâyet etti. ki): Bize Ubeydullah b. Amr, Abdülmelik b. Umeyr'den, o da Abdurrahman b. Ebî Leylâ'dan, o da Enes b. Mâlik'den naklen rivâyet etti. Enes şöyle dedi: Talha, Peygamber (sallallahü aleyhi ve sellem)'in kendisine has olmak üzere yemek yapmasını Ümm-ü Süleym'e emretti. Sonra beni ona gönderdi...» Ve râvi hadîsi nakletmiştir. Bu hadîste şöyle de demiştir: üzerine Peygamber (sallallahü aleyhi ve sellem) elini koydu ve onun üzerine besmele çekti. Sonra: kişiye izin ver!» dedi. Ebû Talha da onlara izin vererek girdiler. Resûlüllah (sallallahü aleyhi ve sellem): ve besmele çekin!» dedi. Onlar da yediler. Bunu seksen kişiye yaptı. Bundan sonra Peygamber (sallallahü aleyhi ve sellem) ile ev sahipleri yediler. Ve artık bıraktılar.»",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 5320,
			"arabicnumber": "2040.05",
			"text": "(Bize Abd b. Humeyd dahi rivâyet etti. ki): Bize Abdullah b. Mesleme rivâyet etti. ki): Bize Abdülaziz b. Muhammed, Amr b. Yahya'dan, o da babasından, o da Enes b. Mâlik'den bu kıssa ile Ebû Talha'nın yemeği hakkında Peygamber (sallallahü aleyhi ve sellem)'den rivâyette bulundu. O bu hadîste şunu da söyledi: üzerine Ebû Talha kapıya durdu Resûlüllah (sallallahü aleyhi ve sellem) gelince ona: Ya Resûlallah! (Hazırlığımız) ancak az bir şeydi, dedi. Resûlüllah (sallallahü aleyhi ve sellem): onu! Çünkü Allah onda bereket halkedecektir!»",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 5321,
			"arabicnumber": "2040.06",
			"text": "(Bize yine Abd b. Humeyd rivâyet etti. ki): Bize Hâlid b. Mahled El-Becelî rivâyet etti. ki): Bana Muhammed b. Mûsa rivâyet etti. ki): Bana Abdullah b. Abdillah b. Ebî Talha, Enes b. Mâlik'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsi rivâyet etti. Bu hadîste şöyle de demiştir: «Sonra Resûlüllah (sallallahü aleyhi ve sellem) yedi. Ev sahipleri de yedi. Ve komşularına yetecek kadarını artırdılar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 5322,
			"arabicnumber": "2040.07",
			"text": "(Bize Hasen b. Alî El-Hulvâni dahi rivâyet etti. ki): Bize Vehb b. Cerir rivâyet etti. ki): Bize babam rivâyet etti. ki): Cerir b. Zeyd'i dinledim: Amr b. Abdillah b. Ebî Talha'dan, o da Enes b. Mâlik'den naklen rivâyet ediyordu. Enes şöyle dedi: Ebû Talha, Resûlüllah (sallallahü aleyhi ve sellem)'i mescitte uzanmış yüz üstü, arka üstü dönerken görmüş. Bunun Üzerine Ümmü Süleym'e gelerek: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i mescidde uzanmış yüz üstü, arka üstü dönerken gördüm. Aç olduğunu zannederim, dedi...» râvi hadîsi nakletmiştir. Bu hadîste şunu da söylemiştir: Resûlüllah (sallallahü aleyhi ve sellem) ile Ebû Talha, Ümmü Süleym ve Enes b. Mâlik yediler. Fazla da arttı. Onu komşularımıza hediyye ettik",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 5323,
			"arabicnumber": "2040.08",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 5324,
			"arabicnumber": "2040.09",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 5325,
			"arabicnumber": "2041.01",
			"text": "Bize Kuteybe b. Said, Mâlik b. Enes'den, ona İshâk b. Abdillah b. Ebi Talha'dan naklen okunanlar meyanında rivâyet etti. İshâk, Enes b. Mâlik'i şunu söylerken işitmiş: terzi, yaptığı bir yemeğe Resûlüllah (sallallahü aleyhi ve sellem)’i davet etti. Enes b. Mâlik ki): Bu yemeğe Resûlüllah (sallallahü aleyhi ve sellem)’le birlikte ben de gittim. Yemek sahibi Resûlüllah (sallallahü aleyhi ve sellem)’e arpa ekmeği ile içinde kabak ve pastırma bulunan bir çorba takdim etti. Ben Resûlüllah (sallallahü aleyhi ve sellem)’in kabağı tasın kenarından araştırdığını gördüm. Artık o günden sonra kabağı sevmekteyim",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 5326,
			"arabicnumber": "2041.02",
			"text": "Bize Muhammed b. Alâ' ile Ebû Küreyb rivâyet ettiler. (Dediler ki): Bize Ebû Üsame, Süleyman b. Muğire'den, o da Sabit'ten, o da Enes'den naklen rivâyet etti. Enes (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem)’l bir adam davet etti. Onunla birlikte ben de gittim. Derken içinde kabak bulunan bir çorba getirdiler. Resûlüllah (sallallahü aleyhi ve sellem) bu kabaktan yemeğe başladı. Hoşuna gidiyordu. Ben bunu görünce kabağı yemeyip ona vermeye başladım. Râvi diyor ki: Enes, ondan sonra arük kabak benim de hoşuma gider oldu, dedi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 5327,
			"arabicnumber": "2041.03",
			"text": "(Bana Haccâc b. Şâir ile Abd b. Umeyd hep birden Abdurrez-zâk'tan rivâyet ettiler. ki): Bize Ma'mer, Sabit El-Bûnânî ile Âsim El-Ahvel'den, onlar da Enes b. Mâlik'den naklen haber verdiler ki: Terzi bir adam Resûlüllah (sallallahü aleyhi ve sellem)'i davet etmiş... da ziyâde etti: «Sabit ki): Arkacığından Enes'i şunu söylerken işittim. Bundan sonra benim için içerisine kabak koydurabile-ceğim hiç bir yemek yapılmamıştır ki, kabak konmamış olsun.» hadîsi Buhârî «Kitâbü’l-Buyû'» ve «Kitâbü'l-Et'ıme»'de; Ebû Dâvud, Tirmizî ve Nesâî «Velime» bahsinde muhtelif râvilerden tahrîc etmişlerdir. Tirmizî onu «Şemail» bahsinde de tahrîc etmiş ve: «Bu hadîs hasen şahindir.» demiştir. Kurtubî diyor ki: «Peygamber (sallallahü aleyhi ve sellem)’in tasın kenarından kabağı takib etmesi, yemeğin türlü olmasındandır. Bu sebeple hoşuna gideni yani kabağı yiyiyor. Hoşuna gitmeyeni —ki pastırmadır— bırakıyordu.»",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 5328,
			"arabicnumber": "2042.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 5329,
			"arabicnumber": "2042.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 5330,
			"arabicnumber": "2043",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 5331,
			"arabicnumber": "2044.01",
			"text": "(Bize Ebû Bekr b. Ebi Şeyfae ile Ebû Saîd El-Eşecc ikisi birden Hafs'dan rivâyet ettiler. Ebû Bekr ki): Bize Hafs b. Gıyâs, Mus'ab b. Süleym'den rivâyet etti. ki): Bize Enes b. Mâlik rivâyet etti. ki): Peygamber (sallallahü aleyhi ve sellem)'i dizlerini dikerek oturmuş hurma yerken gördüm",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 5332,
			"arabicnumber": "2044.02",
			"text": "(Bize Züheyr b. Harb ile İbn Ebî Ömer de hep birden Süfyân'dan rivâyet ettiler. İbn Ebî Ömer ki): Bize Süfyân b. Uyeyne Mus'ab b. Süleym'den, o da Enes'den naklen rivâyet etti. Enes (Şöyle dedi): (sallallahü aleyhi ve sellem)’e kuru hurma getirdiler de, onu çömelmiş olduğu halde taksim etmeye başladı. Ondan acele diyordu. rivâyetinde Zeri' yerine Hasis denilmiştir. ve Hasis kelimeleri ikisi de acele mânâsına gelirler. Resûlüllah (sallallahü aleyhi ve sellem)'in acele etmesi başka bir işe gideceği içindir. Fahr-i Kainat (sallallahü aleyhi ve sellem) Efendimiz sofraya bağdaş kurarak veya diz çökerek oturup yerleşmezdi. Âdetleri daima ya iki dizini veya bir dizini dikerek oturmak yahut çömelmiş vaziyette birkaç lokma almaktı. «Sahîh-i Buhârî»'de Resûlüllah (sallallahü aleyhi ve sellem)'in: yerleşerek yemek yemem.» buyurduğu rivâyet olunmuştur. Bun?, dan murad ; Ben çok yemek isteyenler gibi yerleşip oturmam. Bilâkis aceleci gibi oturur ve az yerim demektir. (sallallahü aleyhi ve sellem)’in fakir fukaraya dağıttığı bu hurma kendinin idi. Karnı aç olduğu için acele birkaç hurma yemesi bundandır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 5333,
			"arabicnumber": "2045.01",
			"text": "(Bize Muhammed b. Müsennâ rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be rivâyet etti, ki): Cebele b. Sühaym'ı şunu söylerken işittim. İbn Zübeyr bize kuru hurma yediriyordu. O gün insanlara kıtlık isabet etmişti. Biz yerken yanımızdan İbn Ömer geçiyordu: Çifter yemeyin! Çünkü Resûlüllah (sallallahü aleyhi ve sellem) çift yemeden nehiy buyurdu. Meğer ki kişi, dîn kardeşine izin vermiş ola! dedi. izin kelimesini kaydederek: «Bu kelimenin ancak ibnü Ömer'in sözünden olduğunu zannederim.» demiş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 5334,
			"arabicnumber": "2045.02",
			"text": "(Bize bu hadîsi Ubeydullah b. Muâz da rivâyet etti. ki): Bize babam rivâyet etti, H, Muhammed b. Beşşâr dahi rivâyet etti. ki): Bize Abdurrahman b. Mehdi rivâyet etti. Her iki râvi Şu'be'den bu isnadla rivâyette bulunmuşlardır. Onların hadisinde Şu'be'nin sözü yoktur. «O gün insanlara kıtlık isabet etmişti» cümlesi dahi yoktur",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 5335,
			"arabicnumber": "2045.03",
			"text": "Bana Züheyr b. Harb ile Muhammed b. Müsennâ rivâyet ettiler. (Dediler ki): Bize Abdurrahman, Süfyân'dan, o da Cebele b. Sühaym'dan naklen rivâyet etti. ki): Ben İbn Ömer'i şunu söylerken işittim: (sallallahü aleyhi ve sellem) sahiplerinden izin almadıkça iki hurmayı beraber yemekten nehiy buyurdu. hadîsi Buhârî «Et'ime», «Mezâlim» ve «Şerîket» bahislerinde Ebû Dâvud ile Tirmizî ve İbn Mâce «Et’l-me»'de; Nesâî «Velîme»'de muhtelif râvilerden tahrîc etmişlerdir. Bu babda birçok hadîsler vardır. diyor ki: «Sahiplerinden izin almadıkça bu nehiy ittifakıdır. İzin alırlarsa beis yoktur. Ulemâ bu nehyin tahrim için mi, yoksa kerahet ve edep için mi olduğunda ihtilâf etmişlerdir. Kâdi Iyâz, Zahirîler'den buradaki nehyin tahrim ifade ettiğini, başkalarından ise kerahet ve edep için olduğunu nakletmiştir. Doğrusu tafsilâta gitmektir. Eğer yiyecekler aralarında or-taksa birbirlerinin rızası olmadan çifter çifter yemek haramdır. Rızaları açıkça söylemekle yahut sarâhet yerini tutacak bir karine veya nazı geçme gibi bir şeyle hâsıl olur. Hepsinin razı olup olmadığında şüphe varsa çifter yemek haramdır. Yiyecek cemaattan başka birine yahut içlerinden birine ait olursa, yalnız onun rızası şarttır. Onun rızasını almadan ikişer yemek haramdır. Onunla birlikte yiyenlerin de izin istemeleri müstehab olur. Yiyecek kendinin olup, arkadaşlarını misafir etmişse, ikişer yemesi haram değildir. Sonra yiyecek azsa, çifter yememek daha iyidir. Yiyecek çok olup, artacak gibi ise ikişer yemekte beis yoktur. Lâkin mutlak surette edep yemek esnasında aç gözlülüğü bırakmaktır. Meğer ki, başka bir işe gitmek için acele ede.» Hattâbî de şunları söylüyor. «Bu ancak sahabe zamanında ve yiyecek darlığı çekildiği anlarda idi. Bugün vakit, hal genişlediğinden artık izne hacet yoktur.» Nevevî, Hattâbî'nin bu sözünü doğru bulmamış; verdiği tafsilât üzerinde israr etmiştir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 5336,
			"arabicnumber": "2046.01",
			"text": "(Bana Abdullah b. Abdirrahman Ed-Dârimî rivâyet etti. ki): Bize Yahya b. Hassan haber verdi. ki): Bize Süleyman b. Bilâl, Hişâm b. Urve'den, o da babasından, o da Âişe'den naklen rivâyet etti ki: Peygamber (sallallahü aleyhi ve sellem): kuru burma bulunan ev halkı aç kalmaz.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 5337,
			"arabicnumber": "2046.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 5338,
			"arabicnumber": "2047.01",
			"text": "(Bize Abdullah b. Mesleme b. Ka'neb rivâyet etti. ki): Bize Süleyman (yani İbn Bilâl) Abdullah b. Abdirrahman'dan, o da Âmir b. Sa'd b. Ebî Vakkas'dan, o da babasından naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem): kim sabahladığı vakit Medine'nin iki taşlığı arasında yedi hurma ferse, akşamlayıncaya kadar ona zehir zarer vermez.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 5339,
			"arabicnumber": "2047.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti, ki): Bize Ebû Üsârne Hâşim b. Hâşim'den rivâyet etti. ki): Âmir b. Sa'd b. Ebî Vakkâs'ı dinledim, şöyle diyordu. Ben Sa'd'î şunu söylerken işittim: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i; kim aeva olarak yedi hurma ile sabah kahvaltısı yaparsa, o kimseye o gün ne zehir zarar verir, ne sihir!» buyururken İşittim",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 5340,
			"arabicnumber": "2047.03",
			"text": "(Bize bu hadîsi İbn Ebî Ömer de rivâyet etti. ki): Bize IMervan b. Muâviyete’l-Fezârî rivâyet etti. H. hadîsi bize İshâk b. İbrahim de rivâyet etti. ki): Bize Ebû Bedr Şûca' b. Velîd haber verdi. Her iki râvi Hâşim b. Hâşim'den bu isnadla Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini rivâyet etmişlerdir. Ama ikisi de: «Peygamber (sallallahü aleyhi ve sellem)’den işittim» dememişlerdir. dememişlerdir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 5341,
			"arabicnumber": "2048",
			"text": "Bize Yahya b. Yahya İle Yahya b. Eyyûb ve İbn Hucr rivâyet ettiler. (Yahya b. Yahya: Bize haber verdi tâbirini kullandı, ötekiler: Bize İsmail —Bu zat İbnİ Ca'fer'dir— rivâyet etti, dediler.) O da şerik'den —Bu zat İbn Ebî Nemr'dir—, o da Abdullah b. Ebî Atik'den, o da Âişe'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) acvasında şifa vardır. Yahut o, sabahın ilk zamanında tiryaktır.» buyurmuşlar. hadîsi Buhârî «Et'ime» ve «Tıbb» bahislerinde tahrîc etmiştir. Hurmanın güzel bir nev'idir. Yayla diye tercüme ettiğimiz Âlîye: Medine'nin Necid tarafına düşen tarlaları ve köyleridir. Tihâme tarafına düşenlere Safire denilir. Kâdî Iyâz Aliyenin Medîne'ye en yakın yerinin üç mil, en uzak yerinin ise sekiz mil olduğunu söyler. Panzehir mânâsına gelir. Fârisî bir kelimedir. bu hadîsin üzerinde dört vecihle söz etmiştir. Şöyle ki",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 5342,
			"arabicnumber": "2049.01",
			"text": "(Bize Kuteybe b. Saîd rivâyet eîti. ki): Bize Cerîr rivâyet etti. H. İshâk b. İbrahim da rivâyet etti, ki): Bize Cerîr i'e Amr b. Ubeyd, Abdül-Melik b. Unıeyr'den, o da Amr b. Hureys'den, o da Saîd b. Zeyd b. Amr b. Nüfeyl'den naklen haber verdi. (Şöyle dedi): Ben Peygamber (sallallahü aleyhi ve sellem)'i: mendendir. Onun suyu göze şifadır: buyururken işittim",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 5343,
			"arabicnumber": "2049.02",
			"text": "(Bize Muhammed b. Müsennâ da rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be, Abdül-Melik b. Umeyr'den rivâyet etti. ki): Ben Amr b. Hureys'den dinledim. ki): Ben Saîd b. Zeyd'den dinledim. (Şöyle dedi): Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: mendendir. Soyu âa göze şifadır.::- buyururken işittim",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 5344,
			"arabicnumber": "2049.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 5345,
			"arabicnumber": "2049.04",
			"text": "(Bize Saîd b. Amr El-Eş'asî rivâyet etti. ki): Bize Abser, Mutarrif den, o da Hakem'den, o da Hasen'den, o da Amr b. Hüreyre'den, o da Saîd b. Zeyd b. Amr b. Nüfeyl'den naklen haber verdi. dedi): Resûlüllah (sallallahü aleyhi ve sellem): Allah Tebâreke ve Teâlâ'nin Benî İsrail'e indirdiği mendendir. Onun suyu da göze şifadır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 5346,
			"arabicnumber": "2049.05",
			"text": "(Bize İshâk b. İbrahim de rivâyet etti. ki): Bize Cerîr, Mutarrif den, o da Hakem b. Uteyhe'den, o da Hasen-i Urenî'den, o da Amr b. Hureys'den, o da Saîd b. Zeyd'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen haber verdi: Allah'ın Mûsa'ya İndirdiği mendendir. Onun suyu da göze şifadır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 5347,
			"arabicnumber": "2049.06",
			"text": "(Bize İbn Ebî Ömer rivâyet etti. ki): Bize Süfyân, Abdül-Melik b. Umeyr'den rivâyet etti. ki): Ben Amr b. Hureys'i şunu söylerken işittim. ki): Ben Saîd b. Zeyd'i şöyle derken dinledim. Resûlüllah (sallallahü aleyhi ve sellem): Allah (azze ve celle)'nin Benî İsrail'e indirdiği mendendir. Onun suyu da göze şifadır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 5348,
			"arabicnumber": "2049.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 5349,
			"arabicnumber": "2050",
			"text": "(Bana Ebû't-Tahir rivâyet etti. ki): Bize Abdul-3ah b. Vehb, Yûnus'dan, o da İbn Şihab'dan, o da Ebû Seleme b. Abdirrahman'dan, o da Câbir b. Abdillah'dan naklen haber verdi. Câbir Şöyle dedi; Peygamber (sallallahü aleyhi ve sellem)'le birlikte Merru'z-Zahran'da idik, Irak yemişi topluyorduk. Peygamber (sallallahü aleyhi ve sellem) siyahını toplamağa bakini» buyurdular. Bunun üzerine biz: Ya Resûlallah! Galiba sen koyun gütmüşsün, dedik. onu gütmedik Hİç bir peygamber var mı?» buyurdu yahut bunun gibi bir söz söyledi. hadîsi Buhârî «Kitâbu’l-Enbiya» ve «Kitâbu'l-Et'ime»'de; Nezâî «Velime» bahsinde tahrîc etmişlerdir. Erak denilen misvak ağacının olgun yemişidir. Bazıları bunun incire benzer bir yemiş olduğunu, insanlarla develerin ve koyunların onu yediklerini ve hararet verdiğini söylemişlerdir. Bir rivâyete göre iki avucu dolduracak kadar salkımı olurmuş. Kiramın: «Ya Resûlüllah! Galiba sen koyun gütmüşsün.» diye sormaları, yemişin siyahını tavsiye ettiği içindir. Erak yemişinin nevilerini iyi bilenler ekseriyetle çobanlar olurdu. Resûlüllah (sallallahü aleyhi ve sellem)’in vaktiyle koyun gütmesindekî hikmeti Hattâbî şöyle izah etmiştir: «Allahü teâla Peygamberliği dünyaya dalanlara ve refah sahiplerine vermemiş; koyun güdenlere tevazu ve sanat sahiplerine ihsan etmiştir. Nitekim Hazret-i Eyyûb'un terzi, Zekeriyya (aleyhisselâm)'ın doğramacı olduğu rivâyet edilir.» Nevevîde: «Bundaki hikmet tevazu benimsemeleri, kalblerin halvetle sâfileşmesi, bu suretle ümmetlerini idareye intikalleridir» diyor",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 5350,
			"arabicnumber": "2051.01",
			"text": "(Bana Abdullah b. Abdirrahman Ed-Dârimî rivâyet etti. ki): Bize Yahya b. Hassan haber verdi. ki): Bize Süleyman b. Bilâl, Hİşam b. Urve'den, o da babasından, o da Âişe'den naklen haber verdi ki: Peygamber (sallallahü aleyhi ve sellem): ne güzel katıklardır. Yahut katıktır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 5351,
			"arabicnumber": "2051.02",
			"text": "(Bize bu hadîsi Mûsa b. Kureyş b. Nâfi' Et-Temîmi de rivâyet etti. ki) ; Bize Yahya b. Salih El-Vuhazî rivâyet etti. ki): Bize Süleyman b. Bilâl bu isnadla rivâyette bulundu ve: güzel katıklardır.» dedi; şekketmedi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 5352,
			"arabicnumber": "2052.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Ebû Avâne, Ebû Bişr'den, o da Ebû Süfyân'dan, o da Câbir b. Abdillah'dan naklen haber verdi ki: Peygamber (sallallahü aleyhi ve sellem) ailesi efradına katık sordu. Onlar da: Bizde sirkeden başka bir şey yok, dediler. Onu istedi ve onunla yemeye başladı. Hem: ne güzel katıklardır; sirke ne güzel katıklardır!» diyordu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 5353,
			"arabicnumber": "2052.02",
			"text": "(Bana Ya'kub b. İbrahim Ed-Devrakî rivâyet etti. ki): Bize İsmail (yani İbn Uleyye), Müsennâ b. Said'den rivâyet etti. ki): Bana Talha b. Nâfi' rivâyet etti ki, kendisi Câbir b. Abdillah'ı şunu söylerken işitmiş: (sallallahü aleyhi ve sellem) bir gün benim elimden tutarak evine götürdü. (Hizmetçi) ona ekmek parçaları çıkardı. Peygamber (sallallahü aleyhi ve sellem): namına bir şey yok mu?» diye sordu. (Evdekiler): Hayır! Yalnız biraz sirke var, dediler. sirke ne güzel katıklardır.:» buyurdu. ki: Bunu Peygamber (sallallahü aleyhi ve sellem)’den işiteli beri sirkeyi severim. Talha dahi: «Ben bunu Câbir'den işiteli beri sirkeyi severim.» demiş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 5354,
			"arabicnumber": "2052.03",
			"text": "(Bize Nasr b. Alî El-Cahdemî rivâyet etti. ki): Bana babam rivâyet etti. ki): Bize Müsennâ b. Saîd, Talha b. Nâfi'den rivâyet etti. ki): Bize Câbir b. Abdillah rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem) onun elinden tutarak evine götürmüş: İbn Uleyye'nin hadîsi gibi: halde sirke ne güzel katıklardır...» cümlesine kadar rivâyette bulunmuş; ondan sonrası almamıştır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 5355,
			"arabicnumber": "2052.04",
			"text": "(Bize Ebû Bekr b. Eki Şeybe de rivâyet etti. ki): Bize Yezid b. Harun rivâyet etti. ki): Bize Haccâc b. Ebî Zeyneb haber verdi. ki): Bana Ebû Süfyân Taîha b. Nâfi' rivâyet etti. ki): Câbir b. Abdillah'i dinledim, şunu söyledi: oturuyordum, bana Resûlüllah (sallallahü aleyhi ve sellem) uğrayarak işaret etti. Hemen kendisine ayağa kalktım. Elimden tuttu ve yürüdük. Nihayet kadınlarının evlerinden bîrine gelerek içeri girdi. Sonra bana izin verdi. Ben de perdeye kadının yanına girdim. Derken Resûlüllah (sallallahü aleyhi ve sellem): bir şey var mı?» diye sordu. (Evdekiler): Hayır! cevâbını verdiler. Ve kendisine üç parça ekmek getirdiler. Bunları bir sofranın üzerine koydular. Müteakiben Resûlüllah (sallallahü aleyhi ve sellem) bir parça alarak onu kendi önüne koydu. Başka bir parça daha alarak onu da benim önüme koydu. Sonra üçüncüyü alarak onu ikiye kırdı ve yarısını kendi Önüne, yarısını da benim Önüme koydu. Sonra: namına bir şey var mı?» diye sordu. Hayır! Yalnız biraz sirke var, dediler. «Getirin onu! Ne güzel katıklardır o!» buyurdular. îyâz ile Hattâbî’ye göre bu hadisin muhtelif rivâyetlerinden çıkan mânâ yemeklerde az bir şey ile kanaat edip, nefsi çeşitli yemek istinasından men etmektir. Burada'âdeta katık namına sirke ve o mânâda ucuz ve kolay bulunan şeyler yiyin, iştihah yemek çeşitlerine rağbet etmeyin. Çünkü bunlar, hem dini bozar, hem bedeni hasta eder, denilmiş gibidir. Fakat Nevevî bu mütalâayı beğenmemiş: «Cezmen kabulü gereken doğru söz şudur ki, hadîs-i şerif bizzat sirkeyi methetmektedir. Az yemek, iştiha verici şeyleri terk etmek başka kaidelerden anlaşılır» demiştir. Hurma yaprağından örülen sofra manasınadır. Kâdî Iyâz birçok râvilerden bu kelimeyi «Betti» şeklinde rivâyet etmiştir. Betti, yün veya yapağıdan dokunan kilimdir. Bazıları bunu «Bünnî» diye rivâyet etmişlerdir. Kadı Kinâni: «Doğrusu budur,» demiştir. Bûnnı, yine hurma dalından yapılan tabaktır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 5356,
			"arabicnumber": "2053.01",
			"text": "Bize Muhammed b. Müsennâ ile İbn Beşşâr rivâyet ettiler. Lâfız İbnİ Müsennâ'nındir. (Dediler ki): Bize Muhammed b. Ca'-fer rivâyet etti. ki): Bize Şu'be Simak b. Harb'den, o da Câbir b. Semûra’dan, o da Ebû Eyyûb El-Ensârî'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem)'e bir yiyecek getirildiği vakit ondan yer; fazlasını da bana gönderirdi. Bir gün bana bir fazla göndermişti ki, ondan yememişti. Çünkü içerisinde sarmisak vardı. Kendilerine: Bu haram mıdır? diye sordum. Lâkin ben kokusundan dolayı ondan hoşlanmıyorum.» buyurdular. Eyyûb: senin hoşlanmadığından ben de hoşlanmıyorum, demiş",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 5357,
			"arabicnumber": "2053.02",
			"text": "(Bize Muhammed b. Müsennâ rivâyet etti. ki): Bize Yahya b. Saîd, Şu'be'den bu isnadla rivâyet etti",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 5358,
			"arabicnumber": "2053.03",
			"text": "Bana Haccâc b. Şâir ile Ahmed b. Saîd b. Sahr dahi rivâyet etti. Lâfızları birbirine yakındır. (Dediler ki): Bize Ebû'n-Nu'man rivâyet etti. ki): Bize Sabit rivâyet etti. (Haccâc b. Yezid'in rivâyetinde: Ebû Zeyd El-Ahvel'dir). ki): Bize Asım b. Abdillah b. Haris, Ebû Eyyûb'un azatlısı Eflah'dan, o da Ebû Eyyûb'dan naklen rivâyet etti ki: Peygamber (sallallahü aleyhi ve sellem) ona misafir olmuş ve Peygamber (sallallahü aleyhi ve sellem) alt kata Ebû Eyyûb da üst kata yerleşmişler. Derken Ebû Eyyûb bir gece intibaha gelmiş ve: Biz Resûlüllah (sallallahü aleyhi ve sellem)’in başının üzerinde yürüyoruz, demiş. Bunun üzerine çekilerek bir kenarda gecelemişler. Sonra Peygamber (sallallahü aleyhi ve sellem)’e söylemiş. Peygamber (sallallahü aleyhi ve sellem)'. kat daha yarayışlı.» buyurmuş.» Ebû Eyyûb: Sen altında bulundukça ben bir çatının üstüne çıkamam, demiş. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) Üst kata, Ebû Eyyûb da alt kata değişmişler. Ebû Eyyûb Peygamber (sallallahü aleyhi ve sellem)'e yemek yaparmış. Sofra (dönüp) getirildiği vakit onun parmaklarının yerini sorar, parmaklarının yerini araştırırmış. Bir gün ona sarımsaklı bir yemek yapmış. Sofra geri getirildiği vakit Peygamber (sallallahü aleyhi ve sellem)'in parmak yerlerini sormuş. Kendisine: O yemedi, demişler. Bundan ürkmüş ve hemen yanına çıkarak: Sarmısak haram mıdır? diye sormuş. Peygamber (sallallahü aleyhi ve sellem): Lâkin ben ondan hoşlanmıyorum.» buyurmuş. Ebû Eyyûb: Öyle ise senin hoşlanmadığından yahut senin kerih gördüğünden ben de hoşlanmam, demiş. Eyyûb: «Peygamber (sallallahü aleyhi ve sellem)'e gelinirdi.» demiş. (sallallahü aleyhi ve sellem)'e gelinirdi.» cümlesinden murad, ona melekler ve vahiy gelirdi, demektir. Nitekim bir hadîste: sizin görüşmediklerinizle görüşüyorum. Melekler insanların rahatsız olduğu şeyden rahatsız olur.» buyurulmustur. Resûlüllah (sallallahü aleyhi ve sellem) hiç bir zaman sarmısak yemezdi. Çünkü her an meleklerin ve vahyin gelmesi mümkündü. Şâfiîler'den diyor ki: «Ulemâmız Peygamber (sallallahü aleyhi ve sellem) hakkında sarmı-sağın ve keza soğan, pırasa gibi şeylerin hükmünün ne olacağında ihtilâf etmişlerdir. Bazıları haram olduğunu söylemişse de, esah olan kavle göre haram değil, kerâhet-i tenzihiyye ile mekruhtur. Çünkü «Sarmısak haram mıdır?» suâline umumî olarak «Hayır!» cevâbını vermiştir. Sarmışağın ona haram olduğunu söyleyenlere göre bu cevabın mânâsı: Sizin hakkınızda haram değildir, demektir. (sallallahü aleyhi ve sellem)’in misafirliği esnasında evvelâ alt kata yerleşmesi, kendisine ve ziyaretçilerine daha uygun geldiği içindir. Hazret-i Ebû Eyyûb'un buna razı olmaması ise büyük terbiye ve nezaketindendir. hoşlanmadığından hoşlanmaması da bunu gösterir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 5359,
			"arabicnumber": "2054.01",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Ce-rir b. Abdul Hamid, FudayI b. Gazvan'dan, o da Ebû Hazım El-Eşcaî'den, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle, demiş): adam Resûlüllah (sallallahü aleyhi ve sellem)’e gelerek: Ben muhtacım! dedi. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) kadınlarından birine haber gönderdi. O da: Seni hak dinle gönderen Allah'a yemin olsun ki, evimde sudan başka bir şey yok, dedi. Sonra başka bir hanımına hater gönderdi, bu da bunun gibi söyledi. Hattâ bütün hanımları böyle söylediler. Hayır! Seni hak dinle gönderen Allah'a yemin olsun ki, evimde sudan başka bir şey yok, dediler. Bunun üzerine: zâtı bu gece kim misafir edecek? Allah ona rahmet eylesin!» buyurdu. Hemen ensardan bir zât ayağa kalkarak: Ben ya Resûlallah! dedi. Ve onu evine götürdü. Karısına evinde bir şey var mı diye sordu. Kadın: Hayır! Yalnız çocuklarımın yiyeceği var, cevâbını verdi. Sen onları bir şeyle oyala! Misafirimiz girdiği vakit kandili söndür ve ona biz de yermişiz gibi göster. O yemeğe eğildi mi sen hemen kandile kalk ve onu söndür, dedi. Böylece oturdular ve misafir yemeğini yedi. Sabahlayınca Peyganiler (sallallahü aleyhi ve sellem)'e vardı. O da (kendisine): akşam (karı koca) her ikinizin misafirinize yaptığınıza Allah te-accûb buyurdu.» dedi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 5360,
			"arabicnumber": "2054.02",
			"text": "(Bize Ebû Küreyb Muhammed b. Alâ' rivâyet etti. ki) ; Bize Veki', FudayI b. Gazvan'dan, o da Ebû Hazim'den, o da Ebû Hüreyre'den naklen rivâyet etti ki, ensardan bir adama bir gece misafir gelmiş. Evinde kendi yiyeceği ile çocuklarının yiyeceğinden başka bir şey yokmuş. Karısına: Sen çocukları uyut; kandili söndür ve ne yemeği varsa misafire takdim etî demîş. diyor ki, arkacığından şu âyet indi: başkalarını kendi nefislerine tercih ederler, velev ki kendileri muhtaç olsunlar.\" Sûre-i Haşr, Âyet: 9",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 5361,
			"arabicnumber": "2054.03",
			"text": "(Bize bu hadîsi Ebû Küreyb de rivâyet etti. ki): Bize İbn Fudayl, babasından, o da Ebû Hazim'den, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle dedi) ; Bir adam misafir olmak için Resûlüllah (sallallahü aleyhi ve sellem)'e geldi. Fakat evinde onu misafir edecek bir şey yoktu. Bunun üzerine: zâtı misafir edecek kimse yok mu? Allah ona rahmef eylesin!» dedi. Hemen ensardan Ebû Talha denilen bir zât kalkarak onu evine götürdü... hadîsi Cerir'in hadîsi gibi nakletmiş; bu hadîste Vekî'in zikrettiği gibi âyetin inişini de anmıştir. hadîsi Buhârî «Menâkıb» ve «Tefsir» bahislerinde; Tirmizî ile Nesâî de «Tefsîr» bahsinde muhtelif râvilerden tahrîc etmişlerdir. evine götüren ensârînin kim olduğu ihtilaflıdır. Bir rivâyete göre Ebû Talha Zeyd b. Sehl'dir. Kâdî İsmail «Ahkamu'l-Kur'ân» ismindeki eserinde bu zatm Sabit b. Kays olduğunu söylemiş. Bazıları Abdullah b. Revaha , bir takımları da hadîsin râvisi Ebû Hüreyre olduğunu söylemişlerdir. sahibinin karısına: «Sen onları bir şeyle oyala!» demesi; çocukların aç olmayıp, çocuk âdeti veçhile bir şey istediklerine hamledilmiş-tir. Zira yememek kendilerine zarar verecek kadar aç olsalar, müsâfir-den önce onları doyurmak vâcib olurdu. Bu karı kocayı Allah ve Resûlümethû sena etmişlerdir. Bu da gösterir ki, onlar bir vacibi terk etmemiş. Bilâkis güzel ve makbul bir iş yapmışlar, misafiri kendi nefislerine tercih etmişlerdir. Bu âyet-i kerîmeyi Allahü teâlâ onlar hakkında indirmiştir. şerifteki Allah'ın teaccûbundan murad yapılana razı olmasıdır. Bundan meleklerin teaccûbu kasdedilmiş de olabilir. Bu takdirde te-accûbü Allah'a izafe etmekten murad, meleklerin şerefini beyân içindir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 5362,
			"arabicnumber": "2055.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 5363,
			"arabicnumber": "2055.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 5364,
			"arabicnumber": "2056",
			"text": "Bize Ubeydullah b. Muâz El-Anberî İle Hamid b. Ömer El-Bekrâvî ve Muhammed b. Abdi’l-A'lâ toptan Mu'temir b. Süleyman'dan rivâyet ettiler. Lâfız İbn Muâz'ındir. (Dediler ki): Bize Mu'temir rivâyet etti. ki): Bize babam Ebû Osman'dan ve bir de Abdurrahman b. Ebî Bekr'den naklen rivâyet etti. Abdurrahman Şöyle dedi: Peygamber (sallallahü aleyhi ve sellem) ile birlikte yüz otuz kişi bulunuyorduk. Peygamber (sallallahü aleyhi ve sellem): hiç birinizin yanında yiyecek var mı?» diye sordu. Bir de baktık, bir adamın yanında bir ölçek zahire veya bunun gibi bir şey bulunuyormuş. Hemen hamur karıldı. Sonra saçları dağılmış uzun boylu müşrik bir adam bir sürü koyun sürerek (yanımıza) geldi. Peygamber (sallallahü aleyhi ve sellem) (ona): mı, hediyye mi? —Yahut hibe mi?—» diye sordu. Adam: Hayır! Bilâkis satılık, dedi. Ve ondan bir koyun satın aldı. Koyun hasıllandi. Ve Resûlüllah (sallallahü aleyhi ve sellem) ciğerinin kızartılmasını emir buyurdu. Allah'a yemin ederim yüz otuz kişiden hiç bir kimse yoktur ki, Resûlüllah (sallallahü aleyhi ve sellem) o koyunun ciğerinden bir parça vermemiş olsun. Mevcut ise kendisine verdi. Gaibse onun için sakladı. Abdurrahman: «Akide çanak doldurdu, bunlardan hepimiz yedik ve doyduk. Kaplarda yemek de arttı da, ben onu deveye yükledim.» demiştir. Yahut dediği gibidir. hadîsi Buhârî «Buyu'» ve «Hibe» bahislerinde tahrîc etmiştir. Peygamber (sallallahü aleyhi ve sellem)’in müşrik çobana: mır hedîyye mi? —Yahut— Satılık mı, hibe mi? dediğinde râvi şekketmiştir. Hadis-i şerîfde dört mucize vardır. Bunların birincisi kabı büyültmek, ikincisi ciğeri çoğaltmak, üçüncüsü çanakların genişlemesi, dördüncüsü herkes karnını doyurduktan sonra yemeğin artmasıdır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 5365,
			"arabicnumber": "2057.01",
			"text": "Bize Ubeydullah b. Muâz El-Anberî ile Hâmîd b. Ömer el-Bekrâvi ve Muhammed b. Abdi'l-A'lâ El-Kaysî hepsi Mu'temirden rivâyet ettiler. Lâfız İbn Muâz'ındır. (Dediler ki): Mu'temir b. Süleyman rivâyet etti. ki): Bana babam şunu söyledi. Bize Ebû Osman rivâyet etti. Ona da Abdurrahman b. Ebî Bekr rivâyet etmiş ki: Eshab-i Suffe. fakir insanlarmış. Resûlüllah (sallallahü aleyhi ve sellem) bir defa: iki kişilik yemek varsa, üç kişi götürsün! Kİmde dört kişilik yemek varsa beşinciyi, altıncıyı götürsün.» buyurmuşlar. Yahut buyurduğu gibidir. Gerçekten Ebû Bekr üç kişi getirmiş. Nebiyyullah (sallallahü aleyhi ve sellem) on kişi (yine) Ebû Bekr üç kişi götürmüş. Râvi Şöyle dedi: Şan şu ki: Annem, babam ve ben — bilmiyorum karım da dedi mi — bizim evimizle Ebû Bekr'in evinin arasında bir hizmetçi vardı. Ebû Bekr Peygamber (sallallahü aleyhi ve sellem)'in yanında akşam yemeği yedi. Sonra yatsı kılmıncaya kadar durdu. Sonra döndü ve Resûlüllah (sallallahü aleyhi ve sellem) uyuklayıncaya kadar yanında durdu. Gecenin Allah'ın dilediği kadarı geçtikten sonra geldi. Hanımı ona: Misafirlerinin yanına gelmekten yahut misafirinin yanına gelmekten seni alıkoyan nedir? dedi. Ebû Bekr: Sen onlara akşam yemeği vermedin mi? diye sordu. Kadın: Sen gelinceye kadar yemek istemediler. Onlara yemek (evdekiler) arzettiler. Fakat onlar galebe çaldı, dedi. Abdurrahman ki: Ben giderek gizlendim. Ebû Bekr: Ey alçak! dedi. Beddua ve sitem etti. Ve: Yeyin, afiyet olmasın! dedi. Bir de: Vallahi ben bu yemekten ebediyyen tatmam! dedi. Abdurrahman diyor ki: Biz bu yemekten hiç bir lokma almıyorduk ki, altından o lokmadan daha fazla artmasın. Nihayet doyduk ve yemek öncekinden daha fazla oldu. Ebû Bekr ona baktı, ne görsün, olduğu gibice yahut daha Çok!.. Hanımına: Ey Benî Firâs'ın kız kardeşi! Bu ne? dedi. Hanım: Hayır iki gözüm! Şimdi o öncekinden üç kere daha çoktur, dedi. Bunun üzerine Ebû Bekr ondan yedi. Ve yeminini kasdederek: Bu ancak şeytandandı, dedi. Sonra yemekten bir lokma yedi. Ve yemeği Resûlüllah (sallallahü aleyhi ve sellem)'e götürdü. Yemek onun yanında sabahladı. Bizimle bir kavm arasında akid vardı. Müddet geçti. Biz de on iki adamı reis yaptık. Her adamla birlikte onlardan bir takım insanlar bulunuyordu. Her adamla kaçar kişi bulunduğunu Allah bilir. Şu kadar var ki, onlarla beraber gönderdi ve yemekten toptan yediler. Yahut dediği gibidir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 5366,
			"arabicnumber": "2057.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 5367,
			"arabicnumber": "2058",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlik'e, Ebû'z-Zinad'an, âiiûeâ'ığim, onun da A'rac'dan, onun da Ebû Hüreyre'den naklen rivâyet ettiği şu hadîsi okudum. ki): Resûlüllah (sallallahü aleyhi ve sellem): kişinin yemeği üçe yeter. Uç kişinin yemeği de dörde yeter.» buyurdular",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 5368,
			"arabicnumber": "2059.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 5369,
			"arabicnumber": "2059.02",
			"text": "(Bize İbn Nümeyr rivâyet etti. ki):. Bize babam rivâyet etti. ki): Bize Süfyân rivâyet etti. H. Muhammed b. Müsennâ da rivâyet etti. ki): Bize Abdurrahman, Süfyân'dan, o da Ebû'z-Zübeyr'den, o da Câbir'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen İbn Cüreyc'in hadîsi gibi rivâyette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 5370,
			"arabicnumber": "2059.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 5371,
			"arabicnumber": "2059.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 5372,
			"arabicnumber": "2060.01",
			"text": "(Bana Muhammed b. Müsenna rivâyet etti. ki): Bize Abdurrahman, Süfyan'dan, o da Ebû'z-Zübeyr'den, o da Câbir ile İbn Ömer'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem): bir bağırsağa yer; kâfirse yedi bağırsağa yer.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 5373,
			"arabicnumber": "2060.02",
			"text": "(Bize Muhammed b. Abdillah b. Nümeyr de rivâyet etti. ki): Bize babam rivâyet etti. H. Ebû Bekr b. Ebî Şeybe dahi rivâyet etti. ki): Bize Ebû Üsâme ile İbn Nümeyr rivâyet ettiler. (Dediler ki): Bize Ubeydullahrivâyet ettilet. H. Muhammed b. Râfi' ile Abd b. Humeyd de Abdürrezzâk'dan rivâyet ettiler. ki): Bize Ma'mer, Eyyûb'dan naklen haber verdi, her iki râvi Nâfi'den, o da İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)'den bu hadîsin mislini rivâyet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 5374,
			"arabicnumber": "2060.03",
			"text": "(Bize Ebû Bekr b. Hallâd El-Bahilî de rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be Vâkid b. Muhammed b. Zeyd'den rivâyet etti. O da Nâfi'i şöyle derken işitmiş: İbn Ömer bir fakir gördü de önüne tekrar tekrar yiyecek koymaya başlads. O da çok yemeye başladı. Bunun üzerine: Bu benim yanıma girmemelidir. Çünkü ben Resûlüllah (sallallahü aleyhi ve sellem)'i: yedi bağırsak içine yemeli yer.» buyururken İşittim, dedi",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 5375,
			"arabicnumber": "2061.01",
			"text": "Bize Züheyr b. Harb ile Muhammed b. Müsennâ ve Ubeydullah b. Saîd rivâyet ettiler. (Dediler ki): Bize Yahya (Bu zât Kattan'dır), Ubeydullah'dan naklen haber verdi. ki): Bana Nâfi' İbnü Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen haber verdi: yedi bağırsak içine, mü'min ise bir bağırsağa yer.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 5376,
			"arabicnumber": "2061.02",
			"text": "(Btze İbn Nümeyr de rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Süfyan, Ebû'z-Zübeyr'den, o da Câbir'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini rivâyet etti. Ama İbn Ömer'i anmadı",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 5377,
			"arabicnumber": "2062.01",
			"text": "(Bize Ebû Küreyb Muhammed b. Alâ' rivâyet etti. ki): Bize Ebû Üsâme rivâyet etti. ki): Bize Büreyd dedesinden, o da Ebû Mûsa'dan, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti: bir bağırsak içine yer; kâfirse yedi bağırsak içine yer.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 5378,
			"arabicnumber": "2062.02",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Abdiilazîz (yani İbn Muhammed), Alâ'dan, o da babasından, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen yukarkilerin hadîsi gibi rivâyette bulundu",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 5379,
			"arabicnumber": "2063",
			"text": "(Bana Muhammed b. Râfi' rivâyet etti. ki): Bize İshâk b. îsa rivâyet etti. ki): Bize Mâlik, Süheyl b. Ebî Sâlih'den, o da babasından, o da Ebû Hüreyre'den naklen haber verdi ki, Resûlüllah (sallallahü aleyhi ve sellem) kendisine kâfir bir misafir göndermiş. Ve Resûlüllah (sallallahü aleyhi ve sellem) ona bir koyun sağılmasını emir buyurmuş. Koyun sağılmış, kâfir süt kabını (tamamca) içmiş. Sonra başka bir kab getirilmiş onu da içmiş, sonra başkası getirilmiş onu da içmiş. Ta ki yedi koyunun sütünü içmiş. Sonra sabahladığında müslüman olmuş. Resûlüllah (sallallahü aleyhi ve sellem) onun için (yine) bir koyun sağılmasını emir buyurmuş, fakat onun sütünü tamamıyle içememiş. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) ı bir bağırsağa İçer; kâfir ise yedi bağırsağa içer.» buyurmuşlar. hadisleri Buhârî «Et'ıme» bahsinde; Ebû Hüreyre rivâyetini Nesâî «Velîme»'de; İbn Mâce «Kitâbu'l-Et'ıme»'-de tahrîc etmişlerdir. bu hadîslerden murad ne olduğunda ihtilâf etmişlerdir. Bâzılarına göre maksad darb-î meseldir. Bu darb-ı mesel'de mü'minin dünyaya gönül vermediği, kâfirin ise ona sımsıkı sarıldığı belirtilmektedir. Bazıları: «Burada maksad mü'minin yemeğe besmele ile başlamasıdır. Bundan dolayı şeytan ona ortak olamaz. Kâfir de besmele olmadığı için şeytan onun yemeğine iştirak eder. Bu sebeple çok yer» demişlerdir. Bir takım ulemâ tabiblerin mide ile beraber insanda yedi bağırsak olduğunu söylediklerini; işte aç gözlü kâfir besmele de çekmediği için bunların yedisini de doldurmadan doymadığını; mü'min muktesid olduğu ve besmele çektiği için, ona bir bağırsak dolusu yemeğin kâfi geldiğini söylemişlerdir. umumî değil de bazı mü'rninlerle bazı kâfirler hakkında vârid olması da mümkündür. Bu hususta daha başka sözler de söylenmiştir. rivâyetlerden maksat dünya varlığının azı ile kanâat etmeye teşvik az yemenin güzel ahlâktan ma'dud olduğunu, çok yemenin ise bunun zıddına delâlet ettiğini göstermektir. İbn Ömer Hazretlerinin çok süt İçen misafiri için: «Bu benim yanıma girmemelidir» demesi misafir küffara benzediği içindir. Böylesi ile bir zaruret ve hacet yokken düşüp kalkmak kerih görülmüştür. Bir de böyle bir kişinin içeceği sütle bir cemâatin ihtiyacını görmek mümkündür. Yedî koyunun sütünü içen ve ertesi sabah müslüman olan bu zâtın Sümâme b. Üsa1 olduğu rivâyet edilmiştir. Maamafih Nabra b. Ebi Nadra. Ebû Gazvan ve daha başka isimde biri olduğunu söyleyenler de vardır",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 5380,
			"arabicnumber": "2064.01",
			"text": "Bize Yahya b. Yahya ile Züheyr b. Harb ve İshâk b. İbrahim rivâyet ettiler. (Züheyr Haddesenâ tâbirini kullandı. Ötekiler: Bize Cerir haber verdi, dediler.) Cerir A'meş'den, o da Ebû Hâzim'dan, o da Ebû Hüreyre'den naklen haber vermiş. Ebû Hüreyre şunları söylemiş: (sallallahü aleyhi ve sellem) hiç bir yemeği hor görmemiştir, Bir şeyi arzu ederse yer; istemezse bırakırdı",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 5381,
			"arabicnumber": "2064.02",
			"text": "(Bize Ahmed b. Yûnus da rivâyet etti. ki): Bize Züheyr rivâyet etti. ki): Bize Süleyman El-A'meş bu isnadla bu hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 5382,
			"arabicnumber": "2064.03",
			"text": "(Bize Abd b. Humeyd dahi rivâyet etti. ki): Bize Abdürrezzâk ile Abdulmelik b. Amr ve Ömer b. Sa'd Ebû Dâvud El-Haferî hepsi Süfyan'dan, o da A'meş'den naklen bu isnadla bu badısın benzerini haber verdiler",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 5383,
			"arabicnumber": "2064.04",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb, Muhammed b. Müsennâ ve Amru'n-Nâkıd rivâyet ettiler. Lâfız Ebû Küreyb'indir. ki): Bize Ebû Muâviye haber verdi. ki): Bize A'meş Ca'de oğullarının azatlısı Ebû Yahya'dan, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem)'in asla bir yemeği burun-ladığını görmedim. Canı isterse onu yer, istemezse susardı",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 257
			}
		}
	]
}