{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"38": "The Book of Manners and Etiquette"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5586,
			"arabicnumber": "2131",
			"text": "Bana Ebû Kureyb Muhammed b. Ala' ile İbni Ebi Ömer rivayet ettiler, (Ebû Kureyb ahberanâ; İbni Ebî Ömer haddesenâ tâbirlerini kullandılar.) Lâfız İbni Ebi Ömer'indir. (Dedilerki): Bize Mervan (yâni El-Fezârî) Humeyd'den, o da Enes'den naklen rivayet etti. (Şöyle demiş): Bir adam Bakî'de birine: — Yâ Ebe'l-Kâasım! diye seslendi. Nebi (Sallallahu Aleyhi ve Sellem) de ona bakarak: — Yâ Resûlallah! dedi. Adam: — Ben seni kastetmedim. Filânı çağırdım, dedi. Bunun üzerine Re-sûlullah (Sallallahu Aleyhi ve Sellem); «Benim ismimi takının ama künyemi takınmayın!» buyurdular. İzah 2135 te",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5587,
			"arabicnumber": "2132",
			"text": "Bana İbrahim b. Ziyad rivayet etti. (Bu zâtın lâkabı Sebelan'dır.) (Dediki): Bize Abbâs b. Abbâd, Ubeydullah b. Ömer ile kardeşi Abdullah'dan naklen haber verdi. Bu hadîsi onlardan 144 senesinde dinlemiş, onu Nâfi'den, o da İbni Ömer'den naklen rivayet etmişler. İbni Ömer (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem): «Şüphesiz ki, sizin Allah'a en sevimli gelen isimleriniz Abdullah ve Abdurrahmandır.» buyurdular. İzah 2135 te",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5588,
			"arabicnumber": "2133.01",
			"text": "Bize Osman b. Ebî Şeybe ile İshâk b. İbrahim rivayet ettiler. (Osman: haddesena; İshâk: ahberanâ tâbirlerini kullandılar. Dedilerki): Bize Cerîr Mansur'dan, o da Salim br Ebi'l-Ca'd'dan, o da Câbir b. Abdillah'dan naklen haber verdi. Câbir şöyle demiş: Bizden bîr adamın oğlu dünyaya geldi de adını Muhammed koydu. Bunun üzerine kavmi ona : — Sana Resûlullah (Sallallahu Aleyhi ve Sellem)'in ismini koymaya müsaade etmeyiz, dediler. O da çocuğunu sırtına yüklenerek yola çıktı ve onu Nebi (Sallallahu Aleyhi ve Sellem)'e getirerek şöyle dedi: — Yâ Resûlallah! Bir oğlum dünyaya geldi de adını Muhammed koydum. Ama kavmin bana: Resûiullah (Sallallahu Aleyhi ve Sellem)'in ismini koymana müsaade etmeyiz, dediler. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem); «Benim ismimi takının ama künyemi takınmayın. Ben ancak Kâasım'ım, sizin aranızda taksim yaparım.» buyurdular",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5589,
			"arabicnumber": "2133.02",
			"text": "Bize Hennad b. Seriy rivayet etti. (Dediki): Bize Abser Husayn'dan, o da Salim b. Ebî'l-Ca'd'dan, o da Câbir b. Abdillah'dan naklen rivayet etti. (Şöyle demiş): Bizden bir adamın oğlu dünyaya geldi de adını Mııhammed koydu: — Resûlullah (Sallallahu Aleyhi ve Sellem)'den emir almadıkça biz sana onun künyesini takamayız, dedik. O da giderek : — Gerçekten bir oğlum dünyaya geldi de ona Resûlullah'ın adını koydum. Ama kavmim: Nebi (Sallallahu Aleyhi ve Sellem)'den izin al da öyle diyerek onun künyesini koymama razı olmadılar. Bunun üzerine: «Benim ismimi takın! Ama künyemi takınmayın. Ben ancak Kâasım olarak gönderildim. Aranızda taksim yaparım.» buyurdular",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5590,
			"arabicnumber": "2133.03",
			"text": "{…} Bize Rifâa b. Heysem El-Vâsıfî rivayet etti. (Dediki): Bize Hâlid (yâni Tahhân) Husayn'dan bu isnadla rivayette bulundu. Ama: «Ben ancak Kâasım olarak gönderildim, aranızda taksim yaparım.» cümlesini anmadı",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5591,
			"arabicnumber": "2133.04",
			"text": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Vekî', A'meş'den rivayet etti. H. Bana Ebû Saîd El-Eşecc dahi rivayet etti. (Dediki): Bize Veki' rivayet etti. (Dediki): Bize A'meş Salim b. Ebî'l-Ca'd'dan, o da Câbir b. Abdillah'dan naklen rivayet etti. Câbîr şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Benim ismimi takının ama künyemi takınmayın! Çünkü ben Ebû'l-Kâasım'ım, aranızda taksim yaparım.» buyurdular. Ebû Bekr'in rivayetinde «tekennev» yerine «la tektenû» ibaresi vardır",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5592,
			"arabicnumber": "2133.05",
			"text": "{…} Bize Ebû Kureyb de rivayet etti. (Dediki): Bize Ebû Muâviye, A'meş'den bu isnadla rivayette bulundu ve : «Ben ancak taksimci kılındım. Aranızda taksim ederim.» dedi",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5593,
			"arabicnumber": "2133.06",
			"text": "Bize Muhammed b. Müsennâ ile Muhammed b. Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Katâde'yi Sâlim'den, o da Câbir b. Abdillah'dan naklen rivayet ederken dinledim. Ensardan bir adamın bir oğlu dünyaya gelmiş de adını Muhammed koymak istemiş ve Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek sormuş, o da: «Ensâr iyî etmişler... Benim ismimi koyun ama künyemi takınmayın!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5594,
			"arabicnumber": "2133.07",
			"text": "Bize Ebû Bekr b. Ebî Şeybe île Muhammed b. Müsennâ ikisi birden Muhammed b. Ca'fer'den, o da Mansûr'dan naklen rivayet ettiler. H. Bana Muhammed b. Amr b. Cebele rivayet etti. (Dediki): Bize Muhammed (yâni İbni Ca'fer) rivayet etti. H. Bize İbni Müsennâ dahî rivayet etti. (Dediki): Bize İbni Ebî Adiyy rivayet etti. Her iki râvi Şu'be'den, o da Husayn'dan naklen rivayet etmişlerdir. H. Bana Bişr b. Hâlid de rivayet etti. (Dediki): Bize Muhammed (yâni İbni Ca'fer) haber verdi. (Dediki): Bize Şu'be Süleyman'dan rivayet etti. Bu râvilerin hepsi Salim b. Ebî Ca'd'den, o da Câbir b. Abdillah'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etmişlerdir. H. Bize İshâk b. İbrahim EI-Hazalî ile, İshâk b. Mansûr da rivayet ettiler. (Dedilerki): Bize Nadr b. Şümeyl haber verdi. (Dediki): Bize Şu'be, Katâde ile Mansur, Süleyman ve Husayn b. Abdirrahman'dan rivayet etti. (Demişlerki) : Biz Salim b. Ebî Ca'd'ı, Câbir b. Abdillah'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen hadîslerini yukarda zikrettiğimiz zevat gibi rivayette bulunurken işittik. Nadr'ın Şu'be'den rivayet ettiği bir hadîste şöyle demiştir: Bu hadîste Husayn ile Süleyman ziyade ettiler. Husayn dediki: Resûlullah (Sallallahu Aleyhi ve Sellem): «Ben ancak taksimci olarak gösterildim. Aranızda taksim yapanım.» buyurdu. Süleyman ise: «Ben ancak taksimciyim, aranızda taksim yaparım» dedi",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5595,
			"arabicnumber": "2133.08",
			"text": "{…} Bize Amru'n-Nâkıd ile Muhammed b. Abdillah b. Numeyr ikisi birden Süfyan'dan rivayet ettiler. Amr dediki: Bize Süfyan b. Uyeyne rivayet etti. (Dediki): Bize İbııi Munkedir rivayet etti. Kendisi Câbir b. Abdillah'ı şöyle derken igitmiş: Bizden bir adamın oğlu dünyaya geldi de adını Kâasım koydu. Biz: — Sana Ebû'I-Kâasım künyesini vermeyiz. Hem sana göz açtırmayız, dedik. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek bunu ona anlattı, o da : «Oğlunun ismini Abdurrahman koy!» buyurdular",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5596,
			"arabicnumber": "2133.09",
			"text": "{M-2} Bana Ümeyye b. Bistam da rivayet etti. (Dediki): Bize Yezid (yâni İbni Zürey') rivayet etti. H. Bana Alî b. Hucr dahi rivayet etti. (Dediki); Bize İsmail (yâni İbni Uleyye) rivayet etti. Her iki râvi Ravh b. Kâasım'den, o da Muhammed b. Münkedir'den, o da Câbir'den, İbni Uyeyne'nin hadîsi gibi rivayette bulunmuşlardır. Yalnız o «Sana göz açtırmayız» cümlesini anmamıştır. İzah 2135 te",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5597,
			"arabicnumber": "2134",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Amru'n-Nâkıd, Züheyr b. Harb ve İbni Numeyr rivayet ettiler. (Dedilerki): Bize Süfyân b. Uyeyne, Eyyûb'dan, o da Muhammed b. Sîrîn'den naklen rivayet etti. (Demişki): Ebû Hureyre'yi şunu söylerken dinledim. Ebû'l-Kâasım (Sallallahu Aieyhi ve Sellem) : «Benîm ismimi koyun ama künyemi takmayın!» buyurdular. Amr Ebû Hureyre'den, dedi, «semi'tû» demedi. İzah 2135 te",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5598,
			"arabicnumber": "2135",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Muhammed b. AbdiIlah b. Numeyr, Ebû Said El-Eşecc ve Muhammed b. Müsennâ El-Anezî rivayet ettiler. Lâfız İbni Numeyr'indir. (Dedilerki): Bize İbni İdris babasından, o da Simâk b. Harb'den, o da Alkame b. Vâil'den, o da Muğîre b. Şu'be'den naklen rivayet etti. (Şöyle demiş): Necrâna geldiğim vakit bana sordular, dediler ki: — Sîz Ebû Harun'un kız kardeşi diye okuyorsunuz. Halbuki Musa, İsa'dan şu ve şu kadar sene öncedir! Resûlullah (Sallallahu Aleyhi ve Sellem)'in yanına gelince bunu kendisine sordum da : «Onlar kendilerinden önceki Nebilerinin ve sulehanın adlarını koyarlardı.» diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5599,
			"arabicnumber": "2136.01",
			"text": "Bize Yahya b. Yahya ile Ebû Bekr b. Ebî Şeybe rivayet ettiler. (Ebû Bekir dediki: Bize Mu'temir b. Süleyman, Rukeyn'den, o da babasından, o da Semura'dan naklen rivayet etti. Yahya ise: Bize Mu'temir b. Süleyman haber verdi, dedi. (Demişki): Rukeyni babasından, o da Semûra b. Cündeb'den naklen rivayet ederken dinledim.) Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) kölelerimize dört isim vermemizi bize yasak etti. Eflah, Rabâh, Yesâr ve Nâfi",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5600,
			"arabicnumber": "2136.02",
			"text": "Bize Kuteybe b. Saîd de rivayet etti. (Dediki): Bize Cerîr Rukeyn b. Rabi'den, o da babasından, o da Semura b. Cündeb'ten naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem): «Oğluna Rabâh, Yesâr, Eflah ve Nâfi' adı koyma!» buyurdular. İzah 2138 de",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5601,
			"arabicnumber": "2137.01",
			"text": "Bize Ahmed b. Abdillah b. Yûnus rivayet etti- (Dediki): Bize Züheyr rivayet etti. (Dediki): Bize Mansûr Hilâl b. Yesâr'dan, o da Rabi' b. Umeyle'den, o da Semûra b. Cündeb'den naklen rivayet etti. Semûra şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Allah indinde sözün en makbulü dörtdür: Allah'ı tenzih ederim=(SUBHANALLAH), hamd Allah'a mahsustur=(ELHAMDU LİLLAH), Allah'dan başka ilâh yoktur ve Allah en büyüktür=(LA İLAHE İLLALLAHU VALLAHU EKBER) (sözleri). Bunların hangisinden başlasan sana zarar etmez. Ama sakın çocuğuna Yesâr, Rabâh, Necîh ve Eflah adlarını koymayasın! Çünkü sen orada mı o dersin, orada olmaz da! hayır! der.» buyurdular. (Râvi demiş ki, bunlar dört sözdür. Benim üzerimden fazlalaştırmayın)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5602,
			"arabicnumber": "2137.02",
			"text": "{…} Bize İshâk b. İbrahim de rivayet etti. (Dediki): Bana Cerîr haber verdi. H. Bana Ümeyye b. Bîstâm dahi rivayet etti. (Dediki): Bize Yezîd b. Zürey' rivayet etti. (Dediki): Bize Ravh (Bu zât İbni Kâasım'dır) rivayet etti. H. Bize Muhammed b. Müsennâ ile İbni Beşşâr da rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. Bu râvilerin hepsi Mansûr'daıı Züheyr'in isnadı ile rivayette bulunmuşlardır. Cerîrle Ravh'ın hadîsi kıssasiyle Züheyr'in hadîsi gibidir. Şu'be'nin hadîsine gelince, onda yalnız çocuğa isim koyma zikredilmiş, dört söz zikredilmemiştir. İzah 2138 de",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5603,
			"arabicnumber": "2138",
			"text": "Bize Muhammed b. Ahmed b. Ebî Halef rivayet etti. (Dediki): Bize Ravh rivayet etti. (Dediki): Bize İbni Cüreyc rivayet etti. (Dediki): Bana Ebû'z-Zübeyr haber verdi ki, kendisi Câbir b. Abdillâh'ı şöyle derken işitmiş. Nebi (Sallailahu Aleyhi ve Sellem) Ya'lâ, Bereket, Eflah, Yesâr, Nâfi' ve buna benzer isimleri koymaktan nehyetmek istedi. Sonradan bunlardan sükût buyurduğunu gördüm. Artık hiç bir şey söylemedi. Sonra Resûlullah (Sallailahu Aleyhi ve Sellem) bundan nehy etmeden dünyadan gitti. Bilâhare Ömer bunları yasak etmek istedi. Sonra o da bıraktı",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5604,
			"arabicnumber": "2139.01",
			"text": "Bize Ahmed b. Hanbel ile Züheyr b. Harb, Muhammed b. Müsennâ, Ubeydullah b. Saîd ve Muhammed b. Beşşar rivayet ettiler. (Dedilerki): Bize Yahya b. Saîd, Ubeydullah'dan rivayet etti. (Demişki): Bana Nâfi', İbni Ömer'den naklen haber verdi ki: Resûlullah (Sallailahu Aleyhi ve Sellem) Asiye ismini değiştirmiş ve: «Sen Cemîle'sin!» buyurmuştur. Ahmed «Ahberanî»(Bana haber verdi) yerine «an» (... dan) demiştir",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5605,
			"arabicnumber": "2139.02",
			"text": "Bize Ebû Bekr b. Ebi Şeybe rivayet etti. (Dediki): Bize Hasen b. Musa rivayet etti. (Dediki): Bize Hammâd b. Seleme Ubeydullah'dan, o da Nâfı'den, o da İbni Ömer'den naklen rivayet etti ki: Ömer'in bir kızına Âsiye denilirnıiş. Resûlullah (Sallallahu Aleyhi ve Sellem) ona Cemile adını takmış",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5606,
			"arabicnumber": "2140",
			"text": "Bize Amru'n-Nâkıd ile İbni Ebî Ömer rivayet ettiler. Lâfız Amr'ındır. (Dedilerki): Bize Süfyân, Talha oğullarının azatlısı Muhammed b. Abdirrahman'dan, o da Kureyb'den, o da İbni Abbâs'dan naklen rivayet etti. (Şöyle demiş): Cüveyriye'nin ismi Berra idi. Resûlullah (Sallallahu Aleyhi ve Sellem) onu Cüveyriye'ye çevirdi. (Birisi için) Berra'nın yanından çıktı, denilmesini kerih görüyordu. İbni Ebî Ömer'in Kureyb'den rivayet ettiği hadîste (râvi) İbnü Abbâs'dan işittim, demiştir. İzah 2142 de",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5607,
			"arabicnumber": "2141",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Muhammed b. Müsennâ ve Muhammed b. Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Atâ' b. Ebî Meymûne'den rivayet etti. (Demiş ki): Ben Ebû Râfi'i, Ebû Hureyre'den rivayet ederken dinledim. H. Bize Ubeydullah b. Muaz da rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, Ata' b. Ebî Meymûne'den, o da Ebû Râfi'den, o da Ebû Hureyre'den naklen rivayet etti ki: Zeyneb'in ismi Berra imiş. O kendisini temize çıkarıyor, demişler. Onun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) ona Zeyneb ismini vermiş. Hadîsin lâfzı İbni Beşşâr'dan geri kalanlarıdır. İbni Ebî Şeybe: Bize Muhammed b. Ca'fer, Şu'be'den rivayet etti, dedi. İzah 2142 de",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5608,
			"arabicnumber": "2142.01",
			"text": "Bana İshâk b. İbrahim rivayet etti. (Dediki): Bize îsa b. Yûnus haber verdi. H. Ebû Kureyb de rivayet etti. (Dediki): Bize Ebû Usâme rivayet etti. Her iki râvi demişler ki : Bize Velid b. Kesir rivayet etti. (Dediki): Bana Muhammed b. Amr b. Atâ* rivayet etti. (Dediki): Bana Zeyneb binti Ümmü Seleme rivayet etti. (Dediki): Benim ismim Berrâ idi. Resûlullah (Sallallahu Aleyhi ve Sellem) bana Zeyneb ismini verdi. Zeyneb demişki: Resûlullah'ın yanına Zeyneb binti Cahş girdi. Onun ismi de Berrâ îdi. Ona da Zeyneb ismini verdi",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5609,
			"arabicnumber": "2142.02",
			"text": "Bize Amru'n-Nâkıd rivayet etti. (Dediki): Bize Hâşim b. Kâasım rivayet etti. (Dediki): Bize Leys, Yezîd b. Ebî Habîb'den, o da Muhammed b. Amr b. Atâ'dan naklen rivayet etti. Şöyle demiş: Ben kızıma Berra ismini verdim. Müteakiben Zeyneb binti Ebî Seleme bana şunu söyledi: Resûlullah (Sallallahu Aleyhi ve Sellem) bu isimden nehiy buyurdu. Benim adım da Berra idi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Kendinizi temize çekmeyin! Allah sizin iyi olanlarınızı pek âlâ bilir.» dedi. (Oradakiler) : — Ona ne isim verelim? diye sordular. «Zeyneb İsmini verin.» buyurdu",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5610,
			"arabicnumber": "2143.01",
			"text": "Bize Saîd b. Amr El-Eş'asî ile Ahmed b. Hanbel ve Ebû Bekr b. Ebî Şeybe rivayet ettiler. Lâfız Ahmed'indir. (Eş'asî: Ahberana, ötekiler: Haddesena tâbirlerini kullandılar. (Dedilerki): Bize Süfyân b. Uyeyne, Ebû'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti: «Allah indinde en kötü isim Meliküt-Emlâk ismi alan kişi (nin ismi) dir.» buyurmuşlar. İbni Ebî Şeybe kendi rivayetinde: «Allah (Azze ve Celle) den başka Mâlik yoktur.» cümlesini ziyâde etti. Eş'asî dedi ki : «Süfyân Şâhîn Şah gibi, dedi.» Ahmed b. Hanbel de dedi ki: «Ebû Amr'a, ahna' ne demektir? diye sordum. En alçaktır, cevâbını verdi.»",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5611,
			"arabicnumber": "2143.02",
			"text": "Bize Muhammed b. Râfi' rivayet etti. (Dediki): Bize Abdürrezzâk rivayet etti. (Dediki): Bize Ma'mer, Hemmâm b. Münebbih'den naklen haber verdi. Hemmâm: Ebû Hureyre'nin Resûlullah (Sallallahu Aleyhi ve Sellem)'den bize rivayet ettikleri şunlardır, diyerek bir takım hadîsler zikretmiştir. Onlardan biri de şudur. Resûlullah (Sallallahu Aleyhi ve Sellem): «Kıyamet gününde Allah Teâlâ'nın en fazla gadab edeceği en pis ve en kindar adam Melikül-Emlak adını takınan kimsedir. Allah'tan başka Melik yoktur.» buyurdular",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5612,
			"arabicnumber": "2144.01",
			"text": "Bize Abdü'l-A'lâ b. Hammâd rivayet etti. (Dediki): Bize Hammâd b. Seleme, Sabit EI-Bûnânî'den, o da Enes b. Mâlik'den naklen rivayet etti. Enes şöyle demiş: Abdullah b. Ebî Talhate'l-Ensâri doğduğu vakit onu Resûlullah (Sallallahu Aleyhi ve Sellem)'e götürdüm. Resûlullah (Sallallahu Aleyhi ve Sellem) bir aba içinde devesini katranlıyordu. (Bana) : «Yanında kuru hurma var mı?» diye sordu. — Evet! dedim. Ve kendilerine birkaç hurma verdim. Onları ağzına atarak çiğnedi. Sonra çocuğun ağzını açtı ve hurmayı içine püskürdü. Çocuk onu yalamaya başladı. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Ensar’ın sevgilisi hurmadır.» buyurdu. Ve çocuğa Abdullah adını verdi",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5613,
			"arabicnumber": "2144.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Yezîd b. Hârûn rivayet etti. (Dediki): Bize İbni Avn İbni Sîrîn'den, o da Enes b. Mâlik'den naklen haber verdi. Enes şöyle demiş: Ebu Talha'nın hasta bir oğlu vardı. Ebu Talha (bir haceti için) dışarı çıktı ve çocuk öldü. Ebu Talha döndüğü vakit: - Oğlum ne yapıyor? diye sordu. Ümmü Süleym: - O eskisinden daha sakindir, dedi. Ve oda akşam yemeğini yedi. Sonra Ümmü Süleym'e yakınlık etti. Bundan fariğ olunca Ümmü Süleym: — Çocuğu defnedin! dedi. Sabaha çıkınca Ebû Talha Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek (olanı) ona haber verdi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Bu gece gelin güveyi oldunuz mu?» diye sordu. — Evet! cevâbını verdi. «Allahım Bunlara bereket ver!» diye dua etti. Sonra Ümmü Süleym bir oğlan doğurdu. Ebû Talha bana : — Bunu yüklen de Nebi (Sallallahu Aleyhi ve Sellem)'e götür, dedi. Enes çocuğu Nebi (Sallallahu Aleyhi ve Sellem)'e götürmüş. Ümmü Süleym onunla birkaç kuru hurma göndermişmiş. Nebi (Sallallahu Aleyhi ve Sellem) çocuğu almış ve : «Enes'in yanında bir şey var mı?» diye sormuş. — Evet! Birkaç hurma var, demişler. Nebi (Sallallahu Aleyhi ve Sellem) bu hurmaları alarak çiğnemiş. Sonra onları ağzından alarak çocuğun ağzına koymuş. Sonra tahnik yapmış ve çocuğa Abdullah ismini vermiş",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5614,
			"arabicnumber": "2144.03",
			"text": "{…} Bize Muhammed b. Beşşâr rivayet etti. (Dediki): Bize Hammâd b. Mes'ade rivayet etti. (Dediki): Bize Ibni Avn, Muhammed'den, o da Enes'den naklen bu kıssa ile Yezid'in hadîsi gibi rivayette bulundu. İzah 2145 te Bu sayfa’nın devamı niteliğindeki sayfa –ki yukarki hadis’in gemiş rivayetini içeriryor- için buraya tıklayabilirsiniz",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5615,
			"arabicnumber": "2145",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Abdullah b. Berrâd El-Eş'arî ve Ebû Kureyb rivayet ettiler. (Dedilerki): Bize Ebû Usâme, Bûreyd'den, o da Ebû Bürde'den, o da Ebû Musa'dan naklen rivayet etti. Ebû Mûsâ şöyle demiş: Bir oğlum dünyaya geldi de, onu Nebi (Sallallahu Aleyhi ve Sellem)'e getirdim. Ona İbrahim adını verdi. Ve bir kuru hurma ile tahnik yaptı",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5616,
			"arabicnumber": "2146.01",
			"text": "Bize Hakem b. Musa Ebû Salih rivayet etti. (Dediki): Bize Şuayb (yâni İbni îshâk) rivayet etti. (Dediki): Bana Hişâm b. Urve haber verdi. (Dediki): Bana Urve b. Zübeyr ile F&tıme binti Münzir b. Zübeyr rivayet ettiler. (Dedilerki): Esma binti Bbi Bekr Abdullah b. Zübeyr'e gebe olarak hicret ettiği vakit çıktı da Kuba'ya geldi. Ve Kuba'da Abdullah'ı doğurdu. Doğurduktan sonra ona çiğnem yaptırmak üzere Resûlullah (Sallallahu Aleyhi ve Sellem)'in yanına çıktı. Resûlullah (Sallallahu Aleyhi ve Sellem) çocuğu ondan alarak kendi kucağına koymuş. Sonra bir kuru hurma istemiş. Âîşe demiş ki: Biz onu buluncaya kadar bir müddet aradık durduk. Onu çiğnedi. Sonra çocuğun ağzına tükürdü. Ve karnına ilk giren şey Resûlullah (Sallallahu Aleyhi ve Sellem)'in tükruğü oldu. Sonra Esma şunu söylemiş: Sonra çocuğu sıvazladı, üzerine dua etti. Ve ona Abdullah ismini verdi. Bilâhare bu çocuk yedi veya sekiz yaşlarında iken Resûlullah (Sallallahu Aleyhi ve Sellem)'e bey'at etmeye geldi. Bunu ona Zübeyr emretmişti. Resûlullah (Sallallahu Aleyhi ve Sellem) onun kendine doğru geldiğini görünce gülümsedi. Sonra çocuk ona bey'at etti",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5617,
			"arabicnumber": "2146.02",
			"text": "Bize Ebû Kureyb Muhammed b. Alâ' rivayet etti. (Dediki): Bize Ebû Usâme Hişâm'dan, o da babasından, o da Esmâ'dan naklen rivayet ettiki: Esma Abdullah b. Zübeyr'e Mekke'de iken gebe kalmış. Esma şöyle demiş: Müddetimi tamamladığım halde çıktım Medine'ye geldim. Ve Kuba'ya misafir oldum. Onu Kuba'da doğurdum. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem)'e geldim. Onu kucağına koydu. Sonra bir kuru hurma isteyerek onu çiğnedi. Sonra çocuğun ağzına tükürdü. Böylece çocuğun karnına giren ilk şey Resûlullah (Sallallahu Aleyhi ve Sellem)'in tükrüğü oldu. Sonra onu hurma ile tahnik etti. Sonra ona dua etti. Bereket diledi. Bu çocuk İslâmiyette doğan ilk çocuktur",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5618,
			"arabicnumber": "2146.03",
			"text": "{…} Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Hâlid b. Mâhled, Alî b. Müshir'den, o da Hişam b. Urve'den, o da babasından, o da Esma binti Ebî Bekr'den naklen rivayet ettiki, Esma Abdullah b. Zübeyr'e gebe olduğu halde Resûlullah (Sallallahu Aleyhi ve Sellem)'in yanına hicret etmiş. Râvi, Ebû Usâme'nin hadîsi gibi rivayette bulunmuştur. İzah 2150 de",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5619,
			"arabicnumber": "2147",
			"text": "Bize Ebu Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdullah b. Numeyr rivayet etti. (Dediki): Bize Hişam (yâni İbni Urve) babasından, o da Âişe'den naklen rivayet etti ki, Resûlullah (Sallallahu Aleyhi ve Sellem)'e çocuklar getirilir de onlara bereket duasında bulunur. Ve hurma çiğnermiş. İzah 2150 de",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5620,
			"arabicnumber": "2148",
			"text": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti, (Dediki): Bize Ebû Halid El-Ahmar, Hişâm'dan, o da babasından, o da Âişe'den naklen rivayet etti. (Şöyle demiş): Abdullah b. Zübeyr'i tahnik ettirmek için Nebi (Sallallahu Aleyhi ve Sellem)'e getirdik. Bir hurma aradık ama bulması bize hayli güç oldu. İzah 2150 de",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5621,
			"arabicnumber": "2149",
			"text": "Bana Muhammed b. Sehl Et-Temîmî ile Ebû Bekr b. İshâk rivayet ettiler. (Dedilerki): Bize İbni Ebî Meryem rivayet etti. (Dediki): Bize Muhammed (Bu zat Ebû Gassan İbni Mutarrîfdir) rivayet etti. (Dediki): Bana Ebû Hazım, Sehl b. Sa'd'dan rivayet etti. (Demişki): Munzir b. Ebi Useyd doğduğu zaman onu Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirdiler. Nebi (Sallallahu Aleyhi ve Sellem) de onu uyluğunun üzerine koydu. Ebû Üseyd oturuyordu. Derken Nebi (Sallallahu Aleyhi ve Sellem) önünde bir şey'e meşgul oldu. Ebû Üseyd de emir verdi. Ve oğlu Resulullah (Sallallahu Aleyhi ve Sellem)'in uyluğu üzerinden kaldırıldı. Onu geri çevirdiler. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) kendine gelerek: «Çocuk nerede?» dîye sordu. Ebû Üseyd : — Biz onu geri çevirdik, yâ Resûlallah! dedi. «Onun ismi ne?» diye sordu. Ebû Üseyd : — Fülân yâ Resûlallah! dedi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Hayır! Velâkin onun ismi Münzir'dir.» buyurdu. Ve ona o gün Münzir adını verdi. İzah 2150 de",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5622,
			"arabicnumber": "2150",
			"text": "Bize Ebû Rabi' Süleyman b. Dâvud El-Atekî rivayet etti. (Dediki): Bize Abdû'l-Varis rivayet etti. (Dediki): Bize Ebû't-Teyyah rivayet etti. (Dediki): Bize Enes b; Mâlik rivayet etti. H. Bize Şeyban b. Ferrûh da rivayet etti. Lâfız onundur. (Dediki): Bize Abdü'l-Vâris, Ebû't-Teyyah'dan, o da Enes b. Mâlik'den naklen rivayet etti. Enes şöyle demiş : Resûlullah (Sallallahu Aleyhi ve Sellem) ahlâkça insanların en güzeli idi. Benîm bîr kardeşim vardı ki, ona Ebû Umeyr denilirdi. (Râvi demiş ki: zannederim memeden ayrılmıştı, dedi.) Resûlullah (Sallallahu Aleyhi ve Sellem) (bize) gelip de onu gördüğü zaman: «Ebâ Umeyr! Ne yaptı Nugayr!» derdi. Ebû Umeyr bu kuşla oynardı",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5623,
			"arabicnumber": "2151",
			"text": "Bize Muhammed b. Ubeyb El-Guberî rivayet etti. (Dediki): Bize Ebû Avâne, Ebû Osman'dan, o da Enes b. Mâlik'den naklen rivayet etti. (Şöyle demiş): Bana ResûluIIah (Sallallahu Aleyhi ve Sellem): «Ey oğulcuğum!» diye hitab etti. İzah 2152 de",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5624,
			"arabicnumber": "2152.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile İbni Ebî Ömer rivayet ettiler. Lâfız İbni Ebî Ömer'indir. (Dedilerki): Bize Yezid b. Harun, İsmail b. Ebî Hâlid'den, o da Kays b. Ebî Hâzım'dan, o da Muğîre b. Şu'be'den naklen rivayet etti. (Şöyle demiş); Resûlullah (Sallallahu Aleyhi ve Sellem)'e Deccal'i benden çok kimse sormamıştır. Bana şöyle buyurdular : «Ey oğulcuğum! Sen onun için niye yoruluyorsun. O sana asla zarar verecek değildir.» Ben dedimki: Onun beraberinde su nehirleri, ekmek dağları olacağını söylüyorlar. «O Allah'a bundan daha ehvendir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5625,
			"arabicnumber": "2152.02",
			"text": "{…} Bize Ebû Bekr b. Ebî Şeybe ile İbni Numeyr rivayet ettiler (Dedilerki): Bize Veki' rivayet etti. H. Bize Süreye b. Yûnus da rivayet etti. (Dediki): Bize Hüşeym rivâyet etti. H. Bize İshâk b. İbrahim dahi rivayet etti. (Dediki): Bize Cerîr haber verdi. H. Bana Muhammed b. Râfi' dahi rivayet etti. (Dediki): Bize Ebû Usâme rivayet etti. Bu râvilerin hepsi İshıâil'den bu isnadla rivayette bulunmuşlardır. Yalnız Yezid'in hadîsinden başka hiç birinin hadisinde Peygamber (Sallallahu Aleyhi ve Sellem)'in Muğîre'ye ; «Ey oğulcuğum!..» sözü yoktur. «O Allah'a bundan daha ehvendir.1 cümlesinden murad onun Allah indinde bîr kıymeti yoktur ki, elinde böyle acaib garaib halketsin demektir",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5626,
			"arabicnumber": "2153.01",
			"text": "Bana Amr b. Muhammed b. Bükeyr En-Nâkıd rivayet etti. (Dediki): Bize Süfyân b. Uyeyne rivayet etti. (Dediki): Bize Vallahi Yezid b. Husayfe, Büsr b. Said'den rivayet etti. (Demişki): Ben Ebû Saîd-i Hudri'yİ dinledim. Şöyle diyordu: Medine'de ensârın meclisinde oturuyordum. Derken yanımıza ürkerek yahut korkutulmuş olarak Ebû Musa geldi: Sana ne oldu? dedik. — Ömer ona gelmem için bana haber göndermiş. Ben de kapısına geldim, üç defa selâm verdim, fakat bana cevap vermedi. Ve döndüm. Sonra bana : — Bize gelmekten seni ne men etti? dedi. Ben de : — Ben sana geldim, kapına üç defa selâm verdim. Ama bana cevap vermediler. Onun için döndüm. Gerçekten Resûlullah (Sallallahu Aleyhi ve Sellem): «Biriniz üç defa izin ister de kendisine izin verilmezse geri dönüversin!» buyurdular, dedim. Bunun üzerine Ömer: — Bu söylediğin üzerine şahit getir. Yoksa canını yakarım! dedi, Übeyy b. Ka*b: Onunla beraber kavmin en küçüğünden başkası kalkmaz, dedi. Ebû Saîd demiş ki: Ben kavmin en küçüğüyüm, dedim. Ömer : O halde onu götür, dedi",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5627,
			"arabicnumber": "2153.02",
			"text": "{…} Bize Kuteybe b. Saîd ile İbni Ebî Ömer rivayet ettiler. (Dedilerki): Bize Süfyân, Yezîd b. Husayfe'den bu isnadla rivayet etti. İbni Ebî Ömer kendi rivayetinde şunu ziyade etmiştir: «Ebû Saîd (Dediki): Ben de Ebû Musa ile beraber kalktım ve Ömer'e giderek şahitlik ettim.»",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5628,
			"arabicnumber": "2153.03",
			"text": "Bana Ebû't-Tahir rivayet etti. (Dediki): Bana Abdullah b. Vehb haber verdi. (Dediki): Bana Amr b. Haris, Bükeyr b. Eşecc'deo naklen rivayet etti. Ona da Büsr b. Saîd rivayet etmişki, kendisi Ebâ Saîd-i Hudri'yi şunu söylerken işitmiş: Ubeyy b. Ka'b'ın yanında bir meclisde idik. Derken Ebû Musel-Eş'arî kızgın olarak geldi ve durarak: — Sizden Allah aşkına soruyorum! Hiç biriniz Resûlullah (Sallallahu Aleyhi ve Sellem)'i: «İzin istemek üç keredir. Sana izin verilirse ne âla! Yoksa dönüver!» buyururken işitti mi? dedi. Übeyy: — Ne o? diye sordu. Dedi ki: — Ben dün Ömer b. Hattâb'ın yanına girmek için üç defa izin istedim. Fakat bana izin verilmedi. Ben de döndüm. Sonra bugün ona gelerek yanına girdim. Ve: Dün ben geldim, Üç defa selâm verdim. Sonra çekildim gittim diye kendisine haber verdim. Ömer: Seni işittik ama biz o anda meşgul idik. Sana izin verilinceye kadar izin istemeye devam etseydin ya! dedi. Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'den işittiğim gibi izin istedim, dedim. Ömer : Vallahi ya bana bu hususta kendine şâhidlik edecek birini getirirsin yahut sırtını ve karnını haşlarım! dedi. Onun üzerine Übeyy b. Kâ'b. — Vallahi seninle beraber yaşça en küçüğümüzden başka kimse kalkmaz. Kalk ya Ebâ Said! dedi. Ben de kalkarak Ömer'e geldim ve hakikaten Resûlullah (Sallallahu Aleyhi ve Sellem) bunu söylerken işittim, dedim",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5629,
			"arabicnumber": "2153.04",
			"text": "Bize Nasr b. Alî El Cehdamî rivayet etti. (Dediki): Bize Bişr (yâni İbni Mufaddal) rivayet etti. (Dediki): Bize Saîd b. Yezid, Ebû Nadrâ'dan, o da Ebû Said'den naklen rivayet ettiki: Ebû Musa Ömer'in kapısına gelerek izin istemiş. Ömer: Bir, demiş. Sonra ikinci defa izin istemiş. Ömer: İki, demiş. Sonra üçüncü defa izin istemiş. Ömer: Üç, demiş. Sonra çekilmiş gitmiş. Ama Ömer arkasından giderek onu geri çevirmiş. Ve: — Eğer bu Resûlullah (Sallallahu Aleyhi ve Sellem)'den bellediğin bir şeyse şahid getir. Yoksa seni mutlaka (âleme) ibret yaparım, demiş. Ebû Said demiş ki: Bunun Üzerine Ebû Musa bize geldi ve : — Bilmiyor musunuz ki Resûlullah (Sallallahu Aleyhi ve Sellem): «İzin istemek üç keredir.» buyurdular, dedi. Cemâat gülmeye başladılar. Ben de dedim ki: — Size müslüman bir kardeşiniz korkutulmuş olarak gelmiş, (daha) gülüyor musunuz? Haydi yürü, bu cezada ben senin şerikinim. Artık Ebû Musa, Ömer'e geldi. Ve : — İşte Ebû Saîd, dedi",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5630,
			"arabicnumber": "2153.05",
			"text": "{…} Bize Muhammed b. Müsennâ ile İbni Beşşar rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be Ebû Mesleme'den, o da Ebû Nadra'dan, o da Ebû Saîd'den naklen rivayet etti. H. Bize Ahmed b. Hasen b. Hıraş da rivayet etti. (Dediki): Bize Şebâbe rivayet etti. (Dediki): Bize Şu'be, Cüreyri ile Saîd b. Yezid'den rivayet etti. Bunların ikisi de Ebû Nadra'dan rivayet etmişlerdir. (Demişlerki): Biz bu hadîsi Ebû Saîd-î Hudrî rivayet ederken dinledik. Ve hadîsi Bişr b. Mufaddal'ın Ebû Mesleme'den rivayet ettiği hadîs mânâsında nakletmişlerdir",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5631,
			"arabicnumber": "2153.06",
			"text": "Bana Muhammed b. Hatim de rivayet etti. (Dediki): Bize Yahya b. Saîd El-Kattân, İbni Cüreyc'den rivayet etti. (Demişki): Bize Atâ', Ubeyd b. Umeyr'den rivayet ettiki: Ebû Musa, Ömer'den üç defa izin istemiş. Ve galiba onu meşgul bularak geri dönmüş. Onun üzerine Ömer: — Sen Abdullah b. Kays'ın sesini işitmedin mi? Ona izin verin! dedi. Ve Ebû Musa'yı çağırdılar. Ömer: — Seni bu yaptığına sevkeden nedir? diye sordu. Ebû Musa: — Biz bununla emrolunuyorduk, dedi. Ömer: — Yâ bunun üzerine beyyine getirirsin yahut ben yapacağımı yaparım, dedi. Bunun üzerine Ebû Musa çıkarak ensârın meclisine gitti. Onlar : — Sana bu hususta ancak en küçüğümüz şâhidlik eder, dediler. Ve Ebû Saîd kalktı. (Ömer'e) : — Biz bununla emrolunuyorduk, dedi. Artık Ömer: — Resûlullah (Sallallahu Aleyhi ve Sellem)'in işlerinden bana bu gizli kalmış. Beni ondan pazarlarda ticaret alıkoymuş, dedi",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5632,
			"arabicnumber": "2153.07",
			"text": "{…} Bize Muhammed b. Beşşâr rivayet etti. (Dediki): Bize Ebû Âsim rivayet etti. H. Bize Hüseyin b. Hureys de rivayet etti. (Dediki): Bize Nadr (yâni İbni Sümeyl) rivayet etti. Hep birden dedilerki: Bize İbni Cüreyc bu isnadla bu hadîsin benzerini rivayet etti. Nadr'ın hadisinde: «Beni ondan pazarlarda ticaret alıkoymuş» cümlesini anmamıştır. İzah 2154 te",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5633,
			"arabicnumber": "2154.01",
			"text": "(Bize Hüseyin b. Hureys Ebû Ammâr rivâyet etti. ki): Bize Fadl b. Mûsa rivâyet etti. ki): Bize Talha b. Yafaya, Ebû Bürde'den, o da Ebû Musâ'l-Eş'arî'den naklen haber verdi. Şöyle dedi: Ebû Mûsa, Ömer b. Hattâb'a gelerek: Esselâmüaleyküm! Ben Abdullah b. Kays'ım, dedi. Fakat Ömer ona izin vermedi. Yine: Esselâmü aleyküm! Ben Ebû Mûsa'yım. Esselâmü aleyküm! Ben Eş'ari'yim, dedi. Sonra çekildi, gitti. Ve: Bana cevap verin! Bana cevap verin! dedi. Arkacığından Ömer gelerek: Yâ Ebû Mûsa, seni ne reddetti? Biz işteydik, dedi. Ebû Mûsa: Ben Resûlüllah (sallallahü aleyhi ve sellem)’ı: istemek üç keredir. Sana İzin verilirse ne âlâ, yoksa dönuver.» buyururken işittim. Ömer: Bunun üzerine bana mutlaka şahit getirmelisin. Yoksa şöyle yaparım, şöyle ederim, dedi. Ebû Mûsa da gitti. ki: Eğer şahit bulursa, onu akşama minberin yanında bulursunuz. Şahit bulamazsa, onu bulamazsınız. Akşam olunca onu bulmuşlar. Ömer: Yâ Ebâ Mûsa ne diyorsun, şahit buldun mu? diye sormuş. Ebû Mûsa: Evet! Übeyy b. Kâ'b'ı! demiş. Ömer: Âdildir diyerek yâ Eba't-Tufeyl! Ne diyor bu? demiş. Übeyy: Ben Resûlüllah (sallallahü aleyhi ve sellem)’i bunu söylerken işittim. Ey Hattaboğlu! Binâenaleyh sakın Resûlüllah (sallallahü aleyhi ve sellem)’in ashabı üzerine azab olma! demiş. Ömer: Sübhânallah! Ben ancak bir şey işittim. Ve onun aslı olup olmadığın anlamak istedim! cevâbını vermiş",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5634,
			"arabicnumber": "2155.01",
			"text": "Bize Muhammed b. Abdillah b. Numeyr rivayet etti. (Dediki): Bize Abdullah b. İdris, Şu'be'den, o da Muhammed b. Münkedir'den, o da Câbir b. Abdillah'dan naklen rivayet etti. Câbir şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem)'e geldim de çağırdım. Peygamber (Sallallahu Aleyhi ve Sellem) : «Kim o?» dedi. — Ben! dedim. Arkacığından: Ben!.. Ben!., diyerek çıktı",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5635,
			"arabicnumber": "2155.02",
			"text": "Bize Yahya b. Yahya ile Ebû Bekr b. Ebî Şeybe rivayet ettiler. Lâfız Ebû Bekr'indir. Yahya: Ahberana; Ebû Bekir: Haddesena tâbirlerini kullandılar. (Dedilerki): Bize Veki', Şu*be'den, o da Muhammed b. Münkedir'den, o da Câbir b. Abdillah'dan naklen rivayet etti. (Şöyle demiş): Nebi (Sallallahu Aleyhi ve Sellem)'in yanına girmek için izin istedim. «Kim o?» dedi. — Ben! dedim. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): «Ben!.. Ben!..» buyurdular",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5636,
			"arabicnumber": "2155.03",
			"text": "{…} Bize İshâk b. İbrahim de rivayet etti. (Dediki): Bize Nadr b. Şümeyl ile Ebû Âmir EI-Akedî rivayet ettiler. H. Bize Muhammed b. Müsenna dahi rivayet etti. (Dediki): Bana Vehb b. Cerir rivayet etti. H. Bana Abdurrahman b. Bişr de rivayet etti. (Dediki): Bize Behz rivayet etti. Bu râvilerin hepsi Şu'be'den bu İsnadla rivayette bulunmuşlardır. Onların hadisinde: «Galiba bundan hoşlanmadı...» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5638,
			"arabicnumber": "2156.01",
			"text": "Bize Yahya b. Yahya ile Muhammed b. Rumh rivayet ettiler. (Dedilerki): Bize Leys haber verdi. Lâfız Yahya'nındır. H. Bize Kuteybe b. Saîd de rivayet etti. (Dediki): Bize Leys ibni Şlhab'dan rivayet etti. Ona da Sehl b. Sa'd Es-Sâidî haber vermişki, Bir adam Resûlullah (Sallallahu Aleyhi ve Sellem)'in kapısındaki bir delikten bakmış. Resûlullah (Sallallahu Aleyhi ve Sellem)'in elinde başını kaşıdığı bir demir varmış. Resûlullah (Sallallahu Aleyhi ve Sellem) onu görünce : «Beni gözettiğini bilsem şu demirle senin gözünü oyardım.» buyurmuş. Ve (bir de) Resûlullah (Sallallahu Aleyhi ve Sellem)i «İzin ancak ve ancak gözden dolayı icad edilmiştir» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5639,
			"arabicnumber": "2156.02",
			"text": "Bana Harmele b. Yahya da rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus, İbni Şihab'dan naklen haber verdi. Ona da Sehl b. Sa'd El-Ensârî haber vermişki: Bir adanı ResûluIIah (Sallallahu Aleyhi ve Sellem)'in kapısındaki bir delikten bakmış. Resûlullah (Sallallahu Aleyhi ve Sellem)'in elinde başını taradığı bir demir varmış. Bunun üzerine ResûluIIah (Sallallahu Aleyhi ve Sellem) o adama: «Senin baktığını bilmiş olsam, bununla iki gözünü oyardım. Allah izni ancak gözden dolayı icad etmiştir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5640,
			"arabicnumber": "2156.03",
			"text": "{m-41} Bize Ebû Bekr b. Ebi Şeybe ile Amru'n-Nâkıd, Züheyr b. Harb ve İbni Ebî Ömer de rivayet ettiler. (Dedilerki): Bize Süfyân b. Uyeyne rivayet etti. H. Bize Ebû Kâmil El-Cahderî dahî rivayet etti. (Dediki): Bize Abdül-Vâhid b. Ziyad rivayet etti. (Dediki): Bize Ma'mer rivayet etti. Her iki râvi Zührî'den, o da Sehl b. Sa'd'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen Leys ile Yûnus'un hadîsi gibi rivayette bulunmuşlardır. İzah 2158 de",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5641,
			"arabicnumber": "2157",
			"text": "Bize Yahya b. Yahya ile Ebû Kâmil Fudayl b. Hüseyn ve Kuteybe b. Saîd rivayet ettiler. Lâfz Yahya ile Ebû Kâmîl'indir. Yahya ahberanâ, ötekiler haddesenâ tâbirlerini kullandılar. (Dedilerki): Bize Hammad b. Zeyd, Ubeydullah b. Ebî Bekr'den, o da Enes b. Mâlik'den naklen rivayet etti ki: Bir adam Nebi (Sallallahu Aleyhi ve Sellem)'in hücrelerinden birine laktı, o da yayla yahut yaylarla ona doğru ayağa kalktı. Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'in yaralamak İçin onu kolladığım hâlâ görür gibiyim. İzah 2158 de",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5642,
			"arabicnumber": "2158.01",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Cerir, Süheyl'den, o da babasından, o da Ebû Hureyre'den, o da Nebi (Sallailahu Aleyhi ve Sellem)'den naklen rivayet etti: «Bir kimse izinleri olmaksızın bir kavmin evine bakarsa, gözünü çıkarmaları onlara helâl olur.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5643,
			"arabicnumber": "2158.02",
			"text": "Bize İbni Ebî Ömer rivayet etti. (Dediki): Bize Süfyân, Ebu'z-Zinad'dan, o da A'rac'dan, o da Ebû Hureyre'den naklen rivayet etti ki, Resûlullah (Saüaliahü Aleyhi ve Sellem): «Bir adam izinsiz senin evine baksa da, ona ufak bir taş alarak gözünü çıkarsan, sana bir günah olmaz.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5644,
			"arabicnumber": "2159.01",
			"text": "Bana Kuteybe b. Saîd rivayet etti. (Dediki): Bize Yezîd b. Zürey' rivayet etti. H. Bize Ebû Bekr b. Ebî Şeybe de rivayet etti. (Dediki): Bize İsmail b. Uleyye rivayet etti. Her iki râvi Yûnus'dan rivayet etmişlerdir. H. Bana Züheyr b. Harb dahî rivayet etti. (Dediki): Bize Hüşeym rivayet etti. (Dediki): Bize Yûnus, Amr b. Saîd'den, o da Ebû Zür'a'dan, o da Cerîr b. Abdillah'dan naklen haber verdi. Cerîr (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem)'e ansızın görmeyi sordum. Bana gözümü (başka tarafa) çevirmemi emretti",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5645,
			"arabicnumber": "2159.02",
			"text": "{…} Bize İshâk b. İbrahim de rivayet etti. (Dediki): Bize Abdü'l-Alâ haber verdi. İshâk şöyle dedi : Bize Veki' haber verdi. (Dediki): Bize Süfyân rivayet etti. Her iki râvi Yûnus'dan bu isnadla bu hadîsin mislini rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 60
			}
		}
	]
}