{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5646,
			"arabicnumber": "2160",
			"text": "(Bana Ukbe b. Mükrem rivâyet etti. ki): Bize Ebû Âsim, İbn Cüreyc'den rivâyet etti. H. Muhammed b. Merzuk da rivâyet etti. ki): Bire Ravh rivâyet etti. ki): Bize İbn Cüreyc rivâyet etti. ki): Bana Ziyad haber verdi. Ona da Abdurrahman b. Zeyd'in azatlısı Sabit haber vermiş ki, kendisi Ebû Hüreyre'yi şunu söylerken işitmiş: Resûlüllah (sallallahü aleyhi ve sellem): giden yürüyene, yürüyen oturana ve az olan çok olana selâm verir.» buyurdular. hadîsi Buhârî «İstizan» bahsinde tahrîc etmiştir. Tirmizî onu: giden yayaya, yaya giden oturana, az olan çok olana selâm verir...» şeklinde rivâyet etmiş ve: «Bu hadîs sahihtir.» demiştir. Hadis-i şerîf selâmın adabını beyan etmektedir. Selâm vermek sünnet, alması ise farzdır. Selâm verenler kalabalık ise bunlar hakkında selâm sünnet-i kifayecür. Yani içlerinden bazısının selâm vermesiyle bu vazife hepsinden sakıt olur. Selâm verilen kimse bir kişi ise, selâmı alması farz-ı ayn bir cemâat iseler selâmı almak farz-ı kifâye olur. Efdal olan iki cemâat karşılaştığı zaman bütün cemâatin selâm vermesi ve bütün cemâatin selâm almasıdır. İmâm-ı Ebû Yûsuf'dan bir rivâyete göre bütün cemâatin selâm alması farzdır. diyor ki: «İbn Abdilberr ve başkaları selâm vermenin sünnet, almanınsa farz olduğuna müslümanların icmaını nak-letmişlerdir.» en azı «Esselâmüaleyküm» demektir. Selâm verilen kimse bir kişi ise ona en azından «Esselâmüaleyke» denilir. Fakat efdal olan yanındaki meleklere de şamil olması İçin «Esselâmüaleyküm» demektir. Bundan daha mükemmeli: «Esselâmüaleyküm verahmetüllah» daha mükemmeli: ve rahmetullahi ve berakâtüh» dür. Maamafih «Selâmünaleyküm» demek de kâfidir. veren kimsenin «Aleykümselam» demesi mekruhtur. Maamafih sahîh ve meşhur olan kavle göre bununla yine de selâm almayı haketmiş olur. Bâzılarına göre selâm almayı hak eimez. Resûlüllah (sallallahü aleyhi ve sellem) Efendimizin: deme, çünkü aleykesselâm ölülerin selâmıdır.» buyurduğu sahih rivâyetle sabit olmuştur. Efdal olan selâm alma şekli: aleykümüsselâmü ve rahmetullahi ve berakâtühü» diyerek (vav) ile başlamaktır. (Vav)’ın hazfı da caiz ise de efdal terkedilmiş olur. Selâmı alan kimse sadece «Ve aleykümüssefâm» yahut «Aleykümüsselâm» dese kâfidir. Fakat sadece «Aleyküm» demesi bilittifak caiz değildir. Selâmın verirken olsun, alırken olsun en aşağı derecesi onu karşısındakine işittirmektir. Bundan aşağısı kâfi değildir. Verilen selâmı hemen almak şarttır. Uzaktan biri vasitaayle yahut mektupla gönderilen selâmı dahi derhal kabul gerekir. Hadîs-i şerifte buyurulan; binek gidenin yürüyene, ayakta olanın oturana ve azın çoğa selâm vermesi müstehab manasınadır. Binâenaleyh aksine hareket edilse caiz, fakat efdalin hilâfına olur. gelince ukmadan bâzılarına göre selâm Allah'ın ismidir. Esselâmu aleyküm dernek Allah'ın ismi sizin üzerinize olsun manasınadır. Bundan da: «Allah'ın muhafazası altında olasınız» mânâsı kasdedilir. Nitekim yine bu mânâda Arablar «Allahumeak- ve «Allahuyeshabük» derler. Diğer bazı ulemaya göre selâm selâmet manasınadır ve cümle, selâmet sizin üzerinize olsun, sizden ayrılmasın manasınadır",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5647,
			"arabicnumber": "2161",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe rivâyet etti. ki): Bize Affân rivâyet etti. ki): Bize Abdül-Vahid b. Ziyad rivâyet etti, ki): Bize Osman b. Hakim, İshâk b. Abdillah b. Ebî Talha'dan, o da babasından naklen rivâyet etti. ki): Ebû Talha şunları söyledi: Bİz avlu içlerinde oturup konuşuyorduk, derken Resûlüllah (sallallahü aleyhi ve sellem) gelerek başımızda durdu ve: ne oluyor ki, yollarda oturuyorsunuz. Yollarda oturmaktan kaçının!» buyurdular. Biz ancak zararsız şeyler için oturduk müzakere ediyor ve konuşuyoruz, dedik. bırakmıyacaksanız hakkını bâri verin! (Onun hakkı) Gözü yummak, selâmı almak ve güzel sözdür.» buyurdular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5648,
			"arabicnumber": "2121.03",
			"text": "(Bize Süveyd b. Saîd rivâyet etti. ki): Bize Hafs b. Meysera, Zeyd b. Eslem'den, o da Atâ' b. Yesâr'dan, o da Ebû Saîd-i Hudrî'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti: oturmaktan sakının!» buyurmuşlar. Ashâb: Ya Resûlallah! Oturmaktan başka çaremiz yoktur. Biz oralarda konuşuyoruz, demişler. Resûlüllah (sallallahü aleyhi ve sellem): başka bir şey yapmıyacaksamz, yolun hakkını bari verin!» buyurmuşlar. Ashab: Onun hakkı nedir? diye sormuşlar: yummak, ezayı def etmek, selâmı almak, iyiliği emir ve kötülüğü yasak etmektir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5649,
			"arabicnumber": "2121.04",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5650,
			"arabicnumber": "2162.01",
			"text": "(Bize Abd b. Humeyd de rivâyet etti. ki): Bize Abdurrezzâk haber verdi. ki): Bize Ma'mer, Zührî'den, o da İbn Müseyyeb'den, o da Ebû Hüreyre'den naklen haber verdi. Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): müsluman için din kardeşine vâcib olan beş haslet vardır. Selâmı almak, aksırana teşmît, davete İcabet, hastayı dolaşmak ve cenazelerin arkasından gitmek...» buyurdular. ki: Ma'mer bu hadîsi Zührî'den mürsel olarak rivâyet ederdi. Onu bir defa İbn Müseyyeb'den, o da Ebû Hüreyre'den nakletmiş olmak üzere müsned rivâyet etti",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5651,
			"arabicnumber": "2162.02",
			"text": "Bize Yahya b. Eyyûb ile Kuteybe ve İbn Hucr rivâyet ettiler. (Dediler ki): Bize İsmail (bu zat İbn Ca'fer'dir), Alâ'dan, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem): müslüman üzerindeki hakkı altıdır.» buyurmuş. (Kendisine): Nedir onlar ya Resûlüllah? denilmiş: rastladığın zaman selâm ver, seni çağırırsa icabet et, senden nasihat dilerse ona nasihat et, aksınr da Allah'a hamdederse ona teşmit et, hastalanırsa onu dolaş, öldüğü vakit de arkasından git.» buyurmuşlardır. hadîsin şerhi «Libâs» bahsinde ve bu bahsin başlarında görülmüştür. Teşmit yahut tesmit, aksırıp da elhamdülillah diyen kimseye yerha-mükellah demektir. Davete icabetten murad ekseriyetle düğün davetidir. Mâni bulunmamak şartıyle bu davete icabet vâcib derecesinde lüzumludur. Çalgı, oyun ve içki gibi şeyler davete icabete mânidirler. Düğünden başka davetlere icabet müstehabdır. Hasta dolaşmak da aynı hükümdedir. Yalnız hastanın yanında fazla oturmamalıdır. Cenazenin arkasından gitmek vazifesi onun namazını kılmakla sona ererse de, kabrine indirilince-ye kadar yanında bulunmak daha faziletlidir. birçok mânâlar ifade eden cemiyetli bir kelime olduğunu evvelce görmüştük. Burada ondan murad öğüttür. Yani din kardeşin senden herhangi bir hususa dair öğüt isterse, kendisine müdahenesiz, yalansız olarak doğru dürüst nasihatta bulun, demektir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5652,
			"arabicnumber": "2163.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5653,
			"arabicnumber": "2163.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5654,
			"arabicnumber": "2164.01",
			"text": "Bize Yahya b. Yahya İle Yahya b. Eyyûb, Kuteybe ve İbn Hucr rivâyet ettiler. Lâfız Yahya b. Yahya'nındır. (Yahya b. Yahya: Ahberanâ, ötekiler: Haddesenâ tâbirlerini kullandılar, dediler ki): İsmail (bu zât İbn Ca'fer'dir), Abdullah b. Dinar'dan naklen rivâyet etti. O da İbn Ömer'i şunu söylerken işitmiş. Resûlüllah (sallallahü aleyhi ve sellem): ki, Yahûdiler size selâm verdikleri vakit, her biri Essâmu aleykum der. Sen de aleyke deyiver!» buyurdular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5655,
			"arabicnumber": "2164.02",
			"text": "(Bana Züheyr b. Harb da rivâyet etti. ki): Bize Abdurrahman, Süfyân'dan, o da Abdullah b. Dinar'dan, o da İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini rivâyet etti. Yalnız o: de ve aleyke deyiverin!» demiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5656,
			"arabicnumber": "2165.01",
			"text": "Bana Amru'n-Nâkıd ile Züheyr b. Harb rivâyet ettiler. Lâfız Züheyr'indir. (Dediler ki): Bize Süfyân b. Uyeyne Zührî'den, o da Urve'den, o da Âişe'den naklen rivâyet etti. Âişe şöyle dedi: Yahûdilerden bir cemâat Resûlüllah (sallallahü aleyhi ve sellem)’in yanına girmek için izin istediler ve: Essâmualeyküm, dediler. Âişe de: Bilâkis sam ve lanet sizin üzerinize olsun, dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): Âişe! Şüphesiz ki, Allah her işte yumuşaklığı sever!» buyurdular. Âişe ; Ne söylediklerini işitmedin mi? dedi. «Ben \"ve aleyküm\" dedim.» buyurdular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5657,
			"arabicnumber": "2165.02",
			"text": "(Bize bu hadîsi Hasen b. Ali El-Hulvânî ile Ahd b. Humeyd hep birden Ya'kûb b. İbrahim b. Sa'd'dan rivâyet ettiler. ki): Bize babam Sâlih'den rivâyet etti. H. Abd b. Humeyd de rivâyet etti. ki): Bize Abdürezzâk haber verdi. ki): Bize Ma'mer haber verdi. Her iki râvî Zührî'den bu isnadla rivâyet etmişlerdir. Her İkisinin hadîsinde de: «Resûlüllah. (sallallahü aleyhi ve sellem): \"aleyküm\" dedim.» buyurdular» ibaresi vardır. (Vav)'i anmamışlardır",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5658,
			"arabicnumber": "2165.03",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5659,
			"arabicnumber": "2165.04",
			"text": "(Bize bu hadîsi İshâk b. İbrahim rivâyet etti. ki): Bize Ya'la b. Ubeyd haber verdi. ki): Bize A'meş bu isnadla rivâyet etti. Yalnız o Şöyle deditir: hemen maksatlarını anladı ve onlara sövdü. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): ya Âişe! Çünkü Allah çirkin sözü ve çirkin söz söylemeyi sevmez.» buyurdular.»- da ziyade etmiştir: üzerine Allah (azze ve celle) sana gelirlerse, sana Allah'ın vermediği selâmı verirler. İlâh... âyet-i kerîmesini indirdi.» Sûre-i Mücadele, Âyet: 8",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5660,
			"arabicnumber": "2166",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5661,
			"arabicnumber": "2167.01",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Abdülaziz (yani Derâverdi), Süheyl'den, o da babasından, ö da Ebû Hüreyre'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem): Hıristiyanlara evvelâ siz selâm vermeyin. Onlardan birine bir yolda rastlarsanız, onu yolun dar yerine sıkıştırın.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5662,
			"arabicnumber": "2167.02",
			"text": "(Bize Muhammed b. Müsennâ da rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be rivâyet etti. H. Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb dahi rivâyet ettiler. (Dediler ki): Bize Veki', Süfyân'dan rivâyet etti. H. Züheyr b. Harb da rivâyet etti. ki): Bize Cerir rivâyet etti. Bu râvilerin hepsi Süheyl'den bu isnadla rivâyette bulunmuşlardır. Veki'in hadîsinde: rastladığınız vakit.» İbn Ca'ler'in, Şu'be'den rivâyet ettiği hadîste: kitap hakkında ded'ı ki...» Cerir'in hadîsinde ise: rastladığınız vakit...» ibareleri vardır. Ama müşriklerden hiç birinin adını söylememişlerdir. Bâbın Enes, Abdullah b. Ömer ve Hazret-i Âişe hadîslerini Buhârî «İstizan» bahsinde tahrîc etmiştir. Bu rivâyetler ehl-i kitap denilen hıristiyanlarla Yahûdilere rastlandığı zaman selâm hususunda nasıl hareket edileceğini onların selâmının nasıl alınacağını yolda onlarla karşılaşıldığı vakit kendilerine nasıl muamele yapılacağını bildirmektedirler. Ehl-i kitap selâm verdikleri vakit selâmlarının alınacağında ulema ittifak etmişlerdir. Yalnız onlara: «Ve aleykümüsselâm...» denilmez, sadece «aleyküm» sözüyle iktifa edilir. Görülüyor ki: Bâbımız rivâyetlerinin bazısında (vav)'la «ve aleyküm», bazısında da (vav)'sız olarak «aleyküm» denileceği bildirilmiştir. (Vav)'la rivâyeti daha çoktur. Bu takdirde cümleye iki türlü mânâ verilir:",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5663,
			"arabicnumber": "2168.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Hü şeym, Seyyâr'dan, o da Sabit El-Bûnânî’den, o da Enes b. Mâlik'den naklen haber verdi ki: Resûlüllah (sallallahü aleyhi ve sellem) bazı çocukların yanından geçmiş de onlara selâm vermiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5664,
			"arabicnumber": "2168.02",
			"text": "(Bu Hadîsi bana İsmail b. Salim de rivâyet etti, ki): Bize Hüşeym haber verdi. ki): Bize Seyyar bu isnadla haber verdi",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5665,
			"arabicnumber": "2168.03",
			"text": "Bana Amr b. Alî ile Muhammed b. Velîd dahi rivâyet ettiler. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be, Seyyâr'dan rivâyet etti. (Dedi ki): Sabit El-Bünânî ile birlikte yürüyordum. Az sonra bir takım çocukların yanına uğrayarak onlara selâm verdi. Sabit şunu anlattı ki: Kendisi Enes'le beraber yürüyormuş. O da bir takım çocukların yanına uğrayarak onlara selâm vermiş, Enes de anlatmış ki, kendisi Resûlüllah (sallallahü aleyhi ve sellem)'le birlikte yürüyormuş. O da bir, takım çocukların yanına uğrayarak onlara selâm vermiş. hadîsi Buhârî ile Tirmizî «Kitâbu'l-istizan»'da; Nesâî «Elyevm velleyle» bahsinde tahrîc etmişlerdir. Hadîs-i şerif çocuklara selâm vermenin ve tevazu göstererek selâmı herkese ifşa etmenin müstehab olduğuna delildir. Bu hususta bütün ulema müttefiktir. İçlerinde çocuklar bulunan cemaattan bir çocuk selâm alsa, diğerlerinden borç sakıt olur mu, olmaz mı? meselesinde Şâfiîler'den iki kavl rivâyet olunmuştur. Esah kavle göre sakıt olur. Cumhûra göre bir çocuk, bir adama selâm verse alması lâzım gelir. gelince aralarında mahrem bulunmadıkça erkekler kadınlara selâm veremez. Rabîa: «Erkekler kadınlara, kadınlar erkeklere selâm veremez» demiştir. Nevevî bu sözün hata olduğunu söyler. Onun beyânına göre Şâfiiler'le cumhûrun mezhebi şudur: Kadınlar cemâat halinde iseler, erkek onlar selâm, verir. Bir kadınsa, ona başka kadınlar, kendi kocası ve mahremi, câriye ise sahibi selâm verebilirler. Bu hususta kadının güzel veya çirkin olmasının, hükmü yoktur. Kadın yabancı ise kendisinden şehvetlenilmeyecek kadar ihtiyar olduğu takdirde ona selâm vermek, keza onun da erkeğe selâm vermesi'müstehab olur. Birbirlerinin selâmım almak lâzımdır. Kadın genç yahut şehvetlenilecek yaşlılardan ise ecnebi bir erkek ona selâm veremediği gibi, o da erkeğe selâm veremez. Birbirlerine selâm verirlerse cevap beklemeye hakları yoktur",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5666,
			"arabicnumber": "2169.01",
			"text": "Bize Ebû Kâmil El-Câhderî ile Kuteybe b. Saîd her ikisi Abdül-Vâhid'den rivâyet ettiler. Lâfız Kuteybe'nindir. (Dediler ki): Bize Abdül-Vâhid b. Ziyad rivâyet etti. ki): Bize Hasen b. Ubeydillah rivâyet etti. ki): Bize İbrahim b. Süveyd rivâyet etti. ki): Abdurrahman b. Yezid'i dinledim. ki): Ben İbn Mes'ud'u şunu söylerken işittim. Bana Resûlüllah (sallallahü aleyhi ve sellem): yanıma girmek için iznin, perdenin kaldırılması ve benim fısıltımı işitmendir. (Bu) Tâ seni nehyedinceye kadar (böyle) gidecektir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5667,
			"arabicnumber": "2169.02",
			"text": "Bize feu hadîsi Ebû Bekr b. Ebî Şeybe ile Muhammed b. Abdillah b. Nümeyr ve İshâk b. İbrahim dahi rivâyet ettiler. İshâk: Ahberanâ; ötekiler; Haddesenâ tâbirlerini kullandılar. (Dediler ki): Bize Abdullah b. İdris, Hasen b. Ubeydillah'dan bu isnadla bu hadîsin mislini rivâyet etti. hadîs-i şerif bir kimsenin yanına girmek için izin sayılmak üzere konulan alâmete itimad caiz olduğuna delildir. Vali, Kaymakam veya Hâkim gibi bir kimse kapısındaki perdenin kaldırılmasını, umumun girmesi için izin saysa yahut bunu bir taifeye veya sahsa tahsis etse, perdenin kalktığı görüldüğü zaman içeri girmek caizdir. Bir kimse böyle bir alâmeti çocuklarıyle hizmetçilerinin yanına girmeyi için de kullanabilir. Artık perdeyi indirdi mi yanına izinsiz girilemez demektir. Kaldırdığı vakit İzinsiz girilir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5668,
			"arabicnumber": "2170.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb rivâyet et tiler. (Dediler ki): Bize Ubeydullah Nâfi'den, o da İbn Ömer'den, o da Âişe'den naklen rivâyet etti. Âişe şöyle dedi: Üzerine perde çekildikten sonra Sevde hacetini görmek İçin dışarı çıktı. Kendisi cismen bütün kadınlardan uzun vücutlu bir kadındı. Kendisini tanıyanlara gizli kalmazdı. Onu Ömer b. Hattâb gördü ve: Yâ Sevde! Vallahi bizden gizlenemiyorsun! Nasıl dışarı çıkacağına bir bak! dedi. Bunun üzerine Sevde hemen bozularak geri döndü. Resûlüllah (sallallahü aleyhi ve sellem) benim evimde idi. Kendisi akşam yemeği yiyordu. Elinde bir kemik vardı. Sevde içeri girerek: Ya Resûlallah! Ben dışarı çıktım da, Ömer bana şöyle şöyle (lâf-laf) söyledi, dedi. Az sonra Resûlüllah (sallallahü aleyhi ve sellem)'e vahiy geldi. Sonra kendisinden (o ağırlık) kaldırıldı. Kemik hâlâ elinde idi. Onu bırakmamıştı. hal şu ki, size hacetiniz için dışarı çıkmanıza izin verildi.» buyurdular. Bekr'in rivâyetinde: «Cismi bütün kadınlardan uzundu» cümlesi vardır. Ebû Bekr kendi hadîsinde: «Hişâm, yani helaya, dedi.» cümlesini ziyade etti",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5671,
			"arabicnumber": "2170.04",
			"text": "(Bize Abdül-Melik b. Şuayb b. Leys rivâyet etti. ki): Bana babam dedemden rivâyet etti. ki): Bana Ukayl b. Hâlid, İbn Şihab'dan, o da Urve b. Zübeyr'den, o da Âişe'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem)'in zevceleri helaya gitmek istedikleri zaman geceleyin menâsıa çıkarlardı, orası geniş bir yerdi b. Hattab da Resûlüllah (sallallahü aleyhi ve sellem)'e: Kadınlarını ört! diyordu. Ama Resûlüllah (sallallahü aleyhi ve sellem) bunu yapmıyordu. Derken Peygamber (sallallahü aleyhi ve sellem)'in zevcesi Sevde binti Zem'a gecelerden bir gece yatsı zamanı dışarı çıktı. Kendisi uzun bir kadındı. Ömer ona seslendi: Dikkat!.. Seni tanıdık yâ Sevde! (Ömer bunu) tesettür emri indirilsin diye (yaptı). «Bunun üzerine Allah (azze ve celle) tesettürü İndirdi.» demiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5672,
			"arabicnumber": "2170.05",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5673,
			"arabicnumber": "2171",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5674,
			"arabicnumber": "2172.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5675,
			"arabicnumber": "2172.02",
			"text": "(Bana Ebû't-Tâhir de rivâyet etti. ki): Bize Abdullah b. Vehb, Amr b. Haris ile Leys b. Sa'd, Hayve b. Şüreyh ve başkalarından naklen haber verdi ki, bu zevata Yezid b. Ebî Habib bu isnadla bu hadîsin mislini rivâyet etmiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5676,
			"arabicnumber": "2172.03",
			"text": "(Bana yine Ebû’l-Tâhir rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Ben Leys b. Sa'd'ı da şöyle derken işittim. kocanın kardeşi ve kocanın yakınlarından amca oğlu ve emsali gibi benzerleridir. hadîsi Buhârî ile Tirmizî «Nikâh» bahsinde; Nesâî «Kitâbu Işrati'n-Nisa»'da tahrîc etmişlerdir. Damadın babalan ile oğullarından geri kalan akrabasıdır. Tirmizî: «Hamv kocanın babası demek olduğu söylenir. Galiba gelini ile başbaşa kalması mekruh görülmüştür» demiştir. Bu hususta Leys b. Sa'd da şunları söylemiştir: «Lügat ulemâsı ittifak etmiştir ki, hamv: Kadının kocasının babası, amcası, kardeşi, kardeşi oğlu, amcası oğlu ve bunlara benzer akrabasıdır. Hatenler ise: Zevcenin yakınlarıdır. Her ikisinin yakınlarına sıhr denilir.» Ölümdür» cümlesinden murad, ondan fitne ve kötülük gelmesi başkalarından daha fazla mümkündür. Çünkü kimse yadırgamadan kolaylıkla kadının yanına girer çıkar ve onunla başbaşa kalabilir. Binâenaleyh başkalarından daha ziyâde ondan korkulur demektir. diyor ki: «Burada hamvden murad, kocanın babaları ile oğullarından geri kalan akrabasıdır. Babalarla oğullara gelince, onlar karısına mahremdirler. Onlarla bir arada kalması caizdir. Ölümle de vasıf-lanamazlar. Burada murad kardeş, kardeş oğlu, amca, amca oğlu ve bunlara benzer mahrem olmayan kimselerdir. Halkın âdeti bu hususta kayıtsız davranarak tesâhul göstermektir. Bir kimse âdete nazaran kardeşinin kansıyle başbaşa kalır. İşte Ölüm de budur. Böylesi men edilmeye ecnebiden daha lâyıktır. Hadîsin doğru mânâsı da budur...» Iyâz: «Bu hadîsin mânâsı, bir kadının kayınları ile başbaşa kalması, dinde fitne ve helâke sebep olur, demektir. Bunu Resûlüllah (sallallahü aleyhi ve sellem) Ölüm helâkine benzetmiştir. Ve bu söz şiddet makamında söylenmiştir.» diyor",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5677,
			"arabicnumber": "2173",
			"text": "(Bize Harun b. Ma'rut rivâyet etti. ki): Bize Abdullah b. Vehb rivâyet etti, ki): Bana Amr haber verdi. H. Ebû't-Tâhir de rivâyet etti. ki): Bize Abdullah b. Vehb Amr b. Hâris'den naklen haber verdi. Ona da Bekr b. Sevâ de rivâyet etmiş, ona da Abdurrahman b. Cübeyr rivâyet etmiş, ona da Abdullah b. Amr b. Âs rivâyet etmiş ki: Benî Hâşim'den birkaç kişi Esma binti Umeys'in yanına girmişler. Derken Ebû Bekr'i Sıddik, da girmiş. Esma o gün onun nikâhı altında imiş. Ebû Bekr bu zevatı görmüş ve bundan hoşlanmamış. Bunu Resûlüllah (sallallahü aleyhi ve sellem)'e anlatmış ve: hayırdan başka bir şey görmedim» demiş. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): ki, Allah Esma'yi bundan beri kılmıştır.» buyurmuş. Sonra Resûlüllah (sallallahü aleyhi ve sellem) minber üzerinde ayağa kalkarak: günümden sonra sakın bir adam beraberinde bir veya iki kişi olmadan, kocası evde bulunmayan bir kadınin yanına girmesin!» buyurmuşlar. Kocası evde olmayan kadın, demektir. Kocasının şehir hâricinde uzak bir yere gitmesiyle evinden çıkıp şehir içinde bulunması arasında hükmen bir fark yoktur. Nitekim bu kıssada Hazret-i Ebû Bekr evinde bulunmamış, fakat şehirden de dışarı çıkmamıştır. diyor ki: «Hadîsin zahirine bakılırsa beraberinde iki üç kimse bulunan bir adam kendisine ecnebi sayılan bir kadınla bir yerde bulunabilecektir. Ulemamıza göre meşhur olan kavl ise bunun haram olmasıdır. Şu halde hadîs salâh ve doğruluklarından dolayı kendilerinden kötülük beklenmeyen bir cemâat, bir kadının yanına girebilir diye te'vîl olunur. Kâdi Iyâz da bu te'vile benzer bir işarette bulunmuştur.»",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5678,
			"arabicnumber": "2174",
			"text": "(Bize Abdullah b. Mesleme b. Ka'neb rivâyet etti. ki): Bize Hammad b. Seleme, Sabit El-Bûnânî'den, o da Enes'den naklen rivâyet etti ki: Peygamber (sallallahü aleyhi ve sellem) kadınlarından birinin yanında İmiş. Derken yanından bir adam geçmiş. Resûlüllah (sallallahü aleyhi ve sellem) onu çağırmış, adam da gelmiş ve: filân! Bu benini zevcem filancadır.» buyurmuş. Bunun üzerine o zât: Ya Resûlallah! Her kim hakkında zanna kapılırım da, senin hakkında zanna kapılmam! demiş. Resûlüllah (sallallahü aleyhi ve sellem): ki, şeytan insanın kanının aktığı yerden akar!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5679,
			"arabicnumber": "2175.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5680,
			"arabicnumber": "2175.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5681,
			"arabicnumber": "2176.01",
			"text": "Bize Kuteybe b. Saîd, Mâlik b. Enes'den, ona okunanlar meyanında İshâk b. Ahdillah b. Ebî Talha’dan naklen rivâyet etti. Ona da Akîl b. Ebî Talibin azatlısı Ebû Mürre, Ebû Vâkıd El-Leysî'den naklen haber vermiş ki: Resûlüllah (sallallahü aleyhi ve sellem) beraberinde cemâat olduğu halde mescidde otururken üç nefer gelivermiş. Onların ikisi Resûlüllah (sallallahü aleyhi ve sellem)’in yanına gelmişler, biri gitmiş. Bu iki kişi Resûlüllah (sallallahü aleyhi ve sellem)’in başında dikilmişler. Biri halkada bir aralık görerek oraya oturmuş. Diğeri cemâatin arkalarına oturmuş. Üçüncüsü ise dönüp gitmiş. Resûlüllah (sallallahü aleyhi ve sellem) oradan ayrılınca: bu üç kişiyi haber vereyim mi? Bunlardan biri Allah'a sığındı, Allah da onu sığındırdı. Diğeri utandı, Allah da ondan istihya etti. Sonuncuya gelince, o yüz çevirdi. Allah da ondan yüz çevirdi.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5682,
			"arabicnumber": "2176.02",
			"text": "(Ahmed rivâyet etti. ki): Bize Harb (bu zât İbn Şeddat'tır) rivâyet etti. H. İshâk b. Mansûr da rivâyet etti. ki) ; Bize Habban haber verdi. ki): Bize Ebân rivâyet etti. Her iki râvi demişler ki: Bize Yahya b. Ebî Kesir rivâyet etti ki: İshâk b. Abdillah b. Ebî Talha kendisine bu isnadda bu mânâda bu hadîsin mislini rivâyet etmiş. hadîsi Buhârî «Kitâbu’l-ilim» ile «Kitâbu's-SalâU'da; Tirmizî «İstizan» bahsinde; Nesâî «Kitâbu'l-ilim»'de muhtelif râvilerden tahrîc etmişlerdir. hazf vardır. Takdiri şöyledir: Ashâb-ı kirâm: Bu üç kişinin kimler olduğunu haber ver ya Resûlallah! demişler, o da: biri Allah'a sığındı. Allah da onu sığındırdı. Diğeri utandı, Allah da ondan istihya etti. Sonuncuya gelince; o yüz çevirdi. Allah da ondan yüz çevirdi.» diye cevap vermiştir. Görülüyor ki, bu cevaplarda edebiyatçıların mügâkele dedikleri sanat vardır. Verilen cevaplar şekil itibariyle suâle uygun düşüyorsa da mânâ başkadır. Çünkü îva sığındırmak yani evine kabul etmektir. Bu Allahü teâlâ hakkında mütesavver değildir. Binâenaleyh mecazdır. Ve kelimenin lâzimî mânâsı kastedilmiştir ki, o da hayra ulaştırmak istemektir. Yani melzum zikredilmiş, lâzım kasdedilmiştir. Bazıları bunun mânâsı Allah'ın o kimseyi cennetine sığın dır ma sı dır, demişlerdir. Allah'ın istihyası da böyledir. Yani o da Mecâz-ı mürselin melzûmu zikr lâzımı irade nev'indendir. Çünkü utanmak mânâsına gelen haya insana ayıplanacağından korktuğu bir şeyden dolayı âriz olan değişme ve kırgınlıktır. Allahü teâlâ hakkında bu imkânsızdır. Binâenaleyh bununla lâzimî mânâsı olan azabı terk etmek kasdedilmiştir. Allah'ın yüz çevirmesi dahi aynı şekilde mecaz olup bununla Allah'ın gazabı kasdedilmiştir. Böyle zahirî mânâsına hamli mümkün olmayan yerlerde kaide bu gibi lâfızların lâzimî mânâları murad olunmaktır. Hakikî mânâ ile mecazi mânâ arasındaki alâka lüzumdur. Hakikî mânâyı kasdetmekten men eden karine ise akıldır. Çünkü akıl bu gibi şeylerin Allah'dan sâdır olabileceğini tasavvur edemez. Kirmânî buradaki mecazların teşbih olması ihtimâlinden de bahsetmiştir. O halde mânâ şöyle olur: Evine sığındıran, utanan ve yüz çeviren ne yaparsa Allah da onun gibi yapar, demek olur. Yani fiil fiile benzetilmiş olur. yüz çevirmeden murad hiç bir özrü yokken dönüp gitmeye hamledilmiştir. Iyâz şöyle diyor: «Bir kimse Peygamber (sallallahü aleyhi ve sellem)’den yüz çevirir de uzaklaşırsa mü'min değildir. Eğer bu zât mü'min olup dünyevî bir hacetini veya zaruri bir işini görmek için gitti ise Allah'ın onu îrazı af ve rahmetini terk etmesiyle olur. Onun bir hasenesini kabul etmez, kötülüğünü affetmez.»",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5683,
			"arabicnumber": "2177.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Abdullar b. Nümeyr haber verdi. H. İbn Nümeyr de rivâyet etti. ki): Bize babam rivâyel etti. H. Züheyr b. Harb dahi rivâyet etti. ki) Bize Yahya (bu zat Kattan'dır) rivâyet etti. H. İbn Müsennâ da rivâyet etti. ki): Bize Abdül-Vahhat (yani Es-sekafî) rivâyet etti. Bu râvilerin hepsi Ubeydullah'dan rivâyel etmişlerdir. H. Ebû Bekr b. Ebî Şeybe de rivâyet etti. Lâfız onundur. (Ded ki): Bize Muhammed b. Bişr ile Ebû Üsame ve İbn Nümeyr rivâyet ettiler. (Dediler ki): Bize Ebû Üsâme, Hişâm'dun, o da babasından, o di Peygamber (sallallahü aleyhi ve sellem)'ien naklen rivâyet etti: adam bir adamı yerinden kaldınp, sonra oraya oturmasın! Lâkir aralanın, genişleyin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5684,
			"arabicnumber": "2177.02",
			"text": "Bize Ebû'r-Rabî' İle Ebû Kâmil de rivâyet ettiler. (Dediler ki) Bize Hammad rivâyet etti. ki): Bize Eyyûb rivâyet etti. H. Yahya b. Habîb de rivâyet etti. ki): Bize Ravh' rivâyet etti. H. Muhammed b. Râfi' dahi rivâyet etti. ki): Bize Abdürrezzâk rivâyet etti. H. iki râvi İbn Cüreyc'den rivâyet etmişlerdir. H. Muhammed b. Râfi' de rivâyet etti. ki): Bize İbn Ebî Füdeyk rivâyet etti. ki): Bize Dahhâk (yani İbn Osman) haber verdi. râvilerin hepsi Nâfi'den, o da İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen Leys'in hadîsi gibi rivâyette bulunmuşlardır. Fakat hadîste: aralanın, genişleyin...» cümlesini anmamışlardır. İbn Cüreyc hadîsinde: «Ben Cuma gününde mi? dedim. Cuma gününde ve başka günlerde cevabını verdi.» cümlesini ziyade etmiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5685,
			"arabicnumber": "2177.03",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Abdü’l-A'lâ, Ma'mer'den, o da Zührî'den, o da Salimden, o da İbn Ömer'den naklen rivâyet etti ki: Peygamber (sallallahü aleyhi ve sellem): biriniz din kardeşini yerinden kaldırıp, sonra onun yerine oturmasın!» buyurmuşlar. İbn Ömer kendisi için biri yerinden kalkarsa oraya oturmazmış",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5686,
			"arabicnumber": "2177.04",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5687,
			"arabicnumber": "2177.05",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5688,
			"arabicnumber": "2178",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5689,
			"arabicnumber": "2179",
			"text": "Bize Kuteybe b. Saîd rivâyet etti, (Dedi ki» Bize Ebû Avâne haber verdi. Kuteybe şunu Atf söyledi. Bize Abdül'Aziz (yani İbn Muhammed) rivâyet etti. Her iki râvi Süheyl'den, o da haftasından, o da Ebû Hüreyre'den naklen rivâyet etmişler ki: Resûlüllah (sallallahü aleyhi ve sellem): ayağa kalktığı vakit. .» Ebû Avane'nin hadîsinde: «Bİr kimse oturduğu yerden kalkar da, sonra oraya dönerse, o kimse, o yerde hak sahibidir.» buyurmuşlardır. beyanına göre bir kimse mescidde namaz veya başka bir ibâdet için bir yere oturur da sonra abdest almak veya ufak bir iş görmek maksadıyle oradan kalkar ve tekrar dönmeyi niyet ederse, o yerdeki hakkı bâtıl olmaz. Oraya başkası oturmuş olsa bile kaldırmaya hakkı vardır. Oturan kimsenin de kalkması icab eder. Delili bu hadîstir. bazıları yerine oturan kimsenin kalkması vâcib değil, müstehabdır, demişlerdir ki, İmâm-ı Mâlik'in mezhebi budur",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5690,
			"arabicnumber": "2180",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb rivâyet ettiler. (Dediler ki): Bize Veki' rivâyet etti. H. İshâk b. İbrahim de rivâyet etti. ki): Bize Cerir haber verdi. H. Ebû Küreyb dahi rivâyet etti. ki): Bize Ebû Muâviye rivâyet etti. Bu râvilerin hepsi Hişam'dan rivâyet etmişlerdir. H. yine Ebû Küreyb rivâyet etti. Lâfızı şudur: Bize İbn Nümeyr rivâyet etti. ki): Bize Hişâm babasından, o da Zeyneb binti Ümmü Seleme'den, o da Ümmü Seleme'den naklen rivâyet »etti ki: Kadın tabiatlı bir adam evde Resûlüllah (sallallahü aleyhi ve sellem)’in yanında bulunuyormuş. Ümmü Seleme'nin kardeşine: Yâ Abdellah b. Ebî Ümeyye! Yaruı Allah size Tâif'i fethederse sana filancanın kızını göstereceğim. Çünkü o kız dörtle gelir, sekizle gider, demiş. Resûlüllah (sallallahü aleyhi ve sellem) bunu İşitmiş de: «Bunlar sizin yanınıza girmesin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5691,
			"arabicnumber": "2181",
			"text": "(Bize Abd b. Humeyd rivâyet etti. ki): Bize Ab dürrezzâk Ma'mer'den, o da Zührî'den, o da Urve'den, o da Âişe'den nak len haber verdi. Âişe şöyle dedi: Peygamber (sallallahü aleyhi ve sellem)’in zevcelerinin yanına kadın tabiatlı bir adam giriyordu. Onu ihtiyaç sahibi olmayanlardan sayıyorlardı. Derken bir gün Peygamber (sallallahü aleyhi ve sellem) o adam kadınlar in ilan bâzısının yanında iken içeri gird Adam bir kadın tavsif ediyor: Geldiği zaman dörtle gelir, gittiği zaman sekizle gider, diyordı Bunun üzerine Peygamber (sallallahü aleyhi ve sellem): Görüyorum ki; bu adam orada ne vardığını biliyor, sak: sizin yanınıza girmesin!» buyurdular. Artık onu (girmekten) men ettiler. Seleme rivâyetini Buhârî ve «Nikâh», «Libâs ve «Meğazi» bahislerinde; Nesâî «İşratü'n-Nisâ'»'da; İbn Mâce «Nikâh» ve «Hudud» bahislerinde muhtelif râvilerden tahric etmi: lerdir. yahut muhannis ahlâk, hareket ve sözünde kadınlara beı zeyen kimsedir. Bâzan yaratılıştan kadına benzer ve tıpkı kadınlar gil konuşur, onun kadına benzemesi kendi arzusuyla değildir. Bu bir nel hünsa sayılabilir. (Hünsa; hem erkeklik, hem kadınlık uzvu olan kimsedir.) Peygamber (sallallahü aleyhi ve sellem)’in ilk gördüğü zaman birşey dememesi bundandır. Zâten herkes onun cimâa ihtiyacı olmadığı: zannederdi. da doğuştan benzemediği halde kendi arzusuyla kadınlara benzemeye çalışanlar vardır. Bunlara da muhannes denir. İşte bahis mevzi olan ve sahih hadîslerde lanet edildiği bildirilen muhannesler bunlard Bir hadîs-i şerifte: kendini erkeklere benzetenlerine, erkeklerin de kendi kadınlara benzetenlerine Allah lanet etsin!» buyurulmuştur. (sallallahü aleyhi ve sellem)’in evine gelen bu muhannesin ismi meşhur kavle göre Hîfdir. Bazıları Hinb, diğer Bazıları da Mâti' olduğunu söylemişlerdir. Bu bâbda daha başka isimler de zikredilmiştir ki, gelen rivâyetlerden Resûlüllah (sallallahü aleyhi ve sellem)'in bunları çeşitli yerlere surgun ettiği anlaşılıyor. Keibi'nın beyânına göre Hit vasfettiği kız hakkında ileriye giderek: Ağzı papatya çiçeği gibi, oturduğu zaman iki olur. Konuşursa renk saçar, bacaklarının arasındaki, başaşağı çevrilmiş kab gibidir, demiş. Resûlüllah (sallallahü aleyhi ve sellem) bunu işitiyormuş: ona inceden inceye bakmışsın ey Allah'ın düşmanı!» buyurmuş. Sonra kendisini Medine'den Hama'ya sürgün etmiştir. Tâif fethedilince o kız müslüman olmuş ve Abdurrahman b. Avf'la evlenmiştir. Resûlüllah (sallallahü aleyhi ve sellem) dünyâdan gittikten sonra Ebû Bekr (radıyallahü anh) Hît'i Medine'ye kabul etmemiş, Hazret-i Ömer halife olunca bâzı kimseler araya girerek şefaatçi olmuş: Hit artık zayıf, yaşlı ve muhtaç bir kimsedir, diyerek, Medine'ye gelmesine izin verilmesini rica etmişler. Hazret-i Ömer de her Cuma Medîne'ye gelerek dilenmesine, sonra yine yerine gönderilmesine izin vermiştir. Hit'in sürülmesinde üç sebep zikretmişlerdir. Bunlardan biri hadiste beyân edildiği vecihle onun kadına ihtiyâcı olmadığı zannedilmesi, hakikatte ise kadınlara ihtiyâcı olduğu halde gizlemesidir. İkincisi: Kadınların güzelliklerini ve avret yerlerini erkeklerin huzurunda anlatmasıdır. Halbuki bir kadının başka bir kadına kendi kocasının hususiyetlerinden bahsetmesi bile men edilmiştir. Bir erkeğin bir kadını teşhir etmesi ise evleviyetle memnudur. Üçüncüsü Hit'in kadınların mahrem yerlerine varıncaya kadar öğrendiği meydana çıkmıştır. Öyle ki, bu yerleri başka kadınlar bile görüp öğrenemez. İşte bu üç sebeplen dolayı Hit sürgün edilmiştir. Resûlüllah (sallallahü aleyhi ve sellem)’in: sizin yanınıza girmesin!» emriyle bütün muhannesleri kasdetmiştir. Binâenaleyh muhannes olanlar kadınların yanına giremediği gibi, kadınlar da açık saçık onların yanına çıkamaz. Muhannesler şâir kadınlara ihtiyacı olan erkekler hükmündendir. Enenmiş ve âleti kesilmiş erkekler de aynı hükümdedirler. Hît'in, Gaylâ’ın kızını vasfederken dörtle gelir, sekizle gider demesi; gelirken vücudunun kabarık ve pişkin yerleri dört, giderken sekiz görünür manasınadır. Gaylân Tâif'in fethinden soma müslüman olmuş, fakat hicret edememistir. Beyaz tenli, uzun boylu, kumral saçlı, iri ve yakışıklı bir zat olduğu söylenir. Vaktiyle Peygamber (sallallahü aleyhi ve sellem) hakkında Kur'ân buna indirileceğine, iki şehirden birinde büyük bir adama indirilseydi ya! diyenlerden biridir. Kisrâ'ya heyet halinde gönderildiği vakit onunla görüşmüş, Kisrâ onun aklını beğenerek: Senin gıdan nedir? diye sormuş. O da: Buğdaydır! deyince, Kisrâ: Bu akıl buğdaydandır. Sütle kuru hurmadan değildir, demiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5692,
			"arabicnumber": "2182.01",
			"text": "Bize Muhammed b. Âlâ' ile Ebû Küreyb El-Hemdân rivâyet ettiler. (Dediler ki): Bize Ebû Üsâme, Hişâm'dan rivâyet etti ki) ; Bana babam, Esma binti Ebi Bekr'den naklen haber verdi Esma şöyle dedi: Zübeyr benimle evlendi. Ama kendisinin yeryüzünde mal ve köle nâmına atından başka hiçbir şeyi yoktu. Ben onun atına aU veriyor; nafakasına bakıyor, işlerini görüyor, su devesi için çekirdek kırıyor, onun alahnı ve suyunu veriyor, kovasını tamir ediyor, hamur yoğuruyordum. Ekmek yapmayı beceremiyordum. Benim için ensardan bazı komşu kadınlar ekmek yapıyorlardı. Doğru kadınlardı. Zübeyr’e, Resûlüllah (sallallahü aleyhi ve sellem)’in parsellediği yerden çekirdeği başmın üstünde taşıyordum ki bu yer bir fersahın üçte ikisi uzaklıktadır. Bir gün çekirdek başımın üzerinde olduğu halde Resûlüllah (sallallahü aleyhi ve sellem)'e rastladım. Beni çağırdı. Sonra beni arkasına bindirmek için (devesine): Ih!» dedi. Esma, Zübeyr'e: Utandım ama senin kıskançlığını da bilirim, demiş. O da: Vallahi başının üzerinde hurma çekirdeğini taşıman, onunla beraber binmenden daha güçtür, demiş. Esma: Hattâ bundan sonra Ebû Bekr bana bir hizmetçi gönderdi de, o beni at bakıcılığından kurtardı ve sanki beni âzâd etti, demiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5693,
			"arabicnumber": "2182.02",
			"text": "(Bize Muhammed b. Ubeyd El-Ğuberî rivâyet etti. ki): Bizt Hammâd b. Zeyd, Eyyûb'dan, o da İbn Ebî Müleyke'den naklen rivâyet etti ki, Esma şöyle dedi: Zübeyr'in ev hizmetini görüyordum. Bir atı vardı. Ona bakıyordum. Ama bana at bakıcılığından daha güç bir hizmet yoktu. Ona ot veriyor, tımarını yapıyor ve bakıyordum. Râvi diyor ki: Sonra Esmâ'ya bir hizmetçi isabet etti. Peygamber (sallallahü aleyhi ve sellem)’e esirler geldi de, ona da bir hizmetçi verdi. Esma ki: Artık bu hizmetçi beni at bakıcılığından kurtardı. Zübeyr'in nafaka işini de üzerimden attı. bir adam geldi. Ve: Ey Ümme Abdillah! Ben fakir bir adamım, senin evinin gölgesinde mal satmak istiyorum, dedi. Esma (ona): Ben sana müsaade edersem Zübeyr buna razı olmaz. İmdi sen gel de bunu benden Zübeyr'in gözünün Önünde iste! demiş. Arkaciğından adam gelerek: Ey Ümmü Abdillah! Ben fakir bir adamım, senin evinin gölgesinde mal satmak istiyorum, demiş. Esma: Medine'de benim evimden haşka bir yer bulamadın mı? demiş. Bunun üzerine Zübeyr ona: Sana ne oluyor ki, fakir bir adama (malını) satmağa mâni oluyorsun, demiş. Artık (adamcağız) kazanmaya başlayıncaya kadar (orada mal) satmış. (Esma diyor ki): Ben bu cariyeyi ona sattım, parası kucağımda iken Zübeyr yanıma girdi. Ve: Onu bana hibe et, dedi. Ben onu tasadduk ettim, dedim. hadîsi Buhârî «Humus» ve «Nikâh» bahislerinde; Nesâî «İşrâtü'n-Nisâ»'da tahrîc etmişlerdir. Aslında altın ve gümüş gibi milk edinilen şeylerdir. Sonra mitk edinilen her şeye ıtlak edilmiştir. Arablarca ekseriyetle maldan deve kas-dedilir. Çünkü onların en kıymetli malı devedir. Esma'nın saydığı hizmetler hakkında Nevevî şunları söylemiştir: «Bütün bunlar iyilikten ve insanların alışageldiği mürüvvetlerden sayılırlar. Kadın bu sayılan hususâtta kocasına hizmet eder. Ekmek yapar; yiyecek pişirir, çamaşır yıkar ve Hiğer işleri görür. Bunların hepsi kadın tarafından bir teberru' ve kocasına bir iyiliktir. Ama bunlardan hiç biri kadına vâcib değildir. Hattâ hiç birin yapmasa günahkâr olmaz. Bu işlerin hepsini kocasının görmesi iâzım gelir. Hiç biri hakkında kadını ilzam ve mecbur etmesi helâl olamaz. Kndın bunları ancak ve ancak bir teberru olarak yapar ki: Güzel bir âdettir. İslâmın ilk zamanlarından bugüne kadar kadınlar bu âdet üzere devam edegelmişlerdir. Kadına ancak iki şey vâcib olur. Kendini kocasına temkin ve teslimi, bir de onun evinden ayrılmaması.» ıh: Deveyi çöktürmek için söylenen bir söz olup ism-i fiildir. (sallallahü aleyhi ve sellem)'in Hazret-i Zübeyr'e parselleyip verdiği yer Benî Nâdir kabilesinden kalan ganimetlerden olup Medîne'ye üçte iki fersah yani aşağı yukarı yedi sekiz kilometre mesafede idi. Bu yeri ona Medîne'ye gelişinin ilk günlerinde vermişti. bir rivâyetinde Hazret-i Esma'ya babası Ebû Bekr tarafından hizmetçi bir câriye gönderildiği, diğer rivâyetinde ise cariyeyi ona Peygamber (sallallahü aleyhi ve sellem)’in verdiği bildiriliyor. Bu iki rivâyetin arası şöyle bulunmuştur. Câriye esirler arasında Peygamber (sallallahü aleyhi ve sellem)’e getirilmiş. O da onu Hazret-i Esma'ya verilmek üzere babası Ebû Bekr'e teslim etmiştir. Böylece cariyeyi ona Peygamber (sallallahü aleyhi ve sellem) verdi demek mümkün olmuştur. Hazret-i Zübeyr'in: Vallahi başının üzerinde hurma çekirdeğini taşıman, onunla beraber binmenden daha güçtür, sözünün mânâsı: Seni hurma çekirdeği ta-Sirken görenler cimri ve bayağı sanırlar. Bu ise Peygamber (sallallahü aleyhi ve sellem)'in terkisine binmekten daha güç ve ağır bir şeydir. Çünkü sen Peygamber (sallallahü aleyhi ve sellem)’in mahremlerinden onun zevcesi Âişe'nin kız kardeşisin, demektir. Bir de bu hâdisenin kadınlara tesettür farz kılınmazdan önce geçmiş olması muhtemeldir. Esma'nın bunca hizmetlere sabru tahammül göstermesi, kocası Zübeyr ile babası Ebû Bekr'in bu bâbda bir şey demeyip sükût etmeleri cihâd vesâir işlerle meşgul oldukları içindir. Bu gibi mühim işlerden vakit bulup da evlerine bakamıyorlardı",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5694,
			"arabicnumber": "2183.01",
			"text": "(Bjze Yahya b. Yahya rivâyet etti. ki): Mâlik'e, Nâfî'den dinlediğim, onun da İbn Ömer'den rivâyet ettiği şu hadîsi okudum: Resûlüllah (sallallahü aleyhi ve sellem): yerde üç İçişi bulunursa, bîrini bırakıp İkisi gizli konuşmasınlar!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5695,
			"arabicnumber": "2183.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Mu-hanımed b. Bişr ile İbn Nümeyr rivâyet ettiler. H. İbn Nümeyr dahi rivâyet etti. ki): Bize babam rivâyet etti. H. Muhammed b. Müsennâ ile Ubeydullah b. Saîd de rivâyet ettiler. (Dediler ki): Bize Yahya (bu zât İbn Saîd'dir) rivâyet etti. râvilerîn hepsi Ubeydullah'dan rivâyet etmişlerdir. H. Kuteybe ile İbn Rumh dahi Leys b. Sa'd'dan rivâyet ettiler. H. Ebû'r-Rabi' ile Ebû Kâmil de rivâyet ettiler. (Dediler ki): Bize Hammad, Eyyûb’den naklen rivâyet etti. H. İbn Müsennâ da rivâyet etti. ki): Bize Muhammed b. Cafer rivâyet etti. ki): Bize Şu'be rivâyet etti. ki): Ben Şu'be'den dinledim. râvilerin hepsi Nâfi'den, o da İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen Mâlik'in hadîsi mânâsında rivâyette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5696,
			"arabicnumber": "2184.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5697,
			"arabicnumber": "2184.02",
			"text": "Bize bu hadisi İshâk b. ibrahim dahi rivâyet etti. (Dedi'ki) Bize Îsâ b. Yûnus haber verdi. H. İbn Ömer dahi rivâyet etti. ki): Bize Süfyân rivâyet etti Her iki râvi A'meş'den bu isnadla rivâyette bulunmuşlardır. rivâyetleri Buhârî «Kitâbü'l-istîzan»'da tahrîc etmiştir. kişiyi yalnız bırakıp, ikisinin gizli konuşmalarının yasak edilme sindeki hikmet ya kendisini o konuşmaya katmamakla tahkir ettiklerin sandığından yahut aleyhinde konuşuyorlar vehmine kapıldığı içindir. Kalabalık insanlar içinde böyle bir şey hatıra gelmeyeceği için ikisinin gizi konuşmasında beis yoktur. Bir kişiyi yalnız bırakıp üç veya daha fazla kişinin gizli konuşmaları da aynı hükümdedir. Nevevî buradaki neh yin tahrim için olduğunu söylüyor ve: «Aralarından birini bırakıp gizlice konuşmak bir cemaata da haramdır. Meğer ki, o bir kişi buna izin vermiş ola. İbnü Ömer (radıyallahü anh) ile îmam-ı Mâlik'in bizim ulemâmızın ve cumhûrun mezhebine göre buradaki nehiy her zamana hazar ve sefere âmm ve şâmildir. Ulemâdan bazıları yasak ediler gizli konuşmanın sefere mahsûs olduğunu söylemişlerdir. Çünkü sefer korku yeridir. Bazıları da bu hadîsin mensuh olduğunu söylemişlerdir Bu hüküm İslâm'ın ilk zamanlarında vardı. İslâmiyet yayılıp insanlar emniyete kavuşunca nehiy sakıt olmuştur. Bunu ilk zamanlarda mü'minler mahzun etmek için onların karşısında münafıklar yaparlardı. yerde dört kişi bulunup da ikisi gizli konuşursa bilittifak beis yoktur.» diyor",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5698,
			"arabicnumber": "2184.03",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5699,
			"arabicnumber": "2185",
			"text": "(Bize Muhammed b. Ebî Ömer El-Mekkî rivâyet etti. ki): Bize Abdü’l-Aziz Ed-Derâverdi, Yezid'den (Bu zât İbn Abdillah b. Üsâme b. Had'dır.) ö da Muhammed b. İbrahim'den, o da Ebû Seleme b. Abdirrahman'dan, o da Peygamber (sallallahü aleyhi ve sellem)’in zevcesi Âişe'den naklen rivâyet etti ki, Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) hastalandığı vakit onu Cibrîl okur: Seni berî kılan, her hastalıktan sana şifâ veren, hasedliği kabardığı vakit her hasetçinin şerrinden ve her nazarı değenin şerrinden emin eyleyen Allah'ın ismiyle, derdi",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5700,
			"arabicnumber": "2186",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5701,
			"arabicnumber": "2187",
			"text": "Bize Abdullah b. Abdirrahman Ed-Dârimî ile Haccâc b. Şâir ve Ahmed b. Hıraş rivâyet ettiler. (Abdullah: AJıberanâ; ötekiler: Haddesenâ tâbirlerini kullandılar. (Dediler ki): Bize Müslim b. İbrahim rivâyet etti. ki): Bize Vüheyb, İbn Tâvus'dan, o da babasından, o da İbn Abbâs'dan, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti. haktır. Eğer kaderden önce bir şey bulunsa idi, ondan önce nazar bulunurdu. Sizden gusül istenirse yıkayıverin!» buyurmuşlar. hadîsin Ebû Hüreyre rivâyetini Buhârî «Kitâbü't-Tıb» ile «Kitâbü'l-Libâs»'da; Ebû Dâvud «Kitâbü't-Tıb»'da tahrîc etmişlerdir. Bu babda hastaya okumanın caiz olduğu hatta bizzat Cibrîl (aleyhisselâm)’ın Peygamber (sallallahü aleyhi ve sellem)'e okuduğu rivâyet olunuyor. Başka bir hadîste ise Cennet'e hesapsız sualsiz gireceklerin rukye yapmadıkları ve yaptırmak da istemedikleri bildiriliyor. Ruk-ye; hastaya âyet, hadîs ve ezkardan birşeyler okumaktır. Şu halde bu hadîsler arasında birbirlerine muhalefet var gibi görünürse de hakikatta böyle birşey yoktur. Çünkü rukye yapmayanların, yaptırmayanların met-hedilmesi küffârın yaptıkları rukye hakkındadır. Evet, küffârın Arapçadan başka bir dille, mânâsı meçhul birşeyler okuyarak yaptıkları rukye ve efsun çirkin bir şeydir. Bunun küfre yaklaştırmak, hattâ küfre vardırmak tehlikesi melhuzdur. En azından mekruh bir şeydir. Fakat Kur'ân âyetleriyle malûm bir takım ezkârı okumak yasak edilmesi şöyle dursun, sünnettir. bazıları iki hadisin arasım bulmak için aınu söylemişlerdir: Rukye yaptırmak istemeyenlerin methedilmesi, onun efdal olduğunu göstermek ve tevekkülü bildirmek içindir. Rukyeyi yapan ve yapılmasına izin veren Peygamber (sallallahü aleyhi ve sellem) bunun caiz olduğunu bildirmek için yapmıştır. Fakat yapılmaması efdaldir. İbn Abdil-Berr buna kaildir. Aynı kavli başkalarından da rivâyet etmiştir. Fakat Nevevî yukardaki birinci kavlin muhtar olduğunu söylemiş ve: «Ulemâ âyetlerle, zikirlerle rukye yapmanın caiz olduğuna icma bulunduğunu nakletmişlerdir.» demiştir. diyor ki: Allah'ın kitabıyla yahut Allah'ın zikri ile yapıldığı vakit bütün rukyeler caizdir. Ecnebî bir dille yahut mânâsı bilinmeyen bir şeyle yapılırsa yasak edilmiştir. Çünkü bunda küfür olabilir. Ehl-i kitabın yaptığı rukyeler hakkında ihtilâf olunmuştur. Ebû Bekr Sıddik (radıyallahü anh) bunu caiz görmüş. İmâm-ı Mâlik ise değiştirmişlerdir korkusuyla mekruh olduğunu söylemiştir.» bir rivâyette ashâb-ı kirâmın: Ya Resûlallah Sen rükye yapmaktan nehiy buyurdun, dedikleri bildirilmektedir. Fakat ulemâ buna muhtelif cevaplar vermişlerdir. Şöyle ki:",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5702,
			"arabicnumber": "2188",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5703,
			"arabicnumber": "2189.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5704,
			"arabicnumber": "2189.02",
			"text": "(Bize Yahya b. Habibel-Hârisi rivâyet etti. ki): Bize Hâlid b. Haris rivâyet etti. ki): Bize Şu'be Hişâm b. Zeyd'den, o da Enes'den naklen rivâyet etti ki: Bir Yahûdi kadını Resûlüllah (sallallahü aleyhi ve sellem)'e zehirli bir koyun getirmiş, o da ondan yemiş. Müteakiben kadını Resûlüllah (sallallahü aleyhi ve sellem) getirdiler. O da kadına bunun sebebini sormuş. Kadın: Seni öldürmek istedim, cevâbını vermiş. Resûlüllah (sallallahü aleyhi ve sellem): seni bunun üzerine musallat kılacak değildir.» buyurmuş. Râvi ki: Yahut: üzerime musallat kılacak değildir.» dedi. Ashâb: Bu kadını öldürmeyelim mi? demişler: «Hayır» buyurmuş. ki: Artık ben bu alâmeti Resûlüllah (sallallahü aleyhi ve sellem)'in diş etlerinde gördüm durdum",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5705,
			"arabicnumber": "2190.01",
			"text": "(Bize Harun b. Abdillah da rivâyet etti. ki): Bize Şu'be rivâyet etti. ki): Ben Hişâm b. Zeyd'den dinledim. ki): Ben Enes b. Mâlik'i rivâyet ederken dinledim ki: Bir Yahûdi karısı etin içine zehir koynuış. Sonra onu Resûlüllah (sallallahü aleyhi ve sellem)'e getirmiş... Hâlid'in hadîsi gibi rivâyette bulunmuştur. hadîsi Buhârî «Hibe» bahsinde; Ebû Dâvud «Diyât»'da muhtelif râvilerden tahric etmişlerdir. Lehâtın cem'idir. Lehât küçük dil, demektir. Bâzılarına göre insan gülümsediği vakit görünen diş etleridir. muhtelif rivâyetleri vardır. Bir rivâyette Resûlüllah (sallallahü aleyhi ve sellem): bu kol zehirli olduğunu haber veriyor.» buyurmuştur. Eti getiren kadının ismi Zeynep bin ti Haris'dir. Bu kadının âkt-betini bildiren rivâyetler muhteliftir. Bazıları müslüman olduğunu söylemiş, bir takımları bu hâdiseden sonra öldürüldüğünü iddia etmişlerdir. Buradaki rivâyette Peygamber (sallallahü aleyhi ve sellem)'in onu öldürmediği anlaşılıyor. Hazret-iEbû Hüreyre ile Câbir (radıyallahü anh) dan da buna muvafık rivâyetler nakledilmiştir. Fakat Câbir'den gelen bir rivâyette: «Resûlüllah (sallallahü aleyhi ve sellem) onu öldürdü.» denilmiştir. İbn Abbâs (radıyallahü anh)'dan rivâyet edilen bir hadîste: «Peygamber (sallallahü aleyhi ve sellem) bu kadını Bişr b. Bera' b. Magrur'un velîlerine verdi. Bişr bu koyundan yemiş de ölmüştü. Onlar da kadını öldürdüler.» denilmektedir. İbn Suhnûn: «Hadîs ulemâsı Resûlüllah (sallallahü aleyhi ve sellem)’in bu kadını öldürdüğüne ittifak etmişlerdir.» demiştir. Kâdî Iyâz bu rivâyet ve söylentilerin arasını sövle bulmuştur: Resûlüllah (sallallahü aleyhi ve sellem) kadının eti zehirlediğini öğrendiği anda onu öldürmemiş, fakat aynı etten yiven Bişr b. Berâ' ölünce kadını onun velîlerine teslim etmiş. Onlar da kendisini kısâsen öldürmüşlerdir. Binâenaleyh onu öldürmedi, demek doğrudur. Yani derhal öldürmedi, demektir, öldürdü demeleri de doğrudur. Yani sonradan öldürdü, demektir. Enes'in görmekte devam ettiği alâmet herhalde zehirin bıraktığı siyahlık veya yeşillik gibi eser olacaktır. Zehirin tesirinden bazan hasta oluyordu, demek istemiştir. şerîf Peygamber (sallallahü aleyhi ve sellem)’in mucizelerinden biridir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5706,
			"arabicnumber": "2190.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5707,
			"arabicnumber": "2191.01",
			"text": "Bize Züheyr b. Harb ile İshâk b. İbrahim rivâyet ettiler. İshâk ahberanâ; Züheyr ise haddesenâ tâbirlerini kullandılar. Lâfız Züheyr'indir. (Dediler ki): Bize Cerir, A'meş'den, o da Ebû'd-Duhâ'dan, o da Mesrûk'dan, o da Âişe'den naklen rivâyet etti. Âişe şöyle dedi: bir insan hastalandığı vakit Resûlüllah (sallallahü aleyhi ve sellem) ona sağ eli ile mesheder; sonra: insanların Rabbi! Rahatsızlığı gider, şifa ver! Şâfi sensin! Senin şifandan başka şifa yoktur. Hastalık bırakmayan şifa (ver)!» derdi. (sallallahü aleyhi ve sellem) hastalanıp ağırlaştığı vakit ben de onun bize yaptığı gibi yapmak için elini tuttum. Hemen elini elimden çekti, sonra: beni affef! Beni Refîk-i A'lâ ile beraber kıl!» dedi. Ben bir bakayım, dedim. Ne göreyim! O dünyadan gitmiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5708,
			"arabicnumber": "2191.02",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Hüşeym haber verdi. H. Ebû Bekr b. Eti Şeybe ile Ebû Küreyb de rivâyet ettiler. (Dediler ki): Bize Ebû Muâviye dahi rivâyet etti. H. Bişr b. Hâlid dahi rivâyet etti. ki): Bize Muhammed b. Cafer rivâyet etti. H. İbn Beşşâr da rivâyet etti. ki): Bize İbn Ebî Adiyy rivâyet etti. Her iki râvi Şu'be'den rivâyet etmişlerdir. H. Ebû Bekr b. Ebî Şeybe ile Ebû Bekr b. Hallâd dahi rivâyet ettiler. (Dediler ki): Bize Yahya (Bu zât Kattan'dır), Süfyân'dan rivâyet etti. râvilerin hepsi A'meş'den Cerîr'in isnadıyle rivâyette bulunmuşlardır. ile Şu'be'nin hadîsinde: eliyle mesh ederdi.» cümlesi vardır. Sevrî'nin hadîsinde ise: sağ, eliyle mesh ederdi.» demiştir. Yahya'nın Süfyân'dan, onun da A'meş'den rivâyet ettiği hadîsin sonunda «Ben bunu Mansûr'a rivâyet ettim de, o da bana İbrahim'den, o da Mesrûk'dan, o da Âişe'den naklen bu hadîsin benzerini rivâyet etti.» demiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5709,
			"arabicnumber": "2191.03",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5710,
			"arabicnumber": "2191.04",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5711,
			"arabicnumber": "2191.05",
			"text": "(Bana Kasım b. Zekeriyyâ da rivâyet etti. ki): Bize Ubeydullah b. Mûsa, İsrail'den, o da Mansûr'dan, o da İbrahim ile Müslim b. Subeyh'den, onlar da Mesrûk'dan, o da Âişe'den naklen rivâyet etti. Âişe şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) idi. Râvi Ebû Avâne ile Cerîr'in hadîsi gibi rivâyette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5712,
			"arabicnumber": "2191.06",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb dahi rivâyet ettiler. Lâfız Ebû Küreybindir. (Dediler ki): Bize İbn Nümeyr rivâyet etti. ki): Bize Hişâm babasından, o da Âişe'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) şu rukyeyi okurmuş: insanların Rabbi! Rchaîsızlığı gider. Şifâ senin yed-i kudretindedir. Onu senden başka açacak yoktur.»",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5713,
			"arabicnumber": "2191.07",
			"text": "(Bize Ebû Küreyb de rivâyet etti. ki): Bize Ebû Üsâme rivâyet etti. H. İshâk b. İbrahim dahi rivâyet etti. ki): Bize İsâ b. Yûnus haber verdi. iki râvi Hişam'dan bu isnadla bu hadîsin mislini rivâyet etmişlerdir. hadîsi Buhârî «Kitâbü'l-Merdâ ve't-Tıb»'da, Nesâî «Kitâbivl-Merdâ» ile «Elyevm veleyle»'de tahrîc etmişlerdir. meselesini bundan önceki babda gördük. Bu rivâyetler hastaya âyet veya ezkâr okuyacak kimsenin ona sağ eliyle dokunmasının müstehab olduğuna delildir. Bu babda birçok sahîh rivâyetler vardır. İmâm Nevevî bunları «Kitâbü'l-Ezkâr» adlı eserinde toplamıştır. Buradaki rivâyet bunların en güzellerinden biridir. Çünkü hadîsin son cümlesi «İşfi» cümlesinin tamamıdır. Aradaki iki cümle fiille mefulu mutlakm arasına girmiş mu'teriza cümlesidir. «Sekam» kelimesinin nekre olarak kullanılması azaltma bildirmek içindir. «Hastalık bırakmayan tâbirinden murad: Şifây-ı mutlak dilemektir. Zira o hastalıktan düzelir de başka hastalığa yakalanabilir. Şu halde Peygamber (sallallahü aleyhi ve sellem) hastaya mutlak şifâ değil de, şifây-ı mutlak dilermış demek olur",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5714,
			"arabicnumber": "2192.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5715,
			"arabicnumber": "2192.02",
			"text": "Bana Ebû't-Tahir ile Harmele dahi rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus haber verdi. H. Abd b. Humeyd de rivâyet etti. ki): Bize Abdürrezzak haber verdi. ki): Bize Ma'mer haber verdi. H. Muhammed b. Abdillah b. Nümeyr dahî rivâyet etti. ki): Bize Ravh rivâyet etti. H. Ukbe b. Mükrem ile Ahmed b. Osman En-Nevfeli de rivâyet ettiler. (Dediler ki): Bize Ebû Âsim rivâyet etti. Her iki râvi İbn Cüreye'den rivâyet etmişlerdir. ki): Bana Ziyad haber verdi. Bu râvilerin hepsi İbn Şihab'dan Mâlik'in isnadı ile onun hadîsi gibi rivâyette bulunmuşlardır. Mâlik'in hadîsinden başka hiç birinin hadîsinde «Bereketini umarak» kaydı yoktur. Yûnus ile Ziyâd’ın hadîsinde «Peygamber (sallallahü aleyhi ve sellem) hastalandığı vakit kendine muavvizâtı okuyarak üfürür ve eliyle kendini meshederdi.» cümlesi vardır. hadîsi Buhârî «Fedâilül-Kur'ân» bahsinde; Ebû Dâvud ile İbn Mâce «Kitâbü't-Tıb»'da; Nesâî «Tıb», «Tefsir» ve «Kitâbü'l-Yevmi ve'l-Leyle»'de muhtelif râvilerden tahrîc etmişlerdir. Tükürüksüz hafif üfürüktür. Hadis-i şerîf hastaya okurken üfürmenin müstehab olduğuna delildir. Ulemâ bunun caiz olduğuna ittifak etmişlerdir. Sahabe tabiîn ve-onlar dan sonra gelen ulemâ bunu hep müstehab görmüşlerdir. Fakat Kâdî Iyâz ulemâdan bir cemaatın bunu kabul etmediklerini hastaya okurken tükürüksüz üfürmenin caiz olduğunu söylediklerini rivâyet etmiştir. Bu mezheb ve bu lark ancak zayıf bir kavle ibtinâ eder. Zira nefes: Tükürüklü üfürüktür, diyenler olmuştur. Yine Kaâdî'nin beyânına göre ulemâ nefes ile tefel kelimelerinin mânâlarında ihtilâf etmişlerdir. Bazıları: «Bunların ikisi de bir mânâya gelir. Ve ikisi de tükürüklü üfürüktür.» demiş. Ebû Ubeyd tefel-de azıcık tükürük şart olduğunu, nefeste ise hiç tükürük bulunmadığını söylemiştir. Bunun aksini iddia edenler de vardır. Ebû Ubeyd: «Ben Âişe'ye, Peygamber (sallallahü aleyhi ve sellem)’in hasta okurken nasıl üfürdüğünü sordum da: Kuru üzüm yiyen gibi tükürüksüz üfürürdü, cevâbını verdi.» demiştir. Kâdî Iyâz Tefel denilen ıslak üfürüğün faydası bu rutubet ve heva ile teberrüktür, diyor. Mâlik kendine okursa üfürürmüş. Demirle, tuzla rukye yapmayı ve keza hatem-i Süleyman şeklinde yazmayı şiddetle kerih görürmüş. Zîra bunda sihre benzerlik vardır. şerîf Kur'ân ve zikirlerle rukye yapmanın müstehab olduğuna delildir. Muavvizâtdan murad ihlâs ile ondan sonra gelen Felâk ve Nâs sûreleridir. Peygamber (sallallahü aleyhi ve sellem)’in bunları okuması her kötülükten Allah'a sığınmayı tazammun ettikleri içindir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5716,
			"arabicnumber": "2192.03",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Ali b. Müshir, Şeybânî'den, o da Abdurrahman b. Esved'den, o da babasından naklen rivâyet etti. Şöyle dedi: Âişe'ye rukye yapmanın hükmünü sordum da: Resûlüllah (sallallahü aleyhi ve sellem) ensardan bir ev halkına her zehirli mahlûktan dolayı rukye yapmalarına ruhsat verdi, dedi",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5717,
			"arabicnumber": "2193.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Hüşeym Muğire'den, o da İbrahim'den, o da Esved'den, o da Âişe'den naklen haber verdi. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) ensardan bir ev halkına zehirden dolayı rukye yapmalarına ruhsat verdi",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5718,
			"arabicnumber": "2193.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Züheyr b. Harb ve İbn Ebî Ömer rivâyet ettiler. Lâfız İbn Ebî Ömer'indir. (Dediler ki): Bize Süfyân, Abdi Kabbih b. Saîd'den, o da Amra'dan, o da Âişe'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem)'in âdeti şu idi: Bir insan bir yerinden şikâyet ederse yahut kendinde yara veya yaralanma bulunursa Peygamber (sallallahü aleyhi ve sellem) parmağı ile şöyle yapardı: Süfyân şehadet parmağını yere koymuş, sonra kaldırmış: Yerimizin toprağı, bâzımızın tükürüğü ile. Bununla hastamız Rabbimizin izni ile düzelsin diye.» derdi. Ebî Şeybe «yüşfâ» dedi. Züheyr ise «liyüşfâ sakîmünâ» dedi",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5719,
			"arabicnumber": "2194",
			"text": "Bize Ebû Bekr b. Ebi Şeybe ile Ebû Küreyb ve İshâk b. İbrahim rivâyet ettiler. İshâk: Ahberanâ; Ebû Bekr ile Ebû Küreyb ise: Haddesenâ tâbirlerini kullandılar. Lâfız bu ikisinindir. (Dediler ki): Bize Muhammed b. Bişr, Mis'ar'dan rivâyet etti. ki): Bize Ma'bed b. Hâlid, İbn Şeddad'dan, o da Âişe'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) kendisine nazar değmesinden rukye yapmasını emir buyururmuş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5720,
			"arabicnumber": "2195.01",
			"text": "(Bize Muhammed b. Abdillah b. Nümeyr rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Mis'ar bu isnadla bu hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5721,
			"arabicnumber": "2195.02",
			"text": "(Bize İbn Nümeyr de rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Süfyân, Ma'bed b. Hâlid'den, o da Abdullah b. Şeddad'dan, o da Âişe'den naklen rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem)'. değmesinden rukye yapmamı bana emir buyururdu.»",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5722,
			"arabicnumber": "2195.03",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Ebû Hayseme, Âsım-ı Ahvel'den, o da Yûsuf b. Abdillah'dan, o da Enes b. Mâlik'den rukyeler hakkında haber verdi. Enes şöyle dedi: Zehirli hayvan sokmasında, sıraca'da ve nazar değmesinde rukyeye ruhsat verildi",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5723,
			"arabicnumber": "2196.01",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki) Bize Yahya b. Âdem, Süfyân'dan rivâyet etti. H. Züheyr b. Harb dahi rivâyet etti. ki): Bize Humeyd b. Abdirrahman rivâyet etti. ki): Bize Hasen (bu zat İbn Sâlih'dir.) rivâyet etti. iki râvi Âsım'dan, o da Yûsuf b. Abdillah'dan, o da Enes'den naklen rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) nazar değmesine, zehirli hayvan sokmasına ve sıraca hastalığına karşı rukye yapmaya ruhsat verdi. hadîsinde «Yûsuf b. Abdillah b. Haris» denilmiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5724,
			"arabicnumber": "2196.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5725,
			"arabicnumber": "2197",
			"text": "(Bana Ebû'r-Rabi' Süleyman b. Dâvud rivâyet etti. ki): Bize Muhammed b. Harb rivâyet etti. Bana Muhammed b. Velid Ez-Zübeydî, Zührî'den, o da Urve b. Zübeyr'den, o da Zeyneb binti Ümmü Seleme'den, o da Peygamber (sallallahü aleyhi ve sellem)’in zevcesi Ümmü Seleme'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) zevcesi Ümmü Seleme'nin evinde bir cariyenin yüzünde sarılık görerek: cariyeye nazar değmiş, ona hemen rukye yapın. » buyurmuşlar. Yani yüzünde sarılık varmış",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5726,
			"arabicnumber": "2198",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5727,
			"arabicnumber": "2199.01",
			"text": "Ebü'z-Zübeyr ki: Ben Câbir b. Abdillah'i da şunu söylerken işittim: Bizden bir adamı akreb soktu. Biz Resûlüllah (sallallahü aleyhi ve sellem)'le birlikte oturuyorduk. Bunun üzerine bir adam: Ya Resûlallah! Rukye yapayım mı? diye sordu. her kim din kardeşine fayda verebilirse bunu yapsın» buyurdular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5728,
			"arabicnumber": "2199.02",
			"text": "(Bana Saîd b. Yahya El-Ümevî de rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize İbn Cüreyc bu isnadla bu hadîsin mislini rivâyet etti. Yalnız o şöyle dedi: üzerine cemaattan bir adam: Ona rukye yapayım ya Resûlallah! dedi.» (Sadece) Rukye yapayım, demedi",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5729,
			"arabicnumber": "2199.03",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Saîd El-Eşecc rivâyet ettiler. (Dediler ki): Bize Veki' Â'meş'den, o da Ebû Süfyân'dan, o da Câbir'den naklen rivâyet etti. Câbir Şöyle dedi: Benim bir dayım vardı. Akrebe karşı rtıkye yapardı. Derken Resûlüllah (sallallahü aleyhi ve sellem) rukyeyi yasak etti. Müteakiben ona gelerek: Ya Resûlallah! Gerçekten Sen rukyeyi yasak ettin, ama ben akrebe karşı rukye yapıyorum, dedi. Bunun üzerine: her kim din kardeşine fayda verebilirse bunu yapsın!»buyur-dular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5730,
			"arabicnumber": "2199.04",
			"text": "(Bize bu hadîsi Osman b. Ebî Şeybe de rivâyet etti, ki): Bize Cerir, A'meş'den bu isnadla bu hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5731,
			"arabicnumber": "2199.05",
			"text": "(Bize Ebû Küreyb rivâyet etti. ki): Bize Ebû Muâviye rivâyet etti. ki): Bize A'meş, Ebû Süfyân'dan, o da Câbir'den naklen rivâyet etti. Câbir Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) rukyeyi yasak etti. Derken Amr b. Hazm oğulları Resûlüllah (sallallahü aleyhi ve sellem)'e gelerek: Ya Resûlallah! Gerçekten elimizde bir rukye vardı. Akrebe karşı onu yapıyorduk. Sen de rukyeyi yasak ettin, dediler. Ve bu rukyeyi ona gösterdiler. Bunun üzerine: beis görmüyorum. Sizden her kim din kardeşine fayda verebilirce hemen fayda versin!» buyurdular. rivâyetleri Buhârî, Nesâî veİbn Mâce “Kitâbü't-Tıb»'da tahric etmişlerdi;-. İnsanın yanlarında çıkan ve sıraca denilen yaralardır. Zehir, demektir. Burada bundan her nevi zehirli hayvan kas-dedilmiştir. üçüncü rivâyetini teşkil eden Hazret-i Âişe hadîsinin mânâsı şudur: Peygamber (sallallahü aleyhi ve sellem) şehadet parmağı ile kendi tükrüğünü alır, sonra parmağım toprağa sürerek ona. yerden bir şeyler yapışmasını sağlar, sonra yara veya hasta olan yeri onunla sıvazlar, bir yandan da bu duayı okurdu. Yerimizin toprağından murad butun yeryüzü ise de bâzılarına göre bereketinden dolayı bununla hassaten Medîne’nin toprağı kastedilmiştir. Nazar değmesi, demektir. Bazıları bunun şeytan çarpması, yahut cinlerin nazar etmesi mânâsına geldiğini söylemişlerdir. Hattâbî: «Cinlerin nazarı oktan daha süratli geçer.» demiştir. bâzılarında: «Peygamber (sallallahü aleyhi ve sellem) ruk-yeye ruhsat verdi.» denilmesinden anlaşılıyor ki: Evvelce onu yasak et-migmiş. Bu babda İbn Şihâb şunları söylemiştir: «Duydum ki, ulemâdan bazı kimseler: «Peygamber (sallallahü aleyhi ve sellem) Medine'ye gelinceye kadar rukyeyi yasak etmişti. O zamanlar rukyede birçok şirk sözleri bulunurdu. Medine'ye geldiği vakit ashabından bir zâtı zehirli hayvan soktu. Ashab: Ya Resûlallah! Haznı oğulları zehire karşı rukye yaparlardı. Sen rukyeyi yasak edince onlar da bıraktı, dediler. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem): Ümâre'yi çağırın!» dedi. Ümâre, Bedir gazasına iştirak etmişti. Resûlüllah (sallallahü aleyhi ve sellem): rukyeni göster!» dedi. O da rukyesini arzetti. Peygamber (sallallahü aleyhi ve sellem) onda bir beis görmeyerek izin verdi, demişlerdir.» (sallallahü aleyhi ve sellem)’in: ne oluyor ki, kardeşim oğullarının cisimlerini erimiş görüyorum.» sözünden muradı: Cafer (radıyallahü anh)’in çocuklarıdır. rivâyetler mezkûr dertlere karşı rukye yapmanın müstehab olduğuna delildirler. Ulemânın beyânına göre rukye manevî bir tebâbet idi. Herhangi bir hastalıktan dolayı halk ağzı dualı salâh ve takva sahibi zevata müracaat eder, kendilerini onlara okutmakla şifâ ararlardı. Sonraları rukye için ehil zevat azalınca maddî tababete müracaat ettiler. Ve bu tababet günümüze kadar sürüp gçldi",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5732,
			"arabicnumber": "2200",
			"text": "(Bana Ebû't-Tâhir rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Muâviye b. Salih Abdurrahman b. Cübeyr’den, o da babasından, o da Avı b. Mâlik El-Eşcaî'den naklen haber verdi. Şöyle dedi: Biz câhiliyyet devrinde rukye yapardık. Bilâhare: Ya Resûlallah! Bu hususta ne buyururdun? dedik. rukyenizi gösterin! İçerisinde şirk olmadıkça rukyede bir beis yoktur.» buyurdular. hadîs dahi yukarküer gibi rukyenin caiz olduğuna delildir. Hîüc-mü: Yukarki rivâyetler meyânında görülmüştür",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5733,
			"arabicnumber": "2201.01",
			"text": "(Bize Yahya b. Yahya Et-Temîmî rivâyet etti. ki): Bize Hüseyin, Ebû Bişr'den, o da Ebü'l-Mütevekkil'den, o da Ebû Saîd-i Hudrî'den naklen haber verdi ki: Resûlüllah (sallallahü aleyhi ve sellem)’in ashabından bizi kimseler bir seferde imişler ve Arab mahallelerinden bir mahalleye uğrayarak onlardan kendilerini misafir etmelerini istemişler. Fakat onlar misafir etmemişler. Ve bunlara: İçinizde rukyeci var mı? Çünkü mahallenin ağasını zehirli hayvan sokmuştur. Yahut isabet almıştır, demişler. İçlerinden bir adam: Evet! cevâbını vermiş ve ağaya vararak ona Fâtihâ ile rukye yapmış. Ar kaçığın dan adam iyileşmiş. Bu zâta bir sürü koyun vermişler. Fakat o koyunları kabul etmek istememiş ve: Bu meseleyi Peygamber (sallallahü aleyhi ve sellem)’e anlatayım da, ondan sonra bakarız, demiş. Müteakiben Peygamber (sallallahü aleyhi ve sellem)’e gelerek bunu ona anlatmış ve: Ya Resûlallah! Vallahi Fatiha'dan başka bir şeyle rukye yapmadım, demiş. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) gülümsemiş ve: rukye olduğunu nereden bildin?» demiş. Sonra: «Onlardan (koyunları) alın, bana da sizinle beraber bir hisse ayırın!», buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5734,
			"arabicnumber": "2201.02",
			"text": "Bize Muhammed b. Beşşâr ile Ebû Bekr b. Nâfi ikisi birden Gunder Muhammed b. Cafer'den, o da şu'be'den, o da Ebû Bişr'den bu isnadla rivâyette bulunmuşlardır. Bu hadîste o: «Fâtihâ'yı okumaya başladı. Tükürüğünü topluyor ve tükürüyordu. Derken adam iyileşti.» demiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 5735,
			"arabicnumber": "2201.03",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5736,
			"arabicnumber": "2201.04",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5737,
			"arabicnumber": "2202",
			"text": "Bana Ebû't-Tâhir ile Harmele b. Yahya rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihâb'dan naklen haber verdi. ki): Bana Nâfi' b. Cübeyr b. Mut'ım, Osman b. Ebî'l-Âs, Es-Sekati'den naklen haber verdi ki: Osman müslüman olalıdan beri vücudunda hissettiği bir ağrıdan Resûlüllah (sallallahü aleyhi ve sellem)'e şikâyette bulunmuş. Resûlüllah (sallallahü aleyhi ve sellem) kendisine: vücudunun ağıran yerine koy ve üç defa Bismillah de! Yedi defa da hissettiğim ve sakındığım ağrının şerrinden Allah'a ve kudretine sığınırım de!» buyurmuşlar. (sallallahü aleyhi ve sellem)’in: vücudunun ağıran yerine koy İlâh...» buyurması hastaya fayda verecek şey rukyeyi yapan kimsenin ağıran yeri eliyle sıvazlaması olduğuna irşad içindir. Bunun Peygamber (sallallahü aleyhi ve sellem)’e mahsus olduğu da rivâyet edilmemiştir. Binâenaleyh her rukye yapanın bu surette hareket etmesi gerekir. Şerif hastaya rukye yaparken sağ elini ağaran yerinin üzerine koymanın ve buradaki duayı okumanın müstehab olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5738,
			"arabicnumber": "2203.01",
			"text": "(Bize Yahya b. Halef El-Bâhilî rivâyet etti. ki): Bize Abdü’l-A'lâ, Saîd El-Cüreyrî'den, o da Ebû'l-A'lâ'dan naklen rivâyet etti ki, Osman b. Ebi'l-Âs Peygamber (sallallahü aleyhi ve sellem)'e gelerek: Ya Resûlallah! Muhakkak şeytan benimle namazımın ve kıraatimin arasına girdi. Onu bana karıştırıyor, dedi. Resûlüllah (sallallahü aleyhi ve sellem) de: Hinzeb denilen bir şeytandır. Onu hissettiğin vakit ondan Allah'a sığın ve sol tarafına üç defa tükür.» buyurdu. Osman: Ben bunu yaptım; Allah da onu benden giderdi, demiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5739,
			"arabicnumber": "2203.02",
			"text": "(Bize bu hadîsi Muhammed b. Müsenna rivâyet etti, ki): Bize Salim b. Nuh rivâyet etti. H. Ebû Bekir b. Ebû Şeybe de rivâyet etti. ki): Bize Ebû Üsâme rivâyet etti. iki râvi Cüreyrî'den, o da Ebû'l-A'lâ'dan, o da Osman b. Ebî'l-Âs'dan naklen rivâyet etmişlerdir ki: Osman, Peygamber (sallallahü aleyhi ve sellem)'e gelmiş... yukarki hadîsin mislini nakletmiştir. Salim b. Nuh'un hadîsinde «üç defa» kaydını zikretmemiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5740,
			"arabicnumber": "2203.03",
			"text": "(Bana Muhammed b. Rafi'de rivâyet etti. ki): Bize Abdürrezzâk rivâyet etti. ki): Bize Süfyân, Saîd El-Cüreyrî'den naklen haber verdi. ki): Bize Yezid b. Abdillah b. Şihhîr, Osman b. Ebi'l-As Es-Sakafi'den rivâyet etti. ki): Ben: Ya Resûlallah ! dedim... sonra râvi yukarkilerin hadîsi gibi zikretmiştir. kelimesi; Hinzeb, hanzeb ve hunzeb şekillerinde de okunmuştur. Bu şeytanın namazı karıştırması şüpheye düşürmek suretiyle olur. Artık nazamı kılan üç rekât mı, yoksa dört mü kıldığında tereddüt eder. Araya girmekten murad da namazın huşu ve huzuruna, lezzetine mâni olmaktır. Hadîs-i şerîf kalbine vesvese gelen kimsenin şeytandan Allah'a sığınmasının müstehab olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5741,
			"arabicnumber": "2204",
			"text": "Bize Harun b. Ma'ruf ile Ebû't-Tâhir ve Ahmed b. İsa rivâyet ettiler. (Dediler ki): Bize İbni Vehb rivâyet etti. ki): Bana Amr (bu zat İbn Hâris'dir.) Abdü Rabbih b. Saîd'den, o da Ebû'z Zübeyr'den, o da Câbir'den, o da Resûlüllah (sallallahü aleyhi ve sellem)'den naklen haber verdi ki: derdin bir devası vardır. Derdin devasına rastlanırsa Allah (Azze ve Celte)'nin izniyle düzelir.» buyurmuşlar. hadîste hastalığa karşı İlâç kullanmasının müstehab olduğuna işaret vardır. Cumhûr ulemânın mezhebi de budur. Iyâz diyor ki: «Bu hadîslerde din ve dünya ilimlerinden cümleler ve tıb ilminin sahîh olduğu, ilaçlanmanın cevazı ve bu hadîslerde de bildirilen şeylerle ilaçlanmanın müstehab oluşu görülüyor, Yine bu hadîslerde tedaviyi inkâr eden Gulât-ı sofiyye'ye fed cevabı vardır. Bunlar her şey Allah'ın kaza ve kaderiyledir, Binâenaleyh tedaviye hacet yoktur, derler. Ulemânın hücceti bu hadîslerdir. Onlar yaratanın Allah olduğuna itikad ederler. Ama tedavinin de Allah'ın kaderinden sayıldığına inanırlar. Bu mesele duâ, kâfirlerle harb, korunmak ve göre göre tehlikeye atılmaktan sakınmak hususundaki emirlere benzer. Halbuki ecel değişmez. Mukadderat mutlaka vuku bulur.» de şunları söylemiştir: «Müslim bu çok hadîsleri tıb ve ilâç bahsinde zikretmiştir. Kalbinde maraz olan kimseler bunların bâzısına itiraz etmiş ve şöyle dedilerdir: Doktorlar balın müshil olduğuna ittifak ediyorlar. O halde kendisinde ishal bulunan kimseye ne demeli! Yine doktorlar hummalı kimsenin soğuk su kullanmasının helâka yakın tehlikeli olduğuna ittifak ediyorlar. Çünkü soğuk su mesameleri bir araya toplar, Buhârî içeri tıkar ve harareti cismin içerisine çevirir. Böylece telefe sebep olur. Bunlar Zatü’l-Cenp hastalığının Kust denilen otla tedavi edileceğini de İnkâr eder ve tehlikeli görürler. Halbuki, bu otta şiddetli hararet vardır...» Mâzirî bu itirazların yersiz olduğunu beyandan sonra hadîslerin şerhine geçiyor ve sadedinde bulunduğumuz hadîsi şöyle izah ediyor: «Bu hadîste açık izahat vardır. Zira malûmdur ki doktorlar: Hastalık cismin tabiî mecrasından çıkmasıdır; tedavi ise cismi tabiî mecrasına iadedir, derler. Hıfzıssıhha cismin tabiî mecrasında kalmasıdır. O halde sıhhati korumak, yiyecekleri ve sâireyi isîâh ile cismi tabiî mecrasına döndürmek de hastalığa zıt olan muvafık ilâçlarla olur. Bukrat eşya zıtlarıyla tedavi edilir, demiştir. Lâkin bazan hastalığın ha-kîkatı ile ilâcın hakîkatı ince ve karışık olur da hastalığa zıt ilâca itimad azalır. Doktorun hatası da buradan ileri gelir. Bazan ilâcın hararetli maddeden olduğunu sanır. Halbuki ilâç başka maddedendir. Yahut ilâcın soğuk maddeden olacağını sanır. Halbuki değildir. Bundan dolayı şifâ hâsıl olmaz. îşte Peygamber (sallallahü aleyhi ve sellem) hadîsin sonunda: Derdin devasına rastlanırsa düzelir... sözüyle hadîsin başındaki beyanâtına edilebilecek itiraza tenzib buyurmuştur. Şayet: Ya Resûlallah! Sen her derdin devası vardır, dedin ama biz, birçok hastaların tedavi gördükleri halde düzelmediklerini görüyoruz, denilirse, O da: Bu ancak tedavinin hakikati bilinmediği içindir. Yoksa ilâç bulunmadığı için değil» şeklinde cevap vermiş gibidir.»",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 5742,
			"arabicnumber": "2205.01",
			"text": "Bize Harun b. Ma'rut ile Ebû't-Tâhir rivâyet ettiler. (Dediler ki): Bize İbn Vehb rivâyet etti. ki): Bana Amr haber verdi. Ona da Bükeyr, ona da Âsim b. Ömer b. Katâde rivâyet etmiş ki, Câbir b. Abdillah Mukannaİ dolaşmış, sonra: Sen kan aldırmadıkça buradan ayrılmam. Çünkü ben Resûlüllah (sallallahü aleyhi ve sellem)'i: şifâ vardır.» buyururken işittim, demiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 5743,
			"arabicnumber": "2205.02",
			"text": "(Bana Nasr b. Alî El-Cehdamî rivâyet etti. ki): Bana babam rivâyet etti. ki) ; Bana Abdurrahman b. Süleyman, Asım b. Ömer b. Katâde'den rivâyet etti. Şöyle dedi: Câbir b. Abdillah bize, ailemiz İçine geldi. Bir adam elindeki çıbanlardan yahut yaralardan şikâyet ediyordu. Câbir: Şikâyetin nedir? dedi. Adam: Bendeki çıbanlar... Beni çok zorluyor, dedi. Bunun üzerine Câbir: Ey çocuk. Bana bir haccam getir, dedi. Adam ona: Haccâmı ne yapacaksın? Yâ Ebâ Abdillah! diye sordu. Câbir: Oraya bir hacemat şişesi takmak istiyorum, cevâbını verdi. Adam: Vallahi bana sinekler konuyor. Yahut elbise ilişiyor da eziyet veriyor. Ve bana güç geliyor, dedi. Câbir onun bundan tiksindiğini görünce şunu söyledi: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: sizin ilâçlarınızdan bir şeyde hayır varsa, bu ya neşter vuruşunda, ya bal şerbetinde, yahut ateşle dağlamaktadır.» buyururken işittim. Resûlüllah (sallallahü aleyhi ve sellem): ben dağlanmayı sevmemi» buyurdular. Bunun üzerine hizmetçi bir haccâm getirerek ona neşter vurdu. Çektiği elem de ondan gitti",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 5744,
			"arabicnumber": "2206",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 5745,
			"arabicnumber": "2207.01",
			"text": "(Bize Osman b. Ebî Şeybe de rivâyet etti. ki): Bize Cerîr rivâyet etti. H. İshâk b. Mensûr dahi rivâyet etti. ki): Bize Abdurrahman haber verdi. ki) ; Bize Süfyân haber verdi. Her iki râvi A'meş’den bu İsnadla rivâyette bulunmuşlar, fakat «Ondan bir damar kesti» cümlesini anmamışlardır",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 5746,
			"arabicnumber": "2207.02",
			"text": "(Bana Bişr b. Hâlid de rivâyet etti. ki): Bize Muhammed (yani Ibnî Cafer) Şu'be'den rivâyet etti. ki): Ben Süleyman'dan dinledim. ki): Ben Ebû Süfyân'dan dinledim. ki): Ben Câbir b. Abdillah'dan dinledim. Şunu söyledi: Azhab (harbi) günü Übey kolundaki can damarından vuruldu da, Resûlüllah (sallallahü aleyhi ve sellem) onu dağladı",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 5747,
			"arabicnumber": "2207.03",
			"text": "(Bize Ahmed b. Yûnus rivâyet etti. ki): Bize Züheyr rivâyet etti. ki): Bize Ebû'z-Zübeyr, Câbir'den rivâyet etti. Bize Yahya b. Yahya da rivâyet etti. ki): Bize Ebû Hayseme, Ebû'z-Zübeyr'den, o da Câbir'den naklen haber verdi. Câbir Şöyle dedi: Sa'd b. Muâz can damarından vuruldu da, Peygamber (sallallahü aleyhi ve sellem) onu elindeki uzun demirle dağladı. Sonra şişti. Ve onu ikinci defa dağladı",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 5748,
			"arabicnumber": "2208",
			"text": "(Bana Ahmed b. Saîd b. Sahr Ed-Dârimî rivâyet etti. ki): Bize Habbân b. Hilâl rivâyet etti. ki): Bize Vüheyb rivâyet etti. ki): Bize Abdullah b. Tavus babasından, o da İbn Abbâs'dan naklen rivâyet etti ki: Peygamber (sallallahü aleyhi ve sellem) kan aldırmış ve haccâma ücretini vermiş ve burnuna ilâç damlatmış",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 5749,
			"arabicnumber": "1202.04",
			"text": "Bize bu hadîsi Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb rivâyet ettiler. (Ebû Bekr bize Veki' rivâyet etti; Ebû Küreyb ise bize Veki' haber verdi dediler.) Lâfız Ebû Küreyb'indir. (Veki') Mis'ar'dan, o da Amr b. Amir El-Ensârî'den naklen haber vermiş. ki): Ben Enes b. Malik'i şunu söylerken işittim: Resûlüllah (sallallahü aleyhi ve sellem) kan aldırdı. Ücreti hususunda kimseye zulmetmezdİ",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 5750,
			"arabicnumber": "1577.04",
			"text": "Bize Züheyr b. Harb Ve Muhammed b. Müsennâ rivâyet ettiler. (Dediler ki): Bize Yahya (Bu zat İbn Saîd'dir.) Ubeydullah'dan rivâyet etti. ki): Bana Nâfi', İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen haber verdi ki: cehennemin kükremesindendir. Binâenaleyh onu su ile serin-' Jetin.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 5751,
			"arabicnumber": "2209.01",
			"text": "(Bize İbn Nümeyr de rivâyet etti. ki): Bize babamla Muhammed b. Bişr rivâyet ettiler. H. Ebû Bekr b. Ebî Şeybe dahi rivâyet etti. ki): Bize Abdullah b. Nümeyr ile Muhammed b. Bişr rivâyet ettiler. (Dediler ki) ; Bize Ubeydullah, Nâfi'den, o da İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti: hummanın şiddeti cehennemin kükremesindendir. Binâenaleyh onu su ile serinletin.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 5752,
			"arabicnumber": "2209.02",
			"text": "(Bana Harun b. Saîd El-Eylî de rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Mâlik rivâyet etti. H. Muhammed b. Râfi’ dahi rivâyet etti. ki): Bize İbn Ebî Füdeyk rivâyet etti. ki): Bize Ihıhhâk (yani İbn Osman) haber verdi. iki râvi Nâfi'den, o da İbn Ömer'den naklen rivâyet etmişler ki: Resûlüllah (sallallahü aleyhi ve sellem); cehennemin kükremesindendir. Binâenaleyh siz onu su ile söndürün.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 5753,
			"arabicnumber": "2209.03",
			"text": "(Bize Ahmed b. Ahdillah b. Hakem rivâyet etti. ki): Bize Muhammed b. Cafer rivâyet etti. ki) ; Bize Şu'be rivâyet etti. H. Harun b. Abdülah dahi rivâyet etti. Lâfız onundur. ki): Bize Bavh rivâyet etti. ki): Bize Şu'be, Ömer b. Muhammed b. Zeyd'den, o da babasından, o da İbn Ömer'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem): Cehennemin kükremesindendir. Binâenaleyh sız onu su ile söndürün.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 5754,
			"arabicnumber": "2209.04",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 5755,
			"arabicnumber": "2210.01",
			"text": "(Bize İshâk b. İbrahim de rivâyet etti. ki): Bize Hâlid b. Haris ile Abde b. Süleyman hep birden Hişâm'dan bu isnadla bu hadîsin mislini haber verdiler",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 5756,
			"arabicnumber": "2210.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 5757,
			"arabicnumber": "2211.01",
			"text": "(Bize Ebû Bekr b. Ebi Şeybe rivâyet etti. ki): Bize Abde b. Süleyman, Hişâm'dan, o da Fâtıme'den, o da Esmâ'dan naklen rivâyet etti ki: Esma'ya hummadan mustarib bir kadın getirilir, o da su isteyerek, onu yakasına döker ve: Gerçekten Resûlüllah (sallallahü aleyhi ve sellem): su ile serinletin.» Bir de: Cehennemin kükremesindendir.» buyurdular, dermiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 5758,
			"arabicnumber": "2211.02",
			"text": "(Bize bu hadîsi Ebû Küreyb de rivâyet etti. ki) ; Bize ilmi ile Ebû Üsâme, Hişâm'dan bu İsnadla rivâyet ettiler. İbn Nüme yr'in hadîsinde: kadınla yakasının arasına döktü.» cümlesi vardır. Ebû Üsâme'-nin hadîsinde: Cehennemin kükremesindendir.» cümlesini zikretmemiştir. Ahmed dedi ki: İbrahim şunu söyledi: Bize Hasen b. Bişr rivâyet etti. ki): Bize Ebû Üsâme bu İsnadla rivâyet etti",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 5759,
			"arabicnumber": "2212.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Muhammed b. Müsennâ, Muhammed b. Hatim ve Ebû Bekr b. Nâfl1 rivâyet ettiler. (Dediler ki): Bize Abdurrahman b. Mehdî Süfyân'dan, o da babasından, o da Abâye b. Kifâa'dan naklen rivâyet etti. ki): Bana Râfi' b. Hadic rivâyet etti. ki): Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: Cehennemin kükremesindendir. Binâenaleyh siz onu su ile kendinizden serinletin.» buyururken İşittim. Ebû Bekr: «Sizden..,» kaydını zikretmedi ve şöyle dedi: «Bana Râfi’ b. Hadîc haber verdi, dedi.» hadîsin bazı rivâyetlerini-bütün sünen sahipleri «Kitâbü't-Tıb»'da tahrîc etmişlerdir. Nevevî bazı mülhidlerin bu hadîslerde gösterilen tedâvî şekillerinin bir kısmına itiraz ettiklerini söylemiş ve Calinos gibi bazı eski hekimlerin sözlerinden misaller getirerek kendilerine cevap vermiştir. Biz bu itiraz ve cevapların nakline lüzum görmedik. Müslümana gereken Peygamber (sallallahü aleyhi ve sellem)'in verdiği habere inanmaktır. Bugün hâlâ birçokları nazariye olmaktan ileriye geçemeyen cüce bilgilerle âlemlere rahmet olarak gönderilen Peygamber (sallallahü aleyhi ve sellem) Efendimize itirazda bulunmak ne iman şerefine yakışır, ne de İslâm'ın yüksek terbiye ve nezâketine! Şu halde Resûlüllah (sallallahü aleyhi ve sellem): derdin devası vardır.» buyurduysa mutlaka vardır. Bugün henüz çaresiz dertler varsa devası keşfedilemediğindendir. Resûlüllah (sallallahü aleyhi ve sellem) kan aldırmanın ve dağlamanın birer tedâvî şekli olduğunu haber verdiyse, onlar mutlaka birer sahîh tedâvî şeklidir. Bunların bu asırda tıb âleminden kalkmış olması hadîsin sıhhatine asla dokunamaz. Çünkü az yukarda îzah ettiğimiz vecihle his ve tecrübeye istinad eden bilgilerin ekseriyetle istinadgâhlan nazariyelerdir. Onlara yüzde yüz îtimad etmeye ise imkân yoktur. Meselâ: Bugün gülmek, neşelenmek hayat kaynağıdır diye bir nazariye ortaya çıkar, yarın bakarsınız bunun tam aksini iddia eden bir nazariye çıkmıştır. Ağlamanın vücut için daha faydalı olduğundan bahseder. Binâenaleyh bunlara itimad olunamaz. Resûlüllah (sallallahü aleyhi ve sellem)'in haber verdiği bir şeyin imkânsız olduğu aklen ve şer'an sabit olursa bu takdirde o haber bizim için müteşâbihattan olur. Ve İslâm'ın ruhuna aykırı olmamak şartiyle te'vil edilebilir. Iyâz diyor ki ; «Bu hadîslerde din ve dünya ilimleri ve tababetin sahih olduğu haber veriliyor. Tedavinin caiz olduğu ve bilhassa hacamat ve ilâç içmek, damar kesmek ve rukye yapmak suretiyle tedâvî görmenin müstehab olduğu anlaşılıyor. (sallallahü aleyhi ve sellem)’in: indiren Allah, devayı da indirmiştir.) hadîs-i şerifi insanlara tedâvîyi bildirmekte ve ona izin vermektedir... doktorlar Resûlüllah (sallallahü aleyhi ve sellem)'in neşter vurmak, bal içmek ve ateşle yakmak tabirleriyle bütün tedâvî şekillerine işaret buyurduğunu söylemişlerdir.» Cehennemin kükremesinden sayılması meselesine gelince: Bazılarına göre bu bir teşbihtir. Cehennem ateşi nasıl yakıcı, yıkıcı ve harâb edici ise humma da öyledir. Bedeni eritir, harâb eder, denilmek istenmiştir. Yahut bu hadîs; humma Cehennemden bir numunedir, manasınadır. Fakat bir takım ulemâya göre hadîs-i şerîf teşbih değil, hakikattir. Hastanın vücudunda hâsıl olan şiddetli hararet ve yangın Cehennemden bir cüzdür. Cenâb-i Hak bunu kullar ibret alsın diye gösterir. Tîybî: «Feyh hararetin feveranıdır. Hadîste iki vecih vardır. Birinci veçhe göre bu bir teşbihtir. Vücut hararetinin kaynarcasına şiddetlenip, soğukluğu gidermesi Cehenneme benzetilmiştir. İkinciye göre: Bâzı ulemâ hummanın hakikaten Cehennem hararetinden alındığını, inkâr edenleri korkutmak, ibret alanlara müjde olmak üzere dünyaya gönderildiğini söylemişlerdir. Çünkü kulların günahlarına keffâret olur.» diyor. Iyâz'ın beyânına göre Resûlüllah (sallallahü aleyhi ve sellem)’in hummalı kimsenin üzerine su serperek serinletilmesin! emir buyurması hekimlerin bu babdaki iddiasına muhaliftir. Ve onu reddeder. Kâdî Iyâz: «Hazret-i Esma ile diğer müslümanlar bunun faydası olduğunu tecrübe etmeseydüer onu kullanmazlardı.» diyor. rivâyetler Cehennemin hâlen yaratılmış olduğuna da delildirler. Ki: Ehl-i Sünnetin mezhebi de budur",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 5760,
			"arabicnumber": "2212.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 5761,
			"arabicnumber": "2213",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 5763,
			"arabicnumber": "2214.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 5765,
			"arabicnumber": "287.05",
			"text": "(Bize Muhammed b. Rumh b. Muhacir rivâyet etti. ki): Bize Leys, Ukayl'den, o da İbn Şilıâb'dan, naklen haber verdi. ki): Bana Ebû Seleme b. Abdirrahman ile Saîd b. Müseyyeb haber verdiler. Onlara da Ebû Hüreyre haber vermiş ki: Kendisi Resûlüllah (sallallahü aleyhi ve sellem)'i şöyle buyururken işitmiş: çörek otunda her derde deva vardır. Yalnız sâm müstesna!» Sâm, ölüm demektir. Habbe-i Sevda da Çörek otu'dur",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 5766,
			"arabicnumber": "2215.01",
			"text": "Bana bu hadîsi Ebû't-Tâhir ile Harmele dahi rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihâb'dan, o da Saîd b. Müseyyeb'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen haber verdi. H",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 5767,
			"arabicnumber": "2215.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Amr'un-Nâkıd, Züheyr b. Harb ve İbn Ebî Ömer de rivâyet ettiler. (Dediler ki): Bize Süfyân b. Uyeyne rivâyet etti. H. Abd b. Humeyd dahi rivâyet etti. ki): Bize Abdurrezzâk haber verdi. ki): Bize Ma'mer haber verdi. H. Abdullah b. Abdirrahman Ed-Dârimi de rivâyet etti. ki): Bize Ebû’l-Yeman haber verdi. ki).: Bize Şuayb haber verdi. râvilerin hepsi Zührî'den, o da Ebû Seleme'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen Ukayl'in hadîsi gibi rivâyette bulunmuşlardır. Süfyân ile Yûnus'un hadîslerinde «El-habbetüssevdâ» demiş, «Şûnîz» dememiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 5768,
			"arabicnumber": "2215.03",
			"text": "Bize Yahya b. Eyyûb ile Kuteybe b. Saîd ve İbn Hucr'da rivâyet ettiler. (Dediler ki): Bize İsmail (Bu zât İbn Cafer'dir.), Alâ'dan, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuşlar: bir dert yoktur ki, çörek otunda ona şifâ bulunmasın, yalnız ölüm müstesna!» hadîsi Buhârî ile İbn Mâce «Kitâbü’t-Tıb»'da tahrîc etmişlerdir. Çörekotu demektir. Buna şûniz, şûnûz, şînîz ve şehniz de denilir. Hasan-i Basri'nin Elhabbetüssevdâ hardaldır dediği, bâzılarının da çitlenbik olduğunu söyledikleri rivâyet olunursa da Kurtubî: «Habbe-i Sevdayı Çörekotu diye tefsir etmek iki vecihle evlâdır. Biri ekser ulemânın kavli olması, diğeri de faydasının çokluğudur. Hardalla çitlenbikte bu faydalar yoktur.» demiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 5769,
			"arabicnumber": "2216",
			"text": "(Bize Abdü'l-Melik b. Şuayb b. Leys b. Sa'd rivâyet etti. ki): Bana babam dedemden rivâyet etti. ki): Bana ükayl b. Hâlid, İbn Şihâb'dan, o da Urve'den, o da Peygamber (sallallahü aleyhi ve sellem)’in zevcesi Âişe'den naklen rivâyet etti ki: Yakınlarından biri Ölür de cenazesine kadınlar toplanır, sonra dağılırlar. Ve yalnız Ölenin ailesi ile yakınları kalırsa bir çömlek bulamaç emreder de pişirilirmiş. Sonra tirit yapılır; bulamaç onun üzerine dökülürmüş. Bundan sonra Âişe (kadınlara) şöyle dermiş: Bundan yeyin! Çünkü ben Resûlüllah (sallallahü aleyhi ve sellem)'i: hastanın kalbini rahatlandırır. Bâzı üzüntüleri giderir.» buyururken işittim. hadîsi Buhârî «Et'ıme» ve «Tıb» bahislerinde; Tirmizî «Kitâbü't-Tıb»'da; Nesâî «Velîme» ve «Tıb» bahislerinde muhtelif râvilerden tahrîc etmişlerdir. undan veya kepekten yapılan bulamaçtır. İçerisine çok defa bal da konurmuş. Rengi beyaz olduğu için buna sütleme mânâsına gelen Telbîne adı verilmiştir. şerif üzüntülü kimselere bulamaç yedirmenin müstehab olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 5770,
			"arabicnumber": "2217.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 5771,
			"arabicnumber": "2217.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 5772,
			"arabicnumber": "2218.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlik'e Muhammed b. Münkedir ile Ömer b. Ubeydillah'ın azatlısı Ebû'n-Nadr’dan dinlediğim, onların da Âmir b. Sa’d b. Ebî Vakkâs'dan, onun da ba basından naklen rivâyet ettiği şu hadîsi okudum. Âmir, babasını Üsâme b. Zeyd'e: Sen Resûlüllah (sallallahü aleyhi ve sellem)’den taun hakkında ne işittin? diye sorarken dinlemiş. Üsâme şunu söylemiş: Resûlüllah (sallallahü aleyhi ve sellem): bir ricz yahut bir azabdir. Benî İsrail'e yahut sizden öncekilere gönderilmiştir. Bir yerde onun zuhur ettiğini işittiniz mi oraya gitmeyin! Bir yerde zuhur ederse siz de orada bulunursanız, ondan kaçmak için oradan çıkmayın!» buyurdular. «Sizi ancak ondan kaçmak çıkarır.» demiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 5773,
			"arabicnumber": "2218.02",
			"text": "Bize Abdullah b. Mesleme b. Ka'neb ile Kuteybe b. Saîd rivâyet ettiler. (Dediler ki): Bize Muğîre (İbn Ka'neb nesebini de belirterek İbn Abdirrahman El-Kureşî dedi.) Ebû'n-Nadr'dan, o da Âmir b. Sa'd b. Ebî Vakkâs'dan, o da Üsâme b. Zeyd'den naklen haber verdi. Üsâme şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): azab alâmetidir. Allah (azze ve celle) onunla kullarından bâzı kimseleri imtihan eder. Onu işittiniz mi, bulunduğu yere girmeyin. Bir yerde zuhur eder de, siz de orada bulunursanız ondan kaçmayın» buyurdular. hadîs Ka'nebî'nindir. Kuteybe'ninki de onun gibidir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 5774,
			"arabicnumber": "2218.03",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 5775,
			"arabicnumber": "2218.04",
			"text": "(Bana Muhammed b. Hatim rivâyet etti. ki): Bize Muhammed b. Bekr rivâyet etti. ki): Bize İbn Cüreyc haber verdi. ki): Bana Amr b. Dinar haber verdi. Ona da Âmir b. Sa'd haber vermiş ki: Bir adam Sa’d b. Ebî Vakkas'a taunu sormuş da Üsâme b. Zeyd: Onu sana ben haber vereyim. Resûlüllah (sallallahü aleyhi ve sellem): Allah'ın Benî İsrail'den bir taifeye yahut sîzden önce geçen bâzı insanlara gönderdiği bir azab yahut riczdir. Bir yerde onu işittiniz mî oraya onun üzerine girmeyin! Bir yerde sîzin üzerinize girerse, ondan kaçarak oradan çıkmayın!» buyurdular, demiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 5776,
			"arabicnumber": "2218.05",
			"text": "Bize Ebû'r-Rabi1 Süleyman b. Dâvud ile Kuteybe b. Saîd de rivâyet ettiler. (Dediler ki): Bize Hammâd (Bu zât Zeyd'dir.) rivâyet etti. H. Ebû Bekr b. Ebi Şeybe dahi rivâyet etti. ki): Bize Süfyân b. Uyeyne rivâyet etti. iki râvi Amr b. Dinar'dan, İbn Cüreyc'in isnadı ile onun hadîsi gibi rivâyette bulunmuşlardır",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 5777,
			"arabicnumber": "2218.06",
			"text": "Bana Ebut'-Tahir Ahmed b. Amr ile Harmele b. Yahya rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihab'dan naklen haber verdi. ki): Bana Âmir b. Sa'd, Üsâme b. Zeyd'den, o da Resûlüllah (sallallahü aleyhi ve sellem)’den naklen haber verdi ki, şöyle buyurmuşlar: bu ağrı veya hastalık bir azabdır. Onunla sîzden önceki bâzı ümmetler azab olunmuşlar; ondan sonra yeryüzünde kalmıştır. Bâzan gider, bâzan gelir. Her kim onun bir yerde zuhur ettiğini işitirse sakın onun üzerine gitmesin. Ve her kim onun zuhur ettiği yerde bulunursa, sakın ondan kaçmak içirt kendisini oradan çıkarmasın!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 5778,
			"arabicnumber": "2218.07",
			"text": "(Bize bu hadîsi Ebû Kâmil El-Cahderî de rivâyet etti. ki): Bize Abdü'l-Vâhid (yani İbn Ziyâd) rivâyet etti. ki): Bize Ma'mer, Zührî'den Yûnus'un isnadı ile onun hadîsi gibi rivâyette bulundu",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 5779,
			"arabicnumber": "2218.08",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 5780,
			"arabicnumber": "2218.09",
			"text": "(Bize bu hadîsi Ubeydullah b. Muâz dahi rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Şu'be bu isnadla rivâyet etti. Şu kadar var ki o, hadîsin başındaki Ata' b. Yesar kıssasını anmadı",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 5781,
			"arabicnumber": "2218.10",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 5782,
			"arabicnumber": "2218.11",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 5783,
			"arabicnumber": "2218.12",
			"text": "(Bana bu hadîsi Vehb b. Bakıyye dahi rivâyet etti. ki): Bize Hâlid (yani Tahhân) Şeybânî'den, o da Habîb b. Ebî Sâbit'ten, o da ibrahim b. Sa'd b. Mâlik’den, o da babasından, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen yukarkilerin hadîsi gibi haber verdi. hadîsi Buhârî «Kitâbü'l-Enbiya»'da tahrîc etmiştir. Taun: Vücûdun dirsek, koltuk, el ve parmak gibi yerlerinde çıkan ve şiddetli ağrılara, şişkinliklere sebep olan yaralardır. Yaranın etrafı siyah, yeşil veya menekşe rengi olur. Hastada kalb çarpıntısı ve kusmak gibi araz görünür. Bâzılarına göre taundur. Muhakkak ulemâya göre ise yeryüzünün bir tarafında mûtadın hilâfına zuhur eden pek çok insanların yakalandığı bir hastalıktır. Başka zamanlarda hastalıklar muhtelif olduğu halde vebada yalnız bir nevi olur. Bu zevata göre taunla veba arasında umum ve husus mutlak vardır. Her taun vebadır. Fakat her veba taun değildir. Bu hadîslerde taunun Benî İsrail'e azâb olarak gönderildiği bildirilmektedir. Müslümanlar için ise rahmetdir. Tâun bu ümmet İçin bir rahmet ve şehâdettir. Buhârî ile Müslim'in rivâyet ettikleri bir hadîs de: ölen şehiddir...» denildiği gibi, başka bir hadîste de: bir azâb idi. Allah onu dilediğinin üzerine gönderirdi. Nihayet onu mü'minlere rahmet yaptı. Eğer bir kul tauna tutulur da bulunduğu yerde sabrederek bekler, Allah'ın takdirinden başka kendisine bir şey isabet etmiyeceğini bilirse, o kimseye şehîd ecri kadar sevab verilir.» buyurulmuştur...» diyor. şerifteki riczden murad da azabdır. Râvi ricz mi, yoksa azab mı denildiğinde ve keza Benî İsrail'e mi, yoksa sizden öncekilere mi buyurulduğunda şekketmiştir. rivâyetlerde taun hastalığı zuhur eden yere girmek ve taundan kaçmak için o yerden çıkmak yasak edilmektedir. Kaçmak için değil de arızî bir sebeple o yerden çıkmakta beis yoktur. Cumhûr ulemânın kavli budur. Hattâ Hazret-i Âişe (radıyallahü anha); kaçmak, harbden kaçmak gibidir.» demiştir. Ulemâdan Bazıları taun hastalığı bulunan yere girmeyi ve ondan kaçmak için o yerden çıkmayı caiz görmüşlerdir. Bu kavil Hazret-i Ömer'le, Ebû Mûsa’l-Eş'ârî, Mesrûk ve Esved b. Hilâl'den rivâyet olunmuştur. Hattâ Amr b. Âs’ın: «Bu azabdan geçitlere, vadilere ve dağ tepelerine kaçın!» dediği rivâyet olunur. Bunlar hadîsteki nehyi te'vil ederek: «Resûlüllah (sallallahü aleyhi ve sellem) tâunlu beldeye girip çıkmayı mukadder olmayan bir şey başa gelir korkusuyla yasak etmemiştir. Lâkin fitne çıkmasın, halk o yere gelen kimsenin helâkini gelişine, kaçanın selâmetini de kaçışma bağlamasın diye nehiy buyurmuştur...» derler. diyor ki: «Sahîh olan yukarda arzetiğimiz gibi taun zuhur eden yere girmenin ve taundan kaçmak için o yerden çıkmanın men edilmesidir. Çünkü sahîh hadîslerin zahiri bunu gösterir.» kaçmak için değil de, herhangi bir iş veya meşguliyetle o yerden dışarı çıkmak bütün ulemâya göre caizdir. ancak ondan kaçmak çıkarır...» diye terceme ettiğimiz cümlesi bâzı nüshalarda merfu' bâzılarında mensub olarak rivâyet edilmiştir. Fakat gerek ibare gerekse mânâ itibariyle ikisi de müş-kildir. Kâdî Iyâz: «Bu rivâyet lisan âlimlerine göre zayıftır, mânâyı bozmaktadır. Çünkü zahirine göre herhangi bir sebeple tâunlu yerden çıkmak memnu, yalnız taundan kaçmak için çıkmak memnu değildir, mânâsına gelir ki, bu da maksadın tam zıddıdır.» diyor. bir cemâat bu cümledeki «illâ»nın râvi tarafından yanlışlıkla getirildiğini söylemişlerdir. Hadîsin doğru şekli sair rivâyetlerde olduğu gibi, onu hazfederek okumaktır. şerîf zararlı şeylerden ve onların sebeplerinden korunmaya, âfet ve musibet zamanında Allah'ın kazasına teslimiyet göstermeye teşvik etmektedir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 5784,
			"arabicnumber": "2219.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 5785,
			"arabicnumber": "2219.02",
			"text": "Bize İshâk b. İbrahim İle Muhammed b. Râfi' ve Abd b. Humeyd de rivâyet ettiler. İbn Râfi': Haddesenâ; ötekiler Ahberanâ tâbirlerini kullandılar. (Dediler ki): Bize Abdürrezzak haber verdi. ki): Bize Ma'mer bu isnadla Mâlik'in hadisi gibi haber verdi. Ma'mer'in hadisinde şu ziyâde vardır: ki): Ona şunu da söyledi: Ne buyurursun! Verimli yeri bırakıp çorak yeri otlatsa bunu onun beceriksizliğine verir miydin? Evet! cevâbını verdi. O halde yürü, dedi. Ve yürüdü, nihayet Medine'ye geldi de: Mahal yahut menzil inşaallah burasıdır, dedi.»",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 5786,
			"arabicnumber": "2219.03",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 5787,
			"arabicnumber": "2219.04",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 5788,
			"arabicnumber": "2220.01",
			"text": "Bana Ebû't-Tâhir İle Harmele b. Yahya rivâyet ettiler. Lâfız Ebû't-TAhir'indir. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus haber verdi. Şihab dedi ki: Bana da Ebû Seleme b. Abdirrahman Ebû Hüreyre'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem)'. bulaşması, karın kurdu ve baykuş yoktur.» buyurduğu vakit bir bedevi: Ya Resûlallah ! O haîde develere ne oluyor ki, kumda geyik gibi oluyorlar da, uyuzlu deve gelip aralarına geliyor ve hepsine uyuz bulaştırıyor, demiş. Resûlüllah (sallallahü aleyhi ve sellem) ; birinciye kim bulaştırdı?» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 5789,
			"arabicnumber": "2220.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 5790,
			"arabicnumber": "2220.03",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 5791,
			"arabicnumber": "2221.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 5792,
			"arabicnumber": "2221.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 5793,
			"arabicnumber": "2221.03",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 5794,
			"arabicnumber": "2220.04",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 5795,
			"arabicnumber": "2222.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 5796,
			"arabicnumber": "2222.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 5797,
			"arabicnumber": "2222.03",
			"text": "(Bana Abdullah b. Hâşim b. Hayvan da rivâyet etti. ki): Bize Behz rivâyet etti. ki): Bize Yezîd (bu zat Tüsterî'dir.) rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): bulaşması, gûl ve karın kurdu yoktur.» buyurdular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 5798,
			"arabicnumber": "2223.01",
			"text": "(Bize Abd b. Humeyd rivâyet etti. ki): Bize Abürrezzâk rivâyet etti. ki):Bize Ma'mer, Zühri'den, o da Ubeydullah b. Abdillah b. Utbe'den naklen haber verdi ki: Ebû Hüreyre şöyle dedi: Ben Peygamber (sallallahü aleyhi ve sellem)'i: yoktur. Onun en hayirlısı faldır.» buyururken işittim. Ya Resûlallah! Fal nedir? denildi. hanginizin işittiği güzel sözdür.» buyurdular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 5799,
			"arabicnumber": "2223.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 5800,
			"arabicnumber": "2224.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 5801,
			"arabicnumber": "2224.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 5802,
			"arabicnumber": "2223.03",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 5803,
			"arabicnumber": "2223.04",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 5804,
			"arabicnumber": "2225.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 5805,
			"arabicnumber": "2225.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 5806,
			"arabicnumber": "2225.03",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 5807,
			"arabicnumber": "2225.04",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 5808,
			"arabicnumber": "2225.05",
			"text": "(Bana Harun b. Abdillah da rivâyet etti. ki): Bize Ravh b. Ubâde rivâyet etti. ki): Bize Şu'be bu isnadla bu hadîsin mislini rivâyet etti. Ama (Hak) kelimesini söylemedi",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 5809,
			"arabicnumber": "2225.06",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 5810,
			"arabicnumber": "2226.01",
			"text": "(Bize Abdullah b. Mesleme b. Ka'neb rivâyet etti. ki): Bize Mâlik Ebû Hâzim'den, o da Sehl b. Sa'd'dan naklen rivâyet etti. Sehl Şöyle dedi; Resûlüllah (sallallahü aleyhi ve sellem) uğursuzluğu kastederek: varsa kadında, atta ve meskendedir» buyurdular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 5811,
			"arabicnumber": "2226.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Fadl b. Dükeyn rivâyet etti. ki): Bize Hişâm b. Sa'd Ebû Hâzim'den, o da Sehl b. Sa'd'dan, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 5812,
			"arabicnumber": "2227",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 5813,
			"arabicnumber": "537.03",
			"text": "Bana Ebû't-Tâhir ile Harmele b. Yahya rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihab'dan, o da Ebû Seleme b. Abdirrahman b. Avf'dan, o da Muâviye b. Hakem Es-Sülemî'den naklen haber verdi. Muâviye şöyle dedi: Ben: Ya Resûlallah! Bir takım şeyleri biz câhiliyyet devrinde yapıyorduk, kâhinlere gidiyorduk, dedim. kâhinlere gitmeyin!» buyurdu. Ben: Teşe'ümde bulunuyorduk, dedim. sizden birinizin nefsinde bulduğu bir şeydir. Sakın size mâni olmasın!» buyurdular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 5814,
			"arabicnumber": "537.04",
			"text": "(Bana Muhammed b. Râfi' de rivâyet etti. ki): Bana Huceyn (yani İbn Müsennâ) rivâyet etti. ki): Bize Leys Ukayl'den rivâyet etti. H. İshâk b. İbrahim İle Abd b. Humeyd de rivâyet ettiler. (Dediler ki): Bize Abdürrezzâk haber verdi. ki): Bize Ma'mer haber verdi. H. Ebû Bekr b. Ebî Şeybe dahi rivâyet etti. ki): Bize Şebâ-be b. Sevvâr rivâyet etti. ki): Bize İbn Ebî Zi'b rivâyet etti. H. Muhammed b. Râfi' de rivâyet etti. ki): Bize İshâk b. İsa haber verdi. ki): Bize Mâlik haber verdi. Bu râvilerin hepsi Zührî'den bu isnadla Yûnus'un hadîsi mânâsında rivâyette bulunmuşlardır. Yalnız Mâlik kendi hadîsinde teşe'ümü zikretmiştir. Ama onda kâhinler zikredilmemiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 5815,
			"arabicnumber": "537.05",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 5816,
			"arabicnumber": "2228.01",
			"text": "(Bize Ahd b. Humeyd rivâyet etti. ki): Bize Abdürrezzâk haber verdi. ki): Bize Ma'mer Zührî'den, o da Yahya b. Urve b. Züheyr'den, o da babasından, o da Âİşe'den naklen haber verdi. Âişe şöyle dedi: Ben: Ya Resûlallah! Kâhinler bize bir şey söyler de onu hakikat bulurduk, dedim. doğru olan sözdür, onu cinni kapar da velîsinin kulağına atar; ona yüz tane de yalan katar.» buyurdular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 5817,
			"arabicnumber": "2228.02",
			"text": "(Bana Seleme b. Şebîb rivâyet etti. ki): Bize Hasen b. A'yen rivâyet etti. ki): Bize Ma'kil (bu zât İbn Ubeydil-lah'dır) Zührî'den rivâyet etti. ki): Bana Yahya b. Urve haber verdi ki: Urve'yi şöyle derken işitmiş: Âişe şunu söyledi: Bir takım insanlar Resûlüllah (sallallahü aleyhi ve sellem)'e kâhinleri sordular, Resûlüllah (sallallahü aleyhi ve sellem) de onlara: bir şey değildirler.» cevâbını verdi. Ya Resûlallah! Onlar hazan birşey söylüyorlar da hakikat çıkıyor, dediler. Resûlüllah (sallallahü aleyhi ve sellem); söz cinlerdendir. Cinni onu kapar da velîsinin kulağına tavuğun gıdaklaması gibi gıdaklar. 8u suretle ona yüz yalandan daha fazlasın? karıştırırlar.» buyurdular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 5818,
			"arabicnumber": "2228.03",
			"text": "(Bana Ebû't-Tâhir de rivâyet etti. ki): Bize Abdullah b. Vehb haber verdi. ki): Bana Muhammed b. Amr, İbn Cüreyc’den, o da İbn Şihab'dan naklen bu isnadla Ma'kıl'ın Zührî'den rivâyeti gibi haber verdi",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 5819,
			"arabicnumber": "2229.01",
			"text": "(Bize Hasen b. Ali El-Hulvânî ile Abd b. Humeyd rivâyet ettiler. Hasen: Bize Ya'kub rivâyet etti, dedi. Ya'kub ki): Bize babam Sâlih'den, o da İbn Şihab'dan naklen rivâyet etti. ki): Bana Ali b. Hüseyn rivâyet etti ki: Abdullah b. Abbâs şunları söylemiş: Bana Peygamber (sallallahü aleyhi ve sellem)’in ashabından ensar-dan bir zat haber verdi ki, kendileri bir gece Resûlüllah (sallallahü aleyhi ve sellem)’le birlikte otururlarken bir yıldız göçmüş ve ortalık aydınlanmış. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) onlara: bir şey göçtüğü vakit cahiliyye devrinde ne derdiniz?» diye sormuş. Allah ve Resûlü bilir. Biz bu gece büyük bir adam doğdu ve bu gece büyük bir adam öldü derdik, cevâbını vermişler. Resûlüllah (sallallahü aleyhi ve sellem): ne bir kimsenin ölümü için göçer, ne de hayatı için. Lâkin Rabbimiz Tebâreke ve Teâlâ bir şey takdir buyurdumu arşı taşıyan melekler tesbih eder. Arkasından onlardan sonra gelen gök ehli tesbih eder. Tâ ki tesbih şu alt semânın sakinlerine ulaşır. Sonra arşı taşıyanların arkasından gelenler arşı taşıyanlara: Rabbiniz ne buyurdu? diye sorarlar. Onlar da ne buyurduğunu kendilerine haber verirler. Böylece semâvât sakinleri birbirleriyle haberleşir, nihayet haber şu alt semâya ulaşır. Ve cinler işitileni kaparak onu velîlerine aktarır ve bu yıldızla taşlanırlar. Olduğu gibi getirdikleri (haber) haktır. Lâkın onlar ona yalan karıştırırlar ve ziyâde ederler.»",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 5820,
			"arabicnumber": "2229.02",
			"text": "(Bize Züheyr b. Harb da rivâyet etti. ki): Bize Velid b. Müslim rivâyet etti. ki): Bize Ebû Amr'Evzâî rivâyet etti. H. Ebû't-Tâhir ile Harmele de rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus haber verdi. H. Seleme b. Şebib dahi rivâyet etti. ki): Bize Hasen b. A'yen rivâyet etti. ki): Bize Ma'kıl (yani İbn Ubeydillah) rivâyet etti. râvilerin hepsi Zührî'den bu isnadla rivâyette bulunmuşlardır. Şu kadar var ki Yûnus: «Abdullah b. Abbâs'dan rivâyet olunmuştur. ki): Bana Resûlüllah (sallallahü aleyhi ve sellem)’in ashabından ensar-dan bir takım adamlar haber verdi.» demiştir. Evzâî'nin hadîsinde: «Lâkin ona yalan karıştırırlar ve ziyâde ederler.» Yûnus'un hadîsinde ise: «Lâkin onlar ona ilâve ve ziyâde ederler.» denilmiştir. Yûnus'un hadîsinde şu ziyâde de vardır: «Allah buyurdu ki: Nihayet kalblerinden korku giderilince: Rabbiniz ne buyurdu? diye sorarlar. (Onlar da): söyledi, derler.\" Sebe' Sûresi, Âyet: 23 hadîsinde ise Evzâîrnin dediği gibi: «Lâkin onlar bu habere yalan karıştırır ve ziyâde ederler.» cümlesi vardır. semâdan kaptığı sözü velîsi yani dostu olan kâhine tavuğun gıdaklamasına benzer bir şekilde aktarmasını Hattâbî ile diğer bâzı âlimler şöyle izah etmişlerdir: «Cinnî işittiklerini kâhinin kulağına söylerken onu diğer şeytanlar da işitirler. Nitekim tavuk arkadaşlarına bir şey bulduğunu sesiyle bildirir. Onlar da ona cevâp verirler. Burada bir vecih daha var ki o da şudur: Rivâyet yani şişenin şırıltısı gibi şeklinde olabilir. Bu takdirde cinnî kâhinin kulağına sürahideki suyun çıkardığı ses gibi şırıltılı bir sesle söyler demek olur.»",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 5821,
			"arabicnumber": "2230",
			"text": "(Bize Muhammed b. Müsennâ El-Anezî rivâyet etti. . ki): Bize Yahya (yani İbn Saîd) Ubeydullah'dan, o da Nâfi'den, o da Safiyye'den, o da Peygamber (sallallahü aleyhi ve sellem)'in bir zevcesinden, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti: kim bir ar rafa gelir de ona bir şey sorarsa, kırk gecelik namazı kabul olunmaz.» buyurmuşlar. kâhinlerden sayıldığını yukarda görmüştük. Esir Arrâf gibi bildiğini iddia eden müneccim -yahut kâhindir. Halbuki bu ilmi Allah kendine tahsis etmiştir, demiş. Hattâbî ve başkaları ise şöyle tarif etmişlerdir: Arrâf, çalınan ve kaybolan malın yerini bulacağını iddia eden kimsedir. bir şey soran kimsenin namazının kabul edilmemesinden murad sevabının yokluğudur. Namazı iade etmesi gerekmez. Nitekim gasbe-dilen bir yerde namaz kılmak mekruhtur. Fakat kazası îcâb etmez. Bu hususta ulemâ müttefiktirler",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 5822,
			"arabicnumber": "2231",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Hür şeym haber verdi. H. Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Şerik b. Abdillah ile Hüşeym b. Beşir, Ya'la b. Atâ'dan, o da \"Amr b. Şerid'den, o da babasından naklen rivâyet etti. Şöyle dedi: Sekıf hey'etinin içinde cüzzamlı bir adam vardı. Peygamber (sallallahü aleyhi ve sellem) ona: senin bey'atını yaptık, sen don!» diye haber gönderdi. hadîs Buhârî'nin rivâyet ettiği: . aslandan kaçar gibi kaç!» hadîsine muvafıktır. Keza az yukarda geçen: develerin sahibi, sağlam develerin sahibi üzerine deve getiremez.» hadîsine de muhalif değildir. Iyâz'ın beyânına göre cüzzamlı kıssası hakkında Peygamber (sallallahü aleyhi ve sellem)’den muhtelif hadîsler rivâyet olunmuştur. Zikrettiğimiz iki hadîsten mâda da Câbir ve Âişe (radıyallahü anhüma)'dan hadîsler rivâyet olunmuştur. Hazret-i Câbir hadîsinde: (sallallahü aleyhi ve sellem) cüzzamlı ile birlikte yemek yedi ve ona: \"Allah'a güvenerek ve ona tevekkül ederek ye!\" buyurdu.» denilmektedir. Bundan dolayı Hazret-i Ömer'le diğer bazı Selef ricali meczumlu ile beraber yemek yenilebileceğine ve ondan kaçınma hususundaki emrin neshedildiğine kail olmuşlardır. diyor ki: «Ekser ulemânın kail olduğu vecihle sahih olan ve kabulü gereken kavil sudur ki; burada nesih yoktur. Belki iki hadîsin arasını cem etmek ve cüzzamlıdan sakınma emrini vucûba değil de İstihbab ve ihtiyat mânâsına hamletmek gerekir. Resûlüllah (sallallahü aleyhi ve sellem)’in cüzzamlı ile beraber yemek yemesi ise caiz olduğunu göstermek içindir.» ulemâ bu ve benzeri hadîslerle istidlal ederek kocası cüzzamlı olan kadına nikâhı fesh hususunda muhayyerlik isbat etmişlerdir. Kâdî îyâz'in beyânına göre cüzzamlı bir kimse mescide gitmekten ve kalabahk insanlar arasına karışmaktan men edilir. Yalnız cuma namazına gidebilir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 5823,
			"arabicnumber": "2232.01",
			"text": "(Bize Ebû Bekr b. Etî Şeybe rivâyet etti. ki): Bize Abde b. Süleyman ile İ'cni Nümeyr, Hişam'dan rivâyet ettiler. H. Ebû Küreyb de rivâyet etti. ki): Bize Abde rivâyet etti. ki): Bize Hişam babasından, o da Âişe'den naklen rivâyet etti. Âişe şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) iki çizgili yılanın öldürülmesini emir buyurdu. Çünkü o gözü kapar ve gebeliğe dokunur",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 5824,
			"arabicnumber": "2232.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 5825,
			"arabicnumber": "2233.01",
			"text": "(Bana Amr b. Muhammed En-Nâkıd rivâyet etti. ki): Bize Süfyân b. Uyeyne Zührî'den, o da Sâlim'den, o da babasından, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti: ve iki çizgili ile ebteri öldürün. Çünkü onlar cenîni düşürür; gözü kaparlar.» buyurmuşlar. ki: İbn Ömer bulduğu her yılanı öldürüyordu. Derken Ebû Lübâbe b. Abdil-Münzir yahut Zeyd b. Hattâb onu bir yılan kovalarken gördü de gerçekten evlerde yaşayan yılanların öldürülmesi yasak edildi, dedî",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 5828,
			"arabicnumber": "2233.04",
			"text": "(Bana Muhammed b. Rumh da rivâyet etti. ki): Bize Leys haber verdi. H. Kuteybe b. Saîd dahi rivâyet etti. Lâfız onundur. ki): Bize Leys Nâfi'den rivâyet etti ki, Ebû Lübâbe mescide yaklaşmak için evinde kendisine bir kapı açması hususunda İbn Ömer'le konuşmuş. Derken hizmetçiler bir küçük yılan derisi görmüşler. Abdullah: Onu yakalayın ve öldürün, demiş. Ebû Lübâbe ise: Onu öldürmeyin! Çünkü Resûlüllah (sallallahü aleyhi ve sellem) evlerdeki küçük yılanları öldürmekten nehiy buyurdu, demiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 5829,
			"arabicnumber": "2233.05",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 5830,
			"arabicnumber": "2233.06",
			"text": "(Bize Muhammed b. Müsennâ rivâyet etti. ki): Bize Yahya (Bu zât Kattan'dır) Ubeydullah'dan rivâyet etti. ki): Bana Nâfi' haber verdi. Kendisi Ebû Lübâbe'yi İbn Ömer'den naklen haber verirken işitmiş ki, Resûlüllah (sallallahü aleyhi ve sellem) ufak yılanların öldürülmesini yasak etmiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 5831,
			"arabicnumber": "2233.07",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 5832,
			"arabicnumber": "2233.08",
			"text": "(Muhammed b. Müsennâ rivâyet etti. ki): Bize Ab-dü’l-Vehhâb (yani Sekafî) rivâyet etti. ki): Yahya b. Saîd'i şunu söylerken işittim: Bana Nâfi' haber verdi. Ki: Ebû Lübâbe b. Abdil-Münzir El-Ensârî —Bu zâtın evi Küba'da idi. Sonra Medine'ye taşındı.— Bir defa beraberinde Abdullah b. Ömer olduğu halde oturmuş kendine bir dehliz açarken ansızın evlerde yaşayan bir yılan görmüşler ve onu öldürmek istemişler. Bunun üzerine Ebû Lübâbe evlerde yasayan yılanları kastederek: Gerçekte bunları öldürmek yasak edildi. Ebter ile iki çizgiliyi öldürmek ise emir buyuruldu, demiş. Bu iki yılanın gözü kör ettikleri, kadınların çocuklarını düşürttükleri söylenir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 5833,
			"arabicnumber": "2233.09",
			"text": "(Bana İshâk b. Mansûr da rivâyet etti. ki): Bize Muhammed b. Cehdam haber verdi. ki): Bize İsmail (bu zât bizce İbn Cafer'dir.) Ömer b. Nâfi'den, o da babasından naklen rivâyet etti. Şöyle dedi: Bir gün Abdullah b. Ömer kendine ait bir yıkıntının yanında bulunuyordu. Derken bir yılan parıltısı gördü ve bu yılanı takib ederek öldürün, dedj, Ebû Lübâbete'l-Ensârî: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i evlerde olan küçük yılanların Öldürülmesini yasak ederken işittim. Yalnız ebterle iki çizgilisi müstesna. Çünkü onlar gözü kör eder ve kadınların karınlarındaki ceninleri araştırırlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 5834,
			"arabicnumber": "2233.10",
			"text": "(Bize Harun b. Saîd el-Eylî de rivâyet etti. ki): Bize İbn Vehb rivâyet etti. ki): Bana Üsâme rivâyet etti. Ona da Nâfi' rivâyet etmiş ki: İbn Ömer, Ömer b. Hattâb'ın evinin yanındaki köşkte bir yılan gözetirken yanına Lübâbe uğramış... Leys b. Sa'd'ın hadîsi gibi rivâyette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 5835,
			"arabicnumber": "2234.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 5836,
			"arabicnumber": "2234.02",
			"text": "Bize Kuteybe b. Said ile Osman b. Ebî Şeybe de rivâyet ettiler. (Dediler ki): Bize Cerîr A'meş'den bu isnadla bu hadisin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 5837,
			"arabicnumber": "2235",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 5838,
			"arabicnumber": "2234.03",
			"text": "(Bize Ömer b. Hafs b. Gıyas rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize A'meş rivâyet etti. ki): Bana İbrahim, Esved'den, o da Abdullah’dan naklen rivâyet etti. Abdullah Şöyle dedi: Bir defa Hazret-i Resûlüllah (sallallahü aleyhi ve sellem)’le birlikte bir mağarada iken... Cerîr'ie Ebû Muâviye'nin hadîsi gibi rivâyette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 5839,
			"arabicnumber": "2236.01",
			"text": "(Bana Ebû't-Tâhir Ahmed b. Amr b. Şerh rivâyet etti. ki): Bize Abdullah b. Vehb haber verdi. ki): Bana Mâlik b. Enes, Sayfî'den —Bu zât bizce İbn Eflah'ın âzâtlısıdır— naklen haber verdi. ki): Bana Hişam b. Zühre'nin azatlısı Ebû's-Sâib haber verdi ki: Kendisi Ebû Saîd'i Hudrî'nin evinde yanına girmiş. ki): Onu namaz kılarken buldum ve oturarak namazını bitirinceye kadar onu bekledim. Derken evin bir tarafında çatıdaki çubuklar arasında bir kıpırtı işittim de bakındım. Ne göreyim bir yılanmış. Hemert öldürmek için üzerine sıçradım. Fakat Ebû Said bana otur diye işaret etti. Ben de oturdum. Namazdan ayrıldıktan sonra hânesindeki bir eve işaret ederek: Şu evi görüyor musun? dedi, Evet! cevâbını verdim. Bunda bizden yeni evlenmiş bir genç vardı. Derken Resûlüllah (sallallahü aleyhi ve sellem)'le birlikte hendek gazasına çıktık. Bu genç günün yarısında Resûlüllah (sallallahü aleyhi ve sellem)’den izin alarak evine dönüyordu. Bir gün yine ondan izin aldı. Resûlüllah (sallallahü aleyhi ve sellem) ona: silâhım ali Çünkü Kureyza'nın sana düşmanlık edeceğinden korkarım.» dedi. Adam da silâhını aldi. Sonra evine döndü. Bir de ne görsün karısı iki kapının arasında ayakta değil mi! Hemen süngüsü ile onu vurmak için üzerine yürüdü. Kıskançlığı kabarmıştı. Kadın ona: Yapma! Süngünü çek! Eve gir de beni dışarıya ne çıkardı bir gör! dedi. O da girdi. Bir de baktı ki büyük bir yılan!.. Döşeğin üzerine kıvrılmış yatıyor! Hemen süngü ile yılanın üzerine vararak onun işini bitirdi. Sonra dışarı çıkarak süngüyü avluya dikti. Derken yılan üzerine atıldı. Artık hangisi çabuk öldü. yılan mı, yoksa genç mi? Bilinemedi, Biz hemen Resûlüllah (sallallahü aleyhi ve sellem)’e gelerek bunu kendisine anlattık ve: Allah'a dua et, onu bizim için diriltsin! dedik. «Arkadaşınız için istiğfar edin!» buyurdu. Sonra şunu ilâve etti: Medine'de müslümen olmuş cinler vardır. Onlardan birini görürseniz, kendisine üç gün ihtarda bulunun. Şâyet bundan sonra size (yine) görünürse onu Öldürün! Çünkü o bir şeytandır.»",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 5840,
			"arabicnumber": "2236.02",
			"text": "(Bana Muhammed b. Râfi' de rivâyet etti. ki): Bize Vehb b. Cerîr b. Hâzim rivâyet etti. ki): Bize babam rivâyet etti. ki): Esma' b. Ubeyd'i Sâib denilen bir adamdan rivâyet ederken dinledim. Bizce bu zât Ebû Sâib'dir. ki): Ebû Saidi Hudri'nin yanına girdik. Otururken bir ara yatağının altında bir kıpırtı işittik de baktık. Ne görelim!.. Bir yılanmış!.. hadîsi kıssasıyle Mâlik'in Sayfî'den rivâyet ettiği badis gibi nakletmiştir. O bu hadîste şunu da söylemiştir: «Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): bu evlerin yılan sakinleri vardır. Onlardan birini görürseniz üzerine üç defa zorlama yapın; giderse ne âlâ.. Aksi takdirde onu Öldürün! Çünkü o bir kâfirdir.» dedi. Yanındakilere de: arkadasınîzı defnedin.» buyurdu.»",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 5841,
			"arabicnumber": "2236.03",
			"text": "(Bize Zübeyr b. Harb da rivâyet etti. ki): Bize Yahya b. Saîd, İbni Aclan'dan rivâyet etti. ki): Bana Sayfî, Ebû's-Sâib'den, o da Ebû Saîdi Hudrî'den naklen rivâyet etti. ki): Ebû Saîd'i şunu söylerken işittim: Resûlüllah (sallallahü aleyhi ve sellem): ki Medine'de cinlerden müslüman olmuş bir taife vardır, imdi her kim bu yılanlardan bir şey görürse ona üç defa İhtarda bulunsun, ondan sonra kendisine görünürse artık onu öldürsün. Çünkü o bir şeytandır.» buyurdular. rivâyetlerden İbn Ömerle Ebû Lübâbe hadîsim Buhârî «Bed'ü-l-Halk» bahsinde; İbn Mes'ûd hadîsini «Mürselât Sûresinin Tefsirinde tahric etmiştir. iki tufyeli demektir. Tufye mukl denilen yemişin yaprağıdır. Bu yemişin yaprağı üzerinde iki çizgi bulunurmuş. Yılanın da sırtında iki beyaz çizgi bulunduğu için benzetme sureliyle ona tufyeli yılan denilmiştir. Biz çizgili yılan demekle iktifa ettik. Kısa kuyruklu son derece zehirli bir yılandır. Gebe bir kadın bu yılana bakar bakmaz çocuğunu düşürürmüş. İhtimal bunun sebebi kadının birdenbire korkmasıdır. Maamafih Hattâbî ile diğer bazı ulemânın beyânına göre gerek çizgili yılanın, gerekse ebterin gözlerinde Cenâb-ı Hak öyle bir hassa halketmiştir ki bir bakışta insanı kör ederlermiş. Küçük yılan demektir. Bazıları ince ve hafif, bir takımları da ince beyaz yılan demek olduğunu söylemişlerdir. çizgili yılanın kadınların karnınd'aki ceninleri araştırmalarından murad onları düşürtmeleridir. Yani çocuk düşürtmeye -mecazen araştırma denilmiştir. Maamafih Allahü teâlâ’nın kendilerinde yarattığı bir hassa sebebiyle hakikaten araştırma yapmaları da mümkündür. diyor ki: «Medine'nin yılanları bu hadislerde beyân edildiği şekilde ihtar verilmeden öldürülmez. Fakat ihtar verilir de yine gitmezlerse Öldürülürler. Sair yerlerin ve evlerin yılanlarını ise ihtarsız Öldürmek menduptur. Çünkü bu babda birçok sahih hadisler vardır. Medine yılanlarının İhtarsız öldürülememesi hadîste beyân buyurulduğu üzere yılan şeklindeki cinlerden bir taifenin Medine'de müslümanlığı kabul ettiğindendir.» bir cemâat hadîsteki nehyin umûmî olduğuna, binâenaleyh nerede olursa olsun evlerde yaşıyan yılanların ihtarsız Öldürülemiyeceğine kail olmuşlardır. Kırlarda yaşayanlar ise onlara göre de ihtarsız Öldürülür, İmâm Malik'e göre mescidlerde bulunanlar öldürülür. İhtarın keyfiyeti hakkında İbn Habib Peygamber (sallallahü aleyhi ve sellem)’in: Süleyman b. Dâvûd'un aldığı söz hakkı için bize eziyet vermemenizi ve bize görünmemenizi dilerim.» dediğini rivâyet etmiştir. defa zorlamaktan murad İmâm Mâlik'e göre: Seni Allah ve âhiret günü aşkına bize görünmemeye ve eziyet vermemeye zorluyorum, demektir. İhtardan sonra yılan yine görünmekte devam ederse evlerde yaşayan yılan veya rnüslüman olan cin olmadığı anlaşılır. Bunun şeytan olduğu bildirildiğinden öldürülmesinde beis yoktur. rivâyetlerden ihramlı bir kimsenin yılan öldürebileceği, yılanın Harem-i Şerîfde de öldürülmesi caiz olduğu anlaşılmaktadır",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 5842,
			"arabicnumber": "2237.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Amru'n-Nâkıd, İshâk b. İbrahim ve İbn Ebî Ömer rivâyet ettiler, İshâk ahberanâ; ötekiler had-desenâ tâbirlerini kullandılar. (Dediler ki): Bize Süfyân b. Uyeyne Abdu'l-Hamid b. Cüheyr b. Şeybe'den, o da Saîd b. Miiseyyeb'den, o da Ümmü Şerik'den naklen rivâyet etti ki: Peygamber (sallallahü aleyhi ve sellem) ona kertenkeleleri Öldürmesini emir buyurmuş. Ebî Şeybe'nin hadîsinde (Ona tâbiri yoktur. Sâdece) emir buyurdu, denilmiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 5843,
			"arabicnumber": "2237.02",
			"text": "(Bana Ebu't-Tâhir de rivâyet etti. ki): Bize İbni Vehb haber verdi. ki): Bana İbn Cüreyc haber verdi. H. Muhammed b. Ahmed b. Ebî Halef dahi rivâyet etti. ki): Bize Ravh rivâyet etti. (Ded; ki): Bize İbn Cüreyc rivâyet etti. H. Abd b. Humeyd dahi rivâyet etti, ki): Bize Muhammed b. Bekir haber verdi. ki): Bize İbni Cüreyc haber verdi. ki): Bana Abdül-Hamid b. Cüreyc b. Şeybe haber verdi. Ona da Saîd b. Müseyyeb haber vermiş. Ona da Ümmü Şerik haber vermiş ki; kendişi kertenkeleleri öldürmek hususunda Peygamber (sallallahü aleyhi ve sellem)'den emir istemiş, o da onların Öldürülmesini emir buyurmuş. Şerik Benî Âmir b. Lüey kabilesi kadınlarından biridir. İbn Ebî Halet ile Abd b. Humeyd'in hadîsleri lâfız itibariyle birdir. İbn Vehb'in hadîsi de ona yakındır",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 5844,
			"arabicnumber": "2238",
			"text": "Bize İshâk b. İbrahim ile Abd b. Humeyd rivâyet ettiler. (Dediler ki): Bize Abdürrezzak haber verdi, ki): Bize Ma'mer, Zührî'den, o da Âmir b. Sa'd'dan, o da babasından naklen haber verdi ki; Peygamber (sallallahü aleyhi ve sellem) kertenkelenin Öldürülmesini emir buyurmuş ve ona fasıkcık adını vermiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 5845,
			"arabicnumber": "2239",
			"text": "Bana Ebû't-Tâhir ile Harmele rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, Zührî'den, o da Urve'den, o da Âişe'den naklen haber verdi ki: Resûlüllah (sallallahü aleyhi ve sellem) kertenkele için fâsıkçık demiş. şunu ziyâde etmiştir. Âişe: Ben onun kertenkeleyi Öldürmeyi emrettiğini işitmedim demiş",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 5846,
			"arabicnumber": "2240.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Ha-lid b. Abdülah, Süheyl'den, o da bahasından, o da Ebû Hüreyre'den naklen haber verdi. Şöyle dedi; Resûlüllah (sallallahü aleyhi ve sellem): kim bir kertenkeleyi ilk vuruşta öldürürse ona şu ve şu kadar sevâb vardır. Ve her kim onu ikinci vuruşta Öldürürse, birinciden aşağı olmak üzere ona şu kadar sevab vardır. Ve her kim onu üçüncü vuruşta öldürürse ona da ikinciden aşağı olmak üzere şu ve şu kadar sevab vardır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 5847,
			"arabicnumber": "2240.02",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Ebû Avâne rivâyet etti. H. Züheyr b. Harb da rivâyet etti, ki) . Bize Cerîr rivâyet etti. H. Muhammed b. Sabbah dahi rivâyet etti. ki): Bize İsmail (yani İbn Zekeriyya) rivâyet etti. H. Ebû Küreyb de rivâyet etti. ki): Bize Veki' Süfyan'dan rivâyet etti. Bu râvilerin hepsi Süheyl'den, o da babasından, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen Hâlid'in Süheyl'den rivâyet ettiği hadîs manâsıyla rivâyette bulunmuşlardır. Yalnız Cerîr müstesna! Çünkü onun hadîsinde: kim bir vuruşta bir kertenkele öldürürse ona yüz sevab yazılır, ikincide bundan daha aşağı, üçüncüde ondan daha aşağı yazdır.» ifâdesi vardır",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 5848,
			"arabicnumber": "2240.03",
			"text": "(Bize Aluhammed b. Sabbah da rivâyet etti. ki): Bize İsmâil (yani İbn Zekeriyya) Süheyl'den rivâyet etti. ki): Bana kız kardeşim Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti ki: vuruşta yetmiş sevab vardır.» buyurmuşlar, Âişe hadîsini Buhari «Bcd'ül-Halk» bahsinde tahrîc etmiştir. Kertenkele demektir. Biraz daha büyüğüne Arablar Sam ebras derler. Ulemâ kertenkelenin eziyet verici haşerattan sayıldığında ittifak etmişlerdir. Peygamber (sallallahü aleyhi ve sellem)'in onun öldürülmesini emir buyurması bundandır. Bir vuruşta öldürmenin çok sevablı. ikinci vuruşta Öldürmenin ondan daha az sevablı olması bu hususta dikkat göstermeye teşvik içindir. Çünkü bir vuruşta öldürülemezse kaçabilir. Resûlüllah (sallallahü aleyhi ve sellem) hilde ve haremde öldürülen zararlı hayvanlar gibi buna da fâsıkcık adı vermiştir. Fâsık yoktan çıkandır. Bu hayvanlar da fazla zarar yapmak ve eziyet vermek suretiyle âdeta diğer haşerâtın içinden çıkmışlardır. İmâm Ahmed'in Hazret-i Âişe'den rivâyet ettiği bir hadîste şöyle denilmektedir: «Âişe'nin evinde dayalı bir süngü vardı. Bu kendisine soruldu da şunları söyledi: Biz onunla kertenkele öldürürüz. Çünkü Peygamber (sallallahü aleyhi ve sellem) haber verdi ki: İbrahim (aleyhisselâm) ateşe atıldığı vakit yeryüzündeki bütün hayvanlar onu söndürmeye çalışmış, yalnız kertenkele istisna teşkil etmiştir. Çünkü o ateşi üfürmüştür. Bu sebeple Peygamber (sallallahü aleyhi ve sellem) onun öldürülmesini emir buyurdu.» Yine Hazret-i Âişe'den rivâyet olunduğuna göre Beyt-i Makdis yandığı vakit kertenkeleler ateşi üfürmüşlerdir. Bu hadîsler kertenkelenin fıtratında kötülük olduğunu beyân için vârid olsa gerektir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 5849,
			"arabicnumber": "2241.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 5850,
			"arabicnumber": "2241.02",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Muğîre yani İbn Abdirrahman El-Hızâmî Ebû'z-Zînad'dan, o da A'rac'dan, o da Ebû Hüreyre'den naklen rivâyet etti ki: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuşlar: biri bir ağacın altına indi de kendisini bir karınca ısırdı. O da eşyasını emrederek ağacın altından çıkarttı. Sonra emir verdi ve karınca yuvası yakıldı. Bunun üzerine Allah ona bir tek karınca yak-saydın ya! diye vahy buyurdu.»",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 5851,
			"arabicnumber": "2241.03",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 5852,
			"arabicnumber": "2242.01",
			"text": "(Bana Abdullah b. Muhammed b. Esma’ Ed Dubâî rivâyet etti. ki) Bize Cüveyriye b. Esma', Nâfi'den, o da Abdullah'dan naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) kadın bir kedi sebebiyle azâb o'unmuştur. Kediyi ölünceye kadar hapsetmiş ve onun sebebiyle cehenneme girmiştir. Onu hapsettiği müddetçe ne doyurmuş, sulamiş, ne de yerin haşerâtından yemesine müsaade etmiştir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 5853,
			"arabicnumber": "2242.02",
			"text": "(Bana Nasr b. Alî El-Cehdamî de rivâyet etti. ki) ; Bize Abdü’l-A'lâ, Ubeydüllah b. Ömer'den, o da Nâfi'den, o da İbn Ömer'le Saîd El-Makburî'den, onlar da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mânâsı gibi rivâyette bulundu",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 5854,
			"arabicnumber": "2242.03",
			"text": "Bize bu hadîsi Harun b. Abdillah ile Abdullah b. Cafer Mân b. İsa'dan, o da Mâlik'den, o da Nâfî'den, o da İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu mânâda rivâyette bulundu",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 5855,
			"arabicnumber": "2243.01",
			"text": "(Bize Ebû Küreyb dahi rivâyei etti. ki): Bize Ab-de, Hişam'dan, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem): kadın doyurup, sulamadığı ve yerin haşerâtından yemesine müsaade etmediği bir kedi sebebiyle azâb olunmuştur.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 5856,
			"arabicnumber": "2243.02",
			"text": "(Bize yine Ebû Küreyb rivâyet etti. ki): Bize Ebû Muâviye rivâyet etti. H. Muhammed b. Müsennâ da rivâyet etti. ki): Bize Hâlid b. Haris rivâyet etti. ki): Bize Hişam bu isnadla rivâyette bulundu. iki ravinin hadîsinde «Onu bağladı...» cümlesi vardır. Ebû Muâviye'nin hadîsinde (Haşâşilerd yerine) Haşarati’l-Erd denilmiştir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 5857,
			"arabicnumber": "2243.03",
			"text": "Bana Muhammed b. Râfi' ile Abd b. Humeyd de rivâyet ettiler. (Abd ahberana; İbn Râfi' ise baddesena tâbirlerini kullandılar. Dediler ki): Bize Abdürrezzak rivâyet etti. ki): Bize Ma'mer haber verdi. ki): Zührî şunu söyledi: Bana da Humeyd b. Abdirrahman Ebû Hüreyre'den o da Resûlüllah (sallallahü aleyhi ve sellem)'den naklen Hişam b. Urve'nin hadîsi mânâsında rivâyette bulundu",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 5858,
			"arabicnumber": "2243.04",
			"text": "(Bize Muhammed b. Râfi' de rivâyet etti. ki): Bize Abdür-rezzak rivâyet etti. ki): Bize Ma'mer, Hemmâm b. Münebbih'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen yukarkilerin hadîsi gibi haber verdi. hadîsi Buhârî «Kitâbü’l-Enbiyâ»’da tahric etmiştir. Hadîs-i Şerif kedi öldürmenin ve aç susuz kediyi hapsetmenin haram olduğuna delildir. Kedi sebebiyle azâb olunan kadının müslüman olup olmadığı ihtilaflıdır. «Hadîsin zahirine göre bu kadın müslümandır. Cehenneme girmesi kedi sebebiyledir.» diyor. Kâdi Iyâz: «Caiz ki bu kadın kâfirmiş ve küfründen dolayı azâb edilmiştir. Kedi sebebiyle ise bu azabın üzerine azâb ziyâde edilmiştir. Çünkü bunu kadın hak etmiştir...» demektedir. Kadının işlediği mâsiyet esas itibariyle küçük günahlardan İse de ısrarla devam ettiği için büyük günah olmuştur. Kadının ebedî cehennemde kalacağını gösteren bir delil yoktur. Hadîs-i şerif hayvanın nafakası sahibine vâcib olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 5859,
			"arabicnumber": "2244",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 5860,
			"arabicnumber": "2245.01",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 5861,
			"arabicnumber": "2245.02",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 212
			}
		}
	]
}