{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"40": "The Book Concerning the Use of Correct Words"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5862,
			"arabicnumber": "2246.01",
			"text": "Bana Ebû't-Tâhir Ahmed b. Amr b. Şerh ile Harmele b. Yahya rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihab'dan rivâyet etti. ki): Bana Ebû Seleme b. Abdirrahman haber verdi. ki): Ebû Hüreyre şunu söyledi: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i şöyle buyururken işittim: (azze ve celle): Âdemoğlu dehre sövüyor, halbuki dehr benim. Gece ve gündüz benim yed-i kudretimdedir.» buyurdu",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5863,
			"arabicnumber": "2246.02",
			"text": "Bize bu hadîsi İshâk b. İbrahim ile İbn Ebî Ömer de rivâyet ettiler. Lâfız İbn Ebî Ömer'indir. İshâk ahberanâ; İbn Ebî Ömer ise haddesenâ tâbirlerini kullandılar. (Dediler ki): Bize Süfyan Zührî'den, o da İbn Müseyyeb’den, o da Ebû Hüreyre'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuşlar: (azze ve celle): Âdemoğlu bana eza veriyor, dehre sövüyor. Halbuki dehir benim. Gece ile gündüzü döndürürüm.» buyurdu",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5864,
			"arabicnumber": "2246.03",
			"text": "(Bize Abd b. Humeyd de rivâyet etti. ki): Bize Abdürrezzâk haber verdi. ki): Bize Ma'mer Zührî’den, o da İbn Müseyyeb'den, o da Ebû Hüreyre'den naklen haber verdi. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) buyurdular ki: (azze ve celle): Âdemoğlu bana ezâ ediyor. Vay dehrin musibetine! diyor. Sizden biriniz sakın: Vay dehrîn musibetine! demesin. Çünkü dehîr benim, gecesini gündüzünü döndürürüm, dilediğim zaman ikisini de tutarım.» buyurdu",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5865,
			"arabicnumber": "2246.04",
			"text": "(Bize Kuteyhe rivâyet etti. ki) ; Bize Muğîre b. Abdirrahman, Ebû'z-Zinad'dan, o da A'rac'dan, o da Ebû Hüreyre'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem): sizden biriniz: Vay dehrin musibetine! demesin. Çünkü dehr ancak Allah'dır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5866,
			"arabicnumber": "2246.05",
			"text": "(Bana Züheyr b. Harb da rivâyet etu. ki): Bize Cerîr Hişâm'dan, o da İbn Sîrîn'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti: soğmeyin! Çünkü dehr ancak Allah'dır.» buyurmuşlar. hadîsi Buhârî «Tevhid» ve «Tefsir» bahislerinde Ebû Dâvud «Kîtâbü'l-Edeb»'de; Nesâî «Tefsir»'de tahrîc etmişlerdir. aslında bu âlemin müddetidir. Bilâhare her çok müddete dehr denilmiştir. Zaman bunun hilâfmadır. Çünkü müddetin azma da, çoğuna da zaman denilebilir. Hadîs-i şerifte dehrden murad gece ile gündüzü döndüren ve bütün işleri bunların içinde çeviren Allah'dır. Şu halde: söğmeyin...» demek dehrin yaratanına söğmeyin mânâsına gelir. Câhiliyyet devrinde Arabların basına bir musibet gelirse, onu dehre izafe ederlerdi. Hattâ Kur'ân-ı Kerim'de beyân buyrulduğu vecihle: ancak dehr helâk eder.\" Sûre demişler ve zamana söğmüşlerdi. Çünkü dehrin Allah tarafından yaratıldığını bilmezler, onu ezelî ve ebedi sanırlardı. Bundan dolayı kendilerine dehriye denilmiştir. bana ezâ ediyor...» cümlesi hakkında Kurtubî şunları söylemiştir: «Bunun mânâsı: Bana öyle söz söylüyor ki: Bu söz eziyyet duyan bir kimseye söylense bundan müteezzi olur. Allah eziyet duymaktan münezzehtir. Bu siz burada mecazdır. Bundan maksat onu kim söylerse Allah'ın gazabına maruz olur. demektir.»",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5867,
			"arabicnumber": "2247.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5868,
			"arabicnumber": "2247.02",
			"text": "Bize Amrü'n-Nâkid ile İbn Ebî Ömer rivâyet ettiler. (Dediler ki): Bize Süfyân Zührî'den, o da Saîd'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen rivâyet etti: demeyin! Çünkü kerm mü'minin kalbidir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5869,
			"arabicnumber": "2247.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5870,
			"arabicnumber": "2247.04",
			"text": "Bize (yine) Züheyr b. Harb rivâyet etti. ki): Bize Âli b. Hafs rivâyet etti. ki): Bize Verkâ', Ebû'z-Zinad'dan, o da A'rac'dan, o da Ebû Hüreyre'den naklen rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): biriniz kerm demesin. Çünkü kerm ancak mü'minin kalbidir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5871,
			"arabicnumber": "2247.05",
			"text": "(Bize İbn Râfi' de rivâyet etti. ki): Bize Abdü'r-Rezzâk rivâyet\" etti. ki): Bize Ma'mer, Hemmâm b. Münebbih'den naklen haber verdi. Hemmâm: Bize Ebû Hüreyre'nin, Resûlüllah (sallallahü aleyhi ve sellem)’den rivâyet ettikleri şunlardır diyerek bir takım hadîsler zikretmiştir. Ki: Onlardan biri de şudur: Resûlüllah (sallallahü aleyhi ve sellem): biriniz üzüme kerm demesin! Çünkü kerm ancak müslüman kişidir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5872,
			"arabicnumber": "2248.01",
			"text": "(Bize Ali b. Haşrem rivâyet etti. ki): Bize İsâ (yani İbn Yûnus) Şu'be'den, o da Simâk b. Harb'dfen, o da Alkame b. VâiT-den, o da babasından, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen haber verdi: demeyin! Lâkin habele (yânı üzüm) deyin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5873,
			"arabicnumber": "2248.02",
			"text": "(Bu hadîsi bana Züheyr b. Harb da rivâyet etti. ki): Bize Osman b. Ömer rivâyet etti. ki): Bize Şu'be Simak'dan rivâyet etti. ki): Ben Alkame b. Vâil'i babasından rivâyet ederken dinledim ki: Peygamber (sallallahü aleyhi ve sellem): demeyin! Lâkin İneb ve hable deyin!» buyurmuşlar. hadîsi Buhârî «Kitâbü’l-Edeb»'de tahrîc etmiştir. Ineb üzüm; hable yahut habele üzüm çotuğu yani bağı demektir. Kerm de aynı mânâya gelir. Ancak Arablar bu kelimeyi hem üzüm, hem bağ. hem de şa-rab mânâlarında kullanırlardı. Bir de şarab cömertliğe sevk ettiği için ona kerm demişlerdi. Bundan dolayı şeriat bu kelimeyi üzüme ve üzüm ağacına isim yapmayı mekruh saymıştır. Çünkü Arablar bu kelimeyi işitmekle çok defa şarab hatırlarına gelir, nefisleri kabarabilir, hatta içebilirlerdi. Resûlüllah (sallallahü aleyhi ve sellem) bu isme ancak müslüman bir adamın yahut mü'min kalbin lâyık olduğunu bildirmiştir. Zira Kerm, keremden alınmıştır. Mü'minirı kalbine kerm demesi; içinde îmân, hidâyet, nur, takva ve bu ismi hak eden sıfatlar bulunduğundandır. Müslüman kişi de böyledir. Lügat ulemâsının beyânına göre Arablar cömert adam ve cömert kadın mânâsına «Racülün kermün» ve «İmraetün kermün», «Nis-vetün kermün» derler",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5874,
			"arabicnumber": "2249.01",
			"text": "Bize Yahya b. Eyyûb ile Kuteybe ve İbn Hucur rivâyet ettiler. (Dediler ki) ; Bize İsmail, (bu zat İbn Cafer'dir.) Alâ'dan, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem): biriniz abdim ve emem demesin! Hepiniz Allah'ın abdleri ve hepinizin kadınları Allah'ın emeleridir. Lâkin benim ğulamım, benim cariyem, benim fetâm, benim fetâtım desin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5875,
			"arabicnumber": "2249.02",
			"text": "(Bana Züheyr b. Harb da rivâyet etti. ki): Bize Cerîr A'meş'den, o da Ebû Sâlih'den, o da Ebû Hüreyre'den naklen rivâyet etti. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): biriniz benim abdim demesin! Zira hepiniz Allah'ın abdlerisiniz, Velâkin fetam desin! Köle ds Rabbim demesin, lâkin seyyidim desin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5876,
			"arabicnumber": "2249.03",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb de rivâyet ettiler. (Dediler ki): Bize Ebû Muâviye rivâyet etti. H. Ebû Saîd El-Eşecc de rivâyet etti. ki): Bize Veki' rivâyet etti. iki râvi A'meş'den bu İsnad ile rivâyette bulunmuşlardır. İkisinin hadîsinde de: efendisine mevlâm demesin!» cümlesi vardır. Ebû Muâviye'nin hadîsinde: sizin mevlânız Allah (azze ve celle)'dir.» ziyâdesi vardır",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5877,
			"arabicnumber": "2249.04",
			"text": "(Bize Muhammed b. Râfi' de rivâyet etti. ki): Bize Abdürrezzâk rivâyet etti. ki): Bize Ma'mer Hemmam b. Münebbih'den naklen haber verdi. Hemmâm ; Bize Ebû Hüreyre'nin Resûlüllah (sallallahü aleyhi ve sellem): Rabb'ime su ver, Rabbini doyur, Rabbine ışık getir, demesin. Yine sizden biriniz: Rabbim demesin! Seyyidim, mevlâm desin! Ve biriniz: Abdim, emem demesin! Fetam, fetâhm, ğulâmım, desin!» buyurdular. hadîsi Buhari «Itk» bahsinde tahrîc etmiştir. ve eme, kul mânâsına gelirler. Biri erkeğe, diğeri kadına isim olmuştur. Oğlan ve hizmetçi; fetât, genç kız demektir. Mürebbî, sâhib, Mâlik ve Allah manasınadır. beyânına göre bu hadîslerden iki şey murad edilmiştir. Birincisi: Başkasının malı olan bir köle veya cariyenin sahibine rabbim dememesi gerekir. Çünkü rab olmanın hakikati Allah'a mahsustur. Gerçi Peygamber (sallallahü aleyhi ve sellem) kıyâmet alâmetlerini beyân ederken: rabbini yahut rabbesini doğurmasıdır.» demiştir. Fakat bu cevazı bildirmek içindir. Nehiyden murad bu sözün kullanılmaması ve Met hâline getirilmemesidir. Nadiren kullan ilmi süt. Bir de bu kelimenin mutlak olarak kullanılması nehyedilmiştir. Yoksa başka bir şeye izafetle kullanılmasında beis yoktur. Rabbüsselem, Rabbülmal gibi terkibler hakkında söz yoktur. Kölenin sahibine seyvidim, yani efendim demesi yasak edilmemiştir. Çünkü seyyid kelimesi Allah'a mahsus değildir. Ve Allah hakkında Rab kelimesi gibi kullanılmamıştır. Hatta Kâdî Iyâz İmâm Mâlik'in dualarda Allah hakkında Seyyidim denilmesini mekruh gördüğünü nakletmiştir. Allahü teâlâ'ya Kur'ân-ı Kerîm'de ve mütevâtîr hadîslerde Seyyid denilmemiştir. Şu halde kölenin sahibine seyyidim, efendim demesinde bir işkâl veya iktibas yoktur. Kölenin sahibine mevlâm diye hitab etmesinde dahi beis yoktur. Zira Mevlâ kelimesinin on altı kadar mânâsı vardır. Mâlik, sâhib ve yardımcı mânâları da bunlardandır. Gerçi Bâbımızın üçüncü rivâyetinde «Köle de sahibine mevlâm demesin!» ibaresi göze çarpıyorsa da Kâdî Iyâz bu cümlenin A'meş'den rivâyetinde râvilerin. ihtilâf ettiklerini, bâzılarının onu hiç anmadıklarını söylemiş: «En doğrusu bu cümleyi hazfetmektir.» demiştir. Bir kimsenin sahibi bulunduğu köle ve cariyesine abdim, emem (yani kulum) demesi mekruhtur. Çocuğum, kızım, gencim gibi sözler kullanacaktır. Zira Rab kelimesinde olduğu gibi, abd kelimesine dahi müstehak olan yalnız Allah'dır. Yani kulluk Allah'a yapılır. Bir de bu kelimede mahlûka yaraşmayan ta'zim mânâsı vardır. Resûlüllah (sallallahü aleyhi ve sellem): Allah'ın kullarısınız buyurarak bu kelimeyi niçin yasak ettiğini bildirmiştir. Oğlum, kızım gibi kelimelerde böyle bir mânâ yoktur.»",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5878,
			"arabicnumber": "2250.01",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Süfyân b. Uyeyne rivâyet etti. H. Ebû Küreyb Muhammed b. Alâ' da rivâyet etti. ki): Bize Ebû Üsâme rivâyet etti. iki râvi Hişâm'dan, o da babasından, o da Âişe'den naklen rivâyet etmişlerdir. Âişe şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): biriniz: Nefsim pis oldu, demesin! Lâkin: Nefsim kötüleşti, desin!» buyurdular. Ebû Küreyb'in hadîsidir. Ebû Bekr. ise: «Peygamber (sallallahü aleyhi ve sellem)'den» dedi. «Lâkin» kelimesini anmadı",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5879,
			"arabicnumber": "2250.02",
			"text": "(Bize bu hadîsi Ebû Küreyb de rivâyet etti. ki): Bize Ebû Muâviye bu isnadla rivâyette bulundu",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5880,
			"arabicnumber": "2251",
			"text": "Bana Ebû't-Tâhir ile Harmele rivâyet ettiler. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihab'dan, o da Ebû Ümâme b. Sehl b. Huneyf'den, o da babasından naklen haber verdi ki: Resûlüllah (sallallahü aleyhi ve sellem): Nefsim pis oldu, demesin! Nefsim kötüleşti, desin buyurmuşlar. hadîsi Buhârî «Kitâbü’l-Edeb»'de; Nesâî «Elyevm vel-leyle»'de tahrîc etmişlerdir. ulemâsına göre «habuset» ile «Iâgiset» kelimeleri arasında mânâca fark yoktur. Her ikisi de pis ve çirkin oldu mânâsına gelir. Lâkin hubus lâfzı çirkin görüldüğü için kullanılmaması tavsiye buyurulmuştur. Çünkü Arablar lâfızda edebe riâyet ederler, çirkin söz kullanmazlardı. göre «lâgıset»'in mânâsı daraldı, demektir. Gerçi Peygamber (sallallahü aleyhi ve sellem) sabah namazına kalkamayan için: «Habis nefisi» tenbel» demişse de bu söz müphem bir şahıs için verilen bir haber mâhiyetinde olduğundan söylenmesi mahzurlu değildir. Râgıb: «Habis kelimesi îtikadda bâtıl, sözde yalan, fiilde çirkin mânâlarına kullanılır.» demiştir. İbn Battal da buradaki nehyin vucub için değil, edeb ve nezâket Bâbında olduğunu söylemiştir",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5881,
			"arabicnumber": "2252.01",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe rivâyet etti. ki): Bize Ebû Üsâme Şu'be'den rivâyet etti. ki): Bana Huleyd b. Cafer, Ebû Nadra'dan, o da Ebû Saîdi Hudrî'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen rivâyet etti. Şöyle buyurmuşlar: İsrail'den kısa bir kadın iki uzun kadınla birlikte yürüyormuş, bu sebeple odundan iki ayak ve altından kapalı kilitli bir yüzük edinmiş. Sonra içine misk doldurmuş. Misk kokuların en güzelidir. Ve bu iki kadının arasında geçmiş gitmiş, onu tanıyamamışlar. Eliyle de şöyle yapmış.» Şu'be elini silkmiş",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5882,
			"arabicnumber": "2252.02",
			"text": "(Bize Amru'n-Nakid rivâyet etti. ki): Bize Yezîd b. Hârûn Şu'be'den, o da Huleyd b. Cafer ile Müstemir'den rivâyet etti. (Demişler ki): Bize Ebû Nadrâ'yı Ebû Saîdi Hudrî'den rivâyet ederken dinledik ki: Resûlüllah (sallallahü aleyhi ve sellem) Benî İsrail'den yüzüğüne misk dolduran bir kadın anlatmış. Misk kokuların en güzelidir",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5883,
			"arabicnumber": "2253",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe ile Züheyr b. Harb ikisi birden El-Mukrî'den rivâyet ettiler. Ebû Bekr ki): Bize Ebû Abdirrahman El-Mukrî', Saîd b. Ebî Eyyûb'dan rivâyet etti. ki): Bana Ubeydullah b. Ebî Cafer, Abdurrahman El-A'rac'dan, o da Ebû Hüreyre’den naklen rivâyet etti. Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): kimseye reyhan takdim edilirse onu reddetmez. Zİra reyhanın taşınması, hafif kokusu güzeldir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5884,
			"arabicnumber": "2254",
			"text": "Bana Harun b. Saîd El-Eylî ile Ebû't-Tâhir ve Ahmed b. Îsâ rivâyet ettiler. Ahmed haddesenâ; Ötekiler ahberana tâbirlerini kullandılar. (Dediler ki): Bize İbn Vehb haber verdi. ki): Bana Mah-rame babasından, o da Nâfi'den naklen haber verdi. Nâfi' Şöyle dedi: İbn Ömer koku süründüğü vakit karışıksız öd, bir de ödle karıştırılmış kâfur sürünür, sonra: Resûlüllah (sallallahü aleyhi ve sellem) işte böyle koku kulanırdı, derdi. diyor ki: «Kısa kadının odundan bacak yaptırmasına gelince: Bizim şeriatımızda bunun hükmü şudur: Eğer kadın bununla bilinmemek için kendini örtmek gibi sahih şer'î bir maksad güttü ise beis yoktur. Büyüklenmeyi veya erkekleri aldatmak için kusursuz kadınlara benzemeyi kasdetti ise bu haramdır.» lügat ve garibi hadîs âlimlerine göre güzel kokulu her nebattır. Kâdî Iyâz: «Bence ondan bu hadîste bütün kokular kasdedilmiş olacaktır. Filhakika Ebû Dâvud'un bir rivâyetinde bir kimseye güzel koku takdim edilirse denilmiş. Buhârî'nin Sahîh'inde dahi Peygamber (sallallahü aleyhi ve sellem) güzel kokuyu reddetmezdi, buyurulmuştur.» diyor",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 23
			}
		}
	]
}