{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"47": "The Book of Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6775,
			"arabicnumber": "2665",
			"text": "Bize Abdullah b. Mesleme b. Ka'neb rivayet etti. (Dediki): Bize Yezîd b. İbrahim Et-Tüsterî, Abdullah b. Ebi Müleyke'den, o da Kasım b. Muhammed'den, o da Âişe'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) ; «7- Sana bu kitabı indiren O'dur. Bunun ayetlerinden bir kısmı muhkemdir ki, bu ayetler, kitabın anası (aslı) demektir. Diğer bir kısmı da müteşabih ayetlerdir. Kalblerinde kaypaklık olanlar, sırf fitne çıkarmak için, bir de kendi keyflerine göre te'vil yapmak için onun müteşabih olanlarının peşine düşerler. Halbuki onun te'vilini Allah'dan başka kimse bilmez. İlimde uzman olanlar, \"Biz buna inandık, hepsi Rabbimiz katındandır.\" derler. Üstün akıllılardan başkası da derin düşünmez.» [Al-i İmran 7] okudu. Âişe demiş ki: Resülullah (Sallallahu Aleyhi ve Sellem): «Kur'ân'ın müteşabihlerine tâbi olanları gördüğünüz vakit, onlardan sakının. Onlar Allah'ın ad verdiği kimselerdir.» buyurdu",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6776,
			"arabicnumber": "2666",
			"text": "Bize Ebû Kâmil Fudayl b. Hüseyn El-Cahderî rivayet etti. (Dediki): Bize Hammad b. Zeyd rivayet etti (Dediki): Bize Ebu İmran el-Cevni rivayet etti. (Dediki): Bana Abdullah b. Revah El-Ensârî, Abdullah b. Amr'ın şöyle dediğini yazdı: Bir gün erken erken ResuluIlah (Sallallahu Aleyhi ve Sellem)'e gittim. Derken bîr âyet-i kerîme hususunda ihtilâf eden iki adaımın seslerim işitti de, Resûlullah (Sallallahu Aleyhi ve Sellem) yanımıza çıktı. Yüzünde gadab belli oluyordu. Ve : «Sizden öncekiler ancak ve ancak Kitab hakkında ihtilâfları sebebiyle helak oldular.» buyurdu. İZAH 2667 DE",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6777,
			"arabicnumber": "2667.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Ebû Kudâme Haris b. Ubeyd Ebu İmrân'dau, o da Cündeb b. Abdillah EI-Becelî'den naklen haber verdi. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) ; «Kur'ân'ı kalbleriniz onun üzerinde birleştiği müddetçe okuyun! Onun hakkindi ihtilâfa düştünüz mü, hemen kalkın.» buyurdular",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6778,
			"arabicnumber": "2667.02",
			"text": "Bana îshâk b. Mansûr rivayet etli. (Dediki): Bize Ahdü's-Samed haber verdi, (Dediki): Bize Hemmâm rivayet etti. (Dediki): Bize Ebû İnırân El-Cevni, Cündeb'den, yâni İbni Abdillah'dan rivayet etti ki: Resûlullah (Sallallahu Aleyhi ve Sellem) ; «Kur'ân'ı kalbleriniz onun üzerinde birleştiği müddetçe okuyun. İhtilâfa düştünüz mü, hemen kalkın!» buyurdular",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6779,
			"arabicnumber": "2667.03",
			"text": "{M-4} Bana Ahmed b. Said b. Sahr Ed-Dârimî rivayet etti. (Dediki): Bize Habban rivayet etli. (Dediki): Bize Ebân rivayet etti. (Dediki): Bize Ebû İmrân rivayet etti. (Dediki): Biz Kûfe'de çocukken Cündeb bize şunu söyledi: Resûlullah (Sallallahu Aleyhi ve Sellem) ; «Kur'ân'ı okuyun...» buyurdular. Râvi yukardakilerin hadîsi gibi rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6780,
			"arabicnumber": "2668",
			"text": "Bize Ebû Bckr b. Ebî Şeybe rivayet etti. (Dediki): Bize Veki', İbni Cüreyc'den, o da İbnü Ebî Müleyke'den, o da Âişe'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) ; «Şüphesiz ki, erkeklerin Allah'a en sevimsiz olanı, şiddetle düşmanlık yapan kâmil hasımdır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6781,
			"arabicnumber": "2669.01",
			"text": "Bana Suveyd b. Said rivayet etti (Dediki): Bize Hafs b. Meysera rivayet etti. (Dediki): Bana Zeyd b. Eslem, Ata' b. Yesar'dan, oda Ebu Said-i Hudri'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) ; ''Sizden öncekilerin yollarına karış karış ve arşın arşın mutlaka tabi olacaksınız. Hatta bir keler deliğine girseler, onların arkasından gideceksiniz. '' buyurdular. Biz: -- Ya Resulallah ! Yahudilerle Hıristiyanlara mı ? dedik. '' Ya kime ? '' buyurdular",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6782,
			"arabicnumber": "2669.02",
			"text": "{M-6} Bize arkadaşlarımızdan bir cemaatta Said b. Ebi Meryem'den rivayet ettiler. Demişki: Bize Ebu Gassan (bu zat Muhammed b. Mutarrif'dir), Zeyd b. Eslem'den naklen bu isnadla bu hadis'in mislini haber verdi",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6783,
			"arabicnumber": "2669.03",
			"text": "{M-6-2} Bize Ebu İshak İbrahim b. Muhammed (Dediki): Bize Muhammed b. Yahya rivayet etti. (Dediki): Bize İbni Ebi Meryem rivayet etti. (Dediki): Bize Ebu Gassan rivayet etti. (Dediki): Bize Zeyd b. Eslem, Ata' b. Yesar'dan rivayet etti. Ve hadisi yukarki gibi nakletmiştir",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6784,
			"arabicnumber": "2670",
			"text": "Bize Ebu Bekr b. Ebi Şeybe rivayet etti. (Dediki): Bize Hafs b. Gıyas ile Yahya b. Said, İbni Cüreyc'den, O da Süleyman b. Atik'den, oda Talk b. Habib'den o da Ahmed b. Kays'dan o da Abdullah'dan naklen rivayet ettiler. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) ; ''Taşkınlar helak olmuştur.'' buyurdu. Bunu üç defa söyledi",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6785,
			"arabicnumber": "2671.01",
			"text": "Bize Şeyban b. Ferrûh rivayet etti. (Dediki): Bize Abdü'l-Vâris rivayet etti, (Dediki): Bize Ebu't-Teyyah rivayet etti. (Dediki): Bana Enes b. Mâlik rivayet etti. (Dediki): Resûlullah (Sallallahu Aleyhi ve Sellem) ; «Kıyamet alâmetlerinden bâzıları İlm'in kaldırılması, cehlin subut bulması, şarab'ın içilmesi ve zina'nın açığa çıkması dır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6786,
			"arabicnumber": "2671.02",
			"text": "Bize Muhammud b. Müsennâ ile İhni Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Katâde'yi, Enes b. Mâlik'den naklen rivayet ederken dinledim. Enes şöyle demiş: Size Resûlullah (Sallallahu Aleyhi ve Sellem)'den dinlediğim bir hadîsi rivayet edeyim mi? Onu kendisinden işitmiş olarak benden sonra size hiç bir kimse rivayet etmez : «Şüphesiz ki, kıyâmet alâmetlerinden bâzıları ilm'in kaldırılması, cehlin zuhur etmesi, zinanın alıp yürümesi, şarabın içilmesi ve erkekler giderek kadınların kalmasıdır. Hattâ elli kadına bakacak bir kayyım olacaktır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6787,
			"arabicnumber": "2671.03",
			"text": "{M-9} Bize Ehû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Hammed b. Bişr rivayet etti. H. Bize Ebû Kureyb de rivayet etti. (Dediki): Bize Abde ile Usâme rivayet ettiler. Bu râvilerin hepsi Saîd b. Ebî Arûbe'den, o da Katâde'den, o da Enes b. Mâlik'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etmişlerdir. İbnü Bişr ile Abde'nin hadîslerinde: «Onu size benden sonra kimse rivayet etmez. Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken işittim...» ibaresi vardır. Ve râvi hadîsi yukarki gibi anlatmıştır. İZAH 2673 TE",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6788,
			"arabicnumber": "2672.01",
			"text": "Bize Muhammed b. Abdillah b. Numeyr rivayet etti. (Dediki): Bize Veki' ile babam rivayet ettiler. (Dedilerki): Bize A'meş rivayet etti. H. Bana Ebû Saîd El-Eşec de rivayet etti. Lâfız onundur. (Dediki): Bize Veki' rivayet etti. (Dediki): Bize A'meş, Ebû Vâil'den rivayet etti. (Demişki): Abdullah ve Ebû Musa ile birlikte oturuyordum. Şunu söylediler: Resûlullah (Sallallahu Aleyhi ve Sellem) ; «Şüphesiz kıyametin önünde öyle günler vardır ki, o günlerde ilim kaldırılacak, cehil inecek, o günlerde here çoğalacaktır. Here katildir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6789,
			"arabicnumber": "2672.02",
			"text": "{M-10} Bize Ebû Bekr b. Nadr b. Ebî'n-Nadr rivayet etti. (Dediki): Bize Ebu'n-Nadr rivayet etti. (Dediki): Bize Ubeydullah El-Eşcaî, Süfyân'dan, o da A'meş'den, o da Ebû Vail'den, o da Abdullah ile Ebû Musa'I-Eş'arî'den naklen rivayet etti. Şöyle demişler: Resûlullah (Sallallahu Aleyhi ve Sellem) buyurduki... H. Bana Kasım b. Zekeriyya da rivayet etti. (Dediki); Bize Huseyn EI-Cu'fi, Zâide'den, o da Süleyman'dan, o da Şakîk'den naklen rivayet etti. Şöyle demiş: Abdullah ve Ebû Musa ile birlikte oturuyordum. Onlar konuşuyorlardı. Ve: Resûlullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, dediler. Râvi, Veki' ile İbni Numeyr'm hadîsi gibi rivayette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6790,
			"arabicnumber": "2672.03",
			"text": "{M-10-2} Bize Ebû Bekr b. Ebî Şeybe ile Ebû Kureyb, ibni Numeyr ve İshâk El-Hanzalî toptan Ebû Muâviye'den, o da A'meş'den, o da Şakîk'dan, o da Ebû Musa'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsin mislini rivayet ettiler",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6791,
			"arabicnumber": "2672.04",
			"text": "{M-10-3} Bize İshâk b. İbrahim rivayet etti, (Dediki): Bize Cerir A'meş'den, o da Ebû Vâil'den naklen haber verdi. (Şöyle demiş): Ben Abdullah ve Ebû Musa ile birlikte oturuyordum. Onlar konuşuyorlardı. Ebû Musa şöyle dedi: Resûlullah (Sallallahu Aleyhi ve Sellem) buyurdular ki... Râvi yukarkİ hadîsin mislini anlatmıştır. İZAH 2673 TE",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6793,
			"arabicnumber": "157.05",
			"text": "Bana Harmele b, Yahya rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus, İbni Şihab'dan naklen haber verdi. (Demişki): Bana Humeyd b. Abdirrahman b. Avf rivayet ettiki: Ebû Hureyre şunu söylemiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Zaman yaklaşacak, ilim alınacak, fitneler zuhur edecek, cimrilik yerleşecek ve herc çoğalacaktır.» buyurdu. Ashâb : — Herc nedir? diye sordular. «Katildir...» buyurdu",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6794,
			"arabicnumber": "157.06",
			"text": "(Bize Muhammed b. Râfi' dahi rivâyet etti. ki): Bize Abdür-rezzak rivâyet etti. ki): Bize Ma'mer, Hammad b. Münebbih'den, o da Ebû Hüreyre'den naklen rivâyet etti. H",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6795,
			"arabicnumber": "157.08",
			"text": "{M-12} Bize Yahya b. Eyyûb ile Kuteybe ve îbni Hucur rivayet ettiler. (Dedilerki): Bize İsmail (yâni İbni Ca'fer) Alâ'dan, o da babasından, o da Ebû Hureyre'den naklen rivayet etti. H. Bize İbni Numeyr ile Ebû Kureyb ve Amru'n-Nâkid da rivayet ettiler. (Dedilerki): Bize İshâk b. Süleyman, Hanzele'den, o da Sâlim'den, o da Ebû Hureyre'dcn naklen rivayet etti. H. Bize Muhammed b. Râfi' dahî rivayet etti. (Dediki): Bize Abdürrezzak rivayet etti. (Dediki): Bize Ma'mer, Hemmam b. Münebbih'den, o da Ebû Hureyre'den naklen rivayet etti. II. Bana Ebu't-Tahir dahi rivayet etti. (Dediki): Bize İbni Vehb Amr b. Hâris'den, o da Ebû Yûnus'tan, o da Ebû Hureyre'den naklen haber verdi. Bu râvilerin hepsi Zührî'nin Humeyd'den, onun da Ebû Hureyre'den rivayet ettiği hadîs gibi: «Nebi (Sallallahu Aleyhi ve Sellenı)'den» dediler. Yalnız onlar: «Cimrilik yerleştirilir...» cümlesini anmadılar. İZAH 2673 TE",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6796,
			"arabicnumber": "2673.01",
			"text": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Cerîr, Hişam b. Urve'den, o da babasından naklen rivayet etti. (Demişki): Ben Abdullah b. Amr b. Âs'ı şöyle derken işittim. Resûlullah (Sallallahu Aleyhi ve Sellem)'i «Şüphesiz Allah ilmi insanlardan çekip alıvermez. Lâkin ilmi, ulemâyı almakla kaldırır. Nihayet hiç bir âlim bırakmadığı vakit, İnsanlar bir takım cahilleri baş edinirler. Onlara sual sorulur, ilimsiz fetva verirler; bu suretle hem saparlar, hem saptırırlar.» buyururken İşittim",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6797,
			"arabicnumber": "2673.02",
			"text": "{m-13} Bize Ebu'r-Rabi' El-Atekî rivayet etti. (Dediki): Bize Hammad (yâni İbni Zeyd) rivayet etti. H. Bize Yahya b. Yahya da rivayet etti. (Dediki); Bize Abbad b. Abbâd ile Ebû Muâviye haber verdiler. H. Bize Ebû Bekr b. Ebî Şeybe ile Züheyr b. Harb da rivayet ettiler. (Dedilerki): Bize Veki' rivayet etti. Ii. Bize Ebû Kureyb dahi rivayet etti. (Dediki): Bize İbni İdris ile Ebû Usâme, İbni Numeyr ve Abde rivayet ettiler. II. Bize İbni Ebî Ömer de rivayet etti. (Dediki): Bize Süfyân rivayet etti. II. Bana Muhammed b. Hatim de rivayet etti. (Dediki): Bize Yahya b. Saîd de rivayet etti. H. Bana Ebû Bekr b. Nâfi' dahî rivayet etti. (Dediki): Bize Ömer b. Ali rivayet etti. H. Bize Abd b- Humeyd dahî rivayet etti, (Dediki): Bize Yezid b, Harun rivayet etti. (Dediki): Bize Şu'be b. Haccâc haber verdi. Bu râvilerin hepsi Hişâm b. Urve'den, o da babasından, o da Abdullah h. Amr'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen Cerîr'in hadîsi gibi rivayet ettiler. Ömer b. Ali'nin hadîsinde şu ziyade de vardır: «Sonra Abdullah b. Amr'a sene başında rastlayarak kendisine sordum da, bize hadîsi eskiden rivayet ettiği gibi iade etti. Ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i buyururken işittim, dedi.»",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6798,
			"arabicnumber": "2673.03",
			"text": "{m-13-2} Bize Muhammed b. Müsennâ rivayet etti. (Dediki): Bize Abdullah b. Humran, Abdu'l-Hamid b. Ca'fer'den rivayet etti. (Demişki): Bana babam Ca'fer, Ömer b. Hakem'den, o da Abdullah b. Amr b. Âs'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi. Ravi Hişâm b. Urve'nin hadîsi gibi rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6799,
			"arabicnumber": "2673.04",
			"text": "Bize Harmele b. Yahya Et-Tü'cîbî rivayet etti. (Dediki): Bize Abdullah b. Vehb haber verdi. (Dediki): Bana Ebû Şüreyh rivayet etti. Ona da Ebu'l-Esved, Urve b. Ziibeyr'den naklen rivayet etmiş. Urve (Demişki): Bana Âişe şunu söyledi: — Ey kız kardeşimoğlu! Duydum ki, Abdullah b. Amr hac'ca giderken bize uğrayacakmış. Onunla görüş de kendisine (bir şeyler) sor! Çünkü o Nebi (Sallallahu Aleyhi ve Sellem)'den çok ilim nakletmiştir. Urve demiş ki: Bunun üzerine ben kendisiyle görüşerek ona birçok şeyler sordum. Onları Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen söylüyordu. Urve şöyle demiş: Anlattıkları meyanında şu da vardı. Nebi (Salîallahu Aleyhi ve Sellem): «Şüphesiz Allah ilmi İnsanlardan çekip ahvermez. Lâkin ulemâyı kabzeder, onlarla birlikte İlmi de kaldırır. Ve insanlar arasında bîr takım câhil başlar bırakır. Bunlar insanlara ilimsiz fetva verirler; bu suretle hem saparlar, hem saptırırlar.» buyurdular. Urve şöyle demiş: Ben bu hadîsi Âişe'ye rivayet ettiğim vakit onu pek büyük gördü ve yadırgadı. — Sana kendisinin Nebi (Sallallahu Aleyhi ve Sellem) bunu söylerken işittiğini anlattı mı? dedi, Urve demiş ki : Ertesi sene olunca Âişe bana : — İbni Amr gelmiş onunla görüş, sonra ona söz aç, tâ ki ilim hakkında sana anlattığı hadîsi kendisine sor! dedi. Ben de kendisiyle görüşerek ona bir şeyler sordum. Ve bu hadîsi bana ilk defada anlattığı gibi anlattı. Urve şöyle demiş : Âişe'ye bunu haber verdiğim vakit: — Onun doğru söylemekten başka bir şey yapmadığını zannederim. Sanırım ki, bu hadîse hiç bir şey ziyâde ve noksan etmemiştir.» dedi",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6800,
			"arabicnumber": "1017.05",
			"text": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Cerîr b. Abdi'l-Hamid A'meş'den, o da Musa b. Abdillah b. Yezid ile Ebu'd-Duha'dan, onlar da Abdurrahman b. Hilâl El-Absî'den, o da Cerîr b. Abdillah'dan naklen rivayet etti. Şöyle demiş: Bedevilerden bir takım insanlar Resûlullah (Sallallahu Aleyhi ve Selîem)'e geldiler. Üzerlerinde yün elbiseler vardı. Resûlullah (Sallallahu Aleyhi ve Sellem) hallerinin kötülüğünü, muhtaç kaldıklarını gördü de halkı onlara sadaka vermeye teşvik etti. Fakat halk ona gelmekte geciktiler. Hattâ bu hâl yüzünden belli oldu. Sonra ensardan bir zat bir kese gümüş getirdi. Sonra bir başkası geldi. Sonra ashab birbirinin peşinden geldiler. Nihayet yüzünden sevindiği anlaşıldı. Ve Resûlullah (Sallallahu Aleyhi ve Sellem) : «Bir kimse İslâm'da güzel bir çığır açar da, kendisinden sonra onunla amel edilirse, o kimseye bu çığırla amel edenlerin ecri kadar sevab yazılır. Amel edenlerin ecirlerinde de bir şey eksilmez. Ve her kim islâm'da kötü bir çığır açar da kendinden sonra onunla amel olunursa, o kimsenin aleyhine bu çığırla amel edenlerin günahı kadar günah yazılır. Amel edenlerin günahlarından da bîr şey eksilmez.» buyurdular",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6801,
			"arabicnumber": "1017.06",
			"text": "{m-15} Bize Yahya b. Yahya ile Ebû Bekr b. Ebî Şeybe ve Ebû Kureyb toptan Ebî Muâviye'den, o da A'meş'den, o da Müslim'den, o da Abdurrahman b. Hilâl'den, o da Cerîr'den naklen rivayet ettiler. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) hutbe okuyarak sadakaya teşvik etti... Râvi Cerîr'in hadîsi mânâsında rivayette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6802,
			"arabicnumber": "1017.07",
			"text": "{m-15-2} Bize Muhammed b. Beşşâr rivayet etti. (Dediki): Bize Yahya (îbni Saîd) rivayet etti. (Dediki): Bize Muhammed b. Ebî İsmail rivayet etti. (Dediki): Bize Abdurrahman b. Hilâl El-Absî rivayet etti. (Dediki): Cerîr b. Abdillah şunu söyledi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Bir kul elverişli bîr çığır açar da, kendinden sonra onunla amel olunursa...» buyurdular. Sonra râvi hadîsin tamamını zikretmiştir",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6803,
			"arabicnumber": "1017.08",
			"text": "{m-15-3} Bana Ubeydullah o, Ömer EI-Kavârîrî ile Ebû Kâmil ve Muhammed b. Abdi'l-Melik El-Ümevî rivayet ettiler. (Dedilerki): Bize Ebu Avâne, Abdü'l-Melik b, Umeyr'den, o da Münzir b. Cerîr'den, o da babasından, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. H, Bize Muhammcd b. Müsennâ da rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. H. Bize Ebû Bekr b. Ebî Şeybe dahî rivayet etti. (Dediki): Bize Ebû Usâme rivayet etti. H. Bize Ubeydullah b. Muâz da rivayet etti. (Dediki): Bize babam rivayet etti. Bu râviler (Dedilerki): Bize Şu'be Avn b. Ebi Cuhayle'den, o da Münzir b. Cerîr'den, o da babasından, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen hu hadîsi rivayet etti. İZAH 2674 TE",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6804,
			"arabicnumber": "2674",
			"text": "Bize Yahya b. Eyyûb ile Kuteybe b. Saîd ve İbni Hucr rivayet ettiler. (Dedilerki): Bize İsmail yâni İbni Ca'fer Alâ'dan, o da babasından, o da Ebû Hureyre'den naklen rivayet ettiki: Resûlullah (Sallallahu Aleyhi ve Sellem): «Bir kimse doğru bîr yola da'vet ederse, ona tâbi olanların ecirleri kadar kendisi için ecir olur. Bu, tâbi olanların ecrinden bir şey eksiltmez. Ve her kim bir dalâlete davel ederse, ona tâbi olanların günahları kadar kendine günah olur. Bu, tâbi olanların günahlarından hiç bir şey eksiltmez.» buyurdular",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 30
			}
		}
	]
}