{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"49": "The Book of Heart-Melting Traditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6937,
			"arabicnumber": "2736",
			"text": "Bize Heddâb b. Hâlid rivayet etti. (Dedikî): Bize Hammad b. Seleme rivayet etti. H. Bana Züheyr b. Harb da rivayet etti. (Dedikî): Bize Muâz b. Muâz El-Anberî rivayet etti. H. Bana Muhammed b. Abdi'l-A'lâ dahî rivayet etti. (Dedikî): Bize Mu'temir rivayet etti. H. Bize İshâk b. İbrahim de rivayet etti. (Dedikî): Bize Cerir haber verdi. Bunların hepsi Süleyman Et-Teymî'den rivayet etmişlerdir. H. Bize Ebû Kâmil Fudayl b. Hüseyn de rivayet etti. Lâfız onundur. (Dedikî): Bize Yezîd b. Zürey rivayet etti. (Dedikî): Bize Teymî, Ebû Osman'dan, o da Usâme b. Zeyd'den naklen rivayet etti. (Demişki): Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdular: «Cennetin kapısında durdum. Bir de gördüm ki, ona girenler hep fakirlerdir. Mevki sahipleri mahpusdurlar. Yalnız cehennemlikler müstesna! Onlar cehenneme (götürülmeye) emrolunmuşlardır. Bir de cehennemin kapısında durdum. Gördüm ki : Umumiyetle oraya girenler kadınlardır!» İZAH 2738 DE",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6938,
			"arabicnumber": "2737.01",
			"text": "Bize Züheyr b. Harb rivayet etti. (Dedikî): Bize İsmail b. İbrahim Eyyub'dan, o da Ebû Recâ' El-Utâridî'den naklen rivayet etti. (Demişki): İbni Abbâs'ı şunu söylerken işittim: Muhammed (Sallallahu Aleyhi ve Sellem): «Cennete muttali oldum. Ve ekseri ehlinin fakirler olduğunu gördüm, cehenneme muttali oldum ve ekser ehlinin kadınlar olduğunu gördüm! buyurdular",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6939,
			"arabicnumber": "2737.02",
			"text": "{M-94} Bize bu hadîsi İshâk b. İbrahim de rivayet etti. (Dedikî): Bize Sekafî haber verdi. (Dedikî): Bize Eyyûb bu isnadla haber verdi",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6940,
			"arabicnumber": "2737.03",
			"text": "{M-94-2} Bize Şeyban b. Ferrûh da rivayet etti. (Dedikî): Bize Ebû'l-Eşheb rivayet etti. (Dedikî): Bize Ebû Recâ' İbni Abbas'dan naklen rivayet etti ki: Nebi (Sallallahu Aleyhi ve Sellem) cehennem'e muttali olmuş... Ve râvi Eyyub'un hadîsi gibi anlatmıştır",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6941,
			"arabicnumber": "2737.04",
			"text": "{M-94-3} Bize Ebû Kureyb rivayet etti. (Dedikî): Bize Ebû Usâme, Saîd b. Ebî Arûbe'den rivayet etti. O da Ebû Reca'yı İbni Abbas'dan naklen rivayet ederken dinlemiş. (Demişki): Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdular... Ve râvi yukarki hadîsin mislini anlatmıştır, İZAH 2738 DE",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6942,
			"arabicnumber": "2738.01",
			"text": "Bize Ubeydullah b. Muâz rivayet etti. (Dedikî): Bize tabam rivayet etti. (Dedikî): Bize Şu'be, Ebû Teyyah'dan rivayet etti. (Demişki): Mutarrif b. Abdullah'ın iki karısı vardı. Onların birinin yanından geldi de, öteki: — Sen filân hanımın yanından mı geldin? diye sordu. O da: — Ben İmran b. Husayn'ın yanından geldim. Bize rivayet etti ki: Resulullah (Sallallahu Aleyhi ve Selleın): «Muhakkak cennet sâkinlerinin en azı kadınlardır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6943,
			"arabicnumber": "2738.02",
			"text": "{M-95} Bize Muhammed b. Velîd b. Abdi'l-Hamid de rivayet etti. (Dedikî): Bize Şu'be, Ebû Teyyah'dan rivayet etti. (Demişki): Mutarrıf'i rivayet ederken dinledim. Kendisinin iki karısı varmış... Râvî Muaz'ın hadîsi mânâsında rivayette bulunmuştur",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6944,
			"arabicnumber": "2739",
			"text": "Bize Ebû Zür'a Ubeydullah b. Abdi'l-Kerim rivayet etti. (Dedikî): Bize İbni Bükeyr rivayet etti. (Dedikî): Bana Ya'kub b. Abdirrahman Musa b. Ukbe'den, o da Abdullah b. Dinar'dan, o da Abdullah b. Ömer'den naklen rivayet etti. (Demişki): Resûlullah (Sallallahu Aleyhi ve Sellem)'in bir duası da şuydu : «Allahım! Ben nimetinin zevalinden, afiyetinin değişmesinden intikamınla bütün hısımının anîden gelmesinden sana sığınırım.»",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6945,
			"arabicnumber": "2740",
			"text": "Bize Saîd b. Mansûr rivayet etti. (Dedikî): Bize Süfyân ile Mu'temir b. Süleyman, Süleyman Et-Teymî'den, o da Ebû Osman En-Nehdî'den, o da Usâme b. Zeyd'den naklen rivayet etti. (Şöyle demiş): Resulullah (Sallallahu Aleyhi ve Sellem): «Kendinden sonra erkeklere kadınlardan daha zararlı bir fiîne bırakmadım.» buyurdular. İZAH 2742 DE",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6946,
			"arabicnumber": "2741.01",
			"text": "Bize Ubeydullah b. Muaz El-Anberî ile Süveyd b. Saîd ve Muhammed b. Abdi'l-A'la toptan Mu'temir'den rivayet ettiler. İbni Muâz (Dedikî): Bize Mu'temir b. Süleyman rivayet etti. (Dedikî): Babam şunu söyledi: Bize Ebû Osman, Usâme b. Zeyd b. Harise ile Saîd b. Zeyd b. Amr b. Nüfeyl'den rivayet etti. Onlar da Resulullah (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etmişlerki, şöyle buyurmuş : «Kendimden sonra insanlar içinde erkeklere kadınlardan daha zararlı bir fitne bırakmadım.»",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6947,
			"arabicnumber": "2741.02",
			"text": "{M-98} Bize Ebû Bekr b. Ebî Şeybe ile İbni Numeyr de rivayet ettiler. (Dedilerki): Bize Ebû Hâlid El-Ahmer rivayet etti. H. Bize Yahya b. Yahya da rivayet etti. (Dedikî): Bize Hüşeym haber verdi. H. Bize İshâk b. İbrahim dahi rivayet etti. (Dedikî): Bize Cerir haber verdi. Bu râvilerin hepsi Süleyman Et-Teymî'den bu isnadla bu hadîsin mislini rivayet etmişlerdir. İZAH 2742 DE",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6948,
			"arabicnumber": "2742",
			"text": "Bize Muhammed b. Müsennâ ile Muhammed b, Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Ebû Mesleme'den rivayet etti. (Demişki): Ebû Nadra'yı, Ebû Saîd'i Hudrî'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet ederken dinledim. Şöyle buyurmuşlar : «Şüphejiz dünya tatlı, yeşildir. Ve şüphesiz Allah sizi dünyaya halife kılmıştır. Ama ne yapacaksınız diye bakar. İmdi dünyadan korunun, kadınlardan da korunun! Çünkü Benî İsrail'in ilk fitnesi kadınlarda idi.» İbnû Beşşâr'ın hadîsinde: «Ne yapacağınıza bakmak için...» ibaresi vardır",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6949,
			"arabicnumber": "2743.01",
			"text": "Bana Muhammed b. İshak El-Müseyyebî rivayet etti. (Dedikî): Bana Enes (yâni Ebû Damra İbni İyâd) Musa b. Ukbe'den, o da Nâfi'den, o da Abdullah b. Ömer'den, o da Resulullah (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. Ki, şöyle buyurmuşlar : «Bir zamanlar üç kişi yolda giderlerken kendilerini yağmur tutmuş ve dağda bir mağaraya sığınmışlar. Arkacığsndan mağaranın ağzına dağdan bir kaya düşmüş ve onları kapamış. Bunun üzerine yolcular birbirlerine : — Bakın Allah için sâlih amel işledinizse, o ameller vasıtasıyle Allah'a duâ edin. Ola ki, Allah bu kayayı sizden açar, demişler, içlerinden biri : — Allahım! Benim iki ihtiyar geçkin ana-babam!a, bir karım ve küçük çocuklarım vardı. Onlara iyi bakardım. Hayvanlarımı yanlarına getirdiğim vakit süt sağar, evvelâ annemle babamdan başlsyarak çocuklanmdan önce onlara içirirdim. Şu var ki: Bir gün ağaçlık beni uzaklara götürdü de akşamlayıncaya kadar gelemedim. Ve onları uyumuş buldum. Hemen evvelce yaptığım gibi süt sağdım. Ve kabı getirerek başları ucuna dikildim. Onları uykularından uyandırmaya kıyamıyor; çocuklara da onlardan evvel süt vermekten çekiniyordum. Çocuklar ayaklarımın dibinde çağrışıyorlardı. Benim ve çocukların hâli bu minval üzere fecir doğuncaya kadar devam etti. Eğer benim bunu senin rızanı dileyerek yaptığını biliyorsan, bu kayadan bize bir mikdarını arala da, ondan gökyüzünü görelim, demiş. Bunun üzerine Allah kayanın bir mikdarını aralamış ve ondan gökyüzünü görmüşler. Diğeri : — Allahım! Benim bir amcam kızı vardı. O'nu erkeklerin kadınları sevmesinin en son derecesiyle sevmiştim. Ondan kendisiyle evlenmek taleb ettim. Ama o, kendisine yüz altın getirmedikçe bunu kabul etmedi. (Çalışıp) Yoruldum. Nihayet yüz altını topladım ve ona götürdüm. Ayaklarının önüne oturduğumda : __ Ey Allah'ın kulu! Allah'dan kork ve bu mührü nahak yere açma! dedi. Ben de yanından kalktım. Eğer bunu senin rızânı dileyerek yaptığımı biliyorsan, bu kayanın bir kısmını bize aç, demiş. Allah Teâla da onlara (bir miktar daha) açmış, öteki : -- Allahım! Ben bir ölçek pirince bir çırak tutmuştum, işini bitirdiği vakit : — Bana hakkımı ver! dedi. Ben de kendisine ölçeğini arzettim. Fakat o kabul etmedi. Onu ekmeye devam ettim. Nihayet o pirinçten çobanlarıyla birlikte bir sürü sığır elde eltim. Derken bana geldi ve : __ Allah'dan kork da benim hakkıma zulmetme! dedi. Ben : __ Çobanlarıyle beraber şu sığırlara git de onları al! dedim. (Bu sefer): — Allah'dan kork! Benimle alay etme! dedi. __ Ben seninle alay etmiyorum. Bu sığırları çobanlarıyle birlikte al! dedim. O da aldı, götürdü. Eğer bunu senin rızanı taleb için yaptığımı biliyorsan, bize (kayanın) kalan kısmını da aç! demiş. Bunun üzerine Allah kalan kısmı da açmış.»",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6950,
			"arabicnumber": "2743.02",
			"text": "{M-100} Bize İshûk b. Mansûr ile Abd b. Humeyd de rivayet ettiler. (Dedilerki): Bize Ebû Asım, İbni Cüreyc'den naklen haber verdi. (Demişki): Bana Musa b. Ukbe haber verdi. H. Bana Süveyd b. Saîd de rivayet etti. (Dedikî): Bize Ali b. Mûshir Ubeydullah'dan rivayet etli. H. Bana Ebû Kureyb ile Muhammed b. Tarif El-Becelî dahi rivayet ettiler. (Dedilerki): Bize İbni Fudayl rivayet etti. (Dedikî): Bize Ebû Varakabe b. Meskale rivayet etti. H. Bana Züheyr b. Harb ile Ilascn El-IIulvâni ve Abd b. Humeyd de rivayet ettiler. (Dedilerki): Bize Ya'kub (yâni; İbni İbrahim b. Sa'd) rivayet etti. (Dedikî): Bize babam, Salih b. Keysan'dan rivayet etti. Bu râvilerin hepsi Nâfi'den, o da İbni. Ömer'den, o da Peygamber (Sallallahu Aleyhi ve Sellem)'den naklen Ebû Damre'nin Musa b. Ukbe'den rivayet ettiği hadîs mânâsında rivayette bulunmuşlardır. Onlar hadîslerinde: «yürümeye çıkmışlardı...» cümlesini de ziyâde etmişlerdir. Salih'in hadîs'inde: «gezinti yapıyorlardı...» cümlesi vardır. Yalnız Ubcydullah müstesna! Çünkü onun hadîsinde: «çıkmışlardı...» cümlesi vardır. Ondan sonra bir şey anmamıştır",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6951,
			"arabicnumber": "2743.03",
			"text": "{M-100-2} Bana Muhammed b. Sehl Et-Temînıî ile Abdullah b. Abdirrahman b. Behram ve Ebû Bekr b. İshâk rivayet ettiler. (İbni Sehl: Haddesena, dedi. Ötekiler: Ahberana tâbirini kullandılar. Dedilerki): Bize Ebû'l-Yeman haber verdi. (Dedikî): Bize Şuayb, Zührî'den naklen haber verdi. (Demişki): Bana Salim b. Abdillah haber verdiki, Abdullah b. Ömer şöyle demiş: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken dinledim: «Sizden öncekilerden üç kişi yola koyuldular. Nihayet onları geceleme (ihtiyacı) bir mağaraya sığındırdı...» Ve râvi hadîsi Nâfi'in, İbni Ömer'den rivayet ettiği hadîs mânâsında anlatmıştır. Şu kadar var ki o : «Onlardan bir adam: Allahım! Benim ihtiyar yaşlı anne-babam vardı. Ben onlardan önce ne aileye içeceî: bir şey verirdim, ne de mal'a...» demiştir. Bir de şöyle demiştir: «Kız bana gelmekten imtina etti. Hattâ kıtlığa duçar oldu. Bunun üzerine bana geldi. Ben de ona yüz yirmi altın verdim.» Şunu da söylemiştir: «Ben onun ücretini ürettim. Hattâ ondan dalga dalga birçok mallar meydana geldi.» Şunu da söylemiştir: «Müteakiben mağaradan çıkıp gittiler",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 15
			}
		}
	]
}