{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"51": "Characteristics of The Hypocrites And Rulings Concerning Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7024,
			"arabicnumber": "2772",
			"text": "(Bize Ebû Bekr b. Ebi Şeybe rivâyet etti. ki): Bize Hasen b. Mûsa rivâyet etti. ki): Bize Züheyr b. Muâviye rivâyet etti. ki): Bize Ebû İshak rivâyet etti ki: Kendisi Zeyd b. Erkam'ı şöyle derken işitmiş. Resûlüllah (sallallahü aleyhi ve sellem)'le birlikte bir seferde halka kıtlık isabet etti. Bunun üzerine b. Ubey: «Medine'ye dönersek elbette kuvvetli olan zelili oradan çıkaracaktır.» dedi. Bunun üzerine ben Peygamber (sallallahü aleyhi ve sellem)'e gelerek bunu kendisine haber verdim. Az sonra o da Abdullah b. Übey'ye haber göndererek ona sordu. Abdullah yapmadığına var kuvvetiyle yemin yerdi. Ve: Zeyd, Resûlüllah (sallallahü aleyhi ve sellem)'e yalan söylemiş dedi. Bunun üzerine onların söylediklerinden kalbınıe bir şiddet düştü. Nihayet Allah beni tasdik ederek: «Münafıklar geldiği vakit...» sûresini indirdi. ki: Sonra Peygamber (sallallahü aleyhi ve sellem) kendilerine istiğfarda bulunmak için onları çağırdı. Ama onlar başlarını çevirdiler. Bir de şu âyet indi: sanki dayanmış odunlardır.» bunlar en güzel adamlardı, demiş",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7025,
			"arabicnumber": "2773.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Züheyr b. Harb ve Ahmed b. Abdete'd-Dabbî rivâyet ettiler. Lâfız İbn Ebî Şeybe'nindir. (İbn Abde: Ahberana; ötekiler: Haddesena tâbirlerini kullandılar. Dediler ki): Bize Süfyan b. Uyeyne Amr'dan rivâyet etti ki: Cabir'i şöyle derken işitmiş: Peygamber (sallallahü aleyhi ve sellem) Abdullah b. Übey'yin kabrine geldi ve onu kabrinden çıkararak dizleri üzerine koydu. Üzerine tükürüğünden üfürdü, oıla gömleğini de giydirdi. Ama Allah bilir",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7026,
			"arabicnumber": "2773.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7027,
			"arabicnumber": "2774.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7028,
			"arabicnumber": "2774.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7029,
			"arabicnumber": "2775.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7030,
			"arabicnumber": "2775.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7031,
			"arabicnumber": "2776.01",
			"text": "(Bize Ubeydullah b. Muâz El-Anberî rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Şu'be, Adiy'den (bu zat İbn Sâbit'dir.) rivâyet etti. ki): Ben Abdullah b. Yezîd'i, Zeyd b. Sâbit'den naklen rivâyet ederken dinledim ki, Peygamber (sallallahü aleyhi ve sellem) Uhud harbine çıkmış da, beraberindeki insanlardan bazıları geri dönmüş. Bunlar hakkında Peygamber (sallallahü aleyhi ve sellem)’in ashabı iki fırkaya ayrılmışlar. Bazıları bunları öldürelim; bazıları da hayır, öldürmeyelim, demişler. Bunun üzerine: ne oluyor kif münafıklar hakkında iki fırkaya ayrılıyorsunuz?\" Nisa Sûresi, âyet: 88 âyet-i kerîmesi nâzıl olmuş",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7032,
			"arabicnumber": "2776.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7033,
			"arabicnumber": "2777",
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7034,
			"arabicnumber": "2778",
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7035,
			"arabicnumber": "2779.01",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Esved b. Âmir rivâyet etti. ki): Bize Şu'be b. Haccac, Katâde'den, o da Ebû Nadra'dan, o da Kays'dan naklen rivâyet etti. Kays şöyle dedi: Ammâr'a: Alî'nin işi hakkında şu yaptığınıza ne dersiniz? Bunu kendi re'yinizle mi yaptınız yoksa size Resûlüllah (sallallahü aleyhi ve sellem)’in vasiyet ettiği bir şey mi? diye sordum. Ammâr: Bize Resûlüllah (sallallahü aleyhi ve sellem) bütün insanlara bildirmediği bir şey vasiyet etmiş değildir. Velâkin Huzeyfe ana Peygamber (sallallahü aleyhi ve sellem)’den naklen haber verdi. ki): Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdular: içinde on iki münafık vardır. Onlardan sekizi deve iğne deliğine girinceye kadar cennete giremezler. Onlardan sekizine senin namına ateşden bir kandil yeter. Dördüne gelince:» Bunlar hakkında şube'nin ne söylediğini belleyemedim, dedi",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7036,
			"arabicnumber": "2779.02",
			"text": "Bize Muhammed b. Müsennâ ile Muhammed b. Beşşâr rivâyet ettiler. Lâfız İbn Müsennâ'nındır. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be, Katâde'den, o da Ebû Nadra'dan, o da Kays b. Ubâd'dan naklen rivâyet etti. (Şöyle dedi): Ammâr'a: Harbetmenize ne dersiniz? Bunu kendi re'yinizle mi yaptınız. Şüphesiz ki re'y ba'zan hata eder ba'zan isabet! Yoksa bu size Resûlüllah (sallallahü aleyhi ve sellem)’in yaptığı bir vasiyet mi? diye sorduk. O da: Resûlüllah (sallallahü aleyhi ve sellem) bütün insanlara vasiyet etmediği bir şeyi bize vasiyet etmiş değildir, cevâbını verdi. Ve şunu söyledi: Şüphesiz Resûlüllah (sallallahü aleyhi ve sellem): içinde...» tuyurdular. Şu'ue ki: Zannederim bana Huzeyfe rivâyet etti, dedi. Şöyle dedi: Zannederim: Ümmetim içinde on iki münafık vardır. Bunlar deve iğne deliğine girinceye kadar cennete giremeyecek, onun kokusun da bulamıyacaklardır. Onlardan sekizine senin namına dü-beyle (yani) omuzlarında meydana çıkacak tâ göğüslerinden yükselecek ateşten bir kandil yetecektir, dedi",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7037,
			"arabicnumber": "2779.03",
			"text": "(Bize Züheyr b. Harb rivâyet etti. ki): Bize Ebû Ahmed El-Kûfî rivâyet etti, ki): Bize Velid b. Cümey' rivâyet etti. ki): Bize Ebû't-Tufeyl rivâyet etti. ki): Akabelilerden tir adamla Huzeyfe arasında, insanlar arasında olağan bazı şeyler vardı. O adam dedi ki: Allah aşkına söyle, Akabeliler kaç kişiydiler? Bunun üzerine cemâat Huzeyfe'ye: Madem sordu, ona haber ver, dediler. Huzeyfe şunu söyledi: Bize ondört oldukları haber verilirdi. Şayet sen de onlardansan, bu cemâat onbeş kişi olur. Allah'a şehadet ederim ki, onlardan onikisi hem dünya hayâtında, hem de şâhidler dikildiği gün Allah'a ve Resûlüne düşmandırlar. Üçünü ma'zur görmüştür. Cemâat: Biz Resûlüllah (sallallahü aleyhi ve sellem)’in dellâlını işitmedik. Bu kavmin ne yapmak istediğini de bilmedik. Taşlık bir yerde idi. Yürüdü ve: su azdır. Benden önce onun yanına kimse varamaz.» buyurdu. Ama kendinden önce oraya varmış bir kavm buldu da, o gün kendilerine lanet etti, dediler. (sallallahü aleyhi ve sellem) ashab tâbirini kullanmakla benim sohbetime nisbet edilenler mânâsını kasdetmiştir. Nitekim ikinci rivâyette: Ümmetimin içinde, demiştir. iğne deliğinden geçinceye kader...» sözünden murad; ebediy-yen demektir. Yani; deve nasıl ebediyyen iğne deliğine giremezse, bunlar da ebediyyen cennete giremiyeceklerdir. Akabe, ensârın bey'at ettikleri Mina'daki Akabı değil, Tebûk yolu üzerinde bir yerdir. Tebûk gazasında münafıklar Resûlüllah (sallallahü aleyhi ve sellem)’e gadretmek için orada toplanmış, fakat Teâlâ Hazretleri Resûlü Ekremini onlardan korumuştu. Re-sûtüllah (sallallahü aleyhi ve sellem) arkasından gelen münafıkların şamatasını duyunca, onları geri çevirmek için Hazret-i Huzeyfe'ye emir vermiş. Münafıklar onu görünce Allah tarafından kalblerine korku düşerek acele geri dönmüş ve orduya karışmışlardı. Hazret-i Huzeyfe, Peygamberin yanına dönünce onları tanıyıp tanıyamadığını sormuş; o da yüzleri zırhlı olduğu için kendilerini tanıyamadığını, fakat hayvanlarını tanıdığım söylemişti. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) onları bana isimleriyle ve babalarının adlarıyle haber verdi. Inşaallah sabahleyin onları sana bildiririm.» demişti. Bundan dolayı halk münafıklar hususunda bilâhere dâima Hazret-i Huzeyfe'ye müracaat et-mislerdir. Resûlüllah (sallallahü aleyhi ve sellem)'in bu münafıkların kimler olduğunu gizli tutması, fitne çıkmasından endişe ettiği içindir, deniliyor",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7038,
			"arabicnumber": "2780.01",
			"text": "(Bize Ubeydullah b. Muâz El-Anberî rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Kurra b. Hâlid, Ebû'z-Zübeyr'den, o da Câbir b. Abdillah'dan naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): yoluna kim çıkacak? Gerçekten onun günahları Benî İsrail'in günahlarının affedildiği gibi affedilecektir.» buyurdular. Derken oraya ilk Çikan bizim süvarimiz (yani) Benî Hazrec'in süvarisi oldu. Sonra cemâatin hepsi geldi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): affedilmistir. Yalnız kail devenin sahibi müstesna.» buyurdu. Arkacığından biz o adamın yanına vararak: Gel Resûlüllah (sallallahü aleyhi ve sellem) senin için istiğfar etsin, dedik. Fakat o: Vallahi kaybolan hayvanımı bulmanı, benim için sizinkinin benim namıma istiğfar etmesinden daha makbuldür, dedi. Bu adam kaybolan hayvanını arayan biriydi",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7039,
			"arabicnumber": "2780.02",
			"text": "(Bize bu hadîsi Yahya b. Habîb El-Hârisî de rivâyet etti. ki): Bize Hâlid b. Haris rivâyet etti. ki): Bize Kurra rivâyet etti. ki): Bize Ebû'z-Zübeyr, Câbir b. Abdillah'dan rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): yahut Mirar yoluna kim çıkacak...» buyurdular. Muâz'ın hadîsi gibi rivâyette bulunmuş. Yalnız o: «Bir de baktık o adam kayıp hayvanını aramaya gelen bir ıbedevî imiş.» demiş. dağa çıkan sarp yol, demektir. Bazıları iki dağ arasındaki yol mânâsına geldiğini söylemişlerdir. mirar ve merar acı yemişi olan bir ağaçtır. Burada ondan murad; bu isimle anılan bir yerdir, Bu yer Hudeybiye'ye yakındır. Resûlüllah (sallallahü aleyhi ve sellem) Mürar yoluna kim çıkacak diye sorması, ya çıkılması güç bir yer olduğu yâbut düşman oraya yakın bulunduğu içindir. Huzeyfe (radıyallahü anh)'dan rivâyet olunduğuna göre, Resûlüllah (sallallahü aleyhi ve sellem), Tebûk'de suyun çok az olduğunu haber almış, ashabına: Inşaallah Tebûk suyuna varacaksınız. Ona kim varırsa, ben gelip emretmedikçe, kuşluk zamanına kadar kimse suya dokunmasın.» diye tenbihde bulunmuş, bunu dellâla ilân ettirmişti. Çünkü su iplik gibi akıyordu. Derken münafıklardan iki adam herkesten önce oraya vararak suya el sürdüler. Bundan dolayı Resûlüllah (sallallahü aleyhi ve sellem) kendilerine sitem etmiştir. Sonra ashabı o sudan avuçlarıyle azar azar alarak bir tuluma koymuşlar. Resûlüllah (sallallahü aleyhi ve sellem) bu sudan yüzünü ellerini yıkamış, ağzını çalkalamış ve suyu kaynağına iade etmiş. Bunun üzerine su gürül gürül akmağa başlamıştı. devenin sahibinin Ced b. Kays olduğu söylenir. Bu adam münafık idi",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7040,
			"arabicnumber": "2781",
			"text": "(Bana Muhammed b. Râfi' rivâyet etti. ki): Bize Ebu'n-Nadr rivâyet etti. ki): Bize Süleyman (bu zat İbn Muğî-ra'dır.) Sâbit'den, o da Enes b. Mâlik'den naklen rivâyet etti. (Şöyle dedi): Bizden (yani) Benî Neccâr'dan bir adam vardı ki, Bakara ile Âl-i İmrân Sûrelerini okumuştu. Peygamber (sallallahü aleyhi ve sellem)’e katilik yapıyordu. Derken kaçarak savuştu gitti. Ve ehl-i kitaba katıldı. Onlar kendisini kaldırdılar: Bu adam Muhammed'e kâtiplik yapıyordu, dediler. Ve onu beğendiler. Fakat çok geçemeden aralarında Allah onun boynunu helâk etti. Kendisine bir hendek kazarak, onu içine gömdüler. Ama yer onu yüzüne atmış olarak sabahladı. Sonra döndüler, ona tekrar bir çukur kazarak gömdüler. Yer yine onu yüzüne atmış olarak sabahladı. Sonra döndüler ona tekrar bir çukur kazarak gömdüler. Fakat yer yine onu yüzüne atmış olarak sabahladı. Nihayet onu atılmış olarak bıraktılar, hadîsi Buhârî «Kitâbu'l-Menâkıb-'de tahric etmiştir. Onun rivâyetinde, bu adamın evvelce hıristiyan olup, sonra müslümanlığı kabul ettiği, sonra yine hıristiyanlığa döndüğü bildirilmektedir. Hıristiyanlığa döndüğü vakit kavmine: benim ona yazdıklarımdan başka bir şey bilmez.» dermiş. Öldüğü zaman ona derin bir kuyu kazmışlarsa da cesedini yer kabul etmeyip, görenlere ibret olmak üzere onu dışafr atmıştır. Küffâr bunu görünce: Bu işi Muhammed ile ashabı yapmıştır. Onlardan kaçtığı için onun kabrini eşip, cesedini çıkardılar, diyerek onu daha derin bir kuyuya gömmüşlerse de, cesedini yine yer kabul etmeyip yüze atmış. Üçüncüde daha derin kazdıkları halde, yine dışarı atmış. Nihayet bunun insan işi olmadığına kanâat getirerek, onu gömmekten vaz geçmişlerdir",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7041,
			"arabicnumber": "2782",
			"text": "(Bana Ebû Küreyb Muhammed b. AhV rivâyet etti. ki): Bize Hafs (yani; İbn Gıyas), A'meş'den, o da Ebû Süfyan'dan, o da Câbir’den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) bir seferden gelmiş. Medine yakınına geldiği vakit nerdeyse atlıyı gömecek derecede şiddetli bir rüzgâr esmiş. Câbir Dedi ki, Resûlüllah (sallallahü aleyhi ve sellem); rüzgâr bir münafık öldüğü için gönderilmiştir.» buyurdular. Medine'ye geldiğinde gördü ki: Münafıklardan büyük bir münafık ölmüştür",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7042,
			"arabicnumber": "2783",
			"text": "(Bana Abbâs b. Abdî’l-Azîm El-Anberî rivâyet etti. ki): Bize Ebû Muhammed Nadr b. Muhammed b. Mûsa El-Yemâmî rivâyet etti. ki): Bize İkrime rivâyet etti. ki): Bize Iyaz rivâyet etti. ki): Bana babam rivâyet etti. ki): Resûlüllah (sallallahü aleyhi ve sellem) birlikte sıtmalı bir ilamı dolaşmaya gittik. Ben elimi onun üzerine koyarak: Vallahi bugünkü gibi şiddetle hararetli bir adam görmedim, dedim. Bunun üzerine Nebiyyullah (sallallahü aleyhi ve sellem): size kıyâmet gününde bundan daha şiddefle hararetli birini haber vereyim mi?» dedi. Ve o gün ashabından bulunan iki adam için: binmiş giden şu iki adam!» buyurdular",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7043,
			"arabicnumber": "2784.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7044,
			"arabicnumber": "2784.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 21
			}
		}
	]
}