{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7130,
			"arabicnumber": "2822",
			"text": "(Bize Abdullah b. Mesleme b. Ka'neb rivâyet etti. ki): Bize Hammad b. Seleme, Sabit ile Humeyd'den, onlar da Enes b. Mâlik'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): hoşa gitmeyen şeylerle sarılmış; cehennem de şehvetlerle sarılmıştır.»; buyurdular",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7131,
			"arabicnumber": "2823",
			"text": "(Bana Zülıeyr b. Harb da rivâyet etti. ki): Bize Şebâbe rivâyet etti. ki): Bana Verkâa' Ebû'z-Zinad'dan, o da A'rac'dan, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini rivâyet etti. hadîsi Buhârî «Kitâbu'r-Rikâk»'da tahric etmiştir. beyânına göre hadîs-i şerif Peygamber (sallallahü aleyhi ve sellem)’in fasîh, bedi' ve cevâmiu'l-kelim sözlerindendir. Cevâmiu'l-kelim çok mânâ ifade eden az sözler manasınadır. Böyle sözler yalnız Resûlüllah (sallallahü aleyhi ve sellem)'e mahsustur. Burada bu kabilden bir temsil yapmıştır. mânâsı şudur: Cennete ancak bu hoşa gitmeyen şeyleri yapmakla, cehenneme de şehvetler sebebiyle varılır. Bunlar cennetle cehennemi sarmış, perde arkasında bırakmıştır. Hoşa gitmeyen şeylere göğüs gererek cennetin perdesini yırtan, oraya girecek şehvetlerine kapılıp günah işleyenler de cehennemin perdesini yırtarak cehenneme girecektir. Buradaki hoşa gitmeyen şeylerden maksat, icrası nefse ağır gelen şeylerdir. İbâdetlere devam, onların güçlüklerine katlanmak, öfkeyi yenerek affetmek, sadaka vermek, kötülük yapana iyilikte bulunmak, nefsin arzularına sabırla karşı gelmek gibi şeyler bunda dahildir. murad ise: «Zina, içki, gıybet gibi haram olan şeyleri yapmaktır. Yiyip içmek gibi mubah olan şehvetler bunda dahil değildir. Maamafih onlarda da ifrat dereceye varmak mekruhdur",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7132,
			"arabicnumber": "2824.01",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7133,
			"arabicnumber": "2824.02",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7134,
			"arabicnumber": "2824.03",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7135,
			"arabicnumber": "2825",
			"text": "Bize Harun b. Ma'ruf ile Harun b. Saîd El-Eyli rivâyet ettiler. (Dediler ki): Bize İbn Vehb rivâyet etti. ki): Bana Ebû Sahr rivâyet etti. Ona da Ebû Hazini rivâyet etmiş. ki): Ben Sehl b. Sa'd Essâidî'yi şöyle derken işittim: Resûlüllah (sallallahü aleyhi ve sellem)’in bir meclisinde bulundum İti, orada cenneti sonuna kadar vasfeyledi. Sonra hadîsinin nihayetinde Resûlüllah (sallallahü aleyhi ve sellem) hiç bir gözün görmediği, kulağın işitmediği ve insan kalbinden geçmeyen şeyler vardır.» buyurdu. Sonra şu âyeti okudu: yanları yataklardan uzak kalır. (Azabından) Korkarak, (sevabına) tama’ ederek Rablerine dua ederler. Kendilerine verdiğimiz rıziklardan da başkalarına infâk ederler. Hİç bir nefis onların yaptıklarına karşılık olarak kendilerine saklanan ferahfeza şeyleri bilemez.\" Sûre-i Secde, âyet: 16-17. hadîsi Buhârî «Kitâbu'BedMl-Halk» ile «Kitâbu't-Tefsir»'de; Tirmizî de «Kitâbu't-Tefsir»'de tahric etmişlerdir. Bırak, demektir. Bazıları, «başka» mânâsına geldiğini, bir takımları da, «nasıl» demek olduğunu söylemişlerdir. diyor ki: «Allah'ın cennetliklere hazırladığı nimetlerin hepsini değil, bir tanesini bile bilen yoktur. Bunu ne bir mukarreb melek bilir, ne de nebiyyi mürsel! Teâlâ Hazretleri bunları bütün mahlûklarından gizlemiştir. Yalnız kendisi bilir. Bu hazırlıkların ötesinde istenecek bir şey yoktur",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7136,
			"arabicnumber": "2826.01",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7137,
			"arabicnumber": "2826.02",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7139,
			"arabicnumber": "2828",
			"text": "Ebû Hazim dedi ki: Ben bu hadîsi Nu'man b. Ebî Ayyaş Ez-Zürakîye anlattım da, şöyle dedi: Bana Ebû Saîdî Hudrî, Peygamber (sallallahü aleyhi ve sellem)’den rivâyet etti: cennette bir ağaç vardır. İdınana çekilmiş sür'atli bir at'a binen yüz sene yürür, onun gölgesini bitiremez.» buyurmuşlar. rivâyetleri Buhârî «Kitâbu't-Tefsir» ile «Kitâbu'r-Rİkak»'-da tahric etmiştir. gölgesinden murad; dallarının kapladığı yerlerdir. Bu ağacın Tuba ağacı olduğu söylenir. idınana çekilmesi evvelâ semizleyinceye kadar besleyip sonra muhtelif vasıtalarla yağını eritinceye kadar zayıflatmaktır. Bu suretle hayvanın et ve sinirleri kuvvetlenir. Koşmaya hazırlanmış olur. Cevad: İyi cins koşu atı, demektir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7140,
			"arabicnumber": "2829",
			"text": "(Bize Muhammed b. Abdirrahman b. Selim rivâyet etti. ki): Bize Abdullah b. Mübarek rivâyet etti. ki): Bize Mâlîk b. Enes haber verdi. . Harun b. Saîd El-Eylî de rivâyet etti. Lâfız onundur. ki): Bize Abdullah b. Vehb rivâyet etti. ki): Bana Mâlîk b. Enes, Zeyd b. Eslem'den, o da Ata' b. Yesar'dan, o da Ebû Saîdî Hudrî'den naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuşlar: ki, Allah cennetliklere: Ey cennetlikler! diyecek. Onlar 6a: Sana iki defa icabet ederiz ey Rabbimiz! Seni iki defa tes'îd eyleriz. Hayır senin yed-i kudretindedir, cevabını verecekler. Bunun üzerine: Razı oldunuz mu? diye soracak. Onlar: Neden razı olmayacakmişız yâ Rab! Bize mahlûkatından hiç birine vermediğini verdin, diyecekler. Teâla Hazretleri: Size bundan daha kıymetlisini vereyim mi? diyecek. Onlar: Yâ Rabbi! Bundan daha kıymetli ne olabilir, mukabelesinde bulunacaklar. O da: Size rıdvanımı helâl kılıyorum, ondan sonra sîze ebediyyon gazab etmem, buyuracaktır.» bu hadîsi dahi «Kitâbu'r-Rikâk»'da ve «Kitâbu't-Tevhid»'de; Tirmizî «Kitabu’l Sıfatı'l-Cennet»'de; Nesâî -Kitabu'n-Nuût»'da tahric etmişlerdir. rıdvanımı helâk kılıyorum...» cümlesinden murad; size rızâmı indiriyorum, demektir. Çünkü Allah'ın rızası her saadet ve mutluluğun sebebidir. Bu hadîs dahi cennetliklere verilen nimetlerin daha ötesi dü-şünülemiyecek kadar çok ve muhtelif olduğuna delildir. defa icabet ederiz...» sözünden murad; ne olduğunu evvelce görmüştük. Kısacası bu söz bizirn: «Efendim, hazırım, buyurun...» tâbirlerimizin yerinde kullanılır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7142,
			"arabicnumber": "2831.01",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7143,
			"arabicnumber": "2831.02",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7145,
			"arabicnumber": "2832",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7146,
			"arabicnumber": "2833",
			"text": "(Bize Ebû Osman Saîd b. AbdÜ-Cebbar El-Basri rivâyet etti. ki): Bize Hammad b. Seleme, Sâbîl El-Bünânî'den, o da Enes b. Mâlik'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuşlar: cennette bir çarşı vardır ki, ona her hafta gelirler. Derken şimal rüzgârı eserek yüzlerine ve elbiselerine vurur. Bu suretle güzellik ve cemalleri artar da, ailelerinin yanına güzellik ve cemalleri artmış olarak dönerler. Aileleri kendilerine: Vallahi bizden ayrılalı güzellik ve cemâliniz artmış, derler. Onlar da: Vallahi sizin dahi bizim arkamızdan güzellik ve cemâliniz artmiş, derler.» hadîsdeki çarşıdan inurad; cennetliklerin toplandığı yerdir. Oraya hafta mikdarı zaman geçtikçe toplanırlar. Cennette güneş, gece ve gündüz olmadığı için orada hakikatte hafta yoktur. Resûlüllah (sallallahü aleyhi ve sellem)'in şimal rüzgârını hassaten zikretmesi Arablarca yağmur getiren rüzgâr olduğu içindir. Arablar bu rüzgârı beklerlerdi. Bir hadîsde bu rüzgâra şimal rüzgârı yerine müsîre denilmiştir. Müşire, hareket getiren mânâsına gelir. Cennetliklerin yüzlerine cennetin mis kokusunu ve sair nimetlerini serptiği için ona bu isim verilmiştir. nâm eserde şöyle deniliyor: «Buraya cennetlikler toplanır, etraflarım melekler sararlar, onlara göz görmemiş, kulak işitmemiş ve insan hatırına gelmemiş nimetler getirirler. Onlar bu nimetlerden istediklerini parasız alırlar, bu da orada duyulan lezzetlerden bir nev'idir.»",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7147,
			"arabicnumber": "2834.01",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7148,
			"arabicnumber": "2834.02",
			"text": "(Bize Kuteybe b. Saîd de rivâyet etti. ki): Bize Abdû’l-Vâhid (yani; İbn Ziyad) Umara b. Ka'kâ'dan rivâyet etti. ki): Bize Ebû Zür'a rivâyet etti. ki): Ben Ebû Hüreyre'yi şöyle derken işittim: Resûlüllah (sallallahü aleyhi ve sellem): «Cennete ilk girecekler...» buyurdu. H",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7149,
			"arabicnumber": "2834.03",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7150,
			"arabicnumber": "2834.04",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7151,
			"arabicnumber": "2834.05",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7152,
			"arabicnumber": "2835.01",
			"text": "Bize Osman b. Ebi Şeybe ile İshak b. İbrahim rivâyet ettiler. Lâfız Osman'ındır. (Osman: Haddesena; İshak ise: Ahberana tâbirlerini kullandılar. Dediler ki): Bize Cerir, A'mes'den, o da Ebû Süfyan'dan, o da Câbir'den naklen haber verdi. (Şöyle dedi): Ben Peygamber (sallallahü aleyhi ve sellem)'i: ki, cennetlikler orada yiyip-içerler, fakat tükürmezler; büyük-küçük abdest bozmazlar ve burun atmazlar.» buyururken işittim. Ashab: O halde yenilen şey ne olacak? diye sordular. ve misk sızıntısı gibi ter! Kendilerine nefes ilham olunur gibi tesbih ve tahmid ilham olunur.» buyurdu",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7153,
			"arabicnumber": "2835.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Kûreyb de rivâyet ettiler. (Dediler ki): Bize Ebû Muâviye, A'meş'den bu isnadla: «Misk sızıntısı gibi...» cümlesine kadar rivâyet etti",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7154,
			"arabicnumber": "2835.03",
			"text": "(Bana Hasan b. Ali El-Hulvânî ile Haccâc b. Şâir de ikisi birden Ebû Âsım'dan rivâyet ettiler. Hasan dedi ki: Bize Ebû Âsim, İbnû Cüreyc'den rivâyet etti. ki): Bana Ebû'z-Zübeyr haber verdi. Kendisi Câbir b. Abdillah'ı şunu söylerken işitmiş. Resûlüllah (sallallahü aleyhi ve sellem) ı orada yeyip-içerler ama büyük abdest bozmazlar; burun atmazlar, küçük abdest de bozmazlar. Lâkin o yedikleri misk sızıntısı gibi Üîr geğirti olur. Kendilerine nefes almak İlham edildiği gibi, tesbih ve hamd ilham olunur.» buyurdular. der ki: Haccac'ın hadîsinde «zâke» yerine «zâlike» denilmiştir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7155,
			"arabicnumber": "2835.04",
			"text": "(Bana Saîd b. Yahya El-Ümevî de rivâyet etti. ki): Bana babam rivâyet etti. ki): Bize İbn Güreye rivâyet etti. ki): Bana Ebû'z-Zübeyr, Câbir'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini haber verdi. Şu kadar var ki, o: nefes almak ilham edildiği gibi, tesbih ve tekbirde ilham edilir.» demiştir. Hüreyre rivâyetini Buhârî «Kitâbu'l-Enbiya»'da tahric etmiştir. Sünnet vel-cemaatın mezhebine göre, cennetlikler cennetin hatır ve hayâle gelmeyen nimetlerinden yiyip içerler. Muhtelif nimetlerden tıev'ilerine göre daimî surette lezzet alırlar. Onların bu hâli dünya nimetleri şeklinde tecelli ederse de, nimetler arasındaki lezzet ve nefaset farkı pek büyük olduğundan, dünya nimetleri onlara sadece ismen uymuş olurlar. Cennetlikler abdest bozmamak, burun atmamak gibi husûsatta da dünyadaki hallerinden ayrılırlar. Gerek bu hadîsler, gerekse Kur'ân-ı Kerîm'in âyetleri cennet nimetlerinin ebedî olup, bitip tükenmeyeceğine delildirler. rivâyetlerdeki ikişer zevceden murad; dünya kadınlarıdır. Hadîs-deki: «Sabah, akşam tesbîhde bulunmak...» tâbirinden murad; o mikdar demektir. Zira az yukarda işaret ettiğimiz gibi, cennette güneş doğması, güneş batması gibi şeyler yoktur. «yülhemûne» cümlesi «tülhemûne» şeklinde de rivâyet olunmuştur. Bu takdirde mânâ şöyle olur. Onlara tesbih ve tahmid, size nefes almak ilham edildiği gibi ilham olunur. â': Geğirmek demektir. Geğirmek, insan doyduğu vakit solukla beraber içinden çıkan sesdir. Yalnız Cennetteki geğirmek dünyadaki' gibi nahoş olmayacaktır. Burada şöyle bir sual hatıra gelebilir. Cennet teklif yeri olmadığı halde, neden cennetliklere tesbih ve tahmidde bulunmaları ilham olunacaktır? Buradaki teşbih, nimet ve lezzet teşbihidir. Cennetlikler bunu mükellef oldukları için değil, Allahü teâlâ'yı görmekle duyacakları lezzet ve mehabbetden dolayı yapacaklardır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7156,
			"arabicnumber": "2836",
			"text": "(Bana Züheyr b. Harb rivâyet etti, ki): Bize Abdurrahman b. Mehdi rivâyet etti, ki): Bize Hammâd b. Seleme, Sâbit'den, o da Ebû Râfi'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti. Şöyle buyurmuşlar: giren nimet görür, fakirlik görmez; elbisesi eskimez, gençliği de tükenmez.»",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7157,
			"arabicnumber": "2837",
			"text": "Bize İshâk b. İbrahim ile Ahd b. Humeyd rivâyet ettiler. Lâfız İshak'ındır. (Dediler ki) ; Bize Abdürrezzâk haber verdi. ki): Sevrî şunu söyledi: Bana da Ebû İshâk rivâyet etti ki, kendisine Egar, Ebû Saîd-i Hudrî ile Ebû Hüreyre'den, onlar da Peygamber (sallallahü aleyhi ve sellem)'den naklen rivâyet etmişler. Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuşlar: dellal: Gerçekten sizin için sağlamlık vardır. Artık ebediyen hasta olmayacaksınız. Sizin için hayat vardır. Artık ebediyen Ölmeyeceksiniz. Sizin için gençlik vardır. Artık ebediyen ihtiyarlamıyacaksınız. Sizin için ni-metpezîr olmak vardır. Artık ebediyen fakirlemeyeceksiniz diye nida edecektir.» (azze ve celle)'nin: İşte size cennet! Siz ona amellerinizle mirasçı oldunuz.\" Sûre-i Araf, âyet: 43. âyet-i kerîmesinin mânâsı budur. be's, be'sa; fakirlik şiddeti hâl mânâsına gelen kelimelerdir. hadîsler dahi cennete girecek bahtiyarların hallerini anlatmaktadır. Cennete girenler daimî nimetler içinde safa sürecek, hastalık görmeyecek, ihtiyarlamayacak, gençliklerinin baharında ebedî bir hayat süreceklerdir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7158,
			"arabicnumber": "2838.01",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7159,
			"arabicnumber": "2838.02",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7160,
			"arabicnumber": "2838.03",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7161,
			"arabicnumber": "2839",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Ebû Üsâme İle Abdullah b. Nûmeyr ve Alî b. Müshir, Ubeydullah b. Ömer'den rivâyet ettiler. H. Muhammed b. Abdillah b. Nûmeyr de rivâyet etti, ki): Bize Muhammed b. Bİşr rivâyet etti. ki): Bize Ubeydullah, Hubeyb b. Abdirrahman'dan, o da Hafs b. Asım'dan, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): Ceyhan, Fırat ve Nil'den her biri cennet nehirlerindendir.» buyurdular. ile Ceyhan orta Anadolu'dan çıkarak Akdeniz'e dökülen iki nehirdir. Bazıları bunları Seyhun ve Ceyhun nehriyle karıştırarak bir saymıştır. Ceyhun nehri Horasan'dadır. Seyhun orta Asya'nın büyük nehirlerinden biridir. Fırat dahi Orta Anadolu'dan kaynayan bir nehirdir. Basra körfezine dökülür. Nil , Mısır'dadır. Bu nehirlerin cennetten çıkması iki suretle te'vil edilmiştir. Birinci te'vile göre iman, nehirlerin bulunduğu yerleri yahut bunların sularıyle beslenen cisimleri kaplamış olduğundan, bu sularla beslenen insanlar cennete girecektir, manasınadır. İkinci mânâya göre te'vile hacet yoktur, bu sular doğrudan doğruya cennetten çıkarlar. Ehl-i Sünnet'e göre Cennet hâlen mevcuttur. Isra bahsinde Fırat'la Nil'in cennetten çıktıklarını bildiren hadîsi görmüştük. Buhârî'nin rivâyetine göre bunlar Sidretü'l-Müntehâ denilen ağacın dibinden kaynarlar",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7162,
			"arabicnumber": "2840",
			"text": "(Bize Haccac b. Şâir rivâyet etti. ki): Bize Ebû'n-Nadr Hâşim b. Kaâsım El-Leysî rivâyet etti. ki): Bize İbrahim (yani; İbn Sa'd) rivâyet etti. ki): Bize babam, Ebû Seleme'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen rivâyet etti. (Şöyle buyurmuşlar): kalbleri kuş kalbi gîbi olan bir takım kavimler girecektir.» Buradaki insan kalblerinin ne cihetle kuş kalbine benzetildiğinde ihtilâf edilmiştir. Bazılarına göre incelik, zayıflık ve zarafet hususunda kuş kalbine benzetilmişlerdir. Nitekim bir hadîsde Yemenlilerin ince kalbli yani; nâzik insanlar olduğundan bahsedilmiştir. Bazıları bu teşbihin korku ve ürkeklik itibariyle yapıldığını söylemişlerdir. Zira kuş, hayvanların en ürkeğidir. Bu takdirde hadîsten murad; kalblerini Allah korkusu kaplayan ve kuş gibi ürkek olan bir takım mü'minlerin cennete girmesidir. Hadîs-i şerif den Allah'a tevekkül edenler kastedildiğini söyleyenler de. vardır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7163,
			"arabicnumber": "2841",
			"text": "(Bize Muhammed b. Râfi' rivâyet etti. ki): Bize Abdürrazzak rivâyet etti. ki): Bize Ma'mer, Hemmam b. Münebbih'den naklen haber verdi. Hemmam: Bize Ebû Hüreyre'nin, Resûlüllah (sallallahü aleyhi ve sellem)’den rivâyet ettikleri şunlardır... diyerek bir takım hadîsler nakletmiştir. Onlardan biri de şudur: Resûlüllah (sallallahü aleyhi ve sellem): (azze ve celle) Âdem'i kendi suretinde yarattı. Onun uzunluğu altmış arşındır. Âdem'i yaratınca (ona): Git de şu cemaata selâm ver, buyurdu. Bunlar meleklerden bir cemaat olup, oturuyorlardı. Sana ne cevap vereceklerini dinle, çünkü bu senin ve zürriyetin için selâm olacaktır, dedi. Âdem de giderek: Selâm size, dedi. Melekler: Selâm sana, Allah'ın rahmeti de sana, dediler. Ve ona Allah'ın rahmeti sözünü ziyade ettiler, imdi cennete her giren kimse Âdem'in suretinde ve uzunluğu altmış arşın olacaktır. Ama Âdem'den sonra halk tâ şimdiye kadar eksilmekte devam etmiştir.» buyurdular. hadîsi Buhârî «Kitâbu'l-Enbiya» ile «Kitâbu’l-İstîzan»da tahric etmiştir. şerhini evvelce görmüştük. Bu rivâyet hadîsdeki zamirin Hazret-i Âdem'e ait olduğu hususunda zahirdir. Hadîsden murad: Allahü teâlâ, Âdem (aleyhisselâm)'ı yaşayıp vefat ettiği sureti üzerine yaratmıştır. O zürriyeti gibi şekil değiştirmemiştir. Yeryüzündeki sureti ne ise cennetteki sureti de odur, demektir. arşından murad; bizim arşımmızdır. Hazret-i Âdem'in uzunluğu altmış arşın olduğu gibi, genişliğinin de yedi arşın olduğu rivâyet olunmuştur. diyor ki: «Allahü teâlâ cennetlikleri asılları olan Âdem (aleyhisselâm)’in hilkatine iade edecek, cennette onun sıfatında ve onun uzunluğunda olacaklardır.» Yani; cennete giren bahtiyarlar boy pos güzelliği itibariyle Hazret-i Âdem kılığında olacaklar dünyadaki sakatlık ve kusurlarından eser kalmayacaktır. şerîf oturan bir kimsenin yanına varanın «Esselâmü-aleyküm» diye selâm vermesinin efdal olduğuna delildir. Maamafih «Se-lamünaleyküm» demek de kâfidir. Selâmı alırken, verenin sözüne ziyâde etmek müstehabdır. hadîs selâm alırken de Esselâmu aleyküm demenin caiz olduğuna işaret etmektedir. Ve aleykümüsselam demek efdal ise de şart değildir. ki: Âdem (aleyhisselâm)’ın zürriyeti asırlar boyunca kısala kısala bugünkü hâle gelmişlerdir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7164,
			"arabicnumber": "2842",
			"text": "(Bize Ömer b. Hafs b. Giyâs rivâyet etti. ki): Bize babam, Ala' b. Hâlid El-Kâhilî'den, o da Şakîk'dan, o da Abdullah'dan naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): getirilecek. O gün onun yetmiş bin yedeği olacak. Her yedekle beraber onu çeken yetmiş bin melek bulunacaktır.» buyurdular. hadîs hakkında Darekutnî, İmâm Müslim'e itiraz etmiş: «Bunu merfu' rivâyet etmek vehmdir. Sevrî ile Mervân ve başkaları onu Ala' b. Hâlid'e mevkuf olarak rivâyet etmişlerdir.» demişse de, Nevevî buna cevab vermiş: «Hafs mu'temed bir hafız ve İmâmdır. Onun merfu' olarak yaptığı ziyade makbuldür. Nitekim ekseri ulemâ ile muhakkikin onu bu şekilde rivâyet etmişlerdir.» demiştir. yetmiş bin yedeği olmasını İmâm Mâzirî zahiri üzere kabul etmiş: «Bu sözü hakikata hamletmeye hiçbir mâni yoktur.» demiştir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7165,
			"arabicnumber": "2843.01",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Muğîra (yani; İbn Abdirrahman El-Hızâmî) Ebû'z-Zinad'dan, o da A'rac'dan, o da Ebû Hüreyre'den naklen rivâyet etti ki: Peygamber (sallallahü aleyhi ve sellem): yaktığı şu ateşiniz, cehennem sıcağının yetmiş cüzünden bir cüzdür.» buyurmuş. Ashab: Vallahi gerçekten bu yetecekmiş ya Resûlallah! demişler. (sallallahü aleyhi ve sellem): cehennem ateşi her bîri dünya ateşi kadar olmak üzere ondan altmış dokuz cüz daha fazla yaratılmıştır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7166,
			"arabicnumber": "2843.02",
			"text": "(Bize Muhammed b. Râfi' rivâyet etti. ki): Bize Abdürrezzâk rivâyet etti. ki): Bize Ma'mer, Hemmâm b. Münebbih'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen Ebû'z-Zinad'ın hadîsi gibi rivâyet etti. Yalnız o «küllühû» yerine «küllühüne» demiştir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7167,
			"arabicnumber": "2844.01",
			"text": "(Bize Yahya b. Eyyûb rivâyet etti. ki): Bize Halef b. Halife rivâyet etti. ki): Bize Yezid b. Keysan, Ebû Hâzim'den, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem)’le birlikte idik. Ansızın düşen bir şey sesi işitti. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) nedir bilir misiniz?» dedi. Biz; Allah ve Resûlü bilir, cevâbını verdik. bir taştır. Yetmiş sene önce cehenneme atılmış, henüz şimdi düşüyor. Nihayet dibine erdi.» buyurdular",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7168,
			"arabicnumber": "2844.02",
			"text": "Bize bu hadîsi Muhammed b. Abbâd ile İbn Ebî Ömer de rivâyet ettiler. (Dediler ki): Bize Mervan, Yezîd b. Keysan'dan, o da Ebû Hâzim'den, o da Ebû Hüreyre'den naklen bu isnadla rivâyet etti: «Bu cehennemin dibine düştü de, siz onun sesini işittiniz.» dedi",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7169,
			"arabicnumber": "2845.01",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7170,
			"arabicnumber": "2845.02",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7171,
			"arabicnumber": "2845.03",
			"text": "Bize bu hadîsi Muhammed b. Müsennâ ile Muhammed b. Beşşar rivâyet ettiler. (Dediler ki): Bize Kavli rivâyet etti. ki): Bize Saîd bu isnadla rivâyet etti. Ama «huczctihî» yerine «hakveyhî» kelimesini koydu. hadîsin Ebû Hüreyre rivâyetini Buhârî «Bed'ü’l-Halk» bahsinde tahric etmiştir. mânâda İbn Mace, Hazret-i Enes'den, İbn Uyeyne , Hazret-i İbn Abbâs'dan hadîsler rivâyet etmişlerdir. Abbâs Hazretlerine dünya ateşinin neden yaratıldığı sorulmuş; cehennem ateşinden yaratıldığını, yalnız yetmiş defa su ile söndürüldüğünü söylemiş. «Böyle olmasaydı ona yaklaşılmazdı. Çünkü o cehennem ateşindendir.» demiştir. cehennem ateşinin her bir cüz'ünün bütün dünyanın odunu yakılsa, onun ateşinden daha şiddetli olacağını beyan etmişlerdir. b. Mihran ki: «Allah cehennemi halket-tiği vakit bir soluk almasını emir buyurdu. O da aldı. Bundan göklerde yüzüstü kapanmadık hiç bir melek kalmadı. Teâlâ onlara: kaldırın. Bilmez misiniz ki; Ben sizi taat için yarattım, bunu da günahkârlar için yarattım, buyurdu. Melekler: Ey Rabbimiz, buna girecekleri görmedikçe biz ondan emin olamayız, dediler.\" İşte Teâlâ Hazretlerinin (Onlar Rablerinden korkularına çekinirler...) âyet-i kerîmesinin mânâsı budur.\"» ve hakv aynı mânâya gelirler ve ikisi de gömleğin boğaza iliklendiği yer, demektir. Gazâlî şöyle diyor: «Dünya ateşi cehennem ateşine uymaz. Lâkin dünyada en şiddetli azab bu ateşin azabı olduğu için cehennem ateşi onunla tarif olunmuştur. Heyhat! Cehennemlikler bu ateşi bulsalar, içinde bulundukları ateşten kaçarak kendilerini ona atarlardı.»",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7172,
			"arabicnumber": "2846.01",
			"text": "(Bize İbn Ebî Ömer rivâyet etti. ki): Bize Süfyân, Ebû'z-Zinad'dan, o da A'rac'dan, o da Ebû Hüreyre'den naklen rivâyet etti. ki): Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular; cehennem münâkaşa ettiler de, biri: Bana zâlimlerle kibirliler girecek, dedi. Öteki de: Bana zayıflarla yoksullar girecek, dedi. Bunun özerine Allah (azze ve celle) berikine: Sen benim azabınısın. Seninle dilediğimi azab ederim ve galiba dilediğime isabet ederim) buyurdu. Ötekine de: Sen benim rahmetimsin, seninle dilediğime rahmet ederim. Sizîn har biriniz için dolusu doluya (kullar) var, buyurdu.»",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7173,
			"arabicnumber": "2846.02",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7174,
			"arabicnumber": "2846.03",
			"text": "(Bize Abdullah b. Avn El-Hilâlî rivâyet etti. ki): Bize Ebû Süfyan (yani; Muhammed b. Humeyd) Ma'mer'den, o da Eyyûb'dan, o da İbn Sîrîn'den, o da Ebû Hüreyreden naklen rivâyet etti ki: Peygamber (sallallahü aleyhi ve sellem): cehennem münakaşa etti...» buyurmuşlar. hadîsi Ebû'z-Zinad’ın hadîsi mânâsında hikâye etmiştir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7175,
			"arabicnumber": "2846.04",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7176,
			"arabicnumber": "2847",
			"text": "(Bize Osman b. Ebi Şeybe de rivâyet etti. ki): Bize Cerir, A'meş'den, o da Ebû Sâlih'den, o da Ebû Saîd-i Hudrî'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): cehennem münâkaşa ettüer...» buyurdu. «Her ikinize de dolusu doluya vereceğim...» cümlesine kadar hû Hüreyre hadîsi gibi nakletmiş, ondan sonraki ziyâdeyi anmamıştır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7177,
			"arabicnumber": "2848.01",
			"text": "(Bize Abd b. Humeyd rivâyet etti. ki): Bize Yûnus b. Muhammed rivâyet etti. ki): Bize Şeyban, Katâde'den rivâyet etti. ki): Bize Enes b. Mâlik rivâyet etti ki: Nebiyyullah (sallallahü aleyhi ve sellem) şöyle buyurmuşlar: Daha var mı? demekte devam edecek. Nİhâyet Rabbu'l-Izze Tebâreke ve Teâlâ ayağını onun üzerine koyacak. O da: izzetin hakkı için yeter, yeter! diyecek ve cüzleri birbirine kavuşacaktır.»",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7178,
			"arabicnumber": "2848.02",
			"text": "(Bana Züheyr b. Harb da rivâyet etti. ki): Bize Abdûssa-med b. Abdil-Vâris rivâyet etti. ki): Bize Ebân b. Yezid El-Attâr rivâyet etti. ki): Bize Katâde, Enes'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen Seyhan'ın hadîsi mânâsında rivâyet etti",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7179,
			"arabicnumber": "2848.03",
			"text": "(Bize Muhammed b. Abdilluh Er-Ruzzî rivâyet etti. ki): Bize Abdü'l-Vehbab b. Atâ', Allah (azze ve celle)'nin: gün cehenneme: Doldun mu? diyeceğiz. O da daha var mı? diyecektir.\" Sûre-i Kâf, âyet: 30. âyet-i kerîmesi hakkında rivâyet etti de, dedi ki: Bize Saîd'den, o da Katâde’den, o da Enes b. Mâlik'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen haber verdi ki, şöyle buyurmuşlar: atılmak da, o da daha var mı? diye sormakla devam edecek. Nihayet Rabbu'l-İzze onun üzerine ayağını koyacak ve cüzleri birbirine kavuşacak. Cehennem, İzzetin ve keremin hakkı için yeter yeter diyecek. Cennette de fazlalık devam edecek. Hatta Allah onun için yeni halk yaratacak ve onları cennetin fazlasına iskân edecektir.»",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7180,
			"arabicnumber": "2848.04",
			"text": "(Bize Züheyr b. Harb rivâyet etti. ki): Bize Affân rivâyet etti. ki): Bize Hammad (yani; İbn Seleme) rivâyet etti. ki): Bize Sâid haber verdi. ki): Enes'i, Peygamber (sallallahü aleyhi ve sellem)'den naklen şöyle derken işittim: Allah'ın dilediği kadarı kalacak, sonra Allahü teâlâ dilediklerinden onun İçin yeni halk yaratacaktır.» buyurdu. rivâyetleri Buhârî «Kitâbu't-Tefsir» ile «Kitâbu'l-Eyman ve Nüzûr»'da; Enes rivâyetini Tirmizî «Kitâbu't-Teisir»'de; Nesâî «Kitâbu'n-Nuût»'da muhtelif râvîlerden tahric etmişlerdir. Cehennemin münâkaşa ve muhasemesi hakkında Nevevî şunları söylemiştir: «Bu hadîs zahir mânâsı üzeredir. Allahü teâlâ cennetle cehenneme temyiz halketmiş, bu sayede idrak sahibi olmuşlar ve birbirleriyle muhasamede bulunmuşlardır. Ama bundan onların daimî surette akü ve temyiz sahibi olmaları lâzım gelmez.» Maamafih bu münakaşanın lisânı hal ile yapılmış olması da muhtemeldir. hadîsin otuz altı nolu rivâyetindeki «gırratuhum» tâbiri «garesü-hum» ve «acezejtühüm» şekillerinde de rivâyet olunmuştur. ; Açlık, demektir, Accde de: Âcizin cemidir. Fakat en meşhur rivâyeti «gırra»fdır. Bundan murad; gafil takımı yani; sünneti iyi anlamayan avâmdır. Bunlar saf oldukları için aralarına fitne ve bid'at girmez. İmanları sabit, inançları sağlamdır. Mü'minlerin ekserisi bunlardandır. Cennetliklerin ekserisi de bunlardan olacaktır. Arif ve Salih ulemânın adedi azdır Onların dereceleri yüksek olacaktır. yahut katı bana yeter mânâsına ism-i fiildir. hadîsler sıfat hadîslerinin meşhurlarındandır. Evvelce de îzah ettiğimiz vecihle ulemâ bu hususta mûfevvi'da ve müevvile olmak üzere iki mezhebe ayrılmışlardır. Müfevvida tefvîzciler yani; bu gibi hadîslerin mânâlarını Allah'a havale eyleyenlerdir. Selefin cumhûru bu mezhebde idi. Onlar kelimenin hak olduğuna iman eder, mânâsını Allah'a bırakırlardı. Çünkü kelimenin zahirî mânâsı Allahü teâlâ hakkında müstehıl yani; imkânsızdır. Müevvile te'vilcilerdir. Cumhûru Mütekelliminin mezhebi budur. Bunlar Allahü teâlâ hakkında vârid olan el ve ayak gibi aza isimleri hakkında ihtilâf etmişlerdir. Bazıları bu hadîslerde geçen ayak tâbirinden mütekaddim mânâsı kastedildiğini söylemişlerdir. Arabcada bu mânâ geçerlidir. Hadîsden murad; Allah cehennemin üzerine cehennemliklerden bazılarını koyar, demektir. Bir takımları buradaki ayaktan bazı kulalrın ayağı kastedildiğini ileri sürmüşlerdir. Buna göre mânâ: Allah cehennemin üzerine bazı kullarının ayağım koyar, demek olur. Kademin bir mahlûk ismi olduğunu söyleyenler olduğu gibi, yer ismi olduğunu söyleyenler de vardır. Hatta bazıları kadem kelimesini kudumdan alarak ona takdim mânâsını vermişlerdir. Bu takdirde hadîsin mânâsı: Allah cehennemin üzerine kulun azab için takdim ettiği şeyleri koyar, demek olur. koymaktan murad; yeter artık mânâsına geldiğini söyleyenler de olmuştur. Iyâz diyor ki: «Bu te'villerin en güzeli kadem kelimesinden cehennemi haketmiş bir kavm murad edilmiş olmasıdır. Kelimeyi zahirî mânâsına almamak mutlaka lâzımdır. Çünkü Allahü teâlâ hakkında aza imkânsızdır, bu husasta kati delil vardır. teâlâ’nın cennet için yeniden kullar yaratması Ehl-i Sünnet'in delillerindendir. Onlara göre sevab vermek, amele bağlı değildir. O, Allah'ın biri lûtfu ihsanıdır. Bu hadîsde de cennette yaratılan kullara hiç bir amelleri olmadığı halde sevab verileceği bildirilmektedir. Nitekim küçükken ölenlerle delilerin hâli de böyledir. Bunların hiç bir ameli olmadığı halde, cennete girecek Allahü teâlâ’nın fadlu rahmetine nail olacaklardır. Bu hadîsler cennetin pek büyük olduğuna da delildirler. Filhakika sahîh bir hadîsde cennette bir kişiye dünya kadar yer verileceği, dünyanın on misli kadar da ziyâdesi ihsan edileceği ve yine de yeni yaratılacaklar için boş yer kalacağı bildirilmiştir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7181,
			"arabicnumber": "2849.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb rivâyet ettiler. Lâfızları birbirine yakındır. (Dediler ki): Bize Ebû Muâviye, A'meş’den, o da Ebû Sâlih'den, o da Ebû Saîd'den naklen rivâyet etti. ki): Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular: gününde ölüm sanki bakla bir koçmuş gibi getirilecek. (Ebû Kûreyb şunu ziyade etti): Ve cennetle cehennemin arasında durdurulacak (Hadîsin kalan kısmı hususunda ittifak ettiler.) Ve Ey cennetlikler, bunu bi liyor musunuz? denilecek. Onlar başlarını kaldırarak bakacaklar: Evet, bı ölümdür! diyecekler ve: Ey cehennemlikler bunu biliyor musunuz? denilecek. Onlar da baş larıni kaldırarak bakacaklar ve: Evet, bu ölümdür! diyecekler. Müteakiben emir verilerek koç kes lecek. Sonra: Ey cennetlikler, size ebediyet... Artık ölüm yok ve: — Ey ceher nemlikler, size de ebediyet!.. Artık ölüm yok, denilecektir.» hesabın görüleceği hasret günüyle korkut! Halbuki onlar galette idiler. İman etmezlerdi.\" Sûre-i Meryem, âyet: 39. âyetini okudu ve eliyle dünyaya işaret etti",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7182,
			"arabicnumber": "2849.02",
			"text": "(Bize Osman b. Ebî Şeybe rivâyet etti. ki): Bize Cerir, A'meş'den, o da Ebû Sâlih'den, o da Ebû Saîd'den naklen rivâyet etti. ki): Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular: cennete, cehennemlikler de cehenneme konulduğu vakit: Ey cennetlikler! denilecek...» râvî Ebû Muâviye hadîsi mânâsında rivâyette bulunmuştur. Yalnız o: «İşte Allah (azze ve celle)'nin kavli budur.» demiş. «Sonra Resûlüllah (sallallahü aleyhi ve sellem) okudu.» dememiştir. «Eliyle de dünyaya İşaret etti.» cümlesini dahi anmamıştır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7183,
			"arabicnumber": "2850.01",
			"text": "Bize Züheyr b. Harb ile Hasen b. Alî El-Hulvâni ve Abd b. Humeyd rivâyet ettiler. (Abd: Ahberanî; ötekiler: Haddesena tâbirlerini kullandılar. Dediler ki): Bize Ya'kub (bu zat İbn İbrahim b. Sa'd'dır.) rivâyet etti. ki): Bize babam Sâlih'den rivâyet etti. ki): Bize Nâfi' rivâyet etti ki: Abdullah Şöyle dedi: Gerçekten Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular:. cennetlikleri cennete, cehennemlikleri de cehenneme koyacak., sonra aralarından bir dellâl kalkarak: Ey cennetlikler (artık) ölüm yok ve ey cehennemlikler (artık) ölüm yok. Herkes bulunduğu yerde ebedîdir, diyecektir.»",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7184,
			"arabicnumber": "2850.02",
			"text": "Bana Harun b. Saîd El-Eylî ile Harmele b. Yahya rivâyet ettiler. (Dediler ki): Bize İbn Vehb rivâyet etti. ki): Bana Ömer b. Muhammed Zeyd b. Abdillah b. Ömer b. Hattab rivâyet etti. Ona da babası, Abdullah b. Ömer'den rivâyet etmiş ki, Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuşlar: cennete, cehennemlikler de cehenneme vardıkları zaman ölüm getirilecek ve cennetle cehennem arasına konulacak, sonra kesilecektir. Sonra bir dellâl: Ey cennetlikler (artık) ölüm yok! Ve ey cehennemlikler (artık) ölüm yok! diye nida edecek. Böylece cennetliklerin sevinci bir kat daha artacak, cehennemliklerin üzüntüsü de bir kat daha artacaktır.» hadîsin Ebû Saîd rivâyetini Buhârî, Tirmizî ve Nesâî «Kitabu't-Tefsir»'de; İbn Ömer rivâyetini Buhârî «Kitâbu'r-Rİkak»'da tahric etmişlerdir. Sünnet'e göre ölüm, hayata zıt olan bir arazdır. Mutezile'den bazıları onun araz olduğunu kabul etmemiş, ölüm hayatın yokluğudur, demişse de bu söz hatadır. Çünkü Teâlâ Hazretleri: «Ölümü ve hayâtı yarattı...» buyurarak, ölümün mahlûk olduğunu isbat etmiştir. Her iki mezhebe göre de, ölüm cisim değildir. Onun koç suretinde getirilip kesilmesi te'vil olunur ve: «Allahü teâlâ onu cisim olarak yaratır sonra kesilir.» denilir. Yahut bu sözden maksad temsildir. Ölümü kimir keseceği ihtilaflıdır. Bâzılarına göre onu Yahya b. Zekeriya (aleyhisselâm) , Peygamber (sallallahü aleyhi ve sellem)’in huzurunda kesecektir. Bir takımları Cebrail (aleyhisselâm)’ın cennet kapısında keseceğini söylemiştir. Bazılarına göre hâlis beyaz demektir. Kisâî: Beyazl; siyah karışık olup, beyazı daha çok mânâsına geldiğini söylemiştir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7185,
			"arabicnumber": "2851",
			"text": "(Bana Süreye b. Yûnus rivâyet etti. ki): Bize Humeyd b. Abdirrahman, Hasen b. Sâlih'den, o da Harun b. Sa'd'dan, o da Ebû Hâzim'den, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): avurt dîşî yahut kâfirin azı dişi Uhud dağı kadar, cildinin kalınlığı da üç gecelik yol mesabesinde olacaktır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7186,
			"arabicnumber": "2852",
			"text": "Bize Ebû Kûreyb ile Ahmed b. Ömer El-Vekîî rivâyet ettiler. (Dediler ki): Bize İbn FudayI babasından, o da Ebû Hâzim'den, o da Ebû Hüreyre'den merfûan rivâyet etti. Resûlüllah (sallallahü aleyhi ve sellem): kâfirin iki omuzunun arası hızlı giden binek kimsenin uç günlük yolu kadardır.» buyurmuşlar. «Cehennemde...» kaydını anmamıştır. hadîsi Buhârî «Kitâbu'r-Rikâk»'da tahric etmiştir. gününde kâfirin dişinin Uhud dağı kadar büyük, cildinin üç günlük yol kadar geniş olması hakkında Nevevî şunları söylemiştir ; «Bütün bunlar ona daha fazla elem verdiği içindir. Bunların hepsi Allahü teâlâ'nın kudreti dahilindedir. Peygamber (sallallahü aleyhi ve sellem) haber verdiği için bunlara inanmak vâcibdir.»",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7187,
			"arabicnumber": "2853.01",
			"text": "(Bize Ubeydullah b. Muâz El-Anberî rivâyet etti. ki): Bize babam rivâyet etti. ki): Bize Şu'be rivâyet etti. ki): Bana Ma'bed b. Hâlid rivâyet etti. O da Harise b. Vehb'den, o da Peygamber (sallallahü aleyhi ve sellem)’den dinlemiş. Şöyle buyurmuşlar: «Size cennetlikleri haber vereyim mi?» Ashab: — Hayhay! demişler. (sallallahü aleyhi ve sellem) Efendimiz: «Her zaif görülen, zayıf kimsedir. Allah'a yemin etse, onu yemininde sadık çıkarır.» demiş. Sonra: cehennemlikleri haber vereyim mi?» buyurmuş. Ashab: Hay hay! demişler. katı düşman cimri, kibirlidir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7188,
			"arabicnumber": "2853.02",
			"text": "(Bize Muhammed b. Müsennâ da rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be bu isnadla bu hadîsin mislini rivâyet etti. Yalnız o: «Size göstereyim mi?» demiştir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7189,
			"arabicnumber": "2853.03",
			"text": "(Bize Muhammed b. Abdillah b. Nûmeyr de rivâyet etti. ki): Bize Veki' rivâyet etti. ki): Bize Süfyan, Ma'bed b. Hâlid'den rivâyet, etti. ki): Ben Harise b. Vehb El-Huzâî'yi şunu söylerken işittim. Resûlüllah (sallallahü aleyhi ve sellem): cennetlikleri haber vereyim mi? Her zayıf görülen, zayıftır. Allah'a yemin etse, onu yemininde sadık çıkarır. Size cehennemlikleri haber vereyim mi? Her cimri, neseb İddiacısı kibirlidir.» buyurdular. hadîsi Buhârî «Kitâbu't-Tefsir», «Kitâbü'l-Edeb ve «Kitabu'n-Nüzûr»'da; Tirmizî «Kitâbu Sıfeti Cehennem»de; Nesâî «Kİtâbu't-Tefsir»'de; İbnû Mâce «Kitabu'z-Zühd»'de muhtelif râvilerden tahric etmişlerdir. İnsanların zayıf görerek tahkir ettikleri kimsedir. Bu kelime müteda'ıf şeklinde de rivâyet olunmuştur. Bu takdirde mânâsı mütevazı', kendini hiçe sayan demek olur. Kâdî Iyâz: «Buradaki za'fdan murad; kalblerin nezaket ve-inceliği ve imana yatkınlığı da olabilir.» diyor. Hadîsden murad: Ekseriyetle cennetliklerin bu gibi insanlardan olacağını beyandır. yemin etse, onu yemininde sâdık çıkarır...» cümlesinden mu-mad; bazılarına göre: Dua etse, duasını kabul buyurur, manasınadır. Katı, bâtıl hususundaki düşmanlığı şiddetli kimse demektir. Cevvaz, elinden ;bir şey çıkmayan pinti mânâsına gelir. Bazıları bu kelimenin çok etli ve yürürken böbürlenen mânâsına geldiğini, bir takımları kısa, şişman demek olduğunu söylemişlerdir. Kendinin yalandan bir kavme mensub olduğunu iddia eden kimsedir. de ekseriyetle bu gibi kimselerden müteşekkil olacaklardır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7190,
			"arabicnumber": "2854",
			"text": "(Bana Süveyd b. Saîd rivâyet etti. ki): Bana Hafs b. Meysera, Alâ' b. Abdirrahman'dan, o da tabasından, o da Ebû Hüreyre'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem): kapılardan kovulan saçı keçeleşmiş kimse vardır ki, Allah'a yemin etse, Allah onu yemininde sâdık çıkarır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7191,
			"arabicnumber": "2855",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Küreyb rivâyet ettiler. (Dediler ki): Bize İbn Nümeyr, Hişam b. Urve'den, o da babasından, o da Abdullah b. Zem'a'dan naklen rivâyet etti, (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem) hutbe okudu da, deveyi ve onu boğazlayanı anarak şöyle buyurdu: kavminin en yaramazı (yerinden) fırladığı zaman: Bu deve için muktedir müfsit, kavminin İçinde Ebû Zem'a gibi kuvvetli bir adam yerinden fırladı.» buyurdu. Sonra kadınları anarak onlar hakkında va'x etti. Sonra: biriniz ne zamana kadar karısını dövmeye devam edecek?» Ebû Bekr'in rivâyetinde: «Cariyeyi dövmeye...» Ebû Küreyb'in rivâyetinde ise: «Köleyi dövmeye (ne zamana kadar devam edecek)... Olur ki, o kadınla son gününde cima' eder.» denilmiştir. Sonra ashabına yellenmeye güldükleri için va'z ederek: biriniz yaptığına gülmeye ne zamana kadar devam edecek?» buyurdular. hadîsi Buhârî ile Tirmizî «Tefsir» bahsinde; Nesâî «Tefsir» ve «Işrâtû'n-Nisâ'» bahislerinde; İbn Mâce «Nikâh» bahsinde muhtelif râvilerden tahric etmişlerdir. murad; Salih (aleyhisselâm)'ın devesidir. Bu deveyi Semûd kavminin en şakisi Kudâr b. Sâlif boğazlamıştır. Bu adam uğursuzlukta Uhaymiri Semûd diye darb-ı mesel olmuştur. Kısa boylu, kırmızı benizli sarışın veled-i zina bir herifmiş. (sallallahü aleyhi ve sellem), Şems sûresinin: «Semûd kavminin en yaramazı (yerinden) fırladığı zaman...» âyetini okumuş, sonra deveyi kesmek için yerinden fırlayan adamın tarifini yapmıştır. Şer, müfsit, pis mânâlarına gelir. Cahil, serseri mânâsına geldiğini söyleyenler de vardır. (sallallahü aleyhi ve sellem) bu adamı Ebû Zem'a'ya benzetmiştir. Ebû Zem'a, Abdullah b. Ebî Zem'a'nın dedesi Esved'dir. Esved, müslümanlarla alay edenlerden biriydi. Mekke'de kâfir olarak ölmüş. Oğlu Zem'a dahi Bedir gazasında kâfir olarak tepelenmiştir. b. Zem'a rivâyeti, zaruret yokken kadın ve hizmetçiyi dövmekten, sesle yellenene gülmekten men etmektedir. Câhiliyet devrinde Arablar bir meclisde sesle yellenen kimseye gülerlermiş. Resûlüllah (sallallahü aleyhi ve sellem) bundan men etmiş, işitmezlikten gelinerek başka şeyle meşgul olunması gerektiğine işaret buyurmuştur. Çünkü meclislerde sesle yellenmek ve sonra buna gülüşmek Lût kavminin âdet-lerindendir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7192,
			"arabicnumber": "2856.01",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Cerir Süheyl'den, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): Ka'b oğullarının babası Amr b. Luhay b. Gamca b. Hindifî cehennemde bağırsaklarını sürüklerken gördüm.» buyurdular",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7193,
			"arabicnumber": "2856.02",
			"text": "Bana Amru'n-Nâkıd ile Hasen El-Hulvânî ve Abd b. Humeyd rivâyet ettiler. (Abd: Ahberanî, ötekiler: Haddesena tâbirlerini kullandılar. Dediler ki): Bize Yakub (bu zat İbn İbrahim b. Sa'd'dır) rivâyet etti. ki): Bize babam Sâlih'den, o da İbn Şihab'dan naklen rivâyet etti. ki): Ben Saîd b. Müseyyeb'i şunu söylerken işittim: Bahira, şeytanlar için sağılmaktan menedilen devedir. Onu insanlardan kimse sağamaz. Sâibe ise, Arabların ilâhları için bıraktıkları devedir. Onun üzerinde hiç bir şey taşınmaz. İbn Müseyyeb ki: Ebû Hüreyre şunu söyledi: Resûlüllah (sallallahü aleyhi ve sellem): Amr b. Âmir El-Huzâî'y'ı cehennemde bağırsaklarını sürürken gördüm, Bu adam ilk sâibe bırakan adamdır.» buyurdular. hadîsi Buhârî «Kitâbu'l-Menâkıb»'de tahric etmiştir. devrinde Arablar deve beşinci yavruyu doğurduktan sonra, o hayvanın kulağını yarar, artık ona binmeyi ve o hayvanın sütünü haram sayarlardı. Putlarına tazim için hayvanın suya ve mer'aya gitmesine mani olunmazdı. Bu deveye bahîra denilirdi. adam seferinden dönersem yahut hastalığımdan iyileşirsem, devem sâibe olsun, diye nezrederdi. Artık bu hayvandan istifâde dahi haram sayılırdı. Buhârî şaibeyi Arabların putları için tahsis ettikleri deve mânâsına almıştır. Arablar sığır ve koyundan da bahîra ve sâibe yaparlardı. Ancak hüküm bu hayvanların yalnız dişilerine mahsustu. Hayvanın binmesi, yavrusu, yün ve yapağısı putun olur, sütü ile menfaati erkeklere mahsus kalırdı. Kadınlar bundan istifâde edemezlerdi. Abbâs Hazretlerinin beyânına göre, dişi deve beşinci yavruyu erkek doğurursa, o yavruyu keserler ve erkek kadın hep beraber yerlermiş. Dişi doğurursa, devenin kulağını yararlar, ona bâhira derlermiş. Arablarda deveyi sâibe yapmak âdeti Amr b. Âmir'den kalmıştır. arasında İsmail (aleyhisselâm)’in dinini ile değiştiren, put diken, sâibe ve bahîra âdetini ilk çıkaran kimse, bu adamdır. Hübel denilen putu Mekke'ye getirerek dikmiş, halkı ona ibâdet ve ta'zime teşvik etmiştir. Kendisi cömert bir adam olup, fakir fukarayı doyurduğu ve giydirdiği için Arablar üzerinde büyük nüfuzu varmış. Çok defa hac mevsiminde on bin deve keser, fukaraya on bin hülle giydirirmiş. hadîs-i şerif den anlaşılıyor ki, hiç bir kâfire âhirette dünyevî iyilikleri fayda vermeyeceği gibi, buna da bütün bu yaptıklarının zerre kadar faydası olmamış. Resûlüllah (sallallahü aleyhi ve sellem) kendisini cehennemde bağırsaklarını sürüklerken görmüştür",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7194,
			"arabicnumber": "2128.02",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Cerir Süheyl'den, o da babasından, o da Ebû lîüreyre'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): iki sınıf vardır ki, ben onları görmedim. (Biri) Beraberlerinde sığır kuyrukları gibi kamçılar olup, onlarla İnsanları döğen bir kavm, (diğeri) giyinmiş, çıplak, eğrilmiş ve eğrilten bir takım kadınlardır! Başları eğri deve hörgüçleri gibidir. Bunlar cennete giremeyecek, onun kokuşunu da duyamayacaklardır. Halbuki cennetin kokusu şu kadar ve şu kadar mesafeden duyulacaktır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7195,
			"arabicnumber": "2857.01",
			"text": "(Bize İbn Nümeyr rivâyet etti. ki): Bize Zeyd (yani; İbn Hubab) rivâyet etti. ki): Gize Eflah b. Saîd rivâyet etti. ki): Bize Ümmü Seleme'nin azatlısı Abdullah b. Râfi' rivâyet etti. ki): Ebû Hüreyre'yi şöyle derken işittim. Resûlüllah (sallallahü aleyhi ve sellem): yaşarsan ellerinde sığır kuyrukları gibi kamçılar bulunan bir kavmi görmen yakındır. Bunlar Allah'ın gadabı içinde sabahlar, Allah'ın hısımı içinde akşamlarlar.» buyurdular",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7196,
			"arabicnumber": "2857.02",
			"text": "Bize Ubeydullab b. Saîd İle Ebû Bekr b. Nâfi' ve Abd b. Humeyd rivâyet ettiler. (Dediler ki): Bize Ebû Âmir El-Akadî rivâyet etti. ki): Bize Eflah b. Saîd rivâyet etti. ki): Bana Ümmü Seleme'nin azatlısı Abdullah b. Râfi' rivâyet etti. ki): Ebû Hüreyre'yi şunu söylerken işittim: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: yaşarsan Allah'ın hışımı içinde sabahlayan ve lâneti içinde akşamlayan, ellerinde sığır kuyrukları gibi kamçılar olan bir kavimi görmen yakındır.» buyururken dinledim. hadîsin kadınlardan bahseden rivâyeti, çıplak kadınlar Bâbında geçmişti. şerif, Peygamber (sallallahü aleyhi ve sellem)’in mucizelerinden olup, haber verdiği gibi zuhur etmiştir. Yine hülâsa edelim; sığır kuyrukları gibi kamçıları olan kavm zabıta memurlarıdır. çıplaklardan murad; bir kavle göre Allah'ın nimetlerinden giyinip de şükretmeyen kadınlardır. İkinci kavle göre ise, bunlar elbise giyen, fakat hayr işleyip âhireti için çalışmayan kadınlardır. Üçüncü kavle göre güzelliklerini göstermek için bedenlerinin bir kısmını açanlardır. Dördüncü kavle göre ise, altındakini gösterecek derecede ince elbise giyenlerdir. kadınlar Allah'ın taatından çıkanlardır. Eğriltenler de, kendi yaptıkları marifeti başkasına Öğretenlerdir. Bâzılarına göre eğrilenlerden murad; kırıtarak yürüyenler, eğriltenler de, omuzlarını kırarak yürüyenlerdir. deve horgüçlerine benzetilmesi, saçlarına çeşitli şeyler sararak tepeye doğru yükselttikleri ve kurdukları hotos yana doğru eğril-diği içindir. şerif böylelerin cennete girmek şöyle dursun, onun kokusunu bile alamıyacaklarına açık delildir. olduğu kadar kadınların hiç bir devirde bu hadîs-i şerife tam mânâsıyle misâl teşkil ettikleri görülmemiştir sanırım. Allah müslümanlara intibahlar nasib etsin",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7197,
			"arabicnumber": "2858",
			"text": "(Bize Ebû Bekr b. Ebi Şeybe rivâyet etti. ki): Bize Abdullah b. İdris rivâyet etti. H. İbnû Nümeyr de rivâyet etti. ki): Bize \"babamla Muhammed b. Bişr rivâyet ettiler. H. Yahya b. Yahya da rivâyet etti. ki): Bize Mûsa b. A'ym haber verdi. H. Muhammed b. Râfİ' dahi rivâyet etti. ki): Bize Ebû Üsâme rivâyet etti. râvilerin hepsi İsmail b. E'oî Hâlid'den rivâyet etmişlerdir. H. Muhammed b. Hatim de rivâyet etti. Lâfız onundur. ki): Bize Yahya b. Saîd rivâyet etti. ki): Bize İsmail rivâyet etti. ki): Bize Kays rivâyet etti. ki): Ben Benî Fihrin kardeşi Müs-tevrid'den dinledim. (Şöyle diyordu): Resûlüllah (sallallahü aleyhi ve sellem): âhiretin yanında dünya ancak birinizin şu parmağını denize koyduğu kadarcıktır. Parmağın ne ile döneceğine bir baksın!» buyurdular. Yahya şehadet parmağı ile ibarette bulunmuştur. başka bütün râvilerin hadîsinde: «Ben bunu Resûlüllah (sallallahü aleyhi ve sellem) söylerken işittim...» ibaresi vardır. Üsâme'nin hadîsinde: «Benî Fihrin kardeşi Müstevrid b. Şed-dâd'dan...» ibaresi vardır. Yine onun hadîsinde: «İsmail baş parmağıyle işaret etti, dedi.» İfadesi vardır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7198,
			"arabicnumber": "2859.01",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Yahya b. Saîd, Hatim b. Ebî Sağîra'dan rivâyet etti. ki): Bana İbn Ebî Müleyke, Kaâsım b. Muhammed'd en, o da Âişe'den naklen rivâyet etti. Şöyle dedi: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: kıyâmet gününde yalınayak, çıplak, sünnetsiz olarak hasredilecek.» buyururken işittim. Ya Resûlallah! Kadın ve erkekler beraber olup, birbirlerine bakacaklar'mı? dedim. Resûlüllah (sallallahü aleyhi ve sellem): Âişe! Mesele birbirlerine bakmaktan da kötü!» buyurdular",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7199,
			"arabicnumber": "2859.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile İbn Nümeyr' de rivâyet ettiler. (Dediler ki): Bize Ebû Hâlid El-Ahmer, Kâtım b. Ebî Sağîra'dan bu is-nadla rivâyet etti. Ama hadisinde «sünnetli olarak...» tâbirini anmadı",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7200,
			"arabicnumber": "2860.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Züheyr b. Harb, İshak b. İbrahim ve İbn Ebî Ömer rivâyet ettiler. (İshak: Ahberana, ötekiler: Haddesena tâbirlerini kullandılar. Dediler ki): Bize Süfyan b. Uyeyne, Amr'dan, o da Saîd b. Cübeyr'den, o da İbn Abbâs'dan naklen rivâyet etti. İbn Abbâs, Peygamber (sallallahü aleyhi ve sellem)'i hutbe okurken dinlemiş. Şöyle diyormuş: ki, sîz Allah'a yürüyerek yalınayak, çıplak, sunnetsiz olarak kavuşacaksınız.» kendi hadîsinde: «Hutbe okurken...» kaydını anmamıştır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7201,
			"arabicnumber": "2860.02",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Veki' rivâyet etti. H. Ubeydullah b. Muâz da rivâyet etti. ki): Bize babam rivâyet etti. Her iki râvi Şu'be'den rivâyet etmişlerdir. H.. Muhammed b. Müsennâ ile Muhammed b. Beşşar dahi rivâyet ettiler. Lâfız İbn Müsennâ'nındır. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be, Muğîra b. Nu'man'dan, o da Saîd b. Cübeyr'den, o da İbn Abbâs'dan naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem) bir va'z dolayısıyle hutbe okumak için aramızda ayağa kalktı ve: insanlar! Hiç şüphe yok ki, siz Allah'a yalınayak, çıplak, sünnetsiz olarak hasredileceksiniz. (İlk yaratmaya nasıl başladıksa, üzerimize va'd olarak onu öylece iade edeceğiz. Biz va'dimizİ yaparız.) Süre-i Enbiya, âyet: 104 Dikkat edin ki, kıyâmet gününde mahlûkatın ilk giydirileni İbrahim (aleyhisselâm) olacaktır. Dikkat edin ki, benim ümmetimden bir takım adamlar getirilecek, fakat onlar sol tarafa alınacaktır. Bunun üzerine ben: Yarabbi! Bunlar benim ashabınıdır, diyeceğim. (Bana) ; Bunların senden sonra ne modalar çıkardıklarını sen bilmezsin? denilecek? Ben de sâlih kulun dediği gibi (Ben onlara aralarında bulunduğum müddetçe şâhid oldum. Benim ruhumu kabzedince (artık) onların üzerine rakib sen oldun. Sen her şeye şâhidsin. Onları azab edersen, şüphesiz onlar senin kullarındır. Affedersen şüphe yok ki, Aziz Hakim olan ancak sensin) Sure-i Mâide, âyet: 117-118 diyeceğim. Bunun üzerine bana: Sen onlardan ayrılalı onlar geriye dönmekte devam ettiler, denilecektir.» ile Muâvın hadîsinde: «Bunun üzerine sen onların, senden sonra ne modalar çıkardıklarını bilmezsin, denilecek...» cümlesi vardır. rivâyetleri Buhârî «Kitâbu'r-Rikâk»'da; Hazret-i Âişe rivâyetini Nesâî «Kitâbu’l-Cenâiz» ile «Kitabu't-Tefsir»'de; İbnû Mâce Kitabu'z-Zühd»'de tahric etmişlerdir. ilk rivâyetindeki «Bınıeterciu» kelimesi «Bimeyerciu» şeklinde de rivâyet edilmiştir. Bu takdirde zamir parmağa değil, şahsa râci olur. Fakat zamirin parmağa râci olması daha münâsibdir. Maksad parmağa çok su dokunmaz, demektir. Hadîsden murad şudur: Âhiretin devamlı lezzet ve nimetlerine nisbetle dünyanın fâni nimetleri denizden alınan bir katre gibidir. Ağrelin cem'idir. Ağrel sünnet edilmemiş kimse demektir. Çocuğu sünnet ederken kesilen deri parçasına arablar gürle derler. Ü\\x na-disaen maksad; kıyâmet gününde insanların cisimlerinden hiç bir şey kaybetmemek şartıyle dünyaya geldikleri andaki şekilleriyle haşrolunacaklarını beyândır. gününde İbrahim (aleyhisselâm)’in Peygamberimiz (sallallahü aleyhi ve sellem)’den önce giydirilmesi bâzılarına göre sünnet olmak ilk defa onun şeriatında meşru olduğu içindir. Sünnet olurken avret mahalli açıldığı için tesettür mukâfatı evvelâ ona verilecektir. Bazıları bundaki hikmetin Hazret-i İbrahim ateşe atılırken elbisesinden soyulmuş olmasını söylemişlerdir. Bu rivâyetteki sâlin kuldan murad Isâ (aleyhisselâm)'dır. Âyet-i kerîme onun sözlerini beyan etmektedir. Mürtedlerden murâd; ne olduğu ihtilaflıdır. Bazılarına göre bunlar Hazret-i Ebû Bekr devrinde dinden dönenlerdir. Hallâbi: «Resûlüllah (sallallahü aleyhi ve sellem) murted sözüyle dinden dönenleri değil, vazifelerini yapmayanları kastetmiştir. Allah'a hamdolsun ki, sahabeden hiç bir kimse dinden dönmemiş sadece bedevilerden bir takım beyinsizler dönmüşlerdir.» diyor. Kâdî Iyâz da: «Bunlar biri asîler, diğeri küfre dönenler olmak üzere iki sınıfdır.» demiştir. Bu hadîsin şerhi «Kitâbu't-Tahara»'da geçmişti. sarihlerinden Übbî , Peygamberlerin yüksek makamlarına bakarak onların çıplak haşredilmeyeceklerine kail olmuştur. Ona göre İbrahim (aleyhisselâm)’in giydirilmesi haşrden önce kabirden kalkarken olacaktır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7202,
			"arabicnumber": "2861",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Ahmed b. İshak rivâyet etti. H. Muhammed b. Hatim de rivâyet etti. ki): Bize Beliz rîvâyet etti. Her iki râvî demişler ki: Bize Vüheyb rivâyet etti. ki): Bize Abdullah b. Tavus babasından, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen rivâyet etti. (Şöyle buyurmuşlar): üç fırka olarak haşredileceklerdir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7203,
			"arabicnumber": "2862.01",
			"text": "Bize Züheyr b. Harb ile Muhammed b. Mûsennâ ve Ubeydullah b. Saîd rivâyet ettiler. (Dediler ki): Bize Yahya (yani; İbn Saîd) Ubeydullah'dan rivâyet etti. ki): Bana Nafi', İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen: gün insanlar alemlerin Rabbine ayağa kalkacaklardır.\" Sûre-i Mutaffifin, âyet: 6. âyeti hakkında haber verdi. Şöyle buyurmuşlar: her biri kulaklarının yansına kadar tere batmış olarak kalkacaktır.» İbn Müsennâ’nın rivâyetinde: «İnsanlar kalkacak...» demiş, günü anmamıştır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7204,
			"arabicnumber": "2862.02",
			"text": "(Bize Muhammed b. Ishak El-Müseyyebî rivâyet etti. ki): Bize Enes (yani; İbn Iyâz) rivâyet etti. H. Süveyd b. Saîd de rivâyet etti. ki): Bize Hafs b. Meyse-ra rivâyet etti. Her iki râvî Mûsa b. Ukhe'den rivâyet etmişlerdir. Ebû Bekr b. Ebî Şeybe de rivâyet etti, ki): Bize Ebû Hâlid El-Ahmer ile İsa b. Yûnus, İbn Avn'den rivâyet ettiler. H. Abdullah b. Ca'fer b. Yahya dahi rivâyet etti. ki): Bize Ma'n rivâyet etti. ki): Bize Mâlik rivâyet etti. H. Ebû Nasr Et-Temmûr da rivâyet etti. ki): Bize Hammad b. Seleme, Eyyûb’dan rivâyet etti. H. Hulvânî ile Abd b. Humeyd dahi Ya'kub b. İbrahim b. Sa'd'dan rivâyet ettiler. ki): Bize baham, Salih'den rivâyet etti. râvilerin hepsi Nâfi'den, o da İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)’âcn naklen Ubeydullah'in Nâfi'den rivâyet ettiğî hadîs mânâsında rivâyette bulunmuşlardır. Şu kadar var ki: Mûsa b. Ukbe ile Salih'in hadîsinde: onlardan biri kulaklarının yarısına kadar terine batacaktır.» ibaresi vardır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7205,
			"arabicnumber": "2863",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Abdû’l-Aziz (yani; İbnû Muhammed) Sevr'den, o da Ebû'l-Gays'dan, o da Ebû Hüreyre'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuşlar: ki, kıyâmet gününde ter, yerin içîne yetmiş kulaç inecektir. Ve şüphesiz ki, o insanlann ağızlarına yahut kulaklarına ulaşacaktır.» bunların hangisini söylediğinde şekketmiştir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7206,
			"arabicnumber": "2864",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7207,
			"arabicnumber": "2865.01",
			"text": "Bana Ebû Gassan El-Mismaî ile Muhammed b. Müsennâ ve Muhammed b. Beşşar b. Osman rivâyet ettiler. Lâfız Ebû Gassan ile İbn Müsennâ'nındır. (Dediler ki): Bize Muâz b. Hişam rivâyet etti. ki): Bana babam, Katade'den, o da Mutarrif b. Abdillah b. Şihhîr’den, o da Iyaz b. Hımar El-Mışâvî'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) bir gün hutbesinde şöyle buyurmuşlar: edin ki, Rabbim bana öğrettiklerinden bilmediklerinizi bugün size Öğretmemi emretti. Buyurdu ki: Bir kula verdiyim her mal helâldir. Ben kullarımın hepsini müslüman olarak yarattım. Ama onlara şeytanlar gelerek kendilerini dinlerinden alıp götürdüler. Benim kendilerine helâl kıldıklarımı, onlara haram ettiler. Benim hakkında zelil indirmediğim bir şeyi, bana şerik koşmalarını emrettiler. ki, Allah yer halkına bakarak onların Arabına, Acemine şiddetle buğzetmiştir. Yalnız ehl-i kitabdan bir takım bakıyyeler müstesna! Teâla Hazretleri: Ben seni ancak İmtihan edeyim ve seninle baskalannı imtihan edeyim diye gönderdim. Sana su götürmez bir kitab indirdim. Onu uyurken, uyanıkken okursun, buyurdu. Gerçekten Allah bana Kureyş'i cayır cayr yakmamı emretti. Ben: Yâ Rabbi! O hn'de benim başımı yararlar, onu bir ekmek parçasına çevirirler, dedim. Teâlâ Hazretleri: Onlar seni nasıl çıkardılarsa, sen de onları çıkar. Onlarla gaza et ki, sana yardım edelim. Infakda bulun, bîz de sana infak edelim! Sen bir ordu gönder. Biz onun beş mislini gönderelim! Sana İtaat edenlerle birlikte isyan edenlere karşı harbet, buyurdu. Cennetlikler üç kısımdır:",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7208,
			"arabicnumber": "2865.02",
			"text": "(Bize bu hadîsi Muhammed b. Müsennâ El-Anezî de rivâyet etti. ki): Bize Muhammed b. Ebi Adiy Saîd'den, o da Katade'den naklen bu isnadla rivâyet etti. Ama o hadîsinde: «Bir kula verdiğim her mal helâldir...» cümlesini anmamıştır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7209,
			"arabicnumber": "2865.03",
			"text": "(Bana Abdurrahman b. Bişr El-Abdî rivâyet etti. ki): Bize Yahya b. Saîd, Destevâî sahibi Hişam'dan rivâyet etti. ki): Bize Katâde, Mutarrifden, o da Iyâz b. Hımar'dan naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem) bir gün hutbe okumuş... râvî hadîsi nakletmiş; sonunda şöyle deditir: «Yahya dedi ki: Şu'be, Katade'den naklen söyledi. Katâde: Ben bu hadîs hakkında Mutarrifi dinledim, demiş.»",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7210,
			"arabicnumber": "2865.04",
			"text": "(Bana Ebû Ammar Hüseyin b. Hureys de rivâyet etti. ki): Bize Fadl b. Mûsa, Hüseyin'den, o da Matar'dan naklen rivâyet etti. ki): Bana Katâde, Mutarrif b. Abdillah b. Şihhîr'den, o da Benî Muşâcı'ın kardeşi Iyaz b. Himar'dan naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem) bir gün hutbe okumak üzere aramızda ayağa kalktı da: ki, Allah bana emir buyurdu...» dedi. hadîsi Hişam'ın Katâde'den rivâyet ettiği hadîs gibi nakletmiş. Şunu da ziyâde eylemiştir: ki, Allah bana sîzin tevazu göstermenizi bildirdi. Tâ ki, kimse kimseye karşı böbürlenmesin, kimse kimseye tecavüzde bulunmasın!» hadîsinde şun da söylemiştir: sizîn aranızda tabiîlerdir. Ne aile ararlar, ne de mal.» diyor ki: Ben (Mutarrife): Bu olur mu ya Ebâ Abdillah? dedim. Evet! Vallahi ben onlara cahiliyyet devrinde eriştim. Bir adam mahallenin koyunlarını güdüyor, kendisine ancak onların cariyesi veriliyor, ona yakınlık ediyordu, dedi. kula verdiğim her mal helâldir...» cümlesinden murad: Arabla-nn kendilerine haram kıldıkları sâibe, bahire gibi şeyleri inkârdır. Bunlar onların haram itikad etmesiyle haram olmazlar, demektir. Hanifin cem'idir. Hanîf müslüman demektir. Bazıları bu kelimenin günahlardan temiz mânâsına geldiğini, bir takımları da doğru ve hidâyeti kabule müheyya demek olduğunu söylemişlerdir, teâlâ’nın yeryüzü halkına bakarak Arabına, Acemine şiddetle buğz etmesi Resûlullah (sallallahü aleyhi ve sellem)'in gönderilmesinden önce olmuştur. Resûlüllah (sallallahü aleyhi ve sellem)'i imtihan buyurması risâleti tebliğ, cihâd ve hak yolunda sabır gibi şeyler hususunda, ümmetini imtihan ise, iman edip etmeyecekleri, taatta bulunup bulunmıyacakları hususundadır. Bu imtihan her şeyden meydana çıkarak kullar tarafından bilinsin diyedir. Yoksa Teâlâ Hazretleri hâşa imtihana muhtaç değildir. O her şeyi vukuundan Önce bilir. Akıl demektir. Bazıları bu kelimenin mal mânâsına geldiğini, bir takımları da itîmad edilecek şey demek olduğunu söylemişlerdir. Abdillah, Hazret-i Mutarrif'in künyesidir. Mutarrif (radıyallahü anh) cahiliyyet devrine yetişmemişse de «yetiştim» sözüyle her halde devrin sonlarına ve eserlerine yetiştiğini kasdetmiş olacaktır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7211,
			"arabicnumber": "2866.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Mâlik'e, Nâfi'den dinlediğim, onun da İbn Ömer'den rivâyet ettiği şu hadîsi okudum. Resûlüllah (sallallahü aleyhi ve sellem): şüphe yok ki, sizden biriniz öldüğü vakit kendisine sabah akşam varacağı yer gösterilecektir. Cennetliklerdense cennetlik olacak, cehennem-liklerdense cehennemlik olacaktır. Kendisine işte senin yerin budur, tâ Allah seni kıyâmet gününde oraya gönderinceye kadar! denilecektir.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7212,
			"arabicnumber": "2866.02",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7213,
			"arabicnumber": "2867",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7214,
			"arabicnumber": "2868",
			"text": "(Bize Ebû Bekr b. Ebî Şeybe rivâyet etti. ki): Bize Veki’ rivâyet etti. H. Ubeydullah b. Muâz da rivâyet etti. ki): Bize babam rivâyet etti. H. Muhammed b. Müsennâ ile İbn Beşşâr da rivâyet etliler. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. râvilerin hepsi Şu'be'den, o da Avnî. Ebî Cuhayfe'den naklen rivâyet etmişlerdir. H. Züheyr b. Harb ile Muhammed b. Müsenna ve İbn Beşşâr dahi hep birden Yahya El-Kattan'dan rivâyet ettiler. Lâfız Züheyr'indir. ki): Bize Yahya b. Saîd rivâyet etti. ki): Bize Şu'be rivâyet etti. ki): Bana Avn b. Ebî Cuhayfe, babasından, o da Bera'dan, o da Ebû Eyyûb'dan naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem) güneş battıktan sonra (dışarı) çıktı da bir ses işitti ve: kabirlerinde azab olunuyorlar.» buyurdu",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7215,
			"arabicnumber": "2869",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7216,
			"arabicnumber": "2870.01",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 7217,
			"arabicnumber": "2870.02",
			"text": "(Bize Muhammed b. Minhâl Ed-Darir de rivâyet etti. ki): Bize Yezid b. Zürey' rivâyet etti. ki) ; Bize Saîd b. Ebî Arû!;e, Katâde'den, o da Enes b. Mâlik'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): meyyit kabrine konulduğu vakit, kendisini getirenlerin oradan ayrılırken ayakkabı seslerini pek âlâ işitir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7218,
			"arabicnumber": "2870.03",
			"text": "(Bana Amr b. Zûrâra rivâyet etti. ki): Bize Abdü’l-Vehhab (yani; İbn Atâ') Saîd'den, o da Katâde'den, o da Enes b. Mâlik’den naklen haber verdi ki, Nebiyyullah (sallallahü aleyhi ve sellem): kul kabrine konup, dostları yanından döndükleri vakit...» buyurmuşlar, Seyhan'ın Katâde'den rivâyet ettiği hadîs gibi nakletmiştir",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7219,
			"arabicnumber": "2871.01",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7220,
			"arabicnumber": "2871.02",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7221,
			"arabicnumber": "2872",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7222,
			"arabicnumber": "2873",
			"text": "(Bize Şeybân b. Ferrûh da rivâyet etti. Lâfız onundur. ki): Bize Süleyman b. Muğıra, Sâbit'ten, o da Enes b. Mâlik'den, naklen rivâyet etti. Enes şöyle dedi: Mekke ile Medine arasında Ömer'le beraber idik. bakıştık. Ben keskin gözlü bir adamdım ve onu gördüm. Benden başka onu gördüğünü söyleyen kimse olmadı. Ömer'e, onu göremiyor musun? demeye başladım. Ömer onu bir türlü göremiyordu. Onu döşeğim üzerine yatarak göreceğim, dedi. Sonra bize Bedir muhariplerinden bahsetmeye başladı ve şöyle dedi: Hakikaten Resûlüllah (sallallahü aleyhi ve sellem) dün bize Bedir muhariblerinin düşecekleri yerleri gösteriyor: yarın inşallah filânın düşeceği yerdir.» buyuruyordu. Müteakiben Ömer şöyle dedi: Onu hakla gösteren Allah'a yemin ederim ki: Resûlüllah (sallallahü aleyhi ve sellem)'in çizdiği hududu şaşmıyorum. Bedir'-de öldürülenler birbirleri üzerine bir kuyuya atıldılar. Resûlüllah. (sallallahü aleyhi ve sellem) de giderek yanlarına vardı ve: filân onlu filân! Ey fitân oğlu filân! Allah'ın ve Resûlünün sîze va'd ettiklerini hak buldunuz mu? Ben Allah'ın bana va'dettiğini hak buldum.» buyurdular. Ömer: Ya Resûlallah! Ruhları olmayan cesetlerle nasıl konuşuyorsun? dedi. Resûlüllah (sallallahü aleyhi ve sellem): söylediklerimi siz onlardan daha İyi işitir değilsiniz. Şu kadar var ki, bana bir cevab vermeye kadir değillerdir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7223,
			"arabicnumber": "2874",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7224,
			"arabicnumber": "2875",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7225,
			"arabicnumber": "2876.01",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 7226,
			"arabicnumber": "2876.02",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 7227,
			"arabicnumber": "2876.03",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 7228,
			"arabicnumber": "2876.04",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 7229,
			"arabicnumber": "2877.01",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 7230,
			"arabicnumber": "2877.02",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 7231,
			"arabicnumber": "2877.03",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 7232,
			"arabicnumber": "2878.01",
			"text": "Bize Kuteybe b. Saîd ile Osman b. Ebî Şeybe rivâyet ettiler. (Dediler ki): Bize Cerir, A'meş'den, o da Ebû Süfyan'dan, o da Câbir'den naklen rivâyet etti. (Şöyle dedi): Ben, Peygamber (sallallahü aleyhi ve sellem)’ı: kul Öldüğü hal üzere diriltilecektir.» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 7233,
			"arabicnumber": "2878.02",
			"text": "(Bize Ebû Bekr b. Nâfi’ rivâyet etti, ki): Bize Abdurrahman b. Mehdî, Süfyan'dan, o da A'meş'den naklen bu isnadla bu hadîsin mislini rivâyet etti. Ve: «Peygamber (sallallahü aleyhi ve sellem)'den» dedi, «işittim» demedi",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 7234,
			"arabicnumber": "2879",
			"text": "(Bana Harmele b. Yahya Et-Tücîbî de rivâyet etti. ki): Bize İbn Vehb ha'cer verdi. ki): Bana Yûnus, İbn Şihab'dan naklen haber verdi. ki): Bana Hamza b. Abdillah b. Ömer haber verdi ki: Abdullah b. Ömer Şöyle dedi: Ben, Resûlüllah (sallallahü aleyhi ve sellem): bir kavmi azab etmeyi dilerse, azab o kavmin içindekilere isâbet eder. Sonra amelleri üzerine diriltilirler.» buyururken işittim. b. Ömer rivâyetini Buhârî «Kitâbu'l-Fiten» de tahric etmiştir. teâlâ'ya hüsn-ü zanda bulunmanın mânâsı; Ölürken onun rahmet ve affını ummaktır. Ulemâ kulun hâli hayatında korku ile ümit arasında bulunması gerektiğini söylemişlerdir. Bazıları Allah korkusunun rahmet ümidinden daha fazla olması lâzım geldiğini söylemişlerdir. Ölüm emareleri belirince artık ümid tarafı galebe çalmalı yahut kulun hâli sırf ümidden ibaret olmalıdır. Çünkü Allah korkusundan maksat günahlardan kaçmnınk, amel ve taatları cok yapmaya gavret göstermektir. Ölüm halinde ise bunlar imkânsızdır. Binâenaleyh Allah'a hüsn-ü zanda bulunmak, onun affı merhametine sığınmak müstehab görünmüştür. Zîra bunda kulun Allah'a muhtaçlığı mânâsı vardır. Nitekim Bâbımızın non hadîsi de bunu te'yid eder. Bu hadîs kul ne halde öldüyse, o halde dirileceğine delâlet etmektedir. hadîsdeki «men» kelimesi umum bildiren sigalardandır. Şu halde Allah'ın azabı dünyada iyilere de isabet edecek demektir. Lâkin kıyâmet gününde herkes ameline göre diriltileceğinden iyiler dünyada gördükleri o azabın karşılığında mükâfata nail olacaklardır",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 103
			}
		}
	]
}