{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7417,
			"arabicnumber": "2956",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Abdü’l-Aziz (yani; Derâverdî) Alâ'dan, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): mü'minîn zindanı, kâfirîn cennetidir.» buyurdular",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7418,
			"arabicnumber": "2957.01",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7419,
			"arabicnumber": "2957.02",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7420,
			"arabicnumber": "2958.01",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7421,
			"arabicnumber": "2958.02",
			"text": "(Bana Süveyd b. Saîd rivâyet etti. ki): Bana Hars b. Meysera, Alâ'dan, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem): malım, malım diyor. Halbuki malından ona yalnız uç şey vardır:",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7422,
			"arabicnumber": "2959.01",
			"text": "(Bana bu hadîsi Ebû Bekir b. İshak da rivâyet etti. ki): iîze İbn Ebî Meryem haber verdi. ki): Bize Muhammed b. Ca'fer haber verdi. (Dedİ ki): Bana Alâ b. Abdirrahman bu isnadla bu hadîsin mislini haber verdi",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7423,
			"arabicnumber": "2959.02",
			"text": "(Bize Yahya b. Yahya Et-Temîmî İle Züheyr b. Harb ikisi birden Uyeyne'den rivâyet ettiler. Yahya dedi ki: Bize Süfyan b. Uyeyne, Abdullah b. Ebî Bekr'den naklen haber verdi. ki): Ben Enes b. Mâlik'i şunu söylerken işittim: Resûlüllah (sallallahü aleyhi ve sellem): üç şey takib eder. Bunlardan ikisi döner, biri kalır. Onu ailesi, malı ve ameli takib eder; ailesi ile malı döner, ameli kalır.» buyurdular. malım, malım demesinden murad; malına aldanıp gücenmesi ve çok defa onunla iftihar edip, böbürîenmesidir. Bu hal onu ibâdet ve tâatdan alıkor. biriktirmek demektir. Burada ondan murad; sevabını biriktirmektir. Bu rivâyetler ilerde fayda vermesi için amel ve ibâdetleri yerli yerince yapmaya teşvik etmektedirler",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7424,
			"arabicnumber": "2960",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7425,
			"arabicnumber": "2961.01",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7426,
			"arabicnumber": "2961.02",
			"text": "(Bize Amr b. Sevvâd El-Âmirî rivâyet etti. ki): Bize Abdullah b. Vebb haber verdi. ki): Bana Amr b. Haris haber verdi. Ona da Bekir b. Sevâde rivâyet etmiş. Ona da Yezîd b. Rebah (bu zat Abdullah b. Amr b. Âs’ın azatlısı Ebû Firâs'dır), Abdullah b. Amr b. As’dan, o da Resûlüllah (sallallahü aleyhi ve sellem)’den naklen rivâyet etmiş ki: İran ve Bizans fethedildiği vakit, sizler hangi kavimsiniz?» buyurmuş. Abdurrahman b. Avf: Bize Allah'ın emrettiği gibi deriz, cevabını vermiş. Resûlüllah (sallallahü aleyhi ve sellem): başka bir şey yapmaz mısınız? Yarış edersiniz. Sonra birbirlerinize hasedlik çekersiniz. Sonra birbîrlerinize sırt çevirirsiniz. Sonra birbîrlerinize küsersiniz. Yahut buna benzer şeyler yaparsınız. Sonra muhacirlerin fakirlerine gider de, onları birbirleri üzerine vali yaparsınız.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7427,
			"arabicnumber": "2962",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7428,
			"arabicnumber": "2963.01",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7429,
			"arabicnumber": "2963.02",
			"text": "(Bana Züheyr b. Harb da rivâyet etti. ki): Bize Cerir rivâyet etti. H. Ebû Küreyb de rivâyet etti, ki): Bize Ebû Muâviye rivâyet etti. H. Ebû Bekr b. Ebî Şeybe dahi rivâyet etti. Lâfız onundur. ki): Bize Ebû Muâviye ile Vekî, A'meş'den, o da Ebû Salih'den, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): daha aşağı olanlara bakın! Sizin fevkinizde olanlara bakmayın! Bu Allah'ın nimetini küçümsememenize daha lâyıktır.» buyurdular. Muâviye: «Allah'ın sîzin üzerinize olan nimetini.» demiş. rivâyetleri Buhârî «Kitâbu'l-Cizye» ve «Kitâbü'r-Rikak»'da tahric etmiştir. Irak'ta Basra ile Hecar arasında meşhur bir beldedir. O zamanlar ahalisi ekseriyetle Mecûsilerden müteşekkildi. Mecûsi'lerden cizye denilen vergi alınırdı. Hazret-i Ebû Ubeyde bu cizyeyi getirmişti. Ensarı kirâmın, sabah namazında Mescid-i Nebeviye toplanmalarından anlaşılıyor ki, şâir namazları kendi mescitlerinde kılarlar-mış. Çünkü her kabilenin ayrı ayrı mescitleri vardı. Resûlüllah (sallallahü aleyhi ve sellem)’in gülümsemesi, onların maksadını anladığındandır. Filhakika Ensarın mala ihtiyaçları olduğu, huzuruna bu maksatla çıktıkları hallerinden belli idi. Peygamber (sallallahü aleyhi ve sellem) «Sevinin!» diyerek arzularını yerine getirdiğini müjdelemiş, arkacığından onlar için fakirlikten değil, bilâkis zenginlikten korktuğunu izah buyurmuştur. Bu endişenin sebebi ihtimal ki, dünyanın kendilerine feth edileceğini ve ileride zengin olacaklarını bilmesidir. Fakat, bu sözü ile fakirliğin zararı zenginliğin zararından daha az olduğuna işaret etmiş de olabilir. Çünkü fakirliğin zararı ekseriyetle dünyevî, zenginliğin zararı ise ekseriyetle dînî olur, Resûlüllah (sallallahü aleyhi ve sellem) ashabının dünya malı kazanmak için birbirleri ile münâfese ederek geçmiş milletler gibi helâk olmalarından endişe duyduğunu tasrih buyurmuştur. Bir şeye rağbet göstererek ona yalnız başına sahip olmaya çalışmak ve bu babta âdeta yarış etmektir. Dünya malı için yapılan bu yarışın sonu kavga ve helâke varır. İbn Battal diyor ki: «Bu hadîs dünya malının kötü akıbetinden ve fitnesinin şerrinden korunmak gerektiğine delildir. İnsan dünya zînetlerine aldanarak bu hususta başkaları ile yarış etmemelidir. Yine bu hadîsle fakirliğin zenginlikten efdal olduğuna istidlal edilir. Çünkü dünya fitnesi zenginlikle beraberdir.» bir rivâyetinde Hazret-i Abdırrahman b. Avf'ın Peygamber (sallallahü aleyhi ve sellem)’e cevaben: «Allah'ın bize emrettiği gibi söyleriz.» demesinden murâd; ona hamd ve şükür ederiz, fazlının devam ve ziyadesini dileriz, demektir. Resûlüllah (sallallahü aleyhi ve sellem) buna karşılık: başka bir şey yapmaz mısınız?» mânâsına gelen: «E ve gayra zâlik» cümlesiyle başlayan beyanatını serd etmiştir. Fakat, bu cümle «Ev gayru zâlik» şeklinde de rivâyet olunmuştur. Bu takdirde mânâsı: «Yahut bundan başka şeyler yaparsınız» demek olur. Hazret-i Ebû Hüreyre rivâyeti hakkında İbn Battâ1 şunları söylemiştir: «Bu hadîs bütün hayır mânâlarını cem' etmektedir. Çünkü insan dine müteallik husûsatta mutlaka kendinden üstün olanı bulacaktır. Onun derecesine varmak istediği zaman kendi halini kusurlu görecek ve daima Allah'ına yaklaşması artacaktır. Darlık içinde bulunan bir kimse de kendinden daha fakirini bulacak ve bunu düşündüğü zaman Allah'ın kendisine birçok kimselerden fazla ni'met verdiğini anla-layacaktır. Binâenaleyh haline şükredecek, bu da âhiretteki ecrini yükseltecektir.» «Bu hadiste derde deva vardır. Çünkü insan kendinden üstün olana bakarsa ona hasetlik çekmekten emin olamaz. Onun devası kendinden aşağı olana bakmaktır. Tâ ki, bu hal onun şükrüne sebep olsun!» demişlerdir",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7430,
			"arabicnumber": "2963.03",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7431,
			"arabicnumber": "2964",
			"text": "(Bize Şeybân b. Ferrûh rivâyet etti. ki): Bize Hemmam rivâyet etti. ki): Bize İshak b. Abdillâh b. Ebî Talha rivâyet etti. ki): Bana Abdurrahman b. Ebî Amr'a rivâyet etti. Ona da Ebû Hüreyre rivâyet etmiş ki, kendisi Peygamber (sallallahü aleyhi ve sellem)’ı şöyle buyururken işitmiş: İsrail'de biri abraş, biri kel, biri de kör üç kişi varmış. Allah onları imtihan etmek istemiş de, kendilerine bir melek göndermiş. Melek Abraş'a gelerek: Sence en makbul şey nedir? diye sormuş. Abraş: Güzel renk, güzel cild ve benden insanların iğrendiği halin gitmesidir, demiş. Bunun üzerine melek onu sıvazlamış ve iğrenç hali gitmiş, kendisine güzel bir renk ve güzel bir cild verilmiş. Melek: Sence hangi mal en makbuldür? diye sormuş. Abraş: Devedir (yahut; sığırdır, ishak şekketmiş.) demiş. —Şu kadar var ki. Abraşla Kelden biri devedir, demiş, öteki sığırdır demiştir— ve kendisine doğurması yakın bir deve verilmiş. Bunun üzerine Melek: Allah sana bu devede bereket versin, demiş. Müteakiben Kele gelerek: Sence en makbul şey nedir? diye sormuş. Kel: Güzel saç ve insanların iğrendiği şu halin benden gitmesidir, demiş. Melek onu da sıvazlamış ve o hal gitmiş. Kendisine güzel saç verilmiş. Melek: Sence hangi mal en makbuldür? diye sormuş. Kel: Sığırdır, cevâbını vermiş. Hemen kendisine hâmile bir inek verilmiş ve melek: Allah bu inekte sana bereket versin, demiş. Sonra köre gelerek ; Sence en makbul şey nedir? diye sormuş. Kör: Allah'ın bana gözümü iade etmesi ve onunla insanları görmemdir, demiş. Melek onu da sıvazlamış ve Allah gözünü ona iade etmîş. Sence hangi mal en makbuldür? diye sormuştur: Koyundur, cevâbını vermiş, hemen Kendisine doğurmuş bir koyun verilirmiş. Derken ötekiler üretmiş. Beriki, de doğurtmuş. Bu suretle birinin bir vâdi devesi, diğerinin bir vadi sığırı, bunun da bir vadi koyunu olmuş. melek abraşa eski suret ve kılığında gelerek: Ben fakir bir adamım, yolculuğumda bütün çarelerim inkıta'a uğradı. Bugün evvel Allah sonra senden başka beni (evime) ulaştıracak yoktur. Senden şu güzel rengi, güzel cildi ve malı veren (Allah) aşkına bir deve istiyorum. Yolumda onun üzerinde muradıma ulaşacağım, dedi. Abraş: Haklar çoktur, mukabelesinde bulunmuş. Bunun üzerine melek ona: Ben seni tanır gibiyim. Sen İnsanların iğrendiği abraş değil misin? Hani fakirdin, Allah sana verdi, demiş. Abraş: Ben bu malı ancak ve ancak büyükien büyüğe (intikal eden) bir miras olarak edindim, cevâbını vermiş. Melek de: Yalancı İsen Allah seni eski haline çevirsin! demiş. kele de eski suretinde gelerek, buna söylediğinin mislini söylemiş. O dahi bunun gibi cevap vermiş. Bunun üzerine: Yalancı isen Allah seni eski haline çevirsin, demiş. de eski suret ve kılığında gelerek: Ben yoksul ve yolcu bir adamım. Yolculuğumda bütün çarelerim inkıtaa uğradı. Evvel Allah, sonra senden başka bugün beni (evime) ulaştıracak yüktür. Senden gözünü iade eden (Allah) aşkına bir koyun istiyorum. Onunla yolumda (muradıma) ulaşacağım, demiş. Kör: Gerçekten ben âmâ idîm. Alah bana gözümü iade etti. İmdi dilediğini al, dilediğini bırak! Vallahi bugün Allah için aldığın bir şeyde sana zorluk çıkarmam, demiş. Bunun üzerine melek: Malın senin olsun. Siz ancak imtihan edildiniz. Senden razı olundu, İki arkadaşın da hışıma uğradı, demiş.» hadîsi Buhârî «Kitâbu'l-Eyman ve'n-Nüzûr» ile «Kitâbu'l Enbiyâ»da tahric etmiştir. Bedeninde yer yer beyaz lekeler olan kimsedir. Bu hâl mizaç bozukluğundan ileri gelir. abraşa eski suretinde gelmesinden murad; ilk göründüğü şeklidir. O şekliyle görünmesi dâvasını isbâta daha elverişli olduğu içindir. Görülüyor ki, bu üç kişi Allah tarafından imtihan edilmiş ve imtihanı yalnız âmâ kazanmıştır. İçlerinde tabiatı en ziyâde selâmete yakın olan da odur. Çünkü gerek abraşlık, gerekse saç dökülmesi mizaç bozukluğundan ileri gelir. Körlük öyle değildir. O haricî bir sebepten de ileri gelebilir. Hadis-i şerîî fakirlere yardım ve ikramda bulunmaya istediklerini vermeye, kalblerini kırmaktan sakınmaya teşvik etmektedir, Allah'ın nimetlerinden bahsederek şükür, o nimetleri küfrandan kaçınmak lüzumu da bu hadîsin işaretleri cümlesindendir",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7432,
			"arabicnumber": "2965",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7433,
			"arabicnumber": "2966.01",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7434,
			"arabicnumber": "2966.02",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7435,
			"arabicnumber": "2967.01",
			"text": "(Bize Seyhan b. Ferrûh rivâyet etti. ki) Bize Süleyman b. Muğîra rivâyet etti. ki): Bize Humeyd b. Hilâl, Hâlid b. Umeyr El-Adevî'den rivâyet etti. (Şöyle dedi): Bize Utbe b. Gazvân hutbe okudu. Allah'a hamdu sena etti. Sonra şunları söyledi: Bundan sonra (malûm ola ki) dünya geçici olduğunu bildirmiş ve sür'atle geçip gitmiştir. Ondan kabın dibinde kalan ve sahibi içen kalıntı gibi, bakıyyeden başka bir şey kalmamıştır. Hiç şüphe yok ki, siz dünyadan zevali olmayan bir diyara intikal edeceksiniz. O halde elinizde olanın en hayırlısı ile intikal edin. Bize söylendiğine göre Cehennemin kenarından bir taş atılacak. Taş yetmiş yıl cehenneme düşecek, dibine eremiyecektîr. Vallahi cehenneme doldurulacaksınız. Buna şaştınız mı? Filhakika bize anlatıldığına göre, cennet kapılarından her iki kanadın arası kırk yıllık mesafedir. Cennetin üzerine gün gelecek izdihamdan kapıya kadar dolacaktır. Ben kendimin Resûlüllah (sallallahü aleyhi ve sellem)'e beraber bulunan yedi kişinin yedincisi olduğumu görmüşümdür. Ağaç yaprağından başka yiyeceğimiz yoktu. Hattâ dudaklarımız yara oldu. Ben bir örtü buldum da onu yararak kendimle Sa'd b. Mâlik arasında taksim ettim. Yansıyle kendim sarındım, yarısıyle de Sa'd sarındı. Bugün ise bizden hiç birimiz yoktur ki, şehirlerden birine vali olmasın. Ben nefsim hakkında büyük, Allah ındinde küçük olmaktan Allah'a sığınırım. Gerçekten hiç bir Peygamberlik yoktur ki, neshedilmemiş akıbeti saltanata müncer olmasın. Sizler yakında haber alacak ve bizden sonra gelecek valileri tecrübe edeceksiniz",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7436,
			"arabicnumber": "2967.02",
			"text": "(Bana İshak b. Ömer b. Selit de rivâyet etti, ki): Bize Süleyman b. Muğıra rivâyet etti. ki): Bize Humeyd b. Hilâl, Hâlîd b. Umeyr'den rivâyet etti. Bu zât câhiliyyet devrine yetişmiştir, ki): Utbe b. Gazvân hutte okudu. Kendisi Basra valisi idi... râvî, Seyhan'ın hadîsi gibi nakletmiştir",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7437,
			"arabicnumber": "2967.03",
			"text": "(Bize Ebû Küreyb Muhammed b. Alâ' dahi rivâyet etti. ki): Bize Vcki', Kurra b. Ilâ'ıd'den, o da Humeyd b. Hilâl'den, o da Hâlid b. Umeyr'den naklen rivâyet etti. ki): Beri Uthe b. Gazvân’i şunu söylerken işittim: Gerçekten kendimin Resûlüllah (sallallahü aleyhi ve sellem)'le birlikte bulunan yedi kişinin yedincisi olduğumu görmüşümdür. Huble yaprağından başka yiyeceğimiz yoktu. Hattâ dudaklarımız yara oldu",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7438,
			"arabicnumber": "2968",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7439,
			"arabicnumber": "2969",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Muhammed b. Fudayl, o da Umara b. Ka'kâ'dan, o da Ebû Zür’a’dan, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): Âli Muhammed'in rızkını: yetecek kadarcık ver!» diye duâ ettiler",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7440,
			"arabicnumber": "1055.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Amru'n-Nâkıd, Züheyr b. Harb ve Ebû Küreyb de rivâyet ettiler. (Dediler ki): Bize Veki' rivâyet etti. ki): Bize A'meş, Umara b. Ka'kâ'dan, o da Ebû Zür’a’dan, o da Ebû Hüreyre'den naklen rivâyet etti. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): Âli Muhammed'in rızkını yetecek kadar ver!» diye dua ettiler. rivâyetinde: Rızık ver!» denilmiştir",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7441,
			"arabicnumber": "1055.03",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7442,
			"arabicnumber": "1055.04",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7443,
			"arabicnumber": "2970.01",
			"text": "(Bize Ebü Bekr b. Ebû Şeybe rivâyet etti. ki): Bİze Hafs b. Gıyâs, Hişam b. Urve'den, o da babasından naklen rivâyet ettî. ki): Âişe şunu söyledi: Muhammed (sallallahü aleyhi ve sellem) kendisi göçüp gidinceye kadar, üç gece buğday ekmeğinden doya doya yememiştir.»",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7444,
			"arabicnumber": "2970.02",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7445,
			"arabicnumber": "2970.03",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7446,
			"arabicnumber": "2970.04",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7464,
			"arabicnumber": "2980.01",
			"text": "(Bize Yahya b. Eyyûb ile Kuteybe b. Saîd ve Alî b. Hucur, toptan İsmail'den rivâyet ettiler. İbn Eyyûb ki): Bize İsmail b. Ca'fer rivâyet etti. ki): Bana Abdullah b. Dinar haber verdi. Ki, Abdullah b. Ömer'i şöyle derken işitmiş. Resûlüllah (sallallahü aleyhi ve sellem) Hıcrlılar hakkında ; azab gören kavmin üzerine girmeyin. Ancak ağlayarak girerseniz o başka! Eğer ağlar halde değilseniz, onların basına gelen sizin başınıza da gelmemesi İçin yanlarına girmeyin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7465,
			"arabicnumber": "2980.02",
			"text": "(Bana Harmele b. Yahya rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihab'dan naklen haber verdi. Kendisi Hicrî (yani) Semûd kavminin meskenlerini anlatıyormuş. Salim b. Abdillah ki: Gerçekten Abdullah b. Ömer şunları söyledi: Resûlüllah (sallallahü aleyhi ve sellem) ile birlikte Hıcra uğradık. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) bize: zulmedenlerin başına gelenler, sizin başınıza da gelmesinden korunmak için onların meskenlerine girmeyin! Ancak ağlayarak girerseniz o başka!» buyurdu. Sonra hayvanını sürdü ve sür'atle giderek o yeri arkasında bıraktı",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7466,
			"arabicnumber": "2981.01",
			"text": "(Bana Hakem b. Mûsa Ebû Salih rivâyet etti. ki): Bize Şuayb b. İshak rivâyet etti. ki): Bize Ubeydullah, Nâfi'den naklen haber verdi. Ona da Abdullah b. Ömer haber vermiş ki: Cemaat Resûlüllah (sallallahü aleyhi ve sellem) ile birlikte Hıcra (yani; Semûd) kavminin toprağına inmişler de, oranın kuyularından su çekmişler. Ve o su ile hamur karmışlar. Derken Resûlüllah (sallallahü aleyhi ve sellem) çektikleri suyu dökmelerini, hamuru da develere yem yapmalarını emir buyurmuş. Onlara dişi devenin gittiği kuyudan su çekmelerini emretmiş",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7467,
			"arabicnumber": "2981.02",
			"text": "(Bize İshak b. Mûsa El-Ensârî de rivâyet etti. ki): Bize Enes b. Iyâz rivâyet etti. ki): Bana Ubeydullah bu isnadla bu hadîsin mislini rivâyet etti. Şu kadar var ki o: «Kuyularından su çektiler de onunla hamur kardılar.» demiştir. rivâyetleri Buhârî «Kitâbu's-Salât» ile «Kitâbu'l-Enbiya»'da tahric etmiştir. Semûd kavminin yaşadığı yerlerdir. Ki Şam'la Medine arasına düşer. Resûlüllah (sallallahü aleyhi ve sellem) ordusuyla Tebûk gazasına giderken buradan geçmiş ve Allah'ın hışmına uğrayarak helâk olan bu kavmin memleketine uğramayı ashabına yasak etmiş, oraya girerlerse ağlayarak girmelerine müsaade buyurmuştu. Semûd kavmi Salih (aleyhisselâm)’ın ümmetidir. Bunlar Hazret-i Sâlih'e isyanları sebebiyle Allah'ın gazabına uğrayarak helâk olmuşlardı. Resûlüllah (sallallahü aleyhi ve sellem) Ümmetinin de bu yere girerlerse bir musibete duçar olurlar endişesiyle oraya girmelerini yasak etmiş, mutlaka girmek icab ediyorsa ağlamalarını emir buyurmuştu. Bunun sebebi ağlamanın düşünüp ibret almaya müncer olmas;dır. Ağlamayı emir âdeta ibret almayı emir gibidir. Böyle bir kavmin yurtlarından geçerken onların hallerini düşünmemek ve ibret almamak ihmalkârlık hususunda onlara benzemek olur. Ve bilmelice kalb katılaşır, onların amellerini işleyerek akıbetlerine uğramak mümkündür. hadîsler murakabeye zâlimler diyarından geçerken, onlardan ibret almaya teşvik etmektedirler. Nitekim Peygamber (sallallahü aleyhi ve sellem) Müzdelife'den Mîna'ya dönen hacıların Muhassir vadisinden geçerken sür'atle yürümelerini emir buyurmuştu. Çünkü Astı abı Fil denilen Ebrehe ordusu burada helâk edilmişti. Binâenaleyh böyle yerlerden geçerken murakabeye ve tefekküre dalarak, Allah'ın hışmından korkmak, ağlamak ve orada helâk olanlardan ibret alarak Allah'a sığınmak icab eder. Hadîs-i şerifte bundan maada şu fâideler vardır:",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7468,
			"arabicnumber": "2982",
			"text": "(Bize Abdullah b. Mesleme b. Ka'neb rivâyet etti. ki): Bize Mâlik, Sevr b. Zeyd'den, o da Ebû'l-Gays'dan, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti. (Şöyle buyurmuşlar): ve yoksul için çalışan kimse, Allah yolunda cihad eden gibidir. — Zannederim şöyle de buyurdu— Ve fütur getirmeden nemez kılan, bırakmadan oruç tutan gibidir.»",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7469,
			"arabicnumber": "2983",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize İshak b. İsa rivâyet etti. ki): Bize Mâlik, Sevr b. Zeyd Ed-Dîlî'den rivâyet etti, ki): Ben Ebû'l-Gays'i, Ebû Hureyre'den naklen rivâyet ederken dinledim. ki): Resûlüllah (sallallahü aleyhi ve sellem). veya başkasının olsun yetime bakan kimse ile ben, cennette şunlar gibiyiz.» buyurdular. Ve Mâlik şehâdet parmağı ile orta parmağa işaret etmiştir. hadîsi Buhârî «Kitâbu’l-Edeb» ve «Kitâ\"bu'n-Nafakâi»'da; Tirmizî «Kitâbu'l-Bir»'de; Nesâî «Kitâbu'z-Zekât»'da; İbn Mâce «Kitâbu't-Ticârat»'da muhtelif râvilerden tahric etmişlerdir. kocasız kadın demektir. Evvelce evlenmiş veya evlenmemiş olması müsavidir. Bazıları kocasından ayrılan dul kadın mânâsına geldiğini söylemişlerdir. İbnû Kuteybe bu kelimenin İrmalden alındığmı söyler. İrmal, kocası olmadığı için fakir düşmek, yiyeceği bitmek mânâsına gelir. Tekeffül eden, yiyecek giyecek ve terbiyesine bakan dernektir. Yetime bakan kimse ister kendi malından, ister şer'î bir vilâyet dolayı-siyl yetimin malından harcasın hadîs-i şerifte va'dedilen fazilete nail olacaktır. yetiminden murad; yetimin dedesi, annesi, ninesi, kardeşi, kız kardeşi, halası, teyzesi, amcası ve dayısı gibi yakınlarıdır. Başkasının yetimi ile akraba olmayanlar kastedilmiştir",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7470,
			"arabicnumber": "533.03",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7471,
			"arabicnumber": "533.04",
			"text": "(Bize Züheyr b. Harb ile Muhammed b. Müsennâ ikisi birden Dahhâk'den rivâyet ettiler, İbn Müsennâ dedi ki: Bize Dahhâk b. Mahled rivâyet etti, ki): Bize Abdu'l-Hamîd b. Ca'fer haber verdi. ki): Bana babam, Mahmud b. Lebid'den rivâyet etti ki, Osman b. Affan mescidi bina etmek istemiş de, halk bunu hoş görmemiş, onu olduğu gibi bırakmasını istemişler. Bunun üzerine Osman: Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: kîm Allah için bir mescid bina ederse, Allah ona cennette bu mescidin mislini bina eder.» buyururken işittim, demiş",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7472,
			"arabicnumber": "533.05",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7473,
			"arabicnumber": "2984.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Züheyr b. Harb rivâyet ettiler. Lâfız Ebû Bekr'indir. (Dediler ki): Bize Yezid b. Harun rivâyet etti. ki): Bize. Abdü'l-Aziz b. Ebî Seleme, Vehb b. Keysan'dan, o da Ubeyd b. Ümeyr El-Leysi'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen rivâyet etti. Şöyle buyurmuşlar: adam sahra bir yerde iken bulut içinde: Filânın bahçesini sula! diye bir ses işitmiş. Derken o bulut giderek suyunu bir taşlığa boşaltmış. Bir de ne görsün, o sel yollarından biri bu suyun hepsini almış. Adam suyu takib etmiş. Bakmış ki, bir adam kalkmış, bahçesinde suyu bel küreğiyle çeviriyor. Ona: Ey Allah'ın kulu, senin adın nedir? diye sormuş. O da: Filândır, diyerek bulut içinden işittiği ismi söylemiş. O da buna: Ey Allah’ın kulu, benim adımı niçin soruyorsun? demiş. Beriki: Ben şu suyu indiren bulutta bir ses işittim: Filânın bahçesini sula! diye senin İsmini söylüyordu. Bu bahçe hususunda ne yapıyorsun? demiş. Bahça sahibi: Madem ki, böyle diyorsun (söyleyeyim). Ben bu bahçeden çıkana bakar da onun üçîe birini tasadduk eder, üçte birini çoluk çocuğumla kendim yerim, üçte birini de bahçeye iade ederim, demiş.»",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7474,
			"arabicnumber": "2984.02",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7475,
			"arabicnumber": "2985",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize İsmail b. İbrahim rivâyet etti. ki): Bize Kavh b. Kaâsım, Alâ' b. Abdirrahman b. Ya'kub'dan, o da babasından, o da Ebû Hüreyre'den naklen haber verdi. ki): Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdular: Tebâreke ve Teâlâ: Ben ortakların şirkten en gânisiyîm. Her kim bir ame! işler, onda benimle birlikte başkasını ortak eylerse, onu şirkiyle başbaşa bırakırım, buyurdu.»",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7476,
			"arabicnumber": "2986",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7477,
			"arabicnumber": "2987.01",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7478,
			"arabicnumber": "2987.02",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7479,
			"arabicnumber": "2987.03",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7480,
			"arabicnumber": "2987.04",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7481,
			"arabicnumber": "2988.01",
			"text": "(Bize Kuteybe b. Saîd rivâyet etti. ki): Bize Bekr (yani; İbn Mudar) İbn Hâddan, o da Muhammed b. İbrahim'den, o da îsa b. Talha'dan, o da Ebû Hüreyre'den naklen rivâyet etti ki: Resûlüllah (sallallahü aleyhi ve sellem)'i şöyle buyururken işitmiş: kul bir söz söyler, onun sebebiyle cehenneme, doğuyla batı arasından daha uzağa iner.»",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7482,
			"arabicnumber": "2988.02",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7483,
			"arabicnumber": "2989.01",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7484,
			"arabicnumber": "2989.02",
			"text": "Bana Züheyr b. Harb ile Muhammed b. Hatim ve Abd b. Humeyd rivâyet ettiler. (Abd bana rivâyet etti, ötekiler bize rivâyet etti tâbirlerini kullandılar. Dediler ki): Bize Ya'kub b. İbrahim rivâyet etti. ki): Salim şunu söyledi. Ben Ebû Hüreyre'yi şöyle derken işittim. Ben Resûlüllah (sallallahü aleyhi ve sellem)'i: hepsi affedilmiştir. Yalnız açıktan açığa günah işleyenler müstesna! Açık günahlardan biri de kulun geceleyin bir amel işlemesi, sonra Allah onu örtbas ettiği halde sabahlamasıdır. Fakat kul: Ey filân! Ben dün şöyle şöyle yaptım, der. Halbuki kendisi Allah onu örtbas ettiği halde gecelemişti. İşte Rabbİ örtbas etliği halde geceler sabahladığı vakit Allah'ın Örtbas ettiğini meydana çıkarır.» buyururken işittim. ichâr yerine cihar demiştir. hadîsi Buhârî «Kİtâ'bu'l-Edeb»'de tahric etmiştir. hadisdeki ichâr kelimesinin yanlış olduğunu iddia etmiş, «Doğrusu hicârdır...» demişlerse de Nevevî bunu kabul etmemiş. Her iki kelimenin doğru olduğunu ve ikisinin de kötü söz, ağza alınmayacak çirkin lâkırdı mânâsına geldiğini söylemiştir. İşlediği günahları bir marifetmiş gibi başkalarına anlatan kimsedir. Zamanımızda maalesef bu da moda olmuştur. Birçok edebsiz-Uklerin vasıtalarda, toplantı yerlerinde zerre kadar hicab duymadan yaptıkları zina, içki vesâir rezalet âlemlerini yüksek sesle anlattıkları her gün tesadüf edilen olaylardandır. İnşaallah hadîsdeki istisnayı yani; bu ümmetin içerisinden yalnız kendilerinin affedilmeyeceklerini duyarlar da — imanlarından eser kaldıysa— yaptıklarına pişman olup, tevbe ederler",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7485,
			"arabicnumber": "2990",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7486,
			"arabicnumber": "2991.01",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7487,
			"arabicnumber": "2991.02",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7488,
			"arabicnumber": "2992",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7489,
			"arabicnumber": "2993",
			"text": "(Bize İshak b. İbrahim de rivâyet etti. Lâfız onundur. ki): Bize Ebû'n-Nadr Hâşim b. Kaâsım rivâyet etti. ki): Bize İkrime b. Ammâr rivâyet etti. ki): Bana Iyâs b. Seleme b. Ekva' rivâyet etti, ona da babası rivâyet etmiş ki, kendisi Peygamber (sallallahü aleyhi ve sellem)'den dinlemiş. Bir adam onun yanında aksırmış da, ona yerhamü-kellah demiş. Sonra bir daha aksırmış, bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): adam zükkamlıdır.» buyurmuşlar. hadîsi Buhârî «Kuâbu'l-Edeb»'de tahric etmiştir. «Yerhamükellah» demektir. Kelimenin aslı düşmanların şema-tasını gidermektir. Ve hayr duası mânâsında kullanılır. Teşmit yapan kimse karşındakine düşmanlarının şamatasından kurtulması için dua etmiş gibidir. Yahut aksıran kimse Allah'a, hamdederse bizzat şeytanın şamatasını defettiği için bu isim verilmiştir. Teşmitin hükümlerini Kitâbu's-Selâm'da görmüştük. Onun meşru olduğu hususunda İcma'ı ümmet vardır. Zâhirîlerle Mâlikîler'den İbn Meryem'e göre her işitene teşmit vâcibdir. Kâdî Iy âz, İmâm Mâlik'in meşhur olan mezhebine göre, teşmit farzdır, demiştir. Diğer ulemaya göre, teşmit vâcib değil, sünnet ve menduptur. Aksırdıktan sonra Elhamdülillah demeyen kimseye teşmit yapılmaz. ikinci rivâyetindeki Fadl b. Abbâs’ın kızından murad;Ümmü Gülsüm'dür. Vaktiyle Hazret-i Hasan'la evli idi. Ondan ayrıldıktan sonra Hazret-i Ebû Mûsa’l - Eş'arî ile evlendi. O vefat edince İmran b. Talha’ya vardı. Bilâhare ondan da boşandı ve Küfe'de vefat etti. üçüncü rivâyeti nezle gibi bir hastalıktan dolayı aksıran kimseye yerhamükeilah denilmeyeceğine işarettir",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7490,
			"arabicnumber": "2994",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7491,
			"arabicnumber": "2995.01",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7492,
			"arabicnumber": "2995.02",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7493,
			"arabicnumber": "2995.03",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7494,
			"arabicnumber": "2995.04",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7495,
			"arabicnumber": "2996",
			"text": "(Bize Muhammed b. Râfi' ile Abd b. Humeyd rivâyet ettiler. Abd Ahberanâ dedi, İbn Râü' ise Haddesenâ tâbirini kullandı. ki): Bize Abdûrrezzâk rivâyet etti. ki): Bize Ma'mer Zührî'den, o da Urve'den, o da Âişe’den naklen haber verdi. (Şöyle dedi): Resûlüllah (sallallahü aleyhi ve sellem): nurdan yaratıldı. Cinler dumanlı alevden, ateşden yaratıldılar. Âdem ise size anlatılandan yaratıldı.» buyurdular. Ateşin siyahiyle karışmış alev demektir. Müslim sarihlerinden Übbî bunu dumanla karışık alev diye tarif etmiştir. Meleklerle cinlerin birbirlerinden farkları tâ hilkatlerinden başlar. Görülüyor ki, biri nurdan, diğeri dumanlı alevden yaratılmıştır. Bunlar insana-görünmemek hususunda birleşirlerse de, meleklerin masum cinlerin mükellef olması meleklerde yiyip içmek, evlenmek ve doğup ölmek gibi şeyler olmadığı halde, cinlerde bunların bulunması, cinlerin yerde yaşamaları gibi, birçok hususatta aralarında büyük farklar vardır. Resûlüllah (sallallahü aleyhi ve sellem): de size anlatılan şeyden yaratılmıştır.» buyurmakla, onun topraktan halkedildiğine işaret etmiştir",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7496,
			"arabicnumber": "2997.01",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7497,
			"arabicnumber": "2997.02",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7500,
			"arabicnumber": "2999",
			"text": "Bize Heddâb b. Hâlid El-Ezdî ile Şeyban b. Ferrûh hep birden Süleyman b. Muğîra'dan rivâyet ettiler. Lâfız Seyhan'ındır. (De di ki): Bize Süleyman rivâyet etti. ki): Bize Sabit, Abdurrahmaı b. Ebî Leylâ'dan, o da Suhayb'den naklen rivâyet etti. (Şöyle dedi) (sallallahü aleyhi ve sellem): işine şaşarım. Gerçekten onun bütün işleri hayırdır. bu mü' ininden başka hiç bir kimsede yoktur. Kendisine varlık isabet ederse şüt reyler, bu onun İçin hayr olur. Darlık isabet ederse sabreyler, bu da onu için hayr olur.» buyurdular. şerîf kâmil bir mü'minin nasıl hareket etmesi lâzım geldiği işaret buyurmaktadır. Mü'min zenginlerse şükredecektir. Bunun mânâl zekâtını vermek, muhtaçları gözetmek vesairedir. Dara düştüğü zaman da sabredecektir. Zira sabrın sonu mutlaka selâmettir. Muvakkaten sıkıntı duçar olan mü'min bir imtihan geçiriyor demektir. Bu imtihanda muvaffak olmanın sırrı sabırdır. Böylece mü'minin her işi kendisi için hayr o muş olur",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7501,
			"arabicnumber": "3000.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Yezid b. Zürey', Hâlid El-Hazzâ’dan, o da Abdurrahman b. Eb; Bekra'dan, o da babasından naklen rivâyet etti. (Şöyle dedi),: Nebiyyullah (sallallahü aleyhi ve sellem)’in huzurunda bir adam birini medhetti. Bunun üzerine tekrar tekrar: sana! Arkadaşının boynunu kestîn! Arkadaşının boynunu kestin!» buyurdu (ve şöyle devam etti): behemehal arkadaşmı methedecekse, bari filân; zannediyorum; Allah ona kâfidir; ben Allah'a karşı kimseyi tezkiye etmem —onu biliyorsa— zannederim şöyle şöyledir gibi sözler söylesin!»",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7502,
			"arabicnumber": "3000.02",
			"text": "Bana Muhammed b. Amr b. Abbad b. Cebele b. Ebî Kayvad da rivâyet etti. (Dodi ki): Bize Muhammed b. Ca'fer rivâyet etti, H. Bana Ebû Bekr b. NâH' dahi rivâyet etti. ki): Bize Gundevi haber verdi. ki): Bize Şu'be, Hâüd El-Hazza'cian, o da Abdurrahman b. Ebî Bekra'dan, o da babasından, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti ki, huzurunda bir adamın zikri geçmiş de biri: Ya Resûlallah! Şu ve şu husûsatta Resûlüllah (sallallahü aleyhi ve sellem)’den sonra ondan faziletti adam yoktur, demiş. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem): sana! Arkadaşının boğazını kestin!» buyurmuş. Bunu tekrar tekrar söylemiş. Sonra Resûlüllah (sallallahü aleyhi ve sellem): din kardeşini behemehal medhedecekse ve şayet öyle olduğu görülüyorsa, bâri filânı zannediyorum; ben Allah'a karşı kimseyi tezkiye etmem, desin!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7503,
			"arabicnumber": "3000.03",
			"text": "Bana bu hadîsi Amru'n-Nâkıd da rivâyet etti. (Dedi ki): Bize Hâşim b. Kaâsım rivâyet etti. H. bu hadisi Ebû Bekr b. Ebî Şeybe de rivâyet etti. ki): Bize Şebâbe b. Sevvâr rivâyet etti. Her iki râvi Şu'be'den bu isnadla Yezid b. Zürey'în hadîsi gibi rivâyet etmişlerdir.. Ama onların hadîsinde: «Bir adam: Resûlüllah (sallallahü aleyhi ve sellem)’den sonra ondan fazîletli kimse yoktur, dedi.» cümlesi yoktur",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 7504,
			"arabicnumber": "3001",
			"text": "(Bana Ebû Ca'fer Muhammed b. Sabbah rivâyet etti. ki): Bize İsmail b. Zekeriyya, Büreyd b. Abdillah b. Ebî Bürde'den; o da Ebu Musâ'dan naklen rivâyet etti. (Şöyle demiş): Peygamber (sallallahü aleyhi ve sellem) bir adamın birini senâ ettiğini ve onu medihte ileri gittiğini işitti de: helâk ettiniz yahut bu adamın belini kestiniz.» buyurdular",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7505,
			"arabicnumber": "3002.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Muhammed b. Müsennâ hep birden İbnû Mehdî'den rivâyet ettiler. Lâfız İbn Müsennâ'nındır. (Dediler ki): Bize Abdurrahman, Süfyan'dan, o da Habib'den, o da Mücahid'den, o da Ebû Ma'mer'den naklen rivâyet etti. (Şöyle dedi): Bir adam kumandanlardan birini medhü sena etmeye kalktı. Bunun üzerine Mikdâd onun üzerine toprak serpmeye başladı ve: Bize Resûlüllah (sallallahü aleyhi ve sellem) meddahların yüzlerine toprak serpmemizi emir buyurdu, dedi",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7506,
			"arabicnumber": "3002.02",
			"text": "Bize Muhammed b. Müsennâ ile Muhammed b. Beşşar da rivâyet ettiler. Lâfız İbn Müsennâ'nındır. (Dediler ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be, Mansur'dan, o da İbrahim'den, o da Hemmam b. Hâris'den naklen rivâyet etti ki: Bir adam Osman'ı medhetmeye başlamış. Bunun üzerine Mikdâd davranarak iki dizinin üzerine oturmuş, kendisi iri yan bir zatmış. Ve adamın yüzüne çakıl taşı serpmeye başlamış. Osman ona: Sana ne oluyor? demiş. Mikdâd da şunu söylemiş: Şüphesiz ki, Resûlüllah (sallallahü aleyhi ve sellem); «Meddahları gördüğünüz vakit, yüzlerine toprak serpin!» buyurdular",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7507,
			"arabicnumber": "3002.03",
			"text": "Bize bu hadîsi Muhammed b. Müsennâ ile İbn Beşşâr da rivâyet ettiler. (Dediler ki): Bize Abdurrahman, Süfyân'dan, o da Mansur'dan naklen rivâyet etti. H. Osman b. Ebî Şeybe dahi rivâyet etti. ki): Bize Eşcaî Ubeydullah b. Uheydir rahman, Süfyan-ı Sevrî'den, o da A'meş ile. Mansur'dan, onlar da İbrahim'den, o da Hemmâm'dan, o da Mikdâd'dan, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini rivâyet etti. rivâyetleri Buhârî «Kitâbu’l-Edeb» ile «Kitâbu'ş-Şehâdât»'-da; Ebû Dâvud ile İbn Mâce «Kitâbu'l-Edeb»'de tahric etmişlerdir. boğazını kesti.» Ve: «Adamın sırtını kestiniz.» tâbirleri birer istiare olup, adamı helâk ettiniz mânâsında kullanılmışlardır. Görülüyor ki, Resûlüllah (sallallahü aleyhi ve sellem) bir adam mutlaka medhedilecekse, onun hakkında kat'î bir şey söylemeyip, zannederim şöyledir ve ben Allah'a karşı kimseyi tezkiye edemem gibi sözler söylemesini emir buyurmuştur. Halbuki gerek Sahihi Buhârî'de, gerekse Müslim'in Sahîh'inde yüze karşı medhin caiz olduğunu bildiren birçok sahih hadîsler vârid olmuştur. Ulemâ bunların aralarını bulmuş, yüze karşı medhin yasak edilmesini, pek ziyâde ileri gidildiği veya memdûhu kendini beğenmek gibi bir fitneye düşüreceğinden korkulduğu surete hamlet-mişlerdir. Aklı başında, takvası yerinde olup, şımaracağından korkulmayan kimse ise, fazla ileri gitmemek şartıyle yüzüne karşı medhedilebilir. Ulemâdan bazıları Hazret-i Mikdâd rivâyetini zahirî mânâsı üzere kabul etmişlerdir. Nitekim Hazret-i Mikdâd'a muvâfakatla meddahın yüzüne toprak saçanlar olmuştur. Diğer bir takım ulemaya göre, bundan murad: Meddahlara bir şey vermeyin, onları haybete uğratın, demektir",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7508,
			"arabicnumber": "3003",
			"text": "(Bize Nasr b. Alî El-Cehdamî rivâyet etti. ki): Bana babam rivâyet etti. ki): Bize Sabr (yani; İbn Cüveyriye) Nâfi’den rivâyet etti. Ona da Abdullah b. Ömer rivâyet etmiş ki: Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuşlar: rü'yada bir misvakla misvaklanıyorum gördüm. Derken beni biri diğerinden daha büyük iki adam çektiler. Ben misvakı küçük olanına verdim. Bunun üzerine bana: Büyült, denildi. Ben de onu büyük olana verdim.» hadîsi Buhârî «Kitabul-Vudû»'da tah'ric etmiştir. beyânına göre Resûlüllah (sallallahü aleyhi ve sellem)'e «Büyült!» diyen zât Cebrail (aleyhisselâm)'dır. Büyült sözünden murad, yaşça büyük olana ver, demektir",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7509,
			"arabicnumber": "2493.02",
			"text": "(Bize Harun b. Ma'ruf rivâyet etti. ki): Bize bu hadîsi Süfyan b. Uyeyne, Hişâm'dan, o da babasından naklen rivâyet etti. ki): Ebû Hüreyre hadîs rivâyet ediyor ve: ey hücre sahibesi! Dinle ey hücre sahibesi! diyordu. Âişe de namaz kılıyordu. Namazını bitirince Urve'ye: Bunu ve demin söylediğin; işitmiyor musun? Peygamber (sallallahü aleyhi ve sellem) ancak ve ancak bir kimse saysa, bitireceği kadar hadîs söylerdi, dedi.»",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7510,
			"arabicnumber": "3004",
			"text": "(Bize Heddâb b. Hâlid El-Ezdî rivâyet etti. ki): Bize Hemmam, Zeyd b. Eslem'den, o da Ata' b. Yesâr'dan, o da Ebû Saîd-i Hudrî'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem) bir şey yazmayın. Her kim Kur'ân'dan başka benden bir şey yazarsa, onu hemen mahvetsin. Benden hadîs rivâyet edin, zararı yok. Ama her kîm benim üzerimden —Hemmam zannederim şöyle buyurdu, demiş — kasden yalan söylerse, cehennemdeki yerine hazır olsun.» buyurdular. Ebû Hüreyre rivâyetini Buhârî «Kitâbu'l-Menakıb»'de tahric etmiştir. Ebû Hüreyre Hücre sahibesi sözüyle Âişe (radıyallahü anha)'yı kasdetmiş; rivâyet ettiği hadîsi işitsin de, ikramda bulunsun diye seslenmiştir. Hazret-i Âişe onun hadîs rivâyetine itiraz etmemiş, yalnız bir meclisde çok hadîs rivâyetini doğru bulmamıştır. Zira çok rivâyet sebebiyle yanılacağından korkmuştur. yazma meselesine gelince: Kâdî Iyâz’ın beyânına göre bu babda sahabe ile tabiin arasında bir hayli ihtilâflar vâki olmuştur. Birçokları hadis yazmayı kerih görmüş, ekseriyet ise yazılmasına cevaz vermişlerdir. Sonraları bütün müslümanlar hadîs yazmanın caiz olduğuna ittifak etmiş ve hilaf ortadan kalkmıştır. Ancak hadîs yazmayı nehyeden bu rivâyetten murad; ne olduğu ihtilaflıdır. Bâzılarına göre bu hadîs râvinin ezberleyeceğine itimad edilen ve yazarsa yazıya dayanarak ezberlememesinden korkulan hadîsler hakkındadır. Yazmayı mubah kılan hadîsler ise, belleyişine itimad edilmeyen kimselere hamlolunur. Hazret-i Ali’nin sahifesi Amr b. Hazm’ın kitabı Hazret-i Ebû Bekr'in Enes'e gönderdiği zekât mektubu vb. bu kabildendir. bazıları nehy hadîslerinin bu hadîslerle neshedildiklerini söylemişlerdir. Onlara göre hadîsin yazılması Kur'ân'la karışır endişesindendi. Bu endişe ortadan kalkınca hadîsin yazılmasına izin verilmiştir. Bazıları: «Hadîs yazılmasının nehyinden murad; hadîsle âyeti bir sahifeye yazmaktır. İkisi bir sahifede olunca, okuyan hangisinin âyet, hangisinin hadîs olduğunu karıştırabilir.» demişlerdir. (sallallahü aleyhi ve sellem)'in üzerinden yalan uydurmanın hükmünü kitabımızın başında görmüştük",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7511,
			"arabicnumber": "3005",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7520,
			"arabicnumber": "3014",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 7521,
			"arabicnumber": "2009.03",
			"text": "(Bana Seleme b. Şebîb rivâyet etti. ki): Bize Hasen b. A'yen rivâyet etti. ki): Bize Züheyr rivâyet etti, ki): Bize Ebû İshak rivâyet etti. ki): Bera’ b. Azib'i şunu söylerken işittim. Ebû Bekr'i Siddîk babama evinde iken gelerek, ondan bir semer satın aldı. Ve Azib'e: Oğlunu benimle gönder, bunu benimle birlikte evime götürsün, dedi. Babam bana: Bunu götür, dedi. Ben de götürdüm. Babam parasını alarak onunla birlikte dışarı çıktı ve ona: Yâ Ebâ Bekr! Resûlüllah (sallallahü aleyhi ve sellem)'e birlikte yürüdüğün gece ne yaptınız, bana anlat, dedi. Ebû Bekr şunu söyledi: Pekiyi (anlatayım)! Bütün gece yürüdük. Tâ ki, günün yarısı oldu. Nihayet yol boşaldı, ondan hiç bir kimse geçmez oldu. Karşımıza gölgesi olan uzun bir kaya dikildi. Üzerine henüz güneş gelmemişti. Onun yanına İndik. Ben kayaya vararak gölgesinde Peygamber (sallallahü aleyhi ve sellem)’in uyuyacağı bir yeri elimle düzelttim. Sonra üzerine bir kürk serdim. Sonra!: Uyu ya Resûlallah! Ben senin için etrafına göz kulak olurum, dedim. O da uyudu. Derken etrafını gözetmek için dışarı çıktım. Bir de baktım, bir koyun çobanı koyunlarıyle kayaya doğru geliyor. Ondan bizim dilediğimizi diliyor. Çobanın karşısına çıkarak: Sen kimin çobanısın ey çocuk? diye sordum. Şehir ahâlisinden bir adamın! cevâbını verdi. Koyunlarında süt var mı? dedim. Evet! cevâbını verdi. Benim için süt sağar mısın? diye sordum. Evet! dedi. Ve bir koyun tuttu. Kendisine: Memeyi kıldan, topraktan ve kirden silk! dedim. (Ebû İshak ki: Berayı ellerini birbirine vurarak silkerken gördüm.) Çoban bana yanındaki bir ağaç çanağa bir miktar süt sağdı. Benim yanımda da ufak bir tulum vardı. Onunla Peygamber (sallallahü aleyhi ve sellem)’e içsin ve abdest alsın diye su taşıyordum. Müteakiben Peygamber (sallallahü aleyhi ve sellem)’e geldim ama onu uykusundan uyandırmaya kıyamadım. Müteakiben uyandığına rastladım. Ve sütün üzerine su döktüm. Hattâ alt kısmı soğudu ve: Ya Resûlallah! Bu sütten iç! dedim. O içti, benim gönlüm de razı oldu. Sonra: için vakit geldi mi?» diye sordu. Hay hay (geldi) dedim. Ve güneş devrildikten sonra yola revan olduk. Bii katı bir toprak üzerinde giderken Sürâka b. Mâlik peşimize takıldı. Bunun üzerine ben: Ya Resûlallah! Erişildik! dedim. Şüphesiz ki, Allah bizimle beraberdir!» buyurdu. Ve Resûlüllah (sallallahü aleyhi ve sellem) ona beddua etti. Hemen atının ayakları karnına kadar yere battı. Ve zannederim şöyle dedi: Ben anladım ki, siz bana beddua ettiniz. Şimdi benim lehime dua ediniz. Allah benim dileğimi sizden geri çevirmek için duanızı kabul etmiştir, dedi. Resûlüllah (sallallahü aleyhi ve sellem) de dua etti. Sûrâka kurtuldu. Hemen geri döndü. Rastladığı herkese: Sizin nâmınıza burada olanlara kâfi geldim, diyor; rastladığı herkesi geri çeviriyordu. (Hasılı) Bize verdiği sözünde durdu",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 7522,
			"arabicnumber": "2009.04",
			"text": "(Bana bu hadîsi Züheyr b. Harb da rivâyet etti. ki): Bize Osman b. Ömer rivâyet etti, H. bunu İshak b. İbrahim dahi rivâyet etti. ki): Bize Nadr b. Şümeyl haber verdi. Her iki râvi İsrail'den, o da Ebû İshak'dan, o da Bera'dan naklen rivâyet etmişlerdir. Bera' Şöyle dedi: Bekr babamdan on üç dirheme bir semer satın aldı... Ve râvi hadîsi Züheyr'in Ebû İshak'dan rivâyet ettiği hadîs mânâsında nakletmiştir. O, Osman b. Ömer'den rivâyet ettiği hadîsinde şöyle deditir: yaklaşınca Resûlüllah (sallallahü aleyhi ve sellem) ona beddua etti. Ve atı karnına kadar yere battı. Sürâka ondan atladı ve: Yâ Muhammed! Anladım ki, bu senin işindir. İmdi Allah'a dua et de, bulunduğum halden beni kurtarsın. Senin İçin boynuma borç olsun, arkamdan gelenlere hâlinizi gizleyeceğim, işte ok torbam. Onlardan bir ok al. Sen filân ve filân yerde benim develerimin ve çıraklarımın yanına uğrayacaksın. Onlardan hacetini de al, dedi. Resûlüllah (sallallahü aleyhi ve sellem): senin develerine ihtiyacım yoktur!» buyurdular. Müteakiben Medine'ye geceleyin geldik. Medîneliler Resûlüllah (sallallahü aleyhi ve sellem)’in kime misafir olacağı husufunda münakaşa ettiler. Bunun üzerine: Benî Neccâr'a, Abdu'l-Muttalib'in dayılarına müsâfir olur, bununla onlara ikramda bulunurum.» buyurdular. Derken erkekler ve kadınlar evlerin üstlerine çıktılar. Çocuklar ve hizmetçiler yollara dağıldılar. Yâ Muhammed! Ya Resûlallah! Yâ Muhammed! Ya Resûlallah! diye sesleniyorlardı.» hadîsi Buhârî «Kitâbul-Menâkıb»'de tahric etmiştir. Medine'den murad; Mekke şehridir. Gerçi Kâdî Iyâz burada Medine'nin zikredilmesi bir vehm esendir demişse de, Nevevî bunu doğru bulmamış, doğrusu Mekke'dir, demiştir. Çünkü o zaman Medine'nin ismi henüz Yesrib idi. Ona Medine ismi sonradan verilmiştir. Burada şöyle bir sual hatıra gelebilir. Resûlüllah (sallallahü aleyhi ve sellem) ile Ebû Bekr (radıyallahü anh) çobanın sütünü nasıl içmişlerdir. Halbuki çoban koyunların sahibi değildir. suâle birkaç vecihle cevap verilmiştir:",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 96
			}
		}
	]
}