{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"56": "The Book of Commentary on the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7523,
			"arabicnumber": "3015",
			"text": "Bize Muhammed b. Râfi' rivayet etti. (Dediki): Bize Abdürrezzak rivayet etti. (Dediki): Bize Ma'mer, Hemmam b. Münebbih'den rivayet etti. Hemmam: Bize Ebû Hureyre'nin, Rcsûlullah (Sallallahu Aleyhi ve Sellem)'den rivayet ettikleri şunlardır... diyerek bir takım hadîsler zikretmiştir. Bunlardan biri de şudur: Resûlullah (Sallallahu Aleyhi ve Sellem) buyurdular ki: «Beni İsrail'e: Kapıdan secde ederek girin ve Hıtta ((dileğimiz) indirimdir,) deyin ki, günahlarınız affolunsun, denildi. Ama onlar değiştirdiler de, kapıdan kıçları üzere sürünerek girdiler. Ve Habbe (kılın içinde bir tane) dediler.»",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7524,
			"arabicnumber": "3016",
			"text": "Bana Amr b. Muhammed b. Bükeyr En-Nâkıd ile Hasen b, Alî Eİ-Hulvânî ve Abd b. Humeyd rivayet ettiler. (Abd: Haddesenî; ötekiler: Haddesenâ tâbirlerini kullandılar. Dedilerki): Bize Ya'kûb (yâni; İbrahim b. Sa'd) rivayet etti. (Dediki): Bize babam, Sâlih'den (bu zât İbni Keysan'dır), o da İbni Şihab'dan naklen rivayet etti. (Şöyle demiş) : Bana Enes b. Mâlik-haber verdi ki: Allah (Azze ve Celle) Resûlullah (Sallallahu Aleyhi ve Sellem)'e vahyi vefatından önce birbiri ardına indirmiştir. Nihayet vefat etmiş ama en ziyâde vahy Resûlullah (Sallallahu Aleyhi ve Sellem)'in vefat ettiği gün inmiştir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7525,
			"arabicnumber": "3017.01",
			"text": "Bana Ebû Hayseme Züheyr b. Harb ile Muhammed b. Müsennâ rivayet ettiler. Lâfız İbni Müsennâ'nındır. (Dedilerki): Bize Abdurrahman (bu zat İbni Mehdî'dir) rivayet etti. (Dediki): Bize Süfyan, Kays b. Müslim'den, o da Tarık b. Şihab'dan naklen rivayet etti ki: Yahudiler Ömer'e — Siz bir âyet okuyorsunuz ki, bu âyet biz'e indirilmiş olsa, o günü bayram yapardık, demişler. Ömer de : — Ben bu âyetin nerede indirildiğini, hangi gün indirildiğini ve o indirilirken Resûlullah (Sallallahu Aleyhi ve Sellem)'in nerede idiğini pekâlâ bilirim. Âyet Arafat'da indirilmiştir. Resûlullah (Sallallahu Aleyhi ve Sellem) de Arafat'da vakfe halinde idi, demiş. Süfyan: «Bugün size dininizi ikmâl, üzerinize olan ni'metimi itmam eyledim.» [Maide 3] âyetini kastederek: Cum'a günü müydü, değil miydi şekkediyorum, demiş",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7526,
			"arabicnumber": "3017.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Kureyb rivayet ettiler. Lâfız Ebû Bekr'indir. (Dediki): Bize Abdullah b. İdris babasından, o da Kays b. Müslim'den, o da Tarık b. Şihab'dan naklen rivayet etti. (Şöyle demiş): Yahudiler Ömer'e - Şu: «Bugün sîzin için dîninizi ikmâl ve size olan nimetimi itmam eyledim. Sizin için din olarak İslâm'a razı oldum.» âyeti biz yahudilcr cemaatına inse, onun indirildiği günü bilsek, o günü mutlaka bayram yapardık, dediler, Ömer de: — Ben onun indirildiği günü, saati ve indirildiği zaman Resûlullah (Sallallahu Aleyhi ve Sellem)'in nerede olduğunu muhakkak bilirim. O Müzdelife gecesinde biz Resûlullah (Sallallahu Aleyhi ve Sellem)'e birlikte Arafat'da iken inmiştir, dedi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7527,
			"arabicnumber": "3017.03",
			"text": "Bana Abd b. Humeyd de rivayet etti. (Dediki): Bize Ca'fer b. Avn haber verdi. (Dediki): Bize Ebu Umeys, Kays b. Müslim'den, da Târik b. Şihab'dan naklen haber verdi. (Şöyle demiş): Yahudilerden bir adam Ömer'e gelerek: — Yâ Emire'I-Mü'minin! Kitabınızda okuduğunuz bir âyet var. Bu âyet biz yahudiler cemaatına inmiş olsa, o günü bayram yapardık, dedi. Ömer : — Hangi âyet? diye sordu. Yahudi : «Bugün sizin için dîninizi ikmâl ve size olan nimetimi itmam eyledim. Sizin için din olarak islam'a razı oldum.» âyeti dedi. Bunun üzerine Ömer: — Ben o âyetin indiği günü, indiği yeri pek alâ bilirim. O Resûlullah (Sallallahu Aleyhi ve Sellem)'e Arafat'ta cum'a günü indi, dedi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7528,
			"arabicnumber": "3018.01",
			"text": "Bana Ebû't-Tâhir Ahmed b. Amr b. Şerh ile Harmele b Yahya Et-Tücîbl rivayet ettiler. (Ebû't-Tâhir: Haddesenâ; Harmele ise Ahberanâ tâbirlerini kullandılar. Harmele dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus, İbni Şihab’dan naklen haber verdi (Demişki): Bana Urve b. Zübeyr haber verdi ki, kendisi Aişe'ye Allah Teâlâ'nın : «Eğer yetimler hakkında adalet gösteremiyeceğinizden korkarsanız, size helal olan kadınlardan ikişer, üçer ve dörder tanesini nikâh ediverin.» [Nisa 3] âyet-i kerîmesini sormuş. Âişe : — Ey kızkardeşim oğlu! Bu kadından murad; velisinin terbiyesinde bulunan yetimedir. Velisine malında ortak olur, onun da yetimenin mal ve güzelliği hoşuna gider ve velisi onunla mehrinde adalet güzctmeksizîn evlenmek ister. Ona başkasının verdiği kadar mehir vermeyi diler. Bu sebeple velilerin onları nikâh etmeleri yasak edildi. Meğerki, onlar hakkında adalet gösterip mehirlerinin âdet olan en yüksek derecesine ulaşmış olalar. Bir de velîlere bu yetim kızlardan başka helâl olan kadınlarla evlenmeleri emrolundu, demiş. Urve diyor ki:. Âişe şunu söyledi: Bilâhare halk bu âyetten sonra kadınlar hakkında Resûlullah (Sallallahu Aleyhi ve Sellem)'den fetva istediler. Bunun üzerine Allah (Âzze ve Celle): «Kadınlar hakkında senden fetva istiyorlar. De ki : Allah onlar hakkında ve Kitabda sîze okunan mehirlerini vermediğiniz halde, kendilerini nikâh etmek istediğiniz yetim kadınlar hakkında fetva verecektir.» [Nisa 127] âyetini indirdi. Âişe demiş ki: Allah Teâlâ'nın size kitabda okunan diye bahsettiği ilk âyettir. Ki, bu âyette Allah : «Eğer yetimler hakkında adâ!et gösterememekten korkarsanız, size helâl olan kadınlardan nikâh ediverin.» buyurmuştur. Âişe şöyle demiş: Allah Teâlâ'nın diğer Ayet-i Kerîme'de : «Onları nikâh etmek istersiniz...» buyurması, sizden birinizin terbiyesi altında bulunan yetim kızın malı ve güzelliği az olduğu zaman, ona rağbet göstermesidir. Böylece veliler bunlara rağbet göstermedikleri için, malına ve güzelliğine rağbet ettikleri yetim kadınları nikâh etmekten nehyolundular. Ancak adalet gösterirlerse o müstesna",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7529,
			"arabicnumber": "3018.02",
			"text": "{m-6} Bize Hasen El-Hulvânî ile Abd b. Humeyd de hep birden Ya'kub b. İbrahim b. Sa'd'dan rivayet ettiler, (Demişki): Bize babam Sâlih'den, o da İbni Şihab'dan naklen rivayet etti, (Demişki): Bana Urve haber verdi. Kendisi Âişe'ye Allah Teâlâ'nın : «£ğer yetimler hakkında adalet gösterememekten korkarsanız...» âyetini sormuş... Ve râvi hadîsi Yunus'un Zührî'den rivayet ettiği hadîs gibi nakletmiş, sonunda: «Yetim kızların malı ve güzelliği az olduğu vakit, onlara rağbet göstermedikleri için...» cümlesini ziyâde etmiştir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7530,
			"arabicnumber": "3018.03",
			"text": "Bize Ebû Bekr b. Ebi Şeybe ile Ebû Kureyb rivayet ettiler. (Dedilerki): Bize Ebû Usânıe rivayet etti. (Dediki): Bize Hişâm, babasından, o da Âişe'den: «Eğer yetimler hakkında adalet gösterememekten korkarsamz...» âyeti kerîmesi hakkında rivayet etti. Âişe şöyle demiş: Bu âyet öyle bir adam hakkında nazil oldu ki, onun yetim bir kızı vardır. Kendisi bu kızın velisi ve mirasçısıdır. Kızın malı vardır. Kızın hakkını koruyacak kimsesi de yoktur. Velisi malı için onu başkasına vermez. Bu suretle ona zarar getirir ve kendisine iyi bakmaz. Buna binâen : «Yetimler hakkında adalet gösterememekten korkarsamz, (başka) kadınlardan size elverişli olanları nikâh ediverin.» buyurdu. Size helâl kıldıklarını alın. Zarar verdiğin kadını bırak demek istiyor",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7531,
			"arabicnumber": "3018.04",
			"text": "Bize Ebû Bekr b. Ebi Şeybe rivayet etti. (Dediki): Bize Abde b. Süleyman, Hişam'dan, o da babasından, o da Âişe'den Teâlâ Hazretlerinin : «Ve kitabda size okunan mehirlerini vermediğiniz halde, kendileri nikâh etmek istediğiniz yetim kadınlar...» âyeti hakkında rivayette bulundu. Âişe şöyle demiş: Bu âyet yetime hakkında indirilmiştir. Yetimedir bir adamın yanında bulunur ve malında ona ortak olur. Adam ise onunla evIenmek istemez. Onu başkasına vererek, başkasını kendi malına ortak etmekten de çekinir. Hasılı onu evlenmekten men eder. Ne kendisi alır, ne başkasına verir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7532,
			"arabicnumber": "3018.05",
			"text": "Bize Ebü Kureyb rivayet etti. (Dediki): Bize Ebü Usame rivayet etti (Dediki): Bize Hişam, babasından, o da Aişe’den naklen Teâlâ Hazretlerinin: «Kadınlar hakkında senden fetva istiyorlar. Dekî: Onlar hakkında size ALLAH fetva verecektir, ilah...» âyeti hususunda haber verdi. Âişe şöyle demiş: Bu kadın bir adamın yanında bulunan yetimedir. İhtimal ki malında hatta hurmada ona ortak olmuştur. Adam yüz çevirir yâni; ona nikah etmek istemez, onu başka bir adama verecek, başkasını kendi malına da ortak etmek de istemez. Böylece kadının evlenmesine mâni olur",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7533,
			"arabicnumber": "3019.01",
			"text": "Bize Ebû Bekr b. Ebî Şeyhe rivayet etti. (Dediki): Bize Abde b. Süleyman, Hişam'dan, o da babasından, o da Âişe'den naklen Teâlâ Hazretlerinin : «Her kim fakır ise, meşru surette yesin.» [Nisa 6] Ayet-i kerîmesi hakkında rivayet etti, Âişe şöyle demiş: Bu âyet yetim'in malına nezârette bulunan, ona bakıp ıslâh eden velinin, muhtaç olduğu vakit bu maldan yiyebileceği hakkında nazil olmuştur",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7534,
			"arabicnumber": "3019.02",
			"text": "Bize bu hadîsi Ebû Kureyb de rivayet etti. (Dediki): Bize Ebû Usâme rivayet etti. (Dediki): Bize Hişam, babasından, o da Aişe'den naklen Teâlâ Hazretlerinin : «Her kim zengin ise, iffet göstersin. Fakir olan meşru surette yesin.» âyet-i kerîmesi hakkında rivayet etti. Âişe şöyle demiş: Bu âyet yetimin velisi hakkında indirilmiştir. Veli muhtaç olduğu vakit, yetimin malından malı mîktarınca meşru surette istifâde edebilir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7535,
			"arabicnumber": "3019.03",
			"text": "{m-11} Bize bu hadîsi Ebû Kureyb de rivayet etti. (Dediki): Bize İbni Numeyr rivayet etti. (Dediki): Bize Hişam bu isnadla rivayet etti",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7536,
			"arabicnumber": "3020",
			"text": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Abde b. Süleyman, Hişarn'daıı, o da babasından, o da Aişe'den naklen Allah (Azze ve Celle)'nin : «Size üst tarafınızdan ve alt tarafınızdan geldikleri ve gözler şaşırıp, kalbler boğazlara geldiği vakit...» [Ahzab 10] Ayet-i kerîmesi hakkında rivayet etti. Âişe: Bu Hendek günüydü, demiş",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7537,
			"arabicnumber": "3021.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Abde b. Süleyman rivayet etti. (Dediki): Bize Hişâm, babasından, o da Aişe'den naklen : «Eğer bir kadın, kocasının geçimsizliğinden yahut yüz çevirmesinden korkarsa...» [Nisa 128] Ayet-i kerîmesi hakkında rivayet etti. Âişe şöyle demiş-Bu âyet-i kerîme öyle bir kadın hakkında nazil olmuştur ki: Bir adamın nikâhında bulunur ve uzun zaman geçinir, adam onu boşamak ister. Kadm da: Beni boşama, tarafımdan her şey sana helâl olduğu halde beni nikâhında tut! der. İşte bu âyet bunun için inmiştir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7538,
			"arabicnumber": "3021.02",
			"text": "Bize Ebu Kureyb rivayet etti. (Dediki): Bize Ebü Usânıe rivayet etti. (Dediki): Bize Hişâm babasından, o da Aişe'den naklen Allah (Azze ve Celle)'nin : «Eğer bir kadın, kocasının geçimsizliğinden veya yüz çevirmesinden korkarsa...» âyet-i kerîmesi hakkında rivayetler etti. Âişe şöyle demiş: Bu âyet öyle bir kadın hakkında nazil olmuştur ki, bir adamın nikâhında bulunur. İhtimal adaın onunla çok geçinmek istemez. Kadının sohbeti ve çocukları olur da, kocasından ayrılmak istemez ve kocasına: Sana benim tarafımdan her şey helâldir, der",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7539,
			"arabicnumber": "3022.01",
			"text": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Ebû Muâviye, Hişam b. Urve'den, o da babasından naklen haber verdi. (Şöyle demiş): Bana Âişe: «Ey kızkardeşimin oğlu! Onlara Peygamber (Sallallahu Aleyhi ve Sellem)'in ashabına istiğfar etmeleri emrolundu. Onlarsa söğdüler.» dedi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7540,
			"arabicnumber": "3022.02",
			"text": "{m-15} Bize bu hadîsi Ebû Bekir b. Ebî Şeybe de rivayet etti. Bize Ebû Usâme rivayet etti. (Dediki): Bize Hişam bu isnadla bu hadîsin mislini rivayet etti",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7541,
			"arabicnumber": "3023.01",
			"text": "Bize Ubeydullah b. Muaz El-Anberi rivayet etti. (Dediki): Bize babam rivayet etti, (Dediki): Bize Şu'be, Muğirâ b. Nu'man'dan, o da Saîd b. Cübeyr'den naklen rivayet çiti. (Şöyle demiş): Kûfeliler şu âyet hakkında ihtilâf ettiler : «Her kim bir mü'mîni kasden öldürürse, onun cezası cehennemdir.» [Nisa 93] Bunun üzerine ben İbni Abbas'a giderek kendisine onu sordum da: Bu âyet en son olarak indirildi. Sonra onu hiç bir şey neshetmedİ, dedi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7542,
			"arabicnumber": "3023.02",
			"text": "Bize Muhammed b. Müsennâ ile İbni Beşşâr da rivayet ettiler. (Dedilerki): Bize Muhammed b. Cafer rivayet etti. H. Bize İshak b. İbrahim dahî rivayet etti. (Dediki): Bize Nadr haber verdi. Her iki râvi demişler ki: Bize Şu'be bu isnadla rivayet etti. İbni Ca'fer'in hadîsinde: «Bu âyet indirilenlerin en sonunda indi.» Nadr'ın hadîsinde ise : «O indirilenlerin en sonundadır.» cümleleri vardır",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7543,
			"arabicnumber": "3023.03",
			"text": "Bize Muhammed b. Müsennâ ile Muhammed b. Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'ier rivayet etti, (Dediki): Bize Şu'be, Mansur'dan, o da Saîd b. Cübeyr'den naklen rivayet etti. (Şöyle demiş): Bana Abdurrahman b. Ebzâ, İbni Abbas'a şu iki âyeti sormamı emretti: «Her kim bir mu'mini kasden öldürürse, onun cezası içinde ebedî kalmak şartiyle cehennemdir.» Bu âyeti kendisine sordum da : — Onu hiç bir şey neshetmedİ, dedi. Bir de şu âyeti sordum : «O kimseler ki, Allah'la birlikte başka bîr ilâh'a dua etmezler ve Allah'ın haram kıldığı nefsi haksız yere öldürmezler.» İbni Abbas: — Bu âyet müşrikler hakkında indî, dedi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7544,
			"arabicnumber": "3023.04",
			"text": "Bana Harun b. Abdullah rivayet etti. (Dediki): Bize Ebû'n-Nadr Hâşim b. Kaâsım El-Leysî rivayet etti. (Dediki): Bize Ebû Muâviye (yâni; Şeyban) Mansûr b. Mu'temir'den, o da Saîd b. Cübeyr'den, o da İbni Abbâs'dan naklen rivayet etti. (ŞÖyîe demiş) : Şu âyet: «O kimseler ki, Allah'la birlikte başka bir ilah'a dua etmezler...» [Furkan 68] «Mâhânen» kavline kadar Mekke'de inmiştir. Bunun üzerine müşrikler: Bize İslâm'ın ne faydası olur. Biz Allah'a şirk koşmuş, Allah'ın haram kıldığı nefsi öldürmüş ve bütün kötülükleri yapmışızdır, dediler. Allah (Âzze ve Ceîle) de : «Ancak tevbe ve iman edip, sâiih amel işleyenler müstesna!» [Furkan 70] âyetini sonuna kadar indirdi. Ama İslâm'a girip, onun hükümlerini öğrendikten sonra öldürürse, onun için tevbe yoktur",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7545,
			"arabicnumber": "3023.05",
			"text": "Bana Abdullah b. Hâşim ile Abdurrahman b. Bişr El-Abdî rivayet ettiler. (Dedilerki): Bize Yahya (bu zat İbni Saîd El-Kattan'dır), İbni Cüreyc'den rivayet etti. (Demişki): Bana Kaâsım b, Ebî Bezze, Saîd b. Cübeyr'den rivayet etti, (Şöyle demiş): İbni Abbas'a kasden bir mü'mini öldüren kimseye tevbe var mıdır? diye sordum : — Hayır! cevâbını verdi. Bunun üzerine kendisine Furkan süresindeki şu âyeti okudum: «O kimseler ki, Allah'la birlikte başka bir ilâha dua etmezler. Allah'ın haram kaIdığı nefsi de haksız yere öldürmezler, ilâh...» İbni Abbas: — Bu âyet Mekke'de nazil olmuştur. Onu Medine'de nazil olan: «Her kim kasden bir mü'mini öldürürse, onun cezası ebedî olarak cehennemdir.» âyeti neshetmiştir, dedi. İbni Hişam'ın rivayetinde: «Bunun üzerine Furkan süresindeki şu âyeti okudum : Ancak tevbe eden kimse müstesna!..» cümlesi vardır",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7546,
			"arabicnumber": "3024.01",
			"text": "Bİze Ebü Bekr b. Ebî Şeybe ile Harun b. Abdillah ve Abd b. Humeyd rivayet ettiler. (Abd: Ahberanâ; Ötekiler: Haddesenâ tâbirlerini kullandılar. Dedilerki): Bize Ca'fer b. Avn rivayet etti. (Dediki): Bize Ebû Umeys, Abdu'l-Mecîd b. Süheyl'den, o da Ubeydullah b. Abdullah b. Utbe'den naklen haller verdi. (Şöyle demiş): Bana İbni Abbâs: — Bilir misin (Harun, dirayetin var mı? dedi.) Kur'ân'dan son ve bütiin olarak inen sûre nedir? dedi. — Evet! «Allah'ın yardımı ve fetih geldiği vakit...» süresidir cevabını Verdim, İbni Abbâs : — Doğru söyledin, dedi, İbni Ebî Şeybe'nin rivayetinde : «Bilir misin hangi sûredir?» demiş. «Son» dememiştir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7547,
			"arabicnumber": "3024.02",
			"text": "{m-21} Bize İshâk b. İbrahim de rivayet etti. (Dediki): Bize Ebu Muaviye haber verdi. (Dediki): Bize Ebû Umeys bu isnadla bu hadîsin mislini rivayet etti. Ve : «Son sûre» dedi. Bir de «Abdu'l-Mecid» dedi «ibni Süheyl» demedi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7548,
			"arabicnumber": "3025",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile İshak b. İbrahim ve Ahmed b. Abdete'd-Dabbî rivayet ettiler. Lâfız İbni Ebî Şeybe'nindir. (O : Haddesenâ dedi; ötekiler: Ahberanâ tâbirini kullandılar. Dedilerki): Bize Süfyan, Amr'dan, o da Atâ'dan, o da İbni Abbas'dan naklen haber verdi. (Şöyle demiş): Müslümanlardan bâzı kimseler koyun sürücüğünün içinde bir adama rastladılar. Adam : — Esselâmüaleyküm! dedi. Onlarsa kendisini tutup öldürdüler. Ve o sürüceğizi aldılar. Bunun üzerine: «Sîze selâm veren kimseye, sen mü'min değilsin demeyin.» [Nisa 94] âyeti indi. İbni Abbas : «selem» kelimesini «selâm» okumuştur",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7549,
			"arabicnumber": "3026",
			"text": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Gunder, Şu'be'den rivayet etti. H. Bize Muhammed b. Müsennâ ile İbni Beşşâr da rivayet ettiler. Lâfız İbni Müsennâ'nındır. (Dedilerki): Bize Muhammed b. Ca'fer, Şu\"be'den, O da Ebû İshak'dan naklen rivayet etti. (Demişki): Ben Berâ'ı şunu söylerken işittim: Ensâr haccedip döndükten sonra evlere ancak arka taraflarından girerlerdi. Sonra ensardan bir adam gelerek kapısından girdi ve kendisine bu hususta lâf söylendi. Bunun üzerine şu âyet-i kerîme indi: «Evlere arka taraflarından gelmeniz ibâdet değildir.» [Bakara 189]",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7550,
			"arabicnumber": "3027",
			"text": "Bana Yûnus b. Abdl'l-A'la Es-Sadefî rivayet etti. (Dediki): Bize Abdullah b. Vehb haber verdi. (Dediki): Bana Amr b. Haris, Saîd b. Ebı Hilâl'den, o da Avn b. Abdillah'dan, o da babasından naklen haber verdi ki, İbni Mes'ud şöyle demiş: Bizim müsliiman oluşumuz ve Allah Teâlâ'nın bizi şu : «İman edenler için, kalblerinin Zikrullah'a yatışması zamanı gelmedi mİ?» [Hadis 16] âyetiyle muaheze buyurması arasında ancak dört sene vardır",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7551,
			"arabicnumber": "3028",
			"text": "Bize Muhammed b. Beşşâr rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti, H. Bana Ebû Bekr b. Nâfi' de rivayet etti. Lâfız onundur. (Dediki): Bize Gunder rivayet etti. (Dediki): Bize Şu'be, Seleme b. Küheyl'den, o da Müslim El-Batin'den, o da Said b. Cubeyr*den, o da İbni Abbas'dan naklen rivayet etti. (Şöyle demiş): (Vaktiyle) Kadın beyti çıplak olarak tavaf eder. Bana kim ödünç bir tavaf elbisesi verecek? derdi. Onu fercinin üzerine koyar : «Bugün bir kısmı yahut hepsi görünür ama, onun görünen kısmını helal etmem !» derdi. Bunun üzerine şu âyet-i kerîme indi: «Her mescid’e girerken, zinetinizi alınız…..!» [A'raf 31]",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7552,
			"arabicnumber": "3029.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Kureyb berabere Ebû Muâviye'den rivayet ettiler. Lâfız Ebû Kureyb'indir. (Dediki): Biz: Ebû Muâviye rivayet etti. (Dediki): Bize A'meş, Ebû Süfyan'dan, o da Câbir'den naklen rivayet etti. (Şöyle demiş): Abdullah b. Ubey İbni Selul bir cariyesine: Git de bizim için biraz zina et, derdi. Bunun üzerin Allah (Azze ve Celle) ; «Dünya hayâtının metâını elde etmek için iffetli olmak isteyen câriyelerinizi fuhşa zorlamayın. Her kim onları zorlarsa, iyi bilsin kî, onları zoıladıktan sonra Allah ğafûr, rahimdir.» [Nur 33] âyet-i kerimesini indirdi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7553,
			"arabicnumber": "3029.02",
			"text": "Bana Ebû Kâmil El-Cahderî de rivayet etti. (Dediki): Bize Ebû Avâne A'meş'den, o da Ebû Süfyan'dan, o da Câbir'den naklen rivayet ettiki, Abdullah b. Übey İbni Selûl'un Müseyke denilen bir cariyesi vardır. Ümeyme denilen bir cariyesi daha varmış. İbni Selûl bunları zinaya zorlamış. Onlar da bunu Nebi (Sallallahu Aleyhi ve Sellem)'e şikâyet etmişler. Bunun üzerine Allah: «Cariyelerinizi fuhşa zorlamayrn!» âyet-i kerîmesini gafurdur, rahimdir» kavli kerimine kadar inzal buyurmuş",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7554,
			"arabicnumber": "3030.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdullah b. İdris, A'meş'den, o da İbrahim'den, o da Ebû Ma'mer'den, o da Abdullah'dan naklen Allah (Azze ve Celle)'nin : «Bunlar o kimselerdir ki, dua ederler, Rablerinden vesileyi dileyerek her bîri ona daha yakın olmak isterler.» [İsra 57] Âyet-i kerîmesi hakkında rivâyette bulundu. Abdullah şöyle demiş : Cinlerden bir cemâat müslüman olmuşlardı. Bunlara tapanlar vardı. Tapanlar ibâdetleri üzere kaldılar, cinler'den bu cemâat müslüman oldu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7556,
			"arabicnumber": "3030.04",
			"text": "(Bu hadîsi bana Bişr b. lîâlid de rivâyet etti. ki): Bize Muhammed (yani; İbn Ca'fer), Şu'be'den, o da Süleyman'dan naklen bu isnadla haber verdi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7558,
			"arabicnumber": "3031",
			"text": "Bana Abdullah b. Muti' rivayet etti. (Dedikî): Bize Hüşeym, Ebû Bişr'den, o da Saîd b. Cübeyr'den naklen rivayet etti. (Şöyle demiş): İbni Abbas'a: Tevbe sûresi nedir? diye sordum, — Tevbe mi? Bilâkis o fâdîhadır. Onlardan bazıları, onlardan bazıları sözü, ine ine halk bu sûrede bizden zikredilmedik kimse kalmayacak zannettiler. — Enfal sûresi nedir? dedim. — O, Bedir süresidir! cevâbını verdi. — Yâ Haşr sûresi? dedim. — O sûre Benî Nadr hakkında inmiştir, cevabını verdi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7559,
			"arabicnumber": "3032.01",
			"text": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Alî b. Müshir, Ebû Hayyan'dan, o da Şa'bî'den, o da İbni Ömer'den naklen rivayet etti. (Şöyle demiş): Ömer, Resûlullah (Sallallahu Aleyhi ve Sellem}'in minberi üzerinde hutbe okuyarak Allah'a hamd-ü sena etti. Sonra şöyle dedi: — Bundan sonra! Dikkat edin ki, şarabın haram kılınması indiği gün olmuştur. O beş şeyden olur : Buğdaydan, arpadan, kuru hurmadan, kuru üzümden ve baldan. Hamr, aklı örten, şeydir. Üç şey de var ki, ey cemâat ben Resûlullah (Sallallahu Aleyhi ve Sellem)'in bunlar hakkında bize bilgi vermiş olmasını dilerdim. Bunlar dede, kelâle ve rîbâ bablarından bazı bablardır",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7560,
			"arabicnumber": "3032.02",
			"text": "Bize Ebû Kureyb de rivayet etti. (Dediki): Bize İbni İdris haber verdi. (Dediki): Bize Ebû Hayyân, Şa'bi'den, o da İbni Ömer'den naklen rivayet etti. (Şöyle demiş): Ben Ömer b. Hattab'ı ResûluIIah (Sallallahu Aleyhi ve Sellem)'in minberi üzerinde şunu söylerken işittim: — Bundan sonra! Ey cemâat! Gerçekten şarabın haram kılınması inmiştir. O beş şeyden olur; Üzümden, kuru hurmadan, baldan, buğdaydan ve arpadan. Hamr, aklı örten şeydir. Üç şey de var ki, ey cemâat! Ben ResûluIIah (Sallallahu Aleyhi ve Sellem)'in bunlar hakkında bize kendisinde karar kılacağımız bilgi vermiş olmasını dilerdim. (Bunlar) Dede, kelâle ve ribâ bablarından bazı bablardır",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7561,
			"arabicnumber": "3032.03",
			"text": "{M-33} Bize Ebû Bekr b. Ebî Şeybe dahî rivayet ettj. (Dediki): Bize İsmail b. Uleyye rivayet etti. H. Bize İshak b. İbrahim de rivayet etti. (Dediki): Bize İsa b. Yûnus haber verdi, Her iki râvi Ebû Hayyan'dan bu isnadla yukarkilerin hadîsi gibi rivayette bulunmuşlardır. Yalnız İbni Uleyye'nin hadîsinde İbni İdris'in dediği gibi «Üzüm»; İsa'nın hadîsinde ise îbni Müshir'in dediği gibi «Kuru üzüm» denilmiştir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7562,
			"arabicnumber": "3033.01",
			"text": "Bize Amr b. Zürâra rivayet etti. (Dediki): Bize Hüşeym, Ebû Hâşim'den, o da Ebû Miclez'den, o da Kays b. Ubad'dan naklen rivayet etti. (Şöyle demiş): Ebû Zer'i: «Bunlar Rableri hakkında mücâdele eden iki hasımdır.» [ Hac 19 ] âyeti, Bedir gününde mübarezeye çıkan Hamza, Alî, Ubeyde b. Haris, Rabia'nın iki oğlu Utbe ile Şeybe ve Velîd b. Utbe hakkında nazil olmuştur, diye yemin ederken işittim",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7563,
			"arabicnumber": "3033.02",
			"text": "{M-34} Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki) : Bize Veki' rivayet etti. H. Bana Muhammed b. Müsennâ da rivayet etti. (Dediki): Bize Abdurrahman rivayet etti. Her iki râvi Süfyan'dan, o da Ebû Hâşim'den, o da Ebû Miclez'den, o da Kays b. Ubad'dan naklen rivayet etmişlerdir. Kays şöyle demiş: Ben Ebû Zer'i: «Bunlar iki hasımdır...» âyetinin indiğine yemin ederken işittim... Râvi Hüseyin'in hadîsi gibi nakletmiştir. Diğer tahric: Buhârî Megazî» ile Tefsir»'de; Nesai Siyer",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 40
			}
		}
	]
}