{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"7": "The Book of Prayer - Friday"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1951,
			"arabicnumber": "844.01",
			"text": "(Bize Yahya b. Yahya Et-Temîmî ile Muhammed b. Bumlı b. El-Muhâcir rivâyet ettiler. Dediler ki: Bize Leys rivâyet etti, H. Kuteybetü'bnü Saîd de rivâyet etti. ki): Bize Leys, Nâfi’den, o da Abdullah'dan naklen rivâyet etti. Abdullah Şöyle dedi: Ben, Resûlüllah (sallallahü aleyhi ve sellem)'i: Cumâ'ya gelmek isterse yıkansın!» buyururken işittim",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1952,
			"arabicnumber": "844.02",
			"text": "Bize Kuteybetü'bnü Saîd rivâyet etti. ki: Bize Leys rivâyet etti. H. İbn Rumh dahi rivâyet etti. ki: Bize Leys, İbn Şihâb'dan, o da Abdullah b. Abdillâh b. Ömer'den, o da Abdullah b. Ömer'den. o da Resûlüllah (sallallahü aleyhi ve sellem)’den naklen rivâyet etti ki, minber üzerinde ayakta iken: kim cumâ'ya gelecekse yıkansın!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1953,
			"arabicnumber": "844.03",
			"text": "Bana Muhammed b. Râfî' rivâyet etti. ki: Bize Abdurrazzâk rivâyet etti. ki: Bize İbn Cüreyc rivâyet etti. ki: Bize İbn Şi-hâb, Abdullah b. Ömer'in oğullan Salim ile Abdullah'dan, onlar da İbn Ömer'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen bu hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1954,
			"arabicnumber": "844.04",
			"text": "Bana Harmeletü'bnü Yahya rivâyet etti. ki: Bize İbn Vehb haber verdi. ki: Bana Yûnus, İbn Şihâb'dan, o da Salım b. Abdillâh'dan, o da babasından naklen haber verdi. Babası; (sallallahü aleyhi ve sellem)'i şöyle buyururken işittim...» diyerek yukarki hadîsin mislini rivâyet etmiş. hadîsi Buhârî (194-256); Tirmizî (209-279); Nesâî (215-303) ve İbn Mâce (209-273) «cum'a» bahsinde muhtelif râvîlerden tahrîc etmişlerdir. bu hadîsi İbn Hibbân (?-354) «Sahîh» inde; Ebû Avane (?-3l6) de «Müstahrec» inde tahrîc etmişlerdir. Onların rivâyetinde: «Erkek ve kadınlardan her kim cum'aya gelecekse yıkansın...» buyurulmaktadır. İbn Huzeyme (223-311) rivâyetinde: «Cum'aya gelmeyen erkek ve kadınlara gusûl lâzım değildir.» ziyâdesi vardır. hadîsi Bezzâr (?-294), Hazret-i Âişe ile Abdullah b. Büreyde'den; İbn Mâce Abdullah b. Abbâs (radıyallahü anh)'dan tahrîc etmişlerdir. İbn Abbâs rivâyetinde: «Resûlüllah (sallallahü aleyhi ve sellem): ki bu günü, Allah, insanlara bir bayram günü yapmışdir. Şu hâlde kim cum'aya gelirse yıkansın! buyurdular.» denilmişdir. (260-360) bu hadîsi Hazret-i Ebû Eyyûb El-Ensârî'den rivâyet eder. Bu hadîsin pek çok tarîkler vardır. İbn Mendeh Nâfi' tarîki ile, Abdullah İbn Ömer'den rivâyet edenleri saymış; 300 kişiye baliğ olmuşlar; İbn Ömer'den başka râvîlerini saymış; 24' sahabîye baliğ olmuşlardır",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1955,
			"arabicnumber": "845.01",
			"text": "Bana Harmeletü'bnü Yahya rivâyet etti. ki: Bize İbn Vehb rivâyet etti. ki: Bana Yûnus İbn Şihâb'dan naklen haber verdi. ki: Bana Salim b. Abdillâh, babasından naklen rivâyet etti ki, Ömeru'bnü'l-Hattâb bir cuma günü cemaata hutbe okurken Resûlüllah (sallallahü aleyhi ve sellem)'in ashabından biri (mescide) girmiş. Ömer ona: Bu saat hangi saatdir diye nida etmiş. Gelen zât: Ben bu gün çalıştım, evime dönemeden ezanı işittim de abdest almakdan fazla bir şey yapamadım; cevâbını vermiş. Ömer: Abdestle yetinmen de öyle! Bilirsin ki Resûlüllah (sallallahü aleyhi ve sellem) yıkanmayı emrederdi, demiş",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1956,
			"arabicnumber": "845.02",
			"text": "Bize İshâk b. İbrahim rivâyet etti. ki: Bize Velîd b. Müslim, Evzâî'den rivâyet etti. ki: Bana Yahya b. Ebî Kesir rivâyet etti. ki: Bana Ebû Selemete'bnü Abdirrahmân rivâyet etti. ki: Bana Ebû Hüreyre rivâyet etti. ki: Bir cuma günü Ömeru'-bnü’l-Hattâb cemaata hutbe okurken Osman b. Affân mescide giriverdi. Ömer ona ta'rîzde bulunarak: Bâzı kimselere ne oluyor ki ezan okundukdan sonraya gecikiyorlar? dedi. Bunun üzerine Osman: Yâ Emîre'l-Mü'minîn ezam işittikden sonra abdest almakdan fazla bir şey yapamadım; sonra buraya geldim! dedi. Ömer: Abdest de öyle! Siz Resûlüllah (sallallahü aleyhi ve sellem)'i: «Biriniz Cumâ'ya gelecek mi, yıkansın!» buyururken işitmedinizmi? Ömer hadîsini Buhârî «Kitâbu’l-Cumua» da; Tirmizî dahi «Kitâbü's-Salât» da tahrîc etmişlerdir. hadîsde, mescide giren zâtın ismi tasrîh edilmemişse de, sonraki rivâyetde onun Hazret-i Osman b. Affân olduğu bildirilmişdir. rivâyetinde gelen zâtın ilk muhacirlerden olduğu kaydedilmektedir. Şa'bî'nin beyânına göre ilk muhacirlerden murâd: Bey'at-ı Ridvân'da bulunan zevâtdır. göre bunlar: Her iki kıbleye (yani hem Kudüse hem de Kâbe'ye) doğru namaz kılanlardır. , «Tefsir» inde ilk muhacirlerden murâd Bedir gazileri olduğunu söylemişdir. Ömer'in: «Bu saat, hangi saatdır?» diye sorması, sitem ve tevbîh içindir. Bu sözle: «Sen neiçin bu saate kadar geciktin?» demek istemişdir. Maksadı: mescide erken gidilmesine tenbîhdir. Çünkü mescide gidilmesi tavsiye buyuruları saatler geçtikden sonra melekler defterlerini dürer; bir daha gelenleri yazmaz olurlar. Bu cihet, hadîs-i şerifle sâbitdir. Osman (radıyallahü anh) Ömer (radıyallahü anh)'ın ne demek istediğini derhâl anlamış ve geciktiği için özür düemişdir. Bir rivâyetde: pazara gittiği için geç kaldığını tasrîh etmişdir. de öyle!.,» cümlesinden murâd; «Abdestle kanâ'at etmen de senin İçin ayrı bir fazilet kaybıdır.» demekdir. Çünkü Hazret-i Ömer'in: «Bu saat, hangi saatdır?» diyerek yaptığı ta'rîz ve inkârın mânâsı: «Sana vakti geciktirmek suretiyle kaybettiğin faziletin zararı yetmiyor mu ki, buna bir de yıkanmamak ve sâde abdestle kanâat etmek suçunu ilâve ettin?» demekdir. ki Hazret-i Ömer iki kelimelik bir cümle ile iki satırlık mânâ ifâde etmişdir. cümleyi buradaki gibi atıf sureti ile rivâyet edenler olduğu gibi (vâv) in. hazfi ile rivâyet edenler de vardır. göre (vâv) la rivâyet hemze'den ivaz olur. (Vâv) haz-fedilirse kelime yâ müptedâ haber olmak üzere merfû' yahut mahzûf bir fiilin mef ûlü olmak üzere mansûb okunur. Hazret-i Ömer'in: ki Resûlüllah (sallallahü aleyhi ve sellem) cuma günü yıkanmayı emrederdi.» sözü, cuma günü yıkanmanın farz olmadığına delâlet eder. Çünkü yıkanmak farz olsaydı Hazret-i Osman’ın mescide girmesine kat'iyyen müsâde etmez; yıkanmak için onu mutlakaa geri çevirirdi",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1957,
			"arabicnumber": "846.01",
			"text": "Bize Yahya b. Yahya rivâyet etti. ki: Mâlik'e, Safyân b. Süleym'den dinlediğim, onun da Atâ' b. Yesâr'dan, onun' da Ebû Saîd-i Hudri'den naklen rivâyet ettiği şu hadîsi okudum: Rssûlüllah günü yıkanmak her ihtilâm olan kimseye vâcipdir.» buyurmuşlar. hadîsi Buhârî «Kitâbü'l-Ezân», «Kitâbü'l-Cumu'a» ve «Kitâbu'ş-Şehâdât» da; Ebû Dâvûd «Kitâbu't-Tahâre» de; Nesâî «Kitâbu's-Salat» da; İbn Mâce dahi «Kitâbu's-Salât» da muhtelif râvîlerden tahrîc etmişlerdir. Müteekkid; demekdir. Burada ondan farz mânâsı murâd olunmamışdır. Nitekim bir çok sahîh hadîsler bu te'vîlin doğruluğuna şe-hâdet etmektedirler. Meselâ Hazret-i Semura hadîsinde: kimse obdest alırsa ne âlâ! Fakat yıkanırsa, yıkanmak daha faziletlidir.» buyurulmuşdur. Şayet yıkanmak farz olsaydı, abdest alan için «ne âlâ!..» demez; yıkanmanın da yalnız faziletinden bahsetmez; farz olduğunu söylerdi. olan: Bulûğa eren manasınadır. îhtilânı olmak bulûğa ermeyi istilzam ettiği için mecazen bulûğa eren yerine, ihtilâm olan tâbiri kul-lanılmışdır. Burada hakikat mânâya manî olan karine: İhtilâmla beraber, inzal de bulunduğu takdirde cuma olsun olmasın her zaman yıkanmanın lâzım gelmesidir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1958,
			"arabicnumber": "847.01",
			"text": "Bana Hârûn b. Saüd El-Eylî ile Ahmed b. Îsâ rivâyet etti ler. Dediler ki: Bize İbn\" Vehb rivâyet etti. ki: Bana Amr, Ubeydıd lah b. Ebî Ca'fer'den naklen haber verdi. Ona da Muhammed b. Ca'feı Urvetü'bnü'z-Zübeyr'den naklen rivâyet etmiş. Urve de Âişe'den rivâye etmiş ki, Âişe şöyle dedi: «Halk cumâ'ya yaylalardaki evlerinden gelir lerdİ. Aba içinde gelirler de toza bulanırlar; kendilerinden (ter) koku (su çıkardı. (Bir defa) Resûlüllah (sallallahü aleyhi ve sellem) benim yanımd iken ona, bunlardan bir adam geldi. Resûlüllah (sallallahü aleyhi ve sellem) (onun hâlini görünce): Siz bu gün için temizlenseniz e!...» buyurdular. hadîsi Buhârî «Kitâbü'l - Cumua» da; Ebû Dâvûda «Kitâbu's-Salât» da tahrîç etmişlerdir. diye tercüme ettiğimiz «Avâlî» âliyenin cem'idi: Âliye: Yüksek yer, yayla; demekdir. Burada ondan murâd: Medîne'nin doğusunda bulunan, ikiden sekiz mil'e kadar uzaklıktaki köylerdir. Bazıları, bunların en yakın olanları ile Medine arasında dört m mesafe bulunduğunu söylerler. son cümlesini, temenni mânâsına almak caizdir. Bu takdîrd cümlenin cevâba ihtiyâcı kalmaz. Fakat şart mânâsına almak da münkündür. O zaman cümle cevap ister. Ve cevâbı «İyi olurdu...» şeklind takdîr olunur; ve cümlenin tamâmı «Siz bu gün için yıkansaniz iyi olurdu!» şekline girer",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1959,
			"arabicnumber": "847.02",
			"text": "Bize Muhammed b. Rumh rivâyet etti. ki: Bize Leys, Yahya b. Saîd'den, o da Amra'dan o da Âişe'den naklen rivâyet etti ki, Âişe şöyle dedi: İş göç sahibi İdiler. Kendilerine bakacak kimseleri yokdu. Bu sebeple nahoş koktukları olurdu. (Onun için) kendilerine siz cuma günü yıkansanız a!...» denildi.» hadîsi Buhârî «Kitâbü'l-Cumua» da; Ebû Dâvûd da Kitâbu't-Tahâre» de tahrîc etmişlerdir. rivâyetinde: Âişe (radıyallahü anha) «Halk kendilerinin hizmetkârı idiler. Cumâ'ya gittikleri vakit kendi iş güç kılık kıyafetleri ile giderlerdi. Bu sebeple onlara Resûlüllah (sallallahü aleyhi ve sellem): Sh yıkansanıza!., buyurdular.» demişdir. rivâyetinde, kirli paslı iş elbiseleri ile mescide gelenlere, yıkanma emrini verenin kim olduğu tasrîh edilmemişse de, sözün gelşinden onun Resûlüllah (sallallahü aleyhi ve sellem) olduğu pek âlâ anlaşıldığı gibi Buhârî'nin rivâyetinde sarahaten beyanda edilmişdir. Hadîs-i şerif: namazına gitmezden önce yakanmanın müstehab olduğuna delildir. Çünkü kir ve ter kokusundan hem insanlar hem de melekler eziyyet duyarlar",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1960,
			"arabicnumber": "846.02",
			"text": "(Bize Amru'bnü Sevvâd El-Âmirî rivâyet etti. ki: Bize Abdullah b. Vehb rivâyet etti. ki): Bize Amru'bnü'l-Haris rivâyet etti. Ona da Saîd b. Ebi Hilâl ile Bükeyr b. Eşecc, Ebû Bekir b. Müiv kedir'den, o da Amru'bivü Süleym'den, o da Abdurrahmân b. Ebî Saîd'il-Hudrî'den, o da babasından naklen rivâyet etmişler ki, Resûlüllah (sallallahü aleyhi ve sellem); gönü yıkanmak, her ihtilâm olana farzdır. Bir de misvak fru-îunmak!... Bulabildiği kadar koku da sürünür.» buyurmuşlar. Bükeyr, Abdurrahmân'i zikretmemiş; koku hakkında da: demiştir. «Velev kadının kokusundan!..» demiştir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1961,
			"arabicnumber": "848.01",
			"text": "(Bize Hasanü’l-Hulvânî rivâyet etti. ki): Bize Ravhu'bnü Ulâde rivâyet etti. ki): Bize İbn Cüreyc rivâyet etti. H. Mufaammed b. Râfi' de rivâyet etti. ki): Bize Abdurrazzâk rivâyet etti. ki): Bize İbn Cüreyc haber verdi. ki): Bana İbrahim b. Meysera, Tâvûs'dan, o da İbn Abbâs'dan naklen haber verdi. İbn Abbâs, Peygamber (sallallahü aleyhi ve sellem)’in cuma günü yıkanmak hususundaki hadîsini anlatmış. diyor ki: Ben, İbn Abbâs'a: «Şayet ailesi nezdinde güzel koku yahut yağ varsa, ondan da sürünür mü? dedim; İbn Abbâs: Onu bilmiyorum!., cevâbını verdi",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1962,
			"arabicnumber": "848.02",
			"text": "(Bize, bu hadîsi İshâk b. İbrâhîm dahi rivâyet etti. ki): Bize Muhammed b. Bekir haber verdi. H. Hârûn b. Abdüllâh dahi rivâyet etti. ki): Bize Dahhâk b. Mahled rivâyet etti. Bu râvîlerin ikisi de İbn Cüreyc'den bu isnâdla rivâyetde bulunmuşlardır. hadîsleri Buhârî «KÜâbü'l-Cumua» da; Ebû Dâvûd ile Nesâî «Kitâbü't-Tahâre» de tahrîc etmişlerdir. Güzel koku. Kokulu veya kokusuz yağ demekdir. kadar koku da sürünür.» cümlesi hakkında Kâdi Iyâz: «Bu cümle, bulabildiğini sürünmesi hususunda te'kîd İçin yahut çok sürünmek istediğini anlatmak için söylenmiş olabilir. Birinci mânâ daha zahirdir.» diyor. ki kadının kokusundan!...» cümlesi de bu mânâyı te'yîdet-mektedir. Çünkü kadına mahsûs olan kokuyu erkeklerin sürünmesi mekruhdur. O devirde bu koku renkli idi. Ve pek keskin değildi. Böyle bir kokunun erkeğe mubah kılınması: Koku sürünmenin' bit'te'kîd matlûb olduğuna delildir. ki cuma günü cemaata eziyet verecek kerih kokuların her cihetle önüne geçmek emrolunmuştur. Cemaata ve meleklere eziyet verecek kerîh kokular ya terlemeden yahut ağızdan hâsıl olur. Terlemeden hâsıl olan kokuyu gidermek için evvelâ yıkanmak, sonra bir de bulabildiği güzel kokuyu sürünmek; ağız kokusunu gidermek için de ağzı güzelce misvaklamak, emir buyurulmuşdur. Mânevi temizliğin yanısıra maddî temizliğe de bu derece ehemmiyet veren başka bir dîn bilmiyoruz. Hazret-i İbn Abbâs'a: «Şayet ailesi nezdinde güzel koku yahut yağ varsa, ondan da sürünür mü?» diye sorması «hadîsin metninde bu ibare de yokmuydu?» manasınadır. İbn Abbâs (radıyallahü anh) bunun hadîsden olup olmadığını hatırlayamamışdır",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1963,
			"arabicnumber": "849",
			"text": "(Bana Muhammed b. Hatim rivâyet etti. ki): Bize, Behz rivâyet etti. ki): Bize Vüheyb rivâyet etti. ki): Bize Abdullah b. Tâvûs, babasından, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti. Efendimiz: yedi günde bir gusül edip, başını ve bedenini yıkamak her müslüman üzerinde Allahın bir hakkıdır.» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1964,
			"arabicnumber": "850.01",
			"text": "Bize Kuteybetü'bü Saîd, Mâlik b. Enesden, ona da Ebû Bekir'in âzâdlısı Sümeyy'den naklen okunan; Sümeyy'in de Ebû Salih Es-Semmân'dan, onun da Ebû Hüreyre'den naklen rivâyet ettiği hadîsler cümlesinden olmak üzere şu hadîsi rivâyet etti: Resûlüllah (sallallahü aleyhi ve sellem): kimse cuma günü cünüplükden yıkanır gibi yıkanır da sonra (cuma namazına) giderse bir deve tesadduk etmiş gibi olur; ikinci saatde giderse bir sığır tesadduk etmiş gibi; üçüncü saatde giderse boynuzlu bir koç tesadduk etmiş gibi; dördüncü saatde giderse bir tavuk tesadduk etmiş gibi; beşinci saatde giderse bir yumurta tesadduk etmiş gibi (sevaba nâil) olur. İmâm minbere çıktımı artık melekler hutbeyi dinlemeye gelirler.» buyurmuşlar. Ebû Hüreyre'nin buradaki iki hadîsinden birincisini Buhârî. «Kitâbü'l-Cumua» ile «Benî İsrail» bahislerinde; Nesâî dahi «cuma» bahsinde tahrîc etmişlerdir. bu hadîs, başka bir hadîsin sonunda zikredilmektedir. Hadîsin tamâmı şöyledir: Resûlüllah (sallallahü aleyhi ve sellem): kıyâmet gününde, bizden önce kendilerine kitap verilenleri geçecek olan sonra gelenleriz. Hem bize onlardan sonra kitap verilmişdir. İşte bu gün onların, hakkında ihtilâfa düştükleri gündür. Bize ise Allah hidâyet vermişdir. Yârın Yahûdiler İçin, yarından sonraki gün de Hıristiyanlar içindir.» buyurdu. Sonra «Öyle İse her yedi günde bir gusül ederek başını ve bedenini yıkamak her müslümanın boynuna borçdur.» buyurdular. hıristiyanların, hakkında ihtilâf ettikleri gün: Kıyâmet günüdür. yahudiler içindir...» cümlesinden murâd: cumartesi günü, ondan sonraki hıristiyanların toplanmasına âid olan gün de: pazardır. Resûlüllah (sallallahü aleyhi ve sellem) bu sözleri ile dünyâda cumartesi günü Yahûdilerin; pazar günü de hıristiyanlarm toplantı günü olduğu gibi, âhirette de herkes kendi gününde hesaba çekilecek demek istemiş olsa gerekdir. hadîsi Buhârî yine «Kitâbü'l-Cumua» da; Ebû Dâvûd ile Tirmizî «Kİtâbu's-Salât» da; Nesâî «Melâike» bahsinde tahrîc etmişlerdir. bir rivâyetinde hadîsin lâfzı şöyledir: mescidlerin kapıları başında oturarak (cemaata gelen) insanları derecelerine göre yazarlar. Bu husûsda cemâatin kimisi bir deve, kimisi inek, kimisi koyun, kimisi tavuk, kimisi serçe; bâzısı da bir yumurta tesadduk etmiş gibidir.» İbn Mâce dahi rivâyet etmişdir. ilk gelenlerle onlardan sonra peyderpey gelenlerin kazanacakları sevaplar muhtelif rivâyetlerde az çok farklarla temsil büyurul-muşdur. Bütün rivâyetlerin ittifak ettiği husus, hatîb minbere çıktıkdan sonra defterlerin kapanması ve sevap yazan meleklerin hutbeyi dinlemek için câmi'e girmiş olmasıdır. Cezvî'nin «Kitâbü't - Tergîb» nâm eserinde Hazret-i İbn Abbâs'dan şu hadîs rivâyet olunmuşdur: günü geldimi meleklere homd sancakları verilerek kılınan mescidlere gönderilirler. Cebrail Aleyhisselâm da Mescid-i Harâm'a gelir. Her Meleğin yanında bir kitap vardır. Meleklerin yüzleri Bedir gecesindeki ay gibidir. Beraberlerinde gümüşden kalemler ve gümüşden kâğıtlar vardır. Gelen cemâati derecelerine göre yazarlar, İmâmdan önce câmi'e gelen sâbikînden (evvel gelenlerden) yazılır. İmâm minbere çıktık-dan sonra gelen, hutbeye yetişti, namaz kılınırken gelen cum'âya yetişti... diye yazılır. İmâm selâm verdikden sonra melekler cemâatin yüzlerini, gözden geçirirler. İçlerinden eskiden câmi'e ilk gelenlerden birinin gelmediğini görürlerse: (Yâ Rabb! Filancayı göremedik. Bu gün ne sebeple gelmediğini bilmiyoruz. Eğer ruhunu kabzettinse, ona rahmet eyle! Hasta ise, şifâ ver! Yolcu ise, kendisine iyi arkadaşlar nasibet!) derler. Beraberindeki diğer yazıcı melekler de (Âmin!) derler. hadîsin umûmunda erkek, kadın, hür ve köle olmak üzere kendilerinden ibâdet beklenilen herkes dâhildir. Bazıları «cünüplükden yıkanır gibi...» tâbirinden, hakikat mânâsı kasdedildiğini söylemişlerdir. Onlara göre nefsi teskin etmek ve gözü harama bakmakdan korumak için cima ederek yıkanmak müs-tehabdır. Bu husûsda müdde alarmı isbât için Hazret-i Evs-i Şekafî'nin rivâyet ettiği bir hadîsle de istidlal ederler. Evs hadîsini Tirmizî beğenmiş ve hakkında «Hasendir» tâbirini kullanmışdir. ulemâya göre ise hadîsdeki teşbih: hüküm için değil; keyfiyet itibârı ile yapılmışdır. hadîsdeki saatleri İmâm Mâlik «lâtîf lâhzalar» diye tefsîr etmişdir. Bâzılarına göre, zevalden sonra bir yere gitmekdir. Kâdî Hüseyin ile imâmü'l-Harameyn'in kavilleri budur. Onlar mezkûr kelimenin lûgatda bu mânâya geldiğini iddia ederler. Fakat cumhûr-u ulemâya göre revâh'dan murâd: Zevâl'den evvel, erken gitmek manasınadır. İmâm Şafiî ile Mâlikîler'den İbn Habîb dahi buna kaaildirler. Onlara göre hadîsde zikri geçen saatlerden murâd: Günün evvelidir. Revâh ise: Günün evvelinde ve âhirinde bir yere gitmek demekdir. «Arap dilinde revâh: Gitmek mânâsına gelir. Günün evveli ile âhiri hattâ gece bu hussûda müsavidir.» demişdir. Doğrusu da budur. cumhûr-u ulemâ hadîsde zikri geçen saatleri şâir günlerde olduğu gibi zaman saati mânâsına hamletmişlerdir. rivâyet ettiği bir hadîsde dahi saatler bu mânâya alınarak: «Cuma günü oniki saatdir.» buyurulmuşdur. mîkaat âlimleri ise «gündüzün saatlerini gündüzün başlangıcı mânâsına almışlardır. rivâyetde Şafiî'lerin kavli de budur. Başka bir kavle göre Şafiî'ler bu mes'elede İmâm Mâlik ile beraberdirler. Şâfiîler'den rivâyet olunan dördüncü bir kavle göre saatden murâd; Güneşin yükselmesidir. «Saatlerden murâd: Gün ile gecenin taksim edildiği yir-midört parça değildir. Maksad: Dereceleri tertibe koymak ve en Öne gelenin, diğerleri üzerine fazileti olduğunu bildirmekdir.» diyor. mes'elesine gelince: buradaki tekarrubdan murâd: Tasadduk'dur. Yani cuma namazına erken giden kimse bir deve tasadduk etmiş gibi; ondan sonra giden bir sığır tasadduk etmiş gibi... ilâh... olur; demekdir. bunu: «Cumâ'ya erken gidene, kendisine kurban meşru olan bir kimsenin deve kurban etmekden kazandığı sevap kadar sevap vardır.» diye tefsir etmişlerdir. Onlar: «Çünkü bu ümmete kurban kesmek, eski ümmetlere meşru olduğu keyfiyyetde emrolunmamışdır.» derler. takımları da: «Bu hadîsden murâd: Cumâ'ya erken gidenlerin sevap itibârı ile bîribirlerinden farklı olduklarını, cami'e ikinci olarak varanın birinciye nisbeti kıymet itibârı ile sığırın, deveye nisbeti gibidir.» demişlerdir, kasdedilmişdir. Çünkü mukaabilinde sığır zikredilmektedir. «deve» ve «sığır» demek ise de burada ondan bil'ittifâk deve kasedilmiştir. Çünkü mukabilinde sığır zikredilmiştir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1965,
			"arabicnumber": "851.01",
			"text": "(Bize Kuteybetü'bnü Saîd ile Muhammedü'bnü Rumh b. El-Muhâcir rivâyet ettiler, İbn Rumh dedi ki: Bize Leys, Ukayl'den, o da İbn Şihâb'dan naklen haber verdi. ki): Bana Saîdü'bnü'l-Müseyyeb haber verdi. Ona da Ebû Hüreyre haber vermiş ki, Resûlüllah (sallallahü aleyhi ve sellem): günü İmâm hutbe okurken arkadaşına (sus!) dedinmi boş yere takırdı etmiş olursun!» buyurmuşlar",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1966,
			"arabicnumber": "851.02",
			"text": "(Bana Abdülmelik b. Şuayb b. Leys de rivâyet etti. ki): Bana babam, dedem'den rivâyet etti. ki): Bana Ukayl b. Hâlid, İbn Şihâb'dan, o da Ömeru'bnü Abdilazîz'den, o da Abdullah b. İbrahim b. Kaariz ile İbn'l-Müseyyeb'den naklen rivâyet etti. Onlar da Ebû Hüreyre'den rivâyet etmişler ki, Ebû Hüreyre: (sallallahü aleyhi ve sellem)'i şöyle buyururken işittim..» diyerek yukarki hadîsin mislini rivâyet etmiş",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1967,
			"arabicnumber": "851.03",
			"text": "(Bana, bu hadîsi Muhammed b. Hatim de rivâyet etti. ki): Bize Muhammed b. Bekr rivâyet etti. ki): Bize İbn Cüreyc haber verdi. ki): Bana İbn Şihâb iki isnadı ile birden bu hadisin mislini haber verdi. Yalnız İbn Cüreyc: «İbrahim b. Abdîllâh b. Kaariz...» demiş",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1968,
			"arabicnumber": "851.04",
			"text": "(Bize İbn Ebî Ömer dahi rivâyet etti. ki): Bize Süfyân, Ebû'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti. Şöyle buyurmuşlar: günü İmâm hutbe okurken arkadaşına (sus!) declinmi lagv yapmış olursun.» ; «Bu (lâğîte) Ebû Hüreyre'nin lügatidir. O (nun doğrusu) ancak Iâğavte'dir.» demiş. hadîsi Buhârî «Kitâbü'l-Cumua» da tahrîc ettiği gibi bütün «Sünen» sahipleri dahi rivâyet etmişlerdir. Tirmizî bu hadîsi rivâyet ettikden sonra: «Bu bâbda İbn Ebî Evfâ ile Câbir b. Abdillâh'dan dahi rivâyetler vardır.» demişdir. Ebî Evfâ (radıyallahü anh) hadîsini İbn Ebî Şeybe «Mûsannef» inde rivâyet etmişdir. Bu hadîs mevkuf da olsa yine merfû' hükmündedir. Çünkü bir kimsenin kendinden söyliyeceği sözler kabilinden değildir. (radıyallahü anh) hadisini yine İbn Ebî Şeybe «Mûsannef» inde, Bezzâr ile Ebû Ta'lâ (220-307) da «Müsned» lerinde rivâyet etmişlerdir. Mezkûr hadîsde beyân edildiğine göre Sa'd b. Ebî Vakkaas (radıyallahü anh) cuma günü bir zâta (senin namazın olmadı!) demiş; o zât bunu Peygamber (sallallahü aleyhi ve sellem)’e söylemiş, ve: Ya Resûlallah! Sad , bana, Namazımın namaz olmadığını söyledi.. demiş. Resûlüllah (sallallahü aleyhi ve sellem) ; yâ Sa'd?» diye sorunca, Sa'd: Çünkü sen hutbe okurken o konuşuyordu... cevâbını vermiş. Resûl-i Ekrem (sallallahü aleyhi ve sellem): doğru söylemiş.» buyurmuşlar. de beyân ettiği vecihle bu bâbda İbn Abbâs, Ebû Zerr, Ebû'd-Derdâ', Abdullah b. Mes'ûd, Abdullah b. Amr ve Alîyyü'bnü Ebî Tâlib (radıyallahü anhûm) hazerâtından da rivâyetler vardır. Abbâs (radıyallahü anh) hadîsini İmâm Ahmed ile Bezzâr «Müsned» lerinde; Taberânî de «El-Kebîr» inde tahrîc etmişlerdir. Bu hadîsde İbn Abbâs şöyle demektedir: (sallallahü aleyhi ve sellem): cuma günü İmâm hutbe okurken konuşan kimse, kitap taşıyan eşek gibidir. Ona (sus) deyenin de cum'ası yokdur; buyurdular» Zerr ile Ebû'd-Derdâ' hadîslerini Taberânî rivâyet etmişdir. hadîslerde beyân edildiğine göre Resûlüllah (sallallahü aleyhi ve sellem) cuma günü minber üzerinde bir sûre okumuş. Bunun üzerine Ebû'd-Derdâ', Übeyyü'bnü Kâ'b'ı dürterek: Bu sûre ne zaman nâzil oldu Ben, bunu şimdiye kadar hiç işitmedim; demiş. O da, ona: Sus! diye işaret etmiş. Namazdan çıkınca Übeyy: Senin kıldığın namazdan ettiğin kâr yalnız yaptığın boş boğazlıkdır! demiş. Ebû'd - Derdâ' (radıyallahü anh) da bunu Peygamber (sallallahü aleyhi ve sellem)’e haber vermiş. Resûlüllah (sallallahü aleyhi ve sellem): doğru söylemiş.» buyurmuşlar. b. Mes'ûd hadîsini, İbn Ebî Şeybe «Mûsannef» İnde; Taberânî de «El-Kebîr» inde rivâyet etmişlerdir. O hadîsde Hazret-i İbn Mes'ûd: «İmâm minbere çıktığı vakit yanındakine (sus!) demen boşboğazlık nâmına kâfiîdir.» demişdir. Bu hadîs mevkuf da olsa, yine merfû' hükmündedir. Zîra mevsuk râvî-ler tarafından rivâyet olunmuşdur; böyle bir sözü bir kimse kendinden söyleyemez. b. Amr hadîsini Ebû Dâvûd tahrîc etmişdir. Bu hadîsde Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuşlardır: üç nevi' kimseler gelir: Boşboğazlık yapmağa gelen kimsedir. Böylesinin cum'adan nasibi, yaptığı boşboğazlıkdır. Duâ etmek için cuma namazına gelen kimsedir. Böylesi Allahü teâlâ'ya duâ etmişdir, ona dilerse verir dilerse vermez. Cuma namazına sükût ederek dinlemek için gelen ve hiç bir müslümanın boynuna basıp geçmeyen, kimseys eziyet vermeyen adamdır. İşte bu yaptığı ondan sonra gelecek cumâ'ya kadar ve üç günlük de ziyâde günahlarına keffâretdir. Çünkü Allahü teâlâ (Her kim bir hayır işlerse, kendisine o hayırın on misli sevep vardır.) buyurmuşdur.» Ali (radıyallahü anh) hadîsini İmâm Ahmed b. Hanbel merfû' olarak tahrîc etmişdir. Bu hadîsde: kim (sus!) derse, konuştu demekdir. Konuşan kimsenin ise cum'ası yokdur.» buyurulmuşdur. Ahfeş'in beyânına göre: Aslı olmayan bâtıl sözler konuş-rriakdır. Bazıları lâgv'in: «doğru olan vecih'den sapmak.» mânâsına geldiğini söylerler. takımları da: «Ecir zayi oldu, fazilet kalmadı.» mânâsına geldiğini söylemişlerdir. Kelime nâkıs-ı vâvî'dir. Hazret-i Ebû Hüreyre onu nâkıs-ı yâî gibi okuduğundan Ebû'z-Zinâd.: «Bu Ebû Hüreyre'nin lügatidir.» demişdir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1969,
			"arabicnumber": "852.01",
			"text": "Bize Yahya b. Yahya rivâyet eît. (Ded ki): Mâlîk'e okudum. H. Kuteybetü'bnü Saîd, Mâlik b. Enes'den, o da Ebû'z - Zinâd'dan, o da A'rac'dan, o da Ebû Hüreyreden naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem) cumâ gününü anarak: öyle bir saat vardır ki, şayet bir müslüman kul namaz kılarken o saate rastlar da, Allahdan bir şey isterse Allah, ona dilediğini mutlaka verir.» buyurmuşlar. kendi rivâyetinde: «Onun az olduğuna eli ile işarette bulunmuş.» ifâdesini ziyâde etti",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1970,
			"arabicnumber": "852.02",
			"text": "(Bize Züheyr b. Harb rivâyet etti. ki): Bize İsmâîl İbrahim rivâyet etti. ki): Bize Eyyûb, Muhammed'den, o da El Hüreyre'den naklen rivâyet etti, Ebû Hüreyre şöyle dedi: Ebû'l-Kaasi cum'âda öyle bir saat vardır ki eğer bir müslüman kail namaz kılarken ona rastlar da, Allah'dan bir hayır dilerse, Allah dilediğ ona mutlakaa verir.» buyurdular. Ve eliyle onun azlığına, ehemmiyetsizliğine işaret etmiş",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1971,
			"arabicnumber": "852.03",
			"text": "(Bize İbn'l-Müsennâ rivâyet etti. ki): Bize İbn Ebî Adi; İbn Avn'dan, o da Muhammed'den, o da Ebû Hüreyre'den, naklen rivâyet etti. Ebû Hüreyre: «Ebû'l-Kâsım (sallallahü aleyhi ve sellem) şöyle buyurdu...» diyerek yukarıki hadîsin mislini rivâyet etmiş",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1972,
			"arabicnumber": "852.04",
			"text": "Bana Humeydü'bnü Mes'adete'l-Bâhilî rivâyet etti. (Dedi ki): Bize Bişr (yani İbn Mufaddâl) rivâyet etti. ki): Bize Sele —ki İbn Alkame'dir— Muhammed'den, o da Ebû Hüreyre'den naklen rivâyet etti. Ebû Hüreyre: (sallallahü aleyhi ve sellem) şöyle buyurdu...\" diyerek yukarki hadîsin mislini rivâyet etmiş",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1973,
			"arabicnumber": "852.05",
			"text": "(Bize Abdurrahman b. Sellâm El-Cumahî rivâyet etti. ki): Bize Rabi' (yânî İbn Müslim) Muhammed b. Ziyâd'dan, o da Ebu Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen vâyet etti ki, şöyle buyurmuşlar: cum'âda öyle bir saat vardır kir şayet bir Müslüman ve: «Bu hadîs mevkûfdur; onu merfû' rivâyet eden vehme kapılmışdır.» demişdir. Râfi' hadîsini Dârekutnî «El-ilel» inde rivâyet eder. rivâyetini yine Dârakutni rivâyet etmiş ve: «Galiba bu hadîs İbn Mes'ûd'dan rivâyet edilmiş olacakdır.» demişdir. Bürde ile Mücâhid rivâyetlerini dahi Darakutnî tahrîc etmişdir. b. Abdirrahmân rivâyetini: Ebû Ömer İbn Abdilberr tahrîc etmiş ve sahih olduğunu söylemişdir. kılarken...» ve «Allah'dan bir şey dilerse.» cümleleri müteradif yahut mütedâhil birer hâl cümlesidir. bunların «müslüman»a sıfat olduklarını söylemişlerse de, doğru değildir. Çünkü hadîsdeki «Müslim» kelimesi «Abd» in sıfatıdır. Sıfat ile mevsûf bir şey hükmündedirler. Nekire olan «Abd» kelimesi, sıfat alınca ma'rife hükmüne girmişdir. Binâenaleyh ondan sonra gelen cümleler sıfat olamazlar. Çünkü ma'rifeden sonra gelen cümleler hâl olurlar. rivâyette «namaz kılarken», diğer rivâyetde «kalkıp namaz kılarken.» buyurulmuş olması hakîkaten ayağa kalkarak namaz kılmaya ihtimâlli olduğu gibi, bundan duâ, intizâr ve devam gibi mânâların kasdedilmiş olması da mümkündür. diyor ki: «Bazıları (namaz kılarken) cümlesinin, (duâ ederken) mânâsına geldiğini; (ayağa kalkarak) sözünden de (devam) mânâsı kasdedildiğini söylemişlerdir. » bu ihtimâlleri nakletmesi, cumâ günündeki icabet saatini tâyin hususunda vârid olan iki sahîh hadîs hakkında işkâl çıkmaması içindir. Bu hadîslerden biri icabet saatinin hatîb minbere çıkıp oturdukdan namazın sonuna kadar devam ettiğini; diğeri ikindiden sonra başlayıp, güneş kavuşuncaya kadar sürdüğünü bildirmektedir. ki birinci hadîse göre icabet saati hutbe halindedir. Bu hâl ise hakîkaten namaz değildir. hadîse göre dahi namaz hâlinde değildir. nazaran Hazret-i Ebû Hüreyre o hadîsi rivâyet ettik-den sonra şunları söylemiş: Abdullah b. Sellâm'a rastlayarak, ona bu hadîsi söyledim. Abdullah: Ben, bu icabet saatini biliyorum; dedi. Ben: saata rastlar da Allah'dan bir hayır dilerse, Allah onu kendisine mutlakça verir.» (Ebâ Hüreyre): O hafif bir saattir., demiş",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1974,
			"arabicnumber": "852.06",
			"text": "(Bize bu hadîsi Muhammed b. Râfi' de rivâyet etti. ki): Bize Abdurrazzâk rivâyet etti. ki): Bize Ma'mer, Hemmâm b. Münebbih'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen rivâyet etti. Yalnız: «o, hafif bir saatdir.» cümlesini söylemedi. hadîsi Buhârî «Kitâbü'l-Cumua» da tahrîc etmişdir. Ebû Hüreyre, İbn Abbâs, Ebû Mûsâ (radıyallahü anhûm) ile Muhammed b. Şîrîn, Ebû Selemete'bnü Abdirrahmân, Hemmâm, Muhammed b. Ziyâd, Ebû Saîd-i Makburî, Said übnü'l-Müseyyeb, Atâ' b. Ebî Rabâh, Ebû Râfi', Ebû'l-Ahvas, Ebû Bürde, Mücâhid ve Ya'kûb b. Abdirrahmân hazerâtıda rivâyet etmişlerdir. Abbâs hadîsini Nesâî «Yevm ve Leyle» bahsinde tahrîc etmişdir. Mûsâ hadîsini Dârekutnî «El-ilel» nâm eserinde rivâyet eder. Şîrîn rivâyetini Buhârî «Talâk» bahsinde tahrîc etmişdir. Seleme hadîsini Ebû Dâvûd tahrîc etmişdir. Mezkûr hadîsde Hazret-i Ebû Hüreyre: «Resûlüllah (sallallahü aleyhi ve sellem): Üzerine güneş doğan en hayırlı gün cum'a günüdür... buyurdular». demişdir. Hadîs uzundur. Ayni hadîsde: gönde öyle bir saat vardır ki eğer bir müslüman leul namaz kılarken o saate rastlar da, Allah'dan bir hacet dilerse, Allah mutlakaa ona, o haceti verir.» ifâdesi de vardır. Mezkûr hadîsi Tirmizî ile Nesâî dahi muhtelif rıâvîlerden tahrîc etmişlerdir: b. Münebbih ile Muhammed b. Ziyâd rivâyetlerini Müslim tahrîc etmiçdir. Saîd-i Makburî ile Saîdü'bnü’l-Müseyyeb rivâyetlerini Nesâî «Yevm ve Leyle» bahsinde tahrîc etmişdir. b. Ebî Rabâh rivâyetini Dârakutnî tahrîc Onu, bana haber ver! Ne olursun cimrilik etme! dedim, Abdullah: O, ikindiden sonra başlar, güneş kavuşuncaya kadar devam eder; dedi. Ben: İkindiden sonra nasıl olabilir? Resûlüllah (sallallahü aleyhi ve sellem) (Eğer müslüman bir kul namaz kılarken o saate rastlarsa...) buyurdular. Hâlbuki (senin söylediğin) bu saâtde namaz kılınmaz? dedim. Abdullah b. Sellâm: Canım, Resûlüllah (sallallahü aleyhi ve sellem): bir kimse namazı bekleyerek bir yerde oturursa, o kimse namazdadır.) buyurmadı mı? dedi; Evet! cevâbını verdim. İşte bu, o'dur! dedi.» Ebû Hüreyre'nin bu anlattıkları gösteriyor ki: Nama-:-dan murâd: Duâ; ayakta bulunmakdan maksad da: Devâm'dır. Onun için bâzı rivâyetlerden «ayakta» kaydı düşmüşdür. Ömer İbn Abdilberr (368-463): «Bu ziyâde Mâlik, Verkaa' ve daha başkalarından rivâyet eden Ebû -Zinâd'dan bellenmişdir. Muhammedü'bnü Vaddâh mezkûr ziyâdenin hadîsden atılmasını emrederdi. Çünkü söylediğimiz işkâlı, mûcib olmaktadır. Lâkin buna arzettiğimiz şekilde cevap verilmişdir.» diyor. işaret ederek icabet saatinin azlığım gösteren bizzat Resûlüllah (sallallahü aleyhi ve sellem)'dir. Nitekim Ebû Mus'ab'm, İmâm Mâlik'den naklettiği rivâyetde tasrîh edilmişdir. ile tezhîd'in ikisi de: azlığını beyân etmek, mânâsına gelirler. «El-Evsat» da Hazret-i . Enes'den rivâyet ettiği hadîsde: «İcabet saati şu kadarcıkdır.» buyurularak bir tutam olduğu gös-terilmişdir. beyânına göre ulemâ icabet saati hakkında muhtelif ve-cihlerden söz etmişlerdir. Şöyle ki: Saat kelimesinin hakikati: Zamanın bir cüz-i mahsûsdur. Bazen günle gecenin yirmidört cüz'ünden birine, bazen de mecaz yolu ile herhangi bir zaman cüz'üne ıtlak olunduğu gibi, şimdiki zamana dahi saat denildiği vardır. nücûm ve hendese ile meşgul olanlar gece ile gündüzü onikişer kısma bölerek her parçaya saat adını verirler. Bu takdirce saat, yerine göre bazen uzun bazen kısa olur. İcabet saatinin zamanımıza kadar devam edip etmediği ihtilaflıdır. Ulemâdan bâzılarına göre bu saat, Resûlüllah (sallallahü aleyhi ve sellem) devrinde mevcûd idi. Sonradan kaldırılmışdır. bu kavli İbn Abdilberr hem rivâyet etmiş hem de çürütmüşdür. İbn Abdilberr Abdürrazzâk’ın rivâyet ettiği Ebû Hüreyre hadîsi ile istidlal eder. Hadîsi rivâyet eden Hazret-i Muâviye'nin kölesi Abdullah Şöyle demişdir: «Ebû Hüreyre'ye: Cuma günündeki icabet saatinin kaldırıldığını söylüyorlar; dedim. Onu söyleyen yalan yapmış! cevâbını verdi. Şu hâlde bu saat ileride göreceğim her cum'âda devam ediyor mu? diye sordum; Ebû Hüreyre: Evet! cevâbını verdi.» Hadîsin isnadı kuvvetlidir. Abdilberr: «Bütün haberler, bu minval üzere müte-vâtir olmuşlardır.» diyor. mukaabü Hâkim'in «Salıîh» inde rivâyet ettiği Ebû Seleme hadîsinde şöyle denilmektedir: ki: Yâ Ebâ Saîd! Ebû Hüreyre bize cuma günündeki icabet saatinden bahsetti. Senin bu saat hakkında malûmatın var mı Ebû Saîd: Biz, bu saati Peygamber (sallallahü aleyhi ve sellem)'e sorduk da: Ben onu biliyordum ama sonradan kadir gecesi gibi o da bana unutturuldu., buyurdu.» Zencûye'nîn, Muhammed b. Kâ'b El-Kurazî'den rivâyetine nazaran ikindiden sonra Resûlüllah (sallallahü aleyhi ve sellem)’in mescidi içinden bir köpek geçmiş. Bunu görünce sahabeden bir zât: Rabbî! Şunu öldür! diye duâ etmiş ve köpek hemen ölmüş. Peygamber (sallallahü aleyhi ve sellem) Efendimiz: olsun ki bu zât duaların müstecâb olduğu saate rastladı!» buyurmuşlar. İcabet saati bakî olduğuna göre acaba her cuma varmıdır yoksa seneni nyalnız bir cum'âsına mı münhasırdır? Bunda dahi ihtilâf edil-mişdir. Kâ'bü’l-Ah bâr'a göre icabet saati, senede bir gündür. Ebû Hüreyre her cuma günü icabet saati olduğunu söylemiş ve: «Kâ'b Tevrât»'ı okumuş» dedikden sonra: «Resûlüllah (sallallahü aleyhi ve sellem) doğru söylemiştir.» cümlesi ile sözüne nihayet vermiş; Hazret-i Kâ'b da onu dediğine gelmişdir. hadîsi Ebû Dâvûd ile Nesâî ve Tirmizî rivâyet etmişlerdir. İcabet saatinin vakti hakkında pek çok sözler söylenmişdir. Şöyle ki: Bu saat Kadir gecesi gibi gizlidir. Cuma gününün neresinde olduğu belli değildir. İbn Kudâme'nin kavli budur Mezkûr kavil Hazret-i Kâ'bü'l-Ahbâr'dan rivâyet olunur. Bu saatin gizlenmesin-deki hikmet, onu bulmak maksadı ile bütün günü ibâdetle geçirtmekdir. Nitekim Teâlâ Hazretleri sulehâya hüsn-ü zann olunsun diye velî kullarının kimler olduğunu gizlemişdir. İcabet saati: Her cuma bir olmayıp, yer değiştirir. İmâm Gazâlî (450-505): «Bu bâbda söylenenlerin en güzeli budur.» demiş-dir. İbn Asâkir ile diğer bir takım ulemâ kat'î olarak buna kaa-ildîrler. İcabet saati: Cuma sabahı müezzinin ezan okuduğu saatdir. Bunu İbn Ebî Şeybe söylemişdir. Tanyerinden başlıyarak güneş doğuncaya kadar devam eder. Bu kavli İbn Asâkir, Mücâhid tarîki ile Hazret-i Ebû Hüreyre’den rivâyet etmişdir. Bir rivâyetde: ikindiden, güneş kavuşuncaya kadardır.» ibaresini de ziyâde etmişdir. Bazıları buna İmâmın minberden inerek, namaz için tekbîr alıncaya kadar.» ibâresini de ziyâde etmişlerdir. Şu hâlde icabet saati hakkında Hazret-i Ebû Hüreyre'nin üç vakit gösterdiği anlaşılıyor. Filhakika Ebû Hüreyre (radıyallahü anh)’ın: günündeki icabet saatini şu üç vakitde arayın!..» dediği rivâyet olunur. Yani onun kavline göre cuma günü icabet saati, tanyerinden güneş doğuncaya kadar, ikindiden güneş batıncaya kadar ve İmâm minberden inerek namaz için tekbîr alıncaya kadar aranacakdır",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1975,
			"arabicnumber": "853",
			"text": "(Bana Ebû't-Tâhir ile Alîyyü'bnü Haşrem rivâyet ettiler. Dediler ki: Bize İbn Vehb, Mahrametü'bnü Bükeyr'den naklen haber verdi. H. Hârûn b. Saîd El-Eyîî ile Ahmed b. Îsâ da rivâyet ettiler. Dediler ki: Bize Vehb rivâyet etti. ki): Bize Mahrame, babasından, o da Ebû Bürdete'bnü Ebû Mûse'l-Eş'arî'den naklen haber verdi. Şöyle dedi: Bana, Abdullah b. Ömer: «Babanın cuma saati hakkında Resûlüllah (sallallahü aleyhi ve sellem)’den hadîs rivâyet ettiğini işittin mi?» dedi. Ben: Evet, babamı şöyle derken işittim dedim: Resûlüllah (sallallahü aleyhi ve sellem)'i: saati, İmâmın (minber üzerinde) oturması ile namazın edâ edilmesi arasındadır.» buyururken işittim. hadîs hakkında Dârakutnî İmâm Müslim'e istid-râkde bulunmuş ve şunları söylemişdir: «Bu hadîsi Mahrame'nin babasından, onun da Ebû Bürde'den rivâyet etmesi suretiyle yaptığı müsned rivâyetden başka, müsned olarak rivâyet eden yokdur. Onu bir cemâat Ebû Bürde'den kendi kavli olmak üzere -rivâyet etmişlerdir. Bazıları, senedi Ebû Mûsâ'ya kadar götürmüş fakat hadîsi Resûlüllah (sallallahü aleyhi ve sellem)’e ref etmemişdir. Doğrusu Hadîs Ebû Bürde'nin sözüdür. Onu Yahya El-Kattân dahi Sevrî'den, o da Ebû İshâk'dan, oda Ebû Bürde’den naklen bu şekilde rivâyet etmişidr. Vâsıl-\"ı Ahdeb ile Muhalid dahi Yahyâ'ya tâbi olarak onu Ebû Bürde'nin sözü olmak üzere rivâyet etmişlerdir. Nu'man b. Abdisselâm, Sevrî'den, o da Ebû İshâk'dan naklen: Ebû Bürde'nin, babasından rivâyeti mevkûfdur. (Babasından) sözü sabit değildir; demişdir. b. Hanbel, Hammâd b. Hâlid'in Mahreme'ye: Sen babandan bir şey işittin mi? dedim. Hayır cevâbını verdi.. dediğini söyler.» diyor ki: «Dârakutnî'nin yaptığı bu istidrâk kendince ve ekseri muhaddisînce ma'rûf olan bir kaaideye binâendir. Mezkûr kaaideye göre bir hadîsin iki rivâyeti biribirîne tearuz eder; meselâ biri merfû' biri mevkuf olursa mevkuf olduğuna hükmedilir. Ancak bu kaaide zayıfdır. Sahîh olan, usûl-i fıkıh ulemâsı ile fukahânın ve Buhârî ile Müslim gibi Muhakkik hadîs âlimlerinin tarîkidir. Bu tarika göre o hadîsin merfû' olduğuna hükmedilir. Çünkü hadîsde mevsuk râvînin ziyâdesi vardır. Böyle bir ziyâde makbuldür. Bu mes'ele kitabımızın mukaddimesinde görülmüşdü. «Sünen» inde Ahmedü'bnü Seleme'nin şöyle dediği rivâyet olunuyor: «Mahrame'nin rivâyet ettiği bu hadîsi Müslim b. Haccâc ile müzâkere ettim; Müslim: Bu hadîs cuma saatini beyân hususunda en güzel ve en doğru bir hadîsdir; dedi.»",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1976,
			"arabicnumber": "854.01",
			"text": "(Bana harmeletü'bnü Yahya rivâyet etti. ki): Bize İbn Vehb haber verdi. ki): Bana Yûnus, İbn Şihâb'dan naklen haber verdi. ki): Bana Yûnus, İbn Şihâb'dan naklen haber verdi. ki): Bana Abdurrahmân El-A'rac haber verdi ki, Ebû Hüreyre'yi şöyle derken işitmiş: Resûlüllah (sallallahü aleyhi ve sellem): güneş doğan en hayırlı gün cuma günüdür. (Zîra) Âdem o gün cennetden çıkarıldı.» buyurdular",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1977,
			"arabicnumber": "854.02",
			"text": "(Bize Kuteybetü'bnü Saîd rivâyet etti. ki): Bize Mugîra (yani El - Nizamî) Ebû'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hüreyre'den naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem): güneş doğan en hayırlı gün cuma günüdür. Âdem o gün yaratı İdi; o gün cennete konuldu ve o gün cennetden çıkarıldı. Kıyâmet de ancak cuma günü kopacakdır.» buyurmuşlar. gününün en hayırlı gün olması: Haftanın şâir günlerine nis-betledir. beyânına göre, senenin günlerine nisbetle en hayırlı gün arafe günüdür. Bazıları cum'anm arafe gününden efdal olduğuna bu hadîsle istidlal etmişlerse de esah kavle göre arafe daha faziletlidir. Aliyyü’l-Kaarî: «Cuma günü arafeye tesadüf ederse mutlak surette günlerin en faziletlisi olur. O günde işlenen amel de en faziletli ve makbul olur, Hacc-ı ekber bundandır.» diyor. Iyâz bu hadîs hakkında şunları söylemişdir: «Zahire bakılırsa bu hadîsde zikri geçen kazıyyeler Hazret-i Âdem'in faziletini beyan için değildirler. Çünkü Âdem (aleyhisselâm)'ı cennetden çıkarmak ve kıyâmeti ncumâ günü kopması fazilet sayılamaz. Bunlar o gün vâki olacak büyük hâdisâtdır. Tâ ki kul, sâlih ameller işleyerek Allah'ın rahmetine nâü olmaya, gazabını defe hazırlansın...» Bekir İbn'l -Arabi dahi: «Bütün bu faziletler ve Hazret-i Âdem'in cennetden çıkarılması zürriyetinin ve bu büyük neslin, enbiyâ, mürselîn, sâlihîn ve evliyâ’nın vücûduna sebepdir. Hazret-i Âdem cennetden- kovulduğu için çıkarılmış değil, bâzı vazifeler görerek sonra tekrar oraya dönmek İçin çıkarılmışdır. Kıyâmetin kopması, enbiyânın, sıddîkin ile evliyanın şeref ve kerametlerini göstermek ve mükâfatlarını acele vermek İçin bir sebebdir.» demişdir. Hazret-i Âdem'in cennetten çıkarılması ihanet için değil, halifelik makamı içindir. Bu izlâl değil, ikmâldir. şerif cuma gününün fazilet ve meziyyetine delildir. «Bu hadîs Hazret-i Âdem'in cennette değil, dışarıda yaratılarak sonra cennete konulduğuna delildir.» demektedir. vî diyor ki: «Bu hadîs garîb ve güzel bir mes'eleye de delildir. Mes'ele şudur: Bir adam, karışma (sen günlerin en faziletlisinde boşsun) dese, ulemâmıza göre bu mes'elede iki vecih vardır. Esah olan veçhe göre: Kadın arafe günü'boş olur. veçhe göre: Cuma günü boş düşer. Delili de bu hadîsdir. Yalnız bu kaviller o adamın niyeti olmadığına göredir. Şayet bu sözü ile senenin en faziletli gününü niyet ederse, o zaman kadın alettâyîn arafe günü ,boş olur. Hafta günlerinin efdalini murâd etmişse, boş düşmek için cuma günü teayyün eder. adam «gün» yerine «gece» tâbirini kullanarak (sen en hayırlı gecede boşsun) derse, kadın alettâyîn Kadir gecesi boş olur. ile cumhûr'a göre Kadir gecesi Ramazan ayının son on gecesi içersindedir. Eğer bu söz Ramazandan. kalan on gecenin birincisinde söylenmişse, kadın son gecenin ilk cüz'üde boş olur. Şayet Ramazan’dan kalan on gecenin biri yahut bir gecenin ekserisi geçtikden sonra söylenmişse, gelecek senenin o gecesinin o cüz'ünde boş olur. (Leyle-i Kadir her sene başka başka gecelerde olur) deyenlere göre, bu sözle kadın o ayın son gecesinin ilk cüz'ünde boş olur.»",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1978,
			"arabicnumber": "855.01",
			"text": "(Bize Amru'n-Nâkıd rivâyet etti. ki): Bize Süfyân b. Uyeyne, Ebû'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hüreyre'den naklen rivâyet etti. Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): en son gelenleriz; ama kıyâmet gününde herkesi geçenler de biz olacağız. Şu kadar var ki her ümmete kitap bizden önce verilmiş, bize onlardan sonra verilmişdir. Sonra Allah'ın bize farz kıldığı şu gün yok mu! Allah bizi ona hidâyet buyurmuştur. Şâir İnsanlar bu husûsda bize tabidirler. Yahûdilerin bayramı yârın, hıristiyanlarınki ise öbür göndür, buyurdular",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1979,
			"arabicnumber": "855.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1980,
			"arabicnumber": "855.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1981,
			"arabicnumber": "855.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1982,
			"arabicnumber": "856.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1983,
			"arabicnumber": "856.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1984,
			"arabicnumber": "850.02",
			"text": "Bana Ebû't-Tâhir ile Harmele ve Amru'bnü Sevvâd El -Âmiri rivâyet ettiler. Ebû't - Tâhir (bize rivâyet etti.) tâbirini kullandı.. Ötekiler: (Bize İbn Vehb haber verdi.) dediler, (İbn Vehb ki: Bana Yûnus, İbn Şihâb'dan naklen haber verdi. ki) Bana Ebû Abdillâh El-Egarr haber verdi ki, kendisi Ebû Hüreyre'yî şöyle derken işitmiş: Resûlüllah (sallallahü aleyhi ve sellem): günü oldumu mescidin bütün kapılarında melekler bulunur. Bunlar evvel beevel gelenleri yazarlar. İmâm (minbere) oturduğu vakit sabiteleri dürerler de, hutbeyi dinlemeğe gelirler. Evvel gelen bir deve kurban etmiş gibi olur; ondan sonra gelen, inek kurban etmiş gibi; ondan sonra gelen koç kurban etmiş gibi; ondan sonra gelen tavuk kurban etmiş gibi; ondan sonra gelen de yumurta kurban etmiş gibi olur.» buyurdular",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1985,
			"arabicnumber": "850.03",
			"text": "Bize Yahya b. Yahya ile Amru'n-Nâkıd, Süfyân'dan, o da Zührî'den, o da Saîd'den, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen yukarki hadîsin mislini rivâyet etti",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1986,
			"arabicnumber": "850.04",
			"text": "(Bize Kuteybetü'bnü Saîd rivâyet etti. ki): Bize Yakûb (yânî İbn Abdirrahmân) Süheyl'den, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti ki, Resûlüllah (sallallahü aleyhi ve sellem): her kapısının üzerinde, evvel beevvel gelenleri yazan bir melek vardır. (Resûlüllah sallallahü aleyhi ve sellem) evvelâ deve kurban etmekle temsil yapmış. Sonra gelenlerin derecelerini indire İndire yumurta kadar küçültmüş). İmâm minber üzerine oturunca sahîfeler dürülör ve melekler hutbe dinlemeğe gelirler.» buyurmuşlar. hadîsde: «İmâm minbere oturduğu vakit, buyuruluyor. Başka bir hadîsde ise «İmâm minbere çıktığı vakit...» denilmişdir. Zahiren iki hadîs arasında tearuz var gibi görünüyorsa da, hakîkatda tearuz yokdur. Çünkü hadîslerin arası bulunarak «Melekler, hatîb minbere çıkarken içeri girerler; minbere oturduğu zaman sahîfelerini dürerler.» denilebilir. İmâm Halîl b. Ahmed ile diğer bir takım lügat ulemâsına göre erken gitmek, erken davranmak mânâsına gelir. Resûlüllah (sallallahü aleyhi ve sellem)’in: «Tehcirde neler olduğunu bilseler, onun için müsabaka yaparlardı.» hadîs-i şerifi bu mânâya tefsir edilmişdir. Yani hadîsden murâd: «Her namaza erken gitmekde ne derece sevab olduğunu bilseler, her kes evvelâ mescide ben varayım diye acele eder, bu husûsda âdeta müsabaka yaparlardı.» demekdir. tehcîr'in, hâcirede (yânî güneş semânın ortasına dikildiği zaman) yürümek mânâsına geldiği rivâyet olunmuşdur. Iyâz: «Burada sahîh olan, erken gitmek mânâsına gelmesidir.» diyor. zikri geçen deve, inek ve koç gibi hayvanlar kurbanlıklar cinsindendirler. Tavukla yumurta kurbanlık cinsinden değildirler. Bununla beraber onlara da «kurban» denilmesi, müşâkele kabîlindendir, Maksad tavuk ve yumurta tesadduk eden gibidir; demekdir. şerîf hatîb minbere çıktığı zaman ezan okununcaya kadar o-turmasının müstehab olduğuna delildir. Mâlik ile İmâm Şafiî'nin ve Cumhûr-u ulemânın mezhepleri budur. A'zam ile bir rivâyetde İmâm Mâlik'e göre hatîbin burada oturması müstehab değildir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1987,
			"arabicnumber": "857.01",
			"text": "(Bize Ümeyyetü'bnü Bistâm rivâyet etti. ki): Bize Yezîd (yânî İbn Zürey') rivâyet etti. ki): Bize Ravh, Süheyl'den, o da babasından, o da Ebû Hüreyre'den, o da Peygamber (sallallahü aleyhi ve sellem)'den naklen rivâyet etti. Şöyle buyurmuşlar: kimse gusûl eder, sonra cum'aya gelir ve kendisine mukadder olan namazı kıtar, sonra hatîb hutbesini bitirinceye kadar dînler, sonra onunla beraber cuma namazım kılarsa, o kimsenin o cuma ile öbür cum'a arasındaki günahları; üç günlük de fazla günahı affolunur.»",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1988,
			"arabicnumber": "857.02",
			"text": "Bize Yahya b. Yahya ile Ebû Bekir b. Ebî Şeybe ve Ebû Küreyb rivâyet ettiler. Yahya (Bize haber verdi.) tâbirini kullandı. Ötekiler: (Bize Ebû Muâviye rivâyet etti.) dediler. Ebû Muâviye, A'meş'den, o da Ebû Sâlih'den, o da Ebû Hüreyre'den naklen rivâyet etmiş. Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): kimse abdest alır da, onu tertemiz almayı becerir sonra cum'âya gelerek susar ve hutbeyi dinlerse, gelecek cum'âya kadar işleyeceği (küçük) günahları ile üç günlük fazla günahı affolunur. Her kim de yerden çakıl taşı alırsa, abesle iştigâl etmiş olur.» buyurdular. ile istimâ' bazen ayni mânâda kullanılırlarsa da, hakikatte aralarında fark vardır. însât: susmakdır. Bu kelime üç bâbdan (yani «Ensate», «Nasate» ve «İntasate» bâblarından) kullanılabilir. «intasate» şeklinin vehim olduğunu söylemişlerse de «Bu bâbdan kullanılması, vehm değil; sahih bir lûgatdir diyor; ve lügat ulemâsından Ezherî'nin beyânına göre bu kelimenin üç bâbdan kullanıldığını söylüyor. hadîsdeki lağıvdan murâd abes yânî lüzumsuz şeylerle meşgul ol-makdır. Çünkü yerden ufak taşları alan kimse hem kendisi meşgul olur hem de onun taş aldığını gören ve sesini işitenleri meşgul eder. beyânına göre iki cum'a arasındaki günahlarla üç günlük fazla günahdan murâd küçük günahlardır. günün ilâvesi ile cuma günü, hadîs-i şerîfde beyân buyurulduğu vecihle, hareket ederek hutbe dinleyen ve cuma kılanlar hakkında on misli İle katlanan bir hasene gibi olmuşdur",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1989,
			"arabicnumber": "858.01",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe ile İshâk b. İbrahim rivâyet ettiler. Ebû Bekir dedi ki: Bize Yahya b. Âdem rivâyet etti. ki): Bize Hasan b. Ayyaş, Ca'fer b. Muhammed'den, o da babasından, o da Câbir b. Abdillâh'dan naklen rivâyet etti. Câbir Şöyle dedi: «Biz cuma namazını Resûlüllah (sallallahü aleyhi ve sellem) ile bîrlikde kılar; sonra döner de su taşıdığımız develeri dinlendirir dik.» ki: «Ben, Ca'fer'e: Bu hangi saatde oluyordu? dedim. Ca'fer: Güneşin zevâH vaktinde., cevâbını verdi",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1990,
			"arabicnumber": "858.02",
			"text": "(Bana Kâsım b. Zekeriyyâ rivâyet etti. ki): Bize Hâlid b. Mahled rivâyet etti. H. Abdullah b. Abdirrahmân Ed-Dârimî de rivâyet etti. - ki): Bize Yahya b. Hassan rivâyet etti. Her iki râvî birden demişler ki: Bize Süleyman b. Bilâl, Ca'fer'den, o da babasından naklen rivâyet etti ki, babası Câbir b. Abdillâh'a: Resûlüllah (sallallahü aleyhi ve sellem) cuma namazını ne zaman kılardı? diye sormuş; Câbir: (Bize) cuma namazını kıldırır, sonra develerimizin yanına giderek onları dinlendirirdik.» cevâbını vermiş. kendi rivâyetinde: «Güneş zevale erdiği vakit., yani su taşıyan develeri...» ibaresini ziyâde etmişdir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1991,
			"arabicnumber": "859",
			"text": "Bize Abdullah b. Meslemete'bni Ka'neb ile Yahya b. Yahya ve Alîyyü'bnü Hucr rivâyet ettiler. Yahya (Bize haber verdi.) tâbirini kullandı; ötekiler: (Bize, Abdülâzîz b. Ebî Hâzim rivâyet etti.) dediler. Abdülazîz, babasından, o da Sehl'den naklen rivâyet etmiş. Sehl: «Biz ancak cuma namazından sonra kaylûle yapar; yemek yerdik.» demiş. Hucr: «Resûlüllah (sallallahü aleyhi ve sellem) zamanında...» ifâdesini ziyâde etti",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1992,
			"arabicnumber": "860.01",
			"text": "Bize Yahya b. İbrâhîm rivâyet ettiler. Dediler ki: Bize Vekî', Ya'lâ b. Haris El-Muhâribî'den, o da İyâs b. Selemete'bni Ek-va'dan, o da babasından naklen haber verdi. Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) ile birlikde güneş zevale erdiği vakit cuma namazını kılar; sonra bölgeyi araştırarak dönerdik»",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1993,
			"arabicnumber": "860.02",
			"text": "(Bize İshâk b. İbrâhîm rivâyet etti. ki): Hişâm b. Abdilmelik haber verdi ki): Bize Ya'lâ b. Haris, İyâs b. Selemete'-bi Ekva'dan, o da babasından naklen rivâyet etti. İyâs’ın babası Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) ile birlikde cumâ'yı kılar da dönerdik. Ama (henüz) duvarların, gölgeleneceğimiz kadar gölgesini bulamazdık.» hadîsini Buhârî «Kitâbü'l-Cumua» da, gölge hadîsini de «Kitâbü'l-Megâzî» de tahrîc etmişdir. hadîsini Ebû Dâvûd , Nesâî ve İbn Mâce «Kitâbu's-Salât» da tahrîc etmişlerdir. Öğle istirâhati, demekdir. Kaba kuşluk; gadâ ise: Kuşluk yemeği mânâsına gelir. zevalinden. murâd: Semânın ortasından batıya doğru biraz yanlamasıdır. Nitekim Buhârî'nin «cuma» bahsinde Hazret-i Enes'den rivâyet ettiği bir hadîsde: «Peygamber (sallallahü aleyhi ve sellem) cum'a namazını güneş (semânın ortasından) yanladığı vakit kılardı.» de-nilmişdir. Mezkûr hadîsi Tirmizî ile Ebû Dâvûd dahi rivâyet etmiş; Tirmizî onun hakkında «Hasen sahîhdir.» tâbirini kullanmış ve «Bu bâbda Selemetü'bnü Ekvâ' ile Câbir ve Zübeyr b. Avvam'dan da hadisler rivâyet edilmişdir. demiştir. bu bâbda Sehl b. Sa'd , Abdullah b. Mesûd, Ammâr b. Yâsir, Sa'dü'l-Kurazî ve Bilâl (radıyallahü anhûm) hazerâtından da rivâyetler vardır. Ekva hadîsini Tirmizî'den maâdâ bütün kütüb-i sitte sahihleri tahrîc etmişlerdir. hadîsi nâmını verdiğimiz bu hadîs, Bâbımızın son rivâyetidir. Mezkûr hadîsdeki «Gölgeyi araştırarak dönerdik.» ifâdesinden murâd: Gölgenin azlığını beyândır. Gölgenin en az olduğu zaman ise güneşin tam gökyüzünün ortasında bulunduğu andır. Ondan sonraki zamana zeval denir. Râvî bu sözü ile cuma namazının zeval vaktinde kılındığına işaret etmişdir. Çünkü güneşin tam gökyüzünün ortasında bulunduğu zamanda namaz kılmak mekruhdur. (radıyallahü anh) hadîsini Müslim ile Nesâî rivâyet etmişlerdir. Bâbımızın birinci ve ikinci rivâyetleri bu hadîse âiddir. Avvâm hadîsini İmâm Ahmed b. Hanbel tahrîc etmişdir. Mezkûr hadîsde: Peygamber (sallallahü aleyhi ve sellem) ile birlikde cuma namazını kılar; sonra namazdan çıkarak kale duvarlarına koşuşurduk. Fakat gölge nâmına ancak ayaklarımızı koyacak kadar bir şey bulabilirdik.» b. Sa'd hadîsini Buhârî, Müslim, Nesâî ve Tirmizî tahrîc etmişlerdir. b. Mes'ûd hadîsini İmâm Ahmed b. Hanbel «Müsned» inde rivâyet etmişdir. b. Yâsir hadîsini Taberânî «El-Kebîr» inde rivâyet etmişdir. Bu hadîs Selemetü'bnü Ekva' hadîsi gibidir. hadîsini İbn Mâce tahrîc etmişdir. (radıyallahü anh) hadîsini dahi Taberânî «El-Kebîr» inde rivâyet etmişdir. Bu hadîsde: (sallallahü aleyhi ve sellem) cuma günü gölge nalın bağı kadar olduğu ve Peygamber (sallallahü aleyhi ve sellem) minber üzerine oturduğu zaman ezan okunurdu.» denilmektedir. Kurâzî hadîsi dahi hemen hemen bunun gibidir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1994,
			"arabicnumber": "861",
			"text": "(Bize Ubeydullah b. Ömer El-Kavârîrî ile Ebû Kâmil El -Cahderî hep birden Hâlid'den rivâyet ettiler. Ebû Kâmil dedi ki: Bize Hâlid b. Hârİs rivâyet etti. ki): \"Bize Ubeydullah, Nâfi'den, o da İbn Ömer'den naklen rivâyet etti. İbn Ömer Şöyle dedi: (sallallahü aleyhi ve sellem) cuma günü ayakta hutbe okur; sonra oturur; sonra (yine) kalkardı. Tıpkı sizin bu gün yaptığınız gibi.»",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1995,
			"arabicnumber": "862.01",
			"text": "Bize Yahya b. Yahya ile Hasanu'bnü'r-Rabî' ve Ebû Bekir b. Ebî Şeybe rivâyet ettiler. Yahya (Bize haber verdi.) tâbirini kullandı. Ötekiler: Bize Ebû’l-Ahvas, Simâk'den, o da Câbir b. Semura'dan naklen rivâyet etti. dediler. Câbir: (sallallahü aleyhi ve sellem)'in iki hutbesi vardı. Aralarında oturur; Kur'ân okur ve cemaata hatırlatma yapardı.» demiş",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1996,
			"arabicnumber": "862.02",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Biez Ebû Hayseme, Simâk'dan naklen haber verdi. ki: Bana Câbir b. Semura haber verdi. ki): (sallallahü aleyhi ve sellem) ayakta hutbe okur; sonra oturur; sonra (tekrar) kalkarak ayakta hutbe okurdu. Sana kim oturarak hutbe okuduğunu haber verdiyse muhakkak yalan söylemiş. Vallahi ben, onunla birlikde ikibinden fazla namaz kılmişımdır. hadîsi Buhârî «Kitâbü'l-Cumua» da; Tirmizî «Kitâ-hü's-Salât» da tahrîc etmişlerdir. Ahmed ile Bezzâr, Ebû Ya'lâ ve Taberânî onu İbn Abbâs (radıyallahü anh)'dan rivâyet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1997,
			"arabicnumber": "863.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1998,
			"arabicnumber": "863.02",
			"text": "(Bize bu hadîsi Ebû Bekir b. Ebî Şeybe de rivâyet etti. ki): Bize Abdullah b. İdrîs, Husayn'dan bu isnâdla rivâyet etti. (Yalnız o): «Resûlüllah (sallallahü aleyhi ve sellem) hutbe okurken...» demiş «ayakta» kelimesini söylememişdir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1999,
			"arabicnumber": "863.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2000,
			"arabicnumber": "863.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2001,
			"arabicnumber": "864",
			"text": "(Bize Muhammedü'bnü’l-Müsennâ ile İbn Beşşâr rivâyet ettiler. Dediler ki: Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be, Mansûr'dan, o da Amr b. Mürra'dan, o da Ebû Ubeyde'den, o da Kâ'b b. Ucra'dan naklen rivâyet etti. ki: mescide girdi. Abdurrahmân b. Ümmi Hakem oturduğu yerden hutbe okuyordu. Kâ'b: Şu habise bakın! Oturduğu yerden hutbe okuyor. Hâlbuki Allahü teâlâ (onlar bir ticâret veya eğlence gördükleri vakit, ona doğru sökün ettiler de seni ayakta bıraktılar.) buyuruyor; dedi.» isnadında Hazret-i Ka'b’ın mescide girdiğini ve «şu habise bakın!..» dediğini söyliyen zât ya Ebû Ubeyde yahut bizzat Kâ'b Ucra'dır. Böyle kendisi için «Ben» demek lâzımken, ismini söyliyen râvîlere çok tesadüf olunur. Onlar, bunu ya tevâzuan yahut da başka bir nükteden dolayı yaparlar. Kâ'b’ın okuduğu âyeti istidlali şöyledir: Allahü teâlâ hazretleri, Peygamber (sallallahü aleyhi ve sellem)’in ayakta hutbe okumakda olduğunu haber vermişdir. Binâenaleyh Abdurrahmân’ın da hutbeyi ayakta okuması îcâb ederdi. Çünkü Teâlâ Hazretleri için Resûlüllah'da güzel bir örnek vardır» buyurduğu gibi, bir bir âyetde: «Ona tâbi' olun!»,'başka bir âyetde de «Resul size ne getirirse, onu hemen alın!» buyurmuşdur. (sallallahü aleyhi ve sellem) dahi «Benİ nasıl namaz kılarken gördüyseniz, siz de öyle kılın!» emrini vermişdir. Kâ'b’ın bu sözleri büyüklerin münkerât işlediğim görünce onları, bundan vazgeçirmeye çalışmak lâzım geldiğine delildir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2002,
			"arabicnumber": "865",
			"text": "(Bana Hasen b. Aliy El-Hulvânî rivâyet etti. ki): Bize Ebû Tevbe rivâyet etti. ki): Bize Muâviye —ki İbn Sellâm'dır—, Zeyd'den (yani kardeşinden) naklen rivâyet etti. Zeyd, Ebû Sellâm'dan dinlemiş. Ebû Sellâm ki: Bana, Hakem b. Mînâ rivâyet etti. Ona da Abdullah b. Ömer ile Ebû Hüreyre rivâyet etmişler. Onlar da Resûlüllah (sallallahü aleyhi ve sellem)'i minberinin basamakları üzerinde şöyle buyururken işitmişler: bir takım adamlar cuma namazlarını terk etmekden vazgeçerler yahut Allah, onların kalplerine muhakkak sûrefde mühür vurur,da bir daha gafillerden olurlar!» Terketmek, demekdir. Nahiv ulemâsı «Yedeu» kelimesinin masdarı ile mazisinin araplar tarafından kullanılmadığını iddia etmişlerdir. Hadîs-i şerif onların bu iddiasını reddetmektedir. Resûl-i Ekrem (sallallahü aleyhi ve sellem)’in araplann en fasihi olduğunda şüphe yokdur. Bu hadîsde «yedeu» fiilinin masdarını, başka bir hadîsde de mazisini kullandığına göre nahiv ulemâsının bu husûsdaki iddiaları yersiz kalır. Mühürlemek ve Örtmek, mânâlarına gelir. Reyn de ayni mânâya kullanılır. Bazıları aralarında fark görmüş ve: «Reyn: Biraz mühürlemek; tab': Biraz kilitlemek; ikfâl: muhkem sûretde kilitlemek, mânâlarına gelir.» demişlerdir. İyâz'ın beyânına göre bu lâfızların mânâsı hususunda kelâm ulemâsı ihtilâfa düşmüşlerdir. Ehl-i sünnet ulemâsı: «Bunlardan murâd: Kalpde küfrü halketmekdir.» demişlerdir. lütuf ve hayır sebeplerinin yokluğu mânâsına geldiğini, bir takımları da bunlar cuma namazına gelmiyenlerin aleyhine şehâdet kas-dedildiğini söylemişlerdir. Hattâ: «Bu bir alâmetdir, Allahü teâlâ onu cuma namazına gitmeyenlerin kalplerinde yaratır. Melekler hangi kulun medhe hangisinin zemme lâyık olduğunu, bu alâmetden anlarlar.» diyenler olmuşdur. sünnet ulemâsından bâzılarına göre lütuf: Tâatı halk etmekdîr. Bir takımları: «Tâata kudret halketmekdir.» demişlerdir. Binâenaleyh hadîs-i şerîfdeki «kalperi mühürleme»den murâd: Ehl-i sünnete göre küfrü halketmekdir. Mâce'nin Hazret-i Câbir'den rivâyet ettiği şu hadîs de bu mânâyı te'yîd eder: teâlâ cum'âyı size bu sene, bu ayda, bu günde, benim şu ma-kaamımda kıyâmete kadar farz kıldı. İmdi her kim benim hayâtımda veya benden sonra âdil yahut zâlim bir İmâmı olduğu hâlde cum'âyı hakîr görerek veya inkâr ederek kılmazsa, Allah onun İki yakasını bir yere getirmesin ve işinde ona bereket vermesin! iyi bilin ki tevbe edinceye kadar o kimsenin namazı, zekâtı, haca ve orucu yokdur. Onun hiç bir hayrı yokdur. Tevbe edenin tevbesini Allah kabul eder.» bu sözü gerekse onun üzerine atfedilen gaflet mes'elesini: «Allahü teâlâ’nın lütfü değil de, onun zıddı olan hizlânı yaratmasıdır.» şeklinde, tefsir mu'tezilenin kavlidir. Onlar kalplerin mühürlenmesini bu mânâya almışlardır. Mu'tedle taifesi «Kul, fi'lini kendi yaratır.-» iddiasında bulundukları için lütfü bu iddiaya muvafık sûretde tarife çalışmış ve: «Lütuf, Allahü teâlâ’nın kulda yarattığı beyyine, akıl ve idrâk gibi bir şeydir ki, o şey bulunduğu vakit kulun îmân edeceğini bilir.» demişlerdir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2003,
			"arabicnumber": "866.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2004,
			"arabicnumber": "866.02",
			"text": "Bize Hasen b. Rabî' ile Ebû Bekr b. Ebî Şeybe rivâyet ettiler. Dediler ki: Bize Ebû'l-Ahvas, Simâk'den, o da Câbir b. Semura'dan naklen rivâyet etti. Câbir Şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem) ile birlikte namaz kılardım Onun namazı orta, hutbesi dahi orta idi.»",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2005,
			"arabicnumber": "867.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2006,
			"arabicnumber": "867.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2007,
			"arabicnumber": "867.03",
			"text": "(Bize Abd b. Humeyd rivâyet etti. ki): Bize Hâlid b. Mahled rivâyet etti. ki): Bana Süleyman b. Bilâl rivâyet etti. ki): Bana Ca'fer b. Muhammed, babasından naklen rivâyet etti. ki: Câbir b. Abdüllâh’ı: (sallallahü aleyhi ve sellem)’in cuma günkü hutbesi şöyle idî: (evvelâ) Allaha hamdü sena eder, sonra onun ardınca sesi yükselmiş olarak konuşurdu... diyerek yukariki hadîs gibi rivâyet ederken işittim",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2008,
			"arabicnumber": "868",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2009,
			"arabicnumber": "869",
			"text": "(Bana Süreye b. Yûnus rivâyet etti. ki): Bize Abdurrahmân b. Abdilmelik b. Ebeer, babasından, o da Vâsıl b. Hayyân'dan naklen rivâyet etti. ki: Ebû Vâil şunları söyledi: Bize Ammâr hutbe okudu, ama hutbeyi hem kısa; hem de beelîğ bir şekilde okudu. Minberden inince (kendisine). Yâ Ebe'l-Yakzân! Hakîkaten vecîz ve belîg bir hutbe îrâd ettin. Biraz daha uzatsan iyi ederdin, dedik. Bunun üzerine Ammâr: Ben, Resûlüllah (sallallahü aleyhi ve sellem)'i: ki kişinin namazı uzun, hutbeyi kısa tutması anlayışlı olduğuna alâmetdir. Binâenaleyh siz, namazı uzun tutun fakat hutbeyi kısa kesin. Muhakkak beyânın sihir olanı vardır.» buyururken işittim, dedi. hadîsin isnadı hakkında Dârakutnî istidrâkde bulunmuş ve: «Hadîsi Vâsıl'dan yalnız İbn Ebcer rivâyet etmişdir. A'meş'in rivâyeti buna muhâlifdir. Hâlbuki A'meş, Ebû Vâil hadisini daha iyi bellemişdir. O, bu hadîsi Ebû Vâil'den, Ebû Vâil de Hazret-i İbn Mesûd'dan rivâyet etmişdir, demişse de, evvelce de gördüğünüz vecihle bu gibi istidrâklerin bir kıymeti yokdur. Çünkü İbn Ebcer mevsuk ve mütemed bir râvîdir. Mevsuk rivâyeti ise makbuldür. şerif namazın hafif kılınmasını emreden meşhur hadîslere muhalif değildir. Zira Bâbımızın birinci hadîsinde Resûlüllah (sallallahü aleyhi ve sellem)’in gerek namazının, gerekse hutbesinin orta derecede olduklarını görmüştük. Buradaki namazın uzunluğundan murâd: Alelıtlak değil, hutbeye nisbetle namazın daha uzun olmasıdır. Yani hutbe esâs itibârı ile kısa olacak; ona nisbetle namaz, biraz daha uzun tutulmakla yine orta dereceyi bulacakdır. . beyânın sihir olanı vardır.» cümlesi hakkında Kâdı îyâz iki te'vîl bulunduğunu söylemişdir. Birinci te'vîle göre bu cümleden murâd: Zemm'dir. Çünkü beyânın bâzısı kalpleri cezbeder. Ve adetâ sihirlemiş gibi onları istediği yere çekerek tıpkı sihir gibi günâha girmesine sebeb olur. Bundan dolayıdır ki İmâm Mâlik «El-Mu vatta'» da bu hadîsi mekruh sözler meyânında zikretmişdir. Bu hadîs hakkında onun mezhebi de budur. te'vîle göre, bu cümle medh ifâde eder. Çünkü Allahü teâlâ hazretleri kullarına beyânı öğretmiş olmakla imtinânda bulunmuş ve onu sihire benzetmişdir. Zîra sihire olduğu gibi beyâna da kalpler meyleder. Esâs itibârı ile sihir, sarfetmek yani değiştirmek, demekdir. Beyân da kalpleri değiştirerek davet ettiği tarafa çeker. bu ikinci te'vîlin sahîh ve muhtar olduğunu söylemektedir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2010,
			"arabicnumber": "870",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2011,
			"arabicnumber": "871",
			"text": "Bize Ebû Bekir b. Ebi Şeybe AU Muhammed b. Abdillâh b. Nümeyr rivâyet ettiler. Dediler ki: Bize Vekî', Süfyân'dan, o da Abdüla-zîz b. Ruf ey'den, o da Temîm b. Taraf e'den, o da Adiyyu'bnu Hâtîm’den naklen rivâyet etti ki, Bir adam Peygamber (sallallahü aleyhi ve sellem)’in yanında hutbe okuyarak: Her kim Allah ve Resûlüne itaat ederse, muhakkak doğru yolu bulmuşdur. Onlara isyan eden ise muhakkak sapmişdır; demiş. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem): ne fena hatîbsin! (onlara diyeceğine) Allah ve Resûlüne isyan eden İse muhakkak sapmışdır de.» buyurmuşlar. «Gavâ» kelimesini «Gaviye» şeklinde söyledi. îyâz'in beyânına göre, ulemâdan bir cemâat: «Resûlüllah (sallallahü aleyhi ve sellem)’in hatibe îtirâz etmesi: zamiri ortak kullanarak, Resûlüllah (sallallahü aleyhi ve sellem)’i Allahü teâlâ ile müşterek yaptığı içindir. Zîra tesniye zamiri müsâvaat îcâb eder. Resûlüllah (sallallahü aleyhi ve sellem) hiç bir zaman Allahü teâlâ ile müsavi tutulamı-yacağı cihedle cümleyi tesniye zamiri ile değil, ayrı ayrı isimlerini zikrederek atıf sureti ile tertîb etmesi gerekirdiğini kendisine tembih buyür-muşdur. Nitekim Peygamber (sallallahü aleyhi ve sellem) başka bir hadîsde: biriniz Allah ile filan zât dilerse, demesin. Lâkin Allah dilerse sonra filan da dilerse, desin.) buyurmuşlardır.» diyorlar. Fakat Kâdi İyâz bu ta'lîli beğenmemiş, ve şunları söylemişdir: «Doğrusu Resûlüllah (sallallahü aleyhi ve sellem)'in o hatibi nehiy buyurmasına sebeb şudur ki: Hutbelerde esâs, açık ve izahlı olmakdır. Onlarda rumuz ve îşâretden sakınmalıdır. Bundan dolayıdır ki sahih rivâyetlerde sabit olduğuna göre Resûlüllah (sallallahü aleyhi ve sellem) bir kelimeyi söyledimi, iyice anlaşılması için onu üç defa tekrar edermiş. Birinci kavil bir çok sebeplerden dolayı zayıfdır. O, sebeplerden biri de şudur: gibi tesniye zamirleri Resûlüllah (sallallahü aleyhi ve sellem)’in bir çok sahîh hadîslerinde tekerrür etmişdir. Nitekim Peygamber (sallallahü aleyhi ve sellem): Allah ile Resûlü başkalarından daha sevgili olmalıdırlar.» buyurmuşlardır. Bu gibi hadîsler çoktur. Mezkûr hadîslerde tesniye zamî-ri kullanması, vaaz hutbesinde söylenmiş olmadıkları içindir. hadîsler, bir hükmü öğretmekden ibâretdirler. Böyle yerlerde söz ne kadar az olursa, bellemek de o kadar kolaylaşır. Va'z hutbelerinde ise hâl böyle değildir. Onlardan murâd: Söylenilenleri bellemek, değildir. Maksat, ibret almakdan ve nasihati tutmakdan ibâretdir: Ebû Dâvûd'un sahîh bir isnâd ile İbn Mes'ûd (radıyallahü anh)'dan rivâyet ettiği şu hadîs de ayni müddeâyı te'yîd eder: (sallallahü aleyhi ve sellem), bize hacet hutbesini öğretti. Bu hutbe şöyledir: Hamd Allah'a mahsûsdur. Biz, ondan yardım diler; ondan mağfiret niyaz eyler; nefislerimizin şerlerinden Allah'a sığınırız. Allah kime hidâyet verdiyse artık o kimseyi yoldan çıkaracak yokdur. Bir de kîmi şaşırttı ise, ona da hidâyet verecek yokdur. Ben, Allah’dan başka ilâh olmadığına şehâdet ederim; Muhammed'in, onun kulu ve Resûlü olduğuna da şahidim. Allah, onu hak dînle bir beşîr ve nezir olarak kıyâmetin önünde göndermişdir. Her kim Allah ve Resûlüne itaat ederse, muhakkak doğru yolu bulmuşdur. Onlara isyan eden ise şüphesiz yalnız kendisine zarar vermişdir. Allah'a hiç bir zarar îraz edemez.» (sallallahü aleyhi ve sellem) Ashâb-ı kirâm'ma hitabet tâlimleri yaptırmışdır. Sa'd b. Cübeyr tarîki ile Hazret-i Ebû'd-Derdâ’dan rivâyet olunan bir hadîsde: defa Peygamber (sallallahü aleyhi ve sellem) kısa bir hutbe okudu. Sonra: Yâ Ebâ Bekir! Kalk, bir hutbe de sen oku! buyurdu. Ebû Bekir kalkarak Resûlüllah (sallallahü aleyhi ve sellem)’in hutbesinden daha kısa bir hutbe okudu. Sonra Ömer'e: Yâ Ömer! Bir hutbe de sen oku! buyurdu. de Ebû Bekir'inkînden daha kısa bir hutbe okudu. Resûlüllah (sallallahü aleyhi ve sellem) daha başkalarına da bu minval üzre emir buyurarak hutbeler okuttu. Nihayet: Ey Ibnİ Ummi Abd! Şimdi de sen bir hutbe oku! buyurdu. İbn Mes'ûd hemen ayağa kalkarak Allahü teâlâ'ya hamd-ü senadan sonra şunları söyledi: Ey cemâat! Rabbimiz Allahü teâlâ'dır. Dînimiz: Azız islâm dîni; -Eliyle Peygamber (sallallahü aleyhi ve sellem)’e işaret ederek.- Peygamberimiz de şu zâtdır. Allah ve Resûlünün bizim için seçtikleri her haberi biz de beğendik; ona razı olduk. Es-Selamü aleyküm. üzerine Resûlüllah (sallallahü aleyhi ve sellem): İbn Ummü Abd isabet etti; İbn Ümmü Abd doğru söyledi, buyurdular.» denilnüşdir. İyâz diyor ki: « Müslim'in iki rivâyetinde (Gavâ) kelimesi vav'ın fetih ve kesri ile zaptedilmiş ise de, doğrusu fetihle okumakdır. Bu kelime, şerre düşkünlük göstermek, mânâsına gelen (gayy)’dan alınmışdır. İbn Nümeyr'in (gaviye) şeklindeki rivâyetini Kâdi İyâz doğru bulmamışdır",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2012,
			"arabicnumber": "872.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2013,
			"arabicnumber": "872.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2014,
			"arabicnumber": "873.01",
			"text": "(Bu hadîsi bana Ebû't-Tahir dahi rivâyet etti. ki): Bize İbn Vehb, Yahya b. Eyyûb'dan, o da Yahya b. Saîd'den, o da Amra'dan, o da Amra binti Abdirrahmân'ın kendinden büyük olan bir kız kardeşinden naklen Süleyman b. Bilâl hadîsi gibi haber verdi. hadîsin senedinde Hazret-i Amra'nın kız kardeşinin, ismi beyân edilmemişse de, hadîs-i şerif yine de hüccet olmağa sâlihdir. Çünkü Amra (radıyallahü anh)'nın kendinden büyük olduğu bildirilen bu kız kardeşi dahi sahâbîyyedir. Ashâb-ı kirâm’ın hepsi âdil ve mevsûk-durlar. Binâenaleyh onlardan herhangi birinin isminin bilinmemesi hadîsin sıhhatine zarar vermez. mezkûr kadının ezberlemek, için neden Kaaf sûresini ihtiyar ettiğini beyân etmiş ve ezcümle: bu sûre ölümü, Öldükden sonra dirilmeyi, şiddetli va'zları, te'-kidli yasakları ihtiva eder.» demişlerdir. şerif bundan önceki hadîs gibi hutbe esnasında Kur'ân okumanın meşru olduğuna delildir. Yine bu hadîs hutbede Kaaf sûresini veya hiç olmazsa onun bir kısmını okumanın müstehab olduğuna delildir. Bana Muhammed b. Beşşâr rivâyet etti. ki):. Bize, Muhammed b. Ca'fer rivâyet etti. ki): Bijte Şu'be, Huheyb'den, o da Abdullah b. Muhammed b. Ma'n'dan, o da Hârisetü'bnu Nu'mân’ın bir kızından naklen rivâyet etti. Şöyle dedi: Kaaf sûresini ancak Resûlüllah (sallallahü aleyhi ve sellem).'in (mübarek) ağzından belledim. Onu her cuma hutbede okurdu. Bizim tandırımızla, Resûlüllah (sallallahü aleyhi ve sellem)’in tandırı birdi.»",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2015,
			"arabicnumber": "873.02",
			"text": "(Bize, Amru'n-Nâkıd rivâyet etti. ki): Bize Ya'kûb b. İbrâhîm b. Sa'd rivâyet etti. ki): Bize babam, Muhammed b. İs-hâk'dan rivâyet etti. ki: Bana Abdullah b. Ebî Bekir b. Muhammed b. Amr b. Hazm El-Ensârî, Yahya b. Abdillâh b. Abdirrahmân b. Sa'd b. Zürâra'dan, o da Ümmü Hişâm binti Hârisete'bni Nu'mân'dan naklen rivâyet etti. Ümmü Hişâm Şöyle dedi: iki sene yahut bir seneden biraz fazla müddet zarfında bizim tandırımızla Resûlüllah (sallallahü aleyhi ve sellem)’in tandırı birdi. Ben Kaaf sûresini ancak Resûlüllah (sallallahü aleyhi ve sellem)'in dilinden öğrendim. Onu her cuma cemaata hutbe îrâd ederken minberde okurdu. hadîsin senedindeki Sa'dü'bnu Zürâra hakkında Bazıları Es'adü'bnu Zürâra demişlerdir. Fakat Kâdi İyâz'in beyânına göre doğrusu burada olduğu gibi Sa'd'dır. Bütün nüshalarda bu isim Sa'd olarak zikre dilmişdir. Yanlız Hâkim (321-405): «Doğrusu, Es'ad'dır. Bazıları Sa'd olduğunu söylemişlerdir.» demiş ve bunu böylece Buhârî'den rivâyet ettiğini bildirmiş-se de, Buhârî'nin târihinde bunun zıdınm kaydedildiği görülmektedir. Buhârî: «Bu zât'ın ismi Sa'd'dır. Es'ad olduğunu söy-liyenler de vardır. Fakat bu bir vehimden ibâretdir.» demektedir. Bu suretle Hâkim'in sözü kendi aleyhine inkilâb etmiş olur. Zürâra, Hazrec kabilesinin reisidir. Bu hadîsde zikri geçen Sa'dü'bnu Zürâra onun kardeşidir. Sa'd Yahya ile Amra'nın dedeleridir. Sa'd islâmiyete yetişmişdir. Ancak kendisi bazılarınca münafıklar zümresinden sayıldığı için bir çok siyer ulemâsı onu sahabe meyânında zikretmemişlerdir. birinci rivâyetinde Hârisetü'bnu Nu'mân’ın kızı Nekire olarak zikredilmişse de, ikinci rivâyetde isminin Ümmü Hişâm olduğu bildirilmişdir. Hazret-i Ümmü Hişâm: tandırımızla, Resûlüllah (sallallahü aleyhi ve sellem)'in tandırı birdi.» demekle, evinin Resûlüllah (sallallahü aleyhi ve sellem)’in evine pek yakın olduğuna ve bu suretle Peygamber (sallallahü aleyhi ve sellem)’in hâllerini herkesden ziyâde vâkıf olup, onları bellediğine işaret etmişdir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2016,
			"arabicnumber": "873.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2017,
			"arabicnumber": "874",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2018,
			"arabicnumber": "875.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2019,
			"arabicnumber": "875.02",
			"text": "Bize Ebû Bekr b. Ebî Şeybe ije Ya'kubu Devrakî, İbn Uleyye’den, o da Eyyûb'dan, o da Amr'dan, o da Peygamber (sallallahü aleyhi ve sellem)’den naklen Hammâd'ın dediği gibi rivâyet etti. Yalnız (burada râvî) iki rekâtı zikretmemiştir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2020,
			"arabicnumber": "875.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2021,
			"arabicnumber": "875.04",
			"text": "(Bana Muhammed b. Râfi' ile Abd b. Humeyd rivâyet ettiler. İbn Râfi' dedi ki: Bize Abdürrezzâk rivâyet etti. ki): Bize İbn Cüreyc haber verdi. ki): Bana Amr b. Dînâr haber verdi. O da Câbir b. Abrîillâhı şöyle derken işitmiş: Peygamber (sallallahü aleyhi ve sellem) cuma günü minberde hutbe okurken bir adam geldi. Resûlüllah (sallallahü aleyhi ve sellem) ona: iki rekât namaz kıldın mı?» diye sordu Gelen zât: Hayır; cevâbını verince Resûlüllah (sallallahü aleyhi ve sellem): buyurdular",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2022,
			"arabicnumber": "875.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2023,
			"arabicnumber": "875.06",
			"text": "(Bize Kuteybetti'bnü Saîd rivâyet etti. ki): Bize Leys rivâyet etti. Muhammed b. Rumh rivâyet etti. ki): Bize Leys, Ebû'z-Zübeyr’den oda Câbir'den naklen haber verdi, ki Şöyle dedi: Cuma günü Resûlüllah (sallallahü aleyhi ve sellem) minber üzerinde otururken Süleyk-i Gatafânî geldi; ve namaz kılmadan oturdu. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) ona: iki rek'ât namaz kıldın mı?» diye sordu. Süleyk: Hayır, cevabını verdi. Rasûlüllah (sallallahü aleyhi ve sellem): da onları kıl!» buyurdular",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2024,
			"arabicnumber": "875.07",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2025,
			"arabicnumber": "876",
			"text": "(Bize, Şeybân b. Ferrûh rivâyet etti. ki): Bize Süleyman b. Mugîra rivâyet etti. ki): Bize Humeyd b. Hilâl rivâyet etti. ki: Ebû Rifâ'a şunları söyledi: (sallallahü aleyhi ve sellem)’in yanına vardım; hutbe okuyordu: Ya Resûlallah! Yabancı, dînini sormaya gelmiş; dîninin ne olduğunu bilmeyen bir adamım, dedim. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) bana döndü ve hutbesini bırakarak tâ yanıma kadar geldi. Kendisine bir sandalye getirdiler. Zannederim ayakları demirdendi. Resûlüllah (sallallahü aleyhi ve sellem) bu sandalyenin üzerine oturarak, Allah'ın kendisine öğretmiş olduğu bilgilerden bana da öğretmeye başladı. Sonra tekrar hutbesine dönerek, onu sonuna kadar tamamladı.» hadîsde zikri geçen «Hasibtu» fiili «Sahîh-i Müslim den başka kitaplarda «Hiltu» şeklinde rivâyet edilmişidr. Bu fiillerin ikisi de «zann ederim» manasınadır. îyâz’ın beyânına göre İbn Hazza' rivâyetinde bu fiilin yerine «Haşeb» denilmiş; İbn Kuteybe'nin kitabında ise kelime «Hulb» şeklinde zaptedümişdir. Haşeb: Odun, demekdir. «Hulb» veya «Hulûb» lîf yani hurma kabuğu mânâsına gelir. Fakat Kâdi İyâz, bunların hatâ olduğunu söylemiş: «Doğrusu: Zannederim, mânâsına gelen (Hasibtu)'dur. Nitekim «Sahîh-i Müslim» ile diğer mûtemed kitaplarda da böyledir.» demişdir. Ebû Rifâa'nın kendisi için «Yabancı bir adam ilâh...» demesi, suâl soran kimsenin nezaketli davranması ve suâlini âlim bir zâta sorması lüzumuna delildir. Bundan mâada hadis-i şerifden şu hükümler çikarılmışdır:",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2026,
			"arabicnumber": "877.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2027,
			"arabicnumber": "877.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2028,
			"arabicnumber": "878.01",
			"text": "Bize Yahya b. Yahya ile Ebû Bekir b. Ebî Şeybe ve İshâk toptan Cerîr'den rivâyet ettiler. Yahya dedi ki: Bize Cerîr, İbrahim b. Muhammed b. Münteşîr'den, o da babasından, o da Nu'mân b. Beşîr'-in azatlısı Habîb b. Sâlim 'den, o da Nu'mân b. Beşîr'den naklen haber verdi. Nu'mân Şöyle dedi: (sallallahü aleyhi ve sellem) bayramlar ile cumâ'da A'lâ ve Gâşiye sûrelerini okurdu. cuma ayni güne tesadüf ederse, bu sûreleri her iki namazda okurdu.»",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2029,
			"arabicnumber": "878.02",
			"text": "(Bize, bu hadîsi Kuteybetü'bnü Saîd de rivâyet etti. ki): Bize, Ebû Avâne, İbrahim b. Muhammed b. Münteşir'd en bu isnâdla rivâyet etti",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2030,
			"arabicnumber": "878.03",
			"text": "(Bize Amru'n-Nâkıd rivâyet etti. ki): Bize Süfyân b. Uyeyne, Damratü'bnü Saîd'den, o da Ubeydillâh İbn Abdillâh'dan naklen rivâyet etti. Ubeydullah Şöyle dedi: b. Kays, Nu’mân b. Beş'r'e mektup yazarak Resûlüllah (sallallahü aleyhi ve sellem)’in cuma günü, Cuma sûresinden başka neyi okuduğunu sordu.. Nu'mân: Gâşiye sûresini okurdu, cevâbını verdi.» hadîste Resûlüllah (sallallahü aleyhi ve sellem)’in bayram namazlarında A'lâ ve Gâşiye sûrelerini okurduğu bildiriliyor. Başka bir hadîsde Bayram namasında Kaaf ile İkterabet sûrelerini okuduğu beyân edilmişdir. diyor ki: «Bu rivâyetlerin ikisi de sahîhdir. Resûlüllah (sallallahü aleyhi ve sellem) bâzı vakitler cuma namazında Cuma ve Münâfikûn sûrelerini, bazen de A'lâ ve Gâşiye sûrelerini okur; icâbında bayramlarda Kaaf ile İkterabet sûrelerini, kimi de Sebbih ve Gâşiye' sûrelerini okurdu.» şerif, bayramlarda bu sûreleri okumanın müstahab olduğuna delildir. ile Cuma bir güne geldikleri vakti her iki namazda da bu sûrelerin okunması müstahab olur. Bundaki hikmet: Cuma namazını hafif tutmak ve bu suretle uzaklardan cuma namazına gelenlerin bayram gününü mümkün mertebe aileleri arasında geçirmelerini sağlamakdır",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2031,
			"arabicnumber": "879.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2032,
			"arabicnumber": "879.02",
			"text": "(Bize İbn Nümeyr rivâyet etti. ki): Bize babam rivâyet et- Ebû Küreyb de rivâyet etti. ki): Bize Vekî' rivâyet etti. Bu râvîlerin ikisi de Süfyân'dan bu hadîsin mislini rivâyet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2033,
			"arabicnumber": "879.03",
			"text": "(Bize Muhammed b. Beşşâr rivâyet etti. ki): Bize Muhammed b. Ca'fer rivâyet etti. ki): Bize Şu'be Muhavvel'den bu isnâdla, bu hadîsin mislini her iki namaz hakkında da Süfyân'ın dediği gibi rivâyet etti",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2034,
			"arabicnumber": "880.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2035,
			"arabicnumber": "880.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2036,
			"arabicnumber": "881.01",
			"text": "(Bize Yahya b. Yahya rivâyet etti. ki): Bize Hâlid b. Abdüllâh, Süheyl'den, o da babasından, o da Ebû Hüreyre'den naklen haber verdi, Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): cuma'yi kıldımı arkasından dört rekat namaz daha kılsın.» buyurdular",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2037,
			"arabicnumber": "881.02",
			"text": "Bize Ebû Bekir b. Ebî Şey be ile Amru'n-Nâkid rivâyet ettîler. Dediler ki: Bize Abdullah b. İdrîs, Süheyl'den, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etti. Ebû Hüreyre şöyle dedi. Resûlüllah (sallallahü aleyhi ve sellem): sonra namaz kılacaksanız dört rek'ât kılın.» buyurdular. kendi rivâyetinde şu ibareyi ziyâde etmişdir: «İbn İdris dedi ki: şunları söyledi: Eğer seni her hangi bir şey acele ettiriyorsa, mescidde iki rek'at namaz kıl; evine döndüğün zaman iki rek'at daha",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2038,
			"arabicnumber": "881.03",
			"text": "(Bana Züheyr b. Harb rivâyet etti. ki): Bize Cerir rivâyet etti. H. Amru'n-Nâkıd ile Ebû Küreyb dahi rivâyet ettiler. Dediler ki: Bize Vekî', Süfyân'dan rivâyet etti. Cerîr ile Süfyân'ın ikisi birden Süheyl'den, o da babasından, o da Ebû Hüreyre'den naklen rivâyet etmişler. Ebû Hüreyre şöyle dedi: Resûlüllah (sallallahü aleyhi ve sellem): her kim cumâ'dan sonra namaz kılacaksa dört rek'ât kılsın.» buyurdular. rivâyetinde: «Sizden.» tâbiri yokdur",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2039,
			"arabicnumber": "882.01",
			"text": "(Bize Yahya b. Yahya ile Muhammed b. Rumh rivâyet ettiler. Dediler ki: Bize Leys \"haber verdi. H. Kuteybe de rivâyet etti. ki): Bize Leys, Nâfi'den, o da Ab-dullah'dan naklen rivâyet etti ki Abdullah cumâ'yı kıldımı mescidden giderek evinde İki rek'at namaz kılar sonra: (sallallahü aleyhi ve sellem) böyle yapardı, dermiş",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2040,
			"arabicnumber": "882.02",
			"text": "Bize Yahya b. Yahya rivâyet etti. ki: Mâlik'e Nâfi’den duyduğum, onun da Abdullah b. Ömer'den naklettiği şu hadîsi okudum: Abdullah, Resûlüllah (sallallahü aleyhi ve sellem)’in nafile namazını tavsif ederek, Şöyle dedi: (sallallahü aleyhi ve sellem) cuma namazından sonra mescidden ayrılmadıkça (nafile) namaz kılmazdı. Sonra evinde iki rek'âf namaz kılardı.» «Zannederim sonra kılardı, diye okudum; yahut: Yüzde yüz öyle okudum.» dedi",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2041,
			"arabicnumber": "882.03",
			"text": "(Bize Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb ve İbn Nümeyr rivâyet ettiler. Züheyr dedi ki: Bize Süfyân b. Uyeyne rivâyet etti. ki): Bize Amr, Zührî'den, o da Sâlim'den, o da babasından naklen rivâyet etti ki, Peygamber (sallallahü aleyhi ve sellem) Cuma’dan sonra iki rek'ât namaz kılarmiş",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2042,
			"arabicnumber": "883.01",
			"text": "(Bize Ebû Bekir b. Ebi Şeybe rivâyet etti. ki): Bize Gunder, İbn Cüreyc'den rivâyet etti. ki: Bana Ömer b. Atâ' b. Ebi'l-Huvâr haber verdi ki Nâfi' b. Cübeyr, kendisini Sâib İbn Uht-i Nemir'e göndererek Muâviye'nin namaz hususunda onda gördüğü bir şey'i sordurmuş. Sâib şu cevâbı vermiş: ben onunla birlikde Maksûre'de cuma namazını kıldım. İmâm selâm verince ben olduğum yerde ayağa kalkarak namaz kıldım. (Muâviye) içeriye girince bana: Bir daha böyle yapma! Cumâ'yı kıldığın vakit konuşmadıkça yahut oradan çıkmadıkça ona başka namaz ekleme. Çünkü Resûlüllah (sallallahü aleyhi ve sellem) bize, bunu (yani) konuşmadıkça yahut mescıdden çıkmadıkça hiç bir namazın, başka namaza eklenmemesini emretti dıye haber gönderdi.»",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2043,
			"arabicnumber": "883.02",
			"text": "(Bize Hârûn b. Abdillâh rivâyet etti. ki): Bize Haccâcu bunu Muhammed rivâyet etti. ki: İbn Cüreyc: Bana Ömer b. Ata' haber verdi ki, Nâfi' b. Cübeyr, kendisini Sâib b. Yezîd İbn Uht-i Nemir'e göndermiş... diyerek hadisi yukarki hadîs tarzında rivâyet etti. Şu kadar var ki Amr (burada): verince olduğum yerde ayağa kalktım.» demiş: «İmâm»! zikretmemişdir. hadîslerin Bazıları cuma namazından sonra dört rek'at, Bazıları da iki rek'at sünnet kılınacağına delâlet etmektedirler. diyor ki: «Bu hadîslerin cumâ'nın farzından sonra sünnet kılmanın müstahab olduğu ve sünneti kılmağa teşvik olduğu gibi sünnetin en az iki. en çok da dört rek'at kılınacağına tenbih vardır. Yani Resûlüllah (sallallahü aleyhi ve sellem): cumâ'dan sonra namaz kılacaksa, Dört rek'at olarak kılsın; buyurmakla sünnetin dört rek'at kılınmasına tembih buyurmuş, emir sîgasi ile de buna teşvîkde bulunmuşdur. kim namaz kılacaksa...) buyurması, bu namazın vâcib değil; sünnet olduğuna tenbîh içindir, ört rek'atı faziletinden dolayı zikretmiş, bazen de sünnetin en az iki rek'at kılınacağını beyân için, onu iki rek'at kılmışdır. Malûmdur ki Resûlüllah (sallallahü aleyhi ve sellem) ekseri vakitlerde cuma namazının sünnetini dört rek'at olarak kılardı. Çünkü dört kılmayı bize de emir buyurmuş; teşvîkde bulunmuşdu. Emrettiği bir hayrı işlemeğe kendisi elbette herkesden ziyâde rağbet ve hırs gösterir ve bu husûsda herkesden evlâdır.» (71 numaralı) hadîsinde râvî Yahya'nın: «Zannederim sonra kılardı, diye okudum. Yahut: Yüzde yür öyle okudum.» demesi. «Sonra kılardı.» ifâdesini okuyup okumadığında tereddüt ettiğindendir. Aficak buradaki tereddütü zan ile yakîn arasındadır. Yani bu kelimeyi ya yüzde yüz okudum, yahut okuduğumu zannediyorum, demek istemişdir. Yahya büyük bir âlim ve hafız olmakla beraber pek ziyâde verâ' ve takva sahibi olduğundan bir çok hadîslerin lâfızlarında şüphe edermiş. Hattâ Ka adı İyâz'in beyânına göre kendisine «şekkâk» yani şüpheci Yahya derlermiş. Mescidin içine yapılan odacıkdır. Bunu ilk defa ihdas eden Hazret-i Muâviye olmuşdur",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 93
			}
		}
	]
}