{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"8": "The Book of Prayer - Two Eids"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2044,
			"arabicnumber": "884.01",
			"text": "Bana Muhammed b. Râfi' ile Abd b. Humeyd hep birden Abdürrezzâk'dan rivayet ettiler. İbni Râfi' dediki: Bize, Abdürrezzak rivayet etti. (dediki): Bize ibni Cüreyc haber verdi (dediki): Bana Hasen b. Müslim, Tâvûs'dan, o da İbni Abbâs'dan naklen haber verdi. İbni Abbâs şöyle demiş: «Ramazan bayramı namazında Nebiyyullah (Sallallahu Aleyhi ve Sellem) Ebu Bekir, Ömer ve Osman ile beraber bulundum. Hepsi onu hutbeden önce kılar, sonra hutbe okurlardı. (Bir defa) Nebiyyullah (Sallallahu Aleyhi ve Sellem) minber’den indi; onun eliyle erkekleri oturttuğunu hala görür gibiyim. Sonra erkek saflarını yararak, kadınların yanına geldi; Bilal de beraberinde idi. Resulullah (Sallallahu Aleyhi ve Sellem)- (Ey Nebi ! Şayet mü'min kadınlar Allah'a hiç bir şey'i şerik koşmamak şartı ile sana bey'at etmeye gelirlerse... kabul et.) [Mümtehîne 12.] ayet-i kerimesini bitinceye kadar okudu. Onu bitirdiği vakit (kadınlara): — Siz, bu ayet de zikredilen şartlar üzere devam ediyor musunuz? diye sordu. İçlerinden bir tek kadın: — Evet, yâ Nebiyyallah! dedi. Resûlullah (Sallallahu Aleyhi ve Sellem)'e ondan başka cevap veren olmadı. O anda bu kadın’ın kim olduğu bilinmiyordu. Resûlullah (Sallallahu Aleyhi ve Sellem) : — O halde sadaka verin!., buyurdu. Bunun üzerine Bilal elbisesini yere yayarak: — Haydi buyurun! Annem babam size feda olsun... dedi. Artık kadınlar kimi halkalarını, kimi yüzüklerini Bilâl'in elbisesi içine atmaya başladılar.»",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2047,
			"arabicnumber": "885.01",
			"text": "Bize îshâk b. İbrahim İle Muhammed b. Râfi' rivayet ettiler. ibni Râfl dediki: Bize, Abdürrazzak 1rivayet etti. (dediki): Bize, ibni Cüreyc haber verdi, (dediki) Bana Ata', Câbir b. Abdillâh' dan naklen haber verdi. dediki: Ben, Câbir'i şöyle derken işittim.- Nebi (Sallallahu Aleyhi ve Sellem) Ramazan Bayramı günü kalkarak namaz kıldı ve hutbeden önce namazla işe başladı. Sonra cemaata hutbe okudu. Neblyyullah (Sallallahu Aleyhi ve Sellem) hutbeyî bitirince minberden indi. Ve kadınların yanına gelerek, onlara va'z-u nasîhatda bulundu. Kendisi Bilâl'in eline dayanıyordu. Bilâl ise elbisesini yaymıştı. Kadınlar (onun içine) sadaka atıyorlardı. Ben, Ata* (b. Rabâh)'a: «Kadınların bu verdikleri Ramazan Bayramı zekâtı mıydı?» diye sordum. — «Hayır. Lâkin bu, onların o zamana mahsûs verdikleri bir sadaka idi. Kadınlar yüzüklerini atıyor da atıyorlardı.» cevâbını verdi. — Şimdi de imamın hutbeyi bitirince kadınların yanına gelerek, onlara va'z-u nasîhatta bulunmasını, üzerine bir vecibe görüyor musun? dedim: — Evet, ömrüme yemin ederim ki bu onlar üzerinde gerçekden bir hakdır. Bunun için yapmazlar; bilmem, dedi",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2048,
			"arabicnumber": "885.02",
			"text": "Bize, Muhammed b. Abdillâh b. Numeyr ivayet etti (dediki): Bize, babam rivayet etti. (dediki): Bize, Abdülmelik b. Ebi Süleyman, Atâ'dan, o da Câbir b. Abdillâh'dan naklen rivayet etti Câbir şöyle demiş: Ben, Resûlullah (Sallallahu Aleyhi ve Sellem) ile birlikde bayram günü namazda bulundum, hutbeden önce ezan ve ikaametsiz olarak işe namazdan başladı. Sonra Bilâl'e dayanarak ayakta durdu ve Allah'dan korkmayı emretti. Ona taat'ı teşvîkde bulundu. Cemaata va'z-u nasihat etti. Sonra yürüdü, kadınların yanına gelince onlara va'z-u nasîhatda bulunarak: «Tesadduk edin! Zira çoğunuz cehennem odunu olacaksınız!» buyurdu. Bunun üzerine kadınlardan kara yağız güzeli biri kalkarak: — «Niçin yâ Resûlallah? diye sordu. Nebi (Sallallahu Aleyhi ve Sellem) — «Çünkü sizler hâlinizden çok şikâyet eder, kocalarınızın nimetine karşı küfranda bulunursunuz.» cevâbını verdi. Derken kadınlar kendi ziynetlerinden tesadduk etmeğe başladılar. Bilâl'ın elbisesi içine küpe ve yüzüklerini atıyorlardı",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2049,
			"arabicnumber": "886.01",
			"text": "Bana Muhammed b. Râfi' rivayet etti. (dediki): Bize Abdurrazzâk rivayet etti. (dediki): Bize, İbni Cüreyc haber verdi (dediki): Bana Ata', ibni Abbâs ile Câbir b. Abdullâh El-Ensari'den naklen haber verdi. Demişlerki: Gerek Ramazan Bayramı gerekse Kurban Bayramı günü ezan okunmazdı. (İbni Cüreyc diyor ki:) Bir müddet sonra ben, Atâ'ya bu mes'eleyi yine sordum, bana haber vererek, dediki: «Bana Câbir b. Abdillâh EI-Ensâri haber verdiki, Ramazan Bayramı günü gerek İmam minbere çıkarken gerekse çıktıktan sonra namaz için ezan, ikaamet, nida ve hiç bir şey yokmuş. O gün ne ezan varmış ne de İkaamet.»",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2050,
			"arabicnumber": "886.02",
			"text": "Bana Muhammed b. Râfi' rivayet etti. (dediki): Bize Abdurrazzâk rivayet etti. (dediki): Bize İbni Cüreyc haber verdi. (dediki) Bana, Atâ' haber verdi ki ibni Abbâs, ibni Zübeyr'e ilk biyat edildiği zaman ona: «Ramazan Bayramı günü, bayram namazı için ezan okunmazdı. Binâenaleyh onun için sen de ezan okutma!» diye haber göndermiş; o da, o gün bayram namazı için ezan okutmamış, ibni Abbâs, bu haberle blrlikde ibni Zübeyr'e: «Hutbe de namazdan sonra okunur. Bu, böyle yapılırdı.» diye haber göndermiş. Bunun üzerine ibni Zübeyr, bayram namazını hutbeden önce kıldırmış. İzah 888 de",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2051,
			"arabicnumber": "887",
			"text": "Bize Yahya b. Yahya ile Hasen b. Rabi, Kuteybetü'bnü Sald ve Ebû Bekir b. Ebî Şeybe rivayet etti. Yahya (Bize haber verdi) tâbirini kullandı. Ötekiler: Bize, Ebû'l-Ahvas, Simâk'den, o da Câbir b. Semura'dan naklen rivayet etti, dediler. Cabir şunları söylemiş: Ben, Resûlullah (Sallallahu Aleyhi ve Sellem) ile birlikde bayram namazlarını bir değil, iki değil; bir çok defalar ezan ve ikaametsiz olarak kıldım.» İzah 888 de",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2052,
			"arabicnumber": "888",
			"text": "Bize Ebû Bekir b. Ebî Şevbe rivayet etti. (dediki): Bize Abdetü'bnü Süleyman ile Ebû Usâme, Ubeydullah'dan, o da Nâfi'den, o da ibni Ömer'den naklen rivayet ettiki, Nebi (Sallallahu Aleyhi ve Sellem) ile Ebû Bekir ve Ömer bayram namazlarını hutbeden önce kılarlarmış. İzah îbni Abbâs ile Câbir ve İbni Ömer hadislerini Buhâri «Cum'a» bahsinde; ayrıca, İbni Abbâs hadîsini Ebû Dâvûd «Namaz» bahsinde tahric etmişlerdir. Abdullah b. Zübeyr'e ilk biat olunduğu zamandan murâd: hicri 64 târihinde Yezid b. Muâviye'nin yerine halife seçilmesidir. Nevevi diyorki: «Câbir hadisinde: (Ramazan Bayramı namazından ezan, ikaamet, nida ve hiç bir şey yokdur.) denilmesi, zahirine bakılırsa gerek bizim ulemâmızın, gerekse başkalarının (Toplayıcı namaza buyurun.) diye seslenmeyi müstebab saymalarına muhalif görünürse de, hadis-i şerif: Bayram namazı için ezan ikaamet ve bunların mânâsında bir şey yokdur, şeklinde te'vil olunur.»",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2053,
			"arabicnumber": "889",
			"text": "Bize Yahya b. Eyyûb ile Kuteybe ve İbni Hucur rivayet ettiler. Dedilerki; Bize İsmail b. Cafer, Dâvûd b. Kays'dan, o da Iyâz b. Abdillâh b. Sa'd'dan, o da Ebû Said-i Hudrî'den naklen rivayet ettij şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) Kurban ve Ramazan bayramı günleri musalla'ya çıkar ve evvelâ namazla işe başlardı. Namazını kıldı da, selâm verdimi ayağa kalkarak cemaata karşı dönerdi. Cemâat ise namazgahlarında otururlardı. Eğer (bu taraf'a) bir müfreze göndermeye ihtiyacı varsa, onu cemaata hatırlatır, bundan başka bir ihtiyâcı olursa, onu kendilerine emrederdi. (Hutbe esnasında): — Sadaka verin, sadaka verin, sadaka verin!» buyururdu. En ziyâde sadaka veren de kadınlar olurdu. Ondan sonra namazgâhdan ayrılırdı. Mervân b. Hakem zamanına kadar hâl, bu minval üzre devam etti. Bir def'â ben Mervân ile el ele vererek (namaza) çıktım. Namazgaha vardığımızda ne görelim! Kesîru'bnu Salt, çamurla kerpiçten bir minber yapmış. Bir de baktım Mervân'ın eli beni çekiştiriyor. Gâlibâ beni minbere doğru çekiyordu. Ben de onu namaza çekiyordum. Onun bu hâlini görünce: — «İş'e namazdan başlamak nerede kaldı?» dedim. Mervân: «Hayır, yâ Ebâ Said! Senin bildiğin (şekil) terk edildi.» dedi. — «Asla olamaz ! Nefsim kabza-i kudretinde olan Allah'a yemin ederim ki siz, benim bildiğimden daha hayırlısını yapamazsınız.» dedim. Ebû Saîd, bunu üç defa tekrârladıkdan sonra oradan ayrılmış",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2054,
			"arabicnumber": "890.01",
			"text": "Bana Ebû'r-Rabî' Ez-Zehrânî rivayet etti. (dediki): Bize, Hammâd rivayet etti. (dediki): Bize Eyyûb, Muhammed'den, o da Ümmü Atiyye'den naklen rivayet etti. Ümmü Atiyye, Peygamber (Sallallahu Aleyhi ve Sellem)'i kastederek: «Bize bayramlarda kocaya gitmemiş delikanlı kızlarla, perdenişin hanımları namazgaha çıkarmamızı; hayızlı kadınlara da Müslümanların namazgahından biraz uzaklaşmalarını emir buyurdu.» demiş",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2055,
			"arabicnumber": "890.02",
			"text": "Bize Yahya b. Yahya rivayet etti. (dediki): Bize Ebû Hayseme, Âsım-ı Ahval'den, o da Hafsa binti Sîrin'den, o da Ümmü Atiyye'den naklen haber verdi. Ümmü Atiyye şöyle demiş: Bayramlarda örtülü hanımlar ve bakire kızlarla beraber namazgaha çıkmaya me'mûr olurduk. Hayızlılar da çıkar fakat cemâatin arkasında bulunurlar; cemaatla beraber tekbîr alırlardı",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2056,
			"arabicnumber": "890.03",
			"text": "Bize Amru'n-Nakıd rivayet etti. (dediki): Bize îsâ b. Yûnus rivayet etti. (dediki): Bize, Hişâm, Hafsa binti Sîrin'den, o da Ümmü Atiyye'den naklen rivayet etti. Ümmü Atiyye şöyle demiş: «Bize, Resulullah (Sallallahu Aleyhi ve Sellem) Ramazan ve Kurban bayramlarında genç kızlarla hayızlı kadınları ve perdenişln hanımları (namazgaha) çıkarmamızı emretti. Ama hayızlı kadınlar namaz (gah) dan biraz uzak durur, hayırda ve Müslümanların dualarında hâzır bulunurlar, dedi. Ben: — Yâ Resûlallah! (Bazen) birimizin örtüsü bulunmuyor» dedim; Resûlullah (Sallallahu Aleyhi ve Sellem): — Ona din kardeşi, kendi cllbâblarından birini giydiriversin, buyurdu.»",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2059,
			"arabicnumber": "891.01",
			"text": "Bize Yahya b. Yahya rivayet etti. dediki: Mâlik'e Damratü'bnu Said-i Maziniden dinlediğim, onun da Ubeydullah b. Abdillah'dan rivayet ettiği şu hadisi okudum: Ömer b. el-Hattâb, Ebû Vâkıd-ı Leysi'ye: — «Resulullah (Sallallahu Aleyhi ve Sellem), Ramazan ve Kurban bayramı namazlarında ne okuyordu?» diye sormuş; o da: — «Resulullah (Sallallahu Aleyhi ve Sellem) onlarda sûre-i Kaat ile sûre-l İnşikaak'ı okurdu.» cevâbını vermiş",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2060,
			"arabicnumber": "891.02",
			"text": "Bize, İshak b. îbrâhim rivayet etti. (dediki) Bize, Ebû Amiri Akadî haber verdi, (dediki) Bize Füleyh, Damratü'bnu Said' den, o da Ubeydullah b. Abdillâh b. Utbe'den, o da Ebû Vâkıd-ı Leysi den naklen rivayet etti. Ebû Vâkıd şöyle demiş: «Ömerü'bnü'l-Hattâb, bana Resulullah (Sallallahu Aleyhi ve Sellem) bayram namazında neyi okuduğunu sordu; ben de. — «Sûre-l inşikaak ile Süre-l Kaaf'ı dedim.»",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2061,
			"arabicnumber": "892.01",
			"text": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (dediki): Bize, Ebû Usâme, Hişâm'dan, o da babasından, o da Âişe'den naklen rivayet etti. Âişe şöyle demiş: «(Bir defa) yanıma Ebû Bekir girdi, yanımda Ensâr'ın cariyelerinden iki câriye bulunuyor; Buâs harbinde ensâr'ın biribirlerine söyledikleri şiirleri terennüm ediyorlardı. Ama bu cariyeler şarkıcı değildiler. Ebû Bekir: — Resulullah (Sallallahu Aleyhi ve Sellem)'in evinde şeytan ıslığı mı çalıyorsun, hem de bayram gününde? dedi. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) : — Yâ Ebâ Bekir! Her milletin bir bayramı vardır; bu da bizim bayramımızdır.» buyurdular",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2062,
			"arabicnumber": "892.02",
			"text": "{….} Bize, bu hadîsi Yahya ile Ebû Kureyb hep birden Ebû Muâviye'den, o da Hişâm'dan naklen bu isnâdla rivayet ettiler. Bu hadîsde: «Yanımda defle oynayan iki câriye vardı...» denilmişdir",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2063,
			"arabicnumber": "892.03",
			"text": "Bana Hârûn b. Saîd El-Eylî rivayet etti. (dediki): Bize, İbni Vehb rivayet etti. (dediki): Bana, Amr haber verdi; ona da ibni Şihâb, Urve'den, o da Âişe'den naklen rivayet etmişki: Mina günlerinde Aişe'nin yanına Ebû Bekir girmiş; Aişe'nin yanında şarkı söyleyip, def çalan iki câriye bulunuyormuş. Resulullah (Sallallahu Aleyhi ve Sellem) de elbisesine bürünmüş; yatıyormuş. Ebû Bekir, cariyeleri azarlamış, bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) yüzünü açarak: «Bırak onları, Yâ Ebâ Bekir! Zira bu günler, bayram günleridir.» buyurmuşlar. Âişe demiş ki: «Ben, oynayan Habeş'lilere bakarken Resulullah (Sallallahu Aleyhi ve Sellem)'in, elbisesi ile beni örttüğünü görmüşümdür. O zaman henüz bir taze idim. Siz oyunu seven genç yaştaki bir tazenin buna ne derece can atacağını takdir buyurun.»",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2064,
			"arabicnumber": "892.04",
			"text": "Bana Ebû't-Tâhir rivayet etti. (dediki): Bize ibni Vehb haber verdi. (dediki): Bana Yûnus, ibni Şihâb'dan, o da Urvetü'bnu'z-Zübeyr'den naklen haber verdi. Urve şöyle demiş: «Âişe dediki: Vallahi Resulullah {Sallallahu Aleyhi ve Sellem)'i odamın kapısında dururken gördüm; Habeşliler, Resulullah (Sallallahu Aleyhi ve Sellem)'in mescidinde harbeleri ile oynuyorlar; Resulullah (Sallallahu Aleyhi ve Sellem) de, ben oyunlarını göreyim diye elbisesi ile beni örtüyordu. Ben (bakmakdan) vazgeçinceye kadar, benim (hatırım) İçin ayakda duruyordu. Siz, eğlenceye düşkün genç yaştaki bir tazenin buna ne derece can atacağını takdir buyurun.»",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2065,
			"arabicnumber": "892.05",
			"text": "Bana, Harun b. Said El-Eylî ile Yûnus b. Abdi'l-A'lâ rivayet ettiler. Lafız: Harun'undur. Dedilerki: Bize İbni Vehb rivayet etti. (dediki): Bize, Amr haber verdi. Ona da Muhammed b. Abdirrahmn, Urve'den, o da Aişe'den naklen rivayet etmiş. Âişe şöyle demiş: (Bir defa) yanımda Buâs şarkılarını okuyan iki câriye bulunduğu hâlde (içeriye) Resulullah (Sallallahu Aleyhi ve Sellem) girdi ve yatağa uzanarak yüzünü çevirdi. Derken Ebû Bekir girdi. Hemen beni azarladı ve: — «Resulullah (Sallallahu Aleyhi ve Sellem)'in yanında şeytan düdüğü mü üflüyorsunuz?)» dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem), ona dönerek: — «Bırak onları!» dedi. Ebü Bekir (in zihni) dalınca, ben cariyelere işaret ettim; onlar da çıktılar. O gün bayram idi. Sudanlılar kalkan ve mızrak oyunu oynuyorlardı. Yâ ben Resulullah (Sallallahu Aleyhi ve Sellem)'den bakmak için izin istedim yahut o (kendiliğinden): — «Bakmak ister misin?» dedi. Ben: — «Evet...» cevâbını verdim. Bunun üzerine beni yanağım, yanağına değecek şekilde arkasına durdurdu. Sudanlılara da: — «Haydi bakalım Erfide oğulları (oynayın!)» diyordu. Nihayet ben bıkınca: — «Artık yeter mi?» diye sordu. — «Evet.» dedim. — «Öyle ise haydi git!» buyurdular",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2066,
			"arabicnumber": "892.06",
			"text": "Bize Züheyrü'bnü Harb rivayet etti. (dediki): Bize Cerîr, Hişâm'dan, o da babasından, o da Aişe'den naklen rivayet etti; Demiş ki: «Bir bayram günü bir takım Habeş'liler gelerek mescidde raksetmeğe başladılar. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) beni çağırdı; ben de (gelerek) başımı onun omuzuna dayadım. Ve Habeş'lilerin oyunlarına bakmaya başladım. Nihayet onlara bakmaktan İlk vazgeçen ben oldum.»",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2067,
			"arabicnumber": "892.07",
			"text": "{….} Bize Yahya b. Yahya rivayet etti. (dediki). Bize Yahya b. Zekeriyyâ b. Ebi Zaide haber verdi. H. Bize İbni Numeyr de rivayet etti. (dediki): Bize Muhammed b. Bişr rivayet etti. Bu râvîlerin ikisi birden Hişâm'dan bu isnadla rivâyet etmişler, yalnız «Mescidde...» kaydını zikretmemişlerdir",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2068,
			"arabicnumber": "892.08",
			"text": "Bana İbrâhîm b. Dinar ile Ukbetü'bnü Mükrem El-Ammî ve Abd b. Humeyd hep birden Ebû Âsım'dan rivayet ettiler. Lafız Ukbe'nindir. dediki: Bize Ebû Âsim, îbni Cüreyc'den rivayet etti. Demişki: Bana Ata' haber verdi. (dediki): Bana Ubeyd b. Umeyr haber verdi. (Dediki): Bana Aişe haber verdi ki kendisi, oynayanlar için: «Ben, onları görmek istedim. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem), ayağa kalktı; ben de kapıya durdum. Onun kulakları ile omuzu arasından bakıyordum. Habeşliler mescidde oynuyorlardı.» demiş. Atâ: «Bunlar yâ İranlılar yâ Habeşliler idi.»; «Bana İbni Atik, bunların Habeşliler olduğunu söyledi.» demişdir. İzah 893 te",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2069,
			"arabicnumber": "893",
			"text": "Bana Muhammed b. Râfİ ile Abd b. Humeyd rivayet ettiler. Abd: (Bize haber verdi...) tâbirini kullandı, ibni Râfi' ise: (Bize Abdürrazzâk rivayet etti.) dedi. (Abdürrazzak demişkil: Bize Ma'mer, Zührî'den, o da Îbnü'l-Müseyyeb'den, o da Ebû Hureyre'den naklen haber verdi. Ebû Hureyre şöyle demiş: «Habeşliler Resulullah (Sallallahu Aleyhi ve Sellem)'in yanında harbeleri ile oynarlarken Ömerü'bnü'l-Hattâb giriverdi. Hemen onları taşlamak için (yerdeki) taşlara uzandı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Bırak onları yâ Ömer!» buyurdular. İzah için buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 24
			}
		}
	]
}