{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"1": "Revelation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1,
			"arabicnumber": 1,
			"text": "Telah menceritakan kepada kami [Al Humaidi Abdullah bin Az Zubair] dia berkata, Telah menceritakan kepada kami [Sufyan] yang berkata, bahwa Telah menceritakan kepada kami [Yahya bin Sa'id Al Anshari] berkata, telah mengabarkan kepada kami [Muhammad bin Ibrahim At Taimi], bahwa dia pernah mendengar [Alqamah bin Waqash Al Laitsi] berkata; saya pernah mendengar [Umar bin Al Khaththab] diatas mimbar berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semua perbuatan tergantung niatnya, dan (balasan) bagi tiap-tiap orang (tergantung) apa yang diniatkan; Barangsiapa niat hijrahnya karena dunia yang ingin digapainya atau karena seorang perempuan yang ingin dinikahinya, maka hijrahnya adalah kepada apa dia diniatkan",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2,
			"arabicnumber": 2,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Hisyam bin 'Urwah] dari [bapaknya] dari [Aisyah] Ibu Kaum Mu'minin, bahwa Al Harits bin Hisyam bertanya kepada Rasulullah shallallahu 'alaihi wasallam: \"Wahai Rasulullah, bagaimana caranya wahyu turun kepada engkau?\" Maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"Terkadang datang kepadaku seperti suara gemerincing lonceng dan cara ini yang paling berat buatku, lalu terhenti sehingga aku dapat mengerti apa yang disampaikan. Dan terkadang datang Malaikat menyerupai seorang laki-laki lalu berbicara kepadaku maka aku ikuti apa yang diucapkannya\". Aisyah berkata: \"Sungguh aku pernah melihat turunnya wahyu kepada Beliau shallallahu 'alaihi wasallam pada suatu hari yang sangat dingin lalu terhenti, dan aku lihat dahi Beliau mengucurkan keringat",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3,
			"arabicnumber": 3,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, Telah menceritakan kepada kami dari [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari ['Urwah bin Az Zubair] dari [Aisyah] -Ibu Kaum Mu'minin-, bahwasanya dia berkata: \"Permulaaan wahyu yang datang kepada Rasulullah shallallahu 'alaihi wasallam adalah dengan mimpi yang benar dalam tidur. Dan tidaklah Beliau bermimpi kecuali datang seperti cahaya subuh. Kemudian Beliau dianugerahi kecintaan untuk menyendiri, lalu Beliau memilih gua Hiro dan bertahannuts yaitu 'ibadah di malam hari dalam beberapa waktu lamanya sebelum kemudian kembali kepada keluarganya guna mempersiapkan bekal untuk bertahannuts kembali. Kemudian Beliau menemui Khadijah mempersiapkan bekal. Sampai akhirnya datang Al Haq saat Beliau di gua Hiro, Malaikat datang seraya berkata: \"Bacalah?\" Beliau menjawab: \"Aku tidak bisa baca\". Nabi shallallahu 'alaihi wasallam menjelaskan: Maka Malaikat itu memegangku dan memelukku sangat kuat kemudian melepaskanku dan berkata lagi: \"Bacalah!\" Beliau menjawab: \"Aku tidak bisa baca\". Maka Malaikat itu memegangku dan memelukku sangat kuat kemudian melepaskanku dan berkata lagi: \"Bacalah!\". Beliau menjawab: \"Aku tidak bisa baca\". Malaikat itu memegangku kembali dan memelukku untuk ketiga kalinya dengan sangat kuat lalu melepaskanku, dan berkata lagi: (Bacalah dengan (menyebut) nama Tuhanmu yang Menciptakan, Dia Telah menciptakan manusia dari segumpal darah. Bacalah, dan Tuhanmulah yang Maha Pemurah).\" Nabi shallallahu 'alaihi wasallam kembali kepada keluarganya dengan membawa kalimat wahyu tadi dalam keadaan gelisah. Beliau menemui Khadijah binti Khawailidh seraya berkata: \"Selimuti aku, selimuti aku!\". Beliau pun diselimuti hingga hilang ketakutannya. Lalu Beliau menceritakan peristiwa yang terjadi kepada Khadijah: \"Aku mengkhawatirkan diriku\". Maka Khadijah berkata: \"Demi Allah, Allah tidak akan mencelakakanmu selamanya, karena engkau adalah orang yang menyambung silaturrahim.\" Khadijah kemudian mengajak Beliau untuk bertemu dengan Waroqoh bin Naufal bin Asad bin Abdul 'Uzza, putra paman Khadijah, yang beragama Nasrani di masa Jahiliyyah, dia juga menulis buku dalam bahasa Ibrani, juga menulis Kitab Injil dalam Bahasa Ibrani dengan izin Allah. Saat itu Waroqoh sudah tua dan matanya buta. Khadijah berkata: \"Wahai putra pamanku, dengarkanlah apa yang akan disampaikan oleh putra saudaramu ini\". Waroqoh berkata: \"Wahai putra saudaraku, apa yang sudah kamu alami\". Maka Rasulullah shallallahu 'alaihi wasallam menuturkan peristiwa yang dialaminya. Waroqoh berkata: \"Ini adalah Namus, seperti yang pernah Allah turunkan kepada Musa. Duhai seandainya aku masih muda dan aku masih hidup saat kamu nanti diusir oleh kaummu\". Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apakah aku akan diusir mereka?\" Waroqoh menjawab: \"Iya. Karena tidak ada satu orang pun yang datang dengan membawa seperti apa yang kamu bawa ini kecuali akan disakiti (dimusuhi). Seandainya aku ada saat kejadian itu, pasti aku akan menolongmu dengan sekemampuanku\". Waroqoh tidak mengalami peristiwa yang diyakininya tersebut karena lebih dahulu meninggal dunia pada masa fatroh (kekosongan) wahyu. [Ibnu Syihab] berkata; telah mengabarkan kepadaku [Abu Salamah bin Abdurrahman] bahwa [Jabir bin Abdullah Al Anshari] bertutur tentang kekosongan wahyu, sebagaimana yang Rasulullah shallallahu 'alaihi wasallam ceritakan: \"Ketika sedang berjalan aku mendengar suara dari langit, aku memandang ke arahnya dan ternyata Malaikat yang pernah datang kepadaku di gua Hiro, duduk di atas kursi antara langit dan bumi. Aku pun ketakutan dan pulang, dan berkata: \"Selimuti aku. Selimuti aku\". Maka Allah Ta'ala menurunkan wahyu: (Wahai orang yang berselimut) sampai firman Allah (dan berhala-berhala tinggalkanlah). Sejak saat itu wahyu terus turun berkesinambungan.\" Hadits ini juga diriwayatkan oleh [Abdullah bin Yusuf] dan [Abu Shalih] juga oleh [Hilal bin Raddad] dari [Az Zuhri]. Dan [Yunus] berkata; dan [Ma'mar] menyepakati bahwa dia mendapatkannya dari Az Zuhri",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4,
			"arabicnumber": 4,
			"text": "",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5,
			"arabicnumber": 5,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] dia berkata, Telah menceritakan kepada kami [Abu 'Awanah] berkata, bahwa Telah menceritakan kepada kami [Musa bin Abu Aisyah] berkata, Telah menceritakan kepada kami [Sa'id bin Jubair] dari [Ibnu 'Abbas] tentang firman Allah Ta'ala: (Janganlah kamu gerakkan lidahmu untuk (membaca) Al Quran karena hendak cepat-cepat ingin (menguasainya).\" Berkata Ibnu 'Abbas: \"Rasulullah shallallahu 'alaihi wasallam sangat kuat keinginannya untuk menghafalkan apa yang diturunkan (Al Qur'an) dan menggerak-gerakkan kedua bibir Beliau.\" Berkata Ibnu 'Abbas: \"aku akan menggerakkan kedua bibirku (untuk membacakannya) kepada kalian sebagaimana Rasulullah shallallahu 'alaihi wasallam melakukannya kepadaku\". Berkata Sa'id: \"Dan aku akan menggerakkan kedua bibirku (untuk membacakannya) kepada kalian sebagaimana aku melihat Ibnu 'Abbas melakukannya. Maka Nabi shallallahu 'alaihi wasallam menggerakkan kedua bibirnya, Kemudian turunlah firman Allah Ta'ala: Janganlah kamu gerakkan lidahmu untuk (membaca) Al Quran karena hendak cepat-cepat (menguasai) nya. Sesungguhnya atas tanggungan Kamilah mengumpulkannya (di dadamu) dan (membuatmu pandai) membacanya\". Maksudnya Allah mengumpulkannya di dalam dadamu (untuk dihafalkan) dan kemudian kamu membacanya: \"Apabila Kami telah selesai membacakannya, maka ikutilah bacaannya itu\". Maksudnya: \"Dengarkanlah dan diamlah\". Kemudian Allah Ta'ala berfirman: \"Kemudian, sesungguhnya atas tanggungan Kamilah penjelasannya. Maksudnya: \"Dan Kewajiban Kamilah untuk membacakannya\" Dan Rasulullah shallallahu 'alaihi wasallam sejak saat itu bila Jibril 'Alaihis Salam datang kepadanya, Beliau mendengarkannya. Dan bila Jibril 'Alaihis Salam sudah pergi, maka Nabi shallallahu 'alaihi wasallam membacakannya (kepada para sahabat) sebagaimana Jibril 'Alaihis Salam membacakannya kepada Beliau shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6,
			"arabicnumber": 6,
			"text": "Telah menceritakan kepada kami [Abdan] dia berkata, telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] dan dengan riwayat yang sama, telah menceritakan pula kepada kami [Bisyir bin Muhammad] berkata, telah mengabarkan kepada kami [Abdullah] berkata, telah mengabarkan kepada kami [Yunus] dan [Ma'mar] dari [Az Zuhri] seperti lainnya berkata, telah mengabarkan kepada kami [Ubaidullah bin Abdullah] dari [Ibnu 'Abbas] berkata, bahwa Rasulullah shallallahu 'alaihi wasallam adalah manusia yang paling lembut terutama pada bulan Ramadlan ketika malaikat Jibril 'Alaihis Salam menemuinya, dan adalah Jibril 'Alaihis Salam mendatanginya setiap malam di bulan Ramadlan, dimana Jibril 'Alaihis Salam mengajarkan Al Qur'an. Sungguh Rasulullah shallallahu 'alaihi wasallam jauh lebih lembut daripada angin yang berhembus",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7,
			"arabicnumber": 7,
			"text": "Telah menceritakan kepada kami [Abu Al Yaman Al Hakam bin Nafi'] dia berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [Ubaidullah bin Abdullah bin 'Utbah bin Mas'ud] bahwa [Abdullah bin 'Abbas] telah mengabarkan kepadanya bahwa [Abu Sufyan bin Harb] telah mengabarkan kepadanya; bahwa Heraclius menerima rombongan dagang Quraisy, yang sedang mengadakan ekspedisi dagang ke Negeri Syam pada saat berlakunya perjanjian antara Nabi shallallahu 'alaihi wasallam dengan Abu Sufyan dan orang-orang kafir Quraisy. Saat singgah di Iliya' mereka menemui Heraclius atas undangan Heraclius untuk di diajak dialog di majelisnya, yang saat itu Heraclius bersama dengan para pembesar-pembesar Negeri Romawi. Heraclius berbicara dengan mereka melalui penerjemah. Heraclius berkata; \"Siapa diantara kalian yang paling dekat hubungan keluarganya dengan orang yang mengaku sebagai Nabi itu?.\" Abu Sufyan berkata; maka aku menjawab; \"Akulah yang paling dekat hubungan kekeluargaannya dengan dia\". Heraclius berkata; \"Dekatkanlah dia denganku dan juga sahabat-sahabatnya.\" Maka mereka meletakkan orang-orang Quraisy berada di belakang Abu Sufyan. Lalu Heraclius berkata melalui penerjemahnya: \"Katakan kepadanya, bahwa aku bertanya kepadanya tentang lelaki yang mengaku sebagai Nabi. Jika ia berdusta kepadaku maka kalian harus mendustakannya.\"Demi Allah, kalau bukan rasa malu akibat tudingan pendusta yang akan mereka lontarkan kepadaku niscaya aku berdusta kepadanya.\" Abu Sufyan berkata; Maka yang pertama ditanyakannya kepadaku tentangnya (Nabi shallallahu 'alaihi wasallam) adalah: \"bagaimana kedudukan nasabnya ditengah-tengah kalian?\" Aku jawab: \"Dia adalah dari keturunan baik-baik (bangsawan) \". Tanyanya lagi: \"Apakah ada orang lain yang pernah mengatakannya sebelum dia?\" Aku jawab: \"Tidak ada\". Tanyanya lagi: \"Apakah bapaknya seorang raja?\" Jawabku: \"Bukan\". Apakah yang mengikuti dia orang-orang yang terpandang atau orang-orang yang rendah?\" Jawabku: \"Bahkan yang mengikutinya adalah orang-orang yang rendah\". Dia bertanya lagi: \"Apakah bertambah pengikutnya atau berkurang?\" Aku jawab: \"Bertambah\". Dia bertanya lagi: \"Apakah ada yang murtad disebabkan dongkol terhadap agamanya?\" Aku jawab: \"Tidak ada\". Dia bertanya lagi: \"Apakah kalian pernah mendapatkannya dia berdusta sebelum dia menyampaikan apa yang dikatakannya itu?\" Aku jawab: \"Tidak pernah\". Dia bertanya lagi: \"Apakah dia pernah berlaku curang?\" Aku jawab: \"Tidak pernah. Ketika kami bergaul dengannya, dia tidak pernah melakukan itu\". Berkata Abu Sufyan: \"Aku tidak mungkin menyampaikan selain ucapan seperti ini\". Dia bertanya lagi: \"Apakah kalian memeranginya?\" Aku jawab: \"Iya\". Dia bertanya lagi: \"Bagaimana kesudahan perang tersebut?\" Aku jawab: \"Perang antara kami dan dia sangat banyak. Terkadang dia mengalahkan kami terkadang kami yang mengalahkan dia\". Dia bertanya lagi: \"Apa yang diperintahkannya kepada kalian?\" Aku jawab: \"Dia menyuruh kami; 'Sembahlah Allah dengan tidak menyekutukannya dengan sesuatu apapun, dan tinggalkan apa yang dikatakan oleh nenek moyang kalian. ' Dia juga memerintahkan kami untuk menegakkan shalat, menunaikan zakat, berkata jujur, saling memaafkan dan menyambung silaturrahim\". Maka Heraclius berkata kepada penerjemahnya: \"Katakan kepadanya, bahwa aku telah bertanya kepadamu tentang keturunan orang itu, kamu ceritakan bahwa orang itu dari keturunan bangsawan. Begitu juga laki-laki itu dibangkitkan di tengah keturunan kaumnya. Dan aku tanya kepadamu apakah pernah ada orang sebelumnya yang mengatakan seperti yang dikatakannya, kamu jawab tidak. Seandainya dikatakan ada orang sebelumnya yang mengatakannya tentu kuanggap orang ini meniru orang sebelumnya yang pernah mengatakan hal serupa. Aku tanyakan juga kepadamu apakah bapaknya ada yang dari keturunan raja, maka kamu jawab tidak. Aku katakan seandainya bapaknya dari keturunan raja, tentu orang ini sedang menuntut kerajaan bapaknya. Dan aku tanyakan juga kepadamu apakah kalian pernah mendapatkan dia berdusta sebelum dia menyampaikan apa yang dikatakannya, kamu menjawabnya tidak. Sungguh aku memahami, kalau kepada manusia saja dia tidak berani berdusta apalagi berdusta kepada Allah. Dan aku juga telah bertanya kepadamu, apakah yang mengikuti dia orang-orang yang terpandang atau orang-orang yang rendah?\" Kamu menjawab orang-orang yang rendah yang mengikutinya. Memang mereka itulah yang menjadi para pengikut Rasul. Aku juga sudah bertanya kepadamu apakah bertambah pengikutnya atau berkurang, kamu menjawabnya bertambah. Dan memang begitulah perkara iman hingga menjadi sempurna. Aku juga sudah bertanya kepadamu apakah ada yang murtad disebabkan marah terhadap agamanya. Kamu menjawab tidak ada. Dan memang begitulah iman bila telah masuk tumbuh bersemi di dalam hati. Aku juga sudah bertanya kepadamu apakah dia pernah berlaku curang, kamu jawab tidak pernah. Dan memang begitulah para Rasul tidak mungkin curang. Dan aku juga sudah bertanya kepadamu apa yang diperintahkannya kepada kalian, kamu jawab dia memerintahkan kalian untuk menyembah Allah dengan tidak menyekutukannya dengan sesuatu apapun, dan melarang kalian menyembah berhala, dia juga memerintahkan kalian untuk menegakkan shalat, menunaikan zakat, berkata jujur, saling memaafkan dan menyambung silaturrahim. Seandainya semua apa yang kamu katakan ini benar, pasti dia akan menguasai kerajaan yang ada di bawah kakiku ini. Sungguh aku telah menduga bahwa dia tidak ada diantara kalian sekarang ini, seandainya aku tahu jalan untuk bisa menemuinya, tentu aku akan berusaha keras menemuinya hingga bila aku sudah berada di sisinya pasti aku akan basuh kedua kakinya. Kemudian Heraclius meminta surat Rasulullah shallallahu 'alaihi wasallam yang dibawa oleh Dihyah untuk para Penguasa Negeri Bashrah, Maka diberikannya surat itu kepada Heraclius, maka dibacanya dan isinya berbunyi: \"Bismillahir rahmanir rahim. Dari Muhammad, hamba Allah dan Rasul-Nya untuk Heraclius. Penguasa Romawi, Keselamatan bagi siapa yang mengikuti petunjuk. Kemudian daripada itu, aku mengajakmu dengan seruan Islam; masuk Islamlah kamu, maka kamu akan selamat, Allah akan memberi pahala kepadamu dua kali. Namun jika kamu berpaling, maka kamu menanggung dosa rakyat kamu, dan: Hai ahli kitab, marilah (berpegang) kepada suatu kalimat (ketetapan) yang tidak ada perselisihan antara kami dan kamu, bahwa tidak kita sembah kecuali Allah dan tidak kita persekutukan dia dengan sesuatupun dan tidak (pula) sebagian kita menjadikan sebagian yang lain sebagai Rabb selain Allah\". Jika mereka berpaling, maka katakanlah kepada mereka: \"Saksikanlah, bahwa kami adalah orang-orang yang berserah diri (kepada Allah).\" Abu Sufyan menuturkan: \"Setelah Heraclius menyampaikan apa yang dikatakannya dan selesai membaca surat tersebut, terjadilah hiruk pikuk dan suara-suara ribut, sehingga mengusir kami. Aku berkata kepada teman-temanku setelah kami diusir keluar; \"sungguh dia telah diajak kepada urusan Anak Abu Kabsyah. Heraclius mengkhawatirkan kerajaan Romawi.\"Pada masa itupun aku juga khawatir bahwa Muhammad akan berjaya, sampai akhirnya (perasaan itu hilang setelah) Allah memasukkan aku ke dalam Islam. Dan adalah Ibnu An Nazhur, seorang Pembesar Iliya' dan Heraclius adalah seorang uskup agama Nashrani, dia menceritakan bahwa pada suatu hari ketika Heraclius mengunjungi Iliya' dia sangat gelisah, berkata sebagian komandan perangnya: \"Sungguh kami mengingkari keadaanmu. Selanjutnya kata Ibnu Nazhhur, \"Heraclius adalah seorang ahli nujum yang selalu memperhatikan perjalanan bintang-bintang. Dia pernah menjawab pertanyaan para pendeta yang bertanya kepadanya; \"Pada suatu malam ketika saya mengamati perjalanan bintang-bintang, saya melihat raja Khitan telah lahir, siapakah di antara ummat ini yang di khitan?\" Jawab para pendeta; \"Yang berkhitan hanyalah orang-orang Yahudi, janganlah anda risau karena orang-orang Yahudi itu. Perintahkan saja keseluruh negeri dalam kerajaan anda, supaya orang-orang Yahudi di negeri tersebut di bunuh.\" Ketika itu di hadapakan kepada Heraclius seorang utusan raja Bani Ghasssan untuk menceritakan perihal Rasulullah shallallahu 'alaihi wasallam, setelah orang itu selesai bercerita, lalu Heraclius memerintahkan agar dia diperiksa, apakah dia berkhitan ataukah tidak. Seusai di periksa, ternyata memang dia berkhitam. Lalu di beritahukan orang kepada Heraclius. Heraclius bertanya kepada orang tersebut tentang orang-orang Arab yang lainnya, di khitankah mereka ataukah tidak?\" Dia menjawab; \"Orang Arab itu di khitan semuanya.\" Heraclius berkata; 'inilah raja ummat, sesungguhnya dia telah terlahir.\" Kemudian heraclisu berkirim surat kepada seorang sahabatnya di Roma yang ilmunya setarf dengan Heraclisu (untuk menceritakan perihal kelahiran Nabi Muhammad shallallahu 'alaihi wasallam). Sementara itu, ia meneruskan perjalanannya ke negeri Himsha, tetapi sebelum tiba di Himsha, balasan surat dari sahabatnya itu telah tiba terlebih dahulu. Sahabatnya itu menyetujui pendapat Heraclius bahwa Muhammad telah lahir dan bahwa beliau memang seorang Nabi. Heraclius lalu mengundang para pembesar Roma supaya datang ke tempatnya di Himsha, setelah semuanya hadir dalam majlisnya, Heraclius memerintahkan supaya mengunci semua pintu. Kemudian dia berkata; 'Wahai bangsa rum, maukah anda semua beroleh kemenangan dan kemajuan yang gilang gemilang, sedangkan kerajaan tetap utuh di tangan kita? Kalau mau, akuilah Muhammad sebagai Nabi!.\" Mendengar ucapan itu, mereka lari bagaikan keledai liar, padahal semua pintu telah terkunci. Melihat keadaan yang demikian, Heraclius jadi putus harapan yang mereka akan beriman (percaya kepada kenabian Muhammad). Lalu di perintahkannya semuanya untuk kembali ke tempatnya masing-masing seraya berkata; \"Sesungguhnya saya mengucapkan perkataan saya tadi hanyalah sekedar menguji keteguhan hati anda semua. Kini saya telah melihat keteguhan itu.\" Lalu mereka sujud di hadapan Heraclius dan mereka senang kepadanya. Demikianlah akhir kisah Heraclius. Telah di riwayatkan oleh [Shalih bin Kaisan] dan [Yunus] dan [Ma'mar] dari [Az Zuhri]",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 7
			}
		}
	]
}