{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"12": "Fear Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 942,
			"arabicnumber": 942,
			"text": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, Aku bertanya kepadanya, \"Apakah Nabi shallallahu 'alaihi wasallam melaksanakan shalat khauf?\" Ia berkata; [Salim] telah mengabarkan kepadaku bahwa ['Abdullah bin 'Umar] radliallahu 'anhuma berkata, \"Aku pernah ikut suatu peperangan bersama Rasulullah shallallahu 'alaihi wasallam ke arah Najed, kami menghadap ke arah musuh dan membuat barisan untuk mereka. Rasulullah shallallahu 'alaihi wasallam lalu berdiri mengimami kami. Sekelompok orang yang bersama beliau melaksanakan shalat sementara sekelompok yang lain menghadap musuh. Nabi shallallahu 'alaihi wasallam lalu rukuk dan sujud dua kali bersama kelompok yang bersamanya, lalu mereka (kelompok yang telah shalat) bergeser menempati posisi kelompok yang belum shalat. Kemudian kelompok yang belum shalat tersebut datang dan masuk ke dalam shaf, Rasulullah shallallahu 'alaihi wasallam lalu rukuk bersama kelompok yang baru dan sujud dua kali, lalu beliau salam. Maka setiap kelompok dari kami menyelesaikan shalat mereka masing-masing dengan rukuk dan sujud dua kali",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 943,
			"arabicnumber": 943,
			"text": "Telah menceritakan kepada kami [Sa'id bin Yahya bin Sa'id Al Qurasyi] berkata, telah menceritakan kepadaku [Bapakku] berkata, telah menceritakan kepada kami [Ibnu Juraij] dari [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu 'Umar] seperti ucapan Mujahid, \"Bila mereka dalam keadaan genting, mereka shalat dengan berdiri.\" Ibnu 'Umar menambahkan dari Nabi shallallahu 'alaihi wasallam, \"Apabila musuh lebih banyak dari mereka (pasukan kaum Muslimin), maka mereka shalat dengan berdiri dan di atas kendaraan",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 944,
			"arabicnumber": 944,
			"text": "Telah menceritakan kepada kami [Haiwah bin Syuraih] berkata, telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri] dari ['Ubaidullah bin 'Abdullah bin 'Utbah] dari [Ibnu 'Abbas] radliallahu 'anhuma, berkata, \"Nabi shallallahu 'alaihi wasallam melaksanakan shalat dan diikuti sekelompok orang bersamanya. Beliau lalu bertakbir dan mereka pun bertakbir bersama beliau. Kemudian beliau rukuk dan orang-orang yang bersamanya ikut rukuk. Kemudian beliau sujud dan orang-orang yang bersamanyanya pun sujud. Kemudian beliau berdiri untuk rakaat kedua, maka orang-orang yang sujud bersama beliau berdiri dan berjaga-jaga untuk saudara mereka. Kemudian datanglah sekelompok yang lain (yang sebelumnya berjaga dan belum shalat), mereka lalu rukuk dan sujud bersama beliau. Dan masing-masing orang melanjutkan shalat mereka namun dengan tetap berjaga-jaga satu sama lain",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 945,
			"arabicnumber": 945,
			"text": "Telah menceritakan kepada kami [Yahya bin Ja'fat Al Bukhari] berkata, telah menceritakan kepada kami [Waki'] dari ['Ali bin Mubarak] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Jabir bin 'Abdullah] berkata, \"Pada hari peperangan Khandaq 'Umar bin Al Khaththab datang sambil mencaci orang-orang kafir Quraisy, ia katakan, \"Wahai Rasulullah, aku belum melaksanakan shalat 'Ashar hingga matahari sudah terbenam!\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Demi Allah, akupun belum melakasanakannya.\" Maka kemudian beliau berdiri menuju aliran air (sungai), lalu berwudlu dan melaksanakan shalat 'Ashar setelah matahari terbenam, kemudian dilanjutkan dengan melaksanakan shalat Maghrib",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 946,
			"arabicnumber": 946,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Muhammad bin Asma'] berkata, telah menceritakan kepada kami [Juwairiyah] dari [Nafi'] dari [Ibnu 'Umar] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda kepada kami ketika beliau kembali dari perang Ahzab: \"Jangan sekali-kali salah seorang dari kalian shalat 'Ashar keculi di perkampungan Bani Quraizhah.\" Lalu tibalah waktu shalat ketika mereka masih di jalan, sebagian dari mereka berkata, 'Kami tidak akan shalat kecuali telah sampai tujuan', dan sebagian lain berkata, 'Bahkan kami akan melaksanakan shalat, sebab beliau tidaklah bermaksud demikian'. Maka kejadian tersebut diceritakan kepada Nabi shallallahu 'alaihi wasallam, dan beliau tidak mencela seorang pun dari mereka",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 947,
			"arabicnumber": 947,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari ['Abdul 'Aziz bin Shuhaib] dan [Tsabit Al Banani] dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam melaksanakan shalat Shubuh dalam keadaan masih gelap, kemudian beliau mengendarai tunggangannya seraya bersabda: \"Allahu Akbar, hancurlah Khaibar! Sesungguhnya kami apabila mendatangi perkampungan suatu kaum, (maka amat buruklah pagi hari yang dialami orang-orang yang diperingatkan tersebut) (Qs. Ash Shaaffaat: 177). Orang-orang Khaibar keluar seraya berkata, \"Muhammad dan Al Khamis!\" Tabit berkata, \"Al Khamis artinya pasukan.\" Maka Rasulullah shallallahu 'alaihi wasallam pun mengalahkan mereka, membunuh pasukan dan menawan tawanan. Maka Shafiah menjadi bagian Dihyah Al Kalbi, kemudian ia menjadi milik Rasulullah shallallahu 'alaihi wasallam. Beliau kemudian menikahinya, dan maharnya adalah pembebasannya.\" 'Abdul 'Azizi berkata kepada Tsabit, \"Wahai Abu Muhammad, apakah kamu bertanya kepada Anas bin Malik, apa yang Beliau jadikan mahar untuk wanita tersebut?\" Tsabit menjawab, 'Maharnya adalah pembebasannya.' Ia pun tersenyum",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		}
	]
}