{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"13": "The Two Festivals (Eids)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 948,
			"arabicnumber": 948,
			"text": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku [Salim bin 'Abdullah] bahwa ['Abdullah bin 'Umar] berkata, \"'Umar membawa baju jubah terbuat dari sutera yang dibelinya di pasar, jubah tersebut kemudian ia diberikan kepada Rasulullah shallallahu 'alaihi wasallam seraya berkata, \"Wahai Rasulullah, belilah jubah ini sehingga tuan bisa memperbagus penampilan saat shalat 'Ied atau ketika menyambut para delegasi.\" Rasulullah shallallahu 'alaihi wasallam lalu berkata kepadanya: \"Ini adalah pakaian orang yang tidak akan mendapatkan bagian (di akhirat).\" Kemudian Umar tidak nampak untuk beberaa waktu lamanya menurut apa yang Allah kehendaki, Rasulullah shallallahu 'alaihi wasallam kemudian mengirimkan kepada 'Umar sebuah jubah yang terbuat dari sutera. Maka Umar pun membawanya menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata: \"Wahai Rasulullah, tuan telah memberikan pakaian ini untukku, padahal tuan telah berkata, 'Ini adalah pakaian orang yang tidak akan mendapatkan bagian (di akhirat) '. Lalu mengapa tuan mengirimnya buat saya?\" Maka Rasulullah shallallahu 'alaihi wasallam pun berkata kepadanya: \"Juallah, atau beliau mengatakan, 'dengannya engkau bisa memenuhi kebutuhanmu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 950,
			"arabicnumber": 950,
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 951,
			"arabicnumber": 951,
			"text": "Telah menceritakan kepada kami [Hajjaj] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah mengabarkan kepadaku [Zubaid] berkata, Aku mendengar ['Asy Sya'bi] dari [Al Bara'] berkata, Aku mendengar Nabi shallallahu 'alaihi wasallam menyampaikan khutbah, sabdanya: \"Pertama kali yang akan kita kerjakan pada hari ini adalah shalat, kemudian kembali pulang dan menyembelih hewan kurban. Maka barangsiapa mengerjakan seperti ini bararti dia telah memenuhi sunnah kami",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 952,
			"arabicnumber": 952,
			"text": "Telah menceritakan kepada kami ['Ubaid bin Isma'il] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [Bapaknya] dari ['Aisyah] berkata, \"Abu Bakar masuk menemui aku saat itu di sisiku ada dua orang budak tetangga Kaum Anshar yang sedang bersenandung, yang mengingatkan kepada peristiwa pembantaian kaum Anshar pada perang Bu'ats.\" 'Aisyah menlanjutkan kisahnya, \"Kedua sahaya tersebut tidaklah begitu pandai dalam bersenandung. Maka Abu Bakar pun berkata, \"Seruling-seruling setan (kalian perdengarkan) di kediaman Rasulullah shallallahu 'alaihi wasallam!\" Peristiwa itu terjadi pada Hari Raya 'Ied. Maka bersabdalah Rasulullah shallallahu 'alaihi wasallam: \"Wahai Abu Bakar, sesungguhnya setiap kaum memiliki hari raya, dan sekarang ini adalah hari raya kita",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 953,
			"arabicnumber": 953,
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abdurrahim] telah menceritakan kepada kami [Sa'id bin Sulaiman] berkata, telah menceritakan kepada kami [Husyaim] berkata, telah mengabarkan kepada kami ['Ubaidullah bin Abu Bakar bin Anas] dari [Anas bin Malik] berkata, \"Pada hari raya Rasulullah shallallahu 'alaihi wasallam tidak berangkat untuk melaksanakan shalat hingga beliau makan beberapa butir kurma.\" [Murajja' bin Raja'] berkata; telah menceritakan kepadaku ['Ubaidullah] berkata, telah menceritakan kepadaku [Anas] dari Nabi shallallahu 'alaihi wasallam, \"Beliau makan beberapa kurma dengan bilangan ganjil",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 954,
			"arabicnumber": 954,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Muhammad bin Sirin] dari [Anas] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menyembelih sebelum shalat hendaklah dia mengulanginya.\" Lalu berdirilah seorang laki-laki seraya berkata, \"Ini adalah hari yang daging sangat diharap.\" Laki-laki itu kemudian menyebut-nyebut tentang tetangga-tetangganya, dan seakan Nabi shallallahu 'alaihi wasallam membenarkan orang itu. Lelaki itu berkata, \"Sungguh aku berkurban dengan seekor jadza'ah lebih aku sukai dari dua ekor kambing.\" Maka Nabi shallallahu 'alaihi wasallam memberikan keringanan buat orang tersebut. Aku (Anas) tidak tahu apakah keringanan itu juga berlaku untuk yang lain atau tidak",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 955,
			"arabicnumber": 955,
			"text": "Telah menceritakan kepada kami ['Utsman] berkata, telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Asy Sya'bi] dari [Al Bara' bin 'Azib] radliallahu 'anhu, ia berkata, \"Nabi shallallahu 'alaihi wasallam menyampaikan khutbah pada hari Raya Qurban ('Iedul Adlha) setelah melaksankan shalat. Beliau bersabda: \"Barangsiapa melaksanakan shalat seperti shalat kami dan melaksanakan manasik seperti manasik kami maka dia telah melaksanakan manasik (menyembelih kurban). Dan barangsiapa menyembelih kurban sebelum shalat berarti dia malaksanakannya sebelum shalat, dan berarti dia belum melaksanakan manasik (berkurban).\" Abu Burdah bin Niyar, paman Al Bara', berkata, \"Wahai Rasulullah, aku telah menyembelih dua ekor kambing sebelum shalat, dan yang aku ketahui bahwa hari ini adalah hari kita bergembira dengan makan dan minum. Dan aku menyukai bila dua ekor kambingku itu menjadi yang pertama disembelih di rumahku lalu aku memasaknya dan menikmatinya sebelum aku berangkat untuk shalat!\" Beliau bersabda: \"Kambingmu setatusnya adalah kambing yang disembelih untuk diambil dagingnya (bukan daging kurban).\" Laki-laki itu berkata lagi, \"Wahai Rasulullah, kami masih memiliki anak kambing yang dia lebih kami cintai dari dua ekor kambing tadi. Apakah aku dibolehkan berkurban dengannya?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Ya. Akan tetapi tidak boleh untuk seorangpun setelah kamu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 956,
			"arabicnumber": 956,
			"text": "Telah menceritakan kepada kami [Sa'id bin Abu Maryam] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepadaku [Zaid bin Aslam] dari ['Iyadl bin 'Abdullah bin Abu Sarah] dari [Abu Sa'id Al Khudri] berkata, \"Pada hari raya Idul Firi dan Adlha Rasulullah shallallahu 'alaihi wasallam keluar menuju tempat shalat (lapangan), dan pertama kali yang beliau kerjakan adalah shalat hingga selesai. Kemudian beliau berdiri menghadap orang banyak sedangkan mereka dalam keadaan duduk di barisan mereka. Beliau memberi pengajaran, wasiat dan memerintahkan mereka. Dan apabila beliau ingin mengutus pasukan, maka beliau sampaikan atau beliau perintahkan (untuk mempersiapkannya), setelah itu beliau berlalu pergi.\" Abu Sa'id Al Khudri berkata, \"Manusia senantiasa melaksanakan (tata cara shalat hari raya) seperti apa yang beliau laksanakan, hingga pada suatu hari aku keluar bersama Marwan -yang saat itu sebagai Amir di Madinah- pada hari raya Adlha atau Fithri. Ketika kami sampai di tempat shalat, ternyata di sana sudah ada mimbar yang dibuat oleh Katsir bin Ash Shalt. Ketika Marwan hendak menaiki mimbar sebelum pelaksanaan shalat, aku tarik pakaiannya dan dia balik menariknya, kemudian ia naik dan khuthbah sebelum shalat. Maka aku katakan kepadanya, \"Demi Allah, kamu telah merubah (sunnah)!\" Lalu dia menjawab, \"Wahai Abu Sa'id. Apa yang engkau ketahui itu telah berlalu.\" Aku katakan, \"Demi Allah, apa yang aku ketahui lebih baik dari apa yang tidak aku ketahui.\" Lalu dia berkata, \"Sesungguhnya orang-orang tidak akan duduk (mendengarkan khutbah kami) setelah shalat. Maka aku buat (khutbah) sebelum shalat",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 957,
			"arabicnumber": 957,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir] berkata, telah menceritakan kepada kami [Anas bin 'Iyadl] dari ['Ubaidullah] dari [Nafi'] dari ['Abdullah bin 'Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melaksanakan shalat 'Idul Adlha dan 'Idul Fitri kemudian berkhutbah setelah shalat",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 961,
			"arabicnumber": 961,
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 962,
			"arabicnumber": 962,
			"text": "Telah menceritakan kepada kami [Abu 'Ashim] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Al Hasan bin Muslim] dari [Thawus] dari [Ibnu 'Abbas] berkata, \"Aku menghadiri shalat Hari Raya bersama Rasulullah shallallahu 'alaihi wasallam, Abu Bakar, 'Umar dan 'Utsman? radliallahu 'anhum, bahwa mereka semua melaksanakan shalat sebelum khutbah",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 963,
			"arabicnumber": 963,
			"text": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] berkata, telah menceritakan kepada kami [Abu Usamah] berkata, telah menceritakan kepada kami ['Ubaidullah] dari [Nafi'] dari [Ibnu 'Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam, Abu Bakar, dan 'Umar? radliallahu 'anhu mereka melaksanakan shalat dua Hari Raya sebelum khutbah",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 964,
			"arabicnumber": 964,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] berkata, telah menceritakan kepada kami [Syu'bah] dari ['Adi bin Tsabit] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas], bahwa Rasulullah shallallahu 'alaihi wasallam melaksanakan shalat Hari Raya 'Idul Fitri dua rakaat dan tidak shalat sebelum atau sesudahnya. Kemudian beliau mendatangi para wanita dan memerintahkan mereka untuk bersedekah. Maka para wanita memberikan sedekah hingga ada seorang wanita yang memberikan anting dan kalungnya",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 965,
			"arabicnumber": 965,
			"text": "Telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepada kami [Zubaid] berkata, aku mendengar [Asy Sya'bi] dari [Al Bara' bin 'Azib] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya yang pertama kali kami lakukan pada hari Raya ini adalah shalat. Kemudian kami pulang dan menyembelih kurban. Maka barangsiapa mengerjakan seperti itu berarti dia telah memenuhi sunnah kami. Dan barangsiapa menyembelih kurban sebelum pelaksanaan shalat 'Ied, maka itu hanyalah daging yang dipersembahkan untuk keluarganya dan tidak sedikitpun mendapatkan (pahala) ibadah kurban.\" Tiba-tiba ada seorang lelaki Anshar yang dipanggil dengan nama Abu Burdah bin Niyar berkata, \"Wahai Rasulullah, aku telah menyembelih hewan dan aku masih memiliki anak unta yang lebih baik dari unta yang lebih besar.\" Maka beliau bersabda: \"Jadikanlah ia sebagai pengganti dari apa yang telah kamu sembelih sebelum shalat, dan kamu akan mendapatkan bagian pahala yang cukup yang tidak akan didapati oleh orang selainmu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 966,
			"arabicnumber": 966,
			"text": "Telah menceritakan kepada kami [Zakaria bin Yahya Abu As Sukain] berkata, telah menceritakan kepada kami [Al Muharibi] berkata, telah menceritakan kepada kami [Muhammad bin Suqah] dari [Sa'id bin Jubair] berkata, \"Aku pernah besama Ibnu 'Umar saat dia terkena ujung panah pada bagian lekuk telapak kakinya. Dia lalu merapatkan kakinya pada tunggangannya, lalu aku turun dan melepaskannya. Kejadiaan itu terjadi di Mina. Kemudian peristiwa ini didengar oleh Al Hajjaj, maka dia pun menjenguknya seraya berkata, \"Seandainya kami ketahui siapa yang membuatmu terkena mushibah ini!\" Maka [Ibnu 'Umar] menyahut, \"Engkaulah yang membuat aku terkena mushibah ini.\" Al Hajjaj berkata, \"Bagaimana bisa!\" Ibnu 'Umar menjawab, \"Engkau yang membawa senjata di hari yang tidak diperbolehkan membawanya. Dan engkau pula yang membawa masuk senjata ke dalam Masjidil Haram padahal tidak diperbolehkan membawa masuk senjata ke dalam Masjidil Haram pada hari ini",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 967,
			"arabicnumber": 967,
			"text": "Telah menceritakan kepada kami [Ahmad bin Ya'qub] berkata, telah menceritakan kepadaku [Ishaq bin Sa'id bin Al 'Ash] dari [Bapaknya] berkata, \"Al Hajjaj datang menemui Ibnu 'Umar, dan saat itu aku sedang bersamanya. Al Hajjaj lalu bertanya, \"Bagaimana keadaannya?\" Ibnu 'Umar menjawab, \"Baik.\" Al Hajjaj bertanya lagi, \"Siapa yang melukaimu?\" [Ibnu 'Umar] menjawab, 'Yang melukai aku adalah orang yang memerintahkan membawa senjata pada suatu hari yang mana pada hari itu dilarang membawanya.' Yaitu Al Hajjaj",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 968,
			"arabicnumber": 968,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] berkata, telah menceritakan kepada kami [Syu'bah] dari [Zubaid] dari [Asy Sya'bi] dari [Al Bara'] berkata, \"Nabi shallallahu 'alaihi wasallam memberi khutbah kepada kami pada hari Nahr (penyembelihan kurban), beliau sabdakan: \"Sesungguhnya yang pertama kali kami lakukan pada hari Raya kami ini adalah shalat. Kemudian kami pulang dan melaksanakan penyembelihan kurban. Maka barangsiapa mengerjakan seperti itu berarti dia telah memenuhi sunnah kami. Dan barangsiapa menyembelih kurban sebelum pelaksanaan shalat 'Ied maka itu hanyalah daging yang dipersembahkan untuk keluarganya dan tidak sedikitpun mendapatkan (pahala) ibadah kurban.\" Tiba-tiba pamanku, Abu Burdah bin Niyar, berdiri dan berkata, \"Wahai Rasulullah, aku telah menyembelih hewan sebelum aku shalat, namun aku masih memiliki anak kambing yang lebih baik dari kambing yang telah berumur dua tahun.\" Maka beliau pun bersabda: \"Jadikanlah ia sebagai pengganti (dari apa yang telah kamu sembelih sebelum shalat).\" Atau beliau mengatakan: \"Sembelihlah, namun hal itu tidak mencukupi oleh orang selainmu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 969,
			"arabicnumber": 969,
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Ar'arah] berkata, telah menceritakan kepada kami [Syu'bah] dari [Sulaiman] dari [Muslim Al Bathin] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada amal yang lebih utama pada hari-hari (tasyriq) ini selian berkurban.\" Para sahabat berkata, \"Tidak juga jihad?\" Beliau menjawab: \"Tidak juga jihad. Kecuali seseorang yang keluar dari rumahnya dengan mengorbankan diri dan hartanya (di jalan Allah), lalu dia tidak kembali lagi",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 970,
			"arabicnumber": 970,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Malik bin Anas] berkata, telah menceritakan kepadaku [Muhammad bin Abu Bakar Ats Tsaqafi] berkata, \"Aku bertanya kepada [Anas bin Malik] -saat itu kami berdua sedang berangkat dari Mina menuju 'Arafah- tentang talbiyyah, 'Bagaimana kalian melaksanakannya bersama Nabi shallallahu 'alaihi wasallam? ' Dia menjawab, \"Di antara kami ada seorang yang membaca talbiyyah, namun hal itu tidak diingkari, dan ada yang bertakbir namun hal itu juga tidak diingkari",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 971,
			"arabicnumber": 971,
			"text": "Telah menceritakan kepada kami ['Umar bin Hafsh] berkata, telah menceritakan kepada kami [Bapakku] dari ['Ashim] dari [Hafshah] dari [Ummu 'Athiyyah] berkata, \"Pada hari Raya Ied kami diperintahkan untuk keluar sampai-sampai kami mengajak para anak gadis dari kamarnya dan juga para wanita yang sedang haid. Mereka duduk di belakang barisan kaum laki-laki dan mengucapkan takbir mengikuti takbirnya kaum laki-laki, dan berdoa mengikuti doanya kaum laki-laki dengan mengharap barakah dan kesucian hari raya tersebut",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 972,
			"arabicnumber": 972,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami ['Abdul Wahhab] berkata, telah menceritakan kepada kami ['Ubaidullah] dari [Nafi'] dari [Ibnu 'Umar], bahwa Nabi shallallahu 'alaihi wasallam menancapkan tombak pada hari Raya Fitri dan hari Raya kurban, kemudian beliau shalat",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 973,
			"arabicnumber": 973,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir Al Hizami] berkata, telah menceritakan kepada kami [Al Walid] berkata, telah menceritakan kepada kami [Abu Amru Al Auza'i] berkata, telah mengabarkan kepadaku [Nafi'] dari [Ibnu 'Umar], bahwa Nabi shallallahu 'alaihi wasallam berangkat menuju tempat shalat sedang di tangan beliau ada sebuat tongkat, tongkat tersebut beliau tancapkan di depannya lalu shalat menhhadap ke arahnya",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 974,
			"arabicnumber": 974,
			"text": "Telah menceritakan kepada kami ['Abdullah bin 'Abdul Wahhab] berkata, [Hammad bin Zaid] dari [Ayyub] dari [Muhammad] dari [Ummu 'Athiyyah] berkata, \"Nabi kami shallallahu 'alaihi wasallam memerintahkan kami untuk mengeluarkan para gadis remaja kami dan wanita-wanita yang dipingit di rumah.\" Dan dari [Ayyub] dari [Hafshah] seperti riwayat ini juga. Dalam hadits Hafshah ditambahkan, beliau bersabda. Atau Ummu 'Athiyyah berkata, \"Para gadis remaja kami dan wanita-wanita yang dipingit di rumah, dan wanita-wanita hadi menjauhi tempat shalat",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 975,
			"arabicnumber": 975,
			"text": "Telah menceritakan kepada kami ['Amru bin 'Abbas] berkata, telah menceritakan kepada kami ['Abdurrahman] telah menceritakan kepada kami [Sufyan] dari ['Abdurrahman bin 'Abis] berkata, Aku mendengar [Ibnu 'Abbas] berkata, \"Aku pernah keluar bersama Nabi shallallahu 'alaihi wasallam untuk shalat Hari Raya Fitri atau Adlha. Beliau melaksanakan shalat kemudian menyampaikan khutbah. Setelah itu, beliau mendatangi para wanita dan memberi pelajaran kepada mereka, mengingatkan dan memerintahkan agar bersedekah",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 976,
			"arabicnumber": 976,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Muhammad bin Thalhah] dari [Zubaid] dari [Asy Sya'bi] dari [Al Bara'] berkata, \"Nabi shallallahu 'alaihi wasallam keluar pada hari Raya kurban menuju Baqi', beliau lalu melaksanakan shalat dua rakaat, setelahitu beliau menghadap ke arah kami dan bersabda: \"Sesungguhnya yang pertama dari 'ibadah kita pada Hari Raya kita ini adalah memulai dengan melaksanakan shalat, kemudian kembali ke rumah dan menyembelih hewan kurban. Barangsiapa melaksanakan seperti itu berarti telah sesuai dengan sunnah kita. Dan barangsiapa menyembelih kurban sebelum shalat, maka itu hanyalah sesuatu yang dipersembahkan untuk keluarganya dan tidak ada sedikitpun termasuk dari ibadah kita ini.\" Lalu berdirilah seorang laki-laki dan berkata, \"Wahai Rasulullah, aku telah menyembelih (sebelum shalat), namun aku masih memiliki anak kambing yang lebih baik dari kambing yang telah berumur dua tahun?\" Beliau pun bersabda: \"Sembelihlah. Namun ini tidak berlaku bagi seorang pun setelahmu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 977,
			"arabicnumber": 977,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Sufyan] berkata, telah menceritakan kepadaku ['Abdurrahman bin 'Abis] berkata, aku mendengar [Ibnu 'Abbas] ketika dikatakan kepadanya, \"Apakah engkau pernah menghadiri shalat 'Ied bersama Nabi shallallahu 'alaihi wasallam?\" Dia menjawab, \"Ya. Kalau seandainya bukan karena kedudukanku yang masih kecil, tentu aku tak akan turut serta, hingga beliau mendatangi tanda yang ada di sisi rumah Katsir bin Ash Shalt. Beliau lalu shalat dan memberikan khutbah. Setelah itu beliau mendatangi jama'ah para wanita bersama Bilal, beliau memberi pelajaran kepada para wanita tersebut, mengingatkan mereka dan memerintahkan agar bersedekah. Maka aku menyaksikan para wanita tersebut memberikan apa yang ada pada tangan mereka (emas perhiasan), mereka meletakkannya ke dalam kain yang di bawa oleh Bilal. Setelah itu beliau dan Bilal pergi menuju rumahnya",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 978,
			"arabicnumber": 978,
			"text": "Telah menceritakan kepadaku [Ishaq bin Ibrahim bin Nashr] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah menceritakan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku ['Atha'] dari [Jabir bin 'Abdullah] berkata, Aku mendengarnya berkata, \"Nabi shallallahu 'alaihi wasallam berdiri untuk melaksanakan shalat pada hari Raya Iedul Fitri, dan yang pertama kali beliau kerjakan adalah shalat, baru kemudian menyampaikan khutbah. Selesai khutbah beliau turun (dari mimbar) dan mendatangi jama'ah wanita untuk mengingatkan mereka dengan bersandar pada tangan Bilal, sementara Bilal sendiri membentangkan kain miliknya hingga para wanita tersebut memasukkan sedekahnya ke dalam kain tersebut.\" Aku bertanya kepada 'Atha, 'Apakah itu zakat fitri? ' ia menjawab, 'Bukan, tetapi sedekah yang mereka keluarkan pada saat itu, mereka memberikan anting dan gelang mereka.' Aku bertanya lagi, 'Bagaimana pendapatmu jika masa sekarang ini seorang Imam mendatangi jama'ah para wanita lalu mengingatkan mereka tentang itu? ' 'Atha menjawab, 'Yang demikian itu merupakan hak mereka (para Imam), dan apa alasanya mereka tidak boleh melakukannya?",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 979,
			"arabicnumber": 979,
			"text": "[Ibnu Juraij] berkata; telah mengabarkan kepadaku [Al Hasan bin Muslim] dari [Thawus] dari [Ibnu 'Abbas] radliallahu 'anhuma, ia berkata, \"Aku pernah menghadiri shalat 'Idul Fitri bersama Nabi shallallahu 'alaihi wasallam, Abu Bakar, 'Umar dan 'Utsman? radliallahu 'anhum. Mereka semua melaksanakan shalat sebelum khutbah, dan menyampaikan khutbah setelah shalat. Nabi shallallahu 'alaihi wasallam kemudian pergi dan aku melihat seakan beliau memberi isyarat dengan tangannya agar jama'ah tetap duduk di tempatnya. Kemudian beliau melewati dan membelah shaf-shaf mereka hingga sampai pada jama'ah para wanita, dan saat itu Bilal juga bersama beliau. Beliau kemudian membaca ayat: '(Hai Nabi, apabila datang kepadamu perempuan-perempuan yang beriman untuk mengadakan janji setia, …) ' (Qs. Al Mumtahanah: 12), selesai membaca ayat tersebut beliau mengatakan: \"Apakah kalian siap untuk itu?\" salah seorang wanita dari mereka -dan tidak ada yang berani menjawab selain dia- berkata, \"Ya.\" -namun Hasan tidak tahu siapa wanita tersebut. Perawi berkata, \"Kemudian mereka bersedekah dan Bilal membentangkan selembar kain, kemudian Bilal berkata, \"Demi bapak dan ibuku, kemarilah! Sungguh, itu akan menjadi tebusan bagi kalian.\" Mereka kemudian melemparkan gelang (besar) dan cincin mereka ke dalam kain yang dibawa oleh Bilal.\" [Abdurrazaq] berkata, \"Al Fatakh adalah cincin besar (gelang) yang bisa mereka pakai pada masa jahiliyah",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 980,
			"arabicnumber": 980,
			"text": "Telah menceritakan kepada kami [Abu Ma'mar] berkata, telah menceritakan kepada kami ['Abdul Warits] berkata, telah menceritakan kepada kami [Ayyub] dari [Hafshah binti Sirin] berkata, \"Dahulu kami melarang anak-anak gadis remaja kami keluar untuk ikut melaksanakan shalat di Hari Raya 'Ied. Lalu datanglah seorang wanita ke kampung Bani Khalaf, maka aku pun menemuinya. Lalu ia menceritakan bahwa suami dari saudara perempuannya pernah ikut perang bersama Nabi shallallahu 'alaihi wasallam sebanyak dua belas peperangan, dan saudara perempuannya itu pernah mendampingi suaminya dalam enam kali peperangan.\" Ia (saudara wanitanya itu) berkata, \"Kami merawat orang yang sakit dan mengobati orang-orang yang terluka.\" Saudara perempuanku bertanya kepada Rasulullah, \"Wahai Rasulullah, apakah berdosa bila seorang dari kami tidak keluar karena tidak memiliki jilbab?\" Beliau menjawab: \"Hendaklah temannya meminjamkan jilbabnya, sehingga mereka dapat menyaksikan kebaikan dan mendo'akan Kaum Muslimin.\" Hafshah berkata, \"Ketika [Ummu 'Athiyyah] datang, aku menemuinya dan kutanyakan kepadanya, 'Apakah kamu pernah mendengar tentang ini dan ini? ' Dia menjawab, 'Iya. Demi bapakku'. Dan setiap kali dia menceritakan tentang Nabi shallallahu 'alaihi wasallam, dia selalu mengatakan 'Demi bapakku'. Beliau bersabda: \"Keluarkanlah para gadis remaja yang dipingit dalam rumah.\" Atau beliau bersabda: \"Para gadis remaja dan wanita-wanita yang dipingit dalam rumah -Ayyub masih ragu- dan wanita yang sedang haid. Dan hendaklah wanita yang sedang haid dijauhkan dari tempat shalat, agar mereka dapat menyaksikan kebaikah dan mendo'akan Kaum Muslimin.\" Hafshah berkata, \"Aku bertanya kepadanya, 'Wanita yang sedang haid juga? ' Dia menjawab, 'Bukankah mereka juga hadir di 'Arafah dan menyaksikan ini dan itu?",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 981,
			"arabicnumber": 981,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] berkata, telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Ibnu 'Aun] dari [Muhammad] berkata, \" [Ummu 'Athiyyah] berkata, \"Kami diperintahkan untuk keluar, maka kami keluarkan pula para wanita yang sedang haid, gadis remaja dan wanita-wanita yang dipingit dalam rumah.\" Ibnu Aun menyebutkan, \"Atau gadis-gadis remaja yang dipingit. Adapun wanita haid, maka mereka dapat menyaksikan (menghadiri) jama'ah kaum Muslimin dan mendo'akan mereka, dan hendaklah mereka menjauhi tempat shalat mereka (kaum laki-laki)",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 982,
			"arabicnumber": 982,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah menceritakan kepada kami [Al Laits] berkata, telah menceritakan kepadaku [Katsir bin Farqad] dari [Nafi'] dari [Ibnu 'Umar], bahwa Nabi shallallahu 'alaihi wasallam biasa berkurban atau menyembelih hewan kurban di tempat shalat",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 983,
			"arabicnumber": 983,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Al Ahwash] berkata, telah menceritakan kepada kami [Manshur bin Al Mutamir] dari [Asy Sya'bi] dari [Al Bara' bin 'Azib] berkata, \"Rasulullah shallallahu 'alaihi wasallam memberikan khutbah pada hari kurban setelah shalat. Beliau katakan: \"Barangsiapa shalat seperti shalat kita dan melaksanakan manasik (penyembelihan kurban) seperti kita berarti telah mendapatkan pahala berkurban. Dan barangsiapa menyembelih kurban sebelum shalat maka itu hanyalah kambing yang dinikmati dagingnya.\" Maka Abu Burdah bin Niyar berdiri dan berkata, \"Wahai Rasulullah, aku telah menyembelih sebelum aku keluar untuk shalat, dan aku mengetahui bahwa hari ini adalah hari makan dan minum, aku lalu menyegerakan penyembelihannya, kemudian aku berikan kepada keluarga dan para tetanggaku.\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Itu hanyalah kambing yang dinikmati dagingnya.\" Abu Burdah bertanya lagi, \"Namun aku masih memiliki anak kambing yang lebih baik dari kambing yang telah aku sembelih itu. Apakah dibenarkan kalau aku menyembelihnya?\" Beliau menjawab: \"Ya. Akan tetapi tidak boleh untuk seorangpun setelah kamu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 984,
			"arabicnumber": 984,
			"text": "Telah menceritakan kepada kami [Hamid bin 'Umar] dari [Hammad bin Zaid] dari [Ayyub] dari [Muhammad] bahwa [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan shalat hari Raya kurban kemudian menyampaikan khutbah, beliau katakan: \"Barangsiapa menyembelih hewan sebelum shalat, maka dia harus menyembelih ulang.\" Lalu berdirilah seorang laki-laki Anshar seraya berkata, \"Wahai Rasulullah, para tetanggaku!\" Orang itu entah berkata, \"Mereka sangat membutuhkan.\" atau \"Mereka orang-orang miskin. Dan aku telah menyembelih kurban sebelum shalat. Namun aku masih punya anak kambing yang lebih aku cintai dari pada kambing yang telah aku sembelih?\" Maka beliau pun memberikan keringanan untuk orang itu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 985,
			"arabicnumber": 985,
			"text": "Telah menceritakan kepada kami [Muslim] berkata, telah menceritakan kepada kami [Syu'bah] dari [Al Aswad] dari [Jundub] berkata, \"Nabi shallallahu 'alaihi wasallam melaksanakan shalat Hari Raya kurban lalu menyampaikan khutbah, beliau katakan: \"Barangsiapa menyembelih hewan sebelum shalat maka dia harus menyembelih hewan kurban lain sebagai penggantinya. Dan siapa yang belum menyembelihnya maka sembelihlah atas nama Allah",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 986,
			"arabicnumber": 986,
			"text": "Telah menceritakan kepada kami [Muhammad] -yaitu Ibnu Salam- berkata, telah mengabarkan kepada kami [Abu Tumailah Yahya bin Wadlih] dari [Fulaih bin Sulaiman] dari [Sa'id bin Al Harits] dari [Jabir bin 'Abdullah] radliallahu 'anhuma, ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam shalat 'Ied, beliau mengambil jalan yang berbeda (antara berangkat dan kembali).\" Hadits ini dikuatkan oleh [Yunus bin Muhammad] dari [Fulaih]. Dan [Muhammad bin Ash Shalt] berkata dari [Fulaih] dari [Sa'id] dari [Abu Hurairah]. Dan hadits Jabir lebih shahih",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 988,
			"arabicnumber": 988,
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 989,
			"arabicnumber": 989,
			"text": "Telah menceritakan kepada kami [Abu Al Walid] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepadaku ['Adi bin Tsabit] berkata, aku mendengar [Sa'id bin Jubair] dari [Ibnu 'Abbas], bahwa Nabi shallallahu 'alaihi wasallam keluar pada Hari Raya 'Iedul Fitri, beliau melaksanakan shalat dua rakaat, tanpa melaksanakan shalat baik sebelum atau sesudahnya. Dan saat itu beliau bersama Bilal? radliallahu 'anhu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 37
			}
		}
	]
}