{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"16": "Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1040,
			"arabicnumber": 1040,
			"text": "Telah menceritakan kepada kami ['Amru bin 'Aun] berkata, telah menceritakan kepada kami [Khalid] dari [Yunus] dari [Al Hasan] dari [Abu Bakrah] berkata, \"Kami pernah duduk-duduk bersama Rasulullah shallallahu 'alaihi wasallam lalu terjadi gerhana matahari. Maka Nabi shallallahu 'alaihi wasallam berdiri menjulurkan selendangnya hingga masuk ke dalam masjid, kamipun ikut masuk ke dalam Masjid, beliau lalu mengimami kami shalat dua rakaat hingga matahari kembali nampak bersinar. Setelah itu beliau bersabda: \"Sesungguhnya matahari dan bulan tidak akan mengalami gerhana disebabkan karena matinya seseorang. Jika kalian melihat gerhana keduanya, maka dirikanlah shalat dan banyaklah berdoa hingga selesai gerhana yang terjadi pada kalian",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1041,
			"arabicnumber": 1041,
			"text": "Telah menceritakan kepada kami [Syihab bin 'Abbad] berkata, telah menceritakan kepada kami [Ibrahim bin Humaid] dari [Isma'il] dari [Qais] berkata, \"Aku mendengar [Abu Mas'ud] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya matahari dan bulan tidak akan mengalami gerhana disebabkan karena matinya seorang dari manusia, tetapi keduanya adalah dua tanda dari tanda-tanda kebesaran Allah. Jika kalian melihat gerhana keduanya maka berdirilah untuk shalat",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1042,
			"arabicnumber": 1042,
			"text": "Telah menceritakan kepada kami [Ashbagh] berkata, telah mengabarkan kepadaku [Ibnu Wahb] berkata, telah mengabarkan kepadaku ['Amru] dari ['Abdurrahman bin Al Qasim] menceritakan dari [Bapaknya] dari [Ibnu 'Umar], bahwa dia mengabarkan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya matahari dan bulan tidak akan mengalami gerhana disebabkan mati atau hidupnya seseorang, akan tetapi keduanya adalah dua tanda dari tanda-tanda kebesaran Allah. Maka jika kalian melihat gerhana keduanya, hendaklah shalatlah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1043,
			"arabicnumber": 1043,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] berkata, telah menceritakan kepada kami [Hasyim bin Al Qasim] berkata, telah menceritakan kepada kami [Syaiban Abu Mu'awiyyah] dari [Ziyad bin 'Alaqah] dari [Al Mughirah bin Syu'bah] berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari, yaitu di hari meninggalnya putera beliau, Ibrahim. Orang-orang lalu berkata, \"Gerhana matahari ini terjadi karena meninggalnya Ibrahim!\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Sesungguhnya matahari dan bulan tidak akan mengalami gerhana disebabkan karena mati atau hidupnya seseorang. Jika kalian melihat gerhana, maka shalat dan berdoalah kalian kepada Allah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1044,
			"arabicnumber": 1044,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Aisyah] bahwasanya dia berkata, \"Pernah terjadi gerhana matahari pada zaman Rasulullah shallallahu 'alaihi wasallam. Rasulullah shallallahu 'alaihi wasallam lalu mendirikan shalat bersama orang banyak. Beliau berdiri dalam shalatnya dengan memanjangkan lama berdirinya, kemudian rukuk dengan memanjangkan rukuknya, kemudian berdiri dengan memanjangkan lama berdirinya, namun tidak selama yang pertama. Kemudian beliau rukuk dan memanjangkan lama rukuknya, namun tidak selama rukuknya yang pertama. Kemudian beliau sujud dengan memanjangkan lama sujudnya, beliau kemudian mengerjakan rakaat kedua seperti pada rakaat yang pertama. Saat beliau selesai melaksanakan shalat, matahari telah nampak kembali. Kemudian beliau menyampaikan khutbah kepada orang banyak, beliau memulai khutbahnya dengan memuji Allah dan mengangungkan-Nya, lalu bersabda: \"Sesungguhnya matahari dan bulan adalah dua tanda dari tanda-tanda kebesaran Allah, dan tidak akan mengalami gerhana disebabkan karena mati atau hidupnya seseorang. Jika kalian melihat gerhana, maka banyaklah berdoa kepada Allah, bertakbirlah, dirikan shalat dan bersedekahlah.\" Kemudian beliau meneruskan sabdanya: \"Wahai ummat Muhammad! Demi Allah, tidak ada yang melebihi kecemburuan Allah kecuali saat Dia melihat hamba laki-laki atau hamba perempuan-Nya berzina. Wahai ummat Muhammad! Demi Allah, seandainya kalian mengetahui apa yang aku ketahui, niscaya kalian akan sedikit tertawa dan lebih banyak menangis",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1045,
			"arabicnumber": 1045,
			"text": "Telah menceritakan kepada kami [Ishaq] berkata, telah mengabarkan kepada kami [Yahya bin Shalih] berkata, telah menceritakan kepada kami [Mu'awiyah bin Salam bin Abu Salam Al Habasyi Ad Dimsyqi] berkata, telah menceritakan kepada kami [Yahya bin Abu Katsir] berkata, telah mengabarkan kepadaku [Abu Salamah bin 'Abdurrahman bin 'Auf Az Zuhri] dari ['Abdullah bin 'Amru] berkata, \"Ketika terjadi gerhana matahari pada masa Rasulullah shallallahu 'alaihi wasallam, maka panggilannya dengan seruan, 'Ashshalaatul jaami'ah (Marilah mendirikan shalat secara bersama-sama)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1046,
			"arabicnumber": 1046,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah menceritakan kepadaku [Al Laits] dari ['Uqail] dari [Ibnu Syihab]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Ahmad bin Shalih] berkata, telah menceritakan kepada kami ['Anbasah] berkata, telah menceritakan kepada kami [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku ['Urwah] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata, \"Pernah terjadi gerhana matahari pada masa Nabi shallallahu 'alaihi wasallam. Beliau keluar menuju masjid, lalu orang-orang membuat barisan di belakang beliau, beliau lalu takbir dan membaca surat yang panjang. Lalu beliau takbir dan rukuk dengan rukuk yang panjang, lalu mengucapkan SAMI'ALLAHU LIMAN HAMIDAH dan berdiri tanpa sujud. Kemudian beliau membaca bacaan yang panjang namun tidak sebagaimana bacaan yang pertama, lalu takbir dan rukuk dengan rukuk yang panjang namun tidak sebagaimana rukuk yang pertama, lalu mengucapkan SAMI'ALLAHU LIMAN HAMIDAH terus kemudian sujud. Setelah itu beliau melakukannya sepeti itu pada rakaat yang akhir hingga sempurnalah empat rukuk dalam empat sujud. Dan matahari nampak kembali sebelum shalat beliau selesai. Setelah itu beliau berdiri (menyampaikan khutbah) dengan memuji Allah dengan pujian yang patas untuk-Nya, beliau bersabda: \"Keduanya adalah dua tanda dari tanda-tanda kebesaran Allah, dan gerhana tidak akan terjadi hanya karena mati atau hidupnya seseorang. Jika kalian melihat (gerhan) keduanya, maka bersegeralah mendirikan shalat.\" [Katsir bin 'Abbas] menceritakan bahwa ['Abdullah bin 'Abbas] radliallahu 'anhuma menceritakan tentang hari terjadinya gerhana marahari seperti hadits 'Urwah dari 'Aisyah ini. Aku lalu berkata kepada 'Urwah, \"Sesungguhnya ketika terjadi gerhana di Madinah, saudaramu tidak pernah menambah lebih dari dua rakaat, seperti shalat shubuh.\" Dia menjawab, \"Benar. Dia telah ia telah menyelisihi sunnah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1047,
			"arabicnumber": 1047,
			"text": "Telah menceritakan kepada kami [Sa'id bin 'Ufair] berkata, telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] berkata, telah mengabarkan kepadaku ['Urwah bin Az Zubair] bahwa ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam ketika hari terjadinya gerhana matahari, beliau berdiri melaksanakan shalat. Beliau takbir, kemudian membaca dengan bacaan surah yang panjang, lalu rukuk dengan rukuk yang panjang, lalu mengangkat kepalanya seraya membaca SAMI'ALLAHU LIMAN HAMIDAH. Beliau lalu kembali berdiri sebagaimana sebelumnya dan membaca bacaan yang panjang, namun tidak sepanjang yang pertama, lalu rukuk dengan rukuk yang panjang, namun tidak sebagaimana rukuk yang pertama. Kemudian beliau sujud dengan sujud yang panjang. Kemudian beliau mengerjakan seperti itu pada rakaat yang akhir, lalu beliau salam sementara matahari sudah tampak kembali. Setelah itu beliau menyampaikan khutbah di hadapan manusia dan menyebutkan tentang gerhana matahari dan bulan, beliau katakan: \"Keduanya adalah dua tanda dari tanda-tanda kebesaran Allah yang tidak akan terjadi gerhana disebabkan karena mati atau hidupnya seseorang. Maka jika kalian melihat gerhana keduanya, hendaklah kalian segera mendirikan shalat",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1048,
			"arabicnumber": 1048,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Yunus] dari [Al Hasan] dari [Abu Bakrah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya matahari dan bulan adalah dua tanda dari tanda-tanda kebesaran Allah, dan keduanya tidak akan mengalami gerhana disebabkan karena mati atau hidupnya seseorang. Akan tetapi dengan peristiwa itu Allah Ta'ala ingin membuat para hamba-Nya takut (dengan siksa-Nya).\" Abu 'Abdullah berkata, \" ['Abdul Warits] dan [Syu'bah] dan [Khalid bin 'Abdullah] dan [Hammad bin Salamah] dari [Yunus] tidak menyebutkan lafadz, 'Akan tetapi dengan peristiwa tersebut Allah Ta'ala ingin membuat para hamba-Nya takut (dengan siksa-Nya).\" Riwayat ini dikuatkan oleh ['Asy'ats] dari [Al Hasan], dan dikuatkan juga oleh [Musa] dari [Mubarak] dari [Al Hasan] ia berkata; telah mengabarkan kepadaku [Abu Bakrah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya Allah Ta'ala dengan peristiwa itu Allah ingin membuat takut para hamba-Nya (dari siksa-Nya)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1050,
			"arabicnumber": 1050,
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1051,
			"arabicnumber": 1051,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Syaiban] dari [Yahya] dari [Abu Salamah] dari ['Abdullah bin 'Amru] bahwa dia berkata, \"Saat terjadi gerhana matahari di zaman Rasulullah shallallahu 'alaihi wasallam, maka diserukan dengan panggilan, 'Ashshalaatul jaami'ah (Marilah mendirikan shalat secara bersama-sama) '. Nabi shallallahu 'alaihi wasallam lalu rukuk dua kali dalam satu kali sujud, kemudian berdiri kembali dan rukuk dua kali dengan satu kali sujud. Kemudian beliau duduk sementara matahari telah nampak kembali.\" 'Abdullah bin 'Amru berkata, 'Aisyah? radliallahu 'anha berkata, \"Tidak pernah aku melaksanakan satu sujudpun yang lebih panjang darinya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Zaid bin Aslam] dari ['Atha bin Yasar] dari ['Abdullah bin 'Abbas] ia berkata, \"Telah terjadi gerhana matahari pada zaman Rasulullah shallallahu 'alaihi wasallam. Rasulullah shallallahu 'alaihi wasallam kemudian melaksanakan shalat, beliau berdiri dengan sangat panjang (lama) sekadar bacaan surah Al Baqarah. Lalu beliau rukuk dengan rukuk yang panjang, lalu mengangkat (kepala) berdiri dengan panjang namun tidak sepanjang yang pertama. Kemudian rukuk kembali dengan panjang namun tidak sepanjang rukuk yang pertama. Kemudian sujud. Kemudian beliau kembali berdiri dengan panjang namun tidak sepanjang yang pertama, lalu rukuk dengan rukuk yang panjang namun tidak sepanjang rukuk yang pertama, lalu mengangkat (kepala) berdiri dengan panjang namun tidak sepanjang yang pertama. Kemudian beliau rukuk kembali dengan panjang namun tidak sepanjang rukuk yang pertama. Kemudian sujud. Kemudian beliau berlalu pergi sementara matahari sudah nampak kembali. Beliau kemudian bersabda: \"Sesungguhnya matahari dan bulan adalah dua tanda dari tanda-tanda kebesaran Allah, dan keduanya tidak akan mengalami gerhana disebabkan karena mati atau hidupnya seseorang. Jika kalian melihatnya maka banyaklah mengingat Allah.\" Para sahabat bertanya, \"Wahai Rasulullah, kami melihat tuan merasakan sesuatu pada posisi tuan dan kami melihat seakan tuan menahan perasaan takut?\" Beliau menjawab: \"Sungguh aku melihat surga, dan didalamnya aku memperoleh setandan anggur. Seandainya aku mengambilnya tentu kalian akan memakannya sehingga urusan dunia akan terabaikan. Kemudian aku melihat neraka, dan aku belum pernah melihat suatu pemandangan yang lebih mengerikan dibanding hari ini, dan aku melihat kebanyakan penghuninya adalah kaum wanita.\" Para sahabat bertanya lagi, \"Mengapa begitu wahai Rasulullah?\" Beliau menjawab: \"Karena mereka sering kufur (mengingkari).\" Ditanyakan kepada beliau, \"Apakah mereka mengingkari Allah?\" Beliau menjawab: \"Mereka mengingkari pemberian suami, mengingkari kebaikan. Seandainya kamu berbuat baik terhadap salah seorang dari mereka sepanjang masa, lalu dia melihat satu saja kejelekan darimu maka dia akan berkata, 'Aku belum pernah melihat kebaikan darimu sedikitpun",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Hisyam bin 'Urwah] dari isterinya [Fatimah binti Al Mundzir] dari [Asma' binti Abu Bakar] radliallahu 'anhuma, bahwasanya dia berkata, \"Aku pernah datang menemui 'Aisyah? radliallahu 'anha, isteri Nabi shallallahu 'alaihi wasallam, ketika terjadi gerhana matahari. Ternyata orang-orang sedang melaksanakan shalat dan saat itu ia juga ikut melaksanakannya. Setelah itu aku bertanya kepadanya, \"Apa yang dilakukan orang-orang?\" Aisyah memberi isyarat dengan tangannya ke langit seraya berkata, \"Maha suci Allah!\" Aku bertanya, \"Satu tanda saja?\" Lalu dia memberi isyarat tanda mengiyakan. Maka akupun ikut shalat sementara timbul perkara yang membingungkanku, hingga aku siram kepalaku dengan air. Selesai shalat Rasulullah shallallahu 'alaihi wasallam memuji Allah dan mensucikan-Nya, lalu bersabda: \"Tidak ada sesuatu yang belum diperlihatkan kepadaku, kecuali aku sudah melihatnya dari tempatku ini, hingga surga dan neraka. Kemudian diwahyukan kepadaku, bahwa Kalian akan terkena fitnah dalam kubur kalian seperti, atau seupa dengan fitnah Dajjal -Aku sendiri tidak tahu mana dari keduanya yang dikatakan oleh Asma'-. Salah seorang dari kalian akan dihadapkan lalu ditanya, 'Apa yang kamu ketahui tentang laki-laki ini? ' Orang beriman atau orang yang yakin -Aku tidak tahu mana dari keduanya yang dikatakan ileh Asma'- akan menjawab, 'Dia adalah Muhammad Rasulullah shallallahu 'alaihi wasallam, dia datang kepada kami membawa penjelasan dan petunjuk. Maka kami sambut, kami beriman kepadanya dan kami ikuti (ajarannya).' Maka kepada orang itu dikatakan, 'Tidurlah kamu dengan baik, sungguh kami telah mengetahui bahwa kamu adalah orang yang yaqin.' Adapun orang Munafik atau orang yang ragu - aku tidak tahu mana dari keduanya yang dikatakan oleh Asma'- akan menjawab, 'Aku tidak tahu siapa dia, aku mendengar orang-orang mengatakan sesuatu, maka aku pun ikut mengatakannya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1054,
			"arabicnumber": 1054,
			"text": "Telah menceritakan kepada kami [Rabi' bin Yahya] berkata, telah menceritakan kepada kami [Za'idah] dari [Hisyam] dari [Fatimah] dari [Asma'] berkata, \"Nabi shallallahu 'alaihi wasallam telah memerintahkan untuk membebaskan budak ketika terjadi gerhana matahari",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1056,
			"arabicnumber": 1056,
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1057,
			"arabicnumber": 1057,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah telah menceritakan kepada kami [Yahya bin Sa'id] dari [Isma'il] berkata, telah menceritakan kepadaku [Qais] dari [Ibnu Mas'ud] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Matahari dan bulan tidak akan mengalami gerhana disebabkan karena mati atau hidupnya seseorang, akan tetapi keduanya adalah dua tanda dari tanda-tanda kebesaran Allah. Jika kalian melihat gerhana keduanya maka shalatlah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1058,
			"arabicnumber": 1058,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] berkata, telah menceritakan kepada kami [Hisyam] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dan [Hisyam bin 'Urwah] dari ['Urwah] dari ['Aisyah] berkata, \"Pernah terjadi gerhana matahari pada zaman Rasulullah shallallahu 'alaihi wasallam. Maka beliau berdiri melaksanakan shalat bersama orang banyak, beliau memanjangkan bacaan, lalu rukuk dengan memanjangkan rukuk, kemudian mengangkat kepalanya, lalu membaca lagi dengan memanjangkan bacaannya namun tidak sebagaimana panjang bacaan yang pertama. Kemudian beliau rukuk lagi dengan memanjangkan rukuk, namun tidak sepanjang rukuk yang pertama, lalu mengangkat kepalanya kemudian sujud dua kali. Beliau kemudian berdiri kembali dan mengerjakan seperti pada rakaat pertama. Setelah itu beliau bangkit dan bersabda: \"Sesungguhnya matahari dan bulan tidak akan mengalami gerhana disebabkan karena mati atau hidupnya seseorang, akan tetapi keduanya adalah dua tanda dari tanda-tanda kebesaran Allah, yang Dia perlihatkan kepada hamba-hambaNya. Jika kalian melihat gerhana keduanya, maka segeralah mendirikan shalat",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1059,
			"arabicnumber": 1059,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Buraid bin 'Abdullah] dari [Abu Burdah] dari [Abu Musa] berkata, \"Ketika terjadi gerhana matahari, Nabi shallallahu 'alaihi wasallam berdiri dengan tergesa-gesa seolah akan terjadi hari kiamat. Beliau lantas mendatangi masjid dan shalat dengan berdiri, rukuk dan sujud yang paling panjang, yang pernah aku lihat dari yang beliau pernah lakukan. Kemudian beliau bersabda: \"Inilah dua tanda-tanda yang Allah kirimkan, ia tidak terjadi karena hidup atau matinya seseorang, tetapi '(Dia, Allah mempertakuti hamba-hambaNya dengannya) ' (Qs. Az ZUmar: 16). Maka jika kalian melihat sesuatu padanya (gerhana), maka segeralah untuk mengingat Allah, berdoa dan minta ampunan",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1060,
			"arabicnumber": 1060,
			"text": "Telah menceritakan kepada kami [Abu Al Walid] berkata, telah menceritakan kepada kami [Zaidah] berkata, telah menceritakan kepada kami [Ziyad bin 'Alaqah] berkata, \"Aku mendengar [Al Mughirah bin Syu'bah] berkata, \"Telah terjadi gerhana matahari ketika wafatnya Ibrahim. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya matahari dan bulan adalah dua tanda dari tanda-tanda kebesaran Allah, dan ia tidak akan mengalami gerhana disebabkan karena mati atau hidupnya seseorang. Jika kalian melihat gerhana keduanya, maka berdo'alah kepada Allah dan dirikan shalat hingga (matahari) kembali nampak",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1062,
			"arabicnumber": 1062,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghoilan] berkata, telah telah menceritakan kepada kami [Sa'id bin 'Amir] dari [Syu'bah] dari [Yunus] dari [Al Hasan] dari [Abu Bakrah radliallahu 'anhu] berkata: \"Telah pernah terjadi gerhana matahari pada zaman Rasulullah shallallahu 'alaihi wasallam, kemudian Beliau mendirikan shalat dua raka'at",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1063,
			"arabicnumber": 1063,
			"text": "Telah menceritakan kepada kami [Abu Ma'mar] berkata, telah telah menceritakan kepada kami ['Abdul Warits] berkata, telah menceritakan kepada kami [Yunus] dari [Al Hasan] dari [Abu Bakrah] berkata: \"Telah terjadi gerhana matahari pada zaman Rasulullah shallallahu 'alaihi wasallam lalu Beliau keluar dengan menyingsingkan selendangnya hingga tiba di masjid. Maka orang-orang berkumpul mengelilingi Beliau. Lalu Beliau memimpin shalat bersama mereka dua raka'at hingga matahari kembali nampak. Kemudian Beliau bersabda: \"Matahari dan bulan adalah dua tanda dari tanda-tanda kebesaran Allah dan keduanya tidak akan mengalami gerhana disebabkan karena kematian seseorang. Jika terjadi gerhana, maka dirikanlah shalat dan banyaklah berdo'a hingga selesai gerhana yang terjadi pada kalian\". Peristiwa ini berkenaan ketika putra Nabi shallallahu 'alaihi wasallam yang bernama Ibrahim wafat yang manusia kemudian memperbincangkannya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghoilan] berkata, telah menceritakan kepada kami [Abu Ahmad] berkata, telah menceritakan kepada kami [Sufyan] dari [Yahya] dari ['Amrah] dari ['Aisyah radliallahu 'anha] bahwa Nabi shallallahu 'alaihi wasallam shalat bersama mereka (para sahabat) ketika terjadi gerhana matahari dengan empat ruku' dalam dua kali sujud, dan rakaat yang pertama lebih panjang",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1066,
			"arabicnumber": 1066,
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 24
			}
		}
	]
}