{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"21": "Actions while Praying"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1198,
			"arabicnumber": 1198,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Makhramah bin Sulaiman] dari [Kuraib] sahaya Ibnu 'Abbas radliallahu 'anhu bahwa dia mengabarkan dari ['Abdullah bin 'Abbas radliallahu 'anhuma] bahwa dia pada suatu malam bermalam di rumah Maimunah Ummul Mu'minin radliallahu 'anha, dia adalah bibinya, katanya: \"Maka aku berbaring di sisi bantal bagian lebar, sementara Nabi shallallahu 'alaihi wasallam dan keluarganya pada bagian panjang, lantas Rasulullah shallallahu 'alaihi wasallam tidur hingga pada tengah malam kurang sedikit atau lewat sedikit, Beliau shallallahu 'alaihi wasallam bangun lalu sambil duduk Beliau mengusap (sisa) tidur pada wajahnya dengan tangannya. Kemudian membaca sepuluh ayat terakhir dari Surah Ali 'Imran. Kemudian berdiri menuju tempat wudhu' lalu Beliau berwudhu' dengan sebaik-baiknya, kemudian shalat\". Berkata, Ibnu 'Abbas radliallahu 'anhu, \"Maka aku pun bangun dan aku lakukan seperti yang Beliau shallallahu 'alaihi wasallam lakukan. Lalu aku menuju kepadanya dan berdiri di sampingnya. Maka Beliau meletakkan tangan kanannya di kepalaku seraya memegang telingaku hingga menggeserku ke sebelah kanannya. Kemudian Beliau shalat dua raka'at, kemudian dua raka'at, kemudian dua raka'at, kemudian dua raka'at, kemudian witir (ganjil) kemudian berbaring hingga datang kepadanya mu'adzin (mengumandangkan adzan). Maka Beliau shalat dua raka'at dengan ringan lalu keluar untuk menunaikan shalat Shubuh",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1199,
			"arabicnumber": 1199,
			"text": "Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Ibnu Fudhail] telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] dari ['Alqamah] dari ['Abdullah radliallahu 'anhu] berkata: \"Kami pernah memberi salam kepada Nabi shallallahu 'alaihi wasallam ketika Beliau sedang shalat dan Beliau membalas salam kami. Ketika kami kembali dari (negeri) An-Najasyi kami memberi salam kembali kepada Beliau namun Beliau tidak membalas salam kami. Kemudian Beliau berkata: \"Sesungguhnya dalam shalat ada kesibukan\". Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Ishaq bin Manshur As-Saluliy] telah menceritakan kepada kami [Huraim bin Sufyan] dari [Al A'masy] dari [Ibrahim] dari ['Alqamah] dari ['Abdullah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam yang seperti ini juga",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1200,
			"arabicnumber": 1200,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami ['Isa] dia adalah putra Yunus dari [Isma'il] dari [Al Harits bin Syubail] dari [Abu 'Amru Asy Syaibaniy] berkata; [Zaid bin Arqam] berkata, kepadaku: \"Sungguh kami pernah berbicara ketika sedang shalat hingga ada seorang diantara kami yang berbicara dengan temannya tentang kebutuhannya sampai kemudian turun firman Allah Ta'ala (dalam surah Al Baqarah) \"Peliharalah seluruh shalat kalian dan shalat Al Wustha dan berdirilah (dalam shalat) untuk Allah dengan khusyu'\". (QS. Albaqarah, 238), Maka kami diperintah untuk diam",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1201,
			"arabicnumber": 1201,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] telah menceritakan kepada kami ['Abdul 'Aziz bin Abu Hazim] dari [bapaknya] dari [Sahal bin Sa'ad radliallahu 'anhu] berkata; Suatu hari Rasulullah shallallahu 'alaihi wasallam keluar rumah untuk menyelesaikan masalah yang terjadi diantara suku Bani 'Amru bin 'Auf bin Al Harits kemudian tiba waktu shalat. Maka Bilal menemui Abu Bakar radliallahu 'anhuma seraya berkata: \"Nabi shallallahu 'alaihi wasallam sedang berhalangan, apakah engkau mau memimpin shalat berjama'ah? Dia (Abu Bakar) menjawab: \"Boleh, jika kalian menghenmdaki\". Maka Bilal membacakan iqamat shalat dan Abu Bakar maju memimpin shalat. Tak lama kemudian datang Nabi shallallahu 'alaihi wasallam berjalan menerobos tengah-tengan shaf membelah barisan hingga sampai di shaf pertama. Maka orang-orang memberi isyarat dengan bertepuk tangan. Sahal berkata: \"Apakah kalian tahu bahwa At-Tashfiih berbeda dengan At-Tashfiiq? Saat itu Abu Bakar tidak bereaksi dan tetap meneruskan shalatnya. Ketika suara tepukan semakin banyak, Abu Bakar berbalik dan ternyata dia melihat ada Nabi shallallahu 'alaihi wasallam dalam barisan. Maka Nabi shallallahu 'alaihi wasallam memberi isyarat kepadanya agar dia tetap pada posisinya. Abu Bakar mengangkat kedua tangannya lalu memuji Allah kemudian Abu Bakar mundur, lalu Nabi shallallahu 'alaihi wasallam maju untuk melanjutkan shalat",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1202,
			"arabicnumber": 1202,
			"text": "Telah menceritakan kepada kami ['Amru bin 'Isa] telah menceritakan kepada kami [Abu 'Abdush Shamad 'Abdul 'Aziz bin 'Abdush Shamad] telah menceritakan kepada kami [Hushain bin 'Abdurrahman] dari [Abu Wa'il] dari ['Abdullah bin Mas'ud radliallahu 'anhu] berkata; \"Kami pernah membaca at-tahiyat dalam shalat, yang dalam tersebut kami menyebut nama dan memberi salam kepada beberapa diantara kami. Hal ini kemudian didengar oleh Rasulullah shallallahu 'alaihi wasallam hingga akhirnya Beliau bersabda: \"Bacalah: \"Attahiyyaatu lillahi washshalawaatu waththayyibaat. Assalaamu 'alaika ayyuhannabiyyu wa rahmatullohi wa barakaatuh. Assalaamu 'alainaa wa 'alaa 'ibaadillahish shaolihiin. Asyhadu allaa ilaaha illallah wa asyhadu anna Muhammadan 'abduhu wa rasuuluh\" \" (Segala penghormatan hanya milik Allah, juga segala pengagungan dan kebaikan. Semoga kesejahteraan terlimpahkan kepada engkau wahai Nabi dan juga rahmat dan berkahNya. Dan juga semoga kesejahteraan terlimpahkan kepada kami dan kepada hamba-hamba Allah yang shalih. Aku bersaksi tidak ada ilah yang berhaq disembah selain Allah dan aku bersaksi bahwa Muhammad adalah hamba dan utusanNya\"). Karena apabila kalian melakukan seperti ini, maka berarti kalian telah mengucapkan salam kepada seluruh hanba Allah yang shalih yang ada di langit dan bumi",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1203,
			"arabicnumber": 1203,
			"text": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Az Zuhriy] dari [Abu Salamah] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya ucapan tasbih buat laki-laki sedangkan bertepuk tangan buat wanita",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1204,
			"arabicnumber": 1204,
			"text": "Telah menceritakan kepada kami [Yahya] telah mengabarkan kepada kami [Waki'] dari [Sufyan] dari [Abu Hazim] dari [Sahal bin Sa'ad radliallahu 'anhu] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya ucapan tasbih buat laki-laki sedangkan bertepuk tangan buat wanita",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1205,
			"arabicnumber": 1205,
			"text": "Telah menceritakan kepada kami [Bisyir bin Muhammad] telah mengabarkan kepada kami ['Abdullah] berkata, [Yunus] berkata, [Az Zuhriy] telah mengabarkan kepada saya [Anas bin Malik Al Anshariy radliallahu 'anhu] bahwa; Ketika Kaum Muslimin sedang melaksanakan shalat Shubuh pada hari Senin yang dipimpin Abu Bakar radliallahu 'anhu, mereka dikejutkan oleh Nabi shallallahu 'alaihi wasallam yang menyingkap tabir kamar 'Aisyah radliallahu 'anha. Dari balik kamar itu Nabi shallallahu 'alaihi wasallam memandang mereka saat mereka berada dalam barisan shaf. Beliau tersenyum dan tertawa. Maka Abu Bakar berbalik untuk masuk kedalam barisan shaf karena menduga Nabi shallallahu 'alaihi wasallam akan keluar untuk shalat. Kaum Muslimin merasa terganggu dalam shalat mereka karena sangat gembiranya dapat melihat Nabi shallallahu 'alaihi wasallam. Ternyata Beliau shallallahu 'alaihi wasallam memberi isyarat dengan tangan Beliau agar mereka melanjutkan shalat. Kemudian Beliau masuk ke kamarnya dengan menutup tabir. Beliau shallallahu 'alaihi wasallam akhirnya wafat pada hari itu",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1206,
			"arabicnumber": 1206,
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1207,
			"arabicnumber": 1207,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syaiban] dari [Yahya] dari [Abu Salamah] berkata, telah menceritakan kepada saya [Mu'aiqib] bahwa Nabi shallallahu 'alaihi wasallam berkata tentang seseorang yang mengusapkan tanah ke mukanya ketika sedang sujud. Beliau bersabda: \"Jika kamu melakukannya, lakukanlah sekali saja",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1208,
			"arabicnumber": 1208,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Bisyir] telah menceritakan kepada saya [Gholib Al Qaththan] dari [Bakar bin 'Abdullah] dari [Anas bin Malik radliallahu 'anhu] berkata: \"Kami pernah shalat bersama Nabi shallallahu 'alaihi wasallam saat udara sangat panas. Bila ada diantara kami yang tidak kuat meletakkan wajahnya di permukaan tanah, maka dia menghamparkan bajunya lalu sujud diatasnya",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1209,
			"arabicnumber": 1209,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] telah menceritakan kepada kami [Malik] dari [Abu An-Nadhir] dari [Abu Salamah] dari ['Aisyah radliallahu 'anha] berkata: \"Aku menjulurkan kakiku pada arah qiblat Nabi shallallahu 'alaihi wasallam ketika Beliau sedang shalat. Bila Beliau sujud maka aku tarik kakiku dan aku angkat. Dan bila Beliau berdiri, kembali kakiku aku julurkan lagi",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1210,
			"arabicnumber": 1210,
			"text": "Telah menceritakan kepada kami [Mahmud] telah mengabarkan kepada kami [Syababah] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Ziyad] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bahwasanya Beliau ketika selesai dari mengerjakan shalat berkata: \"Sesungguhnya setan menghampiriku lalu menggangguku untuk memutus shalatku tapi Allah memenangkan aku atasnya dan aku berkehendak untuk mengikatnya di salah satu tiang masjid sampai pagi hari sehingga kalian semuanya dapat melihatnya. Namun aku teringat ucapan Sulaiman Alaihissalam yang berdo'a: Ya Rabb, anugerahkanlah kepadaku kerajaan yang tidak akan dimiliki oleh seorangpun setelah aku\" telah memberitakan kepada kami (QS. Shad 35). Maka kemudian Allah mengusirnya\". Kemudian An Nadhir bin Syumail berkata: fadza'attuhu dengan huruf dzal, artinya; mencekiknya seperti firman Allah Ta'ala QS Ath-Thur 13 yang artinya digiring. Yang benar adalah fada'attuhu. Dengan ada tanda taydid pada huruf 'ain dan ta",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1211,
			"arabicnumber": 1211,
			"text": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Al Azraq bin Qais] berkata; \"Kami pernah berada di daerah Al Ahwaz ketika kami memerangi kelompok Haruriyyah. Ketika aku berada di tepian sungai ada seseorang yang sedang mengerjakan shalat sementara dia tetap memegang tali kekang tunggangannya. Maka hewan tunggangannya mengganggunya dengan bergerak kesana kemari hingga ia mengikuti kemana gerak hewannya itu\". Berkata, Syu'bah dia adalah [Abu Barzah Al Aslamiy]; Tiba-tiba seorang dari Khawarij berkata: \"Masya Allah, apa yang dilakukan orang ini?\" Ketika orang tadi selesai dari shalatnya, dia berkata; \"Sungguh aku mendengar percakapan kalian. Sungguh aku sudah pernah ikut berperang bersama Rasulullah shallallahu 'alaihi wasallam enam, tujuh atau hingga delapan kali peperangan dan aku menyaksikan kemudahan-kemudahan yang Beliau ajarkan. Bagiku mengikuti hewan tungganganku itu lebih aku sukai daripada aku memaksa kembali ke padang gembalaan tempat hewan itu biasa berkeliaraan, yang nanti pasti lebih menyulitkan aku",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1212,
			"arabicnumber": 1212,
			"text": "Telah menceritakan kepada kami [Muhammad bin Muqatil] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Yunus] dari [Az Zuhriy] dari ['Urwah] berkata; Berkata, ['Aisyah radliallahu 'anha]: \"Ketika terjadi gerhana matahari Nabi shallallahu 'alaihi wasallam berdiri melaksanakan shalat, Beliau membaca bacaan yang panjang lalu Beliau ruku' dengan ruku' yang panjang lalu mengangkat kepala lalu memulai membaca surat yang lain, lalu ruku' kembali sampai menyempurnakannya dan kemudian sujud. Kemudian Beliau melakukan seperti itu lagi pada raka'at kedua kemudian setelah selesai Beliau bersabda: \"Keduanya adalah dua tanda dari tanda-tanda kebesaran Allah. Jika kalian melihat (gerhana) nya, maka dirikanlah shalat hingga menghilang gerhana itu dari kalian. Sungguh aku telah melihat segala sesuatu yang telah dijanjikan bagiku dengannya dari tempatku berdiri ini, sehingga aku ingin mengambil setandan anggur di dalam surga, itu terlihat saat kalian melihatku aku ingin bergerak ke depan. Dan sungguh aku melihat jahanam yang apinya saling membakar satu sama lain saat kalian melihatku aku bergerak mundur dan aku melihat didalamnya ada 'Amru bin Luhai dan dialah yang pertama-tama merumuskan saibah",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1213,
			"arabicnumber": 1213,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Nafi'] dari [Ibnu'Umar radliallahu 'anhuma] bahwasanya Nabi shallallahu 'alaihi wasallam melihat ludah pada arah qiblat masjid. Spontan Beliau menampakkan kemarahannya kepada jama'ah masjid seraya bersabda: \"Sesungguhnya Allah berada dihadapan setiap orang dari kalian (saat shalat). Maka bila sedang shalat janganlah seseorang meludah\" atau sabdanya: \"janganlah dia membuang dahak\". Kemudian Beliau turun lalu menggosok ludah tersebut dengan tangannya. Dan berkata, Ibnu'Umar radliallahu 'anhuma: \"Jika seorang dari kalian meludah, maka meludahlah kearah kirinya",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1214,
			"arabicnumber": 1214,
			"text": "Telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] berkata; Aku mendengar [Qatadah] dari [Anas bin Malik radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Jika seseorang sedang berdiri shalat, sesungguhnya dia sedang berhadapan dengan Rabnya, maka janganlah dia meludah ke arah depannya dan jangan pula ke arah kanannya tetapi lakukanlah ke arah kirinya dibawah kaki (kirinya)",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1215,
			"arabicnumber": 1215,
			"text": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Abu Hazim] dari [Sahal bin Sa'ad radliallahu 'anhu] berkata: \"Orang-orang shalat bersama Nabi shallallahu 'alaihi wasallam dengan mengikatkan kain mereka di leher-leher karena kainnya kecil. Dan dikatakan kepada Kaum Wanita: \"Janganlah kalian mengangkat kepala kalian hingga para laki-laki telah duduk",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1216,
			"arabicnumber": 1216,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Abu Syaibah] telah menceritakan kepada kami [Ibnu Fudhail] dari [Al A'masy] dari [Ibrahim] dari ['Alqamah] dari ['Abdullah radliallahu 'anhu] berkata: \"Aku pernah memberi salam kepada Nabi shallallahu 'alaihi wasallam ketika Beliau sedang shalat maka Beliau membalas salamku. Ketika kami kembali (dari negeri An-Najasyi), aku memberi salam kembali kepada Beliau namun Beliau tidak membalas salamku. Kemudian Beliau berkata: \"Sesungguhnya dalam shalat terdapat kesibukan",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1217,
			"arabicnumber": 1217,
			"text": "Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami ['Abdul Warits] telah menceritakan kepada kami [Katsir bin Syinzhir] dari ['Atha' bin Abu Rabah] dari [Jabir bin 'Abdullah radliallahu 'anhua] berkata; Rasulullah shallallahu 'alaihi wasallam mengutusku untuk menyelesaikan keperluan Beliau. Maka aku berangkat kemudian kembali setelah menuntaskan tugasku itu, lalu aku menemui Nabi shallallahu 'alaihi wasallam. Aku memberi salam kepada Beliau namun Beliau tidak membalas salamku. Kejadian itu menimbulkan kegusaran dalam hatiku yang hanya Allah sajalah yang lebih mengetahuinya. Kemudian aku berkata dalam hatiku, barangkali Rasulullah shallallahu 'alaihi wasallam menganggap aku terlambat menunaikan tugas dari Beliau. Kemudian aku memberi salam kembali dan lagi-lagi Beliau tidak membalasnya. Timbul lagi kegusaran dalam hatiku yang lebih besar dari yang pertama. Kemudian aku memberi salam lagi, lalu Beliau membalasnya seraya berkata: \"Sesungguhnya yang menghalangiku buat menjawab salammu adalah karena aku sedang melaksanakan shalat\". Saat itu Beliau sedang berada diatas hewan tunggangannya yang tidak menghadap ke arah qiblat",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1218,
			"arabicnumber": 1218,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami ['Abdul 'Aziz] dari [Abu Hazim] dari [Sahal bin Sa'ad radliallahu 'anhu] berkata; Telah sampai kabar kepada Rasulullah shallallahu 'alaihi wasallam bahwa pada suku Bani 'Amru bin 'Auf bin Al Harits di Quba' timbul masalah diantara mereka. Maka Beliau bersama para sahabat Beliau berangkat kesana untuk menyelesaikan masalah. Ternyata Rasulullah shallallahu 'alaihi wasallam tertahan lama disana sedangkan waktu shalat sudah masuk. Maka Bilal menemui Abu Bakar radliallahu 'anhuma seraya berkata: \"Wahai Abu Bakar, Rasulullah shallallahu 'alaihi wasallam terlambat hadir sedangkan waktu shalat sudah masuk, apakah engkau bersedia memimpin shalat berjama'ah? Dia (Abu Bakar) menjawab: \"Ya bersedia, jika kamu menghendaki\". Maka Bilal membacakan iqamat shalat dan Abu Bakar maju dan memulai takbir memimpin shalat bersama orang banyak. Tak lama kemudian datang Nabi shallallahu 'alaihi wasallam berjalan di tengah-tengan shaf membelah barisan hingga sampai di shaf. Maka orang-orang memberi isyarat dengan bertepuk tangan. Sahal berkata: \"At-Tashfiih sama maksudnya dengan At-Tashfiiq. Dia berkata: \"Saat itu Abu Bakar tidak bereaksi dalam shalatnya. Ketika suara tepukan semakin nyaring terdengar, Abu Bakar baru berbalik dan ternyata ada Rasulullah shallallahu 'alaihi wasallam. Maka Nabi memberi isyarat kepadanya agar tetap meneruskan shalatnya. Lalu Abu Bakar mengangkat kedua tangannya lalu memuji Allah kemudian dia mundur ke belakang dan berdiri di barisan, lalu Rasulullah shallallahu 'alaihi wasallam maju untuk memimpin shalat berjama'ah. Setelah selesai Nabi berbalik menghadap jama'ah lalu bersabda: \"Wahai sekalian manusia, mengapa kalian ketika mendapatkan sesuatu dalam shalat, kalian melakukannya dengan bertepuk tangan? Sesungguhnya bertepuk tangan itu adalah isyarat yang dilakukan bagi kaum wanita. Maka siapa yang mendapatkan sesuatu yang keliru dalam shalat hendaklah mengucapkan Subhaanallah\". Kemudian Beliau memandang ke arah Abu Bakar radliallahu 'anhu seraya berkata: \"Wahai Abu Bakar, apa yang menghalangimu untuk melanjutkan memimpin shalat berjama'ah bersama orang banyak ketika aku sudah memberi isyarat kepadamu (agar meneruskannya)?\" Abu Bakar menjawab: \"Tidak patut bagi Ibnu Abu Quhafah memimpin shalat di hadapan Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1219,
			"arabicnumber": 1219,
			"text": "Telah menceritakan kepada kami [Abu An-Nu'man] telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Muhammad] dari [Abu Hurairah radliallahu 'anhu] berkata: \"Dilarang bertolak pinggang dalam shalat\". Dan berkata, [Hisyam] dan [Abu Hilal] dari [Ibnu Sirin] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1220,
			"arabicnumber": 1220,
			"text": "Telah menceritakan kepada kami ['Amru bin 'Ali] telah menceritakan kepada kami [Yahya] dari [Hisyam] telah menceritakan kepada kami [Muhammad] dari [Abu Hurairah radliallahu 'anhu] berkata: \"Nabi shallallahu 'alaihi wasallam melarang seseorang shalat dengan bertolak pinggang",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1221,
			"arabicnumber": 1221,
			"text": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami ['Umar] -dia adalah anak dari Sa'id- berkata, telah mengabarkan kepada saya [Ibnu Abu Mulaikah] dari ['Uqbah bin Al Harits radliallahu 'anhu] berkata: \"Aku pernah shalat 'Ashar bersama Nabi shallallahu 'alaihi wasallam. Setelah memberi salam, tiba-tiba Beliau berdiri dengan tergesa-gesa dan menemui sebagian isteri-isteri Beliau. Kemudian setelah itu Beliau keluar kembali dan Beliau melihat bahwa orang-orang semua keheranan dengan ketergesaan Beliau. Maka akhirnya Beliau bersabda: \"Aku teringat ketika aku shalat tadi tentang sebatang emas yang ada pada kami. Aku tidak suka bila benda itu berada pada kami sampai sore atau bermalam, maka aku perintahkan untuk dibagi-bagikan",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1222,
			"arabicnumber": 1222,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Ja'far] dari [Al A'raj] berkata; Berkata, [Abu Hurairah radliallahu 'anhu]; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika panggilan shalat (adzan) dikumandangkan maka setan lari sambil mengeluarkan kentut hingga ia tidak mendengar suara adzan tersebut. Apabila panggilan adzan telah selesai maka setan kembali. Dan bila iqamat dikumandangkan setan kembali berlari dan jika iqamat telah selesai dia kembali lagi hingga senantiasa dia mengganggu seseorang seraya berkata; ingatlah sesuatu, yang semestinya harus tidak diingat, yang pada akhirnya orang itu tidak menyadari berapa raka'at yang sudah dia laksanakan dalam shalatnya\". Berkata, Abu Salamah bin 'Abdurrahman; \"Bila seseorang melakukan hal seperti itu, maka hendaklah dia sujud dua kali dalam posisi duduk\". Dan [Abu Salamah] mendengar keterangan ini dari [Abu Hurairah radliallahu 'anhu]",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1223,
			"arabicnumber": 1223,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami ['Utsman bin 'Umar] berkata, telah mengabarkan kepada saya [Ibnu Abu Dza'bi] dari [Sa'id Al Maqburiy] berkata; [Abu Hurairah radliallahu 'anhu] berkata: \"Orang-orang mengatakan bahwa Abu Hurairah banyak menyampaikan hadits (dari Rasulullah shallallahu 'alaihi wasallam). Maka aku temui seseorang lalu aku bertanya kepadanya; Surat apa yang dibaca oleh Rasulullah shallallahu 'alaihi wasallam dalam shalat 'Isya' tadi\". Orang itu menjawab: \"Aku tak tahu\". Aku tanyakan lagi: \"Bukankah anda ikut shalat? Orang itu menjawab: \"Ya benar\". Maka aku katakan: \"Aku tahu Beliau membaca surah ini dan ini",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 27
			}
		}
	]
}