{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"28": "Penalty of Hunting while on Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1821,
			"arabicnumber": 1821,
			"text": "Telah menceritakan kepada kami [Mu'adz bin Fadhalah] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari ['Abdullah bin Abu Qatadah] berkata; [Bapakku] berangkat pada tahun Perjanjian Hudaibiyah lalu para sahabat (Nabi shallallahu 'alaihi wasallam) berihram sedangkan dia tidak. Lalu Nabi shallallahu 'alaihi wasallam mendapatkan berita bahwa para musuh akan menyerang Beliau, maka Nabi shallallahu 'alaihi wasallam berangkat. Dan ketika aku bersama para sahabat Beliau yang sedang tertawa saling bercengkerama satu sama lain, aku melihat ada seekor keledai liar. Keledai itu aku ikuti kemudian aku tikam dan aku ikat sehingga tidak bergerak lagi. Aku meminta bantuan mereka namun mereka enggan untuk membantuku. Lalu kami memakan dagingnya namun kami khawatir ada musuh. Maka aku mencari Nabi shallallahu 'alaihi wasallam dengan terkadang memacu lari kudaku dan terkadang aku memperlambatnya. Kemudian aku berjumpa dengan seseorang dari Bani Ghifar pada tengah malam lalu aku bertanya kepadanya: \"Dimana kamu meninggalkan Nabi shallallahu 'alaihi wasallam?\". Dia berkata: \"Aku meninggalkan Beliau di daerah Ta'hin yang Beliau beristirahat siangnya di Suqya\". (Setelah bertemu), aku berkata: \"Wahai Rasulullah, keluarga (para sahabat) baginda menyampaikan salam dan rahmat Allah buat baginda. Mereka sedang khawatir menghadapi musuh tanpa mendampingi baginda, maka tunggulah mereka\". Aku katakan pula kepada Beliau: \"Wahai Rasulullah, aku telah berburu keledai liar dan aku masih menyisakan dagingnya\". Maka Beliau berkata, untuk mereka: \"Makanlah\". Padahal saat itu mereka sedang berihram",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": 1822,
			"text": "Telah menceritakan kepada kami [Sa'id bin Ar-Rabi'] telah menceritakan kepada kami ['Ali bin Al Mubarak] dari [Yahya] dari ['Abdullah bin Abu Qatadah] bahwa [bapaknya] menceritakan kepadanya, katanya: Kami berangkat bersama Nabi shallallahu 'alaihi wasallam pada tahun Perjanjian Hudaibiyah lalu para sahabat berihram sedangkan aku tidak. Lalu kami mendapatkan berita bahwa para musuh sudah berada di Ghoiqah. Kami berangkat menghadapi mereka. Dalam perjalanan para sahabatku melihat ada seekor keledai liar yang menjadikan mereka tertawa satu sama lain. Maka aku intai lalu aku ikuti dengan kudaku lalu aku tikam dan ikat sehingga tidak bergerak lagi. Aku meminta bantuan kepada mereka namun mereka enggan untuk membantuku. Lalu kami memakan dagingnya. Kemudian aku berusaha menyusul Rasulullah shallallahu 'alaihi wasallam karena kami khawatir ada musuh. Maka aku terkadang memacu lari kudaku dan terkadang aku memperlambatnya. Kemudian aku berjumpa dengan seseorang dari Bani Ghifar pada tengah malam lalu aku bertanya kepadanya: \"Dimana kamu meninggalkan Nabi Rasulullah shallallahu 'alaihi wasallam?\". Dia berkata: \"Tadi aku meninggalkan Beliau di daerah Ta'han yang Beliau beristirahat siangnya di Suqya\". Akhirnya aku berjumpa dengan Rasulullah shallallahu 'alaihi wasallam hingga aku hampiri, lalu aku berkata: \"Wahai Rasulullah, para sahabat baginda menyampaikan salam dan rahmat serta barakah Allah buat baginda. Mereka sedang khawatir menghadapi musuh tanpa mendampingi baginda, maka tunggulah mereka\". Maka Beliau menunggu mereka. Aku katakan pula kepada Beliau: \"Wahai Rasulullah, kami telah berburu keledai liar dan kami masih menyisakan dagingnya\". Maka Rasulullah shallallahu 'alaihi wasallam berkata, kepada para sahabat Beliau: \"Makanlah\". Sedang saat itu mereka sedang berihram",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": 1823,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Shalih bin Kaisan] dari [Abu Nuhammad Nafi'] maulanya Abu Qatadah dia mendengar [Abu Qatadah radliallahu 'anhu] berkata: \"Kami berangkat bersama Nabi shallallahu 'alaihi wasallam dan tiba di Qahah yang jaraknya tiga hari perjalanan dari Madinah\". Dan diriwayatkan pula, telah menceritakan kepada kami ['Ali bin 'Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Shalih bin Kaisan] dari [Abu Muhammad] dari [Abu Qatadah radliallahu 'anhu] berkata: \": \"Kami berangkat bersama Nabi shallallahu 'alaihi wasallam dan tiba di Qahah. Diantara kami ada yang berihram dan ada pula yang tidak. Aku melihat para sahabatku sedang memperhatikan sesuatu. Maka aku ikut memperhatikannya yang ternyata seekor keledai liar yang sudah terkena cambuk. Mereka berkata: \"Kami tidak akan membantumu untuk mendapatkannya karena kami sedang berihram. Maka aku berusaha menangkapnya lalu berhasil, kemudian aku bawa keledai tersebut dari balik bukit kecil lalu aku menyembelihnya. Kemudian aku datang menemui para sahabat membawa dagingnya. Diantara mereka ada yang berkata: \"Makanlah\". Dan sebagian yang lain mengatakan: \"Jangan kalian makan\". Maka aku menemui Nabi shallallahu 'alaihi wasallam sedang saat itu Beliau berada di depan kami, lalu aku bertanya tentang masalah itu, maka Beliau berkata: \"Makanlah daging itu karena dia halal\". Maka kemudian 'Amru berkata, kepada kami: \"Pergilah dan temui Shalih lalu tanyakan kepadanya tentang masalah ini dan masalah lainnya. Maka Shalih menemui kami lalu berkata, \" Bawalah kemari",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": 1824,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Abu 'Awanah] telah menceritakan kepada kami ['Utsman, dia adalah putra Mawhab] berkata, telah mengabarkan kepada saya ['Abdullah bin Abu Qatadah] bahwa [Abu Qatadah] mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersama mereka (para sahabat) berangkat untuk menunaikan haji. Lalu sebagian rambongan ada yang berpisah, diantaranya adalah Abu Qatadah radliallahu 'anhu. Beliau berkata, kepada rombongan ini: \"Ambillah jalan menyusuri tepi pantai hingga kita bertemu\". Maka mereka mengambil jalan di tepian pantai. Ketika mereka hendak berangkat, semua anggota rambongan itu berihram kecuali Abu Qatadah. Ketika mereka sedang berjalan, mereka melihat ada seeokor keledai liar. Maka Abu Qatadah menghampiri keledai itu lalu menyembelihnya yang sebagian dagingnya dibawa ke hadapan kami. Maka mereka berhenti lalu memakan daging keledai tersebut. Sebagian dari mereka ada yang berkata: \"Apakah kita boleh memakan daging hewan buruan padahal kita sedang berihram?\". Maka kami bawa sisa daging tersebut. Ketika mereka berjumpa dengan Rasulullah shallallahu 'alaihi wasallam, mereka berkata: \"Wahai Rasulullah, kami sedang berihram sedangkan Abu Qatadah tidak. Lalu kami melihat ada keledai-keledai liar kemudian Abu Qatadah menangkapnya lalu menyembelihnya kemudian sebagian dagingnya dibawa kepada kami, lalu kami berhenti dan memakan dari daging tersebut kemudian diantara kami ada yang berkata: \"Apakah kita boleh memakan daging hewan buruan padahal kita sedang berihram?\". Lalu kami bawa sisa dagingnya itu kemari\". Beliau bertanya: \"Apakah ada seseorang diantara kalian yang sedang berihram menyuruh Abu Qatadah untuk memburunya atau memberi isyarat kepadanya?\". Mereka menjawab: \"Tidak ada\". Maka Beliau bersabda: \"Makanlah sisa daging yang ada itu",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": 1825,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Ibnu Syihab] dari ['Ubaidullah bin 'Abdullah bin 'Uqbah bin Mas'ud] dari ['Abdullah bin 'Abbas] dari [Ash-Sha'bi bin Jatstsamah Al Laitsiy] bahwa dia (Ash-Sha'bi) memberi hadiah kepada Rasulullah shallallahu 'alaihi wasallam berupa seekor keledai yang liar saat beliau berada di Abwa' atau di Waddan. Lalu Beliau mengembalikan hadiah itu kepadanya. Ketika Beliau melihat apa yang ada di wajahnya, Beliau berkata: \"Kami tidak bermaksud menolak hadiah darimu, namun ini tidak lain karena aku sedang berihram",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": 1826,
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": 1827,
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": 1828,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada lima jenis hewan yang tidak berdosa bagi orang yang sedang berihram untuk membunuhnya\". Dan dari ['Abdullah bin Dinar] dari ['Abdullah bin 'Umar radliallahu 'anhuma] bahwa Rasulullah shallallahu 'alaihi wasallam telah bersabda, telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu 'Awanah] dari [Zaid bin Jubair] berkata,, aku mendengar [Ibnu'Umar radliallahu 'anhuma] berkata; telah menceritakan kepada saya salah seorang isteri Nabi shallallahu 'alaihi wasallam dari Nabi shallallahu 'alaihi wasallam: \"Orang yang sedang ihram membunuh…\". Telah menceritakan kepada kami [Ashbagh bin Al Faraj] berkata, telah mengabarkan kepadaku ['Abdullah bin Wahb] dari [Yunus] dari [Ibnu Syihab] dari [Salim] berkata; ['Abdullah bin 'Umar radliallahu 'anhuma] berkata,, telah berkata, [Hafshah]; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada lima jenis hewan yang seseorang tidak berdosa jika membunuhnya, yaitu: burung gagak, burung rajawali, tikus, kalajengking dan anjing galak",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": 1829,
			"text": "Telah menceritakan kepada kami [Yahya bin Sulaiman] berkata, telah menceritakan kepada saya [Ibnu Wahb] berkata, telah menceritakan kepada saya [Yunus] dari [Ibnu Syihab] dari ['Urwah] dari ['Aisyah radliallahu 'anha] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada lima jenis hewan yang kesemuanya berbahaya sehingga boleh dibunuh saat ihram, yaitu: burung gagak, burung rajawali, tikus, kalajengking dan anjing galak",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": 1830,
			"text": "Telah menceritakan kepada kami ['Umar bin Hafsh bin Ghiyats] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Al A'masy] berkata, telah menceritakan kepada saya [Ibrahim] dari [Al Aswad] dari ['Abdullah radliallahu 'anhu] berkata: \"Ketika kami sedang bersama Nabi shallallahu 'alaihi wasallam di dalam goa di Mina, wahyu turun kepada Beliau yaitu surat Wal mursalaat. Saat itu Beliau membacakannya, dan aku mengambil hafalan bacaan surah tersebut langsung dari gerak bibir (mulut) Beliau. Ketika mulut Beliau masih basah membacakan surah tersebut tiba-tiba ada seekor ular melompat kepada kami, maka Nabi shallallahu 'alaihi wasallam berkata: \"Bunuhlah ular itu\". Maka kami mengejar ular itu namun ular itu sudah pergi. Maka Nabi shallallahu 'alaihi wasallam berkata: \"Ular itu telah lolos dari kejahatan kalian sebagaimana kalian sudah lolos dari kejahatannya",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": 1831,
			"text": "Telah menceritakan kepada kami [Isma'il] berkata, telah menceritakan kepadaku [Malik] dari [Ibnu Syihab] dari ['Urwah bin Az Zubair] dari ['Aisyah radliallahu 'anha] isteri Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Cecak itu kecil bahayanya\". Dan aku tidak mendengar Beliau memerintahkan untuk membunuhnya\". Berkata, Abu 'Abdullah Al Bukhariy: \"Yang kami inginkan dengan keterangan ini adalah bahwa Mina termasuk tanah haram (suci) dan mereka (para shahabat) tidak memandang membunuh ular itu berdosa",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": 1832,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada saya [Al Laits] dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Syuraih Al 'Adawiy] bahwa dia berkata, kepada 'Amru bin Sa'id saat dia mengutus rambongan ke Makkah: \"izinkan aku wahai Pemimpin (amir) untuk menyampaikan satu sabda Nabi shallallahu 'alaihi wasallam saat Beliau memberikan khuthbah sehari setelah hari Pembebasan Makkah, aku mendengar dengan telingaku sendiri dan merasakan dengan hatiku sendiri serta melihat dengan mata kepalaku sendiri ketika Beliau shallallahu 'alaihi wasallam mengucapkannya, Beliau memuji Allah dan mensucikannya kemudian bersabda: 'Sesungguhnya Makkah, Allah telah mensucikannya namun orang-orang (Musyrikin Makkah) tidak mensucikannya. Maka tidak halal bagi setiap orang yang beriman kepada Allah dan Hari Akhir menumpahkan darah didalamnya, dan tidak boleh mencabut pepohonan di dalamnya. Kalau sesorang diberikan kebolehan memerangi Rasulullah shallallahu 'alaihi wasallam di dalamnya katakanlah bahwa Allah Ta'ala telah mengizinkan kepada RasulNya dan tidak mengizinkan kepada kalian. Sesungguhnya Dia (Allah Ta'ala) telah mengizinkanku pada suatu masa di siang hari kemudian dikembalikan kesuciannya hari ini sebagaimana disucikannya sebelumnya. Maka hendaklah yang hadir menyampaikan kepada yang tidak hadir\". Ditanyakan kepada Abu Syuraij: \"Apa yang dikatakan 'Amru?\". Katanya: \"Aku lebih mengetahui tentang peristiwa itu daripadamu wahai Abu Syuraij: \"Sesungguhnya di tanah haram ini, Beliau tidak akan melindungi orang yang bermaksiat, orang yang (dihukum karena) menumpahkan darah dan orang yang mencuri",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": 1833,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami ['Abdul Wahhab] telah menceritakan kepada kami [Khalid] dari ['Ikrimah] dari [Ibnu 'Abbas radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Allah telah mengikrarkan kesucian kota Makkah, maka tidak dihalalkan buat seorang pun sebelum dan tidak dihalalkan pula buat seorangpun susudahku. Sesungguhnya pernah dihalalkan buatku sesaat dalam suatu hari. (Karenanya di Makkah) tidak boleh dipotong rumputnya dan tidak boleh ditebang pohonnya dan tidak boleh diburu hewan buruannya dan tidak ditemukan satupun barang temuan kecuali harus dikembalikan kepada yng mengenalnya (pemiliknya) \". Berkata, Al 'Abbas radliallahu 'anhu: \"Wahai Rasulullah, kecuali pohon idzkhir (pohon yang harum baunya) yang berguna untuk pengerjaan penambangan emas kami dan qubur-qubur kami. Maka Beliau bersabda: \"Ya kecuali pohon idzkhir\". Dan dari Khalid dari 'Ikrimah: \"Apakah kamu mengerti yang dimaksud dengan dilarang memburu binatang buruan? adalah menyingkirkannya dari tempat berlindung yang dijadikannya tempat bersinggah",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": 1834,
			"text": "Telah menceritakan kepada kami ['Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Mujahid] dari [Thawus] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata; Nabi shallallahu 'alaihi wasallam bersabda pada hari pebebasan kota Makkah: \"Tidak ada lagi hijrah tetapi yang ada adalah jihad dan niat dan jika kalian diperintahkan berangkat perang maka berangkatlah. Sesungguhnya negeri ini telah Allah Ikrarkan kesucikannya sejak hari penciptaan langit dan bumi. Maka dia akan terus suci dengan pensucian dari Allah itu hingga hari qiyamat sehingga tidak dibolehkan perang didalamnya buat seorangpun sebelum aku dan tidak dihalalkan pula buatku kecuali sesaat dalam suatu hari. Maka dia suci dengan pensucian dari Allah itu hingga hari qiyamat, dan tidak boleh ditebang pepohonannya dan tidak boleh diburu hewan buruannya dan tidak ditemukan satupun barang temuan kecuali harus dikembalikan kepada yang mengenalnya (pemiliknya) dan tidak boleh dipotong rumputnya\". Berkata, Al 'Abbas radliallahu 'anhu: \"Wahai Rasulullah, kecuali pohon idzkhir yang berguna untuk wewangian tukang besi mereka dan rumah-rumah mereka\". Dia berkata,, maka Beliau bersabda: \"Ya, kecuali pohon idzkhir",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": 1835,
			"text": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] telah menceritakan kepada kami [Sufyan] berkata; ['Amru] berkata, kepada kami: \"Hal yang pertama kali aku dengar dari ['Atho'] adalah saat dia berkata: Aku mendengar [Ibnu 'Abbas radliallahu 'anhuma] berkata: \"Rasulullah shallallahu 'alaihi wasallam berbekam saat sedang ihram\". Kemudian aku mendengar dia berkata, telah menceritakan kepada saya [Thowus] dari [Ibnu 'Abbas radliallahu 'anhuma]. Maka aku katakan: \"Barangkali dia mendengarnya dari keduanya",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": 1836,
			"text": "Telah menceritakan kepada kami [Khalid bin Mukhallad] telah menceritakan kepada kami [Sulaiman biun Bilal] dari ['Alqamah] dari ['Abdurrahman Al A'raj] dari [Ibnu Buhainah] radliallahu 'anhu berkata: \"Nabi shallallahu 'alaihi wasallam berbekam saat sedang ihram ketika berada di Lahyi Jamal pada begian tengah kepala Beliau",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": 1837,
			"text": "Telah menceritakan kepada kami [Abu Al Mughirah 'Abdul Quddus bin Al Hajjaj] telah menceritakan kepada kami [Al Awza'iy] telah menceritakan kepada saya ['Atho' bin Abu Rabah] dari [Ibnu 'Abbas radliallahu 'anhuma] bahwa Nabi shallallahu 'alaihi wasallam menikahi Maimunah saat Beliau sedang ihram",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": 1838,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yazid] telah mengabarkan kepada kami [Al Laits] telah menceritakan kepada kami [Nafi'] dari ['Abdullah bin 'Umar radliallahu 'anhu] berkata: Seorang laki-laki datang lalu berkata: \"Wahai Rasulullah, pakaian apa yang baginda perintahkan untuk kami ketika ihram)?. Nabi shallallahu 'alaihi wasallam menjawab: \"Janganlah kalian mengenakan baju, celana, sorban, mantel (pakaian yang menutupi kepala) kecuali seseorang yang tidak memiliki sandal, hendaklah dia mengenakan sapatu tapi dipotongnya hingga berada dibawah mata kaki dan jangan pula kalian memakai pakaian yang diberi minyak wangi atau wewangian dari daun tumbuhan. Dan wanita yang sedang ihram tidak boleh memakai cadar (penutup wajah) dan sarung tangan\". Hadits ini dikuatkan pula oleh [Musa bin 'Uqbah] dan [Isma'il bin Ibrahim bin 'Uqbah] dan [Juwairiyah] dan [Ibnu Ishaq] tentang cadar (tutup muka) dan sarung tangan. Dan berkata, ['Ubaidullah]; dan tidak pula wewangian dari daun tumbuhan yang wangi. Dan Beliau bersabda: \"Dan wanita yang sedang ihram janganlah memakai cadar dan juga jangan memakai sarung tangan\". Dan berkata, [Malik] dari [Nafi'] dari [Ibnu'Umar radliallahu 'anhuma]: \"Dan wanita yang sedang ihram janganlah memakai\". Dan hadits ini dikuatkan pula oleh [Laits bin Abu Salim]",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1839,
			"arabicnumber": 1839,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Al Hakam] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata; Ada seorang laki-laki yang sedang berihram dijatuhkan oleh untanya hingga meninggal dunia. Lalu jenazahnya dibawa kepada Rasulullah shallallahu 'alaihi wasallam, maka Beliau bersabda: \"Mandikanlah dia dan kafanilah dan janganlah ditutupkepalanya dan jangan diberi wewangian karena dia nanti akan dibangkitkan (pada hari qiyamat) dalam keadaan berihram",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1840,
			"arabicnumber": 1840,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Zaid bin Aslam] dari [Ibrahim bin 'Abdullah bin Hunain] dari [bapaknya] bahwa 'Abdullah bin 'Abbas radliallahu 'anhu dan Al Miswar bin Makhramah berselisih pendapat ketika keduanya berada di Abwa'. 'Abdullah bin 'Abbas radliallahu 'anhu berkata; Orang yang sedang ihram membasuh kepalanya. Sedangkan Al Miswar berkata; Orang yang sedang ihram tidak boleh membasuh kepalanya. Maka 'Abdullah bin 'Abbas radliallahu 'anhu mengutusku untuk menemui [Abu Ayyub Al Anshariy]. Aku jumpai dia sedang mandi dibawah dua pohon dan dia berlindung dari balik kain. Maka aku memberi salam kepadanya. Dia bertanya: \"Siapa ini?\". Aku jawab: \"Aku 'Abdullah bin Hunain, 'Abdullah bin 'Abbas radliallahu 'anhu mengutusku kepadamu untuk menanyakan bagaimana dahulu Rasulullah shallallahu 'alaihi wasallam membasuh kepala Beliau ketika Beliau sedang ihram?\". Maka Abu Ayyub menyingkap kain penutup dengan tangannya sehingga kepalanya nampak olehku lalu dia berkata, kepada seseorang yang mengucurkan air kepadanya; \"Kucurkanlah air itu\". Maka orang itu mengucurkan air ke kepalanya lalu dia menggerak-gerakkan kepalanya dengan kedua tangannya lalu menarik tangannya kedepan ke belakang, lalu berkata: \"Begitulah aku pernah melihat Nabi shallallahu 'alaihi wasallam melakukannya",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1841,
			"arabicnumber": 1841,
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1842,
			"arabicnumber": 1842,
			"text": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Ibrahim bin Sa'ad] telah menceritakan kepada kami [Ibnu Syihab] dari [Salim] dari ['Abdullah radliallahu 'anhu]; Rasulullah shallallahu 'alaihi wasallam ditanya tentang pakaian yang dibolehkan dipakai oleh seorang yang sedang berihram. Maka Beliau bersabda: \"Janganlah dia mengenakan gamis (baju), sorban, celana, mantel (pakaian yang menutupi kepala) dan jangan pula dia memakai pakaian yang diberi minyak wangi atau wewangian yang terbuat dari daun tumbuhan dan apabila dia tidak memiliki sepasang sandal, hendaklah dia mengenakan sapatu tapi dipotongnya hingga berada dibawah mata kaki",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1843,
			"arabicnumber": 1843,
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1844,
			"arabicnumber": 1844,
			"text": "Telah menceritakan kepada kami ['Ubaidullah] dari [Isra'il] dari [Abu Ishaq] dari [Al Bara' radliallahu 'anhu]: \"Rasulullah shallallahu 'alaihi wasallam melaksanakan 'umrah pada bulan Dzul Qa'dah namun penduduk Makkah enggan membolehkan Beliau memasuki kota Makkah hingga akhirnya Beliau sepakat untuk tidak memasuki Makkah dengan membawa senjata terhunus kecuali dalam sarungnya",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1845,
			"arabicnumber": 1845,
			"text": "Telah menceritakan kepada kami [Muslim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ibnu Thowus] dari [bapaknya] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata: \"Nabi shallallahu 'alaihi wasallam telah menetapkan miqat bagi penduduk Madinah di Dzul Hulaifah, bagi penduduk Najed di Qarnul Manazil dan bagi penduduk Yaman di Yalamlam. Dan begitu pulalah ketentuan bagi setiap orang yang datang melewati tempat-tempat tersebut selain penduduk negeri-negeri tersebut yang berniat untuk haji dan 'umrah. Bagi orang-orang selain itu (yang tinggal lebih dekat ke Makkah dari pada tempat-tempat itu), maka dia memulai dari tempat yang dijadikannya tinggal sehingga bagi penduduk Makkah mereka memulainya dari (rumah mereka) di Makkah",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1846,
			"arabicnumber": 1846,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Ibnu Syihab] dari [Anas bin Malik radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam memasuki Makkah pada tahun Penaklukan Makkah dengan mengenakan pelindung kepala terbuat dari besi diatas kepala Beliau. Ketika Beliau melepaskannya, datang seseorang lalu berkata; \"Sesungguhnya Ibnu Khathol sedang berlindung di balik kain penutup Ka'bah. Maka Beliau berkata: \"Bunuhlah dia",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1847,
			"arabicnumber": 1847,
			"text": "Telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami ['Atho'] berkata, telah menceritakan kepada saya [Shafwan bin Ya'la bin Umayyah] dari [bapaknya] berkata; Ketika aku sedang bersama Rasulullah shallallahu 'alaihi wasallam tiba-tiba datang seseorang yang mengenakan jubah yang tampak pada jubahnya pewarna kuning atau sejenisnya. Saat itu 'Umar berkata, kepadaku: \"Kamu suka bila Beliau sedang menerima wahyu kamu dapat melihatnya?\". Maka wahyu turun kepada Beliau kemudian setelah selesai, Beliau bersabda: \"Kerjakanlah manasik dalam 'umrahmu seperti kamu kerjakan dalam hajimu",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1848,
			"arabicnumber": 1848,
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1849,
			"arabicnumber": 1849,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Amru bin Dinar] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata; \"Ada seorang laki-laki ketika sedang wukuf bersama Nabi shallallahu 'alaihi wasallam di 'Arafah terjatuh dari hewan tunggangannya sehingga ia terinjak\" atau dia Ibnu 'Abbas radliallahu 'anhuma berkata: \"Hingga orang itu mati seketika\". Kemudian Nabi shallallahu 'alaihi wasallam berkata: \"Mandikanlah dia dengan air dan (air) yang dicampur daun bidara dan kafanilah dengan dua helai kain, Atau kata Beliau: dengan dua helai pakaian (ihram) nya dan janganlah diberi wewangian dan jangan pula diberi tutup kepala (serban) karena dia nanti Allah akan membangkitkannya pada hari qiyamat dalam keadaan bertalbiyyah",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1850,
			"arabicnumber": 1850,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas radliallahu 'anhum] berkata; \"Ketika ada seorang laki-laki yang sedang wukuf bersama Nabi shallallahu 'alaihi wasallam di 'Arafah terjatuh dari hewan tunggangannya sehingga ia terinjak\" atau dia (Ibnu 'Abbas radliallahu 'anhuma) berkata: \"Hingga orang itu mati seketika\". Maka Nabi shallallahu 'alaihi wasallam berkata: \"Mandikanlah dia dengan air dan (air) dicampur daun bidara dan kafanilah dengan dua helai kain dan janganlah (kainnya) diberi wewangian dan jangan pula diberi tutup kepala (serban) dan jangan pula (jasadnya) diberi wewangian karena Allah nanti membangkitkannya pada hari qiyamat dalam keadaan bertalbiyyah",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1851,
			"arabicnumber": 1851,
			"text": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Abu Bisyir] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas radliallahu 'anhuma] bahwa ada seorang laki-laki ketika sedang bersama Nabi shallallahu 'alaihi wasallam dijatuhkan oleh untanya dalam keadaan sedang berihram hingga meninggal dunia. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandikanlah dia dengan air dan air yang dicampur daun bidara dan kafanilah dengan dua helai kain dan janganlah diberi wewangian dan jangan pula diberi tutup kepala (serban) karena dia nanti dibangkitkan pada hari qiyamat dalam keadaan bertalbiyyah",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1852,
			"arabicnumber": 1852,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyir] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas radliallahu 'anhuma] bahwa ada seorang wanita dari suku Juhainah datang menemui Nabi shallallahu 'alaihi wasallam lalu berkata: \"Sesungguhnya ibuku telah bernadzar untuk menunaikan haji namun dia belum sempat menunaikannya hingga meninggal dunia, apakah boleh aku menghajikannya?\". Beliau menjawab: \"Tunaikanlah haji untuknya. Bagaimana pendapatmnu jika ibumu mempunyai hutang, apakah kamu wajib membayarkannya?. Bayarlah hutang kepada Allah karena (hutang) kepada Allah lebih patut untuk dibayar",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1853,
			"arabicnumber": 1853,
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1854,
			"arabicnumber": 1854,
			"text": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Ibnu Syihab] dari [Sulaiman bin Yasar] dari [Ibnu 'Abbas] dari [Al Fadhal bin 'Abbas radliallahu 'anhum] bahwa ada seorang wanita. Dan diriwayatkan pula oleh [Musa bin Isma'il] telah menceritakan kepada kami ['Abdul 'Aziz bin Abu Salamah] telah menceritakan kepada kami [Ibnu Syihab] dari [Sulaiman bin Yasar] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata; Ada seorang wanita dari suku Khats'am pada pelaksanaan Haji Wada' lalu berkata: \"Wahai Rasulullah, kewajiban yang Allah tetapkan buat para hambaNya tentang haji sampai kepada bapakku ketika dia sudah berusia lanjut sehingga dia tidak mampu untuk menempuh perjalanannya, apakah terpenuhi kewajiban untuknya bila aku menghajikannya?. Beliau menjawab: \"Ya",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1855,
			"arabicnumber": 1855,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari [Sulaiman bin Yasar] dari [Ibnu 'Abbas Radliallahu 'anhu] berkata; Ketika AL Fadhal membonceng Nabi shallallahu 'alaihi wasallam tiba-tiba datang seorang wanita dari suku Khats'am sehingga Al Fadhal memandangnya dan wanita itupun memandang kepadanya, maka Nabi shallallahu 'alaihi wasallam mengalihkan wajah Al Fadhah ke arah yang lain. Wanita itu berkata: \"Sesungguhnya kewajiban yang telah Allah tetapkan sampai kepada bapakku ketika dia sudah berusia lanjut sehingga dia tidak mampu untuk menempuh perjalanannya, apakah boleh aku menghajikannya?\". Beliau menjawab: \"Ya\". Peristiwa ini terjadi pada Haji Wada",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1856,
			"arabicnumber": 1856,
			"text": "Telah menceritakan kepada kami [Abu An-Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Ubaidullah bin Abu Yazid] berkata; Aku mendengar [Ibnu 'Abbas radliallahu 'anhuma] berkata: \"Nabi shallallahu 'alaihi wasallam mengutusku atau memanggilku untuk membawa perbekalan para musafir (jama'ah haji) di Jama' pada malam hari",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1857,
			"arabicnumber": 1857,
			"text": "Telah menceritakan kepada kami [Ishaq] telah mengabarkan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [anak saudaraku, Ibnu Syihab] dari [pamannya] telah mengabarkan kepada saya ['Ubaidullah bin 'Abdullah bin 'Utbah bin Mas'ud] bahwa ['Abdullah bin 'Abbas radliallahu 'anhu] berkata; \"Pada suatu hari aku datang, saat itu usiaku mendekati baligh dengan menunggang keledai betina milikku sedangkan Rasulullah shallallahu 'alaihi wasallam saat itu sedang shalat (berjama'ah) di Mina hingga aku sampai di hadapan sebagian shaf pertama kemudian aku turun dari keledaiku lalu ia mencari makan sesukanya. Kemudian aku masuk kedalam shaf jama'ah di belakang Rasulullah shallallahu 'alaihi wasallam \". Dan berkata, [Yunus] dari [Ibnu Syihab]: \"Di Mina pada pelaksanaan Haji Wada",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1858,
			"arabicnumber": 1858,
			"text": "Telah menceritakan kepada kami ['Abdurrahman bin Yunus] telah menceritakan kepada kami [Hatim bin Isma'il] dari [Muhammad bin Yusuf] dari [As-Sa'ib bin Yazid] berkata: \"Aku diajak menunaikan haji bersama Rasulullah shallallahu 'alaihi wasallam padahal saat itu usiaku baru tujuh tahun",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1859,
			"arabicnumber": 1859,
			"text": "Telah menceritakan kepada kami ['Amru bin Zurarah] telah mengabarkan kepada kami [Al Qasim bin Malik] dari [Al Ju'di bin 'Abdurrahman] berkata; Aku mendengar 'Umar bin 'Abdul 'Aziz berkata tentang [As-Saib bin Yazid] yang pernah menunaikan haji bersama rambongan dan perbekalan haji Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1860,
			"arabicnumber": 1860,
			"text": "Dan telahb berkata, kepadaku [Ahmad bin Muhammad] dia adalah Al Azraqiy telah menceritakan kepada kami [Ibrahim] dari [bapaknya] dari [kakeknya] bahwa ['Umar radliallahu 'anhu] memberi izin (untuk menunaikan haji) kepada para isteri Nabi shallallahu 'alaihi wasallam pada akhir haji yang dia lakukan, lalu ia mengutus 'Utsman bin 'Affan dan 'Abdurrahman bin 'Auf bersama mereka",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1861,
			"arabicnumber": 1861,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami ['Abdul Wahid] telah menceritakan kepada kami [Habib bin Abu 'Amrah] berkata, telah menceritakan kepada kami [Aisyah binti Tholhah] dari ['Aisyah Ummul Mukminin radliallahu 'anhu] berkata: \"Wahai Rasululloh, apakah kami tidak boleh ikut berperang dan berjihad bersama kalian?\". Maka Beliau menjawab: \"Akan tetapi (buat kalian) jihad yang paling baik dan paling sempurna adalah haji, yaitu haji mabrur\". Maka 'Aisyah radliallahu 'anha berkata; \"Maka aku tidak pernah meninggalkan haji sejak aku mendengar keterangan ini dari Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1862,
			"arabicnumber": 1862,
			"text": "Telah menceritakan kepada kami [Abu An-Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Amru] dari [Abu Ma'bad], sahayanya Ibnu 'Abbas, dari [Ibnu 'Abbas radliallahu 'anhuma] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah seorang wanita bepergian kecuali bersama mahramnya dan janganlah seorang laki-laki menemui seorang wanita kecuali wanita itu bersama mahramnya\". Kemudian ada seorang laki-laki yang berkata: \"Wahai Rasulullah, sebenarnya aku berkehendak untuk berangkat bersama pasukan perang ini dan ini namun isteriku hendak menunaikan haji\". Maka Beliau shallallahu 'alaihi wasallam bersabda: \"Berangkatlah haji bersama isterimu",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1863,
			"arabicnumber": 1863,
			"text": "Telah menceritakan kepada kami ['Abdan] telah mengabarkan kepada kami [Yazid bin Zurai'] telah mengabarkan kepada kami [Habib Al Mu'allim] dari ['Atho'] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata: \"Ketika Nabi shallallahu 'alaihi wasallam kembali dari pelaksanaan hajinya, Beliau berkata kepada Ummu Sinan Al Anshariyyah: \"Apa yang menghalangimu untuk menunaikan haji?\". Wanita itu berkata: \"Bapak si fulan, yang ia maksud suaminya, memiliki dua ekor unta yang salah satunya sering digunakan untuk menunaikan haji sedangn unta yang satunya lagi digunakan untuk mencari air minum buat kami\". Beliau bersabda: \"'Umrah pada bulan Ramadhan sebanding dengan haji atau haji bersamaku\". Ini diriwayatkan oleh [Ibnu Juraij] dari ['Atho']; Aku mendengar [Ibnu 'Abbas radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam. Dan ['Ubaidullah] berkata, dari ['Abdul Karim] dari ['Atho'] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1864,
			"arabicnumber": 1864,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari ['Abdul Malik bin 'Umair] dari [Qaza'ah, maula Ziyad] berkata; Aku mendengar [Abu Sa'id] yang sudah pernah mengikuti peperangan bersama Nabi shallallahu 'alaihi wasallam sebanyak dua belas peperangan, berkata: \"Empat perkara yang aku mendengarnya dari Rasulullah shallallahu 'alaihi wasallam, atau dia (Qaza'ah) berkata; telah menceritakan Abu Sa'id tentang beberapa perkara yang dia dapatkan dari Nabi shallallahu 'alaihi wasallam yang perkara-perkara itu menakjubkan aku (yaitu): \"Tidak boleh seorang wanita bepergian sepanjang dua hari perjalanan kecuali bersama suaminya atau mahramnya dan tidak boleh shaum dua hari raya, 'Iedul Fithri dan 'Iedul Adhha, dan tidak boleh melaksanakan dua shalat, yaitu setelah 'Ashar hingga matahari terbenam dan setelah Shubuh hingga matahari terbit dan tidaklah ditekankan untuk berziarah kecuali untuk mengunjungi tiga masjid, Al Masjidil Haram, Masjidku dan Masjidil Aqsha",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1865,
			"arabicnumber": 1865,
			"text": "Telah menceritakan kepada kami [Muhammad bin Salam] telah mengabarkan kepada kami [Al Fazariy] dari [Humaid Ath-Thowil] berkata, telah menceritakan kepada saya [Tsabit] dari [Anas radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam melihat seorang tua renta yang dipapah oleh kedua anaknya, maka Beliau bertanya: \"Mengapa orang ini berbuat seperti ini?\". Mereka menjawab: \"Dia telah bernadzar untuk berjalan kaki (menuju Makkah) \". Maka Beliau berkata: \"Allah tidak membutuhkan orang ini untuk menyiksa dirinya\". Maka Beliau memerintahkan orang itu naik tunggangan",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1866,
			"arabicnumber": 1866,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Hisyam bin Yusuf] bahwa [Ibnu Juraij] telah mengabarkan kepada mereka berkata, telah mengabarkan kepada saya [Sa'id bin Abu Ayyub] bahwa [Yazid bin Abu Habib] telah mengabarkan kepadanya bahwa [Abu Al Khair] menceritakan kepadanya dari ['Uqbah bin 'Amir] berkata: \"Saudara perempuanku telah bernadzar untuk berjalan kali menuju Baitullah lalu dia menyuruh aku untuk meminta fatwa kepada Nabi shallallahu 'alaihi wasallam. Aku datang meminta fatwa kepada Beliau, maka Beliau shallallahu 'alaihi wasallam bersabda: \"Hendaklah dia berjalan kaki dan berkendaraan\". Yazid bin Abu Habib berkata: Abu Al Khair tidak pernah berpisah dari 'Uqbah. Abu 'Abdullah Al Bukhariy berkata, telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Yahya bin Ayyub] dari [Yazid] dari [Abu Al Khair] dari ['Uqbah], lalu dia menyebutkan hadits tersebut diatas",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 46
			}
		}
	]
}