{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"31": "Praying at Night in Ramadaan (Taraweeh)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2008,
			"arabicnumber": 2008,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] berkata, telah mengabarkan kepada saya [Abu Salamah] bahwa [Abu Hurairah radliallahu 'anhu] berkata, Rasulullah shallallahu 'alaihi wasallam berkata tentang bulan Ramadhan: \"Barangsiapa yang menegakkannya karena iman kepada Allah dan mengharapkan pahala (hanya dariNya) maka akan diampuni dosa-dosa yang telah dikerjakannya",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2009,
			"arabicnumber": 2009,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Ibnu Syihab] dari [Humaid bin 'Abdurrahman] dari [Abu Hurairah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang menegakkan Ramadhan karena iman kepada Allah dan mengharapkan pahala (hanya dariNya) maka akan diampuni dosa-dosa yang telah dikerjakannya\". Ibnu Syihab berkata; Kemudian Rasulullah shallallahu 'alaihi wasallam wafat, namun orang-orang terus melestarikan tradisi menegakkan malam Ramadhan (secara bersama, jamaah), keadaan tersebut terus berlanjut hingga zaman kekhalifahan Abu Bakar dan awal-awal kekhilafahan 'Umar bin Al Khaththob radliallahu 'anhu",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2010,
			"arabicnumber": 2010,
			"text": "Dan dari [Ibnu Syihab] dari ['Urwah bin Az Zubair] dari ['Abdurrahman bin 'Abdul Qariy] bahwa dia berkata; \"Aku keluar bersama ['Umar bin Al Khaththob radliallahu 'anhu] pada malam Ramadhan menuju masjid, ternyata orang-orang shalat berkelompok-kelompok secara terpisah-pisah, ada yang shalat sendiri dan ada seorang yang shalat diikuti oleh ma'mum yang jumlahnya kurang dari sepuluh orang. Maka 'Umar berkata: \"Aku pikir seandainya mereka semuanya shalat berjama'ah dengan dipimpin satu orang imam, itu lebih baik\". Kemudian Umar memantapkan keinginannya itu lalu mengumpulkan mereka dalam satu jama'ah yang dipimpin oleh Ubbay bin Ka'ab. Kemudian aku keluar lagi bersamanya pada malam yang lain dan ternyata orang-orang shalat dalam satu jama'ah dengan dipimpin seorang imam, lalu 'Umar berkata: \"Sebaik-baiknya bid'ah adalah ini. Dan mereka yang tidur terlebih dahulu adalah lebih baik daripada yang shalat awal malam, yang ia maksudkan untuk mendirikan shalat di akhir malam, sedangkan orang-orang secara umum melakukan shalat pada awal malam",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2011,
			"arabicnumber": 2011,
			"text": "Telah menceritakan kepada kami [Isma'il] berkata, telah menceritakan kepada saya [Malik] dari [Ibnu Syihab] dari ['Urwah bin Az Zubair] dari ['Aisyah radliallahu 'anha] isteri Nabi shallallahu 'alaihi wasallam; Rasulullah shallallahu 'alaihi wasallam mendirikan shalat. Dan itu pada bulan Ramadhan",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2012,
			"arabicnumber": 2012,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] telah mengabarkan kepada saya ['Urwah] bahwa ['Aisyah radliallahu 'anha] mengabarkannya bahwa Rasulullah shallallahu 'alaihi wasallam pada suatu malam keluar kamar di tengah malam untuk melaksanakan shalat di masjid. Maka orang-orang kemudian ikut shalat mengikuti shalat Beliau. Pada waktu paginya orang-orang membicarakan kejadian tersebut sehingga pada malam berikutnya orang-orang yang berkumpul bertambah banyak lalu ikut shalat dengan Beliau. Pada waktu paginya orang-orang kembali membicarakan kejadian tersebut. Kemudian pada malam yang ketiga orang-orang yang hadir di masjid semakin bertambah banyak lagi lalu Rasulullah shallallahu 'alaihi wasallam keluar untuk shalat dan mereka ikut shalat bersama Beliau. Kemudian pada malam yang keempat, masjid sudah penuh dengan jama'ah hingga akhirnya Beliau keluar hanya untuk shalat Shubuh. Setelah Beliau selesai shalat Fajar, Beliau menghadap kepada orang banyak kemudian Beliau membaca syahadat lalu bersabda: \"Amma ba'du, sesungguhnya aku bukannya tidak tahu keberadaan kalian (semalam). Akan tetapi aku takut nanti menjadi diwajibkan atas kalian sehingga kalian menjadi keberatan karenanya\". Kemudian setelah Rasulullah shallallahu 'alaihi wasallam meninggal dunia, tradisi shalat (tarawih) secara berjamaah terus berlangsung seperti itu",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2013,
			"arabicnumber": 2013,
			"text": "Telah menceritakan kepada kami [Isma'il] berkata, telah menceritakan kepada saya [Malik] dari [Sa'id Al Maqbariy] dari [Abu Salamah bin 'Abdurrahman] bahwasanya dia bertanya kepada ['Aisyah radliallahu 'anha] tentang cara shalat Rasulullah shallallahu 'alaihi wasallam di bulan Ramadhan. Maka 'Aisyah radliallahu 'anha menjawab: \"Tidaklah Rasulullah shallallahu 'alaihi wasallam (melaksanakan shalat malam) di bulan Ramadhan dan di bulan-bulan lainnya lebih dari sebelas raka'at, Beliau shalat empat raka'at, maka jangan kamu tanya tentang bagus dan panjangnya kemudian Beliau shalat empat raka'at lagi dan jangan kamu tanya tentang bagus dan panjangnya, kemudian Beliau shalat tiga raka'at. Lalu aku bertanya: \"Wahai Rasulullah, apakah anda tidur sebelum melaksanakan witir?\" Beliau menjawab: \"Wahai 'Aisyah, sesungguhnya kedua mataku tidur, namun hatiku tidaklah tidur",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 6
			}
		}
	]
}