{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"39": "Kafalah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2290,
			"arabicnumber": 2290,
			"text": "",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2291,
			"arabicnumber": 2291,
			"text": "",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2292,
			"arabicnumber": 2292,
			"text": "Telah menceritakan kepada kami [Ash-Shaltu bin Muhammad] telah menceritakan kepada kami [Abu Usamah] dari [Idris] dari [Tholhah bin Musharrif] dari [Said bin Jubair] dari [Ibnu 'Abbas radliallahu 'anhuma]: Firman Allah yang berbunyi (Dan bagi harta peninggalan kami jadikan para pewaris), dia berkata; artinya: itulah warisan. Dan ayat (Dan orang-orang yang kamu telah bersumpah setia dengan mereka) ia berkata: ketika orang-orang muhajirin sampai di Madinah, seorang Muhajir mewarisi orang Anshar yang tidak memiliki hubungan kekeluargaan karena persaudaraan yang dipersaudarakan oleh Nabi shallallahu 'alaihi wasallam diantara mereka. Ketika ayat ini turun maka ayat ini menghapus ketentuan tersebut. Dan ayat tidak dipraktekkan lagi kecuali saling tolong menolong (antara Muhajirin - Anshar), pemberian dan nasehat sedangkan warisan telah dihapus dan diberi wasiat",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2293,
			"arabicnumber": 2293,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Humaid] dari [Anas radliallahu 'anhu] berkata, 'Abdurrahman bin 'Auf datang menemui kami lalu Rasulullah shallallahu 'alaihi wasallam mempersaudarakan dia dengan Sa'ad bin Ar-Rabi",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2294,
			"arabicnumber": 2294,
			"text": "Telah menceritakan kepada kami [Muhammad bin Ash-Shabbah] telah menceritakan kepada kami [Isma'il bin Zakariya'] telah menceritakan kepada kami ['Ashim] berkata; Aku bertanya kepada [Anas bin Malik radliallahu 'anhu]; Apakah sampai kepadanya sabda Nabi shallallahu 'alaihi wasallam yang berbunyi: \"Tidak ada perjanjian dalam Islam\". Maka dia berkata: \"Sungguh Nabi shallallahu 'alaihi wasallam pernah membuat perjanjian antara orang Quraisy dan Anshar di rumahku",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2295,
			"arabicnumber": 2295,
			"text": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Yazid bin Abi 'Ubaid] dari [Salamah bin Al Akwa' radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam dihadirkan kepada Beliau satu jenazah agar dishalatkan. Maka Beliau bertanya: \"Apakah orang ini punya hutang?\" Mereka berkata: \"Tidak\". Maka Beliau menyolatkan jenazah tersebut. Kemudian didatangkan lagi jenazah lain kepada Beliau, maka Beliau bertanya kembali: \"Apakah orang ini punya hutang?\" Mereka menjawab: \"Ya\". Maka Beliau bersabda: \"Shalatilah saudaramu ini\". Berkata, Abu Qatadah: \"Biar nanti aku yang menanggung hutangnya\". Maka Beliau shallallahu 'alaihi wasallam menyolatkan jenazah itu",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2296,
			"arabicnumber": 2296,
			"text": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami ['Amru] dia mendengar [Muhammad bin 'Ali] dari [Jabir bin 'Abdullah radliallahu 'anhum] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Seandainya tiba kepada kita harta dari negeri Bahrain aku pasti memberikan kepadamu sekian, sekian dan sekian\". namun harta dari Bahrain tidak kunjung datang hingga Nabi shallallahu 'alaihi wasallam wafat. Ketika harta dari Bahrain datang Abu Bakar memerintahkan dan berseru: \"Siapa yang telah dijanjikan sesuatu atau dihutangi oleh Nabi shallallahu 'alaihi wasallam hendaklah menemui kami\". Maka aku mendatanginya dan aku katakan bahwa Nabi shallallahu 'alaihi wasallam telah berkata kepadaku begini dan begitu, lalu ia (Abu Bakar) memberiku setangkup, lalu aku menghitungnya ternyata ia berjumlah lima ratus, lalu ia berkata; \"Ambillah dua kali lagi seperti itu",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2297,
			"arabicnumber": 2297,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] berkata, [Ibnu Syihab] maka dia mengabarkan keada saya ['Urwah bin Az Zubair] bahwa ['Aisyah radliallahu 'anha] isteri Nabi shallallahu 'alaihi wasallam berkata; \"Aku belum lagi baligh ketika bapakku sudah memeluk Islam\". Dan berkata, [Abu Shalih] telah menceritakan kepada saya ['Abdullah] dari [Yunus] dari [Az Zuhriy] berkata, telah mengabarkan kepada saya ['Urwah bin Az Zubair] bahwa ['Aisyah radliallahu 'anha] berkata; \"Aku belum lagi baligh ketika bapakku sudah memeluk Islam dan tidak berlalu satu haripun melainkan Rasulullah shallallahu 'alaihi wasallam datang menemui kami di sepanjang hari baik pagi ataupun petang. Ketika Kaum Muslimin mendapat ujian, Abu Bakar keluar berhijrah menuju Habasyah (Ethiopia) hingga ketika sampai di Barkal Ghomad dia didatangi oleh Ibnu Ad-Daghinah seorang kepala suku seraya berkata; \"Kamu hendak kemana, wahai Abu Bakar?\" Maka Abu Bakar menjawab: \"Kaumku telah mengusirku maka aku ingin keliling dunia agar aku bisa beribadah kepada Tuhanku\". Ibnu Ad-Daghinah berkata: \"Seharusnya orang seperti anda tidak patut keluar dan tidap patut pula diusir karena anda termasuk orang yang bekerja untuk mereka yang tidak berpunya, menyambung silaturahim, menanggung orang-orang yang lemah, menjamu tamu dan selalu menolong di jalan kebenaran. Maka aku akan menjadi pelindung anda untuk itu kembalilah dan sembahlah Tuhanmudi negeri kelahiranmu. Maka Ibnu Ad-Daghinah bersiap-siap dan kembali bersama Abu Bakar lalu berjalan di hadapan Kafir Quraisy seraya berkata, kepada mereka: \"Sesungguhnya orang sepeti Abu Bakar tidak patut keluar dan tidak patut pula diusir. Apakah kalian mengusir orang yang suka bekerja untuk mereka yang tidak berpunya, menyambung silaturahim, menanggung orang-orang yang lemah, menjamu tamu dan selalu menolong di jalan kebenaran?\" Akhirnya orang-orang Quraisy menerima perlindungan Ibnu Ad-Daghinah dan mereka memberikan keamanan kepada Abu Bakar lalu berkata, kepada Ibnu Ad-Daghinah: \"Perintahkanlah Abu Bakar agar beribadah menyembah Tuhannya di rumahnya saja dan shalat serta membaca Al Qur'an sesukanya dan dia jangan mengganggu kami dengan kegiatannya itu dan jangan mengeraskannya karena kami telah khawatir akan menimbulkan fitnah terhadap anak-anak dan isteri-isteri kami\". Maka Ibnu Ad-Daghinah menyampaikan hal ini kepada Abu Bakar. Maka Abu Bakar mulai beribadah di rumahnya dan tidak mengeraskan shalat bacaan Al Qur'an diluar rumahnya. Kemudian AbuBakar membangun tempat shalat di halaman rumahnya sedikit melebar keluar dimana dia shalat disana dan membaca Al Qur'an. Lalu istrei-isteri dan anak-anak Kaum Musyrikin berkumpul disana dengan penuh keheranan dan menanti selesainya Abu Bakar beribadah. Dan sebagaimana diketahui Abu Bakar adalah seorang yang suka menangis yang tidak sanggup menahan air matanya ketika membaca Al Qur'an. Maka kemudian kagetlah para pembesar Quraisy dari kalangan Musyrikin yang akhirnya mereka memanggil Ibnu Ad-Daghinah ke hadapan mereka dan berkata, kepadanya: \"Sesungguhnya kami telah memberikan perlindungan kepada Abu Bakr agar dia mberibadah di rumahnya namun dia melanggar hal tersebut dengan membangun tempat shalat di halaman rumahnya serta mengeraskan shalat dan bacaan padahal kami khawatir hal itu akan dapat mempengaruhi isteri-isteri dan anak-anak kami dan ternyata benar-benar terjadi. Jika dia suka untuk tetap beribadah di rumahnya silakan namun jika dia menolak dan tetap menampakkan ibadahnya itu mintalah kepadanya agar dia mengembalikan perlindungan anda karena kami tidak suka bila kamu melanggar perjanjian dan kami tidak setuju bersepakat dengan Abu Bakar\". Berkata, 'Aisyah radliallahu 'anha: Maka Ibnu Ad-Daghinah menemui Abu Bakar dan berkata: \"Kamu telah mengetahui perjanjian yang kamu buat, maka apakah kamu tetap memeliharanya atau mengembalikan perlindunganku kepadaku karena aku tidak suka bila orang-orang Arab mendengar bahwa aku telah melanggar perjanjian hanya karena seseorang yang telah aku berjanji kepadanya\". Maka Abu Bakar berkata: \"Aku kembalikan jaminanmu kepadamu dan aku ridho hanya dengan perlindungan Allah dan RasulNya shallallahu 'alaihi wasallam. Kejadian ini adalah di Makkah. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh aku telah ditampakkan negeri tempat hijrah kalian dan aku melihat negeri yang subur ditumbuhi dengan pepohonan kurma diantara dua bukit yang kokoh. Maka berhijrahlah orang yang berhijrah menuju Madinah ketika Rasulullah shallallahu 'alaihi wasallam menyebutkanhal itu. Dan kembali pula berdatangan ke Madinah sebagian dari mereka yang pernah hijrah ke Habasyah sementara Abu Bakar telah bersiap-siap pula untuk berhijrah. Maka Rasulullah shallallahu 'alaihi wasallam berkata, kepadanya: \"Janganlah kamu tergesa-gesa karena aku berharap aku akan diizinkan (untuk berhijrah) \". Abu Bakar berkata: \"Sungguh demi bapakku tanggungannya, apakah benar Tuan mengharapkan itu?\" Beliau bersabda: \"Ya benar\". Maka Abu Bakar berharap dalam dirinya bahwa dia benar-benar dapat mendampingi Rasulullah shallallahu 'alaihi wasallam dalam berhijrah. Maka dia memberi makan dua hewan tunggangan yang dimilikinya dengan dedaunan Samur selama empat bulan",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2298,
			"arabicnumber": 2298,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari [Abu Salamah] dari [Abu Hurairah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam pernah disodorkan kepada beliau seorang yang sudah merninggal dunia (jenazah) yang meninggalkan hutang maka Beliau bertanya: \"Apakah dia meninggalkan harta untuk membayar hutangnya?\" Jika diceritakan bahwa jenazah tersebut ada meninggalkan sesuatu untuk melunasi hutangnya maka Beliau menyolatinya, jika tidak maka Beliau berkata, kepada Kaum Muslimin: \"Shalatilah saudara kalian ini\". Ketika Allah telah membukakan kemenangan kepada Beliau di berbagai negeri Beliau bersabda: \"Aku lebih utama menjamin untuk orang-orang beriman dibanding diri mereka sendiri, maka siapa yang mneninggal dunia dari kalangan Kaum Mukminin lalu meninggalkan hutang akulah yang wajib membayarnya dan siapa yang meninggalkan harta maka harta itu untuk pewarisnya",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 9
			}
		}
	]
}