{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"47": "Partnership"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2483,
			"arabicnumber": 2483,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Wahb bin Kaisan] dari [Jabir bin 'Abdullah radliallahu 'anhuma] bahwa dia berkata; Rasulullah shallallahu 'alaihi wasallam mengutus pasukan menuju pantai dengan menunjuk Abu 'Ubaidah sebagai pemimpin mereka yang berjumlah tiga ratus orang dan aku termasuk dalam pasukan itu. Maka kami keluar hingga ketika kami sampai di tengah perjalanan bekal kami habis. Maka Abu 'Ubaidah memerintahkan agar semua anggota pasukan mengumpulkan bekal yang masih tersisa dan akhirnya terkumpul kurma dalam kantong yang bisa menguatkan kami, setiap hari kami makan sedikit sedikit sampai kurma itu habis dan tidak tersisa kecuali masing-masing kami dapat satu butir satu butir. Aku (Wahbbin Kaisan) bertanya: \"Apakah satu butir kurma mencukupi?\". Dia (Jabir bin 'Abdullah) berkata: \"Kami dapatkan penggantinya ketika sudah habis\". Jabir berkata: \"Kemudian kami sampai di laut, kami mendapatkan seekor ikan hiu sebesar bukit. Akhirnya pasukan memakan ikan hiu tersebut selama delapan belas malam lalu Abu 'Ubaidah memerintahkan untuk mengambil dua tulang rusuk ikan hiu tersebut lalu memerintahkan salah seorang dari pasukan berjalan di bawahnya maka orang itu dapat melaluinya dengan tanpa mengenainya (karena besarnya ikan hiu tersebut)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2484,
			"arabicnumber": 2484,
			"text": "Telah menceritakan kepada kami [Bisyir bin Marhum] telah menceritakan kepada kami [Hatim bin Isma'il] dari [YAzid bin Abu 'Ubaid] dari [Salamah radliallahu 'anhu] berkata: \"Perbekalan kaum menipis dan mereka kekurangan air dan makanan, lalu mereka mendatangi Nabi shallallahu 'alaihi wasallam meminta ijin untuk menyembelih unta mereka, Beliau pun mengijinkannya. Lalu 'Umar datang menemui mereka dan mereka mengabari hal itu padanya, lalu ia berkata; \"Apakah kalian akan dapat hidup setelah unta kalian habis, ia pun menemui Nabi shallallahu 'alaihi wasallam lalu berkata: \"Wahai Rasulullah, apakah mereka dapat bertahan hidup setelah mereka menyembelih unta mereka?\". Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Panggillah orang-orang agar mereka membawa sisa-sisa bekal mereka kemari\". Maka dihamparkan lembaran kulit lalu bekal bekal mereka diletakkan diatasnya. Kemudian Rasulullah shallallahu 'alaihi wasallam berdiri dan berdo'a serta memohon berkah untuknya, lalu Beliau perintahkan mereka membawa bejana mereka masing-masing. Maka orang-orang pun mengambil bagiannya hingga mereka mendapatkan semua, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku bersaksi bahwa tidak ada Ilah yang berhak disembah kecuali Allah dan aku adalah Rasululloh",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2485,
			"arabicnumber": 2485,
			"text": "Telah menceritakan kepada kami [Muhammad boin Yusuf] telah menceritakan kepada kami [Al Awza'iy] telah menceritakan kepada kami [Abu An-Najasyiy] berkata, aku mendengar [Rafi' bin Khadij radliallahu 'anhu] berkata: \"Kami shalat 'Ashar bersama Nabi shallallahu 'alaihi wasallam lalu kami menyembelih seekor hewan sembelihan lalu dibagi menjadi sepuluh bagian kemudian kami makan daging yang dimasak sebelum terbenam matahari",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2486,
			"arabicnumber": 2486,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al 'Alaa'] telah menceritakan kepada kami [Hammad bin Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang-orang Asya'ariy jika mereka berperang atau harta kebutuhan keluarga mereka di Madinah menipis maka mereka mengumpulkan apa saja milik mereka pada satu kain lalu mereka membagi rata diantara mereka pada tiap masing-masing, maka mereka adalah bagian dariku dan aku adalah bagian dari mereka",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2487,
			"arabicnumber": 2487,
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Al Mutsannaa] berkata, telah menceritakan kepadaku [bapakku] berkata, telah menceritakan kepadaku [Tsumamah bin 'Abdullah bin Anas] bahwa [Anas] menceritakan kepadanya bahwa Abu Bakar radliallahu 'anhu menetapkan kewajiban shadaqah kepadanya sebagaimana Rasulullah shallallahu 'alaihi wasallam telah mewajibkannya. Dia berkata: \"Dan dua orang yang telah bercampur (hewan ternak keduanya) hendaklah keduanya berdamai dengan menanggung beban yang sama",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2488,
			"arabicnumber": 2488,
			"text": "Telah menceritakan kepada kami ['Ali bin Al Hakam Al Anshariy] telah menceritakan kepada kami [Abu 'Awanah] dari [Sa'id bin Masruq] dari ['Abayah bin Rifa'ah bin Rafi' bin Khadij] dari [kakeknya] berkata; \"Kami bersama Nabi shallallahu 'alaihi wasallam di Dzul Hulaifah ketika sebagian orang terserang lapar lalu mereka mendapatkan (harta rampasan perang berupa) unta dan kambing. Saat itu Nabi shallallahu 'alaihi wasallam berada di belakang bersama rombongan yang lain. Orang-orang yang lapar itu segera saja menyembelih lalu mendapatkan daging sebanyak satu kuali. Maka Nabi shallallahu 'alaihi wasallam memerintahkan agar kuali tersebut ditumpahkan isinya. Kemudian Beliau membagi rata dimana bagian setiap sepuluh kambing sama dengan satu ekor unta. Namun ada seekor unta yang lari lalu mereka mencarinya hingga kelelahan. Sementara itu diantara mereka ada yang memiliki seekor kuda yang lincah lalu ia mencari unta tadi dan memburunya dengan panah hingga akhirnya Allah menakdirkannya dapat membunuh unta tersebut. Beliau bersabda: \"Sesungguhnya bintang seperti ini hukumnya sama dengan binatang liar. Maka apa saja yang kabur dari kalian (lalu didapatkannya,) perlakuklanlah seperti ini\". Kakekku berkata: \"Kita berharap atau khawatir bertemu musuh esok hari sedangkan kita tidak punya pisau, apakah kita boleh menyembelih dengan kayu?\". Beliau berkata: \"Setiap yang ditumpahkan darahnya dengan disebut nama Allah maka makanlah kecuali gigi dan kukunya, dan aku akan sampaikan tentang itu. Adapun gigi dia termasuk tulang sedangkan kuku merupakan pisaunya orang-orang Habsasyah",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2489,
			"arabicnumber": 2489,
			"text": "Telah menceritakan kepada kami [Khallad bin Yahya] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Jabalah bin Suhaim] berkata, aku mendengar [Ibnu 'Umar radliallahu 'anhuma] berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang seseorang memakan dua butir kurma sekaligus sebelum dia meminta izin sahabat-sahabatnya (yang sedang makan bersama)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2490,
			"arabicnumber": 2490,
			"text": "Telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah] dari [Jabalah] berkata; Ketika di Madinah saat kami tertimpa paceklik, Ibnu Az Zubair adalah orang yang memberi makan kami. Suatu saat [Ibnu 'Umar] lewat di hadapan kami, maka dia berkata: \"Janganlah kalian makan dua butir secara sekaligus, karena Nabi shallallahu 'alaihi wasallam telah melarang memakan dua butir kurma sekaligus kecuali bila seorang dari kalian meminta izin saudaranya terlebih dahulu",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2491,
			"arabicnumber": 2491,
			"text": "Telah menceritakan kepada kami ['Imran bin Maisarah] telah menceritakan kepada kami ['Abdul Warits] telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang membebaskan jatah kepemilikan, atau bagian kepemilikan dari budaknya\" atau Beliau bersabda dengan redaksi 'hak kepemilikan', lantas ia mempunyai harta yang bisa membebaskan budak itu secara penuh sesuai harga yang rata-rata, maka budak itu menjadi merdeka\". (Ayyub) berkata: \"Aku tidak tahu apakah ucapan itu dari Nafi' atau termasuk hadits yang disabdakan Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2492,
			"arabicnumber": 2492,
			"text": "Telah menceritakan kepada kami [Bisyir bin Muhammad] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Sa'id bin Abi 'Urwah] dari [Qatadah] dari [An-Nadhar bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Siapa yang membebaskan hak kepemilikan budaknya, maka dia masih berkewajiban membebaskan budak tersebut secara penuh. Bila dia tidak memiliki harta, maka budak itu ditaksir harganya secara normal, lantas budak diusahakan untuk dibebaskan secara penuh dengan tanpa membebani dia saja",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2493,
			"arabicnumber": 2493,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zakariyya'] berkata, aku mendengar ['Amir] berkata, aku mendengar [An-Nu'man bin Basyir radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Perumpamaan orang yang menegakkan hukum Allah dan orang yang diam terhadapnya seperti sekelompok orang yang berlayar dengan sebuah kapal lalu sebagian dari mereka ada yang mendapat tempat di atas dan sebagian lagi di bagian bawah perahu. Lalu orang yang berada di bawah perahu bila mereka mencari air untuk minum mereka harus melewati orang-orang yang berada di bagian atas seraya berkata; \"Seandainya boleh kami lubangi saja perahu ini untuk mendapatkan bagian kami sehingga kami tidak mengganggu orang yang berada di atas kami\". Bila orang yang berada di atas membiarkan saja apa yang diinginkan orang-orang yang di bawah itu maka mereka akan binasa semuanya. Namun bila mereka mencegah dengan tangan mereka maka mereka akan selamat semuanya",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2494,
			"arabicnumber": 2494,
			"text": "Telah menceritakan kepada kami ['Abdul 'Aziz bin 'Abdullah Al 'Amiriy Al Uwaisiy] telah menceritakan kepada kami [Ibrahim bin Sa'ad] dari [Shalih] dari [Ibnu Syihab] telah menceritakan kepadaku ['Urwah] bahwa dia bertanya kepada ['Aisyah radliallahu 'anha]. Dan [Al Laits] berkata, telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] be telah menceritakan kapadaku ['Urwah bin Az Zubair] bahwa dia bertanya kepada ['Aisyah radliallahu 'anha] tentang firman Allah yang artinya: (\"Jika kamu khawatir tidak dapat berlaku adil …. seterusnya hingga …empat-empat\". (QS. An-Nisaa ayat 3), maka ia menjawab: \"Wahai anak saudariku, yang dimaksud ayat itu adalah seorang anak perempuan yatim yang berada pada asuhan walinya, hartanya ada pada walinya, dan walinya ingin memiliki harta itu dan menikahinya namun ia tidak bisa berbuat adil dalam memberikan maharnya, yaitu memberi seperti ia memberikan untuk yang lainnya, maka mereka dilarang untuk menikahinya kecuali jika mereka bisa berbuat adil pada mereka, dan mereka memberikan mahar terbaik kepadanya, mereka diperintahkan untuk menikahi wanita-wanita yang baik untuk mereka selain anak-anak yatim itu\". 'Urwah berkata, lalu 'Aisyah berkata, kemudian orang-orang meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam setelah turunnya ayat ini; wayastaftuunaka finnisaa' (dan mereka meminta fatwa kepadamu tentang para wanita) hingga firmanNya; watarghobuuna antankihuuhunna (dan kalian ingin menikahi mereka) dan yang disebutkan Allah pada firmanNya bahwa; yutla 'alaikum fil kitab (telah disebutkan untuk kalian di dalam Al Quran) ayat pertama yang Allah berfirman didalamnya ada kalimat; wa in khiftum allaa tuqsituu fil yataamaa fankihuu maa thaoba lakum minan nisaa' (jika kalian tidak bisa berbuat adil kepada anak-anak yatim, maka nikahilah wanita-wanita yang baik untuk kalian), 'Aisyah berkata, dan firman Allah pada ayat yang lain; watarghobuuna an tankihuuhunna (dan kalian ingin untuk menikahi mereka) yaitu keinginan kalian untuk menikahi anak perempuan yatim yang kalian asuh ketika ia sedikit hartanya dan kurang menarik wajahya, maka mereka dilarang untuk menikahi mereka karena semata hartanya dan kecantikannya dari anak-anak perempuan yatim kecuali dengan adil disebabkan ketidak tertarikan mereka kepada perempuan yatim itu",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2495,
			"arabicnumber": 2495,
			"text": "Telah menceritakan kepada saya ['Abdullah bin Muhammad] telah menceritakan kepada kami [Hisyam] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhriy] dari [Abu Salamah] dari [Jabir bin 'Abdullah radliallahu 'anhuma] berkata; Nabi shallallahu 'alaihi wasallam telah menetapkan Asy-Syuf'ah pada setiap tanah yang belum dibagi. Apabila sudah terdapat batasan-batasan dan jalan yang terpisah maka tidak ada syuf'ah lagi",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2496,
			"arabicnumber": 2496,
			"text": "Telah menceritakan kepada saya [Musaddad] telah menceritakan kepada kami ['Abdul Wahid] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhriy] dari [Abu Salamah] dari [Jabir bin 'Abdullah radliallahu 'anhuma]; Nabi shallallahu 'alaihi wasallam telah menetapkan Asy-Syuf'ah pada setiap tanah yang belum dibagi. Apabila sudah terdapat batasan-batasan dan jalan yang terpisah maka tidak ada syuf'ah lagi",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2498,
			"arabicnumber": 2498,
			"text": "",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2499,
			"arabicnumber": 2499,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Juwairiyah bin Asma'] dari [Nafi'] dari ['Abdullah radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam memberikan tanah Khaibar kepada orang Yahudi agar dimanfaatkan dan dijadikan ladang pertanian dan mereka mendapat bagian dari separuh hasilnya",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2500,
			"arabicnumber": 2500,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [YAzid bin Abi Habib] dari [Abu Al Khair] dari ['Uqbah bin 'Amir radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam memberikan kepadanya seekor kambing yang Beliau bagikan untuk para sahabat Beliau sebagai hewan qurban dan tersisa anak kambing yang sudah bisa berdiri sendiri. Kemudian diceritakan hal itu kepada Nabi shallallahu 'alaihi wasallam maka Beliau bersabda: \"Ambillah buatmu",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2502,
			"arabicnumber": 2502,
			"text": "",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2503,
			"arabicnumber": 2503,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Juwairiyah bin Asma'] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membebaskan hak kepemilikan seorang budak, maka ia berkewajiban untuk membebaskan seluruhnya. Seandainya dia memiliki harta sebanyak harga budaknya, maka budaknya ditaksir dengan harga normal dan teman yang memiliki hak berserikat itu diberikan hak bagiannya dan budak dibebaskan",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2504,
			"arabicnumber": 2504,
			"text": "Telah menceritakan kepada kami [Abu An-Nu'man] telah menceritakan kepada kami [Jarir bin HAzim] dari [Qatadah] dari [An-Nadhar bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Siapa yang membebaskan bagiannya dari budak yang dimiliki secara berserikat, maka wajib baginya untuk membebaskan seluruhnya seandainya dia memiliki harta sebanyak harga budaknya, dan jika tidak, maka si budak wajib tetap berusaha untuk membebaskan sisa status kebudakannya dengan tidak menyusahkan orang yang telah memerdekkan sebagiannya",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2506,
			"arabicnumber": 2506,
			"text": "",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2507,
			"arabicnumber": 2507,
			"text": "Telah menceritakan kepada kami [Muhammad] telah mengabarkan kepada kami [Waki'] dari [Sufyan] dari [bapaknya] dari ['Abayah bin Rifa'ah] dari [kakeknya, Rafi' bin Khadij radliallahu 'anhu] berkata; \"Kami bersama Nabi shallallahu 'alaihi wasallam tiba di Dzul Hulaifah dari Tihamah lalu kami mendapatkan kambing dan unta (sebagai harta rampasan perang). Tiba-tiba rombongan menyembelih hewan-hewan tersebut hingga memenuhi kuali besar. Kemudian Rasulullah shallallahu 'alaihi wasallam datang dan memerintahkan agar kuali tersebut ditumpahkan isinya. Kemudian Beliau membagi rata yang bagian setiap sepuluh kambing sama dengan satu ekor unta. Namun ada seekor unta yang lari sementara dalam rambongan itu tidak ada kuda kecuali seekor yang sangat lincah, lalu dengan kuda itu ada seorang yang mengejar sapi yang kabur tersebut hingga dapat membunuhnyadengan tombaknya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya binatang seperti ini hukumnya sama dengan binatang liar. Maka siapa yang dapat membunuhnya maka perlakuklanlah seperti ini\". Dia berkata; Kakekku berkata: \"Kami berharap atau khawatir bertemu musuh esok hari sedangkan kita tidak punya pisau, apakah kita boleh menyembelih dengan kayu?\". Beliau berkata: \"Ya, atau bawalah kepadaku, sesungguhnya setiap yang ditumpahkan darahnya dengan disebut nama Allah maka makanlah kecuali gigi dan kukunya, dan aku akan sampaikan tentang itu. Adapun gigi dia termasuk tulang sedangkan kuku merupakan pisaunya orang-orang Habasyah",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 22
			}
		}
	]
}