{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2782,
			"arabicnumber": 2782,
			"text": "Telah bercerita kepada kami [Al Hasan bin Shobbah] telah bercerita kepada kami [Muhammad bin Sabiq] telah bercerita kepada kami [Malik bin Mighwal] berkata; aku mendengar [Al Walid bin Al 'Ayzar] menyebutkan dari [Abu 'Amru Asy Syaibaniy] berkata ['Abdullah bin Mas'ud radliallahu 'anhu] berkata: \"Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam, aku katakan: \"Wahai Rasulullah, amal apakah yang paling utama?\" Beliau menjawab: \"Sholat pada waktunya\". Kemudian aku tanyakan lagi: \" Kemudian apa?\" Beliau menjawab: \"Kemudian berbakti kepada kedua orang tua\". Lalu aku tanyakan lagi: \"Kemudian apa lagi?\" Beliau menjawab: \"Jihad di jalan Allah\". Maka aku berhenti menyakannya lagi kepada Rasulullah shallallahu 'alaihi wasallam. Seandainya aku tambah terus pertanyaan, Beliau pasti akan menambah jawabannya kepadaku",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2783,
			"arabicnumber": 2783,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Yahya bin Sa'id] telah bercerita kepada kami [Sufyan] berkata telah bercerita kepadaku [Manshur] dari [Mujahid] dari [Thowus] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada lagi hijrah setelah kemenangan (Makkah) akan tetapi yang tetap ada adalah jihad dan niat. Maka jika kalian diperintahkan berangkat berjihad, berangkatlah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2784,
			"arabicnumber": 2784,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Khalid] telah bercerita kepada kami [Habib bin Abu 'Amrah] dari ['Aisyah binti Thalhah] dari ['Aisyah radliallahu 'anha] bahwa dia berkata: \"Wahai Rasulullah, engkau telah menjelaskan bahwa jihad adalah amal yang paling utama. Apakah kami boleh berjihad?\" Beliau bersabda: \"Tidak. Tetapi jihad yang paling utama (buat kaum wanita) adalah haji mabrur",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2785,
			"arabicnumber": 2785,
			"text": "Telah bercerita kepada kami [Ishaq bin Manshur] telah mengabarkan kepada kami ['Affan] telah bercerita kepada kami [Hammam] telah bercerita kepada kami [Muhamad bin Juhadah] berkata telah bercerita kepadaku [Abu Hashin] bahwa [Dzakwan] bercerita kepadanya bahwa [Abu Hurairah radliallahu 'anhu] bercerita kepadanya, katanya: \"Datang seseorang kepada Rasulullah shallallahu 'alaihi wasallam lalu bertanya: \"Tunjukkan kepadaku suatu amal yang dapat menyamai jihad?\" Beliau menjawab: \"Aku tidak menemukannya \". Beliau melanjutkan: \"Apakah kamu sanggup jika seorang mujahid keluar berjihad sedangkan kamu masuk ke dalam masjidmu lalu kamu tegakkan ibadah tanpa henti dan kamu berpuasa tanpa berbuka?\" Orang itu berkata: \"Mana ada orang yang sanggup berbuat begitu\". Abu Hurairah radliallahu 'anhu berkata: \"Sesunguhnya kuda seorang mujahid yang dikekang talinya untuk berperang akan ditulis sebagai kebaikan",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2786,
			"arabicnumber": 2786,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata telah bercerita kepadaku ['Atha' bin Yazid Al Laitsiy] bahwa [Abu Sa'id Al Khudriy radliallahu 'anhu] bercerita kepadanya, katanya: \"Ditanyakan kepada Rasulullah, siapakh manusia yang paling utama?\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang mu'min yang berjihad di jalan Allah dengan jiwa dan hartanya\". Mereka bertanya lagi: \"Kemudian siapa lagi?\" Beliau menjawab: \"Seorang mu'min yang tinggal diantara bukit dari suatu pegunungan dengan bertaqwa kepada Allah dan meninggalkan manusia dari keburukannya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2787,
			"arabicnumber": 2787,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata telah bercerita kepadaku [Sa'id bin Al Musayyab] bahwa [Abu Hurairah radliallahu 'anhu] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan seorang mujahid di jalan Allah, dan hanya Allah yang paling tahu siapa yang berjihad di jalan-Nya, seperti seorang yang melaksanakan shoum (puasa) dan berdiri (shalat) terus menerus. Dan Allah berjanji kepada mujahid di jalan-Nya, dimana bila Dia mewafatkannya maka akan dimasukkannya ke surga atau bila Dia mengembalikannya dalam keadaan selamat dia akan pulang dengan membawa pahala atau ghonimah (harta rampasan perang)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2788,
			"arabicnumber": 2788,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] dari [Malik] dari [Ishaq bin 'Abdullah bin Abi Thalhah] dari [Anas bin Malik radliallahu 'anhu] bahwa dia mendengarnya berkata: \"Rasulullah shallallahu 'alaihi wasallam pernah datang kepada Ummu Haram binti Milhan lalu dia memberi makan Beliau. Dimana saat itu Ummu Haram berada pada tangung jawab (istri) 'Ubadah bin ash-Shomit lalu Rasulullah shallallahu 'alaihi wasallam mendatanginya kemudian dia memberi makan Baliau dan Ummu Haram kemudian menyisir rambut kepala Beliau hingga Rasulullah shallallahu 'alaihi wasallam tertidur. Kemudian Beliau terbangun sambil tertawa. Ummu Haram berkata; Aku tanyakan: \"Apa yang membuat Tuan tertawa wahai Rasulullah\". Beliau menjawab: \"Ada orang-orang dari ummatku yang diperlihatkan kepadaku sebagai pasukan perang di jalan Allah dimana mereka mengarungi lautan sebagai raja-raja di atas singgasana atau seperti bagaikan raja-raja di atas singgasana\". Ishaq ragu dalam kalimat ini. Ummu Haram berkata; Aku katakan: \"Wahai Rasulullah, do'akanlah agar Allah menjadikan aku salah seorang dari mereka\". Maka Rasulullah shallallahu 'alaihi wasallam berdo'a untuknya. Kemudian Beliau meletakkan kepalanya (tertidur) lalu terbangun sambil tertawa. Ummu Haram berkata; Aku tanyakan: \"Apa yang membuat Tuan tertawa wahai Rasulullah\". Beliau menjawab: \"Ada orang-orang dari ummatku yang diperlihatkan kepadaku sebagai pasukan perang di jalan Allah\". Sebagaimana ucapan Beliau yang pertama tadi. Ummu Haram berkata; Aku katakan: \"Wahai Rasulullah, do'akanlah kepada Allah agar Dia menjadikan aku salah seorang dari mereka\". Beliau berkata: \"Kamu akan menjadi diantara orang-orang yang pertama kali\". Maka Ummu Haram mengarungi lautan pada zaman Mu'awiyah bin Abi Sufan. Setelah keluar dari (mengarungi) lautan dia dilempar oleh hewan tunggangannya hingga menewaskannya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2790,
			"arabicnumber": 2790,
			"text": "Telah bercerita kepada kami [Yahya bin Shalih] telah bercerita kepada kami [Fulaih] dari [Hilal bin 'Ali] dari ['Atha' bin asar] dari [Abu Hurairah radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang beriman kepada Allah, menegakkan shalat, berpuasa bulan ramadhan, maka sudah pasti Allah akan memasukkannya kedalam surga, baik apakah dia berjihad di jalan Allah atau dia hanya duduk tinggal di tempat di mana dia dilahirkan\". Mereka bertanya: \"Wahai Rasulullah, apakah tidak sebaiknya kami sampaikan berita gembira ini kepada orang-orang?\" Beliau bersabda: \"Sesungguhnya di surga itu ada seratus derajat (kedudukan) yang Allah menyediakannya buat para mujahid di jalan Allah dimana jarak antara dua derajat seperti jarak antara langit dan bumi. Untuk itu bila kalian minta kepada Allah maka mintalah surga firdaus karena dia adalah tengahnya surga dan yang paling tinggi. Aku pernah diperlihatkan bahwa diatas firdaus itu adalah singgasanannya Allah Yang Maha Pemurah dimana darinya mengalir sungai-sungai surga\". Berkata [Muhammad bin Fulaih] dari [bapaknya]: \"Diatasnya adalah singgasanannya Allah Yang Maha Pemurah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2791,
			"arabicnumber": 2791,
			"text": "Telah bercerita kepada kami [Musa] telah bercerita kepada kami [Jarir] telah bercerita kepada kami [Abu Roja'] dari [Samrah]: Nabi shallallahu 'alaihi wasallam bersabda: \"Pada malam (Isra' dan Mi'raj) aku ditemui oleh dua malaikat yang mengajakku mendaki sebuah pohon lalu keduanya memasukkan aku ke sebuah negeri (kampung) yang terbaik dan paling utama yang belum pernah aku melihat yang lebih bailk darinya. Kedua malaikat itu berkata: \"Adapun negeri ini adalah kampungnya para syuhada' (orang yang mati syahid)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2792,
			"arabicnumber": 2792,
			"text": "Telah bercerita kepada kami [Mu'allaa bin Asad] telah bercerita kepada kami [Wuhaib] telah bercerita kepada kami [Humaid] dari [Anas bin Malik radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Pergi keluar berperang di jalan Allah pada awal (pagi) hari atau pergi keluar berperang pada akhir (siang) hari lebih baik dari pada dunia dan seisinya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2793,
			"arabicnumber": 2793,
			"text": "Telah bercerita kepada kami [Ibrahim bin Al Mundzir] telah bercerita kepada kami [Muhammad bin Fulaih] berkata telah bercerita kepadaku [bapakku] dari [Hilal bin 'Ali] dari ['Abdur Rahman bin Abi 'Amrah] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Sungguh panjang (sehasta) ujung busur panah di surga lebih baik dari apa yang padanya matahari terbit dan terbenam\". Dan Beliau juga bersabda: \"Pergi keluar berperang di jalan Allah pada awal (pagi) hari atau pergi keluar berperang pada akhir (siang) hari lebih baik dari pada dunia dan seisinya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2794,
			"arabicnumber": 2794,
			"text": "Telah bercerita kepada kami [Qabishah] telah bercerita kepada kami [Sufyan] dari [Abu Hazim] dari [Sahal bin Sa'ad radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Berangkat pada awal hari (pagi) atau berangkat pada akhir hari (siang) untuk berperang di jalan Allah lebih baik dari pada dunia dan apa saja yang ada diatasnya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2795,
			"arabicnumber": 2795,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Mu'awiyah bin 'Amru] telah bercerita kepada kami [Abu Ishaq] dari [Humaid] berkata aku mendengar [Anas bin Malik radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada seorang hamba pun yang meninggal dunia, di dimana di sisi Allah dia mendaptkan balasan, yang lebih baik sehingga membuatnya berhasrat untuk kembali lagi ke dunia dan sungguh dia mendapatkan dunia beserta isinya kecuali orang yang mati syahid karena dia melihat keutamaan mati syahid. Sungguh dia menginginkan dapat kembali ke dunia kemudian dia (berperang) dan mati syahid sekali lagi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2796,
			"arabicnumber": 2796,
			"text": "Masih melalui jalur periwayatan yang sama seperti hadits sebelumnya. Berkata, danaku mendengar [Anas bin Malik radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam: \"Pergi keluar berperang di jalan Allah pada awal (pagi) hari atau pergi keluar berperang pada akhir (siang) hari lebih baik dari pada dunia dan seisinya. Dan sungguh panjang (sehasta) busur panah seorang dari kalian di surga atau tempat (sarung) cambuknya lebih baik dari dunia dan seisinya. Dan seandainya seorang perempuan (bidadari) penduduk surga muncul di tengah penduduk bumi niscaya ia akan menerangi apa yang ada diantara keduanya (cakrawala langit dan bumi) dan arama wanginya akan memenuhi cakrawala itu dan sungguh kerudung yang ada di kepalanya itu lebih baik dari pada dunia dan seisinya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2797,
			"arabicnumber": 2797,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata telah bercerita kepadaku [Sa'id in Al Musayyab] bahwa [Abu Hurairah radliallahu 'anhu] berkata aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, seandainya ada sebagian orang-orang yang beriman tidak baik hati mereka dengan tidak mau menggikutiku untuk berperang dan aku tidak mampu lagi untuk membawa mereka. Sungguh aku tidak akan pernah mau ketinggalan dari pasukan perang (untuk berperang) di jalan Allah. Dan demi Dzat yang jiwaku di tangan-Nya, sungguh aku menginginkan untuk berperang lalu aku terbunuh di jalan Allah kamudian aku dihidupkan kembali lalu aku terbunuh kemudian dihidupkan kembali lalu terbunuh lagi kemudian aku dihiidupkan kembali lalu terbunuh lagi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2798,
			"arabicnumber": 2798,
			"text": "Telah bercerita kepada kami [Yusuf bin Ya'qub Ash-Shoffar] telah bercerita kepada kami [Isma'il bin 'Ulayyah] dari [Ayub] dari [Humaid bin Hilal] dari [Anas bin Malik radliallahu 'anhu] berkata; Nabi shallallahu 'alaihi wasallam menyampaiklan khothbah lalu bersabda: \"Zaid akan memegang bendera perang lalu dia gugur kemudian bendera itu dipegang oleh Ja'far lalu dia pun gugur kemudian bendera itu dipegang oleh 'Abdullah bin Rawahah namun diapun gugur pula. Akhirnya bendera itu diambil oleh Khalid bin Al Walid padahal sebelumnya dia tidak ditunjuk. Maka lewat dialah kemenangan dapat diraih\". Dan Anas berkata: \"Kejadian itu menggembirakan kami seolah mereka ada bersama kami\". Ayyub berkata: \"Kejadian itu (karamah para suhada') tidaklah menjadikan mereka ingin untuk kembali bersama kami (di dunia kecuali bila mati syahid kembali untuk kedua kali) \". Dan kedua matanya berlinang air mata",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2799,
			"arabicnumber": 2799,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] berkata telah bercerita kepadaku [Al Laits] telah bercerita kepada kami [Yahya] dari [Muhammad bin Yahya bin Hayyan] dari [Anas bin Malik radliallahu 'anhu] dari [bibinya, Ummu Haram binti Milhan] berkata: Pada suatu hari Nabi shallallahu 'alaihi wasallam tertidur di dekatku kemudian terbangun sambil tersenyum. Lalu aku bertanya: \"Apa yang membuat Tuan tertawa?\" Beliau bersabda: \"Ada orang-orang dari ummatku yang diperlihatkan kepadaku sebagai pasukan perang di jalan Allah dimana mereka mengarungi lautan yang hijau bagaikan raja-raja di atas singgasana\". Ummu Haram berkata: \"Do'akanlah agar Allah menjadikan aku salah seorang dari mereka\". Maka Beliau mendo'akannya. Kemudian Beliau tertidur kembali untuk kedua kalinya dan kembali berbuat seperti sebelumnya. Dan Ummu Haram juga bertanya sebagaimana yang sudah ditanyakannnya dan Beliau pun menjawab sama dengan sebelumnya. Maka Ummu Haram berkata: \"Do'akanlah agar Allah menjadikan aku salah seorang dari mereka\".. Beliau bersabda: \"Kamu akan menjadi diantara orang-orang yang pertama kali\". Maka pada suatu masa, Ummu Haram berangkat berperang bersama suaminya 'Ubadah bin ash-Shomit sebagai salah seorang dari Kaum Muslimin yang pertama kali berperang dengan mengarungi lautan bersama Mu'awiah. Setelah selesai dari perang, mereka kembali dan singgah di negeri Syam. Kemudian Ummu Haram diberi hewan untuk ditunggangi namun dia tersungkur jatuh hinga meninggal dunia",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2801,
			"arabicnumber": 2801,
			"text": "Telah bercerita kepada kami [Hafsh bin 'umar Al Hawdhiy] telah bercerita kepada kami [Hammam] dari [Ishaq] dari [Anas radliallahu 'anhu] berkata; \"Rasulullah shallallahu 'alaihi wasallam mengutus tujuh puluh orang dari Bani Sulaim menemui suku Bani Amir sesampainya di sana pamanku berkata kepada mereka; \"Aku akan mendahului kalian seandainya mereka mengizinkanku menyampaikan pesan Rasulullah shallallahu 'alaihi wasallam, sementara itu kalian harus berada di dekatku\" maka ia pun maju ke depan barisan mereka sementara orang kafir menjamin keselamatannya. Namun ketika ia menyampaikan pesan Rasulullah shallallahu 'alaihi wasallam, salah seorang dari mereka menikamnya hingga tewas, pamanku berkata; \"Allahu Akbar, demi Tuhan Ka'bah aku telah beruntung, setelah itu mereka menyerang pasukan pamanku dan membunuh habis mereka kecuali seorang laki-laki pincang yang melarikan diri ke gunung, Hammam berkata: \"Menurutku ada laki-laki lain yuang mampu melarikan diri bersamanya\". Kemudiam Malaikat Jibril Alaihis Salam mengabarkan kepada Nabi shallallahu 'alaihi wasallam bahwa mereka (utusan yang telah dibunuh) telah berjumpa dengan Robb mereka, Dia ridha kepada mereka dan memberikan kebahagian kepada mereka. (Mereka) berkata,: kami telah membaca: (\"Kami telah menyampaikan kepada kaum kami bahwa kami telah berjumpa dengan Robb, Dia ridha terhadap kami dan memberikan kebahagiaan kepada kami \"). Lalu (ayat) ini dihapus. Kemudian Nabi shallallahu 'alaihi wasallam berdo'a selama empa puluh hari (dalam shalat) shubuh mengutuk perkampungan mereka, Dzakwan, Bani Lahyan dan Bani 'Ushoyyah yang telah durhaka kepada Allah dan Rosul-Nya shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2802,
			"arabicnumber": 2802,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Abu 'Awanah] dari [Al Aswad bin Qais] dari [Jundab bin Sufan] bahwa Rasulullah shallallahu 'alaihi wasallam ikut terlibat dalam berbagai peperangan dimana jari jemari Beliau terluka mengeluarkan darah,. Maka kemudian Beliau bersya'ir: \"tiadalah kamu melainkan seujung jari yang berdarah, dan di jalan Allah ada sesuatu yang kamu peraleh",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2803,
			"arabicnumber": 2803,
			"text": "Telah bercerita kepada kami ['Abdullah biin Yusuf] telah mengabarkan kepada kami [Malik] dari [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, tidaklah seseorang terluka di jalan Allah, dan Allahlah yang paling tahu siapa yang terluka di jalan-Nya, kecuali dia akan datang pada hari qiyamat dalam keadaan berwarna dengan warna darah dan wanginya adalah semerbak minyak kasturi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2804,
			"arabicnumber": 2804,
			"text": "Telah bercerita kepada kami [Yahya bin Bukair] telah bercerita kepada kami [Al Laits] berkata telah bercerita kepadaku [Yunus] dari [Ibnu Syihab] dari ['Ubaidullah bin 'Abdullah] bahwa ['Abdullah bin 'Abbas radliallahu 'anhu] pernah mengabarkannya [Abu Sufyan bin Harb] mengabarkannya bahwa Heraklius berkata kepadanya: \"Aku telah bertanya kepadamu bagaimana kesudahan peperangan antara kalian dengannya lalu kamu jawab bahwa peperangan yang terjadi bergantian saling mengalahkan. Begitulah adanya para rasul, dimana dia diuji kemudian akhirnya mereka mendapatkan kejayaan",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2806,
			"arabicnumber": 2806,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2807,
			"arabicnumber": 2807,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy]. Dan diriwayatkan pula, telah bercerita kepada kami [Isma'il] berkata telah bercerita kepadaku [saudaraku] dari [Sulaiman] yang dianggapnya dari [Muhammad bin Abi 'Atiq] dari [Ibnu Syihab] dari [Khorijah bin Zaid] bahwa [Zaid bin Tsabit radliallahu 'anhu] berkata; \"Aku menulis ayat ke dalam shuhuf lalu aku kehilangan satu ayat yang aku pernah dengar Rasulullah shallallahu 'alaihi wasallam membacanya. Kemudian aku tidak mendapatkannya kecuali ada pada Khuzaimah bin Tsabit, seorang shahabat yang persaksiannya dijadikan oleh Rasulullah shallallahu 'alaihi wasallam seperti persaksian dua orang. Ayat dimaksud adalah QS al-Ahzab 23 yang artinya (\"Dan diantara Kaum Mu'minin ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2808,
			"arabicnumber": 2808,
			"text": "Telah bercerita kepada kami [Muhammad bin 'Abdur Rohim] telah bercerita kepada kami [Syababah bin Sawwar Al Fazariy] telah bercerita kepada kami [Isra'il] dari [Abu Ishaq] berkata aku mendengar [Al Bara' radliallahu 'anhu] berkata; Ada seorang laki-laki bertopeng besi datang menemui Nabi shallallahu 'alaihi wasallam seraya berkata: \"Apakah aku berperang atau masuk Islam lebih dulu?\" Maka Beliau bersabda: \"Kamu masuk Islam dulu kemudian berperang\". Maka laki-laki itu masuk Islam lalu berperang hingga terbunuh. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang ini amalnya sedikit namun diberi pahala yang banyak",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2809,
			"arabicnumber": 2809,
			"text": "Telah bercerita kepada kami [Muhammad bin 'Abdullah] telah bercerita kepada kami [Husain bin Muhammad Abu Ahmad] telah bercerita kepada kami [Syaiban] dari [Qatadah] telah bercerita kepada kami [Anas bin Malik] bahwa Ummu Ar-Rubbai' binti Al Bara', dia adalah ibunya Haritsah bin Suraqoh datang menemui Nabi shallallahu 'alaihi wasallam lalu berkata: \"Wahai Nabi Allah, tolong katakan kepadaku tentang Haritsah yang terbunuh di perang badar karena terkena panah nyasar. Apabila dia berada di surga aku akan bersabar mererimanya namun bila selain itu aku akan menangisinya\". Beliau menjawab: \"Wahai Ummu Haritsah, sesungguhnya di surga ada taman-taman dan sungguh anakmu itu telah menempati surga Firdus yang paling tinggi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2810,
			"arabicnumber": 2810,
			"text": "Telah bercerita kepada kami [Sulaiman bin Harb] telah bercerita kepada kami [Syu'bah] dari ['Amru] dari [Abu Wa'il] dari [Abu Musa radliallahu 'anhu] berkata; Datang seorang laki-laki kepada Nabi shallallahu 'alaihi wasallam lalu berkata: \"Seseorang berperang untuk mendapatkan ghanimah, seseorang yang lain agar menjadi terkenal dan seseorang yang lain lagi untuk dilihat kedudukannya, manakah yang disebut fii sabilillah?\" Maka Beliau bersabda: \"Siapa yang berperang untuk meninggikan kalimat Allah dialah yang disebut fii sabilillah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2811,
			"arabicnumber": 2811,
			"text": "Telah bercerita kepada kami [Ishaq] telah mengabarkan kepada kami [Muhammad bin Al Mubarak] telah bercerita kepada kami [Yahya bin Hamzah] berkata telah bercerita kepadaku [Yazid bin Abi Maryam] telah mengabarkan kepada kami ['Abayah bin Rifa'ah bin Rofi' bin Khodij] berkata telah bercerita kepadaku [Abu 'Isa, dia adalah 'Abdur Rahman bin Jabr] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kedua kaki seorang hamba yang berdebu fi sabilillah tidak akan disentuh oleh api neraka",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2812,
			"arabicnumber": 2812,
			"text": "Telah bercerita kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami ['Abdul Wahhab] telah bercerita kepada kami [Khalid] dari ['Ikrimah] bahwa Ibnu 'Abbas berkata kepadanya dan kepada 'Ali bin 'Abdullah: 'Temuilah oleh kalian berdua [Abu Sa'id] dan dengarkan hadits yang disampaikannya\". Maka kami menemui dia ketika dia dan saudaranya sedang berada di kebun milik keduanya sedang meyiram tanaman. Ketika dia melihat kami dia segera menyambut lalu duduk kemudian berkata: \"Kami dahulu memasang batu ketika membangun masjid satu persatu. Sahabat 'Ammar mengangkat sekaligus dua batu dua batu. Kemudian Nabi shallallahu 'alaihi wasallam lewat di depannya lalu Beliau mengahapus debu yang ada di kepalanya seraya bersabda: \"Inilah 'Ammar, orang yang akan dibunuh oleh kelompok durjana. 'Ammar mengajak mereka kepada Allah sedang mereka mengajak 'Ammar ke neraka",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2813,
			"arabicnumber": 2813,
			"text": "Telah bercerita kepada kami [Muhammad bin Salam] telah mengabarkan kepada kami ['Abdah] dari [Hisyam bin 'Urwah] dari [bapaknya] dari ['Aisyah radliallahu 'anha] bahwa Rasulullah shallallahu 'alaihi wasallam ketika kembali dari peperangan Khandaq dan meletakkan senjata lalu mandi, Beliau didatangi oleh Malaikat Jibril dalam keadaan kepalanya dipenuhi dengan debu lalu berkata: \"Engkau telah meletakkan senjata? Sungguh, demi Allah, aku belum meletakkannya\". Maka Rasulullah shallallahu 'alaihi wasallam bertanya: \"Kemana lagi?\" Jibril berkata: \"Itu dia disana\". Sambil memberi isyarat ke kampung Bani Quraizhoh. Maka Rasulullah shallallahu 'alaihi wasallam pun keluar untuk menghadapi mereka",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2814,
			"arabicnumber": 2814,
			"text": "Telah bercerita kepada kami [Isma'il bin 'Abdullah] berkata telah bercerita kepadaku [Malik] dari [Ishaq bin 'Abdullah bin Abi Thalhah] dari [Anas bin Malik radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam berdo'a untuk mengutuk orang-orang yang membunuh para sahabat Bi'ru Ma'unah selama tiga puluh shubuh atas perkampungan mereka, suku Dzakwan dan 'Ushoyyah yang telah durhaka kepada Allah dan Rosul-Nya\". Anas berkata: \"Telah ditutunkan ayat dari Al Qur'an berkenaan dengan orang-orang yang telah dibunuh di Bi'ru Ma'unah dan kami telah membacanya namun kemudian dihapus setelah itu, yaitu berbunyi: (\"Sampaikanlah kepada kaum kami bahwa kami telah berjumpa dengan Robb kami Dia meridhai kami dan memberikan kebahagian kepada kami)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2815,
			"arabicnumber": 2815,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufyan] dari ['Amru] dia mendengar [Jabir bin 'Abdullah radliallahu 'anhuma] berkata: \"Orang-orang minum khomer pada awal siang di hari perang Uhud (sebelum khomer diharamkan) lalu mereka terbunuh sebagai syuhada', lalu dikatakan kepada Sufyan: \"Apakah mereka terbunuh pada sore hari di hari itu juga?\" Dia menjawab: \"Dalam hal ini tidak",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2816,
			"arabicnumber": 2816,
			"text": "Telah bercerita kepada kami [Shadaqah bin Al Fadhl] berkata telah mengabarkan kepada kami [Ibnu 'Uyainah] berkata aku mendengar [Muhammad bin Al Munkadir] bahwa dia mendengar [Jabir] berkata; \"Jasad bapakku yang telah tercabik-cabik dibawa kepada Nabi shallallahu 'alaihi wasallam lalu diletakkan di hadapan Beliau. Lalu aku pergi untuk menyingkap wajahnya namun kaumku melarangku, Kemudian aku mendengar suara teriakan, yang ternyata putrinya 'Amru atau saudara perempuan 'Amru. Maka Beliau berkata: \"Mengapa kamu menangis?\" atau: \"Janganlah kamu menangis. Sungguh para Malaikat senantiasa terus menaunginya dengan sayap-sayap mereka\". Aku bertanya kepada Shadaqah: \"Apakah selagi ada disitu hingga diangkat?\" Dia menjawab: Sepertinya seperti itu yang Beliau katakan",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2817,
			"arabicnumber": 2817,
			"text": "Telah bercerita kepada kami [Muhammad bin Basysyar] telah bercerita kepada kami [Ghundar] telah bercerita kepada kami [Syu'bah] berkata aku mendengar [Qatadah] berkata aku mendengar [Anas bin Malik radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak seorangpun yang masuk surga namun dia suka untuk kembali ke dunia, karena menurutnya di dunia tidak ada yang bernilai sedikit pun, kecuali orang yang mati syahid dimana dia berkeinginan untuk kembali ke dunia kemudian berperang lalu terbunuh hingga sepuluh kali karena dia melihat keistimewaan karamah (mati syahid)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2818,
			"arabicnumber": 2818,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Mu'awiyah bin 'Amru] telah bercerita kepada kami [Abu Ishaq] dari [Musa bin 'Uqbah] dari [Salim Abi An-Nadhar], mantan budak (yang telah dimerdekakan oleh) 'Umar bin 'Ubaidillah -dia adalah juru tulisnya- berkata; ['Abdullah bin Abi Aufaa radliallahu 'anhuma] menulis urat kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketahuilah oleh kalian bahwa surga itu berada dibawah naungan pedang\". Hadits ini ditelusuri pula oleh [Al Uwaisiy] dari [Ibnu Abu Az Zanad] dari [Musa bin 'Uqbah]",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2819,
			"arabicnumber": 2819,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2820,
			"arabicnumber": 2820,
			"text": "Telah bercerita kepada kami [Ahmad bin 'Abdullah bin Waqid] telah bercerita kepada kami [Hammad bin Zaid] dari [Tsabit] dari [Anas radliallahu 'anhu] berkata; Nabi shallallahu 'alaihi wasallam adalah orang yang paling baik, paling berani dan paling dermawan. Sungguh pernah terjadi gempa bumi menimpa penduduk Madinah dan Nabi shallallahu 'alaihi wasallam orang yang mendahului mereka (mencari sumber gempa) dengan menunggang kuda kemudian berkata: \"Kami temui (gempa itu) hanyalah lautan",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2821,
			"arabicnumber": 2821,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata telah bercerita kepadaku ['Umar bin Muhammad bin Jubair bin Muth'im] bahwa [Muhammad bin Jubair] berkata telah bercerita kepadaku [Jubair bin Muth'im] bahwa dia ketika berjalan bersama Rasulullah shallallahu 'alaihi wasallam beserta orang-orang dalam rambongan pasukan yang baru kembali dari Hunain, datang orang-orang menemui dan meminta kepada Beliau hingga menyudutkan Beliau ke pohon berduri sementara selendang (kain) Beliau terjatuh. Maka Nabi shallallahu 'alaihi wasallam tertahan lalu bersabda: \"Berikan selendangku (kainku). Seandainya aku memiliki banyak pohon berduri ini sebagai harta maka aku akan bagikan kepada kalian lalu kalian tidak akan mendapati aku sebagai orang yang pelit, dusta atau pengecut",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2822,
			"arabicnumber": 2822,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Abu 'Awanah] telah bercerita kepada kami ['Abdul Malik bin 'Umair] aku mendengar ['Amru bin Maimun Al Audiy] berkata; adalah [Sa'ad] biasa mengajarkan anak-anaknya kalimat-kalimat (bacaan do'a) sebagaimana seorang guru mengajarkan anak-anak kecil menulis dan berkata; \"Sesungghnya Rasulullah shallallahu 'alaihi wasallam berlindung dengan membaca kalimat-kalimat tersebut pada akhir shalat (yaitu): \"ALLAHUMMA INNII A'UUDZU BIKA MINAL JUBNI WA A'UUDZU BIKA AN URADDA ILAA ARDZALIL 'UMURI WA A'UDZU BIKA MIN FITNATID DUNYA WA A'UUDZU BIKA MIN 'ADZAABIL QOBRI\" (\"Ya Allah aku berlindung kepada-Mu dari sikap pengecut dan aku berlindung kepada-Mu dari dikembalikan kepada serendah-rendahnya usia (pikun) dan aku berlindung kepada-Mu dari fitnah dunia dan aku berlindung kepada-Mu dari siksa qubur\") Lalu aku ceritakan hal ini kepada [Mush'ab] dan dia membenarkannya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2823,
			"arabicnumber": 2823,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Mu'tamir] berkata aku mendengar [bapakku] berkata eku mendengar [Anas bin Malik radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam biasa berdo'a: \"ALLAAHUMMA INNII A'UUDZU BIKA MINAL 'AJZI WAL KASALI WAL JUBNI WAL HAROMI WA A'UUDZU BIKA MIN FITNATIL MAHYAA WAL MAMAAT WA A'UUDZU BIKA MIN 'ADZAABIL QOBRI\" (\"Ya Allah aku berlindung kepada-Mu dari sikap lemah, malas, pengecut dan kepikunan dan aku berlindung kepada-Mu dari fitnah kehidupan dan kematian dan aku berlindung kepada-Mu dari siksa qubur)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2824,
			"arabicnumber": 2824,
			"text": "Telah bercerita kepada kami [Qutaibah bin Sa'id] telah bercerita kepada kami [Hatim] dari [Muhammad bin Yusuf] dari [As-Sa'ib bin Yazid] berkata; Aku pernah bersahabat mendampingi [Thalhah bin 'Ubaidillah], Sa'ad, Al Miqdad bin Al Aswad dan 'Abdur Rahman bin 'Auf radliallahu 'anhum dan aku tidaklah mendengar seorangpun dari mereka yang bercerita dari Rasulullah shallallahu 'alaihi wasallam kecuali aku mendengar dari Thalhah yang bercerita tentang hari peperangan Uhud",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2825,
			"arabicnumber": 2825,
			"text": "Telah bercerita kepada kami ['Amru bin 'Ali] telah bercerita kepada kami [Yahya bin Sa'id] telah bercerita kepada kami [Sufyan] berkata telah bercerita kepadaku [Manshur] dari [Mujahid] dari [Thowus] dari [Ibnu 'Abbas radliallahu 'anhuma] bahwa Nabi shallallahu 'alaihi wasallam bersabda pada hari penaklukan kota Makkah: \"Tidak ada lagi hijrah setelah kemenangan (Makkah) akan tetapi yang tetap ada adalah jihad dan niat. Maka jika kalian diperintahkan berangkat berjihad, berangkatlah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2826,
			"arabicnumber": 2826,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah terawa terhadap dua orang dimana yang satu membunuh yang lainnya namun keduanya masuk surga. Yang satu berperang di jalan Allah hingga terbunuh. Kemudian Allah menerima taubat orang yang membunuhnya lalu diapun (berperang) hingga mati syahid",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2827,
			"arabicnumber": 2827,
			"text": "Telah bercerita kepada kami [Al Humaidiy] telah bercerita kepada kami [Sufyan] telah bercerita kepada kami [Az Zuhriy] berkata telah bercerita kepadaku ['Anbasah bin Sa'id] dari [Abu Hurairah radliallahu 'anhu] berkata: \"Aku menemui Rasulullah shallallahu 'alaihi wasallam saat Beliau berada di Khaibar setelah Kaum Muslimin menaklukannya. Aku berkata: 'Wahai Rasulullah, berilah aku bagian ghanimah\". Lalu sebagian Bani Said bin Ash berkata: \"Wahai Rasululloh, janganlah engkau beri bagian kepadanya\". Lalu Abu Hurairah berkata: \"Orang ini adalah pembunuh Ibnu Qouqol\". Lalu Ibnu Sa'id bin Al 'Ash berkata: \"Mengherankan sekali orang ini, tupai yang turun kepada kami dari Qodum Dho'ni (nama gunung tempat asal Abu Hurairah), mencelaku (menuduhku) atas terbunuhnya seorang muslim yang dimuliakan oleh Allah karena aku, sedangkan Dia tidak menghinakan aku di hadapannya (terbunuh sebagai seorang kafir) \". Ia (perawi) berkata: \"Aku tidak tahu apakah ia diberi bagian atau tidak. [Sufyan] berkata [As-Sa'idiy] bercerita kepadaku dari [kakeknya] dari [Abu Hurairah] berkata: Abu 'Abdullah as-Sa'idiy adalah 'Amru bin Yahya bin Sa'id bin 'Amru bin Sa'id bin Al 'Ash",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2828,
			"arabicnumber": 2828,
			"text": "Telah bercerita kepada kami [Adam] telah bercerita kepada kami [Syu'bah] telah bercerita kepada kami [Tsabit Al Bunaniy] berkata aku mendengar [Anas bin Malik radliallahu 'anhu] berkata; Abu Thalhah tidak pernah shoum (berpuasa) pada zaman Nabi shallallahu 'alaihi wasallam karena alasan berperang. Setelah Nabi shallallahu 'alaihi wasallam wafat tidak pernah aku melihat dia berbuka (tidak berpuasa) kecuali pada Hari Raya Fithri atau Hari Raya Adhha",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2829,
			"arabicnumber": 2829,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Sumayya] dari [Abu Shalih] dari [Abu Hurairah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Syuhada' (orang yang mati syahid) ada lima; yaitu orang yang terkena wabah penyakit Tha'un, orang yang terkena penyakit perut, orang yang tenggelam, orang yang tertimpa reruntuhan bangunan dan yang mati syahid di jalan Allah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2830,
			"arabicnumber": 2830,
			"text": "Telah bercerita kepada kami [Bisyir bin Muhammad] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami ['Ashim] dari [Hafsh binti Sirin] dari [Anas bin Malik radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Orang yang mati karena penyakit sampar adalah syahid bagi setiap muslim",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2831,
			"arabicnumber": 2831,
			"text": "Telah bercerita kepada kami [Abu Al Walid] telah bercerita kepada kami [Syu'bah] dari [Abu Ishaq] berkata aku mendengar [Al Bara' radliallahu 'anhu] berkata; Ketika turun ayat 97 Surah an-Nisaa' yang artinya (\"Tidaklah sama orang-orang yang duduk-duduk saja (tidak ikut berperang) dari kalangan Kaum Mu'minin…\"), Rasulullah shallallahu 'alaihi wasallam memanggil Zaid, maka dia datang dengan membawa papan tulis lalu dia menulis ayat itu. Kemudian Ummu Maktum datang mengadukan alasannya, maka turunlah ayat ini (\"Tidaklah sama orang-orang yang duduk-duduk saja (tidak ikut berperang) dari kalangan Kaum Mu'minin tanpa memiliki alasan…",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2832,
			"arabicnumber": 2832,
			"text": "Telah bercerita kepada kami ['Abdul 'Aziz bin 'Abdullah] telah bercerita kepada kami [Ibrahim bin Sa'ad Az Zuhriy] berkata telah bercerita kepadaku [Shalih bin Kaisan] dari [Ibnu Syihab] dari [Sahal bin Sa'ad As-Sa'idiy] bahwa dia berkata: \"Aku melihat [Marwan bin Al Hakam] sedang duduk di masjid lalu aku menemuinya hingga aku duduk di sampingnya lalu dia mengabarkan kepada kami bahwa [Zaid bin Tsabit] mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam membacakan ayat 97 Surah an-Nisaa' kepadanya yang artinya (\"Tidaklah sama orang-orang yang duduk-duduk saja (tidak ikut berperang) dari kalangan Kaum Mu'minin dengan orang-orang yang berjihad fii sabilillah…\"), maka datang Ibnu Ummu Maktum kepada Beliau padahal Beliau sedang membacakan ayat itu kepadaku dengan berkata: \"Wahai Rasulullah, seandainya aku mampu berjihad pasti aku akan berjihad\". Dia adalah seorang yang buta. Maka Allah Tabaaraka Wa Ta'ala menurunkan ayat kepada Rosul-Nya pada saat paha Beliau sedang berada diatas pahaku dan aku merasa berat dengan paha Beliau tersebut (karena beratnya wahyu yang Beliau terima) hingga aku khawatir pahaku retak. Kemudian Beliau tenang kembali. Maka Allah 'AZZA WAJALLA menurunkan firman-Nya (kelanjutan ayat tersebut) yang artinya: (\"Yang tanpa memiliki alasan…)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2833,
			"arabicnumber": 2833,
			"text": "Telah bercerita kepadaku ['Abdullah bin Muhammad] telah bercerita kepada kami [Mu'awiyah bin \"Amru] telah bercerita kepada kami [Abu Ishaq] dari [Musa bin 'Uqbah] dari [Salim Abu An-Nadhar] bahwa ['Abdullah bin Abi Aufaa] menulis surat lalu aku membacakannya yang isinya berupa bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian berjumpa dengan mereka (musuh) maka bershabarlah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2834,
			"arabicnumber": 2834,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Mu'awiyah bin 'Amru] telah bercerita kepada kami [Abu Ishaq] dari [Humaid] berkata aku mendengar [Anas radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam berangkat menuju Khandaq (parit) yang sedang digali oleh orang-orang Muhajirin dan Anshar di waktu pagi yang sangat dingin, sementara tidak ada hamba sahaya yang bekerja seperti itu untuk mereka. Ketika Beliau melihat apa yang dialami oleh mereka berupa kelelahan dan kelaparan, Beliau bersya'ir: \"Allahumma ya Allah, sesungguhnya kehidupan (yang sebenarnya) adalah kehidupan di akhirat. Maka itu ampunilah Kaum Anshor dan Muhajirin\". Maka para sahabat membalasnya dengan bersya'ir pula: \"Kami adalah orang-orang yang telah berbai'at kepada Muhammad. Untuk terus berjihad selagi kami hidup",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2835,
			"arabicnumber": 2835,
			"text": "Telah bercerita kepada kami [Abu Ma'mar] telah bercerita kepada kami ['Abdul Warits] telah bercerita kepada kami ['Abdul 'Aziz] dari [Anas radliallahu 'anhu] berkata; Sahabat Muhajirin dan Anshor menggali parit di sekitar Madinah dan mengangkut tanah bebatuan yang keras sambil bersya'ir: \"Kami adalah orang-orang yang telah berbai'at kepada Muhammad. Untuk (berjuang) demi Islam selagi kami hidup\". Lalu Nabi shallallahu 'alaihi wasallam menjawab sya'ir mereka dengan bersya'ir: \"Allahumma ya Allah, sesungguhnya tidak ada kebaikan melainkan kebaikan akhirat. Maka itu berkahilah Kaum Anshor dan Muhajirin",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2836,
			"arabicnumber": 2836,
			"text": "Telah bercerita kepada kami [Abu Al Walid] telah bercerita kepada kami [Syu'bah] dari [Abu Ishaq] aku mendengar [Al Bara' radliallahu 'anhu]: \"Adalah Nabi shallallahu 'alaihi wasallam turut mengangkut (tanah dalam penggalian parit pada perang Khandaq) sambil bersya'ir: \"Kalaulah bukan karena Engkau ya Allah, tentu kami tidak akan mendapat petunjuk",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2837,
			"arabicnumber": 2837,
			"text": "Telah bercerita kepada kami [Hafsh bin 'Amru] telah bercerita kepada kami [Syu'bah] dari [Abu Ishaq] dari [Al Bara' radliallahu 'anhu] berkata; Aku melihat Rasulullah shallallahu 'alaihi wasallam pada perang al-Ahzab mengangkut tanah bebatuan dimana tanah-tanah itu telah menutup perut Beliau yang putih sambil bersya'ir: \"Kalaulah bukan karena Engkau ya Allah, tentu kami tidak akan mendapat petunjuk, tidak pula menunaikan zakat dan mendirikan shalat\". Untuk itu turunkanlah sakinat (ketenangan) kepada kami, dan kuatkanlah kaki-kaki kami bila bertenu (musuh) \".\"Sesungguhnya orang-orang (itu) telah berbuat aniaya terhadap kami, jika mereka menghendaki fitnah, kami tidak pernah peduli (menyerah)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2838,
			"arabicnumber": 2838,
			"text": "Telah bercerita kepada kami [Ahmad bin Yunus] telah bercerita kepada kami [Zuhair] telah bercerita kepada kami [Humaid] bahwa [Anas] bercerita kepada mereka, katanya: \"Kami kembali dari perang Tabuk bersama Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2839,
			"arabicnumber": 2839,
			"text": "Telah bercerita kepada kami [Sulaiman bin Harb] telah bercerita kepada kami [Hammad, dia adalah putranya Zaid] dari [Humaid] dari [Anas radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam dalam suatu peperangan pernah bersabda: \"Sesungguhnya ada kaum yang berada di Madinah tidak ikut berperang bersama kita, tidaklah kita mendaki bukit, tidak pula menyusuri lembah melaikan mereka bersama kita (dalam mendapat) pahala berperang karena mereka tertahan oleh udzur (alasan) yang benar\". Dan berkata [Musa] telah bercerita kepada kami [Hammad] dari [Humaid] dari [Musa bin Anas] dari [bapaknya] Nabi shallallahu 'alaihi wasallam bersabda. Berkata Abu 'Abdullah Al Bukhariy; \"(Sanad) yang pertama lebih benar",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2840,
			"arabicnumber": 2840,
			"text": "Telah bercerita kepada kami [Ishaq bin Nashr] telah bercerita kepada kami ['Abdur Rozzaq] telah mengabarkan kepada kami [Ibnu Juraij] berkata telah bercerita kepadaku [Yahya Sa'id] dan [Suhail bin Abi Shalih] bahwa keduanya mendengar [an Nu'man bin Abi 'Ayyasy] dari [Abu Sa'id Al Khudriy radliallahu 'anhu] berkata; Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda; \"Barang siapa yang shoum (berpuasa) satu hari di jalan Allah, maka Allah akan menjauhkan wajahnya dari neraka sejauh tujuh puluh musim",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2841,
			"arabicnumber": 2841,
			"text": "Telah bercerita kepadaku [Sa'ad bin Hafsh] telah bercerita kepada kami [Syaiban] dari [Yahya] dari [Abu Salamah] bahwa dia mendengar [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang menginfaqkan sepasang sesuatu di jalan Allah, maka penjaga surga akan memanggilnya, dimana setiap pintu ada penjaganya, yaitu dengan berkata: \"Kemarilah\". Abu Bakar berkata: \"Wahai Rasulullah, itulah orang yang tidak akan rugi dan sengsara\". Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Aku berharap kamu termasuk diantara mereka",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2842,
			"arabicnumber": 2842,
			"text": "Telah bercerita kepada kami [Muhammad bin Sinan] telah bercerita kepada kami [Fulaih] telah bercerita kepada kami [Hilal] dari ['Atha' bin Yasar] dari [Abu Sa'id Al Khudriy radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam berdiri di atas mimbar lalu bersabda: \"Sungguh yang aku khawatirkan atas kalian sepeninggalku adalah bila dibukakan kepada kalian keberkahan bumi\". Maka Beliau menyebut bunga-bunga dunia yang dimulai dengan yang pertama lalu dilanjutkan dengan yang lainnya. Lalu ada seorang yang berdiri seraya berkata: \"Wahai Rasulullah, apakah kebaikan akan datang membawa keburukan?\" Maka Nabi shallallahu 'alaihi wasallam terdiam atas pertanyaan orang itu. Kami berkata: \"Beliau sedang mendapat wahyu\". Maka orang-orang terdiam seolah di atas kepala mereka ada burung yang bertengger. Kemudian Beliau mengusap wajahnya yang penuh dengan keringat lalu bertanya: \"Mana orang yang bertanya tadi? Apakah kebaikan itu?\" Beliau bertanya tiga kali.\"Sesungguhnya kebaikan itu tidak akan datang kecuali (dengan membawa) kebaikan. Sesungguhnya apa yang ditumbuhkan pada musim semi dapat membinasakan atau dapat mendekatkan kepada kematian kecuali seperti ternak pemakan dedaunan hijau yang apabila sudah kenyang dia akan memandang matahari lalu mencret kemudian kencing lalu dia kembali merumput (makan lagi). Dan sungguh harta itu seperti dedaunan hijau yang manis. Maka beruntunglah seorang muslim yang dia mendapatkan harta dengan haq dan dengan hartanya itu dia nafkahkan di jalan Allah, anak-anak yatim, orang-orang miskin, dan ibnu sabil (musafir yang kehabisan bekal). Dan barangsiapa yang mengambil harta dunia tanpa hak ia seperti orang yang memakan namun tidak pernah kenyang dan harta itu akan menjadi saksi baginya pada hari qiyamat",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2843,
			"arabicnumber": 2843,
			"text": "Telah bercerita kepada kami [Abu Ma'mar] telah bercerita kepada kami ['Abdul Warits] telah bercerita kepada kami [Al Husain] berkata telah bercerita kepadaku [Yahya] berkata telah bercerita kepadaku [Abu Salamah] berkata telah bercerita kapadaku [Busr bin Sa'id] berkata telah bercerita kapadaku [Zaid bin Khalid radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang mempersiapkan (bekal) orang yang berperang di jalan Allah berarti dia telah berperang (mendapat pahala berperang). Dan barang siapa yang menjaga (menanggung urusan rumah) orang yang berperang di jalan Allah dengan baik berarti dia telah berperang",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2844,
			"arabicnumber": 2844,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Hammam] dari [Ishaq bin 'Abdullah] dari [Anas radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam tidak pernah memasuki rumah di Madinah selain rumah Ummu Sulaim kecuali rumah istri-istri Beliau. Lalu ditanyakan kepada Beliau tentang hal ini, maka Beliau menjawab: \"Sungguh aku berbelas kasihan kepadanya karena saudaranya terbunuh di sisiku",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2845,
			"arabicnumber": 2845,
			"text": "Telah bercerita kepada kami ['Abdullah bin 'Abdul Wahhab] telah bercerita kepada kami [Khalid bin Al Harits] telah bercerita kepada kami [Ibnu 'Aun] dari [Musa bin Anas] berkata, lalu dia bercerita tentang peperangan Yamamah, katanya; [Anas] menemui [Tsabit bin Qais] dimana kedua pahanya terbuka ketika dia sedang mengoleskan wewangian. Lalu Anas bertanya kepadanya: \"Wahai paman, apakah yang menghalangimu sehingga kamu tidak datang (pada peperangan)? ' Pamannya berkata: \"wahai kemenakanku aku baru saja datang\", lalu dia melumuri tubuhnya dengan hanuth (minyak wangi yang biasa dioleskan kepada mayyit) kemudian masuk dalam barisan, setelah itu Anas bercerita bahwa orang-orang melarikan diri dari pertempuran, maka Tsabit bin Qais berkata\" begitu? menyingkirlah, lapangkan jalanku hingga dapat menyerang musuh, bersama Rasulullah shallallahu 'alaihi wasallam kami tidak pernah seperti ini (lari dari musuh) alangkah buruknya perilaku yang kalian ambil dari musuh\". Diriwayatkan oleh [Hammad] dari [Tsabit] dari [Anas]",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2846,
			"arabicnumber": 2846,
			"text": "Telah bercerita kepada kami [Abu Nu'aim] telah bercerita kepada kami [Sufyan] dari [Muhammad bin Al Munkadir] dari [Jabir radliallahu 'anhu] berkata, Nabi shallallahu 'alaihi wasallam bersabda: \"Siapakah yang sanggup membawa informasi tentang keadaan kaum (musuh) perang Al Ahzab kepadaku?\" Az Zubair berkata: \"Aku\". Kemudian Beliau berkata lagi: \"Siapakah yang sanggup membawa informasi tentang musuh kepadaku?\" Az Zubair berkata lagi: \"Aku\". Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya setiap Nabi memiliki Hawariy (pembela yang setia), dan hawariyku adalah Az Zubair",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2847,
			"arabicnumber": 2847,
			"text": "Telah bercerita kepada kami [Shadaqah] telah mengabarkan kepada kami [Ibnu 'Uyainah] telah bercerita kepada kami [Ibnu Al Munkadir] bahwa dia mendengar [Jabir bin 'Abdullah radliallahu 'anhuma] berkata: Nabi shallallahu 'alaihi wasallam menawarkan kepada orang-orang (untuk mencari info tentang musuh). Shadaqah berkata: \"Aku kira kejadiannya saat perang Al Ahzab\". Maka Az Zubair menyanggupinya. Kemudian Beliau kembali menawarkan kepada orang-orang dan kembali Az Zubair yang menyanggupinya. Kemudian Beliau kembali menawarkan kepada orang-orang dan lagi-lagi hanya Az Zubair yang menanggupinya. Maka kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya setiap Nabi memiliki Hawariy (pembela yang setia), dan hawariyku adalah Az Zubair bin Al 'Awwam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2848,
			"arabicnumber": 2848,
			"text": "Telah bercerita kepada kami [Ahmad bin Yunus] telah bercerita kepada kami [Abu Syihab] dari [Khalid Al Hadzdza'] dari [Abu Qilabah] dari [Malik bin Al Huwairits] berkata; Aku berpamitan pulang kepada Nabi shallallahu 'alaihi wasallam lalu Beliau bersabda kepada kami, aku dan sahabatku: \"Adzanlah lalu qomat dan hendaklah yang menjadi imam siapa yang paling tua usianya diantara kalian berdua",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2849,
			"arabicnumber": 2849,
			"text": "Telah bercerita kepada kami ['Abdullah bin Maslamah] telah bercerita kepada kami [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar radliallahu 'anhuma] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Seekor kuda (yang digunakan untuk fii sabilillah), pada ubun-ubunnya akan terus ada (mendatangkan) kebaikan hingga hari qiyamat",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2850,
			"arabicnumber": 2850,
			"text": "Telah bercerita kepada kami [Hafsh bin 'Umar] telah bercerita kepada kami [Syu'bah] dari [Hushain] dan [Ibnu Abi As-Safar] dari [Asy-Sya'biy] dari ['Urwah bin Al Ja'di] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Seekor kuda (yang digunakan untuk fii sabilillah) terikat pada ubun-ubunnya kebaikan hingga hari qiyamat\". [Sulaiman] berkata dari [Syu'bah] dari ['Urwah bin Abi Al Ja'di]. Hadits ini ditelusuri pula oleh [Musaddad] dari [Husyaim] dari [Hushain] dari [Asy-Sya'biy] dari ['Urwah bin Al Ja'di]",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2851,
			"arabicnumber": 2851,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Yahya] dari [Syu'bah] dari [Abu At-Tayah] dari [Anas bin Malik radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Keberkahan selalu ada pada ubun-ubun kuda (yang digunakan untuk fii sabilillah)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2852,
			"arabicnumber": 2852,
			"text": "Telah bercerita kepada kami [Abu Nu'aim] telah bercerita kepada kami [Zakariya'] dari ['Amir] telah bercerita kepada kami ['Urwah Al Bariqiy] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Seekor kuda (yang digunakan untuk fii sabilillah) terikat pada ubun-ubunnya kebaikan hingga hari qiyamat, berupa kebaikan pahala dan ghonimah (harta rampasan perang)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2853,
			"arabicnumber": 2853,
			"text": "Telah bercerita kepada kami ['Ali bin Hafsh] telah bercerita kepada kami [Ibnu Al Mubarak] telah mengabarkan kepada kami [Thalhah bin Abi Sa'id] berkata aku mendengar [Sa'id Al Maqburiy] bercerita bahwa dia mendengar [Abu Hurairah radliallahu 'anhu] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang memelihara seekor kuda untuk fii sabilillah karena iman kepada Allah dan membenarkan janji-Nya maka sesungguhnya setiap makanan kuda itu, minumannya, kotorannya dan kencingnya akan menjadi timbangan (kebaikan) baginya pada hari qiyamat",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2854,
			"arabicnumber": 2854,
			"text": "Telah bercerita kepada kami [Muhammad bin Abu Bakar] telah bercerita kepada kami [Fudhail bin Sulaiman] dari [Abu Hazim] dari ['Abdullah bin Abu Qatadah] dari [bapaknya] bahwa dia pernah keluar bepergian bersama Nabi shallallahu 'alaihi wasallam lalu Abu Qatadah tertinggal bersama dengan sebagian sahabat yang sudah berihram sedangkan dia tidak berihram. Lalu mereka melihat seekor keledai liar sebelum dia melihatnya. Ketika mereka melihat keledai tersebut maka mereka meninggalkan Abu Qatadah hingga ketika dia melihatnya dia segera saja menunggang kuda miliknya yang dinamakan al-Jaradah. Lalu dia meminta agar mereka melemparkan tombaknya kepadanya namun mereka tidak mau. Akhirnya dia sendiri mengambil tombaknya lalu dibawanya hingga dia dapat menyembelih (dengan cara menikam) keledai tersebut. Kemudian dia memakannya dan mereka pun ikut memakannya namun kemudian mereka menyesal. Setelah mereka bertemu dengan Beliau shallallahu 'alaihi wasallam, Beliau bertanya: \"Apakah kalian masih punya sisa darinya\". Dia berkata: \"Masih ada pada kami kakinya\". Maka Nabi shallallahu 'alaihi wasallam mengambil lalu memakannya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2855,
			"arabicnumber": 2855,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah bin Ja'far] telah bercerita kepada kami [Ma'an bin 'Isa] telah bercerita kepada kami [Ubay bin 'Abbas bin Sahal] dari [bapaknya] dari [kakeknya] berkata: \"Dahulu Nabi shallallahu 'alaihi wasallam memiliki kuda yang berada di kebun kami yang diberi nama Al Luhaif\". Berkata Abu 'Abdullah Al Bukhariy: Dan sebagian mereka menamakannya Al Lukhoif",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2856,
			"arabicnumber": 2856,
			"text": "Telah bercerita kepadaku [Ishaq bin Ibrahim] dia mendengar [Yahya bin Adam] telah bercerita kepada kami [Abu Al Ahwash] dari [Abu Ishaq] dari ['Amru bin Maimun] dari [Mu'adz radliallahu 'anhu] berkata: \"Aku pernah membonceng di belakang Nabi shallallahu 'alaihi wasallam diatas seekor keledai yang diberi nama 'Uqoir lalu Beliau bertanya: \"Wahai Mu'adz, tahukah kamu apa hak Allah atas para hamba-Nya dan apa hak para hamba atas Allah?\" Aku jawab: \"Allah dan Rosul-Nya yang lebih tahu\". Beliau bersabda: \"Sesungguhnya hak Allah atas para hamba-Nya adalah hendankah beribadah kepada-Nya dan tidak menyekutukan-Nya dengan sesuatu apapun dan hak para hamba-Nya atas Allah adalah seorang hamba tidak akan disiksa selama dia tidak menyekutukan-Nya dengan sesuatu apapun\". Lalu aku berkata: \"Wahai Rasulullah, apakah boleh aku menyampaikan kabar gembira ini kepada manusia?\" Beliau menjawab: \"Jangan kamu beritahukan mereka sebab nanti mereka akan berpasrah saja",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2857,
			"arabicnumber": 2857,
			"text": "Telah bercerita kepada kami [Muhammad bin Basysyar] telah bercerita kepada kami [Ghundar] telah bercerita kepada kami [Syu'bah] aku mendengar [Qatadah] dari [Anas bin Malik radliallahu 'anhu] berkata; Pernah terjadi gempa bumi menimpa penduduk Madinah kemudian Nabi shallallahu 'alaihi wasallam meminjam kuda kami yang dinamakan Mandub lalu Beliau berkata: \"Kami tidak mendapatkan gempa itu namun yang kami temui hanyalah lautan",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2858,
			"arabicnumber": 2858,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata telah bercerita kepadaku [Salim bin 'Abdullah] bahwa [Abdullah bin 'Umar radliallahu 'anhuma] berkata aku mendengar Nabi shallallahu 'alaihi wasallam bersabda; \"Sesungguhnya kesialan ada pada tiga hal, pada kuda, wanita dan tempat tinggal",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2859,
			"arabicnumber": 2859,
			"text": "Telah bercerita kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Abu Hazim bin Dinar] dari [Sahal bin Sa'ad as-Sa'idiy radliallahu 'anhu] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalau ada kesialan pada sesuatu, maka ada pada wanita, kuda dan tempat tinggal",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2860,
			"arabicnumber": 2860,
			"text": "Telah bercerita kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Zaid bin Aslam] dari [Abu Shalih As-Samman] dari [Abu Hurairah radliallahu 'anhu] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kuda itu ada tiga jenis. Yang pertama kuda yang bagi seorang pemiliknya menjadi pahala, yang kedua menjadi sarana untuk memenuhi kebutuhan dan yang ketiga mendatangkan dosa. Adapun orang yang mendapatkan pahala adalah orang yang menambat kudanya untuk kepentingan fii sabilillah dimana dia mengikatnya di ladang hijau penuh rerumputan atau taman. Apa saja yang didapatkan kuda itu selama berada dalam pengembalaan di ladang penuh rerumputan hijau atau taman maka semua akan menjadi kebaikan bagi orang itu. Seandainya talinya putus lalu kuda itu berlari sekali atau dua kali maka jejak-jejak dan kotorannya akan menjadi kebaikan bagi pemiliknya. Dan seandainya kuda itu melewati sungai lalu minum darinya sedangkan dia tidak hendak memberinya minum maka semua itu baginya adalah kebaikan. Yang kedua adalah seseorang yang menambatkan kudanya dengan kesombongan, pamer dan permusuhan terhadap Kaum Muslimin maka baginya adalah dosa disebabkan perbuatannya itu\". Dan Rasulullah shallallahu 'alaihi wasallam ditanya tentang keledai, maka Beliau menjawab: \"Tidak ada wahyu yang diturunkan kepadaku tentang itu kecuali ayat 7 - 8 Surah Al Zalzalah, yang mencakup banyak faedah (yang artinya): (\"Maka barangsiapa yang beramal kebaikan seberat biji sawi maka dia akan melihat balasannya dan barang siapa yang beramal keburukan seberat biji sawi maka dia akan melihat balasannya)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2861,
			"arabicnumber": 2861,
			"text": "Telah bercerita kepada kami [Muslim] telah bercerita kepada kami [Abu 'Aqil] telah bercerita kepada kami [Abu Al Mutawakkil An-Najiy] berkata; Aku menemui [Jabir bin 'Abdullah Al Anshoriy] lalu aku katakan kepadanya: \"Ceritakanlah kepadaku apa yang kamu dengar dari Rasulullah shallallahu 'alaihi wasallam\". Dia berkata: \"Aku pernah bepergian bersama Beliau dalam suatu perjalanan safar yang Beliau lakukan\". Abu 'Aqil berkata: \"Aku tidak tahu apakah perjalanan untuk peperangan atau 'umrah\".\"Setelah kami hampir akan kembali, Nabi shallallahu 'alaihi wasallam bersabda: \"Siapa yang ingin bersegera menemui keluarganya silakan\". Jabir berkata: \"Maka kami kembali dimana aku mengendarai untaku yang warnanya merah kehitaman dan sangat lambat. Sementara itu orang-orang ada di belakangku. Ketika dalam keadaan seperti itu, tiba-tiba Nabi shallallahu 'alaihi wasallam menghampiriku dan bersabda kepadaku: \"Wahai Jabir, berhentilah sebentar\". Lalu Beliau mecambuk untaku dengan cemeti sekali cambuk, hingga untaku melompat dari posisinya. Kemudian Beliau berkata: \"Apakah kamu akan menjual unta ini?\" Aku jawab: \"Iya\". Setelah kami sampai di Madinah dan Nabi shallallahu 'alaihi wasallam memasuki masjid di tengah-tengah kerumunan para sahabat dan akupun masuk mengikuti Beliau dan aku telah mengikat unta di tempat penambatannya maka aku berkata kepada Beliau: \"Ini unta Tuan\". Maka Beliau keluar lalu menuntun unta itu seraya berkata: \"Unta ini adalah unta kita\". Lalu Beliau mengirim beberapa awaq (mata uang) berupa emas dan berkata: \"Berikan emas ini kepada Jabir\". Kemudian Beliau berkata: \"Apakah kamu sudah menerima uang penjualannya? Aku katakan: 'Ya, sudah\". Lalu Beliau berkata: \"Uang itu dan unta buat kamu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2862,
			"arabicnumber": 2862,
			"text": "Telah bercerita kepada kami [Ahmad bin Muhammad] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Syu'bah] dari [Qatadah] aku mendengar [Anas bin Malik radliallahu 'anhu] berkata; Pernah terjadi gempa bumi di Madinah kemudian Nabi shallallahu 'alaihi wasallam meminjam kuda milik Abu Thalhah yang dinamakan Mandub lalu mengendarainya kemudian (setelah kembali), Beliau berkata: \"Kami tidak mendapatkan gempa itu namun yang kami temui hanyalah lautan",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2863,
			"arabicnumber": 2863,
			"text": "Telah bercerita kepada kami ['Ubaid bin Isma'il] dari [Abu Usamah] dari ['Ubaidillah] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] bahwa Rasulullah shallallahu 'alaihi wasallam menjadikan dua saham (bagian kebaikan) untuk kuda dan satu saham untuk pemiliknya. Dan berkata Malik: Diberi bagian bagi kuda dan kuda Turki berdasarkan firman Allah SUBHANAHU WATA'ALA yang artinya (\"Dan kuda, baghol dan keledai untuk dikendarai\".\"Dan tidak ada yang diberikan bagian lebih selain kuda)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2864,
			"arabicnumber": 2864,
			"text": "Telah bercerita kepada kami [Qutaibah] telah bercerita kepada kami [Sahal bin Yusuf] dari [Syu'bah] dari [Abu Ishaq], Ada seorang laki-laki berkata kepada [Al Bara' bin 'Azib radliallahu 'anhuma]: \"Apakah kalian kabur dari Rasulullah shallallahu 'alaihi wasallam pada peperangan Hunain?\" Dia berkata: \"Tetapi Rasulullah shallallahu 'alaihi wasallam tidaklah kabur\". Sesungguhnya Hawazin adalah suatu kaum yang ahli memanah dan kami ketika bertemu dengan mereka kami mampu meladeni mereka dan mereka kalah, namun kaum muslimin mulai serius dengan ghanimah mereka menghujani kami dengan anak panah, sementara Rasulullah shallallahu 'alaihi wasallam tidaklah kabur. Sungguh aku melihat Beliau tetap diatas baghol (peranakan antara kuda dengan keledai) Beliau yang berwarna putih sementara Abu Sufyan menuntun baghol tersebut dan Nabi shallallahu 'alaihi wasallam bersabda: \"Aku adalah seorang Nabi yang tidak berdusta dan aku adalah anak dari 'Abdul Muthallib",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2865,
			"arabicnumber": 2865,
			"text": "Telah bercerita kepadaku ['Ubaid bin Isma'il] dari [Abu Usamah] dari ['Ubaidillah] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam bahwa apabila Beliau memasukkan kakinya kedalam pijakan pelana sementara unta Beliau telah siap berdiri, maka Beliau bertalbiyah dari masjid Dzul Hulaifah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2866,
			"arabicnumber": 2866,
			"text": "Telah bercerita kepada kami ['Amru bin 'Aun] telah bercerita kepada kami [Hammad] dari [Tsabit] dari [Anas radliallahu 'anhu]; Nabi shallallahu 'alaihi wasallam datang menemui mereka dengan menunggang kuda yang tidak berpelana dan di lehernya ada sebilah pedang",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2867,
			"arabicnumber": 2867,
			"text": "Telah bercerita kepada kami ['Abdul A'laa bin Hammad] telah bercerita kepada kami [Yazid bin Zurai'] telah bercerita kepada kami [Sa'id] dari [Qatadah] dari [Anas bin Malik radliallahu 'anhu] bahwa penduduk Madinah pernah mengalami gempa bumi sesekali, lalu Nabi shallallahu 'alaihi wasallam menunggang kuda milik Abu Thalhah yang jalannya lamban atau padanya ada kelambanan. Maka tatkala kembali Beliau bersabda: \"Kami dapatkan kuda kalian ini sangat cepat. Setelah itu kuda itu tidak lagi dapat dikalahkan larinya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2868,
			"arabicnumber": 2868,
			"text": "Telah bercerita kepada kami [Qabishah] telah bercerita kepada kami [Sufyan] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] berkata; Nabi shallallahu 'alaihi wasallam memacu kuda pacuan dari Al Hafya' hingga Tsaniyatul Wada' dan memacu kuda yang bukan kuda pacuan dari Tsaniyatul Wada' hingga masjid Bani Zurai'. Ibnu 'Umar radliallahu 'anhuma: \"Aku termasuk orang yang ikut dalam pacuan kuda itu\". Berkata ['Abdullah] telah bercerita kepada kami [Sufyan] berkata telah bercerita kepadaku ['Ubaidullah], berkata [Sufyan]: \"Jarak antara Al Hafya' ke Tsaniyatul Wada' antara lima atau enam mil sedangkan jarak antara Tsaniyatul Wada' ke masjid Bani Zurai' satu mil",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2869,
			"arabicnumber": 2869,
			"text": "Telah bercerita kepada kami [Ahmad bin Yunus] telah bercerita kepada kami [Al Laits] dari [Nafi'] dari ['Abdullah radliallahu 'anhuma] bahwa Rasulullah shallallahu 'alaihi wasallam berlomba pacuan kuda dengan kuda yang tidak disiapkan sebagai kuda pacuan yang jaraknya antara Tsaniyatul Wada' sampai ke masjid Bani Zurai'. Dan 'Abdullah bin 'Umar radliallahu 'anhuma termasuk orang yang ikut dalam pacuan tersebut. Abu 'Abdullah Al Bukhariy berkata: \"amadan artinya ghooyatan (batas akhir) \", seperti firman Allah QS al-Hadid ayat 16 yang artinya: (\"Maka berlalulah masa yang panjang atas mereka)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2870,
			"arabicnumber": 2870,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Mu'awiyah] telah bercerita kepada kami [Abu Ishaq] dari [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] berkata; Rasulullah shallallahu 'alaihi wasallam berlomba pacuan kuda dengan kuda yang disiapkan sebagai kuda pacuan dimana Beliau melepasnya dari al-Hafya' dan batas akhirnya di Tsaniyatul Wada'. Aku bertanya kepada Musa: \"Berapa jaraknya? ' Dia berkata: \"Antara enam atau tujuh mil. Dan Beliau juga berlomba pacuan dengan kuda yang bukan kuda pacuan dari Tsaniyatul Wada' sampai batas akhirnya di masjid Bani Zurai'. Aku bertanya: \"Berapa jaraknya? ' Dia berkata: \"Satu mil atau sekitar itu\". Dan Ibnu 'Umar radliallahu 'anhuma adalah termasuk orang yang ikut dalam pacuan kuda itu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2871,
			"arabicnumber": 2871,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Mu'awiyah] telah bercerita kepada kami [Abu Ishaq] dari [Humaid] berkata aku mendengar [Anas radliallahu 'anhu] berkata: \"Unta Nabi shallallahu 'alaihi wasallam dipanggil dengan al-'Adhbaa",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2872,
			"arabicnumber": 2872,
			"text": "Telah bercerita kepada kami [Malik bin Isma'il] telah bercerita kepada kami [Zuhair] dari [Humaid] dari [Anas radliallahu 'anhu] berkata: \"Nabi shallallahu 'alaihi wasallam memiliki unta yang dinamakan dengan Al 'Adhbaa' yang tidak terkalahkan. Berkata Humaid: \"Atau tidak pernah terkalahkan\". Kemudian datang seorang Arab Baduy dengan menunggang unta lalu mengalahkan unta Beliau. Kejadian ini menggusarkan KaumMuslimin hingga Beliau mengerti benar apa yang sedang terjadi. Maka kemudian Beliau bersabda: \"Sudah menjadi kemestian bagi Allah dimana tidak ada sesuatu yang tinggi dalam perkara dunia melainkan Dia pasti akan merendahkannya\". [Musa] meriwayatkannya dengan panjang lebar dari [Hammad] dari [Tsabit] dari [Anas] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2873,
			"arabicnumber": 2873,
			"text": "Telah bercerita kepada kami ['Amru bin 'Ali] telah bercerita kepada kami [Yahya] telah bercerita kepada kami [Sufyan] berkata telah bercerita kepadaku [Abu Ishaq] berkata; Aku mendengar ['Amru bin Al Harits] berkata: \"Tidaklah Nabi shallallahu 'alaihi wasallam meninggalkan sesuatupun (saat wafat) kecuali baghol Beliau yang berwarna putih, senjata dan sebidang tanah yang semuanya dijadikan sebagai shadaqah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2874,
			"arabicnumber": 2874,
			"text": "Telah bercerita kepada kami [Muhammad bin Al Mutsannaa] telah bercerita kepada kami [Yahya bin Sa'id] dari [Sufyan] berkata telah bercerita kepadaku [Abu Ishaq] dari [Al Bara' radliallahu 'anhu]; Ada seorang laki-laki yang berkata kepadanya: \"Wahai Abu 'Umarah, apakah kalian kabur pada peperangan Hunain?\" Dia berkata: \"Tidak, demi Allah. Tidaklah Nabi shallallahu 'alaihi wasallam kabur dari perang akan tetapi yang kabur adalah orang-orang yang tergesa-gesa, dimana suku Hawazin menghadang mereka dengan panah-panah mereka sedangkan Nabi shallallahu 'alaihi wasallam tetap diatas baghol Beliau yang berwarna putih sementara Abu Sufyan menuntun baghol tersebut dan Nabi shallallahu 'alaihi wasallam bersya'ir: \"Aku adalah seorang Nabi yang tidak berdusta dan aku adalah anak dari 'Abdul Muthallib",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2875,
			"arabicnumber": 2875,
			"text": "Telah bercerita kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Mu'awiyah bin Ishaq] dari ['Aisyah binti Thalhah] dari ['Aisyah, ummul mu'minin radliallahu 'anha] berkata: \"Aku meminta izin kepada Nabi shallallahu 'alaihi wasallam untuk berjihad, maka Beliau bersabda: \"Jihad kalian adalah haji\". Dan ['Abdullah bin Al Walid] berkata telah bercerita kepada kami [Sufyan] dari [Mu'awiyah] dengan hadits seperti ini",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2876,
			"arabicnumber": 2876,
			"text": "Telah bercerita kepada kami [Qabishah] telah bercerita kepada kami [Sufyan] dari [Mu'awiyah] dengan hadits seperti ini. Dan dari [Habib bin Abi 'Amrah] dari ['Aisyah binti Thalhah] dari ['Aisyah, ummul mu'minin radliallahu 'anha] dari Nabi shallallahu 'alaihi wasallam bahwa para istri Beliau bertanya kepada Beliau tentang jihad, maka Beliau bersabda: \"sebaik-baik jihad (bagi kaum wanita) adalah hajii",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2877,
			"arabicnumber": 2877,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Mu'awiyah bin 'Amru] telah bercerita kepada kami [Abu Ishaq, dia adalah Al Fazariy] dari ['Abdullah bin 'Abdur Rahman Al Anshoriy] berkata aku mendengar [Anas radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam masuk ke rumah putri dari Milhan kemudian Beliau berbaring disisinya lalu tertawa. Maka putri Milhan bertanya: \"Apa yang membuat Tuan tertawa, wahai Rasulullah?\" Maka Beliau berkata: \"Ada orang-orang dari umatku dimana mereka sebagai pasukan di jalan Allah yang mengarungi lautan yang hijau bagaikan raja-raja di atas singgasana\". Lalu dia berkata: \"Wahai Rasulullah, berdo'alah kepada Allah agar Dia menjadikan aku termasuk dari mereka\". Maka Beliau berdo'a: \"Ya Allah jadikanlah dia termasuk diantara mereka\". Kemudian Beliau berbaring lagi lalu tertawa kembali. Lalu dia bertanya seperti tadi atau bertanya mengapa Beliau tertawa. Maka Beliau menjelaskan seperti itu pula. Maka dia kembali berkata: \"Berdo'alah kepada Allah agar Dia menjadikan aku termasuk dari mereka\". Maka Beliau berdo'a: \"Ya Allah jadikanlah dia termasuk diantara mereka\". Beliau selanjutnya bersabda: \"Kamu akan menjadi orang-orang yang pertama dan bukan yang terakhir\". Perawi berkata; Anas berkata: \"Kemudian wanita tadi menikah dengan 'Ubadah bin Ash-Shomit lalu di kemudian hari dia mengarungi lautan bersama Binti Qarazhoh. Ketika kembali ke daratan dia menunggang hewan tunggangannya lalu hewan itu membantingnya hingga dia terjatuh lalu meninggal dunia",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2879,
			"arabicnumber": 2879,
			"text": "Telah bercerita kepada kami [Hajjaj bin Minhal] telah bercerita kepada kami ['Abdullah bin 'Umar An-Numairiy] telah bercerita kepada kami [Yunus] berkata aku mendengar [Az Zuhriy] berkata aku mendengar ['Urwah bin Az Zubair], [Sa'id bin Al Musayyab], ['Alqomah bin Waqosh] dan ['Ubaidullah bin 'Abdullah] tentang peristiwa yang terjadi pada diri ['Aisyah] radliallahu 'anha dimana setiap orang dari mereka bercerita kepadaku bagian-bagian hadits, 'Aisyah radliallahu 'anha berkata: \"Adalah Nabi shallallahu 'alaihi wasallam bila hendak bepergian Beliau melakukan undian di antara istri-istri Beliau, dan siapa yang namanya keluar berarti dialah yang turut menyertai Nabi shallallahu 'alaihi wasallam. Suatu hari Beliau mengundi diantara kami untuk peperangan yang Beliau lakukan lalu yang keluarlah undianku (bagianku). Maka aku berangkat bersama Nabi shallallahu 'alaihi wasallam setelah diturunkan ayat hijab",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2880,
			"arabicnumber": 2880,
			"text": "Telah bercerita kepada kami [Abu Ma'mar] telah bercerita kepada kami ['Abdul Warits] telah bercerita kepada kami ['Abdul 'Aziz] dari [Anas radliallahu 'anhu] berkata; Ketika perang Uhud berkecamuk, orang-orang melarikan diri dari Nabi shallallahu 'alaihi wasallam. Dia berkata: \"Sungguh aku melihat 'Aisyah binti Abu Bakar dan Ummu Sulaim berjalan dengan cepat hingga terlihat gelang kaki keduanya sambil membawa qirab (tempat ait terbuat dari kulit). Dan berkata perawi lain: mengangkut qirab, dengan selendang keduanya lalu menuangkan ke mulut para pasukan. Kemudian keduanya kembali untuk mengisi air kedalam qirab kemudian kembali datang menuangkan air ke mulut pasukan",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2881,
			"arabicnumber": 2881,
			"text": "Telah bercerita kepada kami ['Abdan] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Yunus] dari [Ibnu Syihab] berkata [Tsa'labah bin Abu Malik] bahwa ['Umar bin Al Khaththab radliallahu 'anhu] membagikan kain selimut terbuat dari wol kepada para wanita Madinah lalu tersisa satu kain selimut yang baik. Maka sebagian orang yang berada di dekatnya berkata: \"Wahai Amirul Mu'minin, berikanlah ini kepada cucu Rasulullah shallallahu 'alaihi wasallam yang berada disisi anda itu\". Yang mereka maksud adalah Ummu Kultsum binti 'Ali. Maka 'Umar berkata: \"Ummu Salith lebih berhak\". Ummu Salith adalah wanita Anshor yang berbai'at kepada Rasululloh Shallallhu 'Alaihi Wasallam. 'Umar selanjutnya berkata: \"Sesungguhnya ia pernah membawakan qirab untuk kami ketika perang Uhud\". Abu 'Abdullah Al Bukhariy berkata: \"tazfiru artinya takhithu', \" yaitu menjahitkan",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2882,
			"arabicnumber": 2882,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Bisyir bin Al Mufadhdhal] telah bercerita kepada kami [Khalid bin Dzakwan] dari [Ar-Rubayyi' binti Mu'awwidz] berkata: \"Kami ikut bersama Nabi shallallahu 'alaihi wasallam (dalam peperangan) dimana kami memberi minum pasukan, mengobati yang terluka dan membawa pulang yang gugur ke Madinah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2883,
			"arabicnumber": 2883,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Bisyir bin Al Mufadhdhal] dari [Khalid bin Dzakwan] dari [Ar-Rubayyi' binti Mu'awwidz] berkata: \"Kami ikut berperang bersama Nabi shallallahu 'alaihi wasallam dimana kami memberi minum pasukan, melayani mereka dan membawa pulang yang terluka dan yang gugur ke Madinah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2884,
			"arabicnumber": 2884,
			"text": "Telah bercerita kepada kami [Muhammad bin Al 'Alaa'] telah bercerita kepada kami [Abu Usamah] dari [Buraid bin 'Abdullah] dari [Abu Burdah] dari [Abu Musa radliallahu 'anhu] berkata; Abu 'Amir terkena panah di atas hewan tunggangannya lalu aku menghampirinya maka dia berkata: \"Cabutlah panah ini\". Maka aku mencabutnya lalu keluarlah air memancar darinya. Kemudian aku menemui Nabi shallallahu 'alaihi wasallam lalu aku kabarkan tentang peristiwa tadi maka Beliau berdo'a: \"Ya Allah ampunilah 'Ubaid bin 'Amir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2885,
			"arabicnumber": 2885,
			"text": "Telah bercerita kepada kami [Isma'il bin Khalil] telah mengabarkan kepada kami ['Ali bin Mushir] telah mengabarkan kepada kami [Yahya bin Sa'id] telah mengabarkan kepada kami ['Abdullah bin 'Amir bin Rabi'ah] berkata aku mendengar ['Aisyah radliallahu 'anha] berkata: \"Nabi shallallahu 'alaihi wasallam pernah berjaga-jaga (tidak tidur) di malam hari. Ketika sampai di Madinah, Beliau bersabda: \"Seandainya ada seorang sholih yang randa menjagaku di waktu malam\". Ketika kami mendengar suara senjata, Beliau bertanya: \"Siapakah itu\". Orang itu menjawab: \"Saya Sa'ad bin Abu Waqosh datang untuk menjaga Tuan\". Maka kemudian Nabi shallallahu 'alaihi wasallam tidur",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2886,
			"arabicnumber": 2886,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2887,
			"arabicnumber": 2887,
			"text": "Telah bercerita kepada kami [Yahya binYusuf] telah mengabarkan kepada kami [Abu Bakar. Yaitu Ibnu 'Ayyasy] dari [Abu Hashin] dari [Abu Shalih] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Binasalah hamba dinar, dirham, kain tebal dan sutra. Jika diberi maka ia ridha jika tidak diberi maka ia tidak ridha\". [Israil] tidak memarfu'kannya dan [Muhammad bin Juhadah] dari [Abi Hashin] dan ['Amru] menambahkan kepada kami, dia berkata telah mengabarkan kepada kami ['Abdur Rahman bin 'Abdullah bin Dinar] dari [bapaknya] dari [Abu Shalih] dari [Abu Hurairah radliallahu 'anhu] dari Nabi Sallallhu 'Alaihi Wasallam bersabda: \"Binasalah hamba dinar, dirham, kain tebal dan sutra, jika diberi maka ia ridha jika tidak diberi maka ia mencela. Binasalah dan merugilah ia, jika tertusuk duri maka ia tidak akan terlepas darinya. Beruntunglah hamba yang mengambil tali kendali kuda fii sabilillah, rambutnya kusut dan kakinya berdebu. Jika ia menjaga maka ia benar-benar menjaga, jika ia berada dibarisan belakang maka ia benar-benar menjaga barisan belakang, jika ia meminta izin maka ia tidak akan diberi izin, jika ia menengahi maka penengahannya tidak diterima\" (karena menghindari riya' dan pamer dan tidak punya ambisi apapun). Firman Allah fata'san maksudnya Allah berfirman: \"Maka Allah membinasakan mereka\". Kata thuubaa mengikuti wazan (suku kata) fu'laa yang artinya kebaikan yang diberikan. Kata itu menggunakan huruf ي (ya') yang diubah ke huruf و (wau) berasal dari kata yathibu (baik)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2888,
			"arabicnumber": 2888,
			"text": "Telah bercerita kepada kami [Muhammad bin 'Ar'arah] telah bercerita kepada kami [Syu'bah] dari [Yunus bin 'Ubaid] dari [Tsabit Al Bananiy] dari [Anas bin Malik radliallahu 'anhu] berkata: \"Aku pernah menyertai Jarir bin 'Abdullah dan saat itu dia melayaniku\". Jarir bin 'Abdullah lebih tua usianya dibanding Anas. Jarir berkata: \"Sungguh aku melihat Kaum Anshor mengerjakan sesuatu (melayani Rasulullah shallallahu 'alaihi wasallam) dimana kemudian tidak aku temui seorangpun dari mereka kecuali aku memuliakannya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2889,
			"arabicnumber": 2889,
			"text": "Telah bercerita kepada kami ['Abdul 'Aziz bin 'Abdullah] telah bercerita kepada kami [Muhammad bin Ja'far] dari ['Amru bin Abi 'Amru] mantan budak (yang telah dimerdekakan oleh) Al Muthallib bin Hanthab bahwa dia mendengar [Anas bin Malik radliallahu 'anhu] berkata: \"Aku keluar bersama Rasulullah shallallahu 'alaihi wasallam menuju Khaibar dimana aku melayani Beliau. Ketika Beliau kembali pulang dan sampai di dekat gunung Uhud, Beliau bersabda: \"Gunung ini mencintai kita dan kitapun mencintainya\". Kemudian Beliau memberi isyarat dengan tangan Beliau ke arah Madinah seraya bersabda: \"Ya Allah sungguh aku mensucikan apa yang ada diantara dua bukit hitam ini (maksudnya Madinah) sebagaimana Nabi Ibrahim Alaihis Salam mensucikan Makkah. Ya Allah berilah berkah kepada kami dalam takaran sho' dan mud kami",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2890,
			"arabicnumber": 2890,
			"text": "Telah bercerita kepada kami [Sulaiman bin Daud Abu ar-Robi'] dari [Isma'il bin Zakariya'] telah bercerita kepada kami ['Ashim] dari [Muwarriq Al 'Ijliy] dari [Anas radliallahu 'anhu] berkata: \"Kami pernah bersama Nabi shallallahu 'alaihi wasallam, dimana kebanyakan dari kami berlindung dengan kainnya masing-masing (karena panas terik) \". Adapun orang yang tetap berpuasa mereka tidak melakukan apa-apa, dan yang berbuka mereka mengerahkan tunggangan mereka, bekerja keras dan mengurus (orang-orang yang berpuasa). Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Orang-orang yang berbuka pada hari ini telah bepergian dengan mendapatkan pahala",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2891,
			"arabicnumber": 2891,
			"text": "Telah bercerita kepada kami [Ishaq bin Nashr] telah bercerita kepada kami ['Abdur Rozzaq] dari [Ma'mar] dari [Hammam] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Pada setiap ruas tulang ada kewajiban shadaqah. Setiap hari dimana seseorang terbantu dengan tunggangannya yang mengangkat atau mengangkut barang-barangnya di atasnya adalah shadaqah. Ucapan yang baik adalah shadaqah dan setiap langkah yang dilakukan seseorang menuju shalat adalah shadaqah dan orang yang menunjuki jalan adalah shadaqah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2892,
			"arabicnumber": 2892,
			"text": "Telah bercerita kepada kami ['Abdullah bin Munir] dia mendengar [Abu An-Nadhar] telah bercerita kepada kami ['Abdur Rahman bin 'Abdullah bin Dinar] dari [Abu Hazim] dari [Sahal bin Sa'ad As-Sa'idiy radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ribath (bersiap siaga) satu hari di jalan Allah lebih baik dari dunia dan apa saja yang ada diatasnya dan tempat cambuk seorang dari kalian di surga lebih baik dari pada dunia dan apa saja yang ada diatasnya dan berangkat pada awal hari (pagi) atau berangkat pada akhir hari (siang) untuk berperang di jalan Allah lebih baik dari pada dunia dan apa saja yang ada diatasnya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "Telah bercerita kepada kami [Qutaibah] telah bercerita kepada kami [Ya'qub] dari ['Amru] dari [Anas bin Malik radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam berkata kepada Abu Thalhah: \"Carilah seorang ghulam (anak kecil sebagai pelayan) dari ghulam milikmu untuk melayaniku selama keberangkatan ke Khaibar. Maka Abu Thalhah keluar bersamaku dengan memboncengku. Saat itu aku adalah seorang anak kecil yang hampir baligh. Aku melayani Rasulullah shallallahu 'alaihi wasallam saat Beliau singgah dan aku selalu mendengar Beliau banyak berdo'a: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL 'AJZI WAL KASALI WAL BUKHLI WAL JUBNI WA DLAL'ID DAINI WA GHALABATIR RIJAAL\" (Ya Allah aku berlindung kepada-Mu dari (sifat) gelisah, sedih, lemah, malas, kikir, pengecut, terlilit hutang dan dari keganasan orang\"). Kemudian kami sampai di Khaibar. Ketika Allah membukakan kemenangan kepada Beliau pada peperangan itu, diceritakan kepada Beliau tentang kecantikan Shofiyah binti Huyay bin Akhthab yang suaminya telah terbunuh dan dia menjanda. Maka Rasulullah shallallahu 'alaihi wasallam memilihnya untuk diri Beliau sendiri (sebagai tawanan) lalu Beliau berangkat bersamanya hingga ketika kami tiba di Saddal Shohbaa', dia beristirahat lalu Beliau membuatkan baginya tempat (kemah) lalu membuat makanan terbuat dari kurma dalam wajan kecil kemudian Beliau berkata: \"Beri tahu orang-orang yang ada di sekitarmu\". Dan itulah walimah (resepsi pernikahan) Rasulullah shallallahu 'alaihi wasallam dengan Shofiyah. Kemudian kami berangkat menuju Madinah. Anas radliallahu 'anhu berkata: \"Aku melihat Rasulullah shallallahu 'alaihi wasallam meletakkan Shofiyah di belakang unta tunggangan Beliau dimana Beliau duduk di atasnya dan meletakkan lutut Beliau sedemikian rupa sehingga Shofiyah bisa meletakkan kakinya di atas lutut Beliau kemudian berjalan mengendarainya. Maka kami terus berjalan hingga ketika kami hampir tiba di Madinah, Beliau memandang ke bukit Uhud seraya berdo'a: \"Ini adalah gunung yang mencintai kita dan kita pun mencintainya\". Kemudian Beliau memandang ke arah Madinah lalu berdo'a: \"Ya Allah sungguh aku mensucikan kota yang terletak di antara dua bukit hitam ini (Madinah) sebagaimana Ibrahim AS mensucikan Makkah. Ya Allah, berikanlah barakah kepada mereka (penduduk Madinah) dalam takaran mud dan sho' mereka",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2894,
			"arabicnumber": 2894,
			"text": "Telah bercerita kepada kami [Abu An Nu'man] telah bercerita kepada kami [Hammad bin Zaid] dari [Yahya] dari [Muhammad bin Yahya bin Hibban] dari [Anas bin Malik radliallahu 'anhu] berkata [Ummu Haram] telah bercerita kepadaku bahwa Nabi shallallahu 'alaihi wasallam pada suatu hari pernah berkata di rumahnya dimana Beliau terbangun lalu tertawa. Maka dia bertanya: \"Wahai Rasulullah, apa yang membuat Tuan tertawa,?\" Maka Beliau bersabda: \"Aku kagum dengan sekelompok kaum dari umatku dimana mereka sebagai pasukan yang mengarungi lautan bagaikan raja-raja di atas singgasana\". Maka aku berkata: \"Wahai Rasulullah, berdo'alah kepada Allah agar Dia menjdikan aku termasuk dari mereka\". Maka Beliau bersabda: \"Kamu orang yang termasuk diantara mereka\". Kemudian Beliau tertidur lalu bangun sambil tertawa. Dan Beliau berkata sebagaimana perkataan yang tadi sebanyak dua atau tiga kali. Akupun kembali berkata: \"Berdo'alah kepada Allah agar Dia menjadikan aku termasuk dari mereka\". Maka Beliau bersabda: \"Kamu akan menjadi orang-orang yang pertama\". Kemudian Ummu Haram dinikahi oleh 'Ubadah bin Ash-Shomit lalu di kemudian hari dia berangkat dalam suatu peperangan bersamanya. Ketika kembali ke daratan dia (Ummu Haram) mendekati hewan tunggangan untuk dikendarainya namun ia terjatuh dan hewan itu menginjak lehernya (hingga meninggal dunia)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2896,
			"arabicnumber": 2896,
			"text": "Telah bercerita kepada kami [Sulaiman bin Harb] telah bercerita kepada kami [Muhammad bin Thalhah] dari [Thalhah] dari [Mush'ab bin Sa'ad] berkata Sa'ad menganggap bahwa dirinya memiliki kelebihan dibanding orang lain. Maka Nabi shallallahu 'alaihi wasallam berkata: \"Tidaklah kalian ditolong dan diberi rezeki melainkan karena adanya (do'a) orang-orang yang lemah (diantara) kalian",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2897,
			"arabicnumber": 2897,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Sufyan] dari ['Amru] dia mendengar [Jabir] dari [Abu Sa'id Al Khudriy radliallahu 'anhum] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Akan datang suatu zaman dimana akan ada sekelompok orang yang berperang lalu ditanyakan: \"Apakah diantara kalian ada yang telah mendampingi Nabi shallallahu 'alaihi wasallam? Maka dijawab: \"Ya\". Maka pasukan itu menang\". Dan akan datang zuatu zaman zaman dimana akan ada sekelompok orang yang berperang lalu ditanyakan: \"Apakah diantara kalian ada yang telah mendampingi sahabat-sahabat Nabi shallallahu 'alaihi wasallam? Maka dijawab: \"Ya\". Maka pasukan itu pun menang. Dan akan datang suatu zaman dimana akan ada sekelompok orang berperang lalu ditanyakan: \"Apakah diantara kalian ada yang telah mendampingi sahabatnya para sahabat Nabi shallallahu 'alaihi wasallam? Maka dijawab: \"Ya\". Maka pasukan itu pun menang",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "Telah bercerita kepada kami [Qutaibah] telah bercerita kepada kami [Ya'qub bin 'Abdur Rahman] dari [Abu Hazim] dari [Sahal bin Sa'ad As-Sa'idiy radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam berhadapan dengan Kaum Musyrikin lalu saling berperang. Ketika Rasulullah shallallahu 'alaihi wasallam bergabung dengan bala tentara Beliau dan musuhnya pun bergabung kepada bala tentara mereka, ada di antara sahabat Rasulullah shallallahu 'alaihi wasallam seorang yang ditemukan dalam keadaan sendirian terluka sangat parah dan terbunuh oleh pedang. Lalu setelah itu ada yang berkata: \"Hari ini tidak ada seorangpun di antara kita yang mendapat ganjaran pahala sebagaimana yang didapat fulan ini\". Namun Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketahuilah sungguh dia termasuk dari golongan ahlu neraka\". Lalu ada seseorang lak-laki di tengah orang banyak menimpal; \"Aku ada bersama orang itu, laki-laki itu bercerita bahwa ia pergi bersama fulan, hingga apabila dia berhenti diapun ikut berhenti dan apabila dia maju menyerang iapun ikut menyerang, laki-laki itu berkata; \"lalu fulan tersebut terluka sangat parah sehingga mengantarkannya hampir kepada kematian. Lalu laki-laki itu meletakkan pedangnya di tanah dan ujung pedangnya diletakkah diantara dua dadanya lalu dia membunuh dirinya sendiri\". Maka orang yang bersamanya tadi pergi menemui Rasulullah shallallahu 'alaihi wasallam lalu berkata: \"Aku bersaksi bahwa Tuan adalah benar-benar utusan Allah\". Nabi shallallahu 'alaihi wasallam bertanya: \"Kenapa kamu berkata begitu?\" Orang ini menjawab: \"Karena fulan yang Tuan sebutkan tadi benar-benar dia penghuni neraka\". Maka orang-orang kaget mendengar ucapannya itu. Aku katakan: \"Aku menjadi saksinya. Aku telah keluar bersamanya dimana aku mencarinya kemudian aku dapatkan dia dalam keadaan luka parah hampir menemui ajalnya lalu dia meletakkan pedangnya di tanah dan ujung pedangnya diletakkah diantara dua dadanya lalu dia membunuh dirinya sendiri. Maka pada kesempatan itu juga Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya ada seseorang yang mengamalkan amalan ahlu surga berdasarkan yang nampak oleh manusia padahal dia adalah dari golongan ahlu neraka. Dan ada seseorang yang mengamalkan amalan ahlu neraka berdasarkan yang nampak oleh manusia padahal dia adalah dari golongan ahlu surga",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2899,
			"arabicnumber": 2899,
			"text": "Telah bercerita kepada kami ['Abdullah bin Maslamah] telah bercerita kepada kami [Hatim bin Isma'il] dari [Yazid bin Abi 'Ubaid] berkata aku mendengar [Salamah bin Al Akwa' radliallahu 'anhu] berkata; Nabi shallallahu 'alaihi wasallam pernah lewat di hadapan beberapa orang dari suku Aslam yang sedang berlomba dalam menunjukkan kemahiran memanah, lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Memanahlah wahai Bani Isma'il, karena sesungguhnya nenek moyang kalian adalah ahli memanah. Memanahlah dan aku ada bersama Bani Fulan\". Salamah berkata: \"Lalu salah satu dari dua kelompok ada yang menahan tangan-tangan mereka (berhenti sejenak berlatih memanah), maka Nabi shallallahu 'alaihi wasallam bertanya: \"Mengapa kalian tidak terus berlatih memanah?\" Mereka menjawab: \"Bagaimana kami harus berlatih sedangkan Tuan berpihak kepada mereka?\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Berlatihlah, karena aku bersama kalian semuanya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2900,
			"arabicnumber": 2900,
			"text": "Telah bercerita kepada kami [Abu Nu'aim] telah bercerita kepada kami ['Abdur Rahman bin Al Ghosil] dari [Hamzah bin Abi Usaid] dari [bapaknya] berkata; Nabi shallallahu 'alaihi wasallam bersabda pada saat perang Badar ketika Beliau membariskan kami menghadapi Quraisy: \"Jika mereka mendekati kalian maka seranglah dengan anak panah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2901,
			"arabicnumber": 2901,
			"text": "Telah bercerita kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Hisyam] dari [Ma'mar] dari [Az Zuhriy] dari [Ibnu Musayyab] dari [Abu Hurairah radliallahu 'anhu] berkata; Ketika para budak Habasyah sedang bermain menunjukkan kebolehannya menggunakan alat perang mereka di hadapan Nabi shallallahu 'alaihi wasallam tiba-tiba 'Umar masuk lalu mengambil kerikil kemudian melemparkannya kepada mereka. Maka Beliau shallallahu 'alaihi wasallam bersabda: \"Biarkanlah mereka wahai 'Umar\". ['Ali] menambahkan, telah bercerita kepada kami ['Abdur Rozzaq] telah mengabarkan kepada kami [Ma'mar]: \"(Mereka bermain) di dalam masjid",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2902,
			"arabicnumber": 2902,
			"text": "Telah bercerita kepada kami [Ahmad bin Muhammad] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Al Auza'iy] dari [Ishaq bin 'Abdullah bin Abi Thalhah] dari [Anas bin Malik radliallahu 'anhu] berkata; Abu Thalhah pernah bertameng bersama Nabi shallallahu 'alaihi wasallam dalam satu perisai. Abu Thalhah adalah seorang yang ahli memanah. Apabila dia memanah, Nabi shallallahu 'alaihi wasallam memperhatikan dan melihat ke tempat sasaran anak panah itu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2903,
			"arabicnumber": 2903,
			"text": "Telah bercerita kepada kami [Sa'id bin 'Ufair] telah bercerita kepada kami [Ya'qub bin 'Abdur Rahman] dari [Abu Hazim] dari [Sahal] berkata; Ketika topi baja di atas kepala Nabi shallallahu 'alaihi wasallam pecah dan wajah Beliau berlumuran darah serta gigi geraham Beliau pecah, 'Ali hilir mudik membawakan air dengan perisai sebagai wadahnya. Adalah Fathimah tatkala melihat darah terus mengalir semakin banyak dalam air basuhan dia mengambil tikar lalu membakarnya (sampai menjadi debu) kemudian menempelkannya pada luka Beliau hingga darah berhenti mengalir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2904,
			"arabicnumber": 2904,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufyan] dari ['Amru] dari [Az Zuhriy] dari [Malik bin Aus bin Al Hadatsan] dari [Umar] radliallahu 'anhu berkata; Harta harta Bani An-Nadhir yang Allah berikan kepada Rosul-Nya berupa fa'i merupakan harta rampasan perang yang didapatkan oleh Kaum Muslimin tanpa mengerahkan pasukan berkuda dan menunggang unta. Dan Rasulullah shallallahu 'alaihi wasallam mendapat bagian secara khusus yang Beliau jadikan sebagai nafkah untuk keluarga selama setahun dan sisanya berupa senjata dan perisai Beliau jadikan sebagai peralatan perang fi sabilillah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2905,
			"arabicnumber": 2905,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Yahya] dari [Sufyan] berkata telah bercerita kepadaku [Sa'ad bin Ibrahim] dari ['Abdullah bin Syaddad] dari ['Ali]. Dan diriwayatkan pula, telah bercerita kepada kami [Qabishah] telah bercerita kepada kami [Sufyan] dari [Sa'ad bin Ibrahim] berkata telah bercerita kepadaku ['Abdullah bin Syaddad] berkata aku mendengar ['Ali radliallahu 'anhu] berkata; Tidak pernah aku melihat Nabi shallallahu 'alaihi wasallam memberikan jaminan tebusan kepada seseorang selain Sa'ad dimana aku mendengar Beliau berkata (kepada Sa'ad): \"Memanahlah demi bapak dan ibuku yang aku tebus keduanya (kepada Allah)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2907,
			"arabicnumber": 2907,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2908,
			"arabicnumber": 2908,
			"text": "Telah bercerita kepada kami [Sulaiman bin Harb] telah bercerita kepada kami [Hammad bin Zaid] dari [Tsabit] dari [Anas radliallahu 'anhu] berkata; Nabi shallallahu 'alaihi wasallam adalah manusia yang paling baik dan paling berani. Pernah suatu hari penduduk Madinah mengalami gempa bumi di malam hari lalu mereka keluar mencari sumber suara gempa. Maka Nabi shallallahu 'alaihi wasallam mendahului mereka dan ketika berita (kepanikan) sudah selesai Beliau kembali dengan menunggang kuda milik Abu Thalhah yang tidak berpelana sedang di lehernya tergantung sebilah pedang dan Beliau berkata: \"Janganlah kalian takut, janganlah kalian takut\". Kemudian Beliau melanjutkan: \"Kami dapati (kuda) ini seperti lautan (larinya sangat cepat) \" atau Beliau berkata: \"Sungguh kuda ini sangat cepat",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2909,
			"arabicnumber": 2909,
			"text": "Telah bercerita kepada kami [Ahmad bin Muhammad] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Al Auza'iy] berkata aku mendengar [Sulaiman bin Habib] berkata aku mendengar [Abu Umamah] berkata; Kaum Muslimin telah menaklukan banyak wilayah namun perhiasan pedang mereka bukanlah emas dan perak. Perhiasan mereka tidak lain adalah al-'Alaby (ikat leher unta yang digunakan sebagai penghias pedang), tombak yang tajam, dan pedang besi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2910,
			"arabicnumber": 2910,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata telah bercerita kepadaku [Sinan bin Abi Sinan Ad-Dualiy] dan [Abu Salamah bin 'Abdur Rahman] bahwa [Jabir bin 'Abdullah radliallahu 'anhuma] mengabarkan bahwa dia berangkat berperang bersama Rasulullah shallallahu 'alaihi wasallam melewati Najed. Ketika Rasulullah shallallahu 'alaihi wasallam kembali dan Jabir pun ikut kembali, mereka menjumpai sungai di bawah lembah yang banyak pepohonannya. Maka Rasulullah shallallahu 'alaihi wasallam turun dan orang-orangpun berpencar mencari tempat berteduh di bawah pohon. Dan Rasulullah shallallahu 'alaihi wasallam singgah berteduh di bawah suatu pohon lalu menggantungkan pedang Beliau pada pohon tersebut kemudian Beliau tidur sejenak. Ketika Rasulullah shallallahu 'alaihi wasallam memanngil kami, dihadapan Beliau ada seorang Baduy. Beliau berkata: \"Orang ini telah mengambil pedangku saat aku tidur lalu aku bangun sedang tangannya sudah memegang pedang yang terhunus lalu dia berkata: \"Siapa yang dapat melindungimu dariku?\" Aku jawab: \"Allah\" sebanyak tiga kali. Maka orang itu tidak dapat berbuat apa-apa kepada Beliau lalu dia terduduk lemas",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2911,
			"arabicnumber": 2911,
			"text": "Telah bercerita kepada kami ['Abdullah bin Maslamah] telah bercerita kepada kami ['Abdul 'Aziz bin Abi Hazim] dari [bapaknya] dari [Sahal radliallahu 'anhu] bahwa dia ditanya tentang luka yang dialami Nabi shallallahu 'alaihi wasallam pada perang Uhud. Dia menjawab: \"Wajah Nabi shallallahu 'alaihi wasallam terluka, gigi gerahamnya pecah dan topi baja pelindung kepala Beliau juga pecah. Dan Fathimah Alaihis Salam adalah orang yang membersihkan darah sedangkan 'Ali menahannya. Ketika Fathimah melihat darah yang keluar semakin banyak, dia mengambil tikar lalu membakarnya hinga menjadi abu, kemudian menempelkannya pada luka sehingga darah berhenti mengalir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2912,
			"arabicnumber": 2912,
			"text": "Telah bercerita kepada kami ['Amru bi 'Abbas] telah bercerita kepada kami ['Andur Rahman] dari [Sufyan] dari [Abu Ishaq] dari ['Amru bin Al Harits] berkata; Nabi shallallahu 'alaihi wasallam tidaklah meninggalkan (harta warisan) kecuali pedang Beliau, baghol (hewan hasil peranakan kuda dan keledai) yang berwarna putih dan sebidang tanah yang semuanya dijadikan sebagai shadaqah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2913,
			"arabicnumber": 2913,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata telah bercerita kepadaku [Sinan bin Abi Sinan] dan [Abu Salamah] bahwa [Jabir] mengabarkan kepadanya. Dan diriwayatkan pula, telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Ibrahim bin Sa'ad] telah mengabarkan kepada kami [Ibnu Syihab] dari [Sinan bin Abi Sinan Ad-Du'aliy] bahwa [Jabir bin 'Abdullah radliallahu 'anhuma] mengabarkan kepadanya bawa dia pernah berperang bersama Nabi shallallahu 'alaihi wasallam. Kemudian mereka menjumpai sungai di bawah lembah yang banyak pepohonannya. Maka orang-orangpun berpencar mencari tempat berteduh di bawah pohon begitu juga Nabi shallallahu 'alaihi wasallam berteduh di bawah pohon lalu menggantungkan pedang Beliau pada pohon tersebut kemudian Beliau tidur sejenak. Ketika Beliau bangun dari tidur ternyata ada seorang laki-laki di hadapan Beliau dimana Beliau tidak menyadarinya sebelumnya. Kemudian Beliau berkata: \"Orang ini telah mengambil pedangku lalu dia berkata: \"Siapa yang dapat melindungimu dariku?\" Aku jawab: \"Allah\". Maka orang itu memasukkan kembali pedang ke dalam sarungnya sedangkan di terduduk lemas dan tidak dapat berbuat apa-apa",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2914,
			"arabicnumber": 2914,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Abu An Nadhir, mantan budak (yang telah dimerdekakan oleh) 'Umar bin 'Ubaidillah] dari [Nafi', maula Abu Qatadah Al Anshariy] dari [Abu Qatadah radliallahu 'anhu] bahwa dia pernah bersama Nabi shallallahu 'alaihi wasallam hingga ketika sampai di suatu jalan menuju Makkah, dia tertinggal dari rambongan bersama teman-temannya yang dalam keadaam berihram sedang dia tidak. Kemudian dia melihat seekor keledai liar dan seketika itu dia langsung menunggang kudanya dan meminta kepada teman-temannya agar memberikan cambuknya namun mereka tidak mau. Lalu dia meminta tombaknya namun mereka kembali tidak mau. Akhirnya dia mengambil sendiri lalu mengejar keledai itu hingga dapat membunuhnya. Kemudian dia memakan dagingnya begitu juga sebagian dari sahabat-sahabat Nabi shallallahu 'alaihi wasallam ada yang memakannya dan sebagian lain ada yang tidak memakannya. Ketika mereka bertemu Nabi shallallahu 'alaihi wasallam mereka bertanya tentang masalah tadi. Maka Beliau berkata: \"Sesungguhnya itu adalah makanan yang Allah berikan kepada kalian\". Dan dari [Zaid bin Aslam] dari ['Atha' bin Yasar] dari [Abu Qatadah] tentang keledai liar seperti hadits Abu An Nadhir berkata: \"Apakah masih ada pada kalian sisa sebagian dagingnya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2915,
			"arabicnumber": 2915,
			"text": "Telah bercerita kepada kami [Muhammad bin Al Mutsannaa] telah bercerita kepada kami ['Abdul Wahhab] telah bercerita kepada kami [Khalid] dari ['Ikrimah] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata; Nabi shallallahu 'alaihi wasallam bersabda ketika berada di Qubbah: \"Ya Allah, sungguh aku benar-benar memohon kepada-Mu akan perjanjian dan janji-Mu. Ya Allah, jika Engkau menghendaki (kehancuran pasukan Islam ini) maka Engkau tidak akan disembah lagi setelah hari ini\". Maka Abu Bakar memegangi tangan Beliau dan berkata: \"Cukup wahai Rasulullah. Sungguh Tuan telah bersungguh-sungguh meminta dengan terus mendesak kepada Robb Tuan\". Saat itu Beliau mengenakan baju besi lalu tampil sambil bersabda: \"Kesatuan musuh itu pasti akan diceari beraikan dan mereka akan lari tunggang langgang. Akan tetapi sebenarnya hari qiyamat itulah hari yang dijanjikan kepada mereka (siksaan) dan hari qiyamat itu lebih dahsyat dan lebih pahit\". (QS al-Qomar ayat 45 - 46). Dan berkata [Wuhaib] telah bercerita kepada kami [Khalid]: \"Kejadian diatas saat perang Badar",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2916,
			"arabicnumber": 2916,
			"text": "Telah bercerita kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah radliallahu 'anha] berkata; Ketika Rasulullah shallallahu 'alaihi wasallam wafat baju perang Beliau masih tergadai kepada seorang Yahudi seharga tiga puluh sho' gandum\". Dan berkata [Ya'laa] telah bercerita kepada kami [Al A'masy]: \"Baju perang yang terbuat dari besi\". Dan berkata [Mu'allaa] telah bercerita kepada kami ['Abdul Wahid] telah bercerita kepada kami [Al A'masy] dan berkata: \"Beliau shallallahu 'alaihi wasallam menggadaikan baju perangnya yang terbuat dari besi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2917,
			"arabicnumber": 2917,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Wuhaib] telah bercerita kepada kami [Ibnu Thowus] dari [bapaknya] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Perumpamaan bakhil (orang yang pelit bershadaqah) dengan mutashoddiq (orang yang suka bershadaqah) seperti dua orang yang masing-masing mengenakan baju jubah terbuat dari besi yang terpotong bagian lengannya hingga tulang selangka keduanya. Setiap kali mutashoddiq hendak bershadaqah maka bajunya akan melonggar dan akhirnya menutupi sampai kepada ujung kakinya. Dan setiap orang yang bakhil hendak bershadaqah maka baju besinya akan menyempit sehingga menempel ketat pada pemakainya dan ketika dia mencoba untuk melonggarkannya maka tangannya menjadi terangkat sampai ke tulang selangkanya\". Maka dia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Maka dia berusaha untuk melonggarkannya namun tidak bisa",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2918,
			"arabicnumber": 2918,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami ['Abdul Wahid] telah bercerita kepada kami [Al A'masy] dari [Abu Adh Dhuhaa Muslim, dia adalah putra Shubaih] dari [Masruq] berkata telah bercerita kepadaku [Al Mughirah bin Syu'bah] berkata: Rasulullah shallallahu 'alaihi wasallam pergi untuk menunaikan hajat kemudian kembali lalu aku temui Beliau dengan membawakan air kemudian Beliau berwudhu'. Saat itu Beliau membawa baju jubah yang lebar (yang gunakan untuk menutup dirinya). Maka Beliau berkumur, memasukkan air ke hidung lalu mencuci muka. Kemudian Beliau berusaha mengeluarkan tangannya dari lubang lengan jubahnya, tapi terlalu sempit. Lalu Beliau mengeluarkan tangannya lewat bawah jubahnya, lalu Beliau membasuh kedua lengannya dan mengusap kepala serta sepatunya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2919,
			"arabicnumber": 2919,
			"text": "Telah bercerita kepada kami [Ahmad bin Al Miqdam] telah bercerita kepada kami [Khalid bin Al Harits] telah bercerita kepada kami [Sa'id] dari [Qatadah] bahwa [Anas] bercerita kepada mereka bahwa Nabi shallallahu 'alaihi wasallam memberi keringanan kepada 'Abdur Rahman bin 'Auf dan Az Zubair untuk menggunakan baju yang terbuat dari sutera karena alasan penyakit gatal yang diderita keduanya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2920,
			"arabicnumber": 2920,
			"text": "Telah bercerita kepada kami [Abu Al Walid] telah bercerita kepada kami [Hammam] dari [Qatadah] dari [Anas]. Dan diriwayatkan pula, telah bercerita kepada kami [Muhammad bin Sinan] telah bercerita kepada kami [Hammam] dari [Qatadah] dari [Anas radliallahu 'anhu] bahwa 'Abdur Rahman bin 'Auf dan Az Zubair mengadu kepada Nabi shallallahu 'alaihi wasallam, yakni tentang penyakit kutu (gatal) yang diderita keduanya. Maka Beliau memberi keringanan untuk menggunakan baju yang terbuat dari sutera. Kemudian aku melihat baju sutera itu dipakai oleh keduanya dalam suatu peperangan",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2921,
			"arabicnumber": 2921,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Yahya] dari [Syu'bah] telah bercerita kepadaku [Qatadah] bahwa [Anas] bercerita kepada mereka, katanya; Nabi shallallahu 'alaihi wasallam memberi keringanan kepada 'Abdur Rahman bin 'Auf dan Az Zubair bin Al 'Awwam dalam mengenakan sutera. Telah bercerita kepadaku [Muhammad bin Basysyar] telah bercerita kepada kami [Ghundar] telah bercerita kepada kami [Syu'bah] aku mendengar [Qatadah] dari [Anas]: \"Beliau shallallahu 'alaihi wasallam memberi keringanan atau diberi keringanan kepada keduanya karena alasan sakit gatal yang diderita keduanya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2922,
			"arabicnumber": 2922,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2923,
			"arabicnumber": 2923,
			"text": "Telah bercerita kepada kami ['Abdul 'Aziz bin 'Abdullah] berkata telah bercerita kepadaku [Ibrahim bin Sa'ad] dari [Ibnu Syihab] dari [Ja'far bin 'Amru bin Umayyah Adh Dhomriy] dari [bapaknya] berkata: \"Aku melihat Nabi shallallahu 'alaihi wasallam memakan daging paha depan (kambing) yang langsung dipotong darinya, kemudian dikumandangkan seruan shalat maka Beliau shalat tanpa berwudhu' lagi\". Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy], dan dia menambahkan: \"Lalu beliau melemparkan pisaunya (kepada Beliau shallallahu 'alaihi wasallam)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2924,
			"arabicnumber": 2924,
			"text": "Telah bercerita kepadaku [Ishaq bin Yazid Ad-Dimasyqiy] telah bercerita kepada kami [Yahya bin Hamzah] berkata telah bercerita kepadaku [Tsaur bin Yazid] dari [Khalid bin Ma'dan] bahwa 'Umair bin Al Aswad Al 'Ansiy bercerita kepadanya bahwa dia menjumpai 'Ubadah bin ash-Shomit ketika dia sedang singgah dalam perjalanan menuju Himsh. Saat itu dia sedang berada di rumahnya dan bersama dengan Ummu Haram. ['Umair] berkata; \"Maka [Ummu Haram] bercerita kepada kami bahwa dia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Pasukan dari ummatku yang pertama kali akan berperang dengan mengarungi lautan pasti akan diberi pahala dan surga\". Ummu Haram berkata; Aku katakan: \"Wahai Rasulullah, aku termasuk diantara mereka?\" Beliau berkata; \"Ya, kamu termasuk dari mereka\". Nabi shallallahu 'alaihi wasallam bersabda lagi: \"Pasukan dari ummatku yang pertama kali akan memerangi kota Qaishar (Romawi) pasti mereka akan diampuni\". Aku katakan: \"Aku termasuk diantara mereka, wahai Rasulullah?\" Beliau menjawab: 'Tidak",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2925,
			"arabicnumber": 2925,
			"text": "Telah bercerita kepada kami [Ishaq bin Muhammad Al Farwiy] telah bercerita kepada kami [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar radliallahu 'anhuma] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalian akan memerangi orang-orang Yahudi hingga seorang dari merka akan bersembunyi di balik batu, lalu batu itu akan berkata: \"Wahai 'Abdullah, ini Yahudi di belakangku bunuhlah dia",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 2926,
			"arabicnumber": 2926,
			"text": "Telah bercerita kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Jarir] dari ['Umarah bin Al Qa'qa'] dari [Abu Zur'ah] dari [Abu Hurairah radliallahu 'anhu] dari Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan datang hari qiyamat hingga kalian memerangi orang-orang Yahudi hingga batu yang di baliknya bersembunyi seorangYahudi akan berkata: \"Wahai Muslim, ini Yahudi di belakangku bunuhlah dia",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 2927,
			"arabicnumber": 2927,
			"text": "Telah bercerita kepada kami [Abu An Nu'man] telah bercerita kepada kami [Jarir bin Hazim] berkata aku mendengar [Al Hasan] berkata telah bercerita kepada kami ['Amru bin Taghlab] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya diantara tanda-tanda (dekatnya) hari qiyamat adalah kalian memerangi suatu kaum yang memakai sandal bulu. Dan sesungguhnya diantara tanda-tanda (dekatnya) hari qiyamat adalah kalian memerangi suatu kaum yang berwajah lebar, seakan-akan wajah mereka seperti perisai yang melindungi (kulit)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 2928,
			"arabicnumber": 2928,
			"text": "Telah bercerita kepada kami [Sa'id bin Muhammad] telah bercerita kepada kami [Ya'qub] telah bercerita kepada kami [bapakku] dari [Shalih] dari [Al A'raj] berkata, [Abu Hurairah radliallahu 'anhu] berkata; Telah bersabda Rasulullah shallallahu 'alaihi wasallam: \"Tidak akan terjadi hari qiyamat hingga kalian memerangi bangsa Turki yang bermata kecil, wajah kemerahan dan hidungnya pesek. Wajah mereka seakan seperti perisai yang menutupi kulit. Dan tidak akan terjadi hari qiyamat hingga kalian memerangi kaum yang bersandal bulu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 2929,
			"arabicnumber": 2929,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufyan] berkata [Az Zuhriy] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak akan terjadi hari qiyamat hingga kalian memerangi suatu kaum yang memakai sandal bulu. Dan tidak akan terjadi hari qiyamat hingga kalian memerangi suatu kaum yang wajah mereka laksana perisai yang melindungi (kulit) \". [Sufyan] berkata; Dan [Abu Az Zinad] menambahkan didalamnya dari [Al A'raj] dari [Abu Hurairah radliallahu 'anhu] suatu riwayat yang menyebutkan: \"Bermata kecil (sipit), hidung pesek dan wajah mereka seakan-akan seperti perisai yang melindungi (kulit)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 2930,
			"arabicnumber": 2930,
			"text": "Telah bercerita kepada kami ['Amru bin Khalid Al Harraoniy] telah bercerita kepada kami [Zuhair] telah bercerita kepada kami [Abu Ishaq] berkata aku mendengar [Al Bara' radliallahu 'anhu] saat ada seseorang yang bertanya kepadanya: \"Apakah kalian kabur, wahai Abu 'Umarah, pada peperangan Hunain?\" Dia berkata: \"Tidak, demi Allah. Tidaklah Rasulullah shallallahu 'alaihi wasallam kabur dari perang akan tetapi yang kabur adalah orang-orang yang baru saja masuk Islam dari sahabat-sahabat Beliau dan orang-orang yang takut karena tidak memiliki tameng dan senjata lalu datang kepada mereka kaum yang ahli memanah yaitu pasukan suku Hawazin dan Bani Nashr dimana setiap kali mereka akan melepaskan anak panah lalu membidik sasaran hampir tidak pernah meleset. Dan kemudian mereka mendatangi Nabi shallallahu 'alaihi wasallam yang saat itu tetap berada diatas baghol Beliau yang berwarna putih sementara putra paman Beliau, Abu Sufyan bin Al Harits bin 'Abdul Muthallib, menuntun baghol tersebut lalu Nabi shallallahu 'alaihi wasallam terjun berperang hingga mendapat kemenangan seraya bersya'ir: \"Aku adalah seorang Nabi yang tidak berdusta dan aku adalah anak dari 'Abdul Muthallib\". Kemudian Beliau mengatur barisan perang sahabat-sahabat Beliau",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 2931,
			"arabicnumber": 2931,
			"text": "Telah bercerita kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami ['Isa] telah bercerita kepada kami [Hisyam] dari [Muhammad] dari ['Ubaidah] dari ['Ali radliallahu 'anhu] berkata; Ketika terjadi perang Al Ahzab, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga Allah memenuhi rumah dan kuburan mereka dengan api, karena mereka telah menyibukkan kita dari (tidak melaksanakan) shalat Al wushtha hinga matahari terbenam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 2932,
			"arabicnumber": 2932,
			"text": "Telah bercerita kepada kami [Qabishah] telah bercerita kepada kami [Sufyan] dari [Ibnu Dzakwan] dari [Al A'raj] dari [Abu Hurairah radliallahu 'anhu] berkata; Adalah Nabi shallallahu 'alaihi wasallam membaca do'a qunut (yang artinya): \"Ya Allah, tolonglah Hisyam. Ya Allah tolonglah Al Walid bin Al Walid. Ya Allah, tolonglah 'Ayyasy bin Abi Rabi'ah. Ya Allah, tolonglah orang-orang yang lemah dari kalangan orang-orang beriman. Ya Allah, keraskanlah siksaan-Mu kepada (suku) Mudhar. Ya Allah timpakanlah kepada mereka kekeringan sebagaimana kekeringan yang menimpa (kaum) Nabi Yusuf",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 2933,
			"arabicnumber": 2933,
			"text": "Telah bercerita kepada kami [Ahmad bin Muhammad] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Isma'il bin Abu Khalid] bahwa dia mendengar ['Abdullah bin Abu Aufaa radliallahu 'anhuma] berkata; Rasulullah shallallahu 'alaihi wasallam berdo'a ketika perang Al Ahzab terhadap kaum musyrikin (Belioau berdo'a untuk kebinasaan mereka): \"Ya Allah, Yang Menurunkan kitab, Yang Maha cepat perhitungan-Nya. Ya Allah, kalahkanlah pasukan sekutu (Al Ahzab). Ya Allah, kalahkanlah mereka dan guncangkanlah mereka",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 2934,
			"arabicnumber": 2934,
			"text": "Telah bercerita kepada kami ['Abdullah bin Abu Syaibah] telah mengabarkan kepada kami [Ja'far bin 'Aun] telah bercerita kepada kami [Sufyan] dari [Abu Ishaq] dari ['Amru bin Maimun] dari ['Abdullah radliallahu 'anhu] berkata; Ketika Nabi shallallahu 'alaihi wasallam shalat di naungan Ka'bah, Abu Jahal dan orang-orang dari Quraisy berkata satu sama lain. Kemudian mereka menyembelih (unta) di luar sekitar Makkah lalu mengutus orang untuk mengambilnya kemudian mereka datang dengan membawa isi perutnya (jeraan) lalu melemparkannya ke (punggung) Be; liau shallallahu 'alaihi wasallam. Kemudian Fathimah datang lalu menyingkirkannya. Kemudian Beliau berdo'a: \"Ya Allah aku serahkan (urusan) suku Quraisy kepadaMu.\"Ya Allah aku serahkan (urusan) suku Quraisy kepadaMu.\"Ya Allah aku serahkan (urusan) suku Quraisy kepadaMu. Terutama Abu Jahal bin Hisyam, 'Utbah bin Rabi'ah, Syaibah bin Rabi'ah, Al Walid bin 'Utbah, Ubay bin Kholaf, 'Uqbah bin Abu Mu'aith\". 'Abdullah radliallahu 'anhu berkata: \"Sungguh aku melihat orang-orang yang disebut Nabi shallallahu 'alaihi wasallam itu terbantai di pinggiran lembah Badar (dalam perang Badar). Abu Ishaq berkata; \"Aku lupa orang ketujuh yang disebut Beliau\". Dan berkata Abu 'Abdullah Al Bukhariy; dan berkata [Yusuf bin Ishaq] dari [Abu Ishaq]: \"Umayyah bin Kholaf\". Dan berkata [Syu'bah]: Umayyah atau Ubay?\" Dan yang benar adalah Umayyah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 2935,
			"arabicnumber": 2935,
			"text": "Telah bercerita kepada kami [Sulaiman bin Harb] telah bercerita kepada kami [Hammad] dari [Ayyub] dari [Ibnu Abi Mulaikah] dari ['Aisyah radliallahu 'anha] bahwa orang-orang Yahudi datang menemui Nabi shallallahu 'alaihi wasallam lalu mereka mengucapkan as-saamu 'alaika (Kecelakaan atau racun buatmu), maka 'Aisyah melaknat mereka. Beliau bertanya: \"Kenapa kamu berbuat begitu\". Aku jawab: \"Apakah Tuan tidak mendengar apa yang mereka ucapkan? ' Beliau menjawab: \"Apakah kamu tidak mendengar apa yang aku katakan?\" (Aku kepada mereka): \"Wa 'alaikum (namun juga buat kalian)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 2936,
			"arabicnumber": 2936,
			"text": "Telah bercerita kepada kami [Ishaq] telah mengabarkan kepada kami [Ya'qub bin Ibrahim] telah bercerita kepada kami [putra dari saudaraku Ibnu Syihab] dari [pamannya] berkata telah bercerita kepadaku ['Ubaidullah bin 'Abdullah bin 'Utbah bin Mas'ud] bahwa ['Abdullah bin 'Abbas radliallahu 'anhuma] mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam menulis surat kepada Qaishar (Raja Romawi/Heraklius) yang dalam isinya Beliau bersabda: \"Jika kamu enggan (masuk Islam) maka kamu menanggung dosa bangsa Al Arisiyyiin (Erapa)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 2937,
			"arabicnumber": 2937,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] telah bercerita kepada kami [Abu Az Zanad] bahwa [Abdur Rahman] berkata; [Abu Hurairah radliallahu 'anhu] berkata: Thufail bin 'Amru Ad-Dausiy dan para sahabatnya mendatangi Nabi shallallahu 'alaihi wasallam seraya berkata: \"Wahai Rasulullah, sesungguhnya suku Daus telah ingkar kepada Allah dan enggan masuk Islam, untuk itu mohonlah kepada Allah agar mereka dibinasakan\". Atau dikatakan kepada Beliau; \"Suku Daus telah binasa\". Maka Beliau berkata: \"Ya Allah, tunjukilah suku Daus dan berikanlah petunjuk kepada mereka",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 2938,
			"arabicnumber": 2938,
			"text": "Telah bercerita kepada kami ['Ali bin Al Ja'di] telah mengabarkan kepada kami [Syu'bah] dari [Qatadah] berkata aku mendengar [Anas radliallahu 'anhu] berkata; Ketika Nabi shallallahu 'alaihi wasallam hendak menulis surat kepada (raja) Romawi dikatakan kepada Beliau bahwa mereka tidak membaca tulisan kecuali bila berstempel. Maka Beliau mengambil stempel terbuat dari perak. Sungguh aku seakan melihat cahaya putih pada tangan Beliau. Lalu Beliau memberi tanda yang bertuliskan Muhammad Rasulullah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 2939,
			"arabicnumber": 2939,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah bercerita kepada kami [Al Laits] berkata telah bercerita kepadaku ['Uqail] dari [Ibnu Syihab] berkata telah bercerita kepadaku ['Ubaidullah bin 'Abdullah bin 'Uqbah] bahwa ['Abdullah bin 'Abbas] mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam mengutus orang yang membawa surat Beliau kepada Kisra (Raja Persia) lalu dia memerintahkan agar memberikannya kepada pembesar negeri Bahrain dan kemudian pembesar negeri Bahrain pun memerintahkan agar memberikannya kembali kepada Kisra. Setelah membacanya, lalu Kisra membakarnya. Aku menduga bahwa Sa'id bin Al Musayyab berkata: \"Kemudian Nabi shallallahu 'alaihi wasallam berdo'a agar Allah mengoyak-oyak (kerajaan mereka) sehancur-hancurnya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 2941,
			"arabicnumber": 2941,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 2942,
			"arabicnumber": 2942,
			"text": "Telah bercerita kepada kami ['Abdullah bin Maslamah Al Qo'nabiy] telah bercerita kepada kami ['Abdul 'Aziz bin Abi Hazim] dari [bapaknya] dari [Sahal bin Sa'ad radliallahu 'anhu] dia mendengar Nabi shallallahu 'alaihi wasallam bersabda pada saat perang Khaibar: \"Sungguh bendera perang ini akan aku berikan kepada seseorang yang Allah akan memenangkan peperangan ini lewat tangannya\". Maka orang-orang berdiri sambil berharap siapa di antara mereka yang akan diberikan. Keesokan harinya setiap orang dari mereka berharap diberikan kepercayaan itu. Kemudian Beliau berkata: \"Mana 'Ali?\" Dijawab: \"Dia sedang sakit kedua matanya\". Maka Beliau memerintahkan agar memanggilnya. (Setelah 'Ali datang) Beliau meludahi kedua matanya hingga sembuh seakan-akan belum pernah terkena penyakit sedikitpun. Lalu Beliau bersabda: \"Kita perangi mereka hingga mereka menjadi seperti kita (Muslim) \". Beliau melanjutkan: \"Melangkahlah ke depan hingga kamu memasuki tempat tinggal mereka lalu serulah mereka ke dalam Islam dan beritahu kepada mereka tentang apa yang diwajibkan atas mereka. Demi Allah, bila ada satu orang saja yang mendapat petunjuk melalui dirimu maka itu lebih baik bagimu dari pada unta-unta merah (yang paling bagus)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 2943,
			"arabicnumber": 2943,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Mu'awiyah bin 'Amru] telah bercerita kepada kami [Abu Ishaq] dari [Humaid] berkata aku mendengar [Anas radliallahu 'anhu] berkata; \"Adalah Rasulullah shallallahu 'alaihi wasallam apabila memerangi suatu kaum, Beliau tidak memeranginya hingga datang waktu shubuh. Apabila mendengar suara adzan Beliau menahan diri dan apabila tidak mendengar adzan, Beliau lantas memeranginya setelah waktu shubuh. Dahulu kami mendatangi Khaibar (untuk berperang) pada malam hari\". Telah bercerita kepada kami [Qutaibah] telah bercerita kepada kami [Isma'il bin Ja'far] dari [Humaid] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam: \"Adalah Nabi shallallahu 'alaihi wasallam bila berperang bersama kami",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 2944,
			"arabicnumber": 2944,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 2945,
			"arabicnumber": 2945,
			"text": "Telah bercerita kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Humaid] dari [Anas radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam berangkat menuju Khaibar dan Beliau mendatanginya di malam hari. Dan Beliau apabila mendatangi suatu kaum di malam hari Beliau tidak langsung menyerang mereka hingga menunggu datangnya waktu shubuh. Ketika tiba waktu shubuh, orang-orang Yahudi keluar dengan membawa sekop-sekop dan keranjang mereka. Tatkala melihat Nabi shallallahu 'alaihi wasallam, mereka berkata: \"Muhammad. Demi Allah Muhammad dan pasukannya\". Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Allahu Akbar, hancurlah Khaibar. Sesungguhnya kami apabila mendatangi perkampungan suatu kaum, maka amat buruklah pagi hari yang dialami orang-orang yang diperingatkan tersebut",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 2946,
			"arabicnumber": 2946,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] telah bercerita kepada kami [Sa'id bin Al Musayyab] bahwa [Abu Hurairah radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku diperintahkan untuk memerangi manusia hingga mereka mengucapkan Laa ilaaha illallah (tidak ada ilah kecuali Allah). Maka barang siapa yang telah mengucapkan laa ilaaha illallah, sungguh telah terlindung jiwa dan hartanya dariku kecuali dengan haqnya dan perhitunganya kepada Allah\". Diriwayatkan oleh 'Umar dan Ibnu 'Umar dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 2947,
			"arabicnumber": 2947,
			"text": "Telah bercerita kepada kami [Yahya bin Bukair] telah bercerita kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] berkata telah bercerita kepadaku ['Abdur Rahman bin 'Abdullah bin Ka'ab bin Malik] bahwa ['Abdullah bin Ka'ab radliallahu 'anhu] adalah penuntun Ka'ab (saat buta) dari anak-anaknya, dia berkata aku mendengar [Ka'ab bin Malik] ketika dia tidak mengikuti perang bersama Rasulullah shallallahu 'alaihi wasallam (dalam perang Tabuk). Dan tidaklah Rasulullah shallallahu 'alaihi wasallam hendak berperang kecuali Beliau merahasiakannya dari orang lain",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 2948,
			"arabicnumber": 2948,
			"text": "Dan telah bercerita kepadaku [Ahmad bin Muhammad] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Yunus] dari [Az Zuhriy] berkata telah bercerita kepadaku ['Abdur Rahman bin 'Abdullah bin Ka'ab bin Malik] berkata aku mendengar [Ka'ab bin Malik radliallahu 'anhu] berkata; Tidaklah Rasulullah shallallahu 'alaihi wasallam apabila hendak melakukan peperangan yang Beliau terjun didalamnya melainkan merahasiakannya kecuali ketika perang Tabuk yang Rasulullah shallallahu 'alaihi wasallam ikut didalamnya yang terjadi pada musin panas dan menempuh perjalanan yang panjang melelahkan serta menghadapi pasukan musuh yang jumlahnya banyak. (Pada perang itu) Beliau mengumumkannya kepada Kaum Muslimin tentang urusan mereka agar mereka mempersiapkan diri menghadapi musuh mereka dan mengabarkan kepada mereka secara langsung apa yang Beliau kehendaki",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 2949,
			"arabicnumber": 2949,
			"text": "Dan dari [Yunus] dari [Az Zuhriy] berkata telah bercerita kepadaku ['Abdur Rahman bin Ka'ab bin Malik] bahwa [Ka'ab binMalik radliallahu 'anhu] pernah berkata; Sungguh sedikit sekali apabila Rasulullah shallallahu 'alaihi wasallam keluar untuk bepergian melainkan Beliau melakukannya pada hari Kamis",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 2950,
			"arabicnumber": 2950,
			"text": "Telah bercerita kepadaku ['Abdullah bin Muhammad] telah bercerita kepada kami [Hisyam] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhriy] dari ['Abdur Rahman bin Ka'ab bin Malik] dari [bapaknya radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam keluar pada hari Kamis saat perang Tabuk dan adalah Beliau suka apabila keluar (bepergian) pada hari Kamis",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 2951,
			"arabicnumber": 2951,
			"text": "Telah bercerita kepada kami [Sulaiman bin Harb] telah bercerita kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] dari [Anas radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam shalat Zhuhur di Madinah empat raka'at dan shalat 'Ashar di Dzzzul Hulaifah dua raka'at dan aku mendengar mereka (para sahabat) mengeraskan (bacaan talbiyyah) pada keduanya (hajji dan 'Umrah) secara bersamaan",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 2952,
			"arabicnumber": 2952,
			"text": "Telah bercerita kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Yahya bin Sa'id] dari ['Amrah binti 'Abdur Rahman] bahwa dia mendengar ['Aisyah radliallahu 'anha] berkata: \"Kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam pada lima malam terakhir dari bulan Dzul Qo'dah dimana tidak lain keberangkatan kami melainkan untuk menunaikan hajji. Ketika kami hampir sampai di Makkah, Rasulullah shallallahu 'alaihi wasallam memerintahkan kepada siapa yang tidak membawa hadyu (hewan qurban) apabila nanti telah selesai dari thawaf di Baitullah dan sa'i antara bukit Shofa dan Marwah agar mereka bertahallul. 'Aisyah radliallahu 'anha berkata; Kemudian pada hari Nahar dikirimkan kepada kami daging sapi, lalu aku bertanya: \"Apa in? i\". Maka si pengirim berkata: \"Ini (daging) sembilahan Rasulullah shallallahu 'alaihi wasallam atas nama istri-istri Beliau\". Berkata [Yahya]; Maka aku ceritakan hadits ini kepada [Qosim bin Muhammad] maka dia berkata: \"Demi Allah, sungguh dia telah datang kepadamu dengan membawakan hadits yang sesungguhnya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 2953,
			"arabicnumber": 2953,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufyan] berkata telah bercerita kepadaku [Az Zuhriy] dari ['Ubaidullah] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata: \"Nabi shallallahu 'alaihi wasallam keluar bepergian di bulan Romadhan dan tetap melaksanakan shoum (puasa) hingga ketika sampai di Al Kadid, Beliau berbuka\". Berkata Sufyan, Az Zuhriy berkata telah bercerita kepadaku 'Ubaidullah dari Ibnu 'Abbas radliallahu 'anhu lalu dia menyebutkan hadits ini. Berkata Abu 'Abdullah Al Bukhariy: \"Ini merupakah ucapannya Az Zuhriy. Sedangkan disebutkan di Akhir adalah perbuatan Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 2954,
			"arabicnumber": 2954,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 2955,
			"arabicnumber": 2955,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Yahya] dari ['Ubaidullah] berkata telah bercerita kepadaku [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam. Dan diriwayatkan pula, telah bercerita kepadaku [Muhammad bin Shobbah] telah bercerita kepada kami [Isma'il bin Zakariya'] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Mendengar dan taat adalah haq (kewajiban) selama tidak diperintah berbuat maksiat. Apabila diperintah berbuat maksiat maka tidak ada (kewajiban) untuk mendengar dan taat",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 2957,
			"arabicnumber": 2957,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 2958,
			"arabicnumber": 2958,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Juwairiyah] dari [Nafi'] berkata; [Ibnu 'Umar radliallahu 'anhuma] berkata: \"Kami kembali (ke Hudaibiyah) pada tahun berikutnya (satu tahun setelah perjanjian Hudaibiyah), maka tidak ada dua orang dari kami yang berkumpul di pohon yang kami dulu kami berbaiat dibawahnya. Pohon itu menjadi rahmat dari Allah\". Kemudian aku bertanya kepada Nafi': \"Atas dasar apa Beliau membaiat mereka, apakah untuk kematian?\" Dia menjawab: \"Tidak, namun Beliau membaiat mereka untuk kesabaran",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 2959,
			"arabicnumber": 2959,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Wuhaib] telah bercerita kepada kami ['Amru bin Yahya] dari ['Abbad bin Tamim] dari ['Abdullah bin Zaid radliallahu 'anhu] berkata: \"Ketika terjadi peperangan Harrah (dan orang-orang membai'at 'Abdullah bin Hanzholah untuk kematian), ada orang yang datang kepadanya ('Abdullah bin Zaid) seraya berkata: \"Sesungguhnya Ibnu Hanzholah membai'at manusia atas kematian\". Maka dia berkata: \"Aku tidak akan berbai'at kepada seseorang untuk hal itu kecuali kepada Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 2960,
			"arabicnumber": 2960,
			"text": "Telah bercerita kepada kami [Al Makkiy bin Ibrahim] telah bercerita kepada kami [Yazid bin Abi 'Ubaid] dari [Salamah radliallahu 'anhu] berkata; \"Aku berbai'at kepada Nabi shallallahu 'alaihi wasallam (pada peristiwa Hudaibiyah) kemudian aku berpindah kepada naungan pohon. Ketika orang-orang sudah agak longgar, Beliau berkata: \"Wahai Ibnu Al Akwa' (Salamah), tidakkah kamu berbai'at?\" Aku berkata: \"Aku sudah berbai'at, wahai Rasulullah\". Beliau berkata: \"Bai'at lagi\". Maka kemudian aku berbai'at untuk kali kedua. Lalu aku (Yazid) bertanya kepadanya: \"Wahai Abu Muslim, untuk apakah kalian berbai'at pada saat itu?\" Dia berkata: \"Untuk mati",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 2961,
			"arabicnumber": 2961,
			"text": "Telah bercerita kepada kami [Hafsh bin 'Umar] telah bercerita kepada kami [Syu'bah] dari [Humaid] berkata, aku mendengar [Anas radliallahu 'anhu] berkata; Pada perang Al Khandaq, orang-orang Anshar bersya'ir: \"Kami adalah orang-orang yang berbai'at kepada Muhammad. Untuk terus berjihad selama kami hidup\". Lalu Nabi shallallahu 'alaihi wasallam menyambut sya'ir mereka dengan bersya'ir: \"Ya Allah, tidak ada kehidupan yang sesungguhnya melainkan kehidupan akhirat. Maka muliakanlah Anshar dan Muhajirin",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 2963,
			"arabicnumber": 2963,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 2964,
			"arabicnumber": 2964,
			"text": "Telah bercerita kepada kami ['Utsman bin Abi Syaibah] telah bercerita kepada kami [Jarir] dari [Manshur] dari [Abu Wa'il] berkata; ['Abdullah bin Mas'ud] berkata: \"Pada hari ini ada seorang yang datang menemuiku lalu bertanya tentang sesuatu yang aku tidak tahu apa yang harus aku jawab. Dia berkata: \"Bagaimana pendapatmu tentang seseorang yang bersemangat dan sungguh-sungguh, ia keluar bersama para pemimpin kita pada peperangan, lalu ia mengatakan kepada kita segala sesuatu yang kita tidak mampu menghitungnya?\" aku jawab: \"Demi Allah, aku tidak tahu apa yang harus aku katakan padamu, kecuali ketika kami bersama Nabi shallallahu 'alaihi wasallam, dimana Beliau tidak menginginkan kepada kami kecuali hanya sekali hingga kami melakukannya. (Kata Beliau): \"Dan sesungguhnya ada orang diantara kalian yang akan senantiasa dalam kebaikan selama ia bertakwa kepada Allah. Jika ia ragu pada dirinya tentang sesuatu ia bertanya kepada orang lain lalu ia meyelesaikan perkaranya. Dan hampir-hampir kalian tidak akan menemuinya. Demi Dzat yang tidak ada ilah selain Dia, aku ingat bahwa tidak ada yang menyelimuti dunia kecuali seperti air keruh yang diminum bagian bersihnya dan tersisa keruhnya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 2966,
			"arabicnumber": 2966,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 2967,
			"arabicnumber": 2967,
			"text": "Telah bercerita kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Jarir] dari [Al Mughirah] dari [Asy-Sya'biy] dari [Jabir bin 'Abdullah radliallahu 'anhuma] berkata; Aku ikut berperang bersama Rasulullah shallallahu 'alaihi wasallam lalu Beliau menemuiku saat aku sedang menunggang unta milik kami yang sudah sangat lemah hampir tidak sanggup berjalan. Beliau bertanya kepadaku: \"Ada apa dengan untamu?\" Jabir berkata; Aku jawab: \"Kelelahan\". Jabir berkata: Maka Rasulullah shallallahu 'alaihi wasallam berbalik ke belakang lalu menuntun unta itu dan mendo'akannya. Beliau terus saja berada di dekat unta hingga unta itu berjalan mendahului lalu Beliau bertanya kepadaku: \"Bagaimana pendapatmu tentang untamu sekarang?\" Dia berkata: Aku jawab: \"Bagus, dia telah mendapatkan barakah Tuan\". Beliau berkata: \"Apakah kamu mau menjuanya kepadaku?\" Jabir berkata: \"Aku malu, karena tidak ada lagi unta yang kami miliki selain itu\". Jabir berkata: \"Aku katakan: \"Ya\". Beliau berkata: \"Juallah untamu kepadaku\". Maka aku jual unta itu kepada Beliau dengan ketentuan saya boleh tetap menungganginya sampai di Madinah. Jabir berkata: Aku katakan: \"Wahai Rasulullah, aku mau nikah\". Lalu aku meminta izin kepada Beliau dan Beliau mengizinkan aku\". Lalu aku mendahului orang-orang menuju Madinah hingga ketika aku sudah sampai di Madinah aku menemui pamanku (saudara laki-laki ibu) lalu dia bertanya kepadaku tentang unta maka aku beritahu apa yang sudah aku lakukan dengan unta tersebut dan dia mencelaku\". Jabir berkata: \"Rasulullah shallallahu 'alaihi wasallam berkata kepadaku ketika aku meminta izin untuk menikah: \"Kamu menikahi seorang gadis atau janda?\" Aku jawab; \"Aku menikahi seorang janda\". Beliau berkata: \"Mengapa kamu tidak menikahi gadis sehingga kau dapat bercengkerama dengannya dan diapun dapat bercengkerama dengan kamu\". Aku katakan: \"Wahai Rasulullah, bapakku telah meninggal dunia atau mati syahid dan aku memiliki saudara-saudara perempuan yang masih kecil-kecil dan aku khawatir bila aku menikahi gadis yang usianya sebaya dengan mereka dia tidak dapat membimbing mereka dan tidak dapat bersikap tegas terhadap mereka hingga akhirnya aku menikahi seorang janda agar dia dapat bersikap tegas dan membimbing mereka\". Jabir berkata: \"Setelah Rasulullah shallallahu 'alaihi wasallam sudah sampai di Madinah aku segera menemui Beliau dengan menyerahkan unta dan Beliau memberiku uang penjualan unta tersebut namun Beliau juga mengembalikan unta tersebut kepadaku\". Al Mughirah berkata: \"Ini merupakan ketentuan kita yang baik dan kami memandangnya tidak ada masalah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 2968,
			"arabicnumber": 2968,
			"text": "Telah bercerita kepada kami [Musaddadd] telah bercerita kepada kami [Yahya] dari [Syu'bah] telah bercerita kepadaku [Qatadah] dari [Anas bin Malik radliallahu 'anhu] berkata; Pernah terjadi gempa bumi di Madinah lalu Rasulullah shallallahu 'alaihi wasallam mengendarai seekor kuda milik Abu Thalhah kemudian berkata: \"Kami tidak melihat sesuatu apapun. Yang kami dapati kuda ini sangat cepat",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 2969,
			"arabicnumber": 2969,
			"text": "Telah bercerita kepada kami [Al Fadhl bin Sahal] telah bercerita kepada kami [Husain bin Muhammad] telah bercerita kepada kami [Jarir bin Hazim] dari [Muhammad] dari [Anas bin Malik radliallahu 'anhu] berkata; Orang-orang mengalami kegoncangan (gempa bumi) lalu Rasulullah shallallahu 'alaihi wasallam mengendarai seekor kuda milik Abu Thalhah yang sangat lamban. Kemudian Beliau keluar memacu kuda sendirian dan diikuti oleh orang-orang memacu dari belakang lalu Beliau bersabda: \"Jangan kalian takut, sungguh ini kuda yang sangat cepat larinya\". Sejak hari itu kuda itu tidak dapat dikalahkan",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 2970,
			"arabicnumber": 2970,
			"text": "Telah bercerita kepada kami [Al Humaidiy] telah bercerita kepada kami [Sufyan] berkata aku mendengar [Malik bin Anas] bertanya kepada [Zaid bin Aslam], lalu Zaid berkata: \"Aku mendengar [bapakku] berkata; ['Umar bin Al Khaththab] radliallahu 'anhu berkata: \"Aku menshadaqahkan kuda fi sabilillah kemudian aku lihat kuda itu dijual. Maka kemudian aku bertanya kepada Nabi shallallahu 'alaihi wasallam apakah aku boleh membelinya. Maka Beliau berkata: \"Jangan kamu beli dan jangan kamu ambil kembali shadaqah kamu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 2971,
			"arabicnumber": 2971,
			"text": "Telah bercerita kepada kami [Isma'il] berkata telah bercerita kepadaku [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar radliallahu 'anhuma] bahwa 'Umar bin Al Khaththab menshadaqahkan kuda fi sabilillah kemudian dia mendapatkan kuda itu dijual. Kemudian dia hendak membelinya. Lalu dia bertanya kepada Rasulullah shallallahu 'alaihi wasallam. Maka Beliau berkata: \"Jangan kamu beli dan jangan kamu ambil kembali shadaqah kamu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 2972,
			"arabicnumber": 2972,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Yahya bin Sa'id] dari [Yahya bin Sa'id Al Anshoriy] berkata telah bercerita kepadaku [Abu Shalih] berkata aku mendengar [Abu Hurairah radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda; \"Seandainya tidak memberatkan ummatku aku tidak akan membiarkan (mereka) tidak ikut dalam sariyah (pasukan perang) sekalipun. Akan tetapi aku tidak mendapatkan perbekalan dan tidak pula aku dapatkan biaya yang dapat menyertakan mereka untuk berperang lalu menjadi berat bagiku dengan tidak berangkatnya mereka. Sungguh aku ingin berperang di jalan Allah lalu aku terbunuh kemudin aku dihidupkan kembali lalu aku berperang lagi kemudian terbunuh lagi lalu aku dihidupkan kembali",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 2973,
			"arabicnumber": 2973,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Sufyan] telah bercerita kepada kami [Ibnu Juraij] dari ['Atha'] dari [Shofwan binYa'laa] dari [bapaknya radliallahu 'anhu] berkata: \"Aku ikut berperang bersama Rasulullah shallallahu 'alaihi wasallam dalam perang Tabuk dimana aku menshadaqahkan seekor unta muda yang ini menjadi amalku yang paling kokoh tertanam dalam jiwaku. Kemudian aku memberi upah seseorang lalu dia berperang melawan musuhnya sehingga salah satu dari keduanya menggigit tangan lawannya lalu memuntahkannya dari mulutnya hingga jarina putus. Lalu dia menemui Nabi shallallahu 'alaihi wasallam dan mengadukan persoalannya itu, maka Beliau berkata: \"Apakah dia melepaskan tangannya kepadamu lalu kamu menggigitnya seperi unta menggigit?",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 2974,
			"arabicnumber": 2974,
			"text": "Telah bercerita kepada kami [Sa'id bin Abi Maryam] berkata telah bercerita kepadaku [Al Laits] berkata telah bercerita kepadaku ['Uqail] dari [Ibnu Sihab] berkata telah bercerita kapadaku [Tsa'labah bi Abi Malik Al Qurathiy] bahwa [Qais bin Sa'ad Al Anshariy] radliallahu 'anhu adalah pembawa bendera Rasulullah shallallahu 'alaihi wasallam, ketika ia hendak melaksanakan haji lalu ia menyisir rambutnya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 2975,
			"arabicnumber": 2975,
			"text": "Telah bercerita kepada kami [Qutaibah bin Sa'ad] telah bercerita kepada kami [Hatim bin Isma'il] dari [Yazid bin Abi 'Ubaid] dari [Salamah bin Al Akwa' radliallahu 'anhu] berkata; 'Ali radliallahu 'anhu pernah tertinggal dari Nabi shallallahu 'alaihi wasallam dalam peperangan Khaibar karena dia menderita sakit mata. 'Ali berkata: \"Aku terlambat dari Rasulullah shallallahu 'alaihi wasallam\". Kemudian dia berangkat lalu bertemu dengan Nabi shallallahu 'alaihi wasallam. Ketika malam hari yang keesokan paginya Khaibar ditaklukan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh pasti aku kan menyerahkan bendera perang ini\", atau Beliau bersabda: \"Sungguh (bendera ini) akan diambil besok pagi oleh orang yang dicintai oleh Allah dan Rasul-Nya\", atau Beliau bersabda: \"Orang yang mencintai Allah dan Rosul-Nya, dimana Allah akan memberikan kemenangan melalui tangannya\". Maka ketika kami sedang bersama 'Ali, dan ini perkata yang kami tidak harapkan, mereka berkata: \"Inilah 'Ali\". Maka Rasulullah shallallahu 'alaihi wasallam memberikan bendera itu kepadanya kemudian Allah memenangkan peperangan Khaibar ini melalui tangannya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 2976,
			"arabicnumber": 2976,
			"text": "Telah bercerita kepada kami [Muhammad bin Al 'Alaa'] telah bercerita kepada kami [Abu Usamah] dari [Hisyam bin 'Urwah] dari [bapaknya] dari [Nafi' bin Jubair] berkata aku mendengar [Al 'Abbas] berkata kepada Az Zubair radliallahu 'anhuma: \"Disinikah Nabi shallallahu 'alaihi wasallam memerintahkan kamu untuk menancapkan bendera?",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 2977,
			"arabicnumber": 2977,
			"text": "Telah bercerita kepada kami [Yahya bin Bukair] telah bercerita kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku diutus dengan jawami'ul kalim (ucapan singkat namun sarat makna), aku ditolong dengan rasa ketakutan (musuh) dan ketika aku bermimpi aku diberikan kunci-kunci perbendaharaan dunia (kemenangan) lalu diletakkan di tanganku\". Abu Hurairah radliallahu 'anhu berkata: \"Rasulullah shallallahu 'alaihi wasallam telah pergi dan kalianlah yang akan menuainya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 2978,
			"arabicnumber": 2978,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata telah bercerita kepadaku ['Ubaidullah bin 'Abdullah] bahwa [Ibnu 'Abbas radliallahu 'anhuma] mengabarkan kepadanya bahwa [Abu Sufyan] mengabarkan kepadanya tentang Raja Heraklius mengutus seorang utusan kepadanya saat mereka (rombongan Quraaisy) berada di Iyliya' lalu sang raja memanggilnya (untuk mendengarkan) surat dari Rasulullah shallallahu 'alaihi wasallam. Setelah dia selesai membaca surat tersebut seketika terjadi kegaduhan dan terdengar suara ribut dan akhirnya kami diusir keluar (dari majelis pertemuan tersebut). Maka kemudian aku katakan kepada teman-temanku ketika kami diusir: \"Sungguh besar perkara anak Abu Kabsyah ini. Dia ditakuti oleh Raja Bani Ashfar (Bangsa berkulit kuning/Romawi)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 2979,
			"arabicnumber": 2979,
			"text": "Telah bercerita kepada kami ['Ubaid bin ISma'il] telah bercerita kepada kami [Abu Usamah] dari [Hisyam] berkata telah bercerita kepadaku [bapakku] dan juga telah bercerita kepadaku [Fathimah] dari [Asma' radliallahu 'anha] berkata: \"Aku menyiapkan bekal perjalanan Rasulullah shallallahu 'alaihi wasallam di rumah Abu Bakar ketika Beliau hendak melakukan hijrah ke Madinah\". Dia berkata: \"Dan kami tidak mendapatkan kain untuk mengikat bekal makanan dan minum Beliau. Lalu aku katakan kepada Abu Bakar: \"Demi Allah, aku tidak mendapatkan sesuatu untuk mengikat perbekalan tersebut kecuali kain ikat pinggangku\". Abu Bakar berkata: \"Kalau begitu kamu potong dua kain ikat pinggangmu itu dimana yang sepotong kamu gunakan untuk mengikat (wadah) air dan yang sepotong lagi untuk mengikat bekal makanan\". Maka kemudian aku melaksanakannya\". Karena peristiwa itu kemudian (Asma radliallahu 'anha) dipanggil dengan julukan Dzaatun Nathaqoin (Pemilik dua potong kain ikat pinggang)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 2980,
			"arabicnumber": 2980,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah mengabarkan kepada kami [Sufyan] dari ['Amru] berkata telah bercerita kepadaku ['Atha'] dia mendengar [Jabir bin 'Abdullah radliallahu 'anhuma] berkata: \"Kami membawa bekal berupa daging-daging hewan qurban pada zaman Nabi shallallahu 'alaihi wasallam (ketika berhijrah) ke Madinah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 2981,
			"arabicnumber": 2981,
			"text": "Telah bercerita kepada kami [Muhammad bin Al Mutsannaa] telah bercerita kepada kami ['Abdul Wahhab] berkata aku mendengar [Yahya] berkata telah bercerita kepadaku [Busyair binYasar] bahwa [Suwaid bin An Nu'man radliallahu 'anhu] mengabarkan kepadanya bahwa dia pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam pada tahun perang Khaibar hingga ketika mereka sampai di daerah Ash-Shohba', yaitu sebuah tempat dekat dengan Khaibar yang merupakah dataran rendah, mereka mendirikan shalat 'Ashar lalu Nabi shallallahu 'alaihi wasallam meminta makanan namun tidak ada yang dapat diberikan kepada Nabi shallallahu 'alaihi wasallam kecuali makanan yang terbuat dari adonan gandum. Lalu makanan itu kami edarkan ke mulut-mulut kami (untuk dimakan) sehingga kami makan dan minum (hingga kenyang). Kemudian Nabi shallallahu 'alaihi wasallam bangkit lalu berkumur-kumur. Maka kamipun berkumur lalu kami mendirikan shalat",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 2982,
			"arabicnumber": 2982,
			"text": "Telah bercerita kepada kami [Bisyir bin Marhum] telah bercerita kepada kami [Hatim bin Isma'il] dari [Yazid bin Abu 'Ubaid] dari [Salamah radliallahu 'anhu] berkata: \"Perbekalan orang-orang menipis dan mereka kekurangan air dan makanan, lalu mereka mendatangi Nabi shallallahu 'alaihi wasallam meminta ijin untuk menyembelih unta mereka, Beliaupun mengijinkannya. Lalu 'Umar datang menemui mereka dan mereka mengabari hal itu padanya, lalu ia berkata; \"Apakah ada lagi bekal kalian setelah unta kalian habis\". Lalu dia menemui Nabi shallallahu 'alaihi wasallam dan berkata: \"Wahai Rasulullah, apakah mereka dapat bertahan hidup setelah mereka menyembelih unta mereka?\" Maka Rasulullah shallallahu 'alaihi wasallam berkata: \"Panggillah orang-orang agar mereka membawa sisa-sisa bekal makaan mereka kemari\". Maka Beliau berdo'a serta memohon berkah, lalu Beliau memanggil mereka agar membawa bejana mereka masing-masing. Maka orang-orang pun mengambil bagiannya (sebanyak genggaman tangan) hingga mereka mendapatkan semua, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku bersaksi bahwa tidak ada Ilah yang berhak disembah kecuali Allah dan aku adalah Rasululloh",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 2983,
			"arabicnumber": 2983,
			"text": "Telah bercerita kepada kami [Shadaqah bin Al Fadhal] telah mengabarkan kepada kami ['Abdah] dari [Hisyam] dari [Wahb bin Kaisan] dari [Jabir bin 'Abdullah radliallahu 'anhuma] berkata; Kami keluar dalam rambongan berjumlah tiga ratus orang dengan membawa perbekalan di atas pundak-pundak kami. Kemudian bekal kami habis hingga ada seseorang dari kami yang dalam setiap harinya hanya makan sebutir kurma. Ada seseorang yang bertanya: \"Wahai Abu 'Abdullah, kemana kurma-kurma yang ada pada laki-laki tadi?\" Abu 'Abdullah berkata: \"Sungguh kami menemukannya sudah habis bersamaan habisnya bekal kami hingga kami mendatangi laut dan ternyata ada seekor ikan hiu yang terlempar oleh ombak lautan. Lalu kami memakannya selama delapan belas hari yang merupakan saat-saat kami sukai",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 2984,
			"arabicnumber": 2984,
			"text": "Telah bercerita kepada kami ['Amru bin 'Ali] telah bercerita kepada kami [Abu 'Ashim] telah bercerita kepada kami ['Utsman bin Al Aswad] telah bercerita kepada kami [Ibnu Abi Mulaikah] dari ['Aisyah radliallahu 'anha] bahwa dia berkata: \"Wahai Rasulullah, para sahabat Tuan telah kembali dengan membawa pahala haji dan 'umrah sedangkan aku belum menyempurnakan haji\". Maka Beliau berkata: \"Pergilah kamu dan hendaklah 'Abdur Rahman (kakak Aisyah) memboncengkanmu\". Maka Beliau memerintahkan 'Abdur Rahman agar mengantarnya untuk melaksanakan 'umrah dari At-Tan'im dan Rasulullah shallallahu 'alaihi wasallam menunggunya di ujung kota Makkah hingga 'Aisyah radliallahu 'anha datang",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 2985,
			"arabicnumber": 2985,
			"text": "Telah bercerita kepadaku ['Abdullah bin Muhammad] telah bercerita kepada kami [Ibnu 'Uyainah] dari ['Amru bin Dinar] dari ['Amru bin Aus] dari ['Abdur Rahman bin Abu Bakar Ash-Shiddiq radliallahu 'anhuma] berkata; \"Nabi shallallahu 'alaihi wasallam memerintahkan aku agar memboncengkan 'Aisyah untuk melaksanakan 'umrah dari at-Tan'im",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 2986,
			"arabicnumber": 2986,
			"text": "Telah bercerita kepada kami [Qutaibah bin Sa'id] telah bercerita kepada kami ['Abdul Wahhab] telah bercerita kepada kami [Ayub] dari [Abu Qilabah] dari [Anas radliallahu 'anhu] berkata: \"Aku pernah memboncengi Abu Thalhah saat mereka bertalbiyah dengan suara keras untuk hajji dan 'umrah sekaligus",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 2987,
			"arabicnumber": 2987,
			"text": "Telah bercerita kepada kami [Qutaibah] telah bercerita kepada kami [Abu Shofwan] dari [Yunus bin Yazid] dari [Ibnu Syihab] dari ['Urwah] dari [Usamah bin Zaid radliallahu 'anhuma] bahwa Rasulullah shallallahu 'alaihi wasallam mengendarai keledai diatas pelana yang terbuat dari kain yang lebar lalu memboncengkan Usamah dibelakangnya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 2988,
			"arabicnumber": 2988,
			"text": "Telah bercerita kepada kami [Yahya bin Bukair] telah bercerita kepada kami [Al Laits] berkata [Yunus] telah mengabarkan kepadaku [Nafi'] dari ['Abdullah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam datang pada Hari Penaklukan dari ujung Makkah dengan menunggang hewan tunggangannya dengan membonceng Usamah bin Zaid dan bersama Beliau ada Bilal, 'Utsman bin Thalhah sekembalinya dari Al Hajbah (juru kunci dan pengurus Ka'bah) kemudian Belia menyuruh untanya berlutut di depan masjid, lalu Beliau memerintahkan agar membawakan kunci Baitullah (Ka'bah) kemudian Rasulullah shallallahu 'alaihi wasallam membukanya lalu masuk bersama Usamah dan Bilal serta 'Utsman. Beliau berada didalamnya sepanjang siang itu lalu keluar. Maka orang-orang berebut untuk dapat masuk dan 'Abdullah bin 'Umar adalah orang yang pertama masuk dari mereka lalu dia mendapatkan Bilal di balik pintu sedang berdiri maka dia menanyakannya dimana Rasulullah shallallahu 'alaihi wasallam melaksanakan shalat. Maka Bilal memberi isyarat ke suatu tempat dimana Beliau shalat\". 'Abdullah berkata: \"Aku lupa bertanya kepada Bilal berapa raka'at Beliau melaksanakan shalat di dalam Ka'bah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 2989,
			"arabicnumber": 2989,
			"text": "Telah bercerita kepadaku [Ishaq] telah mengabarkan kepada kami ['Abdur Rozzaq] telah mengabarkan kepada kami [Ma'mar] dari [Hammam] dari [Abu Hurairah radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap ruas tulang pada manusia wajib atasnya shadaqah dan setiap hari terbitnya matahari seseorang yang mendamaikan antara dua orang yang bertikai adalah shadaqah dan menolong seseorang untuk menaiki hewan tunggangannya lalu mengangkat barang-barangnya ke atas hewan tungganyannya adalah shadaqah dan ucapan yang baik adalah shadaqah dan setiap langkah yang dijalankan munuju shalat adalah shadaqah dan menyingkirkan sesuatu yang bisa menyakiti atau menghalngi orang dari jalan adalah shadaqah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 2990,
			"arabicnumber": 2990,
			"text": "Telah bercerita kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar radliallahu 'anhuma] bahwa Rasulullah shallallahu 'alaihi wasallam melarang bepergian dengan membawa Al Qur'an ke negeri musuh",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 2991,
			"arabicnumber": 2991,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Sufyan] dari [Ayyub] dari [Muhammad] dari [Anas radliallahu 'anhu] berkata Nabi shallallahu 'alaihi wasallam mendatangi Khaibar pada waktu shubuh dimana penduduk Khaibar sedang keluar dengan membawa alat bertani (cangkul, sekop dhl) diatas leher (pundak-pundak) mereka. Tatkala mereka melihat Beliau shallallahu 'alaihi wasallam, mereka berkata: \"Muhammad dan pasukannya, Muhammad dan pasukannya\". Lalu mereka berlindung di balik benteng. Lalu Nabi shallallahu 'alaihi wasallam mengangkat kedua belah tangan Beliau dan berdo'a: \"Allahu Akbar, hancurlah Khaibar. Sesungguhnya kami apabila mendatangi perkampungan suatu kaum, maka amat buruklah pagi hari yang dialami orang-orang yang diperingatkan tersebut\". Kemudian kami mendapatkan keledai-keledai sebagai harta rampasan perang) lalu kami memasaknya. Kemudian seorang penyeru Nabi shallallahu 'alaihi wasallam berseru: \"Sesungghnya Allah dan Rosul-Nya telah melarang kalian memakan daging-daging keledai\". Hingga akhirnya seluruh kuali (bejana untuk memasak) beserta isinya ditumpahkan. Hadits ini juga ditelusuri oleh ['Ali] dari [Sufyan]: \" Nabi shallallahu 'alaihi wasallam mengangkat kedua belah tangan Beliau",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 2992,
			"arabicnumber": 2992,
			"text": "Telah bercerita kepada kami [Muhammad bin Yusuf] telah bercerita kepada kami [Sufyan] dari ['Ashim] dari [Abu 'Utsman] dari [Abu Musa Al Asy'ariy radliallahu 'anhu] berkata; Kami pernah bepergian bersama Rasulullah shallallahu 'alaihi wasallam dan apabila menaiki bukit kami bertalbiyah dan bertakbir dengan suara yang keras. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai sekalian manusia, rendahkanlah diri kalian karena kalian tidak menyeru kepada Dzat yang tuli dan juga bukan Dzat yang jauh. Dia selalu bersama kalian dan Dia Maha Mendengar lagi Maha Dekat. Maha suci nama-Nya dan Maha Tinggi kebesaran-Nya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 2993,
			"arabicnumber": 2993,
			"text": "Telah bercerita kepada kami [Muhammad bin Yusuf] telah bercerita kepada kami [Sufyan] dari [Hushain bin 'Abdur Rahman] dari [Salim bin Abu Al Ja'di] dari [Jabir bin 'Abdullah radliallahu 'anhuma] berkata: \"Apabila kami berjalan mendaki (naik), kami bertakbir dan apabila menuruni jalan kami bertasbih",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 2994,
			"arabicnumber": 2994,
			"text": "Telah bercerita kepada kami [Muhammad bin Basysyar] telah bercerita kepada kami [Ibnu Abi 'Adiy] dari [Syu'bah] dari [Hushain] dari [Salim] dari [Jabir radliallahu 'anhu] berkata: \"Apabila kami berjalan mendaki (naik), kami bertakbir dan apabila menuruni jalan kami bertasbih",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 2995,
			"arabicnumber": 2995,
			"text": "Telah bercerita kepada kami ['Abdullah] berkata telah bercerita kepadaku ['Abdul 'Aziz bin Abu Salamah] dari [Shalih bin Kaisan] dari [Salim bin 'Abdullah] dari ['Abdullah bin 'Umar radliallahu 'anhu] berkata: \"Adalah Nabi shallallahu 'alaihi wasallam apabila kembali dari hajji atau 'umrah\". Salim berkata: Aku tidak mengetahui kecuali dia berkata: \"dari peperangan, setelah turun dari tempat ketinggian atau bukit bebatuan, Beliau bertakbir tiga kali lalu bedo'a: \"LAA ILAAHA ILLA ALLAHU WAHDAHU LAA SYARIIKA LAH LAHUL MULKU WA LAHUL HAMDU WAHUWA 'ALAA KULLI SYAIN QADIIR AAYIBUUN TAAIBUUN 'AABIDUUN SAAJIDUUN LIRABBINAA HAAMIDUUN, SHADAQALLAHU WA'DAHU WANASHARA 'ABDAHU WA HAZAMAL AHZAABA WAHDAH\". (Tidak ada ilah yang berhak disembah selain Allah satu-satunya, tidak ada sekutu bagi-Nya. Milik-Nya segala kerajaan, dan pujian dan Dia Maha Berkuasa atas segala sesuatu. Kita kembali, sebagai hamba yang bertaubat, ber'ibadah, sujud untuk Robb kita dan yang memuji-Nya. Allah Maha Benar dengan janji-Nya, menolong hamba-Nya dan menghancurkan sendiri musuh-musuh-Nya) \". Shalih berkata; Maka aku bertanya kepada Salim: \"Apakah 'Abdullah tidak berkata insya Allah?\" Salim berkata: \"Tidak",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 2996,
			"arabicnumber": 2996,
			"text": "Telah bercerita kepada kami [Mathar bin Al Fadhl] telah bercerita kepada kami [Yazid bin Harun] telah bercerita kepada kami ['Al 'Awwam] telah bercerita kepada kami [Ibrahim Abu Isma'il As-Saksakiy] berkata; Aku mendengar [Abu Burdah] pernah bersama dengan Yazid bin Abi Kabsyah dalam suatu perjalanan dimana Yazid tetap berpuasa dalam safar, lalu Abu Burdah berkata; \"Aku sering mendengar berkali-kali [Abu Musa] berkata; Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Jika seorang hamba sakit atau bepergian (lalu beramal) ditulis baginya (pahala) seperti ketika dia beramal sebagai muqim dan dalam keadaan sehat",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 2997,
			"arabicnumber": 2997,
			"text": "Telah bercerita kepada kami [Al Humaidiy] telah bercerita kepada kami [Sufyan] telah bercerita kepada kami [Muhammad bin Al Munkadir] berkata; aku mendengar [Jabir bin 'Abdullah radliallahu 'anhuma] berkata; Pada hari perang Khandaq, Nabi shallallahu 'alaihi wasallam meminta manusia untuk melakukan tugas tertentu maka Az Zubair yang mengambil tugas tersebut. Kemudian Beliau kembali meminta mereka membantu Beliau dalam tugas tertentu dan Az Zubairlah yang melaksanakannya lalu kembali Beliau meminta bantuan maka sekali lagi Az Zubairlah yang melaksanakannya. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya setiap Nabi memiliki Hawariy, dan hawariyku adalah Az Zubair\". Sufyan berkata: \"al-Hawariy artinya an-Naashir (penolong)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 2998,
			"arabicnumber": 2998,
			"text": "Telah bercerita kepada kami [Abu Al Walid] telah bercerita kepada kami ['Ashim bin Muhammad] berkata telah bercerita kepadaku [bapakku] dari [Ibnu 'Umar radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam. Dan diriwayatkan pula, telah bercerita kepada kami [Abu Nu'aim] telah bercerita kepada kami ['Ashim bin Muhammad bin Zaid bin 'Abdullah bin 'Umar] dari [bapaknya] dari [Ibnu 'Umar radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Seandainya manusia mengetahui apa yang terdapat dalam bepergian sendirian seperti apa yang aku ketahui, tentu seorang penunggang kendaraan tidak akan bepergian di malam hari sendirian",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 2999,
			"arabicnumber": 2999,
			"text": "Telah bercerita kepada kami [Muhammad bin Al Mutsannaa] telah bercerita kepada kami [Yahya] dari [Hisyam] berkata telah mengabarkan kepadaku [bapakku] berkata; [Usamah bin Zaid radliallahu 'anhuma] pernah ditanya -Yahya berkata; aku mendengarnya lalu hilang dariku (lupa) - tentang cara berjalan Nabi shallallahu 'alaihi wasallam saat haji wada'. Dia menjawab: \"Beliau berjalan dengan 'anaq (sedang, tidak lambat tidak cepat) dan apabila sampai di daerah dataran yang luas Beliau berjalan dengan nashshu. Dan nashsh maksudnya adalah berjalan sedikit lebih cepat dari 'anaq",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 3000,
			"arabicnumber": 3000,
			"text": "Telah bercerita kepada kami [Sa'id bin Abu Maryam] telah mengabarkan kepada kami [Muhammad bin Ja'far] berkata telah mengabarkan kepadaku [Zaid, dia adalah putra dari Aslam] dari [bapaknya] berkata; \"Aku pernah bersama ['Abdullah bin 'Umar radliallahu 'anhuma] di suatu jalan menuju kota Makkah lalu sampai berita kepadanya bahwa Shofiyah binti Abi 'Ubaid menderita sakit keras. Maka dia mempercepat jalannya hingga ketika syafaq (warna merah di langit) telah hilang dia berhenti lalu shalat Maghrib dan 'Atmah ('Isya') dengan menjama' keduanya kemudian berkata: \"Aku melihat Nabi shallallahu 'alaihi wasallam apabila mendesak perjalanannya, Beliau mengakhirkan shalat Maghrib lalu menjama' keduanya (dengan 'Isya)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 3001,
			"arabicnumber": 3001,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Sumayya, maula Abu Bakar] dari [Abu Shalih] dari [Abu Hurairah radliallahu 'anhu] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Safar (bepergian) itu bagian (setengah) dari adzab (siksa) karena jika seorang dari kalian bepergian terkurangi tidur, makan dan minumnya. Apabila salah seorang dari kalian telah menyelesaikan urusannya (saat bepergian) hendaklah dia segera kembali kepada keluarganya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 3002,
			"arabicnumber": 3002,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar radliallahu 'anhuma] bahwa 'Umar bin Al Khaththab menshadaqahkan kuda di jalan Allah namun kemudian dia mendapatkan kuda itu dijual lalu dia berkehendak untuk membelinya. Akhirnya dia bertanya kepada Rasulullah shallallahu 'alaihi wasallam, maka Beliau bersabda: \"Janganlah kamu beli dan jangan kamu ambil lagi shadaqah kamu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 3003,
			"arabicnumber": 3003,
			"text": "Telah bercerita kepada kami [Isma'il] telah bercerita kepadaku [Malik] dari [Zaid bin Aslam] dari [bapaknya] aku mendengar ['Umar bin Al Khaththab radliallahu 'anhu] berkata: \"Aku memberi (seseorang) kuda untuk agar digunakan di jalan Allah lalu orang itu menjualnya atau tidak memanfaatkan sebagaimana mestinya. Kemudian aku berniat membelinya kembali dan aku kira dia akan menjualnya dengan murah. Lalu aku tanyakan hal ini kepada Nabi shallallahu 'alaihi wasallam, maka Beliau bersabda: \"Jangan kamu membelinya sekalipun orang itu menjualnya dengan harga satu dirham, karena orang yang mengambil kembali hibahnya (pemberian) seperti anjing yang menjilat kembali ludahnya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 3004,
			"arabicnumber": 3004,
			"text": "Telah bercerita kepada kami [Adam] telah bercerita kepada kami [Syu'bah] telah bercerita kepada kami [Habib bin Abi Tsabit] berkata aku mendengar [Abu Al 'Abbas Asy-Sya'ir], dia adalah orang yang tidak buruk dalam hadits-hadits yang diriwayatkannya, berkata aku mendengar ['Abdullah bin 'Amru radliallahu 'anhuma] berkata: \"Datang seorang laki-laki kepada Nabi shallallahu 'alaihi wasallam lalu meminta izin untuk ikut berjihad. Maka Beliau bertanya: \"Apakah kedua orang tuamu masih hidup?\" Laki-laki itu menjawab: \"Iya\". Maka Beliau berkata: \"Kepada keduanyalah kamu berjihad (berbakti)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 3005,
			"arabicnumber": 3005,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari ['Abdullah bin Abu Bakar] dari ['Abbad bin Tamim] bahwa [Abu Basyir Al Anshoriy radliallahu 'anhu] mengabarkan kepadanya bahwa dia pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan Beliau. 'Abdullah berkata; \"Aku menduga dia berkata; \"dan ketika itu orang-orang sedang bermalam di tempat mereka\", lalu Rasulullah shallallahu 'alaihi wasallam mengutus seorang utusan agar tidak membiarkan pada leher-leher unta seutas talipun yang digunakan untuk mengikat panah atau seuatas kalung melainkan harus dipotong",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 3006,
			"arabicnumber": 3006,
			"text": "Telah bercerita kepada kami [Qutaibah bin Sa'id] telah bercerita kepada kami [Sufyan] dari ['Amru] dari [Abu Ma'bad] dari [Ibnu 'Abbas radliallahu 'anhuma] bahwa dia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah sekali-kali seorang laki-laki berkholwat (berduaan) dengan seorang wanita dan janganlah sekali-kali seorang wanita bepergian kecuali bersama mahramnya\". Lalu ada seorang laki-laki yang bangkit seraya berkata: \"Wahai Rasulullah, aku telah mendaftarkan diriku untuk mengikutu suatu peperangan sedangkan istriku pergi menunaikan hajji\". Maka Beliau bersabda: \"Tunaikanlah hajji bersama istrimu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 3007,
			"arabicnumber": 3007,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufyan] telah bercerita kepada kami ['Amru bin DInar] aku mendengarnya darinya dua kali, berkata telah mengabarkan kepadaku [Hasan bin Muhammad] berkata telah mengabarkan kepadaku ['Ubaidullah bin Abi Rafi'] berkata aku mendengar [Ali radliallahu 'anhu] berkata: \"Rasulullah shallallahu 'alaihi wasallam mengutusku beserta Az Zubair dan Al Miqdad bin Al Aswad\". Beliau berkata: \"Berangkatlah kalian hingga sampai di taman Khokh karena disana ada seorang wanita berkendara yang dia membawa surat. Maka ambillah surat itu darinya\". Lalu kami berangkat hingga ketika tiba di taman, kami mendapatkan wanita itu, kami berkata kepadanya: \"Keluarkanlah surat?\" Wanita itu berkata: \"Tidak ada surat padaku \". Kami berkata: \"Kamu keluarkan surat itu atau kami lucuti pakaianmu\". Akhirnya dia mengeluarkan surat dari dalam sanggul rambutnya \". Lalu kami menemui Rasulullah shallallahu 'alaihi wasallam dengan membawa surat itu yang ternyata surat itu ditulis oleh Hathib bin Abi Balta'ah yang ditujukan kepada orang-orang musyrikin dari penduduk Makkah dimana dia mengabarkan tentang rencana Rasulullah shallallahu 'alaihi wasallam. Lalu Rasulullah shallallahu 'alaihi wasallam berkata: \"Wahai Hathib, apa yang kamu lakukan ini?\" Hathib berkata: \"Wahai Rasulullah, jangan terburu-buru bersikap kepadaku. Sesungguhnya aku adalah seorang yang terikat perjanjian dengan Quraisy sedang aku bukan bagian keluarga dari mereka. Sementara orang-orang yang bersama Tuan dari kalangan Muhajirin, mereka memiliki kerabat dari Makkah dimana keluarga mereka akan melindungi diri dan harta mereka dan aku ingin ketika aku sudah tidak memiliki nasab keturunan di tengah-tengah mereka ada yang aku jadikan dari mereka orang yang akan melindungi kerabatku. Tidaklah aku melakukan ini karena kufur dan tidak juga irtidad (berbalik meninggalkan Islam) dan juga bukan karena ridha dengan kekafiran setelah aku menerima Islam\". Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dia sudah berkata benar kepada kalian\". Lalu 'Umar berkata: \"Wahai Rasulullah, biarkan aku untuk memenggal batang leher munafiq ini\". Beliau berkata: \"Sungguh dia adalah termasuk orang yang ikut perang Badar. Tahukah kamu, bahwa Allah sudah membebaskan para pejuang perang Badar, dimana Dia berfirman: \"Berbuatlah sesuka kalian, sungguh Aku telah mengampuni kalian\". Sufyan berkata: \"Dari mana sanad-sanad ini? (Sufyan kagum dengan urutan sanad dan orang-orangnya yang sangat gamblang disebutkan)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 3008,
			"arabicnumber": 3008,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Ibnu 'Uyainah] dari ['Amru] dia mendengar [Jabir bin 'Abdullah radliallahu 'anhuma] berkata; Ketika terjadi perang Badar tawanan-tawanan perang didatangkan dan diantaranya Al 'Abbas yang tidak mengenakan pakaian. Kemudian Nabi shallallahu 'alaihi wasallam memandang perlu dicarikan baginya gamis (baju) lalu mereka mendapatkan gamis 'Abdullah bin Ubay yang cocok buat ukuran badannya. Kemudian Nabi shallallahu 'alaihi wasallam memberikan gamis itu kepada Al 'Abbas maka itu Nabi shallallahu 'alaihi wasallam melepas gamis yang dipakaikannya (kepada 'Abdullah bin Ubay saat pemakamannya di kemudian hari). Ibnu 'Uyainah berkata: 'Abdullah bin Ubay pernah punya jasa kepada Nabi shallallahu 'alaihi wasallam sehingga Beliau suka untuk membalasnya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 3009,
			"arabicnumber": 3009,
			"text": "Telah bercerita kepada kami [Qutaibah bin Sa'id] telah bercerita kepada kami [Ya'qub bin 'Abdur Rahman bin Muhammad bin 'Abdullah bin 'Abdul Qoriy] dari [Abu Hazim] berkata telah mengabarkan kepadaku [Sahal radliallahu 'anhu, yakni putra dari Sa'ad] berkata; Nabi shallallahu 'alaihi wasallam bersabda ketika perang Khaibar: \"Sungguh bendera perang ini akan aku berikan esok hari kepada seseorang yang peperangan ini akan dimenangkan melalui tangannya. Orang itu mencintai Allah dan Rosul-Nya dan Allah dan Rosul-Nya juga mencintainya\". Maka orang-orang melalui malam mereka dengan bertanya-tanya siapa yang akan diberikan kepercayaan itu. Keesokan harinya setiap orang dari mereka berharap diberikan kepercayaan itu. Maka Beliau berkata: \"Mana 'Ali?\" Dijawab: \"Dia sedang sakit kedua matanya\". Maka (setelah 'Ali datang) Beliau meludahi kedua matanya lalu mendo'akannya hingga sembuh seakan-akan belum pernah terkena penyakit sedikitpun. Lalu Beliau memberikan bendera perang kepadanya kemudian bersabda: \"Perangilah mereka hingga mereka menjadi seperti kita (Muslim) \". Beliau melanjutkan: \"Melangkahlah ke depan hingga kamu memasuki tempat tinggal mereka lalu serulah mereka ke dalam Islam dan beritahu kepada mereka tentang apa yang diwajibkan atas mereka. Demi Allah, bila ada satu orang saja yang mendapat petunjuk melalui dirimu maka itu lebih baik bagimu dari pada unta-unta merah (yang paling bagus)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 3010,
			"arabicnumber": 3010,
			"text": "Telah bercerita kepada kami [Muhammad bin Basysyar] telah bercerita kepada kami [Ghundar] telah bercerita kepada kami [Syu'bah] dari [Muhammad bin Ziyad] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Allah heran terhadap suatu kaum yang masuk surga dalam keadaan terbelenggu\". (Ketika di dunia sebagai musuh yang kafir lalu menjadi tawanan dan dibelenggu lalu masuk Islam)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 3011,
			"arabicnumber": 3011,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufyan bin 'Uyainah] telah bercerita kepada kami [Shalih bin Hayyi Abu Hasan] berkata aku mendengar [Asy-Sya'biy] berkata telah bercerita kepadaku [Abu Burdah] bahwa dia mendengar [bapaknya] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Ada tiga kelompok manusia yang akan diberi pahala dua kali. (Yang pertama) seorang laki-laki yang memiliki seorang budak wanita dimana dia mengajarinya dengan pengajaran yang baik kemudian mendidik dengan pendidikan yang baik lalu dia membebaskannya kemudian menikahinya. Maka bagi orang ini mendapat dua pahala. (Yang kedua) mu'min dari kalangan Ahlul Kitab dimana sebelumnya dia adalah orang yang beriman kemudian dia beriman kepada Nabi shallallahu 'alaihi wasallam, maka baginya dua pahala. Dan (yang ketiga) seorang budak yang menunaikan hak-hak Allah dan juga setia kepada tuannya\". Kemudian Asy-Sya'biy berkata: \"Aku berikan dia kepadamu tanpa imbalan sedikitpun\". Orang yang diberikannya itu adalah seorang yang sedang menempuh perjalanan menuju Madinah dalam keadaan sangat lemah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 3012,
			"arabicnumber": 3012,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufyan] telah bercerita kepada kami [Az Zuhriy] dari ['Ubaidullah] dari [Ibnu 'Abbas] dari [Ash-Sho'bu bin Jatsamah radliallahu 'anhum] berkata; Nabi shallallahu 'alaihi wasallam berjalan melewatiku di Al Abwa' atau di Waddan, Beliau ditanya tentang kaum musyrikin penduduk suatu negeri yang diserbu lalu para wanita dan anak keturunan mereka terbunuh. Beliau menjawab: \"Mereka termasuk dari golongan mereka\" (musyrikin yang berhak diperangi). Dan aku mendengar Beliau bersabda: \"Tidak ada perlindungan kecuali milik Allah dan Rosul-Nya shallallahu 'alaihi wasallam\". Dan dari [Az Zuhriy] bahwa dia mendengar ['Ubaidullah] dari [Ibnu 'Abbas] telah bercerita kepada kami [Ash-Sho'bu] tentang anak keturunan dimana ['Amru] bercerita kepada kami dari [Ibnu Syihab] dari Nabi shallallahu 'alaihi wasallam dan kami mendengarnya dari [Az Zuhriy] berkata telah mengabarkan kepadaku ['Ubaidullah] dari [Ibnu 'Abbas] dari [Ash-Sho'bu] berkata: \"Mereka dari golongan mereka\" dan tidak berkata seperti yang dikatakan 'Amru: Mereka dari bapak-bapak mereka",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 3013,
			"arabicnumber": 3013,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 3014,
			"arabicnumber": 3014,
			"text": "Telah bercerita kepada kami [Ahmad bin Yunus] telah mengabarkan kepada kami [Al Laits] dari [Nafi'] bahwa ['Abdullah radliallahu 'anhu] mengabarkan kepadanya bahwa ada seorang wanita yang ditemukan (dalam keadaan terbunuh) di sebagian peperangan Nabi shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam mengingkari pembunuhan terhadap wanita dan anak-anak",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 3015,
			"arabicnumber": 3015,
			"text": "Telah bercerita kepada kami [Ishaq bin Ibrahim] berkata; Aku berkata kepada [Abu Usamah] bahwa ['Ubaidullah] telah bercerita kepada kalian dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] yang berkata: Telah ditemukan seorang wanita dalam keadaan terbunuh di sebagian peperangan Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam melarang pembunuhan terhadap wanita dan anak-anak",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 3016,
			"arabicnumber": 3016,
			"text": "Telah bercerita kepada kami [Qutaibah bin Sa'id] telah bercerita kepada kami [Al Laits] dari [Bukair] dari [Sulaiman bin Yasar] dari [Abu Hurairah radliallahu 'anhu] bahwa dia berkata; Rasulullah shallallahu 'alaihi wasallam mengutus kami dalam pengiriman pasukan, maka Beliau bersabda: \"Jika kalian menemukan si anu dan si anu maka bakarlah keduanya dengan api\". Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda ketika kami hendak berangkat (keesokan harinya): \"Sungguh aku telah memerintahkan kalian agar membakar si anu dan si anu dan sesungguhnya tidak boleh ada yang menyiksa dengan api kecuali Allah.. Maka itu, bila kalian menemukan keduanya maka bunuhlah keduanya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 3017,
			"arabicnumber": 3017,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufyan] dari [Ayyub] dari ['Ikrimah] bahwa 'Ali radliallahu 'anhu membakar suatu kaum lalu berita itu sampai kepada [Ibnu 'Abbas] maka dia berkata: \"Seandainya aku ada, tentu aku tidak akan membakar mereka karena Nabi shallallahu 'alaihi wasallam telah bersabda: \"Janganlah kalian menyiksa dengan siksaan Allah (dengan api) \". Dan aku hanya akan membunuh mereka sebagaimana Nabi shallallahu 'alaihi wasallam telah bersabda: \"Siapa yang mengganti agamanya maka bunuhah dia",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 3018,
			"arabicnumber": 3018,
			"text": "Telah bercerita kepada kami [Mu'allaa bin Asad] telah bercerita kepada kami [Wuhaib] dari [Ayyub] dari [Abu Qilabah] dari [Anas bin Malik radliallahu 'anhu] bahwa; Ada rambongan pasukan berjumlah sekitar delapan orang yang menghadap Nabi shallallahu 'alaihi wasallam lalu mereka terkena penyakit yang sedang mewabah di Madinah. Mereka berkata: \"Wahai Rasulullah, bantulah kami untuk mendapatkan susu unta\". Beliau berkata: \"Aku tidak dapat membantu kalian kecuali jika kalian memberikan sekitar tiga sampai sepuluh ekor unta\". Maka mereka berangkat mencarinya lalu mereka meminum air seni unta-unta itu dan susunya hingga mereka menjadi sehat dan menjadi gemuk-gemuk, Kemudian mereka membunuh pengembala unta itu dan mencuri unta-unta tadi serta mereka kembali menjadi kafir setelah Islam. Maka Beliau mengutus orang untuk mencari mereka dan akhirnya sebelum matahari meninggi pada siang hari itu mereka didatangkan. Maka tangan-tangan dan kaki-kaki mereka dipotong lalu Beliau memerintahkan untuk membawa paku yang dipanaskan lalu mereka dipaku dengannya dan dijemur dibawah panas terik hingga mereka meminta minum namun tidak diberi hingga mereka mati. Abu Qilabah berkata: \"Mereka telah membunuh dan mencuri serta memerangi Allah dan Rosul-Nya shallallahu 'alaihi wasallam dan telah berbuat kerusakan di muka bumi",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 3019,
			"arabicnumber": 3019,
			"text": "Telah bercerita kepada kami [Yahya bin Bukair] telah bercerita kepada kami [A-Laits] dari [Yunus] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dan [Abu Salamah] bahwa [Abu Hurairah radliallahu 'anhu] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada semut yang menggigit seorang Nabi dari Nabi-Nabi terdahulu lalu Nabi itu memerintahkan agar membakar sarang semut-semut itu maka kemudian Allah mewahyukan kepadanya, firman-Nya: \"Hanya karena gigitan sesekor semut makai kamu telah membakar suatu kaum yang bertasbih",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 3020,
			"arabicnumber": 3020,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Yahya] dari [Isma'il] berkata telah bercerita kepadaku [Qais bin Abi Hazim] berkata, [Jarir] berkata kepadaku, bahwa Rasulullah shallallahu 'alaihi wasallam telah berkata kepadaku: \"Bisakah kamu membuat aku dapat beristirahat dari urusan Dzul Khalashah\". Yang Beliau maksud adalah sebuah rumah di Khots'am yang dinamakan Ka'bah Al Yamaniyah (dijadikan sebagai kiblat dan didalamnya banyak patung yang disembah). Jarir berkata: \"Maka aku berangkat dalam rambongan berjumlah seratus lima puluh pasukan berkuda dari suku Ahmas yang gagah berani. Mereka adalah para penunggang kuda yang ulung. Jarir berkata: \"Saat itu aku adalah orang yang tidak ahli menunggang kuda hingga akhirnya Beliau memukul dadaku hingga aku lihat bekas jari tangan Beliau di dadaku\". Kemudian Beliau berdo'a: \"Ya Allah mantapkanlah dia dan jadikanlah dia seorang pemberi petunjuk yang senantiasa mendapatkan petunjuk\". Maka Jarir berangkat menuju rumah yang dimaksud lalu merusak dan membakarnya. Kemudia dia mengutus utusan untuk menemui Rasulullah shallallahu 'alaihi wasallam dan mengabarkan apa yang sudah terjadi. Utusan Jarir berkata: \"Demi Dzat Yang Mengutus Tuan dengan haq, tidaklah aku menemui Tuan melainkan aku telah meninggalkan rumah tersebut seolah seperti unta yang berlobang atau kudisan (sebutan untuk kehancuran rumah tersebut karena telah dibakar). Jarir berkata: \"Maka Beliau shallallahu 'alaihi wasallam mendo'akan keberkahan kepada kuda kuda dan orang-orang suku Ahmas sebanyak lima kali",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 3021,
			"arabicnumber": 3021,
			"text": "Telah bercerita kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] berkata; Nabi shallallahu 'alaihi wasallam membakar (kebun) pohon kurma milik Yahudi Bani An Nadhir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 3022,
			"arabicnumber": 3022,
			"text": "Telah bercerita kepada kami ['Ali bin Muslim] telah bercerita kepada kami [Yahya bin Zakariya' bin Abi Za'idah] berkata telah bercerita kepadaku [bapakku] dari [Abu Ishaq] dari [Al Bara' bin 'Azib radliallahu 'anhuma] berkata; Rasulullah shallallahu 'alaihi wasallam mengirim serambongan pasukan dari kalangan Anshor menemui Abu Rofi' untuk membunuhnya. Lalu seseorang dari mereka pergi dan memasuki benteng mereka. Dia berkata: \"Maka aku masuk di tempat mereka mengikat hewan terrnak mereka\". Dia berkata: \"Dan mereka menutup pintu benteng\". Kemudian mereka merasa kehilangan seekor keledai mereka, merekapun keluar mencarinya. Maka akupun keluar bersama orang-orang yang keluar dan aku memperlihatkan kepada mereka bahwa aku juga mencarinya bersama mereka. Akhirnya mereka mendapatkannya, lalu aku dan mereka masuk ke benteng serta menutup pintu pada malam hari. Kemudian mereka meletakkan kunci-kunci di lobang pintu seperti yang aku lihat. Ketika mereka tidur aku mengambil kunci-kunci itu dan membuka pintu. Lalu aku menemuinya dan aku berkata: \"Wahai Abu Rofi'\". Aku merubah suaraku. Dia menjawabku: \"Siapa kamu, celakalah bagi ibumu\". Aku katakan: \"Ada apa denganmu?\" Dia menjawab: \"Aku tidak tahu. Siapa orang yang masuk kepadaku?\" Maka dia memukulku. Dia berkata: \"Maka aku meletakkan pedangku diatas perutnya lalu aku membelah perutnya hingga patah tulang-tulangnya. Kemudian aku keluar, namun aku bingung hingga aku mendatangi tangga milik mereka agar aku dapat turun dari benteng itu. Namun aku terjatuh dan kakiku terkilir. Lalu aku keluar dan menemui para sahabatku. Aku berkata: \"Tadi malam aku bangun karena mendengar suara rintihan, aku bangun karena mendengar suara rintihan Abu Rofi', seorang pedagang dari ahli Hijaz. Kemudian aku berdiri tapi aku merasa sakit qolabah (akibat terkilir) hingga aku menemui Nabi shallallahu 'alaihi wasallam lalu kami mengabarkan peristiwa itu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 3023,
			"arabicnumber": 3023,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Yahya bin Adam] telah bercerita kepada kami [Yahya bin Abi Za'idah] dari [bapaknya] dari [Abu Ishaq] dari [Al Bara' bin 'Azib radliallahu 'anhuma] berkata; Rasulullah shallallahu 'alaihi wasallam mengirim pasukan dari kalangan Anshor untuk mendatangi Abu Rofi'. Maka kemudian 'Abdullah bin 'Atik memsuki rumahnya di malam hari lalu membunuhnya saat dia sedang tidur",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 3025,
			"arabicnumber": 3025,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 3026,
			"arabicnumber": 3026,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 3028,
			"arabicnumber": 3028,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 3029,
			"arabicnumber": 3029,
			"text": "Telah bercerita kepada kami [Abu Bakar Buur bin Ashrom] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah radliallahu 'anhu] berkata; Nabi Shallallahu'alaihiwasallam mengistilahkan perang adalah tipu daya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 3030,
			"arabicnumber": 3030,
			"text": "Telah bercerita kepada kami [Shodaqqoh bin Al Fadlol] telah mengabarkan kepada kami [Ibnu 'Uyainah] dari ['Amru] dia mendengar [Jabir bin 'Abdullah radliallahu 'anhuma] berkata; Nabi Shallallahu'alaihiwasallam bersabda: \"Perang adalah tipu daya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 3031,
			"arabicnumber": 3031,
			"text": "Telah bercerita kepada kami [Qutaibah bin Sa'id] telah bercerita kepada kami [Sufyan] dari ['Amru bin Dinar] dari [Jabir bin 'Abdullah radliallahu 'anhuma] bahwa Nabi Shallallahu'alaihiwasallam berkata \"Siapa yang dapat menghadapi Ka'ab bin Al Asyrof karena dia telah menyakiti Allah dan Rosul-Nya?\". Muhammad bin Maslamah berkata: \"Apakah Baginda suka bila aku membunuhnya, wahai Rasulullah?\". Beliau menjawab: \"Ya\". Dia berkata: \"Maka aku mendatanginya lalu Ka'b berkata: \"Orang ini, maksudnya Nabi Shallallahu'alaihiwasallam telah meminta tolong dan meminta shodaqoh kepada kita\". Dia berkata: \"Dan juga, demi Allah, pasti kamu akan meninggalkannya\". Kata Muhammad,: \"Sungguh kami telah mengikutinya dan kami tidak mau bila meninggalkannya hingga kami melihat apa yang akan terjadi dengan urusannya\". Dia berkata: \"Dia terus saja berkata-kata hingga setelah ada kesempatan Muhammad membunuhnya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 3032,
			"arabicnumber": 3032,
			"text": "Telah bercerita kepadaku ['Abdullah bin Muhammad] telah bercerita kepada kami [Sufyan] dari ['Amru] dari [Jabir] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Siapa yang dapat menghadapi Ka'ab bin Al Asyrof. Muhammad bin Maslamah berkata: \"Apakah Baginda suka bila aku membunuhnya, wahai Rasulullah?\". Beliau menjawab: \"Ya\". Dia berkata: \"Maka izinkanlah aku, sehingga akau bisa menyampaikan sesuatu\". Kata Maslamah selanjutnya: \"Aku sudah melaksanakannya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 3033,
			"arabicnumber": 3033,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 3034,
			"arabicnumber": 3034,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Abu Al Ahwash] telah bercerita kepada kami [Abu Ishaq] dari [Al Baro' radliallahu 'anhu] berkata; Aku melihat Nabi Shallallahu'alaihiwasallam pada perang Khondaq sedang mengangkut tanah hingga tanah itu menutup bulu dada Beliau. Beliau memang seorang yang berbulu lebat Saat itu Beliau menyenandungkan sya'ir 'Abdullah: \"Ya Allah, kalau bukan karena Engkau, tentu kami tidak akan mendapat petunjuk. Dan tidak akan pula kami bershodaqoh dan sholat\". Maka turunkanlah sakinah kepada kami dan teguhkanlah kaki berpijak kami karena kami sedang berhadapan\".\"Dengan musuh yang telah durjana terhadap kami. Jika mereka menghendaki fitnah terhadap kami, kami akan mengabaikannya\". Beliau menyenandungkannya dengan suara keras",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 3036,
			"arabicnumber": 3036,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 3037,
			"arabicnumber": 3037,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufan] telah bercerita kepada kami [Abu Hazim] berkata: \"Mereka bertanya kepada [Sahal bin Sa'ad as-Sa'idiy] radliallahu 'anhu: \"Dengan apa luka Nabi Shallallahu'alaihiwasallam diobati?\". Dia menjawab: \"Tidak ada seorangpun dari manusia yang masih hidup yang lebih mengetahui tentang hal itu selain aku. 'Ali membawakan air di dalam wajan sedangkan Fathimah yang membersihkan darah dari wajah Beliau, kemudian diambillah tikar dan dibakar (hingga menjadi abu) kemudian ditempelkan pada luka Rasulullah Shallallahu'alaiwasallam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 3038,
			"arabicnumber": 3038,
			"text": "Telah bercerita kepada kami [Yahya] telah bercerita kepada kami [Waki'] dari [Syu'bah] dari [Sa'id bin Abi Burdah] dari [bapaknya] dari [kakeknya] bahwa Nabi Shallallahu'alaihiwasallam mengutus Mu'adz dan Abu Musa ke negeri Yaman dan Beliau berpesan: \"Mudahkanlah (urusan) dan jangan dipersulit. Berilah kabar gembira dan jangan membuat orang lari (tidak tertarik) dan bekerja samalah kalian berdua dan jangan berselisih",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 3039,
			"arabicnumber": 3039,
			"text": "Telah bercerita kepada kami ['Amru bin Kholid] telah bercerita kepada kami [Zuhair] telah bercerita kepada kami [Abu Ishaq] berkata aku mendengar [Al Baro' bin 'Azib radliallahu 'anhuma] dia bercerita, katanya; Nabi Shallallahu'alaihiwasallam menunjuk 'Abdullah bin Jubair sebagai komandan pasukan pejalan kaki (pemanah) pada perang Uhud yang berjumlah lima puluh orang. Beliau berpesan: \"Jika kalian melihat kami disambar burung, maka janganlah kalian meninggalkan tempat kalian ini hingga aku mengirim utusan untuk memberi tahu. Dan jika kalian melihat kami mengalahkan musuh dan menginjak-injak mereka, maka janganlah kalian meninggalkan tempat kalian hingga aku mengirim utusan\". Akhirnya Kaum Muslimin dapat mengalahkan musuh mereka. Al Baro' berkata: \"Adapun aku, sungguh demi Allah, aku melihat para wanita (musuh) berlarian sehingga nampak perhiasan gelang di kaki-kaki mereka dan betis-betis mereka karena mereka mengangkat pakaian mereka\". Maka para anak buah 'Abdullah bin Jubair berkata: \"Itu ghonimah (rampasan perang), maksudnya para wanita itu sebagai ghonimah. Para shohabat kalian telah mengalahkan mereka, jadi, apa yang kalian tunggu?\". Maka 'Abdullah bin Jubair berkata: \"Apakah kalian lupa apa pesan Rasulullah Shallallahu'alaiwasallam kepada kalian?\". Mereka menjawab: \"Sungguh kita harus mendatangi mereka agar kita mendapatkan ghonimah\". Ketika mereka mendatangi pasukan yang di bawah, wajah-wajah mereka dipalingkan (dari tujuan utama) hingga mereka menjadi berlarian kocar-kacir. Begitulah peristiwa ketika Rasulullah Shallallahu'alaiwasallam memanggil mereka dari belakang mereka sedang saat itu tidak ada yang tersisa bersama Nabi Shallallahu'alaihiwasallam kecuali dua belas orang pasukan. Dari pihak kami yang gugur sebanyak tujuh puluh orang Sedangkan pada perang Badar, Nabi Shallallahu'alaihiwasallam dan para shohabat Beliau dapat mengalahkan seratus empat puluh pasukan Musyrikin yaitu tujuh puluh orang terbunuh dan tujuh puluh orang lagi menjadi tawanan. Saat itu Abu Sufyan berkata: \"Apakah di tengah-tengah pasukan ada Muhammad?\". Dia bertanya hingga tiga kali. Nabi Shallallahu'alaihiwasallam melarang para shohabat untuk menjawabnya. Lalu dia berkata lagi: \"Apakah di tengah-tengah pasukan ada Ibnu Abi Qohafah (Abu Bakar radliallahu 'anhu)?\" sebanyak tiga kali. Lalu dia berkata lagi: \"Apakah di tengah-tengah pasukan ada Ibnu Al Khoththob?\", tiga kali. Kemudian dia kembali menemui teman-temannya dan berkata: 'Mereka semua sudah terbunuh\". Maka 'Umar tidak dapat menahan emosinya lalu berkata: \"Kamu dusta. Demi Allah, wahai musuh Allah, sesungguhnya orang yang kamu cari semuanya masih hidup dan masih tersisa untuk menimpakan keburukan kepadamu\". Abu Sufyan berkata: \"Perang ini sebagai balas bagi perang Badar karena dalam perang kemenangan memang silih berganti. Sungguh kalian akan dapatkan kaum (kafirin) memutilasi jasad dan mencincang korban yang aku tidak memerintahkannya tapi aku juga tidak merisaukanku\". Kemudian Abu Sufyan mulai menyenandungkan sya'ir: \"Agunglah Hubal, agunglah Hubal\". Maka Nabi Shallallahu'alaihiwasallam berkata: \"Mengapa kalian tidak membalasnya?\". Para shohabat bertanya: \"Wahai Rasulullah, apa yang harus kami katakan?\". Beliau berkata: \"Ucapkanlah: Allah Yang Maha Agung lagi Maha Tinggi\". Abu Sufyan berkata lagi: \"Kami punya tuhan Hubal sedangkan kalian tidak punya\". Maka Nabi Shallallahu'alaihiwasallam berkata lagi: \"Mengapa kalian tidak membalasnya?\". Para shohabat bertanya: \"Wahai Rasulullah, apa yang harus kami katakan?\". Beliau berkata: \"Ucapkanlah: Allah Pelindung kami sedangkan kalian tidak punya pelindung",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 3040,
			"arabicnumber": 3040,
			"text": "Telah bercerita kepada kami [Qutaibah bin Sa'id] telah bercerita kepada kami [Hammad] dari [Tsabit] dari [Anas radliallahu 'anhu] berkata; Rasulullah Shallallahu'alaiwasallam adalah manusia yang paling baik, paling baik rupa penampilannya dan paling berani\". Anas berkata: \"Pernah penduduk Madinah ketakutan di malam hari ketika mereka mendengar suara huru-hara. Langsung Nabi Shallallahu'alaihiwasallam mendatangi mereka dengan menunggang kuda milik Abu Tholhah tanpa pelana dengan pedang tergantung di badan Beliau. Beliau berkata: \"Janganlah kalian takut, janganlah kalian takut\". Kemudian Beliau berkata lagi: \"Sungguh kudapatkan kuda ini sangat cepat larinya\". Yang Beliau maksudkan adalah kuda (yang ditunggangi Beliau padahal sebelumnya kuda itu sangat lamban)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 3041,
			"arabicnumber": 3041,
			"text": "Telah bercerita kepada kami [Al Makkiy bin Ibrohim] telah mengabarkan kepada kami [Yazid bin 'Ubaid] dari [Salamah] bahwa dia mengabarkan kepadanya, katanya: \"Aku keluar dari Madinah untuk pergi menuju hutan hingga ketika aku sudah berada didekat hutan tersebut, ada seorang anak kecil pelayan 'Abdur Rohman bin 'Auf yang menemuiku. Aku bertanya: \"Ada apa denganmu?\". Dia menjawab: \"Unta perahan milik Nabi Shallallahu'alaihiwasallam telah dirampok\". Aku tanya: \"Siapa yang mencurinya?\". Anak itu berkata: \"(Suku) Ghothofan dan Fazaroh\". Maka aku berteriak sebanyak tiga kali dengan teriakan yang dapat kuperdengarkan diantara dua bukit berbatu hitam. Aku katakan: \" \"Awas, ini pagi yang bahaya! Awas, ini pagi yang bahaya! kemudian aku terus berjalan cepat hingga mereka (musuh) bisa kususul lengkap dengan hewan Rampokannya. Sambil kulempari mereka, aku mengatakan \"Akulah Ibnul akwa', hari ini hari binasa bagi mereka itu!\" Maka aku dapat merebut kembali unta itu dari mereka sebelum mereka meminum susunya. Kemudian aku kembali dengan membawa unta itu. Selanjutnya Nabi Shallallahu'alaihiwasallam menemuiku dan kukatakan: \"Wahai Rasulullah, kaum itu kehausan dan aku dapat mendahului mereka sebelum meminumnya. Untuk itu, kirimlah pasukan untuk memburu jejak mereka!\". Maka Beliau Shallallahu'alaihiwasallam berkata: \"Wahai Ibnu Al Akwa', tahanlah emosimu dan bersikap lembutlah, karena mereka adalah kaum yang suka menjamu tamu dan suka memberi pinjaman di tengah-tengah kaum mereka",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 3042,
			"arabicnumber": 3042,
			"text": "Telah bercerita kepada kami ['Ubaidullah] dari [Isro'il] dari [Abu Ishaq] berkata; Ada seorang bertanya kepada Al Baro' radliallahu 'anhu, katanya: \"Wahai Abu 'Umaroh, apakah kalian kabur saat perang Hunain?\". [Al Baro'] berkata dan aku mendengarnya: \"Adapun Rasulullah Shallallahu'alaiwasallam tidak kabur pada peperangan itu. Ketika itu Abu Sufyan memegang tali (menuntun) baghol Beliau. Ketika Kaum Musyrikin mengepung beliau, Beliau turun dari bagholnya dan bersya'ir: \"Aku Nabi yang tidak berdusta. Aku anak dari 'Abdul Muthollib\". Al Baro' berkata: \"Saat itu tidak ada orang yang paling tegar dibanding Beliau",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 3043,
			"arabicnumber": 3043,
			"text": "Telah bercerita kepada kami [Sulaiman bin Harb] telah bercerita kepada kami [Syu'bah] dari [Sa'ad bin Ibrahim] dari [Abu Umamah, dia adalah Sahal bin Hunaif] dari [Abu Sa'id Al Khudriy radliallahu 'anhu] berkata: Tatkala Banu Quraizhah setuju dengan ketetapan hukum yang akan diputuskan oleh Sa'ad, maksudnya Sa'd bin Mu'adz yang disuruh Rasulullah agar datang, ketika itu Abu Sa'id alkhudzri berada di dekat Rasulullah. Lantas Sa'd bin Mu'adz datang dengan menunggang keledai. Ketika sudah dekat, Rasulullah shallallahu 'alaihi wasallam berkata: \"Berdirilah kalian untuk menjemput pemimpin kalian\". Sa'ad pun tiba dan duduk dekat dengan Rasulullah shallallahu 'alaihi wasallam, lalu Beliau berkata kepadanya: \"Sesungguhnya mereka setuju dengan keputusan yang akan kamu putuskan\". Sa'ad berkata: \"Aku putuskan agar para tentara perang mereka dibunuh dan anak-anak mereka dijadikan tawanan\". Maka Beliau Shallallahu'alaihiwasallam berkata: \"Sungguh kamu telah memutuskan hukum kepada mereka dengan hukum Allah (Raja diraja)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 3044,
			"arabicnumber": 3044,
			"text": "Telah bercerita kepada kami [Isma'il] berkata telah bercerita kepadaku [Malik] dari [Ibnu Syihab] dari [Anas bin Malik radliallahu 'anhu] bahwa Rasulullah Shallallahu'alaiwasallam memasuki (Masjidil Harom) pada saat Tahun Penaklukan Makkah dengan kepala mengenakan tameng penutup. Setelah Beliau melepasnya, ada seseorang yang mendatangi Beliau lalu berkata: \"Sesungguhnya Ibnu Khothol sedang berlindung di balik kain penutup Ka'bah\". Maka Beliau bersabda: \"Bunuhlah dia",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 3045,
			"arabicnumber": 3045,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata telah mengabarkan kepadaku ['Amru bin Abi Sufyan bin Asid bin Jariyah Ats Tsaqofiy], dia adalah sekutu Bani Zuhroh dan dia termasuk diantara shohabat Abu Hurairah, bahwa [Abu Hurairah radliallahu 'anhu] berkata; Rasulullah Shallallahu'alaiwasallam mengutus ekspedisi militer dengan jumlah sepuluh orang sebagai mata-mata dan Beliau angkat 'Ashim bin Tsabit Al Anshoriy, kakek dari 'Ashim bin 'Umar bin Al Khoththob sebagai pemimpin pasukan tersebut. Mereka berangkat hingga ketika sampai di Al Hada', suatu tempat antara 'Ushfan dan Makkah, keberadaan mereka diceritakan kepada penduduk dari suku Hudzail yang biasa disebut dengan Banu Lahyan. Maka suku ini mengerahkan hampir dua Ratus orang yang kesemuanya ahli memanah. Mereka pun mencari jejak keberadaan anggota ekspedisi militer muslimin. Ketika melihat mereka, 'Ashim dan pasukannya bersembunyi di balik bukit kecil (fad-fad). Namun suku itu langsung mengepung mereka dan berseru: \"Turun dan serahkanlah kepada kami apa yang ada ditangan kalian. Bagi kalian ada jaminan dan perjanjian agar kami tidak membunuh seorangpun dari kalian\". 'Ashim bin Tsabit, sebagai pemimpin ekspedisi militer itu berkata: \"Adapun aku, demi Allah, tidak akan mau turun dengan jaminan orang kafir. Ya Allah, beritahukanlah keadaan kami kepada Nabi-Mu\". Maka suku itu menyerang mereka dengan anak panah hingga mereka dapat membunuh 'Ashim beserta tujuh orang anak buahnya. Akhirnya tiga orang anggota ekspedisi yang masih hidup turun dengan menyetujui jaminan dan perjanjian. Diantara mereka ada Khubaib Al Anshoriy dan Ibnu Datsinah serta seorang lagi. (Setelah ketiganya turun) mereka menangkapnya dan melepas tali busur panah mereka untuk mengikat ketiganya. Orang ketiga berkata: \"Ini merupakan awal pengkhiyanatan. Demi Allah, aku tidak akan mengikuti kalian. Sungguh mereka bagiku sebagai teladan\". Yang dia maksud adalah shohabat mereka yang sudah terbunuh. Maka mereka menyeretnya dan memaksanya agar mengikuti mereka namun dia menolaknya hingga akhirnya mereka membunuhnya. Kemudian mereka berangkat dengan membawa Khubaib dan Ibnu Datsinah hingga akhirnya mereka menjual keduanya di Makkah sesudah peristiwa perang Badar. Khubaib dibeli oleh Banu Al Harits bin 'Amir bin Nawfal bin 'Abdu Manaf. Sebelumnya Khubaib adalah orang yang telah membunuh Al Harits bin 'Amir saat perang Badar. Maka jadilah Khubaib di tangan mereka sebagai tawanan. ['Ubaidullah bin 'Iyadl] mengabarkan kepadaku bahwa [putri dari Al Harits (Zainab)] mengabarkan kepadanya bahwa, ketika mereka bersepakat (untuk membunuh Khubaib), Khubaib meminjam (kepada Zainab) sebilah pisau cukur untuk mencukur bulu kemaluannya maka dia meminjamkannya. Kemudian Khubaib mengambil anakku saat aku lengah, itu karena anakku menghampirinya. (Zainab) berkata: \"Aku dapati anakku sedang dipangku olehnya sedangkan dia (Khubaib) sambil memegang pisau cukur. Aku sungguh terperanjat seketika itu\". Khubaib mengetahui keterperanjatanku pada wajahku, maka dia berkata: \"Kamu khawatir bila aku akan membunuhnya?. Sungguh aku tidak akan melakukannya\". (Zainab berkata); Sungguh demi Allah, belum pernah aku melihat ada seorang tawanan sebaik Khubaib. Demi Allah, aku pernah mendapatkan dia pada suatu hari sedang memakan buah anggur di tangannya padahal tangannya sedang dibelenggu dengan besi dan juga di Makkah saat itu bukan musimnya buah-buahan\". Dia berkata: \"Sungguh itu merupakan rezeki dari Allah yang Dia berikan kepada Khubaib\". Ketika mereka hendak keluar dari tanah Harom untuk membunuh Khubaib di daerah halal, Khubaib berkata kepada mereka: \"Biarkanlah aku untuk melaksanakan sholat dua roka'at\". Maka mereka mempersilakanhya. Maka Khubaib sholat dua Raka'at kemudian berkata: \"Seandainya bukan karena kalian akan mengira aku takut tentu aku akan memanjangkan sholatku ini. Ya Allah, binasakanlah mereka semuanya\". (Kemduaian dia bersya'ir); \"Aku tidak peduli selagi aku dibunuh sebagai muslim # Dibagian tubuh manakah diriku terbunuh jalan Allah\". # \"Semuanya itu pastilah ada balasan disisi AIlah # jika Dia berkendak, Dia memberkahi pada daging tercabik-cabik\". Akhirnya Ibnu Al Harits membunuhnya. Dan Khubaib adalah orang pertama yang mencontohkan sholat dua roka'at bagi setiap muslim yang akan dibunuh sebagai wujud keshabaran. Dan Allah mengabulkan do'a 'Ashim bin Tsabit pada saat dia dibunuh. Lalu Nabi Shallallahu'alaihiwasallam mengabarkan kepada para shohabat Beliau tentang berita mereka dan musibah yang mereka alami. (Saat kematian 'Ashim) orang-orang kafir Quraisy mengirim orang mendatangi 'Ashim dan mengabarkan bahwa dia telah dibunuh agar mereka datang mengambil sesuatu dari bagian jasad 'Ashim agar mereka dapat mengenalinya. Sebelumnya 'Ashim memang telah membunuh seorang dari pembesar mereka saat perang Badar. (Ketika mereka hendak membalaskan dendam kepada 'Ashim), Allah mengirim kepada 'Ashim pasukan lebah yang melindunginya dari para utusan kafir Quroisy sehingga mereka tidak mampu untuk mengambil secuilpun daging dari jasad 'Ashim",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 3046,
			"arabicnumber": 3046,
			"text": "Telah bercerita kepada kami [Qutaibah bin Sa'id] telah bercerita kepada kami [Jarir] dari [Manshur] dari [Abu Wa'il] dari [Abu Musa radliallahu 'anhu] berkata; Rasulullah Shallallahu'alaiwasallam bersabda: \"Bebaskanlah orang yang tertahan, maksudnya tawanan, beri makanlah orang yang kelaparan dan jenguklah orang yang sakit",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 3047,
			"arabicnumber": 3047,
			"text": "Telah bercerita kepada kami [Ahmad bin Yunus] telah bercerita kepada kami [Zuhair] telah bercerita kepada kami [Muthorrif] bahwa ['Amir] bercerita kepada mereka dari [Abu Juhaifah radliallahu 'anhu] berkata, aku bertanya kepada ['Ali Radliallahu 'anhu]; \"Apakah kalian menyimpan wahyu lain selain yang ada pada Kitab Allah?\". Dia menjawab; \"Tidak. Demi Dzat Yang Menumbuhkan butir tumbuh-tumbuhan dan Yang Menciptakan jiwa, aku tidak mengetahuinya kecuali pemahaman yang Allah berikan kepada seseorang tentang Al Qur'an dan apa yang ada pada shahifah (manuskrip) ini\". Aku bertanya; \"Apa yang dimaksud dengan shahifah itu?\". Dia menajwab; \"Membayar diat, membebaskan tawanan, dan jangan sampai seorang muslim terbunuh oleh orang kafir",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 3048,
			"arabicnumber": 3048,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 3049,
			"arabicnumber": 3049,
			"text": "Telah bercerita kepada kami [Isma'il bin Abi Aus] telah bercerita kepada kami [Isma'il bin Ibrohim bin 'Uqbah] dari [Musa bin 'Uqbah] dari [Ibnu Syihab] berkata telah bercerita kepadaku [Anas bin Malik radliallahu 'anhu] bahwa orang-orang dari Kaum Anshor meminta izin Rasulullah Shallallahu'alaiwasallam. Mereka berkata: \"Wahai Rasulullah, ijinkanlah agar bisa kami tinggalkan harta kami untuk menebus anak saudara perempuan kami, yaitu 'Abbas\". Maka Beliau berkata: \"Lantas kalian tidak meninggalkan satu dirhampun untuknya? -maksud nabi ibu Abbas--\". Dan berkata [Ibrohim bin Thohman] dari ['Abdul 'Aziz bin Shuhaib] dari [Anas] berkata; \"Selanjutnya Nabi Shallallahu'alaihiwasallam dibawakan harta dari negeri Bahrain lalu datang 'Abbas menemui Beliau dan berkata; \"Wahai Rasulullah, berilah aku (harta itu), karena aku sungguh akan menebus diriku dan juga 'Aqil\". Maka Beliau berkata: \"Ambillah\". Maka Beliau memberikan harta itu di bajunya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 3050,
			"arabicnumber": 3050,
			"text": "Telah bercerita kepadaku [Mahmud] telah bercerita kepadaku ['Abdur Razzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhriy] dari [Muhammad bin Jubair] dari [bapaknya], dia pernah datang menemui para tawanan perang Badar (dalam Rangka mencari tebusan). Dia juga berkata; \"Aku pernah mendengar Nabi Shallallahu'alaihiwasallam dalam sholat Maghrib membaca surat ath-Thur",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 3051,
			"arabicnumber": 3051,
			"text": "Telah bercerita kepada kami [Abu Nu'aim] telah bercerita kepada kami [Abu Al 'Umais] dari [Iyas bin Salamah bin Al Akwa'] dari [bapaknya] berkata; \"Telah datang mata-mata Kaum Musyrikin kepada Nabi Shallallahu'alaihiwasallam di tengah perjalanan lalu dia duduk bersama para shohabat Beliau sambil bercerita kemudian pergi. Maka kemudian Nabi Shallallahu'alaihiwasallam berkata: \"Carilah dia dan bunuhlah\". Maka (Salamah bin Al Akwa') membunuhnya dan dia berhak atas semua yang dipakai mata-mata itu (sebagai harta Rampasan)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 3052,
			"arabicnumber": 3052,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Abu 'Awanah] dari [Hushain] dari ['Amru bin Maimun] dari ['Umar radliallahu 'anhu] berkata; \"Aku berwasiat dengan perlindungan Allah dan Rasulullah Shallallahu'alaiwasallam tentang ahlu dzimmah agar janji mereka dipenuhi, agar diperangi siapa saja yang tidak mengikat perjanjian atau berniyat menyerang, dan janganlah mereka dibebani melainkan sebatas kemampuan mereka",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 3053,
			"arabicnumber": 3053,
			"text": "Telah bercerita kepada kami [Qobishah] telah bercerita kepada kami [Ibnu 'Uyainah] dari [Sulaiman Al Ahwal] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas radliallahu 'anhuma] bahwa dia berkata; \"Hari Kamis dan apakah hari Kamis?\". Lalu dia menangis hingga air matanya membasahi kerikil. Dia berkata; \"Rasulullah Shallallahu'alaihiwasallam bertambah parah sakitnya pada hari Kamis lalu Beliau berkata: \"Berilah aku buku sehingga bisa kutuliskan untuk kalian suatu ketetapan yang kalian tidak akan sesat sesudahnya selama-lamanya\". Kemudian orang-orang bertengkar padahal tidak sepatutnya mereka bertengkar di hadapan Nabi Shallallahu'alaihiwasallam. Mereka ada yang berkata; \"Rasulullah Shallallahu'alaihiwasallam telah terdiam\". Beliau berkata: \"Biarkanlah aku. Sungguh aku sedang menghadapi perkara yang lebih baik daripada ajakan yang kalian seru\". Beliau berwasiat menjelang kematiannya dengan tiga hal; \"Usirlah orang-orang musyrikin dari jazirah 'Arab, hormatilah para tamu (duta, utusan) seperti aku menghormati mereka dan aku lupa yag ketiganya\". Dan berkata Ya'qub bin Muhammad, aku bertanya kepada Al Mughiroh bin 'Abdur Rohman tentang jazirah 'Arab, maka dia menjawab; \"Makkah, Madinah, Yamamah dan Yaman\". Dan berkata Ya'qub; \"Dan 'Aroj yang merupakan permulaan Tihamah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 3054,
			"arabicnumber": 3054,
			"text": "Telah bercerita kepada kami [Yahya bin Bukair] telah bercerita kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Sihab] dari [Salim bin 'Abdullah] bahwa [Ibnu 'Umar radliallahu 'anhuma] berkata; 'Umar menemukan pakaian bersutera dijual di pasar lalu dia menemui Rasulullah Shallallahu'alaiwasallam seraya berkata; \"Wahai Rasulullah, belilah pakaian ini agar Baginda dapat berpenampilan bagus saat hari raya dan ketika menjamu para utusan\". Maka Rasulullah Shallallahu'alaiwasallam berkata: \"Pakaian ini hanya patut bagi orang yang tidak akan mendapat bagian (di akhirat) atau orang yang memakai pakaian sejenis ini adalah orang yang tidak akan mendapat bagian (di akhirat), maka dia memakainya sesuai apa yang Allah kehendaki\" Kemudian Nabi Shallallahu'alaihiwasallam mengirim baju jubah yang bersutera kepada 'Umar, lalu 'Umar menghadap Rasulullah Shallallahu'alaiwasallam dengan membawa pakaian tersebut seraya berkata; \"Wahai Rasulullah, Baginda mengatakan bahwa pakaian ini (sutera) hanya patut bagi orang yang tidak akan mendapat bagian (di akhirat) atau orang yang memakai pakaian sejenis ini adalah orang yang tidak akan mendapat bagian (di akhirat), lalu mengapa Baginda memberikannya kepadaku?\". Maka Beliau berkata: Maksudku, agar Kamu menjualnya atau kamu dapat mengambil manfaat untuk sebagian keperluanmu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 3055,
			"arabicnumber": 3055,
			"text": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Hisyam] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhriy] telah mengabarkan kepadaku [Salim bin 'Abdullah] dari [Ibnu 'Umar radliallahu 'anhuma] bahwa dia mengabarkan kepadanya bahwa 'Umar berangkat bersama rombongan shohabat Nabi Shallallahu'alaihiwasallam beserta Nabi Shallallahu'alaihiwasallam mendatangi Ibnu Shayyad. Mereka mendapatkannya sedang bermain bersama dua anak kecil di dekat benteng Bani Maghalah. Ibnu Shayyad waktu itu sudah hampir baligh dan dia tidak menyadari sesuatupun (kedatangan rombongan) hingga Nabi Shallallahu'alaihiwasallam memukul punggungnya dengan tangan Beliau kemudian Nabi Shallallahu'alaihiwasallam berkata: \"Apakah kamu bersaksi bahwa aku ini utusan Allah?\". Maka Ibnu Shayyad memandang Beliau dan berkata; \"Aku bersaksi bahwa engkau utusan bagi ummat yang ummiy\" (buta huruf, tidak melek baca tulis). Kemudian Ibnu Shayyad berkata kepada Nabi Shallallahu'alaihiwasallam; \"Apakah kamu bersaksi bahwa aku ini utusan Allah?\". Maka Nabi Shallallahu'alaihiwasallam berkata kepadanya: \"Aku beriman kepada Allah dan Rosul-rosul-Nya\". Nabi Shallallahu'alaihiwasallam melanjutkan: \"Bagaimana pemdapatmu?\". Ibnu Shayyad berkata; \"Telah datang kepadaku orang yang jujur dan pendusta\". Nabi Shallallahu'alaihiwasallam berkata: \"Urusanmu kacau balau\". Nabi Shallallahu'alaihiwasallam berkata: \"Sungguh aku meminta kepadamu agar menebak (apa yang aku sembunyikan dalam hatiku) \". Ibnu Shayyad berkata; \"Aku tebak itu asap\". Nabi Shallallahu'alaihiwasallam berkata: \"Hinalah engkau. Kamu tidak bakalan melampaui batas kemampuanmu selaku dukun\". 'Umar berkata; \"Wahai Rasulullah, biarkanlah aku untuk memenggal lehernya\". Maka Nabi Shallallahu'alaihiwasallam berkata: \"Jika dia benar, kamu tidak akan dapat menguasainya dan jika dia salah, tidak ada kebaikan membunuhnya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 3057,
			"arabicnumber": 3057,
			"text": "Dan (masih dari jalur periwayatan yang sama dengan hadits sebelumnya) [Salim] berkata, [Ibnu 'Umar radliallahu 'anhuma] berkata; \"Kemudian Nabi Shallallahu'alaihiwasallam berdiri di hadapan manusia, lalu memuji Allah yang Dia satu-satunya yang paling berhak dipuji kemudian Beliau menyebutkan masalah ad-Dajjal dan bersabda: \"Sungguh aku mengingatkan kalian tentangnya dan tidak ada seorang Nabi pun kecuali telah mengingatkan kaumnya tentang Dajjal itu. Sungguh Nabi Nuh 'Alaihissalam telah mengingatkan kaumnya. Akan tetapi aku katakan kepada kalian tentangnya yang para Nabi (sebelumku) belum pernah mengatakannya, yaitu bahwa ad-Dajjal itu a'war (buta sebelah matanya) dan sesungguhnya Allah tidaklah buta sebelah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 3058,
			"arabicnumber": 3058,
			"text": "Telah bercerita kepada kami [Mahmud] telah mengabarkan kepada kami ['Abdur Razzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhriy] dari ['Ali bin Husain] dari ['Amru bin 'Utsman bin 'Affan] dari [Usamah bin Zaid] berkatal; \"Aku bertanya kepada Rasulullah Shallallahu'alaiwasallam, dimana besok Baginda akan singgah dalam perjalanan haji baginda?\". Beliau menjawab: \"Apakah Aqil telah menyiapkan suatu tempat singgah buat kita?\". Kemudian Beliau berkata: \"Kita singgah besok di lembah Bani Kinanah yaitu Al Muhashshab, tempat yang dahulu dipergunakan orang-orang Quraisy bersumpah diatas kekafiran. Yaitu suatu peristiwa ketika Banu Kinanah mengambil sumpah Quraisy untuk mengalahkan Bani Hasyim, mereka bersumpah untuk tidak akan berjual beli dengan mereka (Bani Hasyim) dan tidak akan memberi perlindungan kepada mereka\". Az Zuhriy berkata; \"Al Khaif adalah Al wadiy (lembah)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 3059,
			"arabicnumber": 3059,
			"text": "Telah bercerita kepada kami [Isma'il] berkata telah bercerita kepadaku [Malik] dari [Zaid bin Aslam] dari [bapaknya] bahwa ['Umar bin Al Khaththab radliallahu 'anhu] memberikan tugas sebagai penjaga (hewan ternak shodaqoh) kepada maulanya yang bernama Hunayya. Dia berkata; \"Wahai Hunaya, rendahkanlah hatimu kepada kaum Muslimin, takutlah terhadap do'a orang yang dizhalimi karena do'a orang yang dizhalimi itu mustajab (terkabul), masukkanlah pengembala unta dan pengembala kambing (yang jumlah hewannya tidak lebih dari tiga puluh) dan sungguh aku menghindari diriku dari hewan-hewannya ('Abdur Rohman) bin 'Auf dan hewan-hewannya ('Utsman) bin 'Affan karena jika hewan-hewan mereka berdua binasa keduannya akan beralih kepada hartanya (yang lain) berupa kebun kurma dan pertanian. Adapun pemilik hewan-hewan yang sedikit itu, bila hewan-hewan mereka binasa, dia akan datang kepadaku dengan membawa anak-anaknya dan berkata; \"Wahai Amirul Mu'minin, adakah aku harus meninggalkan mereka kepadamu dan tidak mempedulikan mereka?. Maka dalam hal ini, air dan ladang tempat pengembalaan lebih mudah bagiku (melindunginya) dari pada emas dan perak. Demi Allah, sungguh mereka akan menduga bahwa aku telah menzhalimi mereka. Sungguh tanah ini adalah negeri mereka dimana mereka di masa jahiliyah berperang di sana dan mereka masuk Islam pun di sana. Demi Dzat Yang jiwaku berada di tangan-Nya, seandainya tidak ada harta (unta, kuda) yang aku gunakan untuk berperang di jalan Allah, tentu aku tidak akan melindungi mereka sejengkalpun di negeri mereka",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 3060,
			"arabicnumber": 3060,
			"text": "Telah bercerita kepada kami [Muhammad bin Yusuf] telah bercerita kepada kami [Sufyan] dari [Al A'masy] dari [Abu Wa'il] dari [Hudzaifah radliallahu 'anhu] berkata Nabi Shallallahu'alaihiwasallam bersabda: \"Tuliskan untukku nama-nama orang yang sudah menyatakan masuk Islam\". Maka kami menuliskannya untuk Beliau sebanyak seribu lima Ratus orang laki-laki. Kami berkata; \"Kami masih merasakan kekhawatiran dengan jumlah kami sebanyak seribu lima Ratus itu karena aku pernah melihat betul keadaan kami saat diuji, hingga ada seorang yang sholat sendirian dalam keadaan ketakutan\". Telah bercerita kepada kami ['Abdan] dari [Abu HAmzah] dari [Al A'masy]; \"Maka kami dapatkan mereka sebanyak lima Ratus orang\". Berkata [Abu Mu'awiah]; \"Antara enam Ratus hingga tujuh Ratus orang",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 3061,
			"arabicnumber": 3061,
			"text": "Telah bercerita kepada kami [Abu Nu'aim] telah bercerita kepada kami [Sufyan] dari [Ibnu Juroij] dari ['Amru bin Dinar] dari [Abu Ma'bad] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata; \"Datang seorang laki-laki kepada Nabi Shallallahu'alaihiwasallam lalu berkata; 'Wahai Rasulullah, aku telah bertekad untuk ikut perang ini dan itu namun istriku berangkat menunaikan hajji\". Maka Beliau berkata: \"Kembalilah kamu dan berhajilah bersama istrimu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 3062,
			"arabicnumber": 3062,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy]. Dan diriwayatkan pula, telah bercerita kepadaku [Mahmud bin Ghailan] telah bercerita kepada kami ['Abdur Razzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhriy] dari [Ibnu Al Musayyab] dari [Abu Hurairah radliallahu 'anhu] berkata; \"Ketika kami sedang ikut dalam suatu peperangan bersama Rasulullah Shallallahu'alaiwasallam, Beliau berkata kepada seseorang yang mengaku dirinya telah masuk Islam; \"Orang ini termasuk penduduk neraka\". Ketika terjadi peperangan orang tadi berperang dengan sangat berani lalu dia terluka kemudian dikatakan (kepada Beliau); \"Wahai Rasulullah, orang yang Baginda maksudkan tadi sebagai penduduk neraka, dia telah berperang hari ini dengan sangat berani dan dia telah gugur\". Maka Nabi Shallallahu'alaihiwasallam berkata: \"Dia akan masuk neraka\". (Abu Hurairah) berkata; \"Orang-orang semuanya jadi Ragu. Ketika dalam keraguan seperti itu, ada orang yang mengabarkan bahwa orang yang berperang tadi tidaklah mati melainkan setelah mendapatkan luka yang sangat parah namun ketika pada malam harinya dia tidak shabar atas luka yang dideritanya hingga akhirnya dia bunuh diri. Kejadian ini kemudian dikabarkan kepada Nabi Shallallahu'alaihiwasallam, maka Nabi Shallallahu'alaihiwasallam bersabda: \"Allahu Akbar, aku bersaksi bahwa aku ini hamba Allah dan Rasul-Nya\". Kemudian Beliau memerintahkan Bilal agar menyerukan manusia bahwa tidak akan masuk surga melainkan jiwa yang pasrah dan Allah bisa jadi menolong agama ini melalui seorang yang berdosa",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 3063,
			"arabicnumber": 3063,
			"text": "Telah bercerita kepada kami [Ya'qub bin Ibrahim] telah bercerita kepada kami [Ibnu 'Ulayyah] dari [Ayyub] dari [Humaid bin Hilal] dari [Anas bin Malik radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam memberikan khathbah, Beliau berkata: \"Zaid akan memegang bendera perang lalu dia gugur kemudian bendera itu dipegang oleh Ja'far lalu dia pun gugur kemudian bendera itu dipegang oleh 'Abdullah bin Rawahah namun diapun gugur pula. Akhirnya bendera itu diambil oleh Khalid bin Al Walid padahal sebelumnya dia tidak ditunjuk. Maka lewat dialah kemenangan dapat diraih\". Dan Anas berkata: \"Kejadian itu menggembirakan kami seolah mereka ada bersama kami\". Atau dia berkata: \"Kejadian itu (karamah para syuhada') tidaklah menjadikan mereka ingin untuk kembali bersama kami (di dunia kecuali bila mati syahid kembali untuk kedua kali) \". Dia berkata; \"Dan kedua mata beliau menitikkan air mata",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 3064,
			"arabicnumber": 3064,
			"text": "Telah bercerita kepada kami [Muhammad bin Basysyar] telah bercerita kepada kami [Ibnu Abi 'Adiy] dan [Sahal bin Yusuf] dari [Sa'id] dari [Qatadah] dari [Anas radliallahu 'anhu] bahwa Nabi Shallallahu'alaihiwasallam didatangi oleh (utusan) suku Ri'l, Dzakwan dan Banu Lahyan yang mengaku memeluk Islam lalu mereka meminta Beliau Shallallahu'alaihiwasallam agar membimbing (keIslaman) mereka. Nabi Shallallahu'alaihiwasallam pun membimbing keIslaman mereka dengan mengutus tujuh puluh orang kalangan Anshar yang mereka kami sebut Al Qurra', yaitu orang-orang yang bekerja keras di siang hari dan mendirikan shalat di malam hari. Maka berangkatlah mereka bersama utusan para suku itu, hingga ketika sampai di Bi'ru Ma'unah para suku itu mengkhiyanati dan membunuh para qurra' tersebut. Kemudian Beliau melakukan qunut selama satu bulan untuk mendoakan kebinasaan suku Ri'la, Dzakwan dan Banu Lahyan. Qatadah berkata, dan telah bercerita kepada kami Anas bahwa mereka menbacakan satu ayat dari Al Qur'an tentang mereka: \"Alaa ballighuu 'annaa qoumanaa bi annaa qad laqiinaa robbanaa faradliya 'annaa wa-ardlaanaa\", (Artinya; \"Sampaikanlah dari kami kepada kaum kami bahwa kami telah berjumpa dengan Robb kami, maka Dia ridla kepada kami dan menjadi kami ridla terhadap-Nya\"). Kemudian ayat ini dihapus",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 3065,
			"arabicnumber": 3065,
			"text": "Telah Telah bercerita kepada kami [Muhammad bin 'Abdur Rahim] telah bercerita kepada kami [Rauh bin 'Ubadah] telah bercerita kepada kami [Sa'id] dari [Qatadah] berkata [Anas bin Malik] bercerita kepada kami dari [Abu Thalhah radliallahu 'anhuma] dari Nabi Shallallahu'alaihiwasallam bahwa jika beliau menghadapi suatu kaum (musuh), Beliau singgah di tempat persinggahan selama tiga malam. Hadits ini juga diperkuat oleh [Mu'adz] dan ['Abdul A'laa], katanya telah bercerita kepada kami [Sa'id] dari [Qatadah] dari [Anas] dari [Abu Thalhah] dari Nabi Shallallahu'alaihiwasallam",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 3066,
			"arabicnumber": 3066,
			"text": "Telah bercerita kepada kami [Hudbah bin Khalid] telah bercerita kepada kami [Hammam] dari [Qatadah] bahwa [Anas] mengabarkan kepadanya, dia berkata; Nabi Shallallahu'alaihiwasallam melaksanakan 'umrah dari Al Ji'ranah ketika (selesai) membagikan ghanimah perang Hunain",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 3067,
			"arabicnumber": 3067,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 3068,
			"arabicnumber": 3068,
			"text": "Telah bercerita kepada kami [Muhammad bin Basysyar] telah bercerita kepada kami [Yahya] dari ['Ubaidullah] berkata telah mengabarkan kepadaku [Nafi'] bahwa seorang budak milik Ibnu 'Umar melarikan diri ke negeri Romawi kemudian Khalid bin Al Walid menyusulnya lalu diserahkan kembali kepada ['Abdullah] (bin 'Umar). Dan bahwa seekor kuda milik Ibnu 'Umar kabur ke negeri Romawi kemudian (Khalid bin Al Walid) menyusulnya lalu mengembalikannya kepada 'Abdullah. Abu 'Abdullah Al Bukhariy berkata; \"Kata -'aaro- berasal dari kata -al'iiru- yang artinya himar liar, maksud dalam hadits ini \"kabur",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 3069,
			"arabicnumber": 3069,
			"text": "Telah bercerita kepada kami [Ahmad bin Yunus] telah bercerita kepada kami [Zuhair] dari [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] bahwa dia menunggang kuda ketika terjadi peperangan antara Kaum Muslimin yang dipimpin oleh Khalid bin Al Walid yang diutus oleh Abu Bakr. Kemudian musuh mengambil kudanya. Ketika musuh dapat dikalahkan, maka Khalid mengembalikan kuda tersebut kepadanya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 3070,
			"arabicnumber": 3070,
			"text": "Telah bercerita kepada kami ['Amru bin 'Ali] telah bercerita kepada kami [Abu 'Ashim] telah mengabarkan kepada kami [Hanzhalah bin Abu Sufyan] telah mengabarkan kepada kami [Sa'id bin Minaa'] berkata; aku mendengar [Jabir bin 'Abdullah radliallahu 'anhuma] berkata; aku berkata; \"Wahai Rasulullah, kami menyembelih seekor hewan milik kami dan aku telah pula membuat makanan satu sha' terbuat tepung dari gandum, untuk itu, tolong Baginda agar datang dan lainnya\". Maka Nabi Shallallahu'alaihiwasallam berseru dengan suara keras: \"Hai para pejuang Khandaq, sesungguhnya Jabir telah membuat hidangan makanan, kemarilah datang untuk menikmatinya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 3071,
			"arabicnumber": 3071,
			"text": "Telah bercerita kepada kami [Hibban bin Musa] telah mengabarkan kepada kami ['Abdullah] dari [Khalid bin Sa'id] dari [bapaknya] dari [Ummu Khalid binti Khalid bin Sa'id] berkata; Aku menemui Rasulullah Shallallahu'alaiwasallam bersama bapakku yang saat itu aku mengenakan baju berwarna kuning. Rasulullah Shallallahu'alaiwasallam berkata; \"Bagus, bagus\". 'Abdullah berkata; (Beliau mengucapkan) kata-kata yang berasal dari bahasa Habasyiah, yang maksudnya hasanah (bagus). Dia (Ummu Khalid) berkata; Maka aku pergi bermain khatam nubuwah (cincin yang bertanda kenabian) Kemudian bapakku membentakku namun Rasulullah Shallallahu'alaiwasallam berkata: \"Biarkanlah dia\". Rasulullah Shallallahu'alaiwasallam bersabda: \"abliy wa akhlifiy tsumma abliy wa akhlifiy tsumma abliy wa akhlifiy tsumma abliy wa akhlifiy\" (\"Semoga sampai lusuh bajunya\", ini adalah suatu do'a untuk mendo'akan seseorang agar panjang umur hingga bajunya lusuh). 'Abdullah berkata; Maka Ummu Khalid hidup lama sampai dia menceritakannya",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 3072,
			"arabicnumber": 3072,
			"text": "Telah bercerita kepada kami [Muhammad bin Basysyar] telah bercerita kepada kami [Ghundar] telah bercerita kepada kami [Syu'bah] dari [Muhammad bin Ziyad] dari [Abu Hurairah radliallahu 'anhu], bahwa Al Hasan bin 'Ali mengambil sebutir kurma dari kurma-kurma (zakat) shadaqah, (lalu ia masukkan) ke dalam mulutnya, maka Nabi Shallallahu'alaihiwasallam bersabda; \"Hei, hei. Tidak tahukah kamu bahwa kita dilarang memakan shadaqah (zakat)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 3073,
			"arabicnumber": 3073,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Yahya] dari [Abu Hayyan] berkata telah bercerita kepadaku [Abu Zur'ah] berkata telah bercerita kepadaku [Abu Hurairah radliallahu 'anhu] berkata; Nabi Shallallahu'alaihiwasallam berdiri di hadapan kami lalu Beliau menuturkan tentang ghulul (mengambil harta Rampasan perang sebelum dibagikan) dan Beliau (memperingatkan) besarnya dosa dan akibat dari perbuatan tersebut. Beliau bersabda: \"Sungguh akan kutemui salah seorang dari kalian pada hari qiyamat yang di tengkuknya ada seekor kambing yang mengembik, di tengkuknya ada seekor kuda yang meringkik sambil dia berkata; \"Wahai Rasulullah, tolonglah aku\", lalu aku jawab; \"Aku tidak berkuasa sedikitpun terhadapmu. Aku sudah menyampaikan kepada kamu (ketika di dunia) \". Dan kutemui seseorang yang di atas tengkuknya ada seekor unta yang melenguh, sambil dia berkata; \"Wahai Rasulullah, tolonglah aku\", lalu aku menjawab: \"Aku tidak berkuasa sedikitpun terhadapmu. Aku sudah menyampaikan kepada kamu (ketika di dunia) \". Dan kutemui seseorang yang di atas tengkuknya ada sebongkah emas dan perak lalu dia berkata; \"Wahai Rasulullah, tolonglah aku\", lalu kujawab: \"Aku tidak berkuasa sedikitpun terhadapmu. Aku sudah menyampaikan kepada kamu (ketika di dunia) \", Dan kutemui seseorang yang di atas tengkuknya ada lembaran kain sembari berkata; \"Wahai Rasulullah, tolonglah aku\", lalu aku katakan: \"Aku tidak bekuasa sedikitpun terhadapmu. Aku sudah menyampaikan kepada kamu (ketika di dunia) \". Dan [Ayyub] dari [Abu Hayyan] mengatakan; \"(Dan seseorang) yang di tengkuknya ada kuda yang meringkik",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 3074,
			"arabicnumber": 3074,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufyan] dari ['Amru] dari [Salim bin Abi Al Ja'di] dari ['Abdullah bin 'Amru] berkata; Ada seseorang yang ditugaskan Nabi Shallallahu'alaihiwasallam menjaga harta (rampasan perang) bernama Kirkirah kemudian dia meninggal dunia. Lalu Beliau Rasulullah Shallallahu'alaiwasallam berkata tentang orang itu; \"Dia di neraka\". Maka orang-orang pergi untuk menengoknya dan ternyata mereka temukan ada barang curian (baju selimut) yang dicurinya. Abu 'Abdullah berkata, [Ibnu Salam] berkata; \"Nama orang itu Karkarah (huruf Kaaf berbaris fathah), danitulah yang lebih kuat",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 3075,
			"arabicnumber": 3075,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Abu 'Awanah] dari [Sa'id bin Masruq] dari ['Abayah bin Rifa'ah] dari [kakeknya, Rafi'] berkata; \"Kami bersama Nabi Shallallahu'alaihiwasallam di Dzul Hulaifah kemudian orang-orang dihinggapi Rasa lapar, lalu kami mendapatkan (ghanimah berupa) unta dan kambing. Saat itu Nabi Shallallahu'alaihiwasallam berada di belakang rombongan. Orang-orang yang lapar itu itu rupanya kemudian memasang tungku-tungkunya. Namun Nabi Shallallahu'alaihiwasallam memerintahkan agar kuali tersebut ditumpahkan. Kemudian Beliau membagi Rata (sisa ghanimah yang ada), yang setiap sepuluh kambing dianggap sama dengan satu ekor unta. Namun ada seekor unta yang lari sementara di tengah-tengah rombongan ada seekor kuda yang lincah. Mereka pun segera mencari unta yang kabur tadi, namun tidak rupanya mereka kelelahan. Kemudian ada seseorang yang mencarinya dengan menggunakan tombak, dan akhirnya Allah menakdirkannya dapat membunuh unta tersebut. Kemudian Beliau bersabda: \"Sesungguhnya binatang ini masih mempunyai sifat-sifat keberingasan seperti binatang liar. Maka jika ada yang lari dari mereka, perlakuklanlah seperti ini\". Kakekku berkata: \"Kita berharap atau khawatir bertemu musuh esok hari sedangkan kita tidak membawa pisau, apakah kita boleh menyembelih hewan dengan kayu?\". Beliau berkata: \"Setiap yang ditumpahkan darahnya dengan disebut nama Allah maka makanlah kecuali gigi dan kukunya, dan akan kusampaikan tentang itu. Adapun gigi dia termasuk tulang sedangkan kuku merupakan pisaunya orang-orang Habsasyah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 3076,
			"arabicnumber": 3076,
			"text": "Telah bercerita kepada kami [Muhammad bin Al Mutsannaa] telah bercerita kepada kami [Yahya] telah bercerita kepada kami [Isma'il] berkata telah bercerita kepadaku [Qais] berkata, [Jabir bin 'Abdullah radliallahu 'anhu] berkata kepadaku, Rasulullah Shallallahu'alaiwasallam telah berkata kepadaku:: \"Bisakah kamu membuatku dapat beristirahat dari urusan Dzul Khalashah\". Yang Beliau maksud adalah sebuah rumah di Khots'am yang dinamakan Ka'bah Al Yamaniyah (dijadikan sebagai kiblat dan isinya banyak patung yang disembah). (Jarir berkata); \"Maka aku berangkat dalam rombongan berjumlah seratus lima puluh pasukan berkuda yang mereka dari Ahmas. Mereka adalah para penunggang kuda yang ulung. Lalu aku kabarkan kepada Nabi Shallallahu'alaihiwasallam bahwa aku tidak ahli menunggang kuda hingga akhirnya Beliau pukul dadaku hingga kulihat bekas jari tangan Beliau di dadaku\". Kemudian Beliau berdo'a: \"ALLOOHUMMA TSABBITHU WAJ'ALHU HAADIYAN MAHDIYAN \"Ya Allah mantapkanlah dia dan jadikanlah dia seorang pemberi petunjuk yang lurus\". Maka Jarir berangkat menuju rumah yang dimaksud lalu merusak dan membakarnya. Kemudian dia mengutus utusan untuk menemui Rasulullah Shallallahu'alaiwasallam dan mengabarkan apa yang sudah terjadi. Utusan Jarir berkata kepada Rasulullah Shallallahu'alaiwasallam: \"Wahai Rasulullah, demi Dzat Yang Mengutus Baginda dengan haq, tidaklah aku menemui Baginda melainkan telah Kutinggalkan rumah tersebut seolah seperti unta yang berlobang atau kudisan (sebutan untuk kehancuran rumah tersebut karena telah dibakar). (Jarir berkata): \"Lalu Beliau Shallallahu'alaihiwasallam mendo'akan keberkahan untuk pasukan berkuda dari Ahmas tersebut sebanyak lima kali. [Musaddad] berkata dengan redaksi; \"Rumah yang dimaksud terletak di Khats'am",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 3077,
			"arabicnumber": 3077,
			"text": "Telah bercerita kepada kami [Adam bin Abi Iyas] telah bercerita kepada kami [Syaiban] dari [Manshur] dari [Mujahid] dari [Thawus] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata; Nabi Shallallahu'alaihiwasallam bersabda pada saat hari Pembebasan Makkah: \"Tidak ada lagi hijrah, akan tetapi yang tetap ada adalah jihad dan niat. Maka bila kalian diperintahkan berangkat (berperang) maka berangkatlah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 3079,
			"arabicnumber": 3079,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 3080,
			"arabicnumber": 3080,
			"text": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufyan], berkata ['Amru] dan [Ibnu Juraij] aku mendengar ['Atha'] berkata; \"Aku pergi bersama 'Ubaid bin 'Umair menemui ['Aisyah] radliallahu 'anhu yang ketika itu sedang berada di bukit, lalu dia berkata kepada kami; \"Hijrah telah terputus (kewajibannya) sejak Allah memberikan kemenangan kepada Nabi Shallallahu'alaihiwasallam atas kota Makkah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 3081,
			"arabicnumber": 3081,
			"text": "Telah bercerita kepadaku [Muhammad bin 'Abdullah bin Hawsyab ath-Tha'iy] telah bercerita kepada kami [Husyaim] telah mengabarkan kepada kami [Hushain] dari [Sa'ad bin 'Ubaidah] dari [Abu Abdur Rahman,] salah seorang yang mengutamakan 'Utsman dari 'Ali) dia berkata kepada Ibnu 'Athiyah, salah seorang yang lebih mengutamakan 'Ali dari pada 'Utsman); \"Sungguh aku adalah orang yang paling tahu tentang keberanian [sahabatmu] (maksudnya \"Ali) dalam masalah (pertumpahan) darah, aku mendengar dia berkata; Nabi Shallallahu'alaihiwasallam mengutusku bersama Az Zubair lalu Beliau berkata; \"Datangilah Raudhah -dalam redaksi lain Raudhah Khah-- dan temuilah di sana seorang wanita yang membawa surat yang diberikan oleh Hathib\". Maka kami datangi lokasi Raudhah yang dimaksud lalu kami katakan; \"Mana surat itu?\". Wanita itu berkata: \"Aku tidak bawa surat\". Kami berkata: \"Kamu keluarkan surat itu atau kami lucuti pakaianmu\". Akhirnya dia mengeluarkan surat itu dari dalam tali ikat pinggangnya -dalam redaksi lain dalam sanggulnya--lalu surat itu dibawa ke hadapan Hathib. Hathib berkata: \"Jangan terburu-buru bersikap kepadaku. Sungguh aku melakukan ini bukan karena kufur. Bahkan tidak bertambah sikapku terhadap Islam selain kecintaan. Ketahuilah bahwa tidak ada seorangpun dari sahabat Baginda melainkan mempunyai pembela di Makkah yang membela keluarga dan hartanya, sedangkan aku tidak memiliki seorangpun pembela. Maka itu aku ingin mengambil seseorang dari mereka sebagai pembela (diriku). Maka Nabi Shallallahu'alaihiwasallam membenarkan (menerima) alasan yang disampaikannya. Lalu 'Umar berkata: \"Biarkan aku untuk memenggal batang leher orang ini karena dia telah berbuat nifaq (munafiq) \". Maka Beliau berkata: \"Apakah kamu tidak tahu barangkali Allah telah melihat pejuang perang Badar, dan Dia berfirman: \"Berbuatlah sesuka kalian, sungguh Aku telah mengampuni kalian\". (Abu 'Abdur Rahman) berkata: \"Itulah yang menjadikannya berani",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 3082,
			"arabicnumber": 3082,
			"text": "Telah bercerita kepada kami ['Abdullah bin Abi Al Aswad] telah bercerita kepada kami [Yazid bin Zurai'] dan [Humaid bin Al Aswad] dari [Habib bin asy-Syahid] dari [Ibnu ABi Mulaikah], berkata [Ibnu Az Zubair] kepada Ibnu Ja'far radliallahu 'anhum; apakah kamu ingat ketika kita berjumpa dengan Rasulullah Shallallahu'alaiwasallam, aku, kamu dan Ibnu 'Abbas?\". Dia (Ibnu Ja'far) berkata; \"Ya, lalu Beliau mengajakku naik kendaraan dan meninggalkan kamu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 3083,
			"arabicnumber": 3083,
			"text": "Telah bercerita kepada kami [Malik bin Isma'il] telah bercerita kepada kami [Ibnu 'Uyainah] dari [Az Zuhriy], berkata [as-Sa'ib bin Azid radliallahu 'anhu]; \"Kami pergi untuk menemui Rasulullah Shallallahu'alaiwasallam bersama anak-anak kecil di Tsaniyati Wada",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 3084,
			"arabicnumber": 3084,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] berkata telah bercerita kepada kami [Juwairiyah] dari [Nafi'] dari ['Abdullah radliallahu 'anhu] berkata: \"Adalah Nabi Shallallahu'alaihiwasallam apabila kembali dari (bepergian) Beliau bertakbir tiga kali lalu bedo'a: Aayibuuna insya Allah taai'buuna 'aabiduuna haamiduuna li robbinaa saajiduuna. Shodaqollahu wa'dahu wa nashoro 'abdahu wa hazamal ahzaaba wahdah\". (Kita kembali, insya Allah sebagai hamba yang bertaubat, ber'ibadah, memuji-Nya dan yang sujud untuk Robb kita. Alloh Maha Benar dengan janji-Nya, menolong hamba-Nya dan menghancurkan musuh-musuh-Nya)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 3085,
			"arabicnumber": 3085,
			"text": "Telah bercerita kepada kami [Abu Ma'mar] telah bercerita kepada kami ['Abdul Warits] berkata telah bercerita kepadaku [Yahya bin Abu Ishaq] dari [Anas bin Malik radliallahu 'anhu] berkata; \"Kami pernah bersama Nabi Shallallahu'alaihiwasallam saat Beliau kembali dari 'Usfan, ketika itu Rasulullah Shallallahu'alaiwasallam berada diatas tunggangan Beliau dengan memboncengkan Shofiyah binti Huyay. Kemudian unta Beliau tergelincir sehingga membanting keduanya. Abu Tholhah pun bergegas membantunya dengan berujar; \"Wahai Rasulullah, biarlah Allah menjadikan aku sebagai tebusan baginda\". Beliau berkata: \"Sebaiknya kamu menolong wanita\". Maka Abu Tholhah menutup wajahnya dengan selembar baju lalu mendatangi Shofiyah dan melempar baju itu untuknya kemudian dia memperbaiki pelana hewan tunggangan itu, lalu Beliau dan Shofiyah dapat mengendarainya. Akhirnya kami dapat menolong Rasulullah Shallallahu'alaiwasallam. Ketika hampir tiba di Madinah, Beliau berdo'a: \"Aayibuuna taa'ibuuna 'aabiduuna li robbinaa haamiduuna. (Kita kembali sebagai hamba yang bertaubat, ber'ibadah kepada Robb kita dan memuji-Nya\"). Beliau serus saja membaca do'a itu hingga memasuki kota Madinah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 3086,
			"arabicnumber": 3086,
			"text": "Telah bercerita kepada kami ['Ali] telah bercerita kepada kami [Bisyir bin Al Mufadldlol] telah bercerita kepada kami [Yahya bin Abu Ishaq] dari [Anas bin Malik radliallahu 'anhu] bahwa dia dan Abu Tholhah datang menghadap Nabi Shallallahu'alaihiwasallam sedang saat itu bersama Nabi Shallallahu'alaihiwasallam ada Shofiyah membonceng pada hewan tunggangan (unta) Beliau. Ketika di tengah perjalanan, unta tersebut tergelincir sehingga menjatuhkan Nabi Shallallahu'alaihiwasallam dan wanita itu (Shofiyah). Abu Tholhah katakan, seingatku (Yahya) berkata; \" Ia tersungkur dari untanya, lantas ia datangi Rasulullah Shallallahu'alaiwasallam seraya berkata; \"Wahai Nabi Allah, biarlah Allah menjadikanku sebagai tebusan baginda, apakah Baginda terluka?\". Beliau menjawab: \"Tidak, tetapi coba kamu tolong wanita (Shofiyah) \". Maka Abu Tholhah menutup wajahnya dengan selembar baju dan menghampiri Shofiyah, seterusnya dia lempar bajunya ke arah Shofiyah (maksudnya untuk menutup wajahnya), dan Shofiyah pun bisa berdiri. Lalu Abu Tholhah memperbaiki pelana hewan tunggangan Beliau tersebut, hingga keduanya dapat mengendarai kembali. Lalu mereka melanjutkan perjalanan hingga ketika sudah nampak kota Madinah, atau (perawi) berkata sudah hampir mendekati kota Madinah, Beliau berdo'a: \"Aayibuuna taa'ibuuna 'aabiduuna li robbinaa haamiduuna. (Kita kembali sebagai hamba yang bertaubat, ber'ibadah kepada Robb kita dan memuji-Nya\"). Beliau serus saja membaca do'a itu hingga memasuki kota Madinah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 3087,
			"arabicnumber": 3087,
			"text": "Telah bercerita kepada kami [Sulaiman bin Harb] telah bercerita kepada kami [Syu'bah] dari [Muharib bin Ditsar] berkata aku mendengar [Jabir bin 'Abdullah radliallahu 'anhuma] berkata; \"Aku pernah bersama Nabi Shallallahu'alaihiwasallam dalam suatu perjalanan dan ketika kami tiba di Madinah, Beliau berkata kepadaku: \"Masuklah ke dalam masjid lalu shalatlah dua Raka'at",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 3088,
			"arabicnumber": 3088,
			"text": "Telah bercerita kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Ibnu Syihab] dari ['Abdur Rahman bin 'Abdullah bin Ka'ab] dari [bapaknya] dari [pamannya, 'Ubaidullah bin Ka'ab] dari [Ka'ab radliallahu 'anhu] bahwa Nabi Shallallahu'alaihiwasallam apabila tiba kembali dari bepergian di waktu dluha, Beliau memasuki masjid lalu shalat dua Raka'at sebelum duduk",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 3089,
			"arabicnumber": 3089,
			"text": "Telah bercerita kepadaku [Muhammad] telah mengabarkan kepada kami [Waki'] dari [Syu'bah] dari [Muharib bin Ditsar] dari [Jabir bin 'Abdullah radliallahu 'anhuma] bahwa Rasulullah Shallallahu'alaiwasallam ketika tiba di Madinah, Beliau menyembelih seekor hewan sembelihan atau seekor sapi. [Mu'adz] menambahkan dari [Syu'bah] dari [Muharib] bahwa dia mendengar [Jabir bin 'Abdullah] berkata; \"Nabi Shallallahu'alaihiwasallam membeli seeekor unta dariku seharga dua waq dan satu dirham atau seharga dua dirham. Ketika diba di Shiror (nama sebuah lokasi, tiga km arah Timur Madinah) Beliau memerintahkan agar sapi disembelih, lalu mereka pun menikmatinya. Ketika sudah tiba di Madinah, Beliau memerintahkanku agar masuk ke dalam masjid, maka aku shalat dua Raka'at lalu Beliau mengembalikan uang penjualan unta kepadaku",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 3090,
			"arabicnumber": 3090,
			"text": "Telah bercerita kepada kami [Abu Al Walid] telah bercerita kepada kami [Syu'bah] dari [Muharib bin Ditsar] dari [Jabir] berkata; \"Aku kembali dari perjalanan lalu Nabi Shallallahu'alaihiwasallam berkata:.\"Shalatlah dua Raka'at\". Dan Shirar adalah nama di ujung (timur) Madinah",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 294
			}
		}
	]
}