{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3091,
			"arabicnumber": 3091,
			"text": "Telah bercerita kepada kami ['Abdan] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Yunus] dari [Az Zuhriy] berkata telah mengabarkan kepadaku ['Ali bin Al Husain] bahwa [Husain bin 'Ali ASa] mengabarkan kepadanya bahwa ['Ali] berkata; \"Aku memiliki seekor unta betina berumur satu tahun hasil jatah bagianku dari harta ghanimah perang Badar, dan Nabi Shallallahu'alaihiwasallam juga memberiku seekor unta betina lain dari hak seperlima harta ghanimah. Ketika aku hendak menikahi Fathimah binti Rasulullah Shallallahu'alaiwasallam, aku berjanji dengan seorang laki-laki ahli membuat perhiasan dari suku Bani Qainuqa' agar pergi bersamaku. Kami pergi dengan membawa idzkhir (rumput yang harum baunya) yang akan aku jual kepada para ahli perhiasan yang hasilnya aku akan gunakan untuk menyelenggarakan walimah perkawinanku. Ketika aku mengumpulkan barang-barang untuk kedua untaku berupa beberapa pelana, wadah makanan dan tali, kedua untaku menderum (berdiam) di sisi kamar seorang shahabat Anshar, aku kembali setelah selesai mengumpulkan barang-barang. Ternyata aku dapatkan kedua untaku telah dipotong-potong punuknya, dibedah lambungnya dan diambil bagian dalamnya. Aku tidak dapat menguasai kedua mataka ketika melihat pemandangan kedua untaku diperlakukan seperti itu. Maka aku bertanya; \"Siapa yang melakukan ini?\". Orang-orang menjawab; \"Hamzah bin 'Abdul Muthallib yang melakukannya dan sekarang dia sedang berada di Baitullah bersama para pemabuk dari kalangan orang Anshar\". Maka aku berangkat hingga aku bertemu dengan Nabi Shallallahu'alaihiwasallam yang saat itu sedang bersama Zaid bin Haritsah. Nabi Shallallahu'alaihiwasallam dapat mengetahui apa yang aku alami dari wajahku maka Beliau bertanya: \"Ada apa denganmu?\". Aku jawab; \"Wahai Rasulullah, aku belum pernah melihat sekalipun kejadian sekejam seperti hari ini. Hamzah telah menganiaya kedua untaka, ia memotong-motong punuknya dan membedah isi perutnya dan sekarang dia sedang berada di dalam Baitullah bersama para pemabuk\". Maka Nabi Shallallahu'alaihiwasallam meminta rida' Beliau (selendang yang lebar) kemudian mengenakannya lalu berangkat dengan berjalan sedangkan aku dan Zaid bin Haritsah mengilkuti Beliau hingga tiba di Baitullah, tempat Hamzah berada. Beliau meminta izin masuk, mereka pun mengizinkannya dan ternyata mereka adalah sekelompok orang yang sedang mabuk. Maka Rasulullah Shallallahu'alaiwasallam langsung mencela Hamzah atas apa yang telah dilakukannya. Ternyata Hamzah benar-benar dalam keadaan mabuk, kedua matanya merah. Hamzah memandangi Rasulullah Shallallahu'alaiwasallam, lalu mengarahkan pandangannya ke atas, kemudian memandang ke arah lutut Beliau, lalu mengarahkan pandangannya kembali ke atas, kemudian memandang pusar Beliau, lalu mengarahkan pandangan ke atas lagi, kemudian memandang wajah Beliau. Kemudian Hamzah berkata; \"Kalian tidak lain kecuali hamba-hamba sahaya bapakku\". Maka Rasulullah Shallallahu'alaiwasallam mengetahui bahwa dia sedang dalam keadaan mabuk. Beliau pun berbalik dan meninggalkannya dan kamipun keluar bersama Beliau",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3093,
			"arabicnumber": 3093,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3094,
			"arabicnumber": 3094,
			"text": "Telah bercerita kepada kami [Ishaq bin Muhammad Al Farwiy] telah bercerita kepada kami [Malik bin Anas] dari [Ibnu Syihab] dari [Malik bin Aus Al Hadatsan], bahwa [Muhammad bin Jubair] menyebutkan kepadaku suatu cerita dari hadits yang disampaikannya maka aku berangkat menemui Malik bin Aus lalu aku bertanya kepadanya tentang hadits yang dimaksud, maka Malik berkata; \"Ketika aku sedang duduk bersama keluargaku di tengah hari tiba-tiba datang utusan 'Umar bin Al Khaththab menemuiku lalu berkata; \"Penuhilah panggilan Amirul Mu'minin\". Maka aku pergi bersamanya menemui ['Umar] yang ketika itu sedang duduk di atas tikar yang tidak dialasi kasur namun bersandar pada bantal terbuat dari kulit. Aku memberi salam kepadanya lalu duduk. Maka dia berkata; \"Wahai Maal (Malik), sesungguhnya telah datang kepada kami para ahli bait dari kaummu dan aku sudah memerintahkan untuk memberi mereka pemberian yang sedikit dan tidak bernilai, maka terimalah ini dan bagikanlah kepada mereka\". Aku berkata; \"Wahai Amirul Mu'minin, andai engkau perintahkan hal ini kepada selain aku\". Dia berkata; \"Terimalah, hai laki-laki\". Di tengah aku sedang duduk bersamanya, datang kepadanya penjaga pintu yang bernama Yarfaa lalu berkata; \"Apakah kamu membolehkan ['Utsman], ['Abdur Rahman bin 'Auf], [Az Zubair] dan [Sa'ad bin Abi Waqash], mereka minta izin masuk\". 'Umar menjawab; \"Ya\". Lalu dia mengizinkan mereka masuk. Maka mereka masuk dan memberi salam lalu duduk. Begitu juga Yarfaa duduk sebentar lalu berkata; \"Apakah kamu juga membolehkan ['Ali] dan ['Abbas] masuk?\". 'Umar menjawab; \"Ya\". Lalu 'Umar mengizinkan keduanya masuk. Keduanya pun masuk dan memberi salam lalu duduk. 'Abbas berkata; \"Wahai Amirul Mu'minin, putuskanlah antara aku dan orang ini\". Keduanya sedang bertengkar urusan harta yang Allah karuniakan kepada Rasulullah Shallallahu'alaiwasallam berupa fa'i dari harta Bani an-Nadlir. Kelompok orang yang bersama 'Utsman dan para shohabatnya berkata; \"Wahai Amirul Mu'minin, putuskanlah perkara mereka berdua dan legakanlah salah seorang diantara keduanya\". 'Umar berkata; \"Tenanglah kalian!. Dan aku aku minta kepada kalian, demi Allah yang dengan izin-Nya tegak langit dan bumi, apakah kalian mengetahui bahwa Rasulullah Shallallahu'alaiwasallam telah bersabda: \"Kami tidak mewariskan, Apa-apa yang kami tinggalkan menjadi shadaqah?\". Yang Rasulullah Shallallahu'alaiwasallam maksudkan (dengan kata kami) adalah diri Beliau sendiri. Kelompok ('Utsman) berkata; \"Ya, Beliau sudah bersabda demikian\". Maka 'Umar kembali menghadap dan berbicara kepada 'Ali dan 'Abbas; \"Aku minta kepada kalian berdua, demi Allah, apakah kalian berdua mengetahui bahwa Rasulullah Shallallahu'alaiwasallam telah bersabda seperti itu?\". Keduanya menjawab; \"Ya, Beliau sudah bersabda demikian\". 'Umar kemudian berkata; \"Untuk itu aku akan berbicara kepada kalian tentang masalah ini. Sesungguhnya Allah tekah mengkhusukan Rasul-Nya Shallallahu'alaihiwasallam dalam masalah fa'i ini sebagai sesuatu yang tidak Dia berikan kepada siapapun selain Beliau Shallallahu'alaihiwasallam\". Lalu 'Umar membaca firman Allah (QS Al Hasyr ayat 6 yang artinya: (\"Dan apa saja yang dikaruniakan Allah berupa fa'i (rampasan perang) kepada Rasul-Nya dari (harta benda) mereka…) hingga firman-Nya (dan Allah Maha berkuasa atas segala sesuatu\"), ayat ini merupakan kekhususan buat Rasulullah Shallallahu'alaiwasallam. Demi Allah, tidaklah Beliau mengumpulkannya dengan mengabaikan kalian dan juga tidak untuk lebih mementingkan kalian. Sungguh Beliau telah memberikannya kepada kalian dan menyebarkannya di tengah-tengah kalian (kaum Muslimin) dan hingga sekarang masih ada yang tersisa dari harta tersebut. Dan Rasulullah Shallallahu'alaiwasallam telah memberi nafkah belanja kepada keluarga Beliau sebagai nafkah tahunan mereka dari harta fa'i ini lalu sisanya Beliau ambil dan dijadikannya sebagai harta Allah dan Beliau sudah menerapkan semua ini selama hidup Beliau. Aku tanya kepda kalian, bukankah kalian sudah mengetahui ini semua?\". Mereka menjawab; \"Ya. Lalu 'Umar berbicara kepada 'Ali dan 'Abbas; \"Aku tanya kepada kalian berdua, bukankah kamu berdua sudah mengetahui ini semua?\". 'Umar melanjutkan; \"Kemudian Allah mewafatkan Nabi-Nya Shallallahu'alaihiwasallam, kemudian Abu Bakr berkata; \"Akulah wali Rasulullah Shallallahu'alaiwasallam. Lalu Abu Bakr menjadi yang memegang kepemimpinan, maka dia melaksanakan seperti apa yang dilaksanakan oleh Rasulullah Shallallahu'alaiwasallam dan apa yang telah dilakukan oleh Abu Bakr, sungguh Allah mengetahuinya, bahwa aku dalam perkara ini berpendapat bahwa dia orang yang jujur, bijak, lurus dan pengikut kebenaran. Lalu kalian berdua datang kepadaku dan berbicara kepadaku, sedang ucapan kalian satu dan maksud urusan kalian juga satu. Engkau, wahai 'Abbas, datang kepadaku meminta kepadaku bagian dari anak saudara kamu. Dan orang ini, yang 'Umar maksud adalah 'Ali, datang meminta bagian istrinya dari ayahnya. Aku katakan kepada kalian berdua, sesungguhnya Rasulullah Shallallahu'alaiwasallam telah bersabda: \"Kami tidak mewariskan. Apa-apa yang kami tinggalkan menjadi shadaqah\". Setelah jelas bagiku bahwa aku harus memberikannya kepada kalian berdua maka aku akan katakan, jika memang kalian menghendakinya aku akan berikan kepada kalian berdua namun wajib kalian berdua ingat janji Allah dan ketentuan-Nya bahwa kalian sungguh mengetahui tentang urusan ini apa yang telah Rasulullah Shallallahu'alaiwasallam lakukan dan apa yang telah Abu Bakr lakukan, dan juga apa yang telah aku lakukan sejak aku memegang kekuasaan ini dan jika kalian berdua mengatakan berikanlah kepada kami, maka dengan ketentuan seperti itu aku akan berikan kepada kalian berdua. Dan aku ingatkan kepada kalian semua, demi Allah, apakah aku berikan kepada keduanya dengan ketentuan seperti ini. Kelompok 'Utsman berkata; \"Ya\". Kemudian 'Umar menghadap 'Ali dan 'Abbas seraya berkata; \"Aku ingatkan kalian berdua, demi Allah, apakah aku memberikannya kepada kalian berdua berdasarkan ketentuan ini?\". Keduanya menjawab; \"Ya\". 'Selanjutnya 'Umar berkata; \"Lalu kalian menghampiri aku agar aku memutuskan perkara ini dengan ketentuan lain. Sungguh demi Allah yang dengan izin-Nya tegaklah langit dan bumi, aku tidak akan pernah memutuskan masalah ini dengan selain ketentuan ini. Seandainya kalian berdua tidak sanggup atasnya maka serahkanlah kepadaku karena sungguh aku akan mengganti kalian untuk mengurus harta itu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3095,
			"arabicnumber": 3095,
			"text": "Telah bercerita kepada kami [Abu an-Nu'man] telah bercerita kepada kami [Hammad] dari [Abu Hamzah adl-Dluba'iiy] berkata aku mendengar [Ibnu 'Abbas radliallahu 'anhuma] berkata; Telah datang utusan 'Abdul Qois lalu berkata; \"Wahai Rasulullah, dalam kehidupan kami ini, antara kami dan Baginda ada orang-orang kafir suku Mudlar, yang kami tidak dapat melakukan kontak hubungan bersama Baginda kecuali pada saat bulan-bulan Haram. Maka berilah kami suatu perintah yang kami ambil sebagai pegangan, yang dengannya kami mengajak orang-orang di belakang kami\". Maka Beliau bersabda: \"Aku perintahkan kalian dengan empat hal dan aku larang kalian dari empat hal pula. (Yang pertama) aku perintahkan kalian untuk beriman kepada Allah dengan bersyahadat laa ilaaha illallah. Beliau mengepalkan tangan Beliau,. mendirikan shalat, menunaikan zakat, shaum di bulan Ramadlan dan agar kalian menerapkan ketentuan seperlima untuk Allah dari harta ghanimah yang kalian dapat. Dan aku larang kalian dari duba', hantam, naqir, dan muzaffat",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3096,
			"arabicnumber": 3096,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Abu Az Zanad] dari [Al A'roj] dari [Abu Hurairah Radliallahu 'anhu] bahwa Rasulullah Shallallahu'alaiwasallam bersabda: \"Janganlah warisanku dibagi-bagi sebagai dinar. Apa yang aku tinggalkan selain untuk nafkah istri-istriku dan gaji amil zakatku semuanya sebagai shadaqah",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3097,
			"arabicnumber": 3097,
			"text": "Telah bercerita kepada kami ['Abdullah bin Abi Syaibah] telah bercerita kepada kami [Abu Usamah] telah bercerita kepada kami [Hisyam] dari [bapaknya] dari ['Aisyah radliallahu 'anhu] berkata; \"(Ketika) Rasulullah Shallallahu'alaiwasallam wafat tidak ada sesuatupun di rumahku yang dapat dimakan oleh makhluq yang punya nyawa (manusia atau hewan) kecuali sedikit gandum yang ada pada Rak makanan milikku, lalu aku memakannya sebagian hingga beberapa lama kemudian aku timbang lalu rusak (habis)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3098,
			"arabicnumber": 3098,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Yahya] dari [Sufyan] berkata telah bercerita kepadaku [Abu Ishaq] berkata aku mendengar ['Amru binAl Harits] berkata; \"Tidaklah Nabi Shallallahu'alaihiwasallam meninggalkan sesuatu (saat wafat) kecuali sebilah pedang Beliau, baghal yang berwarna putih dan sebidang tanah yang Beliau jadikan sebagai shadaqah",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3099,
			"arabicnumber": 3099,
			"text": "Telah bercerita kepada kami [Hibban bin Musa] dan [Muhammad] keduanya berkata telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Ma'mar] dan [Yunus] dari [Az Zuhriy] berkata telah mengabarkan kepadaku ['Ubaidullah bin 'Abdullah bin 'Uqbah bin Mas'ud] bahwa ['Aisyah radliallahu 'anhu], istri Nabi Shallallahu'alaihiwasallam berkata; \"Ketika sakit Rasulullah Shallallahu'alaiwasallam semakin parah, Beliau meminta izin kepada istri-istri Beliau agar dirawat di rumahku, maka Beliau diizinkan",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3100,
			"arabicnumber": 3100,
			"text": "Telah bercerita kepada kami [Ibu Abi Maram] telah bercerita kepada kami [Nafi'] aku mendengar [Ibnu Abi Mulaikah] berkata, ['Aisyah radliallahu 'anhu] berkata; \"Nabi Shallallahu'alaihiwasallam wafat di rumahku saat giliran malamku dan Beliau berbaring diantara dadaku bagian atas dan bawah sehingga Allah menyatukan antara air ludahku dan air ludah Beliau\". Dia ('Aisyah radliallahu 'anhu) melanjutkan; \"'Abdur Rahman masuk dengan memegang siwak maka siwak itu dibagi dua oleh Nabi Shallallahu'alaihiwasallam lalu aku ambil dan aku kunyah (untuk melembutkan) kemudian aku gunakan untuk membersihkan gigi Beliau dengan siwak tersebut",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3101,
			"arabicnumber": 3101,
			"text": "Telah bercerita kepada kami [Sa'id bin 'Uqair] berkata telah bercerita kepadaku [Al Laits] berkata telah bercerita kepadaku ['Abdur Rahman bin Khalid] dari [Ibnu Syihab] dari ['Ali bin Husain] bahwa [Shafiyah, istri Nabi Shallallahu'alaihiwasallam] mengabarkan kepadanya bahwa dia pernah menemui Rasulullah Shallallahu'alaiwasallam saat Beliau sedang berbaring di dalam masjid pada sepuluh hari terakhir bulan Ramadlan. Setelah itu dia berdiri untuk kembali maka Rasulullah Shallallahu'alaiwasallam ikut pergi bersamanya hingga ketika sampai sedikit di luar pintu masjid dan dekat rumah Ummu Salamah, istri Nabi Shallallahu'alaihiwasallam, ada dua orang laki-laki Kaum Anshar yang lewat lalu keduanya memberi salam kepada Rasulullah Shallallahu'alaiwasallam kemudian bergegas pergi. Maka Rasulullah Shallallahu'alaiwasallam berkata kepada keduanya: \"Sebentar (perempuan ini isteriku)!\". Kedua orang itu berkata; \"Maha suci Allah, wahai Rasulullah\". Kedua orang itu pun merasa segan terhadap ucapan beliau. Maka kemudian Rasulullah Shallallahu'alaiwasallam bersabda: \"Sesungguhnya syetan masuk kepsda manusia lewat aliran darah dan aku khawatir bila syetan telah membisikkan sesuatu dalam hati kalian berdua",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3102,
			"arabicnumber": 3102,
			"text": "Telah bercerita kepada kami [Ibrahim bin Al Mundzir] telah bercerita kepada kami [Anas bin 'Iyadl] dari ['Ubaidullah] dari [Muhammad bin Yahya bin Habban] dari [Wasi' bin Habban] dari ['Abdullah bin 'Umar radliallahu 'anhuma] berkata; \"Aku memanjat ke atas rumah Hafshah maka aku lihat Nabi Shallallahu'alaihiwasallam sedang membuang hajat dengan membelakangi qiblat dan menghadap ke arah negeri Syam",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3103,
			"arabicnumber": 3103,
			"text": "Telah bercerita kepada kami [Ibrahim bin Al Mundzir] telah bercerita kepada kami [Anas bin 'Iyadl] dari [Hisyam] dari [bapaknya] bahwa ['Aisyah radliallahu 'anhu] berkata; \"Rasulullah Shallallahu'alaiwasallam pernah melaksanakan shalat 'Ashar sementara matahari (cahayanya) belum berlalu dari kamarnya (rumah 'Aisyah radliallahu 'anhu)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3104,
			"arabicnumber": 3104,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Juwairiyah] dari [Nafi'] dari ['Abdullah radliallahu 'anhu] berkata; Nabi Shallallahu'alaihiwasallam berdiri menyampaikan khutbah kepada kami lalu memberi isyarat ke arah tempat tinggal 'Aisyah seraya bersabda: \"Disana ada fitnah, sebanyak tiga kali, Disanalah tempat munculnya tanduk syetan",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3105,
			"arabicnumber": 3105,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari ['Abdullah bin Abu Bakr] dari ['Amrah, putri 'Abdur Rahman] bahwa ['Aisyah radliallahu 'anhu, istri Nabi Shallallahu'alaihiwasallam] mengabarkan kepadanya bahwa Rasulullah Shallallahu'alaiwasallam pernah bersamanya (di rumah 'Aisyah) lalu dia mendengar suara manusia meminta izin masuk di rumah Hafshah lalu aku katakan; \"Wahai Rasulullah, itu ada laki-laki minta izin masuk di rumah baginda!\". Maka Rasulullah Shallallahu'alaiwasallam bersabda: \"Aku kira dia itu pamannya Hafshah secara susuan. Ingat, sepersusuan itu melarang segala hal yang terlarang karena serahim",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3106,
			"arabicnumber": 3106,
			"text": "Telah bercerita kepada kami [Muhammad bin 'Abdullah Al Anshariy] berkata telah bercerita kepadaku [bapakku] dari [Tsumamah] dari [Anas] bahwa Abu Bakr radliallahu 'anhu ketika diangkat menjadi kholifah, dia mengutus dirinya ke negeri Bahrain dan menulis surat untuknya surat ini dan memberi stempel kenabian Nabi Shallallahu'alaihiwasallam. Pada stempel tersebut ada tiga tulisan, yaitu tulisan Muhammad, Rasul dan Allah",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3107,
			"arabicnumber": 3107,
			"text": "Telah bercerita kepadaku ['Abdullah bin Muhammad] telah bercerita kepada kami [Muhammad bin 'Abdullah Al Asadiy] telah bercerita kepada kami ['Isa bin Thahman] berkata; 'Anas pernah memperlihatkan kepada kami sepasang sandal yang terbuat bukan dari kulit yang memiliki tali di ujung depannya (untuk mengikat jari) \". Kemudian setelah itu [Tsabit Al Bunaniy] bercerita kepadaku dari [Anas] bahwa sandal itu adalah sandal Nabi Shallallahu'alaihiwasallam",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3108,
			"arabicnumber": 3108,
			"text": "Telah bercerita kepadaku [Muhammad bin Basysyar] telah bercerita kepada kami ['Abdul Wahhab] telah bercerita kepada kami [Ayyub] dari [Humaid bin Hilal] dari [Abu Burdah] berkata; \" ['Aisyah] radliallahu 'anhu mengeluarkan (memperlihatkan) kepada kami sepotong baju yang sudah lusuh lalu berkata; \"Saat mengenakan baju inilah nyawa Nabi Shallallahu'alaihiwasallam dicabut\". Dan [Sulaiman] menambahkan dari [Humaid] dari [Abu Burdah] berkata; \" ['Aisyah] radliallahu 'anhu mengeluarkan (memperlihatkan) kepada kami selembar kain selimut yang tebal yang dibuat di negeri Yaman dan sepotong baju\". Dari sinilah kami menyebutnya sebagai baju muballadah (yang sudah lusuh)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3109,
			"arabicnumber": 3109,
			"text": "Telah bercerita kepada kami ['Abdan] dari [Abu Hamzah] dari ['Ashim] dari [Ibnu Sirin] dari [Anas bin Malik radliallahu 'anhu] berkata; \"Gelas milik Nabi Shallallahu'alaihiwasallam pecah lalu Beliau mengumpulkan dan mengikatnya dengan Rantai terbuat dari perak\". 'Ashim berkata; \"Aku melihat gelas tersebut lalu kupergunakan untuk minum",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3110,
			"arabicnumber": 3110,
			"text": "Telah bercerita kepada kami [Sa'id bin Muhammad Al Jarmiy] telah bercerita kepada kami [Ya'qub bin Ibrahim] telah bercerita kepada kami [bapakku] bahwa [Al Walid bin Katsir] bercerita kepadanya dari [Muhammad bin 'Amru bin Halhalah ad-Du'aliy] bercerita kepadanya bahwa [Ibnu Syihab] bercerita kepadanya bahwa ['Ali bin Husain] bercerita kepadanya bahwa mereka ketika tiba di Madinah dari bertemu dengan Yazib bin Mu'awiyah di masa terbunuhnya Husain bin 'Ali Rahmatullah 'alaihi, dia (Ali bin Husain) ditemui oleh Al [Miswar bin Makhramah] lalu dia (Al Miswar) berkata kepadanya' \"Apakah kamu ada keperluan dengan suatu perintah untukku?\". Maka aku katakan kepadanya; \"Tidak\". Lalu dia berkata lagi kepadanya; \"Apakah kamu termasuk orang yang diberi pedang Rasulullah Shallallahu'alaiwasallam?. Karena aku khawatir bila mereka dapat mengambilnya dari kamu. Demi Allah, seandainya kamu menyerahkannya kepadaku, aku tidak akan pernah memberikannya kepada mereka untuk selama-lamanya hingga aku terbunuh, dan sesungguhnya 'Ali bin Abu Thalib pernah meminang anak perempuan Abu Jahal (untuk dijadikan istri) disamping Fathimah 'alaihi salam, lalu kudengar Rasulullah Shallallahu'alaiwasallam memberikan khuthbah kepada manusia tentang masalah itu di atas mimbar ini sedang aku saat itu sudah baligh, Beliau bersabda: \"Sesungguhnya Fathimah adalah bagian dariku dan aku sangat khawatir dia terfitnah dalam agamanya\". Kemudian Beliau menyebutkan kerabat Beliau dari Bani 'Abdu Syamsi seraya menyanjungnya dalam hubungan kekerabatannya yang baik kepada Beliau. Beliau melanjutkan: \"Dia berbicara kepadaku lalu membenarkan aku serta berjanji kepadaku dan dia menunaikan janjinya kepadaku. Sungguh aku bukanlah orang yang mengharamkan suatu yang halal dan bukan pula menghalalkan apa yang haram akan tetapi, demi Allah, tidak akan bersatu putri Rasulullah Shallallahu'alaiwasallam dengan putri musuh Allah selamanya",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3111,
			"arabicnumber": 3111,
			"text": "Telah bercerita kepada kami [Qutaibah bin Sa'id] telah bercerita kepada kami [Sufyan] dari [Muhammad bin Suwqah] dari [Mundzir] dari [Ibnu Al Hanafiyyah] berkata; 'Seandainya 'Ali radliallahu 'anhu mengingat 'Utsman radliallahu 'anhu, maka ia teringat tentangnya saat orang-orang datang kepadanya mengadukan perilaku para 'amil (petugas zakat) 'Utsman. Maka ['Ali] berkata kepadaku; \"Pergilah kamu menemui 'Utsman dan kabarkan kepadanya bahwa itu adalah shadaqah Rasulullah Shallallahu'alaiwasallam dan perintahkanlah para 'amilmu untuk melaksanakan sesuai ketentuannya\". Maka aku menemui 'Utsman dengan membawa pesan 'Ali tersebut. 'Utsman berkata; \"Singkirkanlah sedekah itu dari kami\". Kemudian kutemui 'Ali dengan membawa sedekah yang seharusnya untuk 'Utsman, lalu kukabarkan kejadiannya, maka dia berkata; \"Biarkanlah zakat itu sebagaimana ditempat kamu mengambilnya\". [Al Humaidiy] berkata, telah bercerita kepada kami [Sufyan] telah bercerita kepada kami [Muhammad bin Suwqah] berkata aku mendengar [Mundzir Ats-Tsauriy] dari [Ibnu Al Hanafiyyah] berkata; \" [Bapakku] mengutusku dan berkata; peganglah surat ini dan bawa kepada 'Utsman karena didalamnya ada ketentuan perintah Nabi Shallallahu'alaihiwasallam tentang masalah shadaqah (zakat)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3112,
			"arabicnumber": 3112,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3113,
			"arabicnumber": 3113,
			"text": "Telah bercerita kepada kami [Badal bin Al Muhabbar] telah mengabarkan kepada kami [Syu'bah] berkata telah mengabarkan kepadaku [Al Hakam] berkata aku mendengar [Ibnu Abi Laila] telah bercerita kepada kami ['Ali] bahwa Fathimah 'alaihas salam pernah mengeluh tentang apa yang dialaminya karena menumbuk dan menggiling tepung. Kemudian ia mendapat berita bahwa Rasulullah Shallallahu'alaiwasallam mendapatkan tawanan, maka ia datangi Beliau sekaligus ia minta seorang pembantu namun Beliau tidak setuju. Kemudian Fathimah menceritakan perkaranya kepada 'Aisyah. Ketika Rasulullah Shallallahu'alaiwasallam datang, 'Aisyah menceritakannya kepada Beliau. Maka Beliau mendatangi kami berdua saat kami sudah masuk ke tempat tidur kami untuk beristirahat lalu Beliau berkata: \"Tetaplah kalian disitu\". Hingga aku mendapatkan kedua kaki Beliau yang dingin di dekat dadaku. Beliau bersabda: \"Maukah kalian berdua aku tunjukkan sesuatu yang lebih baik dari apa yang kalian berdua pinta, yaitu jika kalian sudah berada di tempat tidur kalian, bacalah takbir (Allahu Akbar) tiga puluh empat kali, hamdalah (alhamdulillah) tiga puluh tiga kali dan tasbih (subhaanallah) tiga puluh tiga kali karena sesungguhnya bacaan-bacaan ini lebih baik dari apa yang kalian berdua memintanya",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3114,
			"arabicnumber": 3114,
			"text": "Telah bercerita kepada kami [Abu Al Walid] telah bercerita kepada kami [Syu'bah] dari [Sulaiman] dan [Manshur] dan [Qatadah] mereka mendengar [Salim bin Abi Al Ja'di] dari [Jabir bin 'Abdullah radliallahu 'anhuma] berkata; \"Seorang dari kami Kaum Anshar dikaruniakan anak lalu dia hendak memberi nama dengan Muhammad\". [Syu'bah] berkata dalam hadits riwayat [Manshur]; 'Bahwa ada seorang Anshar berkata; \"Aku bawa anak itu dengan kugendong diatas tengkukku untuk kutemui Nabi Shallallahu'alaihiwasallam\". Dan dalam hadits Sulaiman; \"Seseorang dikaruniakan anak lalu dia hendak memberi nama dengan Muhammad\". Beliau Shallallahu'alaihiwasallam bersabda: \"Berikanlah nama dengan namaku tapi jangan dengan panggilanku sebab aku dinamakan sebagai Qasim karena aku adalah yang membagi-bagi di antara kalian\". Dan berkata [Hushain]: \"Aku diutus sebagai Qasim yaitu yang membagi-bagikan di antara kalian\". Berkata ['Amru] telah mengabarkan kepada kami [Syu'bah] dari [Qatadah] berkata aku mendengar [Salim] dari [Jabir]; \"Ada seseorang yang berkehendak menamakan anaknya dengan Al Qasim maka Nabi Shallallahu'alaihiwasallam bersabda: \"Berilah nama dengan namku tapi jangan memberi julukan dengan julukan aku",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3115,
			"arabicnumber": 3115,
			"text": "Telah bercerita kepada kami [Muhammad bin Yusuf] telah bercerita kepada kami [Sufyan] dari [Al A'masy] dari [Salim bin Abi Al Ja'di] dari [Jabir bin 'Abdullah Al Anshariy] berkata; \"Ada seorang dari kami dikaruniai anak, lalu dia berkehendak memberi nama dengan Al Qasim, maka orang-orang Anshar berkata; \"Kami tidak akan memanggil kamu dengan julukan Abu Al Qasim dan tidak akan memuliakan kamu dengan itu sekejappun\". Kemudian orang itu menemui Nabi Shallallahu'alaihiwasallam seraya berkata; \"Wahai Rasulullah, aku dikaruniai seorang anak kemudian aku memberinya nama Al Qasim namun oang-orang Anshar berkata; \"Kami tidak akan memanggil kamu dengan julukan Abu Al Qasim dan tidak akan memuliakan kamu dengan itu sekejappun\". Maka Nabi Shallallahu'alaihiwasallam bersabda: \"Apa yang dilakukan kaum Anshar benar. Berilah nama dengan namaku tapi jangan memberi julukan dengan julukan aku karena aku adalah Qasim (orang yang membagi-bagi)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3116,
			"arabicnumber": 3116,
			"text": "Telah bercerita kepada kami [Hibban bin Musa] telah mengabarkan kepada kami ['Abdullah] dari [Yunus] dari [Az Zuhriy] dari [Humaid bin 'Abdur Rahman] bahwa dia mendengar [Mu'awiyah] berkata; Rasulullah Shallallahu'alaiwasallam bersabda: \"Siapa yang Allah kehendaki baik pada dirinya maka Allah akan pahamkan orang itu dalam urusan agama. Allah adalah Yang Maha Pemberi sedangkan aku Al Qasim (yang membagi-bagi) dan akan senantiasa ummat ini menang atas orang-orang yang menyelisihi mereka hingga datang urusan Allah, sedang mereka berjaya (dengan kemenangan)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3117,
			"arabicnumber": 3117,
			"text": "Telah bercerita kepada kami [Muhammad bin Sinan] telah bercerita kepada kami [Fulaih] telah bercerita kepada kami [Hilal] dari ['Abdur Rahman bin Abi 'AMrah] dari [Abu Hurairah Radliallahu 'anhu] bahwa Rasulullah Shallallahu'alaiwasallam bersabda: \"Aku tidak memberi kalian dan juga tidak menghalangi (pemberian) kepada kalian. Sesungguhnya aku hanyalah yang membagi-bagi sesuai apa yang diperintahkan kepadaku",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3118,
			"arabicnumber": 3118,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yazid] telah bercerita kepada kami telah bercerita kepada kami [Sa'id bin Abi Ayyub] berkata telah bercerita kepadaku [Abu Al Aswad] dari [Ibnu Abi 'Ayyasy, yang namanya Nu'man] dari [Khaulah Al Anshariyyah radliallahu 'anhu] berkata; \"Aku mendengar Nabi Shallallahu'alaihiwasallam bersabda: \"Sesungguhnya ada orang-orang yang mendistribusikan harta Allah dengan jalan yang tidak benar, maka bagi mereka neraka pada hari qiyamat",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3119,
			"arabicnumber": 3119,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Khalid] telah bercerita kepada kami [Hushain] dari ['Amir] dari ['Urwah Al Bariqiy Radliallahu 'anhu] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Pada seekor kuda terikat pada ubun-ubunya kebaikan berupa pahala dan ghanimah sampai hari qiyamat",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3120,
			"arabicnumber": 3120,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] telah bercerita kepada kami [Abu Az Zanad] dari [Al A'roj] dari [Abu Hurairah radliallahu 'anhu] bahwa Nabi Shallallahu'alaihiwasallam bersabda: \"Jika Kisra (Raja Persia) binasa maka tidak akan ada lagi Kisra lain sesudahnya dan jika Qaishar (Raja Romawi) binasa maka tidak akan ada lagi Qaishar lain sesudahnya. Dan demi Dzat yang jiwaku berada di tangan-Nya, sungguh kalian akan mengambil perbendaharaan kekayaan keduanya (sebagai ghanimah) di jalan Allah",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3121,
			"arabicnumber": 3121,
			"text": "Telah bercerita kepada kami [Ishaq] dia mendengar [Jarir] dari ['Abdul Malik] dari [Jabir bin Samrah Radliallahu 'anhu] berkata; Rasulullah Shallallahu'alaiwasallam bersabda: \"Jika Kisra (Raja Persia) binasa maka tidak akan ada lagi Kisra lain sesudahnya dan jika Qaishar (Raja Romawi) binasa maka tidak akan ada lagi Qaishar lain sesudahnya. Dan demi Dzat yang jiwaku berada di tangan-Nya, sungguh kalian akan mengambil perbendaharaan kekayaan keduanya (sebagai ghanimah) di jalan Allah",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3122,
			"arabicnumber": 3122,
			"text": "Telah bercerita kepada kami [Muhammad bin Sinan] telah bercerita kepada kami [Husyaim] telah mengabarkan kepada kami [Sayyar] telah bercerita kepada kami [Yazid Al Faqir] telah bercerita kepada kami [Jabir bin 'Abdullah radliallahu 'anhuma] berkata; Rasulullah Shallallahu'alaiwasallam bersabda: \"Dihalalkan untukku ghanimah (harta Rampasan perang)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3123,
			"arabicnumber": 3123,
			"text": "Telah bercerita kepada kami [Isma'il] berkata telah bercerita kepadaku [Malik] dari [Abu Az Zanad] dari [Al A'roj] dari [Abu Hurairah radliallahu 'anhu] bahwa Rasulullah Shallallahu'alaiwasallam bersabda: \"Allah menjamin bagi siapa yang berjihad di jalan-Nya, tak ada niyat bagi orang itu untuk berangkat selain untuk berjihad di jalan-Nya dan membenarkan kalimat-Nya, agar untuk memasukkannya ke dalam surga atau Allah mengembalikannya ke tempat tinggalnya yang ia tinggalkan dengan membawa pulang pahala atau ghanimah",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3124,
			"arabicnumber": 3124,
			"text": "Telah bercerita kepada kami [Muhammad bin Al 'Alaa'] telah bercerita kepada kami [Ibnu Al Mubarak] dari [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah Radliallahu 'anhu] berkata; Rasulullah Shallallahu'alaiwasallam bersabda: \"Ada seorang Nabi diantara para Nabi yang berperang lalu berkata kepada kaumnya; \"Janganlah mengikuti aku seseorang yang baru saja menikahi wanita sedangkan dia hendak menyetubuhinya karena dia belum lagi menyetubuhinya (sejak malam pertama), dan jangan pula seseorang yang membangun rumah-rumah sedang dia belum memasang atap-atapnya, dan jangan pula seseorang yang membeli seekor kambing atau seekor unta yang bunting sedang dia menanti-nanti hewan itu beranak\". Maka Nabi tersebut berperang dan ketika sudah hampir mendekati suatu kampung datang waktu shalat 'Ashar atau sekitar waktu itu lalu Nabi itu berkata kepada matahari; \"Kamu adalah hamba yang diperintah begitu juga aku hamba yang diperintah. Ya Allah tahanlah matahari ini untuk kami. Maka matahari itu tertahan (berhenti beredar) hingga Allah memberikan kemenangan kepada Nabi tersebut. Kemudian Nabi tersebut mengumpulkan ghanimah lalu tak lama kemudian datanglah api untuk memakan (menghanguskannya) namun api itu tidak dapat memakannya. Maka Nabi tersebut berkata; \"Sungguh diantara kalian ada yang berkhiyanat (mencuri ghanimah) untuk itu hendaklah dari setiap suku ada seorang yang berbai'at kepadaku. Maka ada tangan seorang laki-laki yang melekat (berjabatan tangan) dengan tangan Nabi tersebut lalu Nabi tersebut berkata; \"Dikalangan sukumu ada orang yang mencuri ghanimah maka hendaklah suku kamu berbai'at kepadaku. Maka tangan dua atau tiga orang laki-laki suku itu berjabatan tangan dengan tangan Nabi tersebut lalu Nabi tersebut berkata; \"Di kalangan sukumu ada orang yang mencuri ghanimah\". Maka mereka datang dengan membawa emas sebesar kepala sapi lalu meletakkannya' Kemudian datanglah api lalu menghanguskannya. Kemudian Allah menghalalkan ghanimah untuk kita karena Allah melihat kelemahan dan ketidak mampuan kita sehingga Dia menghalalkannya untuk kita",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3125,
			"arabicnumber": 3125,
			"text": "Telah bercerita kepada kami [Shadaqah] telah mengabarkan kepada kami ['Abdur Rahman] dari [Malik] dari [Zaid bin Aslam] dari [bapaknya] berkata, ['Umar bin radliallahu 'anhu] berkata; \"Kalaulah tidak (memikirkan) Kaum Muslimin yang lain tentulah aku sudah membagi-bagikan setiap wilayah yang aku taklukan sebagaimana Nabi Shallallahu'alaihiwasallam telah membagi-bagikan tanah Khoibar",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3126,
			"arabicnumber": 3126,
			"text": "Telah bercerita kepadaku [Muhammad bin Basysyar] telah bercerita kepada kami [Ghundar] telah bercerita kepada kami [Syu'bah] dari ['Amru] berkata aku mendengar [Abu Wa'il] berkata telah bercerita kepadaku [Abu Musa Al Asy'ariy radliallahu 'anhu] berkata; \"Ada seorang Arab Baduy berkata kepada Nabi Shallallahu'alaihiwasallam: \" Ada seseorang berperang untuk mendapatkan ghanimah, seseorang yang lain agar menjadi terkenal dan seseorang yang lain lagi untuk dilihat kedudukannya, manakah yang disebut fii sabilillah?\". Maka Beliau bersabda: \"Siapa yang berperang untuk meninggikan kalimat Allah dialah yang disebut fii sabilillah",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3127,
			"arabicnumber": 3127,
			"text": "Telah bercerita kepada kami ['Abdullah bin 'Abdul Wahhab] telah bercerita kepada kami [Hammad bin Zaid] dari [Ayub] dari ['Abdullah bin Abi Mulaikah] bahwa Nabi Shallallahu'alaihiwasallam dihadiahi beberapa potong baju terbuat dari sutera yang berkancing emas lalu Beliau membagi-bagikannya kepada orang-orang dari shahabat Beliau dan menyisakan satu potong untuk Makhramah bin Naufal. Maka dia datang bersama anaknya, [Al Miswar bin Makhramah] lalu berdiri di depan pintu seraya berkata; \"Panggilkan Beliau untukku\" Nabi Shallallahu'alaihiwasallam mendengar suaranya lalu Beliau mengambil baju yang tersisa, dan beliau berikan kepadanya seraya memperlihatkan kebagusan baju tersebut serta berkata: \"Wahai, Abu Al Miswar, sengaja aku sisakan untukmu, wahai, Abu Al Miswar, sengaja aku sisakan untukmu\". Abu Al Miswar memang tabi'at suaranya keras. Dan [Ibnu 'Ulayyah] meriwayatkan dari [Ayyub]. Dan berkata [Hatim bin Wardan] telah bercerita kepada kami [Ayub] dari [Ibnu Abi Mulaikah] dari [Al Miswar bin Makhramah]; \"Kepada Nabi Shallallahu'alaihiwasallam didatangkan beberapa potong baju\". Hadits ini diikuti pula oleh [Al Laits] dari [Ibnu Abi Mulaikah]",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3128,
			"arabicnumber": 3128,
			"text": "Telah bercerita kepada kami ['Abdullah bin Abu Al Aswad] telah bercerita kepada kami [Mu'tamir] dari [bapaknya] berkata aku mendengar [Anas bin Malik radliallahu 'anhu] berkata; Ada seseorang yang meminta disegerakan bagian kebun kurma. Ketika suku Quraizhah dan an-Nadlir dapat ditaklukan, orang itu mengembalikan kepada mereka (kaum Anshar)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3129,
			"arabicnumber": 3129,
			"text": "Telah bercerita kepada kami [Ishaq bin Ibrahim] berkata, aku bertanya kepada [Abu Usamah]; \"Apakah [Hisyam bin 'Urwah] bercerita kepada kalian dari [bapaknya] dari ['Abdullah bin Az Zubair], maka dia berkata; \"Ketika Az Zubair terlibat dalam perang Unta, dia memanggilku, maka aku berdiri di sampingnya. Dia berkata; \"Wahai anakku, ketahuilah bahwa tidaklah ada yang terbunuh pada hari ini melainkan dia orang zhalim atau orang yang terzhalimi. Dan sungguh aku tidak melihat diriku akan terbunuh hari ini melainkan sebagai orang yang terzhalimi dan sungguh perkara yang paling menggelisahkanku adalah hutang yang ada padaku, apakah kamu memandang dari hutang itu masih akan ada yang menyisakan harta untuk kita?\". Dia melanjutkan; \"Wahai anakku, untuk itu juallah harta kita lalu lunasilah hutangku\". Az Zubair berwasiat dengan sepertiga hartanya, dan sepertiga untuk anak-anaknya, yaitu Bani 'Abdullah bin Az Zubair. Dia berkata lagi; \"Sepertiga dari sepertiga. Jika ada lebih dari harta kita setelah pelunasan hutang maka sepertiganya untuk anakmu\". Hisyam berkata; Dan sebagian dari anak-anak 'Abdullah sepadan usianya dengan sebagian anak-anak Az Zubair yaitu Khubaib dan 'Abbad. Saat itu Az Zubair mempunyai sembilan anak laki-laki dan sembilan anak perempuan\". 'Abdullah berkata; Dia (Az Zubair) telah berwasiat kepadaku tentang hutang-hutangnya dan berkata; \"Wahai anakku, jika kamu tidak mampu untuk membayar hutangku maka mintalah bantuan kepada majikanku\". 'Abdullah berkata; \"Demi Allah, aku tidak tahu apa yang dia maksud hingga aku bertanya, wahai bapakku, siapakan majikan bapak?\". Dia berkata; \"Allah\". 'Abdullah berkata; \"Demi Allah aku tidak menemukan sedikitpun kesulitan dalam melunasi hutangnya setelah aku berdo'a; \"YA MAULA ZUBAIR, IQDHI 'ANHU DAINAHU\" Wahai Tuannya Az Zubair, lunasilah hutangnya\". Maka Allah melunasinya. (Selanjutnya 'Abdullah menuturkan); \"Kemudian Az Zubair radliallahu 'anhu terbunuh dan tidak meninggalkan satu dinar pun juga dirham kecuali dua bidang tanah yang salah satunya berupa hutan serta sebelas rumah di Madinah, dua rumah di Bashrah, satu rumah di Kufah dan satu rumah lagi di Mesir. 'Abdullah berkata; \"Hutang yang menjadi tanggungannya terjadi ketika ada seseorang yang datang kepadanya dengan membawa harta untuk dititipkan dan dijaganya, Az Zubair berkata; \"Jangan, tapi jadikanlah sebagai pinjamanku (yang nanti akan aku bayar) karena aku khawatir akan hilang sedangkan aku tidak memiliki kekuasaan sedikitpun dan tidak juga sebagai pemungut hasil bumi (upeti) atau sesuatu kekuasaan lainnya melainkan selalu ikut berperang bersama Nabi Shallallahu'alaihiwasallam, Abu Bakr, 'Umar atau 'Utsman radliallahu 'anhum. 'Abdullah bin Az Zubair berkata; \"Kemudian aku menghitung hutang yang ditanggungnya dan ternyata aku dapatkan sebanyak dua juta dua Ratus dua puluh ribu\". 'Urwah berkata; \"Hakim bin Hizam menemui 'Abdullah bin Az Zubair seraya berkata; \"Wahai anak saudaraku, berapa banyak hutang saudaraku?\". 'Abdullah merahasiakannya dan berkata; 'Dua Ratus ribu\". Maka Hakim berkata; \"Demi Allah, aku mengira harta kalian tidak akan cukup untuk melunasi hutang-hutang ini\". Maka 'Abdullah berkata kepadanya; \"Bagaimana pendapatmu seandainya harta yang ada dua juta dua Ratus ribu?\". Hakim berkata; \"Aku mengira kalian tetap tidak akan sanggup melunasinya. Seandainya kalian tidak mampu mintalah bantuan kepadaku\". 'Urwah berkata; \"Dahulu Az Zubair membeli hutan itu seratus tujuh puluh ribu lalu 'Abdullah menjualnya dengan harga satu juta enam Ratus ribu kemudian dia berdiri dan berkata; \"Bagi siapa saja yang mempunyai hak (piutang) atas Az Zubair hendaklah dia menagih haknya kepada kami dari hutan ini\". Maka 'Abdullah bin Ja'far datang kepadanya karena Az Zubair berhutang kepadanya sebanyak empat Ratus ribu seraya berkata kepada 'Abdullah; \"Kalau kalian mau, hutang itu aku bebasakan untuk kalian\". 'Abdullah berkata; \"Tidak\". 'Abdullah bin Ja'far berkata lagi; \"Atau kalau kalian mau kalian boleh lunasi di akhir saja (tunda) \". 'Abdullah berkata; \"Tidak\". 'Abdullah bin Ja'far berkata lagi; 'Kalau begitu, ukurlah bagian hakku\". 'Abdullah berkata; \"Hak kamu dari batas sini sampai sana\". ('Urwah) berkata; \"Maka 'Abdullah menjual sebagian dari tanah hutan itu sehingga dapat melunasi hutang tersebut dan masih tersisa empat setengah bagian lalu dia menemui Mu'awiyah yang saat itu bersamanya ada 'Amru bin 'Utsman, Al Mundzir bin Az Zubair dan Ibnu Zam'ah. Mu'awiyah bertanya kepadanya; \"Berapakah nilai hutan itu? '. 'Abdullah menjawab; 'Setiap bagian bernilai seratus ribu\". Mu'awiyah bertanya lagi; \"Sisanya masih berapa?\". 'Abdullah berkata; \"Empat setengah bagian\". Al Mundzir bin Az Zubair berkata; \"Aku mengambil bagianku senilai seratus ribu\". 'Amru bin 'Utsman berkata; \"Aku mengambil bagianku senilai seratus ribu\". Dan berkata Ibnu 'Zam'ah; \"Aku juga mengambil bagianku seratus ribu\". Maka Mu'awiyah berkata; \"Jadi berapa sisanya?\". 'Abdullah berkata; \"Satu setengah bagian\". Mu'awiyah berkata; \"Aku mengambilnya dengan membayar seratus lima puluh ribu\". 'Urwah berkata; \"Maka 'Abdullah bin Ja'far menjual bagiannya kepada Mu'awiyah dengan harga enam Ratus ribu\". Setelah ('Abdullah) Ibnu Az Zubair menyelesaikan pelunasan hutang bapaknya, anak-anak Az Zubair (yang lain) berkata; \"Bagilah hak warisan kami\". 'Abdullah berkata; \"Demi Allah, aku tidak akan membagikannya kepada kalian sebelum aku umumkan pada musim-musim hajji selama empat musim yaitu siapa yang mempunyai hak (piutang) atas Az Zubair hendaklah menemui kami agar kami melunasinya\". 'Urwah berkata; \"Demikianlah 'Abdullah mengumumkan pada setiap musim hajji. Setelah berlalu empat musim dia membagikannya kepada mereka (anak-anak Az Zubair) \". 'Urwah berkata; Adalah Az Zubair meninggalkan empat orang istri, maka 'Abdullah menyisihkan sepertiga harta bapaknya sebagai wasiat bapaknya sehingga setiap istri Az Zubair mendapatkan satu juta dua Ratus ribu sedangkan harta keseluruhan milik Az Zubair berjumlah lima puluh juta dua Ratus ribu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3130,
			"arabicnumber": 3130,
			"text": "Telah bercerita kepada kami [Musa] telah bercerita kepada kami [Abu 'Awanah] telah bercerita kepada kami ['Utsman bin Mawhab] dari [Ibnu 'Umar radliallahu 'anhuma] berkata; \"Sesungguhnya alasan tidak ikut sertanya 'Utsman dalam perang Badar karena dia sedang menunggui putri Rasulullah Shallallahu'alaiwasallam yang sedang sakit. Nabi Shallallahu'alaihiwasallam berkata kepadanya: \"Kamu mendapatkan pahala seperti orang yang ikut terlibat dalam perang Badar dan hak bagiannya (ghanimah)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3132,
			"arabicnumber": 3132,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3133,
			"arabicnumber": 3133,
			"text": "Telah bercerita kepada kami ['Abdullah bin 'Abdul Wahhab] telah bercerita kepada kami [Hammad] telah bercerita kepada kami [Ayyub] dari [Abu Qalabah] berkata telah bercerita kepadaku [Al Qasim bin 'Ashim Al Kulaibiy], hadits Al Qasim aku menghafalnya dari [Zahdam] berkata; \"Kami pernah berada di sisi [Abu Musa] ketika dia diberikan seekor ayam jantan dan saat itu di sampingnya ada seorang dari suku Bani Taymillah yang berkulit merah nampak sebagai orang asing (non 'Arab). Abu Musa mengundangnya untuk makan. Zahdam berkata; \"Sungguh aku lihat dia memakan sesuatu sehingga aku merasa jijik hingga aku bersumpah untuk tidak ikut makan\". Abu Musa berkata; \"Kemarilah karena aku akan bercerita kepada kalian tentang masalah ini. Aku pernah menemui Nabi Shallallahu'alaihiwasallam bersama rombongan Al Asy'ariyin untuk meminta kepada Beliau agar menyertakan kami (dalam perang dan bagian ghanimah), maka Beliau berkata: \"Demi Allah, aku tidak dapat menyertakan kalian dan akupun tidak punya kendaraan yang dapat menyertakan kalian\". Kemudian Rasulullah Shallallahu'alaiwasallam diberikan ghanimah berupa unta lalu Beliau bertanya kepada kami: \"Mana rombongan Al Asy'ariyin tadi?\". Maka Beliau memberikan kami sejumlah unta putih yang paling baik. Ketika kami tengah bertolak pulang, kami berkata; \"Apa yang telah kita lakukan ini tidak berkah\". Akhirnya kami kembali kepada Beliau lalu kami katakan; \"Kami telah meminta kepada Baginda agar menyertakan kami dan Baginda telah bersumpah untuk tidak akan menyertakan kami, apakah Baginda lupa?\". Beliau menjawab: \"Bukan aku yang menyertakan kalian tetapi Allah dan sungguh, demi Allah, aku insya Allah tidaklah aku bersumpah lalu aku lihat ada sesuatu yang lebih baik darinya melainkan aku akan mengambil yang lebih baik itu dan kubayar kafarat sumpahku",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3134,
			"arabicnumber": 3134,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] bahwa Rasulullah Shallallahu'alaihiwasallam mengirim sariyah (pasukan perang) dan 'Abdullah bin 'Umar bergabung bersamanya menuju Najed. Kemudian mereka dapatkan ghanimah berupa unta yang cukup banyak. Masing-masing anggota pasukan mendapatkan bagian dua belas unta atau sebelas unta ditambah masing-masingnya dengan satu unta sebagai nafal",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3135,
			"arabicnumber": 3135,
			"text": "Telah bercerita kepada kami [Yahya bin Bukair] telah mengabarkan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari [Salim] dari [Ibnu 'Umar radliallahu 'anhuma] bahwa Rasulullah Shallallahu'alaihiwasallam memberi nafal (tambahan spesial) sebagian pasukan sariyah yang Beliau berikan khusus untuk mereka sebagai, disamping hak mereka sebagai pasukan secara umum",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3136,
			"arabicnumber": 3136,
			"text": "Telah bercerita kepada kami [Muhammad bin Al 'Alaa'] telah bercerita kepada kami [Abu Usamah] telah bercerita kepada kami [Buraid bin 'Abdullah] dari [Abu Burdah] dari [Abu Musa radliallahu 'anhu] berkata; \"Telah sampai berita kepada kami tentang tempat hijrah yang ditunjuk oleh Nabi Shallallahu'alaihiwasallam. Saat itu kami berada di negeri Yaman. Maka kami keluar untuk berhijrah menuju tempat yang dimaksud. Aku bersama dua saudaraku ikut dalam rombongan muhajirin tersebut dan aku yang paling muda usianya. Salah satu dari keduanya adalah Abu Burdah sedangkan yang satu lagi Abu Ruhmi. (Perawi berkata); Entah dia menyebut jumlah rombongan dengan kira-kira atau menyebut dengan jumlah lima puluh tiga atau lima puluh dua laki-laki dari kaumku. Maka kami naik sebuah perahu (mengarungi lautan) hingga perahu kami membawa kami sampai kepada an-Najasyi di Habasyah (Ethiopia) dan kami berjumpa dengan Ja'far bin Abu Thalib beserta para shahabatnya di negeri itu. Ja'far berkata; \"Rasulullah Shallallahu'alaihiwasallam mengutus kami ke negeri ini dan memerintahkan kami agar tinggal disini, untuk itu tinggallah bersama kami disini\". Maka kami tinggal menetap bersamanya hingga kami kembali (ke Madinah) bersama-sama dan menjumpai Nabi Shallallahu'alaihiwasallam ketika Beliau telah menaklukan Khaibar. Maka Beliau jadikan kami orang yang berhak mendapat bagian ghanimah\". (perawi berkata); atau dia berkata; \"Beliau memberi kami ghanimah. Padahal Beliau tidak membagi hak kepada seorangpun yang tidak ikut dalam penaklukan Khaibar dan hanya membagikannya kepada orang yang ikut terlibat dalam perang bersama Beliau. Kecuali kami, rombongan yang menaiki perahu bersama Ja'far dan para shahabatnya, beliau beri mereka bersama pejuang Khaibar lain",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3137,
			"arabicnumber": 3137,
			"text": "Telah bercerita kepada kami ['Ali] telah bercerita kepada kami [Sufyan] telah bercerita kepada kami [Muhammad bin Al Munkadir] dia mendengar [Jabir radliallahu 'anhu] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Seandainya sudah tiba harta (jizyah/upeti) dari negeri Bahrain sungguh aku akan memberi kamu sekian, sekian dan sekian, dan harta yang Beliau maksud tidak kunjung datang hingga Nabi Shallallahu'alaihiwasallam meninggal dunia\". Ketika datang harta Bahrain, Abu Bakr memerintahkan seorang penyeru untuk menyerukan: \"Siapa yang Rasulullah Shallallahu'alaihiwasallam berhutang kepadanya atau Beliau membuat janji hendaklah datang kepada kami\". Aku datang menemuinya lalu aku katakan; \"Rasulullah Shallallahu'alaihiwasallam pernah berkata kepadaku begini begini\". Maka Abu Bakr memberiku sebanyak tiga kali tangkup (ukuran dua telapak tangan penuh) sementara Sufyan memenuhi kedua telapak tangannya kemudian dia berkata kepada kami; \"Sebanyak ini\". Dan Ibnu Al Munjadir berkata kepada kami; dan dia (Sufyan) suatu kali berkata; \"Maka aku menemui Abu Bakr untuk meminta bagian namun dia tidak memberiku lalu aku datangi lagi dan meminta bagian lagi-lagi di tidak memberiku lalu aku datangi untuk kali ketiga seraya aku katakan; \"Aku telah meminta bagian kepadamu namun kamu tidak memberiku lalu aku meminta lagi kamu juga tidak memberi dan kemudian aku meminta lagi namun kamu juga tetap tidak memberiku, apakah memang kamu tidak (patut) memberiku atau kamu pelit kepadaku\". Abu Bakr menjawab; \"Kamu mengatakan (kepadaku) kamu pelit kepadaku. Tidaklah suatu kali aku tidak memberimu selain aku ingin memberimu\". [Sufyan] berkata, dan telah bercerita kepada kami ['Amru] dari [Muhammad bin 'Ali] dari [Jabir]; \"Maka dia memberiku sebanyak satu ciduk tangan\". Dan dia berkata; \"Maka aku dapatkan jumlahnya sebanyak lima ratus\". Dia (Abu Bakr) berkata; \"Ambillah sebanyak itu untuk yang kedua kali\". Dan berkata yakni Ibnu Al Munkadir; \"Dan penyakit apa yang lebih buruk dari pada pelit?",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3138,
			"arabicnumber": 3138,
			"text": "Telah bercerita kepada kami [Muslim bin Ibrahim] telah bercerita kepada kami [Qurrah binKhalid] telah bercerita kepada kami ['Amru bin Dinar] dari [Jabir bin 'Abdullah radliallahu 'anhu] berkata; \"Ketika Rasulullah Shallallahu'alaihiwasallam membagi-bagi ghanimah di al-Ji'ranah, tiba-tiba seseorang berkata kepada Beliau; \"Berbuat adillah!\". Maka Beliau berkata: \"Sungguh celaka aku bila tidak berbuat adil",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3139,
			"arabicnumber": 3139,
			"text": "Telah bercerita kepada kami [Ishaq bin Manshur] telah mengabarkan kepada kami ['Abdur Razzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Muhammad bin Jubair] dari [bapaknya radliallahu 'anhu] bahwa Nabi Shallallahu'alaihiwasallam berkata di hadapan para tawanan perang Badar: \"Seandainya Al Muth'im bin 'Adiy masih hidup lalu dia berbicara kepadaku untuk pembebasan orang-orang busuk ini pasti aku lepaskan mereka kepadanya tanpa tebusan",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3140,
			"arabicnumber": 3140,
			"text": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah bercerita kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari [Ibnu Al Musayyab] dari [Jubair bin Muth'im] berkata; 'Aku dan 'Utsman bin 'Affan berjalan menemui Rasulullah shallallahu 'alaihi wasallam shallallahu 'alaihi wasallam, lalu kami katakan; \"Wahai Rasulullah, baginda memberikan Bani Al Muthallib tapi kami tidak, padahal kami di hadapan baginda kedudukannya sama\". Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Bani Al Muthallib dan Banu Hasyim adalah satu (sama kedudukannya). [Al Laits] berkata telah bercerita kepadaku [Yunus] dan dia menambahkan, [Jubair] berkata; Dan Nabi shallallahu 'alaihi wasallam tidak membagikan kepada Banu 'Abdu Syamsi, tidak juga kepada Banu Naufal\". Dan Ibnu Ishaq berkata; \"'Abdu Syams, Hasyim dan Al Muthallib adalah saudara satu ibu yang bernama 'Atikah binti Murrah sedangkan Naufal adalah saudara mereka dari pihak bapak mereka",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3141,
			"arabicnumber": 3141,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Yusuf bin Al Majisyun] dari [Shalih bin Ibrahim bin 'Abdur Rahman bin 'Auf] dari [bapaknya] dari [kakeknya] berkata; \"Ketika aku berada di barisan pasukan pada perang Badar, aku melihat ke kanan dan kiriku ternyata nampak ada dua orang anak dari Kaum Anshar yang masih sangat muda dan aku berharap berada di antara tulang rusuk keduanya. Salah seorang darinya mengerdipkan matanya kepadaku seraya berkata; \"Wahai paman, apakah paman mengenal Abu Jahal?\". Aku jawab; \"Ya. Tapi apa kepentinganmu dengannya wahai anak saudaraku?\". Dia berkata; \"Aku mendapat kabar bahwa dia menghina Rasulullah Shallallahu'alaihiwasallam. Dan demi Dzat yang jiwaku berada di tangan-Nya, seandainya aku melihatnya pasti tidak akan berpisah jasadku dengan jasadnya sampai siapa diantara kami yang menemui ajalnya lebih dahulu \". Aku menjadi kagum dengan keberaniannya. Lalu anak yang satunya lagi mengerdipkan matanya kepadaku lalu berkata kepadaku seperti yang dikatakan saudaranya tadi. Tidak lama kemudian aku melihat Abu Jahal bolak-balik di tengah-tengan pasukan, lalu kukatakan kepada kedua anak tadi; \"Itu dia orang yang tadi kalian tanyakan kepadaku?\". Maka keduanya bersigap menyerbu dengan menghunus pedang masing-masing lalu keduanya menebas Abu Jahal hingga tewas. Kemudian keduanya mendatangi Rasulullah Shallallahu'alaihiwasallam dan mengabarkannya, maka Beliau bertanya; \"Siapa diantara kalian berdua yang membunuhnya?\". Maka masing-masing dari keduanya menjawab; \"Akulah yang membunuhnya\". Beliau bertanya lagi; \"Apakah kalian sudah membersihkan pedang kalian?\". Keduanya menjawab; \"Belum\". Maka Beliau melihat pedang keduanya lalu berkata: \"Kalau begitu, kalian berdua yang telah membunuhnya dan salabnya (harta benda yang melekat pada tubuh musuh saat dibunuh) untuk Mu'adz bin 'Amru bin Al Jamuh\". Kedua anak itu namanya Mu'adz bin 'Afra' dan Mu'adz bin 'Amru bin Al Jamuh\". Muhammad berkata, Yusuf mendengar Shalih dan Ibrahim, bapaknya",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3142,
			"arabicnumber": 3142,
			"text": "Telah bercerita kepada kami ['Abdullah bin Maslaman] dari [Malik] dari [Yahya bin Sa'id] dari [Ibnu Aflah] dari [Abu Muhammad, maula Abu Qatadah] dari [Abu Qatadah radliallahu 'anhu] berkata; \"Kami berangkat bersama Rasulullah Shallallahu'alaihiwasallam pada perang Hunain. Ketika kami sudah berhadapan dengan musuh, posisi Kaum Muslimin terdesak dan aku melihat ada seorang dari Kaum musyrikin berhasil mengatasi (membunuh) seorang dari Kaum Muslimin maka aku berbalik hingga aku berada di belakangnya lalu aku menghantamnya dengan pedang pada urat bahunya. Dia berbalik lalu mendekapku dengan satu dekapan dan saat itulah aku merasakan bau kematian dan akhirnya dia menemui kematiannya. Kemudian datang utusan maka aku menemui 'Umar bin Al Khaththab lalu aku katakan; \"Bagaimana keadaan orang-orang?\". Dia berkata; \"Itu urusan Allah\". Kemudian orang-orang kembali lalu Nabi Shallallahu'alaihiwasallam duduk di hadapan manusia seraya bersabda: \"Siapa yang telah membunuh musuh dan dia mempunyai bukti yang jelas maka salab (harta/barang yang melekat pada musuh yang terbunuh) menjadi miliknya\". Maka aku berdiri dan berkata; \"Siapa yang menjadi saksi untukku\". Lalu aku duduk kembali. Kemudian Beliau bersabda lagi: \"Siapa yang telah membunuh musuh dan dia mempunyai bukti yang jelas maka salab (harta/barang yang melekat pada musuh yang terbunuh) menjadi miliknya\". Maka aku berdiri lagi dan berkata; \"Siapa yang menjadi saksi untukku\". Lalu aku duduk kembali. Kemudian Beliau bersabda lagi untuk yang ketiga kalinya seperti tadi maka aku berdiri. Rasulullah Shallallahu'alaihiwasallam bertanya: \"Ada apa denganmu wahai Abu Qatadah?\". Maka aku menceritakan kepada Beliau peristiwa yang aku alami\". Tiba-tiba ada seorang yang berkata; \"Dia benar wahai Rasulullah dan salabnya ada padaku maka itu relakanlah untukku\". Abu Bakr ash-Shiddiq radliallahu 'anhu berkata (kepada laki-laki itu); \"Tidak, demi Allah. Apa layak seseorang menemui salah satu singa Allah (maksudnya Abu Tolhah) yang dia berperang demi membela Allah dan Rasul-Nya Shallallahu'alaihiwasallam, lantas ia memberi salab-nya kepadamu?\". Maka Nabi Shallallahu'alaihiwasallam berkata: \"Abu Bakar benar\". Maka Beliau memberikan salab itu kepad Abu Qatadah. Lalu aku menjual baju besi (salab) tersebut dan dengan harta itu kemudian aku membeli kebun yang penuh dengan buah-buahannya di kampung Bani Salamah dan itulah harta pertama yang aku kumpulkan di masa Islam",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3143,
			"arabicnumber": 3143,
			"text": "Telah bercerita kepada kami [Muhammad bin Yusuf] telah bercerita kepada kami [Al Awza'iy] dari [Az Zuhriy] dari [Sa'id bin 'Abdullahl-Musayyab] dan ['Urwah bin Az Zubair] bahwa [Hakim bin Hizam radliallahu 'anhu] berkata; 'Aku meminta sesuatu kepada Rasulullah Shallallahu'alaihiwasallam lalu Beliau memberikannya, kemudian aku meminta lagi dan Beliaupun kembali memberikannya lalu Beliau berkata kepadaku: \"Wahai Hakim, harta itu hijau lagi manis, maka barangsiapa yang mencarinya untuk kedermawanan dirinya maka harta itu akan memberkahinya. Namun barangsiapa yang mencarinya untuk keserakahan (ambisius, tamak) maka harta itu tidak akan memberkahinya, seperti orang yang makan namun tidak kenyang. Tangan yang di atas lebih baik daripada tangan yang di bawah\". Hakim berkata; \"Lalu aku berkata (kepada Beliau); \"Wahai Rasulullah, demi Dzat yang telah mengutusmu dengan benar, aku tidak akan mengurangi hak seorangpun (dengan meminta) setelah engkau hingga aku meninggalkan dunia ini\". Suatu kali Abu Bakar pernah memanggil Hakim untuk diberikan sesuatu agar dia datang dan menerima pemberiannya. Kemudian 'Umar radliallahu 'anhu juga pernah memanggil Hakim untuk memberikan sesuatu namun Hakim tidak memenuhinya. Maka 'Umar radliallahu 'anhu berkata: \"Wahai kaum Muslimin sekalian, sungguh aku pernah menawarkan kepadanya haknya dari harta fa'i ini (harta musuh tanpa peperangan) namun dia enggan untuk mengambilnya dan sungguh Hakim tidak pernah mengurangi hak (meminta) seorangpun setelah Rasulullah Shallallahu'alaihiwasallam hingga dia wafat",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3144,
			"arabicnumber": 3144,
			"text": "Telah bercerita kepada kami [Abu an-Nu'man] telah bercerita kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] bahwa 'Umar bin Al Khaththab radliallahu 'anhu berkata; \"Wahai Rasulullah, aku pernah bernadzar untuk beri'tikaf satu hari di masa jahilliyah\". Maka Beliau memerintahkan aku untuk melaksanakannya\". Perawi (Nafi') berkata; \"'Umar pernah mendapatkan dua budak perempuan dari tawanan perang Hunain lalu dia menitipkannya pada suatu rumah di Makkah\". Perawi berkata; \"Kemudian Rasulullah Shallallahu'alaihiwasallam membebaskan para tawanan perang Hunain hingga mereka bebas berjalan di lorong-lorong kota Makkah. 'Umar berkata; \"Wahai 'Abdullah, lihatlah apa yang terjadi?\". 'Abdullah bin 'Umar berkata; \"Rasulullah Shallallahu'alaihiwasallam telah membebaskan para tawanan\". Maka 'Umar berkata; \"Pergi dan bebaskanlah dua budak perempuan itu\". Nafi' berkata; \"Rasulullah Shallallahu'alaihiwasallam tidak ber'umrah dari Ji'ranah, dan seandainya Beliau ber'umrah tentu akan diketahui oleh 'Abdullah (bin 'Umar) \". Dan [Jarir bin Hazim] menambahkan dari [Ayyub] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] berkata; \"(Dua budak itu) sebagai jatah khumus (seperlima ghanimah) \". Dan diriwayatkan oleh [Ma'mar] dari [Ayyub] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma]; \"(Aku punya) nadzar\", dan dia tidak mengatakan satu hari",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3145,
			"arabicnumber": 3145,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Jarir bin Hazim] telah bercerita kepada kami [Al hasan] berkata telah bercerita kepadaku ['Amru bin Taghlab radliallahu 'anhu] berkata; \"Rasulullah Shallallahu'alaihiwasallam pernah memberikan (suatu pemberian) kepada suatu kaum dan tidak memberikan kepada kaum yang lain namun mereka seakan menunjukkan ketidak sukaannya kepada Beliau. Maka Beliau berkata: \"Sesungguhnya aku memberi suatu kaum karena aku khawatir tentang ketidak tegaran dan ketidak sabaran mereka, dan aku akan selalu memberi makan kepada suatu kaum sampai Allah menjadikan dalam hati mereka kebaikan dan orang yang kaya hati di antara mereka adalah 'Amru bin Taghlab\". Maka 'Amru bin Taghlab berkata; \"Aku tidak senang jika ucapan Rasulullah Shallallahu'alaihiwasallam kepadaku itu diganti dengan kekayaan yang sangat berharga\". Dan [Abu 'Ashim] menambahkan dari [Jarir] berkatal; Aku mendengar [Al Hasan] berkata, telah bercerita kepada kami ['Amru bin Taghlab] bahwa Rasulullah Shallallahu'alaihiwasallam diberikan harta atau tawanan lalu Beliau membagi-bagikannya atas dasar pertimbangan tadi",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3146,
			"arabicnumber": 3146,
			"text": "Telah bercerita kepada kami [Abu Al Walid] telah bercerita kepada kami [Syu'bah] dari [Qatadah] dari [Anas radliallahu 'anhu] berkata; Nabi Shallallahu'alaihiwasallam bersabda: \"Sungguh aku membagikan (ghanimah) kepada Quraisy untuk mengikat mereka (dalam Islam) karena mereka masih sangat dekat dengan masa-masa (kebiasaan) jahiliyyah",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3147,
			"arabicnumber": 3147,
			"text": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] telah bercerita kepada kami [Az Zuhriy] berkata telah mengabarkan kepadaku [Anas bin Malik] bahwa orang-orang dari kalangan Anshar berbicara dengan Rasulullah Shallallahu'alaihiwasallam ketika Allah mengkaruniakan harta fa'i suku Hawazin kepada Rasulullah Shallallahu'alaihiwasallam. Saat itu Beliau sedang memberikan bagian kepada orang-orang Quraisy berupa seratus unta. Mereka berkata; \"Semoga Allah mengampuni Rasulullah Shallallahu'alaihiwasallam karena Beliau memberikan bagian kepada orang Quraisy dan meninggalkan kita padahal pedang-pedang kitalah yang menumpahkan darah-darah mereka\". Anas berkata; \"Kemudian disampaikan kepada Rasulullah Shallallahu'alaihiwasallam apa yang diperbincangkan oleh mereka\". Maka dikirimlah utusan kepada kaum Anshar dan mengumpulkan mereka pada suatu kemah terbuat dari kulit yang telah disamak dan tidak mengijinkan seorangpun bergabung selain kalangan mereka. Ketika mereka sudah berkumpul maka Rasulullah Shallallahu'alaihiwasallam datang menemui mereka lalu berkata: \"Ada apa dengan berita yang telah sampai kepadaku tentang kalian\". Orang faqih mereka berkata kepada Beliau; \"Orang-orang bijak dari kami tidaklah mengatakan sesuatupun wahai Rasulullah. Namun memang ada anak-anak muda yang berkata; Semoga Allah mengampuni Rasulullah karena Beliau memberikan bagian kepada orang Quraisy dan meninggalkan kaum Anshar padahal pedang-pedang kitalah yang menumpahkan darah-darah mereka\". Maka Rasulullah Shallallahu'alaihiwasallam bersabda: \"Sungguh aku memberi bagian kepada orang-orang yang masa hidup mereka masih dekat dengan kekafiran. Apakah kalian ridla orang-orang itu pulang dengan membawa harta, sebaliknya kalian kembali ke tempat tinggal kalian dengan membawa Rasulullah Shallallahu'alaihiwasallam?\". Demi Allah, sungguh apa yang kalian bawa pulang lebih baik dari apa yang mereka bawa\". Kaum Anshar berkata; \"Kami ridla wahai Rasulullah\". Kemudian Beliau bersabda lagi: \"Sungguh sepeninggalku nanti kalian akan melihat banyak perkara yang sangat berat. Untuk itu bershabarlah hingga kalian berjumpa dengan Allah dan Rasul-Nya Shallallahu'alaihiwasallam di telaga al-haudl\". Anas berkata; \"Ternyata di kemudian hari kami tidak sabar",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3148,
			"arabicnumber": 3148,
			"text": "Telah bercerita kepada kami ['Abdul 'Aziz bin 'Abdullah Al Uwaisiy] telah bercerita kepada kami [Ibrahim bin Sa'ad] dari [Shalih] dari [Ibnu Syihab] mengatakan, telah menceritakan kepadaku ['Umar bin Muhammad bin Jubair bin Muth'im] bahwa [Muhammad bin Jubair] berkata telah mengabarkan kepadaku [Jubair bin Muth'im] bahwa ketika dia bersama Rasulullah Shallallahu'alaihiwasallam beserta orang-orang yang baru kembali dari perang Hunain, Beliau dihampiri oleh orang-orang Arab Baduy yang meminta bagian dan mendesak Beliau hingga menyudutkan Beliau ke pohon berduri sementara rida' (selendang) Beliau raib (ada yang ambil). Maka Rasulullah Shallallahu'alaihiwasallam tertahan lalu bersabda: \"Berikan rida'ku. Seandainya aku memiliki banyak pohon berduri ini sebagai harta maka aku bagikan kepada kalian, lalu kalian tidak akan mendapati aku sebagai orang yang pelit, dusta atau pengecut",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3149,
			"arabicnumber": 3149,
			"text": "Telah bercerita kepada kami [Yahya bin Bukair] telah bercerita kepada kami [Malik] dari [Ishaq bin 'Abdullah] dari [Anas bin Malik radliallahu 'anhu] berkata; \"Aku pernah berjalan bersama Nabi Shallallahu'alaihiwasallam yang ketika itu Beliau mengenakan selendang yang tebal dan kasar buatan Najran. Kemudian seorang Arab Baduy datang lalu menarik Beliau dengan tarikan yang keras hingga aku melihat permukaan pundak Nabi Shallallahu'alaihiwasallam berbekas akibat tarikan yang keras itu. Lalu Beliau berkata: \"Perintahkanlah, agar aku diberikan harta Allah yang ada padamu\". Kemudian Beliau memandang kepada orang Arab Baduy itu dan tertawa Lalu Beliau memerintahkan agar memberinya",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3150,
			"arabicnumber": 3150,
			"text": "Telah bercerita kepada kami ['Utsman bin Abi Syaibah] telah bercerita kepada kami [Jarir] dari [Manshur] dari [Abu Wa'il] dari ['Abdullah radliallahu 'anhu] berkata; \"Ketika (selesai) perang Hunain, Nabi Shallallahu'alaihiwasallam lebih mengutamakan orang-orang tertentu dalam pembagian (harta rampasan perang) diantaranya Beliau memberikan kepada Al Aqra' bin Habis seratus ekor unta dan memberikan kepada 'Uyainah unta sebanyak itu pula, dan juga memberikan kepada beberapa orang pembesar Arab sehingga hari itu Beliau nampak lebih mengutamakan mereka dalam pembagian. Kemudian ada seseorang yang berkata; \"Pembagian ini sungguh tidak adil dan tidak dimaksudkan mencari ridla Allah. Aku katakan; \"Demi Allah, sungguh aku akan memberi tahu Nabi Shallallahu'alaihiwasallam\". Lalu aku menemui Beliau dan mengabarkannya, maka Beliau bersabda: \"Siapakah yang dapat berbuat adil kalau Allah dan Rasul-Nya saja tidak dapat berbuat adil?. Sungguh Allah telah merahmati Musa Alaihissalam ketika dia disakiti lebih besar dari ini namun dia tetap shabar",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3151,
			"arabicnumber": 3151,
			"text": "Telah bercerita kepada kami [Mahmud bin Ghaylan] telah bercerita kepada kami [Abu Usamah] telah bercerita kepada kami [Hisyam] berkata telah mengabarkan kepadaku [bapakku] dari [Asma' binti Abu Bakr radliallahu 'anhuma] berkata; \"Aku pernah membawa benih kurma dari kebun milik Az Zubair yang diberikan oleh Rasulullah Shallallahu'alaihiwasallam di atas kepalaku. Kebun itu jaraknya dari (rumah) ku dua pertiga farsakh\". Dan berkata [Abu Dlamrah] dari [Hisyam] dari [bapaknya] bahwa Nabi Shallallahu'alaihiwasallam membagi Az Zubair sebidang kebun dari harta (fa'iy) Bani an-Nadlir",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3152,
			"arabicnumber": 3152,
			"text": "Telah bercerita kepadaku [Ahmad bin Al miqdam] telah bercerita kepada kami [Al Fudlail bin Sulaiman] telah bercerita kepada kami [Musa bin 'Uqbah] berkata telah mengabarkan kepadaku [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] bahwa 'Umar bin Al Khaththab mengusir Yahudi dan Nashara dari bumi Hijaz (Arab) dan Rasulullah Shallallahu'alaihiwasallam ketika menaklukan penduduk Khaibar juga berniat akan mengusir Yahudi dari wilayah itu. Dan wilayah itu ketika dahulu ditaklukan menjadi milik Yahudi, Rasulullah dan Kaum Muslimin. Lalu orang-orang Yahudi meminta kepada Rasulullah Shallallahu'alaihiwasallam agar memperkenankan mereka menggarapnya dengan imbalan mereka mendapat setengah dari hasil buahnya, maka Rasulullah Shallallahu'alaihiwasallam bersabda: \"Kami sepakat kalian menggarapnya namun terserah kami\" (batas waktunya). Akhirnya mereka setuju hingga kemudian pada masa kekuasaan 'Umar, beliau mengusir mereka ke wilayah Tayma' dan Ariha",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3153,
			"arabicnumber": 3153,
			"text": "Telah bercerita kepada kami [Abu Al Walid] telah bercerita kepada kami [Syu'bah] dari [Humaid bin Hilal] dari ['Abdullah bin Mughaffal radliallahu 'anhu] berkata; \"Ketika kami sedang mengepung benteng Khaibar, ada seseorang yang melempar wadah kulit berisi lemak maka aku melompat untuk mengambilnya. Lalu aku melirik ternyata ada Nabi Shallallahu'alaihiwasallam sehingga aku jadi malu kepada Beliau",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3154,
			"arabicnumber": 3154,
			"text": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] berkata; \"Dalam beberapa peperangan yang kami ikuti, kami pernah mendapatkan madu dan anggur lalu kami memakannya dan tidak melaporkannya (kepada Beliau Shallallahu'alaihiwasallam)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3155,
			"arabicnumber": 3155,
			"text": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami ['Abdul Wahid] telah bercerita kepada kami [asy-Syaibaniy] berkata aku mendengar [Ibnu Abi Arfaa radliallahu 'anhu] berkata; \"Kami mengalami kelaparan pada beberapa malam saat perang Khaibar. Dan ketika hari penaklukan Khaibar, kami dapatkan keledai-keledai piaraan penduduk, maka kami menyembelihnya. Ketika periuk-periuk sudah mendidih, penyeru Rasulullah Shallallahu'alaihiwasallam mengumandangkan seruan; \"Tumpahkanlah periuk-periuk itu dan janganlah kalian memakan daging-daging keledai sedikitpun\". 'Abdullah berkata; \"Kami berpendapat bahwa Nabi Shallallahu'alaihiwasallam melarang memakannya karena belum dibagikan bagian seperlima (ghanimahnya) \". 'Abdullah berkata lagi; \"Namun sebagian orang ada yang berpendapat bahwa Beliau melarangnya secara mutlak lalu aku bertanya kepada Sa'id bin Jubair, maka dia menjawab; \"Beliau melarangnya secara mutlak",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 63
			}
		}
	]
}