{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"6": "Menstrual Periods"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 294,
			"arabicnumber": 294,
			"text": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] berkata, telah menceritakan kepada kami [Sufyan] berkata, Aku mendengar ['Abdurrahman bin Al Qasim] berkata, Aku mendengar [Al Qasim bin Muhammad] berkata, Aku mendengar ['Aisyah] berkata, \"Kami keluar dan tidak ada tujuan selain untuk ibadah haji. Ketika tiba di Sarif aku mengalami haid, kemudian Rasulullah shallallahu 'alaihi wasallam masuk menemuiku sementara aku sedang menangis. Beliau bertanya: \"Apa yang terjadi denganmu? Apakah kamu datang haid?\" Aku jawab, \"Ya.\" Beliau lalu bersabda: \"Sesungguhnya ini adalah perkara yang telah Allah tetapkan bagi kaum wanita dari anak cucu Adam. Lakukanlah apa yang dilakukan oleh orang-orang yang haji, kecuali thawaf di Ka'bah.\" 'Aisyah berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam berkurban dengan menyembelih seekor sapi yang diniatkan untuk semua isterinya",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 295,
			"arabicnumber": 295,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah menceritakan kepada kami [Malik] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Aisyah] berkata, \"Aku pernah menyisir rambut Rasulullah shallallahu 'alaihi wasallam, sementara saat itu aku sedang haid",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 296,
			"arabicnumber": 296,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Musa] berkata, telah mengabarkan kepada kami [Hisyam bin Yusuf] bahwa [Ibnu Juraij] telah mengabarkan kepada mereka, ia berkata; telah mengabarkan kepadaku [Hisyam bin 'Urwah] dari ['Urwah], bahwa dia ditanya, \"Apakah wanita yang sedang haid boleh melayani aku, atau berdekatan denganku sedangkan dia junub?\" 'Urwah lalu menjawab, \"Bagiku semua itu mudah, dan setiap dari mereka boleh untuk membantuku, dan seseorang tidak berdosa karena hal itu. ['Aisyah] pernah mengabarkan kepadaku bahwa ia pernah menyisir rambut kepala Nabi shallallahu 'alaihi wasallam dalam keadaan haid. Saat itu Rasulullah shallallahu 'alaihi wasallam berada di sisi masjid, beliau mendekatkan kepalanya kepada Aisyah yang berada di dalam kamar dan dalam keadaan haid untuk menyisir rambut kepalanya",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 297,
			"arabicnumber": 297,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim Al Fadll bin Dukain] bahwa dia mendengar [Zuhair] dari [Manshur bin Shafiyah] bahwa [Ibunya] menceritakan kepadanya, bahwa ['Aisyah] menceritakan kepadanya, \"Nabi shallallahu 'alaihi wasallam menyandarkan badannya di pangkuanku membaca Al Qur'an, padahal saat itu aku sedang haid",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 298,
			"arabicnumber": 298,
			"text": "Telah menceritakan kepada kami [Al Makki bin Ibrahim] berkata, telah menceritakan kepadaku [Hisyam] dari [Yahya bin Abu Katsir] dari [Abu Salamah] bahwa [Zainab binti Ummu Salamah] menceritakan kepadanya, bahwa [Ummu Salamah] berkata, \"Aku dan Nabi shallallahu 'alaihi wasallam berbaring dalam selimut, kemudian aku mengeluarkan darah haid hingga aku pun berlalu dengan diam-diam seraya membawa kain yang terkena darah haidku. Beliau bertanya: \"Apakah kamu sedang haid?\" Aku jawab, \"Ya.\" Beliau lalu memanggilku, maka aku pun berbaring bersama beliau dalam kain tebal",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 301,
			"arabicnumber": 301,
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 302,
			"arabicnumber": 302,
			"text": "Telah menceritakan kepada kami [Isma'il bin Khalil] berkata, telah mengabarkan kepada kami ['Ali bin Mushir] berkata, telah mengabarkan kepada kami [Abu Ishaq] -yaitu Asy Syaibani- dari ['Abdurrahman bin Al Aswad] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Jika salah seorang dari kami sedang mengalami haid dan Rasulullah shallallahu 'alaihi wasallam berkeinginan untuk bermesraan, beliau memerintahkan untuk mengenakan kain, lalu beliau pun mencumbuinya.\" 'Aisyah berkata, \"Padahal, siapakah di antara kalian yang mampu menahan hasratnya sebagaimana Rasulullah shallallahu 'alaihi wasallam menahan.\" Hadits ini dikuatkan oleh [Khalid] dan [Jarir] dari [Asy Syaibani]",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 303,
			"arabicnumber": 303,
			"text": "Telah menceritakan kepada kami [Abu An Nu'man] berkata, telah menceritakan kepada kami ['Abdul Wahid] berkata, telah menceritakan kepada kami [Asy Syaibani] berkata, telah menceritakan kepada kami ['Abdullah bin Syadad] berkata, Aku mendengar [Maimunah] berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam ingin mencumbu salah seorang dari isterinya, beliau memerintahkannya untuk mengenakan sarung. Maka ia pun mengenakan sarung, sementara ia sedang haid.\" [Sufan] juga meriwayatkannya dari [Asy Syaibani]",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 304,
			"arabicnumber": 304,
			"text": "Telah menceritakan kepada kami [Sa'id bin Abu Maryam] berkata, telah mengabarkan kepada kami [Muhammad bin Ja'far] berkata, telah mengabarkan kepadaku [Zaid] -yaitu Ibnu Aslam- dari ['Iyadl bin 'Abdullah] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pada hari raya 'Iedul Adlha atau Fitri keluar menuju tempat shalat, beliau melewati para wanita seraya bersabda: \"Wahai para wanita! Hendaklah kalian bersedekahlah, sebab diperlihatkan kepadaku bahwa kalian adalah yang paling banyak menghuni neraka.\" Kami bertanya, \"Apa sebabnya wahai Rasulullah?\" beliau menjawab: \"Kalian banyak melaknat dan banyak mengingkari pemberian suami. Dan aku tidak pernah melihat dari tulang laki-laki yang akalnya lebih cepat hilang dan lemah agamanya selain kalian.\" Kami bertanya lagi, \"Wahai Rasulullah, apa tanda dari kurangnya akal dan lemahnya agama?\" Beliau menjawab: \"Bukankah persaksian seorang wanita setengah dari persaksian laki-laki?\" Kami jawab, \"Benar.\" Beliau berkata lagi: \"Itulah kekurangan akalnya. Dan bukankah seorang wanita bila dia sedang haid dia tidak shalat dan puasa?\" Kami jawab, \"Benar.\" Beliau berkata: \"Itulah kekurangan agamanya",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 305,
			"arabicnumber": 305,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepadaku ['Abdul 'Aziz bin Abu Salamah] dari ['Abdurrahman bin 'Abdullah Al Qasim] dari [Al Qasim bin Muhammad] dari ['Aisyah] ia berkata, \"Kami keluar bersama Nabi shallallahu 'alaihi wasallam dan tidak ada yang kami ingat kecuali untuk menunaikan hajji. Ketika kami sampai di suatu tempat bernama Sarif aku mengalami haid. Lalu Nabi shallallahu 'alaihi wasallam masuk menemuiku saat aku sedang menangis. Maka beliau bertanya: \"Apa yang membuatmu menangis?\" Aku jawab, \"Demi Allah, pada tahun ini aku tidak bisa melaksanakan haji!\" Beliau berkata: \"Barangkali kamu mengalami haid?\" Aku jawab, \"Benar.\" Beliau pun bersabda: \"Yang demikian itu adalah perkara yang sudah Allah tetapkan buat puteri-puteri keturunan Adam. Maka lakukanlah apa yang dilakukan orang yang berhaji kecuali thawaf di Ka'bah hingga kamu suci",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 306,
			"arabicnumber": 306,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Aisyah], bahwa ia berkata, \"Fatimah binti Abu Hubaisy berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Wahai Rasulullah, aku dalam keadaan tidak suci. Apakah aku boleh meninggalkan shalat?\" Rasulullah shallallahu 'alaihi wasallam lalu menjawab: \"Sesungguhnya itu adalah darah penyakit dan bukan darah haid. Jika haid kamu datang maka tingalkanlah shalat, dan jika telah berlalu masa-masa haid, maka bersihkanlah darah darimu lalu shalatlah",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 307,
			"arabicnumber": 307,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Hisam bin 'Urwah] dari [Fatimah binti Al Mundzir] dari [Asma' binti Abu Bakar Ash Shiddiq] berkata, \"Seorang wanita bertanya kepada Rasulullah shallallahu 'alaihi wasallam, katanya, \"Wahai Rasulullah, bagaimana pendapatmu bila seorang dari kami bajunya terkena darah haid. Apa yang harus dilakukannya?\" Rasulullah shallallahu 'alaihi wasallam lalu menjawab: \"Jika darah haid mengenai pakaian seorang dari kalian, maka hendaklah ia bersihkan darah yang mengenainya, lalu hendaklah ia percikkan air padanya, kemudian hendaklah ia shalat dengannya",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 308,
			"arabicnumber": 308,
			"text": "Telah menceritakan kepada kami [Ashbagh] berkata, telah mengabarkan kepadaku [Ibnu Wahb] berkata, telah mengabarkan kepadaku ['Amru bin Al Harits] dari ['Abdurrahman bin Al Qasim] bahwa ia menceritakan kepadanya dari [Bapaknya] dari ['Aisyah] berkata, \"Salah seorang dari kami mengalami haid, kemudian saat telah suci darah tersebut ia bersihkan, kemudian kain tersebut ia cuci dan bersihkan, kemudian ia shalat dengan menggunakan kain tersebut",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 309,
			"arabicnumber": 309,
			"text": "Telah menceritakan kepada kami [Ishaq] berkata, telah menceritakan kepada kami [Khalid bin 'Abdullah] dari [Khalid] dari ['Ikrimah] dari ['Aisyah] berkata, \"Nabi shallallahu 'alaihi wasallam pernah beri'tikaf bersama dengan sebagian isteri-isterinya, sementara saat itu ia sedang mengalami istihadlah dan bisa melihat adanya darah (yang keluar). Dan kadang diletakkan sebuah baskom di bawahnya lantaran darah tersebut. Dan Ikrimah mengklaim bahwa 'Aisyah melihat cairan berwarna kekuningan, lalu ia berkata, \"Seakan ini adalah sesuatu yang pernah dialami oleh fulanah",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 310,
			"arabicnumber": 310,
			"text": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] dari [Khalid] dari ['Ikrimah] dari ['Aisyah] berkata, \"Nabi shallallahu 'alaihi wasallam pernah beri'tikaf bersama salah seorang dari isterinya. Ia melihat ada darah dan cairan berwarna kekuningan, lalu di bawahnya diletakkan baskom sementara ia tetap mengerjakan shalat",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 311,
			"arabicnumber": 311,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Mu'tamir] dari [Khalid] dari ['Ikrimah] dari ['Aisyah] berkata, \"Sebagian Ummul Mukminin melakukan iktikaf sementara mereka mengeluarkan darah istihadlah",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 312,
			"arabicnumber": 312,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Ibrahim bin Nafi'] dari [Ibnu Abu Najih] dari [Mujahid] berkata, ['Aisyah] berkata, \"Tidaklah ada seorang dari kami kecuali memiliki satu baju yang saat mengalami haid. Jika baju tersebut terkena darah haid, ia dia basahi dengan air ludahnya lalu membersihkanya dengan kukunya",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 313,
			"arabicnumber": 313,
			"text": "Telah menceritakan kepada kami ['Abdullah bin 'Abdul Wahhab] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Hafshah] berkata, [Abu 'Abdullah atau Hisyam bin Hassan] berkata dari [Hafshah] dari [Ummu 'Athiyah] dari Nabi shallallahu 'alaihi wasallam, ia berkata, \"Kami dilarang berkabung atas kematian di atas tiga hari kecuali atas kematian suami, yaitu selama empat bulan sepuluh hari. Selama masa itu dia tidak boleh bersolek, memakai wewangian, memakai pakaian yang berwarna kecuali pakaian lurik (dari negeri Yaman). Dan kami diberi keringanan bila hendak mandi seusai haid untuk menggunakan sebatang kayu wangi. Dan kami juga dilarang mengantar jenazah.\" Abu 'Abdullah berkata, [Hisyam bin Hassan] meriwayatkan dari [Hafshah] dari [Ummu 'Athiyah] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 314,
			"arabicnumber": 314,
			"text": "Telah menceritakan kepada kami [Yahya] berkata, telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Manshur bin Shafiyyah] dari [Ibunya] dari ['Aisyah], \"Seorang wanita bertanya kepada Nabi shallallahu 'alaihi wasallam tentang cara mandi dari haid. Beliau lalu memerintahkan wanita itu bagaimana cara mandi. Beliau bersabda: \"Ambillah sepotong kapas yang diberi wewangian lalu bersucilah.\" Wanita itu bertanya, \"Bagaimana aku bersucinya? Beliau menjawab: \"Bersucilah dengan kapas itu!\" Wanita itu berkata lagi, \"Bagaimana caranya aku bersuci?\" Beliau bersabda: \"Bersucilah dengan menggunakan kapas itu!\" Wanita itu bertanya lagi, \"Bagaimana caranya?\" Maka Beliau berkata, \"Subhaanallah. Bersucilah kamu!\" Lalu aku manarik wanita itu kearahku, lalu aku katakan, \"Kamu bersihkan sisa darahnya dengan kapas itu",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 315,
			"arabicnumber": 315,
			"text": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Manshur] dari [Ibunya] dari ['Aisyah], \"Seorang wanita Anshar bertanya kepada Nabi shallallahu 'alaihi wasallam, \"Bagaimana caranya aku bersuci dari haid?\" Beliau lalu menjawab: \"Ambillah sepotong kapas yang diberi wewangian lalu bersihkanlah tiga kali.\" Kemudian Nabi shallallahu 'alaihi wasallam merasa malu lalu memalingkan mukanya, atau beliau mengatakan: \"Berwudlulah dengan kapas itu.\" Aku lalu tarik wanita itu dan aku terangkan apa yang dimaksud oleh Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 316,
			"arabicnumber": 316,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Ibrahim] telah menceritakan kepada kami [Ibnu Syihab] dari ['Urwah] bahwa ['Aisyah] berkata, \"Aku bertalbiyah (memulai haji) bersama Rasulullah shallallahu 'alaihi wasallam pada haji Wada'. Dan aku adalah di antara orang yang melaksanakannya dengan cara tamattu' namun tidak membawa hewan sembelihan.\" Aisyah menyadari bahwa dirinya mengalami haid dan belum bersuci hingga tiba malam 'Arafah. Maka 'Aisyah berkata, \"Wahai Rasulullah, malam ini adalah malam 'Arafah sedangkan aku melaksanakan tamattu' dengan Umrah lebih dahulu?\" Maka bersabdalah Rasulullah shallallahu 'alaihi wasallam kepadanya: \"Urai dam sisirlah rambut kepalamu, lalu tahanlah Umrahmu.\" Aku lalu laksanakan hal itu. Setelah aku menyelesaikan haji, beliau memerintahkan 'Abdurrahman pada malam hashbah (Malam di Muzdalifah) untuk melakukan Umrah buatku dari Tan'im, tempat dimana aku mulai melakukan manasikku",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 317,
			"arabicnumber": 317,
			"text": "Telah menceritakan kepada kami ['Ubaid bin Isma'il] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [Bapaknya] dari ['Aisyah] berkata, \"Kami keluar bertepatan saat nampak hilal bulan Dzul Hijjah. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Siapa yang ingin memulai haji dengan Umrah hendaklah ia lakukan. Sekiranya aku tidak membawa hewan sembelihan, aku lebih suka melakukan Umrah lebih dahulu.\" Maka sebagian para sahabat ada yang memulai dengan Umrah dan ada yang memulai dengan haji. Sedang aku termasuk di antara yang mulai dengan Umrah. Maka ketika hari Arafah aku mengalami haid, aku lalu mengadukan hal itu kepada Nabi shallallahu 'alaihi wasallam, beliau lalu bersabda: \"Tinggalkanlah Umrahmu. Uraikan rambut kepalamu lalu sisirlah, kemudian mulailah talbiah dengan haji.\" Maka aku pun laksanakan perintah beliau, hingga ketika tiba malam Hashbah (Malam di Muzdalifah), beliau memerintahkan 'Abdurrahman bin Abu Bakar untuk menemaniku. Maka aku keluar menuju Tan'im, lalu bertalbiah dengan Umrah sebagai ganti Umrahku sebelumnya.\" Hisyam berkata, \"Dan dalam hal itu tidak ada denda baik berupa hadyu (menyembelih), puasa atau pun sedekah",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 318,
			"arabicnumber": 318,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Hammad] dari ['Ubaidullah bin Abu Bakar] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya Allah Ta'ala menugaskan satu Malaikat dalam rahim seseorang. Malaikat itu berkata, 'Ya Rabb, (sekarang baru) sperma. Ya Rabb, segumpal darah!, Ya Rabb, segumpal daging! ' Maka apabila Allah berkehendak menetapkan ciptaan-Nya, Malaikat itu bertanya, 'Apakah laki-laki atau wanita, celaka atau bahagia, bagaimana dengan rizki dan ajalnya? ' Maka ditetapkanlah ketentuan takdirnya selagi berada dalam perut ibunya",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 319,
			"arabicnumber": 319,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari ['Urwah] dari ['Aisyah] berkata, \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam pada saat haji Wada'. Di antara kami ada yang bertalbiah dengan Umrah dan ada pula yang bertalbiah dengan haji. Ketika kami sudah sampai di Makkah, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berihram dengan Umrah dan tidak membawa sembelihan, maka hendaklah dia bertahallul. Dan barangsiapa berihram dengan Umrah dan membawa sembelihan, maka janganlah bertahallul kecuali setelah menyembelih hewan pada hari Nahr (hari penyembelihan). Dan barangsiapa bertalbiah (memulai) dengan haji, hendaklah menyempurnakan hajinya.\" 'Aisyah berkata, \"Kemudian aku mengalami haid dan terus terjadi hingga hari 'Arafah, dan aku tidak bertalbiah kecuali dengan Umrah. Maka Nabi shallallahu 'alaihi wasallam memerintahkan aku untuk menguraikan (rambut) kepalaku dan menyisirnya, lalu bertalbiah dengan haji dan meninggalkan Umrah. Maka aku laksanakan hingga aku merampungkan hajiku. Kemudian beliau mengutus saudaraku, 'Abdurrahman bin Abu Bakar untuk menemaniku dan memerintahkan aku agar aku berumrah dari Tan'im sebagai ganti Umrahku sebelumnya",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 320,
			"arabicnumber": 320,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] berkata, telah menceritakan kepada kami [Sufyan] dari [Hisyam] dari [Bapaknya] dari ['Aisyah] bahwa Fatimah binti Abu Hubaisy mengalami istihadlah (mengeluarkan datah penyakit). Maka aku bertanya kepada Nabi shallallahu 'alaihi wasallam, dan beliau menjawab: \"Itu seperti keringat dan bukan darah haid. Jika haid datang maka tinggalkanlah shalat dan jika telah selesai mandilah dan shalatlah",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 321,
			"arabicnumber": 321,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammam] berkata, telah menceritakan kepada kami [Qatadah] berkata, telah menceritakan kepadaku [Mu'adzah], bahwa ada seorang wanita bertanya kepada ['Aisyah], \"Apakah seorang dari kita harus melaksanakan shalat yang ditinggalkannya bila sudah suci?\" 'Aisyah menjawab, \"Apakah kamu dari kelompok Khawarij! Sungguh kami pernah mengalami haid di sisi Nabi shallallahu 'alaihi wasallam, dan beliau tidak memerintahkan kami untuk itu.\" Atau Aisyah mengatakan, \"Kami tidak melakukannya (mengqadla)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 322,
			"arabicnumber": 322,
			"text": "Telah menceritakan kepada kami [Sa'd bin Hafsh] berkata, telah menceritakan kepada kami [Syaiban] dari [Yahya] dari [Abu Salamah] dari [Zainab binti Abu Salamah] bahwa ia menceritakan kepadanya, bahwa [Ummu Salamah] berkata, \"Saat aku berada dalam satu selimut bersama Nabi shallallahu 'alaihi wasallam, aku mengeluarkan darah haid, kemudian pelan-pelan aku keluar dari selimut mengambil pakaian (khusus untuk haid) dan mengenakannya. Rasulullah shallallahu 'alaihi wasallam bertanya kepadaku: \"Apakah kamu sedang haid?\" Aku jawab, \"Ya.\" Beliau lalu memanggil dan mengajakku masuk ke dalam selimut.\" Zainab berkata, \"Ummu Salamah menceritakan kepadaku bahwa Nabi shallallahu 'alaihi wasallam juga menciumnya saat beliau sedang berpuasa. Ummu Salam berkata, \"Aku pernah mandi junub dalam satu bejana bersama Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 323,
			"arabicnumber": 323,
			"text": "Telah menceritakan kepada kami [Mu'adz bin Fadlalah] berkata, telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Salamah] dari [Zainab binti Abu Salamah] dari [Ummu Salamah] berkata, \"Ketika aku berbaring bersama Nabi shallallahu 'alaihi wasallam dalam satu selimut aku mengalami haid. Maka aku pergi diam-diam dan mengambil baju khusus haidku, beliau bertanya: \"Apakah kamu sedang haid?\" Aku jawab, \"Ya.\" Beliau lalu memanggilku, maka aku pun berbaring bersamanya dalam satu selimut",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 324,
			"arabicnumber": 324,
			"text": "Telah menceritakan kepada kami [Muhammad] -yaitu Ibnu Salam- berkata, telah mengabarkan kepada kami ['Abdul Wahhab] dari [Ayyub] dari [Hafshah] berkata, \"Dahulu kami melarang anak-anak gadis remaja kami ikut keluar untuk shalat pada dua hari raya. Hingga suatu hari ada seorang wanita mendatangi desa Qashra Banu Khalaf, wanita itu menceritakan bahwa suami dari saudara perempuannya pernah ikut berperang bersama Nabi shallallahu 'alaihi wasallam sebanyak dua belas peperangan, ia katakan, 'Saudaraku itu hidup bersama suaminya selama enam tahun.' Ia menceritakan, \"Dulu kami sering mengobati orang-orang yang terluka dan mengurus orang yang sakit.' Saudara perempuanku bertanya kepada Nabi shallallahu 'alaihi wasallam, \"Apakah berdosa bila seorang dari kami tidak keluar (mengikuti shalat 'Ied) karena tidak memiliki jilbab?\" Beliau menjawab: \"Hendaklah kawannya memakaikan jilbab miliknya untuknya (meminjamkan) agar mereka dapat menyaksikan kebaikan dan mendo'akan Kaum Muslimin.\" Ketika [Ummu 'Athiyah] tiba aku bertanya kepadanya, \"Apakah kamu mendengar langsung dari Nabi shallallahu 'alaihi wasallam?\" Ummu 'Athiyah menjawab, \"Ya. Demi bapakku!\" Ummu 'Athiyah tidak mengatakan tentang Nabi shallallahu 'alaihi wasallam kecuali hanya mengatakan 'Demi bapakku, aku mendengar beliau bersabda: \"Hendaklah para gadis remaja dan wanita-wanita yang dipingit di rumah, dan wanita yang sedang haid ikut menyaksikan kebaikan dan mendo'akan Kaum Muslimin, dan wanita-wanita haid menjauh dari tempat shalat.\" Hafshah, \"Aku katakan, \"Wanita haid?\" Wanita itu menjawab, \"Bukankah mereka juga hadir di 'Arafah, begini dan begini?",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 325,
			"arabicnumber": 325,
			"text": "Telah menceritakan kepada kami [Ahmad bin Abu Raja'] berkata, telah menceritakan kepada kami [Abu Usamah] berkata, Aku mendengar [Hisyam bin 'Urwah] berkata, telah mengabarkan kepadaku [Bapakku] dari ['Aisyah] bahwa Fatimah binti Abu Hubaisy bertanya kepada Nabi shallallahu 'alaihi wasallam, katanya, \"Aku mengeluarkan darah istihadlah (penyakit). Apakah aku tinggalkan shalat?\" Beliau menjawab: \"Jangan, karena itu hanyalah darah penyakit seperti keringat. Tinggalkanlah shalat selama masa haidmu, setelah itu mandi dan kerjakanlah shalat",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 326,
			"arabicnumber": 326,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Muhammad] dari [Ummu 'Athiyyah] berkata, \"Kami tidak menganggap warna keruh dan kekuningan sebagai sesuatu dari haid",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 327,
			"arabicnumber": 327,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir] berkata, telah menceritakan kepada kami [M'an] berkata, telah menceritakan kepadaku [Ibnu Abu Dzi'b] dari [Ibnu Syihab] dari ['Urwah] dan dari ['Amrah] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, \"Ummu Habibah mengeluarkan darah istihadlah (darah penyakit) selama tujuh tahun. Lalu ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang masalah itu. Beliau lalu memerintahkan kepadanya untuk mandi, beliau bersabda: \"Ini seperti keringat (darah penyakit).\" Maka Ummu Habibah selalu mandi untuk setiap kali shalat",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 328,
			"arabicnumber": 328,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari ['Abdullah bin Abu Bakar bin Muhammad bin 'Amru bin Hazm] dari [Bapaknya] dari ['Amrah binti 'Abdurrahman] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata kepada Rasulullah shallallahu 'alaihi wasallam: \"Wahai Rasulullah, Shafiyyah binti Huyai sedang haid?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Jangan-jangan dia menyusahkan kita! Apakah dia thawaf bersama kalian?\" Mereka menjawab, \"Ya.\" Beliau lalu bersabda (kepada Shafiyyah): \"Ikutlah keluar",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 330,
			"arabicnumber": 330,
			"text": "",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 331,
			"arabicnumber": 331,
			"text": "Telah menceritakan kepada kami [Ahmad bin Yunus] dari [Zuhair] berkata, telah menceritakan kepada kami [Hisyam bin 'Urwah] dari ['Urwah] dari ['Aisyah] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Jika datang haid maka tinggalkanlah shalat, dan bila telah berakhir maka bersihkanlah darah darimu lalu shalatlah",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 332,
			"arabicnumber": 332,
			"text": "Telah menceritakan kepada kami [Ahmad bin Abu Suraij] berkata, telah mengabarkan kepada kami [Syababah] berkata, telah mengabarkan kepada kami [Syu'bah] dari [Husain Al Mu'alim] dari ['Abdullah bin Buraidah] dari [Samrah bin Jundub], bahwa ada seorang wanita yang meninggal dunia karena hamil. Maka Nabi shallallahu 'alaihi wasallam menshalatinya dan beliau berdiri di bagian tengah (jenazah) nya",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 333,
			"arabicnumber": 333,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Mudrik] berkata, telah menceritakan kepada kami [Yahya bin Hammad] berkata, telah mengabarkan kepada kami [Abu 'Awanah] nama aslinya adalah Al Wadldlah sebagaimana dalam kitabnya, ia berkata; telah mengabarkan kepada kami [Sulaiman Asy Syaibani] dari ['Abdullah bin Syaddad] berkata, Aku mendengar bibiku [Maimunah] isteri Nabi shallallahu 'alaihi wasallam, bahwa ia mengalami haid dan tidak melaksanakan shalat. Dan ia tidur di depan tempat sujud Rasulullah shallallahu 'alaihi wasallam yang saat itu sedang shalat di atas tikar (kecil) nya, jika sujud beliau maka sebagian kainnya mengenaiku",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 37
			}
		}
	]
}