{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5373,
			"arabicnumber": 5373,
			"text": "Telah menceritakan kepada kami [Muhammad bin Katsir] Telah mengabarkan kepada kami [Sufyan] dari [Manshur] dari [Abu Wa`il] dari [Abu Musa Al Asy'ari] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Berilah makan kepada orang yang kelaparan, jenguklah orang sakit dan bebaskanlah Al 'Ani.\" Sufyan berkata; \"Al 'Ani adalah Al Asir (tawanan)",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5374,
			"arabicnumber": 5374,
			"text": "Telah menceritakan kepada kami [Yusuf bin Isa] Telah menceritakan kepada kami [Muhamamd bin Fudlail] dari [bapaknya] dari [Abu Hazim] dari [Abu Hurairah] ia berkata; \"Keluarga Nabi Muhammad shallallahu 'alaihi wasallam tidak pernah kenyang dengan makanan selama tiga hari, hingga beliau wafat",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5375,
			"arabicnumber": 5375,
			"text": "Dan (masih dari jalur periwayatan yang sama dengan hadits sebelumnya) dari [Abu Hazim] dari [Abu Hurairah] ia berkata; Aku pernah tertimpa kesulitan yang sangat, lalu kujumpai Umar bin Al Khaththab dan aku pun memintanya untuk membacakan ayat dari Kitabullah. Maka ia pun masuk ke dalam rumahnya dan membukakan pintu untukku. Kemudian aku berjalan tak jauh dari situ, lalu aku menundukkan wajahku lantaran rasa penat dan lapar. Ternyata Rasulullah shallallahu 'alaihi wasallam berdiri tetap di depan kepalaku. Beliau bersabda: \"Wahai Abu Hurairah.\" Aku menjawab, \"Labbaik ya Rasulullah wa Sa'daik.\" Kemudian beliau menggandeng kedua tanganku dan menegakkanku, dan beliau pun tahu apa yang menimpa diriku. Kemudian beliau membawaku menuju kendaraannya, lalu beliau menyuruhku untuk meminum seteguk susu. Maka aku pun meminumnya. Setelah itu beliau bersabda: \"Ulangilah wahai Abu Hirr.\" Aku pun meminumnya kembali. Kemudian beliau bersabda: \"Ulangilah.\" Akhirnya aku minum hingga perutku kenyang seperti gelas. Setelah itu, aku menemui Umar dan menuturkan apa terjadi denganku. Aku berkata padanya, \"Maka Allah memberikan urusan itu kepada orang yang lebih berhak dari pada Anda wahai Umar. Demi Allah, aku telah meminta Anda untuk membacakan ayat sementara aku adalah lebih bagus bacaannya daripada Anda.\" Umar berkata, \"Demi Allah, aku memasukkanmu kedalam rumahku adalah lebih aku sukai daripada aku memiliki Unta merah",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5376,
			"arabicnumber": 5376,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] Telah mengabarkan kepada kami [Sufyan] ia berkata; [Al Walid bin Katsir] Telah mengabarkan kepadaku, bahwa ia mendengar [Wahb bin Kaisan] bahwa ia mendengar [Umar bin Abu Salamah] berkata; Waktu aku masih kecil dan berada di bawah asuhan Rasulullah shallallahu 'alaihi wasallam, tanganku bersileweran di nampan saat makan. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Ghulam, bacalah Bismilillah, makanlah dengan tangan kananmu dan makanlah makanan yang ada di hadapanmu.\" Maka seperti itulah gaya makanku setelah itu",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5377,
			"arabicnumber": 5377,
			"text": "Telah menceritakan kepadaku [Abdul Aziz bin Abdullah] ia berkata; Telah menceritakan kepadaku [Muhammad bin Ja'far] dari [Muhammad bin Amru bin Halhalah Ad Dili] dari [Wahb bin Kaisan Abu Nu'aim] dari [Amru bin Abu Salamah] ia adalah Ibnu Ummu Salah isteri Nabi shallallahu 'alaihi wasallam, ia berkata; Suatu hari, aku makan makanan bersama Rasulullah shallallahu 'alaihi wasallam, lalu aku menyantap makanan dari ujung nampan, maka Rasulullah shallallahu 'alaihi wasallam bersabda padaku: \"Makanlah makanan yang ada didepanmu",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5378,
			"arabicnumber": 5378,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] Telah mengabarkan kepada kami [Malik] dari [Wahb bin Kaisan Abu Nu'aim] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah diberi makanan, dan saat itu beliau bersama anak tirinya Umar bin Abu Salamah, maka beliau pun bersabda: \"Bacalah Basmalah dan ambillah makanan yang ada didekatmu",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5379,
			"arabicnumber": 5379,
			"text": "Telah menceritakan kepada kami [Qutaibah] dari [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] bahwa ia mendengar [Anas bin Malik] berkata; Sesungguhnya Khayyath mengundang Rasulullah shallallahu 'alaihi wasallam untuk menyantap makanan yang dibuatnya. Anas berkata; Maka aku pun pergi bersama Rasulullah shallallahu 'alaihi wasallam, lalu aku melihat beliau mencari-cari labu dari sekitar piring. Maka sejak hari itu, aku pun mulai menyukai labu",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5380,
			"arabicnumber": 5380,
			"text": "Telah menceritakan kepada kami [Abdan] Telah mengabarkan kepada kami [Abdullah] Telah mengabarkan kepada kami [Syu'bah] dari [Asy'ats] dari [bapaknya] dari [Masruq] dari [Aisyah] radliallahu 'anha, ia berkata; Nabi shallallahu 'alaihi wasallam menyukai sebelah kanan sejauh beliau bisa melakukannya, yakni dalam bersuci, memakai terompah, dan menyisir, dan setiap urusnanya. Syu'bah katakan, Asy'ats di kota Wasith mengucapkan kata-kata lain sebelum ini",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5381,
			"arabicnumber": 5381,
			"text": "Telah menceritakan kepada kami [Isma'il] ia berkata; Telah menceritakan kepadaku [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] bahwa ia mendengar [Anas bin Malik] berkata; Abu Thalah berkata kepada Ummu Sulaim, \"Aku mendengar suara Rasulullah shallallahu 'alaihi wasallam telah melemah, dan aku tahu bahwa beliau sedang lapar. Apakah kamu mempunyai sesuatu?\" Maka Ummu Sulaim pun mengeluarkan beberapa bulatan gandum, dan mengeluarkan tudungnya lalu menutup roti itu dan meletakkannya di balik pakaianku. Ia juga memberikan sebagiannya padaku lalu mengutusku untuk menemui Rasulullah shallallahu 'alaihi wasallam. Aku pun membawa dan aku dapati Rasulullah shallallahu 'alaihi wasallam sedang berada di dalam masjid yang sedang bersama orang-orang. Aku berdiri di tengah-tengah mereka, maka Rasulullah shallallahu 'alaihi wasallam bertanya padaku: \"Apakah kamu diutus oleh Abu Thalhah?\" Aku menjawab, \"Ya.\" Beliau bertanya lagi: \"Dengan membawa makanan?\" Aku berkata, \"Ya.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam bersabda kepada orang-orang yang saat itu sedang bersamanya: \"Beranjaklah.\" Maka mereka pun segera beranjak pergi (ke tempat Abu Thalhah) dan aku segera bergegas ke hadapan mereka, hingga aku sampai di tempat Abu Thalhah. Maka Abu Thalhah pun berkata, \"Wahai Ummu Sulaim. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah datang bersama orang-orang sementara kita tidak memiliki persediaan makanan untuk menjamu mereka.\" Ummu Sulaim berkata, \"Allah dan Rasul-Nya yang lebih mengetahui.\" Akhirnya Abu Thalhah pergi hingga bertemu dengan Rasulullah shallallahu 'alaihi wasallam. Maka Abu Thalhah menyambut Rasulullah shallallahu 'alaihi wasallam hingga keduanya masuk. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Ummu Sulaim, keluarkanlah makanan yang kamu punyai.\" Maka Ummu Sulaim pun mengeluarkan roti itu. Lalu Nabi shallallahu 'alaihi wasallam menyuruh untuk diremukkan sementara Ummu Sulaim meremas-remas samin untuk lauk roti. Kemudian Rasulullah Shallallah membacakan sesutu padanya sekehendak Allah. Sesudah itu beliau bersabda: \"Izinkanlah untuk sepuluh orang.\" Lalu ia pun mengizinkan mereka dan mereka pun makan hingga kenyang dan keluar. Beliau bersabda lagi: \"Izinkan untuk sepuluh orang lagi.\" Ia pun mengizinkan mereka hingga mereka makan sampai kenyang dan keluar. Beliau bersabda lagi: \"Izinkan untuk sepuluh orang lagi.\" Ia pun mengizinkan mereka hingga mereka semua makan sampai kenyang lalu keluar. Setelah itu, beliau mengizinkan lagi untuk sepuluh orang. Akhirnya mereka semua makan dan kenyang. Padahal jumlah mereka adalah delapan puluh orang",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5382,
			"arabicnumber": 5382,
			"text": "Telah menceritakan kepada kami [Musa] Telah menceritakan kepada kami [Mu'tamir] dari [bapaknya] ia berkata; Dan [Abu Utsman] Telah menceritakan juga dari [Abdurrahman bin Abu Bakar] radliallahu 'anhuma, ia berkata; Suatu ketika kami pernah bersama Nabi shallallahu 'alaihi wasallam dengan seratus tiga puluh orang sahabat. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah salah seorang dari kalian memiliki makanan?\" ternyata ada seorang laki-laki yang mempunyai satu Sha' makanan atau sebanyak itu, lalu makanan itu pun dibuat adonan. Kemudian datanglah seorang laki-laki musyrik berambut kusut dan berpostur tubuh tinggi dengan membawa kambing. Maka Nabi shallallahu 'alaihi wasallam bertanya, \"Apakah kambing itu adalah untuk dijual, diserahkan sebagai pemberian ataukah Hibah?\" laki-laki itu menjawab, \"Untaku dijual.\" Akhirnya beliau membeli satu kambing dari orang itu, lalu kambing itu dimasak. Kemudian Nabi shallallahu 'alaihi wasallam memerintahkan para sahabat agar dipanggangkan. Dan sungguh Maha Besar Allah, tidak seorang pun dari seratus tiga puluh orang itu, kecuali telah memotong daging perut kambing itu. Bila ia hadir, maka beliau akan memberinya langsung, dan jika tidak, maka beliau akan menyimpan untuknya. Kemudian beliau meletakkan sebagian darinya di dalam nampan, lalu kami pun makan di situ semuanya, dan kami pun kenyang. Namun di dalam nampan ternyata masih tersisa, sehingga aku pun membawanya di atas Unta milikku. -Atau sebagaimana yang ia katakan",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5383,
			"arabicnumber": 5383,
			"text": "Telah menceritakan kepada kami [Muslim] Telah menceritakan kepada kami [Wuhaib] Telah menceritakan kepada kami [Manshur] dari [Ibunya] dari [Aisyah] radliallahu 'anha ia berkata; Nabi shallallahu 'alaihi wasallam wafat ketika kami kenyang karena makan kurma dan minum air",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5384,
			"arabicnumber": 5384,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] Telah menceritakan kepada kami [Sufyan] Telah berkata [Yahya bin Sa'id] Aku mendengar [Busyair bin Yasar] berkata; Telah menceritakan kepada kami [Suwaid bin An Nu'man] ia berkata; kami pernah keluar ke Khaibar bersama Rasulullah shallallahu 'alaihi wasallam. Ketika kami sampai di Shahba` -Yahya berkata; Dari Khaibar adalah perjalanan semalam- Rasulullah shallallahu 'alaihi wasallam meminta makanan, namun beliau hanya diberi makanan berupa gandum. Maka kami mengunyah dan memakannya. Setelah itu, beliau meminta air, lalu berkumur dan kami pun ikut berkumur-kumur. Kemudian beliau shalat Maghrib bersama kami dengan tanpa berwudlu lagi. Sufyan berkata; Aku mendengarnya darinya ketika pulang dan ketika awal perjalanan",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5385,
			"arabicnumber": 5385,
			"text": "Telah menceritakan kepada kami [Muhammad bin Sinan] Telah menceritakan kepada kami [Hammam] dari [Qatadah] ia berkata; Suatu kami berada di sisi [Anas] dan saat itu ia mempunyai pembuat roti, maka ia pun berkata, \"Nabi shallallahu 'alaihi wasallam tidak pernah makan roti yang empuk dan tidak pula kambing yang dipanggang",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5386,
			"arabicnumber": 5386,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] Telah menceritakan kepada kami [Mu'adz bin Hisyam] ia berkata;; Telah menceritakan kepadaku [bapakku] dari [Yunus] -Ali berkata; Itu adalah Al Iksaf- dari [Qatadah] dari [Anas] radliallahu 'anhu, ia berkata; Aku tidak pernah mengetahui bahwa Nabi shallallahu 'alaihi wasallam makan di atas piring sekali pun. Dan tidak pernah pula beliau dibuatkan roti yang empuk sekali pun serta beliau juga tak pernah makan di atas meja makan sekali pun. Maka ditanyakan kepada Qatadah, \"Kalau begitu, di atas apa mereka makan?\" ia menjawab, \"Di atas daun kurma",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5387,
			"arabicnumber": 5387,
			"text": "Telah menceritakan kepada kami [Ibnu Abu Maryam] Telah mengabarkan kepada kami [Muhammad bin Ja'far] Telah mengabarkan kepadaku [Humaid] bahwa ia mendengar [Anas] berkata; Nabi shallallahu 'alaihi wasallam bermukim guna menikahi Shafiyyah, lalu aku pun mengundang kaum muslimin untuk menghadiri walimahnya. Beliau memerintahkan untuk menghidangkan hamparan dari kulit yang diberi kurma, keju dan samin. Dan [Amru] berkata; dari [Anas]; Nabi shallallahu 'alaihi wasallam mengadakan walimah dengan makanan itu. Kemudian beliau membuat bubur yang terbuat dari gandum, kurma dan daging, dan meletakkannya dalam hamparan kulit",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5388,
			"arabicnumber": 5388,
			"text": "Telah menceritakan kepada kami [Muhammad] Telah mengabarkan kepada kami [Abu Mu'awiyah] Telah menceritakan kepada kami [Hisyam] dari [bapaknya] dan dari [Wahb bin Kaisan] ia berkata; Para penduduk Syam menjuluki Ibnu Zubair dengan panggilan, \"Wahai Ibnu Dzata An Nithaaqain.\" Maka [Asma'] pun berkata padanya, \"Wahai anakku, sesungguhnya mereka menjulukimu dengan An Nithaaqain. Apakah kamu apakah itu An Nithaaqain. Demikian itu hanyalah karena, ikat pinggangku yang telah aku sobek menjadi dua. Lalu aku mengikat geriba Rasulullah shallallahu 'alaihi wasallam dengan salah satu darinya, sedangkan yang satu lagi aku letakkan untuk mengikat rangsum.\" Di kemudian hari, jika ada orang yang memberinya julukan buruk dengan panggilan 'Nithaqaini', ia jawab ' Hei, demi Allah, itu adalah panggilan yang jelas-jelas tercela",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5389,
			"arabicnumber": 5389,
			"text": "Telah menceritakan kepada kami [Abu Nu'man] Telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa Ummu Hufaid binti Al Harits bin Hazn bibi Ibnu Abbas, memberi hadiah kepada Nabi shallallahu 'alaihi wasallam berupa samin, keju dan biawak. Maka beliau pun mengundang orang-orang untuk memakannya, hingga makanan itu pun di makan di atas hidangan beliau. Sedangkan Nabi shallallahu 'alaihi wasallam meninggalkannya seperti seorang yang tak berselera. Dan sekiranya semua makanan itu haram, niscaya semua itu tidak dimakan di tempat hidangan Nabi shallallahu 'alaihi wasallam dan beliau tidak pula beliau menyuruh untuk memakannya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5390,
			"arabicnumber": 5390,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] Telah menceritakan kepada kami [Hammad] dari [Yahya] dari [Busyair binti Yasar] dari [Suwaid bin An Nu'man] bahwa ia telah mengabarkan kepadanya bahwa mereka pernah bersama Nabi shallallahu 'alaihi wasallam di Shahba` -tempat yang berjarak semalam perjalanan Khaibar- kemudian tibalah waktu shalat. Beliau meminta makanan, namun tidak ada makanan kecuali tepung gandum, lalu beliau mengunyahnya dan kami pun ikut mengunyah bersamanya. Setelah itu, beliau meminta air dan berkumur-kumur kemudian shalat dan kami pun shalat sementara beliau tidak berwudlu lagi",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5391,
			"arabicnumber": 5391,
			"text": "Telah menceritakan kepada kami [Muhammad bin Muqatil Abul Hasan] Telah mengabarkan kepada kami [Abdullah] Telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] ia berkata; Telah mengabarkan kepadaku [Abu Umamah bin Sahl bin Hunaif Al Anshari] bahwa [Ibnu Abbas] telah mengabarkan kepadanya bahwa [Khalid bin Al Khalid] yang juga dijuluki sebagai Saifullah telah mengabarkan kepadanya; Bahwa ia dan Rasulullah shallallahu 'alaihi wasallam pernah menemui bibinya yaitu Maimunah yang juga bibi daripada Ibnu Abbas. kemudian ia mendapati biawak yang telah terpanggang yang dibawa oleh saudara bibinya yakni, Hudzaifah bintu Al Harits dari Najed. Maka Maimunah pun menyuguhkan Biawak itu kepada Rasulullah shallallahu 'alaihi wasallam. Jarang sekali beliau memajukan tangannya untuk mengambil makanan hingga beliau dipersilahkan bahwa makanan itu untuk beliau. Saat itu, Rasulullah shallallahu 'alaihi wasallam menggerakkan tangannya ke arah biawak, lalu seorang wanita yang hadir di situ berkata dan memberitahukan kepada beliau tentang makanan yang telah disuguhkan, \"Itu adalah Biawak ya Rasulullah?\" Maka seketika itu, Rasulullah shallallahu 'alaihi wasallam segera menarik tangannya kembali dari daging Biawak sehingga Khalid bin Al Walid pun bertanya, \"Apakah daging Biawak itu haram ya Rasulullah?\" beliau menjawab: \"Tidak, akan tetapi daging itu tidak terdapat di negeri kaumku, karena itu aku tidak memakannya.\" Khalid berkata, \"Lalu aku pun menarik dan memakannya. Sementara Rasulullah shallallahu 'alaihi wasallam melihat ke arahku",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5392,
			"arabicnumber": 5392,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] Telah mengabarkan kepada kami [Malik] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Isma'il] ia berkata; Telah menceritakan kepadaku [Malik] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Makanan untuk dua orang cukup untuk tiga orang, dan makanan untuk tiga orang cukup untuk empat orang",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5393,
			"arabicnumber": 5393,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basysyar] Telah menceritakan kepada kami [Abdush Shamad] Telah menceritakan kepada kami [Syu'bah] dari [Waqid bin Muhammad] dari [Nafi'] ia berkata; Biasanya [Ibnu Umar] tidak makan hingga didatangnya kepadanya seorang miskin lalu makan bersamanya. Maka aku pun memasukkan seorang laki-laki untuk makan bersamanya, lalu laki-laki itu makan banyak, maka ia pun berkata, \"Wahai Nafi', jangan kamu masukkan orang ini. sesungguhnya aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Seorang mukmin itu makan dengan satu usus, sedangkan orang kafir makan dengan tujuh usus",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5394,
			"arabicnumber": 5394,
			"text": "Telah menceritakan kepada kami [Muhammad bin Salam] Telah mengabarkan kepada kami [Abdah] dari [Ubaidullah] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhuma, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang mukmin itu makan dengan satu usus, sedangkan orang kafir atau munafik -aku tidak tahu mana yang beliau ucapkan diantara keduanya- makan dengan tujuh usus.\" [Ibnu Bukair] berkata; Telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam semisalnya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5395,
			"arabicnumber": 5395,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] Telah menceritakan kepada kami [Sufyan] dari [Amru] ia berkata; Bahwasnya Abu Nahik adalah seorang yang makannya sedikit, maka [Ibnu Umar] berkata padanya; Sesungguhnya Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Sesungguhnya orang kafir itu makan dengan tujuh usus.\" Maka ia pun berkata, \"Kalau begitu, aku beriman kepada Allah dan Rasul-Nya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5396,
			"arabicnumber": 5396,
			"text": "Telah menceritakan kepada kami [Isma'il] ia berkata; Telah menceritakan kepadaku [Malik] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang mukmin itu hanya makan dengan satu usus, sedangkan orang kafir makan dengan tujuh usus",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5397,
			"arabicnumber": 5397,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] Telah menceritakan kepada kami [Syu'bah] dari [Adi bin Tsabit] dari [Abu Hazim] dari [Abu Hurairah] bahwa seorang ada seorang laki-laki yang makannya banyak, lalu ia masuk Islam. Setelah itu, makannya menjadi sedikit, maka hal itu pun diceritakan kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"Sesungguhnya seorang mukmin itu makan dari satu usus, sedangkan orang kafir makan dengan tujuh usus",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5398,
			"arabicnumber": 5398,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] Telah menceritakan kepada kami [Mis'ar] dari [Ali bin Al Aqmar] Aku mendengar [Abu Juhaifah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku tidaklah makan sambil bersandar",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5399,
			"arabicnumber": 5399,
			"text": "Telah menceritakan kepadaku [Utsman bin Abu Syaibah] Telah mengabarkan kepada kami [Jarir] dari [Manshur] dari [Ali bin Al Aqmar] dari [Abu Juhaifah] ia berkata; Suatu ketika, apa berada di sisi Nabi shallallahu 'alaihi wasallam, kemudian beliau bersabda kepada seorang laki-laki yang ada di sisinya: \"Aku tidak akan makan sambil bersandar",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5400,
			"arabicnumber": 5400,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] Telah menceritakan kepada kami [Hisyam bin Yusuf] Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Umamah bin Sahl] dari [Ibnu Abbas] dari [Khalid bin Al Walid] ia berkata; Nabi shallallahu 'alaihi wasallam pernah diberi daging biawak yang terpanggang. Maka beliau pun berselera hendak memakannya, lalu dikatakanlah kepada beliau, \"Itu adalah daging biawak.\" Dengan segera beliau menahan tangannya kembali. Khalid bertanya, \"Apakah daging itu adalah haram?\" beliau bersabda: \"Tidak, akan tetapi daging itu tidak ada di negeri kaumku.\" Beliau tidak melarang. Maka Khalid pun memakannya sementara Rasulullah shallallahu 'alaihi wasallam melihat. [Malik] berkata; Dari [Ibnu Syihab]; BIDLABBIN MAHNUUDZ (Biawak yang dipanggang)",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5401,
			"arabicnumber": 5401,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] Telah menceritakan kepada kami [Al Laits] dari [Uqail] dari [Ibnu Syihab] ia berkata; Telah mengabarkan kepadaku [Mahmud bin Ar Rabi' Al Anshari] bahwa ['Itban bin Malik] -ia adalah termasuk salah seorang sahabat Nabi shallallahu 'alaihi wasallam dan termasuk Ahli Badar- bahwasanya; Ia pernah mendatangi Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, sesungguhnya aku selalu shalat bersama kaumku, akan tetapi, saat hujan turun dan lembah yang memisahkan antara aku dan kaumku pun membanjir, maka aku tidak bisa lagi mendatangi masjid mereka. Karena itu aku sangat berharap bahwa Anda datang dan shalat di rumahku, hingga aku pun menjadikannya tempat shalat.\" Beliau pun bersabda: \"Aku akan melakukannya Insya Allah.\" 'Utban berkata; Ketika matahari mulai meninggi, Rasulullah shallallahu 'alaihi wasallam pun berangkat bersama Abu Bakar. Kemudian Nabi shallallahu 'alaihi wasallam meminta izin dan aku pun mengizinkannya. Beliau tidak duduk hingga masuk ke dalam rumah dan bertanya padaku: \"Di tempat manakah yang kamu sukai aku shalat?\" Aku pun memberi isyarat pada bagian di rumah itu. Kemudian Nabi shallallahu 'alaihi wasallam bangun dan bertakbir, lalu kami pun membentuk shaf. Beliau shalat dua raka'at dan salam. Sesudah itu, kami menahan beliau dengan bambu yang telah kami buat. Lalu berkumpullah beberapa orang di rumah itu, dan salah seorang dari mereka berkata, \"Di mana Malik bin Ad Dukhsyun?\" sebagian dari mereka menjawab, \"Ia adalah seorang munafik yang tidak menyukai Allah dan Rasul-Nya.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu berbicara seperti itu. Tidakkah kamu lihat ia mengucapkan 'Laa Ilaaha Illallah' dan ia mengucapkan karena wajah Allah?\" laki-laki itu menjawab, \"Allah dan Rasul-Nya yang lebih mengetahui.\" Kami berkata, \"Sesungguhnya kami telah melihat wajah dan nasehatnya kepada orang-orang munafik.\" Maka beliau pun bersabda: \"Sesungguhnya Allah telah mengharamkan neraka atas orang yang mengucapkan Laa Ilaaha Illallah dengan mengharap wajah Allah.\" [Ibnu Syihab] berkata; Lalu aku bertanya kepada [Al Hushain bin Muhammad Al Anshari] -salah seorang Bani Salim- mengenai hadits Mahmud, lalu ia pun membenarkannya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5402,
			"arabicnumber": 5402,
			"text": "Telah menceritakan kepada kami [Muslim bin Ibrahim] Telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Sa'id] dari [Ibnu Abbas] Radliayallahu 'Anhuma, ia berkata; Bibiku pernah memberi hadiah kepada Rasulullah shallallahu 'alaihi wasallam berupa daging biawak, keju dan susu. Kemudian daging biawak itu diletakkan di atas hidangan beliau. Sekiranya biawak itu haram, niscaya ia tidak akan diletakkan di situ. Lalu beliau meminum susu dan memakan keju",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5403,
			"arabicnumber": 5403,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] Telah menceritakan kepada kami [Ya'qub bin Abdurrahman] dari [Abu Hazim] dari [Sahl bin Sa'd] ia berkata; Dulu kami benar-benar merasa senang di hari Jum'at. Kami memiliki seorang nenek yang telah tua. Biasanya ia mengambil ubi lalu meletakkannya di dalam periuk miliknya dan menambahkan pula biji-bijian dari gandum. Setelah shalat Jum'at kami selalu mengunjunginya, sehingga sang nenek pun menyuguhkan ubi serta biji-bijian itu untuk kami. Karena itulah hari Jum'at, adalah hari yang sangat menyenangkan bagi kami. Kami tidak pernah menyantap makan siang dan tidak pula tidur, kecuali setelah Jum'at. Demi Allah di situ tak ada lemak, tidak pula bubur tepung mengandung lemak",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5404,
			"arabicnumber": 5404,
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5405,
			"arabicnumber": 5405,
			"text": "Telah menceritakan kepada kami [Abdullah bin Abdul Wahhab] Telah menceritakan kepada kami [Hammad] Telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Ibnu Abbas] radliallahu 'anhuma, ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengunyah bahu kambing kemudian berdiri dan shalat dengan tidak berwudlu lagi. Dan dari [Ayyub] dan [Ashim] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Nabi shallallahu 'alaihi wasallam pernah menggigit urat dari periuk kemudian beliau memakannya dan shalat dengan tidak berwudlu lagi",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5406,
			"arabicnumber": 5406,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] ia berkata; Telah menceritakan kepadaku [Utsman bin Umar] Telah menceritakan kepada kami [Fulaih] Telah menceritakan kepada kami [Abu Hazim Al Madani] Telah menceritakan kepada kami [Abdullah bin Abu Qatadah] dari [bapaknya] ia berkata; Kami pernah keluar bersama Nabi shallallahu 'alaihi wasallam menuju ke arah Ka'bah",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5407,
			"arabicnumber": 5407,
			"text": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah] Telah menceritakan kepada kami [Muhammad bin Ja'far] dari [Abu Hazim] dari [Abdullah bin Abu Qatadah As Salami] dari [bapaknya] bahwa ia berkata; Pada suatu hari, aku duduk-duduk bersama beberapa orang dari kalangan sahabat Nabi shallallahu 'alaihi wasallam, tepatnya di suatu rumah yang ada di jalan menuju Makkah, sementara Nabi shallallahu 'alaihi wasallam juga singgah di hadapan kami, sedangkan orang-orang dalam keadaan Ihram, kecuali aku. Tiba-tiba mereka melihat keledai liar, sementara aku sedang sibuk menambal sendalku, dan mereka juga tidak memberitahuku. Mereka sangat menginginkan bila aku melihatnya. Aku pun menoleh, lalu melihatnya, maka aku segera beranjak menuju kuda milikku, memasang pelananya dan menaikinya, namun aku lupa untuk membawa cambuk dan tombak. Maka kukatakanlah pada mereka, \"Ambilkan cambuk dan tombak.\" Mereka berkata, \"Tidak, Demi Allah, kami tidak akan membantumu dengan sesuatu pun untuk menangkapnya.\" Aku pun marah dan turun lalu mengambil keduanya lalu segera menuju himar dan menikamnya. Kemudian aku mendatanginya, dan ternyata ia telah mati. Lalu orang-orang yang muhrim pun ikut memakan dagingnya. Sesudah itu, mereka merasa bimbang karena memakannya karena mereka dalam keadaan Muhrim. Kemudian kami pun istirahat dan aku menyimpan daging bagian lengannya. Setelah itu, kami menjumpai Rasulullah shallallahu 'alaihi wasallam dan kami pun menanyakan hal itu pada beliau, maka beliau bersabda: \"Apakah kalian masih mempunyai dagingnya?\" Maka aku menyerahkan bagian lengannya itu pada beliau dan beliau pun memakannya hingga mengunyahnya sementara beliau sedang muhrim. [Muhammad bin Ja'far] berkata; dan Telah menceritakan kepadaku [Zaid bin Aslam] dari ['Atha` bin Yasar] dari [Abu Qatadah] semisalnya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5408,
			"arabicnumber": 5408,
			"text": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] ia berkata; Telah mengabarkan kepada kami [Ja'far bin Amru bin Umayyah] bahwa [bapaknya] yakni Amru bin Umayyah telah mengabarkan kepadanya bahwa ia pernah melihat Nabi shallallahu 'alaihi wasallam memotong bahu kambing yang ada pada tangannya, lalu masuklah waktu shalat. Maka beliau melepaskannya dan juga meletakkan pisau yang digunakannya memotong kemudian beliau bergegas dan menunaikan shalat dengan tanpa berwudlu lagi",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5409,
			"arabicnumber": 5409,
			"text": "Telah menceritakan kepada kami [Muhammad bin Katsir] Telah mengabarkan kepada kami [Sufyan] dari [Al A'masy] dari [Abu Hazim] dari [Abu Hurairah] ia berkata; Nabi shallallahu 'alaihi wasallam tidak pernah mencela makanan sekali pun. Bila beliau berselera, maka beliau memakannya dan bila tak suka, maka beliau meninggalkannya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5410,
			"arabicnumber": 5410,
			"text": "Telah menceritakan kepada kami [Sa'id bin Abu Maryam] Telah menceritakan kepada kami [Abu Ghassan] ia berkata; Telah menceritakan kepadaku [Abu Hazim] bahwa ia bertanya kepada [Sahl], \"Apakah kamu melihat An Naqiy (sumsum) pada masa Nabi shallallahu 'alaihi wasallam?\" Ia menjawab, \"Tidak.\" Aku bertanya lagi, \"Apakah kalian mengayak gandum?\" Ia menjawab, \"Tidak. Akan tetapi cukup bagi kami meniupnya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5411,
			"arabicnumber": 5411,
			"text": "Telah meceritakan kepada kami [Abu Nu'man] Telah menceritakan kepada kami [Hammad bin Zaid] dari [Abbas Al Jurairi] dari [Abu Utsman An Nahdi] dari [Abu Hurairah] ia berkata; \"Pada suatu hari, Nabi shallallahu 'alaihi wasallam membagikan kurma kepada para sahabatnya. Beliau beri tujuh butir kurma pada setiap orangnya. Maka beliau juga memberiku sebanyak tujuh butir kurma, salah satunya adalah kering, yang tidak ada kurma lainnya yang lebih mengherankan bagiku daripadanya karena sedemikian kerasnya kurma itu harus dikunyah",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5412,
			"arabicnumber": 5412,
			"text": "Telah menceritakan kepada kami [Abdullah bin Muhammad] Telah menceritakan kepada kami [Wahb bin Jarir] Telah menceritakan kepada kami [Syu'bah] dari [Isma'il] dari [Qais] dari [Sa'd] ia berkata; \"Aku melihat bahwa aku adalah salah seorang dari tujuh orang yang bersama Nabi shallallahu 'alaihi wasallam. Saat itu, kami tak punya makanan kecuali dedaunan anggur hingga kami buang kotoran sebagaimana kotoran kambing. Kemudian Banu Asad memuliakanku dengan Islam. Karena itu, aku betul-betul telah rugi dan usahaku pun sia-sia",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5413,
			"arabicnumber": 5413,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Ya'qub] dari [Abu Hazim] ia berkata; Aku bertanya kepada [Sahl], \"Apakah Rasulullah shallallahu 'alaihi wasallam makan gandum yang ditapis?\" Sahl menjawab, \"Rasulullah shallallahu 'alaihi wasallam tidak pernah melihat gandum yang ditapis sejak Allah mengutusnya hingga mewafatkannya.\" Aku bertanya lagi, \"Apakah di zaman Rasulullah shallallahu 'alaihi wasallam kalian mempunyai ayakan?\" Ia menjawab, \"Rasulullah shallallahu 'alaihi wasallam tidak pernah melihat ayakan sejak Allah mengutusnya hingga mewafatkannya.\" Aku bertanya lagi, \"Lalu bagaimana kalian memakan gandum yang belum terayak?\" ia menjawab, \"Kami menggiling dan meniupnya hingga terbanglah apa yang dapat terbang, sedangkan yang tersisa kami basahi dan memakannya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5414,
			"arabicnumber": 5414,
			"text": "Telah menceritakan kepadaku [Ishaq bin Ibrahim] Telah mengabarkan kepada kami [Rauh bin Ubadah] Telah menceritakan kepada kami [Ibnu Abu Dzi`b] dari [Sa'id Al Maqburi] dari [Abu Hurairah] radliallahu 'anhu, bahwa suatu ketika ia melewati suatu kaum yang dihadapan mereka terdapat seekor kambing yang telah terpanggang. Lalu mereka pun mengundangnya, namun ia enggan untuk memakan daging kambing tersebut. Dan Abu Hurairah pun berkata, \"Rasulullah shallallahu 'alaihi wasallam meninggalkan dunia ini, namun beliau belum pernah kenyang memakan roti yang terbuat dari gandum lembut",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5415,
			"arabicnumber": 5415,
			"text": "Telah menceritakan kepada kami [Abdullah bin Abul Aswad] Telah menceritakan kepada kami [Mu'adz] Telah menceritakan kepadaku [bapakku] dari [Yunus] dari [Qatadah] dari [Anas bin Malik] ia berkata; Nabi shallallahu 'alaihi wasallam tidak pernah makan di atas meja dan tidak pula dengan piring. Dan beliau tidak pernah dibuatkan roti empuk.\" Aku bertanya kepada Qatadah, \"Lalu di atas hamparan apa beliau makan?\" ia menjawab, \"Di atas daun kurma",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5416,
			"arabicnumber": 5416,
			"text": "Telah menceritakan kepada kami [Qutaibah] Telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] radliallahu 'anha, ia berkata, \"Keluarga Muhammad shallallahu 'alaihi wasallam tidak pernah kenyang dari gandum halus selama tiga malam berturut-turut sejak tiba di Madinah hingga beliau wafat",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5417,
			"arabicnumber": 5417,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] Telah menceritakan kepada kami [Al Laits] Telah menceritakan kepada kami ['Uqail] dari [Ibnu Syihab] dari [Urwah] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam bahwasanya; Bila salah seorang dari keluarganya meninggal, dan kaum wanita pun berkumpul lalu bubar kecuali pihak keluarganya, maka ia menyuruh untuk menyediakan periuk berisikan bubur yang dimasak dari gandum lembut. Kemudian ia membuat campuran daging dan roti dan menuangkan gandum lembut. Setelah itu, Aisyah berkata; Makanlah darinya, karena aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bubur gandum lembut bisa menghimpun hati yang sakit yang menghilangkan kesedihan",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5418,
			"arabicnumber": 5418,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basysyar] Telah menceritakan kepada kami [Ghundar] Telah menceritakan kepada kami [Syu'bah] dari [Amru bin Murrah Al Jamali] dari [Murrah Al Hamdani] dari [Abu Musa Al Asy'ari] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Kaum laki-laki yang sempurna sudah sekian banyak, namun dari kaum wanita tidak ada yang sempurnya kecuali Maryam binti Imran dan Asiyah isteri Fir'aun. Dan keutamaan Aisyah atas seluruh wanita adalah seperti keutamaan bubur atas semua jenis makanan",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5419,
			"arabicnumber": 5419,
			"text": "Telah menceritakan kepada kami [Amru bin 'Aun] Telah menceritakan kepada kami [Khalid bin Abdullah] dari [Abu Thuwalah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Keutamaan Aisyah atas seluruh wanita adalah seperti keutamaan bubur atas semua makanan",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5420,
			"arabicnumber": 5420,
			"text": "Telah menceritakan kepada kami [Abdullah bin Munir] Ia mendengar [Abu Hatim Al Asyhal bin Hatim] Telah menceritakan kepada kami [Ibnu 'Aun] dari [Tsumamah bin Anas] dari [Anas] Radliayallahu 'Anhu, ia berkata; Suatu ketika aku bersama Rasulullah shallallahu 'alaihi wasallam menemui seorang anak kecil yang memiliki penjahit. Kemudian sang penjahit itu menyuguhkan pada beliau hidangan yang berisikan bubur, lalu kembali meneruskan pekerjaannya. Kemudian Nabi shallallahu 'alaihi wasallam mencari-cari labunya dan mengunyahnya, maka aku pun ikut mengambil dan meletakkannya di depan beliau. Sejak itulah, aku menyukai labu",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5421,
			"arabicnumber": 5421,
			"text": "Telah menceritakan kepada kami [Hudbah bin Khalid] berkata; telah menceritakan kepada kami [Hammam bin Yahya] dari [Qatadah] ia berkata; \"Kami mendatangi [Anas bin Malik? radliallahu 'anhu] sementara pembuat rotinya berdiri. Ia lalu berkata; 'Makanlah. Sungguh aku tidak mengetahui bahwa Nabi shallallahu 'alaihi wasallam pernah melihat roti berkuah hingga bertemu dengan Allah. Dan beliau tidak pernah merasakan kambing bakar sama sekali",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5422,
			"arabicnumber": 5422,
			"text": "Telah menceritakan kepada kami [Muhammad bin Muqatil] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ja'far bin Amru bin Umayyah Adl Dlamri] dari [Bapaknya] ia berkata; \"Aku melihat Rasulullah shallallahu 'alaihi wasallam memotong-motong pundak kambing dan memakannya. Ketika panggilan shalat tiba, beliau langsung meletakkan pisaunya lalu melaksanakan shalat tanpa berwudlu lagi",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5423,
			"arabicnumber": 5423,
			"text": "Telah menceritakan kepada kami [Khallad bin Yahya] berkata; telah menceritakan kepada kami [Sufyan] dari ['Abdurrahman bin Abis] dari [Bapaknya] ia berkata; \"Aku bertanya kepada [Aisyah]; 'Apakah Nabi shallallahu 'alaihi wasallam melarang untuk makan daging sembelihan hari raya Adlha lebih dari tiga hari? ' Aisyah menjawab; \"Beliau tidak melakukan itu kecuali pada tahun paceklik (manusia kelaparan), sehingga beliau berharap orang kaya memberi makan kepada yang miskin. Dan sungguh, kami biasa makan lengan kambing setelah lima belas hari.\" Lalu dikatakan; 'Apa yang mendorong kalian melakukan itu? ' Aisyah tertawa, lalu ia berkata; 'Keluarga Muhammad shallallahu 'alaihi wasallam tidak pernah merasa kenyang karena makan roti atau gandum lebih dari tiga hari hingga beliau bertemu dengan Allah.' [Ibnu Katsir] berkata; telah mengabarkan kepada kami [Sufyan] berkata; telah menceritakan kepada kami ['Abdurrahman bin Abis] dengan hadits ini",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5424,
			"arabicnumber": 5424,
			"text": "Telah menceritakan kepadaku [Abdullah bin Muhammad] berkata; telah menceritakan kepada kami [Sufyan] dari [Amru] dari [Atha] dari [Jabir] ia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam kami pernah berbekal dengan daging hadyu hingga sampai Madinah.\" Hadits ini dikuatkan oleh [Muhammad] dari [Ibnu Uyainah], dan [Ibnu Juraij] berkata; Aku bertanya kepada [Atha]; 'Apakah ia mengatakan; 'Hingga kami tiba Madinah? ' Ia menjawab; 'Tidak",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5425,
			"arabicnumber": 5425,
			"text": "Telah menceritakan kepada kami [Qutaibah] berkata; telah menceritakan kepada kami [Ismail bin Ja'far] dari [Amru bin Abu Amru] mantan budak Al Muthallib bin Abdullah bin Hanthab, bahwa ia mendengar [Anas bin Malik] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda kepada Abu Thalhah: 'Berilah aku seorang pelayan lelaki dari yang kamu miliki hingga ia bisa membantuku.' Abu Thalhah lalu keluar dengan membawaku di belakang boncengannya. Aku lalu menjadi pelayan Rasulullah shallallahu 'alaihi wasallam. Setiap kali beliau singgah pada suatu tempat, beliau banyak membaca: 'ALLAHUMMA INNI A'UUDZUBIKA MINAL HAMMI WAL HAZANI WAL 'AJZI WAL KASALI WAL BUKHLI WAL JUBNI WA DLALA'ID DAINI WA 'ALAIHI WA GHALABATIR RIJAALI (Ya Allah, aku berlindung kepada-Mu dari keluh kesah dan kesedihan, dari kelemahan dan kemalasan, dari sifat bakhil dan penakut, dan dari lilitan hutang dan penindasan) '. Aku selalu melayani (keperluan) beliau hingga kembali dari Khaibar, beliau kembali dengan membawa (mengiring) Shafiyah binti Huyai. Dan aku lihat beliau menutupinya dengan kain kemudian memboncengkannya di belakang beliau. Sehingga ketika kami tiba di daerah Shahba`, beliau membuat hais dalam bejana dari kulit, kemudian beliau menyuruh agar aku mengundang para sahabat. Lalu mereka menyantap hidangan tersebut, maka itulah awal rumah tangga beliau dengannya. Kemudian beliau melanjutkan perjalanan, hingga ketika tiba di gunung Uhud, beliau bersabda: 'Ini adalah gunung yang kita mencintainya dan dia mencintai kita.' Ketika memasuki kota Madinah beliau mengatakan: 'Ya Allah, sesungguhnya aku mengharamkan apa yang ada di antara dua gunungnya (Madinah), sebagaimana Ibrahim mengharamkan (mensucikan) Makkah. Ya Allah, berkahilah mereka dalam mud dan sha' mereka",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5426,
			"arabicnumber": 5426,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] berkata; telah menceritakan kepada kami [Saif bin Abu Sulaiman] ia berkata; aku mendengar [Mujahid] berkata; telah menceritakan kepadaku ['Abdurrahman bin Abu Laila] bahwasanya mereka sedang berada di sisi [Hudzaifah], lalu ia (Hudzaifah) minta minum lantas seorang Majusi memberinya minum. Ketika Majusi tersebut meletakkan gelas pada tangannya, Hudzaifah langsung membuangnya seraya berkata; \"Kalau bukan karena aku telah melarang sekali atau dua kali, \" seakan ia mengatakan; 'Aku tidak akan melakukan ini (membuang gelas). Sungguh, aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: 'Janganlah kalian memakai sutera atau Dibaj (kain bersulam sutera), jangan minum dari bejana emas dan perak, dan jangan makan di baskom mereka, sesungguhnya barang-barang itu adalah untuk mereka di dunia dan untuk kita di akhirat kelak",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5427,
			"arabicnumber": 5427,
			"text": "Telah menceritakan kepada kami [Qutaibah] berkata; telah menceritakan kepada kami [Abu Awanah] dari [Qatadah] dari [Anas] dari [Abu Musa Al Asy'ari] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Perumpamaan seorang Mukmin yang suka membaca Al Qur'an seperti buah Utrujah, baunya harum dan rasanya enak. Perumpamaan seorang Mukmin yang tidak suka membaca Al Qur'an seperti buah kurma, tidak berbau namun rasanya manis. Perumpamaan seorang Munafik yang suka membaca Al Qur'an seperti buah raihanah, baunya harum tapi rasanya pahit. Dan Perumpamaan seorang Munafik yang tidak suka membaca Al Qur'an seperti buah hanzhalah, tidak berbau dan rasanya pahit",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5428,
			"arabicnumber": 5428,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata; telah menceritakan kepada kami [Khalid] berkata; telah menceritakan kepada kami [Abdullah bin 'Abdurrahman] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Kelebihan Aisyah dibanding dengan semua wanita, seperti kelebihan bubur atas semua makanan",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5429,
			"arabicnumber": 5429,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] berkata; telah menceritakan kepada kami [Malik] dari [Sumayy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Safar itu separuh dari siksaan, seseorang dari kalian akan terhalang untuk tidur dan makan. Jika telah selesai dari keperluannya, hendaklah ia segera kembali pada keluarganya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5430,
			"arabicnumber": 5430,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata; telah menceritakan kepada kami [Ismail bin Ja'far] dari [Rabi'ah] bahwasanya ia mendengar [Al Qasim bin Muhammad] berkata; \"Pada diri Barirah ada tiga sifat yang Aisyah ingin membeli lalu memerdekakannya. Keluarganya lalu berkata; 'Tetapi perwaliannya tetap untuk kami.' Maka [Aisyah] pun melaporkan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, beliau lalu bersabda: 'Jika mau, kamu bisa membuat persyaratan bagi mereka. Sesungguhnya perwalian itu adalah bagi orang yang memerdekakannya.' Al Qasim berkata; 'Kemudian Barirah dimerdekakan dan diberi pilihan untuk kembali kepada suaminya atau berpisah. Suatu ketika Rasulullah shallallahu 'alaihi wasallam masuk ke dalam rumah Aisyah, sementara di atas tungku ada periuk yang sedang mendidih. Beliau kemudian minta untuk disiapkan makanan pagi. Maka beliau pun diberi hidangan roti dan makanan pendampingnya (semacam kuah), lalu beliau pun bersabda: 'Sepertinya aku melihat daging? ' Mereka (yang ada di rumah) menjawab; 'Benar, wahai Rasulullah. Tetapi itu adalah daging yang disedekahkah kepada Barirah, lalu olehnya diberikan kepada kita! ' Beliau lantas bersabda: 'Daging itu bagi Barirah adalah sedekah, sedangkan untuk kita adalah hadiah",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5431,
			"arabicnumber": 5431,
			"text": "Telah menceritakan kepadaku [Ishaq bin Ibrahim Al Hanzhali] dari [Abu Usamah] dari [Hisyam] ia berkata; telah mengabarkan kepadaku [Bapakku] dari [Aisyah] radliallahu 'anha, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam menyukai manisan dan madu",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5432,
			"arabicnumber": 5432,
			"text": "Telah menceritakan kepada kami ['Abdurrahman bin Syaibah] ia berkata; telah mengabarkan kepadaku [Ibnu Abu Al Fudaik] dari [Ibnu Dzi'b] dari [Al Maqburi] dari [Abu Hurairah] ia berkata; \"Aku selalu menemani Nabi shallallahu 'alaihi wasallam dalam keadaan perut kenyang (merasa kenyang meskipun lapar, pent), sehingga aku tidak dapat makan roti, tidak bisa mengenakan kain sutera dan tidak memiliki pelayan yang bisa membantuku. Bahkan aku mengganjal perutku dengan kerikil, dan aku minta orang lain agar aku bisa membacakan ayat kepadanya sehingga ia bisa memberiku sesuatu yang aku makan. Dan sebaik-baik manusia bagi orang miskin adalah Ja'far bin Abu Thalib, ia pulang ke rumah dengan mengajak kami lalu memberi kami makan dengan apa yang ada di dalam rumahnya. Sampai-sampai ia mengeluarkan 'Ukkah (tempat air terbuat dari kulit) yang sudah tidak ada isinya lagi, kami lalu membelah dan menjilati apa yang ada di dalamnya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5433,
			"arabicnumber": 5433,
			"text": "Telah menceritakan kepada kami [Amru bin Ali] berkata; telah menceritakan kepada kami [Azhar bin Sa'd] dari [Ibnu Aun] dari [Tsumamah bin Anas] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam mendatangi seorang penjahit pernah menjadi budaknya. Beliau lalu diberi buah labu yang kemudian memakannya, maka aku selalu menyukainya semenjak aku melihat beliau memakannya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5434,
			"arabicnumber": 5434,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yusuf] berkata; telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Abu Wail] dari [Abu Mas'ud Al Anshari] ia berkata; \"Ada seorang laki-laki yang bernama Abu Syu'aib dari kalangan Anshar, ia mempunyai seorang budak yang pandai memasak daging, ia lalu berkata kepada budaknya; 'Buatlah makanan dengan lima porsi, aku ingin mengundang Rasulullah shallallahu 'alaihi wasallam.' Ia lalu mengundang Rasulullah shallallahu 'alaihi wasallam dengan sejumlah lima porsi tersebut. Lalu ada seorang laki-laki yang mengikuti beliau, maka Nabi shallallahu 'alaihi wasallam pun bersabda: 'Engkau mengundang kami dengan lima porsi, padahal ini ada seorang laki-laki (lain) yang ingin ikut. Sekarang terserah kamu, memberi izin atau tidak.' Abu Syu'aib menjawab; 'Aku memberinya izin.' Muhammad bin Yusuf berkata; Aku mendengar Muhammad bin Ismail berkata; 'Jika suatu kaum berada dalam suatu meja makan, maka mereka tidak memindahkannya ke meja makan yang lainnya. Namun, sebagian mereka mengambilkan untuk sebagian yang lain dalam satu meja tersebut, atau mereka tidak mengambilnya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5435,
			"arabicnumber": 5435,
			"text": "Telah menceritakan kepadaku [Abdullah bin Munir]; ia mendengar [An Nadlr]; telah mengabarkan kepada kami [Ibnu Aun] ia berkata; telah mengabarkan kepadaku [Tsumamah bin Abdullah bin Anas] dari [Anas] radliallahu 'anhu, ia berkata; \"Aku berjalan bersama Rasulullah shallallahu 'alaihi wasallam, padahal aku masih seorang bocah. Beliau lalu menemui budaknya yang tukang jahit, budak itu kemudian menghidangkan kepada beliau makanan dalam sebuah bejana yang di antaranya adalah buah labu. Beliau lalu memilih-milih buah tersebut (untuk dimakan).\" Anas berkata, \"Ketika aku melihat beliau seperti itu, maka aku pun mengambil dan meletakkannya di hadapannya. Sementara budak tersebut kembali mengerjakan pekerjaannya.\" Anas berkata, \"Maka aku sangat menyukai buah labu semenjak aku melihat Rasulullah shallallahu 'alaihi wasallam melakukan hal tersebut",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5436,
			"arabicnumber": 5436,
			"text": "Telah menceritakan kepada kami [Abdullah bin Salamah] dari [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] Bahwasanya ia mendengar [Anas bin Malik] berkata, \"Seorang tukang jahit mengundang Nabi shallallahu 'alaihi wasallam untuk menghadiri jamuan yang ia masak. Aku lalu pergi bersama Nabi shallallahu 'alaihi wasallam memenuhi undangan tersebut, penjahit itu lalu menyodorkan roti gandum dan kuah yang di dalamnya ada labu dan daging yang telah dikeringkan. Aku melihat Nabi shallallahu 'alaihi wasallam memilih-milih buah labu di dalam bejana tersebut, maka setelah hari itu aku sangat menyukai buah labu",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5437,
			"arabicnumber": 5437,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Malik bin Anas] dari [Ishaq bin Abdullah] dari [Anas] radliallahu 'anhu, ia berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam diberi hidangan kuah yang di dalamnya ada buah labu dan daging yang telah dikeringkan, dan aku lihat beliau memilih-milih buah labu lalu memakannya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5438,
			"arabicnumber": 5438,
			"text": "Telah menceritakan kepada kami [Qabishah] berkata, telah menceritakan kepada kami [Sufyan] dari ['Abdurrahman bin Abis] dari [Bapaknya] dari [Aisyah] radliallahu 'anhuma, ia berkata, \"Beliau tidak pernah melakukannya kecuali di saat paceklik yang manusia semuanya dalam keadaan lapar, beliau ingin orang kaya memberi makan kepada yang miskin. Dan sungguh, kami memakan kaki kambing setelah lima belas hari, dan keluarga Muhammad shallallahu 'alaihi wasallam tidak pernah merasa kenyang dengan roti gandum berkuah selama tiga hari terturut-turut",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5439,
			"arabicnumber": 5439,
			"text": "Telah menceritakan kepada kami [Ismail] ia berkata; telah menceritakan kepadaku [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] Bahwasanya ia mendengar [Anas bin Malik] berkata, \"Seorang tukang jahit mengundang Rasulullah shallallahu 'alaihi wasallam menghadiri jamuan makan yang ia buat. Aku lalu berangkat bersama Nabi shallallahu 'alaihi wasallam memenuhi undangan tersebut. Penjahit itu kemudian menyodorkan roti gandum dan kuah yang di dalamnya terdapat buah labu dan daging yang telah dikeringkan kepada Rasulullah shallallahu 'alaihi wasallam.\" Anas berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam memilih-milih buah labu dalam bejana tersebut, maka aku selalu menyukai labu setelah hari itu.\" [Tsumamah] menyebutkan dari [Anas], \"Aku lalu mengumpulkan buah labu ke hadapan beliau",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5440,
			"arabicnumber": 5440,
			"text": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah] ia berkata; telah menceritakan kepadaku [Ibrahim bin Sa'd] dari [Bapaknya] dari [Abdullah bin Ja'far bin Abu Thalib] radliallahu 'anhuma, ia berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam makan buah kurma segar dengan qitsa` (semacam mentimun)",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5441,
			"arabicnumber": 5441,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Abbas Al Jurairi] dari [Abu Utsman] ia berkata, \"Aku bertamu ke rumah [Abu Hurairah] selama tujuh hari. Dia bersama istri dan pembantunya membagi malam menjadi tiga bagian, shalat di sebagian waktu dan tidur di sebagian waktu. Dan aku mendengar ia berkata, \"Rasulullah shallallahu 'alaihi wasallam membagi-bagikan kurma kepada para sahabatnya, aku lalu mendapat bagian tujuh butir yang satu diantaranya sudah rusak (busuk)",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5442,
			"arabicnumber": 5442,
			"text": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah menceritakan kepada kami [Ismail bin Zakaria] dari [Ashim] dari [Abu Utsman] dari [Abu Hurairah] radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam membagi-bagikan kurma kepada kami, lalu aku mendapat bagian lima biji, empat masih dalam keadaan bagus dan satu telah rusak. Maka, satu biji itulah yang membuat gigiku susah untuk mengunyahnya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5443,
			"arabicnumber": 5443,
			"text": "Telah menceritakan kepada kami [Sa'id bin Abu Maryam] berkata, telah menceritakan kepada kami [Abu Ghassan] ia berkata; telah menceritakan kepadaku [Abu Hazim] dari [Ibrahim bin 'Abdurrahman bin Abdullah bin Abu Rabi'ah] dari [Jabir bin Abdullah] radliallahu 'anhuma, ia berkata, \"Di Madinah ada seorang Yahudi yang meminjamiku setandan kurma-dan Jabir sendiri memiliki kebun yang ada di jalan menuju Ruumah (nama tempat), namun tidak berbuah selama setahun-, orang Yahudi itu kemudian datang kepadaku meminta pembayaran kurma, namun aku tidak mendapatkannya. Maka aku minta tenggang waktu hingga tahun mendatang tetapi ia menolak. Maka aku mengabarkan hal itu kepada Nabi shallallahu 'alaihi wasallam, beliau lalu bersabda kepada para sahabatnya: \"Berjalanlah. Kita minta penangguhan kepada Yahudi itu untuk Jabir.\" Mereka kemudian mendatangiku di kebun milikku, beliau lalu berbicara dengan Yahudi tersebut hingga Yahudi itu pun berkata, \"Wahai Abul Qasim, aku tidak akan memberinya tenggang waktu.\" Ketika Nabi shallallahu 'alaihi wasallam melihat hal itu, beliau lalu bangkit dan mengelilingi kebun kurma tersebut, kemudian beliau mendatangi Yahudi itu dan bernegosisasi, namun Yahudi itu tetap tidak mau (memberi penangguhan). Aku lalu berdiri dan membawakan sedikit kurma dan meletakkan di depan Nabi shallallahu 'alaihi wasallam, lalu beliau pun memakannya. Setelah itu beliau bersabda: \"Wahai Jabir, dimana tenda tempat kamu berteduh?\" Aku lalu mengabarkannya. Beliau berkata lagi: \"Siapkanlah untukku.\" Maka aku pun menyiapkan tenda tersebut untuk beliau, beliau kemudian masuk dan tidur. Setelah bangun, aku kembali menemui beliau dengan membawa segenggam kurma, beliau lalu memakannya. Kemudian beliau berdiri dan bernegoisasi dengan orang Yahudi tersebut namun ia tetap menolak. Kemudian beliau kembali mengelilingi kebun kurma tersebut dan berkata: \"Wahai Jabir, goyangkanlah (pohon kurma) dan gantilah untuknya.\" Aku lalu menghampiri batang kurma dan menggoyangnya dan mengambil sesuatu yang akan aku gunakan untuk menggantinya. Dan ternyata lebih, aku lalu keluar dan menemui Nabi shallallahu 'alaihi wasallam untuk mengabarkan kepadanya. Beliau lalu bersabda: \"Sesungguhnya aku bersaksi bahwa aku adalah utusan Allah. lafazh 'Urusy dan 'Arisy bisa berarti sebuah bangunan. Ibnu Abbas berkata mengenai firman Allah: MA'RUSYAAT, (Al An'am: 141): apa saja yang bisa menaungi dari pepohonan",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5444,
			"arabicnumber": 5444,
			"text": "Telah menceritakan kepada kami [Umar bin Hafsh bin Ghiyats] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Al A'masy] ia berkata; telah menceritakan kepadaku [Mujahid] dari [Abdullah bin Umar] radliallahu 'anhuma, ia berkata, \"Ketika kami sedang duduk di sisi Nabi shallallahu 'alaihi wasallam, lalu dihidangkanlah kurma yang sudah kering. Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Sesungguhnya di antara pepohonan itu ada satu jenis pohon yang keberkahannya seperti seorang Muslim.\" Lalu aku mempunyai perkiraan bahwa pohon itu adalah pohon kurma, aku berkeinginan menjawab; 'Wahai Rasulullah, itu adalah pohon kurma', namun aku melihat bahwa di antara sepuluh orang yang ada aku adalah yang paling muda. Maka aku pun diam. Nabi shallallahu 'alaihi wasallam kemudian bersabda: \"Yaitu pohon kurma",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5445,
			"arabicnumber": 5445,
			"text": "Telah menceritakan kepada kami [Jum'ah bin Abdullah] berkata, telah menceritakan kepada kami [Marwan] berkata, telah mengabarkan kepada kami [Hasyim bin Hasyim] berkata, telah mengabarkan kepada kami [Amir bin Sa'd] dari [Bapaknya] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa setiap pagi mengkonsumsi tujuh butir kurma 'Ajwah, maka pada hari itu ia akan terhindar dari racun dan sihir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5446,
			"arabicnumber": 5446,
			"text": "Telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepada kami [Jabalah bin Suhaim] ia berkata, \"Kami mengalami kesulitan (paceklik) bersama Ibnu Zubair, Abdullah bin Umar lalu memberikan kami kurma. Saat kami makan [Abdullah bin Umar] lewat di hadapan kami, maka ia pun berkata; \"Janganlah kalian berserikat (menggabungkan kurma saat makan). Sesungguhnya Nabi shallallahu 'alaihi wasallam melarang untuk berserikat.\" Kemudian ia mengatakan lagi, \"Kecuali jika ia minta izin kepada temannya.\" Syu'bah berkata, \"Lafadz 'izin' ini adalah ucapan Ibnu Umar",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5447,
			"arabicnumber": 5447,
			"text": "Telah menceritakan kepadaku [Isma'il bin Abdullah] ia berkata; telah menceritakan kepadaku [Ibrahim bin Sa'd] dari [Bapaknya] ia berkata, \"Aku mendengar [Abdullah bin Ja'far] berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam makan kurma segar dengan qitsa` (sejenis mentimun)",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5448,
			"arabicnumber": 5448,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Muhammad bin Thalhah] dari [Zubaid] dari [Mujahid] ia berkata, \"Aku mendengar [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya di antara jenis pohon ada yang seperti seorang Muslim (keberkahannya), yaitu pohon kurma",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5449,
			"arabicnumber": 5449,
			"text": "Telah menceritakan kepada kami [Ibnu Muqatil] berkata, telah mengabarkan kepada kami [Abdullah] berkata, telah mengabarkan kepada kami [Ibrahim bin Sa'd] dari [Bapaknya] dari [Abdullah bin Ja'far] radliallahu 'anhuma, ia berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam makan kurma segar dengan qitsa` (sejenis mentimun)",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5450,
			"arabicnumber": 5450,
			"text": "Telah menceritakan kepada kami [Ash Shalt bin Muhammad] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Al Ja'd Abu Utsman] dari [Anas]. (dalam jalur lain disebutkan) dan dari [Hisyam] dari [Muhammad] dari [Anas] dari [Sinan Abu Rabi'ah] dari [Anas] bahwa Ummu Sulaim, ibunya, membuat makanan dengan satu mud gandum dan membuatnya semacam adonan, lalu ia memerah susu satu bejana (kecil dari kulit). Kemudian ia menyuruhku menemui Nabi shallallahu 'alaihi wasallam, aku lalu mendatangi beliau yang saat itu sedang bersama para sahabatnya. Kemudian aku mengundangnya. Beliau bertanya: \"Bersama semua (orang) yang bersamaku ini?\" aku lalu kembali dan menyampaikan, \"Sesungguhnya beliau mengatakan 'Bersama semua orang yang bersamaku? ' Abu Thalhah kemudian keluar menemui Rasulullah, ia berkata, \"Wahai Rasulullah, itu hanyalah sesuatu (makanan ala kadarnya) yang dibuat oleh Ummu Sulaim.\" Beliau lalu masuk dan makanan tersebut dibawa ke hadapan beliau, lalu beliau bersabda: \"Suruhlah sepuluh orang untuk masuk bersamaku.\" Mereka lalu masuk dan makan hingga kenyang. Beliau lalu bersabda lagi: \"Suruhlah sepuluh orang untuk masuk bersamaku.\" Mereka lalu masuk dan makan hingga kenyang. Beliau bersabda lagi: \"Suruhlah sepuluh orang untuk masuk bersamaku.\" Sehingga jumlah mereka mencapai empat puluh orang. Nabi shallallahu 'alaihi wasallam kemudian makan dan setelah itu beliau pergi. Maka aku pun melihat, tapi kenapa tidak ada yang berkurang darinya sedikitpun",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5451,
			"arabicnumber": 5451,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abdul Warits] dari [Abdul Aziz] ia berkata; Ditanyakan kepada [Anas], \"Apakah kamu pernah mendengar Nabi shallallahu 'alaihi wasallam menyebutkan tentang buah bawang?\" Beliau mengatakan: \"Barangsiapa memakannya, maka jangan sekali-kali ia mendekati tempat shalat kami",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5452,
			"arabicnumber": 5452,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] berkata, telah menceritakan kepada kami [Abu Shafwan Abdullah bin Sa'id] berkata, telah mengabarkan kepada kami [Yunus] dari [Ibnu Syihab] ia berkata; telah menceritakan kepadaku [Atha] bahwa [Jabir bin Abdullah] radliallahu 'anhuma menyakini dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa makan bawang merah atau bawang putih, hendaklah ia menjauhi kami, atau beliau mengatakan, \"Hendaklah ia menjauhi tempat shalat kami",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5453,
			"arabicnumber": 5453,
			"text": "Telah menceritakan kepada kami [Sa'id bin Ufair] berkata, telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] ia berkata; telah mengabarkan kepadaku [Abu Salamah] ia berkata; telah mengabarkan kepadaku [Jabir bin Abdullah] ia berkata, \"Kami pernah bersama Rasulullah shallallahu 'alaihi wasallam di Marru Azh Zhahran memetik biji pohon Arok (pohon siwak), beliau lalu bersabda: \"Hendaklah kalian mengambil biji hitam buah itu, sebab ia sangat bagus.\" Jabir lalu bertanya; \"Apakah engkau mengembala kambing?\" Beliau menjawab: \"Ya. Tidak ada seorang Nabi kecuali ia mengembala",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5454,
			"arabicnumber": 5454,
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5455,
			"arabicnumber": 5455,
			"text": "Telah menceritakan kepada kami [Ali] berkata, telah menceritakan kepada kami [Sufyan] aku mendengar [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Suwaid bin An Nu'man] ia berkata, \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam menuju Khaibar, ketika sampai di Shahba`, beliau minta disiapkan makanan. Dan beliau tidak diberi kecuali hanya sawiq (tepung gandum yang dicampur dengan air), kami lalu memakannya. Beliau kemudian berdiri untuk melaksanakan shalat, beliau berkumur lalu kami pun ikut berkumur.\" Yahya berkata; Aku mendengar Busyair berkata; telah menceritakan kepada kami Suwaid berkata, \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam menuju Khaibar, ketika kami sampai di Shahba` -Yahya berkata; jaraknya dengan Khaibar hanya beberapa mil-, beliau minta untuk disiapkan makanan. Dan beliau tidak diberi hidangan kecuali hanya sawiq, kami lalu makan bersama beliau. Kemudian beliau minta diambilkan air, beliau lalu berkumur dan kami pun mengikutinya berkumur, kemudian beliau mengimami kami shalat Maghrib dan tidak berwudlu lagi.\" Sufyan berkata, \"Sepertinya kamu mendengarnya dari Yahya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5456,
			"arabicnumber": 5456,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] berkata, telah menceritakan kepada kami [Sufyan] dari [Amru bin Dinar] dari [Atha] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian makan, maka janganlah ia mengelap tangannya hingga ia menjilatinya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5457,
			"arabicnumber": 5457,
			"text": "Telah menceritakan kepada kami [Ibrahim Ibnul Mundzir] berkata; telah menceritakan kepadaku [Muhammad bin Fulaih] berkata; telah menceritakan kepadaku [Bapakku] dari [Sa'id Ibnul Harits] dari [Jabir bin Abdullah] radliallahu 'anhuma, Bahwasanya ia bertanya kepadanya tentang wudlu karena memakan sesuatu yang terkena api (dibakar). Ia menjawab, \"Tidak. Pada masa Nabi shallallahu 'alaihi wasallam kami tidak menemui makanan seperti itu kecuali sedikit. Jika kami mendapatkannya (makan) dan tidak memiliki sapu tangan untuk mengelap telapak tangan, betis dan telapak kaki, maka kami shalat dan tidak berwudlu lagi",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5458,
			"arabicnumber": 5458,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Sufyan] dari [Tsaur] dari [Khalid] dari [Abu Umamah] bahwa Nabi shallallahu 'alaihi wasallam jika mengangkat lambungnya (selesai makan), beliau membaca: 'ALHAMDULILLAHI KATSIIRAN THAYYIBAN MUBAARAKAN FIIHI GHAIRA MAKFIYIN WA LAA MUWADDA'IN WA LAA MUSTAGHNAN 'ANHU RABBANAA (Segala puji bagi Allah dengan pujian yang banyak, yang baik dan yang mengandung keberkahan di dalamnya, bukan pujian yang tidak dianggap dan tidak dibutuhkan oleh Tuhan)",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5459,
			"arabicnumber": 5459,
			"text": "Telah menceritakan kepada kami [Abu Ashim] dari [Tsaur bin Yazid] dari [Khalid bin Ma'dan] dari [Abu Umamah] bahwa Nabi shallallahu 'alaihi wasallam jika selesai dari makan, sekali waktu dengan lafadz, 'jika mengangkat lambungnya, beliau mengucapkan: \"ALHAMDULILLAHILADZII KAFAANAA WA ARWAANAA GHAIRA MAKFIYIN WA LAA MAKFUURIN (Segala puji hanya milik Allah yang telah memberi kecukupan kami dan menghilangkan rasa haus, bukan nikmat yang tidak dianggap atau dikufuri) ', dilain waktu dengan lafadz, 'ALHAMDULILLAHI RABBINAA GHAIRA MAKFIYIN WA LAA MUWADDA'IN WA LAA MUSTAGHNAN RABBANAA (Segala puji hanya milik Allah Rabb kami, bukan pujian yang tidak dianggap dan tidak dibutuhkan oleh tuhan)",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 5460,
			"arabicnumber": 5460,
			"text": "Telah menceritakan kepada kami [Hafsh bin Umar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Muhammad] -yaitu Ibnu Ziyad- berkata; Aku mendengar [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika budak salah seorang dari kalian datang kepadanya dengan membawa makanan, jika ia tidak mengajaknya duduk bersama, hendaklah ia mengambilkan untuknya satu atau dua asupan, atau satu atau dua suapan. Sebab ia telah merasakan rasa lelah dan capeknya",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5461,
			"arabicnumber": 5461,
			"text": "Telah menceritakan kepada kami [Abdullah bin Abul Aswad] berkata, telah menceritakan kepada kami [Abu Usamah] berkata, telah menceritakan kepada kami [Al A'masy] berkata, telah menceritakan kepada kami [Syaqiq] berkata, telah menceritakan kepada kami [Abu Mas'ud Al Anshari] ia berkata, \"Seorang laki-laki Anshar bernama Abu Syu'aib memiliki seorang budak laki-laki yang pandai memasak daging, suatu ketika ia datang menemui Nabi shallallahu 'alaihi wasallam yang saat itu sedang bersama para sahabatnya. Ia melihat pada wajah Nabi shallallahu 'alaihi wasallam tanda kelaparan, maka ia segera menemui budak laki-lakinya seraya berkata, \"Buatlah makanan untukku yang cukup untuk lima orang, sebab aku ingin mengundang Nabi shallallahu 'alaihi wasallam dengan makanan yang cukup untuk lima orang.\" Budak tersebut kemudian membuat sedikit makanan, maka laki-laki Anshar itu mengundang Rasulullah. Beliau lalu datang dengan diikuti oleh seorang laki-laki (selain dari lima orang yang telah disiapkan makanan untuknya), Nabi shallallahu 'alaihi wasallam lantas bersabda: \"Wahai Abu Syu'aib, ada seorang laki-laki yang ikut kami, jika kamu mau kamu boleh memberinya izin, jika tidak maka kamu boleh meninggalkannya?\" Abu Syu'aib menjawab, \"Tidak, bahkan aku telah memberinya izin",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5462,
			"arabicnumber": 5462,
			"text": "Telah menceritakan kepada kami [Abul Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri], dan [Laits] berkata, telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata; telah mengabarkan kepadaku [Ja'far bin Amru bin Umayyah] bahwa bapaknya [Amru bin Umayyah] mengabarkan kepadanya, Bahwasanya ia melihat Rasulullah shallallahu 'alaihi wasallam memotong-motong daging lengan kambing yang ada di tangannya, ketika panggilan shalat diserukan, beliau meletakkan lengan kambing dan pisau yang beliau gunakan untuk memotong-motong. Beliau kemudian berdiri melaksanakan shalat dan tidak berwudlu lagi",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5463,
			"arabicnumber": 5463,
			"text": "Telah menceritakan kepada kami [Mu'alla bin Asad] berkata, telah menceritakan kepada kami [Wuhaib] dari [Ayyub] dari [Abu Qilabah] dari [Anas bin Malik] radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika makan malam telah tersedia dan iqamat dikumandangkan, maka dahulukanlah makan malam.\" Dan dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti ini.\" Dan dari Ayyub dari Nafi' dari Ibnu Umar bahwa suatu kali ia pernah makan malam sementara ia mendengar suara bacaan Imam",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5464,
			"arabicnumber": 5464,
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5465,
			"arabicnumber": 5465,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yusus] berkata, telah menceritakan kepada kami [Sufyan] dari [Hisyam bin Urwah] dari [Bapaknya] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika iqamah telah dikumandangkan, sementara makan malam telah tersaji, maka hendaklah kalian mulai dengan makan malam.\" [Wuhaib] dan [Yahya bin Sa'id] dari [Hisyam] menyebutkan, \"Jika makan malam telah terhidang",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5466,
			"arabicnumber": 5466,
			"text": "Telah menceritakan kepadaku [Abdullah bin Muhammad] berkata, telah menceritakan kepada kami [Ya'qub bin Ibrahim] ia berkata; telah menceritakan kepadaku [Bapakku] dari [Shalih] dari [Ibnu Syihab] bahwa [Anas] berkata, \"Aku adalah orang yang paling paham dengan hijab, Ubai bin Ka'b pernah menanyakannya kepadaku. Rasulullah shallallahu 'alaihi wasallam menjadi pengantin dengan Zainab binti Jahsy, beliau menikahinya di Madinah. Beliau lalu mengundang para sahabat untuk menghadiri jamuan makan setelah siang hari. Rasulullah shallallahu 'alaihi wasallam kemudian duduk bersama beberapa orang setelah orang-orang pergi. Rasulullah shallallahu 'alaihi wasallam lalu berjalan pergi dan aku mengikutinya, hingga beliau sampai di depan pintu kamar Aisyah. Beliau mengira bahwa para sahabat tersebut sudah pulang, maka aku pun mengikuti beliau keluar dan ternyata mereka masih duduk-duduk di tempat mereka. Beliau lantas kembali masuk ke dalam, dan aku tetap mengikuti untuk yang kedua kalinya, hingga ketika sampai di depan pintu kamar Aisyah, beliau kembali keluar, dan aku tetap mengikutinya. Dan ternyata mereka semua telah pergi, kemudian beliau memasang hijab antara aku dengannya, lalu turunlah ayat hijab",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 95
			}
		}
	]
}