{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"71": "Sacrifice on Occasion of Birth (`Aqiqa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5467,
			"arabicnumber": 5467,
			"text": "Telah menceritakan kepadaku [Ishaq bin Nashr] berkata, telah menceritakan kepada kami [Abu Usamah] ia berkata; telah menceritakan kepadaku [Buraid] dari [Abu Burdah] dari [Abu Musa] radliallahu 'anhu, ia berkata, \"Anak laki-lakiku lahir, kemudian aku membawanya kepada Nabi shallallahu 'alaihi wasallam. Beliau lalu memberinya nama Ibrahim, beliau menyuapinya dengan kunyahan kurma dan mendoakannya dengan keberkahan, setelah itu menyerahkannya kepadaku.\" Ibrahim adalah anak tertua Abu Musa",
			"grades": [],
			"reference": {
				"book": 71,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5468,
			"arabicnumber": 5468,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Hisyam] dari [Bapaknya] dari [Aisyah] radliallahu 'anhuma, ia berkata, \"Seorang bayi dibawa ke hadapan Nabi shallallahu 'alaihi wasallam yang kemudian beliau suapi dengan kunyahan buah kurma, ketika bayi itu kencing, beliau memercikinya dengan air",
			"grades": [],
			"reference": {
				"book": 71,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5469,
			"arabicnumber": 5469,
			"text": "Telah menceritakan kepada kami [Ishaq bin Nashr] berkata, telah menceritakan kepada kami [Abu Usamah] berkata, telah menceritakan kepada kami [Hisyam bin Urwah] dari [Bapaknya] dari [Asma binti Abu Bakar] radliallahu 'anhuma, Bahwasanya di Makkah ia hamil karena hubungannya dengan Abdullah bin Zubair (suaminya). Ia berkata, \"Aku lalu keluar menuju Madinah, ketika sampai di Quba, aku singgah dan melahirkan di sana. Aku lalu membawa bayiku menemui Rasulullah shallallahu 'alaihi wasallam dan aku letakkan di pangkuannya. Kemudian Beliau minta diambilkan buah kurma, lalu mengunyahnya untuk kemudian meludahkannya ke dalam bayiku. Maka pertama kali yang masuk ke dalam perutnya adalah ludah Rasulullah shallallahu 'alaihi wasallam. Beliau memberi kunyahan kurma dan mendoakan keberkahan kepadanya. Dia adalah bayi pertama yang lahir dalam Islam. Orang-orang pun bangga, sebab telah dikatakan kepada mereka 'sesungguhnya orang-orang Yahudi telah menyihir kalian, sehingga kalian tidak akan memiliki anak",
			"grades": [],
			"reference": {
				"book": 71,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5470,
			"arabicnumber": 5470,
			"text": "Telah menceritakan kepada kami [Mathar Ibnul Fadll] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Abdullah bin Aun] dari [Anas bin Sirin] dari [Anas bin Malik] radliallahu 'anhu, ia berkata, \"Anak Abu Thalhah sedang sakit, ketika Abu Thalhah keluar anaknya meninggal. Dan ketika Abu Thalhah kembali ia bertanya, \"Bagaimana keadaan anakku?\" Ummu Sulaim menjawab, \"Dia lebih tenang dari sebelumnya.\" Ummu Sulaim kemudian menyuguhkan makan malam, maka Abu Thalhah pun makan malam kemudian bersetubuh dengannya. Setelah selesai (dari jima') Ummu Sulaim berkata, \"Anakmu telah dikuburkan.\" Maka diwaktu pagi, Abu Thalhah mendatangi Rasulullah shallallahu 'alaihi wasallam dan mengabarkan kejadian tersebut. Beliau bertanya: \"Kalian tadi malam menjadi pengantin?\" Abu Thalhah menjawab, \"Ya.\" Beliau pun berdoa: \"Ya Allah, berkahilah keduanya.\" Ummu Sulaim kemudian melahirkan seorang anak, lalu Abu Thalhah berkata kepadaku, \"Jagalah ia hingga engkau bawa ke hadapan Nabi shallallahu 'alaihi wasallam.\" Anas kemudian membawa bayi tersebut kepada Nabi shallallahu 'alaihi wasallam, dan Ummu Sulaim membekalinya dengan beberapa kurma. Nabi shallallahu 'alaihi wasallam kemudian meraih bayi Abu Thalhah, beliau lalu bertanya: \"Apakah ia (Anas) membawa sesuatu?\" para sahabat menjawab, \"Ya. Beberapa butir kurma.\" Nabi shallallahu 'alaihi wasallam kemudian mengambil kurma dan menguyahnya, kemudian beliau ambil kunyahan dari mulutnya dan memasukkannya ke dalam mulut sang bayi, baru setelah itu memberinya nama Abdullah.\" Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Ibnu Abu Ady] dari [Ibnu Aun] dari [Muhammad] dari [Anas] lalu ia menyebutkan hadits tersebut",
			"grades": [],
			"reference": {
				"book": 71,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5471,
			"arabicnumber": 5471,
			"grades": [],
			"reference": {
				"book": 71,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5472,
			"arabicnumber": 5472,
			"grades": [],
			"reference": {
				"book": 71,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5473,
			"arabicnumber": 5473,
			"text": "Telah menceritakan kepada kami [Abdan] berkata, telah menceritakan kepada kami [Abdullah] berkata, telah mengabarkan kepada kami [Ma'mar] berkata, telah mengabarkan kepada kami [Az Zuhri] dari [Ibnul Musayyab] dari [Abu Hurairah] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada Fara' dan Atirah. Fara' adalah anak pertama seekor unta yang mereka sembelih untuk sesembahan mereka, dan Atirah adalah hewan (kambing) yang mereka potong di bulan rajab",
			"grades": [],
			"reference": {
				"book": 71,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5474,
			"arabicnumber": 5474,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] berkata, telah menceritakan kepada kami [Sufyan] berkata; [Az Zuhri] telah menceritakan kepada kami dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada Fara' dan Atirah.\" Beliau lalu jelaskan: \"Fara' adalah anak pertama seekor unta yang mereka sembelih untuk sesembahan mereka, dan Atirah adalah hewan (kambing) yang mereka potong di bulan rajab",
			"grades": [],
			"reference": {
				"book": 71,
				"hadith": 9
			}
		}
	]
}