{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"75": "Patients"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5640,
			"arabicnumber": 5640,
			"text": "Telah menceritakan kepada kami [Abu Al Yaman Al Hakam bin Nafi'] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku ['Urwah bin Az Zubair] bahwa [Aisyah] radliallahu 'anha isteri Nabi shallallahu 'alaihi wasallam berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah suatu musibah yang menimpa seorang muslim bahkan duri yang melukainya sekalipun melainkan Allah akan menghapus (kesalahannya)",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5642,
			"arabicnumber": 5642,
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5643,
			"arabicnumber": 5643,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan] dari [Sa'd] dari [Abdullah bin Ka'b] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Permisalan seorang mukmin seperti dahan di suatu pohon, terkadang angin menjadikannya bengkok dan terkadang berdiri, lurus. Sebaliknya permisalan orang munafik seperti tanaman padi yang senantiasa berdiri, hingga sekali ia jatuh, ia akan langsung roboh.\" [Zakariya] mengatakan; telah menceritakan kepadaku [Sa'd] telah menceritakan kepada kami [Ibnu Ka'b] dari ayahnya [Ka'b] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5644,
			"arabicnumber": 5644,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Mundzir] dia berkata; telah menceritakan kepadaku [Muhammad bin Fulaih] dia berkata; telah menceritakan kepadaku [Ayahku] dari [Hilal bin Ali] penduduk dari Bani 'Amir bin Lu`ai, dari ['Atha` bin Yasar] dari [Abu Hurairah] radliallahu 'anhu dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Permisalan seorang mukmin seperti dahan di suatu pohon yang dapat bengkok ketika tertiaup angin dan apabila tertimpa musibah dia akan tetap tegak lurus, sedangkan permisalan orang fajir ibarat tanaman padi yang senantiasa tegak sehingga Allah akan merobohkannya kapan saja Dia kehendaki",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5645,
			"arabicnumber": 5645,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Muhammad bin Abdullah bin Abdurrahman bin Abu Sha'sha'ah] bahwa dia berkata, saya mendengar [Sa'id bin Yasar Abu Al Hubbab] berkata; saya mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di kehendaki Allah kebaikan, maka Dia akan mengujinya",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5646,
			"arabicnumber": 5646,
			"text": "Telah menceritakan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Bisyr bin Muhammad] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Syu'bah] dari [Al A'masy] dari [Abu Wa`il] dari [Masruq] dari [Aisyah] radliallahu 'anha dia berkata; \"Aku tidak pernah melihat seseorang yang lebih merasakan penderitaan ketika sakit dari Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5647,
			"arabicnumber": 5647,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim At Taimi] dari [Al Harits bin Suwaid] dari [Abdullah] radliallahu 'anhu; saya pernah menjenguk Nabi shallallahu 'alaihi wasallam ketika sakit, sepertinya beliau sedang merasakan rasa sakit, kataku selanjutnya; \"Sepertinya anda sedang merasakan rasa sakit yang amat berat, oleh karena itulah anda mendapatkan pahala dua kali lipat.\" Beliau menjawab: \"Benar, tidaklah seorang muslim yang tertimpa musibah melainkan Allah akan menggugurkan kesalahan-kesalahannya sebagaimana pohon menggugurkan dedaunannya",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5648,
			"arabicnumber": 5648,
			"text": "Telah menceritakan kepada kami ['Abdan] dari [Abu Hamzah] dari [Al A'masy] dari [Ibrahim At Taimi] dari [Al Harits bin Suwaid] dari [Abdullah] dia berkata; saya pernah menjenguk Rasulullah shallallahu 'alaihi wasallam ketika beliau sedang menderita sakit, lalu aku berkata; \"Wahai Rasulullah, sepertinya anda sedang merasakan sakit yang amat berat\" beliau bersabda: \"Benar, rasa sakit yang menimpaku ini sama seperti rasa sakit yang menimpa dua orang dari kalian.\" Kataku selanjutnya; \"Sebab itu anda mendapatkan pahala dua kali lipat.\" Beliau menjawab: \"Benar, seperti itulah, dan tidaklah seorang muslim yang tertimpa suatu musibah (penyakit) atau yang lain, melainkan Allah akan menghapuskan kesalahan-kesalahannya sebagaimana pohon menggugurkan dedaunannya",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5649,
			"arabicnumber": 5649,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abu 'Awanah] dari [Manshur] dari [Abu Wa`il] dari [Abu Musa Al Asy'ari] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berilah makan terhadap orang yang kelaparan, jenguklah orang sakit dan bebaskanlah tawanan",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5650,
			"arabicnumber": 5650,
			"text": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dia berkata; telah mengabarkan kepadaku [Asy'ats bin Sulaim] dia berkata; saya mendengar [Mu'awiyah bin Suwaid bin Muqarrin] dari [Al Barra` bin 'Azib] radliallahu 'anhuma dia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kami tujuh perkara dan melarang kami dari tujuh perkara, beliau melarang kami dari memakai cincin emas, mengenakan sutera, dibaj, istabraq (kain sejenis sutera), qasiy dan misarah (yaitu kain yang terbuat dari campuran sutera), dan memerintahkan kami untuk mengiringi jenazah, menjenguk orang sakit dan menebarkan salam",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5651,
			"arabicnumber": 5651,
			"text": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Sufyan] dari [Ibnu Al Munkadir] dia mendengar [Jabir bin Abdullah] radliallahu 'anhuma berkata; Aku pernah menderita sakit, lalu Nabi shallallahu 'alaihi wasallam dan Abu Bakar datang menjengukku dengan berjalan kaki, ketika beliau menemuiku ternyata aku sedang pingsan, maka beliau berwudlu' dan memercikkan sisa air wudlu'nya kepadaku, aku pun tersadar, ternyata Nabi shallallahu 'alaihi wasallam sudah berada di depanku, lalu aku berkata; \"Wahai Rasulullah, bagaimana caranya aku mengurus harta bendaku, bagaimana caranya aku memutuskan terhadap harta bendaku?\" beliau tetap tidak menjawab sampai turun ayat tentang harta warisan",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5652,
			"arabicnumber": 5652,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Imran bin Abu Bakar] dia berkata; telah menceritakan kepadaku ['Atha` bin Abu Rabah] dia berkata; [Ibnu Abbas] pernah berkata kepadaku; \"Maukah aku tunjukkan kepadamu seorang wanita dari penduduk surga?\" jawabku; \"Tentu.\" Dia berkata; \"Wanita berkulit hitam ini, dia pernah menemui Nabi shallallahu 'alaihi wasallam sambil berkata; \"Sesungguhnya aku menderita epilepsi dan auratku sering tersingkap (ketika sedang kambuh), maka berdoalah kepada Allah untukku.\" Beliau bersabda: \"Jika kamu berkenan, bersabarlah maka bagimu surga, dan jika kamu berkenan, maka aku akan berdoa kepada Allah agar Allah menyembuhkanmu.\" Ia berkata; \"Baiklah aku akan bersabar.\" Wanita itu berkata lagi; \"Namun berdoalah kepada Allah agar (auratku) tidak tersingkap.\" Maka beliau mendoakan untuknya.\" Telah menceritakan kepada kami Muhammad telah mengabarkan kepada kami Makhlad dari Ibnu Juraij telah mengabarkan kepadaku 'Atha' bahwa dia pernah melihat Ummu Zufar adalah wanita tersebut, ia adalah wanita berpawakan tinggi, berkulit hitam sedang berada di tirai Ka'bah",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5653,
			"arabicnumber": 5653,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah menceritakan kepada kami [Al Laits] dia berkata; telah menceritakan kepadaku [Ibnu Al Hadi] dari ['Amru] bekas budak Al Mutthalib, dari [Anas bin Malik] radliallahu 'anhu dia berkata; saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Allah berfirman; \"Apabila Aku menguji hamba-Ku dengan penyakit pada kedua matanya, kemudian ia mampu bersabar, maka Aku akan menggantinya dengan surga.\" maksud (habibataihi) adalah kedua matanya. Hadits ini juga diperkuat oleh riwayat [Asy'ats bin Jabir] dan [Abu Dzilal bin Hilal] dari [Anas] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5654,
			"arabicnumber": 5654,
			"text": "Telah menceritakan kepada kami [Qutaibah] dari [Malik] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah] dia berkata; \"Ketika Rasulullah shallaallahu'alaihi wa sallam sampai di Madinah, Abu Bakar dan Bilal menderita sakit. Lalu Aisyah menjenguk mereka berdua. Aku bertanya; \"Wahai ayahku, bagaimana keadaanmu? Dan engkau Bilal, bagaimana keadaanmu?\" Aisyah melanjutkan; Dan setiap kali Abu Bakar menderita sakit panas, maka dia akan berkata; \"Setiap orang bertanggung jawab terhadap keluarganya dan kematian itu lebih dekat dari pada tali sandalnya.\" Sedangkan jika Bilal menderita sakit demam, dia akan berkata; \"Alangkah baiknya syairku, apakah aku harus bermalam di suatu lembah sementara di sampingku terdapat orang-orang yang membanggakan lagi mulia. Apakah suatu hari mereka akan menginginkan airnya yang melimpah. Apakah sudah tampak olehku gunung Syamah dan Thafil?\" Aisyah berkata; Kemudian aku mendatangi Rasulullah shallaallahu'alaihi wa sallam dan mengabarkan keadaan mereka kepada beliau. Lalu beliau berdo'a: ALLAHUMMA HABBIB ILAINAA ALMADINAH KAHUBBINA MAKKATA AW ASYADDA ALLAHUMMA WA SHAHHIHHA WA BAARIK LANAA FI MUDDIHA WA SHAA'IHAA WANQUL HUMMAHA FAJ'ALHA BIL JUHFAH (Ya Allah, jadikanlah kecintaan kami kepada Madinah seperti kecintaan kami kepada Mekkah atau lebih. Ya Allah, perbaikilah ia, Berkahilah kami pada takaran mudnya dan sha'nya dan pindahkanlah wabah penyakitnya ke Juhfah)",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5655,
			"arabicnumber": 5655,
			"text": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Syu'bah] dia berkata; telah mengabarkan kepadaku ['Ashim] dia berkata; saya mendengar [Abu Utsman] dari [Usamah bin Zaid] radliallahu 'anhuma, seorang puteri Nabi shallallahu 'alaihi wasallam mengirim seorang utusan kepada Nabi yang ketika itu Usamah, Sa'd dan Ubbay, bersama Nabi shallallahu 'alaihi wasallam, (seingatku) utusan itu menyampaikan pesan yang isinya; \"Anakku telah menjelang wafat, maka tolong engkau (nabi) datang! Namun Nabi (tak sempat datang) dan hanya mengutusnya seraya menyampaikan pesan; \"Tolong sampaikan salam kepadanya dan katakanlah; \"Milik Allah lah segala yang diambil-Nya dan segala yang diberikan-Nya, dan segala sesuatu mempunyai batasan waktu tertentu disisi-Nya, maka hendaklah dia hanya mengharap ganjaran dan bersabar.\" (Merasa tidak puas), puteri nabi mengirim utusan untuk kedua kalinya sambil menyumpahinya (agar bisa membujuk nabi). Spontan nabi beranjak, dan kami pun berdiri. (ketika sampai), cucu nabi diletakkan di pangkuan Nabi shallallahu 'alaihi wasallam sedang nafasnya sudah tersengal-sengal karena tinggal sisa-sisa nyawanya. Kedua mata Nabi shallallahu 'alaihi wasallam pun berlinang, sehingga Sa'd bertanya; \"Kenapa anda menangis ya Rasulullah?\" Beliau menjawab: \"Ini adalah pertanda kasih sayang yang Allah letakkan di hati hamba sesuai yang di kehendaki-Nya, dan Allah tidak akan meletakkan rasa kasih sayang pada para hamba-Nya kecuali terhadap orang-orang yang mempunyai rasa kasih sayang",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5656,
			"arabicnumber": 5656,
			"text": "Telah menceritakan kepada kami [Mu'allaa bin Asad] telah menceritakan kepada kami [Abdul Aziz bin Muhtar] telah menceritakan kepada kami [Khalid] dari [Ikrimah] dari [Ibnu Abbas] radliallahu 'anhuma bahwa Nabi shallallahu 'alaihi wasallam pernah menjenguk seorang Arab badui, Ibnu Abbas melanjutkan; \"Setiap kali beliau menjenguk orang sakit, maka beliau akan mengatakan kepadanya: \"Tidak apa-apa, Insya Allah baik-baik saja.\" Ibnu Abbas berkata; lalu aku bertanya; \"Baik?!, tidak mungkin, sebab penyakit yang di deritanya adalah demam yang sangat kritis, yang apabila diderita oleh orang tua akan menyebabkannya meninggal dunia.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Kalau begitu, memang benar",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5657,
			"arabicnumber": 5657,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Tsabit] dari [Anas] radliallahu 'anhu bahwa seorang budak milik orang Yahudi pernah menjadi pelayannya Nabi shallallahu 'alaihi wasallam, lalu dia jatuh sakit, maka Nabi shallallahu 'alaihi wasallam pergi menjenguknya sambil bersabda: \"Masuk Islamlah kamu.\" Lalu dia masuk Islam.\" Sa'id bin Musayyib berkata; dari Ayahnya \"Ketika Abu Thalib hendak meninggal, Nabi shallallahu 'alaihi wasallam datang menjenguknya",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5658,
			"arabicnumber": 5658,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Hisyam] dia berkata; telah mengabarkan kepadaku [Ayahku] dari [Aisyah] radliallahu 'anha bahwa Nabi shallallahu 'alaihi wasallam pernah dijenguk oleh beberapa orang ketika beliau sakit, kemudian beliau mengerjakan shalat sambil duduk, maka orang-orang pun ikut mengerjakan shalat sambil berdiri, lalu beliau memberi isyarat supaya mereka juga duduk, seusai shalat beliau bersabda: \"Sesungguhnya dijadikannya Imam itu untuk diikuti, apabila dia ruku' maka kalian juga harus ruku', apabila dia mengangkat kepala maka kalian juga harus mengangkat kepala, apabila dia shalat sambil duduk maka kalian harus shalat sambil duduk.\" Abu Abdullah berkata; Al Humaidi berkata; hadits ini hukumnya mansukh (terhapus), karena Nabi shallallahu 'alaihi wasallam di akhir hayatnya selalu mengerjakan shalat sambil duduk, sementara orang-orang yang di belakang beliau shalat sambil berdiri",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5659,
			"arabicnumber": 5659,
			"text": "Telah menceritakan kepada kami [Al Makki bin Ibrahim] telah mengabarkan kepada kami [Al Ju'aid] dari [Aisyah binti Sa'd] bahwa [Ayahnya] berkata; Aku pernah menderita rasa sakit yang amat berat ketika di Makkah, maka Nabi shallallahu 'alaihi wasallam datang menjengukku, lalu aku berkata kepada beliau; \"Wahai Nabi Allah, aku akan meninggalkan banyak harta benda, namun aku tidak memiliki seorang pun (ahli warits) selain seorang puteri, oleh karena itu aku wasiatkan dua pertiga dari harta bendaku dan aku tinggalkan sepertiganya\" beliau bersabda: \"Jangan.\" Kataku; \"Kalau begitu, aku wasiatkan setengahnya dan aku sisakan setengah.\" Beliau menjawab: \"Jangan.\" Kataku selanjutnya; \"Kalau begitu aku wasiatkan sepertiga dan aku sisakan yang dua pertiganya.\" Beliau bersabda: \"Sepertiga, sepertiga pun masih banyak, \" lalu beliau meletakkan tangan beliau di atas keningnya kemudian beliau mengusap wajah dan perutku sambil berdo'a: \"ALLAHUMMASYFII SA'D WA ATMIM LAHU HIJRATAHU (Ya Allah, sembuhkanlah penyakit Sa'd dan sempurnakanlah hijrahnya).\" Maka aku masih merasakan rasa sejuk di hatiku hingga saat ini",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5660,
			"arabicnumber": 5660,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim At Taimi] dari [Al Harits bin Suwaid] dia berkata; [Abdullah bin Mas'ud] berkata; Aku pernah menjenguk Rasulullah shallallahu 'alaihi wasallam, ketika itu beliau sedang menderita rasa sakit yang sangat berat, lalu aku memegang beliau sambil berkata; \"Wahai Rasulullah, sepertinya anda sedang menderita sakit yang sangat berat, \" beliau menjawab: \"Benar, rasa sakit yang menimpaku ini sama seperti rasa sakit yang menimpa dua orang dari kalian.\" Kataku selanjutnya; \"Sebab itu anda mendapatkan pahala dua kali lipat.\" Beliau menjawab: \"Benar, \" kemudian beliau bersabda lagi: \"Tidaklah seorang muslim yang menderita sakit atau yang lain, melainkan Allah akan menghapuskan kesalahan-kesalahannya sebagaimana pohon menggugurkan dedaunannya",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5661,
			"arabicnumber": 5661,
			"text": "Telah menceritakan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim At Taimi] dari [Al Harits bin Suwaid] dari [Abdullah] radliallahu 'anhu dia berkata; aku menjenguk Nabi shallallahu 'alaihi wasallam ketika beliau sakit, lalu aku memegang beliau sementara beliau sedang menahan sakit yang amat berat, maka kataku; \"Sepertinya anda sedang merasakan sakit yang amat berat, karena itu anda mendapatkan pahala dua kali lipat.\" Beliau bersabda: \"Benar, dan tidaklah seorang muslim yang tertimpa musibah (sakit) melainkan Allah akan menghapuskan kesalahan-kesalahannya sebagaimana pohon menggugurkan dedaunannya",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5662,
			"arabicnumber": 5662,
			"text": "Telah menceritakan kepada kami [Ishaq] telah menceritakan kepada kami [Khalid bin Abdullah] dari [Khalid] dari [Ikrimah] dari [Ibnu Abbas] radliallahu 'anhuma bahwa Rasulullah shallallahu 'alaihi wasallam pernah menjenguk seorang laki-laki yang sedang sakit, beliau lalu bersabda: \"Tidak apa-apa, Insya Allah baik-baik saja.\" Ibnu Abbas berkata; \"Baik?!, tidak mungkin, sebab penyakit yang di deritanya adalah demam yang sangat kritis, yang apabila diderita oleh orang tua akan menyebabkannya meninggal dunia.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Kalau begitu, memang benar",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5663,
			"arabicnumber": 5663,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari ['Urwah] bahwa [Usamah bin Zaid] mengabarkan kepadanya bahwa Nabi shallallahu 'alaihi wasallam pernah mengendarai keledai milik beliau, diatasnya ada pelana bersulam beludru Fadaki, sementara Usamah bin Zaid membonceng di belakang beliau ketika hendak menjenguk Sa'ad bin 'Ubadah sebelum peristiwa Badar, lalu beliau berjalan dan sempat melintasi suatu majlis yang di majlis tersebut terdapat Abdullah bin Ubay bin Salul, kejadian itu sebelum Abdullah masuk Islam, dan dalam majlis tersebut terdapat pula beberapa orang kaum Muslimin yang bercampur baur dengan orang-orang musyrik, para penyembah patung, dan orang-orang Yahudi, terdapat pula Abdullah bin Rawahah, saat majlis itu dipenuhi kepulan debu keledai, 'Abdullah bin Ubai menutupi hidungnya dengan selendang sambil berkata: \"Jangan mengepuli kami dengan debu, \" kemudian Nabi shallallahu 'alaihi wasallam mengucapkan salam pada mereka lalu berhenti dan turun, setelah itu Nabi shallallahu 'alaihi wasallam mengajak mereka menuju Allah lalu beliau membacakan al-Qur'an kepada mereka. 'Abdullah bin Ubay berkata kepada beliau: \"Wahai saudara! Sesungguhnya apa yang kamu katakan tidak ada kebaikannya sedikit pun, bila apa yang kau katakan itu benar, maka janganlah kamu mengganggu kami di majlis ini, silahkan kembali ke kendaraan anda, lalu siapa saja dari kami mendatangi anda, silahkan anda bercerita padanya.\" 'Abdullah bin Rawahah berkata; \"Wahai Rasulullah, bergabunglah dengan kami di majlis ini karena kami menyukai hal itu.\" Kaum muslimin, orang-orang musyrik dan orang-orang Yahudi pun saling mencaci hingga mereka hendak saling menyerang, Nabi shallallahu 'alaihi wasallam terus menenangkan mereka hingga mereka semuanya diam, kemudian beliau naik kendaraan hingga masuk ke kediaman Sa'd bin 'Ubadah lalu beliau bersabda: \"Hai Sa'd! Apa kau tidak mendengar ucapan Abu Hubab?\" maksud beliau tentang ucapan 'Abdullah bin Ubay. Sa'ad berkata; \"Maafkan dia wahai Rasulullah dan berlapang dadalah kepadanya, demi Allah, Allah telah memberi anda apa yang telah diberikan pada anda. Penduduk telaga ini (penduduk Madinah -red) bersepakat untuk memilihnya dan mengangkatnya, namun karena kebenaran yang diberikan kepada anda itu muncul, sehingga menghalangi ia menjabat sebagai pemimpin, maka seperti itulah perbuatannya sebagaimana yang anda lihat",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5664,
			"arabicnumber": 5664,
			"text": "Telah menceritakan kepada kami ['Amru bin 'Abbas] telah menceritakan kepada kami [Abdurrahman] telah menceritakan kepada kami [Sufyan] dari [Muhammad yaitu Ibnu Al Munkadir] dari [Jabir] radliallahu 'anhu dia berkata; Nabi shallallahu 'alaihi wasallam pernah datang menjengukku tanpa mengendarai bighal (peranakan kuda dengan keledai) dan tidak pula birdzaun (keledai yang asal-usul keturunannya bukan dari Arab)",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5665,
			"arabicnumber": 5665,
			"text": "Telah menceritakan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dan [Ayyub] dari [Mujahid] dari [Abdurrahman bin Abu Laila] dari [Ka'b bin 'Ujrah] radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam pernah melewatiku sementara aku sedang menyalakan api di bawah periuk, lalu beliau bertanya: \"Apakah kepalamu terganggu (dengan kutu)?\" Aku menjawab; \"Ya.\" Lalu beliau memanggil tukang cukur dan mencukurnya, kemudian beliau memerintahkanku membayar fidyah",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5666,
			"arabicnumber": 5666,
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya Abu Zakariya`] telah mengabarkan kepada kami [Sulaiman bin Bilal] dari [Yahya bin Sa'id] dia berkata; saya mendengar [Al Qasim bin Muhammad] berkata; [Aisyah] berkata; \"Aduh kepalaku pusing.\" maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalaulah kematianmu terjadi dan aku masih hidup, tentu aku memintakan ampun untukmu dan mendoakan kebaikan bagimu. Kata 'Aisyah \"Duhh,, sungguh aku beranggapan bahwa engkau mencintai kematianku! Dan kalaulah kematian itu terjadi pada dirimu, niscaya engkau harus menjadi pengantin di akhir-akhir harimu (maksudnya 'Aisyah sangat mengimpikan agar akhir-akhir hayat nabi, beliau berada di rumahnya, bukan di rumah isteri nabi yang lain). Lantas Nabi shallallahu 'alaihi wasallam mengatakan: \"Bahkan aku merasa sakit kepala, sungguh aku berkeinginan atau ingin mengutus seorang utusan kepada Abu Bakar dan anaknya, dan aku sampaikan washiyat; \"Biarlah orang berkomentar apa saja, atau biarlah orang bercita-cita apa saja, yang jelas kemudian aku katakan: 'Allah enggan dan orang-orang mukmin menolak atau dengan redaksi lain Allah menolak dan orang-orang mukmin enggan",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5667,
			"arabicnumber": 5667,
			"text": "Telah menceritakan kepada kami [Musa] telah menceritakan kepada kami [Abdul Aziz bin Muslim] telah menceritakan kepada kami [Sulaiman] dari [Ibrahim Attaimi] dari [Al Harits bin Suwaid] dari [Ibnu Mas'ud] radliallahu 'anhu mengatakan; \"Aku menemui Nabi shallallahu 'alaihi wasallam ketika beliau sedang menderita demam yang sangat berat, lantas kupegang dengan tanganku. Aku berujar; 'Sepertinya engkau terkena sakit dan demam yang sedemikian serius'. Beliau menjawab: \"Benar, rasa sakit yang menimpaku ini sama seperti rasa sakit yang menimpa dua orang dari kalian.\" Aku berujar; \"Oh, kalau begitu anda mendapatkan pahala dua kali lipat?! Jawab beliau: 'Engkau benar, tidaklah seorang muslim terkena gangguan, baik itu sakit atau lainnya, melainkan Allah akan menghapus kesalahan-kesalahannya karena sakitnya sebagaimana pohon mengugurkan daunnya",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5668,
			"arabicnumber": 5668,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Abdul Aziz bin Abdullah bin Abu Salamah] telah mengabarkan kepada kami [Az Zuhri] dari ['Amir bin Sa'd] dari [Ayahnya] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah datang menjengukku ketika aku sedang menderita sakit keras yaitu ketika Haji Wada', maka aku berkata; \"Wahai Rasulullah, keadaan saya semakin parah, seperti yang telah anda lihat saat ini, sedangkan saya adalah orang yang memiliki banyak harta, sementara saya hanya memiliki seorang anak perempuan yang akan mewarisi harta peninggalan saya, maka bolehkah saya menyedekahkan dua pertiga dari harta saya?\" beliau bersabda: \"Jangan.\" Saya bertanya lagi; \"Kalau begitu, bagaimana jika separuhnya?\" beliau menjawab: \"Jangan, \" Tanyaku lagi; \"Kalau begitu bagaimana kalau sepertiganya? Beliau menjawab: Sepertiga pun sudah banyak, sebenarnya jika kamu meninggalkan ahli warismu dalam keadaan kaya, itu lebih baik daripada kamu meninggalkan mereka dalam keadaan yang serba kekurangan dan meminta-minta kepada orang lain. Tidakkah Kamu menafkahkan suatu nafkah dengan tujuan untuk mencari ridla Allah, melainkan kamu akan mendapatkan pahala lantaran dari nafkah pemberianmu itu, hingga sesuap makanan yang kamu suguhkan ke mulut istrimu",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5669,
			"arabicnumber": 5669,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah menceritakan kepada kami [Hisyam] dari [Ma'mar] dan dari jalur lain telah menceritakan kepadaku [Abdullah bin Muhammad] telah menceritakan kepada kami [Abdurrazaq] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas] radliallahu 'anhuma dia berkata; \"Tatkala Rasulullah shallallahu 'alaihi wasallam mendekati ajalnya, sedangkan di rumah beliau telah hadir beberapa orang, diantaranya adalah Umar bin Khattab, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Kemarilah, saya akan menulis suatu catatan yang kalian tidak akan tersesat sepeninggalku.\" Lalu Umar berkata; \"Tampaknya sakit beliau bertambah parah, bukankah di sisi kalian terdapat Al Qur'an? Cukuplah bagi kita Kitabullah.\" Orang-orang yang berada di sekitar beliau ketika itu berbeda pendapat, lalu mereka saling berbantah-bantahan. Ada yang mengatakan; \"Mendekatlah kepada beliau, supaya Rasulullah shallallahu 'alaihi wasallam dapat menuliskan suatu wasiat buat kalian, agar kalian tidak tersesat sepeninggalnya.\" Dan yang lain berpendapat seperti perkataan Umar, sehingga mereka menjadi ribut di sekitar Rasulullah shallallahu 'alaihi wasallam. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berdirilah kalian semua (maksudnya pergi dari sisi beliau).\" Ubaidullah mengatakan; Ibnu Abbas berkata; \"Kerugian besar (bagi kaum Muslimin), mereka gagal menuliskan pesan terakhir Rasulullah shallallahu 'alaihi wasallam karena mereka saling berbantah-bantahan di sekitar Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5670,
			"arabicnumber": 5670,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Hamzah] telah menceritakan kepada kami [Hatim yaitu Ibnu Isma'il] dari [Al Ju'aid] dia berkata; aku mendengar [As Sa`ib] berkata; aku bersama bibiku pernah datang kepada Rasulullah shallallahu 'alaihi wasallam, lalu dia berkata; \"Wahai Rasulullah, sesungguhnya anak saudaraku ini sedang menderita sakit.\" Lalu beliau memegang kepalaku dan mendo'akan keberkahan kepadaku, kemudian beliau berwudlu dan aku pun minum dari sisa air wudlu' tersebut, setelah itu aku berdiri di belakang beliau hingga aku sempat melihat setempel kenabiannya berada di antara kedua pundak beliau seperti biji kancing",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5671,
			"arabicnumber": 5671,
			"text": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Tsabit Al Bunani] dari [Anas bin Malik] radliallahu 'anhu dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian mengharapkan kematian karena musibah yang menimpanya, kalau memang hal itu harus, hendaknya ia mengatakan; Ya Allah, hidupkanlah aku jika kehidupan itu baik untukku, dan matikanlah aku jika kematian itu baik bagiku",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5672,
			"arabicnumber": 5672,
			"text": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] dari [Isma'il bin Abu Khalid] dari [Qais bin Abu Hazim] dia berkata; Aku pernah menjenguk [Khubbab], sementara dirinya berobat dengan kay (terapi dengan menempelkan besi panas pada bagian tubuh yang sakit) sebanyak tujuh kali, lalu dia berkata; \"Sesungguhnya para sahabat kami yang telah mendahului kami, mereka telah pergi sementara mereka tidak mendapatkan bagian sedikitpun dari kehidupan dunia melainkan hanya sepetak tanah, sekiranya Nabi shallallahu 'alaihi wasallam tidak melarang kami untuk mengharapkan kematian, niscaya kami akan mengharapkan kematian.\" Di kesempatan lain kami menemuinya lagi sementara dirinya sedang membangun rumahnya, lalu dia berkata; \"Seseorang akan diberi balasan dalam semua yang ia belanjakan selain yang ia belanjakan untuk sebidang tanah ini",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5673,
			"arabicnumber": 5673,
			"text": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku [Abu 'Ubaid] bekas budak Abdurrahman bin Auf bahwa [Abu Hurairah] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada seorang pun yang masuk surga karena amalannya.\" Para sahabat bertanya; \"Begitu juga dengan engkau wahai Rasulullah?\" beliau bersabda: \"tidak juga dengan diriku, kecuali bila Allah melimpahkan karunia dan rahmat-Nya padaku, oleh karena itu berlaku luruslah dan bertaqarublah dan janganlah salah seorang dari kalian mengharapkan kematian, jika dia orang baik semoga saja bisa menambah amal kebaikannya, dan jika dia orang yang buruk (akhlaknya) semoga bisa menjadikannya dia bertaubat",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5674,
			"arabicnumber": 5674,
			"text": "Telah menceritakan kepada kami [Abdullah bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] dari [Hsiyam] dari ['Abbad bin Abdullah bin Az Zubair] dia berkata; saya mendengar [Aisyah] radliallahu 'anha berkata; saya mendengar Nabi shallallahu 'alaihi wasallam ketika beliau sedang berada di pangkauanku, sabdanya: \"Ya Allah, ampunalah aku, rahmatilah aku serta pertemukanlah daku dengan Ar Rafiq",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5675,
			"arabicnumber": 5675,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Abu 'Awanah] dari [Manshur] dari [Ibrahim] dari [Masruq] dari [Aisyah] radliallahu 'anha bahwa apabila Rasulullah shallallahu 'alaihi wasallam menjenguk orang sakit atau ada orang yang sakit datang kepada beliau, beliau berdo'a: \"ADZHIBIL BA`SA RABBAN NAASI ISYFII WA ANTA SYAAFI LAA SYIFAA`A ILLA SYIFAA`UKA SYIFAA`A LAA YUGHAADIRU SAQAMA (Hilangkanlah penyakit wahai Rab sekalian manusia, sembuhkanlah wahai dzat Yang Maha Menyembuhkan, tidak ada yang dapat menyembuhkan melainkan kesembuhan dari-Mu, yaitu kesembuhan yang tidak membawa rasa sakit).\" ['Amru bin Abu Qais], [Ibrahim bin Thahman] mengatakan dari [Manshur] dari [Ibrahim] dan [Abu Adl Dluha] dengan redaksi \"Apabila ada orang yang sakit datang kepada beliau.\" Sementara [Jarir] mengatakan dari [Manshur] dari [Abu Adl Dluha] saja, dia berkata; \"Apabila beliau menjenguk orang sakit",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5676,
			"arabicnumber": 5676,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Al Munkadir] dia berkata; saya mendengar [Jabir bin Abdullah] radliallahu 'anhu berkata; \"Nabi shallallahu 'alaihi wasallam menjengukku ketika saya sakit, lalu beliau berwudlu' dan memercikkan air wudlu'nya kepadaku, atau bersabda: \"percikkanlah (air) padanya.\" lantas saya pun tersadar, lalu saya berkata; \"Wahai Rasulullah, saya tidak ada yang mewarisiku kecuali hanya kalalah (ahli warits sendirian), bagaimana aku harus membagi harta peninggalanku? Setelah itu turunlah ayat tentang fara`idl (harta peninggalan)",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5677,
			"arabicnumber": 5677,
			"text": "Telah menceritakan kepada kami [Isma'il] telah menceritakan kepada kami [Malik] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha bahwa dia berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam sampai (di Madinah), Abu Bakar dan Bilal menderita sakit, lalu aku menjenguk mereka berdua. Aku bertanya; \"Wahai ayahku, bagaimana keadaanmu? Dan engkau Bilal, bagaimana keadaanmu?\" Aisyah melanjutkan; Dan setiap kali Abu Bakar menderita sakit panas, maka dia akan berkata; \"Setiap orang bertanggung jawab terhadap keluarganya dan kematian itu lebih dekat dari pada tali sandalnya.\" Sedangkan jika Bilal sakit demamnya semakin tinggi, maka dia akan berkata; \"Alangkah baiknya syairku, apakah aku harus bermalam di suatu lembah sementara di sampingku terdapat orang-orang yang membanggakan diri lagi mulia. Apakah suatu hari mereka akan menginginkan air yang melimpah. Apakah sudah tampak olehku gunung Syamah dan Thafil?\" Abu Urwah berkata; Aisyah melanjutkan; Kemudian aku mendatangi Rasulullah shallaallahu 'alaihi wa sallam dan mengabarkan keadaan mereka kepada beliau. Lalu beliau berdo'a: ALLAHUMMA HABBIB ILAINAA ALMADINAH KAHUBBINA MAKKATA AW ASYADDA ALLAHUMMA WA SHAHHIHHA WA BAARIK LANAA FI SHAA'IHAA WA MUDDIHA WANQUL HUMMAHA FAJ'ALHA BIL JUHFAH (Ya Allah, jadikanlah kecintaan kami kepada Madinah seperti kecintaan kami kepada Mekkah atau lebih. Ya Allah, perbaikilah ia, Berkahilah kami pada takaran sha' dan mudnya dan pindahkanlah wabah penyakitnya ke Juhfah)",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 37
			}
		}
	]
}