{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6227,
			"arabicnumber": 6227,
			"text": "Telah menceritakan kepada kami [Yahya bin Ja'far] telah menceritakan kepada kami [Abdurrazzaq] dari [Ma'mar] dari [Hammam] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Telah Allah cipta Adam dengan semua ciri fisiknya, tingginya enam puluh hasta. Selesai Allah menciptanya, Allah berfirman \"Sana pergi, dan ucapkanlah salam kepada malaikat yang duduk itu, dan dengarkan baik-baik bacaan salam mereka kepadamu, sebab itu sebagai salam penghormatanmu dan juga anak cucu keturunanmu.\" Adam mengucapkan \"Assalamu'alaikum\". Para malaikat menjawab \"Assalamu'alaika warohmatullah.\" Dan mereka menambahnya lagi dengan \"Wabarokaatuh.\" Maka siapapun yang masuk surga, ciri fisiknya seperti Adam (tingginya enam puluh hasta), namun manusia semenjak jaman Adam, tingginya semakin berkurang hingga sekarang",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6228,
			"arabicnumber": 6228,
			"text": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku [Sulaiman bin Yasar] telah mengabarkan kepadaku [Abdullah bin Abbas] radliallahu 'anhuma dia berkata; \"Pada hari Iedul Kurban, Al Fadlu bin Abbas pernah membonceng Rasulullah shallallahu 'alaihi wasallam dibelakang hewan tunggangannya, Al Fadl adalah orang yang cakap wajahnya, lalu Nabi shallallahu 'alaihi wasallam berhenti sejenak untuk memberi fatwa di hadapan orang-orang, ternyata ada seorang wanita berwajah cantik dari Kaitsam datang kepada Rasulullah shallallahu 'alaihi wasallam untuk meminta fatwa, segera Al Fadlu memandang wanita tersebut, ia merasa heran dengan kecantikannya, ketika Nabi shallallahu 'alaihi wasallam menoleh ke arah Al Fadl, dia masih saja memandangi wanita tersebut, akhirnya beliau memutar tangan ke arah belakang dan memegang dagu Al Fadl serta memalingkan wajahnya ke arah lain. Wanita tersebut bertanya; \"Wahai Rasulullah, sesungguhnya Allah telah mewajibkan ibadah haji kepada para hamba-Nya, sementara ayahku baru mampu melaksanakan haji saat dia telah lanjut usia hingga menyebabkan ia tidak mampu naik kendaraan. Apakah saya boleh berhaji untuknya?\" beliau menjawab; \"Ya",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6229,
			"arabicnumber": 6229,
			"text": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah mengabarkan kepada kami [Abu 'Amir] telah menceritakan kepada kami [Zuhair] dari [Zaid bin Aslam] dari ['Atha` bin Yasar] dari [Abu Sa'id Al Khudri] radliallahu 'anhu bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian duduk-duduk di pinggir jalan.\" Mereka (para sahabat) berkata; \"Wahai Rasulullah, Itu kebiasaan kami yang sudah biasa kami lakukan karena itu menjadi majelis tempat kami untuk bercakap-cakap.\" Beliau bersabda: \"Jika kalian tidak mau meninggalkan majelis seperti itu maka tunaikanlah hak jalan tersebut.\" Mereka bertanya: \"Apa hak jalan itu?\" Beliau menjawab: \"Menundukkan pandangan, menyingkirkan halangan, menjawab salam dan amar ma'ruf nahi munkar",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6230,
			"arabicnumber": 6230,
			"text": "Telah menceritakan kepada kami [Umar bin Hafsh] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] dia berkata; telah menceritakan kepadaku [Syaqiq] dari [Abdullah] dia berkata; \"Ketika kami membaca shalawat di belakang Nabi shallallahu 'alaihi wasallam, maka kami mengucapkan: \"ASSALAAMU 'ALALLAHI QABLA 'IBAADIHI, ASSALAAMU 'ALAA JIBRIIL, ASSSALAAMU 'ALAA MIKAA`IIL, ASSALAAMU 'ALAA FULAAN WA FULAAN (Semoga keselamatan terlimpahkan kepada Allah, semoga keselamatan terlimpah kepada Jibril, Mika'il, kepada fulan dan fulan).\" Ketika Nabi shallallahu 'alaihi wasallam selesai melaksanakan shalat, beliau menghadapkan wajahnya kepada kami dan bersabda: \"Sesungguhnya Allah adalah As salam, apabila salah seorang dari kalian duduk dalam shalat (tahiyyat), hendaknya mengucapkan; \"AT-TAHIYYATUT LILLAHI WASH-SHALAWAATU WATH-THAYYIBAATU, ASSALAAMU 'ALAIKA AYYUHAN-NABIYYU WA RAHMATULLAHI WA BARAKAATUH, ASSALAAMU 'ALAINAA WA 'ALA 'IBAADILLAAHISH SHAALIHIIN, (penghormatan, rahmat dan kebaikan hanya milik Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Sesungguhnya jika ia mengucapkannya, maka hal itu sudah mencakup seluruh hamba-hamba yang shalih baik di langit maupun di bumi, lalu melanjutkan; \"ASYHADU ALLAA ILAAHA ILLALLAH WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WA RASUULUH (Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah, dan Muhammad adalah hamba dan utusan-Nya).\" Setelah itu ia boleh memilih do'a yang ia kehendaki",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6231,
			"arabicnumber": 6231,
			"text": "Telah menceritakan kepada kami [Muhammad bin Muqatil Abu Al Hasan] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Hendaknya yang muda memberi salam kepada yang tua, yang berjalan kepada yang duduk, dan (rombongan) yang sedikit kepada (rombongan) yang banyak",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6232,
			"arabicnumber": 6232,
			"text": "Telah menceritakan kepadaku [Muhammad bin Salam] telah mengabarkan kepada kami [Makhlad] telah mengabarkan kepada kami [Ibnu Juraij] dia berkata; telah mengabarkan kepadaku [Ziyad] bahwa dia mendengar [Tsabit] bekas budak Abdurrahman bin Zaid, bahwa dia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaknya orang yang berkendara memberi salam kepada yang berjalan, dan yang berjalan memberi salam kepada yang duduk dan (rombongan) yang sedikit kepada (rombongan) yang banyak",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6233,
			"arabicnumber": 6233,
			"text": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Rauh bin 'Ubadah] telah menceritakan kepada kami [Ibnu Juraij] dia berkata; telah mengabarkan kepadaku [Ziyad] bahwa [Tsabit] telah mengabarkan kepadanya -dia adalah bekas budak Abdurrahman bin Zaid- dari [Abu Hurairah] radliallahu 'anhu dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Hendaknya orang yang berkendaraan memberi salam kepada yang berjalan, dan yang berjalan kepada yang duduk dan (rombongan) yang sedikit kepada (rombongan) yang banyak",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6234,
			"arabicnumber": 6234,
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6235,
			"arabicnumber": 6235,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Jarir] dari [Asy Syaibani] dari [Asy'ats bin Abu Asy Sya'tsa'] dari [Mu'awiyah bin Suwaid bin Muqarrin] dari [Al Barra` bin 'Azib] radliallahu 'anhuma dia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kami tujuh perkara yaitu; menjenguk orang yang sakit, mengiringi jenazah, mendo'akan orang yang bersin, menolong yang lemah, menolong orang yang terzhalimi, menebarkan salam dan menunaikan sumpah, dan beliau juga melarang minum dari bejana yang terbuat dari perak, mengenakan cincin emas, menaiki sekedup yang ditutupi dengan kain sutera, mengenakan kain sutera, dibaj, Qasiy dan Istabraq (sejenis kain sutera)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6236,
			"arabicnumber": 6236,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah menceritakan kepada kami [Al Laits] dia berkata; telah menceritakan kepadaku [Yazid] dari [Abu Al Khair] dari [Abdullah bin 'Amru] bahwa seorang laki-laki bertanya kepada Nabi shallallahu 'alaihi wasallam; \"Islam bagaimanakah yang baik?\" beliau menjawab: \"Kamu memberi makan, menebarkan salam baik terhadap orang yang kamu kenal maupun terhadap orang yang tidak kamu kenal",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6237,
			"arabicnumber": 6237,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['Atha`bin Yazid Al Laitsi] dari [Abu Ayyub] radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak halal seorang muslim mendiamkan saudaranya lebih dari tiga hari, jika bertemu saling menjauhkan, dan yang paling baik di antara keduanya adalah yang memulai salam.\" Sufyan menyebutkan, bahwa dia mendengar Zuhri hingga tiga kali",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6238,
			"arabicnumber": 6238,
			"text": "Telah menceritakan kepada kami [Yahya bin Sulaiman] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku [Anas bin Malik] bahwa ketika Rasulullah shallallahu 'alaihi wasallam tiba di Madinah ia masih berusia sepuluh tahun. (Ia mengkisahkan); Maka aku menjadi pelayan Rasulullah shallallahu 'alaihi wasallam selama sepuluh tahun semasa hayat beliau. Dan akulah orang yang paling mengerti tentang hijab ketika perintah itu diturunkan, Ubay bin Ka'b juga pernah bertanya kepadaku tentang hal itu. Perintah itu pertama kali turun di waktu pernikahan Rasulullah shallallahu 'alaihi wasallam dengan Zainab binti Jahsyi. Saat itu Rasulullah shallallahu 'alaihi wasallam tengah mengadakan pesta walimah, beliau mengundang orang-orang dan mereka pun menikmati makanan yang dihidangkan. Setelah itu, mereka pun keluar pergi, kecuali beberapa orang yang masih tetap berada di sisi Rasulullah shallallahu 'alaihi wasallam, mereka sengaja memperlama duduk di situ. Maka Rasulullah shallallahu 'alaihi wasallam pun beranjak dan keluar, lalu aku pun ikut keluar bersama beliau agar orang-orang itu juga ikut keluar. Kemudian Rasulullah shallallahu 'alaihi wasallam berjalan, dan aku juga ikut berjalan hingga sampai di ambang pintu rumah Aisyah. Lalu Rasulullah shallallahu 'alaihi wasallam mengira, bahwa mereka yang duduk tadi telah keluar, maka beliau kembali lagi dan aku juga ikut kembali hingga beliau sampai di tempat Zainab, ternyata orang-orang itu masih ada di tempat semula dan belum beranjak pergi. Akhirnya Rasulullah shallallahu 'alaihi wasallam pun kembali lagi dan aku juga ikut kembali bersamanya, ketika sampai di ambang pintu Aisyah, beliau menduga bahwa mereka pasti sudah pergi, maka beliau kembali lagi dan aku juga ikut kembali bersama beliau, ternyata orang-orang itu telah beranjak pergi, lalu turunlah ayat hijab hingga beliau meletakkan pembatas antara aku dan beliau",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6239,
			"arabicnumber": 6239,
			"text": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Mu'tamar], [Ayahku] berkata; telah menceritakan kepada kami [Abu Mijlaz] dari [Anas] radliallahu 'anhu dia berkata; \"Ketika Nabi shallallahu 'alaihi wasallam menikah dengan Zainab, orang-orang (tamu undangan) pun berdatangan dan menikmati hindangan, kemudian mereka duduk dan berbincang-bincang. Lalu beliau merubah posisi seakan-akan ingin berdiri, namun orang-orang tidak juga berdiri, tatkala beliau mengetahui hal itu, maka beliau berdiri dan orang-orang pun ikut berdiri. Tinggal beberapa orang yang masih tetap, sesungguhnya Nabi shallallahu 'alaihi wasallam datang dan hendak masuk ke kamar Zainab, namun orang-orang masih tetap duduk-duduk, setelah itu mereka berdiri dan beranjak pergi, lalu saya mengabarkan hal itu kepada Nabi shallallahu 'alaihi wasallam. Kemudian beliau masuk dan saya mengikuti beliau masuk, lalu beliau menurunkan kain tirainya antara saya dengan beliau. Ternyata Allah Ta'ala menurunkan (ayat) Wahai orang-orang yang beriman, janganlah kalian masuk ke rumah Nabi…QS Al Ahzab; 53 Abu Abdullah mengatakan; \"Dalam perintah tersebut terdapat hukum fikih, bahwa beliau tidak mengizinkan mereka (para sahabat) ketika beliau berdiri dan keluar, dan juga ketika beliau merubah posisi seakan-akan hendak berdiri, menandakan bahwa beliau menghendaki mereka (para sahabat) keluar",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6240,
			"arabicnumber": 6240,
			"text": "Telah menceritakan kepada kami [Ishaq] telah mengabarkan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Ayahku] dari [Shalih] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku [Urwah bin Az Zubair] bahwa [Aisyah] radliallahu 'anha isteri Nabi shallallahu 'alaihi wasallam berkata; \"Umar bin Khatthab pernah berkata kepada Nabi shallallahu 'alaihi wasallam; \"Tolong, perintahkanlah para isteri anda untuk berhijab.\" Aisyah melanjutkan; \"Namun beliau tidak melakukannya, sedangkan isteri-isteri Nabi shallallahu 'alaihi wasallam juga biasa keluar pada malam hari ke tempat untuk buang hajat. Maka isteri beliau, Saudah binti Zam'ah keluar, ia adalah wanita yang berpostur tinggi, lalu 'Umar bin Khatthab melihatnya ketika ia berada di Majlis, katanya; 'Hai Saudah! Kami mengenalimu! ' 'Sesungguhnya 'Umar menegurnya hanya karena dia ingin semoga ayat hijab segera turun. Kata 'Aisyah; 'Memang, tidak lama kemudian Allah 'azza wajalla menurunkan ayat hijab",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6241,
			"arabicnumber": 6241,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan], [Az Zuhri] berkata; \"Aku telah menghafalnya sebagaimana dirimu di sini, dari [Sahl bin Sa'd] dia berkata; \"Seorang laki-laki pernah melongokkan kepalanya ke salah satu kamar Nabi shallallahu 'alaihi wasallam, waktu itu Nabi shallallahu 'alaihi wasallam tengah membawa sisir untuk menyisir rambutnya, lalu beliau bersabda: \"Sekiranya aku tahu kamu mengintip, sungguh aku akan mencolok kedua matamu, sesungguhnya meminta izin itu di berlakukan karena pandangan",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6242,
			"arabicnumber": 6242,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Ubaidullah bin Abu Bakr] dari [Anas bin Malik] bahwa seorang laki-laki melongokkan kepalanya ke salah satu kamar Nabi shallallahu 'alaihi wasallam, lantas Nabi shallallahu 'alaihi wasallam berdiri menemuinya dengan membawa sisir, dan seolah-olah aku melihat beliau menakut-nakuti hendak mencolok laki-laki itu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6243,
			"arabicnumber": 6243,
			"text": "Telah menceritakan kepada kami [Al Humaidi] telah menceritakan kepada kami [Sufyan] dari [Ibnu Thawus] dari [Ayahnya] dari [Ibnu Abbas] radliallahu 'anhuma dia berkata; \"Saya tidak berpendapat dengan sesuatu yang menyerupai makna lamam (dosa kecil) selain perkataan [Abu Hurairah]. Dan di riwayatkan dari jalur lain, telah menceritakan kepadaku [Mahmud] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [Ayahnya] dari [Ibnu Abbas] dia berkata; \"Saya tidak berpendapat tentang sesuatu yang paling dekat dengan makna Al lamam (dosa-dosa kecil) selain dari apa yang telah dikatakan oleh [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam: \"Sesungguhnya Allah telah menetapkan pada setiap anak cucu Adam bagiannya dari perbuatan zina yang pasti terjadi dan tidak mungkin dihindari, maka zinanya mata adalah melihat sedangkan zinanya lisan adalah ucapan, zinanya nafsu keinginan dan berangan-angan, dan kemaluanlah sebagai pembenar semuanya atau tidak",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6244,
			"arabicnumber": 6244,
			"text": "Telah menceritakan kepada kami [Ishaq] telah mengabarkan kepada kami [Abdush Shamad] telah menceritakan kepada kami [Abdullah bin Al Mutsanna] telah menceritakan kepada kami [Tsumamah bin Abdullah] dari [Anas] radliallahu 'anhu bahwa; \"Apabila Rasulullah shallallahu 'alaihi wasallam memberi salam, beliau memberi salam hingga tiga kali, dan apabila berbicara biasanya beliau mengulanginya hingga tiga kali",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6245,
			"arabicnumber": 6245,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Yazid bin Khushaifah] dari [Busr bin Sa'id] dari [Abu Sa'id Al Khudri] dia berkata; \"Saya pernah berada di majlis dari majlisnya orang-orang Anshar, tiba-tiba [Abu Musa] datang dalam keadaan kalut, lalu dia berkata; \"Aku (tadi) meminta izin kepada Umar hingga tiga kali, namun ia tidak memberiku izin, maka aku hendak kembali pulang, lalu Umar bertanya; \"Apa yang membuatmu hendak kembali pulang?\" jawabku; \"Aku (tadi) meminta izin hingga tiga kali, namun aku tidak diberi izin, maka aku hendak kembali pulang, karena Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian meminta izin, namun tidak diberi izin, hendaknya ia kembali pulang.\" Maka Umar pun berkata; \"Demi Allah, sungguh kamu harus memberiku satu bukti yang jelas, \" (kata Abu Musa) \"Apakah di antara kalian ada yang pernah mendengarnya dari Nabi shallallahu 'alaihi wasallam?\" lalu Ubay bin Ka'ab angkat bicara; \"Demi Allah, tidaklah ada orang yang akan bersamamu melainkan orang yang paling muda di antara mereka, sedangkan akulah orang yang paling muda.\" Lalu aku pergi bersamanya menemui Umar, dan aku pun memberitahukan kepada Umar bahwa Nabi shallallahu 'alaihi wasallam berkata seperti itu.\" Dan [Ibnu Mubarak] berkata; telah mengabarkan kepadaku [Ibnu Uyainah] telah menceritakan kepadaku [Yazid bin Khushaifah] dari [Busr bin Sa'id] saya mendengar [Abu Sa'id] seperti ini",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6246,
			"arabicnumber": 6246,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami ['Umar bin Dzar], dan telah menceritakan kepada kami [Muhammad bin Muqatil] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Umar bin Dzar] telah mengabarkan kepada kami [Mujahid] dari [Abu Hurairah] radliallahu 'anhu dia berkata; \"Aku pernah masuk bersama Rasulullah shallallahu 'alaihi wasallam, lalu kami mendapatkan semangkok susu, beliau bersabda: \"Wahai Abu Hurairah, temuilah ahli Shuffah dan panggilah mereka kemari.\" Abu Hurairah berkata; \"Lantas aku menemui mereka dan memanggilnya, setelah itu mereka memenuhi panggilan beliau dan meminta izin masuk, setelah mereka di izinkan masuk, barulah mereka masuk",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6247,
			"arabicnumber": 6247,
			"text": "Telah menceritakan kepada kami [Ali bin Al Ja'd] telah mengabarkan kepada kami [Syu'bah] dari [Sayyar] dari [Tsabit Al Bunani] dari [Anas bin Malik] radliallahu 'anhu bahwa dia pernah melewati anak-anak kecil, lalu ia memberi salam kepada mereka dan berkata; \"Nabi shallallahu 'alaihi wasallam juga biasa melakukan hal ini",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6248,
			"arabicnumber": 6248,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Ibnu Abu Hazim] dari [Ayahnya] dari [Sahl] dia berkata; \"(Dahulu) Kami merasa gembira ketika tiba hari Jum'at, aku (Abu Hazm) bertanya; \"Kenapa?\" Sahl menjawab; \"Kami memiliki seorang nenek yang telah tua. Biasanya ia pergi ke Budla'ah -Ibnu Maslamah berkata; yaitu sebuah kebun kurma di Madinah- lalu ia mengambil ubi lalu meletakkannya di dalam periuk miliknya dan menumbuk biji-bijian dari gandum. Setelah shalat Jum'at kami pergi menemuinya, kami memberi salam kepadanya, lalu sang nenek pun menyuguhkannya kepada kami. Karena itu, hari Jum'at adalah hari yang sangat menyenangkan bagi kami. Kami tidak pernah menyantap makan siang dan tidak pula qailulah (tidur siang sebelum dluhur), kecuali setelah Jum'at",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6249,
			"arabicnumber": 6249,
			"text": "Telah menceritakan kepada kami [Ibnu Muqatil] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah bin Abdurrahman] dari [Aisyah] radliallahu 'anha dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Aisyah, ini Jibril menyampaikan salam untukmu!.\" Aisyah berkata; \"Jawabku; \"Wa'alihis salam warahmatullahi, anda melihat apa yang tidak kami lihat.\" Maksud Aisyah adalah Rasulullah shallallahu 'alaihi wasallam.\" Hadits ini juga di perkuat oleh riwayat [Syu'aib], [Yunus] dan [An Nu'man] mengatakan dari [Az Zuhri] ia menambahkan; \"Wabarakatuh",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6250,
			"arabicnumber": 6250,
			"text": "Telah menceritakan kepada kami [Abu Al Walid Hisyam bin Abdul Malik] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Al Munkadir] dia berkata; saya mendengar [Jabir bin Abdullah] radliallahu 'anhuma berkata; \"Aku menemui Nabi shallallahu 'alaihi wasallam karena hutang ayahku, lalu aku mengetuk pintu rumah beliau, beliau bertanya;: \"Siapakah itu?\" aku menjawab; \"Saya.\" Beliau bersabda: \"Saya, saya!.\" Seolah-olah beliau membencinya",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6251,
			"arabicnumber": 6251,
			"text": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah mengabarkan kepada kami [Abdullah bin Numair] telah menceritakan kepada kami ['Ubaidullah] dari [Sa'id bin Abu Sa'id Al Maqbury] dari [Abu Hurairah] radliallahu 'anhu bahwa seorang laki-laki memasuki masjid, sementara Rasulullah shallallahu 'alaihi wasallam tengah duduk di pojok masjid, kemudian laki-laki itu mengerjakan shalat. Seusai shalat ia datang menemui beliau sambil mengucapkan salam, dan Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Wa'alikas salam, Kembalilah dan ulangi shalatmu karena kamu belum mengerjakan shalat! ' lalu ia kembali lagi dan mengulangi shalatnya. Seusai shalat ia datang lagi sambil mengucapkan salam dan beliau bersabda: \"Wa'alaikas-salam. Kembali dan ulangi lagi shalatmu karena kamu belum mengerjakan shalat! ' Lalu orang tersebut berkata ketika disuruh mengulangi yang kedua kali atau setelahnya; \"Ajarilah aku wahai Rasulullah!\" Selanjutnya beliau bersabda: 'Jika kamu hendak mengerjakan shalat, maka sempurnakanlah wudlu', lalu menghadap ke arah Kiblat, setelah itu bertakbirlah, kemudian bacalah Al Qur'an yang mudah bagimu. Kemudian ruku'lah hingga kamu benar-benar ruku' dan bangkitlah dari ruku' hingga kamu berdiri tegak. Lalu sujudlah kamu hingga kamu benar-benar sujud, dan bangkitlah hingga kamu benar-benar duduk, setelah itu sujudlah hingga kamu benar-benar sujud, lalu bangkitlah hingga kamu benar-benar duduk, dan Kerjakanlah semua hal tersebut pada setiap shalatmu.\" [Abu Usamah] mengatakan di akhir haditsnya; \"Sehingga kamu benar-benar berdiri.\" Telah menceritakan kepada kami [Ibnu Basyar] dia berkata; telah menceritakan kepadaku [Yahya] dari ['Ubaidullah] telah menceritakan kepadaku [Sa'id] dari [Ayahnya] dari [Abu Hurairah] dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Kemudian bangkitlah (dari sujud) hingga kamu benar-benar duduk",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6252,
			"arabicnumber": 6252,
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6253,
			"arabicnumber": 6253,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zakariya`] dia berkata; saya mendengar ['Amir] berkata; telah menceritakan kepadaku [Abu Salamah bin Abdurrahman] bahwa [Aisyah] radliallahu 'anha pernah menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Sesungguhnya Jibril menyampaikan salam kepadamu.\" Aisyah menjawab; \"Wa'alaihis salam warahmatullahi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6254,
			"arabicnumber": 6254,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Hisyam] dari [Ma'mar] dari [Az Zuhri] dari ['Urwah bin Zubair] dia berkata; telah mengabarkan kepadaku [Usamah bin Zaid] bahwa Nabi shallallahu 'alaihi wasallam mengendarai keledai milik beliau, di atasnya ada pelana bersulam beludru Fadaki, sementara Usamah bin Zaid membonceng di belakang beliau ketika hendak menjenguk Sa'ad bin 'Ubadah di Bani Al Harits Al Khazraj, peristiwa itu tersjadi sebelum perang Badar, lalu beliau berjalan hingga melewati suatu majlis yang di majlis tersebut bercampur antara kaum Muslimin, orang-orang musyrik, para penyembah patung, dan orang-orang Yahudi, dan dalam majlis tersebut terdapat pula Abdullah bin Ubay bin Salul dan Abdullah bin Rawahah, saat majlis itu dipenuhi kepulan debu hewan kendaraan, 'Abdullah bin Ubai menutupi hidungnya dengan selendang sambil berkata: \"Jangan mengepuli kami dengan debu, \" kemudian Nabi shallallahu 'alaihi wasallam mengucapkan salam pada mereka lalu berhenti dan turun, Nabi shallallahu 'alaihi wasallam mengajak mereka menuju Allah sambil membacakan al-Qur'an kepada mereka. 'Abdullah bin Ubay bin Salul berkata kepada beliau: \"Wahai saudara! Sesungguhnya apa yang kamu katakan tidak ada kebaikannya sedikit pun, bila apa yang kau katakan itu benar, maka janganlah kamu mengganggu kami di majlis ini, silahkan kembali ke kendaraan anda, lalu siapa saja dari kami mendatangi anda, silahkan anda bercerita padanya.\" Abdullah bin Rawahah berkata; \"Wahai Rasulullah, bergabunglah dengan kami di majlis ini karena kami menyukai hal itu.\" Maka Kaum muslimin, orang-orang musyrik dan orang-orang Yahudi pun saling mencaci hingga mereka hendak saling menyerang, Nabi shallallahu 'alaihi wasallam terus menenangkan mereka hingga mereka semuanya diam, kemudian beliau naik kendaraan hingga masuk ke kediaman Sa'd bin 'Ubadah, lalu beliau bersabda: \"Hai Sa'd! Apa kau tidak mendengar ucapan Abu Hubab?\" maksud beliau tentang ucapan 'Abdullah bin Ubay. Beliau bersabda: \"Dia telah mengatakan ini dan ini.\" Sa'ad berkata; \"Maafkan dia wahai Rasulullah dan berlapang dadalah kepadanya, demi Allah, Allah telah memberi anda apa yang telah diberikan pada anda. (dahulu) Penduduk telaga ini (penduduk Madinah -red) bersepakat untuk memilihnya dan mengangkatnya, namun karena kebenaran yang diberikan kepada anda itu muncul, sehingga menghalanginya (Abdullah bin Ubay) menjabat sebagai pemimpin, maka seperti itulah perbuatannya sebagaimana yang anda lihat.\" Akhirnya beliau pun mema'afkannya",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6255,
			"arabicnumber": 6255,
			"text": "Telah menceritakan kepada kami [Abu Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari [Abdurrahman bin Abdullah bin Ka'b] bahwa [Abdullah bin Ka'b] berkata; saya medengar [Ka'b bin Malik] bercerita ketika dia tidak mengikuti perang tabuk (tanpa udzur), Rasulullah shallallahu 'alaihi wasallam melarang berbicara kepada kami, kemudian aku medatangi Rasulullah shallallahu 'alaihi wasallam, aku memberi salam kepadanya, dalam hatiku berkata; \"Apakah beliau menggerak-gerakkan bibirnya untuk menjawab salam ataukah tidak, hingga hal itu berlangsung genap lima puluh malam, setelah itu barulah Nabi shallallahu 'alaihi wasallam mengumumkan penerimaan Allah atas taubat kami setelah shalat shubuh",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6256,
			"arabicnumber": 6256,
			"text": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku ['Urwah] bahwa [Aisyah] radliallahu 'anha berkata; \"Beberapa orang dari kaum Yahudi menemui Rasulullah shallallahu 'alaihi wasallam, mereka berkata; \"Assaamu 'alaika (kebinasaan atasmu).\" Maka aku pun memahami ucapan mereka, spontan aku menjawab; \"'Alaikumus saam walla'nah (semoga atas kalian kebinasaan dan juga laknat).\" maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tenanglah wahai Aisyah, sesungguhnya Allah mencintai kelembutan disetiap perkara.\" Aku berkata; \"Wahai Rasulullah, apakah anda tidak mendengar apa yang diucapkan mereka?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku telah menjawabnya; \"wa'alaikum (dan atas kalian juga)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6257,
			"arabicnumber": 6257,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Abdullah bin Dinar] dari [Abdullah bin Umar] radliallahu 'anhuma bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila orang-orang Yahudi menyalami kalian, bahwa salah seorang dari mereka mengatakan; \"As saamu 'alaika (kebinasaan keatasmu), maka jawablah; \"wa'alaika (dan keatasmu juga)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6258,
			"arabicnumber": 6258,
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami ['Ubaidullah bin Abu Bakr bin Anas] telah menceritakan kepada kami [Anas bin Malik] radliallahu 'anhu dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila ahli kitab menyampaikan salam kepada kalian, maka jawablah; 'wa 'alaikum (dan keatasmu)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6259,
			"arabicnumber": 6259,
			"text": "Telah menceritakan kepada kami [Yusuf bin Buhlul] telah menceritakan kepada kami [Ibnu Idris] dia berkata; telah menceritakan kepadaku [Husain bin Abdurrahman] dari [Sa'd bin 'Ubaidah] dari [Abu Abdurrahman bin As Sulami] dari [Ali] radliallahu 'anhu dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengutusku, Zubair serta Abu Martsad Al Ghanawi, sedangkan kami semua adalah para penunggang kuda, lalu beliau bersabda; \"Berangkatlah kalian hingga tiba di Raudlah Khakh, karena di sana ada seorang wanita musyrik yang membawa surat dari Hatib Bin Abi Balta'ah untuk orang-orang Musyrik, lalu bawalah surat itu kepadaku, \" Ali berkata; \"Akhirnya kami menjumpai wanita itu tengah mengendarai untanya sebagaimana yang disabdakan oleh Rasulullah shallallahu 'alaihi wasallam, Ali berkata; \"Lantas kami langsung bertanya kepadanya; \"Di mana surat yang ada pada kamu?\" dia menjawab; \"Saya tidak membawa surat.\" Kemudian kami menderumkan untanya dan menggeledah kendaraannya, namun kami tidak menemukan sesuatu, kedua sahabatku berkata; \"Kita tidak menemukan suratnya.\" Ali melanjutkan; \"Akupun menjawab; \"Saya yakin bahwa Rasulullah shallallahu 'alaihi wasallam tidak mungkin berdusta, demi Dzat yang aku bersumpah dengan-Nya, jika kamu tidak mau mengeluarkan surat tersebut, maka kami akan menelanjangimu!\" Ali melanjutkan; \"Ketika ia melihat kesungguhanku, dia langsung menggapai ikat pinggangnya -karena ia memakai ikat pinggang dengan secarik kain- dan mengeluarkan surat itu.\" Ali melanjutkan; \"Setelah itu kami membawa surat itu kepada Rasulullah shallallahu 'alaihi wasallam. Beliau lalu berabda: \"Wahai Hatib, apa yang menyebabkanmu berbuat demikian?\" Hatib menjawab; \"Tidaklah aku melakukan seperti ini melainkan aku ingin beriman kepada Allah dan Rasul-Nya, aku tidak akan merubahnya dan tidak pula hendak menggantinya, akan tetapi aku ingin memiliki tangan (orang yang menolong -red) di tengah-tengah suatu kaum, yang dengannya Allah akan membela keluarga dan hartaku, sementara tidak seorangpun dari sahabatmu di sana melainkan ada kaum yang dengannya Allah membela keluarga dan hartanya.\" Beliau menjawab; \"Kamu benar, maka kalian jangan berkata kepadanya kecuali kebaikan.\" Ali melanjutkan; \"Kemudian Umar berkata; \"Wahai Rasulullah, sesungguhnya dia telah berkhianat kepada Allah dan Rasul-Nya dan kaum mukminin, izinkanlah saya memenggal lehernya.\" Ali melanjutkan; \"Maka beliau menjawab; \"Wahai Umar, apa yang kamu ketahui?, padahal Allah telah melihat amalan ahli Badar dan berfirman; 'lakukan apa yang kalian kehendaki sesungguhnya kalian telah di jamin masuk syurga.\" Mendengar itu berlinanglah kedua mata Umar sambil berkata; \"Allah dan Rasul-Nya lebih mengetahui",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6260,
			"arabicnumber": 6260,
			"text": "Telah menceritakan kepada kami [Muhammad bin Muqatil Abu Al Hasan] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku ['Ubaidullah bin Abdullah bin 'Utbah] bahwa [Ibnu Abbas] telah mengabarkan kepadanya bahwa [Abu Sufyan bin Harb] telah mengabarkan kepadanya bahwa Heraklius (raja Ramawi) pernah mengutusnya kepada sekelompok orang orang Quraisy yaitu para pedagang di Syam, setelah itu para pedagang tersebut menemuinya -lalu perawi menyebutkan riawayat hadits, dia berkata; \"Kemudian Heraklius meminta surat Rasulullah shallallahu 'alaihi wasallam, ketika dibaca ternyata di dalamnya tertulis \"BISMILLAHIR RAHMAANIR RAHIIM (dengan nama Allah yang maha pengasih lagi maha penyayang), dari Muhammad hamba Allah dan Rasul-Nya kepada Hiraklius raja Ramawi, salam kesejahteraan bagi yang mengikuti petunjuk, amma ba'du",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6261,
			"arabicnumber": 6261,
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6262,
			"arabicnumber": 6262,
			"text": "Telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah] dari [Sa'd bin Ibrahim] dari [Abu Umamah bin Sahl bin Hunaif] dari [Abu Sa'id] bahwa penduduk Bani Quraidlah telah menetapkan hukum yang akan diputuskan oleh Sa'ad. Maka Nabi shallallahu 'alaihi wasallam mengutus seseorang untuk memanggilnya, ketika dia datang beliau bersabda: \"Berdirilah kalian untuk menghormati orang terbaik kalian -atau beliau bersabda- pemimpin kalian.\" Lalu Sa'd duduk di dekat Nabi shallallahu 'alaihi wasallam, setelah itu beliau melanjutkan: \"Sesungguhnya mereka telah setuju dengan keputusan yang akan kamu tetapkan.\" Sa'ad berkata; \"Aku akan memutuskan kepada mereka agar para tentara perang mereka dibunuh dan anak-anak serta wanita mereka dijadikan tawanan.\" Maka beliau bersabda: \"Sungguh kamu telah memutuskan hukum kepada mereka dengan hukum Allah (Raja diraja).\" Abu Abdullah berkata; \"Sebagian sahabatku telah memahamkanku dari Al Walid dari perkataannya Abu Sa'id hingga perkataan \"…dengan keputusan yang kamu putuskan",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6263,
			"arabicnumber": 6263,
			"text": "Telah menceritakan kepada kami ['Amru bin 'Ashim] telah menceritakan kepada kami [Hammam] dari [Qatadah] dia berkata; aku bertanya kepada [Anas]; \"Apakah diantara para sahabat Nabi shallallahu 'alaihi wasallam sering berjabat tangan?\" dia menjawab; \"Ya",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6264,
			"arabicnumber": 6264,
			"text": "Telah menceritakan kepada kami [Yahya bin Sulaiman] dia berkata; telah menceritakan kepadaku [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Haiwah] dia berkata; telah menceritakan kepadaku [Abu 'Aqil Zuhrah bin Ma'bad] dia mendengar kakeknya [Abdullah bin Hisyam] dia berkata; \"Kami bersama nabi shallallahu 'alaihi wasallam ketika itu beliau tengah menggandeng tangan Umar bin Khatthab",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6265,
			"arabicnumber": 6265,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Saif] dia berkata; saya mendengar [Mujahid] berkata; telah menceritakan kepadaku [Abdullah bin Sahbarah Abu Ma'mar] dia berkata; saya mendengar [Ibnu Mas'ud] berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengajariku tasyahud -sambil menghamparkan kedua telapak tangannya- sebagaimana beliau mengajariku surat Al Qur'an, yaitu; \"AT-TAHIYYATUT LILLAHI WASH-SHALAWAATU WATH-THAYYIBAATU, ASSALAAMU 'ALAIKA AYYUHAN-NABIYYU WA RAHMATULLAHI WA BARAKAATUH, ASSALAAMU 'ALAINAA WA 'ALA 'IBAADILLAAHISH-SHAALIHIIN, ASYHADU ALLAA ILAAHA ILLALLAAH WA ASYHADU ANNA MUHAMMADAN ABDUHU WA RASUULUH (penghormatan, rahmat dan kebaikan hanya untuk Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah kecuali Allah, dan Muhammad adalah hamba dan utusan-Nya). Yaitu ketika beliau masih hidup bersama kami, namun ketika beliau telah meninggal, kami mengucapkan; \"Assalaamu maksudnya atas Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6266,
			"arabicnumber": 6266,
			"text": "Telah menceritakan kepada kami [Ishaq] telah mengabarkan kepada kami [Bisyr bin Syu'aib] telah menceritakan kepadaku [Ayahku] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku [Abdullah bin Ka'b] bahwa [Abdullah bin Abbas] telah mengabarkan kepadanya, bahwa [Ali yaitu Ibnu Abu Thalib] pergi dari sisi Nabi shallallahu 'alaihi wasallam. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami ['Anbasah] telah menceritakan kepada kami [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku [Abdullah bin Ka'b bin Malik] bahwa [Abdullah bin Abbas] telah mengabarkan kepadanya; bahwa [Ali bin Abu Thalib] radliallahu 'anhu keluar dari sisi Nabi shallallahu 'alaihi wasallam disaat beliau sakit yang menyebabkan beliau meninggal, maka orang-orang bertanya; \"Wahai Abu Hasan, bagaimana keadaan Rasulullah shallallahu 'alaihi wasallam?\" Ia menjawab; \"Alhamdulillah beliau sudah agak baikan.\" Lalu Abbas memegang tangannya dan berkata; \"Demi Allah, tidakkah engkau lihat? Sesungguhnya aku mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam akan wafat karena sakitnya ini. Sesungguhnya aku juga mengetahui wajah bani Abdul Muththalib ketika menghadapi kematiannya. Mari kita menemui Rasulullah shallallahu 'alaihi wasallam, lalu kita tanyakan kepada siapa perkara (kepemimpinan) ini akan diserahkan? Jika kepada (orang) kita, maka kita mengetahuinya dan jika (diserahkan) kepada selain kita maka kita akan menyuruh beliau supaya mewasiatkannya pada kita.\" Lalu Ali radliallahu 'anhu berkata; \"Demi Allah, bila kita memohonnya kepada Rasulullah shallallahu 'alaihi wasallam lalu beliau menolak, maka selamanya orang-orang tidak akan memberikannya kepada kita. Karena itu, aku tidak akan pernah menanyakan kepada Rasulullah shallallahu 'alaihi wasallam selamanya",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6267,
			"arabicnumber": 6267,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Anas] dari [Mu'adz] dia berkata; \"Aku pernah membonceng Nabi shallallahu 'alaihi wasallam lalu beliau bersabda: \"Wahai Mu'adz!.\" Aku menjawab; \"Ya, saya memenuhi panggilan anda.\" Beliau bersabda seperti itu hingga tiga kali, lalu beliau melanjutkan: \"Apakah kamu tahu hak Allah atas hamba-Nya?\" Aku menjawab; \"Tidak.\" Beliau bersabda: \"Hak Allah atas hamba-Nya adalah hendaknya mereka beribadah kepada-Nya dan tidak menyekutukan-Nya dengan suatu apapun.\" Kemudian beliau melanjutkan perjalanannya sesaat lalu bersabda lagi: \"Wahai Mu'adz!.\" Jawabku; \"Ya, aku penuhi panggilanmu.\" Beliau bersabda: \"Apakah kamu tahu hak hamba atas Allah jika hamba tersebut melaksanakan hal itu?, yaitu Allah tidak akan menyiksa mereka.\" Telah menceritakan kepada kami [Hudbah] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Anas] dari [Mu'adz] dengan hadits ini",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6268,
			"arabicnumber": 6268,
			"text": "Telah menceritakan kepada kami [Umar bin Hafsh] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada kami [Zaid bin Wahb] demi Allah, telah menceritakan kepada kami [Abu Dzar] ketika berada di Rabdzah, dia berkata; \"Aku pernah jalan-jalan bersama Nabi shallallahu 'alaihi wasallam di Harrah Madinah (tempat yang banyak bebatuan hitam) saat malam hari, lalu kami menghadap ke arah gunung Uhud, beliau pun bersabda: \"Wahai Abu Dzar! Aku tidak suka bila emas sebesar gunung Uhud itu menjadi milikku dan bermalam di rumahku hingga tiga malam, kemudan aku mempunyai satu dinar darinya, kecuali satu dinar tersebut akan kupersiapkan untuk membayar hutangku. Lalu aku akan mengatakannya pada hamba-hamba Allah begini, begini dan begini.\" -Beliau lantas mendemontrasikan dengan genggaman tangannya. Beliau bersabda: \"Wahai Abu Dzar, sungguh orang-orang yang berbanyak-banyak (mengumpulkan harta) akan menjadi sedikit (melarat) pada hari kiamat, kecuali orang yang berkata seperti ini, dan seperti ini!\" lalu beliau bersabda kepadaku: \"Wahai Abu Dzar, kamu tunggu di sini hingga aku datang.\" \"Setelah itu beliau pergi hingga hilang dari pandanganku, lalu aku mendengar gemuruh suara, dan aku khawatir jangan-jangan terjadi sesuatu terhadap Rasulullah shallallahu 'alaihi wasallam, serentak aku hendak pergi, namun aku segera teringat sabda Rasulullah shallallahu 'alaihi wasallam \"Tunggulah kamu di sini, \" maka aku pun segera diam di tempat, lalu aku berkata; \"Wahai Rasulullah, tadi aku mendengar suaru gemuruh, dan aku khawatir akan terjadi sesuatu kepada anda, lalu aku segera teringat pesan anda, maka aku tetap diam di tempat.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Itu adalah Jibril, ia datang dan memberitahukan kepadaku bahwa 'siapa saja yang mati dari ummatku dan tidak mensekutukan Allah dengan sesuatu pun, maka ia akan masuk ke surga'.\" Aku lalu bertanya, \"Wahai Rasulullah, walaupun ia berzina dan mencuri?\" Beliau menjawab: \"Walaupun berzina dan mencuri.\" Aku lalu berkata kepada Zaid telah sampai kepadaku bahwa dia adalah Abu Darda`, lalu Zaid mengatakan; \"Aku bersaksi bahwa yang menceritakan itu kepadaku adalah Abu Dzar ketika di Rabdzah. [A'masy] berkata; telah menceritakan kepadaku [Abu Shalih] dari [Abu Darda`] seperti hadits di atas, dan [Abu Syihab] berkata; dari [Al A'masy] bahwa dia pernah menginap di tempatku selama lebih dari tiga hari",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6269,
			"arabicnumber": 6269,
			"text": "Telah menceritakan kepada kami [Isma'il bin Abdullah] dia berkata; telah menceritakan kepadaku [Malik] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhuma dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah seseorang membangunkan orang lain dari tempat duduknya kemudian ia duduk di situ",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6270,
			"arabicnumber": 6270,
			"text": "Telah menceritakan kepada kami [Khallad bin Yahya] telah menceritakan kepada kami [Sufyan] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam bahwa beliau melarang seseorang membangunkan orang lain dari tempat duduknya, lalu dia duduk di situ, akan tetapi hendaknya ia mengatakan; \"Geser dan berlapang-lapanglah.\" Dan Ibnu Umar sendiri membenci seseorang yang membangunkan orang lain dari tempat duduknya, lalu dia duduk di situ",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6271,
			"arabicnumber": 6271,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Umar] telah menceritakan kepada kami [Mu'tamir] saya mendengar [Ayahku] bahwa dia menyebutkan dari [Abu Mijlaz] dari [Anas bin Malik] radliallahu 'anhu dia berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam menikah dengan Zainab binti Jahsy, beliau mengundang orang-orang untuk menikmati jamuan, kemudian mereka duduk-duduk dan berbincang-bincang.\" Anas melanjutkan ceritanya; \"Kemudian beliau merubah posisi seakan-akan hendak berdiri, namun orang-orang tidak juga berdiri, ketika beliau berdiri, maka orang-orang pun ikut berdiri bersama beliau, hingga tinggal tiga orang. Sesungguhnya Nabi shallallahu 'alaihi wasallam datang untuk masuk ke kamar, namun orang-orang masih saja duduk-duduk, selepas itu akhirnya mereka beranjak dan pergi. Tinggalah tiga orang yang masih duduk. Nabi shallallahu 'alaihi wasallam datang dan hendak masuk (ke kamar Zainab), namun tiga orang tersebut masih tetap duduk-duduk, setelah itu mereka berdiri dan beranjak pergi. Anas berkata; Lalu saya mengabarkan kepada Nabi shallallahu 'alaihi wasallam bahwa mereka sudah beranjak pergi.\" Kemudian beliau datang dan masuk, maka saya pun mengikuti beliau masuk, lantas beliau menurunkan kain tirainya antara saya dengan beliau.\" Lalu Allah Ta'ala menurunkan (ayat): Hai orang-orang yang beriman, janganlah kamu memasuki rumah- rumah nabi kecuali bila kamu diizinkan -hingga firman Allah- Sesungguhnya perbuatan itu adalah amat besar (dosanya) di sisi Allah.\" (Al Ahzab: 53)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6272,
			"arabicnumber": 6272,
			"text": "Telah menceritakan kepada kami [Muhammad bin Abu Ghalib] telah mengabarkan kepada kami [Ibrahim bin Al Mundzir Al Khizami] telah menceritakan kepada kami [Muhammad bin Fulaih] dari [Ayahnya] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhuma dia berkata; \"Saya melihat Rasulullah shallallahu 'alaihi wasallam berada di serambi Ka'bah duduk ihtiba` dengan tangannya seperti ini",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6273,
			"arabicnumber": 6273,
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6274,
			"arabicnumber": 6274,
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6275,
			"arabicnumber": 6275,
			"text": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Umar bin Sa'id] dari [Ibnu Abu Mulaikah] bahwa [Uqbah bin Al Harits] telah menceritakan kepadanya, ia berkata; \"Nabi shallallahu 'alaihi wasallam pernah mengerjakan shalat Ashar setelah itu beliau segera masuk ke rumah",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6276,
			"arabicnumber": 6276,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Adl Dluha] dari [Masruq] dari [Aisyah] radliallahu 'anha dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan shalat di atas kasur, sementara aku terlentang antara beliau dan Kiblat, ketika itu aku hendak buang hajat, dan aku tidak suka jika berdiri, hingga akhirnya aku menghadap beliau dan mundur secara pelan-pelan",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6277,
			"arabicnumber": 6277,
			"text": "Telah menceritakan kepada kami [Ishaq] telah menceritakan kepada kami [Khalid]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Abdullah bin Muhammad] telah menceritakan kepada kami ['Amru bin 'Aun] telah menceritakan kepada kami [Khalid] dari [Khalid] dari [Abu Qilabah] dia berkata; telah mengabarkan kepadaku [Abu Al Malih] dia berkata; \"Aku bersama ayahmu Zaid pernah menemui [Abdullah bin 'Amru] kemudian dia menceritakan kepada kami bahwa Nabi shallallahu 'alaihi wasallam pernah mendengar kabar tentang puasaku, lalu beliau menemuiku, maka aku langsung menghamparkan bantal kulit yang dalamnya terbuat dari serabut, namun beliau duduk di atas tanah, hingga bantal tersebut berada antara aku dan beliau, beliau bersabda kepadaku: 'Tidakkah cukup bagimu (berpuasa) tiga hari setiap bulan? ' Jawabku; 'Wahai Rasulullah (aku mampu lebih dari itu -red).' Beliau bersabda: 'Kalau begitu lima hari (setiap bulan).' Jawabku; 'Wahai Rasulullah (aku masih mampu lebih dari itu -red).' Beliau bersabda: 'Kalau begitu tujuh hari (setiap bulan).' Jawabku; 'Wahai Rasulullah (aku mampu lebih dari itu -red).' Beliau bersabda: 'Kalau begitu sebelas hari (setiap bulan).' Aku berkata; 'Wahai Rasulullah, (aku mampu lebih dari itu).' Beliau bersabda: 'Tidak ada puasa lebih dari puasanya (nabi) Daud yaitu setengah masa, puasa sehari dan berbuka sehari",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6278,
			"arabicnumber": 6278,
			"text": "Telah menceritakan kepada kami [Yahya bin Ja'far] telah menceritakan kepada kami [Yazid] dari [Syu'bah] dari [Mughirah] dari [Ibrahim] dari ['Alqamah] bahwa dia pernah datang ke negeri Syam. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah] dari [Mughirah] dari [Ibrahim] dia berkata; [Alqamah] pernah pergi ke Syam, lalu dia masuk Masjid, shalat dua raka'at dan berdo'a; \"Ya Allah, limpahkanlah kepadaku untuk mendapatkan teman yang shalih.\" Kemudian dia bermajelis bersama Abu Ad-Darda', Maka Abu Ad-Darda' bertanya; 'Dari manakah asalmu? ' Alqamah menjawab; 'Dari Kufah.' [Abu Ad-Darda'] berkata; 'Bukankah kalian diantara kalian terdapat orang yang mengetahui rahasia Nabi shallallahu 'alaihi wasallam yang tidak ada orang lain mengetahuinya kecuali dia, yaitu Hudzaifah? Bukankah diantara kalian terdapat juga orang yang telah Allah jauhkan dari setan melalui lisan Nabi-Nya shallallahu 'alaihi wasallam, yaitu 'Ammar? Bukankah diantara kalian terdapat juga orang yang dikenal sebagai pemilik siwak dan bantal yaitu Ibnu Mas'ud? Bagaimanakah Abdullah membaca firman Allah: ('Wal laili idzaa yaghsyaa')? Maka menjawab; 'Wadz dzkari wal untsaa.' Abu Ad-Darda' berkata; 'Masih saja orang-orang seperti itu hingga mereka membuatku ragu dengan sesuatu yang pernah aku dengar dari Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6279,
			"arabicnumber": 6279,
			"text": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah menceritakan kepada kami [Sufyan] dari [Abu Hazim] dari [Sahl bin Sa'd] dia berkata; \"Kami sering qalilulah (tidur siang) dan makan siang setelah Jum'at",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6280,
			"arabicnumber": 6280,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [Abu Hazim] dari [Sahl bin Sa'd] dia berkata; \"Tidak ada nama (julukan) yang paling disukai Ali selain Abu Turab, dan dia sangat senang bila dipanggil dengan nama tersebut, suatu ketika Rasulullah shallallahu 'alaihi wasallam datang ke rumah Fatimah 'alaihis salam, namun beliau tidak menjumpai Ali di rumahnya. Maka beliau bertanya; 'Di manakah anak pamanmu? ' Fatimah menjawab; 'Sebenarnya antara saya dan dia ada permasalahan, malah dia memarahiku. Setelah itu, ia keluar dan enggan beristirahat siang di sini.' Lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepada seseorang; 'Lihatlah, di manakah dia berada! ' Tidak lama kemudian, orang tersebut datang dan berkata; 'Wahai Rasulullah, sekarang dia tengah tidur di masjid.' Setelah itu Rasulullah shallallahu 'alaihi wasallam mendatangi Ali ketika ia sedang berbaring, sementara kain selendangnya jatuh dari lambungnya hingga banyak debu yang menempel (di badannya). Kemudian Rasulullah mengusapnya seraya bersabda: 'Bangunlah hai Abu Turab! Bangunlah hai Abu Turab",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6281,
			"arabicnumber": 6281,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'd] telah menceritakan kepada kami [Muhammad bin Abdullah Al Anshari] dia berkata; telah menceritakan kepadaku [Ayahku] dari [Tsumamah] dari [Anas] bahwa Ummu Sulaim, bahwa dia biasa membentangkan tikar dari kulit untuk Nabi shallallahu 'alaihi wasallam, lalu beliau istirahat siang di atas tikar tersebut, Anas melanjutkan; \"Apabila Nabi shallallahu 'alaihi wasallam telah tidur, maka Ummu Sulaim mengambil keringat dan rambutnya yang terjatuh dan meletakkannya di wadah kaca, setelah itu ia mengumpulkannya di sukk (ramuan minyak wangi), Tsumamah berkata; 'Ketika Anas bin Malik hendak meninggal dunia, maka dia berwasiat supaya ramuan tersebut dicampurkan ke dalam hanuth (ramuan yang digunakan untuk meminyaki mayyit), akhirnya ramuan tersebut diletakkan di hanuth (ramuan yang digunakan untuk meminyaki mayyit)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6283,
			"arabicnumber": 6283,
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6284,
			"arabicnumber": 6284,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['Atha` bin Yazid Al Laitsi] dari [Abu Sa'id Al Khudri] radliallahu 'anhu dia berkata; Nabi shallallahu 'alaihi wasallam melarang mengenakan dua pakaian dan dua transaksi jual beli, yaitu; isytimalus shama', (menggantungkan pakaiannya disalah satu pundaknya dan membuka salah satu betisnya tanpa mengenakan pakaian lainnya), dan duduk dengan menempelkan lutut ke dada sambil mengenakan pakaian, hingga menyebabkan auratnya terbuka). Dan melarang mulamasah (seseorang yang memegang pakaian orang lain tanpa memeriksanya terlebih dahulu) dan Munabadzah (seseorang melempar pakaiannya ke orang lain atau sebaliknya, lalu terjadilah transaksi jual beli tanpa boleh memeriksanya terlebih dahulu).\" Hadits ini juga diperkuat oleh riwayat [Ma'mar] dan [Muhammad bin Abu Hafshah] serta [Abdullah bin Budail] dari [Az Zuhri]",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6286,
			"arabicnumber": 6286,
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6287,
			"arabicnumber": 6287,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Az Zuhri] dia berkata; telah mengabarkan kepadaku ['Abbad bin Tamim] dari [Pamannya] dia berkata; \"Saya pernah melihat Rasulullah shallallahu 'alaihi wasallam tidur terlentang di masjid sambil menumpukan salah satu kakinya di atas kakinya yang lain",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6288,
			"arabicnumber": 6288,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Isma'il] dia berkata; telah menceritakan kepadaku [Malik] dari [Nafi'] dari [Abdullah] radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian bertiga, maka janganlah dua orang berbisik-bisik dengan membiarkan yang ketiganya",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6289,
			"arabicnumber": 6289,
			"text": "Telah menceritakan kepada kami [Abdullah bin Shabah] telah menceritakan kepada kami [Mu'tamir bin Sulaiman] dia berkata; saya mendengar [Ayahku] dia berkata; saya mendengar [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam pernah membisikkan suatu perkara rahasia kepadaku, maka hal itu aku tidak akan kuceritakan kepada siapapun. Dan sungguh Ummu Sulaim pun pernah bertanya tentang rahasia tersebut, namun aku tidak menceritakannya",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6290,
			"arabicnumber": 6290,
			"text": "Telah menceritakan kepada kami [Utsman] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Wa`il] dari [Abdullah] radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila kalian bertiga, maka janganlah dua orang berbisik-bisik tanpa menyertakan yang ketiga sebelum ia berbaur dengan yang lain, karena hal itu dapat menyinggung perasaannya",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6291,
			"arabicnumber": 6291,
			"text": "Telah menceritakan kepada kami ['Abdan] dari [Abu Hamzah] dari [Al A'masy] dari [Syaqiq] dari [Abdullah] dia berkata; \"Suatu hari Nabi shallallahu 'alaihi wasallam pernah membagi-bagi suatu pembagian, lalu seorang laki-laki dari Anshar berkata; \"Sungguh pembagian ini tidak dimaksudkan untuk mengharap ridla Allah\". Lalu aku berkata; 'Demi Allah, sungguh aku akan mendatangi Nabi shallallahu 'alaihi wasallam, lalu aku pun menemui beliau ketika beliau bersama orang-orang, dan membisikkannya kepada beliau.' Maka beliau marah hingga aku lihat tampak kemarahan pada wajah beliau. Beliau lalu bersabda: 'Semoga Allah merahmati Musa, karena dia biasa disakiti lebih banyak dari ini dan dia tetap shabar",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6292,
			"arabicnumber": 6292,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abdul Aziz] dari [Anas] radliallahu 'anhu dia berkata; \"Iqamah telah dikumandangkan, sementara ada seorang laki-laki yang masih berbisik dengan Rasulullah shallallahu 'alaihi wasallam, dan orang itu masih saja berbicara dengan beliau hingga sebagian dari para sahabatnya tidur. Setelah itu beliau bangun dan shalat",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6293,
			"arabicnumber": 6293,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] dari [Salim] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah kalian meninggalkan api (dalam keadaan menyala) di rumah kalian ketika kalian tidur",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6294,
			"arabicnumber": 6294,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al A'Ala`] telah menceritakan kepada kami [Abu Usamah] dari [Buraid bin Abdullah] dari [Abu Burdah] dari [Abu Musa] radliallahu 'anhu dia berkata; \"Pada suatu malam salah satu rumah penduduk Madinah terbakar ketika penghuninya tertidur. Ketika hal itu diceritakan kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya api adalah musuh kalian, karena itu bila kalian hendak tidur, maka padamkanlah ia lebih dahulu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6295,
			"arabicnumber": 6295,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hammad] dari [Katsir yaitu Ibnu Syindzir] dari ['Atha`] dari [Jabir bin Abdullah] radliallahu 'anhuma dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tutuplah tempat air kalian, pintu rumah kalian, dan matikanlah lampu kalian, karena binatang-binatang berbahaya bila datang dapat menarik sumbu lampu sehingga dapat berakibat kebakaran yang menyebabkan terbunuhnya para penghuni rumah",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6296,
			"arabicnumber": 6296,
			"text": "Telah menceritakan kepada kami [Hasan bin Abu 'Abbad] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami ['Atha`] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Matikanlah lampu-lampu kalian pada malam hari jika kalian tidur dan tutuplah tempat air kalian serta wadah makanan dan minuman kalian.\" Hammam mengatakan; dan aku kira Atha' juga mengatakan; \"Walaupun hanya dengan sesuatu yang dapat menutupinya",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6297,
			"arabicnumber": 6297,
			"text": "Telah menceritakan kepada kami [Yahya bin Qaza'ah] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dari [Abu Hurairah] radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"(Sunah) fitrah itu ada lima, yaitu; khitan, mencukur bulu kemaluan, mencabut bulu ketiak, mencukur kumis dan memotong kuku",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6298,
			"arabicnumber": 6298,
			"text": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib bin Abu Hamzah] telah menceritakan kepada kami [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Nabi) Ibrahim berkhitan setelah berusia delapan puluh tahun dan beliau khitan dengan menggunakan kampak.\" Abu Abdullah berkata; telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Mughirah] dari [Abu Az Zinad]. Dan perkataanya di Qaddum dengan menggunakan tasydid (dalnya), maksudnya suatu tempat (di Halb atau Aleppo)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6299,
			"arabicnumber": 6299,
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdurrahim] telah mengabarkan kepada kami ['Abbad bin Musa] telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Isra`il] dari [Abu Ishaq] dari [Sa'id bin Jubair] dia berkata; [Ibnu Abbas] ditanya; \"Seperti apakah kamu ketika Nabi shallallahu 'alaihi wasallam wafat?\" Dia menjawab; 'Waktu itu saya telah dikhitan.' Dia juga berkata; 'Dan orang-orang tidak dikhitan kecuali setelah mereka dewasa (baligh).' Dan berkata [Ibnu Idris] dari [ayahnya] dari [Abu Ishaq] dari [sa'id bin Jubair] dari [Ibnu Abbas] ketika Nabi shallallahu 'alaihi wasallam wafat saya telah dihitan",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6300,
			"arabicnumber": 6300,
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6301,
			"arabicnumber": 6301,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku [Humaid bin Abdurrahman] bahwa [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa diantara kalian bersumpah dengan Laata dan Uzza, hendaknya ia segera mengucapkan; 'Laa ilaaha illallah (tiada ilah yang berhak diibadahi kecuali Allah).' Dan barangsiapa mengatakan kepada saudaranya; 'Mari kita taruhan.' Hendaknya ia segera bersedekah",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6302,
			"arabicnumber": 6302,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Ishaq yaitu Ibnu Sa'id] dari [Sa'id] dari [Ibnu Umar] radliallahu 'anhuma dia berkata; \"Aku pernah bermimpi membangun suatu bangunan bersama Nabi shallallahu 'alaihi wasallam yang dapat melindungiku dari hujan dan terik Matahari, dan tidak ada satupun dari Makhluk Allah yang membantuku (selain beliau shallallahu 'alaihi wasallam)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6303,
			"arabicnumber": 6303,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan], ['Amru] mengatakan; [Ibnu Umar] mengatakan; \"Aku tidak pernah membangun suatu bangunan dan tidak juga menanam pohon kurma setelah Nabi shallallahu 'alaihi wasallam wafat.\" Sufyan mengatakan; 'Lalu hal itu aku memberitahukan kepada sebagian keluarganya, namun dia mengatakan; 'Demi Allah, sungguh dia pernah membangun (suatu bangunan).' Sufyan mengatakan; aku berkata; 'Semoga saja Ibnu Umar mengatakan hadits tersebut sebelum dia membangun (suatu bangunan)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 75
			}
		}
	]
}