{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6304,
			"arabicnumber": 6304,
			"text": "Telah menceritakan kepada kami [Isma'il] dia berkata; telah menceritakan kepadaku [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap Nabi mempunyai doa yang telah dikabulkan, sedang aku ingin menyimpan doaku sebagai syafa'at untuk umatku di Akhirat nanti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6305,
			"arabicnumber": 6305,
			"text": "[Khalifah] pernah berkata kepadaku; [Mu'tamar] mengatakan; saya mendengar [Ayahku] dari [Anas] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Setiap Nabi pernah meminta suatu permintaan -atau beliau bersabda- setiap Nabi mempunyai doa yang telah dikabulkan, sedang aku ingin menyimpan do'aku sebagai syafa'at untuk umatku di hari Kiamat nanti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6306,
			"arabicnumber": 6306,
			"text": "Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami [Abdul Warits] telah menceritakan kepada kami [Al Husain] telah menceritakan kepada kami [Abdullah bin Buraidah] dia berkata; telah menceritakan kepadaku [Busyair bin Ka'b Al 'Adawi] dia berkata; telah menceritakan kepadaku [Syaddad bin Aus] radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam; \"Sesungguhnya istighfar yang paling baik adalah; kamu mengucapkan: 'ALLAHUMMA ANTA RABBI LAA ILAAHA ILLA ANTA KHALAQTANI WA ANA 'ABDUKA WA ANA 'ALA 'AHDIKA WA WA'DIKA MASTATHA'TU A'UUDZU BIKA MIN SYARRI MAA SHANA'TU ABUU`U LAKA BIDZANBI WA ABUU`U LAKA BINI'MATIKA 'ALAYYA FAGHFIRLI FA INNAHU LAA YAGHFIRU ADZ DZUNUUBA ILLA ANTA (Ya Allah, Engkau adalah Tuhanku, tidak ada Tuhan yang berhak diibadahi selain Engkau. Engkau telah menciptakanku dan aku adalah hamba-Mu. Aku menetapi perjanjian-Mu dan janji-Mu sesuai dengan kemampuanku. Aku berlindung kepada-Mu dari keburukan perbuatanku, aku mengakui dosaku kepada-Mu dan aku akui nikmat-Mu kepadaku, maka ampunilah aku. Sebab tidak ada yang dapat mengampuni dosa selain-Mu) '.\" Beliau bersabda: 'Jika ia mengucapkan di waktu siang dengan penuh keyakinan lalu meninggal pada hari itu sebelum waktu sore, maka ia termasuk dari penghuni surga. Dan jika ia membacanya di waktu malam dengan penuh keyakinan lalu meninggal sebelum masuk waktu pagi, maka ia termasuk dari penghuni surga",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6307,
			"arabicnumber": 6307,
			"text": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku [Abu Salamah bin Abdurrahman] dia berkata; [Abu Hurairah] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Allah, sesungguhnya aku beristighfar (meminta ampunan) dan bertaubat kepada Allah dalam satu hari lebih dari tujuh puluh kali",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6308,
			"arabicnumber": 6308,
			"text": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Abu Syihab] dari [Al A'masy] dari ['Umarah bin 'Umair] dari [Al Harits bin Suwaid] telah menceritakan kepada kami [Abdullah bin Mas'ud] mengenai dua hadits, salah satunya dari Nabi shallallahu 'alaihi wasallam dan yang lain dari dia sendiri, dia berkata; \"Sesungguhnya orang mukmin melihat dosa-dosanya seperti ia duduk di pangkal gunung, ia khawatir gunung itu akan menimpanya, sedangkan orang fajir (selalu berbuat dosa) melihat dosa-dosanya seperti lalat yang menempel di batang hidungnya, kemudian ia mengusirnya seperti ini lalu terbang.\" Abu Syihab mengisyaratkan dengan tangannya di atas hidungnya. Dia juga berkata; 'Allah merasa gembira karena taubatnya seorang hamba melebihi kegembiraan seseorang yang tengah singgah di suatu tempat yang mencekam dengan ditemani hewan tunggangannya, perbekalan makanan dan minuman berada bersama tunggangannya, kemudian ia meletakkan kepalanya lalu tertidur. Ketika ia terbangun dari tidurnya, ternyata hewan tunggangannya terlepas dengan membawa perbekalan makanan dan minumannya, hingga ketika ia merasa sangat panas dan haus, atau seperti yang dikehendaki Allah, ia pun berkata; 'Sebaiknya aku kembali saja ke tempat tidurku semula.' Kemudian ia kembali dan tertidur. Ketika ia mengangkat kepalanya, ternyata hewan tunggangannya telah berada di sisinya.' Hadits ini juga diperkuat oleh [Abu 'Awanah] dan [Jarir] dari [Al A'masy]. [Abu Usamah] berkata; telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada kami ['Umarah] saya mendengar [Al Harits]. Dan [Syu'bah], Abu Muslim yaitu ['Ubaidullah Al Kufi] pengawalnya Al A'masy juga berkata; dari [Al A'masy] dari [Ibrahim At Taimi] dari [Al Harits bin Suwaid]. [Abu Mu'awiyah] berkata; telah menceritakan kepada kami [Al A'masy] dari ['Umarah] dari [Al Aswad] dari [Abdullah] dan dari [Ibrahim At Taimi] dari [Al Harits bin Suwaid] dari [Abdullah]",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6309,
			"arabicnumber": 6309,
			"text": "Telah menceritakan kepada kami [Ishaq] telah menceritakan kepada kami [Habban] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] telah menceritakan kepada kami [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Hudbah] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Anas] radliallahu 'anhu dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah lebih gembira dengan taubat hamba-Nya melebihi salah seorang dari kalian yang mendapatkan hewan tunggangannya yang telah hilang di padang yang luas",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6310,
			"arabicnumber": 6310,
			"text": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Hisyam bin Yusuf] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] radliallahu 'anha, bahwa Nabi shallallahu 'alaihi wasallam biasa mengerjakan shalat malam sebelas raka'at, apabila terbit fajar, beliau shalat dua raka'at ringan, lalu beliau berbaring ke sebelah kanan hingga mu'adzin datang untuk mengumandangkan adzan",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6311,
			"arabicnumber": 6311,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Mu'tamir] dia berkata; saya mendengar [Manshur] dari [Sa'd bin Ubaidah] dia berkata; telah menceritakan kepadaku [Al Barra` bin 'Azib] radliallahu 'anhuma dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Apabila kamu hendak tidur, maka berwudlulah sebagaimana kamu berwudlu untuk shalat. Setelah itu berbaringlah dengan miring ke kanan, dan ucapkanlah: 'ALLAHUMMA ASLAMTU NAFSI ILAIKA WAFAWADLTU AMRII ILAIKA WA ALJA`TU ZHAHRI ILAIKA RAHBATAN WA RAGHBATAN ILAIKA LAA MALJA`A WALAA MANJAA MINKA ILLA ILAIKA AMANTU BIKITAABIKA ALLADZII ANZALTA WA BINABIYYIKA ALLADZII ARSALTA (Ya AIlah ya Tuhanku, aku berserah diri kepada-Mu, aku serahkan urusanku kepada-Mu dan aku berlindung kepada-Mu dalam keadaan harap dan cemas, karena tidak ada tempat berlindung dan tempat yang aman dari adzab-Mu kecuali dengan berlindung kepada-Mu. Aku beriman kepada kitab-Mu yang telah Engkau turunkan dan aku beriman kepada Nabi-Mu yang telah Engkau utus).' Apabila kamu meninggal (pada malam itu) maka kamu mati dalam keadaan fitrah (suci). Dan jadikan bacaan tersebut sebagai penutup ucapanmu (menjelang tidur).' Maka aku berkata; 'Apakah saya menyebutkan; 'Saya beriman kepada Rasul-Mu yang telah Engkau utus? ' Beliau menjawab: 'Tidak, namun saya beriman kepada Nabi-Mu yang telah Engkau utus",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6312,
			"arabicnumber": 6312,
			"text": "Telah menceritakan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Abdul Malik] dari [Rib'i bin Hirasy] dari [Hudzaifah bin Yaman] dia berkata; \"Apabila Nabi shallallahu 'alaihi wasallam hendak tidur, beliau mengucapkan: 'Bismika amuutu wa ahya (Dengan nama-Mu aku mati dan aku hidup).' Dan apabila bangun tidur, beliau mengucapkan: \"Al Hamdulillahilladzii ahyaana ba'da maa amatana wailaihi nusyur (Segala puji bagi Allah yang telah menghidupkan kami setelah mematikan kami, dan kepada-Nya lah tempat kembali)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6313,
			"arabicnumber": 6313,
			"text": "Telah menceritakan kepada kami [Sa'id bin Ar Rabi'] dan [Muhammad bin 'Ar'arah] keduanya berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dia mendengar [Al Barra` bin 'Azib] bahwa Nabi shallallahu 'alaihi wasallam pernah memerintahkan seorang laki-laki…\" dan driwayatkan dari jalur lain, telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abu Ishaq Al Hamdani] dari [Al Barra` bin 'Azib] bahwa Nabi shallallahu 'alaihi wasallam pernah mewasiatkan kepada seseorang, beliau bersabda: 'Apabila kamu hendak tidur, maka ucapkanlah; 'ALLAHUMMA ASLAMTU NAFSI ILAIKA WAFAWADLTU AMRII ILAIKA WA ALJA`TU ZHAHRI ILAIKA RAHBATAN WA RAGHBATAN ILAIKA LAA MALJA`A WALAA MANJAA MINKA ILLA ILAIKA AMANTU BIKITAABIKA ALLADZII ANZALTA WA BINABIYYIKA ALLADZII ARSALTA (Ya AIlah ya Tuhanku, aku berserah diri kepada-Mu, aku serahkan urusanku kepada-Mu dan aku berlindung kepada-Mu dalam keadaan harap dan cemas, karena tidak ada tempat berlindung dan tempat yang aman dari adzab-Mu kecuali dengan berlindung kepada-Mu. Aku beriman kepada kitab-Mu yang telah Engkau turunkan dan aku beriman kepada Nabi-Mu yang telah Engkau utus).' Apabila kamu meninggal (pada malam itu) maka kamu meninggal dalam keadaan fitrah (suci)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6314,
			"arabicnumber": 6314,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Abu 'Awanah] dari [Abdul Malik] dari [Ribi'I] dari [Hudzaifah] radliallahu 'anhu dia berkata; \"Apabila Nabi shallallahu 'alaihi wasallam hendak tidur di malam hari, beliau meletakkan tangannya di bawah pipi, kemudian beliau mengucapkan: \"Bismika amuutu wa ahya (Dengan nama-Mu aku mati dan aku hidup).\" Dan apabila bangun tidur, beliau mengucapkan: 'Al Hamdulillahilladzii ahyaana ba'da maa amatana wailaihi nusyur (Segala puji bagi Allah yang telah menghidupkan kami setelah mematikan kami, dan kepada-Nya lah tempat kembali)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6315,
			"arabicnumber": 6315,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdul Wahid bin Ziyad] telah menceritakan kepada kami [Al 'Ala` bin Musayyib] dia berkata; telah menceritakan kepadaku [Ayahku] dari [Al Barra` bin Azib] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam hendak tidur, maka beliau berbaring ke sebelah kanan, kemudian beliau mengucapkan: 'ALLAHUMMA ASLAMTU NAFSI ILAIKA WAFAWADLTU AMRII ILAIKA WA ALJA`TU ZHAHRI ILAIKA RAHBATAN WA RAGHBATAN ILAIKA LAA MALJA`A WALAA MANJAA MINKA ILLA ILAIKA AMANTU BIKITAABIKA ALLADZII ANZALTA WA BINABIYYIKA ALLADZII ARSALTA (Ya AIlah ya Tuhanku, aku berserah diri kepada-Mu, aku serahkan urusanku kepada-Mu dan aku berlindung kepada-Mu dalam keadaan harap dan cemas, karena tidak ada tempat berlindung dan tempat yang aman dari adzab-Mu kecuali dengan berlindung kepada-Mu. Aku beriman kepada kitab-Mu yang telah Engkau turunkan dan aku beriman kepada Nabi-Mu yang telah Engkau utus).' Apabila kamu meninggal pada malam itu, maka kamu meninggal dalam keadaan fitrah (suci). -firman Allah \"Istarhabuuhum\" QS; Al A'raf; 116, diambil dari kata \"rahbah (cemas) \" seperti \"malakuut\" dari kata \"mulk (kerajaan) \" contoh \"rahabuut (harap-harap cemas) \" itu lebih baik dari \"rahamuut (terlalu mengasihi) \" kamu berkata; \"Tarhabu\" itu lebih baik dari \"tarhamu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6316,
			"arabicnumber": 6316,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Ibnu Mahdi] dari [Sufyan] dari [Salamah] dari [Kuraib] dari [Ibnu Abbas] radliallahu 'anhuma dia berkata; \"Aku pernah bermalam di rumah Maimunah, lalu Nabi shallallahu 'alaihi wasallam bangun untuk membuang hajat. Kemudian beliau membasuh wajah dan kedua tangannya, lalu beliau mendatangi tempat air yang digantung dan membuka talinya. Kemudian beliau berwudlu di antara dua wudlu (dua kali dalam membasuh), tidak banyak namun sempurna. Kemudian beliau melaksanakan shalat, aku pun berdiri dan berjinjit khawatir beliau akan melihat bahwa aku memperhatikannya, lalu aku berwudlu dan berdiri untuk shalat. Maka aku berdiri di sebelah kiri beliau lalu beliau meraih telingaku dan menggeserku ke sebelah kanannya. Shalat beliau pun selesai hingga tiga belas rakaat. Kemudian beliau berbaring dan tertidur hingga terdengar tarikan nafasnya. Beliau jika tidur terdengar tarikan nafasnya, lalu Bilal mengumandangkan adzan untuk shalat, kemudian beliau shalat tanpa berwudlu lagi. Di dalam doanya beliau mengucapkan: \"'ALLAHUMMAJ'AL FI QALBI NURAN WA FI BASHARI NURAN WA FI SAM'I NURAN WA 'AN YAMINI NURAN WA 'AN YASARI NURAN WA MIN FAUQI NURAN WA MIN TAHTI NURAN WA MIN AMAMI NURAN WA MIN KHALFI NURAN WA A'ZHIM LI NURAN' (Ya Allah, jadikanlah cahaya di dalam hatiku, cahaya di dalam pendengaranku, cahaya di penglihatanku, cahaya di sebelah kananku, cahaya di sebelah kiriku, cahaya di hadapanku, cahaya di belakangku, cahaya di atasku, cahaya di bawahku dan muliakanlah cahaya bagiku).\" Kuraib berkata; Ada tujuh di dalam dada, ia berkata; Lalu aku bertemu dengan salah seorang anak Al Abbas, lalu ia menceritakannya kepadaku, lalu menyebutkan; 'ASHABI WA LAHMI WA DAMI WA SYA'RI WA BASYARI' (Uratku, dagingku, rambutku dan kulitku).' Ia berkata; Dan menyebutkan dua hal lainnya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6317,
			"arabicnumber": 6317,
			"text": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Sufyan] saya mendengar [Sulaiman bin Abu Muslim] dari [Thawus] dari [Ibnu Abbas] bahwa; \"Apabila Nabi shallallahu 'alaihi wasallam hendak bangun Tahajjud pada malam hari, beliau membaca: \"ALAAHUMA LAKAL HAMDU, ANTA NUURUSSAMAWAATI WAL ARDH WAMAN FIIHINNA, WALAKAL HAMDU ANTA QAYYIMUSSAWAATI WAL ARDH WAMAN FIIHINNA, WALAKAL HAMDU ANTAL HAQQU, WAWA'DUKA HAQQ, WAQAULUKA HAQQ, WALIQAA'UKA HAQQ, WALJANNATU HAQQ, WANNAARU HAQQ, WASSAA'ATU HAQQ, WANNABIYUUN HAQQ, WAMUHAMMADUN HAQQ. ALLAAHUMMA LAKA ASLAMTU WABIKA AAMANTU WAILAIKA TAWAKKALTU, WAILAIKA ANABTU, WABIKA KHAASHAMTU, WAILAIKA HAAKAMTU, FAHGHFIRLII MA QADDAMMTU WAMAA AKHKHARTU, WAMA ASRARTU WAMAA A'LANTU, ANTAL MUQADDIM WA ANTAL MU`AKHIR LAA-ILAAHA ILLAA ANTA -atau- LAA ILAAHA ILLA GHAIRUKA (Ya Allah, bagi-Mu lah segala puji, Engkau cahaya langit dan bumi dan sesuatu yang berada di antara keduanya, bagiMu segala puji, Engkau adalah pemelihara langit dan bumi dan siapa saja yang menghuninya, Engkau adalah benar, dan janji-Mu benar, firman-Mu benar, pertemuan dengan-Mu benar, surga-Mu benar, neraka-Mu benar, kiamat benar, para nabi benar, dan Muhammad adalah benar. Ya Allah, kepada-Mu aku berserah, kepada-Mu aku beriman, kepada-Mu aku bertawakkal, kepada-Mu aku menyandarkan diri, karena-Mu aku memusuhi, dan kepada-Mu aku meminta penghakiman, maka ampunilah bagiku apa yang telah aku perbuat dan apa yang belum aku lakukan, apa yang aku lakukan secara sembunyi-sembunyi dan apa yang aku lakukan secara terang-terangan, Engkaulah Dzat Yang Maha terdahulu dan Engkaulah Dzat Yang Maha terakhir, tiada sesembahan yang hak selain Engkau atau tiada sesembahan selain Engkau)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6318,
			"arabicnumber": 6318,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibnu Abu Laila] dari [Ali] bahwa Fatimah mengadukan kepada Nabi shallallahu 'alaihi wasallam perihal tangannya yang lecet akibat mengaduk gandum, maka Fatimah datang kepada beliau dan meminta seorang pelayan, tetapi dia tidak menemui beliau, lalu Fatimah menitipkan pesan kepada Aisyah. Ketika Nabi datang, Aisyah pun menyampaikan pesan kepada beliau. Ali melanjutkan; \"Kemudian beliau datang kepada kami ketika kami tengah berbaring (di tempat tidur), maka akupun bangkit berdiri, namun beliau bersabda: 'Tetaplah pada tempat kalian berdua.' kemudian beliau duduk di samping kami sampai aku merasakan dinginnya kedua telapak kaki beliau, lalu beliau bersabda: 'Maukah aku tunjukkan kepada kalian sesuatu yang lebih baik bagi kalian berdua daripada seorang pelayan, apabila kalian berdua hendak tidur maka bertakbirlah kepada Allah sebanyak tiga puluh tiga kali, bertasbihlah sebanyak tiga puluh tiga kali dan bertahmidlah sebanyak tiga puluh empat, dan ini semua lebih baik buat kalian berdua dari seorang pelayan",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6319,
			"arabicnumber": 6319,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah menceritakan kepada kami [Al Laits] dia berkata; telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku ['Urwah] dari [Aisyah] radliallahu 'anha bahwa apabila Rasulullah shallallahu 'alaihi wasallam hendak tidur, beliau meniupkan ke kedua tangannya sambil membaca mu'awidzatain (surat An Naas dan Al Falaq), lalu beliau mengusapkan ke badannya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6320,
			"arabicnumber": 6320,
			"text": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami ['Ubaidullah bin Umar] telah menceritakan kepadaku [Sa'id bin Abu Sa'id Al Maqburi] dari [Ayahnya] dari [Abu Hurairah] dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila seseorang dari kalian hendak tidur, maka hendaklah ia mengibaskan di atas tempat tidurnya dengan kain sarungnya, karena ia tidak tahu apa yang terdapat di atas kasurnya. Lalu mengucapkan doa: BISMIKA RABBII WADHA'TU JANBII WABIKA ARFA'UHU, IN AMSAKTA NAFSII FARHAMHAA, WAIN ARSALTAHAA FAHFAHZH-HAA BIMAA TAHFAZHU BIHI 'IBAADAKASHSHAALIHIIN (Dengan nama-Mu Wahai Tuhanku, aku baringkan punggungku dan atas nama-Mu aku mengangkatnya, dan jika Engkau menahan diriku, maka rahmatilah daku, dan jika Engkau melepaskannya, maka jagalah sebagaimana Engkau menjaga hamba-Mu yang shalih).\" Dan hadits ini juga diperkuat oleh [Abu Dlamrah] dan [Isma'il bin Zakariya] dari ['Ubaidullah]. [Yahya] dan [Bisyr] mengatakan; dari ['Ubaidullah] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. Dan diriwayatkan pula oleh [Malik] dan [Ibnu 'Ajlan] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6321,
			"arabicnumber": 6321,
			"text": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Abu Abdullah Al Aghar] dan [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rabb kita Tabaraka wata'ala setiap malam turun ke langit dunia ketika sepertiga malam terakhir, lantas Dia berfirman; 'Siapa yang berdoa kepada-Ku, niscaya Aku akan mengijabahinya, siapa yang meminta sesuatu kepada-Ku, niscaya Aku akan memberinya dan siapa yang meminta ampun kepada-Ku, niscaya Aku akan mengampuninya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6322,
			"arabicnumber": 6322,
			"text": "Telah menceritakan kepada kami [Muhammad bin 'Ar'arah] telah menceritakan kepada kami [Syu'bah] dari [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] radliallahu 'anhu dia berkata; \"Apabila Nabi shallallahu 'alaihi wasallam hendak masuk jamban, beliau mengucapkan: 'ALLAHUMMA INNI A'UUDZUBIKA MINAL KHUBUTSI WAL KHABAAITSI (Ya Allah, sesungguhnya aku berlindung kepada-Mu dari setan laki-laki maupun perempuan)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6323,
			"arabicnumber": 6323,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Husain] telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Busyair bin Ka'b] dari [Syaddad bin Aus] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya istighfar yang paling baik adalah; jika seorang hamba mengucapkan: 'ALLAHUMMA ANTA RABBI LAA ILAAHA ILLA ANTA KHALAQTANI WA ANA 'ABDUKA WA ANA 'ALA 'AHDIKA WA WA'DIKA MASTATHA'TU A'UUDZU BIKA MIN SYARRI MAA SHANA'TU ABUU`U LAKA BIDZANBI WA ABUU`U LAKA BINI'MATIKA 'ALAYYA FAGHFIRLI FA INNAHU LAA YAGHFIRU ADZ DZUNUUBA ILLA ANTA A'UUDZU BI SYARRI MAA SHANA'TU (Ya Allah, Engkau adalah Tuhanku, tidak ada Tuhan yang berhak diibadahi selain Engkau. Engkau telah menciptakanku dan aku adalah hamba-Mu. Aku menetapi perjanjian-Mu dan janji-Mu sesuai dengan kemampuanku. Aku berlindung kepada-Mu dari keburukan perbuatanku, aku mengakui dosaku kepada-Mu dan aku akui nikmat-Mu kepadaku, maka ampunilah aku. Sebab tidak ada yang dapat mengampuni dosa selain-Mu, dan aku meminta ampun dari segala yang pernah aku perbuat) '. Jika ia mengucapkan di waktu sore lalu meninggal, maka ia akan masuk surga. Dan jika ia membacanya di waktu pagi lalu meninggal pada hari, maka ia mendapatkan seperti itu juga (masuk surga)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6324,
			"arabicnumber": 6324,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Abdul Malik bin Umair] dari [Rib'i bin Hirasy] dari [Hudzaifah] dia berkata; \"Apabila Nabi shallallahu 'alaihi wasallam hendak tidur, beliau membaca: 'Bismika allahumma amuutu wa ahya (Dengan nama-Mu Ya Allah, aku mati dan aku hidup).' Dan apabila bangun tidur, beliau mengucapkan: 'Al Hamdulillahilladzii ahyaana ba'da maa amatana wailaihi nusyur (Segala puji bagi Allah yang telah menghidupkan kami setelah mematikan kami, dan kepada-Nya lah tempat kembali)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6325,
			"arabicnumber": 6325,
			"text": "Telah menceritakan kepada kami ['Abdan] dari [Abu Hamzah] dari [Manshur] dari [Rib'i bin Hirasy] dari [Kharasyah bin Al Hurr] dari [Abu Dzar] radliallahu 'anhu dia berkata; \"? pabila Nabi shallallahu 'alaihi wasallam hendak tidur malam, beliau mengucapkan: 'Allahumma bismika amuutu wa ahya (Ya Allah, dengan nama-Mu aku mati dan aku hidup).' Dan apabila bangun tidur, beliau mengucapkan: 'Al Hamdulillahilladzii ahyaana ba'da maa amatana wailaihi nusyur (Segala puji bagi Allah yang telah menghidupkan kami setelah mematikan kami, dan kepada-Nya lah tempat kembali)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6326,
			"arabicnumber": 6326,
			"text": "Telah menceritakan kepada kami [Abdullah bin bin Yusuf] telah mengabarkan kepada kami [Al Laits] dia berkata; telah menceritakan kepadaku [Yazid] dari [Abu Al Khair] dari [Abdullah bin 'Amru] dari [Abu Bakr As Siddiq] radliallahu 'anhu bahwa dia berkata kepada Nabi shallallahu 'alaihi wasallam; \"Ajarilah aku doa yang aku panjatkan dalam shalatku! Beliau menjawab: 'Ucapkanlah; ALLAAHUMMA INII ZHALAMTU NAFSII ZHULMAN KATSIIRAN WALAA YAGHFIRUDZDZUNUUBA ILLAA ANTA FAHGHFIRLII MAGHFIRATAN MIN INDIKA INNAKA ANTAL GHAFUURURRAHIIM ('Ya Allah, sesungguhnya aku telah menzhalimi diriku sendiri dengan kezhaliman yang banyak, dan tidak ada yang bisa mengampuni dosa selain Engkau, maka ampunilah bagiku dari sisi-Mu, sesungguhnya Engkau Maha pengampun lagi Maha Penyayang).\" ['Amru bin Harits] berkata; dari [Yazid] dari [Abu Al Khair] bahwa dia mendengar [Abdullah bin Amru], [Abu Bakr] radliallahu 'anhu berkata kepada Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6327,
			"arabicnumber": 6327,
			"text": "Telah menceritakan kepada kami [Ali] telah menceritakan kepada kami [Malik bin Su'air] telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] mengenai firman Allah; \"... Dan janganlah kamu mengeraskan suaramu dalam shalatmu dan janganlah pula merendahkannya...\" QS Al Isra`; 110. ayat ini di turunkan mengenai do'a",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6328,
			"arabicnumber": 6328,
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Wa`il] dari [Abdullah] radliallahu 'anhu dia berkata; \"Kami biasa membaca (shalawat); 'Assalaamu 'alallahi, assalaamu 'alaa fulaan (Semoga keselamatan terlimpahkan kepada Allah, semoga keselamatan terlimpah kepada fulan).\" Maka suatu hari Nabi shallallahu 'alaihi wasallam bersabda kepada kami: 'Sesungguhnya Allah adalah Salam, apabila salah seorang dari kalian duduk dalam shalat (tahiyyat), hendaknya mengucapkan; 'AT-TAHIYYATUT LILLAHI -hingga sabdanya- SHAALIHIIN, (penghormatan, rahmat dan kebaikan hanya milik Allah -hingga sabdanya- hamba-hamba Allah yang shalih). Sesungguhnya jika ia mengucapkannya, maka hal itu sudah mencakup seluruh hamba-hamba yang shalih baik di langit maupun di bumi, ' (lalu melanjutkan); 'ASYHADU ALLAAILAAHA ILLALLAH WA ASYHADU AN NAMUHAMMADAN 'ABDUHU WA RASUULUH (Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah, dan Muhammad adalah hamba dan utusan-Nya).' Setelah itu ia boleh memilih pujian yang ia kehendaki",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6329,
			"arabicnumber": 6329,
			"text": "Telah menceritakan kepada kami [Ishaq] ' telah mengabarkan kepada kami [Yazid] telah mengabarkan kepada kami [Warqa`] dari [Sumayy] dari [Abu Shalih] dari [Abu Hurairah] \"Orang-orang berkata; 'Wahai Rasulullah, orang-orang kaya pergi dengan membawa derajat dan kenikmatan yang banyak.' Beliau bertanya; 'Mengapa bisa seperti itu? ' Mereka menjawab; 'Mereka melakukan shalat sebagaimana kami shalat, mereka berjihad sebagaimana kami berjihad, dan mereka memiliki kelebihan harta untuk bersedekah sedangkan kami tidak mempunyai harta yang lebih untuk bersedekah.' Maka beliau bersabda: 'Maukah kalian aku tunjukkan pada suatu perkara, yang tidak akan menyamai orang sebelum kalian dan tidak pula akan di dahului oleh orang-orang setelah kalian kecuali dan tidak akan terjangkau kecuali oleh orang yang melakukan hal yang sama seperti yang kalian lakukan? ' Yaitu; kalian bertasbih seusai shalat sebanyak sepuluh kali, bertahmid sebanyak sepuluh kali bertakbir sebanyak sepuluh kali.' Hadits ini juga diperkuat oleh ['Ubaidullah bin Umar] dari [Sumayy]. Dan diriwayatkan pula oleh [Ibnu 'Ajlan] dari [Sumayy] dan [Raja` bin Haiwah]. Dan diriwayatkan pula oleh [Jarir] dari [Abdul Aziz bin Rufai'] dari [Abu Shalih] dari [Abu Darda`]. Dan diriwayatkan pula oleh [Suhail] dari [Ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6330,
			"arabicnumber": 6330,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Al Musayyab bin Rafi'] dari [Warrad] bekas budak [Mughirah bin Syu'bah] dia berkata; \"Mughirah pernah menulis surat kepada Mu'awiyah bin Abu Sufyan bahwa Rasulullah shallallahu 'alaihi wasallam selepas shalat, beliau selalu mengucapkan do'a; 'LAA ILAAHA ILLALLAH WAHDAHUU LAA SYARIIKALAH LAHUL MULKU WALAHUL HAMDU WAHUWA 'ALAA KULLI SYAI`IN QADIIR, ALLAHUMMA LAA MAANI'A LIMAA A'THAITA WALLA MU'THIYA LIMAA MANA'TA WALAA YANFA'U DZAL JADDI MINKAL JADDU (Tiada Dzat yang berhak disembah selain Allah, tiada sekutu bagi-Nya, Dia yang mempunyai kekuasaan dan segala pujian. Dia Maha Kuasa atas segala sesuatu. Ya Allah, tiada yang bisa menghalangi apa yang Engkau berikan dan tiada yang bisa memberi apa yang Engkau halangi. Tidaklah bermanfaat kekayaan dan harta benda dari-Mu bagi pemiliknya).\" Dan berkata [Syu'bah] dari [Manshur], dia berkata; saya mendengar [Al Musayyab]",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6331,
			"arabicnumber": 6331,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Yazid bin Abu 'Ubaid] bekas budak Salamah telah menceritakan kepada kami [Salamah bin Al Akwa'] dia berkata; \"Kami pernah keluar bersama Nabi shallallahu 'alaihi wasallam menuju Khaibar seorang anggota pasukan dari suatu Kaum berkata; 'Wahai 'Amir, tidakkah kamu mau memperdengarkan kepada kami sajak-sajakmu? ' Kemudian 'Amir turun sambil menghalau unta dan berkata; 'Demi Allah, kalau bukan karena Allah, maka tidaklah kami akan mendapat petunjuk, kemudian Salamah menyebutkan sajak-sajak tersebut, akan tetapi aku tidak hafal, maka Rasulullah shallallahu 'alaihi wasallam bertanya: 'Siapakah orang yang menghalau unta tadi? ' Mereka menjawab; 'Amir bin Al Akwa'.' Beliau bersabda: 'Semoga Allah merahmatinya.' Lalu seorang anggota pasukan bertanya; 'Alangkah baiknya sekiranya anda menyuruhnya supaya menghibur kami terus.' Ketika pasukan saling berhadapan, maka mereka saling menyerang, ternyata Amir terkena pedangnya sendiri hingga menyebabkan dirinya meninggal. Setelah hari mulai petang, mereka mulai menyalakan api, maka Rasulullah shallallahu 'alaihi wasallam bertanya: 'Nyala api apakah itu? Dan untuk apakah mereka menyalakan api? ' Mereka menjawab; 'Untuk memasak daging keledai jinak.' Maka beliau bersabda: 'Tumpahkanlah dan pecahkanlah.' Lantas ada seorang laki-laki berkata; 'Wahai Rasulullah, tidakkah kami tumpahkan kemudian kami mencucinya? ' Beliau menjawab: 'Atau seperti itu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6332,
			"arabicnumber": 6332,
			"text": "Telah menceritakan kepada kami [Muslim] telah menceritakan kepada kami [Syu'bah] dari ['Amru yaitu Ibnu Murrah] saya mendengar [Ibnu Abu Aufa] radliallahu 'anhuma; \"Apabila seseorang memberikan sedekah kepada Nabi shallallahu 'alaihi wasallam, maka beliau akan berdo'a: 'ALLAHUMMA SHALLI 'ALAA AALI FULAN (Ya Allah, berikanlah kesejahteraan kepada keluarga fulan).' Tidak lama kemudian, ayahku memberikan (sedekah) kepada beliau, lalu beliau bersabda: 'ALLAHUMMA SHALLI 'ALAA AALI ABI AUFA (Ya Allah, limpahkanlah kesejahteraan kepada keluarga Abu Aufa)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6333,
			"arabicnumber": 6333,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] dari [Isma'il] dari [Qais] dia berkata; saya mendengar [Jarir] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Bisakah kamu membuat aku dapat beristirahat dari urusan Dzul Khalashah\". Maksud beliau adalah patung yang disembah yang dinamakan Ka'bah Al Yamaniyah. Lalu aku berkata; \"Wahai Rasulullah, sesungguhnya aku tidak ahli dalam menunggang kuda.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam menepuk dadaku dan berdo'a: 'Ya Allah mantapkanlah dia dan jadikanlah dia seorang pemberi petunjuk yang lurus.' Jarir berkata; 'Lalu aku berangkat bersama lima pengunggang kuda yang ulung dari kaumku.' Dan sepertinya Sufyan mengatakan; 'Lalu aku berangkat bersama beberapa orang dari kaumku, lalu aku datangi tempat tersebut dan aku membakarnya, setelah itu aku menemui Nabi shallallahu 'alaihi wasallam dan berkata; 'Wahai Rasulullah, demi Allah, tidaklah aku menemui anda melainkan aku telah meninggalkan mereka (para penyembah Dzul Khalashah) kecuali seolah-olah mereka seperti unta yang penyakitan (sebutan untuk kehancuran rumah tersebut karena telah dibakar). Lalu beliau mendo'akan keberkahan untuk pasukan beserta kudanya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6334,
			"arabicnumber": 6334,
			"text": "Telah menceritakan kepada kami [Sa'id bin Rabi'] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dia berkata; saya mendengar [Anas] berkata; Ummu Sulaim pernah berkata kepada Nabi shallallahu 'alaihi wasallam; \"(Do'akanlah) pelayan engkau yaitu Anas.\" Beliau bersabda: 'Ya Allah, karuniailah ia harta dan anak yang banyak dan berkahilah apa yang telah Engkau berikan kepadanya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6335,
			"arabicnumber": 6335,
			"text": "Telah menceritakan kepada kami [Ustman bin Abu Syaibah] telah menceritakan kepada kami ['Abdah] dari [Hisyam] dari [Ayahnya] dari [Aisyah] radliallahu 'anha dia berkata; Nabi shallallahu 'alaihi wasallam pernah mendengar seorang laki-laki membaca (Al Qur'an) di masjid, lalu beliau bersabda: \"Semoga Allah merahmatinya, sungguh ia telah mengingatkanku ini dan ini, yaitu ayat yang aku lupa dalam surat ini dan ini",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6336,
			"arabicnumber": 6336,
			"text": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Sulaiman] dari [Abu Wa`il] dari [Abdullah] dia berkata; \"Suatu ketika Nabi shallallahu 'alaihi wasallam membagi-bagi suatu pembagian, lalu seorang laki-laki berkata; 'Sungguh pembagian ini tidak dimaksudkan untuk mengharap ridla Allah.' Lalu aku memberitahukannya kepada Nabi shallallahu 'alaihi wasallam, maka beliau marah hingga aku lihat tampak kemarahan pada wajah Beliau. Beliau lalu bersabda: 'Semoga Allah merahmati Musa, karena dia disakiti lebih banyak dari ini namun dia tetap bersabar",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6337,
			"arabicnumber": 6337,
			"text": "Telah menceritakan kepada kami [Yahya bin Muhammad bin As Sakan] telah menceritakan kepada kami [Habban bin Hilal Abu Habib] telah menceritakan kepada kami [Harun Al Muqri`i] telah menceritakan kepada kami [Az Zubair bin Al Khirrit] dari [Ikrimah] dari [Ibnu Abbas] dia berkata; \"Berbicaralah kepada orang-orang setiap Jum'at sekali, jika kamu enggan, maka dua kali, dan apabila kamu ingin lebih banyak lagi, hendaknya hanya tiga kali (setiap Jum'at). Janganlah membuat orang-orang bosan dengan Al Qur'an ini. Jangan sekali-kali aku dapatkan kamu mendatangi sebuah kaum ketika mereka berbincang-bincang, tiba-tiba kamu menyampaikan kisah dan memotong pembicaraan mereka hingga mereka bosan. Akan tetapi diamlah terlebih dahulu. Jika mereka telah mempersilahkanmu, silahkan kamu bicara, sehingga mereka antusias (semangat) mendengarkan tutur bicaramu. Dan tolong cermatilah sajak puitis (yang sulit dimengerti) dan jauhilah yang seperti itu, sebab telah kutemui Rasulullah dan para sahabatnya tak melakukan yang demikian. Yaitu tidak melakukan hal itu selain mereka selalu menjauhi semacam itu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6338,
			"arabicnumber": 6338,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Isma'il] telah mengabarkan kepada kami [Abdul Aziz] dari [Anas] radliallahu 'anhu dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang tengah berdo'a, hendaknya ia bersungguh-sungguh dalam berdo'a, dan janganlah mengatakan; 'Ya Allah, jika Engkau kehendaki berilah aku…' sebab Allah sama sekali tidak ada yang bisa memaksa",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6339,
			"arabicnumber": 6339,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian mengatakan; 'Ya Allah, ampunilah aku jika Engkau kehendaki, dan rahmatilah aku jika Engkau berkehendak.' Akan tetapi hendaknya ia bersungguh-sungguh dalam meminta, karena Allah sama sekali tidak ada yang memaksa",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6340,
			"arabicnumber": 6340,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Ibnu Syihab] dari [Abu 'Ubaid] bekas budak Ibnu Azhar dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Do'a) kalian akan diijabahi selagi tidak terburu-buru, dengan mengatakan; 'Aku telah berdo'a, namun tidak kunjung diijabahi",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6341,
			"arabicnumber": 6341,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6342,
			"arabicnumber": 6342,
			"text": "Telah menceritakan kepada kami [Muhammad bin Mahbub] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas] radliallahu 'anhu dia berkata; \"Ketika Nabi shallallahu 'alaihi wasallam sedang berkhutbah pada hari Jum'at, tiba-tiba seorang laki-laki berdiri dan berkata; \"Wahai Rasulullah, berdo'alah kepada Allah, supaya menurunkan hujan.\" Maka langitpun menjadi berawan dan hujan pun turun hingga hampir seseorang tidak dapat sampai ke rumahnya, hal ini berlangsung sampai Jumat berikutnya. Kemudian laki-laki tersebut atau yang lainnya berdiri dan berkata; 'Berdo'alah kepada Allah supaya memalingkan hujan dari kami, karena kami semuanya telah kebanjiran.' Beliaupun tersenyum kemudian berdo'a: 'Ya Allah, turunkanlah (hujan) di sekitar kami dan bukan pada kami.' Maka awan-awan pun bergeser dari Madinah dan tidak turun pada penduduk Madinah sedikitpun",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6343,
			"arabicnumber": 6343,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami ['Amru bin Yahya] dari ['Abbad bin Tamim] dari [Abdullah bin Zaid] dia berkata; Nabi shallallahu 'alaihi wasallam keluar menuju tempat shalat ini untuk meminta hujan, lalu beliau berdo'a miminta hujan dengan menghadap ke Kiblat dan membalikkan selendangnya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6344,
			"arabicnumber": 6344,
			"text": "Telah menceritakan kepada kami [Abdullah bin Abu Al Aswad] telah menceritakan kepada kami [Harami] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas] radliallahu 'anhu dia berkata; ibuku berkata; \"Wahai Rasulullah, do'akanlah atas pelayan enaku ini, yaitu Anas.\" Beliau bersabda: \"Ya Allah, perbanyaklah hartanya, anak-anaknya dan berkahilah atas apa yang Engkau berikan",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6345,
			"arabicnumber": 6345,
			"text": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] telah menceritakan kepada kami [Qatadah] dari [Abu 'Aliyah] dari [Ibnu Abbas] radliallahu 'anhuma dia berkata; \"Nabi shallallahu 'alaihi wasallam biasa berdo'a ketika dalam kesulitan, beliau mengucapkan: \"LAA ILAAHA ILLALLAHUL 'ADZIIM AL HALIIM LAA ILAAHA ILLALLAH RABBUL 'ARSYIL 'AZHIIM (Tiada Ilah selain Allah Yang Maha Agung dan Maha Penyantun. Tiada ilah selain Allah, Tuhan langit dan bumi serta Tuhan arasy yang mulia)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6346,
			"arabicnumber": 6346,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Hisyam bin Abu Abdullah] dari [Qatadah] dari [Abu 'Aliyah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam biasa berdo'a ketika dalam kesulitan, beliau mengucapkan: \"LAA ILAAHA ILLALLAHUL 'ADZIIM AL HALIIM LAA ILAAHA ILLALLAH RABBUL 'ARSYIL 'AZHIIM, LAA ILAAHA ILLALLAH RABBUS SAMAAWATI WA RABBUL ARDLI WA RABBUL ASRSYL KARIIM (Tiada Tuhan selain Allah Yang Maha Agung dan Maha Penyantun. Tiada Tuhan selain Allah, Tuhan Penguasa arasy yang agung. Tiada Tuhan selain Allah, Tuhan langit dan bumi serta Tuhan arasy yang mulia).\" Dan berkata [Wahb] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] seperti itu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6347,
			"arabicnumber": 6347,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepadaku [Sumayy] dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah Shallallahu 'alahi wasallam selalu meminta perlindungan dari cobaan yang memayahkan, kesengsaraan yang menderitakan, takdir yang buruk dan cacian musuh.' Sufyan mengatakan; \"Hadits tersebut (tiga macam keburukan -red) mamsih ada tambahan dariku, namun aku lupa yang satunya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6348,
			"arabicnumber": 6348,
			"text": "Telah menceritakan kepada kami [Sa'id bin 'Ufair] dia berkata; telah menceritakan kepadaku [Al Laits] dia berkata; telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [Sa'id bin Musayyab] dan ['Urwah bin Zubair] - ia termasuk kalangan ahli ilmu- bahwa [Aisyah] radliallahu 'anha berkata; Ketika Rasulullah Shallallahu 'alahi wasallam masih dalam keadaan sehat wal afiat, beliau bersabda: 'Sesungguhnya seorang nabi tidaklah diwafatkan hingga diperlihatkan kepadanya tempatnya di surga lalu ia dipersilahkan untuk memilih.' Ketika (malaikat pencabut nyawa) datang kepada beliau, sementara kepala beliau berada di pangkuan saya, maka Rasulullah pingsan beberapa saat. Tak lama kemudian ia sadar kembali. Setelah itu, beliau menatap pandangannya ke atas sambil mengucapkan: Ya Allah, pertemukanlah aku dengan kekasihku, Allah Yang Maha Tinggi! ' Aku berkata; \"Dengan demikian, Rasulullah shallallahu 'alaihi wasallam tidak memilih untuk hidup lebih lama lagi bersama kami dan saya tahu bahwa itu adalah ucapan yang pernah beliau sampaikan kepada kami ketika beliau masih sehat. Aisyah mengatakan; \"Itulah kata-kata terakhir yang pernah beliau ucapkan, yaitu: 'Ya Allah, pertemukanlah aku dengan kekasihku Yang Maha Tinggi",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6349,
			"arabicnumber": 6349,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6350,
			"arabicnumber": 6350,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Isma'il] dari [Qais] dia berkata; aku datang untuk membesuk [Khabbab], ketika itu ia tengah di terapi dengan kay (menempelkan besi panas pada daerah yang sakit) hingga tujuh kali, lalu dia mengatakan; 'Kalaulah Rasulullah shallallahu 'alaihi wasallam tidak melarang kami memohon kematian, niscaya aku akan memohonnya.\" Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Yahya] dari [Isma'il] dia berkata; telah menceritakan kepadaku [Qais] dia berkata; aku pernah menjenguk [Khabbab], ketika itu ia tengah di terapi dengan kay (menempelkan besi panas pada daerah yang luka) hingga tujuh kali di perutnya, maka aku mendengar dia mengatakan; 'Kalaulah Nabi shallallahu 'alaihi wasallam tidak melarang kami memohon kematian, niscaya aku akan memohonnya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6351,
			"arabicnumber": 6351,
			"text": "Telah menceritakan kepada kami [Ibnu Salam] telah mengabarkan kepada kami [Isma'il bin 'Ulayyah] dari [Abdul Aziz bin Shuhaib] dari [Anas] radliallahu 'anhu dia berkata; Rasulullah Shallallahu 'alahi wasallam bersabda: \"Janganlah salah seorang dari kalian berangan-angan untuk mati karena musibah yang menimpanya, kalau memang hal itu harus, hendaknya ia mengatakan; \"Ya Allah, hidupkanlah aku jika kehidupan itu baik untukku, dan matikanlah aku jika kematian itu baik bagiku",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6352,
			"arabicnumber": 6352,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Hatim] dari [Al Ja'd bin Abdurrahman] dia berkata; saya mendengar [As Sa`ib bin Yazid] berkata; Aku bersama bibiku menemui Rasulullah Shallallahu 'alahi wasallam, lalu dia berkata; \"Wahai Rasulullah, Sesungguhnya anak saudaraku ini sedang menderita sakit.\" Lalu beliau mengusap kepalaku dan mendo'akanku dengan keberkahan, setelah itu beliau berwudlu dan meminum sisa air wudlu, sementara aku berdiri di belakang beliau maka aku sempat melihat stempel (kenabian) antara kedua pundak beliau seperti biji kancing",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6353,
			"arabicnumber": 6353,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepada kami [Sa'id bin Abu Ayyub] dari [Abu 'Uqail] bahwa dia bersama kakeknya Abdullah bin Hisyam pernah keluar dari pasar atau menuju pasar, lalu ia membeli makanan. Selang beberapa saat, ia bertemu dengan [Ibnu Zubair] dan [Ibnu Umar], maka keduanya berkata; \"Ikutkanlah kami berdua denganmu, karena Nabi Shallallahu 'alahi wasallam dulu pernah mendo'akanmu dengan keberkahan.\" Lalu mereka pun ikut bersamanya, dan sepertinya ia mendapatkan tunggangan lalu menghantarkannya sampai ke rumah",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6354,
			"arabicnumber": 6354,
			"text": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Shalih bin Kaisan] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku [Mahmud bin Ar Rabi'] -ia adalah orang yang Rasulullah Shallallahu 'alahi wasallam pernah mengguyurkan air ke mukanya dari sumur mereka, ketika ia masih kecil",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6355,
			"arabicnumber": 6355,
			"text": "Telah menceritakan kepada kami ['Abdan] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha dia berkata; Nabi Shallallahu 'alahi wasallam pernah di beri beberapa bayi, lalu beliau mendo'akan mereka, beliau juga pernah di beri seorang bayi laki-laki, lalu bayi itu ngompol, maka beliau meminta di ambilkan air lalu memercikinya dan tidak mencucinya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6356,
			"arabicnumber": 6356,
			"text": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku [Abdullah bin Tsa'labah bin Shu'air] -Dan Nabi Shallallahu 'alahi wasallam pernah mengusapnya- bahwa dia pernah melihat Sa'd bin Abu Waqash shalat witir satu raka'at",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6357,
			"arabicnumber": 6357,
			"text": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Al Hakam] dia berkata; saya mendengar [Abdurrahman bin Abu Laila] dia berkata; [Ka'b bin 'Ujrah] pernah menemuiku, lalu dia berkata; \"Maukah kamu aku beri petunjuk? Sesungguhnya Nabi Shallallahu 'alahi wasallam pernah keluar menemui kami, lalu kami bertanya; \"Wahai Rasulullah, kami telah mengetahui salam kepadamu, lalu bagaimanakah caranya bershalawat kepadamu? Beliau menjawab: \"Ucapkanlah; ALLAHUMMA SHALLI 'ALAA MUHAMMAD WA 'ALAA AALI MUHAMMAD KAMAA SHALLAITA 'ALAA AALII IBRAAHIM INNAKA HAMIIDUM MAJIID. ALLAAHUMMA BAARIK 'ALAA MUHAMMAD WA'ALAA AALI MUHAMMAD KAMAA BAARAKTA 'ALAA 'AALI IBRAHIIMA INNAKA HAMIIDUM MAJIID (Ya Allah berilah shalawat kepada Muhammad dan kepada keluarga Muhammad sebagaimana Engkau telah memberi shalawat kepada Ibrahiim, sesungguhnya Engkah Maha Terpuji dan Maha Mulia. Ya Allah berilah barakah kepada Muhammad dan keluarga Muhammad sebagaimana Engkau telah memberi barakah kepada Ibrahim, sesungguhnya Engkah Maha Terpuji dan Maha Mulia)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6358,
			"arabicnumber": 6358,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Hamzah] telah menceritakan kepada kami [Ibnu Abu Hazim] dan [Ad Darawardi] dari [Yazid] dari [Abdullah bin Khabbab] dari [Abu Sa'id Al Khudri] dia berkata; kami bertanya; \"Wahai Rasulullah, kami telah mengetahui salam kepadamu, lalu bagaimanakah kami bershalawat?\" beliau menjawab: \"Ucapkanlah; ALLAHUMMA SHALLI 'ALAA MUHAMMAD 'ABDIKA WARASUULIKA KAMAA SHALLAITA 'ALAA IBRAAHIM WA BAARIK 'ALAA MUHAMMAD WA'ALAA AALI MUHAMMAD KAMAA BAARAKTA 'ALAA IBRAHIIM WA 'ALAA AALI IBRAHIIMA (Ya Allah berilah shalawat kepada Muhammad hamba dan utusan-Mu sebagaimana Engkau telah memberi shalawat kepada Ibrahiim, dan berilah barakah kepada Muhammad dan keluarga Muhammad sebagaimana Engkau telah memberi barakah kepada Ibrahim, dan keluarga Ibrahim)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6359,
			"arabicnumber": 6359,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] dari [Ibnu Abu Aufa] dia berkata; \"Apabila seseorang menyerahkan sedekahnya kepada Nabi shallallahu 'alaihi wasallam, maka beliau mengucapkan: \"ALLAHUMMA SHALLI 'ALAAIHI (Ya Allah, berikanlah kesejahteraan kepadanya).\" Tidak lama kemudian, ayahku menyerahkan sedekah kepada beliau, lalu beliau bersabda: \"ALLAHUMMA SHALLI 'ALAA AALI ABI AUFA (Ya Allah, limpahkanlah kesejahteraan kepada keluarga Abu Aufa)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6360,
			"arabicnumber": 6360,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Abdullah bin Abu Bakr] dari [Ayahnya] dari ['Amru bin Sulaim Az Zuraqi] dia berkata; telah mengabarkan kepadaku [Abu Humaid As Sa'idi] bahwa mereka berkata; \"Wahai Rasulullah, bagaimana kita bershalawat kepadamu?\" beliau bersabda: \"Ucapkanlah; ALLAHUMMA SHALLI 'ALAA MUHAMMADIN WA AZWAAJIHI WA DZURRIYYATIHII KAMAA SHALLAITA 'ALAA AALI IBRAHIM WA BAARIK 'ALAA MUHAMMADIN WA AZWAAJIHI WA DZURRIYYATIHII KAMAA BAARAKTA 'ALAA AALI IBRAHIM INNAKA HAMIIDUN MAJIID\" (Ya Allah berilah shalawat kepada Muhammad, istri-istrinya dan anak keturunannya sebagaimana Engkau telah memberi shalawat kepada keluarga Ibrahim dan berilah barakah kepada Muhammad, istri-istrinya dan anak keturunannya sebagaimana Engkau telah memberi barakah kepada keluarga Ibrahim. Sesungguhnya Engkah Maha Terpuji dan Maha Mulia)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6361,
			"arabicnumber": 6361,
			"text": "Telah menceritakan kepada kami [Ahmad bin Shal? h] telah menceritakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku [Sa'id bin Musayyab] dari [Abu Hurairah] radliallahu 'anhu bahwa dia pernah mendengar Nabi shallallahu 'alaihi wasallam mengucapkan: \"Ya Allah, sekiranya ada seorang mukmin yang pernah aku cela, maka jadikanlah celanya tersebut sebagai perkara yang dapat mendekatkan kepada-Mu di hari Kiamat kelak",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6362,
			"arabicnumber": 6362,
			"text": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas] radliallahu 'anhu; bahwa para sahabat banyak bertanya kepada Rasulullah shallallahu 'alaihi wasallam sehingga mereka setengah memaksa dengan pertanyaan-pertanyaan itu. Maka beliau marah dan langsung naik mimbar sambil bersabda: 'Tidaklah kalian bertanya kepadaku mengenai sesuatu, melainkan aku selalu jelaskan kepada kalian', lantas aku melihat kanan-kiri, tak tahunya setiap orang menutupi kepalanya dengan pakaiannya sambil menangis, Secara spontan muncullah seseorang yang jika bermusuhan, ia dipanggil dengan nasab selain ayahnya, maka orang itu berujar 'Wahai nabiyullah siapakah ayahku? Beliau menjawab: 'ayahmu adalah Hudzafah.\" Umarpun bergegas mengucapkan RADHIINA BILLAHI RABBAN WABIL ISLAAMI DIINAN WABI MUHAMMADIN shallallahu 'alaihi wasallam RASUULAN NA'UUDZU BILLAH MINAL FITANI (Kami ridha Allah sebagai Tuhan, Islam sebagai agama, dan Muhammad sebagai utusan, kami berlindung kepada Allah dari fitnah), lantas Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku belum pernah melihat keburukan dan kebaikan sama sekali seperti hari ini, sebab hari ini neraka dan surga digambarkan bagiku hingga aku melihat kedua-duanya berada dibalik dinding ini. Dan Qatadah selalu menyebutkan hadits ini ketika membaca ayat 'Wahai orang-orang yang beriman, janganlah kalian bertanya tentang sesuatu yang sekiranya diungkapkan kepada kalian, justru malah menyusahkan kalian.\" (QS. Al Maidah; 101)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6363,
			"arabicnumber": 6363,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Isma'il bin Ja'far] dari ['Amru bin Abu 'Amru] bekas budak Al Mutthalib bin Abdullah bin Hanthab, bahwa dia mendengar [Anas bin Malik] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada Abu Thalhah: \"Berilah aku seorang pelayan lelaki dari yang kamu miliki hingga ia bisa membantuku.\" Abu Thalhah lalu keluar dengan membawaku di belakang boncengannya. Aku lalu menjadi pelayan Rasulullah shallallahu 'alaihi wasallam. Setiap kali beliau singgah pada suatu tempat, beliau banyak membaca: 'ALLAHUMMA INNI A'UUDZUBIKA MINAL HAMMI WAL HAZANI WAL 'AJZI WAL KASALI WAL BUKHLI WAL JUBNI WA DLALA'ID DAINI WA 'ALAIHI WA GHALABATIR RIJAALI (Ya Allah, aku berlindung kepada-Mu dari keluh kesah dan kesedihan, dari kelemahan dan kemalasan, dari sifat bakhil dan penakut, dan dari lilitan hutang dan penindasan) '. Aku selalu melayani (keperluan) beliau hingga kembali dari Khaibar, beliau kembali dengan membawa (mengiring) Shafiyah binti Huyai. Dan aku lihat beliau menutupinya dengan kain kemudian memboncengkannya di belakang beliau. Sehingga ketika kami tiba di daerah Shahba`, beliau membuat hais dalam bejana dari kulit, kemudian beliau menyuruh agar aku mengundang para sahabat. Setelah itu mereka menyantap hidangan tersebut, itulah awal rumah tangga beliau dengannya. Kemudian beliau melanjutkan perjalanan, hingga ketika Uhud telah terlihat, beliau bersabda: \"Ini adalah gunung yang kita mencintainya dan dia mencintai kita.\" Ketika memasuki kota Madinah beliau mengatakan: \"Ya Allah, sesungguhnya aku mengharamkan apa yang ada di antara dua gunungnya (Madinah), sebagaimana Ibrahim mengharamkan (mensucikan) Makkah. Ya Allah, berkahilah mereka dalam mud dan sha' mereka",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6364,
			"arabicnumber": 6364,
			"text": "Telah menceritakan kepada kami [Humaidi] telah menceritakan kepada kami [Sufran] telah menceritakan kepada kami [Musa bin 'Uqbah] dia berkata; saya mendengar [Ummu Khalid Binti Khalid] -kata Musa; dan belum ada yang mendengar seorang pun dari Nabi shallallahu 'alaihi wasallam selain dia- Ummu Khalid berkata; \"Saya mendengar Nabi Shallallahu 'alahi wasallam meminta perlindungan dari siksa kubur",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6365,
			"arabicnumber": 6365,
			"text": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abdul Malik] dari [Mush'ab] bahwa [Sa'd] pernah memerintahkan lima perkara, dia menyebutkan perkara itu dari nabi Shallallahu 'alahi wasallam, bahwa beliau memerintahkan hal itu juga, yaitu; \"ALLAHUMMA INNI A'UUDZU BIKA MINAL BUKHLI, WA A'UUDZU BIKA MINAL JUBNI, WA A'UUDZU BIKA AN URADDA ILAA ARDZALIL 'UMUR WA A'UUDZU BIKA MIN FITNATID DUNYA -yaitu firnah Dajjal- WA A'UUDZUBIKA MIN 'ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari sifat kikir, aku berlindung kepada-Mu dari sifat pengecut, aku berlindung kepada-Mu kepikunan, aku berlindung dari fitnah dunia -maksudnya adalah fitnah dajjal- dan aku berlindung kepada-Mu dari siksa kubur)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6366,
			"arabicnumber": 6366,
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Wa`il] dari [Masruq] dari [Aisyah] dia berkata; \"Dua orang wanita tua dari Yahudi Madinah datang kepadaku, lalu keduanya berkata kepadaku; \"Sesungguhnya penghuni kubur ada yang disiksa di kubur mereka.\" Namun aku mengingkarinya bahkan aku merasa tidak perlu untuk mempercayai keduanya, sesaat kemudian Nabi Shallallahu 'alahi wasallam masuk menemuiku, lalu aku beritahukan kepada beliau perihal ucapan dua wanita tua tersebut, maka beliau bersabda: \"Mereka berdua benar, sesungguhnya orang-orang ada yang disiksa (dalam kuburnya) yang dapat di dengar oleh setiap binatang.\" Setelah itu aku tidak pernah melihat beliau melainkan selalu memohon perlindungan dari siksa kubur selepas shalat",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6367,
			"arabicnumber": 6367,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Mu'tamir] dia berkata; saya mendengar [Ayahku] dia berkata; saya mendengar [Anas bin Malik] radliallahu 'anhu berkata; Nabi Shallallahu 'alahi wasallam selalu mengucapkan: \"ALLAHUMMA INNI A'UUDZUBIKA MINAL 'AJZI WAL KASALI WAL JUBNI WAL BUKHLI WAL HARAMI WA A'UUDZUBILKA MIN 'ADZAABIL QABRI WA A'UUDZUBIKA MIN FITNATIL MAHYAA WAL MAMAAT (Ya Allah, aku berlindung kepada-Mu dari kelemahan, kemalasan, pengecut, kekikiran dan kepikunan. Dan aku berlindung kepada-Mu dari siksa kubur dan berlindung kepada-Mu dari fitnah kehidupan dan kematian)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6368,
			"arabicnumber": 6368,
			"text": "Telah menceritakan kepada kami [Mu'alla bin Asad] telah menceritakan kepada kami [Wuhaib] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha bahwa Nabi Shallallahu 'alahi wasallam biasa mengucapkan: \"ALLAHUMMA INNI A'UUDZUBIKA MINAL KASALI WAL HARAMI WAL MA`TSAMI WAL MAGHRAMI WAMIN FITNATIL QABRI WA 'ADZAABIL QABRI WAMIN FITNATIN NAARI WA 'AZAABIN NAARI WAMIN SYARRI FITNATIL GHANIY WA 'A'UUDZUBIKA MIN FITNATIL FAQRI WA A'UUDZUBIKA MIN FITNATIL MASIIHID DAJJAL, ALLHUMMAGHSIL 'ANNII KHATHAAYAYA BIMAAIS SALJI WALBARADI WANAQQI QALBII MINAL KHATHAAYAYA KAMAA NAQQAITATS TSAUBAL ABYADL MINAD DANAS WABAA'ID BAINI WABAINAL KHATHAAYAYA KAMAA BAA'ADTA BAINAL MASYRIQI WAL MAGHRIBI (Ya Allah, aku berlindung kepada-Mu dari rasa malas, kepikunan, kesalahan dan terlilit hutang, dan dari fitnah kubur serta siksa kubur, dan dari fitnah neraka dan siksa neraka dan dari buruknya fitnah kekayaan dan aku berlindung kepada-Mu dari buruknya fitnah kefakiran serta aku berlindung kepada-Mu dari fitnah Al Masih Ad Dajjal. Ya Allah, bersihkanlah kesalahan-kesalahanku dengan air salju dan air embun, sucikanlah hatiku dari kotoran-kotoran sebagaimana Engkau menyucikan baju yang putih dari kotoran. Dan jauhkanlah antara diriku dan kesalahan-kesalahanku sebagaimana Engkau jauhkan antara timur dan barat)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6369,
			"arabicnumber": 6369,
			"text": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Sulaiman] dia berkata; telah menceritakan kepadaku ['Amru bin Abu 'Amru] dia berkata; saya mendengar [Anas bin Malik] dia berkata; Nabi shallallahu 'alaihi wasallam mengucapkan: \"ALLAHUMMA INII A'UUDZUBIKA MINAL HAMMI WAL HAZANI WAL 'AJZI WAL KASALI WALJUBNI WALBUKHLI WADLALA'ID DAINI WAGHALABATIR RIJAALI (Ya Allah, aku berlindung kepada-Mu dari rasa sedih dan duka cita, lemah dan malas, pengecut dan kikir dan terlilit hutang serta dikuasai musuh)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6370,
			"arabicnumber": 6370,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepadaku [Ghundar] telah menceritakan kepada kami [Syu'bah] dari [Abdul Malik bin Umair] dari [Mush'ab bin Sa'd] dari [Sa'd bin Abu Waqash] radliallahu 'anhu bahwa dia memerintahkan lima perkara, dan dia pernah menceritakan tentang hal itu dari Rasulullah shallallahu 'alaihi wasallam, yaitu; \"ALLAHUMMA INNI A'UUDZU BIKA MINAL BUKHLI, WA A'UUDZU BIKA MINAL JUBNI, WA A'UUDZU BIKA MIN AN URADDA ILAA ARDZALIL 'UMUR WA A'UUDZU BIKA MIN FITNATID DUNYA, WA A'UUDZUBIKA MIN 'ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari sifat kikir, aku berlindung kepada-Mu dari sifat pengecut, aku berlindung kepada-Mu kepikunan, aku berlindung dari fitnah dunia dan aku berlindung kepada-Mu dari siksa kubur)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6371,
			"arabicnumber": 6371,
			"text": "Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami [Abdul Warits] dari [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] radliallahu 'anhu dia berkata; \"Rasulullah Shallallahu 'alahi wasallam sering meminta perlindungan, beliau mengucapkan: \"ALLAHUMMA INNI A'UUDZUBIKA MINAL KASALI WA A'UUDZUBIKA MINAL JUBNI WA A'UUDZUBIKA MINAL HARAMI WA A'UUDZUBIKA MINAL BUKHLI (Ya Allah, aku berlindung kepada-Mu dari sifat malas, dan berlindung kepada-Mu dari sifat pengecut, dan berlindung kepada-Mu dari sifat pikun dan aku berlindung kepada-Mu dari sifat kikir)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6372,
			"arabicnumber": 6372,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha dia berkata; Nabi Shallallahu 'alahi wasallam bersabda: \"Ya Allah, berilah kecintaan kami terhadap Madinah sebagaimana kecintaan kami terhadap Makkah atau lebih cinta lagi, dan pindahkanlah demamnya ke daerah Juhfah, ya Allah berkahilah kami di mud dan sha' kami",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6373,
			"arabicnumber": 6373,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Ibrahim bin Sa'd] telah mengabarkan kepada kami [Ibnu Syihab] dari ['Amir bin Sa'd] bahwa [Ayahnya] berkata; \"Ketika Rasulullah Shallallahu 'alahi wasallam haji wada', beliau datang menjengukku ketika aku terbaring sakit yang menyebabkan kematianku, lalu saya berkata; \"Wahai Rasulullah, keadaan saya semakin parah, seperti yang telah anda lihat saat ini, sedangkan saya adalah orang yang memiliki banyak harta, sementara saya hanya memiliki seorang anak perempuan yang akan mewarisi harta peninggalan saya, maka bolehkah saya menyedekahkan dua pertiga dari hartaku?\" beliau bersabda: \"Jangan.\" Saya bertanya lagi; \"Kalau begitu, bagaimana jika separuhnya?\" beliau menjawab: \"Jangan, (namun sedekahkanlah sepertiganya saja), dan sepertiganya pun sudah banyak, sebenarnya bila kamu meninggalkan ahli warismu dalam keadaan kaya, itu lebih baik daripada kamu meninggalkan mereka dalam keadaan serba kekurangan dan meminta-minta kepada orang lain. Tidakkah Kamu menafkahkan suatu nafkah dengan tujuan untuk mencari ridla Allah, melainkan kamu akan mendapatkan pahala lantaran dari nafkah pemberianmu itu, hingga sesuap makanan yang kamu suguhkan kemulut istrimu juga merupakan sedekah darimu.\" Saya bertanya lagi; \"Apakah saya masih tetap hidup, sesudah teman-teman saya meninggal dunia?\" beliau menjawab: \"Sesungguhnya kamu tidak akan panjang umur, kemudian kamu mengerjakan suatu amalan dengan tujuan untuk mencari ridla Allah, kecuali derajatmu akan semakin bertambah, semoga kamu dipanjangkan umurmu sehingga kaum Muslimin mendapatkan manfa'at darimu dan orang-orang (kafir) menderita kerugian karenamu. Ya Allah… sempurnakanlah hijrah para sahabatku dan janganlah Engkau kembalikan mereka kepada kekufuran, akan tetapi alangkah kasihannya Sa'd bin Khaulah.\" Sa'd berkata; \"Kemudian Nabi shallallahu 'alaihi wasallam mendo'akannya agar ia meninggal di kota Makkah",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6374,
			"arabicnumber": 6374,
			"text": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Al Husain] dari [Za`idah] dari [Abdul Malik] dari [Mush'ab bin Sa'd] dari [Ayahnya] dia berkata; \"Mohon perlindunganlah kalian dengan beberapa kalimat yang digunakan oleh Nabi Shallallahu 'alahi wasallam, yaitu; \"ALLAHUMMA INNII A'UUDZU BIKA MINAL JUBNI, WA A'UUDZU BIKA MINAL BUKHLI, WA A'UUDZU BIKA MIN AN URADDA ILAA ARDZALIL 'UMUR WA A'UUDZU BIKA MIN FITNATID DUNYA WA 'ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari sifat pengecut, aku berlindung kepada-Mu dari sifat kikir, aku berlindung kepada-Mu kepikunan, aku berlindung dari fitnah dunia dan siksa kubur)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6375,
			"arabicnumber": 6375,
			"text": "Telah menceritakan kepada kami [Yahya bin Musa] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] bahwa Nabi Shallallahu 'alahi wasallam selalu mengucapkan: \"ALLAHUMMA INNI A'UUDZUBIKA MINAL KASALI WAL HARAMI WAL MAGHRAMI WAL MA`TSAMI, ALLAHUMMA INNI A'UUDZUBIKA MIN 'ADZAABIN NAAR WAFITNATIN NAARI WAMIN FITNATIL QABRI WA 'ADZAABIL QABRI WASYARRI FITNATIL GHANIY WASYARRI FITNATIL FAQRI WAMIN SYARRI FITNATIL MASIIHID DAJJAL, ALLHUMMAGHSIL KHATHAAYAYA BIMAAIS SALJI WALBARADI WANAQQI QALBII MINAL KHATHAAYAYA KAMAA NAQQAITATS TSAUBUL ABYADL MINAD DANAS WABAA'ID BAINI WABAINAL KHATHAAYAYA KAMAA BAA'ADTA BAINAL MASYRIQI WAL MAGHRIBI (Ya Allah, aku berlindung kepada-Mu dari rasa malas, kepikunan, terlilit hutang, dan dari kesalahan dan dari fitnah neraka serta siksa neraka, dan dari fitnah kubur dan siksa kubur dan dari buruknya fitnah kekayaan dan dari buruknya fitnah kefakiran serta fitnah Al Masih Ad Dajjal. Ya Allah, bersihkanlah kesalahan-kesalahanku dengan air salju dan air embun, sucikanlah hatiku dari kotoran-kotoran sebagaimana Engkau menyucikan baju yang putih dari kotoran. Dan jauhkanlah antara diriku dan kesalahan-kesalahanku sebagaimana Engkau jauhkan antara timur dan barat)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6376,
			"arabicnumber": 6376,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Salam bin Abu Muthi'] dari [Hisyam] dari [Ayahnya] dari [Bibinya] bahwa Nabi shallallahu 'alaihi wasallam biasa meminta perlindungan dengan (membaca): \"ALLAHUMMA INNI A'UUDZUBIKA MIN FITNATIN NAAR WAMIN 'ADZAABIN NAAR WA A'UUDZUBIKA MIN FITNATIL QABRI WA A'UUDZUBIKA MIN 'ADZAABIL QABRI WA A'UUDZUBIKA MIN FITNATIL GHANIY WA A'UUDZUBIKA MIN FITNATIL FAQRI WA A'UUDZUBIKA MIN FITNATIL MASIIHID DAJJAL (Ya Allah, aku berlindung kepada-Mu dari fitnah neraka dan siksa neraka, aku berlindung kepada-Mu dari fitnah kubur dan siksa kubur, aku berlindung kepada-Mu dari fitnah kekayaan dan aku berlindung kepada-Mu dari fitnah kefakiran dan aku berlindung kepada-Mu dari fitnah Dajjal)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6377,
			"arabicnumber": 6377,
			"text": "Telah menceritakan kepada kami [Muhammad] telah mengabarkan kepada kami [Abu Mu'awiyah] telah mengabarkan kepada kami [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha dia berkata; Nabi Shallallahu 'alahi wasallam sering mengucapkan do'a: 'ALLAHUMMA INNI A'UUDZUBIKA MIN FITNATIN NAAR WA 'ADZAABIN NAARI WA FITNATIL QABRI WA 'ADZAABIL QABRI WASYARRI FITNATIL GHANIY WASYARRI FITNATIL FAQRI, ALLAHUMMA INNI A'UUDZUBIKA MIN SYARRI FITNATIL MASIIHID DAJJAL, ALLAHUMMAGHSIL QALBII BIMAAIS SALJI WAL BARADI WANAQQI QALBII MINAL KHATHAAYAYA KAMAA NAQQAITATS TSAUBUL ABYADL MINAD DANAS WABAA'ID BAINI WABAINAL KHATHAAYAYA KAMAA BAA'ADTA BAINAL MASYRIQI WAL MAGHRIBI, ALLAHUMMA INNI A'UUDZUBIKA MINAL KASALI WAL MA`TSAMI WAL MAGHRAMI.\" (Ya Allah, aku berlindung kepada-Mu dari fitnah neraka serta siksa neraka, dan dari fitnah kubur dan siksa kubur dan dari buruknya fitnah kekayaan dan dari buruknya fitnah kefakiran. Dan aku berlindung kepada-Mu dari keburukan fitnah Al Masih Ad Dajjal. Ya Allah, bersihkanlah hatiku dengan air salju dan air embun, sucikanlah hatiku dari kotoran-kotoran sebagaimana Engkau menyucikan baju yang putih dari kotoran. Dan jauhkanlah antara diriku dan kesalahan-kesalahanku sebagaimana Engkau jauhkan antara timur dan barat. Ya Allah, aku berlindung kepada-Mu dari rasa malas, kesalahan dan terlilit hutang)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6379,
			"arabicnumber": 6379,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6381,
			"arabicnumber": 6381,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6382,
			"arabicnumber": 6382,
			"text": "Telah menceritakan kepada kami [Mutharif bin Abdullah Abu Mush'ab] telah menceritakan kepada kami [Abdurrahman bin Abu Al Mawal] dari [Muhammad bin Al Munkadir] dari [Jabir] radliallahu 'anhu dia berkata; Nabi shallallahu 'alaihi wasallam pernah mengajarkan istikharah kepada kami untuk setiap perkara, sebagaimana mengajarkan surat dari Al Qur'an. (Sabdanya): \"Jika salah seorang dari kalian menginginkan sesuatu maka hendaknya ia mengerjakan dua raka'at lalu ia mengucapkan: ALLAHUMMA INNI ASTAKHIRUKA BI 'ILMIKA WA ASTAQDIRUKA BI QUDRATIKA WA AS'ALUKA MIN FADLIKAL ADZIMI FAINNAKA TAQDIRU WALA AQDIRU WA TA'LAMU WALA A'LAMU WA ANTA A'LAMUL GHUYUB, ALLAHUMMA FAIN KUNTA TA'LAMU HADZAL AMRA (maka ia menyebutkan hajat yang ia inginkan) KHAIRAN LII FII DIENIE WA MA'AASYII WA 'AQIBATI AMRI -atau berkata; FII 'AAJILI AMRII WA AAJILIHI- FAQDURHU LI WA IN KUNTA TA'LAMU ANNA HAADZAL AMRA SYARRAN LI FI DIINII WA MA'AASYII WA 'AAQIBATI AMRII -atau berkata; FII 'AAJILI AMRII WA AAJILIHI- FASHRIFHU 'ANNI WASHRIFNI 'ANHU WAQDURLIIL KHAIRA HAITSU KAANA TSUMMA RADDLINI BIHI. (Ya Allah saya memohon pilihan kepada Engkau dengan ilmu-Mu, saya memohon penetapan dengan kekuasaan-Mu dan saya memohon karunia-Mu yang besar, karena Engkaulah yang berkuasa sedangkan saya tidak berkuasa, Engkaulah yang Maha mengetahui sedangkan saya tidak mengetahui apa-apa, dan Engkau Maha mengetahui dengan segala yang ghaib. Ya Allah jikalau Engkau mengetahui urusanku ini (ia sebutkan hajatnya) adalah baik untukku dalam agamaku, kehidupanku, serta akibat urusanku -atau berkata; baik di dunia atau di akhirat- maka takdirkanlah untukku serta mudahkanlah bagiku dan berilah berkah kepadaku, sebaliknya jikalau Engkau mengetahui bahwa urusanku ini (ia menyebutkan hajatnya) buruk untukku, agamaku, kehidupanku, serta akibat urusanku, -atau berkata; baik di dunia ataupun di akhirat- maka jauhkanlah aku daripadanya, serta takdirkanlah untukku yang baik baik saja, kemudian jadikanlah aku ridla dengannya.) \" Lalu ia menyebutkan hajatnya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6383,
			"arabicnumber": 6383,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Abu Usamah] dari [Buraid bin Abdullah] dari [Abu Burdah] dari [Abu Musa] dia berkata; Nabi shallallahu 'alaihi wasallam meminta diambilkan air, lalu beliau berwudlu, setelah itu beliau mengangkat tangannya sambil berdo'a: \"Ya Allah, ampunilah 'Ubaid Abu 'Amir.\" Hingga aku melihat putih ketiaknya, lalu beliau melanjutkan do'anya: 'Ya Allah, jadikanlah ia termasuk dari orang yang terbaik diantara manusia di hari Kiamat kelak",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6384,
			"arabicnumber": 6384,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Utsman] dari [Abu Musa] radliallahu 'anhu dia berkata; \"Kami bersama Nabi shallallahu 'alaihi wasallam di suatu perjalanan, apabila kami berjalan ke tempat yang agak tinggi, kami pun bertakbir, maka Nabi shallallahu 'alaihi wasallam bersabda: 'Saudara-saudara sekalian, rendahkanlah suara kalian! Sesungguhnya kalian tidak berdoa kepada Dzat yang tuli dan jauh. Tetapi kalian berdoa kepada Dzat Yang Maha Mendengar dan Maha Dekat.' Kemudian beliau mendatangiku, sedangkan diriku tengah membaca; 'Laa haula wa laa quwwata ilIa billaah' (Tiada daya dan upaya kecuali dengan pertolongan AlIah). Kemudian beliau bersabda: 'Hai Abdullah bin Qais, 'Ucapkanlah: Laa haula wala quwwata illaa billaah, karena itu adalah salah satu dari perbendaharaan surga -atau beliau bersabda; 'Maukah aku tunjukkan kepadamu suatu kalimat, yang termasuk salah satu dari perbendaharaan surga? Yaitu; Laa haula walaa quwwata illaa billah' (Tiada daya dan upaya kecuali dengan pertolongan AIIah)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6385,
			"arabicnumber": 6385,
			"text": "Telah menceritakan kepada kami [Isma'il] dia berkata; telah menceritakan kepadaku [Malik] dari [Nafi'] dari [Abdullah bin Umar] radliallahu 'anhuma bahwa: \"Apabila Rasulullah shallallahu 'alaihi wasallam telah kembali dari peperangan, haji atau umrah, maka beliau mengucapkan takbir di setiap tempat yang tinggi sebanyak tiga kali kemudian beliau membaca: 'Tidak ada Ilah selain Allah, Yang Maha Esa, yang tidak ada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya pujian. Dia berkuasa atas segala sesuatu. Kita berserah diri, bertaubat, beribadah, bersujud kepada Rabb kita dengan terus memuji-Nya, Allah akan menepati janji-Nya, dan menolong hamba-Nya dan mengalahkan golongan-golongan kafir dengan sendiri-Nya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6386,
			"arabicnumber": 6386,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Hammad bin Zaid] dari [Tsabit] dari [Anas] radliallahu 'anhu dia berkata; Nabi shallallahu 'alaihi wasallam melihat bekas shufrah (minyak wangi berwarna kuning) pada Abdurrahman bin 'Auf, maka beliau pun bertanya: \"Bagaimana keadaanmu? -Atau bersabda- bagaimana kabarmu? Ia menjawab; 'Sesungguhnya aku telah menikahi seorang wanita dengan mahar seberat biji kurma.' Beliau besabda: 'Semoga Allah memberkahimu, adakanlah pesta perkawinan meskipun dengan seekor kambing",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6387,
			"arabicnumber": 6387,
			"text": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Amru] dari [Jabir] radliallahu 'anhu dia berkata; \"Ayahku telah meninggal dan meninggalkan tujuh atau sembilan anak perempuan, oleh karena itu aku menikahi wanita.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: 'Apakah kamu sudah nikah wahai Jabir? ' Jawabku; 'Ya, sudah.' Beliau bersabda: 'Gadis atau janda? ' Aku menjawab; 'Janda.' Beliau bersabda: 'Tidakkah kamu pilih gadis, hingga kamu bisa bercumbu dengannya dan dia bisa bercumbu denganmu, atau kamu dapat bergurau dengannya dan dia dapat bergurau denganmu? ' Aku menjawab; 'Ayahku telah meninggal dunia dengan meninggalkan tujuh atau sembilan anak perempuan, dan aku tidak suka jika aku menikah dengan wanita yang seumur dengan mereka. Oleh karena itu, aku menikahi wanita yang dapat mengurusi mereka.' Beliau bersabda: 'Semoga Allah memberkahimu.' Namun [Ibnu Uyainah] dan [Muhammad bin Muslim] dari ['Amru] tidak mengatakan; 'Semoga Allah memberkahimu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6388,
			"arabicnumber": 6388,
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Salim] dari [Kuraib] dari [Ibnu Abbas] radliallahu 'anhuma dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sekiranya salah seorang diantara kalian hendak mendatangi isterinya, maka ucapkanlah; 'BISMILLAHI ALLAHUMMA JANNIBNASY SYAITHAANA WAJANNIBIS SYAITHAANA MAA RAZAQTANAA' Dengan nama Allah, jauhkanlah kami dari setan dan jauhkanlah setan terhadap sesuatu yang Engkau anugerahkan kepada kami, jika ditakdirkan memperoleh anak dari keduanya, maka setan tidak akan mampu membahayakannya selama-lamanya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6389,
			"arabicnumber": 6389,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdul Warits] dari [Abdul Aziz] dari [Anas] dia berkata; \"Do'a yang paling banyak dipanjatkan Nabi shallallahu 'alaihi wasallam adalah: 'RABBANAA AATINAA FID DUN-YAA HASANAH WAFIL AAKHIRATI HASANAH WAQINAA 'ADZAABAN NAAR Wahai Rabb kami, karuniakanlah kepada kami kebaikan di dunia dan akhirat, dan hindarkanlah kami dari siksa api neraka",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6390,
			"arabicnumber": 6390,
			"text": "Telah menceritakan kepada kami [Farwah bin Abu Al Maghra`] telah menceritakan kepada kami ['Ubaidah bin Humaid] dari [Abdul Malik bin 'Umair] dari [Mush'ab bin Sa'd bin Abu Waqqash] dari [Ayahnya] radliallahu 'anhu dia berkata; Nabi shallallahu 'alaihi wasallam pernah mengajari kami beberapa kalimat (do'a) sebagaimana beliau kamu belajar menulis, yaitu; \"ALLAHUMMA INNI A'UUDZU BIKA MINAL BUKHLI, WA A'UUDZU BIKA MINAL JUBNI, WA A'UUDZU BIKA AN URADDA ILAA ARDZALIL 'UMUR WA A'UUDZU BIKA MIN FITNATID DUNYA WA 'ADZAABIL QABRI Ya Allah, aku berlindung kepada-Mu dari sifat kikir, aku berlindung kepada-Mu dari sifat pengecut, aku berlindung kepada-Mu dari kepikunan, aku berlindung kepada-Mu dari fitnah dunia dan siksa kubur",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6391,
			"arabicnumber": 6391,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Mundzir] telah menceritakan kepada kami [Anas bin 'Iyadl] dari [Hisyam] dari [ayahnya] dari [Aisyah] radliallahu 'anha bahwa Rasulullah shallallahu 'alaihi wasallam terkena sihir, sehingga beliau pun dibuat seakan-akan telah melakukan sesuatu pekerjaan yang beliau tidak kerjakan. Sampai beliau selalu berdo'a kepada Rabbnya, kemudian beliau bersabda: \"Wahai Aisyah, apakah kamu telah merasakan bahwa Allah telah memberikan fatwa (menghukumi) dengan apa yang telah aku fatwakan (hukumi)?\" Aisyah berkata; 'Apa itu wahai Rasulullah? ' Beliau menjawab: 'Dua orang laki-laki telah datang kepadaku, lalu salah seorang dari keduanya duduk di atas kepalaku dan satunya lagi di kakiku. Kemudian salah seorang berkata kepada yang satunya; 'Menderita sakit apakah laki-laki ini? ' temannya menjawab; 'Terkena sihir.' Salah seorang darinya bertanya; 'Siapakah yang menyihirnya? ' Temannya menjawab; 'Labid bin Al A'sham.' Salah seorang darinya bertanya; 'Dengan benda apakah (dia menyihir)? ' Temannya menjawab; 'Dengan rambut yang terjatuh (ketika disisir) dan seludang mayang kurma.' Salah seorang darinya bertanya; 'Di manakah benda itu di letakkan?\" Temannya menjawab; 'Di dalam sumur Dzarwan.' -Dzarwan adalah sumur yang terletak di Bani Zuraiq- Aisyah melanjutkan; 'Kemudian Rasulullah shallallahu 'alaihi wasallam mendatanginya, lalu beliau kembali menemui Aisyah, beliau lalu bersabda: 'Demi Allah, seakan-akan airnya berubah bagaikan rendaman pohon inai dan seakan-akan pohon kurmanya bagaikan kepala syetan.' Aisyah berkata; 'Lalu Rasulullah shallallahu 'alaihi wasallam datang dan memberitahukan mengenai sumur tersebut, lantas aku bertanya; 'Wahai Rasulullah, tidakkah anda mengeluarkannya? ' Beliau menjawab: 'Tidak, sesungguhnya Allah telah menyembuhkanku dan aku tidak suka bila memberikan kesan buruk kepada orang lain dari peristiwa itu.' [Isa bin Yunus] dan [Al Laits bin Sa'd] menambahkan; dari [Hisyam] dari [Ayahnya] dari [Aisyah] dia berkata; 'Nabi shallallahu 'alaihi wasallam disihir, lalu beliau selalu berdo'a dan berdo'a ….' Kemudian dia melanjutkan hadits tersebut",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6392,
			"arabicnumber": 6392,
			"text": "Telah menceritakan kepada kami [Ibnu Salam] telah mengabarkan kepada kami [Waki'] dari [Ibnu Abu Khalid] dia berkata; saya mendengar [Ibnu Abu Aufa] radliallahu 'anhuma berkata; Rasulullah shallallahu 'alaihi wasallam pernah berdo'a ketika perang Ahzab, sabdanya: \"Ya Allah, Dzat yang menurunkan kitab, Dzat yang segera membuat perhitungan, hancurkanlah pasukan Ahzab. Ya Allah hancurkanlah mereka dan cerai beraikanlah mereka",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6393,
			"arabicnumber": 6393,
			"text": "Telah menceritakan kepada kami [Mu'adz bin Fadlalah] telah menceritakan kepada kami [Hisyam bin Abu Abdullah] dari [Yahya] dari [Abu Salamah] dari [Abu Hurairah] Nabi shallallahu 'alaihi wasallam biasa membaca do'a qunut setelah mengucapkan: \"Sami'allahu liman hamidah\" -di raka'at terakhir dari shalat Isya'- yaitu; 'Ya Allah, selamatkanlah 'Ayyasy bin Abu Rabi'ah. Ya Allah, selamatkanlah Khalid bin Walid. Ya Allah, selamatkanlah Salamah bin Hisyam. Ya Allah, selamatkanlah golongan yang lemah dari kaum mukminin. Ya Allah, timpakanlah kerasnya siksa-Mu kepada Mudlar dan jadikanlah siksa-Mu untuk mereka berupa paceklik seperti paceklik yang terjadi pada zaman Nabi Yusuf",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6394,
			"arabicnumber": 6394,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Ar Rabi'] telah menceritakan kepada kami [Abu Al Ahwash] dari ['Ashim] dari [Anas] radliallahu 'anhu; Nabi shallallahu 'alaihi wasallam pernah mengutus suatu pasukan, yang terkenal dengan qurra` (para penghafal Al Qur'an), lalu mereka dibunuh, maka belum pernah kulihat Nabi Shallallahu'alaihi wasallam bersedih atas suatu bencana seperti halnya kesedihan beliau atas kematian sahabatnya tersebut. Lalu beliau qunut selama sebulan di shalat shubuh sambil mengucapkan; \"Sesungguhnya 'Ushayyah telah bermaksiat terhadap Allah dan Rasul-Nya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6395,
			"arabicnumber": 6395,
			"text": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Hisyam] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] radliallahu 'anha dia berkata; \"Orang-orang Yahudi menyalami Nabi shallallahu 'alaihi wasallam dengan mengatakan; 'Assaamu'alaikum' Semoga kebinasaan atasmu. Ternyata Aisyah memahami ucapan mereka, lalu dia berkata; 'Wa'alaikumus saam wal la'nat Semoga kecelakaan dan laknat tertimpa atas kalian).' Lalu Nabi shallaallahu 'alaihi wa sallam bersabda: 'Pelan-pelanlah wahai Aisyah, sesungguhnya Allah mencintai sikap lemah lembut pada setiap perkara.' Aisyah berkata; 'Wahai Rasulullah! Apakah engkau tidak mendengar apa yang telah mereka katakan? ' Beliau menjawab: 'Apakah kamu tidak mendengar bahwa saya telah menjawab ucapan mereka, aku berkata; 'WA 'ALAIKUM' Dan semoga atas kalian juga",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6396,
			"arabicnumber": 6396,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Al Anshari] telah menceritakan kepada kami [Hisyam bin Hasan] telah menceritakan kepada kami [Muhammad bin Sirin] telah menceritakan kepada kami ['Abidah] telah menceritakan kepada kami [Ali bin Abu Thalib] radliallahu 'anhu dia berkata; \"Kami bersama Nabi shallallahu 'alaihi wasallam ketika perang Khandaq, lalu beliau bersabda: 'Semoga Allah memenuhi kubur mereka dan rumah mereka dengan api sebagaimana mereka menyibukkan kami dari shalat wustha hingga matahari terbenam.'\" Shalat wustha adalah shalat Ashar",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6397,
			"arabicnumber": 6397,
			"text": "Telah menceritakan kepada kami [Ali] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] radliallahu 'anhu; Thufail bin 'Amru datang menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata; \"Wahai Rasulullah, sesungguhnya kabilah Daus telah durhaka dan enggan (melaksanakan perintah), maka do'akanlah supaya mereka binasa.\" Maka orang-orang pun menyangka bahwa beliau akan mendo'akan kebinasaan atas mereka, ternyata beliau bersabda: 'Ya Allah, berilah petunjuk kepada Kabilah Daus dan datangkanlah mereka",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6398,
			"arabicnumber": 6398,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdul Malik bin Shabah] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Ibnu Abu Musa] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam bahwa beliau biasa berdo'a dengan do'a sebagai berikut; \"Ya Allah, ampunilah kesalahan, kebodohan, dan perbuatanku yang terlalu berlebihan dalam urusanku, serta ampunilah kesalahanku yang Engkau lebih mengetahui daripadaku. Ya Allah, ampunilah kesalahanku, kemalasanku, kesengajaanku, kebodohanku, gelak tawaku yang semua itu ada pada diriku. Ya Allah, ampunilah aku atas dosa yang telah berlalu, dosa yang mendatang, dosa yang aku samarkan, dosa yang aku perbuat dengan terang-terangan dan dosa yang Engkau lebih mengetahuinya daripada aku, Engkaulah yang mengajukan dan Engkaulah yang mengakhirkan, serta Engkau Maha Kuasa atas segala sesuatu.\" ['Ubaidullah bin Mu'adz] mengatakan; telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Abu Burdah bin Abu Musa] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6399,
			"arabicnumber": 6399,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami ['Ubaidullah bin Abdul Majid] telah menceritakan kepada kami [Isra`il] telah menceritakan kepada kami [Abu Ishaq] dari [Abu Bakr bin Abu Musa] dan [Abu Burdah] aku mengiranya dari [Abu Musa Al Asy'ari] dari Nabi shallallahu 'alaihi wasallam bahwa beliau biasa berdo'a; \"ALLAHUMMAGHFIRLII KHATHI'ATHII WAJAHLII WA ISRAFII FII AMRII WAMAA ANTA A'LAMU BIHI MINNI ALLAHUMMAGHFIRLII HAZLII WAJIDDII WAKHATHAYAAYA WA'AMDI WAKULLU DZAALIKA 'INDI Ya Allah, ampunilah aku, kesalahan-kesalahanku, kebodohanku, perbuatanku yang melampaui batas di setiap urusanku yang Engkau lebih mengetahui daripadaku. Ya Allah, ampunilah aku, canda tawaku, kesungguhanku, kesalahanku, kesengajaanku dan setiap perkara yang ada padaku",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6400,
			"arabicnumber": 6400,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Isma'il bin Ibrahim] telah mengabarkan kepada kami [Ayyub] dari [Muhammad] dari [Abu Hurairah] radliallahu 'anhu dia berkata; Abu Qasim shallallahu 'alaihi wasallam pernah bersabda: \"Pada hari Jum'at terdapat waktu, yang tidaklah seorang hamba muslim shalat dan meminta kebaikan kepada Allah, kecuali Allah akan mengabulkannya.\" Beliau memberi isyarat dengan tangannya. Kami berkata; 'Yaitu beliau menyempitkannya",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6401,
			"arabicnumber": 6401,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Wahhab] telah menceritakan kepada kami [Ayyub] dari [Ibnu Abu Mulaikah] dari [Aisyah] radliallahu 'anha bahwa sekelompok orang Yahudi datang menemui Nabi shallallahu 'alaihi wasallam, lalu mereka mengucapkan; \"As Saamu 'alaika Kebinasaan atasmu.\" Beliau menjawab: 'Wa 'alaikum Dan atas kalian juga.' Kemudian Aisyah berkata; 'As Saamu 'alaikum wala'anakumullah wa ghadziba 'alaikum Semoga kebinasaan atas kalian, dan laknat Allah serta murka Allah menimpa kalian.' Maka Rasulullah shallallahu 'alaihi wasallam bersabda: 'Pelan-pelan wahai Aisyah, hendaklah kamu berlemah lembut dan janganlah kamu kasar atau berkata keji.' Aku berkata; 'Apakah anda tidak mendengar apa yang diucapkan mereka? ' Beliau bersabda: 'Apakah kamu tidak mendengar ucapanku, sebenarnya aku tadi telah menjawabnya, maka do'aku atas mereka telah dikabulkan, sementara do'a mereka atasku tidak akan terkabulkan",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6402,
			"arabicnumber": 6402,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan], [Az Zuhri] mengatakan; telah menceritakan kepada kami dari [Sa'id bin Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Apabila imam mengucapkan amin, maka ucapkanlah amin, karena para Malaikat pun ikut mengaminkan, maka siapa yang bacaannya amin bertepatan dengan bacaannya Malaikat, akan diampuni dosa-dosanya yang telah lalu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6403,
			"arabicnumber": 6403,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Sumay] dari [Abu Shalih] dari [Abu Hurairah] radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membaca laa ilaaha illallahu wahdahuu laa syariika lahuu, lahul mulku wa lahul hamdu wa huwa 'alaa kulli syai'in qadir Tidak ada ilah (yang berhaq disembah) selain Allah Yang Maha Tunggal tidak ada sekutu bagi-Nya. Milik-Nya kerajaan dan bagi-Nya segala puji dan Dia Maha Kuasa atas segala sesuatu sebanyak seratus kali dalam sehari, maka baginya mendapatkan pahala seperti membebaskan sepuluh orang budak, ditetapkan baginya seratus hasanah (kebaikan) dan dijauhkan darinya seratus keburukan dan baginya ada perlindungan dari (godaan) setan pada hari itu hingga petang dan tidak ada orang yang lebih baik amalnya dari orang yang membaca doa ini kecuali seseorang yang mengamalkan lebih banyak dari itu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6404,
			"arabicnumber": 6404,
			"text": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Abdul Malik bin 'Amru] telah menceritakan kepada kami [Umar bin Abu Za`idah] dari [Abu Ishaq] dari ['Amru bin Maimun] dia berkata; \"Barangsiapa mengucapkannya (Laa ilaaha illallahu wahdahuu laa syariikalah lahul mulku wa lahul hamdu wa huwa 'alaa kulli syai'in qadir) sebanyak sepuluh kali, maka seolah-olah ia telah membebaskan budak dari keturunan Isma'il.\" Umar bin Abu Za`idah mengatakan; telah menceritakan kepada kami [Abdullah bin Abu Safar] dari [Asy Sya'bi] dari [Rabi' bin Khutsaim] seperti hadits tersebut. Lalu aku berkata kepada Rabi' 'Dari manakah kamu mendengar hadits tersebut? ' Dia menjawab; 'Dari [Amru bin Maimun], lalu aku mendatangi 'Amru bin Maimun, lalu aku bertanya; 'Dari manakah kamu mendengar hadits tersebut? ' Dia menjawab; 'Dari [Ibnu Abu Laila], lalu aku pun mendatangi Ibnu Abu Laila dan bertanya; 'Dari manakah kamu mendengar hadits tersebut? ' Dia menjawab; 'Dari [Abu Ayyub Al Anshari] dia pernah bercerita dari Nabi shallallahu 'alaihi wasallam.' [Ibrahim bin Yusuf] juga pernah berkata; dari [Ayahnya] dari [Abu Ishaq] telah menceritakan kepadaku ['Amru bin Maimun] dari [Abdurrahman bin Abu Laila] dari [Abu Ayyub] perkataannya dari Nabi shallallahu 'alaihi wasallam. [Musa] mengatakan; telah menceritakan kepada kami [Wuhaib] dari [Daud] dari ['Amir] dari [Abdurrahman bin Abu Laila] dari [Abu Ayyub] dari Nabi shallallahu 'alaihi wasallam. [Isma'il] mengatakan dari [Asy Sya'bi] dari [Ar Rabi'] pada perkataannya. [Adam] mengatakan; telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abdul Malik bin Maisarah] saya mendengar [Hilal bin Yasaf] dari [Ar Rabi' bin Khutsaim], dan ['Amru bin Maimun] dari [Ibnu Mas'ud] pada perkataannya. [Al A'masy] dan [Hushain] juga mengatakan; dari [Hilal] dari [Ar Rabi'] dari [Abdullah] pada perkataannya. Dan diriwayatkan pula oleh [Abu Muhammad Al Hadlrami] dari [Abu Ayyub] dari Nabi shallallahu 'alaihi wasallam: 'Seperti orang yang membebaskan budak dari keturunan Isma'il.' Abu Abdullah mengatakan; 'Yang benar adalah yang dikatakan oleh Abdul Malik bin 'Amru",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6405,
			"arabicnumber": 6405,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Sumay] dari [Abu Shalih] dari [Abu Hurairah] radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengucapkan 'Subhanallah wabihamdihi Maha suci Allah dan segala pujian hanya untuk-Nya' sehari seratus kali, maka kesalahan-kesalahannya akan terampuni walaupun sebanyak buih di lautan",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6406,
			"arabicnumber": 6406,
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Ibnu Fudlail] dari ['Umarah] dari [Abu Zur'ah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Dua kalimat ringan dilisan, berat ditimbangan, dan disukai Ar Rahman yaitu Subhaanallahul'azhiim dan Subhanallah wabihamdihi",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6407,
			"arabicnumber": 6407,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Abu Usamah] dari [Buraid bin Abdullah] dari [Abu Burdah] dari [Abu Musa] radliallahu 'anhu dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Permisalan orang yang mengingat Rabbnya dengan orang yang tidak mengingat Rabbnya seperti orang yang hidup dengan yang mati",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6408,
			"arabicnumber": 6408,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah mempunyai para malaikat yang selalu berkeliling di jalan-jalan, dan mencari-cari majelis dzikir, jika mereka mendapati suatu kaum yang berdzikir kepada Allah mereka memanggil teman-temannya seraya berkata; 'Kemarilah terhadap apa yang kalian cari.' Lalu mereka pun datang seraya menaungi kaum tersebut dengan sayapnya sehingga memenuhi langit bumi. Maka Rabb mereka bertanya padahal Dia lebih tahu dari mereka; 'Apa yang dikatakan oleh hamba-Ku? ' Para malaikat menjawab; 'Mereka mensucikan Engkau, memuji Engkau, mengagungkan Engkau.' Allah berfirman: 'Apakah mereka melihat-Ku? ' Para malaikat menjawab; 'Tidak, demi Allah mereka tidak melihat-Mu.' Allah berfirman: 'Bagaimana sekiranya mereka melihat-Ku? ' Para malaikat menjawab; 'Sekiranya mereka dapat melihat-Mu pasti mereka akan lebih giat lagi dalam beribadah, lebih dalam mengagungkan dan memuji Engkau, dan lebih banyak lagi mensucikan Engkau, ' Allah berfirman: 'Lalu apa yang mereka minta? ' Para malaikat menjawab; 'Mereka meminta surge.' Allah berfirman: 'Apakah mereka telah melihatnya? ' Para malaikat menjawab; 'Belum, demi Allah mereka belum pernah melihatnya.' Allah berfirman: 'Bagaimana sekiranya mereka telah melihatnya? ' Para malaikat menjawab; 'Jika mereka melihatnya tentu mereka akan lebih berkeinginan lagi dan antusias serta sangat mengharap.' Allah berfirman: 'Lalu dari apakah mereka meminta berlindung? ' Para malaikat menjawab; 'Dari api neraka.' Allah berfirman: 'Apakah mereka telah melihatnya? ' Para malaikat menjawab; 'Belum, demi Allah wahai Rabb, mereka belum pernah melihatnya sama sekali.' Allah berfirman: 'Bagaimana jika seandainya mereka melihatnya? ' Para malaikat menjawab; 'Tentu mereka akan lari dan lebih takut lagi.'\" Beliau melanjutkan: 'Allah berfirman: 'Sesungguhnya Aku telah mempersaksikan kepada kalian bahwa Aku telah mengampuni mereka.' Beliau melanjutkan; 'Salah satu dari malaikat berkata; 'Sesungguhnya diantara mereka ada si fulan yang datang untuk suatu keperluan? ' Allah berfirman: 'Mereka adalah suatu kaum yang majelis mereka tidak ada kesengsaraannya bagi temannya.' Dan telah diriwayatkan pula oleh [Syu'bah] dari [Al A'masy] namun ia tidak merafa'kan hadits tersebut. Dan diriwayatkan pula dari [Suhail] dari [Ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6409,
			"arabicnumber": 6409,
			"text": "Telah menceritakan kepada kami [Muhammad bin Muqatil Abu Al Hasan] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Sulaiman At Taimi] dari [Abu Utsman] dari [Abu Musa Al Asy'ari] dia berkata; \"Nabi shallallahu 'alaihi wasallam pernah lewat di suatu bukit atau berkata; di suatu lembah, tatkala (kondisi jalan) agak naik, salah seorang berseru sambil mengangkat suaranya; \"Laa illaha illallah Allahu Akbar (Tidak ada Tuhan yang berhak disembah kecuali Allah, Allah Maha Besar).\" Abu Musa melanjutkan; 'Ketika itu Rasulullah shallallahu 'alaihi wasallam tengah berada di atas hewan tunggangannya, lalu beliau bersabda: 'Sesungguhnya kalian tidak berdoa kepada Dzat yang tuli dan jauh.' Kemudian beliau bersabda: 'Wahai Abu Musa, -atau- wahai Abdullah, maukah aku tunjukkan kepadamu suatu kalimat yang termasuk dari perbendaharaan surga? ' Aku menjawab; 'Tentu.' Beliau bersabda: 'Laa haula wa laa quwwata ilIa billaah' Tiada daya dan upaya kecuali dengan pertolongan AlIah",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6410,
			"arabicnumber": 6410,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] dia berkata; Kami hafal dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] secara periwayatan, dia berkata; \"Allah memiliki sembilan puluh sembilan nama, seratus kurang satu, tidaklah seseorang menghafalnya melainkan ia akan masuk surga, dan Dia adalah witir dan menyukai yang ganjil",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6411,
			"arabicnumber": 6411,
			"text": "Telah menceritakan kepada kami [Umar bin Hafsh] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] dia berkata; telah menceritakan kepadaku [Syaqiq] dia berkata; Kami pernah menunggu Abdullah, tiba-tiba Yazid bin Mu'awiyah datang, maka kami berkata kepadanya; \"Tidakkah anda duduk?.\" Dia menjawab; 'Tidak, namun aku akan masuk dan akan mengeluarkan saudara kalian (Abdullah) kepada kalian atau kalau tidak, aku akan datang dan duduk.' Setelah itu [Abdullah] keluar dengan menggandeng tangannya Yazid, lalu dia berdiri di hadapan kami seraya berkata; 'Sesungguhnya aku telah diberitahu keadaan kalian, akan tetapi ada suatu hal yang menghalangiku untuk keluar kepada kalian. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam mengatur (penyampaian) nasehat pada kami dalam beberapa hari karena tidak mau membuat kami jemu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 106
			}
		}
	]
}