{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"84": "Expiation for Unfulfilled Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6708,
			"arabicnumber": 6708,
			"text": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Abu Syihab] dari [Ibnu 'Aun] dari [Mujahid] dari [Abdurrahman bin Abu Laila] dari [Ka'b bin Ujrah] mengatakan, aku mendatangi Nabi shallallahu 'alaihi wasallam dan beliau berkata: \"Mendekatlah kesini!\" Aku pun mendekat. Nabi bertanya: \"Apa kamu merasa terganggu oleh kutumu?\" \"Iya\" jawabku. Nabi bersabda: \"Kalau begitu kamu bayar fidyahmu berupa puasa, sedekah atau binatang kurban.\" Dan telah mengabarkan kepadaku Ibnu 'Aun dari Ayyub dengan redaksi; \"Puasa tiga hari, binatang kurban berupa kambing, atau memberi makan enam orang miskin",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6709,
			"arabicnumber": 6709,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri], Sufyan berkata; aku mendengarnya dari mulutnya, dari [Humaid bin Abdurrahman] dari [Abu Hurairah] mengatakan, Seorang lelaki menemui Nabi shallallahu 'alaihi wasallam dan berujar; 'celaka aku! ' \"kenapa denganmu?\" Tanya Nabi, dia Jawab; 'Aku menyetubuhi istriku di bulan Ramadhan.' Nabi bertanya; \"mampukah kamu membebaskan seorang budak?\" 'Tidak, ' Jawabnya. Tanya Nabi: \"Apakah kamu bisa berpuasa dua bulan secara berturut-turut?\" 'Tidak' jawabnya. Tanya Nabi: \"Apakah kamu bisa memberi makan enam puluh orang miskin?\" 'Tidak, ' Jawabnya. Nabi bersabda: \"Kalau begitu duduklah.\" Orang itu pun duduk, dan Nabi membawakan segantang penuh kurma dan berujar: \"Ambillah kurma ini dan pergunakanlah untuk bersedekah!\" Orang tadi menjawab; 'Apakah kepada orang yang lebih miskin dari kami? ' Nabi shallallahu 'alaihi wasallam pun tertawa hingga terlihat gigi serinya dan bersabda: \"berilah makan keluargamu dengannya",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6710,
			"arabicnumber": 6710,
			"text": "Telah menceritakan kepada kami [Muhammad bin Mahbub] telah menceritakan kepada kami [Abdul Wahid] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Humaid bin Abdurrahman] dari [Abu Hurairah] radliallahu 'anhu menuturkan; \"Seorang lelaki mendatangi Rasulullah Shallallahu'alaihi wa sallam dan berujar; 'celaka aku! ' Nabi bertanya; \"sebab apa itu? ' laki-laki itu menjawab: 'Aku telah menggauli isteriku di bulan ramadhan! ' Nabi bertanya: \"mampukah kamu memerdekakan budak?\" 'Tidak' jawabnya. Nabi bertanya lagi: \"mampukah kamu berpuasa dua bulan secara berturut-turut?\" 'tidak' jawabnya. Nabi bertanya lagi: \"mampukah kamu memberi makan enam puluh orang miskin?\" 'Tidak' jawabnya. (Datanglah) seorang sahabat anshar membawa segantang kurma. -Dan maksud istilah 'arq adalah rantang yang berisi kurma.- Maka Nabi berkata kepadanya: \"Bawalah makanan ini, dan sedekahkanlah!\" Lelaki tersebut menjawab; 'Apakah kepada orang yang lebih membutuhkan daripada aku ya Rasulullah? Demi Dzat yang mengutusmu dengan kebenaran, diantara dua lembah ini tidak ada penghuni rumah yang lebih membutuhkan daripada aku.' Lantas Nabi berujar; \"Pergilah dan berilah makan keluargamu dengan kurma ini",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6711,
			"arabicnumber": 6711,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Humaid] dari [Abu Hurairah] mengatakan; seorang lelaki menemui Nabi shallallahu 'alaihi wasallam dan berujar; 'celaka aku! ' Nabi bertanya: \"ada apa dengan kamu?\" jawabnya; 'Aku menggauli isteriku di bulan ramadhan.' Nabi shallallahu 'alaihi wasallam bertanya: \"Apakah engkau mempunyai seorang budak yang bisa kau bebaskan?\" 'tidak' jawabnya. Nabi bertanya lagi: \"Apakah kamu bisa berpuasa selama dua bulan berturut-turut?\" 'Tidak' Jawabnya. Nabi bertanya lagi: \"mampukah kamu memberi makan enam puluh orang miskin?\" 'tidak' jawabnya. Kemudian Nabi shallallahu 'alaihi wasallam diberi segantang kurma dan berujar: \"Ambilah kurma ini dan bersedekah dengannya!\" ia menjawab; 'Apakah kepada orang yang lebih fakir daripada saya? Sungguh diantara dua gunung ini tidak ada orang yang lebih fakir daripada aku!\" maka Nabi berujar: \"Ambillah dan berilah makan keluargamu dengannya",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6712,
			"arabicnumber": 6712,
			"text": "Telah menceritakan kepada kami [Utsman bin Abi Syaibah] telah menceritakan kepada kami [Al Qasim bin Malik Al Muzanni] telah menceritakan kepada kami [Al Ju'aid bin Abdurrahman] dari [As Sa`ib bin Yazid] mengatakan; Satu sha' di jaman Nabi shallallahu 'alaihi wasallam adalah setara satu mud ditambah sepertiga mud kalian sekarang, kemudian di jaman Umar bin Abdul 'Aziz ditambah lagi",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6713,
			"arabicnumber": 6713,
			"text": "Telah menceritakan kepada kami [Mundzir bin Walid Al Jarudi] telah menceritakan kepada kami [Abu Qutaibah yakni Salam] telah menceritakan kepada kami [Malik] dari [Nafi'] mengatakan, [Ibnu Umar] membayar zakat Ramadhan dengan takaran mud Nabi shallallahu 'alaihi wasallam, yaitu mud di masa permulaan, dan membayar kaffarat sumpah dengan ukuran mud Nabi shallallahu 'alaihi wasallam. Abu Qutaibah berkata; Malik mengatakan kepada kami; 'mud kami jauh lebih besar daripada mud kalian, dan kami sependapat tak ada tambahan selain pada mud Nabi shallallahu 'alaihi wasallam.' Sedang Malik mengatakan kepadaku; 'Kalau seorang amir datang kepada kalian, kemudian menetapkan ukuran mudd yang jauh lebih kecil daripada mudd Nabi shallallahu 'alaihi wasallam, dengan takaran mana kalian membayarnya? ' aku menjawab 'kami membayarnya dengan takaran mudd Nabi shallallahu 'alaihi wasallam.' ia mengatakan; 'Bukankah kamu sependapat bahwa urusan hanyasanya kembali kepada mudd Nabi shallallahu 'alaihi wasallam?",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6714,
			"arabicnumber": 6714,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik], bahwasanya Rasulullah Shallallahu'alaihiwasallam pernah memanjatkan doa: \"Ya Allah, berilah mereka barakah dalam takaran mereka, sha' mereka, dan mud mereka",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6715,
			"arabicnumber": 6715,
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdurrahim] telah menceritakan kepada kami [Dawud bin Rasyid] telah menceritakan kepada kami [Al Walid bin Muslim] dari [Abu Ghassan Muhammad bin Mutharrif] dari [Zaid bin Aslam] dari [Ali bin Husain] dari [Sa'id bin Mirjanah] dari [Abu Hurairah], dari Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membebaskan budak muslim, Allah membebaskan setiap anggota tubuhnya karena anggota tubuh yang dibebaskannya dari neraka, hingga Allah membebaskan kemaluannya dari neraka, karena kemaluannya",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6716,
			"arabicnumber": 6716,
			"text": "Telah menceritakan kepada kami [Abu Nu'man] telah mengabarkan kepada kami [Hammad bin Zaid] dari [Amru] dari [Jabir], ada seorang laki-laki Anshar menjanjikan kemerdekaan budaknya jika ia meninggal (mudabbar) padahal ia tidak mempunyai harta selainnya, hal itu sampai kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"Siapa yang mau membelinya dariku?\" Budak itu kemudian dibeli oleh Nu'aim bin Nahham seharga delapan ratus dirham. Kemudian aku mendengar Jabir bin Abdullah mengatakan; 'budak qibthi yang meninggal pada tahun pertama",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6717,
			"arabicnumber": 6717,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibrahim] dari [Al Aswad] dari [Aisyah], bahwa dia ingin membeli Barirah, namun mereka mensyaratkan wala' tetap ada pada mereka, maka Aisyah mengadukan kasus tersebut kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: 'Belilah dia, sedang wala' adalah hak bagi yang membeli",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6718,
			"arabicnumber": 6718,
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6719,
			"arabicnumber": 6719,
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6720,
			"arabicnumber": 6720,
			"text": "Telah menceritakan kepada kami ['Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] dari [Hisyam bin Hujair] dari [Thawus] ia mendengar [Abu Hurairah] menuturkan; 'Sulaiman berkata; 'Aku akan menggilir Sembilan puluh Sembilan isteriku semalaman, yang kesemuanya akan melahirkan anak laki-laki yang berperang fii sabiilillah.' Maka seorang kawannya berujar kepadanya -Sufyan menyatakan bahwa kawannya bernama Malak-; 'Ucapkan insyaa-allah! ' Namun Sulaiman melupakan nasehat ini, sehingga Sulaiman menggilir kesembilan puluh Sembilan isterinya namun tak seorangpun melahirkan anak selain hanya seorang, itupun melahirkan setengah bayi.' Abu Hurairah mengatakan ketika meriwayatkannya; 'Kalaulah Sulaiman mengucapkan; insyaa-allah, niscaya tercapailah keinginanya dan terwujud impiannya.' Sedang pada kesempatan lain Abu Hurairah mengatakan dengan redaksi; Rasulullah Shallallahu'alaihiwasallam bersabda: \"lau istatsna (Sekiranya Sulaiman mengucapkan insyaa-Allah).\" Dan telah menceritakan kepada kami [Abu Az Zanad] dari [Al A'raj] semisal hadits Abu Hurairah",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6721,
			"arabicnumber": 6721,
			"text": "Telah menceritakan kepada kami [Ali bin Hujr] telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Ayyub] dari [Al Qasim at Tamimi] dari [Zahdam Al Jarmi] mengatakan; kami pada Abu Musa yang ketika itu antara kami dan penghuni dusun Jarom terjalin hubungan kekeluargaan, kecintaan dan persahabatan. Kata Zahdam; kami diberi hidangan yang berisi daging ayam. Ditengah perkumpulan itu ada seorang laki-laki dari bani taimullah ahmar yang seakan-akan dia adalah dari kalangan mantan budak, yang tidak mendekati hidangan. Maka [Abu musa] memanggilnya; 'Mendekatlah, sebab aku melihat Rasulullah Shallallahu'alaihi wa sallam juga menyantapnya.' Kata Zahdam; maka aku melihat ia menyantap suatu makanan yang kuanggap jijik. Maka aku bersumpah untuk tidak menyantapnya selama-lamanya. Seketika itu juga Abu musa memanggilku seraya mengatakan; 'Mendekatlah kesini, kukabarkan kepadamu tentang sumpahmu itu. kami pernah mendatangi Rasulullah Shallallahu'alaihi wa sallam bersama sekelompok orang-orang asy'ari dengan niat untuk meminta beliau agar menyediakan kendaraan untuk mengangkut kami, ketika itu beliau sedang membagi-bagikan unta dari unta sedekah.' -Ayyub mengatakan; dalam ucapan Abu Musa ada tambahan redaksi - 'yang ketika itu beliau dalam keadaan marah. Lantas Nabi mengatakan: \"Demi Allah, saya tak menyediakan kendaraan untuk kalian, dan saya tak punya kendaraan kalian.\" Maka kami pun berangkat, selanjutnya Rasulullah Shallallahu'alaihi wa sallam mendapat rampasan berupa sekelompok unta kemudian diserukan: \"dimana orang-orang asy'ari yang meminta kendaraan tadi?\" Kami pun mendatangi beliau, dan beliau memberi kami kurang lebih tiga puluh puluh ekor hingga seratusan unta yang punggungnya putih. -Kata Zahdam, - kami pun meneruskan perjalanan, kemudian saya katakan kepada sahbat-sahabatku; \"kita mula-mula mendatangi Rasulullah Shallallahu'alaihi wa sallam untuk meminta kendaraan, tetapi beliau bersumpah tidak menyediakan kendaraan untuk kita, namun selanjutnya beliau mengutus seorang utusan kepada kita dan menyediakan kendaraan bagi kita. Rupanya Rasulullah Shallallahu'alaihiwasallam telah lupa terhadap sumpahnya, demi Allah, kalaulah Rasulullah Shallallahu'alaihiwasallam melupakan sumpahnya terhadap kita, kita tak akan untung. Mari kembali kita temui Rasulullah Shallallahu'alaihi wa sallam dan kita ingatkan beliau terhadap sumpahnya.' Kami pun pulang dan kami katakan; 'ya Rasulullah, dahulu kami pernah mendatangimu meminta kendaraan untuk mengangkut kami, tetapi anda bersumpah tidak menyediakan kendaran bagi kami, namun akhirnya anda menyediakan kendaraan juga, maka kami mengira anda telah melupakan sumpah anda.' Nabi pun menjawab: \"Teruskan perjalanan kalian, sebab Allah-lah yang menyediakan kendaraan bagi kalian, sesungguhnya aku, demi Allah, insya-Allah, tidak melakukan suatu sumpah kemudian aku melihat selainnya ada yang lebih baik, melainkan akan aku lakukan yang lebih baik dan kubayar kaffarat sumpahku.\" Hadits ini diperkuat oleh [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] dan [Al Qasim bin 'Ashim Al Kalbi]. Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Wahhab] dari [Ayyub] dari [Abu Qilabah] dan [Al Qasim at Tamimi] dari [Zahdam] dengan hadits ini. Dan Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami [Abdul Warits] telah menceritakan kepada kami [Ayyub] dari [Al Qasim] dari [Zahdam] dengan hadits ini",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6722,
			"arabicnumber": 6722,
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdullah] Telah menceritakan kepada kami [Utsman bin Umar bin Faris] telah mengabarkan kepada kami [Ibnu 'Aun] dari [Al Hasan] dari [Abdurrahman bin Samurah] mengatakan, Rasulullah Shallallahu'alaihiwasallam bersabda: \"janganlah kamu meminta kepemimpinan, sebab jika engkau diberi kepemimpinan bukan karena meminta, kamu akan ditolong, namun jika kamu diberi karena meminta, kamu akan ditelantarkan. Jika kamu bersumpah atas suatu sumpah, kemudian melihat ada yang lain lebih baik, maka lakukan yang lebih baik, dan bayarlah kaffarat sumpahmu.\" Hadits ini diperkuat oleh [Asyhal bin Hatim] dari [Ibnu 'Aun] dan diperkuat oleh [Yunus], [Simak bin 'Athiyyah], [Simak bin Harb], [Humaid], [Qatadah], [Manshur] dan [Hisyam] dan [Ar Rabi]",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 15
			}
		}
	]
}