{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"90": "Tricks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6953,
			"arabicnumber": 6953,
			"text": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari [Muhammad bin Ibrahim] dari [Alqomah bin Waqqash] mengatakan, aku mendengar [Umar bin Khaththab] radliallahu 'anhu berpidato, dia mengatakan, aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Hai manusia, hanyasanya amal itu tergantung niyatnya, dan setiap orang mendapatkan sesuai yang diniatkan, barangsiapa hijrahnya karena Allah dan rasul-Nya,, maka hijrahnya dihitung karena Allah dan rasul-Nya, barangsiapa hijrahnya karena dunia yang ingin diperolehnya, atau wanita yang ingin dinikahinya, maka hijrahnya sekedar mendapat yang diniatkan",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6954,
			"arabicnumber": 6954,
			"text": "Telah menceritakan kepadaku [Ishaq bin Nashr] telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Hammam] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Allah tidak menerima shalat salah seorang diantara kalian jika berhadas hingga ia berwudhu",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6955,
			"arabicnumber": 6955,
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdullah Al Anshari] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Tsumamah bin Abdullah bin Anas] bahwasanya [Anas] menceritakan kepadanya, bahwasanya Abu Bakar menuliskan kepadanya kewajiban sedekah sebagaimana Rasulullah Shallallahu'alaihiwasallam wajibkan, hewan ternak yang terpisah tidak boleh dihimpun dan hewan yang terhimpun tidak boleh dipisah, karena takut sedekah (zakat) nya",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6956,
			"arabicnumber": 6956,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Isma'il bin ja'far] dari [Abu Suhail] dari [ayahnya] dari [Thalhah bin Ubaidullah]; ada seorang arab badui menemui Rasulullah shallallahu 'alaihi wasallam dengan rambut acak-acakan, ia berkata; 'ya Rasulullah, beritahukanlah kepadaku shalat apakah yang Allah wajibkan atasku? ' Nabi menjawab: \"shalat lima waktu, kecuali jika engkau mau mengerjakan yang sunnah.\" Si arab badui bertanya lagi: 'Beritahukanlah kepadaku puasa apakah yang Allah wajibkan bagiku? ' Nabi menjawab: \"puasa bulan ramadhan, kecuali jika kamu ingin melaksanakan yang sunnah.\" Si arab badui bertanya; 'Beritahukanlah kepadaku, zakat apakah yang Allah wajibkan atasku? ' maka Rasulullah shallallahu 'alaihi wasallam memberitahukan kepadanya syariat-syariat Islam, dan arab badui tersebut mengatakan; 'Demi Dzat yang memuliakanmu, saya tidak akan melakukan yang sunnah, namun juga tak akan mengurangi sedikitpun yang telah Allah fardhukan atas diriku.' Maka Rasulullah bersabda; \"dia beruntung jika ia jujur atau dengan redaksi -ia masuk surga jika jujur.\" Penulis menuturkan; Sebagian orang mengatakan, bahwa seratus duapuluh unta zakatnya dua hiqqah, dan jika yang punya membelanjakannya secara sengaja, atau meng-hibahkannya atau mencari siasat terhadapnya dengan tujuan untuk tidak berzakat, maka yang demikian dia tak terkena dosa",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6958,
			"arabicnumber": 6958,
			"text": "",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6959,
			"arabicnumber": 6959,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Ibnu Syihab] dari [Ubaidullah bin Abdullah bin Utbah] dari [Ibnu Abbas] bahwasanya ia mengatakan, Sa'ad bin Ubadah Al Anshari pernah meminta fatwa Rasulullah Shallallahu'alaihiwasallam tentang nadzar ibunya yang meninggal sebelum menunaikan nadzarnya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penuhilah nadzarnya\". Sebagian orang mengatakan bahwa jika unta mencapai dua puluh ekor sehingga ia berkewajiban membayar zakat empat ekor kambing, lalu dia menghibahkan unta itu sebelum haul, atau menjualnya dengan niat atau siasat agar tidak terkena wajib zakat, maka tidak ada denda atasnya, demikian pula jika ia menyembunyikannya terus meninggal, maka tidak ada denda dalam hartanya",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6960,
			"arabicnumber": 6960,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ubaidullah] mengatakan, telah menceritakan kepadaku [Nafi'] dari ['Abdullah] radliallahu 'anhu, Rasulullah Shallallahu'alaihiwasallam melarang nikah syighar. Saya bertanya kepada Nafi'; 'Apa maksud syighar? ' Ia menjawab; 'mengawini anak perempuan seseorang lelaki dengan syarat lelaki tersebut dinikahkan dengan anak perempuannya tanpa mahar, atau menikahi saudara perempuan seorang lelaki dengan syarat lelaki tersebut menikahkannya dengan saudara perempuannya tanpa mahar.' Sebagian orang berpendapat; jika seseorang bersiasat sehingga ia nikah syighar, maka perkawinannya boleh dan syaratnya bathil. Dan ia berkata tentang nikah mut'ah; pernikahannya rusak dan syaratnya bathil. Sedang sebagian lain berpendapat bahwa nikah syighar boleh dan syaratnya bathil",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6961,
			"arabicnumber": 6961,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Ubaidullah bin Umar] telah menceritakan kepada kami [Az Zuhri] dari [Al Hasan] dan [Abdullah], kedua anak Muhammad bin Ali, dari [ayah keduanya], bahwa di sampaikan kepada [Ali] radliallahu 'anhu; bahwa Ibnu Abbas menganggap nikah mut'ah tidak masalah, maka Ali berkata; 'Rasulullah telah melarangnya pada hari khaibar, dan beliau melarang daging keledai jinak.' Sebagian orang mengatakan; bahwa jika seseorang menyiasati sehingga nikah mut'ah, maka nikahnya rusak, sedang sebagian yang lain mengatakan nikahnya boleh dan syaratnya bathil",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6962,
			"arabicnumber": 6962,
			"text": "Telah menceritakan kepada kami [Isma'il] telah menceritakan kepada kami [Malik] dari [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh kelebihan air ditahan untuk menahan tumbuhnya rerumputan",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6963,
			"arabicnumber": 6963,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Nafi'] dari [Ibnu Umar], Rasulullah Shallallahu'alaihiwasallam melarang (jual beli) najasy (penipuan)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6964,
			"arabicnumber": 6964,
			"text": "Telah menceritakan kepada kami [Isma'il] telah menceritakan kepada kami [Malik] dari [Abdullah bin Dinar] dari [Abdullah bin Umar] radliallahu 'anhuma; ada seorang laki-laki mengeluhkesahkan dirinya kepada Nabi shallallahu 'alaihi wasallam, karena dirinya sering ditipu dalam jual beli, maka beliau bersabda: \"Jika kamu jual-beli, katakan; 'Namun dengan syarat tak ada penipuan",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6965,
			"arabicnumber": 6965,
			"text": "Telah menceritakan kepada kami [Abul Yaman] telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri] mengatakan, [Urwah] menceritakan; ia bertanya [Aisyah] tentang ayat; 'Jika kalian khawatir tidak bisa berbuat adil terhadap yatimmu, maka nikahilah wanita yang baik-baik bagimu, dua, tiga, atau empat (QS. Annisa'; 3) dia mengatakan; 'yaitu yatim dalam asuhan walinya, dan si wali tersebut kurang menyukai kecantikan dan hartanya, namun tetap akan ia nikahi dengan syarat membayar mahar serendah-rendahnya yang menyalahi adat normal. Maka mereka dilarang menikahi anak-anak yatim tersebut kecuali jika berbuat adil dengan membayar mahar secara sempurna, lantas para sahabat bertanya kepada Rasulullah shallallahu 'alaihi wasallam di kemudian hari, maka Allah menurunkan ayat; 'Mereka meminta fatwa kepadamu,,, dan seterusnya (QS. Annisa' 127), kemudian dia menyebutkan hadits",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6966,
			"arabicnumber": 6966,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Dinar] dari [Abdullah bin Umar] radliallahu 'anhuma dari Nabi shallallahu 'alaihi wasallam bersabda: \"Setiap pengkhianat diberi bendera pada hari kiamat sebagai tanda pengenalnya",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6967,
			"arabicnumber": 6967,
			"text": "Telah menceritakan kepada kami [Muhammad bin Katsir] dari [Sufyan] dari [Hisyam] dari [Urwah] dari [Zainab binti Ummi Salamah] dari [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Saya hanyalah manusia biasa, dan kalian mengadukan sengketa kepadaku, siapa tahu sebagian diantara kalian lebih pandai bersilat lidah dengan alasannya dari sebagian lain, sehingga aku memutuskan sebatas yang aku dengar, maka barangsiapa kuputuskan menang dengan mendzalimi hak saudaranya, janganlah ia mengambilnya, sebab aku akan mengambil sulutan api neraka baginya",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6968,
			"arabicnumber": 6968,
			"text": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] telah menceritakan kepada kami [Yahya bin Abi Katsir] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, bersabda: \"Gadis tidak boleh dinikahi hingga dimintai izin, dan janda tidak bleh dinikahi hingga dimintai persetujuannya.\" Ada yang bertanya; 'ya Rasulullah, bagaimana tanda izinnya? ' Nabi menjawab: \"tandanya diam.\" Sebagian orang berpendapat; Jika seorang gadis belum dimintai izin, kemudian seseorang mencari siasat, kemudian dua orang saksi dusta bersaksi bahwa laki-laki tersebut telah menikahinya dengan kerelaannya, dan hakim memutuskannya secara resmi, dan suami tahu bahwa persaksiannya adalah dusta, maka yang demikian tidak mengapa untuk menyetubuhinya, dan termasuk pernikahan yang sah",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6969,
			"arabicnumber": 6969,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Al Qasim]; bahwa seorang wanita dari anak Ja'far merasa ketakutan (waswas) walinya menikahkannya sedang dia tidak suka, maka ia segera mengutus seseorang menemui dua syaikh dari kalangan anshar, [Abdurrahman] dan [Mujamma'], dua anak Jariyah. Maka keduanya berkata; janganlah khawatir, sebab Khansa` binti Khidzam pernah dinikahkan ayahnya sedang dia tidak suka, maka Nabi shallallahu 'alaihi wasallam menolak pernikahannya. [Sufyan] mengatakan; sedang [Abdurrahman] aku mendengarnya berkata; dari [ayahnya] dengan redaksi; Sesungguhnya Khansa",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6970,
			"arabicnumber": 6970,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syaiban] dari [Yahya] dari [Abu Salamah] dari [Abu Hurairah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janda tidak boleh dinikahi hingga diajak musyawarah, dan gadis tidak boleh dinikahi hingga dimintai izin.\" Para sahabat bertanya; 'bagaimana tanda izinnya? ' Nabi menjawab; \"jika dia diam.\" Sebagian orang mengatakan; bahwa jika seseorang bersiasat dengan menghadirkan dua orang saksi palsu atas perkawinan seorang janda dengan mengatakan atas persetujuannya, kemudian hakim menetapkan pernikahannya, padahal suami tahu bahwa sebenarnya ia belum menikahinya sama sekali, maka pernikahannya tidak masalah, dan tidak apa tinggal bersama dengannya",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6971,
			"arabicnumber": 6971,
			"text": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Ibnu Abi Mulaikah] dari [Dzakwan] dari [Aisyah] radliallahu 'anha mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Gadis dimintai izinnya.\" Saya bertanya; 'Sesungguhnya gadis sering merasa malu untuk menyatakan persetujuannya.' Nabi menjawab; \"tanda izinnya adalah diam.\" Sebagian orang berpendapat bahwa; jika seorang laki-laki tertarik menikahi hamba sahaya yatim atau gadis, lantas anak yatim atau hamba sahaya tadi menolak, lalu si laki-laki mencari siasat dengan menghadirkan dua orang saksi bohong, dengan menyatakan bahwa si laki-laki tadi telah menikahinya dan si perempuan rela, kemudian hakim menerima kesaksian palsu tersebut dan suami mengetahui kebatilan kesaksiannya, maka boleh baginya menyetubuhinya",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6972,
			"arabicnumber": 6972,
			"text": "Telah menceritakan kepada kami [Ubaid bin Isma'il] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [ayahnya] dari [Aisyah], mengatakan; Rasulullah Shallallahu'alaihiwasallam sangat menyukai makanan yang manis-manis dan madu. Adalah kebiasaan beliau, jika beliau telah menunaikan shalat 'ashar, maka beliau melewati isteri-isterinya dan mendekati mereka. Maka Suatu kali beliau menemui Hafshah dan berada di sisinya lebih lama daripada kebiasaan beliau pada hari-hari normal. Maka segera aku tanyai beliau mengapa di rumah Hafshah sekian lama tidak seperti hari-hari biasanya. Beliau menjawab: \"Ada seorang wanita kaumnya menghadiahinya sekaleng madu, lantas ia memberinya minum kepada Rasulullah Shallallahu'alaihiwasallam.\" Maka aku mengatakan; 'Demi Allah, kami pasti akan mengerjai beliau.' Maka aku berkata kepada Saudah; 'jika Rasulullah menemuimu, dan ia mendekatimu, katakanlah kepadanya; 'ya Rasulullah, engkau makan buah mighfar? ' tentu beliau akan mengatakan; 'tidak', maka katakan kepadanya; 'lantas bau apa ini? ' Yang demikian karena Rasulullah shallallahu 'alaihi wasallam merasa risih jika didapati bau yang kurang menyedapkan dari tubuhnya. Maka beliau akan mengatakan; 'Hafshah telah memberiku minuman madu.' Maka katakanlah kepadanya; 'Rasa madu itu telah berubah karena ada sesuatu yang dimakan lebah! ' Dan aku akan mengatakan yang sedemikian, dan katakan begitu ya Shafiyah! ' Maka dikala Nabi shallallahu 'alaihi wasallam menemui Saudah, Saudah mengatakan; 'Demi Dzat yang tiada Tuhan selain Dia, nyaris aku terlebih dahulu bertanya kepada Nabi shallallahu 'alaihi wasallam dengan ucapan yang kau ucapkan padaku, dan Nabi sudah berada di pintu karena takut terhadapmu. Dikala Rasulullah shallallahu 'alaihi wasallam mendekat, saya mengatakan; 'ya Rasulullah, Benarkan, engkau telah makan buah mighfar? ' \"tidak\" Jawabnya. Maka aku katakan; 'lantas bau apa ini? ' Nabi menjawab; \"Hafshah telah memberi madu kepadaku.\" Saya mengatakan; 'rasa madu itu telah berubah karena ada tawon yang memakan sesuatu! ' Ketika beliau menemuiku, kukatakan yang demikian. Dan dikala beliau menemui Shafiyah, ia juga mengatakan yang sedemikian. Maka dikala beliau menemui Hafshah, Hafshah bertanya; 'ya Rasulullah, maukah aku beri minum madu? ' Nabi menjawab: \"Aku tidak butuh terhadapnya.\" Lantas Saudah mengatakan; 'Demi Allah, kita telah mengharamkan madu untuknya.' Aisyah berkata; kukatakan; 'diam kamu",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6973,
			"arabicnumber": 6973,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari [Abdullah bin Amir bin Rabi'ah], Umar bin Khattab radliallahu 'anhu berangkat ke Syam. Ketika dia sampai di suatu kota yang bernama Saragh, dia mendengar berita bahwa wabah sedang menimpa Syam. Maka [Abdurrahman bin Auf] mengabarinya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian mendengar wabah berada di suatu kawasan, janganlah kalian datang kesana, dan jika terjadi di suatu kawasan yang kalian diami, jangan kalian meninggalkannya.\" Spontan Umar meninggalkan kota Saragh. Dan dari [Ibnu Syihab] dari [Salim bin Abdullah], bahwasanya Umar pulang karena hadits Abdurrahman ini",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6974,
			"arabicnumber": 6974,
			"text": "Telah menceritakan kepada kami [Abul yaman] telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri] telah menceritakan kepada kami ['Amir bin Sa'd bin Abi Waqqash], ia mendengar [Usamah bin Zaid] menceritakan kepada Sa'd, bahwasanya Rasulullah shallallahu 'alaihi wasallam memperbincangkan suatu penyakit, beliau bersabda: \"Itu adalah sebagai hukuman dan siksaan yang pernah digunakan untuk menyiksa suatu kaum, kemudian masih ada yang tersisa dari penyakit tersbut, sehingga terkadang datang dan pergi, maka siapa mendengar suatu penyakit melanda sebuah negeri, jangan sesekali ia mendatanginya, dan barangsiapa di suatu negeri yang tengah dilanda penyakit, jangan ia mengungsi dengan niat menghindari penyakit itu",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6975,
			"arabicnumber": 6975,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Ayyub As Sakhtiyani] dari [Ikrimah] dari [Ibnu Abbas] radliallahu 'anhuma mengatakan, Nabi shallallahu 'alaihi wasallam bersabda: \"Orang yang menarik kembali pemberian, bagaikan anjing yang menyantap lagi muntahannya, yang kita tak mempunyai perumpamaan lebih buruk daripadanya",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6976,
			"arabicnumber": 6976,
			"text": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Hisyam bin Yusuf] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dari [Jabir bin Abdullah] mengatakan, 'hanyasanya Nabi shallallahu 'alaihi wasallam menetapkan syuf'ah untuk suatu yang belum dibagi, namun jika batas-batas tanah dan jalan pekarangan telah ditetapkan, tak ada syuf'ah lagi.' Sebagian orang berpendapat; 'bahwa syuf'ah bagi tetangga', kemudian dia berpegang dengan perkara yang dia perkuat, sehingga ia membatalkannya. Dan dia berkata; Jika seseorang membeli rumah dan khawatir tetangganya menguasainya dengan syuf'ah, maka dia membeli satu saham dari seratus saham yang ada, kemudian ia sendiri membeli saham sisanya, maka si tetangga hanya memperoleh syuf'ah pada satu saham yang pertama, dan tidak berhak syuf'ah pada saham rumah sisanya, dan dia boleh mensiasati hal itu",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6977,
			"arabicnumber": 6977,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Maisarah] aku mendengar [Amru bin Syarid] mengatakan, Miswar bin makhramah datang dan meletakkan tangannya di pundakku. Kemudian aku berangkat bersamanya menuju ke Sa'd. Lantas [Abu Rafi'] mengatakan kepada Miswar; 'Tidakkah engkau suruh orang ini untuk membeli rumahku yang berada di pekaranganku? ' ia berkata; 'Saya tidak menambahnya melebihi empat ratus, baik secara kontan atau kredit.' Abu rafi' mengatakan; 'Aku telah diberi lima ratus secara kontan, namun aku menolaknya, kalaulah aku tidak mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tetangga lebih berhak terhadap dinding tetangganya, \" niscaya aku tidak akan menjualnya kepadamu, -atau ia mengatakan dengan redaksi; 'niscaya tak akan memberikannya kepadamu'.- Saya berkata kepada Ma'mar; Ma'mar tidak mengatakan demikian, namun dia mengatakan kepadaku sedemikian dan mengatakan; Jika seseorang ingin menjual syuf'ah, maka ia boleh melakukan siasat sehingga membatalkan syuf'ah, dan penjual memberikan rumah kepada si pembeli, memberi batasan (waktu dan nilai) dan menyerahkannya kepada si pembeli, dan si pembeli menggantinya dengan seribu dirham, sehingga orang yang mempunyai syuf'ah tidak mempunyai syuf'ah lagi",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6978,
			"arabicnumber": 6978,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Maisarah] dari [Amru bin Syarid] dari [Abu Rafi'], bahwasanya Sa'd pernah mengajukan penawaran rumah kepadanya seharga empat ratus mitsqal. Lantas Abu rafi' menjawab; 'Kalaulah aku tidak mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tetangga lebih berhak terhadap dindingnya, \" niscaya aku tidak menjualnya kepadamu. Dan sebagian orang berpendapat; Jika seseorang membeli bagian rumah, lantas ia ingin membatalkan syuf'ah, dan ia berikan kepada anak kecilnya, maka ia tak wajib bersumpah",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6979,
			"arabicnumber": 6979,
			"text": "Telah menceritakan kepada kami [Ubaid bin Isma'il], telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [ayahnya], dari [Abu Humaid As Sa'idi] mengatakan, Rasulullah Shallallahu'alaihiwasallam pernah mempekerjakan seorang laki-laki untuk mengelola zakat bani Sulaim yang sering dipanggil dengan nama Ibnu Al Latabiyah, tatkala dia datang, dia menghitungnya dan berkata; 'Ini adalah hartamu dan ini hadiah.' Spontan Rasulullah Shallallahu'alaihiwasallam berujar: \"kenapa kamu tidak duduk-duduk saja di rumah ayahmu atau ibumu sampai hadiahmu datang kepadamu jika kamu jujur.\" Kemudian beliau berpidato di hadapan kami, memuja dan memuji Allah terus bersabda: \"Amma ba'd. Sesungguhnya saya mempekerjakan salah seorang diantara kalian untuk mengumpulkan zakat yang telah Allah kuasakan kepadaku, lantas ia datang dan mengatakan; 'ini hartamu dan ini hadiah yang diberikan kepadaku, ' kenapa dia tidak duduk-duduk saja di rumah ayahnya atau ibunya sampai hadiahnya datang kepadanya? Demi Allah, tidaklah salah seorang diantara kalian mengambil sesuatu yang bukan haknya, selain ia menjumpai Allah pada hari kiamat dengan memikul hak itu, aku tahu salah seorang diantara kalian menjumpai Allah dengan memikul unta yang mendengus, atau sapi yang melenguh, atau kambing yang mengembik.\" Kemudian beliau mengangkat tangannya hingga terlihat putih ketiaknya seraya mengatakan: \"Ya Allah, bukankah aku telah menyampaikan apa yang kulihat dengan mataku dan kudengar dengan dua telingaku?",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6980,
			"arabicnumber": 6980,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Maisarah] dari [Amru bin Syarid] dari [Abu Rafi'] mengatakan, Nabi shallallahu 'alaihi wasallam bersabda: \"tetangga lebih berhak terhadap dinding rumahnya.\" Sebagian orang berpendapat; jika seseorang membeli rumah seharga dua puluh ribu dirham, tidak mengapa baginya untuk mencari siasat dengan cara membeli rumah dengan harga dua puluh ribu dirham, dan membayarkannya sembilan ribu sembilan ratus sembilan puluh sembilan dirham, dan ia membayarnya dengan satu dinar sebagai pembayaran sisa dua puluh ribu dirham. Lantas jika ada orang yang membelinya lagi (penjual pertama), maka ia (pembeli pertama) mengharuskan pembayaran dua puluh ribu dirham penuh, jika tidak, ia tidak berhak menempati rumah tersebut. Jika rumah diminta secara paksa, maka si pembeli pertama mengembalikan uang yang pernah dibayarkan yaitu sebanyak sembilan ribu sembilan ratus sembilan puluh sembilan dirham dirham dan satu dinar",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6981,
			"arabicnumber": 6981,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan] mengatakan, Telah menceritakan kepadaku [Ibrahim bin Maisarah] dari [Amru bin Syarid], bahwasanya [Abu Rafi'] pernah mengajukan penawaran rumah keada Sa'd bin Malik seharga empat ratus mitsqal, dan ia mengatakan; 'Kalaulah aku tidak emndengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tetangga lebih berhak teradap dindingnya\" niscaya tidak aku berikan kepadamu",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 28
			}
		}
	]
}