{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7137,
			"arabicnumber": 7137,
			"text": "Telah menceritakan kepada kami [Abdan] telah mengabarkan kepada kami [Abdullah] dari [Yunus] dari [Al Karmani] telah mengabarkan kepadaku [Abu Salamah bin Abdurrahman], ia mendengar [Abu Hurairah] radliallahu 'anhu berkata, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang mentaatiku berarti ia mentaati Allah, sebaliknya barangsiapa membangkang terhadapku, ia membangkang Allah, dan barangsiapa mentaatiku amirku berarti ia mentaatiku, dan barangsiapa membangkang amirku, berarti ia membangkang terhadapku",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7138,
			"arabicnumber": 7138,
			"text": "Telah menceritakan kepada kami [Ismail] Telah menceritakan kepadaku [Malik] dari [Abdullah bin Dinar] dari [Abdullah bin Umar] radliallahu 'anhuma, Rasulullah shallallahu 'alaihi wasallam bersabda: \"ketahuilah Setiap kalian adalah pemimpin, dan setiap kalian akan dimintai pertanggungjawabannya atas yang di pimpin, penguasa yang memimpin rakyat banyak dia akan dimintai pertanggungjawaban atas yang dipimpinnya, setiap kepala keluarga adalah pemimpin anggota keluarganya dan dia dimintai pertanggungjawaban atas yang dipimpinnya, dan isteri pemimpin terhadap keluarga rumah suaminya dan juga anak-anaknya, dan dia akan dimintai pertanggungjawabannya terhadap mereka, dan budak seseorang juga pemimpin terhadap harta tuannya dan akan dimintai pertanggungjawaban terhadapnya, ketahuilah, setiap kalian adalah bertanggung jawab atas yang dipimpinnya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7139,
			"arabicnumber": 7139,
			"text": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] mengatakan, [Muhammad bin Jubair] menceritakan, [Mu'awiyah] mendapat informasi -ketika itu Jubair berada disampingnya-saat berada dalam rombongan quraisy, bahwa Abdullah bin Amru menceritakan, bahwa dirinya akan menjadi raja Qahthan. Spontan Mu'awiyah murka, ia berdiri dan memanjatkan puji-pujian kepada Allah dengan pujian semestinya, kemudian mengatakan; 'Amma ba'd. Telah sampai berita kepadaku bahwa beberapa orang diantara kalian menceritakan hadist yang tidak terdapat dalam kitabullah dan tidak pula berasal dari Rasulullah Shallallahu'alaihiwasallam, mereka itu adalah orang-orang jahil kalian, jauhilah olehmu angan-angan yang menyesatkan pemiliknya, sebab aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"'Kepemimpinan ini tetap berada di quraisy, tidaklah seseorang memusuhi mereka, selain Allah menelungkupkannya dalam neraka diatas wajahnya, selama mereka menegakkan agama.\" hadist ini dikuatkan oleh [Nu'aim] dari [Ibnul Mubarak] dari [Ma'mar] dari [Az Zuhri] dari [Muhammad Ibnu Jubair]",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7140,
			"arabicnumber": 7140,
			"text": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami ['Ashim bin Muhammad], aku mendengar [Ayahku] mengatakan; [Ibnu Umar] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Urusan kepemimpinan ini berada di quraisy, sekalipun mereka tinggal dua",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7141,
			"arabicnumber": 7141,
			"text": "Telah menceritakan kepada kami [Syihab bin Ibad] telah menceritakan kepada kami [Ibrahim bin Humaid] dari [Ismail] dari [Qais] dari [Abdullah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak diperbolehkan iri kecuali dalam dua hal, seseorang yang Allah memberinya harta, lantas ia belanjakan untuk al haq, dan seseorang yang Allah beri hikmah, kemudian ia pergunakan untuk memutuskan hukum dan ia ajarkan",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7142,
			"arabicnumber": 7142,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] dari [Abu tayyah] dari [Anas bin Malik] radliallahu 'anhu mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dengarlah dan taatilah sekalipun yang memimpin kalian adalah seorang budak habsyi, seolah-olah kepalanya gimbal",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7143,
			"arabicnumber": 7143,
			"text": "Telah menceritakan kepada kami [Sulaiman bin harb] telah menceritakan kepada kami [Hammad] dari [Al Ja'd] dari [Abu Raja'] dari [Ibnu 'Abbas] yang ia riwayatkan, mengatakan, Nabi shallallahu 'alaihi wasallam bersabda; \"Siapa yang melihat dari amirnya sesuatu yang tidak disukainya, hendaklah ia bersabar, sebab tidaklah seseorang meninggalkan jama'ah sejauh sejengkal, lantas ia meninggal dunia, melainkan ia mati jahiliyah",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7144,
			"arabicnumber": 7144,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari ['Ubaidullah] Telah menceritakan kepadaku [Nafi'] dari [Abdullah] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam bersabda: \"mendengar dan taat adalah wajib bagi setiap muslim, baik yang ia sukai maupun yang tidak ia sukai, selama ia tidak diperintahkan melakukan kemaksiatan, adapun jika ia diperintahkan melakukan maksiat, maka tidak ada hak mendengar dan menaati",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7145,
			"arabicnumber": 7145,
			"text": "Telah menceritakan kepada kami ['Umar bin hafs bin Ghiyats] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada kami [Sa'd bin Ubaidah] dari [Abu Abdurrahman] dari ['Ali] radliallahu 'anhu mengatakan, Nabi shallallahu 'alaihi wasallam mengutus sebuah ekspedisi dan mengangkat sahabat anshar sebagai pemimpin mereka, dan beliau perintahkan mereka untuk menaatinya. Selanjutnya sahabat anshar marah dan mengatakan; \"Bukankah Rasulullah Shallallahu'alaihiwasallam telah memerintahkan kaian untuk mentaatiku?\" 'Ya' Jawab mereka. Sahabat anshar meneruskan; \"Karena itu, aku ingin jika kalian mengumpulkan kayu bakar dan menyalakan api, kemudian kalian masuk kedalamnya.\" Mereka pun mengumpulkan kayu bakar dan menyalakan api. Tatkala mereka ingin memasukinya, satu sama lain saling memandang. Sebagian mengatakan; 'bukankah kita ikut Nabi shallallahu 'alaihi wasallam untuk menjauhkan diri dari api, apakah (sekarang) kita ingin memasukinya? ' Tatkala mereka dalam keadaan seperti itu, tiba-tiba api padam dan kemarahannya mereda. Maka hal ini disampaikan kepada Nabi shallallahu 'alaihi wasallam lantas Nabi mengatakan; \"Kalaulah mereka memasukinya, niscaya mereka tidak bisa keluar dari api tersebut selama-lamanya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7146,
			"arabicnumber": 7146,
			"text": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Jarir bin Hazim] dari [Al Hasan] dari [Abdurrahman bin Samurah] mengatakan, Nabi shallallahu 'alaihi wasallam berkata kepadaku: \"Wahai Abdurrahman bin Samurah, janganlah kamu meminta jabatan, sebab jika kamu diberi jabatan dengan tanpa meminta, maka kamu akan ditolong, dan jika kamu diberinya karena meminta, maka kamu akan ditelantarkan, dan jika kamu bersumpah, lantas kamu lihat ada suatu yang lebih baik, maka bayarlah kafarat sumpahmu dan lakukanlah yang lebih baik",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7147,
			"arabicnumber": 7147,
			"text": "Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami ['Abdl Warits] telah menceritakan kepada kami [Yunus] dari [Al Hasan] mengatkan telah menceritakan kepadaku [Abdurrahman bin Samurah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Wahai Abdurrahman bin Samurah, janganlah kamu meminta jabatan, sebab jika kamu diberi jabatan dengan meminta, maka kamu akan ditelantarkan, dan jika kamu diberi dengan tanpa meminta, maka kamu akan diotolong, dan jika kamu melakukan suatu sumpah, lantas kau lihat selainnya lebih baik, maka lakukanlah yang lebih baik dan bayarlah kafarat sumpahmu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7148,
			"arabicnumber": 7148,
			"text": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Sa'id Al Maqburi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"kalian akan rakus terhadap jabatan, padahal jabatan itu akan menjadi penyesalan dihari kiamat, ia adalah seenak-enak penyusuan dan segetir-getir penyapihan.\" [Muhamad bin Basyar] berkata; telah menceritakan kepada kami [Abdullah bin Humran] telah menceritakan kepada kami [Abdul Hamid bin Ja'far] dari [Sa'id Al Maqburi] dari [Umar bin Al Hakam] dari [Abu Hurairah] seperti diatas",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7149,
			"arabicnumber": 7149,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] radliallahu 'anhu mengatakan; aku menemui Nabi shallallahu 'alaihi wasallam bersama dua orang kaumku, lantas satu diantara kedua orang itu mengatakan; 'Jadikanlah kami pejabat ya Rasulullah? ' orang kedua juga mengatakan yang sama. Secara spontan Rasulullah Shallallahu'alaihiwasallam bersabda; \"Kami tidak akan memberikan jabatan ini kepada orang yang memintanya, tidak juga kepada orang yang ambisi terhadapnya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7150,
			"arabicnumber": 7150,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Abul Asyhab] dari [Al Hasan], bahwasanya Abdullah bin Ziyad mengunjungi Ma'qil bin yasar ketika sakitnya yang menjadikan kematiannya, lantas [Ma'qil] mengatakan kepadanya; 'Saya sampaikan hadist kepadamu yang aku dengar dari Rasulullah Shallallahu'alaihiwasallam, aku mendengar Nabi shallallahu 'alaihi wasallam bersabda; \"Tidaklah seorang hamba yang Allah beri amanat kepemimpinan, namun dia tidak menindaklanjutinya dengan baik, selain tak bakalan mendapat bau surga",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7151,
			"arabicnumber": 7151,
			"text": "Telah menceritakan kepada kami [Ishaq bin Manshur] Telah mengabarkan kepada kami [Husain Al Ju'fi], [Zaidah] mengatakan, bahwa ia menyebutkannya dari [Hisyam] dari [Al Hasan] mengatakan, kami mendatangi Ma'qil bin Yasar, lantas Ubaidullah menemui kami, lantas [Ma'qil] berujar kepadanya; Saya ceritakan hadist kepadamu yang aku mendengarnya dari Rasulullah Shallallahu'alaihiwasallam, beliau bersabda; \"Tidaklah seorang pemimpin memimpin masyarakat muslimin, lantas dia meninggal dalam keadaan menipu mereka, selain Allah mengharamkan surge baginya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7152,
			"arabicnumber": 7152,
			"text": "Telah menceritakan kepada kami [Ishaq Al Wasithi] telah menceritakan kepada kami [Khalid] dari [Al Jurairi] dari [Tharif Abu Tamimah] mengatakan, aku menghadiri Shafwan dan [Jundab] serta sahabat-sahabatnya ketika Jundab memberi wasiat kepada mereka, lantas mereka bertanya; 'Apakah kau mendengar sesuatu dari Rasulullah Shallallahu'alaihiwasallam? ' Ia menjawab; aku mendengar beliau bersabda: \"Barangsiapa beramal karena sum'ah (ingin didengar), maka Allah menjadikannya dikenal suka bersum'ah pada hari kiamat, dan barangsiapa menyusahkan (manusia), maka Allah juga bakalan menyusahkannya pada hari kiamat.\" mereka berkata; \"Wasiatilah kami!\" ia berkata; 'Yang pertama-tama membusuk dari tubuh manusia adalah perut, maka barangsiapa yang mampu untuk tidak menyantap selain yang baik, lakukanlah, dan barangsiapa tidak ingin dihalangi antara dirinya dan surga karena segenggam darah yang ia tumpahkan, lakukanlah.' Saya bertanya kepada Abu Abdillah; 'Siapa yang mengatakan aku mendengar Rasulullah Shallallahu'alaihiwasallam, apakah Jundab? ' ia menjawab; \"Iya, Jundab",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7153,
			"arabicnumber": 7153,
			"text": "Telah menceritakan kepada kami [Ustman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Salim bin Abul Ja'd] telah menceritakan kepada kami [Anas bin Malik] radliallahu 'anhu, ia mengatakan, ketika aku dan Nabi shallallahu 'alaihi wasallam keluar dari masjid, kami menemui seseorang di gerbang masjid dan ia bertanya; 'Ya Rasulullah, kapan hari kiamat tiba? ' Nabi shallallahu 'alaihi wasallam menjawab; \"apa yang telah kau persiapkan?\" Rupanya orang tadi berusaha menenangkan diri lantas mengatakan; 'Ya Rasulullah, saya tidak mempersiapkannya dengan banyak puasa, banyak shalat dan banyak sedekah, hanya aku cinta Allah dan rasul-NYA, ' maka Nabi bersabda; 'Engkau bersama orang yang kau cintai",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7154,
			"arabicnumber": 7154,
			"text": "Telah menceritakan kepada kami [Ishaq bin Manshur] Telah mengabarkan kepada kami [Abdushshamad] Telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Tsabit Al Bunani] mengatakan, aku mendengar [Anas bin Malik] berkata kepada seorang wanita dari keluarganya; 'Apakah kamu kenal si wanita A? ' 'Tahu' Jawabnya. Anas melanjutkan; sesungguhnya Nabi shallallahu 'alaihi wasallam pernah melewati wanita itu saat ia menangis di suatu kuburan, lantas beliau menasehatinya: 'Bertakwalah kepada Allah, dan bersabarlah! ' Si wanita itu malah menjawab; 'Sana kau menjauh, sebab kamu tidak mengalami seperti musibahku ini! ' Kata Anas, Nabi pun segera menjauh dan pergi. Lantas ada seseorang yang melewati wanita itu seraya mengatakan; 'Apa yang disabdakan Rasulullah kepadamu? ' Si wanita tadi menjawab; 'Saya tidak tahu kalau orang tadi Rasulullah.' laki-laki itu mengatakan; \"Orang tadi itu Rasulullah.!\" Anas berkata; si wanita terus datang ke pintu rumah Nabi dan ia tidak menemukan seorang penjaga pintunya, lantas mengatakan; 'Wahai Rasulullah, Demi Allah, aku mengenalmu! ' Lantas Nabi shallallahu 'alaihi wasallam bersabda; \"Kesabaran itu terlihat pada saat pertama kali benturan",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7155,
			"arabicnumber": 7155,
			"text": "Telah menceritakan kepada kami [Muhammad bin Khalid Adz Dzuhli] telah menceritakan kepada kami [Al Anshari, Muhammad bin Abdullah] mengatakan; telah menceritakan kepadaku [Ayahku] dari [Tsumamah] dari [Anas bin Malik], ia mengatakan, bahwasa Qais bin Sa'd pernah di hadapan Nabi shallallahu 'alaihi wasallam seperti halnya seorang ajudan dengan pemimpin",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7156,
			"arabicnumber": 7156,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya alias Al Qaththan] dari [Qurrah bin Khalid] telah menceritakan kepadaku [Humaid bin Hilal] dari [Abu Burdah] dari [Abu Musa], bahwasanya Nabi shallallahu 'alaihi wasallam pernah mengutusnya kemudian mengutus Mu'adz sebagai penyusulnya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7157,
			"arabicnumber": 7157,
			"text": "Telah menceritakan kepadaku [Abdullah bin Shabah] telah menceritakan kepada kami [Mahbub bin Al Hasan] telah menceritakan kepada kami [Khalid] dari [Humaid bin Hilal] dari [Abu Burdah] dari [Abu Musa], ada seorang laki-laki masuk Islam kemudian masuk agama yahudi, lantas ia mendatangi Mu'adz bin Jabal yang ketika itu ia berada di dekat Abu Musa, maka Abu Musa bertanya: 'Memangnya kenapa orang ini? ' Mu'adz bin Jabal menjawab: 'orang ini masuk Islam, namun kemudian masuk agama yahudi.\" Spontan Abu Musa mengatakan; \"saya tidak sudi duduk hingga aku membunuhnya sebagai ketetapan Allah dan rasul-Nya Shallallahu'alaihiwasallam",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7158,
			"arabicnumber": 7158,
			"text": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] Telah menceritakan kepada kami [Abdul Malik bin Umair], aku mendengar [Abdurrahman bin Abu Bakrah] mengatakan, [Abu Bakrah] menulis surat untuk anaknya yang ketika itu berada di Sijistan yang isinya; 'Jangan engkau mengadili diantara dua orang ketika engkau marah, sebab aku mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Seorang hakim dilarang memutuskan antara dua orang ketika marah",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7159,
			"arabicnumber": 7159,
			"text": "Telah menceritakan kepada kami [Muhammad bin Muqatil] Telah mengabarkan kepada kami [Abdullah] Telah mengabarkan kepada kami [Ismail bin Abu Khalid] dari [Qais bin Abu hazim] dari [Abu Mas'ud Al Anshari] mengatakan, seorang laki-laki menemui Rasulullah Shallallahu'alaihiwasallam dan berujar; \"Hai Rasulullah, Demi Allah, sungguh saya memperlambat-lambatkan diri dari shalat subuh karena si fulan yang menjadi imam, ia selalu memanjangkan bacaan shalatnya jika shalat bersama kami.\" Abu mas'ud Kata; belum pernah kulihat Nabi shallallahu 'alaihi wasallam sedemikian marahnya seperti ketika beliau menasehatinya. Lantas Nabi menegur; \"Hai manusia, diantara kalian ada yang menjadikan orang lain menjauhkan diri dari (masjid dan ibadah), siapa diantara kalian mengimami orang-orang, lakukanlah secara ringkas (sederhana), sebab disana ada orang-orang tua, orang lemah dan orang yang mempunyai keperluan",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7160,
			"arabicnumber": 7160,
			"text": "Telah menceritakan kepada kami [Muhammad bin Abu Ya'qub Al Karmani] telah menceritakan kepada kami [Hassan bin Ibrahim] telah menceritakan kepada kami [Yunus] mengatakan, telah menceritakan kepada kami [Muhammad yaitu Az Zuhri] telah mengabarkan kepadaku [Salim], bahwasanya [Abdullah bin Umar] mengabarkan kepadanya, ia pernah menceraikan isterinya ketika haidh, lantas Umar melaporkan kasusnya kepada Nabi shallallahu 'alaihi wasallam, Rasulullah Shallallahu'alaihiwasallam pun sedemikian marah karenanya kemudian bersabda: \"Suruhlah dia merujuknya, kemudian mempertahankannya hingga suci, kemudian haidh lagi, kemudian suci, lantas jika ia berkehendak menceriakannya, ceraikanlah",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7161,
			"arabicnumber": 7161,
			"text": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepada kami ['Urwah] bahwasanya [Aisyah] radliallahu 'anha mengatakan, Hindun binti Utbah bin Rabi'ah datang dan berujar; 'Wahai Rasulullah, dahulu tidak ada penghuni rumah diatas bumi yang lebih saya sukai untuk dihinakan selain penghuni rumahmu, kebalikannya sekarang, tidak ada penghuni rumah diatas bumi yang lebih saya sukai untuk dimuliakan selain penghuni rumahmu, ' kemudian Hindun binti Utbah mengatakan; 'Sesungguhnya abu Sufyan orangnya sangat pelit, apakah saya berdosa jika memberi makan orang-orang yang menjadi tanggungan kami (dengan mengambil hartanya tanpa sepengetahuannya?) ' Nabi menjawab: \"tidak masalah kau memberi makanan untuk mereka, asalkan dengan ma'ruf (cara wajar)",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7162,
			"arabicnumber": 7162,
			"text": "Telah menceritakan kepadaku [Muhammad bin Basyar] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] mengatakan, aku mendengar [Qatadah] dari [Anas bin Malik] mengatakan, Dikala Nabi shallallahu 'alaihi wasallam ingin berkirim surat kepada Romawi, mereka ternyata manusia yang tak mau membaca surat selain harus berstempel, maka Nabi shallallahu 'alaihi wasallam membuat stempel dari perak, seolah-olah aku melihat kilauannya dan ukirannya bertuliskan MUHAMMAD RASULULLAH",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7163,
			"arabicnumber": 7163,
			"text": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [As Sa'ib bin Yazid bin Ukhti Namir], bahwa [Khuwaitib bin Abdul 'uzza] mengabarkan kepadanya, bahwa [Abdullah bin As Sa'di] mengabarkan kepadanya, ia pernah mendatangi Umar dimasa-masa pemerintahannya. [Umar] lantas berujar; \"Benarkan berita yang sampai kepadaku bahwa engkau mengurus urusan-urusan sosial, namun jika engkau diberi pesangon (uang lelah) engkau tidak menyukainya?\" Saya jawab \"Iya\". Umar lantas mengatakan; \"lalu maumu apa?\" Saya menjawab; \"Saya sudah punya kuda sekian banyak, demikian pula budak ada beberapa, dan aku dalam keadaan baik (mapan secara ekonomi), maka aku niati kerjaku ini sebagai sedekah (amal cuma-cuma) untuk kaum muslimin.\" Umar spontan mengatakan: 'jangan kau lakukan, saya sebenarnya juga ingin seperti kehendakmu, namun Rasulullah Shallallahu'alaihiwasallam juga memberiku pemberian, tetapi saya katakan; 'Coba berikan saja pemberian itu kepada orang yang lebih membutuhkan daripada aku! ' Kemudian hari, Nabi juga memberi pemberian yang sama kemudian aku katakan; 'Tolong berikan kepada orang yang lebih membutuhkan daripada aku! ' Lantas Nabi shallallahu 'alaihi wasallam bersabda; \"Ambil saja, kembangkan harta ini, dan jadikanlah untuk bersedekah, harta ini yang datang kepadamu dengan cara yang tidak berlebihan dan engkau sendiri tidak meminta, maka ambil saja, dan terhadap harta, janganlah nafsumu kau perturutkan terhadapnya!\" Dan dari [Az Zuhri] berkata; telah menceritakan kepadaku [Salim bin Abdullah] bahwa [Abdullah bin Umar] berkata; saya telah mendengar [Umar bin Khattab] berkata; Nabi shallallahu 'alaihi wasallam memberikan suatu pemberian kepadaku, lalu saya berkata; Berikan kepada orang yang lebih fakir daripadaku, sehingga pada suatu saat beliau memberi lagi dan saya jawab sebagaimana sebelumnya. Lantas Nabi shallallahu 'alaihi wasallam bersabda: \"Ambillah! kembangkan harta ini, dan jadikanlah untuk bersedekah, harta ini yang datang kepadamu dengan cara yang tidak berlebihan dan engkau sendiri tidak meminta, maka ambil saja, dan terhadap harta, janganlah nafsumu kau perturutkan terhadapnya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7164,
			"arabicnumber": 7164,
			"text": "",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7165,
			"arabicnumber": 7165,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan], [Az Zuhri] mengatakan dari [Sahal bin Sa'd], ia mengatakan; aku pernah menyaksikan dua orang yang melakukan li'an ketika umurku masih lima belas tahun, maka kedua orang itu diceraikan",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7166,
			"arabicnumber": 7166,
			"text": "Telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Abdurrazaq] Telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibnu Syihab] dari [Sahal saudara Bani Sa'idah], seorang laki-laki anshar menemui Nabi shallallahu 'alaihi wasallam dan berujar; \"bagaimana pendapat anda sekiranya seseorang menemukan laki-laki lain bersama isterinya? Bolehkah ia membunuhnya?\" Suami-isteri itu kemudian sama-sama meli'an dan aku menyaksikan",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7167,
			"arabicnumber": 7167,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepadaku [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari [Abu Salamah] dan [Sa'id bin Musayyab] dari [Abu Hurairah] mengatakan; Seorang laki-laki menemui Rasulullah Shallallahu'alaihiwasallam ketika beliau di masjid. Orang itu memanggil beliau seraya mengatakan; 'Hai Rasulullah, saya telah berzina! ' tetapi Rasulullah berpaling darinya. Tatkala kesaksiannya sampai empat kali, Nabi bertanya: \"Mungkin engkau gila?\" \"TIDAK\" Jawabnya. Lantas Nabi bersabda: \"Bawalah orang ini, dan rajamlah!\" [Ibnu Syihab] mengatakan, dan telah menceritakan kepadaku [orang yang] mendengar [Jabir bin Abdullah] mengatakan; 'Aku termasuk diantara yang merajamnya di tanah lapang.' [Yunus], [Ma'mar] dan [Ibnu Juraij] meriwayatkannya dari [Az Zuhri] dari [Abu Salamah] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7168,
			"arabicnumber": 7168,
			"text": "",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7169,
			"arabicnumber": 7169,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Hisyam] dari [ayahnya] dari [Zainab binti Abu Salamah] dari [Ummu Salamah] radliallahu 'anha, Rasulullah Shallallahu'alaihiwasallam bersabda; \"Saya hanyalah manusia biasa, dan kalian seringkali mengadukan sengketa kepadaku, bisa jadi sebagian diantara kalian lebih pandai bersilat lidah daripada lainnya sehingga aku putuskan seperti yang kudengar, maka barangsiapa yang kuputuskan menang dengan menganiaya hak saudaranya, janganlah ia mengambilnya, sebab sama artinya aku ambilkan sundutan api baginya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7170,
			"arabicnumber": 7170,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits bin Sa'd] dari [Yahya] dari ['Umar bin katsir] dari [Abu Muhammad, maula Abu Qatadah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda pada perang Hunain: \"Barangsiapa mempunyai bukti atas korban yang dibunuh dalam perang, maka ia mendapat harta rampasan yang dibawanya.\" maka aku (Abu Qatadah) langsung berdiri untuk mencari bukti-bukti atas musuh yang telah kubunuh, ternyata tidak aku temukan seorang pun yang menyaksikan pembunuhanku. Maka aku duduk, dan aku punya inisiatif untuk mengadukan persoalanku kepada Rasulullah Shallallahu'alaihi wa sallam. Lantas seorang teman duduknya mengatakan: 'Senjata orang yang dibunuh yang selalu disebut-sebut oleh [Abu Qatadah] itu ada padaku? ' Orang tadi meneruskan; 'Tolong suruhlah Abu Qatadah merelakannya untukku! ' Maka Abu Bakar menyela; 'Sekali-kali tidak, tidak mungkin Rasulullah Shallallahu'alaihi wa sallam memberikan rampasan itu untuk kamu si burung pipit, dan ia tinggalkan salah satu singa Allah (maksudnya Abu Qatadah) yang ia berperang untuk Allah dan rasul-Nya.' Lantas Rasulullah Shallallahu'alaihiwasallam memberikan rampasan itu untukku, dan selanjutnya kubelikan seekor gibas. Dan itulah harta pertama-tama yang kukembangkan. [Abdullah] mengatakan kepadaku, dari [Al Laits], lantas Nabi shallallahu 'alaihi wasallam berdiri dan memberikannya untukku. Ulama Hejaz berpendapat; Seorang hakim tak berhak memutuskan keputusan hanya dengan sepengetahuannya yang ia persaksikan ketika melakukan sidang atau sebelumnya, sekalipun yang digugat mengakui bahwa hak memang milik lawan sengketanya di majlis sidang. Sebagian mereka berkomentar bahwa ia tak berhak memutuskannya hingga memanggil dua orang saksi yang kemudian si hakim mengungkapkan keputusannya. Sedang ulama Irak berpendapat, apa yang ia dengar atau yang ia lihat di majlis sidang, hakim memutuskan dengannya, adapun jika di luar majlis sidang, ia tidak boleh memutuskan selain dengan memanggil dua orang saksi. Sedang kelompok lain dari mereka berpendapat 'Sekalipun diluar sidang, tetap ia putuskan (dengan tanpa memanggil dua orang saksi), sebab hakim adalah orang yang terpercaya, dan maksud persaksian adalah sekedar untuk mengetahui kebenaran, padahal ilmu sang hakim jauh lebih banyak daripada persaksian lainnya, namun yang demikian membuka dirinya menjadi sasaran tuduhan di kalangan muslimin dan menjerumuskan mereka dalam prasangka, (padahal Nabi Shallallahu 'alaihi sangat tidak menyukai prasangka, sebagaimana prasangka buruk kedua sahabatnya ketika nabi shallallahu 'alaihi wasallam berjalan dengan seorang perempuan, lantas nabi langsung memangkas prasangka keduanya dengan mengatakan: \"ketahuilah, wanita itu Shafiyyah, (isteriku)",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7171,
			"arabicnumber": 7171,
			"text": "Telah menceritakan kepada kami [Abdul 'Aziz bin Abdullah Al Uwaisi] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ibnu Syihab] dari ['Ali bin Husain], Nabi shallallahu 'alaihi wasallam kedatangan Shafiyyah bin Huyyai, tatkala Shafiyyah pulang, Beliau pulang bersamanya, lantas ada dua laki-laki Anshar melewati beliau, maka beliau panggil dua laki-laki itu dan mengatakan: \"Hanyasanya ia Shafiyyah binti Huyyai.\" Maka kedua laki-laki tadi mengucapkan \"SUBHANAALLAH\". Nabi mengatakan 'sesungguhnya setan mengalir dalam anak adam dalam aliran darahnya. hadist ini diriwayatkan oleh [Syu'aib], [Ibnu Musafir], [Ibnu 'Atiq], dan [Ishaq bin Yahya] dari [Az Zuhri] dari [Ali maksudnya Ali bin Husain] dari [Shafiyyah] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7172,
			"arabicnumber": 7172,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Al 'Aqdi] telah menceritakan kepada kami [Syu'bah] dari [Sa'id bin Abu Burdah] mengatakan, aku mendengar [Ayahku] mengatakan; Nabi shallallahu 'alaihi wasallam mengutus ayahku dan Mu'adz bin Jabal ke Yaman, Nabi berpesan: \"Hendaknya kalian berdua mempermudah, jangan mempersulit, memberi kabar gembira, tidak menjadikan orang menjauh, dan bersatu padulah!\" Lantas Abu Musa mengatakan kepadanya; \"Di daerah kami sering dibuat fermentasi kurma (Albit'u).\" Mu'adz menjawab; \"setiap yang memabukkan adalah haram.\" Sedang [Abu Nadhr], [Abu Daud], [Yazid bin harun] dan [Waki'] mengatakan dari [Syu'bah] dari [Sa'id bin Abu Burdah] dari [ayahnya] dari [kakeknya], dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7173,
			"arabicnumber": 7173,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] telah menceritakan kepadaku [Manshur] dari [Abu Wa`il] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Bebaskanlah para tawanan, dan penuhilah orang yang mengundang",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7174,
			"arabicnumber": 7174,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri], ia mendengar ['Urwah] telah mengabarkan kepada kami, [Abu Humaid assa'idi] mengtakan, Pernah Nabi shallallahu 'alaihi wasallam mempekerjakan seseorang dari bani Asad yang namanya Ibnul Utbiyah untuk menggalang dana sedekah. Orang itu datang sambil mengatakan; \"Ini bagimu, dan ini hadiah bagiku.\" Secara spontan Nabi shallallahu 'alaihi wasallam berdiri diatas minbar -sedang Sufyan mengatakan dengan redaksi; 'naik minbar-, beliau memuja dan memuji Allah kemudian bersabda; \"ada apa dengan seorang amil zakat yang kami utus, lalu ia datang dengan mengatakan; ini untukmu dan ini hadiah untukku! Cabalah ia duduk saja di rumah ayahnya atau rumah ibunya, dan cermatilah, apakah ia menerima hadiah ataukah tidak? Demi Dzat yang jiwaku berada di tangan-NYA, tidaklah seorang amil zakat membawa sesuatu dari harta zakat, selain ia memikulnya pada hari kiamat diatas tengkuknya, jikalau unta, maka unta itu mendengus, dan jika sapi, ia melenguh, dan jika kambing, ia mengembik, \" kemudian beliau mengangkat kedua tangannya sehingga kami melihat putih kedua ketiaknya seraya mengatakan: \" ketahuilah, bukankah telah kusampaikan?\" (beliau mengulang-ulanginya tiga kali). Sedang [Sufyan] mengatakan; [Az Zuhri] telah mengisahkannya kepada kami, dan [Hisyam] menambahkan dari [ayahnya] dari [Abu Humaid] mengatakan; 'kedua telingaku mendengar dan mataku melihatnya, ' dan mereka menanyakan kepada Zaid bin Tsabit bahwasanya ia mendengarnya bersamaku, sedang Az Zuhri tidak mengatakan; 'telingaku mendengar lenguh",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7175,
			"arabicnumber": 7175,
			"text": "Telah menceritakan kepada kami [Ustman bin Shalih] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Ibnu Juraij], bahwasanya [Nafi'] mengabarinya, bahwa [Ibnu Umar] radliallahu 'anhuma mengabarinya, Salim maula Abu hudzaifah pernah mengimami orang-orang muhajirin kalangan pertama dan sahabat Nabi shallallahu 'alaihi wasallam di masjid, padahal ditengah-tengah mereka ada Abu bakar, Umar, Abu Salamah, Zaid, dan Amir bin Rabi'ah",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7177,
			"arabicnumber": 7177,
			"text": "",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7178,
			"arabicnumber": 7178,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami ['Ashim bin Muhammad bin Zaid bin Abdullah bin Umar] dari [ayahnya], Beberapa orang berkata kepada Ibnu Umar; 'dahulu jika kami menemui penguasa kami, kami mengatakan sesuatu yang menyelisihi pembicaraan kami ketika kami telah meninggalkannya.' Maka [Ibnu Umar] berkata; \"yang demikian kami anggap suatu kemunafikan",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7179,
			"arabicnumber": 7179,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Hubaib] dari [Irak] dari [Abu Hurairah], ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Manusia yang paling buruk adalah yang bermuka dua (OPORTUNIS), yang mendatangi kaum dengan muka tertentu dan mendatangi lainnya dengan muka yang lain",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7180,
			"arabicnumber": 7180,
			"text": "Telah menceritakan kepada kami [Muhammad bin Katsir] Telah mengabarkan kepada kami [Sufyan] dari [Hisyam] dari [ayahnya] dari [Aisyah] radliallahu 'anha, Hindun binti Utbah berkata kepada Nabi shallallahu 'alaihi wasallam; \"Abu Sufyan itu orangnya sangat pelit, maka aku perlu mengambil hartanya (tanpa sepengetahuannya)!\" Nabi menjawab: \"ambillah yang mencukupimu dan anak-anakmu dengan cara yang ma'ruf (wajar)",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7181,
			"arabicnumber": 7181,
			"text": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Salih] dari [Ibnu Syihab] mengatakan, [Urwah bin Zubair] mengabarkan kepadaku, bahwasanya [Zainab binti Abu Salamah] mengabarkan kepadanya, bahwa [Ummu Salamah isteri Nabi shallallahu 'alaihi wasallam] mengabarinya dari Rasulullah shallallahu 'alaihi wasallam; Beliau mendengar pertengkaran di pintu kamarnya, spontan beliau keluar menemui mereka dan mengatakan; \"Saya hanyalah manusia biasa seperti kalian, dan aku mendapatkan pengaduan, siapa tahu diantara kalian lebih pandai bersilat lidah daripada yang lain, sehingga aku menyangka dirinya benar (padahal tidak), lalu aku putuskan untuknya, maka barangsiapa kuputuskan menang dengan melanggar hak saudaranya semuslim, sama artinya aku mengambilkan suluh api baginya, maka silahkan ia ambil atau ia tinggalkan",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7182,
			"arabicnumber": 7182,
			"text": "Telah menceritakan kepada kami [Ismail] mengatakan, telah menceritakan kepadaku [Malik] dari [Ibnu Syihab] dari ['Urwah bin Zubair] dari [Aisyah, isteri Nabi shallallahu 'alaihi wasallam] mengatakan, Utbah bin Abu Waqqash melimpahkan kuasa kepada saudaranya, Sa'd bin Abu waqqash yang isinya; 'anak laki-laki dari budak perempuan Zam'ah adalah bagian dariku (anakku), maka tolong ambillah.' Tatkala penaklukan Mekah, maka Sa'd mengambilnya dengan mengatakan; 'Ini adalah anak laki-laki saudaraku, ia telah melimpahkan urusan tentangnya kepadaku.' Spontan Abd bin Zam'ah berdiri menghadapinya seraya berujar; 'Bahkan ia adalah saudaraku dan anak laki-laki dari hamba sahaya ayahku, ia dilahirkan di kasurnya, ' keduanya lantas melaporkan kasusnya kepada Rasulullah Shallallahu'alaihiwasallam. Sa'd bin Abu Waqqash kemudian mengatakan; 'Hai Rasulullah, ia adalah anak laki-laki saudaraku yang telah ia limpahkan wewenangnya kepadaku.' Abd bin Zam'ah tak mau kalah seraya mengatakan; 'Bahkan ia adalah saudaraku, dan anak laki-laki dari hamba sahaya ayahku, ia dilahirkan di kasurnya.' Lantas Rasulullah Shallallahu'alaihiwasallam bersabda; \"dia milkmu wahai Abd bin Zam'ah, \" kemudian Rasulullah Shallallahu'alaihiwasallam bersabda: \"Anak adalah pemilik ranjang, dan pezina harus dihukum dengan batu (rajam), \" kemudian beliau bersabda kepada Saudah binti Zam'ah: \"Berhijablah engkau daripadanya!\" karena ada kemiripannya dengan Utbah, sehingga anak laki-laki dari hamba sahaya Zam'ah itu tidak melihat Saudah selama-lamanya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7184,
			"arabicnumber": 7184,
			"text": "",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7185,
			"arabicnumber": 7185,
			"text": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [Urwah bin Zubair] bahwasanya [Zainab binti Abu Salamah] mengabarkannya dari ibunya, [Ummu Salamah] mengatakan; Pernah Nabi shallallahu 'alaihi wasallam mendengar gaduh percekcokan di pintunya, lantas beliau menemui mereka dengan mengatakan; \"Saya hanyalah manusia biasa seperti kalian, dan sengketa diadukan kepadaku, dan bisa jadi diantara kalian ada yang lebih pandai bersilat lidah daripada yang lain sehingga aku memenangkannya dan aku mengira dirinya yang benar, maka siapa yang kumenangkan dengan melanggar hak muslim lainnya, itu adalah sundutan api, silahkan ia mengambil atau tinggalkan",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7186,
			"arabicnumber": 7186,
			"text": "Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Muhammad bin Bisyr] telah menceritakan kepada kami [Ismail] telah menceritakan kepada kami [Salamah bin Kuhail] dari ['Atho`] dari [Jabir bin Abdullah] mengatakan, Nabi Shallallahu'alaihiwasallam mendengar informasi ada seorang sahabat membebaskan budaknya dengan cara mudabbar, padahal ia tidak punya harta selainnya, lantas Nabi membelinya seharga delapan ratus dirham, kemudian beliau kirimkan hasilnya kepadanya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7187,
			"arabicnumber": 7187,
			"text": "Telah menceritakan kepada kami [Musa bin ismail] telah menceritakan kepada kami [Abdul Aziz bin Muslim] telah menceritakan kepada kami [Abdullah bin dinar] mengatakan, aku mendengar [Ibnu Umar] radliallahu 'anhuma mengatakan; Rasulullah Shallallahu'alaihiwasallam mengutus sebuah ekspedisi dan mengangkat Usamah bin Zaid sebagai panglimanya, kemudian kepemimpinannya dicela habis-habisan oleh para sahabat ketika itu, maka Nabi langsung menegur; \"Jikalau kalian mencela kepemimpinanya, dahulu kalian juga mencela kepemimpinan bapaknya, demi Allah, dia sangat ideal memegang kepemimpinan, dan sungguh ayahnya (Zaid bin haritsah) termasuk manusia yang paling kucintai, dan dia (Usamah bin Zaid) termasuk manusia yang paling kucintai sepeninggalnya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7188,
			"arabicnumber": 7188,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij], aku mendengar [Ibnu Abu Mulaikah] menceritakan dari [Aisyah] radliallahu 'anha, ia mengatakan; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Manusia yang paling dibenci Allah adalah yang keras kepala dan suka membantah",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7189,
			"arabicnumber": 7189,
			"text": "Telah menceritakan kepada kami [Mahmud] telah menceritakan kepada kami [Abdurrazaq] Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar], Nabi shallallahu 'alaihi wasallam mengutus Khalid -lewat jalur periwayatan lain-Dan telah menceritakan kepadaku [Abu Abdullah Nu'aim bin Hammad] telah menceritakan kepada kami [Abdullah] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ayahnya], mengatakan, Nabi shallallahu 'alaihi wasallam mengutus Khalid bin Al Walid ke Bani Judzaimah yang lidah mereka belum fasih mengucapkan ASLAMNAA (kami masuk Islam), sehingga mereka ucapkan; 'ASHBA'NA' (yang arti secara harfiah kami menganut agama shabiiyah, padahal maksud mereka ASLAMNA), sehingga Khalid terus membunuh dan menawan dan menyerahkan tawanannya kepada masing-maing kami, dan menyuruh masing-masing kami untuk membunuhnya, maka kukatakan; 'demi Allah, saya tak akan membunuh tawananku, ' dan tak seorang pun sahabatku membunuh tawanannya. Maka kasus ini kulaporkan kepada Nabi shallallahu 'alaihi wasallam dan beliau berujar; \"ya Allah, sesungguhnya aku berlepas diri kepadamu dari apa yang dilakukan Khalid bin Walid\" (beliau ulangi ucapannya dua kali)",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7190,
			"arabicnumber": 7190,
			"text": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Abu Hazim Al Madani] dari [Sahal bin Sa'd As Sa'idi] mengatakan; ketika terjadi peperangan antara bani 'Amru, berita ini sampai kepada Nabi Shallallahu'alaihiwasallam, maka beliau shalat zhuhur kemudian mendatangi mereka untuk mendamaikan sesama mereka. Tatkala tiba shalat ashar, Bilal mengumandangkan adzan dan iqamat. Lantas beliau perintahkan Abu bakar untuk mengimami orang-orang. Ia pun maju mengimami. Selanjutnya Nabi shallallahu 'alaihi wasallam datang sedang Abu Bakar tengah mengimami. Nabi menerobos barisan hingga berdiri di belakang Abu Bakar, dan terus melaju hingga tepat di shaff (barisan) setelah Abu Bakar. Kata Sahal, saat itulah para sahabat menepukkan tangan kanannya diatas punggung lengan kiri (tashfiih) sebagai pertanda Rasul di belakangnya. Adalah kebiasaan Abu bakar jika telah menunaikan shalat, ia tidak menolah-noleh hingga selesai, maka tatkala beliau melihat tashfih terus dilakukan tanpa henti, dia menoleh dan melihat Nabi shallallahu 'alaihi wasallam berada di belakangnya. Nabi shallallahu 'alaihi wasallam memberi isyarat kepadanya agar meneruskan shalatnya dengan tangannya dan mengisyaratkan dengan tangannya sedemikian. Abu Bakar meneruskan shalat beberapa saat, memuji Allah atas ucapan Nabi shallallahu 'alaihi wasallam, kemudian dia berjalan mundur, dikala Nabi shallallahu 'alaihi wasallam melihat yang demikian, Nabi maju dan mengimami orang-orang. Selesai beliau menunaikan shalatnya, beliau mengatakan: \"Hai Abu bakar, apa yang menghalangimu ketika aku memberi isyarat kepadamu, namun engkau malah tidak melanjutkannya?\" Abu bakar menjawab; \"Tidak pantas bagi Ibnu Abu Quhafah mengimami Nabi shallallahu 'alaihi wasallam.\" Kemudian Nabi bersabda kepada para sahabat: \"Jika kalian ragu ketika shalat, hendaklah yang laki-laki mengucapkan tasbih, sedang jika perempuan menepukkan tangan (tashfiih)",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7191,
			"arabicnumber": 7191,
			"text": "Telah menceritakan kepada kami [Muhammad bin Ubaidullah] Abu Tsabit, telah menceritakan kepada kami [Ibrahim bin sa'd] dari [Ibnu Syihab] dari [Ubaid bin Sibaq] dari [Zaid bin tsabit] mengatakan, Abu bakar mengutus seseorang menemuiku karena banyaknya korban yang gugur pada perang Yamamah, ketika itu Abu bakar bersama Umar. Abu Bakar berkata; 'Umar mendatangiku dan mengatakan; 'Korban perang telah meluas pada perang yamamah hingga merenggut qurra` (penghafal) alquran, dan saya khawatir jangan-jangan dengan meninggalnya qurra` alquran di banyak tempat, mengakibatkan sekian banyak ayat quran akan menghilang, dan saya berpendapat jika engkau perintahkan untuk mengumpulkan alquran.' Maka Saya menjawab; 'bagaimana aku lakukan sesuatu yang belum pernah Rasulullah lakukan? ' Umar kontan mengemukakan pendapatnya; 'Demi Allah, ini adalah suatu kebaikan, ' Umar tiada henti-hentinya mendorongku untuk melakukan pekerjaan ini, hingga Allah melapangkan dadaku untuk melakukan pekerjaan yang dada Umar telah lebih dahulu dilapangkan terhadapnya, dan aku sependapat dengan pendapat Umar.' Zaid mengatakan, Abu Bakar berkata; 'Sungguh engkau adalah laki-laki yang masih muda, cerdas, dan kami sama sekali tidak menyangsikan kemampuanmu, sebab engkau sudah terbiasa menulis wahyu untuk Rasulullah. Maka susurilah alquran (yang masih terpencar-pencar) dan kumpulkanlah.' Maka Zaid menjawab; \"Demi Allah, sekiranya Abu bakar menugasiku untuk memindahkan sebuah gunung, itu tidak lebih berat bagiku daripada menugasiku untuk menghimpun alquran. Maka aku berkata; 'Bagaimana mungkin anda berdua melakukan sesuatu yang tidak pernah di lakukan Rasulullah Shallallahu'alaihiwasallam? ' Abu Bakar menjawab; 'demi Alllah, pekerjaan ini adalah kebaikan.' Tiada henti-hentinya Abu Bakar memotivasi pertimbanganku hingga Allah melapangkan dadaku untuk melakukan suatu hal yang Allah telah melapangkan dada Abu Bakar dan Umar untuk melakukannya. Dan aku sependapat dengan keduanya, maka kutelusuri alquran yang terpencar-pencar dan kuhimpun dari pelepah, kulit, tembikar, tulang dan dada para penghapal, dan kutemukan di akhir surat at taubah ayat yang berbunyi; 'Telah datang kepada kalian seorang rasul dari jenis kamu sendiri,,,, hingga akhir ayat (QS. Attaubah 128) bersama Khuzaimah atau Abu Khuzaemah, sehingga aku masukkan dalam suratnya. Kemudian shuhuf (manuskrip pencatatan asli alquran) ini berada di Abu Bakar ketika hidupnya sampai Allah mewafatkannya, kemudian keberadaan shuhuf ini pada Umar 'azza wajalla semasa hidupnya sampai Allah mewafatkannya, kemudian pada Hafshah binti Umar.' Muhammad bin Ubaidullah mengatakan; maksud al likhaf ialah tembikar (tanah liat yang dibakar)",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7192,
			"arabicnumber": 7192,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] Telah mengabarkan kepada kami [Malik] dari [Abu Laila] -lewat jalur periwayatan lain-Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari [Abu Laila bin Abdullah bin Abduurrahman bin Sahal bin Abu Khatsmah], ia dan beberapa pemuka kaumnya mengabarinya, bahwa Abdullah bin Sahal dan Muhayshah berangkat ke Khaibar karena musim paceklik yang menimpa mereka, lantas Muhayshah diberi kabar bahwa Abdullah terbunuh dan di hempaskan begitu saja di sebuah mata air. Maka ia datangi kaum yahudi dan mengatakan; 'Hei, kalianlah -demi Allah- yang telah membunuhnya! ' Mereka menjawab; 'Kami tidak membunuhnya, demi Allah.' Kemudian Muhayshah pulang hingga ia temui kaumnya dan ia ceritakan kasusnya kepada mereka. Ia temui kaumnya bersama saudaranya, Huwaysah yang usianya lebih tua daripadanya, dan Abdurrahman bin Sahal. Muhayshah kontan ingin bicara -karena dialah yang pergi ke Khaibar--, namun Nabi shallallahu 'alaihi wasallam menegur Muhayshah; \"hendaklah yang lebih tua, hendaklah yang lebih tua\" yang beliau maksudkan adalah umurnya. Maka Huwayshah -kakak Muhaysah-berbicara, kemudian baru diteruskan oleh Muhayshah. Lantas Rasulullah shallallahu 'alaihi wasallam bersabda: \"Adakah mereka ingin membayar diyat sahabat kalian ataukah mereka ingin mengumumkan perang?\" lantas Rasulullah Shallallahu'alaihiwasallam berkirim surat kepada mereka, dan mereka pun memberi balasan bahwa; 'kami tidak membunuhnya.' Lantas Rasulullah Shallallahu'alaihiwasallam berkata kepada Muhayshah, Huwayshah, dan Abdurrahman bin Sahal; \"Bagaimana kalau kalian bersumpah dan berhak menuntut darah kawan kalian?\" mereka menjawab; 'tidak'. Nabi lantas mengatakan; \"bagaimana kalau kaum yahudi itu yang bersumpah untuk kalian?\" Mereka menjawab; \"mereka bukan muslimin.\" Selanjutnya malahan Rasulullah Shallallahu'alaihiwasallam yang membayar diyatnya dari miliknya sendiri sebanyak seratus ekor unta hingga dimasukkan kekandang. [Sahal] berkata; 'seekor diantaranya ada yang menyepakku",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7194,
			"arabicnumber": 7194,
			"text": "",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7195,
			"arabicnumber": 7195,
			"text": "",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7196,
			"arabicnumber": 7196,
			"text": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [Ubaidullah bin Abdullah], bahwasanya [Abdullah bin Abbas] mengabarkannya, [Abu Sufyan bin Harb] mengabarkannya, bahwa Heraqlius mengutus seorang utusan kepadanya ketika ia bersama rombongan Quraisy, kemudian mengatakan kepada juru terjemahnya; 'Katakan kepada mereka bahwa aku akan bertanya kepada orang ini (Abu Sufyan), jika dia mendustaiku maka dustakanlah dia, ' lalu Abu Sufyan mengemukakan pembicaraannya,, kemudian Heraklius berkata kepada juru bicaranya; 'katakan kepadanya (Abu Sufyan), sekiranya apa yang kamu katakan benar, niscaya dia (Muhammad) akan menguasai hingga kedua telapak kakiku ini",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7197,
			"arabicnumber": 7197,
			"text": "Telah menceritakan kepada kami [Muhammad] Telah mengabarkan kepada kami ['Abdah] telah menceritakan kepada kami [Hisyam bin Urwah] dari [ayahnya] dari [Abu humaid as Sa'idi], bahwa Nabi shallallahu 'alaihi wasallam pernah mempekerjakan Ibnul Atabiyah untuk menghimpun sedekah bani Sulaim. Tatkala ia mendatangi Rasulullah shallallahu 'alaihi wasallam dan Rasulullah mengevaluasinya, ia mengatakan; 'Ini bagian untukmu dan ini hadiah untukku.' Spontan Rasulullah Shallallahu'alaihiwasallam bersabda: \"tidakkah jika engkau duduk saja di rumah ayahmu dan rumah ibumu, maka apakah akan datang hadiahmu kepadamu jika memang engkau jujur.\" kemudian Rasulullah Shallallahu'alaihiwasallam berdiri dan berpidato kepada manusia, beliau memuja dan memuji Allah, kemudian mengatakan: 'Amma ba'du. Sesungguhnya saya mempekerjakan beberapa orang diantara kalian untuk urusan yang Allah menguasakannya kepada saya, lantas salah seorang diantara kalian mengatakan ini bagian untukmu dan ini hadiah untukku. tidakkah jika dia duduk saja di rumah ayahnya dan rumah ibunya, maka apakah akan datang hadiahnya kepadanya jika memang dia juju Demi Allah, tidaklah salah seorang diantara kalian mengambil sesuatu yang bukan haknya, melainkan ia menghadap Allah dengan memikul barang yang diambilnya, ketahuilah, aku tahu ada seseorang yang menghadap Allah dengan memikul untanya yang mendengus, ada yang memikul sapinya yang melenguh, ada yang memikul kambingnya yang mengembik.\" kemudian beliau mengangkat kedua tangannya sehingga terlihat putih kedua ketiaknya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7198,
			"arabicnumber": 7198,
			"text": "Telah menceritakan kepada kami [Ashbagh] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Abu Salamah] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam bersabda; \"Tidaklah Allah mengutus seorang Nabi atau mengangkat seorang khalifah selain ia mempunyai dua kubu, kubu yang memerintahkannya kebaikan dan memotivasinya, dan kubu yang menyuruhnya berbuat keburukan dan mendorongnya, maka orang yang terjaga adalah yang dijaga Allah ta'ala.\" [Sulaiman] mengatakan dari [Yahya] telah mengabarkan kepadaku [Ibnu Syihab] dengan hadist ini, dan dari [Ibnu Abu 'Atiq] dan [Musa] dari [Ibnu Syihab] hadits yang sama, sedang [Syu'aib] mengatakan dari [Az Zuhri] telah menceritakan kepadaku [Abu Salamah] dari [Abu Sa'id]... seperti hadits diatas. Sedang [Al Auza'i] dan [Mu'awiyah bin Salam] mengatakan, telah menceritakan kepadaku [Az Zuhri] telah menceritakan kepadaku [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. Sedang [Ibnu Abu Husain] dan [Sa'id bin Ziyad] mengatakan, dari [Abu Salamah] dari [Abu Sa'id],,, seperti hadits diatas,, dan [Ubaidullah bin Abu Ja'far] telah menceritakan kepadaku [Shafwan] dari [Abu Salamah] dari [Abu Ayyub] mengatakan; aku mendengar Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7200,
			"arabicnumber": 7200,
			"text": "",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7201,
			"arabicnumber": 7201,
			"text": "Telah menceritakan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Khalid bin Al Harits] telah menceritakan kepada kami [Humaid] dari [Anas] radliallahu 'anhu; Nabi shallallahu 'alaihi wasallam berangkat di suatu pagi yang dingin sedang kaum muhajirin dan anshar sedang menggali Khandaq (parit), lantas Nabi melantunkan sebuah bait syair; \"Ya Allah, sesungguhnya kebaikan sejati adalah kebaikan akhirat, maka ampunilah kaum anshar dan muhajir.\" Serta merta para shahabat menyahut dengan bait syair; \"Kita adalah yang berbai'at kepada Muhammad untuk jihad sepanjang hayat",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7202,
			"arabicnumber": 7202,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] Telah mengabarkan kepada kami [Malik] dari [Abdullah bin Dinar] dari [Abdullah bin Umar] radliallahu 'anhuma mengatakan; kami ketika berbai'at kepada Rasulullah Shallallahu'alaihiwasallam untuk mendengar dan taat, beliau mengatakan kepada kami; \"Semaksimal kemampuan kalian",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7203,
			"arabicnumber": 7203,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan] telah menceritakan kepada kami [Abdullah bin Dinar] mengatakan, aku pernah menyaksikan [Ibnu Umar] ketika orang-orang berkumpul kepada Abdul Malik, ia mengatakan dengan menulis; \"Saya ikrarkan untuk senantiasa mendengar dan taat terhadap hamba Allah Abdul Malik amirul mukminin diatas sunnatullah dan sunnah rasul-NYA semaksimal kemampuanku, dan anak-anakku mengikrarkan yang sedemikian ini",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7204,
			"arabicnumber": 7204,
			"text": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Sayyar] dari [Ay Sya'bi] dari [Jarir bin Abdullah], mengatakan; aku berbaiat kepada Nabi shallallahu 'alaihi wasallam untuk mendengar dan taat, lantas beliau menemui aku seraya mengatakan; \"Semaksimal kemampuanmu dan untuk menasehati sesama muslim",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7205,
			"arabicnumber": 7205,
			"text": "Telah menceritakan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Yahya] dari [Sufyan] mengatakan, telah menceritakan kepadaku [Abdullah bin Dinar] mengatakan, ketika orang-orang berbai'at kepada Abdul Malik, [Abdullah bin Umar] berkirim surat; \"kepada hamba Allah, Abdul Malik amirul mukminin, aku berikrar untuk mendengar dan taat kepada hamba Allah amirul mukmin diatas sunnatullah dan sunnah rasul-NYA semaksimal kemampuanku dan sesungguhnya anak-anakku telah mengikrarkan yang demikian",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7206,
			"arabicnumber": 7206,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Hatim] dari [Yazid bin Abu Ubaid] mengatakan, saya bertanya kepada [Salamah]; Untuk apa kalian berbaiat kepada Nabi shallallahu 'alaihi wasallam dihari Hudaibiyah? ia menjawab; untuk menyongsong kematian",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7207,
			"arabicnumber": 7207,
			"text": "Telah menceritakan kepada kami [Abdullah bin Muhammad bin Asma`], telah menceritakan kepada kami [Juwairiyah] dari [Malik] dari [Az Zuhri], bahwa [Humaid bin Abdurrahman] mengabarinya, bahwa [Miswar bin Makhramah] mengabarinya; beberapa orang yang diserahi Umar untuk memegang mandat berkumpul dan bermusyawarah. Abdurrahman berkata kepada mereka; 'aku bukan bermaksud menyaingi kalian dalam masalah ini, namun jika kalian berkenan saya akan memilih (seorang pemimpin) untuk kalian dari kalian sendiri, ' maka mereka limpahkan wewenang itu kepada Abdurrahman. Ketika mereka sudah menguasakan urusannya kepada Abdurrahman, dan orang-orang menjadi simpati kepada Abdurrahman sehingga aku tidak melihat seorang pun mengikuti yang lain, dan tidak pula melangkahi kebijakan Abdurrahman, dan semua manusia sudah simpati kepada Abdurrahman, mereka memusyawarahkan kekuasaan itu beberapa malam, hingga setelah tiba malam yang pagi harinya kami berbaiat kepada Ustman. -Miswar melanjutkan; - Abdurrahman mengetukku setelah malam kian larut, ia mengetuk pintu hingga aku bangun, dan ia mengatakan; 'Kulihat dirimu tidur? Demi Allah, malam ini aku tidak bisa tidur nyenyak, tolong bertolaklah dan panggilah Zubair dan Sa'd, ' maka aku memanggil keduanya agar bertemu Abdurrahman, Abdurrahman kemudian mengajak keduanya bermusyawarah, kemudian ia memanggilku lagi dan berujar; 'Tolong panggillah Ali agar menemuiku! ' serta merta aku memanggilnya, dan Abdurrahman melakukan pertemuan empat mata dengannya hingga muadzin subuh memisahkan pertemuannya. Tatkala dia selesai shalat subuh, dan beberapa pemuka itu telah berkumpul di minbar, Abdurrahman mengutus utusan kepada hadirin dari muhajirin dan anshar, juga kepada para petinggi militer, yang ketika itu mereka bersama-sama haji bersama Umar. Dikala mereka telah berkumpul, Abdurrahman menyatakan kesaksian dan berujar; 'Amma ba'd. Wahai Ali, saya telah mencermati masalah manusia, dan tak kulihat mereka berpaling dari Ustman, maka janganlah engkau mencari-cari alasan terhadap dirimu.' Abdurrahman kemudian mengucapkan; 'Saya berbai'at kepadamu diatas sunnatullah dan sunnah rasul-Nya serta dua khalifah sepeninggalnya.' Selanjutnya Abdurrahman berbaiat kepadanya yang diikuti sahabat muhajirin dan anshar, para pejabat tinggi militer dan muslimin secara umum",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7208,
			"arabicnumber": 7208,
			"text": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Yazid bin Abu 'Ubaid] dari [Salamah] mengatakan, Kami berbaiat kepada Nabi shallallahu 'alaihi wasallam dibawah pohon, lantas Nabi mengatakan: \"Hai Salamah, tidakkah engkau berbaiat?\" 'Saya sudah pada baiat yang pertama ya Rasulullah' Jawabku. Maka Rasulullah menjawab: \"lakukanlah juga pada baiat yang kedua",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7209,
			"arabicnumber": 7209,
			"text": "",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7210,
			"arabicnumber": 7210,
			"text": "Telah menceritakan kepada kami ['Ali bin Abdullah] telah menceritakan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Sa'id, alias Ibnu Abu Ayyub] mengatakan; telah menceritakan kepadaku [Abu Uqail Zuhraj bin ma'bad] dari [kakeknya, Abdullah bin Hisyam], yang mana dia pernah bertemu Nabi shallallahu 'alaihi wasallam, ibunya, Zainab binti Muhammad, pernah membawanya kepada Rasulullah Shallallahu'alaihiwasallam dan berujar; 'Wahai Rasulullah, tolong bai'atlah dia.' Lantas Nabi shallallahu 'alaihi wasallam bersabda: \"dia masih kecil!\" Maka Nabi mengusap kepalanya dan menyembelihkan satu kambing untuk semua keluarganya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7211,
			"arabicnumber": 7211,
			"text": "",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7212,
			"arabicnumber": 7212,
			"text": "Telah menceritakan kepada kami ['Abdan] dari [Abu hamzah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada tiga orang yang Allah tidak mengajak bicara pada hari kiamat, tidak menyucikan mereka dan bagi mereka siksa yang pedih, seseorang yang terus membiarkan kelebihan air di jalan untuk mencegah ibnus sabil, dan seseorang yang berbaiat kepada imam, yang ia tidak berbaiat kepadanya selain untuk duniawi, jika imam memberi yang diinginkannya maka ia memenuhinya, namun jika tidak, ia tidak menunaikannya, dan seseorang yang melakukan transaksi jual beli dengan seseorang setelah `ashr, lantas si pembeli bersumpah dengan nama Allah, bahwa ia pernah membeli dengan harga sekian-sekian dan itu diberikan, lantas si penjual memberikannya (membenarkannya), sehingga si pembeli bisa mengambilnya padahal sebenarnya dengan harga tawarannya tak bisa mendapat barang",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7213,
			"arabicnumber": 7213,
			"text": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] -lewat jalur periwayatan lain- [Al Laits] mengatakan; telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepada kami [Abu Idris Al Khaulani], ia mendengar [Ubadah bin Shamit] mengatakan, Rasulullah Shallallahu'alaihiwasallam berujar kepada kami yang ketika itu kami berada dalam sebuah majlis; \"Kalian berbaiat kepadaku untuk tidak menyekutukan Allah dengan sesuatu apapun, tidak mencuri, tidak berzina, tidak membunuh anak-anak kalian dan tidak mengadakan kebohongan yang kalian ada-adakan diantara tangan dan kaki kalian, dan untuk tidak membangkang yang ma'ruf, maka siapa diantara kalian memenuhi baiatnya, maka ganjarannya disisi Allah, dan barangsiapa yang melanggar janji (ikrar atau baiat) nya lantas dihukum di dunia, maka itu sebagai kaffarat baginya, dan barangsiapa yang melanggarnya lantas Allah menutupinya (membiarkannya), maka urusannya kepada Allah, jika Allah berkenan Allah akan menyiksanya, dan jika berkenan ia memaafkannya.\" maka kami pun berbaiat kepadanya untuk sedemikian ini",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7214,
			"arabicnumber": 7214,
			"text": "Telah menceritakan kepada kami [Mahmud] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] radliallahu 'anha, mengatakan, Nabi shallallahu 'alaihi wasallam Shallallahu'alaihiwasallam membaiat wanita cukup dengan lisan (tidak berjabat tangan) dengan ayat ini; 'Untuk tidak menyekutukan Allah dengan sesuatu apapun.' sampai akhir (QS. Almumtahanah 12) kata Aisyah; Tangan Rasulullah Shallallahu'alaihiwasallam sama sekali tidak pernah menyentuh wanita selain wanita yang beliau miliki (isterinya)",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7215,
			"arabicnumber": 7215,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdul Warits] dari [Ayyub] dari [Hafshah] dari [Ummu 'Athiyyah] mengatakan, kami berbaiat kepada Nabi shallallahu 'alaihi wasallam, lantas beliau membacakan ayat: 'Untuk tidak menyekutukan Allah dengan sesuatu apapun.' sampai akhir(QS. Almumtahanah 12), dan beliau melarang kami dari niyahah (meratap, menjerit-jerit atau menapuk pipi ketika kematian). Kemudian ada seseorang yang mencabut tangannya dari kami dan mengatakan; 'wanita fulanah telah membahagiakanku dan aku ingin membalasnya, ' namun Nabi tidak mengucapkan apa-apa, lantas si wanita itu terus ngeloyor dan kembali lagi, sehingga tak ada yang memenuhi janji setianya (baiat) selain Ummu Sulaim, Ummul 'Ala, anak perempuan Abu Sabrah yang ia adalah isteri Mu'adz atau anak perempuan Abu Sabrah, dan isteri Mu'adz",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7216,
			"arabicnumber": 7216,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Al Munkadir], aku mendengar [Jabir] mengatakan; 'Seorang arab badui (nomade) mendatangi Nabi shallallahu 'alaihi wasallam dan berujar \"Baiatlah aku untuk Islam, \" maka Nabi membaiatnya untuk Islam. Keesokan harinya si arab badui tadi datang dalam keadaan demam, dan berujar; \"batalkanlah baiatku\" namun Nabi enggan. Ketika si arab badui sudah berpaling, Nabi bersabda: \"Madinah ini bagaikan tungku api yang menghilangkan karat-karatnya dan menyaring yang baik saja",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7217,
			"arabicnumber": 7217,
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Sulaiman bin Bilal] dari [Yahya binSa'id] aku mendengar [Al Qasim bin Muhammad] mengatakan, [Aisyah] radliallahu 'anha mengeluh; \"Aduh (sakitnya) kepalaku!\" Lantas Rasulullah Shallallahu'alaihiwasallam berujar; \"Kalaulah aku masih hidup, niscaya aku memintakan ampun untukmu dan mendoakan bagimu!\" Lantas Aisyah mengatakan; 'Duhai malangnya, demi Allah, aku berprasangka engkau menyukai kematianku, kalaulah demikian, lebih baik akhir-akhir harimu menjadi pengantin di rumah salah satu isterimu.' Lantas Rasulullah shallallahu 'alaihi wasallam menyahut: \"Bahkan aku, aduh sakitnya kepalaku! Saya berkeinginan sekali untuk mengutus utusan kepada Abu Bakar dan anaknya dan mewasiatkan (kekhilafahan kepadanya), (karena aku tidak suka) orang-orang berkata (khilafah untukku atau untuk fulan) atau (karena khawatir) orang-orang mengangan-angankannya, kemudian aku katakan; 'Allah enggan (kekhilafahan untuk selain Abu Bakar), dan orang-orang mukmin menolak (selain dia), \" atau dengan redaksi; \"Allah menolak (selain dia) dan orang-orang mukmin enggan (kekhilafahan untuk selain Abu Bakar)",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7218,
			"arabicnumber": 7218,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah mengabarkan kepada kami [Sufyan] dari [Hisyam bin Urwah] dari [ayahnya] dari [Abdullah bin Umar] radliallahu 'anhuma, ia mengatakan, [Umar] ditanya; 'mengapa engkau tidak mengangkat pengganti (untuk menjadi) khalifah? ' Umar menjawab; 'Kalaulah aku mengangkat pengganti (untuk menjadi) khalifah, sungguh orang yang lebih baik dari diriku Abu Bakar telah mengangkat pengganti (untuk menjadi) khalifah, dan kalaulah aku tinggalkan, orang yang lebih baik dari diriku juga telah meninggalkannya, yaitu Rasulullah Shallallahu'alaihiwasallam.' maka para sahabat memujinya, sehingga Umar mengatakan; 'Sungguh aku berharap-harap cemas, saya berharap sendainya aku selamat dari bahaya kekhilafahan ini dalam keadaan netral, tidak mendapat ganjaran, tidak juga mendapat dosa yang harus saya tanggung, baik ketika hidupku maupun kematianku",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7219,
			"arabicnumber": 7219,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Hisyam] dari [Ma'mar] dari [Az Zuhri] telah mengabarkan kepadaku [Anas bin Malik] radliallahu 'anhu, ia mendengar khutbah Umar yang terakhir ketika dia duduk diatas minbar, itu terjadi keesokan harinya setelah kewafatan Nabi shallallahu 'alaihi wasallam, [Umar] mengucapkan syahadat sedang Abu Bakar diam membisu tidak berbicara sama sekali. Kata Umar; 'aku sangat berharap seandainya Rasulullah Shallallahu'alaihiwasallam masih hidup hingga beliau hidup di belakang kita.' -Maksud Umar adalah seandainya Nabi shallallahu 'alaihi wasallam yang meninggal terakhir kali diantara para sahabat.- 'meskipun Muhammad Shallallahu'alaihiwasallam telah meninggal, tapi sesungguhnya Allah ta'ala telah menjadikan cahaya ditengah-tengah kalian yang bisa kalian jadikan untuk petunjuk. Allah telah menganugerahkan petunjuk kepada Muhammad Shallallahu'alaihiwasallam, dan sesungguhnya Abu Bakar adalah sahabat Rasulullah Shallallahu'alaihiwasallam, satu diantara dua orang (yang bersama beliau di gua tsur), dia adalah manusia yang paling utama untuk memegang amanat kepemimpinan urusan kalian, maka berdirilah kalian dan berbaiatlah kepadanya.' Sebagian diantara mereka ketika itu telah berbaiat kepadanya sebelum moment itu di Saqifah Bani Sa'idah, dan itulah bai'at umum diatas minbar. Az Zuhri mengatakan, dari Anas bin Malik, aku mendengar Umar mengatakan kepada Abu bakar ketika itu; \"Naiklah engkau ke minbar!\" Umar tiada henti-hentinya membujuknya hingga Abu bakar naik minbar, serta merta manusia secara umum berbaiat kepadanya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7220,
			"arabicnumber": 7220,
			"text": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah] telah menceritakan kepada kami [Ibrahim bin sa'd] dari [Ayahnya] dari [Muhammad bin Jubair bin Muth'im] dari [Ayahnya] mengatakan, ada seorang wanita menemui Nabi shallallahu 'alaihi wasallam dan mengajak beliau bicara tentang suatu hal. Lantas beliau menyuruh si wanita itu untuk menemuinya di kemudian hari. Si wanita menjawab; 'hai Rasulullah, bagaimana kalau aku datang namun tidak mendapatkanmu? - sepertinya yang wanita maksudkan, jangan-jangan Nabi shallallahu 'alaihi wasallam sudah meninggal- Nabi menjawab \"Jika kau tidak menemukan aku, datangilah Abu bakar",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7221,
			"arabicnumber": 7221,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan] telah menceritakan kepadaku [Qais bin Muslim] dari [Thariq bin Syihab] dari [Abu Bakar] radliallahu 'anhu. Ia berkata kepada utusan Buzakhakh; 'hendaknya kalian mengikuti ekor-ekor unta sampai Allah memperlihatkan kepada khalifah Nabi-NYA Shallallahu'alaihiwasallam dan kaum muhajirin, satu keputusan yang dapat dijadikan alasan untuk memaafkan kalian",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7223,
			"arabicnumber": 7223,
			"text": "Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari [Abu Zanad] dari [Al A'raj] dari [Abu Hurairah] radliallahu 'anhu, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-NYA, sungguh aku berkeinginan untuk dicarikan kayu bakar, kemudian kusuruh agar shalat dikumandangkan kemudian kusuruh seseorang untuk mengimami manusia, kemudian aku datangi orang-orang yang meninggalkan shalat kemudian aku bakar rumah mereka, Demi Dzat yang jiwaku berada di tangan-NYA, kalau salah seorang diantara kalian tahu akan mendapat sekerat daging gemuk atau dua bagian yang baik, niscaya ia akan menghadiri shalat isya",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7224,
			"arabicnumber": 7224,
			"text": "",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7225,
			"arabicnumber": 7225,
			"text": "Telah menceritakan kepadaku [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari [Abdurrahman bin Abdullah bin Ka'b bin Malik], bahwasanya [Abdullah bin Ka'b bin Malik], ia termasuk anaknya yang menuntun Ka'ab ketika telah buta (tuna netra), Abdullah mengatakan, aku mendengar [Ka'b bin Malik] mengatakan tatkala ketinggalan (duduk berpangku tangan) dari Rasulullah Shallallahu'alaihiwasallam dalam perang Tabuk. Ia menceritakan hadistnya yang panjang, dan menyebutkan bahwa; 'Rasulullah Shallallahu'alaihi wa sallam melarang kaum muslimin mengajak kami bicara, dan itu terus terjadi pada diri kami hingga lima puluh malam, dan Rasulullah Shallallahu'alaihiwasallam mengumumkan pengampunan Allah terhadap taubat kami",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 84
			}
		}
	]
}