{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7268,
			"arabicnumber": 7268,
			"text": "Telah menceritakan kepada kami [Abdullah bin Zubair Al Humaidi] telah menceritakan kepada kami [Sufyan] dari [Mis'ar] dan lainnya dari [Qais bin Muslim] dari [Thariq bin Syihab] ia berkata, \"Seorang laki-laki Yahudi berkata kepada [Umar], \"Wahai Amirul Mukminin, kalaulah ayat ini diturunkan kepada kami, yaitu ayat: '(Hari ini telah Aku sempurnakan untk kalian agama kalian, dan Aku semurkan bagi kalian Nikmat-Ku dan Aku ridhai Islam sebagai agama kalian) ' (Qs. Al Maidah: 2), niscaya telah kami jadikan hari itu sebagai hari raya.\" Lantas Umar berkata, \"Sungguh, aku tahu hari apa ayat itu diturunkan. Ayat itu diturunkan di hari Arafah pada hari jumat.\" Sufyan mendengar dari Mis'ar, Mis'ar mendengar dari Qais, dan Qais mendengar dari Thariq",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7269,
			"arabicnumber": 7269,
			"text": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Uqail] dari [Ibn Syihab] telah mengabarkan kepadaku [Anas bin Malik], ia mendengar [Umar] sehari setelah kewafatan Nabi, ketika kaum muslimin berbaiat kepada Abu Bakar dan berdiri di atas mimbar Rasulullah shallallahu 'alaihi wasallam, Umar memberi kesaksian sebelum Abu Bakar seraya berkata, \"Amma ba'du. Allah memilih untuk Rasul-Nya shallallahu 'alaihi wasallam apa yang berada di sisi-Nya, untuk mengatasi apa yang berada di sisi kalian, dan kitab inilah yang dengannya Allah memberi petunjuk kepada rasul kalian, maka ambillah sebagai petunjuk, niscaya kalian mendapatkan petunjuk, hanyasanya dengan kitab itulah Allah memberi petunjuk (hidayah) rasul-Nya",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7270,
			"arabicnumber": 7270,
			"text": "Telah menceritakan kepada kami [Musa bin Ismail] telah menceritakan kepada kami [Wuhaib] dari [Khalid] dari [Ikrimah] dari [Ibn Abbas] ia berkata, \"Nabi shallallahu 'alaihi wasallam pernah mendekapku sambil berdoa: \"Ya Allah, ajarkanlah padanya al kitab (al Quran)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7271,
			"arabicnumber": 7271,
			"text": "Telah menceritakan kepada kami [Abdullah bin Sabah] telah menceritakan kepada kami [Mu'tamir] berkata, aku mendengar [Auf], bahwa [Abul Minhal] menceritakan kepadanya, ia mendengar [Abu Barzah] berkata, \"Sesungguhnya Allah telah mengkayakan atau meninggikan derajat kalian dengan Islam dan dengan Muhammad shallallahu 'alaihi wasallam.\" Abu Abdullah berkata, \"Di sini tertulis 'Allah mengkayakan kalian', padahal dengan redaksi 'Hanyasanya ketinggian derajat kalian', ini bisa dilihat dalam asli kitab yang berjudul al-I'tisham (karangan Imam Bukhari lainnya)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7272,
			"arabicnumber": 7272,
			"text": "Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari [Abdullah bin Dinar], bahwa [Abdullah bin Umar] berkirim surat kepada Abdul Malik bin Marwan sebagai pernyataan baiat terhadapnya, isinya, 'Aku berikrar terhadapmu atas yang demikian dengan mendengar dan taat, di atas sunnah Allah dan sunnah rasul-Nya semaksimal kemampuanku",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7273,
			"arabicnumber": 7273,
			"text": "Telah menceritakan kepada kami [Abdul 'Aziz bin Abdullah] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ibn Syihab] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] radliallahu 'anhu, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku diutus dengan kalimat singkat yang padat makna, dan aku ditolong dengan rasa takut yang dihunjamkan dalam dada musuh-musuhku, dan ketika aku tidur, aku bermimpi diberi kunci-kunci perbendaharaan bumi lantas diletakkan di tanganku, \" Abu Hurairah berkata, 'Rasulullah shallallahu 'alaihi wasallam pergi (wafat) sedang kalian telah menikmati limpahan kekayaan itu -atau menghisap perbendaharaan bumi itu-atau kalimat-kalimat yang semisal",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7274,
			"arabicnumber": 7274,
			"text": "Telah menceritakan kepada kami ['Abdul 'Aziz bin Abdullah] telah menceritakan kepada kami [Al Laits] dari [Sa'id] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak seorang nabi pun kecuali ia diberi beberapa mukjizat yang tak bisa diserupai oleh apapun sehingga manusia mengimaninya -atau dengan redaksi 'sehingga manusia dijadikan beriman'-, namun yang diberikan kepadaku hanyalah berupa wahyu yang Allah wahyukan kepadaku, maka aku berharap menjadi manusia yang paling banyak pengikutnya di hari kiamat",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7275,
			"arabicnumber": 7275,
			"text": "Telah menceritakan kepada kami ['Amru bin Abbas] telah menceritakan kepada kami [Abdurrahman] telah menceritakan kepada kami [Sufyan] dari [Washil] dari [Abu Wail] berkata, \"Aku duduk mendekati [Syaibah] di masjid ini, ia katakan, \"Dan [Umar] pernah duduk kepadaku di majlismu lantas berkata, \"Sungguh aku berkeinginan tidak meninggalkan yang kuning tidak pula yang putih, selain kubagikan di antara muslimin.\" Maka aku katakan kepadanya, \"Engkau tak bakalan bisa melakukannya.\" Umar pun berkata, \"Mengapa!\" Aku jawab, \"Sebab kedua sahabatmu (Rasulullah dan Abu Bakar) belum pernah melakukannya.\" Lantas ia berkata, \"Keduanya adalah manusia yang menjadi keteladanan",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7276,
			"arabicnumber": 7276,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] ia berkata; aku bertanya kepada [Al A'masy], dan ia berkata dari [Zaid bin Wahb] aku mendengar [Hudzaifah] berkata, telah menceritakan kepada kami Rasulullah shallallahu 'alaihi wasallam, bahwa amanat turun dari langit di relung hati laki-laki, dan alquran turun lantas mereka baca alquran dan tahu assunnah",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7277,
			"arabicnumber": 7277,
			"text": "Telah menceritakan kepada kami [Adam bin Abu Iyas] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepada kami [Amru bin Murrah], aku mendengar [Murrah Al Hamdani] berkata, [Abdullah] berkata, \"Sebaik-baik pembicaraan adalah kitabullah dan sebaik-baik petunjuk adalah petunjuk Muhammad shallallahu 'alaihi wasallam, dan seburuk-buruk perbuatan adalah perkara baru, \" kemudian beliau mengutip ayat: '(Apa yang dijanjikan untuk kalian pasti akan datang) ' (Qs. Al an'aam: 134)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7279,
			"arabicnumber": 7279,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7280,
			"arabicnumber": 7280,
			"text": "Telah menceritakan kepada kami [Muhammad bin Sinan] telah menceritakan kepada kami [Fulaih] telah menceritakan kepada kami [Hilal bin Ali] dari ['Atha bin Yasar] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap umatku masuk surga selain yang enggan, \" Para sahabat bertanya, \"Wahai Rasulullah, lantas siapa yang enggan?\" Nabi menjawab: \"Siapa yang taat kepadaku masuk surga dan siapa yang membangkang aku berarti ia enggan",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7281,
			"arabicnumber": 7281,
			"text": "Telah menceritakan kepada kami [Muhammad bin Ubadah] Telah mengabarkan kepada kami [Yazid] telah menceritakan kepada kami [Salim bin Hayyan] dan ia memujinya, telah menceritakan kepada kami [Sa'id bin Mina'] telah menceritakan kepada kami, atau aku mendengar [Jabir bin 'Abdullah] berkata, \"Malaikat datang kepada nabi shallallahu 'alaihi wasallam yang ketika itu sedang tidur, lantas sebagian malaikat berkata \"Dia sedang tidur!\" Sedang sebagian mengatakan \"Mata dia tidur, namun hatinya selalu terjaga.\" Lantas mereka katakan, \"Sesungguhnya sahabat kalian ini adalah perumpamaan, maka buatlah perumpamaan baginya.\" Lantas sebagian berkata, \"Dia sedang tidur!\" Sebagian lagi mengatakan, \"Mata dia tidur, namun hatinya selalu terjaga.\" Lantas mereka katakan, \"Perumpaman dia bagaikan seseorang yang membangun rumah, dan mengisi rumahnya dengan hidangan, lantas mengutus seorang juru undang, maka barangsiapa memenuhi undangan si pengundang, ia masuk rumah dan menyantap hidangan, sebaliknya barangsiapa tidak memenuhi sang pengundang, ia tak bakalan masuk rumah dan tidak pula menyantap hidangan.\" Para malaikat berkata, \"Tolong takwilkanlah perumpaan itu agar dia paham.\" Lantas sebagian mengatakan \"Sesungguhnya ia sedang tidur!\" Sebagian lagi berkata, \"Mata bolehlah tidur namun hatinya selalu terjaga.\" Lantas mereka katakan, \"Rumah itu adalah surga, dan Sang pengundang adalah Muhammad shallallahu 'alaihi wasallam, artinya barangsiapa menaati Muhammad shallallahu 'alaihi wasallam, berarti ia menaati Allah, dan barangsiapa membangkang Muhammad shallallahu 'alaihi wasallam telah membangkang Allah.\" Hadits ini diperkuat oleh [Qutaibah] dari [Al Laits] dari [Khalid] dari [Sa'id bin Abu Hilal] dari [Jabir], 'Nabi shallallahu 'alaihi wasallam shallallahu 'alaihi wasallam menemui kami",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7282,
			"arabicnumber": 7282,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] dari [Hammam] dari [Khudzaifah] berkata, \"Wahai ahli alquran, bersikap istiqamahlah kalian, dengan demikian kalian telah menjadi pemenang yang jauh, sebaliknya jika kalian oleng kanan kiri, kalian telah sesat sesesat-sesatnya",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7283,
			"arabicnumber": 7283,
			"text": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Perumpamaanku dan perumpamaan risalah yang kubawa adalah bagaikan seseorang yang mendatangi sebuah kaum, lantas ia katakan, 'Hai kaum, aku telah melihat sebuah pasukan dengan kedua mataku, dan aku adalah pemberi peringatan orang yang telanjang, maka selamatkanlah kalian, selamatkanlah kalian.' Lantas sebagian kelompok kaumnya mentaatinya sehingga mereka meneruskan perjalanan sehingga selamat, namun sebagian lain mendustakan dan tetap berada di tempatnya hingga pasukan menyerangnya mereka di pagi buta dan menyandera mereka, itulah perumpamaan orang yang mentaatiku dan mengikuti risalah yang kubawa, dan perumpaman orang yang membangkangku dan mendustakan kebenaran yang kubawa",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7285,
			"arabicnumber": 7285,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7286,
			"arabicnumber": 7286,
			"text": "Telah menceritakan kepadaku [Ismail] telah menceritakan kepadaku [Ibn Wahb] dari [Yunus] dari [Ibn Syihab] telah menceritakan kepadaku [Ubaidullah bin Abdullah bin Utbah], bahwa [Abdullah bin Abbas] radliallahu 'anhuma berkata, \"Uyainah bin Hishn bin Khudaifah bin Badr datang dan singgah menemui anak saudaranya (keponakannya), Al Hurr bin Qais bin Hishn, dan dia termasuk sekian di antara sekelompok orang yang selalu didekati oleh Umar, qurra` (ahli baca alquran), dan selalu mengikuti majlis Umar dan musyawarah-musyarahnya, baik yang berusia dewasa atau muda. Kemudian 'Uyainah berkata kepada keponakannya, 'Wahai keponakanku, apakah engkau mempunyai kedekatan dengan amir ini sehingga bisa memintakannya ijin untukku sehingga aku bisa menemuinya? Al Hurr bin Qais lalu menjawab, \"Baik, aku akan memintakannya ijin untukmu.\" Ibn Abbas berkata, \"Lantas Al Hurr bin Qais meminta ijin untuk 'Uyainah. Tatkala Uyainah sudah menemui Umar, ia berkata \"Wahai Ibnul khattab, demi Allah, engkau belum memberi pemberian yang banyak kepada kami, dan belum juga engkau berbuat adil diantara kami.\" Spontan Umar marah hingga ia ingin menghukumnya. Namun Uyainah mengatakan, \"Bebaskan aku dari hukumanmu wahai amirul mukminin, sebab Allah berfirman kepada nabi shallallahu 'alaihi wasallam-Nya: '(Maafkanlah, lakukanlah yang ma'ruf dan berpalinglah dari orang-orang jahil' (Qs. Al A'raf 199), dan hukuman ini di antara kelakuan orang-orang bodoh. Demi Allah, maka Umar tidak jadi melakukan hukumannya ketika Uyainah membacakan kepadanya, Umar adalah orang yang selalu memegang teguh Kitabullah",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7287,
			"arabicnumber": 7287,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7288,
			"arabicnumber": 7288,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7289,
			"arabicnumber": 7289,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yazid Al Muqri'] Telah menceritakan kepadaku [Said] telah menceritakan kepadaku [Uqail] dari [Ibnu Syihab] dari ['Amir bin Sa'id bin Abu Waqash] dari [Bapaknya] bahwa Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Kaum muslimin yang paling besar dosanya adalah yang bertanya tentang sesuatu, lantas sesuatu tersebut diharamkan karena pertanyaannya, padahal sebelumnya tidak diharamkan",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7290,
			"arabicnumber": 7290,
			"text": "Telah menceritakan kepada kami [Ishaq] telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Musa bin Uqbah] aku mendengar [Abu Nadlr] menceritakan dari [Busr bin sa'id] dari [Zaid bin Tsabit], bahwa Nabi shallallahu 'alaihi wasallam pernah mengambil kamar di masjid dari tikar, lantas Rasulullah shallallahu 'alaihi wasallam shalat di sana beberapa malam hingga beberapa sahabat berkumpul kepadanya, lalu disuatu malam mereka tidak mendengar suara beliau hingga mereka menyangka bahwa beliau tertidur. Sebagian sahabat lalu pura-pura batuk agar Nabi muncul menemui mereka, maka beliau pun bersabda: \"Masih saja aku lihat kalian melakukan perbuatan kalian itu (shalat malam), hingga aku khawatir bahwa itu akan diwajibkan atas kalian, padahal jika diwajibkan atas kalian, niscaya kalian tak bisa melakukannya. Shalatlah hai manusia di rumah kalian, sebab seutama-utama shalat seseorang adalah di rumahnya selain shalat wajib",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7291,
			"arabicnumber": 7291,
			"text": "Telah menceritakan kepada kami [Yusuf bin Musa] telah menceritakan kepada kami [Abu Usamah] dari [Buraid bin Abu Burdah] dari [Abu Burdah] dari [Abu Musa Al Asy'ari] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah ditanya tentang beberapa perkara yang tidak beliau sukai, tatkala mereka memperbanyak pertanyaan, maka beliau marah dan mengatakan: \"Bertanyalah kalian kepadaku.\" Lantas ada seseorang berdiri dan bertanya, 'Ya Rasulullah, Siapa ayahku? ' Rasulullah menjawab: \"Ayahmu Hudzafah.\" Kemudian ada laki-laki lain berdiri dan bertanya, \"Wahai Rasulullah, siapa ayahku? ' Rasulullah menjawab: \"Ayahmu Salim, budak Syaibah.\" Dikala Umar melihat apa yang terjadi pada wajah Rasulullah shallallahu 'alaihi wasallam karena marah, Umar berkata, \"Kami bertaubat kepada Allah 'azza wajalla",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7292,
			"arabicnumber": 7292,
			"text": "Telah menceritakan kepada kami [Musa] telah menceritakan kepada kami [Abu 'Awanah] telah menceritakan kepada kami [Abdul Malik] dari [Warrad] juru tulis Mughirah, berkata, \"Mu'awiyah berkirim surat kepada [Mughirah], 'Tolong tulislah kepadaku segala yang kau dengar dari Rasulullah shallallahu 'alaihi wasallam! Lantas Mughirah menulis 'Nabiyullah shallallahu 'alaihi wasallam sehabis shalat selalu memanjatkan doa: LAA-ILAAHA ILLALLAAH, WAHDAHU LAA SYARIIKA LAHU, LAHUL MULKU WALAHUL HAMDU WAHUWA 'ALAA KULLI SYAI`IN QADIIR, ALLAAHUMMA LAA MAANI'A LIMAA A'THAITA WALAA MU'THIYA LIMAA MANA'TA WALAA YANFA'U DZAL JADDI MINKAL JADDU (Tiada sesembahan yang hak selain Allah, tiada sekutu bagi-Nya, Milik-Nya lah segala kerajaan dan bagi-Nya segala puji dan Dia Maha berkuasa atas segala sesuatu. Ya Allah, tiada yang menghalangi apa yang Engkau berikan, dan tidak ada yang bisa memberi apa yang Engkau cegah, dan tidak bermanfaat kekayaan, dari-Mulah segala kekayaan) '. Dan Mughirah menulis, \"Beliau melarang mengatakan sesuatu yang tidak jelas sumbernya, banyak bertanya dan menghambur-hamburkan harta. Beliau juga melarang mendurhakai ibu, mengubur hidup-hidup anak perempuan serta menghalangi orang lain memperoleh kemanfaatan",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7293,
			"arabicnumber": 7293,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Tsabit] dari [Anas] berkata, \"Pernah kami di sisi [Umar] dan beliau berkata, \"Kami dilarang mengada-ada",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7294,
			"arabicnumber": 7294,
			"text": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri]. (dalam jalur lain disebutkan) telah menceritakan kepadaku [Mahmud] telah menceritakan kepada kami [Abdurrazaq] Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] telah mengabarkan kepadaku [Anas bin Malik] radliallahu 'anhu, Nabi shallallahu 'alaihi wasallam berangkat ketika matahari telah miring, lalu beliau shalat zhuhur, selesai salam beliau berdiri di atas mimbar dan mengingatkan kiamat, beliau ceritakan bahwa menjelang kiamat terjadi peristiwa-peristiwa besar, kemudian berkata: \"Siapa yang ingin bertanya sesuatu, silahkan! Demi Allah, tidaklah kalian bertanya kepadaku tentang sesuatu, selain kuberitakan kepada kalian selama aku masih berada di tempatku ini.\" Anas berkata, \"Lantas Orang-orang menangis terisak-isak dan Rasulullah shallallahu 'alaihi wasallam memperbanyak bertanya: \"Bertanyalah kalian kepadaku!\" Anas melanjutkan, \"Lantas ada seseorang berdiri menuju beliau dan bertanya, \"Dimanakah tempat tinggalku ya Rasulullah?\" Beliau menjawab: \"Kamu di neraka.\" Lantas Abdullah bin Khudzaifah berdiri dan bertanya, \"Siapa ayahku ya Rasulullah?\" Nabi menjawab: \"Ayahmu Hudzaifah.\" Anas melanjutkan perkataannya, \"Nabi memperbanyak bertanya: \"Bertanyalah kalian kepadaku, bertanyalah kalian kepadaku.\" Lantas Umar meletakkan kedua lututnya dan berkata, 'Kami ridla Allah sebagai Rabb, Islam sebagai agama, dan Muhammad shallallahu 'alaihi wasallam sebagai Rasul.\" Rasulullah shallallahu 'alaihi wasallam lantas terdiam ketika Umar mengucapkan yang demikian. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang diriku berada di tangan-Nya, tadi telah diperlihatkan kepadaku surga dan neraka dibalik tembok ini ketika aku shalat, dan belum pernah kulihat kebaikan dan keburukan seperti hari ini",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7295,
			"arabicnumber": 7295,
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdurrahim] Telah mengabarkan kepada kami [Rauh bin Ubadah] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Musa bin Anas] berkata, \"Aku mendengar [Anas bin Malik] berkata, \"Seseorang bertanya 'Wahai nabiyullah, siapa ayahku?\" Rasul menjawab: \"Ayahmu si A.\" Lantas turunlah ayat: '(Wahai orang-orang yang beriman, janganlah kalian bertanya tentang sesuatu…). (Qs. Al Maidah: 101)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7296,
			"arabicnumber": 7296,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Shabbah] telah menceritakan kepada kami [Syababah] telah menceritakan kepada kami [Warqa'] dari [Abdullah bin Abdurrahman] aku mendengar [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Manusia tidak henti-hentinya bertanya hingga saling bertanya 'Allah adalah pencipta segala sesuatu, lantas siapa yang menciptakan Allah?",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7297,
			"arabicnumber": 7297,
			"text": "Telah menceritakan kepada kami [Muhammad bin Ubaid bin Maimun] telah menceritakan kepada kami ['Isa bin Yunus] dari [Al A'masy] dari [Ibrahim] dari ['Alqamah] dari [Ibn Mas'ud] rahiyallahu'anhu berkata, \"Pernah aku bersama nabi shallallahu 'alaihi wasallam di sebuah kebun Madinah sedang beliau menyandarkan punggung, lantas beberapa orang Yahudi lewat, dan sebagian mereka mengatakan 'Coba tanyailah dia tentang roh! ' Sebagian berkata 'Jangan kalian tanyai dia tentang itu, sebab yang kalian benci tidak bisa memperdengarkan kepada kalian.' Namun sebagian mereka berdiri dan bertanya \"Wahai Abul Qasim, beritahukanlah kami tentang roh! ' Lantas beliau berdiri beberapa saat mengamat-amati, maka aku tahu bahwa beliau sedang menerima wahyu, maka aku berusaha menyingkir dari beliau, hingga wahyu terangkat, kemudian beliau bersabda mengutip ayat: '(Mereka bertanya kepadamu tentang roh, katakanlah bahwa roh itu urusan Rabbiku) ' (Qs. Al Israa`: 85)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7298,
			"arabicnumber": 7298,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Dinar] dari [Ibn Umar] radliallahu 'anhuma, ia berkata, \"Nabi shallallahu 'alaihi wasallam memakai cincin emas, lantas para sahabat juga membuat cincin emas, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Sungguh, aku dahulu memang memakai cincin emas, \" lantas beliau membuangnya dan bersabda: \"Sekali-kali aku tidak bakalan memakainya lagi, \" maka para sahabat juga membuang cincin mereka",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7299,
			"arabicnumber": 7299,
			"text": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Hisyam] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] mengatakan, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Jangan kalian berpuasa wishal!\" Para sahabat menyatakan protesnya \"Namun anda sendiri berpuasa wishal!\" Nabi menjawab: \"Aku tidak seperti kalian, Tuhanku selalu memberiku makan dan minum.\" Namun para sahabat tidak juga menghentikan wishalnya.\" Abu Hurairah melanjutkan, \"Maka Rasulullah shallallahu 'alaihi wasallam terus melakukan wishal bersama mereka dua hari atau dua malam, kemudian para sahabat melihat hilal (bulan sabit). Lantas Nabi shallallahu 'alaihi wasallam bersabda: \"Kalaulah bulan sabit ini terlambat, niscaya aku tambah puasa wishalnya, \" seolah-olah beliau ingin menghukum mereka",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7300,
			"arabicnumber": 7300,
			"text": "Telah menceritakan kepada kami ['Umar bin Hafs bin Ghiyats] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] Telah menceritakan kepadaku [Ibrahim At Taimi] Telah menceritakan kepadaku [Ayahku] mengatakan, \" [Ali] radliallahu 'anhu berpidato kepada kami di atas mimbar dari batu bata yang dipanggang yang di atasnya tergeletak pedang berisikan lembaran catatan yang menggantung. Lantas Ali berkata, \"Demi Allah, kami tidak mempunyai kitab suci yang dibaca selain Kitabullah dan apa yang terdapat dalam lembaran catatan ini.\" Lantas Ali membukanya, ternyata isinya gigi-gigi unta dan ternyata isinya ada pernyataan, \"Kota Madinah adalah haram semenjak 'Air (gunung di Madinah) hingga sini, maka barangsiapa melakukan keonaran (pelanggaran) di sana, maka baginya laknat Allah, laknat malikat dam manusia secara keseluruhan, Allah tidak menerima amalannya, baik yang wajib maupun yang sunnah, dan dalam lembaran catatan itu ada pernyataan 'Barangsiapa bersekutu kepada suatu kaum tanpa seijin sekutu sebelumnya, maka baginya laknat Allah, malaikat dan seluruh manusia, Allah tidak menerima amalannya, baik yang wajib maupun yang sunnah",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7301,
			"arabicnumber": 7301,
			"text": "Telah menceritakan kepada kami [Umar bin Hafs] telah menceritakan kepada kami [Ayahku] telah mencerikan kepadaku [Al A'masy] telah menceritakan kepada kami [Muslim] dari [Masruq] berkata, \" [Aisyah] radliallahu 'anha berkata, \"Nabi shallallahu 'alaihi wasallam membuat sesuatu yang diperbolehkan bagi beliau, namun ada beberapa sahabat yang mengingkarinya (tidak mau menyatapnya). Berita itu kemudian sampai kepada nabi shallallahu 'alaihi wasallam, beliau kemudian memuja dan memuji Allah, lantas berkata: \"Apa alasan mereka itu menyingkiri sesuatu yang aku buat, demi Allah, aku adalah manusia yang paling mengenal Allah dan paling takut kepada-Nya",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7302,
			"arabicnumber": 7302,
			"text": "Telah menceritakan kepada kami [Muhammad bin Muqatil] telah mengabarkan kepada kami [Waki'] telah mengabarkan kepada kami [Nafi' bin Umar] dari [Ibn Abu Mulaikah] berkata, \"Hampir saja dua orang pilihan, Abu Bakar dan Umar, binasa tatkala utusan Bani Tamim menemui Nabi shallallahu 'alaihi wasallam, salah satu diantara dua sahabat pilihan itu menunjuk Aqra' bin Habis At Tamimi Al Hanzhali, saudara Bani Mujasyi', sedang lainnya menunjuk lainnya. Maka Abu Bakar berkata kepada Umar, 'Kamu inginnya menyelisihiku saja!\" Umar mengelak seraya mengatakan, \"Aku sama sekali tak berniat menyelisihimu! Suara keduanya terus semakin gaduh di sisi Nabi shallallahu 'alaihi wasallam, sehingga turunlah ayat: '(Wahai orang-orang yang beriman, jangan kalian meninggikan suara kalian diatas suara Nabi) ' (Qs. Al Hujurat: 2-3). Ibnu Abu Mulaikah berkata, \" [Ibnu Zubair] berkata, \"Di kemudian hari Umar -dan ia tidak menyebutkan dari kakeknya maksudnya Abu bakar- jika mengajak bicara dengan nabi shallallahu 'alaihi wasallam dengan suatu pembicaraan seperti orang yang mengadakan pembicaraan rahasia, tidak sampai terdengar orang lain hingga betul-betul ia memahaminya",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7303,
			"arabicnumber": 7303,
			"text": "Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari [Hisyam bin Urwah] dari [ayahnya] dari ['Aisyah] Ummul Mukminin, Rasulullah shallallahu 'alaihi wasallam bersabda ketika sakitnya: \"Suruhlah Abu bakar untuk mengimami orang-orang.\" 'Aisyah berkata, \"Aku katakan, 'Abu Bakar jika menggantimu, ia tidak bisa membaca bacaan secara keras hingga terdengar makmum karena suka menangis, suruh saja Umar untuk mengimami orang-orang! Namun Nabi tetap berkata: \"Suruhlah Abu Bakar untuk mengimami orang-orang! Aisyah katakan, \"Karenanya aku sarankan kepada Hafsah 'Tolong sampaikan kepada nabi, 'Abu Bakar jika menggantikanmu, ia tidak bisa membaca dengan keras sehingga terdengar makmum karena suka menangis, suruh saja Umar untuk mengimami orang-orang! ' Hafshah kontan mengerjakan saran Aisyah. Lantas Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalian ini seperti saudara-saudara Yusuf saja (yang gemar berkomplot), suruh Abu bakar untuk mengimami orang-orang!\" Maka Hafshah berkata kepada Aisyah, \"Ternyata aku tidak memperoleh kebaikan dari saranmu",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7304,
			"arabicnumber": 7304,
			"text": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Muhammad bin Abdurrahman bin Abu Dzi'b] telah memberitakan kepada kami [Az Zuhri] dari [Sahl bin Sa'd as Sa'idi] berkata, \"Uwaimir Al 'Ajlani datang kepada 'Ashim bin Adi dan berkata, 'Bagaimana pendapatmu jika seorang laki-laki menemukan isterinya bersama laki-laki lain, lantas si suami membunuh laki-laki itu, apakah kalian lantas membunuh si suami karena pembunuhannya? Tolong tanyakan kepada Rasulullah untukku wahai Ashim!\" Lantas 'Ashim bertanya Nabi shallallahu 'alaihi wasallam. Rupanya nabi shallallahu 'alaihi wasallam tidak menyukai banyak tanya dan bahkan mencelanya. 'Ashim pun pulang dan mengabarkan kepadanya bahwa nabi shallallahu 'alaihi wasallam tidak menyukai banyak tanya. Spontan 'Uwaimir berkata, 'Sungguh akan kudatangi Nabi shallallahu 'alaihi wasallam! ' Uwaimir datang, sedang Allah ta'ala telah menurunkan alquran di belakang 'Ashim. Nabi terus berkata: \"Allah telah menurunkan alquran di tengah-tengah kalian.\" Lantas Rasul memanggil suami-isteri itu. Keduanya hadir dan saling meli'an. Kemudian Uwaimir berkata, 'Berarti kau dusta terhadap isteriku ya Rasulullah, jika aku terus mempertahankannya. Nabi pun langsung memisahkan si wanita dan tidak menyuruh si suami untuk memisahkan, dan pemisahan ini menjadi sunnah (pedoman) bagi suami-isteri yang saling meli'an. Kemudian Nabi shallallahu 'alaihi wasallam bersabda \"Tolong cermatilah bayinya, jika si wanita melahirkan bayi yang merah dan pendek, seperti tokek, maka aku tak berpendapat selain Uwaimir telah bohong, namun jika si wanita melahirkan bayi yang matanya hitam kelam yang mempunyai dua pantat, maka aku tak berpendpat selain Uwaimir telah jujur sehingga si wanita yang keliru.\" Di kemudian hari si wanita melahirkan bayi yang ciri-cirinya sangat disanksikan (sangat tidak menyerupai ayahnya)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7305,
			"arabicnumber": 7305,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah menceritakan kepada kami [Al Laits] telah menceritakan kepadaku ['Uqail] dari [Ibn Syihab] berkata, telah mengabarkan kepadaku [Malik bin Aus an Nashri], dan [Muhammad bin Jubair bin Muth'im] pernah mengingatkan aku tentang hal itu. AKu menemui Malik dan aku bertanya kepadanya.\" Ia meneruskan, \"Aku terus bertolak hingga kutemui [Umar], kemudian penjaga rumahnya bertanya, \"Apakah engkau berkenan memberi ijin [Utsman], [Abdurrahman bin Auf], [Zubair], dan [Sa'd] untuk bertemu?\" Umar menjawab, \"Ya.\" Mereka pun masuk, mengucapkan salam dan duduk. Si penjaga pintu bertanya lagi, \"Apakah anda memberi ijin untuk [Ali] dan [Abbas]\" Umar pun mengijinkan keduanya. Abbas kemudian bertanya, \"Wahai Amirul Mukminin, putuskanlah antara aku dan orang yang zhalim yang mencela.\" Sekelompok orang yang di antaranya Utsman dan para sahabatnya kemudian berkata, \"Wahai Amirul Mukminin, putuskanlah antara keduanya dan nyamankanlah salah satunya dari yang lain.\" Umar menjawab, \"Tolong kalian yang bijak, aku bersumpah atas kalian dengan nama Allah yang karena ijin-Nya langit dan bumi tegak. Tahukah kalian bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: 'Kami tidak diwarisi, apa yang kami tinggalkan adalah sedekah (bukan warisan) '? Maka kumpulan sahabat tadi menjawab, \"Memang beliau pernah bersabda yang demikian ini.\" Umar lalu menemui Ali dan Abbas seraya berkata, \"Aku bersumpah atas kalian dengan nama Allah, bukankah kalian berdua tahu bahwa Rasulullah pernah bersabda yang sedemikian tadi?\" Keduanya menjawab, \"Ya.\" Umar lalu berkata, \"Karenanya aku sekarang bicara kepada kalian tentang masalah (harta nabi). Sesungguhnya Allah mengkhususkan hanya untuk rasul-Nya shallallahu 'alaihi wasallam dalam hal harta ini, suatu yang tak akan diberikan-Nya kepada seorang pun, sebab Allah berfirman: '(Apa yang Allah berikan kepada rasul-Nya dari para tawanan, yang kamu dapatkan dengan tanpa mengerahkan… dan seterusnya (Qs. Al Hasyr; 6), kesemuanya ini adalah khusus bagi Rasulullah shallallahu 'alaihi wasallam. Kemudian demi Allah, beliau tidak memberikannya dan tidak pula menganugerahkanya secara khusus untuk kalian. Dahulu Rasul telah memberikannya kepada kalian dan membagikannya di tengah-tengah kalian, hingga harta ini masih tersisa. Dan Nabi shallallahu 'alaihi wasallam memberi belanja tahunan kepada keluarganya dari harta ini, kemudian beliau tarik sisanya dan beliau jadikan sebagai harta Allah, dan begitulah beliau mengelola hartanya semasa hidupnya. Aku bersumpah atas kalian dengan nama Allah, bukankah kalian tahu terhadap itu semua? Mereka menjawab, \"Ya.\" Kemudian Umar berkata kepada Ali dan Abbas, \"Aku bersumpah atas kalian dengan nama Allah, bukankah kalian berdua tahu tentang ini semua?\" keduanya menjawab, \"Ya.\" Umar meneruskan bicaranya, \"Kemudian Allah mewafatkan nabi-Nya shallallahu 'alaihi wasallam, lantas Abu Bakar mengatakan aku adalah wali Rasulullah shallallahu 'alaihi wasallam sehingga Abu Bakar mewenanginya dan mengelolanya sebagaimana Rasulullah shallallahu 'alaihi wasallam mengelolanya, dan kamu ketika itu juga ada.\" Lantas Umar menghadap Ali dan Abbas dengan mengatakan, \"Kalian beranggapan bahwa Abu Bakar seperti ini dan seperti ini, padahal Allah tahu bahwa dia terhadap harta itu betul-betul jujur, baik, lurus, dan mengikuti kebenaran. Kemudian Allah mewafatkan Abu bakar, maka aku (Umar) katakan bahwa aku sekarang adalah wali Rasulullah shallallahu 'alaihi wasallam dan juga wali Abu bakar, maka aku mewenangi harta itu dua tahun yang aku kelola sebagaimana Rasulullah shallallahu 'alaihi wasallam dan Abu Bakar mengelola, lantas anehnya kalian berdua mendatangi aku sedang kalian kompak, sama-sama sepakat, kamu menemuiku untuk meminta bagianmu dari anak saudaramu (ucapan ini Umar tujukan kepada Abbas, sebab ia adalah paman Rasulullah), sedang si ini (maksudnya Ali) datang kepadaku memintaku bagian isterinya dari ayahnya (Ucapan ini Umar tujukan kepada Ali, sebab ia adalah menantu Rasulullah). Maka aku katakan, 'Jikalah kalian berkenan, harta itu aku serahkan kepada kalian berdua, hanya kalian harus menerima resiko tanggung jawab dari janji Allah dan ikrar-Nya, yaitu agar kalian berdua mengelolanya sebagaimana Rasulullah shallallahu 'alaihi wasallam mengelola, dan juga sebagaimana Abu Bakar mengelola, dan juga sebagaimana aku mengolala semenjak aku mewenanginya. Kalaulah kamu berdua tidak bisa, tolong jangan kalian berdua mengajakku bicara tentang harta itu, jangan kalian berdua berkata, 'Serahkan harta itu kepada kami berdua' lantas aku katakan, 'kuserahkan kepadamu berdua'. Adapun sekarang, aku bersumpah kepada kalian dengan nama Allah, bukankah telah aku serahkan sekarang kepada keduanya?\" Beberapa kumpulan sahabat yang hadir menjawab, \"Benar, \" lantas Umar menghadap Ali dan Abbas seraya berkata, \"Aku bersumpah atas kalian berdua (dengan nama Allah), bukankah telah aku serahkan kepada kalian berdua masalah harta itu?\" Keduanya menjawab, \"Benar.\" Umar kemudian berkata, \"Apakah kalian berdua mencari-cari keputusan selain itu setelah memperolehnya dariku? Demi Dzat yang karena seijin-Nya bumi dan langit menjadi tegak, selama-lamanya aku tidak akan memutuskan keputusan selain itu hingga kiamat tiba. Maka jika kalian berdua tidak mampu, serahkan saja kepadaku, sebab aku bisa mengganti kalian berdua",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7306,
			"arabicnumber": 7306,
			"text": "Telah menceritakan kepada kami [Musa bin Ismail] telah menceritakan kepada kami ['Abdul Wahid] telah menceritakan kepada kami ['Ashim] berkata, \"Aku bertanya kepada [Anas], \"Bukankah Rasulullah shallallahu 'alaihi wasallam telah mengharamkan Madinah?\" Ia menjawab, \"Benar, yaitu antara ini hingga itu, demikian pula tidak dibenarkan pohonnya ditebang, barangsiapa mengada-adakan keonaran (pelanggaran) di sana, maka baginya laknat Allah, malaikat dan semua manusia.\" 'Ashim berkata, \"Musa bin Anas mengabarkan kepadaku, bahwa beliau mengatakan: \"Atau melindungi orang yang berbuat salah",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7307,
			"arabicnumber": 7307,
			"text": "Telah menceritakan kepada kami [Sa'id bin Talid] telah menceritakan kepadaku [Ibn Wahb] telah menceritakan kepadaku [Abdurrahman bin Syuraikh] dan lainnya dari [Abul Aswad] dari ['Urwah] berkata, \" [Abdullah bin Amru] mendatangi kami dan kudengar ia berkata, 'Aku mendengar Nabi shallallahu 'alaihi wasallam shallallahu 'alaihi wasallam bersabda: \"Allah tidak mencabut ilmu setelah Ia berikan kepada kalian secara spontanitas (sekaligus), namun Allah mencabutnya dari mereka dengan cara mewafatkan para 'ulama yang sekaligus tercabut keilmuan mereka, sehingga yang tinggal hanyalah manusia-manusia bodoh, mereka dimintai fatwa, lalu mereka memberikan fatwa berdasarkan logika mereka sendiri, mereka sesat dan juga menyesatkan.\" Hadits ini kemudian aku ceritakan kepada 'Aisyah, isteri nabi shallallahu 'alaihi wasallam, Ketika Abdullah bin Amru berhaji, 'Aisyah berkata, \"Wahai anak saudaraku, tolong temuilah Abdullah dan carilah kepastian (riwayat) darinya sebagaimana riwayat engkau ambil darinya. Aku pun mendatangi Abdullah dan aku tanyakan kepadanya. Abdullah kemudian menceritakan kepadaku dengannya seperti yang ia ceritakan kepadaku, lalu kudatangi 'Aisyah dan aku kabarkan kepadanya. Ia pun terkagum-kagum dan berkata \"Demi Allah, 'Abdullah bin 'Amru memang betul-betul hafal",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7308,
			"arabicnumber": 7308,
			"text": "Telah menceritakan kepada kami ['Abdan] telah mengabarkan kepada kami [Abu Hamzah] aku mendengar [Al A'masy] ia berkata, \"Aku mendengar [Abu Wail] berkata, \"Apakah engkau menyaksikan perang Shiffin?\" Ia menjawab, \"Ya. Aku mendengar [Sahl bin Hunaif] berkata.\" (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musa bin Ismail] telah menceritakan kepada kami [Abu Awanah] dari [Al A'masy] dari [Abu Wail] ia berkata; [Sahl bin Hunaif] berkata, \"Wahai manusia, telitilah logika kalian terhadap agama kalian, sebab ketika hari-hari Abu jandal disiksa, aku berpendapat kalaulah bisa akan kutolak perintah Rasulullah shallallahu 'alaihi wasallam, dan tidak akan kami letakkan pedang kami yang berada di atas pundak kami karena suatu hal yang menjadikan hati kami sangat miris, hanya pendapat kami --alhamdullillah-memudahkan kami menerima sesuatu yang akhirnya bisa kami sadari, yang sangat berlawanan dengan kejadian yang ada.\" Al A'masy berkata, \"Abu Wail berkata, \"Aku pernah menyaksikan perang Shiffin, dan alangkah buruk tragedi perang shiffin",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7309,
			"arabicnumber": 7309,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] berkata, aku mendengar [Ibnul Munakdir] berkata, aku mendengar [Jabir bin Abdullah] mengatakan, \"Saat aku sakit Rasulullah shallallahu 'alaihi wasallam dan Abu Bakar membesukku dengan berjalan kaki. Keduanya menjengukku sedang aku dalam keadaan pingsan. Lantas Rasulullah shallallahu 'alaihi wasallam berwudlu dan menuangkan wudlunya kepadaku sehingga aku siuman. Kemudian aku katakan, \"Wahai Rasulullah, \" dan terkadang Sufyan menyebutkan \"Hai Rasulullah (bukan Wahai namun Hai), bagaimana harus aku putuskan masalah hartaku? Dan bagaimana yang harus kuperbuat terhadap hartaku?\" Jabir berkata, \"Beliau tidak menjawabku dengan suatu apapaun hingga ayat tentang waris diturunkan",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7310,
			"arabicnumber": 7310,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu'Awanah] dari [Abdurrahman bin Al Ashbahani] dari [Abu Shalih Dzakwan] dari [Abu Sa'id], bahwa seorang wanita menemui Rasulullah shallallahu 'alaihi wasallam dan menyampaikan uneg-unegnya, \"Wahai Rasulullah, orang laki-laki sudah biasa datang kepadamu dan menimba hadits, maka tolong berilah kami jatah harimu sehingga kami bisa menemuimu dan anda dapat mengajarkan kepada kami ilmu yang telah Allah ajarkan kepada anda.\" Rasul mengiayakan dengan bersabda: \"Boleh, berkumpullah kalian pada hari ini dan ini, di tempat si fulan dan fulan, \" maka para wanita pun berkumpul dan Rasulullah shallallahu 'alaihi wasallam mengajari mereka ilmu yang telah Allah ajarkan kepada beliau. Kemudian Rasulullah shallallahu 'alaihi wasallam mengatakan kepada para wanita itu: \"Tidaklah salah seorang di antara kalian melahirkan tiga anak (yang shalih), kecuali ketiga anak itu akan menjadi penghalang neraka baginya.\" Maka ada seorang wanita yang bertanya, 'Wahai Rasulullah, bagaimana kalau hanya dua?\" Wanita itu mengulanginya hingga dua kali. Maka Rasulullah menjawab: \"Sekalipun hanya dua, sekalipun hanya dua",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7311,
			"arabicnumber": 7311,
			"text": "Telah menceritakan kepada kami [Ubaidullah bin Musa] dari [Ismail] dari [Qais] dari [Mughirah bin Syu'bah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Akan senantiasa ada sekelompok dari umatku yang tegar di jalan kebenaran hingga keputusan Allah datang kepada mereka, dan mereka selalu tegar dalam jalan kebenaran",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7312,
			"arabicnumber": 7312,
			"text": "Telah menceritakan kepada kami [Ismail] telah menceritakan kepada kami [Ibn Wahb] dari [Yunus] dari [Ibn Syihab] telah mengabarkan kepadaku [Humaid] berkata, aku mendengar [Mu'awiyah bin Abu Sufyan] berpidato dengan berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda; \"Barangsiapa yang Allah kehendaki menjadi baik, maka Allah menjadikannya pandai terhadap urusan agamanya, hanyasanya aku membagi sedang Allah Sang pemberi, dan keadaan umat ini akan terus senantiasa lurus hingga kiamat tiba, atau dengan redaksi, 'hingga keputusan Allah tiba",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7313,
			"arabicnumber": 7313,
			"text": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan], ['Amru] berkata, \"Aku mendengar [Jabir bin Abdullah] radliallahu 'anhuma berkata, \"Ketika diturunkan kepada Rasulullah shallallahu 'alaihi wasallam ayat: '(Katakanlah, Dialah Allah yang mampu mengutus siksa kepada kalian dari atas kamu) ' (Qs. Al an'aam: 65), maka Rasulullah berdoa: 'Aku berlindung dengan wajah-Mu, '(Atau dari bawah kakimu) ', Nabi berdoa: \"Aku berlindung dengan wajah-Mu, \" maka dikala diturunkan: '(atau menjadikan kalian berkelompok-kelompok dan menjadikan sebagian di antara kalian merasakan keganasan sebagian yang lain) ', maka Rasulullah bersabda: \"Perpecahan dan keganasan konflik ini lebih ringan, atau beliau katakan 'lebih remeh",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7314,
			"arabicnumber": 7314,
			"text": "Telah menceritakan kepada kami [Asbagh bin Al Faraj] telah menceritakan kepadaku [Ibn Wahb] dari [Yunus] dari [Ibn Syihab] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah], bahwa ada seorang laki-laki arab badui (nomade, primitive) mendatagi Rasulullah shallallahu 'alaihi wasallam dan berujar, \"Isteriku melahirkan bayi hitam pekat dan aku memungkirinya.\" Maka Rasulullah shallallahu 'alaihi wasallam bertanya: \"Bukankah engkau juga mempunyai unta?\" Ia menjawab, \"Benar.\" Nabi bertanya lagi: \"Lalu, apa warnanya? ' Ia menjawab, \"Merah.\" Nabi bertanya lagi: \"Bukankah di sana juga ada belang kecoklatan?\" Si arab badui menjawab, \"Betul, di sana ada belang warna coklat.\" Nabi bertanya lagi: \"Lantas dari mana warna itu datang?\" Si arab badui menjawab, \"Boleh jadi akar keturunan yang menurunkan warna itu, dan tidak memberi ruang untuk meniadakannya sama sekali",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7315,
			"arabicnumber": 7315,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibn Abbas], bahwa seorang wanita menemui Nabi shallallahu 'alaihi wasallam dan berujar, \"Ibuku bernadzar untuk haji, hanya terburu meninggal dunia, bolehkah aku menggantikan hajinya?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Silahkan, berhajilah engkau untuk menggantikannya, bukankah engkau sependapat sekiranya ibumu mempunyai hutang, bukankah engkau yang melunasi?\" Wanita itu menjawab, \"Ya.\" Lantas Nabi berkata: \"Penuhilah hutang Allah, sebab Allah lebih berhak untuk dilunasi hutangnya",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7316,
			"arabicnumber": 7316,
			"text": "Telah menceritakan kepada kami [Syihab bin Ubbad] telah menceritakan kepada kami [Ibrahim bin Humaid] dari [Ismail] dari [Qais] dari ['Abdullah] mengatakan, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh dengki kecuali dalam dua hal; Seseorang yang Allah beri harta, lantas ia mengelola perbelanjaannya dalam rangka kebenaran, dan seseorang yang Allah beri hikmah (ilmu) kemudian ia pergunakan untuk memutuskan masalah dan ia ajarkan",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7318,
			"arabicnumber": 7318,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7319,
			"arabicnumber": 7319,
			"text": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Ibn Abu Dzi'b] dari [Al Maqburi] dari [Abu Hurairah] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam bersabda: \"Hari kiamat tak bakalan terjadi hingga umatku meniru generasi-generasi sebelumnya, sejengkal demi sejengkal, sehasta demi sehasta.\" Ditanyakan, \"Wahai Rasulullah, seperti Persi dan Romawi?\" Nabi menjawab: \"Manusia mana lagi selain mereka itu?",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7320,
			"arabicnumber": 7320,
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdul Aziz] telah menceritakan kepada kami [Abu Umar Ash Shan'ani] dari Yaman dari [Zaid bin Aslam] dari ['Atha bin Yasar] dari [Abu Sa'id Al Khudzri] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sungguh, engkau akan mengikuti tradisi orang-orang sebelum kalian, sehasta demi sehasta, sejengkal demi sejengkal, hingga kalaulah mereka masuk liang biawak, niscaya kalian mengikuti mereka.\" Kami bertanya, \"Wahai Rasulullah, Yahudi dan nasranikah?\" Nabi menjawab: \"Siapa lagi kalau bukan mereka?",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7321,
			"arabicnumber": 7321,
			"text": "Telah menceritakan kepada kami [Al Humaidi] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Al A'masy] dari ['Abdullah bin Murrah] dari [Masruq] dari [Abdullah] mengatakan, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang dibantai secara zhalim, selain anak Adam pertama turut menanggung dosanya.\" Adakalanya Sufyan menyebutkan dengan redaksi, \"Menanggung dosa darah yang ditumpahkan, sebab dialah yang pertama-tama melakukannya",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7322,
			"arabicnumber": 7322,
			"text": "Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah as Salmi], bahwa seorang arab badui berbaiat kepada Rasulullah shallallahu 'alaihi wasallam untuk Islam, lantas si arab badui terkena demam di Madinah, sehingga ia menemui Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, tolong batalkanlah baiatku, \" namun Rasulullah enggan. Kemudian ia mendatangi beliau lagi dan berkata, \"Tolong batalkanlah baiatku!\" Namun Rasulullah tetap enggan. Kemudian ia datang lagi untuk kali ketiga dan berkata, \"Tolong batalkanlah baiatku.\" Namun Rasulullah menolak, lantas Rasulullah shallallahu 'alaihi wasallam bersabda: \"Madinah itu bagaikan mesin tungku api, ia membersihkan karat-karat (besi) dan menyaring yang baik-baik saja",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7323,
			"arabicnumber": 7323,
			"text": "Telah menceritakan kepada kami [Musa bin Ismail] telah menceritakan kepada kami [Abdul Wahid] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ubaidullah bin Abdullah] berkata, telah menceritakan kepadaku [Ibn Abbas] radliallahu 'anhu, ia berkata, \"Dahulu aku membacakan Abdurrahman bin Auf. Dikala [Umar] melakukan haji yang terakhir kalinya, Abdurrahman berkata di Mina, \"Sekiranya saja engkau melihat Amirul Mukminin ketika didatangi seseorang yang berkata, si A berkata, 'Kalaulah Amirul Mukminin meninggal, niscaya aku berbaiat kepada si fulan dan si fulan.\" Lantas Umar berkata, \"Niscaya sore ini aku berdiri memberi peringatan orang-orang yang ingin merebut wewenang mereka.\" Abdurrahman berkata, \"Hai, jangan kau lakukan! Sebab musim haji ini menghimpun para pemimpin manusia yang memenuhi majlismu!\" Maka aku khawatir jangan-jangan mereka tidak menggunakan saranmu sesuai tempatnya sehingga mereka tafsirkan tidak tepat sasaran, maka tangguhkan saja hingga Madinah menjadi tempat hijrah dan tempat yang aman, serta dipenuhi oleh sahabat-sahabat Rasulullah shallallahu 'alaihi wasallam dari muhajirin dan Anshar. Kemudian mereka menjaga saran-saranmu dan menafsirkannya sesuai tempatnya.\" Lantas Ibn Abbas berkata, \"Demi Allah, sungguh aku berdiri bersamanya di awal-awal aku berdiri bersamanya di Madinah Munawwarah.\" Ibn Abbas melanjutkan, \"Lantas kami tiba di Madinah, dan ia katakan, \"Allah telah mengutus Muhammad shallallahu 'alaihi wasallam dengan membawa kebenaran dan menurunkan al Kitab bersamanya, yang diantara ayat yang diturunkan adalah ayat rajam",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7324,
			"arabicnumber": 7324,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Muhammad] berkata, \"Pernah kami berada di sisi [Abu Hurairah] yang saat itu mengenakan dua kain kapas yang sudah rombeng (koyak), \"Bakh..bakh (ungkapan karena senang), Abu Hurairah berbajukan kain wool?\" padahal aku pernah tersungkur antara mimbar Rasulullah shallallahu 'alaihi wasallam hingga kamar Aisyah dengan setengah pingsan, lantas ada seseorang datang dan meletakkan kakinya di tengkuknya, terlihat aku seolah-olah gila, padahal aku tidak gila, hanya karena aku sangat kelaparan",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7325,
			"arabicnumber": 7325,
			"text": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Abdurrahman bin Abbas] berkata, \" [Ibn Abbas] pernah ditanya 'Apakah engkau pernah menghadiri shalat 'ied bersama Rasulullah shallallahu 'alaihi wasallam? ' ia menjawab, 'Benar, kalaulah bukan karena kedudukanku di sisi beliau, sungguh aku tak mungkin bisa menghadirinya semenjak kecil. Beliau mendatangi 'alam (tanda batas shalat) di perkampungan Katsir bin Shalt, kemudian beliau shalat, lalu berkhutbah.\" -Ibnu Abbas tidak menyebut-nyebut adzan dan tidak pula iqamat- Kemudian beliau perintahkan untuk bersedekah, sehingga para wanita melepaskan anting-anting yang berada di telinga mereka dan kalung yang berada di leher mereka, sementara Bilal mendatangi mereka untuk mengambil barang-barang itu, kemudian ia kembali menemui nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7326,
			"arabicnumber": 7326,
			"text": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Dinar] dari [Ibn Umar] radliallahu 'anhua, bahwa Nabi shallallahu 'alaihi wasallam pernah mendatangi Quba dengan berjalan kaki dan berkendaraan",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7328,
			"arabicnumber": 7328,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7329,
			"arabicnumber": 7329,
			"text": "Telah menceritakan kepada kami [Ayyub bin Sulaiman] telah menceritakan kepada kami [Abu Bakar bin Abu Uwais] dari [Sulaiman bin Bilal] dari [Shalih bin Kisan], [Ibn Syihab] berkata, [Anas bin Malik] mengabarkan kepadaku, bahwasanya Rasulullah shallallahu 'alaihi wasallam shalat 'ashar, (selesai shalat) beliau mendatangi 'Awali sementara matahari masih meninggi.\" Dan [Al Laits] menambahkan dari [Yunus] 'dan jarak 'Awali empat atau tiga mil",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7330,
			"arabicnumber": 7330,
			"text": "Telah menceritakan kepada kami ['Amru bin Zurarah] telah menceritakan kepada kami [Alqasim bin Malik] dari [Al Ju'aid] aku mendengar [As Saib bin Yazid] berkata, \"Satu sha' di jaman Nabi shallallahu 'alaihi wasallam adalah satu mud lebih sepertiga (mud kalian) hari ini, dan bahkan terkadang ditambahi lagi.\" Alqasim bin Malik mendengar dari Ju'aid",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7331,
			"arabicnumber": 7331,
			"text": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam pernah memanjatkan doa: \"Ya Allah, berilah barakah bagi mereka dalam takaran mereka, juga berkahilah mereka dalam sha' dan mud mereka, \" maksudnya bagi penduduk Madinah",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7332,
			"arabicnumber": 7332,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7333,
			"arabicnumber": 7333,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7334,
			"arabicnumber": 7334,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7335,
			"arabicnumber": 7335,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7336,
			"arabicnumber": 7336,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7337,
			"arabicnumber": 7337,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7338,
			"arabicnumber": 7338,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7339,
			"arabicnumber": 7339,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7341,
			"arabicnumber": 7341,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7342,
			"arabicnumber": 7342,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7343,
			"arabicnumber": 7343,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7344,
			"arabicnumber": 7344,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7345,
			"arabicnumber": 7345,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7346,
			"arabicnumber": 7346,
			"text": "Telah menceritakan kepada kami [Ahmad bin Muhammad] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibn Umar] ia mendengar nabi shallallahu 'alaihi wasallam berdoa ketika shalat fajar dan ketika mengangkat kepalanya dari rukuk: 'ALLAAHUMMA RABBANAA WALAKAL HAMDU (Ya Allah rabb kami, bagi-Mu segala puji) ', itu beliau ucapkan pada rukuk terakhir. Kemudian beliau berdoa: 'ALLAAHUMMA IL 'AN FULAANAN WAFULAANAN (Ya Allah, laknatlah si A dan si B) '. Lantas Allah menurunkan ayat: '(Sama sekali engkau tidak mempunyai wewenang terhadap urusan mereka itu, Allah mengampuni mereka atau menyiksa mereka, sebab mereka adalah orang-orang yang zhalim) ' (Qs. Ali'Imran: 128)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7347,
			"arabicnumber": 7347,
			"text": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Azzuhri]. (dalam jalur lain disebutkan) telah menceritakan kepadaku [Muhammad bin Salam] Telah mengabarkan kepada kami ['Attab bin Basyir] dari [Ishaq] dari [Azzuhri] telah mengabarkan kepadaku [Ali bin Husain] bahwa [Husain bin Ali] radliyallahu'anhuma mengabarkan kepadanya, bahwa [Ali bin Abu Thalib] berkata, \"Rasulullah Shallallahu'alaihiwasallam membangunkannya di malam hari, dan juga beliau bangunkan Fatimah binti Rasulullah Shallallahu'alaihiwasallam, beliau berkata kepada mereka: \"Tidak sebaiknyakah kalian mendirikan shalat? Kata Ali, kujawab \"Wahai Rasulullah, jiwa kita ada di tangan Arrahman, kalaulah Dia berkenan membangunkan kita niscaya Dia membangunkan.\" Lantas Rasulullah Shallallahu'alaihiwasallam pergi ketika Ali menjawab sedemikian ini, dan sama sekali tidak kembali lagi, kemudian Ali mendengar Nabi membaca sebuah ayat ketika kembali sambil menepuk pahanya, ayat yang beliau baca: '(Sungguh manusia itu makhluk yang suka membantah (QS. Al Kahfi; 54). Abu Abdullah berkata; apa saja yang datang kepadamu malam hari, diistilahkan dengan Ath thariq. Istilah Ath Thariq juga diperuntukan untuk bintang, sedang atsaqib maknanya yang bercahaya atau menyala, seperti perkataan atsqib naaroka (nyalakan apimu)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7348,
			"arabicnumber": 7348,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al laits] dari [Sa'id] dari [ayahnya] dari [Abu Hurairah] berkata, ketika kami di sebuah masjid, Rasulullah Shallallahu'alaihiwasallam datang dan bersabda: 'Berangkatlah kalian menuju kaum yahudi.\" Maka kami berangkat bersama beliau hingga kami tiba di Baitul madras. Nabi shallallahu 'alaihi wasallam berdiri dan menyeru mereka seraya berkata: \"Wahai segenap yahudi, masuk Islamlah kalian niscaya kalian selamat.\" Mereka menjawab, 'Telah engkau sampaikan wahai Abul qasim.' Rasulullah Shallallahu'alaihiwasallam kembali menyeru mereka seraya berkata: 'Yang kuimpikan, masuk Islamlah kalian, niscaya kalian selamat.' Namun mereka menjawab sama, 'Telah engkau sampaikan wahai Abul qasim.' Rasulullah Shallallahu'alaihiwasallam kembali menyeru mereka: 'Yang saya inginkan ialah….dan seterusnya. (beliau ulang tiga kali), hingga kali keempat beliau sabdakan: 'Ketahuilah, bahwasanya bumi adalah milik Allah dan rasul-Nya, dan sungguh saya akan mengusir kalian dari bumi ini, maka barangsiapa diantara kalian bisa menemukan sesuatu dari hartanya, juallah, kalaulah tidak, ketahuilah bahwa bumi adalah milik Allah dan rasul-Nya",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7349,
			"arabicnumber": 7349,
			"text": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada kami [Abu Shalih] dari [Abu Sa'id alkhudzri] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Nabi Nuh didatangkan pada hari kiamat lantas ditanya, 'Sudahkah kamu menyampaikan? ' ia menjawab, 'Benar ya Rabbi'. Ummatnya kemudian ditanya, 'Apakah dia memang benar telah menyampaikan kepada kalian? ' Mereka menjawab, 'Belum ada seorang pemberi peringatan kepada kita.' Lantas Allah bertanya lagi: 'Siapa yang menjadi saksimu? ' Nuh menjawab, 'Muhammad dan umatnya.' Lantas kalian didatangkan dan kalian bersaksi.\" Kemudian Rasulullah Shallallahu'alaihiwasallam membaca ayat: '(Dan demikianlah Kami jadikan kalian umat yang wasath) ' (Qs. Albaqarah 143). Kata Al A'masy, wasath artinya adil '(Agar kalian menjadi saksi atas semua manusia dan agar rasul sebagai saksi atas kalian) ' (Qs. Albaqarah 143). Dan dari [Ja'far bin Aun] telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Sa'id alkhudzri] dari Nabi shallallahu 'alaihi wasallam dengan ini",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7351,
			"arabicnumber": 7351,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7352,
			"arabicnumber": 7352,
			"text": "Telah menceritakan kepada kami [Abdullah bin Yazid almuqri' almakki] telah menceritakan kepada kami [Haiwa bin Syuraikh] telah menceritakan kepadaku [Yazid bin Abdullah bin Al Had] dari [Muhammad bin Ibrahim bin Alharits] dari [Busr bin Sa'id] dari [Abu Qais] mantan budak Amru bin 'Ash, dari ['Amru bin 'ash] ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang hakim mengadili dan berijtihad, kemudian ijtihadnya benar, maka ia mendapat dua pahala, dan jika seorang hakim berijtihad, lantas ijtihadnya salah (meleset), baginya dua pahala.\" Kata 'Amru, 'Maka aku ceritakan hadis ini kepada [Abu Bakar bin Amru bin Hazm], dan ia berkata, 'Beginilah [Abu Salamah bin Abdurrahman] mengabarkan kepadaku dari [Abu Hurairah]. Dan [Abdul 'Aziz bin Al Muththalib] dari [Abdullah bin Abu Bakar] dari [Abu Salamah] dari Nabi shallallahu 'alaihi wasallam Shallallahu'alaihiwa sallam semisalnya",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7353,
			"arabicnumber": 7353,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] telah menceritakan kepadaku ['Atha] dari ['Ubaid bin Umair] berkata, \" [Abu Musa] meminta ijin Umar, lantas ia temukan seolah-olah Umar sangat sibuk sehingga Abu musa pulang. Maka Umar berkata, 'Tidakkah aku mendengar suara Abdullah bin Qais? Tolong berilah dia ijin (masuk).' Lantas Abdullah pun diundang. Kata Umar, 'Apa yang mendorongmu melakukan yang kau lakukan? ' Abdullah menjawab, 'Kami diperintahkan yang demikian.' Umar berkata, 'Berilah aku bukti atau aku akan mengerjaimu! ' Lantas Abdullah bertolak ke sebuah majlis anshar, lalu mereka katakan, 'Tidak ada yang bersaksi selain anak-anak muda kami! Lantas [Abu Sa'id alkhudzri] datang dan bersaksi, 'Kami diperintah demikian.' Lantas Umar berkata, 'Sayang, saya tidak mendapat penjelasan yang jelas dari tuntunan Nabi shallallahu 'alaihi wasallam dalam hal ini, aku dilalaikan oleh bisnisku di pasar",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7354,
			"arabicnumber": 7354,
			"text": "Telah menceritakan kepada kami [Ali] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Azzuhri] ia mendengarnya dari [Al A'raj] berkata, [Abu Hurairah] mengabarkan kepadaku, ia berkata, \"Kalian beranggapan bahwa Abu hurairah (maksudnya dirinya sendiri) banyak meriwayatkan hadis dari Rasulullah Shallallahu'alaihiwasallam dan Allah sajalah yang memberi janji, aku adalah seorang miskin yang selalu menyertai Rasulullah Shallallahu'alaihiwasallam dengan perut cukup berisi makanan pokok saja, kaum muhajirin selalu disibukkan oleh perdagangan di pasar-pasar sedang orang anshar disibukan oleh pengelolaan hartanya, maka suatu hari kusaksikan Rasulullah Shallallahu'alaihiwasallam bersabda: 'Siapa yang mau membentangkan kainnya hingga aku menuntaskan ucapanku kemudian ia menggenggamnya dan tidak akan pernah lupa terhadap sesuatu yang ia dengarkan dariku? ' Spontan aku hamparkan kain yang ada padaku, Demi Dzat yang mengutusnya dengan kebenaran, aku tak pernah lagi melupakan suatupun yang aku dengar darinya",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7355,
			"arabicnumber": 7355,
			"text": "Telah menceritakan kepada kami [Hammad bin Humaid] telah menceritakan kepada kami ['Ubaidullah bin Mu'adz] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Syu'bah] dari [Sa'd bin Ibrahim] dari [Muhammad bin Al Munkadir] berkata, 'Pernah aku melihat [Jabir bin Abdullah] bersumpah dengan nama Allah bahwa Ibnu Shaid adalah dajjal. Maka saya katakan, 'Engkau bersumpah atas nama Allah? ' ia jawab, 'Saya mendengar Umar bersumpah atas yang demikian disisi Nabi shallallahu 'alaihi wasallam, dan beliau Shallallahu'alaihiwasallam tidak memungkirinya",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7356,
			"arabicnumber": 7356,
			"text": "Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari [Zaid bin Aslam] dari [Abu Shalih assiman] dari [Abu Hurairah] radliyallahu'anhu, bahwa Rasulullah Shallallahu'alaihiwasallam berkata: 'Kuda itu bagi tiga orang; bagi orang pertama mendatangkan pahala, bagi orang kedua sebagai penutup (penyelesaian, solusi), dan bagi orang ketiga mendatangkan dosa. Adapun kuda yang mendatang pahala adalah seseorang yang menambatkan kudanya di jalan Allah, lantas ia gembalakan kudanya di rerumputan luas atau kebun, maka segala yang dimakan kuda itu di padang gembalaan, baik kebun atau rerumputan luas selain tercatat sebagai kebaikan baginya, dan sekiranya kuda itu mengarungi padang gembalaan, lantas dia melangkah satu atau dua langkah, maka bekas dan kotorannya juga terhitung kebaikan baginya, dan sekiranya kuda itu melewati sungai dan meminumnya, padahal si pemilik tidak berniat memberinya minuman, maka itu terhitung kebaikan baginya, kesemuanya itu terhitung ganjaran baginya. Kuda kedua, adalah seseorang yang mengikatnya untuk mencari penghasilan dan untuk menjaga kehormatan diri, sedang ia tidak melupakan hak Allah terhadap ikatannya dan tidak pula terhadap punggungnya, maka kuda itu sebagai penyelesaian baginya. Adapun kuda ketiga adalah, seseorang yang mengikatnya untuk sekedar kebanggaan dan pamer, maka itu adalah bosa baginya. Dan Rasulullah Shallallahu'alaihiwasallam pernah ditanya tentang keledai. Maka beliau hanya menjawab: 'Allah tidak menurunkan kepadaku tentangnya selain satu ayat yang ringkas ini: '(Barangsiapa yang beramal kebaikan seberat biji atom, maka Allah akan melihatnya, sebaliknya barangsiapa yang beramal seberat biji atom keburukan, pasti ia melihatnya) ' (Qs. Al Zalzalah: 7-8)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7357,
			"arabicnumber": 7357,
			"text": "Telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Ibnu Uyainah] dari [Manshur bin Shafiyah] dari [Ibunya] dari [Aisyah] bahwa, ada seorang wanita bertanya Nabi shallallahu 'alaihi wasallam Shallallahu'alaihiwasallam -lewat jalur periwayatan lain-Dan telah menceritakan kepada kami [Muhammad] -yaitu Ibnu Uqbah- telah menceritakan kepada kami [Al Fudlail bin Sulaiman An Numairi Al Bashri] telah menceritakan kepada kami [Manshur bin Abdurrahman Ibn Syaibah] telah menceritakan kepadaku [Ibuku] dari [Aisyah] radliyallahu'anha, ada seorang wanita bertanya Nabi shallallahu 'alaihi wasallam tentang haidl, bagaimana ia harus mandi karena haidl? Nabi menjawab: 'Hendaklah kau ambil sepotong kapas, lantas kau berwudlu dengannya.' Wanita itu bertanya, 'Bagaimana aku berwudlu dengan kapas itu wahai Rasulullah? ' Nabi shallallahu 'alaihi wasallam menjawab: 'Berwudlulah.' Si wanita terus bertanya, 'Bagaimana aku harus berwudlu dengan kapas itu ya Rasulullah? Nabi shallallahu 'alaihi wasallam menjawab: 'Berwudlulah.' Si wanita terus bertanya, 'Bagaimana aku harus berwudlu dengan kapas itu ya Rasulullah? ' Maka Aisyah pun berkata, 'Aku mengerti yang Rasulullah maksudkan, sehingga kutarik wanita itu dan kuajari",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7358,
			"arabicnumber": 7358,
			"text": "Telah menceritakan kepada kami [Musa bin Ismail] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibn Abbas], bahwa Ummu Hufaid binti Al Harits bin Hazin menghadiahi Nabi shallallahu 'alaihi wasallam berupa minyak samin, keju dan daging biawak. Kemudian Nabi shallallahu 'alaihi wasallam mengundang para sahabat untuk menyantap makanan itu, dan makanan itu disantap diatas meja makannya, sedang Nabi shallallahu 'alaihi wasallam meninggalkannya seolah-olah merasa jijik, kalaulah makanan itu diharamkan, niscaya tidak dimakan diatas meja makannya dan tidak pula menyuruh untuk menyantapnya",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 7359,
			"arabicnumber": 7359,
			"text": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibn Wahb] telah menceritakan kepadaku [Yunus] dari [Ibn Syihab] telah menceritakan kepadaku ['Atha bin Abu Rabah] dari [Jabir bin Abdullah] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa makan bawang merah atau bawang putih, hendaklah menyingkir dari kami --atau dengan redaksi 'agar dia menyingkiri- masjid kami, dan duduklah di rumahnya.\" Pernah dalam perang badar beliau diberi hidangan yang berisi sayur-mayur, berupa kubis, dan beliau temukan mempunyai bau. Maka Nabi menanyakan perihal sayuran itu, dan dikabarkan bahwa sayuran itu diantaranya ada kubis. Beliau lantas bersabda: \"Coba tolong dekatkan!\" Lantas mereka pun mendekatkannya kepada beberapa sahabatnya yang ikut bersama beliau. Tatkala beliau melihatnya, beliau merasa risih memakannya dan bersabda: \"Saya menjauhi santapan yang kalian tidak menjauhinya.\" Sedang [Ibnu Ufair] dari [Ibnu Wahb] berkata dengan redaksi 'didatangkan kepada beliau periuk berisi kubis', dan [Al Laits] dan [Abu Shafwan] tidak menyebutkan dari [Yunus] tentang kisah periuk, maka aku tidak tahu apakah itu ucapan [Azzuhri] atau termasuk bagian hadis",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7360,
			"arabicnumber": 7360,
			"text": "Telah menceritakan kepadaku [Ubaidullah bin Sa'd bin Ibrahim] telah menceritakan kepada kami [Ayahku] dan [pamanku] berkata telah menceritakan kepada kami [Ayahku] dari [Ayahnya] telah menceritakan kepadaku [Muhammad bin Jubair] bahwa bapaknya [Jubair bin Muth'im] mengabarkan kepadanya, bahwa seorang wanita menemui Rasulullah Shallallahu'alaihiwasallam dan mengajak beliau bicara tentang sesuatu. Lantas si wanita tadi berkata, 'Menurut anda bagaimana ya rasulullah sekiranya aku datang lagi namun tidak bertemu dengan baginda? ' Nabi menjawab: \"Kalaulah engkau tidak menemuiku, temuilah Abu Bakar.\" [Al Humaidi] menambahkan untuk kami dari [Ibrahim bin sa'd] yang wanita maksudkan, adalah, sekiranya ia temukan nabi telah wafat",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7361,
			"arabicnumber": 7361,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7362,
			"arabicnumber": 7362,
			"text": "Telah menceritakan kepadaku [Muhammad bin Basyar] telah menceritakan kepada kami [Usman bin Umar] telah mengabarkan kepada kami [Ali bin Al Mubarak] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Hurairah] berkata, 'Ahli kitab membaca Taurat dengan bahasa ibrani dan menafsirkannya dengan bahasa arab untuk pemeluk Islam! Spontan Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jangan kalian benarkan ahli kitab, dan jangan pula kalian mendustakannya, dan katakan saja '(Kami beriman kepada Allah, dan apa yang diturunkan kepada kami dan yang diturunkan kepadamu)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7363,
			"arabicnumber": 7363,
			"text": "Telah menceritakan kepada kami [Musa bin Ismail] telah menceritakan kepada kami [Ibrahim] telah mengabarkan kepada kami [Ibn Syihab] dari ['Ubaidullah bin Abdullah] bahwa [Ibn Abbas] radliyallahu'anhuma berkata, \"Bagaimana kalian bertanya ahli kitab padahal kitab kalian yang diturunkan kepada Rasulullah shallallahu 'alaihi wasallam lebih baru kemurniannya dan belum terkotori? Sedang ahlu kitab menceritakan kepada kalian dengan mengubah-ubah kitabullah dan menggantinya, dan mereka tulis alkitab dengan tangannya dan mereka katakan, 'Ini dari sisi Allah' untuk mereka tukar dengan harga yang sedikit, tidak sebaiknyakah ilmu yang yang kalian miliki mencegah kalian dari bertanya kepada mereka? Tidak, demi Allah, takkan kulihat lagi seseorang diantara mereka bertanya kalian tentang yang diturunkan kepada kalian",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7364,
			"arabicnumber": 7364,
			"text": "Telah menceritakan kepada kami [Ishaq] Telah mengabarkan kepada kami [Abdurrahman bin Mahdi] dari [Sallam bin Abu Muthi'] dari [Abu'Imran Al Jauni] dari [Jundab bin Abdullah Al Bajali] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bacalah alquran selama menjadikan hati kalian bersatu padu, namun jika kalian berselisih, tinggalkanlah.\" Abu Abdullah berkata, 'Abdurrahman mendengar Sallam (bukan sekedar dari)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7365,
			"arabicnumber": 7365,
			"text": "Telah menceritakan kepada kami [Ishaq] telah mengabarkan kepada kami [Abdushshamad] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Abu 'Imran Al Jauni] dari [Jundab bin Abdullah] bahwa Rasulullah Shallallahu'alaihiwasallam bersabda: \"Bacalah alquran, selama menjadikan hati kalian bersatu padu, namun jika kalian berselisih, tinggalkanlah.\" Abu Abdullah berkata, [Yazid bin harun] berkata dari [Harun Al Al'war] telah menceritakan kepada kami [Abu Imran] dari [Jundab] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7366,
			"arabicnumber": 7366,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Hisyam] dari [Ma'mar] dari [Azzuhri] dari ['Ubaidullah bin Abdullah] dari [Ibn Abbas] berkata, \"Dikala Nabi shallallahu 'alaihi wasallam menjelang wafat, yang ketika itu di rumah nabi ada beberapa pemuka yang diantaranya Ummar bin Khattab, beliau berkata: 'Kesinilah, saya tuliskan untuk kalian tulisan yang sekali-kali kalian tidak bisa sesat selama-lamanya.' Umar berkata, 'Nabi shallallahu 'alaihi wasallam menderita kesakitan dan di sisi kalian ada alquran, maka cukuplah bagi kita kitabullah.' Ahlul bait menjadi berselisih dan bersengketa, di antaranya ada yang berkata 'Tolong kalian mendekatlah sehingga Rasulullah Shallallahu'alaihiwasallam bisa menuliskan tulisan untuk kalian yang sekali-kali kalian tak akan tersesat selama-lamanya.' Di antara mereka ada yang berpendapat sebagaimana ucapan Umar. Tatkala suara mereka semakin gaduh dan perselisihan semakin kencang di sisi Nabi shallallahu 'alaihi wasallam, Nabi berkata: 'Menyingkirlah kalian dariku! ' Ubaidullah berkata, 'Ibn Abbas berkata, 'Bencana dari segala bencana adalah yang menghalangi Rasulullah Shallallahu'alaihiwasallam untuk menulis catatan bagi mereka, karena mereka berselisih dan membuat kegaduhan",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7367,
			"arabicnumber": 7367,
			"text": "Telah menceritakan kepada kami [Al Makki bin Ibrahim] dari [Ibn Juraij], ['Atha'] berkata, [Jabir] berkata, Abu Abdullah berkata, [Muhammad bin bakar Al Bursani] berkata, telah menceritakan kepada kami [Ibn Juraij] berkata, telah mengabarkan kepadaku ['Atha'] aku mendengar [Jabir bin Abdullah] di tengah-tenghah manusia yang bersamanya berkata, 'Kami para sahabat Rasulullah Shallallahu'alaihiwasallam bertalbiyah dan berniyat haji semata tanpa disertai Umrah.' Kata 'Atha, \"Jabir berkata, \"Lantas Nabi shallallahu 'alaihi wasallam tiba pada waktu subuh hari keempat bulan Dzulhijjah, tatkala kami tiba, Rasulullah Shallallahu'alaihiwasallam memerintahkan kami untuk bertahallul. Beliau sabdakan: 'Bertahallullah kalian, dan gilirlah isteri-isteri kalian! 'Atha berkata, \"Jabir berkata, \"Nabi tidak mewajibkan atas mereka, hanya menghalalkan isteri-isteri itu untuk dikumpuli, kemudian Jabir pun mengabarkannya. Kami katakan, ketika itu jarak antara kami dan Arafah selain hanya lima, dan beliau perintahkan kami untuk bertahallul hingga isteri-isteri kami, lantas kami datangi Arafah sedang kemaluan kami meneteskan madzi.' Kata 'Atha, \"Jabir berkata, 'Demikian' sambil ia gerakkan tangannya. Lantas Rasulullah Shallallahu'alaihiwasallam berdiri dan bersabda: 'Kalian tahu bahwa aku adalah orang yang paling bertakwa diantara kalian dan paling jujur, paling baik, kalaulah bukan karena hewan sembelihanku, niscaya aku telah bertahallul sebagaimana kalian lakukan, maka bertahallullah kalian, kalaulah aku bisa mengulang kembali kejadian yang telah lewat, niscaya aku tidak membawa sembelihan.' Kami pun bertahallul, mendengar dan taat",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 7368,
			"arabicnumber": 7368,
			"text": "Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami [Abdul Warits] dari [Al Husain] dari [Ibn Buraidah] telah menceritakan kepadaku [Abdullah Al Muzanni] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Shalatlah kalian sebelum maghrib, shalatlah kalian sebelum maghrib, \" pada kali ketiga beliau katakan: \"Bagi siapa yang ingin, \" yang demikian karena beliau khawatir jangan-jangan manusia menjadikannya sunnah",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 7369,
			"arabicnumber": 7369,
			"text": "Telah menceritakan kepada kami [Al Uwaisi Abdul Aziz bin Abdullah] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Sahlih] dari [Ibn Syihab] telah menceritakan kepadaku ['Urwah] dan [Ibnul Musayyab] dan [Alqamah bin Waqqash] dan ['Ubaidullah] dari ['Aisyah] radliyallahu'anha, bahwa ketika orang-orang yang menyebarkan berita bohong melakukan aksinya, Aisyah berkata, \"Rasulullah Shallallahu'alaihiwasallam lantas memanggil Ali bin Abu Thalib dan Usamah bin Yazid radliyallahu'anhum, yakni saat wahyu belum turun, beliau menanyai dan meminta saran keduanya perihal perceraian terhadap isterinya. Adapun Usamah bin Zaid, ia memberi saran sejauh yang ia ketahui bahwa Aisyah terlepas diri dari apa yang mereka tuduhkan, adapun Ali bin Abu Thalib berkata, 'Allah tak bakalan menyesakkan dadamu, wanita selainnya juga masih banyak, dan tanyailah pembantu yang bisa jadi ia membenarkanmu.' Nabi bertanya kepada hamba sahaya tadi: \"Pernahkah kau lihat sesuatu yang menjadikanmu ragu terhadap diri Aisyah?\" hamba sahaya tadi menjawab, \"Belum pernah kulihat sesuatu yang kurang pada diri Aisyah selain tak lebih ketika ia masih masih belia, ia ketiduran dari adonan masakan keluarganya sehingga datang ternak yang kemudian menyantapnya.' Lantas Nabi berdiri di atas minbar dan berkata: \"Wahai segenap muslimin, siapa yang bisa memberiku alasan terhadap seseorang yang gangguannya terhadap isteriku telah kudengar? Demi Allah, aku tak tahu terhadap isteriku selain kebaikan semata, \" lantas beliau sebutkan kesucian Aisyah. Dan [Abu Usamah] berkata 'dari [Hisyam]",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 7370,
			"arabicnumber": 7370,
			"text": "Telah menceritakan kepadaku [Muhammad bin Harb] telah menceritakan kepada kami [Yahya bin Abu Zakariya Al Ghassani] dari [Hisyam] dari ['Urwah] dari ['Aisyah] bahwa Rasulullah Shallallahu'alaihiwasallam berpidato kepada manusia, lantas memuja dan memuji Allah dan bersabda: \"Kalian tidak bisa memberiku alasan terhadap seseorang yang mencela isteriku, setahuku tak ada keburukan pada mereka sama sekali.\" Dan 'Urwah berkata, 'Dikala 'Aisyah dikabarkan selingkuh, ia berkata, 'Wahai Rasulullah, bersediakah engkau jika aku kembali kepada keluargaku? Maka Rasul memberinya ijin dan mengutus pelayan untuk menemaninya. Dan seorang laki-laki anshar berkata, 'Maha suci Engkau, tak sepantasnya kami berkata yang sedemikian ini. Maha suci Engkau, ini adalah kebohongan yang nyata",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 97
			}
		}
	]
}